{
	"title": "忙师说中国   Mxwang's China",
	"description": "中国介绍China Introduction",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1503757422,
	"post": [
		{
			"post_id": 13,
			"title": "中国核电站装备工业进展 Progress of Equipment Industry for Nuclear Power Plants in China",
			"date_published": 1503756905.018,
			"body": "一、常识 \n\n核电站分两部分：核岛和常规岛。 \n\n核岛包括反应堆装置和一回路系统，就是核燃料在反应堆内产生的衰变能，以热能的形式出现，它经过冷却剂的载带和转换，最终把水加热变成蒸汽，驱动常规岛的涡轮发电机组发电。所以常规岛主要是汽轮发电机系统。常规岛技术我们很成熟，因为中国早就是世界第一的发电设备制造大国和强国。 \n\n核岛除了关键设备核反应堆外，还有许多与之配合的重要设备。以压水堆核电站为例，它们是主泵，稳压器，蒸汽发生器，安全壳。 \n\n核岛技术我们是最近3年才获得完全突破。核岛里面最关键的技术就是高压容器制造技术，例如负责供蒸汽和换热的蒸汽发生器、主管（高压钢管）和主泵（高压泵）。 \n\n其中我们在30年内都一直不能突破的技术就是主泵和主管道制造技术，在2011年以前，全部必须依赖进口，受制于人。因为核岛里面的东西以后是无法检修的，这些钢管装下去就一直到他们报废都要安全运行，一般至少50年不出故障，一旦出问题，就是核泄漏，是大事故，所以技术可靠性和工艺稳定性都是变态的要求。所以这一直是核工业的最核心技术，没有任何国家和跨国企业允许转让，所以只能自力更生。 \n\n二、心酸史 \n\n中国核电站建设史在2011年前就是一部心酸史。简单介绍一下。 \n\n我国第一个核电站是80中期到90年代初建设的浙江嘉兴秦山核电站，对内宣传是自行设计制造的国产货，其实关键核心部件全部进口，中国不过是个施工队而已。例如秦山一期30万千瓦反应堆压力容器就是从国外购买的（当时因为被禁运，采取了各种花样来采购，心酸不已），秦山二期60万千瓦反应堆压力容器也是日本三菱重工提供的。再例如核电站主泵，也是国外购买的，主管道也是全部进口。此外反应堆压力容器稳压器、反应堆堆内构件、控制棒驱动机构、核燃料装卸料机等都是国外买来的。 \n\n在这以后，建设了完全由法国人交钥匙工程的两台单机容量为984MWe压水堆反应堆机组的大亚湾核电站，这个电站建设几乎与中国没太大关系，因为所有设备都是法国人制造和采购的，我们只是施工队的民工，连工头都不是。 \n\n90年代，8平方和后中国被西方全面制栽，已经用任何方法都搞不到设备，而且为了拉拢俄罗斯，加深中俄两国政治互信，平衡贸易顺差，不得不引进俄罗斯核电站（这也是两国间迄今最大的技术经济合作项目），这个项目就是江苏连云港田湾一期，2台单机容量106万千瓦的俄罗斯AES-91型压水堆核电机组，设计寿命40年。俄方负责田湾核电站总的技术责任和核岛、常规岛设计及成套设备供应与核电站调试，中方负责工程建设管理、土建施工、围墙内部分设备的第三国采购、电站辅助工程和外围配套工程的设计、设备采购及核电站大部分安装工程。与核电站配套的输变电线路工程和调峰设施，由江苏省电力系统负责建设。 \n\n（从技术设计上看，这个电站还是可以的，例如反应堆厂房采用双层安全壳、安全壳预应力张拉系统采用新型倒U形50束钢缆张拉方式、安全系统采用完全独立和实体隔离的4通道(N+3)、设置堆芯熔融物捕集器与冷却系统等缓解严重事故后果的安全设施、使用铀-钆一体化全锆先进燃料组件、采用全数字化仪控系统等） \n\n田湾核电站1号机组1999年10月浇筑第一罐混凝土，2005年10月18日开始首次装料试车，结果俄罗斯造的核电管下去之后第一次试车就爆了10%，由于核岛里面总共就富余了10%，这是以后整个核电站生命周期里面计划慢慢损失的，这下完蛋了。而且俄罗斯制造的热交换器，蒸汽叶片都出了问题。经过调查，发现解决的技术难度极大，几乎到了俄罗斯技术的上限。 \n\n这就意味着这个电站不但不能满负荷发电，而且还有安全风险。但是设备调试完了，当时业主就要求核安全局批准并网发电，不然损失太大，但核安全局对国务院说自己不敢批。 \n\n田湾一期是项目贷款，用未来电费抵押贷款，涉及多家银团，也包括俄罗斯银团，所以成为政治项目，最后老温一咬牙一跺脚批了并网发电。2007年5月17日正式投入商业运行。如果以后这个电站出了安全问题，老温将死无葬身之地。不过目前看来还好，中国人运气好。 \n\n在这以后，又从法国引进了岭澳核电站。其中工程顾问是EDF（法国电力集团），核岛设备供应是FRAMATOME（法美原子工程建筑公司或法马通公司），常规岛土建设计及设备供应是ALSTOM ABB POWER（ABB阿尔斯通动力公司）。而中国只是劳工，例如土石方工程葛洲坝公司，海工是四航局，核岛/常规岛/BOP（电厂成套设备以外的辅助设设施）土建华兴公司/中建二局，核岛/常规岛/BOP（电厂成套设备以外的辅助设设施）安装是23公司/山东电建/东北电建。 \n\n而一些低附加值设备部件也由法国人分包给我们，例如堆内构件、控制棒驱动机构、蒸发器、稳压器、安注箱、硼注箱、燃料运输系统、蒸汽和给水管道预制、核二级容器、核岛辅助系统热交换器、重部件支撑及压力容器顶盖起吊装置、汽轮机、发电机、汽水分离再热器、冷凝和给水设备等的一些部件。大亚湾的国产化率不到1%。 \n\n不过大亚湾和岭澳百万千瓦级的压水堆核电站在技术上都是上世纪70--80年代的水平，是人家倾销的落后技术。 \n\n小日本也一直在欺负我们。当年我们没有大型锻件能力时，就经常找我们麻烦。例如2005年8月，在我国第三代核电招标期间，日本政府提出了“关于中日核电项目保障监督问题”，提出了对大锻件“全面跟踪、全面保障和违约返还”等要求。经过中日双方多次协商，日方虽放弃了“全面保障和违约返还”，但仍坚持对所谓 “作为副产品回收或产生的特殊裂变材料”的全程跟踪，并以此为由拒绝受理核电大锻件的出口许可申请，例如日本政府以“中日原子能协定的少量补充条款尚未达成一致”为由拒绝了JSW的出口申请，拒绝发放出口许可证，导致我国从日本制钢所（JSW）进口的红沿河一期用大锻件不能发运，延误工期。 \n\n三、最近几年我们的设备进展 \n\n核电站的17项核心设备目前我国都能独立设计和制造。包括： \n\n反应堆压力容器 \n蒸汽发生器 \n稳压器 \n堆内构件 \n控制棒驱动机构 \n主管道 \n环吊 \n装卸料机 \n主泵 \n核二、三级泵 \n核级阀门 \n汽轮机 \n发电机 \n汽水分离再热器 \n海水循环泵 \n冷凝器 \n主控系统 \n\n这17项设备在一个100万千瓦核电站中，至少需要50亿人民币投资（占投资40％左右，自动化系统和仪表占10--15％，辅助系统和设备占40--50％，例如输变电，土建工程，安全工程，环保工程等等）。 \n\n我国核电设备制造以东方、上海和哈尔滨三大发电设备制造集团和第一、第二重型机械制造集团等国有大型企业为主，生产能力约占全国总量的80%左右。 \n\n1、核电站关键机械设备 \n\n其中核电站关键机械设备制造商主要是四川绵阳的东方电气集团，他可以生产蒸发器、控制棒驱动器、汽轮机 、发电机。 \n\n东方电气集团下属的东方锅炉集团完成了能够生产高通量堆设备；大型高温气冷堆氦辅系统等等，已经生产并投入运营的有岭澳100万级核电重型设备的蒸汽发生器、稳压器、安注箱、硼注射箱、常规岛汽轮发电机组部套，岭澳二期PLP包核岛重型设备制造。 \n\n东方电气下属的东方汽轮机厂完成了1000MW核电全转速汽轮机、岭澳常规岛汽轮发电机组部套、汽轮机静止部件和辅助系统设备、高、低压模块总装、部套的机械加工、装备和部套的毛坯准备、汽轮机的总组装。 \n\n东方电机已经承担了我国第一座具有独立自主知识产权的第三代压水堆示范电站装备两台1500兆瓦级大型核能发电机设备生产任务，目前，东方电机已产出核能发电机14台，总容量约为15790兆瓦，成为目前国内产出核能发电机台数最多的电机制造企业。目前东方电机已掌握二代半压水堆1150兆瓦核能汽轮发电机、第三代AP1000压水堆1250兆瓦核能发电机、第三代EPR压水堆1750兆瓦核能发电机制造技术，并正在自主研制CAP1400、ACP1000、模块式小堆ACP100压水堆核能发电机。 \n\n2013年8月24日，东方电机生产出世界最大单机容量核能发电机—台山核电站1号1750兆瓦核能发电机。台山核电站是我国首座、世界第三座采用EPR三代核电技术建设的大型商用核电站，东方电机为台山核电站提供首期全部两台核能发电机，单机容量1750兆瓦。 \n\n另外一个主要生产商是上海电气集团，可以是生产压力容器、蒸发器、控制棒驱动器、汽轮机、发电机。 \n\n哈尔滨电站设备集团公司也能生产核电站汽轮机和发电机。 \n\n目前东方集团具备了年产2.5套百万千瓦级核电主设备能力；哈尔滨电站集团具备年生产2套核电站主要设备的制造能力；上海电气集团具有年生产3套核电主要设备的能力；一重集团也具备每年生产约2套核电主要设备的能力。 \n\n2、核岛核心设备 \n\n（1）、主泵 \n\n主泵是核电站的心脏，在核岛一回路系统中，用于驱动冷却剂在RCP(反应堆冷却剂系统)系统内循环流动的泵称为主泵，主泵连续不断地把堆芯中产生的热量传递给蒸汽发生器二次侧(二回路)给水，是核电运转控制水循环的关键，属于核电站的一级设备，每个蒸汽发生器有一个主泵。 \n\n主泵要求具有绝对的可靠性，在2009年前，是核反应堆中唯一国内制造不了的设备，完全依赖进口，其自主设计和制造是我国推进核电自主化的重点和难点。 \n\n主泵最重要的突破是：2009年12月7日，四川德阳的东方电气完成国内首台百万千瓦核电主泵装机。只有到此时，我们才算真的彻底掌握了第三代核电站建造技术。主泵是核电站核岛主要设备之一，其安全性、可靠性、稳定性要求高，制造难度大，在这以前，百万千瓦级核电主泵必须依靠进口。 \n\n东方电气集团从2001年开始启动了百万千瓦级核电主泵国产化工程。通过引进法国阿海珐技术，八年内逐步完成了吸收、消化核电制造关键技术的工作，独立设计完成了主泵，并制造成功。 \n\n目前在建的红沿河、宁德、 阳江等核电站项目的主泵设计、制造、装配、检验、试验工作都将由中国独立完成。 \n\n其中主泵核心技术核电主泵轴密封和关键材料的国产化也在2014年7月完成，标志找我国已经完全掌握100万千瓦压水堆核电站主泵技术。在此之前，100万瓦级别的压水堆核主泵全世界只有五家企业掌握，没有一家愿意转让这一技术。 \n\n而AP1000核电主泵的设备国产化是由沈阳鼓风机集团和哈尔滨电力集团负责，目前只是样机成功，尚未装机测试。AP1000反应堆冷却剂泵采用世界上最大的屏蔽电机泵，与传统核电站采用的轴封式主泵有很大不同，技术难度大、加工精度高。目前世界上尚未有成功使用的先例。 \n\n（2）、主管道 \n\n核电站主管道是连接反应堆压力容器和蒸汽发生器的大厚壁承压管道，是核蒸汽供应系统输出堆芯热能的“大动脉”，是压水堆核电站的核一级关键设备之一。我国已建成发电的11台核电机组均采用第二代核电技术，其主管道均使用不锈钢铸件，都是从国外采购的。 \n\n2013年7月，中国第二重型机械集团公司（德阳）重型装备股份公司为第三代核电AP1000三门核电站一号机组、海阳核电站一号机组提供全国产化的主管道，这是我国第三代核电自主化的重大突破。AP1000主管道研制取得成功，是我国装备制造企业在三代核电关键设备国产化进程中实现的一个非常重要的节点目标。第三代核电AP1000主管道是我国第三代核电AP1000自主化依托项目中唯一没有引进国外技术的核岛关键设备。 \n\n第三代核电AP1000机组的设计寿命提高到60年（第二代核电设计寿命是40年），核电站安全性能指标也大幅提升，需要采用完全不同于第二代核电的超低碳控氮不锈钢整体锻造技术，材质要求高、加工制造难度大，堪称目前世界核电主管道制造难度之最。 \n\n（3）、反应堆压力容器 \n\n我国反应堆压力容器制造经验主要来自于制造核潜艇，随着大型锻件设备投产（八万吨压机），反应堆压力容器生产、上、下封头的压制、加工及环缝、接管段、安全段的焊接都顺利完成。目前国内的反应堆压力容器制造商主要是上海锅炉厂、东方锅炉厂。 \n\n（4）、稳压器 \n\n稳压器是用来控制反应堆系统压力变化的设备。在正常运行时，起保持压力的作用；在发生事故时，提供超压保护。稳压器里设有加热器和喷淋系统，当反应堆里压力过高时，喷洒冷水降压；当堆内压力太低时，加热器自动通电加热使水蒸发以增加压力。 \n\n该设备设计、制造难度不大，主要技术难度是喷淋装置和电加热元件，均可立足国内设计、制造，国内制造企业有上海锅炉厂、西安524厂、东方锅炉厂。 \n\n（5）、蒸汽发生器 \n\n蒸汽发生器的作用是把通过反应堆的冷却剂的热量传给二次回路水，并使之变成蒸汽，再通入汽轮发电机的汽缸作功。 \n\n国内制造企业是上海锅炉厂、东方锅炉厂和哈电集团重型装备有限公司。其中哈电集团2012年制造成功国产首台AP1000蒸汽发生器，这台AP1000蒸汽发生器，高22.5米、最大直径5.8米，重达620吨，突破了大厚管板锻造、深孔加工和传热管的胀接技术， U型传热管制造工艺。 \n\nAP1000蒸汽发生器是第三代核电技术关键设备，代表了目前世界最先进的核电设备制造水平。蒸汽发生器为60年的设计寿命，具有非能动的安全系统，在无能源的情况下能够自我冷却72小时，安全性大幅提高。 \n\n（6）、冷凝器 \n\n国内设计、制造企业主要是东方锅炉厂 \n\n（7）、安全壳 \n\n安全壳用来控制和限制放射性物质从反应堆扩散出去，以保护公众免遭放射性物质的伤害。万一发生罕见的反应堆一回路水外逸的失水事故时，安全壳是防止裂变产物释放到周围的最后一道屏障。安全壳一般是内衬钢板的预应力混凝土厚壁容器。 \n\n（8）、堆内构件 \n\n堆内构件是压水堆核电站核岛心脏设备，主要功能是装载与支承核燃料；提供堆芯中子通量和温度测量；提供冷却剂合理的水流分配；为控制棒提供正确通道；以控制反应堆启动、停堆和功率调整。 \n\n国内的堆内构件制造商是上海第一机床厂。 \n\n（9）、核二、三级泵 \n\n主要包括上充泵、高压安注泵、低压安注泵、喷淋泵和余热排出泵、电动、汽动辅助给唧泵、设冷水泵，安全厂用水泵、水压试验泵等。目前已经国产化。多家企业能够生产。 \n\n（10）、核级阀门 \n\n主要包括主蒸汽安全阀、主蒸汽隔离阀、主给水调节阀、余热导出安全阀等。以及分布在核电站100多个系统近6400台套的核一、二、三级阀门，以及其他各类阀门约3万台。 \n\n核安全功能要求高，设计、制造难度大中国突破后，对新一代核潜艇发展有很大作用。 \n\n目前国内核级阀门制造厂家包括中核苏阀，江苏神通，大连大高，石阀一厂，上海一核阀门、上海五阀等17家（全球一共只有38家）。 \n\n其中中核苏阀闸门、截止阀、止回阀，江苏神童的蝴蝶阀和球阀，大连大高的止回阀和截止阀都有自己铸锻件能力，并获得国际核级取证。 \n\n（11）、核电站控制棒驱动机构 \n\n生产厂商是上海先锋电机厂，生产核电站控制棒驱动机构的机加工部件，驱动杆、钩爪组件，能够生产相关18种1362件产品零件；核电站装卸料机主要生产上是上海起重运输机械厂；核电站环吊主要生产商是大连起重运输机械厂；蒸汽和给水管道生产商是常州电力修造厂；电力电缆（3K级）主要生产上是上海电缆厂和广东电缆厂。 \n\n3、常规岛核心设备 \n\n（1）、汽轮机 \n\n核电站用的汽轮发电机在构造上与常规火电站用的大同小异，所不同的是由于蒸汽压力和温度都较低，所以同等功率机组的汽轮机体积比常规火电站的大。 \n\n国内上海、哈尔滨、东方三大汽轮机厂都是世界级水平的企业。都能制造百万千瓦级全速核电汽轮机。 \n\n（2）、发电机 \n\n国内三大发电设备基地（东方，上海，哈尔滨）都已具备研制百万千瓦级汽轮发电机的能力，具有对定、转子加工的大型数控加工中心，卧式车床等。 \n\n核电常规岛辅机设备主要有高、低压给水加热器，凝汽器，除氧器等，国内生产企业是上海动力设备有限公司，杭州锅炉厂等等。 \n\n（3）、危急冷却系统 \n\n为了应付核电站一回路主管道破裂的极端失水事故（LOCA）的发生，核电站都设有危急冷却系统。它是由安全注射系统和安全壳喷淋系统组成。一旦接到极端失水事故的信号后，安全注射系统向反应堆内注射高压含硼水，喷淋系统向安全壳喷水和化学药剂。便可缓解事故后果，限制事故蔓延。 \n\n安全注射系统是当核电站一回路系统的管道或设备发生破损事故后，用来向堆芯紧急注入高硼冷却水，防止堆芯因失水而造成烧毁。 \n\n安全注射系统设有两套安全注射管系。一套为安全注射箱（ACC）管系，在安全注射箱内储有一定容积的高硼水，并用氮气充压，使注射箱内维持恒定的压力。当一回路系统一旦发生大破裂事故，其压力低于安全注射箱的压力时，安全注射箱内的硼水就通过止水阀自动注入一回路系统。另一套为安全注射泵管系，当一回路系统因发生破损事故而压力下降至一定值时，安全注射泵就自动启动，将换料水箱内的硼水注射至一回路系统，换料水箱内的硼水被汲完后，安全注射泵可改汲从一回路系统泄露至安全壳底部的地坑水，使硼水仍能连续不断地注入一回路系统冷却堆芯。 \n\n在电站失去外电源情况下，安全注射泵的电源可由应急柴油发电机组自动供电。 \n\n东方集团和哈尔滨电力集团均可生产。 \n\n（4）、安全壳喷淋系统 \n\n在核电站发生失水事故或二回路主蒸汽管道破裂事故时，安全壳内充满了带放射性高压蒸汽，安全壳喷淋系统将用来降低安全壳内压力和温度，使放射性蒸汽凝结下来。 \n\n在安全壳的上部设有相当数量的喷淋头，当安全壳内由于发生主管道破损事故而蒸汽压力升高时，安全壳喷淋系统的泵就自动启动，将换料水箱内的硼水和NaOH贮箱内供除碘用的NaOH溶液一起汲入，以一定的比例混合，再由喷淋头喷入安全壳内。当换料水箱的水被用尽后，喷淋泵可改汲安全壳内的地坑水。此时，地坑水先由设备冷却水冷却后再重新喷淋至安全壳内。 \n\n在核电站断电情况下，安全喷淋泵的电源也由应急柴油发电机组自动供电。这套系统国内能生产企业很多，例如上海水泵，沈阳水泵等等。 \n\n（5）、核电站用应急电源 (柴油发电机组) \n\n目前我国的核电站应急电源(柴油发电机组)已经不用进口，上海沪东造船厂和陕西408厂引进了法国SEMT pielsMck专利技术的PC型和趴型柴油机作为核电应急电源 (柴油发电机组)中的主动力大功率柴油机。 \n\n（6）、主控系统 \n\n目前我国能提供100万千瓦压水堆核电站的全部全数字化控制系统，包括核岛安全、保护系统，常规岛控制系统，数据采集系统，控制棒棒控棒位系统和1 E级继电器架等，国产化能力基本在100％左右，极个别传感器需要进口。 \n\n核电站常用的测量仪表有流量、温度、液体、压力四类检测仪表，如铠装热电偶、薄膜热电偶、液柱式、热电偶温度计、应变式等压力表和差压计、差压式液位计、浮子式液位计、雷达液位计、差压式流量计、液体静力液位计、转子流量计、电磁流量计等都被广泛应用于核电领域。除了这些常规测量仪器仪表，核电领域还需要振动测量、位移测量等机械量参数测量仪表、分析测量仪表、硼表以及大型仪表控制系统等。 \n\n我国企业现在能够能生产具有自主知识产权的核级仪表，如核级电容变送器、核级热电偶、热电阻、核浮筒液位变送器、核级主冷却泵转速仪表、核级压力、差压、温度、位式控制器、核级记录仪、核级可编程调节器、核级报警装置和系统、核级主控制盘系统、部分核级气动、电动调节阀和核级电动执行机构等。 \n\n以及IE级反应堆保护系统样机，核电站水、汽取样装置，IE级逻辑系统继电装置，核电站废液处理系统装置，TF级核电NX浓硼酸热缆控制系统，核电站主给水流量测量节流装置等。 \n\n上述各种仪表和系统装置己应用核电站上。 \n\n（7）、海水循环泵 \n\n国内已经能够的设计和制造，技术难度不大。 \n\n四、AP1000设备国产化进展 \n\nAP1000核电站是美国西屋公司设计的第三代先进压水堆核电站。单堆两环路设计，完全采用非能动安全系统，采用数字化技术和先进主控室设计，功率约为1250MWe，设计寿命60年，是唯一得到美国核管会（NCR）最终设计批准（FDA）的第三代核电技术。 \n\nAP1000核电站的反应堆压力容器、蒸汽发生器、堆内构件、控制棒驱动机构、环吊、燃料装卸料机等设备是在原有成熟机组基础上进行设计，与传统的两代及其改进型压水堆核电站设备总体上类似。 \n\nAP1000国产化制造的重点和难点主要包括材料、焊接、机加和装配、热处理、检测试验等。 \n\nAP1000反应堆冷却剂泵（主泵）、爆破阀、钢制安全壳CV、主管道等设备与传统的核电站完全不同，是AP1000的特殊重要设备。 \n\nAP1000反应堆冷却剂泵采用世界上最大的屏蔽电机泵，与传统核电站采用的轴封式主泵有很大不同，技术难度大、加工精度高。 \n\n爆破阀的驱动装备是由爆炸单元构成，是AP100核电站非能动系统的关键和特殊设备。 \n\n钢制安全壳CV作为AP1000核电站的特别的关键设备，在核电站设备建造史上尚属首次，其外形尺寸大、钢板厚度大、封头分片曲面形状复杂、拼装后的整体精度要求高，且采用新型钢板材料，因此对CV安全壳容器的制造工艺提出了新的要求。 \n\nAP1000主管道采用整锻式结构不锈钢锻造管，完全不同于第二代核电站采用的铸造不锈钢管。 \n\n上述设备目前均已经成功国产化。 \n\nAP1000屏蔽主泵尚未实际应用，但是已经取得美国认证（ASME授权检验机构现场联检，一次成功），成为AP1000主泵ASME部件EMD合格供方。建设的生产线具有年产12台AP1000主泵能力。中国一重制造PRV、SG锻件成功，SG管板试制已成功。 \n\n爆破阀是AP1000专有的设备，是AP1000的一个非常关键的安全设备。中核苏阀已经获得ASME N和NPT认证及国家核安全局认证。爆破阀的国产化工作已经完成。 \n\n环吊与装卸料设备国产化。由太原重型机床、大连起重机和上海起重机共同完成。 \n\nCV容器也是AP1000的专有设备之一。 CV容器的国产化已经由山东核电设备制造公司完成，获得ASME证书。 \n\n主管道国产化完成。2013年7月，中国第二重型机械集团公司（德阳）重型装备股份公司为第三代核电AP1000三门核电站一号机组、海阳核电站一号机组提供全国产化的主管道，这是我国第三代核电自主化的重大突破。AP1000主管道研制取得成功，是我国装备制造企业在三代核电关键设备国产化进程中实现的一个非常重要的节点目标。第三代核电AP1000主管道是我国第三代核电AP1000自主化依托项目中唯一没有引进国外技术的核岛关键设备。 \n\n第三代核电AP1000机组的设计寿命提高到60年（第二代核电设计寿命是40年），核电站安全性能指标也大幅提升，需要采用完全不同于第二代核电的超低碳控氮不锈钢整体锻造技术，材质要求高、加工制造难度大，堪称目前世界核电主管道制造难度之最。 \n\nAP1000主管道成套设备研制的成功，不仅能够满足我国后续三代核电项目建设对锻造主管道的需求，同时为我国具有自主知识产权的CAP1400、ACPR1000+和ACP1000锻造主管道的研制创造了有利条件。 \n\n锆材国产化也完成。以及拥有自主知识产权的核级锆合金产品生产工艺试制 \n\n核级锆合金产品是核燃料组件。核电站的燃料是铀，其被烧结成一个个圆柱状的二氧化铀陶瓷芯块，叠装在用锆合金做成的包壳管中，做成一根根细长的燃料棒，再把这些燃料棒按一定规则组装成一个个燃料组件，就可供核电站使用。核电站的反应堆堆芯装有上百个这样的核燃料组件，总重量达几十吨。锆合金是以锆为基体加入其他元素而构成的有色合金。随着对核燃料组件性能要求的不断提高，研制具有良好力学性能、耐腐蚀性能和耐辐照性能的高性能核级锆合金一直是各核电先进国家的主要研究方向。而高性能核级锆合金必须具有在高温高压水和蒸汽中有良好的耐蚀性能、适中的力学性能、较低的原子热中子吸收截面，对核燃料有良好的相容性，如此才可用作水冷核反应堆的堆芯结构材料（燃料包壳、压力管、支架和孔道管），这是锆合金的主要用途。 \n\n核燃料组件也是防止核泄漏的第一道屏障，直接影响核电站的安全性、可靠性和经济性。在我国突破以前，我国核电机组中使用的燃料组件依赖国外引进。这个工艺的突破，确保了我国核燃料供应安全。这套工艺包括核燃料性能分析、反应堆物理热工计算分析、燃料组件热工综合试验、水力性能综合试验、力学综合试验、池边检测等。目前能够生产8英尺、12英尺、14英尺燃料组件、高性能核级锆合金、核燃料性能分析软件包等产品。这个工艺可以满足我国自主三代核电技术“华龙一号”建设和运营的需要，也将为国内在运在建核电机组升级换代“中国芯”提供更多的产品选择，为国内核电机组的安全稳定运行保驾护航。 \n\n目前核电站都采取了四道屏障的安全保护法。第一道安全屏障是核电站核心部件核燃料棒采用U02陶瓷块，这种陶瓷的熔点高达2800摄氏度，并且它的物理化学性质稳定，不会和水产生放热反应；第二道屏障是核燃料元件的包壳采用铬合金制造，具有很好的密封性和在运行条件下长期封存裂变产物的能力；第三道屏障是罩住燃料元件棒的自压力壳，厚度在20厘米以上，几百吨，当发生核燃料元件包壳有少量破漏时，压力壳将把放射线控制在壳内，不会扩散到外界；第四道屏障是安全壳，有一米厚的钢筋混凝土，即使发生核泄漏事故，放射性物质也将被限制在安全壳范围内，无法向外环境逸散。 \n\n此外完成了自主产权核电堆芯计算软件。该软件适用于方形组件压水堆电厂的堆芯核设计和运行支持，是我国拥有完整自主知识产权的核电厂反应堆堆芯物理分析与燃料管理软件系统，改变了我国长期以来缺乏该类国产高水平商用软件的局面，对实现我国核电堆芯设计技术的自主化具有重要意义。 \n\n总的来说，AP1000压力容器、蒸汽发生器、主泵、爆破阀、稳压器、主管道、堆芯补水箱、非能动余热排出换热器、钢制安全壳、设备闸门、人员闸门等设备的国产化基本成功，国内相关大型设备制造企业已全面掌握了AP1000核岛主要设备的制造技术，在技术能力、管理水平、硬件设施上都得到了很大提升。 \n\n目前三门一期、海阳一期、徐大堡项目、陆丰项目的AP1000核电站正在建设中。 \n\n而中国具有完全自主知识产权的CAP1400大型锻件制造技术、蒸汽发生器690U形管研制已取得了突破，反应堆压力容器、蒸汽发生器、主泵、汽轮机发电机组等长周期设备研制也取得了阶段性进展。预计CAP1400重大专项示范工程核岛设备国产化率将达到85%以上。 \n\n以前国内核电二代、二代﹢技术的国产化率不到90%，但是到山东海阳核电二号机组，第三代核电AP1000国产化率已经达到近100%。 \n\n五、其他进展 \n\n1、原料 \n\n中国核电发展规划是到2020年核电总装机规模达到7000万千瓦，核电装机占电力总装机的4.6%，核发电量将占总电量的7.0%左右。2030年达到2亿千瓦，核电装机占电力总装机的10%，核发电量占总电量的15%。2050年达到4亿千瓦，核电装机占电力总装机的16%，核发电量占总发电量的比重为24%。 \n\n但是需要的原料完全靠国产目前看来有问题。因为如果只依靠热堆电站（压水堆），需要200万吨以上的天然铀供热堆全寿期（60年）的消耗。但我国现探明的天然铀储量，最多能供4000万千瓦装机容量的热堆核电站运行50年至60年。所以我们必须去非洲抢铀资源。 \n\n2、快堆 \n\n另外一个解决方向是搞快堆，因为热堆（例如压水堆）核电站只能利用天然铀中1％左右的资源，其余部分须作为废料处理。快堆在发电的同时，可以把剩余大部分材料变成又可裂变的燃料，长期循环，可以把核燃料的利用率提高到60％～70％。 \n\n所以我国核能发展总的路线图是：热堆——快堆——聚变堆。按照长期规划，中国核电战略将“坚持发展百万千瓦级先进压水堆核电技术路线，按照热中子反应堆(热堆)——快中子反应堆(快堆)——受控核聚变堆‘三步走’的战略开展工作”，并“坚持核燃料闭合循环的技术路线”。中国政府计划在2035年前后实现快堆核能系统的商用化。其实现在中国在快堆、热堆乏燃料的后处理、快堆燃料制备、快堆乏燃料后处理等技术领域已经有很大进展。 \n\n3、高温气冷堆 \n\n上海电气集团鼓风机厂2014年7月成功研制出第四代核电反应堆主氦风机样机，性能世界领先（功能相当于压水堆核电站的主泵，将氦气加压到70个大气压后作为冷却剂，将反应堆堆芯产生的热量带走。随后氦气流经蒸汽发生器，再次加压后返回反应堆堆芯，从而实现能量交换。由于氦气的惰性特点，当杂质保持足够低的水平时，冷却剂不会造成对反应堆内燃料元件和其它构件的化学侵蚀。氦气不吸收中子，也没有显著的反应性效应，使得由于冷却剂产生的废物量也相对少）。 \n\n这是高温气冷堆核电站示范工程（HTR-PM）的核心装备，是世界上第一台采用电磁轴承的大功率主氦风机，整个风机转子重量约4吨，由电磁悬浮轴承支承，实现非接触无摩损运行，不需要润滑油系统。这套设备标志着我国已攻克世界高温气冷堆先进核电技术研发中的主要技术难关，这一主氦风机将被安装在位于山东省荣成市的华能石岛湾核电厂，该核电站将是世界第一座具有第四代核电特征的高温气冷堆核电站。（高温气冷堆可以避免类似于日本福岛核事故的堆芯熔化、放射性大量释放的重大事故） \n\n在高温气冷堆研究领域，我国已经走在了世界的最前沿。 \n\n目前，我国真正的有了设计和建设百万千瓦级压水堆核电站能力。但是在设计技术、计算软件、工程管理、设备配套供应等方面与世界最先进还有一定差距。 \n\n目前中国是为世界在建核电机组规模最大的国家，包括28台机组，装机容量为3087万千瓦，其中包括三门核电站2个机组，海阳核电站2个机组，方家山2个机组，防城港2个机组，红沿河4个机组，宁德4个机组，阳江3个机组，福清3个机组，台山2个机组，海南昌江2个机组。 \n\n六、中国目前使用的核电站技术 \n\n我国正在使用的有五种第三代核电技术，分别是 AP1000、华龙一号、CAP1400、法国核电技术(EPR)以及俄罗斯核电技术(VVER)。 \n\n1、AP1000 \n\nAP1000是美国西屋公司研发的“非能动型压水堆核电技术”。是在非能动先进压水堆AP600的基础上开发的。该技术在理论上被称为国际上最先进的核电技术之一，由国家核电技术公司负责消化和吸收，且被决策层确认为日后中国主流的核电技术路线。 \n\n世界上首个采用AP1000技术的依托项目浙江三门核电一号机组原计划于2013年底并网发电，但由于负责AP1000主泵制造的美国EMD公司多次运抵中国的设备都不合格，致使三门一号核电机组如今已经延期2年。 \n\n目前，海阳核电厂1-2号机组、三门核电厂1-2号机组、红沿河核电厂二期项目5-6号机组、三门核电厂二期项目、海阳核电厂二期项目、徐大堡核电厂一期项目以及陆丰核电厂一期项，以及湖南桃花江等内陆核电项目均选用AP1000技术。 \n\n浙江三门核电站是我国首个采用三代核电技术的核电项目。三门核电站在全球率先采用第三代先进压水堆AP1000技术，其1号机组是全球首座AP1000核电机组。三门核电站2009年4月19日开工建设，总投资250亿元，将首先建设两台目前国内最先进的100万千瓦级压水堆技术机组。全面建成后，装机总容量将达到1200万千瓦以上，超过三峡电站总装机容量。 \n\n2、华龙一号 \n\n是中核ACP1000和中广核ACPR1000+两种技术的融合，被称为“我国自主研发的三代核电技术路线”。“华龙一号”现已通过国家能源局和国家核安全局的审查。 \n\n国家核电技术公司的AP1000和中广核集团与中核集团共推的华龙一号被默认为中国核电发展的两项主要推广技术，两者一主一辅，AP1000技术主要满足国内市场建设和需求，华龙一号则代表中国核电出口国外。 \nACP1000技术是中核集团自主研发的具备完整自主知识产权的先进压水堆核电技术。它是在中核集团完成设计的CP1000核反应堆的基础上，消化吸收引进的三代核电技术AP1000，借鉴国际先进核电技术的先进理念，充分考虑福岛核事故后最新的经验反馈，按照国际最先进法规的标准要求研制的一种拥有自主知识产权的第三代压水堆核电站。 \n\nCPR1000是中广核推出的中国改进型百万千瓦级压水堆核电技术方案。是源于法国引进的百万千瓦级堆型——M310堆型。而ACPR1000+是中广核在推进CPR1000核电技术标准化、系列化、规模化建设的同时，研发出的拥有自主知识产权的百万千瓦级三代核电技术。\n\n按照中核和中广核目前达成的协议，“华龙一号”的堆芯选用中核集团ACP1000技术的177堆芯，单堆布置，核燃料采用中核集团开发的CF自主品牌。在具体的项目上，可根据客户需求，配置个性化的专设安全系统。 \n\n3、CAP1400 \n\nCAP1400型压水堆核电机组是国家核电技术公司在消化、吸收、全面掌握我国引进的第三代先进核电AP1000非能动技术的基础上，通过再创新开发出具有我国自主知识产权、功率更大的非能动大型先进压水堆核电机组，也是中国“16个国家科技重大专项”之一的核电重大专项的核心内容。CAP1400符合目前全球商用核电站的最高安全标准要求，也是最大的非能动压水堆核电站。 \n\nCAP1400将与“华龙一号”一道，成为中国核电技术竞逐海外市场的两大利器。 \n\n目前，我国应用CAP1400技术的项目为山东荣成CAP1400示范项目1-2号机组，单机容量140万千瓦，设计寿命60年。该项目为有望核准的项目，现两台机组的前期工作进展顺利，预计今年内开工，2018年首台机组并网发电。 \n\nCAP1400技术特点： \n\nCAP1400采用了非能动堆芯冷却系统、非能动安全壳冷却系统的组合设计。其安全性比二代核电提高两个量级。 \n\n同时，CAP1400采用简化设计，与传统压水堆相比部件数量显著减少。这样维修检查的压力减少，故障几率大幅降低。 \n\n对于反应堆安全保障的重中之重——钢制安全壳，CAP1400在设计中扩大了安全壳尺寸，获得了较大的自由容积、优化布置和更大的安全壳内压分析裕量。在屏蔽厂房的设计上，采用钢板混凝土结构，具备抗大型商用飞机恶意撞击能力，并优化了空间布置，以提高人员可到达性和设备可维修性。 \n\n在经济方面，CAP1400较目前二代核电的经济性主要体现在性能参数和建造成本上。CAP1400具有更优的经济性;设计使用寿命为60年，较二代核电增加20年寿命。 \n\n基于AP1000的模块化技术，CAP1400优化了模块设计。模块化建造缩短了建造周期：示范工程一号机组建造周期56个月，2号机组50个月。 \n\n4、法国EPR核电技术 \n\nEPR是与美国AP1000并列的当代先进的三代核电技术，是法马通和西门子联合开发的反应堆，是在国际上最新型反应堆(法国N4和德国建设的Konvoi反应堆)的基础上开发的，吸取了核电站运行三十多年的经验。 \n\nEPR为单堆布置四环路机组，电功率1525MWe，设计寿命60年，双层安全壳设计，外层采用加强型的混凝土壳抵御外部灾害，内层为预应力混凝土。 \nEPR核电技术是我国出于政治关系的引进项目，不在目前国内新机组的技术选型考虑范围之内。 \n\n目前，全球采用此种技术建造的核电站共有3座，除位于中国广东江门的台山核电站外，还有2005年5月开工建设的芬兰奥尔基洛托核电站，2007年底开工的法国弗拉芒维尔核电站3号机组。 \n\n台山核电站一期工程由中国企业和全球拥有核电机组最多的法国电力公司共同投资建设。该工程已于2009年底正式开工。建设两台单机容量为175万千瓦的压水堆核电机组，项目建成投产后年上网电量预计达260亿千瓦时。 \n\nEPR技术特点： \n\n1、EPR属压水堆技术。 \n\n2、EPR是目前国际上最新型反应堆(法国N4和德国近期建设的Konvoi 反应堆)的基础上开发的，吸取了核电站运行三十多年的经验。 \n\n3、EPR是新一代反应堆，具有更高的经济和技术性能：降低发电成本，充分利用核燃料(UO2或MOX)，减少长寿废物的产量，运行更加灵活，检修更加便利，大量降低运行和检修人员的放射性剂量。 \n\n4、EPR的电功率约为1600兆瓦。具有大规模电网的地区适于建设这种大容量机组。另外，人口密度大、场址少的地区也适于采用大容量机组。 \n\n5、EPR可使用各类压水堆燃料：低富集铀燃料(5%)、循环复用的燃料(源于后处理的再富集铀，或源于后处理的钚铀氧化物燃料MOX)。EPR堆芯可全部使用MOX燃料装料。这样，一方面可实现稳定乃至减少钚存量的目标，同时也可降低废物的产量。 \n\n6、EPR的技术寿期为60年，目前在运行的反应堆的技术寿期为40年。由于设备方面的改进，EPR运行40年无需更换重型设备。 \n\n5、俄罗斯VVER核电技术 \n\nVVER是前苏联所发展的压水动力堆的简称。VVER是俄语缩写，代表“water-water能量反应堆”(即水冷反应堆water-moderated能源)。在一些东欧国家，核电生产部分或全部依靠苏联设计的这种反应堆。 \n\n上世纪七、八十年代，前苏联主要建设的二代压水堆核电机型，是VVER-1000。九十年代初，苏联解体以后，俄罗斯跟世界各核电机组供应商一起，进行更安全更经济的新机型的改进研发，先后推出了AES-91(V-428)和AES-92(V-412)两种机型。两种机型都保持了VVER-1000的基本型式，两者基本相同。 \n\n两种机型分别在中国的田湾核电站和印度的库达库拉姆核电站，各建设两台。田湾核电站的两台AES-91型机组，已分别于2007年5月17日和8月16日建成投产。印度库达库拉姆核电站的两台AES-92型机组，也分别于2010年9月和12月建成投产。 \n\n在AES-91和AES-92两种机型建设实践的基础上，吸收反馈经验，进行了综合改进、挖潜和标准化，推出了名义功率为120万千瓦的AES-2006型，属三代+的机型。 \n\n俄罗斯政府已确定AES-2006型为俄罗斯今后核电发展的主力机型，计划在2030年前要建成32台这种机组，现在已有4台机组，新沃罗涅日2厂(NVNPP)和列宁格勒2厂(LNPP)各2台机组，分别在2008年和2009年开工建设，于2012年和2013年建成。另外在保加利亚的Belene核电站的竞标中，俄罗斯战胜了捷克斯库达公司和西屋公司联队，以AES-92型中标，两台机组已于2008年开工建设。 \n\n目前，在俄罗斯和海外共运行着53座采用俄罗斯VVER技术的水冷核反应堆，其中28座是VVER一1000型反应堆。 \n\n七、核电站建设机械行业市场规模 \n\n1、大型铸锻件 \n\n铸锻件是核电主设备关键原材料，是核电站中核岛、常规岛主设备的关键原材。国际上仅有少数公司能够制造。目前国内有能力生产核级大型铸锻件的企业仅有中国一重、上海电气、中国二重，每年近70亿元市场。 \n\n2、核电阀门 \n\n核电阀门占核电设备总投资的5.2%左右，到2020年新建核电站中阀门总投资累计将达到219亿元。 \n\n两台百万千瓦机组核电站每年总维修费用在1.35亿元人民币左右，核电阀门的维修、更换费用在维修总额中约占50%，每年达到约6700万元。当中国运行的百万千瓦核电机组装机容量达到7000万千瓦时，每年核电阀门的维修、更换费用就将达到23.45亿元人民币。目前，核电站核级阀门已经完全国产化。 \n\n3、核级仪控系统 \n\n核级仪控系统每年市场需求在45亿元以上。核级仪控系统现在已经采用数字化技术。 \n\n4、加工机床 \n\n这个市场规模在每年100亿左右，竞争极为激烈，所有设备均已经完成国产化。 \n\n但是国内核电装备制造业已经产能过剩，以我国反应堆压力容器为例，目前我国有三家企业在做，仅一重一年的产能就可达10台左右，全国年产能约为20台，而国内需求仅仅为6台左右。再例如蒸汽发生器、管道分别有4家企业在做，产能超过10台套，实际需求只有一半。至于阀门、核岛主泵，生产企业更多，国内持证核级阀门厂家为17家（全球共计为35家）。 \n\n可以预见，这又是一个将被中国人做成白菜价的高大上领域。"
		},
		{
			"post_id": 12,
			"title": "我国仪器仪表工业简介 China Instrumentation Industry Introduction",
			"date_published": 1503756722.326,
			"body": "2014年我国仪器仪表行业产值接近一万亿人民币，是一个大行业，但是仪器仪表是我国技术最落后的一个行业，如果说涡扇发动机与美国相差30公里，那么高端仪器仪表相差至少50公里，而且30年内无任何可能追赶缩短距离的可能。 \n\n由于差距大，仪器仪表也是我国贸易逆差最大的造业部门。据海关统计，2013年我国累计出口仪器仪表产品253.7亿美元，同比增长6.2%；进口422.9亿美元，同比增长3.8%。预计2015年进口超过500亿美元。 \n\n我国出口的主要是低端的工业自动控制系统及装置、光学仪器、医疗仪器、电工仪器仪表、实验分析仪器和衡器。 \n\n我国进口的主要是高端（高精度和精密）工业自动控制系统及装置、实验分析仪器、医疗仪器、光学仪器、电子测量仪器。 \n\n目前我国仪器仪表产品只有在技术含量较低的计量仪器仪表、衡器、绘图计算及测量仪器的进出口贸易中处于顺差，其余类别产品均处于贸易逆差，其中尤以技术含量较高的工业自动控制系统及装置、电子测量仪器、医疗仪器贸易逆差最多。 \n\n美国是我国最大的仪器仪表产品进出口市场，2013年对其出口46.4亿美元，占比18.3%，同比增长8.3%；自美进口88亿美元，占比20.8%。 \n\n后面附目前需要进口的仪器仪表设备清单（不包括特殊仪器仪表清单，例如军事用途的）。\n\n一、仪器仪表分类 \n\n仪器仪表主要分为12大类，主要包括：精密衡器；工业自动控制系统（各种数字控制系统）；电工仪器仪表；精密测量仪器；精密实验分析仪器；精密试验机；环境监测专用仪器仪表；电子测量仪器；光学仪器等等。具体细分如下： \n\n1、传感器 \n\n（1）、用于现场总线及智能化仪表的压力、湿度、流量、液位传感器；用于环保等领域的多功能传感器；航天航空领域需求的微传感器等。 \n\n（2）特殊弹性元件；用于数控机床、纺织机械、自动化仪表及民用汽车等领域的各种计数器等。 \n\n2、医疗仪器 \n\n（1）、各种自动化生化分析测试仪器等。 \n\n（2）、各种诊断，包括物理观察和成像，如激光、超声、射线、核磁共振等诊断仪器等。 \n\n3、工业自动化仪表 \n\n（1）、智能仪表、执行器与变送器、成套专用控制装置和成套专用优化系统等。 \n\n（2）、集散控制系统、现场总线控制系统和以工业计算机为基础的开发式控制系统等。 \n\n4、电子、电工测量仪器仪表 \n\n（1）、电工自动测试系统及设备。 \n\n（2）、集成电路自动测试系统。 \n\n（3）、微波、毫米波测量及测试系统。 \n\n（4）、通信、计算机、网络测量技术及测试系统。 \n\n5、科学仪器： \n\n（1）、生命科学仪器，包括芯片实验室、高灵敏度试剂盒等。 \n\n（2）、分离技术先进色谱仪器，微型专用色谱仪等。 \n\n（3）、农业和食品专用仪器，农药残留检测专用仪器等等。 \n\n（4）、离子光谱仪、近红外光谱仪、小型光度计等等。 \n\n（5）、环境与能源专用仪器，重点包括在线、预警在内的成套环境检测仪器，核磁共振测井设备。 \n\n6、石油检测仪器：主要包括与石油行业相关的各类检测仪器及元件、仪表等。 \n\n二、我们目前差距 \n\n首先是新兴传感器技术差距较大，例如包括固态硅传感器技术、光纤传感器技术、生物芯片技术、基因芯片技术、图像传感器技术、全固态惯性传感器技术、传感器智能技术，传感器网络技术，微型化和低功耗技术，以及传感器阵列及多功能、多传感参数传感器的设计、制造和封装技术。 \n\n其次是分析仪器功能部件及应用技术差距极大，例如包括分析仪器的关键部件，如检测器、四级杆、高压泵、阀门、磁体、专用光源和电源、全自动进样器、长寿命高灵敏电极、中阶梯光栅、高精度电子引伸计等关键零部件的稳定性和可靠性。 \n\n具体说来，差距较大的项目有： \n\n1、薄膜化、小型化、纤维化、粉体化、复合化、多功能化、材料-元件一体化、智能化等各种新材料，仪器仪表专用芯片上差距极大。 \n\n2、先进控制技术、过程优化技术、实时监控软件平台、信息集成软件平台、系统集成技术等。 \n\n3、仪器数据采集、处理和分析方法的标准化、规范化的软件平台的开发。 \n\n4、功能安全技术及安全仪表：包括达到整体安全等级SIL3的控制系统、温度变送器、压力/压差变送器、电动执行机构/阀门定位器。 \n\n5、、热能计量仪表和热能监测仪表：监测二氧化碳排放 \n\n6、自动化控制：如火力发电电网自动化控制仪表、煤层气发电自动化控制仪表、智能电网系统仪表、电机节能仪表、能源自动化调控仪表等。 \n\n7、食品安全、药品安全、突发事故的检测报警、环境和气候监测等相关的仪器仪表。 \n\n8、石化、火电、核电、风电、轨道交通等领域装备控制系统的仪器仪表。 \n\n附：目前需要进口的仪器仪表设备清单 \n\n下属这些仪器仪表其实有相当部分我国都能生产，只是大家不愿意用，原因有三个，一个是精度差，与进口顶级货相比差一个数量级；二个是故障率太高，寿命短，大概只有进口货一半寿命，国内仪器仪表厂家售后服务一般又跟不上，经常耽误工作；三个是可靠性差，可重复还原状态不稳定，大概比进口货低一两个数量级。 \n\n1、电工仪器仪表： \n\n高精度电度表； \n\n数字电网监测表（包括电流测量仪表，电压测量仪表，功率测量仪表，频率测量仪表，电阻测量仪表，相位，功率因数测量仪表，多功能测量仪表，模拟静电场测试仪，霍尔元件测磁场装置等）； \n\n高精度电阻测量仪器； \n\n高精度电磁示波器； \n\n高精度测磁仪器； \n\n扩大量程装置（包括分流器，仪用互感器，附加电阻器等）； \n\n电容式电压互感器现场校验仪。 \n\n2、光学仪器： \n\n高精度显微镜（包括电子显微镜，扫描探针显微镜，正置荧光显微镜，倒置荧光显微镜，电动体视显微图像系统，原子力显微镜，扫描电子显微镜，激光共聚焦显微镜，荧光显微镜及图像分析系统）； \n\n高精度光学计量仪（包括长度计量仪器，角度测量仪器，工具显微镜，三坐标测量机，平直度测量仪器，测量用投影仪，机床附属光学装置，光学动态三维测量系统等）； \n\n高精度物理光学仪器（包括看谱镜，谱线测量仪，荧光光谱仪，光电直读光谱仪等）； \n\n精密光学测试仪器（包括光学材料测试仪器，光学零部件测试仪器，通用光学测试仪器，光学系统特性参数测试仪，膜层测定仪，光学系统像质测试仪器，光学系统光度特性测试仪器等）； \n\n其他光学仪器（包括小动物活体成像系统，光学生物测量仪，活细胞功能检测与离子成像工作站，化学发光成像系统，高内涵多色荧光细胞成像系统，扫频源光学相干层析成像系统，光学测速系统，蒸发光散射检测器等等）； \n\n电子光学及离子光学仪器（包括电子光学及离子光学计量仪器，电子光学及离子光学测试仪器，钙流检测工作站等）； \n\n航测仪器（包括密度分割伪彩色分析仪，转绘仪，判读仪，立体测图仪，像点转刺测仪，像点坐标量测仪，纠正仪，展点仪等）； \n\n光谱遥感仪器（包括光谱辐射计，彩色影像扫描记录装置，多光谱彩色合成仪，遥感影像处理系统，野外遥感仪器等）； \n\n红外仪器（包括红外辐射源，红外辐射计，红外测试仪，红外热成像仪等）； \n\n激光仪器（包括宽带可调谐飞秒激光器，激光测距仪，多角度激光光散射系统）； \n\n工业视频内窥镜等等。 \n\n3、分析仪器：　 \n\n电化学分析仪器（包括电位式分析仪器，电解式分析仪器，电导式分析仪器，电量式分析仪器，滴定仪，极谱仪，电泳仪，凝胶成像系统，多通道电化学工作站 ，脉冲场电泳仪，细胞核转染仪，细胞动态分析仪，电泳槽，水份活度测定仪，转印系统，电位滴定仪等）； \n\n物理特性分析仪器及校准仪器（包括水分计，粘度计，密度计，浊度计，烟度计，颗粒分析仪，尘量分析仪，固体成分含量仪，采样器，表面张力仪，血凝分析仪，血小板聚集仪，布拉班德粘度仪，运动粘度计等）； \n\n热学式分析仪器（包括热量计，量热仪，热物快速测定仪，平板导热仪，差热仪，差热天平，热膨胀仪，热机械分析仪，热水热量仪，动态热机械分析仪，差示扫描量热仪及热重分析仪等）； \n\n光学式分析仪器（包括光电比色分析仪器，光度式分析仪器，红外线分析仪器，紫外线分析仪器，曝光表，光电比色分析仪器，光度式分析仪器，流式细胞仪，荧光定量PCR，酶标仪，基因测序仪，傅立叶红外光谱仪，紫外可见分光光度计，荧光分光光度计，梯度PCR仪，原子吸收分光光度计，全自动间断化学分析仪，流动注射分析仪等）； \n\n射线式分析仪器（包括核能谱仪，电子能谱仪，离子散射谱仪，二次离子谱仪，X 射线衍射仪，发射式 X 射线谱仪，吸收式 X射线谱仪，衍射仪，X射线荧光分析仪，氡检测仪等）；\n\n波谱仪（包括核磁共振波谱仪，顺磁共振波谱仪，核电四极矩共振波谱仪，光磁共振波谱仪等）； \n\n质谱仪（包括有机质谱仪，同位素质谱仪，无机质谱仪，气体分析质谱仪，表面分析质谱仪，液相色谱质谱联用仪，气相色谱质谱联用仪，电感耦合等离子体质谱仪，同位素质谱仪，飞行时间质谱仪，磁质谱仪等）； \n\n色谱仪（包括气相色谱仪，液相色谱仪，色谱联用仪，核酸蛋白仪，高效液相色谱仪，制备色谱仪，全自动凝胶色谱净化系统（GPC系统），离子色谱仪，检测器等）； \n\n磁式分析仪（包括可变场居里磁称，多功能卡帕桥磁化率各向异性测试系统，磁流变仪，小动物核磁共振成像仪等）； \n\n晶体振荡式分析仪； \n\n蒸馏及分离式分析仪； \n\n气敏式分析仪； \n\n化学变色式分析仪； \n\n环境监测仪器及综合分析装置（包括大气监测系统成套设备，水质监测系统成套设备，噪声监测系统成套设备等）； \n\n元素分析仪； \n\n便携式甲醛分析仪； \n\n氨基酸测定仪； \n\n蛋白质检测系统； \n\n透湿仪（水蒸气透过率测试仪）； \n\n自动微生物快速检测系统（仪）； \n\n抗生素残留检测仪； \n\n分析仪器辅助装置（包括分析仪器数据处理装置，辅助装置，超纯水系统（仪），超临界萃取装置，微波消解系统（仪），快速溶剂萃取系统（仪），固相萃取仪，微波快速灰化系统，台式基因枪，凝胶扫描仪等）。 \n\n4、试验机： \n\n金属材料试验机（包括拉力试验机，压力试验机，万能试验机，弯曲试验机，扭转试验机，复合应力试验机，冲击试验机，松弛试验机，硬度计，蠕变试验机，持久强度试验机，疲劳试验机，万能强力试验机等）； \n\n非金属材料试验机（包括橡胶塑料材料试验机，木材试验机，皮革试验机，油脂润滑剂试验机，油漆，涂料，油墨试验机，纸张，纸板与纸浆试验机，电缆线试验机，漆包线试验机，建筑材料试验机，粘合剂试验机，纤维，织物试验机，生物材料试验机，复合材料试验机，果品试验机，烟草试验设备，数显回弹仪 ，钢筋保护层厚度仪，胶黏物/纤维束筛分仪等）； \n\n工艺试验机（包括杯突试验机，线材扭转试验机，弯折试验机，弹簧试验机，挠度试验机，板材深冲性能试验机，摩擦磨损，润滑试验机，抗扰度检测系统，EMC抗扰度发生器等校准系统等）； \n\n测力仪器（包括引伸计，引伸计标定器等）； \n\n动平衡机（包括软支承平衡机，硬支承平衡机，立式平衡机，重力式平衡机，现场平衡仪，专用平衡仪，质量定心机，自动平衡装置，平衡自动线等）； \n\n无损探伤机（包括电磁(涡流)检测仪器，磁粉探伤仪器，渗透探伤仪器，X 射线检测仪器，γ射线探伤机，中子探伤仪，同位素检测仪器，超声检测仪器，声学检测仪，低频电磁多通道炉管无损检测系统，便携式大功率电磁超声检测仪，便携式相控阵检测仪，混凝土超声波检测仪等）； \n\n结构试验机（包括结构万能试验机，结构疲劳试验机，结构模拟试验台等）； \n\n动三轴仪； \n\n橡胶制品检测机械（包括轮胎检测机械，胶管检验机械，胶带试验机械，海绵试验机械，橡胶制品试验机械等）； \n\n其他试验机等等。 \n\n5、试验仪器及装置： \n\n精密分析天平及专用天平（包括电子天平，扭力天平，真空天平等）； \n\n动力测试仪器（包括电信号传递器，测功仪，测功器，压力测量仪器，油耗测量仪器，燃烧分析仪器，漏气量测量仪器，多参数测试装置，控制仪，动力测试专用校准仪器等）； \n\n试验箱及气候环境试验设备（包括温度试验设备，恒温箱(槽)，生物培养设备，湿热试验设备，温度湿度试验设备，腐蚀试验设备，低气压试验设备，高气压试验设备，真空试验设备，爆炸性大气试验箱，日光辐射试验箱，老化或综合气候因素试验设备，振动冲击与气候环境综合试验设备，防护试验设备等）； \n\n智能微生物培养系统； \n\n生物，医学样品制备设备（包括试验用离心机，染色体核型和荧光原位杂交工作站，全自动核酸提取工作站，高速冷冻离心机，真空离心浓缩器，真空组织脱水机，冷冻切片机，高速离心研磨仪，冷冻干燥机，高压细胞破碎仪等）； \n\n应变及振动测试仪器； \n\n型砂铸造试验仪器及装置（包括型(芯)砂试验仪器，特种铸造测试仪器，合金铸造性能测试仪器，铸造质量检测仪器，冲天炉熔化过程测试仪器等）； \n\n真空检测仪器（包括真空检漏仪器，真空测量仪器，真空监控仪器等）； \n\n土工测试仪器（包括土壤测试仪器，土壤测试辅助设备等）； \n\n实验室高压釜（包括电磁往复，永磁旋转，机械搅拌高压釜等）； \n\n电子可靠性试验设备（包括气候环境试验设备，电真空器件试验设备等）； \n\n柔性三坐标测量机； \n\n三维数字扫描及测量系统等等。 \n\n6、计算仪器： \n\n高精度液体比重计和液体密度计； \n\n高精度工业温度计，实验室温度计和电接点温度计； \n\n高精度工业气压计； \n\n高精度湿度计； \n\n高精度液体压力计； \n\n高精度气体与液体计量仪表； \n\n高精度速度测量仪表等等。 \n\n7、量仪：　 \n\n齿轮量仪； \n\nCNC齿轮分析测试仪； \n\n螺纹量仪； \n\n形位误差检查仪； \n\n角度量仪； \n\n其他量仪等等。　 \n\n9、其他仪器仪表： \n\n参考级剂量计； \n\n电子和通信测量仪器，数字，模拟仪表及功率计，数字仪表及装置； \n\n过程信号校验仪 ； \n\n高精度功率分析仪； \n\n元件器件参数测量仪； \n\n电阻器，电容器参数测量仪等等。 \n\n10、农林牧渔专用仪器： \n\n数粒仪； \n\n控温仪； \n\n叶绿素测定仪； \n\n活体叶绿素仪； \n\n光电叶面积仪； \n\n植物生长仪； \n\n双套气流式喷卵仪； \n\n乳脂测定仪； \n\n比重清油分测定仪； \n\n渔业测向仪； \n\n探渔仪； \n\n其他农林牧渔专用仪器。 \n\n11、地质勘探，钻采及人工地震仪器： \n\n重力仪器； \n\n磁法仪器； \n\n人工地震仪器； \n\n电法仪器； \n\n井中物探仪器； \n\n核物探仪器； \n\n化探仪器； \n\n钻探测井仪器； \n\n泥浆分析仪表； \n\n采油修井仪器仪表； \n\n岩石矿物理性质测试仪器； \n\n地形变化观测仪； \n\n煤尘，矿尘，粉尘测定仪； \n\n野外数据采集仪器； \n\n矿物实验测试仪器； \n\n地质探测仪； \n\n三维表面形貌仪等等。 \n\n12、电站热工仪表： \n\n单向测振仪； \n\n双向测振仪； \n\n数字式温度巡测报警仪； \n\n数字式毫秒计，数字式工频相位计，数字运算式工频计，工频振荡器等等。 \n\n（上述进口清单每年都在缩小）"
		},
		{
			"post_id": 11,
			"title": "参观飞机脉动总装线 Visiting Airplain Pulsating Assembly Line",
			"date_published": 1503756674.394,
			"body": "一、我们也有脉动总装线了 \n\n最近参观了一条我国自己设计和建造的飞机总装脉动生产线。 \n\n按照他们宣传部门的八股文介绍，这条脉动生产线通过数控定位器多自由度调姿定位技术、机翼整体壁板数控喷丸成形技术、机翼壁板自动钻铆技术、大部件自动化对接技术、数字化测量技术和轨道移动技术等先进装配技术的集成应用，全面提高了飞机的总装配技术水平和装配质量。该脉动生产线突破了传统的飞机总装生产模式，成为国内飞机总装先进技术应用的典范。 \n\n脉动线实施了可视化管理，将计划、问题、形象等站位管理的要素进行分类，列出可视化的图表，制定了标准作业图，站位自主管理板、飞机总装生产绩效板、AOS管理板、MES生产看板，提出了标识管理试点要求等。在坚持每日、每周更新，做好监督检查的前提下，总装脉动线现已基本实现了站位管理信息可视化的要求，解决了以往现场作业人员作业位置不固定、作业效率不高、操作过程中存在质量安全风险、受缺件、技术、物料及工装等因素，制约生产作业质量、安全、进度等问题。 \n\n总装脉动生产线彻底改变了“人力密集型”的传统飞机装配模式，通过借鉴汽车工业的高效流水线作业方式，使飞机以固有的节拍移动，操作人员则在固定区域进行装配作业。 \n\n目前我国有三条飞机脉动总装线，分别是西飞的飞豹歼击轰炸机，洪都的L15高级教练机和成都132的歼10（至于歼20信息，现在尚未解密）。 \n\n此外我国飞机部件生产也开始采用脉动生产线，如生产运20发动机WS20和起落架系统的生产线，也是脉动生产线。再例如成飞的复合材料机翼生产也是脉动生产。 \n\n目前我们脉动生产已经从制造向维修延伸。我们某型号的战斗机的修理和维护周转时间已经大幅减少XX%，节省成本Xx%，显著地提高了飞机的出勤率。（飞机的修理和维护是手工作业最多、不确定性最严重的领域） \n\n目前数据表明，采用脉动装配线减少装配周期20%，降低成本10%。 \n\n世界上首条脉动总装线是波音公司在2000年建立的，为阿帕奇直升机生产服务。 \n\n由于飞机脉动总装线效率显著高于传统传统生产模式，波音公司的波音787就是世界最先进的脉动总装线。 \n\n洛克希德马丁公司在2003--2004年建成了F-35的脉动总装线，目前又在建立F-35各个大部件的集成装配线，目前年F-35的总装线达到每天交付一架的水平。 \n\n另外意大利的阿古斯特维斯特兰公司（AgustaWestland）在英国的约维尔工厂于2011年为W159型武装直升机建立了脉动装配线；加拿大庞巴迪公司的C100系列新机脉动总装线将于2016年运行。 \n\n脉动总装线在军工制造领域的广泛应用，彻底打破了航空和复杂军工生产不能采用流水线生产的制约。例如法国的斯奈克玛（Snecma）公司改变了传统的继承GE在立式固定机架上“穿糖葫芦”式的总装过程，在2011年实现了CFM56发动机的脉动装配，减少装配周期35%，这条脉动总装线也将用于LEAP发动机的装配。 \n\n二、脉动总装生产线简介 \n\n脉动总装线简单说就是移动总装，而传统总装线是占位总装。 \n\n传统总装飞机，就是在一个位置，把所有零配件和部件都装完，然后测试，合格后，拉倒机场试飞。 \n\n脉动总装线是把总装分为几个工位，在不同工位组装不同部件和零配件，然后逐步移动，最后完成。也即在工位是高度专业化的工作。 \n\n脉动总装线（Pulse Assembly Lines）是福特公司的移动式汽车生产线升级来的，是连续移动装配生产线的过渡阶段。脉动总装线不像汽车总装线那种连续移动式装配线，是模块式移动总装。 \n\n脉动生产线一般由4部分组成：脉动主体、物流系统、可视化管理系统、技术支持。 \n\n1、脉动主体：站位设施、对接定位设备、可移动的装配设备等。 \n\n2、物流系统：AGV车、完备的配套和配送系统（核心是一组精确制导的自动引导车AGV，它将装配的构件、工具和其他一切必要的准备从一个工作站移动到下一个）。 \n\n3、可视化管理系统：现场可视化系统、ERP与MES无缝融合的信息管理系统、工作现场的固定和移动终端。 \n\n4、技术支持：质量保障、生产现场问题应急处理。 \n\n生产线由专业的自动化设备和先进的供给线组成，自动化程度高，且生产线分工明确细致，工作量单一重复，生产效率比传统组装模式大幅提高。 \n\n脉动装配生产线可以设定缓冲时间，对生产节拍要求不高，当生产某个环节出现问题时，整个生产线可以不移动，或留给下个站位去解决，当飞机的装配工作全部完成时，生产线就脉动一次。 \n\n部件采用脉动装配时受企业外部供应链影响较小、易于成功、见效快，也成为近来部件脉动装配生产线发展较快的原因。 \n\n三、我们参观的脉动总装线特点 \n\n我们参观的整条脉动总装线分为5个工作区： \n\n零号工作区 \n\n是预装配区。停放主要的大部件，例如机翼，发动机等等； \n\n在这里把所有机翼的运动部件，如襟、副翼和移动式前缘等安装到机翼上，使机翼成为一个完整的部件进入下一阶段装配。并且对机翼的运动部件做一些测试工作。尾椎与水平尾翼也预装配在一起。 \n\n其他主要部件都停放在零号工作区，部件上已安装好各类系统，如金属管路、电缆和各种电器设备等。 \n\n一号工作区 \n\n飞机的六大部件包括：前机身，中机身，后机身，左、右机翼和尾段。在这里对接总装配。先定位中机身，然后前机身、后机身和左、右机翼可同时向中机身进行安装。垂尾和水平安定面也在这里安装。 \n\n由于电缆、空气管路和液压管道都在各大部件上安装好了，这样就消除了为安装这些系统所需的大量工装。 \n\n在一号工作区，机身筒体被对接装配在一起，工位的数字化激光定位系统负责机身段的彼此对准，然后利用轨道式自动钻孔机打孔，用手工安装连接件，利用类似于埋头铆钉连接，复材件与钛合金件的连接要用特殊工艺和材料。 \n\n二号工作区 \n\n当所有大部件对接装配后，所有工装和飞机一样在轨道上移动到二号工作区。二号工作区飞机的位置将升高，以便安装后起落架（前起落架在前机身上是预先安装好的），安装发动机等，一级一些次结构件的安装以及系统安装的收尾工作。因交付来的部件中，所有管路、电缆、液压系统和环控系统等都是安装好的，所以这里仅是连接它们的一些收尾工作。安装结束，飞机就能以起落架站起来。同时要做很多清理工作，例如清理机翼油箱的杂质和灰尘。\n\n在这一工作区，厂房地板下装有排水系统和巨大的带有泵和管道的水箱。地面下有N个大水池或槽罐，盛有飞机所要求的液压系统所用的油料，还埋设了飞机上用的电力的电缆。所以在这个装配阶段就可以对机翼的运动翼面进行试验。 \n\n三号工作区 \n\n当飞机在二号工作区的测试结束后，飞机就脉动移动到三号工作区，这里的主要工作是安装电子系统（例如雷达，飞控系统，火控系统，通信系统和弹射等安全设备等等），并进行初步测试，辅助动力装置以及发动机控制系统，这些电子系统的初步试验和联机调试也在这里。 \n\n四号工作区 \n\n在这一工作区要进行各种各样的测试工作，如测试液压系统，检查它们是否漏油，还有空气检查、水管检查和水试验等，以确保各系统按照所设计的要求工作。然后进入航空电子试验、飞行控制试验及起落架收放测试。 \n\n飞机在第四工作区检查完毕后，初步测试合格，飞机就被送往喷漆车间进行喷漆。喷漆是依据设计的精确数据，由计算机程序控制把激光束投射到飞机表面上，当激光投射到飞机表面上时，就可以描绘出需要喷漆的区域。使工作人员操作数控喷漆机械手进行喷漆，可以很精确定位喷漆的区域范围。 \n\n总装生产线的右侧，是装配支持人员的办公室区域，左侧安放着待安装的各种零配件，如雷达、计算机、电台、座椅等。 \n\n脉动总装线的核心是生产集成中心（PIC，Production Integration Center），它负责监控整个产品的所有零配件的物流状况（库存，在途，订单申请，订单交付给协作厂商，协作厂商的订单生产进度等等）、各种各样的零部件的交付状态和物流配送状况，以确保零部件能顺利地运到总装线，当然同时监控着各供应商的进度、制造工艺和质量。 \n\n生产集成中心PIC下面的现场管理模块统包括：工艺管理、现场管理、可视化管理等子系统，可实现可视化管理、配送管理、拉动式管理，提高装配效率，减少浪费，降低装配成本。工作现场各站位配置了可视化滚动电子平台，可实时显示各站位的工序进展，直观反映实际生产情况，以实现飞机装配的高效和精益。飞机总装周期可由原来的xx天缩短为yy天（工作日），生产周期缩短30％左右，可实现飞机总装均衡连续生产。 \n\n生产集成中心PIC可以用视频系统监控整个总装线。 \n\n我们参观的生产线的飞机有XX%是复合材料制造，其中XX%是碳纤维复合材料，X%是玻璃纤维复合材料,由复材组成的结构，如长桁、加强肋、机翼、护翼、襟翼和框等比用铝合金结构轻20%--30%，XXXkg，它们比金属结构耐腐蚀和耐疲劳。 \n\n而复合材料质量稳定性一直是世界难题，因为一是对我们来讲是全新的技术，需要大量的工艺积累（军品级的复合材料对我国是禁运的）；二是需要特种工艺设备，而这些设备对我国是禁运的，国产设备尚需要时间来积累经验，逐步成熟。所以要求生产集成中心PIC有相当多的弹性，应对材料质量不确定和供应链不稳定。 \n\n另外大量使用复合材料，传统的工装基本上都不能用了（传统工装一般都是固定式结构，它们都有很笨重的水泥基座，各种装备用螺栓连接），取而代之的是数字化工装+机器人+AVG导向车（自动把装配件移动到工位）。 \n\n脉动总装配线的特点： \n\n1、模块化装配 \n\n在总装飞机时，它接收到的是完整的机翼、机身等部件，相当于成品，即在其部件内不仅结构完整，而且相关的管路、电缆、黑匣子、绝缘毯、地板和座椅等都已安装好，是典型的模块化装配。 \n\n2、脉动总装线 \n\n由于是大部件模块式装配，生产线就不需要连续移动。生产线每脉动一次，则完成一定装配工作。这一脉动生产线由4个离散的工作区组成，并以特定的顺序完成装配工作。当装配好的飞机由四号工作区移动到喷漆车间时，总装生产线就脉动一次。 \n\n3、数字化装配 \n\n在整个飞机装配工作过程中，不仅进行了全机装配过程的数字化模拟仿真。而且，质量检验人员一直监控着全部工作，每一个作业（或工作指令）都要进行验证和签字。传统总装是机械师和检验人员用图章和纸质文件来保存检验信息，现在用无线手持设备来完成，因为所有工作指令、规定、图章和纸质文件都已数字化了。各车间人员的手持设备上都运行一个工厂现场管理监控系统，它跟踪着所有工作进程，一旦飞机下线，大量的工程和生产数据就自动地流动到下游所需要的地方。 \n\n脉动生产线还有一个虚拟实验室，设计人员可以在实验室戴上三维眼镜，来操作和控制实际飞机的装配过程，进行估价是否在装配中有影响可达性的情况，以及将来飞机进入服役后的可维护性问题。如在机翼上卸下壁板是否方便并保证安全。安装雷达发动机等笨重设备时，依据历史数据专门开发一个人机工程检查表，通过人机工程的数字仿真，找出不安全和不方便的地方。 \n\n4、精益装配 \n\n零部件、工艺装备、材料和人员都精确到达生产线所需要的使用地点，供应链的控制简单高效。 \n\n此外管理系统实现了可视化，在沿着总装配线的每一个工作区域中，有很多显示器，显示飞机的装配状态，显示着生产线各功能组进展情况。 \n\n另外，在生产车间，每一个工作人员除配有手持设备外，还有口袋，把所有不属于飞机的零碎放进口袋，并有专门人员检查，这是安全和质量的重要保障。还有工具责任系统以避免小工具遗留在飞机上。 \n\n这是一条由国产数控设备（包括定位，测试，测量，安装，移动，焊接，喷涂，机加工等等）+数据总线联网+生产线数据采集传感器阵列（射频+图像识别+各种重量传感器+各种数量传感器）组成的数字化生产线。 \n\n并且有完善的支持系统，例如国产高档数控系统测试平台，国产高档数控机床应用技术支持平台，工业互联网各种支持平台等等。 \n\n生产线采用的数控机床、数控系统、功能部件及刀具都是国产的。 \n\n总装线上的工作人员根据激光测距仪和数控定位器精确规范装配的精度，通过计算机来规范生产质量。 \n\n目前在整个工厂基本实现了自动化的装配工装系统、智能运输系统和智能造系统，对全部设备通过工厂的通讯系统进行集中的和无线的控制。 \n\n四、脉动总装线的价值 \n\n从理论上说，传统的大规模生产和高度专业化分工的装配线是不适合手工操作过多的飞机生产的。波音创造性的解决了这个问题：将飞机装配作业均衡地分解到适当规模的不多的几个站位上完成，并大规模外协采购模块化部件，同时采用柔性化和大规模定制生产方式和柔性生产设备。 \n\n脉动总装线与大规模生产为标志的汽车移动生产线是根本不同的，技术含量要高得多：供应链协同难度，柔性生产组织难度和柔性生产设备技术难度都是不可同日而语的。 \n\n所以脉动总装线是一种新的生产模式，是由总装按一定节拍拉动整个企业生产的模式。整个企业在总装配生产的拉动下，精准、高质量的协同工作，形成尽可能减少浪费、高效率、高增值比的工作，使飞机装配周期大幅度缩短，成本得到有效控制。并可以大幅简化整个企业的计划管理和生产现场排序，使管理人员主要作用是协同供应商和上下游工序，并对异常情况有及时处理能力。 \n\n脉动装配作业采用标准化工作，自主的质量保证制度，比传统总装方式分工更专业，提高了整个企业各个环节的工作质量，而且更便于追踪责任，也便于激发员工的工作责任感和协同意识，确保总装配节拍正常有序。 \n\n当然脉动总装线的基础是柔性制造理论、大规模定制生产理论、数字制造、自动化和智能制造。脉动总装线的建设技术难度是系统设计，涉及系统分析和价值流分析，也需要企业优先实现数字化管理。同时要求企业管理基础非常扎实，例如要有成熟规范的研发流程、技术标准规范体系；要实现数字化设计，并通过工业互联网与生产系统共享数据，实现虚拟制造；要在飞机装配、钣金成形、机加及数控加工、复合材料成型、工装设计制造、特种工艺、计量与测试、特设试验等领域应用数字化制造技术。 \n\n最后，脉动总装线能否成功，取决于供应链管理能否成功。"
		},
		{
			"post_id": 10,
			"title": "美军后勤供应链管理简介 US Army Logistics SCM Introduction",
			"date_published": 1503756543.134,
			"body": "在十多年前,参加项目时,当时一位军队后勤部门的高层领导曾经说过：我军与美军差距最大的是后勤系统的运营管理能力。如果说我军陆军装备和管理运营能力与美军相差一公里，空军装备和管理运营能力差距大概是二公里，海军装备和管理运营能力差距大概是我三公里，二炮与美军装备和和管理运营能力大概相差四公里，那么后勤装备和管理运营能力大概相差五公里。后勤的差距决定了美军可以全球进攻，而在相当的未来，我军只能本土防御。 \n\n后勤一词源出希腊文Logistikos，意为计算的科学。最先使用后勤概念是19世纪30年代拿破仑征俄失败后，A.H.若米尼在总结的经验教训时，认为失败唯一原因是后勤失败。 \n\n现代战争的对后勤物资的消耗是天量的。以海湾战争为例，在历时42天的海湾战争中，美军地面部队的人均物资消耗为200多公斤，航母编队的物资消耗人均为1.1-1.38吨，美军共消耗各类物资1.7余万种3000多万吨，几乎等于苏联红军在4年卫国战争中物资消耗总量的一半。从消耗的速度来看，海湾战争分别比第二次世界大战、朝鲜战争、越南战争、第四次中东战争和马岛战争提高了20倍、10倍、7.5倍、4.2倍和3.5倍。在3年的朝鲜战争中美军的投弹量为68万吨，平均月投弹量为1.8万吨；而海湾战争第1天的前3个小时美军投下1.8万吨各类炸弹；美军1个步兵师的进攻战斗，平均日耗物资为5200吨；一个航母战斗群日均耗为2万余吨。此外，多国部队投入的飞机为2780多架，共出动11.2万架次，平均日出动达2600多架次，投弹万余吨，耗油2.5万吨，再加上日耗零配件物资，每天耗费物资3.4万吨。此外，每天还需要5-6万人次为其完成技术保障任务。 \n\n人类历史上，真正把后勤当成战争最重要的方面，是在二次世界大战。按照麦克阿瑟的说法：第二次世界大战就其主要特征来说，是一场后勤战。 \n\n美军二战顶峰时期军队员额超过1200万，在编制的后勤部队数额超过300万。 \n\n二战中，美军后勤需要以本土为后方基地对欧洲和太平洋及中印缅等多个战场上的部队实施保障，此外还要根据租借法案对盟国运送后勤援助物资。所以刚开始考虑的后勤因素主要包括：一是后勤补给线距离，二是后勤基础设施。为完成上述艰巨任务，美军建立了一支包括陆海空运输力量在内的规模庞大的覆盖全球的立体运输网，组织实施了历史上规模最大的战时运输，在海运方面，美国的运输船队通过大西洋、太平洋、印度洋共向遍布全球的330个卸载港运送了700余万部队、26亿吨物资。 \n\n但是很快发现运输只是后勤一个很小的问题，后勤效率取决于整个后勤系统的瓶颈。而后勤系统是一个由众多专业部门和后勤部队所构成的遍布全球的规模庞大的系统，为确保这样一个系统能够高效运转，并使现有后勤资源发挥最佳效益，必须有一套科学、合理的体制机制做保障和合理规划和优化调度，这就是所谓的后勤是可计算科学的真实含义。 \n\n人类把后勤变成真正的可计算科学，就是在二次大战美军在欧洲战场空军的后勤管理中。当时美国空军在欧洲战场负责后勤管理和指挥的队伍中，有后来被好事者称为所谓蓝血十杰的查尔斯•桑顿、罗伯特•麦克纳玛拉、法兰西斯•利斯、乔治•摩尔、艾荷华•蓝迪、班•米尔斯、阿杰•米勒、詹姆斯•莱特、查尔斯•包士华和威伯•安德森，他们第一次将大量优化（例如线性规划），调度（例如排队论）等等运筹学知识用于后勤管理，这也是人类吧把数字化管理模式用于战争的开始。他们为美军不但节约数十亿美元的军费，还极大的解决了后勤瓶颈问题（他们的工作也是运筹学真正解决实际问题的开始）。战后，他们整体加盟福特汽车公司，把数字管理引入现代企业，在福特公司构建了强大的财务控制体系，人数最多时达到14000人，这使得这家30万人的巨型公司在成本控制、绩效管理方面有了相对可靠的监管平台。后来麦克纳马拉担任了国防部长世界银行总裁，兰迪担任了福特公司总裁。 \n\n他们在二战美国空军物资保障供应工作中，发现几个关键点： \n\n1、物资供应质量、交货期和成本的关键不在供应商多少，而在供应商质量，也即取决于供应商资格认证和筛选，以及制造过程的全程监控，这个发现导致了后来的供应商资格认证体系和供应商筛选的数学模型（现在常用层次分析模型）和生产过程控制模型（现在常用PDCA循环+统计分析软件SPC 即统计过程控制）技术诞生诞生； \n\n2、物资保障数量，不取决于仓储绝对数量富裕，而取决于仓储分布、品项配置和仓储调度，这个发现直接导致了仓储分布控制、品项优化和仓储调度几个学科诞生，例如仓储分布管理采用最优控制模型，仓储调度采用排队理论模型，品项优化采用统计分析模型； \n\n3、运力保障，不取决于绝对运力富裕，而取决于运力最优配置，调度和预置，这个发现导致了网络优化调度模型，整数规划模型和多目标决策在运力管理中的广泛使用； \n\n4、采购的核心不是订单及时、准确和低成本，而是采购计划的优化，减少浪费和囤积，这个导致了对策论模型在物流管理中的应用。 \n\n5、物资分拨供给效率，不取决于物资充分多，而取决于资源最优配置和及时、准确和精细配送到位，这个发现导致了资源最优配置模型（目前主要是线性规划模型）在物流业的广泛使用。 \n\n这五个发现就是现在供应链管理的基础原理或专业分布。 \n\n既然供应链管理是从军队后勤开始的，我们先来介绍一下军队后勤是如何从物资保障供给进化到供应链管理。为了保障大家不发生概念混乱，我约定在我这里，后勤与供应链等价，当我我用后勤这个单词时，就是在讨论美军的供应链，当我用供应链这个单词时，就是在讨论军队后勤中的核心技术推广到企业供应链管理中。 \n\n我们都知道，后勤保障力是军队战斗力的有机组成部分，是聚集和释放战斗力的重要支撑。在正确的时间、正确的地点，把正确数量的物资送达正确的用户，这是企业供应链管理的原则，也是美军对后勤部队保障力提出的基本要求。 \n\n从二次大战后，美军后勤最大特点是全球保障，全球配置资源，把原始的以补给为基础的粮弹油料供应系统转变为以配送为基础的供应链系统，强调联勤保障的灵敏性、可见性和可行性。 \n\n军队后勤与企业的供应链一样，都是计划可行性的保证，没有后勤保障或供应链保障，任何计划都是狂想或梦话。美国将军说过：设想军队调度，可以在地图上随手乱画，但是真的实施，却要看后勤部门脸色（原话是：“我经历的战争愈多，就愈加认识到战争是如何完全依赖于后勤和运输的……你想在何时把你的军队运动到何地并不需要多少技巧和想象力的；但你若要知道在什么地点可以部署军队，以及能否在该地维持你的军队，那就要有丰富的知识，要进行艰苦的工作——马丁.范.克利维尔德的《从华伦斯坦到巴顿的战争后勤保障》）。 \n\n一、美军后勤如何进化成供应链管理--美军后勤改革要点 \n\n美军是世界上最重视后勤建设的军队。美军始终以战争需求牵引后勤技术和理论自我更新与完善，推进改造编制体制，同时实现后勤装备连续升级换代。 \n\n美军作战纲要明确阐述：后勤制胜。美军在一次大战时，前线战斗人员：后勤保障人员为1∶0.24；二次大战为1∶0.28，朝鲜战争为1∶0.36，越南战争为1∶0.37，海湾战争为1∶0.82，伊拉克战争为1∶1.5，例如伊拉克战争时期，50万人中有30多万人是从事后勤任务的支援部队。 \n\n美军现役140万人，一线作战人员仅20多万，作战支援和后勤保障力量所占比例比我军高得多。 \n\n但是美军后勤在第一次海湾战争时，是出了大问题的。例如美军第三机步师在打到巴士拉附近时，不得不停下来，因为后勤补给严重不足，无力继续推进。当时在电视上，我们也能看见，美军士兵３６小时吃一顿饭；伸手向平民索要食物；一只鸡蛋成了士兵最美的食物；车辆因缺少零件抛锚；为躲避风沙官兵在车辆下席地而卧等等。这还是在第一次海湾战争之前，美军至少准备了半年时间的结果，到头来后勤补给还是一团乱麻，后方物资堆积如山，浪费严重，而前方士兵则在沙漠泥坑中，忍饥挨饿，如大旱望云霓盼望补给。而后方后勤部门面对的问题更严重，例如重复申请，库存积压，无效运输，后勤保障效率低下，例如美军向战区运送了4万多个集装箱的作战物资，由于箱内物资缺乏可见性，不知道箱中装的是什么以及收件人是谁，不得不将其中的2.8万个打开，清点，重新封装，重新纳入运输系统。直到战争结束，还有20%的集装箱没有打开。战后，美军不得不展开了一场持续达一年，才将价值100多亿美元的剩余作战物资运回国内，花费高达27亿美元。所以美军战后总结：知道部队和补给品的位置，与实际拥有它们同样重要。 \n\n美军这时认识到，没有后勤的转型就没有军队的整体转型，后勤改革落后，拖了军队整体作战能力进步的后腿。为此专门组织了一个调查委员会，调查如何改善在战前保障物资的储备尽可能节约不浪费，在战时如何完整保障前线物资需求的数量，速度和配送精确度，由补给式后勤向配送式后勤转型。这是美军后勤从传统的物流配送开始向供应链管理的开始。这时是1993年。 \n\n1996年，美军在《2010年联合作战构想》中，把上述调查报告变成了后勤改革方案，那就是著名的聚焦后勤，也即适于作战的感知与响应后勤改革。美军这种后勤革命性变革其实是以网络为中心的供应链管理 \n\n经过20年改革，美军目前后勤模式是：聚焦后勤=精确后勤+实时后勤+感知后勤。 \n\n聚焦后勤是美军于1996在《2010年联合作战构想》中明确提出的，与这一概念相对应的作战理论则是美军的新联合作战理论。在《2010年联合作战构想》中，“聚焦后勤”被作为与“制敌机动”、“精确打击”、“全维防护”相并列的四大作战原则之一。 \n\n聚焦后勤的定义：信息、后勤和运输技术的融合，可对危机做出快速反应，可跟踪、调拨包括运输途中物资在内的各种资产，可在战略、战役和战术输送中正确编组配套后勤力量和持续保障力量。 \n\n简单说就是通过信息融合等高技术手段，将分散在世界任何地区的作战部队及其保障力量，快速而准确地聚焦于作战所需要的地点，集中使用后勤保障力量，协同各种保障力量和一切高技术保障手段，快速而准确地释放后勤保障能量以满足联合作战部队的各种需求。 \n\n精确后勤定义是：通过信息技术在后勤领域的广泛应用，降低库存，缩小后勤摊子，为一线部队提供更迅速、灵敏的保障。 \n\n精确后勤是基于美军的联合信息作战理论提出的：正确的时间和地点获得准确的军事信息、军事物资和军事能量才能有效地转化为战斗力，才能掌握战场的主动权。所以精确后勤就是信息化后勤。 \n\n实时后勤定义是：由远离战场的补给基地直接向一线部队配送，高效直达，实时保障。实时后勤要点是以物资配送为基础的后勤保障系统完全信息化，避免了过多的物资堆集于战场，以及由此而造成人力、物力资源的损失和浪费。 \n\n实时后勤改变了先建立一个主要的补给基地，在战线向前推进一段距离后，再一个一个地建补给站，使补给线一步一步地向前延伸为前线部队提供补给的保障方式。 \n\n实时后勤在2003年伊拉克战争中得到运用和实战检验，也是在这次战争中，美军第一次在世界上实现了网络中心战为核心的联合作战模式。所以不要小看美国人的改革能力和实际动手能力。任何小看美国人执行能力的国家，都会被美国人打得满地找牙。 \n\n感知后勤定义是：对散布于战场的各作战单元利用卫星通讯系统和战场总线系统进行网络化和一体化的连接，以实现对战场态势的实时感知与共享，进而实现先敌行动和部队自我同步协调，最大限度地发挥作战力量的整体效能。这就要求采用各种先进管理技术平台（例如SCM平台，移动通讯，快速储存），协同各种后勤资源和后勤参与者行动，保证后勤供应链精准运营，只有这样，才能实现精确灵敏的适应性保障，保证基于效果的联合作战得以实施，从根本上弥补传统保障的不足之处（这就是供应链管理协同打群架的另外一种描述）。\n\n感知后勤是美军的后勤信息化的基本大纲，是美军以作战平台为中心向以网络为中心转变的核心模块。 \n\n美军目前已经实现将500多个后勤信息系统整合纳入全球作战保障系统平台，卫星联网，并与战场总线系统互联互通，平台可以与前线最小作战单元互联互通，甚至到单兵或单车。士兵可以通过手持设备接入后勤作战保障平台。 \n\n同时，全球作战保障系统平台可以通过传感器阵列自动采集后勤数据：例如现在大量使用后勤数据快速交换技术，仓储定位和检测无线终端，补给物资都有射频识别标签，集装箱有货运激光卡，运输车辆都有卫星定位通信系统，陆海空联运集装箱内设数据阵列传感器，而各种装备设备都嵌入监控系统监控运行状态，腕带装置感知伤病员体征，保障分队配发甚小口径终端等无线通联设备，实现了后勤在战术最后一英里的及时可见可控，能够采集和提供及时，准确的各类后勤信息，为透明高效保障提供手段支撑。借助这个系统，后勤供应链指挥平台可以监控和管理每年从40个国家400个地点发出的270000个运输军事物资的集装箱，军事指挥官能够准确知道供应品从工厂到散兵坑运输途中的确切地方，如果出现了特别紧急需求，军官们可以改变集装箱运输的方式，使物资的供应与管理具有较高的透明度，为作战部队提供快速、准确的后勤保障。这些技术使用，是美军后勤保障效率得以大幅提高的核心因素。例如在第一次海湾战争100小时的地面进攻中，美国人在中东储备了够60至100天使用的弹药。而在第二次海湾战争中，美军依托信息化后勤系统，实施精确保障，仅用了4000多个集装箱的物资。油料运输量为100万吨，仅相当于海湾战争的1/6。 \n\n目前美军一线部队已经不需要主动提交后勤订单，因为他们所有的需求全部都会由军用现场总线+移动通讯+高速传输+海量存储+超级计算组成的信息系统事先感知，并主动让他确认，然后实现自动一对一，门对门配送（其实这就是沃尔玛的供应链模式：直接监控到卖场货架，自动补货，自动门对门配送，卫星监控运输车队动态，卫星数据传输仓储数据，自动监控嵌入的供应商供应，库存和出货数据，自动结算），一般说来，这种自动补货+自动提供服务的内容将完全符合一线的要求并减少浪费，甚至会包括一线自己实际需要却又没有关注到的需求。这就是感知后勤。 \n\n要实现上述目标，就必须后勤指挥系统完全实现信息化，例如必须实时，准确，完整的完成：对作战部队后勤需求准确预测和物资消耗实时采集数据监测，以此制定物资采购和储备计划，优化物资资源调度，优化配送资源，才能实现在需要的时间和地点将物资主动配送给作战部队。 \n\n这套做法，核心其实就是信息化后勤，利用信息技术和后勤信息装备，以有效管理的动态物资源取代固定的库存物资，以物流的速度取代物资数量。所以感知后勤必须具备全物资可视性能力，自动化指挥与控制能力，后勤需求的准确预测能力，从库存起点直达一线部队的快速配送能力，数量适宜的库存控制能力。 \n\n所以，感知后勤是一种完全免请领式后勤，通过后勤部门的信息系统，以及在战前对战场保障需求的精确预测和计划，在战中对一线保障需求的实时感知以及高效直达的配送体系来实现。 \n\n感知后勤与传统后勤保障方式最大的不同点是后勤部门获得完全的主动性，全军实现所需即所得的后勤服务保障，完成了由被动后勤向全主动后勤的跨越。 \n\n美军目前整体战勤比在1:0.8。已经实现打破各军种的后勤体系壁垒，把联勤、军种后勤、民间社会化和动员力，乃至友国盟军后勤协同管理，通过供应链按需灵活调用。 \n\n感知与响应后勤改革成功，目前美军一个单位的战斗效能评估不仅包括火力密度，机动能力，防护能力，通讯能力等等指标，还包括了弹药、油料、给养、水以及维持军事能力的其他物资装备的优化配置、储备、配送效率，而且有累赘上限（因为后勤储备太多的弹药、油料、给养或水会形成浪费影响效能，作战部队携带太多物资，机动能力就会下降，敏捷性就会降低，维持高战斗节奏的时间就会缩短），这是对越多越好和无限制供应等传统保障观念的扬弃，通过对后勤信息的精确掌握，实现后勤资源的精确输送和后勤力量的精确运用，达到适时、适地、适量的目标。这是供应链管理中配置正确，冗余适当，配送准时的原则描述。 \n\n所以目前美军大幅度提高了后勤指挥控制能力、快速反应能力和精确保障能力等。这其实也是后勤部队的核心保障能力，也是我们军队后勤改革的核心目标。 \n\n美军通过后勤改革，目前完全实现了能在72小时内向世界任何地方部署1个旅、96小时内部署1个师（相当我们集团军实力）、20日内部署5个师，据此筹备兵力输送、物资运输和预置等能力的基本目标。而且在初期行动中，在战术层次美军一线部队具备7天的自持能力，战役、战略层次相应进行支援准备。 \n\n在物资配送方面，美军目前实现了全球范围内陆海空军的部队用户平均等待时间分别为15、12.5和5天，并实现了配送优化（时间优化，空间优化和品项优化）。 \n\n在伤员后送方面，实现了黄金1小时法则，即从申请到伤员后送至适宜的救治机构，在1小时内完成，后勤已经实现按照此目标配置和调度战场卫勤资源与后送力量。 \n\n美军后勤改革的另外一个方向是大量利用供应链上的普通企业资源和力量，通过供应链管理协同他们动作，压缩战场后勤规模，使战场后勤更加精干和灵活，减少向战场的物资投送量，以商促军，以民促军，实行战场承包商保障。例如在第二次海湾战争中，大量租用国外运输公司对战时物资进行保障，在伊土边界建立了由承包商为主运营的北方后勤补给基地，在周边国家筹措大量的保障物资。这个改革是供应链管理平台的应有之义。 \n\n二、美军后勤与我军后勤的主要区别 \n\n下面简单描述一下我们与现在美军后勤体系的差距要点，不涉及泄密。 \n\n我军是世界上最大霉粉，最重视研究美军。不过目前由于历史原因（我们的大陆军出身，且基础是靠民工支前打赢解放战争的后勤体系），美军的后勤和我军的后勤是不不同的。 \n\n首先是业务范围不同。 \n\n我军后勤核心概念是用在战场后方开展的一切工作，这点与前苏联军队相同，苏军，后方与后勤同义。因此，我军后勤的业务范围相对多而杂，以至于财务和审计等各国军队均独立出来的业务职能，我军也将其纳入后勤的范畴，因为它们具有后方属性。 \n\n美军后勤业务范围主要是物资供应，运输和维修，也称为三大核心职能，所以美军实际后勤与物流同义，主要是物资供应和运输两大职能的融合，所以美军后勤即为物流采购，运输，库存，分拣，调度，配送，维护维修。 \n\n第二点不同是美军后勤不是物资供应（Supply）而是供应链配送。Supply重点在于强调物资保障的职能，而Distribution作为供应链的一段，比较强调物资供应与运输的一体化，多段的配送（Distribution）构成物流（logistics），进一步向上下游采购和门对门配送延伸则为供应链（Supply　chain）。美军目前后勤是基于配送的后勤（DBL），主要是借助信息技术，实现物资保障与运输的充分融合，实现对物资的动态实时化管理，从而最终实现主动配送。 \n\n在改革前，我们的后勤体制是订单拉动式，也即在和平时期，按照基准物资计划，按时配发，战时由前方部队提交申请物资清单，然后顺着指挥链逐级上报，然后逐级分发，随运随发。但是前方部队申领物资的时间存在延迟和阻塞，导致经常和后方运输、中转、仓储、分发渠道脱节，缺乏统一指挥协调。结果浪费大，效率低，管理乱，前方部队却拿不到需要的物资。例如汶川地震救灾时就是如此，后方物资堆积如山，前方忍饥挨饿。 \n\n第三点不同是美军把民用资源整合进了军队后勤系统。在其《联合后勤》条令中明确将民用资源与自身的后勤整合为核心的作战合同保障，这是他们后勤的核心能力。实际上美军后勤体系整合企业就是真正的军民融合。 \n\n而我们目前在一线后勤，还是各军兵种后勤部门单打独斗。 \n\n第四点不同是美军注重后勤的系统管理，强调部门之间的协作，并用SCM平台把全军500多个单位的后勤信息系统集成为一体，实现了真正的整体后勤指挥控制。而我军注重后勤的业务管理，强调业务系统的自成体系，对于后勤作为一个大系统的整体性没有引起足够重视，因而也不会在各业务部门间的协调配合方面给予太多的关注。最终的表现就是，后勤综合部门作用发挥不强，经常各自为政，打架内讧，争抢资源。 \n\n企业供应链管理对美军后勤的影响是全方位的，更是基础性的。我们向美军学习后勤，实际上是在向美国供应链管理先进的企业学习，例如GE，例如沃尔玛。 \n\n美军后勤系统某种程度上与部分国防后勤承包企业的供应链系统是互相嵌入的，所以军民系统区分并不大拿到军队来就可以用。例如海湾战争后提出的后勤改革方案聚焦后勤的思想就就来源于美国联合太平洋铁路公司，感知与反应后勤来源于IBM，精益后勤的思想来源于日本丰田，ERP来自于GE，平衡计分卡和实时监控来自于沃尔玛等等。 \n\n其实美军的后勤管理体制，主要是巨型企业的SCM管理经验和管理模式，采用事业部体制和矩阵体制相结合，分层，网络化。其后勤军官和专业军士的培训体制与企业培训供应链运营专家完全相同。后勤体系内的内控，标准化，成本核算，全员绩效考核，质量控制，供应链控制，文档管理，管理信息化自动化，知识管理等等都照搬巨型企业模式（例如GE）。这种体系的好处是美军后勤军官和专业军士退役后，很容易到企业担任SCM管理人员（例如沃尔玛的SCM体系，就大量聘用退役军人），企业管理人员，也很容易到军队任文职（其实我们也很需要，曾经一位主管后勤的少将也说过，如果打仗，一定动员我入伍搞后勤调度）。 \n\n第五点不同是美军后勤体系有一个统一的绩效优化和评估系统，例如所有作战方案和后勤方案都要评估，例如化多大的代价，要取得什么样的效果，最后效果和代价与预期的差异？征用民营资源好，还是军队自运好？按类别供应好，还是按单位订单供应好？用轰炸好，还是用炮火好？是占领好，还是摧毁好？ \n\n而我们队后勤资源投入，基本是看菜吃饭，有多少花多少，有钱多花，没钱少花，不以效果为投入标准。这也跟我军长期穷困有关。 \n\n第六点不同是我军以前由于历史原因，理解后勤就是后方勤务，保障力量太靠后，而一线保障不足，多数保障力量停留在战略层面，而后方到战区，战场最后一公里的后勤能力极为欠缺，有时不是缺后勤物资，而是缺前线物资配置能力，缺物资调度能力，缺前线运输能力，缺各后勤勤务参与单位协同动作能力，一线配置的保障力量严重不足，影响一线部队作战能力，例如现在很多装甲旅缺少大型拖车，公路机动，坦克运输还得外包给物流企业，在和平时期无所谓，在战时，这种外包就是不可能完成任务。而在后方后勤司令部，目前已经数字化，网络化，各种计划漂亮，各种仓储管理信息系统先进，但是在前线，还是极为原始的后勤管理调度能力，还靠手工作业，单打独斗，各自为政，所以经常出现后方基地和军工企业物资堆积如山，而我们一线士兵在喝脏水，吃方便面。这不完全是运输能力不够和物资不够，而是后方根本不能实时感知前方状态，需要什么，需要多少，何地需要，何时需要，经常一团乱麻。例如当年汶川大地震，就是后勤体系露底的时刻，美军看完我们救灾整个后勤运作后，松了一口气：就这种后勤能力，不比当年在朝鲜战场进步多少，是无法支持PLA大范围机动，承担长期跨区域作战任务的。 \n\n三、供应链管理的简单发展脉络 \n\n第一个阶段，是把物流从销售部门的附加职责中划分出来，标志是1915年物流（Physicaldistribution，PD）概念创始人阿伽•萧在《市场流通中的若干问题》指出：物流是与创造需求不同的一个问题......流通活动中的重大失误都是因为创造需求与物流之间缺乏协调造成的。又称：物资经过时间或空间的转移，会产生附加价值。 \n\n阿伽•萧说的物流（PD）含义是实物分销、实物配送、物资流通，物流不创造需求，但产生附加价值，是与市场营销对等而独立的活动，应当从中分离出来。 \n\n第二个阶段，是1963年全美物流管理协会（National Council of Physical Distribution Management(NCPDM)）成立，物流成为一个独立产业，从附属于市场营销活动中分离。 \n\n物流独立的运营模式及产业，标志着美国企业开始运营全球化。 \n\n第三阶段是20世纪80年代，NCPDM改名为美国后勤管理协会（Council of Logistics Management，简称CLM） ，美国物流业开始接受军队后勤体系概念，开始信息化，并利用信息化，参与美国企业跨界限、跨行业的跨国扩张，在美国跨国企业整合全球资源，构筑全球规模的生产和销售系统过程中，成为重要一部分。这时美国物流企业大量采用军队后勤理念，模式和技术，协调整合来自海外原料产地、制造工厂和不同市场的复杂的物流和信息流，实现了以后勤为导向的组织结构变革，把传统以职能为中心的组织体系转变成以流程为中心的组织体系，实现跨职能的运行流程，并为彻底信息化扫清组织体系障碍，这个过程中，美军的后勤管理经验，人才，储备技术，装备，理论，信息化平台等等软硬件，为物流产业组织结构的变革提供了动力。举例来讲，世界最大零售业企业沃尔玛是美国国防部后勤局最大的后勤供应商，它们军民联合，推动RFID应用于Logistics（后勤），沃尔玛的供应链体系也采用了美军部分技术。 \n\n这样Logistics就成为PD的军事化升级版。 \n\n其实军事产业化和产业军事化正是美国推进全球化的两大利器。 \n\n第四个阶段是2005年1月，美国后勤管理协会（CLM）更名为供应链管理专业协会（Council of Supply Chain Management Professionals，简称CSCMP），并宣称：全球后勤（Logistics）进入供应链管理时代。 \n\n长期以来，美军为了维持其领先全球，领导世界的地位，一直采用强化全流程控制力和寻求多伙伴两个策略。而这正是美军供应链管理的核心策略，这两个策略，也成为供应链管理的核心原理：全流程控制+参与者动作协同。 \n\n企业引进美军后勤模式，也是逐步的。简单说，最早的供应链上的成员企业，其管理理念基本上都集中在为生产而管理，市场的竞争表现为企业产品的数量与产品实体质量的竞争，企业之间虽然也存在某些方面的协作，但基本上是一种本位主义的状态，即便是同一企业内部的不同部门也是如此，其组织结构以各自为政的职能化或者区域性的条条框框为特征。在这一阶段，供应链上的成员企业之间合作关系极为松散。 \n\n为生产而管理的导向使供应链成员之间常常存在利益的冲突，链上供方与需方之间更多的是彼此的讨价还价，阻碍了如今意义上的供应链管理的形成。 \n\n在20世纪六、七十年代，虽然部分企业已经采用了物料需求计划（MRP）这一技术来管理业务，但也只是企业内部各职能部门分别在相互隔离的环境下制定和执行计划，数据的完整性差，甚至在企业内部也很难做到信息上的统一与集成，更谈不上业务链上的标准化与数据流。 \n\n1989年G.C.Stevens基于军队后勤管理运营模式，提出了供应链管理的概念，包括了在企业内外部集成的思想。 \n\n20世纪90年代初，企业竞争的焦点已由过去的数量和质量的竞争转向生产效率的竞争。企业内部的职能划分及相应的组织结构也发生了转变，这时大多数企业开始进行组织机构的精简与改革，从分散式职能化和部门化转变为集中计划式，并开始业务流程重组（Business Process Reengineering，BPR），但并未意识到供应链对他们的价值。 \n\n企业供应链管理的真正实践开始于零售业，例如沃尔玛。沃尔玛引入供应链管理，开始目标是降低销售费用和最大限度地利用有限的空间，核心其实是降低订货成本，后来推广到降低整个物流成本（包括采购成本，仓储成本，运输成本，配送成本，退货成本和损耗成本等等）。为此，沃尔玛不得不与供应商共享以前视为企业机密数据的销售和市场信息，与供应商共同确定消费需求并进行市场定位，确定最优库存量和订单的生产和配送，实现生产供应与需求之间的相互匹配，减少浪费，满足客户需求（最后实现了沃尔玛管理信息系统与供应商管理信息系统采购和合同管理模块，仓储模块，配送模块，运输模块，销售模块等等的互相嵌入）。这就是原始的企业供应链模式。当时沃尔玛采取供应链策略有两种：一种追求大批量，低毛利，一种追求高毛利，多品种，针对不同产品采用，所以他的供应链系统很复杂。 \n\n信息技术的发展为供应链管理提供了基础，制造资源计划（MRPⅡ）的推广、企业资源计划（ERP）和精益管理（JIT）模式和系统的引入与应用，逐渐使企业的内部实现了信息集成，为企业内部供应链上下游之间的业务提供了同步处理所需的信息，同时，企业之间的业务联系方式也随着通讯技术的发展而不断得到改善，使供应链上的上下游之间传统的业务连接，在市场竞争（需求）的驱使下逐渐向供应链运作方式转变。但初期，供应链管理主要还是集中在企业内部的供应链运作上。 \n\n20世纪90年代后期，市场的竞争已由过去成本与质量的竞争演变成为时间的竞争，快速响应市场需求成为核心指标。企业管理核心也就从内部生产过程转向产品从原材料供应到将产品送到最终客户的整个供应链周期，在供应链的销售端与生产制造商和供应商有着同样多减少成本或增加利润的机会，这样财务管理（主要全面预算管理和完全成本管理）就自然被引入供应链管理中，然后就是 高级计划排程（APS）系统、制造资源（ERP）系统、仓储管理（WM）系统、客户关系管理（CRM）系统、物流信息系统（LIS）、供应链决策系统（SCS）、数据挖掘（DM）和商业智能系统（BI）等等信息管理技术不断与供应链管理系统（SCM）集成，使得企业在运营管理上从计划、执行到优化与决策，都在ERP的基础上更进一步，在有限的资源基础上合理、有效、及时地开展业务。供应链上参与者以市场和客户的满意度为供应链运营的出发点，按照核心企业的运营计划，协同动作，共同分享利益。目前互联网和电子商务及其相关技术使实时，动态和整体的供应链管理协同动作成为现实，企业利润的挖潜的核心从企业内部转移到企业与外部交易成本的节约、库存的控制和内部物流的简化上。 \n\n目前，基于移动通讯平台+互联网支付结算+电子商务交易的的供应链系统彻底改变了企业原有的物流、信息流、资金流及商流的交付方式和手段。一些新的业务协同模式与技术开始使用，如供应商管理库存（VMI）、协同预测与供给（CFAR）、协同计划、预测与补给（CPFR）、分销商集成（DI）、第三方物流（3PL）、第四方物流（4PL）以及第五方物流（5PL）等；同时，供应商关系管理、产品生命周期管理、供应链计划和供应链执行等系统的运用，使供应链成员之间的合作更加紧密，整个供应链的运作更加协同化。 \n\n供应链管理，是物流管理的发展与演进，是物流管理的整合与优化，是物流管理的升华与升级。 供应链管理，实现了从采购，生产，销售，配送，物流，仓储的全运营过程的体系控制。 \n\n现在企业供应链管理的核心任务（也是技术难点，SAP，甲骨文，微软等等企业就靠拥有能够部分解决这些难点的金刚钻混饭吃）包括： \n\n★供应链协同运作的系统化管理；（核心是采购管理，库存管理，生产管理，分销配送管理，客户关系管理等等的集成技术和优化技术，以及共享策略） \n\n★生产两端的资源优化管理；（核心问题是供应商选择和监控，生产计划弹性，分销决策，储运资源优化和配送网络调度等等） \n\n★快速的分布式决策管理；（群决策和分布式数据库数据挖掘） \n\n★不确定性需求信息的共享管理；（需求监控和实时响应） \n\n★供应链实时的可视性与向前的可预见性管理； \n\n★供应链流程处理及事件处理的监控与能力管理等等。 \n\n美军数据有点老，将就看，军迷不要较真，我只是想谈管理。"
		},
		{
			"post_id": 9,
			"title": "中国航空材料介绍 China Airspace Material Introduction",
			"date_published": 1503756415.257,
			"body": "前几天看大国工匠，有一集是《为导弹铸造衣服的人，中国航天科工首席技师——毛腊生》，这个节目我很有印象，是因为讲的就是遵义061，毛腊生是土生土长遵义人，一口老遵义话，而他做的就是为HQ12铸造发动机机体（可能这是中国媒体第一次解密导弹发动机机体外形），他铸造用的材料，就是一种高强度钢。 \n\n说道中国材料工业，就不得不提中国航空工业，因为中国材料工业的皇冠和明珠，都在他们手里。我国的航空材料技术、工艺和生产装备水平，是我国材料工业离世界水平最近的。 \n\n航空材料指用于制造飞机的材料。一般特指机体材料和发动机材料，电子信息材料一般不直接算作航空材料。 \n\n飞机机体材料和发动机材料技术要求高，例如要求轻质、高强、高韧、耐高温、耐低温、抗氧化、耐腐蚀、高可靠性、高耐久性与长寿命等。而且类型多，例如我国批量生产的歼6飞机就需要12319项原材料，直5则需要9019项原材料，这些材料生产厂家超过800家，涉及工人和技术人员超过100万。所以可能毛主席决定独立自主建立自己航空工业体系时，根本没想到这是一个巨大的产业系统，几乎涵盖全部工业体系，而且是在中国刚刚结束内战的废墟上建立，而且居然只用20年，就就基本建立了中国自己的航空工业制造体系和原材物料生产体系（我国航空材料从20世纪50年代中期开始至70年代末就完成体系建设）。这是证明中国人搞大工业体系能力的一个体现，对比一下当年工业基础比中国好得多的印度，他们现在是什么水平？30年研发一架LCA飞机，作战半径只有500公里，载弹量3/4吨。 \n\n一、建立完善的研究和制造体系 \n\n中国航空材料从仿制开始起步。 \n\n50年代，中国航空工业起步阶段，可以说是苏联老大哥手把手教的，所以当时所有航空材料也都依赖苏联进口。 \n\n不过具有战略远见的TG领导人，一开始就知道指望谁都不如指望自己，所以1952年4月，中央财经委副主任李富春就受毛主席委托，开始组织建立航空工业独立自主生产体系，多次召集会议专门研究航空工业自行制造所需解决的问题，陈云当时明确指出：“走向飞机制造最困难的是技术人员和原材料问题。如果原材料不能立足国内，那才是最大的困难。” \n\n所以在中苏蜜月期，中国就建立了独立自主的航空材料生产基地和研究机构。例如周恩来1952年8月去苏联谈判156项时，就把航空材料研究所的建设列入苏联援建重点156项之一，后来经过苏联援助，航空材料研究所在1956年完成建设，这是我们现在能够独立生产飞机和涡扇发动机的种子。（所以说兔子不腹黑，真没人信）。 \n\n第一个五年计划中，李富春就组织了全国冶金、化工、机械、纺织、轻工等部门中一批设备和技术力量好的企业承担航空材料的试制生产。陈云干脆直接担任项目经理，率领冶金工业部部长王鹤寿到抚顺、沈阳等地现场研究解决高温合金的试制问题，并决定改造一批老厂：\n\n抚顺钢厂为喷气发动机高温合金材料生产基地； \n\n沈阳橡胶四、五厂为航空密封件材料生产基地； \n\n沈阳橡胶三厂为飞机轮胎生产基地； \n\n锦西化工厂为航空有机玻璃生产基地； \n\n天津油漆厂为航空油漆生产基地； \n\n上海化纤厂为航空伞用特纺材料的生产基地等等。 \n\n同时兴建一批以承制航空材料为主要任务的大型企业： \n\n哈尔滨铝合金加工厂负责飞机合金铝生产； \n\n鞍钢第二冷拔无缝钢管厂负责飞机高压管道材料生产； \n\n上海钢铁三厂、上海钢铁五厂、长城钢厂和大连钢厂负责飞机需要特钢和超强度钢生产（例如飞机大梁，起落架都需要高强度钢）； \n\n东北铝加工厂和西南铝加工厂（负责生产飞机用铝型材）； \n\n一坪化工厂和晨光化工厂（各种润滑油料）‘ \n\n德阳二重（负责飞机铸件，例如喷气发动机各种铸件，起落架和大梁铸件等）等等。 \n\n同时还建立了设计航空各专业的成体系的高等院校，如北京航空学院、西北工业大学、北京钢铁学院、东北工学院、南京航空学院、上海交通大学等，例如在北京钢铁学院和东北工学院成立了高温合金和精密合金等专业。 \n\n哈尔滨铝合金加工厂经过近一年的努力，试制成功了近20个牌号的板材、棒材、型材、管材和丝材，满足了航空工业使用的90％变型铝合金。 \n\n鞍钢第二冷拔钢管厂投产后，航空工业所需管材的93％得到了解决。当时，我国成批生产的初教5飞机、М11ФР发动机和歼5飞机、涡喷5发动机所需原材料的自给率分别达到98％、96％、81％和78％。 \n\n等等。 \n\n同时，中国科学院金属研究所由以为钢铁服务为主，1957年转向新材料、新技术研究与开发；北京钢铁研究院、北京有色金属研究院，主要从事新材料、新技术的研究与开发。上海钢铁研究所、锦西化工研究院、北京化工研究院、北京橡胶研究院、长春应用化学研究所等单位也都开展了有关航空材料研究与开发工作。 \n\n1960年，苏联撕毁协议，中断航空材料的供应，中共中央、中央军委决定组织全国力量，全面解决航空材料的供应问题。薄一波副总理亲自披挂上阵，以104号专案任务，下达鞍山钢铁公司、抚顺钢厂等全国10大钢厂共同完成高温合金的试制生产任务。为解决歼6飞机所需关键材料，1961年又下达了105号专案任务。 \n\n为了完成高温合金研制任务，冶金部钢铁司司长刘伯乐、航空工业局副局长方致远、钢铁研究院副院长吴峰桥、航空材料研究所所长魏祖冶等组成试制协调小组，组织钢铁研究院、航空材料研究所、中国科学院金属研究所、抚顺钢厂和沈阳发动机厂打群架，协同攻关。经4年多的不懈努力，终于掌握了高温合金的冶炼、轧制、模锻等工艺，取得了成功。至1965年，我国航空工业所需的高温合金满足了需求。 \n\n接着，为了批量生产高温合金，冶金部在抚顺钢厂、齐齐哈尔钢厂、大冶钢厂和上海钢铁五厂、重庆102厂建立了真空冶炼炉和电渣冶炼炉。为了解决高温合金原料问题，建设了甘肃镍矿，改造了上海冶炼厂来完成金属镍的提纯。而第一机械工业部副部长、著名机械工程专家沈鸿亲自担任高温合金冷轧机制造的项目经理。 \n\n随后，国家在马鞍山、德阳、重庆建立了大型锻压和轧制加工基地，解决了航空大型锻件和铝加工问题；在西南建立了长城钢厂作为特殊钢的生产基地。化工部在航空材料研究所配合下，研制成功了多种航空非金属材料，如密封材料系列、橡胶材料、飞机座舱玻璃（定向拉伸有机玻璃）等。与此同时，石化科学院在侯祥麟院长主持下，利用国产原油成功地试制出各种航空用油品。 \n\n到1965年，批量生产的歼6飞机所需的12319项原材料和直5所需的9019项原材料，全部由我国756家厂、所提供。我国自行设计的高空高速歼击机歼8所用整体壁板、耐高温透明材料、氟塑料高压软管、金属软管等关键材料也都是靠自力更生，全国各单位大力协同解决的。 \n\n二、建立自己的高温合金材料体系 \n\n航空材料最重要的是飞机发动机材料，其中高温合金是技术、工艺难度最大的。下面重点介绍这一部分。这也是师昌绪先生贡献最大的一部分。 \n\n航空发动机的要害是提高推重比和降低油耗，因此高温材料是决定性因素。在一台先进发动机上，高温合金和钛合金分别占发动机总重的55％－65％和25％－40％，所以研发高温合金及钛合金对提高发动机性能来说至为重要，其中涡轮叶片及涡轮盘材料更为关键，因受力复杂且处于高温高速高压的状态中，工作时间又长。 \n\n1956年6月，冶金部刘彬副部长、钢铁局李振南副局长担任项目正负经理，苏联冶金专家朱也夫为专家组顾问，由抚顺钢厂、鞍山钢铁公司、钢铁工业试验所（钢铁研究院前身）、沈阳发动机厂和航空材料研究所共同执行，成功生产出我国第一个高温合金GH30,经鞍钢冷轧出板材，在沈阳发动机厂制成火焰筒，1957年在涡喷5发动机上通过了长期试车。1962年，航空材料研究所吴世德和钢铁研究院傅宏镇领导下，在吴峰桥、荣科、师昌绪、颜鸣皋、吴世泽等专家指导下，经过顽强努力，解决了一个又一个批量生产工艺技术关键瓶颈，高温合金GH30正式批量生产，我国开始掌握高温合金生产工艺，为以后研制更高级的高温合金积累了经验。 \n\n建国初期，冶炼高温合金的镍、铬奇缺，又受到国际严密封锁。所以1957年师昌绪提出我国应开展以铁基代镍基高温合金及稀土金属在高温合金中的作用两个研究课题，并分析了苏联人提供的ЭИ437Б（GH33），这是当时苏联用量最大的镍基高温合金，提出基于铁基的高温合金新配方，大幅减少镍用量，与抚顺钢厂合作设计出808合金（GH135），并轧成棒材，模锻出涡轮叶片，但在试车过程中发生了共振而告失败。这是师昌绪先生回国后的第一个高温合金产品，尽管失败，但是为后来他领导建立具有中国特色的高温合金体系奠定了基础（808合金后来用于生产涡轮盘，代替ЭИ481（GH36））。 \n\n随后，北京钢研院和上海钢研所分别开发出可代ЭИ617作为涡轮叶片的红星13（GH130）及JF43（GH302），虽然都通过了长期试车，但在性能指标上仍然不能完全代替ЭИ617作为叶片用于发动机，只能广泛用做增压器等部件材料。 \n\n1962年，为解决GH135的冶炼、铸锭（点偏）、加热（炸裂）、锻造（温度区间太窄）大量技术难题；特别在切削和拉削过程中，不但要选用与加工镍基合金不同的刀具，而且还要探索合适的加工参数，师昌绪先生领导中科院金属所的课题组，在抚顺钢厂和沈阳发动机厂配合下，彻底解决这些问题，使GH135盘坯完全符合质量要求，1966--1973年用于不同型号的发动机上千台，并有300台出口国外。 \n\n1973年以后，我国甘肃镍矿开发成功，我国不再缺镍，GH135为性能更好的镍基合金GH33A所代替。 \n\nGH140（GR2）是航空材料研究所于1958年开始研究的我国第一个板材铁基高温合金。它是以ЭИ703合金为基础，利用我国富有的钨、钼、铝、钛元素对合金进行综合强化，经过多项试验研究，突破冶炼和变形两个难关，与抚顺钢厂、鞍山钢铁公司、沈阳发动机厂合作，制成涡喷6发动机火焰筒， 1966年生产定型，并逐步扩大在10多种发动机和飞机上使用，材料品种有薄板、中板、棒材、热轧管、冷拔管、丝材、环形件、锻件等。目前几乎所有特钢厂都能生产这种合金，成为我国航空工业使用最广，生产量最大的高温合金牌号之一。截止到1977年，各钢厂累计生产7,000余吨，节镍3,000多吨。 \n\n在节镍指导思想下，国内开发出多种节镍铬不锈钢、耐热钢和低合金高强度钢。航空材料研究所与西北工业大学合作开发出无镍的18CrMn2SiMoBA（GC11）低合金高强度钢作为飞机承力框架结构材料，在沈阳发动机厂、南昌飞机厂等单位推广，历时35载，解决了多项技术关键。 \n\n引进英国罗罗公司斯贝发动机后，北京钢铁学院仿制出出美国常用的两个涡轮盘牌号A286（GH132）及V57（GH136），又组织全国力量试制了Incoloy901（GH109）。 \n\n师昌绪先生在国内最早开发了用于工业燃气轮机的耐热腐蚀高温合金K38（IN738），后又进行了改进成为K38G，为了满足斯贝发动机用于舰艇的要求，与西安发动机厂合作开发出用作涡轮叶片的DZ38G及DD8合金。 \n\n中国是继英、美、前苏联之后第四个建立完整高温合金工业体系的国家。 \n\n首先是合金类型齐全。因为我国每引进一种发动机就要仿制一批高温合金，所以我国高温合金牌号的数目在国际上都居前列。目前我国铁基变形高温合金有14个牌号；镍基变形高温合金有30个牌号；钴基变形高温合金有3个牌号；等轴晶铸造高温合金有26个牌号；定向凝固高温合金有9个牌号；单晶高温合金有5个牌号；金属间化合物基铸造高温合金有2个牌号。我国开发了30多种铁基高温合金，其中18种为独创。GH135（808）作为棒、盘材料起到开路先锋作用，而GH140（GR2）作为板材在我国开发的所有铁基高温合金中最富成效。 \n\n其次是我国强调了资源立足国内，所以我国变形高温合金特点是铁基变形高温合金在变形高温合金中占30％。用作燃烧室的铁基变形高温合金（GH140）最高使用温度可达900--950℃；用作涡轮盘的可使用的最高温度为750℃（GH761）。 \n\n其三是中国高温合金生产工艺特殊，例如中国是最早采用电渣重熔工艺，并发展为真空电渣重熔工艺，不但可以减少夹杂物，也可降低气体含量；再例如由于当年我国压力机能力不足，师昌绪先生早在1958年就采用包套挤压工艺使难变形合金锭变为棒材，这一工艺后来发展为包套轧制，包套锻造。不但用于轧制棒材，而且用于生产饼材或盘材，解决了的问题。 \n\n除了生产航空发动机，我们也用同样工艺技术和材料开始生产大型燃气轮机，目前我国专用于工业燃气轮机叶片铸造高温合金有3项（K213,K4537,K491），此外用于航空涡轮盘的高温合金GH132也用于制造大型燃气轮机涡轮盘。 \n\n三、建立自己的钛合金研发和生产体系 \n\n钛是重要的航空航天材料，我国资源丰富。1956年《中国12年科技规划》就将钛的研究与开发列入了项目。 \n\n冶金部在1956年就开始建立海绵钛及钛的生产基地（抚顺301厂、苏家屯有色加工厂，海绵钛生产厂后来又有亚洲最大的遵义906厂）。 \n\n航空材料研究所建所之初就组建了以颜鸣皋为首的钛合金研究室，于1958年炼出了第一个用于研究用的钛合金锭。与此同时，冶金部有色金属研究院、上海钢研所及中科院上海冶金所等单位也都开展了钛合金的研究工作。 \n\n1965年航材所与有关科研院所、钢厂及航空发动机厂研制成功钛合金中用量最大的TC4（Ti－6Al－4V），用于涡喷6发动机压气机盘及叶片。 \n\n1979年航空材料研究所与上海钢铁五厂、北京有色金属研究院等单位合作在原苏联BT9的基础上开发出了钛合金的最高工作温度（长期）为550℃（TA22,又称Ti55），打破国际不加稀土的惯例，而加入钕形成强化相。这种高温钛合金，采用了先进的铸锭工艺，解决了偏析问题，采用高低温交替锻造工艺，解决了大锻件组织不均匀的难题，综合性能超过国外同类产品水平。作为盘件材料用于多种型号发动机。 \n\n然后又成功研制出用于600℃的Ti－60和阻燃钛合金。中国也在钛铝中间化合物研制上做出了具有国际水平的工作，并在航天领域得到应用。 \n\n从1986年开始的第七个五年计划，我国对钛合金研究的投入显著增加，目前已经研究成功了飞机所需的各种类型的钛合金。 \n\n四、中国特色的以铸代锻工艺路线 \n\n1959年左右， TG决策层已经预见到中苏关系破裂不可避免，开始准备完全独立自主，要求航空工业体系准备走自己的路子，不能再依靠苏联。为此，航空材料组织领导部门提出完全依赖自己工艺能力，突破生产瓶颈的任务。 \n\n结合中国当时缺镍少铬现实，航空材料研究所荣科副所长提出了航空发动机叶片和轮盘“以铸代锻”的具有颠覆性和前瞻性的战略方针，为此奠定了中国航空工业自己独有的生产工艺体系。真的是功在社稷，利在千秋。 \n\n荣科先生利用我国已经仿制成功并定已定型的铸造铁基高温合金（K11、K14）及铸造镍基高温合金（K1、K3），采用精密铸造工艺，制成形状复杂的导向叶片和涡轮叶片，用于涡喷发动机。 \n\n而且荣科先生组织、指导和计划各航空发动机厂建立了精铸车间，发展完善了中国特有航空发动机精铸工艺，为我国铸造合金的应用创造了条件。 \n\n其实早在1958年大跃进期间，中国的东风113航空发动机方案提出以后，下达生产研制任务到各单位。根据任务，钢研院研制成功511合金，中科院金属所研制成功539合金，都比当时苏联最高牌号ЭИ929有更高的高温性能。但这些涡轮叶片材料变形十分困难，当时师昌绪先生提出利用苏家屯有色金属加工厂1200吨挤压机挤成棒材，并提出包套挤压工艺，虽然得出了棒材，但是毕竟设备吨位太小，难以满足要求。于是中科院金属所便利用1957年从瑞士进口的5kg真空感应炉开展精密铸造高温合金的研究，最后确定了一个不含钴而性能与当时国际水平相当的916合金，尽管从高温强度或塑性来看都不亚于正在开发的变形合金，但是当时工厂不具备生产条件，只好作罢，这应该算是我国第一个铸造涡轮叶片用镍基高温合金，合金虽然没有得到应用，但推动了我国真空冶炼和真空精铸工艺和真空感应炉的发展。 \n\n1960年，荣科调入航空研究院总工程师室，主持航空材料和航空工艺开发工作，重点组织精密铸造工艺研究。1964年5月，航空研究院在沈阳召开新机座谈会。根据师昌绪先生回忆，当时高空高速歼8飞机总设计师黄志千提出用2台改进型涡喷7发动机作为歼8双发方案，与会者都认为在一年内完成发动机改型没有把握，会议陷入僵局。 \n\n荣科在会议上提出把实心涡轮叶片改为空心叶片，用强制冷却提高涡轮前温度100℃的方案。代表们说：“老荣高见，那要看你能不能在一年内拿出气冷涡轮叶片了。” \n\n荣科经过缜密思考评估，认为研究空心涡轮叶片虽然难度大，有相当的风险，但我们已有一支水平不低的队伍，也有一定的科学技术储备，如中科院金属所研制的铸造高温合金M－17（K417）和沈阳发动机厂的熔模制造工艺。如果采取实现设计－材料－制造一体化的方案，就有可能在一年内完成空心叶片任务。 \n\n他便向与会代表立下军令状：“如果不能在一年内拿下空心涡轮叶片，我愿把自己的脑袋挂在设计所的大门口示众”（见荣科：“空心叶片攻关记，中国航空40年154－156”）。 \n\n经过相关领导批准，荣科先生立即制定方案，并组成数十人的专题组（称AB－1组）。航空研究院科技部黄锡川部长在中科院金属所召开的上千人大会上做了动员报告，由金属所、606所及沈阳发动机厂组成了任务组，在金属所简陋的铸造实验室开展了探索性的研究工作。 \n\n在探索过程中，首先遇到的难题是型芯材料的选择，因在近100毫米长的叶身中，要铸出粗细不等的9个小孔，最细的直径只有0.8毫米，而在侧面进气口处还要有一个弯角，这就给型芯定位产生了难度。采用什么材料做型芯？查遍资料不得其解，还是偶然从美国一本杂志上刊登的一幅出售不同规格的细石英管的广告中得启示，试了多种材料之后，最终决定采用石英管。此外，还有很多技术问题，诸如脱芯，超声测壁厚等。齐心协力，终于如期完成了任务。 \n\n与此同时，航空工艺研究所、航空材料研究所、航空发动机设计所、沈阳发动机厂与抚顺钢厂和钢铁研究院研制出锻造了大孔空心气冷涡轮叶片，两种叶片都通过了台架试车。但是考虑到铸造9孔较之锻造3大孔叶片有更多优点，即前者冷却效果好，铸造合金强度裕度大，工艺简单，周期短、成本低，因而航空研究院决定采用铸造空心涡轮叶片（称为201叶片）。在沈阳发动机厂进行了小批量生产，解决了在生产过程中的许多技术关键。 \n\n1975年4月三机部决定将201叶片的大生产定点于贵州新艺机械厂（也即现在著名的黎阳发动机公司），要求中科院金属所与沈阳发动机厂组成攻关小组，师昌绪先生领衔。经过半年多的时间，稳定了生产，制订了验收标准。迄今已生产了数百万片，40年来装备了我国几乎所有先进航空发动机。 \n\n中国是世界上第二个采用铸造空心涡轮叶片的国家，比美国晚了5年。至于它的水平可以从荣科文章的一段话看出：“当英国罗•罗公司总设计师胡克教授在沈阳发动机厂看到我国自行创新研制的铸造空心涡轮叶片时，不无感慨地说，单凭见到这一实际成就，就没白来中国一趟。由此，他对设计制造空心涡轮叶片的核心发动机有了更强的信心”。师昌绪先生1963年参观罗•罗公司时，公司领导一再强调铸造高温合金涡轮叶片不可靠，从而他们起步较晚，看了我们的成就，对英国也是一个推动。 \n\n1962年为使我国直升机能飞入西藏上空，我国仿制了当时美国最成熟的铸造合金IN100（M17,K417），航空材料研究所及钢铁研究院于1965年前后开发K5、K6及仿IN713C的K18。又用铸造方法制造了涡轴发动机的增压器。 \n\n1965年，美国开发了定向凝固技术，1967年我国航材所在自制定向凝固炉上开发了高温合金定向凝固技术，70--80年代研制出几种定向凝固高温合金（DZ3、DZ4、DZ22），其中不含铪的DZ4已批量生产，并在10多种发动机上得到应用。 \n\n目前我国铸造高温合金有42种。我国铸造高温合金的特点是某些定向凝固的高温合金不含铪（DZ4、DZ17G、DZ38G、DZ125L）；单晶合金较国外同性能合金的铼含量低，因而价格低廉。（工业铼每公斤100万人民币以上，主要用于生产航空发动机叶片、制造类似陀螺仪的高精设备、合成高辛烷值汽油）。 \n\n1988年我国开始采用泡沫陶瓷开发出铸造高温合金过滤净化技术，对返回料的应用创造了条件。 \n\n1992年，我国又发展了单晶高温合金叶片制造工艺，并开发出单晶高温合金（DD3、DD4、DD6、DD402等），同时还发展了单晶涡轮转子叶片铸造工艺。DD3成分简单，强度高，但有热裂倾向，未能推广，在加入适量的钽以后，不但解决了热裂倾向，而且高温性能有所提高，现已推广到多个机种，成为我国真正用于航空的第一代单晶合金。 \n\n至此，我国航空铸造工艺需要的人才储备、知识储备、技术储备与装备储备已经完成。 \n\n五、结语 \n\n我国航空材料起步于仿制，然后从仿制开始创新，通过坚持不懈的逐渐改进工艺路线，提高材料质量，我国航空材料从无到有，品种规格逐步齐全，质量达到产品要求，而且实现毛主席设想的完全独立自主，完全依靠国内原材料建立完整航空工业体系的目标。 \n\n同时，我国自己的航空材料的研究深度和广度，积累的理论基础和实验数据，生产的规模、品种和积累的工艺经验和设备生产技术，是我国成为世界上仅次于美国和前苏联最完善拥有自己航空工业材料研发制造的国家。 \n\n近年，我国在先进树脂基复合材料、座舱玻璃材料、橡胶密封材料、先进涂层和镀层、功能材料等都取得突破， 我国的先进树脂基复合材料，已经能够生产次承力构件，主承力构件，垂尾、前机身、腹鳍、升降副翼、鸭翼、整体油箱机翼、壁板等制件。目前，树脂基复合材料的用量最大可达全机结构重量的15％~18％。 \n\n最近几年，得益于我们在飞机隐身材料、超高温材料，金属基和陶瓷基复合材料生产工艺和生产设备上的突破（有的突破具有世界领先水平，例如师昌绪先生研发的的铌系合金耐温可以达到2300度以上），目前我国的新一代飞机的机体用材开始大量采用了高比强度、高比模量的轻质、高强、高模材料，显著提高了飞机的结构效率，降低了飞机结构重量系数，具体表现为钛合金代替钢，树脂基复合材料代替铝合金，当然高强、高韧、高耐蚀铝合金和铝锂合金在现有飞机结构件中仍占十分重要位置，所以这方面我国进展一直不错，成果持续不断。 \n\n六、顺便说一下超高强度钢 \n\n超高强度钢是指在室温条件下抗拉强度大于1400 MPa、屈服强度大于1200 MPa，同时具有良好的塑韧性、抗疲劳性、断裂韧性和抗应力腐蚀性。 \n\n评价钢的好坏可不能只看一个指标，高屈服强度，高韧性，高弹性模量，强焊接性，易于成型性，抗低周疲劳性。只有同时满足了这6个条件才是优秀的钢，尤其是军舰用钢还要强调抗腐蚀性。 \n\n钢不是强度越高越好，例如现在做到屈服强度达到2500兆帕的钢不是难事，我国也能做到，但是这种钢焊接性极差，几乎没法用于军舰生产。 \n\n超高强度钢目前主要用于于火箭发动机壳体、飞机起落架、飞机大梁，核潜艇等等。目前美国的爱国者，红眼睛，民兵，潘兴，以及以前的北极星、大力神等，甚至美国航天飞机的助推器壳体都是超高强度钢制造。F-111，F-22等等战斗机的起落架和机翼轴等也是超高强度钢。我国的DF-21导弹一级发动机壳体，HQ-7地空导弹发动机壳体，反坦克导弹的发动机壳体和高压气瓶，J-8II大梁，J-10起落架等等也是超高强度钢（强度>1715 MPa，KIC＞72 MPa•m1/2），目前的东风和巨浪系列导弹一级发动机壳体也是。 \n\n我国近年在超高强度钢方面，突破了四大关键技术： \n\n1、超纯铁工业化大生产冶金技术。 \n\n2、VIM+VAR低偏析、高均质化的熔炼技术。 \n\n3、钢锭均质化技术、大锻比锻造技术。 \n\n4、超细化控制锻造技术和热处理控制技术。 \n\n使我国超高强度钢批量生产能力获得大突破。下面简单罗列几个解密的： \n\n我国目前生产的406钢 屈服强度是1862M（如果930度淬火，200度回火，屈服强度可以达到2060Mpa，这是刀具和工具用钢），G99屈服强度是 1520M，G50 屈服强度是1660M。 \n\nG99是由钢铁研究总院、长城特殊钢公司、航天部703所、东北大学共同承担研制的，该钢的屈服强度1520MPa，用于神舟系列飞船的黑匣子壳体，东风中短程导弹的钻地弹（以近 7 马赫-- 约 2200 米/秒的速度落地,轻松贯穿十米以上钢筋混凝土堡垒），G99具有良好的强韧性配合和较高的抗剪切失稳能力。 \n\nG50是无钴高强高韧钢，是新一代空空，地空和舰空导弹的弹体材料，有足够高的强度、断裂韧性和抗冲击载荷的能力。 \n\n目前99主战坦克上的装甲钢屈服强度是1455Mpa，而且可焊性很好。 \n\n东北特刚为J8II 研制的主承力梁特种钢的强度>1800 MPA ,而且韧性和焊接性都很好。 \n\n目前世界上能批量生产1700MPA极的钢丝绳只有日本制钢所、宝钢、贵钢（贵阳钢厂）， 而能批产1900MPA级的只有贵钢一家 （航母用拦阻索就要用这玩意）。 \n\n我国四代机和舰载机的起落架是抚顺特殊钢公司生产的某型号超高强度钢。 \n\n宝钢特殊钢分公司、抚钢、安大厂和太钢等单位联合攻关，成功试制出直径为1200mm的T250钢固体发动机壳体，已用于某航天型号。T250钢屈服强度>1760MPa。 \n\n我国现在具备生产下潜超过600米的核潜艇的钢材条件（具路边社消息，我国新一代潜艇用钢达到1200mpa，而且满足可焊接性，高韧性，高弹性模量，易于成型性，抗低周疲劳性，抗腐蚀性等等条件），并且我们已经掌握目前美军也在使用的某些焊接技术。 \n\n美国大青花鱼号核潜艇是用HY80高强度钢的第一艘潜艇，HY80高屈服强度为560--665MPa，可保证核潜艇下潜深度达到300m，洛杉矶核潜艇就采用HY80钢建造。 \n\n美国的著名的核潜艇海狼用的hy100钢 屈服强度也只有800兆帕左右，而且还得有匹配的焊丝焊剂才能实现焊接。（海狼在试制阶段曾经用过900兆帕的hy130钢，但是这种钢可焊接性不好，出现了大范围的裂纹， 90年代中期才解决）。海狼用此种钢后，其下潜深度比采用屈服强度为560--665MPa的HY80钢建造的洛杉矶级核潜艇增加了25%以上，洛杉矶级的下潜深度为450m，海狼级的下潜深度达到610m。美国目前航母甲板用的就是hy100的钢 。 \n\n再说说俄罗斯，俄罗斯因为钢材技术问题，核潜艇采用钛合金18-T，其屈服强度是720兆帕，但是k-278曾经靠它下潜到了1000米，俄罗斯其余的使用其他型号钛合金的下潜深度都在600米左右。"
		},
		{
			"post_id": 8,
			"title": "中国智能装备制造业规划介绍 China AI Production Industry Introduction",
			"date_published": 1503756333.199,
			"body": "一、智能制造的定义 \n\n智能制造系统（Intelligent Manufacturing System---IMS）是由智能机器和人类专家共同组成的人机系统，高度柔性和集成制造流程，对制造过程进行分析、判断、推理、构思和决策，减少人为干预制造过程导致的低效率和不稳定，同时收集、存储、完善、共享、继承和挖掘人类专家的制造知识。 \n\n智能制造系统一般包括四个子系统： \n\n★设计子系统：能实现产品可制造性、可装配性、可维护和保障性的自动化设计； \n\n★计划子系统：能实现自动优化配置资源和自动调度平衡产能； \n\n★生产子系统：能将生产，检测，库存，物流等等制造核心流程实现自治或半自治管理； \n\n★监控子系统：能实现监控生产过程自动化，生产状态实时数据监测自动化，制造系统运营故障诊断自动化和系统自动修复维护。 \n\n智能制造具有以下特征： \n\n自律能力：智能制造系统能够搜集与理解环境信息和系统内部信息，并进行分析判断，优化和规划自身行为的能力。 \n\n人机一体化：单纯基于自动化的制造系统（例如CIMS)只能进行机械式的推理、预测、判断，智能制造系统是人机一体化，是在智能机器的配合下，更好地发挥出人的潜能，具有逻辑思维（专家系统）+图像思维（神经网络），能够充分发挥人类专家的智能优势，独立承担起分析、判断、决策等任务。 \n\n虚拟现实：智能制造系统能够集成信号处理、几何图像数字化技术、动画技术、智能推理、预测、仿真和多媒体技术，借助生产系统中的各种传感器阵列，虚拟展示现实生产流程中的各种过程、物件等，并数字化，便于优化和控制。 \n\n自组织与超柔性：智能制造系统中的各组成单元能够依据工作任务的需要，自行组成一种最佳结构，其柔性不仅表现在运行方式上，而且表现在结构形式上，具有生物自组织特征。 \n\n学习能力与自我维护能力：智能制造系统能够在实践中不断地充实完善知识库，具有自学习功能和知识挖掘功能，实现在制造系统运行过程中自行故障诊断，并具备对故障自行排除、自行维护的能力，使智能制造系统能够自我优化，并适应各种复杂的环境。 \n\n智能制造源起源于1992年美国的新技术政策（Critical Techniloty），这个政策其实是一个类似星球大战计划的东西，包括信息技术和新的制造工艺，美国政府希望借助此举改造传统工业并启动新产业，同时干扰欧洲和日本自主选择工业产业升级的道路（当时苏联瓦解，已经不是主要威胁，中国还在8平方深渊和国企危机中没走出来，不是美国潜在攻击对象）。 \n\n日本1994年启动了先进制造项目，包括了公司集成、制造知识体系、分布智能系统控制、快速产品实现的分布智能系统技术等。 \n\n欧盟1994年启动了先进制造技术项目。 \n\n中国推迟到2010年才开始考虑智能制造升级这个问题，使我们摆脱了紧追美国导致的道路选择成本和被误导的损失。人算不如天算。 \n\n其实现在我们在体系智能制造系统结构上并未被甩开多远，这10来年，美国净忙着跟欧洲和日本斗心眼了，在这上面实际投资很少，进展不快。 \n\n中国工信部《2015年智能制造试点示范专项行动实施方案》中对智能制造给出了中国的定义： \n\n通过工业网络互联打通端到端数据流，制造系统实现信息深度自感知、智慧优化自决策、精准控制自执行，使工厂的关键制造环节从产能、质量、成本三个方面运行效率都得到提升。\n\n智能制造代表未来先进制造业的发展方向，美国、欧盟、日本均将其列入国家发展计划，我国也已将其作为未来十年制造业转型升级发展的方向。 \n\n所以智能制造=企业的信息化+自动化+智能化。 \n\n信息化=研发+制造+销售+服务的数据流互联互通，信息共享。 \n\n自动化=生产过程装备智能化+数字化控制。 \n\n智能化=自主决策+自主优化配置资源+自主控制运营过程+自主维护和维修管理系统。 \n\n中国把智能制造分为自动化工厂和智能制造装备两个大项。 \n\n智能制造装备是搭建智能制造的原材料，所以目前是国家规划的核心和重点。 \n\n目前我们在智能制造领域，重点是突破智能装备制造，同时开始试点一些智能制造车间、工段，生产线，完整的智能制造工厂项目还在准备论证中。 \n\n二、智能制造（IMS)与CIMS区别 \n\nCIMS即计算机集成制造（Computer Integrated Manufacturing Systems），基本观点是： \n\n企业的生产制造过程就是是信息的采集、传递和加工处理的过程。提高企业运营的效率和质量就是加速信息的采集、传递和加工处理过程。 \n\nCIMS 通过计算机软硬件，把IE技术（工业工程）、先进制造技术、信息技术、自动化技术、系统工程技术集成生产全部过程中的信息和物流，并优化运行的复杂的大系统。 \n\nCIMS集成包括系统运行环境的集成；信息的集成；应用功能的集成；技术的集成；人和组织的集成。 \n\nCIMS是智能制造的先驱，已经在很多国家，包括中国，实现了工厂自动化，从离散型机械制造业（例如成都飞机，北京机床等等）扩展到化工（例如中石化乙烯）、冶金等连续或半连续制造业。 \n\nCIMS包括管理信息系统(MIS）、制造资源计划系统（ERP)、计算机辅助设计系统（CAD）、计算机辅助工艺设计系统（CAPP）、计算机辅助制造系统（CAM）、柔性制造系统（FMS）,以及数控机床（NC，CNC）、机器人等。 \n\n目前MIS已经基本嵌入企业ERP或SCM等资源优化和调度系统中，成为一个子系统。FMS嵌入了MES等制造制造执行系统，实现了加工设备和物料输送设备的集成等等。 \n\nCIMS面向整个企业，覆盖企业的全部经营活动，包括生产管理、销售管理、财务管理、人力资源管理、工程设计和生产制造各个环节，从产品报价、接受订单开始，经计划安排、设计、制造直到产品出厂及售后服务等的全过程。应用于企业全生命周期各个阶段，通过信息集成，过程优化及资源优化，实现物流、信息流、价值流的集成和优化运行，达到人（组织及管理）、经营和技术三要素的集成。 \n\n目前中国实现的CIMS包括了一个制造企业的设计、制造、经营管理三种主要功能，包括四个子系统：管理信息系统；产品设计与制造工程设计自动化系统；制造自动化或柔性制造系统；质量保证系统。实现了企业内部的信息集成和过程集成（并行工程），目前正在实现企业间集成的阶段，也即敏捷制造；实现了从产品的数字化设计开始，到产品全生命周期中各类活动、设备及实体的数字化；实现了基于工业以太网的分布网络制造；实现了柔性化制造，目前正在发展包括动态联盟、敏捷设计和生产、柔性可重组机器技术等。 \n\nCIMS建立在工业互联网和海量数据库硬件基础上。 \n\nCIMS和智能制造不同的地方是只有自动化，而无智能化，没有考虑人机界面和智能优化，所以不具备智能制造具有的自律、分布、智能、仿生、敏捷、分形等特点。 \n\n所以智能制造其实是CIMS的升级版。 \n\n三、中国智能制造装备业规划简介 \n\n1、中国对智能制造装备业的定义 \n\n根据《国务院关于加快培育和发展战略性新兴产业的决定》、《战略性新兴产业发展规划》及《“十二五”工业转型升级规划》，工信部依据《高端装备制造业发展规划纲要》，制定的《智能制造装备产业“十二五”发展规划》给智能制造装备的定义是：具有感知、决策、执行功能的各类制造装备的统称。是先进制造技术、信息技术和智能技术的集成和深度融合，包括智能测控装置与部件、重大智能制造成套装备等智能制造装备产业核心环节。 \n\n智能制造装备是传统产业升级改造、实现生产过程自动化、智能化、精密化、绿色化的基本工具，是实现生产过程和产品使用过程节能减排的重要手段。智能制造装备的水平已成为当今衡量一个国家工业化水平的重要标志。 \n\n根据中国政府规划，智能制造装备业包括：高档数控机床与基础制造装备；智能控制系统；智能专用装备；自动化成套生产线；精密和智能仪器仪表与试验设备；关键基础零部件、元器件及通用部件等。 \n\n其中： \n\n（1）、高档数控机床与基础制造装备重点是： \n\n1）、高速、精密、复合数控金切机床； \n\n2）、重型数控金切机床； \n\n3）、数控特种加工机床； \n\n4）、大型数控成形冲压设备； \n\n5）、重型锻压设备； \n\n6）、清洁高效铸造设备； \n\n7）、新型焊接设备； \n\n8）、大型清洁热处理与表面处理设备； \n\n9）、非金属成型设备； \n\n10）、新材料制备装备； \n\n11）、高档数控系统； \n\n12）、数控机床功能部件（包括刀库、机械手、数控刀架、转台、主轴单元、滚珠丝杠副和滚动导轨副、高速防护和数控刀具等）； \n\n13）、数字化工具系统及量仪。 \n\n（2）、智能控制系统重点是： \n\n1）、集散控制系统（DCS）； \n\n2）、现场总线控制系统（FCS）； \n\n3）、可编程控制系统（PLC）； \n\n4）、先进高效发动机及其智能控制系统； \n\n5）、新能源、新材料、节能环保等新兴产业所需要的专用控制系统。 \n\n（3）、智能专用装备重点是： \n\n1）、机器人产业； \n\n2）、矿山用智能自卸电铲、智能化全断面掘进机、快速集成柔性施工装备等智能化大型施工机械； \n\n3）、数字化、智能化、高速多功能印刷机械； \n\n4）、大型先进高效智能化农业机械。 \n\n（4）、自动化成套生产线重点是： \n\n1）、大型煤化工自动化关键装备； \n\n2）、大型液化天然气生产储能自动化关键装备和大型天然气长距离输送系统； \n\n3）、高效棉纺、短流程染整自动化生产线； \n\n4）、大型煤炭井下自动化综合采掘成套设备及大型露天矿自动化成套设备。 \n\n（5）、精密和智能仪器仪表与试验设备重点是： \n\n1）、高精度、高稳定性、智能化压力、流量、物位、成份仪表与高可靠执行器； \n\n2）、智能电网先进量测仪器仪表（AMI）； \n\n3）、材料分析精密测试仪器与力学性能测试设备； \n\n4）、新型无损检测及环境、安全检测仪器； \n\n5）、国防特种测试仪器等各类试验设备。 \n\n（6）、关键基础零部件、元器件及通用部件重点是： \n\n1）、高可靠性力敏、磁敏等传感器； \n\n2）、新型复合、光纤、MEMS、生物传感器； \n\n3）、仪表专用芯片； \n\n4）、色谱、光谱、质谱检测器件； \n\n5）、高参数、高精密和高可靠性轴承； \n\n6）、高参数、高精密和高可靠性高压液压/气动/密封元件； \n\n7）、高参数、高精密和高可靠性齿轮传动装置； \n\n8）、大型、精密、复杂、长寿命模具； \n\n9）、电力电子器件及变频调速装置。 \n\n简单说，智能制造装备业以传感器、智能控制系统、数控机床、工业机器人、自动化成套生产线和精密仪器仪表为代表。 \n\n显然，这个规划的核心是机器人和数控机床产业。我们下面重点介绍这两个产业。 \n\n当然不是说传感器和精密仪器仪表非不重要，因为中国这两个行业都是巨大的，例如2014年中国仪器仪表行业企业总数为1500多家，其中有超大型企业80家，大型企业150家，中型企业300家，中小型企业600家，小型企业460多家。职工总数为100.5万人，其中工程技术人员20.59万人，管理人员15.33万人。固定资产原值1146.96亿元，净值907.49亿元，2014年工业总产值按现行价计算为12000亿元，利润总金额1112.92亿元，工业全员劳动生产率94.72万元／人年（按工业增加值计算），能够生产13大类143个小类800个系列1.4万多个种类。其中工业自动化仪表约占33.5％，精密测试仪器约占33.11％，电影、照相机、复印机、缩微等办公设备类约占34.39％。中国的仪器仪表需求量很大，是发展最快的国家之一。世界上仪器仪表的增长率是3%--4%，中国已连续十年实现20%以上的年增长率，有的产品已经占了全世界的十分之一。2013年中国仪器仪表产品出口额约366.4亿美元，进口额为703亿美元。 \n\n我国已经是世界上仪器仪表生产大国，技术上总体已达到20世纪90年代中后期的国际水平，少数产品接近或达到当前国际水平，许多产品具有自主知识产权。工业自动化仪表及控制系统品种系列齐全，测温仪表、测压仪表、显示仪表、传统流量仪表和简易调节仪表等产品，国内企业能够掌握核心技术，可以自行提升和开发新产品，产品可满足国内需要，并有出口。而在色谱仪器、光谱仪器、电化学仪器、研究型光学显微镜、扫描电子显微镜、电子天平、离心机、电子万能试验机、超声波探伤机、X射线探伤机、电子经纬仪、电测仪器等产品的技术水平接近或达到当前国际同类产品的先进水平。 \n\n再例如中国目前有1688家企事业从事传感器的研制、生产和应用，目前能够生产达到10大类、42小类、6000多个品种的传感器产品，2014年敏感元件和传感器年总产量达到100亿只，但是主要在低端市场，目前高端需求严重依赖进口，高端传感器进口占比80%，高端传感器芯片进口占比达90%。 \n\n中国传感器主要应用于汽车工业中，包括汽车轮胎中的传感器、安全气囊中的传感器、底盘系统中的传感器、发动机运行管理系统中的传感器、废气与空气质量控制系统中的传感器、ABS中的传感器、车辆行驶安全系统中的传感器、汽车防盗系统中的传感器、发动机燃烧控制系统中的传感器、汽车定位系统中的传感器、汽车其他系统中的传感器等等。在智能制造行业的工业控制传感器，仍然主要依赖进口。 \n\n2014年中国传感器市场规模超过1200亿元。 \n\n按照国家规划，预计到2020年，气体传感器产业规模将达到600亿元以上，国产化率达到70%以上。其中包括基于MEMS技术的传感器、环境监测设备用气体传感器、流量传感器、湿度传感器等。 \n\n2、国内智能制造装备业行业现状 \n\n智能制造装备业在我国最近十年获得迅速发展，目前我国在机器人制造技术、传感器制造技术、工业通信网络设备制造和系统集成技术、数字控制系统与数字化制造技术、数控机床制造技术、机密仪器仪表制造技术特、殊材料制造技术等方面攻克了一批长期影响我国产业安全的核心瓶颈，建设了一批相关的国家重点实验室、国家工程技术研究中心、国家级企业技术中心等研发基地，培养了一大批长期从事相关技术研究开发工作的高技术人才，并形成了一批重点产品，如高速精密加工中心、重型数控镗铣床、3.6万吨黑色金属垂直挤压机等相继研制成功并投入应用，其中高端立卧车铣复合加工中心采用了国产总线式高档数控系统，打破了国外在这一领域长期的垄断；百万千瓦超超临界火电机组、年产45万吨合成氨、轨道交通等多项重大工程项目也采用了国产数字控制系统(DCS)；大型轴流式压缩机组、离心式压缩机组、施工机械等陆续实现了远程监控和维护诊断，实现了智能化和网络化。 \n\n目前我国以新型传感器、智能控制系统、工业机器人、自动化成套生产线为代表的智能制造装备产业体系已经初步形成，一批具有自主知识产权的智能制造装备实现突破，2014年工业自动化控制系统、仪器仪表、数控机床、工业机器人、传感器、复合材料和精密陶瓷材料等部分智能制造装备产业领域销售收入超过8000亿元，预计2015年将超过10000亿元。 \n\n根据我国颁布的《智能制造装备产业“十二五”发展规划》、《智能制造科技发展“十二五”专项规划》和《智能制造装备发展专项》，规划以智能测控装置与部件和成套智能制造装备产业化为核心，规划确定的突破重点领域包括：自动控制系统、工业机器人、传感器、伺服和执行部件。规划设想我国到2020年，智能制造装备产业领域销售收入将超过30000亿元，实现装备的智能化及制造过程的自动化。 \n\n目前，国内的智能制造装备主要分布在东北和长三角地区。其中数控机床主要分布在北京、辽宁、江苏、山东、浙江、上海、云南和陕西等地区，近年来，辽宁与陕西也发展迅速。工业机器人主要分布于东北、北京、上海、广东、江苏。关键基础零部件及通用部件、智能专用装备产业在河南、湖北、广东等地区也有分布。 \n\n目前，我国智能制造装备产业已形成一批具有国际竞争力的龙头企业。如在机床工业领域，沈阳机床、大连机床两个集团的年销售收入均超过百亿，进入世界机床产业前10强；在智能控制系统领域，有上海新华控制技术集团、浙大中控、北京和利时和山东鲁能控制等DCS生产厂商；在仪器仪表领域，有重庆川仪、京仪集团、天瑞仪器、聚光科技、威尔泰等一批具有国际竞争力的龙头企业；在工业机器人领域，新松机器人、哈尔滨博实自动化设备、海尔哈工大机器人、安川首钢机器人、上海ABB工程、上海发那科机器人、库卡机器人（上海）等；在工程机械领域，三一重工、中联重科、徐工集团、柳工集团、中国龙工等10家企业位居全球工程机械前50强排名榜单，此外，还有瓦轴集团、沈鼓集团等企业。 \n\n目前我国智能制造行业发展的主要瓶颈是： \n\n（1）、智能制造技术体系不完善，除个别领域外，大多数关键节点上原始创新匮乏，例如在控制系统、系统软件等关键技术环节薄弱，先进技术重点前沿领域发展滞后，在先进材料、堆积制造等方面差距还在不断扩大。 \n\n（2）、智能制造中长期发展战略技术路线图不清晰，可执行性差。国家层面对智能制造行业缺乏资源优化配置和政策协调。 \n\n（3）、高端制造装备对外依存度高。智能制造技术是以信息技术、自动化技术与先进制造技术全面结合为基础的，我国目前在这些技术的集成平台上，与世界一流水平差距依然较大，几乎所有高端装备的核心控制技术（包括软件和硬件）严重依赖进口。 \n\n例如目前关键智能制造技术及核心基础部件目前主要依赖进口，在高端传感器、数字控制系统、减速器、伺服系统等核心技术上受制于人。目前我国90%的工业机器人的核心部件（例如减速器和数控系统）、80%的集成电路芯片制造装备的控制系统、40%的大型石化装备数控系统、70%的汽车制造关键设备数控系统、核电等重大工程的自动化成套控制系统及先进集约化农业装备数控系统严重依赖进口，船舶电子产品本土化率还不到10%等等，目前在国内市场上，纯国产的高档和特种传感器、智能仪器仪表、自动控制系统、高档数控系统、机器人等等产品的市场份额不到5%。 \n\n再例如目前所需要的工业软件90%以上依赖进口，我国出口的数控机床，其核心部件的数控系统也依赖进口。 \n\n主要原因是缺乏制造先进的传感器、伺服系统、精密测量系统等基础部件的能力，并无法完全掌握精密测量技术、智能控制技术、智能化嵌入式软件等先进技术。 \n\n（4）、产业规模小，缺乏具有国际竞争力的骨干企业。而且大多集中在单纯制造业，缺乏在工程承包、维修改造、备品备件供应、设备租赁、再制造等方面的增值服务能力。 \n\n（下面省略入围企业名单，免得影响股市，导致网站被封） \n\n四、智能制造软件方面简介 \n\n2014年全球工业软件市场规模为3175亿美元，同比增长5.5%。市场规模占比较大的是设计、仿真、ERP、CRM等，生产调度和过程控制软件市场规模占比较小，但增速较快。 \n\n2014年，我国工业软件市场规模突破1000亿元，同比增长16.9%。轨道交通、航空航天、能源电力、装备制造等重点领域加快发展智能制造，生产调度和过程控制软件市场快速升温。 \n\n中国市场五大发展趋势： \n\n1、混合云模式成为企业采用云计算的主要方式 \n\n企业出于业务敏捷性、成本和安全性的考虑，将核心数据和应用以私有云形式构建，把外围数据和应用通过公有云以服务方式购买。 \n\n2、云/移动应用创新门槛降低　 \n\n3、物联网开始起步 \n\nGE已经开始实现通过在云端集合、处理、分析来自分布式传感器网络的各种数据，可优化设备的运行和维护，提升企业资产管理的绩效，开创了新的工业云服务领域。 \n\n4、云协同和云安全成为企业应用标配 \n\n苹果电脑和移动设备之间已经可以实现文档的自动同步，企业应用在多个云平台之间的协同已经可以实现多个云上管理、部署、优化IT资源的解决方案。 \n\n5、人工智能在多个行业实际应用 \n\nIBM Watson、Google Brain和百度大脑作为全球三大人工智能项目已经在不同行业落地，应用范围包括银行系统、医疗系统、生命科学领域、媒体与娱乐行业、能源行业、零售行业等。智能家居机器人成为人工智能技术率先规模化和产业化的两大方向。 \n\n根据国家智能制造战略，我国未来十年将是把工业互联网与工业融合当成国家产业创新的主要方向。 \n\n工业互联网将与研发设计、生产、供应链、销售、服务等环节结合，形成企业运营的新模式、新业态。 \n\n未来十年，中国的智能工厂将会成熟，设备智能化，设备间实现间通信协作，自动优化配置资源和自动调度，多生产线共享生产资源，实现生产能力、供应链及市场需求的动态匹配等等功能。 \n\n工业大数据和工业云将是应用工业软件发展的最大热点。未来智能工厂必然要自建工业大数据分析云平台。 \n\n五、2015年国家智能制造资助项目名称（把承担企业名称去掉了） \n\n1、智能制造测控装备语义化描述和数据字典标准研究与验证平台建设 \n\n2、数字化车间集成与互联互通标准研究和验证平台建设 \n\n3、工业控制网络标准研究和验证平台建设 \n\n4、功能安全和工业信息安全标准研究和验证平台建设 \n\n5、数字化车间术语及通用技术要求标准研究和试验验证 \n\n6、智能化产品术语及通用技术要求标准研究和试验验证 \n\n7、智能制造系统能效评估标准研究和验证平台建设 \n\n8、工业大数据服务标准化与试验验证系统 \n\n9、工业物联网技术要求标准化与试验验证系统 \n\n10、工业互联网架构标准化与试验验证系统 \n\n11、工业云服务模型标准化与试验验证系统 \n\n12、智能制造评价指标体系及成熟度模型标准化与试验验证系统 \n\n13、智能制造参考模型标准与试验验证系统 \n\n14、面向智能制造的工业信息安全关键标准研制和验证平台建设 \n\n15、智能制造标准体系研究 \n\n16、人机交互和协同安全标准化与试验验证系统 \n\n17、智能工厂（车间）通用技术标准与试验验证 \n\n18、电力装备智能制造关键应用标准研究及试验验证 \n\n19、智能制造工业云、大数据标准试验验证 \n\n20、面向传感器制造领域数字化车间关键应用标准研究 \n\n21、新能源汽车动力电池系统智能制造数字化车间综合标准化与试验验证系统 \n\n22、新一代信息技术产品智能工厂参考模型研究与验证 \n\n23、智能机床生产线标准体系及试验验证 \n\n24、基于云制造的智能工厂服务模型与验证系统 \n\n25、用户端电器元件智能制造设备标准与试验验证系统研究 \n\n26、智能移动终端生产关键应用标准试验验证 \n\n27、齿轮智能制造装备标准化试验验证系统研究及建设 \n\n28、智能柔性制造系统（FMS）应用标准试验验证体系研究 \n\n29、彩电行业智能制造新模式关键应用标准试验验证 \n\n30、铸造行业智能制造工厂/数字化车间综合标准化研究项目 \n\n31、智能制造集成与互联互通综合标准化与试验验证系统 \n\n32、海洋工程装备智能制造综合标准化试验验证 \n\n33、新一代信息技术行业智能工厂参考模型标准研究 \n\n34、彩电智能制造标准制定及试验验证 \n\n35、轨道交通装备智能制造信息交换及互操作标准及试验验证系统 \n\n36、动力装备全生命周期智能设计制造及云服务系统标准验证 \n\n37、航空数字化车间关键应用标准研究及试验验证平台 \n\n38、大型船舶分段焊接智能车间参考模型研究 \n\n39、中低压输配电装备智能化工厂标准化试验验证 \n\n40、电力系统测控设备智能工厂标准化试验验证系统 \n\n41、智能制造系统层级模型及水平评价体系 \n\n42、海洋工程装备及高技术船舶智能制造综合标准化试验验证研究 \n\n43、轨道交通网络控制系统应用标准试验验证 \n\n44、轨道交通车辆转向架智能制造车间项目 \n\n45、轨道车辆核心部件智能制造工厂建设 \n\n46、新能源客车智能化工厂 \n\n47、基于物联网与能效管理的用户端电器设备数字化车间的研制与应用 \n\n48、智能电网中低压成套设备智能制造新模式 \n\n49、中低压输配电装备智能制造新模式 \n\n50、智能电网低压配电设备和用户端设备智能制造新模式应用 \n\n51、面向海洋油气装备的网络化协同制造 \n\n52、大中型农业装备用柴油机智能化工厂 \n\n53、光电传感器智能制造新模式应用 \n\n54、高速动车组齿轮传动系统智能装配车间 \n\n55、移动终端金属加工智能制造新模式 \n\n56、锂离子动电池数字化车间建设 \n\n57、汽车城节能与新能源汽车智能柔性焊接新模式应用 \n\n58、中压空气绝缘开关设备制造数字化车间 \n\n59、自主智能化高档数控功能部件智能制造新模式支持下采用全信息化的五轴高速高精度智能化高档数控机床、智能化机器人智能制造新模式 \n\n60、农业装备研发制造基地智能联合厂房 \n\n61、高档数控机床及其核心部件智能制造新模式应用 \n\n62、飞机座舱盖、风挡智能装备生产线建设 \n\n63、大中型发动机缸体数字化铸造车间 \n\n64、民机智能制造新模式研究应用 \n\n65、工业机器人高精度减速智能制造建设项目 \n\n66、客车节能与新能源客车模块化、柔性化智能制造新模式 \n\n67、现代化农业装备制造数字化车间 \n\n68、高技术船用新型柴油机燃油喷射系统智能制造新模式应用项目 \n\n69、电力装备（火电、核电）大型汽轮发电机智能工厂 \n\n70、电力装备智慧仪表智能制造新模式 \n\n71、自走式玉米收获机制造数字化车间 \n\n72、智能传感器制造数字化车间 \n\n73、飞机结构件智能制造新模式应用 \n\n74、面向高端绿色铸造的智能制造新模式 \n\n75、年产5万吨热传输复合材料铸造、热轧基础智能制造新模式 \n\n76、飞机大型复杂结构件数字化车间 \n\n77、商用航空发动机总装智能装备新模式 \n\n78、大型农业节水灌溉装备智能制造项目 \n\n79、数控轴承磨床智能制造新模式 \n\n80、新一代纯电动汽车IEV5智能制造新模式 \n\n81、农机农业用泵制造数字工厂建设项目 \n\n82、工业传感器全生命周期数据闭环智能制造新模式 \n\n83、长泰机器人智能工厂 \n\n84、高档数控机床及其关键零部件的数字化车间 \n\n85、高性能车用锂电池及电源系统智能生产线 \n\n86、轮轴智能制造数字化车间项目 \n\n87、铸铁缸体缸盖智能制造新模式 \n\n88、利用成组和智能技术打造数字化车间 \n\n89、无人化智能热处理工厂 \n\n90、移动终端主板智能制造新模式 \n\n91、汽车复杂锻件智能化制造新模式 \n\n92、传感器智能制造 \n\n93、MEMS传感器智能制造 \n\n94、自主品牌工业机器人及关键核心零部件智能制造工厂"
		}
	]
}