{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Вопрос по ZeroMe",
			"body": "Если загрузить профиль конкретного пользователя, то скачивается весь хаб и контент всех пользователей хаба? Получается я буду участвовать в раздаче контента в котором я не заинтересован? А если там что-то незаконное будет?",
			"added": 1488857573
		},
		{
			"topic_id": 2,
			"title": "Вот почему на моем ноуте win8.1 быстрее linux.",
			"body": "Понимаю тема холиварная, но серьезно:\n\nИспользую linux в качестве основной ОС c 2001 года. Все хорошо.\nНо вот чем дальше тем больше замечаю проблемы на современном ноутбучном железе.\nПоследний ноут Lenovo E555 на AMD FX-7500/Radeon R5 M240, последние версии ubuntu уже нормально не тянет. Проприетарный драйвер радеона они выкинули, в вики арча пишут что открытые драйвера лучше. Но блин перетаскивание окон тормозит, скролинг в браузере тоже, видео с ютубчика лагает. Пробовал Mint/ubuntu/etc MATE/XFCE/LXDE. После сна wi-fi отваливается регулярно(опции модуля крутил как советуют).\nДумал ну может железо не тянет, но с ним был win8.1. \nСравниваю, все заметно шустрее.\nВот почему так?",
			"added": 1489262660
		}
	],
	"topic_vote": {
		"1_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "привет",
				"added": 1488856670
			},
			{
				"comment_id": 11,
				"body": "> [undyingfirewall](#comment_1_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Всем привет. Слышал здесь кто-нибудь про Фидонет?Сеть на анонимная, но тоже децентрализованная и тоже за свободный обмен информацией. А ещё она очень старая и сейчас перерождается, то бишь модем уже не нужен--- Hotdoged/Android\n> \n> Origin: We will stand for Everfree (2:5023/24.2868)\n\nБыл фидошником. До сих пор ищу аналог. Сеть хорошая, но децентрализация слабая, в силу применявшихся технологий. Легла нода - остался без почты, лег хаб - еще грустнее.\nВ отсутствии анонимности плюс. Было доверие и управление сетью. Фидополиси - хороший пример децентрализации управления.",
				"added": 1508754091
			},
			{
				"comment_id": 12,
				"body": "> [balancer73](#comment_201_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw):  ФИДО была более жёсткой и отказ любого из многих узлов мог привести к отказу всей сети. \n\nЭто отказ каких узлов мог привести к отказу всей сети?",
				"added": 1508828561
			},
			{
				"comment_id": 13,
				"body": "> [sigma7](#comment_7_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): согласет теперь вижу что аналогия с федерацией не совсем уместна, т.к. в случае федерации крушение узла прописки не несет проблем связанности конечных потребителей. \n\nКак это не несет? Если узел диаспоры или мастодонта ляжет, на котором я зарегистрирован, я уже ничего не напишу и не прочитаю. Я только могу найти и зарегистрироваться на другом узле. Что в случае с фидо решалось так же - нахождением другой ноды. Так что это похоже на федерацию, только еще с иерархией.",
				"added": 1508925178
			},
			{
				"comment_id": 14,
				"body": "> [sigma7](#comment_10_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): я имел в виду идеалтную федерацию. гдесервера только занимаются регистрацией и управлением клиентов а клиенты почти равноправны на всех узлах федерации неважно откуда он зашёл (узлы федерации обмениваются учетными данными клиентов)\n\nПо моему это описание не федерации. Есть примеры?",
				"added": 1509033479
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 2,
				"body": "+",
				"added": 1488858023
			},
			{
				"comment_id": 10,
				"body": "> [useti](#comment_2_19M6S4PQBFoq7kg7Bv6t4U8aRs9qrVMyat): я понял что это мне напоминает - фидовекторный и гипертекстовый фидонет. провто вместо того чтобы качать эхи - качается все подряд\n\nКачается как раз только то что тебе интересно.\nКаждый форум здесь это как эха.",
				"added": 1508292009
			}
		],
		"1_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx": [
			{
				"comment_id": 3,
				"body": "А я бы не стал поощрять противозаконную деятельность, тем более если сам в этом не заинтересован.\nЛучше бы для каждого пользователя в ZeroMe создавался персональный зайт. Не вижу в этом каких-либо проблем.",
				"added": 1488881051
			},
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_85_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Так в чём разница между таким «лимитированным ZeroMe по подписке» и нынешним ZeroBlog? :)\n\nпоиск пользователей, социальный граф",
				"added": 1489043223
			},
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_86_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n> Ну, это да. Но на практике сейчас почти не работает :)\n\nНу тебя например найти можно и на кого ты подписан тоже видно.",
				"added": 1489130230
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 6,
				"body": "Есть мысль, что лимит надо делать не на все сообщения, а за какой-то промежуток. Т.е. например разрешать не больше 30КБ в неделю. Это убережет от набегов и место всегда будет.",
				"added": 1489261655
			},
			{
				"comment_id": 17,
				"body": "Надо форум на несколько админов сделать, благо ZN такое позволяет.",
				"added": 1525627238
			},
			{
				"comment_id": 18,
				"body": "> [anotherneko](#comment_70_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Думаю стоит. И лимит по умолчанию побольше поставить.\n\nЛимит не просто так ограничен. Он для борьбы со спамом. Предполагается что админ будет увеличивать  лимит обычным пользователям, можно сразу на много, а спамеры не так сильно будут гадить.",
				"added": 1525631027
			},
			{
				"comment_id": 19,
				"body": "> [anotherneko](#comment_71_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Не вижу проблем с точни зрения спамеров зарегестрировать тысячи ZerioID\n\n1000\\*10k и 1000\\*100k имеет разницу?\nПредполагается что провайдер авторизации борется со спамерами своими методами. Админ сайта волен доверять любому провайдеру, а также настраивать лимиты для каждого в отдельности, в соответствии с доверием.",
				"added": 1525632013
			}
		],
		"2_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx": [
			{
				"comment_id": 7,
				"body": "Как всегда, стоит задать вопрос - находится ответ.\nЗаметил что на win больше частота процессора.\nОказывается на linux не работал Turbo Core.\nДобавил в опции ядра radeon.bapm=1 и стало шустрее.",
				"added": 1489272570
			}
		],
		"1_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN": [
			{
				"comment_id": 8,
				"body": "+1",
				"added": 1502045766
			}
		],
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 9,
				"body": "Пиши о чем тебя интересует.",
				"added": 1508019414
			}
		],
		"1_1HjPcm98huSQdRkf5F1VQs4w8caUgq6eA": [
			{
				"comment_id": 15,
				"body": " A distributed data community\nDat is a nonprofit-backed data sharing protocol for applications of the future. \nhttps://datproject.org/\n\nRethink the Web browser\nBeaker is a peer-to-peer browser with tools to create and host websites. Don't just browse the Web, build it.\nhttps://beakerbrowser.com/",
				"added": 1524018548
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 16,
				"body": "В последнее время OSX, CentOS.",
				"added": 1524674286
			}
		]
	},
	"comment_vote": {
		"46_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA": 1,
		"45_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA": 1,
		"163_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"21_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni": 1,
		"2_1BidCEzNjETypKRCaRFQ6myvDo71o6FDyC": 1,
		"7_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn": 1,
		"253_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"344_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"361_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1
	}
}