{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1525355227,
			"title": "卐",
			"body": "",
			"added": 1525355226,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1525450580,
			"title": "Watch \"Europa the last battle\" series on youtube",
			"body": "https://www.youtube.com/watch?v=WqREtbt__O8\nhttps://www.youtube.com/watch?v=rXMvJnlweeI\nhttps://www.youtube.com/watch?v=ENioRIGdNNU\nhttps://www.youtube.com/watch?v=t32odnVdcOg\nhttps://www.youtube.com/watch?v=siJ4S5t8CWs\nhttps://www.youtube.com/watch?v=h0pA2aTyXy4\nhttps://www.youtube.com/watch?v=zgrQhzyDBL8\nhttps://www.youtube.com/watch?v=JKwFrO5AX9s\nhttps://www.youtube.com/watch?v=-kl4NFVkAGQ\nhttps://www.youtube.com/watch?v=PQ-mAMTClT8",
			"added": 1525450578
		},
		{
			"topic_id": 1530451214,
			"title": "Is homosexuality genetics?",
			"body": "Whether its a hair loss, autism, homosexuality or any other biological issue associated with humans, it has become the new research trend to directly jump to the conclusion its genetics. The boy or the girl or male or the female, are genetically designed to be like this there is no other cause. Researchers always follow the trend to get their manuscript published in high impact factor journals and they give various mechanisms or theories to prove their work. Who create these research trend? :Newpapers, News media or to be more clear capitalist controlled media. There is always a hidden agenda in these trends or propagandas started by these capitalists. Very few researcher works against these trends and try to bring truth to the public. One of the research work (a review article) i am sharing here raise this question \"Is homosexuality genetics?\". Here is the link to the manuscript: http://sci-hub.tw/10.1300/J082v28n01_08\nThis report concludes that studies conducted by researchers on relation between homosexual behavior or genetics are seriously flawed and do not completely cover all the research methodology required to find this relation. \nAlso while reading i found there is one person named Dr. Wilson (i dont know whether its person or website name) who claims that mineral deficiency more specifically Zinc deficiency and copper toxicity in the body results in homosexual behavior. here is the link:https://www.drlwilson.com/articles/HOMOSEXUALITY.htm\nAlso if we go by Bible or Quran or Torah considers homosexuality as sin since its not the basic nature but a relation born either by lust or medical condition (mineral deficiency).",
			"added": 1530451211
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": [
			{
				"comment_id": 1,
				"body": "> [theanswerer0](#comment_15_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): It's super similar to Marxism, but I would probably play it safe and call it some other variant of egalitarianism based upon wikipedia's noting that he got thrown out of a Young Communist meeting after shouting out that Karl Marx was wrong. I have no idea what he was disagreeing with Marx about or if his views changed later in his life, but I think it's fair to say that ol' Karl doesn't have the exclusive right to claim ownership of social egalitarian bullshit.\n\nVenus project is based on resource based economy \" an economy based on efficient utilization of resources through technology\". Venus project abolishes the right to hold any kind of property just like communism. This project simply wants to create a modern or high tech prison, for people or workers or employees or labours, which will be controlled by emotion less Artificial intelligent computer (which big capitalists like facebook, google etc are already developing). And once we  entered this prison we will be left with no rights and will be on the mercy of emotionless AI. We don't need technology for the efficient utilization of resources we just need enlightenment and bring the greedy capitalist manifesto to halt. We need to place human values and human societal development on top priority and limit capitalists within the shell of society.",
				"added": 1525450026
			},
			{
				"comment_id": 2,
				"body": "> [shitchell](#comment_53_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): There actually hasn't been any AI specifically mentioned other than natsoc vaguely talking about \"emotionless AI\" running \"the prison\". That seems to insinuate (but doesn't actually specify) artificial general intelligence (human level AI or greater). If memory serves me correctly, the Venus Project makes no mention of utilizing AGI for literally anything. And personally, I have strong moral issues with creating a sentient, conscious entity (computer based or otherwise) and then demanding anything of it. That's paramount to slavery. Which probably isn't a good idea when the thing you're attempting to enslave can surpass the combined intelligence of the globe in a short timespan :p [...]\n\nPlease read this link on venus project which clearly mentions about use of AI. It is the part of book \"The Best That Money Can’t Buy\" by Jacque Fresco (founder).",
				"added": 1525700934
			},
			{
				"comment_id": 3,
				"body": "> [eibriel](#comment_49_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): The quality of life is improving steadily, so going back is not an option, I think will be better to look to the futurehttps://ourworldindata.org/famines#rate-of-people-dying-due-to-famines-since-1860https://ourworldindata.org/water-access-resources-sanitation#number-of-people-without-access-to-an-improved-water-sourcehttps://ourworldindata.org/war-and-peace#the-past-was-not-peaceful [...]\n\nRate of survival is surely increased but about quality of life and evolution of human race i really doubt. Regarding evolution, we are weaker not just physically but our brain is also shrinking > [natsoc](#comment_2_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX): Please read this link on venus project which clearly mentions about use of AI. It is the part of book \"The Best That Money Can’t Buy\" by Jacque Fresco (founder).\n\nhttps://www.thevenusproject.com/multimedia/automating-the-future/",
				"added": 1525701298
			},
			{
				"comment_id": 4,
				"body": "> [pollen](#comment_1_1JqrogiDCFGRVVrCdxwP93wurKDSgUCk4E): The Venus Project is in essence the desire to return to the womb and live forever in an amniotic sack within a mothering AI that takes care of one's every need. There are many, many aspects of the project which are simply primed and ready to fail, but we can discuss a few to start. [...]\n\nThe Venus Project is in essence the....bla bla bla . Its tooooo long to read ....write something smaller and crispier to prove your logic. Your V-Anus project doesn't sound sustainable as mother don't keep her baby more than 9 months in her womb.",
				"added": 1525879243
			},
			{
				"comment_id": 5,
				"body": "> [pollen](#comment_1_1JqrogiDCFGRVVrCdxwP93wurKDSgUCk4E): The Venus Project is in essence the desire to return to the womb and live forever in an amniotic sack within a mothering AI that takes care of one's every need. There are many, many aspects of the project which are simply primed and ready to fail, but we can discuss a few to start. [...]\nSorry mate just commented before reading.....I just made my conclusion by reading first line.....But i still haven't read it :)",
				"added": 1525884219
			}
		],
		"1524948467_1Epxa7SJuXtrTQgTZsgxSyudBQyvs33wh8": [
			{
				"comment_id": 6,
				"body": "Jews don't hate Assad. Assad is their puppet. both Assads (father & son) against the wishes of Syrian people  introduced free market policy which is beneficial for international Jewish investors. They destabilized Syria's governance by introducing inefficient parliamentary democracy. So Jews don't hate Assad but they only hate people of Syria who are against Assad policies.",
				"added": 1527173220
			},
			{
				"comment_id": 7,
				"body": "Jews don't hate Assad. Assad is their puppet. both Assads (father & son) against the wishes of Syrian people  introduced free market policy which is beneficial for international Jewish investors. They destabilized Syria's governance by introducing inefficient parliamentary democracy. So Jews don't hate Assad but they only hate people of Syria who are against Assad policies.",
				"added": 1527173246
			}
		],
		"1527176149_1D1DTxbngBSkKe6BfHPyuudBrB8ZapNjoV": [
			{
				"comment_id": 8,
				"body": "Libertarian socialism: decentralized form of communism.  Noam Chomsky is one of the most well-known contemporary libertarian socialist thinkers. It is no coincidence that he is also JEW just like Karl Marx founder father of communism.",
				"added": 1527329711
			},
			{
				"comment_id": 9,
				"body": "> [skwerlman](#comment_66_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): i will never cease to be amazed by the number of ways people manage to squeeze antisemitism into random discussions :P [...]\n\nYes my comment sounded anti-semitic which i am not. In general i have no problem with Jews but yes i have problem with Ashkenazi Jews. I am not expert in Jewish religion or history but what i have studied till now this category of the Jew is a real problem to the society. I also doubt if they are really a Jew or a different race hiding themselves in Judaism. The Torah and Talmud condemns lending money with interest and is considered a sin. Bank Hapoalim of Israel (Owned by Ashkenazi) charges interest on loans given to Jews. This is just one example they are not just corrupting Christianity or Islam they are corrupting Judaism.",
				"added": 1527519522
			}
		],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 10,
				"body": "Their were many comments on this topic but now i cant see any. Are these comments deleted ? or my zeronet is not getting updated.",
				"added": 1531837511
			}
		]
	},
	"comment_vote": {}
}