{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1513904934,
			"title": "Millchan imageboard",
			"body": "http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\n\nMillchan is a work in progress imageboard.\nSome features that have been implemented so far:\n- Board creation\n- Post/user blacklist\n- Multiple images in a single post\n- Catalog\n- Post editing\n\nAny thoughts or suggestions are welcome.",
			"added": 1513904933
		},
		{
			"topic_id": 1525083049,
			"title": "optionalFilePin internal error on many files",
			"body": "`optionalFilePin` raises the following error if given more than 999 (SQLITE_MAX_VARIABLE_NUMBER) files as argument:\n\n    Internal error: OperationalError: too many SQL variables UiWebsocket.py line 81 > UiWebsocket.py line 258 > UiWebsocketPlugin.py line 203 > UiWebsocketPlugin.py line 198 > Db.py line 81 > DbCursor.py line 71",
			"added": 1525083047
		},
		{
			"topic_id": 1548974921,
			"title": "Millchan merger site",
			"body": "[Millchan Engine](/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/) is a merger site running a modified version of the Millchan engine to work with the merger plugin.\nEach merged hub will behave as its own board.\n\n**Why?**\n- Hub owners have full control of the data in their hubs. That means being able to delete and modify files, define allowed certificates, etc;\n- '''DOWNLOAD AND HELP DISTRIBUTE ALL FILES''' will work for individual hubs. That means not having to download everything on Millchan to help distribute files for specific boards;\n- Simplification of codebase.\n\n[Example hub](/13kifcv8J8noDEXdztXY4qkPPPKLK2PiAe/)",
			"added": 1548974918
		}
	],
	"topic_vote": {
		"1524327364_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": 1,
		"1526797668_1M3M7mVoyXYtWz3aq6BG4fP2fwjdv7Rxj1": 1,
		"1537503904_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": 1,
		"1543955963_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1544973426_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1
	},
	"next_comment_id": 29,
	"comment": {
		"1513904934_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 1,
				"body": "> [version](#comment_2_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): Need a search feature. Thanks:)And, when open the second video, the first video need to pause :)\nA search feature is a good idea.\nIt has been added to the todo list. Thanks.",
				"added": 1513933793
			},
			{
				"comment_id": 2,
				"body": "> [version](#comment_4_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): Download epub book files, the file name is random number.\n\nFiles are stored with a filename generated from a hash digest for validation and deduplication purposes.\nIf you want to download them with the original filename try left-clicking the filename link.\n\nIt's worth noting that nothing will happen (i.e., \"the download as\" dialog will not be displayed) if ZeroNet fails to load the file that you're trying to download.",
				"added": 1513978219
			},
			{
				"comment_id": 3,
				"body": "> [missesrobot](#comment_60_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB): Is this site safe to seed?\nIt should be. The only required files are the data.json files that contain users's posts/boards.\nEverything else is optional and it will only be downloaded on request.\n\n>Is pornography moderated?\nBoard owners can blacklist users and/or posts which means they will, by default, not be rendered to anyone that visits the board.\nSo if you have an active board owner that blacklists pornography then pornography will be moderated there.\n\nThe blacklist can also be disabled if a users wants to ignore the board owner's blacklist and render all posts.",
				"added": 1514023160
			},
			{
				"comment_id": 4,
				"body": "> [zaraonet](#comment_1_1L2fnDSg4AzEFzBYU4jD4Vn9nSf31ZbrGR): Always shows \"Generating anonymous certificate\" and the start page always keep black with logo and “Millchan engine” link only.\n\nSorry to hear that.\nThat's usually a certificate problem in your ZeroNet/data/users.json file.\nTry deleting Millchan's related nodes in \"certs\" and \"sites\", then save and restart ZeroNet.\n\n> [version](#comment_8_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): Everyone can create boards, the index board will be so so so long !\n\nYeah that's definitely possible with a system like this. See 8ch and the 16k boards that it has right now.\nFor the amount of boards there are at the moment I think the current system works fine but the requirement for better ways to find boards of interest will increase proportionally to the amount of boards available.\n\n>and the ID is no need in index\n\nMultiple users can have a board with the same URI.\nTherefore, the user ID is included for disambiguation purposes.",
				"added": 1514427373
			},
			{
				"comment_id": 5,
				"body": "> [zaraonet](#comment_3_1L2fnDSg4AzEFzBYU4jD4Vn9nSf31ZbrGR): Great Site BTW.\n\nThanks :)\nI'm glad it worked for you.\n\nI'm not sure yet why it happens with some people but it might be a good idea to verify if the cert is broken and then generate an error popup instead of the infinity certificate generation that is happening right now.",
				"added": 1514454048
			},
			{
				"comment_id": 7,
				"body": "The automatic certificate generation that was executed on the first visit has been replaced with a generation on manual request.\nThat should prevent that infinite creation loop that was happening to some people.",
				"added": 1514726536
			},
			{
				"comment_id": 12,
				"body": "> [anonymouslogin](#comment_86_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): how do i create new certificate?\nIt will be auto-generated when you post or create a board.\nIt will take a few seconds the first time but posting will be a lot faster the other times.",
				"added": 1515452627
			}
		],
		"1514422899_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": [
			{
				"comment_id": 6,
				"body": "> [mrsrobotzerocat](#comment_6_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa): Anybody can get anyone arrested by just tricking them into downloading kiddy porn\n\nI'm not sure if that's an accurate statement.\nIt seems the law of most countries explicitly states that the person has to _knowingly_ download that kind of material.\nSo tricking someone to download it doesn't count.\nThere are also a number of affirmative defenses that are possible depending on the circumstances of the event.",
				"added": 1514536850
			}
		],
		"1515382567_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": ">Millchan Has CP Accessible via Proxies that Seed the Site\nNice tabloid title.\nIt's also a slanderous lie. Shame on you.\n\nI can assure you that there is zero CP in Millchan, at time of this post, unless you consider the drawings that nekololi himself and others have posted in the /l/ board.\n\n>Millchan's owner made an inadequate guarantee to @missesrobot: that the site is safe to seed from a proxy\nThat's incorrect.\nHere are the exact words she asked me:\n>Is this site safe to seed? Is pornography moderated?\nHere's my answer verbatim:\n>Board owners can blacklist users and/or posts which means they will, by default, not be rendered to anyone that visits the board.\n>So if you have an active board owner that blacklists pornography then pornography will be moderated there.\nI still stand by everything that I stated and, at no point, I mentioned that I was going to globally censor users.\n\nYou're right that the system, so far, is being designed primarily with non-proxies users in mind.\nI wasn't even aware that there were proxies to Millchan.\nIf you had raise your concerns related to it on /dev/ I would have happily addressed them and we could work on trying to make a safer system to everyone.",
				"added": 1515447347
			},
			{
				"comment_id": 9,
				"body": "> [nekololi](#comment_136_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): if each board was its own hub/site, with which millchan merges together, such as how zerome, gitcenter, and 0gallery function, then each board would only be downloaded and visible if you choose to visit that site and have it included in what millchan aggregates.\nMaybe you should consider suggesting that next time instead of overreacting over an empty random user board.\n\n>there is a board titled CP\nAnd? Are you suggesting me to auto-blacklist all boards that have something \"bad\" in the title then?",
				"added": 1515447971
			},
			{
				"comment_id": 10,
				"body": "> [nekololi](#comment_138_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): what is millchan's policy on CP being posted to it?\nMillchan's policy is to give users the tools that they need to be able to filter any illegal content from being downloaded and seeded from their clients.\nSo, in the same way that it's possible for someone to blacklist zites that they are not interested in seeding, it should be possible for users in Millchan to blacklist and stop seeding the content of any boards/users they are not interested in contributing with.\n\nThat's the kind of imageboard I'm envisioning although, as I have stated in another thread, it is still a work in progress and there are still things that could/will be implemented to improve the security without compromising the freedom to communicate by relying on someone else's arbitrary moral judgment.",
				"added": 1515450554
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_67_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm essentially repeating myself, but for proxies, hubs are needed.\n> [nekololi](#comment_139_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): have you not considered the hub - merger site model?\nI was looking into hubs lately.\nIt does seem like they could work well as an alternative to the current board system.\nI'm still not sure if they would well on proxies though since, as far as I understand, users can still submit \"bad files\" and those would be downloaded to the client.\nAlthough the hub owner might be able to moderate the content in his own hub.\nSo I guess it could work for proxies if the proxy owner only adds hubs that he trusts to be moderated.",
				"added": 1515452002
			},
			{
				"comment_id": 13,
				"body": "> [nekololi](#comment_140_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): require you to start from scratch once again...\nI don't think so. The code is well modularized.\nIntegrating that using the components that are already built wouldn't be a big hassle.\nI just need some time familiarize myself with the in-and-outs of the plugin.\n\nFor now, I think it may be possible to achieve something somewhat similar, but perhaps not as ideal as the hubs proposal, which is to make a static whitelist of boards that would be rendered on proxies and force file deletion on blacklisted posts.\nIt seems to me that both would achieve similar results.\n\nIf there is a proxy owner whiling to evaluate the pros-and-cons of these approaches I'll be interested in hearing your evaluation and seeing what we can do to make things safer and compatible to most people as possible.\nYou can contact me in the /dev/ board if you want.",
				"added": 1515454595
			}
		],
		"1521905871_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn": [
			{
				"comment_id": 14,
				"body": "I can't reproduce.\nIs there an error being displayed in your console?\n\nI think it was probably a problem with loading the main javascript file.\nIf the hash of the file you have matches what's defined in content.json everything should be back to normal. \n```\n  \"js/all.js\": {\n   \"sha512\": \"3d15bd98009e5b463029dec804d7eefafab38f806a4f3f3194e9e676a8121320\",\n   \"size\": 527585\n  }\n```",
				"added": 1521908251
			},
			{
				"comment_id": 15,
				"body": "Thanks for the info naisa.\n\n>TypeError: localStorage is null all.js:1370:11\nWhich browser?\nWhen testing in different browsers there was a similar error when the browser refuses to allow to access the local storage or refuses to allow \"3rd party cookies\".",
				"added": 1521910917
			},
			{
				"comment_id": 16,
				"body": "This seems like something that should be fixed in ZeroNet's code itself.\n\nhttps://github.com/HelloZeroNet/ZeroNet/blob/master/src/Ui/media/all.js#L1366\n\nThere are no checks in this function to verify if the browser's localStorage is accessible.\nDepending on the browser's permission `localStorage.getItem` will raise an uncaught exception since the zite might not have permission to read the localStorage object.\n\n>Uncaught DOMException: Failed to read the 'localStorage' property from 'Window': Access is denied for this document.\n\nSince this is done in a wrapper call I'm  unaware of a simple way to handle that exception.\n\nThe same thing applies to `wrapperSetLocalStorage`.",
				"added": 1521911673
			},
			{
				"comment_id": 17,
				"body": "I suggest opening an issue in ZeroNet's repository asking to add some error handling to the `actionGetLocalStorage`  and `actionSetLocalStorage` functions to deal with the cases where the browser doesn't have access to `localStorage`.\n\n@nofish",
				"added": 1521912062
			},
			{
				"comment_id": 18,
				"body": ">dom.storage.enabled default boolean true\n\nSince your browser is still returning a null localStorage it seems like there might be something there preventing access to it.\nI cannot have full access to the localStorage from an iframe.\nChecking if the object `localStorage` exists and if it's different from `null` has to be done in ZeroNet's media/all.js file.",
				"added": 1521913589
			},
			{
				"comment_id": 19,
				"body": "I will open a pull request to ZeroNet to handle this problem.\nIf merged, I will update Millchan's code accordingly and post an update here.\n\nMeanwhile, you could try debugging to understand the reason you're getting a nulll localStorage with dom.storage.enabled=true or just try a different browser altogether.",
				"added": 1521915148
			},
			{
				"comment_id": 20,
				"body": "I'm glad it worked for you.\nI still think it's a good idea to handle lack of permission in those functions to avoid similar problems happening to other people and other zites.\n\nThanks for the info and please report if you have any other problems there.",
				"added": 1521916301
			},
			{
				"comment_id": 21,
				"body": "If you don't want to enable access to localStorage but also wish to avoid zites completely breaking for no apparent reason you can just patch your `Ui/media/all.js` file.\n```\ndiff --git a/src/Ui/media/all.js b/src/Ui/media/all.js\nindex ade5821..cc0c2ee 100644\n--- a/src/Ui/media/all.js\n+++ b/src/Ui/media/all.js\n@@ -1371,7 +1371,16 @@ jQuery.extend( jQuery.easing,\n       return $.when(this.event_site_info).done((function(_this) {\n         return function() {\n           var data;\n-          data = localStorage.getItem(\"site.\" + _this.site_info.address + \".\" + _this.site_info.auth_address);\n+          try {\n+            data = localStorage.getItem(\"site.\" + _this.site_info.address + \".\" + _this.site_info.auth_address);\n+          } catch(err) {\n+            _this.log(\"GetLocalStorage error:\", err.message);\n+            return _this.sendInner({\n+              \"cmd\": \"response\",\n+              \"to\": message.id,\n+              \"result\": null\n+            });\n+          }\n           if (!data) {\n             data = localStorage.getItem(\"site.\" + _this.site_info.address);\n             if (data) {\n@@ -1394,7 +1403,12 @@ jQuery.extend( jQuery.easing,\n\n     Wrapper.prototype.actionSetLocalStorage = function(message) {\n       var back;\n-      back = localStorage.setItem(\"site.\" + this.site_info.address + \".\" + this.site_info.auth_address, JSON.stringify(message.params));\n+      try {\n+        back = localStorage.setItem(\"site.\" + this.site_info.address + \".\" + this.site_info.auth_address, JSON.stringify(message.params));\n+      } catch(err) {\n+        this.log(\"SetLocalStorage error:\", err.message);\n+        back = null;\n+      }\n       return this.sendInner({\n         \"cmd\": \"response\",\n         \"to\": message.id,\n@@ -1694,4 +1708,4 @@ jQuery.extend( jQuery.easing,\n```\n\nThanks @gitcenter for the suggestions.",
				"added": 1522708312
			}
		],
		"1523382548_14wq4cKwF3YzMqJ1V3QB8Yd5cVJiYizjNS": [
			{
				"comment_id": 22,
				"body": "You're probably having problems with localStorage.\nSee the thread that @sstrooper posted.\n\nIt doesn't look like this will get fixed so I will probably just rewrite Millchan's code to store the settings in a local file, similarly to the user blacklist, and avoid using the localStorage endpoints altogether.",
				"added": 1523397957
			},
			{
				"comment_id": 23,
				"body": "Millchan no longer uses any of the localStorage endpoints.\nHenceforth, settings will be stored in a local `settings.json` file.\nThis will prevent similar problems from happening again in the future and it will also allow settings to be shared across different browsers.\nThe site should be fully functional now even if your browser is configured to not allow cookies or access to localStorage.",
				"added": 1524417363
			}
		],
		"1527769432_1H9gLw2sSkrKktr8AT4xRC9aTU2koXwAry": [
			{
				"comment_id": 24,
				"body": "To identify you can search places that are calling the canvas methods.\ntoBlob and toDataURL are the usual culprits but you can see all the methods that have been patched in the [commit](https://gitweb.torproject.org/tor-browser.git/commit/?h=tor-browser-52.5.2esr-7.0-2&id=196354d7951a48b4e6f5309d2a8e46962fff9d5f).",
				"added": 1527775494
			}
		],
		"1530679713_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 25,
				"body": "As of now, the largest file in Millchan is a ~5.6GB archive.\nFiles larger than that should work fine for upload/download without needing too much resources.\n\nOne problem with big files like that is the option to save files with original filename since, for the option to work in all browsers (Firefox in particular likes ignoring the download attribute when executed from an iframe), the full file is loaded into memory and then the user is prompted to save it to disk with the original file name.",
				"added": 1530753437
			}
		],
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 26,
				"body": "Yes you can block individual users by blocking whatever certificates they're using.",
				"added": 1548981954
			},
			{
				"comment_id": 27,
				"body": "> [pexo](#comment_50_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Nice work!(again)Do you want to add it to ZeroSites now or wait a little fist? [...]\n\nProbably wait for a bit to check if everything is behaving as expected and if it will continue to behave like that as the number of hubs and posts increases. \nPlease let me know if you see any bugs.",
				"added": 1549061020
			},
			{
				"comment_id": 28,
				"body": "> [whateverabc](#comment_2_1E8jBAziTnrJcoWWSG2D15t7JdxhTdT7gH): @mcdev [...]\n\nThanks for your interest, @whateverabc\nMost of the interface should already be translated if you're using the Chinese language.\nSome exceptions are the \"options\" component and the wrapper notifications.\nI will try making some modifications soon to allow for the latter to be translated.\n\nIf you feel like I'm missing and there is something else that should be translated you can post in this [/dev/ thread](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:41b0413d-1cfd-4945-81df-1445518b0b2d) and I will add it to the translation files eventually.",
				"added": 1550010877
			}
		]
	},
	"comment_vote": {
		"2_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4": 1,
		"62_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"3_1L2fnDSg4AzEFzBYU4jD4Vn9nSf31ZbrGR": 1,
		"140_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"24_1CLQdyjUXGdhWumfS4c7vMA8TkjUhNHQkc": 1,
		"12_1M3M7mVoyXYtWz3aq6BG4fP2fwjdv7Rxj1": 1,
		"51_1PfpsxK9HpYgyPkBtdr7C7UJNfhMwFACue": 1,
		"246_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"348_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"44_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"50_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"386_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"2_1E8jBAziTnrJcoWWSG2D15t7JdxhTdT7gH": 1,
		"60_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	}
}