{
	"user": [
		{
			"user_id": "1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ",
			"user_name": "efi3@zeroid.bit",
			"added": 1618792462445
		}
	],
	"next_user_id": 2,
	"comment": [
		{
			"comment_id": "1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZcomment1",
			"body": "<p>Na gorąco czytam, to jest porażające ile tego jest? Takie niewinne - E -, I my to wszystko zjadamy i się trujemy. Jakie są efekty tego zatrucia to możemy zobaczyć na naszych ulicach. Bardzo dobry materiał, warty polecenia innym.&nbsp;</p>",
			"body_p": "Na gorąco czytam, to jest porażające ile tego jest? Takie niewinne - E -, I my to wszystko zjadamy i się trujemy. Jakie są efekty tego zatrucia to możemy zobaczyć na naszych ulicach. Bardzo dobry materiał, warty polecenia innym.&nbsp;",
			"topic_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1topic2",
			"user_id": "JHhd5ewmXtSRl@zv.anonymous",
			"comment_parent_id": 0,
			"added": 1618792772102
		},
		{
			"comment_id": "1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZcomment2",
			"body": "<p>Ciekawe Fakty Historyczne, Dlaczego tego nie uczą w szkole???</p>",
			"body_p": "Ciekawe Fakty Historyczne, Dlaczego tego nie uczą w szkole???",
			"topic_id": "1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4xtopic1",
			"user_id": "efi3@zeroid.bit",
			"comment_parent_id": 0,
			"added": 1631638436509
		}
	],
	"next_comment_id": 3,
	"channel": [
		{
			"channel_id": "1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZch1",
			"name": "efi3",
			"description": "Zdrowie-Leczenie-Szkodzenie.",
			"user_id": "efi3@zeroid.bit",
			"added": 1631213830038
		}
	],
	"next_channel_id": 2,
	"topic": [
		{
			"topic_id": "1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZtopic1",
			"channel_id": "undefined",
			"user_id": "efi3@zeroid.bit",
			"title": "2021.08.28.05.[PL]-Wiedza-SZCZEPIONKA-Dr.Robert Young.",
			"body": "<p>2021.08.28.05.[PL]-Wiedza-SZCZEPIONKA-Dr.Robert Young.</p><p>[Źródło: Ciel Voilé (cielvoile.fr) ]<br>Dr Robert Young – 20 sierpnia 2021 r.<br><a href=\"https://www.drrobertyoung.com/post/transmission-electron-mikroskopia-ujawnia-tlenek-grafenu-w-szczepionkach-cov-19\">https://www.drrobertyoung.com/post/transmission-electron-mikroskopia-ujawnia-tlenek-grafenu-w-szczepionkach-cov-19</a></p><p>Mikroskopia z kontrastem fazowym, transmisyjna i skaningowa mikroskopia elektronowa oraz spektroskopia rentgenowska z dyspersją energii ujawniają składniki szczepionek CoV-19!</p><p>Obecnie cztery duże firmy farmaceutyczne wytwarzają szczepionkę przeciwko SARS-CoV-2, obecnie nazywaną SARS-CoV-19. Ci producenci i ich szczepionki to szczepionka Pfizer – BioNTech mRNA, szczepionka Moderna-Lonza -1273 mRNA, szczepionka Serum Institute – Oxford Astrazeneca oraz szczepionka Covid-19 Janssen, wyprodukowana przez Janssen Biotech Inc, firmę farmaceutyczną Janssen firmy Johnson &amp; Johnson, rekombinowaną , z niezdolnym do replikacji adenowirusem eksprymujący białko wypustek SARS-CoV-2. Celem tych szczepionek jest nadanie odporności przeciwko nowemu zakaźnemu koronawirusowi lub SARS-CoV-2, obecnie nazywanemu SARS-CoV-19.</p><p>Te cztery firmy farmaceutyczne nie ujawniły pełnej informacji FDA na swoim pudełku ze szczepionkami, ich arkusze informacyjne lub etykiety dla wielu głównych i / lub drugorzędnych składników tych tak zwanych szczepionek. Celem tego artykułu badawczego jest identyfikacja konkretnych głównych i drugorzędnych składników zawartych w szczepionce Pfizer, szczepionce Moderna, szczepionce Astrazeneca i szczepionce Janssen przy użyciu różnych naukowych testów anatomicznych, fizjologicznych i funkcjonalnych dla każdej szczepionki SARS-VOC.</p><p>Ponieważ prawa człowieka podlegają prawu międzynarodowemu w Kodeksie Norymberskim z 1947 r., informacje o określonych składnikach szczepionek są niezbędne, wymagane i konieczne, aby każdy człowiek z dowolnego kraju na świecie mógł podjąć świadomą decyzję, czy wyraża zgodę. do zaszczepienia SARS-CoV-2-19.Przeprowadziliśmy badania naukowe na każdej szczepionce i zidentyfikowaliśmy kilka nieujawnionych składników lub adiuwantów zawartych w tych czterech szczepionkach SARS-CoV-2-19. Obecnie szczepionki te są podawane milionom ludzi na całym świecie na podstawie zezwolenia na stosowanie w sytuacjach nadzwyczajnych (EUA) wydawanego przez każdy kraj bez ujawniania wszystkich składników, a w niektórych przypadkach na żądanie rządów lub pracodawców, co stanowi naruszenie praw człowieka zgodnie z Kodeksem Norymberskim z 1947 r.</p><p>Metodologia i techniki<br>Przeanalizowano cztery „szczepionki”, a mianowicie szczepionkę Pfizer-BioNtech, Moderna-Lonza mRNA-1273, Vaxzevria firmy Astrazeneca, Janssen firmy Johnson &amp; Johnson, przy użyciu różnych instrumentów i protokołów przygotowania zgodnie z nowymi podejściami technologicznymi do nanocząstek. Różne instrumenty obejmują mikroskopię optyczną, mikroskopię jasnego pola, mikroskopię kontrastową pHazy, mikroskopię ciemnego pola, spektroskopię absorbancji UV i fluorescencyjną, skaningową mikroskopię elektronową, transmisyjną mikroskopię elektronową, spektroskopię dyspersji energii, dyfraktometr rentgenowski i instrumenty magnetycznego rezonansu jądrowego. weryfikacja morfologii i zawartości „szczepionek”. Do zaawansowanych technologicznie pomiarów i opieki dochodzeniowej,wszystkie kontrole zostały aktywowane, a pomiary referencyjne przyjęte w celu uzyskania potwierdzonych wyników.</p><p>Mikroskopia kontrastu fazowego i ciemnego pola żywej krwi<br>Następnie uzyskano obrazy wodnych frakcji szczepionek, aby wizualnie ocenić możliwą obecność cząstek węgla lub grafenu.</p><p>Obserwacje mikroskopii optycznej ujawniły obfitość przezroczystych obiektów laminarnych 2D, które wykazują duże podobieństwo do obrazów z literatury (Xu i in., 2019) oraz do obrazów uzyskanych ze standardu rGO (SIGMA) (ryc. 1, 2 i 3).</p><p>Uzyskano obrazy dużych przezroczystych arkuszy o różnych rozmiarach i kształtach, ukazujących faliste i płaskie, nieregularne kształty. Mniejsze liście o wielokątnym kształcie, również podobne do płatków opisanych w literaturze (Xu i wsp., 2019) można ujawnić za pomocą mikroskopii kontrastowej pHazy i ciemnego pola (ryc. 3).</p><p>Wszystkie te laminarne obiekty były szeroko rozpowszechnione w wodnej frakcji próbki krwi (fig. 1) lub szczepionki (fig. 2 i 3) i żaden składnik opisany przez oczekujący patent nie może być powiązany z tymi arkuszami.</p><p>Rysunek 1, możesz zobaczyć, jak „bomba kasetowa” ze zredukowanym tlenkiem grafenu (rGO) wygląda w żywej, niezabarwionej ludzkiej krwi po zaszczepieniu CoV-19, powodując patologiczne krzepnięcie krwi![1] [2] [55 ] [56] [57]</p><p>Figura 1 jest mikrografią skupienia węgla zredukowanego tlenku grafenu (rGO) uwidocznionego w żywej, niezabarwionej ludzkiej krwi przy użyciu mikroskopii kontrastowej pHazy przy 1500x. Zauważ, że czerwone krwinki gromadzą się razem wi wokół kryształu rGO w stanie znanym jako Rouleau! Francuskie słowo, które oznacza „usypać”.</p><p>Jakie są nieujawnione składniki w tak zwanych szczepionkach Pfizer, Moderna, Astrazeneca i Janssen CoV-19?</p><p>Aby odpowiedzieć na to pytanie, z każdej fiolki pobrano wodną frakcję szczepionek Pfizer, Moderna, Astrazeneca i Janssen, a następnie zbadano ją oddzielnie pod mikroskopem kontrastowym pHazy przy powiększeniu 100x, 600x i 1500x, wykazując anatomiczne oznaki występowania cząstek zredukowanego tlenku grafenu (rGO), które porównano z mikrofotografią rGO z Choucair et al, 2009 w celu identyfikacji i weryfikacji [3].</p><p>Etapy analizy wodnych frakcji szczepionki<br>Schłodzone próbki poddano obróbce w sterylnych warunkach, stosując komorę z przepływem laminarnym i sterylny sprzęt laboratoryjny.</p><p>Etapy analizy są następujące:</p><p>Rozcieńczenie w sterylnym 0,9% roztworze soli fizjologicznej (0,45 ml + 1,2 ml)</p><p>Frakcjonowanie polaryzacji: 1,2 ml heksan + 120 µl próbki RD1</p><p>Ekstrakcja hydrofilowej fazy wodnej</p><p>Skanowanie absorpcji UV i spektroskopii fluorescencyjnej</p><p>Ekstrakcja i oznaczenie ilościowe RNA w próbce<br>Mikroskopia elektronowa i optyczna pHazy wodnej.</p><p>Nieujawnione składniki „szczepionki” firmy Pfizer<br>Mikrofotografie z ryc. 2 i 3 uzyskano za pomocą optycznej mikroskopii kontrastowej pHazy 100X, 600X i 1500X, ciemnego pola i jasnego pola [3].<br>Po lewej stronie każdej mikrofotografii zobaczysz mikrofotografie uzyskane z wodnej frakcji szczepionki Pfizer zawierającej rGO.<br>Po prawej stronie każdej mikrofotografii zobaczysz korespondencję ze znanymi źródłami zawierającymi rGO do walidacji anatomicznej.<br>Mikroskopia kontrastowa fazy, ciemne pole, jasne pole, transmisyjna i skaningowa mikroskopia elektronowa, obserwacje szczepionki firmy Pfizer, a także produktów szczepionki firmy Moderna, Astrazeneca i Janssen ujawniły pewne jednostki, które mogą być pasmami grafenu, jak pokazano na rysunku 3 poniżej .</p><p>Figura 2 przedstawia obraz frakcji wodnej próbki szczepionki Pfizer (po lewej) i standardu zredukowanego tlenku grafenu (rGO) (po prawej) (Sigma-777684). Mikroskopia optyczna, 100X<br>Figura 3 – Obrazy wodnych frakcji zawierających zredukowany tlenek grafenu z próbki szczepionki Pfizer (po lewej) i sonikowany standardowy zredukowany tlenek grafenu (rGO) (po prawej) (Sigma-777684). Mikroskopia optyczna z kontrastem fazowym, 600X<br>Rysunek 4 przedstawia kapsyd liposomu zawierającego rGO, który firma Pfizer wykorzystuje w swoim produkcie do przenoszenia tlenku grafenu poprzez przyłączenie kapsydu liposomu do określonych cząsteczek mRNA w celu kierowania zawartości liposomu rGO do narządów, gruczołów i określonych tkanek , a mianowicie jajniki i jądra, szpik kostny, serce i mózg. Obraz uzyskano za pomocą preparatu SEM-Cryo.</p><p>W celu ostatecznej identyfikacji grafenu za pomocą TEM konieczne jest uzupełnienie obserwacji o charakterystykę strukturalną poprzez uzyskanie charakterystycznej próbki wzorcowej za pomocą dyfrakcji elektronów (jak na rysunku „b” pokazanym poniżej).</p><p>Standardowa próbka odpowiadająca grafitowi lub grafenowi ma symetrię heksagonalną i ogólnie wykazuje kilka koncentrycznych sześciokątów.<br>Rysunek 4b przedstawia dyfraktogram rentgenowski cząstek grafenu. Ostateczna identyfikacja tlenku grafenu za pomocą mikroskopii TEM w 4 szczepionkach CoV-2-19<br>Za pomocą transmisyjnej mikroskopii elektronowej (TEM) zaobserwowaliśmy złożoną matrycę lub siatkę elastycznych, półprzezroczystych, złożonych arkuszy rGO, z mieszaniną ciemniejszych wielowarstwowych aglomeracji i jaśniejszych niezłożonych monowarstw, jak pokazano na rycinie 5. [3 ]<br>Rysunek 5 przedstawia klaster nanocząstek grafenu w szczepionce firmy Pfizer. Wydają się być zagregowane.<br>Ciemniejsze obszary liniowe na rysunku 5 wydają się być miejscowym nakładaniem się arkuszy i lokalnym układem poszczególnych arkuszy równolegle do wiązki elektronów [4].</p><p>Po zazębieniu pojawia się duża gęstość niezidentyfikowanych zaokrąglonych i eliptycznych wyraźnych kształtów, prawdopodobnie odpowiadająca otworom generowanym przez mechaniczne wymuszanie siatki rGO podczas przetwarzania, jak widać na rysunku 6. [4]<br>Figura 6 przedstawia obserwację za pomocą mikroskopii TEM, w której cząstki zredukowanego tlenku grafenu znajdują się w szczepionce firmy Pfizer ”. Dyfraktometria rentgenowska ujawnia ich naturę jako krystalicznych nanocząstek rGO opartych na węglu. Spektroskopia rentgenowska z dyspersją energii ujawnia obecność rGO w szczepionce firmy Pfizer [5] [6] [7].</p><p>Zawartość chemiczną i pierwiastkową frakcji ciekłej szczepionki Pfizer poddano następnie analizie metodą spektroskopii rentgenowskiej z dyspersją energii (EDS), jak pokazano na rysunku 6. Widmo EDS wykazało obecność węgla, tlenu. jak również sód i chlorek, ponieważ próbki na rysunkach 2, 3, 5 i 6 zostały rozcieńczone w soli fizjologicznej.<br>Figura 7 przedstawia widmo EDS „szczepionki” Pfizera pod mikroskopem ESEM sprzężonym z mikrosondą rentgenowską EDS (oś X = KeV, oś Y = zliczenia) identyfikującą węgiel, tlen, sód i chlorki.</p><p>Ilościowa ocena mRNA w szczepionce Pfizer<br>Oznaczenie ilościowe RNA w próbce firmy Pfizer przeprowadzono zgodnie z konwencjonalnymi protokołami (Fisher).<br>Zgodnie ze specjalnym oprogramowaniem do weryfikacji kalibracji spektrofotometru NanoDropTM 2000 (Thermofisher), widmo absorpcji UV całej frakcji wodnej skorelowano z 747 ng / µl nieznanych substancji absorbujących.<br>Jednak po ekstrakcji RNA przy użyciu komercyjnego zestawu (Thermofisher), kwantyfikacja przy użyciu sondy fluorescencyjnej Qbit specyficznej dla RNA (Thermofisher) wykazała, że tylko 6t µg / µl można powiązać z obecnością RNA. Widmo było zgodne z pikiem rGO przy 270 nm.<br>Zgodnie z przedstawionymi tutaj obrazami mikroskopowymi, większość tej absorbancji może być spowodowana arkuszami podobnymi do grafenu, obfitymi w płyny zawieszone w próbce.<br>Wnioski te są również poparte silną fluorescencją próbki, z maksimum przy 340 nm, zgodną z wartościami szczytowymi dla rGO. Należy pamiętać, że RNA nie wykazuje spontanicznej fluorescencji pod wpływem promieniowania UV.<br>Figura 8 – Widmo UV frakcji wodnej próbki szczepionki Pfizer. [1] [2] [3] [5] [6]<br>Test fluorescencji ultrafioletowej Pfizera dla zredukowanego tlenku grafenu (rGO) [5]<br>Absorpcję w ultrafiolecie i widma fluorescencyjne otrzymano za pomocą spektrofotometru Cytation 5 Cell Imaging Multi-Mode Reader (BioteK). Widmo absorpcji UV potwierdziło maksymalny pik przy 270 nm, zgodny z obecnością cząstek rGO.<br>Maksymalna fluorescencja UV przy 340 nm również sugeruje obecność znacznych ilości rGO w próbce (Bano i wsp., 2019).<br>Figura 9 – Widma absorpcji UV i fluorescencji uzyskano za pomocą spektrofotometru Cytation 5 Cell Imaging Multi-Mode Reader (BioteK). Widmo absorpcji UV potwierdziło maksymalny pik przy 270 nm, zgodny z obecnością rGO. Maksymalna fluorescencja UV przy 340 nm również sugeruje obecność znacznych ilości rGO w próbce (Bano i wsp., 2019).<br>Rysunek 10 – Analiza spektroskopowa UV wykazała adsorpcję spowodowaną obecnością zredukowanego tlenku grafenu, co potwierdza obserwacja pod widzialnym mikroskopem ultrafioletowym.</p><p>Rysunki 11 i 12 poniżej przedstawiają mikrografię różnych mikro- i nanocząstek, które zostały zidentyfikowane w szczepionkach Pfizer, Moderna, Astrazeneca i Janssen, znanych jako „szczepionki” i przeanalizowane pod mikroskopem elektronowym (SEM) w połączeniu z mikrosondą rentgenowską systemu dyspersji energii (EDS), który ujawnia wielkość cząstek, rozkład składu oraz chemiczny charakter obserwowanych mikro- i nanocząstek [5] [6] [7].<br>Rysunek 11 przedstawia szczątki o długości 20 mikronów zidentyfikowane w tak zwanej „szczepionce” firmy Pfizer zawierającej węgiel, tlen, chrom, siarkę, glin, chlorek i azot.<br>Rysunek 12 przedstawia cząstkę o długości 20 mikronów zidentyfikowaną w tak zwanej „szczepionce” firmy Pfizer. Składa się z węgla, tlenu, chromu, siarki, glinu, chlorku i azotu.<br>Ryciny 13 i 14 poniżej przedstawiają mikrografię różnych mikro- i nanocząstek, które zostały zidentyfikowane w szczepionkach Pfizer, Moderna, Astrazeneca i Janssen i przeanalizowane za pomocą skaningowego mikroskopu elektronowego (SEM) połączonego z mikrosondą rentgenowską systemu rozpraszania energii ( EDS), który ujawnia wielkość cząstek, rozkład składu i chemiczny charakter obserwowanych mikro i nanocząstek.</p><p>Czy w „szczepionkach” firmy Pfizer znajdują się pasożyty?<br>Wydłużony korpus o długości 50 mikronów, jak widać na rycinie 13, jest tajemniczą i wyraźną obecnością w szczepionce Pfizera. Pojawia się i jest anatomicznie zidentyfikowany jako pasożyt Trypanosoma cruzi, którego kilka odmian jest śmiertelnych i stanowi jedną z wielu przyczyn zespołu nabytego niedoboru odporności lub AIDS [Atlas of Human Parasitology, wydanie 4, Lawrence Ash i Thomas Orithel, strony 174 do 178] [8].<br>Rycina 13 przedstawia pasożyta Trypanosoma o długości około 20 mikronów, znalezionego w tak zwanej „szczepionce” firmy Pfizer. Składa się z węgla, tlenu, chromu, siarki, glinu, chlorku i azotu.<br>Mikroskopia z kontrastem fazowym: pasożyt Trypanosoma cruzi [8] żyjący we krwi<br>Rysunek 14 przedstawia skład nanocząstek zawierających węgiel, tlen, chrom, siarkę, glin, chlorek i azot, które występują również w „szczepionkach” CoV-19.<br>Rysunek 13 przedstawia skład nanocząstek<br>Rysunki 15 i 16 poniżej przedstawiają mikrografię różnych mikro- i nanocząstek, które zostały zidentyfikowane i przeanalizowane za pomocą środowiskowego skaningowego mikroskopu elektronowego (SEM) połączonego z mikrosondą rentgenowską systemu dyspersji energii (SDE), która ujawnia chemiczny charakter Obserwowane mikro i nanocząstki oraz ich morfologia.<br>Biała cząsteczka o długości 2 mikronów składa się z bizmutu, węgla, tlenu, aluminium, sodu, miedzi i azotu.<br>Rysunek 15 przedstawia cząstki w skali nano i mikronowej zidentyfikowane w „szczepionce” firmy Pfizer. Biała cząsteczka o długości 2 mikronów składa się z bizmutu, węgla, tlenu, aluminium, sodu, miedzi i azotu.<br>Rysunek 16 pokazuje, że dwumikronowa biała cząsteczka znajdująca się w „szczepionce” firmy Pfizer składa się z bizmutu, węgla, tlenu, glinu, sodu, miedzi i azotu.<br>Rysunki 17 i 18 przedstawiają identyfikację organicznych cząstek węgla, tlenu i azotu z agregatem osadzonych nanocząstek zawierających bizmut, tytan, wanad, żelazo, miedź, krzem i aluminium, z których wszystkie zostały znalezione w tak zwanej „szczepionce Pfizera”. ”.<br>Rysunek 17 przedstawia agregat organiczny (węgiel-tlen-azot) z nanocząsteczkami bizmutu, tytanu, wanadu, żelaza, miedzi, krzemu i glinu wprowadzonymi do „szczepionki” firmy Pfizer.<br>Rysunek 18 przedstawia agregat organiczny (węgiel-tlen-azot) z nanocząsteczkami bizmutu, tytanu, wanadu, żelaza, miedzi, krzemu i glinu wprowadzonych do „szczepionki” firmy Pfizer!</p><p>Nieujawnione składniki „szczepionki” firmy Astrazeneca<br>Rysunki 19 i 20 przedstawiają agregat żelaza, chromu i niklu, znany również jako stal nierdzewna, składający się z mikro i nanocząstek wprowadzonych i zidentyfikowanych w „szczepionce” Astrazeneca, obserwowany pod transmisyjnym mikroskopem elektronowym (TEM) i określany ilościowo za pomocą X mikrosonda promieniowa systemu dyspersji energii, która ujawnia chemiczny charakter obserwowanych mikro i nanocząstek oraz ich morfologię.<br>Rysunek 19 – Wyprodukowane kruszywo z żelaza, chromu i niklu, znane również jako stal nierdzewna.<br>Rysunek 20 przedstawia nanocząstki oznaczone ilościowo w „szczepionce” Astrazeneca przy użyciu mikrosondy rentgenowskiej systemu dyspersji energii, który ujawnia chemiczny charakter obserwowanych mikro i nanocząstek.</p><p>Do oceny adiuwantów „szczepionki” Astrazeneca wykorzystano instrument XRF (X-ray fluorescence), który umożliwił identyfikację następujących cząsteczek: histydyny, sacharozy, glikolu polietylenowego (PEG) i alkoholu etylenowego, również zawartych w Pfizer. i Moderna „szczepionki”. Wyniki tego testu przedstawiono na rysunku 20 [9].<br>Wiadomo, że zarówno PEG, jak i alkohol etylenowy są rakotwórcze i genotoksyczne [9]. PEG był jedynym adiuwantem zadeklarowanym w arkuszu danych wymieniającym składniki „szczepionki” Astrazeneca, ale zawartym w „szczepionkach” Pfizer i Moderna.<br>Figura 21 przedstawia spektrum adiuwantów szczepionek AstraZeneca. Dla czterech cząsteczek zidentyfikowanych na podstawie widm referencyjnych zastosowano różne kolory. Stężenie względne jest obliczane na całkach sygnałów odniesienia dla cząsteczek w widmie ilościowym uzyskanym przy cyklu roboczym 5 sekund. Najdłuższy obliczony czas T1 wynosi 5 sekund.</p><p>Nieujawnione składniki „szczepionki” Janssena<br>Rysunki 22 i 23 przedstawiają agregat organiczno-nieorganiczny zidentyfikowany w „szczepionce” Janssena. Cząsteczki są wykonane ze stali nierdzewnej i są sklejone „klejem węglowym” o zredukowanym tlenku grafenu [10]. Agregat ten jest wysoce magnetyczny i może wywołać patologiczną koagulację krwi oraz „efekt koronowy” lub „efekt białka kolczastego” wywołany degeneracją błony komórkowej w wyniku interakcji z innymi dipolami [10]. Możesz zobaczyć te biologiczne reakcje lub przemiany komórkowe w żywej krwi pod mikroskopem z kontrastem pHazy i mikroskopią ciemnego pola na rycinach 24, 25 i 26 [1] [11].<br>Rysunek 22: Kruszywo ze stali nierdzewnej złożone z węgla, tlenu, żelaza i niklu, utrzymywane przez tlenek grafenu.<br>Rysunek 23 przedstawia pierwiastki węgla, tlenu, żelaza i niklu połączone tlenkiem grafenu.</p><p>Efekt Corona i efekt białka Spike<br>Endogennie wytworzony „efekt korony” i „białko kolców” są spowodowane zatruciem chemicznym i radiologicznym zredukowanym tlenkiem grafenu i promieniowaniem mikrofalowym![11]</p><p>Rysunek 24 „Efekt koronowy” i endogenne tworzenie egzosomów w wyniku chemicznego i radiologicznego zatrucia płynów naczyniowych i śródmiąższowych w śródmiąższu.</p><p>Rysunek 25 pokazuje „efekt korony” i endogenne narodziny szczytów białka S1 spowodowane promieniowaniem i zatruciem chemicznym lub coś, co nazywam „efektem szczytu białka”.</p><p>Ryc. 26 Ta mikrofotografia pokazuje endogenne tworzenie „szczytów białkowych” jako infekcję, a nie infekcję!<br>Ryciny 24 i 25 powyżej przedstawiają „EFEKT CORONA” na czerwonych krwinkach, a Rycina 26 przedstawia „EFEKT BIAŁKA KOLCÓW”, oba spowodowane niewyrównaną kwasicą płynów śródmiąższowych i naczyniowych z trybu kwaśnego życia, a w szczególności z ekspozycji na toksyczne impulsy pola elektromagnetyczne o częstotliwości 2,4 GHz lub wyższej, zatrucia chemiczne z połkniętej żywności i wody, toksyczne kwaśne zanieczyszczenia powietrza, chemtrails i, na dodatek, szczepienie CoV-19 oparte na cząsteczkach Nana obciążonych chemikaliami! Proszę zostaw swoje uczucia i fałszywe przekonania za drzwiami, zanim przedwcześnie zrobisz sobie krzywdę [11]!</p><p>Nieujawnione składniki „szczepionki” Moderna<br>Na rycinach 26 i 27 zidentyfikowano mieszaną jednostkę materiału organicznego i nieorganicznego zawartego w „szczepionce Moderna”.<br>Transmisyjna mikroskopia elektronowa (TMS) i kwantyfikacja przy użyciu mikrosondy rentgenowskiej systemu dyspersji energii (EDS) ujawniły chemiczny charakter obserwowanych mikro- i nanocząstek.<br>„Szczepionka” Moderna jest podłożem z tlenku grafenu o obniżonej zawartości węgla, w który wbudowane są nanocząstki. Te nanocząstki składają się z węgla, azotu, tlenu, glinu, miedzi, żelaza i chloru [12].<br>Rysunek 26 Transmisyjna mikroskopia elektronowa ujawnia kompozyt tlenku grafenu, w którym osadzone są materiały organiczne i nieorganiczne.<br>Rycina 27 pokazuje obecność zintegrowanych nanocząstek cytotoksycznych.</p><p>Figury 27 i 28 przedstawiają analizę, którą również przeprowadzono pod transmisyjnym mikroskopem elektronowym (TEM) i oznaczono ilościowo za pomocą mikrosondy rentgenowskiej systemu dyspersji energii (EDS), i która ujawniła chemiczny charakter obserwowanych mikro i nanocząstek. Zidentyfikowano wiele ciał obcych o kulistej morfologii z kilkoma wgłębieniami w kształcie pęcherzyków.<br>Rysunek 29 pokazuje, że składają się one z węgla, azotu, tlenu, krzemu, ołowiu, kadmu i selenu. Ta kompozycja wysoce toksycznych nanocząstek to kropki kwantowe selenku kadmu, które są cytotoksyczne i genotoksyczne [13] [14].<br>Rysunek 27 pokazuje nanokropki w tlenku grafenu znalezione w „szczepionce Moderna”.<br>Rysunek 28 przedstawia nanokropki w tlenku grafenu znalezione w „szczepionce” Moderna.<br>Rysunek 29 przedstawia skład cytotoksyczny i genotoksyczny nanocząstek tlenku grafenu znalezionych w „szczepionce Moderna”.<br>Rysunki 30 i 31 analizują bardziej szczegółowo „szczepionkę” Moderna i ujawniają 100-mikronowy symplast kompozytu zredukowanego tlenku grafenu. RGO składa się z węgla i tlenu z zanieczyszczeniem nanocząstkami azotu, krzemu, fosforu i chloru [15].<br>Rycina 30 Transmisyjna mikroskopia elektronowa ujawnia duży kompozyt tlenku grafenu zredukowany do 100 mikronów.<br>Rysunek 31 pokazuje kompleks nanocząstek zawartych w „szczepionce” Moderna<br>Rysunki 32 i 33 przedstawiają zredukowane jednostki tlenku grafenu oparte na węglu w „szczepionce Moderna”, zmieszane z agregatami wypełnionymi nanocząstkami krzemianu glinu [16].<br>Rysunek 32 przedstawia kompleks tlenku grafenu i krzemianu glinu uzyskany w transmisyjnej mikroskopii elektronowej.<br>Rysunek 33 przedstawia nanoelementy tlenku grafenu i krzemianu glinu zawarte w „szczepionce” Moderna</p><p>Dyskusja<br>Pandemia SARS-CoVid-2-19 skłoniła przemysł farmaceutyczny do opracowania nowych leków, które nazwali szczepionkami.<br>Mechanizm działania tych nowych leków, jak stwierdził przemysł farmaceutyczny, w połączeniu z tym, co podano w arkuszu danych szczepionki, nie jest jasny dla obecnych naukowców medycznych, którzy rozumieją, że te nowe „leki” produkowane przez firmę Pfizer – szczepionka mRNA BioNTech, Szczepionka mRNA-1273 Moderna-Lonza, szczepionka Serum Institute Oxford Astrazeneca i szczepionka Janssen COVID -19, wyprodukowana przez Janssen Biotech Inc, firmę farmaceutyczną Janssen należącą do Johnson &amp; Johnson, NIE są szczepionkami, ale lekami nanotechnologicznymi, które działają jako terapia genowa.</p><p>Nazwa „szczepionka” jest prawdopodobnie sztuczką wykorzystywaną z powodów biurokratycznych i technokratycznych w celu uzyskania awaryjnego zatwierdzenia, ignorując wszystkie normalne zasady konieczne dla nowych leków, zwłaszcza tych obejmujących nowe mechanizmy nanotechnologiczne, które nigdy nie zostały opracowane ani nigdzie przez człowieka w dowolnym momencie historii świata.</p><p>Wszystkie te tak zwane „szczepionki” są opatentowane, więc ich rzeczywista zawartość jest utrzymywana w tajemnicy, nawet przed nabywcami, którzy oczywiście wykorzystują pieniądze podatników. Tak więc konsumenci (podatnicy) nie mają informacji o tym, co otrzymują w swoim ciele przez zaszczepienie.<br>Ludzkość trzymana jest w niewiedzy, jeśli chodzi o procesy technologiczne zaangażowanych nanocząstek, negatywny wpływ na komórki organizmu, ale przede wszystkim możliwy wpływ nano-bio-oddziaływania magnetotoksycznego, cytotoksycznego i genotoksycznego na krew i komórki Ciało.<br>Obecne badanie, które polega na bezpośredniej analizie wspomnianych wcześniej tak zwanych „szczepionek” przy użyciu narzędzi technologii nanocząsteczkowej, ujawnia niepokojące i potencjalnie zmieniające życie informacje dotyczące prawdy o rzeczywistej toksycznej zawartości kwasów w tych tak zwanych szczepionkach.<br>Leki Pfizer, Moderna, Astrazeneca i Janssen NIE są „szczepionkami”, ale złożonymi agregatami nanocząstek tlenku grafenu złożonych z różnych nanoelementów przyłączonych do genetycznie zmodyfikowanych kwasów nukleinowych mRNA z komórek zwierzęcych lub vero i abortowanych ludzkich komórek płodowych, jak już mamy widziane i opisane powyżej. Po raz kolejny składniki tych tak zwanych szczepionek są silnie magnetotoksyczne, cytotoksyczne i genotoksyczne dla błon komórkowych roślin, owadów, ptaków, zwierząt i ludzi, a także ich genetyki, co już spowodowało poważne wypadki (szacowane na ponad 500 mln) i/lub śmierć (szacowana na ponad 35 mln) [17] [18] do [54].<br>Tak zwani „eksperci” lub „naukowcy medyczni” mówią CI, że szczepionki przeciwko CoV-2-19 są JEDYNYM sposobem na powstrzymanie rozprzestrzeniania się CoV-19… nawet jeśli NIE MA DOWODÓW na jego istnienie i NIE MA DOWODÓW na jego rozprzestrzenianie się jako określone naukową metodą postulatów Kocha lub Riversa! [53]<br>Że są bezpieczni – pomimo udokumentowanych dowodów przeciwnych… [53]<br>Że są skuteczne – nawet jeśli miliony „podwójnie ugryzionych” ludzi zachorują, teoretycznie wystawiają się na NIEISTNIEJĄCY WIRUS o nazwie CoV – 19 i umierają… [54] NIE z powodu infekcji wirusowej, ale ze strachu lub fałszywych dowodów, że wygląda na rzeczywistą i toksyczną kwaśną zawartość zredukowanego tlenku grafenu dostarczanego za pośrednictwem genetycznie zmodyfikowanego mRNA do określonych celów w ludzkim ciele, powodując patologiczne krzepnięcie krwi, brak tlenu, hiperkapnię, niedotlenienie, a następnie śmierć przez uduszenie. [55] [56] [57]<br>Rozsiane wykrzepianie wewnątrznaczyniowe (DIC) lub patologiczne wykrzepianie krwi [56] [57].</p><p>Że MUSISZ otrzymać co najmniej dwa zastrzyki PLUS „dopalacze”, aby żyć „normalnie”…<br>I wkrótce powiedzą ci, że nie masz innego wyboru, jak tylko przestrzegać WSZYSTKICH ICH ZOBOWIĄZAŃ, mimo że CDC i inne rządy, uniwersytety i instytuty medyczne potwierdziły na piśmie, że NIE MAJĄ ŻADNEGO. Teraz nazywany wirusem CoV-19!<br>NIE MA WIRUSA KORONA i NIGDY nie było![55].<br>Pamiętać …<br>NIE POZWÓL NIKOMU ZABRAĆ OD CIEBIE TWOJE ZDROWIE!<br>To TWOJE ciało, TWOJE życie i TWÓJ wybór!<br>Wiedza ta jest ważna. I to jest klucz do zrozumienia, dlaczego eksperymentalne szczepionki przeciwko CoV-19 są tak niebezpieczne – pomimo oficjalnych doniesień medialnych o nakazach tłumienia i cenzurowania każdego, kto ośmieli się wypowiedzieć. Masz kontrolę nad własnym zdrowiem. Nie stań się ofiarą rządów i globalnych biurokratów, którzy popychają wszystkich do zaszczepienia się. Miliarder „filantrop” Bill Gates i miliarderzy aktywiści Big Tech uważają, że wiedzą, co jest najlepsze dla Ciebie i Twojej rodziny.<br>Musisz mieć swobodę decydowania, co jest dla Ciebie odpowiednie. NIE pozwól, aby rządy i pracodawcy zmuszali cię do „szczepienia” „dla własnego dobra”.<br>I nigdy nie pozwól, aby kultura cenzury sprawiła, że za bardzo się boisz bronić swoich praw!<br>Jak powiedział wielki francuski lekarz i naukowiec Antoine Béchamp: „Nie ma nic tak fałszywego, co nie zawiera elementu prawdy, podobnie jest z teorią zarazków”. W tym przypadku teoria wirusów, szczepionek i odporności![58]</p><p>więcej – nouveau-monde.ca/…yde-de-graphene-dans-les-vaccins-contre-le-cov-19/</p><p><a href=\"https://gloria.tv/post/V4nUMLWdVmvY619qbfkcT3x4S\">https://gloria.tv/post/V4nUMLWdVmvY619qbfkcT3x4S</a></p><p><br>&nbsp;</p>",
			"embed_url": "",
			"type": "topic",
			"added": 1631214025521,
			"body_p": "2021.08.28.05.[PL]-Wiedza-SZCZEPIONKA-Dr.Robert Young.[Źródło: Ciel Voilé (cielvoile.fr) ]Dr Robert Young – 20 sierpnia 2021 r.https://www.drrobertyoung.com/post/transmission-electron-mikroskopia-ujawnia-tlenek-grafenu-w-szczepionkach-cov-19Mikroskopia z kontrastem fazowym, transmisyjna i skaningowa mikroskopia elektronowa oraz spektroskopia rentgenowska z dyspersją energii ujawniają składniki szczepionek CoV-19!Obecnie cztery duże firmy farmaceutyczne wytwarzają szczepionkę przeciwko SARS-CoV-2, obecnie nazywaną SARS-CoV-19. Ci producenci i ich szczepionki to szczepionka Pfizer – BioNTech mRNA, szczepionka Moderna-Lonza -1273 mRNA, szczepionka Serum Institute – Oxford Astrazeneca oraz szczepionka Covid-19 Janssen, wyprodukowana przez Janssen Biotech Inc, firmę farmaceutyczną Janssen firmy Johnson &amp; Johnson, rekombinowaną , z niezdolnym do replikacji adenowirusem eksprymujący białko wypustek SARS-CoV-2. Celem tych szczepionek jest nadanie odporności przeciwko nowemu zakaźnemu koronawirusowi lub SARS-CoV-2, obecnie nazywanemu SARS-CoV-19.Te cztery firmy farmaceutyczne nie ujawniły pełnej informacji FDA na swoim pudełku ze szczepionkami, ich arkusze informacyjne lub etykiety dla wielu głównych i / lub drugorzędnych składników tych tak zwanych szczepionek. Celem tego artykułu badawczego jest identyfikacja konkretnych głównych i drugorzędnych składników zawartych w szczepionce Pfizer, szczepionce Moderna, szczepionce Astrazeneca i szczepionce Janssen przy użyciu różnych naukowych testów anatomicznych, fizjologicznych i funkcjonalnych dla każdej szczepionki SARS-VOC.Ponieważ prawa człowieka podlegają prawu międzynarodowemu w Kodeksie Norymberskim z 1947 r., informacje o określonych składnikach szczepionek są niezbędne, wymagane i konieczne, aby każdy człowiek z dowolnego kraju na świecie mógł podjąć świadomą decyzję, czy wyraża zgodę. do zaszczepienia SARS-CoV-2-19.Przeprowadziliśmy badania naukowe na każdej szczepionce i zidentyfikowaliśmy kilka nieujawnionych składników lub adiuwantów zawartych w tych czterech szczepionkach SARS-CoV-2-19. Obecnie szczepionki te są podawane milionom ludzi na całym świecie na podstawie zezwolenia na stosowanie w sytuacjach nadzwyczajnych (EUA) wydawanego przez każdy kraj bez ujawniania wszystkich składników, a w niektórych przypadkach na żądanie rządów lub pracodawców, co stanowi naruszenie praw człowieka zgodnie z Kodeksem Norymberskim z 1947 r.Metodologia i technikiPrzeanalizowano cztery „szczepionki”, a mianowicie szczepionkę Pfizer-BioNtech, Moderna-Lonza mRNA-1273, Vaxzevria firmy Astrazeneca, Janssen firmy Johnson &amp; Johnson, przy użyciu różnych instrumentów i protokołów przygotowania zgodnie z nowymi podejściami technologicznymi do nanocząstek. Różne instrumenty obejmują mikroskopię optyczną, mikroskopię jasnego pola, mikroskopię kontrastową pHazy, mikroskopię ciemnego pola, spektroskopię absorbancji UV i fluorescencyjną, skaningową mikroskopię elektronową, transmisyjną mikroskopię elektronową, spektroskopię dyspersji energii, dyfraktometr rentgenowski i instrumenty magnetycznego rezonansu jądrowego. weryfikacja morfologii i zawartości „szczepionek”. Do zaawansowanych technologicznie pomiarów i opieki dochodzeniowej,wszystkie kontrole zostały aktywowane, a pomiary referencyjne przyjęte w celu uzyskania potwierdzonych wyników.Mikroskopia kontrastu fazowego i ciemnego pola żywej krwiNastępnie uzyskano obrazy wodnych frakcji szczepionek, aby wizualnie ocenić możliwą obecność cząstek węgla lub grafenu.Obserwacje mikroskopii optycznej ujawniły obfitość przezroczystych obiektów laminarnych 2D, które wykazują duże podobieństwo do obrazów z literatury (Xu i in., 2019) oraz do obrazów uzyskanych ze standardu rGO (SIGMA) (ryc. 1, 2 i 3).Uzyskano obrazy dużych przezroczystych arkuszy o różnych rozmiarach i kształtach, ukazujących faliste i płaskie, nieregularne kształty. Mniejsze liście o wielokątnym kształcie, również podobne do płatków opisanych w literaturze (Xu i wsp., 2019) można ujawnić za pomocą mikroskopii kontrastowej pHazy i ciemnego pola (ryc. 3).Wszystkie te laminarne obiekty były szeroko rozpowszechnione w wodnej frakcji próbki krwi (fig. 1) lub szczepionki (fig. 2 i 3) i żaden składnik opisany przez oczekujący patent nie może być powiązany z tymi arkuszami.Rysunek 1, możesz zobaczyć, jak „bomba kasetowa” ze zredukowanym tlenkiem grafenu (rGO) wygląda w żywej, niezabarwionej ludzkiej krwi po zaszczepieniu CoV-19, powodując patologiczne krzepnięcie krwi![1] [2] [55 ] [56] [57]Figura 1 jest mikrografią skupienia węgla zredukowanego tlenku grafenu (rGO) uwidocznionego w żywej, niezabarwionej ludzkiej krwi przy użyciu mikroskopii kontrastowej pHazy przy 1500x. Zauważ, że czerwone krwinki gromadzą się razem wi wokół kryształu rGO w stanie znanym jako Rouleau! Francuskie słowo, które oznacza „usypać”.Jakie są nieujawnione składniki w tak zwanych szczepionkach Pfizer, Moderna, Astrazeneca i Janssen CoV-19?Aby odpowiedzieć na to pytanie, z każdej fiolki pobrano wodną frakcję szczepionek Pfizer, Moderna, Astrazeneca i Janssen, a następnie zbadano ją oddzielnie pod mikroskopem kontrastowym pHazy przy powiększeniu 100x, 600x i 1500x, wykazując anatomiczne oznaki występowania cząstek zredukowanego tlenku grafenu (rGO), które porównano z mikrofotografią rGO z Choucair et al, 2009 w celu identyfikacji i weryfikacji [3].Etapy analizy wodnych frakcji szczepionkiSchłodzone próbki poddano obróbce w sterylnych warunkach, stosując komorę z przepływem laminarnym i sterylny sprzęt laboratoryjny.Etapy analizy są następujące:Rozcieńczenie w sterylnym 0,9% roztworze soli fizjologicznej (0,45 ml + 1,2 ml)Frakcjonowanie polaryzacji: 1,2 ml heksan + 120 µl próbki RD1Ekstrakcja hydrofilowej fazy wodnejSkanowanie absorpcji UV i spektroskopii fluorescencyjnejEkstrakcja i oznaczenie ilościowe RNA w próbceMikroskopia elektronowa i optyczna pHazy wodnej.Nieujawnione składniki „szczepionki” firmy PfizerMikrofotografie z ryc. 2 i 3 uzyskano za pomocą optycznej mikroskopii kontrastowej pHazy 100X, 600X i 1500X, ciemnego pola i jasnego pola [3].Po lewej stronie każdej mikrofotografii zobaczysz mikrofotografie uzyskane z wodnej frakcji szczepionki Pfizer zawierającej rGO.Po prawej stronie każdej mikrofotografii zobaczysz korespondencję ze znanymi źródłami zawierającymi rGO do walidacji anatomicznej.Mikroskopia kontrastowa fazy, ciemne pole, jasne pole, transmisyjna i skaningowa mikroskopia elektronowa, obserwacje szczepionki firmy Pfizer, a także produktów szczepionki firmy Moderna, Astrazeneca i Janssen ujawniły pewne jednostki, które mogą być pasmami grafenu, jak pokazano na rysunku 3 poniżej .Figura 2 przedstawia obraz frakcji wodnej próbki szczepionki Pfizer (po lewej) i standardu zredukowanego tlenku grafenu (rGO) (po prawej) (Sigma-777684). Mikroskopia optyczna, 100XFigura 3 – Obrazy wodnych frakcji zawierających zredukowany tlenek grafenu z próbki szczepionki Pfizer (po lewej) i sonikowany standardowy zredukowany tlenek grafenu (rGO) (po prawej) (Sigma-777684). Mikroskopia optyczna z kontrastem fazowym, 600XRysunek 4 przedstawia kapsyd liposomu zawierającego rGO, który firma Pfizer wykorzystuje w swoim produkcie do przenoszenia tlenku grafenu poprzez przyłączenie kapsydu liposomu do określonych cząsteczek mRNA w celu kierowania zawartości liposomu rGO do narządów, gruczołów i określonych tkanek , a mianowicie jajniki i jądra, szpik kostny, serce i mózg. Obraz uzyskano za pomocą preparatu SEM-Cryo.W celu ostatecznej identyfikacji grafenu za pomocą TEM konieczne jest uzupełnienie obserwacji o charakterystykę strukturalną poprzez uzyskanie charakterystycznej próbki wzorcowej za pomocą dyfrakcji elektronów (jak na rysunku „b” pokazanym poniżej).Standardowa próbka odpowiadająca grafitowi lub grafenowi ma symetrię heksagonalną i ogólnie wykazuje kilka koncentrycznych sześciokątów.Rysunek 4b przedstawia dyfraktogram rentgenowski cząstek grafenu. Ostateczna identyfikacja tlenku grafenu za pomocą mikroskopii TEM w 4 szczepionkach CoV-2-19Za pomocą transmisyjnej mikroskopii elektronowej (TEM) zaobserwowaliśmy złożoną matrycę lub siatkę elastycznych, półprzezroczystych, złożonych arkuszy rGO, z mieszaniną ciemniejszych wielowarstwowych aglomeracji i jaśniejszych niezłożonych monowarstw, jak pokazano na rycinie 5. [3 ]Rysunek 5 przedstawia klaster nanocząstek grafenu w szczepionce firmy Pfizer. Wydają się być zagregowane.Ciemniejsze obszary liniowe na rysunku 5 wydają się być miejscowym nakładaniem się arkuszy i lokalnym układem poszczególnych arkuszy równolegle do wiązki elektronów [4].Po zazębieniu pojawia się duża gęstość niezidentyfikowanych zaokrąglonych i eliptycznych wyraźnych kształtów, prawdopodobnie odpowiadająca otworom generowanym przez mechaniczne wymuszanie siatki rGO podczas przetwarzania, jak widać na rysunku 6. [4]Figura 6 przedstawia obserwację za pomocą mikroskopii TEM, w której cząstki zredukowanego tlenku grafenu znajdują się w szczepionce firmy Pfizer ”. Dyfraktometria rentgenowska ujawnia ich naturę jako krystalicznych nanocząstek rGO opartych na węglu. Spektroskopia rentgenowska z dyspersją energii ujawnia obecność rGO w szczepionce firmy Pfizer [5] [6] [7].Zawartość chemiczną i pierwiastkową frakcji ciekłej szczepionki Pfizer poddano następnie analizie metodą spektroskopii rentgenowskiej z dyspersją energii (EDS), jak pokazano na rysunku 6. Widmo EDS wykazało obecność węgla, tlenu. jak również sód i chlorek, ponieważ próbki na rysunkach 2, 3, 5 i 6 zostały rozcieńczone w soli fizjologicznej.Figura 7 przedstawia widmo EDS „szczepionki” Pfizera pod mikroskopem ESEM sprzężonym z mikrosondą rentgenowską EDS (oś X = KeV, oś Y = zliczenia) identyfikującą węgiel, tlen, sód i chlorki.Ilościowa ocena mRNA w szczepionce PfizerOznaczenie ilościowe RNA w próbce firmy Pfizer przeprowadzono zgodnie z konwencjonalnymi protokołami (Fisher).Zgodnie ze specjalnym oprogramowaniem do weryfikacji kalibracji spektrofotometru NanoDropTM 2000 (Thermofisher), widmo absorpcji UV całej frakcji wodnej skorelowano z 747 ng / µl nieznanych substancji absorbujących.Jednak po ekstrakcji RNA przy użyciu komercyjnego zestawu (Thermofisher), kwantyfikacja przy użyciu sondy fluorescencyjnej Qbit specyficznej dla RNA (Thermofisher) wykazała, że tylko 6t µg / µl można powiązać z obecnością RNA. Widmo było zgodne z pikiem rGO przy 270 nm.Zgodnie z przedstawionymi tutaj obrazami mikroskopowymi, większość tej absorbancji może być spowodowana arkuszami podobnymi do grafenu, obfitymi w płyny zawieszone w próbce.Wnioski te są również poparte silną fluorescencją próbki, z maksimum przy 340 nm, zgodną z wartościami szczytowymi dla rGO. Należy pamiętać, że RNA nie wykazuje spontanicznej fluorescencji pod wpływem promieniowania UV.Figura 8 – Widmo UV frakcji wodnej próbki szczepionki Pfizer. [1] [2] [3] [5] [6]Test fluorescencji ultrafioletowej Pfizera dla zredukowanego tlenku grafenu (rGO) [5]Absorpcję w ultrafiolecie i widma fluorescencyjne otrzymano za pomocą spektrofotometru Cytation 5 Cell Imaging Multi-Mode Reader (BioteK). Widmo absorpcji UV potwierdziło maksymalny pik przy 270 nm, zgodny z obecnością cząstek rGO.Maksymalna fluorescencja UV przy 340 nm również sugeruje obecność znacznych ilości rGO w próbce (Bano i wsp., 2019).Figura 9 – Widma absorpcji UV i fluorescencji uzyskano za pomocą spektrofotometru Cytation 5 Cell Imaging Multi-Mode Reader (BioteK). Widmo absorpcji UV potwierdziło maksymalny pik przy 270 nm, zgodny z obecnością rGO. Maksymalna fluorescencja UV przy 340 nm również sugeruje obecność znacznych ilości rGO w próbce (Bano i wsp., 2019).Rysunek 10 – Analiza spektroskopowa UV wykazała adsorpcję spowodowaną obecnością zredukowanego tlenku grafenu, co potwierdza obserwacja pod widzialnym mikroskopem ultrafioletowym.Rysunki 11 i 12 poniżej przedstawiają mikrografię różnych mikro- i nanocząstek, które zostały zidentyfikowane w szczepionkach Pfizer, Moderna, Astrazeneca i Janssen, znanych jako „szczepionki” i przeanalizowane pod mikroskopem elektronowym (SEM) w połączeniu z mikrosondą rentgenowską systemu dyspersji energii (EDS), który ujawnia wielkość cząstek, rozkład składu oraz chemiczny charakter obserwowanych mikro- i nanocząstek [5] [6] [7].Rysunek 11 przedstawia szczątki o długości 20 mikronów zidentyfikowane w tak zwanej „szczepionce” firmy Pfizer zawierającej węgiel, tlen, chrom, siarkę, glin, chlorek i azot.Rysunek 12 przedstawia cząstkę o długości 20 mikronów zidentyfikowaną w tak zwanej „szczepionce” firmy Pfizer. Składa się z węgla, tlenu, chromu, siarki, glinu, chlorku i azotu.Ryciny 13 i 14 poniżej przedstawiają mikrografię różnych mikro- i nanocząstek, które zostały zidentyfikowane w szczepionkach Pfizer, Moderna, Astrazeneca i Janssen i przeanalizowane za pomocą skaningowego mikroskopu elektronowego (SEM) połączonego z mikrosondą rentgenowską systemu rozpraszania energii ( EDS), który ujawnia wielkość cząstek, rozkład składu i chemiczny charakter obserwowanych mikro i nanocząstek.Czy w „szczepionkach” firmy Pfizer znajdują się pasożyty?Wydłużony korpus o długości 50 mikronów, jak widać na rycinie 13, jest tajemniczą i wyraźną obecnością w szczepionce Pfizera. Pojawia się i jest anatomicznie zidentyfikowany jako pasożyt Trypanosoma cruzi, którego kilka odmian jest śmiertelnych i stanowi jedną z wielu przyczyn zespołu nabytego niedoboru odporności lub AIDS [Atlas of Human Parasitology, wydanie 4, Lawrence Ash i Thomas Orithel, strony 174 do 178] [8].Rycina 13 przedstawia pasożyta Trypanosoma o długości około 20 mikronów, znalezionego w tak zwanej „szczepionce” firmy Pfizer. Składa się z węgla, tlenu, chromu, siarki, glinu, chlorku i azotu.Mikroskopia z kontrastem fazowym: pasożyt Trypanosoma cruzi [8] żyjący we krwiRysunek 14 przedstawia skład nanocząstek zawierających węgiel, tlen, chrom, siarkę, glin, chlorek i azot, które występują również w „szczepionkach” CoV-19.Rysunek 13 przedstawia skład nanocząstekRysunki 15 i 16 poniżej przedstawiają mikrografię różnych mikro- i nanocząstek, które zostały zidentyfikowane i przeanalizowane za pomocą środowiskowego skaningowego mikroskopu elektronowego (SEM) połączonego z mikrosondą rentgenowską systemu dyspersji energii (SDE), która ujawnia chemiczny charakter Obserwowane mikro i nanocząstki oraz ich morfologia.Biała cząsteczka o długości 2 mikronów składa się z bizmutu, węgla, tlenu, aluminium, sodu, miedzi i azotu.Rysunek 15 przedstawia cząstki w skali nano i mikronowej zidentyfikowane w „szczepionce” firmy Pfizer. Biała cząsteczka o długości 2 mikronów składa się z bizmutu, węgla, tlenu, aluminium, sodu, miedzi i azotu.Rysunek 16 pokazuje, że dwumikronowa biała cząsteczka znajdująca się w „szczepionce” firmy Pfizer składa się z bizmutu, węgla, tlenu, glinu, sodu, miedzi i azotu.Rysunki 17 i 18 przedstawiają identyfikację organicznych cząstek węgla, tlenu i azotu z agregatem osadzonych nanocząstek zawierających bizmut, tytan, wanad, żelazo, miedź, krzem i aluminium, z których wszystkie zostały znalezione w tak zwanej „szczepionce Pfizera”. ”.Rysunek 17 przedstawia agregat organiczny (węgiel-tlen-azot) z nanocząsteczkami bizmutu, tytanu, wanadu, żelaza, miedzi, krzemu i glinu wprowadzonymi do „szczepionki” firmy Pfizer.Rysunek 18 przedstawia agregat organiczny (węgiel-tlen-azot) z nanocząsteczkami bizmutu, tytanu, wanadu, żelaza, miedzi, krzemu i glinu wprowadzonych do „szczepionki” firmy Pfizer!Nieujawnione składniki „szczepionki” firmy AstrazenecaRysunki 19 i 20 przedstawiają agregat żelaza, chromu i niklu, znany również jako stal nierdzewna, składający się z mikro i nanocząstek wprowadzonych i zidentyfikowanych w „szczepionce” Astrazeneca, obserwowany pod transmisyjnym mikroskopem elektronowym (TEM) i określany ilościowo za pomocą X mikrosonda promieniowa systemu dyspersji energii, która ujawnia chemiczny charakter obserwowanych mikro i nanocząstek oraz ich morfologię.Rysunek 19 – Wyprodukowane kruszywo z żelaza, chromu i niklu, znane również jako stal nierdzewna.Rysunek 20 przedstawia nanocząstki oznaczone ilościowo w „szczepionce” Astrazeneca przy użyciu mikrosondy rentgenowskiej systemu dyspersji energii, który ujawnia chemiczny charakter obserwowanych mikro i nanocząstek.Do oceny adiuwantów „szczepionki” Astrazeneca wykorzystano instrument XRF (X-ray fluorescence), który umożliwił identyfikację następujących cząsteczek: histydyny, sacharozy, glikolu polietylenowego (PEG) i alkoholu etylenowego, również zawartych w Pfizer. i Moderna „szczepionki”. Wyniki tego testu przedstawiono na rysunku 20 [9].Wiadomo, że zarówno PEG, jak i alkohol etylenowy są rakotwórcze i genotoksyczne [9]. PEG był jedynym adiuwantem zadeklarowanym w arkuszu danych wymieniającym składniki „szczepionki” Astrazeneca, ale zawartym w „szczepionkach” Pfizer i Moderna.Figura 21 przedstawia spektrum adiuwantów szczepionek AstraZeneca. Dla czterech cząsteczek zidentyfikowanych na podstawie widm referencyjnych zastosowano różne kolory. Stężenie względne jest obliczane na całkach sygnałów odniesienia dla cząsteczek w widmie ilościowym uzyskanym przy cyklu roboczym 5 sekund. Najdłuższy obliczony czas T1 wynosi 5 sekund.Nieujawnione składniki „szczepionki” JanssenaRysunki 22 i 23 przedstawiają agregat organiczno-nieorganiczny zidentyfikowany w „szczepionce” Janssena. Cząsteczki są wykonane ze stali nierdzewnej i są sklejone „klejem węglowym” o zredukowanym tlenku grafenu [10]. Agregat ten jest wysoce magnetyczny i może wywołać patologiczną koagulację krwi oraz „efekt koronowy” lub „efekt białka kolczastego” wywołany degeneracją błony komórkowej w wyniku interakcji z innymi dipolami [10]. Możesz zobaczyć te biologiczne reakcje lub przemiany komórkowe w żywej krwi pod mikroskopem z kontrastem pHazy i mikroskopią ciemnego pola na rycinach 24, 25 i 26 [1] [11].Rysunek 22: Kruszywo ze stali nierdzewnej złożone z węgla, tlenu, żelaza i niklu, utrzymywane przez tlenek grafenu.Rysunek 23 przedstawia pierwiastki węgla, tlenu, żelaza i niklu połączone tlenkiem grafenu.Efekt Corona i efekt białka SpikeEndogennie wytworzony „efekt korony” i „białko kolców” są spowodowane zatruciem chemicznym i radiologicznym zredukowanym tlenkiem grafenu i promieniowaniem mikrofalowym![11]Rysunek 24 „Efekt koronowy” i endogenne tworzenie egzosomów w wyniku chemicznego i radiologicznego zatrucia płynów naczyniowych i śródmiąższowych w śródmiąższu.Rysunek 25 pokazuje „efekt korony” i endogenne narodziny szczytów białka S1 spowodowane promieniowaniem i zatruciem chemicznym lub coś, co nazywam „efektem szczytu białka”.Ryc. 26 Ta mikrofotografia pokazuje endogenne tworzenie „szczytów białkowych” jako infekcję, a nie infekcję!Ryciny 24 i 25 powyżej przedstawiają „EFEKT CORONA” na czerwonych krwinkach, a Rycina 26 przedstawia „EFEKT BIAŁKA KOLCÓW”, oba spowodowane niewyrównaną kwasicą płynów śródmiąższowych i naczyniowych z trybu kwaśnego życia, a w szczególności z ekspozycji na toksyczne impulsy pola elektromagnetyczne o częstotliwości 2,4 GHz lub wyższej, zatrucia chemiczne z połkniętej żywności i wody, toksyczne kwaśne zanieczyszczenia powietrza, chemtrails i, na dodatek, szczepienie CoV-19 oparte na cząsteczkach Nana obciążonych chemikaliami! Proszę zostaw swoje uczucia i fałszywe przekonania za drzwiami, zanim przedwcześnie zrobisz sobie krzywdę [11]!Nieujawnione składniki „szczepionki” ModernaNa rycinach 26 i 27 zidentyfikowano mieszaną jednostkę materiału organicznego i nieorganicznego zawartego w „szczepionce Moderna”.Transmisyjna mikroskopia elektronowa (TMS) i kwantyfikacja przy użyciu mikrosondy rentgenowskiej systemu dyspersji energii (EDS) ujawniły chemiczny charakter obserwowanych mikro- i nanocząstek.„Szczepionka” Moderna jest podłożem z tlenku grafenu o obniżonej zawartości węgla, w który wbudowane są nanocząstki. Te nanocząstki składają się z węgla, azotu, tlenu, glinu, miedzi, żelaza i chloru [12].Rysunek 26 Transmisyjna mikroskopia elektronowa ujawnia kompozyt tlenku grafenu, w którym osadzone są materiały organiczne i nieorganiczne.Rycina 27 pokazuje obecność zintegrowanych nanocząstek cytotoksycznych.Figury 27 i 28 przedstawiają analizę, którą również przeprowadzono pod transmisyjnym mikroskopem elektronowym (TEM) i oznaczono ilościowo za pomocą mikrosondy rentgenowskiej systemu dyspersji energii (EDS), i która ujawniła chemiczny charakter obserwowanych mikro i nanocząstek. Zidentyfikowano wiele ciał obcych o kulistej morfologii z kilkoma wgłębieniami w kształcie pęcherzyków.Rysunek 29 pokazuje, że składają się one z węgla, azotu, tlenu, krzemu, ołowiu, kadmu i selenu. Ta kompozycja wysoce toksycznych nanocząstek to kropki kwantowe selenku kadmu, które są cytotoksyczne i genotoksyczne [13] [14].Rysunek 27 pokazuje nanokropki w tlenku grafenu znalezione w „szczepionce Moderna”.Rysunek 28 przedstawia nanokropki w tlenku grafenu znalezione w „szczepionce” Moderna.Rysunek 29 przedstawia skład cytotoksyczny i genotoksyczny nanocząstek tlenku grafenu znalezionych w „szczepionce Moderna”.Rysunki 30 i 31 analizują bardziej szczegółowo „szczepionkę” Moderna i ujawniają 100-mikronowy symplast kompozytu zredukowanego tlenku grafenu. RGO składa się z węgla i tlenu z zanieczyszczeniem nanocząstkami azotu, krzemu, fosforu i chloru [15].Rycina 30 Transmisyjna mikroskopia elektronowa ujawnia duży kompozyt tlenku grafenu zredukowany do 100 mikronów.Rysunek 31 pokazuje kompleks nanocząstek zawartych w „szczepionce” ModernaRysunki 32 i 33 przedstawiają zredukowane jednostki tlenku grafenu oparte na węglu w „szczepionce Moderna”, zmieszane z agregatami wypełnionymi nanocząstkami krzemianu glinu [16].Rysunek 32 przedstawia kompleks tlenku grafenu i krzemianu glinu uzyskany w transmisyjnej mikroskopii elektronowej.Rysunek 33 przedstawia nanoelementy tlenku grafenu i krzemianu glinu zawarte w „szczepionce” ModernaDyskusjaPandemia SARS-CoVid-2-19 skłoniła przemysł farmaceutyczny do opracowania nowych leków, które nazwali szczepionkami.Mechanizm działania tych nowych leków, jak stwierdził przemysł farmaceutyczny, w połączeniu z tym, co podano w arkuszu danych szczepionki, nie jest jasny dla obecnych naukowców medycznych, którzy rozumieją, że te nowe „leki” produkowane przez firmę Pfizer – szczepionka mRNA BioNTech, Szczepionka mRNA-1273 Moderna-Lonza, szczepionka Serum Institute Oxford Astrazeneca i szczepionka Janssen COVID -19, wyprodukowana przez Janssen Biotech Inc, firmę farmaceutyczną Janssen należącą do Johnson &amp; Johnson, NIE są szczepionkami, ale lekami nanotechnologicznymi, które działają jako terapia genowa.Nazwa „szczepionka” jest prawdopodobnie sztuczką wykorzystywaną z powodów biurokratycznych i technokratycznych w celu uzyskania awaryjnego zatwierdzenia, ignorując wszystkie normalne zasady konieczne dla nowych leków, zwłaszcza tych obejmujących nowe mechanizmy nanotechnologiczne, które nigdy nie zostały opracowane ani nigdzie przez człowieka w dowolnym momencie historii świata.Wszystkie te tak zwane „szczepionki” są opatentowane, więc ich rzeczywista zawartość jest utrzymywana w tajemnicy, nawet przed nabywcami, którzy oczywiście wykorzystują pieniądze podatników. Tak więc konsumenci (podatnicy) nie mają informacji o tym, co otrzymują w swoim ciele przez zaszczepienie.Ludzkość trzymana jest w niewiedzy, jeśli chodzi o procesy technologiczne zaangażowanych nanocząstek, negatywny wpływ na komórki organizmu, ale przede wszystkim możliwy wpływ nano-bio-oddziaływania magnetotoksycznego, cytotoksycznego i genotoksycznego na krew i komórki Ciało.Obecne badanie, które polega na bezpośredniej analizie wspomnianych wcześniej tak zwanych „szczepionek” przy użyciu narzędzi technologii nanocząsteczkowej, ujawnia niepokojące i potencjalnie zmieniające życie informacje dotyczące prawdy o rzeczywistej toksycznej zawartości kwasów w tych tak zwanych szczepionkach.Leki Pfizer, Moderna, Astrazeneca i Janssen NIE są „szczepionkami”, ale złożonymi agregatami nanocząstek tlenku grafenu złożonych z różnych nanoelementów przyłączonych do genetycznie zmodyfikowanych kwasów nukleinowych mRNA z komórek zwierzęcych lub vero i abortowanych ludzkich komórek płodowych, jak już mamy widziane i opisane powyżej. Po raz kolejny składniki tych tak zwanych szczepionek są silnie magnetotoksyczne, cytotoksyczne i genotoksyczne dla błon komórkowych roślin, owadów, ptaków, zwierząt i ludzi, a także ich genetyki, co już spowodowało poważne wypadki (szacowane na ponad 500 mln) i/lub śmierć (szacowana na ponad 35 mln) [17] [18] do [54].Tak zwani „eksperci” lub „naukowcy medyczni” mówią CI, że szczepionki przeciwko CoV-2-19 są JEDYNYM sposobem na powstrzymanie rozprzestrzeniania się CoV-19… nawet jeśli NIE MA DOWODÓW na jego istnienie i NIE MA DOWODÓW na jego rozprzestrzenianie się jako określone naukową metodą postulatów Kocha lub Riversa! [53]Że są bezpieczni – pomimo udokumentowanych dowodów przeciwnych… [53]Że są skuteczne – nawet jeśli miliony „podwójnie ugryzionych” ludzi zachorują, teoretycznie wystawiają się na NIEISTNIEJĄCY WIRUS o nazwie CoV – 19 i umierają… [54] NIE z powodu infekcji wirusowej, ale ze strachu lub fałszywych dowodów, że wygląda na rzeczywistą i toksyczną kwaśną zawartość zredukowanego tlenku grafenu dostarczanego za pośrednictwem genetycznie zmodyfikowanego mRNA do określonych celów w ludzkim ciele, powodując patologiczne krzepnięcie krwi, brak tlenu, hiperkapnię, niedotlenienie, a następnie śmierć przez uduszenie. [55] [56] [57]Rozsiane wykrzepianie wewnątrznaczyniowe (DIC) lub patologiczne wykrzepianie krwi [56] [57].Że MUSISZ otrzymać co najmniej dwa zastrzyki PLUS „dopalacze”, aby żyć „normalnie”…I wkrótce powiedzą ci, że nie masz innego wyboru, jak tylko przestrzegać WSZYSTKICH ICH ZOBOWIĄZAŃ, mimo że CDC i inne rządy, uniwersytety i instytuty medyczne potwierdziły na piśmie, że NIE MAJĄ ŻADNEGO. Teraz nazywany wirusem CoV-19!NIE MA WIRUSA KORONA i NIGDY nie było![55].Pamiętać …NIE POZWÓL NIKOMU ZABRAĆ OD CIEBIE TWOJE ZDROWIE!To TWOJE ciało, TWOJE życie i TWÓJ wybór!Wiedza ta jest ważna. I to jest klucz do zrozumienia, dlaczego eksperymentalne szczepionki przeciwko CoV-19 są tak niebezpieczne – pomimo oficjalnych doniesień medialnych o nakazach tłumienia i cenzurowania każdego, kto ośmieli się wypowiedzieć. Masz kontrolę nad własnym zdrowiem. Nie stań się ofiarą rządów i globalnych biurokratów, którzy popychają wszystkich do zaszczepienia się. Miliarder „filantrop” Bill Gates i miliarderzy aktywiści Big Tech uważają, że wiedzą, co jest najlepsze dla Ciebie i Twojej rodziny.Musisz mieć swobodę decydowania, co jest dla Ciebie odpowiednie. NIE pozwól, aby rządy i pracodawcy zmuszali cię do „szczepienia” „dla własnego dobra”.I nigdy nie pozwól, aby kultura cenzury sprawiła, że za bardzo się boisz bronić swoich praw!Jak powiedział wielki francuski lekarz i naukowiec Antoine Béchamp: „Nie ma nic tak fałszywego, co nie zawiera elementu prawdy, podobnie jest z teorią zarazków”. W tym przypadku teoria wirusów, szczepionek i odporności![58]więcej – nouveau-monde.ca/…yde-de-graphene-dans-les-vaccins-contre-le-cov-19/https://gloria.tv/post/V4nUMLWdVmvY619qbfkcT3x4S&nbsp;"
		}
	],
	"next_topic_id": 2
}