{
	"title": "espectalll's blanket",
	"description": "An original blog by a baka neko",
	"links": "- [My main website](/espectalll.bit)\n- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1475513046,
	"post": [
		{
			"post_id": 6,
			"title": "A new (boring) post, just in case",
			"date_published": 1475512790.907,
			"body": "So, I just restored my ZeroNet data, since I formatted my computer with Chromium OS and left all behind but a few bunch of zeros and ones. And it seems I'm having trouble with my private keys. So I'm doing this \"useless\" post as a means of checking if everything is actually OK or if I just broke my blog. So please, enjoy. Absolutely nothing but this new, lifeless post."
		},
		{
			"post_id": 5,
			"title": "ZeroNet, la red que me ha cambiado (un poco) la vida",
			"date_published": 1474230352.8,
			"body": "_Note for those of you who only understand English: yes, this one article is written on its entirety in Spanish, because I feel like it will be the most useful for those who speak my mother tongue. There's a ton of resources about ZeroNet in English, not so much in other languages. And that's a shame._\n\nEste reluciente y recién estrenado blog, nuevo hogar para mi libre expresión, está asentado en una plataforma llamada ZeroNet. OK, bonita nimiedad, puede pensar el lector. O quizás haya oído alguna vez tal término mencionado, o puede que incluso ya esté medio al tanto pero quiera indagar más al respecto. Para los que entran en estos tres perfiles, este artículo está indicado para ellos.\n\n## ¿Qué es ZeroNet?\n\nPermitidme que os explique, mis pupilos felinos. Internet es este ente que nos proporciona tantas y tantas horas de vídeos, mensajitos y búsquedas en Stack Overflow de las que tanto disfrute extraemos. Todo bien hasta ahí. Pero son bien conocidas las revelaciones traídas por aquél año 2012, que han cambiado la percepción que tenemos de esta gigantesca red de redes. En vistas a la dependencia que la sociedad tiene de este medio de transmisión, y en deseo de solventar sus defectos, nació en el (sorprendentemente reciente) 2015 un proyecto que se disponía a proteger y reforzar los principios bajo los que Internet surgió y prosperó, como las libertades de expresión y de compartir, diseño abierto, descentralización y ausencia de terceras partes entrometidas; para así ayudar a desatar la catálisis del mundo que está por venir. Tal proyecto se encarga, pues, de ofrecer una estructura garante de la privacidad y reforzada contra la censura, así como accesible para todo el que desee usarla.\n\nObviamente, tal proyecto es ZeroNet.\n\n_TL;DR: ZeroNet es un proyecto de software libre con el objetivo de crear un Internet distribuído capaz de proteger a sus usuarios de censura, manipulación y rastreo involuntario._ \n\n¿Un poco más curioso? Bien, bien. Si digo además que posee ya utilidades como correo, foros, muros tipo 4chan y redes sociales; que éstas permiten identificarte de forma más segura que las contraseñas sin más que un clic; que hace muy fácil y barato montar una web completa con todo incluído; y que encima es tan sencillo de usar como una web cualquiera (**¡estás dentro ahora mismo!**), probablemente ya te tenga en el anzuelo. Si es así, no hay vuelta atrás; ¡bienvenido a ZeroNet!\n\n## Al ajo\n\nPara empezar, por si el texto en negrita envuelto en exclamaciones no lo dejó claro, esta web está funcionando dentro de ZeroNet. ¿Cómo puede ser esto? Básicamente, porque estás usando un \"proxy web\" (o al menos eso asumo).\n\nZeroNet requiere descargar un software que se encarga de hacer que un ordenador se pueda conectar a la red y ver las páginas que contiene. Lo normal para un usuario asíduo es tener su propia copia configurada, ya que ofrece mayor control y hace la red más fuerte. No obstante, también se puede instalar el programa en un servidor que haga de \"proxy\", de puente, que dé acceso quienes hasta ahora eran ajenos a este mundo. Así pues, ahora estás usando una versión completa del software de ZeroNet, con el principal inconveniente de que es un servicio que te están ofreciendo (por ejemplo, a través de [bit.no.com](https://bit.no.com:43110)), en lugar de ser algo que tienes en mano. No es la forma ideal de entrar, pero suficiente para empezar a aprender.\n\nAhora observa ese círculo con un 0 que hay arriba a la derecha. No, no es parte de *mi* web, sino que lo ha puesto el software de ZeroNet. Púlsalo, y aparecerás en el portal de inicio, más conocido con el apodo de ZeroHello.\n\n![](img/5/1.jpg)\n\nEchemos un vistazo por encima. Arriba, nos indica la versión que estamos usando, nuestro usuario en el proxy, unos stats sobre el puerto 15441 y Tor  (no hace falta saber nada al respecto por ahora), y el 0 tan majo de antes. En el centro, un mensaje de bienvenida que, ojo, nos destaca que el sitio está siendo actualmente _servido_ por varios miles de _peers_. Pero, ¿qué quiere decir esto?\n\nLa tecnología de ZeroNet se centra en dos elementos principales: la autorización vía BIP32 (la misma tecnología que usa Bitcoin para sus monederos), y la transmisión de páginas vía BitTorrent. Sí, ZeroNet trabaja con torrents bajo el capó; cada web que visitas es descargada de otros peers, y a su vez al obtenerla te conviertes en una semilla (no, tranquilo, no en una orgánica) y empiezas a compartirla con otros usuarios; gracias a esto, es posible tener tantas copias de una web que es de complejísima dificultad hacerlas desaparecer a todas. A su vez, cada página nueva se añade al panel lateral izquierdo, junto a la última fecha en que hubieron cambios y la cantidad de peers que la están compartiendo; así pueden ser accedidas de inmediato, sin tener que recordar la dirección original. Eso sí; si no has visitado la página antes, ni el proxy la tiene listada, basta con añadir la dirección como si fuera una carpeta dentro del servidor de ZeroNet, tal que `https://bit.no.com:43110/espectalll.bit` para ir a `espectalll.bit` desde  `bit.no.com`.\n\nCon esto ya has aprendido lo más básico de ZeroNet, ¡ya estás listo! Pero vamos a destacar un par de características más. La primera es la identificación con ZeroID. Selecciona la página desde ZeroHello o dirígete a [zeroid.bit](/zeroid.bit). Ahí podrás meter el nickname que desees, hacer clic y listo. Tienes ahora un usuario con el que puedes iniciar sesión desde cualquier web, con sólo un clic, nada de contraseñas, aunque seguro gracias a las claves BIP32. Pero ojo, **no hagas esto desde un proxy**; pues no podrás aprovechar este usuario fuera del mismo. Si tienes ZeroNet instalado en tu ordenador, el archivo `data/users.json` contiene todo lo que necesitas para pasar tu perfil a otra parte.\n\nSi te has hecho ya una cuenta, podrías estrenarla comentando en este post qué te ha parecido la lectura ;3\n\n_(o no, tampoco te estoy obligando a punta de pistola, pero tampoco es mala opción, ¿que no?)_\n\nLa segunda es una funcionalidad que ofrecen algunas páginas, a medio caballo entre los clásicos RSS y las notificaciones modernas, llamada \"newsfeed\"; esto es, \"hilo de noticias\" en cristiano. Básicamente, puedes suscribirte a una página o subpágina (como a una web de ZeroBlog, un usuario de ZeroMe o un hilo de ZeroTalk) mediante un botón, normalmente llamado \"Follow in Newsfeed\". A partir de ahora, el mensaje de bienvenida en ZeroHello será sustituido por las últimas notificaciones, tal que así:\n\n![](img/5/2.jpg)\n\nTambién podrías probar las notificaciones suscribiéndote a mi blog... o no... pero porfi plis, sí... :<\n\nPor último, quizás te haya encantado esto, pero no sepas qué hacer aquí. Sugiero que comienzes explorando. Prueba webs que te sugiera el panel lateral, ve viendo qué cosas hay intetesantes, pregunta a amigos si se han metido... no debería ser difícil encontrar alguna actividad a realizar. Aunque tampoco hay que usar esto por usar. Pero si se puede usar en lugar del Internet \"per sé\", mejor.\n\n## En resumidas cuentas\n\nLo que aquí tenemos en mano es una potencial herramienta para asegurarnos la libertad en Internet. Una que, con suerte, estarás disfrutando ahora mismo tal y como lo estoy haciendo yo. No estamos más que tocando la superficie de ZeroNet, pero ya es fácil percibir las oportunidades que nos trae este invento. Como amante de la libertad que soy, al menos yo no puedo evitarlo. Quizás ahora mismo esté algo falto, mas es tentador ser un \"early adopter\" y ver cómo evoluciona la red. Quién sabe de qué forma pensaremos de ZeroNet en el futuro; ojalá la consideremos como el agradable hogar del ciudadano del mundo, ese lugar en el que quedarse todo el día enriqueciéndose de conocimiento, pasando el rato, y en general trabajando para ir poco a poco adelante. A ver qué tal nos sale; por ahora, soñemos.\n\nBueno, ¿qué tal la experienca? ¿Os ha sido el artículo de interés; os ha cambiado (un poco) la vida ZeroNet? Si es así, como dijo Rubén Doblas Gundersen:\n\n> Su, su, suscríbeteee, y dalealáik si quieres, su su sucríbeteee, y dalealái si quieres, ni ni no niii, no ni no ni no ni no\n\n...sí, lo sé; por usar tal referencia no es sólo ya que no me lo merezca, sino que he de ser perseguido por cuantas Santas Inquisiciones sea posible. Bueno, esto es ZeroNet, puedo decir lo que me plazca y lo haré de la forma que me plazca, aunque ello me cuesta la vida misma. Deal with it.\n\nDe todas formas, agradecería también feedback en si os interesaría saber un poco más al respecto; por ejemplo, para crear vuestras propias páginas web; a lo mejor algo en concreto como un blog, o para saber cómo programar una web app (aviso, ¡no hay tal cosa como código server-side!). En tal caso, estoy dispuesto a ayudaros, vía post, comentarios, correo, etc.\n\nGracias por leer. Nos vemos :3"
		},
		{
			"post_id": 4,
			"title": "Well, here's new content (which also just seems to happen to be the true introductory post)",
			"date_published": 1473927000.4,
			"body": "Welcome everybody! Here's my final return to the web log media, after _almost a year of any post at all_ on my Wordpress page. You can easily tell I've been busy/lazy/forgetful this time along, and that's mainly due to my \"addiction\" to [Twitter](https://twitter.com/espectalll) and [GNU Social](https://quitter.se/espectalll). And you know, those two are fine. They do their job pretty well. But there's a point where your thoughts aren't correctly displayed 140 characters at a time, which is the point where most of people will ignore, if even able to reach, these thoughts. Which has given me the urge to get back to writing, only increased by my sweet, *sweet* discovery that is Zeronet _(seriously, give at least these guys a Nobel, if Satoshi Nakamoto can't)_. So, here I am, switching back to the \"traditional\" way of expressing yourself.\n\nSe siente extraño, en verdad. Es como volver a un hogar del que con indiferencia te fuiste hace mucho, quedándose abandonado y podrido en su mísera inutilidad, pero acabaste retornando sin más opción que reconstruirlo y hacerlo tu nuevo viejo hogar. Hay resquicios de añoranza, mas es un punto nuevo de partida en realidad. Olvido el pasado, tan bello como en ocasiones turbio; borrón de página para volver al principio. Esta vez, eso sí, sin opiniones subjetivas sobre kernels. Que tampoco estamos para cometer los mismos errores varias veces, ¡leches!\n\nOh, BTW. I express my deeper thoughts in Spanish, or whichever language of choice I'm fancy with. It'd be pointless to express feelings and such if I do it in a language that I don't feel fully comfortable with, and Spanish is a rather good one, with a really vast vocabulary and good enough musicality. I'm aware of certain people thinking of it as a ghetto language, something only criminals use. And they're possibly right - after all, under our mother tongue many of the greatest thieves and tyrants have been raised. But by using it I hope, at least, to recover a little bit its reputation and show it up as what it is. Also, I'm getting off the track. Perdón.\n\nSo yeah, bilingual or even multilingual (日本語は素晴らしいですね！) blog. At the very least, it'll probably make up as an acceptable way to learn languages while filling your brains with severely strange thoughts from an anthropomorphic cat. You know, some FOSS and programming tutorials, mostly. Which may seem to you like everything I said about expressing myself and such is pointless - but oh, so wrong!\n\nEspero que vuestra estancia sea de sumo agrado. Partimos, pues."
		},
		{
			"post_id": 3,
			"title": "Heya!",
			"date_published": 1473886653.6,
			"body": "*Expect new content here soon :3*"
		}
	]
}