{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1603504012,
			"title": "Is there a dedicated seeder I can run?",
			"body": "I find that in my country, ZeroNet is incredibly slow. this is probably because I am far from any seeders/peers with data I don't already have loaded. I have a Raspberry Pi and a few hard drives just laying around that I'd happily use as a sort of server that had all of ZeroNet stored locally if there was a way to do that, providing it didn't require too much work. Especially if it was just a daemon I could leave running. Any ideas?",
			"added": 1603504011
		}
	],
	"topic_vote": {
		"1555383590_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": 1,
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1555920851_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1549032910_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1561670029_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1603504012_1CNbp1ekMfWRzS6QeEYMoD9UxHgmnwznb9": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1557049303_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 1,
				"body": "Done. Now what?",
				"added": 1557131642
			}
		],
		"1603504012_1CNbp1ekMfWRzS6QeEYMoD9UxHgmnwznb9": [
			{
				"comment_id": 2,
				"body": "> [mg0](#comment_368_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): you just have to enter a zite to download it, and then pull the zeronet sidebar at said site and enable \"HELP DISTRIBUTE ADDED OPTIONAL FILES\" and then push the button \"Download previous files\". It should start downloading all files of said site but it doesn't always finish at the first (and if your network is slow it won't for sure) so you might have to press that last button every now and then but that's it.\n\nThat functionality sounds a lot like what I'm looking for, in terms of increasing my own browsing speed, but I'm hoping to find something similar that is automated, headless, and for as many sites as possible. \n\nBasically I want to use my spare hardware to increase the speed of ZeroNet throughout my area not just for my own benefit. Because my Raspberry Pi is headless, navigating to the sites to press the button is a no-go.",
				"added": 1603507340
			}
		]
	},
	"comment_vote": {
		"47_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"26_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"3_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH": 1,
		"2602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1CmpxjAvSywDQAbD6bu3GBYioHzmSokF8K": 1
	}
}