{
	"next_topic_id": 28,
	"topic": [
		{
			"topic_id": 2,
			"title": "Децентрализованный резолвер доменов",
			"body": "Приглашаю к обсуждению инициативы по реализации распределённого резолвера имён средствами самой ZN, без использования Namecoin, а также распределённой системы рассчёта рейтинга доверия:\nhttp://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:13",
			"added": 1518615814
		},
		{
			"topic_id": 3,
			"title": "Социальная сеть в ZeroNet — как должна быть устроена",
			"body": "Предлагаю обсудить [идею, изложенную по ссылке](http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/?Topic:1522504967_1GooUE19488nDwG3TdkM8seYAHct4gjkq4). У меня место почти закончилось тут, так что отвечать не могу. Приглашаю к обсуждению на том форуме.",
			"added": 1522505105
		},
		{
			"topic_id": 4,
			"title": "ZeroNet.Ru — FAQ и каталог русскоязычных сайтов в ZeroNet",
			"body": "Сегодня у меня наконец-то дошли руки обновить содержание сайта, в связи с чем создам эту тему.\n\nВ 1-й половине 2018-го я сделал сайт, задача которого — служить точкой входа и базой знаний для русскоязычных пользователей, кто только начинает свой путь по сети:\n\n* [ZeroNet.Ru — по-русски о ZeroNet](http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/)\n* [Talks@ZeroNet.Ru — форум проекта](http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/)\n\nЯ не стал использовать ZeroWiki, поскольку боялся, что она слишком уязвима к замусориванию всякими спамерами. И до сих пор этого боюсь. Я решил сделать подконтрольный только одному человеку ресурс. Пусть он когда-то станет устаревшим, но зато пока я его поддерживаю, на нём не будет мусора.\n\nПо [ленте обновлений](http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/?Topic:1522577864_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/) видно, насколько количественно разрослась русскоязычная часть ZeroNet за это время. Но к сожалению, не качественно — новые люди приходят, но старые пропадают. Так что хотя число сайтов увеличивается, общая активность почти не растёт. Но я верю, что у ZeroNet еще всё впереди.\n\nНапишите, что еще, по вашему мнению, нужно улучшить на сайте, какие темы раскрыть в статьях, какие ссылки добавить в каталог.",
			"added": 1548867317
		},
		{
			"topic_id": 5,
			"title": "Пилю форк форумного движка",
			"body": "Тестировать и ловить баги можно здесь: http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/",
			"added": 1549389206
		},
		{
			"topic_id": 6,
			"title": "Что за драма была с Krixano?",
			"body": "Почему он свои сайты удалил?",
			"added": 1561352701
		},
		{
			"topic_id": 7,
			"title": "ВАЖНО: О подделываемости данных в ZeroNet",
			"body": "*Предупреждение для новых пользователей или для тех, кто просто не в курсе:*\n\n### Владелец зайта имеет полный контроль над данными, включая ваши лайки, комментарии, темы на форумах и т.п.\n\nКогда мы говорим, что в ZeroNet невозможна централизованная цензура, это касается **только** зайтов, которыми вы **владеете лично**. Никто не может заблокировать ваш зайт для остальной сети, никто не может подменить на нём содержимое, удалить что-то или добавить что-то, чего вы не писали. Всё так.\n\nНо когда вы пишете, например, на этом форуме, все данные принадлежат в конечном счёте не вам, а владельцу форума.\n\nЭто же касается и любых других подобных зайтов: ваш профиль в ZeroMe принадлежит не вам; файлы, которые вы заливаете в ZeroUp или на KopyKate принадлежат не вам; ваши комментарии в чужих блогах принадлежат не вам.\n\nВладелец может править, удалять, добавлять любой контент от имени любого участника форума или даже от имени тех, кто на этот форум вообще никогда не заходил. Полномочия админа такие же абсолютные как и на сайтах clearnet, и даже больше: здесь мы используем одинаковые учетки для всех зайтов, и следовательно, ваше имя (учётка) может использоваться против вас.\n\nПоэтому если вам нужно разместить что-то действительно важное, делайте это на своих собственных зайтах. Тем более, что клонировать зайт такой как ZeroBlog, ZeroTalk, ZeroUp возможно двумя щелчками мыши, и вы получите копию, подконтрольную только вам.",
			"added": 1561460383
		},
		{
			"topic_id": 8,
			"title": "«Демократия» в интернете, или как бесплатно поработать на капиталиста и остаться с носом",
			"body": "На Хабре появилась такая статья: [«Stack Overflow на русском: инструкция по убийству сообщества»](https://habr.com/ru/post/457714/).\n\nХочу обратить внимание вот на что:\n\n1. Демократия — это процесс, в котором равные участники реализуют свои права. Когда вы приходите на ресурс, контролируемый коммерческой компанией в надежде, что вам устроят там демократию — вы лоханулись с самого начала. Капиталист во всех ваших последующих страданиях виноват не больше, чем лев, который вас сожрал, если вы в решили прогуляться по саванне без оружия. Никаких равных прав нет с самого начала, их не планируется, никто таких целей не ставит - о чем тут говорить? Вам владельцы бизнеса должны сверху организовать демократию? Да с чего бы? А почему не сам Господь Бог?\n\n2. ZeroNet даёт техническую возможность каждому высказывать своё мнение и создавать контент, который может быть потенциально полезен людям. Вы можете создать сайт, который не ограничит регистратор домена, хостинг или кто-то еще. Свобода слова - фундамент для реальной демократии.\n\n3. Однако это относится только к вашим собственным сайтам, но не к продуктам коллективного авторства, таким как этот форум. Наши права здесь ограничены волей владельца форума точно так же, как и в той истории со Stack Overflow.\n\n4. ZeroNet сама по себе не является свободным обществом и не предоставляет инфраструктуру для функционирования свободного общества. Это технология, инструмент. Создать общество, среду для коммуникации мы должны сами. И каким будет это общество - зависит от нас. Какие мы есть, чего мы достойны - то у нас и получится. Если же получится диктатура похлеще чем в реале, значит именно этого мы и стоим.\n\n5. Никогда не путайте идеалистические мечтания о равных правах с суровой реальностью, где права проистекают из власти. Если у вас нет реальной власти, у вас нет никаких реальных прав. Демократия - она тоже именно об этом. В обществе ровно столько демократии, на сколько члены общества смогли отстоять свою власть, не уступив её чиновникам, корпорациям, собственной лени и безинициативности и прочему.",
			"added": 1561725326
		},
		{
			"topic_id": 9,
			"title": "RFC: переработка плагина AnnounceShare",
			"body": "@gitcenter:\n\n@caryoscelus:\n\nЯ смотрел код `AnnounceShare` и возникли следующие соображения:\n\n1. Плагин позволяет шарить только списки трекеров zero://. Следует разрешить обмен не только трекерами zero://, но любыми поддерживаемыми. (Потом напилим плагин, который заполняет список исправными bittorrent трекерами из сторонних источников.)\n\n2. Следует развернуть взаимодействие `AnnounceShare` и `Bootstrapper` в обратном направлении.\n  * Сейчас: \"`AnnounceShare` проверяет, запущен ли `Bootstrapper`, и если да, добавляет текущие IP-адреса в список трекеров.\"\n  * Нужно: \"`Bootstrapper` определяет, на каких адресах работает, и передаёт их в `AnnounceShare`.\"\n  * (После этого станет намного проще переделать `Bootstrapper` для работы на адресах .onion, в том числе и на неизменных между перезагрузками.)\n\n3. Вести учёт количества трекеров не суммарно, а отдельно для каждого протокола: bit torrent udp, bit torrent http(s), zero.\n\n4. Не выкидывать из списка трекеры, возвращающие ошибки, если за последнее время не было трекеров без ошибок вообще - на случай проблем с сетью.\n\n\nЦель топика: Выслушать конструктивные замечания и предложения.\n\nВ частности, беспокоят вопросы организационного плана:\n\n1. Имеет смысл делать под py2 или py3?\n2. Переработать плагин целиком и делать PR на всё сразу, или PR-ить в апстрим мелкими кусочками?",
			"added": 1562070653
		},
		{
			"topic_id": 10,
			"title": "Тормоза в браузере",
			"body": "Если лазить по ZeroNet и долго не закрывать браузер (день - два), начинает тормозить открытие сайтов. Особо не разбирался, но вроде тормозит на этапе установки соединения по вебсокету.\n\nЕсли перезапустить браузер, тормоза проходят. А если перезапустить ZeroNet, не перезапуская браузер - не проходят. Т.е. причина где-то в браузере. Памяти хватает, всего хватает, дело не в исчерпании ресурсов операционной системы.\n\nКто-нибудь еще сталкивался? Браузер Firefox.",
			"added": 1562688032
		},
		{
			"topic_id": 11,
			"title": "«Администрируем» Ru-ZeroTalk при помощи костылей и подпорок",
			"body": "В чем собственно проблема? Проблема в том, что новый русскоязычный пользователь, установив ZeroNet, скорее всего в первую очередь попадёт на [англоязычный форум ZeroTalk](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/). А оттуда он по ссылке в шапке сайта попадёт на этот форум.\n\nНо этот форум де-факто брошен админом на произвол судьбы.\n\nВ связи с этим предлагаю коллективно-костыльный метод поддержания этого форума в хоть каком-то полезном состоянии.\n\n1. Раз в месяц кто-нибудь (я, или любой другой посетитель, который озаботится этим) будет поднимать важные темы наверх, чтобы они находились в области видимости для новых пользователей.\n   Можно просто написать в теме \"up\", а свой предыдущий \"up\" удалить.\n\n2. Список важных тем предлагаю обсуждать в этой теме. Вот мой вариант:\n   * [Сама эта тема.](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/)\n   * [ZeroNet.Ru — FAQ и каталог русскоязычных сайтов в ZeroNet](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/)\n   * [О подделываемости данных в ZeroNet](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/)\n   Предлагайте в комментариях, что еще добавить, я дополню пост.\n\n3. Также, предлагаю в качестве русскоязычной площадки более активно задействовать мой форум http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/\n   В ближайшем будущем я допилю еще несколько фич к движку ZT++ и обновлю форум на новый движок. Будет очень хорошо.\n   Я хоть и не очень активный пользователь ZeroNet, но по крайней мере, два года уже тут нахожусь и бросать не планирую. Так что форум без присмотра не останется. Также, я выдам нескольким пользователям права на управление форумом, так что это будет дополнительной гарантией, что форум не окажется заброшен.\n\n4. Позже можно попробовать подать pull request на смену ссылки в шапке ZeroTalk. Но сомневаюсь, что его примут.",
			"added": 1584213750
		},
		{
			"topic_id": 1584283661,
			"title": "Добро пожаловать на Ru-ZeroTalk v2!",
			"body": "**Добро пожаловать на форум русскоязычного сообщества ZeroNet!**\n\n[**Ru-ZeroTalk v2**](http://127.0.0.1:43110/1RuZntipLvXcLKFEjT6Fr7ZA3GuywYfr5/) был клонирован с [оригинального Ru-ZeroTalk](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/) с переносом всех тем и сообщений, по состоянию на 15 марта 2020.\n\nК сожалению, владелец Ru-ZeroTalk, @shift, не появлялся в сети в течение долгого времени, и в течение еще более длительного времени он не обновлял движок сайта, который содержит древние баги и не содержит современных возможностей.\n\nПо совету @gitcenter я клонировал форум вместе со всеми постами. Новый форум работает на движке [ZT++](http://127.0.0.1:43110/14Zjt1CcoLXs6xu3huy5sYoK4PRMC1Qdfp/).\n\nДанные следующих пользователей не удалось скопировать, т.к. данные не находятся онлайн:\n\n```\nminicx6619@zeroid.bit:/13AZmQRmPJg3nDWo5M2C1jsXh8Vds1SSRY\nt0mas0l@zeroid.bit:/1M6v76JTj3Rzu7wjabcSYUzijvA3kEQ61B\nkasstiel@zeroid.bit:/1QB4oWamPFhc56a43nSR9hqUBfwUNysN1k\nutututututut@zeroid.bit:/1B9Ua5UViP8q2ncwgM8SbzvkrkWUqRG4qj\n```\n\n**Лимит сообщений: 4000 KB на пользователя.**",
			"added": 1584283649,
			"modified": 1635597287
		},
		{
			"topic_id": 1584374728,
			"title": "Вопросы администрирования",
			"body": "**Администрация:**\n\n@geekless: Владелец и администратор.\n@gitcenter: Администратор.\n",
			"added": 1584374715
		},
		{
			"topic_id": 1584450640,
			"title": "Задачи по продвижению этого форума на замену старого",
			"body": "TODO по продвижению:\n\n* **Заходите на [ZeroSites](http://127.0.0.1:43110/Sites.ZeroNetwork.bit/), находите там Ru-ZeroTalk 🇷🇺 v2 и ставьте лайк (звезду).** Это поможет форуму отображаться ближе к началу списка популярности.\n* Замена ссылок в шапках форумов ZeroTalk-{lang}:\n  * EN: pull request подан и принят. **СДЕЛАНО**.\n  * EO: принадлежит мне, позже заменю.\n  * CZ: форумом управляет @ssdifnskdjfnsdjk. Напишите ему письмо, если есть желание.\n  * Остальные форумы: у меня нет данных.\n* Добавить ссылку в ZeroWiki. **СДЕЛАНО**.\n* Добавить сайт на ZeroSites. **СДЕЛАНО**.\n* Добавить сайт на 0list. **СДЕЛАНО**.\n* Добавить сайт в список и в боковую панель на http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/ (сделаю позже)\n* Добавить сайт в шапку на http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq (сделаю позже)",
			"added": 1584450626
		},
		{
			"topic_id": 1584531679,
			"title": "Динамическое управление пользователями на сайте",
			"body": "@gitcenter:\n\nПросто идея:\n\nПозволить коду приложения (сайта) переопределять правила для `data/users/content.json`. (Технически может быть реализовано как `data/users/content-override.json` или как таблица в DB сайта.)\n\nЧто это даёт: приложение теперь само может распределять место для пользователей согласно заданному алгоритму. Например, учитывать активность пользователей и решения пользователей, не являющихся модераторами.\n\nТакже, это даёт возможность назначить некоторыми пользователям право *прибавлять другим пользователям место*, не назначая право *модерировать весь форум*.\n\nТак как на всех пирах исполняется один и тот же код приложения, все пиры принимают решения плюс-минус согласованно.\n\nПодменить код приложения и заставить по иному алгоритму распределять место конечно возможно, но это ничего не даёт, т.к. не распространяется на другие пиры.\n\nПодводные камни:\n\n* Чтобы данные динамически обновились, пользователь должен открыть сайт в браузере (и в дальнейшем открывать время от времени) ИЛИ установить плагин BackgroundProcessing.\n\n* Автоматические сидеры, конечно, не будут применять динамические правила, так там код сайта никогда не исполняется. Они будут следовать только дефолтному `data/users/content.json`.\n\n**Альтернативное решение:**\n\nОписывать динамические правила в виде набора SQL-запросов, выполняемых над БД сайта. (Аналогично, как задаются правила для извлечения ленты событий.) В таком случае применять правила может непосредственно движок ZeroNet без необходимости исполнять код сайта.",
			"added": 1584531664
		},
		{
			"topic_id": 1584542139,
			"title": "А вы знаете, что существовал другой ZeroTalk до современного?",
			"body": "http://127.0.0.1:43110/1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\n\nЕще до появления провайдеров user id.\n\nЯ вот не знал.",
			"added": 1584542123
		},
		{
			"topic_id": 1584599632,
			"title": "OpenNews 🇷🇺 — сайт для публикации новостей IT",
			"body": "Представляю вашему вниманию [OpenNews 🇷🇺](http://127.0.0.1:43110/1Nowr5oVEdbU5ZTQBriRd2jJVj2vhsDJd4/) — сайт для свободной и неограниченной публикации новостей в сфере информационных технологий, связи и защиты информации. Приветствуются новости, касающиеся выявленных и исправленных уязвимостей, развития сетевых технологий, а также новости из мира свободного программного обеспечения.\n\nДоступное пространство — 4000 KB на пользователя, что должно быть достаточно для публикации новостей и комментариев как минимум на несколько лет.",
			"added": 1584599615
		},
		{
			"topic_id": 1584929162,
			"title": "[RFC] Darknet mode",
			"body": "Нужен.\n\nНа входящие:\n\n1. Узел мимикрирует под обычный веб-сайт и на запросы HTTP отдаёт дефолтную страницу свежеустановленного Апача. (Или любую другую стандартную, или даже полноценный сайт.)\n2. Переключение на протокол ZeroNet осуществляется при получении GET-запроса, содержащему секретную строку (пароль).\n3. Узел не подключается к трекерам с этого IP. (Может подключаться с другого IP.)\n4. Узел может отдавать другим узлам список всех хранимых сайтов, если это разрешено в настройках.\n5. Возможна идентификация входящих подключений по паролю и использование разных настроек для разных пиров (списки сайтов и т.п.).\n\nНа исходящие:\n\n1. Узлу в настройках можно вручную задать списки пиров для darknet mode и пароли для подключения.\n2. Можно для каждого указанного darknet пира указать:\n   * Список сайтов, которые он содержит.\n   * Или включить запрос списка с самого пира.\n   * Или всегда пробовать получить сайт у пира, чтобы проверить, есть ли он у него.\n3. Узел не отсылает пиры из своего списка darknet по протоколу обмена списками пиров.\n\nВ виде наброска, как-то так.\n\nДелать это всё равно некому, но пусть будет.",
			"added": 1584929144
		},
		{
			"topic_id": 1585023084,
			"title": "From Russia, With Music // Блог с музыкой из России",
			"body": "Приветствую!\n\nПосле того как @aassddff сделал сайт с бразильской музыкой, я подумал, что давно тоже хотел сделать что-то подобное, но как-то всё не было времени. И создал блог:\n\n### => [From Russia, With Music](http://127.0.0.1:43110/1BUk8jGHn2wX2dnSmbfy8psmJoUf7aiRR8/)\n\nВ блоге будут:\n\n* Патриотические песни\n* Лирические песни\n* Музыка разных народов, живущих в России, либо имеющих отношение к ней за рубежом\n* ...и наверное что-нибудь еще)\n\nПока что я не добавлял ли текстов песен, ни переводов, но возможно, займусь этим позже.\n\nЕсли вам нравится идея и мой выбор музыки, нажмите кнопку \"Help distribute added optional files\" в боковой панели, чтобы повысить доступность видеоклипов. Я выхожу в сеть через Tor, поэтому у пользователей без Tor могут быть проблемы с доступом.",
			"added": 1585023065
		},
		{
			"topic_id": 1585191373,
			"title": "Сайты @siliks-а",
			"body": "Приветствую. Помогите человеку с сидированием:\n\nhttp://127.0.0.1:43110/1KAJWd8ATivDbMaCapK7yCouoaZM5Hvo8L/\nhttp://127.0.0.1:43110/17XNDaz1ZPc6gGSJe6QCo1DagUoJDrXyEQ/\n\nЯ не помню, откуда у меня в раздаче взялись эти два сайта, но просто сейчас обнаружил, что они имеют **ноль** пиров, не считая меня. Так как комп был включен всю ночь, я получил апдейты от автора, и сайты всплыли в ленте, напомнив о себе.\n\n@siliks, привет!",
			"added": 1585191353
		},
		{
			"topic_id": 1585226964,
			"title": "«Роза и червь» (и прочая суровая космофантастика)",
			"body": "Тред посвящается фантастике.\n\nСамое крышесносное, что я за последние годы читал, - это «Роза и червь» Роберта Ибатуллина.\n\nКнига начинается так:\n\n*Первый снаряд врезался в атмосферу над Коралловым морем — центнеровая капля кипящего алюминия на скорости в половину световой. Ни один глаз не видел процесса падения: пролет сквозь всю атмосферу длился меньше миллисекунды. Просто между небом и морем мгновенно возникла бесконечно длинная, тончайшая, ослепительная как тысяча солнц нить — линия раскаленной плазмы, в которую превратился снаряд и воздух на его пути.*\n    \n*В километре вокруг трассы снаряда воздух, пронзенный ливнями высокоэнергичных частиц, также немедленно перешел в состояние плазмы. Над океаном вспыхнул чудовищный столб огня, подобный огненному шару при ядерном взрыве, но более смертоносный, ибо сила его воздействия медленнее падала с расстоянием. Тепловое излучение в радиусе двухсот километров от взрыва мгновенно испарило верхний слой воды и воспламенило все, что было способно гореть — корабли, деревья, здания, даже почву. Через минуту последовал второй снаряд — над Минданао, затем третий — над Алеутами. Люди, успевшие укрыться в бункерах, оцепенело смотрели трансляции со спутниковых камер — тех, что не были сожжены в первую же секунду электромагнитным импульсом.*\n    \n*Раскаленный воздух на линии удара фонтаном бил в стратосферу, увлекая за собой пепел, пыль и водяной пар с поверхности, и на месте столба огня поднималась многокилометровая башня из дыма. Закручиваясь в гигантское торнадо, она блуждала по земле много часов и превращала в пустыню даже те области, что избежали прямого лучевого удара… А снаряды все падали и падали огненным дождем день и ночь. Зажженные тепловым излучением пожары охватили почти всю сушу. Следом разразился ураганный, многодневный тропический ливень — результат обильного испарения воды из морей. Ливень потушил пожары, но к тому времени спасать от огня было нечего. В пепел обратилась не только вся растительность, но и почвенный слой со всеми корнями, семенами и микробами, которые делали почву плодородной. Дождь довершил дело, превратив остатки дерна в безжизненную полужидкую грязь. И даже после того как прекратился ливень, грязь продолжала стекать с возвышенностей, обнажая каменный остов холмов. Разве только в приполярных областях, куда упало меньше снарядов, кое-где чудом уцелели островки тундры — но на всей остальной суше не осталось ничего кроме голых скал, пустынь и мертвых грязевых болот.*\n    \n*Так в сентябре 2295 года погибла Земля.*\n\nНайти электронную копию можно [на Флибусте](http://flibustahezeous3.onion/a/126681). Но ИМХО, такую книгу стоит купить в бумаге, как минимум, чтобы поддержать автора.\n\nКстати, напоминаю, что есть [форум](http://127.0.0.1:43110/1oJQLFq6DYkTw6c4MbZDaFEEocSBvR8FW/) и [wiki](http://127.0.0.1:43110/1F2grL5mK3t2Z876Apn1GA7sjv1B5ryYMu/), посвященные литературе, но что-то там сейчас пустынно. Сайтами управляет @dows. Давно его не видел в сети.",
			"added": 1585226943
		},
		{
			"topic_id": 1597468461,
			"title": "Всем привет, я снова с вами",
			"body": "Жизнь 4 месяца практически не оставляла времени на общественные проекты.\n\nПока еще не успел вникнуть обратно в курс дел. Что сейчас в ZeroNet, какие важные новости, проблемы и т.п.? Есть ли неотложные проблемы с этим форумом?",
			"added": 1597468439
		},
		{
			"topic_id": 1598243806,
			"title": "Тестируйте вставку изображений",
			"body": "Как вставить картинку в пост или комментарий:\n\n* Берёте любую картинку в пределах ZeroNet.\n* В текст сообщения пишете: `![](ссылка_на_картинку)`.\n\nНапример:\n\n```\n![](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1598243554-205200-1920x1080.jpg)\n```\n\nРезультат, здесь должно быть изображение:\n\n![](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1598243554-205200-1920x1080.jpg)\n\nЕсли сайт, на котором размещено изображение, у вас не подключен, форум запросит разрешение на добавление сайта.\n\nЕсли изображение не найдено, форум покажет уведомление на месте изображения.\n\n### Куда можно закачать изображение для вставки на форум:\n* [ZeroUp Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/)\n* [ZeroUp@anotherneko](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/)\n* Завести себе ZeroBlog, закачивать туда картинки.\n* Выложить картинку в ZeroMe.",
			"added": 1598243783
		},
		{
			"topic_id": 1598849641,
			"title": "Google банит Fediverse. Добро пожаловать в GOOLAG.",
			"body": "*Источник: [Не принимающие цензуру приложения для соцсетей Fediverse могут быть удалены из Google Play](https://www.opennet.ru/opennews/art.shtml?num=53624)*\n\nКомпания Google [направила](https://mastodon.social/@Gargron/104763960269049818) разработчикам Android-приложений [Husky](https://f-droid.org/en/packages/su.xash.husky/), [Fedilab](https://f-droid.org/en/packages/fr.gouv.etalab.mastodon/) и [Subway Tooter](https://github.com/tateisu/SubwayTooter), позволяющих общаться в децентрализованных социальных сетях [Fediverse](https://fediverse.party/), [предупреждение](https://qoto.org/@freemo/104765288863293481) о необходимости устранения нарушений правил каталога Play Store. На устранение замечаний дано 7 дней, после чего не выполнившие требования приложения будут удалены из каталога Google Play.\n\nВ качестве причины намеченной блокировки упоминается возможность использования приложений для доступа к генерируемому пользователями контенту, подстрекающему к дискриминации и включающему элементы [риторики ненависти](https://ru.wikipedia.org/wiki/%D0%AF%D0%B7%D1%8B%D0%BA_%D0%B2%D1%80%D0%B0%D0%B6%D0%B4%D1%8B). Судя по всему, уведомления получили приложения, в которых отсутствует цензурирование и не выполняется блокировка серверов, на которых присутствуют группы, допускающие расизм, ксенофобию, экстремизм и межнациональную вражду. Например, приложение Husky является ответвлением от приложения [Tusky](https://tusky.app/), которое не получило предупреждение от Google. Отличия между программами Husky и Tusky сводятся к поставке встроенного списка блокировки, в который занесены такие сети, как [Gab](https://ru.wikipedia.org/wiki/Gab), не ограничивающие суждения пользователей.\n\nПо [словам](https://mastodon.social/@Gargron/104763960269049818) автора платформы для создания децентрализованных социальных сетей Mastodon, получившие уведомление приложения не пропагандируют группы с риторикой ненависти и не отвечают за их поддержание, а лишь позволяют пользователю ввести адрес любого интересующего сервера децентрализованной социальной сети. Ответственность за размещаемую в выбранной сети информации лежит на администраторе сервера, а не на разработчиках приложения. Аналогично Google может потребовать убрать Chrome, Firefox, Opera и другие браузеры, так как они также позволяют пользователю ввести адрес сомнительного ресурса и получить доступ к оскорбительному контенту.",
			"added": 1598849617
		},
		{
			"topic_id": 1603651874,
			"title": "Работа над ZeroNet, мои соображения",
			"body": "del",
			"added": 1603651849
		},
		{
			"topic_id": 1603798134,
			"title": "Баг в работе ZeroNet с трекерами",
			"body": "Я тут опять со своими мыслями вслух.\n\nВот так выглядит статистика обращений к трекеру:\n\n```\naddress \trequest \tsuccessive errors \tlast_request\nhttp://h4.trakx.nibba.trade:80/announce\t370\t0\t0 min ago\nhttp://open.acgnxtracker.com:80/announce\t371\t3\t0 min ago\nhttp://tracker.bt4g.com:2095/announce\t10\t10\t6 min ago\nzero://185.117.73.181:11036\t3\t0\t0 min ago\nzero://2001:15e8:110:50a::1:15441\t3\t0\t0 min ago\nzero://2001:bc8:1830:2511::1:21041\t3\t0\t0 min ago\nzero://216.189.144.82:26312\t3\t0\t0 min ago\nzero://2602:ffc5::c5b2:5360:26312\t3\t0\t0 min ago\nzero://2602:ffc5::ffc5:79d1:26312\t3\t0\t0 min ago\nzero://45.77.23.92:15555\t3\t0\t0 min ago\nzero://51.15.54.182:21041\t3\t0\t0 min ago\nzero://51.254.123.155:33092\t3\t0\t0 min ago\nzero://51.38.34.170:15656\t3\t0\t0 min ago\nzero://81.2.237.10:15441\t6\t6\t32 min ago\nzero://85.226.189.52:9001\t3\t0\t0 min ago\nzero://boot3rdez4rzn36x.onion:15441\t3\t0\t0 min ago\nzero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443\t7\t0\t0 min ago\n```\n\n1. Количество `request` не увеличивается для большинства трекеров, за исключением первых двух в списке.\n2. Количество ошибок `successive errors` также не увеличивается.\n3. При этом `last_request` для большинства — `0 min ago` постоянно, то есть ZeroNet всё же пытается к этим трекерам обращаться.\n\nЭто может быть чисто визуальный баг статистики, но пока мне кажется, что это более глубокая проблема. Перекликается с багрепортами о невозможности подключиться к трекерам с официального багтрекера и с моими эмпирическими наблюдениями.\n\nИ дело не в том, что трекеры лежат. Не могут же лежать ВСЕ zero-трекеры разом.\n\nВ целом у меня накопилось очень много вопросов к коду ZeroNet. Отсутствие некоторых API и отдельный код на хаках я терпел, так как не хотел вмешиваться в код ядра, чтобы не терять возможность лёгкого мерджа изменений. Но сейчас, видимо, настала пора сесть и разобраться.\n\nЭтот баг напрямую влияет на код плагина, который я сейчас отлаживаю.\n\nТак что у меня нет выбора, кроме как делать форк с правками ядра. Видимо, это день настал.",
			"added": 1603798108
		},
		{
			"topic_id": 1635696627,
			"title": "nofish и диверсии",
			"body": "> [musickiller](#comment_4_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): don't see the logic.. or was it a joke?\n\nНадеюсь, что шутка.\n\nНо вообще все сайтовые движки, что сделал nofish, обладают парой примечательных свойств.\n\nС одной стороны, они очень изобретательно написаны. Сам я пишу код зачастую хуже. Не скажу, что архитектура движков хорошая, это как раз спорно. Вот сам код как связный текст, выражающий мысль автора, вполне неплох. Я вникая в разный наколенный опенсорс, привык иметь дело с кодом худшего качества.\n\nИ с другой стороны все движки недописаны и брошены ровно тогда, когда пользоваться сайтом вроде уже можно. Но без матов это делать не получается.\n\nНу, такой, наверное, характер у человека. Нравится начинать новое.\n\nНадеюсь, он жив-здоров.",
			"added": 1635696600,
			"modified": 1635696929
		}
	],
	"topic_vote": {
		"1_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky": 1,
		"1_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"16_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": 1,
		"1584288639_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1,
		"1584452427_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"1584457808_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1,
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1
	},
	"next_comment_id": 486,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "> [useti](#comment_2_19M6S4PQBFoq7kg7Bv6t4U8aRs9qrVMyat): я понял что это мне напоминает - фидовекторный и гипертекстовый фидонет. провто вместо того чтобы качать эхи - качается все подряд\n\nНу вот мы и дожили, значит. Всем приветы в гипертекстовом фидонете.",
				"added": 1509110243
			},
			{
				"comment_id": 2,
				"body": "> [blinkel](#comment_12_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Что за зверь \"Фидонет\"?\n\nhttps://ru.wikipedia.org/wiki/%D0%A4%D0%B8%D0%B4%D0%BE%D0%BD%D0%B5%D1%82",
				"added": 1509170680
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 3,
				"body": "На мой взгляд, федеративное устройство — это как в XMPP. Узлы сети равноправны по отношению друг к другу, но конечные пользователи привязаны к конкретному узлу. Если узел пропадает, у пользователя нет возможности выполнить аутентификацию в сети.\n\nМне кажется, в zeronet элементы федеративности можно найти в системе айдишников. Отключить хранилище ID-ов невозможно, так как оно хранится \"везде\". Но если хакнуть владельца приватного ключа, то можно уничтожить хранилище вместе со всеми зарегистрированными учётками.",
				"added": 1509172784
			},
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_208_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Оно не просто элементы, это прямо централизованный компонент :) Хотя он не является ключевым и критическим элементов для ZN. В режиме чтения ZN будет работать и без него, а для записи — потребует правки приложений, но после исправления продолжит работать.\n\nПокопался в разных сорцах. Кажется, я протупил в предыдущем сообщении. \n\nID-провайдер подписывает сертификат, который сохраняется клиентом в user.json. После этого провайдер не требуется для работы с идентификатором. Аутентификация на сайте возможна на том основании, что клиент предоставляет сертификат, подписанный провайдером, которому этот сайт доверяет.\n\nЕсли провайдер имеет server-side в clearnet-е, можно уничтожить провайдера, и тогда станет невозможна регистрация новых пользователей, но не работа уже подписанных.",
				"added": 1509193728
			},
			{
				"comment_id": 16,
				"body": "> [dude](#comment_43_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): kaffie и cryptoid работают например на этом сайте.\n\nВ cert_signers только zeroid.bit вижу",
				"added": 1518745819
			},
			{
				"comment_id": 17,
				"body": "> [undyingfirewall](#comment_4_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Уже существуют альтернативные провайдеры имён?\n\nhttp://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:2_12ahUHySC6HRunXXb1egDiT4BYbBDP8tFc\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1517337097_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS",
				"added": 1518745894
			},
			{
				"comment_id": 18,
				"body": "> [ilyakmet](#comment_1_1B8uzsgHBt2SsJVkcqfmGwPjeVgHcHWkmo): Привет, ZeroNet можно пользовать только если запустил исходник? У IPFS например есть ноды через которые можно получать доступ.\n\nБыли всякие прокси, но сейчас ни один не отзывается: http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies",
				"added": 1518791181
			},
			{
				"comment_id": 19,
				"body": "> [swashbuckler](#comment_1_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Как минимум https://proxy.zeronet.a0z.ru отзывается\n\nТам запрещено добавление новых сайтов, потому и жив. Это прокси balancer73-а.",
				"added": 1518891808
			},
			{
				"comment_id": 20,
				"body": "Кстати, как-нибудь можно сделать mention пользователя, чтобы ему пришло уведомление, ссылаясь не на конкретный комментарий, а на ник?\n\nТ.е. не так:\n```\n[swashbuckler](#comment_1_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ)\n```\n\nА что-то типа того:\n```\n[swashbuckler](swashbuckler@zeroid.bit)\n```",
				"added": 1518892800
			},
			{
				"comment_id": 21,
				"body": "> [swashbuckler](#comment_2_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Хороший вопрос. Но тогда куда придёт уведомление? (если бы оно было) :D\n\nПридёт уведомление о посте того, кто поставил ссылку, т.е. так же как и сейчас: на таком-то сайте в таком-то посте было mention. Как сделано на linux.org.ru или как в твиттере.",
				"added": 1518927573
			},
			{
				"comment_id": 22,
				"body": "> [balancer73](#comment_285_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А, вообще, если нужно кого-то добавить — пишите :)\n\nЯ писал на ZeroMail, но то ли почта не работает, то ли ты её не проверяешь :D",
				"added": 1518936330
			},
			{
				"comment_id": 23,
				"body": "Тест mention самого себя\n\n> [geekless](#comment_22_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): ...\n\nРаботает.",
				"added": 1518936497
			},
			{
				"comment_id": 24,
				"body": "Тест @geekless",
				"added": 1518937034
			},
			{
				"comment_id": 25,
				"body": "О, вот так должно работать. Проверка:\n@swashbuckler\n\n@balancer73",
				"added": 1518937088
			},
			{
				"comment_id": 26,
				"body": "> [user4cd](#comment_2_1P4qqds8jkDihzBXBfx3nMLK2DE5Q6KnzM): что интересного тут есть ?\n\nИли по ссылкам отсюда походить: http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/",
				"added": 1518959151
			},
			{
				"comment_id": 27,
				"body": "> [balancer73](#comment_286_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Проверил сейчас (в т.ч. через проверку файлов) — ничего нет :-/\n\nМда уж. А файл http://127.0.0.1:43110/1MaiL5gfBM1cyb4a8e3iiL8L5gXmoAJu27/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/data.json существует и содержит три записи типа message? По таймстампам получается как раз три сообщения, что лежат у меня в отправленных:\n1518359708149 - February 11, 2018 2:35:08 PM\n1518377322158 - February 11, 2018 7:28:42 PM\n1518487095642 - February 13, 2018 1:58:15 AM",
				"added": 1518960223
			},
			{
				"comment_id": 28,
				"body": "> [balancer73](#comment_290_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Забавно. Зашёл в почту с другой машины, через закрытый свой прокси — тут всё работает :)\n\nМожно попробовать пересоздать базу данных сайта кнопкой «Rebuild» в боковой панели.",
				"added": 1518960941
			},
			{
				"comment_id": 29,
				"body": "Кстати, вот еще задачка про непонятные глюки: http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/?Topic:3_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1518962279
			}
		],
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 6,
				"body": "> [redfish](#comment_7_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): Например, у Гит-репо этот путь есть -- это форк. Остаётся задача объявления (и сортировки) клонов, но если эту задачу решить, то путь появляется: после смерти ресурса, любой пользователь может создать форк (вместе со всеми данными!), после его смерти, опять форк. Форки делать должно быть просто и список форков должен быть доступен при посещении ресурса.\n\nЭто не путь гит-репо, а путь конкретно гитхаба. И в зиронет надо аналогично разделить обязанности. Чтобы отслеживать форки (и вообще историю сайтов, историю сети), нужен какой-то специализированный сервис. Гугл, веб-архив и википедия в одном флаконе. Или, возможно, что-то принципиально новое, не представимое в рамках традиционного подхода к сайтам. Я думаю, если сеть наберёт популярность, такой инструмент непременно сделают.",
				"added": 1509269155
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_58_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Но чтобы его пополнять — придётся коммитерам давать приватный ключ.\n\nНе обязательно. В конфиге же есть возможность дать право подписывать сайт другими ключами. \nМожно ограничить список коммитеров списком конкретных ключей.\nМожно создать специализированного ID-провайдера, которым подписывать сертификаты разработчиков, и в репозитории выставить доверие только этому провайдеру.",
				"added": 1509269471
			}
		],
		"1_1PEBR3TeTAu1rNL3EuGZtymbvMVKXZyqFK": [
			{
				"comment_id": 8,
				"body": "> Придётся авторизацию прикручивать чтобы по домену ходить как белый человек.\n\nЯ делаю port forwarding средствами ssh и просто хожу браузером по локальному адресу. Правда приходится еще htop в сеансе ssh запускать, т.к. если долго нет обмена данными, сеанс подвисает. А с htop в качестве пинга он может висеть открытым днями.",
				"added": 1509461930
			},
			{
				"comment_id": 9,
				"body": "> никогда не испытывал проблем с этим просто\n\nВозможно, у меня провайдерский NAT теряет состояние соединения. Провайдер местный вообще не ОК.",
				"added": 1509462058
			}
		],
		"3_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 10,
				"body": "Что касается шифрования, я думаю, почта вполне надежна.\n\nПроблема, что на базе ZeroNet (пока) нельзя сделать Bitmessage:\n1. Нет PoW.\n2. Нет возможности ограничить \"срок годности\" данных, чтобы они стирались через какое-то время.\n3. Только владелец приватного ключа может удалить \"свой\" контент, поэтому другие узлы не могут сами эмулировать п.1 и п.2. (да и код зайта исполняется только пока он открыт в браузере).\n\nZeroMail можно рассматривать как прототип Bitmessage из говна и палок. В условиях, когда пользуются им полтора добропорядочных анонимуса, всё ок. Но устроить этой почте DoS — как два пальца.\n\nГде-то там в светлом будущем технологии ZeroNet, I2P, BitTorrent и BitMessage сливаются в экстазе и наступает счастье. Наверное. :)",
				"added": 1518365194
			},
			{
				"comment_id": 11,
				"body": "Судя по тому, что ZeroMail по 3-4 часа может быть без обновлений, писать письма — не популярная тема. И даже echobot молчит. Пишите там на мой ник, затестим хоть, как оно.",
				"added": 1518366940
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [],
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 13,
				"body": "> [wesy](#comment_1_15EL3nJs2b9AXWTtniTkV9Jq77n67nMVCH): Сюда, вроде, ещё не пробрались толпы ололокающих макак младшего школьного возраста, и прочих отвратительных типов. Можно строить с нуля общение.\n\n**Пока** не пробрались. Но в отличие от VK и FB, принадлежащим корпорациям, здесь каждый — сам себе хостер и цензор контента. И вот пока они не пробрались, нужно разработать механизмы web of trust, чтобы люди с близкими интересами такую фильтрацию могли легко себе обеспечивать.",
				"added": 1518513881
			}
		],
		"2_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 14,
				"body": "What kind of topic is it?",
				"added": 1518542504
			},
			{
				"comment_id": 15,
				"body": "> the censor is everywhere\n\nYou can run your own copy of ZeroTalk, at least. And no one can stop you from talking to people there.",
				"added": 1518542745
			}
		],
		"1_1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL": [
			{
				"comment_id": 30,
				"body": "А что значит наказание? Найти в реале и морду набить? =) Заблокировать (скрыть сообщения) любого можно и так.",
				"added": 1519578190
			},
			{
				"comment_id": 31,
				"body": "> [promusik](#comment_15_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): циферка рядом с ником\n\nЭто лайки. Хреново нарисованныей лайки. :)",
				"added": 1519661246
			},
			{
				"comment_id": 36,
				"body": "> [anotherneko](#comment_11_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): В случае сощиальной атаки на уровне зайта можно сделать премодерацию с авторизацией по тому самому ключу с добавлением в белый список после некоторого количества одобреных сообщений.\n\nВ этом случае, пока ты не в белом листе, вообще не можешь ничего на сайт отправить, так что нечего будет одобрять. Никаких \"некоторого количества сообщений\".",
				"added": 1519752145
			},
			{
				"comment_id": 37,
				"body": "> [caryoscelus](#comment_9_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Не, ну в принципе-то можно систему шеринга белых списков сделать\n\nДавно хочу прототип сделать, но со свободным временем как всегда...",
				"added": 1519776627
			},
			{
				"comment_id": 39,
				"body": "> [azz](#comment_6_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Созданием аккаунта соцсети в ZeroNET должно быть создание (специального) зайта иначе соцсеть станеть слишком большой\n\nНасчёт размера не понял, но с первой половиной согласен. Когда ID provider подписывает identity, эта identity — просто биткойн-адрес, и его можно использовать как обычный адрес зайта. Например, мой ник тут подписан как \"geekless@zeroid.bit:1GooUE19488nDwG3TdkM8seYAHct4gjkq4\". И адрес 1GooUE19488nDwG3TdkM8seYAHct4gjkq4 я могу использовать как зайт (имею от него приватный ключ). Было бы неплохо иметь какие-то RFC на этот счёт — для чего такие адреса-аккаунты использовать, в каком формате там данные размещать.",
				"added": 1522407257
			},
			{
				"comment_id": 42,
				"body": "> [azz](#comment_37_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Данные пользователя сайта аккаунта соцсети должен хранить и подписывать он сам у себя.\n\nТоже так думаю.\n\n> [azz](#comment_37_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Не знаю как там в ZeroMe реализовано, но я так понимаю, они предлагают скачивать контент некого профайла как опциональный контент зайта ZeroMe?\n\nКонтент хранится на одном из хабов вместе с контентом остальных пользователей хаба. Это как если бы был сайт-агрегатор комментариев с разных форумов типа этого (только без самих форумов, лол). Довольно неудобно, и в перспективе немасштабируемо.",
				"added": 1522414725
			}
		],
		"1_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u": [
			{
				"comment_id": 32,
				"body": "Через tor открывается частично. Часть файлов скачалась, но главная пока не открывается.",
				"added": 1519739209
			},
			{
				"comment_id": 33,
				"body": "Когда я пропихиваю новый сайт с десктопа на VDS, то пытаюсь открывать этот сайт через ноду на VDS и одновременно публикую апдейты с десктопа. После 3-4 повторов сайт обычно перекачивается.",
				"added": 1519739498
			},
			{
				"comment_id": 34,
				"body": "1. Стили не подхватились.\n2. При открытии сайта очень долго что-то ждёт, будто грузит файлы (хотя файлы вроде есть), а потом таки открывает страницу без стилей.\nНе могу выяснить детали, нет времени сейчас разбираться.",
				"added": 1519740736
			},
			{
				"comment_id": 35,
				"body": "Точно, посмотрел в сорец, а там везде ссылки через хост и порт. А я на недефолтном порту запускал.",
				"added": 1519751950
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 38,
				"body": "Arch, Void на десктопе. CentOS, Debian на сервере.",
				"added": 1522406236
			},
			{
				"comment_id": 46,
				"body": "> [azz](#comment_38_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Вот мне интересно зачем люди используют что-то отличное от самого популярного дистрибутива?\n\nМожно переформулировать: «Вот мне интересно зачем люди используют что-то отличное от самой популярной ОС Windows 10?»\n\nОтветы на оба вопроса будут очень похожи.",
				"added": 1522504675
			},
			{
				"comment_id": 453,
				"body": "Да тут наверное одни Linux-юзеры и сидят.",
				"added": 1617098478
			}
		],
		"2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 40,
				"body": "> [azz](#comment_31_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): В том, что нету единой точки отказа.\n\nК сожалению, у всех децентрализованных сетей существует точка отказа в виде бутстрап-узла. Она, конечно, не единая, ведь можно вручную указать другой узел, но этот узел сначала надо как-то узнать. Сарафанным радио, почтовым голубем... :)",
				"added": 1522407623
			}
		],
		"1_12ahUHySC6HRunXXb1egDiT4BYbBDP8tFc": [
			{
				"comment_id": 41,
				"body": "> [dude](#comment_50_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): optional/bigfiles умеют дедупликацию? ipfs умеет\n\nДопилят когда-нибудь. Нет смысла тащить целый IPFS ради частной фичи.",
				"added": 1522408541
			},
			{
				"comment_id": 44,
				"body": "> [dude](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_12ahUHySC6HRunXXb1egDiT4BYbBDP8tFc/IPFS#comment_53_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): В том и проблема - каждый городит свой велосипед несовместимый с другими.\n\n[Ответил в блоге.](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:19), место тут почти закончилось.\n",
				"added": 1522488054
			}
		],
		"1_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 43,
				"body": "> [balancer73](#comment_318_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Docker есть Docker — система контейнеризации. Какие там ещё есть возможности?\n\nУправление роем (кластером), например. Но я никогда не пользовался этой фичей.",
				"added": 1522426721
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 45,
				"body": "used: 24.5k/30k\n\n[shift](#comment_282_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7), ты тут бываешь?",
				"added": 1522489719
			},
			{
				"comment_id": 53,
				"body": "> @stre10k: Надо форум на несколько админов сделать, благо ZN такое позволяет.\n\nЯ уж думаю, не сделать ли новый Ru-ZeroTalk и не обратиться ли ко всем прочим владельцам ${страна}-ZeroTalk, чтобы они сменили межсайтовую навигацию.",
				"added": 1525628500
			},
			{
				"comment_id": 54,
				"body": "> @stre10k: Предполагается что провайдер авторизации борется со спамерами своими методами.\n\nКакими же?\n\n> @stre10k: 1000\\*10k и 1000\\*100k имеет разницу?\n\nА как насчёт 1000\\*10k и 100000\\*10k?",
				"added": 1525654450
			}
		],
		"2_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 47,
				"body": "На каких сайтах, например?\nМожет там действительно файлы битые на узле источнике.",
				"added": 1525596083
			},
			{
				"comment_id": 48,
				"body": "Бывает такое, потом проходит. Может быть, content.json разошелся по сети, а data.json - нет, а юзер ушел в оффлайн.",
				"added": 1525603055
			}
		],
		"3_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 49,
				"body": "> Какой способ самый удобный, как считаете?\n\nДумаю, если немного, то прямо на блоге. А если много, то завести отдельный картиночный хаб на движке http://127.0.0.1:43110/0gallery.bit/",
				"added": 1525603281
			},
			{
				"comment_id": 50,
				"body": "> @balancer73: а потом вставить её через штатный gateway.ipfs.io\n\nА у пользователя не будет настроен выход в клирнетовский web...",
				"added": 1525604921
			},
			{
				"comment_id": 51,
				"body": "> @balancer73: gateway.ipfs.io — это такой штатный маркер, как 127.0.0.1:43110\n\nПроблема, что обычно никак не видно, что должна быть картинка. Получается, что зайт не подгрузился, что доступа в IPFS нет — в любом случае пользователю нужно сообщать, мол, \"тыкай сюда и следуй инструкции\".",
				"added": 1525610514
			},
			{
				"comment_id": 52,
				"body": "> @balancer73: Вот, теперь видно :)\n\nПрикольно. Туда можно любой контент так подставить?",
				"added": 1525615580
			}
		],
		"5_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [],
		"1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [],
		"16_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 57,
				"body": "@shift жив! 👍 👍 👍\nСпасибо!",
				"added": 1548579119
			},
			{
				"comment_id": 59,
				"body": "> [erert45](#comment_30_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi): где изменен лимит ?\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1548583299-limit-20000k.png",
				"added": 1548583324
			},
			{
				"comment_id": 254,
				"body": "Я так понимаю, @shift прибавил лимит и снова нас покинул на неопределённый срок, возможно, навсегда. Движок он обновлять не будет, в движухе никакой участвовать не будет и т.п.\n\nВообще не очень ясно, что с этим делать, не только в RU разделе, но и в других языковых. Там тоже много где форумы фактически без администрирования.",
				"added": 1584212168
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 60,
				"body": "> [bvn13](#comment_5_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): А вообще удобно ли все это хозяйство запускать на каком-нибудь сервачке и ходить с мобилки/удаленно?\n\nМожно и так, да. Движок позволяет сделать запароленный прокси.\n\nМожно по ssh порт пробрасывать.\n\nПо всякому можно, в общем.\n\nЯ вот таким враппером пускаю ноды, очень удобно: http://127.0.0.1:43110/1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG/",
				"added": 1548641489
			},
			{
				"comment_id": 62,
				"body": "> Сейчас большинство зайтов никем не модерирутся, не регулируются и медленно зарастают оффтопом и мусором. \n\nА должно быть иначе в нецензурируемой сети?",
				"added": 1548642258
			},
			{
				"comment_id": 64,
				"body": "Суммарная статистика пользователей, которые имеют >=10 постов, по 3 самым посещаемым русскоязычным форумам:\n\nhttp://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE\nhttp://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC\nhttp://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ\n\nКоличество постов - ник - дата первого поста - дата последнего поста:\n\n```\n1122 -                    balancer73@zeroid.bit - 2016-10-03 - 2018-12-25\n 396 -                         shift@zeroid.bit - 2016-02-12 - 2019-01-27\n 348 -                 nippletwister@zeroid.bit - 2016-02-12 - 2017-08-27\n 266 -                     vlad20012@zeroid.bit - 2016-03-05 - 2017-05-11\n 217 -                      geekless@zeroid.bit - 2017-10-24 - 2019-01-28\n 192 -                     splitfire@zeroid.bit - 2016-03-05 - 2016-08-11\n 154 -                      kostanew@zeroid.bit - 2016-03-06 - 2016-03-19\n 152 -                       wrewolf@zeroid.bit - 2016-02-12 - 2017-02-27\n 121 -                   calmaquesse@zeroid.bit - 2018-04-29 - 2018-05-23\n 119 -                   anotherneko@zeroid.bit - 2017-11-23 - 2019-01-24\n 111 -                         zerro@zeroid.bit - 2016-04-05 - 2016-10-25\n 111 -                        gomzik@zeroid.bit - 2016-04-18 - 2017-11-14\n  98 -                         zalex@zeroid.bit - 2016-02-12 - 2018-05-11\n  91 -                       esteban@zeroid.bit - 2016-03-04 - 2016-03-28\n  87 -                         pozya@zeroid.bit - 2017-04-20 - 2018-09-26\n  86 -                   mewmewpower@zeroid.bit - 2017-09-12 - 2017-10-05\n  84 -                        voland@zeroid.bit - 2016-10-08 - 2018-04-18\n  83 -                          dude@zeroid.bit - 2016-03-02 - 2019-01-19\n  82 -                       erert45@zeroid.bit - 2019-01-16 - 2019-01-27\n  70 -                   deepstrelok@zeroid.bit - 2018-04-26 - 2018-06-03\n  65 -                       strelok@zeroid.bit - 2018-04-20 - 2018-10-16\n  64 -                       akachan@zeroid.bit - 2017-05-12 - 2017-05-28\n  63 -                      promusik@zeroid.bit - 2017-12-02 - 2019-01-20\n  62 -                   tokyomewmew@zeroid.bit - 2017-10-05 - 2018-02-03\n  59 -                         morin@zeroid.bit - 2016-10-03 - 2018-07-30\n  55 -                       antignu@zeroid.bit - 2017-01-08 - 2017-02-03\n  52 -                      82456783@zeroid.bit - 2016-03-05 - 2016-03-05\n  51 -                          mist@zeroid.bit - 2010-07-28 - 2017-03-13\n  51 -                  darktrader03@zeroid.bit - 2018-04-12 - 2018-11-17\n  50 -                       stre10k@zeroid.bit - 2017-03-07 - 2018-10-16\n  47 -                           azz@zeroid.bit - 2018-03-22 - 2018-04-16\n  45 -                        syntia@zeroid.bit - 2018-07-28 - 2019-01-27\n  45 -                         murka@zeroid.bit - 2017-05-13 - 2017-07-07\n  45 -                     leinariys@zeroid.bit - 2016-03-06 - 2016-10-13\n  44 -                        manrus@zeroid.bit - 2016-02-12 - 2016-02-19\n  41 -                     zerostorm@zeroid.bit - 2017-09-17 - 2017-10-14\n  40 -                    kodomoneko@zeroid.bit - 2017-05-28 - 2017-06-18\n  38 -                       intervi@zeroid.bit - 2017-07-07 - 2019-01-21\n  38 -                   caryoscelus@zeroid.bit - 2018-01-18 - 2019-01-22\n  38 -                      bplohish@zeroid.bit - 2017-08-14 - 2017-09-17\n  37 -                 avoiddowntime@zeroid.bit - 2017-02-13 - 2018-01-23\n  36 -                       ukraine@zeroid.bit - 2017-08-20 - 2017-10-26\n  36 -                   tolstoevsky@zeroid.bit - 2016-12-12 - 2017-01-23\n  35 -                       zeroalx@zeroid.bit - 2017-01-18 - 2017-03-06\n  34 -                        shaper@zeroid.bit - 2018-07-11 - 2018-10-02\n  32 -                        radjah@zeroid.bit - 2017-08-21 - 2018-06-07\n  32 -                        azriel@zeroid.bit - 2017-05-21 - 2017-06-05\n  32 -                        authhh@zeroid.bit - 2016-03-06 - 2016-03-08\n  32 -                anonfromonelon@zeroid.bit - 2016-04-08 - 2017-04-01\n  31 -                     towarisch@zeroid.bit - 2017-09-08 - 2017-09-16\n  31 -                     mistalero@zeroid.bit - 2018-09-12 - 2019-01-16\n  31 -                         gnome@zeroid.bit - 2017-02-19 - 2017-05-26\n  30 -               sgushennayavoda@zeroid.bit - 2018-03-01 - 2018-12-05\n  30 -                     gitcenter@zeroid.bit - 2018-05-05 - 2018-09-17\n  29 -                        x86128@zeroid.bit - 2018-01-11 - 2018-05-13\n  29 -                       quirrel@zeroid.bit - 2018-12-24 - 2019-01-27\n  29 -                           jzt@zeroid.bit - 2018-02-27 - 2018-03-12\n  28 -                       karmide@zeroid.bit - 2017-08-25 - 2017-08-27\n  27 -                    matiskynav@zeroid.bit - 2018-04-22 - 2018-04-29\n  27 -              deliriumgoddesss@zeroid.bit - 2019-01-03 - 2019-01-27\n  26 -                          qiwi@zeroid.bit - 2018-06-01 - 2018-06-03\n  24 -                     reflevmas@zeroid.bit - 2018-09-12 - 2018-09-20\n  24 -                      gluckman@zeroid.bit - 2018-07-13 - 2018-08-06\n  24 -                     geekless2@zeroid.bit - 2018-05-06 - 2019-01-27\n  23 -                      strellok@zeroid.bit - 2018-05-02 - 2018-05-03\n  23 -                      sangokas@zeroid.bit - 2018-04-10 - 2018-04-23\n  23 -                         doom1@zeroid.bit - 2016-09-27 - 2016-09-27\n  22 -                      touhou13@zeroid.bit - 2017-12-18 - 2018-01-14\n  22 -                   musickiller@zeroid.bit - 2016-03-05 - 2016-03-14\n  20 -                       trooper@zeroid.bit - 2018-03-04 - 2018-08-21\n  20 -                         pztrn@zeroid.bit - 2016-11-28 - 2016-12-02\n  20 -                       miklosh@zeroid.bit - 2016-03-02 - 2018-06-01\n  20 -                      coolplay@zeroid.bit - 2018-01-31 - 2018-03-03\n  19 -                    bodqhrohro@zeroid.bit - 2018-01-06 - 2018-04-01\n  18 -                    unit875309@zeroid.bit - 2017-03-21 - 2017-04-15\n  18 -                      gaslimit@zeroid.bit - 2016-11-20 - 2016-12-06\n  18 -                        cypher@zeroid.bit - 2016-03-08 - 2016-07-30\n  17 -                            ww@zeroid.bit - 2016-02-18 - 2017-11-20\n  17 -                   tolst0evsky@zeroid.bit - 2017-02-23 - 2017-03-05\n  17 -                        sinobi@zeroid.bit - 2019-01-27 - 2019-01-27\n  17 -                     kobzonoyd@zeroid.bit - 2017-02-12 - 2017-03-31\n  17 -                      downfal8@zeroid.bit - 2017-04-13 - 2017-04-15\n  17 -                       blinkel@zeroid.bit - 2017-05-13 - 2018-02-03\n  16 -                        vvvolf@zeroid.bit - 2016-10-11 - 2017-04-20\n  16 -                        vladzh@zeroid.bit - 2016-11-29 - 2016-12-29\n  16 -                        sigma7@zeroid.bit - 2017-08-30 - 2017-11-05\n  16 -                        oo7o6y@zeroid.bit - 2016-11-29 - 2017-04-03\n  16 -                      eugenere@zeroid.bit - 2016-03-12 - 2016-03-14\n  15 -                       tsubame@zeroid.bit - 2017-12-17 - 2018-01-07\n  15 -                            qw@zeroid.bit - 2016-03-07 - 2016-03-11\n  15 -                          quir@zeroid.bit - 2016-11-28 - 2017-07-09\n  15 -                       madcore@zeroid.bit - 2018-10-24 - 2019-01-20\n  15 -                        kagari@zeroid.bit - 2017-01-08 - 2017-01-18\n  15 -                    iiboard378@zeroid.bit - 2018-10-09 - 2018-10-29\n  15 -                      ethereal@zeroid.bit - 2018-11-12 - 2018-12-04\n  15 -                           dmi@zeroid.bit - 2017-02-12 - 2017-03-23\n  15 -                          brom@zeroid.bit - 2016-09-28 - 2018-04-23\n  14 -                     nicolaith@zeroid.bit - 2016-03-29 - 2018-10-26\n  14 -                        linxon@zeroid.bit - 2016-10-09 - 2017-09-14\n  14 -                            l8@zeroid.bit - 2018-05-23 - 2019-01-21\n  14 -                      hanamemo@zeroid.bit - 2017-05-06 - 2017-05-11\n  14 -                        difrex@zeroid.bit - 2017-12-05 - 2018-08-27\n  14 -                      cilician@zeroid.bit - 2017-09-30 - 2017-10-02\n  13 -                      requrequ@zeroid.bit - 2016-03-08 - 2016-03-10\n  13 -                   kirasokolov@zeroid.bit - 2018-04-07 - 2018-04-11\n  13 -                    hikikomori@zeroid.bit - 2017-04-23 - 2018-05-12\n  13 -                     cederbaum@zeroid.bit - 2019-01-26 - 2019-01-27\n  13 -                         cdoki@zeroid.bit - 2018-05-02 - 2018-05-02\n  13 -                      boozycat@zeroid.bit - 2018-09-11 - 2018-11-14\n  12 -                       varakin@zeroid.bit - 2017-05-12 - 2017-05-19\n  12 -                     tomfloyer@zeroid.bit - 2018-04-24 - 2018-05-01\n  12 -                         rumka@zeroid.bit - 2017-05-30 - 2017-06-27\n  12 -                       mangust@zeroid.bit - 2016-03-06 - 2016-03-06\n  12 -                      madcored@zeroid.bit - 2018-10-09 - 2019-01-14\n  12 -                       eosphor@zeroid.bit - 2016-03-05 - 2018-03-14\n  12 -                        amosca@zeroid.bit - 2018-04-09 - 2018-04-15\n  11 -                      zxmaster@zeroid.bit - 2016-09-12 - 2017-12-18\n  11 -                        zorg13@zeroid.bit - 2018-03-10 - 2018-09-19\n  11 -                       redfish@zeroid.bit - 2016-03-09 - 2017-09-10\n  11 -                      parallax@zeroid.bit - 2017-08-11 - 2018-01-14\n  11 -                     netchaser@zeroid.bit - 2016-03-09 - 2016-03-15\n  11 -                        ktotut@zeroid.bit - 2018-03-05 - 2018-03-06\n  11 -                  johnbyte1221@zeroid.bit - 2016-12-25 - 2016-12-30\n  11 -                    jamesjames@zeroid.bit - 2018-09-10 - 2019-01-24\n  11 -                        diomas@zeroid.bit - 2017-01-24 - 2018-12-11\n  10 -                          paps@zeroid.bit - 2017-08-27 - 2018-03-30\n  10 -                    ozzeransky@zeroid.bit - 2016-11-26 - 2016-12-10\n  10 -                 numberedpwnz2@zeroid.bit - 2018-02-22 - 2018-03-26\n  10 -                     krakodeal@zeroid.bit - 2018-06-06 - 2018-11-19\n  10 -                        jehmak@zeroid.bit - 2017-09-10 - 2017-09-19\n  10 -                      hugeping@zeroid.bit - 2017-12-01 - 2018-08-14\n  10 -                         get33@zeroid.bit - 2017-01-13 - 2017-01-16\n  10 -                        geobor@zeroid.bit - 2016-02-14 - 2019-01-20\n  10 -                  cocaineninja@zeroid.bit - 2018-12-03 - 2019-01-24\n```",
				"added": 1548657395
			},
			{
				"comment_id": 65,
				"body": "Насчёт модерации.\n\nТехнически, владелец сайта может модерировать контент, в том числе править чужие посты и полностью блокировать аккаунты.\n\nУ модерации есть 2 аспекта:\n\n* Модерация, направленная против отдельных нарушений правил.\n* Модерация, направленная против роботов.\n\nСо вторым в современной ZeroNet ничего сделать нельзя, т.к. цена создания аакуанта слишком мала - сколько роботы понапишут, ни один человек не успеет отмодерировать.\n\nИ тут есть психологический момент. 1-я категория проблем может переходить во 2-ю. При модерировании обычных форумов я с этим сталкивался. Обиделся пользователь на модерацию и пошел пакостить. Если на форумах можно ввести премодерацию, проверку по IP, капчу и другие методы, затрудняющие работу робота, то в ZeroNet - никак.\n\nТак что я вижу только 1 выход - не злить людей. Поэтому центральная модерация отпадает.\n\nБлокирование Mute-ом более мирный вариант, потому что пользователь никогда не знает, сколько людей его заблокировало.",
				"added": 1548676129
			},
			{
				"comment_id": 66,
				"body": "> Опять-таки похожая картина со списками сайтов. Для нового пользователя без связей такие списки сильно определяют какие сайты он увидит. В идеале было бы неплохо сделать возможность легко шарить свои списки с рекомендациями, но даже это не спасёт от замкнутых \"пузырей\", поэтому какой-то актульный список для создания изначального (предположительно хорошего) обзорного пузыря тоже был бы неплох\n\nЯ не думаю, что пузыри - это действительно плохо. А вот когда пузырь претендует на то, что быть всей сетью - это плохо.\n\nВ ZeroNet возможно сделать \"гугл\", но вот вопрос - будем ли мы счастливы, появлению \"гугла\"? Зато все при входе в сеть будут видеть единый пузырь и думать, что этот пузырь и есть - сеть...\n\nТо есть сейчас мы понимаем, что такие сервисы как ZeroSites или ZeroWiki дают лишь частный срез сети, и это только один из возможных каталогов сайтов. А в случае \"гугла\" плох не сам \"гугл\" как поисковая система, а то, как он порабощает наши умы. Помните, как раньше было много каталогов сайтов в clearnet, а потом они все стали неактуальны потому что есть всеобъемлющий гугл? А потом гугл стал цензурировать выдачу, и теперь пришла пора расчехлять каталоги сайтов обратно.\n\nПусть будет много \"пузырей\", соревнующихся за внимание пользователя.",
				"added": 1548676643
			},
			{
				"comment_id": 67,
				"body": "> Собственно, насколько я понимаю, одна из целей \"совета\" может заключаться именно в том, чтобы занять эту нишу группой (предположительно) независимых людей, а не каким-нибудь хорошо организованным любителем цензуры.\n\nКстати, что касается совета. У меня давно была идея, но всё было не до того. Немного другая идея...\n\nНужна площадка для общения, защищенная от DoS атаки на файлы в `data/users/`. Т.е. это подразумевает доступ по белым спискам и ручную модерацию. Но не с целью ограничить кого-то в правах, а именно для защиты от автоматических атак.",
				"added": 1548678704
			},
			{
				"comment_id": 68,
				"body": "Жаль deepstrelok куда-то пропал. Интересные материалы публиковал. Надеюсь, не подстрелили стрелка, и не сел никуда.",
				"added": 1548686392
			},
			{
				"comment_id": 69,
				"body": "Я сейчас сижу и сочиняю документ на английском... моего инглиша явно не хватает для составления документов формальным полуюридическим языком. Онлайн-переводчик мне в помощь...\nНужно как-то скооперироваться со всеми, не только с русскоязычными.",
				"added": 1548686520
			},
			{
				"comment_id": 70,
				"body": "> [quirrel](#comment_31_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): И каким именно образом кооперироваться с англоязычными?\n\nОбъединённый совет.",
				"added": 1548687046
			},
			{
				"comment_id": 71,
				"body": "> [quirrel](#comment_38_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Люди будут летать на Марс, а все ваши файлы останутся и никуда не исчезнут, пока хотя бы один сид раздает их.\n\nНу или квантовые вычисления хакнут ECDSA, и всё... xD",
				"added": 1548728140
			},
			{
				"comment_id": 72,
				"body": "zalex, хорошо, что ты здесь! 👍\n\n> [zalex](#comment_111_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Условно \"разделить\" ключ между авторитетными участниками так, чтобы решения могли приниматься коллективно, даже при отсутствии одного-двух участников. (возможно, части ключей стоит предоставлять даже не одному человеку, а бóльшиму числу людей (2-3), чтобы не потерять их навсегда, когда владелец уже ушёл от нас...)\n\nЭто неплохо, но это с нуля надо пилить фичу. Сейчас в ZeroNet есть немного другая фича: можно использовать другие ключи для подписи контента. При утере мастер-ключа производные админ-ключи смогут управлять сайтом, единственное, чего они не смогут - добавлять новые админ-ключи в список.\n\nТо есть время активной жизни сайта (с обновлениями движка, контролем за юзерами, модерированием) равно времени жизни автора + времени жизни последнего из админов, кого автор успел добавить. Если подойти к делу разумно, то лет 40-50, наверное, можно гарантировать. Думаю, этого достаточно.\n\nНо есть проблема. Я вот смотрю в код, и похоже, всё это немного не так работает, как хотелось бы. Нужно пилить багрепорты и патчи.",
				"added": 1548728807
			},
			{
				"comment_id": 73,
				"body": "> [zalex](#comment_111_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): ...\n\n> [anotherneko](#comment_121_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): ...\n\n> [quirrel](#comment_38_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): ...\n\n> [cederbaum](#comment_17_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): ...\n\n...ну и все остальные, лень кастовать все mentions...\n\nПарни, есть вот такая идея - http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?Post:1\n\nПока это просто черновик документа - «Кодекс», и не создано никакой инфраструктуры. Но примерный список того, что будет в инфраструктуре, виден по меню в боковой панели (ссылки пока никуда не ведут).\n\nКак я это вижу, это должна быть площадка, работающая по принципу классического интернет-портала: с явной регистрацией, а не просто \"заходи, кто хочет, делай, что хочешь\". Регистрация организована просто - у всех сертификатов по умолчанию лимит данных 0 байт, а у зарегистрированных пользователей - реальное ненулевое значение. Регистрация будет вручную: пользователь написал одному из админов (через ZeroMe или другой публичный ресурс), его добавили. (Нарушил правила поведения на форуме - исключили.)\n\nПланирую поднять полный набор ресурсов (форумы, почта, ZeroUp и т.п.) с максимально большими лимитами. (Для non-optional files - 1 гигабайт на пользователя. Просто не уверен, что движок обработает файлы большего размера. Для optional file - терабайты.) У нас будут все реальные пользователи, которые будут публиковать реальный контент - в этом смысл.\n\nЭто должен быть координационный совет, занимающийся развитием сети, и совету нужна надежная площадка для общения, устойчивая к атакам. Место, где можно обсудить разработку движков сайтов, анонсировать запуск новых проектов, делать плагины для движка ZeroNet и т.п. И попутно - просто хорошо модерируемый ресурс, не загаженный спамом.\n\nИ вместе с тем, как мне видится, совместными усилиями доведем до ума движки сайтов (форумный, блоговый, wiki), запилим разные продвинутые фичи - делать будем в первую очередь для портала, но так как это движки общего назначения, польза будет всей сети.\n\nБлижайшие этапы работы, как мне видится:\n\n* Обсудить черновик кодекса.\n* Запустить основные сайты портала.\n* Собрать начальную команду администраторов и убедиться, что мультиподпись работает. Если нет - запилить патчи.\n* Автоматически добавить в начальный список пользователей всех активных юзеров ZeroMe.\n* Сделать анонс проекта в ZeroTalks и ZeroMe.",
				"added": 1548734560
			},
			{
				"comment_id": 74,
				"body": "> [caryoscelus](#comment_37_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Вот этого точно делать не стоит. Не у всех есть желание (и возможность) скачивать и сидить гигабайты контента только потому, что это контент \"проверенных\" пользователей. Не говоря уже о том, что это сделает атаку очень простой (не надо регистрировать много пользователей)\n\nНо и отразить такую атаку не сложно.\n\nМожно сделать двух-, или даже трех- ступенчатую систему контроля объема.\n\nСкажем, начать с Limit 1 для новых пользователей. Через сколько-то дней автоматически переводить на Limit 2. А пользователей, имеющих большой вклад в развитие сети, - вручную на Limit 3.\n\nНапример, так:\n```\nLimit 1    1M\nLimit 2    50M\nLimit 3    1000M\n```\n\nС другой стороны, вот этого ручного управления я хочу по возможности избежать. Если все админы форума завтра склеят ласты, не успев никому передать права, сайты, пусть и без модерирования, должны быть доступны для пользователей достаточно длительное время, чтобы они могли прийти в привычное место, обсудить ситуацию, скоординироваться и постепенно перехать на новые адреса. Ситуация, когда на форуме 30К на пользователя, а админ пропал, как было тут до вчерашнего дня, — не должна повториться. (И хрен бы с этим форумом, но он включен во всякие вики, перелинкован с другими форумами и т.п.)\n\nФорумы Балансера хоть и без обновлений, но всё еще фунциональны. На Инфонези у меня потрачено около 50K из 500K, так что я смогу еще попостить туда с этого аккаунта.\n\nНо - такому открытому форуму, как Инфонези, грозит другая опасность - засиранее папки data/users/. Если бы это был блог, можно было бы добавить в ZeroNet какую-нибудь опцию грузить сайт без комментариев, и блог бы сохранил свою историческую ценность. А с форумом так просто не получится, т.к. там весь контент подписан сертификатами пользователей. Нужно будет вручную отфильтровать охулиард сертификатов для белого списка. (Еще сам белый список на стороне движка реализовывать, чего ZeroNet сейчас не умеет.)\n\nВ нашем случае я хочу немного затруднить попадание на форум, но зато у тех, кто попал, не будет проблемы нехватки места в критических ситуациях. Тут будет ситуация, обратная Инфонези - после окончательного армагедца новые пользователи на форум уже не попадут, зато форум продолжит работу с существующими, а по мере их миграции плавно превратится в исторический архив, без плясок вокруг белых списков.\n\nВ общем, нужно найти какой-то баланс...",
				"added": 1548742190
			},
			{
				"comment_id": 75,
				"body": "```\n \"includes\": {\n  \"data/users/content.json\": {\n   \"signers\": [],\n   \"signers_required\": 1\n  }\n },\n```\nСудя по этой записи, есть возможно вписать список валидных ключей для отдельных подкаталогов сайта. Если так, то нужно будет также весь код и ресурсы вынести в отдельный подкаталог `engine`.\n\nЭто означает, что есть возможность гибкого предоставления прав:\n\n1. Права на `data/users/content.json` — это права модератора. Возможность регистрировать пользователей, менять им лимиты, банить.\n2. Права на `engine/content.json` — это права администратора-разработчика. Возможность обновлять движок сайта.\n3. Права, подписанный в `signers_sign` в корневом `content.json`  — это права суперадминистратора. Возможность назначать на вышеперечисленные должности.\n\nНадо будет всё это проверить.",
				"added": 1548748168
			},
			{
				"comment_id": 79,
				"body": "caryoscelus, спасибо за конструктив!\n\n> А ситуация когда админов нет, а предположим какого-то заслуженного пользователя взломали и с его аккаунта сайт забивается гигабайтом мусора, тоже не очень-то приятная.\n\nЭто решается Mute-ом на уровне пользователей, т.е. ситуация неприятная, но не смертельная.\n\nБолее неприятно, что пропадут все данные пользователя. (Вот эту проблему нужно будет тоже отдельно решать. Я примерно понимаю, каким образом решать, но нужна поддержка со стороны движка ZeroNet, и нужно будет еще nofish-а убедить, что это проблема.)\n\n> [caryoscelus](#comment_40_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Я всё равно не понимаю, зачем может понадобиться больше 5-10М для неопционального текста (понятно, что ещё технический оверхед есть, но это опять же мелочи).\n\nЯ тебя услышал.\n\nНу скажем, «нутром чую», что место при интенсивном пользовании сайтами будет расходоваться быстро. Например, с тех пор как shift прибавил лимиты, я написал 30KB. А вроде ничего почти не писал.\n\nПредставь, что наше обсуждение идет в 2 раза активнее, и идёт 1-2 недели. Примерно килобайт 300 уйдёт только на него. В таком виде 5M уже не представляются бесконечным запасом. Особенно если обсуждать всякие технические детали, с длинными цитатами, примерами кода и т.п.\n\nДумаю, можно понаблюдать за динамикой расхода места и сделать более точные выводы.\n\n> Что касается самого документа. Я так понимаю, что это предполагается как \"правила\"? Потому что для \"манифеста\" слишком много внимания техническо-административным вещам и слишком мало – о целях. Думаю что для привлечения пользователей манифест важнее.\n\nСкорее, это черновик идеи, записанный в 2 часа ночи. :) Согласен, нужно разделить его на манифест и техническо-административную часть.\n\n> Дальше. Я не вижу большого смысла начинать с создания всех \"сервисов\"\n\nСписок сайтов - чтобы примерно очертить идею в голове. ~~И ужаснуться объему работ.~~\nПо сути, нам сейчас нужен только форум, посвященный самому проекту, а остальным обрастём по ходу дела.\n\nЯ вчера создал заготовки всех форумов, поставил доступ для всех и 100KB на пользователя. Можно начать пользоваться вот этим прямо сейчас - [Talks: Council's Services Support and Development](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/)\n\nЕще насчёт технической части - в идеале, нам нужна админка, которая ведет учёт пользовательских аккаунтов и автоматически формирует и записывает секцию permissions для `data/users/content.json`. Т.е. модератор тыкает мышкой в интерфейс, а под капотом происходит вся остальная магия. Ему останется только ввести приватный ключ для публикации изменений.\n\nНо это когда-то в будущем. А пока, я считаю, можно начинать работу в обычном общедоступном формате, привлекать людей и далее действовать по обстоятельствам.",
				"added": 1548865333
			},
			{
				"comment_id": 80,
				"body": "> [deliriumgoddesss](#comment_26_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): кстати, на западе началась кампания против зеронета.\n\nВ чем она заключается?",
				"added": 1548865600
			},
			{
				"comment_id": 81,
				"body": "> [gomzik](#comment_105_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Вот это я неожиданно вовремя заглянул.\n\n👍 Рад видеть вас!",
				"added": 1548871123
			},
			{
				"comment_id": 85,
				"body": "> [gluckman](#comment_27_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): И мне непонятна идея странного совета ZeroNet. \n\nhttp://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?Post:2",
				"added": 1548930588
			},
			{
				"comment_id": 86,
				"body": "> [gluckman](#comment_27_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Но зачем тут нужен орган центрального управления?\n\nРечь идет не об управлении.",
				"added": 1548930644
			},
			{
				"comment_id": 87,
				"body": "> [gluckman](#comment_30_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Стратегически - изучить и возможно создать инструменты мониторинга\n\nСкорее всего, проблема в маршрутизации между TOR и не-TOR множествами узлов.\n\n> [gluckman](#comment_30_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Прямо сейчас, в пределах дней или недель - могу поднять ноду в clearnet вне страны и скормить ей рускоязычные сайты, чтобы поддерживала их копии\n\n👍\n\nЯ создавал [специальный тред](http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/?Topic:1518520936_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/), чтобы можно было сидировать качественные ресурсы. Жаль, что тема пока развития не получила.\n\nСидировать автоматически всё подряд с ZeroSites не все рискнут. А вот в формате человеческого общения обмениваться ссылками в сообществе - другое дело.",
				"added": 1548936693
			},
			{
				"comment_id": 88,
				"body": "> [caryoscelus](#comment_41_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): geekless, ещё деталь по технической части: было бы неплохо добавить альтернативные центры сертификатов (во всяком случае, если делать белые списки, это не должно вызвать особых проблем со спамом)\n\nСпасибо! Да, думаю в этом же направлении. Но пока надо начинать с малого, доберемся и до этого вопроса. Проблема в том, что альтернативных центров сейчас просто нет. Их нужно будет делать самим, либо ждать, пока кто-то сделает. У krixano был, но он давно не появлялся в сети, может быть подзабил уже...",
				"added": 1548936951
			},
			{
				"comment_id": 89,
				"body": "> [geekless](#comment_75_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): \"includes\": {\n>   \"data/users/content.json\": {\n>    \"signers\": [],\n>    \"signers_required\": 1\n>   }\n>  },\n> Судя по этой записи, есть возможно вписать список валидных ключей для отдельных подкаталогов сайта. Если так, то нужно будет также весь код и ресурсы вынести в отдельный подкаталог engine.\n> Это означает, что есть возможность гибкого предоставления прав:\n\n\nПроверил эту идею. При вписывании в `signers` адреса пользовательского сертификата (например мой -  1GooUE19488nDwG3TdkM8seYAHct4gjkq4), всё прекрасно работает. Даже приватный ключ не требуется вводить, ZeroNet сама понимает, что у неё уже есть ключ.\n\nТ.е. теперь я могу на своих сайтах назначить любого пользователя модератором, просто добавив его в `signers`.",
				"added": 1548937319
			},
			{
				"comment_id": 90,
				"body": "> [caryoscelus](#comment_43_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): \n> А krixano:\n> > I feel like the internet and ZeroNet are making me talk less and less nicely with time... maybe I should stay off of it for a while...\n\nТочно, у парня нервы сдали. Жаль. Теперь я вспомнил.\n\n> [caryoscelus](#comment_43_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Вот, например, небольшой список. Аккаунты с kaffieid даже встречаются в дикой природе.\n\nkaffie, polar и прочие - это всё самоподписанные сертификаты, т.е. у них известен приватный ключ провайдера, и юзер сам себе выписывает имя. На любое имя можно выписать любое количество сертификатов.\n\nФактических провайдеров было три: zeroid, zeroverse, и kxoid. zeroverse тихо загнулся, во всяком случае, я не слышал историй успеха, чтобы кому-то удалось связаться с автором. Мне лень запускать еще одну ноду и ставить в неё плагин PeerMessage, чтобы проверить, работает ли сейчас kxoid.\n\nПлохо то, что фильтрация пользователей в правилах блока `permissions` в `content.json` производится по имени, но не по ключу.\n\nТ.е. прописывая лимит места на сайте для caryoscelus@zeroid.bit я хотел бы быть уверен, что выписываю его действительно тому, кто владеет адресом 13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE, а это не сервер zeroid-а хакнули и выписали миллион сертификатов на то же самое имя, и все эти сертификаты теперь мой сайт примет.",
				"added": 1548945343
			},
			{
				"comment_id": 91,
				"body": "Я идиот, адреса тоже поддерживаются:\n\n```\n        if user_address in user_contents[\"permissions\"]:\n            rules = copy.copy(user_contents[\"permissions\"].get(user_address, {}))  # Default rules based on address\n        else:\n            rules = copy.copy(user_contents[\"permissions\"].get(cert_user_id, {}))  # Default rules based on username\n```\n\ncaryoscelus, проверьте: [здесь](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1548753101_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/) у вас должно быть доступно 900K.",
				"added": 1548947700
			},
			{
				"comment_id": 92,
				"body": "> [caryoscelus](#comment_43_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): ...\n\nНемного переписал манифест и убрал технические детали:\n\nhttp://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?Post:1",
				"added": 1549012119
			},
			{
				"comment_id": 93,
				"body": "> [caryoscelus](#comment_44_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): ...\n\ncaryoscelus, вы согласны стать модератором на форумах Совета?",
				"added": 1549012154
			},
			{
				"comment_id": 94,
				"body": "Написал правила для форумов: http://127.0.0.1:43110/1fzncGxeyDpbCz1CkvBkooEDsXGFq1GfK/?Topic:1549008843_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/The+Forum+Rules",
				"added": 1549012339
			},
			{
				"comment_id": 95,
				"body": "> [x86128](#comment_8_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Разве форумы можно модерировать? Т.е. удалять и блокировать чужие посты ото всех остальных?\n\nДа, конечно. Владелец сайта может изменить и подписать своим ключом любой контент внутри сайта.\n\nВот с чем я поторопился - это не убедился, что ключ для `data/users/content.json` также распространяет своё действие на `data/users/подкаталог/content.json`. По логике, должен. Сейчас проверю.",
				"added": 1549014632
			},
			{
				"comment_id": 96,
				"body": "> [x86128](#comment_9_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): То есть технически, блокировка пользователя осуществляется по его ID внечением в определенный раздел content.json?\n\nБлокировка - да. После этого пользователь исчезнет с форума.\n\nА модерирование отдельных сообщений можно осуществлять прямой правкой сообщений пользователя и подписыванием их админским ключом.\nТ.е. право вносить изменения в подкаталог сайта - не эксклюзивное. Давая другому ключу (пользовательскому ключу) право подписывать контент, более старший ключ не лишается этого права.",
				"added": 1549015295
			},
			{
				"comment_id": 97,
				"body": "Вообще это для меня самого когда-то стало открытием: http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1538993787_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/\n\nНо если подумать, то это логично.",
				"added": 1549015404
			},
			{
				"comment_id": 98,
				"body": "> [geekless](#comment_95_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вот с чем я поторопился - это не убедился, что ключ для data/users/content.json также распространяет своё действие на data/users/подкаталог/content.json. По логике, должен. Сейчас проверю.\n\n~~Авотхрен!~~\n~~*Private key invalid! Valid signers: [u'175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo', '1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD'], Private key address: 1GooUE19488nDwG3TdkM8seYAHct4gjkq4*~~\n",
				"added": 1549016422
			},
			{
				"comment_id": 99,
				"body": "> [geekless](#comment_98_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Авотхрен!\n\nПоборол. Можно явно прописать signers:\n```\n \"user_contents\": {\n  \"cert_signers\": {\n   \"zeroid.bit\": [\"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\"]\n  },\n  \"content_inner_path\": \"data/users/content.json\",\n  \"optional\": null,\n  \"permission_rules\": {\n   \".*\": {\n    \"files_allowed\": \"data.json\",\n    \"max_size\": 200000,\n    \"signers\": [\"1GooUE19488nDwG3TdkM8seYAHct4gjkq4\"]\n   }\n  },\n  \"permissions\": {\n   \"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE\": {\"max_size\": 900000},\n   \"1GooUE19488nDwG3TdkM8seYAHct4gjkq4\": {\"max_size\": 900000}\n  }\n }\n```\n\nИтак, что мы имеем.\n\n* Админ может назначать супер-модераторов, которые могут править и удалять любые сообщения, банить и разбанивать пользователей, менять им лимиты, подключать к сайту новых поставщиков сертификатов; а также могут назначать простых модераторов.\n\n* Простые модераторы могут править и удалять любые сообщения, но не могут банить и далее по списку.",
				"added": 1549020853
			},
			{
				"comment_id": 100,
				"body": "> [x86128](#comment_10_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Получается cert_signers это супер-админы, а signers - модераторы?\n\ncert_signers - это провайдеры пользовательских сертификатов.",
				"added": 1549023279
			},
			{
				"comment_id": 101,
				"body": "> [x86128](#comment_10_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Получается cert_signers это супер-админы, а signers - модераторы?\n\nСупер-модератор прописывается в корневом `content.json` - т.е. в переводе на человеческий там будет написано буквально \"вот этот ключ имеет право изменять `data/users/content.json`\".\n\nТ.к. `data/users/content.json` определяет все основные правила работы с пользователями, супер-модератор может делать с ними что угодно.",
				"added": 1549023456
			},
			{
				"comment_id": 102,
				"body": "Составляю TODO по движку: http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1549014898_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/\n\nЧасть наработок обкатана в моём форке ZeroBlog-а, но вообще работы дофига.",
				"added": 1549025496
			},
			{
				"comment_id": 103,
				"body": "> [caryoscelus](#comment_46_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да, по мере сил ;) Впрочем, надеюсь, что люди будут адекватными и особо усердствовать не придётся.\n\nОтлично! Я вашему ключу дам соответствующие права. К сожалению, из средств модерирования пока есть только возможность вручную править файлы текстовым редактором и подписывать с указанием пути в правом сайдбаре ZeroNet. Но я надеюсь это исправить.\n\n> С одной стороны да, с другой – было бы столь же логично предупреждать пользователей о том, что сообщения подписаны не автором, а модератором. А так получается, что если модератор изменит, а юзер не заметит, то потом подпишет отредактированные изменения своим ключом :/\n\nДа, это потребуется реализовать. А лучше - подписывать каждую единицу форумных данных отдельно, как я написал в TODO.\n\nПомню, nofish не посчитал это значимым, поскольку \"владелец сайта может отображать на сайте что угодно, в том числе и при помощи подмены сообщений в JS\".\n\n> Вообще было бы неплохо сделать модерацию не изменением контента, а добавлением флага \"отмодерировано\" (собственно, можно и вовсе патчи накладывать).\n\nТоже в TODO :)\n\n> По правилам: у меня ощущение, что можно было бы сделать их лучше с точки зрения восприятия (условно говоря, мы хотим того-то и того-то, поэтому тех-то придётся банить); не знаю, насколько это реально и значимо, но как время освободится, попробую расписать конкретные предложения\n\nБыл бы вам крайне признателен!",
				"added": 1549030825
			},
			{
				"comment_id": 104,
				"body": "> [x86128](#comment_11_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Удалит ли это с вашего компьютера материалы спамера?\n\nНет, данные не удаляются.\n\nМне казалось, это было реализовано в одном из обновлений в прошлом году, но наверное ложная память. Проверил сейчас.",
				"added": 1549099157
			},
			{
				"comment_id": 105,
				"body": "> [caryoscelus](#comment_42_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Возможно, но сейчас такого нет. Вообще бывают такие сбои и как их отследить не очень понятно\n\nКстати, по этому поводу. Сеть гарантирует доставку контента только статистически, но не абсолютно. Возможна ситуация, когда множество узлов, раздающих сайт, распадаются на замкнутые подсети не из-за проблем сетевой связности, а чисто случайно. Допустим, в некоторый момент времени 10 узлов поддерживают коннект только друг с другом, и ни один из них не поддерживает коннект с остальной тысячей узлов. Просто так совпало.",
				"added": 1549101528
			},
			{
				"comment_id": 106,
				"body": "> [shift](#comment_380_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Господа,  а есть то какая версия zerobord с модерацией или еще нет? из проекта на полгода выпал\n\nВы хотели сказать, ZeroTalk? Нету, есть только мой todo на будущее.",
				"added": 1549165868
			},
			{
				"comment_id": 107,
				"body": "> [anotherneko](#comment_123_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Нет, контент не удаляется, но вроде как перестает обновляться.\n\nНе нашел в коде плагина:\n\n```\n@PluginManager.registerTo(\"SiteStorage\")\nclass SiteStoragePlugin(object):\n    def updateDbFile(self, inner_path, file=None, cur=None):\n        if file is not False:  # File deletion always allowed\n            # Find for bitcoin addresses in file path\n            matches = re.findall(\"/(1[A-Za-z0-9]{26,35})/\", inner_path)\n            # Check if any of the adresses are in the mute list\n            for auth_address in matches:\n                if filter_storage.isMuted(auth_address):\n                    self.log.debug(\"Mute match: %s, ignoring %s\" % (auth_address, inner_path))\n                    return False\n\n        return super(SiteStoragePlugin, self).updateDbFile(inner_path, file=file, cur=cur)\n\n    def onUpdated(self, inner_path, file=None):\n        file_path = \"%s/%s\" % (self.site.address, inner_path)\n        if file_path in filter_storage.file_content[\"includes\"]:\n            self.log.debug(\"Filter file updated: %s\" % inner_path)\n            filter_storage.includeUpdateAll()\n        return super(SiteStoragePlugin, self).onUpdated(inner_path, file=file)\n```",
				"added": 1549166861
			},
			{
				"comment_id": 108,
				"body": "> [quirrel](#comment_51_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Ну можете зайти и посмотреть. 95% процентов что есть, они убирали китайские топики в своё время.\n\nВручную. Скриптами, если быть точным.",
				"added": 1549295167
			},
			{
				"comment_id": 110,
				"body": "> [gomzik](#comment_114_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Надо бы набрасать роадмэп какой-то, я бы в свободное время может и подпиливал бы чего, а сейчас просто в РО сижу, слежу. Как-то тяжело мне на идеи, видимо больше исполнитель\n\nСегодня залью в Gitcenter репозиторий с моим форком ZeroTalk. Роадмап есть. Если хотите, присоединяйтесь.",
				"added": 1549444838
			},
			{
				"comment_id": 111,
				"body": "> [gomzik](#comment_115_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А во, заметил активность по ZeroTalk++, жду в GitCenter\n\nЗалил: http://127.0.0.1:43110/1H3qtUJRrghDHpY89CBeueVAZw8xbHuDLr/\n\nПока еще без каких-либо инструкций по развертыванию и разработке.",
				"added": 1549459365
			},
			{
				"comment_id": 112,
				"body": "> [nononono](#comment_9_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): \n\nТут посерьёзнее каша заваривается. Китайский спамер атаковал ZeroMe и ZeroTalk.",
				"added": 1549534993
			},
			{
				"comment_id": 113,
				"body": "> [caryoscelus](#comment_43_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Вот, например, небольшой список. Аккаунты с kaffieid даже встречаются в дикой природе.\n\nБыл не прав, когда сказал, что PolarID и PeakID - это самоподписанные сертификаты.\nОднако PolarID разрешает дубли имён.\n\nА вот PeakID - не разрешает.",
				"added": 1549538264
			},
			{
				"comment_id": 114,
				"body": "> [nononono](#comment_11_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): ZeroMe у тебя тормозит потому что ZeroMe сама по себе мегалагучая \"в дизайне\" дрянь.\n\nТам БД тормозит в основном.",
				"added": 1549551188
			},
			{
				"comment_id": 115,
				"body": "> [quirrel](#comment_64_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): И, насколько я знаю, блокирование не помогает: посты продолжают отображаться, но их раздача продолжется.\n\nОт замусоривания базы на локалхосте помогает. А вот от раздачи - нет.\n\nПопутно еще нашли баг с баном пользователей админом сайта. Не критично, но неприятно.\n\nТеоретически, всё это можно пофиксить прямо сейчас плагинами. В апстрим это не попадёт, пока nofish не портирует приложение на на python 3, но самим накатить пропатченную версию на локалхост ничего не мешает.\n\nА на практике, кто бы занялся. У меня сейчас нет времени.",
				"added": 1549561289
			}
		],
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 63,
				"body": "> [quirrel](#comment_24_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Так что хотелось бы просто загнать это всё в огороженные резервации, хотя бы.\n\nЕсть кнопка Mute.\n\nУж как-то надо определиться - за свободу слова или за цензуру.",
				"added": 1548642467
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 76,
				"body": "> [oob0imah](#comment_2_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): как сохранить те форумы, что он создал.\n\nФорумами сейчас кто-нибудь управляет? Хостинг под контролем?",
				"added": 1548825993
			},
			{
				"comment_id": 77,
				"body": "> [oob0imah](#comment_2_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): ...\n\nЕсли хотите, можете скопировать на Авиабазу мой пост отсюда: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:45\n\nВ ZeroNet с Ромой были знакомы люди из самых разных стран, поэтому я писал текст на английском.",
				"added": 1548826182
			},
			{
				"comment_id": 78,
				"body": "> [oob0imah](#comment_3_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): http://www.wrk.ru/support/2019/01/t106553_8--funktsionirovanie-aviabazy-bez-uchastiya-romy.html#p7114825\n\nО, вижу, что там Dimez помогает - это внушает оптимизм.",
				"added": 1548830325
			}
		],
		"35_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 82,
				"body": "> [quirrel](#comment_47_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): У вас что-то отображается?У меня пост пустой.\n\nЗаголовок же. «Как прикрутить Sphinx к zeronet»",
				"added": 1548899180
			},
			{
				"comment_id": 83,
				"body": "> [x86128](#comment_6_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Возможно это был вопрос :)\n\nТак много вопросов и так мало ответов :)",
				"added": 1548910359
			}
		],
		"4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 84,
				"body": "> [quirrel](#comment_44_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Замечательно. Вот это бы теперь закрепить, чтобы оно всегда висело на заглавной.\n\nНу, без shift-а этого не сделать, но если раз в пару недель постить сюда коммент, тема не будет проваливаться далеко вниз списка. :)",
				"added": 1548914473
			}
		],
		"5_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 109,
				"body": "> [quirrel](#comment_55_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): P.S. Только на раздачу встаньте.\n\nЯ всегда на раздаче. Через Tor.\nP.S. Пойду-ка заплачу за VDS, а то сижу 3-й день как дурак с погашенным сервером и без белого IP.",
				"added": 1549392770
			}
		],
		"1_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 116,
				"body": "Подойдут, но подключиться через них можно будет только к тем, кто сидит на белых IP. Ограничения те же, что у торрентов.",
				"added": 1549897467
			}
		],
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 117,
				"body": "На ЛОРе или на Хабре, не помню точно.",
				"added": 1556249994
			}
		],
		"1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 118,
				"body": "В локальной сети пиры сами находят друг друга.",
				"added": 1556444380
			},
			{
				"comment_id": 119,
				"body": "> [zerolespero](#comment_13_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): по идее они так должны делать, но сейчас проверяя это на виртуалках обьединенных в одну сеть, они не могут обнаружить друг-друга, хотя и виртуалки пингуются между собой. (виртуализация vmware workstation 15, объединение в сеть с помощью LAN сегмента, т.е. статическая маршрутизация без общего роутера/комутатора)\n\nТ.е. ты создал сайт на одной машине и пытаешься открыть на другой - и оно не работает?",
				"added": 1556477876
			},
			{
				"comment_id": 120,
				"body": "Вроде за локалку отвечает этот плагин: https://github.com/HelloZeroNet/ZeroNet/tree/master/plugins/AnnounceLocal",
				"added": 1556547127
			}
		],
		"4_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 121,
				"body": "> При этом не исключен вариант намеренного создания подобных зайтов со стороны карательных органов, с целью преследования пользователей сети.\n\nВот и товарищ майор зарегался в ZeroNet.\n\n> (привет, JS!)\n\nПодробнее с этого места.",
				"added": 1561308149
			},
			{
				"comment_id": 122,
				"body": "> [ultraviolet](#comment_1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): 3. Не посещайте явно противозаконные ресурсы:-)\n\nНапример, этот. :D",
				"added": 1561308193
			}
		],
		"1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 124,
				"body": "В абсолютном смысле счастье недостижимо. Если устранить все факторы стресса, то неизбежна деградация личности.",
				"added": 1561345676
			},
			{
				"comment_id": 127,
				"body": "> [caryoscelus](#comment_63_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Разве деградирующая личность не может быть абсолютно счастлива?\n\nТолько если под наркотой?..\n\nДумаю, всё равно человек существо социальное, и встроенный индикатор \"по меркам общества я деградирую\" будет сигналить.",
				"added": 1561366642
			},
			{
				"comment_id": 128,
				"body": "> [caryoscelus](#comment_64_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Чтобы не было социальных проблем, деградировать надо в обществе себе подобных, счастливых и деградирующих ^_^\n\nСделали мой день!",
				"added": 1561368945
			},
			{
				"comment_id": 129,
				"body": "> [if0](#comment_56_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Именно. Простейший рецепт \"счастливого общественного согласия\": всегда поступать \"как сделают все\", не выделяться, иметь мнение, совпадающее с окружающими, критически продумывать и оценить каждый свой поступок с точки зрения мнения окружащих, со всеми соглашаться и под всех подстраиваться и безропотно принимать все происходящее вокруг - \"как должное\".\n\nЕсли кто-то в среднем продвинутее своего окружения, он будет более приспособлен к жизни и активен. А будучи таким, он в столкнётся с теми, кто ему равен по прогрессу, и между ними развернётся борьба на равных. Это, мать её, эволюция. :)",
				"added": 1561379371
			},
			{
				"comment_id": 130,
				"body": "А конкретно на этом форуме, после того как владелец выставил всем лимит в 20000k, мне ничего не мешает быть счастливым. :D Пока не вылезли другие проблемы масштабируемости и устойчивости к атакам у этой технологии.",
				"added": 1561379481
			},
			{
				"comment_id": 131,
				"body": "> [stainlessrat](#comment_1_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): Биологические особенности человеческого организма уже давно играют меньшую роль в вопросах успешности индивида, чем его социальная роль и место в иерархии, а так как место в иерархии вполне передаётся \"по наследству\" то возникает иллюзия действия эволюционных сил в обществе.  Но это именно иллюзия, скорость эволюции много меньше скорости социальных изменений.\n\nЯ говорил о социальной эволюции. По наследству автоматически передаётся власть, но не способность ею распорядиться. Важная особенность - передача социальных навыков детям научением. Эта передача имеет достаточно низкую эффективность, поэтому среди тех, кто имеет равный старт (примерно одинаковый уровень доступа к деньгам, власти и т.п.), конкуренция главным образом осуществляется между методами передачи социальных навыков. Один богатый ребенок станет олигархом, а другой умрёт наркоманом в 20 лет. Или иначе: один сын бедного инженера станет владельцем бизнеса, а другой всё так же наркоманом. Тут играют роль и биологические факторы, и культурные.",
				"added": 1561380514
			},
			{
				"comment_id": 132,
				"body": "> [if0](#comment_53_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): На смену \"бытового\" стресса придет \"творческий\", который спасет от деградации.\n\nБез нижних этажей верхние не держатся.",
				"added": 1561380647
			},
			{
				"comment_id": 133,
				"body": "(Вот сейчас бы хоп - и отделить от этого треда ветку про социальную эволюцию. Всё же не хватает опций модерирования в движке.)",
				"added": 1561380996
			},
			{
				"comment_id": 135,
				"body": "> [if0](#comment_61_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Продвинутость и социальная значимость в современном обществе определяется уровнем неразумного потребления. \n\nЭто вам внушили более успешные, чтобы вы либо потребляли (если внушитесь \"этак\") на благо корпораций, либо брезговали всем этим и сидели в темном углу (если внушитесь \"вон так\"), но не пытались реально конкурировать.",
				"added": 1561383853
			},
			{
				"comment_id": 136,
				"body": "> [if0](#comment_62_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): При пяти активных пользователаях данного форума, врядли это грозит. Вот будь их количество и активность, хотя бы такой, как на опеннете...\n\nТеорема Ру-Зеронета))\n\n«При любых условиях число одновременно дискутирующих участников на форуме не превышает пяти.»",
				"added": 1561383931
			},
			{
				"comment_id": 137,
				"body": "> [if0](#comment_63_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Конкурировать за что?\n\nЗа власть, в частности.",
				"added": 1561383961
			},
			{
				"comment_id": 138,
				"body": "> [if0](#comment_64_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Что такого особенного дает власть кроме возможности еще более разнузданного потребления?\n\nЕсли вы других опций не видите, то вам - ничего.",
				"added": 1561384083
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 125,
				"body": "> [ultraviolet](#comment_7_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): В СССР при всех его особенностях учитывались интересы большего количества жителей страны чем во времена монархии.\n\nМеньшего, чем если бы РИ нормально эволюционировала в национально-буржуазное государство наподобие Франции, а не этот красный уголок.",
				"added": 1561357797
			},
			{
				"comment_id": 126,
				"body": "> [ultraviolet](#comment_22_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Знаю тяжело признаться себе, что точно такие же люди добились гораздо большего уважения к себе и учёта своих интересов.Но лучше горькая правда.\n\nУ меня сложилось впечатление, что вы о разных вещах говорите. Демократия - это механизм назначения формальной власти, а промывка мозгов - процесс формирования стимулов у того самого демоса, который эту формальную власть изберёт. Одно не противоречит другому.",
				"added": 1561363892
			},
			{
				"comment_id": 134,
				"body": "> [ultraviolet](#comment_27_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Есть объективные цифры показывающие огромное превосходство СССР над РФ или над странами запада.  Вы в курсе, что в США нет бесплатной медицины или высшего образования?  В СССР это была норма как минимум с начала 50-ых. Вернее даже раньше, но тогда не охватывало всю страну.\n\nСША живо, а СССР уже нет -- была ли по Сеньке шапка с бесплатными медициной и ВО? Промышленность СССР активно заимствовал с Запада, но во многих областях сформировать собственной инженерной и научной школ не смог, так и оставаясь на искусственной вентиляции легких до самого распада. Устойчивой воспроизводимой культуры, кроме культуры гэбистов, в СССР так и не завелось.",
				"added": 1561383682
			},
			{
				"comment_id": 139,
				"body": "> [ultraviolet](#comment_29_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Падение Венецианской Республики или Флоренциии или распад Ганзы не стало концом капитализма. Падение СССР также не является запретом на существование в будущем других социалистических обществ.\n\nЯ не утверждаю, что социалистический строй по своей сути эволюционно менее приспособлен, чем капиталистический, но у меня нет и оснований полагать обратное. Пока все реальные исторические примеры будто бы подтверждают эту закономерность. В то же время, сама природа человека, насколько я её понимаю, подталкивает к капитализму, но не к социализму. Для социализма с человеческим лицом, а не с гэбистами, нужен такой существенный сдвиг в социальных навыках и культуре абсолютного большинства граждан, что сложно даже фанатазировать, сколько столетий для него потребуется.\n\n> Причины падения этого общества столь же необычны как и его природа.\n\n«Продались за джинсы и 100 сортов колбасы»?",
				"added": 1561384688
			},
			{
				"comment_id": 140,
				"body": "> [if0](#comment_66_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Это - идеализм, не имеющий ничего с окружающей реальностью. Люди, как минимум, сами должны захотеть, что бы их уважали, но они предпочитают терпеть. Их все устраивает. Для борьбы надо четко осознать ее цель, но когда она излишне абстрактна, находится совсем мало желающих за нее бороться.\n\nСоглашусь.\n\nСмотрю видео, где блоггер пришел в магазин выявлять просрочку, а его хуесосят отнюдь не продавцы — **покупатели**.\n\nЭто общество заслуживает той власти, которая его имеет.",
				"added": 1561384807
			},
			{
				"comment_id": 141,
				"body": "> Основание социализма - не психологические и не моральные а экономические.\n\nЭкономические основания следуют из характеристик человека как экономической единицы — как он принимает решения, чем руководствуется. Поэтому пока человек то, что он есть, что-то тут фантазировать смысла нет.\n\nЕсли же говорить о других объективных факторах, влияющих на экономику:\n\n> Конкретно следующие - конечность количества людей на планете => конечность рынков => падение нормы прибыли / устремление периода окупаемости любого проекта в бесконечность\n\nТо как из этого следует переход к социализму?\n\n> Неспособность руководства СССР одновременно снижать уровень отчуждения труда, управлять вложениями в условиях когда период возврата инвестиций стремился в бесконечность и ограниченности трудовых ресурсов (людей в СССР было всего 250 миллионов).\n\nЕсли перевести с марксистской тарабарщины на простой язык, то же самое и получится. Людям надо было 100 сортов колбасы и Жигули 6-й модели, а не вот это всё. \"Людям\", кстати, означает и руководству государства тоже, они же не инопланетные роботы вне экономической модели.\n\nА ограниченность трудовых ресурсов ставит крест на утопиях, которые рассматривают сферическое производство в вакууме.",
				"added": 1561386397
			},
			{
				"comment_id": 143,
				"body": "> [ultraviolet](#comment_38_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): [...]\n\nОписание того, что капитализм живучее социализма.",
				"added": 1561391157
			},
			{
				"comment_id": 144,
				"body": "> [ultraviolet](#comment_38_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): [...]\n\nФактически, вы описываете понятное явление: крах корпорации в условиях неэффективного управления. Если рассматривать СССР как предельный случай мега-корпорации, которая загнулась на основе обычных законов рынка, то всё ясно. Если наполнить это мистическими заклинаниями по Марксу, получается небывалое явление. Но зачем, если бритвой Оккама можно порезать избыточные теории.",
				"added": 1561391737
			}
		],
		"2_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 142,
				"body": "> [ultraviolet](#comment_36_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Попробую опубликовать все номера на ZeroUp unlimited\n\nТам можно быстро упереться в ограничение размера метадаты, это только в названии он unlimited.",
				"added": 1561386657
			}
		],
		"2_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [],
		"1_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 146,
				"body": "> [ultraviolet](#comment_2_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Для шифрования используйте ключевой файл или даже набор файлов которые можете уничтожить например сломав флешку. Да и сам ключевой файл должен лежать в куче других файлов\n\nСломать флешку? Так и представляется сцена из фильма, где хакеры дружно кидают носители информации в микроволновку, а сами сбегают через секретный коридор ровно за секунду до того, как группа захвата выбьет двери.\n\nВ реальной жизни попробуйте сломать флешку за секунды, пока вам выбивают дверь. Не корпус, а чип.",
				"added": 1561443494
			}
		],
		"6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 147,
				"body": "> [ultraviolet](#comment_44_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): А что за сайты были?\n\nВсе не помню, неполный список:\n\n* http://127.0.0.1:43110/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/\n* http://127.0.0.1:43110/1CVmbCKWtbskK2GAZLM6gnMuiL6Je25Yds/\n* http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/",
				"added": 1561458368
			},
			{
				"comment_id": 148,
				"body": "> [ultraviolet](#comment_47_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): А что за тематика?\n\nКаталог сайтов, соцсеть типа хабра, видеохостинг.",
				"added": 1561458872
			}
		],
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 149,
				"body": "> [ultraviolet](#comment_51_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Это свойство можно  использовать и на пользу.  Для того, чтобы доказать авторство сообщения придётся доказывать НЕ вмешательство владельца сайта. \n\nВ теории, в идеальном суде.",
				"added": 1561461735
			},
			{
				"comment_id": 150,
				"body": "> [ultraviolet](#comment_53_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): В качестве идиотской идеи. Можно добавлять в свои сообщения подписанную приватным ключём контрольную сумму.\n\nИдея не идиотская на самом деле. В моих далеких планах реализация возможности подписывать отдельные ветки внутри JSON прямо средствами движка форума. Каждая сущность (\"комментарий\", \"топик\") будет иметь подпись, которая \"слетает\" при вмешательстве админа. Ядро не дает API для этого, нужно будет запилить плагин. Пока идёт миграция на 3-й питон, нет смысла браться за плагин, но после стабилизации кодовой базы можно попробовать.\n\nНу и подписывание сообщений в явном виде, как в обычном email, тоже никто не отменял. :)",
				"added": 1561465559
			},
			{
				"comment_id": 151,
				"body": "> [ultraviolet](#comment_52_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): > Вот на этот вопрос и будет отрицательный ответ:-)\n\nЕсли данные подписаны владельцем сайта - да. А если там подпись пользовательского сертификата, и владение этим сертификатом конкретным лицом уже доказано, нужна дальнейшая защита.",
				"added": 1561465789
			},
			{
				"comment_id": 153,
				"body": "> [ultraviolet](#comment_56_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Вижу коммерческую ценность Вашей идеи. Форум для ведения коммерческих переговоров.\n\nКруто. Под таким углом я не смотрел.\nТогда необходима также поддержка хабов, чтобы каждая сторона могла безопасным образом сохранять копии сообщений других сторон в качестве доказательства.",
				"added": 1561466643
			},
			{
				"comment_id": 154,
				"body": "Типичные комментарии [в топике с вопросом про реализацию модерации](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1552760858_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg/):\n\n> Doesn't that contradict the point of zeronet?\n.\n> please keep you moderated shit for the clearnet\n.\n> If we wanted moderation, we would be on reddit, were we can be shadow-banned without any explanation given.\n\nНикакие технологии не могут исправить безграмотность. Люди прочитали про \"free and uncensorable websites\" на главной странице проекта и верят этому. А что там под капотом — зачем об этом задумываться, им ведь пообещали, что всё хорошо.\n\n(Хотя и в шапке сайта обещали только нецензурируемые сайты, а совсем не комментарии на форуме.)",
				"added": 1561467033
			},
			{
				"comment_id": 155,
				"body": "> [if0](#comment_76_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Предлагаю рассмотреть возможный сценарий:\n> \n> Тов. майор создает зайт с экстремистким содержанием.\n> Добавляет туда фейковые посты от имени пользователя против которого захочет сфабриковать дело.\n> Предоставляет этот зайт в качестве доказательства проивоправных действий указанного пользователя.\n\nНе настолько тривиально. Сначала нужно заманить пользователя на реальный зайт, чтобы он там что-нибудь писал, потом незаметно исправить часть его постов, дождаться, когда он, не заметив подвоха, напишет что-то еще, поставив тем самым корректную подпись - и вот тогда заводить дело.",
				"added": 1561489031
			},
			{
				"comment_id": 156,
				"body": "> [if0](#comment_78_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Только остается непонятным: каким образом фейковые сообщения смогут попасть на диск пользователя (для того, что бы быть подписанными вместе с новым сообщением), перед отправкой нового сообщения?\n\nВладелец сайта подписывает `data/users/<user_id>/content.json` своим корневым ключём, и апдейт расходится по узлам обычным образом, попадая на машину к владельцу `<user_id>`. Пользователь, не замечая подвоха, лайкает пост или пишет коммент, и voi-la, в следующем апдейте подложные данные уже оказываются подписаны пользователем.",
				"added": 1561513438
			},
			{
				"comment_id": 159,
				"body": "> [stainlessrat](#comment_3_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): А есть ли способ отзыва своего ключа в случае его хищения?\n\nНету.",
				"added": 1561538627
			},
			{
				"comment_id": 160,
				"body": "> [stainlessrat](#comment_4_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): Вот и идея.\n\nТехнически неосуществимо в текущей архитектуре.",
				"added": 1561540090
			},
			{
				"comment_id": 161,
				"body": "> [stainlessrat](#comment_5_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): Да нет вроде ничего сложного. Просто форум на котором каждый может написать - я отзываю свой ключь.\n\nНаписать при помощи отозванного ключа?",
				"added": 1561541142
			},
			{
				"comment_id": 162,
				"body": "> [stainlessrat](#comment_6_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): До момента публикации ключь формально действующий, после нет.\n\nЛицорука! Вы по какой причине его отзываете? По причине компроментации приватного ключа. И этим же приватным ключом подписываете отзыв? Ну прикольно, злоумышленник следом просто сотрёт ваш отзыв, все дела.\n\n> Собственно именно так и работает отзыв сертификатов в PKI\n\nОтзыв сертификатов происходит ключом, выдавшим сертификат. Это вам надо на поклон к @nofish идти, на личную встречу с паспортом, чтобы он написал \"отзываю сертификат stainlessrat\" и подписал эту строчку своим мастер-ключом ZeroID. Вы так себе анонимную сеть представляете?",
				"added": 1561544461
			},
			{
				"comment_id": 163,
				"body": "> [stainlessrat](#comment_7_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): Значит предусматриваем логику согласно которой отправить сообщение на форум можно только раз, после он с тем же ключём сообщения не примет.\n\nВ ZeroNet технически неосуществимо.",
				"added": 1561544936
			},
			{
				"comment_id": 164,
				"body": "> [stainlessrat](#comment_8_14TFq8NmtKS3GG9briTFV874KdxJkVLhzB): я специально не разбирался, но мне сложно представить, чтобы это было принципиально нереализуемо.\n\nМожно, конечно, предположить такой протокол передачи апдейтов, в котором некоторые сущности разрешено только дописывать, а не редактировать. И узлы откажутся принимать апдейт файла, если в нём неперезаписываемая часть изменилась. Но на данный момент ничего подобного не реализовано.\n\nТак что для такой фичи потребуется либо переделка логики ядра ZeroNet, либо отказ от децентрализации в пользу выделенного сервера.",
				"added": 1561552045
			},
			{
				"comment_id": 165,
				"body": "> [anotherneko](#comment_163_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Разве в zn пользователь может полностью удалить свой content.json? На мой взгляд можно сделать технический зайт, наличие на котором content.json пользователя с любым содержимым или без него будет означать отзыв ключа.\n\nКак раз обдумывал эту идею.\n\nПользователь не может удалить, только владелец сайта - забанив.",
				"added": 1561567517
			},
			{
				"comment_id": 166,
				"body": "> [anotherneko](#comment_163_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): с любым содержимым или без него будет означать отзыв ключа.\n\n\\+ Обязательно с подписью самого сертификата пользователя, а не кого попало. :)",
				"added": 1561567603
			},
			{
				"comment_id": 167,
				"body": "Можно даже сделать некий аналог блокчейна, с записью по 1-му биту информации на файл. o_O",
				"added": 1561567734
			},
			{
				"comment_id": 168,
				"body": "> [if0](#comment_80_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А что если каждый пользователь будет хранить все свои сообщения на своем специальном техническом зайте? Другие пользователи, которые захотят видеть его сообщения должны просто загрузить его себе, как хаб.\n\nХочу именно к такой архитектуре прийти, ковыряя потихоньку код ZeroTalk.",
				"added": 1561570208
			},
			{
				"comment_id": 169,
				"body": "> [if0](#comment_82_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): [...]\n\nПотому что сначала было тяп-ляп для демонстрации возможностей API, а потом пошло-поехало. Nofish так-то ядро пилит, ему некогда еще и сами приложения писать. Все эти движки сайтов назывались у него (да и сейчас наверное называются) демонстрационными.\n\nБолее существенная причина в том, что хабы всё равно нужны для того, чтобы пользователи могли друг о друге узнать - иначе получается идеальная (полностью закрытая) схема белого списка: «чтобы узнать о чем-то, ты должен сначала узнать об этом где-то в другом месте, а у тебя для этого каналов связи нет». Ну а в модели «каждый сам себе хранилище» роль хабов сводится к кэшированию нескольких самых свежих записей пользователя. Чтобы другой пользователь мог увидеть «о, вот это интересно, подпишусь-ка на него целиком».\n\nПока я себе это представляю так, что у нас должны быть отдельно:\n\n* Движки с совместимыми форматами данных (как у ZeroMe существует штук 5 фронт-эндов с немного разными функциями), чтобы можно было свободно выбирать, чем пользоваться, как человек выбирает между разными браузерами или текстовыми редакторами.\n* Коллективные хабы для свежих записей. (Вероятно, тематические,  а не как в ZeroMe).\n* Личные хабы для хранения всех записей пользователя.\n\nДвижки ZeroTalk, ZeroBlog, ZeroWiki, ZeroUp сливаются в одно целое, покрывающее все эти юз-кейсы; морда ZeroHello берёт на себя функции аггрегатора, ленты новостей и соцсети (собственно, она и сейчас это делает, но всё портит ZeroMe, который в её модель работы не вписывается). ZeroMe становится ненужен, его хабы вымирают, либо транформируются в тематические ленты новостей.\n\nКак минимум год вынашиваю эту идею.",
				"added": 1561572305
			},
			{
				"comment_id": 170,
				"body": "(Тем временем, я на [ZT++](http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/) запилил таки фикс надоедливого бага с неправильным позиционированиепм stickied топиков. Уже нет сил даже себе в блог заметку кинуть на этот счёт, пойду лучше посплю. X-) )",
				"added": 1561572741
			},
			{
				"comment_id": 172,
				"body": "> [anonymouslogin](#comment_18_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): WOW, код не смотрелся, но:\n> \n> zeronet разрешит переподписать(пользователю) content.json в котором другой cert_sign и cert_user_id ?\n> проверки по директории <user_id> нет?\n> \n> пользователь точно перезагрузит(подписанный владельцем сайта) content.json при наличии старого content.json? (была похожая ситуация и zeronet не хотел подгружать)\n> \n> багрепорт на github?\n> \n> Если по всем пунктам фейл, то любой(даже не владелец) может устроить такой финт, достаточно знать <user_id> жертвы, вручную подписать от любого имени content.json с новым modified и нужным текстом в data.json, отправить пирам..\n\nНет, от балды подписать одним сертификатом другой произвольный, разумеется, нельзя.\n\nПодписывание внутри сайта организовано по иерархическому принципу. Мастер-ключ даёт право подписывать подкаталог другому ключу, но сам этого права не лишается. Это простейший случай с двумя ключами, а их может быль больше, ядро достаточно гибкое, чтобы можно было ввести роли \"модератора контента\" или \"модератора по банам\" для отдельных ключей.\n\nВ верхнеуровневом `content.json` задаются правила, которым должны соответствовать подчинённые `content.json`, и эти правила подконтрольны владельцу сайта, поэтому нет смысла вводить какие-то защиты на уровне ядра, предназначенные защищать от владельца. Тем более, что владельцу подконтролен и JS-код, поэтому он может подменить данные в интерфейсе, если захочет.\n\nВозможны и другие финты. Например, владелец может отозвать все права у сертификатов, и вместе с тем переподписать все их данные своим ключом, переведя весь сайт в режим read-only.\n\nИз всего этого следует таковый вывод, ИМХО: Мы используем инструменты не по назначению. Отдельно должен быть код (\"приложения\"), отдельно личные данные пользователей (\"персональные сайты\"), отдельно коллективные данные (\"тематические агрегаторы\"). Существующие движки в такое не могут, но ядро все нужные API даёт. Нужно въёбывать и писать код, создавать новые движки.\n\n\"Классический\" централизованный форум в ZeroNet тоже возможен и в каких-то случаях оправдан, например, если это официальный сайт какой-то организации. Я сейчас концентрируюсь именно на централизованном варианте, потому что это вещь известная из опыта, и понятно, как её создать. А потом добавлю туда шардирование для перехода на модель с персональными хабами.\n\nМеня расстраивает, что люди подменяют техническую возможность свободы слова пустыми лозунгами про свободу. Сидят на ZeroTalk и кукарекают о свободе. Ну-ну.",
				"added": 1561793634
			},
			{
				"comment_id": 173,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1538923063_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr#comment_1196_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj\n\n> nofish ━ on Oct 08, 2018\n> You can edit the data.json file in the data/users/ directory (eg. remove the comment), then open sidebar, at the bottom enter the user's content.json file, then sign/publish it using the site's private key",
				"added": 1561793903
			},
			{
				"comment_id": 228,
				"body": "> [tridvaraz](#comment_2_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd): а мне интересно стало, если кто-то создаст аналог гидры то как его будут удалять?\n\nАналог чего?",
				"added": 1562684126
			},
			{
				"comment_id": 230,
				"body": "> [tridvaraz](#comment_3_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd): ну сайт где продают нарокоту и оружие и прочую запрещённую фигню\n\nПоймать владельца и выпытать приватный ключ.\n\nПринуждает государство ловить реальных преступников, а не заниматься имитацией бурной деятельности закрывая их сайты. Будто наркота от сайтов заводится, а не от тех, кто её производит.",
				"added": 1562684545
			},
			{
				"comment_id": 231,
				"body": "> [tridvaraz](#comment_4_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd): \n\nНет, без ключа на контент повлиять нельзя. Если владелец сайта не будет поддерживать раздачу (помер, например), а в мире больше не нашлось желающих хранить у себя копии, то сайт умрёт естественным путем. Иначе никак.\n\nЕстественный отбор.",
				"added": 1562685045
			},
			{
				"comment_id": 232,
				"body": "@tridvaraz:\n\nСайты продолжают функционировать без владельца: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:45",
				"added": 1562685305
			},
			{
				"comment_id": 233,
				"body": "FreeNet только для статических сайтов, и он сам скорее мертв, чем жив. Под капотом некоторые механизмы интересные, можно в ZeroNet украсть.\n\nGNUNet еще в живые и не выбирался, сколько там, тысяча узлов наберётся на всю планету?\n\nNetsukuku немного из другой области. И кстати вроде тоже помер.\n\nТак что...",
				"added": 1562685830
			},
			{
				"comment_id": 234,
				"body": "> [tridvaraz](#comment_7_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd): надо в настройках зеро или достаточно поднять тор на роутере?\n\nЕсли в настройках зеро поставить режим всегда через тор, этого в принципе достаточно, чтобы пиринговой сети не разгласить свой настоящий IP. Но как всегда, остаётся возможность вычислить человека по другим характерным признакам, или через трояны и дыры в софте.\n\nВот тут я писал разные про способы подключения и что они дают: http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/?Post:5\nЕсли кратко, для обычного пользователя, сидящего за файрволом провайдера, нет смысла использовать режимы, отличные от \"всегда тор\".",
				"added": 1562688414
			}
		],
		"3_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 152,
				"body": "По 282-й в основном сажают для галки и красивого отчета, а не ради борьбы с оппозицией или активистами. С активистом свяжешься, так может это боком выйти. Обычного гражданина посадить проще.",
				"added": 1561466033
			}
		],
		"1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 157,
				"body": "Встал на раздачу.\n>  фобия постить новые темы на форумы\nЧто-то новенькое. :)",
				"added": 1561529082
			},
			{
				"comment_id": 158,
				"body": "Сайты жалуются, что `Layout default not found`.",
				"added": 1561529235
			}
		],
		"1_1NxH7JC6pHRkfyzg8fX7bKwdbEA3gCnkuk": [
			{
				"comment_id": 171,
				"body": "Ну ты же старый `users.json` сохранил перед этим? Если master seed указан верно, при заходе на zeoid.bit, он должен активировать аккаунт.",
				"added": 1561723230
			}
		],
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 174,
				"body": "> [if0](#comment_84_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Что в полной мере компенсируется тем, что его смогут увидить ровно пять человек. (Простите, не удержался от сарказма, слишком пафосно звучало :-)\n\nДа так и есть, но этот trade off многие упускают...",
				"added": 1561798737
			},
			{
				"comment_id": 179,
				"body": "> [dalida](#comment_2_1JXt6o6VHCEur5cAv2P3tmywxCz36r5u8q): solid\n\nК самому проекту я настроен скептически. Тим Бернерс-Ли решил попиариться (и попилить гранты?). \n\nНо идейно проект интересный, и как раз на архитектуру ZeroNet ложится хорошо.\n\nВот, кстати, что я год назад писал на счёт того, как можно организовать ресурсы коллективного авторства: http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/?Topic:1522504967_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1561871033
			}
		],
		"1_18Pv6KgZ4tNPHBLMxtDZbH7j4Hi6rpwEvP": [
			{
				"comment_id": 175,
				"body": "Оригинал + сабы рулят.",
				"added": 1561802942
			}
		],
		"4_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 176,
				"body": "Помогай пилить движок форума: http://127.0.0.1:43110/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/",
				"added": 1561810164
			},
			{
				"comment_id": 177,
				"body": "> [dude](#comment_71_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Нужно делать людей\n\nЧто делают в Бурятии? - Бурят, однако.",
				"added": 1561810232
			},
			{
				"comment_id": 178,
				"body": "> [if0](#comment_87_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Оверинженеринг с целью унификации: \"все есть зайт\", даже в случаях когда это не требуется.\n\no_O\n\nУникальное понимание слова оверинженеринг.",
				"added": 1561821010
			}
		],
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 180,
				"body": "Прикольная идея прикрутить к ZeroUp красивую морду. Нужно бы оформить такую штуку в виде самостоятельного движка - чтобы снаружи красивое оглавление, а под капотом ZeroUp. Можно было бы делать тематические подборки о чем угодно, по красоте оформления и удобству торренты сосали бы.",
				"added": 1561994289
			},
			{
				"comment_id": 181,
				"body": "Сидировать mp3 не буду, т.к. аудиокнигами не интересуюсь, но на раздачу витрины встал.",
				"added": 1561994430
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 182,
				"body": "> [gitcenter](http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/?Topic:1562004913_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di#comment_15_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Цель -- не сказать, какая сеть плохая. Цель -- улучшить ZeroNet. \n\nДавай так: ты готов поддерживать дистрибутив ZeroNet, который будет **лучше** официального?\n1. Более частые релизы.\n2. Оперативные фиксы багов.\n3. Больше фич, доработанные плагины.\n\nЕсли нет,о каком улучшении сети можно говорить? В ином случае всё это на потрепаться. Почему у меня ощущение, что ты хочешь бюрократическими процедурами \"улучшить\" инфраструктуру, вместо фактической работы над этой инфраструктурой?\n\nАльтернативный дистрибутив, которому половина сети доверят так же как nofish-евскому - это реальное повышение надежности сети. Заведение бюрократии - нет.",
				"added": 1562039726
			},
			{
				"comment_id": 183,
				"body": "Можно сравнить:\n\nGit Center ты разрабатываешь где-то локально, и это намного хуже, чем то, как идет разработка py3 ветки. Почему нет объявлений о тестинге? Почему нет сорцов? Куда слать пул-реквесты?\n\nТы скажешь, что тебе так удобнее, но и nofish так удобнее. Он уехал в отпуск, и пошло оно всё на. Он не платной работе. Вопрос в том, как ты подходишь к делу, как это оценят другие. Насколько они будут тебе доверять, и насколько ты оправдаешь доверие. Я херовый программист, ты херовый программист, nofish программист получше.\n\nИменно в этом суть: тут нечего улучшать, кроме самого себя. Если бы я был лучшим мной, у меня был бы свой дистрибутив ZeroNet с моими плагинами и 4 готовых движка сайтов. Но я херовый программист, поэтому у меня этого нет, и нет никакой пользы обществу от меня. Есть 2 недоделанных движка и 4 стаба на плагины. Это не то, с чем можно выходить к людям.",
				"added": 1562040183
			},
			{
				"comment_id": 184,
				"body": "> [gitcenter](#comment_10_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Давай так: сделать такой дистрибутив в одиночку не получится. Сделать вместе, ускорить разработку сейчас, не застревая из-за мелочей -- да.\n\nВот в том и дело, что nofish всё-таки ZeroNet сделал в одиночку, а у нас сделать на базе готового кода - не получится. Наверное лучше программиста, чем nofish, тут нет?\n\nЯ готов обсуждать конкретные технические аспекты. Например, есть работа по плагинам, и я не знаю, куда её приткнуть: на py2, чтобы народ мог накатывать на стабильную ветку, или сразу на py3, чтобы не пришлось переписывать код потом.\n\nИли - я могу подготовить сборки для Linux, но в Windows я не разбираюсь.\n\nИ т.п.\n\n> Я был совсем не против того, куда движется ZeroNet. Но когда, блин, оказывается, что это решето, поневоле начинаешь задумываться. И просить nofish'а придумать решение. А он молчит. Вот что с этим делать?\n\nЯ абсолютно уверен, что решето. Этот код никто никогда всерьез не исследовал, не пытался провести аудит и т.п. Но тут нет иного решения, кроме как заниматься разработкой дальше. Если nofish будет плохим руководителем, постепенно найдётся другой. Или не найдётся - тогда проект умрёт.\n\n> Это две большие разницы. Новый GC -- проект, который даже не опубликован. Им никто не пользуется. Если я его не буду доделывать, никто не умрет. А вот ZeroNet'ом люди пользуются, и дыры закрывать нужно оперативнее. В этом и проблема.\n\nЛюбой херово работающий код в бесконечное число раз лучше, чем вообще не написанный.\n\n> Я сделал то, чем пользуются люди. Kiwipedia, старый Git Center, еще куча всего. Я написал PeerMessage и BackgroundProcessing, без которых сейчас не было бы KxoID. И прямо сейчас пилю что-то еще. Я расчищаю issues на гитхабе, фикшу какие-то баги. Трачу свое время на то, чтобы найти уязвимости, сделать PoC, и их закрыть. Я не продаю их в дарк нете. С этим выйти к людям можно.\n\nЭто всё супер, но это не что-то такое, что было бы законченным решением. Вот если поставлять всё это в настроенном виде из коробки - другое дело. Если у тебя, например, будет собственный вариант ZeroHello, с дополнительными защитами от несанкционированных обновлений на уровне ядра (подписывание разными ключами, дублирование апдейта по разным каналам...) - это сразу на деле повышает надежность сети. А разговоры, какую крутую штуку можно написать, когда у проекта будет совет из 5 руководителей - нет. Совет может и будет, но код может так никто и не напишет.",
				"added": 1562054259
			},
			{
				"comment_id": 185,
				"body": "> [fant](#comment_2_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Обсуждение в английской версии \"обфрикилось\" и вообще свернуло не туда.\n\nСильно не хватает поддержки ZeroTalk-ом реакций в виде эмоджи, как на гитхабе. :DD",
				"added": 1562092711
			},
			{
				"comment_id": 186,
				"body": "> [fant](#comment_3_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Пилить своё на базе уже сделанного. Максимально совместимое с существующей сетью, конечно.\n\n+1",
				"added": 1562093849
			},
			{
				"comment_id": 187,
				"body": "> [fant](#comment_3_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): l2pd - прекрасный пример такого подхода.\n\nВообще, реализация с нуля по спеке и набору тестов — было бы круто. Но на текущем этапе не вижу в ней большого смысла. Довести до ума уже наимплементированный ворох API представляется гораздо более полезной идеей.",
				"added": 1562093965
			},
			{
				"comment_id": 191,
				"body": "> [gitcenter](#comment_14_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Проблема в том, что спеки-то и нет :)\n\nСитуация как с самим питоном. Видать, заразно.\n\n> [gitcenter](#comment_14_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Избавиться от iframe'а, например.\n\nКак?",
				"added": 1562094898
			},
			{
				"comment_id": 192,
				"body": "> [gitcenter](#comment_15_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Зачем нам вообще iframe? Чтобы никто никуда не вылез. Звучит как хак.\n\nНе знаю, почему звучит. Это документированная фича и используется по назначению.\n\n> У нас в JS есть Proxy. Через него можно отключить кучу всего, если заинжектить свой код где-то в начале. А с этим проблем не будет.\n\nНе понял. Перехватывать и фильтровать всё браузерное API целиком? Вот это действительно звучит как хак.\n\nСмысл этого не очень понятен: зачем реализовывать свою песочницу, если браузер дает готовую? Какую задачу решаем?",
				"added": 1562095641
			},
			{
				"comment_id": 193,
				"body": "А мы можем обращение к врапперу завернуть в те же прокси, а асинхронность спрятать от выполняемого кода, чтобы синтаксически он выглядел синхронным? Или в такие хаскель-подобные приколы JS не умеет?",
				"added": 1562095928
			},
			{
				"comment_id": 194,
				"body": "> [gitcenter](#comment_18_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): В принципе, так можно сделать, но будет очень криво, и далеко не ясно, будет ли так работать, например, full screen.\n\nЕсли API соблюдается, ничего кривого. Имхо, самый прямой способ: сначала ограничить крупноблочной ограничивалкой, а недостающее прокинуть отдельно. Так что суть как раз в том, будет ли работать.\n\nВот еще что меня интересует - возможность запустить код другого сайта как сервис и дергать там методы асинхронно. С iframe-ами не вижу принципиальной сложности: по команде ядра, враппер открывает еще один (скрытый) ifame, в котором грузит сайт, и организует канал связи между обоими ограниченными ifame-ами.",
				"added": 1562096624
			},
			{
				"comment_id": 195,
				"body": "> [gitcenter](#comment_19_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ну в чате он вчера был :) Видимо, времени не хватает. Он еще и над matrix работает.\n\nЕго так и звать ZeroLSTN, или у него есть более человеческий пользовательский сертификат?",
				"added": 1562096717
			},
			{
				"comment_id": 196,
				"body": "> [gitcenter](#comment_20_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Задумался, что понятия не имею, как ZeroNet скачивает пользовательские файлы. Списка директорий-то нет в content.json...\n\nВ смысле нет, там полные пути указаны.",
				"added": 1562096772
			},
			{
				"comment_id": 197,
				"body": "> [gitcenter](#comment_23_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/content.json\n> Ну и где это указано? :)\n\nТам обычно только `data.json`, а путь считается от каталога, где `content.json` лежит, поэтому явного пути нет. Открой корневой `content.json`, там полные пути для всякой всячины.",
				"added": 1562096967
			},
			{
				"comment_id": 198,
				"body": "(У меня уже утро скоро, пойду спать. Если завтра найдётся время, возможно, выложу тестовую версию переделанного плагина. Всем приветы в этом чатике.)",
				"added": 1562097117
			},
			{
				"comment_id": 199,
				"body": "> [gitcenter](#comment_24_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Речь о том, что \"1GooUE19488nDwG3TdkM8seYAHct4gjkq4\" нигде не захардкожено. Поэтому какие адреса пробовать -- непонятно.\n\nВ inner_path захардкоржено и подписано.\n\n```\n{\n \"address\": \"1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE\",\n \"cert_auth_type\": \"web\",\n \"cert_sign\": \"HA20CyiQy0oQhQKGJkqQWPPA6tuSRw6fr6e01U0fNMPI3sjNdNDkVXowWLFQOOOZeTZTh/j5Q/t4ftOAGrOTH0s=\",\n \"cert_user_id\": \"geekless@zeroid.bit\",\n \"files\": {\n  \"data.json\": {\n   \"sha512\": \"d655bf510f67e61244d2535bd910a0e98dc63af55ca8d5843cb23e88f8c15c55\",\n   \"size\": 164715\n  }\n },\n \"inner_path\": \"data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/content.json\",\n \"modified\": 1562097117,\n \"signs\": {\n  \"1GooUE19488nDwG3TdkM8seYAHct4gjkq4\": \"G9/lzcpQloT+8YsVVg4q2aAixdjg+6r0nJ2usRqbDFMlSQ5cFHF5liEYBQssZy+OzpttfPOsc61BjWm1mjageEM=\"\n }\n}\n```",
				"added": 1562097191
			},
			{
				"comment_id": 200,
				"body": "> [gitcenter](#comment_26_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А лежит этот inner_path где? Правильно, в директории с именем 1GooUE19488nDwG3TdkM8seYAHct4gjkq4.\n\nИмея на руках сам файл `content.json`, по нему можно точно установить, на каком сайте, по какому пути он должен лежать.",
				"added": 1562120744
			},
			{
				"comment_id": 201,
				"body": "> [gitcentermobile](#comment_1_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo): Да не... Вопрос был в том, как этот файл вообще найти, если его путь заранее неизвестен (например, когда сайт скачивается в первый раз)\n\nА, теперь дошло.",
				"added": 1562132334
			},
			{
				"comment_id": 210,
				"body": "> [swashbuckler](#comment_3_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Потому что даже внутри децентрализованной сети точки централизации - это сами пользователи и группы, которые они формируют.\n\nДа. И весь вопрос в том, насколько человек готов идти своей дорогой, если его что-то не устраивает. Децентрализация должна быть в голове. :)",
				"added": 1562393482
			},
			{
				"comment_id": 223,
				"body": "> [technol0g](#comment_3_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK): Type Script (не торопитесь закидывать помидорами) это сторого типизированный язык\n\nКстати говоря, у питона тоже есть средства типизации.\n\nПо моему опыту, типизированные ООП языки плодят архитектурных монстров, и большая часть времени уходит на проектирование архитектуры ради архитектуры, а не развитие приложения. В нашем случае это тупиковый путь, разработчиков не хватает даже для разработки на нетипизированном питоне. Ну значит вот так нужна людям подобная сеть... Может и правда, бросить всё и пойти бухать?\n\n> Балансировщик, т.е. если контент хранится на max N пирах, нет смысла заливать на все, если число пиров < N, тогда добавляем пиры, что частично избавит от дублирования данных.\n\nНе понял, относятся эти слова к ZeroNet или к гипотетической другой сети. Если к ZeroNet, то дублирование контента не баг, а фича. В сети, состоящей из недоверенных узлов, невозможно выяснить, сколько копий хранится. Балансировщик приведет к тому, что можно запустить 10000 узлов, объявляющих о наличии контента, дождаться, пока остальные узлы перестанут его кэшировать, и одновременно выключить эти все узлы.\n\n> Мотивация узлов сети. Без достаточной мотивации сеть не вырастить. Как вариант завязать на крипте.\n\nСпасибо, но ~~такого говна~~ такой мотивации не надо. Что представляет собой сообщество крипты, уже видели. Смотрю, все \"успешные создатели стартапов\" и \"гуру пассивного заработка в интернете\" теперь ринулись заниматься криптой. Ну удачно им там сидеть дальше.\n\n> По поводу выбора лучших 4х человек - делегатов по голосам, т.е. тем кому будут делегированы полномочия развития, поверьте это не работает.\n\n+1",
				"added": 1562561944
			},
			{
				"comment_id": 224,
				"body": "> По идеи, все свое и самое интересное чужое надо хранить у себя. Только в таком случае возникает проблема больших файлов - как сделать их доступными не создавая многотерабайтное локальное хранилище?\n\nХах, а никак. :) По-моему, решение точно такое же, как и во все предыдущие времена: хранить то, что действительно интересное и нужное. Я зеронет рассматриваю именно в таком свете:\n\n* Я и раньше хранил кучу хлама, который мне чем-то интересен. А теперь я этим хламом еще и делиться могу. (На самом деле, не очень могу, в текущем виде сеть всё еще малоюзабельна. Но допустим теоретически.) Т.е. если я терабайтных архивов видео не хранил раньше, то и теперь не буду.\n\n> Самое логичное - резать на части и хранить с некоторой избыточностью по разным узлам, схема используемая во Freenet и Perfect Dark.\n\nЭто не решает проблему в корне, а просто перекладывает её на энтузиастов, которые хранят чужое за свой счёт.\n\nFreenet - это огромный распределённый зашифрованный кэш. В таком виде он очень нужен для повышения доступности и живучести контента. Есть у меня [в планах для ZeroNet](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1562248570_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/). Но как единственная форма хранения - сомнительно.",
				"added": 1562577352
			},
			{
				"comment_id": 441,
				"body": "@gitcenter\n\nНу как там форк?\n\n",
				"added": 1616362869
			},
			{
				"comment_id": 446,
				"body": "@gitcenter, бываешь тут? Такой вопрос. Хочу твои плагины добавить в свою сборку. Поддерживаешь ли ты их? Каков их статус и откуда брать актуальные версии?",
				"added": 1616489931
			},
			{
				"comment_id": 449,
				"body": "> [dgfghyt](#comment_7_14bDUXb6RppLjK3ygbTaeoWGzzp8WY9esv): Никто не мешает клонировать форум или сайт и стать его владельцом\n\nЦенен не сам сайт, ценно общество вокруг него. Толку нет от сайта, на который никто не ходит.",
				"added": 1616620077
			},
			{
				"comment_id": 454,
				"body": "Да уж. Последний раз замечен в сети 2-го января. Надеюсь, жив-здоров.",
				"added": 1617098636
			},
			{
				"comment_id": 457,
				"body": "> [beeholder](#comment_21_1JZKKzmvBupAZGgJuWQzmNLo1MBs5N9rn): вроде 25 января выходило обновление zeronet'а; правда странное какое-то, без увеличения номера сборки\n\nТам мелкие правки, принятые  от сторонних авторов. Большой вопрос, кто их принимал. После того как полгода назад \"nofish\" выкатил в мастер сломанную версию, которая падала при запуске, особо ничего о нём не слышло.\n\nА вот @gitcenter активен на github и gitlab в других проектах. Но на моё письмо пока не ответил.",
				"added": 1617266091,
				"modified": 1617266135
			},
			{
				"comment_id": 463,
				"body": "Я тут сам пропал на полгода, а первое что сделал при возвращении - запустил апдейт официального docker-образа ZeroNet. Какое же было моё удивление, когда docker мне сказал, что апдейтов нет.\n\nТак что мы теперь сами по себе.",
				"added": 1635412185
			}
		],
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 188,
				"body": "> [gitcenter](#comment_11_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): py3 однозначно, nofish сказал, что на py2 будут только хотфиксы.\n\nОк.",
				"added": 1562094273
			},
			{
				"comment_id": 189,
				"body": "Для начала пришлось пропатчить сборку образа. А то оно норовило пересобирать образ полностью с нуля каждый раз:\n\n```diff\ndiff --git a/Dockerfile b/Dockerfile\nindex 75d18a37..b85d44f1 100644\n--- a/Dockerfile\n+++ b/Dockerfile\n@@ -3,8 +3,7 @@ FROM alpine:3.8\n #Base settings\n ENV HOME /root\n \n-#Add Zeronet source\n-COPY . /root\n+COPY requirements.txt /root/requirements.txt\n \n #Install ZeroNet\n RUN apk --no-cache --no-progress add python3 python3-dev gcc libffi-dev musl-dev make tor openssl \\\n@@ -13,6 +12,8 @@ RUN apk --no-cache --no-progress add python3 python3-dev gcc libffi-dev musl-dev\n  && echo \"ControlPort 9051\" >> /etc/tor/torrc \\\n  && echo \"CookieAuthentication 1\" >> /etc/tor/torrc\n \n+#Add Zeronet source\n+COPY . /root\n VOLUME /root/data\n \n #Control if Tor proxy is started\n```",
				"added": 1562094285
			},
			{
				"comment_id": 190,
				"body": "Распарсить адрес трекера я могу при помощи `site_announcer.getAddressParts()`, проверить поддержку протокола -- при помощи `site_announcer.getTrackerHandler()`. А вот список поддерживаемых протоколов не вижу, как получить. Придется хардкодить.",
				"added": 1562094644
			},
			{
				"comment_id": 202,
				"body": "> [geekless](#comment_190_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А вот список поддерживаемых протоколов не вижу, как получить. Придется хардкодить.\n\nПридумал, как объехать проблему. :D\n\n```\n    def getSupportedProtocols(self):\n        if not self.site_announcer:\n            return None\n\n        supported_trackers = self.site_announcer.getSupportedTrackers()\n\n        protocols = {}\n        for tracker_address in supported_trackers:\n            protocol = self.getNormalizedTrackerProtocol(tracker_address)\n            if not protocol:\n                continue\n            protocols[protocol] = True\n\n        protocols = list(protocols.keys())\n\n        self.log.debug(\"Supported tracker protocols: %s\" % protocols)\n\n        return protocols\n\n```",
				"added": 1562138968
			},
			{
				"comment_id": 203,
				"body": "> [caryoscelus](#comment_73_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да собственно я во внутренностях 0нет и не разбираюсь. Разве что покритиковать императивный код?..\n\nПокритиковать - это дело. Я в питоне не разбираюсь. xD",
				"added": 1562151730
			},
			{
				"comment_id": 204,
				"body": "Залил бранчи:\n\n* Переделанный AnnounceShare: https://github.com/geekless/ZeroNet/tree/AnnounceShare-rework\n* Переделанный AnnounceShare + новый плагин TrackerList: https://github.com/geekless/ZeroNet/tree/TrackerList\n\nTrackerList - плагин, подтягивающий трекеры из списка по указанному URL или файловому пути. По умолчанию - с https://github.com/ngosang/trackerslist.\n\nВ бранче плагин по умолчанию поставляется с префиксом disabled-, т.е. отключен. Перед запуском требуется включение явным образом.\n\nТестируйте.\n\nЕсли всё работает нормально:\n* Узел, на котором запущен TrackerList вместе с переделанным AnnounceShare, должен содержать целую кучу трекеров в списке.\n* Узел, на котором работает только переделанный AnnounceShare, должен (в конечном итоге) через обмен трекерами найти все виды поддерживаемых трекеров: zero, http(s), udp (если есть открытый порт).\n\nВторое условие довольно сложно проверить in the wild, потому что нужно чтобы среди всех тысяч узлов, тестируемый узел приконнектился именно к моему (или к вашему, где вы запустили TrackerList).",
				"added": 1562158556
			},
			{
				"comment_id": 205,
				"body": "Объясните мне логику этого человека. Сидит вручную обновляет [список трекеров в сорцах](https://github.com/HelloZeroNet/ZeroNet/commit/c1db963c76f52b6b2e1ce1e96e867f1cb4392c16), но против того, чтобы пользователи сами добавляли трекеры, и сеть сама настраивалась на рабочие.\n\nУ кого были конспиративные теории, пора доставать их.",
				"added": 1562260423
			},
			{
				"comment_id": 206,
				"body": "> [caryoscelus](#comment_75_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Разве?\n\nНет смысла добавлять трекер себе в конфиг, будешь как дурак один сидеть на этом трекере. Без автоматического обмена это не имеет никакого смысла.",
				"added": 1562273444
			},
			{
				"comment_id": 207,
				"body": "> [caryoscelus](#comment_76_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Мне казалось какой-то обмен был, но может что-то и путаю\n\nКраткий результат моего с ним общения: \"Обмена списками торрент-трекеров нет и не будет. Потому что я так сказал.\" \n\nПофиг, что зеро-трекеров работает 10 штук на весь интернет, а публичных торрент-трекеров только в одном частном списке на гитхабе больше 60 штук.\n\nЯ хотел сесть за проектирование плагина для DHT, который будет использовать существующую инфраструктуру всех DHT-пиров торрента для своего блага (и прозрачно переходить на собственный протокол при работе через тор), но теперь всерьёз подозреваю, что PR завернут с теми же возражениями \"потому что гладиолоус\":\n\n1. Торренты не поддерживают адреса onion.\n2. Протокол требует \"слишком много\" пропускной способности сети.\n3. Зеро-трекера и PEX достаточно для всех.\n\nНа вопрос, будет ли он принимать PR с DHT, он не ответил.\n\nКакая-либо логика в этих возражениях отсутствует, если подходить с инженерной точки зрения, но присутствует, если предположить, что весь смысл в том, что пользователи ZeroNet сидели в своей песочнице, подконтрольной разработчику ядра, и носа в большой мир не выказывали.\n\nОбмен осуществляется только списками трекеров, поднятых средствами самой ZeroNet, и только теми, что осмелились работать на публичных IP. Чтобы было, куда ОМОНом вламываться? Какое совпадение!\n\nИзвините за паранойю, но другого объяснения у меня нет. Абсолютная глупость или диверсия. Nofish на глупого не похож. Как-то так.",
				"added": 1562314917
			},
			{
				"comment_id": 208,
				"body": "@gitcenter:\n\nЯ сделал организацию на гитхабе и послал тебе инвайт.\n\nЗавёл бранч plugins, специально под плагины и под прочее, что будет мерджиться с кодом nofish-а без конфликтов: https://github.com/zeronet-enhanced/ZeroNet/commits/plugins\n\nЗаливай туда свои плагины, если хочешь. Будем доделывать всё то, до чего Царь не опускается.\n\n(Вообще по уму надо пилить фичи в отдельных ветках, а в общую вливать оттестированный код, но пока там только два моих плагина, позволяю себе неряшливость.)\n\nЕсли будут расхождения по коду ядра, придётся еще и сложными мерджами с конфликтами заниматься, но пока так живём.",
				"added": 1562331279
			},
			{
				"comment_id": 209,
				"body": "[(link)](https://github.com/HelloZeroNet/ZeroNet/pull/2068#issuecomment-508788959)\n\n> I think DHT would be an improvement in some situations, so it would be a great addition, but I'm not sure if we should enable it by default. Depends on the resource usage or as a fallback if low amount of trackers are available.\n\nПо-моему, это клиника.",
				"added": 1562341498
			},
			{
				"comment_id": 211,
				"body": "> [anotherneko](#comment_164_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Но ведь DHT действительно весьма жирный по трафику. У того же ipfs dht трафик составляет порядка мегабита в обе стороны, 24/7 и пользователи с ограничением по трафику могут не оценить лишние 20Гб в сутки.\n\nФактически он предложил сеть разбить на два слабосвязанных сегмента, включая DHT только в случае проблем. Коннект к DHT можно рассматривать как своеобразный \"трекер\", работающий только для тех, у кого отвалились остальные, и у нас получается два непересекающихся облака пиров.\n\nНасчёт трафика да, но нужно как-то решать этот вопрос. Для узлов на слабом канале можно рассмотреть вариант делегирования запросов к узлам (сидящим на жирном канале), объявившим себя DHT-агрегаторами или шлюзами. Где-то под торрент я даже видел готовую реализацию трекера, который собирает информацию из DHT и отдаёт  списки пиров по обычному протоколу трекера.",
				"added": 1562406139
			},
			{
				"comment_id": 212,
				"body": "> [anotherneko](#comment_164_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): У того же ipfs dht трафик составляет порядка мегабита в обе стороны\n\nIPFS вообще жрёт ресурсы как не в себя, но я не разбирался, с чем это связано. Если даже запустить торрент-клиент с кучей раздач, нагрузка на машину оказывается меньше, чем у IPFS. По крайней мере, так было, когда я пытался его использовать. Не знаю, как сейчас.",
				"added": 1562406583
			},
			{
				"comment_id": 213,
				"body": "> [gitcentermobile](#comment_2_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo): \"Держу в курсе\": я все же начал разработку своей реализации на JavaScript, с нуля. Пока доволен, может получиться лучше оригинальной.\n\nКто-то уже пытался: https://github.com/ZeroNetJS",
				"added": 1562419903
			},
			{
				"comment_id": 214,
				"body": "> [gitcentermobile](#comment_3_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo): [...]\n\nЭкстремально. Посмотрим, что получится. У меня вопрос - как там с настоящей многопоточностью, в серверном js?\n\nСвои плагины под nofishевскую версию ты забросишь?",
				"added": 1562420350
			},
			{
				"comment_id": 215,
				"body": "> [if0](#comment_99_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Будет прикольно, когда одна часть пользователей форума, не будет видеть  сообщения и топики другой части пользователей одного форума.\n\nТакое возможно - представь, что сайт, созданный на Земле, засидирован на Марсе, а связь между планетами нестабильная. Но живя на одной планете, хотелось бы такого избежать.",
				"added": 1562494097
			}
		],
		"1_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": [
			{
				"comment_id": 216,
				"body": "Лол. Кто-нибудь из отметившихся собирается писать код?",
				"added": 1562504220
			},
			{
				"comment_id": 217,
				"body": "> [justman](#comment_6_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): я в 0net заходжу иногда с 2х разных ПК, на одном настроил работу с 0net для работы с тор, на другом тор вообще не стоити тот другой не может подключится к тор, так что сомневаюсь\n\nВ составе дистрибутива ZN есть же тор. Я гоняю ZN в докер-контейнере, пока не сталкивался с тем, что тор не работает. Даже из поселка через yota, едва-едва добивая до вышки. В таких условиях ZN работает даже лучше, чем обычный веб.",
				"added": 1562511715
			},
			{
				"comment_id": 218,
				"body": "> [justman](#comment_5_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): [...]\n\nБыл у меня период, когда хотелось взять и запилить p2p сеть самому. :)\n\nНа мой взгляд, вся эта критика и размышления \"как лучше\" имеют тот фундаментальный недостаток, что те же вопросы можно намного проще решить доработкой ZN, а не созданием чего-то с нуля.\n\n1. Пользовательские сертификаты - отдельная подсистема, которую можно переделать.\n2. Хранение данных - решается на уровне движка сайта, а движок можно написать лучше, чем существующие сейчас.\n\nИ т.п.\n\nНасчёт архивов со старым контентом на форумах я уже как-то предлагал идею, что пользователю дается, скажем, 200 КБ под самые свежие записи в data.json, а всё остальное хранится в опциональных файлах, разбитых по диапазонам дат.\n\nТаким образом каждый посетитель может сам выбрать, на какую глубину загружать историю форума. И загружать ли всю, или для отдельных интересных пользователей.",
				"added": 1562511997
			},
			{
				"comment_id": 219,
				"body": "> [justman](#comment_7_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): вот зачем эти файлы, data.json\n\nПотому что данные надо как-то сериализовать, а json как раз достаточно простой и популярный формат. Если гонять по сети \"объекты\" вместо файлов, то возникает вопрос о хранилище объектов. Если мы храним объекты в СУБД, то встаёт вопрос бэкапов и читаемости средствами за пределами этой СУБД. (Да и её надежности тоже.) Простой текстовый формат эти вопросы снимает.",
				"added": 1562525318
			},
			{
				"comment_id": 220,
				"body": "> [justman](#comment_9_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE): по ходу докер контейнер включает настроенный тор просто, на то он и докер\n\nДа, так же как и сборка под Windows. Если просто ставить пакетом в Линуксе, то тор придётся прикручивать отдельно.\n\nЯ себе напилил такой враппер, чтобы не спотыкаться обо всё, что в образе докера автор исходно не предусмотрел: http://127.0.0.1:43110/1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG",
				"added": 1562525433
			},
			{
				"comment_id": 221,
				"body": "> [if0](#comment_103_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): [...]\n\nНу то есть код ты писать не будешь. :D",
				"added": 1562525607
			},
			{
				"comment_id": 222,
				"body": "> [if0](#comment_104_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Прежде чем написать хоть одну строчку кода надо, для начала, хорошенько продумать: для чего она будет написана.\n\nЗачем писать, если можно бухать.",
				"added": 1562527146
			}
		],
		"1_17vYx9xn438HWEazvWPp3XnpFneicx3V6n": [
			{
				"comment_id": 225,
				"body": "Где-то тут обсуждали этот вопрос.\n\nВроде, один хрен идёт через сервера.",
				"added": 1562598184
			}
		],
		"5_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 226,
				"body": "> [swashbuckler](#comment_6_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): А если идти путём кастомного CSS, есть ли какой-то универсальный селектор для пользователя? Его хеш, айди или ещё что-то? По ссылке указан идентификатор как пример для коммента и топика. Но если сайт какой-то пользовательский, то получится ли и там скрывать определённого пользователя? Иными словами, уникален ли такой идентификатор для любой структуры зайта или эти айдишники обязательно должен определять владелец сайта при его создании?\n\nТ.к. большинство сайтов работают на одном из 2-х стандартных движков - ZeroBlog и ZeroTalk, то и айдишники там выглядят одинаково. На остальных надо смотреть в индивидуальном порядке, что там в сорцах генерируется.",
				"added": 1562647283
			}
		],
		"1_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd": [
			{
				"comment_id": 227,
				"body": "Согласно нику, цифры в другом порядке.",
				"added": 1562683539
			},
			{
				"comment_id": 229,
				"body": "> [caryoscelus](#comment_79_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Пароль\n\nНа LOR-е этим заканчивают, а тут можно с этого начать.",
				"added": 1562684424
			},
			{
				"comment_id": 235,
				"body": "> [if0](#comment_118_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Если в ZN заведется \"профессиональный флудер\" - это будет непоправимая катастрофа.\n\nНепоправимая катастрофа лечится кнопкой Mute.",
				"added": 1562722388
			},
			{
				"comment_id": 236,
				"body": "> [caryoscelus](#comment_81_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Правда, вероятно придётся в срочном порядке переработать мехнизм блокировки (сейчас-то данные продолжают храниться)\n\nЕсли банить средствами форума, то данные не будут распространяться. На уже загрузивших узлах придется вручную вычистить, это да.\n\nУ меня мысль появилась. Можно напилить плагин, который заставляет вместо настоящего `content.json` грузить, например, `content.overloaded.json` (при наличии последнего). А этот второй генерируется движком самого сайта на лету. Это позволяет динамически управлять местом на сайте из JS-кода, не имея приватного ключа.\n\nТ.е. в итоге вместо подписывания лимитов напрямую, мы подписываем код, который формирует лимиты.\n\nА дальше куча опций: управление на основе PoW, на основе лайков, на основе мнения доверенных пользователей и т.п.\n\nПроблема в том, что нужно либо держать сайт запущенным, либо использовать плагин @gitcenter-а для фоновой работы.",
				"added": 1562749759
			},
			{
				"comment_id": 240,
				"body": "> Если я загружаю новый зайт, то мне предлагается загрузить \"хабы\" ползователей имеющие сообщения на данном зайте\n\nКем предлагается-то?\n\n> На зайте всесто директорий с самими сообщениями будет храниться список \"персональных хабов\" пользователей и id их сообщений.\n \nИ он подвержен цензуре.",
				"added": 1562852199
			},
			{
				"comment_id": 241,
				"body": "> [if0](#comment_124_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Но не тотальной, как сейчас - полного удаления сообщений, которе произойдет в том числе у самого удаляемого пользователя после синхронизации зайта, и без возможности изменять сообщения со стороны владельца зайта.\n\nТогда надо и \"списки \"персональных хабов пользователей и id их сообщений\" вынести на отдельный адрес, и таких адресов может быть использовано любое количество. Что тогда остаётся от \"форума\"? Ничего.\n\nИтого, у нас есть:\n*  \"Идентификатор форума\", который ничего не хранит в себе (никаких пользовательских данных), а просто декларирует наличие форума.\n* Хранилище с кодом для работы с форумом - \"приложение\". Приложение может быть любое совместимое по формату данных.\n* 1 или несколько коллективных хабов, которые служат просто для отслеживания \"в эту тему писали такие-то пользователи\". Пользователь может подключать или отключать их по своему желанию.\n* Персональные хранилища, в которых все данные и лежат.",
				"added": 1562856730
			},
			{
				"comment_id": 242,
				"body": "> [if0](#comment_127_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Странно, что никто сразу так не сделал, а решил \"хранить и распростронять\" сообщения вместе с форумом, или придумал костыльные полумеры с \"коллективными хабами\", подконтрольными одному владельцу.\n\nДумаю, это потому, что такую схему никто бы не понял сразу.\n\nНужно было придумать технологию, попользоваться ей , испытать все плюсы и минусы, и тогда становится очевидно, к какому формату организации данных она подходит. Сначала сделали классические форумы, как то подсказывал опыт веб-сервисов. Потом ZeroMe - шаг в правильном направлении. Теперь следующий шаг ясен, только код пока никто не написал.",
				"added": 1562859206
			},
			{
				"comment_id": 243,
				"body": "> [caryoscelus](#comment_85_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Насколько я понимаю, в зеронет вначале были \"обычные\" сайты, а \"интерактивность\" добавлялась постепенно, поэтому вот так исторически и сложилось\n\nДа, сначала были \"просто сайты\", потом \"просто блоги\" (уже с движком, но без возможности оставлять комменты), потом система сертификатов для комментирования, и потом как закономерный результат - форумы. Потом плагин для мерджа данных - и ZeroMe как демонстрация его применения.",
				"added": 1562859331
			},
			{
				"comment_id": 244,
				"body": "Насчёт \"всё есть сайт\" - это только морда ZeroHello думает, что \"всё есть сайт\". Для ядра \"всё есть  адресуемый по публичному ключу набор данных\". Морду можно поменять - и вот уже перед нами объектное хранилище, например.",
				"added": 1562859460
			},
			{
				"comment_id": 245,
				"body": "> [if0](#comment_128_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Оставили бы совместимость с \"обычными сайтами\"\n\nСамые обычные сайты, прямо как на geosites в 199x-лохматом. Берите и делайте.\n\n> [if0](#comment_128_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x):  костылить iframe...\n\nУ вас всё хорошо? Как вы изоляцию кода сделаете, расскажите. И интерефейс для управления открытым сайтом.",
				"added": 1562861548
			},
			{
				"comment_id": 246,
				"body": "> [if0](#comment_131_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Если порты разные использовать? Или локальный DNS?\n\nИ как это поможет админскому интерфейсу? Вы же первый взвоете, что нифига неудобно, нет ни статуса загрузки сайта, ни управления подписыванием из боковой панели, ни всплывающих уведомлений для управления разрешениями, какой дебил так сделал, верните iframe-ы обратно.",
				"added": 1562864088
			},
			{
				"comment_id": 247,
				"body": "> [if0](#comment_132_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Я всеми руками и ногами за нормальную отдельную страницу интерфейса управления \"не во что не интегрированную\", а не за этот показной свистяще-пердящий цирк с конями, который насколько красивый, настолько же неудобный, а местами, вовсе - бесполезный.\n\nПишите.",
				"added": 1562864473
			},
			{
				"comment_id": 248,
				"body": "> [if0](#comment_133_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Так я - бородатый олдфаг, прочно засевший в конце девяностых, непереносящий на дух соременное вебопердение, поэтому мое мнение и виденье в вопросе \"современных интерфейсов\" - ничтожно. Таких, как я 0.000... от общей аудитории. Вы же сами сказали: \"все скажут, что нифига неудобно ...\"\n\nТак-то я тоже ~~бородатый~~ олдфаг, в свободное время пилящий юниксовые тулзы на сишечке.\n\nНо потенциал, стоящий за ZeroNet, меня вдохновил отбросить идеологическое неприятие питона, кофескрипта и прочей такой порнографии. Хрен бы с ним с питоном, у нас выпал редкий шанс своими руками очертить контуры будущего, за которые не будет стыдно перед потомками. \n\nИ ведь технологии-то все давно известны, nofish не изобрел ничего нового. Но просто он единственный, кто смог эти кубики собрать в рабочий прототип, глядя на который, понимаешь, как надо было делать сразу еще начиная с 90-х, если не с 80-х.\n\nСейчас, когда идея заработала в коде, она кажется очевидной, а лет 10 назад если бы мне кто-нибудь рассказал, что будет такая штука - я бы просто не понял, о чем речь. Вот что круто - посмотреть на вещи под новым углом. А какой там код - так это всё можно исправить.",
				"added": 1562867461
			}
		],
		"10_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 237,
				"body": "> [gitcenteramorgan](#comment_1_194pDo3F76iy7UnsyuXVdgtH3BVM1Ai1dg): [...]\n\nЛюбопытно.\nНо возможно, несвязанные баги, т.к. тормозит на любых вкладках, обращающихся в ZeroNet. Перезапуск вкладки не помогает, только всего браузера.\nСейчас пока нет времени детально отлаживать.",
				"added": 1562752717
			},
			{
				"comment_id": 238,
				"body": "> [ooooooo](#comment_1_154kLF6ABqmmcwvXrS3jAUCuzF8U4aDwFr): у тебя Windows?\n\nНет.",
				"added": 1562777602
			},
			{
				"comment_id": 250,
				"body": "> [holocaust](#comment_1_1D6wMxmuyZ4wb6ko1DuTghdwa1phzzFBPw): Зачем не закрывать браузер день-два?\n\no_O А зачем закрывать?",
				"added": 1563005197
			}
		],
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": [
			{
				"comment_id": 239,
				"body": "> Укажите любую парольную фразу\n\nИ доложите товарищу майору. ;)",
				"added": 1562850571
			}
		],
		"1_1BkKy5cCZuUqCCeUQgGG74HM6U6ArJpfnt": [
			{
				"comment_id": 249,
				"body": "Хотел замьютить, но такой музейный экспонат даже мьютить жалко.",
				"added": 1562941312
			}
		],
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [],
		"1_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [],
		"1_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 253,
				"body": "> форум перерастёт за 1000 пользователей\n\nУже давно:\n\n```\n$ ls 1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/ | wc -l\n6006\n```\n\n>  сообщения перерастут за несколько миллионов\n\nДо миллиона еще далеко:\n\n```\n$ grep -r '\"body\":' 1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/ | wc -l\n59105\n```\n\n> если это что-то типа SQLite\n\nЭто она и есть. Надо решать проблемы по мере их появления. Пока еще SQLite тянет нагрузку.\n\n> По сути, ZeroNet потащит только небольшие веб-приложения? Серьёзные сервисы в таком контексте реализовать не получится?\n\nНадо просто не класть все яйца в одну корзину. Вместо 50 подразделов на крупном форуме, в ZeroNet можно сделать просто 50 форумов.",
				"added": 1584210810
			},
			{
				"comment_id": 257,
				"body": "> [cra](#comment_3_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): просто есть у меня небольшие опасения, что SQLite может стать узким местом.\n\nДумаю, проблема больше в движках сайтов, чем в ядре. Добавить поддержку внешней СУБД в ядро возможно. Я так понимаю, что сейчас все пишут sql запросы, исходя из того, что под капотом точно SQLite. Так что старые сайты так и останутся на SQLite, ну а поддерживаемым движкам придётся добавить слой абстракции над конкретным диалектом.\n\nВторой вопрос: как полноценная СУБД с миллионами записей будет ворочаться на обычных пользовательских устройствах. Так что делить на маленькие части и ограничиваться небольшими сообществами, возможно, всё равно придётся.\n\nВозможно, эта проблема вообще не будет актуальна, если посещаемость ZeroNet будет расти медленнее роста железа.",
				"added": 1584264412
			},
			{
				"comment_id": 263,
				"body": "> [cra](#comment_5_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Тут нет никаких движков сайтов. Тут по сути приложения на JavaScript, которые работают в браузере. \n\nЭто и есть движки сайтов. Т.к. бэка нет by design, фронт можно смело называть хоть движком сайта, хоть приложением.\n\nИмхо, сам подход придётся как-то переосмысливать. Протащить mysql можно, но это будет сильно похоже на то, как KDE тащил за собой mysql ради того, чтобы хранить там БД с адресной книгой. (Даже не знаю, сейчас это пофиксили, или так и таскает...)",
				"added": 1584299131
			}
		],
		"11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 258,
				"body": "> [gitcenter](#comment_37_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Можно попробовать перенести посты со старого форума на новый (e.g. в подпапку), правда, юзернеймы слетят, но тогда может и примут.\n\nВау, это идея!\n\nНе слетят. Ок, тогда я новый форум создам и попробую сделать полный клон.",
				"added": 1584269365
			}
		],
		"1584288639_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 259,
				"body": "> Мне прямо попо-боль доставляет данная ситуация.\n\nДа мне тоже, честно говоря. Это была одна из причин начать пилить движок.\n\nНо так как человек ко всему привыкает, пока я делал разные другие фичи, то как-то уже смирился, и так и не сделал в первую очередь эту функцию.\n\nЯ сделаю переключение сортировки, но не в ближайшей перспективе. Ну или кто-то всё-таки сделает и отправит мне pull request.",
				"added": 1584289899
			},
			{
				"comment_id": 261,
				"body": "> [cra](#comment_7_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Где git? \n\nФорумный движок тут: http://127.0.0.1:43110/1H3qtUJRrghDHpY89CBeueVAZw8xbHuDLr/\n\nВ принципе, от обычного workflow почти не отличается, кроме того, что git clone рабочей копии нужно делать из локального репозитория, и git push возвращать туда же. А потом отправлять в сеть. Блин, где-то же наверное был мануал по гит центру?..",
				"added": 1584292959
			},
			{
				"comment_id": 262,
				"body": "> [cra](#comment_8_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Будут вопросы - напишу в почту ZeroMail.\n\nА это принципиальный момент - в почту? Во-первых, от почты я не получу уведомлений, в отличие от форумного поста. Во-вторых, там очень мало места.",
				"added": 1584294062
			},
			{
				"comment_id": 363,
				"body": "Народ в личке спрашивает про фичу. Надо что-то делать...",
				"added": 1585156438
			}
		],
		"1584283661_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 260,
				"body": "> [cra](#comment_4_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Да сколько вас уже?\n\nВини @gitcenter, он подал идею)\n\n> Теперь тут? Мне за всеми следить?\n\nКонечно. Я уже на пару десятков форумов подписан.",
				"added": 1584290019
			},
			{
				"comment_id": 264,
				"body": "> [gitcenter](#comment_38_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Осталось понять, почему перенос вообще сработал. Вроде ZeroNet не должен принимать подпись, если cert_user_id подписан не тем же, кто подписал сам content.json (т.е. 1RuZntipLvXcLKFEjT6Fr7ZA3GuywYfr5).\n\n1. Мастер-ключ срабатывает всегда.\n2. Правилами в content.json можно добавить произвольное количество ключей. Пример: http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/data/users/content.json",
				"added": 1584373214
			},
			{
				"comment_id": 265,
				"body": "> [gitcenter](#comment_40_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ну это понятно, просто мне казалось, что проверка cert_sign была захардкожена, чтобы владелец сайта не мог представиться пользователем.\n\nПересказывая своими словами nofish,\n\nвладелец сайта может снести секцию `user_contents` в content.json и просто подписать всё-всё-всё как файлы сайта;\n\nвладелец сайта может что угодно нарисовать в UI и подменить любые данные.",
				"added": 1584373787
			},
			{
				"comment_id": 266,
				"body": "> [gitcenter](#comment_39_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @geekless Можно настроить скрипт для автоматического переноса новых сообщений с 1Apr на 1Ru, пока люди не перейдут? Только нужно аккуратно конфликты обрабатывать, можно, например, переименовать текущих юзеров в e.g. gitcenter@old (создав самоподписанный сертификат) и добавлять новые сообщения со старого форума туда.\n\nИнтересная идея.\n\nЭто прямо целая спецоперация. Думаю, у меня не будет времени написать и отладить все вспомогательные скрипты. Разве что их кто-то другой напишет:)",
				"added": 1584373953
			},
			{
				"comment_id": 267,
				"body": "> [gitcenter](#comment_41_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Намек понял\n\nЧто-то я так прикинул сочетание всех костылей, умноженное на особенности платформы, и мне кажется, будет неюзабельно. Но может я не прав. Мерджинг топиков, конфликты и т.п. Если тебе не жалко времени, попробуй...",
				"added": 1584374264
			},
			{
				"comment_id": 269,
				"body": "Блин, надо в сайдбар (который технически не сайдбар, а шапка сайта, если смотреть на обозначения в нашем шаблоне html) добавить еще одну секцию ссылок между названием и блоком \"≡ MORE\".\n\nЕсли всё важное делать закрепленными топиками, то свежие темы на форуме будут начинаться только с третьей экранной страницы.",
				"added": 1584375118
			},
			{
				"comment_id": 270,
				"body": "> [gitcenter](#comment_43_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Можно просто от MORE избавиться? Смысл прятать одну ссылку?\n\nНу это типа фича движка. :D\n\nОк, я понял, как переделать, чтобы сохранить гибкость, но не делать оверинжинеринг.\n\n`.more` оставлю в стилях, а из шаблона уберу. Кому надо, тот сам впишет `<div class=\"more\" ...` в конфигурируемый кусок кода.",
				"added": 1584375554
			},
			{
				"comment_id": 273,
				"body": "> [xandanyesm](#comment_21_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): приклеенные темы в таком количество мешают изрядно... может сворачивать? хз\n\nДа, сам об этом думаю. В узкую полосу, наподобие такого оформления: http://127.0.0.1:43110/1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/\n\nЯ сделаю в движке настройку, но не в ближайшие дни. Хз, когда всё успеть.",
				"added": 1584376380
			},
			{
				"comment_id": 274,
				"body": "> [xandanyesm](#comment_23_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): ну ты сам выбрал этот путь )\n\nЗато сколько вопросов по объему работы быстро проясняется, когда не на тестовом форуме, содержащем полторы темы, проверяешь движок, а сразу в бою.",
				"added": 1584376627
			},
			{
				"comment_id": 275,
				"body": "> [gitcenter](#comment_46_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @geekless Глянь ZeroMail, я прислал ключи для старых ID'шников.\n\nПолучил.",
				"added": 1584378446
			},
			{
				"comment_id": 276,
				"body": "Лол, мои багфикс так и не замерджили: https://github.com/HelloZeroNet/ZeroNet/pull/2089\nТолько сейчас увидел.",
				"added": 1584433689
			},
			{
				"comment_id": 277,
				"body": "> [gitcenter](#comment_49_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): https://github.com/HelloZeroNet/ZeroTalk/pull/97 -- ждем-с.\n\nЖдём! Как раз хотел тебя об этом попросить)",
				"added": 1584433745
			},
			{
				"comment_id": 278,
				"body": "> [gitcenter](#comment_50_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Oh well, это nofish, не пнешь -- не смерджит :)\n\nТам была серия багов, этот был первый. Теперь уже не помню детали, да и остыл к идее прямого прокси. Кто-то тогда активно продвигал поддержку этого режима, и я подключился к вопросу. Кто это был, может Даниэль...",
				"added": 1584435429
			},
			{
				"comment_id": 279,
				"body": "> [gitcenter](#comment_52_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @geekless Имеет ли смысл вообще поддерживать Talks@ZeroNet.Ru? Там вроде никого нет, ну разве что пару тем оттуда перенести.\n\nА что его как-то поддерживать, есть не просит)\nЯ его потом под что-нибудь узкотематическое переоборудую.",
				"added": 1584452976
			},
			{
				"comment_id": 280,
				"body": "> [gitcenter](#comment_53_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): PR смерджили, ждем изменения в ZeroNet'е.\n\nОгонь!",
				"added": 1584453122
			},
			{
				"comment_id": 281,
				"body": "> [cra](#comment_10_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): ply\n\nRu-ZeroNet был на тот момент мёртвый, с размером 50 KB на пользователя.\nОсновные вопросы обсуждались на Infonesy.Talk и LOR.Talk под управлением Балансера.\nTalks@ZeroNet.Ru планировался для общения на тему развития блогосферы, но блогофера кончилась, толком не начавшись. Блоги как-то не взлетели, может по причине убогости блог-движка, который никто не хотел допиливать.\n\nПотом shift прибавил лимит на Ru-ZeroNet. Балансер умер, с его форумов все ушли. И вот имеем, что имеем.\n\nДе факто, сейчас один форум.",
				"added": 1584453966
			},
			{
				"comment_id": 287,
				"body": "А задвоение лайков как глючило, так и глючит. А мне казалось, что я его чинил. Может это на ZeroBlog было, хз.",
				"added": 1584493070
			},
			{
				"comment_id": 290,
				"body": "> [gitcenter](#comment_59_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Кстати, если кто-то не заметил, на английском ZeroTalk теперь новая ссылка.\n\nТеперь я знаю, что такое \"10 минут\".",
				"added": 1584530200
			},
			{
				"comment_id": 293,
				"body": "Очень не нравится вёрстка форума, как в мелких деталях, так и в целом построение шаблона HTML. Нужно будет многое переделывать.\n\nТакже вместо (или в дополнение) к существующей возможности делать группы топиков, можно добавить разделы как здесь: http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3\n\nВот тоже интересный шаблон: http://127.0.0.1:43110/1MVgmEe4KsAgbx1QeQ8wgkYftVnTDjcCjr\n\nВ целом в моих очень далёких планах — реализовать на базе ZeroTalk платформу, масштабирующуся вплоть до \"Хабра\" или даже \"Фейсбука\", включая возможности ZeroBlog и ZeroMe.",
				"added": 1584546953
			},
			{
				"comment_id": 294,
				"body": "Ну а сейчас пока тоже неплохо получается. Вот так посидеть, потрындеть — прямо практически как в ZeroNet в 2018-м было. Снова на ум приходит «Гипертекстовый ~~векторный~~ распределённый межпланетный Фидонет». И не надо думать ни о каких серверах, аптайме, превышении лимита на CPU или сеть у хостера, просроченном домене и т.п.",
				"added": 1584547222
			},
			{
				"comment_id": 301,
				"body": "> [gitcenter](#comment_64_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А что конкретно не нравится? Минимализм :)\n\nВсё, криво, косо, на смартфоне разъезжается. При попытке добавить отдельные блоки в вёрстку, половина тоже разъезжается. Я поэтому пользовательские настройки не добавляю - лень делать вёрстку.",
				"added": 1584552407
			},
			{
				"comment_id": 302,
				"body": "> [gitcenter](#comment_66_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Категории, конечно, нужны, но чем не годятся topic groups?\n\nТем, что они скрывают контент как таковой.\n\nВообще то, что у нас на главной (гм... и единственной) странице форума, на классическом форуме называется \"трекером\" или \"списком недавних постов\" и т.п.\n\nПросто общая лента и категории нужны для разного , и одним другое не заменишь.",
				"added": 1584553326
			},
			{
				"comment_id": 304,
				"body": "Часто на форумах просят добавить фильтры, заточенные под особенности конкретного форума и сформировавшиеся там группы пользователей с частично конфликтующими интересами.\n\nВ идеале, у продвинутого пользователя должна быть возможность во фреймворке самостоятельно составить себе кучу таких фильтров.",
				"added": 1584554653
			},
			{
				"comment_id": 316,
				"body": "> [cra](#comment_34_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Мы преследуем цель именно продвинутых пользователей?Не, ну я понимаю, типа - а нахер нам тут всякие нубы и прочий шлак. Но блин, удобство даже простых пользователей мы должны учитывать обязательно.\n\nНет, конечно.\n\nРечь идёт о том, чтобы дополнительная кустомизация давала возможность продвинутым пользователям втянуться в работу с сайтом, ознакомиться с движком и т.п., а там дальше разработать какие-то улучшения, создать собственный сайт и т.п.",
				"added": 1584631817
			},
			{
				"comment_id": 318,
				"body": "Кто в списке топиков найдёт новую фичу, еще не ананосированную в ченджлоге ZT++?)",
				"added": 1584633473
			},
			{
				"comment_id": 320,
				"body": "> [geekless](#comment_318_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кто в списке топиков найдёт новую фичу, еще не ананосированную в ченджлоге ZT++?)\n\nТо ли настолько очевидно, то ли настолько неочевидно, то ли всем пофиг.",
				"added": 1584793331
			},
			{
				"comment_id": 321,
				"body": "Тем временем пофиксил проблему с большим пустым правым полем, проявляющуюся на некоторых девайсах. (В зависимости от шрифтов.)",
				"added": 1584793418
			},
			{
				"comment_id": 322,
				"body": "Поставил полную версию шрифта вместо того огрызка, что во все свои сайты суёт nofish. Теперь наконец-то латинские и кириллические символы будут отображаться одним начертанием.",
				"added": 1584803029
			},
			{
				"comment_id": 323,
				"body": "> [jixuucix](#comment_11_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Ну, я пока из нового заметил только меню, появляющееся при клике на юзернэйм, и меню на сообщениях. И вроде в ченджлоге про это нет. Или..?\n\nЭто всегда было.\n\nВот о чем я говорил: добавил отображение даты создания темы  в списке тем.",
				"added": 1584803117
			},
			{
				"comment_id": 325,
				"body": "> [jixuucix](#comment_12_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Жаль только, что раньше только английский текст был жирным и мыльным, а теперь весь. Лучше бы наоборот :)\n\nУ меня он не жирный и не мыльный. Хотя само начертание Roboto мне не очень нравится. Я пока не думал, чем его заменить, просто поставил полный пакет.\n\nДумаю, нужно внедрить возможность переключения шрифтов пользователем. Но мне кажется, что разумнее это делать на уровне всего зеронет разом, а не толкать в каждый сайт свою реализацию. Так что нужно делать плагин к ядру.",
				"added": 1584803794
			},
			{
				"comment_id": 326,
				"body": "> [geekless](#comment_325_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): не мыльный\n\nТекст постов, имею в виду. Заголовки немного мылятся на моём Арче, это так.",
				"added": 1584803860
			},
			{
				"comment_id": 327,
				"body": "> [jixuucix](#comment_12_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): О, спасибо, даже не ожидал, что этому так быстро уделят внимание. [...]\n\nЯ тут заметил, самое плохое даже не это. Самое плохое, что теперь я вижу, как в 2-3 прохода перерисовывается страница по мере загрузки шрифтов.",
				"added": 1584804821
			},
			{
				"comment_id": 328,
				"body": "> [gitcenter](#comment_91_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А какие шрифты добавлены? Только Roboto Bold?\n\nСейчас: Regular, Medium и Bold + они же с Italic. Полные версии со всеми глифами.\nРаньше: Regular, Medium (+ они же с Italic), только базовая латиница, вшитые как поток данных прямо в css.",
				"added": 1584805049
			},
			{
				"comment_id": 329,
				"body": "> [jixuucix](#comment_14_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): У меня было так (было/стало)\n\nА какая ОС?",
				"added": 1584805740
			},
			{
				"comment_id": 330,
				"body": "Тест вставки картинки\n\n![](http://127.0.0.1:43110/1Zavu5aGVWxcNo2ggZkkTSRBfj4xnpux3/data/img/post_2_2020-03-21_18-22-05_19099__firefox_.png)",
				"added": 1584805761
			},
			{
				"comment_id": 331,
				"body": "Ну да, у винды рендеринг системных шрифтов сильно отличается, от того, что браузер делает с веб-шрифтами...\n\nМда, нам всё же нужен переключатель шрифтов.",
				"added": 1584805949
			},
			{
				"comment_id": 332,
				"body": "> [gitcenter](#comment_92_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Картинка открывается только если сайт, на котором она хостится, уже загружен. Что было несколько затруднительно понять.\n\nへ‿(ツ)‿ㄏ\n\nЯ еще не перенёс умный код из ZB++",
				"added": 1584806371
			},
			{
				"comment_id": 333,
				"body": "Так?\n```\n![](http://127.0.0.1:43110/1Zavu5aGVWxcNo2ggZkkTSRBfj4xnpux3/data/img/post_2_2020-03-21_18-22-05_19099__firefox_.png)\n```",
				"added": 1584806729
			},
			{
				"comment_id": 334,
				"body": "> [jixuucix](#comment_16_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): господи, я не понимаю эту разметку\n\nЯ долго привыкал после bbcode, который на 90% \"старых\" форумных движков.\nНо похоже, надо переучиваться. Сейчас во все новые проекты markdown пихают.",
				"added": 1584806815
			},
			{
				"comment_id": 335,
				"body": "> [cra](#comment_47_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Где это можно наблюдать?\n\nЗдесь, на странице.\n\nУ меня начало этого топика, начинающееся словами \"Ru-ZeroTalk v2 был клонирован с оригинального Ru-ZeroTalk\" позиционируется и прорисовывается кусками.\nFF 73, 64-bit, Arch.",
				"added": 1584807490
			},
			{
				"comment_id": 337,
				"body": "> [jixuucix](#comment_19_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Я вообще не понял, что тут используется. Ожидал найти страницу с описанием разметки, или хотя бы пояснение-напоминание, что здесь используется Markdown.\n\nОна есть, но чтобы её увидеть, нужно взять уже существующий комментарий, нажать на нём кнопку редактирования, тогда внизу вылезет панель. На панели есть неприметный вопросительный знак. Если его нажать, в противоположном от этого знака конце экрана откроется еще одна панель с кратким описанием разметки.\n\nПочему? Потому что nofish дизайнер UI от бога! И еще потому что этот кусок кода перекочевал у него, вероятно, из ZB без адаптации под другой сайт.\n\nЯ хочу всё переделать, вот просто всё, в кровь и кишки разобрать и переделать, от основания. **Бесит.**",
				"added": 1584808219
			},
			{
				"comment_id": 339,
				"body": "> [cra](#comment_48_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): [...]\n\nУ меня запущено 4 копии ZeroNet, 3 браузера, занято почти 8 гигов оперативы... короче, лагает маленько.\n\nВ качестве костыля прописал директиву local() для шрифтов. Вряд ли у кого-то шрифты Roboto установлены конечно. Но себе поставил.",
				"added": 1584814529
			},
			{
				"comment_id": 340,
				"body": "> [cra](#comment_52_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv):  А зачем 4 копии ZeroNet запускать?\n\nОтладка.",
				"added": 1584815594
			},
			{
				"comment_id": 346,
				"body": "Хочу сделать единый сайт, на который выгрузить кучу шрифтов, и все копии ZT++ (на самом деле любые сайты) будут подключать его.",
				"added": 1585051610
			},
			{
				"comment_id": 347,
				"body": "> [gitcenter](#comment_99_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): CDN? Еще один?\n\nЕсли ты про тот, где библиотеки js лежали, то идея изначально тупиковая. Шрифтам, конечно, тоже особо доверять нельзя, с учётом постоянных новостей о уязвимостях в шрифтовых библиотеках. Но если так, тогда и картинки придётся запретить.\n\n> По-хорошему, нужно реализовывать content-addressable data. Хотя когда оно появится -- вообще непонятно, это же nofish.\n\nCAS может через 3 года появиться, а шрифты таскать с собой надо уже сейчас.",
				"added": 1585098155
			},
			{
				"comment_id": 348,
				"body": "> [gitcenter](#comment_100_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): В очередной раз обнаружил, что ZeroBlog удалил мои комментарии. У меня локально один комментарий, на другом компе -- предыдущие 3. На другой ноде -- еще что-то, то есть раньше тоже удалялось. Кстати, почему-то такая проблема только на ZeroBlog и ThunderWave проявляется (но с ThunderWave хотя бы понятно почему, он подписывает и публикует файл, как только ты ThunderWave скачаешь, поэтому его нужно аккуратно качать, чтобы ничего не удалить).\n\nВ последнее время ZN очень плохо доставляет апдейты. Я связываю это с несколькими предположениями:\n1. Доставка обновлений очень плохо работает на машину, где очень много сайтов. Вероятно, вопрос максимального количества соединений. Кстати, сколько у тебя сайтов хостится? У меня максимально около 700.\n2. Тот баг с апдейтами, на который я создавал репорт в трекере.\n3. Какой-то еще баг. Как минимум еще один точно есть, он у меня воспроизводится на старом Ru-ZeroTalk. Пока нет времени разобраться.\n4. В сети появилось много фейковых узлов, направленных на нарушение работы сети.",
				"added": 1585098409
			},
			{
				"comment_id": 349,
				"body": "> [gitcenter](#comment_100_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): В очередной раз обнаружил, что ZeroBlog удалил мои комментарии. У меня локально один комментарий, на другом компе -- предыдущие 3. На другой ноде -- еще что-то, то есть раньше тоже удалялось. \n\nЕще на этот счёт хочу сказать.\nИмхо, нужно делать поддержку подключей в пользовательских `content.json`. По типу:\ndata-1.json - одним подключем подписана\ndata-2.json - другим\ndata-3.json - третьим...\n\nПо количеству устройств у пользователя.",
				"added": 1585098607
			},
			{
				"comment_id": 350,
				"body": "Вот сейчас я тут не вижу комментарий @cra, который видел с другой машины. Нажму обновить, и наверняка он появится.",
				"added": 1585098677
			},
			{
				"comment_id": 351,
				"body": "> [cra](#comment_56_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): А у меня на мобиле почему-то ZeroHello не обновляет ленту уведомлений. Сюда захожу - ага, вижу, новые сообщения появились. В ZeroHello их нет. \n\nЕсли совсем нет, значит подписка на уведомления слетела или не настроена.\n\nЕсли есть, но \"то есть, то нет\", то да, есть такая проблема. Только у меня наоборот: на мобиле нормально показывает, а с компа ZeroHello тупит.\n\nПохоже, у нас много разных race condition в ядре. Т.к. это питон, то он хотя бы не падает на кривых указателях, но данные всё равно криво обновляются.",
				"added": 1585098855
			},
			{
				"comment_id": 366,
				"body": "Статистика пиров на ZeroSites не обновлялась с прошлого года. Такие дела...",
				"added": 1585195120
			},
			{
				"comment_id": 367,
				"body": "Отправил багрепорт: https://github.com/HelloZeroNet/ZeroSites/issues/14",
				"added": 1585196257
			},
			{
				"comment_id": 369,
				"body": "> [jixuucix](#comment_12_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): текст был жирным и мыльным\n\nПосидел с винды, там сильнее заметно мыло.\nА под виндой можно ли добиться чёткого отображения веб-шрифтов? Если заменить по умолчанию Roboto на другой веб-шрифт, проблема не решится?",
				"added": 1585216413
			},
			{
				"comment_id": 373,
				"body": "Надо нам еще аватарки:\n\nhttp://127.0.0.1:43110/1ideasVz3NzYp24L2tzkt6Prp81xqmTJv/?Topic:1536099680_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/\n\nhttp://127.0.0.1:43110/1Jb5ZdmvTzVnHpa2hayjQk3H2kZgNVbmBb/?Topic:4_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/",
				"added": 1585239881
			},
			{
				"comment_id": 378,
				"body": "> [geekless](#comment_367_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Отправил багрепорт: https://github.com/HelloZeroNet/ZeroSites/issues/14\n\nДо сих пор не исправлено.\n\nФилософский вопрос: как делать децентрализованные сервисы, которые используют централизованно собираемую статистику?\n\nФилософский вопрос 2: почему не сообщество решает, какой список сайтов будет присутствовать по умолчанию после установки новой копии ZeroNet, а один человек это решает?",
				"added": 1597665509
			},
			{
				"comment_id": 392,
				"body": "> [gitcenter](#comment_109_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @geekless А можно исправить в темной теме табличку 'Powered by ZT++'? Там фон слишком яркий, текст не видно. И еще то же самое с кнопкой Search.\n\nПривет! Рад тебя видеть. Я помню по эту проблему. Пока нет времени даже открыть исходники.\n\nЧто будем делать с самой ZeroNet-то? На уровне сети у нас не получится резко мигрировать на альтернативную структуру, как было с этим формум. Нужны средства для плавной миграции.\n\nЯ предлагаю создать плагин для переопределения файлов сайта или динамического формирования виртуальных файловых ирерархий на уровне произвольных сайтов. Аналог unionfs для сайта.\n\nЭто позволит использовать фичи ZT++ поверх существующих форумов, при чем сразу любых совместимых по хранилищу.\n\nА дальше можно отталкиваясь от него формировать сеть, которая не имеет жесткой привязки к доменам nofish.",
				"added": 1603518855
			},
			{
				"comment_id": 393,
				"body": "@gitcenter:\n\nВ ветке py2 есть известные неисправленные уязвимости?",
				"added": 1603645941
			},
			{
				"comment_id": 416,
				"body": "> [gitcenter](#comment_144_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di):  К вопросу о. rutalk.bit, который вроде как регал shift, все еще то и дело обновляется. Так что может до shift'а еще можно достучаться, только не знаю, как.\n\nА достучаться с целью? Не понял.",
				"added": 1604081837
			},
			{
				"comment_id": 417,
				"body": "> [gitcenter](#comment_145_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Есть подозрение, что вот это не исправлено, фикс для py3 в коммите 248fc5f015f846a868b8d1c8168842878151e66d.\n\nСпасибо. Гляну.\n\nЕсть мысль еще в течение еще какого-то времени выпускать py2 версию для старых устройств и ОС.\n\nПортировать в неё фиксы производительности, над которыми я сейчас работаю.",
				"added": 1604081981
			},
			{
				"comment_id": 418,
				"body": "> [gitcenter](#comment_147_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Вот, кстати, большая проблема разрозненных ZeroTalk'ов: у каждого своя панель языков. Вот на en-ZeroTalk ссылка правильная, а на каком-нибудь китайском все еще старая.\n\nКогда-нибудь я запилю возможность для сайта тянуть настройки из другого сайта.\n\nПравда всем существующим клонам ZeroTalk'а это не поможет. Тут только плагин для принудительного оверлея.",
				"added": 1604082637
			},
			{
				"comment_id": 419,
				"body": "> [gitcenter](#comment_148_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Удачи. Портировать фичи вряд ли получится, но до работоспособного состояния может и получится довести.\n\nНу те фичи, которые я сам пишу, портировать труда не составит. :)\n\nА разбираться с накопленным за год расхождением кодовой базы — вряд ли буду этим заниматься. Только в рамках фиксов багов разве что.\n\n> до работоспособного состояния\n\nУ меня старый клиент сети на мобилке вполне работает. Я так понимаю, там py2 версия. И старый официальный клиент на одном из компов под виндой недавго запускал.",
				"added": 1604082776
			},
			{
				"comment_id": 420,
				"body": "> [gitcenter](#comment_146_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Ну, не знаю. Может, rutalk.bit попросить отдать, или переадресацию со старого ru-ZeroTalk на новый поставить. Хотя пока сами справляемся, конечно.\n\nЛучше .yo задействовать. Как только заработает релиз-цикл форка ядра, вопрос решится сам собой.\n\n> или переадресацию со старого ru-ZeroTalk на новый поставить\n\nТам есть топики, отсутствующие здесь. Да и пусть живёт, он не мешает.",
				"added": 1604083055
			},
			{
				"comment_id": 421,
				"body": "> [gitcenter](#comment_149_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): И еще оно централизованно\n\nНу, служба имён не может быть децентрализована. Она держится на доверии к хранилищу имён. Zooko's triangle, будь он неладен.\n\nСреди всех возможных проблем, вопрос именования я бы предпочел оставить для потомков. Пусть у них голова болит.",
				"added": 1604085879
			},
			{
				"comment_id": 422,
				"body": "> [gitcenter](#comment_150_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Вообще, .bit домены как бы уже решают (ну, почти) эту проблему. \n\nКогда у Thunderwave домен ушел, мы узнали, что значит \"почти\". :)\nТут конечно дело каждого решить, чему он больше доверяет.",
				"added": 1604087812
			},
			{
				"comment_id": 428,
				"body": "А какие там расценки в пересчёте на понятную валюту?",
				"added": 1604088122
			},
			{
				"comment_id": 429,
				"body": "> [gitcenter](#comment_154_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Да, как мы тут вообще относимся к вкладыванию больших дампов в комментарии? Я могу прям 20-килобайтный дамп сюда кидать, место найдется, или мне залить куда-то?\n\nА мне интересно, как к этому относится ZeroNet, и что случится с data.json, когда он перестанет влазить в дефолтный мегабайт или сколько там, после которого файл считается «большим». Будет зависон и куча интересных стек трейсов или не будет. Вроде там что-то фиксили недавно в этом месте.",
				"added": 1604090179
			},
			{
				"comment_id": 430,
				"body": "```\nused: 349.1k/4000k\n```\nНам нужно сжатие `data.json`. А то с этим UTF-8 и с этой кодировкой строк в JSON, дополнительно раздувающей место, не успеешь оглянуться, как «Войну и мир» превзойдёшь по объему.",
				"added": 1604090313
			},
			{
				"comment_id": 435,
				"body": "Хотя бы не remote code execution.",
				"added": 1604130986
			},
			{
				"comment_id": 442,
				"body": "> [fhello](#comment_10_1CBMLtV7FJruhSwGXEuwYznMU2SDi5Tcmn): А что делать, когда лимит закончится?\n\nЧтобы закончился лимит в 4 мегабайта, нужно очень-очень постараться. :) Два варианта:\n\n1. Писать сюда, чтобы я увеличил.\n2. Завести 2-й аккаунт.\n\nНасколько я помню, проблема в том, что с крупными JSON-файлами система на данный момент работает плохо. Можно поставить хоть 400 мегабайт, но работать это скорее всего не будет.",
				"added": 1616390718
			},
			{
				"comment_id": 479,
				"body": "Ух, с аватарками пользователей этот форум преобразился. Аж приятно полистать темы. Давно я так не радовался после написания куска кода.\n\nЖаль нельзя включить их по умолчанию, а то пользователи мобильной версии будут страдать.\n\nКстати по этой же причине я не проверял вёрстку аватарок на мобилке — всё равно их там включать никто не будет. (Думаю, там каша.)\n\nКак план Б можно генерировать аватарки прямо на месте вместо прогрузки с ZeroMe, как это сделано в чате [0Play Game Center](http://127.0.0.1:43110/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg/?/chat). Ноооо мне такой вид аватарок не вполне нравится.\n\nИли можно оставлять цветной круг с первой буквой имени пользователя, как я сейчас делаю для отсутствующих аватарок.\n\nКстати, сам ZeroMe при отсутствии аватарки рисует цветной круг, а букву не рисует. Но вёрстка в коде для этого предусмотрена. Видимо nofish-у не понравился результат. Я вот еще сам не проверял, как оно выглядт с других устройств. Может тоже отключу показ буквы.",
				"added": 1635667678,
				"modified": 1635667982
			}
		],
		"1584374728_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 268,
				"body": "@gitcenter:\n\nКакому ключу дать права — этому или какому-то другому?",
				"added": 1584374807
			},
			{
				"comment_id": 271,
				"body": "> [gitcenter](#comment_44_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Этому.\n\nТак, теперь ты можешь подписывать `data/users/content.json` и подписывать файлы пользователей.\n\nКнопка редактирования должна быть доступна на любых сообщениях, если движок работает как задумано.",
				"added": 1584376120
			},
			{
				"comment_id": 272,
				"body": "А вот настройки форума менять не можешь, т.к. они зашиты в корневой content.json. Но это я переделаю в движке...",
				"added": 1584376254
			}
		],
		"1584452427_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 282,
				"body": "> [cra](#comment_11_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Интересно, сколько будет последователей мало популярного языка для и так мало популярного проекта. Посмотрим.\n\nСмотря как внедрять. Вот CoffeeScript тут внедрён добровольно-принудительным методом)",
				"added": 1584455041
			},
			{
				"comment_id": 288,
				"body": "@gomzik:\n\nВ ОП определённо не хватает ссылки на http://127.0.0.1:43110/blog.gomzik.bit/?Post:20:Elm-ZeroNet",
				"added": 1584522228
			}
		],
		"1584457808_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 283,
				"body": "Хорошее дело.\n\n> Предлагаю администраторам форума прилепить эту тему, чтобы не сваливалась вниз.\n\nУ нас и так слишком много прикреплённых тем. Когда будет готов какой-то объем информации, добавлю ссылку на сайт в верхнюю панель.\n\nВпрочем, завтра хочу успеть переделать вёрстку, чтобы прикреплённые темы не занимали так много места.",
				"added": 1584457987
			},
			{
				"comment_id": 284,
				"body": "> сервис, который поддерживается многими роутерами, позволяет программам открывать порт.\n\nКстати говоря, более бесполезного изобретения в наше время, когда все сидят за NAT провайдера, сложно себе представить.\n\nА нет желающих встроить в зеронет транспорт поверх UDP и приделать NAT Traversal?)",
				"added": 1584464551
			},
			{
				"comment_id": 285,
				"body": "> [gitcenter](#comment_57_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Зачем UDP, вроде TCP тоже должен работать?..\n\nНу наверное. Из меня сетевик тот еще, я половину не знал, а другую забыл.",
				"added": 1584465911
			},
			{
				"comment_id": 286,
				"body": "> [gitcenter](#comment_56_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): IPv6 должен эту проблему решить.\n\nЯ к тому времени как раз на пенсию выйду, когда его внедрят на последней миле повсеместно)\nНапример, мой провайдер не поддерживает IPv6 вообще никак.",
				"added": 1584465999
			},
			{
				"comment_id": 289,
				"body": "@cra:\n\nЯ прикрепил тему.\n\nОчень удобно, что автор всегда может редактировать свой пост, независимо от количества врмени с момента публикации, таким образом стартовый пост топика можно дорабатывать неограниченно: добавлять ссылки на сайты, формировать FAQ и т.п.",
				"added": 1584522578
			},
			{
				"comment_id": 297,
				"body": "Wiki на русском:\n\nhttp://127.0.0.1:43110/1KKzUpPB2D533yKaiWA71GX44DUESsRhxU/\nhttp://127.0.0.1:43110/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/",
				"added": 1584548615
			},
			{
				"comment_id": 298,
				"body": "Кстати, в копилку -- если там будет список того, на чем можно делать сайты для ZN. Вспомнил про движок @caryoscelus-а:\n\n> http://127.0.0.1:43110/1DTjNhj7Mm4hSvEQ2mEUnWp5cP1eaUzHyA\n> HydeView is a duct tape powered web engine to display Jekyll sites dynamically on 0net with minimal (or, ideally, none) source changes. That said, it is obviously so bad that it will probably be only ever used for its author's home page.\n\nМожет кому пригодится.\n\nМне тоже надо бы парочку сайтов на Jekyll в ZN перенести.",
				"added": 1584548941
			},
			{
				"comment_id": 299,
				"body": "> [cra](#comment_25_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Jekyll это же генератор HTML-сайтов на Ruby, который в GitPages юзается? Я о том подумал?\n\nДа, он.",
				"added": 1584551799
			},
			{
				"comment_id": 300,
				"body": "> [gitcenter](#comment_62_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Какого дерева? Которое content.json или что-то другое?\n\nДерева категорий, вероятно.",
				"added": 1584552238
			},
			{
				"comment_id": 306,
				"body": "> [gitcenter](#comment_70_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Его нет в Repository Index, можно туда добавить через настройки.\n\nЯ вижу его там.",
				"added": 1584593821
			},
			{
				"comment_id": 309,
				"body": "> [gitcenter](#comment_74_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А я -- нет, интересно.\n\nЯ на старом Ru-ZeroTalk несколько тем не вижу. И их файлы отсутствуют на локалхосте. Хотя я запрашивал через консоль JS полный апдейт неоднократно. И пользователи у меня не заблокированы.",
				"added": 1584594446
			},
			{
				"comment_id": 310,
				"body": "> [gitcenter](#comment_75_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Попробуй опубликовать data/users/130RBY.../data.json сайта 1iNDExENNBsfHc6SKmy1HaeasHhm3RPcL \n\nЭто не ко мне, репа не моя.\n\nЯ вижу такой data.json:\n\n```\n{\n    \"repo_stars\": {\n        \"18r929Hq8hE5Pi9Zf7ovMQVyn3WcGfxMgu\": true,\n        \"1EtWCTxuY34N4C8incQgjTw8M2S2TPvZwF\": true,\n        \"1DTjNhj7Mm4hSvEQ2mEUnWp5cP1eaUzHyA\": false,\n        \"1EjXEyudstY8dN3F8V5od9KoS1bkAerz9x\": true\n    },\n    \"repo_index\": {\n        \"1EtWCTxuY34N4C8incQgjTw8M2S2TPvZwF\": {\n            \"title\": \"obligatory-empty-page\",\n            \"description\": \"Repo for http://127.0.0.1:43110/13GoB3QYyoqtN7wVpuQfgAQxn7LwucYED7/\",\n            \"date_added\": 1517287913263\n        },\n        \"1DTjNhj7Mm4hSvEQ2mEUnWp5cP1eaUzHyA\": {\n            \"title\": \"hydeview\",\n            \"description\": \"Yet another duct tape powered web engine\",\n            \"date_added\": 1518155776586\n        }\n    }\n}\n```\n\nИ такой content.json:\n```\n{\n \"address\": \"1iNDExENNBsfHc6SKmy1HaeasHhm3RPcL\",\n \"cert_auth_type\": \"web\",\n \"cert_sign\": \"G6kda+9xI+bF1UQhC9zWXKqwtZobwIJr6WV54NCHknEr5QLaFVLK55DNHBTz+tz/VBiP4eC6oi1ydrmJnxg3BnE=\",\n \"cert_user_id\": \"caryoscelus@zeroid.bit\",\n \"files\": {\n  \"data.json\": {\n   \"sha512\": \"fef58ed2d97b85e8c5bd48e2cdda623ef265ae68c9d6ebcc46d3b94a1982a9b7\",\n   \"size\": 595\n  }\n },\n \"inner_path\": \"data/users/13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE/content.json\",\n \"modified\": 1548930145,\n \"signs\": {\n  \"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE\": \"HONkDLzW/RALCrJR0j7Jbm/yYcGM5og+LGcBrSsbs+MnTRvFrFvuwQVVisvgDB2n8vREmXn9JSa0sNirZ9JnjqE=\"\n }\n}\n```\n\nУ тебя их нет?",
				"added": 1584594670
			},
			{
				"comment_id": 311,
				"body": "Кстати, почему у тебя самого лайки без дат реализованы?)",
				"added": 1584594880
			},
			{
				"comment_id": 387,
				"body": "@cra:\n\nЕсли в ближайшие пару месяцев не появишься, откреплю эту тему, чтобы не занимала место в шапке.\n\nЕсли ты вообще в сеть заходишь, хотя бы отпишись, что потерял интерес к этой идее.",
				"added": 1598506490
			},
			{
				"comment_id": 455,
				"body": "Открепить тему, что ли?\n\nАвтор пропал.",
				"added": 1617099036
			}
		],
		"1584531679_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 291,
				"body": "> [gomzik](#comment_134_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А как вообще сообщить зеронету, мол, забей ты на свои правила, смотри на оверрайды)\n\nПлагином, либо непосредственно в ядро встроить.",
				"added": 1584545052
			},
			{
				"comment_id": 292,
				"body": "> [gitcenter](#comment_61_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Плагином лучше не надо, я вот уже попробовал PeerMessage вынести в плагин... никто не пользуется теперь.\n\nПотому что вместо того, чтобы хорошие плагины принимать в апстрим, теперь у нас есть бесполезный механизм подключения плагинов с сайтов (по концептуальной дыре напоминает active-x элементы для IE).\n\nТам же в целом всё нормально с архитектурой, и плагинами очень многое сделано как раз потому, что это кодить удобнее, чем наворачивать спагетти-классы. Плагины нужны для удобства разработки, можно выборочно отключать отдельные части движка, менять реализации на тестовые или на заглушки и т.п.\n\nОднако... http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1584434817_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/",
				"added": 1584546147
			},
			{
				"comment_id": 295,
				"body": "Чем больше думаю над вариантом чисто на SQL, тем больше он мне нравится.\n\nВсё равно ядро при получении апдейтов выполняет обращения к базе. За одно и лимиты посчитает, на производительность не слишком повлияет.",
				"added": 1584547555
			}
		],
		"1584548291_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 296,
				"body": "Не раздаю то, что считаю нарушающим мои личные этические принципы. Для остального -- места не жалко. Нужные сайты добавлены в избранное, остальное просто лежит в общем списке, не мешает.",
				"added": 1584548400
			}
		],
		"1584552124_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 303,
				"body": "*Но кто мы и откуда, когда от этих лет остались пересуды, а нас на свете нет?*\n\nСибирь.\n\nВообще, кто с ЛОРа, должны меня знать по нику. Да и на гитхабе я засвечен по имени. Так что анонимности нема.",
				"added": 1584553446
			},
			{
				"comment_id": 315,
				"body": "> [dimka511](#comment_32_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH): Кстати сколько какой у кого топ подключений?\n\nНо откуда Сингапур?\n\nУ меня стабильно китайцы в топе, 1100+ пиров. Все остальные значительно меньше.",
				"added": 1584615431
			}
		],
		"1584554479_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 305,
				"body": "> [gitcenter](#comment_68_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Попробую скоро ноду +- постоянную поднять, пока, видимо, только ждать остается.\n\nКстати, как вопрос с race condition для запуска нескольких нод решили? Или он не решен?",
				"added": 1584559460
			}
		],
		"1584563412_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 307,
				"body": "Так и есть.\n@gomzik — майор.\n@geekless — куратор.\n@gitcenter — ответственный за международное сотрудничество спецслужб.\n@caryoscelus — агент был залегендирован под интеллектуала-одиночку, но что-то пошло не так.\n@topnet — специалист по вбросам.\n@cra — новый сотрудник, еще не вошел в рабочие процессы.",
				"added": 1584594018
			},
			{
				"comment_id": 308,
				"body": "> [gitcenter](#comment_73_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Впрочем, действительно, модерирование -- явно не то, что мы хотим от ZeroNet'а. Обновление имеет смысл просто для того, чтобы поддерживать форум (тут наконец-то появилась темная тема и подняли лимиты), а не для модерации.\n\nМало ли что мы хотим, главное, что мы можем) Где поддержка хабов для ZeroTalk, я вас спрашиваю, господа?",
				"added": 1584594170
			}
		],
		"1584599632_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 312,
				"body": "> [cra](#comment_38_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Пиры не найдены...\n\nTor",
				"added": 1584600055
			},
			{
				"comment_id": 313,
				"body": "Проверил, уже есть белые IP на раздаче. За NAT открывается.",
				"added": 1584603666
			},
			{
				"comment_id": 314,
				"body": "> [gitcenter](#comment_78_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Круто, +1 белый IP.\n\nХорошо, я тогда пока уйду с раздачи. В таком месте, где связь почти не берёт.",
				"added": 1584605012
			},
			{
				"comment_id": 364,
				"body": "Апну тему, может кто не видел еще.\n\nДобавляйте новости, не стесняйтесь.",
				"added": 1585156548
			}
		],
		"1584632781_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 317,
				"body": "Люди всё портят.",
				"added": 1584633094
			},
			{
				"comment_id": 319,
				"body": "> [pjhfr](#comment_2_1E8Vp3fwjv3cHzj6qx5pCW8DeWK4Cwfenq): он не отличим от https трафика\n\nТоже мне проблема. Подключаешься к трекеру zeronet и блокируешь все айпишники по списку.",
				"added": 1584784213
			},
			{
				"comment_id": 341,
				"body": "> [pjhfr](#comment_4_1E8Vp3fwjv3cHzj6qx5pCW8DeWK4Cwfenq): зеронет может и без трекеров работать\n\n1. Не может.\n2. Тоже мне проблема. Подключаешься через любой узел и блокируешь все айпишники по списку.",
				"added": 1584847564
			},
			{
				"comment_id": 342,
				"body": "> Проверял удоли в настройках все трекеры он все равно работает это первое\n\n1. «Удали».\n2. Возьму пустую копию ZeroNet, которая ни разу не запускалась, удали трекеры, и попробуй подключиться к сети.\n\n> каждый пользователь может стать трекером https://www.youtube.com/watch?v=3IBHKr_SGl8\n\nЕсли б всё было так хорошо без подводных камней.",
				"added": 1584928064
			},
			{
				"comment_id": 343,
				"body": "> [cra](#comment_53_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Что случилось с запятыми?\n\nОни удолились :)",
				"added": 1584959108
			}
		],
		"1584803286_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC": [
			{
				"comment_id": 324,
				"body": "> Хорошо было бы иметь возможность такого отображения на других форумах и страницах с комментариями, чтобы продуктивнее заниматься их чтением, не отвлекаясь на скроллинг.\n\nНапишите соответствующий CSS. Внедрить не проблема.",
				"added": 1584803524
			},
			{
				"comment_id": 338,
				"body": "> [jixuucix](#comment_20_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Или планируется реализовать какое-то переключение стилей?\n\nДа.",
				"added": 1584808392
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 336,
				"body": "Включил сегодня случайно телевизор на НТВ. Хватило меня на 15 минут:\n*короновирус, Евросоюз, Украина, Донбасс, Украина, короновирус, Порошенко, Испания, Евросоюз, Украина*... и так кругами, и бред на бреде, какие-то абсолютно безумные истории, которые в 90-е только в самой желтой прессе можно было найти. Срыв покровов с загнивающего запада.\n\nВыключил.\n\nМожно еще лет 5 не включать. Надеюсь, за это время человечество не деградирует окончательно.",
				"added": 1584807928
			}
		],
		"1584987798_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 344,
				"body": "Я смотрю, у нас тут каждый второй знает португальский.",
				"added": 1585050679
			},
			{
				"comment_id": 345,
				"body": "> [topnet](#comment_48_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): просто думаю откуда права админа вы наверно давно в зеронет ?\n\nЯ назначил. Есть претензии?",
				"added": 1585050738
			},
			{
				"comment_id": 365,
				"body": "> [topnet](#comment_49_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): да есть исправления поста без это одна из форм цензуры\n\nИсправление этого поста есть попытка помочь и сделать за вас то, что является **вашей** обязанностью при общении с людьми: доносить информацию в понятном виде.\n\nПотрудитесь писать на русском, в крайнем случае -- на английском, украинском или белорусском, как на языках, более-менее понятных для многих посетителей здесь.\n\nМожно считать это официальным предупреждением.\n\n`______________________________`\n\nУчастники этого форума заинтересованы в обмене в первую очередь полезной и интересной информацией, чтобы сделать этот форум и в целом ZeroNet привлекательным для общения местом и раскрыть потенциал кооперативного принципа организации сети.\n\nЕсли вы попытку кооперации воспринимаете как форму цензуры, вы вольны свой неконтроллируемый поток постов публиковать на любом другом ресурсе сети.",
				"added": 1585189811
			}
		],
		"1585023084_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 352,
				"body": "> [jixuucix](#comment_21_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): content.json download failed\n\nНужен свежий ZeroNet с поддержкой utf8 в именах файлов.",
				"added": 1585138024
			},
			{
				"comment_id": 353,
				"body": "Обнаружил уже после того, как опубликовал сайт.",
				"added": 1585138045
			},
			{
				"comment_id": 354,
				"body": "> [jixuucix](#comment_22_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): [...]\n\nНу, туда ведёт ссылка с ZeroHello. Наверное это что-то означает)\n\nНо я им не пользовался.",
				"added": 1585142335
			},
			{
				"comment_id": 355,
				"body": "> [jixuucix](#comment_24_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): необязательные файлы у всех сайтов потёрлись и начали заново загружаться.\n\no_O",
				"added": 1585153625
			},
			{
				"comment_id": 356,
				"body": "> [jixuucix](#comment_25_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): \n\nНе грузится.",
				"added": 1585153984
			},
			{
				"comment_id": 357,
				"body": "> [jixuucix](#comment_24_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): Кстати, видеофайлы в этом блоге почему-то сами загрузились, без «Help distribute».\n\nПотому что я читер. Тут в комментах есть подробности: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS/1585076707",
				"added": 1585154055
			},
			{
				"comment_id": 358,
				"body": "> [jixuucix](#comment_26_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC):  Вот ссылка на запись в зероблоге, на всякий случай.\n\nНету записи. Возможно, вы блог не подписали / не опубликовали.",
				"added": 1585154286
			},
			{
				"comment_id": 359,
				"body": "> [geekless](#comment_358_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А, у меня ещё и трекеры поломались, вообще отлично.\n\nХз конечно, у меня не было таких проблем при обновлениях. Я постоянно на свежей сборке сижу. В любом случае, добро пожаловать на bleeding edge! :)",
				"added": 1585154347
			},
			{
				"comment_id": 360,
				"body": "> [geekless](#comment_358_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Нету записи. Возможно, вы блог не подписали / не опубликовали.\n\nтеперь есть.",
				"added": 1585154386
			},
			{
				"comment_id": 361,
				"body": "А сами файлы-то физически на месте?\n\nПроблемы с учётом опциональных файлов были, насколько я помню, прямо с момента появления этой фичи. Вот у меня вообще на **моём собственном** блоге показывает, что я **скачал 2 гига из 200 МБ доступных всего**.\n\nА бывает так: закачиваешь файл на ZeroUp, он там успешно регистрируется, раздаётся, даже засчитывается статистика раздачи. При этом сайт считает, что файла у меня нет, и предлагает его сидировать. (Нажимаешь на SEED -- ноль реакции)",
				"added": 1585154599
			},
			{
				"comment_id": 362,
				"body": "> [jixuucix](#comment_28_1NBBE1nwLCusP9KVjPTgGAxyTMVR53ZYGC): У меня было такое, поэтому я сразу проверил размер каталогов с этими сайтами, а там — кот наплакал, а не все эти гигабайты.\n\nОго! А вот это серьёзно... Наверное стоит написать в багтрекер.",
				"added": 1585155003
			},
			{
				"comment_id": 368,
				"body": "Нужно будет сделать выпадающий список с настройками, аналогично как настраивается подписка на уведомления.",
				"added": 1585215056
			}
		],
		"1585226964_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 370,
				"body": "> [xandanyesm](#comment_31_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY):  ну и отзывы почитать надо там же )\n\nНаписание отзывов -- отдельный вид самовыражения, имеющий мало отношения к тому, на какую тему они пишутся. (Я вот думаю, а *отзывы на отзывы* как массовое хобби когда человечество изобретёт?) \n\nКому-то зашло, кому-то не зашло, это уж как получится.",
				"added": 1585230739
			},
			{
				"comment_id": 371,
				"body": "Ссылка, чтобы долго не искать: https://fantlab.ru/work504376",
				"added": 1585231795
			}
		],
		"1585191373_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 372,
				"body": "Прилично пиров собралось. Этот форум читает больше пользователей, чем отписывается в темах. Это радует.",
				"added": 1585238347
			}
		],
		"1585342885_1MPcrHSmkXTCxVLNRT42z9JYETbdsmgmdG": [
			{
				"comment_id": 374,
				"body": "Не знаю, как это реализовать технически.\n\nЕсли обратиться к классике, то многие мультиплеерные RTS игры работают без сервера. Там используется строго детерминированная последовательность вычислений, таким образом, что попытка любого из участников использовать читы, приведет к аварийному завершению игры.\n\nНо на другие жанры такое решение не масштабируется.",
				"added": 1585366733
			}
		],
		"1590837476_1JQ4t8CN9SneVvs69mGzgjwotoqPm6rL8N": [
			{
				"comment_id": 375,
				"body": "> [zombibi](#comment_9_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): в смысле пользователя. что дает виндовс?(массово) оффис, приложения с ним связанные, таже самая бухгалтерия, игры. в текущий момент - хорошо или плохо реализовано на андроид (оффисные приложения), игры - не хуже.\n\nБольшинство таких вещей работает под Wine в Linux.\nТе, что не работают, вряд ли заработают в ReactOS, потому что сама ReactOS, чёрт побери, не работает.\n\nТеоретически проект полезный. Практически — нет.\n\nТак покопаться из интереса можно, но вряд ли есть смысл серьёзно вкладываться. Просто пока её допилят до состояния хотя бы базовой совместимости с Win7, десятка успеет выпустить еще 20 релизов и полностью уйти в облака.",
				"added": 1597636658
			},
			{
				"comment_id": 379,
				"body": "> [zombibi](#comment_51_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): menuetos.net\n\nТогда уж вспомнить о KolibriOS. Вот только официальный сайт лежит -- вместе с форумом разработчиков и сорцами. Похоже, что Колибри всё.",
				"added": 1597729089
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 376,
				"body": "> [xandanyesm](#comment_38_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): разработка zeronet остановлена, я так понимаю? )\n\nКем?",
				"added": 1597637196
			},
			{
				"comment_id": 377,
				"body": "> [xandanyesm](#comment_39_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): нерыбовым... кем же еще?\n\nВ отпуске, наверное. Как в прошлом году.\n\nДругой вопрос более актуален:\nДвижок сети готов на 90%. Но нет желающих делать движки сайтов.",
				"added": 1597661003
			},
			{
				"comment_id": 380,
				"body": "> [xandanyesm](#comment_41_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY): а чтобы началось создание нужно аудиторию порядка на 2 больше, чего тут не будет уже никогда\n\nНужно просто пару человек, кто напишет код.\nДостаточно посмотреть на любые хобби-проекты от Total Commander до ядра самой ZeroNet: всё это сделано силами очень ограниченного по численности коллектива, порою одним человеком.\nНа проект размером с Microsoft Office мы не замахиваемся:)\n\nВот как раз пойду доделывать режимы сортировки для ZT++. Нужен недефолтный режим сортировки на OpenNews.",
				"added": 1598099458
			}
		],
		"1598243806_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 381,
				"body": "![](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1598246063-323430-1920x1080.jpg)",
				"added": 1598246094
			},
			{
				"comment_id": 382,
				"body": "![](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/1525789814-wallpaper-2576830.jpg)",
				"added": 1598246308
			},
			{
				"comment_id": 383,
				"body": "![](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/02480_cumbriantwilight_2560x1600.jpg)",
				"added": 1598246342
			},
			{
				"comment_id": 384,
				"body": "Вставка видео:\n\n![](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/David%20Bisbal%20-%20Esta%20Ausencia.MP4)\n\n![](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/Jennifer%20Lopez%20-%20Olvdame%20%20Pega%20la%20Vuelta%20[En%20Vivo]%20ft.%20Marc%20Anthony.MP4)",
				"added": 1598246544
			},
			{
				"comment_id": 385,
				"body": "> [beeholder](#comment_17_1JZKKzmvBupAZGgJuWQzmNLo1MBs5N9rn): здорово!а видео как вставлять?\n\nТак же как картинку. Если имя файла оканчивается на .mp4, форум понимает, что это ссылка на видео.",
				"added": 1598340625
			},
			{
				"comment_id": 390,
				"body": "> [dwre](#comment_1_1HZ4SeHiQyJWrkux7HWbjA9AY7rHufWP32): наконец то картинки и видео появились\n\nДавно были, с марта. Добавил только автозапрос сайтов.",
				"added": 1598758532
			}
		],
		"1589810453_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 386,
				"body": "Нет ни одного пира с файлами онлайн.",
				"added": 1598342886
			}
		],
		"1598358733_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 388,
				"body": "Обычный бытовой дихлофос случайно не к этой же группе веществ относится?\n\nВообще при большом желании кого-то отравить -- достать вещества не такая сложная задача. Так что круг подозреваемых может быть весьма широк.\n\nС другой стороны, если речь идёт именно о боевом отравляющем веществе, тут всё понятно.",
				"added": 1598609722
			},
			{
				"comment_id": 389,
				"body": "> [zombibi](#comment_55_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): лично я предлагаю посчитать кому это выгодно (Навайльный отровлен, героический противник кровавому режиму и т.д.)\n\nОчень вероятно, Путина подставляет кто-то из «своих».\nА если сейчас еще санкций накрутят, значит и США в деле.",
				"added": 1598647305
			}
		],
		"1601280570_1Fv7nPjCj4VGoNSZKWzdNcm5aYSHo93Rbu": [
			{
				"comment_id": 391,
				"body": "Beaker не работает. Контента нет. А то, что есть, — нихрена не открывается.",
				"added": 1601878654
			}
		],
		"1603651874_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 394,
				"body": "> [gitcenter](#comment_119_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Раз уж у нас тут люди полезли обсуждать идеи, давайте переползем во что-то нормальное, а не русский ZeroTalk, который никто не читает. \n\nБудто в английском есть кому читать.",
				"added": 1603657515
			},
			{
				"comment_id": 395,
				"body": "Иван, зачем столько всего за раз?\n\n1. Гитлаб, при том что апстрим на гитхабе.\n2. Сайт с нерабочим движком.\n3. Какие-то правила непонятно для кого, при том что код писать будут хорошо если 4 человека. Чтобы 20 человек писало PR-ы, на реализацию которых никогда не будет времени, и еще 10 ныло про модерастию и кровавый режим?\n\nПросто сделай репу на гитхабе, куда можно слать PRы, если тебе моя репа не нравится, хотя я тебе инвайт туда кидал.",
				"added": 1603658437
			},
			{
				"comment_id": 396,
				"body": "> [gitcenter](#comment_121_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Дело не 'в английском', а 'на английском'. Одно дело -- поболтать тут и обсудить идеи плагинчиков, другое -- продумать архитектуру, семплы кода написать, документацию, в конце концов. Просто сейчас у нас получается чисто закрытое сообщество разработчиков -- ты, да я, да еще пара человек с этого форума. А условным anshorei/itsmemario1, людям, которые пилят свои сервисы и переписывают ZeroNet на Rust, я должен пересказывать уже по факту мерджа, что ж мы такое напилили?\n\nЯ не знаю, что это за чудо-люди, которые переписывают ZeroNet на Rust, при том что сопровождать код на питоне за год не нашлось желающих.\n\nВ этом и проблема, что каждый хочет стать главой маленького, но гордого зеронетика.\n\nНасчёт языка. Если я делаю законченный кусок кода, я к нему оформлю документацию на английском. Для начала надо понять, что у меня вообще на локалхосте скопилось. Уж разгребать свои черновики я не обязан на английском, слава богу. На русском я печатаю раза в 4 быстрее.",
				"added": 1603658986
			},
			{
				"comment_id": 397,
				"body": "> [gitcenter](#comment_123_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Пардон, но мне GitHub уже в горло не лезет.\n\nНу вот у кого-то тулкитофобия к питону, а у меня считай, что к гитлабу. Как его интерфейс вижу, хочется взять ружьё и пойти расстреливать дизайнеров. Хорошо хоть он тормозить перестал.\n\nА если отвлечься от вкусовщины, то это просто менее удобно, чем хоститься на той же площадке, что и апстрим.\n\nЧто-то вспомнилось, как LXDE переезжал с SF сначала на self-hosted, а потом -- на гитхаб. А потом всё равно загнулся. Всё это только лишняя суета. Мой поинт был в том, что ты хочешь сразу много всего за раз: и форум, и новый хостинг кода, и переработку архитектуры, и масштабируемость разработки под пару десятков девелоперов. Ну если ты считаешь, что это оптимальный путь, то кто я такой тебя переубеждать.\n\n> Если б я перенес не на GitLab, а в Git Center, было бы лучше, что ли?\n\nНу лично мне было бы лучше, чем сидеть в еще одном сервисе на серверах MS. Но в Git Center слабый UI, и к сожалению, git{хабу,лабу} он по этому показателю проигрывает.",
				"added": 1603659557
			},
			{
				"comment_id": 398,
				"body": "> [gitcenter](#comment_128_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Слушай, назови мне хоть один зеронетик, кроме nofish'евского. zerunet не в счет, он пока не работает почти, и я уже понял, что писать с нуля, а не заменять куски по чуть-чуть -- гиблое дело. Что вообще еще есть? Ну вот я и хочу сделать один большой и гордый зеронетик.\n\nТак их нет, потому что на 4-й месяц отладки многопоточного сетевого кода энтузиазм иссякает, если до этой стадии дело вообще дойдёт.\n\nЭто при том, что за 4 года никто не сделал нормальный форумный движок. Не форкнул код ZeroWiki. Не довёл до ума ZeroMe. И т.п.\n\n> А все чертовски просто. Архитектура py-ZeroNet вообще не способствует адекватному введению content-addressed data и подобных фич, вон, даже база работает через пень-колоду, когда, казалось бы, все легко. Я думаю, nofish поэтому и остановил разработку после issue о content-addressed data. Да и медлительность на всего лишь 300 сайтах (да знаю я что пиров много) тоже поражает, переписывание на другой язык должно барьер поднять.\n\nУ py-ZeroNet есть одно незаметное при первом взгляде преимущество, которого не имеют замечательные альтернативные реализации: он будучи кривым и косым всё-таки работает, а всё остальное -- нет. Поэтому любое улучшение в его коде ведёт к пользе для пользователей прямо завтра, а НЕ в его коде -- по моим предположениям -- никогда.\n\nЯ с большим непониманием посмотрю на любого, кто скажет, что сделать content-addressed data с нуля вместе со всем остальным движком проще, чем переделать архитектуру существующего кода. Тем более, что код в целом не плох.\n\nА на питон прекрасно ложится архитектура плагинов, что сильно разгружает код core-части.",
				"added": 1603661450
			},
			{
				"comment_id": 399,
				"body": "> [gitcenter](#comment_134_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А вот сферическому пользователю в вакууме что нужно? Мне ZeroTalk в основном хватает, ZeroTalk++ -- с лихвой. Вот сейчас понадобились разрешения -- ну вот я и клепаю DevZone, а ты говоришь, что не нужно.\n\nЧо-т я в 5 утра злой, и читая, как \"всего хватает\" в движке, где даже нельзя посмотреть профиль пользователя и список его топиков и комментов, могу сказать что-нибудь неприличное. Так что пойду-ка я спать.\n\n> Все было хорошо, пока кто-то не увидел, что nofish правит ядро по желанию левой пятки, плагины жестко привязаны к функциям с постоянно меняющимися API и вообще. Питон хорош для плагинов, пока ядро их поддерживает именно как плагины, а не модули.\n\nПубличного API нет, поэтому всё хорошо. Плагины -- способ построения архитектуры приложения, а не гарантии для внешних модулей.",
				"added": 1603662076
			},
			{
				"comment_id": 400,
				"body": "> [gitcenter](#comment_138_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Давай так. Я пытаюсь написать что-то серьезное, что может сломать совместимость с кучей устройств. Я хочу услышать у людей, ломается что-то или нет, какие у них операционки и т.д. Как прикажете это обсуждать на русском форуме в русской теме?\n\nЯ удалил ОП. Что опять не так?\n\nМоё видение ситуации:\n* Nofish хер знает где, да и мои PR в принципе вряд ли принял бы, в любом случае.\n* Тебе некогда заниматься мелочью, ты пишешь что-то серьёзное.\n* Писать 5 плагинов и правки к ядру, которые потом хрен знает куда посылать -- ну так себе удовольствие.\n* Заниматься дистрибьюцией мне некогда и нет желания. Мне для запуска достаточно `docker build -t local/zeronet .`, а делать пакеты под винду я не умею и учиться этому у меня нет времени. На мне еще пяток опенсорс проектов, в которых я тоже нихрена не успеваю.\n\nКороче я хз. Я тут вообще мысли вслух писал и не знаю, чем моя тема так помешала.",
				"added": 1603696737
			}
		],
		"1603798134_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 401,
				"body": "А сейчас так:\n\nВ статистике 3 ошибки доступа к трекеру, при этом на трекере все три раза пир анонсирован.",
				"added": 1603799268
			},
			{
				"comment_id": 402,
				"body": "> [smashbuckler](#comment_7_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Сделайте форк с imachug и ковыряйте его. Чтобы он был где-то один. Чтобы не получилось, что \"один форк сделаю я, другой сделает ещё кто-то\" - и будет хаос)\n\nОн не хочет форк, он хочет нескучный девелопмент с CAS и Рустом. Не шантажом же его заставлять.",
				"added": 1603805489
			},
			{
				"comment_id": 403,
				"body": "Попутно выясняется, что дефолтная система логирования в питоне настолько бесполезная, что от её наличия вообще никакого толку. Сейчас для начала наделаю костылей для лога, а потом уж возьмусь за логику приложения.",
				"added": 1603805695
			},
			{
				"comment_id": 404,
				"body": "> [smashbuckler](#comment_8_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): У меня, кстати, не видно этого сообщения от geekless - а ты его уже откуда-то сцитировал о_О И ничего не подгружается( Вот с чем это связано?\n\nДовольно часто бывает.\n\nОбщая связность сети, основанная на идее \"каждый пир отсылает апдейты 10-ти случайным пирам\" оказалась не такой хорошей, как планировалось.",
				"added": 1603812334
			},
			{
				"comment_id": 405,
				"body": "> [smashbuckler](#comment_9_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Вопрос: какова роль трекера и как им стать? И можно ли вообще стать трекером? Каковы функции трекера и какими данными он оперирует? Я в этой теме плаваю... Если есть толковый ресурс (en/ru/jp), на который меня можно отправить, то можно скинуть ссылку.\n\nТрекер хранит списки известных пиров для каждого сайта.\n\nЭто обычный узел ZeroNet, на котором включен плагин Bootstrapper. (Или в моём случае -- форкнутый от него плагин TrackerZero.)\n\nДальше начинаются особенности и сложности:\n\n* Трекер может поднят как на IP-адресе, так и на onion-адресе.\n* Список известных трекеров вшит в код ZeroNet, и также его можно задать через настройки.\n* Также пиры обмениваются списками трекеров между собой самостоятельно. Это отдельный список, не тот, что в настройках. Задумка в том, что если узел является трекером, то он знает себя как «работающий трекер». Когда другие узлы спрашивают его насчёт известных трекеров, он говорит \"вот, я знаю один\". Эти узлы распространяют адрес дальше. Так постепенно адрес становится известен всем.\n* Но какого-то чёрта nofish ограничил обмен списками только для трекеров на IP-адресах.\n* Не помню точно, но Bootstrapper вроде сам не умеет делать для себя фиксированный адрес onion. В TrackerZero я это исправил. TrackerZero сам создаёт для себя фиксированный адрес, сам сохраняет от него приватный ключ в файл, сам повторно использует его при после перезапуска.",
				"added": 1603819546
			},
			{
				"comment_id": 406,
				"body": "Доработки по плагинам пока тут: https://github.com/zeronet-enhanced/ZeroNet/tree/plugins/plugins",
				"added": 1603819985
			},
			{
				"comment_id": 407,
				"body": "> [gitcenter](#comment_140_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Вот почему всегда так? почему с человеком говоришь спокойно, а он на тебя кричит и обижается?\n\nВроде никто не кричит. Ты сказал, что я ничего не понимаю в разработке, ну я и не лезу.\n\n> Decentralized development -- ну, круто будет в будущем; мне удобнее сделать сразу, оценить, работает или нет сразу, а не на ходу перестраиваться. Не хочешь DevZone -- отложим в стол, а я потихоньку буду пилить как форк и вливать всякие фичи оттуда в ZeroTalk. Хочешь остаться на питоне -- не будем переписывать, я пока вроде еще не упираюсь в пределы связки sqlite+python по скорости, а сетевой код, наверное, можно оптимальнее переписать, там сейчас очень все накручено.\n\nCAS — имелся в виду Content-Addressable Storage.\n\nЯ не понимаю одной вещи: почему моё копошение в своём углу провоцирует такие последствия. Допустим, я бы вообще сюда год не заходил. Это как-то мешало бы тебе писать код? Я думаю, что нет. Точно так же моё посещение сети никак не мешает.\n\nЯ не вижу актуальных совместных точек для работы, потому что направления слишком разные. Пока ты у себя думаешь о FUSE, Rust или еще чем-то таком, я размышляю над вопросами наподобие таких:\n\n*«Как бы так запатчить ядро , чтобы потом было проще мерджиться с апстримом?»*\n\n*«А может держать пач-сеты в отдельной тулзе наподобие Quilt?»*\n\n*«Или уже забить на согласованность кодовой базы и херачить прямо в основную ветку форка?»*\n\nМожно я не буду снова писать на тему того, почему переписывание приложения с нуля вместо того, чтобы наладить механизм непрерывной интеграции и дистрибьюции для форка, закрыть актуальные проблемы движка и интегрировать пару десятков накопившихся пулл-реквестов — это плохая идея? В конечном счёте, это только моё личное мнение, и оно не обязано быть верным. Но если ты не хочешь заниматься разработкой этой кодовой базы, то почему у меня об этом должна болеть голова? О Rust, смене движка БД и прочем таком я не думаю, равно как никого не могу заставить думать о своих задачах. У меня нет цели кого-то принуждать, это не работа за зарплату, и подчинённых у меня тут нет.\n\nГод назад или около того ты мне писал, что нет смысла делать ZT++, так как ты делаешь новый форумный движок. (Или речь шла о ZB++? Уже не помню.) Но год прошел, движка в паблике нет, а ZT++ хоть и через пень-колоду и с десятком не закрытых issue, но работает. Это печальная реальность, как пишется опенсорс в одно лицо, если только ты не Fabrice Bellard.\n\n> Не хочешь DevZone -- отложим в стол, а я потихоньку буду пилить как форк и вливать всякие фичи оттуда в ZeroTalk.\n\nЕсли фичи общего назначения, то что помешало отправить патчи мне для ZT++? Если фичи уникальные для конкретного форума, то что помешало хотя бы отправить мне интеграционные патчи, чтобы тебе потом самому было бы проще апдейтить движок?\n\nЕсли так ставить вопрос, то я вообще не знаю, выложены ли исходники этой DevZone, и если да, то куда. Как бы я мог как-то её пилить даже теоретически? Тем более, что меня и не звали.\n\nНу ладно, фичи, видимо, не общего назначения, а синхронизация кода с ZT++ либо не предполагается, либо не представляет сложностей. Хозяин-барин, на то она и GPL.",
				"added": 1603821301
			},
			{
				"comment_id": 409,
				"body": "Ох как интересно...\n\n```\n[18:55:31] - 95.216.68.23:21775 Getting connection error: AttributeError: 'NoneType' object has no attribute 'get' in Peer.py line 105 > ConnectionServer.py line 225 > 218 > Connection.py line 178 (connection_error: 1, hash_failed: 0)\n\n[18:55:33] - 2a01:4f9:2b:468::2:21775 Getting connection error: AttributeError: 'NoneType' object has no attribute 'close' in Peer.py line 105 > ConnectionServer.py line 225 > 218 > Connection.py line 168 (connection_error: 1, hash_failed: 0)\n\n[18:55:54] - 2a01:4f9:2b:468::2:21775 Getting connection error: AttributeError: 'NoneType' object has no attribute 'settimeout' in Peer.py line 105 > ConnectionServer.py line 225 > 218 > Connection.py line 179 (connection_error: 3, hash_failed: 0)\n```",
				"added": 1603825926
			},
			{
				"comment_id": 410,
				"body": "Код в сетевой подсистеме довольно низкого качества. Повсюду нарушения инкапсуляции.",
				"added": 1603860029
			},
			{
				"comment_id": 411,
				"body": "> [gitcenter](#comment_141_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): но зато, может, работает быстрее, чем если писать честно?\n\nНе думаю, что скорость там можно найти. А вот скрытые тормоза из-за исключений, которые код молча подавляет и потом висит — вероятно.\n\nПосмотри в `Connection.py` и `ConnectionServer.py`. Смешение уровней абстракции, функции по полтора экрана длиной и несогласованное использование членов класса в разных частях кода. По хорошему, это надо переписать.\n\nСейчас лог костылями обвешаю, чтобы можно было включить вывод дебага раздельно для разных модулей, и займусь.\n\n> Ну тут на самом деле хороший вопрос, а как надо делать.\n\nДа хотя бы по основам Фаулера порядок навести, чтобы код не использовал одну переменную в 4 разных модулях.",
				"added": 1603868801
			},
			{
				"comment_id": 412,
				"body": "Нашел забавный глитч.\n\n```\nclass FileServer(ConnectionServer):\n\n    def __init__(self, ip=config.fileserver_ip, port=config.fileserver_port, ip_type=config.fileserver_ip_type):\n        self.log = logging.getLogger(\"FileServer\")\n\n        . . .\n\n        ConnectionServer.__init__(self, ip, port, self.handleRequest)\n\n```\n\nВызов `ConnectionServer.__init__` перезаписывает значение переменной `self.log`, и после этого `FileServer` в логах никакой не `FileServer`.",
				"added": 1603871027
			},
			{
				"comment_id": 413,
				"body": "Пока что немного костылей для лога: https://github.com/zeronet-enhanced/ZeroNet/commits/massive-rework",
				"added": 1603872441
			},
			{
				"comment_id": 414,
				"body": "Давно это код никто не перечитывал и не делал ревью.\n\nКуча комментариев с числами, которые врут. Например:\n\n```python\n        if num is None:\n            if len(self.peers) < 50:\n                num = 3\n            else:\n                num = 6\n        need = min(len(self.peers), num, config.connected_limit)  # Need 5 peer, but max total peers\n```",
				"added": 1603881665
			},
			{
				"comment_id": 415,
				"body": "Похоже, что замирания в распространении контента по сети связаны с тем, что каждый пир стремится «дружить» с пирами, к которым он либо уже подключен, либо был подключен в недавнем прошлом. Так естественным образом формируются изолированные области, теряющие связность с другими областями.\n\nДа еще и *«Prefer newer clients»*. Очень сомнительная строка. А старым версиям кто будет апдейты посылать — дядя Стёпа?\n\n```\n        peers = self.getConnectedPeers()\n        num_connected_peers = len(peers)\n\n        random.shuffle(peers)\n        peers = sorted(peers, key=lambda peer: peer.connection.handshake.get(\"rev\", 0) < config.rev - 100)  # Prefer newer clients\n\n        if len(peers) < limit * 2 and len(self.peers) > len(peers):  # Add more, non-connected peers if necessary\n            peers += self.getRecentPeers(limit * 2)\n\n        peers = set(peers)\n```",
				"added": 1603887194
			},
			{
				"comment_id": 423,
				"body": "Коллекция багов",
				"added": 1604087876
			},
			{
				"comment_id": 424,
				"body": "```\n[19:35:12] - Unhandled exception: JSONDecodeError: Expecting value: line 1 column 1 (char 0) in gevent/threadpool.py line 142 > SiteStorage.py line 373 > json/__init__.py line 293 > ... > json/decoder.py line 355\nTraceback (most recent call last):\n  File \"/usr/lib/python3.8/site-packages/gevent/threadpool.py\", line 142, in __run_task\n    thread_result.set(func(*args, **kwargs))\n  File \"/root/src/Site/SiteStorage.py\", line 373, in loadJson\n    return json.load(file)\n  File \"/usr/lib/python3.8/json/__init__.py\", line 293, in load\n    return loads(fp.read(),\n  File \"/usr/lib/python3.8/json/__init__.py\", line 357, in loads\n    return _default_decoder.decode(s)\n  File \"/usr/lib/python3.8/json/decoder.py\", line 337, in decode\n    obj, end = self.raw_decode(s, idx=_w(s, 0).end())\n  File \"/usr/lib/python3.8/json/decoder.py\", line 355, in raw_decode\n    raise JSONDecodeError(\"Expecting value\", s, err.value) from None\njson.decoder.JSONDecodeError: Expecting value: line 1 column 1 (char 0)\n```",
				"added": 1604087896
			},
			{
				"comment_id": 425,
				"body": "```\n[19:38:35] - Unhandled exception: FileNotFoundError: [Errno 2] No such file or directory: './data/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/data/users/1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp/content.json' in gevent/threadpool.py line 142 > SiteStorage.py line 372 > 258\nTraceback (most recent call last):\n  File \"/usr/lib/python3.8/site-packages/gevent/threadpool.py\", line 142, in __run_task\n    thread_result.set(func(*args, **kwargs))\n  File \"/root/src/Site/SiteStorage.py\", line 372, in loadJson\n    with self.open(inner_path, \"r\", encoding=\"utf8\") as file:\n  File \"/root/src/Site/SiteStorage.py\", line 258, in open\n    return open(file_path, mode, **kwargs)\nFileNotFoundError: [Errno 2] No such file or directory: './data/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/data/users/1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp/content.json'\n```",
				"added": 1604087907
			},
			{
				"comment_id": 426,
				"body": "```\nOct 30 15:52:06.000 [warn] Rejecting SOCKS request for anonymous connection to private address [scrubbed]. [2 similar message(s) suppressed in last 300 seconds]\n```\n\nZeroNet фильтрует локальные IP-адреса... Но видимо, не всегда.",
				"added": 1604087949
			},
			{
				"comment_id": 427,
				"body": "```\n[18:32:45] TrackerStorage New tracker found: zero://127.0.0.1:15441\n```\n\nИ кто-то проаносировал локалхост в качестве трекера.",
				"added": 1604087991
			},
			{
				"comment_id": 431,
				"body": "Такие ошибки должны идти в лог не только на отладочном уровне. Как минимум, INFO.\nА также — в интерфейс в браузере.\n```\n[22:49:35] Site:1Gfey7..fcdp content.json: verify sign error: VerifyError: Invalid old-style sign in ContentManager.py line 1002\n```",
				"added": 1604098796
			},
			{
				"comment_id": 432,
				"body": "И нужно пофиксить два чертовых бага из https://github.com/HelloZeroNet/ZeroNet/issues/2476",
				"added": 1604098903
			},
			{
				"comment_id": 433,
				"body": "При запуске чистой установки на винде процентах в 20 случаев сайты не открываются, пока не перезапустишь ZeroNet. Уже давно так. И никто не знает почему.",
				"added": 1604099061
			},
			{
				"comment_id": 434,
				"body": "ZeroNet не должен работать «как-то» после 10 перезапусков и чисток DB. ZeroNet должен работать как часы.\n\nХватит пилить фичи, которые потом не работают толком. Кто-то должен пофиксить сраные баги.",
				"added": 1604099103
			},
			{
				"comment_id": 437,
				"body": "https://github.com/HelloZeroNet/ZeroNet/issues/2672\n\nКак гритца, на этом наши полномочия всё.",
				"added": 1604500374
			}
		],
		"1603821547_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [],
		"1604363170_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 438,
				"body": "> [query](#comment_5_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg): Воможно, я не верно вас понял. Имеете ввиду, что весь ваш траффик завёрнут в Tor и регистрация нормально проходит? Ок. Но это второстеменная проблема.\n\nДа, браузер проксируется через Tor. Пусть собирает адреса его выходных узлов.",
				"added": 1604570162
			},
			{
				"comment_id": 439,
				"body": "> [query](#comment_2_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg): Если на ZeroNet сайт поместить картинку из интернета - она будет грузиться напрямую, а не через Tor.\n\nДа, и это проблема, которая должна быть исправлена: https://github.com/HelloZeroNet/ZeroNet/issues/2643\n\nПо этой причине я вообще использую ZeroNet в браузере, который \"завернут\" на порт, где нет прокси. А если нужно зарегистрировать новый zeroid, временно запускаю отдельную копию tor на этом порту.",
				"added": 1604570234
			},
			{
				"comment_id": 440,
				"body": "> [query](#comment_3_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg): В целом это не этичное поведение, сервис имеет возможность собирать IP адреса в соответствии с профилями. При том что пользователь ожидает, что соединение идёт через Tor. Это зашкварище мягко говоря. Просто предупреждаю людей быть аккуратными. То что вы пишете в zeronet через zeroid если в систем5 не стоит vpn - не анонимно.\n\n> [query](#comment_3_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg): То что вы пишете в zeronet через zeroid если в системе не стоит vpn - не анонимно.\n\nУ меня вообще имя и фамилия в коммитах и профиль на гитхабе, так что уже как-то поздно %)\n\nЕсли по существу, то поправка:\n\nНе \"вы пишете в zeronet через zeroid\", а только \"вы регистрировали zeroid\". После регистрации zeroid полностью автономен, и если вы выполнили регистрацию через tor, то дальше он за вами следить не может.\n\n> В целом это не этичное поведение\n\nУ нас вообще проблема в том, что многие сервисы представляют собой демо-версии, сделанные на коленке. А неэтичное поведение демо-версий — наименьшая из проблем. Немного расскажу вам историю:\n\nZeroNet исходно не имела многопользовательских сайтов. Чтобы сделать первый такой сайт (ZeroBoard), было использовано клиент-серверное решение. Когда вы что-то постите с ZeroBoard, ваш браузер делает POST-запросы на обычный сервер. Сервер их обрабатывает, обновляет содеоржимое сайта и постит его в ZeroNet. Таким образом ZeroNet выполняла только функцию сети доставки контента, своего рода кэш.\n\nДальше была первая версия [ZeroTalk](http://127.0.0.1:43110/1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ/), о которой сейчас уже все забыли. Там вы могли постить на форум без участия сервера, но создание учётных записей выполнял сервер.\n\nПотом была идея сертификатов, и был запущен ZeroID. Так мы пришли к нынешнему состоянию сети.\n\nЧто дальше? Очевидный шаг: запрос на получение ID должен маршрутизироваться через саму ZeroNet. Этот шаг сделан здесь: http://127.0.0.1:43110/kxonet.bit/?/create-id , а возможным он стал благодаря плагину PeerMessage by @gitcenter.\n\nК сожалению, сейчас этот центр идентификации лежит, а его разработчик покинул ZeroNet.",
				"added": 1604570937
			}
		],
		"1614402754_168Diza6QrAArkHB5AFJESWpNAkKgUWvtw": [
			{
				"comment_id": 443,
				"body": "Ну вот поставил я её. Сам сижу за NAT. Есть VPS-ка. Как мне пустить ретрошару через порт VPS-ки?",
				"added": 1616390789
			},
			{
				"comment_id": 444,
				"body": "> [dgfghyt](#comment_3_14bDUXb6RppLjK3ygbTaeoWGzzp8WY9esv): Он может и за натом работать если есть хоть один человек с внешним ip\n\nДопустим, я сам хочу быть человеком с внешним IP. :) Видимо, придётся VPN поднимать между ноутом и сервером.\n\nА через TOR кто-нибудь пользуется сабжем? Я правильно понимаю, что узлы тор могут коннектиться только друг к другу?",
				"added": 1616395983
			},
			{
				"comment_id": 445,
				"body": "> [dgfghyt](#comment_4_14bDUXb6RppLjK3ygbTaeoWGzzp8WY9esv): Retroshare В тор это отдельная сеть в результате долбаебы разрабы разбили сообщество на две группы в результате и там хуй и там хуй\n\nПотрясающе.",
				"added": 1616410887
			},
			{
				"comment_id": 448,
				"body": "> [dgfghyt](#comment_5_14bDUXb6RppLjK3ygbTaeoWGzzp8WY9esv): Согласен Zeronet и Retroshare отлично дополняют друг друга\n\nС Zeronet как-то попроще разобраться. У меня в Retroshare не работает приём входящих через Tor. Вроде всё настроил по инструкции.",
				"added": 1616619942
			}
		],
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 447,
				"body": "Что эти короткие идентификаторы значат? Что с ними делать? Как сертификат не распознаются.",
				"added": 1616619848
			},
			{
				"comment_id": 451,
				"body": "Обновился.",
				"added": 1616746296
			}
		],
		"1616908801_13RFu1n9Bc3vCg8vWLtYhWux6WEoXvayxA": [
			{
				"comment_id": 452,
				"body": "> [zombibi](#comment_110_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): залочили мне аккаунт, причем я вообще ни слова не написал, только читал.\n\nУ меня круче было.\n\nХотел на свою почту зарегать аккаунт. А мне говорят: у вас уже есть аккаунт. Думаю, ну не может такого быть, ну ок, попробую восстановить.\n\nВосстанавливаю пароль. А там какая-то левая учетка с восточными именем. Спамерская скорее всего.\n\nЛогинюсь туда, а мне говорят, ваша учётная запись заблокирована.\n\nТо есть какой-то бот использовал мою почту для регистрации учётки.  Бот подтвердить мой email, разумеется, не мог. Они этого бота забанили. Поле email в БД не очистили. Я сделал восстановление, и одновременно подтверждение email. И теперь моя почта привязана к забаненному боту.\n\nП Р Е К Р А С Н О",
				"added": 1617098292,
				"modified": 1617098348
			}
		],
		"1617167655_13BPoV1vrcCrka2HVvGEFwfmVdMwe6Jk1N": [
			{
				"comment_id": 456,
				"body": "Видео смотреть лень. Что за «чёрный треугольник»?\n\nХроника событий для тех, кто пропустил новости:\n\n* [Ричард Столлман возвращается в руководство FSF](https://www.linux.org.ru/news/gnu/16220352)\n* [Движение отмены Столлмана](https://www.linux.org.ru/forum/talks/16225882)\n* [Опубликовано открытое письмо с призывом уволить весь состав совета директоров FSF](https://www.linux.org.ru/news/opensource/16225630)\n* [Травят деда](https://www.linux.org.ru/forum/talks/16230736)\n* [Как бы вы решили cитуацию дела со Столлманом?](https://www.linux.org.ru/polls/polls/16233067)",
				"added": 1617169145,
				"modified": 1617169166
			}
		],
		"1635259374_18k6Aa7WLbxuUhyHBjrd7QQ14GCNX4AGpV": [
			{
				"comment_id": 458,
				"body": "1. Так а пиры-то есть? Если нет, он просто говорит, что некуда публиковать.",
				"added": 1635259836
			},
			{
				"comment_id": 462,
				"body": "> [query](#comment_188_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg): Мне тоже нужна помощь, по какой-то причине .bit домены не открываются любые (здесь в ZeroNet), в чём может быть причина?\n\nСтранно. Никогда с таким не сталкивался.\n\nДвижок просто считывает домены с сайта http://127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F/",
				"added": 1635388842
			}
		],
		"1634743240_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 459,
				"body": "Я так и не понял, что такое lokinet.",
				"added": 1635332028
			}
		],
		"1613536096_1CBMLtV7FJruhSwGXEuwYznMU2SDi5Tcmn": [
			{
				"comment_id": 460,
				"body": "Я бы и больше поставил, но непонятно, как себя поведёт движок, если запостить апдейт сразу мегабайт на 10. А проверять мне лень.\n\nВот если кто нафлудит до лимита, тогда и проверим.\n\nУ меня пока занято 360k.",
				"added": 1635332222,
				"modified": 1635332284
			},
			{
				"comment_id": 464,
				"body": "Тут и так никого нет сейчас, какие спамеры. =)\n\nСпамеру и дефолтных 20 КБ хватит, достаточно просто раз в минуту обновлять дату постов или комментов, чтобы они были наверху. =( Против спамеров только игнор. Ну или бан.",
				"added": 1635595442
			},
			{
				"comment_id": 465,
				"body": "> [musickiller](#comment_28_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): можно очень раздуть размер сайта как раз наоборот спрятав крупные мегабайтовые посты пониже)\n\nЧтоб вызвать отказ в обсуживании? Ну в принципе да, такая проблема есть. Нужен UI, чтобы видеть всю таблицу пользователей разом и сортировать по разным параметрам. А вот системного решения я пока не вижу.",
				"added": 1635607227
			},
			{
				"comment_id": 466,
				"body": "Если у нас есть бесконечный регистратор учетных записей ZeroID, то насколько бесконечность ни умножай, хоть на 4 метра, хоть на 100 килобайт, на выходе получаем бесконечность.\n\nЯ уже как-то писал и разбирал в деталях подход, когда каждый пользователь хранит данные на своём сайте-концентраторе, и, например, вот эта тема будет в единое целое складываться объединением на лету записей с разных хабов.\n\nНо тогда получается картина информационного пузыря. Ты знаешь двух людей IRL или в клирнете, и соответственно знаешь их адреса здесь. И ты можешь видеть их сообщения. Если они общаются еще с кем-то, то ты можешь узнать другие адреса, и подключить их тоже.\n\nИ получилось бы что-то подобное RetroShare только на другой технологической базе.\n\nНо проблема, что познакомиться с кем-то сторонним внутри сети просто нереально. Не получится вот так прийти на форум и вступить в диалог. И форума как целого тоже не будет.",
				"added": 1635607839,
				"modified": 1635608458
			},
			{
				"comment_id": 467,
				"body": "И получается, чтобы этот форум работал именно в таком формате публичной площадки, необходимо, чтобы сюда мог зайти кто угодно. В том числе и спамер.",
				"added": 1635607939
			},
			{
				"comment_id": 468,
				"body": "Я тут вместо PoW-based выделения места придумал еще другой вариант, с вовлечением живых пользователей в решения. Но нужно, чтобы у каждого форума был некий актив из пары десятков человек, выбранных админом, кто может раздавать место. (Не имея возможности банить и удалять посты. В текущей реализации ядра это невозможно, но ядро теперь бери и патчи кто угодно =) )",
				"added": 1635608071,
				"modified": 1635608094
			},
			{
				"comment_id": 469,
				"body": "> Ты в теме secure scuttlebutt? \n\nЩупал. Но это как раз о чем я говорю: я там никого и не знаю, ну и с кем мне там общаться? Это как про RetroShare тоже ходит крылатое выражение, которое совсем не шутка: RetroShare только для тех, у кого есть друзья. =)",
				"added": 1635608349
			},
			{
				"comment_id": 470,
				"body": "Так, у нас кажется часы разошлись)",
				"added": 1635608372
			},
			{
				"comment_id": 471,
				"body": "Автоудаление можно приделать к форуму достаточно легко. И даже с пометками, типа это важное, не удалять. Сам об этом думал.\n\nИ еще удалять контент, относящийся к удалённым темам. Тут главное не спутать, что тема именно удалена, а не то, что пользователь еще не прогрузился. (На самом деле на уровне движка разницы нет. Но можно в некоторых пределах обезопаситься, сделать полуручной режим.)",
				"added": 1635608647,
				"modified": 1635608675
			},
			{
				"comment_id": 472,
				"body": "> [musickiller](#comment_29_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): Самая лажа там конечно то что он на NodeJS крутится, и очень не всегда работает х)))\n\nОднопоточный питон на зеленых корутинах тоже не подарок. Я тут чем больше в код смотрю... тем больше обалдеваю)",
				"added": 1635608913
			},
			{
				"comment_id": 473,
				"body": "Там gevent во все поля. Такие вот потоки.\n\nОно наверное поэтому и подзамирает порой, потому что кооперативная многозадачность где-то подзалипла на долгих рассчётах чего-то. Впрочем, я детально еще не вникал.",
				"added": 1635611431
			},
			{
				"comment_id": 474,
				"body": "> [musickiller](#comment_32_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): Нет, можно конечно (наверно) проверять, полностью ли загружен сайт, и если да, то проверять, нет ли комментов на удалённых постах, и выводить вопрос \"удалим ли?\"\n\nПросто сделать где-то в настройках кнопку \"Почистить место\". И дальше два пути:\n* То, что детектировано как точно относящееся к удаленному (*Коммент старый, относится к теме автора, у которого уже есть новые темы, а старой нет...*), удалять сразу.\n* Про остальное давать список ссылок с вопросом. Мол, вы там сами почитаете, или я грохаю всё не глядя?\n\n> не вижу в этом смысла, если у нас автоудаление... \n\nНу может оно не у всех будет или не всех форумах включено. А если даже автоудаление, то если автор грохнул тему автоудалением, то значит и комменты у других сами подчистятся. Вроде логично.",
				"added": 1635611682,
				"modified": 1635611925
			},
			{
				"comment_id": 475,
				"body": "Кстати, можно старые записи автоматически на другой домен переносить. Типа вот живые беседы, а вот архив для тех у кого много места на винте и много свободного времени.",
				"added": 1635611849
			},
			{
				"comment_id": 476,
				"body": "Ну всё, запилил поддержку аватарок. Кто найдёт, где включается, тот молодец =)",
				"added": 1635625332
			},
			{
				"comment_id": 482,
				"body": "> [musickiller](#comment_29_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): scuttlebutt\n\nТем временем Patchwork всё: https://github.com/ssbc/patchwork/releases/tag/v3.18.1",
				"added": 1635823230
			}
		],
		"1606176214_12oR3n6iRjHfUywzHj2oJ9MraL9nWFCa9q": [],
		"1635660679_13BPoV1vrcCrka2HVvGEFwfmVdMwe6Jk1N": [
			{
				"comment_id": 477,
				"body": "Jabber же мёртв. — сказал я, набирая эти строки в мёртвой ZeroNet.",
				"added": 1635663921
			},
			{
				"comment_id": 478,
				"body": "Кстати как там ретрошара, живёт? Забросил туда заходить.",
				"added": 1635664082
			},
			{
				"comment_id": 480,
				"body": "Ну то, что на скрине из вики, это всё внутренние дела корпораций.",
				"added": 1635677190
			},
			{
				"comment_id": 481,
				"body": "Скриншот какой-то гигантский получился. Хм, ограничить размеры картинки программно в движке что ли.",
				"added": 1635677251
			}
		],
		"1635779925_13BPoV1vrcCrka2HVvGEFwfmVdMwe6Jk1N": [
			{
				"comment_id": 483,
				"body": "> Я два раза не повторяю, два раза не повторяю.\n\n=)",
				"added": 1635847615
			},
			{
				"comment_id": 484,
				"body": "> [musickiller](#comment_40_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): \n\nОч странно. Потестирую чуть позже.",
				"added": 1635847691
			}
		],
		"1635897343_1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv": [
			{
				"comment_id": 485,
				"body": "Блокчейн очередной?",
				"added": 1635913154,
				"modified": 1635922825
			}
		]
	},
	"comment_vote": {
		"15_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"7_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u": 1,
		"10_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"3_1DX6GBJSVzFG33QkMzQEhDYBNsRE3hH9xj": 1,
		"1_14VYTUXRHkxooT1RzmnmzrYYVixozGfH3z": 1,
		"16_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": 1,
		"76_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"37_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"111_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"25_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"24_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"1_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"40_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"105_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"30_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"7_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z": 1,
		"156_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"46_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"122_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"10_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp": 1,
		"23_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"64_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"56_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"84_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"85_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"3_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"27_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"73_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"11_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"3_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"110_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"3_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": 1,
		"1_194pDo3F76iy7UnsyuXVdgtH3BVM1Ai1dg": 1,
		"37_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"49_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"53_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"55_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"65_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"2_1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv": 1,
		"87_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"27_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1
	}
}