{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_1HjPcm98huSQdRkf5F1VQs4w8caUgq6eA": 1,
		"1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3": 1
	},
	"next_comment_id": 15,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "Ух, ворвался! : D",
				"added": 1475076091
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 2,
				"body": "Завел не большой бложик: http://127.0.0.1:43110/19bhDQnHTh9Qww3XePT9EHn2AujGB6boFg/ \nПланирую развивать ZeroNet. В данный момент занят портированием приложения на третий python",
				"added": 1475134946
			},
			{
				"comment_id": 6,
				"body": "> [shift](#comment_293_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): какого приложения?\n\nхотел клиент ZeroNet-а, но что-то работа встала, закидываю блог другими интересностями",
				"added": 1476124551
			},
			{
				"comment_id": 12,
				"body": "> [kagari](#comment_4_1FnBR5Q2NQgzU1zDzp3XSqwjrdvxwXcFe4): Не хватает общей бд для картинок. \"Было бы\" неплохо :) если все добавленные картинки на различные сайты в сети можно было найти через один ресурс(Или наоборот чтобы картинки загружались на один сайт а на другие уже с него вставлялись). Вышла бы неплохая галерейка(если конечно не учитывает всякое откровенное говн...) + еще музыку с видео прикрутить все было бы супер. Ведь что нужно людям? Общения и зрелищ).   Или может уже есть?\n\nа еще чтобы из каждого материала вычислялся хэш, чтобы избежать дублирующих заливок",
				"added": 1484121415
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 3,
				"body": "Йоу, чо как?",
				"added": 1475147922
			},
			{
				"comment_id": 4,
				"body": "> [tiberium](#comment_1_1Lh1skaRb1BCfrYxJXyLrte6Rzz58c32fx): Пшш Пшш\n\nПыщ-пыщ",
				"added": 1475918585
			},
			{
				"comment_id": 7,
				"body": "> [shift](#comment_294_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Всплески тут был после постов на хабре, следующие всплески в сети будут:\n> \n> После добавления возможности публиковать контент (картинки и не только) в ZeroMe\n> Возможность создания закрытых сообществ\n\nа он сейчас через маркдаун разметку картинки вставить не дает?",
				"added": 1476124629
			},
			{
				"comment_id": 8,
				"body": "> [ishift](#comment_5_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG): это не интересно,  я о загрузке контента в сеть а не о внешней ссылке\n\nзаливаешь себе на бложик и ссылаешься :D",
				"added": 1476951354
			},
			{
				"comment_id": 10,
				"body": "> [shift](#comment_297_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Всех поздравляю, теперь в Zerome можно лить фотографии\n\n* слил фотку слоупока*",
				"added": 1479458533
			}
		],
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": [
			{
				"comment_id": 5,
				"body": "> [voland](#comment_7_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): там, есть еще и кнопка: \"мой сайт\"... Так оно глядишь и сайт может стать чужим, или еще как-то\n\nтут речь о том, что ZeroNet всегда находится на твоей машине и доступ к ресурсам ты можешь получить и без интернет соединения ( если ты их уже выкачал)",
				"added": 1476098537
			},
			{
				"comment_id": 9,
				"body": "> [dan2017](#comment_2_1Kkz2PBEjFB9hbRtkTvQvk5ysFSQvLGv3R): А какой смысл заходить сюда через локальный прокси (python).  Оператор или провайдер увидит реальный адрес(IP, URL), по которому питоновский прокси перенаправляет пользователя на этот сайт?\n\nа зачем перенаправлять, если все хостится локально?",
				"added": 1477805572
			}
		],
		"1_1CR8tDsJR9pptbN3kMFP5BiCzCi5zrDfr9": [
			{
				"comment_id": 11,
				"body": "> [balancer73](#comment_15_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Есть же тема чуть ранее: Поделитесь интересными ресурсами\n\nВсе круто, не хватает только пометки про русскоязычность того или иного ресурса",
				"added": 1480580642
			}
		],
		"1_16fnuygRfs9cJeBagTocMnZGtjLSCwPZjZ": [
			{
				"comment_id": 13,
				"body": "мой друг ебашит совместную жизнь с тян вообще адово... а если по серьезному, то тут типо надо смотреть какая девушка, тип надо заранее оговорить вопросы уборки, готовки, стирки вот эту всю фигню. Вопрос бюджета, общий не общий...",
				"added": 1524233313
			}
		],
		"1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3": [
			{
				"comment_id": 14,
				"body": "очень содержательный топик :D",
				"added": 1524481205
			}
		]
	},
	"comment_vote": {
		"31_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"8_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": 1
	}
}