{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1530175852_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1528417207_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "> [nekololi](#comment_210_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): not everyone is capable of doing meaningful things\n\nBut everyone is able to find, to build meaning from the things they do",
				"added": 1528515182
			}
		],
		"1530175852_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "Very useful information, thank you!",
				"added": 1530234132
			}
		],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 3,
				"body": "Someone who is proposing homosexuality is related to genetics must consider the genetic inheritance in this matter (dominant and recessive genes, meiosis, etc). It's an interesting point of view, but must be observed and correctly verified. I think, IMO, that homosexuality is more social/behaviour/psicological related than biological related. Of course, that's just my opinion, I'll read a little more about the subject.",
				"added": 1530481772
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_204_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): When approaching things scientifically, do not do so politically. It can be more than one independent factor added together. It could also be X causes Y causes Z. Get into combination theory for a moment and don't outright reject the other side's claim. Sometimes everyone's right. Sometimes everyone has a piece of the whole truth.\n\nI did not reject it, neither I implied anything (\"there have never been recessive genes nor new mutations\")... All I said was \"okay, we can follow this line of though, but we must think about this particular subject when dealing with it\". I'm not trying to reject anything (since I don't have any good arguments against this theory). I'd really appreciate if you read my comment once again and, if you still think I'm just rejecting a possibility without proper thought, show me were I'm doing it so I can improve at discussions. Anyway I thank you for doing that!",
				"added": 1530504198
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_204_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): When approaching things scientifically, do not do so politically. It can be more than one independent factor added together. It could also be X causes Y causes Z. Get into combination theory for a moment and don't outright reject the other side's claim. Sometimes everyone's right. Sometimes everyone has a piece of the whole truth.\n\nThe summary of the Sci-Hub article (http://sci-hub.tw/10.1300/J082v28n01_08) sums up what I was trying to say. There is a list of criterias that genetic studies must attend to when dealing with \"genetical analysis of behavioral differences among human beings\". I was pretty much referencing those criterias...\n\nMy opinion about the subject was not scientific related, it was just... well, my opinion. It can and will change over time based on how much I learn from the matter. Hope we can all study about this fascinating subject and improve our knowledge.",
				"added": 1530504982
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_205_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm really not bothered anyway. The last thing the LGBT needs to do is give another indicator of being easily offended. [...]\n\nPlease, PLEASE do not be offended! It never was my intention to do so. Homosexuality is, without a doubt, an amazing field of discussion and a incredible personality trait (at the very least). I'm here to deepen my knowledge about the matter, to explore theories and, if necessary, to change my own opinion. I am sorry if I sound offensive to you. It was, as I said, never my intention to do so. I hope you have all the opportunities to explore this amazing aspect of your personality and find happiness doing so, without any fear of reprisal!",
				"added": 1530506289
			}
		]
	},
	"comment_vote": {
		"91_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"210_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"9_16jxbpwWm7DbyFCRhQ4FNirjuLsenv26Lk": 1,
		"2_16J4P74LkfZ87zHug8ycEHmYdvp6wMdkXt": 1,
		"204_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"203_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"205_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"206_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_18r3dH5fjSMKPbYsNNbS3J2tQt11PWQ1B4": 1
	}
}