{
	"next_post_id": 9,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "jpg",
	"user_name": "Panda!Yoo",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Let's unfold China",
	"post": [
		{
			"post_id": 1590590841,
			"body": "[Who is ByteDance?](https://pandayoo.com/2019/11/03/who-is-bytedance/)\n\nIncluding TikTok, all of ByteDance’s products have acquired 1.5 billion users in the past 2 years. This is the first time that a company has really troubled Mark Zuckerberg and the first Chinese Internet company to successfully implement a global strategy.\n\nEven in China, its growth process is controversial. Learn everything about Tik-tok 's parent company through this article.\n",
			"date_added": 1590590839,
			"meta": "{\"img\":\"900,546,dccb9adeecab8bb5b96ca2865983764a9799143bcc9dd8cc,01022222223345666562206789A7522269B87C520D66EF6A5D00DDDDDDD0\"}"
		},
		{
			"post_id": 1591026090,
			"body": "[Is China’s “piracy” problem serious?](https://pandayoo.com/2020/05/25/is-chinas-piracy-problem-serious/)\n\nAmong Trump’s many accusations against China, violating intellectual property rights is one of the constant divergence between the two nations. Put aside those ideological conflict between politicians and complicated corporate behaviors, how about the copyright awareness of majority in China at present? Do they really download pirated content frequently?\n\nLet’s take a look in several areas.",
			"date_added": 1591026087
		},
		{
			"post_id": 1596604418,
			"body": "[Henan wig rules the earth](http://pandayoo.com/2020/08/05/henan-wig-rules-the-earth/)\n\nIn 1900, Bai Xihe, a small businessman in Xuchang County, accidentally met a German businessman. The German businessman proposed to exchange \"sewing needles for human hair\", the free trade was fed to his mouth, and Bai Xihe mobilized the whole village to \"look for hair and change needles.\" The German businessmen did not expect that after laying the groundwork for a hundred years, Xuchang dominated the worldwide wig business.",
			"date_added": 1596604414
		},
		{
			"post_id": 1597198435,
			"body": "[History of Nijigen Culture in China](https://pandayoo.com/2020/08/11/history-of-nijigen-culture-in-china/)\n\nApart from Japan, the country that loves Nijigen culture most may be China. Nijigen culture has been rooted in China for more than 30 years. At first, ACG Funs in China only watched and discussed works from Japan. In the last decade, China's own animation, comic and game industries have begun to take off. Nijigen has moved from minority culture to mainstream in China. This is a history worth studying. [ 6589 more words]",
			"date_added": 1597198429,
			"meta": "{\"img\":\"900,563,312323333988a99422522656756744854743543733866,0122341506012773855600189AB61C555DAD965C622CC6E965BA95CC8965\"}"
		},
		{
			"post_id": 1597291856,
			"body": "Article: [Is There a Rust Belt in China?](http://pandayoo.com/2020/08/13/is-there-a-rust-belt-in-china/ )\n\nFrom another perspective, although employees of state-owned enterprises have lost their leisurely life of \"I'm gonna get some beers\", economic reform has brought a good life to more Chinese people. [ 1960 more words]",
			"date_added": 1597291849,
			"meta": "{\"img\":\"900,529,444333344455555787677666898233222112,001202023034033043335643037458991912AA9A192190AAAA1AAAA39BA9\"}"
		},
		{
			"post_id": 1598865932,
			"body": "Article: [After Companies such as Ant Financial Give Up Listing in the US, What Market Can Replace It?](https://pandayoo.com/2020/08/27/after-companies-such-as-ant-financial-give-up-listing-in-the-us-what-market-can-replace-it/ )\n\nTo put it simply, the problem of this kind of non-high-tech Chinese stocks targeted by short sellers is not the \"China factor\" deliberately emphasized by some of them, but real violations and fraud. [ 1702 more words]",
			"date_added": 1598865924
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}