{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "分析：习王“打虎”第三战役 多高官成目标",
			"body": "习近平当局反腐信号不断升级。日前，中共河北省委常委、政法委书记张越落马。有分析文章认为，现当局反贪腐已进入第三次大战役，有可能酝酿大风暴、步入新阶段。报导称，当局不仅要严办令计划，还有多名前任和现任高官也成目标人物。\n\n\n4月16日，河北省委常委、政法委书记张越涉嫌“严重违纪”被调查。据多方消息披露，张越涉郭文贵、马建案，也疑涉周本顺与江泽民等人的政变。\n\n中共“十八大”以来，习近平、王岐山的反腐“打虎”运动迅猛推进，至今已拿下逾百名中共省部级及以上高官。其中包括江泽民的亲信周永康、徐才厚、郭伯雄等高官。\n\n港媒《明报》4月18日的评论文章，自“十八大”以来，现当局在反贪腐方面，已打了两次大战役，一次是惩办周永康，一举打垮中共党内两大帮派“石油帮”、“政法帮”，以及地方势力“四川帮”。另一场大战役，则是首度军中“打虎”，先打中共军委前副主席徐才厚，最近另一名军委前副主席郭伯雄案又进入司法阶段收尾，逾百“军老虎”遭分批清洗。\n\n文章说，近期中共筹备反贪腐第三战役，首恶是中共政协前副主席令计划。其长期身居中共中央办公厅主任之要津而“权重”，更掌握中共大量核心机密，还掌控“西山会”等小圈子秘密组织，其政治险恶可谓登峰造极。是以这次侦办令案前后所耗时间更长，行动也更广。\n\n文章提到，当局在筹备法办令计划之际，出现了一个“计划外”的情节，那就是最近轰动一时的“巴拿马文件”。\n\n文章说，中共这一波反贪腐战役，其实不仅要严办令计划，还有多名前任和现任高官也成目标人物。“巴拿马文件”既给中共高层稳定带来空前的挑战，实际上也为反腐败进一步深入提供了部分炮弹，一旦再有深度曝料，不排除高层会顺势而为，借力打力。\n\n此前有消息说，令计划案已经移交中共检方，最快上半年提起公诉，或异地闭门审判。据报，该案情况复杂，牵涉面很广。令计划落马前，曾有目的盗取涉及中共政治、经济、军事、外交和文化等方面的数千份机密文件。\n\n而最近“巴拿马文件”引发全世界关注。该文件因涉及9名中共卸任及现任高层领导人的家族。",
			"added": 1460959488
		},
		{
			"topic_id": 2,
			"title": "换妻了,然后呢",
			"body": "晨曦透过闭上的窗帘映在床头，借着微光，我再次偷偷的打量着躺在身边的这个女人。\n　　轻皱着的眉头下面，挺直的鼻梁，略厚却显得很是性感的嘴唇微嘟着。几缕挑染的栗色发丝遮在脸畔，面朝着我，侧卧在我的身边睡得很是香甜。视线越过圆润的下巴，因为手臂的挤压，一侧的乳房像圆饼一样，只是压在腋窝下的被沿边，漏出一些深褐色的乳晕。\n　　仿佛是察觉到我的目光，她微微地扭动着身子，然后翻了个身，背靠着我继续酣眠着，没有醒来。\n　　这是一个普通的清晨，窗外依稀传来公园里晨练的人们的声音。更远的地方沉睡了一夜的城市在缓缓苏醒，喧闹的一天，才刚刚开始。\n　　而在这个静谧的酒店标准间里，安静的睡着四个一夜颠鸾倒凤的人。\n　　不对，只有我还清醒着，或者说，我根本就没有睡着过。\n　　经过初始的浑浑噩噩，我的头脑越来越清醒，完全不像是疯狂狂欢了一夜的人该有的状态。\n　　在旁边的那张床上，一个大约40岁左右却身形依然保持着健美的男人。他的臂弯里，安静的躺着一个如碧玉一般温婉的人儿，紧紧皱着的双眉，仿佛在睡梦中，还在遭受着什么痛楚。\n　　赤裸的身体，只在肚子上搭着被子的一角。修长的双腿微微叠起，白皙如雪一样的肌肤，却刺眼的遍布着一道道红色的痕迹。尤其是胸前，甚至是那对圆润挺翘，曾让我如痴如醉、疯狂迷恋的双乳上，一个个紫红色的吻痕，如一把把深深扎在我心口上的尖刀。\n　　那是我的妻子。那个和我相知三年、相恋三年，而后步入婚姻殿堂，发誓要相守一生的女人。\n　　而现在，那张我深深迷恋的脸庞上，布满着斑斑的泪痕，倾诉着在她睡前，究竟有着怎样痛苦难堪的遭遇。\n　　累极的她，即使在沉睡中，双手依然紧紧地抓着床单和被角。\n　　随着窗外声音的增大，思考的能力再次回到我的脑海。经过短暂的茫然，我猛然省得了究竟发生了什么。\n　　交换！\n　　是的。这个曾让我激动不已、亢奋得难以自己的事情，现在，真实的发生在了我和妻子的身上。\n　　这难道不是我绞尽脑汁、上蹿下跳，为之努力了近一年而想要得到的吗？\n　　可是，为什么现在的我却丝毫高兴不起来。为什么看到妻子赤裸的躺在别人的怀里，我的心会如此的紧缩，仿佛一座无形的大山压在我的心头。那令人疯狂的沉闷和压抑，让我想撕碎眼前的一切。",
			"added": 1460959535
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}