{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": " Prof. Karl Albrecht Schachtschneider sieht im neuen Volksbegehren „Ja zum Grenzschutz – sichere Grenzen in Bayern“ ein wichtiges Instrument, mit dem die Bürger Druck auf die regierenden Parteien ausüben können, damit sie endlich die ureigenste Aufgabe des Staates – den Schutz ihrer Bevölkerung – wiederaufnehmen. Diese Initiative ist zunächst auf Bayern begrenzt, sollte aber in Form eines Dominoeffektes auch auf andere Bundesländer übergreifen. Im PI-NEWS-Interview (oben) warnt er zudem eindringlich vor der Islamisierung, die durch die Grenzöffnung eine weitere Beschleunigung erfahren hat.\n\nAnfang September führte der Initiator des Volksbegehrens, Jürgen Elsässer, ein ausführliches Gespräch mit Prof. Schachtschneider, in dem jener erklärte, dass Bayern geradezu verpflichtet sei, sich ein Grenzschutz-Gesetz zu geben. Brigitte Fischbacher, eine der sechs Beauftragten des „Volksbegehrens Grenzschutz“ gegenüber der Regierung des Freistaates Bayern, sprach bei der Compact-Sicherheitskonferenz am 29. September in Garmisch-Partenkirchen ebenfalls mit dem bekannten Staatsrechtler, der auch die juristische Begründung für das Volksbegehren verfasst hat.\n\nDieses Volksbegehren kann jeder Bürger in Bayern unterschrieben, der die deutsche Staatsbürgerschaft und seinen Erstwohnsitz im Freistaat hat. Wer teilnehmen möchte, kann sich die Unterschriftslisten zusenden lassen oder auch downloaden, beidseitig ausdrucken und an den Verein zurückschicken. Es gibt auch die einfache Möglichkeit, das Begehren online zu unterstützen.\n\nAm kommenden Sonntag ist im Rahmen der Landtagswahl in Bayern eine ideale Möglichkeit, in der Nähe von Wahlräumen außerhalb der Schutzzonen Unterschriften zu sammeln. Jede Initiative ist willkommen. Im ersten Schritt sind bayernweit 25.000 Unterschriften nötig, damit das Volksbegehren offiziell beantragt werden kann.\n\nBei der Sicherheitskonferenz hielt Prof. Schachtschneider einen faktenreichen Vortrag (im Video des Livestreams ab Minute 46) über die geradezu fahrlässige Grenzöffnung durch das Merkel-Regime in September 2015. Dies ist auch seiner Überzeugung nach ein völlig unverantwortlicher Zustand, der bis heute anhält, niemals durch einen Parlamentsbeschluss autorisiert wurde und die Sicherheit der deutschen Bevölkerung in hohem Maße aufs Spiel setzt. \nhttps://www.youtube.com/watch?v=StWNCzny9SM",
			"post_id": 4,
			"date_added": 1539113087
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}