{
	"next_comment_id": 11,
	"comment": [
		{
			"comment_id": 1,
			"body": "testing comment",
			"post_id": 2,
			"date_added": 1457199925
		},
		{
			"comment_id": 2,
			"body": "> [angristan](#comment_1_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7): We can't change without restarting ZeroNet ?\n\nYou only need to restart to enable the plugin.  To change identities, just log out from ZeroHello and log back in with your identity's private key\n",
			"post_id": 3,
			"date_added": 1457262171
		},
		{
			"comment_id": 3,
			"body": "> [yeti](#comment_1_14tJBPnxcrF9kMK5v7DULWnaJx3JepirXb): I'm updating using \"git pull\"...Having used a symlink instead of renaming the plugin's directory I'm curiously waiting for an update of this plugin...;-)\n\nThat is interesting - Maybe they could switch to the way ubuntu does it...",
			"post_id": 3,
			"date_added": 1457265464
		},
		{
			"comment_id": 4,
			"body": "> [yeti](#comment_2_14tJBPnxcrF9kMK5v7DULWnaJx3JepirXb): Using git is not distribution specific.\n\nNah, I just meant that ubuntu organizes their config files into folders with links to show enabled/disabled...\n\nie: \n\n/etc/nginx/sites-available/mycoolsite.conf can exist and be under git control, but\ndoesn't become enabled until /etc/nginx/sites-enabled/mycoolsite.conf exists.\n\nThe standard way is to create a link in enabled/ which points to available/",
			"post_id": 3,
			"date_added": 1457267898
		},
		{
			"comment_id": 5,
			"body": "> [yeti](#comment_3_14tJBPnxcrF9kMK5v7DULWnaJx3JepirXb): What about multiuser and deleting sites?I get \"This function is disabled on this proxy\" now...\n\nYeah, I get that too :( Time to file a bug",
			"post_id": 3,
			"date_added": 1457269488
		},
		{
			"comment_id": 6,
			"body": "Looks like that was intentional, because it isn't \"multiuser safe\"\n\nhttps://github.com/HelloZeroNet/ZeroNet/commit/36d3268cf7de35ea51d423f0f2767e903b5fb077\n\nThey have a point, if you imagine using this sort of setup in a proxy, but for myself I wish it'd remember who a site was cached for and allow that person to delete",
			"post_id": 3,
			"date_added": 1457271054
		},
		{
			"comment_id": 7,
			"body": "> [zaphod](#comment_1_1JA2umSc9f7VSNLaYLs1Cpk7rpvS4p18xe): Seconded. Just enabled multiuser to test it out and will probably disable it again as soon as I want to delete pages, this is a major dealbreaker.Maybe make it a toggle somewhere, somehow?\n\nI just removed those three lines and the functionality is back (after a restart)",
			"post_id": 3,
			"date_added": 1457272673
		},
		{
			"comment_id": 8,
			"body": "Ah wow, that's totally what I was thinking :) That's cool - I only got as far as creating a FaceBook app.\n\nI actually did suggest the system to a bunch of coworkers, but it got icky when it came time to write down who trusted whom :)\n\n> [ks](#comment_1_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): That's a bit like the Ripple Network works: Ripple IOUs.\n\n",
			"post_id": 9,
			"date_added": 1458294747
		},
		{
			"comment_id": 9,
			"body": "> [ks](#comment_2_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): There's also Stellar, created by some of the creators of Ripple. I'm not sure I like either — they're too centralized — but I like the idea.\n> Within a smallish group there's a thing like https://grouptabs.5apps.com/ that eases tracking of expenses in a group, but I gather you're more keen on a bigger scale.\n\nNah, I was more interested in implementing it in small real life social groups.  A small team at work could issue and accept IOUs from one another for sharing a bar tab for example",
			"post_id": 9,
			"date_added": 1458296123
		},
		{
			"comment_id": 10,
			"body": "> [pycole](#comment_3_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Neat, I'll have to check that one out. Mind if I shamelessly pimp my own referral link?\n\nYeah, but that site gives out less than 1000 satoshi for a complicated Captcha and only once every 5 minutes... http://10000satoshi.com/register?ref=233527 is giving out 10,000 - 50,000 satoshi with a very simple Captcha and no wait between claims\n",
			"post_id": 13,
			"date_added": 1461410760
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"2": 1,
		"3": 1
	}
}