{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1636946579,
			"title": "I lost all Zeronet operation today when my Tor browser updated and shut off V2 client",
			"body": "Managed to get everything working again by installing an older version of the Tor browser, but I'm concerned it will update me away again.\n\nSo I guess I have no choice but to tough out this V3 patch from anonymouse instead of waiting for a click update from Nofish :(  So I'm wondering, just how could one perform a minimalist install on AN EXISTING ZeroNet server without screwing everything up?\n\nInput appreciated. I find those github update instructions quite challenging. In the past, I've only used sudo apt-update.\n\nIMO, ZeroNet users are in real trouble now.",
			"added": 1636946578
		},
		{
			"topic_id": 1637126540,
			"title": "Entertainment for whites is now an unmet need in this country.",
			"body": "Niggers are inserted everywhere....\n\nSo the market for white movies, white news, and white print might be fairly large. Just awaits someone to test it.",
			"added": 1637126538
		},
		{
			"topic_id": 1637164951,
			"title": "Just posing the question. Is it possible that Zeronet use is more widespread than anyone believes?",
			"body": "I've spotted some hand wringing from time to time within this forum, and now wonder if they just got everything completely wrong.\n\nCould it be that a Tor'd install is just too difficult to quantify? BitTorrent traffic within Tor onions.",
			"added": 1637164948
		},
		{
			"topic_id": 1637266561,
			"title": "Judge In Kyle Rittenhouse Murder Trial Bans MSNBC From Courthouse",
			"body": "https://news.yahoo.com/judge-kyle-rittenhouse-murder-trial-191839216.html\n\nsomeone who identified himself as a producer for the network was caught following a bus carrying jurors.",
			"added": 1637266557
		},
		{
			"topic_id": 1637276652,
			"title": "4chan ridicule is right on target",
			"body": "https://i.4cdn.org/b/1637275022105.jpg\n\nAlways use a VPN or better to access this site.",
			"added": 1637276647
		},
		{
			"topic_id": 1637349877,
			"title": "Kyle Rittenhouse acquitted of all charges",
			"body": "https://www.mercurynews.com/2021/11/19/kyle-rittenhouse-acquitted-of-all-charges/",
			"added": 1637349871
		}
	],
	"topic_vote": {
		"1637049554_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	},
	"next_comment_id": 35,
	"comment": {
		"1636690136_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 1,
				"body": "It's working well on the unmodified zeronet . Why take the chance of breaking it?",
				"added": 1636693595
			}
		],
		"1626704177_1JMn7zrA5b35HR8wTSeyQrbCSxj2LDuxgt": [
			{
				"comment_id": 2,
				"body": "I would say just another 24/7 mirror/seeder would help. Couldn't be a simpler.\n\nAnd given your resource level and perhaps competent coders, it might help to have another set of eyes on this V3 transition (very difficult due to nofish absence)",
				"added": 1636693882
			}
		],
		"1635824300_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": [
			{
				"comment_id": 3,
				"body": "Attackers are no problem when no one can be censored. Knock yerself out punks.\n\nBetter strategy maybe? If you can dox them, find out who finances them - then inform how their \"experts\" just piss off their money without accomplishing anything.",
				"added": 1636694167
			}
		],
		"1636071087_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "The vaxers won the first round by destroying the lives of many. About the best you can hope for now, is a growing recognition of just how far they've strayed from the science and turned everything into a cult. At that point, you might be able to wrest compensation. Money or \"zealots fired\".",
				"added": 1636694455
			}
		],
		"1636861616_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 5,
				"body": "Can you provide a new thread focused on \"current best update practices\" for existing ZeroNet servers which make use of the Tor browser SOCKS  proxy?",
				"added": 1636952455
			}
		],
		"1636969808_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 6,
				"body": "https://ccs.getmonero.org/proposals/research-post-quantum-monero.html",
				"added": 1636993171
			}
		],
		"1636946579_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 7,
				"body": "> [transcoder](#comment_44_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): if i were you, i'd try this instead https://github.com/zeronet-enhanced/ZeroNet/tree/massive-rework. it's got some additional improvements along with the v3 patch and is being actively developed. just need to copy over the data directory and your zeronet.conf to the new zeronet folder created and you should be off to the races. no patch needed\n\nThanks. This appears to be exactly what I was looking for, and it retains that \"portable app\" feel I've come to really feel comfortable with....",
				"added": 1637123521
			},
			{
				"comment_id": 17,
				"body": "> [transcoder](#comment_44_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): if i were you, i'd try this instead https://github.com/zeronet-enhanced/ZeroNet/tree/massive-rework. it's got some additional improvements along with the v3 patch and is being actively developed. just need to copy over the data directory and your zeronet.conf to the new zeronet folder created and you should be off to the races. no patch needed\n\nTried it. Gave up. The copy I was wget downloading appeared same as the Nofish version (though I didn't compare hashes because I had no reference). Is this just a docker container? tried that route for awhile (don't have that capability installed) - until I discovered that dockers can only access the home directory in the system drive. I can't do it that way since I use a separate drive to host Zeronet.\n\nReturned to V2 Tor to post this.\n\nPretty frustrating stuff. What am I missing here.",
				"added": 1637177086
			},
			{
				"comment_id": 21,
				"body": "> [transcoder](#comment_47_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): you're meant to clone it from the git repo. the readme page hasn't been modified yet from the original ZN\n\nSo docker support is not a requirement?",
				"added": 1637260511
			},
			{
				"comment_id": 22,
				"body": "> [transcoder](#comment_47_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): you're meant to clone it from the git repo. the readme page hasn't been modified yet from the original ZN\n\nMany of us lack your skills. Is there any way you could just post the entire updated package as compressed file with an integrity hash - so we could just move our data directory and zero.conf into it?",
				"added": 1637260810
			}
		],
		"1636765653_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "I've reluctantly given up previous ideas of normalcy, and now admit many of these \"conspiracy nuts\" were right all along. While it's not yet clear as to the best way to proceed, I feel at minimum we need to take our schools and neighborhoods back.\n\nA way to do this? Emulate the Jews. Start a church....say the Church of White Ancestors. Then admit only DNA verified whites. That means you must be DNA verified to even be on church grounds. No unverified visitors either.\n\nExpand church concept into white neighborhoods where residential land is still owned by the church  but residents can build on it. Have few rules, but one rule endures. If you sell your home - can only be sold to another DNA verified white church member..Everything else is done on the cheap with few frills. Want something special like a playground? You pull out your own money and volunteer like the Amish to \"get shit done\".\n\nOver time, these neighborhoods would be able to build schools with real rigor and exceptional staff. Perhaps becoming the MIT or Caltech of public schools. Graduates of these schools would be in high demand - because those kids would be productive and competent. Far, far above the competency levels of other schools.\n\nIn short, a wholesome place for whites to raise families. Becoming more self sufficient as it grows. Maybe even with it's own local bitcoin currency with zero connection to the internet. Fork Monero to this local currency and you can have untraceable local commerce. A shopkeeper on church ground might have two separate accounting systems. One for local, one for IRS. And if one has no earnings in that IRS account - it would be difficult for the government to transfer your earnings to privileged unworthies. As they do now.\n\nThese days, diversity just drags everyone down. There are no winners. A whites only church could reverse this trend. \"Very loose rules\" means you'd get a fairly diverse group of high performance whites to move in, lessening the inbreeding problems other religions have. Church would be built on race (ancestry) - not religious fad of the month club.\n\nIt's my belief that most religious communes failed due to rigidity. One should pick one's battles and avoid over regulation of behavior. \"Being there\" must always serve the resident's interests.\n\nOther benefits can be worked out too. Imagine what would happen if a merchant opened a store on church grounds but nominally outside the residental area. So that other DNA tested whites could visit and shop there. That merchant would have near zero shrinkage, and gain a reliable local client base. Which may later wish to start their own whites only church....and offer him the means to expand.",
				"added": 1637125474
			},
			{
				"comment_id": 9,
				"body": "> [cyberk1d](#comment_4_148jFFH43GX5qkcpTXmeRiTaYJahpiWrSW): It's hard to trust any perspective that demonizes \"identity politics\", as this is a simple way of redefining ethnocentrism.  We know that trust drops in areas where the ethnos is attacked, not only between separate ethnic groups but also among the same ethnic group.  It is no coincidence that much of the actions of globalism against everyone is happening now after decades of deconstructing this racial/ethnic solidarity. [...]\n\nHow much of your pay is transferred to government functionaries and designated unworthies right now? How much better off would you be if these transfers never took place?\n\nYou are panting - because you carry a heavy load. Maybe it's time to quit? Essentially \"just say no\"? My family and community ONLY.",
				"added": 1637125981
			},
			{
				"comment_id": 10,
				"body": "> [cyberk1d](#comment_4_148jFFH43GX5qkcpTXmeRiTaYJahpiWrSW): It's hard to trust any perspective that demonizes \"identity politics\", as this is a simple way of redefining ethnocentrism.  We know that trust drops in areas where the ethnos is attacked, not only between separate ethnic groups but also among the same ethnic group.  It is no coincidence that much of the actions of globalism against everyone is happening now after decades of deconstructing this racial/ethnic solidarity. [...]\n\nI'd like to learn more about the Amish. They seem to have a successful model excepting their inability to defend themselves. Refining that model would give you the tools for building resilient communities ANYWHERE. Perhaps even the moon or mars.\n\nIn contrast, the globohomo model seems totally reliant on conquest or threat of force.\n\nForce is always a requirement in human societies. If you don't possess it  - you'll be overrun and chained. That's where the loose rules inside these communities come in. They give individuals \"something to lose\". So that when the time comes they'll fight like hell to keep what is theirs. I would expect that each of these communities would train their young to fight. Learning to kill would not be a requirement, but social pressure would certainly exist for all members to defend their community. Would hope that the soldiers produced would be more than an equal to those from any nationstate. You get freedom, but you only get to keep it if you kill your attackers.\n\nJust an FYI, feral blacks are now escaping the cities to attack pacifist Amish. They are regarded as an easy target.",
				"added": 1637163309
			},
			{
				"comment_id": 11,
				"body": "> [ssdifnskdjfnsdjk](#comment_1139_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): World need more justice possibly and more real christianity and i am not sure if it is through anarchy. Not interested to talk about this anyway.\n\nSome would argue that Christianity put us into our current predicament. Christianity has served as a subset control for globohomo, and their exercise of power was equally bad. I'm not in favor of granting Christianity power ever again.\n\nIn contrast, YOU are here because thousands of white people before you managed to survive. Maybe they deserve your thanks?\n\nAs I see it, if one wished to be a Christian in these communities - no one would stop you. Part of the live and let live ethic allowed to flourish.",
				"added": 1637163775
			},
			{
				"comment_id": 27,
				"body": "https://i.4cdn.org/pol/1637211603375.jpg\n\nWhy would ANYONE think this is OK? Do you have any idea just how destructive this company has been to young people? They move in, and buy up entire neighborhoods...making it impossible for young families. Then they sell their worthless credit obligations to the Fed and repeat.\n\nAnd if this meme is true, their sinister behavior doesn't stop there.",
				"added": 1637262340
			},
			{
				"comment_id": 28,
				"body": "> [inis](#comment_6_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ): Good synthesis. A - although not immediate - solution might be creating another system, separate from the current one, made by independent institutions. Once you have food, healthcare, housing, instruction, etc. from an independent system you don't need anymore this one. [...]\n\nSuch arrangements become more possible with time. I wish some really capable people were working on this and could deliver a blueprint.",
				"added": 1637262464
			},
			{
				"comment_id": 29,
				"body": "> [an0ny](#comment_1_1Q3KH2eZ26Y6fUcxJmVbiQKNAoMtMGWeB5): I've been doing some light reading on Russian history lately. I see some clear parallels between what corporate entities and the wealthiest 1% of the population are doing and what the Romanov clan did to create a country populated by serf peasants. In the Russian case, generations of big families and very little land to pass down created the necessary unrest for revolution. Perhaps Trotsky is correct, we must constantly participate in permanent revolt and revolution. I fear that for many in the first world that opportunity has passed, and our living conditions will get much worse before we are motivated to organize against our oppressors. Who are the 'we'? Those who are attempting to see their way out of the dogma by being here, participating in cryptocurrency to unseat the banks, build trust with the people in your communities, refuse to support big corporate interests who abuse the individuals you know by not giving them your money in exchange for anything. I want to meet like minded people on this platform. Let's talk about what we can do. Mail me, no personal info, but let's start a dialogue.\n\nI like the concept of \"loose rules\" within an ethnostate. It seems that every government devolves into a hellish HOA while corroding community solidarity.\n\nThis isn't a new problem. The founders struggled with it a lot and tried to anticipate future problems. Unfortunately, I'd argue they failed, and that our HOA turning point was WW1. Thereafter, government control became pervasive.\n\nAssuming this awful government can still summon common sense, it may decide that the cost of squashing macro ethnostates vastly exceeds the benefit. If these ethnostates are honestly paying their fair share of taxes, require near zero federal \"maintenance\", and are zero threat to thieving grand poobahs in Washington - there's always a chance they'll be left alone. What's not to like from a *functioning* society still paying tribute?\n\nEspecially, if those fuckers are crazy, armed to teeth, and literally breeding really competent soldiers. Might take a demonstration though. Say when Feds attack their next Waco - but Waco fights back and decapitates Washington. Minimal civilian casualties and near zero infrastructure damage (which hurts little people) - but massive vendetta on Washington grand poobahs.\n\nCould see something similar happening between China and Taiwan. Taiwan is peaceful and no threat to China. It shares the same culture. But if the mainland attacked Taiwan, and Taiwan not only killed all invaders...but attacked Beijing and decapitated their government. Well, maybe China might behave thereafter.\n\nTaiwan has a choice. US does too. Macro ethnostates would be a breeding ground for very productive citizens. Kids leaving public schools there would possess 1901 levels of competence and degeneracies would be checked.",
				"added": 1637264219
			},
			{
				"comment_id": 30,
				"body": "> [gonggong](#comment_31_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5): (warning: my english is not good) [...]\n\nNot certain who you were addressing. I too have reservations concerning this idea of \"class war\". Seems like a good way to have endless conflict. No winners at all.\n\nA better strategy might be to set oneself up in ways where you can ignore them and remove all leverage they have on you.\n\nReducing the availability of credit and adopting a sound currency (of some kind) would help a lot here. Makes those upper class people irrelevant. Limits their ability to use you to prop up their bad decisions.\n\nHad the government not protected the upper classes in 2008 - we would now have a different slate of elites. They could do this because the dollar still had perceived value. Turn the dollar into Venezuelan grade currency - all support vanishes.",
				"added": 1637265302
			}
		],
		"1637129548_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 12,
				"body": "> [xanadu](#comment_81_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Who would like to use clearnet :)\n\nTHIS. ++++++",
				"added": 1637164069
			}
		],
		"1636696143_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 13,
				"body": "Will probably install this week, and it's probably an exceptional effort. Still doesn't negate teh need for a simple pushbutton updater function (like the one which already exists). I wish Nofish would clean this up before he exists.",
				"added": 1637165177
			},
			{
				"comment_id": 14,
				"body": "> [nyzdoctn7g4obdcz](#comment_13_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha): Will probably install this week, and it's probably an exceptional effort. Still doesn't negate teh need for a simple pushbutton updater function (like the one which already exists). I wish Nofish would clean this up before he exists.\n\nexits",
				"added": 1637165210
			}
		],
		"1637164951_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 15,
				"body": "> [styromaniac@kxoid.bit](#comment_251_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Yes. On a proxy, I've seen nearly 6,000 seeders for Syncronite. I don't see that many on my devices.\n\nYour effort is exceptional, but I'd bet less than 5% of Zeronet users utilize it. Numbers get pretty large when you walk backward from that?\n\nI credit the censorship success of Youtube/others for nearly all of this........why it's essential to keep feeding this beast with a ZeroNet package anyone can install.",
				"added": 1637167386
			}
		],
		"1637126540_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [
			{
				"comment_id": 16,
				"body": "> [killerwhale905](#comment_4_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): So do people just come to 0net to be toxic and racist?😂\n\nI'm so glad you are around to correct and admonish others.",
				"added": 1637176662
			},
			{
				"comment_id": 20,
				"body": "> [killerwhale905](#comment_5_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): I am not triggered. i really dont care what people say on here. its a free-for-all. i just think theres a more educated way to express their annoyance of african americans in the media.\n\nUnderstand this. Most don't care what you think, or care to listen to your woke prattle. But when you act entitled to change the thinking of others - you've crossed a line. And this world has no mercy for manipulative punks. MANY whites WILL seek the absence of niggers. And there's nothing you can do about it. Many niggers will seek the absence of whites. And that's their prerogative too.\n\nTend to your own business.",
				"added": 1637206750
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac@kxoid.bit](#comment_258_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): We're not woke, we're just not ignorant. You're willing to participate in the race war that establishment democrats want.\n\nNonsense. There is NOTHING inherently wrong with minding your own business and pursuing your own interests. If evil exists - it resides in these endless cultural revolutions a handful of people seek to impose upon \"rest of us\".\n\nBottom line? Most don't care how lefties associate with others. They DO resent imposed forced association. Compelled association never works.",
				"added": 1637261546
			},
			{
				"comment_id": 25,
				"body": "> [jeff](#comment_152_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Libtards would respond to this with screeches of \"RACISM!\" Their magic word has lost its cachet though. I expect the ensuing riots after the Rittenhouse trial will be the end of it altogether. People have had enough.\n\nI'm waiting for a less cowardly reporter to simply ask the question: \"How much were you paid to protest here?\". A Columbo type character/reporter might get away with such an illuminating question. Kinda strikes to the heart of the matter? Strips away the bullshit?",
				"added": 1637261738
			}
		],
		"1637100321_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 18,
				"body": "As always, it depends on what is actually the truth. But when top officials get unconditionally caught doing things like this - they should be killed. The risk to do that needs to be taken. The public just has been too lax on government officials. This is why they keep using us. Only real consequences matter.\n\nThat said, how do you reliably establish truth within this propaganda infested world we live in? World is just too thick with liars.",
				"added": 1637177742
			},
			{
				"comment_id": 26,
				"body": "> [styromaniac@kxoid.bit](#comment_256_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): You're glowing.\n\nI was always a sunshine person :)",
				"added": 1637261870
			},
			{
				"comment_id": 33,
				"body": "> [styromaniac@kxoid.bit](#comment_259_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): I'm guessing you don't know what I mean by \"glowing.\"\n\nActually do. But you may have revealed yourself as humorless :)",
				"added": 1637275732
			},
			{
				"comment_id": 34,
				"body": "> [jeff](#comment_151_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Merrick Garland needs to be given his walking papers. Can you believe this asshole was nominated and could have been confirmed a Supreme Court Justice?!?!\n\nHow naive I was. Once believed it was near treason to block Supreme Court appointments of a sitting president. Turtle man has shamed me. He was right and I was wrong. Garland is a menace to good government.\n\nBecoming clear that no one will trust the feds.",
				"added": 1637276004
			}
		],
		"1636952225_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 19,
				"body": "Links outlining tech Nazi efforts and describing perps involved?",
				"added": 1637177864
			},
			{
				"comment_id": 32,
				"body": "You are right to be concerned and willing to help. Still murky, but I think this young man will find many protectors. Who cannot be stopped. Keep watching but remain patient.",
				"added": 1637266336
			}
		],
		"1637214620_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 23,
				"body": "While I prefer projects where at least one individual has \"global knowledge\" of the entire system, if we can't get someone of this stature to maintain it  - we'd be better off taking our chances with the more common \"collective\".\n\nI'm really, really, disappointed that nofish hasn't saved us - while respecting his ownership of his own time. This was really bad luck for ZeroNet users.",
				"added": 1637261116
			}
		],
		"1637049554_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 31,
				"body": "I love your topic heading. Hahahahahahaha",
				"added": 1637266160
			}
		]
	},
	"comment_vote": {}
}