{
	"next_topic_id": 32,
	"topic": [
		{
			"topic_id": 1551577421,
			"title": "У Gigabyte появилась видеокарта на базе Radeon RX 590",
			"body": "Новинка называется Gigabyte RX 590 Gaming. Построена на GPU Polaris 30 c 2304 потоковыми процессорами. Частота графического ядра в режиме Gaming составляет 1545 МГц, в режиме OC – 1560 МГц. Объём оперативной памяти GDDR5 – 8 ГБ. За охлаждение отвечает стандартный кулер WindForce 2X с двумя вентиляторами и возможностью их остановки при низких нагрузках. О цене Gigabyte RX 590 Gaming данных пока нет.\n\n**P.S.** Видеокарта AMD Radeon RX 590 вышла в середине ноября 2018 года. Многие партнеры компании AMD анонсировали свои решения на базе RX 590 практически сразу, но Gigabyte дошла до этого только сейчас.",
			"added": 1551577403
		},
		{
			"topic_id": 1559733714,
			"title": "«Яндекс», ФСБ и ключи шифрования",
			"body": "ФСБ запросила у «Яндекса» предоставить им ключи для дешифровки данных пользователей сервисов «Яндекс.Почта» и «Яндекс.Диск». «Яндекс» не отказалась, сообщив, что компания «работает в полном соответствии с действующим законодательством».\n\nhttp://127.0.0.1:43110/1GqRz9B5Dgu3FeAXScw2ipSSqgsn9Hk47u/email/yandex/keyfsb.html",
			"added": 1559733692
		},
		{
			"topic_id": 1563718009,
			"title": "Взлом «Сайтэка»",
			"body": "13 июля 2019 года хакеры 0v1ru$ взломали сервер московской IT-компании «Сайтэк». Как оказалось, компания «Сайтэк» — это подрядчик ФСБ, которая занимается проектами «Наутилус» (сбор персональных данных пользователей соцсетей), «Наутилус-C» (деанонимизация пользователей сети Tor), «Награда» (контроль над P2P-сетями, их повреждения и компрометации), «Наставник» (скрытая проверка почты нужных респондентов) и др. Проектов насчитывается около двадцати.",
			"added": 1563717986
		},
		{
			"topic_id": 1564022349,
			"title": "Идентификация пользователей Email",
			"body": "Группа сенаторов — Клишас и Ко — внесла в Госдуму законопроект, который предусматривает обязательную идентификацию пользователей электронной почты по номеру телефона, а также обязывает почтовые сервисы заниматься перлюстрацией писем.\n\nhttp://127.0.0.1:43110/1GqRz9B5Dgu3FeAXScw2ipSSqgsn9Hk47u/email/zametki/iduser.html",
			"added": 1564022325
		},
		{
			"topic_id": 1564132288,
			"title": "Тесты первых шести спутников OneWeb",
			"body": "Компания OneWeb провела первые испытания своих шести спутников. Скорость передачи данных составила около 400 Мбит/с и пингом в среднем 32 мс. В дальнейшем пользователи могут рассчитывать на Интернет в 100-500 Мбит/с и пингом 25-35 мс.\n\nhttp://127.0.0.1:43110/19NTsC5seR14WDjfH4GPpCLeP49Rraf6UT/pub/2019/testsix.html",
			"added": 1564132263
		},
		{
			"topic_id": 1582968209,
			"title": "Браузер Brave будет открывать недоступные страницы из «Архива Интернета»",
			"body": "Начиная с версии 1.4, браузер Brave для настольных компьютеров будет осуществлять проверку наличия веб-страниц в «Архиве Интернета» (https://archive.org/web/).\n\nНапример, если пользователь не может открыть веб-страницу из-за ошибки 404 (страница не найдена), Brave «нырнёт» в архив Wayback Machine, найдёт архивную копию этой веб-страницы и предложит посмотреть её в Архиве Интернета.\n\nЗа 23 года существования проекта Wayback Machine было заархивировано более 900 миллиардов URL-адресов и более 400 миллиардов веб-страниц. И этот архив каждый день пополняется сотнями миллионов новых архивированных URL-адресов. То есть archive.org, скорее всего, имеет архивные версии большинства «отсутствующих» страниц, с которыми может столкнуться пользователь.\n\nПомимо ошибки 404 браузер Brave реагирует и на другие: 408, 410, 451, 500, 502, 503, 504, 509, 520, 521, 523, 524, 525 и 526. Обнаружив одну из этих ошибок Brave так же предложит пользователю загрузить архивную копию недоступной веб-страницы.",
			"added": 1582968181
		},
		{
			"topic_id": 1583501670,
			"title": "Исследование современных сетей",
			"body": "ГРЧЦ («Главный радиочастотный центр»), подведомственный Роскомнадзору, проведёт работы по исследованию, анализу современных информационных и коммуникационных технологий и протоколов:\n\n- **mesh-сети:** Yggdrasill, cjDNS, Briar, Signal Offline, FireChat и др.\n\n- **Darknet** (так называемый): I2P, TOR, TON, Freenet, ZeroNet, anoNet.\n\n- **IoT:** различные технологии и протоколы, использующиеся в «интернете вещей».\n\n«Специалисты» будут проводить исследования и анализ сетей, построенных на вышеперечисленных технологиях и протоколах, на предмет того, как через них может распространяться запрещённая информация в РФ, а также как в последующем ограничивать трафик в таких сетях: блокировать, ухудшать передачу данных и пр.\n\nКонтракт на выполнение работ, стоимостью 9 192 190,75 рублей, размещён на сайте госзакупок: https://zakupki.gov.ru/223/purchase/public/purchase/info/common-info.html?regNumber=32008950175 (окончание работ – 30 июня 2020 года).",
			"added": 1583501641
		},
		{
			"topic_id": 1585483714,
			"title": "OneWeb объявила о банкротстве",
			"body": "OneWeb подала заявку о банкротстве в суд штата Нью-Йорк. На фоне ухудшения ситуации в мировой экономике из-за пандемии коронавируса компания OneWeb не смогла достичь договоренности с японским SoftBank о привлечении дополнительного финансирования на сумму $2 млрд.\n\nhttp://127.0.0.1:43110/19NTsC5seR14WDjfH4GPpCLeP49Rraf6UT/pub/2020/bankrot.html",
			"added": 1585483684
		},
		{
			"topic_id": 1592886845,
			"title": "Смерть Adobe Flash",
			"body": "Компания Adobe сообщила, что полностью прекратит поддержку Flash 31 декабря 2020 года, а после удалит страницу загрузки Flash со своего сайта. Пользователям рекомендуется смириться с утратой, а разработчикам вместо Flash использовать альтернативные решения такие как HTML5, WebGL и WebAssembly.",
			"added": 1592886814
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1551577421_1CTXZrGJQiFjTappyJ3dJpuyb7Wecw7iSp": [
			{
				"comment_id": 1,
				"body": "> [hartmann2](#comment_1_19vb3KdkTdVe3RCfqVvSPHSLZg1jZu6T6k): Хватит насиловать GCN\n\nЖдём Navi :)",
				"added": 1551599100
			}
		],
		"1559733714_1CTXZrGJQiFjTappyJ3dJpuyb7Wecw7iSp": [
			{
				"comment_id": 2,
				"body": "Павел Дуров сообщил, что собирается создать первый в мире свободный от политической цензуры агрегатор интернет-новостей, похожий по структуре на «Яндекс.Новости»: [Паша Дуров и «Яндексграм»](http://127.0.0.1:43110/1GqRz9B5Dgu3FeAXScw2ipSSqgsn9Hk47u/news/agg/yandex/yandexgram.html).",
				"added": 1560689019
			}
		]
	},
	"comment_vote": {}
}