{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1567536043_15yACUjRkanC9AeFyo7RQSBiZLWmmNvddW": 1,
		"1567646630_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 1,
				"body": "I've always just used uTorrent over Tor for bittorrent. thepiratebay.org and limetorrents.info work fine but use adblock of some sort.\n\nThe trick is to leave socks5 proxy off just till it finds seeders, then switch socks5 proxy back on (make sure it uses proxy for peer-to-peer connections). I've done that forever and haven't had a problem.",
				"added": 1567630038
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 2,
				"body": "I'll assume OP is trolling but I'll play along even though it exposes my oldfag status...\n\nI've been pirating stuff since the BBS days; when people were actually getting *raided* for things like pirated copies of TheDraw or something stupid. FF through -> Internet piracy -> distributed or encrypted systems -> distributed *and* encrypted systems. Nobody is coming for anybody now. Yeah there will be a few arrests that are trumpeted to justify some LEO's paycheck but that party is over for the most part.\n\nThe weird economics of monolithic internet services which are based on growth rather than market share are extremely tenuous. It doesn't take much to topple those houses of cards and uncensored systems will rush in to fill the void. The old systems may stay afloat for a while just on pure inertia but even then it won't be like Compuserve and AOL, which were at least taking in actual money. Market share valuation needs constant growth, which is ending and selling ads is going to get much less profitable as all the smart people will be using ad blockers.\n\nPiracy and extreme digital freedom are the future whether anyone likes it or not.",
				"added": 1567665881
			}
		]
	},
	"comment_vote": {
		"112_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1
	}
}