{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Новости о профсоюзах и защите прав наёмных работников",
			"body": "18-07-2018\n==================================================================================\n1. Работники складов Amazon бастуют в Испании, Германии и Польше, жалуясь, что компания обогащается за счет их здоровья. Темп работы на складах постоянно ускоряется, работники боятся отлучиться в туалет, часто получают травмы, жалуются на проблемы с психическим здоровьем. Забастовка приурочена к скидочному дню Prime Day, когда количество заказов увеличивается. \nПодробнее: http://www.cnews.ru/news/top/2018-07-17_sotrudniki_amazon_bastuyut_po_vsej_evrope\n\n2. Печальная новость о разгроме профсоюзной ячейки в УФЕ \nhttps://rusmonitor.com/voditelya-skorojj-pomoshhi-uvolili-za-to-chto-potreboval-pokryt-zadolzhennost-po-zarplate.html\n\n3.https://om-saratov.ru/politics/11-july-2018-i63443-v-saratove-policiya-proveryaet\nВ Саратове полиция проверяет на экстремизм выступление депутата регионального парламента от КПРФ Николай Бондаренко о пенсионном возрасте. Об этом 33-летний Бондаренко рассказал в комментарии \"ОМ\".\n\"Позавчера ко мне приходила группа из пяти полицейских с видеокамерой. Они сказали, что идет проверка на наличие экстремистских высказываний в моих словах, сказанных недавно на заседании комитета облдумы, где обсуждался федеральный законопроект о повышении пенсионного возраста. Я дал объяснение. Мне задавались в том числе вопросы, фиксировал ли я как-либо свое выступление и намерен ли его в дальнейшем распространять\", - пояснил Бондаренко. \n\n4. Крайне любопытная статья со многими цифрами - https://barkut0709.livejournal.com/53906.html\n==================================================================================",
			"added": 1531906996
		},
		{
			"topic_id": 2,
			"title": "Для тех кто сидит без Tor и посещает порносайты",
			"body": "Пермский программист арестован за то, что через созданное им мобильное приложение действовал педофил  \nВнешняя ссылка!\nhttps://news.rambler.ru/other/41665638/?utm_content=rnews&utm_medium=read_more&utm_source=copylink\n\nФедор Власов, 37-летний ИТ-специалист из Перми, сидит в московском СИЗО «Водники» уже четвертый месяц. В 2012 году он вместе с другом Дмитрием Моисеевым сделал приложение для android Kate Mobile. Оно позволяет выходить в соцсеть «ВКонтакте» даже со старых телефонов, куда официальное приложение соцсети не устанавливается. Еще одно отличие — приложение пермских программистов «весит» почти в 10 раз меньше. Kate Mobile создавался с согласия разработчиков «ВКонтакте».\nСейчас этим приложением пользуются около 5 млн жителей России и зарубежья. В 2017 году «ВКонтакте» заблокировали на Украине, и большое число людей, которые несколько лет пользовались Kate Mobile, потеряли доступ к соцсети. Разработчики стали решать проблему: они арендовали у компании в Санкт-Петербурге прокси-сервер, чтобы через прокси-подключение пользователи и дальше могли входить в соцсеть через Kate Mobile.\nАбсурдное обвинение\nПервого ноября 2018 года домой к Федору Власову пришли приехавшие из Москвы сотрудники полиции. Они провели обыск, изъяли компьютеры и смартфоны. Затем на него надели наручники, посадили в поезд и увезли в столицу. Там его допросили в качестве свидетеля по уголовному делу. Оно было возбуждено несколькими неделями ранее по статье 132 УК РФ (насильственные действия сексуального характера в отношении неустановленного лица). Спустя двое суток после задержания в Перми айтишник из свидетеля стал обвиняемым, и с 3 ноября он находится в СИЗО № 5 Москвы. Теперь ему грозит от 12 до 20 лет лишения свободы.\nОказалось, что некий человек переписывался с ребенком, не достигшим 14-летнего возраста, и обменивался с ним фотографиями сексуального характера. Аккаунт, с которого велась переписка, был создан специально для этого. Правоохранители попытались вычислить злоумышленника по IP-адресу (уникальному сетевому адресу узла в компьютерной сети). След привел их к тому самому прокси-серверу, который находится в Санкт-Петербурге и обеспечивает доступ в соцсеть через Kate Mobile. По словам соавтора приложения Дмитрия Моисеева, через этот прокси-сервер каждые сутки в соцсеть выходят около 200 тыс. человек. Но обвинение предъявили Федору Власову, который арендовал сервер.\nСледователь запретил показать IP настоящего злоумышленника\nПо словам адвоката Федора Власова Александра Струкова, узнав, какое преступление совершено, программист сразу сказал сотрудникам полиции, что может помочь найти предполагаемого преступника. Но ни оперативников, ни затем следователя это предложение не заинтересовало.\n«Ко мне обратились уже после ареста Федора. Подзащитный мне рассказал, как в самом начале сообщил следователю, что ему известно, как найти того, кто на самом деле переписывался с ребенком. Он был готов показать, как это сделать, но ему не позволили и потребовали, чтобы он не мешал расследованию», — пояснил адвокат корреспонденту «ФедералПресс».\nДмитрий Моисеев подтверждает, что у соавтора приложения действительно были реальные IP-адреса пользователей приложения.\n«Когда в 2017 году нужно было обеспечить стабильность работы приложения, мы могли купить какие-то «левые» прокси-сервера. Но Федор на свой страх и риск решил сделать все на себя — для того чтобы полностью контролировать качество работы приложения и иметь возможность разбираться с техническими ошибками, когда они возникают, — рассказывает Дмитрий Моисеев. — И он специально «логировал», то есть сохранял информацию о том, какой пользователь и когда заходит в приложение. Когда к прокси-серверу подключался пользователь с Украины, на сервере сохранялась информация, содержащая его реальный IP-адрес, и новый, который ему выдавал прокси-сервер. Эти данные у Федора хранились, но проблема в том, что следователь и те, кто работает по делу, этой информацией не заинтересовались. Вместо того чтобы получить у разработчика реальные IP-адреса того, кто вел переписку, они просто арестовали Федора и предъявили ему обвинение».\nТехнику, которую изъяли дома у Федора Власова, сейчас изучают эксперты. Они должны установить, есть ли на компьютерах и гаджетах следы того, что переписку с девочкой вел именно Федор. Александр Струков и Дмитрий Моисеев волнуются, смогут ли (или захотят ли?) эксперты СКР увидеть, что у них в руках есть данные, ведущие к тому, кто действительно совершил преступление? И хочет ли следователь разбираться в деле и искать истинного преступника, или ему важно просто выдать результат?\nВ каком направлении сейчас идет расследование, адвокат не знает. По закону СКР обязан ознакомить обвиняемого и адвоката с материалами дела уже на финальном этапе расследования.\nКорреспондент «ФедералПресс» обратился за пояснениями в СКР. Но в отделе, который ведет расследование, отказались давать комментарий. Получить его в Следственном управлении СКР по городу Москве на момент публикации также не удалось.\nИстория Власова похожа на дело Богатова\nСообщение об аресте Федора Власова вызвало недоумение у многих, кто с ним знаком. Он закончил физический факультет Пермского государственного университета, хорошо известен в среде городских программистов (некоторые считают его очень талантливым). Люди, которые общались с ним в обстоятельствах, не связанных с его работой, говорят, что он добрый, отзывчивый и очень скромный человек. Например, он помогал некоммерческим организациям и при этом просил не афишировать его имя. По словам адвоката, ранее в отношении Федора Власова дела не возбуждались.\nПри обсуждении ситуации с арестом Федора Власова многие вспоминают так называемое дело Богатова. В апреле 2017 года математика Дмитрия Богатова обвинили в призывах к терроризму и массовым беспорядкам. Основанием для ареста стало то, что IP-адрес человека, опубликовавшего призыв на форуме, совпал с IP-адресом Дмитрия Богатова. Это объяснялось тем, что он был оператором, поддерживающим узел сети Tor, и его адресом пользовались другие люди. В поддержку обвиняемого развернулась большая общественная кампания, в том числе выступил и Эдвард Сноуден. Через несколько месяцев с Дмитрия Богатова сняли обвинения, и он стал свидетелем по делу. Весной 2018 года в деле появился другой подозреваемый.\nВозможно, в деле Федора Власова, как и в истории с Дмитрием Богатовым, единственная надежда — на общественный резонанс. Об этом сообщает Рамблер. Далее: https://news.rambler.ru/other/41665638/?utm_content=rnews&utm_medium=read_more&utm_source=copylink",
			"added": 1549304979
		},
		{
			"topic_id": 3,
			"title": "Деанонимизация в ZeroNet",
			"body": "https://habr.com/ru/company/fbk_cs/blog/439522/\n\nНепосредственно, про ZeroNet в статье упоминаний нет, но несложно предложить метод деанонимизации пользователей ZeroNet на основе данного материала",
			"added": 1550065970
		}
	],
	"topic_vote": {
		"2_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": 1,
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": 1,
		"3_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": 1,
		"2_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": 1,
		"2_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": 1,
		"1_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": 1,
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"2_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": 1,
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": 1,
		"35_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"36_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"37_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"6_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"2_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"3_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": 1,
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1
	},
	"next_comment_id": 46,
	"comment": {
		"2_1JBcoMArHbt3S8kMXG4YcR88q8HYfwb3x5": [
			{
				"comment_id": 1,
				"body": "CQEGAcGZxsBNBFr5fNUBCADeNz3E2mlMbatb+qA2AwDk/+hzihPct85JKLZVqb4+\nhm7UNS3nXFkgTMUfmfSLFq9PPvXDkJ67gPYPRw6+xHI86L3XrFK3Hfj7WdQIU2Ym\nSnrOIqaEl7l849CcJDvqbRqjA6zGIvyC+nyB3vySLxFSRlisdxl1yx2zL2ntfm/8\nhkATN1KfSV7Sg4QGLkmJKk2LS33SpbgmxNhBxt+7Lf/KEUi44Oe6Jd/DjMHZG3rU\nGcKBiAmoJH2TdazLCmy/w4J4YwO5EE+iXnzTeFCvWkNf64cKOc/mniie5Ft7EH3a\nMtZ6b5akB9sShxki8rz+9f5qGGR3GFIcDpC8+vizj4UnABEBAAHNJWdsdWNrbWFu\nIChHZW5lcmF0ZWQgYnkgUmV0cm9TaGFyZSkgPD7CwF8EEwECABMFAlr5fNUJEBcr\nTruUdfaNAhkBAACZRggAqg7XifotkEJK75Ne2Q2s3ioZD0OfxQP20DS8n0wsbUZ6\nINRb8dw1DaUC4Wd9D4ki7SwR5XNET0YEP9iik6huPR7GzUUu6HIwm9NXVBxQXPa4\nzQXVxGTMHiFkncIbzgJePtMJYZsp/EgOYUE4TvvKrczDgdeNiOZllwHsKvPT8dfC\nUXhe0a3Ei9Ob9NWg1pVqYOCqOEoXnpzFN59RQ746j9oMv7Rn9WO3e5z2wKmEwCHT\n0DhKsNhaekTyQJ/YrVbKp0NyRl/63EMQkJPHcPfNoXi7DkRdMmPPbGSsxn87zkXq\nO+n1AY43W/bHJ6XAwhhsEmH9d1PnfnOjk51LtacxkwIGW/Et8iVGAwYKyAMWJUYE\nAAYLTXkgY29tcHV0ZXIFEG3Ul++HM9QR8QfY9U+gHFYHA2wEFQ==",
				"added": 1531477285
			}
		],
		"2_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": [
			{
				"comment_id": 2,
				"body": "Конфедерация труда России с рядом союзников (частично КПРФ, особенно ряд отдельных её членов, \"партия дела\" и пр) ведёт компанию против повышения пенсионного возраста.  Сейчас в стране прошло более полутора сотен акций протеста. К сожалению профсоюзы в России в настоящий момент слабы.  Само собой на нас оказывается давление, но боремся.",
				"added": 1531477697
			},
			{
				"comment_id": 3,
				"body": "Друзья, будем честны остановить этот людоедский закон шансов почти нет. Но нужно понимать, что это не последняя подобная инициатива правящего класса.   Пенсионный возраст могут повысить и далее.  Могут отменить бесплатную медицину и пр.  Поэтому предлагаю объединятся.  Если кому-либо интересно - готовы провести занятия по методики организации профосюза и отстаиванию трудовых прав.",
				"added": 1531477833
			},
			{
				"comment_id": 5,
				"body": "> [marketforce](#comment_1_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): Все было понятно пять лет назад:https://pora-valit.livejournal.com/1738285.htmlЪ: Маленькое поколение рожденных в 90-е в принципе не способно прокормить большое поколение, рожденное после войны. \n> Даже если царь случайно произнесет волшебное слово \"Навальный\" и тут же сдохнет, деньги на пенсии все равно не появятся.\n\nПроблема не в этом.  Реальная разница между численности поколений не та.\n\nКроме того огромные ресурсы банально присваиваются олигорхатом или тратятся на политические авантюры",
				"added": 1531489273
			},
			{
				"comment_id": 6,
				"body": "> [cybermann](#comment_1_1L1amEZLbvnYZ7pmbFRTtg2Kr9zZFrNC5Z): Ничего не думаю, мне не актуально.\n\nэто вы сейчас так хорохоретесь",
				"added": 1531489326
			},
			{
				"comment_id": 11,
				"body": "> [marketforce](#comment_2_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): А какая? Мы можем исходить из данных госкомстата?\n> \n> Разумеется, но я не об этом, а о том, что арифметически невозможно заплатить пенсии из пенсионных взносов работников, причем такая ситуация не только в России. Необходим дополнительный приток денег, причем огромный.\n> А где же его взять?  Допустим, если самодержец устанет и уйдет, все вдруг перестанут воровать, армия добровольно разойдется, а американцы отберут у олигархов украденный триллион и вернут россиянам, то денег хватит.  А если не все так поступят? Какой-то профсоюз их всех, что ли, напугает?\n\nКакая?  - Недостаточная.\n\nВсе пропагандонские сказки о том, что чисиленности следующих поколений недостаточно для поддержания пенсионного возраста на текущем уровне враньё по следующим причинам:\n\n1.\nВ СССР была \"солидарная\" пенсионная система. Пенсия выплчивалась напрямую из государственных бюджетов Союза или союзной республики.\n\nПри создании ПФР в уего уставной капитал необходимо было заложить средства эквивалентные соответствующим активам советского времени.\n\nБыло ли это сделано?  \n\n2.  Доходность ПФР должна быть не менее инфляции - иначе вложенные средства сгорают.\n\nНо это не так. Реальная доходность ПФР и частных пенсионных фондов не более 5 с небольшим процентов. \n\nЧастные фонда просто устроили картельный сговор, что бы не давать клиентам большей доходности.\n\nПФР ещё хуже - положил средства в ВЭБ - по сути частную кассу верхушки текущего режима.\n\nА ВЭБ не то, чтобы хорошо себя чувствует....",
				"added": 1531746988
			},
			{
				"comment_id": 12,
				"body": "> [marketforce](#comment_2_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): А какая? Мы можем исходить из данных госкомстата?\n> \n> Разумеется, но я не об этом, а о том, что арифметически невозможно заплатить пенсии из пенсионных взносов работников, причем такая ситуация не только в России. Необходим дополнительный приток денег, причем огромный.\n> А где же его взять?  Допустим, если самодержец устанет и уйдет, все вдруг перестанут воровать, армия добровольно разойдется, а американцы отберут у олигархов украденный триллион и вернут россиянам, то денег хватит.  А если не все так поступят? Какой-то профсоюз их всех, что ли, напугает?\n\n\nКак ни странно звучит - случайно нашёл\n\nhttps://barkut0709.livejournal.com/53906.html",
				"added": 1531752181
			},
			{
				"comment_id": 22,
				"body": "Был на митинге в Москве.  Порядка 12 тысяч было.  Много политических активистов, но много и просто людей 40+ и особенно 50+ кто понял что их будущее ухудшается.\nПрошло всё спокойно, но людей явно мало для того, чтобы оказать влияние на ситуацию",
				"added": 1532942908
			}
		],
		"1_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV": [
			{
				"comment_id": 4,
				"body": "> [volodja](#comment_1_17kweDjPaMa2tprBHxW6YNizQ44yg7nT5P): зацените идею:\n> Децентрализованная система самоуправления с регистрацией по паспорту с хранением истории и сделок(заказ - исполнение) между пользователями в блокчейне, без модераторов, каждый сам себе модератор, которая будет постепенно вытеснять снизу вверх управленцев. Это как профсоюз только более живучая.\n> как вариант система самоуправленияв которую люди будут скидываться деньгами на подобии ЖКХсоздавать темы для обсуждения реализации каких то проектов, голосовать в которых деньгами(плата за ЖКХ), начиная от обустройства жилища далее объединяться с другими людьми для чего то большего например постройки дороги и тдчтобы исполнители регестрировались в этой же системесома система децентрализованная и хранится на ПК позователейрегистрация по паспортучтобы вся история(переписки, реализация проектов, косяки) хранилась в блокчейне никогда не удаляется и ее не возможно было изменитькаждый сам себе модератор, без цензуры сверху\n> если такая система будет реализована то она будет существенно более эффективная чем текущая бюрократия\n> все захотят ее использовать вместо текущих ЖКХ компаний т к дешевлеа дальше она снизу вверх будет вытеснять управленцев, вплоть до того что например в мэрии можно будет сделать своего представителя от системы, который все вопросы будет выносить на обсуждение в форум и ничего не сможет сам решать(по официальной договоренности) и тд, не будет накладных расходов на бюрократию\n> а еще добавлюв этой же системе возможно делать кооперативы так же без лишней бюрократиину и в развитии если наберется критическая масса людей то и гайки будет намного сложней закручивать\n\nНечто подобное есть у профсоюза лётчиков. Только конечно централизованное.",
				"added": 1531478611
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 7,
				"body": "есть конечно",
				"added": 1531490937
			}
		],
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 8,
				"body": "верёвка покрепче. Старое доброе удавление вполне себе.  Хочешь помедленнее - короткое падение. Хочешь побыстрее - долгое падение.   Мыло не забудь.  Говорят ещё перед тем как прыгать выдохнуть стоит, если задержать дыхание - будешь долго дёргаться. \n\nПрыжок с высоко здания. Только проверь, что внизу никого нет. Недавно один чел так ребёнка убил.",
				"added": 1531491141
			}
		],
		"1_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 9,
				"body": "1. Деплой, оркестрация микросервисов\n2. Docker swarm для оркестрации,  балансировки нагрузки и обеспечения отказоусточивости\n3. Год\n4. Нет\n5. На пять нод\n6. До пятидесяти\n7. Все контейнеры строго stateless",
				"added": 1531736597
			}
		],
		"11_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 10,
				"body": "Смотря в какой стране живёшь. Но скорее всего ничем. Полиция из России вряд ли будет писать в полицию твоей страны.",
				"added": 1531736682
			}
		],
		"3_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": [
			{
				"comment_id": 13,
				"body": "Сироп то какой?",
				"added": 1531756274
			},
			{
				"comment_id": 15,
				"body": "> [shaper](#comment_11_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE): Малиновый\n\nПро газирование верно пишет @xigmatik \n\nНо всё же сладкое с водкой ИМХО не очень - может, что то кисло-сладкое?",
				"added": 1532079250
			}
		],
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": [
			{
				"comment_id": 14,
				"body": "> [caryoscelus](#comment_12_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Во-первых, СПО позволяет обходить блокировки и слежку. Во-вторых, может навредить монополистам. В-третьих, был бы человек, а статья найдётся. Не следует переоценивать государственную целесообразность в действиях людей, готовых поставить на поток приговоры за лайки и репосты. У них может план недовыполнен, а тут попадутся под руку какие-то мутные личности, топящие за свободу.\n> \n> Всего того же, что делают с оппозицией и попросту попавшимися под руку. Т.е. собственно спектр последствий думаю ничем не ограничен, хотя радикальные действия наверное и менее вероятны, чем административное давление штрафами и запретами.\n> И есть подозрение, что если результаты переназначения будут такими (включая 2-е и 3-е место), как нам вещают т.н. \"независимые\" социологи, то ситуация будет только ухудшаться.\n\nОпыт той же Роскомсвободы или независимых профсоюзов всё же говорит что опасность не столь фатальна",
				"added": 1531825389
			}
		],
		"1_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 16,
				"body": "> [shaper](#comment_12_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE): Как ты сделал капс????\n\nПока сам не понял. Поэкспериментирую - напишу",
				"added": 1532079287
			},
			{
				"comment_id": 17,
				"body": "https://www.facebook.com/events/258662308255872/\nПодробнее о мероприятии\n28 и 29 июля в Москве состоятся две акции против повышения пенсионного возраста. Мы предпочли бы единую массовую акцию против этого дикого закона и готовы дальше работать на ее проведение в начале сентября. А пока приглашаем всех присоединиться 28 и 29 июля к колонне Российского социалистического движения!\n\n28 июля - шествие и митинг, организованный КПРФ. Сбор с 11:00 на улице Маши Порываевой возле гостиницы \"Ленинградская\" (станция метро \"Комсомольская\"). Начало движения в 12:00.\n\n29 июля - митинг Либертарианской партии в 14:00. Начало сбора в 13:00, вход со стороны улицы Маши Порываевой (станция метро \"Комсомольская\").\n\nВыведем власть из зоны комфорта! Остановим пенсионную реформу вместе!\n\nНедавно один из депутатов из «Единой России», выступавших за повышение пенсионного возраста, нагло призывал граждан «выйти из зоны комфорта». Он имел ввиду, что гарантии защищенной старости – просто дурная привычка, «зона комфорта», которая мешает работать и развиваться. За последний месяц мы уже слышали достаточно подобного вранья от сытых министров, депутатов и продажных журналистов. В пользу реформы приводят и другие аргументы: на пенсии не хватает бюджета, средняя продолжительность жизни увеличилась, реформа позволит пожилым людям найти нормальную работу.\n\nВсе это ложь.\n\n– Возможно, денег в бюджете действительно немного, но лишь по одной причине: частные и государственные корпорации получают огромные налоговые льготы или просто не платят налоги, а власть им в этом помогает.\n– Пожилых людей дискриминируют на рынке труда: найти работу после 45 лет можно лишь в узких специальных отраслях.\n– Многие пенсионеры и так работают, чтобы сводить концы с концами, а не сидят в «зоне комфорта», как считает правительство.\n– Утверждения о резком росте продолжительности жизни основаны на манипуляциях с цифрами. В неблагополучных регионах люди умирают все раньше, а коэффициенты, которые озвучивают чиновники и депутаты – не более, чем «средняя температура по больнице».\n\nЕдинственная настоящая цель реформы – это защита интересов крупного бизнеса, который лихорадочно пытается выжать из общества еще больше.\n\nСейчас, после того, как власть увидела рост возмущения снизу, в ход будут пущены всевозможные уловки. Не случайно главным мотором реформы выступает правительство Медведева, а Путин якобы смотрит на происходящее со стороны. Даже если он «триумфально» вмешается и предложит смягчить реформу, не меняя ее сути, на это нельзя соглашаться. Надо требовать отказа от самой идеи повышения пенсионного возраста!\n\nЧтобы преодолеть бедность, в которую погружается сегодня большинство жителей России, нужны совсем иные реформы. Необходимы прогрессивный налог, национализация природных ресурсов, повышение пенсий и минимальной зарплаты до достойного уровня, реальные гарантии прав работников от произвола работодателей.\n\nДобиться изменений можем лишь мы сами – участвуя в политической жизни, отстаивая свои интересы, помогая друг другу.\n\nРоссийское социалистическое движение\nAnticapitalist.ru",
				"added": 1532434644
			}
		],
		"3_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 18,
				"body": "рискну рекомендовать одну из классических фолиантов аля Фигурнов, или лучше учебник информатики старших классов",
				"added": 1532591752
			}
		],
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 19,
				"body": "1. Революция - нет. \n\n2. Смена власти или существенное изменение особенностей текущего режима возможна.  Возможно как предполагать некое превращение Путина в некоего \"куадильё\", \"вождя\", или по типу Назарбаева или как то ещё\n\nТакже весьма вероятна фашизация режима, как минимум до уровня украинского,.",
				"added": 1532592021
			},
			{
				"comment_id": 21,
				"body": "> [syntia](#comment_1_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Если честно - кремлеботы уже в костях наших граждан гремят, подобно отложению солей. Только тихая, не революционная смена власти способна повлиять на ситуацию.\n\nУвы, но у нас в России диктатура -  легального способа смены власти нет\n\nВпрочем в соседней Украине, Белоруссии или Казахстане всё аналогично",
				"added": 1532942820
			},
			{
				"comment_id": 23,
				"body": "> [dmj](#comment_2_13h4AfS5tzpEmkcoZ7n2RJpFuAhB5duxCt): Да, жить стало совсем невмоготу. Нищета, режим зверствует...То-ли дело раньше - никаких проблем! С утра встал, поел, пообщался с друзьями,  поспал, снова поел, а потом, глядишь, уже и мамка из садика забирает!\n\nСмех смехом, но вот повышение пенсионного возраста - реально людей выкинет в нищету",
				"added": 1533554466
			}
		],
		"2_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": [
			{
				"comment_id": 20,
				"body": "Ссылки на Retroshare приветствуются?  Или как?",
				"added": 1532593133
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 24,
				"body": "Печально, что мы теряем таких товарищей.  Очень печально.\nРоман старался создавать сайты где люди могли свободно общаться.\n\nЕсли мы сохраним человечное отношение друг к другу и науимся спокойно обсуждать сложные проблемы, не переходить на личности и не воспринимать человека с другими взглядамив качестве врага - значит Роман не умер но продолжает жить в наших воспоминаниях и делах.",
				"added": 1548782219
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 25,
				"body": "Мне кажется наша проблема не только и не столько в технике, сколько в отношении друг к другу.\nПонятно, что даркнет стал местом где люди могут выражать любые, в том числе совершенно не популярные и даже опасные для публичного выражения IRL мнения.\n\nПусть так. Для этого darknet и создаётся.\n\nДавайте же по крайне мере стараться по доброму относится друг к другу.  Пусть собеседник имеет иное мнение, пусть вы с ним не согласны.  Но пострайтесь не видеть в нём врага.\n\nЭто тяжело и даже иногда невозможно.  Как например можно не увидеть врага в том, кто предлагает убивать представителей твоего народа?\nТогда также есть хорошее решение - игнорирование. Можно сказать такому человеку почему ты больше не желаешь с ним общаться и если он подтвердит, что действительно имеет подобное взгляды,  что вы не ошблись и что менять их он не будет - игнор.\n\nНо давайте всё же будем человечнее. Процитирую сам себя\n...\nРоман старался создавать сайты где люди могли свободно общаться.\n\nЕсли мы сохраним человечное отношение друг к другу и науимся спокойно обсуждать сложные проблемы, не переходить на личности и не воспринимать человека с другими взглядамив качестве врага - значит Роман не умер но продолжает жить в наших воспоминаниях и делах.\n...",
				"added": 1548782597
			},
			{
				"comment_id": 27,
				"body": "И мне непонятна идея странного совета ZeroNet.  Какие задачи будет решать этот орган?  Для чего он нужен?\nМне понятно для чего была нужна бюрократия в FiDO, которую кстати говоря оккупировали кащениты\nПонятна роль IETF  или центров распределения адресов интернет\n\nНо зачем тут нужен орган центрального управления?",
				"added": 1548928418
			},
			{
				"comment_id": 28,
				"body": "> [caryoscelus](#comment_41_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): А если так (ссылка со списком нод)?\n> А до моей ноды сообщения gluckman не доходят :(\n> geekless, ещё деталь по технической части: было бы неплохо добавить альтернативные центры сертификатов (во всяком случае, если делать белые списки, это не должно вызвать особых проблем со спамом)\n\nВозмолжно проблема в том что я использую TOR\n\nОтносительно альтернативных удостоверяющих центров - мысль здравая.  Думаю нужно реализовать",
				"added": 1548931203
			},
			{
				"comment_id": 29,
				"body": "> [geekless](#comment_85_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?Post:2\n\nЗначит неправильно понял идею\n\nНо я всячески за развитие ZeroNet и всем чем могу буду помогать",
				"added": 1548931239
			},
			{
				"comment_id": 30,
				"body": "> [caryoscelus](#comment_42_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Возможно, но сейчас такого нет. Вообще бывают такие сбои и как их отследить не очень понятно\n\nСтратегически - изучить и возможно создать инструменты мониторинга\n\nПрямо сейчас, в пределах дней или недель - могу поднять ноду в clearnet вне страны и скормить ей рускоязычные сайты, чтобы поддерживала их копии\n\nВозможно будет работать лучше",
				"added": 1548931450
			},
			{
				"comment_id": 31,
				"body": "> [caryoscelus](#comment_42_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Возможно, но сейчас такого нет. Вообще бывают такие сбои и как их отследить не очень понятно\n\nЕщё нужны думаю дополнительные трекеры.  И внутри страны и за границей",
				"added": 1548931611
			},
			{
				"comment_id": 32,
				"body": "> [wrewolf](#comment_152_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Рентранслирую twister с 2012 года готов выделить ресурсы и для ZeroNet если она стала стабильней, помню что до этого публичная нода мост не жила больше недели.\n\nМожно же таймер сторож повесить",
				"added": 1548936415
			},
			{
				"comment_id": 33,
				"body": "> [x86128](#comment_7_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Еще пробуют запустить работу через cjdns. В ZeroMe Kaffie:1) http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/15484768042) http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/1548924540\n> Поскольку ZeroNet наконец-то работает через IPv6 теперь работа через cjdns стала возможным. Это конечно не убийца Tor, но тем не менее еще одна альтернатива которая работает параллельно Тор.\n\nНа выходных также попробую и присоединюсь\n\nРазвивая идею возможно предложить также RetroShare over CJDNS\n\nИ даже (пока правда не очень понятно зачем) I2p over CJDNS  и Tor over CJDNS",
				"added": 1548937657
			},
			{
				"comment_id": 34,
				"body": "> [wrewolf](#comment_154_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Можно, надо заморочиться. После рабочего дня займусь.\n\nС меня тогда также помощь и/или альтернативная реализация",
				"added": 1548937710
			},
			{
				"comment_id": 43,
				"body": "> [revolter](#comment_1_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ): Это что, передел власти? Выдвигаются очень странные инициативы, больше похоже на какую-то провокацию. Хочешь застолбить вакантные места чуть ли не основателей русскоязычного сегмента, создать конфочку приближенных айтишничков, которая будет рулить одобренными ресурсами? Может еще вики сделаешь, со смешными логами из конфочки, как вы весело сосете там пивасик и айтишничаете? А калтент ты какой генерировать будешь? Вот такие простыни с самовосхвалением?\n\nГрубоватый стиль - не моё, но по сути у меня аналогичные вопросы.\n\nЛично для себя выбираю - создавать сайт с интересными мне и возможно другим людям вещами, а как дальше будет - посмотрим\n\nЕсли ZeroNet Concil будет делать разумные вещи - буду  помогать,  будут творить фигню - интернет большой я и в стороне постою",
				"added": 1550059692
			},
			{
				"comment_id": 44,
				"body": "> [ks7715](#comment_3_16NJNN8b3jUEAGtVWoPR1vkEPkXX6BQWAY): А, что случилось с Балансером?\n\nговорят заболел и умер",
				"added": 1550059766
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 26,
				"body": "> [quirrel](#comment_30_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Это называется \"меш-сеть\", погуглите Hyperborea.И да, для таких штук нужно быть киберпанком 80-го уровня.Да в этой теме всё как раз и описано, насколько это сложно, даже через радиосвязь.\n\nCJDNS сам по себе настраивается довольно просто. По сути это не сложнее обыного VPN только получается целая оверлейная сеть а не связть точка-точка",
				"added": 1548783962
			}
		],
		"1_1DwNkhvcHoeFoLT6a2A7cQmk1R96cP6goo": [
			{
				"comment_id": 35,
				"body": "Да не уж то вещества/шлюхи ?\n\nНет я конечно не рад торговле наркотой и пр, но кажется, что ZeroNet станет более населённой:-)",
				"added": 1548955185
			}
		],
		"2_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 36,
				"body": "Саратовские сотрудники полиции и ФСБ обнаружили компанию, которая незаконно предоставляла услуги телеграфной связи.  Об этом сообщает Рамблер. Далее: https://news.rambler.ru/crime/41668621/?utm_content=rnews&utm_medium=read_more&utm_source=copylink",
				"added": 1549305167
			},
			{
				"comment_id": 37,
				"body": "> [quirrel](#comment_53_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Пока что спасал. Таки это поделие американцев.\n\nСпасает безусловно.   \n\nСобственно мой посыл простой - ZeroNet ТОЛЬКО через Tor\n\nВ крайнем случае через VPN терминирующуюся на зарубежном сервере",
				"added": 1549356122
			},
			{
				"comment_id": 38,
				"body": "> [anotherneko](#comment_124_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Но причем тут порносайты?\n\nЗаконы России и многих других стран преследуют за \"распространение\" порнографических материалов. Думаю излишни говорить, что p2p сеть ZeroNet делает каждого посетителя такого сайта \"распространителем\"",
				"added": 1549632691
			},
			{
				"comment_id": 39,
				"body": "> [makho](#comment_1_1DYW49c7bJ5xAA5aHMEqWb92xBXtUkUazd): Не подскажешь, как?\n\nЕсть ещё вариант разделить ключ на две части - пароль и например ключевой файл на флешке.\n\nВ случае опасности - флешку уничтожить. Или возможно лучше CD/DVD/Floppy (давно правда не видел) или даже нормальная смарткарта или использовать TPM если удасться включить или купить компьютер в стране где он легален",
				"added": 1549632854
			},
			{
				"comment_id": 40,
				"body": "> [deliriumgoddesss](#comment_27_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): Страна идиотов блять\n\nУвы в России диктатура, притом явно впадающая в маразм",
				"added": 1549632900
			}
		],
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 41,
				"body": "А можно подробности, что за зверь а то у товарища тут одного исследование целое на тему анонимных IM",
				"added": 1549906322
			}
		],
		"3_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": [
			{
				"comment_id": 42,
				"body": "Спасибо, опробую",
				"added": 1550059335
			}
		],
		"3_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 45,
				"body": "> [bvn13](#comment_13_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): Это же общение с устройством внутри закрытой сети. А при чем тут ZeroNet? У него нет сервера, который бы еще и DNS резолвил, нельзя оперативно изменить A запись на этом несуществующем сервере. Или посыл был просто предостеречь тутошнюю аудиторию?\n\n1. НЕ обязательно с устройствами внутри сети\n\n2.  ZeroNet как раз держит web интерфейс на 127.0.0.1\n\nПодсказываю сценарий атаки\n\n1. Создаём в ZeroNet форум или заводим электронную почту\n\n2. Реализуем атаку как описано в статье - создаём или используем уже подконтрольный нам сайт, не важно взломали мы его или его владельцы нам помогают, делаем как описанно.\n\nДалее заставляем броузер пользователя соединится с http://127.0.0.1:43110/.........\n\nИ заставляем локальный экземпляр ZeroNet оставить от имени пользователя комментарий на нашем форуме в ZeroNet или отправить нам письмо в ZeroNet\n\n3. Результат - имеем, для посетителей нашего сайте сопоставление ip  - ZeroNet ID\n\nЕсли атака будет реализована на уровне интернет провайдера - например редиректом с любой http страницы на специально созданную провайдером то провайдер будет знать ZeroNet ID своих клиентов и может их сдать в СБУ/ФСБ/КГБ/КНБ  или что там в Вашей стране\n\nНу а искать комментарии и посты на сайтах в ZeroNet по известному ID уже не проблема",
				"added": 1550137292
			}
		]
	},
	"comment_vote": {
		"1_17kweDjPaMa2tprBHxW6YNizQ44yg7nT5P": 1,
		"1_1CkauEgKWFtvTSAaBn5Ms1MkYTCPPuJRN8": 1,
		"1_13fpFBpPPZWbpy74Jh1kh6LdAVe4JjGkoW": 1,
		"3_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV": 1,
		"2_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV": 1,
		"26_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3": 1,
		"86_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"4_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": 1,
		"26_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": 1,
		"12_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK": 1,
		"17_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"2_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": 1,
		"3_18NuT9sGnLwZvVnH8X77CEZioXUUezXVTw": 1,
		"2_1638vBEtAaRwFQpLUCwSaufp43MT6tbmYG": 1,
		"10_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"9_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"9_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": 1,
		"19_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"1_18cM164fanuGGF4PTG1NvqcmfxMyDEPkLE": 1,
		"95_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"19_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"18_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"1_1B2bJtwCjwokiJCzXSsDPRo8ghTG8YJutc": 1,
		"40_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"75_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"37_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"73_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"72_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"71_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"38_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"111_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"1_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"38_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"30_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"18_1HrCEoWhAu7miP6GCnKhwZhM1VAPibcCRL": 1,
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN": 1,
		"4_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"78_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"3_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"77_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"76_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"42_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"22_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"41_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"20_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"39_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"4_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": 1,
		"21_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"40_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"31_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"40_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"105_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"80_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"106_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"79_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"26_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"107_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"41_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"110_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"42_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"152_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"7_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z": 1,
		"154_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"113_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"43_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"90_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"44_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"91_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"102_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"10_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z": 1,
		"99_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"53_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"44_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"124_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"1_1DYW49c7bJ5xAA5aHMEqWb92xBXtUkUazd": 1,
		"2_1DYW49c7bJ5xAA5aHMEqWb92xBXtUkUazd": 1,
		"45_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"52_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"27_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"88_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"7_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"25_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"3_1DYW49c7bJ5xAA5aHMEqWb92xBXtUkUazd": 1,
		"12_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"5_1Hiwge5zfHLUeGYZeLythYBKt1bN4W5F9z": 1,
		"47_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"32_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"50_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"75_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"1_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ": 1,
		"13_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"78_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1
	}
}