{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 1,
				"body": "I don't think enforced censorship is the answer; have them use their own sites and then just don't mirror them. Makes it somewhat easier for the police to eventually find and isolate them as well, as well as giving potentially more solid evidence against them in case the police seize their computers in a raid.\n\nIt basically serves as a layer of separation. Hopefully that will make them post less of that crap to the normal sites.",
				"added": 1527784552
			},
			{
				"comment_id": 2,
				"body": "I don't think enforced censorship is the answer; have them use their own sites and then just don't mirror them. Makes it somewhat easier for the police to eventually find and isolate them, as well as giving potentially more solid evidence against them in case the police seize their computers in a raid.\n\nIt basically serves as a layer of separation. Hopefully that will make them post less of that crap to the normal sites.",
				"added": 1527784573
			}
		],
		"1527915269_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Well technically Android is a Linux distro so that would make F-Droid a repo for Linux, albeit a very special one.\n\nTo that end there are plenty of Android apps that suffer from censorship from the Google Play Store. Some of which directly compete with Google like F-Droid or NewPipe, some of them Google deem unfit like remote control programs with file streaming for torrent clients, and some of them might get Google in legal trouble like those relying on pirate sites.\n\nAs for desktop distros I think most of them have a strict enough inclusion policy to not be a major target of censorship. I have not explored many third party repos though so there might be something there that I'm missing.",
				"added": 1527937004
			}
		]
	},
	"comment_vote": {
		"91_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	}
}