{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 1,
				"body": "the downside to $12,000 a year in cash is inflation. enjoy having your savings become worthless..",
				"added": 1569449274
			},
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_8_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Inflation is there no matter what in a growing economy. Indexed basic income might solve that. You think that trillion dollar corporate capitalisations don't make your saving worthless?\n\nmy money is in \"trillion dollar corporate capitalisations\".",
				"added": 1569453170
			},
			{
				"comment_id": 3,
				"body": "> KYS\nlmaaoooo",
				"added": 1569457244
			},
			{
				"comment_id": 4,
				"body": "> [anonymouslogin](#comment_11_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): That is certainly one strategy for survival but I think perhaps you are missing my point. Democrats are about transfer payments to cover the liabilities of the society at the cost of the wealthiest 1%. These payments are important. The money made by investing in corporations is a pittance to start with and it goes fast when every service is offered at a substantial markup by the corporations themselves. Here is your paycheck. When your done paying for insurance and medical deductibles you may have 30% left to feed your family. It's mice on a wheel. You have to get off of the wheel.\nYou might be slightly correct if you're alluding to democrats offering free university and healthcare, but the economy at large involves more than those two sectors. In addition to this, the nuance that I think you are missing is that socialized education and healthcare are well-tested in the rest of the world, and in general appear to be successful policy. In contrast, universal basic income is quite literally flooding the money supply, it is a completely different animal.\n\nAnyways not sure what you're saying about the wheel. Yeah, you have to work. The security and services a country provides are paid for by taxing its citizens.",
				"added": 1569473677
			},
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_14_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Economically, taxation is used to discourage a behavior or habit; patriotism in this case.\nwhat",
				"added": 1569545640
			}
		]
	},
	"comment_vote": {
		"216_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	}
}