{
	"next_comment_id": 8,
	"comment": [
		{
			"comment_id": 1,
			"body": "J'aime votre enthousiasme à tous les deux, mais je dois modérer vos ardeurs un peu. Les fichiers de plus de 1MB ne sont pas supportés :\n\nhttps://github.com/HelloZeroNet/ZeroNet/issues/7\nhttps://github.com/HelloZeroNet/ZeroNet/issues/342\n\nJe ne comprends pas très biens les raisons techniques, mais Nofish ne veut pas commencer à régler ces problèmes tant qu'il n'y aura pas de DHT.\n\nCe qui veut dire qu'un site basé sur les vidéos va rapidement frapper un mur de distribution de contenu.\n\nJe suis cinéaste. 90% de mon contenu est vidéo. La solution que j'ai en ce moment est d'héberger les vidéo sur un service Tor caché. Mais pour les voir, il faut bien avoir configuré le proxy Tor et on pert du même coup les avantages de l'aspect BitTorrent de Zéronet. Mais au moins les métadonnées et l'index et l'interface est stoquée dans Zeronet.\n\nVoici un exemple de site que j'ai monté en employant cette solution pour une série vidéo d'un ami : [cherjournal.bloccoq.bit](/cherjournal.bloccoq.bit/)\n\nMes autres sites ne sont pas vraiment prêts pour le moment mais celui-là est dans son état final.",
			"post_id": 21,
			"date_added": 1464216431
		},
		{
			"comment_id": 2,
			"body": "C'est pas que ça va _nécessairement_ pas marcher, c'est que le code est \"fail fast\" quand il y a des time outs dûs à la taille des fichiers. La limite de 1MB est approximative. J'ai demandé plus d'explications sur Github: https://github.com/HelloZeroNet/ZeroNet/issues/7",
			"post_id": 21,
			"date_added": 1464218702
		},
		{
			"comment_id": 3,
			"body": "On ne s'obstine pas avec ses aînés, jeune homme.",
			"post_id": 21,
			"date_added": 1464218988
		},
		{
			"comment_id": 4,
			"body": "Au moins j'en ai une.",
			"post_id": 21,
			"date_added": 1464219353
		},
		{
			"comment_id": 5,
			"body": "Pendant que les enfants se caressent le duvet, les vrais hommes font le sale boulot: https://github.com/HelloZeroNet/ZeroNet/issues/7",
			"post_id": 21,
			"date_added": 1464227304
		},
		{
			"comment_id": 6,
			"body": "Re Tribler: Avec les gros avis de \"notre système ne marche pas très bien\" partout sur leur site ? Non merci, pour moi. Je reste avec Tor.",
			"post_id": 21,
			"date_added": 1464266991
		},
		{
			"comment_id": 7,
			"body": "> [elnormand]: c'est moi qui aura le mot de la fin. \n\nOver my dead body.\n\n> Donc Beuggg.\n\nNon, pas bug. Je vais rester poli. Je te laisse deviner.",
			"post_id": 21,
			"date_added": 1464449508
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}