{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1545931098,
			"title": "ZeroMe \"User not found or muted\"",
			"body": "Hi there,\nMy ZeroMe profile appears to have disapeared as I get to a page simply showing \"User not found or muted\". And it then offer me to create a new profile with the same zeroid. How do I \"re-active\" it and restore my previous content, that should be (at least) still saved locally?\nThanks,",
			"added": 1545931097
		}
	],
	"topic_vote": {
		"1545931098_1CGNmXxGCPcrNgyothjxD7NxgLmpsJWPAr": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1545931098_1CGNmXxGCPcrNgyothjxD7NxgLmpsJWPAr": [
			{
				"comment_id": 1,
				"body": "Well, I don't know in which order they were really synced, but yes, ZeroMe is all synced, so are most of the HUBs (few file failed on some). Could it be that my profile was stored on a hub which has been removed? Since now he asks me to select a new hub? I guess I need to dig my data subdir. If anyone has a few ideas there will be very welcomed. Thanks.",
				"added": 1545987910
			},
			{
				"comment_id": 2,
				"body": "Hum, just to update this thread, rebuilding database on zerome made some changes, got some part of my \"home\" back, no posts, no follower list just the left \"menu\" but it still shows the button \"create profile\" ... little progress. Caught some \"VerifyError: This file is archived! in ContentManager.py line 886\" that I need to understand.",
				"added": 1545990451
			},
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_567_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @clematis There are not much advices, so i add mine, but it may waste your time and not solve ur issue. I add them anyway: [...]\n\nThanks for the tips I am digging into it. If you go to my profile, do you actually see some old posts? or is it also \"empty\" saying no post:\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1CGNmXxGCPcrNgyothjxD7NxgLmpsJWPAr",
				"added": 1546708772
			},
			{
				"comment_id": 4,
				"body": "@ssdifnskdjfnsdjk , but the db rebuild didn't work  - profile appears to exist (since it shows my info box) just no posts. I might try to just backup my identity then re-start everything from scratch. See how that sync-up.",
				"added": 1546708967
			}
		]
	},
	"comment_vote": {
		"567_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"3_1CGNmXxGCPcrNgyothjxD7NxgLmpsJWPAr": 1
	}
}