{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 10,
	"comment": {
		"3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": [
			{
				"comment_id": 1,
				"body": "#Como ter seu próprio Pirate Bay\n\n- https://swarm-gateways.net/bzz:/199bf87c9af2bc17eefaede81cc81917e7829a59aaf0f1d15bf56a175cd6503c/Como+ter+seu+próprio+Pirate+Bay+2015-86JD4JrRvbQ.mp4 ( Fonte: https://invidio.us/86JD4JrRvbQ )\n\n- Tutorial: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1KWvbD6tvrieLacVBNbELNthwgNrAZ48v_0\n\n#Open Bay: \n- https://github.com/isohuntto/openbay.git\n- https://swarm-gateways.net/bzz:/fe97108491631b7788d075d3adec92897dc2e67b7615b0a9bbab3b5b51733dfd/openbay-master.zip\n\n",
				"added": 1586816734
			},
			{
				"comment_id": 2,
				"body": "#Como criar seu próprio The Pirate Bay\n\nEm princípio, mostraremos como fazer isso no host local . Ou seja, vamos instalá-lo de forma que somente possamos acessá-lo , inclusive quando não estamos conectados à Internet. Isso ocorre porque, se quisermos publicá-lo na rede, teremos que cuidar de um pagamento mensal.\n\n- Antes de tudo, precisamos ter o [Xampp](https://www.apachefriends.org/pt_br/index.html) instalado. No momento, já explicamos como configurar seu próprio servidor, graças ao Xampp .\n\n- Teremos que [baixar um script](https://swarm-gateways.net/bzz:/fe97108491631b7788d075d3adec92897dc2e67b7615b0a9bbab3b5b51733dfd/openbay-master.zip) que será responsável pela execução do The Pirate Bay em nosso servidor.\n\n- Descompacte-o no caminho chamado htdocs dentro da pasta Xampp. Por exemplo, eu tenho o Xampp instalado em C: xampp, então descompactarei o arquivo baixado em C: xampphtdocs. Devemos descompactá-lo no diretório principal – ou seja, no htdocs – porque se não funcionar, embora se você conhece servidores ou páginas da Web, você pode adaptá-lo.\n\n- Agora vamos ao navegador e abrimos o endereço da web: http://127.0.0.1/ , onde é o nosso script que foi instalado e executado .\n\n- A instalação em si começa; para isso, primeiro escolhemos o nome que queremos dar ao site, escolhemos The Root Bay .\n\n- Além disso, devemos escolher configurar o banco de dados manualmente. Um formulário será exibido automaticamente e teremos que preenchê-lo com os dados no banco de dados. Por padrão, o nome de usuário e a senha do banco de dados Xampp são raiz . O host é 127.0.0.1.\n\n- Clique no botão Implementar .\n\n- Abrimos o diretório do banco de dados com o endereço http://127.0.0.1/phpmyadmin/index.php.\n\n- Faça o download do [torrent](https://swarm-gateways.net/bzz:/108482ea8dfa804977f89fdd411da89b46720b11556ee80316a4808d80357820/openbay-db-dump.torrent) . E com o torrent, baixe os bancos de dados – [qBittorrent](https://www.qbittorrent.org/) ou outro programa é necessário para esta etapa. Baixe o torrent do banco de dados. O torrent deve abrir com o qBittorrent ou com outro programa similar. O que acontecerá é que as tabelas em que as informações no banco de dados estão armazenadas serão baixadas.\n\n- Importe as tabelas do banco de dados.\n\n- Pronto!\n\n#Lembre-se de que você pode seguir os mesmos passos e comprar uma hospedagem para carregá-la na Internet e para que mais pessoas possam entrar.\n\n- Referência: https://web.archive.org/web/20200413223502/https://aprendafazer.net/como-criar-seu-proprio-the-pirate-bay/",
				"added": 1586817266
			},
			{
				"comment_id": 3,
				"body": "#Lista atualizada de rastreadores BitTorrent públicos\n- https://github.com/ngosang/trackerslist.git",
				"added": 1586818677
			},
			{
				"comment_id": 4,
				"body": "#newTrackon, uma ferramenta pública de monitoramento de rastreadores BitTorrent aberta\n\n- https://newtrackon.com/\n- https://github.com/CorralPeltzer/newTrackon.git",
				"added": 1586818776
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 5,
				"body": "#Como não escrever sobre história da física: um manifesto historiográfico. MARTINS, Roberto de Andrade.\n- https://web.archive.org/web/20160303230547/http://www.sbfisica.org.br/rbef/pdf/v23_113.pdf",
				"added": 1586819344
			}
		],
		"3_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": [
			{
				"comment_id": 6,
				"body": "#Redes Anônimas/Descentralizadas: Twister \n- Vídeo: https://swarm-gateways.net/bzz:/8b8886c9ed2985d611bf1eea8f3e0796ed7200c5f33fac65f6ea485ad0271eb4/Descentralizadas:+Twister-Ab1O_Jwv02A.mp4\n- Download do Tutorial: https://swarm-gateways.net/bzz:/6fdcd6b0ce2b335da8a1e53c2288d579c19ebb6851b820fee326d23ff01edaf0/Redes_da_Deep_Web-Twister.pdf",
				"added": 1586820412
			}
		],
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": [
			{
				"comment_id": 7,
				"body": "#MysteriumVPN\n- https://mysterium.network/\n- https://github.com/mysteriumnetwork\n\nO MysteriumVPN é alimentado por uma infraestrutura VPN descentralizada, construída com arquitetura P2P, com foco na mais alta privacidade e anonimato, usando criptografia poderosa, mecanismos de reputação e protocolos de proteção em camadas.",
				"added": 1586822646
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 8,
				"body": "#Radiação de baixa frequência e possível influência nociva a sistemas biológicos\n\n- https://web.archive.org/web/20200414010533/http://www.scielo.br/pdf/rbef/v41n3/1806-9126-RBEF-41-3-e20180289.pdf\n\nNeste trabalho apresenta-se um estudo teórico que mostra a influência de radiações de baixa frequência, principalmente as provenientes de dispositivos celulares ou Smartphones, e os possíveis danos associados a doenças que esse tipo de radiação pode causar. Indica-se o aumento da produção de espécies reativas de oxigênio que a radiação não ionizante pode gerar a sistemas biológicos. Esse tipo de radiação pode ocasionar variação na bioatividade, podendo ser considerada um agente externo potencialmente nocivo às pessoas.",
				"added": 1586828223
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "#A Nova Super Máquina : O Filme\n\n- https://swarm-gateways.net/bzz:/f6a5605c7fec37cae9a3d3f0b5bc8b157ec94daf18922e29dd4de5a26f9181e2/Knight_Rider.mp4\n\nEm 2008 foi criada uma nova série como o mesmo nome original com novos atores, mais no Brasil a série ficou conhecida como “A Nova Super Máquina” e em Portugal como “O Novo Justiceiro”.A série se iniciou em setembro de 1982 e se encerrou em maio de 1986, totalizando 4 temporadas e 84 episódios produzidos.Sua primeira exibição no Brasil foi na TV Record, e em Portugal estreou na RTP. Estrelada por David Hasselhoff (como Michael Knight, um tipo de cavaleiro medieval mas nos dias atuais, que dirigia um carro com avançada tecnologia e personalidade própria, ganha a partir do desenvolvimento de uma inteligência artifical).",
				"added": 1586832318
			}
		]
	},
	"comment_vote": {}
}