{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1578066338,
			"title": "A doctor on Zeronet!",
			"body": "I created a new zite for medical questions...feel free to use it if necessary! (i think this is the first service of this type on zeronet)\n\nhttp://127.0.0.1:43110/167UYZou7mTp3gCBEbrUSLMuEVjToc6G5t/",
			"added": 1578066337
		}
	],
	"topic_vote": {
		"1577708242_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1577650907_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "You should ask your doctor to reset your antidepressant therapy...probably the dosage or the drug that you're assuming is no longer the right one (you begin to take it in 2018, maybe during 2 years you brain changed and because of this you must change the therapy or the dosage). Probably is a problem that the specialist can fix easily :)\n\nAnyway i suggest you to don't take any action without asking your doctor.. a rapid interrumption of antidepressand therapy can have serious side effect! \n\nI see that many people in that platform ask for medical advices. I'm a doctor in my real life and i'm asking if i can be useful here. Surely here i can't give specific medical advices (for example drug prescriptions) because behind a monitor i can't visit the patient... but maybe i can help people that want to talk with someone but for any reason can't in other way (blame, no trust, censor, etc...) or want generic informations about a disease, a drug or about asking a specialist. Can be a good idea if i wil open a specific zerotalk? This probably will be the first medical service on zeronet! (not different from others similar in clearweb and darknets)",
				"added": 1577701337
			}
		],
		"1578066338_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": [
			{
				"comment_id": 2,
				"body": "> [1bfqutudhtexlka](#comment_141_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): how we know you are a real doctor ?\n\nvery soon i want to open a zite with my complete curriculum",
				"added": 1578175429
			},
			{
				"comment_id": 3,
				"body": "> [zenanon](#comment_50_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Great service, kudos!. Are you what some call a \"general practitioner\" or do you have a certain specialty?\n\nnow i'm doing the \"GP\"...but i'm a nuclear physician",
				"added": 1578175763
			}
		],
		"1578817237_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 4,
				"body": "Taenia eggs can be easily eradicated by cooking or freezing the meat and the diagnosis can be easily done with a microscope or by observing parasite in feces (but often the illnesss don't give any symptom). Systemic cistercosis occurs when a patient eat food contaminated by eggs (from its feces) and are very frequent in HIV+ patients. The illness can be easily cured by using some specific drugs or by surgery if they don't work.\n\nPlease, do not make unnecessary alarmism.  Fasting and changing internal pH are useless against taenia!",
				"added": 1578851229
			},
			{
				"comment_id": 5,
				"body": "> [hferbwauif](#comment_65_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): How do you know the parasites come from pork and not from food or water contaminated with feces from someone infected by them? (who could've initially gotten it in another country, or from slaughtering and cooking their own animals)\n\nthis parasite come always from pork meat because the pig is the intermediate host of the tapeworm",
				"added": 1578851313
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 6,
				"body": "following the newspapers i read that the virus make some dozen death at now...very few compared to SARS and Swine flu... but why the Chinese Governament is blocking millions of people this time? These data are real or the numbers are far more bigger?  there are other things hidden?",
				"added": 1579969394
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 7,
				"body": "I'm a nuclear medicine physician.  i follow decentralized networks from early 2000 when i was 20 and i knew about decentralized websites by p2p forums. The first project of this type that i followed was osiris - serverless portal system, but its development was stopped in 2011. Now i hope with ZeroNet to rebuild a real internet based on people instead of profit,  filter bubbles, shadow bans and censored social network... a place where everyone can talk freely and where cooperation exist instead competition, as in file sharing P2P networks and as it was in the early internet created by academics. I hope also that decentralized websites will help research by creating a new \"peer-revew\" based on P2P network instead the centralized scientific journals, that close literature access to the public, dictate what should be published and what not using marketing criteria and hinder data sharing from researchers posing one against each others for funding.\n\nHere i manage a seedbox and a proxy for clearnet under the name of \"zeroseed\" to help to reach these objectives by increasing the numbers of nodes in the network and allow big files sharing and HD streaming on IFS (i created this second account to by-pass the limit on zerotalk)",
				"added": 1584777036
			}
		]
	},
	"comment_vote": {}
}