{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1565811747_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 1,
				"body": ">loves slavs like Putin. \nEver heard of the White Army? Remember that Bolshevism was a Jewish lead movement. The Slavic peoples of eastern Europe were victims. Many degenerated in the presence of heavy Marxism and the destruction of their culture and history, but that's also proving true of youths in western countries as well.\n\n>primarily because jews and slavs are simply not human. \nAdolf himself would have scolded you for claiming either of these things. The Slav is not our enemy. No more brother wars.\n\n> [russianspy](#comment_4_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): The nazis wern't socialists.\nThey weren't MARXISTS, but they were very much socialists. Read Mein Kampf. In the first volume, in one of the first 3 or 4 chapters, the German war hero defines what true socialism is and claims that the Party represents it. The whole reason for taking on the mantle of socialism was to demonstrate that Marx was a fraud and that his ideological offspring are fighting against the working man. A large part of the reasoning for including red and black in the party's flag was to challenge the red and black flags that the Marxist revolutionaries carried. He was saying, \"Hey reds... You think you have a monopoly on the working man? Well eat shit, we're going to recruit them out from under your beaked noses! We DARE you to try to stop us!\"\n\n> [russianspy](#comment_5_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): A. Neo Nazis outright, such as the case of 8ch/pol/, or are closeted Nazis;\nYou've been listening to too much MSNBC. Mingle with people that actually claim to be alt-right and you'll see that they're mostly a bunch of civnats and conservatives that happen to have particular disdain for political correctness. Yeah there are some identitarians and such in the mix, but when it comes to things like race-mixing and sexuality, most of them aren't even close to traditional... Do you really think its appropriate to call someone that uses Tinder a National Socialist? Do you think they would have allowed Tinder in Germany?",
				"added": 1565815293
			},
			{
				"comment_id": 2,
				"body": "> [russianspy](#comment_6_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): The only reason hitler took up the name of socialism was to influence radicals at the time who probably didn't know better.\n\nYou really aught to read Mein Kampf... I think you might enjoy it, actually. I know what you're saying and I don't contest the Marxian definition as being commonplace. However National Socialism WAS a working class movement. One of the big differences was the different premises: Race/Nation Conflict rather than mere Class Conflict.",
				"added": 1565827677
			},
			{
				"comment_id": 3,
				"body": "> [dfgdsfgertyrety4](#comment_6_1FB7wEXbNVmiRnVw9JSCnibwrhYVK4uFaP):  The right wing wants the least amount of government possible aka the 'leave me the fuck alone' policy.\nSorry dude, but that's not the established left-right paradigm. This is why libertarians complain about left/right being poor descriptive language and start posting graphs and compasses.\n\n> [wejehteman2](#comment_17_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): Alt right is just anyone who is a nationalist and willing to engage in identity politics on behalf of white people and white interests.\nLiterally not what 80% of people who identify as \"alt-right\" are.",
				"added": 1565830084
			},
			{
				"comment_id": 4,
				"body": "> [memesadler](#comment_60_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): What subversive faggot lolberg is identifying alt-right and claiming it's not about white identity?\nThe ones on Facebook and offline.\n\n> [aspidochelone](#comment_62_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The real Nazis were just dogs in uniform, doing as their master commanded.\nLiterally the opposite. Read some German literature from the era. Why do you guys insist that your enemies are inhuman instead of just accepting that they have a different set of beliefs and ideals?\n\n> [aspidochelone](#comment_62_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):  SPECIES is what matters. \nI agree. Now define species. There are many animals that are visually indistinguishable, yet classified as different species. Meanwhile there are a multitude of varieties of humans and we're supposed to classify them all as one specie, despite some groups only vaguely resembling each other? Does that make sense to you?",
				"added": 1565831740
			},
			{
				"comment_id": 5,
				"body": "> [wejehteman2](#comment_18_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): Its because we can breed with them and have offspring that are just as fertile as the parents. \nThat's not the only defining factor as there are plenty of species of animals that can indeed produce fertile mixed offspring, but disregarding that, even the assumption regarding fertility of mixed children is not necessarily the case... Look up something called outbreeding. It applies to humans too. I lean more toward us belonging to the same genus rather than species.\nhttps://www.sciencedaily.com/releases/2016/08/160818212907.htm\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5465464/\nhttps://www.eurekalert.org/pub_releases/2008-10/sumc-acf092508.php\nhttps://www.womenshealthmag.com/health/a23320626/infertility-race-survey/\nI reference this article because many African Americans have recent, mixed ancestry, which I suspect is a persistent contributing factor to their heightened infertility.\nhttp://sociobiologicalmusings.blogspot.com/2011/10/problems-with-mixed-race-marriages-and.html\n\nI hope that one day politics will permit us to properly study this area of biology again.\n\n> [wejehteman2](#comment_18_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): Those species that look identical but are different species, they are different enough below the surface that they can't do that.\nAlso not necessarily true... Even the offspring of lions and tigers can potentially be fertile. Not that it's common, but where do we draw the line? Should we consider them the same species so long as at least half of the offspring are viable? How different do two types of humans have to be before we can label them as such?\n\n> [wejehteman2](#comment_18_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): Also the reason they look so similar is they are a different species. Among their own species the differences are obvious to them.\nI totally agree with the above statement. Now consider the following:\nhttps://www.youtube.com/watch?v=8s7FdYGwFeQ\nWhy would Samuel L. Jackson fly into a rage, yelling that \"all black people do not look alike\" unless that's a common thing that people say? Sufficiently distant races view each other as \"all looking the same.\" Blacks look at whites that way, Chinese look at blacks that way, whites look at both blacks and most asians that way, certain asian groups look at whites that way, and I'm pretty sure everybody looks at Australian Aboriginals that way. It's only when you spend a lot of time around that \"other\" group that you develop the ability to start distinguishing them apart... Your brain is naturally recognizing and emphasizing the other group's otherness. Why would your brain be telling you that if it wasn't important?\n\n> [wejehteman2](#comment_18_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): And also I would point out that all dogs are still dogs but think about the amount of polymorphism in dogs.\nAll dogs are dogs, but not all breeds of dogs can naturally mix. Even if they could, not all of them would, and that's important. The reproductive barrier between races is more than just social. Left to our own devices, only a small fraction of any race would willingly interbreed with another, especially with the intent of starting a family. That's a big part of why we have different races at all. There's an instinctive drive not to mix. I don't think that would be present if we were the same species.\n\n> [memesadler](#comment_65_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Nobody takes issue with the Irish or Scottish. Even in America, we had early Irish presidents. \nI get the feeling that these guys hate religion so much that they're even blind to history relating to it... Around the time of the American Revolution, the conflict between Irish/Scots and Brits was religious in nature. Ireland and Scotland were Roman Catholic, whereas England was Protestant. To them the Reformation was what World War 2 is to us. The stigma against Scots/Irish was because Protestants felt about Catholics the same way that Marxists feel about Nazis.\n\n> [memesadler](#comment_65_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I personally find that the most beautiful interracial couple is a black man and a jewish woman.\nIt always warms my heart.",
				"added": 1565877710
			}
		],
		"1565855060_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 6,
				"body": "Bottom right of the page. \"Forked from Zeronet\"",
				"added": 1565878332
			}
		],
		"1565940672_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 7,
				"body": "> [bober](#comment_40_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): if white supremacy is real how come chocolate ice cream tastes so good?\n\nWhite Supreme tastes pretty good too. Even better than regular vanilla, IMO.",
				"added": 1565978829
			}
		],
		"1565927048_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 8,
				"body": ">hmmmm",
				"added": 1565978964
			},
			{
				"comment_id": 9,
				"body": "Wait... Is this what you did\n &gt; ?",
				"added": 1565979064
			}
		],
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 10,
				"body": "This should \\n \\n\nbe sticked\n\\> for great justice",
				"added": 1565979313
			},
			{
				"comment_id": 11,
				"body": "Testing new line\n\\n \\n Something tells me this won't work.",
				"added": 1565979396
			}
		]
	},
	"comment_vote": {
		"57_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"114_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"21_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1
	}
}