{
	"next_topic_id": 22,
	"topic": [
		{
			"topic_id": 1565565971,
			"title": "test",
			"body": "test",
			"added": 1565565970
		},
		{
			"topic_id": 1565570944,
			"title": "I frankly don't know what to make of this (ZeroNet)...",
			"body": "It's actually (apparently) running, right now, so that already is more than MaidSafe/SAFE Network has ever done... it seems like perpetual vaporware... But still, ZeroNet has a very confusing \"account/id\" system, and the overall \"GUI\" has me scratching my head. I want this to be great, but frankly, \"confusing\" is the best word I can use to describe it. And why does it piggyback on the default browser instead of using its own, secured, dedicated GUI/browser \"engine\"?",
			"added": 1565570942
		},
		{
			"topic_id": 1565575485,
			"title": "Testing the POST request...",
			"body": "Testing the POST request...",
			"added": 1565575482
		},
		{
			"topic_id": 1565575545,
			"title": "abc",
			"body": "123",
			"added": 1565575541
		},
		{
			"topic_id": 1565575614,
			"title": "How are these topics being created technically?",
			"body": "I've opened the F12 menu with the network tab in Waterfox and I load this page and press \"Add new topic\" and it adds the topic but no POST request (in fact, no request whatsoever) is made? How is that possible? What kind of black magic is this?",
			"added": 1565575609
		},
		{
			"topic_id": 1565627986,
			"title": "My main questions about ZeroNet right now.",
			"body": "1. What exactly am I supposed to hold on to? A single private key for ZeroNet? Where is it stored on my system? Will this single private key file be the one and only thing that I need to keep secure and backup in regards to not losing control of my \"ZeroNet account\" and any \"Zero sites\" I create?\n\n2. Is ZeroNet \"released\" already, or is this some sort of \"early testing phase\"? Can I start right now to attempt to get people to use my \"Zero site\", or is this for testing only, and all content on the network will be reset for the \"stable release\"?\n\n3. How exactly is data stored? It just flies around nodes like little encrypted chunks, all stored in RAM/network, hoping that all nodes will never go down at once? How does ZeroNet get around the need for \"vaults\" (people running dedicated storage servers and getting paid for it with a special cryptocurrency)?\n\n4. Is it possible for me to, right now, make a \"Zero site\" which nobody can modify or add content to or do anything to, and I am the only one who can add/modify/delete it?\n\n5. When making a Zero site, it seems like it's a requirement for me to display the full \"source code\" (HTML, CSS and some sort of \"enhanced JavaScript\"?), because there is no server where PHP or whatever can execute. This makes sense, and is like SAFE Network, but nothing stops me from having a PHP script on my computer which, for example, adds content to my site in an automated fashion, or pulls new data from my site (which is set to only be visible by me) for processing locally... right? If so, is it easy to interact with ZeroNet from PHP? Must a ZeroNet node be running on the same computer? Is there some sort of minimal \"server edition\" of ZeroNet which can be (and maybe has already been) vetted? (It's scary running \"sketchy\"/new software on my machine.)\n\n6. Assuming that I've sorted out all the above, how would I make my new \"Zero site\" known? Since the Internet (clearnet) is the way it is these days, all opportunities for advertising something have long since disappeared. Is there some sort of way that I could get legitimate attention to my Zero site on Zeronet itself? Like in that \"main menu\" thing which I'm using right now to post this? Is there some sort of \"discovery system\" in place for people to actually find my stuff? And if so, won't it quickly be flooded with garbage, making it impossible to find my site nevertheless? Do you need to pay with \"Zerocoins\"? If so, how do you get those?\n\n7. Is really nobody moderating this thing (\"ZeroTalk\")? If that's the case, the quality of the posts is surprisingly high...\n\nThanks in advance for the replies. These are the most pressing questions for me right now, but I'm sure I will think of many more...",
			"added": 1565627980
		},
		{
			"topic_id": 1565629267,
			"title": "Couple more questions about ZeroNet after reading the zeronet.io site...",
			"body": "\"Anonymity\nYou can easily hide your IP address using the Tor network.\"\n\n\"Can\"? Not by default/built in? Does it mean that my IP address is actually broadcast when making requests on ZeroNet? Please tell me I'm misunderstanding this...\n\n\"Fast\nPage response time is not limited by your connection speed.\"\n\nHow is this technically possible?",
			"added": 1565629260
		},
		{
			"topic_id": 1565647351,
			"title": "Can you use Tor Browser?",
			"body": "I tried to open my Tor Browser and going to http://127.0.0.1:43110/ , but I just get: \"Unable to connect\"... I expected it to work but maybe have some issues with WebSocket or whatever... but it doesn't work at all. That's strange.",
			"added": 1565647343
		},
		{
			"topic_id": 1565658736,
			"title": "Is anything wrong about this? Is my understanding of ZeroNet correct?",
			"body": "1. Joe downloads the ZeroNet binaries from zeronet.io on his computer and runs it. It opens up his normal Firefox with the ZeroNet main interface.\n\n2. Joe selects \"Create new, empty site\" from the little menu, and starts editing the files in the right folder to create a basic HTML page which says \"Welcome to Joe's ZeroSite! Leave your comments below:\" and below is a simple textarea with a \"Submit\" button next to it.\n\n3. Joe uses JavaScript and the ZeroNet library/interface thing to make it so that anything that is typed into the form is submitted not for display on that page, but as a text which only Joe can see. (Not displayed even to him on that page, though.)\n\n4. Joe does the step to \"announce\" the site and also mentions it on ZeroTalk, to get some initial visitors.\n\n5. Joe goes to bed, shutting down his PC as always.\n\n6. 24 hours later, Joe comes back, starts ZeroNet and has now coded a local PHP (or anything that runs on his computer, unrelated to ZeroNet) script which can talk to ZeroNet on the same computer. He makes the script fetch all the comments submitted while he was gone, moderates them (rejects or accepts) in his custom-made, self-coded, private management system. If they are accepted, Joe's system bakes a new static HTML webpage which is identical to the original one, with the message and the form, but also containing the accepted post as HTML. Maybe he moderates and accepts 10 comments before pressing \"announce\", which makes his system tell ZeroNet to publish the changes.\n\n7. Now, anyone who loads Joe's page sees the accepted comments, and they can submit new ones and Joe will see them as soon as he comes back from sleep and can moderate them locally in his special system, just like before.\n\n8. Encouraged by how fantastic this is, Joe proceeds to build in more and more advanced and intricate logic into his local PHP system. It soon becomes a popular ZeroNet site, and the only \"source code\" that can be seen by visitors is the client-side stuff, which was always the case even on clearnet.\n\nIs there something about this which doesn't make sense? If so, which point? And what about it doesn't make sense?\n\nWhat I don't understand yet is how long Joe can wait before coming back online, before his page can no longer be accessed while he's offline, and what kind of limit there is on the number of comments he can receive. What if one million people send messages, causing many megabytes of data to just \"live in the ether\" until Joe finally comes back on? Seems like this would be ripe for abuse... to cripple the network with garbage traffic/data. But at the same time, there must be a longer \"grace period\" since nobody can be expected to be online all the time and servers are very problematic for a number of reasons (whether at home or in a data center)...\n\nImportant: Please don't reply if you haven't read the above. It will save us all a lot of time and energy. I'm saying this because my previous thread was ruined by somebody who did not read before replying, and I hope to avoid this by clarifying that PHP (or whatever -- I'm just using PHP as an example because I happen to use that as my programming language) is only running on Joe's computer. (But then again, if somebody didn't read the above, why would they read this last part?)",
			"added": 1565658726
		},
		{
			"topic_id": 1565729654,
			"title": "Confused about something said in that \"Zero guide\"...",
			"body": "\"One more word about trackers. You need a static IP or Tor connection to share zites with other peers if these peers don't accept your zite update (for example, they don't have this zite at all).\"\n\nWhile this \"Zero guide\" contains a lot of valuable information, the author uses *very* questionable wording in a lot of places, needlessly confusing the reader. The stuff I just quoted is just gibberish to me. I have literally no idea what he's talking about. Do you?\n\nSource: http://127.0.0.1:43110/1Kt7xxVRcxHcK14Mt7YZdXfh8MzUJMkvpk/misc/The.truth.about.ZeroNet/3.%20cloning%20zites.txt",
			"added": 1565729643
		},
		{
			"topic_id": 1565734523,
			"title": "Is there some way to reach interested visitors other than them actively knowing about and going to my URL?",
			"body": "Let's say that somebody finds my Zite and they want to essentially \"sign up for news on this\". Maybe 0.00001% of people would think to use my RSS feed (and keep it around). Some might bookmark it and check back manually regularly (and eventually get bored). Most would in practice want to essentially \"enter their e-mail address to get notifications\". But there's no \"e-mail\" on ZeroNet that I know of (built in), and the clearnet e-mail has been made worthless (long story).\n\nIs there some way for a visitor to actively \"subscribe to notifications\" from me, so that I can at any later point (unless they muted or removed their \"subscription\") \"push my message\" to them, for example: \"Hi! We finally have launched XYZ! I hope you're still interested! If so, go to: ...\" ?\n\nOf course, the first time this is abused to send unwanted messages, they would just mute/block the sender, with one button, so there is no risk involved for the user. Every e-mail client I've ever seen makes it insanely difficult or impossible to set up any kind of real \"block\"/blackhole thing, and that's without a doubt per design to take away control from the dumb consumer sheep. However, ZeroNet I would expect to be on the user's side, forcing the sites that want to send such messages to not abuse the trust, or they'll immediately get silenced by the user and never be able to reach them again.\n\nDoesn't this seem reasonable? But of course, if ZeroNet takes off, evil powers will be making all kinds of evil changes to the UI to suit the evil scumbags who treat every surfer as an entity from which to extract the most amount of money and private data...",
			"added": 1565734511
		},
		{
			"topic_id": 1565795636,
			"title": "My impressions of ZeroNet so far:",
			"body": "Positives:\n\n1. It actually exists and can be used right now, unlike SAFE Network and their perpetual vaporware bullshit. (I'm now convinced that they will never deliver anything before the end of time.)\n\n2. Although it took a lot of asking, reading and thinking, the overall structure makes a lot of sense to me now, even though I don't like the reliance on Tor for privacy; it should always be built in and never seen as an \"add-on for those who want it\".\n\n3. No damn domain registrars, server hosts forcing me to send them photo ids, registration forms, CAPTCHAs, \"phone verification\" bullshit, IP address reputation nonsense (yet...), etc... But these points are maybe \"too obvious\" since they are the whole point of ZeroNet existing...\n\nNegatives:\n\n1. The default interface is very technical yet flashy at the same time. I would have preferred a much more \"toned down\" and elegant/minimal interface, simply saying a few carefully worded paragraphs about what ZeroNet is and how to use it on a fundamental level. But maybe this interface will only be like this in the beginning? Still, whoever controls it really has a ton of power and especially *will have* as ZeroNet (hopefully) grows a lot.\n\n2. Relying on Namecoin for domains might make sense, but it also introduces yet another thing that the users must learn about. As I understand it, Namecoin \"support\" isn't built in? You have to actually run Namecoin's own client to be able to visit .bit domains? Or is that just for *creating*/managing them?\n\n3. The lack of sensible documentation. Just like with SAFE, even though I've a lot of experience with programming in general, and even JavaScript/HTML/CSS in particular, I find it very confusing as to how to get started with the API and whatnot. Granted, I haven't invested *that* much time and energy in it so far, because I'm still trying to get comfortable with ZeroNet existing at all, but still, I find that the same problem applies here; even though ZeroNet is much more logical and straight-forward (one might say \"less wrapped in bullshit\") than SAFE, the concepts are still not communicated anywhere near as clearly as I would expect and want them. I do unfortunately get the feeling that there is that same old arrogant attitude among \"geeks\" that \"it's good if it's not too easy, because then it will weed out the worst morons\". This might be true to some extent, but it also weeds out people who simply don't have the time and energy to sit around forever aimlessly searching and asking for every bit of information. My skin always starts crawling when I notice that a project or person appears to be leaving out crucial little bits of information in instructions/explanations because \"it's too obvious\" or \"they will have to go through some pain since I took the time to write this for them\"... Oftentimes, those \"little pieces\" cause me endless grief and frustration, usually resulting in me losing all interest in whatever the text was about.\n\n4. The reliance on the default browser. There are no non-sucky browsers left, and as such, privacy and security are completely thrown out of the window. I have not managed to figure out how to use the Tor Browser with ZeroNet, which should \"just work\"...\n\n5. Just like with SAFE, ZeroNet still has centralized parts: the official website on clearnet, the \"main interface\" thing, the source code repository, etc. What happens when the developers are blackmailed/extorted to start adding manual blocks of Zites, or they themselves realize that they hate certain Zites (which I would quickly do myself)? Basically, how reliable is the concept of ZeroNet? Right now, I have no idea. All the developers are mysterious unknown people to me, I have no grasp of how big this thing is, how big it can reasonably become, what's being done in practical terms to make that happen, what the \"roadmap\" looks like, etc. It seems like ZeroNet just started existing one day and is sponsored by some \"cloud provider\" which appears to be in direct competition to the entire concept of P2P, decentralized networks...",
			"added": 1565795623
		},
		{
			"topic_id": 1565811143,
			"title": "Are muted users notified about this?",
			"body": "I've been forced to mute a number of accounts already (maybe it's the same guy constantly getting new ones) because all they ever reply with is things like \"You are so DUMB.\" or \"Why would you want ZeroNet to grow? Go home, boomer.\" or similar nonsensical insult, always ignoring whatever the topic is actually about.\n\nWhen I mute them, are they notified in any way about this? Like, a \"X just muted you.\" notification or something? If not, can they find out in any way?\n\nEven though it probably would become very annoying, it would at least be *interesting* if, when somebody is muted, they get notified about this, who did it, and on which \"resource\"/page it happened. In the optimal scenario, the muted user would then at least know why people are muting them, and possibly better themselves. (But in practice, it would likely be very annoying and depressing for a lot of people.)\n\nIf such a feature is created, at least have a \"don't display these kinds of notifications\" button with each notification, and make it clear that this \"signal\" is sent when the \"mute\" feature is used.",
			"added": 1565811129
		},
		{
			"topic_id": 1565885910,
			"title": "When you mute retards on here, it should default to \"full mute\"...",
			"body": "When you mute the countless morons who post garbage here, you have to wait for an animation and click yet again to actually mute them. Otherwise, you just \"mute\" a specific post. What's the point of that?",
			"added": 1565885894
		},
		{
			"topic_id": 1565886025,
			"title": "Request: PHP ZeroNet library.",
			"body": "My fingers are itching to start developing Zites. However, since they will heavily depend on local processing, and I happen to be using the widely known general-purpose programming/scripting language PHP, which BTW runs on the command line and doesn't need a webserver whatsoever, a lot of my interaction with ZeroNet will be not from JavaScripts on the HTML pages served to visitors (or myself), but rather from my computer running PHP CLI.\n\nAnd since ZeroNet uses \"WebSockets\", this is not super-straight-forward. I currently don't know how I would make the connection to the local ZeroNet software, in order to be able to talk to the API. I'm sure I'm not the only one.\n\nIs anyone working on a nice, robust PHP library for easy communication with ZeroNet? Remember: anything we can do to make it easier to use ZeroNet is a good thing if you want people to use it. I guess I could attempt to use some existing mess of a library for general WebSockets use, and then try to figure out how exactly ZeroNet communicates using these, but that will take me a very long time and exhaust me. Therefore, I'm asking about/requesting a specific, preferably official, ZeroNet library in PHP. Bonus points if it gets/has a procedural interface.",
			"added": 1565886008
		},
		{
			"topic_id": 1565886154,
			"title": "Bug: Each topic tab gets \"ZeroTalk - ZeroNet\" as the title unless you reload the page.",
			"body": "1. Pick any topic. Middle-click it to open a new tab.\n2. Go to the new tab.\n3. It has the title \"ZeroTalk - ZeroNet\".\n4. Press F5.\n5. It now has the actual title.\n\n(At least happens in Firefox/Waterfox.)",
			"added": 1565886136
		},
		{
			"topic_id": 1565889331,
			"title": "Is ZeroTalk the most \"official\" place to ask ZeroNet questions?",
			"body": "I must say that initially, it seemed to have quite a few helpful and nice people, but I'm being forced to reconsider my first impressions as I get an alarming percentage of incredibly rude and hostile replies from arrogant cunts, who then have to be muted, which is not something I want to do as it doesn't actually block them for anyone else (to the best of my knowledge). It would be useful if muting people blocked them from replying to any post/resource that you created/initiated.\n\nIf this is how you treat excited new users, expect ZeroNet to remain obscure forever. (Which apparently is exactly what those users want...)",
			"added": 1565889312
		},
		{
			"topic_id": 1565889704,
			"title": "What's with \"Please install the PeerMessage plugin.\"?",
			"body": "When you try to register a new account on here, you apparently can only choose \"KxoNetwork\". When you go to their site, which is a confusing mess, it says with a bright red background: \"Please install the PeerMessage plugin. You can download and install it from the Plugin Store\"\nI don't wanna install any damn \"plugins\". What's this all about? This didn't happen a few days ago...",
			"added": 1565889684
		},
		{
			"topic_id": 1565908709,
			"title": "I'm leaving ZeroNet.",
			"body": "You don't want ZeroNet to be a success or grow in any way.\n\nThis place is a cesspool of cancer. Rude, hostile cunts are the only ones replying with few exceptions.\n\nYou don't even have a fucking PHP library to communicate with ZeroNet (or libraries/bindings for other popular languages). There's zero documentation and no \"roadmap\" and you have to actively pull out every little piece of information.\n\nIt's obvious to me that this will never go anywhere, in spite of actually being launched. You are like the opposite of SAFE Network:\n\nSAFE people are super excited but never get anything running.\nZeroNet people are apathetic cancer trolls but *do* have something (broken, incomplete) running.\n\nI really wanted and *needed* this to be a thing, but it's not a thing.\n\nFuck this shit. I'm gone and won't see any replies to this because I'm immediately uninstalling this software now.",
			"added": 1565908688
		}
	],
	"topic_vote": {
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565652073_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565658736_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565817854_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565886025_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565885910_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565889331_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1
	},
	"next_comment_id": 38,
	"comment": {
		"1565565971_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 1,
				"body": "Well, why must it be so \"clunky\"? The \"registration\" of a new \"user\" is weird, I assume on purpose?",
				"added": 1565566175
			},
			{
				"comment_id": 2,
				"body": "Mostly why it takes so many seconds of animations and stuff to create a new user. I also was confused about what appears to be multiple \"providers\", likely because I don't understand some fundamental point about ZeroNet, but then again, almost everyone will probably not read *anything* before trying it, so I guess I'm simulating an \"average user\" by just trying it out and being somewhat confused.",
				"added": 1565566302
			},
			{
				"comment_id": 3,
				"body": "Hmm. But why are \"providers\" needed? Will some of them start using CAPTCHAs and \"phone verification\" and \"IP address reputation\" BS like the iron walls of the centralized giants which all refuse any new accounts I try to make in the last 10+ years?",
				"added": 1565567437
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 4,
				"body": "Good answers. The key stuff sounds very nice yet somehow \"too obvious\" to not have been thought of before just the last few years, so I assume there must be some heavy downside to this which I haven't yet thought of...\n\nAs for making it its own browser, that would be because \"all\" the existing browsers suck and spy on everything you do. So while it sounds great in theory, it's actually a downside given the browser situation. Also, I fear that Google will quickly harass/block ZeroNet when it grows beyond a certain point.",
				"added": 1565575197
			},
			{
				"comment_id": 5,
				"body": "@montecarlo: I thought it was obvious that by \"Google\", I meant that they could easily block ZeroNet in their browser which everyone (except I) uses. Nothing about the network itself.",
				"added": 1565577571
			}
		],
		"1565629267_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 6,
				"body": "This is a very alarming quote from the FAQ: \"Is ZeroNet anonymous? It's no more anonymous than BitTorrent, but privacy (the possibility to find out who is the owner of the comment/site) will increase as the network and the sites gains more peers.\" I'm very confused about this.",
				"added": 1565629545
			},
			{
				"comment_id": 7,
				"body": "\"The pages are stored on your harddrive.\" But all the sites in the ZeroNet can't be downloaded by every node/client? Surely you must only mean ones I have \"chosen to host\" or accessed recently?",
				"added": 1565629612
			},
			{
				"comment_id": 10,
				"body": "ayra: Sounds very, very disappointing. That is indeed a major security problem. I was convinced that the basic point of ZeroNet included the ability to be \"invisible\" both as a site owner and a visitor of any site, but this is clearly not the case... :(",
				"added": 1565631402
			},
			{
				"comment_id": 11,
				"body": "gitcenter: Possibly the fact that the point of a network like this is lost if you can just track everyone like that? And even with a VPN/proxy/Tor, we all know how secure *those* are...",
				"added": 1565632191
			}
		],
		"1565627986_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 8,
				"body": "\"dont post questions like a moron\" Sigh. Your kind is everywhere, regardless of anonymity...",
				"added": 1565629832
			},
			{
				"comment_id": 9,
				"body": "Take your \"fucking FAQ thread\" and shove it up your ass. I'm asking specific questions. What's that got to do with some other thread? Rude cunt.",
				"added": 1565631177
			},
			{
				"comment_id": 12,
				"body": "Thanks for the clarifications. This sounds very, very interesting so far, but one thing that bothers me a lot is how non-VPN-using users will have their home IP addresses essentially broadcast and associated with each site they visit. I don't think the average person for one second suspects this. \"Even\" I didn't, and I at least have some sort of grasp of security (while fully acknowledging that it's impossible to stay truly secure given the circumstances of this world)...",
				"added": 1565632682
			},
			{
				"comment_id": 13,
				"body": "Yeah, but why is it shocking that somebody is \"looking for security\"? Why is that like an \"optional add-on\"? Why is it an \"if\"?",
				"added": 1565633028
			},
			{
				"comment_id": 14,
				"body": "Well, since every webhost/server host declines my payments and attempt to force me to scan my nonexistent \"photo ID\" (and pay card), just being able to host anything at all, even with zero added privacy, is relatively fantastic to me. And since I never got any traffic to any of my clearnet sites anyway, the fact that so few (comparatively) people use ZeroNet also isn't that big of a deal... That sounds like a joke, but what I mean is that this concept of no reliance of the DNS system, domain registrars, scumbag hosting companies, etc. is alone worth a ton to me. I just hope that I will somehow find a way to get my sites \"out there\" for people to actually visit...",
				"added": 1565634112
			},
			{
				"comment_id": 15,
				"body": "I have to say that the concept of a \"Certificate Authority\" in ZeroNet completely loses me even in the first sentences. It makes no sense to me. The Internet HTTPS/TLS \"Certificate Authority\" system is actually one of the important reasons I'm doing anything to get away from the centralized, awful Internet... so I hope it means something vastly different in ZeroNet. I mean, yes, I can read the page https://zeronet.io/docs/site_development/cert_authority/ , but it quickly \"loses\" me. Whether that's because I'm stupid or because the author just doesn't \"speak my language\", I don't know, but the fact of the matter is that it really confuses me, and most likely a lot of other people...",
				"added": 1565638549
			}
		],
		"1565647351_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 16,
				"body": "If you set the Tor Browser to not use any proxies, won't it just be a crippled, clearnet Firefox?",
				"added": 1565647780
			},
			{
				"comment_id": 17,
				"body": "Well, I have no idea what to think now...",
				"added": 1565649193
			}
		],
		"1565652073_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 19,
				"body": "\"There is no server side language like PHP.\" Where did I say/imply this? Where?! In fact, the whole point is that the PHP logic is run on Joe's computer and nowhere else. Please read... this happens every single time when I try to get any nontrivial question answered: people seem to just skim my text and, as a natural result, the response becomes nonsensical since it assumes that I said things which I did not.",
				"added": 1565654282
			},
			{
				"comment_id": 20,
				"body": "\"no reason to use PHP to do that\"? Huh? Please read my post before replying. You seemed to ignore the whole premise. Not trying to be rude,  but I find it extremely disrespectful to get replies (no matter how well written in their own regard) which seem to ignore the original author's questions. I wanted to know if the specific list of actions is... why am I repeating myself? I already typed this once...",
				"added": 1565654684
			},
			{
				"comment_id": 21,
				"body": "crazylime: What \"doesn't make sense\"? You keep saying that it \"makes no sense\"... but what are you referring to? At which point in my list does something not make sense?",
				"added": 1565655782
			},
			{
				"comment_id": 22,
				"body": "crazylime: And how can you call me \"extremely rude\" for calling you out on not having read the post you're replying to? Why make the effort of replying at all if you don't even bother reading the question? You seriously think that's ever going to make the person asking the questions happy? It truly baffles me how you could possibly think that.",
				"added": 1565655934
			},
			{
				"comment_id": 23,
				"body": "And once again, you ignored my pleads for you to actually address the question. You still haven't managed to tell me which step starts not making sense to you, and the only things I've got from you are insults about how much I suck and how great you are and how thankful I should be because you reply at all, even though you actually just waste my time and energy. Amazing. Absolutely amazing.",
				"added": 1565657426
			},
			{
				"comment_id": 24,
				"body": "At this point, I can tell that you are trolls/sockpuppets. Sad beginning for ZeroNet, when you can't get the most basic questions answered and only psychos/illiterate dumbasses reply.",
				"added": 1565657640
			}
		],
		"1565658736_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 25,
				"body": "I tried to trim my post from all irrelevant points, but in regards to VPSes: they all require photo id to have *any* kind of server or even *webhost* account in the last 10+ years. That's why a lot of us cannot have servers, no matter how easy it is for *you* to \"spin up a VM in the cloud in 10 seconds\", and no matter how cheap it is. They just won't let us pay them money without sending a photo id, which is never going to happen. But now this is already off-topic... so let's not make it worse.",
				"added": 1565669784
			},
			{
				"comment_id": 26,
				"body": "Alright... I'll bookmark that page, but such sketchy businesses are highly unreliable in my experience. Also: \"Last updated: January 14, 2017\"... So probably a lot of dead links and ones that at one point accepted Bitcoin but stopped doing it, etc. Either way, I don't trust running stuff outside of my control. And it's not what my question was about.",
				"added": 1565692176
			}
		],
		"1565729654_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 27,
				"body": "... anyone?",
				"added": 1565794311
			}
		],
		"1565734523_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [],
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 29,
				"body": "Disabling the proxy in Tor Browser will turn it into a normal Firefox, won't it? That sounds like a horrible advice...",
				"added": 1565810550
			},
			{
				"comment_id": 30,
				"body": "Firefox ignores localhost for proxies on its own, though... And why do you call it \"TOR\"?",
				"added": 1565818969
			}
		],
		"1565817854_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [],
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 32,
				"body": "Sign me up for \"making tons of them\". I hereby volunteer to spend the rest of my life tied to a bed and being force-ridden by gorgeous Aryan babes eight times a day.",
				"added": 1565835373
			}
		],
		"1565885910_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 33,
				"body": "styromaniac: Thanks for your useless, rude reply. Got anything worthwhile to add?",
				"added": 1565886278
			}
		],
		"1565886025_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 34,
				"body": "> [caryoscelus](#comment_196_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): (stuff)\n\nNot sure what your point is... After all, I was asking for a library and not a new language?",
				"added": 1565886775
			},
			{
				"comment_id": 35,
				"body": "I don't understand what you're saying. I'm not talking about adding \"PHP support\" to ZeroNet... I'm talking about a library in and for PHP to communicate with ZeroNet. On my computer. So that any kind of non-trivial system can be made, you know...",
				"added": 1565889233
			}
		],
		"1565889331_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 36,
				"body": "Every single replier in here got perma-muted for being toxic, rude cunts.",
				"added": 1565899804
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 37,
				"body": "I thought Tor was built into ZeroNet on Windows? It's not anymore?",
				"added": 1565900293
			}
		]
	},
	"comment_vote": {
		"23_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"22_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"21_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"20_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"19_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"24_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"982_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"31_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"20_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"33_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"23_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1
	}
}