{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1561938559_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1561938559_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "~~Of course, theoretically it's possible but there are no plans and it's hard~~ it's entirely possible to achieve this. Your limit will be automatically increased by nofish.",
				"added": 1561939408
			},
			{
				"comment_id": 2,
				"body": "Well ZeroNet sites are built using a bunch of files, these can be easily shared on other networks, I'm not sure how easy this is done from other networks to ZeroNet but I think Freenet is rather simple as well.",
				"added": 1561940068
			},
			{
				"comment_id": 3,
				"body": "ZeroNet could slowly move to something like https://en.wikipedia.org/wiki/ActivityPub to be more interoperable with other networks that use this, like Friendica*.\n\nI think what you want is necessary because we really don't have the time to re-invent the wheel again.\n\n. * Alot more, nice:\n\n>    Mastodon, a social networking software, implemented ActivityPub in version 1.6, released on 10 September 2017. It is intended that ActivityPub offer more security for private messages than the previous OStatus protocol does.[4]\n>    Pleroma, a social networking software implementing ActivityPub.[4]\n>    Misskey, a social networking software implementing ActivityPub.\n>    Hubzilla a community CMS software platform that uses Zot, added ActivityPub support from version 2.8 (October 2017) with a plugin.\n>    Nextcloud, a federated service for file hosting.\n>    PeerTube, a federated service for video streaming.[4]\n>    Pixelfed, a federated service for image sharing.\n>    Friendica, a social networking software, implemented ActivityPub in version 2019.01.[5]\n>    Osada, a social networking software implementing Zot & ActivityPub. With focus on being the glue that binds much of the decentralised web.\n>    Zap, a social networking software implementing Zot & ActivityPub. With focus on privacy.",
				"added": 1561940497
			},
			{
				"comment_id": 4,
				"body": "And since ZeroNet is just a bunch of files (with diffs for JSON files) it could also move to something like Rsync :)",
				"added": 1561940784
			},
			{
				"comment_id": 5,
				"body": "Sorry I didn't understand you the first time, my fault. It's entirely possible, but I'm not sure how this federation already works between Friendica and other services that use ActivityPub",
				"added": 1561940980
			}
		]
	},
	"comment_vote": {}
}