{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "joffrin c'est un fils de pute : il fait tout pour denier l' ONU / agenda globaux",
			"body": "mais quel connard ! c'est pas possible d'etre si con et de croire encore au collectivism a la mao... quel idiot. ",
			"added": 1616143017
		},
		{
			"topic_id": 2,
			"title": "― David Rockefeller ",
			"body": "\n“We are grateful to the Washington Post, the New York Times, Time Magazine and other great publications whose directors have attended our meetings and respected their promises of discretion for almost 40 years......It would have been impossible for us to develop our plan for the world if we had been subjected to the lights of publicity during those years. But, the world is more sophisticated and prepared to march towards a world government. The supernational sovereignty of an intellectual elite and world bankers is surely preferable to the national autodetermination practiced in past centuries.”\n\nfor me the lulz is on \"intelltectual elite\"... rofl.... and \"elite bankers\" loling more on the bailout tapes :).\n\nit's PATHETIC ! \n",
			"added": 1616145275
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 1,
				"body": "y a pas qqn qui pourrait le prendre a part et faire un petit review de l uno / global agenda avec ce bouffon, ou comme disait david rockfeller, sans la trahison des medias cela aurait ete impossible... et bien joffrin c'est un des traitres. il met son ideology avant la france, en tant que nation souveraine... lui il est peut etre des inferiuers, juste EU EU EU... mais o fon il doi com mem savoir pour l onu / global agenda... faut pas etre si con, la preuve meme moi... heheheh.",
				"added": 1616143144
			},
			{
				"comment_id": 2,
				"body": "“We are grateful to the Washington Post, the New York Times, Time Magazine and other great publications whose directors have attended our meetings and respected their promises of discretion for almost 40 years......It would have been impossible for us to develop our plan for the world if we had been subjected to the lights of publicity during those years. But, the world is more sophisticated and prepared to march towards a world government. The supernational sovereignty of an intellectual elite and world bankers is surely preferable to the national autodetermination practiced in past centuries.” ",
				"added": 1616143203
			}
		],
		"2_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 3,
				"body": "donc lci/tf1 ils ont full on board, et canal+ ca leur pete les couilles ses affaires de bouffons qui comprennent rien a la france :). ",
				"added": 1616145326
			},
			{
				"comment_id": 4,
				"body": "quelle honte !!!",
				"added": 1616145336
			}
		]
	},
	"comment_vote": {}
}