{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1570980089_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 1,
				"body": "do you think the feds wont know the difference from who actually browses that page and people who just passing by and get away as soon as they notice what CP actually stands for? i already got in at least 2 cp pages without knowing what it was about only 1 had cp in the name one of them at 08chan.bit. i run away as soon as i noticed and so far i have no problems with authorities",
				"added": 1571017286
			},
			{
				"comment_id": 2,
				"body": "> [upqxhzppexdl2d9t](#comment_11_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w): Do you think they will care? If you have it on your drive then they have grounds to prosecute you. The state just cares about making money. Practice good opsec. Practice full disk encryption. Wipe constantly; programs like bleach bit are your friend (Ir just straight up microwaving old memory units and getting new ones constantly.) and, yeah, like the other dude said. Just black list anything that looks even remotely suspicious.\n\ni forgot to mention that i imediately deleted from my driver later. so what i was saying is that he can enter the page just to check if it is CP then he leave and if he deletes it , it is all ok.",
				"added": 1571057008
			},
			{
				"comment_id": 3,
				"body": "> [harpyproductions](#comment_2_13kCqkdmy1yvF6mafYjGwnGhvJZnDiHJhj): i forgot to mention that i imediately deleted from my driver later. so what i was saying is that he can enter the page just to check if it is CP then he leave and if he deletes it , it is all ok.\n\nalso he probably has to never come back again. this will tell the feds that you came there by mistake and want nothing to do with it. they have more things to do than to investigate a guy who probably already deleted all the files and even overwrite the free space just to be sure",
				"added": 1571057043
			}
		]
	},
	"comment_vote": {
		"392_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1
	}
}