{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1572993951,
			"title": "kxoid.bit",
			"body": "I'm unable to create a new id using this. I have the peer message plugin installed, I'm not sure what the issue is.",
			"added": 1572993950
		},
		{
			"topic_id": 1573256364,
			"title": "In case you're new",
			"body": "Go to http://127.0.0.1:43110/zeroid.bit/. Click on \"search in user database\". Type duende and mute him. Should remove some negativity on zeronet lmao..",
			"added": 1573256362
		}
	],
	"topic_vote": {
		"1572755470_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1573256364_1PqMZQ5834GboBvKeEGNxJ5kzt6AgxFyA7": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1572892108_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "..What?",
				"added": 1572908214
			}
		],
		"1572974675_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 2,
				"body": "> [quac](#comment_9_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61): Democracy doesn't work. Lets kill the rich and take back our wealth.\n\nTLDR: Majority of citizens are uneducated and don't know what to with wealth so the rich will always hold the power whether it's a capitalist, communist, or socialist system; or if it's an authoritarian regime or democratic state.\n\nThe reason that democracy falls is when the majority of the citizens are uneducated which makes the people in power (the rich, not the policitians) take advantage of them. Most people believe the rich are crooked and are illegally exploiting the law but the majority of them stay within the law and uses the loopholes in them to their advantage. The same tax strategies that Donald Trump uses for example can easily be used by you IF you knew about them and knew how to utilize them. \n\nThe wealthy will always try to gain more wealth even if it's the expenses of others; this applies to socialism and communism too which means it's the not the democratic capitalist system that is failing but rather the uneducated citizens. Socialism simply doesn't work because there is free markets and bureaucracy will destroy/or steal much of the wealth generated by the citizens.\n\nNew York, previously glorious, is now a mini-welfare state that will never get out of debt. Soviet Union was destroyed by bureaucracy. Majority of citizens in Communist China and North Korea are impoverished. China has actually started to generate more wealth due to more capitalist system but still the top 1% hold the power. Argentina....well argentina. \n\nIt doesn't matter whether it's socialism, communism, capitalism, authoritarianism, or democracy. The rich will always hold the power if the citizens are not educated enough. Stealing from the rich to give to the poor results in the same process since the poor doesn't know what to with money and the people \"giving\" the money will always keep a fair slice for themselves and will become the new \"rich\". And the cycle repeats.\n\nSorry for the long paragraph. The situation presented itself and I was bored so... :D",
				"added": 1572991262
			}
		],
		"1572987956_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 3,
				"body": "You spent so much time on the addresses you forgot the charity :D",
				"added": 1572991425
			}
		],
		"1570492144_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 4,
				"body": "> [aspidochelone](#comment_257_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Well... the U.S. has a death penalty, so I always wondered ... why don't we have a rape penalty?  I mean, for every guy yelling he hopes somebody gets killed, there's three yelling he hopes the target of his wrath gets raped up the ass in jail, so there's a huge groundswell of support for it.  It's obviously less cruel than the death penalty and that's constitutional right?  The prison gangs use it to keep prisoners in line and it seems to work better than anything the prison authorities do... a lot better.  And unlike long jail sentences or executions, a rape penalty can be, not merely cheap, but actually have a NEGATIVE cost, because you can have folks bid on the right to impose the penalty personally, and then there are the broadcast rights to talk about.\n\nLMFAO. I'm dead.",
				"added": 1572991541
			},
			{
				"comment_id": 5,
				"body": "> [quantumkitty](#comment_243_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): If I were to start a country of scratch, it would be a left-wing libertarian tropical island in which everyone gets 50 square meters of land for free (in which they can build a small tiny house, have a garden and live rent-free) and also have a basic income of around $50 per week/$200 a month. You're not allowed to sell this land only re-assign ownership to somebody else who doesn't already own land. There will be a specially designated area in the center of the island where people can set up a shop and sell things on the streets (electronics, home made crafts, produce, garage sales, etc.) without asking for permission.. and basically sell almost anything they want as long as they're not being a nuisance/obstruction. Illegal drugs would be highly regulated and decriminalized rather than illegal. Cannabis industry would flourish. Tax rate would be more or less standard, not too high not too low. You only start paying tax once you're earning enough to support yourself and a little extra. There will be a small police force, but no military and everyone is responsible for their own safety. Copyright is abolished and intellectual property is non-existent. Internet is provided for free by the state and has no restrictions. Guns are legal but you can't just shoot someone trespassing into your property.\n\nMoney. Money Money.",
				"added": 1572991630
			}
		],
		"1573159148_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": [
			{
				"comment_id": 6,
				"body": "> [fucktheusa](#comment_3_1BLEbkg58oLBXLeyb1fJZX6GNYRp8y7Y1i): Possibly because it's peer-to-peer.\n\nSecond this. You have peers all around the world which can send you the zite, like torrenting essentially. Although Tor does obviously slow down your connection.",
				"added": 1573255766
			}
		],
		"1572640590_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 7,
				"body": "> [caropc10](#comment_9_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL): Playhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n\nFor movies.",
				"added": 1573255996
			}
		],
		"1573172203_17LTVhar6FUm7BRaj8FFcoVDVkTr1Y6QcY": [
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_986_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): hy duende we thought you were dead, glad to see you there.\n\nHonestly lmfao.",
				"added": 1573256139
			}
		]
	},
	"comment_vote": {
		"1115_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_1PqMZQ5834GboBvKeEGNxJ5kzt6AgxFyA7": 1,
		"3_1PqMZQ5834GboBvKeEGNxJ5kzt6AgxFyA7": 1,
		"3_1BLEbkg58oLBXLeyb1fJZX6GNYRp8y7Y1i": 1,
		"9_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": 1,
		"5_1DLLxLPEjC4xmHBo235fGQLC2dauvgiig6": 1,
		"986_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}