{
	"title": "夏虫札记",
	"description": "<font color=tan>**念念不忘，必有回响**</font>",
	"links": "**[Tweet Me](https://twitter.com/Ewing_Cheung)**",
	"next_post_id": 28,
	"demo": false,
	"modified": 1523545148,
	"post": [
		{
			"post_id": 27,
			"title": "防民之口甚于防川",
			"date_published": 1523540315.718,
			"body": "小时候看过的一部动画片，让我直到如今还记忆深刻。\n\n故事很简单，大禹治水。天下发大水，禹的父亲鲧求到息壤——一种能自己生长的土壤——封堵洪水，可是洪水破口，情况反而更严重。禹继承了父亲的意志，以疏导为主，开山凿地，将洪水最终引流入海。天下太平。\n\n* * *\n\n本周一件比较有趣的事情是，内涵段子被封了。这个号称由两亿用户的APP，被广电总局一纸公文以“导向不正，格调低俗”“引起广大网友严重不满”为由，永久关闭。![å¾®ä¿¡å¾ç_20180411102329](http://upimages.caijing.com.cn/2018/0411/1523413720819.jpg)\n\n随后今日头条公司CEO张一鸣公开道歉，称“一直处在自责和内疚之中，一夜未眠”。随后11号凌晨，北京的“内涵段子”用户在北京广电总局门口自发集结进行抗议，只是结果又如何？各位看官自然也心里清楚。\n\n我倒是从来没用过这个APP，但却早有耳闻。今年过年在家，表哥就提到过几次，夸上面的用户（所谓“段友”）姿势水平很高。平日在路上也见过颇多贴有“内涵段子TV”的车贴，也在和朋友的玩闹中“一长两短”地鸣笛，做出段友们的暗号。\n\n我很恐惧的是，几乎没有人发声，一个曾经庞大的“段友”群体就这么轻易的万马齐喑。大概是总觉得倒了它一个，还有千千万万个xx。可是温水煮青蛙亦不过如此。一步一步地收紧绳索，直到你再也没有力气挣扎。\n\n但是我除了躲在这个角落里用键盘打字发泄一些，又能作什么？明天的太阳依然是红色的，太阳的光辉依然会照耀在大陆。然后我将洗漱，然后背着包，继续学习科学文化知识，为建设我们的国家而努力。"
		},
		{
			"post_id": 26,
			"title": "记宿舍生活",
			"date_published": 1523012663.196,
			"body": "大学的宿舍是很奇怪的。互相视若不见的、感情好到穿一条裤子的、组小团体打压一个人的、表面兄弟或姐妹的......"
		},
		{
			"post_id": 25,
			"title": "记午睡一梦",
			"date_published": 1521730540.159,
			"body": "梦境诡谲。\n\n在某个实验室，课题组发现了某具尸体割下来的血肉在贴合至头颅时，可以自动与颅部融合，丝毫不能看出端倪。未知带来的永远是恐惧。课题组负责人要求将该头颅冷冻深埋，而我则力争将其火化，火化是最为彻底的消灭方式。然而投入焚化炉之后，该头颅却顺着管道以液态方式逃出了实验室。课题组急急追踪过去，却发现这摊无定形物质化作了一只狗被一户人家收养......\n\n从梦中惊醒，大汗淋漓不止。"
		},
		{
			"post_id": 24,
			"title": "人死如烛灭？",
			"date_published": 1518083603.287,
			"body": "今年第一个月，我爷爷走了。\n\n说来奇怪，那天我极为反常地5：30醒后，以为是7点，照常洗漱，到了食堂才发现时间不对劲。中午地时候，我爸打电话告诉我说，爷爷老了。我宁愿相信这之间存在某种冥冥的关联。\n\n以前看到一句话，人死如烛灭，很洒脱。然而真当生死之事发生在自己至亲身上，却恍然原来不过是强作潇洒。等到过年上坟的时候，姑姑痛哭着说想爷爷，说梦到爷爷来看她。一个活生生的人，怎么就这样子没了呢？我不敢想，不敢想有一天我的爸妈也会老，也会突然离开。愿大家都珍惜生命，也惜取眼前人。"
		},
		{
			"post_id": 23,
			"title": "新年第一篇",
			"date_published": 1514790877.482,
			"body": "很久没来了，最近临近考试周，课业压力的确挺大，大抵医学生的期末都是这样。共勉。新年加油。"
		},
		{
			"post_id": 22,
			"title": "PBL记录_老张",
			"date_published": 1511657157.014,
			"body": "这是本学期locomotor system的第二个case，现记录如下：\n\n* * *\n\n​​​​​​​![image.jpg (819x535)](data/img/post_22_image.jpg)\n\n![image.png (823x341)](data/img/post_22_image.png)\n\n![image.png (815x355)](data/img/post_22_image.png)![__.jpg (675x900)](data/img/post_22___.jpg)\n\n这个case中老张是典型的LDH(lumbar disk herniation)，即我们常见的腰椎间盘突出。\n\nLDH是因脊髓上的椎间盘发生退行性病变，纤维环变形破裂，从而导致髓核移位且超出范围损害周围神经部位的一种综合征。年龄因素是其主要因素。流行病学表明，LDH多见于中年人，以20-50岁为多发年龄，男性多于女性。通常LDH可根据严重程度分为3种类型：\n\n·膨隆型\n\n纤维环部分破裂，表层完整，髓核向椎管局限性隆起，表面光滑。\n\n·突出型\n\n纤维环完全破解，髓核凸向椎管，表面高低不平\n\n·脱垂游离型\n\n破裂突出的椎间盘组织或者碎片脱入椎管内\n\n老张年龄较大，纤维环含水量降低，弹性降低，长期久坐，最终因为弯腰捡拾铅笔，导致LD突然受压脱出。\n\n这段时间腰的确时不时有疼痛，甚至向同学讨了一剂膏药方才缓解。杯弓蛇影，杯弓蛇影。"
		},
		{
			"post_id": 21,
			"title": "鲁迅的文",
			"date_published": 1510198299.29,
			"body": "从一封匿名信里看见一句话，是“数麻石片”(原注江苏方言)，大约是没有本领便不必提倡改革，不如去数石片的好的意思。因此又记起了本志通信栏内所载四川方言的“洗煤炭”。想来别省方言中，相类的话还多；守着这专劝人自暴自弃的格言的人，也怕并不少。\n\n* * *\n\n凡中国人说一句话，做一件事，倘与传来的积习有若干抵触，须一个斤斗便告成功，才有立足的处所；而且被恭维得烙铁一般热。否则免不了标新立异的罪名，不许说话；或者竟成了大逆不道，为天地所不容。这一种人，从前本可以夷到九族，连累邻居；现在却不过是几封匿名信罢了。但意志略略薄弱的人便不免因此萎缩，不知不觉的也入了“数麻石片”党。\n\n所以现在的中国，社会上毫无改革，学术上没有发明，美术上也没有创作；至于多人继续的研究，前仆后继的探险，那更不必提了。国人的事业，大抵是专谋时式的成功的经营，以及对于一切的冷笑。\n\n但冷笑的人，虽然反对改革，却又未必有保守的能力：即如文字一面，白话固然看不上眼，古文也不甚提得起笔。照他的学说，本该去“数麻石片”了；他却又不然，只是莫名其妙的冷笑。\n\n中国的人，大抵在如此空气里成功，在如此空气里萎缩腐败，以至老死。\n\n我想，人猿同源的学说，大约可以毫无疑义了。但我不懂，何以从前的古猴子，不都努力变人，却到现在还留着子孙，变把戏给人看。还是那时竟没有一匹想站起来学说人话呢?还是虽然有了几匹，却终被猴子社会攻击他标新立异，都咬死了；所以终于不能进化呢?\n\n尼采式的超人，虽然太觉渺茫，但就世界观有人种的事实看来，却可以确信将来总有尤为高尚尤近圆满的人类出现。到那时候，类人猿上面，怕要添出“类猿人”这一个名词。\n\n所以我时常害怕，愿中国青年都摆脱冷气，只是向上走，不必听自暴自弃者流的话。能做事的做事，能发声的发声。有一分热，发一分光，就令萤火一般，也可以在黑暗里发一点光，不必等候炬火。\n\n此后如竟没有炬火：我便是唯一的光。倘若有了炬火，出了太阳，我们自然心悦诚服的消失。不但毫无不平，而且还要随喜赞美这炬火或太阳；因为他照了人类，连我都在内。\n\n我又愿中国青年都只是向上走，不必理会这冷笑和暗箭。尼采说：“真的，人是一个浊流。应该是海了，能容这浊流使他干净。\n\n“咄，我教你们超人：这便是海，在他这里，能容下你们的大侮蔑。”(《札拉图如是说》的《序言》第三节)\n\n纵令不过一洼浅水，也可以学学大海；横坚都是水，可以相通。几粒石子，任他们暗地里掷来；几滴秽水，任他们从背后泼来就是了。\n\n这还算不到“大侮蔑”——因为大侮蔑也须有胆力。\n\n```\n                                                             《热风·随感录四十一》\n```"
		},
		{
			"post_id": 20,
			"title": "11.4",
			"date_published": 1509776446.161,
			"body": "以德报怨，何以报德？以直报怨，以德报德。\n\nJustice means giving people what they deserve.\n\n想通了就舒畅了。"
		},
		{
			"post_id": 19,
			"title": "十月中旬",
			"date_published": 1508600022.586,
			"body": "在医学院这两个月，杀过青蛙，杀过小白鼠，甚至还杀过眼睛都没有睁开的幼鼠（primary culture)。\n\n很惭愧，第一次做的时候手生，没能给小鼠一个痛快。等得了闲，是一定要去一趟动物慰灵碑的。\n\n不过冲击最大的还是在系解实验时，亲眼目睹甚至上手触碰人的尸体。被福尔马林处理过的尸体有一股呛人的刺鼻味道，感谢他们，让我们在学校能接触到一些课本上枯燥的知识。"
		},
		{
			"post_id": 18,
			"title": "PBL记录_老王",
			"date_published": 1508513067.148,
			"body": "这是本学期locomotor system区段的第一个case。记录如下：\n\n* * *\n\n![image.png (730x296)](data/img/post_18_image.png)\n\n![2.png (731x267)](data/img/post_18_2.png)![3.png (729x673)](data/img/post_18_3.png)\n\n![4.png (728x347)](data/img/post_18_4.png)\n\n该case属于一例股骨颈骨折，老年人是骨折的易发人群，原因在于随着年龄增加，骨中的无机成分比例增大，使得骨变得脆而易折。老年人跌倒后诉髋部疼痛，不能站立和走路，应想到股骨颈骨折的可能。X线检查可为骨折的分类和治疗提供参考。\n\n股骨颈骨折通常可分为：\n\n·头下型：骨折线完全位于股骨头下，整个股骨颈均在骨折远端，股骨头可在髋臼和关节囊内自由转动。这类骨折在老年患者中最为多见，股骨头血供损伤严重，愈合困难，股骨头发生缺血坏死发生率高，预后差。\n·头颈型：即股骨颈斜行骨折。此型骨折难以复位，复位后稳定性亦差，对股骨头血供的破坏仅次于头下型。\n·经颈型：全部骨折面均通过股骨颈，实际上此型较少见，特别老年患者中更少见，甚至有学者认为不存在此型。X线显示的经颈骨折往往是一种假象，重复摄片时常被证实为头颈型。\n·基底型：折线位于股骨颈基底。骨折端血运良好，复位后易保持稳定，骨折容易愈合，预后良好，有部分学者将其列入转子部骨折。\n\n而治疗则常用4种方案：\n\n1.经皮空心钉内固定术 ；\n2.钉板内固定 ；\n3.股骨颈骨折人工股骨头置换术；\n4.人工全髋关节置换术 。"
		},
		{
			"post_id": 17,
			"title": "车上的事",
			"date_published": 1507390704.974,
			"body": "回家当天，正当在火车上眯着眼睛打盹儿，蓦然听到广播，相邻车厢有人突发疾病，急需医务工作者诊断。\n\n惭愧自己虽然身为医学生，却还连基本的急救技能尚未掌握，不能起身帮忙。\n\n但愿那乘客平安无事。"
		},
		{
			"post_id": 16,
			"title": "一周后的话",
			"date_published": 1505730886.633,
			"body": "常常会觉得惶恐，自己已经大三了。如果不是入了医学的坑，现在大抵该考虑保研或者考研的事情了。过了20的界限，再也不能找借口说，自己还是十几岁的少年了。\n\n* * *\n\n少年不识愁滋味，爱上层楼。爱上层楼，为赋新词强说愁。\n\n我才20岁，却很可悲的能预见到自己一生的轨迹。老老实实地毕业，规培，参加工作，在某三甲医院老老实实的工作，偶尔会为了晋升不得不去做做科研。结婚，生子，工作。一步一步腐朽，一步一步烂在土里。\n\n这一周接触医学课程，课不多，却的确要记录很多的东西。要复习，要预习，要厚着脸找教授们蹭实验。这就是我的大学。\n\n像一潭死水，没什么风浪，亦没什么风景。"
		},
		{
			"post_id": 15,
			"title": "一点追忆",
			"date_published": 1504795911.274,
			"body": "开学一周了。\n\n这一周也时常跑步，前些年也是10点出去跑几圈，跑完和基友吹吹逼，骂骂班里、学校里的傻逼人，傻逼事，或者是聊聊新闻。现在回想，恍如隔日，不由得生出老气横秋之感，只觉时光太匆匆。基友去了MIT交流，我却只是换了一个圈子，困顿在这围城中。\n\n依然是10点去跑步，只是这次跑完再不能书包往双杠上一挂，一边漱口，一边开口：“儿子，卧槽，今天咋这鸡儿累......”一个人的夜跑，多少有些落寞。"
		},
		{
			"post_id": 14,
			"title": "PBL记录_小美",
			"date_published": 1504791238.945,
			"body": "PBL即problem-based learning，本学期大概会做6个case。在此记录第一个case，小美的故事。\n\n* * *\n\n![IMG_20170907_213552.jpg (679x900)](data/img/post_14_IMG_20170907_213552.jpg)\n\n![IMG_20170907_213602.jpg (679x900)](data/img/post_14_IMG_20170907_213602.jpg)\n\n先找些有意思的信息，第二幕中提到了H1N1。H1N1最近一次的大规模爆发在09年,那么这个案例中小美很可能是1994年生人。小美感染了influenza virus typeA，且痰液与血液培养均生长出streptococcus pneumonia serotype 19a。初步判断可能是流感伴发肺炎。\n\n值得注意的是，这里提到的H1N1，小组都因为case中小美的背景而误认为属于禽流感。然而禽流感(Avian Influenza，AI)目前尚无证据表明可以在人际之间进行有效传播，禽流感的病毒亚型已被报道的主要有H5,H7,H9,H10。H1N1并不属于禽流感，而是所谓是'猪流感'(swine influenza)。\n\n甲型流感病毒的subtype分类还是挺有意思的。H指血球凝集素(**H**emagglutinin)，N指神经氨酸酶(**N**euraminidase)，目前可分为16个H亚型和9个N亚型。"
		},
		{
			"post_id": 13,
			"title": "记第一次参与查房",
			"date_published": 1504790405.111,
			"body": "作为早期接临床的活动项目之一，今天早上早早到了一附院参与查房。\n\n* * *\n\n8点乘电梯到了住院区的对应科室，负责的大夫们还需要交班，于是只能在住院医师办公室门外等候。那感觉真是挺像罚站啊，哈哈。一行9人足足站了一节课的时间。门终于开了，白大褂们蜂拥而出。可是看样子并没有人招呼我们，于是作为小组长就进去找带我们的大夫。草草地分了四个组，四组分头行动。\n\n令人意外的是，带我们的这组竟然是我们学校第一届八年制的学姐，真是欣喜。又过了半小时，才终于开始查房，于是穿上白大褂，手拿着病历。跟在屁股后面挨个床位轮转，帮着递病历单（笑），自己当然是什么也不懂，也不多话，权当是参观。只是长这么大，头一次被叫做大夫，作为医学生心里总是有些异样的感觉的。倒也没有颇为激动，大概更是知道肩上的担子吧。"
		},
		{
			"post_id": 11,
			"title": "记第一次参观标本陈列室",
			"date_published": 1504515611.324,
			"body": "开学伊始，下午由老师带领参观解剖楼标本陈列室。\n\n* * *\n\n作为医学生，解剖是我们的基本功，所以对参观的这一天内心中还隐隐有些期待。\n\n老师领我们班进了陈列室，还没开灯，进门一片黑暗，只看得到一具黄褐色皮肤，显露部分内脏的人体，被门口射进来的光照的隐隐约约。\n\n老师开了灯，整个屋子就都亮起来了。瓶瓶罐罐，都是或白、或黄、或红的人体部分，泡在略有些黄绿的福尔马林溶液中。惨白的灯光下，是瘆人的白色。\n\n在禁烟宣传中，我倒真没少见过黑色的肺叶图片。然而今天是第一次见到真实人的肺部，泡在福尔马林里，黑色的斑点附着在上面。看千百次禁烟宣传，真不如亲眼看一次。所谓的感同身受，大抵就是如此。很遗憾，没能拍下来这张图片。我自认没有烟瘾，只是和朋友们在一起会吸一些。不过现在我想我应该不会再抽烟了。"
		},
		{
			"post_id": 9,
			"title": "火车上的一则小事",
			"date_published": 1504333370.881,
			"body": "适逢开学季，和好友约了一起返校。由于中途计划颇有些变故，最终和他两人虽一列车出发，却不在一节车厢。\n\n* * *\n\n舟车劳顿，漫漫旅程着实无趣。一时兴起，便起了寻他二人畅谈一番的心思。经过中间几节车厢时，惊讶地发现这几节实在空旷，大抵是途中某一站成批地下车导致。见了朋友，就邀他们同去。朋友夹杂在三位老太叨叨之中，早已不耐，自是一拍即合。见桌上有一直筒水杯，就顺手帮朋友带过去了。\n\n到了开阔地，三人吹吹牛，玩玩牌，委实是白驹过隙一般。有些口渴，拿起自己的杯子便要去接水，朋友讶异地指着桌上的直筒水杯：“这不是你的杯子？”我顿时也忽然明白自己放佛做了一件蠢事，忙问了他们原来的座位号，拿起杯子回返。\n\n三位老太仍兀自说话，我道歉说拿错了她们的杯子。却不料杯子竟也不是她们的，而是另一位年龄和我相仿的小伙子的。小伙子该是已经下车了。我霎时留也不是，走也不是。只得对空气喃喃道歉，将杯子放在桌上。三位老太又得了新话题，越发聊得热和起来，车厢里都是快活的空气。"
		},
		{
			"post_id": 6,
			"title": "关于如何开启路由器端口",
			"date_published": 1504016195.629,
			"body": "我使用的是TP-LINK的无线路由器。以此为例\n\n* * *\n\n1.访问[http://192.168.1.1/](http://192.168.1.1/)，如果没有修改过的话，用户名和密码应均为admin\n\n2.找到 “`转发规则-虚拟服务器`”项，单击增加新的条目\n\n![QQ__20170829222956.png (752x407)](data/img/post_6_QQ__20170829222956.png)\n\n3.服务器端口填15441，ip地址填本机ip即可\n\n回到主页后，重新检查端口开放状态如图\n\n![QQ__20170829233141.png (686x219)](data/img/post_6_QQ__20170829233141.png)\n\n关于本机ip：打开cmd，输入ipconfig，回车。在反馈的信息中找到 “`无线局域网适配器WLAN：IPv4地址`”\n\n![ip.png (438x178)](data/img/post_6_ip.png)"
		},
		{
			"post_id": 5,
			"title": "关于夏天的记忆",
			"date_published": 1504010991.878,
			"body": "每个夏天，都浸在烈日与蝉鸣中。\n\n* * *\n\n透过那些我现在仍不知道名字的高大树木，投下斑驳树影，清晰且锋利。马路的尽头，是宛如跳动火焰的虚幻光影。伴和着的，是起起伏伏的蝉声。"
		},
		{
			"post_id": 1,
			"title": "欢迎",
			"date_published": 1433033779.604,
			"body": "欢迎来到我的博客。\n\n* * *\n\n得益于诸多无私的博主们的教程，终于搭建了自己的第一个博客。\n\n这个博客将会用于记录一些繁琐之事，给自己一个喃喃自语的地方。                      \n\n                                                                                                                2017-8-20"
		}
	]
}