{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Сделаем подборку интернет СМИ?",
			"body": "Какие остались источники, освещающие обстановку в России не то чтобы непредвзято, а сообщающие о происшествиях, в принципе?",
			"added": 1492815302
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"2_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx": [
			{
				"comment_id": 1,
				"body": "Думаю, дело в обновлениях и обратной связи. В винде обновления выходят быстрее и применяются без участия пользователя. Сбор телеметрии позволяет, в свою очередь, быстрее получать сведения о проблемах. Пока линуксоиды все ещё ленятся писать багрепорт, в винде за это время устранение проблемы уже прилетает через обновления.",
				"added": 1492814410
			}
		],
		"1_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr": [
			{
				"comment_id": 2,
				"body": "> [rf](#comment_1_1KzYcu3wX1UWtVGscnshr1DpKhRJRJNePe): Можно тут хоть обосраться, а удавка все туже стягивается на шее простых жителей России\n\nПока ещё не настолько туго, чтобы заставить людей шевелиться.",
				"added": 1492814652
			}
		],
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 3,
				"body": "По телеку впринципе сейчас ничего не показывают, информацию из него получить нельзя.",
				"added": 1492814924
			}
		],
		"1_14rgoYCYDzEKQfFFSYwweWWFm5egR7Xrxe": [
			{
				"comment_id": 4,
				"body": "Из того, зачем слежу я: \n* https://openrussia.org/\n* https://novayagazeta.ru/\n* https://zona.media/\n* https://echo.msk.ru/\n* https://meduza.io/",
				"added": 1492815470
			}
		],
		"4_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 5,
				"body": "Да все просто. Биткойн новое явление, что для России что для других стран. Посмотреть на передовой опыт других стран они не могут, ввиду его отсутствия, потому решение принять тоже не способны. А точнее, решением можно считать затягивание законодательной неопределенности на время, пока другие страны не поднакопят опыта внедрения и естественно будут перенимать худшие случаи. Впрочем, как обычно.",
				"added": 1492815856
			}
		],
		"1_1KGjw62VbKqGtehKJ1MA6cF6s8KmAQY8ha": [
			{
				"comment_id": 6,
				"body": "Первого анархистского не получилось. Иного он анархистов и не ожидал.",
				"added": 1492815984
			}
		]
	},
	"comment_vote": {}
}