{
	"next_topic_id": 23,
	"topic": [
		{
			"topic_id": 1577974129,
			"title": "Poczta.",
			"body": "Mam pytanie, nie wiem gdzie zapytac? Wiec pytam tutaj. Czy istnieje opcja, mozliwosc zwiekszenia poczty? Mam taka potrzebe. Prowadze duza korespondencje. Zgory dzieki.",
			"added": 1577974128
		},
		{
			"topic_id": 1577981477,
			"title": "Rosja-Militarnie.cz.1/2.",
			"body": "Duszenow 249\nAnonsowane tematy\n1.Nowe dane odnośnie rakiet „Sarmat ” i „Cyrkon” przekazane do publicznej wiadomości przez WWP. Jaki to ma cel?\n1. Z końcem roku zaszło zaostrzenie sytuacji tak w Syrii (Idlib) jak i Libii (ofensywa Haftara) Rola Rosji i znaczenie tych konfliktów dla rosyjskich interesów na BW.\n3.Omówimy możliwości USA w stworzeniu nowego pokolenia rakiet średniego zasięgu\nVideosiudżet o tym jak rosyjskie osiągnięcia w dziedzinie zbrojeń blokują możliwości ulubionego przez USA (zachód) prowadzenia wojen i o tym że ich nowa i modernizowana broń ,chociaż po parametrach lepsza to bez rozwiązań przełomowych. Powtórzona też jest wypowiedź szefa sztabu wojsk FR ,Gierasimowa że Rosja sobie zdaje sprawę z przygotowań NATO do konfliktu z Rosją.\n„Sarmata ” ,jak się okazuje ma zasięg 35.000km po trajektorii suborbitalnej co pozwoli w zasadzie atakować USA( i każdy pkt. na Ziemi) z dowolnego kierunku\nAtak przez biegun południowy to dla USA okrutnie nieprzyjemna sprawa bo od tamtej strony nie mają nic do obrony. Gołe podbrzusze.\nSą w sytuacji ciężko wystraszonego pacjenta u stomatologa co zasłania usta ręką ,zaciska zęby a ten mu wyrywa zęba przez odbytnicę (porównanie moje)\nW gosprogramie do 2027 będzie w gotowości bojowej 20pułków rakietowych co oznacza (dane przybliżone) 120 rakiet”Sarmata” Rakiety te wykorzystają szyby po rakietach „Wojewoda” Pozostało tych szybów około 60sztuk ,więc istnieje też możliwość że pułk to będą 3 takie rakiety aby zaoszczędzić na kosztach budowy szacht.\nWarto przytoczyć wypowiedź WWP taką ogólną bo o szczegółach to już wiele było i w zasadzie oprócz detali to się powtarzamy. ” Pierwszą bombę atomową wyprodukowało USA a ZSRR musiał gonić,pierwsze nosiciele,lotnictwo strategiczne to też dzieło USA i ZSRR musiał gonić. Pierwsze międzykontynetalne pociski balistyczne też powstały w USA i ZSRR gonił. Teraz jesteśmy w zupełnie innej sytuacji i to nas muszą gonić ”\nBardzo ważną sprawą jest ogólna modernizacja wyposażenia wszystkich wojsk Rosji. W tym roku przezbrojenie na broń współczesną osiągnęło 70%. Prawdziwe 70% a nie jakieś biurokratyczne szamaństwo. Jest pewna metodyka (tajna) ale wiadomo że parametr broni współczesnej jest taki aby ta broń wyprzedzała zachodnie analogii lub nawet ich nie miała. Broń ma być tak dobra aby uchroniła Rosję przed dowolnym zagrożeniem . Są też plany pięcioletnie i ten nowy 21-25 uwzględnia zmiany geopolityczne charakteryzujące się tym że wraz z degradacją siły militarnej zachodu wzrasta tam agresywna rusofobia. I dalej ocena że amerykańska armia przestała być skutecznym instrumentem polityki (nacisku) zewnętrznej USA. A wiemy z poprzednich wypusków i nie tylko, że Amerykanie wojują tylko specnazem od dziesięcioleci. Normalne wojska lądowe to pożal się boże co to za dziwaczny twór. W tym też planie zostanie przyziemniony „Cyrkon” i modernizowany „Kalibr”jako odpowiedź na ewentualne rozmieszczenie amerykańskich rakiet pośredniego zasięgu w Europie i Azji. Powoli też staje się wiarygodną informacja że wszystkie rosyjskie 13 brygad rakietowych jakie istnieją ,zostaną powiększone o dodatkowy dywizjon zapewne uzbrojony w rakiety średniego zasięgu. Jako ważne zadanie wskazał też WWP ciągłe zbieranie doświadczeń (min.Syria ale nie tylko) i na ich podstawie wdrażanie nowych zasad sztuki wojennej ,taktyki do ludzi do armii a nie do podręczników. Po WWP wystąpił też Szojgu z konkretami i podał trochę cyfr. Za 2019rok siły zbrojne Rosji zostały wyposażone w 624 czołgi i BWP. 163 nowe samoloty i śmigłowce. 13 aparatów kosmicznych. 1 atomowy okręt podwodny ( ale 4sztuki atomowców są tuż tuż na przyszły rok) 8 okrętów nawodnych 17 kutrów. 4kompleksy nadbrzeżne „Bał ” i „Bastion”\nKatastrofa Su-57 testującego nowe silniki w reżimie maksymalnych obciążeń. Samolot wszedł w niekontrolowany lot spiralny a pilot się katapultował. Czarne skrzynki odnaleziono ale na razie nic nie wiadomo więcej.\n20 Grudnia z USA przyszła informacja o wznowieniu produkcji F15. To takie pośrednie przyznanie że program F-35 jest nieudany i zapewne będzie powoli wygaszany.\nSyria (Idlib) i Libia. Omówienie infografik sytuacyjnych w Idlib. Porównanie zeszłorocznej i aktualnej. Co się wydarzyło i dzieje dalej to znamy na bieżąco.\nPodobnie na podstawie infografik rozpatrywana jest aktualna sytuacja w Libii. Tutaj tylko Duszenow zwraca uwagę na wstrzemięźliwość Rosji ,która czeka na rozwój sytuacji pomiędzy dwoma graczami GNA , Turcja ,Katar i z drugiej strony AS,Egipt i Haftar. Zapewne w odpowiednim czasie położy na wadze swój ciężar ,ale tylko wtedy kiedy ten ruch pozwoli poszerzyć wpływ w tym regionie.\nPrzechodzimy do trzeciego tematu czyli usmańskich możliwości stworzenia jakichś sensownych ,nowych rakiet średniego zasięgu. Jak pamiętamy zaraz po wyjściu z traktatu Amerykanie wykonali próbny start takiej rakiety i pochwalili się na cały świat. To była próba rakiety opartej na trzydziestoletniej technologii.(Persching) Start przeprowadzono z gołej platformy,niemobilnej. To bardziej taki propagandowy start ,podobny do startu starego morskiego Tomahawka z platformy lądowej jaki miał miejsce kilka miesięcy temu.\nVideosiudżet dla odmiany o flocie a konkretniej o okrętach serii „Jasień M” Usmany dostrzegli coś dla nich niepokojącego w tym projekcie. Boją się przewagi nad ichnią klasą „Virginia” a boli ich to że Rosja buduje szybciej i wielokrotnie taniej. Wspominają też ‚Posejdona ” i jego pierwszego nosiciela. Warto zaznaczyć że uzbrojenie na klasie „Virginia” to ciągle uzbrojenie poprzedniego pokolenia a rosyjskie „podłodki” dostają wszystko co aktualnie najlepsze ,współczesne.\nA teraz wiadomość najlepsze . Jakiś czas temu omawialiśmy w którymś wypusku papierowy manewr Trumpa aby wzmocnić liczebnie flotę. Stojąc przed problemem że buduje się mniej nowych okrętów niż wycofuje ze służby ,postanowił podnieść im „wiek emerytalny” i to dość znacząco bo od 30 do czterdziestuparu procent. Spowodowało to tylko taki efekt że przybyło „zaparkowanych” przy nadbrzeżach zardzewiałych koryt. Struktura finansowa machiny wojennej USA jest taka że czy coś pływa czy stoi to i tak generuje ogromne koszty. Z Pentagonu przychodzi decyzja o ostrym „riezaniu” . Planuje się wycofać od razu 13 z 22 sztuk rakietowych krążowników „Ticonderoga” i kilka desantowców aby odblokować ok. 10miliardów dolarów.\nRozpoczyna się sesja pytań bieżących ,z których w innym poście przedstawię najwartościowsze poruszane zagadnienia.",
			"added": 1577981475
		},
		{
			"topic_id": 1579820769,
			"title": "Gołąbek Pokoju z gałązką oliwną.",
			"body": "2020.01.24.03.text-Gołąbek Pokoju z gałązką oliwną.\n\nGołąbek Pokoju z gałązką oliwną.\n\nUSA kreuje się na strażnika demokracji na świecie i szeryfa świata. Przyjrzyjmy się jednak faktom, jak to naprawdę wygląda!\n1901-wprowadzenie wojsk do Kolumbii\n1902-najazd na Panamę\n1903-USA skierowały do Przesmyku Panamskiego okręty wojenne w celu izolowania Armii Kolumbijskiej\n1903-inwazja Hondurasu, Republiki Dominikany i Syrii\n1904-inwazja Korei, Maroko i Republiki Dominikany\n1904-1905-wojska amerykańskie interweniują w wojnie rosyjsko-japońskiej\n1905-wojska amerykańskie ingerują w rewolucję w Hondurasie\n1905-wprowadzenie wojsk do Meksyku (pomagano dyktatorowi Porfirio Diazowi w tłumieniu powstania)\n1905-wprowadzenie wojsk do Korei\n1906-inwazja amerykańska na Filipiny, stłumienie powstania narodowowyzwoleńczego\n1906-1909-amerykańskie wojska wkraczają na Kubę w czasie wyborów\n1907-wojska amerykańskie wprowadzają w życie protektorat „dolarowej dyplomacji” w Nikaragui\n1907-wojska amerykańskie interweniują w rewolucję w Republice Dominikany\n1907-wojska amerykańskie uczestniczą w wojnie Hondurasu z Nikaraguą\n1908-wojska amerykańskie wkraczają do Panamy podczas wyborów\n1910-Nikaragua. Wojska amerykańskie wkraczają do portów Bluifilz i Corinto\n1911-Amerykanie lądują w Hondurasie w celu wsparcia powstania pod wodzą byłego prezydenta Manuela Bonnity przeciwko legalnie wybranemu prezydentowi Miguelowi Davila\n1911-stłumienie antyamerykańskiego powstania na Filipinach\n1911-wprowadzenie wojsk amerykańskich do Chin\n1912-wojska amerykańskie wchodzą do Hawany (Kuba)\n1912-wojska amerykańskie wchodzą do Panamy podczas wyborów\n1912-napaść wojsk amerykańskich na Honduras\n1912-1933-okupacja Nikaragui, ciągła walka z partyzantami. Nikaragua przekształciła się w kolonię monopolu „United Fruit Company” i innych firm amerykańskich\n1914-wojska amerykańskie wchodzą do Republiki Dominikany, walki z powstańcami o Santo Domingo\n1914-1918-seria najazdów na Meksyk\n1914-1934-Haiti. Po licznych powstaniach Ameryka wprowadza swoje wojska, okupacja trwa 19 lat\n1916-1924-8-letnia okupacja Republiki Dominikany\n1917-1933-okupacja wojskowa Kuby, protektorat ekonomiczny\n1917-1918-udział w I Wojnie Światowej. Początkowo Ameryka utrzymuje neutralność czyli sprzedaje broń za astronomiczne kwoty, bogaci się niewyobrażalnie, przystępuje do wojny dopiero w 1917 roku to znaczy prawie przy samym końcu, straciła zaledwie 40 tysięcy ludzi (przykładowo Rosjanie 2 miliony) ale po wojnie ogłasza się głównym zwycięzcą\n1918-1922-interwencja w Rosji\n1918-1920-Panama. Po wyborach wprowadza wojska w celu pacyfikacji zamieszek\n1919-Kostaryka. Powstanie przeciwko reżimowi prezydenta Tinoco. Pod naciskiem USA Tinoco zrezygnował ze stanowiska prezydenta jednakże niepokoje w kraju nie ustały. Lądowanie wojsk USA w celu „obrony amerykańskich interesów”. Wybór na urząd prezydenta D. Garia. W kraju przywrócono rządy demokratyczne\n1919-wojska amerykańskie walczą po stronie Włoch przeciwko Serbom w Dalmacji\n1919-wojska amerykańskie wchodzą do Hondurasu podczas wyborów\n1920-Gwatemala. Dwutygodniowa interwencja\n1921-Amerykańskie wsparcie dla rebeliantów walczących o obalenie prezydenta Gwatemali Carlosa Herrero w interesie „United Fruit Company”\n1922-interwencja w Turcji\n1922-1927-wojska amerykańskie w Chinach podczas powstania ludowego\n1924-1925-Honduras. Amerykańskie wojska napadają na kraj podczas wyborów\n1925-Panama. Wojska amerykańskie rozpraszają i tłumią strajk generalny\n1926-amerykańska inwazja na Nikaraguę\n1927-1934-Na całym terytorium Chin stacjonują wojska amerykańskie\n1932-Salwador. Inwazja od strony morza. W tym czasie trwało powstanie\n1936-Hiszpania. Wprowadzenie wojsk podczas wojny domowej\n1937-pojedyncze starcie militarne z Japonią\n1937-Nikaragua. Z pomocą wojsk amerykańskich Somoza dochodzi do władzy obalając legalny rząd Sacasa. Somoza zostaje dyktatorem, członkowie jego rodziny rządzili krajem przez 40 lat\n1939-wprowadzenie wojsk do Chin\n1950-1953-wojna w Korei. W działaniach bojowych brało udział 350 tysięcy ludzi, 1 tysiąc czołgów, ponad 300 okrętów. Przeważającą część kontyngentu i sprzętu wojskowego dostarczyły USA\n1961, kwiecień-próba amerykańskiej inwazji na Kubę w rejonie Zatoki Świń w celu obalenia rządu Fidela Castro\n1965-1973-wojna w Wietnamie. Największy udział sił zbrojnych USA po II Wojnie Światowej\n1964-1973-operacja zbrojna USA przeciwko Frontowi Patet Lao w Laosie. Brało udział ponad 50 tysiące ludzi\n25 października 1983-czerwiec 1985-operacja wojskowa USA „Nagła furia” na Grenadzie w celu obalenia lewicowego rządu tego wyspiarskiego państwa\n1986, kwiecień-po wprowadzeniu sankcji ekonomicznych USA rozpoczęły akcje wojskowe przeciwko Libii. Zbombardowano dzielnice mieszkalne Trypolisu i Benghazi\n1989, grudzień-wojskowa operacja USA pod nazwą „Just Cause” w Panamie w celu usunięcia szefa kraju, prezydenta Noriegi, oskarżonego o handel narkotykami i o popieranie terroryzmu\n1991, 17 stycznia-28 lutego-operacja wojskowa USA i ich sojuszników, o nazwie „Pustynna burza”, w wyzwoleniu Kuwejtu od irackiej okupacji\n1991-1995 i 1998-1999-wojna etniczna w Jugosławii i agresja NATO przeciwko Federalnej Republice Jugosławii\n1993, 17 stycznia-USA rozpoczęły atak rakietowy na iracki obiekt gdzie , według twierdzeń Waszyngtonu, prowadzono prace nad bronią jądrową w odległości 20 kilometrów od centrum Bagdadu\n1993, 26 czerwca-USA dokonały uderzenia rakietowego w główny kompleks dowodzenia wywiadu irackiego w Bagdadzie w odpowiedzi na rzekome opracowanie przez Bagdad planów zabicia amerykańskiego prezydenta George’a Busha\n1996, 3 września-USA dokonały ataku rakietowego na Irak po tym jak wojska irackie przeprowadziły operację przeciwko Kurdom w rejonie Erbil na północy Iraku\n1998, 20 sierpnia-atak na „cele terrorystyczne” w Afganistanie i Sudanie w odpowiedzi na zamachy terrorystyczne na ambasady amerykańskie w Tanzanii i Kenii\n1999, 24 marca-operacja „Sojusznicza siła”. Interesujący jest zwłaszcza ten historyczny przegląd na tle tego jak zachowują się USA i sojusznicy w sytuacji kiedy jeden niepodległy kraj próbował spacyfikować jedną samozwańczą republikę\n2001, 7 października-Afganistan. USA przeprowadzają operację w Afganistanie w ramach operacji „Enduring Freedom”, rozpoczętej rzekomo w odpowiedzi na zamach terrorystyczny z 11 września 2001 roku\n2003, 20 marca-wojna iracka, konflikt który rozpoczął się od napaści sił USA i ich sojuszników na Irak w celu obalenia reżimu Saddama Husseina. Operacja nosiła nazwę „Iracka wolność”\n2008, sierpień-konflikt zbrojny w południowej Osetii. Nieudana próba USA rozpoczęcia wojny z Rosją z wykorzystaniem Gruzji\n2011, 19 marca-wojna w Libii. Pod wymyślonym i kłamliwym pretekstem stworzono powód do napaści na Libię",
			"added": 1579820766
		},
		{
			"topic_id": 1608360093,
			"title": "ZNALEZIONE w INTERNECIE.",
			"body": "ZNALEZIONE w INTERNECIE.\n\nAutor: . Piotr Raczek.\n*Znalezione, przedrukowane w całości. Część pierwsza*.\n.\nTrzeba mieć wiedzę, co nazywają wirusem. Niektórzy mówią, że Wi-Fi powoduje rozmnażanie wirusa, co jest nieprawdziwą informacją, choć ma wiele wspólnego z chorobą. Wi-Fi nie uruchamia wirusa, bo wirusy nie istnieją i nigdy nie istniały! Wi-Fi, czyli promieniowanie elektromagnetyczne zachowuje się jak patogen, oddziałując na komórki naszego organizmu, a wtedy komórka w celach obronnych przed zagrożeniem, produkuje egzosomy, czyli białka obronne walczące z zanieczyszczeniami powstałymi w wyniku promieniowania, bo organizm aby żyć musi się oczyścić, zneutralizować zanieczyszczenia w tzw. procesie recyklingu w Lizosomach. Kiedy egzosomy walczą z zanieczyszczeniami powstałymi po narażeniu na promieniowanie, wtedy zaczyna się proces podniesienia temperatury ciała, katar, inne dolegliwości. Gorączka pomaga w procesie recyklingu, również w wyrzuceniu toksyn przez skórę, a katar pomaga w wyrzuceniu toksyn ze śluzem, kaszel natomiast powoduje oczyszczanie płuc. To jest trochę tak jak przy generalnych porządkach w domu, które są uciążliwe, ale muszą być zrobione by dom mógł nadal być domem przyjaznym do życia. Naukowcy II kategorii, czyli ci wychowani na książkach pisanych na zlecenie korporacyjnych naukowców, wykrywają te egzosomy i nazywają je szkodliwymi wirusami, bo egzosomy prawie zawsze pojawiają się przy chorobie, a kiedy się nie pojawiają, bo komórka jest uśpiona z pewnych względów, wtedy organizm powoli będzie słabł i umierał, albo pojawi się zaburzenie procesu apoptozy i rak. Kiedy komórka ludzka nie wytwarza egzosomów, wtedy z pomocą przychodzi inny człowiek mający taką samą chorobę, tylko że jego komórki funkcjonują normalnie i wytwarzają egzosomy. Wtedy ten chory dawca zaraża egzosomem , czyli białkiem obronnym i kodującym zarazem, np. drogą kropelkową chorego biorcę i wtedy zakodowana obronnym egzosomem komórka biorcy, zaczyna prawidłowo reagować i walczyć z chorobą. Egzosomy mogą być uszkodzone poprzez sztuczną, genetyczną modyfikację i podane do krwioobiegu np. za pomocą szczepionki. Do tej pory prawie wszystkie szczepionki tzw. antywirusowe zawierały zmodyfikowane egzosomy (osłabione) czyli takie które tłumiły odpowiedź immunologiczną. Chory człowiek był osłabiony, ale jego komórka nie dawała pełnej odpowiedzi immunologicznej - egzosomalnej, co pozwalało łagodniej przechodzić chorobę, ale zawsze z negatywnym skutkiem dla chorego organizmu człowieka. Tak wywołano AIDS, gdzie zainfekowano narkotyki zmodyfikowanym egzosomem któremu odebrano całkowicie energię do działania i każda choroba była wtedy dla chorego zagrożeniem życia. Teraz chcą nam wszczepić zmodyfikowane egzosomy które inaczej będą działać od tych powodujących AIDS, czyli te z RNA mają być egzosomami za dużej energii i działać nadekspresyjnie. Kiedy pojawi się patogen, a może nim być zbyt dużej mocy promieniowanie elektromagnetyczne o działaniu ciągłym, wtedy komórka zakodowana zmodyfikowanym egzosomem, będzie dawać nad ekspresyjną odpowiedź, co może i często będzie doprowadzać do śmierci chorego. Ten trik zastosowano już w przeszłości w 1918 roku, kiedy uruchomiono na dużej gęstości mocy maszty z falami radiowymi i wyszczepiono wtedy setki tysięcy żołnierzy zmodyfikowanymi egzosomami kodującymi komórkę ludzką, co okazało się tragiczne w skutkach, a co ciekawe, to masowe zgony były tylko tam gdzie było oddziaływanie fal radiowych na dużej gęstości mocy.\n.\nKoniec części pierwszej.",
			"added": 1608360089
		},
		{
			"topic_id": 1608757149,
			"title": "Omijanie wielkiego chińskiego firewalla",
			"body": ".\n**Omijanie wielkiego chińskiego firewalla**\n.\nOmijanie wielkiego chińskiego firewalla Znalazłem następujące informacje na https://en.wikipedia.org/wiki/Internet_censorship_in_China#Evasion. Poniżej znajduje się bezpośredni cytat ze strony Wikipedii. Miejmy nadzieję, że ktoś uzna to za przydatne. Korzystanie z usługi VPN: Zdecydowane strony obchodzą cenzurę internetową w Chinach, używając serwerów proxy poza zaporą ogniową. Użytkownicy mogą obejść cenzurę i monitorowanie Wielkiej Zapory, jeśli mają działającą metodę połączenia VPN lub SSH z komputerem poza Chinami kontynentalnymi. Zgłaszano jednak zakłócenia w usługach VPN, a zwłaszcza bezpłatne lub popularne usługi są coraz częściej blokowane. Aby uniknąć głębokiej inspekcji pakietów i kontynuować świadczenie usług w Chinach, niektórzy dostawcy VPN wdrożyli zaciemnianie serwerów. Zmiana adresów IP: Blogi hostowane w usługach takich jak Blogger i Wordpress.com są często blokowane. W odpowiedzi niektóre usługi skoncentrowane na Chinach wyraźnie oferują zmianę adresu IP bloga w ciągu 30 minut, jeśli zostanie on zablokowany przez władze. Korzystanie z lustrzanej witryny internetowej W 2002 r. Obywatele Chin używali lustrzanego odbicia elgooG Google po tym, jak Chiny zablokowały Google. Modyfikowanie stosu sieciowego: W lipcu 2006 roku naukowcy z Uniwersytetu Cambridge twierdzili, że pokonali zaporę, ignorując pakiety resetujące TCP. Korzystanie z narzędzi odpornych na Tor i DPI Chociaż wielu użytkowników używa VPN do ominięcia Wielkiej Zapory Sieciowej w Chinach, wiele połączeń internetowych jest obecnie poddawanych głębokiej inspekcji pakietów, w której pakiety danych są szczegółowo analizowane. Wiele sieci VPN zostało zablokowanych przy użyciu tej metody. Blogger Gray One sugeruje, że użytkownicy próbujący ukryć użycie VPN przekazują swój ruch VPN przez port 443, ponieważ ten port jest również intensywnie używany przez przeglądarki internetowe do połączeń HTTPS. Jednak Gray zwraca uwagę, że ta metoda jest daremna w przypadku zaawansowanej inspekcji. Obfsproxy i inne dołączalne transporty pozwalają użytkownikom uniknąć głębokiej inspekcji pakietów. Sieć anonimowości Tor była i podlega częściowemu blokowaniu przez Wielką Zaporę Sieciową Chin. Witryna Tor jest blokowana, gdy uzyskuje się do niej dostęp przez HTTP, ale jest osiągalna przez HTTPS, więc użytkownicy mogą pobrać pakiet Tora z przeglądarką. Projekt Tor utrzymuje również listę serwerów lustrzanych witryn na wypadek, gdyby główna witryna Tor została zablokowana. Sieć Tor utrzymuje publiczną listę około 3000 przekaźników wejściowych; prawie wszystkie są zablokowane. Oprócz przekaźników publicznych, Tor utrzymuje mosty, które są przekaźnikami niepublicznymi. Ich celem jest pomoc ocenzurowanym użytkownikom w dotarciu do sieci Tor. Wielka zapora sieciowa usuwa prawie wszystkie adresy IP mostów rozpowszechniane za pośrednictwem bridges.torproject.org i poczty elektronicznej. Według artykułu badawczego Wintera opublikowanego w kwietniu 2012 r., Tę technikę blokowania można obejść, używając fragmentacji pakietów lub pakietu Tora obfsproxy w połączeniu z prywatnymi mostami obfsproxy. Mosty Tor Obfs4 nadal działają w Chinach, o ile adresy IP są odkrywane za pośrednictwem sieci społecznościowych lub mostów publikowanych samodzielnie. Tor działa teraz głównie w Chinach, używając meeksów, które działają przez front-end proxy hostowane w sieciach dostarczania treści (CDN) w celu zaciemnienia informacji przychodzących do i od źródła i miejsca docelowego, jest to rodzaj podłączanego transportu. Przykładami są Microsoft Azure i Cloudflare. Niezamierzone metody: W przeszłości powszechne było używanie funkcji pamięci podręcznej Google do przeglądania zablokowanych witryn. Jednak ta funkcja Google wydaje się być w pewnym stopniu blokowana, ponieważ dostęp jest teraz nieregularny i nie działa w przypadku zablokowanych witryn. Obecnie blokada jest w większości omijana przez używanie serwerów proxy poza zaporą ogniową i nie jest trudna do wykonania dla osób zdecydowanych to zrobić. Mobilna przeglądarka Opera Mini wykorzystuje podejście oparte na proxy, wykorzystujące szyfrowanie i kompresję w celu przyspieszenia pobierania. Ma to efekt uboczny, pozwalając na obejście kilku podejść do cenzury internetowej. W 2009 roku rząd Chin zakazał stosowania wszystkich wersji przeglądarki oprócz specjalnej chińskiej. Używając analogii do ominięcia filtrów słów kluczowych: W miarę, jak Wielki Chiński Firewall staje się bardziej wyrafinowany, użytkownicy stają się coraz bardziej kreatywni w sposobach unikania cenzury, na przykład poprzez używanie analogii do omawiania tematów. Co więcej, użytkownicy stają się coraz bardziej otwarci w kpieniu z nich poprzez aktywne używanie homofonów w celu uniknięcia cenzury. Usunięte witryny zostały „zharmonizowane”, co wskazuje, że cenzura internetowa sekretarza generalnego CPC Hu Jintao leży w szerszej idei stworzenia „Socjalistycznego Harmonijnego Społeczeństwa”. Na przykład cenzorzy są określani jako „kraby rzeczne”, ponieważ w języku chińskim to wyrażenie tworzy homofon dla „harmonii”. Korzystanie ze steganografii: Według redaktora The Guardian, Charlesa Arthura, internauci w Chinach znaleźli bardziej techniczne sposoby obejścia Wielkiego Chińskiego Firewall'a, w tym użycie Steganografii, praktyki polegającej na „osadzaniu przydatnych danych w czymś, co wygląda na nieistotne. Tekst dokumentu może być podzielone na bajty składowe, które są dodawane do pikseli niewinnego obrazu\nffect jest ledwo widoczny na zdjęciu, ale odbiorca może go wyodrębnić za pomocą odpowiedniego oprogramowania ”. Głosy: Rupert Murdoch ogłosił, że postęp w technologii komunikacyjnej stanowi „jednoznaczne zagrożenie dla totalitarnych reżimów na całym świecie”, a Ai Weiwei argumentował, że chińscy przywódcy „muszą zrozumieć, że nie mogą kontrolować Internetu, dopóki go nie wyłączy”. Jednak Nathan Freitas, pracownik Berkman Center for Internet and Society na Harvardzie i doradca techniczny Tibet Action Institute, mówi: „W Chinach rośnie poczucie, że powszechnie używane usługi VPN, które kiedyś uważano za nietykalne, są teraz dotykane”. W czerwcu 2015 roku Jaime Blasco, badacz bezpieczeństwa w AlienVault w Dolinie Krzemowej, poinformował, że hakerzy, prawdopodobnie z pomocą chińskiego rządu, znaleźli sposoby na obejście najpopularniejszych narzędzi prywatności w Internecie: wirtualnych sieci prywatnych lub VPN oraz Słup. Odbywa się to za pomocą szczególnie poważnej luki, znanej jako JSONP, której 15 usług internetowych w Chinach nigdy nie zostało załatanych. Dopóki użytkownicy są zalogowani do jednej z najlepszych chińskich usług internetowych, takich jak Baidu, Taobao, QQ, Sina, Sohu i Ctrip, hakerzy mogą ich zidentyfikować i uzyskać dostęp do ich danych osobowych, nawet jeśli używają Tora lub VPN. Luka nie jest nowa; został opublikowany na chińskim forum poświęconym bezpieczeństwu i sieci około 2013 roku.",
			"added": 1608757144
		},
		{
			"topic_id": 1609085684,
			"title": "PODWÓJNE - OBYWATELSTWO w RZĄDZIE.",
			"body": ".\n**Nie pełny spis przedstawicieli Rosyjskiej Elity**.\n.\n\n*Niekompletna lista przedstawicieli „Elity” Rządu - „Rosyjska Federacja”, którzy muszą odejść z powodu podwójnego i potrójnego obywatelstwa. Na końcu zdania jest podane drugie obywatelstwo. a nawet trzecie. Tacy mocno zabezpieczeni. Tak na wszelki wypadek*.\n.\nМинистр промышленности и торговли Денис Мантуров имеет ПМЖ Испании , - Hiszpania.\nМинистр труда и соцзащиты Максим Топилин имеет ВНЖ Болгарии, -Bułgaria.\nЗаместитель министра промышленности и торговли Георгий Каламанов имеет ВНЖ Великобритании , - Wielka Brytania.\nЗаместитель министра экономического развития Азер Талыбов имеет ВНЖ Франции, - Francja.\nЗаместитель министра финансов Алексей Лавров имеет ПМЖ Италии, - Italia.\nЗаместитель министра природных ресурсов и экологии Мурад Керимов имеет ПМЖ Франции и ВНЖ Кипра, - Francja, - Cypr.\nЗаместитель министра культуры Николай Овсиенко имеет ВНЖ Болгарии, - Bułgaria.\n**Члены Совета Федерации**:\nАндрей Турчак имеет ВНЖ Франции, - Francja.\nВалерий Пономарёв имеет гражданство Великобритании, - Wielka Brytania.\nБорис Невзоров имеет гражданство Кипра. - Cypr.\nАндрей Клишас имеет ПМЖ Швейцарии, - Szwajcaria.\nАрсен Каноков имеет ВНЖ Великобритании, - Wielka Brytania.\nЕлена Мизулина имеет ВНЖ Бельгии, - Belgia.\nАлександр Бабаков имеет гражданство Великобритании, - Wielka Brytania.\nСулейман Керимов имеет ПМЖ Франции, - Francja.\nГубернатор Еврейской АО Александр Левинталь имеет гражданство Израиля и гражданство Румынии, - Izrael, i - Rumunia.\nСергей Лисовский имеет гражданство Франции, - Francja.\n**Депутаты Государственной Думы**:\nВице-спикер Госдумы Владимир Жириновский имеет гражданство Испании, - Hiszpania.\nИгорь Лебедев ( сын Жириновского ) имеет грин-карту США, гражданство Испании и ПМЖ Швейцарии, - Hiszpania, - Szwajcaria. i -USA.\nМихаил Берулава имеет ВНЖ Чехии, - Czechosłowacja.\nИрина Роднина Грин-карта (возможно гражданство) США, - USA.\nДенис Кравченко имеет ВНЖ Греции, - Grecja.\nАлександр Жуков имеет ВНЖ Великобритании, - Wielka Brytania.\nАндрей Голушко имеет ВНЖ Франции, - Francja.\nГригорий Аникеев имеет гражданство Испании, - Hiszpania.\nАйрат Хайруллин имеет ПМЖ Испании, - Hiszpania.\nЛеонид Симановский имеет гражданство Израиля и ПМЖ Кипра, - Izrael, i - Cypr.\nРизван Курбанов имеет ПМЖ Турции, - Turcja.\nМихаил Щапов имеет ВНЖ Испании, - Hiszpania.\nАлександр Кравец имеет ПМЖ Черногории, - Czarnogora.\nГригорий Балыхин имеет ПМЖ Черногории, - Czarnogora.\nЕлена Бондаренко имеет ВНЖ Италии, - Italia.\nВячеслав Фетисов имеет гражданство США, - USA.\nВячеслав Никонов имеет гражданство США, - USA.\nНиколай Валуев, депутат Государственной Думы, имеет ПМЖ Испании, - Hiszpania.\nАлександр Ремезков имеет грин-карту США, - USA.\nНиколай Борцов имеет гражданство Великобритании, - Wielka Brytania.\nЛеонид Левин ( автор закона об иностранных агентах ) имеет гражданство Кипра, - Cypr.\n.\nhttps://zen.yandex.ru/media/muksunfm/putin-lishit-mandatov-parlamentariev-imeiuscih-inostrannoe-grajdanstvo-spisok-veroiatnyh-5fe4b33fb28ab778a78b9a78\n\n.\nPs.\nTo daje trochę do myślenia ???",
			"added": 1609085678
		},
		{
			"topic_id": 1609163095,
			"title": "ROSJA: NIESAMOWICIE MOCNE SŁOWA",
			"body": "ROSJA: NIESAMOWICIE MOCNE SŁOWA !!\n.\n André Ilnitsky, doradca rosyjskiego ministra obrony Siergieja Choïgou: COVID to projekt globalistów.\n16 grudnia Rada Federacji zorganizowała „okrągły stół” Komisji Tymczasowej Rady Federacji ds. Ochrony Suwerenności Państwa i Zapobiegania Ingerencjom w Sprawach Wewnętrznych Rosji (Prezydent – Andrey Klimov ) na temat „ Zagraniczne próby wykorzystania przestrzeni poradzieckiej / obcej bliskiej do destabilizacji systemu politycznego Rosji ”.\nW posiedzeniu „okrągłego stołu” uczestniczyli senatorowie – członkowie Komisji Tymczasowej Rady Federacji Elena Afanasyeva, Aleksandr Vaynberg, Margarita Pavlova, Vladimir Poletayev, członek Prezydium Rady Polityki Zagranicznej i Obronnej oraz pułkownik Służby Wywiadu Zagranicznego Andriej Bezrukow, członek Izby Publicznej Federacji Rosyjskiej Maria Butina, premier Ukrainy w latach 2010-2014 Nikolay Azarov, przewodniczący Komisji Stałej Izby Reprezentantów Zgromadzenia Narodowego Białoruś Andrey Savinykh, wiceprezes organizacji pozarządowej „ Belaya Rus ” Aleksandr Shatko, prezes bułgarskiej partii „ Odnowa Ojczyzny „(Utworzony na podstawie ruchu narodowego” Russophiles „) Nikolay Malinov, dyrektor komunikacji” Rossija Siegodnia „Piotr Lidov-Petrovsky i inni.\nAle to przemówienie doradcy Serge’a Shoigu, naukowca, publicysty, członka Rady Polityki Zagranicznej i Obronnej André Ilnitsky’ego, odbiło się największym echem.\n„ Zrównoważenie gospodarki i systemów zdrowotnych państw narodowych to główne zadanie projektu koronawirusa. Przeprowadzono go pomyślnie ”- powiedział doradca rosyjskiego ministra obrony Andriej Ilnicki.\nZachodnie koncerny postrzegają koronawirusa jako swój własny projekt, powiedział Ilnitsky. Zadanie polega na tym, aby wywrzeć duży wpływ na państwa na całym świecie i całkowicie zmienić życie ludzi poprzez surowe ograniczenia antykoronawirusowe.\nAndriej Ilnicki w swoim raporcie wskazał na próby wywierania presji na nasz kraj i inne kraje świata, które zdecydowały się zachować swoją suwerenność. Mówił m.in. o znanym zamkniętym forum w Davos, na którym dyskutowano o realizacji planu globalistów. Otwarcie ogłoszono, że pandemia koronawirusa powinna stać się narzędziem „globalnego resetu” i nikt nie powinien wracać do swojego starego życia.\nDemokrację trzeba budować na całym świecie – oczywiście w formie, która przemawia do organizatorów projektu. A ci, którzy chcą zachować państwa narodowe, powinni zostać pozbawieni korzyści: „ Nie pozwolimy na powrót świata sprzed koronawirusa, zadamy politykom pytania …” A kim jesteśmy? Międzynarodowe korporacje. Będą pytać o środki odstraszające, z których wynika, że ​​„ to nie covid jest zagrożeniem, ale środki, które są podejmowane na świecie ” – wyjaśnił Ilnitsky.\nPrzypomniał sobie formułę walki wirusa w wojnie biologicznej. Głównym wskaźnikiem wirusa w biologicznym ataku wroga jest zjadliwość, czyli zdolność do infekowania ludzkiego ciała. Tezy przedstawione przez Ilnitsky’ego zawarte są w książce Klausa Schwaba „ Covid-19: The Great Reset ”. Trzeba powiedzieć, że Schwab zorganizował Forum w Davos. W swojej książce nawołuje do świata rządzonego przez biznes.\n” A na tym świecie nie będzie miejsca dla państw narodowych. Już ich tam nie będzie. Cytat: „Jeśli rozwinie się demokracja i globalizacja, nie będzie miejsca dla państwa narodowego”. Oczywiście w pierwszej kolejności nie będzie miejsca dla suwerennej Rosji. Projekt Covid zasiał strach w ludziach, zburzył administrację Donalda Trumpa, podburzył państwa narodowe, nadwyrężył systemy opieki zdrowotnej… Spełnił swoje zadanie. Nawiasem mówiąc, formuła walki z wirusem, a dziś nie jest znana … To nie jest wirus zabójczy. Głównym wskaźnikiem wirusa jest zjadliwość, musi zaburzać równowagę systemów zdrowotnych wroga. A potem uruchamiane są zabójcze wirusy. To tylko informacja … Aby dalej rozmontowywać stary świat, globaliści potrzebują platform. „\nW szczególności platformy te powinny być „zieloną agendą”, digitalizacją i różnego rodzaju symulatorami ideologicznymi – od LGBT po BLM, które „ wejdą ” do państw narodowych i zakorzenią się.\nEkspert podkreślił zagrożenie, jakie stwarzają korporacje ponadnarodowe w stosunku do niepodległych państw. Ilnitsky wezwał deputowanych i senatorów Rady Federacji do odrzucenia projektów, które mogą zawierać potencjalne zagrożenie dla bezpieczeństwa narodowego Rosji.\n.\nMariusz Pomianowski (@Mariusz_marpom)",
			"added": 1609163088
		},
		{
			"topic_id": 1609539623,
			"title": "Blokada - Twittera, Facebooka i YouTube.",
			"body": "blokada - za cenzurowanie rosyjskich mediów.\n.\nLink do tekstu po rosyjsku, kto czyta bukwy?\n.\nhttps://diana-mihailova.livejournal.com/5916042.html\n.\nPutin podpisał ustawę blokującą Twittera, Facebooka i YouTube za cenzurowanie rosyjskich mediów .. W Rosji będą mogli blokować zagraniczne sieci społecznościowe. \n.  Prezydent Rosji Władimir Putin podpisał w środę 30 grudnia ustawę zakazującą cenzurowania portali internetowych. Za ograniczenie dostępu do rosyjskich mediów platformy zagraniczne będą podlegać sankcjom, w tym blokowaniu dostępu do nich. Zgodnie z dokumentem, zagraniczne platformy internetowe będą zagrożone środkami ograniczającymi dostęp do informacji o przynależności rasowej, narodowościowej i politycznej.\n Przepisy prawa dotyczą portali społecznościowych i dużych platform IT. Następnie zagraniczny zasób musi anulować cenzurę, a następnie poinformować o tym Roskomnadzor, a następnie Prokurator Generalny, w porozumieniu z Ministerstwem Spraw Zagranicznych, anuluje decyzję w sprawie środków. Jednocześnie prawo dotyczyć będzie także dużych portali społecznościowych  ** - Twittera, Facebooka i YouTube'a**. \nDokument przewiduje możliwość ich blokowania, spowolnienia ruchu oraz mandatów.\n.\nPs. Zmienili internet . To i zrobili kontr - Reakcje.",
			"added": 1609539615
		},
		{
			"topic_id": 1610339813,
			"title": "- PUTIN I ROSJA -",
			"body": "- PUTIN I ROSJA -\n.\nPoniżej artykuł ze Stalker Zone dla tych wszystkich tu na blogu, co stale szargają nazwisko Prezydenta Rosji. Ot tak sobie, bo im się tak podoba. A jeden gamoń co to 23%- Rosjan, którzy nie głosowali za wybraniem WWP  na prezydenta, uważa w swojej matematycznej bystrości tą mniejszość za większość narodu rosyjskiego. Powstaje pytanie gamoń? nieuk? czy może troll po podstawówce na dorabianiu tutaj paru groszy. Ach, co ja tam gadam, to przecież „biznesmen” z własną  firmą.\nPrzeczytajcie proszę, a zrozumiecie dlaczego takie miernoty jak? …  nienawidzą WWP , i większości ( ponad 76% ) Rosjan. Bo nie pozwolił takim jak on rozkradać Rosji i ma poparcie 2/3 społeczeństwa, które go wybrało. \nAle są w mniejszości i tacy, którzy „stracili pamięć”, zapomnieli co WWP \ndla nich i ich rodzin dobrego zrobił i narzekają, plują na niego i sprzedają siebie i swoją ojczyznę wrogom Rosji.\n………\nDużo ludzi już zapomniało, jak wiele Putin zrobił dla Rosji.\nSą w Rosji ludzie, którzy nie pamiętają, ile Putin zrobił dla Rosji:\nPo 17 latach Putin zwiększył budżet Rosji 22-krotnie, wydatki na wojsko \n30-krotnie, PKB 12-krotnie (  *skoczyła z 36. miejsca na świecie pod względem PKB na 6. miejsce* );\n48- krotny wzrost rezerw złota i walutowych!\nZwrócono 256,  złóż mineralnych pod rosyjską jurysdykcję ( do zwrotu pozostały jeszcze 3! );\nZakłócił najbardziej „liberalną” umowę o podziale produkcji w historii – PSA  ( *wyjaśnienie poniżej* );\nZnacjonalizowano 65%, przemysłu naftowego i 95%, gazu oraz wiele innych branż;\nPodniósł przemysł i rolnictwo ( *Rosja od 5 lat z rzędu zajmuje 2-3 miejsce na świecie pod względem eksportu zboża, wyprzedzając Stany Zjednoczone, które obecnie zajmują 4 miejsce* );\nWzrost średnich wynagrodzeń w sektorze publicznym 18,5- krotnie \nw ciągu 12 lat, a średnie emerytury 14-krotnie.\nCóż, dość drobiazgowy: Putin ( to właśnie on ) zmniejszył wymieranie ludności rosyjskiej z 1,5 mln osób rocznie w 1999 roku do 21 tys. w 2011 roku, czyli 71,5-krotnie.\n. Ponadto, Putin:\nAnulował porozumienie chasaworyckie – obronił tym samym integralność Rosji;\nujawnił 5. kolumnę organizacji pozarządowych i zakazał deputowanym do parlamentu posiadania kont za granicą;\n. Obronił Syrię;\n.  wojnę w Czeczenii.\nUnieważnienie przez Putina umowy o podziale produkcji ( PSA ) jest wielkim osiągnięciem!\nPSA to porozumienie, na mocy którego Ameryka plądrowała Rosję od lat 90. i w zamian Jelcyn otrzymał pożyczki. O jego zniesienie Putin walczył przez prawie 4 lata przy pomocy wielu kolejnych zmian. Tak więc zniesienie PSA wywołało w Ameryce niesamowitą nienawiść do Putina, który zabrał im nieskrępowaną grabież Rosji. Stąd nienawiść do Putina, ale niestety nie wszyscy o tym wiedzą.\nDlaczego Putin nie może zmienić wszystkiego na raz? Dlaczego on robi przymusowe przerwy? Dlaczego czasem musi dokonywać tymczasowych ustaleń?\nPonieważ panowie „Demokraci” w latach 90. stopili kraj, sprzedali go i pozwolili bękartom żyć kosztem rosyjskich zasobów naturalnych, zatwierdzili tysiąc zdradzieckich ustaw, w tym konstytucję z 1993 r. i tak bardzo osłabili kraj, że na początku lat 2000. Rosji trudno było oprzeć się Ameryce bez konsekwencji, więc Putin walczy z nimi stopniowo. Dlatego Putin musiał manewrować i robić wszystko stopniowo, nie w jednym momencie, ale w jednym kierunku, a teraz myśli także o tym, jak rozwiązać problemy Rosji i jednocześnie nie narażać jej na rozdarcie, jak to miało miejsce w Libii i Syrii.\nAmeryka od dawna jest zmęczona Putinem, który z godną pozazdroszczenia stałością odbiera im wpływy i obszar po obszarze, który obrabowali w Rosji, a następnie proponuje zastąpienie dolara inną walutą rozliczeniową… I to wszystko nie jest bez ryzyka… Na przykład: Kaddafi zapłacił życiem za pomysł zmiany waluty rozliczeniowej dolara na inną, teraz nie ma bogatej, kwitnącej Libii, nie ma Kaddafiego. Libia jest w ruinie…\nWiększość ludzi w latach 90-tych nie mogła po prostu pójść do sklepu i kupić większości produktów spożywczych, nie mogła wysłać swoich dzieci/chłopców do wojska bez obaw i strachu… Trwała wojna w Czeczenii. Był strach, bo nasi chłopcy ciągle gineli. Miasta były bez ogrzewania, gazu i wody. Nie wypłacano pensji, było pełno gangsterstwa, otwartej strzelaniny na ulicach. Żadnych emerytur, żadnej pracy, nic. Nikt nie myślał o poprawie warunków mieszkaniowych, remontach i tak dalej, cieszyli się, że żyją.\nTeraz, gdy zaszły zmiany na lepsze i większość ludzi zaczęła żyć znacznie lepiej, gdy podjazdy i podwórka są zatłoczone samochodami, a domy są remontowane, gdy trudno jest zobaczyć stare ramy okienne i drzwi wejściowe, gdy prawie wszystkie naprawy są wykonywane w mieszkaniach, w domach wszystko, co słychać to wiercenie, brzęczenie i młotkowanie, gdy nawet przeciętny człowiek nosi przepełniony worek ze sklepu spożywczego, gdy młode rodziny otrzymują rekompensatę części kosztów mieszkania, gdy wypłacany jest kapitał macierzyński i zasiłki macierzyńskie. A ludzie nie wyobrażają sobie już, jak nasze matki w latach 50. i 60. właśnie urodziły dziecko i poszły do pracy w 56. dniu po porodzie i nie było żadnej pomocy. Kiedy emerytury są dostarczane na czas i to stało się normą. I nie są one obniżane, jak w wielu krajach. Kiedy dla większości zarówno praca jak i wynagrodzenia są wydawane na czas. Kiedy w globalnym kryzysie, nie czujemy tego, prawdę mówiąc, ponieważ życie w naszym kraju w zasadzie nie zmienia się tak bardzo.\nA teraz, kiedy zaczęliśmy zapominać o latach 90-tych, zaczęliśmy stawać się coraz bardziej szorstcy i podatni na prowokacje. Rozumiem, że nie dało się zaobserwować tak dobrego samopoczucia jak teraz w latach 90-tych. Nawet jeśli ktoś pracował w latach 90. i był zajęty pracą przez 24 godziny, nie mógł w żaden sposób zarobić ani wyżywić rodziny. To było wtedy. A teraz, gdy nadeszły stopniowe zmiany i większość z nas zaczęła mieć się lepiej \n( *oczywiście nikt się nie spiera, każdy chciałby mieszkać w willi i dostawać dużo pieniędzy, ale niestety nigdzie na świecie nie ma czegoś takiego* ), po osiągnięciu lepszej sytuacji, z jakiegoś powodu zaczęliśmy zapominać, ile pracy i osobistego zaangażowania Putin zainwestował w rozwój naszego kraju, a mimo wszystko ludzie narzekają i ulegają wszelkim prowokacjom.\nTak, nie wszyscy mają się dobrze, nie wszystko zostało zrobione i jest dużo więcej do zrobienia, ale to nie jest powód do zdrady człowieka, który wyciągnął kraj z upadku! Co więcej, teraz ogromne siły i środki są zainwestowane w tych, którzy się mu sprzeciwiają.\nZróbmy więc, każdy na swoim miejscu, przynajmniej trochę dla rozwoju Rosji, pomóżmy jej, a nie pomagajmy tym, którzy otwarcie się sprzedają, sprzedają Rosję i działają przeciwko niej. Oni naprawdę nie chcą widzieć Putina jako **PREZYDENTA ROSJI!**\n Porozumienie Chasawjurckie było porozumieniem, które oznaczało koniec pierwszej wojny czeczeńskiej, podpisanym w Chasawjurcie w Dagestanie 30 sierpnia 1996 roku między Aleksandrem Lebiedem a Aslanem Maschadowem.\n.\nhttps://www.stalkerzone.org/some-dont-remember-how-much-putin-has-done-for-russia/\n.\nletlord ,  2021.01.10.",
			"added": 1610339804
		},
		{
			"topic_id": 1618366115,
			"title": "CIEKAWOSTKI ZE SWIATA.",
			"body": "CIEKAWOSTKI ZE SWIATA.\n.\nCiekawostki, ktore moga was zainteresowac? Krotki opis, a pod spodem link do tego tematu. W trzech jezykach, polski, angielski, rosyjski.Rozne tematy, polityka, zdrowie, historia, i na koniec Fim do obejrzenia. Milej lektury.\n\n\nRosja jest gotowa do odłączenia jej od systemów Visa i Master Card, oraz systemu SWIFT\n.\nhttps://ria.ru/20210413/kreml-1728049795.html\n.https://ria.ru/20210413/svift-1727969184.html\n…............................\nBiałoruś zamyka ambasady w „krajach nieprzyjacielskich”, w tym w Polsce\nhttps://ria.ru/20210411/lukashenko-1727535786.html\n…...........................\nTutaj wszyscy o tym wiedzą, ale nie zaszkodzi…\n.https://rumble.com/vfhy95-polski-lekarz-pracujcy-w-niemczech-obala-kamstwa-o-pandemii-i-koronawirusie.html\n…..........................\n25 zasad iluminatów, manifest bankiera, Nowy Testament Szatana są już rzeczywistością, a nie spiskiem …\n.https://panzer038.livejournal.com/1275830.html\n….............................\nMisja Obserwacyjna OBWE zgłosiła nowe przypadki zagłuszania sygnałów dronów w Donbasie.\nO tym informuje Radio Liberty .\nNależy zauważyć, że elektroniczne utrudnianie pracy bezzałogowego pojazdu dalekiego zasięgu, które powodowało zakłócenia z obu modułów pozycjonowania satelitów GPS jednocześnie, doprowadziło do konieczności awaryjnego lądowania.\nhttps://nv.ua/ukraine/events/bespilotnik-obse-na-donbasse-ne-smog-vzletet-iz-za-glusheniya-signala-novosti-ukrainy-50153290.html\n…....................................\nKatastrofa smoleńska – hipoteza wcale nie taka nowa. Od razu stwierdziłam, że jeśli był zamach, to sprawców trzeba szukać za oceanem. Tylko wątpię, żeby Antek się odważył. .https://strajk.eu/kto-zabil-polska-elite-pod-smolenskiem-mamy-nowe-slady/\n…......................................\nCovidowe szaleństwo : nie można wejść na pokład statków ratowniczych, dopóki nie zostaniesz zaszczepiony\n. https://www.sott.net/article/451303-Covid-madness-Cant-board-rescue-vessels-until-vaccinated\n…...................................\nUE chce do 25 czerwca wprowadzić tzw. paszport covidowy. Ułatwiłby podróże, ale i korzystanie z kin czy stadionów – pisze poniedziałkowa „Rzeczpospolita” i informuje, że Polska uczestniczy w procesie, który ma doprowadzić do wprowadzania w tym terminie zaświadczeń cyfrowych.\n.\nPolska uczestniczy w tym procesie, (podkreślam na marginesie), tym co to jeszcze jakieś złudzenia mają, oto co nam PiSPOieb w najbliższym czasie jeszcze w dom przeniesie…\nNa razie ,,zakolczykują” nas jak bydło w oborze,\na w najbliższej już przyszłości, niczym w filmie ,,Elizjum”, wszyscy będziemy ,,zaczipowani”, technologia ta jest przez DARPA już wdrożona.\n.\nhttps://sputniknews.com/us/202104121082602990-from-microchip-sensing-covid-to-filter-sucking-virus-from-blood-pentagon-touts-sci-fi-solutions/\n…..............................\nA dla relaksu film ,,Elizjum” w ramach wizualizacji czekającego nas w ,,Świetlanej Przyszłości” ziemskiego padołu dla mas i Elizjum na niebie dla elity z narodu wybranego.\nhttps://www.cda.pl/video/649890882\n…............................",
			"added": 1618366105
		},
		{
			"topic_id": 1618726346,
			"title": "POWTÓRKI  - NOWICZOK.",
			"body": "POWTÓRKI  - NOWICZOK.\n.\nZgodnie z obietnicą „zamówiony”\nPonieważ nie mam dostępu do oryginalnych danych, np. wyników badań, trudno o jednoznaczne konkluzje. Każdy może wyciągnąć wnioski sam. Na początku powtórka mojego starego tekstu.\nDŁUGIE\nNa prośbę Panów Komentatorów kilka słów na temat „afery z nowiczokiem”. temat jest bardzo ambitny, coś w rodzaju pomiarów grubości i szerokości tęczy, albo określenia wysokości fatamorgany. Postaram się jednak w miarę przystępnie opisać problem, gdyż dotychczas dostępne informacje można określić mianem pijacko-narkotycznych bredni. Przykre, że oprócz Głupiego Jasiu czy Szalonej Tereski, w ich rozpowszechnianiu biorą udział palanty i durnie z Pałacu Koniecpolskich.\nBojowy środek trujący („BŚT”) określany jako „nowiczok” (novitchok) nie jest bowiem wymieniony w aneksach do traktatu o zakazie produkcji i stosowania broni chemicznej. Zatem nie jest znany jego wzór chemiczny, toksyczność, dane fizykochemiczne. Jeśli został użyty i ZIDENTYFIKOWANY, pierwszą informacją powinna być ta o jego strukturze. Jak dotąd, wszystkie informacje na temat „nowiczoka” pochodzą od przekupionych przez CIA-USA tzw. „dysydentów” z Rosji. Ich relacje są niespójne, a część z nich to oczywiste bzdury, co udowodniono.\n„Nowiczok” ma być BŚT o działaniu paralityczno-drgawkowym. To ciekawa grupa BŚT, świetnie wpisująca się w tezę, że najefektywniejsze jest działanie w punktach krytycznych, cokolwiek by to nie oznaczało. Niestety, na wstępie trochę fizjologii.\nW organizmach żywych produkowany jest pewien związek, odpowiadający za przekazywanie impulsów z zakończeń nerwowych do odpowiednich receptorów, inaczej neuroprzekaźnik. To acetylocholina, prosty związek chemiczny, produkowany w komórce w dużych ilościach. Po wykonaniu misji, czyli przekazaniu impulsu, jest rozkładany, hydrolizowany przez enzym (białko) o nazwie acetylocholinoesteraza. Jest to chyba najszybciej działający enzym, jedna jego cząsteczka w ciągu sekundy rozkłada kilka tysięcy cząsteczek acetylocholiny.\nCzyli wniosek nr 1 – acetylocholinoesterazy w organizmie wystarczy niewielka ilość, a jako enzym nie ulega ona praktycznie zużyciu i w związku z tym nie istnieją w organizmie szybkie ścieżki wytwarzania tego enzymu.\nNatomiast sama acetylocholina w nadmiarze jest silną trucizna! Jej działanie można porównać do przyłożenia paralizatora i włączenia go na stałe. Objawy:\n.– zwężenie źrenic (do rozmiaru łebka od szpilki)\n.– rozszerzenie naczyń krwionośnych\n.– obniżenie ciśnienie krwi\n.– zwolnienie częstości akcji serca\n.– zmniejszenie siły skurczu mięśnia sercowego\n.– skurcze mięśni gładkich oskrzeli, jelit i pęcherza moczowego (bezwiedne wypróżnienie, oddanie moczu, duszenie się)\nCzyli typowe objawy zatrucia środkiem paralityczno-drgawkowym!!!!!!!!\nWniosek nr 2 – gazy paralityczno-drgawkowe de facto nie są trucizną, one tylko powodują, że organizm zatruwa się własnym produktem!\nSkąd takie działanie?\nGazy paralityczno-drgawkowe to organiczne związki fosforu, w których atom fosforu na piątym stopniu utlenienia jest połączony z 4-ma podstawnikami. Ten związek fosforu dość sprytnie „udaje” cząsteczkę acetylocholiny, przynajmniej z punktu widzenia enzymu acetylocholinoesterazy. Czyli cząsteczka acetylocholinoesterazy próbuje z cząsteczką BŚT zrobić to samo, co robi z cząsteczką acetylocholiny – rozłożyć. A tu ZONK – nie daje rady. co więcej, cząsteczka estru fosforowego uczepiła się enzymu jak rzep psiego ogona. Ilość uwalnianej z komórek acetylocholiny ciągle rośnie, nic jej nie rozkłada, bo acetylocholinoesteraza zablokowana, no i mamy denata.\nWniosek nr 3 – objawy zatrucia są praktycznie identyczne w przypadku zastosowania dowolnego BŚT z tej grupy i nie mogą posłużyć do identyfikacji użytej trucizny.\nPrzeciwdziałanie – podawanie:\n.– objawowe – atropina (silna trucizna!) przy niewielkim zatruciu aż do likwidacji zwężenia źrenic\n.– systemowe – podawanie tzw reaktywatorów acetylocholinoesterazy (zwykle związki z grupy oksymów) – wiążąc się trwale z cząsteczką BŚT uwalniają cząsteczkę acetylocholinoesterazy, która może podjąć normalną aktywność enzymatyczną.\nWniosek nr 4 – co podawano w szpitalu Skripalom?????????\nWykrywanie.\nStarsze BŚT z tej grupy (tabun, sarin, soman – w kolejności wzrostu toksyczności) są podatne na hydrolizę w środowisku zasadowym. po hydrolizie wykrycie kwasu fosforowego jest stosunkowo proste, służą do tego rurki wskaźnikowe wykazujące zmianę barwy przy kontakcie, w ramach PW miałem jeszcze zajęcia z takim wykrywaniem, oczywiście bez udziału BŚT!\nNatomiast grupa tzw VX jest na hydrolizę dość odporna, za co odpowiada atom siarki (zamiast tlenu) położony pomiędzy fosforem a podstawnikiem alkilowym. Dopiero jego utlenienie do sulfonu (wapno chlorowane czyli podchloryn, nadmanganian potasu itd.) ułatwia hydrolizę. Związki z tego grupy wykrywa się wyłącznie metodą enzymatyczną, przez określenie stopnia utraty aktywności acetylocholinoesterazy.\nWniosek nr 5 – jak wykryto „nowiczok” w GB??????\nA teraz próba zmierzenia się z pijacko-narkotycznymi bredniami.\nPodobno „nowiczok” zamiast atomu tlenu czy siarki połączonego z fosforem ma w tym miejscu atom azotu. Miałoby to utrudniać/uniemożliwiać wykrycie rurkami wskaźnikowymi. Jednak wiązanie fosforu z azotem nie należy do specjalnie mocnych i powinno hydrolizować w standardowych rurkach wskaźnikowych na obecność BŚT.\nPodobno „nowiczok” miałby być „bezpieczniejszy w stosowaniu”. Nie wiem, co napisać na tę brednię. Estry fosforowe bez trudu przenikają przez dowolną tkankę, nawet płytkę paznokcia, wszystkie brednie „The Times” czy „Daily Telegraph” o obecności BŚT w ubraniach w walizce Julii S., czy na drzwiach domu jej ojca, można potłuc o kant 4-ch liter.\nW pijackim żargonie może chodzi o możliwość bezpośredniej syntezy przed użyciem (dwufazowe BŚT)? Czyli jeszcze większa komplikacja stosowania przy drastycznym zmniejszeniu efektywności. Po co?\nNie stawiam kropki nad i, stawiam tylko pytania.\nNatomiast – Tetrodotoksyna TTX (https://pl.wikipedia.org/wiki/Tetrodotoksyna) trucizna ryby fugu (rozdymki) wprawdzie działa też we wrażliwym punkcie, ale w zupełnie innym miejscu – „udaje” kation sodu, choć jest kilkadziesiąt razy od niego większa. Trwale blokuje kanał sodowo-potasowy i uniemożliwia przekazywanie impulsów nerwowych, dlatego też jej skrajnie wysoka toksyczność.\nTu krótkie wyjaśnienie.\nPrzewodzenie impulsów nerwowych (wg literatury):\nW przewodzeniu impulsów nerwowych zasadniczą rolę odgrywa błona komórkowa neuronów, dlatego zasadę wyjaśniającą przebieg tego procesu nazywamy teorią membranową.\nW niepobudzonym neuronie błona komórkowa jest spolaryzowana, co określamy jako polaryzację spoczynkową. Na powierzchni ma ładunek dodatni (przeważają kationy sodu i aniony chlorku), a od strony cytoplazmy ujemy (przeważają kationy potasu). Ta różnica potencjałów między zewnętrzną, a wewnętrzną strona błony, który wynosi –70 mV nazywa się potencjałem spoczynkowym i jest uwarunkowana różną przepuszczalnością dla jonów (kationy potasu i aniony chlorku swobodnie dyfundują przez błonę, przepuszczalność dla kationów sodu jest stosunkowa niska) oraz działaniem pompy sodowo-potasowej (aktywny transport jonów sodowych na zewnątrz i jonów potasowych do wnętrza).\nPod wpływem silnego bodźca dochodzi do chwilowej zmiany właściwości elektrycznych błony, co określamy jako jej depolaryzację. Zmiana ładunku elektrycznego (po stronie zewnętrznej jest ładunek ujemny, a po wewnętrznej dodatni ) spowodowana jest otwarciem kanałów jonowych, w skutek czego sód wnika do wnętrza komórki, a potas przedostaje się na zewnątrz. W tym stanie potencjał czynnościowy wynosi ok. +40 mV. W miejscu, w którym przeszedł impuls nerwowy następuje repolaryzacja błony komórkowej, czyli powrót do stanu pierwotnego. Kanały jonowe zostają zamknięte, a pompa sodowo-potasowa transportując jony przywraca potencjał spoczynkowy. Impuls nerwowy przemieszcza się wzdłuż błony od perikarionu w kierunku zakończenia aksonu jako fala depolaryzacyjna.\nPewną modyfikacją tego procesu jest przewodzenie impulsów nerwowych we włóknach mielinowych (dwuosłonkowych), w których impulsy przekazywane są skokowo (przeskakują od jednego przewężenia do drugiego), dzięki czemu przewodzone są znacznie szybciej (do 120 m/s) niż we włóknach bezmielinowych , gdzie fala depolaryzacyjna ma charakter ciągły.\nJak wynika z powyższego schematu, zablokowanie kanałów sodowych w osłonce włókna nerwowego uniemożliwia proces depolaryzacji poprzez wstrzymanie transportu jonów sodu i potasu poprzez osłonkę włókna nerwowego, a więc uniemożliwia propagację impulsu elektrycznego wzdłuż włókna nerwowego.\nObjawy – utrata czucia, w skrajnym przypadku paraliż i śmierć przez uduszenie. TTX nie przenika przez barierę krew-mózg, więc nie wpływa w znaczącym stopniu na procesy mózgowe – zatruty jest praktycznie cały czas świadomy.\nPonieważ śmieć następuje przez wstrzymanie oddychania, typowym sposobem postępowania jest wymuszenie sztucznego oddychania, gdyż TTX w ciągu ok. 24 h ulega samorzutnemu rozkładowi w organizmie człowieka. Zatrucie TTX objawowo jest podobne do zatrucia takimi alkaloidami, jak strychnina, brucyna czy klasyczna cykuta z szaleju jadowitego – patrz opis agonii Sofoklesa. Natomiast trudno mówić o podobieństwie z zatruciem środkami paralityczno-drgawkowymi. Czy środki paralityczno-drgawkowe powodują trwałe następstwa – nie wypowiem się. Wiele może zależeć od dawki i rodzaju trucizny. Logicznym wydaje się występowanie takich nieodwracalnych skutków, jak uszkodzenia wiązadeł, uszkodzenia mięśni, w tym sercowego, uszkodzenia wzroku.\nNatomiast żadna z wymienionych wyżej trucizn nie powoduje halucynacji. A o halucynacjach u Nawalonego mówiła w trakcie konferencji prasowej jedna z brytyjskich „lekarek”.\nI na koniec mała anegdota telewizyjna. Może znacie serial „Komisarz Alex”, będący kalką austriacko-włoskiego tasiemca „Komisarz Rex”. W jednym z odcinków para bezdomnych włamuje się do wagonu na bocznicy i otwiera skrzynkę z dziwną przesyłką. Mężczyzna, który przyglądał się przesyłce, w ciąga paru minut dusi się na śmieć. I tu sedno – wg niedouczonego scenarzysty był to „gaz” paralityczno-drgawkowy, ewidentna bzdura, gdyż scenarzysta nie skorzystał z ani jednego objawu działania tych BŚT. Na moją znajomość tematu można byłoby mówić co najwyżej o zatruciu fosgenem (środek duszący).\nWniosek: paralityczno-drgawkowe BŚT są „modne” i łże-mendia, łże-lekarze i łże-politycy bardzo lubią podcierać sobie nimi swój brudny tyłek.\nPS\nJakby nie kombinować, to na pewno potrzebny jest:\nPCl3, PCl5 albo POCl3.\nTe dwa odczynniki, kiedyś łatwo dostępne, objęte są wyjątkowo ostrymi restrykcjami w handlu.\nAle od czego pomysłowość:\n.https://docer.pl/doc/s0e0eec\npozwala pobrać PDF „Preparatyki nieorganicznej” Janusza Supniewskiego.\nPrecyzyjny opis wytwarzania tych surowców.\nSama synteza BŚT „Bojowe środki trujące : zarys chemii i technologii” J. Grochowski, J. Woliński.\nPozycja dostępna na pchlich targach, antykwariatach i bibliotekach Szkół Rolniczych, Wydawnictwo MON 1960.",
			"added": 1618726335
		},
		{
			"topic_id": 1618791207,
			"title": "NASZE  JEDZENIE  CODZIENNE.",
			"body": "Dodatki do naszego Jedzenia – E- kody.\n.\nJest to link do spisu , E - Kody. Bardzo wazny temat naszego zycia. Warto te numerki zapamietac, bo one decyduja o naszym zdrowiu i zyciu. Mozna powiedziec cala tablica Mendelejewa. Kto sie uczyl chemi, ten to zrozumie. A pozostali niech sie zaczna jej uczyc, napewno im to sie przyda.\n.\nhttp://127.0.0.1:43110/1PoLsKaf9eRbXEVZvQA4R5jRdDg2K65mPz/index.html?v=topic+id=1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1topic2",
			"added": 1618791195
		},
		{
			"topic_id": 1619237581,
			"title": "WYROK SADU w USA.",
			"body": "W Stanach Zjednoczonych Sąd Najwyższy odwołał powszechne szczepienia. Bill Gates, amerykański główny specjalista ds. Chorób zakaźnych Fauci i Big Pharma przegrali proces przed Sądem Najwyższym Stanów Zjednoczonych, nie udowadniając, że wszystkie ich szczepionki w ciągu ostatnich 32 lat były bezpieczne dla zdrowia obywateli! Pozew został złożony przez grupę naukowców pod przewodnictwem senatora Kennedy'ego. Robert F. Kennedy Jr .: „Nowej szczepionki COVID należy unikać za wszelką cenę. Pilnie zwracam uwagę na ważne kwestie związane z kolejną szczepionką przeciwko Covid-19. Po raz pierwszy w historii szczepień tzw. Szczepionki mRNA najnowszej generacji bezpośrednio ingerują w materiał genetyczny pacjenta i tym samym zmieniają indywidualny materiał genetyczny, jakim jest manipulacja genetyczna, która była już zakazana i wcześniej uznawana za przestępstwo . SZCZEPIONKA na koronawirusa NIE JEST SZCZEPIONKĄ! UWAGA! Co zawsze było szczepionką? Zawsze był to sam patogen - drobnoustrój lub wirus, który został zabity lub atenuowany, czyli osłabiony - i był wprowadzany do organizmu w celu wytworzenia przeciwciał. Nawet szczepionka na koronawirusa! Wcale nią nie jest! Jest częścią najnowszej grupy mRNA (mRNA) rzekomo „szczepionek” Po wejściu do ludzkiej komórki mRNA przeprogramowuje normalne RNA / DNA, które zaczyna wytwarzać kolejne białko. Oznacza to, że nie ma to nic wspólnego z tradycyjnymi szczepionkami! Oznacza to, że jest to instrument wpływu genetycznego. Broń genowa! Oznacza to, że zamierzali zniszczyć ludzi, a ci, którzy przeżyją, staną się GMO! Po bezprecedensowej szczepionce mRNA zaszczepieni nie będą już w stanie leczyć objawów szczepionki w dodatkowy sposób. Osoby zaszczepione będą musiały pogodzić się z konsekwencjami, ponieważ nie można ich już wyleczyć po prostu usuwając toksyny z ludzkiego organizmu, jak u osoby z wadą genetyczną, taką jak zespół Downa, zespół Klinefeltera, zespół Turnera, genetyczna niewydolność serca , hemofilia, mukowiscydoza, zespół Retta itp.), ponieważ wada genetyczna jest na zawsze! To wyraźnie oznacza: jeśli po szczepieniu mRNA pojawią się objawy szczepienia, ani ja, ani żaden inny terapeuta nie możemy Ci pomóc, ponieważ USZKODZENIA SPOWODOWANE SZCZEPIENIAMI BĘDĄ GENETYCZNIE nieodwracalne....",
			"added": 1619237568
		},
		{
			"topic_id": 1619507046,
			"title": "Rosja — Internet.",
			"body": "Rosja — Internet.\n\nRosyjski wywiad cywilny SVR uruchomił dedykowaną stronę na Torze\n.\nPo raz pierwszy na ten temat wypowiedział się the record. Rosyjski wywiad cywilny (SVR) uruchomił specjalną stronę na Torze, dzięki której można “bezpiecznie i anonimowo przekazywać informacje dotyczące zagrożeń dla bezpieczeństwa Federacji Rosyjskiej”:\nKrótka instrukcja użytkowania nowej strony SVR na Torze\nSama strona prezentuje się następująco:\nPrzed wysłaniem wiadomości należy wygenerować odpowiedni “kod” składający się z ciągu 5-ciu losowych fraz. Metoda ta ma swoją nazwę – “łańcuchy Markowa”, więcej na ten temat można przeczytać w poradniku sekuraka.\n.\nNastępnie, w fazie “logowania”, należy podać wcześniej wygenerowany kod oraz przepisać captchę:\n.\nI gotowe, teraz każdy jest w stanie bezpiecznie wysłać swoją wiadomość:\n.\nChoć kod źródłowy na którym oparta jest strona SVR, nie jest znany, to podobną funkcjonalność zapewnia chociażby projekt “Securedrop”:\n.\nJak sądzicie, czy inne kraje (w tym Polska) powinny pójść śladem SVR i uruchomić podobną usługę? Dajcie znać w komentarzach!\n.\n- Jakub Bielaszewski \n.\nps.  Sa do tego zdjecia, ktorych nie moge dolaczyc. Calosc stanowi ciekawy przejaw nowego zabezpieczenia, nowego internetu budowanego w Rosji. To tylko pokazuje zaawansowane prace nad internetem przyszlosci.",
			"added": 1619507032
		},
		{
			"topic_id": 1619526269,
			"title": "Ratownik medyczny.",
			"body": "Ratownik medyczny.\n\nLink do niego podesłano mi już 15 kwietnia. Niby jest też wściekle atakowany i „demaskowany” przez oficjalne łże media –\nJest to jednak podstępna forma uwiarygadniania filmu w oczach niezależnych – skoro jest tak atakowany – musi mówić prawdę. A tymczasem naszpikowany jest kłamstwami. I tak już na początku ów „ratownik medyczny” stwierdza, że świrus covid istnieje naprawdę:\n„Oczywiście że nie kwestionuję istnienia covidu. Koronawirus jest. Jest to rzeczywiście inna odmiana wirusa niż mieliśmy do czynienia A tymczasem do dzisiaj tego świrusa nie wyizolowano. I nie ma żadnej pandemii – nawet „łado tej pory.”\ngodnej”, o czym gadał ów „ratownik”. Bredził też, że na początku wszyscy dali się owym świrusem zastraszyć:\n„I o ile był na początku strach, bo był, to na chwilę obecną nie wiem, dlaczego nie uczymy się na błędach i nie zauważyliśmy, że śmiertelność tej choroby to nawet nie jest 2% jak podają niektóre źródła.”\nJa ani przez sekundę nie wierzyłem w świrusa, pandemię i u mnie nie wywołał on strachu. Już w lutym 2020 demaskowałem oszustwo owej fikcyjnej pandemii:\nhttps://opolczykpl.wordpress.com/2020/02/09/oszustwo-z-grozna-epidemia-domniemanego-koronawirusa/\nI o jakiej „śmiertelności tej choroby” on bredzi: świrusa nie wyizolowano, obdukcji zwłok u zmarłych rzekomo na świrusa nie przeprowadza się, tak więc wszystkie statystyki zgonów rzekomo na świrusa brane są z sufitu. Tak samo statystyki rzekomych infekcji brane są z sufitu i służą wyłącznie nakręcaniu pandemii strachu i przerażenia. No i gadał jeszcze ów ratownik o testach, które za sprawą soli fizjologicznej zawyżają statystyki „infekcji”. Niemniej z jego wypowiedzi wynika, że gdyby testy robiono przy pomocy właściwych buforów, wyniki byłyby wiarygodne. A tymczasem powinien wiedzieć, że wszystkie stosowane i zalecane testy na świrusa, czy to antygenowe, czy PCR absolutnie nie nadają się do diagnostyki. Robi się je po to, by produkować fikcyjne liczby infekcji i zgonów, zastraszać tymi liczbami ludzi i nasilać covidowy terror i totalitarny zamordyzm. A już jego wypowiedź o ludobójczym koktajlu big pharmy całkowicie go zdemaskowała:\n„Nie mam nic do szczepień. Natomiast w tym wypadku, dlatego że nie ufam tej szczepionce… mam prawo nie ufać tej szczepionce. Jest zastanawiający również krótki okres produkcji tej szczepionki. Natomiast jeśli okaże się ona fantastyczna, to w przyszłości nie będę miał z tym oporu.”\n*Natomiast jeśli okaże się ona fantastyczna…\nCzyżby nie znał opinii setek niezależnych lekarzy i genetyków odnośnie tej broni biologicznej? Bo owe „szczepionki” to rzeczywiście jest broń biologiczna z opóźnionym zapłonem, choć u starszych ludzi oraz osób chorowitych i uczulonych działa piorunująco szybko. Jak może „ratownik medyczny” przypuszczać, że ten ludobójczy koktajl big pharmy mógłby okazać się „fantastyczny”…\nDodatkowo i nie przypadkowo film ów wyemitował kanał Wojciecha Sumlińskiego, którego już lata temu zdemaskowałem jako agenta wpływu. Sumliński, niby „dziennikarz śledczy” przez lata kolportował brednie Macierewicza/Singera i agenta wpływu Michalkiewicza o tym, że niby WSI to ruska agentura. Dodatkowo twierdził i pisał o tym nawet książki, że i Bul Komorowski (i cały POsrael) to też „ruska agentura”. Tymczasem temu „dziennikarzowi śledczemu” umykały takie fakty jak ten, że np. genialny wynalazek Lucjana Łągiewki, zarekwirowany w roku 2000 przez WSI syn wynalazcy odnalazł w … Izraelu.\nFilm o tym wielokrotnie kasowany był na yt ale mimo to, przetrwał w sieci:\n\nOtóż – gdyby WSI była ruską agenturą, wynalazek Łągiewki wylądowałby w Moskwie, a nie w Izraelu. I jakoś tego faktu „dziennikarz śledczy” Sumliński nie zauważył. Nie zauważył też, że Bul Komorowski zamiast tańczyć z „Ruskimi” w Belwederze kazaczoka rok w rok urządzał chanukowe harce.\nI że jego dzieci, za sprawą jego żony, mają prawo powrotu do Izraela. Takim to „ruskim agentem” był Bul Komorowski. Oczywistym zadaniem agenta wpływu Sumlińskiego było sianie dezinformacji i szczucie na Rosję, która rzekomo za sprawą szpiegów i służących jej zdrajców szkodziła Polsce.\nFilm z kanału Sumlińskiego zdemaskował także Piotr Bein:\nhttps://piotrbein.net/2021/04/18/sumlinski-producent-covido-hasbary/\nW sumie film „Spowiedź ratownika” to naprawdę „fachowa” robota agentury wpływu (Sumlińskiego i „ratownika”), dobrze wyreżyserowana. Niby niezależny „ratownik medyczny” objawia „prawdę”. Zmieniony głos, twarz niewidoczna, no bo by go mógł dopaść i zamordować za takie „prawdy” seryjny samobójca. A jakie to „prawdy” głosił?\n– Pandemia jest, choć mniej groźna niż gadają łże-media. Tymczasem nie ma żadnej pandemi.\n– Jest także świrus covid – on istnieje. A go jak dotąd nie wyizolowano.\n– Testy na świrusa są OK, byleby bez soli fizjologicznej. A tymczasem wszystkie testy na świrusa to ewidentne oszustwo.\n– No i ludobójczy koktajl big pharmy może okazać się „fantastyczny”. Owszem jest fantastyczny dla big pharmy – takich zysków nie miała dotąd nigdy.\nPrzeraża mnie to, że na kanał agenta wpływu Sumlińskiego i na bzdety „ratownika medycznego” dało się nabrać aż tylu ludzi. Tu muszę niestety stwierdzić, że podobnych dezinformatorskich filmów, rzekomo demaskujących działania władz okupanta, jest znacznie więcej. Jednym z nich, szczegółowo opisanym przez Piotra Beina jest wywiad z lekarzem Pawłem Basiukiewiczem:\nhttps://piotrbein.net/2021/04/24/pawel-basiukiewicz-zbrodniarz-przeciwko-staruszkom/\nPod filmem jest cała masa komentarzy wynoszących owego lekarza pod niebiosa. A tymczasem ja nazwałbym go Basiukiewiczem-Mengele. Bo jak go inaczej nazwać, skoro zaleca „zaszczepić” ludobójczym koktajlem zwanym „szczepionką” wszystkich ludzi starszych oraz osoby chorowite? Jak można takiego konowała, łapiducha tak wychwalać? Wszak jako lekarz ma obowiązek wiedzieć, czym jest ów koktajl big pharmy wyprodukowany w ekspresowym tempie, naruszającym wszelkie możliwe procedury medyczne.\nOgłupianie ludzi przy pomocy niby niezależnych ekspertów i kanałów internetowych idzie pełną parą. Tylko nieliczni nie dają się na siane przez nie brednie nabierać. Jak to wszystko się skończy?\nProtesty to słabną, to narastają. Podrzucono mi migawkę z Londynu z masowej demonstracji w dniu 24 kwietnia 2021:\nBrawo Londyńczycy. Tylko milionowe tłumy na ulicach powstrzymać mogą narzucany nam nowy, totalitarny, niewolniczy porządek świata.\n.\nopolczyk",
			"added": 1619526254
		},
		{
			"topic_id": 1620938699,
			"title": "PRZEJĘCIE POLSKI PO PANDEMII – TAJEMNICA SPISU POWSZECHNEGO 2021.",
			"body": "PRZEJĘCIE POLSKI PO PANDEMII – TAJEMNICA SPISU POWSZECHNEGO 2021.\n\nSPIS POWSZECHNY CZYLI PRZYGOTOWANIE IZRAELA DO ZAGOSPODAROWANIA MIENIA POLAKÓW PO PANDEMII. BY TEGO DOKONAĆ ŻYDZI MUSZĄ UTRZYMAĆ WŁADZĘ PRZEZ TRZY KADENCJE, PO TO IM POTRZEBNE SĄ PIENIĄDZE Z FUNDUSZU ODBUDOWY\nOto fragment rozmowy jaką przeprowadziła dziennikarka Dziennika Zachodniego Teresa Semik z z-cą dyr.Wojewódzkiego Urzędu Statystycznego w Katowicach Grażyną Witkowską 25.05.2012 roku\nTeresa Semik : To prawda, że dane ze spisu z 2011 roku będą przechowywane w Izraelu ?\nGrażyna Witkowska : Do dwóch lat pozostaną w Polsce, póki nie ogłosimy wszystkich wyników. Potem w formie zagregowanej przekażemy je Unii Europejskiej, a ona zdecydowała, że dane pozyskane we wszystkich krajach członkowskich będą przechowywane na serwerach w Izraelu.\nCzy sądzicie że inaczej będzie ze spisem w roku 2021 ? Oczywiście rząd PIS się wszystkiego wyprze, ale trzeba pamiętać, że zgodnie z Talmudem oszukać goia to rzecz chwalebna, a cała rodzina Morawieckiego, członkowie rządu PIS z Kaczyńskim na czele, to ortodoksyjni Żydzi, po talmudycznych szkołach. Nie dziwmy się sojuszowi Kaczyńskiego z Zandbergiem, jak pisałem działają wspólnie i w porozumieniu nie od dziś i we wspólnym celu.\nCzy wszystko zaczyna układać się w logiczną całość ? Pisałem o tym, że PIS, zaraz po przejęciu władzy PIS zmienił ustawę o zasadach pobytu wojsk obcych na terytorium RP dopuszczając do Polski wojska i służby specjalne Izraela. Po 2015 roku zaroiło się w Polsce od żołnierzy i oficerów Mossadu.\nDrugi dzwonek ostrzegawczy to przejęcie przez żołnierzy Mossadu kontroli polskich lotnisk. Następny to plan budowy Wielkiego Lotniska Centralnego Portu Lotniczego, lotniska przerzutowego dla Żydów z Izraela.\nKolejny sygnał ostrzegawczy to przekazywanie przez rząd PIS miliardów z wyrębu lasu dla środowisk żydowskich w USA. Według moich szacunków trafiło tam już około 150 mld USD. I jeszcze jeden, nowelizacją ustawy o kombatantach oraz niektórych osobach będących ofiarami represji wojennych dodano art. 24a zgodnie z którym tysiące ocalałych Żydów, ich małżonkom, a nawet dzieciom zamieszkującym poza naszym krajem przysługuje emerytura z tytułu szkód doznanych ze strony nazistów i bolszewików na ziemiach polskich w czasie wojny i okresu stalinowskiego. Z ustawy tej wynika że Polacy mają płacić za zbrodnie Niemców i Rosjan Żydom.\nRząd PIS masowo przyznaje Żydom obywatelstwa polskie, choć nawet nie znają języka. W ciągu ostatniej dekady ponad pięciokrotnie wzrosła liczba mieszkańców Izraela, którzy otrzymali polskie paszporty. Nawet 90 proc. z nich nie mówi nawet po polsku, ani nie ma w planach przeprowadzki do naszego kraju ( na razie ).\nTeraz przejdźmy do sedna, jakie dane chcą od Polaków Żydzi z PIS podczas spisu w roku 2021 ? Lista może zszokować, dokładność i zakres danych budzą najwyższy niepokój. Wygląda na to że ktoś szykuje się do ataku na Polskę :\ntytuł prawny do gospodarstwa domowego, do zajmowanego mieszkania, rodzaj pomieszczeń mieszkalnych, stan zamieszkania mieszkania, własność mieszkania, liczba osób w mieszkaniu, powierzchnia użytkowa mieszkania, wyposażenie mieszkania w urządzenia techniczno-sanitarne, rodzaj stosowanego paliwa do ogrzewania mieszkania, tytuł prawny do zamieszkiwania w mieszkaniu, rodzaj budynku, w którym znajduje się mieszkanie, stan zamieszkania budynku, wyposażenie budynku w urządzenia techniczne, powierzchnia użytkowa mieszkań w budynku, liczba izb w budynku, własność budynku, liczba mieszkań w budynku i wreszcie – rok wybudowania budynku.\nfakt przebywania kiedykolwiek za granicą, kraj i miejsce zamieszkania osób, które kiedykolwiek wyjeżdżały za granicę, przynależność narodowa lub etniczna, wyznanie, język, w którym mieszkańcy posługują się „w kontaktach domowych”.\nbieżący status aktywności zawodowej – pracujący, bezrobotni, bierni zawodowo, lokalizacja miejsca pracy, rodzaj działalności zakładu pracy, zawód wykonywany, status zatrudnienia, wymiar czasu pracy, rodzaj źródła utrzymania osób, rodzaje pobieranych świadczeń socjalnych.\nniepełnosprawność, samoocena niepełnosprawności, orzeczenie o niepełnosprawności, stopniu niepełnosprawności lub niezdolności do pracy, grupy schorzeń powodujące trudności w wykonywaniu codziennych czynności.\nWyjątkowo szczegółowy, prawda ? Teraz połączmy kropki. Pisałem o tym wiele razy że największym problemem Polski są uprawnieni do świadczeń z ubezpieczenia społecznego. Obciążają oni państwo w stopniu nadzwyczajnym, bo zobowiązania te wynoszą około 4 biliony złotych. Bez nich Polska ma dług około 56% PKB, z nimi ponad 320% PKB. Uprawnionych do świadczeń emerytalnych jest ponad 9 mln Polaków. Dziwne , liczba bardzo zbliżona do liczby mieszkańców Izraela. Rozwiązanie jest jedno, pozbyć się uprawnionych do świadczeń emerytalno-rentowych. No i tu Polska okazuje się być liderem.\nW kategorii wiekowej ponad 70 lat zaszczepionych jest blisko 70%, Liczba wyszczepień spada wraz z wiekiem, w wieku ponad 65 lat wynosi 50%. Kampania szczepień wśród seniorów nie ustaje, a wręcz się nasila. Trzeba pamiętać o tych kilometrowych kolejkach do szczepień w niższych grupach wiekowych. Łącznie w Polsce zaszczepiono już ponad 11 mln osób. Jeżeli 80% z nich umrze w ciągu następnych 10 lat znajdzie się sporo wolnego miejsca.\nCzy podobne wnioski są uprawnione ? Jeżeli spojrzeć na to co robił żydowski rząd PIS od początku pandemii to jak najbardziej. Niszczenie polskiej przedsiębiorczości, miejsc pracy, najważniejsze, Polska była jednym z nielicznych krajów na świecie gdzie rząd nie dopuścił do sprzedaży leków zabezpieczających lub łagodzących przebieg choroby. Takie leki , bez recepty, były dostępne nie tylko w Zachodniej Europie, USA, ale także Ameryce Łacińskiej, Afryce i w Azji.\nRząd PIS jako jeden z nielicznych zablokował Polakom dostęp do lekarza, do pomocy medycznej, do leczenia choroby, zabił w ten sposób ponad 100 000 ludzi i miliony okaleczył, gdyż wirus wywołał u wielu trudne do odwrócenia zmiany , zwłóknienia płuc, choroby serca, uszkodził tarczycę, trzustkę, wątrobę. Skrócono tym ludziom życie o wiele lat i wielu z nich umrze w ciągu następnych 10-15 lat.\nCzy jeszcze trzeba coś więcej dodać ? I dalej Polacy gapią się jak krowa na malowane wrota, tymczasem prowadzona jest w sposób brutalny i cyniczny wojna przeciwko Polsce i Polakom.\n.\nPrzedruk bez Komentarza.",
			"added": 1620938683
		},
		{
			"topic_id": 1621638953,
			"title": "Skąd się wziął korona-wirus?",
			"body": "Więc skąd się wziął korona-wirus? Tylko fakty …\nKwestia pochodzenia korona-wirusa, który wywołał pandemię COVID-19 i wszystkie nadzwyczajne decyzje i konsekwencje z tego dramatyczne dla całego świata, jest całkowicie upolityczniona. Co jest zrozumiałe. Minął już ponad rok, ale pytanie jest nadal otwarte (co jest mniej jasne) i warto byłoby je rozwiązać.\nJeśli jednak nadal przyznajemy do subiektywizmu w Stanach Zjednoczonych, to bardziej logiczna wersja jest taka, że ​​wirus został oczywiście stworzony pod nadzorem Pentagonu za pieniądze amerykańskich podatników. I posłużył do usunięcia Trampa z prezydentury Stanów Zjednoczonych i pozbawienia mieszkańców Zachodu podstawowych praw i wolności . Czy w tak ważnej sprawie można było liczyć na przypadkowy wyciek gdzieś w Chinach, skoro wirus był rozpaczliwie potrzebny w Stanach Zjednoczonych?\nGdyby korona-wirus został wydany w celu usunięcia Trumpa, to nowe, bardziej zaraźliwe jego szczepy powinny pojawić się pod koniec 2021 roku. Bo bez nich Demokratyczna Partia Stanów Zjednoczonych, która pokazała wszystkim swoje prawdziwe oblicze, fatalnie przegra wybory w 2022 roku. Będzie potrzebowała jeszcze potężniejszych fałszerstw niż w 2020 roku. W tym celu konieczne jest ponowne umieszczenie wszystkich obywateli USA w domu i zorganizowanie głosowania pocztą.\nObecnie groźba korona-wirusa jest wykorzystywana do przymusowego podawania eksperymentalnych szczepionek obywatelom Zachodu , które, jeśli nie doprowadzą do wysokiej śmiertelności, mogą doprowadzić do szybkiego wzrostu neuropatologii. Przypomnijmy, że niektórzy twórcy szczepionek RNA w Wielkiej Brytanii twierdzą, że aby uzyskać odporność, konieczne będzie szczepienie co sześć miesięcy. Co będzie w tych szczepionkach za kilka lat i kiedy zostaną połączone z CRISPR w celu zmiany ludzkiego genomu (np. W celu niepłodności, a nigdy nie wiadomo co jeszcze) – możemy się tylko domyślać. Ale to zdecydowanie nie Chiny to robią .\n.\nhttps://cont.ws/@Neiro/1982240\n.\nPod tym linkiem sporo ciekawego o wirusie. Niestety po Rosyjsku.\n.",
			"added": 1621638936
		},
		{
			"topic_id": 1621774948,
			"title": "MINISTER ZDROWIA. -Adam Niedzielski.",
			"body": "Pan dr Adam Niedzielski Minister Zdrowia\nSzanowny Panie Ministrze, Przekazuje się obecnie miliony złotych na promocję szczepień na SARS-CoV-2. Olbrzymie kwoty na reklamę otrzymało min. Polskie Radio, Telewizja Polsat, Telewizja Polska i inne media. W tym wypadku zasadnym jest się zapytać, czy szczepienia są rzeczywiście skuteczne i bezpieczne. Jest to szczególnie ważne, gdyż wprowadzone warunkowo eksperymentalne preparaty, nazywane „szczepionkami” są nadal w trakcie badań. Zwracamy się w tej sprawie z listem otwartym i zadajemy trzy pytania.\n\n    Dlaczego szczepi się masowo Polaków na SARS-CoV-2, kiedy wiadomo, że od zaprojektowania szczepionek wytworzyły się nowe mutacje wirusa, na które szczepionki nie są skuteczne?\n    Dowody:\n    Artykuł 1: „Evidence of escape of SARS-CoV-2 variant B.1.351 from natural and vaccine-induced sera” opublikowany w Cell ( https://doi.org/10.1016/j.cell.2021.02.037) w sposób jednoznaczny wskazuje na to, że w chwili obecnej oryginalny wirus z Wuhan, tzw. „early Wuhan”, na bazie którego powstały szczepionki na COVID-19 uległ mutacji. Mamy obecnie do czynienia z wirusami o tak silnych mutacjach, że szczepionki nie są skuteczne.\n    Artykuł 2: “Impact of SARS-CoV-2 B.1.1.7 Spike variant on neutralisation potency of sera from individuals vaccinated with Pfizer vaccine BNT162b2” opublikowany w Nature (https://www.nature.com/articles/s41586-021-03412-7) dowodzi, że szczepienia preparatem Pfizer nie chronią przed zakażeniem brytyjską wersją wirusa SARS-Cov2 B1.1.7., której występowanie w populacji polskiej wynosi obecnie 97%. W związku z tym, dokonuje się u nas masowych szczepień przeciwko wirusowi, który de facto już nie istnieje.\n    Artykuł 3: „A two-dose regimen of the ChAdOx1 nCoV-19 vaccine did not show protection against mild-to-moderate Covid-19 due to the B.1.351 variant”, opublikowny w The New Journal of Medicine (https://www.nejm.org/doi/full/10.1056/nejmoa2102214) pokazuje na podstawie badań przeprowadzonych w RPA, że szczepionka AstraZeneca jest nieskuteczna w stosunku do wariantu południowoafrykańskiego koronawirusa.\n    Artykuł 4: „Evidence for increased breakthrough rates of SARS-CoV-2 variants of concern in BNT162b2 mRNA vaccinated individuals”, umieszczony jako preprint przez medRxiv (https://www.medrxiv.org/content/10.1101/2021.04.06.21..) udowadnia, że osoby zaszczepione preparatem firmy Pfizer mogą być 8-krotnie bardziej narażone na zakażenie mutacjami wirusa SARS-Cov2 B1.1.7. i B.1.351 niż osoby niezaszczepione. Należy dodać, że szczepionka Pfizera może wywoływać poważne działania uboczne, w tym zapalenie mięśnia sercowego. Jest to obecnie także przedmiotem badań w Izraelu.\n    Dlaczego dopuszcza się szczepionki na bazie mRNA, kiedy wiadomo, że białko kolcowe wirusa SARS-CoV-2 wytwarzane również poprzez mRNA podawane w szczepionkach prowadzi do znaczących zmian właściwości bariery krew-mózg?\n    Dowód: Artykuł „The SARS-CoV-2 spike protein alters barrier function in 2D static and 3D microfluidic in-vitro models of the human blood–brain barrier” w Neurobiology of Disease (https://www.sciencedirect.com/science/article/pii/S09..) Nowe szczepionki proponowane nam przez Pfizer, Modernę i inne korporacje są stworzone na bazie mRNA – kwasu nukleinowego, który służy do syntezy białka. Autorzy wskazują na to, że białko wirusa SARS-CoV-2 wytwarzane również poprzez mRNA podawane w szczepionkach zmienia funkcję bariery krew-mózg, co może prowadzić do jej wzmożonej przepuszczalności i penetracji. Przekroczenie bariery krew-mózg wywołuje objawy neurologiczne o różnym stopniu nasilenia, od łagodnych do ciężkich. Symptomy mogą wystąpić natychmiast albo ujawnić się z opóźnieniem, nawet po kilku latach.\n    Dlaczego w Polsce używa się powszechnie szczepionki AstraZeneca, która w wielu krajach podlega ograniczeniom wiekowym ze względu na ryzyko poszczepiennej immunologicznej małopłytkowości zakrzepowej (vaccine–induced immune thrombotic thrombocytopenia)? Z uwagi na powikłania poszczepienne, niektóre kraje, np. Dania i Norwegia, nie stosują szczepionek AstraZeneca. Podobnie amerykańskie CDC bada powikłania zakrzepowe po innej szczepionce wektorowej, Johnson & Johnson. Korelacja zakrzepic ze szczepieniami została udowodniona naukowo.\n    Dowody: Artykuł 1: „Thrombotic Thrombocytopenia after ChAdOx1 nCov-19 Vaccination”, https://www.nejm.org/doi/pdf/10.1056/NEJMoa2104840?ar.. (SARS-CoV-2 poszczepienna immunologiczna małopłytkowość zakrzepowa — badania niemiecko-austriackie).\n    Artykuł 2: Thrombosis and Thrombocytopenia after ChAdOx1 nCoV-19 Vaccination”, https://www.nejm.org/doi/pdf/10.1056/NEJMoa2104882?ar.. (badania norweskie)\n    Artykuł 3: „Towards Understanding ChAdOx1 nCov-19 Vaccine-induced Immune Thrombotic Thrombocytopenia (VITT) https://assets.researchsquare.com/files/rs-440461/v1/.. (badania niemieckie).\n    Artykuł 4 „Welcome to the Reuters.com BETA. Read our Editor’s note on how we’re helping professionals make smart decisions”. https://www.reuters.com/world/us/texas-woman-hospital.. (badania amerykańskie CDC – amerykańskie CDC bada powikłania zakrzepowe po szczepionce Johnson & Johnson.) Można by dodatkowo zapytać: Czy planuje się dalsze zakupy szczepionek przeciw nieistniejącej już wersji wirusa, co spowoduje niepotrzebne wydanie miliardów złotych z kieszeni podatnika?\n    Jeżeli konkluzje wynikające z odpowiedzi na te pytania prowadzą do wniosku, że szczepienia są nieskuteczne wobec nowych mutacji, ponadto są niebezpieczne bowiem mogą prowadzić do penetracji bariery krew-mózg (Pfizer, Moderna) oraz do zakrzepów (AstraZeneca, Johnson&Johnson) i innych powikłań, a jedynie narażają nasz kraj na niepotrzebne koszty, wówczas żądamy natychmiastowego zatrzymania promocji masowych szczepień preparatami o charakterze eksperymentalnym oraz polecamy zastosowanie metod walki z COVID-19 jakie zostały zaproponowane w drugim i trzecim Apelu naukowców i lekarzy. Zdecydowanie sprzeciwiamy się planom szczepień ozdrowieńców, ludzi młodych i zdrowych oraz dzieci, gdyż w świetle powyżej zacytowanych badań, szczepienia tych osób nie mają uzasadnienia naukowego i mogą zaszkodzić ich zdrowiu.\n    Podpisali:\n    dr hab. W. Julian Korab-Karpowicz, prof. UO, Przewodniczący „Wolne Wybory”\n    dr Zbigniew Hałat, epidemiolog, były Główny Inspektor Sanitarny i Podsekretarz Stanu w MZ\n    prof. dr hab. n. med. Ryszard Rutkowski\n    prof. dr hab. n. med. Maria Sobaniec-Łotowska\n    prof. dr hab. n. med. Krystyna Lisiecka-Opalko\n    prof. dr hab. n. med. Jolanta Kupryjańczyk\n    prof. dr hab. n. farm. Maria Borawska\n    prof. dr hab. Artur Śliwiński, UW\n    dr hab. Ryszard Zajączkowski, prof. KUL\n    dr Mariusz Błochowiak, Poznań\n    dr n. med. Katarzyna Markiewicz, Warszawa\n    dr n. med. Beata Wrodycka-Żytkowska, Łódź\n    dr n. med. Marcin Błażejak, Hamburg\n    dr n. med. Katarzyna Landa, Kraków\n    dr n. med. Andrzej Żytkowski, Łódz\n    dr n. med. Jerzy Kąkol, Bydgoszcz\n    dr n. med. Jerzy Lewko, Białystok\n    lek. med. Krystyna Szumik-Taraszkiewicz\n    lek. med. Jeremi Gawinek, Herne\n    lek. med. Alicja Alda, Bergen\n    lek. dent. Anna Walacik, Lublin\n    lek. med. Agata Osiniak, Majdan Królewski\n    lek. med. Ewelina Gierszewska, Chojnice\n    lek. med. Dorota Staszewska, Warszawa\n    lek. med. Katarzyna Skubisz, Wieliczka\n    lek. med. Zbigniew Pawelec, Gdańsk\n    lek. med. Maciej Gajowski, Karpacz\n    lek. med. Piotr Iwulski, Olsztyn\n.\n    Pandemonium „rasistowskie” przemieniamy w wiadomości Światowego Urzędu Kontroli Prasy, Publikacji i Widowisk",
			"added": 1621774930
		},
		{
			"topic_id": 1622035388,
			"title": "Ciekawostka-Prezydent Białorusi.",
			"body": "Prezydent Białorusi Aleksander Łukaszenko opowie prezydentowi Rosji Władimirowi Putinowi dokładnie, co wydarzyło się w samolocie Ryanair na najbliższym spotkaniu.\n\n// tak sobie dziś umyślilem, czytając o tym Greku co leciał do Mińska przez Wilno. A jeżeli wciąż widzimy jedynie „dym i lustra” czyli zasłonę dymną którą jest Protasiewicz? Może chodziło o tych pozostałych nieobecnych na pokładzie w Wilnie? Może w trakcie lotu sprawa się rypła i w Wilnie czekali na nich smutni panowie? Jedyną okazją uprzedzenia ich było wyciągnięcie ludzi w Mińsku. A Protasiewicz okazał się wisienką na torcie.\nOczywiście, nie mam nic na poparcie tej spekulacji, ale jaki raban się podniósł.\nI danych personalnych tych ludzi brak.\n.\nTen watek moze byc prawdopodobny.",
			"added": 1622035369
		},
		{
			"topic_id": 1626053945,
			"title": "Putin polecił przygotować gospodarkę do wojny.",
			"body": "Putin polecił przygotować gospodarkę do wojny.\n.\nhttps://www.finanz.ru/novosti/aktsii/putin-poruchil-gotovit-ekonomiku-k-voyne-1030579375\nGospodarka Federacji Rosyjskiej, wszystkie jej podmioty i gminy muszą być przygotowane do zapewnienia ochrony przed atakiem zbrojnym oraz do zaspokojenia potrzeb państwa i ludności w czasie wojny. Mówi o tym zaktualizowana Strategia Bezpieczeństwa Narodowego Federacji Rosyjskiej, którą dekretem zatwierdził prezydent Władimir Putin.\nDokument, który jest przygotowywany przez Radę Bezpieczeństwa, jest podstawowym dokumentem dla wszystkich organów rządowych i stanowi podstawę kształtowania sektorowych doktryn strategicznych, zwraca uwagę na „wzmacnianie niebezpieczeństw i zagrożeń militarnych”, które są „promowane próbami wymusić presję” na Rosję, „rozbudowę infrastruktury wojskowej NATO” i „intensyfikację działań wywiadowczych” obcych państw.\nCo więcej, zgodnie ze strategią „praktykuje się użycie wielkich formacji wojskowych i broni nuklearnej przeciwko Rosji” – po raz pierwszy w całej współczesnej historii kraju zagrożenie to jest wskazywane jako realne.\nW związku z tym wymagane jest „utrzymanie<…> potencjału odstraszania nuklearnego”, zapewnienie „gotowości bojowej” sił zbrojnych i niezależności technologicznej przemysłu obronnego, a także planowanie i prowadzić „działania w celu przygotowania do ochrony i ochrony ludności, wartości materialnych i kulturowych < …> Przed zagrożeniami wynikającymi z konfliktów zbrojnych” – czytamy w dokumencie.\nPoprzednia wersja, zatwierdzona w 2016 r., kładła nacisk na obronę „poprzez strategiczne powstrzymywanie i zapobieganie konfliktom zbrojnym”. Nowa wersja wprost stwierdza, że ​​obrona „jest zorganizowana w celu zbrojnej obrony” kraju, „integralności i nienaruszalności jego terytorium”.\nJednocześnie głoszą odrzucenie tezy z czasów odprężenia Breżniewa o „stopniowym ruchu w kierunku świata wolnego od broni jądrowej”. Pozycja ta była obecna w strategii 2016, a w nowym wydaniu została usunięta.\nRosja stoi w obliczu „nieprzyjaznych działań” obcych państw, „otwartej presji politycznej i ekonomicznej”, prób „izolacji” poprzez stosowanie podwójnych standardów oraz „kampanii informacyjnych mających na celu stworzenie wrogiego wizerunku” kraju – czytamy w dokumencie.\nTwórcy strategii obwiniają o to nieprzyjazne kraje Zachodu, w których ich zdaniem rozwija się kryzys gospodarczy i społeczny.\nW szczególności jest to spowodowane „stagnacją i recesją czołowych gospodarek świata, spadkiem stabilności globalnego systemu monetarnego, zaostrzeniem walki o dostęp do rynków i zasobów”, a także ogólnym „kryzysem zachodniego modelu liberalnego” – czytamy w dokumencie.\nCo więcej, jeśli 5 lat temu Rada Bezpieczeństwa zezwoliła Rosji na powrót do dawnego statusu międzynarodowego i wskazała np. „przyciąganie inwestycji zagranicznych” jako cel rozwojowy, to w strategii 2021 wręcz przeciwnie kładzie się nacisk na dalszy izolacjonizm .\nW szczególności mówią o potrzebie „wzmocnienia kontroli” nad inwestorami zagranicznymi w strategicznych sektorach, „ograniczenia użycia dolara” oraz „przezwyciężenia krytycznej zależności od importu technologii, sprzętu i komponentów”.\n„Ważnymi warunkami zapewnienia bezpieczeństwa ekonomicznego Federacji Rosyjskiej jest oparcie się na wewnętrznym potencjale i samodzielne rozwiązywanie zadań stojących przed Rosją” – podkreśla dokument.\nZmianie uległa także lista strategicznych priorytetów narodowych. W 2016 r. wśród nich wskazano „poprawę jakości życia obywateli Rosji”, „wzrost gospodarczy”, „opiekę zdrowotną”, „edukację” i „kulturę”.\nTe przedmioty zostały usunięte. Zostały one zastąpione przez „ratowanie narodu rosyjskiego”, „bezpieczeństwo gospodarcze”, „bezpieczeństwo informacyjne” i „ochronę tradycyjnych rosyjskich wartości duchowych i moralnych”.\nA tu pełna treść dokumentu w oryginale jakby ktoś miał ochotę poczytać:\nhttp://publication.pravo.gov.ru/Document/View/0001202107030001?index=0&rangeSize=1\nWesoło nie jest.",
			"added": 1626053925
		},
		{
			"topic_id": 1633712778,
			"title": "HISTORIA-POLSKI.",
			"body": "- HISTORIA POLSKI.\n.  Jan Pluszkiewicz \n·\nJUTRO ROCZNICA AGRESJI ZSRR 17 WRZEŚNIA 1939 ROKU\nNIENAWIŚĆ NIE TŁUMACZY KŁAMSTWA, TO KŁAMSTWA TŁUMACZĄ NIENAWIŚĆ.\nJutro 17 września w rocznicę napaści wojsk ZSRR na nasz kraj, wysłuchamy lawiny kłamstw i przeinaczeń. Staram się tutaj opisać prawdę tamtych wydarzeń. Bez złośliwości i bez inwektyw, postaram się obalić bajdy i mity, które w III RP robią za fakty historyczne. Wiara w te obowiązujące brednie historyczne w III RP, czyni z faktów historycznych kabaret, a z ówczesnych przywódców bandy idiotów! Władze III RP kształcą nam pokolenie debili, pokolenie, które czci naszych ludobójców, zdrajców i morderców jako bohaterów narodowych. Gdy jakiś Nowak, Kowalski, Podgórski, etc, etc, w swoim domu uczy swoje dzieci, że bitwa pod Grunwaldem była z Chińczykami w 315 roku na terenie dzisiejszej Grenlandii, że Lenin i sowieci razem w 895 roku byli przeciwni chrystianizacji Polski. to nie nasza sprawa, to sprawa Kowalskich, Nowaków, etc, etc, etc. Bo te dzieci uczone w domu przez Kowalskich i Nowaków, w normalnej szkole dowiedzą się prawdy, dowiedzą się że ich tatuś nie miał pojęcia o historii. Ale co mamy zrobić gdy takich i podobnych bredni uczą nasze dzieci w publicznych szkołach? Co mamy zrobić, gdy naszych bohaterów -którym zawdzięczamy nie tylko swoje życie, ale także fizyczne istnienie naszej nacji, naszego narodu, władze przedstawiają jako ludobójców, jako zbrodniarzy, a ludobójców naszego narodu, gloryfikują jako bohaterów! Młodzież szkolna, nasze dzieci, razem z bękartami naszych wyklętych morderców, którzy w III RP sprawują władzę, oddają cześć zdrajcom naszego narodu, ludobójcom i mordercom naszego narodu. To władze państw odpowiadają za edukacje swoich obywateli, to władza decyduje o poziomie edukacji. To od władzy powinniśmy dowiadywać się prawdy o naszej historii, tej odległej i tej współczesnej. To każda władza wbija nam do głowy, że naród bez przeszłości, bez teraźniejszości nie ma przyszłości, taki naród musi umrzeć! I ta sama władza, która tak pięknie mówi, napisała nam nową historię ziejącą nienawiścią do naszych bohaterów i ciągle dodaje nowe kłamstwa, w której zdrajcy, kanalie, ludobójcy i mordercy naszego narodu, są bohaterami tej władzy, a ofiary zamordowane przez bohaterów tej władzy, są przedstawiane jako kaci naszego narodu! W kłamstwach okupacyjna władza III RP przebiła kłamstwa III Rzeszy, a prezydent Duda i jego wszyscy poprzednicy, przebili swoimi kłamstwami samego Adolfa Hitlera i Josepha Goebbelsa razem wziętych. Historię zacznę od cudu nad Wisłą, czyli „napaści sowieckiej” na II RP. W czerwcu roku 1920 na nasze wojska w Kijowie napadli komunistyczne hordy armii czerwonej! Co myśmy robili w Kijowie? W roku 1920 Kijów był integralną częścią Rosji radzieckiej, to kolebka Rosji. Co myśmy robili napadnięci w Kijowie? Dokładnie i zupełnie tak samo- jak na nas w Kijowie, wojska sowieckie napadły w Stalingradzie na wojska niemieckie, a potem, jakby jednej napaści było im mało, sowieci napadli na wojska III Rzeszy pod Kurskiem! Nie mam pojęcia, jak naszą obecność w Kijowie i naszą paniczną ucieczkę z Kijowa przed wojskami armii czerwonej, cudem zatrzymaną w Radzyminie przez generała Rozwadowskiego można nazwać sowiecką napaścią? Nazwa tego cudu, zatrzymania rozgromionych, spanikowanych wojsk polskich, nosi nazwę „cudu nad Wisłą”. Sama ta nazwa, „cud nad Wisłą” sugeruje 99% Polakom, że to my zostaliśmy napadnięci przez sowieckie wojska. MY! Bohater III RP Piłsudski, nie uczestniczył w zmaganiach wojennych roku 1920, przerażony atakiem armii czerwonej w Kijowie, uciekł z Kijowa prosto do Warszawy, zamelinował się u kochanki i czekał na wynik wojny przez siebie rozpętanej. To napisana dla Piłsudskiego historia, wykreowała go na wodza bitwy warszawskiej, z którą nie miał nic wspólnego. On uciekł przerażony z Kijowa gdy sowieckie wojska zaatakowały, zdezerterował, nie dowodził bitwą, był tchórzem, dezerterem i kompletnym dyletantem w sprawach wojska. Po przewrocie majowym w 1926 roku Piłsudski kazał zamordować autora cudu nad Wisłą, generała Tadeusza Rozwadowskiego. Otruli generała w wiezieniu, a „nieznani sprawcy” ukradli ciało generała z grobu, ponieważ rodzina domagała się sekcji zwłok. Taki bohater jak Piłsudski w sam raz nadaje się na bohatera władz III RP. Nie da się ukryć, że w roku 1920, to myśmy byli agresorem, to myśmy napadli na Rosję radziecką, to myśmy schwytanych oficerów armii czerwonej w liczbie 15- 18 tysięcy – zgodnie z pisemnym rozkazem Władysława Sikorskiego, zabijali natychmiast po schwytaniu. To myśmy ok. 55-70 tysięcy schwytanych jeńców z armii czerwonej, zakatowali, zabili, zamordowali, zagłodzili, umierali zakatowani przez sadystycznych strażników, zostali zabici kijami, kolbami karabinów, zastrzeleni, zarąbani, a tysiące z nich wyprowadzonych nago na mróz, było polewanych wodą aż zamarzli. To są fakty, o których mówili strażnicy obozowi. W naszym kraju nie ma nawet wzmianki o tych zamordowanych jeńcach. 99% Polaków pojęcia nie ma o naszych zbrodniach ludobójstwa, o naszym okrucieństwie. Ale ponad 99% z nas ma wiedzę o sowieckim ludobójstwie katyńskim dokonanym na nas bez żadnego powodu! Gdybyśmy znali historię, nie bajdy, to zbrodnia katyńska nie byłaby uznana przez nas nawet za przykrość nam wyrządzoną. Czy może nas dziwić zbrodnia umownie nazwana katyńską, gdy mamy wiedzę o naszych zbrodniach 20 lat wcześniej? Przypomnę, rozkaz natychmiastowego zabijania schwytanych sowieckich oficerów wydał i podpisał Władysław Sikorski. Ten sam Sikorski domagał się międzynarodowej komisji w celu zbadania sowieckiej zbrodni. Stalin zerwał stosunki dyplomatyczne z rządem londyńskim w kwietniu 1943 roku. W lipcu Anglicy zlikwidowali Sikorskiego bo ten swoim oskarżaniem sojusznika, szkodził aliantom . Jakie mam dowody, że to Anglicy? W tym roku minęło 75 lat od zamachu i rząd Anglii utajnił na dalsze 75 lat akta sprawy zamachu na Sikorskiego! Nie dam rady uwierzyć, że utajnił akta na dalsze 75 lat, by chronić dobre imię Rosjan. Idziemy dalej z logiką historii. 30 września 1938 roku Niemcy, Anglia, Francja i Włochy podpisali układ monachijski datowany na dzień 29 września 1938 roku, mocą którego Adolf Hitler uzyskał prawo zajęcia Sudetów, które były częścią Czechosłowacji. To była łapówka Anglii i Francji, która miała zachęcić Hitlera do ataku na ZSRR. 30 września 1938 roku podpisano układ monachijski bez pytania Czechosłowacji o zdanie, nikt ich nie zapraszał do rozmów. Już w następny dzień, 1 października 1938 roku Hitler zajął Sudety, a 2 października 1938 roku Polska napadła na Czechosłowację rabując im Zaolzie. Byliśmy sojusznikami Hitlera, towarzyszami broni, rok wcześniej niż ZSRR! Nic nie usprawiedliwiało naszej napaści. Nic! Zachowaliśmy się tak jak cmentarne hieny, pożywiliśmy się trupem Czechosłowacji. O naszych zbrodniach w Zaolziu od zawsze panowała i do dziś panuje grobowa cisza, a prawda jest taka, że zamordowaliśmy w obozach kilka tysięcy Słowaków, gwałciliśmy ich kobiety, rabowaliśmy mienie Słowaków, wysiedlaliśmy ich z ich ziemi! Zachowaliśmy się w Zaolziu tak samo, albo bardzo podobnie, jak SS w naszym kraju! Żadne opracowania „naukowe” nie zajmują się naszą agresją, jej nie było! Jedziemy dalej z prawdą historyczną. Dopiero w roku 1934 „demokracje” europejskie przyjęły ZSRR do Ligi Narodów. To ZSRR od 1934 roku zabiegał o zbiorowe bezpieczeństwo, o sojusze wojskowe państw Europy przeciw Hitlerowi. Nie trzeba nawet znać historii by mieć absolutną pewność, że to demokratyczna, wolnorynkowa, kapitalistyczna Europa, nie chciała mieć nic wspólnego z ZSRR. Nie mieli interesu bronić komunistycznego państwa przed Adolfem Hitlerem, a wręcz przeciwnie, byli zainteresowani jego zniszczeniem. Retoryka kanclerza Hitlera a potem wodza III Rzeszy, była dla „demokratycznych” państw Europy gwarancją, że ofiarami ich nowego przyjaciela -Adolfa Hitlera, będzie ZSRR i Żydzi. Nie mieli żadnego interesu by chronić komunistów! Więc brednie o rozmowach, czy ewentualnych sojuszach z ZSRR, są tylko bredniami. By nie być gołosłownym. Od kwietnia, maja i czerwca 1940 roku Europa zachodnia; Dania, Norwegia, Holandia, Belgia, Francja byli już okupowani przez Niemcy. Po napaści Niemiec na ZSRR 22 czerwca 1941 roku, z tych okupowanych państw wyruszyły na front wschodni legiony ochotników do walki z ZSRR razem z przyjaciółmi III Rzeszy. To byli ochotnicy! Brutalność tych wysłanych ludobójców z państw zachodniej Europy w traktowaniu ludności ZSRR, często przerastała brutalność SS. Te legiony walczyły po stronie Hitlera. Tak samo po stronie Hitlera jak Litwa, Estonia, Łotwa i ukraińskie bękarty, czyli nasza mniejszość narodowa która wykazała się wyjątkowym okrucieństwem, wyjątkowym zwyrodnieniem wobec nas i narodów ZSRR. Rzekomy wkład państw zachodnich w pokonaniu Hitlera był niewielki, wręcz iluzoryczny, bohaterstwo ich wojsk na froncie zachodnim bardzo pięknie wygląda na filmach i w powieściach sensacyjnych. 80% najlepszej najbardziej bitnej, najlepiej zbrojonej armii Hitlera poległo na froncie wschodnim. USA i Anglia weszli do wojny w czerwcu 1944 roku podczas lądowania w Normandii. Wcześniej ich „waleczne” wojska bawiły się w wojnę, a to w Afryce, a to na bliskim wschodzie. W maju 1943 roku USA wylądowali w Sycylii. Straty armii USA w II wojnie to 140 tysięcy w Europie i 150 tysięcy poza Europa, głównie na Pacyfiku. Straty walecznej Anglii ok. 300 tysięcy, w tym w Europie ok. 180 tysięcy. Polska straty wojskowe w Polsce 123 tysiące, w tym 7 tysięcy na zachodzie! ZSRR straty wojsk ok. 15 milionów! Moje pytanie proste, czy wobec takiej dysproporcji ofiar można poważnie traktować uczestnictwo aliantów w II Wojnie?\nCześć II\nNIENAWIŚĆ NIE TŁUMACZY KŁAMSTWA, TO KŁAMSTWA TŁUMACZĄ NIENAWIŚĆ. Front zachodni powstał w czerwcu 1944 roku, III Rzesza już dogorywała, nic już nie mogło ich uratować. Alianci bardzo dbali o to, by ocalić jak najwięcej żołnierzy III Rzeszy, bo już w tedy trwały przymiarki do rozwalenia ZSRR razem z Niemcami. Nie zapominajmy, że głównodowodzący wojsk alianckich Dwight Eisenhower był 100% Niemcem urodzonym w USA, jego rodzice byli Niemcami. I dalej trzymam się tematu historii Polski. Polska, jako jedyny kraj podczas II wojny nie kolaborowała ani z III Rzeszą ani z ZSRR, wył minister od obrony III RP w dniu 8 maja 2017 roku. Upośledzony ministrze od obrony, rząd II RP uciekł na odgłos pierwszych salw wojny, pozostawił nas bez jakiejkolwiek obrony. Już 7 – 8 września 1939 roku przerażone władze II RP- z naczelnym wodzem na czele, były w komplecie w Zaleszczykach. A tam nie mieli z kim kolaborować, nikt im niczego nie proponował, nikt ich nie chciał. Armia ZSRR weszła w nasze granice 10 dni po ucieczce rządu II RP, było to 17 września 1939 roku. Nie mieli prawa na nas napadać, bo mieliśmy układ o pokój, wyją dyżurni „naukowcy” i dalej w tym tonie. Pakt był aktem sprzecznym ze wszystkimi umowami wiążącymi Polskę i ZSRR, tajny protokół do paktu Ribbentrop – Mołotow z dnia 23 sierpnia 1939, zawartego między Niemcami a ZSRR, przewidywał faktyczną likwidację Rzeczypospolitej przez III Rzeszę i ZSRR. Rząd ZSRR jednostronnie uznał układ pokojowy z 1932 i wszystkie umowy zawarte z rządem lub z udziałem rządu RP za nieistniejące pod pretekstem „zaprzestania istnienia państwa polskiego” i dokonał siłami Armii Czerwonej najazdu na nasz kraj! Wg „naukowców” III RP, agresja zbrojna ZSRR była złamaniem wszystkich powyższych porozumień międzynarodowych, w tym w szczególności paktu o nieagresji z roku 1932. To było wbicie nam noża w plecy, etc, etc, etc. Mam całkiem inne zdanie na temat napaści ZSRR. Pytam „uczonych” z III RP. Czy dyrektywa polskiego sztabu generalnego z sierpnia 1937 roku, była aktem przyjaźni wobec ZSRR? Ten dekret powstał dwa lata wcześniej niż pakt Ribbentrop- Mołotow. W sierpniu 1937 r. polski Sztab Generalny wydał dyrektywę nr 2304/2/37, w którym zawarto zapis o ostatecznym celu polskiej polityki, którym ma być „zniszczenie całej Rosji”, a jednym ze skutecznych narzędzi do jego osiągnięcia byłoby podżeganie wystąpień separatystycznych na Kaukazie, Ukrainie i centralnej Azji, w szczególności z wykorzystaniem wywiadu wojskowego” Koniec cytatu. To ta wiedza sowieckiego wywiadu była powodem aresztowania Konstantego Rokossowskiego pod zarzutem szpiegostwa na rzecz Polski. Od rozpadu ZSRR trwa realizacja tej dyrektywy przez kolejnych prezydentów USA; Starego Busha, Clintona, Busha juniora, Obamy, i Trampa. Oni korzystali „z mądrości” tej dyrektywy, rozpętali z pomocą swoich polskich renegatów z III RP wojny na Kaukazie, w Czeczeni, Górnym i dolnym Karabachu, w Gruzji, Osetii, w Mołdawii, w końcu posłużyli się ludobójcami z banderowskiej Ukrainy. To dzieje się na naszych oczach tu i teraz. Gdybyśmy znali historie prawdy, a nie kłamstw, propagandy, zmyśleń i przeinaczeń, które robią w III RP za historię, to nasz kraj nie byłby folwarkiem USA. Wracam do II wojny. Nie będę polemizował z fantazjami „uczonych” o milionowych sowieckich wywózkach, o katowniach, o zbrodniach NKWD, etc, etc, etc. Mam 77 lat, urodziłem się we Lwowie, moi przodkowie od strony ojca i matki mieszkali we Lwowie kilkaset lat. Moja wiedza o zachowaniu sowietów na kresach pochodzi od rodziców, od krewnych, od znajomych rodziców, a także od mojego kilkanaście lat starszego rodzeństwa. Ich wiedza, ich opowieści, wykluczają publikowane brednie „uczonych” o zachowaniu i zbrodniach armii czerwonej na naszych kresach wschodnich. I tak; Sowieci nie wywieźli na Sybir, ani do Kazachstanu milionów Polaków, ale ta prawda niczego nie zmieni, nie mają znaczenia dokumenty w których prawda jest nie do podważenia. Otumanieni bredniami „uczonych” nie potrafimy myśleć logicznie. Gdybyśmy umieli myśleć, to dokumenty NKWD pisane w czasie trwania tych wywózek i po ich zakończeniu, dla każdego myślącego człowieka są bardziej wiarygodne niż relacje setki uczonych historyków. Dlaczego? Twórcy tych dokumentów byli zainteresowani by podać jak największą liczbę wywiezionych, bo większa liczba zabitych i wysiedlonych promowała ich pracę! W ich interesie leżało powiększyć w protokołach liczby ofiar a nie ich pomniejszyć! Nic i nikt nie zdoła już wymazać z naszej pamięci mitu gehenny „milionów” zesłańców, mitu setek tysięcy zmarłych i zabitych podczas transportu. O historii trzeba jednak pisać uczciwie. Wg wiedzy naszych „uczonych,” sowieci wywieźli z Polski 1 700 000 ludzi, z tego 900 000 zmarło podczas wywózki. Te wstrząsające liczby wzięte z sufitu są do dziś publikowane w prasie, telewizji, a nawet w publikacjach pretendujących do miana naukowych. Problem w tym, że są mitami, bredniami, nie mają nic wspólnego z prawdą historyczną. Wszystkie te szacunki o milionach wywiezionych i zmarłych, powstawały na bazie cząstkowych danych, głównie relacji samych deportowanych, którzy nie mieli pojęcia co się dzieje poza ich wzrokiem i słuchem. Na początku lat 1992 mieliśmy swobodny dostęp do rosyjskich archiwów. Dopiero w tedy historycy mogli wreszcie zapoznać się z aktami NKWD, dokumentującymi bardzo dokładnie kolejne fale stalinowskiego terroru. Okazało się, że wszystkie cztery opisane deportacje objęły ok. 320 000 obywateli zamieszkałych na kresach w II RP. W tej liczbie ok. 320 tysięcy wywiezionych, znajdowało się ok. 25 000 Ukraińców zachodnich, 20 000 Białorusinów i 70 000 Żydów, a liczba wszystkich wywiezionych Polaków nie przekroczyła 220 tysięcy! Do czasu „amnestii” ogłoszonej w ZSRR w lipcu 1941 r. śmiertelność wśród zesłańców wynosiła od 2,8% do 5,8% rocznie. Ile osób zmarło po tej dacie – nie da się określić, ponieważ osoby te nie były już traktowane jako obywatele okupowanego państwa, mieli już takie same prawa jak obywatele ZSRR. Na pewno po czerwcu 1941 roku przeżyło znacznie więcej osób, niż to wynikało z wcześniejszych przypuszczeń. Wychodzi na to, że z sufitowej liczby jeden milion siedemset tysięcy wywiezionych, zostało „tylko” 210- 220 tysięcy Polaków. Gdyby z tej liczby zmarło nawet 6% rocznie, to w ciągu dwóch lat, byłoby to, ok 26 tysięcy ofiar. A więc nie ma 1 milion 700 tysięcy wywiezionych i 900 tysięcy zmarłych. Jest 220 tysięcy wywiezionych Polaków i ok. 26 tysięcy zmarłych Polaków. Taka jest prawda o sowieckim holokauście. Wychodzi na to, że ukraińscy przyjaciele władzy III RP, zakatowali nas kilka razy więcej na Wołyniu niż sowieci podczas wywózek. Listy proskrypcyjne do wywózek Polaków tworzyli miejscowi Ukraińcy, ich bękarty są przyjaciółmi okupacyjnej władzy III RP. Z wiedzy moich rodziców wynikało, że to nie sowieci, tylko miejscowi Ukraińcy w grudniu 1939 roku zastąpili w lwowskich brygidkach polską obsługę więzienia. To oni, w miejsce Polaków byli tam strażnikami i to oni- a nie sowieci, zamordowali wszystkich więźniów brygidek z wyjątkiem Ukraińców. Zbrodnie każdego okupanta są dodatkiem do faktu okupacji i określają ich konduitę. Wszyscy wiemy jaki los spotkał w ZSRR 17- 20 tysięcy Polaków, wiemy o ofiarach w Starobielsku, Ostaszkowie, Kozielsku, Miednoje, umownie nazywamy to zbrodnią katyńską. Wszystkie ofiary zginęły od strzału w tył głowy. Wszystkie zabite ofiary z wyjątkiem jednej kobiety- Janiny Lewandowskiej, byli dorosłymi mężczyznami. Nie było pośród ofiar dzieci, kobiet, starców. Odkopane trupy były w jednym kawałku i nie nosili śladów przed śmiertelnych tortur! Ale już bardzo nieliczni wiedzą, że Katyń był odwetem za nasze ludobójstwo z roku 1920- 1922. Zakatowane przez nas sowieckie ofiary nigdy nie mieli i nadal nie mają cmentarza, nie mają kaplicy, nie maja grobów, wart honorowych, nie ma nawet informacji gdzie znajdują się doły w których są zagrzebane kości ich zakatowanych trupów! Bo myśmy jeńcom nie strzelali w tył głowy, myśmy wzorem banderowców katowali ich tak długo, aż w męczarniach umarli. A zamordowaliśmy ok. od ok. 55 – do 80 tysięcy jeńców sowieckich! Osiemdziesiąt tysięcy! I nikt w Polsce nie wie gdzie są ich trupy! Ludobójstwo banderowskiej Ukrainy- nie tylko na Wołyniu, charakteryzuje się nieludzkim okrucieństwem wobec zakatowanych ofiar. Ofiarami banderowskiej Ukrainy są głównie dzieci, nawet bardzo malutkie dzieci i nawet one były masakrowane przed śmiercią. W żadnych dołach nie ma tylu trupów w kawałkach, co w dolach zagrzebanych przez banderowską Ukrainę. Oddawanie hołdu zabitym w Katyniu, cisza nad sowieckimi ofiarami, które myśmy zakatowali i umizgi do bękartów naszych ludobójców z banderowskiej Ukrainy sprawców zakatowania co najmniej 200 tysięcy Polaków , czyni z władz III RP okupantów i wspólników banderowskich zbrodni, stawia znak równości między władzą Kijowa i Warszawy! I tego inaczej nazwać się nie da! 30 lipca 1941 roku Władysław Sikorski jako premier, podpisał układ z ambasadorem ZSRR w Londynie na mocy którego przywrócone zostają stosunki dyplomatyczne między naszymi krajami zerwane 17 września 1939 roku, a na terenie ZSRR utworzona zostanie Armia Polska złożona z obywateli polskich zamieszkałych na terenie ZSRR, jak również z osób wywiezionych w głąb ZSRR, lub więzionych w gułagach w okresie trwania okupacji Polski przez ZSRR. Dowódcą tworzącej się armii został wyznaczony wbrew woli Władysława Sikorskiego, Niemiec- Władysław Anders\nCZEŚĆ III\nNIENAWIŚĆ NIE TŁUMACZY KŁAMSTWA, TO KŁAMSTWA TŁUMACZĄ NIENAWIŚĆ\nGenerał Anders był synem Niemca i Niemki, więc w jaki sposób można uznać go za Polaka? W jaki sposób syn Niemki i Niemca został Polakiem tego nie rozumiem i widocznie premier Sikorski też tego nie rozumiał. W roku 1939 Anders zrobił wszystko by nie wyrządzić krzywdy swoim hitlerowskim rodakom, nie podjął walki z Niemcami, nie pomógł generałowi Kutrzebie w bitwie nad Bzurą, mimo rozkazu wejścia do walk odmówił wykonania rozkazu. O tych faktach zdrady, tchórzostwa, niewykonania rozkazu wiedział premier Sikorski. Natomiast zwolennikami powierzenia dowództwa tworzącej się armii na terenie ZSRR generałowi Andersowi był i premier Churchill i Stalin. Obaj z innych powodów. Anders od listopada 1939 roku przebywał w komfortowych warunkach w moskiewskim więzieniu na Łubiance, z jakiegoś powodu nie został zabity -jak inni oficerowie starzałem w tył głowy! Anders był przez 5 lat oficerem armii carskiej. Stalin chciał wierzyć, że Anders będzie dyspozycyjny wobec ZSRR. Churchill wspierał Andersa z powodu jego niemieckiej narodowości, prawidłowo widział w nim sojusznika, widział w nim wroga i Polski i ZSRR. Widział w nim wodza armii frajerów polskiej narodowości, która będzie pilnowała zamorskich interesów Anglii w Libii, Egipcie, Syrii i Iranie, która będzie umierała w obronie interesów angielskich milionerów. Wyprowadzone z ZSRR wojsko, nie służyło interesom Polski. nie przyczyniły się do pokonania III Rzeszy. Ich wkład w wojnę z Hitlerem był żaden! Zdobycie Monte Casino w maju 1944 roku nikomu nie było potrzebne, było zdobywaniem mołojeckiej sławy niemieckiego generała o nazwisku Anders. Tak zwana polska armia zachodnia weszła do boju w czerwcu 1944 roku. Niemcy już byli pobici. Obrona Francji w roku 1940 przez nasze wojska, które po wrześniowej klęsce przebiły się na zachód i zostały sformułowane jako armia przez Sikorskiego we Francji, nie były entuzjastycznie witane przez Francuzów, ich walka w obronie Francji nie miała ani znaczenia ani sensu. Francja nie chciała walczyć z Hitlerem, a Anglia była za słaba militarnie by bronić Francji. Położenie geograficzne Anglii ocaliło ich od klęski i zagłady już w roku 1940. Pomoc ekonomiczna Anglii przez USA- była niszczona przez flotę III Rzeszy, pomoc była zbyt mała by ocalić Anglię od klęski . Prawdziwym ocaleniem Anglii była napaść Hitlera na ZSRR. Od tego momentu Anglia nie szczędziła sił i środków by ocalić siebie za pomocą ofiar armii ZSRR. Już 25 czerwca 1941 roku Sikorski wezwany do Churchilla został zobowiązany do natychmiastowego nawiązania stosunków dyplomatycznych z ZSRR i poczynienia zabiegów dyplomatycznych by zorganizować wojsko polskie na terenie ZSRR. Tworzenie armii w ZSRR nie było pomysłem Sikorskiego, to był pomysł Churchilla, który ocalenie Anglii widział w armii ZSRR. Nie szczędził sił i środków by wspomóc jedynego sojusznika w walce z III Rzeszą. Ponad 80% armii niemieckiej poległo na froncie wschodnim. Na front wschodni Niemcy wysyłali najlepszy sprzęt i najlepsze oddziały armii niemieckiej. Wysłanie na front wschodni było odczytywane przez niemieckich żołnierzy jak wyrok śmierci. Na każdych 10 zabitych niemieckich żołnierzy, 8 zginęło na froncie wschodnim! W okupowanej Europie Niemcy czuli się jak u siebie w domu, napady na nich, wyroki śmierci, jakieś podziemie antyniemieckie powstało na potrzeby filmu i powieści po roku 1948 i trwa do dziś. Czym dalej od wojny, tym bohaterstwo aliantów było większe, ich wkład w wyzwolenie Europy był ogromny i bezustannie rośnie. Już doszło do sytuacji, że tak naprawdę III Rzeszę pokonali jankesi, Anglicy i Francuzi, ratując od zagłady Europę i ZSRR. Tymczasem w ZSRR w miejsce armii Andersa powstała armia pułkownika Berlinga. To tylko i wyłącznie dzięki istnieniu tej armii LWP, mamy ziemie zabrane Niemcom! Tylko i wyłącznie dzięki ich istnieniu! Za zgodą i w porozumieniu z USA i Anglią, ZSRR mianował polski rząd. 22 lipca 1944 roku z nadania Moskwy powstał w Lublinie zalążek polskiego rządu PKWN, czyli Polski Komitet Wyzwolenia Narodowego! Ustanowienie tego rządu było jedynym powodem wybuchu powstania warszawskiego 1 sierpnia 1944 roku, decyzja o jego wywołaniu zapadła w Londynie ad hoc! Wg inteligencji dezerterów z roku 1939 zamelinowanych w Londynie jako rząd Polski, zwycięskie powstanie w Warszawie z Niemcami, pozwoli im na powrót do Polski jako legalnej władzy. To oni – jako prawowita legalna władza, przywitają wchodzące do Warszawy sowieckie wojska. Nie wiem jakie to prawo sprawowania władzy miał rząd dezerterów, rząd tchórzy, który nas porzucił na pastwę losu w roku 1939 nie podejmując nawet walki! Przeciw wywołaniu powstania byli Anglicy i USA, którzy wcześniej wyrazili zgodę na powołany przez Stalina rząd PKWN. Mimo stanowiska rządu Anglii i USA niewywoływania powstania, ludobójcy z londyńskiego rządu wywołali powstanie. Pięć lat nieludzkiej niemieckiej okupacji sprawiało, że chętnych do wojny z okupantem było dużo więcej niż broni. Zapewnienia przywódców, że powstanie jest pomocą dla wojsk armii czerwonej, że powstanie przyśpieszy wyzwolenie Warszawy, a także ich zapewnienia, o poparciu powstania przez wojska Stalina, które były po drugiej stronie Wisły, dawały powstańcom poczucie siły i gwarancję sukcesu! Te zapewnienia były logiczne, tyle że nieprawdziwe. Przywódcy nie powiedzieli prawdy o powodach powstania. Nie powiedzieli, że powstańcy mają walczyć o odzyskanie koryta władzy dla dezerterów z Londynu, nie powiedzieli, że powstanie jest bardziej przeciw Stalinowi niż Hitlerowi! Londyńscy ludobójcy nie zawahali się dla zdobycia władzy dla siebie zamordować ponad 250 tysięcy niewinnych ludzi, nie zawahali się zburzyć miasta. Żaden z tych zbrodniarzy, którzy wywołali powstanie, nie został ranny, żaden z nich nie zginał, żadem z nich nie został powieszony przez ich ofiary, a powinni być powieszeni! Dziś w III RP ci zbrodniarze są bohaterami władzy, ale tylko władzy. 19 stycznia 1945 roku dowódca Armii Krajowej Leopold Okulicki rozwiązał Armię Krajową. Wielu dowódców oddziałów nie wykonało rozkazu, nie rozwiązali oddziałów, nie powiadomili żołnierzy o rozwiązaniu AK. Od tego dnia każdy oddział przestawał być oddziałem AK i tracił prawo do używania tej nazwy! Każdy dowódca oddziału przemieniał się z żołnierza w bandziora, był panem życia i śmierci, za swoje zbrodnie nie odpowiadał przed nikim!\nCZĘŚĆ IV- OSTATNIA\nNIENAWIŚĆ NIE TŁUMACZY KŁAMSTWA, TO KŁAMSTWA TŁUMACZĄ NIENAWIŚĆ. Zbrojne kupy pospolitych morderców, bandytów, złodziejów, sami mianowali się obrońcami demokracji i w ramach tej „demokracji” napadali na osady, wsie, małe miasteczka, zależnie od stanu liczebności bandziorów. Jako „wyzwoleńcza” armia, wyzwalali z całego mienia napadnięte ofiary, gwałcili wyzwolone kobiety, zabijali dzieci by nie wyrosły na bolszewików, bardzo często palili napadnięte wsie i osady. To herszt bandy ustalał, kto jest komuchem, kogo zabić a kogo nie. Do dziś żyje- być może, nawet kilka tysięcy wiekowych cudem ocalonych ofiar, które w dniu napaści miały 10- 15 lat. Wielu z tych wiekowych świadków widziało twarze morderców swoich rodziców, swoich braci, krewnych, sąsiadów. I na ich oczach, za ich życia, III RP nazwała ich morderców żołnierzami wyklętymi i gloryfikuje jako swoich bohaterów. Ocalone ofiary bohaterów władzy III RP nie mają żadnych ludzkich praw do szacunku, do pamięci, do współczucia. Zakłamanie historii, pisanie jej na nowo, czyni z każdego narodu, naród idiotów, ponieważ gloryfikowanie morderców- niejako z automatu ofiary tych morderców, czyni winnymi swojego losu, czyni wrogami Polski i Polaków, a już na pewno władz III RP. Uzbrojone bandy, byli zwykłymi bandziorami parającymi się terrorem wobec bezbronnej nie uzbrojonej mordowanej cywilnej ludności, rabowali ich mienie, gwałcili kobiety, palili ich domostwa mordując wszystkich mieszkańców osad i wsi. W czyim imieniu te bandy mordowali Polaków? Te bandy nie mieli żadnego wsparcia zagranicy, nawet dezerterzy z Londynu im nie pomagali, londyńscy dezerterzy nie byli rządem, stali się niechcianą bandą błaznów, imali się różnych prac, byli portierami, szatniarzami, magazynierami, kelnerami, byli tym kim rzeczywiście zawsze byli, NIKIM! W czerwcu 1946 roku w Londynie odbyła się defilada zwycięzców, uczestniczyli w niej wojska Francji, Belgów, USA, Anglii, Czechosłowacji, ZSRR Danii, Holandii, Norwegii, Grecji, nie było wojsk polskich. Mimo zabiegów „rządu londyńskiego” nie dopuszczono do uczestnictwa w paradzie żołnierzy polskich, tak samo jak nie dopuszczono do obecności na trybunie honorowej przedstawicieli londyńskiego rządu. Dla Anglii legalnym rządem Polski był ten mianowany przez Moskwę. Wywołanie powstania warszawskiego całkowicie zmieniło relacje aliantów z rządem londyńskim, z dotychczasowych złych relacji na jak najgorsze! Europa została podzielona w 1943 roku w Teheranie na strefy wpływów, my przypadliśmy ZSRR. Prawda jest taka, że ZSRR przestrzegał ustaleń w Teheranie o strefie wpływów. Nawet najmniejsza, jakakolwiek pomoc ZSRR dla Grecji, Francji, a także Włochom, czyniła z tych państw socjalistyczne państwa i to w oparciu o demokratyczne wybory! Alianci nie ryzykowali wywołania gniewu najpotężniejszej armii świata. W sierpniu 1944 roku w Grecji wybuchło powstanie zakończone w kwietniu 1945 roku, powstanie przeciw powrotowi króla, który uciekł do Anglii po napaści Włoch i Hitlera na Grecję. Teraz wspierany przez Anglików wracał do Grecji. Grecy nie chcieli monarchii, chcieli socjalizmu na wzór głoszonego przez Tito. Co się stało? USA zwolnili z obozów jenieckich 8 tysięcy SS- manów i razem z Anglią, zamordowali greckie powstanie! O tym wszystkim wiedział ZSRR. Ta zbrodnia ludobójstwa w Grecji, była powodem klęski wyborczej Churchilla. We Francji komunista Maurice Thorez miał co najmniej 60% poparcia Francuzów, we Włoszech podobne poparcie miał komunista Palmiro Togliatti. ZSRR w roku 1944 – 1945 był najsilniejszą armią świata, byli silniejsi niż wszystkie wojska Europy razem wzięte, pięć milionów ludzi pod bronią. Jakiekolwiek wsparcie polityczne ZSRR dla wymienionych państw czyniło jest państwami socjalistycznymi! O tym zielonego pojęcia nie miał kabaretowy rząd londyński! O tym pojęcia nie mają „naukowcy” z III RP. Zbrojne bandy na terenie naszego kraju. nikogo nie reprezentowały! To byli zwykli uzbrojeni bandyci. Gdyby ktoś wątpił w logikę moich argumentów, to moje pytanie proste. Skoro mordercy Łupaszko, Bury, Ogień, Żubr, i stu innych bandytów, a także bandziory z NSZ i WiN, rzeczywiście jak chce propaganda III RP walczyli z komunistami, to dlaczego nawet nie próbowali zjednoczenia swoich sił w walce przeciw wspólnemu wrogowi, komunistom? Jak można uwierzyć, że bandy walczyli z władza komunistyczną? Jeżeli walczyli to wtedy i tylko wtedy, gdy LWP, KBW, UB osaczyli ich w jakiejś wiosce, którą akurat mordowali, to wtedy podejmowali walkę by uciec! Tak wyglądały walki tych bandziorów z komunistami! Okupacyjne władze III RP z uporem mieszają pospolitych bandytów, z żołnierzami AK, z uporem okłamują nas, że żołnierze wyklęci, to byli również żołnierze AK. To nie prawda! Nie ma ani jednego przypadku, ani jednego, by jakikolwiek oddział AK napadł na polską wieś i mordował mieszkańców, lub rabował ich mienie, bez względu na to, jakiej politycznej orientacji byli mieszkańcy. Poza tym, mordercy wyklęci mordowali nas po wojnie, a AK, została rozwiązana 19 stycznia 1945 roku! AK było wojskiem apolitycznym, komuch nie był ich wrogiem, tak samo jak ich wrogiem nie był żołnierz armii czerwonej. Z powodu apolityczności, Armia Krajowa nigdy nie wchodziła w żadne sojusze ani z NSZ, ani z WiN, mimo ich zabiegów. Schwytani przez władze bandyci, wszyscy i bez wyjątku, przedstawiali się jako żołnierze AK. Okupacyjne władze III RP, ochoczo mieszają żołnierzy AK, z mordercami, bandziorami i złodziejami, których nazywają żołnierzami wyklętymi. AK nigdy nie napadli na Polaków, nigdy nie mordowali Polaków, bez względu na ich polityczne konotacje. Zamordowany generał Fieldorf Nil nie dał się namówić mordercom wyklętym do wojny przeciw władzy. Ostatnia sprawa. Ohyda oskarżenia bohaterów LWP za akcje Wisła przez okupacyjne władze III RP. Nazwanie tej akcji wojenną zbrodnią, to atest idiotyzmu władz III RP, to dowód zwyrodnienia tej władzy, mamy pełne prawo by te władze uznać za okupantów, za wspólników ukraińskich zbrodni na Polakach. Powodem akcji Wisła były mnożące się nocami napady uzbrojonych banderowskich band, na Polaków. Napadali które na nasze osady, na nasze wsie i zagrody zamieszkałe przez Polaków. Banderowcy mordowali Polaków paląc całe wsie, osady, paląc polskie zagrody. Pomocy, schronienia i informacji dostarczała im miejscowa ludność ukraińska. Wyjściem z tej sytuacji było; albo pacyfikacja całego terenu zamieszkałego przez ludność ukraińską i wybicie do nogi wszystkich mieszkańców razem z banderowcami, albo wysiedlenie ludności ukraińskiej, czyli pozbawienie ukraińskich band schronień, pomocy i informacji o działaniach polskiej władzy. Władze, wybrali bardziej humanitarny sposób niż czystka etniczna i wysiedlili ludność ukraińską na tereny odebrane Niemcom. Moim zdaniem był to błąd. Bo gdyby wybrano opcję czystki etnicznej, nie byłoby żadnej banderowskiej gnidy w naszym kraju! A tak wysiedlone bękarty naszych banderowskich ludobójców, rozmnożyli się jak wszy i obleźli nas jak wszy. Mądrzy ludzie powiadają, że popełnione błędy przez władze potrafią szkodzić całe wieki! Mądrość tych ludzi potwierdzają nasze czasy, widzimy co się dzieje, widzimy z rozmysłem budowaną w interesie USA nienawiść do Rosji, a okupacyjne władze robią wszystko co możliwe by unicestwić nasz naród raz i na zawsze! NATO nie jest i nigdy nie był paktem obronnym europejskich frajerów! NATO jest pierwszym okopem obrony USA przed ewentualnym kontratakiem napadniętej Rosji przez kundli z NATO! To Europa ma umierać w obronie USA, a nie USA w obronie Europy! 16.09.2021.\n.\nPRZEDRUKOWANO- milego czytania.",
			"added": 1633712757
		},
		{
			"topic_id": 1636101927,
			"title": "Umowa na zakup szczepionek, firmy — Pfizer.",
			"body": "Umowa na zakup szczepionek, firmy — Pfizer.\n.\n. Autor - Sławek Slawo\n.\nSzokująca umowa na zakup szczepionek! Pfizer za nic nie odpowiada, umowy nie można wypowiedzieć, produktu nie można zwrócić.\nReklamy z celebrytami, billboardy, ogromne kwoty dla mediów na promocję Narodowego Programu Szczepień, a z drugiej strony zastraszanie i szykanowanie niezaszczepionych z groźbą pozbawienia zarobków włącznie. Tak wygląda promocja „dobrowolnych” szczepień przeciw Covid-19. Dlaczego nie zgłasza się większości niepożądanych odczynów poszczepiennych? Dlaczego terapia tanimi lekami antywirusowymi, takimi jak amantadyna i iwermektyna, jest dyskredytowana? Dlaczego wciska się szczepionki ozdrowieńcom, chociaż mają naturalną odporność?\nOdpowiedzi na te pytania znajdziecie w umowie, jaką firma Pfizer zawarła z rządami kupującymi szczepionkę. Umowa objęta jest klauzulą tajności, ale w styczniu 2021 roku ujawniono wzór takiej umowy zawartej z rządem Albanii. W lipcu umowę zmieścił na swoim portalu Ehden Biber, specjalista ds. bezpieczeństwa informacji analitycznych z Uniwersytetu Londyńskiego. W oparciu o informacje na temat umowy zawartej przez Pfizera z rządem Brazylii Biber wykazał, że umowa z Albanią jest umowa standardową zawieraną z rządami wszystkich państw.\nW umowie znajdują się następujące klauzule:\n1) postanowienia umowy stoją ponad prawem krajowym jako wyłączone z przepisów dotyczących zakupów publicznych;\n2) produktu nie można zwrócić;\n3) umowa nie może zostać unieważniona nawet jeśli przed dopuszczeniem produktu pojawi się inna szczepionka lub skuteczny lek na Covid-19;\n4) nabywca potwierdza, że skutki długoterminowe i skuteczność szczepionki nie są obecnie znane i że mogą wystąpić niepożądane skutki szczepionki, które nie są obecnie znane;\n5) nabywca musi zapłacić firmie Pfizer za zamówione dawki, bez względu na to, ile ich zużytkował i niezależnie od tego, czy zakontraktowane dawki zostały dostarczone zgodnie z datami dostawy określonymi w umowie;\n6) firma Pfizer nie będzie podlegać karom za opóźnienia w dostawie, ani nie będzie za nie odpowiadać, a niedostarczenie dawek nie daje nabywcy prawa do anulowania zamówienia;\n7) nabywca przyjmuje na siebie finansową odpowiedzialność za wszelkie roszczenia pod adresem firmy Pfizer z tytułu pozwów, żądań, strat, szkód, zobowiązań, rozliczeń, kar, grzywien, kosztów i wydatków na reprezentantów prawnych poniesionych w związku z badaniami, produkcją i stosowaniem szczepionki;\n8) nabywca rezygnuje z wszelkich przepisów, które mogą ograniczać obowiązek zapłaty odszkodowania na rzecz firmy Pfizer;\n9) umowa pozostaje tajna przez 10 lat.\n.https://wprawo.pl/szokujaca-umowa-na-zakup-szczepionek-pfizer-za-nic-nie-odpowiada-umowy-nie-mozna-wypowiedziec-produktu-nie-mozna-zwrocic/\n\n. Potrzebny jakiś Komentarz?\n.\nPozdrawiam.",
			"added": 1636101905
		}
	],
	"topic_vote": {},
	"next_comment_id": 68,
	"comment": {
		"1557338480_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": [
			{
				"comment_id": 1,
				"body": "Nie znasz  goscia . Probuje wam zapalic swiatelko w ciemnym tunelu. Przeczytaj jego inne art. To moze wtedy zrozumiesz o co mu chodzi.",
				"added": 1563566829
			},
			{
				"comment_id": 12,
				"body": "+NIECH - ZYJE - ZERONET.- TAK TRZYMAC. NARESZCIE COS SIE DZIEJE.",
				"added": 1580162067
			}
		],
		"1565086389_1JZcGPhLfmeACHEXu4R16hrU2Rz6wBgYoY": [
			{
				"comment_id": 2,
				"body": "cos wiecej w tym temacie.Czy to tylko haslo.",
				"added": 1565098866
			},
			{
				"comment_id": 3,
				"body": "To i tak dosyc sporo.",
				"added": 1565181099
			},
			{
				"comment_id": 4,
				"body": "popieram ostatni wpis.",
				"added": 1576438427
			}
		],
		"1576540772_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 5,
				"body": "Probowalem, i tez nie dalem rady. Gdzie tkwi haczyk? kto wie?",
				"added": 1576634253
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 6,
				"body": "Nareszcie cos sie dzieje. Popieram te stanowisko. Oby nie umarlo smiercia naturalna. Bledy z powodu klawiatury.",
				"added": 1577684056
			}
		],
		"1577790114_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 7,
				"body": "Podobne podejrzenia chodzily mnie po glowie. test pokazuje straszna lipe. prywatnie porozmawiajmy. ok.",
				"added": 1577798846
			},
			{
				"comment_id": 9,
				"body": "A zauwazyliscie?Jest tytul, a filmu niema?Niemozna go pobrac i obejrzec. Z tekstami, chyba niema problemu?",
				"added": 1577850566
			}
		],
		"1562960205_12p9JsmWBNB2FGXhrACxyF1TdvJzsbwQcu": [
			{
				"comment_id": 8,
				"body": "To kudlate niszcza ten kraj, oni niszcza wszystko; to sa pastuchy, trawa wyjedzona, to przenosza sie ze stadem dalej.",
				"added": 1577850319
			},
			{
				"comment_id": 10,
				"body": "To nic nie pomoze.Dzieci i ryby glosu nie maja.",
				"added": 1578150642
			}
		],
		"1579004517_17L8tN9xz17h6MX5JY5fqfGFocsMF34xBf": [
			{
				"comment_id": 11,
				"body": "Ciekawe sprawy opisujesz. Uczyli w szkole inaczej. Co jest prawdziwe?",
				"added": 1579097905
			}
		],
		"1580479193_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": [
			{
				"comment_id": 13,
				"body": "czesc, ja tez przylaczam sie do play listy.Dobre materialy, dawno nie bylo takich.wialo straszna malizna. tak jakby wszyscy wyjechali do usraela.Trzymaj sie.",
				"added": 1580739176
			}
		],
		"1581827701_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 14,
				"body": "-Ja tez, dolaczylem.Poprawione, sprawdzone.",
				"added": 1581961655
			}
		],
		"1577974129_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 15,
				"body": "Dzieki, za wytlumaczenie Poczty. Musze poprosic kogos . Zeby pokazal, jak to zrobic. jeszcze raz dzieki.wiem gdzie szukac.pozdrawlaju.",
				"added": 1582462678
			}
		],
		"1594760103_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 16,
				"body": "brak  polaczenia, musisz miec wlaczonego kompa caly czas. To podstawa dzialania tej struktury. Samo zalozenie  nic nie da.",
				"added": 1594797272
			},
			{
				"comment_id": 17,
				"body": "ok. Jasna sprawa. ZeroNet, nie posiada serwera. Po wrzuceniu materialu, ty jestes serwerem. Dopiero jak ludzie to seeduja? mozesz sobie odpuscic. Ja mam wlaczone, 24-godz, 7-dni, dopiero wtedy to dziala dobrze. To dotyczy pojedynczego artykulu, jak i calej strony. Szczegolnie, wazne, kiedy uruchamiasz strone. To wtedy nie mozesz wylaczac komputera. Bo ludzie sie zniecheca, do tej strony. To jest bardzo wazne co pisze.\nzycze sukcesu.",
				"added": 1594881994
			}
		],
		"1599340028_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 18,
				"body": "Ciekawy temat, nic tylko za jaja powiesic na drzewie.",
				"added": 1599424281
			}
		],
		"1600583969_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 19,
				"body": "Ograniczyc uzywanie, a najlepiej nie uzywaj. 4G- tobie wystarczy. tez sie we lbie gotuje.",
				"added": 1601129052
			}
		],
		"1602100215_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 20,
				"body": "Jak zwykle ciekawy tekst, ciagle ktos przeszkadza? 500-korporacji kontroluje caly swiat. A wszyscy sie zgadzaja w milczeniu.",
				"added": 1602331964
			}
		],
		"1602175828_1SnUUubRedJiUiefFonKSufh3VFNE9yZa": [
			{
				"comment_id": 21,
				"body": "Chyba chodzi mu jak sie schowac? Schronic, przed tym promieniowaniem?Teraz to juz trudno to zrobic. Rentgen przenika, celnicy przeswietlaja towary: czyli promieniowanie przenika.",
				"added": 1602332264
			}
		],
		"1602803269_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 22,
				"body": "Juz przeczytalem, polecam. Kto by pomyslal. Strach rozmawiac przez telefon. A co z bezpiecznymi polaczeniami internetowymi.",
				"added": 1602811157
			}
		],
		"1603889744_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 23,
				"body": "Tak to wszystko jest nadal aktualne.",
				"added": 1604596998
			}
		],
		"1604953099_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 24,
				"body": "To maska moze wiecej szkody zrobic, jak pozytku z niej. Probuja nas wszystkich zalatwic. Czas zeby ludzie wreszcie zrozumieli, co jest grane.",
				"added": 1604965946
			}
		],
		"1605693059_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 25,
				"body": "Ciekawe , przydalo by sie wiecej takich materilow. Straszna cisza na tym forum? Czy tutaj jeszcze ktos zywy mieszka. czy wszyscy wyjechali do Chin.",
				"added": 1605837437
			}
		],
		"1605668877_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 26,
				"body": "A to jest niespodzianka. Tego po Dunczykach  trudno bylo sie spodziewac. Maja jaja chlopy.",
				"added": 1605837565
			}
		],
		"1605642993_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [
			{
				"comment_id": 27,
				"body": "Chyba driud, ma racje. Cos tam smierdzi na odleglosc.",
				"added": 1605837670
			}
		],
		"1606098793_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 28,
				"body": "cytuje, - oglądaj sekurakowe live-streamy o bezpieczeństwie IT.\nTak, mozna tam trafic ciekawe rzeczy.",
				"added": 1606160648
			}
		],
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 29,
				"body": "Ciekawe rzeczy piszesz. Gdzie ta wiedze mozna zdobyc. Pregladam internet, ale tam niewiele jest w temacie. Zle szukam, skad wziasc linki. do tego tematu.",
				"added": 1606543314
			}
		],
		"1606888581_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 30,
				"body": "Tak, to jest interesujace.Wielka Rodzina, trafne okreslenie. Wszyscy sie znaja, i sa powiazani wiezami krwi. w slangu pilkarskim, graja do jednej bramki.",
				"added": 1606966552
			},
			{
				"comment_id": 31,
				"body": "Spoleczenstwo juz przestalo myslec.   Rodzina powiazana interesami.   Taka Wloska mafia, kostra nostra.\n Nzawa zostala zmieniona na, - NWO.   To jest cala roznica. Reszta, ze srajfonem przy uchu.",
				"added": 1607265258
			}
		],
		"1606679881_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 32,
				"body": "Cos sie z internetem dzieje, w nocy wylaczaja. czy u was tez tak sie dzieje? Rozlacza ZeroNet? Router trzeba restartowac. Przypadek? Czy zamiezone.",
				"added": 1607494318
			}
		],
		"1608325060_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 33,
				"body": "Ja, sie chyba niedam zaszczepic. Tak na wszelki wypadek. Moje ryzyko. Duzo skladnikow ma ta szczepionka? To sa wszystko szkodliwe skladniki, dziwne.",
				"added": 1608325657
			},
			{
				"comment_id": 34,
				"body": "Napisalem o sobie i swojej rodzinie, co zrobimy. Co zrobia inni, to mnie wisi. To co wiem, to wystarczy, zeby tego na tym etapie zycia nie zrobic. Bo bedzie bolalo. Skad wzioles taka liczbe, 90%. Z sufitu. Rozejrzyj sie w kolo. wszyscy o tym mowia. Jeszcze jedno, szczepionka to nie jest lekarstwo. Szczepionka to zakazenie organizmu choroba.",
				"added": 1608358831
			}
		],
		"1608360093_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 35,
				"body": "Potwierdzam swoja obecnosc, plus zona. A przy okazji , zeby nie bylo pustych przebiegow. \nLink do filmu profesora Zdanowa o alkocholu, wyklad.  Warto zobaczyc. Ida swieta, wiec alkocholu nie zabraknie. \nMoze kapke mniej wypijemy?\n.\nhttp://127.0.0.1:43110/15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h/?watch=1583335583_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH",
				"added": 1608463334
			}
		],
		"1608467155_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 36,
				"body": "Swieto slowian, ktore nie jest za bardzo lubiane przez katolikow, raczej kosciol. zbyt mocna konkurencja dla katolikow. Popieram Sczodre Gody.",
				"added": 1608470455
			}
		],
		"1609163095_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 37,
				"body": "*Jak tam Putin sobie radzi z koroną*\n.\nZ tego co widać gołym okiem, to robi powoli ale systematycznie. Robi uniki, długo się zastanawia. / robi to celowo /. Tak jak zrobił z główną księgową. Przesunął Ją na pozycję wyższą niż była, tylko na tym nowym stanowisku nic nie mogła już zrobić. Pęnsja była wyższa, był Medal, Laurka kwiaty telewizja.. Był Awans który do niczego nie prowadził. Taka taktyczna zagrywka. Została dalej pod kontrolą, ale już bez zębów. Już nie mogła ugryźć.\nCo do aktualizacji, to nie ma problemu. Materiału jest dużo, To zależy jak bardzo temat będzie związany z nami.",
				"added": 1609183376
			},
			{
				"comment_id": 38,
				"body": "Odpisuje, jak tylko moze.",
				"added": 1609346638
			}
		],
		"1608946398_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 39,
				"body": "* 21.12.2020 to nie był dzień żadnej katastrofy naturalnej*\n.\nTo tylko dzien przesilenia slonecznego. Od tego dnia, przybywa codziennie \"Dnia\".\nCzipowanie, bylo, jest, i bedzie, a kto bedzie czipowal? To zalezy od panstwa.",
				"added": 1609540037
			}
		],
		"1610376246_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 40,
				"body": "Ten link nie dziala, sprawdzalem.",
				"added": 1610430749
			}
		],
		"1610797003_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 41,
				"body": "BARDZO SLUSZNA UWAGA. Nie zawsze to co nowe, jest dobre. Ciagle sa wrogowie wolnosci. SLOWA.\nPamietajmy o tym.",
				"added": 1610847116
			}
		],
		"1610225804_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 42,
				"body": "Ja tez testowalem pare linux-ow, i ciagle poszukuje lepszego rozwiazania. to pozwala na biezaco poprawiac systemy.",
				"added": 1610847413
			}
		],
		"1611351944_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 43,
				"body": "Skad bierzesz te materialy. Sa niesamowite. Tak trzymaj.",
				"added": 1611352072
			}
		],
		"1611813988_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 44,
				"body": "Czy watykan rzadzi? To jest bez znaczenia, on jest na szczycie piramidy rzadzenia. Opolczyk dzieli wlos na cztery. Jest Watykan, Jest Londyn, Jest Waszyngton, Sa bankierzy, powiazani z ta grupa. To jest sitwa, na szczycie tej piramidy. My na dole zawsze mamy lomot od nich. Dla nas to niema wiekszego znaczenia.",
				"added": 1611845821
			}
		],
		"1613302394_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 45,
				"body": "Opolczyka teksty sa dobre. Podaje ciekawe fakty. Jest dobrze zorientowany w sytuacji. Warto przeczytac.",
				"added": 1613392390
			}
		],
		"1613835910_1GcPQswRskdfDPjH9jihgBWpJFGgLHLaC8": [
			{
				"comment_id": 46,
				"body": "Mozna tez cos znalezc, w ZeroSites, w prawym gornym rogu jest, / submit new site /. Do czego to jest? to niewiem, ale moze zajrzyj i sprawdz. Jest jeszcze troche na ten temat na , Zero Wiki- Polska, / przeczytaj jak dodac strone /. Sprawdz te dwa miejsca, moze cos tam znajdziesz? Ja tez nie wszystko kumam, jak to dziala?\nPisze tam, ze trzeba zamienic koncowke, adresu? Moze to cos pomoze, przeczytaj.",
				"added": 1613836636
			},
			{
				"comment_id": 47,
				"body": "Zastanawiam sie czy samemu nie zalozyc jakiejs strony? Musze pomyslec. Wszystko zostalo wytlumaczone.\nJak to zrobic.",
				"added": 1613927968
			}
		],
		"1613863319_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 48,
				"body": "Panowie, Ja uzywam Yanex-a, i chwale sobie ta decyzje. Bylem uprzedzony do Rosyjskich dystrybucji. Temu byla winna propaganada, ktorej sie nasluchalem w swoim zyciu. Teraz widze ze to byl blad? To tak przy okazji, taka uwaga. Nikt nie musi nasladowac, ale ten kto sprobuje? To sam sie przekona o racji tego stanowiska. Uwaga. sa dwie wersje, angielska i Rosyjska. One sie roznia. Po mojemu Rosyjska jest lepsza. Ale jest to rzecz gustu. Polecam sprobowac, i odrzucic animozje zaszczepione nam przez koniokradow. / jest to dobre okreslenie /. Zazwyczaj patrzymy daleko, a mamy pod nosem cos , co warto jest zuwazyc. Rozwarczie ta propozycje.\nZapamietajcie, jesli cos jest mocno reklamowane? To jest mocno to podejrzane...",
				"added": 1614258701
			}
		],
		"1614277389_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 49,
				"body": "Dla wiekszosci, to jest bezradnosc duzego stopnia. jakich konkretow oczekujesz?Prawdopodobnie przygotowuja jakies nowe gowno, ktore ma to dotychczasowe  ZASTAPIC. Bedzie lepiej obserwowac wszystko. nie zapominajcie o sztucznej inteligencji.",
				"added": 1614285900
			}
		],
		"1615135071_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 50,
				"body": "Niesamowite? Dwa razy czytalem. Dobra robota. Jestem w szoku. Jak ONI nas robia w konia. Odjelo mnie mowe.",
				"added": 1615295268
			},
			{
				"comment_id": 59,
				"body": "Odpowiedzią, jest blokada nałożona na ludzi; Ludzie nie potrafią już samodzielnie myśleć. Sposób myślenia jest im podany na tacy, jako wzór;\nto jest dobre i prawdziwe. A to jest złe i Fałszywe.\nLudzie reagują jak zahipnotyzowani. Promieniowanie jest tylko pośrednikiem w dotarciu do komórek mózgowych. Które wykonują polecenia.\nZ czym jest związana ta choroba??? Na pewno z głupotą tych ludzi, pozostałe składowe tego zjawiska to ; - LENISTWO, NONSZALANCJA, PRZEKUPSTWO, ZASTRASZENIE, ogólny brak sprzeciwu – i reakcji na tą napaść na człowieka. Tekst opisuje prawdziwe zależności i przyczyny tego zjawiska; wystarczy wyeliminować parę z tych przyczyn? I choroba sama znika. Jeden potrzebny jest warunek, odpowiednia – WIEDZA -.\nA tej nagminnie brakuje ludziom.\nPytanie pomocnicze? Czy to są jeszcze ludzie??? To że chodzą , oddychają, jedzą, śpią, - to nie znaczy , że to są jeszcze ludzie: To są zaprogramowane roboty, takie „Bio – Roboty”",
				"added": 1620638472
			}
		],
		"1615329718_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 51,
				"body": "Duzo w tym jest prawdy. Pracujemy jak kon, doja nas. I jestesmy uwiazani na lancuchu. Ktos to dobrze zauwazyl.",
				"added": 1615408163
			}
		],
		"1618281489_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 52,
				"body": "Ciekawe spostrzezenia?Co z tym lozkiem?Czemu ma byc krzywe?",
				"added": 1618322423
			},
			{
				"comment_id": 53,
				"body": "Ja tez slyszalem, ze glowa na polnoc?Jaka jest prawda?",
				"added": 1618322526
			}
		],
		"1618538921_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 54,
				"body": "Panowie, niedlugo juz koniec. Juz na jesieni wchodzi nowy internet niezalezny. Pozostalo jescze pare miesiecy do wprowadzenia i zinstalowania. Koniokrady sie zesraja na rzadko. YANDEX, jest juz do tego przystosowany i przygotowany. Bedziecie mieli do wyboru, zmiane albo pozostac dalej w szambie. To postawi swiat na glowie. A co do Linux-a, to jest to dystrybucja dla ludzi? Matoly pozostaja na windowsie, z wyboru? Albo z glupoty. Rosja wprowadza nowe dystrybucje oparte na Linux-ie, zasila one urzedy i wojsko. To wszystko jest juz instalowane, dlatego jest tyle szkolen bezplatnych dla ludzi. Wisienka na Torcie bedzie nowy internet.",
				"added": 1619351430
			}
		],
		"1618366115_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 55,
				"body": "Zapewniam bedzie tego wiecej, to zalezy od wielu spraw? Gdybyscie znali Rosyjski? To bym was zasypal wiadomosciami, ze swiata. Nie wszystko da sie przetlumaczyc.",
				"added": 1619351589
			},
			{
				"comment_id": 56,
				"body": "Bedzie sie dzialo.",
				"added": 1619507074
			}
		],
		"1619507046_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 57,
				"body": "Panowie pogodze was. Powstal internet Kwantowy, jest juz i dziala. Moskwa , Sant Petersburg. Czapki z glowy.",
				"added": 1620570348
			}
		],
		"1607453657_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 58,
				"body": "Popatrzeć należy na to z dystansu historii. Ile razy atakowała Rosja kogoś? A ile razy była ona sama napadana i atakowana? Podam inny przykład. Chiński mur, zwróćcie uwagę jak on jest zbudowany? Z której strony na niego się wchodzi? I które ściany ma wysokie, a które ma niskie.\nTen mur , to nie zbudowali Chińczycy. To był mur przed napaścią ze strony Chin. To było zbudowane przeciwko Chińczykom. Tyle mówi prawdziwa Historia. A dzisiaj, jakie bazy otaczają Rosję i czyje one są? Kto jest otoczony? A kto otacza? To mamy odpowiedz kto jest AGRESOREM.",
				"added": 1620637132
			}
		],
		"1623191172_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 60,
				"body": "Czy tylko mleko jest zatrute? Czy wszystko jest zatrute? Czy nas chca pozabijac?",
				"added": 1623330003
			}
		],
		"1625955253_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 61,
				"body": "Popieram, jestem ZA. Masz moje wsparcie. Zawsze i wszedzie.",
				"added": 1625955571
			}
		],
		"1626053945_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 62,
				"body": "Panowie, to dzieki Rosji, niema jeszcze tutaj wojny. To wredny Putin, wstrzymuje ten holokaust. Jego wywarzone ruchy, wytracaja oreze z rak przeciwnika.",
				"added": 1627792723
			}
		],
		"1628313902_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 63,
				"body": "Sama nazwa, jest co najmniej dziwna? A moze nie jest dziwna?Glowa moze rozbolec.",
				"added": 1628511311
			},
			{
				"comment_id": 64,
				"body": "To jest ciekawe, masz cos wiecej na temat lucyfera? To podeslij prosze.",
				"added": 1629018999
			}
		],
		"1634884167_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 65,
				"body": "Juz dziala. Dzieki. Z tego co widze to bomba.",
				"added": 1634886687
			}
		],
		"1620938699_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 66,
				"body": "Kto o tym wie? Kto ulegl presji? i opresji? Sprawdzaja co jeszcze mozna zapierdzielic?",
				"added": 1634901828
			}
		],
		"1637657368_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 67,
				"body": "Trzeba kupic inna maszyne. Co kopiles to masz.",
				"added": 1637675325
			}
		]
	},
	"comment_vote": {}
}