{
	"title": "cgm616",
	"description": "trying out this distributed thing",
	"links": "- [Github](https://github.com/cgm616)\n[Twitter](https://twitter.com/cgm616)\n[ZeroNet](https://reddit.com/r/zeronet)\n",
	"next_post_id": 28,
	"demo": false,
	"modified": 1458513714,
	"post": [
		{
			"post_id": 27,
			"title": "Check out 0rc!",
			"date_published": 1458513369.87,
			"body": "Me, hhes and a few other people have been working on 0net Relay Chat, a slack-like replacement for IRC on 0net. It is still heavily WIP, but come check it out at [dev.0rc.bit](http://127.0.0.1:43110/dev.0rc.bit)!"
		},
		{
			"post_id": 26,
			"title": "Starting to learn python",
			"date_published": 1450049130.528,
			"body": "Just started to learn python. I know general programming concepts, but not Python specifically or its syntax, so this was new for me. I love it. Coolest thing? `for line in file:` This is so great.\n\nAnyways, I made a python script, that when run, creates a copy of itself in the same directory. I think it's pretty cool.\n\n```python\nimport os\nimport binascii\n\ndef replicate(path):\n    #\n    # Replicate a file given the path of the current file.  Opens current file\n    # and new file and reads all lines into new file.\n    #\n    with open(get_new_filename(path), \"w\") as newfile, open(path) as program:\n        for line in program:\n            newfile.write(line)\n\n\ndef get_new_filename(old_name):\n    #\n    # Gets a new filename given a filename to work off of.  Splits the old name\n    # by periods, then adds a random hex string right before the filetype\n    # ending.  Given 'files.py', a valid output would be 'files-2b57f5.py'.\n    #\n    # The function also checks for collisions and adds another random string to\n    # the end if necessary.\n    #\n    # http://stackoverflow.com/a/2782293\n    #\n    broken_name = old_name.split('.')\n    while True:\n        ending = '-' + str(binascii.b2a_hex(os.urandom(3))).replace('\\'', '')\n        broken_name[-2] = broken_name[-2] + ending\n        name = '.'.join(broken_name)\n        if not os.path.exists(name):\n            break\n    return name\n\n\nif __name__ == '__main__':\n    replicate(__file__)\n```\n\nI want to do something with my new knowledge, but I don't know what. I think an entire os made of python would be pretty cool, but my skills are definitely not at the level, and python might be too high level and slow."
		},
		{
			"post_id": 25,
			"title": "Nginx, Let's Encrypt, and https",
			"date_published": 1449943325.496,
			"body": "Just finished upgrading one of my servers to using https on my domain. Go check it out at [dep.cgm616.me](https://dep.cgm616.me).\n\nPretty rough process, especially as I've never done this, but google was my kind friend and I figured it out. Lots of nginx errors and so on. Best part of the whole ordeal: no errors when configuring and building nginx from source. That was so surprising but immensely welcome.\n\nI was able to get an A+ on SSLLabs test online, so that's pretty exciting. I have a personal ZN proxy for use with my phone on this server, and it was messed up, but I'll see if I can get that working over https.\n\nPast this, I want to see if I can mirror this blog into the real web and enable https for that. Might need a different server, this one is already doing tons of stuff."
		},
		{
			"post_id": 24,
			"title": "Swift!",
			"date_published": 1449793388.737,
			"body": "Swift looks so cool. The open source way Apple is playing is pretty great. Time to setup a dev environment and play around."
		},
		{
			"post_id": 23,
			"title": "Why isn't my kernel working?",
			"date_published": 1449793265.6,
			"body": "So I start to follow the guides, add in all of the processor checks to get to long mode, and suddenly it stops to show okay. Time to do some debugging."
		},
		{
			"post_id": 22,
			"title": "Cross-compiling GRUB for x86_64 on Mac",
			"date_published": 1448428931.695,
			"body": "It is very hard and convoluted. Many hours went into figuring this out. I was eventually able to do it, but I had to not only modify source files, but also the Makefile. It also took ots of Googling, but it should work now."
		},
		{
			"post_id": 20,
			"title": "Messing with assembly",
			"date_published": 1448403978.483,
			"body": "Recently I've been trying to follow Philipp Oppermann's [excellent set of tutorials](http://os.phil-opp.com/) on creating a kernel using rust. I haven't ever done any rust or assembly programming, so it's very new. I also have only a tiny understanding of hexadecimal or the low level parts of a computer, so that's been interesting.\n\nI haven't actually been able to run any code yet. I'm on a mac, on amd64, not x86_64 like he is programming for. Which means I also need to cross compile binutils. Not that difficult, actually went smoothly without a hitch. However, remember I'm new to all this, so it's all a bit uncertain. Having done that, I need to use the grub-mkrescue command. Cross compiling grub can be done, and I found a guide on how to do it on OSDev wiki. However, I can't seem to get that to work. I'll edit this blog piece later on that mac so I can copy some code snippets in, but objconv is failing with a not very descriptive error on what seems to be not a very special file. I'm still trying to figure it out. This was the millionth error with this process I had to debug, but I like the challenge. Assembly seems really cool, and botting up my own kernel, no matter how useless, will be a fun learning experience.\n\nI'm trying to understand the code as I go, too. Of course the rust is really hard to get, but I'll get there. Right now I can kind of understand what some assembly will do, even if I don't know what it does in a higher sense. I can look at what registers are moving where and whatnot."
		},
		{
			"post_id": 19,
			"title": "Domain up!",
			"date_published": 1447814384.029,
			"body": "If you go to [blog.cgm616.bit](http://127.0.0.1:43110/blog.cgm616.bit), it will redirect to this blog! Sweet! Anyone know how to configure normal web nameservers for it? I have DNSimple, but it can't detect the nameservers for the domain even though I have them in the record in NameCoin."
		},
		{
			"post_id": 17,
			"title": "Just got NameCoins",
			"date_published": 1447786659.411,
			"body": "BTC-E just let me withdraw my NameCoins. At the moment I'm waiting for them to verify, then I'll issue the domain request. You'll eventually be able to find this blog at blog.cgm616.bit.\n\nI don't know what I want to build yet. I think my first priority is making a proof of concept ZeroIndex."
		},
		{
			"post_id": 15,
			"title": "Another idea...",
			"date_published": 1447656090.78,
			"body": "I don't know if this will work, but an alert if you are replied to anywhere in ZeroNet.\n\nWhenever a site you are seeding is updated, the owner sends it to a few peers, then slowly it proliferates through the network, everyone sending it to someone else. \n\nNow, with comments, it's a bit different. The first time, the comment poster contacts the owner of the site then asks for permission to add content. This permission is given, and the public key of that user is stored on the site. The next time they try to post a comment, it no longer has to go through the owner. It can go straight to the peers. [1]\n\nSo every new comment on every site you are seeding eventually goes through you. The client could check these new comments and see who they are replying to. If it is any of the users on that computer, they can make an alert. If not, nothing happens.\n\nThis would not only serve a huge purpose, especially as ZeroNet starts to grow, it would also make the entire network feel very interconnected.\n\n[1] This is my understanding of it. Please correct me if I'm wrong."
		},
		{
			"post_id": 14,
			"title": "ZeroIndex",
			"date_published": 1447616279.996,
			"body": "So, not everybody can easily get domain names. The way I've found websites is either going on ZeroName and clicking every single one, or searching through the all the forums and blog posts I can find.\n\nThere has to be a better way.\n\nI propose ZeroIndex. It has a interface that looks almost exactly like ZeroHello, except instead of showing sites you already have, it shows sites you don't from a list it has. It could be almost like an app store for websites, with new sites and interesting sites. \n\nThe premise would be when you create a new site and have it working, you submit it to ZeroIndex. Along with that submission you include some tags and a short description of what it is. Of course, sites go down. That would be the main problem, but there is a solution. On the client, ZeroIndex would be scanning to see if the sites are still up. If any go down, aka their owner has stopped peering them, and so has everyone else, your client would mark it as down. When someone sees it come back up they mark it as up. Pretty simple. This wouldn't happen very often, because with the decentralized nature sites should very rarely go down.\n\nIt doesn't sound like that hard of a problem. In fact, it sounds pretty easily doable right now. I don't know CoffeeScript, so I probably can't make it, but I'll look into what I can do."
		},
		{
			"post_id": 13,
			"title": "The problem with ZeroNet",
			"date_published": 1447615476.779,
			"body": "There isn't content. Without content, there is no community and there are no users. Without users or a community, there is no content.\n\nThe problem is there isn't a reaosn for people to use ZeroNet. Ordinary people that want to use twitter or such have no reason to switch to ZeroNet. And they can't, there isn't a social media website yet.\n\nI've been trying to think what could be done to remove this problem, and I have a few ideas. We have to get the people who know what this is to make something that would draw in people interested in tech. Then, at least some of these new tech people will make content, and at least some of it will be appealing to a new audience. Then some of those people make content, and so on.\n\nGradually the content diverges from the tech and ZeroNet starts to be used instead of the normal web.\n\nAnother thing we need to help ZeroNet: people knowing about it. It feels polished, and at least partway done, to me. The underlying functionality is all there. The problem is no one knows about it. I knew about IPFS way before I gave a damn about decentralization, simply because so many tech websites were mentioning it, and it reached the frontpage of [Hacker News](http://news.ycombinator.com). I tried to use IPFS, but I couldn't get it to work and in the end it wasn't worth it. I was able to get ZeroNet to work, all I had to do was download it and run a script. Even on windows.\n\nNot only that, it is easy to use. You start the script, it automatically opens a url that provides access. Done. Now you can fully access the network. This level of simplicity among distributed/decentralized networks is un-paralleled. To start a new blog you click two buttons. Starting a website is a bit hard, but that could easily be built into the online interface, or even a native wrapper app around `zeronet.py` and `zeronet.cmd`.\n\nThe thing is, ZN is ready. All we have to do is introduce the world to it, then make them have to use it for a tiny specific thing."
		},
		{
			"post_id": 12,
			"title": "Domain will take until the apocolapse",
			"date_published": 1447572680.518,
			"body": "I was trying to convert the little amount of bitcoins I have to namecoin, and I had to update armory, which took forever. Then I sent everything I had to btc-e to convert to namecoin. This was all fine and dandy, but because I just registered my account on btc-e it won't let me withdraw my namecoins for three days. Or let me convert them back into bitcoins and withdraw those.\n\nThis sucks. I guess I'll have to wait to make a domain name for this blog."
		},
		{
			"post_id": 11,
			"title": "UiPassword plugin",
			"date_published": 1447547820,
			"body": "So remember how I said that `--ui_password` wasn't working? Well, it isn't because it has to be enabled as a plugin.\n\nI guess I'm really good at selectively reading documentation."
		},
		{
			"post_id": 10,
			"title": "Peering machine done",
			"date_published": 1447546575.741,
			"body": "Okay, I'm not going to do a crawler. I do have it working though.\n\nI made a big list of many different sites I could find, added them all to the VPS's ZeroNet instance, and now it's peering them all. Sweet. Only taking a half a gigabyte too."
		},
		{
			"post_id": 9,
			"title": "I figured out the crawler mechanism!",
			"date_published": 1447542458.769,
			"body": "So, I didn't actually figure out the crawler. I figured out how to make ZeroNet download and serve a site without using the web portal.\n\nIn a command line, all you have to do is `wget http://127.0.0.1:43110/[site]` and it will make the request and start peering."
		},
		{
			"post_id": 8,
			"title": "ZeroNet command line options",
			"date_published": 1447542008.636,
			"body": "Okay, so I got ZeroNet running on my VPS. I also made it accessable to the www so can do stuff on it right now. The problem is, anyone can do stuff on it right now. \n\nThe docs say that the `--ui_password [password]` flag will allow me to restrict entrance into the web portal, but that flag doesn't exist according to the lastest version of ZeroNet. \n\nI still haven't figured out how to web crawl, but I think I have an idea."
		},
		{
			"post_id": 7,
			"title": "Using my VPS to mirror lots of sites...",
			"date_published": 1447539858.605,
			"body": "I have a VPS I use for a few Node projects on DigitalOcean. I'm thinking about setting up ZeroNet on it then making it mirror as many sites as I can find.\n\nIt sure has enough cpu time, I'm just wondering how much space it will use and if I can limit ZeroNet to a certain amount of space. Also, bandwidth might be a problem but I don't think so, I'm pretty sure it has unlimited. \n\nI still don't know how I'm going to get it to crawl for websites on ZeroNet. Maybe start on a few then visit every ZeroNet site it finds? I don't want it to be accessable from the web on port 43110, just acting as a peer.\n\nI'll make another post here when I figure more stuff out."
		},
		{
			"post_id": 6,
			"title": "No more peers...",
			"date_published": 1447527883.482,
			"body": "Eh, that's fine. I'm waiting for armory to download the blockchain so I can access my wallet, then I'll convert that to namecoin and buy a domain.\n\nOnce that happens I might get a peer. I'm also going to start posting something on this blog that people want to read.\n\nI really like the idea of ZeroNet, not only for the entire web, but how you can have these little pockets of a network, where everything is invisible if you don't have the right software, but if you do, everything is eternal. It has a certain poetic feeling."
		},
		{
			"post_id": 5,
			"title": "I have a peer!",
			"date_published": 1447517246.828,
			"body": "Apparently this means it's working...\n\nI don't know, because sometimes it still gives the error of \"Publishing content failed.\" Well, let's see. If this post publishes, it works."
		},
		{
			"post_id": 4,
			"title": "Weird",
			"date_published": 1447487407.121,
			"body": "Every other thing is working on ZeroNet, just not this.\n\nI'm able to share likes and comments on other things successfully, just not able to share this blog and seed it apparently. Once I synchronize with the Namecoin network I'll create a domain and route it to here.\n\nHopefully I'll be able to tell if it gets updated because of a tracker or something."
		},
		{
			"post_id": 3,
			"title": "Port forwarding for this blog",
			"date_published": 1447486562.943,
			"body": "I can't for some reason open port 15441. I have UPnP turned on and an explicit port forward, and portchecker.co says its open to the internet.\n\nOnce I figure this out everybody should be able to see this."
		},
		{
			"post_id": 2,
			"title": "Trying this out...",
			"date_published": 1447486001.521,
			"body": "So, is there currently a way for this to be accessed from the normal web?"
		}
	]
}