{
	"title": "天空与宇宙爲一體\n",
	"description": "the sky and cosmos are one\n",
	"links": "**友情链接**\n- [CXG2014](http://127.0.0.1:43110/cxg2014.bit)\n[Maple'sBlog](http://127.0.0.1:43110/cnmaple.bit/)",
	"next_post_id": 28,
	"demo": false,
	"modified": 1509769611,
	"post": [
		{
			"post_id": 27,
			"title": "答父母催我谈恋爱的态度兼谈我对恋爱的思想",
			"date_published": 1509769520.04,
			"body": "#### 一 驳斥农耕时代的恋爱结婚生猴子观\n  从大二开始以来，老爸老妈一直不厌其烦地催我谈恋爱，周周讲，月月讲，年年讲，可以说是搞疲劳战术。但是我至今仍没有向邪恶的旧思想屈服，只是没有人给我点破恋爱这层迷瘴。\n其实追溯起来还得和爸妈的顽固的农耕文明思想有关。农耕生活向来是需花大部分精力来打理耕地养活家庭，所以对于闲置的家庭劳动力（比如我）是有一种天然的顽固的厌恶，一种需要迫切投入实践的资源，况且儒家思想关于传宗接代的理念更加催人心。倘若是在农耕时代，二十几岁（也就是弱冠之年）就该结婚生子了。显然工业时代的大生产彻底打破了农耕文明这种落后的生活方式，显然，适应新的社会形势，一直也应该是晚婚（除等级高的阶层外，你懂的）而老爸老妈是90年代一半包办婚姻加自由恋爱的结果，思想仍然停留固化在农耕文明的角度，只半只脚迈进了工业化文明的门槛，所以一直残存着点叨叨念念。\n说到这里，我们得谈谈什么是喜欢，什么是爱情，什么是婚姻，什么是爱。\n##### 1 喜欢\n先说喜欢，早在《喜欢和爱的标准》一文里，我就说了，**喜欢是生理反应**，是我们人类的兽性，是基因所决定的，是铭刻在血液里，融在骨髓里，一生也摆脱不掉的。可以毫不客气的说，没有喜欢这种最原始的动力，人类火种的传承恐怕早就熄灭了。**喜欢就是一见钟情**，只要满足关于本土文化中关于美的标准（简单的说，只要长得高挑、身材适中，脸蛋漂亮的女人我都喜欢；对于女生来说男的整体气质如脸长得帅，身材适中，发型合适，衣着打扮得体，言谈举止不凡），无论男女，我们都可以喜欢。这不是一件多么见不得阳光的事情，这很自然。关键是我们的大脑需要去审视这些欲望。我的意思不是去压抑这样欲望，你能理解我所说的么？我想表达的是，**在眼睛看到之后，在看见和思想审视之间需要一种间隔，之后事情就会截然不同，不是一连贯的动作，即眼睛接受光学信号，我们的思想立刻运作，这样只会禁锢思维，把新的事物全被旧的思想所吞噬，在这之间，我们需要一种停顿，一种间隔，之后这个世界就全然不同了。**\n\n---\n\n##### 2 恋爱\n**喜欢是恋爱的前奏**，喜欢只发生在见面的一瞬间，只要双方具有相吸引的价值，包括你的外貌、你的言谈举止、你的整体形象，那么双方就有喜欢彼此的潜质。所以，想要谈恋爱，前期得做很多准备如健身塑造身材，整理发型，整理面容，打理衣着，训练言谈举止等功夫，最重要是的要有内涵和修养，而这两种东西只有长期关系中才可以知道这个人是否有内涵和修养（处理事情是体现一个人内涵和修养的最佳手段）。在恋爱期间，男女双方应该彼此享受多巴胺的优惠政策，**就像一个饿了很长时间没有吃饭的人一样**，如此饥饿的去渴望，去实践热恋期间的种种疯狂，因为爱的检验需要去掉性的因素。男人检验一个女人是否“爱”（他认为的爱）他，很简单的，就是看女人是否愿意跟他上床，男同胞应该明白这一点。而女生则不然，因为没有什么是一种硬的标准去衡量对方是否爱她，所以女生在这一点上很可怜。她们往往不知道对方是否真的是”爱“（她们认为的爱，其实不是爱），她们总是处于一种不确定的关系中。而女人追求的是一种关系，一种热恋式的体贴、一种关心、一种包容（这一点我觉得还不如请一个具有未来情感体贴式的智能高级机器人保姆）。通常往往在男人上床之后，男人们会觉得自己已经完成了恋爱的事业了，但是在女生看来他们之间的这种“**爱的索取**（这里我想对这些男同胞感到默哀）”才刚刚开始，所以很多女生很蒙逼，上了床之后对方就完全变了一个样了，以前的种种体贴完全不见了，之前的种种温柔体贴完全消失了，就像变了一个人似的。那么什么是这种分歧的来源了？想一想，先生。因为在女生的脑海里对对方的意象仍是在恋爱期间的种种，那是一种综合了各种你自己对美好事物的意象。这种意象和现实中的他是绝对有差别的，热恋期间只不过是多巴胺的作用使头脑发热的感觉掩盖这种差别，但是一旦多巴胺的效果一消失，这种分歧就是痛苦的根源，因为她们无法接受这样也没有**意识到这样的现实**，她们无法分清楚现实和理想意象的区别，也没有这种**概念**，所有如此种种痛苦如影随形。\n##### 3 婚姻\n至少现在我觉得婚姻是婚姻，恋爱是恋爱，两者要区分开来。不要在恋爱期间谈婚姻的事情，这是超越恋爱阶段的所能承受的。婚姻是很现实的东西，承载这太多现实中利益纠纷和爱这种观念。\n##### 4 爱\n那么，什么是爱？正如我前文《喜欢和爱的标准》所定义的那样，爱和性欲无关，也只有剔除了性欲的影响，才能判断一个人是否会爱，是否值得爱。为了不加大篇幅，忘了的童鞋可以回头看我的那篇博文。\n#### 二 新时代的恋爱（李越的观点外加我自己的私货）\n  先生，坦率的讲，每个人谈恋爱的目的都一样，都是为了排解自己内心的**无助、痛苦、孤独和寂寞**，还有一个东西就是**性欲**，好了，为了不涉及太多，我们可以暂时把痛苦放一边。在现实生活中，为了排解现实中能力缺失带来的无助，为了排解自我局限性所带来的痛苦、寂寞和孤独，还有性欲，通常男人想个找一个女人，而在一起无外乎就这四个原因。然而，多巴胺这种东西，现实生活中可以通过很多途径可以得到，比如；比如你今天买了彩票中了50万，多巴胺急速分泌，你会很开心；如看完了一本精彩的小说也会很使你分泌多巴胺，使你开心。也就是说现实生活中有很多途径去获取，但是很多人不去做。有的人不需要恋爱生活去获得多巴胺，为什么？因为现实其他方面给予他的快乐很多，于是他就不需要通过恋爱来满足。于是乎，这种迫切需要恋爱的人来说，只能说你的生活真的很无聊，你的人生没有价值感，你没有价值观，没有人生观，明白么？一个人有了明确的价值观以后，人生道路才会变得明朗起来。所以总是价值观在前，人生观在后，价值决定人生，而不是人生来决定价值。你把你自己定义为什么样的价值，你就应该有相对应的道路。那些想谈恋爱的人，基本上是生活过得很迷茫，也没有什么成就的人，他可能并没有什么朋友，也没有什么能力，也没有什么学识，对吧？我知道有的人有学历，但我想表达的意思是这个人在现实生活中并没有**很强烈的存在感**，他并没有得到很多人的欣赏、喜欢、尊重，没有得到很多人仰慕甚至是嫉妒都没有，他很孤独，没有人待见他，于是他就无比期望来谈恋爱，通过这种途径来排解这种内心的压抑，或者是性欲来了就无比想要找个人来排解性欲，不管是基于何种原因，反正是他想谈恋爱，想靠一个人来满足这个。这样事情就变得很简单了，因为他只是想找一个人，想找一个人来排解内心的孤独和寂寞，那么，只要是个人，本质上来讲，只要是个人就可以，但可能你会有些要求，细致地来讲，只要是有个人能满足你的要求，都能让你开心快乐。\n  \n  没有谁对你说是对一个人专一、痴情、放不下的，没有这一说。因为你本质上并不觉得这个人值得你喜欢，值得你爱，你本质上谈恋爱的原因**也只是因为你用对方来排解内心的那些孤独、寂寞和不快而已**。也就是说你谈恋爱的目的是**满足你自己的欲望**，而不是因为这个人需要你的帮助，你能帮助对方变得成熟，成长，能够让对方更优秀，不是因为这个原因。也就是说，是个人就行，那么，为什么你会对一个人连连不忘？那就是因为你没有别的人了，或者没别的能够满足你要求的人了，就这样你没有其他的选项了。于是你会对这样一个人念念不忘，你懂得。也就是说，你只要在这段时间内找到另外一个人，你会迅速把对方忘掉。\n生活过得充实不代表充实，每天学习很忙不代表你内心真的真的很充实，真的就热爱你这样的生活。你看那些高中生每天早上六点起床开始学习晚上九点下课十二点睡觉，他过得很充实，他开心，他快乐么？我敢肯定大部分不开心也不快乐，充实不代表你就成功体验到\n\n  快乐，充实不代表你就多巴胺分泌。爱情和友情的最大的区别是一个上床一个不上床而已。所以，怎样让一个人内心充实起来，最简单一件事情你这个人得有价值，这个价值不是你觉得你有价值，而是你能够给别人提供什么价值，也就是你对别人有没有利用价值，别人能不能利用到你，别人是否能够从你身上得到好处，别人能不能因为你给他提供的好处而变得更加优秀，你这个人的价值就存在了。\n那么现在你检视一下你自己，你觉得自己对别人来说有用么？谁都可以缺少你，谁都可以没有你，也不会有谁因为你没了，他们就伤心难过，他们不会这样（除真情的父母外）。为什么有那么多人天天渴望爱情，天天神化爱情，因为性欲没有得到满足，因为现实生活中没有那么强的存在感，没有那么多的充实在等着他。明白么？他把恋爱作为他唯一的依靠，所以现在有很多谈恋爱有很多人分手，因为他们追求的不是爱对方，他们也不是追求自己要成长，需要提升，他们追求的是我快点找个人让我心理爽一爽，肉体上得到欢愉，于是乎激情期一过，他就觉得对方变了，其实本身就是俩个独立的人。\n\n  恋爱中不仅需要平等，而且还需要独立，你得尊重他的独立、他的意见，你们两个从头到尾都是两个独立的人，根本不可能融为一体，你理解么，先生？所以有时候问题不在于表象所表现的那样b简单，分析到最后，你会发现一个人的内心是多么的千疮百孔，而他却从没有意识到，所以一直以来，作为交朋友的也好，谈恋爱也好，对于所有亲密的朋友，都有一个准则，**那就是这个人得有自我改变意识，自我成长意识，有自我突破局限的意识**，有这种意愿。因为我有很多缺点，我也知道，但也有很多缺点我不知道，于是我跟这样的人在一起后，我做了事情让他不开心，他就会来分析，到底是我错了，还是他错了，他就会来告诉我，然后我就会提升得很快。但是你和那种很了不起的人相处，和他处事，他不开心了，不搭理你了，他也不会告诉你，这样两者之间的关系就完结了。所以很多人内心无爱这种东西，没有想过怎么去爱别人，也没有真正的爱过自己。\n  \n  这个世间还有很多人，他们的人生会谈很多恋爱，他们会和很多人纠缠、分开、再纠缠、分开，**他们永远觉得激情期的这种美妙感觉就是爱情**，他们也会觉得这种美妙的感觉会长长久久地存在，也认为在美妙感觉中的那个爱人就是他一生挚爱，当激情期过了以后，当两个人成为独立的人以后，他们发现两个人变了，不再是以前的爱我的、体贴我的、包容我的那个人了，他们变了，我想把他们变成以前的那个人，其实那个从来就没存在过，你存在你的脑海中，是你所有的对美好幻象的投射，现实生活中是不存在的。他们不愿意相信这样的事情，不愿意面对自己内心有多么无能，平庸，自己有多么傻逼，一无是处，一无所有，不愿意相信这件事情。这件事情对他们来说太痛苦了，其实每个人都是这样，或多或少的问题。所以导致很多人无法客观看待自己，你看不懂自己的什么是幻想，什么是我的假想，什么是我的执念，他们不知道发生了什么，大脑一片空白，什么都不知道，不知道经历了什么，不知道自己想要什么，反正只要荷尔蒙一分泌，多巴胺一多，就完了。活得太空白了。\n  \n  面对自己幻想，需要一种时时刻刻的明白去提醒**自己的价值**所在，时刻去践行完善自我的理念，时时刻刻去意识到我和我的欲望之间的这种间隔，不被欲望所左右，这样的懂得爱的人，时时刻刻在现实中实践自己的价值，而实践的状态也在时时刻刻地改变和影响实践者本身，这样的人是不会缺少多巴胺产生的快感，也不会陷入那种分歧所带来的种种痛苦、孤独、寂寞和挣扎。"
		},
		{
			"post_id": 26,
			"title": "吴思的潜规则读后感",
			"date_published": 1494165778.916,
			"body": "<table><tr><td bgcolor=#F8F8FF> 吴思的潜规则读后感\n导读:我希望你能够在读了《潜规则》这本书后能够与我讨论或者提出意见,如果没有看一遍的童鞋,希望在网络上下载。如果没有看就提出意见的童鞋请出门左转,拉黑我或者删除我,我们之间的交流也就结束了.\n1完全是我自己的一些感悟，不引用原文。\n2以前我曾读过潜规则,感觉十分新鲜,并且这本书对我的与理想世界造成了严重的分裂。记不得是在高三还是大一时读,当然,只是部分节选,因为读不下去,对我从书本里和传统文化上所塑造的理想世界产生了了严重的沖击。而现在,我一口气读完了,没有震撼,只有简单平和的阅读,就像读小说一样快速,可能,有些地方值得推敲,但是,我能以较快速的阅读方式读完,这表示我与作者写这本书所想传达的宇面意思已经达到了一致意见,也就是我大学两年半的进步之处了。</td></tr></table>\n\n---\n\n<table><tr><td bgcolor=#F8F8FF> 3本书说探究的是中华帝国从文宇记录丰富的春秋战国至民国时代,王朝一茬接着一茬,即家天下的家族与官僚集团之间的斗争。申明一下,官僚集团从来不会是一个集体,他们之间是分裂的，官僚集团的权势与皇权的斗争此消彼涨,打个比方,明朝开朝皇帝朱元璋对官僚集团大规模肃反,大杀特杀和惩治贪官,其强度简直可以和苏区的打AB团相当。可惜的是朱元璋死了之后,官僚集团反攻倒算:,把他的后代的权力架空。当然,从槪率上说,官僚集团的胜利远大于皇帝家族,因为皇帝家族后代的能够超越前人的少之又少,而官僚集团可谓是只有踩著前任的尸体上位。当然,这是主干,枝叶辅以官僚集团如何剥削奴隶,因为这些奴隶的底线太低,即使敲骨吸髓,只要活的下去,即使像狗一祥生活,也是可以接受的.当然,还有一些奴才不满剥削,反对官僚集团的分脏不均或者剥削太多,与官僚集团相妥协的方法。当然,另外还有一些定律:比如清官堕落定律。\n当然,细枝末节的写的还可以,估计吴思驾驭不了比较宏大的主题。不过也正是这些细枝末节支撑起了他的“潜规则”大厦,其中关于如何合理的行贿,如何打理上上下下,如何升官发财等套路,诸多细节.\n4该怎么办?书中并没有说该如何对付,只是透露出了经过文化大革命以及毛式革命的洗礼,官场送礼拉关系文化在改革开放之初又以比较低级的方式出来(相比明清时候的送礼,现在的送礼方式简直是低级）。作者忧心竭泽而渔。因为官员才是这个国家的大爷、主人,人民只是提供剥削的羊羔,毫无反抗力,宰杀羊羔反而有羊带路,说哪只羊味道鲜美。既然权力的来源只能来源于上级,而诸多羊羔对官僚集团的损害有限,那么,这道选择题就不难做了。也就是清官堕落走律了。那么,诸多羊羔也不是傻子,既然这个国家不是我的,我又何必珍惜?例如:央视地标性建筑——大裤衩着火,一大群人旁观助兴.羊也有“羊”道，诸多羊羔大肆造假,大肆山寨,所谓“只准州官放火,不许百姓点灯”在诸多羊羔那里也就成了你害我,我害你,大家一起害,反正这个地方又不是我的.当然,这里每个王朝都是有一个限度的,一个临界值,比如明朝的崇祯皇帝下的暴政导致李自成的农民起义。这里,显然,他是把特殊例子推广了。一个庞大的系统,而且装备了现代化的武器和信息,怎么可能会重复古代王朝的颠覆,没有外力的介入,可以说这个社会的稳定性是不会因为某些农民起义而垮台,况且我十分怀疑当今是否还有农民起义这个说法.因为现代的铁路和公路运输十分发达,而且网络、报纸和书籍的审查力度相当大.如果哪里有农民起义,领导人可以第一时间知道,远不是古代十分滞后的信息传递,通常农民起义皇帝几个月后才知道。而且,现代的机械武器可以说是屠杀的利器。所谓的起义军的武器库的来源只能是国外的供给,可是国外的供给能够支撑大规模的战争么?而且起义军的人事构架、资金来源?所谓的下层起来推翻上层纯属扯淡,要么是别有用心的野心家用于出卖的筹码,要么是傻子式的妄想,而冷冰冰的监狱的吊天花、老虎蹬、水刑、喝辣椒水和现代武器喷射灼热的子弹足够将他们从精神到肉体的消灭.那么,底层奴隶是毫无可能造反的可能,即使有,在现代化的现在,断网、断水、断电、隔离审查、军队介入,所谓的反抗只是一群被欺骗的羊羔被送往屠宰场屠杀而已,那么,所谓的政治变革?毕竟以往只是一个家族统治中华帝国,而现在变成了几十个红色血统家族共同治理江山.按照苏联的变革经验,只可能内部分脏不均导致分裂。比如之前的薄。当然,从这里,我的逻辑是,在我死之前,是不会发生所谓的变革,因为这一代大统领的集权之路已经不可能停止了,可以肯定的是在两届十年后几乎不可能主动交权,因为反腐的利器既能清除政治异己,也是自己头上的达摩之剑;也只有在权力不失的情况下他的身家性命以及所谓的政治抱负才能实现,如果失败,要么像赵紫阳一祥被幽禁胡同十六年,要么如薄等关进秦城监狱。当然,除非发生战争,比如出兵台湾，对于战争,我是十分欢迎的,比如二战中的日本中的法西斯集团,德国的希特勒集团,意大利的墨索里尼,红色高棉政权,都是在战争中战败,日本、德国、意大利在英美国等国家的扶持下建立了真正的民主政府,从而实现了现代化民主化进程,步入了发达国家。战争是个好东西,尽管有核冬天的危险,也就是未来是不可预计的,不能照搬二战的经验,但是显然,打破僵局也只有借助外在的力量,所谓的战争牺牲一代人,可是不进行战争,世代为奴的顺从在高科技发展下估计也就永远为安稳地坐稳了奴隶了。所以,期望大统领出兵收复台湾,为中华帝国之崛起建立千秋伟业。\n5细枝末节还是最吸引人,比如如何行贿,潜规则为我们做出了典范,我等要谦虛的研究,关键还是要理论联系实际,要悉心揣摩,毕竟先行者的血液在路上表明了此路不通,比如远华案\n6—纸荒唐言。转载一首诗词:\n满江红.一炮定江山\n夜读幼安(1）,叹曾经英雄处处.苍穹下,雄狮逐鹿,流星如雨.功名四十已迟暮,云月相随万里路.皇墙根下朝朝代代,皆奴仆。\n一壶酒,人闲居。守娇娘,与琴语。神仙也是醉了才糊涂。回首少年春梦时,壮志不被美人虏。待如今一炮定江山,精虫狱.\n注:(1）幼安:辛弃疾,宇幼安。  </td></tr></table>"
		},
		{
			"post_id": 25,
			"title": "幻象、理性和感性--我们是否能够毫无幻想地生活",
			"date_published": 1493645268.469,
			"body": "<table><tr><td bgcolor=#F8F8FF>  **导读**：先生，我希望我和你之间能够一起共同探讨一个话题，一个观点，一种理念。我在这里并不是想给你帮助，指导，或者一场老师上课所能起的教导的作用。请原谅，写这些文字的人不可能也不愿意给你任何实质性的教导或者指导。尽管在领域的探索上有可能你比我先几个脚印或者我比你多走几步，但是，无论外面世界是多么纷繁复杂、绚丽多姿，我们首要的问题是与自己相处，而与自己相处是任何人都不能代替你去探索的，任何老师、导师、上师给经验只是通往真相途中的一条道路，或许根本就没有一个共同的终点。若我们之间能够产生一种感性的认识，能找到一种共鸣，这就是一种相互给予，我们在相互探讨自己，我们彼此给对方以感性的启迪，不是一种经验之谈，因为经验永远被固定在文字之中，这样的东西永远都是过去的，永远只是一种陈旧过时的，而我们自己无时不刻在产生新的念头、想法，怎么能用一种刻板、过时、迂腐的东西去探寻一种全新的、时时刻刻在变化的事物？ </td></tr></table>\n\n---\n\n #### <table><tr><td bgcolor=#F8F8FF> 1.1 幻象铸造幻想的童话城堡\n\n每天清晨从睡梦中醒来，做完基本的清洁和饮食，我们的大脑便真正开始轰隆隆地大肆制造意象了。当睡眼朦胧时，尽管还想在躺一会儿，可是想到早餐问题和八点准时上课时的场景时，只能无奈地慢悠悠地进行例行的早起事项。去往上课的途中，想今天上哪些课程和昨天的游戏中队友中二的表象，此时对面匆匆过来一个比较要好的同学，此时大脑中关于这个人的诸多念头同时涌现，他喜欢什么，他是什么性格的，他吃早餐没等。每时每刻我们都对客观世界投射我们的想法和念头，时时刻刻客观世界也在影响着我们，大脑永不止息地创造一个又一个念头，交织成一幅美丽的意象，我们也就永远在幻象飞奔的路上了。\n\n那么，先生，什么是幻象？比如你看见一个美丽的女孩，你爱慕她，你被她身上的一些你认为的闪光点吸引了，你幻想和她约会、和她花前月下、烛光晚餐等，你在沉浸在自己投射的意象之中，这些意象不是真的，只存在你的念头里。又或者从你的身边飞奔过去一辆豪车，因此你想到了自己也想买一辆车，看，多么有面子，你的念头一个有一个，像潮水一样涌来，组成了一个你所预见的未来的美好世界：你自己开着豪车，飞奔在道路上，或者在亲戚朋友面前特有面子。我们生活在如此诱惑如此透彻心扉的时代，大街上大屏幕上身着透明纱装的女性推销着商品，来往的女性身着展示女性魅力的着装，车位上停着崭新而又名牌的车辆，现代合法的性诱惑和人们在不自觉地相互攀竞争。这些对客观世界观察所投射的幻象给了我们快感、安全、荣誉等，进一步制造出形形色色的幻想，依赖于幻想，也就依赖于快感、安全、荣誉等带给我们舒适而又快乐的东西，这些东西都是事实的概念。我们从事实的概念中得到了可以带给我们快乐的幻象，至于事实本身，早在扭曲中一点一点变得面目全非了。\n\n我们每天每时每刻都在制造意象，比如前一个例子，在大街上看见一个美女，看见美丽姣好的面容，靓丽的身姿，清脆的笑容，飘逸的笑容等让人怦然心动，美女本身是不会让人心动的，她只是一个事实，而事实本身是没有什么我们赋予的意义的、是不会激起我们念头的激荡，好比看见一个石头，只有事实本身，而没有我们投射进入的欲望、念想、期望等，也正是我们把我们的期望、欲望、想念投射给事实，从而形成了事实的概念，这里，我们必须分清楚事实和事实的概念两者之间的区别。比如，石头就是一种事实。而当你用愤怒的语气指责绊倒的石头时，石头一词便被你扭曲了，你赋予了石头以自己的憎恨，石头在也不是自然界中的石头，而是一种你发泄愤怒事物的概念。\n\n对事物的概念，源于大脑对每件事情和事物的映射出丰富的念头，而我们对快乐的追求是如此强烈，以至于我们时常愿意为此付出我们力所能及的一切。当我们内心对某些东西依赖，比如欢愉，我们渴望娱乐的东西能够带给我们以精神上的快乐，我们追求快乐，这些东西给予我们一种安全感，我们需要这些带来快乐的东西。但是通常这些带来快乐的是不能够长久的给予我们慰藉，我们便愈加索取，此时我们的内心充满着矛盾、挣扎和痛苦。凡是能给我们依赖的，我们往往拼命索取，最后成为束缚我们心智绳索。当我们沉浸在追寻快乐的途中，比如看喜爱的网络小说，看喜爱的网络电视剧，看热血澎湃的影片，我们投射我们自己的诸多念头如欲望、渴求、希望等，好比你不会对青蛙们的娱乐、交配、捕食等感兴趣一样，此时我们自己崇拜自己所塑造的意象，因为这些我们自己塑造的意象带给我们无尽的慰藉，你羡慕拥有豪车从而投射出自己也想拥有，你便在自己的意象里拥有了豪车；你羡慕那位抱得美人归，于是你自己投射出自己也得到美人的芳心的意象；你在现实世界你所不尽人意的一切都可以在你所投射的意象你实现你所想要的一切，在幻想中沉浸，我们陶醉在自我娱乐中。\n对客观事物的观察造就了事物的概念，此时，感性和理性也就自然的介入其中，诸多所描述的并不是事物本身，而是我们赋予事物的概念，扭曲了事物本来面目，也就映射出了许多的幻象，使心底炽热的欲望喷薄而出，浇铸成了幻想的童话城堡。</td></tr></table>\n\n####<table><tr><td bgcolor=#F8F8FF> 2.感性和理性的纷争\n\n当用文字记录这些感性和理性的东西时，这些东西就已经具备局限性了，文字本身也就束缚了表达者所表达所能够表达的意象。文字束缚了一种奇特的矛盾，充满感性思想的观点镶嵌进入文字时只能委身于方块大小的空间，记录事实的文字准确能记录事实，可对事实的概念却大加扭曲，正如我被绊倒时脑海中的石头不是你平静时念头中的石头。\n那么，是否我们能够超越文字的束缚，用自己的感性去感受文字所蕴藏的一种力量，而不是用理性去对待，比如，你去听一场演讲，你非常赞成演讲者说的大部分观点，他也说出了一部分实施方案，能让你充满干劲，你在逻辑上是非常赞成他的观点，逻辑上你认同了他的方案。可就是当付诸于实践时充满了重重阻碍，你为自己找了许多阻碍。于是我们期待我们在未来某一个时刻能够完成，我们相信明天会更好，因为明天我就会去做实践。今天我没有改变我的写字潦草的坏习惯，明天我一定能够坚持练习写字；今天我自己没有做冥想，明天我一定能够坚持下去去完成我的冥想人物；今天我的公开课还没有听完，明天我相信我能够挤出时间去完成…….我们把我们所要做的一切都留在未来去完成，于是未来也就成了过去一样。对于未来，就是过去。因为没有立刻转变，先生，你在逻辑上很明白如果你现在不立马做出改变，你的明天就像昨天一样的结果，但是当阅读结束或者演讲结束，你依然重复昨天的故事。\n\n我们所接受的教育崇拜理性，轻视感性认知。我们认为理性认知是高级的抽象思维，由表入里，是对客观世界规律的总结和抽象具化。我们不认为理性、冷静、客观、实事求是是感性认知所统属的。理性好像天然比感性认知高级，可是当一对儿恋人之间的交流怎能用理性感知去探索，对于真相的探索怎能用理性去做燃料燃烧，对于某种情感的坚持怎能用理性感知去维护？这里，我们的感性认知能让我们提前认识到某些超越了理性认知的某些真相，某种意义上说感性就是一种灵感，一种奇特的交流，一种无言的共鸣。\n\n感性认知的力量，就我所知，是一种强大的本能，无时不刻地在影响着我们：购物时那件物品的外观就深深地吸引了我，那一款手机的造型好像就是为我定制的一样，那个漂亮的女孩子就是我心中美好的一切，显然看，对文字感性的认识是一种提取文字所营造的意象的一种加工能力，通常是不会陌生的，你欣赏一首诗词，一篇散文，一首歌曲，你钟爱某部网络小说，你与作者之间对某些字词句认同一致，好比恋爱中的人说“讨厌”，这对儿恋人便扭曲了文字的意义，此时词儿是不能传达出一种十分强烈的情感驱动，也只有面对面的交流才能即刻产生火花，而旁人是无法认同这种感情（没有经历过的人是无法体验某些超出理性认知的东西），这样，读者便与作者产生了分歧。但所幸的是我们在大部分内容上共同享有同一种通用的词意象，不会产生原始部落的公平正义与我们现在所理解的公平正义完全是两个样子的情况。\n\n感性认识也带来了某种麻烦，我们的大脑无时不刻地在产生新的想法、念头，这些东西若不加以理性的约束，随之而来就是痛苦、矛盾和挣扎。好比刚才从路旁走过的那个漂亮的女孩子（以你的审美观来看，比如黑人男孩认为的美女黑人妹子我就接受不了），她靓丽的裙子，飘逸的发丝、樱红的嘴唇加之诱人的身材，所有的一切都是一种信息的诱导，你的大脑不自觉接受了这种信息，大脑皮层立即分泌多巴胺，给你一种惊为天人的愉悦感，你过滤了她脸上少许的痘痘，过滤了她口腔里刚吃完午饭的食物残渣，过滤了她香水掩盖下的体味，过滤了她对某些事物认知上与你截然不同的事实，过滤了她喜欢动你则喜欢静的事实，所有的一切都统统被你抛在脑后，你投射你自己最美好的期望给了你所遇见的美丽的她，那个她永远存在你自己的脑海、所赋加一切美好品质的意象中。但是现实中的是完全不同与你用感性认识地那个她，她的意象与现实接触的真实的那个她，那个由环境产物和后天自我塑造的她是迥乎不同的。带来快乐的东西，是天然上瘾的东西，我们依赖这种愉悦感，尤其是当生活中没有什么比这更重要的时候，这种对快乐的依赖便自然地成了生活的重心，你的精力和时间大把大把地投入进去，你便获得了无上的快乐，得到快感之后，就愈想再一次地得到相同的体验，快感之后间隙是无尽的孤独与空虚，因为当从所依赖的东西脱离出来后，面对自己，也只有一个人面对自己时，你才能发现自己的真相–自己和自己之间充满着无所事事、百无聊赖。独自面对自己时、脱离了他人无论是物质上还是精神上的帮助时，你总得找点乐子来供自己娱乐，不然自己便心里发慌，不知为什么地觉得自己好像没有存在的意义，时间仿佛没了意义，物理上的时钟点点滴滴的走动，心理上却发现自己的时间已经停滞。意义，只有我们赋予了才有意义、不管这种意义是加强还是自愿，我们总是乐得欺骗自己，不是么？对于身处无尽的念想、幻象中的我们也只有在这种自娱自乐的自我陶醉中时间才会流动，从网络小说的一章翻过另一章，从一个景点到另一个景点，从一个妹子瞥向另一个美女，从一种快乐中厌倦至失望从而快速找到另一种快感。哦，对客观世界的观察带给我们大脑无尽的素材，激荡起多么多的念头，从一个念头飞速升起，支起一个美丽的意象，然后幻灭的尽头是诸多念头的快速奔驰，从一个跑道切换到另一个跑道上，无尽的跑道在脑海里排列出数不尽的美丽新世界，每个气泡世界投射出一种美好的幻象，泡泡升腾，旋转、翻腾、融合、碎裂，一起在耀眼阳光下析出真实世界的七彩色。\n\n倘若能仔细检视每一个念头：升腾起，直到尽头，轰然碎裂，之后便是无尽的留白。一种空的、孤寂而没有意义的意义就在这里了。幻象也在这里终结，幻想城堡分崩离析，空的意义也就是全部的真相。 </td></tr></table>"
		},
		{
			"post_id": 24,
			"title": "Hexo在LinuxMint中折腾记",
			"date_published": 1493645058.371,
			"body": "主机:Linux Mint 18\n反复安装多次Hexo,作此总结\n#### 一 卸载Hexo及其组件\n#####  卸载Hexo\n``` bash\n$ npm uninstall hexo 或者 npm uninstall hexo-cli \n```\n#####  卸载npm\n``` bash\n# sudo npm uninstall npm -g\n```\n#####  卸载 Node.js   \n``` bash\n$ sudo apt-get remove nodejs\n```\n\n---\n\n#### 二 安装Hexo及其组件\n#####  安装 nodejs: \n``` bash\n$ sudo add-apt-repository ppa:chris-lea/node.js\n$ sudo apt-get update\n$ sudo apt-get install nodejs\n```\n#####  安装 npm  \n``` bash\n$ sudo apt-get install npm\n```\n如果node不是最新的，node有一个模块叫n，是专门用来管理node.js的版本的。使用npm（NPM是随同nodejs一起安装的包管理工具）安装n模块\n`$ sudo npm install -g n `\n然后，升级node.js到最新稳定版 \n`$ sudo n stable  或者 sudo n v7.6.0`\n#####  安装 hexo \n``` bash\n$ sudo npm install --unsafe-perm --verbose -g hexo #直接安装,国外的npm源很慢\n```\n设置npm的源以便安装npm\n``` bash\n$ npm config set registry https://registry.npm.taobao.org\n$ npm install hexo-cli -g  \n```\n#####   安装插件 \n``` bash\n$ npm install hexo --save \n$ npm install hexo-deployer-git --save #安装git插件\n```\n#####  初始化 hexo  \n``` bash\n$ hexo init <dir文档名>\n$ hexo clean # 清除 \n$ hexo s     # 生成本地静态网页\n$ hexo d -g  #  部署到github或者coding\n```\n##### 配置站点_config.yml文件\n配置你hexo博客根目录下的_config.yml文件,同时布置github和coding\n>deploy:\n  type: git\n  repo:  \n       github: git@github.com:charleslxa/charleslxa.github.io.git,master\n　　　　　　　coding: git@git.coding.net:charleslxa/charleslxa.git,master\n\n##### 添加ssh密钥\n同步到github和同步到coding为一样的步骤,先申请帐号,在新建立新的公开项目,github项目名称严格要求,添加ssh密匙\n``` bash\n$ git config --global user.name \"charleslxa\"             # 引号里的为你的github用户名\n$ git config --global user.email \"1058362724@qq.com\"     # 引号里面的为你的github注册邮箱\n$ sudo ssh -v git@github.com                             # 进行测试 \n$ sudo ssh -T git@git.coding.net                         # 验证成功与否\n$ sudo ssh -T git@github.com                             # 验证成功与否\n$ cat ~/.ssh/id_rsa.pub                                  # 获取ssh密匙\n```\n出现 \n<table><tr><td bgcolor=#F8F8FF>Hi charleslxa! You've successfully authenticated, but GitHub does not provide shell access.c</td></tr></table>\n表明成功\n\n其中生成密匙\n``` bash\n$ ssh-keygen -t rsa -C \"1058362724@qq.com\" # 引号里的为你的github注册邮箱\n$ sudo apt-get install xclip\n$ xclip -sel clip < ~/.ssh/id_rsa.pub  # 此时ssh秘钥已经在剪贴板中\n```\n\n克隆主题\n 在Hexo根目录下以下命令\n``` bash\n$ git clone git@github.com:yscoder/hexo-theme-indigo.git themes/indigo #我目前用的主题\n$ git clone https://github.com/iissnan/hexo-theme-next themes/next     #简洁,优雅,高端的主题\n$ git clone git@github.com:forsigner/fexo.git themes/fexo              #简洁主题  \n\n\n为indigo主题服务的依赖,其中需确认你的 Hexo 版本在 3.0 以上，以及 Node 版本为 6.x 以上.\n\n$ hexo -v                                            # 查看hexo和node的版本\n$ node -v                                            # 查看node版本\n$ npm install hexo-renderer-less --save              # 主题默认使用 less 作为 css 预处理工具\n$ npm install hexo-generator-feed --save             # 用于生成 rss\n$ npm install hexo-generator-json-content --save     # 用于生成静态站点数据，用作站内搜索的数据源\n$ npm install hexo-helper-qrcode --save              # 用于生成微信分享二维码\n```\n Indigo优化设置\n**开启标签页**\n``` bash\n$ hexo new page tags\n```\n修改 hexo/source/tags/index.md 的元数据\n<table><tr><td bgcolor=#F8F8FF> layout: tags\ncomments: false\n---</td></tr></table>\n"
		},
		{
			"post_id": 23,
			"title": "Centos优化指南",
			"date_published": 1493644975.629,
			"body": "### 刻录和安装\n1 u盘安装 \nCeontos7镜像支持GPT格式的磁盘，将磁盘格式转化为GPT，Centos安装将会格式化以前磁盘的内容，至于怎样不格式化安装@我哈\n使用rufus刻录Centos7.DVD到u盘,使用PTG,可以使用超过4个分区的主分区,不用去使用逻辑分区.安装选项中点重 工作\n然后选择自己配置磁盘.我的磁盘1T,划分如下:  \n- /boot/b      1G \n- /             80G\n- swap          2G\n- /home         400G\n- /backfile     300G\n- /worksplace   153G\n2 安装期间设置root密码和普通用户名和密码.安装完成后重启进入，会有一个用户协议同意书，反正我的电脑是以命令行的格式显示，其中先选择“**1**”,然后输入“**a**”(为accept的简写)，在选择“2”，同样，之后是“**c**”（就是continue).之后电脑重启进入图形界面.\n\n---\n\n### Ceontos7基本配置\n1  配置阿里源\nA、备份\nmv /etc/yum.repos.d/CentOS-Base.repo /etc/yum.repos.d/CentOS-Base.repo.backup \nB、下载新的CentOS-Base.repo 到/etc/yum.repos.d/\nCentOS 6\n``` bash\n$ wget -O /etc/yum.repos.d/CentOS-Base.repo http://mirrors.aliyun.com/repo/Centos-6.repo \nCentOS 7\n$ wget -O /etc/yum.repos.d/CentOS-Base.repo http://mirrors.aliyun.com/repo/Centos-7.repo\n```\nC、之后运行yum clean all,yum makecache 生成缓存\n2 安装fastestmirror YUM插件\n当YUM源很多时，安装fastestmirror插件可以使得yum从速度最快的yum源下载。\n在终端中输入命令：\n$ sudo yum install yum-plugin-fastestmirror\n更多YUM插件可以运行\n$ sudo yum info yum-plugin-*\n3 添加rpmfusion源\nrpmfusion源是极具影响力的第三方软件仓库，提供有版权(nonfree)和专利(free)问题的免费软件，对于一般用户来说rpmfusion源可以说是必不可少的。\n在终端中输入命令：\n``` bash\n$ sudo rpm -ivh http://download1.rpmfusion.org/free/fedora/rpmfusion-free-release-stable.noarch.rpm http://download1.rpmfusion.org/nonfree/fedora/rpmfusion-nonfree-release-stable.noarch.rpm\n最后输入： $sudo yum makecache 生成yum缓存即可，这样就安装了rpmfusion源。\n（以上的两个链接也可以换为http://mirrors.163.com/rpmfusion/free/fedora/rpmfusion-free-release-stable.noarch.rpm或http://mirrors.163.com/rpmfusion/nonfree/fedora/rpmfusion-nonfree-release-stable.noarch.rpm）\n```\n4  设置sudo\n终端中以root身份输入命令\n# visudo\n在配置文件中找到下面的几行内容：\n>Allow root to run any commands anywhere\nroot        ALL=(ALL)        ALL\n然后，在上行内容下面添加下面内容\nxxxx        ALL=(ALL)        ALL\n其中的xxxx改成自己的用户名即可，这样以后就可以用sudo命令了.\n\n5 gedit打开文件乱码\n由于编码格式的不同fedora打开windows下的文本文件经常会出现乱码。\n网上的解决办法通常都是通过/etc/sysconfig/i18n文件修改环境变量来达到目的，这里的方法不许要这样做。\n方法一：\n终端输入命令：\n$ gsettings set org.gnome.gedit.preferences.encodings auto-detected \"['UTF-8', 'GB18030', 'GB2312', 'GBK', 'BIG5', 'CURRENT', 'UTF-16']\"\n$ gsettings set org.gnome.gedit.preferences.encodings shown-in-menu \"['UTF-8', 'GB18030', 'GB2312', 'GBK', 'BIG5', 'CURRENT', 'UTF-16']\"\n\n6   当前目录右键打开终端\n在终端中输入命令：\n$ sudo yum install nautilus-open-terminal\n7 安装gnome3 tweak tool工具\n采用gnome3之后，gnome-tweak-tool为配置桌面必不可少的工具。\n终端中输入命令：\n$ sudo yum install gnome-tweak-tool\n7 无线管理: `sudo yum install NetworkManager-wifi`\n8 更新系统\n在系统管理工具里，选择更新\n也可以用命令更新：yum -y update\n9  输入法 中文输入法很好调用,即`系统管理设置-设置-区域与语言-输入源-添加输入源-汉语（intelligent Pinyin）`\n\n### Centos7 办公配置\n1 安装libreoffice\n首先安装libreoffice.org套件，终端中输入命令：\n$ sudo yum groupinstall \"Office/Productivity\"\n安装好后，由于采用默认安装，语言是英文，在终端中输入如下命令查找来安装中文语言包：\n`$ sudo yum list libreoffice*`\n然后安装中文语言包，在终端中输入命令：\n$ sudo yum -y install libreoffice-langpack-zh-Hans\n$ sudo yum -y install libreoffice-langpack-zh-Hant\n2 安装 wps 点击[这里](http://community.wps.cn/download/)下载安装rpm即可.\n3 安装firefox flash插件\n方法一：\n到adobe官方网站下载linux下的flash插件安装。\n方法二：\n首先添加adobe软件仓并导入密钥,在终端中输入命令：\n``` bash\n$ sudo rpm -ivh http://linuxdownload.adobe.com/linux/i386/adobe-release-i386-1.0-1.noarch.rpm\n$ sudo rpm --import /etc/pki/rpm-gpg/RPM-GPG-KEY-adobe-linux\n```\n然后在终端中输入命令：\n$ sudo yum install flash-plugin\n4 安装google浏览器.\n可以到官网下载rpm包直接安装.看运气,点击[这里](http://www.google.cn/intl/zh-CN/chrome/browser/desktop/index.html)有时可以.(也可以准备梯子）\n\n\n\n### 编程配置\n1 安装GCC,Java ,vim\n``` bash\n$ yum install gcc*\n$ yum install java \n$ yum install vim\n```\n\n2 安装 virtualbox  点击[这里](https://www.virtualbox.org/wiki/Linux_Downloads)选择`Red Hat Enterprise Linux 7 (\"RHEL7\") / CentOS 7`下载安装即可\n虚拟机添加USB识别\n/usr/sbin/usermod -G vboxusers -a charles(用户名）\n/usr/sbin/usermod -G vboxusers -a root\n\n3安装gcc g77\n在终端中输入命令：\n$ sudo yum install gcc*\n安装gcc\n在终端中输入命令：\n$ sudo yum search g77\n可以看到\ncompat-gcc-34-g77.i686 : Fortran 77 support for compatibility compiler\n在终端中输入命令：\n$ sudo yum install compat-gcc-34-g77\n安装g77。\n\n\n#### 在CentOS7/CentOS6中支持exfat格式的U盘 \n安装Nux Dextop库依赖于EPEL库，所有要先安装EPEL库(需要管理员权限)。\n如果安装过则跳过。\n$ su root\n$ yum -y install epel-release\n对于RHEL/CentOS 7(复制/粘贴):\n``` bash\n$ rpm -Uvh http://li.nux.ro/download/nux/dextop/el7/x86_64/nux-dextop-release-0-5.el7.nux.noarch.rpm\n```\n检查Nux Dextop是否安装成功：\n$ yum repolist\n提示\n由于Nux Dextop仓库可能会与其他第三方库有冲突，比如（Repoforge和ATrpms）。\n所以，建议默认情况下不启用Nux Dextop仓库。\n打开`/etc/yum.repos.d/nux-dextop.repo`，将\"enabled=1\" 修改为 \"enabled=0\"。\n$ sudo vi /etc/yum.repos.d/nux-dextop.repo`\n当需要使用Nux Dextop仓库时，显式启用仓库。\n$ sudo yum --enablerepo=nux-dextop install <package-name>\n安装exfat支持库文件\nyum --enablerepo=nux-dextop  install fuse-exfat exfat-utils\n\n\n\n\n#### centos7安装eclipse\n安装java\n$yum install java\n解压到/opt 目录下\n$tar -zxvf eclipse-java-luna-SR2-linux-gtk-x86_64.tar.gz -C /opt\n$ln -s /opt/eclipse/eclipse /usr/bin/eclipse  \neclipse与/usr之间有空格\n创建桌面启动\n$sudo gedit /usr/share/applications/eclipse.desktop\n添加如下代码\n>[Desktop Entry]\nEncoding=UTF-8\nName=Eclipse 4.4.2\nComment=Eclipse Luna\nExec=/usr/bin/eclipse\nIcon=/opt/eclipse/icon.xpm\nCategories=Application;Development;Java;IDE\nVersion=1.0\nType=Application\nTerminal=0\n\n之后添加PyDev和CDT\n`PyDev - http://pydev.sf.net/updates`\n`CDT - http://download.eclipse.org/tools/cdt/releases/indigo`\n\n\n#### 在CentOS7中安装思维脑图软件XMind \n解压deb包，得到`data.tar.gz` 和`control.tar.gz `两个归档文件\n解压`data.tar.gz`,得到一个usr文件夹，把此文件夹下的lib/xmind文件夹复制到/opt/文件夹下，share子文件夹移动到/usr/文件夹下和已有的share文件夹合并。命令如下：\n$ cp -r usr/lib/xmind/ /opt/  \n$ cp -r usr/share/ /usr/  \n解压`control.tar.gz`,执行解压出来的postinst文件：\n$  ./postinst  \n编辑sudo gedit /usr/share/applications/xmind.desktop文件内容为以下内容（只修改了Exec和Icon）\n$ vim /usr/share/applications/xmind.desktop  \n`Icon=/usr/share/pixmaps/XMind.png`\n`Exec=/opt/xmind/XMind`\n"
		},
		{
			"post_id": 21,
			"title": "二 现代化媒介的碎片化阅读",
			"date_published": 1486351846.16,
			"body": "二 现代化媒介的碎片化阅读\n \n2.3娱乐的精髓-网络小说\n\n我希望我定义足够准确，确实有很多伟大的小说，比如红楼梦，三国演义等，网络上也有比较好的小说，比如《缺月梧桐》，《历史的尘埃》，《神州志》等（当然我也是一个十足的小说粉丝，当然，是盗版派粉丝），与这些优秀的作品相反，我所说的正是现在为了娱乐而娱乐--一爽到底的小说，比如唐家三少，辰东，有网络流传的诗为证：\n\n---\n \n升级打怪捡宝贝，山洞学院拍卖会\n\n做完任务下副本，仙界神界换地图。\n\n天赋奇佳根骨好，修练一年顶十年\n\n炼丹练器练阵法，我是多面小能手。\n\n戒指里面有老头，收个宠物是神兽\n\n白富美都爱上我，哪怕主角非常逗。\n\n偶尔逛逛路边摊，心血来潮买板砖\n\n回家一擦后发现，上古神器残破版。\n\n美女山中腹中饥，一只烧鸡许芳心\n\n烧鸡手法很细腻，专为泡妞而设计。\n\n男配女主三角恋，男主红颜群芳谱\n\n虎躯一震霸气漏，小弟美女我全收。\n\n反派脑残无极限，专派手下送经验\n\n伙伴全是战五渣，打架靠边秀惊讶。\n\n点子多多运气好，垃圾技能变成宝\n\n同级里面能横扫，越级战斗不难搞。\n\n纵然此时是废材，将来必定成天才\n\n风水轮流三十年，莫要欺我少年穷。\n\n一块大陆真心大，万兆人口也装下\n\n两头相隔数光年，三月我就能横跨。\n\n虽然国家有很多，风俗文化都一样\n\n货币等级度量衡，大陆通用普通话。\n\n高手实力很强大，一招就能灭天下\n\n可是打了几万年，山海依旧那模样。\n\n主角受伤总治愈，永远不会变残废\n\n从不上学不要紧，读书写字天生会。\n\n张口闭口要逆天，老天究竟欠你啥\n\n光环神技开外挂，仙佛妖魔随便杀\n\n土豆唐三西红柿，辰东风凌逆苍天。\n \n\n\n 这些爽文最大的特点就是一爽到底，就好像喝了某种特殊的类似甘露醇溶液，不被人体肝脏代谢掉，不能作为营养物质吸收，反而集聚在肾脏，造成渗透性利尿，这就是这种溶液的降血压的原理，同理，一爽到底之后人们终会减轻现实世界的压力，也算是一种良好的降压药了。往往药物在治疗剂量还有不良反应，那么，同理，爽文减压后就会造成戒断综合征（治疗某种疾病时，突然停药后，疾病的症状反而立刻加重，为了治疗，反而需要加大剂量去治疗）。\n   在喝完这些精心炮制的现实世界降压药后 或者在你觉得我的确不能在这样颓废下去而去戒掉瘾，大概会有一段时间有一种淡淡的落空感，好似轻飘飘的，归结起来是因为你没有找到生活的重心，你没有为之天天操心的事情，没有一种东西占据你的内心，那么，小说--一种极好的精神物质粮食（味美价廉但没有营养）就只好”勉为其难“地冲锋，占领你的大脑中枢。这也就是为什么很多人为什么发誓赌咒并没什么用，因为他们的内心是极其矛盾的，为了去获得一种超脱的快感，人们有时愿意为此付出很多东西，但是小说的快乐毕竟是短暂的，因为写小说的写手码字速度显然跟不上我们阅读的速度，之后我们往往在一爽到底之后有一种淡淡的怅然，之后我们就痿了（想象式的阅读也是耗费精神能量），然后缩紧大衣，萎萎缩缩地蜷缩，抵抗外界的寒冷。\n  这就是我们网络小说阅读的全部了，我们的内心是矛盾和失去平衡的，我们投射我们自己的欲望、希望、各种各样的想法，此时，我们与小说中的主人公产生了一种奇特的共鸣，仿佛小说主人公经历的一切，他的奋斗（往往越级击杀。。。期末大BOSS好想这样越级击杀），他的事业，他的后宫都是我们的，我们就是上帝的化身，我们战无不胜，我们就是这个世界的宇宙真理。可是醒来后现实往往是不以我们这些人为转移的（太祖除外），要么继续投入宇宙真理的无限伟大的事业中去，要么继续蜗居在小房子里，安安心心啃大部头和窝窝头。\n"
		},
		{
			"post_id": 20,
			"title": "二  现代媒介的碎片化阅读 ",
			"date_published": 1485881314.596,
			"body": "###2.1 渐行渐远的1984\n  谎言、暴力和双重思想是维持稳定的不二法门。谎言用于掩盖历史事实，歪曲真相，以达到我就是宇宙真理，我就是上帝的地步，以愚治愚。暴力用以消灭提出问题的人，这样就永远没有问题了，一劳永逸。双重思想用以彻底教化奴隶，让奴隶生不起抵抗的意识，以达到千秋万代的顺从。\n####2.1.1谎言\n\n---\n\n   京城四大流氓之一郭沫若曾说：历史就像一个小姑娘，任人打扮。这里的历史自然不是指的是历史本身的客观存在，而是关于历史文本对过去重大事件的说法和解释，更确切的是对史料的取舍。对于我们的传统文化来说，历史的作用之一便是讲祖先功业如何辉煌，以便引起自豪感，以及要把它延续下去的责任感（如果所谓的中华传统不优秀，而是封建糟柏，那么人们也失去了传承的必要性了，所以无论本民族的在真实历史上是如何不堪，必须把她打扮得光鲜耀眼）。举个例子，苏联的《联共（布）党史简明教程》，斯大林可是花了二十来年的时间来编写这样一部历史教科书，一步一步为编写这部书做好人事组织、理论修正、历史篡改的先期工作，最后才水到渠成地用了两个月左右的时间编写出《简明教程》。太祖师从苏俄，自然从中汲取真意，所以整个一代“官史”基本上建立在谎言的基础上，真正起到了“灭史”的作用。（ 1951年胡乔木编《中国共产党三十年》，曾经在短时间内为钦定官史，后来几易修改。1986年胡乔木访美时，自己都认为那本《三十年》不能算作学术著作，不同意放入履历中。）\n    修改历史，以达到愚民的目的，让人分不清什么是真实什么是虚假，于是那些特意特供给品就出炉了，比如抗日神剧，XX思想，XX代表。当然，他们自己享受的是首长特需--纯天然绿色无污染滴。他们自己的子女是绝不会接受这样的，千方百计送到敌对国家接受对敌国家的奴役，他们的资产也通过离岸公司转移（那些因经济原因落马的家伙理财意识太差了，至少顾我当资产转移总设计师，设计白手套人持股（那些家伙的白手套居然是其亲戚，理财意识太差）投资美元、比特币、国外高档别墅，总比现在国内高位想套现的没途径的人想逃就没地儿逃，现在已经每人每年限制5万美元，而且还得写保证书，过政治审查）\n     总之，正如司马南大使有良心地说出了真理：批美是工作，在美是生活。但是作为我伟大的网络评论员五毛，我知道他一定是接受的伟大的潜伏任务，去敌人的中心去搞破坏。如果还有机会，请带上我吧，我愿意为帝国的圣战贡献绵薄之力。\n####2.1.2暴力\n暴力，通常由政法委联合武警机关实施（所谓的武警就是军人换了一身皮），当然，武警的基础工资必然是低等的。为什么捏？因为执政者不是新加坡的高薪养廉，负担不起庞大的打手费用。那只能允许他们拥有合法收益权，也就是搞业务。这样既不用负担喂养庞大队伍的费用，也可以增加队伍的忠诚性（因为也只有在体制内才拥有合法伤害权，比如城管当街殴打老妇人，没收摊贩的贩卖品，当作战利品，而在体制外，只有被合法伤害的权力），更可能以后翻旧账时一起清算，可谓一举三得。这样的队伍能有什么素质了？问问吴幼明的从警十三年，他是这样记录黄石公安局中的货色的。\n` “当时我想不通为什么这种人居然也能混进公安机关，后来我发现甚至还有坐过牢服过刑的人也通过种种途径进了公安机关。我终于明白,任何职业都会有好坏人,这比例在不同职业中相差应该不会很远。人品的好坏是无法通过一些政审材料来证明的。更不用说这些证明在暗箱操作过程中很容易造假。”`\n   又如最近举国雷动的人大校友打飞机案，其实这已经不是什么新鲜事儿了，在他的派出所辖区，有一个人所共知的资深性工作者。这个刘姓女人，介绍卖淫兼自己卖淫，于是成为了派出所的重要财源。一需要创收了，警方就派人到她家蹲守，效率很高，效益也很可观：\n   ` “当时刘是老下陆派出所的一大财源，大多数民警都到刘家里去抓过嫖娼。好象是1998年冬天，新下陆派出所的民警在刘家里守候了两天，有嫖客打电话来就让女民警接。嫖客很警觉，问刘老板呢？答买菜去了。问你是谁呢？答我是新来的小姐。嫖客立马就跑来了。还有嫖客在刘的楼下转来转去，女民警在窗前用小指头勾他一下，于是嫖客跑上来掉进警察的罗网。这样两天下来，一共抓了近六十个嫖客。”`\n   所以雷阳只是一个意外，不配合的意外。为了保证手底下犬牙的利益，也是为了政权的稳定，雷阳案必须不能动摇一线打手的心，所谓人的性命在党纪处分面前一文不值，更何况累累的白骨堆里也不缺一个赵家奴才。只是人命在中国总是可以衡量的，其家人可以说得上是借助了舆论的顺风车，大赚特赚，只不过是喝亲人的血罢了。（北京一套房子，价值两千万，再加上两千万的赔偿金，换得家属不上诉。倘若我的命也能值这么多的话，我也想被嫖娼，至少家族可谓是一夜暴富---恐怕这才是国人骨子里的想法）\n####2.1.3双重思想\n   战争即和平，自由即奴役，无知即力量。这是我从1984里抄过来的，我想，对于我们这些被党妈培育的绿萝的表达是准确的。这也解释了为什党国一直坚持陈旧的意识形态教学，因为这样是在培育双重思想。而双重思想的妙用就在下面的例子中\n这也就解释了为什么当朝太祖在制订宪法时候的态度了。\n   ` “我们有不少同志，就是迷信宪法，以为宪法就是治国安邦的灵丹妙药，企图把党置于宪法约束之下。我从来不相信法律，更不相信宪法，我就是要破除这种宪法迷信。国-民-党有宪法，也挺当回事，还不是被我们赶到了台湾？我们党没有宪法，无法无天，结果不是胜利了吗？……我们伟大光荣正确的党也是历来不主张制定宪法的，可是，建国后，考虑到洋人国家大都制定了宪法，以及中国知识份子还没有完全成为党的驯服工具的情况，为了改造和教育人民群众，巩固党的领导，还是要制定宪法的嘛。制定宪法，本质上就是否定党的领导，在政治上是极其有害的。” \n“当然啦，宪法制定是制定了，执行不执行，执行到什么程度，还要以党的指示为准。只有傻瓜和反党分子才会脱离党的领导，执行宪法。” \n——1954年，在宪法讨论会上的发言 （这段发言我在网上没有找到明显的文献支持，希望有哪位童鞋帮忙翻一下档案馆，据说材料来源 在1954年宪法讨论会上的发言 ；在1957年秦皇岛中央工作会议期间毛讲话，现存于中央档案馆一室 `\n）\n ` 毛泽东1958年8月24日在北戴河发表谈话，说：“不能靠法律治多数人……我们基本上不靠那些，主要靠决议、开会，一年搞四次，不能靠民法、刑法来维持秩序。我们每次的决议都是法，开一个会也是一个法。”他还说：“要人治，不要法治。《人民日报》一个社论，全国执行，何必要什么法律？”（炎黄春秋2010年第七期有一篇《“以党治国”面面观》`\n   在看看工农兵大学生撸起袖子来干的言论，是不是熟悉的味道，熟悉的配方。\n   `你懂的：全面提升防范应对各类风险挑战的水平 2017年01月12日 16:26 新华网 \n你懂的就政法工作作出重要指示强调，全国政法机关要强化忧患意识，提高政治警觉，增强工作预见性，不断创新理念思路、体制机制、方法手段，全面提升防范应对各类风险挑战的水平，确保国家长治久安、人民安居乐业。\n  你懂的强调，2017年是我们党和国家历史上具有特殊重要意义的一年。要把维护国家政治安全特别是政权安全、制度安全放在第一位，提高对各种矛盾问题预测预警预防能力，为党的十九大召开营造安全稳定的社会环境。要锲而不舍推进司法体制改革，进一步提高司法质量、效率和公信力。要坚持不懈加强政法队伍建设，进一步营造风清气正、干事创业的良好生态。\n你懂的强调，各级党委要切实抓好维护安全稳定工作，加强源头性、基础性工作，肩负起促一方发展、保一方平安的政治责任。要加强和改善对政法工作的领导，选好配强政法机关领导班子，研究解决制约政法工作的体制性机制性问题，为做好新形势下政法工作提供有力保障。`\n    这样，我们日常就是在进行双重思想的训练。在现实里，你看看宣传的“素质教育，民主，公正，对学生平等对待，学生会公平选举，维护公民的合法权益道德、民主、法治、自由、人权、宪法”这些口号，再联系下现实。你就会发现“双重思想”已经浸透在了我们骨子里，我们天天生活在一个不是那么真实的梦中。一些人想要试图弄明白了这些问题，就会有人或愤怒，或担忧的阻止他，这就叫“犯罪停止”（犯罪停止(crimestop)的意思就是指在产生任何危险思想之前出于本能地悬崖勒马的能力。这种能力还包括不能理解类比，不能看到逻辑错误，不能正确了解与英社原则不一致的最简单的论点、对于任何可以朝异端方向发展的思路感到厌倦、厌恶。）\n    ` 知与不知，知道全部真实情况而却扯些滴水不漏的谎话，同时持两种互相抵消的观点，明知它们互相矛盾而仍都相信，用逻辑来反逻辑，一边表示拥护道德一边又否定道德，一边相信民主是办不到的一边又相信党是民主的捍卫者，忘掉一切必须忘掉的东西而又在需要的时候想起它来，然后又马上忘掉它，而尤其是，把这样的做法应用到做法本身上面——这可谓绝妙透顶了：有意识地进入无意识，而后又并不意识到你刚才完成的催眠。即使要了解“双重思想”的含义你也得使用双重思想。\n——乔治 · 奥威尔，《一九八四》`\n    在接近或去了解事实时，你已经走在犯罪的道路上了。那么只剩下由内心彻底地去接受，就收伟大光荣正确，从心底里去服从党的一切。当然，还有第二种，实用主义，开朝太祖偏不信所谓马列原教主义的邪，井冈山山大王路线以、肃反打AB团惩治来自苏联留苏派理论正统的王明、博古为首的教条主义派（王明最惨，被汞中毒、苏联治疗无用而幸福地见了马克思；博古幸福地在1946年的飞机失事中烧成了灰灰，没有被M打倒）  \n   总的来说，在这样的环境里，我们的奋斗的所有意义也就成是“成为他们“。在最近两年的政治风雨中，落马的高官很多，探探一下底：几乎都是平民家庭出身的。想起那些寒门出身的高官在电视里忏悔的镜头，心里是叹息：到了这么高的位置了，似乎也没有成为”他们“。想当年赵家他们当年靠着老大哥的铁杆支持才能达到太祖所说的生平只干了两件事，又如老军头王震说：共产党的政权是三千万人头换的，谁想要拿三千万人头来换。这句话在当时曾广为流传，津津乐道，这意思是说共产党打下来的天下就应该由共产党来坐，而且当年的春晚还大唱《打江山坐江山》。如今阶级已经固化，奴隶再努力也不可能成为奴隶主，但可以成为奴才。只是可怜在为中国革命牺牲的数千万烈士们，他们的流血牺牲被喂狗了，而他们的后代依然生活同呼吸共命运下的盛世皇朝中。\n"
		},
		{
			"post_id": 19,
			"title": "永远从一个胜利走向另一个胜利（一） -------媒介是如何重塑我们的大脑和我们该怎么办",
			"date_published": 1485880678.447,
			"body": "### **序言：我为什么要写这些东西出来？**\n![image alt](img/003.png) \n如今现在社会上认认真真读书是一件赔本的买卖，就像我在《反腐与制胜联盟的胜利》里说的那样，你不必需要在某一领域的专业水准，甚至不需要基本的道德水准，惟一的条件是你的“混术”够好：只要你肯吃血馒头，肯为王前驱，也就是这样相当与拜了把子，递了投名状，进了帮会，这样荣华富贵加身是没有问题的，当然，占错队的属于跟不上时代潮流，那些”团团伙伙“的家伙的”阴谋“也就成了我们日常的谈资了，比如薄。\n\n相反，你只需找对某个职位的核心决定者：投票只是最后的橡皮图章，背地里的串联拉票才是重点，这里就考验一个人”混术“的高低了，没读书什么事儿，更没有学问什么事儿，好比去大街上买菜砍价，泼皮无赖往往无往不利。无论以何种手段取得，在中国，你就是成功人，过去的统统都不会有人去提，为了一个高大而又神圣的理想，以何种方式达到目的在光辉下也就成了必然的手段，所以天堂之路为何是白骨铺就，柬埔寨的红色高棉的恰恰就是一例证明。\n\n---\n\n所以，如果你只是为了娱乐，那也无可厚非，何况我也是网络剧的铁杆粉丝。这里，其一，只是我自己写的一点东西，无关任何利益相关，只是我自己喜欢，我想，至少一点，我的文章以后肯定不会担心被翻出来鞭尸，这样我就放心了，因为当朝太祖，可以肯定的是，至少在两百年之后肯定会被安稳的水晶棺里被拉出来鞭打，更何况所谓的毛XX思想了；其二，我只想日后对自己的思想历程的一个结晶，一个标志，给自己看的东西，就不需要添加太多的负担。\n\n下面就是我自己的一些担忧和应对方法：关于现代媒介是如何重塑我们的大脑和我们该怎么办\n\n ###一 没了网络媒介，我们的大脑还剩下什么？\n\n~~我比较喜欢网上冲浪，比如什么你懂得，电脑就像一个毫无防范的少女，就这么被揉躏了，我的100G的视频资料和英文书籍，就这么被格式化了，当系统整个被格式化之后，以前的资料得重新去找，可有些东西比如珍贵的相片就全成了泡影了。当然，我用BT sync下载的很多有关于相对独立双方相对惨烈战争及相互攻击性行为指导文艺片就这么没了。。。~~\n\n娱乐时间结束了，以下是正文，希望你不会感到枯燥乏味。\n\n大学几年里，我经常下载很多书籍和视频资料放在电脑里，就像一只地鼠一样囤积过冬的粮食，可惜天公不做美，我的行为遭到了Big brother的幽灵木马的嗅探，使出了株连九族的绝户计策，破坏我的电脑，我自己不得不对自己的电脑痛下杀手（典型的阴谋论），格式化一切--我的一切回忆，珍贵的相片记忆、我的文字，总之一切都随风飘散了。第一次自己做贱自己，可自己还是没有醒悟到，就像买的书一样，自己没有去用强健的胃去消化它，那么，美食珍羞又有何用？总之，做贱的人的历史是惊人的相似的，没过几个月，一个意外，玩脱了，又得重新格式化电脑。\n\n心里有一种怅然失落的感觉，下载那么多东西，把她们打入冷宫，岂不是自己欺骗自己么？何况在古代打入冷宫的妃嫔还期望临幸，而我的书算是遇人不佳。当然，自己还乐得自己欺骗自己，以为有了很多书籍，自己就已经把他们全部吸收了，就算在古代，也算是满漏屋书香了罢，可我现在只闻到书里掩盖着躺着的尸体的阴冷的香风，吹得我心里很是既亢奋又是愚昧，和一百年前的拳民没什么区别。\n\n罢了、罢了，走了就走了，天要下雨，就让他下吧，我等请不起碘化银等消雨催化剂。\n\n记得前几天期末考试，我去了一间没有网络的教室上自己，恰巧我自己带了一个没有SM卡的手机。复习之前是要例行打鸡血的，掏出手机，习惯性地看看新闻，没网(当然，这也是我想要达到的效果），突然醒悟自己什么也不剩下了，好像有了网络，我就有了一切，包括每日发生的新闻，每天的八卦，每天能够让人振奋人心的新闻-比如新年第一枪的攀枝花局座和凤姐求赞赏的文章，现在，我远离了他们，只剩下我自己一个人，孤零零地呆在一个于世隔绝的地方，孤独，一种莫名其妙的孤独和疏离感，明明我的课桌前还有一个正在认真复习的师姐，明明左边还有一个帅帅的师兄，可没了手机，一种荒谬的感觉包围了我，像溺水的人，他们的并不能给我救赎，我只能求救于一根稻草，在现代，我只需要一张SM卡，上天啊，WIFI，迟来的正义的判决。\n\n远离了网络，我突然发现自己什么也不是了，自己是空荡荡的，没有一点东西装在肚子里，所谓的时事政治只是特定人群的娱乐，当然，他们的目的是娱乐，而悲剧的我当真了，这就是悲剧的来源了。天上飞的感觉实在是太棒了，自然有人喂给你快乐之剂，让你轻飘的，这种感觉真的是妙不可言，你只需要轻轻点击一下，数不清的对你恭维贺喜的信息就在你面前出现，每个人都在赞同你，赞美你，你就对的，你的判断毫无疑问是符合一贯客观冷静滴，你就是真理的化身，你就是代表宇宙真理。\n\n他们给了你的都是精致包装的诸多观点--好比葡萄糖溶液，极易消化吸收，不需要用牙齿去磨碎-不会有磕牙的危险，不需要胃液分泌胃酸去消化，一切直接被人体吸收，毫无保留的吸收。好一个毫无保留的吸收，这也代表了毫无保留的洗脑，毫无保留的代谢、统统地都被氧化燃烧掉了，什么也没有留下，只有一堆的代谢废物二氧化碳，算是为全球变暖做出了一份子贡献。\n\n没了通信设备与互联网相连接，我的大脑变得空前贫瘠，果然，潮水退去之后，才知道谁在裸泳，可以确信的是，我在裸泳，洋洋得意，大肆享乐，欢乐的因子一阵一阵地激活大脑多巴胺的开关，释放出多巴胺，快乐之源，哦，我的上帝，我简直忍不住再来一次，快乐的源泉，满足了我无尽的希求。带我远离痛苦，欣享无尽的欢愉吧。\n\n尽管我知道人世间本就一场痛苦的临终列车，我们都在不可避免的驶向死亡的坟墓，但是我仍然跪在上帝面前祈求欢乐，你知道，我们已经离不开快乐了，因为你得知道，在这个非人的环境里，要么吃人血馒头，要么被人送上祭坛，成为祭品。然而，我真的不想去吃人血馒头，先生，吃一个人血馒头，和吃千万个是没什么区别的，杀一人也是杀千万人，而后者更可能被封神，比如斯大林，希特勒以及当朝太祖和邓公（这里我要为邓公鸣不平，别人都盯着他在华表的血迹，然而却忘了太祖一点都不沾染自己的手），当第一次后，恐怕就像高山上石头，滚下来就再也停不住了。那时，我还是我自己么？双手沾满了血，心坚硬如磐石么？就像我现在和以往的年少无知差别太大了。\n\n祭品，活祭之路，白骨皑皑，无知铺就通往天堂之路，愿打AB团的所谓反革命烈士、延安整风中的王实味，三年人为灾害的可怜的被剥夺了饿死也不能反抗权力的奴隶，愿天堂没有共产。\n\n而我，是不是祭品了，那也太看得起我了，我自己都说我是一个犬儒派，既没有毛的权术整人集大成者，也不是所谓的“天降降大任”君子。得过且过，混吃等死罢了。"
		},
		{
			"post_id": 18,
			"title": "Linux Mint下WPS中调用fcitx失灵问题",
			"date_published": 1483118635.987,
			"body": "WPS中有时调用fcitx失灵的问题,比较坑爹,网上搜索一番,大致为环境变量没有配置正确的问题\n解决办法:\n在~./profile中添加以下代码\n```\nexport XIM=\"fcitx\"\nexport XIM_PROGRAM=\"fcitx\"\nexport XMODIFIERS=\"@im=fcitx\"\nexport GTK_IM_MODULE=\"fcitx\"\nexport QT_IM_MODULE=\"fcitx\"\n```\n然后注销,重新登陆.\n\n有一篇文章给excle中添加fcitx\n可以直接修改desktop配置文件\n`sudo gedit /usr/share/applications/wps-office-et.desktop`\n把其中的\n`Exec=/usr/bin/et %f`\n修改为:\n`Exec=env XIM=\"fcitx\" XIM_PROGRAM=\"fcitx\" XMODIFIERS=\"@im=fcitx\" GTK_IM_MODULE=\"fcitx\" QT_IM_MODULE=\"fcitx\" /usr/bin/et %f`\n\n结果在~./profile中删除了上面的一段代码,悲剧了,又折腾了一个多小时.....\n终于在WPS FOR LINUX 社区中找到了**原文**:\n```\n原因：环境变量未正确设置，以上可以直接针对wps设置。\n打开终端输入：\n$ sudo gedit /usr/bin/wps\n可以看到文件内容（文字加粗的部分就是要补齐的,下同）\n*******************************\n#!/bin/bash\nexport XMODIFIERS=\"@im=fcitx\"(这一行是添加进去的)\nexport QT_IM_MODULE=\"fcitx\"(这一行是添加进去的)\ngOpt=\n#gOptExt=-multiply\ngTemplateExt=(\"wpt\" \"dot\" \"dotx\")\n.......\n************************\nwps表格不能输入中文解决\n$ sudo gedit /usr/bin/et\n************************\n#!/bin/bash\nexport XMODIFIERS=\"@im=fcitx\"(这一行是添加进去的)\nexport QT_IM_MODULE=\"fcitx\"(这一行是添加进去的)\ngOpt=\n#gOptExt=-multiply\n........\n\n************************\nwps演示不能输入中文解决\n$ sudo gedit /usr/bin/wpp\n************************\n#!/bin/bash\nexport XMODIFIERS=\"@im=fcitx\"(这一行是添加进去的)\nexport QT_IM_MODULE=\"fcitx\"(这一行是添加进去的)\ngOpt=\n#gOptExt=-multiply\n........\n修改完后保存，在打开相应的程序切换输入法就可以输入中文了。\n```\n参考资料:\n[fcitx输入法在wps、wineqq中失灵问题的解决](https://segmentfault.com/a/1190000000361008)\n[ubuntu 16.04在WPS下能输入中文的解决办法](http://forum.ubuntu.org.cn/viewtopic.php?f=48&t=476937)"
		},
		{
			"post_id": 17,
			"title": "反腐与致胜联盟的胜利",
			"date_published": 1481741342.929,
			"body": "总论：腐败是政治交换中为确保致胜联盟支持自己的政治地位所做的一种交换，也是一种为自己谋取更好的需求，不管这种需求是金钱、权力还是名利，的一种交换。通常我们讨论的是官员为了谋求自己私人利益而不顾公共大众的利益，这里大众的利益通常是名义候选人的利益，他们对在位者的统治不构成威胁。举个例子，2008年，一场超强飓风横扫缅甸南部，风暴摧毁了整片整片村镇。缅甸军政府没有去救助难民，而是把人们从避难所驱赶出来，要求他们回到自己的已经荡然无存的村子“努力工作”。军队夺走了从境外运来的救援物资，告诉灾民，他们可以吃青蛙。据估计，约有50万人死于这场灾难，所幸的是，这些死人是不会抗议的。通常对在位者构成威胁的属于致胜联盟，即内部反叛，在位者要时时刻刻去保持致胜联盟的支持，否则失去致胜联盟的支持，他们或死亡或流放他国或下台。这里我们需要澄清一个观点，腐败在不同人的眼里是不同的，他们有不同的含义。这里将罗列两个含义，第一个是我们通常普通人的含义，即官员运用公共权力谋求私人利益。第二个含义是在位者为谋求核心支持者的支持而允许致胜联盟收获利益。\n\n---\n\n###一　腐败产生的生物社会背景\n####１　我们基本的物质需求\n　　从人类历史的发展来说，腐败自从有了集体以来，腐败就随之而来了。当然，我们曾幻想过一个物质极大丰富的空想社会，叫做社会主义高级阶段，在那个社会里人们是按需分配，这得需要自动化生产的极大提高，机器人已经完全取代了人类重复的生产活动，人类已经从事某些机器不能替代的工作，比如科学前沿的探索，艺术，创新等工作，当然，那或许是几千年，几万年的事，当然，也可能会发生如爱因斯坦预言所说的：我不知道第三次世界大战用什么武器，但我知道第四次世界大战用的武器是石头。回顾目前的社会生产力也就是科技的发展：现在我们能源问题都还没有解决，而化石能源总有烧完的一天，据说是一两百年后了，然而可控的清洁聚变反应在砸下了大把大把的纳税人的钱后还是一个声响也没有听见。总之我们祖先十几万年从拿着石头斧头驱赶狩猎野兽的远古非洲人远迁徙到各个大陆到如今除了南极洲外各个大陆都是人类的身影，我们的也从木质斧头、石质斧头、青铜、钢铁、铝合金到钛合金，我们的文明从蛮荒进入文明，但我们身上的ＤＮＡ依然只是几十万年前那一群非洲猿人的复制品，尽管在十几万间有很多基因突变，比如控制皮肤肤色基因的改变，从而诞生了白种人，黄种人，黑种人等。\n　　但是我们的高级意识几乎没有变，比如人的本性：生存的需求，繁衍，抚养基本还是一样的，在我们短暂的几十年里，或许几万年前的古人更短，即使从蛮荒进入文明的近三千年的时光里，我们的平均寿命依然显得少的可怜。在短暂的几十年里，我们必须完成基因铭刻在我们潜意识的任务，完成生存，繁衍等。资源在没有极大的丰富之前，没有在纳米科技成功普及之前，我们人类必然面临资源短缺的问题，资源稀缺有时意味着生存与否，比如中东某些聚居地为水资源大打出手。不言而喻，必要的资源是保障我们生存的基本条件，也只有在基本物质条件满足后我们才会将我们的精力转移到其他地方：比如追求安全感，追求幸福，追求稳定。当然，现在目前的社会发展是不均衡的，有些地区比如东部沿海区域经济发达，而西部地区却是贫穷不堪。**不同的人享有的资源是不同的**，但是，相比较而言，剔除１％的顶层人员（比如比尔盖茨，马云，孙正义，几百名中央政治局委员或者诸如胡润富豪榜的富豪名单等），我们大多数社会成员对你所占有的资源是不能满足你的高级需求的，比如你追求幸福美满的家庭，在当下，你得有一所房子，你得有一个６位数的甚至７位数的年薪，这些都是你追求幸福生活的基石，当然，我并是说没有一所房子，没有６位数的收入，你就不幸福，你可能举出反例，比如某位明星，他或她的身家是如何富有，但媒体上的新闻却清楚的告诉你她或他在婚姻上并不如意，或者又如某位贫困却安然享乐的民间高手，先生，我们先不去考虑这些例子，因为，显然，你在满足基本的物质需求，比如基本的温饱衣暖后，你得追求更好的东西，比如安全感，举个例子：你得逃离目前你所处的社区，因为这个社区经常被小偷光顾，经常发生打架斗殴等恶性治安事件，经常晃荡着有多无所事事的无业流民。这是我们的天性，我们追求更好的生活，我们只关心身关我们切身利益的事，对于非洲此时仍然处于极度饥饿的儿童，我们是不会投去我们哪怕一秒的关心。\n　　坦荡的承认有助与我们接近事实的真相，有时人们的对某间事物的观点、看法是不会达到统一的，比如我正在享用的电转换为光的日光管，西方人把他叫做fluorescent light，而在某个现代文明还没触及的非洲部落，他们管它叫做神迹，但是不管怎样，事实的真相只有一个，它就在那里，不管你管它叫什么，比如日光灯、fluorescent light或者神迹。\n　　我们去获取我们不曾拥有的稀缺资源，包括权力，金钱，名利等，我们被我们的需求所驱动；被我们的强烈的权力欲望所控制，我们希求权力；被我们对金钱的渴望，我们努力工作、努力拓展自己的获取范围；被我们对于好的名望的追求，我们与他人建立良好的关系等。\n###２腐败只是一种换取稀缺资源的交换\n让我们理清一下腐败的基本定义：\n\n*Corruption is a form of dishonest or unethical conduct by a person entrusted with a position of authority, often to acquire personal benefit。Government, or 'political', corruption occurs when an office-holder or other governmental employee acts in an official capacity for personal gain.[1] Corruption may include many activities including bribery and embezzlement, though it may also involve practices that are legal in many countries.[2] Government, or 'political', corruption occurs when an office-holder or other governmental employee acts in an official capacity for personal gain.（维基百科）\n翻译：腐败是一种被赋予权威地位的人不诚实或不道德的行为，通常是为了获得个人利益。政府或“政治”腐败发生在办公室人员或其他政府雇员以官方身份行使个人 增益。[1] 腐败可能包括许多活动，包括贿赂和贪污，尽管它也可能涉及在许多国家是合法的做法。[2] 政府或“政治”腐败发生在办公室人员或其他政府雇员以官方身份行使个人利益时。*\n\n  　　现在，我们得抛去道德的枷锁，不去评论某人的道德水平，因为我们对道德的认同是不同的，因为有人认为在我们这里当场人垃圾是可接受的，但在日本确实不可原谅的。那么，撕开道德的面纱，腐败，也就是说人们是腐败是为了获取稀缺资源的一种交换。而交换是没有什么神秘面纱的，交换只是我们获取资源的一种方式，和我们付钱去享受某种服务，付出努力收获成果、播种后取得果实一样，都只是我们为了满足我们的某种需求，比如生存：在朝鲜你得贿赂守边的军人才能偷渡到韩国，而朝鲜的军人需要这些钱去交换某些高级物资，比如高级酒，烟等；比如你想上某地区师资力量最好的公立高中，你得花大把的钱去疏通关系，去争取名额，而学校需要这些钱去发展教学设备，员工福利或者流入不知道的地方。\n  　　交换，通常意味这权力、金钱和名利的相互作用。让我们回到总论里提到的我们对腐败的认识。通常，腐败意味着公共权力的寻租。这是最表层的含义。\n*公共权力字典解释：公共权力本是公民的共同权力，为全体公民共同所有。但在现实社会生活中，公共权力的行使不可能由全体公民来共同行使，而只能由其代表（或委托人）来行使。*\n这些代理人就是官员。当然，这些概念都是舶来品，我们还是从我们自己的传统思想出发，才能尽可能的就近我们本土的真相。在我们的报纸，媒体，书籍里，宣称官员里有一种青天大老爷，他们与贪官污吏斗争，他们为百姓谋福利。我们的内心总是期待一种好的领导人带领我们走向繁荣富强的未来、让我们享受到政策带来的优惠，了解民间的疾苦，并且深入群众，为人民服务。我们相信我们的领导人就是我们的大救星，将拯救我们于水火之中，将带领我们走向一个美好的未来。我们的确信任这些东西，不管是几十年前还是几十年后。那么，是否我们只是延续了我们两千多年的历史呢？当然，现在我们比古代的情况要复杂得多了，但有一点是不变的，设计制度的是这片土地的人，执行制度的也是这片土地的人，那么，我们更进一步，假想如果这片土地的思想内含依然一脉相承，依旧是统治了这片土地两千年的儒家犬儒主义思想，那么，我们得从源头上去寻找，我们得从历史中寻找。\n###３　思想中的幽灵在飘荡\n　　我们历史延续了两千年的封建等级制度文化思想，尽管历史从１９１１年中华民国建立就宣告了封建主义等级社会的消失，但封建社会的等级思想却像一个幽灵一样飘荡在中国这片广袤的土地上，不管是在国民党统治时期还是在共产党治理下，这是一个事实，这点没有发生根本上的变化。设计制度的是人，执行制度的也是人，而人的思想根源仍然停留在２０００年的儒家统治下。比如孔子的君君臣臣父父子子。\n　　孔子毕生周游列国就是想恢复周礼，而儒家的礼教，显然是用来显示身份、划分级别的。人们按照这些身份级别来生活、交往，这就叫懂规矩、知礼节。知道这个礼节与规矩，对于我们的生存很重要的。你是什么身份，就要安于社会对你有什么样的安排，以及享受什么样的待遇。\n比如范进中举后胡屠夫的教导：“\n*你如今既中了相公，凡事要立起个体统来。比如我这行事里，都是些正经有脸面的人，又是你的长亲，你怎敢在我们跟前装大?若是家门口这些做田的，扒粪的，不过是平头百姓，你若同他拱手作揖，平起平坐，这就是坏了学校规矩，连我脸上都无光了。你是个烂忠厚没用的人，所以这些话我不得不教导你，免得惹人笑话。”*\n当范进中举后，他与岳父身份就不同了，怎么能够再像原来那样不分彼此呢？儒家的礼教，显然是用来显示身份、划分级别的。人们按照这些身份级别来生活、交往，这就叫懂规矩、知礼节。\n　　显然，在古代，人与人之间，见面就是要作比较的，分出个高低贵贱。现在，我们只不过换了一种说法：我们追求成功，我们想做人上人。假象一下，如果没有人住风雨交加的茅屋，那么住豪宅就没有了绝对的优越感。如果没有人冻死路旁，那么锦衣玉食就失去了更大的风光。如果没有人衣衫褴褛，食不裹腹，那衣锦还乡，光宗耀祖还有什么意思？在比较中才能够感受到幸福与成功的我们，在成为人上人之前，苦难是必须要有的。正如孟子所说：故天将降大任于是人也，必先苦其心志，劳其筋骨，饿其体肤，空乏其身，行拂乱其所为，所以动心忍性，曾益其所不能。我们生来就是要受苦的，而受苦是成就大事的必须条件，正如现在所说苦难造就财富。成了大事，我们就是人上人了，我们就有了衣锦还乡的荣耀感，有了光宗耀祖的欲望。不可否认的是我们思想骨子里就是喜欢当地主，当大地主。集万亩良田于一家，让无数乡民为他耕种，然后过一种不劳而获的生活。中国人其实是蛮适合生活在农业社会里的。不是吗？农业社会，就是地主阶层是富翁阶层啊，谁土地多，谁牛逼。今天的中国人，做不成地主就做房主。全社会的财富都集中在房地产上。现代商业文明所创造的那些便利的工具、手段，只是被中国人用来更方便地做地产交易了。本质上，中国人的思维方式，还是农业社会的一套。这是为什么房地产市场能够在中国这么火爆的一个重要的文化原因。\n　　我们追求这种当人上人的生活，自己将社会的财富集中在自己的手里，不管这种财富是名利、权力还是金钱。所以，不管你是否是成功者还是失败者，他们骨子里的观念都是一脉相承的。而成功与失败的差别只是争夺那把龙椅的成功还是失败。他们有时斗得你死我活，看似不共戴天，势不两立，其实他们并不是思想价值观念上的敌人，只是争夺龙位上的死敌，无论谁争到了，所过的生活其实是一样的。\n  　　封建等级文化制度可以说是最符合人性的，举个例子，现在哪个男人心里不希望三妻四妾？没有西方文化的传入，中国的妻妾成群绝对是标配。而权力和金钱代表的是对社会资源的占有程度，权力愈大，金钱愈多，从生物本性来说，就愈倾向于留下更多的后代，这是基因繁殖的意向，谁也不能阻止。举个例子：当历史大倒退时，太祖做火车巡游天下，日里万“机”，当然，太祖自己是坦坦荡荡的，他自己说的是“马克思加秦始皇”，然而当时除了抽白面的林和身体衰弱的陈外，其他的可谓是身处万花从中。（出自李志绥的书）显然，上面这些家伙在宣传中可谓是伟光正，可是在暗地里深得儒家三昧。我们的儒家文化是要训练人做奴才的，也只有奴才太监之流才可以做到对主子的绝对忠诚，尽管很多人还达不到在皇帝面前训斥英国使臣的境界，可在对主子忠诚下时才可以大捞特捞，这样也就成了圈子里的人，也就是所谓的官官相护，可见，没有阳光，这些东西迟早发霉。\n###二　腐败－－－致胜联盟的交换手段\n　　让我们回到我们的主题：显然，前面，我们重新定义了腐败，不带道德观念去审视它，腐败只是一种交换，一种资源去交换另一种稀缺的资源。而通常我们对腐败最直接的意义是政府官员借助公共权力去谋取个人利益。先生，当说道腐败时，想必你一定会对腐败恨之入骨，是的，你认为他不配当这个官员，正如当前张艺谋导演上映的号称突破了限制级别的影片\n里影片《我不是潘金莲》在一开头就借着法院老领导的口说出“当官不为民做主，不如回家卖红薯”的官场“金玉良言”。是的，这和中南海那块“为人民服务”的题词一样，那么，我们是否能够在深入一点，我们是否能够在深入探讨一下：比如为什么官员一定要为人民服务？我们的传统意识里父母官是一定要为我们百姓做主的，我们幻想一定有青天大老爷为我们谋福祉，为我们的奔走呼吁，为我们除掉贪官污吏，为我们谋发展。是的，媒体告诉，某些人的不当只是底层，上层在制定顶层设计一定会给我们带来福祉，只是底层执行的时候出了问题。报纸告诉我们国家领导人每天在关注普通民众的福利，他们在为我们的利益奔走。\n　　那么，在让我们深入一点：我们都知道每个人都是为自己的利益才会去做相应的事物，比如你不会凭空给路上一个乞丐一套房子，最多给他几块钱，满足一下自己助人为乐的良知、你不会为其他人的孩子支付他的抚养费，生活费，你只会为自己的孩子投入大量的精力，在这投入之中你感到了幸福感，你知道自己晚年是幸福的，不会孤独寂寞终生。那么相应官员也会为了他们切身利益而行动。那么与官员切身相关的利益是什么？**政治！**政治关乎到官员的任免，升迁。而官员的任免和升迁在中国两千年的中央集权制度里，是由皇帝和各种势力的角逐。也就是说，是由上级官员任命，拍板决定的。官员自然对上负责而不对下负责，不要指望官员下身段来走群众路线，在集权体制下，这只是一种奢望。你以为写着“为人民服务”的地方是“人民”随便能进去的吗？\n　　这里，我借鉴按照《独裁者手册》里的观点：名义选择人；实际选择人；致胜联盟。所谓“名义选择人集团”，就是那些名义上有投票权的公民；实际选择人集团在某些国家可能是实际的投票人，在另一些国家则可能是党代表大会之类的机构；但这些都不那么重要，真正重要的是最后那个“致胜联盟”——即真正决定一个领导人上台还是下台的那些核心人物——可能是坐在珠帘后面的慈禧太后，也可能是当年为奥巴马投票的关键摇摆州的美国选民。如果必须用一句话来总结此书的中心论点，那就是：一个领导人，不管他身处什么样的制度，都只会讨好决定其输赢的那个“致胜联盟”。别幻想什么“为人民服务”了，政治就是“为致胜联盟服务”。\n　　在官员权力的来源搞清楚后，我们就会明白在位者是为致胜联盟服务的，如果在位者不为致胜联盟服务，那么致胜联盟就会毫不犹豫的抛弃他。据此，很容易明白：在朝鲜，金正日只需要让少数人高兴就足以维持自己的统治；而在美国，川普，他必须让很多支持他的选民满意才行，不然会在下一届总统选举中下台。\n　　显然，从更高的地方出发，我们发现腐败只是一种交换，我们通过腐败交换对彼此不曾拥有或拥有不足的资源，我们需要满足更高的需求，不管这种需求是金钱的，还是情感的。\n　　在政治中看待腐败，那么，它只是一种一种维持统治的策略，假想一下，当你上台后，你必须给致胜联盟刚好足够的确保他们不会背叛你的利益（不管这种以什么形式出现，比如金钱，政策的偏移等），不然你就会被核心支持者背叛，在某些国家这通常意味这株连九族。也就是说，在政治的角度看来，致胜联盟的支持相当重要，而且为了保持自己在位时间和巩固统治，需要让自己的致胜联盟越小越好，让备胎越多越好，那么致胜联盟的忠诚度就是重中之重，你可以没有能力，没有相当优秀的行业水准，没有相应的道德水准，只要你忠于于在位者，确保绝对支持，那么在位者也绝不吝啬对他的铁杆粉丝的丰厚回报，不管是物质或者是名利性的东西。\n　　那么这里，我们回顾总结一下，腐败从人类开始以来就伴随我们的历史，宛如幽灵一样，幽灵是见不得阳光的，尤其在目前物资并不是极大丰富的情况下，没有透明的机制运行，腐败在政治领域是必须的，打个比方：相识的三个人中其中两个人用刀捅了了另一个无关的人，作为见证者，你怎么办，是去补刀，还是发誓说绝对不说出去。如果你选择发誓，恐怕剩下的两个人不会相信你的言语，那么毫不犹豫地，他们的刀只有朝向你了，这就是人性了。所以因腐败下台的都是不支持在位者的，因为在不透明的政治里所有的人都是共犯，也就没有所谓的清官和贪官了。\n\n参考资料:\n1 独裁者手册　中文\n2[《我不是潘金莲》的荒诞逻辑背后，竟是一曲粉饰集权的赞歌](http://mp.weixin.qq.com/s/P12w8YhBPfFCReCmbbnoSA)\n３ [古代见官为什么有三份罪？](http://blog.ifeng.com/article/46352742.html)\n４《毛泽东私人医生回忆录》李志绥\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
		},
		{
			"post_id": 16,
			"title": "Linux Mint18优化指南",
			"date_published": 1480128394.54,
			"body": "### 1 usb制作u盘启动：\nLinux Mint安装磁盘以MBR格式最好，当转为GPT格式时，安装会出现.\n>the partition table format in use on your disks normally requires you to create a separate partition for boot loader code. this partition should de marked for use as a \"reserved bios boot area\" and should de at least 1 mb in size. note that this is not same as a partition mounted in /boot. \n\n下载linux mint 镜像包，用rufu刻录进入u盘，选择MBR格式刻录，刻录完毕后，进入BOIS设置USB启动优先于硬盘启动，重启（Ctrl + alt + delete），进入安装界面，选择语言，中文，以其他方式安装，分配原则：\n**/ 分区**，为主分区，50G左右，因为根分区不宜过大，损坏后会导致系统出问题。\n**交换分区**，2G，原则上不超过2G，因为虚拟的硬盘内存的读写速度太差，多了效果不好，还浪费硬盘。\n**/home**，我的经验尽可能的多的分配给/home目录硬盘空间，因为你的工作目录就是在这个下面的，比如/home/linuxtest（你的用户名）下你的桌面文档，下载，图片等\n**/backfile 专门放备份文件的**。\n**/ 随便一个文件名啦** 其他的剩余的硬盘可以放在另一个分区挂载一个文件下。\n接下来就是等待安装啦，记住不要联网，否则会安装下载文件很久滴。\n\n---\n\n### 2 Linux MInt18 优化配置\n安装成功，重启，记得拔u盘，不然又进入安装界面滴。\n进入了 linux mint 18 系统，请按下面的步骤操作：\n**1网络**：用usb线手机网络链接电脑，开机选驱动选项，更新无线驱动\n\n![](http://ombwxe7wh.bkt.clouddn.com/10000201000002AA000001E0C54B3D3F7C0C5C2D.png)\n![](http://ombwxe7wh.bkt.clouddn.com/1000020100000286000001FF9C753101CB755758.png)\n第二步：选择上述的选择，重要的是第二个，无线网卡，推荐一开始就安装，后面有一次我重装更新了之后就不能安装无线网卡，安装包之间的关系不能满足。泪奔啊～～～～～～～\n**2 打开防火墙**，\n![](http://ombwxe7wh.bkt.clouddn.com/100002010000017E000002317870EDD98F5E9E37.png)\n**3 更改软件源**，主要因为“你懂的”的原因哈，墙外的镜像源速度太慢，换国内的镜像源，点击，等会儿选速度最快的。\n![](http://ombwxe7wh.bkt.clouddn.com/10000201000002E70000022275E056E123C06307.png)\n**4 输入法**：\n![](http://ombwxe7wh.bkt.clouddn.com/100002010000031C000001F2643F9953C530AFBD.png)\n**5 中文化**尽管Linux Mint 的中文化已经很好了，可还是有写地方是英文，可以输入\n![](http://ombwxe7wh.bkt.clouddn.com/1000000000000373000001245769BE1BE08D4093.png)\n``` bash\n$ sudo apt-get install language-pack-zh-hans language-pack-gnome-zh-hans libreoffice-l10n-zh-cn thunderbird-locale-zh-hans firefox-locale-zh-hans\n```\n**6 让其它分区可写**\n如果你有其它ext分区，比如想用来存储和备份文件，那么你需要让它们可写，以免每次都要使用root特权。\n首先，使用gksudo在文件管理器里打开分区挂载目录 命令：\n``` bash\n$ gksudo nemo\n```\n导航到分区目录，右击去往属性 > 权限标签,**去更改root为linuxtest（你的用户名）**\n赋予“目录访问” - 创建和删除文件权限给用户、组和其它。\n赋予“文件访问” - 读和写权限给用户、组和其它。\n推荐一个方法批量修改权限用户和文件权限\n``` bash\n$ chown -R user.user /文件地址 # -R参数为递归  批量修改文件的权限用户\n$ chmod  777  文件名           # 修改文件权限\n```\n**7 识别txt乱码** 在”菜单:系统工具”中找到”dconf系统配置编辑器”,在编辑器左侧逐步点击\n``` bash\n$ sudo apt-get install dconf-tools \n```\n`org/x/editor`,找到我们需要修改的地方\n`['UTF-8', 'CURRENT', 'ISO-8859-15', 'UTF-16', 'GB18030', 'GBK', 'GB2312']`\n\n### 3 基本办公需求\n第一件事情是重中之重，就是让你的系统保持时刻最新 .也可以使用更新管理器来安装更新，不过最好在更新选项里选择只更新重要的更新，即不要破坏我的电脑.\n``` bash\n$ sudo apt-get update\n$ sudo apt-get upgrade\n```\n**1安装google浏览器**命令如下：\nGoogle chromium\n``` bash\n$ chromium：sudo apt-get install chromium-browser\n```\nchromium 汉化命令:\n``` bash\n$ sudo apt-get install chromium-browser-l10n\n```\nGoogle Chrome 64位\n64 位\n``` bash\n$ wget https://dl.google.com/linux/direct/google-chrome-stable_current_amd64.deb\n$ sudo gdebi google-chrome-stable_current_amd64.deb\n```\n32 位\n``` bash\n$ wget https://dl.google.com/linux/direct/google-chrome-stable_current_i386.deb\n$ sudo gdebi google-chrome-stable_current_i386.deb\n```\n**2 安装rar和其它归档工具**\n``` bash\n$ sudo apt-get install unace p7zip-rar sharutils rar arj lunzip lzip\n```\n**3 安装WPS软件**，因为很多工作文档都是word格式，而Linux Mint 自身的开源版libre office writter所编写的文档格式不被识别，建议安装WPS，这样电脑基本上就达到办公的要求了。\n安装命令：\n``` bash\n$ wget http://kdl.cc.ksosoft.com/wps-community/download/a21/wps-office_10.1.0.5672~a21_amd64.deb\n```\n不过速度比较慢，推荐到官网社区去下载：[WPS for Linux](http://community.wps.cn/download/)\n注意的是：执行完成之后，启动wps，出现文字字体的问题。可以在CSDN中搜索下载wps for linux 文字包。\n通常在Ubuntu中会出现**wps文字**中无法启用fcitx输入法的问题,\n>$ sudo gedit  /usr/bin/wps      # 添加内容，字体标注\n!/bin/bash\nexport XMODIFIERS=\"@im=fcitx\" ####这是添加的内容\nexport QT_IM_MODULE=\"fcitx\"  ####这是添加的内容\ngOpt=\ngOptExt=-multiply\ngTemplateExt=(\"wpt\" \"dot\" \"dotx\")\nwps**表格**不能输入中文解决\n$ sudo gedit  /usr/bin/et      # 添加内容，字体标注\n!/bin/bash\nexport XMODIFIERS=\"@im=fcitx\" ####这是添加的内容\nexport QT_IM_MODULE=\"fcitx\"  ####这是添加的内容\ngOpt=\ngOpt=\ngOptExt=-multiply\nwps**PPT**不能输入中文解决\n$ sudo gedit  /usr/bin/wpp\n!/bin/bash\nexport XMODIFIERS=\"@im=fcitx\"  ####这是添加的内容\nexport QT_IM_MODULE=\"fcitx\"    ####这是添加的内容\ngOpt=\ngOptExt=-multiply\n\n\n**4 网易云音乐**  到[这里](http://music.163.com/#/download）下载安装,目前只提供Deb版本和Deep in版本\n**5 Xmind** 思维导图 到[这里](http://www.xmind.net/download/previous/),编译安装\n** 6 安装Install Sticky Note Indicator**  使用便利贴记事\n``` bash\n$ sudo add-apt-repository ppa:umang/indicator-stickynotes\n$ sudo apt-get update\n$ sudo apt-get install indicator-stickynotes\n```\n**7 Veracrypt** 加密文件\n``` bash\n$ sudo add-apt-repository ppa:unit193/encryption\n$ sudo apt-get update\n$ sudo apt-get install veracrypt\n卸载Veracrypt\n$ sudo apt-get remove veracrypt\n```\n**8 安装星际汉译王** 离线翻译不用愁没网\n``` bash\n$ sudo apt-get install stardict\n```\n安装词典 /usr/share/stardict/dic/或者 ~/.stardict/dic 推荐词典链接[这是词典链接1](http://vdisk.weibo.com/s/ujjQubsySOuL3),[这是词典链接2](http://download.huzheng.org/PowerWord/) 推荐使用在~/.stardict/dic安装.将解压的文件移动到~/.stardict/dic\n**9 wine** 愉快的享用windows下的特色软件,比如福昕阅读器的添加标签的功能,[这里](https://www.foxitsoftware.cn/)下载用wine安装.\n``` bash\n$ sudo add-apt-repository ppa:wine/wine-builds\n$ sudo apt-get update\n$ sudo apt-get install --install-recommends winehq-devel\n$ winecfg\n```\n**10 Sigil** 制作Epub文件，以及Mobi格式的文档\n目前手机上阅读体验比较好的当属于Epub和mobi格式，怎样制作，安装sigil就可以制作呢，在安装包管理器里下载calibre转化就可以了\n``` bash\n$ sudo aptitude install sigil \n```\n**11软件包管理**  \n直接在**软件包管理**里安装音乐播放器如VLC，截图软件Shutter，虚拟机Virtualbox。\n**12 获取美丽的壁纸** \n``` bash\n$ sudo apt-get install mint-backgrounds-*\n``` \n**13 为知笔记Linux版本** \n``` bash\n$ sudo add-apt-repository ppa:wiznote-team\n$ sudo apt-get update\n$ sudo apt-get install wiznote\n```\n**14 密码管理工具password safe**\n``` bash\n$ sudo add-apt-repository ppa:zak-k/ppa-main\n$ sudo apt-get update\n$ sudo apt-get passwordsafe\n```\n\n### 4 编程工具配置\n**1 Guake下拉终端 ** 下拉终端让你可以通过点击单个键来访问终端\n命令：\n``` bash\n$ sudo apt-get install guake\n```\nGuake需要配置，以便在每次登陆时启动。首先，找到guake命令的路径。\n现在，把它添加到启动程序列表中。出门左拐，请往系统设置 > 启动程序，然后点击添加。在对话框中选择程序。\n**2 systemback**,备份系统文件,可以尽情愉快地玩耍了\n``` bash\n$ sudo add-apt-repository ppa:nemh/systemback\n$ sudo apt-get update\n$ sudo apt-get install systemback\n```\n**3 Atom** 在ubuntu/Linux Mint上安装Atom 愉快的敲代码\n``` bash\n$ sudo add-apt-repository ppa:webupd8team/atom\n$ sudo apt-get update\n$ sudo apt-get install atom\n卸载Atom\n$ sudo apt-get remove atom\n$ sudo add-apt-repository --remove ppa:webupd8team/atom\n```\n**4 haroopad** 也是一款代码编辑工具，支持Markdown语法\n``` bash\n$ wget https://bitbucket.org/rhiokim/haroopad-download/downloads/haroopad-v0.12.2-i386.deb  #### 32 bit Ubuntu, Debian and derivative system\n$ sudo apt-get install gdebi\n$ sudo gdebi haroopad-v0.12.2-i386.deb\non 64 bit Ubuntu, Debian and derivative systems\n$ wget https://bitbucket.org/rhiokim/haroopad-download/downloads/haroopad-v0.12.2_amd64.deb\n$ sudo apt-get install gdebi\n$ sudo gdebi haroopad-v0.12.2_amd64.deb\n```\n**5 Virtubox** 开源的虚拟机\n到[这里](https://www.virtualbox.org/)下载安装.\n记得添加 vboxusers .使virtualbox 识别USB设备\n/* 添加用户到vboxusers用户组 */\n``` bash\n$ /usr/sbin/usermod -G vboxusers -a charles(用户名）\n$ /usr/sbin/usermod -G vboxusers -a root\n```\n**6 GTkhash** 图形界面的 MD5 值核对工具。\n``` bash\n$ sudo aptitude install gtkhash\n```\n**7 eclipse** java 以及C/C++ IDE开发\n到[这里](https://www.eclipse.org/downloads/)下载安装，\n其中eclipse需要如何安装java环境，测试 `java -version`\n安装最新版本`sudo aptitude install java`\n然后，解压 Eclipse\n使用`Ctrl+Alt+T` 打开终端并使用如下命令将 Eclipse 解压到 /opt/ 目录以供全局使用：\n`cd /opt/ && sudo tar -zxvf ~/下载/eclipse-*.tar.gz`\n创建 Eclipse 快捷方式，在终端中执行如下命令\n``` bash\n$ sudo gedit /usr/share/applications/eclipse.desktop\n```\n如果是空白，则添加如下内容\n>[Desktop Entry]\nEncoding=UTF-8\nName=Eclipse 4.4.2\nComment=Eclipse Luna\nExec=/usr/bin/eclipse\nIcon=/opt/eclipse/icon.xpm\nCategories=Application;Development;Java;IDE\nVersion=1.0\nType=Application\nTerminal=0\n\n**8 Komodo Edit** 一个免费的、开源的、专业的Python IDE,也可以到官网下载,点击[这里](https://www.activestate.com/komodo-ide/downloads/edit)下载相应的版本.\n``` bash\n$ sudo add-apt-repository ppa:mystic-mirage/komodo-edit\n$ sudo apt-get update\n$ sudo apt-get install komodo-edit\n```\n**10 打开txt文件时,会出现乱码,因为系统无对应编**\n安装dconf-tools\n``` bash\n$ sudo apt-get install dconf-tools\n```\n 在\"菜单:系统工具\"中找到\"dconf系统配置编辑器\",在编辑器左侧逐步点击\n\"org/x/editor\",找到我们需要修改的地方\n![](http://ombwxe7wh.bkt.clouddn.com/%E9%80%89%E5%8C%BA_025.png)\n3 我们可以看到在右侧”auto-detected-encodings” 里出现的编码，默认值是‘UTF-8’。我们需要手动添加 ‘GB18030’， ‘GBK’， ‘GB2312’ 这三种编码：双击右侧的”值“的选项，出现槽框后添加上述三种编码。如下图:\n![](http://ombwxe7wh.bkt.clouddn.com/%E9%80%89%E5%8C%BA_048.png)\n点击确定.\n**10 清除**做完这一切后，请为系统进行一次大扫除，移除一些不必要的包。\n``` bash\n$ sudo apt-get autoremove\n```\n\n### 5 还有更多软件等待你的宠信哒 \n- Opera - 网页浏览器\n- Gnome Encfs Manager - 管理使用Encfs加密的文件和文件夹\n- Smplayer - 多媒体播放器\n- Rhythmbox, Clementine - 音乐播放器\n- Openshot, Kdenlive - 视频编辑器\n- Audacity - 音频编辑器\n- Inkscape - 图形和图像编辑\n- Gparted - 分区编辑器\n- Gufw - 防火墙配置工具\n- qBittorrent, Vuze - Torrent客户端\n- Gwenview - 图像浏览\n- Team viewer - 远程桌面\n- Tv-maxe - 查看电视频道\n- Grub Customizer - 修改GRUB启动菜单设置\n- Linrunner TLP - 电源管理工具，对笔记本节电很有用\n- Virtualbox - 虚拟化\n- Kazam, recordMyDesktop - 桌面录像/演示\n- Bleachbit - 通过删除旧的/临时文件释放磁盘空间\n- Cheese - 使用网络摄像头拍照\n- Shutter – 带有众多功能的屏幕截图工具\n- zim -基于维基百科的知识管理系统\n\n### 6 桌面美化--Docky\n直接在**软件包管理**里安装强大的屏幕美化软件Docky！！！！！！（linux不搞个好的桌面都愧对自己了）直接来我的优化的结果。\n![](http://ombwxe7wh.bkt.clouddn.com/10000000000007800000043822FA8F1E85DB2F49.png)\n**高能注意啦**，安装Docky后，\n只不有过一点需要注意，这个东东（比如你想把自己钟意的软件添加到栏目上）直接很上拖是添加不上去的\n需要从/usr/share/applications里面拖出来才可以滴～参考文章：[Linux Mint---安装docky](http://www.cnblogs.com/wbbice/p/4681361.html)\n安装：Conky Manager\n默认Conky安装后在开始菜单中是看不到的，要在命令行执行Conky &启动，而且要手动安装各种主题插件，很麻烦。所以一定要安装Conky Manager\n``` bash\n$ sudo apt-add-repository -y ppa:teejee2008/ppa\n$ sudo apt-get update\n$ sudo apt-get install conky-manager\n```\n当然，还可以仿苹果的风格，需安装Cairo-Dock，\n命令：\n``` bash\n$ sudo apt-get install cairo-dock\n```\n需要注意的是当添加自己的钟意的软件时，安装插件的方法我还没找到，已经解决的童鞋请一定要联系俺啊，我可是挺钟意苹果风格滴。\n主题风格里在：**设置-主题-添加或移除桌面主题-void**\n下面的栏目可以在**设置-面板-自动隐藏面板**。\n在**设置-热区-选定激活悬停**，这样就可在鼠标移动到特定的角落（比如左上角），系统会自动将屏幕分为4个工作区，完爆windows的win + tab 键切换工作区域\n比如：\n![](http://ombwxe7wh.bkt.clouddn.com/10000000000007800000043802C458B039CC0E23.png)\n感觉不错吧。\n还有一个不错的拓展：设置-拓展-可用的在线拓展-Desktop Scroller（强烈推荐），用鼠标的滑动即可切换屏幕。\n\n参考资料：\n1[Linux Mint 17一周使用体验 ](http://blog.csdn.net/dc_726/article/details/45399457)\n2[多快好省：10个技巧加速你的LinuxMint/Ubuntu ](http://www.mintos.org/skill/speedup-mint.html )\n3[陟遐自迩：一个小技巧提速你的LinuxMint](http://www.mintos.org/skill/swap-accelerate-mint.html)\n4[Linux Mint---安装docky](http://www.cnblogs.com/wbbice/p/4681361.html)\n5[安装Linux Mint 17后要做的20件事](https://linux.cn/article-3353-2.html)\n6[Mint Linux 软件应用系列教程(五)--屏幕录制kazam](http://www.wtoutiao.com/p/1dfhzwT.html)\n7[ Linux Mint 17.3 从零开始](http://blog.csdn.net/revisit/article/details/50655530)\n\n"
		},
		{
			"post_id": 15,
			"title": "真实的觉醒",
			"date_published": 1479728604.711,
			"body": "   每天，我都追逐快乐，从虚幻的娱乐的感官刺激到现实世界的一种美满生活的希求，我不停的在转换能够给我带来愉悦的东西，不管这些是精神上的上帝，佛陀，还是美味可口的食物，可这些都不是永恒性的，快乐无常，而快感之后通常是失望落寞。\n　先生，在这里，让我们重新审视一下我们的生活,我们的记忆和未来，探究是否我们能免于这种痛苦的重复？ \n　我桌前的一位漂亮的女孩那样，她的面容让我清晰的感到了快乐、欲望。当我不停地喝我桌面旁这种饮料时,我享受它带给我舌尖味蕾的愉悦,我希求更多。是的,我前面的那个女孩,她的面容给我一种强烈的愉悦的、赏心悦目的感觉,她在那里,不需要做任何事情,就在那里,我觉得这也是一种美。此时,我想去重复这种醉心的感觉,我的大脑命令我去占用这种美丽,让我时时刻刻都能体验到这种快乐。好比在野外,山野里,你发现了一株惊艳的花朵,在阳光下熠熠生辉,明丽的色彩,血一样的鲜红,片刻的愉悦,令你不停的想去重复这种刹那的辉煌。于是匆匆的在记忆里翻寻,但记忆毕竟是陈旧的,是过去的,你永远也无法一丝一毫地去体验那时那种愉悦的经验,但大脑是迟钝的,就算那是蛋糕的一点也足够了品尝甜味了,可究竟是带着失望的,大脑每次追求愉悦,体验快乐,都只是重复过去的记忆、经验,毫无新鲜的东西；你接触所谓新的东西时,触摸你从未见过的东西时,体验从来也没有的新奇体验时,这时脑里记忆便立刻把这些东西拿了过去,把它与过去的记忆、经验、思想相匹配,这些新的东西也立刻变成过去的了。于是我们时时刻刻不在过去之中。时时刻刻的对待外界的反射应答之中我们愈来愈臃肿,这就是我们的成长么?我们一直在重复着追逐快感、得到快乐、随后厌烦,失望,不得不去寻找另一种新的愉悦,不论这种是古鲁、上帝、佛陀、信仰、还是Krishnamurti,还是书中描绘的黄金世界,那么,请问,是否我们能够免于这种重复?从这些东西里解脱?\n\n---\n\n 桌面旁的饮料已经见底,我轻轻抿一小口,味蕾贪婪吮吸着；前面的女孩的同学转过头来,面容姣好,她们窃窃私语,我只是看着,没有任何念头。我脱离了低级趣味了么?老实说,并没有,就好像看一幅画、一件东西。哪些是欲望？\n\n 先生,请回想一下自己的一些欲望:基本的生活需求(吃住睡行),还有其他的,你羡慕同学的衣服比你的新潮、漂亮、昂贵；他的鞋子比你的好看；她的发型比你可爱；她在哪里都比你受欢迎，你嫉妒她所拥有的,于是你也想去拥有她所有的,你想变成她那样,变成她那样优雅,可爱,活泼或者其他的东西,总之,通过比较其他人,比较他所拥有的和你所拥有的,比如金钱、美貌、权力,你想变成其他的.此时,你对自己所拥有的不满,你想改变,你认为改变就像学习一门功课、学习一门语言一样,需要时间去掌握,去改变自己就好像自己捏自己的肖像一样,自己只不过是将自己所想的样子捏出来而已。\n\n  那么,先生,请问你捏出来了么?在你塑造自己的肖像的物理时间内,你感到了痛苦、迷惘、失望和激烈的内心冲突,不是么?最后,物理时间过去,或许是一周、一个月、一年,你所捏的肖像还是你所投射的那个样子么?先生,你改变了吗?但你依然怀着一颗充满着矛盾、挣扎的心,在你脑海里有一片世界,那里将是你将是什么样子的世界：道教的是清净无为的世界、佛教的是瑞光普照的世界、基督教的是上帝与天使的世界、或者商人充满无数黄金、钞票的世界,圣人的无数人聆听教化的世界,强者的强权主导的世界、弱者的天下太平的世界？无论是怎样的世界,怎样的你的样子,你热衷参与这个内心的世界,你投射自己的意象进去。你脱离现实，可现实还是那样子，残暴依然残暴，痛苦依旧痛苦，贫穷依旧贫穷。你自己的意象里一点都没有彻底改变，或许只是旧的记忆的重复，就像寻找昨日的快感，这些无可避免地带来了痛苦，挣扎，迷茫和苦闷。\n\n   在物理的时间内,我们通过钟表确定时间的走向,你学习一门功课,通过一段时间的学习,你掌握了这门功课所讲授的知识.理所当然,我们认为,通过时间,我们会从暴力转变为非暴力、从贫穷转变为富有、从卑鄙转变为高尚、从懒惰转变为勤奋、从幼稚转变为成熟。的确,我们知道有很多这样的例子,比如马云的财富传奇、甘地的伟大非暴力之路、浪子回头似的例子。他们的成功转变是时间的产物,是的,日历一年又一年的翻过去,他们转变了。让我们回忆一下,从小孩子似的什么都不懂,什么都没有到如今的复杂世界,我们的转变是巨大的、无与伦比的，我们大脑里多了很多意象,有关于父母亲的意象、有关于朋友的意象、有大学同学、工作同事、上司、交通工具等诸多意象,每种意象都包含着记忆,这些记忆里是图像、影音、文字、观点、知识、情感喜爱厌恶等,都是我们大脑记录的,这些东西构成了我们的思想、我们的记忆。我们面对面交流,是真的交流么,还是自己与这些大脑里的意象去交流,去补充这些意象的素材？那么，是否我们就是意象,意象就是我们？请不要回答“是”，那我们之间的交流就已经结束了，请自己用心体会。日历一页一页翻过去了,我们大脑里的意象有更新了么?还是原来的一堆旧的,过时的东西组合?\n\n   我们相信有一种顿悟,仿佛一下就领悟了超越你现在所不能理解的东西,仿佛那时你一定得到了解脱,我们还发明了一种理论:只要自己每时每刻在准备做某种事情,那么自己的潜意识能够以一种我们不知道的方式也在同样的事情,那样当这件事情做的足够多时,潜意识会在一个不知道什么时候的时候使你突然做完这件事情。这种信念促使自己崇拜自己创造出来的另一种意象:更加浪漫的意象、一种信念、一种上帝、一种导师、一种万能神。我们始终不去面对真实、面对真实的自己，宁愿去投射自己的意象给其他的东西，无论这个东西是上帝、佛陀还是救世主。为什么我们不面对自己?为什么我们总是以各种意象来掩盖自己的真实面目？这些意象只是“将要转变的东西（**从我是什么**到**我应该是什么**）”,是自己投射自己的欲望、想法到目标的意象的念想,我们正在崇拜自己制造的东西，那是我们的意象，那不是真实的。\n\n那什么才是真实的？周围的媒体告诉我们每天发生的事情：国家的政策，领导人的行程，股市的动荡，房价的行情，医改的进展，教育体制的弊端，某明星的花边新闻等。先生，你感受到了吗？这些报道，不论是严肃的、一本正经的还是娱乐圈里的发生的绯闻、奇人奇事，他们给予你一种真实。你周围的人，同事，同学，他们各自在做各自的事情，各自在为各自的利益-各自的“我”的中心里，我们，他们，之间隔着一层层栅栏--在心里世界上。还有物质，如桌子，椅子，房间。这些都是真实的，不是么？\n\n   我们在各自的**王国**里，投射着各自关于这个世界的意象，有通用的物质意象如水，山川，树木等，这些都是死的意象。还有些我们直接接触或间接知道的意象如父母，同事，外国（美国，俄罗斯）。他们都是记忆的产物，这些共同组合成了思想；记忆是过去的产品，过去的东西没有一种是新鲜的，都是陈旧的，思想也就时时刻刻是旧的，只要记忆参杂在其中，思想也就永远是记忆的旧的产物。我们与世界对话，与其他人交流，通常只不过是与自己大脑里的意象交流，我们时时刻刻不在与旧的思想对话，我们通过比较产生不满，只不过是自己与自己所投射的意象在做对比，我们想要从“我是什么”转变成“我应该是什么”只不过是在崇拜自己制造的意象罢了。\n先生，你去教堂里祷告，去一件幽静的房子里坐禅，去丛林徒步冒险，去攀登一座高峰，去学习一门新的技能，去上课获得新的知识，这些都花费时间，通过这些时间，你收获了一种暂时的宁静，一种刻苦铭心的冒险的成就感，一种谋生的知识或手段，这些都将化做种种意象，作为回忆，而一旦作为记忆，就丧失了新鲜，成了死的东西，而死的东西永远不能带给你新奇，给你愉悦，给你真实的感觉。真实只能在现在，既不在过去，也不在将来。\n"
		},
		{
			"post_id": 13,
			"title": "关于我的博客--致读者",
			"date_published": 1478167318.244,
			"body": "博客内容: **批判性思维** **哲思** **心理**\n\n\nLinux精神中其中有一条是:**不要重复造轮子**( Stop Trying to Reinvent the Whee).同理,我也不用给网络中制造重复已有的信息,我会尽量给链接,如果链接失效,请联系我.\n首先,我得承认,写原创博客不是个简单的事儿,因为各种各样的原因,坚持下来得很少,举几个例子,比如刘未鹏的博客,额,算是年更了,不过他博客的内容的质量确实挺高的.当然,我的博文就不求这样的质量,至少大部分是自己原创的.\n\n"
		},
		{
			"post_id": 12,
			"title": "致大学--关于大学的一点思考",
			"date_published": 1478148852.273,
			"body": "第一,进入中国大学前所要有的思想准备,给高三的童鞋们:\n[ 1:写给高考生父母的一封信—在中国关于高考和大学的五个真实规则](https://www.douban.com/note/78438215/)\n[2:《一位25岁董事长给大学生的18条忠告》之我见](https://www.douban.com/note/87265599/)\n[3:最受90后大学生欢迎的大学新生入学教育PPT](https://news.cnblogs.com/n/74356/)\n[4:大学新生入学必读的88个忠告（全文）](http://edu.163.com/14/0807/14/A326TEIF00294MBA_all.html)\n\n这几篇文章主要介绍了当前我们大学的状况,**严进宽出**,等为了避免出现89事件而实施刻意驯服的高等教育水平.\n第二,如何度过大学四年\"无聊\"(**这里无聊指百无依赖**)的生活\n偶尔看到一篇文章，教我们在大学如何度过无聊的生活，教我们直面惨淡的无聊的生活，没错。我就直接放链接了。\n[如何度过大学生活-1 ](http://blog.sina.com.cn/s/blog_9e19c10b0102vzm8.html)\n[如何度过大学生活-2](http://blog.sina.com.cn/s/blog_9e19c10b0102vzyw.html)\n[如何度过大学生活-3](http://blog.sina.com.cn/s/blog_9e19c10b0102w0lz.html)\n[如何度过大学生活-4](http://blog.sina.com.cn/s/blog_9e19c10b0102w1g4.html)\n[如何度过大学生活-5](http://blog.sina.com.cn/s/blog_9e19c10b0102w2in.html)\n[如何度过大学生活-6](http://blog.sina.com.cn/s/blog_9e19c10b0102w3xo.html)\n\n第三,考研及研究生的生活\n[致大四考研的同学们](http://blog.sina.com.cn/s/blog_9e19c10b01018vi6.html)\n[专硕还是学硕？](http://blog.sina.com.cn/s/blog_9e19c10b01018wcj.html)\n尽管有些老了,但应该大部分工科硕士的情况.\n\n\n\n\n\n\n\n"
		},
		{
			"post_id": 11,
			"title": "The First And The Last Freedom ",
			"date_published": 1478005104.921,
			"body": "#### 1 引言\n关于 Krishnamurti,请猛击这个链接,Introducing Krishnamurti .\n引用里面的一句话话:\n><table><tr><td bgcolor=#F8F8FF>The Rish said, “Atman is a Brahman”, and the people listening to it went straight to heaven.\n    A fool said, “Atman is a Brahman”, and the fools listening to it went straight to hell.\n    The Buddha said, “Samsara is Nirvana”, and the people listening to it went straight to heaven.\n    A fool said, “Samsara is Nirvana”, and the fools listening to it went straight to hell.\n    -From The Lankavatara Story </td></tr></table>\n\n古印度智者说：“我即梵”，听它的人们直接上了天堂。\n一个傻瓜说：“我即梵”，听它的傻瓜们直接下了地狱。\n佛陀说：“烦恼即涅槃”， 听它的人们直接上了天堂。\n一个傻瓜说：“烦恼即涅槃”， 听它的傻瓜们直接下了地狱。\n——摘自《楞伽经故事》\n#### 2 接触\n\n回忆一下自己是怎么接触Krishnamurti的,可能是大一下,也就是2015年左右在图书馆偶然找书时看见一本包装还算独特的书,当然,书名也算独特,《超越孤独》,黄文娟译本,华东师范大学出版社.自己当时就被吸引住了,从此就就上路了.当然,现在自己阅读Krishnamurti的作品基本是以英文本为主,当其中的某些表达超出了自己理解的范围,就看汉译本.当然,偏题一下,Krishnamurti在大陆的译本通常不如台湾版的译本好,而我自己看惯了简体再去看繁体有一种不舒服的感觉,还不如去看原文,这是其一;其二是Krisunamurti的英文里用有限的词,不用哲学,医学等专用术语来表达,显然这下自己应付的就是日常生活用语词汇,当然,对于我这个应试教育的半成品来说并不算很难,而且他的很多词汇是重复的,比如worries, desires and fears等词,还有就是Krishnamurti的原意在被翻译后很难保证原汁原味,就好像我们的古诗词被翻译称英文后完全变了样,这就是一种语言的独特性.再吐槽一下这本书是美国分析哲学家做的一本Krishnamurti的选集,为给他们的同行推荐,所以本书的原来题目是《refections on the self》\n之后由于很多原因,当然最主要的还是自己承受不住痛苦,自己放逐了自己,更多的时候与现实隔了一层毛玻璃里,看现实很模糊.自己迷迷糊糊的过完大学的前两年.现在总算找到了一点光.也算是对自己的一点慰藉吧\n\n---\n\n抄自：The First And Last Freedom \n><table><tr><td bgcolor=#F8F8FF>\nyou are listening when your real attention\nis given to something. But unfortunately most of us listen through a\nscreen of resistance. We are screened with prejudices, whether\nreligious or spiritual, psychological or scientific; or with our daily\nworries, desires and fears. And with these for a screen, we listen.\nTherefore, we listen really to our own noise, to our own sound, not\nto what is being said. It is extremely difficult to put aside our\ntraining, our prejudices, our inclination, our resistance, and,\nreaching beyond the verbal expression, to listen so that we\nunderstand instantaneously。\n\n Understanding comes through being\naware of what is. To know exactly what is, the real, the actual,\nwithout interpreting it, without condemning or justifying it, is,\nsurely, the beginning of wisdom\n\nTo\nacknowledge, to be aware of to get at that which is, puts an end to\nstruggle. If I know that I am a liar, and it is a fact which I\nrecognize, then the struggle is over. To acknowledge, to be aware\nof what one is, is already the beginning of wisdom, the beginning\nof understanding, which releases you from time\n\n\nSo, then, let\nus keep in mind that we want to examine what is, to observe and be\naware of exactly what is the actual, without giving it any slant,\nwithout giving it an interpretation\n\n\nBe aware of it, as I discuss it: follow, not my words, but\nthe thought which is active in you\n\n\n\n I\nam not going to give you information which you can pick up in an\nencyclopaedia. What we are trying to do is to follow each other's\nthoughts, to pursue as far as we can, as profoundly as we can, the\nintimations, the responses of our own feelings. So please find out\nwhat your response is to this cause, to this suffering; not what\nsomebody else's words are, but how you yourself respond\n\n\nSurely, the more trouble there is in the world, the more\nchaos, the more one seeks security. Haven't you noticed it? When\nthere is confusion in the world, psychologically and in every way,\nyou enclose yourself in some kind of security, either that of a bank\naccount or that of an ideology; or else you turn to prayer, you go to\nthe temple - which is really escaping from what is happening in the\nWorld\n\nBecause the more\nconfusion there is, the more you want a leader, somebody who will\nguide you out of this mess, so you turn to the religious books, or to\none of the latest teachers; or else you act and respond according to\na system which appears to solve the problem, a system either of the\nleft or of the right. That is exactly what is happening.\n\n\nThe moment you are aware of confusion, of exactly what is, you\ntry to escape from it.\n\n\nBut the real is near, you do not have to seek it; and a\nman who seeks truth will never find it. Truth is in what is - and that\nis the beauty of it. But the moment you conceive it, the moment\nyou seek it, you begin to struggle; and a man who struggles cannot\nunderstand. That is why we have to be still, observant, passively\naware.We see that our living, our action, is always within the field\nof destruction, within the field of sorrow; like a wave, confusion\nand chaos always overtake us. There is no interval in the confusion\nof existence.\n\n\nIf you, seeing this social and economic confusion, this chaos, this\nmisery, withdraw into what is called the religious life and abandon\nthe world, you may feel that you are joining these great teachers;\nbut the world goes on with its chaos, its misery and destruction, the\neverlasting suffering of its rich and poor\n\nIn other words, can you be instantaneously free? - because\nthat is the only way out of this misery\n\n Perception can take place\nonly in the present; but if you say, \"I will do it tomorrow the wave\nof confusion overtakes you, and you are then always involved in\nConfusion.\n\n\nTherefore true revolution can take place\nonly when you, the individual, become aware in your relationship\nto another. Surely what you are in your relationship to another, to\nyour wife, your child, your boss, your neighbour, is society.\nSociety by itself is non-existent. Society is what you and I, in our\nrelationship, have created; it is the outward projection of all our\nown inward psychological states\n. So if you and I do not understand\nourselves, merely transforming the outer, which is the projection of\nthe inner, has no significance whatsoever; that is there can be no\nsignificant alteration or modification in society so long as I do not\nunderstand myself in relationship to you\n\n\nWhen we look to a system for the\ntransformation of society, we are merely evading the question,\nbecause a system cannot transform man; man always transforms\nthe system, which history shows\n\n\nhere is a search for something permanent,\nis there not?,in most of us - something we can cling to, something\nwhich will give us assurance, a hope, a lasting enthusiasm, a\nlasting certainty, because in ourselves we are so uncertain\n\n If we strip ourselves of all the words and\nphrases, and actually look at it, this is what we want. We want\npermanent pleasure, permanent gratification - which we call truth,\nGod or what you will.\n\nso long as I do not understand myself, I have no\nbasis for thought, and all my search will be in vain. I can escape\ninto illusions, I can run away from contention, strife, struggle; I can\nworship another; I can look for my salvation through somebody\nelse. But so long as I am ignorant of myself, so long as I am\nunaware of the total process of myself I have no basis for thought,\nfor affection, for action.\n\nThe pursuit, all the world over, of gurus and their systems, reading\nthe latest book on this and that, and so on, seems to me so utterly\nempty, so utterly futile, for you may wander all over the earth but\nyou have to come back to yourself\n\n To follow oneself to see how one's\nthought operates, one has to be extraordinarily alert, so that as one\nbegins to be more and more alert to the intricacies of one's own\nthinking and responses and feelings, one begins to have a greater\nawareness, not only of oneself but of another with whom one is in\nrelationship. To know oneself is to study oneself in action, which is\nrelationship. The difficulty is that we are so impatient; we want to\nget on, we want to reach an end, and so we have neither the time\nnor the occasion to give ourselves the opportunity to study, to\nobserve. Alternatively we have committed ourselves to various\nactivities - to earning a livelihood, to rearing children - or have\ntaken on certain responsibilities of various organizations; we have\nso committed ourselves in different ways that we have hardly any\ntime for self-reflection, to observe, to study.\n\nThe more you know yourself the more clarity there is. Self-\nknowledge has no end - you don't come to an achievement, you\ndon't come to a conclusion. It is an endless river. As one studies it,\nas one goes into it more and more, one finds peace. \n\n\n\nWhat is the relationship between yourself and the misery, the\nconfusion, in and around you? Surely this confusion, this misery,\ndid not come into being by itself. You and I have created it, not a\ncapitalist nor a communist nor a fascist society, but you and I have\ncreated it in our relationship with each other. What you are within\nhas been projected without, on to the world; what you are, what\nyou think and what you feel, what you do in your everyday\nexistence, is projected outwardly, and that constitutes the world.\n\nWe want to bring about alteration\nthrough a system or through a revolution in ideas or values based\non a system, forgetting that it is you and I who create society, who\nbring about confusion or order by the way in which we live\n\nNow, if you examine our occupation, it is fundamentally\nbased on envy, it is not just a means of earning a livelihood.\nSociety is so constructed that it is a process of constant conflict,\nconstant becoming; it is based on greed, on envy, envy of your\nsuperior; the clerk wanting to become the manager, which shows\nthat he is not just concerned with earning a livelihood, a means of\nsubsistence, but with acquiring position and prestige. This attitude\nnaturally creates havoc in society, in relationship, but if you and I\nwere only concerned with livelihood we should find out the right\nmeans of earning it, a means not based on envy. Envy is one of the\nmost destructive factors in relationship because envy indicates the\ndesire for power, for position, and it ultimately leads to politics;\nboth are closely related. The clerk, when he seeks to become a\nmanager, becomes a factor in the creation of power-politics which\nproduce war; so he is directly responsible for war</td></tr></table>"
		},
		{
			"post_id": 10,
			"title": "初学Linux",
			"date_published": 1476721538.083,
			"body": "第二章 linux 的基本操作\n\n2 通过历史记录简化操作\n☆!! 重复前一个命令\n☆!     重复前一个以\"字符\"开头的命令\n☆history\n\n3 通配符 bash shell 支持以下通配符\n*匹配零个或多个\n?  匹配任意一个字符\n[abc] 匹配列表里任何字符\n[^abc]匹配列表以外字符\n\n4 切换用户\n在CU中,通过su 命令切换用户\n         su -  切换到root用户并使用一个新的运行环境\n         sudo 以用管理员身份运行命令\n显示当前用户信息.\nid\n修改当前用户密码\npasswd\n\n---\n\n5 BASH 作业管理\n☆ 在后台运行进程\n       在命令后添加一个 &\n☆ 暂停某个程序\n         通过Ctrl +z\n☆ 管理后台作业\njobs\nbg\nfg\n\n6 列出目录内容 \"ls \" 命令列出目录内容\n☆ ls -a 显示所有文件(包括隐藏文件)\n☆ ls -l 显示详细信息\n☆ ls -R 第归显示子目录结构\n☆ls -ld 显示目录和链接信息\n\n7 绝对路径和相对路径\n绝对路径是指以\"/\"开头,依次第归到目标路径,不受工作目录限制\n相对路径是指:以当前目录为起点,到达目标路径,受当前所在目录限制\n☆ cd命令可以用来切换目录\n☆ 上一级目录 \"..\"\n☆ 当前目录 \".\"\n☆用户家目录\"~\"\n☆上一个工作目录\"-\"\n\n8 复制文件和目录\n使用cp命令复制文件或目录\n    cp 源文件(文件夹)  目标文件(文件夹)\n常用参数:\n-r 第归复制整个目录\n-v 显示详细信息\n\n9 移动,重命名文件或目录\n通过mv命令移动或重命令文件\n  mv  文件  目录\n移动文件夹需要在目录后加\"/\"\n重命名 即mv 目标文件 新文件名\n\n10    创建和删除文件\n☆ 通过touch命令可以创建一个空文件或更新文件时间\n☆通过rm命令可以删除文件或目录\n常用参数:   -i 交互式\n                -r 第归的删除包括目录中的所有内容\n                -f 强制删除,没有警告提示\n\n11 创建和删除目录\n☆ 通过mkdir 命令创建一个目录\n☆通过mdir命令删除一个空目录\n☆通过 rm -r (-f) 命令删除一个非空目录\n\n12 linux 文件树状文件系统结构\n\nboot 引导目录 内核文件.★\ndev 硬件目录.  linux中所有硬件被抽象为文件\netc 配置文件\nhome\nlib 库文件\nmedia 挂载 类同 mnt\nopt 装一些大型文件(约定俗成)\nproc 虚拟文件夹 显示实时信息\nsbin 超级用户执行的命令\nbin 普通用户执行的命令\nsys 底层硬件信息\ntmp 临时文件.个一段时间会自动删除\nusr 一般软件装在这里\nvar 保存通常变动的信息 比如:日志\n\n13 linux的常用命令\n☆ 日期时间\n•命令date用以查看和设置当前系统时间\n•命令hwclock(clock)用以显示硬件时钟时间\n•命令cal用以查看日历\n☆输出和查看命令\n•命令echo用以显示输入的内容\n•命令cat用以显示txt文件的内容\n•命令head用以显示文件头几行(默认10行)     -n 指定显示的行数\n•命令tail用以显示文件末尾几行(默认10行)  -n指定显示的行数 -f 追踪显示文件更新(一般用以查看日至,命令不会退出,Ctrl+c 退出)\n•命令 more用于翻页显示文件内容(只能向下翻页)\n•命令less用以翻页显示文件内容(带上下翻页)\n☆关机和重启\n•命令shutdown用以关闭和重启计算机\n        shutdown [关机或重启] 时间 -h关机  -r 重启\n如:\n立即关机:            shutdown -h now\n10分钟后关机:      shutdown -h +10\n23:30分关机:       shutdown -h 23:30\n立即重启:             shutdown -r now\n•命令poweroff用以立即关闭计算机\n•命令reboot用以立即重启计算机\n☆归档和压缩\n•命令zip用以压缩文件\n  zip charles.zip  myfile\n•命令unzip用以解压zip文件\n   unzip charles.zip\n•命令gzip用以压缩文件\n   gzip  charles.zip\n•命令tar用以归档文件\n tar -cvf out.tar(要命名的文件名)  charles(文件)\n tar -xvf  out.tar\n tar -cvzf back.tar.gz /etc (-z参数将归档后的文件进行gzip压缩以减小大小)\n\n☆ find 查找条件\n命令locate用以查找数据库中的文档\n  locate\nfind 支持很多种查找条件\n-name  -perm -type -size\n如: find . -name *aa  #在当前目录下查找\n     find / -name *aaa #在根目录下查找\n     find / -perm 777 #权限为777的文件\n\n14 v i文本编辑器\nvi,vim 是命令行界面下的文本编辑器工具,早在1976年由bill joy 开发当时名字叫做ex.vi支持大多数操作系统.91年由Bram Moolenaar 基于vi进行改进,发布了vim,加入了对GUI的支持.linux中著名的文本编辑器还有emacs,它的功能比vim还强大.绝大多数linux系统上均安装有vim,vim比vm的功能更为强大,且两者使用方法相同\n•命令vim可以启动vim编辑器\n•一般我们通过 vim + 目标文件路径 的形式使用vim\n•如果目标文件存在,则打开文件\n•如果目标文件不存在,则vim新建并打开该文件.\n\n☆VIM模式\nvim拥有三种模式\n命令模式(常规模式)\n vim启动后,就默认进入命令模式,任何模式都可通过ese建进入命令模式.在命令模式下,通过键入不同命令完成选择,复制,粘贴\ni 在光标前插入文本\no 在当前行的下面插入新行\ndd 删除整行\nyy 将当前行的内容放入缓冲区(复制当前行)\nn + yy 将n行的内容放入缓冲区(复制n行)\np 将缓冲区的文本放入光标后\nu 撤销上一个操作\nr 替换当前字符\n/ 查找关键字\n\n插入模式\n在命令模式中按\"i\"健,即可进入该模式.在插入模式中可编辑文本内容,按\"ese\"可返回命令模式\n\nex模式\n在命令中按\":\"键即可进入ex模式,光标会移动到底部,在这里可以保存修改\n:w 保存当前修改\n:q 推出\n:q! 强制退出,不保存\n:x  保存并退出,相当于:wq\n:set number 显示行号\n:! 系统命令\n:sh 切换到命令行,使用ctrl + d切换回vim\n\n15 分区的概念\n将一个磁盘逻辑的分为几个区,每个区当作独立磁盘,以方便管理\n•不同分区用:设备名称 +分区号 表示,如sda1,sda2\n主流的分区机制分为MBR和GPT两种\n磁盘的基本概念:磁头,扇区,磁柱.\nMBR(Master Boot Record)是传统的分区机制,应用于绝大多数使用BIOS的PC设备.\n•mbr只支持32bit和64bit系统\n•mbr支持分区数量有限\n•mbr只支持不超过2T的硬盘,超过2T的硬盘将只能使用2T空间(有第三方解决方法)\n\nMBR分区\n•主分区 最多只能创建4个分区\n•拓展分区  一个拓展分区会占用一个主分区位置\n•逻辑分区  linux 最多支持63个IDE分区和15个SCSI分区.\n\nGPT(GUID Partition Table)是一个交心的分区机制,解决了MBR的很多缺点.\n•支持超过2T的磁盘\n•向后兼容MBR\n•必须在支持UEFI的硬件上才能使用\n•必须使用64bit系统\n•Mac和linux系统都能支持GPT分区格式\n•Windows7 64bit,windowServer2008 64bit之GPT\n\n16 使用fdisk对磁盘进行管理\n•fdisk命令只有具有超级用户权限才能使用.\n•以用fdisk -l 可以列出所有安装的磁盘及其分区的信息\n•使用fdisk/dev/sda可以对目标磁盘进行分区操作\n•分区后之后需要用partprobe命令让内核更新分区信息,否则需要重启才能识别新的分区\n•/proc/partitions文件也可用来看分区信息\n\n17 文件系统\n操作系统通过文件系统管理文件及数据,磁盘或分区需要创建文件系统之后才能够为操作系统使用,创建文件系统的过程又称之为格式化\n•没有文件系统的设备又称为裸(raw)设备\n•常见的文件系统有fat32,NTFS,ext2,ext3,ext4,xfs,HF5\n•文件系统之间的区别:日志,支持分区大小,支持的单个文件大小和性能.(ext2没有日志),windows下主流文件系统是:NTFS,Linux下的主流文件系统是:ext3,ext4\n•Linux支持的文件系统:ext2,ext3,ext4,fat,vfat,nfs,iso9660,proc,gfs,jfs.\n\n命令mke2fs用来创建文件系统\n       mke2fs -t ext4  /dev/sdb1\n常用参数:  -b blocksize 指定文件系统块大小\n               -c                   建立文件系统时检查坏损块\n               -L label          指定标卷\n               -j                     建立晚间系统日志\n\n命令mkfs也可以用于创建文件系统,相较于mke2fs简单,但是支持参数较少,不能进行精细化控制\n•mkfs ext4 /dev/sdb1\n\n日志\n代日志的文件系统(ext3,ext4)拥有较强的稳定性,在出现错误时,可以进行恢复.\n使用日志的文件系统,文件系统会使用一个叫做\"两阶段提交\"的方式进行磁盘操作,当进行磁盘操作时,文件系统进行以下操作:\n(1) 文件系统将准备执行的事物的具体内容写入日志\n(2)文件系统进行操作\n(3)操作成功后,将十五的具体内容从日志中删除\n这样做的好处是,当事物执行的时候如果出现意外(如断电等),可以通过查询日志进行恢复操作,缺点是会丧失一定的性能(额外的日志读写操作)\n\n命令fsck用来检查并修复损坏的文件系统\n  fsck   /dev/sdb1\n•使用-y参数不提示而直接进行修复\n•默认fsck会自动判断文件类型,如果文件系统损坏较为严重,请使用-t参数指定文件系统类型\n•对于识别为文件的损坏数据(文件系统无记录),fsck会将该文件放入lost+found目录\n•系统启动时会对磁盘进行fsck操作\n\n挂载操作\n磁盘或分区创建好文件系统后,需要挂在到一个目录才能够使用.\nwindows或Mac系统会进行自动挂在,一旦创建好文件系统后会自动挂载到系统上,linux需要手工进行挂在操作或配置系统进行自动挂在\n\nmount\n在linux中,通过mount命令将格式好的磁盘或分区挂在到一个目录上.\n mount   /dev/sdb1(要挂在的分区)   /mnt(挂在点)\n•重新挂载  monut -o remount,ro /dev/sdb1 /mnt #以只读的形式重新挂载在mnt下\n常用参数:\n•不带参数的mount命令显示所有已经挂载的文件系统\n-t  指定文件系统的类型\n-o  指定挂载选项\nro,rw               以只读或读写形式挂载,默认是rw\nsync代表不是用缓存,而是对所有操作直接写入磁盘\nasync代表使用缓存,默认是async\nnoatime代表每次访问文件时不更新文件的访问时间\natime代表每次访问时更新文件的方万时间\nremount 重新挂载文件xits\n\numount\n•命令umount用来卸载一挂载的文件系统,\numount 文件系统/挂载点\numount /dev/sdb1   == umount /mnt\n如果出现device is busy 报错,则表示该文件系统正在被使用,无法卸载,可以使用以下命令查看•使用文件系统的进程:\nfuser -m /mnt\n也可以使用命令lsof查看正在被使用的文件\nlsof /mnt\n\n自动挂载\n•配置文件/etc/fstab 用来定义需要自动挂载的文件系统:fstab中每一行代表一个挂在配置,格式如下:\n\n/dev/sdb1\n\n/mnt\n\next4\n\ndefaults\n\n0 0\n\n需要挂载的设备\n\n挂载点\n\n文件系统\n\n挂载选项\n\ndump,fsck相关选项\n\n例如:\n\n•要挂载的设备可以使用LABEL进行识别,使用LABEL=LINUX(卷标名)取代/dev/sdb1\n•mount -a 命令会挂载所有fstab中定义的自动挂载项.\n•对磁盘操作都要先进行卸载,否则只能进行读写.不能修改文件系统\n•命令e2label 标卷/分区 标卷名/分区名,或者用e2label 标卷 查看标卷名\n\n18 linux下获取帮助\nELP\n几乎所有命令都可以使用-h或--help参数获取使用方法,参数信息等\n\nMAN\n•man命令是linux中最为常用的帮助命令,将要获取帮助的命令作为参数运行man命令就可以获取相应的文档帮助.\n•man文档分为很多类型\n•man -k 关键字可以用来查询包含该关键子的文档\n\nINFO\n•info与man类似,但是提供的信息更为详细深入,以类似网页的形似显示.\n•man与info都可以通过\"/+关键字\"方式搜索\n\nDOC\n很所程序,命令都带有详细的文档,以txt,html,pdf等方式保存在/usr/share/doc目录中,这些文档是相应程序最为详尽的文档.\n\n19 linux网络基础\n\n• 网络编址(每个计算机的唯一去定位一台设备)\n有很多编址.\n\nIP编址技术\n• 是一个双层编址方案,一个IP地址标识一个主机(或一个网络部分网卡接口)\n• 现在应用最为广泛的IPV4编址,已经开始逐渐向IPV6编址切换\n• IPv4地址为32位长,ipv地址为128位长\n• 一个IPv4地址分为两个部分:网络部分和主机部分. 网络部分用来标识所属区域,主机部分用来标识该区域中的哪个主机 .\n网络部分标识哪个片区?主机部分标识这片地区中的谁?\n• 通过比较网络部分是否相同来判断是否处于同一个网络,同一个网段\n\nIP地址\n• IPv4地址共32位,通常使用点分十进制方式表示.\n• 整个IP地址分为4个部分,每个部分8位.\n\n子网掩码\n• 我们通过子网掩码来确定网络部分的位数.子网掩码与ip地址一样,拥有32bit,每一位与ip地址中的每一位一一对应\n• ip地址中相对应子网掩码为1的部分为网络部分,其余为主机部分\n\n子网掩码                       255.         255.        255.            0         (十进制)\n                                  11111111     11111111     11111111       00000000  (二进制)\n\n• 同一个网络主机之间的通信\n用到一个MAC地址. 网卡上的固化地址 ,通过ARP把MAC地址获取,\n\n• 不同网络之间的通信\n路由 即网关\n在不同网络之间传输数据的功能叫做路由功能,一般有多个接口,连接到不同的网络中,并且通过路由表进行数据转发.\n\n域名\nIP地址往往难记,所以我们一般使用域名进行管理\n域名分为三个部分,用\".\"分隔\n• 类型 标识此域名的类型(com.net)\n• 域名部分\n• 主机部分 该域名中的某台主机名称.可以随便起.大家约定俗称为www网页\n\nDNS\n• 每个域名代表一个IP,而DNS服务就是用来在IP与域名之间进行转换的.\n• DNS服务由DNS服务器提供.\n• 解析域名,将域名转换为ip地址.\n\n基本网络参数\n要配置一个局域网通信的计算机\n• IP地址\n• 子网掩码\n\n要配置一个跨网段通信的计算机\n• IP地址\n• 子网掩码\n• 网关\n\n要配置一个可上网的计算机\n• IP地址\n• 子网掩码\n• 网关\n• DNS\n\n20 以太网连接 (有线连接)\n• 在linux中,以太网接口被命令为:eth0,eth1等,0,1代表网卡编号\n\n• 通过lspci命令可以查看网卡硬件信息(如果是usb网卡,则可能需要lsusb)\n\n命令ifconfig用来查看接口信息\n  ifconfig -a 查看所有接口\n  ifconfig etho 查看特定接口\n\n命令ifup, ifdown 用来启用,禁用一个接口\n  ifup etho\n  ifdown etho\n\n配置网络信息\n• 使用setup命令可以配置\n\n网络相关配置文件\n• 网卡配置文件\n/etc/sysconfig/network-scripts/ifcfg/ifcfg-etho\n\n• DNS配置文件\n/etc/resolv.conf/\n\n• 主机名配置文件\n/etc/sysconfig/network\n\n• 静态主机名配置\n/etc/hosts\n\n网络测试命令\n• 测试网络连通性:\n ping 192.168.1.1\n ping www.sohu.com\n\n• 测试DNS解析\n  host www.baidu.com\n  dig www.baidu.com\n\n• 显示路由表\n ip route\n\n• 追踪到达目标的网络路径\n traceroute www.baidu.com\n\n• 使用mtr进行网络质量测试\n mtr www.baidu.com\n\n• 修改主机名: hostname(查看)\n hostname train.linuxcastnet\n\n• 永久性修改主机名;\n /etc/sysconfig/network\nHOSTNAME=train.linuxcast.net\n\n故障排查:\n网络故障排查遵循从底层到高层,从自身到外部的流程进行\n\n• 先查看网络配置信息是否正确\nip地址 子网掩码 网关 DNS\n\n• 查看到达网关是否连通\nping 网关地址 196.168.1.1\n\n• 查看DNS解析是否正常\n host www.baidu.com\n\n21 linux 启动详解\n系统启动流程\nBIOS\nMBR:Boot COde\n执行引导程序-GRUB\n加载内核\n执行init\nrunlevel\n1 BIOS(Basic Input Output System)我们称之为基本输入输出系统.一般保存在主板上的BIOS芯片中.\n计算机启动的时候第一个运行的就是BIOS,BIOS负责检查硬件并且查找启动设备.\n• 可启动设备在BIOS设置定义中进行定义 如USB,COROM,HD\n\n2 MBR\n• 第一个扇区512字节最后2位55AA,交给引导代码.\n• 引导代码为MBR的前446字节.\n• 不同系统有不同代码.加载一个复杂的引导程序,作为跳转\n\n3 GRUB\n• Grub是现在linux使用的主流引导程序\n• 可以用来引导现在几乎所有的操作系统\n• Grub的相关文件保存在/boot/grub目录中\n• Grub配置文件为/boot/grub/grbu.conf\n\n\n"
		},
		{
			"post_id": 9,
			"title": "初学C语言",
			"date_published": 1476721394.135,
			"body": " 1 基本框架:\n'#include <stdio.h>\nint main()\n{\n\n  return 0;\n}'\n\n输出语句格式 printf(\"\")\n输入语句格式 scanf(\"%d \\n \",&price)\n\n2 变量\n2.1 变量的名字是一种标识符,区别不同的变量.变量名不能以数字开头.\n定义一个变量,如果没有初始化,那么这个变量的值为计算机在此内存的值.变量赋值需要分别各自赋值\nint price = 0 int是类型,\n赋值 计算机中\"=\"为一个动作.\n初始化 所有的变量的在使用之前应该被赋值 int prcie = 0 ,amount=2;给多个变量赋值应一个一个赋值.\n\n2.2 常量,不变的数.一旦赋值,后面变不能被赋值修改 , 整数除以整数只能是整数.\n定义一个常量:const int AMOUNT = 100. const通常为大写\n\n2.3 浮点数"
		},
		{
			"post_id": 7,
			"title": "语言实验--通过2000小时达到英语母语者日常交际水平",
			"date_published": 1476450552.846,
			"body": "根据漏屋<找对学习英语方法的第一本书>学习英语分为四个阶段\n初级期,提高期,增长期,高级期.目测自己目前处于初级期.\n初级期类似于刚出生的婴儿,一直到一岁半左右婴儿才开始说话,也就是有相当长的时间我们是处于沉默期内的.在沉默期内开口说英语反而会使自己石化,固化自己的水平.\n根据贾晨飞的经验,大约这个时期会在200-500个小时左右.也就是自己每天听美剧2个小时,至少100天才能开口训练发音.期间必须坚持不断.所以我写这个博客便是陆续续的把自己本地记录的学习记录同步到这里.\n\n贾晨飞的学习经验:\n针对绝望主妇的办法:我当时听绝望主妇的方法是：\n第一遍：带字幕看一遍。（中英双字幕）\n第二遍：把字幕遮住，遇到听不懂的词或者句子，就看一下字幕，前期很困难，一些很\n简单的句型搭配都听不懂，比如： what is he doing ， What was that？ Come again？\n看了字幕后马上就懂了，然后就是大量的生词了，遇到生词，首先根据剧情就能了解个大概，\n然后猜测意思，英文字幕，再看中文翻译。一下就理解到了。\n第三遍：遮住字幕看一遍，因为刚才有查过，所以第三遍听起来理解度要好很多。遇到\n听不懂的怎么办呢？再查一遍\n第四遍：把视频格式转成音频，听一遍，基本上都能听懂 80-90%（前期是这样，不必\n追求 100%的理解）。\n第五遍：再听一遍\n第六遍：隔个十天半个月，再听一次\n所以我不打算把过多的时间花在 DH 第一季上面，我只拉通听一遍，然后继续收获新的知识点，前面掌握\n的常用词，会不断出现在新的材料里，不常用的词，忘了也无所谓，以后再说。\n\n---\n\nQ:贾老师,在用美剧录制成mp3听之前粗略的看了一遍译文,听mp3中仍听不清不懂的单词,这些单词应该是全部弄懂吗?还有些普通词汇的连读音,应该把这些全部掌握还是等下一次听见?\nA:词汇过滤......某些单词可以不去弄懂,一些要弄懂\n\n打卡2016-10-7-10-14\n一周了,从7号晚上接触关于贾晨飞相关的资料时,我学习英语口语的心又死灰复燃了.之前坑爹的集训营和自己从网上找资料自己越练越没劲的痛苦经历......总之满血复活.因为前面有路了,即使是在山上,自己却在山脚,前路依稀朦胧,但前路有明灯.\n5天时间,绝望主妇第一集80%ok,期间走遍美国1-8集90%,Bojake Horseman第一集 40%\n\n打卡2016-11-02\n从接触贾晨飞的英语学习方法，算是给我黑暗的天空漏了一缕星光。当然，从10月7号到14号7天是自己坚持过的。之后便一直纠结中，百无聊奈--百无依赖，期中考试算是一种依赖吧。当然，这也过程中也算是坚定了自己以后要走的道路。别了，我永远也回不去了。真的。\n总结一下，因为自己内心是一直处于一种百无聊赖--百无依赖的状态，所以也好像只有英语学习延续下来了，别说废话了。\n\n绝望主妇进度2集，基本能够听懂自己能够听懂的单词80%，听不懂的包括自己不曾见过的单词\nBojack.horseman.1集，基本同上\n走遍美国，10集。太简单了，可是还是有些不懂的单词听不清。\n\n基本上在自己理解范围内的语句都可以不经中文翻译理解。就好比A说apple，我立刻理解apple，并不是“苹果\"这个中文意思，好比立马在大脑里想到的是apple这个图片。\n\n要加快进度了。\n至于排版的问题，以后解决吧。markdown语法问题。\n\n\n\n先以word文档记录在本地,再分析上传在.\n先持续更新3个月..............\n\n\n"
		},
		{
			"post_id": 6,
			"title": "自律",
			"date_published": 1474214605.125,
			"body": "大学里想要有所作为，至少前期必须把自己逼出寝室。\n为什么阅读娱乐资讯和休闲类的书籍不能使自己变的更加丰富,或许娱乐类的信息的东西强化大脑,使大脑得到及时的反馈,就好像我们人类无法专注学习2个小时却可以嗑上2个小时的瓜子,因为瓜子这一食物及时地给我们的大脑制造愉快的反馈.然而学习就不然了.学习的反馈周期有的长达1~2年.比如用二语习得学习英语口语使之达到母语水平者正常交流的水平至少需要2000个小时的输入量.\n怎样去欺骗大脑的感官系统从而利于达到我们的目标?\n\n\n............未完等待更新"
		},
		{
			"post_id": 5,
			"title": "性和欲望－性行为的本身不是问题，但是对性行为的想法产生了问题",
			"date_published": 1473825669.105,
			"body": "### 读懂自己\n下面4篇文章关于欲望和性的观点给我的启发挺大的.尤其是宋博士关于快乐的看法:\n>我们每个人都在追求快乐，希望避免痛苦。实际上，快乐无须去追求，可能我们越是追求快乐，我们就离真实的快乐越遥远。换一句话说，我们可能得到了短暂的快乐，但是却远离了长久的快乐。对于我们这一生，我们真正应该关注的是痛苦而非快乐。痛苦的确是人生中更加实在的因素，我们要时刻注视自己的内心，体会我们为何而痛苦，当我们观察得越多，越了解自己时，那种虚幻的欲望会渐渐远离我们，我们会一次又一次地远离痛苦。而远离痛苦的时候，就是接近快乐的时候。总之一句话，对于现在的我们而言，彻底认识自己是最为重要的事情。\n\n### 你越追逐快乐,你就越远离快乐之源\n我不知道我们为什么要追逐快乐,的确,让我检视一下,当我遭受痛苦时,当我在现实中遇到不能接受的事情时,当我遇到挫折时,我的确无意识地去疯狂追逐快乐,让自己抽离现实的苦难,的确,很有成效,我为自己找到了投射来满足自己虚幻的成就感的小说,能够忘却世界一秒的性,以及口腹之欲.但他们都很快逝去了,快乐的时光总是非常短暂的,以至于痛苦中纠结的时间占了大多说,在纠结中逃避,脱离这个世界,可这个世界的痛苦,忧伤,苦难一点都没有变化,有的只是自己一次有一次的短暂清醒,然后有被裹挟近入迷茫的世界.\n\n>我们还有很多期盼吗？坦率的说，我自己并没有。那么我们羡慕这些年轻的大学生吗？羡慕他们的蓬勃朝气和青春活力吗？坦率地说，我也不羡慕。青春固然是充满期望的，但同时也是迷茫的，没有方向的。对于我们这个年纪而言，已经基本上知道哪些东西是毫无意义的事情，不会在这些方面去浪费精力，而只会把时间花在需要的地方。\n\n也许青春的迷茫显得特别独特,短暂的清醒并不能带来彻底的改变,你自己清楚你自己吗?你了解你自己吗?你逃避痛苦追求快乐,你无时不刻不在追逐欢愉,逃避痛苦,为了远离痛苦,你宁愿自己什么也不做.\n\n### 检索\n作者  Krishnamurti --The First and Last Freedom 来源:   [Question and Answers THE FIRST AND LAST FREEDOM QUESTIONS AND ANSWERS QUESTION 21** 'ON SEX'**](http://www.jiddu-krishnamurti.net/en/the-first-and-last-freedom/1953-00-00-jiddu-krishnamurti-the-first-and-last-freedom-on-sex)\n作者：High-Spirits　来源：　[AV带给我的郁闷](https://classcalliberal.blogspot.com/2016/06/AV-Review.html) 需要翻墙.\n作者：逻辑引擎　　　来源：[内省使自己清醒](http://zhblog.engic.org/20090517-173300/)\n作者:宋博士  来源:  [致读者](http://blog.sina.com.cn/s/blog_9e19c10b0102wop6.html)\n\n---\n\n**引文内容:**　　AV带给我的郁闷\n性欲这种激情，就犹如一项定期的作业，当然制定这样作业的是咱们的身体咯。\n     每个人面对这项作业所做的选择都不同，抛掉古代因为种种原因所产生的各种禁欲主义和对性行为的各种干预。剩下来的就两条答案：和别人做爱 或者 自慰解决。\n     本章不讲做爱这一涉及到两个人之间关系的问题，仅仅表达音业我自己自慰时的一些感想。\n\n★我为啥硬着头皮去观看AV？\n　　最早知道 AV ，当然也是从各种网络社区的各种唠嗑聊天当中了解的， AV 的存在对于当时的我来说也不是无法想象和理解。当时我之所以会想看 AV ，是因为「想要看看将可爱的形象抱到床上去之后究竟还将发生什么」这样一个暧昧的动机。\n      在我用某客户端从 P2P 分享平台上下载了几部由几位日本知名女优出演的 AV ，并把它们观看了遍后却产生了一种不太舒服的感觉和情绪。我这并【不是】小学生不小心看见性交画面时“哎呀，好恶心的画面！”那种纯粹是出于生理上的难以接受；而是因为 AV 当中冗长的活塞运动画面以及干瘪的剧情，它们令我感到身心疲乏，情趣丢失。\n      如果非要说那段时间收获了啥的话，也仅只是籍此掌握了使用一门 P2P 传输客户端来下载东西，为我今后获得第一只翻墙软件打下了基础 : )\n      我并没有在那以后就立刻删除掉 AV ，而是将它们保留在碟子上，大概都有6、7年了吧。但回想起来我看 AV 的次数很少，用AV来为自慰助兴的次数就更少了，少到用指头都能数出来。\n      之所以还保存了一段时间，那是因为 AV 与二次元方面的エッチ作品虽然都是虚构作品，但当时我总觉得 AV 毕竟是由人去参演拍摄的。为了让自己别患上所谓的「二次元禁断综合征」导致未来对现实中的老婆提不起劲，AV至少还是得看一些的。\n      前段时间我又翻出了几部 AV 来看，虽然松岛枫老师演的很尽力，这尽力的表演正让我感到一丝惆怅。\n\n★AV中表现交配时的侧重点\n　AV和エロ本、动画等色情作品一样是欲通过夸张的视觉效果来达到刺激性欲目的。根据一些心理学相关的社会调查，男性在性幻想时注重于视觉形象而非情绪体验，关注于光滑的皮肤和活动的部位；相比之下女性在性幻想时则更注重所幻想的对象其个性和情绪特征[1]。\n      心理学家Bruce Ellis 和 Donald Simon 总结其观察到：“男性性幻想最大的特点就是其中的性只是充满肉欲的，可充足满足身体的需要，没有其他阻碍物，情绪装饰和复杂的情节，也无需卖弄风情，甚至连求爱过程和性前戏都省略了……”[2]\n\n◇剧情\n　AV 的人设有许多，总的来说都属于以特定关系搭配好的角色扮演，譬如教师和学生、患者和护士、父女、母子、水电工和少妇雇主、甚至还有类似于《假面骑士》的那种特摄剧……等等。\n      那些以交配内容为主的作品则完全配合着这种性幻想的习惯：虽然有着各种各样的人物设定，但整部作品的剧情之放在描写性交的场面上，基本没有感情变化甚至前因后果来龙去脉，所以剧情方面实际上只有三种类型：男方主动支配、双方自愿性交、女方主动支配。\n\n◇叫床\n　剧情对于观看AV时的人们不过是个调味品。不论何种人设题材的 AV 其性交正戏的部分，性对象们总是莫名其妙地高调呻吟着，这种很高调地呻吟被许多男人理所当然地感觉是女人很享受很爽的表现，且能够加强雄性对性行为的专注度。\n\n◇镜头的选取以展现性对象其身材\n　一副撩人的身材对于男性的刺激是强烈的，虽然个体对于身材的偏好将因为所处的文化因素以及其他个体差异的存在而有所不同，但一份调查报告发现世界各地不同文化的男性们对于性对象其身材的腰臀比率(WHR)普遍偏好于比值较小的[3]。各位男性朋友们虽然对于乳房的大小确实存在不少的争论，当然也有部分在这个问题上属与小的、大的都喜欢的那种。\n      总之对于乳房部位仍存在偏好方面的分歧，但对于腰臀这篇区域的偏好则是一致的。AV 的镜头其着重点就在于以插入方生殖器为中心的那片区域上,配合发生性交的姿势以及部位，以将性对象的身材展现在镜头前。\n   \n◇性对象的表情与台词\n　　性对象的表情根据剧情的方向可分为两个趋势，在凌辱泄欲系列等男性支配性交的画面当中，性对象一般会表现出被折腾得可怜像，只有一分啜泣，却见不到有愤怒的表情；在以性对象比较主动的场景当中，性对象便大加卖弄风情。\n     台词方面也是按照人设来走的一个套路比较固定的路线。尤其是在性交时及其前后，男方经常是犹如恶鬼见到美食般地玩着其性对象，象是在说自家芭比娃娃那样垂涎赞叹着性对象的身材。性对象则是各种やめて、耻ずかしい 这样标准矜持式的台词……横竖最后都将结合之前所提到的那夸张地叫床来展现性对象对被抽插的无力抵抗（即所谓的嘴巴说不要，身体却很老实这一强奸迷思 Rape Myth）。\n\n★AV —— 那尝试捕捉男性性幻想其趋势的作品\n　　男性进行的性幻想常常涉及到人际关系与他并不亲密的角色，有时还会在一个性幻想情景里更换性伴侣，这些性幻想对象总是十分地容易发生性接触，且无需承诺。 AV 和H动画正是以将男性的这些性幻想展现出来为目的的作品，因而将人物情绪特征和剧情推动做得非常仓促或者干脆就没有。\n      可是我比较喜欢人物个性以及故事的来龙去脉所带来的那种身临其境的感觉， AV 虽然有各种人物设定，但并没有将其都舒展开来，只能体会到那些设定在性交场景时的意义。\n\n[1]大卫•巴斯《进化心理学——心理的新科学》pg174 性幻想的性别差异\n[2]同上 pg 175\n[3] 同上 pg 147 对体型胖瘦与严格腰臀比率的偏好"
		},
		{
			"post_id": 4,
			"title": "为什么你总是三天打鱼两天嗮网？－－－彻底的行动",
			"date_published": 1473822270.026,
			"body": "\n关于彻底的行动:[英文原文地址](http://www.jiddu-krishnamurti.net/en/awakening-of-intelligence/1971-07-29-jiddu-krishnamurti-awakening-of-intelligence-the-action-of-will-and-the-energy-needed-for-radical-change)\n现实生活中我们经常觉得我们应该去完成某些东西，脑子里全是它的影子，时间渐去，火热去已经熄灭。举个栗子：头晚听了一场演讲，演讲者说的都挺符合我的状况，我心里接受了这个观点，回寝室睡了一会儿，第二天隐隐约约地感觉自己要改变一下生活，可还是按照抵抗力最少的那个方向去了.\n时间真的会带来改变吗?\n我们学习一门功课,一种语言,一种技术,时间的确能带来改变.\n\n---\n\n~~以下是引文，不用看啦!~~\n提问者：先生，你今天早上质疑了宗教说的那一套，这激起了我的疑问：**在理智的层面，我能理解你说的东西，听起来都很明智、很合理，然而我却提不起热情，这是怎么回事？**\n克：提问者说：你说的东西在理智上、口头上有点儿道理，但不知怎么回事，它没有直透人心，没有触及事情的源头，所以我无法突破。它没有带来那种干劲十足的感觉，那种要照此生活的感觉。恐怕大多数人都是这样的。\n(被打断）\n克：请别回答。我们来检视一番。那位绅士说：你说得很有道理，理智上我认可，但我内心深处却无动于衷，以致无法实现内心的改变和革命，也无法过一种完全不同的生活。我说：这就是我们大部分人的情况。我们走了一段路，迈出了一点儿步子然后就放弃了。我们保持了十分钟的兴趣，接下来就琢磨起别的事情。演讲结束后你就走了，继续过你每天的日子。为什么会这样？理智上、口头上、逻辑上，你是理解的。但那显然没有强烈地触动你，你不会一把火把过去的东西烧个干净。为什么没有这样的效果？是因为缺乏兴趣？是因为深度的懒惰、懈怠？检査一下，先生，不要回答我。如果是因为缺乏兴趣，那你为什么没有兴趣？房子着火了---- 你的房子、你的孩子长大后会被杀死，为什么你不感兴趣？你瞎了看不见？你迟钝、冷漠、无情？还是你内心深处没有能量因而变得懒惰了？检查一下，不要同意或不同意。你变得如此迟钝是因为你有你自己的问题？你想要满足，你低人一等，你胜人一筹，你焦虑，你有强烈的恐惧……诸如此类的事。你的问题在窒息你，因此你对任何事都提不起兴趣，除非你首先解决自己的问题。但你的问题就是其他人的问题，你的问题就是你所处的这个文化造成的。那么，是什么原因？是因为你完全冷漠、迟钝、无情？还是因为你的整个文化训练是智力上的、语言上的？你的哲学是嘴上说说，你的理论是极其狡猾的脑子的产物，而你就在其中长大，你的整个教育就建立在那个基础上。是因为思想受到了过度的重视吗？聪明、狡猾、能干、技术化的头脑，能够衡量、建造、斗争和组织的头脑。你受到了头脑的训练，于是就在那个层面上作出反应。你说，“是的，在理智上、口头上，我同意你的说法，我明白其中的逻辑和因果。”但你无法超越那一层，因为你的心困在了思想的运作即衡量当中。思想无法衡量深度\n或高度，只有在它自己的层面上才可以。所以，这对每个人来说都是十分重要的问题，因为我们大部分人都是在口头上、理智上同意讲者所说的一切，但不知为何，火焰就是没法点燃。\n问：我认为改变没有产生是因为重要的事情并不在理智的层面上，而在另一\n个层面。\n克：我们说的就是这个意思，先生。这位绅士说，改变没有产生是因为我们受到了心理上、经济上、社会上以及教育上的制约。我们就是我们所处的文化造就的。他说，只要我们内心的这种制约没有改变，我们就提不起任何强烈的兴趣。那什么会让你们感兴趣呢？我在问：虽然这一切你们听得很明白，希望你们是在用正常的头脑听，但这并没有点燃火焰，令你燃烧，为什么会这样？请问问你们自己，搞清楚你为什么在逻辑上、口头上、表面上同意，内心却无动于衷。如果剥夺你的钱或你的性，你就被触动了；如果剥夺你的重要感，你就会抗争了；如果剥夺了你的上帝、你的民族主义、你的中产阶级生活，你就会拼个你死我活了。这些都表明我们在理智上无所不能。我们在技术上登陆了月球，生活在思想的层面，但思想绝不能点燃改变人类的火焰。面对这一切才能改变人类，检视它，不要总活在那么肤浅的层面。\n\n**原文：**\nQuestioner: Sir, this morning you have questioned what the religions say, which prompts me to ask: how is it that I can understand what you say on an intellectual level. It seems to be sensible, it seems to be reasonable, and yet I lack the passion. Krishnamurti: The questioner says: what you say makes some sense intellectually, verbally, but somehow it does not penetrate, it does not go very deep, it does not touch the source of things; so that I can break through. It does not bring that sense of driving vitality, that sense of living with it. I am afraid that is the case with most people.\n\n(Interruption.)\n\nKrishnamurti: Please don't answer. Let us examine. The gentleman says: what you say is logical, intellectually I accept it, but I don't feel it deep in my heart so as to bring about a change, a revolution in myself and to live a totally different kind of life. And I say: that is the case with most of us. We go part of the way, take the journey a little distance and then drop out. We keep up the interest for ten minutes and the rest of the time think about something else. You go away after the talk and carry on with your daily life. Now why does this happen? Intellectually, verbally, logically, you understand; but apparently it does not touch you deeply, so that you will burn out the old, like a fire. Why doesn't this happen? Is it lack of interest? Is it a sense of deep laziness, of indolence? Examine it, Sir, don't answer me. If it is lack of interest, why aren't you interested? When the house is burning - your house - when your children are going to grow up to get killed, why aren't you interested? Are you blind, insensitive, indifferent, callous? Or deep down haven't you got the energy and are therefore lazy? Examine it, don't agree or disagree. Have you become so insensitive because you have your own problems? You want to fulfil, you are inferior, you are superior, you are anxious, you have a great sense of fear - there is all that; and your problems are smothering you, therefore you are not interested in anything unless you solve your problems first.\n\nBut your problems are the other man's problems, your problems are the result of this culture in which you live. So what is it? Total indifference, insensitivity, callousness? Or is it that your whole culture and training has been intellectual, verbal? Your philosophies are verbal, your theories are the product of tremendously cunning brains and you have been brought up in that. Your whole education is based on it. Is it that thought has been given such extraordinary importance? - the clever, cunning, capable, technological mind, the mind that can measure, construct, fight and organize. You have been trained in that and you respond on that level. You say, \"Yes, I agree with you intellectually, verbally, I see the logic, the sequence of it.\" But you cannot go beyond it because your mind is caught in the operations of thought which is measurement. Thought cannot measure depth or height, but only on its own level.\n\nSo this is really an important question for everybody, because most of us agree with all this verbally, intellectually, but somehow the fire doesn't get lit.\n\nQuestioner: I think there is no change because the important things are not on the intellectual level but on another plane.\n\nKrishnamurti: That is what we said, Sir. There is no change, the gentleman says, because psychologically, economically, socially, in education, we are conditioned. We are the result of the culture in which we live. And he says as long as that is not changed in us we won't take any deep interest. So what is going to make you interested? I am asking: why is it that though you listen to all this logically, and I hope with a healthy mind, this does not light a fire so that you burn with it? Please ask yourselves, find out why you agree logically, verbally, superficially, yet it does not touch you deeply. If your money or your sex is taken away it will touch you. If your sense of importance is taken away, then you will struggle. If your gods, your nationalism, your petty bourgeois life is taken away, you will fight like cats and dogs. Which all indicates that intellectually we are capable of anything. Technologically, going to the moon, we live on the level of thought, but thought cannot possibly ignite the flame which changes man. What changes man is to face all this, to look at it and not always live on that very superficial level.\n\n"
		},
		{
			"post_id": 3,
			"title": "关于ZeroNet Blog的搭建技巧",
			"date_published": 1473687816.031,
			"body": "### 关于ZeroNet Blog的搭建技巧\n\n-各种操作流程,还好有很多先行者为我们做好了梯子,我们只要顺着梯子走就行了.\n-主要是MarkDown语法的熟悉,其实MarkDown的语法指令就十几个,用熟悉了就很快上手.\n先回忆一下:\n`*内容* ` 斜体\n`**内容**`  粗体\n`[链接名](链接地址}  插入链接`\n`![图片名](图片地址)  插入图片`\n`分级 MarkDown语法支持6级语法 # 一级;##二级;###三级,依此类推.`\n`>  `引用文章\n`~~内容~~`   删除线\n`<font color=Green>譬如设置某段字体为绿色</font>`\n\n---\n\n<font color=Navy>1 注册ZeroNet </font> \n<a href=\"http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:1_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/+6+23+Update+bit+ID+FAQ\">注册ZeroNet指南</a>\n<font color=Navy>2 创建自己的博客</font> \n<a href=\"http://127.0.0.1:43110/1Nse6WcodQ5Mj6ZwvZvuyCVvQESwuxbCUy/?Topic:18_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/\"target=\"_blank\">创建自己的博客和论坛简单指南</a>\n<font color=Navy>3 博客新手指导</font> \n<a href=\"http://127.0.0.1:43110/mosen.bit/?Post:5\"target=\"_blank\">博客头像、链接、文章部分显示、设置链接、设置字体、背景</a>\n<font color=Navy>4 添加左侧标签栏</font> \n<table><tr><td bgcolor=#F8F8FF>★怎么找到自己的博客ID\n打开浏览器网址输入栏，如图，![image alt](img/3r.png)其中1DvjjzeAFSfTYW1qtBESdfNkfvvVWTcnYm便是了。然后在本地文档ZeroBundle\\ZeroNet\\data\\博客ID 操作\n★文章部分显示的技巧\n`（注释：第一空行）\n---（注释：第二空行）\n（注释：第三空行）`\n如图：<font color=Navy>**博客编辑** </font> \n![image alt](img/1r.png)\n           <font color=Navy> **之后** </font> ：\n![image alt](img/2r.png)\n★当博客背景图和博文文字相冲突后怎么办\n用到了这个命令：\n<table><tr><td bgcolor=#FF4500>这里的背景色是：OrangeRed， 十六进制颜色值：#FF4500， rgb(255, 69, 0)</td></tr></table>\n更多的背景设置：<a href=\"http://127.0.0.1:43110/mosen.bit/?Post:2\">第10条哦</a>\n★关于左侧标签栏的解决方法\n克隆一个有标签栏的博客就行了啦....然后在找到新建的博客下的文件复制替换到原来博客文件夹里的所有文件。\n★关于在评论里添加链接的语法：\n使用 [描述](链接地址) 为文字增加外链接\n示例：`  [本人博客](http://127.0.0.1:43110/1HfaYJXJDq3qXu5m3DdjHhnaHWNVHcCRQ6/?Home)`  \n实现： [本人博客](http://127.0.0.1:43110/1HfaYJXJDq3qXu5m3DdjHhnaHWNVHcCRQ6/?Home) \n具体操作：\n1将 `<table><tr><td bgcolor=#F8F8FF>` 置于博文前面的位置，\n2 将 `</td></tr></table>`置于文末。#F8F8FF为幽灵的白色，具体的背景的色<a href=\"http://www.5tu.cn/colors/yansezhongwenming.html\"target=\"_blank\">详细参数网址</a>\n<font color=Navy>**4 编辑用到的命令** </font>\na 插入图片` ![image alt](img/图片名.格式)`\nb 设置链接`<a href=\"链接地址\"target=\"_blank\">文本</a>`\nc 设置字体颜色 `<font color=Navy>文本</font> `\nd 加粗 `** **`\n\n### 引用文章\n<a href=\"http://127.0.0.1:43110/mosen.bit/?Post:5\"target=\"_blank\">ZeroBlog 新手指导</a>\n<a href=\"http://127.0.0.1:43110/mosen.bit/?Post:2:%E7%94%A8Markdown+%E4%BC%98%E9%9B%85%E7%9A%84%E5%9C%A8+ZeroNet+%E4%B8%8A%E5%86%99%E6%96%87%E7%AB%A0\"target=\"_blank\">用Markdown 优雅的在 ZeroNet 上写文章</a>\n</td></tr></table>\n"
		},
		{
			"post_id": 2,
			"title": "关于毕业的感想（一直完善中。。。。）",
			"date_published": 1473687738.001,
			"body": "大学时的结构和大学后的认知结构到底有些区别有些区别。\n1:在大学之后工作1年后与大学4年尤其是大四的思维状态，认知情况及心里素质的差异\n答：工作一年后，改变最大的是有一个清晰的关于自己职业道路的规划和前程 b在一个稍微清晰的规划下，自己投入大量时间和精力，脚踏实地，踏踏实实干工作，提升自己，打造自己，最好有一定的实践机会，在实践中锻炼自己，丰富自己的职业道路认知，在做出自己最后的决定c考取自己专业有一定难度的“证书”，相当于一个敲门砖，给自己一个机会，为自己发展多一条路（行业中存在门槛，开始别人不知道你是否有这个能力，你必须证明你自己的能力）\n\n---\n\n<table><tr><td bgcolor=#F8F8FF>补：1人际关系是最后的考试，考验一个人的综合能力，因为考试永远是死的，而处理人与人之间的微妙关系的能力对自己的前途影响比较大。\n   2 不要在意别人的评论，以为他们永远也不会给你想要的支持，不要幻想他们能给你温暖的支持，除非你们的观点已经彻彻底底的明晓\n   3 事业单位很多工作不到最后关头，是不会加班加点的完成，10分钟的是可以托2个小时完成的；私营单位总是以追其利益最大化为目标，讲求效率\n2：关于自制力的问题\n答：A注意不要把战线拉得太长了。即每天上午规定一定的时间如2个小时“铁打不动”的额定时间。B 列一个todo list 把任务分割成几个小块，完成心里的任务进度条。例如一本书近300页，每天看50页，分6天看完，下午也有2个小时的学习时间，比如打打字，用罗塞塔石碑软件练习英语口语；晚上最好3个小时，其中2个小时完成既定任务，还剩一个小时完成今天的任务总结，写50个字的总结报告，并定下明天的任务列表，并汇入总计划（总计划可分批次完成,且总是在不断修正中）\n3:恋爱问题\n答：遇到合适的，有缘分的就行。恋爱是个不确定的事情，花费了时间，金钱，精力且最后不确定付出后会得到回报等问题。\n                                                                          2016年8月8日 下午</td></tr></table>"
		},
		{
			"post_id": 1,
			"title": "意志的胜利",
			"date_published": 1433033779.604,
			"body": "在没有外界力量的监督下，通常一个人就会展现真正的自我，这时，我们为什么而战，我们的行为就会受原本的内心的力量所驱动。这也就是为什么我在独自计划执行中时时遇到挫折，时时停滞不前。内心的原本力量是--总结起来--想让自己舒服就怎么办，不幸，我总是被这样的原因蛊惑，是啊，想让自己怎么舒服就怎么办，于是乎，这一天的打字练习，英语口语练习就此耽搁了，更别说医学视频了。随着天数的增加，自己也就如温水煮青蛙般适应了环境了，也就再也不想跳了。哈哈哈哈。。。。。照此逻辑，初中，高中，大学中的闲暇时间就是这样被纠结和负罪感中所淹没。这样做使自己错过了很多机会，错过了人生的诸多可能。\n\n---\n\n<table><tr><td bgcolor=#F8F8FF>此时，如果意志不坚定的家伙，尤其是青年人，会沉迷于臆想，幻想自己在另一个环境中自己是如何大显本领。\n  当然，这些只能在后来的日子里抱怨了，但我绝不后悔自己的选择，因为自己的思想体系在不断的偶然事件中碰撞出思想的火花或者纯纯粹粹的在自己的心理舒适区里享受生活的美妙，都是自己的抉择或被动抉择，只能自己负自己的责任。的确，可是选择了一条路必然不可能在同一时间踏足另一条路，这也必然导致了这条路上的风景变换。\n  如此，追根溯源，我得检讨以下自己思想的动机了。\n  思想有时总是先于行动的，人们总是思想上有一定火花时，才会萌发行动的概念，并根据现实的资源和自己的时间资源加以分配。但是现实的肉体总会以各种各样的化学机制来影响人们的大脑，人们的思维局限（就是通常所说的眼光的局限性）也会在潜意识的领域对人的各种决策施加我们所不知道的影响。行动的任务进度表不会是我们大脑所意识的直线式，而更加趋向于复杂的函数变换曲线（不同的时间状态下不同的心理因素和身体因素分别对思维的大脑施加比重不同的影响），但我们明显习惯于清晰明快的计划表，虽然大多数情况下我们能否列出来还是个问题，在有外界条件监督下，我们往往能坚持较长时间，并找各种理由为自己坚持下去找借口，是的，外界的力量就是这么变相绑架我们的，除非自己彻底明晰自己到底为什么这样做及我的稍微长远而清晰目标，我们的大脑是很容易被外界的各种突变因素给裹挟去未知的，不可预料的事件中去，这就偏离了你原来的目的，这时，扪心自问自己的目标和价值观究竟是外强中干，还是海枯石烂？ 在这个过程中，有时那些醒来的人，不过只是在这个过程中眼睁睁的看着自己无能为力，不断堕落，丧失最初的自己。借用一句话：无论多么悲壮的故事，也改变不了悲剧的结局。这时，到底是外界环境压力和思想纠结到了什么程度呢？\n                                                             **（二）**\n 前篇我已经大略的聊了一下大脑决策的困境和执行力的尴尬境地，显然，在前面，我一直在努力灌输一个事实，那就是自制力的缺乏让X陷入了“思想的巨人，行动的矮子”的境地，造成了X不断强化形成“想怎么舒服就怎么舒服”的思维反射，让思维的火花在逐渐熄灭，让已经形成的稍微清晰的“目标”概念逐渐模糊，直至被“想怎么舒服就怎么舒服”所俘获，那么，在稍微困境的环境里，在有大量自由的时间条件前提下，假定X的行为受X内心得底层驱动力说驱动，这里分2种：\n1 受X自己的底层驱动所驱使，在没有清晰的彻彻底底目标下，X会被自己表层的概念所俘获，或者说在自己内心最深层的欲望所指引（如平时时常被压制的想法）下，做自己意识比较模糊而让自己快乐的事情，让自己舒服。但通常这是第一时期，这个过程比较短，意志的模糊状态通常在此发生。过了第一时期，便过渡到第二时期，顷刻的悔意，之后便是被自己编的理由所掩盖，或遗忘，或被自己的想像的事儿所占据自己全部的cpu。第二时期的重心是完成遗忘，以新的概念来替代并占据当下的活动；接下来便是潜意识的休眠期，在第一时期的喷发已经耗尽了能量，它必须潜伏下来，积蓄能量，等待下一次的喷发。通常第二时期X的“神”的意识占据上风，并接管“火山喷发后的残留遗迹”，并在此期间尽力“经济\n”，促进繁荣。可惜潜意识的危机并没有解决，随着地上经济的繁荣，地下积聚的力量也越来越多，其喷发的敏感度越来越高，导火线事件也越来越多，充当救活队员的“神”的意识会越来越疲惫，会发生意识模糊事件的机会也越来越大。盛世之下，犹如建筑在火山口上的冰宫华美建筑，晶莹剔透，却折射着迷人的血浆般的赤红\n  2 外界的压力 通常在没有自我觉醒的光环照耀下，或清晰的自我规划及定位下，我们被外界轻易裹胁，被打断计划。外界的力量好比在平地突起的小山包，小山包在平原里的城市经济开发形成过程中被狠狠的一拳揍“平”，可通过大地把力量传递到了地下深处，大地仍然在积蓄力量，危机被繁华的表象掩盖。根基不稳，内心深处的力量突破束缚，造成大地的满目疮痍。</td></tr></table>"
		}
	],
	"tag": [
		{
			"value": "心理类",
			"post_id": 1
		},
		{
			"value": "工作类",
			"post_id": 2
		},
		{
			"value": "技巧类",
			"post_id": 3
		},
		{
			"value": "心理类",
			"post_id": 4
		},
		{
			"value": "心理类",
			"post_id": 5
		},
		{
			"value": "计算机",
			"post_id": 9
		},
		{
			"value": "计算机",
			"post_id": 10
		},
		{
			"value": "心理类",
			"post_id": 6
		},
		{
			"value": "语言学习",
			"post_id": 7
		},
		{
			"value": "哲学",
			"post_id": 11
		},
		{
			"value": "哲思",
			"post_id": 12
		},
		{
			"value": "心理类",
			"post_id": 15
		},
		{
			"value": "linux",
			"post_id": 16
		},
		{
			"value": "社会学",
			"post_id": 17
		},
		{
			"value": "技术类",
			"post_id": 18
		},
		{
			"value": "媒介",
			"post_id": 19
		},
		{
			"value": "媒介",
			"post_id": 20
		},
		{
			"value": "媒介",
			"post_id": 21
		},
		{
			"value": "Centos7",
			"post_id": 23
		},
		{
			"value": "Hexo,Linux-Mint",
			"post_id": 24
		},
		{
			"value": "哲思",
			"post_id": 25
		},
		{
			"value": "读书",
			"post_id": 26
		},
		{
			"value": "恋爱观",
			"post_id": 27
		}
	]
}