{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Da Servidão Moderna",
			"body": "O objetivo principal deste filme é de por em dia a condição do escravo moderno dentro do sistema totalitário mercante e de evidenciar as formas de mistificação que ocultam esta condição subserviente. Ele foi feito com o único objetivo de atacar de frente a organização dominante do mundo.\n\n- https://www.bitchute.com/video/BzoLW85tINId/\n\n#\"A servidão moderna é uma escravidão voluntária, aceita por essa multidão de escravos que se arrastam pela face da terra. Eles mesmos compram as mercadorias que lhes escravizam cada vez mais. Eles mesmos correm atrás de um trabalho cada vez mais alienante, que lhes é dado generosamente se estão suficientemente domados. Eles mesmos escolhem os amos a quem deverão servir. Para que essa tragédia absurda possa ter sucedido, foi preciso tirar desta classe, a capacidade de se conscientizar sobre a exploração e a alienação da qual são vítimas. Eis então a estranha modernidade da época atual. Ao contrário dos escravos da Antiguidade, aos servos da Idade Média e aos operários das primeiras revoluções industriais, estamos hoje frente a uma classe totalmente escrava, que  no entanto não se dá conta disso ou melhor ainda, que não quer enxergar. Eles não conhecem a rebelião, que deveria ser a única reação legítima dos explorados. Aceitam sem discutir a vida lamentável que foi planificada para eles. A renúncia e a resignação são a fonte de sua desgraça.\"",
			"added": 1572736016
		},
		{
			"topic_id": 2,
			"title": "Socialismo",
			"body": "#ABCs do Socialismo\n\n- https://ominhocario.wordpress.com/os-abcs-do-socialismo/ \n\n- [Internet Archive](https://web.archive.org/web/*/https://ominhocario.wordpress.com/os-abcs-do-socialismo/)",
			"added": 1572736204
		},
		{
			"topic_id": 3,
			"title": "O BLOQUEIO: A GUERRA CONTRA CUBA",
			"body": "Documentário que detalha historicamente os impactos do Bloqueio Econômico dos EUA contra Cuba, bem como outras questões relacionadas ao país, como a emigração, os problemas advindos do Período Especial após o fim da URSS, entre outros.\n- https://invidio.us/uFuWvC1LYEw",
			"added": 1572740510
		}
	],
	"topic_vote": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": 1,
		"3_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": 1,
		"1_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": 1,
		"1_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": 1
	},
	"next_comment_id": 19,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#Socialismo, utopia inviável? (1) - Outras Palavras\nHá cem anos, Mises e Hayek desafiaram o sistema proposto por Marx: seria ineficiente e autoritário. Escola Austríaca defendia a desigualdade, mas previu impasses que bloquearam o socialismo. Agora, surgiram meios para superá-los\n- https://telegra.ph/Socialismo-utopia-inviável-1---Outras-Palavras-11-01\n\n#Socialismo, utopia inviável? (2) - Outras Palavras\nPara Hayek, a economia, muito complexa, só pode evoluir por meio da competição – que o socialismo inibe. Embora resignado, ele frisou as relações entre produção centralizada e autoritarismo. Como responder a esse desafio?\n- https://telegra.ph/Socialismo-utopia-inviável-2---Outras-Palavras-11-01\n\n#Socialismo, utopia inviável? (3) - Outras Palavras\nHá pós-capitalismo latente no Big Data e na Inteligência Artificial. Já é possível superar o mercado e planejar a produção de modo democrático, sem o peso da burocracia estatal. Desta brecha surgirá uma das disputas centrais no século XXI\n- https://telegra.ph/Socialismo-utopia-inviável-3---Outras-Palavras-11-01",
				"added": 1572736345
			},
			{
				"comment_id": 2,
				"body": "#Marxists Internet Archive\nO Marxists Internet Archive é uma biblioteca virtual multilingue, colaborativa e não comercial que se dedica a recompilar textos de autores marxistas, distribuídos sob a licença Creative Commons.\n- https://www.marxists.org/portugues/index.htm",
				"added": 1572737203
			},
			{
				"comment_id": 3,
				"body": "#Curso: as experiências socialistas no séc. XX\n- https://invidio.us/playlist?list=PLqPoCJrKrte1Oam3OIo1dwsxYexFZjhv2",
				"added": 1572737313
			},
			{
				"comment_id": 4,
				"body": "#Marxismo\n- https://invidio.us/playlist?list=PLPZ4y7b7MwOvw-DiyPCvEcCOLkhQWsSur",
				"added": 1572737436
			},
			{
				"comment_id": 5,
				"body": "#Ecossocialismo\n- https://invidio.us/playlist?list=PLPZ4y7b7MwOv0HV55UCMbXYFh6jjjneDP",
				"added": 1572737453
			},
			{
				"comment_id": 6,
				"body": "#Propriedade Pessoal vs Propriedade Privada vs Propriedade Coletiva\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:3_17dWCCH7ERRQbnfDPoW4arpHPNYmtuMtdy/Propriedade+Pessoal+vs+Propriedade+Privada+vs+Propriedade+Coletiva",
				"added": 1572737494
			},
			{
				"comment_id": 7,
				"body": "#Desigualdade e propriedade privada no Brasil\n- https://invidio.us/dDobL2NAv_E",
				"added": 1572737814
			},
			{
				"comment_id": 8,
				"body": "#O que socialistas pensam sobre consumo?\n- https://invidio.us/b4driJ-lrBI",
				"added": 1572737898
			},
			{
				"comment_id": 10,
				"body": "#Socialista de iPhone?\n\n- https://invidio.us/CL2matYOY1A\n\n#Este vídeo não é sobre o iPhone. É sobre bens de consumo e propriedade privada. A questão da tecnologia é importante porque parece ser o que mais incomoda a chamada ala direita - que os socialistas têm acesso a bens tecnológicos e podem se comunicar através deles.",
				"added": 1572738237
			},
			{
				"comment_id": 11,
				"body": "#COMUNISMO PARA INICIANTES\n- https://invidio.us/nGrxeWmPupI",
				"added": 1572738544
			},
			{
				"comment_id": 12,
				"body": "# Duas teses sobre a transição socialista \n\n#Tese I: Socialismo não é modo de produção.\n\nÉ comum em certa esquerda idealista afirmar que as experiências do século XX não foram socialistas por manterem “aspectos capitalistas” ou não estar de acordo com o cânone de determinado “texto sagrado” (o texto é mais importante que a realidade). É importante esclarecer: a teoria clássica da transição socialista, sintetizada no livro O Estado e a Revolução, de Lênin, defende que um bloco das classes oprimidas liderado pelo proletariado deve tomar o poder de estado e a partir daí começar o processo de transformação revolucionária da sociedade. O sentido dessa transformação revolucionária é: socialização da riqueza, do poder e da cultura. Na economia a propriedade pública dos meios de produção, a planificação econômica e a riqueza produzida é para atender as necessidades plenas de toda sociedade; na política a democracia participativa, de base e a autogestão em várias esferas são ampliadas ao máximo, e a cultura é socializada de uma forma onde saber científico, técnico e filosófico deixa de ser privilégio de uma pequena classe de exploradores e a produção cultural e ideológica é pautada na solidariedade, internacionalismo, senso coletivo e combate às formas de opressão.\n\nLogo, se socialismo não é modo de produção, mas uma fase de transição entre a sociedade antiga (capitalista) e a nova (comunista), manter relações da antiga sociedade não é só “aceitável”, como normal. Os ritmos de transformação, os avanços e recusou, são ditados por uma síntese dialética entre condições objetivas e subjetivas; ou seja, as próprias condições socioeconômicas onde começa a experiência de transição, a correlação de forças e a dinâmica da luta de classes interna e externa (na geopolítica) e toda tradição ídeocultural do povo. Logo, constatar que em certas experiências, como a URSS, mantiveram relações sociais típicas do capitalismo, como o fordismo nos processos de trabalho, e depois disso afirmar que a URSS nunca foi socialista, mas sim “capitalismo de estado” ou qualquer outro conceito obtuso, é negar a perspectiva da totalidade e da processualidade do socialismo. É achar que a tomada do poder cria automaticamente a transformação de todas as relações sociais da sociedade capitalista e desconsiderar as condições objetivas - isso é algo da tradição anarquista e não marxista (como Lênin tão bem demonstrou nas usas obras, em especial, de novo, no O Estado e a Revolução).\n\nDando um exemplo concreto. A Rússia pós-revolução estava numa situação de miséria extrema (resultado do próprio subdesenvolvimento do país, da primeira guerra mundial e da guerra civil) e fome epidêmica. Nessa conjuntura concreta a direção revolucionária tomou como prioridade o desenvolvimento das forças produtivas ao máximo como forma de garantir a sobrevivência material (biológica) do povo e garantir a defesa militar contra agressões imperialistas. Nessa conjuntura, onde a prioridade absoluta era criar uma indústria de base e conseguir produzir comida, roupas, medicamentos, etc. para todos, afirmar que por não ter autogestão completa nas fábricas a URSS traiu o socialismo e tornou-se “capitalismo de estado” nos anos 30, como faz Alysson Leandro Mascaro e Marcio Bilharinho Naves (dois grandes juristas marxistas), é achar que é possível construir relações de produção comunistas ignorando a situação material imediata, e transformar tudo ao bel prazer da “vontade política”. \n\n#Tese II: a transição socialista é relacional.\n\nSe o socialismo não é um modo de produção, mas toda uma época histórica de duração variada na transformação da sociedade e na criação da sociedade comunista; deveria ser claro, mas infelizmente não é, que o ritmo e as formas de transformação dependente das formas que um país (ou bloco de países) está inserido no mercado mundial e no sistema geopolítico (imperialista). Lênin, de novo, nos ajudar a pensar a questão. O líder bolchevique afirmou que é possível o proletariado conquistar o poder político num país subdesenvolvido e começar a transição socialista, mas o sucesso dessa transição, ao mesmo tempo, depende dos ritmos do movimento revolucionário mundial. Parece uma antinomia, mas não é. A questão é simples. Um país atacado de todas as formas pelo imperialismo com bloqueios econômicos, sabotagens, terrorismo, pressões diplomáticas, guerra de desinformação, invasões militares (as pessoas esquecem que Cuba, Rússia, Vietnã, Angola e Coréia do Norte são experiências socialistas invadidas militarmente pela ação do imperialismo), etc. terá, é lógico, dificuldades de desenvolver plenamente a democracia operária de base e autogestionária. Não existe nenhuma experiência histórica que mostre o desenvolvimento da democracia numa situação de estado de guerra permanente (até os teóricos liberais sabiam disso).  Logo, por exemplo, o enfrentamento geopolítico com o imperialismo vai condicionar de forma negativa o sistema político socialista (é claro, porém, que as decisões do grupo dirigente revolucionário podem ampliar esse “fechamento” necessário ou combatê-lo dentro do possível: na URSS decisões erradas ampliaram esse “fechamento” necessário, em Cuba ao contrário, mesmo em estado de guerra permanente a democracia operária conseguiu-se manter em bom termo).\n\nPodemos dizer o mesmo da economia. Se um país socialista não tem capacidade de produzir todo alimento – por exemplo - que necessita ele precisará necessariamente importar. Para importar são necessários dólares. Para ter dólares a economia socialista terá que manter um setor de exportação que consiga esse capital e isso fará com que a economia socialista tenha que criar setores ou de mercado ou ainda atrelados à lógica de mercado e sujeitos às vicissitudes do mercado mundial. Como nenhum país é auto-suficiente em tudo (principalmente os pequenos como Cuba) e o mundo ainda é, infelizmente, capitalista e dominado pela hegemonia norte-americana, relações comerciais com o capital internacional são necessárias e importantes. Caso contrário o país fica isolado do mundo e sofrendo escassez de vários produtos (como aconteceu com Cuba e Coréia do Norte pós-derrubada da URSS e com a própria URSS durante os anos 20 e 30). Logo, é um truísmo dizer que a revolução tem que ser mundial. Todo mundo sabe disso. Essa afirmação não diz nada dos desafios que um país específico terá ao iniciar sua transição socialista.\n\n\nÀ guisa de conclusão: se socialismo não é modo de produção, mas toda uma longa época histórica de transformações revolucionárias e se essas próprias transformações são relacionais, ou seja, dependem de condições concretas e objetivas que ditam limites e possibilidades, desconsiderar as experiências concretas de transição socialista comparando de forma mecânica os desafios histórico-concretos da realidade com trechos de livros de Marx e Engels (que não foram escritos levando em conta essa realidade histórico-concreta) é idealismo. Ficar horrorizado com recuos táticos nas experiências de transição socialista, como a NEP na Rússia e as reformas em curso em Cuba, e clamar pela pureza de um socialismo já perfeito aqui e agora também é idealismo. E como todas e todos sabem: idealismo é antagônico ao marxismo. \n\n- Fonte: https://makaveliteorizando.blogspot.com/2015/05/duas-teses-sobre-atransicao-socialista.html",
				"added": 1572738689
			},
			{
				"comment_id": 13,
				"body": "#O que é Socialismo?\n- https://invidio.us/zP_Rta9B-3s\n- https://invidio.us/143_MSMjQPc",
				"added": 1572738921
			},
			{
				"comment_id": 14,
				"body": "# Princípios para uma formação política revolucionária \n\nO objetivo dessas linhas é expor de maneira mais ou menos sistemática o que considero serem os maiores erros no processo de formação política da militância da esquerda revolucionária. Sabemos bem que sem boa formação política é impossível uma prática política correta e eficiente – ao mesmo tempo, a boa formação política por si só não garante isso. Mas o que é uma boa formação política? Buscando ser o mais didático possível, vamos de maneira esquemática dividir a questão em tópicos e ir abordando-os detidamente. \n\n - A prática impõe a necessidade.\nÉ comum em militantes ao começarem seus estudos no marxismo se pautarem por debates da moda em meios virtuais de esquerda, guetos ideológicos muito presentes no movimento estudantil ou o debate da moda no mundo acadêmico. Querelas como modernidade e pós-modernidade, Trotsky vs Stálin, Althusser vs Lukács etc. recebem uma atenção espantosa de jovens militantes que começam a conhecer o marxismo. Esse tipo de postura, infelizmente, cria uma situação esdrúxula: o militante que passa horas debatendo sobre a União Soviética e não sabe os problemas e potencialidade de atuação do seu bairro, cidade e estado. O estudo se desloca da prática, tomando a forma de “formação livresca”, e a prática não é refletida de acordo com a teoria.\n\nNormalmente, pessoas presas a esse tipo de debate, não mantém uma prática política efetiva. São pessoas que apenas estudam o “marxismo” ou que estão começando a se inserir numa cultura de esquerda; contudo, isso também acontece com militantes organizados, ou formalmente organizados, e atuantes. O que fazer para superar esse problema?\n\nA primeira coisa a ser dita, antes que surja algum entendimento errado, é que debates sobre ontologia do ser social, estruturalismo marxista, pós-modernidade, história do socialismo etc. são muito importantes. Mas esses debates não devem ser apreendidos enquanto erudição acadêmica, mas como formas de compreender e atuar na realidade mais imediata e ir expandindo o horizonte de compreensão. Ou seja, o jovem ao começar a atuar na associação dos moradores, área de cultura ou movimento estudantil, inicialmente se depara com os problemas concretos que a classe trabalhadora e a juventude enfrentam (como a precariedade do transporte, no caso da atuação em bairro, ou a falta de assistência estudantil, no M.E) e atuando sobre esses problemas, se pergunta: como eu posso entender melhor esse processo social e atuar no sentido de organizar a ação política sobre essa demanda? A partir dessa questão, define suas prioridades de estudo.\n\nPor exemplo, recentemente, estive na cidade de Petrolina, no sertão de Pernambuco. Para quem não conhece, Petrolina é um grande polo agroexportador e uma cidade com gigantesco avanço da especulação imobiliária. Dominada há várias décadas pela Família Coelho, uma espécie de oligarquia aburguesada que funde seu poder político com o poder econômico dos capitais atuando na cidade, e cria uma situação onde a disputa programática é bastante difícil.\n\nConversando com vários militantes de Petrolina, organizados e os “independentes”, era perceptível como o problema da dominação oligárquica burguesa, sua realidade imediata, chamava menos atenção do que os debates da moda na esquerda. Além disso, por exemplo, caso se resolva ler com sistematicidade a obra de Lênin (algo mais que recomendável), a pergunta de fundo deveria ser: como a obra de Lênin me ajuda a pensar a minha realidade? Devo deixar bem negritado que não estou defendendo uma espécie de “localismo” no processo de formação política.\n\nTodo militante deve buscar através de sua organização e esforços próprios uma formação que se possibilite compreender do particular até o universal, desde a realidade de sua cidade, estado, país até o processo de acumulação mundial do capital. Mas essa compreensão nasce de um longo percurso formativo com sistematicidade e etapas; aí sim, afirmo sem medo de errar, que é necessário num primeiro ciclo de formação política apreender os elementos básicos do pensamento crítico – como entender numa abordagem introdutória o que é processo histórico, materialismo, relações de produção, poder político etc. – aliado a um estudo de sua realidade mais imediata de vivência e militância. Enfim, as necessidades de atuação, e não a moda acadêmica ou o tema do momento nas redes sociais, é que devem pautar as primeiras fases de um processo de formação política.\n\n\n- Cuidado com o colonialismo cultural.\n\nAs modas acadêmicas e os debates do momento nas redes sociais, grosso modo, são pautados por problemas, intelectuais, conceitos e teorias oriundas dos centros do capitalismo: Europa Ocidental e EUA. O Brasil viveu mais de 300 anos de colonialismo e esse processo marca profundamente nossa constituição sociocultural. Superado a sociedade colonial, fizemos uma transição burguesa não clássica assumindo a posição de país capitalista dependente e subdesenvolvido, reproduzindo sob novas formas e determinações o colonialismo cultural intrínseco a dominação imperialista.\n\nNa música, cinema, teatro, literatura, artes plásticas, arquitetura e nas ciências humanas, a predominância dos EUA, França ou Inglaterra como fonte inspiradora é evidente. Mais que isso: chocante. Ao ponto de um aluno de ciências sociais da universidade brasileira “conhecer” melhor a cultura francesa – ao menos em termos de literatura sociológica – que a brasileira. Um militante comunista deve se preocupar em não reproduzir o colonialismo cultural que sempre espera as luzes da Europa ou dos EUA através de algum marxista ou pensador da moda – como Zizek, David Harvey ou Boaventura de Souza Santos – e pautado pelas novidades conceituais europeias. Note, de novo, fugindo dos falsos problemas: não se trata de não ler os estudiosos europeus e estadunidenses marxistas e de esquerda, a questão é no processo formativo eles não serem prioridade! Um marxista brasileiro deve antes de tudo, além dos clássicos como Marx, Engels, Lênin, Rosa Luxemburgo etc., conhecer e bem a produção teórica marxista e se possível não marxista do seu país e continente.\n\nLer Nelson Werneck Sodré, Florestan Fernandes, Ruy Mauro Marini, Vânia Bambirra, Caio Prado Jr., Heleieth Saffioti, Theotônio dos Santos, Guerreiro Ramos, Jacob Gorender etc. é a nossa prioridade – ou deveria ser. Assim como deve haver uma preocupação com os produtos culturais consumidos. O colonialismo cultural promove fenômenos como um brasileiro conhecer mais da cultura e história dos EUA e França do que da Bolívia ou Argentina. Estamos de costas viradas para América Latina e fora da Pátria Grande, não há vitória definitiva do socialismo no Brasil. Precisamos latino-americanizar nossa cultura e nossa teoria social.\n\nPodemos pegar um exemplo expressivo do colonialismo cultural. David Harvey, anos atrás, lançou um livro sobre o “novo Imperialismo” em que usa o conceito de “acumulação por espoliação” se referindo ao processo onde o capital se apropria de terras, florestas, rios etc. de comunidades tradicionais (como povos originários e remanescentes de quilombos) e camponeses. O conceito e o livro de Harvey fizeram o maior sucesso no Brasil. Foi preciso um europeu teorizar uma realidade que é uma das principais contradições sociais e motores da luta de classe na Bolívia, Peru, Equador, Venezuela etc. para aí, e só aí, prestarmos atenção a esse fenômeno secular da realidade latino-americana (e para não haver erros: isso não é “culpa” do David Harvey, ele está apenas fazendo o seu trabalho, o problema é o colonialismo cultural que nos domina).\n\nA importância do combate ao colonialismo cultural na formação revolucionária pode ser mostrada através de um exemplo simples: todas as organizações e líderes de processos revolucionários no século XX sem deixar de ser internacionalistas estavam profundamente mergulhados, conectados, com a cultura nacional do seu povo. Lênin era antes de tudo um profundo conhecedor da cultural russa; o mesmo pode ser dito de Fidel Castro, Mao Tse Tung, Kim il Sung, Ho Chi Minh, Rosa Luxemburgo, Che Guevara, Almicar Cabral, Agostinho Neto etc. Não se faz a revolução sendo pautado pelo tema do momento nos cafés de Paris. Portanto, priorizar a apreensão do marxismo brasileiro e latinoamericano no processo de formação política é fundamental para um revolucionário nos seus estudos.\n\n\n- A importância dos clássicos.\n\n\nNa cultura política da esquerda atual, existe uma compreensão média consolidada com a derrubada da União Soviética e a crise do movimento comunista, que temos que esquecer a nossa história no século XX e recomeçar tudo, criar o “novo”; afinal, a história do movimento comunista é uma história totalitária de crimes, autoritarismo e brutalidade. Essa ideologia se reflete no quase total apagamento da importância dos clássicos na formação política. Primeiro, entendemos por “clássicos” aqueles pensadores ou pensadoras que em sua produção teórica mesmo estando localizada num determinado período histórico e realidade sociopolítica conseguem fornecer ferramentas analíticas e conceituais para apreender a nossa realidade. Ou seja, figuras como Lênin, Rosa Luxemburgo ou Caio Prado Jr. não vivem nossa época histórica e conjuntura, mas, sem qualquer transposição mecânica, o estudo de suas obras nos ajuda a compreender e atuar na luta de classes atual.\n\nUm comunista hoje em formação terá bastante dificuldade de encontrar de forma acessível os clássicos do pensamento comunista brasileiro e do movimento comunista no mundo. Com exceção da nobre e honrosa Editora Expressão Popular que publica com sistematicidade as obras dos clássicos universais do pensamento comunista (e tem abrangência nacional), as editoras de esquerda (como a Boitempo), as novas organizações (como as agrupadas em torno do PSOL), os congressos acadêmicos e os debates da moda não se interessam por Astrojildo Pereira, Otávio Brandão, Lênin, Mao, Agostinho Neto, Dimitrov, Clara Zetkin. Só as obras de Marx e Engels são louvadas enquanto necessárias numa perspectiva muitas vezes academicista e envoltas na ideia de “precisamos voltar à Marx” que foi “deturpado” pelo movimento comunista.\n\nQuais as consequências principais dessa ausência dos clássicos na formação política? Primeiro, os marxistas clássicos, em sua maioria, não eram professores universitários, mas sim homens e mulheres de ação, organizados em partidos políticos com militância em tempo integral e/ou dirigentes políticos nos processos revolucionários. Nos textos clássicos há uma preocupação sistemática e preponderante em como organizar a classe para tomar e conservar o poder num processo de transição socialista; o marxismo na atualidade, em sua imensa maioria, tem como referência professores universitários que nunca escreveram um único livro sobre organização política e mantém ideias extremamente abstratas e genéricas nos momentos de pensar a ação política. A ausência de uma sólida formação dos clássicos cria, normalmente, o militante que até consegue fazer boas análises de conjuntura, mas que é incapaz de pensar uma organização com as mediações táticas (palavras de ordem, política de aliança, definição dos objetivos prioritários etc.) adequadas vai influir realmente nessa conjuntura.\n\nÉ possível ver também nos clássicos – e aqui me refiro em especial aos brasileiros e latinoamericanos – uma preocupação em formular uma teoria do desenvolvimento capitalista no Brasil e na América Latina de modo geral. Durante boa parte do século XX, diria que até o golpe empresarial-militar de 1964, todo grande intelectual, conservador ou de esquerda, procura apresentar sua tese sobre o que é o Brasil. Caio Prado, Gilberto Freire, Oliveira Viana, Celso Furtado, Florestan Fernandes, Nelson Werneck Sodré e muitos outros tinham a sua grande obra [magnum opus] sobre o desenvolvimento do capitalismo e suas particularidades nacionais. A tendência das últimas décadas na teoria social (como o predomínio da pós-modernidade) e a própria dinâmica institucional da universidade dificulta de sobremaneira a realização dessas obras e o acadêmico hoje é em grande medida um especialista em temas tópicos (ainda que muito importantes) e sem condições de fornecer uma explicação global, sistemática e de fôlego histórico sobre as tendências de acumulação capitalista no país.\n\nAs análises tópicas e presas quase sempre a dimensão conjuntural estimulam uma prática política taticista e reformista. Por exemplo, quem estudar sistematicamente a obra de Florestan Fernandes e Ruy Mauro Marini e compreendem que a superexploração da força de trabalho é um determinante do capitalismo dependente brasileiro saberá que nunca teremos nada parecido com um Estado de bem-estar social de tipo europeu e uma “era dos direitos”; evidentemente, para as organizações reformistas ou socialistas com foco eleitoral, esse tipo de conclusão teórica é demasiado incômoda.\n\nA ausência dos clássicos na formação política, além de tendencialmente afastar o militante das reflexões sobre a questão organizativa, tomada do poder e análises de maior fôlego sobre o desenvolvimento capitalista, também induz a um tipo de formação que não reflete com sistematicidade sobre agitação e propaganda, política de finanças, comunicação etc. Se o militante não vive e reflete sobre a totalidade de sua organização – o que não significa, em absoluto, ele “saber de tudo” e “atuar em tudo” – a tendência será a da burocratização e a ausência de centralidade da independência de classe, fazendo com que, por exemplo, seja considerado normal uma organização política ter no fundo partidário controlado pelo Estado burguês sua principal fonte de financiamento.\n\n\n- Aprender com a nossa história.\n\nExiste na esquerda atual uma preocupação com o “novo”, a “novidade”, a “inovação”. Em outras oportunidades, já escrevi amplamente sobre o tema. Não quero me estender novamente sobre. De forma sintética, diria que a ideologia do novo prega que todos os problemas organizativos e políticos da esquerda brasileira e mundial se devem a manutenção de “velhas práticas” e a falta de renovação. Como algo próprio da constituição cultural da modernidade burguesa, a ideia do novo é algo em si positivado, na política, basta qualquer organização se apresentar como “o novo” (normalmente esse novo é bem mais estético que programático e político) para cair nas graças de deus e o mundo com olhares bem pouco críticos – não custa lembrar o apaixonamento em prol do Syriza meses atrás.\n\nEssa ânsia pela pseudo novidade faz com que o conjunto dos militantes não conheçam sua própria história, especialmente do ponto de vista organizativo. Como os comunistas no século XX conseguiram organizar a classe trabalhadora e a juventude mesmo enfrentando ditaduras militares, Estados coloniais e o fascismo? Como é possível burlar a pressão das empresas e criar células comunistas em monopólios transacionais como o Partido Comunista Italiano conseguia com êxito? E a experiência de organizar pequenos comerciantes e setores da economia informal pelos comunistas na Grécia e em Portugal? E a expressiva força que o PCB teve no século XX entre engenheiros e clubes de engenharia, como isso foi possível? E a capilaridade do Partidão nas associações de moradores na cidade do Paulista (Pernambuco), como se deu? Os exemplos são múltiplos.\n\nO desconhecimento sistemático de nossa própria história e sua análise predominantemente através dos debates estratégicos via documentos congressuais dificulta que todo o legado político e organizativo – um verdadeiro patrimônio – seja repassado as gerações mais jovens e que a partir dessa experiência transmitida aja uma rica cultura política que ajude a pensar criativamente a resolução dos problemas diários da luta política. Vamos usar um exemplo.\n\nNos anos 80 e 90 explodiu um gigantesco debate sobre o fim da classe trabalhadora, fim do trabalho, sociedade informal, sociedade pós-industrial etc. Dos vários e vários desdobramentos desse debate, um deles, foi a ideia de que embora a classe operária continue tendo centralidade no processo de produção do valor, na esfera da reprodução social é que as contradições sociais se expressam com maior explosão e devem ser o foco da organização da esquerda. Essa “grande novidade” teórica ganhou ainda mais visibilidade depois dos protestos de junho de 2013 onde a qualidade dos serviços públicos urbanos foi a causa principal de uma das maiores manifestações de massa na história do país.\n\nCitando de novo David Harvey (nosso exemplo preferido), o geógrafo vem teorizando sobre isso. Bem, infelizmente, a maioria das pessoas não sabe que para a história dos comunistas do PCB isso não é a menor novidade. A compreensão de que o trabalho comunitário na luta por moradia, água, creche, educação, contra o aumento do custo de vida é a primeira e mais eficiente via de estabelecer uma sólida base popular e a partir daí potencializar o trabalho sindical é uma tradição na história do Partidão.  A atuação nas “contradições da reprodução social” como estratégia de enraizamento social e confrontação com o capital para além do ambiente da fábrica é uma novidade que o PCB realizou com maestria nos anos 30, 40, 50... 60 etc.\n\nEvidentemente, a nossa história contém erros e mesmo os acertos, não são receitas mecânicas, fórmulas de bolo, a serem aplicadas integralmente. A reflexão sobre o papel do estudo da experiência política e organizativa dos comunistas na formação política repete a “lógica” sobre a importância do estudo dos clássicos: estudar de forma sistemática se perguntado como aquele conhecimento pode ajudar a compreender e intervir politicamente a realidade vivida.\n\n\nTendo esses quatro princípios norteadores e baseado numa estratégia revolucionária, acreditamos que o processo de formação política, isto é, o estudo acompanhado e orientado pela prática e a prática refletida e orientada pelo estudo, será um dos elementos indispensáveis para a formação de quadros revolucionários fundamentais  para a construção da imprescindível e inadiável Revolução Socialista no Brasil. \n\n- Fonte: https://makaveliteorizando.blogspot.com/2017/08/principios-para-uma-formacao-politica.html",
				"added": 1572739798
			},
			{
				"comment_id": 15,
				"body": "#Princípios Básicos do Comunismo - Friedrich Engels\n- https://telegra.ph/Engels-Princípioa-Básicos-do-Comunismo-11-03",
				"added": 1572740430
			},
			{
				"comment_id": 16,
				"body": "#Noam Chomsky - Socialismo\n- https://invidio.us/watch?v=xJABuO6gjvc\n- https://invidio.us/watch?v=zDJee4stYN0\n- https://invidio.us/watch?v=1-WW-_GP6XU",
				"added": 1572740704
			},
			{
				"comment_id": 17,
				"body": "#De Volta ao Debate Sobre o Planejamento Socialista I – Cálculo, Complexidade e Planejamento\n\nEste artigo oferece uma reavaliação do debate sobre o cálculo socialista e examina até que ponto as conclusões desse debate deveriam ser modificadas sob a luz do desenvolvimento subsequente da teoria e da tecnologia da computação. Após uma introdução às duas principais perspectivas sobre o debate que foram oferecidas até o momento, examinamos o argumento clássico de von Mises contra a possibilidade de cálculo econômico racional sob o socialismo. Discutimos a resposta dada por Oskar Lange, junto dos contra-argumentos à Lange do ponto de vista austríaco. Finalmente, apresentamos o que chamamos de “resposta ausente”, isto é, uma reafirmação do argumento marxiano clássico por um cálculo econômico em termos de tempo de trabalho. Argumentamos que o cálculo por tempo de trabalho pode ser defendido como um procedimento racional, quando complementado por algoritmos que permitam que a escolha dos consumidores guie a alocação de recursos, e que tal cálculo é tecnicamente viável com o tipo de maquinário computacional atualmente disponível no Ocidente, com uma escolha cuidadosa de algoritmos eficientes. Nossa argumentação vai no sentido oposto das discussões recentes sobre planejamento econômico, que continuam afirmando que a tarefa seria de complexidade insolucionável.\n\n- https://ominhocario.wordpress.com/2019/04/19/de-volta-ao-debate-sobre-o-calculo-socialista-calculo-complexidade-e-planejamento/  \n- [archive](https://archive.md/j2tMc)\n\n#De Volta ao Debate Sobre o Planejamento Socialista II – Preços, Informação, Comunicação e Eficiência\n\n[A análise dos aspectos econômicos da informação tem sido associada ao trabalho de Hayek, que enxerga o sistema de preços no mercado como um mecanismo de telecomunicação de informações e de adaptação a mudanças. As críticas de Hayek às possibilidades de um planejamento democrático da produção de bens e serviços, como apresentadas no artigo “O Uso do Conhecimento na Sociedade”, têm servido de base para enterrar qualquer forma de socialismo, mesmo para pessoas que resistem ao seu entusiasmo extremo por mercados irrestritos. Até que ponto as ideias de Hayek se sustentam, principalmente diante dos avanços posteriores na Teoria da Informação e na Ciência da Computação? Será que o sistema de mercado realmente é tão mais eficiente do que qualquer alternativa baseada no planejamento democrático socialista jamais poderia ser? Ou, pior, será que as ideias de Hayek realmente mostram que uma alternativa desse tipo não seria apenas menos eficiente, mas simplesmente impossível?]\n\n- https://ominhocario.wordpress.com/2019/05/09/de-volta-ao-debate-sobre-o-planejamento-socialista-ii-precos-informacao-comunicacao-e-eficiencia/\n- [archive](https://archive.md/PVMfI)",
				"added": 1572742549
			}
		],
		"1_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr": [
			{
				"comment_id": 18,
				"body": "> [popper](#comment_17_15ZCzHPEspA94YwXMHBrrDspmVc1RiaQJr): GUIA DE ESTUDO DO LIVRO DE APOCALIPSE\n> \n> https://web.archive.org/web/20140724062345/https://perrybrown.files.wordpress.com/2010/09/guia-de-estudo-do-livro-de-apocalipse.pdf\n\n#SHA-512: 857b62213f144b5ee765c2af397889766e529cd56294eb77a9b07af389d3a400d53d5598fb00dddbafd6a8cbfaa712659f06968bd08ff519f5d97c72598a7596",
				"added": 1572744170
			}
		]
	},
	"comment_vote": {}
}