{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"DSA Is Doomed - written by Archie Carter - Deleted from Quillette http://archive.is/4I6CT","body":"DSA Is Doomed\nwritten by Archie Carter\nI am working class and a Marxist-Leninist. I believe in a revolution of the proletariat, and the usurpation of the ruling class. As I looked around the political landscape after Donald Trump’s election win, I noticed the Democratic Socialists of America (DSA). Curious, and hoping for a radical and viable alternative to the two establishment parties, I took myself along to a meeting. While DSA do not perfectly align with my politics, I became a dues-paying member all the same, attracted by the party’s subversive potential. I attended meetings of the Brooklyn DSA chapter, and participated in many NYC-DSA actions—sit-ins, marches, labor protests—because of my steadfast belief in the transformative power of solidarity. I would approach political activity with this maxim in mind: what would Alinsky do?\nIt soon became clear that I had not found a political home here. This was not the party of the working class I had expected—at least, that was my experience of the New York DSA and its various sub-chapters. Instead, its members and leadership seemed to be mostly NYU grad students, hipster comics, and neurotic office-workers. I became uncomfortable, then disenchanted, and then I just stopped going to DSA meetings altogether.\nIn the end, DSA’s political culture just wore me out. Its activities were generally pointless. It would take a full hour of debate just to decide when or where to hold a rally, which is a feel-good, do-nothing exercise, anyway. Meetings would drag on forever in order to accommodate the neuroses of the participants and to ensure that the proceedings observed the norms of “inclusivity”—pronouns would be announced to comrades during introductions, there was a weird obsession with “feminist procedures,” and applause was forbidden.\nThere’s a point at which an environment becomes so “inclusive” that it’s just completely alienating for average people. On a couple of occasions, I convinced a fellow worker to come along to a meeting. Afterwards, I received a polite “thank you,” followed by an apologetic admission that “this just isn’t my crowd”—he didn’t fit in with the college kids, professors, and green-haired activists, whose fashionable intersectionality dominates DSA meetings.\nI took my friend Joey to a DSA meeting in Queens. Joey is a nice guy, a transplant from Ohio, smart, but not especially politically engaged—by which I mean, he is not as extremely online as the typical DSA member. As it happened, the meeting I attended with Joey was documented by Simon van Zyulen-Wood in his epic profile of NYC-DSA for New York magazine:\nA little later, a health-care coordinator for DSA’s socialist-feminist working group took the floor. In November, thanks in part to DSA-friendly candidates, the Democrats fully took control of the New York State Senate for the first time in a decade. “Who knows how many years out of the last 50 years have the Democrats had the majority?” she asked. A middle-aged guy in a green pullover held up three fingers in A-okay formation. He was correct, but she wasn’t pleased. “I see you’re trying to answer that question, but that is a white-supremacist hand signal.”\nApparently, “Excuse-Me-The-OK-Hand-Signal-Is-Actually-Fascist” is common knowledge among this subset of incredibly online dorks. Not to me. In fact, I almost got out of my seat to defend the poor man, who had just been put down in front of the entire room for correctly answering the speaker’s question. The Queens branch meeting was otherwise dull and uneventful; there was a lot of talk about theory and praxis and fascism, and how to “bring an end to capitalism.”\nAfter the meeting, Joey and I went to a nearby bar. He ordered a Bud and I got an Old Fashioned and we sat at a corner table beneath a skylight and discussed the meeting. Joey said he had found the whole experience depressing. It wasn’t the tedium typical of meeting proceedings that bothered him—we are both active union members, so we’re used to that. What turned him off was the atmosphere. “To be honest, I didn’t understand a lot of what was said,” he told me. “It was a bunch of nerd shit. I got the gist of what they were saying but it made me cringe. Especially the part where that old dude got yelled at for being a white supremacist for using an okay sign. What was that all about?” I asked him if he’d come back to another meeting. “No thanks,” he replied.\nOn another occasion, I invited four male colleagues, one of whom is black, to attend a DSA meeting with me. All were perturbed by the ramblings of the activists there. Surely, a group dedicated to the empowerment of the working class must recruit from the working class. And if the environment is hostile to the sensibilities of the working class, how likely is it that recruitment drives will succeed? My fellow union workers and I realized that these people don’t care about the plight of America’s blue collar workforce at all—DSA meetings are simply stages for the radical posturing of white middle class college kids, plagued with guilt about their own privilege.\nNowhere was this more evident than at this year’s DSA National convention, held in Atlanta between August 1 and 4. On a couple of occasions, delegates shamed white men for having the audacity to speak, and a clip of a man invoking his anxiety to get people to stop talking went viral on social media:\nmeanwhile at the dsa pic.twitter.com/Ht87uWI6Re\n— Pavel (@Osama_BongLaden) August 4, 2019\nOn the second day, another comrade made a similar plea, and this time identity was invoked along with disability:\nTwo comrades—a person of color and a woman—were talking, and people were having a discussion while they were talking. It’s completely disrespectful, and a lot of our folks with disabilities have asked multiple times—multiple times!—the last two days, for folks to contain their conversations so folks could actually get their information from our other comrades, to make democracy work here.\nDuring the opening session on day three, someone got up to announce that they were sick and tired of hearing identity being used “as weapons over and over again in this room” (oh good, I thought) by ”white men” (oh no, I thought) who had been advising her what she could say during a debate.\nThe clips of the convention were laughed at all over social media and DSA now appears to have removed most of the video of the conference from YouTube. But the behavior there was not unusual—this obsession with race and gender and who knows what other protected characteristics, bleeds into everything DSA does. If you had polled the room for members with an undergraduate degree, every hand would shoot up. If you had polled how many have or are in the process of receiving a PhD, “only” about half the attendees would have raised their hands. The sort of language and tone policing on display could only concern people who find shelter in stacks of books, about which they write an unreadable paper every two weeks. I doubt even 50 of the 1,000 people who attended the conference work in the building trades or mining or auto manufacturing or fast food or retail. What do these people know about life at the sharp end of capitalism?\nTo be blunt, DSA has a race and gender problem, and the problem is white men. At every meeting, white men were expected to sit in obedient silence as matters of importance were discussed; a parliamentary procedure called “progressive stack” (which will be familiar to those who remember Occupy) discourages white men from speaking, regardless of the validity of their point, and promotes people of color and women to share their thoughts, no matter how inane those thoughts are. We have a term for this kind of policy—“racial discrimination.”\nIt ought to be possible to ensure people of color and women have a fair say without actively suppressing the voices of others. But the white men in attendance were not about to make a suggestion like that. Instead, when they were permitted to speak, they verbally flogged themselves before the assembled delegates like terrified religious fanatics confessing sins—white men suck, white men are terrible, white men are oppressive, we must do better, and so on.\nMy union friends were horrified. While these people spend hours reproaching themselves and each other, real people in America are suffering real hardship. But DSAs are too busy gazing at their navels to notice. Do these people really believe that the average person cares what pronoun someone uses? Identifying yourself as a person should be enough to deserve respect, plain and simple—why needlessly divide the working-class into competing identity groups? How is that supposed to produce solidarity?\nI really tried to engage with the Democratic Socialists of New York. I went to their meetings, stood at picket lines with my fellow comrades, and even tried recruiting new members for the organization. But my efforts were for nothing. It was all overshadowed by the frivolity of its well-educated, anti-social, self-absorbed members. My efforts to recruit were futile and, in the end, I had to face the fact that the whole experience had been a depressing waste of time.\nDSA is doomed. It will not be the vanguard of a proletarian revolution, or any revolution at all, for that matter. You may dismiss this testimony as anecdotal griping, but the conversations I’ve had with several fellow travellers scattered across the country, not to mention the ludicrous antics at the 2019 convention, suggest that my experience is representative. DSA is too educated, too privileged, too elitist. It’s a systemic problem. If DSA wants to help transform America into the country Saul Alinsky envisioned, then it needs to learn to listen to America’s working-class. At the moment, its members are hardly aware it exists.\n \nArchie Carter is a construction worker from Queens. When he’s not at union meetings, he’s watching the Mets blow a lead.","language":"text/plain","encrypted":false,"added":1565466378}],"comment":[]}