{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1557456427,
			"title": "Wikipedia on Zeronet?!",
			"body": "Am I missing something or is there no Wikipedia like project on Zeronet so far? How about importing Wikipedia to Zeronet first and afterwards let users create their own Wiki projects ...",
			"added": 1557456426
		}
	],
	"topic_vote": {
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "> [caryoscelus](#comment_132_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Even with many people, it shouldn't be too hard to find a peer with least delay; you may need to run a lot of nodes to make sure you get the origin, but i wouldn't call that next to impossible. But then, with current 0net scale, \"a lot\" isn't even that much for someone really interested. [...]\nWell, then put a proxy before it or convince a currently running streaming platform allowing to stream Stream with Zeronet it might make it a bit harder. Or build a decentralized proxy service which runs in front of it ...",
				"added": 1555772777
			},
			{
				"comment_id": 2,
				"body": "Btw. what happens to streams after they finish for later view?",
				"added": 1555792424
			}
		],
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": [
			{
				"comment_id": 3,
				"body": "From a technical standpoint Wikipedia is a n attractive project to implement with Zeronet\n\n * It is a huge database > 20TB - Does Zeronet need compression?\n * What to do with TBs of images, videos and other stuff?\n * How to handle editing, versioning and mass editing on a decentralized network?\n * How and where to archive its data?\n * How to make mass editing impossible or at least controllable?\n * What about other open databases like Project Gutenberg or TED eg. ?\n * ... ?\n\nSolving those and more challenges will be a proof-of-concept that Zeronet actually works.\n\nIt also has benefits for the network itself. People could publish articles on information censorship free. Moreover, it probably attracts more people to the network\n\n# Links:\n\n * https://dumps.wikimedia.org/\n * https://en.wikipedia.org/wiki/Wikipedia:Database_download#Where_do_I_get_it?\n * http://www.gutenberg.org/wiki/Main_Page",
				"added": 1557505033
			}
		],
		"1557692538_18yjuvi7DyL85Rip57MiXEcGhkgCv2rHT2": [
			{
				"comment_id": 4,
				"body": "> [netshadow](#comment_1_19Bfpqvp3wfoWyyUcnwTjY6KswDGd2AifC): This response is off-topic.\nYou can just mute people by hovering the message and press the three dots to the upper right :)",
				"added": 1557694622
			}
		]
	},
	"comment_vote": {
		"3_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1
	}
}