{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1575014742_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1574925072_1D5iCU5XE1D25ce2fV2XZqH95jGRtRaKZL": [
			{
				"comment_id": 4,
				"body": "> [randomshits](#comment_267_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): I didn't know that was a different site, thanks!\n\nsupport cryptoid DECENTRALIZED login, this is very important as zeroid login is CENTRALIZED.\n\nAnd I had a problem in month 10 or 9 just now, so I decided to change it in kopy kapte big and try to add more features like block button, support for playlists, support for a video player that allows you to add videos with more than 1 audio and subtitles.\n\nThis is about the new player, which I will try to add to big kopy kate 2 in the future, it is not a priority for me, but I will try to add as soon as possible, since this makes it much easier, because there are many people who like subtitles and other dubbed movies. , and if the site has support for videos with 2 audios or more and even subtitle support, this will make it easier for more people to keep the file.\n\nCurrently the changes in big kopy kate 2 are:\n\nCryptoid decentralized login support.\n\nI already had support for zeroid, which is centralized.\n\nSupport for mp3, mkv files, apart from support for files that the site already had.\n\nI already had support for mp4, m4v and webm formats.\n\nSupport sending files up to 15GB.\n\n\n\n====================================================\noriginal pt-br \n\nsuporte o login DESCENTRALIZADO cryptoid, isto é muito importante, pois o login do zeroid é CENTRALIZADO.\n\nE tinha dado problema no mês 10 ou 9 a recem, e dai eu resolvi mudar isto no kopy kapte big e tentar adicionar mais features como botão block, suporte a  playlists, suporte a um player de video que possibilite tu adicionar videos com mais de 1 audio e legenda.\n\nEstá questão do player novo, que vou tentar adicionar ao big kopy kate 2 no futuro, não é prioridade para mim, mas vou tentar adicionar o quanto antes , pois isto facilita muito, pois tem mutia gente que gosta de legenda e outros de filmes dublados, e dai se o site tiver suporte a videos com 2 audios ou mais e ainda suporte a legenda, isto vai facilitar para mais gente manter o arquivo.\n\nAtualmente as mudanças no big kopy kate 2 são:\n\nSuporte a login descentralizado cryptoid.\n\nJá tinha suporte ao zeroid, que é centralizado.\n\nSuporte a arquivos mp3, mkv , fora o suporte aos arquivos que o site já tinha. \n\njá tinha suporte aos formatos mp4, m4v and webm.\n\nsuporte a enviar arquivos de até 15GB.",
				"added": 1575050884
			}
		],
		"1575014742_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "cool :D\n\nsaw I deleted ALL my videos from the caropc10 channel, I will send ALL back on the caropc11 channel :).\n\nBecause I modified the big kopy kate 2 again, to leave the file data.json in the size of 2mega, not to BUG and everyone gets the videos right\n\nThank you for your help.\n\n================================\noriginal pt-br \n\nviu deletei TODOS meus videos lá do canal caropc10, vou enviar TODOS de volta no canal caropc11 :).\n\nPois modifiquei de novo o big kopy kate 2 , para deixar o arquivo data.json no tamanho de 2mega, para NÃO BUGAR e todos recebem os videos direitinho\n\nObrigado pela ajuda.",
				"added": 1575025024
			}
		],
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": [
			{
				"comment_id": 5,
				"body": "Big Kopy Kate 2\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home\n\n\nHere is a place for music, videos, free on the internet.\n\nHere you can post WHAT YOU WANT, because admin WILL NOT DELETE ANYTHING.\n\nThe only thing admin will do is add the blocking function individually, and EACH will have to block channels that find the content offensive.\n\nOther than that the content WILL STAY IN THE AIR even when the content owner wants it.\n\nFor we believe that there is no half freedom.\n\nEither you allow ALL to express yourself, or there is no freedom.\n\nThis site currently supports two login systems, decentralized cryptoid and centralized zeroid.\n\nSupport mp3, mp4, mkv and etc\n\nWelcome to the internet as it was in 1998, even better, because here the content will be in the air until there are no seeds for files, websites and etc.\n\n=================================\noriginal pt-br\n\naqui um lugar para musicas, videos, livre na internet.\n\nAqui podem postar  O QUE QUISER, pois o admin NÃO VAI DELETAR NADA.\n\nA unica coisa que o admin vai fazer é adicionar a função de bloquear o usuário individualmente, e CADA UM vai ter que bloquear os canais que achar o conteudo ofensivo.\n\nFora isto o conteudo VAI FICAR NO AR até quando o dono do conteudo queira.\n\nPois acreditamos que não existe meia liberdade.\n\nOu você permite TODOS, se expressar, ou não existe liberdade.\n\nEste site está com suporte a dois sistemas de logins atualmente , o cryptoid descentralizado e o zeroid centralizado.\n\nSuporte a mp3, mp4, mkv e etc\n\nSeja bem vindo a internet como era em 1998, alias melhor ainda, pois aqui o conteudo vai ficar no ar até que não tenham seeds para os arquivos, sites e etc",
				"added": 1575179624
			}
		]
	},
	"comment_vote": {
		"264_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"5_1JYuNAwYAcQXhGRZKMGFGgBvvFi6F9yC7m": 1,
		"45_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"1379_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}