{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Vaccins Obligatoires en France",
			"body": " Article L. 3111-2\n\n\n« I.- Les vaccinations suivantes sont obligatoires, sauf contre-indication médicale reconnue, dans des conditions d'âge déterminées par décret en Conseil d'Etat, pris après avis de la Haute Autorité de santé :\n1° Antidiphtérique ;\n2° Antitétanique ;\n3° Antipoliomyélitique ;\n4° Contre la coqueluche ;\n5° Contre les infections invasives à Haemophilus influenzae de type b ;\n6° Contre le virus de l'hépatite B ;\n7° Contre les infections invasives à pneumocoque ;\n8° Contre le méningocoque de sérogroupe C ;\n9° Contre la rougeole ;\n10° Contre les oreillons ;\n11° Contre la rubéole.\n\nII.- Les personnes titulaires de l'autorité parentale ou qui assurent la tutelle des mineurs sont tenues personnellement responsables de l'exécution de l'obligation prévue au I. La preuve que cette obligation a été exécutée doit être fournie, selon des modalités définies par décret, pour l'admission ou le maintien dans toute école, garderie, colonie de vacances ou autre collectivité d'enfants.\n\nNOTA : Conformément à l'article 49 III de la loi n° 2017-1836 du 30 décembre 2017, le II de l'article L.3111-2 du code de la santé publique, dans sa rédaction résultant de la présente loi, est applicable, en ce qui concerne les vaccinations mentionnées aux 4° à 11° du I du même article L.3111-2, à compter du 1er juin 2018 et aux personnes titulaires de l'autorité parentale ou qui assurent la tutelle des enfants nés à compter du 1er janvier 2018. »\n\nArticle L. 2132-1 (non modifié)\n« Le carnet est établi au nom de l'enfant. Il est remis aux parents ou aux personnes titulaires de l'exercice de l'autorité parentale ou aux personnes ou aux services à qui l'enfant a été confié. Ils doivent être informés que nul ne peut en exiger la communication et que toute personne appelée, de par sa fonction, à prendre connaissance des renseignements qui y sont inscrits est soumise au secret professionnel. »\n\nL'article L3116-4, qui prévoyait six mois d'emprisonnement et de 3 750 euros d'amende pour refus de vaccinations obligatoires est abrogé par la loi n°2017-1836 du 30 décembre 2017 - art. 49\n\nArticle L.3131-1 \n« En cas de menace sanitaire grave appelant des mesures d'urgence, notamment en cas de menace d'épidémie, le ministre chargé de la santé peut, par arrêté motivé, prescrire dans l'intérêt de la santé publique toute mesure proportionnée aux risques courus et appropriée aux circonstances de temps et de lieu afin de prévenir et de limiter les conséquences des menaces possibles sur la santé de la population... »\n     \nArticle L.3131-3\n« Nonobstant les dispositions de l'article L. 1142-1, les professionnels de santé ne peuvent être tenus pour responsables des dommages résultant de la prescription ou de l'administration d'un médicament en dehors des indications thérapeutiques ou des conditions normales d'utilisation prévues par son autorisation de mise sur le marché ou son autorisation temporaire d'utilisation, ou bien d'un médicament ne faisant l'objet d'aucune de ces autorisations, lorsque leur intervention était rendue nécessaire par l'existence d'une menace sanitaire grave et que la prescription ou l'administration du médicament a été recommandée ou exigée par le ministre chargé de la santé en application des dispositions de l'article L. 3131-1.\n\nLe fabricant d'un médicament ne peut davantage être tenu pour responsable des dommages résultant de l'utilisation d'un médicament en dehors des indications thérapeutiques ou des conditions normales d'utilisation prévues par son autorisation de mise sur le marché ou son autorisation temporaire d'utilisation, ou bien de celle d'un médicament ne faisant l'objet d'aucune de ces autorisations, lorsque cette utilisation a été recommandée ou exigée par le ministre chargé de la santé en application de l'article L. 3131-1. Il en va de même pour le titulaire de l'autorisation de mise sur le marché, de l'autorisation temporaire d'utilisation ou de l'autorisation d'importation du médicament en cause. Les dispositions du présent alinéa ne les exonèrent pas de l'engagement de leur responsabilité dans les conditions de droit commun en raison de la fabrication ou de la mise sur le marché du médicament. »\n",
			"added": 1586278682
		},
		{
			"topic_id": 2,
			"title": "5G en France?",
			"body": "Prêt à être irradié? ",
			"added": 1586362633
		},
		{
			"topic_id": 3,
			"title": "Roman Polanski, France tous complice?",
			"body": "Quelle honte que le peuple francais soutienne Roman Polanski. Celui-ci a admis avoir mis un somnifère dans un verre de champagne d'une fille de 13, pour ensuite la violée et la sodomisée.\n\nQuelle honte ce pays, ce peuple de bouffons.\n\nUn pays du tiers monde, un pays de cons, de petits peteux prétencieux incapable de réaliser que c'est que des merdes dirigiés par une bande d'enculés de première classe.\n\nQuelle honte...\n\nsi j'etais président des usa j'aurais mis une raclée sans précédent au peuple francais, je vous aurais defonsé, jusqu au derniers de ces petits ..s de merde.\n\nallez vous faire foutre, pour moi c'est un pays de sous merde.",
			"added": 1586420036
		},
		{
			"topic_id": 4,
			"title": "Sale fils de putes qui mettent en prison des gens pour de la ganhja, du cannabis et du hashish",
			"body": "Vous étez que des merdes.\n\nfranchement, tiers mondiste. \n\nincapable et prétentieux, tout le temps dans l'arrogance et le mensonge...\n\net incapable de lire la génèse...\n\nfuck la france.\n\net justice d'enculés, qui se met en vacances tout le temps...\n\njustice... arretez des gens pour utiliser une plante de la création et qui protège des pédophiles comme roman polanski...\n\nhonte a vous.\n\net honte a moi d'utiliser un language de sous hommes.",
			"added": 1586420164
		}
	],
	"topic_vote": {
		"3_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": 1,
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 1,
				"body": "> [fckinwhitefox](#comment_2_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4): https://www.aubedigitale.com/le-danemark-vote-une-loi-autorisant-les-vaccinations-forcees-contre-le-coronavirus/\n\nhttps://www.infowars.com/la-doctor-uses-hydroxychloroquine-and-zinc-to-treat-covid-19-patients/\n\n>A Los Angeles, California doctor claims his COVID-19 patients are going from “very ill” to “symptom-free” in 8 to 12 hours using a treatment consisting of a combination of zinc and hydroxychloroquine.\n\n>Explaining how hydroxychloroquine works in collaboration with zinc, Dr. Cardillo says the drug “opens the zinc channel” and allows it to enter the cell where it then “blocks the replication of cellular machinery.” \n\n\n",
				"added": 1586362455
			},
			{
				"comment_id": 7,
				"body": "convaincu de quoi? que les danois c est des petits bouffons? je le savais deja ton article... faut lire zerohedge mon grand... tu seras moins dans le lag :).\n\nles pays nordiques :) ca c est le fruit de la propagande. ils sont complement a la masse. t es pas au courant des affaires de viols sur mineurs commis par les rapefugees? l'invasion de la suede. \n\npar exemple la suede et ikea, tu sais toutes les petites bouffonnes revent de vivre dans une pub ikea? tu sais que les sapins qu'ils vendent sont ceux qui ont ete le plus exposé a tchernobyl? eheheheh. c'est des connards.\n\napres faut voir quand les gisements energetiques de la norvege vont se vider. la ca va devenir interressant de voir leur systeme... \n\nfinalement, ils avaient jusqu a recemment un petit air de superiorité car ils regardaient la télé en anglais, et donc se croyaient superieur...\n\nregardes ou est nokia? je les vois pas. leur volvo ? en gros ils se sont fait posé par un feminisme socializant incapable d etre competitifs au niveau mondial...\n\nenfin moi je suis pas fan.\n\nje suis curieux en quoi c est pas etonnant pour toi?\n\n",
				"added": 1586590640
			}
		],
		"2_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4": [
			{
				"comment_id": 2,
				"body": "zinc...",
				"added": 1586362517
			},
			{
				"comment_id": 3,
				"body": "les \"merdias\" :).",
				"added": 1586362690
			}
		],
		"1_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4": [
			{
				"comment_id": 4,
				"body": "les talibans ont gagnés... \n\nce qu'il faut comprendre c'est que seule la lutte armée permettra de mettre fin à cette tyrannie usant du médicale pour assoire sa suprémacie.\n\navec ces gens il est impossible de discuter. leurs objectifs sont clairs et limpides. \n\nont ils protégés roman polanski ? oui\nmettent-ils des gens en prison pour de l'herbe? oui\n\nmais page, je suis pas certain pour le lolita express, par contre eric schmidt... lol... il avait ses propres esclaves sexuelles mineures d'après certaines sources... \n\noui oui, ils nous haissent, veulent nous ruiner, veulent nous dominer et nous réduite en fermage, pire que des poulets indusriels...\n\nheureusement, la lutte armée est toujours possible...\n\nmais bon le francais de base c'est une petite merde shooté au sullphites... donc peu d'espoir... obeit, conformes toi... va a abattoir... et laisse ta fille se faire violer par les forces d'occupations qui se pretendent être un gouvernement.\n\ntellement marre de cette mentalité de petits cons soumis, pretendant comprendre, alors qu'en réalité c'est que des petits esclaves ignares badigoné d'une culture depassé et en perdition...\n\nfuck france.\n\nou plutot les francais ne méritent plus de vivre en france...\n\ncela reste un beau pays...\n\nca va juste pas etre possible d'en faire un pays de la loi islamic... \n\nqui va le prendre?\n\n",
				"added": 1586420875
			}
		],
		"1_14ixt7XngjiiqDEqjMdvTLWoJE2s9cV1ZB": [
			{
				"comment_id": 5,
				"body": "LoL... pourquoi pas... J aime pas le notre dans ta phrase... je trouve ca tres debile comme facon de parler. ta maniere de vivre a changer. n essaie juste pas de m inclure dans ton systeme de pensee.",
				"added": 1586590253
			}
		],
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": [
			{
				"comment_id": 6,
				"body": "nope, y a que des petits bouffons supportant toute ideologie liberticide completement lobotimize par un systeme de pensee desuet qui se rattache a une langue pauvre en idee mais riche en regles :). \n\nbonne chance.",
				"added": 1586590340
			}
		],
		"3_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 8,
				"body": "tellement vrai, et les ignares incapable de le voir... c est foutu ce pays.",
				"added": 1586590678
			}
		],
		"13_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 9,
				"body": "faudrait enlever la majuscule a france, en effet un pays qui arrete des gens alors qu ils utilisent une plante, un pays qui protege roman polanski, un peuple complement con, je veux dire, ca ne merite meme pas d etre un pays.\n\n",
				"added": 1586590759
			}
		],
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 10,
				"body": "Merci mrfahr, merci à toi premierement d avoir lu ce message. deuxiement un encore plus grand merci, tu me rappelles pourquoi cela ne sert a rien de parler ou d ecrire en francais avec des francais... un peuple de soumis protecteur de polanski arretant des petits fumeurs d herbes... alllez va regardez plus belle la vie... et t'en fait pas y assez de merde en france pour occuper la police sans devoir lutter contre les stups... ahahahahha.\n\nquelle bande de losers.",
				"added": 1586590881
			}
		],
		"2_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 11,
				"body": "www.infowars.com\nwww.banned.video\nwww.zerohedge.com\nwww.naturalnews.com\nwww.brighteon.com/channels/hrreport\n",
				"added": 1588703590
			}
		]
	},
	"comment_vote": {}
}