{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565801544,
			"title": "is 08chan down for everyone?",
			"body": "Or is it just me? I keep getting a malformed database error",
			"added": 1565801543
		}
	],
	"topic_vote": {
		"1565801544_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9": 1,
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1565801544_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9": [
			{
				"comment_id": 1,
				"body": "Server error\nErr: DatabaseError: database disk image is malformed in UiServer.py line 103 > UiRequest.py line 152 > UiConfigPlugin.py line 21 > ContentFilterPlugin.py line 216 > UiRequest.py line 358 > SiteManagerPlugin.py line 65 > SiteManager.py line 150 > Site.py line 54 > OptionalManagerPlugin.py line 61 > ContentManager.py line 34 > ContentDbDict.py line 18 > ContentDb.py line 112 > Db.py line 75 > DbCursor.py line 82",
				"added": 1565801566
			},
			{
				"comment_id": 3,
				"body": "> [pexo](#comment_127_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Do you get an white screen with just that error or is it some popup error?The popup thing should be fixed with the rebuild that @ayra mentioned. If not, you likely need to backup your users.json, take note of what zites you currently have, shutdown ZeroNet, delete your ZeroNet-data folder, restart ZeroNet, shut it down again, swap the new users.json with your old one and finally start ZeroNet again. This, in general, will solve most of the issues you may run into. Alternatively you can add db_mode = security in your zeronet.conf file to lower the chances of that happening again.\n\nthank you, bby. I pretty much wanted to know whether I should reinstall or not.",
				"added": 1565804622
			}
		],
		"1565770181_1FqEEdpNCYZJfnpyNWJqE4hgXtWNu5vgz5": [
			{
				"comment_id": 2,
				"body": "Not soon enough",
				"added": 1565801874
			}
		],
		"1565811747_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 4,
				"body": "> [wejehteman2](#comment_14_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): The Nazis had 3 components. Socialism, Nationalism, and White Supremacy. Modern alt right only has one of those three. The modern alt right is made up of Nationalism and White Advocacy. Which is actually pretty open ended. In that way I would say Nazis fall into the category alt right but being alt right doesn't make you a Nazi at all. It's like saying Hitler is a human but being a human doesn't make you Hitler.\n\nThe nazis wern't socialists.\n\nThis is historical revisionism; The night of the long knifes was carried out against the actual socialist (those who wish to establish a society based on democratic control of production) wing of the Nazi party.\nFurthermore, Hitler was famous for decrying Communism as a Jewish conspiracy.\nHe was also famous for his repression of the German socialists and violently destroying unions in Germany.\n\nHe even gave massive hand outs to American corporations in Germany.\nAnd even went as far as privatizing key industries like the rail industry.\n\nThe word privatization was coined because of The Nazi Party.\nLies, lies, lies,",
				"added": 1565813644
			},
			{
				"comment_id": 5,
				"body": "The \"alt-right\" as you put them are defiantly either: A. Neo Nazis outright, such as the case of 8ch/pol/, or are closeted Nazis; E.G they wont really call them self nazis or racists but they will claim that they are \"National identitiarians\" or whatever other nonsense.\n\nThe fact of the matter is conservatives hold many veiws and opinions nazis take a liking too. (If you can't beat em join em after all.)\n\nSo conservatives are really just being manipulated by the reich wing.",
				"added": 1565813818
			},
			{
				"comment_id": 6,
				"body": "> [nvhgfd7856f8]\n\nSocialists up to that point in history had recognized socialism as collective and democratic ownership of the means of production by the working class. A chicken hawk can dress up like a duck all it wants and it still will never be a duck. Regardless of what you say they wern't socialists, have never been socialists, and will enver be socialists.\n\nYou have no understanding of history. Working class movements all over the world at this point in time viewed socialism as I just defined it. The only reason hitler took up the name of socialism was to influence radicals at the time who probably didn't know better.\n\nITT: dumb fucking Nazis",
				"added": 1565824045
			},
			{
				"comment_id": 7,
				"body": "> [znnex](#comment_16_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): You're an idiot.\n\nbased",
				"added": 1565825694
			}
		],
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 8,
				"body": "Libertarian ideology is no better as the real problem is, actually, capitalism itself.",
				"added": 1565840532
			}
		],
		"1565940672_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 9,
				"body": "Polcucks will receive 15 years in the gulag",
				"added": 1565943217
			}
		],
		"1565969602_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 10,
				"body": "Prostitution cannot exist under communism. Prostitution is an exchange for money. Under communism commodity barriers are broken down and the means of production become collectively owned by the community; Meaning that there is no hoarding of resources that leads to exchange as a necessary general rule of the economy.\n\nEverything is produced for its immediate use and consumption. Prostitution wouldn't exist because exchange and money would no longer exist.",
				"added": 1565972926
			},
			{
				"comment_id": 11,
				"body": "> [xlk](#comment_67_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Shit, I'm leaving China to find a true communist country!\n\nI bet you live in hong-kong anyways",
				"added": 1565972958
			},
			{
				"comment_id": 12,
				"body": "> [xlk](#comment_69_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): The mainland.  But wait, so there is no service industry in communism?\n\nThat's actually dope as fuck. How do you get onto zeronet with the government blocking the interbutts? Do you use a bridge through tor?\nDelete\nAlso, yeah, I mean, you haven't studied marx in school? I know the Chinese government is repressive, but, they make yall read marx I though.",
				"added": 1565973523
			},
			{
				"comment_id": 13,
				"body": "> [fucknigggers](#comment_4_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG): Then make up some other word for it, who cares, you know what i mean.If the basic service from a hair dresser and plumber is free, then it's also the case for prostitution. [...]\n\nIsn't prostitution done because it isn't free? isn't it just having sex at that point?",
				"added": 1565973555
			},
			{
				"comment_id": 14,
				"body": "> [fucknigggers](#comment_5_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG): You can have sex because for procreation, or with your partner out of love, or because both find each other hot and want a quick fuck. [...]\n\nNo.",
				"added": 1565974444
			},
			{
				"comment_id": 15,
				"body": "> [bigbadbob](#comment_301_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Has there ever been an example of a true communist country?\n\nYou can't have communism and countries because the whole idea of a nation state is interrelated to capitalism.",
				"added": 1566029233
			},
			{
				"comment_id": 16,
				"body": "> [polanon](#comment_4_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE): You really have no fucking clue do you. I have lived my whole life in a post Soviet nation. There is nothing more absurd than the \"it wasn't real communism/socialism\" argument.However few they may be, truly free Americans will understand how to start anew as the urban liberal degenerate hellholes slowly decay and fail. And all of your left vs right theater crap will become clear for all to see as the irrelevant distraction that it is.\n\nLmfao, or is it just that retard stalin spent his whole life trying to convice people his shitty social democracy was communism?",
				"added": 1566029314
			},
			{
				"comment_id": 17,
				"body": "> [russianspy](#comment_16_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): Lmfao, or is it just that retard stalin spent his whole life trying to convice people his shitty social democracy was communism?\n\nYou fucking kulaks always make me laugh when you try and pull the \"I live in X soviet state\" That doesn't make you an expert on the subject of Marxism anymore than being an American Makes me an expert on economics.",
				"added": 1566029371
			},
			{
				"comment_id": 18,
				"body": "> [polanon](#comment_5_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE): I've seen and learned enough to have a decent understanding of human nature, it's incompatible with the bullshit utopia kikes have been promising you for at least over a century. If nothing else I can guarantee that yet more useful idiots like you will lead millions away from natural competition and towards cattle like existence and eventual slaughter. And from the perspective of the cattle it won't matter if the butcher ends up being true free men claiming what they can or the kikes that promised you a communist utopia which ends up in Babylon 2.0 and an overproduction of slaves that need culling once in a while.\n\nIf human nature is, as you all say; Greedy and ignorant then why does it follow that we should allow a system which rewards only the most greedy and ignorant of men? Why does it follow that a system that incentivises the worst in man is the system we should have? Even by your failed ass appeal to some spook like \"human nature\" your argument holds no weight what so ever.",
				"added": 1566114899
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 19,
				"body": "Benis",
				"added": 1566114944
			}
		]
	},
	"comment_vote": {
		"127_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"16_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"322_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1
	}
}