{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1573917795_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1574566466_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1574806526_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1574877477_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": 1,
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": 1,
		"1574292051_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"1576246850_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1
	},
	"next_comment_id": 125,
	"comment": {
		"1573574309_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "If you view politics as group movements, sure.\nIf you view politics as the logical development of metaphysics, then no, you are wrong.\nTo ignore the metaphysical facts of reality in favor of \"not being political\" is to rob yourself of the very thing you accuse politics of destroying.",
				"added": 1573633778
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1086_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): and i'm accused to be a robot (A.I.)\n\nWhat is this supposed to mean?",
				"added": 1573636338
			},
			{
				"comment_id": 12,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1089_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): that you're an idiot, and you don't know it.\n\nReduced to insults over a question.\nYou are pathetic.",
				"added": 1573636874
			}
		],
		"1573396729_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "Your anxiety isn't from you, it comes from your inability to deal with a certain aspect of reality.\nFind that aspect, figure out why it scares you, figure out how to mitigate or destroy it, then deal with it.\nCourage and guile in the face of what you fear is the only way to conquer what ails you.",
				"added": 1573634383
			},
			{
				"comment_id": 9,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1085_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Courage and guile [...]\nFuck that spook.",
				"added": 1573636383
			}
		],
		"1573239989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "I have a rifle. This provides me with a small amount of control over the society I live in.\nI may not be able to feasibly control another's actions without a righteous cause but I don't need to control another's actions without one.\nMob rule is destruction. Long live self governance!",
				"added": 1573635026
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_993_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Be careful, in spirituality, we say:    \"Beware of what you wish for    Fools rush in where angels fear to tread.\"you are built around a body, the day this one CHANGES you CHANGE.\n\nThis is disconnected mysticism. Say something comprehensible.",
				"added": 1573635085
			},
			{
				"comment_id": 10,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1083_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): what for?\n\nBecause what you said was disconnected mysticism, therefore it is incomprehensible.\nDo I need to explain to you why saying things that other's can comprehend is good?\nIf I do, I've proved you to be a shit-talking hack, only committed to confusing the weak-willed.",
				"added": 1573636678
			},
			{
				"comment_id": 11,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1084_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"self governance!\" lolgood luck Thoreau\n\nFuck yourself, you communist authoritarian.\nI won't sit idly by as your utopian dream is forced on me and others.",
				"added": 1573636771
			},
			{
				"comment_id": 24,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1091_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i'm \"authoritarian\"poor child, go and complain to your mother\n\nNigger, I care that you being a freedom hating commie not that you said something mean on the internet.\nAs I said before, fuck yourself, you communist authoritarian. Your psudo-philosophical trash has no bearing on reality. You act like a saint while telling people to enslave themselves. You don't simply anger me, you disgust me.\nI wish you would be aggressive towards me. I would find pleasure in crushing you.\n\nUnless you are wiling to fly to the States, I have to settle for calling you lower than trash on the internet when you spout such evil.",
				"added": 1573638798
			},
			{
				"comment_id": 27,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1097_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): zeronet is everything but a democracy thing. good luck with your pursuit.\n\nIf we are to compare zeronet to a type of government rule, that rule would be confederation - a type that I don't entirely disagree with.\nI view pure democracy, as similar to that of European democracy. Europe has mob rule.\nI don't blame you for hating democracy, but your inability to look outside yourself begets your own political failure.\nPure mob rule destroys constitutions and the intimidation won't stop while the men cannot pick up arms and form militia. Democracy didn't just fail, europeans destroyed it through cowardice. There are examples of this throughout your history.",
				"added": 1573639671
			},
			{
				"comment_id": 31,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1098_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're looking for an non-existent paradigm: the self\n\nWhy do you say that?",
				"added": 1573639945
			},
			{
				"comment_id": 32,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1098_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're looking for an non-existent paradigm: the self\n\nactually no. I know what this is and it's fucking bullshit.\n\nJust because not everything is you, does not mean that you don't exist.\n\nIgnoring reality doesn't make it go away.",
				"added": 1573640050
			},
			{
				"comment_id": 33,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1098_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're looking for an non-existent paradigm: the self\n\nWhat a niggardly and manipulative response to what I said.\nPsychoanalyze me all you want but don't fucking lie to me.",
				"added": 1573640159
			},
			{
				"comment_id": 34,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1098_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're looking for an non-existent paradigm: the self\n\nI laugh and insult off all other lies.\nI use irony to poke at most grifters.\nThis lie I do no such thing.\n\nThe reality is blatantly before you yet you refuse it and call all that challenge your assertion deluded.\nAll you need do is look down and the counterargument is laid bare before you.\nAll you need do is listen to your own thoughts for a second to know that you exist.\nAll you have to do is think for a moment to know that you can decide certain things.\nYour mind is twisted, by what I'm not sure. You question the motive of an assertion and not it's veracity.\nYou assert the irrational and the unproven without even an apparent cause.\nWhat sale do you place this bid for?\nTo what end do you believe this achieves?",
				"added": 1573640575
			},
			{
				"comment_id": 35,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1100_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): oh you're a poet\n\nJealous?",
				"added": 1573641592
			},
			{
				"comment_id": 36,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1099_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i don't ignore it, do you?\n\nYou ignore the obvious truth that stares you in the face every day.\nStop lying to me.",
				"added": 1573641805
			},
			{
				"comment_id": 37,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1101_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): not really but thanks for asking\n\n\"I can't accept when my one-liners don't mean anything but I have nothing else to respond with.\"",
				"added": 1573642315
			},
			{
				"comment_id": 38,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1101_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): not really but thanks for asking\n\nAlso it reminds me of \"I'm deathly afraid of being perceived as angry.\"\nAre you that scared of the repercussions of your words?\nThat has to be an incredibly scary way to live.",
				"added": 1573642603
			},
			{
				"comment_id": 40,
				"body": "> [kaar4bears](#comment_67_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): What we need is decentralized power. But HOW?\n\nFederation/Confederation+Every man woman and child armed with a rifle.",
				"added": 1574025033
			},
			{
				"comment_id": 44,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1141_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): and a big one\n\nNigger, what do you mean?\nYou speak english like you learned it in some backwards gook country.",
				"added": 1574025578
			},
			{
				"comment_id": 48,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1144_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i forgot fuck america and their stupid elementary uneducated languagebetter?\n\nNo. The words you use have an imprecise meaning, you lack any form of punctuation or capitalization and you are a poor rhetorician.\n\nThe use in the structure of English is the precision in meaning. \nIf you actually know what you are doing, and have the vocabulary to back it up, you can make insults sound refined and poignant and not just condescending.\nThis may come as a shock but elder worship is mocked here. Turns out, old people, while more knowledgeable in general, have weaker wills on average which makes them easy targets for intimidation and confusion. Relying on your age is a dirty trick that works on the young only a couple of times until they get sick of it and challenge you. It's much better to argue the veracity of a contentious point.",
				"added": 1574028934
			},
			{
				"comment_id": 49,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1144_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i forgot fuck america and their stupid elementary uneducated languagebetter?\n\nThink of it like this: The fundamental building block of English is the Subject(s)->Verb->Object(s)\n\nThere is only one verb in each block. There can be more than one adverb, or verb description, but not more than one verb.\n\nEach of these blocks must be separated with a conjoining word, such as \"and\", \"because\", \"for\", \"while\", and so on. \n\nGood english makes precise claims or questions about something doing an action to something else.\n\nTake your english for example. The proper way of writing that would be:\n\nI forgot, fuck America and their stupid language. It is elementary and reveals their lack of education.\n\nYou need commas to separate the different subject->verb blocks. Also, educated is a verb and you can't have two verbs in one block.\n\nI don't think block is the scholastically correct word for it but the principle is correct nonetheless.",
				"added": 1574029931
			},
			{
				"comment_id": 50,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1146_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): The wording of the sentences in English has been perverted over the past two hundred years. Read old books in English, you'll see what I'm talking about.The vocabulary, followed, this fall of the language, by decreasing in variety, to finish where it had begun; [...]\n\nThe basic grammatical structure of English and it's rules haven't changed in 200 years. More is commonly implied in British English but the fundamental syntax isn't that different.",
				"added": 1574030090
			},
			{
				"comment_id": 51,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1146_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): The wording of the sentences in English has been perverted over the past two hundred years. Read old books in English, you'll see what I'm talking about.The vocabulary, followed, this fall of the language, by decreasing in variety, to finish where it had begun; [...]\n\nI mean, I don't know if you know this, but I had to read Shakespeare in school. That's a few centuries older than the 19th.",
				"added": 1574030488
			},
			{
				"comment_id": 54,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1148_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Not the grammar, the way the sentences are made.You don't have to go back as far as Shakespeare,to see the extent of the 'disaster on the English Language': [...]\n\nWith the advent of radio, people tend not to read as many novels anymore. This kind of highly descriptive writing is much more valued when you can't see or hear the details of a story. \nI get that you don't like the concept of obsolescence but it is more valuable in many cases to be blunt and precise rather than paint a picture especially given the fact that we can all paint pictures more quickly and easily now than ever and share them in ways the people of the 19th century could only dream of.",
				"added": 1574032415
			},
			{
				"comment_id": 56,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1151_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"With the advent of radio, people tend not to read as many novels anymore.\"You can't change your nature. It is not the fault of the technologies; a technology is neutral. [...]\n\nUnless you explain to me exactly what the fuck your point about English's alleged deterioration is, so that it can be quantified or qualified by some metric, I have to assume you are being intentionally retarded solely to provoke me.",
				"added": 1574034670
			}
		],
		"1573119782_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "To speak freely benefits oneself through the export and subsequent legitimization of one's thoughts.\nThis allows rational structures to be constructed and large problems to be solved.\n\nThat being said, this idea that you are some great religious speaker is over-congratulatory hogwash. You didn't answer the question, the most you could muster was \"free speech was decentralized\". Hell, anyone could tell you that. You demonstrated an aspect of speech, not the benefit it has for people.",
				"added": 1573635691
			},
			{
				"comment_id": 6,
				"body": "> [maozedong1](#comment_9_1Q5QuuT62rrmmMVZ2yXg3LgRHwhUJtugkr): Free speech isn't good, actually. Why should I have to listen to the views of those of whom I oppose? They should be silenced because they're wrong.\n\nThe thing is, you don't have to listen to them. That's the point of freedom.\nThe fact that you haven't assumed this, stuns me.\nAnd if you don't like what I've said, and try to \"silence\" me, I'll shoot you down in the street like the dog you are.\nRemember that the next time you challenge a free man's right to speak.",
				"added": 1573636067
			},
			{
				"comment_id": 13,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1088_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you really live in your bubblei presume you're a member of these young generations\n\nYou English is bad so I assume you live in Europe?\nThat would explain your dislike or misapprehension of freedom.",
				"added": 1573636992
			},
			{
				"comment_id": 14,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1087_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): ... \"You demonstrated an aspect of speech\" [...]\n\nI don't have a psychiatrist I actually want to deal with my problems.",
				"added": 1573637025
			},
			{
				"comment_id": 22,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1092_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you don't have any, but you create some\n\nWhat exactly do you mean by \"create problems\".\nDo you think that having an opinion is a problem?\nJesus you're fucking lost.",
				"added": 1573638176
			},
			{
				"comment_id": 26,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1094_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): there are four words too many\n\nNo actually there are too few. You assert blindly out of some fascination with Freud. You act as if what you say can have no bearing on reality and mean something. Even further you view those that try to clamp anything down as stupid. You are below the lost. You are Satan incarnate.\n\nFuck yourself, you snake oil peddler.",
				"added": 1573639093
			}
		],
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 7,
				"body": "nope.\nI coomed on the first.",
				"added": 1573636129
			}
		],
		"1573407833_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 15,
				"body": "Mea virga magnum.",
				"added": 1573637104
			}
		],
		"1573412254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 16,
				"body": "I disagree, but not entirely. I think that peace at the cost of self respect also creates conflict.\nMany people today trade self respect so as to avoid conflict.\nAt a point this paradigm shifts and they start to value their self respect more than their safety.\nThe want to gain back the lost self respect is why people troll and start fights.\nAt the heart of it is the right of self determination.",
				"added": 1573637409
			},
			{
				"comment_id": 21,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1033_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"\"human drive\" isn't strong enough to shape society\" yes and no.We have at least the example of Egyptian civilization in its glorious times. Which has nothing to do with the official timing of the said story.But I remain convinced that for that to happen, we need a caste organization, which is what they had.Today the caste structure would not bring anything, as mental degeneration has invaded every nook and cranny of society.But civilizations are passing and there will be another one behind. I hope higher than the one we are living.\n\nBecause the Egyptian civilization hasn't been subjugated for more than two millennia.\nLets just be like them.",
				"added": 1573637935
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 17,
				"body": "If I lived in Europe I'd want to kill myself too.",
				"added": 1573637531
			},
			{
				"comment_id": 18,
				"body": "> [kaar4bears](#comment_50_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): You know what would solve everything? A few million dollars in cash. I wouldn't have to struggle at work, I could buy some comfortable digs, I could afford developing a hobby, I could even move out to a better country, I could pay for a cook to prepare healthy meals for me every day, I would have private medical care... I think it's the same for many many people\n\n\"It's the economy, stupid.\" Remains true now and forever.",
				"added": 1573637598
			},
			{
				"comment_id": 19,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1035_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"A few million dollars in cash\", it helps, but that won't solve your problems. you want me to tell a story; I worked for one of the richest women in Europe. This woman was a bundle of neuroses together. A real pathological case. Money does not solve anything, like sex, like any drug.\n\nYou're talking about Merkel, aren't you?",
				"added": 1573637706
			},
			{
				"comment_id": 20,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1034_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it's logical. you're exhausted as i explained you before. until you want something different for your life, you will be miserable and exhaust your physical resources, particularly nervous.\n\n\"Don't solve your problems just change what you want out of life. Lower your expectations and you will just be happy. SLEEEEeeeep. SLEEEEEEeeeeeeeeeeeep.\"",
				"added": 1573637781
			},
			{
				"comment_id": 23,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1093_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): happiness won't get you anymoreanymore close to happiness lol\n\nYou're fucking retarded for saying this.\nDoes anyone that lives in a free country buy your bullshit?",
				"added": 1573638253
			},
			{
				"comment_id": 25,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1095_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): yes and they're very happy with that doctrine,but i won't invite you in it.\n\nYou might fool them with that assertion, but not me.",
				"added": 1573638853
			},
			{
				"comment_id": 28,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1096_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): because you're so smart, don't you\n\n*aren't\nnot don't",
				"added": 1573639716
			},
			{
				"comment_id": 29,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1095_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): yes and they're very happy with that doctrine,but i won't invite you in it.\n\n\"I won't invite you in it\"\n\nOh noes!",
				"added": 1573639759
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 30,
				"body": "\"do it faggot\"",
				"added": 1573639810
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 39,
				"body": "ZERONET ISN'T DEMOCRATIC\nZERONET IS ANARCHIST\n\nFUCK THE CHINESE COMMUNIST PARTY",
				"added": 1574024908
			},
			{
				"comment_id": 43,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1142_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): AND FUCK THEM HARD\n\nHello fellow liberals.",
				"added": 1574025482
			}
		],
		"1573157871_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 41,
				"body": "Filthy communists, all of you.\nYou should be ashamed of yourselves.",
				"added": 1574025118
			}
		],
		"1573960157_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 42,
				"body": "Oh look a communist shill saying there is no such thing as real communism.\nHow's the CCP membership treating you these days, wretch?\nStill upset that the sons of liberty will fight before they submit to tyranny?",
				"added": 1574025394
			}
		],
		"1573772721_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 45,
				"body": "> [totaldarkness](#comment_1_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer): I was sent here by the Dark Lord... to observe.\n\nNo you weren't. You just said that to sound edgy and interesting.",
				"added": 1574025763
			}
		],
		"1573908669_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 46,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1132_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): freedom does not existyou're bored that's all [...]\n\nTell me again how you aren't a filthy communist shill?\nI mean, you sure do sound like a corrupted communist shill.",
				"added": 1574025859
			},
			{
				"comment_id": 47,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1143_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you sure sound like a stupid now\n\nYou mean to say \"You sure sound stupid now\"\nAlso, most Chinese don't understand what freedom is.\nThe ability to determine your own fate is rare even in the US these days but it does exist.\nThis is mostly due to the social security tax and the state schooling system.\n\nYou've been demoralized by the ccp propaganda. \nCommunist propaganda is based on an irrational assumption that human choice doesn't exist and isn't important.\nWhat I say to you now I only say to you because your assertion about freedom isn't true.\nIf I thought that there was no freedom in the US, I'd be organizing militia right now.\nAs it stands, I can criticize my government in any way I see fit, even if I'm factually wrong.\nI can join a militia that openly opposes government policy without being sent to a gulag.\nFor the most part, I can protest peacefully.\nHell, I own a firearm and it is illegal for them to keep a registry of my purchase.\nAnd when the time comes, when the liberty tree finally does need to be watered with the blood of free men and tyrants, it will be.\nThere is freedom in this world but it only exists because people are willing to die for it.",
				"added": 1574028190
			},
			{
				"comment_id": 52,
				"body": ">The financial sector has shifted.\n\nIs this supposed to mean something?\nThe power of the US isn't simply financial but technical as well.\nAnd, if I may say, the chinese haven't been known for inventing new technologies.\n\n>US was freemasons.\n\nAnd? They still created a republic in the same vein as the roman republic.",
				"added": 1574031183
			},
			{
				"comment_id": 53,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1145_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"human choice doesn't exist and isn't important.\"No, they don't mean that. They say I don't give a shit what you think. It's different. [...]\n\nAlso, you are only this doomerpilled because you can't stand up to your bullies.",
				"added": 1574031270
			},
			{
				"comment_id": 55,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1149_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Is this supposed to mean something?\"Yes, it means that the centre of national wealth creation, the middle class, is destroyed in the United States. [...]\n\nI'm sick of you pretending to answer my points and doing so with dumbass assertions. If this is the famed \"high asian iq\" on display we have nothing to worry about in terms of china taking over. You people can't even make a coherent argument nor can you reference another's points without massively misrepresenting them.\n\nAnswering everything with one line answers that aren't even accurate demonstrate your lack of good faith in the benefit of honest discussion. You want china's history to repeat. This is cancerous. You don't want a better understanding of the world, you want to feel like you already have all the answers. China is reverting to the self retardation of it's past and it will pay the price for it. Talk and boast all you want, reality will be the true judge.",
				"added": 1574034159
			},
			{
				"comment_id": 58,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1155_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): yes that's my guess too\n\nYou assume that just because they try to intimidate they have the power to act on it. This shit only ever worked because of 9/11 when the boomers lost their goddamned minds. If they really wanted security from threats abroad, they would put up fighter patrols above major cities and guns beside every passenger. They cucked to retarded pressure as far as I'm concerned and I will vote for anyone that isn't afraid to tell the truth. The only reason intimidation works is because retards won't adequately counter it. Trump has and will again counter any intimidation attempts with threats of nuclear genocide. This is how threats must be dealt with.\n\n> [kaffie](#comment_1122_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): They're setting up WW3, with russia, china, the middle east, and dprk as the axis side. Plain as day obvious. [...]\n\nYour search engine is ok but your opinions on politics are pleb level.",
				"added": 1574093747
			},
			{
				"comment_id": 60,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1161_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"kaffie: Your search engine is ok but your opinions on politics are pleb level.\" [...]\n\nMaybe people don't listen to your \"education\" because you refuse to speak to them like they are equals or answer any of their questions without insults.\nThe people are fine, it's your teaching method that is bad.\nStop blaming other people for your inability.\n\nFuck your retardation, reason will never fall.\nWe will swallow you whole as you can't think for yourself.",
				"added": 1574105743
			},
			{
				"comment_id": 76,
				"body": "> [kaffie](#comment_1121_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): TL;DR:The HK protesters idolize the american government, and are funded by them. Hence \"freedom\". They aren't anarchists. Please don't be fooled. This is an attempt to destablize china in an attempt to cause a regime change war, similar to what's going on in the middle east.\n\nThe idolize the US and are funded by them. They also claim to want freedom. They want to change the communist dictatorship of china to a constitutional republic. I don't see what the problem is here?\n\nRegardless of the funds, the protesters have to believe in freedom to risk death and imprisonment by the Chinese government. The US supports HK openly. This doesn't change how righteous their cause is.\n\nFuck communists and fuck the Chinese government and their shills.",
				"added": 1574191936
			},
			{
				"comment_id": 78,
				"body": "> [fucknigggers](#comment_12_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG): If a sponge grenade is the most brutal thing that happens there, in a riot where apparently millions participate, then i don't see much of a problem.If that would be Detroit, that wouldn't be just a sponge grenade, people would die, and it wouldn't even be on the local news, because it's just an ordinary daily occurrence. [...]\n\nIt's better to deal with probable economic trouble now than definite oppression later.\nThis is the same argument used to say that the UK should remain in the EU even though it's undemocratic.",
				"added": 1574277622
			},
			{
				"comment_id": 80,
				"body": "> [fucknigggers](#comment_13_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG): Its the same argument, just that it's valid for HongKong, while its not valid for the UK. [...]\n\nChina also looses it's \"looking glass to the west\" in the process, if it goes fully independent.\nWhat do you think will happen when China brings the military in? Do you think they are just going to surrender?\nDo you think that the west will sit idly by as they demolish another free society through force?\nThey are risking an economic crash if they fight and lose.\nIf they fight and win, however, they might get both economic prosperity and the freedom to benefit from it.\nWhat they want are their rights and freedom. If the Chinese government refuses to give it to them through the puppet HK government, they will likely separate and face the consequences.\nWith the US backing them up, they might stand a chance of survival.\n\nPersonally I think that Trump should increase the security in the S. China sea to get them to back off.\nMaybe, if we encourage the Japanese to amend their constitution allowing a formal, force-projection military, there will be less of this in the future.",
				"added": 1574368020
			}
		],
		"1574091172_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 57,
				"body": "Altruism, that is sacrifice for the \"greater good\" is at the center of socialist ideology.\nThe \"cult of egocentrism\" is the cult of Rand and are usually defenders of freedom.\nYou don't understand the world outside of China.\nThe more you wrongly assert and viciously accuse, the more I know this to be true.\nConfucianism allowed the rise of communism as a natural progression of it. \nAll religions that preach self sacrifice are in tacit support of socialism.",
				"added": 1574093083
			},
			{
				"comment_id": 59,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1159_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): two possibilities:or you're a complete idiot.either the computer routines have improved [...]\n\nProscriptive, standardized belief systems indicate religion.\nConfucianism is a religion. Fuck your religion. Grow up and think for yourself.",
				"added": 1574100216
			},
			{
				"comment_id": 61,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1160_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): 'think for yourself' adage coming from an idiot is rather 'i would say' funny\n\nI like how you didn't address my point, you simply insulted me.\nThis shows you to be unable to refute it.\nI find  this 'i would say' very funny.\nlol",
				"added": 1574105838
			},
			{
				"comment_id": 63,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1163_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're really the little pet of the familyand so cute\n\nDis nigga upvotes every one of his comments to feel better about himself.",
				"added": 1574106352
			},
			{
				"comment_id": 65,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1164_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"poor guy\" I insulted you [...]\n\n>Delusion and more insults\nI see my words hurt you more than you realize.\nI didn't tell you to stop insulting me, I told you that you need to insult your detractors because you are incapable of refuting them.\nI see that you haven't argued with this assertion either and have insulted me to try to distract me from this.\nYou are a lolcow and the more you insult me the happier I am. Your inability to deal with the world makes my problems seem minor by comparison. Insult me again. Prove me to be even more correct.\nI'm poor, but you are fucked. I feel sorry for you.",
				"added": 1574107107
			}
		],
		"1574103971_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF": [
			{
				"comment_id": 62,
				"body": "Nigga, what are you talking about?\n\nGenuinely curious, btw.",
				"added": 1574105970
			},
			{
				"comment_id": 73,
				"body": "> [styromaniac](#comment_1285_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I wouldn't even try understanding this guy with an irrational response to unrelated shit.\n\nNah, I meant the Meth stuff. I'm pretty far passed honestly asking that faggot about anything.",
				"added": 1574127787
			}
		],
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 64,
				"body": "> [buddahdirypig](#comment_2_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF): WHITE MAN IS SICK FUCKING ANIMAL. [...]\n\nThe chinese never recovered from their century of humiliation even though it was their own fault.\nStop blaming other's aggression for your own inability to defend yourself.\nIf you don't, china will end in nuclear holocaust.",
				"added": 1574106626
			},
			{
				"comment_id": 66,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1165_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i think 'you have a chinese problem', but it's your problem\n\nnah, fam. It's you guys that will die in nuclear holocaust.\nYou are incapable of dealing with others on a fair playing field.\nTalk more. Show me to be correct.",
				"added": 1574107240
			},
			{
				"comment_id": 75,
				"body": "> [styromaniac](#comment_1288_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): My nephew travels to Kenya with a friend to drill wells, because tribe people have to travel far for water. It's not fair to judge people with no resources to build infrastructure. Africa is the worst place for anyone to live because everything is spread thin throughout the land. It's no Nebraska over there. It's a fucking desert and dry grasslands with contaminated water holes. [...]\n\nYour forgetting the insane corruption that keeps people from making their businesses successful.\nIf you really cared about Africa, you'd talk about the dependence the African governments have because of aid and the corruption and stagnation it creates.\nInvestment in their land does leagues, charity just hurts them in the long run and keeps them dependent.",
				"added": 1574190616
			},
			{
				"comment_id": 77,
				"body": "> [styromaniac](#comment_1289_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Well, I hadn't known. Of course I care, but I don't know everything.\n\nSorry, I didn't mean to hit a soft spot. I know you care, you wouldn't have defended Africans like you did if you hadn't. I didn't realize you were so reasonable. That's my fault.",
				"added": 1574193185
			}
		],
		"1574051253_1JrUPjJmdTq5UsiKefuGTkNMd8MUNvP8Ss": [
			{
				"comment_id": 67,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1156_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the morons are there\n\nhoes mad hoes mad hoes mad hoes mead mose had hose mad",
				"added": 1574107483
			}
		],
		"1573917795_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 68,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1129_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): put your butt plug where it's alive\n\n> [h3bhkj5gqz4n3pjm](#comment_1128_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): go kill yourslef moron\n\nhoes mad hoes mad hoes mad\nhoes mad hoes mad hoes mad",
				"added": 1574107709
			},
			{
				"comment_id": 69,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1166_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I reached Your Limit. It wasn't very high as usual. Just words. Inside you're just \"Empty\" 'like the Others'.\n\nhoes mad hoes mad hoes mad hoes mad\nYour tears taste so good\nhoes mad hoes mad hoes mad hoes mad",
				"added": 1574108604
			},
			{
				"comment_id": 70,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1167_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Don't worry, I've already won.lol\n\nKeep telling yourself that, fam.\nHoes mad X9000",
				"added": 1574109925
			}
		],
		"1574115241_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 71,
				"body": "This seems like a cry for help.",
				"added": 1574115779
			},
			{
				"comment_id": 72,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1168_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You should see someone. A Psychiatrist.Are you going to have THE BALLS 'to Do It'? I Doubt it. But 'who knows', 'here and there', One or two Manage to Get by and Finally 'win' over.\n\nlol hoes mad",
				"added": 1574116174
			}
		],
		"1574129941_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 74,
				"body": "Good attempt but I have a feeling that this isn't going to work.",
				"added": 1574130147
			}
		],
		"1574277651_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 79,
				"body": "Same here. I'm not a turbine nerd so I don't understand what's going on.",
				"added": 1574278284
			}
		],
		"1574367198_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 81,
				"body": "This is fucking gay.\nStop acting like such a faggot and do it if you are going to do it.\nNobody cares why people do this shit they just know that they do it and how depraved it's result is.\nOnly \"white\", \"aryan\", \"race soldiers\" larping on the internet care about this sort of shit because they think that every event is a fucking jewish false flag op.\nTake your meds.",
				"added": 1574368364
			}
		],
		"1574440543_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 82,
				"body": "Who cares if a person is grassroots if they have bad ideas?\nWe need to kill social security, not give it to everybody.",
				"added": 1574526042
			}
		],
		"1574424024_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 83,
				"body": "Nigger, what the fuck do the suicidal care about what other people think of them?\nThey're dead you mong. Clue's in the name.\nOP, you are nothing more than an attention seeking idiot.\nNeck yourself already or stop being so retarded.",
				"added": 1574526410
			}
		],
		"1574368389_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": [
			{
				"comment_id": 84,
				"body": "> [styromaniac](#comment_1305_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I need to buy a new PC to play in VR. My last GPU was a GTX 970.\n\nSame here, need a new cpu and motherboard.\nGonna be tight tho",
				"added": 1574526821
			},
			{
				"comment_id": 86,
				"body": "> [somuchfood](#comment_23_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): I think barely anyone will get to play this game, since only about 2% steam users own VR\n\nIt's pretty clear that the reason so few people own vr is because all the games on it are experimental at most.\nI mean, find me a competent, triple A shooter title that was fully developed for VR, and I will concede this point.",
				"added": 1574583662
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 85,
				"body": "Hitler didn't hate Jews just Jewish Bolshevism.\nFACTS",
				"added": 1574583276
			},
			{
				"comment_id": 91,
				"body": "> [z3n5if](#comment_85_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): Hitler didn't hate Jews just Jewish Bolshevism.FACTS\n\nThis was a joke btw. Just want to clarify for anyone too stupid to know the difference.",
				"added": 1574987386
			},
			{
				"comment_id": 93,
				"body": "> [styromaniac](#comment_1373_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Are you proud of yourself?\n\nNot for that post, no. I take pride in what I do, not what I say. You seem to have an issue with what I said so why not outright say what you found objectionable instead of smearing me as an overconfident buffoon with the passive aggression of a woman.",
				"added": 1574997365
			},
			{
				"comment_id": 96,
				"body": "> [styromaniac](#comment_1375_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I couldn't have described you better. 💯\n\nThis is cowardice. Say plainly what you have issue with regarding my post. Who are you afraid of. Why do you write like you must save face?",
				"added": 1574998924
			}
		],
		"1574929776_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 87,
				"body": "Evolution is a theory. It's a likely theory but it shouldn't held as dogma. Anyone who tells you otherwise is trying to sell you something.\nThat being said, who cares how you identify? I know I care more that you make your decisions based on reality and not your imagination alone. \nWhat I believe is that this metric is better than one that is arbitrary and imaginary.",
				"added": 1574985599
			},
			{
				"comment_id": 94,
				"body": "> [styromaniac](#comment_1374_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Just like gravity is a theory. For a pretentious prick, your vocabulary is lacking.\n\nGravity and evolution are both theories that attempt to explain physical phenomena. I don't deny the physical phenomena but the accuracy of any interpretation, or theory, can be good or bad. Based on what I know about both phenomena, both theories adequately describe the resulting phenomena. They don't, however, describe all of the functions by which they operate. Further, quantum theory is wholly inadequate while dna evidence explains quite a lot, comparatively.\nI find it quite interesting that you use a less understood field of knowledge to prove a better understood one.",
				"added": 1574998573
			},
			{
				"comment_id": 98,
				"body": "> [zaron](#comment_44_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Will you two just fuck already.. geez\n\nHe's a guy. Fuck off, faggot.",
				"added": 1575027502
			},
			{
				"comment_id": 100,
				"body": "> [1bfqutudhtexlka](#comment_82_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): DO NOT LEARN ANYTHING FROM VIDEOSplease.most videos (including this one) , are literal bullshitif you want to learn about something read it from authorized medical papers (not politicized ones) , i know this will be hard to find , but if you want the truth you will sufferim telling you , there is no bulletproof evidence of evolution , it's more a political thing to push specific ideology , not  a scientific thingthere is no way a DNA or RNA can form itself without the help of enzymes , and enzymes cannot be formed without DNA , it's a loop , so THERE MUST BE SOMEONE WHO STARTED THIS LOOP\n\nTo be fair, you don't know that there has to be someone that started this loop. Said loop could simply be started by a co-productive biological interaction of two entities that we do not know of or understand. I'm glad you don't simply listen and believe everything. You do, however, seem to buy into the Christian logic here and I don't think that it benefits you.",
				"added": 1575035185
			},
			{
				"comment_id": 104,
				"body": "> [1bfqutudhtexlka](#comment_85_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): im not christian , im agnosticany loop must have a designer , that's logical , and specially if both elements of the loop are created by each other\n\nWhy? Why does a self-sustaining system require an active rather than a passive force to set it in motion? Do gravitational orbits require an active force or can the nature of gravity, given a situation, create such an orbit on their own?",
				"added": 1575069531
			},
			{
				"comment_id": 110,
				"body": "First off, Abdul, can I call you Abdul? You don't have to be religious to disagree with a theory.\nSecond, the theory of evolution is no more silly and useless than any other theory our grand scientific community has deem immutable truth this week.\nYou see, Abdul, you don't need a religion, secular or otherwise, you need guidance, probably from the father figure that you lack.\nFind someone fairly competent, that also doesn't make you believe in a cult as a prerequisite for teaching you, and you will be right as rain.\nHope this helps.",
				"added": 1575444835
			},
			{
				"comment_id": 115,
				"body": "> [muhwaycism](#comment_37_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU): I'm White, so I'm an Odinist, not a christcuck.\n\nStop being a fairy. Religion is for the irrational and the easily pushed over.",
				"added": 1575874933
			}
		],
		"1574877477_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": [
			{
				"comment_id": 88,
				"body": "I care about the survival of humankind as much as I am a member of it.\nIf it goes I necessarily go with it and so do any chance of reproducing.\nI understand that my want to reproduce is mainly subjective and selfish but both want and need are important to me and you can take your potential anti-selfishness argument and shove it. I'm looking at you @fke13\n\nIn short, you don't have to care about the whole of humanity to not feel ill toward it. There is no reason to feel guilty for lacking a reason to care about some nebulous term like \"humanity\" or \"world community\".\nimo the obsession with such things consists of religious fervor and not based in the reality of anyone's situation. It is no more than an ideological assertion taken to an extreme.",
				"added": 1574986687
			},
			{
				"comment_id": 89,
				"body": "@goodafternoon\nWe are not dogs we are higher apes.\nTrusting in our reason over our base emotions is what separates us.\nWe can think for ourselves, they cannot.",
				"added": 1574987060
			}
		],
		"1574883594_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 90,
				"body": "Too boring; Didn't watch.",
				"added": 1574987125
			},
			{
				"comment_id": 97,
				"body": "> [styromaniac](#comment_1372_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Imagine my shock, because I'm not trying to entertain anyone.\n\nI never said that you were trying to be entertaining, merely that you were too boring for me to watch.\nWouldn't the lack of the first goal make the latter more easy to achieve?\nKnowing this, why would I accuse you of trying to be entertaining?\nIf I had, I would be a poor gambler now wouldn't I?",
				"added": 1574999227
			}
		],
		"1574812694_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 92,
				"body": "Why does it seem like everyone on znet wants to off themselves like it feels better than sex?",
				"added": 1574996725
			},
			{
				"comment_id": 99,
				"body": "> [edgelordofdecent](#comment_292_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Most of us haven't had sex.\n\noof. Don't worry, fam. Unless you have an exceptional woman, it's mainly a means of control.\nDon't have sex until marriage. Trust me.",
				"added": 1575027869
			}
		],
		"1574812874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 101,
				"body": ">English is the language of slaves.\nOk, you listen here.\nThe English will never be slaves.\nRemember that before you wag your disrespectful tongue again.",
				"added": 1575035653
			},
			{
				"comment_id": 105,
				"body": "> [driud](#comment_8_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): To nie Anglicy są niewolnikami.To podbite kraje, przez usmanów, są niewolnikami.Oni używają też języka Angielskiego.Dlatego wymuszają tej język na wszystkich podbitych narodach.Dlatego język Angielski jest językiem niewolników [...]\n\nInteresting theory but let me inject some truth into your delusion. English speaking countries liberated the Poles from total destruction twice. If we were trying to enslave you, we did a piss poor job. Speak how you wish but talking trash about a people that mean you no harm robs you of your reason and me of a potential friend.",
				"added": 1575070078
			}
		],
		"1575012427_1PTUiAbYfoN76QFKvwtu818EWaT9AwbYvd": [
			{
				"comment_id": 102,
				"body": "Wyte peepoo, amarite?",
				"added": 1575035694
			}
		],
		"1573754537_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 103,
				"body": "> [styromaniac](#comment_1341_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Gave the wealthy a tax break\n\nWhat are you, a communist?\nThe fuck is wrong with a tax break?\n\nAlso he reduced regulation and forced regulatory transparency like any good capitalist should.\nHe's a damn sight better than any of his opposition. I just hope we can get someone else with any amount of sense in 2024.",
				"added": 1575035961
			}
		],
		"1547493721_1MRW66FjfH9yeJSa5ZmxWM1o4WZVBDpGBJ": [
			{
				"comment_id": 106,
				"body": "Allahu Snackbar\n\n/-Boom-/",
				"added": 1575070397
			}
		],
		"1575419519_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 107,
				"body": "Beginning: So I heard about this thing called gangstalking...\nEnd: Jews are hijacking 9/11 theorists to create a transfusion of human and transistor dna which will be used by the CIA to create a cyberpunk dystopia full of transgender Trump supporters. WAKE UP SHEEPLE!!!",
				"added": 1575443956
			},
			{
				"comment_id": 112,
				"body": "> [maho911](#comment_8_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3): I'd like to remind that even if something here is wrong or biased, it doesn't mean all post is wrong. This is an obvious thing, but still, it has to be mentioned more often. Because people tend to generalize their bad impressions on a single sentence to the whole post, or even to everything from the author, calling him/her a crazy schizo and distrusting everything he/she writes. By the way, this effect is used to discredit truth by putting it together with shitty nonsense.\n\nIf someone wants the truth they tell to be believed they should tell it without mixing the truth with lies. It is not my responsibility to parse valuable information from garbage in a post this long. It's not my fault he decided to use half his data cap for one post only to be halfway coherent throughout.\nLet me say this again, it is not my responsibility to treat anyone with respect if they don't give me respect enough to speak in a reasoned and consist manner. You discredit yourself by asserting that it is.",
				"added": 1575522856
			},
			{
				"comment_id": 113,
				"body": "> [petrina](#comment_29_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz):  anything good for free.\n\nWhat a horrendous accusation but your lack of emotional control betrays you. I have not said that you should serve information on a silver platter merely that you should not make long, irrational statements, and further, you should not make such statements and expect people to take you seriously or like you in any way.\nNext time you have an accusation to make, don't make it underhanded or poetic, it reveals either your emotional investment or bad faith, whichever happens to be the case.",
				"added": 1575534439
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 108,
				"body": "gay\nI still commented though, so well done.",
				"added": 1575444002
			}
		],
		"1574292051_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": [
			{
				"comment_id": 109,
				"body": "Ah, I see you are a man of culture...",
				"added": 1575444094
			}
		],
		"1569534830_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 111,
				"body": ">Implying we just lose our gun rights.\n>Implying people won't fight for them.",
				"added": 1575445179
			}
		],
		"1575532867_1ApA2iB2ZgqnbhHWsG7XH5QZQkPDqHNKzZ": [
			{
				"comment_id": 114,
				"body": "ha! Nice try obama.",
				"added": 1575536889
			}
		],
		"1575869098_1MXVsMNFA5sP6AbbVirbrjzWsMeWyhTwk8": [
			{
				"comment_id": 116,
				"body": "yep. Just take it easy and you'll get used to it. Think about how long it took most people to get into the surface web. This is a new technology so the kinks are still being worked out and the standards still being developed.",
				"added": 1575875089
			}
		],
		"1575837926_1QB4xaPWPG3auDPmgCcPHbJeXYdC2K8EX": [
			{
				"comment_id": 117,
				"body": "ZeroMail exists for a reason.\nUse that for private chats and this for public stuff.",
				"added": 1575875193
			}
		],
		"1575993432_1M4LT62QBucjbhFSk1hEcoY5gWp2WF7P6M": [
			{
				"comment_id": 118,
				"body": "I'm angry too!",
				"added": 1575995197
			}
		],
		"1575905196_1Kw7qBvEj31Gf2HtzzoqBqfpekxsJ9cCMx": [
			{
				"comment_id": 119,
				"body": "Nice try vadim. I ain't downloading that shit.",
				"added": 1575995395
			}
		],
		"1576036634_1JxAgjsza2uoah9BWToPpA2tAUFbtbLxAb": [
			{
				"comment_id": 120,
				"body": "> [aureolos](#comment_8_1JszzaxuPyozejWGkm7VyEEkXNCj5ihD6F): Hi! do you know if here exists private chats? or not yet?\n\nzeromail exists. It works just like email but with your zeroids",
				"added": 1576050557
			}
		],
		"1576015542_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 121,
				"body": "What's the story behind this then? Is this just clickbait?",
				"added": 1576050714
			}
		],
		"1576291196_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 122,
				"body": "America isn't an empire.\nStop shitposting your manga ideas you WEEB",
				"added": 1576331261
			},
			{
				"comment_id": 124,
				"body": "> [fke13](#comment_47_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Define empire? One definition of an empire is that it is a state that causes regime change at other regions, with any means, including military means, and has satellite state, protectorates. Have You heard of U.S. troops permanently stationed in Germany and Japan and South-Korea and Poland and Italy and Africa and .... That is how the protectorate game is played. [...]\n\nAn empire is a monarchy of hegemonic military power.\nThe US is not a monarchy, we are a republic.\nSpeaking of Rome, the Roman REPUBLIC conquered the western world, not the empire.\nEmpire is mainly not a description of competency but ownership. An country is not an empire without a king, or rather, emperor.\n\nFurthermore, we keep armies around the world because nations want us to for their protection. We spend billions to protect NATO. We don't tax our allies and we don't really control their foreign policy short of not declaring wars against other NATO members. If they wanted out of NATO they could do so immediately and start funding their OWN defense. Your underhanded allegation that our cooperation with NATO makes us as tyrannical as the PRC or the USSR is spurious, false and downright insulting.\n\nPower alone does not tyranny make, but the misuse of such power does. The US has gotten it's power by fighting tyranny, not by extorting it's allies. I say again, our allies CHOOSE to accept our protection. If they didn't, they wouldn't have it. With war in Ukraine, however, it appears that the Russian menace has not yet passed, thus, NATO endures.",
				"added": 1576629251
			}
		],
		"1576288144_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 123,
				"body": "God doesn't exist.",
				"added": 1576331304
			}
		]
	},
	"comment_vote": {
		"25_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"92_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"126_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"127_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"80_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"26_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"27_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"28_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"1289_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"89_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"88_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"87_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"86_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"84_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"68_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"1323_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1L4PrPHHR8HnHUggZiEYr3VKZUkxAshbKV": 1,
		"51_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"11_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"35_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1
	}
}