{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1630142696,
			"title": "What is zeronet++?",
			"body": "interesting, it was mentionned today... do you know it? do you use it?",
			"added": 1630142695
		},
		{
			"topic_id": 1630143923,
			"title": "the composition of Alex Jones Cabinet, 1st POTUS of the 2nd American Republic?",
			"body": "Health = mike adams ! first secretary of health of the 2nd american republic.\ntreasury = max and stancy keizer !\ninteresting...",
			"added": 1630143921
		},
		{
			"topic_id": 1630148191,
			"title": "how to hang lightfoot, mayor of chirak?",
			"body": "high enough for the seaguls to eat, and low enough for the fishes too... would she be hanging or floating, as it's hanging it answers your question... aka just right.",
			"added": 1630148188
		},
		{
			"topic_id": 1630153406,
			"title": "the killing of katerine the bitch from monsato pr",
			"body": "on the kill list... after her kids.",
			"added": 1630153402
		},
		{
			"topic_id": 1630214651,
			"title": "so \"troops\" will you get the jab of death for \"covid\" ?",
			"body": "ahahahahaha... frag, chain of command break... the cic is an imposter... his cabinet are low iq morons... anyway, you do want you want... Xinhua... \n\nand as Hu said : WE !\n\n(annihilate you).",
			"added": 1630214645
		}
	],
	"topic_vote": {
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": 1
	},
	"next_comment_id": 223,
	"comment": {
		"1630112272_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 1,
				"body": "he should create his own militia :)",
				"added": 1630141352
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 2,
				"body": "recap : \n1. I believe in your crap... it's your land. And l love la reconquista and winners. I believe real islam can only agree.\n2. my enemies will always say : \"it's the jews\", so that they can hope you or some react, to deflect from them.\n3. using goyim children in sex black mails is haram, ie highly illegal and worthy of treason\n\nas such if they wanted to discredit israel adventure they would say : it's the jew, kill the jew, and then tarnish israel reputation.\n\nbad luck for them I don't care of reputation. why? it's too easy to kill :D.\n\nhehheheeh...\n\nso naftyB, what is his favorite tel aviv beach fast food side quick delicacy? \n\nbecause for me, this tel aviv beach is a little bit the legend...\n\nso sad that nastyb aka beee beeee.... made everyone sick with the pfizer poison... will need to be cured too... and as the goyim are still trying to find their assholes... hahahah....",
				"added": 1630141643
			},
			{
				"comment_id": 3,
				"body": "4. however as qualif I would ask for a tax :)",
				"added": 1630141667
			},
			{
				"comment_id": 4,
				"body": "anyway... nothing works in this world... I want a 4 I get a 1...",
				"added": 1630141710
			},
			{
				"comment_id": 6,
				"body": "as a matter of fact, I just have to dig to prove it... and another jewish bone... furthermore ROME fought and WON. factually. so...\n\nhowever I believe that Moses wouldn't have felt in the vaxx scam.... and even more opposed the mandatory thingy... or coerced blah blah dog training...",
				"added": 1630142606
			},
			{
				"comment_id": 10,
				"body": "I am curious how long will the goyim deny natural immunity? as long as gothlib lives? show burma, the ceo of pfizer... time for a death squad?",
				"added": 1630142815
			},
			{
				"comment_id": 11,
				"body": "but first his kiddies... as always...",
				"added": 1630142831
			},
			{
				"comment_id": 12,
				"body": "I want pain and suffering...",
				"added": 1630142846
			},
			{
				"comment_id": 13,
				"body": "for me denying the jewishness of the area is like saying that Xi'an isn't a chinese city...",
				"added": 1630142974
			},
			{
				"comment_id": 14,
				"body": "and for me those who disagree, deserve to die. wiped in even nuclear fire... gone. end.",
				"added": 1630143019
			},
			{
				"comment_id": 15,
				"body": "so where was titus encampment?",
				"added": 1630143031
			},
			{
				"comment_id": 16,
				"body": "where he eat grapes and cheese all day long burning and melting under the israeli sun?",
				"added": 1630143052
			},
			{
				"comment_id": 17,
				"body": "it was before the egyptian conquest? so they were more prepared than I thaught...",
				"added": 1630143091
			},
			{
				"comment_id": 18,
				"body": "or after?",
				"added": 1630143116
			},
			{
				"comment_id": 19,
				"body": "77 AD... so after? or before? before... or after? who knows... I am confused :)",
				"added": 1630143141
			},
			{
				"comment_id": 20,
				"body": "and on which calendar.... hmmm",
				"added": 1630143154
			},
			{
				"comment_id": 21,
				"body": "does it really matter?",
				"added": 1630143164
			},
			{
				"comment_id": 22,
				"body": "I know it's before... why? Pilatus... !!!",
				"added": 1630143477
			},
			{
				"comment_id": 23,
				"body": "Pilatus was still SPQR...",
				"added": 1630143487
			},
			{
				"comment_id": 24,
				"body": "the mega celebration for titus victory in 2077 ! a 2 thousand year victory !",
				"added": 1630143522
			},
			{
				"comment_id": 25,
				"body": "flawless.",
				"added": 1630143529
			},
			{
				"comment_id": 26,
				"body": "maybe before as the gaius was from 100-15 bc...",
				"added": 1630143585
			},
			{
				"comment_id": 27,
				"body": "so 47 BC ruler of egypt. SPQR dead.",
				"added": 1630143683
			},
			{
				"comment_id": 28,
				"body": "so a while later...",
				"added": 1630143757
			},
			{
				"comment_id": 180,
				"body": "how to stop the incendiary balloons? must be hard to do, I mean a ballon in fire... maybe a drone army with water pistol? and when in peace they could be used to inject \"jabs\" into beach goes in tel aviv...",
				"added": 1630231803
			}
		],
		"1629776696_1FzpoVcMDHdrmqGuNs51dpoTmssre5yznv": [
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_1089_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i was trying to do the same, i can tell you if you are not a developer it is very unlikely and i think the search code is not easy to copy/paste. I suggest to upgrade to ZeroTalk++ which already include it.\n\nyour generosity honors you.",
				"added": 1630141801
			},
			{
				"comment_id": 9,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1630142696_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15/What+is+zeronet",
				"added": 1630142710
			}
		],
		"1629910533_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 7,
				"body": "Alex Jones should create his own Militia ! and then run for Potus and win.",
				"added": 1630142647
			},
			{
				"comment_id": 8,
				"body": "they wanted some \"loney\" they will get it ....",
				"added": 1630142659
			},
			{
				"comment_id": 31,
				"body": "seriously that would be a fun show... alex jones makes his gov as potus :)",
				"added": 1630147320
			},
			{
				"comment_id": 85,
				"body": "will american corruption be one day reigned in? who could \"drain the swamp\" ? and it's not about lock her up, but lock them down... if you want to increase prison expanses...",
				"added": 1630213543
			}
		],
		"1630143923_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": [
			{
				"comment_id": 29,
				"body": "aka the health ranger\nmax and stancy\nthen owen for the federal police\nharrisson for cia \nthe snowboard guy, sports :)\nmacadoo old people affairs\nzackari radiation issues\nthe blonde girl... NSA director... ahahahah\nthere was another one... the friend of millie weaver... family affairs\neducation the doctor on the show recently with his k12 reforms\n\nthe real issue is the war affairs... the one in jail joe biggs\n\nrulez...",
				"added": 1630147188
			},
			{
				"comment_id": 30,
				"body": "border i would put the son of warren buffet... as a gesture...",
				"added": 1630147227
			},
			{
				"comment_id": 32,
				"body": "internet matter :  williams binney !",
				"added": 1630147371
			},
			{
				"comment_id": 33,
				"body": "as a diplomat the guy who did the sec at the january 6 protest ! black I guess? he was excellent !",
				"added": 1630147422
			},
			{
				"comment_id": 34,
				"body": "fda the food babe.",
				"added": 1630147439
			},
			{
				"comment_id": 35,
				"body": "dia, I would put fat man and his oklaomah team...",
				"added": 1630147484
			},
			{
				"comment_id": 36,
				"body": "celente I would him as press supervisor and italian affairs relations",
				"added": 1630147534
			},
			{
				"comment_id": 37,
				"body": "it would be funny :)",
				"added": 1630147565
			},
			{
				"comment_id": 38,
				"body": "I am sure we could be back on schedule for the fleet on neptune...",
				"added": 1630147584
			},
			{
				"comment_id": 39,
				"body": "and as another gesture gina haspel has the prison system boss... ahahahha. but achtung ! we want results and impecility ! they all survive to the execution date... if there are some... it will be so peacenick...",
				"added": 1630147688
			}
		],
		"1629964430_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 40,
				"body": "wow 2 death according to RT... it was murder... katanas ready?",
				"added": 1630147906
			},
			{
				"comment_id": 176,
				"body": "now black substance found (according to rt)... biological attack ! time for a retalation",
				"added": 1630231490
			},
			{
				"comment_id": 177,
				"body": "my guess is that japan isn't diverse enough, and where are the rainbow flags? so they have to teach japan the proper way regarding japanese domestic affairs... some are really looking for a fight :)",
				"added": 1630231541
			},
			{
				"comment_id": 178,
				"body": "maybe it's time of the senseis to stop counting their pokemon cards, look at a map and realize that it's not china (included taiwan) messing with japan...",
				"added": 1630231590
			}
		],
		"1630085187_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 41,
				"body": "wow chicago judge remove mother parental rights because she is clean (no poisoned by jab) > judge like lightfoot should be left to dry over the lake... and be eaten by seagul for little children to see what happen to the enemies of the city.",
				"added": 1630148015
			},
			{
				"comment_id": 89,
				"body": "the cat warrior, a little fury crocodile !",
				"added": 1630213821
			},
			{
				"comment_id": 90,
				"body": "the teacher... seen her wickedness? this malice? the contagiousness or appeal of her wickedness? do you too feel a pool toward her \"playfullness\"? spanking... public spanking, before all students... ahahah",
				"added": 1630213889
			},
			{
				"comment_id": 91,
				"body": "remove your glasses, pants down, bent, and beam...",
				"added": 1630213904
			},
			{
				"comment_id": 92,
				"body": "ilham omar, why wasn't she dropped over mogadishu? this is not america. leave. back to africa.",
				"added": 1630213941
			},
			{
				"comment_id": 93,
				"body": "and she is like khan in london... imports + election steal + community vote... not democracy.",
				"added": 1630213968
			},
			{
				"comment_id": 94,
				"body": "there is still someone in us embassy kabul? funny... where is the \"flag\"...",
				"added": 1630214005
			}
		],
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 42,
				"body": "so... the jewish state? not wanting to recognize it? it's like saying that Khandhar isn't the birth place of the talibans... some will do it btw in the future...",
				"added": 1630148256
			},
			{
				"comment_id": 60,
				"body": "my bet is that the bomber was in reality directed by the former minister of defense ! ehehhe... why? I don't know... but I think there is some kind of hope that it would motivate the americans to stay,, fall in the trap that a fake director of the cia (panetta) would fall in... what do you think? possible anyway...\n\nwhy the guy, minister of defense knowns he is fucked, he has access, and why would ISIS-k do it? it makes no sense.... so the inorganic droid piloted by an organic droid missed the target...",
				"added": 1630211797
			},
			{
				"comment_id": 61,
				"body": "the ban of toxic housecleaning products in afghanistan to usher the possibility of clean natural sewer systems... It seems to me there is still a little problem currently with the corpses... I am not against open natural sewer, but those can't handle toxic products... so rather than fall in the \"technology\" trap, make only clean products availiable :D.\n\npositive thinking...",
				"added": 1630211931
			},
			{
				"comment_id": 62,
				"body": "and I have found the girl who raised the gay flag in Kabul US embassy :\n\nhttps://www.bitchute.com/video/3pwLocL3S64J/\n\nTeacher Mocks American Flag, Has Students Pledge Allegiance To Gay Pride Flag Instead\n\nif you look at her you will see the contagiousness of her wickedness... she deserve a spanking !\n\nwhat do you think would happen in any sane country to such a \"teacher\"? don't tread on the chinese flag... friendly advice, the consequences are terribles... and it's not a proper way to visit inner mongolia...",
				"added": 1630212022
			},
			{
				"comment_id": 63,
				"body": "imagine this bitch spanked in the gun event training area before ALL studends !!!",
				"added": 1630212075
			},
			{
				"comment_id": 64,
				"body": "10",
				"added": 1630212089
			},
			{
				"comment_id": 65,
				"body": "this is the kind of humiliation those little possessed demons deserve to be restored to sanity ! \n\nimagine the torture dear talibies those innocents children experience in those \"school\"...",
				"added": 1630212141
			},
			{
				"comment_id": 66,
				"body": "they can't even plead their allegiance to their own flag, the flag their own parents and grand parents, more the second btw, fought to defend !",
				"added": 1630212175
			},
			{
				"comment_id": 67,
				"body": "some females in usa have gone totally ashtray",
				"added": 1630212206
			},
			{
				"comment_id": 68,
				"body": "conclusion : reaper up, pansheer > locate > blast... maybe it's too light... b52 moab... let's see...",
				"added": 1630212248
			},
			{
				"comment_id": 69,
				"body": "and absolutely not, it's not israel... way way too buzy with the mullahs nuke program to even waste time and ressources on your situation, and as a war with iran can't be an invasion... no need to have \"support\" from your side...\nit's just across the persian sea...",
				"added": 1630212350
			},
			{
				"comment_id": 155,
				"body": "I am sure the americans are so doffus that they will again believe the former defense minister... you know fool me once... you know how it goes right?",
				"added": 1630224363
			},
			{
				"comment_id": 156,
				"body": "they may even sat phone him, him in the cables of his next attack, and they will believe... I want to believe I can fly...",
				"added": 1630224406
			},
			{
				"comment_id": 157,
				"body": "I really hope that all the digital footage of the rainbow flag will be well stored... I am sure the doffus of the state dep are trying to erase them all... they are such \".....\" no words...",
				"added": 1630224494
			},
			{
				"comment_id": 158,
				"body": "state dep: we will show them ! (them being the afghans)...\nof course...",
				"added": 1630224525
			},
			{
				"comment_id": 159,
				"body": "did they try transgender former child rapists story time in afghan schools too?",
				"added": 1630224563
			},
			{
				"comment_id": 160,
				"body": "and then if you say it's madness kidnapp your children to put them under the custody of known childrapists?",
				"added": 1630224590
			},
			{
				"comment_id": 161,
				"body": "that's what they do in usa...",
				"added": 1630224598
			},
			{
				"comment_id": 162,
				"body": "not all of course, but the sane one are afraid of the insane... they are afraid to beat a karen to reason and submission... so they prefer to submitt to her, even if it's again the interests of their own children... it's pathetic.",
				"added": 1630224682
			},
			{
				"comment_id": 163,
				"body": "example is the wicked girl who removed their own flag from class room and find it funny and amusing, and immune enough to make it known to the world... I mean who is dumb enough to want to live in such a wicked place. \nit wasn't always like that of course... sins creeps always from small to everything.",
				"added": 1630224747
			},
			{
				"comment_id": 164,
				"body": "or when good men doing nothing to stop bad women...",
				"added": 1630224760
			},
			{
				"comment_id": 165,
				"body": "what is the punishment in the IEA is a female teacher removes the Shahada flag, to put a gay pride one? execution.",
				"added": 1630224818
			},
			{
				"comment_id": 166,
				"body": "before the classroom entrance.\nend of the discussion.\nbe warned.",
				"added": 1630224843
			},
			{
				"comment_id": 167,
				"body": "but I am against the shahada in class room, it must be a voluntary act... it the heart, mind, spirit and soul !",
				"added": 1630224872
			},
			{
				"comment_id": 168,
				"body": "I prefer quoranic verses... or a map of afghanistan...\nthe daily verse...",
				"added": 1630224912
			},
			{
				"comment_id": 169,
				"body": "that's a nice unifying idea... the daily verse... \nof course the prayers... etc...",
				"added": 1630224946
			},
			{
				"comment_id": 170,
				"body": "unless of course the shahada becomes the official flag of the IEA :)",
				"added": 1630225001
			},
			{
				"comment_id": 171,
				"body": "everything is very complex if afg... for sure :)",
				"added": 1630225016
			},
			{
				"comment_id": 172,
				"body": "and I want vakay for poppy harvest... stay agrarian ! rural is the way... otherwise you will become dependent on foreigners and unable to dictate your own destiny... minerals are harvested once, poppy can grow for generations... even without human interferences... or enhancement.",
				"added": 1630225083
			},
			{
				"comment_id": 173,
				"body": "btw... the Doha food market link? would be nice...",
				"added": 1630225124
			},
			{
				"comment_id": 174,
				"body": "fresh... just on time delivery :)",
				"added": 1630225148
			},
			{
				"comment_id": 175,
				"body": "and you know, what the nwo agent the girl with her flag in the american school doesn't get...\nis that I believe, if it had happened in AFG that once executed, and burried, her father will come to the killer, and apologize, apologize that they had to kill a woman he raised so badly and dishonored his family, then he will complain that he should have been called to kill her, and then understand that it was politically motivated and necessary to happen fast to restore order through the province, understand and leave in good peaceful term, one less worry for him and then still pray for her soul, as we will all do.",
				"added": 1630225512
			},
			{
				"comment_id": 179,
				"body": "I hope that the vaxx terror won't reach the peaceful plains of afg...",
				"added": 1630231667
			},
			{
				"comment_id": 181,
				"body": "a quick lecture on collateralization... they say you have 1 trillion in mineral potential... let's say you need money to improve agricultural production (water retention, irrigation etc), you can go to the big banks and ask for money by pledging the mineral on the ground without even digging them !!! ahahahah. no interests even ! win - win :) but be careful, they will come to claim if you can't repay at the end... so for example you need half a billion, ez, today even :)",
				"added": 1630235967
			},
			{
				"comment_id": 182,
				"body": "then personally, I would like that in IEA school, children lean to read and write the quoran... so that they can read it, or something else, and write it or something else. count (the harvest) and market prices, learn about biologiy, real biology, how chicken hatch, how poppy lives etc (it's logic, real, the creation of god) and useful, some basic medical stuff... geography and meteorology (real, again) the universe... but no NWO crap... pleasssseeee...",
				"added": 1630236105
			},
			{
				"comment_id": 183,
				"body": "there is a daddy chickun, the chickun king and females, the female hatches, new chickuns ! sawing, cleaning, cooking etc... but not too much, once they know how to read they can learn themselves outside of farming hours...",
				"added": 1630236165
			},
			{
				"comment_id": 184,
				"body": "because the nwo goal is to take the children out of the household, brainwashed them into organic faithless, godless droids as slave of the ultra aristocracies of the west. I say NO.",
				"added": 1630236219
			},
			{
				"comment_id": 185,
				"body": "and don't believe a second cnn or any of the western msn... the only time they tell something factual is to lie then, or before, or maybe by error...",
				"added": 1630236275
			},
			{
				"comment_id": 186,
				"body": "I was asking if others emirates could prospect for OIL... ?",
				"added": 1630236317
			},
			{
				"comment_id": 187,
				"body": "it's quite clean... useful... and they know their gig :)",
				"added": 1630236330
			},
			{
				"comment_id": 188,
				"body": "it's hard to land a tanker in afg... so it will be more domestic consumption... fertilizers, plastics (handled of ar15), things like this, fuel... why not... but don't donkeys don't need such low tech technology.",
				"added": 1630236402
			},
			{
				"comment_id": 189,
				"body": "specially this khandar desert.... it's there the sand worms live?",
				"added": 1630236467
			},
			{
				"comment_id": 190,
				"body": "but honestly with a cool intelligent and astute irrigation system, why couldn't it be greened too?",
				"added": 1630236519
			},
			{
				"comment_id": 191,
				"body": "it would save the rain forest in brazil...",
				"added": 1630236532
			},
			{
				"comment_id": 192,
				"body": "and don't forget better a simple solution that you masterize than an imported one you don't understand... (an helicopter is made to fly... not rolle around... but to drive than to crash, specially with the blades rotating...).",
				"added": 1630236624
			},
			{
				"comment_id": 193,
				"body": "specially at the current price of fuel...",
				"added": 1630236661
			},
			{
				"comment_id": 194,
				"body": "my advice, wrap the all (against sand storm and dust) and wait for a while before wanting to become the next top gun to take on soviet union....",
				"added": 1630236727
			},
			{
				"comment_id": 195,
				"body": "I have heard there are good flying school in the usa...",
				"added": 1630236776
			},
			{
				"comment_id": 196,
				"body": "but ask the lesson with landing included... it's safer.",
				"added": 1630236793
			},
			{
				"comment_id": 197,
				"body": "I am quite hot just before the winter season to organize the Khandar Solar Exihibition... so that orders and all can be ready for spring time :)",
				"added": 1630237255
			},
			{
				"comment_id": 198,
				"body": "that's 2 others thing : DECENTRALIZATION !!! a giant solution will fail and could be smashed, millions of small scale solutions won't be as easy to take out be the enemies... (who are yet unknown, or still cloaked).\n\nin the global market some will try to fuck you, remind them that if they do, after of course an attempt to renegociate, they will simply be KILLED.\n\nso that things are clear about doing business in the Emirate...",
				"added": 1630237380
			},
			{
				"comment_id": 199,
				"body": "some believe it's a free for all and will fist some talibies hard... so... be careful, think like an afghan mountain fox...",
				"added": 1630237416
			},
			{
				"comment_id": 200,
				"body": "then for example the maza-e-sharif chicken market... or I don't know the jalalab jalapendo market :)",
				"added": 1630237474
			},
			{
				"comment_id": 201,
				"body": "as the gold standard seems to be the goat dropping, in kabul ! the greatest fertilizer the world has ever seen...",
				"added": 1630237524
			},
			{
				"comment_id": 202,
				"body": "What I am saying is that with violence it's possible to get out of all situation, with enough violence of course :)",
				"added": 1630237578
			},
			{
				"comment_id": 203,
				"body": "then I am curious with all this aquaculture... where would be the most appropriate city for an exhibition? of course it hangs on travel safety afghanistan wide...",
				"added": 1630237648
			},
			{
				"comment_id": 204,
				"body": "and all the touristic activites? hiking? horsing? I don't know... wing suits, base jumps who knows... I am sure there are a lot of great potential, maybe winter activites too... you have a K2 or some thing like that? skiing? star watching... the night sky of afganistan...cave touring? I don't know...",
				"added": 1630237908
			},
			{
				"comment_id": 205,
				"body": "mineral extraction is really a last resort... the hanging fruit... of temptation which can destroy the rest...",
				"added": 1630237933
			},
			{
				"comment_id": 206,
				"body": "thermals? who knows... americans never saw afghanistan as was it is but wanted to make it in a way... it was not possible in the past... now it's a new dawn !\n\na trump hotel?",
				"added": 1630237988
			},
			{
				"comment_id": 207,
				"body": "quranic studies !",
				"added": 1630238011
			},
			{
				"comment_id": 208,
				"body": "space port !",
				"added": 1630238018
			},
			{
				"comment_id": 209,
				"body": "war schools? resistance / guerrillia / counter occupation school? I mean there are great experts...",
				"added": 1630238075
			},
			{
				"comment_id": 210,
				"body": "talibies aren't marxists anti free well regulated market I hope???? the horror ... the afghan nightmare.",
				"added": 1630238138
			},
			{
				"comment_id": 211,
				"body": "then it's the collectivization of all chickuns... noeeeessss.... nooohhhhhhhooo",
				"added": 1630238161
			},
			{
				"comment_id": 212,
				"body": "then I would go as far, as medical plant of the creation treatment and facilties... recreational well regulated experiences travel... \n\nand of course all the legal export with others smart intelligent humans who understand the place of the plants of the creation in the creation of god... \n\nlike I heard that mexicans where looking for great weeds... who knows, they may like afghan agricultural products.",
				"added": 1630238269
			},
			{
				"comment_id": 213,
				"body": "there are people in california that have a super high opinion of their agricultural products... competition is always great !",
				"added": 1630238313
			},
			{
				"comment_id": 214,
				"body": "challenger afghan is always welcomed !",
				"added": 1630238327
			},
			{
				"comment_id": 215,
				"body": "but expect the best... but open minded... as always... who knows...",
				"added": 1630238349
			},
			{
				"comment_id": 216,
				"body": "leave the rockfeller world behind it's dying...",
				"added": 1630238385
			},
			{
				"comment_id": 217,
				"body": "but as ravier bolsonaro said, it's important to have safety for such expansion, and real safety can only come from true justice, otherwise it's just an illusion that will crumble at the worst time...",
				"added": 1630238444
			},
			{
				"comment_id": 218,
				"body": "which he didn't understood... :/",
				"added": 1630238455
			},
			{
				"comment_id": 219,
				"body": "and could we move the kabul air port beyond the hills? between kabul and bagrham? it would permit to expand kabul, a giant park ???",
				"added": 1630238502
			},
			{
				"comment_id": 220,
				"body": "with mega mosk!",
				"added": 1630238532
			},
			{
				"comment_id": 221,
				"body": "remember everything is possible in the spirit, but only the deeds count... who knows, better be at the best on both !",
				"added": 1630238603
			}
		],
		"1630148191_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": [
			{
				"comment_id": 43,
				"body": "after the beans, there will be the \"noose\"",
				"added": 1630148363
			},
			{
				"comment_id": 44,
				"body": "and her name... in the future they won't believe she died like this...",
				"added": 1630148385
			},
			{
				"comment_id": 45,
				"body": "the crazy bet, when does the head, after having being eaten by seaguls, and dried and more, fell into water?",
				"added": 1630148436
			},
			{
				"comment_id": 46,
				"body": "I want the best rope ever sold !",
				"added": 1630148526
			},
			{
				"comment_id": 47,
				"body": "it must be really the break...",
				"added": 1630148536
			},
			{
				"comment_id": 48,
				"body": "alexjones presidency won't be possible... he may not agree ! and that's why it's a FEDERATION ! or better the return to a CONFEDERACY !",
				"added": 1630148586
			},
			{
				"comment_id": 49,
				"body": "more state rights, even more county right and even above all INDIVIDUAL rights !",
				"added": 1630148631
			}
		],
		"1630052797_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 50,
				"body": "> [anonymouslogin](#comment_332_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I have read that varroa mites are a credible threat to hive populations, but there are several selective breeding programs that mitigate that threat, the bees themselves disrupt the mite reproductive cycle! Encouraging! With regard to this 5G, insects are largely immune to the effects of most types of radiation including gamma from nuclear blasts. If the world ever nukes itself into oblivion it is likely the entire planet will be inherited by bees and other insects.\n\nEMF aren't gama... just highly pulsated micro waves... 3-60Ghz and as their shells are very small and fragile they are very prone to illness or EMF interferences... it goes through their cells... as us... have you seen the blinded birds in teh north east dying? no, to buzy licking Jenny ass isn't it?\n\nto fight varroa just put a ant colony below... or have bee eating real food, and not gmo pesticitides laced sugar drink\n\nwhat I find funny with your kind at the state departement / monsanto, like Katherine, who will be killed sooon I hope, is that you have 0 culture...  0 knowledge, and 0 respect for life itself...",
				"added": 1630153360
			},
			{
				"comment_id": 57,
				"body": "> [anonymouslogin](#comment_332_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I have read that varroa mites are a credible threat to hive populations, but there are several selective breeding programs that mitigate that threat, the bees themselves disrupt the mite reproductive cycle! Encouraging! With regard to this 5G, insects are largely immune to the effects of most types of radiation including gamma from nuclear blasts. If the world ever nukes itself into oblivion it is likely the entire planet will be inherited by bees and other insects.\n\nand for such ignorance you get banned... bye bye state agent.",
				"added": 1630153723
			}
		],
		"1630153406_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": [
			{
				"comment_id": 51,
				"body": "I want an interview of her, lying next to the corpses of her whole family, man, children... cats and dog alive... \n\nit's gonna be fun... bimbo... ahahhaah",
				"added": 1630153471
			},
			{
				"comment_id": 52,
				"body": "but not a problem if she is taken out in the FS / NR program or it's fallout... I don't really care... as long as they PAY !",
				"added": 1630153509
			},
			{
				"comment_id": 53,
				"body": "with their fucking blood.",
				"added": 1630153518
			},
			{
				"comment_id": 54,
				"body": "I am not some kind of homo gay brainwashed by federal gov.",
				"added": 1630153544
			},
			{
				"comment_id": 55,
				"body": "but I am happy to keep her alive for a while, once her family is dead... maybe nailgunned to her living rooms with the corpses... and live on twitter live...",
				"added": 1630153598
			},
			{
				"comment_id": 56,
				"body": "she will be able to express to the world the consequences of her actions...",
				"added": 1630153613
			},
			{
				"comment_id": 58,
				"body": "it's part of my ethic course... to have a lot of materials... to expose the consequences of treason...",
				"added": 1630153826
			},
			{
				"comment_id": 59,
				"body": "by someone, I mean the list is long, experiencing them...",
				"added": 1630153866
			},
			{
				"comment_id": 96,
				"body": "> [dott](#comment_1_1ChGbS5LnspxeemrJaNxGCkHsahRfa4ke7): sheesh\n\nWhat, imagine her surpise, her who for a plot of land , accepted to kill millions with her toxic products bent on cornering of the world food supply will see before her own eyes her whole family assassinated... she could be agrand mother, it would make only more fertilizer.\n\nshe has to be executed. it's fundamental. she is part of the plague of america. it's not because you are dumb enough to become a debt slave to party in \"college\", you can party on debt outside of college btw (with more money for partying even) that you have an excuses to threaten the world food supply.\n\nI want death.",
				"added": 1630214504
			}
		],
		"1630132032_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 70,
				"body": "Zhao Wei? the CIA access point to corrupt pop culture in china? possible...",
				"added": 1630212415
			},
			{
				"comment_id": 71,
				"body": "what people don't understand is that this wealth concentration becomes toxic... they just become trade muppets to be slaughtered on the markets altar... leading to even more concentration... \n\nremember, stability, harmony, and if some ants start to pretend they are the new emperess of china, they will discover that feodalism is not an allowed political opinion in chna...",
				"added": 1630212521
			},
			{
				"comment_id": 72,
				"body": "and those suckers who still want to take guns away, while russian ammos are certainly great ! it's a political interference in ammo market !!! let them in, may the best thrives ! and chinese ammo? too much internal demand for export? I am sure it's high quality munition too...",
				"added": 1630212598
			},
			{
				"comment_id": 73,
				"body": "I find ridiculous to think that panetta is nothing more than a little civilian doing the party tour of D.C., protecting pedos, skimming some money in corruptions loot, and parading with the complicit msn... \n\ncontrary example : gina... okay she was unable to breach the trump wall protecting the pedos... but still more credible than \"panetta\"... or HerbertB... you see, if it was necessary to kill a kennedy, so be it... it won't change the weather in maine... or even dark barack... but panetta? this man coudn't lace his shoe...",
				"added": 1630212940
			},
			{
				"comment_id": 74,
				"body": "at $1k piece",
				"added": 1630212950
			},
			{
				"comment_id": 75,
				"body": "the liberation and reunification of taiwan... there is an excellent read from Hu Xihing (I guess) editor of global times on the issue... LOVED IT !!! the we...",
				"added": 1630212999
			}
		],
		"1630131159_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 76,
				"body": "I am a fan of the editor ! his explanation for the delay, or temporisation, or strategic patience, I like... I had a very good catch phraze but forget it...\nI specially like the \"we\" it's so refreshing... in the west it's only \"them\"... they rape kids, they steal funds, they , they they...",
				"added": 1630213128
			},
			{
				"comment_id": 77,
				"body": "it was something about power...",
				"added": 1630213201
			},
			{
				"comment_id": 78,
				"body": "it was funny and smart... certainly too wise for me to be able to hold on :)",
				"added": 1630213227
			},
			{
				"comment_id": 79,
				"body": "giant rice... omg",
				"added": 1630213251
			},
			{
				"comment_id": 80,
				"body": "91...",
				"added": 1630213299
			},
			{
				"comment_id": 81,
				"body": "late for a cia assassination ...",
				"added": 1630213315
			},
			{
				"comment_id": 82,
				"body": "but hybrid? you mean it's no crispr or mrna injection? it's just natural selection?",
				"added": 1630213343
			},
			{
				"comment_id": 83,
				"body": "because gmo as said and ranted many times, is the downfall of life...",
				"added": 1630213394
			},
			{
				"comment_id": 84,
				"body": "even dangerous for organic droids...",
				"added": 1630213412
			},
			{
				"comment_id": 98,
				"body": "I feel there is too much pressure on taiwan, I mean they are only exposed to the dark side... it's only natural that they retreat in fear, and can't think clearly...\n\nmaybe too time to present them with the dream... the blossoming of liberation over the island of taiwan...",
				"added": 1630214747
			},
			{
				"comment_id": 99,
				"body": "and beyond the access to the largest most regulated market in the world...\n\nno , I want bamboo flowers , island paradise ! sun rise over the pacific, sun set on the straight... the smell of the mainland festivals reaching the shores...",
				"added": 1630214840
			},
			{
				"comment_id": 100,
				"body": "because it's true... we are gonna invade you at will and smash you and or anyone standing against our will... is naturally... freightening... even for those understanding that reunification is the only path... and even more for those pro unification... who want to be invaded? those people aren't stupid, don't forget even they are some wicked manipulated and or rogue elements, they are still chinese mainlanders... it's their ways the problem, not their indiscutable origin...",
				"added": 1630214974
			},
			{
				"comment_id": 101,
				"body": "and when I tell you had something super smart about power... but I forget it... sad, because all this below is low compared to it, even if it's genius :)",
				"added": 1630215056
			},
			{
				"comment_id": 102,
				"body": "another great plan part of the unification is the clean up of contaminated area in taiwan, I heard that the invaders didn't took care of the land... so how to rejunvinate it ? \n\nyou see again... there is move them on the defensive\n\nwhat is the future of taiwan full integration in the PRC?  not idealistic, but realistic, the end game and steps...\n\nnorthern hainan?",
				"added": 1630215157
			},
			{
				"comment_id": 103,
				"body": "maybe first they have to understand we aren't interested in jailing you or death squading you... the war is long gone... there is no one to punish of anything...",
				"added": 1630215216
			},
			{
				"comment_id": 104,
				"body": "and so our question is what do the taiwanese and occuptans of taiwan who will all become one for certain issue, aka there won't be rapatriations to the mainland or any crap...\n\nso what do they want? what can be so different from mainland? the problem is that the so called \"free press\" makes this information impossible, as the \"free press\" is only paid by pivate interests, we can't know the public interests... \n\nhow the west was captured.",
				"added": 1630215308
			},
			{
				"comment_id": 105,
				"body": "you want economic growth?\npublic safety?\nclean environnement conditions?\na strong border to prevent all foreign invasion for eternity?\nand a space fleet?\nand vakay to the beach in clean water\nwith quality unbiased education?\nand hate congestion on transit network?",
				"added": 1630215406
			},
			{
				"comment_id": 106,
				"body": "we don't have yet all solution, but together stronger !",
				"added": 1630215436
			},
			{
				"comment_id": 107,
				"body": "and again the enemy is the \"free press\" captured by private interests...",
				"added": 1630215460
			},
			{
				"comment_id": 108,
				"body": "they stand in our way.",
				"added": 1630215469
			},
			{
				"comment_id": 109,
				"body": "what's the most common smelly flower of taiwan?you want the lotus dream in taiwan? no problem...\nand real journalist will be able to do real journalism and solve issue with PRC... however remember the goal isn't fame, but investigation and result in those, but those are separated, sometime your most awesome article will have to be \"silenced\" --- why? because it is being resolved... live, with men and women, mostly men, puttin their lives at risks to stop those you found... \n\nit's part of the stablity, no distrubance in the force program... \n\nwhat's the point to rail the public about something (ex epstein) to get 2 arrests? ex I prefer no words on child sex slave in nk border area, while death vans are being loaded... you see the difference? you don't remember how it works in the mainland? not the effect, the substance...",
				"added": 1630215700
			},
			{
				"comment_id": 110,
				"body": "the key word is WITH",
				"added": 1630215720
			},
			{
				"comment_id": 111,
				"body": "the illusion of democracy is maintained by the traitor in the proaganda outlets preventing the people liberation.",
				"added": 1630215789
			},
			{
				"comment_id": 112,
				"body": "not bad this one :)",
				"added": 1630215796
			},
			{
				"comment_id": 113,
				"body": "but still inferior to the forgotten one...",
				"added": 1630215808
			},
			{
				"comment_id": 114,
				"body": "it was about power, the usage of power, humility... the whole in a beautiful wording... about strenght and reponsibility...",
				"added": 1630215874
			},
			{
				"comment_id": 115,
				"body": "too great to be held...",
				"added": 1630215885
			},
			{
				"comment_id": 116,
				"body": "but to get back to the issue.. so some in taiwan are trapped in a mind trance like the demonshelivcks in the usa and their minions... hmmm interesting parallel...",
				"added": 1630215959
			},
			{
				"comment_id": 117,
				"body": "by the same...",
				"added": 1630215973
			},
			{
				"comment_id": 118,
				"body": "be lucky it's just a province which went berzeck... it's not even rogue... but at least they don't have the incompetence...",
				"added": 1630216036
			},
			{
				"comment_id": 119,
				"body": "further proof of it's chinetude...",
				"added": 1630216051
			},
			{
				"comment_id": 120,
				"body": "sadly, in the usa... I had come to the conlusion that only the mass murder of all demonshelvick was the last option... but maybe a sweep acrross the medias...\n\nbut so the medias back the politicians, both feeding on the people guilibility?",
				"added": 1630216123
			},
			{
				"comment_id": 121,
				"body": "sometimes... after the battlefield hainan, it's nice ! so war is not so tragic...",
				"added": 1630216155
			},
			{
				"comment_id": 122,
				"body": "again... I am freightening them :)",
				"added": 1630216176
			},
			{
				"comment_id": 123,
				"body": "because I mean, it seem simpler to kill everyone on this island and start fresh.",
				"added": 1630216195
			},
			{
				"comment_id": 124,
				"body": "and sometimes excessive care or planning is the anathema to doing...",
				"added": 1630216225
			},
			{
				"comment_id": 125,
				"body": "if you take hours to think about how to cook rice, hard rice will you eat...",
				"added": 1630216247
			},
			{
				"comment_id": 126,
				"body": "what I like is stealth invasion, target assassination of all medias operative in taiwan, maybe ala 911 in their editorial reunion... but again it create ressentment...",
				"added": 1630216294
			},
			{
				"comment_id": 127,
				"body": "the press is the enemy.",
				"added": 1630216309
			},
			{
				"comment_id": 128,
				"body": "it's factual.",
				"added": 1630216317
			},
			{
				"comment_id": 129,
				"body": "so now who in the press is the enemy.",
				"added": 1630216329
			},
			{
				"comment_id": 130,
				"body": "the press enemy list of taiwan?",
				"added": 1630216338
			},
			{
				"comment_id": 131,
				"body": "would be nice maybe to expose them continously... like an information chart graph, for anyone to see how a corrupt media system operates, teh links between every members, how money flows etc...",
				"added": 1630216390
			},
			{
				"comment_id": 132,
				"body": "part of the worldwide liberation program !",
				"added": 1630216410
			},
			{
				"comment_id": 133,
				"body": "it's almost the same model everywhere... corrupt politicians, corrupt \"capitalist\" players\" both backed by the medias... as old as rome...",
				"added": 1630216462
			},
			{
				"comment_id": 134,
				"body": "then they banned forum access to truth teller, who went with barbarians so when war wizards arrived, they felt again at home , home they believed to have left behind... victory was assured :)",
				"added": 1630216507
			},
			{
				"comment_id": 135,
				"body": "and when main troops joined, all agreed barbarian chief, great warrior, man of honor, true to his words, always.",
				"added": 1630216571
			},
			{
				"comment_id": 136,
				"body": "we ain't praising you barbarian chief, it's just fact ! we love it !\nplease call by my name :D you are home with us !\nlet's smash rome !\n woot woot !\nand those bimbo whores came with a little pannel before our merry rat tag band :\n\"forbiden to pass\"\nahahahah...\nSTORM-",
				"added": 1630216664
			},
			{
				"comment_id": 137,
				"body": "ed",
				"added": 1630216670
			},
			{
				"comment_id": 138,
				"body": "when roman most trained smart and courageous front line troops having joined the libeartion front (barbarian) saw barbarian chief running front, they all said...  we have found where and with whom to die !\nthe perversion that rome had become felt like a bambo hut before a nuclear blast energy wave...",
				"added": 1630216851
			},
			{
				"comment_id": 139,
				"body": "there were only paskies there left.",
				"added": 1630216870
			},
			{
				"comment_id": 140,
				"body": "and curioulsy I am not angry against epoch times... I get they don't like the risks of wicked low tech low iq communism.. who does? key counter words : moderate and intelligent (naturally for the 2nd).\nwell regulated markets. you won't taint milk with opiods... 101. basic, but with out regulation... with saw what american did with growth hormones...",
				"added": 1630217001
			},
			{
				"comment_id": 141,
				"body": "and even worst pharaonism cloaked in communism... like they seek in the usa...",
				"added": 1630217031
			},
			{
				"comment_id": 142,
				"body": "it's for egypt that you have to build the pyramid... of course...",
				"added": 1630217058
			},
			{
				"comment_id": 143,
				"body": "/sarc",
				"added": 1630217108
			},
			{
				"comment_id": 144,
				"body": "it was for jenny's boys.",
				"added": 1630217118
			},
			{
				"comment_id": 145,
				"body": "what i see is the more luxirous journalists live become the less informative and ideological they become... maybe another mainland campaign and more importantly industrial toxic waste land tour? bring your ABC suit for the worst hit area... maybe you will see something interesting that only afresh perspective can... again... no stress, the situation is dire in some part, but it's \"under control\" or said,---known as problematic.",
				"added": 1630217308
			},
			{
				"comment_id": 146,
				"body": "for example what is happening with the run offs from rare earth mineral extractions? where are used nuke plants material temporarily stored? etc... high tech waste?",
				"added": 1630217392
			},
			{
				"comment_id": 147,
				"body": "if only it was caca...",
				"added": 1630217407
			},
			{
				"comment_id": 148,
				"body": "the waste side of china...",
				"added": 1630217421
			},
			{
				"comment_id": 149,
				"body": "Depleted uranium hot spot in afghanistan map?",
				"added": 1630217462
			}
		],
		"1630131617_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 86,
				"body": "you get the award ! why? it's up beat ! and I like it ! the tale of success ! in modesty and humility... impressive.",
				"added": 1630213702
			},
			{
				"comment_id": 95,
				"body": "what I like too it's the most serene and really informative... in the sense of the great chairman whose death was honored by the 1997 print.",
				"added": 1630214108
			}
		],
		"1630132181_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [],
		"1630214651_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": [
			{
				"comment_id": 97,
				"body": "soon... on the scale of the thousands year story of china :)",
				"added": 1630214670
			},
			{
				"comment_id": 150,
				"body": "but it can be peaceful too... as you see many inland problems... so many...",
				"added": 1630217553
			},
			{
				"comment_id": 151,
				"body": "the rest of the world can die, it won't change them",
				"added": 1630217566
			},
			{
				"comment_id": 152,
				"body": "jsut don't interfer in CDA... chinese domestic affairs, you have enough to do in your own country btw...",
				"added": 1630217623
			},
			{
				"comment_id": 153,
				"body": "seriously create your own militias...",
				"added": 1630224132
			},
			{
				"comment_id": 154,
				"body": "and recent history proves that rat tags army have a way better battlefield performance than regular armies :). and you know joe his bluffing he won't nuked D.C., nancy wouldn't allowed it :) but texas... that's another story... that's where her lover was killed...",
				"added": 1630224294
			}
		]
	},
	"comment_vote": {}
}