{
	"title": "COVAL ",
	"description": "coval.cc",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 3,
	"demo": false,
	"modified": 1498046904,
	"post": [
		{
			"post_id": 2,
			"title": "COVAL ZERO",
			"date_published": 1498017120.298,
			"body": "Hello ZeroNet!\n\nThis blog will be used to provide information about a service that we are developing for the ZeroNet community called COVAL ZERO which is a new naming service under development **specifically** for ZeroNet sites. What follows are some announcements and a general overview of the project.\n\nA basic description is available here:\n\n[https://coval.cc/#covalzero](https://coval.cc/#covalzero)\n\nA diagram (draft) can be seen here:\n\n[https://coval.cc/#covalzero-diagram](https://coval.cc/#covalzero-diagram)\n\nThe service leverages the unique crypto asset **ZERO** on the Counterparty platform (Bitcoin blockchain meta-layer) and uses a new feature called _subassets_ which allows for creating new assets such as **ZERO.TAMAS**.\nWe are using the **ZERO** asset as a domain namespace **specifically for ZeroNet**.\n\n**All ZERO names will resolve to ZeroNet sites ONLY**. This is different than .bit namecoin domains which can point anywhere (which is also good). We feel that a namespace tied directly to ZeroNet that gives the assurance that the domains can only resolve to ZeroNet p2p network would be a good alternative naming service for the community to have available to them.\n\nThe service will also leverage the domain name **[zero.network](http://zero.network)** and it's DNS Zone as an additional layer which will store data in TXT records (dnssec enabled). The domain will also provide email forwarding addresses to name owners and an HTTP proxy to ZeroNet sites. The [diagram](https://coval.cc/#covalzero-diagram) shows how this would likely work in more detail.\n\nWe are also actively looking into making this service even more robust by using Ethereum and Blockstack as additional layers that store each ZERO name record metadata and ZeroNet bitcoin addresses that the name points to. We also have our own distributed ledgers running that will be used as part of this service.\n\nSince ZERO names are Counterparty assets on the Bitcoin blockchain, each name owner has the capability to issue tokens. For example, Tamas could issue 100k ZERO.TAMAS tokens and sell them to raise development funds and then let holders of these tokens have early access to new features or maybe a free pass to a ZeroNet conference in the future. This is a differentiating feature to namecoin names that we think people will find creative uses for, especially as crypto token economies become a more normal part of our digital lives. Of course the ZERO.TAMAS name also has an associated bitcoin address which can also be used to receive btc and other tokens of value.\n\nReserving and registering COVAL ZERO names will require the ₡OVAL cryptocurrency for payment. ₡OVAL can be acquired on some public exchanges such as [Bittrex](https://www.bittrex.com/Market/Index?MarketName=BTC-COVAL). A portion of these fees will be burned but we are also pleased to announce that we will be **donating 25% of registration fees to Tamas** to support future ZeroNet development!\n\nPrice and purchase option details have not yet been finalized. We may end up using an auction system. We will post updates on this blog as this and other details become available.\n\nWe at COVAL have been supporters of ZeroNet since the very beginning (zero.network was once a proxy server) and are amazed at what Tamas and others involved have managed to create in the last few years. It is an admirable innovative project and we want to help sustain it into the future. We also plan to integrate our own platform more with ZeroNet and we will be discussing those plans soon.\n\nWe look forward to interacting with the ZeroNet community and Tamas and hope to receive feedback and beta testers as we get deeper into the development cycle.\n\nThanks!\nSull\n\n[coval.cc](https://coval.cc)"
		}
	]
}