{
	"next_topic_id": 15,
	"topic": [
		{
			"topic_id": 1526597781,
			"title": "NZ Republic vs. NZ Democracy",
			"body": "**[Facts]** \nSimply put - the key difference between a democracy and a republic lies in the limits placed on government by the law, which has implications for minority rights. Both forms of government tend to use a representational system — i.e., citizens vote to elect politicians to represent their interests and form the government. \n&nbsp;\n**In a republic, a constitution or charter of rights protects certain inalienable rights that cannot be taken away by the government, even if it has been elected by a majority of voters**. \n&nbsp;\n**In a \"pure democracy,\" the majority is not restrained in this way and can impose its will on the minority.**\n&nbsp;\nMost modern nations are democratic republics with a constitution, which can be amended by a popularly elected government. This comparison therefore contrasts the form of government in most countries today with a theoretical construct of a \"pure democracy\", mainly to highlight the features of a republic.\n&nbsp;\n**[Opinion]**\nThe New Zealand Republican Party would guarantee the following constitutional rights:\n- A no-strings-attached, weekly Universal Basic Income of $300 paid to every New Zealand Citizen or Permanent Resident.\n- The right to the personal use of recreational substances without legal consequences (drug decriminalisation).\n- The right to free speech, and the right to have one's voice heard on online platforms.\n- The protection of private property.\n- The abolition of most forms of copyright law.\n- The abolition of punitive and unnecessary taxes i.e. Tobacco tax, plastic bag tax, fuel tax, imports tariffs, etc.\n- The introduction of higher taxes on wealthy individuals and corporations, while reducing taxes for low earners.\n- The right to online privacy.\n- More to come.",
			"added": 1526597780
		},
		{
			"topic_id": 1526598676,
			"title": "Replacing Work and Income with Universal Basic Income",
			"body": "**[Discussion]**\n&nbsp;\n**[Opinion]**\nWe should replace Work and Income & all benefits with a Universal Basic Income, so as to guarantee the abolition of poverty in this country, and the flexibility of work and the economy as a whole.\n&nbsp;\nUnlike the UBI, WINZ encourages idleness by cutting off vital payments to people who are struggling financially even after finding work. This also has the effect of worsening nationwide mental health, as well as increasing stress levels.\n&nbsp;\nThere will always be people who refuse work. Then again, the only solution to this problem is to make work attractive, not use it as a form of punishment. There are many other reasons people choose to work, including social, moral and cultural values.\n&nbsp;\nIt's time for 21st century politics!",
			"added": 1526598674
		},
		{
			"topic_id": 1526598714,
			"title": "Legalising the Recreational Use of Cannabis",
			"body": "**[Discussion]**\n&nbsp;\n**[Opinion]**\nCannabis should be fully legalized, taxed and regulated as a recreational and medicinal drug.",
			"added": 1526598711
		},
		{
			"topic_id": 1526598782,
			"title": "Improved Mental Health Services",
			"body": "**[Discussion]**\n&nbsp;\n**[Opinion]**\nMental health services in our country are horrendously underfunded and seem to be focused on medicating our problems away, **as opposed to talking about them in a rational, scientific manner.**",
			"added": 1526598778
		},
		{
			"topic_id": 1526598848,
			"title": "Revolutionising Tertiary Education",
			"body": "**[Discussion]**\n&nbsp;\n**[Opinion]**\nTertiary education must get with the times and understand that the millennial generation learns differently compared to past generations. We need more learn-at-home opportunities.",
			"added": 1526598843
		},
		{
			"topic_id": 1526600430,
			"title": "Electing the Leader of the New Zealand Republican Party",
			"body": "I'm probably not fit enough to be leader of the NZRC, as I'm 25 years old and on disability, but I'd be more than happy to appoint somebody else for the job, so long as he/she believes in our values!\n&nbsp;\nMust be someone with guts, and must always speak his/her mind.\n&nbsp;\n**[Discuss]**",
			"added": 1526600424
		},
		{
			"topic_id": 1526603410,
			"title": "Path to Revolution = Peaceful Referendum",
			"body": "**[Opinion]**\nIn my own personal opinion, given how impossible it has become for third parties to have seats in parliament, I would propose a peaceful referendum for the abolition of the parliamentary system and the establishment of the Free New Zealand Republic under a newly elected leader.\n&nbsp;\n**[Discuss]**",
			"added": 1526603403
		},
		{
			"topic_id": 1526608259,
			"title": "Smart Immigration",
			"body": "**[Opinion]**\nWe need to keep immigration in check.\n&nbsp;\n**That means letting people in based on their values, not the size of their wallets. We don't want people piggy-backing on New Zealand to get to Australia, or eroding our culture of freedom and progressiveness.**\n&nbsp;\n**[Discuss]**",
			"added": 1526608251
		},
		{
			"topic_id": 1526611884,
			"title": "Encouraging Electric Vehicles",
			"body": "**[Opinion]**\nThe only way to achieve mass-adoption of electric vehicles is simple: More government-funded research is needed to develop more affordable and efficient battery technology. This would pay off in future by reducing the cost of fuel and transportation, which means more money in the pocket for New Zealanders! \n&nbsp;\nWe also need to encourage bicycle / e-bike transportation by improving nation-wide cycling infrastructure, including inter-state routes. This has the benefit of reducing traffic congestion, not to mention making transportation safer for New Zealanders.\n&nbsp;\n**[Discuss]**",
			"added": 1526611875
		},
		{
			"topic_id": 1526612821,
			"title": "Your Honeymoon is Over, Politicians!",
			"body": "**[Opinion]**\nPolitics is serious business and should be treated as such. We will reduce the number of government office jobs by firing useless pricks who look down on our working class.\n&nbsp;\n**[Discuss]**",
			"added": 1526612811
		},
		{
			"topic_id": 1526613870,
			"title": "My Social Media Profiles",
			"body": "More to come...\nhttps://twitter.com/NZRepublican\nhttps://www.facebook.com/misses.robot",
			"added": 1526613859
		},
		{
			"topic_id": 1526699711,
			"title": "Enlightenment vs. Modern Life",
			"body": "[Opinion]\nThere is no denying that modern life is killing us. Regardless of which religion you believe in, we have to admit that spirituality and philosophy is hugely lacking in our every day lives, not to mention academia.\n&nbsp;\nOur pursuit of monetary gain and the perfect career will lead us down a path of self-destruction. We need time for contemplation and self-exploration. \n&nbsp;\nKnow Thyself. Know the World. Know your Environment.",
			"added": 1526699699
		},
		{
			"topic_id": 1526701185,
			"title": "Floating Cities: Research Labs of the Future, or Pipe Dream?",
			"body": "https://www.youtube.com/watch?v=MEbkfAL2Tlg\n&nbsp;\nTechnology is evolving at a steady rate, so we might just get lucky enough to be able to build this affordably.",
			"added": 1526701172
		},
		{
			"topic_id": 1526703087,
			"title": "If you're Unemployed - Teach yourself Programming!",
			"body": "**[Opinion]**\n&nbsp;\nDon't get a real job - stay at home and learn Python!\nhttps://www.youtube.com/watch?v=N4mEzFDjqtA\n&nbsp;\n..Arguably, the best use of your time. And it's free (so long as you have internet access and a PC!)\n&nbsp;\nDon't worry too much about bills. Educated homeless people are insanely dangerous for society. Give em' hell.. ^^",
			"added": 1526703073
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1526608259_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "> [accept](#comment_1_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP): I would like it happens in France, but the government doesn't want to hear people like me... We fed up with immigrants and muslims..\n\nWe also need to encourage muslim people to improve their own countries through peaceful revolution ... rather than moving to another country and thinking that their problems will go away. We can only take so many people at once.\n&nbsp;\nThe exception to this rule would obviously be refugees who really are in danger, and are fleeing warzones.\n&nbsp;\n..Then again -> The reason we have a refugee crisis to begin with ... is because we stuck our noses in the wrong places where they didn't belong. Overseas military interventions in the middle east must come to an end.",
				"added": 1526680494
			}
		],
		"1526613870_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "**[Updated]**",
				"added": 1526765488
			}
		]
	},
	"comment_vote": {
		"1_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP": 1
	}
}