{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "BOINC",
			"body": "BOINC - Berkeley Open Infrastucture For Network Computing é uma plataforma, na forma de framework, que visa a facilitar a implementação de sistemas de computação voluntária, funcionando através de uma grade computacional de dimensões mundiais, através de computação distribuída.\n\n- https://boinc.berkeley.edu/",
			"added": 1529708936
		},
		{
			"topic_id": 2,
			"title": "Como Aprendemos – Benedict Carey",
			"body": "# Desde muito cedo, somos adestrados: nervosismo, distração e falta de conhecimento são inimigos do sucesso. Afirma-se que a aprendizagem se resume à autodisciplina, que devemos estabelecer as áreas de estudo nas quais queremos nos concentrar, desligar o som e manter um rígido ritual se quisermos gabaritar a prova, memorizar a apresentação a ser feita ou arrasar na audição de piano. E se tudo que já nos disseram sobre o processo de aprendizagem estiver errado? E se houver uma forma de sermos mais bem-sucedidos com menos esforço? Em Como aprendemos, o premiado jornalista Benedict Carey faz uma varredura em décadas de pesquisas e estudos que se tornaram referência na área de educação e revela como o cérebro absorve e retém informações - desde o momento em que nascemos, aprendemos de forma rápida, eficiente e automática. No entanto, na ânsia de sistematizar o processo, ignoramos ferramentas de aprendizado valiosas e naturalmente agradáveis, como o esquecimento, o sono e os devaneios. Uma mesa em um ambiente silencioso é realmente a melhor maneira de estudar? Variar a rotina de estudo potencializa a memória? Há momentos em que uma distração pode ser benéfica? A repetição é necessária? A busca de Carey por essas respostas resultou em diversas estratégias que tornam a aprendizagem parte da vida diária - em vez de uma obrigação. Ao testar in loco muitas das contraintuitivas técnicas descritas neste livro, Carey demonstra como podemos trabalhar os músculos neurais que possibilitam o aprendizado profundo. Ao longo do livro, o autor explica por que os professores deveriam aplicar a prova final no primeiro dia de aula, por que devemos intercalar assuntos e conceitos quando aprendemos algo novo e quando é mais adequado ficarmos acordados até mais tarde para a preparação de uma apresentação e não nos levantarmos cedo para uma última revisão em cima da hora. Se tudo isso parece inacreditável demais para ser verdade, é porque o estudo desafia as tradicionais suposições sobre como aprendemos. O cérebro não é como um músculo, pelo menos não no sentido mais óbvio. É totalmente diferente, sensível ao estado de espírito, ao timing, aos ritmos circadianos, ao local e ao ambiente. Para dizer o mínimo, não acata ordens muito bem. Se o cérebro é uma máquina de aprendizagem, trata-se de uma máquina muito excêntrica. Benedict Carey nos mostra como explorar as peculiaridades do cérebro a nosso favor.\n\n- https://web.archive.org/web/20180623010124/https://ipfs.io/ipfs/QmWy1eCqzXkNEnYvBkHLtAG6noe837TbxLx93aC78BaMbE",
			"added": 1529715768
		}
	],
	"topic_vote": {
		"1_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"3_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"10_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"16_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"11_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"1_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"2_1DXwV6AnTivjXn2p4r1a6Rd1J7VGZKTKr3": 1,
		"1_1DXwV6AnTivjXn2p4r1a6Rd1J7VGZKTKr3": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Números perfeitos ímpares\n- https://web.archive.org/web/20180622215151/https://ufsj.edu.br/portal2-repositorio/File/profmat/TCC_09_Jaqueline.pdf\n- https://web.archive.org/web/20180622215303/https://arxiv.org/pdf/hep-th/0401052v3.pdf",
				"added": 1529704732
			},
			{
				"comment_id": 2,
				"body": "#Axiomas de Zermelo-Fraenkel\n- https://web.archive.org/web/20180622220318/http://math.sfsu.edu/smith/Math800/Units/Zermelo-FraenkelSetTheory.pdf",
				"added": 1529705086
			},
			{
				"comment_id": 3,
				"body": "#Problemas de Landau\n\nOs Problemas de Landau são quatro conhecidos problemas sobre os números primos, que Edmund Landau catalogou como \"inatacáveis no estado atual da ciência\" durante o Congresso Internacional de Matemáticos de 1912.\n\n#Os quatro problemas são os seguintes:\n\n- A conjectura de Goldbach: Todo número par maior que 2 pode ser expresso como a soma de dois números primos?\n- A conjectura dos números primos gêmeos: Há infinitos números primos p tais que (p+2) também é um número primo?\n- A conjectura de Legendre: Sempre existe um número primo entre dois quadrados perfeitos ?\n- A conjectura de que há infinitos números primos p tais que (p-1) é um quadrado perfeito. Dizendo de outra forma, há infinitos números primos da forma (n^2) + 1 ?",
				"added": 1529706098
			},
			{
				"comment_id": 4,
				"body": "#Problemas de Hilbert\n- https://web.archive.org/web/20170729213741/http://www.ams.org/journals/bull/1902-08-10/S0002-9904-1902-00923-3/S0002-9904-1902-00923-3.pdf",
				"added": 1529707342
			},
			{
				"comment_id": 6,
				"body": "#Cálculo de variações\n- https://www.youtube.com/playlist?list=PL521C2DFD15FF568C",
				"added": 1529707885
			},
			{
				"comment_id": 7,
				"body": "#Ciência da Computação - Hipótese de Riemann e suas Aplicações\n- https://www.youtube.com/playlist?list=PLbMVogVj5nJRaBWHpgPX04ndIF2rloGUC",
				"added": 1529707981
			},
			{
				"comment_id": 8,
				"body": "#Matemática - Geometria Algébrica Básica: Variedades, Morfismos, Anéis Locais, Campos Funcionais e Não Singularidade\n\n- https://www.youtube.com/playlist?list=PLbMVogVj5nJSNj24jdPGivlJtxbxua2by",
				"added": 1529708092
			},
			{
				"comment_id": 12,
				"body": "#Enigma de Martin Gardner\n-     Persistência de um número é o número de passos necessários para reduzi-lo a um único dígito multiplicando todos os seus algarismos para obter um segundo número, depois multiplicando todos os dígitos deste número para se obter um terceiro número, e assim por diante, até que um número de um dígito é obtido. Por exemplo, 77 tem uma persistência de quatro, porque requer quatro etapas para reduzi-lo a um dígito: 77-49-36-18-8. O menor número de persistência 1 é 10, o menor de persistência 2 é 25, o menor de persistência 3 é 39, e o menor de persistência 4 é 77. Qual é o menor número de persistência cinco?",
				"added": 1529709626
			},
			{
				"comment_id": 13,
				"body": "#Entropia da informação\n- https://web.archive.org/web/20180622233047/http://www.mat.ufmg.br/~tcunha/entropia.pdf",
				"added": 1529710301
			},
			{
				"comment_id": 15,
				"body": "#Gerador Markoviano de Letras de Música\n- http://capivara.free.fr/tony/?p=5",
				"added": 1529711200
			},
			{
				"comment_id": 18,
				"body": "#Todos os números perfeitos são pares?\n\n#Existem infinitos números perfeitos?",
				"added": 1529712127
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "#Campos geodésicos\n\n- Parte 1: https://web.archive.org/web/20160306042035/http://neo-classical-physics.info/uploads/3/0/6/5/3065888/geodesic_fields_-_pt._1.pdf\n- Parte 2: https://web.archive.org/web/20160305094433/http://neo-classical-physics.info/uploads/3/0/6/5/3065888/geodesic_fields_-_pt._2.pdf",
				"added": 1529707799
			},
			{
				"comment_id": 9,
				"body": "#Sexto problema de Hilbert\nO sexto problema de Hilbert é um dos mais complicados problemas da famosa lista, pois a sua proposta é transformar toda a física em axiomas e vai de encontro ao fato de que muitas verdades matemáticas algumas vezes não serem correspondidas na física e vice-versa.\n\n#Buscando a unificação\n- Se fossemos montar então axiomas unificados (física e matemática) teríamos que anular algumas verdades matemáticas ou algumas verdades físicas. Porém com os novos avanços tanto na matemática quanto na física muitos axiomas puderam ser reformulados graças à física quântica e à teoria da computação algorítmica na matemática (terceiro problema de Hilbert). Através desses dois campos \"teóricos\", com eles não seria possível apenas vários axiomas que definam matematicamente a física, mas uma lei matemática geral que defina toda a física, como um algoritmo finito, mas esse caminho é o mais difícil por estar muito distante, as teorias físicas se renovam com frequência notável e um algoritmo que defina infinitos números de dados tão complexos, aleatórios e caóticos seria impossível pelo menos para a capacidade humana, para definir toda física de maneira matemática é bem mais fácil pensar em um universo físico como um todo, algo que \"segue padrões quantitativos\", porém quando vamos considerar o universo como um todo e trazer isso para um ou uns algoritmos matemáticos encontramos cálculos ilimitados e incalculáveis humanamente, por isso o problema ainda não foi resolvido de forma matemática.\n\n#Nota: https://web.archive.org/web/20180622230010/http://www.ams.org/journals/bull/2014-51-02/S0273-0979-2013-01439-3/S0273-0979-2013-01439-3.pdf",
				"added": 1529708307
			},
			{
				"comment_id": 10,
				"body": "#O que acontece quando uma força irresistível encontra um objeto irremovível? Não há solução, certo? Pelo menos uma dessas duas coisas não pode existir. Como um exercício de lógica, esse raciocínio poderia ser considerado. Do ponto de vista físico, no entanto, é inconcebível. Por um lado, até mesmo uma força minúscula causa alguma aceleração em um objeto. Por outro lado, uma força irresistível iria requerer energia infinita, e isso não existe no universo.",
				"added": 1529709104
			},
			{
				"comment_id": 14,
				"body": "#Termodinâmica - USP\n- https://www.youtube.com/playlist?list=PL1Dg4Oxxk_RLWavMCBeypDy3T2IM5EiDC",
				"added": 1529710594
			},
			{
				"comment_id": 19,
				"body": "#Relatividade bem comportada: buracos negros regulares\n- https://web.archive.org/web/20180623001139/http://www.scielo.br/pdf/rbef/v39n3/1806-1117-rbef-39-03-e3303.pdf",
				"added": 1529712761
			},
			{
				"comment_id": 20,
				"body": "#O Universo é Infinito?\n- https://youtu.be/dG1JpC5jels",
				"added": 1529713168
			},
			{
				"comment_id": 22,
				"body": "#Como construir uma máquina do tempo\n- https://web.archive.org/web/20180623032243/https://www2.uol.com.br/sciam/reportagens/como_construir_uma_maquina_do_tempo.html",
				"added": 1529724357
			}
		],
		"3_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": [
			{
				"comment_id": 11,
				"body": "#O quebra-cabeça lógico mais difícil do mundo\n- https://web.archive.org/web/20180622231550/http://www.thebigquestions.com/boolos.pdf",
				"added": 1529709483
			}
		],
		"1_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": [
			{
				"comment_id": 16,
				"body": "#BOINC\n- https://play.google.com/store/apps/details?id=edu.berkeley.boinc",
				"added": 1529711364
			}
		],
		"1_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": [
			{
				"comment_id": 17,
				"body": "#Platonismo matemático\n- https://web.archive.org/web/20180622235404/http://case.edu/artsci/phil/PMPlatonism.pdf\n- https://web.archive.org/web/20180622235433/http://www.phil.cmu.edu/projects/bernays/Pdf/platonism.pdf",
				"added": 1529711745
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 21,
				"body": "#Salmos 3\n\n1 Senhor, muitos são os meus adversários! Muitos se rebelam contra mim!\n\n2 São muitos os que dizem a meu respeito: \"Deus nunca o salvará! \" Pausa\n\n3 Mas tu, Senhor, és o escudo que me protege; és a minha glória e me fazes andar de cabeça erguida.\n\n4 Ao Senhor clamo em alta voz, e do seu santo monte ele me responde. Pausa\n\n5 Eu me deito e durmo, e torno a acordar, porque é o Senhor que me sustém.\n\n6 Não me assustam os milhares que me cercam.\n\n7 Levanta-te, Senhor! Salva-me, Deus meu! Quebra o queixo de todos os meus inimigos; arrebenta os dentes dos ímpios.\n\n8 Do Senhor vem o livramento. A tua bênção está sobre o teu povo. Pausa",
				"added": 1529713775
			}
		]
	},
	"comment_vote": {
		"1_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"3_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"4_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"10_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"15_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"13_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"17_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"18_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"19_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"20_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1,
		"21_1AwAXoe7XafYx72YxVejg7KCyFFTpUBcDH": 1
	}
}