{
	"next_post_id": 7,
	"next_comment_id": 11,
	"next_follow_id": 5,
	"avatar": "generate",
	"user_name": "Oncatcoaster",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Web Developer: php, html5, css3, js, jquery , SQL & SQLite.\n\nDeveloper: java, node.js, vb.net, C#.\n\n\n",
	"post": [
		{
			"post_id": 1549701533,
			"body": "taking spam to train an artificial intelligence",
			"date_added": 1549701531,
			"meta": "{\"img\":\"900,496,eeddddeeeccccdcdccccdddefff,011211222233333102224533361777311112088231111202223111100222\"}"
		},
		{
			"post_id": 1549742935,
			"body": "I will start the project on GIT in the coming days, anyone who wants to help sort the spam in an intelligent way then just write me.\nI only ask for some skills:\nNODE.JS - moderate\nJS - advanced\nSQLite & Query Language - moderate\n\nyou can write both here and by z-mail!\n\n",
			"date_added": 1549742932
		},
		{
			"post_id": 1549760404,
			"body": "the project related to AI anti spam, is based on the fact that the network is P2P so each user must have an instance of this AI in their PC.\n\nthe AI ​​will only be activated when a new post or comment is received, so it will not occupy CPU while you visit the page, once the AI ​​recognizes a spam message in a DB the user's name is sent, the In addition, the total number of AIs that processed the message / positiveness is calculated, ie if it is spam, / or negativity (this is also an anti-alteration of the data). In addition, to avoid too many checks once a user crosses a spam threshold, he is automatically categorized as a spammer in the database.\n\nI decided that it will be directly the user to feed their own new content that is spam, however do not worry to make ready to use will be trained with at least 12k samples, each IA will vote only once, obviously we will also put a limit to voting to avoid alterations.\n\nMAX_VOTES_IA = 500\n This neural network draws power from the P2P making it a network to shared resources and just because it will be integrated into ZeroTalk (or in a possible FORK) it will be possible to clone the whole system.\n\n...MOREOVER...\nif the project should work, I will export any malicious Spammer users to my blocklist colleagues (a neural network can train to recognize various types of messages, from threats to scams, to spam and attempted priming. of extremely big data to be precise, that's why it can not be trained only with 12k samples but it will be used in USER Confirm mode since at least the first year will not be self sufficient])\n\n   ^^^^^^^^^^^^^^^^^^^^^^^this is almost how it should work ^^^^^^^^^^^^^^^^\n\n\nHow long will it take to design it?  => about 2 months\nHow long will it take to create it? => about 2 months + BETA (on a forum fork) and FIXES\nHow long will it take to train it properly? => more people use the forum and the process will be fast as well as accurate\nAfter creating it how long will it be operational? about 4 or 5 months.\n\n",
			"date_added": 1549760400
		},
		{
			"post_id": 1549808788,
			"body": "just talking about people who think I'm part of the government, no I'm not.\nI just want a zeronet clean of things that should not exist.",
			"date_added": 1549808783
		},
		{
			"post_id": 1549815290,
			"body": "",
			"date_added": 1549815284,
			"meta": "{\"img\":\"900,496,334344345234233445223,012103444401110344440555134000055213010301100330340220034644\"}"
		}
	],
	"bgColor": "#D30C37",
	"post_like": {
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549989173": 1549989660
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Quantumworld: I want to teach an artificial intelligence to recognize spam, and even if there are only a few, there are 6000 samples\n\nall this by converting the entire sentences into numbers, so that the machine can assimilate them.",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549724288
		},
		{
			"comment_id": 2,
			"body": "@Quantumworld: js because i want use the code directly on the zerotalk page.\n\n@Leftside: currently i'm learning how to use the librarys for the neural network, in 1 week i think i can leak out some code\n\n@Quantumworld: i dont want use loops to wait a new post, i will ask to nofish if he can trigger a function everytime a new post is created",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549742043
		},
		{
			"comment_id": 3,
			"body": "@Quantumworld: actually should work even a pseudo AI (word counter, repetitive words & ecc..)\n\ngiving to that a neural network means every single machine connected has shared informations & private informations, so if i want can i choose what the user want to see. ignoring spam and useless content for the user. (i will not do that, but i want to make a good anti spam/anti swear, yeah i can even add a third output, about swears)",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549742527
		},
		{
			"comment_id": 4,
			"body": "@Quantumworld: i want use JS, because i want pun the NeuralNetwork directly into zerotalk \n\nprobably i'll do an API system for EASY, JS for keep the IA P2P",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549701533",
			"date_added": 1549758962
		},
		{
			"comment_id": 5,
			"body": "@Quantumworld: sure! i dont want limit anyone",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549760404",
			"date_added": 1549799229
		},
		{
			"comment_id": 6,
			"body": "@Realjohndoe: in fact I have to understand why people hate blocklists, they are not obliged to apply them.\n\ncan you help me to check if my forum is now working?",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549808788",
			"date_added": 1549810877
		},
		{
			"comment_id": 7,
			"body": "@Realjohndoe: ok is a public list where people can apply if and only if they agree with what they are dealing with",
			"post_uri": "155V1pDJWxxohR8eNgocGarkipstcSEARJ_1549808788",
			"date_added": 1549810943
		},
		{
			"comment_id": 8,
			"body": "i gonna to remove it now\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549989173",
			"date_added": 1549989514
		},
		{
			"comment_id": 9,
			"body": "i've to work to soome things\n",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549989173",
			"date_added": 1549989542
		},
		{
			"comment_id": 10,
			"body": "Done we should make a group of Blockers",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1549989173",
			"date_added": 1549989681
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1549690853
		},
		{
			"follow_id": 2,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE",
			"user_name": "Quantumworld",
			"date_added": 1549800023
		},
		{
			"follow_id": 4,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1JGLcd9SrxuxdEYR2AGTVR6MeyVw8qQt9L",
			"user_name": "Bluishcoder",
			"date_added": 1549816000
		}
	]
}