{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Una wiki italiana",
			"body": "Ciao a tutti!\nHo messo giù una sorta di libretto telefonico di zites italiani ^_^\n\n[0Nita](http://127.0.0.1:43110/1BrdUYNAbRt4P2Jxpgk5WhtKR2oLicBgcw)\n\n--- \n**EDIT**:\n[Porting su SQLite](/121RPConrCLF4pu8uhKBnPHjyvhLhtJXr4)",
			"added": 1476677389
		}
	],
	"topic_vote": {
		"1_15QtjbVmt2vpP97mKhT9wnzKfgVBM33BJG": 1,
		"1_1NtonDtFHKWJ1YM1qxjQX8KvrxiEN1xzRj": 1,
		"1_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_15QtjbVmt2vpP97mKhT9wnzKfgVBM33BJG": [
			{
				"comment_id": 1,
				"body": "> [totolook](#comment_4_15mbQo7qMzz7e2kBiLbkDrYDo2pzzWvCBH): Poterebbe andare bene, ma che contenuti  metteranno?\n\nsi potrebbe condividere i siti più utili e quindi creare un blog apposito.. magari siti italiani!",
				"added": 1461524500
			},
			{
				"comment_id": 3,
				"body": "> [mica](#comment_7_1HqoeFbTuYXgQLYoh9t3ovxY6We44E45ms): sì non capisco molto l'idea di usare Telegram per parlare di ZeroNet. Ci siamo già dentro, parliamone direttamente qui.\n\nQuoto.. sapete di forum italiani qui in zona? A parte lo 0talk..",
				"added": 1472339087
			}
		],
		"1_1DpjGe8YZWP3idvaNTbBbHzuda341g4W2k": [
			{
				"comment_id": 2,
				"body": "per me, il sito di news è il + \"figo\" :)\nanche se penso che la piattaforma in sè lo sia.. tutti questi blog mi incuriosiscono le giornate, spulcio quà e là e so di contribuire al progetto anche solo visitando pagine a caso :)\n\nsecondo me verrà usato e lo spero, per divulgare notizie di cui si sa possano esser censurate in qualche modo.\nnon credo sostituirà il web \"standard\" nel tempo breve per via della poca facilità nel raggiungerlo (non alla portata di chi non si interessa di informatica o smanetta un minimo con l'informatica)..\n\nse si riuscisse invece a sfruttare in qualche modo più intenso la risorsa \"proxies\" allora si, potrebbe prender piede molto velocemente :)\n\nsecondo me l'anonimo è una risorsa potente quando si vuole scrivere cose di cui \"ce ne si potrebbe pentire\" tipo censure nazionali perseguibili penalmente, a meno che... tu non sia completamente anonimo ;)",
				"added": 1461654458
			}
		],
		"1_1NtonDtFHKWJ1YM1qxjQX8KvrxiEN1xzRj": [
			{
				"comment_id": 4,
				"body": "[0Nita](http://127.0.0.1:43110/1BrdUYNAbRt4P2Jxpgk5WhtKR2oLicBgcw) è un sito che sto tirando su per raccogliere tutti i siti italiani qui sulla rete p2p =)\nse ti va, aggiungi anche lui ^_^",
				"added": 1476829763
			}
		]
	},
	"comment_vote": {
		"4_15mbQo7qMzz7e2kBiLbkDrYDo2pzzWvCBH": 1,
		"7_1HqoeFbTuYXgQLYoh9t3ovxY6We44E45ms": 1,
		"2_1B4eE8JoHXM6n19fgtMcrJmH168PZwj39t": 1,
		"4_17Y76A97fwqtoTXaCedsmzsFL1D2VcwMnL": 1
	}
}