{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1567352662,
			"title": "oniichan",
			"body": "Does anyone know what happened to oniichan? the onion link I have no longer works. Did they go v3, or are they dead?",
			"added": 1567352661
		},
		{
			"topic_id": 1567460587,
			"title": "8ch alternative that doesn't suck",
			"body": "I know about 08chan but it is shitty and doesn't actually solve the problem left by the closing (however temporary) of 8ch.net. Other than 4chan, which is a giant honeypot, where can a guygo for news, politics, and racism where there isn't a leftist mainstream bent?",
			"added": 1567460585
		},
		{
			"topic_id": 1568049053,
			"title": "Pornstar Jenni Lee = Paid Toll",
			"body": "Just a daily reminder that porn is degenerate, and damages highly suggestible young women to the point of being mostly irredeemable. \n\nOur latest example is Jenni Lee. Her real name is Stephanie Saddora. She got started in professional slutting working as a automotive and fashion model. Eventually she got married, and popped out a child, but the lure of porn money was too strong, so she blew the whole thing up and went back to porn. She lost her husband and her child and started taking copious amounts of dick for money. \n\nShe last acted in 2015. At the time she was still pretty hot for a woman in her thirties, but the wall was swiftly approaching.\nIt's unknown exactly why she stopped acting professionally, but she probably just aged out. She then made a couple of attempts to harvest betabux from the few stragglers that hadn't moved on from her with the establishment of jennileeonline.com. This effort failed quickly due to competence and lack of interest. In late 2016 all of her social media accounts went silent and she vanished from the internet altogether. \n\nShe now lives in an overflow flood prevention tunnel under the city of Los Vegas. How fitting.",
			"added": 1568049050
		},
		{
			"topic_id": 1568052562,
			"title": "Question: How to run ZeroNet on a dedicated headless box.",
			"body": "Is it possible to set up zeronet to run on my headless box, and access it remotely?",
			"added": 1568052558
		},
		{
			"topic_id": 1568508391,
			"title": "Help out a retard. Trying to set up a permanant zeronet node.",
			"body": "Background: I typically run zeronet on my laptop, over tor, via vpn. I can't leave it running like this more than a couple hours shours a day because I need my laptop for work, and I can't burn up my lte plan. When I'm at home on wifi I let it go. \n\nI can't buy a lot of hardware because I'm poor. I did purchase a box that I've connected directly to my router. \n\nMy question is this: How can I set up zeronet to run on a headless box, where I can access the graphical interface on a different computer on the same router.",
			"added": 1568508386
		},
		{
			"topic_id": 1568563605,
			"title": "Zero Trackers: why?",
			"body": "My client shows 0/13 trackers, and doesn't seem to be able to connect to any. What can I do?",
			"added": 1568563599
		}
	],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"1567352662_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 1,
				"body": "> [mfs](#comment_45_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Alive for me on V3. I don't have V2 anymore so I can't test that for you at the moment. [...]\n\nwould you kindly provide the v3 link?",
				"added": 1567354646
			},
			{
				"comment_id": 2,
				"body": "> [kidcourageous](#comment_81_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Works\n\nI wonder why i'm unable to access. would you kindly provide the onion link?",
				"added": 1567446781
			}
		],
		"1567460587_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 3,
				"body": "> [whitepower](#comment_1_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW): Daily Stormer, but I don't think a weakling like you can get in there and it is better for everyone that way.\n\nwhat a faggy thing to say.",
				"added": 1567464156
			}
		],
		"1568049053_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 4,
				"body": "> [kidcourageous](#comment_139_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Found the incel!\n\nDo you feel better after having said it?",
				"added": 1568050061
			},
			{
				"comment_id": 6,
				"body": "> [moor](#comment_231_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): she blew the whole thing up indeed. and what liberals do? shame a porno star to suicide...\n\nif the left cared about women at all, they would assault the porn industry as a whole. it is a destructive scourge that is doing its best to ruin as many young women as possible.",
				"added": 1568050596
			},
			{
				"comment_id": 7,
				"body": "> [atomiserxenolith](#comment_128_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): How would you 'assault the porn industry'?\n\nassuming that I had the unfettered ability to perform the necessary actions, I would begin with a campaign of mass executions for all US based pornography companies, heavy monetary fines for all ISPs that fail to implement my new filtering laws, identify and execute all owners, managers, and employees of hosting companies that serve large volumes of porn after a grace period. Basically, the porn epidemic has reached such proportions that without direct violent action it can never be stamped out. The only answer at this point is blood, blood, blood.",
				"added": 1568075161
			},
			{
				"comment_id": 8,
				"body": "> [atomiserxenolith](#comment_129_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): You believe that murder is morally superior to on screen sex?\n\nNice try. It's not about moral superiority. It's about the total annihilation of a scourge that is damaging an entire generation of young people.",
				"added": 1568075840
			},
			{
				"comment_id": 9,
				"body": "> [atomiserxenolith](#comment_130_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): 'total annihilation of a scourge that is damaging an entire generation of young people.' is morally equivalent to onscreen sex?\n\nCheck it out dude, I don't care what you think. You can take your opinion and shove it. You don't like what I think? Tough. I'll never have the power to execute my will anyway, so it's a moot point.",
				"added": 1568076149
			},
			{
				"comment_id": 11,
				"body": "> [wizardking](#comment_7_1A2qMS9kj8yHsZzuS621ttaMp8PJqT5YyU): How do you know she lives in a tunnel? If i was ever living in a tunnel I'd do my best to not live in that tunnel as soon as possible.\n\nA film crew from the netherlands was down there doing interviews of tunnel people and found her. they did a short interview and articles were written about it. It's a bit sad on the whole.",
				"added": 1568251551
			},
			{
				"comment_id": 12,
				"body": "> [wizardking](#comment_6_1A2qMS9kj8yHsZzuS621ttaMp8PJqT5YyU): sounds like Taxi Driver\n\nI'm not familiar. What is Taxi Driver?",
				"added": 1568422243
			},
			{
				"comment_id": 13,
				"body": "> [moor](#comment_238_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): at least that is how society views it today, even for male actors (only difference being in quantities). but ideally, porn should exist and actors should have total control of it. there shouldn't exist an industry or even companies. if the actors have control of it then their life decisions become tied to themselves and not to the profession. [...]\n\nAnything that makes as much money as porn will eventually be industrialized in one sense or another. I firmly believe that in this case no one wins long term.",
				"added": 1568422423
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 5,
				"body": "When the law is bullshit, There is every reason to ignore it.",
				"added": 1568050205
			}
		],
		"1568062329_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 10,
				"body": "> [caryoscelus](#comment_230_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Law abiding haters make me lol. But then again, those who have courage to ignore the law don't need to resort to hate to vent their emotions, i guess (as far as \"normal\" societies go, anyway)\n\nHow does this work? What if it's your enemies that are defining \"hate\"? How do you win then?",
				"added": 1568076260
			}
		],
		"1568417535_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 14,
				"body": "Question: I use VPN over VPN, and then that feeds into Tor. Wouldn't a smart liberal do the same?",
				"added": 1568422468
			}
		],
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 15,
				"body": "\"Dey diddin do nuffin wrong\" - Trump",
				"added": 1568422532
			}
		],
		"1568508391_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 16,
				"body": "> [5thzero](#comment_1_1FGMxLUriEo7WfRYdLFPiSJXH3MAPNkq6G): use a vps   or any machine thats online 24/7  it need hardware in order to run  or use zero via a .bit\n\nThe machine i bought for this purpose will be online 24/7",
				"added": 1568509606
			},
			{
				"comment_id": 17,
				"body": "> [gitcenter](#comment_998_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This guide is about making Tor work with ZeroNet, whilst the topicstarter most likely wants to setup ZeroNet first. Here's how to do that: [...]\n\nThanks much. \nWhat i'm working toward is a retard proof zeronet distro, where everything is already configured and ready to slam once you install the system. I think that if we can get something like this widely available we'll be more likely to build the userbase. Even better would be if we could distribute small pre-configured systems that the user only has to plug into their network, and then can access zeronet from another pc by following the instructions on a sticker or something. odds of getting zeronet interested types to actually buy something like this is about zero, though. Probably best to shoot for a live cd for now.",
				"added": 1568560106
			}
		],
		"1568563605_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 18,
				"body": "4206",
				"added": 1568564819
			}
		]
	},
	"comment_vote": {
		"16_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD": 1
	}
}