{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "翻墙软件下载",
			"body": "翻墙软件下载\nhttps://send.firefox.com/download/c9b53ce916/#XY45fIJQ-5JAsdTPnzQNsg\nhttps://send.firefox.com/download/8decae0273/#wZQPba4o7IDsl95DjmqxJQ\nhttps://send.firefox.com/download/2edd93b952/#_8jI2Y7m8GrvTaINBWKsRA",
			"added": 1523378100,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "翻墙软件下载",
			"body": "翻墙软件下载\nhttps://send.firefox.com/download/c9b53ce916/#XY45fIJQ-5JAsdTPnzQNsg\nhttps://send.firefox.com/download/8decae0273/#wZQPba4o7IDsl95DjmqxJQ\nhttps://send.firefox.com/download/2edd93b952/#_8jI2Y7m8GrvTaINBWKsRA",
			"added": 1523378222,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "91夯先生风月老司机全部作品51部合集    加速少年",
			"body": "91夯先生风月老司机全部作品51部合集    加速少年\nmagnet:?xt=urn:btih:2f90257e12789b224f7463fce0955f2741973314&dn=91%E5%A4%AF%E5%85%88%E7%94%9F%28%E9%A3%8E%E6%9C%88%E8%80%81%E5%8F%B8%E6%9C%BA%29%E5%85%A8%E9%83%A8%E4%BD%9C%E5%93%8151%E9%83%A8%E5%90%88%E9%9B%86",
			"added": 1523717538,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "世界赖有美利坚，不使独夫度流年",
			"body": "在这个互联网时代，如果要说居然还有上不了谷歌、维基百科、油管、脸书和亚马逊等一些国际知名网站的国家，你别急着自嘲——我说的是中东小国叙利亚。这个国家还有很多堪与上邦大国比肩的法律，比如你在网上发言需要实名制。\n\n阿拉伯国家因为伊斯兰教导致的全方位的落后，集各种反人类文明之大成，一直都是各种极端势力的温床。在政治形态上，至今都没有一个真正意义上的现代国家，更不要说所谓的民主国家。\n\n事实上叙利亚作为独立国家的历史并不长，近代一直是法国的殖民地，从1944年独立以来，中间还有一段时间和埃及合并。老阿萨德是“阿拉伯复兴社会党”的一员，这个名字并不陌生——萨达姆同学也曾是这个党的党员。这个党的宗旨就是要统一阿拉伯，再造星月神话。但它除了产生一堆暴君之外，并没有什么神话。\n\n自从1970年老巴沙尔发动军事政变上台以来，这个世界最古老文明发源地之一，曾经经历过腓尼基、赫梯、亚述、古巴比伦等璀璨文明的国家，就一直在巴沙尔家族的控制之下。这个家族属于叙利亚境内西北部少数教派“阿拉维派”，整个教派人口只占总人口的6%。在依靠教派、部族势力划分话语权的中东政治传统中，这种小部族的统治是相当脆弱的。\n\n所以老阿萨德表面上实行世俗主义统治，但在国内长期实行紧急状态法，取消民众基本的政治权利，靠杀人来立威的暴君作风一以贯之。\n\n1982年，为了消灭聚集在哈马的反对阿萨德家族统治的穆斯林兄弟会成员，老阿萨德动用飞机和坦克，团团围住哈马，不顾大量平民仍在城中的情况，展开包括使用氰化氢毒气攻击等手段在内的大屠杀，导致近四万平民丧命，10万人被逐出家园。\n\n使用毒气攻击包括平民在内的目标，看来一直都是这个家族的传统。或者说是中东独裁者们的传统——萨达姆就用毒气对库尔德人进行过清洗。但这并不是哈马这个城市悲剧的终结。\n\n2000年，掌权30年的老阿萨德临死之际，因为原定的继承人大儿子出车祸身亡，在英国念书，本来是一名眼科医生的二儿子巴沙尔被急召回国继位。那一年他才有34岁。\n\n但是叙利亚的宪法规定继任总统必须年满40岁——这连东方人民都难不倒，当然更难不倒阿拉伯人民，马上就修宪，把继任年龄正好降到34岁。\n\n当时西方对巴沙尔曾经抱有很高的期望，你看，好歹也是西方教育产品，长期在英国浸淫，总不至于跟卡扎菲那种养狮子住帐篷，靠炸飞机为乐的暴徒一样吧？\n\n事实证明，是体制决定了人性，而不是人性决定了体制。天降伟人金将军不也是瑞士长大的吗。2007年，巴沙尔在全民公投中以99%得票率，成功连任， 2014年，巴沙尔再次高票连任，开始第三个任期……只要不死，这种自娱自乐的游戏他们可以玩一辈子。\n\n但在这个医生的治下，叙利亚政治经济发展的全面停滞并没有得到改善，政府腐败无以复加，经济面临崩溃，失业率高企，加上不同教派的裂痕，零星的反抗始终不绝于途。\n\n2011年，黑天鹅事件终于发生。在“阿拉伯之春”的强力旋风中，达拉市15名少年受到鼓舞，在社区的墙上留下“人民希望政权倒台”的涂鸦，随后被悉数逮捕，他们的母亲甚至遭到了不明身份人员的强奸。\n\n随后一个学生因为不愿意参加政府组织的表忠心集会，被军警当着全校师生的面枪杀。这就更加激怒了民众。\n\n为了声援勇敢的少年们，抗议浪潮席卷叙利亚全国，诉求无非是民主改革，释放政治犯，更多的自由，废除紧急状态法，终结贪腐……但巴沙尔回应的方式和老爸一样，军队毫不留情的在各个城市进行大规模的镇压，使用了坦克、步兵战斗车和炮兵，至当年7月底，约有1,600名平民和500名拒绝执行命令的士兵被杀害，13,000人遭逮捕……上文提到过的悲剧城市哈马再次成为反抗中心，也不出意料的再次被政府军用坦克围城的方式血洗，哀鸿遍野。\n\n2011年7月，以空军上校里亚德•阿萨德7名叙利亚军官正式反叛，成立叙利亚自由军，正式拉开了叙利亚内战的序幕。当年11月联合国人权理事会调查委员会根据调查，认定巴沙尔对人民的残酷镇压“已构成危害人类罪”。\n\n在国际社会一致的的封杀浪潮中，不得民心的阿萨德家族政权丢盔弃甲，四面楚歌，本来倒台指日可待，怎么又会苟延残喘至今，中间还闹出伊斯兰国这些幺蛾子呢？\n\n这就跟俄罗斯，伊朗这两个人类文明的毒瘤扯上关系了。叙利亚是俄罗斯在中东地区唯一的军事盟友，俄国人大量的价高质糙的武器，就是卖给了阿萨德。在叙利亚两个空军、海军基地也是俄国人为数不多的海外秀场，是普京秀肌肉、显示俄国在中东存在感的着力点。\n\n普京在入侵格鲁吉亚、乌克兰被国际社会尤其是西方唾弃、制裁之后，铁了心要对抗到底，在叙利亚的所作所为有很大负气而为的意思——因为从现实的利益考虑，其实支持阿萨德对俄国泥潭之中的经济是极其沉重的负担，叙利亚也不是中东的主要产油国，能够给予俄国人的回馈其实也非常有限。\n\n你西方不是制裁我吗，我让你们在叙利亚也不痛快——这种地缘政治民族主义根植于北极熊治国传统，这就是普特勒的思路。\n\n伊朗也是这种思路——敌人的敌人就是朋友。你西方人反对的，我就要支持。阿萨德政权兵员其实早就枯竭，武器上全靠俄国，人员上全靠伊朗和黎巴嫩真主党的雇佣军。\n\n不管怎样，好歹俄国和伊朗都还有现实的地缘利益在叙利亚，加上独夫之间的惺惺相惜，支持还算想得通，有些跟叙利亚毫无瓜葛的国家敢于冒天下之大不韪，铁了心支持叙利亚，就是匪夷所思了。\n\n2011年11月联合国大会133个国家投票赞成制裁叙利亚，中国、俄罗斯、朝鲜和古巴等11个国家投票反对……中俄两国还分别于2011年10月2012年2月、7月的安理会上三次否决了向叙政府施压的决议草案——所以有些国家被美国人挑出来作为贸易战的打击目标，是一系列原因的结果，并不单单是贸易逆差。\n\n正是因为得到了这么多一丘之貉的支持，本来已经日薄西山的阿萨德政权又起死回生，叙利亚内战在旷日持久的拉锯之中，中东原教旨恐怖势力isis，以及不同教派的武装趁虚而入，互相厮杀，给叙利亚人民带来了深重的灾难。这也是叙利亚难民潮的由来。\n\n烂泥扶不上墙阿萨德政权缓过劲来之后，故态重萌，又干起了老阿萨德毒气屠戮的老勾当，2013年8月，阿萨德政权用含有沙林毒气的火箭弹对大马士革抵抗者进行袭击，造成至少213人死亡，大部分是妇女和儿童；\n\n2017年4月，又在伊德利卜省进行毒气攻击，100多名平民再次遭殃……最近的就是2018年4月8日在叙利亚反抗军顽强坚守杜马镇，阿萨德又一次使用沙林毒气，目前死亡人数已经超时150人，包括大量儿童……\n\n众所周知，化学毒气是国际战争公约严禁使用的，不要说对平民，就是对军人也不能使用。阿萨德政权数十年如一日，屡屡使用毒气攻击对手和平民，一次又一次的挑战人类文明底线，丧心病狂，无以复加。这也是川建国为首的西方再也无法容忍的原因。\n\n随着川建国同志的一声令下，在美帝声称将对阿萨德政权实施直接军事打击的当天，俄罗斯股市史无前例的暴跌11%。巴沙尔闻讯已经逃亡俄军事基地寻求保护。谁是纸老虎，一看便知。\n\n就像我说过的贸易战没有悬念一样，美帝宣布参战后，这场战争恐怕就已经临近结束。恶贯满盈的阿萨德政权的倒台，已经指日可待。俄国人帮不了他，俄国人的小弟连投反对票的勇气都没有，只有弃权。流氓不打，是不会相信眼泪的。不管是贸易战，还是真刀真枪的干。\n\n我要诚恳的对叙利亚人民说，对不起，那些支持阿萨德政权的票，只能代表普特勒和他的小弟；我还要衷心的对川建国同志说，谢谢你。看着流氓一个一个的服软，我发自内心的高兴。世界赖有美利坚，不使独夫度流年",
			"added": 1523717816,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "中国人喜欢吹牛",
			"body": "声势浩大的博鳌亚洲论坛即将“隆重”开幕。伟大领袖习主席亲自出马，但也仅仅只有6个弹丸小国（奥地利，荷兰，蒙古，菲律宾，新加坡，巴基斯坦）现任首领前来捧场，欧洲2小国，亚洲4小国，非洲老朋友都没来。\n亚洲有48国，欧洲有46国，非洲有57国，全球有195国。看看你的影响力吧。别吹行吗？",
			"added": 1523718627,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "不仅抱俄国，还恢复了朝鲜贸易，骨骼清奇已经不足以形容了。习帝才是冷战思维的维护者",
			"body": "回到最基本的数学问题。据美国商务部公布的数据，2017年全年，中美贸易总额为6359亿美元，其中美国对中国出口1303亿，进口5056亿，现在美帝刚出了两把牌，加起来1600亿，中国出了一把，500亿。美帝还有至少3400亿的筹码，中国只剩下800亿。\n\n这就像什么呢？斗地主你出一对K，我跟。你再出一对A，我还跟。你出四条2，我……我劝你不要搬石头砸自己的脚。你说我还有一对王炸啊，我说你特么的悬崖勒马！我奉陪到底！\n\n在中国人面前，全世界有多少的石头，多少的悬崖都不够用。要知道中国2017年全年贸易顺差4225亿美元，单单一个美国，就贡献了65%。人家的悬崖还有春风十里，你家的悬崖只剩寒风十米。",
			"added": 1523721838,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"12_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 1,
				"body": "我南方电信，下载官网的软件一定要翻墙才能用这软件更新数据，如果这样的话，这软件没什么用了，",
				"added": 1523202021
			}
		],
		"4_1G58PQ7Ena3mARGX2p5mYH7yHcBWRLX2Pa": [
			{
				"comment_id": 2,
				"body": "没节点",
				"added": 1523202095
			},
			{
				"comment_id": 3,
				"body": "没节点",
				"added": 1523202731
			}
		],
		"1_1GFHjNNqH4rNoLCHzwkTY3h1hM5VxVuJ2a": [
			{
				"comment_id": 4,
				"body": "nb nb",
				"added": 1523724391
			}
		]
	},
	"comment_vote": {}
}