{
	"next_topic_id": 3,
	"topic": [],
	"topic_vote": {
		"1553085871_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1567130023_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1516525820_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "cool!",
				"added": 1520236108
			}
		],
		"1525712312_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "> [ssdifnskdjfnsdjk](#comment_10_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): People are doomed to destroy environment? [...]\n\n(From [this link](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ/1534576859)) Human race on the earth has to stop giving birth right now. \nIt's already too late, though.",
				"added": 1534582331
			},
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_11_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Curious from where this craze and consumption lifestyle comes\n\nPeople easily blame people about the collapsing world. \nBut the fact is that a small group of leaders at the top above people always has been responsible for every catastrophic disaster from the beginning of the history up to the present day. \nAs you mentioned people are born to be stupid like babies, that's why the leaders are the key factor of every astonishing event in history. Because they simply lead the stupid crowd.\nWho was the leader when America was peaceful and wealthy? \nWho was the leader when America was in non-responsible wars and Americans were poor?\nWho was the leader when Mongolians conquered the world? \nWho was the leader when Mongolians lost the mainland China?\nWho is those leaders' leader? Who is ruling the entire world? \n\nJohn 12:31 The time for judging this world has come, when Satan, the ruler of this world, will be cast out.\n\nJesus clearly mentioned who was/is the ruler of this world. Satan. \n\nKorean people had had legendary righteous and genius kings in history, such as King Sejong or King Jeongjo.\nWhat is the problem with them? They get old, sick and die at last. And their shitty sons and grandsons rule the country and destroy everything. Entire world has been doing this stupid repeating games for thousands of years!\n\nAll we need is nothing but a leader who is righteous and smart, and does not get old nor die, but live forever. \nHe will rule the world forever. \n\nThis is the only solution for the current doomed world. \nThe present ruler will never stop destroying the environment and leading people to the doom, just like a serial killer never stops killing the victims.",
				"added": 1534603034
			}
		],
		"1566762578_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "TL;DR but I personally concluded microwave is safe a few years ago.. \nThanks for a good issue to discuss",
				"added": 1566917959
			}
		]
	},
	"comment_vote": {
		"14_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}