{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1532715560,
			"title": "hub-based ideas: neozities (like geocities/neocities) and zlogger (zeronetblogger)",
			"body": "Why not more hub-based portal-zites?\n\nLike a zite that allows every user to easily add his/her 10mb personal space on Zn?\n\nNot like twitter aka zerome, but more a personal home that links to other zn places like zerome, zeromedium or wherever.\n\nOr a hub-based portal-zite for bloggers, so people simply host their blog on a hub instead of cloning all the time, then the main zite could automatically aggregate and show + link all blogs, categorize them, add moderation etc.\n\nWould surely save some bookmarks space on the left and add a common update and moderation mechanism in the future, so any user gets updated features etc. without bothering updating the underlying code themselves.\n\nAs a bonus any user could share files with other portal-zites if \"CDN\" is used as hub-merger-type.",
			"added": 1532715559
		},
		{
			"topic_id": 1536081751,
			"title": "some new pdf books channel on IFS - feature request",
			"body": "http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:1Mz1_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh\n\nAnyone can do a demo zite with an online js bookreader that could open and display such a pdf within zeronet?\n\nSimply allow merger type CDN to display a linked resource from IFS.",
			"added": 1536081749
		},
		{
			"topic_id": 1536519739,
			"title": "Superpeers that help seeding and spread the power of 0net",
			"body": "A superpeer should be online 24/7 and have enough storage capacity to help seed big files automatically by enabling \"autodownload\" content on hubs/clusters.\n\nWhether superpeers are clearnet accessible or only accessible from within zeronet doesnt matter.\n\nE.g. the operator of this proxy could help distribute all files by clicking on the right switch on this IFS hub:\nhttps://0net.io/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:clusters+id:1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr\n\nGenerally any zeronet client can this way become a superpeer/supernode if operated without downtimes and having the available bandwith/hdd space available.\n\nAlso anyone could help spreading the word by linking to public supernodes content, as it is a good way to showcase the power of ZN to clearnet users like on reddit, e.g. by linking video content and explaining why this is better than half-decentralized services like dtube or steemit:\nhttps://0net.io/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh_item_18+type:video",
			"added": 1536519736
		},
		{
			"topic_id": 1546255047,
			"title": "Zerovoat: Some missing topics on proxy and vice versa?",
			"body": "A)\n\nI can see this topic here local:\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ4\n\nbut it is missing here on proxy:\nhttps://0net.io/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ4\n\nWho can see the above topic local?\n\nB)\n\nVice versa this topic is visible on the proxy:\nhttps://0net.io/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=15gHmNjxH8v82YMkFSxKPr4etHVZxLSHAmtopic1\n\nBut fails to show local:\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=15gHmNjxH8v82YMkFSxKPr4etHVZxLSHAmtopic1\n\nAnyone can report to see topic A) or B) local?\nAny idea why this happens?\n\nThanks for helping testing.",
			"added": 1546255043
		},
		{
			"topic_id": 1550956445,
			"title": "More Good Than Ever...",
			"body": "...and they'd probably the first to post here anyway:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:2_1MEqso53FzGtN3NRYPuDBBbNbP2tUFiR82_item_11+type:video",
			"added": 1550956440
		},
		{
			"topic_id": 1565457997,
			"title": "Why doesnt MC Engine has an overview of known hubs, that when clicked are added as merger sites?",
			"body": "Right now it is very confusing and cumbersome for new people, so having at least some standard links to known boards would be the very last people expecting. To whoever is responsible for this.",
			"added": 1565457991
		},
		{
			"topic_id": 1565551105,
			"title": "Rage against the machine (Video)",
			"body": "Just in case people dont know yet whats possible on this network:\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:2_1MEqso53FzGtN3NRYPuDBBbNbP2tUFiR82_item_11+type:video",
			"added": 1565551098
		},
		{
			"topic_id": 1567701213,
			"title": "ZeroTalk: allow direct reply to comments, adding one layer of depth  to the conversation with \"show more\" after 2 comments",
			"body": "Allow commentary like on the guardian:\nhttps://www.theguardian.com/commentisfree/2019/sep/05/boris-johnson-election-brexit-delay-extension",
			"added": 1567701205
		},
		{
			"topic_id": 1568987984,
			"title": "Zerovoat now with easy media deletion / blocking within ZN and default clearnet media blocking",
			"body": "http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html",
			"added": 1568987975
		}
	],
	"topic_vote": {
		"1551567748_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1551299295_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1
	},
	"next_comment_id": 124,
	"comment": {
		"1532224996_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "> [zeropyro](#comment_13_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): And the same thing on KopyKate,YouTube on 0Net,.This zites have 24/7 seed so they are loaded.But you can not watch a video on this zites.\n\nTry IFS, without need for webseed torrents over clearnet:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/",
				"added": 1532626679
			},
			{
				"comment_id": 3,
				"body": "> [zeropyro](#comment_15_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): This point the program not download later if the seeder goes online. There is no such problem in similar p2p cilents.This is a serious development bug.This thing is causing serious problems throughout the network.\n\nAgree it would be big step forward if ZN-client work like P2P-client and try automatically reconnect and finish all big files with missing parts of piecemap.",
				"added": 1532714047
			},
			{
				"comment_id": 4,
				"body": "libtorrent doesnt give you automatic tor protection even with zeronet=tor always.\nWith all those 3 strike rules and cease and desist letters, this exposes people to high risk without their knowledge, similar to intentional embedded clearnet content.\nImo everything should be routed through ZN, thats why BFS of ZN is a great step forward and only lacks autoreconnect when a new peer goes online at a later point in time and serves missing chunks to anyone who having the corresponding piecemap.",
				"added": 1532808948
			},
			{
				"comment_id": 5,
				"body": "> [lola](#comment_62_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): True the libtorrent plugin can be an issue for anonymity. I will make sure it is clear for everyone. [...]\n\nHow? It is impossible without using VPN.\nOtherwise anyone sharing a video is risk to a cease and desist, the same as when uploading content via a normal torrent client and no VPN.\nIt is imo even more dangerous as people might not be aware they are revealing their iP automatically by clicking on any video thats copyrighted on your service. They think they are safe/protected by using ZN via tor=always, but your plugin is circumventing tor protection and risking anyone to be easilly exposed without a VPN.\n\nSame goes for any IPFS based solution within ZN, where anonymity is not provided.\n\nImo solutions like IFS are better because they stay fully within ZN and therefore giving tor protection when downloading big files via ZNs own solution via piecemaps and merkle trees.",
				"added": 1532983244
			}
		],
		"1531922152_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "Auto-resume as an attempt to finish any partly downloaded BF should be a top priority for ZN.\n\nLike a bittorrent client, if a user keeps ZN running for 24 hours every unfinished, but requested BF should be attempting to complete download any missing merkle chunks as soon as some other peer comes up that has a missing piece.\n\nSo if the user keeps ZN running overnight and wakes up, most stuff should be complete if some other peer connected that carried the missing pieces.\n\nOtherwise people will just click on a BF one time and if failed may never bother re-checking just to kickstart the download process manually over and over again.\n\n@nofish: Is implementing a default autocomplete mode for big files with fetched piecemaps possible?",
				"added": 1532712608
			}
		],
		"1533160269_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 6,
				"body": "What is Beaker browser based on? Chromium (=fail)?",
				"added": 1533229400
			},
			{
				"comment_id": 7,
				"body": "> [nicwow](#comment_22_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): Chromium = FOSS so, no not an immediate fail. I would only say it is a fail if they left all the Google bits and didn't remove them. It seems like they must have removed then or it wouldn't be as popular among hobbyists. I would have preferred they would have used FireFox ESR but, I will say Chromium arguably has a better UI. But I wish my FireFox extensions were supported as I hate downloading stuff from the Chrome store.This is definitely a plus for ZeroNet as any web browser works with it. A little frustrating that to visit a site you must do http://127.0.0.1:43110/{site URL/hash}, though.\n\nUntil now, it is impossible to remove all google bits, blobs and blackbox binaries.\nAsk TOR devs why they never would recommend any security related project to be based on chromium.\nThere is still ongoing \"ungoogle\" project, but even they have almost given up in the past:\nhttps://github.com/Eloston/ungoogled-chromium",
				"added": 1533299576
			},
			{
				"comment_id": 8,
				"body": "> [marketforce](#comment_36_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): It's based on Electron so yes, Chromium.Fail? Sure.  [...]\n\nYes, Firefox is not perfect either (nothing is), but it is at least not inherently flawed from the beginning for what is known.\nPeople thinking opensource=good is not true, since if the project is too big, like android or chrome, simply opensourcing it doesn't change anything if the original is built on purpose to compromise its users in all kinds of possible ways.\nImagine MS opensourcing Windows wouldn't likely make it any better alternative compared to Linux in regards of user security.\nSo choosing the lesser known evil, like in case of the tor-browser the firefox engine, should be the base requirement for any trustworthy program that has the goal of benefitting the user through more freedom/privacy/security, which in case of using chromium as base is a lost cause (=fail) from the start.",
				"added": 1533402491
			}
		],
		"1534470841_1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer": [
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_437_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I do not know better, though there needs to be more developers for the core Zeronet features and fixing already existing bugs. I am surprised why there is only one or very few developers for Zeronet core.\n\nThis indeed risks being outpaced at one point or another by a superseeding project (like geocities by digg, by myspace, by facebook and now reddit.)",
				"added": 1534844139
			},
			{
				"comment_id": 11,
				"body": "> [nanashi4444](#comment_9_1CJ5AjJzyRcmGBtRrd7qrtik88see6Mjj3): Also Zeronet is already broken at too many points by design (for now).\nCan you name those points where you think it is broken?",
				"added": 1536352702
			}
		],
		"1535288109_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 10,
				"body": "Thats why people should use \"Save as zip\" from the dropdown menu of each site to simulate something like archive.is or archive.org. So if some site owner does weird things, one could continue under a new adress.\n\nWould be great if someone actually did try setup a backup of some site and post here just to see if it works.\n\nEspecially with merger zites, one could try only cloning the frontend to a new site adress and then see what happens if two frontends for the same backend hub sites exist and both can manipulate content on the same hubs?",
				"added": 1535321512
			}
		],
		"1536480860_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 12,
				"body": "Better use IFS for sharing any file types:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/\n\nIt is using 100% zeronet tech like BigFileSupport, so not bypassing TOR as with any webtorrent zite.",
				"added": 1536514902
			},
			{
				"comment_id": 13,
				"body": "> [kaffie](#comment_654_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It's not obsolete. It just never caught on in the first place. For zeronet files, it was used for a little bit, but the big file support is much better, so we use that instead.\n\nIt would be cool to use the same hub-types then and make them all of merger type : CDN.\nThat way, any content can be shared potentially by any other frontend.",
				"added": 1536582487
			},
			{
				"comment_id": 14,
				"body": "> [robione](#comment_27_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): you didn't actually answer the question. What/where?\n\nIntergalactic File Server - IFS:\nhttps://0net.io/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/\n\nIt is a potential \"archive.org\" like zite for ZN.\n\nIFS uses big files and displays downloaded chunks via a green download bar, similar to torrent clients.\nCan play videos, music and also some other content like games directly from the browser:\nhttps://0net.io/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1_1C1gnFcVv9J9kUjF4odDMRYcEWVPJbbqFp_item_166+type:game",
				"added": 1536582722
			},
			{
				"comment_id": 15,
				"body": "> [robione](#comment_28_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): ZN is mostly small files.Replication is inefficient. Stores all accessed data at every node.Dispersing bits of files across many nodes in a way they can be reconstructed (using erasure codes) is much more efficient.\n\nZN now has BiGFileSupport, which uses merkle trees in a very effecient way.\nTherefore also big files can be loaded and ditributed FAST, e.g.:\nhttps://0net.io/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh_item_18+type:video\n\nTry the above link in yourown local instance to see how fast it is.\n\nDispersion or other methods can likely be added at any point in time also in ZN (like MerkelTreeSupport before), should it be needed and not go against TOR protection, which most things are struggling to combine, hence ZN is almost the only fast and secure decentralized system currently available that work ootb.",
				"added": 1536583034
			},
			{
				"comment_id": 16,
				"body": "> [kaffie](#comment_655_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Replication is more important than HDD space. We have all the space we need. Tons of it. Terabytes upon terabytes.\n\nExactly, space is no longer an issue even with homeusers, so anyone can become a supernode by using a rpi3+hard drive attached and replicate serve content 24/7.",
				"added": 1536583174
			},
			{
				"comment_id": 17,
				"body": "> [kaffie](#comment_659_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Something like TPB or KAT would work. As it stands it kinda just looks like one of those shitty spam sites.\n\nFeel free to simply clone and do a new frontend :)",
				"added": 1536681929
			},
			{
				"comment_id": 18,
				"body": "> [robione](#comment_31_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): It would be interesting to have a crawler mode for IFS and anyone else running a supernode that is willing to cache things on upload (like 0net.io).If it were a data dispersal based system, the initial upload would need to complete somewhere temporarily to avoid the source disappearing and leaving behind a dead link.\n\nZN default mode doesnt force any content onto other users systems unless requested.\nBut anyone can voluntarily turn a crawl mode on for any zite or merger zite:\nSimply switch \"help distribute all files\" should grab anything immediately once it becomes available.\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:clusters+id:1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr\n\n\nSo anyones system can become a supernode quite easily for various zites.",
				"added": 1536682238
			},
			{
				"comment_id": 19,
				"body": "> [robione](#comment_36_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): How does one upload to IFS? It's not obvious.\n\nFrom upper right dropdown:\n1. Select \"Create an account\" from dropdown\n2. choose identity from the certs available (zeroid or created ifs)\n3. Choose \"Select Account\", hit refresh after selecting an ID\n4. Go to \"My Channels\" in dropdown\n5. Create a channel by clicking on the \"+\" (You can like on youtube create \"channels\" that you can thematically add files to).\n6. upload files by selecting them from a local source.",
				"added": 1536741997
			}
		],
		"1536806132_15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC": [
			{
				"comment_id": 20,
				"body": "ZeroVoat:\nhttps://0net.io/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/",
				"added": 1536813296
			},
			{
				"comment_id": 21,
				"body": "> [commieslayer1950](#comment_5_15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC): Zerovoat appears to have been dead for quite some time.\n\nYes. It's still a solution that's there and readily available, so whenever a slew of people jump on a certain subvoat, it could be useable as is.\n\nAdvertising on clearnet by posting as 0net.io link creates awareness for ZN and let's anyone try it out easily",
				"added": 1536817083
			}
		],
		"1536519739_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 22,
				"body": "It is also possible from the \"Files\" tab on startpage.",
				"added": 1536817388
			}
		],
		"1536913855_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_91_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This. [...]\n\nAny trust-based system can be easily subverted by chinese spam farms or even more easily a few dedicated people (think of three-letter-agency hired people) that manage a botfarm.\nSee reddit how that works and basically no one nowadays trusts no one else.\nImo a complete waste of time to implement this into ZN, as it 99,9% will fail as soon as it gets bigger/more interesting to subvert.",
				"added": 1537000442
			}
		],
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 24,
				"body": "> [thunder33345](#comment_227_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): problem in that is we also need an EXAMPLE/DEMO of our latest technothing wrong in a fully fleshed out sitebut there should be a barebone chat site with peer applications + periodic flushing of configso future users can learn from the basic and turn them into what they wanted without understanding unnecessary stuff\n\nStill Zeroboard is a wrong example of this though.\nI agree to remove it from default sites.",
				"added": 1537868151
			}
		],
		"1537746280_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 25,
				"body": "How does it work compared to clearnet/centralized zeroid?",
				"added": 1537868395
			}
		],
		"1538009272_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 26,
				"body": "Big Files are zn-native, which gives easy Tor protection which ipfs is missing.\nIf @nofish now also implements autodownload/resume + decoupling of big files via a global hash-based identification mechanism, zn bigfiles would have surpassed ipfs.",
				"added": 1538027875
			}
		],
		"1538505571_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 27,
				"body": "What is the benefit of running ZN over cjdns?",
				"added": 1538688918
			},
			{
				"comment_id": 28,
				"body": "> [kaffie](#comment_715_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): cjdns handles mesh network routing and is very easy to set up. Most other mesh networking software is fairly complicated. cjdns, given that it works as an overlay, can also run over the regular internet as well, not just meshes. Which means that we're able to grow the network before moving off of the internet.\n\nThanks for the explanation. \nCan cjdns be used with Tor?\nWould it be easier for any local zn node to become a reliable tracker because the ipv4 might change every 24 hours by the isp but the ipv6 of cjdns would not?",
				"added": 1538722121
			}
		],
		"1546255047_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 29,
				"body": "> [ssdifnskdjfnsdjk](#comment_581_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Yes, i see it same as you 🙄Even i clicked \"Check files\" on 0net.io site.\n\nSo you see A) or B) local?",
				"added": 1546274637
			},
			{
				"comment_id": 30,
				"body": "> [kai0](#comment_820_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): I can't load your site, I think that's why.\n\nYou cant load ZVoat?",
				"added": 1546277007
			},
			{
				"comment_id": 32,
				"body": "> [kai0](#comment_821_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): no\n\nAny idea why? How does it look like on your end?",
				"added": 1546331873
			}
		],
		"1546138183_12NqXRG5Ur6HzBsgR2kgPxmcWGhR9sxSLi": [
			{
				"comment_id": 31,
				"body": "> [htgozn](#comment_249_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): It's 65% love, 35% magic.\n\nlove == magic, so ZN = 100% LOVE/MAGIC :)",
				"added": 1546294312
			}
		],
		"1546299446_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 33,
				"body": "All big files should be identified by hashsum and replaceable easily if hashsum matched.\n\nWith this, uploading a big file anywhere on zeronet zites or hubs should be sufficient to group all peers regardless of name or useage, like p2p torrent files do.\n\nCan anyone confirm that uploading the same big file on different video zites but different name on ZN creates same piecemap already?",
				"added": 1546382764
			},
			{
				"comment_id": 34,
				"body": "> [styromaniac](#comment_365_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Nofish confirmed that this isn't how ZeroNet currently works.\n\nBut cool if it did, yes?\nOr are there any potential drawbacks/exploits in how ZN works that would prevent this?",
				"added": 1546451338
			},
			{
				"comment_id": 35,
				"body": "> [styromaniac](#comment_378_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Overhead\n\nNot seeing much of a difference to current optional big files if implemented correctly?",
				"added": 1546500354
			}
		],
		"1550686723_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 36,
				"body": "ifs.bit\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVa",
				"added": 1550693663
			},
			{
				"comment_id": 38,
				"body": "> [loligod](#comment_18_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): That name isn't available to be take because someone else already owns it. https://namecha.in/name/d/ifs\n\nah, too bad.\nBut do I see correct that someone has registered igfs.bit and it should work within Zeronet?\nhttps://namecha.in/name/d/igfs",
				"added": 1550699990
			},
			{
				"comment_id": 39,
				"body": "> [d14na](#comment_85_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): it will be 100% free (as in beer)\nIt will not be opensource ?",
				"added": 1550882743
			}
		],
		"1550997628_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 40,
				"body": "you miss ehanime.bit and mixtape.bit in that list of good zites :)\n\nBut imo we still lack a good and neutral Yahoo-like directory service (search engines require that you know what youre searching for).\n\nImo ZeroSites is too confusing and like \"Google second page\" a major drawback for new zites with low score or even zites that hide below the \"more\" tab.\n\nMaybe like this, but of course much better looking:\nhttp://127.0.0.1:43110/12H65dv5g2a8teXUzUriB2838EUYb53D8B/index.html\n\nOr this is nice too, but also too much space for easy info that should just take a line per zite:\nhttp://127.0.0.1:43110/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/?/category/file-sharing-streaming",
				"added": 1551001362
			},
			{
				"comment_id": 41,
				"body": "> [ssdifnskdjfnsdjk](#comment_690_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): more interlinking, instant content filtering, bookmarking, custom list of favorite content/users,...\n\nThis could come via a more flexible and universal file base, like handling big files support BFS via a seperate mechanism outside of embedded user interaction content.\nSo its much more easy to build flexible zites around that focus on interaction, sorting, displaying than to always implement upload, filtering, valuating, etc. again for all zites.",
				"added": 1551035885
			}
		],
		"1550918453_14XR9KNwgJhCv1RiuqKxjBDkCRETjT9R3v": [
			{
				"comment_id": 42,
				"body": "> [styromaniac](#comment_559_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You need to block or prevent the browser connecting to the clearnet and block any known bad JS. [...]\n\nThis should be a /Config switch of ZN: Display clearnet embedded content or not.\n\nTo prevent sites to load clearnet like this:\n/1MwBkncVzXaMWqeskatiprRsSLvFQJhwK8/",
				"added": 1551131345
			}
		],
		"1551299295_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 43,
				"body": "> [klu9](#comment_79_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Embedding a streamable video already on another site (e.g. Youtube) is a fairly typical blog activity on clearnet and I wanted to see if I can do it on 0net too.\n\nThat would require a revision of optional big files becoming global big files. You could add a ticket on github project as Feature request.",
				"added": 1551463694
			},
			{
				"comment_id": 44,
				"body": "> [klu9](#comment_81_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @gluek: I don't understand. Could you explain?\n\nI loaded your website, but the video doesnt load. It is only shown when already in my ZN data folder as cache.\nAnd for that to load I must visit the KopyKate zite before, your zite is not allowed to download the video by itself.\n\nThat is what I meant with to make this work, ZN needs to handle big files outside of their zite context.\nThis would also make it much easier to \"combine\" different local ZN master folders, like copying one \"data-files\" folder into another \"data-files\" folder, IF big files would be stored inside their own \"data-files\" folder instead of \"data\". There would be numerous advantages, this is just two.",
				"added": 1551540301
			},
			{
				"comment_id": 46,
				"body": "> [klu9](#comment_82_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @toyata: I understand now... I think :)So when attempting to embed an external video in a blog post, I should provide a link to the source and advice like:\"If you can't see the video here, click the link to see it on [external source].\"\n\nYes, that should work. The reason is that accessing an embedded file could trigger starting to download an endless number of nested zites and used as an attack method. Therefore ZN limits content to be from the same zite or merger type. One thing you could try as a \"trick\" is to declare your zite as the same merger type as KopyKate, if KopyKate is using the merger technology.",
				"added": 1551561321
			},
			{
				"comment_id": 47,
				"body": "Here is an example:\nLets say you want to embed this video from IFS:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8_item_6+type:video\n\nTo embed the video this would be the direct link:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/merged-CDN/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8/BLADE_RUNNER_2049_-_2036_Nexus_Dawn_Short.mp4\n\nTo allow watching the video on your zite, you need to allow it to access from the same merger type, CDN.\nTo do this, go to your zite folder under data and add in content.json this line:\n \"merger_name\": \"CDN\",\n\nThis should do the trick and ask someone who never got access to the video and IFS before to grant access to the merger zite, where the video is stored.\nAfter granting access, the video should load and play fine.",
				"added": 1551562221
			}
		],
		"1551558721_1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb": [
			{
				"comment_id": 45,
				"body": "Sounds like this could also be a use case for \"universal big files\" instead of current zite-dependent \"optional big files\".\nThat way the zite stores only meta-data and user-data like commnents, ratings, etc. and the actual file corresponding to the hash of the movie will be stored outside of that zite folder, in \"data-files\" folder inside ZeroNet-Master folder.",
				"added": 1551561067
			}
		],
		"1551712265_1C1gnFcVv9J9kUjF4odDMRYcEWVPJbbqFp": [
			{
				"comment_id": 48,
				"body": "So \"cloning\" a site is not possible with data, but \"Save as .zip\" is also not possible to use for a backup?\nI thought the whole idea was, if someone doesnt like to continue or site vanishes, someone else can pick up or restore a lost site via \"Save as zip\" from a backup?\nDoes anybody know?",
				"added": 1551818892
			}
		],
		"1551618955_163wft59zLGW1zNA6WBsppjFEbXxAfAseY": [
			{
				"comment_id": 49,
				"body": "How does GNs work?",
				"added": 1551967907
			},
			{
				"comment_id": 50,
				"body": "Thanks robione. So if you say gnunet could replace Namecoin .bit, how would domain names with GNS look like for ZN?",
				"added": 1551985570
			}
		],
		"1552022585_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 51,
				"body": "use IFS, so everything is done within ZN = protected by Tor (which IPFS is not):\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/",
				"added": 1552163350
			}
		],
		"1548112623_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 52,
				"body": "What is it for?",
				"added": 1552164144
			},
			{
				"comment_id": 53,
				"body": "someone should tell them about hosting on git center (or someone here does it for them)\njust in case they get scratched from github like popcorn",
				"added": 1552165540
			}
		],
		"1552558114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 54,
				"body": "> [robione](#comment_186_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Every proton is a mini black hole. And contains all the information of the universe on the surface of the proton.  [...]\n\ncool idea",
				"added": 1552590530
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 55,
				"body": "> [satoxyn1](#comment_14_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Go and set up inproxy (Internet → ZeroNet proxy).Actually, I'm puzzled on why there are so many IPFS proxies (even by huge companies like Cloudflare), yet there's only one open ZeroNet proxy I know: 0net.io.\n\nMaybe one idea is to link to allow and only one specific zite without the \"0\" at top corner? So people then only see e.g. ZeroTalk linked to e.g. clearnet talk.zeroportal.io?\nAnd on startpage zeroportal introduce those pages linked.",
				"added": 1552904345
			}
		],
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 56,
				"body": "\"StreamZ is currently closed-source, and will be released open-source in a year.\"\n\nWTF is wrong with you?",
				"added": 1555833781
			}
		],
		"1557105138_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 57,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_100_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11):  the mass wants porn and games\n\nI'd disagree. Most individuals know deep down they search something else. On the clearnet its just harder and harder to find something not sexualized or right away insane content, hence they are stuck consuming whats easily presented.",
				"added": 1557169103
			}
		],
		"1557305635_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 58,
				"body": "> [kaffie](#comment_842_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): If a site isn't marked as cloneable, you can still manually copy the source code by accessing the /data/ folder for your ZN. You just have to move it over by hand, rather than having an easy button. [...]\n\nThanks for your reply Kaffie.\n\nWhen copying a zite by hand in data folder, incl. all user data like comments, votes or content, does it work as a 1:1 clone/copy of the original up to that point?\n\nCould you demonstrate a 1:1 copy of this Zerotalk forum under a different ZN adress, so in case this forum would vanish overnight, it could be continued under the new adress with all content up to this point intact and fully functional for all users with zeroid?",
				"added": 1557565215
			},
			{
				"comment_id": 59,
				"body": "I tried this by hand and couldnt get it to work... when trying to sign the Zerotalk zite after coping it 1:1 to a new zite, it skips ALL user content.\n\nSo the most i can get back up is an empty zite with all content and user contributions lost. Hopefully someone can prove this wrong and demonstrate a working clone...\n\nOtherwise i would argue zeronet is no better than any centralized website (other than being distributed), but that offers no protection if the main site goes down or the creator chooses to remove it (exactly like with any other clearnet site going down).",
				"added": 1557567215
			},
			{
				"comment_id": 60,
				"body": "Hey kaffie, glad there is someone interested to figure this out :)\nNow i wonder why all user/data folders have to be signed again when cloned... as long as nothing changed from last signing, it shouldnt matter.\nTo prevent any manipulation, one could add a genetated hash to all files included in the user data folder at time of signing, then if someone clones or copies the site, do a quickcheck if all is still valid and then skip signing, but display user content normally.\n\nAs for hubs, it should have the same problem then?\nLike if i begin to not trust a hub anymore, i cannot simply archive a full copy and bring it back on in case it goes down, if signing or rather validating user data folders is not possible with the clone.\n\nMaybe @nofish can think of a solution and update python3 ZN to allow this validation to make ZN very robust against forced takedowns of individual users sites or hubs.",
				"added": 1557667334
			},
			{
				"comment_id": 61,
				"body": "> [gitcenter](#comment_473_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): User content files include address field which must equal site address.\n\nThanks for the info. Kind of contrary to freedom and resilence of ZN though. I mean this is not blockchain, should be different. The whole centralized ZeroID and protection concepts around it kinda suck... its like first invent free flow water, then making it not wet: the only way is to freeze it completely.",
				"added": 1557779690
			}
		],
		"1559424911_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 62,
				"body": "Would be great if ZN put out all big optional files into a unified data-files folder first with hash value as subfolders.\n\nThat then allows all kinds of progressing further, like your idea to spread any chunks to any connected nodes that allow this.\n\nThe big disadvantage is that it helps spread unwanted shitfiles too...",
				"added": 1559512081
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 63,
				"body": "> [pineapples](#comment_76_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): just clone any of those sites and control it yourself\n\nThats not fully working, as the content is still sort of centralized, and doesnt get copied as well.\nTherefore the most important next step is to detach zites from content, e.g. to move all files into a data-files toplevel folder, so any content is then also reusable elsewhere, like big files.",
				"added": 1562167955
			},
			{
				"comment_id": 64,
				"body": "> [geekless](#comment_65_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Which actually means we should move away from the \"site\" paradigm. There should be \"applications\" to access and operate data in personal and collective \"hubs\", and all those things should be located on separate addresses. [...]\n\nExactly this. ZN needs to restructure and open up the possibility to truly clone a zite/application and fully allow continously access to a set of data, much like any music player or book reader can access independently the same songs or ebooks to play or read and add meta-data to it that is then only relevant in the apps own context.\n\nIn a decentralized context, this deduplication is essential with regards to security and effeciency at the same time.",
				"added": 1562168293
			},
			{
				"comment_id": 65,
				"body": "> [nekocross](#comment_3_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz): if something wrong with anyone who in charge of forum, chan, whole zeronet or anything else, other people can fork or rebuild with backup files.\n\nJust curious: Can you demonstrate how you rebuild any of the important zites incl. content from a backup? Thats the whole purpose of a backup vs. starting with an empty zite or empty ZN from scratch, which anyone can do already from the code on github.",
				"added": 1562169623
			},
			{
				"comment_id": 66,
				"body": "> [nofish](#comment_1276_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Backup plugin that is enabled for owned sites, so the damage could be reduced if the private keys are leaked\n\nWhy not enabled for any site?\nThe issue is not when keys leaked, but if a site is forced off ZN or removed completely.",
				"added": 1562358360
			},
			{
				"comment_id": 67,
				"body": "> [zeroconfig](#comment_12_1LU47z6YewqdERYNFysqjDZ8NVG5WWpkVU): Download the .zip file (from the menu besides the site in ZeroHello), extract .zip file into your data/ directory and access it.\n\nDoesnt restore any content from sites like e.g. Zerotalk.\nSo all content is lost in case any site goes mia.",
				"added": 1562358700
			}
		],
		"1563223926_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 68,
				"body": "> [heavenshome](#comment_1_19yPFK4LQJ2fQAHDQusuGyVkwjXs3FFAH2): I would say the goal of the creators of zn is to grow as much as possible. If that means making a more open space then that is what will be.\n\nI disagree. The goal is indeed to protect the individual in as much as it is free to post whatever it wants.",
				"added": 1563299596
			}
		],
		"1563152650_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 69,
				"body": "> [filips](#comment_90_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I'm creating program that would automate downloading, signing and publishing website archive. But requesting websites is currently not automated. [...]\n\nhttp://127.0.0.1:43110/1KMyW1NdcHzBNPSfc5z5gMdDdg3nLUiWic",
				"added": 1563303939
			}
		],
		"1563540336_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 70,
				"body": "> [petrina](#comment_7_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): It is possible to decouple rendering from presentation, so that a rendering browser can run on one machine and the results are presented to the user in another machine, with a second browser. There are prototypes floating around already, I expect to see it become more common place in a few years.\n\nAny examples?",
				"added": 1563621845
			},
			{
				"comment_id": 71,
				"body": "> [petrina](#comment_8_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): There is an AGPLv3 project that has its latest version sold for a small fee, with older versions openly available, yet I have seen someone write that because the latest version was behind a \"paywall\", the whole project \"went against everything free software stood for\". [...]\n\nso you keep claiming weird stuff, cant point to anything specific, no links, no names one could google, nada. All info you post here therefore is useless.",
				"added": 1563699669
			},
			{
				"comment_id": 72,
				"body": "> [petrina](#comment_7_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): It is possible to decouple rendering from presentation, so that a rendering browser can run on one machine and the results are presented to the user in another machine, with a second browser. There are prototypes floating around already, I expect to see it become more common place in a few years.\n\nlike here, again, where is the project name, link, anything concrete missing.",
				"added": 1563699737
			},
			{
				"comment_id": 74,
				"body": "Thats what i meant: Rather proving the point, instead of posting something useful. Qed.",
				"added": 1563746319
			},
			{
				"comment_id": 75,
				"body": "> [filips](#comment_101_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Until 3rd party bullshit disabled adblock...\n\nuntil google decides to prevent/restrict adblock addons completely... dont use chrome or anything based on it, its shit.",
				"added": 1563878932
			},
			{
				"comment_id": 76,
				"body": "> [petrina](#comment_13_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz): Very useful for me if it makes you shut up and go away. Could not care less if it is useful to you.\n\nif it was just about me... sadly you're fucked in general...",
				"added": 1563879125
			}
		],
		"1563638106_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 73,
				"body": "> [brianhanson2nd](#comment_17_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): You can't make me shutup. :PFacebook or Twitter having a backdoor into zeronet? I think not, that would be most harmful to either of those sites as they wouldn't be able to control what we see or say.By the way my tinfoil hat comment was about you calling systemd and gnome trojan horses. I mean you may not like them, but just because you don't like something doesn't make it a trojan horse, also you can fairly easily not use Gnome, and I don't think systemd is a hard requirement for Linux, though I could be wrong on that.\n\nGnome = Chrome and Android, each one the worst kind of \"opensource\" done by US corporates disguised under community effort. Now with shit like ednlessos you get a complete locked down system with flatcrap on top. Even cloning or forking doesnt remove the fact that Gnome, Chrom, Android cannot be trusted to have many deliberate put in backdoors and their corporates (Redhat and Google) 100% sure signed NDA deals that allows easy access. Keep using that crap, but dont recommend them to anyone but yourself for running anything secure on them.\n\nOn those system, the wolf is not only \"in\", but dominating every inch.",
				"added": 1563700096
			}
		],
		"1563812717_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 77,
				"body": "> [redlibertyreal](#comment_33_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): If anything I am skeptical about the future, my hope is reluctant, it's a hope for hope. As Slavoj Zizek (a communist) says, \"today the light at the end of the tunnel is actually an incoming train\". There is no \"big other\" with which one can use to justify this or that act or atrocity, but we have to fight in order to try and build a freer, more democratic, more just world even if the odds are stacked against us. Hope of a singing future then springs if anything, from our own efforts, futile though they may seem to be. I am skeptical of this so-called \"historical inevitability\", if anything it is one potential future, though I think and hope it's where we will be (think a more realistic Star Trek like world hundreds of years from now). As for a universal symbolism we have to look at the socioeconomic forces behind prevailing civilization (historical materialism) but also within the human spirit itself. People like to be free, people like to have control over their own lives and communities. I think these are good things but you are right there are dangers and if anything the 20th century is a startling reminder of that, it's something we can never forget. My problem is this absurd notion that \"anything against individualism (or that I don't like) is COMMUNISM\". You can't do that, just paint anything you don't like as socialism/ communism. Especially since when some of the most radical individualists in human history have themselves been communists, and especially in regards to ZeroNet when we communists on here do not say or think the things you say in this post that we say or think. This is my view, respectfully.\n\nGood post! Just curious, why are you here on ZN?",
				"added": 1563879474
			}
		],
		"1564689117_1A4B6vo5EbmJtnNEkRxoWuG2t9PGHqLFc9": [
			{
				"comment_id": 78,
				"body": "There is also opendesktop.org who aim for similar 100% libre personal services, replacing the need for Google ones.",
				"added": 1564843499
			}
		],
		"1564409306_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 79,
				"body": "ZN must prepare first step to allow share/unify big files in its own network. Or offer built in use of a third party solution, which would be not optimal though. Otherwise people wont use it enough if not default?",
				"added": 1564844113
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 80,
				"body": "Can someone not simply post the 08chan sticky?",
				"added": 1565450416
			},
			{
				"comment_id": 81,
				"body": "I think current 08chan is already not bad, providing mechansims to easily remove users and whole boards and blacklist them. It would be very recommended though if all media-files were optional, and if in near future 08chan would adopt merger site technology based on millchan engine to allow hosting of every single board seperate under one unified masterview page.",
				"added": 1565455129
			},
			{
				"comment_id": 82,
				"body": "Okay, so it is already using optional files correctly as far as i can see, not sure what kaffie is referring to?\nFor me it shows 1277.33 MB optional files, which one could help distribute, is that supposed to be all?",
				"added": 1565455519
			},
			{
				"comment_id": 83,
				"body": "> [ssdifnskdjfnsdjk](#comment_887_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): no. complete site, before self-signed certificate was removed from cert_signers, has more than 30GB of optional files. It seems like new users currently does not have access to the majority of the content that is signed/owned by the self-signed identities. @08admin: disallowed all self-signed identities by removing line:   \"08chan\": [\"1NwwLdiFBcVAA4jXQ712ZtQfDHEMvk8BiD\"]from cert_signers in data/users/content.jsoni hope admin: can enable it again until he finds some anti-spam solution. Or if admin manually whitelist existing self-signed identities.\n\nAh okay, thank you for the info!\nSo various people from clearnet 8chan joined new 08chan with selfsigned certs at some point and re-added boards+content, which now is inaccessible due to currently no longer allowed/blocked?\n\nAlso if 08chan would be converted to a merger site and any board would be of type merger, then the problem would be somewhat mitigated, or better under control even with selfcerts allowed again?",
				"added": 1565456668
			},
			{
				"comment_id": 84,
				"body": "> [myriri](#comment_26_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): that you have millchan and millchan engine is quite confusing.\n\nagreed. also millchan engine should have a way for people to add site adresses of new hubs, so it also acts as overview site to at least some well known boards.",
				"added": 1565458081
			},
			{
				"comment_id": 95,
				"body": "Is there any plan or willingness to try a merger based version of 08chan?\nI think many people would stand by to help in that case.",
				"added": 1565609447
			}
		],
		"1565457554_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": [
			{
				"comment_id": 85,
				"body": "> [trevorlaneray](#comment_38_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Very well... Just for kicks 'n giggles.\n\nThank you Trevor! :)",
				"added": 1565458223
			}
		],
		"1565457997_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 86,
				"body": "> [steelmemes](#comment_29_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): Millchan Merger:  http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/Example board:  http://127.0.0.1:43110/13kifcv8J8noDEXdztXY4qkPPPKLK2PiAe//a/ - http://127.0.0.1:43110/1D23TdnwuQUwNcz5at3m6kyc6Wp1BC4dei//b/ - http://127.0.0.1:43110/17wWFMe7AyJx4qvFLfoepvQnGHTfcPG8N9/Zeronet board:  http://127.0.0.1:43110/1N5WZ2QNXBKfhyhpktRZr2DE91QBJf7QDB/ [...]\n\nSomeone should clone Millchan Merger master site and add all known boards default, so they are clickable from the main site and then populated.",
				"added": 1565514040
			}
		],
		"1565583628_1C9SF8vbHqBVYVnqB7zzqZuNjuvXiUVUBv": [
			{
				"comment_id": 87,
				"body": "+2 on this",
				"added": 1565588837
			},
			{
				"comment_id": 88,
				"body": "It is super annyoing to scroll down first and the read upwards while scrokling downwards again when reading a single comment on mobile.",
				"added": 1565588917
			},
			{
				"comment_id": 89,
				"body": "True. Still context gets akward if you dont use some sort of nested reply grouping :)",
				"added": 1565590604
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 90,
				"body": "> [bvcfbfbcbcvd](#comment_4_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): Good answers. The key stuff sounds very nice yet somehow \"too obvious\" to not have been thought of before just the last few years, so I assume there must be some heavy downside to this which I haven't yet thought of... [...]\n\nThats a general issue seperate from ZN. Absolutely agree there is need for alternatives for browsing engines, which are getting scarcer by the year. Also big clearnet sites banding together and forcing constant updated browsers makes it hard to just switch back to some older fork, like waterfox if not maintained well. But ZN can not solve this, it affects almost all of us on any clearnet sites and future decentralized platforms today, yet awareness is still low. Most disappointing is Mozilla, who started the craze with Prism, then quietly abandoned all efforts and seem not interested to make their engine widely and easily available for projects to use outside firefox.\n\nIf anyone knows good projects on this subject, please start a new topic!",
				"added": 1565591124
			},
			{
				"comment_id": 91,
				"body": "> [crazylime](#comment_57_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): The Tor browser is built on Firefox and has all the crap turned off for you.\n\nWould be awesome if there was a version without the bundle, so to use the hardened browser if one has a customized setup with Tor like ZN and only needs the browser on other machines.",
				"added": 1565591310
			},
			{
				"comment_id": 92,
				"body": "> [crazylime](#comment_60_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): We're just talking ZN surfing here. IDK about you, but I have 3-4 browsers typically with multiple windows each open on one computer with a total of over 100 tabs for about a month before I reboot.  lol [...]\n\nIsnt there a drawback running Multiple Tor in the same network? Because if you run ZN without Tor and use Tor browser only you browsing is safe, not you serving from ZN.",
				"added": 1565591570
			},
			{
				"comment_id": 93,
				"body": "Imo most important weaknesses to fix is:\n- no way to simply bring back a saved zite or merger zite with full content\n- zeroid centralized in clearnet",
				"added": 1565591813
			},
			{
				"comment_id": 94,
				"body": "> [kaffie](#comment_1009_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It requires an archive. Merger zites can't really be taken down, as clients and hubs can easily be duplicated. [...]\n\nIts not about the archive. Even with a full copy of an archive, ZN does not allow bringing back the full content like comments, files, votes, etc. since signing fails.\nThe only one who could bring back a full site or merger is the owner itself, which defeats the purpose.",
				"added": 1565593709
			}
		],
		"1557922831_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 96,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_132_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): https://invidio.usto look youtube [...]\n\nthere is IFS fully decentralized:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:main+type:video",
				"added": 1565816247
			}
		],
		"1565996156_1GPb18zNkjvojHAGXzMpYKsro2JwU1dayj": [
			{
				"comment_id": 97,
				"body": "> [styromaniac@kxoid.bit](#comment_119_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Only thing is that I don't think you'd have 84/113 from trackers_best [...]\n\nGreat stuff! Is there any method to setup a service that autoupdates a ZN site or part of it by periodically copying over resources from elsewhere?\nLike a cronjob running on a raspbi at home having ZN running?",
				"added": 1566156192
			}
		],
		"1566439997_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 98,
				"body": "Since ZN has introduced Big Files via merkle tree piecemaps, it is one step away from having a better implementation right on default. That step is sharing files by making site-wide only files universally available within ZNby restructuring how optional files are stored and referenced (hash). \n\nThis parallel invent is imo necessary, since Ipfs and ZN share independent directions and philosophy, e.g. Ipfs censorship of official catalogs dont mix well with ZN user freedoms.",
				"added": 1566489333
			},
			{
				"comment_id": 99,
				"body": "> [blurhy](#comment_326_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Not one step away, and never. [...]\n\nYeah sure, whatever... now let me go back to myspace.",
				"added": 1566654503
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 100,
				"body": "Zerovoat is a merger zite frontend of merger type CDN, meaning anyone can clone the interface and revamp it and point to the same content in parallel. So it can have as many interfaces as people can imagine and still all is shared and synced between all frontends, as the backend are simple clusters.",
				"added": 1566783490
			},
			{
				"comment_id": 101,
				"body": "http://127.0.0.1:43110/19gtNiKNZMq6nTdWThGCQQAS2bCYAY1tFh/\n\nThere seems only one cluster though for the original master frontend, so whoever clones the frontend could extend it to allow more clusters.",
				"added": 1566784078
			},
			{
				"comment_id": 103,
				"body": "> [gitcenter](#comment_806_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): A centralized profile storage makes sense. I'll add the support if I'll be the one to implement ZeroNet Reddit.\n\nA universal optional files storage would also make sense to allow for easy administration and sharing of images, videos, etc. between sites and deal with fraction/no seeds plus easy skimming through and removing any unwanted of such content at the same time.",
				"added": 1567701871
			}
		],
		"1567571648_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 102,
				"body": "> [estimene](#comment_21_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ): This has already been done, multiple times. You seem to forget that the larger social networks are operated either in tandem or under the direct influence of the government (except for Twitch - we have Amazon to thank for that), which is the only reason why they are still around. Without the state's intervention, every social network would have gone with the wind, replaced by another. That is the nature of the free market. [...]\n\nVery good point (I think Larry and Sergey already long out of the power loop though).",
				"added": 1567701390
			}
		],
		"1568626187_116GwtLxi8HFbD3HTVWHHbW5fa1R7sSRQT": [
			{
				"comment_id": 104,
				"body": "> [randomshits](#comment_113_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Updated 38 min ago. I have witnessed the site going for more than three years now. I don't really expect it to one day fall over and die any time soon.\n\nare we now able to make a full 100% working copy by now from an archived zip? or like with almost all other user-content zites is it ending up empty?",
				"added": 1568736765
			}
		],
		"1568774393_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 105,
				"body": "But by law of natural selection and survival of the fittest mixing is strength, avoiding leads to mongoloid down syndrome like degeneration, as was common within the mediveal noble houses.",
				"added": 1568808470
			}
		],
		"1568768337_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 106,
				"body": "Who is Tarrant?",
				"added": 1568808686
			}
		],
		"1568893908_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 107,
				"body": "Compared to google chrome, Firefox is the gold standard.",
				"added": 1568991748
			}
		],
		"1569278789_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 108,
				"body": "good luck with Gnome/GTK/RedHat/IBM...",
				"added": 1569303747
			},
			{
				"comment_id": 109,
				"body": "> [styromaniac](#comment_1063_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): GNOME is fine. I never had any issue with it, and I love the simplicity.\n\nIts not about it not running well. It does, like android run fine. But even if Android and Chromium are opensource, people dont trust them, since US corporation Google develops it. Why you think IBM/Redhat developed Gnome is any better? And no, its not a true community developing it, like e.g. people from KDE, Gnome devs follow their own agenda and shit on messing up anything that comes from the community, like e.g. gnome extensions. The agenda for Gnome/IBM is total centralization of Linux development of the main system, hence systemd, flathub, etc. so they end up in the same position like Google with Android. Maybe Gnome will even decide to ditch Linux kernel at some point to replace with joint effort Google Fuchsia. You think American corporations will leave Linux untouched, you're delusional: IBM invested in Linux back then, now bought Redhat/Gnome for good measure of control. \nAndroid/Gnome/Chrome are all opensource but not to be trusted for real privavy for the same reasons.",
				"added": 1569388450
			}
		],
		"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 110,
				"body": "if a system grows large and bloated enough, and too many things start depend on it, it doesnt matter anymore if its opensource or not, it becomes a potential threat for misuse. Examples are anything related to Android or Chrome, where the main code done by Google no derivative can be said to be secure. With Redhat the driving force and IBM takeover, it is now of utmost interest to \"own\" Linux with Gnome/GTK/systemd and try remove any competition from the distro landscape. Only a \"unified Linux system\" is one that can easily be controlled and turned against its users.",
				"added": 1570448445
			},
			{
				"comment_id": 111,
				"body": "> [k0hlr4bi](#comment_3_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): So basically a Debian which focuses on 100% FOSS by default is a GNOME/systemd monster. Does that mean Debian is to be avoided? Ubuntu is cancer, Fedora is corporate, Arch has binary blobs in the kernel... what options do we have anymore?\n\nGood question. Freedom is never the easy route, so one possibly has to pick the least worrysome choices. Firefox while not perfect arguably is a 1000xtimes better than chrome. At some point, the most transparent and comnunity driven choices will likely be the best.",
				"added": 1570635685
			}
		],
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": [
			{
				"comment_id": 112,
				"body": "> [shareduser](#comment_7_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R): Is there any continuously updated CP blocklist with IDs of those suckers who upload this crap?\n\nWe could all work together to make almost all ZN safe to avoid such content. IF there was a universal file structure by hash, so its not all scattered and unmanagable.\nAn interesting question is this: is a list to block such content illegal by itself? A trick would make it safe, like only having a list of universal users, but universal users (aka zeroid) is imo the reason why ZN is unattractive or even dangerous in the long run, while universal file management would be perfect for ZN, and hence legal system IRL target it imo.",
				"added": 1572128357
			},
			{
				"comment_id": 114,
				"body": "> [nekololi](#comment_409_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): a list of hashes is how the industry does it currently. hashes seem to work great. [...]\n\nCant it be argued that before any hash someone had to check it manually at some point and identify as to put on a list?\nNow scary part is that in the very near future, only \"AI\" may be allowed to even \"look\" at NEW content and decide if its worthy for humans to watch...",
				"added": 1572216109
			}
		],
		"1572051069_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 113,
				"body": "> [filips](#comment_270_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): If you want just static copies of websites on ZeroNet, I created ZeroArchive which allows you to download online website and store it in ZeroNet. See this for details.\n\nSomething like this would have to work from within ZN without anything special would be killer. Something that easily could backup any clearnet page, like archive.is, then deny any modification, store its hashvalue in blockchain to prove ehat the unmodified site-content was like at a certain point in time without any chance to manipulate that later.",
				"added": 1572128775
			},
			{
				"comment_id": 115,
				"body": "> [filips](#comment_272_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): ZeroArchive is something like archive.is or archive.org. It just fetches whole website to local folder, indicates it with date and publishes that to ZeroNet. However, it doesn't prevent later modifications to that folder due how ZeroNet workd (but this might change soon). It also can't handle websites that heavily relies on JavaScript due how HTTRack works. [...]\n\nWould this php thing help?\nhttps://github.com/asmblah/uniter",
				"added": 1572391642
			}
		],
		"1571722926_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 116,
				"body": "You really think people click on those clearnet links?!?",
				"added": 1572599101
			}
		],
		"1576144410_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 117,
				"body": "> [1bfqutudhtexlka](#comment_117_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): hope the developer add mute function ,also in the FAQ there is a moderation , which is a sad thing :(\n\nModeration can be turned off client side.",
				"added": 1576968725
			},
			{
				"comment_id": 118,
				"body": "What IFS and any other zite needs is a better global moderation/mute/filterlist functionality, which of course anyone can add or remove clientside based on their preferences. These will work just like addblock filterlists.\nTo get this feature, ZN needs to finally implement universal optional files UOF, which are referenced and shared by hash. This would allow for above suggested unified zn-wide mutelists, so chances are slim some unwanted content \"slips through\", as is high chances for all local moderated zites currently. Note that this would not censor anything, as no filterlist could be forced on users, and any filterlist could be completely checked for the validity of its moderated content. \n\nThe interesting point is how to argue such lists legally. Imo they would be on the same scale as googles warnlists of \"bad content\", just fully transparent and people driven, instead of intransparent and corporate driven.",
				"added": 1576969309
			}
		],
		"1577487392_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 119,
				"body": "Manjaro KDE if you dont trust IBM.",
				"added": 1577557403
			}
		],
		"1577663706_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 120,
				"body": "We need deduplication and universal optional files first to better manage data transfer and efficency of ZN. Tamas announced something like this at the beginning of 2019, it still needs to happen to improve many related issues and topics, like universal blocklists by hash, proper backing up of files and repopulating low or dead seeds, less risk of hubs file data disappear overnight, etc.",
				"added": 1577820539
			}
		],
		"1577813526_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 121,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1480_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Yes I'm testing it.for information, it has a 'sync module with youtube'. I'm not sure if it imports the videos or if it only links them.Which I do once the videos were imported: I removed the authorization (third-party access) on youtube for lbry.\n\nWhy you do that?",
				"added": 1577820847
			}
		],
		"1577853034_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": [
			{
				"comment_id": 122,
				"body": "> [draugrdeathlord](#comment_133_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): It really depends on what in particular has scaled. [...]\n\nIs this still true with the latest update?",
				"added": 1577873148
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 123,
				"body": "> [draugrdeathlord](#comment_89_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): The fed which is not federal is a private bank that enslaves the entire country with usury\n\nNumber 1 problem from which all others stem indeed.",
				"added": 1577873549
			}
		]
	},
	"comment_vote": {
		"104_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"10_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"104_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"294_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"24_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu": 1,
		"96_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}