{
	"title": "Patient Zero",
	"description": "headless. nevermind.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1553877200,
	"post": [
		{
			"post_id": 8,
			"title": "VPN, который смог",
			"date_published": 1553877012.087,
			"body": "Ну что ж. РКН тут удумали блокировать ВПН сервисы. Но были посланы. И правильно. Ишь что удумали! Открыть доступы к приватный каналам.\n\nКстати, среди пославших РКН числится OpenVPN"
		},
		{
			"post_id": 7,
			"title": "Эмиграция в Риссию",
			"date_published": 1550095598.966,
			"body": "Европейцы массово бегут в Россию, причём даже в санкционный Крым. За последнее время власти полуострова получили 1500 обращений из одной только Германии. Причём только около 400 из них поступило от выходцев из Советского Союза, все остальные — это немцы, которые не имеют российских корней. Об этом недавно сообщил глава национально-культурной автономии немцев Крыма Юрий Гемпеля.\n\nhttps://life.ru/t/мнения/1193502/ievropieitsy_bieghut_v_krym_ot_prieliestiei_ievropieiskogho_vospitaniia?&utm_source=twitter.com&utm_medium=social&utm_campaign=evropeytsy-massovo-begut-v-rossiyu--spasaya"
		},
		{
			"post_id": 6,
			"title": "Гравитационные летательные аппараты",
			"date_published": 1549324465.441,
			"body": "На ютубе натолкнулся https://youtu.be/1JeeaZlYonc\n\nПерезалил [https://gofile.io/?c=buBqol](https://gofile.io/?c=buBqol)\n\nКто что думает?"
		},
		{
			"post_id": 5,
			"title": "Следить за внесением и рассмотрением законопроектов РФ",
			"date_published": 1549050591.2,
			"body": "Никогда не задумывался, а оказывается, все просто и прозрачно.\n\n[http://duma.gov.ru/legislative/consideration/](http://duma.gov.ru/legislative/consideration/)\n\nПо этому адресу открывается портал Думы РФ, на котором выкладываются все тексты, комментарии и решения по всем выносимым, принимаемым и отклоняемым законопроектам России. Все в открытом доступе - бери и читай.\n\nПока начал почитывать, понял, что много законопроектов сводится к тому, чтобы изменить текст и содержание уже работающего закона. Из текста этих законопроектов не всегда удается уловить суть - требуется обратиться к тексту того закона, который предполагает быть измененным после принятия законопроекта. Этакий VCS для законов.\n\nUPD: нашел еще календарь [http://sozd.duma.gov.ru/calendar/b/day/2019-01-31/2019-02-01/1.1](http://sozd.duma.gov.ru/calendar/b/day/2019-01-31/2019-02-01/1.1)\n\nUPD-2: и структура их сайта [http://duma.gov.ru/legislative/lawmaking/](http://duma.gov.ru/legislative/lawmaking/)"
		},
		{
			"post_id": 3,
			"title": "Очередь за электронной литературой",
			"date_published": 1548882187.116,
			"body": "Итак, начало 2019 года...\n\nВ марте текущего года в Госдуму планируется внести поправки, определяющие порядок свободного использования образовательных и научных произведений, хранящихся в библиотеках, в электронной форме. Об этом говорится в материалах федерального проекта «Нормативное регулирование» нацпрограммы «Цифровая экономика». Документ, подлинность которого подтвердили участники профильной рабочей группы, есть у РБК. Речь идет о поправках в Гражданский кодекс, разработанных фондом «Сколково». В тексте поправок предлагается:\n\n1. разрешить библиотекам предоставлять удаленный доступ к электронным копиям книг при условии, что пользователь не сможет скопировать материалы, а также если его целью не будет извлечение прибыли (сейчас читатель может получить доступ к электронной версии книги лишь в помещении библиотеки или архива);\n\n2. разрешить читать в электронном виде научные и образовательные материалы любого года издания (сейчас такая возможность распространяется только на произведения, которые не переиздавались на территории России более десяти лет).\n\nМаксим Прокш, председатель группы «Интеллектуальная собственность» (работает в рамках группы «Нормативное регулирование»), сказал, что это будет правом, а не обязанностью библиотек, а также уточнил, что *те не смогут предоставлять доступ к одному и тому же экземпляру электронной копии сразу нескольким пользователям: если в библиотеке хранится один экземпляр, то только один человек может его просматривать единовременно, если 50 экземпляров — то 50 пользователей.*\n\n«Речь идет в основном о специальной литературе, так как доступ к знаниям — основная цель законопроекта, — пояснил Прокш. — Однако иногда художественная литература тоже может иметь образовательный характер, например, для студентов гуманитарных факультетов или школьников, но это относится в основном к классике, которая и так уже имеет статус общественного достояния. По его словам, законопроект касается именно тех книг, которые защищены авторским правом: «У нас нет цели обрушить издательский рынок, мы ориентируемся исключительно на то, чтобы образовательная и научная литература была доступна для любого жителя страны без необходимости совершать дорогостоящую поездку до библиотеки, где находится нужный экземпляр».\n\n___\n\nну что ж... докатились: все дружно встаем в очередь за электронной литературой!\n\nпруф здесь: https://roskomsvoboda.org/44578/"
		},
		{
			"post_id": 2,
			"title": "Зачем нужны дешевые товары?",
			"date_published": 1548707347.035,
			"body": "Еду сегодня домой с работы. Жена пишет в WhatsApp, мол, капец - электроплита сломалась. Прошу ее проверить пробки в щитке - говорит, все норм. Начинаю мысленно материть хозяев съемной квартиры, что поменяли одну сломавшуюся дешевую электроплиту на еще более дешевую.\n\nДоезжаю до дома, проверяю сам пробки - все действительно норм. Дергаю плиту из розетки, вставляю обратно, кручу ручки - лампы-индикаторы слегка загораются и снова гаснут. Ну, думаю, действительно, капец: все голодные и злые, еще и ребенок не кормленный, фарш уже готов жариться, а время - 21:00. \n\nЛезу в интернет в поисках быстрого решения - быстро купить почти ночью электроплиту а-ля дачный вариант.\n\nЛеруа-мурлен - только дорогие встраиваемые индукционные плиты. М-Видео - выбор вроде как есть, но все отзывы (внезапно) строго положительные (на дешевое китайское говно? лол!), цены как-то не достойны, да и в ближайших мазагинах, закрывающихся через полчаса - ничего нет. Ашан - на сайте штук 6 (аж!) подходящих дешевых вариантов. Бинго! Звоню на горячую линию, чтобы узнать наличие и определиться, в какой из двух Ашанов ехать. Объясняю ситуацию оператору, мол, хочу наличие узнать, подскажите. Ответ - у нас нет инфы по магазинам, но можем переключить линию прямо в магазин. Ну что ж, гуд. Жду переключения, слушаю мелодию. Отвечает молодой человек, я объясняю еще раз ситуацию, спрашиваю, какие электроплиты у вас есть. И тут он мне заявляет, что меня оператор зачем-то переключил на мебельный отдел! Мда... Звоню повторно, уточняю наличие, мчу в Ашан и становлюсь ~~счастливым~~ обладателем дешевой китайской дачной электроплиты. \n\n![photo_2019-01-28_23-28-33.jpg (1280x960)](data/img/post_2_photo_2019-01-28_23-28-33.jpg)\n\nВот для чего была нужна та, что хозяева подсуропили с \"барского\" плеча. Я даже инструкцию на эту Plama не нашел :) Зато теперь открылось ее истинное предназначение!"
		},
		{
			"post_id": 1,
			"title": "Patient Zero",
			"date_published": 1433033779.604,
			"body": "![PatientZero.jpg (720x720)](data/img/post_1_PatientZero.jpg)"
		}
	]
}