{
	"next_post_id": 4,
	"next_comment_id": 2,
	"next_follow_id": 3,
	"avatar": "jpg",
	"user_name": "Anonymity",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "iran",
	"post": [
		{
			"post_id": 1,
			"date_added": 1629348213,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1629348462,
			"body": "Firefox probably deliberately bug\nhttp://127.0.0.1:43110/1MhGQfprNcF4Xu7eaP9bvR4U5MZcq9wAa6/?Post:3",
			"date_added": 1629348460
		},
		{
			"post_id": 1629349917,
			"body": "### Why dictators hate anonymous payment systems:\nThey are several reasons dictators want to end anonymous payment systems\n1-It can be used as a replacement for phone verification for social networks account creation (currently all social media ask for phone verification if you are using a proxy like Tor)\n\n2- It can be used for anomalously running an online business e.g. an advertisement platform in dictatorships that hate citizens' easy life and real private sector. (This is why china banned ICO. It could help the growth of the real private sector. In my own country google ads were blocked)\n\n3- Content creators and activists can get paid without revealing their identity.\n\nHow they will end this in the world:\nUsing fake crimes like terrorist groups, they urge the world to ban anonymity. if you ask me these regimes also sponsor organized crime phenomenon (BTW Where are gun cartels, I have found nothing outside the USA, in darkweb, just some scammers) Most people ready to accept the danger of crime only when they are very poor this is why godfathers are probably only a show.\n\nIn my country, no one has the courage to sell guns. It is not because of AML law, you can collect enough money to take out of poverty in my country before reaching AML limit. it is because the government has made fear about it. That we are controlling roads and borders extremely. The point is, there are lots of other methods for stopping crimes Besides, everything has pros and cons.\n\nIf you are in the free world, you should inform your lawmakers and others. (Good life in our countries reduce immigration)",
			"date_added": 1629349914,
			"meta": "{\"img\":\"900,313,111123234135112346358147124334458248247,00012333334411056777888409ABCC\"}"
		}
	],
	"post_like": {
		"1FAaSRe6UxTYrNiWQnnqzSgDs4Vz9tgQPy_1630178809": 1630240155
	},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1FAaSRe6UxTYrNiWQnnqzSgDs4Vz9tgQPy",
			"user_name": "3rsh",
			"date_added": 1630240145
		},
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u",
			"user_name": "Concept7",
			"date_added": 1636999274
		}
	]
}