{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1584212301,
			"title": "ZeroID stopped showing that nice animated background",
			"body": "It now shows only solid black background for me. Is it just me or do you have it too?",
			"added": 1584212300
		}
	],
	"topic_vote": {
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1
	},
	"next_comment_id": 28,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "test",
				"added": 1582635524
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 2,
				"body": "> [linuxsourced](#comment_3_1JmxhPt4FDP7rTmmaxoKdwTSDhwg5YSatG): If you are going to use a vm I recommend qemu with kvm and gpu passthrough\n\nIs the performance close to native in games?",
				"added": 1582635601
			},
			{
				"comment_id": 5,
				"body": "> [ranshit](#comment_100_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): In my opinion, VM is just a way to waste resource. Why not just use a dual boot system to allow complete game optimization while performing non-gaming activities on a non-gaming operating system.\n\nThere is one major problem with this approach - if while gaming I want to check something unrelated, I end up browsing on a compromised system. It's too much hassle to switch back and forth every time you must use a browser.",
				"added": 1582725217
			},
			{
				"comment_id": 6,
				"body": "> [ranshit](#comment_101_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): I doubt you would have the need to look up otherwise sensitive material while you are gaming. Most people who I know need to 'look up something unrelated' while mid-gaming often have the habit of using their mobile device as to not interrupt their gameplay.\n\nyeah but I can't even use a VPN on a gaming system (it just slows down gameplay and they usually ban for it), so my browsing is exposed. even if i use Tor browser, the gaming system has a lot of proprietary software on it and thus I consider it compromised. the ideal situation would be to have 2 PCs but that would be a waste of money and space",
				"added": 1582746530
			}
		],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 3,
				"body": "> MONEY IS THE ROOT OF ALL EVIL.\nthat's a funny way to spell 'RELIGION'",
				"added": 1582635670
			}
		],
		"1582442446_1JmxhPt4FDP7rTmmaxoKdwTSDhwg5YSatG": [
			{
				"comment_id": 4,
				"body": "set Tor to 'always' in settings, this way no once can see what you download. But I definitely also recommend running zeronet on a linux with full disk encryption",
				"added": 1582635751
			}
		],
		"1582577947_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 8,
				"body": "> how not to panic?\nthe dead don't suffer, so we may as well all die",
				"added": 1582800087
			}
		],
		"1583203227_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 9,
				"body": "> lol no\n— Edward Snowden",
				"added": 1583268326
			}
		],
		"1583438031_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 10,
				"body": "Fuck windows, linux all the way",
				"added": 1583485731
			},
			{
				"comment_id": 11,
				"body": "> [rannulfr](#comment_49_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Archlinux > Any other linux\n\nNo. It has proprietary shit in the kernel.\nUnless you use a deblobbed one like Parabola/Hyperbola",
				"added": 1583610536
			}
		],
		"1583559326_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 12,
				"body": "It's a concept of a sentient supernatural entity with superhuman powers, often responsible for creation and upholding of the Universe. Particular interpretations of a 'god' vary greatly.",
				"added": 1583688336
			}
		],
		"1583587826_154DLn4k3ckpT1v151SLaFh7mmy4TnccmT": [
			{
				"comment_id": 13,
				"body": "In my country for example, the most popular lottery is choosing 6 out 49 numbers. The chance of choosing all 6 correctly is exactly 1 in 1 997 688, which is 0.00005005786689412961%. For comparison, the chance of getting hit by a lightning during your lifetime is about 1 in 3000, which is ≈0.03333333... %. So yeah, quite ridiculous.",
				"added": 1583688799
			}
		],
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 14,
				"body": "ZeroNet in a google-ruled appstore? That kinda defeats the purpose. Put it on F-Droid!",
				"added": 1583745928
			}
		],
		"1584198532_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 15,
				"body": "I think this stats are useless since almost everyone here uses tor or VPN...",
				"added": 1584212206
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 16,
				"body": "wtf it worked",
				"added": 1584274458
			},
			{
				"comment_id": 17,
				"body": "it's kinda nice, seeing that quite a lot people actually frequent ZeroNet",
				"added": 1584292970
			}
		],
		"1584291401_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 18,
				"body": "> This seemingly simple process is a bit hardened by the fact that the stop/rename/start order is important.\n\nYeah can confirm. When I deleted users.json while ZeroNet is still running, I was able to still post as that deleted user.",
				"added": 1584295037
			}
		],
		"1584141897_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 19,
				"body": "chinese gov is a terrorist organisation experimenting on humans so I wouldnt be suprised",
				"added": 1584353380
			},
			{
				"comment_id": 20,
				"body": "> [kanade](#comment_89_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Everyone loves to make up their own baseless conspiracy theories that have no substance to them. Provide proof & evidence or kindly shut the fuck up, you're just adding to the sea of garbage on the internet\n\neven worse than internet, zeronet is even deeper than darknet... which especially we should keep tidy",
				"added": 1584391532
			},
			{
				"comment_id": 21,
				"body": "> [pad](#comment_12_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG): Time will tell you who is terrorrist. Your get all news on YouTube, twitter, facebook about China are  fake news. All that news describe is Not real China. Because 1300000000 Chinese people don`t use that sites.\n\ni dont touch facebook or twitter and i watch only entertainment vids on youtube... but how do you think people can be happy under a regime that censors everything?",
				"added": 1584391618
			}
		],
		"1584655227_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 22,
				"body": "> [z0net](#comment_30_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): believe it or not, i'm pretty ok with that. it helps to anonymize my normie gmail, confuse NSA\n\nI'm from NSA. thanks for the information, we are not confused anymore",
				"added": 1584714827
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 23,
				"body": "nice try, NSA",
				"added": 1584715243
			}
		],
		"1584987289_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 24,
				"body": "What keeps me from switching to searx is that it doesnt work well without JS, and results often fail due to captcha or are just not accurate.\n\nWe need a truly decentralized and independent search engine with its own index",
				"added": 1584989456
			},
			{
				"comment_id": 25,
				"body": "> [topnet](#comment_16_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): We need a truly decentralized and independent search engine with its own index [...]\n\nWell I found that: https://yacy.net/\nbut I'm too lazy right now to try it",
				"added": 1585001859
			}
		],
		"1584287601_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 26,
				"body": "Opposing him? How can you oppose someone who is all-powerful? And why does an all-powerful god needs servants?",
				"added": 1585001913
			}
		],
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 27,
				"body": "Yeah, the clearnet is ridiculous with its downloading the same thing over and over and over again each time you visit a site.",
				"added": 1585001990
			}
		]
	},
	"comment_vote": {
		"488_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"9_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": 1,
		"15_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": 1,
		"19_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": 1,
		"23_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": 1
	}
}