{
	"title": "pozya's rndm",
	"description": "Рандомные мысли",
	"links": "[Я в ZeroMe](/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px/pozya@zeroid.bit)\n\n[Моя вика](/1DWy6QzHcFEbwj4F71SxXPPETVR5G5cpkZ/?Page:home)\n\n[Клирнетовский бложик](https://pztrn.name)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1537954974,
	"post": [
		{
			"post_id": 12,
			"title": "Переход на FreeBSD, про Docker, Kubernetes и NetXMS",
			"date_published": 1537952634.645,
			"body": "Давненько я сюда ничего не писал, вот решил исправить сие недоразумение. Так как вы это читаете, значит подписаны на мой зайт и вам интересны новые посты, не правда ли? :)\n\n## Переход на FreeBSD\n\nПервое, что у меня произошло за почти полгода с момента последнего поста - я успешно свалил с Linux на FreeBSD на своем домашнем сервере и подумываю сделать подобное еще на нескольких серверах, которые я администрирую. Причины просты:\n\n1.  Вменяемо работающая ZFS. Те, кто работал с ZFS и использовал ее возможности на полную катушку - поймут, о чем я. После ZFS любая другая FS - даже не FS, а обрубок. Мне очень понравилось управление снапшотами, например, а также возможность бэкапа отдельно взятого снапшота (как и восстановления).\n2.  Отсутствие излишних нагромождений. Например, я считаю systemd раздутым монстром, который все равно хреново справляется со своими обязанностями, несмотря на заверения обратного. Например, mount-юниты иногда (хотя какой иногда, в 50% случаев) могут не примонтировать сетевую ФС при прочих равных. А вот fstab монтирует на ура. Да-да, генератор .mount-юнитов из fstab, походу, справляется с задачей куда лучше, чем юнит, написанный с чтением документации по systemd. Ну и еще сюда же можно докинуть journald.\n3.  Клетки. Если честно, они, по сравнению с докером, божественны. Удобное управление, деплой, удаление, возможность назначить статику или динамику, возможность работать с клетками как с отдельными машинами на уровне сети.\n4.  PF. Он. **БОЖЕСТВЕНЕН**. Попробуйте и поймете.\n5.  ifconfig на все действия с настройками сети. После зоопарка Linux'a (NetworkManager, connman, ip, ifconfig, iw) это прям как глоток свежего воздуха, когда понимаешь, что не надо забивать голову сразу несколькими утилитами только для того, чтобы настроить Wi-Fi.\n6.  Порты и пакетник. Они тоже очень хороши. А все, что принято в дерево портов, автоматом пакетится. Есть возможность использовать пакеты и порты для веток или срезов (типа RELEASE, QUARTERLY, LATEST), есть возможность пилить свои репозитории.\n\nЭто, конечно, малая часть, но мне этого хватило, чтобы выкинуть линуксы с домашнего сервера. Нет, я не старпер, но современные тенденции в серверных линуксах меня разочаровывают, кроме, пожалуй, LXC/LXD, но их еще надо допилить.\n\n## Про Docker и Kubernetes\n\nВ последние полгода я очень активно использую и первое, и второе, и у меня сложилось четко негативное отношение к этим штукам. Например, у первого нельзя задать сетевые настройки для отдельного контейнера, а второй может не собрать кластер из нод. Вообще. А после переустановки вполне себе может собрать, несмотря на то, что все окружение - идентичное, даже сервера настраивались в одном и том же порядке :).\n\nДля себя сделал вывод, что эти две штуки для ынтырпрайза может быть и норм, но для личного использования - сильный оверхед и головная боль.\n\n## NetXMS\n\nРаньше я активно пользовался Nagios и Check_mk (см [http://omdistro.org)](http://omdistro.org)), однако меня начало очень сильно выбешивать, что мониторинг 30 нод по 100-150 параметров в каждой хочет под 4 гигабайта RAM. В поисках альтернативы наткнулся на NetXMS, который разрабатывается русскоговорящими ребятами и которые довольно оперативно отвечают на вопросы в телеграме, где у них есть две комнаты поддержки - русскоязычная и англоязычная.\n\nТакже мне, как халтурщику-админу, очень важно получать метрики с удаленных хостов, а строить VPN до сервера мониторинга зачастую нет возможности. В агенте NetXMS это сделано крайне легко - просто задаем пароль и все, соединение будет шифроваться с использованием этого пароля. Крайне просто и удобно."
		},
		{
			"post_id": 11,
			"title": "Мои мысли про ZeroNet, бложики и составляющие",
			"date_published": 1522538259.596,
			"body": "Идея для этого поста возникла абсолютно спонтанно и немного под влиянием постов в \"рядомнаходящихся\" блогах и форумах.\n\n## Социальные сети\n\nПервый пост, на который я наткнулся, был [про социалки](http://127.0.0.1:43110/1TALK5znjVqrULiRUiSuNALaCiKpWS1Xq/?Topic:1522504967_1GooUE19488nDwG3TdkM8seYAHct4gjkq4). И сразу начинаю цитировать и отвечать:\n\n> Я пытался понять, как сделать систему, в которой модераторов нет. И тут ко мне пришла простая идея — что если совместить wiki-движок (каждый может вносить любые изменения на любую страницу) и голосование? Пусть у нас будет такая wiki, где \"главный\" вариант текста определяется не тем, кто последний его отредактировал, а консенсусом пользователей: кто больше лайков набрал, тот и главный.\n\nВ любом случае найдется какой-нибудь \"несогласный\". Консенсус это хорошо, но не в данном случае, и вот почему. Некий Вася Пупкин разместил что-то на wiki.zeronet-russia.bit, и считает свою версию единственно правильной и рассово верной (Пупкин - пуп земли). Пришел Ваня Иванов, увидел ошибки, неточности, и исправил их. Версия последнего набрала больше лайков, стала основной. И Пупкин решил зайти опять на вику и посмотреть - кто, как и где, и увидел, что его версия уже не основная. Но он же пуп земли, как же так? А вот - регаем кучу учеток и ставим с них лайки своей версии. В итоге версия Пупкина вырывается вперед.\n\nПример простой, но в любом случае подобное что-то будет. Не может не быть :). И от этого надо как-то защититься, ибо если такое сделать без защиты - идея демократии и консенсуса есть пшик, накрутят же, инфа 146%.\n\n> Получится, что головной сайт предоставляет интерфейс для создание контента, лайков, поиска по содержимому и так далее. А данные он берет с тех шардов, которые вы к нему подключите. Все шарды имеют общее «пространство имен», т.е. на своём шарде можно создать версию статьи, которую вы увидели на другом шарде. Выбор, какие разделы, статьи и версии видеть, определяется лишь тем пользователем, который будет читать этот сайт. Лайки также можно хранить и подключать из разных источников, т.е. и «демократию» вы можете для себя создать свою собственную.\n\nА также постоянное нытье \"мои лайки не ушли тому котегу\", \"аффтар мудак\", \"пикча не отображается, @moderator!!!\" и прочие подобные приколы. От этого портится UX и люди уходят.\n\nЯ согласен с частью идеи - предоставить возможность хранить данные так, как хочется. Только эти \"как хочется\" должны быть ограничены протестированным списком, ибо смотри, что писал чуть выше. Начнется жопа. Полная. Представь, что ты заходишь на pikabu.bit, посмотреть котиков и мемы про Путина, а там одни квадратики, олицетрворяющие незагрузившиеся изображения. И лайков ноль. И в комментариях все жалуются на то, что Вася Пупкин, гад такой, после того, как починили накрутку в Wiki, положил свой хаб и свои мержеры, а он был топовым поставщиком контента, \"верните котиков гады!!!1адын\". И прочие подобные проблемы и нытье. И ладно, если тут будем только мы, технически подкованные и грамотные, а если популяризировать для домохозяек?\n\n> Итак, у нас получилась универсальная, децентрализованная, демократическая википедия, которая состоит из неограниченного количества источников контента.\n\nУ нас получился универсальный, децентрализированный, демократический провайдер жопы, потому что децентрализировано.\n\n### Предложение\n\nРассмотреть это не как децентрализацию (в описанном виде она будет грустной и злокачественной), а как федерацию. Вот только модель надо продумать, но это будет именно что правильнее - ничто при федерации не запрещает, например, запретить принимать контент от Васи Пупкина, коли он такой козел, гад и вообще лайки накручивает.\n\nКонечно, федерация всех проблем не решит, но я считаю, что именно федерация даст ту самую демократию, о которой писалось в посте, только более удобную конечному пользователю.И вообще это все надо продумать нормально, чтобы у нас была нормальная система, а не \"через жопу\" и \"котики не грузятся!!!\".\n\n## Бложики\n\nЯ бы оставил как есть. Вот честно, именно в блогах все идеально, их даже писать удобно! Ну может быть если только файлы разные можно было бы аттачить нормально :). Но это из области допилок, а не кардинальной переделки (или кардинальной запилки) функционала.\n\nНу и возможно бы допилил дефолтную тему, но у меня вкусы могут быть специфические, посмотрите хоть на этот шаблон :).\n\n## IPFS\n\nЯ лично против использования IPFS в ZeroNet из-за самой идеи сети и принципа ее работы - ты не знаешь, есть ли твой файл где-то и останется ли он где, или его \"выкусят\", или же та единственная нода, где он лежал, ушла в даун. Если уж хранить аттачи к блогопостам - то в блоге, если хранить аттачи к форумопостам - то на форуме, и т.д. Иначе привет описанная мною жопа с мержерами в первой части сего поста."
		},
		{
			"post_id": 9,
			"title": "Psi+ for macOS revived",
			"date_published": 1497190604.322,
			"body": "Некоторое время у Psi+ не было мейнтейнера, который собирал бы DMG для macOS, но теперь это изменилось :)\n\nМне по работе \"подогнали\" макбук (pro retina late 2013, если быть точным), на котором я решил начать собирать DMG. Скачать их можно с [официального сорсфоржа](https://sourceforge.net/projects/psiplus/files/Mac-OS-X/). Также я переписал скрипт сборки, который лежит в [официальной репе maintenance для psi+](https://github.com/pztrn/maintenance/tree/macos_fixes/scripts/macosx).\n\nПо всем вопросам с Psi+ для macOS можно смело пинговать меня или адресовать в psi-dev@conference.jabber.ru."
		},
		{
			"post_id": 8,
			"title": "Установка (или перенос) ZeroNet на Debian Jessie",
			"date_published": 1495296623.369,
			"body": "Написал небольшой гайд по установке/переносу ZeroNet на Debian Jessie, включая автозапуск через `/etc/rc.local`:\n\n[https://w.pztrn.name/pages/viewpage.action?pageId=6258703](https://w.pztrn.name/pages/viewpage.action?pageId=6258703)\n\nВдруг кому-то пригодится :). По этому гайду я переносил ZeroNet с локального арчика на виртуалочку под управлением Debian Jessie, пишу уже с нее, так сказать :)."
		},
		{
			"post_id": 7,
			"title": "Steemit, Golos и прочие \"криптоблоги\"",
			"date_published": 1495141445,
			"body": "Зарегистрировался на Steemit с надежде пощупать платформу, почитать людей и провести некий анализ того, что там происходит и можно ли это вообще использовать.\n\nОказалось, что нет.\n\nВо-первых, это цензура, причем не в классическом понимании \"царь запретил - холопы не смотрят\", а есть некая группа людей (или даже один человек, у которого много STEEM POWER), который просто берет и флагает пост. И пишет какую-то ахинею в комментариях. Яркий пример - [Alexa Nova](https://steemit.com/@alexanova).\n\nА раз уж привел такой пример, то надо рассказать о моем отношении к. Мне пофиг. Нет, вот серьезно, абсолютно пофиг. Конечно, я не одобряю, когда порно смотрят \"детки до 14\" (будем реалистами, все, кто старше, уже не раз его смотрели, а то и \"пробовали приемчики\"), неокрепшая психика и все дела, хотя у некоторых психика может быть даже покрепче моей. Но это не повод для меня (и, кстати, всего моего окружения) как-то ненавидеть и цензурировать подобные посты. Мы, умные люди, знаем, что есть такая кнопочка \"Mute\", и она, кстати, есть везде (почти). Ну или на этот сайт можно просто не заходить.\n\nЧитая комментарии к постам, особенно от тех, кто \"флагал\" записи Алексы, я реально чуть не взоржал в голос (а ржать нельзя, рядом спит жена). Гребаные религиозные фанатики! \"Я тебя пофлагал, потому что не люблю порно, и вообще я религиозный человек, а ты сгоришь в геене огненной!\", или \"я тебя пофлагал, потому что зарегистрировал свою маленькую племянницу тут!\". Бугага, мне над такими хочется ржать и издеваться, хотя понимаю, что над слабоумными издеваться и смеяться нельзя.\n\nИ опять же, небольшое разъяснение про предыдущий параграф. Меня крестили, но я закоренелый атеист \"в самом широком смысле\" ([википедия,](https://ru.wikipedia.org/wiki/%D0%90%D1%82%D0%B5%D0%B8%D0%B7%D0%BC) второе предложение статьи). Причем тут обязательно надо уточнить, хотя даже нет, **заострить внимание** на том, что именно \"в самом широком смысле\". Я про свою веру говорю так: \"я верю в себя, свои силы, свою семью и людей, которые мне дороги. Мне не нужна вера в эфемерное (если вообще существующее) существо для того, чтобы быть сильным и решать проблемы\". В то же время я не нападаю на верующих людей, ибо я уважаю их право верить в то, во что верят. У меня прилично знакомых и немало друзей, которые довольно религиозны, однако это не мешает нам друг друга уважать. Наверное, все дело в том, что с мозгами у нас с ними в порядке.\n\nИ я не стану регистрировать где-то своего ребенка или предлагать ему это. Зачем заставлять человека делать то, что он, наверняка, не хочет? Развитие кругозора? Да ну нафиг, я лучше с дитятком поиграю, схожу в поход, покатаюсь на велосипедах или даже поиграю в компутерные игрушки.\n\nИ вот представьте - какой-нибудь религиозный фанатик наберет достаточно STEEM POWER и будет флагать, например, посты про науку (ведь религия в фанатичном варианте почти всегда отрицает все научные достижения, а ученых называет шарлатанами. Опять же, упор на **фанатичный вариант**), надеясь тем самым приблизить каменный век, чтоли? Или темные времена, которые длились почти тысячелетие?\n\nПоэтому я буду пользоваться ZeroNet и стендалонами. Хрен кто \"флагнет\", хрен кто заставит замолчать. А для всех остальных - отписывайтесь и не заходите.\n\nМожет, Алексе рассказать про ZeroNet? Правда, тут не монетизируешься %)"
		},
		{
			"post_id": 5,
			"title": "Про чатики",
			"date_published": 1492786357.66,
			"body": "В последнее время развелось много всяких чятиков - Telegram, Whatsapp, Viber, Matrix, Rocket.Chat и прочие. Но нет ни одного хорошего. Почему?\n\nПотому что это субъективно :) Вот мне например интересна федерация, интересна возможность поднять свой сервер, который будет хранить мои учетки, мою историю. Мне очень интересны групповые чаты, а также аудио- и видео-звонки. И еще мне очень интересно, чтобы обычные пользователи (мои родители, друзья) смогли без помех и трудностей там зарегистрироваться и общаться.\n\nЧто такое среднестатистический пользователь? Это некий \"черт\", который хочет все и сразу, да забесплатно. Это игрок в дотку, которому надо общаться с друзьями, это домохозяйка, которая хочет общаться со своей семьей и звонить по видеосвязи своей маме. И все это должно быть доступно \"для чайников\", без всякого поднятия серверов. Таких примеров можно придумать тысячу.\n\nВсе текущие системы обмена обмена сообщениями удовлетворяют потребности только одной категории - среднестатистический пользователь. И правда, надо же коммерциализироваться как-то, рекламу показывать или, например, продавать данные о своих пользователях третьим лицам. Нет, я ни за кем такого не замечал, и ни на кого не намекаю.\n\nИ тут мне пришла в голову гениальная идея - а напишу-ка я свой чат :). Авторизация по GPG, ключи шифрования в зашифрованном виде хранятся на сервере, A/V по WebRTC, федерация, легкость настройки и многое-многое другое. Сейчас спеки протокола находятся в допилке, так как есть несколько краеугольных мест, но скоро и они появятся в приведенном в порядок виде.\n\nЭто я к чему - если у вас есть желание сделать действительно секурный чат на основе GPG - пишите в комментариях, пишите мне в zeromail (<span class=\"address\" title=\"1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px\">pozya@zeroid.bit), и даже можно это делать в [Friendica](https://f.pztrn.name/profile/pztrn).</span>"
		},
		{
			"post_id": 3,
			"title": "Опять на тему тем",
			"date_published": 1492718348.464,
			"body": "С ZeroNet я знаком уже довольно долгое время (если год можно считать долгим временем), однако всерьез решил поселиться тут только недавно. А как же можно поселиться где-то и не иметь там своего, например, бложика? :)\n\nКакой бы движок блогов я не использовал - я всегда допиливаю его под себя. Это может быть тема, или же какой-то необходимый функционал, который отсутствует. В [клирнете](https://w.pztrn.name) я запилил свой бложик на основе Confluence, благо у меня была лицензия как у опенсорсного разработчика. Кстати, такие же лицензии у меня есть для всего софта Atlassian, кроме HipChat'a.\n\nИ даже там, если посмотреть, внешний вид изменен прилично - был доустановлен плагин, который позволяет вообще хоть как-то пытаться вменяемо Confluence использовать в качестве движка для блогов.\n\nА вот если смотреть на ZeroNet и местный движок блогов - то тут все грустно в плане тем оформления. Их просто нет :). За сим, как и в прошлый раз, я объявляю месяц тем - когда я буду пилить свою тему для этого блога и, в конце концов, где-нибудь ее выложу. Возможно даже на местном русскоязычном форуме.\n\nВ общем, stay tuned && follow :P"
		},
		{
			"post_id": 2,
			"title": "Привет, мир!",
			"date_published": 1492716665.616,
			"body": "И снова здравствуйте.\n\nЯ тут, конечно, уже был, но успешно \"пролюбил\" ключ от своего основного ника (pztrn). Так что теперь я тут pozya. Милости прошу :)"
		}
	]
}