{
	"next_topic_id": 15,
	"topic": [
		{
			"topic_id": 1542497364,
			"title": "Ingyenes anonim internet wifivel,torral kellékek és beállítások",
			"body": "Egy internetezési lehetőség amely ha nem lépsz be az adott hálózatról saját nevedhez köthető valamilyen fiókkal E-mail,skype,MSN,Stb... gyakorlatilag teljesen visszanyomozhatatlan lehet ha jól csinállod.Emelett havidíj nélküli ingyenes internetet is boztosít sok esetben akár saját otthonodból.\n\n[Profi Wifi vevő összerakása távoli kapcsolatokhoz](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542472799_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nAz 1. videóban a saját wifi vevőmet mutatom be de írok más lehetőségekről is.Ez direkt arra van tervezve hogy több wifi adó közül lehessen válogatni különböző pontokon tehát ha nem csak egy fix pontról akarunk interneteni pl ingyenes Hot Spot nyilvános internrnet és emelett fontos a teljes szoftveres támogatás ezt mind biztosítja.Itt a wifi vétéléhez szükséges felszerelésen kivűl semmi egyébb díj nincs ami meg gyorsan megtérül.Az összeállítás olyan hogy szoftveresen  teljes egészében kompatibilis minden a számítógépen futtatható wifis programmal ellentétben egy routerrel,access pointal vagy range extenderrel.Emellett ha elláttuk a számítógépünket teljes merevlemez titkosítással akkor szó szerint a titkosítás feloldása nélkül semmilyen információt nem lehet kinyerni a számítógépről.Beleértve a módosított mac címet és modosított számítógép nevet.\n\n[Hogyan használjunk egy általunk feltört wifi hálózatot a wifi feltörés alapjai](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542472160_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nA 2. Videóban bemutatom hogyan kapcsolódjunk egy wifi hálózathoz a lehető leg észrevétlenebbül és hogyan titkosítsuk le az internetforgalmunkat hogy azt se a wifi hálózaton belül se szolgáltató fellöl ne lehessen lehallgatni.Illetve weboldalak felöl hogyan rejtsük el azt az IP címet ami a wifi szolgáltatáshoz tartozik hogy ne lehessen visszakövethető IP cím alapján a szolgáltatás ahonnan elérjük az internetet tehát amit a wifi hálózat kap IP címet az internetszolgáltatójától amivel belehet azonosítani a hálózatot visszalehet követni amit mi használunk.Illetve a wifi feltörésről lesz szó nagy vonalalakban plusz bemutatok egy alap összeállítást.\n\n[Védelem az interneten hatósági nyomon követés visszakövetés lehallgatás ellen](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542472549_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nA 3. videóban szó lesz az internetbiztonságról a proxyk VPN szolgáltatások hiányosságairól és hogy ezek miért nem a leg megfelelőbbek és hogy a TOR szoftver pl miért mérföldekkel jobb náluk.Szó lesz róla hogy nagyjából ki mit lát nagyvonalakba rólunk.",
			"added": 1542497362,
			"parent_topic_uri": "1589136441_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1542580642,
			"title": "The most possible extreme powerful professional flash powder",
			"body": "Whats the most powerful professional flash powder what you can make at home,safe,extreme bright,the voice is sharp, and the destruction power was amazing too.About 10 year research i find the perfect flashpowder.I tested all possible flash powders with all possible of ratio this time. And nothing can beat it.This flash powder was the KClO4/Al/S 50/40/10% (Potassium perchlorate/Aluminium/Sulfur) with 3-4 micron german dark aluminium powder.\n\nIf you make firecrackers this flash powder was the best what you can make it at home. There are no disadvantages just real power.\n\nBut why:\n\n-The mixture was absulute stable and safe.The mixture was absolute professional mixture.\n\n-The mixture are more powerful with 3-4 micron aluminium powder than the KClO4+Mg 50/50 mixture what used in M80 salutes.Much more brighter and effective.Its have the KClO4/Mg/S flash powder 50/40/10% (with 400 mesh magnesium powder) all power and extreme sound.Plus its much more stable than a KClO4/Mg 50/50 mixture.\n\nBut in flash effect its almost have the Ba(NO3)2 flash powders extreme bright big effect.1,5g in a polumna (triangle) firecracker are 1,5 km far away can hear the extreme powerful sound.And the flash effect in the night are brightly shiny.\n\n-The ratio was the most strongest KClO4 Al S ratio.Works with coarser aluminium too.The ratio beat all another KClO4/Al/S ratios.\n\n-When you directly ignite it its not faster than other flash powders.But is you put in a paper tube performance can not be compared to other mixtures like:KNO3,KMNO4,Ba(NO3)2,mixtures.\n\n-Its a all in one flash powder: extreme bright,extreme sound,safe,extreme power,plus a professional mixture.\n\n-Sulfur and aluminium powder are cheap and easy to buy. No extra special costly ingredients are needed what you does not use from something else.\n\nThe extreme powerful kclo4 flash powder using a ball mill:The finely powdered 24h in a ball mill milled potassium perchlorate 200°C-300°C heated than at room temperature mixed with sulfur powder at 5:1 ratio than milled again in a ball mill more 12 hour the 2 component.And mixed 6:4 with 3-4 micron dark aluminium powder, and sifted in a sieve 3-4 times.Thereafter are thoroughly mixed in a mortar and paste in small doses so that the constituents are well mixed and sifted in a sieve again.If the components they are not well-mixed to a homogeneous powder the flash powder will minimum 50% it will be weaker.With kclo4 potassium perchlorate the mixture are stable and highly resistence for friction.And the kclo4+S 5:1 mixture is not flammable. If you carefully mixed together the ingredients mixed in a mortal and pastle to make the ingredients homogeneous.Its will be more than 50% powerful as if the mixtures were just shaken together.Before you use sieve through a sieve so that the powder gets loosened.The mixture are largely resistence for friction so you can safely make it.\n\nBut then why is not it so well known like the classic Kclo4/Al 70/30 or Kclo4/Mg 50:50 mixture?\n\nIn professional pyrotecnics one of the goals is cheapness.The other thing is that the mixture is too strong.In homemade pyrotechnics the KClO4 are a costly material.So people use the classic mixtures.Another thing KClO4/Al/S mixtures with more KClO4 or more sulfur you can easy slow down the mixture.Like the shimizu flash comp 64/23/13.So find the most powerful and best KClO4 flash powder ratio and ingredients need  several years of experimentation.\n\nYou can find videos and more about this flash powder from here: \n\n[My C&P Video channel](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Channel=mx5kevin@zeroid.bit)\n\n[My Hungarian Zite](http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/)",
			"added": 1542580639,
			"parent_topic_uri": "1538011712_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1542582089,
			"title": "Tutorial,How to make professional firecrackers from household materials",
			"body": "My Hungarian ZeroNet zite: http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/\n\n[The most possible extreme powerful professional flash powder](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1542580642_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/The+most+possible+extreme+powerful+professional+flash+powder)\n\nToturial,How to make professional firecrackers at home from household materials.\n\n#How to make powerful firecracker flash powders and fine magnesium aluminium powder\n\n[How to make powerful firecracker flash powders and fine magnesium aluminium powder](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542490785_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA) \n\n[How To make in Bulk HQ Flash Powder with ball mill](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542490289_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA) \n\n\nThis video i made special catalysed flash powders for firecrackers (Petard) and fine powdered magnesium and aluminium powder with household materials.I will test the flash powders sensytivity,stability,and power.I will coat the magnesium with linseed oil for protect it from the another mixed chemicals.I will show you how mutch extra power gives the flash powder if you use extra catalyst like sulphur.\n\nThis flash powder made from home made aluminium and magnesium.The magnesium powder made water heater anode (this is 75% Mg 25% Al) and the aluminium powder made aluminium foil and grinded a poppy seed grinder.The water heater anode burnish with sand paper.The fine podwered metal podwers made a granite (or satinless steel better) plate and bar (Stamp Process).The metal particles are only ground when they are a single layer between the two surfaces, and only a very tiny portion of two round surfaces are close enough to eachother.\n\nIf either component but especially the metal powders are not enough fine ,the flash powders will burning slowly.This flash powders works the best with 400 mesh and much more finer magnesium powder and 3-4 micron dark aluminium powder.If you want the best result always buy and use the possible most finest particle size metal powders.\n\nCatalysed flash powders ratio for firecrackers:\nNormal Kno3 Petard flash:\nPostassium Nitrate/Magnesium/sulphur Kno3 Mg s 50/40/10%\nExtreme strong with bigger effect:\nPostassium perchhlorate/Magnesium/sulphur Kclo4 Mg s 50/40/10%\nExtreme strong:\nPostassium perchhlorate/Aluminium/sulphur Kclo4 Al s 50/40/10%\nNormal strong very bright:\nBarium Nitrate/Magnesium/sulphur Bano3(2) Mg s 50/40/10%\nNormal strong (stronger than kno3) big effect:\nPostassium permanganate/Aluminium/sulphur KMNO4 Al s 60/30/10% (6/3/1)\n\nCatalysed flash powders are mutch stronger than normal flash powders.The magnesium based flash powders are coated with linseed oil to protect the magnesium powder.\n\nThe winner flash powder was Kclo4/Al/S 50/40/10%.Its works best with professional 3-4 micron dark aluminium powder.It was extreme powerful,extreme loud,very bright and absolute stable.Its much better than the magnesium version.The magnesium version Kclo4/Mg/S 50%40/10% has a very pale and small effect in larger firecrackers.Unlike the aluminium which completely different is true.If you want extreme loud,extreme powerful,extrem bright firecrackers with stable mixture Kclo4/Al/S 50/40/10% are the best.This vas the most powerful Kclo4 Al S ratio and much more stronger than standart Kclo4/Al 70/30 and better than Kclo4/Mg 50/50.\n\nThe process was easy\n\n-The magnesium powder was milled the possible finest powder\n\n-The magnesium powder was coated with 4% pure boiled linseed oil what dissolved in white spirit than completely dried serval days to get a hard strengh coat.(See Takeo Shimizu fireworks the art science and technique) in Magnesium.\n\n-The potassium perchlorate first heated to make it wapor free.Than grinded down in a poppy seed grinder to the possibble finest powder 3-4 hour grinding.And heated serval times in a hot plate so the dust does not knot.\n\n-The 5 4 1 ratio are a balance-sheet weigh out.\n\n-The potassium perchlorate heated again.And grinded more finer in a mortar.\n\n#-Now i used protective gear closed safety glases,and safety gloves!\n\n-The sulfur are grinded and al components are mixed\n\n-All component carefully blended to a homogeneous powder in the mortar.Not grinded!Just softly and carefuly mixed together the ingredients.In two small max 5g dose!\n\n-The flash powder must be always sive in a sieve before use in firecrackers to loosen the dust!\n\nKclo4 Aluminium sulfure with 4 micron aluminium are much more stable,brighter,mutch more effective and have the same sound so i recommend to use aluminium with sulfur. \n\n#How to make Home Made black powder fuse for fireworks\n\n[How to make Home Made black powder fuse for fireworks](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542490459_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nHow to make Home Made black powder fuse for fireworks at home (black match fuse).Supplies: 0,3mm embroidery thread and black powder+clean water +3 hour total work.The concentrated black powder paste nothing else only pure black powder+clean water. This paste is heated to dissolve the dense concentrated solution get and put in to the embroidery thread.The 0,3mm embroidery thread soak up about 3 hour all of black powder (80cm embroidery thread 20g Black powder should count).Result is 1.8 cm cheap simple excellent black powder fuse.Next step Make a Blackpowder+5% glue paste (dextrin,gum-arabic or nitrocellulose from pinpongballs) and add the dissolvent nitrocellulose:Denatured Alcohol+Aceton 1:1  Ml Dextrin or Gum-arabic:Denatured Alcohol+water 7:3 Ml.And overcoat the black powder fuse fuse this paste.This fuse guaranteed does not stop the burning, even if packaged in there is something because a lot of blackpowder the cotton embroidery Thread knit on the inside.This Black powder fuse burning much stable stronger than other home made fuses like traditionary Black match fuse.The black powder fuse made from standart 75/15/10 Hardwood grill charcoal black powder.Easy to make with little materials guaranteed massive Burning.This is good cheap alternative for visco fuse.All the same 5m or 50m all 3 houor total work cheaply in large quantities can be.Only drawback direct to ignite unsafe but this is true for another Black match fuses.Black Match fuses can stop burnings but this fuse guaranteed never stop burning,look the test foil on video.I use it for several years old time-tested good old recipe.This is not Blackmatch Fuse this is a homemade black powder fuse.The recipe is different from making and the burning property and another properties different.\n\nWarning:Never direct ignite it use plus safety fuse like rubber bands (jar rubber),.This is not safety fuse this is a intensive but moderated burning fuse. \n\n#The original Blackmatch fuse\n\nOr the easyer original blackmatch fuse\n\n[Blackmatch fuse 5% dextrin 70 Alcohol 30 H2O test Original but homemade](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542582963_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nCotton string\n75/15/10 ratio willow black powder \n+5% dextrin \n70/30 Alcohol/Water\n\n\"Black Match\" is simply a cotton string covered with Black Powder. When a small piece of Black Match is inserted in a length of Japanese Time Fuse, it's then called \"Crossmatch\". If Black Match is covered in a thin paper tube, it burns hundreds of times faster than normal and is called \"Quickmatch\". All in all, Crossmatch, Black Match & Quickmatch are all essentially the same, and are made from lengths of cotton string covered with Black Powder.\nManufacture\n\nTo make Black Match, you're going to need 3 things: A plastic container with a snap-on lid, a 1/8\" drill bit, some Meal Powder (which is just very finely powdered Black Powder), Cotton String, and a little Dextrin. Make sure you get Cotton string, not nylon or any other synthetic material. The string must be Cotton and must be able to absorb water quickly. The best you can get will be from a fabric store. They usually sell unbleached Cotton string, which is by far the best thing to use... although ordinary white Cotton string will work fine. Make sure the string is less than 1/8\" diameter. The ideal string is about 1/16\" Cotton String, although any size under 1/8\" can be used.\n\nThe first thing to do is to drill a 1/8\" hole in the lid to your plastic container. Don't just poke a hole through the lid, the hole must be a clean, smooth 1/8\" hole free of burrs.\n\nPour 50 grams of Meal Powder and 2,5  grams of Dextrin into your plastic container.\n\nWhile stirring, add the 70/30 Alcohol/Water at a time until the mixture forms a runny paste ( about the consistency of ordinary Ketchup ).\n\nCut a 3 foot length of Cotton string and carefully coil it into the Meal Powder paste, pushing it down into the mixture until it is completely covered.\n\nThread the other end of the string through the 1/8\" hole in the plastic lid. Leave about 2 \" sticking out of the hole.\n\nSnap the lid on the container, and set the whole thing on the ground.\n\nSlowly, pull the string through the hole, and it will emerge perfectly coated.\n\nUsing some tape, or better yet a thumb tack, attach the coated string to an overhang to dry. It's very sticky & messy while wet, so be careful not to let it touch anything until it's dry.\n\nAfter a couple of days, your Black Match will be dry and quite stiff. Cut off a small length and test it outside. It will catch fire easily when lit, and burn just like a fuse. If you take a longer length of Black Match and cover it in a thin, tight paper tube, you'll find that it burns much faster. This is known as Quickmatch. The faster burning is due to the pressure increase inside the tube. As the Black Match burns, hot gasses and flame build up in the tube and is forced down the length of the thin paper tube at high speed. Some commercial Quickmatch can burn at almost 500 feet per second.\n\n\n#How to make a extreme powerful mini polumna triangle firecracker\n\n[Gyári mini háromszög petárda elkészítése házilag](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542488696_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n#How to make a polumna triangle firecracker\n\n[Profi gyári petárda elkészítése házilag egyszerűen gyorsan](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542489237_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n#How to make strong firecrackers (petard) at home this is original home made firecracker and its very loud and powerful\n\n[How to make strong firecrackers at home](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542491122_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nThe Flash powder is  complete fill the paper tube, and its looks like a strong array but its not a  strong array but this time for good because the flash powder is well fills densely the paper tube.But when you unpack the firecracker the Flash powder are friable and not a array.If The Flash Powder is not enough dense  insaide the firecracker, or good quality flash powder firecracker will be much weaker.But if you press your flash powder in a array your firecracker will not work. Before you load the Flash powder the firecracker do a test paper tube and follow the video.\n\nFlash powders  for petard firecracker: Kmno4/al/s 60/30/10%, Kclo4/al/s 50/40/10%, Kno3/mg/s 50/40/10%, Kclo4/mg/s 50/40/10%, The loudest of the Kclo4/Mg/s\n\nThe firecracker paper glued by water glas sodium silicate upper and lower  2cm gypsum closing the firecracker\n\nFirecacker petard 1 (smaller)Made it by 2 piece 7cm large 14,5cm long write paper wrapped in 0,5cm staw full paper lenght 29cm\n\nFirecacker petard 2 (larger)Made it by 2 piece 7cm large 21cm long write paper wrapped in 0,7cm  pencil full paper lenght 42 cm\n\nIn this video i tried softly compress the flash powder.This was a mistake in my method.Its works but my later tests I realized  the flash powder must be veary losely loaded.The  paper thickness are veary ideal. \n\n#Atomic extreme powerful firecracker using 130g Kclo4 Al S 50/40/10% flash powder+8l Gasoline\n\n[Házi készítésű petárda 130g kclo4 Al S Ti villanópor 6l benzin 10% titán robbantás](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542471670_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nThis video i sieve the flash powder and veary loosely loaded in the tube.This give me the best resoult. \n\n#K2S2O8 Mg Na2S2O8 Mg the powerful Kclo4 alternative in flash powders\n\n[K2S2O8 Mg Na2S2O8 Mg the powerful Kclo4 alternative in flash powders](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542491260_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nThis was a Kclo3,Kclo4 alternative in flash powders.You can get the extreme power of Kclo3 Kclo4 using K2S2O8 or Na2S2O8 Mg 50:50.This was more powerful than kmno4 based flash powders. \n\n#Making the original professional match crackers\n\n[Making match crackers tutorial](http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/petarda.html)\n\n[Glusatz The original Slow Burning “Fuse” Comp from British bangers from the 1980s](http://127.0.0.1:43110/1P6V2kYa7FwgDDTv5yE3QxacGWsBH8gXSw/glusatz.html)\n\n[Glusatz delay tests and final match cracker test](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1581269652_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n[Match Head Compositions](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/Match%20Head%20Compositions.zip)\n\n[Making mini match crackers tutorial](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1583409810_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)",
			"added": 1542582085,
			"parent_topic_uri": "1538011712_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1542584939,
			"title": "Making potassium perchlorate KClO4",
			"body": "Making potassium perchlorate KClO4",
			"added": 1542584934,
			"parent_topic_uri": "1589138631_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1542586031,
			"title": "Making Ammonium perchlorate NH4ClO4",
			"body": "Making Ammonium perchlorate NH4ClO4",
			"added": 1542586025,
			"parent_topic_uri": "1589138631_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1543259718,
			"title": "Alapanyagok eszközök általános beszerzési forrásai a kereskedelemben vegyészeti és pirotechnikai célra",
			"body": "",
			"added": 1543259711,
			"parent_topic_uri": "1538011472_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1543481967,
			"title": "Alap felszerelés házi készítésű tűzijátékokhoz",
			"body": "Sok féle tűzijátékot nagyon egyszerű házilag elkészíteni és az ehhez való felszerelést már egy nem túl drága szilveszteri bevásárlás árából ki lehet hozni.Egy alap felszereléshez egyszerű dolgok kellenek és pár egyszerű alapanyagból nagyon sok féle tűzijátékot összelehet házilag rakni.Négy egyszerűen beszerezhető alapanyagot említenék meg Kálium Nitrát,Magnézium por,Faszén és kénpor és igazából kezdetnek nem is lesz szükséged semmi más bonyolultabb vegyszerre.Ebből már minőségi petárdákat,rakétákat,telepeket,vetőcsöves tűzijátékokat és még sok mást el tudsz készíteni házilag.\n\nMilyen alap felszerelésre lesz szügséged.\n\nAlap felszerelés:\n\nA legfontosabb természetesen az alap védőfelszerelés ami egy zárt védőszemüveg,védőmaszk és egy pár vastagabb védőkesztyűből áll.Enélkül ebbe a hobbiba bele sem szabad fogni.Ezt mezőgazdasági boltba illetve olyan helyen kapod meg ahol vésőfelszereléseket árulnak.A védőszemüveg esetén külön kiemelném hogy zárt legyen!Ezt gumi veszi körbe.A célra egy búvárszemüveg például tökéletes.De semmiképp sem nyitott szemüvegről van szó!\n\n-vegyészmérleg: ami 500g ig mér de mg ra mér.01g pontosságú legyen meg finomabb felesleges!Ékszermérlegként keresd.\n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543480556-vegyeszmerleg.jpg)\n\n-konyhamérleg: grammra mér legalább legalább( 1g/0,05 OZ ) pontosságú ajánlott \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543480885-konyhamerleg.jpg)\n\n -kézi tekerésű mákdarálló:Én a kézi hajtású mákdarálóra esküszöm mert nem elektromos  de nagyon sok a bóvli ezért alaposan néz körbe gyakorlatilag ez malmozza a terméket. Belülről minél jobban fedjék egymást az alkatrészek és a kivezető nyílás mindenütt egyenletes legyen és minél apróbb amelyiken nem egyenletes a lyuk pl alul vagy felül van kis hézag azt meg se vedd mert ott nem darálja meg rendesen (még a mákot se) alaposan nézz körbe. Tehát a mákdarálónál belső alkatrészek jól fedjék egymást egyenletes legyen a kivezető nyílás és minél apróbb. Minél kisebb a kivezető  nyílás annál jobban át őrli annál jobban dolgozik.\n\nA belülről lévő csigát is fontos hogy tudjam állítani hogy kijjebb beljebb legyen  így állítható hogy lazábban vagy erősebben őröljön ezt a végén lehet állítani kijjebb beljebb legyen,ez pl alufólia darálásnál nagyon fontos. A bóvli és a jó minőségű darálók ugyan abban az árban vannak tehát nézz körbe drágát ne vegyél mert nem biztos hogy jobb. .Tehát állítható is legyen mert pl ha nem tudod állítani a csigát akkor pl alufóliát nem biztos hogy le tudod darálni. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543481219-makdaralo.jpg)\n\n-gránit vagy márvány mozsár:Egy olyan kőmozsár ami alul öblös kikerekített nagyon finoman lehet benne őrölni persze forgatva gyakorlatilag belülről akárhova kerül az anyag szépen eltudjam dolgozni a morzsolóeszköz vége lekerekített legyen az anyag ne képezzen nagy fojtást vastag falu legyen mindig a mozsaram sok a gagyi ezért alaposan megkell nézni a választékot csak a kifogástalan a jó. A legfontosabb  hogy a morzsolóeszköz és a mozsár töké letessen fedjék egymást mindenütt és jól tudjam benne forgatni a morzsolóeszközt akárhogy forgatom mindig tökéltessen fedjék egymást az edény fala alja és a morzsolóeszköz. Úgy őrlöm benne  az anyagot hogy gyakorlatilag körbe körbe  forgatom a terméket tehát malmozom vele, egy egyenletes forgató mozgással lehessen benne őrölni.\n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543482195-granitmozsar.jpg)\n\n -egy olcsó kislábas\n\nVegyszerek:\n\n-Kálium Nitrát műtrágya (Salétrom):Nitrogén 13% Kálium 46% a káliumon és a nitrogénen kívűl egyébb összetevőt ne tüntessenek fel rajta.K2O meg N illetve NO3 van rajta feltüntetve ez 98-99% tisztaságú kálium nitrát. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543482489-kaliumnitrat2kg.jpeg)\n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543482816-kaliumnitrat25kg.png)\n\n-Ventillált kénpor (Kénpor):Ez 99,9% tisztaságú elemi kén. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543482930-ventillaltkenpor.jpg)\n\n-Aktív anód (magnéziumpor):Ez 75% Magnézium 25% alumínium ötvözet olcsó és nagyon jó magnéziumforrás.250g nál több por nyerhető ki belőle olcsón. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543483081-aktivanod.jpg)\n\n -Grillfaszén:Ez keményfa de sokkal jobban jársz ha házi puhafaszénből készíted egy rossz festékesdobozban szóba jöhet (Nyárfa,Hársfa,Mogyoró,Taplógomba,fűz,Kutyabenge,valamivel lasabb égésű reaktívabb lőporhoz magasabb gyantatartalmú fenyő).Ennek az az oka hogy puhaszenet nem kapsz boltban és igazából pirotechnikában csak puhafaszenet használnak.Hidd el megéri mert finoman szólva is még egyszer olyan reakcióképes és a lőpor is minimum még egyszer vagy sokszorosan olyan erős vele.\n\nAlapanyagok:\n\n-Vízüveg:rideg nagyon kemény hengerekhez.34% oldatban kapsz ami 1 literes.\n\n-Fénymásolólap:hengerekhez\n\n-Faragasztó: oldható kötésű hengerekhez (ha akarod) fehér színű ezt használatkor amennyit elhasználsz csapvízzel kb 1:1 arányban kell higítani. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543483192-faragaszto.jpg)\n\n -Glettelőgipsz\n\n-Denatúrált szesz\n\n-Nyers lenolaj: a magnéziumpor passziválásához \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543483308-nyerslenolaj.jpeg)\n\n -Lakkbenzin higító: a lenolaj feloldásához\n\n-Kukoricakeményitő:csak natúr és csak bioboltban vedd meg.Ebből lesz a dextrin lőpor granulálásához és csillagkészítéshe,házi gyújtózsinórhoz. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/kukoricakemenyito.jpg)\n\n-tiszta sodrott pamutzsinór 2mm: semmiképp sem viaszolt! (black match) gyújtózsínórhoz. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543483527-pamutzsunor2mm.jpg)\n\n-Sellak:a világosabbat vegyük meg ez csillagok ragasztásához szükséges.Oldószere a denatúrált szesz.\n\n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543483634-sellakivory.png) \n\n -Nitrocellulóz ragasztóanyag:Ha gond hogy tartalmazhat a denszesz minimális vizet akkor a másik legjobb az NC lakk amit pinponlapda és aceton segítségével készíthetünk el.Ha nem használunk fémport a dextrin is tökéletes ragasztóanyag.\n\nA további általános beszerzési forrásokról: itt olvashatsz\n\nDe a fent említett alapanyagakon kívűl másra igazából nemigen lesz szükséged. \n\n\n\n\n\n\n\n\n\n\n\n\n",
			"added": 1543481959,
			"parent_topic_uri": "1538011472_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1543483968,
			"title": "Making Potassium Chlorate KClO3",
			"body": "Making Potassium Chlorate KClO3",
			"added": 1543483959,
			"parent_topic_uri": "1589138631_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1543484518,
			"title": "Making Ba(NO3)2 Barium Nitrate and its properties",
			"body": "Making Ba(NO3)2 Barium Nitrate and its properties",
			"added": 1543484508,
			"parent_topic_uri": "1589138631_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1544294712,
			"title": "Lőporkészítés",
			"body": "",
			"added": 1544294701,
			"parent_topic_uri": "1538011472_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1557939518,
			"title": "Алюминий, его соединения и сплавы",
			"body": "",
			"added": 1557939506,
			"parent_topic_uri": "1541952939_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1562442902,
			"title": "Receptek Sufnipirotechnikusoknak (segítség,kérdések,egyéb a receptekkel kapcsolatban)",
			"body": "Receptek Sufnipirotechnikusoknak segítség,kérdések,egyéb a receptekkel kapcsolatban.\n\nWeboldalam: http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/\nMx5 Kevin\n\nEbben a topikban segítséget kaphatsz a receptek sufnipirotechnikusoknak oldalamon lévő receptekkel kapcsolatban.",
			"added": 1562442889,
			"parent_topic_uri": "1538011472_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		},
		{
			"topic_id": 1579921170,
			"title": "KClO3 Al S Flash Powder how to make the most possible safest way at home this unstable flash powder",
			"body": "Method for those who want to try or make this absolute unstable and friction sensitive potassium chlorate sulfur aluminum flash powder.To make it the possible safest way without igniting the composition from friction.",
			"added": 1579921156,
			"parent_topic_uri": "1589138653_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		}
	],
	"topic_vote": {
		"1538011472_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": 1,
		"1538015002_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": 1
	},
	"next_comment_id": 31,
	"comment": {
		"1540860703_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 1,
				"body": "Az ingyen anonim internet projekt.5éve már tökéletesen működik.\n\n[Ingyenes anonim internet wifivel,torral kellékek és beállítások](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1542497364_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/Ingyenes+anonim+internet+wifivel+torral+kell+kek+s+be+ll+t+sok)",
				"added": 1542497877
			},
			{
				"comment_id": 17,
				"body": "#Hogyan tegyük közzé biztonságosan pirotechnikával kapcsolatos munkánkat az interneten és vegyünk részt aktívan az ilyen téma iránt érdeklődő közösségekben (Kezdőknek)\n\nTöbb mint 10 éve foglalkozom amatőr pirotechnikával.Ez idő alatt alaposabban sikerült megfigyelni és tanulmányozni hogy is dolgozik a hatóság.És akik evvel a témával szeretnének foglalkozni azoknak szeretnék egyszerű án nagyon hatásos tippeket adni amivel biztosíthatják magukat az interneten a kéretlen adatgyűjtők ellen.Eddig még senkinél sehol nem tudok róla hogy valakit is megkerestek volna a hatóságok mert közzé tett pirotechnikai tartalmat.Akár milyen durva is volt az.Viszont akik evvel foglalkoznak azokat figyelik.Hogy kikkel tartanak kapcsolatokat.Figyelik az internetforgalmukat az internetszolgáltatójukon keresztül és lehallgatják hosszútávon a telefonjukat is!Pár egyszerű módszerrel viszont kibújhatunk az általános megfigyelés és visszakövetés veszélye alól nagyon hatékonyan.Úgy hogy aki minket fülön akar csípni az csak nagyon komoly felénk irányuló nyomozás árán tehesse csak ezt meg.Ez a pár alap dolog olyan hatékony védelmet biztosít a számunkra hogy saját tartalmunkat bátran közzétehetjük bárhol.És ez irányú közösségekben is bátran részt vehetünk.\n\n#Az általános megfigyelés hogy zajlik?\n\nElőször is hogy védekezni tudjunk a problémát kell legelőször megérteni.Hogy hogyan figyelik meg a felhasználókat és hogyan próbálják őket visszakövetni.A megfigyelés zajlik egyszer a mi internetszolgáltatónknál.Ugyan is itt megy át minden általunk adadat.Másodszor  annak a szolgáltatásnak az internetszolgáltatójánál amit mi használunk.Illetve közvetlen a szervernél is amit mi elérünk.\n\n#Ha valakit kiszemelnek az hogy próbálják visszakövetni?\n\nA meglévő internetes niknév után keresnek utána az illetőnek.Hogy más fórumokon helyeken megtalálható e az adott illető.Ki próbálják deríteni az IP címét.Email címeket konkrét személyhez köthető adatokat próbálnak szerezni.MSN,Facebook,Skype,Viber adatokat próbálnak szerezni.A szolgáltatások felöl az IP cím és az email cím érdekli őket.Ha a szolgáltatások felöl az IP cím és az email cím elakad.És a publikusan máshol általad közölt adatokból sem jutnak sehova a játéknak általában itt vége.Ezután ha van valami azt már te is kitudod szúrni!Ugyan is interneten megkeresnek.És ott mindig felmerül valami hozzád köthető dolog megadása!Tehát ha téged kispéciznek azt észre fogod innentől nyíltan venni!\nHogyan is kezd el ha kezdő vagy?\n\n#1.lépés identitásod védelme\n\nLegelőször is a leghatásosabb védelemre van szükséged ami elrejti az IP címed.És megakadályozza hogy a proxy gép IP címét logolhassa az internetszolgáltatód és a céloldal is.Valamint az internet szolgáltatód felöl ne lehessen olvasni hogy milyen oldalakon mész át (tehát titkosított legyen a forgalom).A böngésző ne szivárogtasson és gyűjtsön adatokat.Valamint a bejelentkezett fiókokon és a sütiken keresztül ne áruljon el proxin keresztül bennünket.A proxy és a VPN szolgáltató se tudjon kiadni bennünket.Ezt mind egyben tudja a [TOR](https://www.torproject.org/).Aki közzé akar tenni  tartalmat az ezt használja.Ez mindent elintéz profin a felhasználó helyett.E mögött bátran közzé tehetsz tartalmad.\n\n#2.lépés visszakövetés elleni védelem\n\nAz alap szabály egyszerű semmit ne adj ki magadról ami hozzád köthető.És helyezz el megtévesztő információkat.Létre kell hoznod először is egy olyan niknevet és identitást amit még sehol nem használtál.Külön a célra fentartott megbízható email fiókkal.Ha valahol van regisztrált email fiókod ez nagyon fontos hogy ezt teljesen más szolgáltatásnál hozd létre.Ezeket mind a TOR hálózaton keresztül kell elérned.És ezekben soha semmilyen személyes hozzád köthető adatot nem szabad megadni.Azokat az oldalakat ahol regisztrálva vagy ne látogasd TOR nélkül.Nagyon fontos hogy ezeket az oldalakat ne látogasd TOR nélkül.Azért ne mert hogy mi érdekez téged így nyomon követhető.Minden egyes meglátogatott oldalról és küldött parancsról részletes logot készítenek a szerverek!És ha tor nélkül látogatod meg őket identitásodat semmi sem védi!Ha veszel valami egyedit és visszakövethetőt soha neáruld el pontosan hol vetted!Hazudj helyette egy teljesen más helyet!Véletlen se hivatkozz megyére vonatkozóan sem merre lakhatsz.Sőt ez irányban direkt tegyél közzé szándékosan megtévesztő információkat.Ha valaki meg keres és ír neked és személyes hozzád köthető dolgokat vet fel ott biztos hogy szaglásznak utánad.A te nevedhez köthető fiókokat soha ne használd semmilyen piromán közösségi tevékenységre!\n\n#3.lépés az Email fiók létrehozása\n\nEz azért kell mert ha fórumokra és szolgáltatásokra szeretnél regisztrálni azok fognak kérni egy email címet.Amire levelet küldenek és ebben a levélben van egy link amire rá kell kattintanod hogy érvényesítsd a regisztrációdat.Ugyan vannak eldobható email címet kínáló szolgáltatások csak itt ha nem megfelelően kezeli a levelet búcsút mondhatsz a fiókodnak.A szolgáltatások felöl kiszűrhetőek és később nem tudod velük a fiókodat sem helyreállítani.Régen ez nagyon egyszerű volt mára viszont nagyon bonyolulttá vált.Régen TORON keresztül létrehoztál egy fiókot és működött.Ma már a nagyobb szolgáltatók túl sok személyes adatot kötelezően kérnek.Ilyen a telefonszám és a másodlagos email kötelező megadása.Ezért ma már kötelező őket tesztelni előzőleg egy teszt accountal.A nagy szolgáltatókat mint a Google Gmail,Yahoo,Protonmail,Microsoft messze el kell kerülni.Ide egy kisebb szolgáltatást kell keresni ami nem könnyű.Ez semiképp se a mi országunkban legyen!\n\nEzt hogyan csináljam?\n\n1.Először is rakd Fel a [TOR BROWSERT](https://www.torproject.org/).Másodszor kell keresni kisebb de megbítható email szolgáltatásokat másik országokból.Ezeken először soha ne a kiválasztott nikneven regisztrálj hanem hozz létre egy teszt fiókot majd egy ideig csak teszteljed.Ha működik töröld a teszt fiókot majd ezután regisztrálj a választott niknévvel.Ez alatt ki ismered a fiók adottságait.És ha bármi van nem veszik el a választott nikneved sem.\n\nMit kell figyelnem?\n\n-Hogy kér e valamilyen módon telefonszámot.SMS hanghívás ha van ilyen funkció már messze kerüld el a szolgáltatást.\n-A TOR nál a változó IP címre reagál e a regisztrációnál és a belépésnél.\n-Másik email cím kötelező megadását mennyire tartja fontosnak. És hogy a szolgáltatásnál van e bármi utalás arra ha úgymond nem elveszti a jelszót hanem nem tudjuk azonosítani és biztonségi okokból nem engedjük be az illetőt.\n-Kéretlen Spamek figyeljünk arra hogy megjelennek e tömegével kéretlen spamak.\n\nHa a szolgáltatás szórakozik veled még az elején keress másikat!Ezek úgy működnek egy apró dolgot akár átálítanak.Hogy kikényszerítsenek belőled egy telefonszámot vagy másik email címet.Amin keresztül tovább szimatolhatnak.Vagy egyszerűen rendszeresen változó IP címmel nem engednek van.Azon szolgáltatásokat amelyek ezt az irányvonalat követik messze el kell kerülni!\n\nEzután már regisztrálhatsz különböző szolgáltatásokra.Fórumok,videómegosztók,és más közösségi oldalak.Ezeket mindig amikor belépsz TORON keresztül használd.\n\nJelszavaid és kényes dolgaid egy titkosított fileban tárold.Erre egy egyszerű lehetőség egy jelszóval ellátott .rar fájl ehhez [winrar](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/Winrar%205.40%20x86%20x64%20hun%20Magyar+registration%20key.zip) programot ajánlom.Itt amire figyeljünk hogy a fájl titkosítva legyen!Másik hasonló megoldás a [VeraCrypt](https://www.veracrypt.fr/en/Downloads.html).",
				"added": 1564418879
			},
			{
				"comment_id": 19,
				"body": "Az interneten közzétett pirotechnikai tartalom  végett eddig még tudomásom szerint soha senkit nem vettek elő.Itthon  és külföldön sem.Amikor gond volt és hatósági ügy lett valamiből az mindig terepen történt.Személy szerint az interneten nekem csak adat és információgyűjtésről van tudomásom.Internetes dolgokkal azokat sem zaklatták soha akik a nevüket adták hozzá.És konkrétan beazonosíthatóak voltak.\n\nA leg fontosabb a hatóság akkor ugrik rád amikor biztosra veszik hogy amikor mennek akkor ott nálad fognak találni valamit.Tehát a jelen időben tele vagyok most éppen lőporral,házi készítésű tűzijátékokkal,vagy lehallgatható csatornákon ismerősökkel megbeszélni most van nekem,mikor megyünk dolgokat mind kerülni kell.Itt a lényeg a jelen időben történő tetten érés a gondok igazából ebből adódtak.\n\nA leg gyakoribb buktatókat le írnám amiből a legtöbb baj volt:\n\n-Pirotechnikai eszközök használata folyamán a biztonság: Soha ne gyújts meg ilyen eszközt kézben!Házi készítésű eszközök esetén mérd fel a hibalehetőségeket hogy ne érhessen baleset.Ha veszélyes hibalehetőséget találsz abban amit csinálsz ne kockáztass!Főleg a begyújtásnál légy teljesen biztos hogy az időzítés biztonságos és nem gyújt előbb!\n\n-Otthon való tesztelés: Ami átrepülhet a szomszédba figyelemfelkető vagy túl hangos ne használd otthon.Több baj is volt belőle.Ne tesztelj otthon vagy használj ilyesmit lakott területen!\n\n-Mélyen vidd le az erdőbe mezőre  a dolgokat:Ne használj ilyesmit út melett lakott területhez közel.Vidd le minél mélyebben ezeket a dolgokat az erdőbe 1km re minimum.Voltak olyan gondok valaki pl fő út mellett lőtte és lekapcsolták.\n\n-Ne dicsekedj a hobbiddal senkinek: Voltak akik úgy buktak meg hogy haveroknak,ismerősöknek dicsekettek vele a hír gyorsan elterjedt és lebuktak.\n\n-Internetes problémák:Saját tapasztalat.E-mail,Facebook,MSN,Skype vegyél tőle vagy adjál el neki,ha valami lenyomozhatóbb fórrású dolog érdeklődhetnek te konkrétan hol vetted milyen úton vetted,személyes találkozókra való törekvés erre nagyon rá vannak állva.A hatóság saját tapasztalat alapján is nagyon rá van állva hogy ezekkel a módszerekkel privátban konkrét személyhez köthető információkhoz jusson.Ha egy másik lehallgatott tagtól nem jutnak hozzá,és van egy E-mail cím amin te pl folyton Torral lépsz be téged megkeres egyszerűen E-mailben vagy a legközelebbi módon amin téged elér nálam sok ilyen eset volt.Személyes tapasztalat hogy a hatóságok is ilyen módon nem csak passzívan figyelnek de aktívan is megkeresik és információkat próbálnak kiszedni ilyen módon az evvel foglalkozó emberektől.Konrét tudomásom van róla és egyértelmű bizonyítékom is van róla személy szerint aki ért hozzá annak a telefonját internetforgalmát hosszú távon lehallgatják.Egy közismert nyilvános eset pl amikor a Bonyhádi meteor esetnél küldtek egymásnak képeket arról a helyszinről amin a dolog történt és ezt a hatóság a szolgáltató fellöl elcsípte.Nyilvános internetes publikállás esetén megfelelő VPN vagy Tor védelem esetén jelenleg egy hazai vagy külföldi esetről sem tudok hogy valaki ilyenen megbukott és ezért kopogtattak nála.Megfelelő internetes védelemmel a jól bevált nyilvános csatornákon amit a többi piromániás is használ fórumok,videómegosztók stb én azt tapasztaltam bátran részt lehet venni.Viszont VPN,Tor nélkül ezeket nem szabad használni.Illetve olyan E-mail fiókról amiben bármi személyes adatod szerepel,direktben a te saját internetelőfizetésedről regisztráltál és használlod nem szabad ilyesmire ilyen célra regisztrálni.",
				"added": 1565047898
			},
			{
				"comment_id": 20,
				"body": "#Hogyan tegyük közzé biztonságosan pirotechnikával kapcsolatos munkánkat az interneten és vegyünk részt aktívan az ilyen téma iránt érdeklődő közösségekben (Haladóknak és Profiknak)\n\nEz a fajta biztonság egy átlag pirománnak aki a saját munkáját teszi közzé teljesen felesleges.Az előzőleg ismertetett megoldással kell kombinálni a módszert.\n\n#1.Az internetes forgalom védelme (Tor+Tőled független Wifi)\n\nA TOR hálózatról már írtam a kombinak ez az egyik eleme.A másik egy olyan wifi hálózat ami tőled független.És csak pirotechnikai célra használod.A maximális védelem fontos része hogy ezen a hálózaton soha ne lépj be semmi olyasmibe ami hozzád köthető.A védelmet fokozni lehet ha több wifi hálózathoz is hozzáférsz.És ezeket időszakosan cserélgeted.Ugyan is ez hatalmas mértékben csökkenti annak az esélyét hogy fixen az internet szolgáltató felöl téged lehallgassanak.És hogy a hálózaton dokumentálják más fiókok által az internetszolgáltatón keresztül a forgalmad lehallgatva a valódi identitásod.A feltétel csupán annyi hogy a környékeden legyen sok fokható wifi hálózat.Nem számít hogy kódoltak.\n\nBővebben erről itt olvashatsz: [Ingyenes anonim internet wifivel,torral kellékek és beállítások](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1542497364_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/Ingyenes+anonim+internet+wifivel+torral+kell+kek+s+be+ll+t+sok)\n\nAz anonimitás mellett ha erre befektetsz megszabadulsz az internet költségektől is végleg.Ugyan olyan interneted lesz mintha fizetnél érte.És a legjobb előfizetésekhez tartozó sávszélt ingyen használhatod.Egyszeri befektetés után nincsenek vele plusz költségek.Itt egy alhálózaton vagy amibe az internetszolgáltató sem lát bele.Ezeket a hálózatokat észrevétlenül tudod használni.Semmi jele nem lesz hogy te ott tartózkodsz.Ahogy a routert kihúzzák a konnektorból ott minden log törlődik.\n\nMi kell hozzá?\n\nEgy USB wifi adapter cserélhető antennával.Vagy ha van laptopod annak a beépített wifijével is biztonságosan lehet próbálkozni.USB adapter terén a chipsetet kell nézni hogy a Linux alatt futó törő programokkal kompatibilis legyen.Ehhez kell egy 8 decibel feletti 30cm hosszú bot szobaantenna.És 5 m erősítős USB hosszabító kábel.5méter felet egy 5V 2A adapter kell ami biztosítja a stabil áramfelvételt.5m felett csak olyan kábelt szabad megvenni amihez csatlakoztatható ilyen konnektorba dugható adapter.Ezt az eszközt a szobában vagy a házban mindig a legmagasabb pontra kell helyezni.A szobában lévő szekrényre helyezve illetve a padlásra víve nem összehasonlítható a befogható hálózatok mennyísége.És a távolság sem hogy milyen messziről használhatóak ezek a hálózatok.A leg olcsóbb felszarelés 1 havi internetelőfizetés árából kihozható.Evvel padláson nem csak a te utcádban lévő adókat hanem a környező utcákban lévő adókat is tudod fogni.Az usb adapter terén érdemes inkább a neten megvenni egy nagyobb kimeneti teljesítményű távoli kapcsolatokra tervezett USB adapert.Én az Alfát ajánlom ezen belül az ALFA AWUS036NHA adptert.Ezeknél hogy a szabványoknál b,g,n a vételi érzékenység -dbm ben minél nagyobb legyen nagyon fontos!És a kimeneti teljesítmény 1W felett legyen.Vagy ha gyengébb kell amit itthon a szaküzletekben is könnyen megkapsz akkor a TP-LINK TL-WN7200ND adaptert ajánlom.Mindkét adapter kompatibilis minden féle törő programmal linux alatt.ezeket szoftveresen a számítógép kezeli.Tehát egy teljes rendszer titkosítás esetén.A titkosítás feloldása nélkül ezek semmit nem árulnak el.Még azt sem hogy akár valaha is az használva volt.\n\nA beállítás\n\nA számítógép MAC címét változtasd meg ehhez vannak különböző szoftverek.Linux rendszerek alatt tetszőlegesen megteheted.Windows 7 felett a 2. karakter 2,6,A,E legyen és tetszőlegesen változtathatod különben nem fog működni.Itt olyan MAC címet adj meg ami nem feltűnő.pl  0A:00:00:00:00:00.Teljes merevlemez titkosítás mellet nem nyerhető ki a megváltoztatott MAC cím.\nA számitógép NET BIOS Számítógép nevét változtasd meg valami nem feltűnőre legyen ez pl Router.\nA TCP/IP protokollnál az IP címet,alhálózati maszkot,Alapértelmezett átjárót,DNS kiszolgállót mindig kézzel állítsd be és soha ne DHCP-n keresztül kérd le.Így ki tudod kerülni hogy a routerben DHCP log készüljön rólad!\n\n#2.A számítógéped védelme (Teljes merevlemez titkosítás,Atatok fellülírása,Titkosított fájlok)\nElőször is a teljes merevlemez titkosítása nélkül minden a számitógép védelmében elkövetett intézkedés csak másodlagos.Ha feltört wifit használsz ez a védelem nélkülözhetetlen!Ez megvédi a számítógépet hogy a hamisított MAC cím a feltört hálózatok satöbbi kinyerhető legyen a számitógépről.Itt figyelni kell hogy olyan programot válasszunk ami a titkosítás folyamán felül is írja a szabad merevlemezt!Ezt úgynevezett data recovery programokkal teszteljük!Illetve live rendszerekkel amik pendriveról,DVDről CD ről bootolhatóak telepítés nélkül.Ezen felül szükségünk lesz egy második védelmi vonalra titkosított fájlokra és kötetekre amikben dolgozunk és az adatainkat tároljuk.Soha semmi személyes adatot ne tároljunk e nélkül a másodlagos védelem nélkül.Tárolásra ajánlom a winrart.Amiben dolgozhatunk titkosított kötetetnek meg ott van Pl a VeraCrypt.Ezekből könnyebb eltüntetni a dolgokat mintha az egész gépet kéne fellülírni.Programok tárolhatnak máshol a gépen kényes dolgokat mint a TEMP mappa.Működés közben de evvel a megoldással gond nélkül dolgozhat mindenki.A kulcs a titkosítás és nem a jelszó!Ugyan is le lehet jelszavazni az operációs rendszert de az semmit sem ér!\n\nA másik fontos dolog az adatok fellülírása.Ugyan is a merevlemez és a hasonló tárolók úgy működnek hogy csak az ikonok törlődnek.Az adat ott marad rajtuk.És csupán fellülírhatóvá válik más adat által.Egy számítógép újratelepítés gyakorlatilag semmit nem tüntet el!Ahogy egy lemez formázás sem!Window alatt ott van pl az eraser.Olyan program kell ami fájlokat is képes felülírni meg a lemezen lévő szabad helyet is!Ezt szintén tesztelni kell data recovery programokkal.\n\nHa elakarunk valamit menteni biztonsági másolatokhoz ajánlom a jól eldugható adatárolókat.Pl a kis SD kártyákat vagy pendriveokat.\n\n#3.Az identitásod védelme az interneten\n\nA dezinformáció itt különösen fontos.Főleg magadról híntsél el félrevezető információkat.leginkább lakhely és más személyes információk kapcsán!Ha valahol piróra létrehoztál egy niknevet azt csak arra használd!Ajánlom különböző eldobható emailcímek használatát.A TOR az nélkülözhetetlen minden ilyen netes tevékenységhez!Használj máshoz más email címet.Ha  nagyon profik vagytok ott van az írásmódváltoztatás.Érdemes mások írását megfigyelni és akár utánozni.Elkövetni azokat a hibákat az írásban mint más vagy mások.Esetleg valaki stílusát felvenni.Teljesen más stílust használni.\n\nVannak ugyan virtuális rendszerek mint a virtualbox,live linux rendszerek amikel külső meghajtóról lehet használni,extra védelmek mint a sandboxi.De ezek már túl bonyolultak és sok velük a probléma.A fent említett megoldás meg szinte mindenkinek elérhető.Ezzel a megoldással egy házkutatás esetén ha lefoglalják a számitógéped is védve vagy!",
				"added": 1565285817
			}
		],
		"1542497364_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 2,
				"body": "Pár dolog a wifi adapterről ilyen célra:mindig cserélhető antennás wifi adptert vegyünk,az adapter vételi érzékenysége sensitivity nagyon fontos hogy külön -dBm ben minél érzékenyebb legyen ez lehetőleg jóval külön szabványonként b,g,n vételi érzékrnység -90dBm fölött legyen.A vételi érzékenység befolyásolja hogy te hogy látod a hálózatokat.A chipsetet kell nézni hogy hackeléshez jó legyen mert több márka is azonos chipsetet használl és ahhoz sok esetben ugyan az a driver kell.Ha friss driver kell hozzá megnézed milyen chipset és a chipset gyártójától tudsz hozzá szerezni drivert.A kimeneti teljesitmény nagyon fontos ilyen távoli kapcsolatoknál mert minden wifis eszköz egy adó/vevő és neked ahonnan veszed a jelet arra az adóra visszafelé az adó irányában neked is stabilan kommunikálnod kell.Ezért én speciálissan ilyen célra távoli wifi kapcsolatokhoz tervezett wifi adaptereket ajánlok 500-2000mW (mW miliwatt) (2W) kimeneti teljesítmény között.2W az 33dDm usb 2.0 ról maximum ennyit lehet levenni.Márka csak márkás adaptereket ajánlok pl az Alfa network adapterei ez sorba is rakják az oldalon melyik a legujabb.Kínai nevenincs adaptereket senki ne vegyen!Pl az alfa AWUS036NHV nak szuper jó a vételi érzékenysége 11b: -96dBm,11g: -92dBm,11n: -91dBm és stabil is. De hasonló az Alfa AWUS036NHR is.Ez fórumokon megtalálni melyek a jó termékek.Nekem még régebbi kicsit gyengébb vevővel ellátott Alfa AWUS036NH van de hackeléshez használathoz atom biztos választás.Érdemes pl E-bayről európai forgalmazótol megvenni pl e-bayen a Rokland ilyen forgalmazó olcsóbb mint másodkézből.Ezeket hosszabbítani mindig USB fellől lehet usb hosszabitó kábellel.Ebben kell hogy középen legyen egy jelerősítő,a kábel árnyékolt legyen tehát ami egy fémhálóval van leárnyékolva,és 10m nél hoszabb kábeleknél már kelleni fog a másik végénél is az energiaellátás.Ezt úgy tudjuk megoldani ha nincs a kábelnek saját áramellátása akkor veszünk egy 4 portos 2000mA 2A külső usb elosztót külső áramforrással.Itt csak olyat vegyünk ami portonként képes leadni az 500mA usb 2.0 esetén stabilan.Az USB kábel feltételei,mindenképp árnyékolt legyen,hoszabb kábeleknél a kábel felénél kell hogy egy jelerősítő legyen benne,a kábel legvégén az eszköz stabilan feltudja venni az 500mA-es árramot.Az USB UTP átalakítókat senkinek nem ajánlom mert a UTP kábel se nem árnyékolt se nem erősítős csakis profi ilyen célra gyártott kábeleket ajánlok.Ezt persze rendelni kell mert számtech boltokban nincsen.Antenna fellől mindig minél rövidebben kössük össze a lehető legkisebb veszteségű kábellel.Különben túl nagy nagy lesz az antenna és az eszköz között a decibelben mért veszteség és vagy rosszúl működik,vagy sokkal roszabbúl működik vagy nem működik.Ha mégis antenna fellől kell hosszabítani használjunk low loss antenna extension árnyékolt vastag kábelt ha végképp nincs más megoldás de 3dbi veszteség fölé sose menjünk.Én ezt csak akkor alkalmaznám pl ha az antenna kültéren van és azt akarom hogy az adapter a tető alatt legyen.A használatos antenna ilyen célra minimum egy 30 centis 8 decibeles TP-link bot antenna ez mégegyszer olyan hosszú és mégegyszer olyan erős mint a hagyományos 5 decibeles antenna.",
				"added": 1542498087
			},
			{
				"comment_id": 3,
				"body": "Aki wifi lopáshoz akar eszközt venni pár dolog amivel nagyon kell vigyázni.Aki általa feltört wifi hálózatot akar használni a legjobb eszköz egy cserélhető antennás USB adapter teljes merevlemez titkosítással ellátott számitógép,illetve laptophoz használva.Acces point,range extender,router ezeket én azt tanácsolom aki wifit lop messze kerülje el.Ezekkel a következő komoly gondok vannak:\n\n-A gondok:\n\n-Ahogy bedugod látszik a hamisított MAC cím:Ezeknél az eszközöknél ahogy bedugod elindul a rendszer és egyől látszik az szoftveresen generált hamis MAC cím.(teljes merevlemez titkosítással ellátott laptop,vagy USB adapterrel használt szintén teljes merevlemez titkosítással ellátott számítógép esetén a probléma nem áll fent mert a szoftveresen generált hamis MAC címa titkosítás feloldása nélkül a számitógép elinditása esetén nem nyerhető ki).Készenléti állapotban lévő mobiltelefonoknál a probléma szintén fent áll ilyen esetben a titkosítás ellenére is megszerezhető a hamis MAC cím.\n\n-Látszik kikhez akarna kapcsolódni a teljes lista:tesztelés aircrack program itt az összes hálózatot kilistázza amit az eszköz elmentett.Védekezés ellene a régi hálózatokat amit nem használlunk mindig töröljük ki az eszközből.Minden eszköz valahova elmenti az adott hálózatokat amihez kapcsolódunk ezt soha semmilyen eszköznél ne hagyjuk benne mert a rádióhullámokkal ezt lehet látni a listát ami elvan nekünk mentve.Itt konkrétan sorba kiírja az elmentett hálózatok nevét.Főleg készenléti állapotban lévő mobil telefonoknál ezt szépen lehet látni.(ez a probléma kivétel nélkül minden wifis eszköznél fennál aminél aktív a wifi.Ehhez annyi kell hogy aktív legyen a wifi és nem kell semmilyen hálózathoz kapcsolódnia). És ezt az első két hibát ki is emelném mert teljesen kikapcsolt majd elindított konnektorba dugástól (router,acces point range extender)ezen adatok kinyerhetők.Ez annyit tesz egy házkutatás esetén egy szakértő elindítja az eszközt és annélkül hogy hozzáférne a menüjéhez hogy az pontossan milyen SSID jű tehát minek elnevezett eszközök vannak benne elmentve illetve a hamisított MAC cím kinyerhető.És itt igazából vége is a játéknak.Teljesen kikapcsolt majd bekapcsolt teljes HDD titkosítással ellátott,laptop,PC esetén aminél egy USB adaptert használlunk egy esetlegesen haditechnikai erősségű titkosítás feloldása nélkül ez kinyerhetetlen!).\n\n-Nem titkosított a rendszer és szoftveresen minden az eszközön történik -Egyik rendszerből sok esetben át lehet lépni a másikba:tesztelés ha routert,acces pointot,range extendert használsz ezt wifin kapcsold a routerre amiről lopod a neted és erről próbáld meg elérni az admin felületét a te eszközödnek.Másik teszt a te eszközödre kapcsolj egy eszközt és a te eszközöd IP címtartományát kézzel beállítva kapcsolódj a routerre amiről lopod a neted ha azt a gépet is látod ami a te eszközöd mögött van akkor gond van mert a két hálózat ilyen esetben nem különül el és egyik rendszerből ilyen esetben hozzá lehet férni a másikhoz.(ilyen esetben ez ellen igazából nem lehet védekezni de sokat segít ha a másik eszköz egy teljesen más IP cím tartományt használl). Egy USB wifi adapter,vagy egy beépített laptop wifije azért nagyon jó mert ha egyszer kikapcsolod és azt elindítják ezen eszközök csak egyszerű adó vevők és szoftveresen mindent a laptop vagy PC kezel és ha ez le van titkosítva gyakorlatilag semmi adat nem nyerhető ki belőle (számitógépnév,hamis MAC cím,és a rajta tárolt adatok információk.Ez tesztelhető pl külső Linux CD ről való bootolással aminél az operációs rendszer telepítés nélkül futtatható,törölt fájlok helyreállítását segítő merevlemez szkennelő programokkal.",
				"added": 1542498102
			},
			{
				"comment_id": 4,
				"body": "Amire főként oda kell figyelni egy ilyen feltört wifi hálózaton: Számítógép MAC címe,Számítógépnév (DHCP kérés esetén a lényeges igazán),és az átmenő adat (utóbbi hozzáértő kezekben).Amik hajlamosak logolni: DHCP itt kézi beállítással megelőzhető a DHCP kérés.UnPnP ez egy protokoll ami a router felé üzenetet küld hogy nyisson portot ennek és ennek a programnak,ez programokban kikapcsolható vagy tűzfallal blokkolható.Az UnPnP olyan programoknál van ami kivülről fogad bejövő kapcsolatot (játékszerverek,VoiP telfon,torrent,stb).Sajnos az UnPnP tartós logot hagyhat a routerben ha fut ilyen program sok esetben a routeren bellül látjuk.Amire még kell figyelni bizonyos operációs rendszerek engedélyeznek fájlmegosztást wifin erre figyeljünk oda.Bizonyos Windowsoknál vagy bizonyos kártyáknál Windowsnál gyárilag wifinél ha nem megy másképp a MAC spoofing funkció mert tiltva van ekkor ha a MAC cím második karakterérét 2,6,A,E re változtatjuk ez működik.Ha pontos MAC címet akarunk megadni és ha az operációs rendszer,vagy a kártya drivere nem engedi ezt a funkciót másik megoldás ha semmi nem segít a Linux rendszer.",
				"added": 1542498122
			},
			{
				"comment_id": 5,
				"body": "Router,Access point,Range extender,ezekben egy saját titkosítatlan felület az eszköz belső szoftverében kezeli a wifis dolgokat.Ez annyit jelent hogy minden kinyerhető belőle és ha valakinek az a céjla hogy feltört hálózatokhoz használja olyan célra kifejezetten messze elkerülendőek!Sőt ha ezeket áram alá helyezem a kezelőfelület elérése nélkül távolbol is kiolvasható milyen hálózatok nevei vannak elmentve a készülékben.Pluszban ahogy aktív állapotba kerül a router vagy az AP azonnal kiolvasható belőle a hamisított MAC cím pusztán a kisugárzott rádióhullámokkal.Tehát csak árom alá kell helyezni ha lefoglalják és már le is buktál.A készülékkel ezen fellül semmit nem kell csinálni.Az aircrack pl ezt szépen kimutatja.Mobiltelefon esetén ez a jelenség kölönössen érvényes mert amíg be van kapcsolva ha le is van titkosítva távolról is kiolvasható milyen hálózatnevek vannak benne elmentve,a hamisított Mac cím úgyszintén.Ez akkor jelent problémát ha elviszik AP,Router esetén bedugják mobil telefon esetén meg aktív állapotban van.Erről bővebben egy másik videó hozzászólásaiban írok.USB adapterrel ezek a dolgok a számítógépen tőrténnek.USB adapter esetén az adapterben semilyen szoftveres dolog nincsen.Ha a számítógépet teljes merevlemez titkosítással látjuk el USB adapter esetén a titkosítás feloldása nélkül semmilyen fontos információhoz nem lehet hozzáférni ha a gép kikapcsolt állapotba kerül.Tehát ha átírod a MAC címet,a Net bios számítógép névre odafigyelsz,letitkosítod a teljes merevlemezt,akkor van egy USB adaptered.Ezenfelül van egy számítógéped aminél ha a merevlemez feloldása nélkül csinál valaki bármit az eredeti MAC cím nyerhető csak ki ami semilyen hálózaton nem dokumentálható.Tehát ha be is mérnék majd le is foglalnák az eszközt a titkosítás felodása nélkül gyakorlatilag az látszik hogy egy olyan számítógép van náluk ami az adott hálózatokhoz soha nem kapcsolódottHa ez az internet úgy van lopva akkor a kapcsolódási paramétereket Tilos a routertől DHCP-n lekérni kézzel kell beállítani különben logol a DHCP rész, ha azon kéri le a Reutertől a gép a kapcsolódási adatokat (IP,Alh maszk,Alap ért átj,DNS-kiszolg).A 2 azonosítója wifin a gépnek Gépnév és a MAC cím! MAC cím esetén hasonlót kell megadni mint ami a routert használó eszközöké Pl megcserélsz egy betűt ez az eszköz a router is lehet gépnévnél ugyanígy hogy ne lehessen kiszúrni az idegen eszközt.",
				"added": 1542498337
			},
			{
				"comment_id": 6,
				"body": "Akinek gondjai vannak az átvitellel  pár beállítás routerek esetén ami főleg távolabbról drasztikusan befojásolja az átvitel minőségét (szakadozik,lassan tölt,eljön a jel de pl nincs normális internet,ingadozó sávszél) ezt nagy mértékben lehet orvosolni a következő beállításokkal a routerben:    -Mode: kevert B,G,N a legjobb, -Power level: maximunra a legjobb ez a kisugárzott rádióteljesítmény, -Country:Ez olyan országra ahol nagyobb rádióteljesítményt engedélyeznek, -channel width: alacsonyabb érték MHz ideálisabb, -RTS threshold :Ezt rossz jel esetén csökkenteni kell,Tx/rx rate:150 és 300Mbps router esetén 50Mbps limittel volt a legjobb, -Beacon Interval:Szintén csökkenteni kell rossz jel esetén (100 ról 50 tökéletes volt), -Fragmentation Threshold:Szintén csökkenteni kell rossz jel esetén.N es router esetén a csökkentendő értékeket alapérték felére le kell vinni.Ennek amikor netezel a kapcsolat minőségére csak jótékony hatása van.Egy 2 es jelerőségű routernél fél kilométer távolról aminél alig töltötte az oldalakat sőt volt hogy betölteni sem tudta kapcsolódott de volt hogy a routert sem látta most akkorát lehetett rajta javítani csak ezzel a beállítással hogy pontosan ugyan olyan az internet/átvitel minősége mint a router közelében.Letöltés 1500KB/s Feltöltés 150KB/s teljesen stabilan.A trükk lényege hogy nagy teljesítményű csatornán jóval kisebb sávszélűre lett levíve a forgalom  így 2 es jelnél is ugyan olyan stabil mint 4 es 5 ös esetén minden.﻿ Amit én tapasztaltam, Különböző pontokon különböző adók jönnek. Az adók elhelyezkedését terepakadályok végett én nem tudom befolyásolni de a vevőjét igen hogy magasra viszem, ezeket szinte centire kell belőni ahol legerősebb a jel.Ha másik adót akarok máshova kell vinni nem elég elforgatni,megvan mi hol jön.Egy 5dbi(től!) 8dbi-s és egy 24 dbi-s antenna ugyan azokat az adókat látja de az átvitel minősége,stabilitás nem összemérhető és egy ponton többet lát ugyanazon adókból sokkal stabilabban.﻿A vételi minőséget nagyon fontos hogy az antenna elhelyezése nagy mértékben befojásolja.A másik fontos dolog az antenna nyeresége.A harmadik amire nagyon érzékeny hogy az eszközt minél rövidebben,minél kevesebb toldozgatással és minél kisebb veszteségű kábellel kössük az antennához.Ez az utóbbi ha nem megfelelően van az eszköz az antennával összekötve vagy nem megfelelően fog működni vagy az egész nem fog működni!Az eszköz és az antenna közötti hosszabitást épp ezért ha lehet kerülni kell.Ha viszont ez elkerülhetetlen úgynevezett low loss antenna vastag  decibelben minél kisebb veszteségű kábelt kell alkalmazni.",
				"added": 1542498366
			},
			{
				"comment_id": 21,
				"body": "Ajánlom még a témában az [Identitásvédelem](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1540860703_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV/Identit+sv+delem) topikot.\n\n[Wifi törő programcsomag](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/Wifi%20toro%20programcsomag.zip) itt tölthető le.",
				"added": 1565286170
			},
			{
				"comment_id": 28,
				"body": "#Wifi feltörés,ingyenes anonim internet összeállítás,részletek 2020.Amit nem írhattam le sehol a nyílt weben nyíltan!Csak az alkotó pirotechnikai közösségnek!Ingyenes internet igazi vérbeli hardcore piromán csibészeknek!\n\nAmatőr pirotechnikához biztonsági szempontból ez felesleges.De mivel az amatőr pirotechnika egy kreatív hobbi igazából aki evvel foglalkozik annak ez nem jelenthet gondot.És kiváló eszköz hogy letűnj vele a megfigyelési radarról.És hogy szabadon azt csinálj az interneten amit csak akarsz.És semmilyen jogrend vagy hatóság ne tudjon az utatba állni!Ezt máshol és más nyelven nem írom le,ennek a közösségnek legyen meg.Nem érdekem hogy széles körben ismerjék.A lényege igazából hogy pénzt spórolhatsz vele és az internetet is sokkal kötetlenebbül használhatod.Tudnod kell hogy nyílt  nyilvános hálózatokról amiket erre a célra állítottak fel legálisan wifizhetsz.Csak hát ez keveseknek elérhető,viszont ha feltöröd és lopod az már sokaknak elérhető!\n\n#Hogyan működik?:\n\nUgyan úgy mint a beszéd és a hallás.Minden wifi eszköz beszél és hall is egyben.Ha nagy a zaj mert mások is beszélnek akkor nem hallod úgy a dolgokat.Ha vannak terepakadályok azok felfogják a hangot.A fül itt az antenna az egyik leg fontosabb.A fül érzékelői itt az adapter itt fontos hogy ez milyen érzékeny.A száj itt az adapter kimeneti teljesítménye.Ha a két eszköz között nem működik a beszéd és a hallás kölcsönösen akkor nem működik az átvitel.Ami hang nem jön el a füledig stabilan nyilván azt semmilyen mód nem tudod hallani.Először is elmondanám hogy szar barkács antennákkal és szar barkács kábelekkel én nem dolgozom és te se tedd!Vedd meg a minőségi eszközt!A wifi mindenütt ott van kis falvakban kisvárosokban rengeteg van.Ahol sok hálózatot látsz ott mindenütt működik a módszer.Semmit nem jelent az hogy ezek kódoltak lassan több mint a 3/4 ét fel tudod törni.És az évek alatt egyre többhöz fogsz hozzáférni!\n\n#Tapasztalat\n\n10 éve kezdtem bele az ingyen anonim internet projektbe.Hogy megéri e?A válasz határozottan igen!Amatőr pirotechnikusoknak bátran ajánlom.Hogy miért:Mert havonta megspórolod az internet költségeit,a felszerelés tartós nincsenek plusz költségek,minden féle internetszolgáltatást ingyen használhatsz,magas szintű anonimitást biztosít,elkülönített internetszolgáltatásokon turpiskodhatsz és intézheted a hivatalos ügyeidet így nem köthetnek össze a valós identitásoddal,a szolgáltató nem lát bele az alhálózatba,a számítógéped minden azonosítója maszkolható,ugyan olyan az internet mintha előfizetnél,hosszútávú beruházás,még egyszer akkora anonimitást ad TOR mellé.Az általad látható hálózatok 3/4 ét fel tudod törni.Ami erős jellel jön és neki látsz szinte mindegyikkel azt lehet mondani hogy előbb utóbb sikerrel fogsz járni.Egy idő után már a feltörés nem is fog érdekelni ugyan is annyi hálózatból tudsz majd válogatni hogy nem fog igazán számítani.És az új feltört hálózatok lassan szinte maguktól az öledbe hullanak.És nincsenek költséget hogy ez az tönkremegy mert ezek az eszközök bírják a gyűrődést.Az USB wifi adapterek olcsók.\n\n#Hozzávalók\n\n Megfelelő chipsetű adapter:Atheros AR9271,Ralink RT3070,Ralink RT3572,Realtek 8187L (Wireless G adapters),Realtek RTL8812AU,RT5370N \n\nWifi adapter: Cserélhető antennás legyen,fontos a vételi érzékenysége,fontos a kimeneti teljesítmény,hackeléshez nagyon fontos a chipset,mindenképp USB adapter legyen!Nem a márka a lényeg hanem a chipset hackeléshez!\nKönnyen beszerezhető cserélhető antennás kis teljesítményű  adapterek:TP-Link TL-WN7200ND (Ralink RT 3070 chipsettel) a legjobb ez a boltban megvásárolható legjobb adapter. TP-LINK TL-WN722N Realtek RTL8188EUS chipsettel.\n\nProfi hosszútávú kapcsolatra tervezett magasabb vételi érzékenységű és kimeneti teljesítményű adapterek: Alfa AWUS036NHA a legjobb választás!Alfa AWUS036NH kevésbé jó a vételi érzékenysége mint az NHA nak.Én inkább a hosszútávú kapcsolatra tervezett adaptereket ajánlom,sokkal jobbak!Fontos hogy a legújabb adapterek valószínűleg nem kompatibilisek a régi Linuxos hacker operációs rendszerekkel alapból.Ezért megvan hogy milyen chipszetű adaptereket kell megvenned!A monitor mód és az injektálás fontos hogy működjön.Ez a programtól függ az Alfa AWUS036NHA jelenleg minden téren a legjobb választás.Ezt első kézből az E-bayen érdemes megvenni az Európai Rokland forgalmazótól.5000ft körül megkapod.Ha Magyarországon valaki árul az meg még egyszer annyiért adja.Postával veszel 2 db-ot simán megéri.Ha megnézed az adatait toppon van a vételi érzékenysége,jó a kimeneti teljesítménye és arra tervezték hogy távoli pontokhoz kapcsolódjon.Mellesleg egy nagy megbízható márka az Alfa termékcsalád.\n\nEgy olcsó alap felszerelés ami 10.000ft ból (2 havi internet előfizetés ára) kijön\n\nA fent említett cserélhető antennás USB adapter,5m árnyékolt USB hosszabbító kábel.Itt azt nézzük meg hogy egy fém hálló veszi körbe a kábelt,8-9 decibeles beltéri bot antenna pl TP-Link TL-ANT2409CL 39 cm hosszú 9 decibeles bot antenna.Ez 10 cm rel hosszabb mint a 29cm hosszú  TL-ANT2408CL 8 decibeles antenna.Ennél kisebb antennával bele sem érdemes fogni.Ezt a szoba legmagasabb pontján egy szekrényen kell minimum elhelyezni!\n\nProfi nagy antennás wifi vevő összeállítása 100.000ft alatt kijön 1 év alatt behozza az árát.A későbbiekben nincsenek vele költségek,tartós.Ezt csak padlástérbe éri meg.Evvel lehet a legnagyobb hatásfokkal fogni a jeleket.Garantáltan 0,5km en belül.Ideális körülmények pl hegyvidék meg kilométerekről is működik.\n\nIgazából hogy milyen messze látunk el a terepakadályoktól függ és a zavaró csatornáktól.Itt kell egy talpas álvány hozzá ami felfelé és lefelé állítható.Én a Eurolite STV 40 1-3m ig tetszőlegesen állítható fémállványt vettem.Ezt magasra ki kell húzni a helyiségben a mennyezethez minél közelebb.Az antenna mindenképp irányított kell és 24 Decibel vagy a felett lehetőleg MIMO pl Tp-Link ant TL-ANT2424B.Kell egy erősítős USB kábel 30 méterig ezt biztos hogy kapni rendelni kell.Amire itt kell figyelni ha lehet a csatlakozók végei aranyozottak legyenek.5V 2A tápellátás 5m felett mindenképp kell.A kábel végén meg kell figyelni van e csatlakozó és hogy jár e adapter a kábelhez!Ez 5m felett 30m ig az 5V 2A kell!Valamint fontos hogy a kábelben van középen egy erősítő!Fontos hogy az USB ből UTP átalakítók alkalmatlanok!Ne hadjad hogy ilyet rád sózzanak!A kábelhez kell az árnyékolás és az erősítés!Ehhez kell a minőségi kábel!Amire nagyon kell figyelni hogy az antennát és az adaptert lehetőleg ne külön kábellel kössük össze.Hanem a lehető leg rövidebb módon.A legjobb egy RP SMA dugó-N aljzat, átalakító adapter ez egy kis dugó nincs veszteség vele.Jobb mint az 50cm es TP link átalakító kábel!Olcsóbb is pár száz forintos tétel.Ez azért kell mert az antenna és az adapter csatlakozója eltérő.Az adpter és az antenna között ne is próbálj meg hosszabbítani.A wifi technológiában csak is nagyon röviden lehet összekötni az adaptert és az USB kábelt.Toldozgatás sem az USB sem az antenna felől nem működik csak a közvetlen összekötés!\n\n#Szükséges szoftverek\n\nRufus USB amire kiírod a Linux rendszereket.A Linux rendszert ki kell írni usb re.Majd a számítógép újra indít, indításnál lenyom általában az F11 majd az USB ről elindítod a Linux rendszert.A virtuális környezet mint a Virtualbox szimplán szarok és nem lehet velük normálisan dolgozni.A wifi törő operációs rendszereknél sok esetben verzióként teljesen mások.Ezért a régebbi verziókat is mindig nézd meg.\n\nSzoftverek listálya:Wifislax-4-10-1-final, wifislax-4-12-final, mindkettő kell.Elcomsoft wirleless Security Auditor Professional,Cain And Abel,Brutus AET 2,Firefoxhoz egy olyan plugin ami felfedi a csillagozott jelszavakat,ehhez lehet kell egy másik is ami lehetővé teszi a hogy engedélyezd az egérgonb funkcióinak használatát ott ahol le van tíltva.Ilyen most a allow_right_click és a see_my_passwords plugin,InSSIDer 2.1.6.1394,Wireless Network Watcher,Wirelesskeywiew,TP-Link QSS program,Virtualbox,Technitium MAC Address Changer,kali Linux,Eraser nagyon fontos program,VeraCrypt,Tor.\n\n#Egy alap feltörés menete\n\nElőször is írd ki a Wifislax-4-10-1 finalt egy USB pendrivera.Linux rendszerekkel fogsz főként dolgozni ezeket Rufusal mind kitudod írni.Majd a számítógép újraindításánál bootolni őket.\n\nSzótáras támadás\n\nA lényege vagy szótár vagy generálás alapján kombinációkat próbálsz a megszerzett WPA kézfogás alapján.Ha a listában van a jelszó a a gép véletlenszerűen kigenerálja (értelmes lehetőségek közülpróbálgatva) akkor megvan a jelszó.Nem kiszúrható ha valakit evvel megtámadnak.\n\nKeresd meg a Handshaker programot és ezt használhatod az airplayel vagy mással csak ne a Fake AP funkcióval mert ennek kulcsát hajlamos elmenteni,a keresőbe beírod hogy .cap ha megvan a kézfogás de kiírja a fájl helyét és ezt lemásolod USB re.És ezt Windowson bemásolod az Elcomsoft szoftverbe.Kiír egy hibaüzenetet de evvel te ne foglalkozz.Értelemszerűen itt valakinek kapcsolódnia kell a routerhet hogy ez a támadás működjön.És először körbepróbálod a számokat 1-8 ig a Mask attack fonkcióval ?d?d?d?d?d?d?d?d, gyorsíthatod évszámokkal ha gyengébb a géped 2020?d?d?d?d, egyszerűbb lehetőségek ?c?c?c?c?d?d?d?d, ?C?c?c?c?d?d?d?d, ?C?c?c?c?2020 (évszámok 1970 től).Magyar szótárt készítesz szavak egymás alá írva egy sima szöveges dokumentumban ékezetekkel és ékezetek nélkül,ehhez kereszt és vezetéknevek,települések,csapatok.Valamint Wifislaxhoz van szótárkészítő program készítesz egy szótárt számokból 1-4 ig minden kombinációban.A Szótárakhoz a Case mutation mindig legyen beállítva elég a minimumon ugyan is ez a kis és nagybetűket körbepróbálja az első betüknél!Körbepróbálod a szótárt számokkal is.Itt ha egyezés van megvan a jelszó,garancia nincs!A % os arány azt mutatja hogy mikor ér a program a megadott lista végére.Ha listában nincs benne a router jelszava 100% nál kiírja hogy sajnáljuk de nem sikerült!Itt értelemszerűen nem érdemes olyasmivel próbálkozni amiket senki nem ad meg és csak a rendszered terheled vele!Van az a mondás hogy többet ésszel mint erővel és ez a wifi törésre nagyon igaz!WPA ban a minimális karakter az 8 tól kezdődik ez alatt ne is próbálkozz!Pl jelszavak ilyenek szoktak lenni:19820501,76348942,gizi3597,Yuki2014,\n\nEvil Twin támadás\n\nA lényege létre hozol egy hamis AP-t erre kapcsolódik a felhasználó és egy webes felületen bekéred a wifi jelszavát.Előtte begyűjtesz egy WPA kézfogást evvel ellenőrzöd hogy a jelszó helyes e.Ha jó jelszót ír be a program azt mondja hogy jó.Ha nem azt mondja hogy nem.Tudni fogja a kézfogás alapján hogy jó e.Ehhez stabilan kell kapcsolódnia hozzád.Közvetlen szomszédoknál működik,kiszúrható a próbálkozás.Van igazából ennek sok fajtája ahol programmal lehet fertőzni a felhasználó gépét.Vagy biztonsági réseket kihasználni.\nProgram hozzá a Linset egyszerű használni.\n\nPixie Dust Attack és aktuális sebezhetőségek mint Krack\n\nRégebbi routereknél működik amikben van bizonyos sérülékenység wifislax-4-12-final ba benne van a program hozzá.Megjelennek aktuális sebezhetőségek WPA esetén mint a Krack támadás ahol nincs szótár meg bruteforce.Kali linuxra vagy Wifislaxra kell telepíteni a megfelelő programokat hozzá.Ezek gyors műveletek.A Krack attack hoz csak egy aktuális felhasználó kell hogy kapcsolódjon a géphez.WPS támadás a modern routerek X probállkozás után lezárnak ahol pár nap után ez feloldódik ott érdemes tovább próbálkozni .wps fájlokban mentődik le az aktuális állás.Ezt mindig mentsed el.A reaver WPS nél be kell állítani hogy hagyjon időt a próbálkozások között ha ugyan azt a PIN-t próbálja.\n\nNyílt vagy feltört router trükk\n\nHa még nincs lekódolva a router 192.168.1.1,192.168.0.1, 192.168.1.254, 192.168.0.254, admin admin,root admin,user admin,admin 1234, az alap értelmezett jelszavakkal be lehet lépni a ketelőfelületére.Ott kell keresni egy olyat hogy WPS/pin és írd fel a PIN kódot majd várj még lekódolják.Ezt írd be a TP-Link QSS programba és leosztja a jelszót. Wirelesskeywiew programmal ezután egyszerűen megnézheted.Ha több router van a hálózaton és az egyiket feltörted akkor be tudsz így lépni a másikba is!Ha feltörsz egy hálózatot mindig nézd meg hogy vannak e rajta más routerek is.Ott csak belépsz a kezelőfelületre és egyszerűen megnézed a jelszót.Ha később megváltoztatják a jelszót egyszerűen a módszerrel csak lekéred az újat.A router jelszavát megszerezheted egy MITIM támadással pl Cain and Abel.Ha valaki belép a router kezelőfelületére megszerzed a jelszavát.A Wireless Network Watcher kilistázza a hálózaton lévő eszközöket.\n\nNagyon sok féle amatőr és profi módszer van ezek az alapok.\n\n#Hogyan kapcsolódjunk és használjuk a Wifi hálózatot,számítógépet\n\nTechnitium MAC Address Changer windows 7 felett a második karakter 2,6,A,E kell hogy legyen és bármit megadhatsz. Pl 060000000000 ami nem feltűnő a hálózaton.Linux esetén azt adsz meg amit akarsz!Számítógép névnek én a Routert ajánlom.A kapcsolódási paramétereket mindig kézzel kell beállítani ezek az IP cím,Alhálózati Maszk,Alap Értelmezett Átjáró,DNS kiszolgáló.Az Ip cím 1-254 végződésű tartományban bármi lehet.Érdemes megadni a fent lévő eszközöktől eltérő tartományt hogy ne legyen feltűnő.Pl ha az eszközök 192.168.1.101, 192.168.1.102, 192.168.1.103 stb tartományban vannak,akkor a te címed legyen pl 192.168.1.190.Így nem leszel olyan könnyen kiszúrható.Illetve a kézi beállítás azért nagyon fontos mert nincs DHCP kérés és így DHCP log sem készül rólad.Az alhálózati maszk az 255.255.255.0 szinte minden esetben.Az alapértelmezett átjáró és a DNS kiszolgáló az a router IP címe.A Speciális fülön ezekből mind egyszerre többfélét megadhatunk mivel úgy is többféle routert használunk.De biztonságosabb egyszerre csak egyet megadni mert a Windows hajlamos másik hálózatra átkapcsolni és ha másak a beállítások akkor nem fogjuk kéretlenül használni!Fontos tudni hogy ebbe az alhálózatba az internetszolgáltató nem lát bele.Tehát a szolgáltató és a hatóság,titkosszolgálat az nem tud így minket követni vagy észrevenni.Ahogy a router áramtalanítva van abból minden log eltűnik.A maszkolt MAC cím ami gyári és maszkolunk,a NetBios számítógépnév amit ami adunk meg.A kapcsolódott hálózatok és minden beállítás ha le titkosítjuk a teljes merevlemezt ennek feloldása nélkül nem kinyerhetők.Ha én USB ről vagy bármi más módon bebootolok  egy másik rendszert a MAC cím változtatás szoftveresen történik.Tehát ott nem kinyerhető a hamisított MAC cím mivel csak ott az eredeti látható!Így nem megállapítható hogy te mivel használtad a hálózatot.Hogy te gyanúba keveredj a szolgáltató felől neked be kell lépned egy olyan szolgáltatásra ami téged kiad Facebook,email fiók,stb és a saját eredeti neveddel adataiddal vagy regisztrálva.A lényeg hogy a szolgáltatáson legyenek az eredeti adataid és az internetszolgáltató detektálja hogy oda beléptél,és a szolgáltatás meg annak az előfizető IP címet detektálja akinek feltörted a hálózatát.Ha te felraksz egy TOR-t ezt nem lehet detektálni vagy visszakövetni.Viszont ha wifit törsz fel evvel nagyon óvatos legyél!Az internetszolgáltató hogy milyen hostokkal mikor  kommunikál az előfizető dokumentálja.Hogy mit azt viszont nem!Ha panaszosabb a szolgáltatás a torrc fájlt megnyitod a jegyzőtömbbel és beírod ExitNodes {de} példaként.Így egy országból amit megadsz kapsz csak IP címeket.Másik megoldás hogy valakit bemérnek,ennek az esélye kevés és drága is lenne.Különben is látható nyoma lenne hogy idegenek jelennek meg.Ehhez minimum 2 antenna kell és közelről működik csak!Ezért inkább körbenézik a házakat van e valahol valami gyanús antenna.Ezért nem tanácsos a tetőre kirakni.De nem érnének el vele semmit ha le van titkosítva a teljes merevlemez és USB adaptert használsz.Próbáld meg te magad megállapítani a merevlemez titkosítás feloldása nélkül hogy melyik gép kapcsolódott!Pusztán ez alapján bottal üthetik a nyomodat.Nagyon fontos hogy amire felírtad a hacker operációs rendszert miután már nem használod a teljes eszközöd írd felül.Erre van az Eraser program.Külső adattárolókon még egy lopott operációs rendszerről se legyen képed.Az adatok felülírása és a teljes merevlemez titkosítás nélkülözhetetlen alap védelem.Ezeket teszteld data recovery programokkal.Azt is tudnod kell ha a számítógéped újratelepíted avval nem tüntetsz el.Ezért amikor titkosítasz olyan program kell ami közben a régi dolgokat felül is írja!Kis USB pendriveon data recovery programokkal kísérletezz!Hogy a felszerelésbe se tudjanak belekötni mondjuk hogy nagyobb kimeneti teljesítményt használsz azt kell mondani hogy eddig még soha nem volt használva.A titkosítás terén te nem titkosítottad le a géped,vírus is letitkosíthatja a számítógéped!Ha az operációs rendszerbe akarnának belekötni hogy lopott,te nem tudod milyen operációs rendszer.És fontos hogy te így vetted a piacon ha baki van, azt mondták hogy eredeti fizettél érte!Fontos védelmi lépés hogy a feltöréshez használatos dolgokat,jelszavak,fájlok,dokumentációk.Külön még egy titkosított fájlban kell tárolni.Erre kiváló a VeraCrypt program.",
				"added": 1584223293
			}
		],
		"1542584939_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 7,
				"body": "#How to make potassium perchlorate KClO4 full video toturial and description\n\nHow to make potassium perchlorate KClO4 from sodium perclorate NaClO4 with electrolysis\n\n[Make potassium perchlorate KCLO4 from sodium perclorate Naclo4 with electrolysis](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542491459_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n Sodium Perchlorate  Naclo4 cell parameters: 1g Nacl+2,8g H2O (saturated NACl solution at 20°C) Ph 6-7 cell temperature 20-45°C chatode pure graphite,anode PBO2  lead dioxide 6V 4A 150g Nacl+420g H2O Run time 3 week.\n\nusing the double displacement reaction\n\nSolutions:1g kcl+2,9g H2O (saturated solution at 20°C)\n         1g Naclo4+0,5g H2O (saturated solution at 20°C)\n\nThe sodium perchlorate are important to make 2 step if you use lead dioxide anode or platinised titanium anode to protect your electrode! Fisrst make sodium chlorate whit MMO anode.Than make the perchlorate with platinum or beta lead dioxide from sodium chlorate.When the sodium chlorate ready passed the methylene blue and sugar test you must change your anode in the solution!\n\nPotassium perchlorate Kclo4 double displacement reaction 1g Naclo4+0,6g KCL minimum 85°C mixed the solutions.\n\nHow to make potassium perchlorate KCLO4 at home toturial from sodium Perchlorate with electrolysis.\n\nTitanium or graphite cathode (i duyght in wendling shop the graphite) are worked perfectly in chlorate and perchlorate cells too for long term use.\n\nCathode materials in a chlorate and perchlorate cell: Graphite or Titanium.\n\nGraphite:Its easy to buy in a welding shop.\n\nAnode materials only in a chlorate cell (WARNING THIS ANODES ARE CRASH IN PERCHLORATE CELLS!): MMO mesh Anodes:Ruo2+Iro2 based or Ruo2+Tio2+Iro2 are better,MNO2 Homemade Manganese dioxide anodes Anodes,Homemade magnetite anodes Fe3O4,(Graphite but its complety crash at the first time in a chlorate cell and pH controll with HCL are required to slow down the graphite anode damage.Its not worth it!).\n\nAnode materials  in a perchlorate cell:Beta lead dioxide anodes,Platinum anodes,If you use  in a thin layer platinised titanium anode(It is immaterial for thick platinum)or beta lead dioxide anode its recommended to use it only in the Naclo3->Naclo4 conversion to protect the anodes.And do not use it in the Nacl->Naclo3 conversion to protect this perchlorate anodes lifetime!\n\n#Perchlorate tests\nzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz\n\n#Methylene blue\nThe following test for Perchlorate is very useful when you are making Perchlorate by letting a Chlorate cell run and run until all the Chloride---->Chlorate has been converted to Perchlorate. This test will tell you when Perchlorate has started to form.Methylene blue is used for staining specimens that are to be examined under a microscope. It may be possible to purchase it in a shop that sells dyes. It is sometimes sold in pet shops as a dilute solution for treating diseases of fish.A 0.3% solution of Methylene blue is made by dissolving 0.3 grams Methylene blue in 100ml water. When a drop of this is put into a (liquid) sample from a cell that has Perchlorate in it the Methylene blue will form an insoluble purple precipitate. The solution should not be acid, if it is the purple ppt. will dissolve and you will not see it. The solutions must also be cold (important). It is fairly sensitive and will detect Perchlorate levels at one gram per litre or less. You should add the Methylene blue to the sample to be tested for to see the color change.If a drop of the sample is put on a glass slide and a drop of Methylene blue added, this will make the test more sensitive.\nPersulphates and Dichromate (cell additives) also give a purple colour which is difficult to distinguish from the Perchlorate precipitate. The dilution of theses substances will be fairly large and will probably not interfere with the test. Test a sample of your cell at the start of the run in order to see if the Persulphate or Dichromate is causing a purple colour. You will then be able to judge an increase in purple colour as being caused by Perchlorate formation.\n\n#Potassium Chloride\nThis is a very crude and insensitive test. Since Potassium Perchlorate is not very soluble you will get an IMMEDIATE white fine precipitate of K Perchlorate in a solution of Sodium Perchlorate. The Perchlorate concentration will need to be fairly high. The test sample should be as cold as possible to get the best sensitivity. If the you are testing a very concentrated solution of Sodium Chlorate for the presence of Perchlorate you may mistake the precipitate of K Chlorate that you may get (since the solution is very concentrated). Dilute your solution a bit so that you are not getting a precipitate of K Chlorate. This test can be difficult to interpret correctly. Make sure you do not confuse the K Chlorate precipitate that you will get with a K Perchlorate precipitate. It generally takes a few seconds for a K Chlorate precipitate to form. K Chlorate forms plates which can be seen reflection light (glinting) when viewed under a strong light. The K Perchlorate ppt happens immediately and has very small crystal size with no glinting. Also if you have a solution containing Chlorate + Chloride (no Perchlorate) you may get a ppt similar to Perchlorate (ie. a fine white ppt with no crystal glinting).\nUsing Ethanol instead of water will increase the sensitivity of this test.This test is not recommended, better to use Methylene blue.\n\n#Chlorate tests (professional)\n\nzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz\n#N-Phenylanthranilic Acid\n\nThis will have to be purchased from a lab supply store. It is added to some concentrated sulphuric acid. A red, orange or yellow colour indicates the presence of Chlorate in a Perchlorate sample. The test is fairly sensitive.Mix about 0.1g of the phenylanthranilic acid with about 15cc concentrated Sulphuric acid to give a blackish/blueish solution. Some of the solid sample to be tested is put in the bottom of a small (preferable white) container and a few drops of the reagent added and put in contact with the sample. The colours above will appear if Chlorate is present. Be careful and do not use too much Perchlorate sample because if it contains a lot of Chlorate you may get splattering when the Chlorate reacts violently with the concentrated acid.\nYou can also use the test by adding the test reagent to a sample of dissolved Perchlorate to be tested. This can be problematic because if the test reagent is made up for a period of time it seems to give a yellow colour when added to pure water.\nThe sensitivity of the test in solutions is thus:\nA 0.4 g/l KClO3 solution gives a just barely visible discoloration. The best is to do the test both on clean water and on the unknown. If you then compare the colors of the precipitates side by side you can spot the yellow color more easily if you are testing low concentrations. For concentrations above 2 g/l or so this is not really necessary. The concentration of the indicator may also make a difference. 26.3 mg phenylanthranilic acid in 2.00 ml of 96% Sulfuric acid was used to prepare the indicator solution used here.\nBe careful\nA few drops of indicator solution was left over. A tiny bit of solid KClO3 was dropped into it. Two seconds later a -bang- followed. ClO2 I guess.\nLesson:\nBe careful you don't have pure or nearly pure Chlorate as it will react when it comes into contact with the sulphuric acid.\n\n#Aniline Reagent\nThe Aniline Reagent is made by adding 3.6grams of Aniline to 100ml of 17% HCl acid solution. The 100ml of acid can be made by adding 50ml water to 50ml concentrated (35%) HCl acid. The 2g sample of solution (use solid for maximum sensitivity) is mixed with about 2ml of the reagent and 0.5ml water added. If Chlorate is plentiful you will get a red colour immediately which will turn to dark blue. If Chlorates are only there in smallish amounts, a blue or green colour appears within 30 minutes.\nA solid sample can be added directly to the reagent and the solid left sitting on the bottom of the container. A blue colour will be seen on/at the sample if Chlorate is present.\nNote: You can compare the Chlorate content by comparing the colour obtained from your test, with the colour obtained with solutions of pure Chlorate of known contents. I don't know if coloured solutions made up from known Chlorate concentrations will hold there colours for long periods of time. If they do hold their colours for long periods of time, then this test would be a good way to do a \"quick and dirty\" titration. You would simply have a row of coloured bottles for to compare your unknown with.\n\n#Aniline Sulphate\nA small quantity (less than 0.5g) of the solid is mixed with 1ml of concentrated sulphuric acid and 2-3ml of aqueous aniline sulphate solution added. A deep blue colour is obtained if Chlorate is present. Sensitivity of this test is not known.\n\n#Indigo Carmine\nIndigo Carmine is used for microscopical staining (similar to the methylene blue)\nIt will have to be purchased from a lab supply store. It is fairly expensive per gram but you will only need a few grams for to do a lot of tests. This test in used in US Patent No. 2,392,769.This test is extremely sensitive and will detect Chlorate levels down to parts per million.A stock test indicator solution is made by dissolving one gram of Indigo Carmine per liter water. Tests for Chlorate are made by mixing 1ml of the Indigo Carmine stock test indicator with 5ml of concentrated Hydrochloric acid, and the mixture heated to boiling. To this boiling mixture, 5ml of the cell solution are added. Five parts per million of Chlorate will cause a sharp decoloration of the indicator, and one part per million can be detected. Sulphur Dioxide does not interfere with this procedure so it will be suitable for use with all the Sulphite chemicals when destroying Chlorate.\nSee here for more info.\n\n#Manganous Sulphate-Phosphoric Acid\nManganous Sulphate in syrupy (concentrated) Phosphoric acid solution reacts with Chlorates to form the violet coloured Mangani-Phosphate ion:\n6Mn++ + 12PO4- - - + 6H+ + ClO3 - === 6[Mn(PO4)2]- - - + Cl - + 3H2O\nPersulphates, nitrates, bromates, iodates and also periodates react similarly.\nA drop of the test solution is put into a micro crucible and a drop of the reagent is added. Warm rapidly over a micro burner and allow to cool. A violet coloration appears. Very pale colorations may be intensified by adding a drop of 1% alcoholic diphenylcarbazide solution when a deep violet colour, due to an oxidation product of the diphenylcarbaxide, is obtained.Sensitivity: 0.05 ug (micro grams). ClO -.\nConcentration: 1 in 1,000,000.The reagent is made up by adding equal volumes of concentrated phosphoric acid and saturated manganese (II) sulphate solution.\n\n#Potassium perchlorate chlorate contamination  test\n\nFine powdered Kclo4 are mixed with 30% concentrated hydrochloric acid HCL.The test are highly sensitive.The Kclo4 and the solution must stay white without any reaction.The Kclo4 not react with HCL.\n\n#Sodium perchlorate sodium chlorate contamination  test using heat\n\nSodium chlorate melting point 248–261 °C sodium perchlorate melting point 468 °C.If you heat Naclo3 contaminated Naclo4 you will see some melting.\n\n#Sodium chlorate perchlorate active conversion test\n\nIf you open the cell you can smell more and more highter ozone O3 gas.At end resoult you will get in the cell almost chlorate free Naclo4 with minimal chlorate contamination. \n\n#Making potassium perchlorate KCLO4 several ways from potassium chlorate KCLO3 sodium chlorate Naclo3\n\n[Making potassium perchlorate KCLO4 several ways from potassium chlorate KCLO3 sodium chlorate Naclo3](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542493219_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n How to make potassium perchlorate KCLO4 several ways with electrolysis and without electrolysis 6 different method.Using  professional factory made anodes or homemade anodes too.The simple and the veary difficult ways to make potassium perchlorate KCLO4.\n\nThe documentary:Naclo4+kcl (sodium perchlorate+potassium chloride) double displacement reaction,making NACLO4 (sodium perchlorate) with electrolysis.Normal and homemade perchlorate anodes (platinized titanium,Beta lead dioxide,Manganese dioxide anodes).Homemade manganese dioxide anodes with heat and beta lead dioxide anodes with electroplating.Chlorate anodes: professional factory made MMO (Ruo2,Iro2) and (Ruo2,Iro2,Tio2) and homemade magnetite anode.The cell and setup.Convering KCLO3 potassium chlorate to kclo4 potassium perchlorate with potassium chlorate electrolysis.Converting KCLO3 and NACLO3 to perchlorates (melting methode with heat) without electrolysis.Convering potassium chlorate KCLO3 to Potassium perchlorate using another chemicals (lead dioxide PBO2 sulfuric acid H2SO4 mehod) without electrolysis.Converting potassium chlorate to potassium perchlorate using nitric acid HNO3 (16)KClO3+(12)HNO3=(4)KClO4+(12)KNO3+(6)Cl2+(6)H2O+(12)O2.Converting chlorates to potassium perchlorate using Ozone O3 plus Sulfuric H2SO4 or Perchloric acid HCLO4 (Chlorine dioxode CLO2 plus ozone O3 method).Cleaning up the kclo4 sedementation,filtration,re crystallysation and terminating destroy the chlorate contamination destroying chlorate with chemicals.Perchlorate started to form test methode desription with methyline blue.Potassium perchlorate test chlorate contamination with hydrochloric acid KCLO4+HCL and sodium chlorate+sugar test,Clorate tests with NPAA N-Phenylanthranilic Acid,Aniline Reagent. \n\n#KCLO3 VS KCLO4 important differences and tests\n\n[KCLO3 VS KCLO4 important differences and tests](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542491321_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n Potassium perclorate versus potassium clorate.The video shows the important differences you need to know about it.\nPotassium Chlorate extremely unstable in the presence of sulfur or phosphorus and many other mixtures. It reacts vigorously, and in some cases spontaneously ignites or explodes, when mixed with many combustible materials.Potassium Chlorate easy contain highly reactive chloric acid which makes it even more dangerous.Potassium Perchlorate KCLO4 it does not contain  any cloric acid.Use much more stable Potassium Perchlorate in pyrotechnic compositions.Do not use Potassium Chlorate in: Flash Powders,Whisle Mix,Star compositions,use stable Potassium Perchlorate for your own safety.Potassium Chlorate kclo3 sensitivity to shock or friction is highly increased unlike Potassium Perchlorate KCLO4.In the potassium chlorate test you can see how easy can ignite from friction and why not recomended in: flash powder,star compositions or wisle mix but especially if you make armstrong mix from matches.And why you need potassium perchlorate in this mixtures and how much safer.It would be ideal to reject KCLO3,chlorates from fireworks.\n\nThe tests: hydrochloric acid: 1.test kclo3 with hcl Potassium chlorate hydrochloric acid and kclo4 hcl potassium perchlorate hydrochloric acid. 2.test:Kclo3 and kclo4 heating (melting point differences).3.tests reactions with chemicals:Kclo3 red phosphorus (armstrong mixture) kclo3 s (potassium chlorate sulphur), kclo4 s (Potassium perchlorate sulphur), kclo3 al (potassium chlorate aluminium) sensitivity,Kclo4/Mg/S potassium perchlorate magnesium sulphur  flash powder impact friction sensitivity. \n\n My results personal experience about the setup: In Nacl->Naclo3 production never try to heat it separately. Erosion in the cell goes high. In chlorate cell the process is accelerating. My chlorate perchlorate cell goes 20-45°C. In sommer the full perchlorate process are 3 week in winter 4 week. In the summer the cell is hot 45°C. In winter 20°C.From Nacl->naclo3 will always be ready. if the cell goes under 20 ° C that does not matter. What matters is the pH you must keep it pH 6-7 or your perchlorate never be ready.Another important thing use large surface electrodes. Particularly large surface anode. In a colder cell the production time is much more. But if you try to heat the cell causes more problems than it helps. In factory circulation setups the stable 60°C in chlorate cells are good but this is not a factory setup.If you try it to heat it only causes problems.Never try to use more than 6V!If you try to use more than 6V all anodes in chlorate and perchlorate cell will go to pot fast.6V 4-6A 0,4L-5L cells are works perfectly. In perchlorate Naclo3->Naclo4 cell its very important to keep the temperature under 45°C.Professional domuments says especially the platinum erosion go high more than 45°C in a perchlorate cell.The production efficiency fall back.Another thing After the Naclo4+Kcl reaction do not use again the Nacl solution its contain lot of Naclo4. This CLO4 in electrolysis not reducted back and the erosion in the cell higher than anything else.Its much more highter than in a perchlotate cell.\n\nAbout professional elecrodes,anodes: The are more options.The best way if you can buy this anodes from the manufacturer.If someone want know more about Naclo3,Naclo4,Kclo3,Kclo4 visit my blog http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/   Platinised titanium anodes:The price was double than PBO2. Only from manufacturer or buy a trusted place.Only a thicker micron platinum coated anode worth it.On ebay and other marketplaces too much of the shoddy and the fake product. Recommended but not mandatoryt o use only in perchlorate production.MMO anodes are much cheaper.The are vulnerable for thin platinum layer. Thick platinum anodes:Like silwer base coted 0,2mm thick platinum anode.If you use this you will need a minimum 3 mm diameter 7 cm long 0.2 mm wall thickness silver based platinum cylinder,rod what fully overcoated with 0,2mm pure platinum.\n\nThe surface is small,made from only costum sizes at the customer's request.The are strengths are tough working for lifetime.Its more costly than the big platinised titanium anodes but working only in small cells. PBO2 Anodes: Its easy to buy from ebay. These anodes wears very slowly.Use it only Naclo3->Naclo4 conversion very important.But its better to buy directly from a trusted manufacturer. MMO anodes: In the perchlorate production the are does not work.But in chlorate production is a lasting choice.The cheapest anode from all.\n\nSee more: [The Chlorates and Perchlorates](http://127.0.0.1:43110/1RuLFAr8pJMdwMWaLfp5X5ousDZHXv8K4/)\n\n",
				"added": 1542585461
			}
		],
		"1542586031_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 8,
				"body": "Ammonium perchlorate:\n\nMelting point Exothermic decomposition before melting at >200 °C\n\nAuto-ignition temperature 240 ° C\n\nLike most ammonium salts, ammonium perchlorate decomposes before melting. Mild heating results in production of hydrogen chloride, nitrogen, oxygen, and water.\n\n 4 NH4ClO4 → 4 HCl + 2 N2 + 5 O2 + 6 H2O\n\nRemember you need veary pure Naclo4 what may contain very minimal clorate.Highly contaminated  Naclo4 with Naclo3 are can not be used!\n\nFirst you will need very pure sodium perchlorate.The synthesis find here. \n\n\n[Making potassium perchlorate KClO4](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1542584939_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n![image](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1542586286-chloratetest.jpg)\n\n You must always test your sodium perchlorate to make sure its contain minimal chlorate or chlorate free!\n\nAmmonium chlorate is a very unstable oxidizer and will decompose, sometimes violently, at room temperature. This results from the mixture of the reducing ammonium cation and the oxidizing chlorate anion. Even solutions are known to be unstable. Because of the dangerous nature of this salt it should only be kept in solution when needed, and never be allowed to crystallize.\n\nLeft test NPAA test with KCLO3 Right test NPAA test with pure Naclo4 Sodium perchlorate.\n\nYou can use amateur test like heat test.\n\nSodium chlorate melting point 248–261 °C sodium perchlorate melting point 468 °C.If you heat Naclo3 contaminated Naclo4 you will see some melting.\n\nClorate tests:\n\nN-Phenylanthranilic Acid\n\nThis will have to be purchased from a lab supply store. It is added to some concentrated sulphuric acid. A red, orange or yellow colour indicates the presence of Chlorate in a Perchlorate sample. The test is fairly sensitive.Mix about 0.1g of the phenylanthranilic acid with about 15cc concentrated Sulphuric acid to give a blackish/blueish solution. Some of the solid sample to be tested is put in the bottom of a small (preferable white) container and a few drops of the reagent added and put in contact with the sample. The colours above will appear if Chlorate is present. Be careful and do not use too much Perchlorate sample because if it contains a lot of Chlorate you may get splattering when the Chlorate reacts violently with the concentrated acid.\nYou can also use the test by adding the test reagent to a sample of dissolved Perchlorate to be tested. This can be problematic because if the test reagent is made up for a period of time it seems to give a yellow colour when added to pure water.\nThe sensitivity of the test in solutions is thus:\nA 0.4 g/l KClO3 solution gives a just barely visible discoloration. The best is to do the test both on clean water and on the unknown. If you then compare the colors of the precipitates side by side you can spot the yellow color more easily if you are testing low concentrations. For concentrations above 2 g/l or so this is not really necessary. The concentration of the indicator may also make a difference. 26.3 mg phenylanthranilic acid in 2.00 ml of 96% Sulfuric acid was used to prepare the indicator solution used here.\nBe careful\nA few drops of indicator solution was left over. A tiny bit of solid KClO3 was dropped into it. Two seconds later a -bang- followed. ClO2 I guess.\nLesson:\nBe careful you don't have pure or nearly pure Chlorate as it will react when it comes into contact with the sulphuric acid.\n\nAniline Reagent\nThe Aniline Reagent is made by adding 3.6grams of Aniline to 100ml of 17% HCl acid solution. The 100ml of acid can be made by adding 50ml water to 50ml concentrated (35%) HCl acid. The 2g sample of solution (use solid for maximum sensitivity) is mixed with about 2ml of the reagent and 0.5ml water added. If Chlorate is plentiful you will get a red colour immediately which will turn to dark blue. If Chlorates are only there in smallish amounts, a blue or green colour appears within 30 minutes.\nA solid sample can be added directly to the reagent and the solid left sitting on the bottom of the container. A blue colour will be seen on/at the sample if Chlorate is present.\nNote: You can compare the Chlorate content by comparing the colour obtained from your test, with the colour obtained with solutions of pure Chlorate of known contents. I don't know if coloured solutions made up from known Chlorate concentrations will hold there colours for long periods of time. If they do hold their colours for long periods of time, then this test would be a good way to do a \"quick and dirty\" titration. You would simply have a row of coloured bottles for to compare your unknown with.\n\nProduction: From all 1g Naclo4 Sodium perchlorate you will need 0,5g Nh4Cl Ammonium cloride.Dissolve all 1g Nh4Cl Ammonium cloride 2,7g hot water.And dissolve all 1g Naclo4 sodium perchlorate in 0,5g hot water.Now mix the hot solutions minimum 80°C 1g Naclo4+0,5g Nh4Cl.Now very slowly cool down the solution under 20°C to get large crystals.Now filter it over a cloth, and carfuly wash it with ice cold water.Now the cleaning procedure for the potassium perchlorate cleaning procedure from sodium perchlorate.\n\npurifying ammonium perchlorate\n\nFirst add lot of cold water.Add the solution hydrochloric acid.and Sodium Metabisulphite to destroy all chlorates.\n\nThe solution should first be acidified to pH 3 or so using Sulphuric or HCl acid, the Sulphite added and the solution heated strongly or boiled\n\nThe Sodium Metabisulphite reactions take place according to:\n\nFirst, the Metabisulphite dissociates:\n\nNa2S2O5 + H2O <----> 2Na+ + 2H+ + 2SO32-\nThe Sulphite then reacts with Chlorate:\n\n3SO32- + ClO3 - => 3SO42- + Cl-\nThe overall reaction is:\n\n3Na2S2O5 + H2O + 2NaClO3 => 3Na2SO4 + 3H2SO4 + 2NaCl\n\nThan re crystal the Nh4ClO4 in half water half Nh4clo4 crystals filter it and carefuly wash it whit ice cold water.\n\nIf its ready recrystall again in pure water the Nh4ClO4 crystalls to clean the acid,sodium,and other contamination.\n\nNow very slowly cool down always the solution to get the possible largest crystals!\n\nIf its ready wash it again with ice cold water.Than dry it completly in max 100°C hot oven using a baking paper.\n\nYou vill get 99,5% pure NH4ClO4 with high yield results.",
				"added": 1542586428
			}
		],
		"1543259718_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 9,
				"body": "Mielőtt bármit veszel nézd meg a csomagolás hátoldalát mivel pirotechnikában,vegyészetben csakis tiszta alapanyagokkal lehet dolgozni!Bármi nemű szennyeződés az alapanyagokban jelentős vagy akár veszélyes kémiai változást okozhat ezért bármit is veszel annak tisztaságáról mindenképp győződjél meg.\n\n#Kálium Nitrát Kno3: \nN-NO3 13%. K2O 46% körüli arány legyen feltüntetve rajta vagyis 13-0-46 ezt műtrágyaként érdemes beszerezni ez 99% tisztaságú kálium nitrát (szinte mindenki ezt használja) pl Krista K plus,Kemira,Multi K.Továbbiakban élelmiszeradalékanyagként is beszerezhető vagy gyógyszertárban de pirotechnikai célra semmi különbség nincs köztük árban annál inkább.Beszerzési forrása mezőgazdasági bolt,internet,gyógyszertár,vegyszerbolt,vagy házilag is előállítható.Ha kérdezik mire kell kertészeti cél,húspácolás.\n\n#Magnézium por:\n Általános beszerzési forrása a 75/25 Mg/Al ötvözetű bojler aktív anód.A leg gyakrabban ezt internetről érdemes megrendelni főként külföldről gyors keverékekhez mindenképp 400 mesh nél minnél finomabb port kell vennünk.Itt a pornak minél sötétebbnek sűrűbbnek és szemcsementesebbnek kell lennie.Ugyan van pl tűzgyújtó rúdként vagy tömbként is de ebben a formában nem elterjedten vásárolják.\n\n#Magnálium por 50:50 ötvözet: \nEzt vagy internetről van vásárolva főként külföld vagy házilag van ötvözve magnézium és alumínium segítségével.Ez a nehezen porítható magnéziummal vagy alumíniummal szemben nagyon jól porítható.Ez az ötvözeti arány annyira puha hogy kézzel is törhető.Igen gyakran ötvözik és készítik ezt házilag főleg balkáni és oroszország felöli keleti régiókban mivel nagy mennyiségben készíthető.\n\n#Alumínium por:\n3-4 mikronos dark alumínium por ezt internetről lehet megvenni egy az egyben ezt érdemes megvenni.Festék boltban lehet kapni ugyan szíriusz ezüstport de azt még jócskán finomítani kell és külföldi rendeléssel is ugyan abban az árban jövök ki.Plusz a szíriusz ezüspor borzasztóan szállingózik ezért pl a mérleget könnyen tönkreteszi borzasztóan fog tehát árban,munkában,minőségben nem éri meg.Házilag is előállítható golyósmalomban pl dark alupor minőségben 1 hét fölötti járatási idővel úgy hogy sokszor fel kell nyitni a dobot a szakaszos oxidáció végett különben nyitásnál spontán begyulladna pl alufóliából de szintén nem olcsóbb minha megvennén a profi 3-4 mikronos dark alut.\n\n#Kénpor:\n Ventillált kénpor néven érdemes megvenni ez 99,9% tisztaságú elemi kén.Ugyan internetről is lehet rendelni de más formában ezt nem érdemes megvenni.Más formában ami nem kénpor hanem granulátum vagy tömb ezt egyátalán nem éri meg megvenni és ne vedd meg.\n\n#Faszén:\nLehet rendelni internetről speciális puhafaszén port külföldi pyro shoppokból de nem éri meg és nem jellemző.Legjobb a házilag alacsony hőmérsékleten 330°C de 450°C alatti hőmérséklet.Beszerezhető benzinkutakon grillfaszénként is keményfából de abból már fele olyan erős lőpor készíthető.Amit boltokban kapsz igazából mind keményfaszén és a grillfaszénen kívűl borászati aktív szén vagy széntabletta ezek már teljesen alkalmatlanok a célra szóval ne vedd meg.Ha keményfából veszed akkor minél magasabb fűtőértékűt válasz 7000kcal/kg.\n\n#Bárium nitrát Ba(No3)2: \nRendelni lehet internetről vagy vegyészeti szaküzlet,vagy házilag is előállítható.\n\nStroncium Nitrát Sr(NO3)2:ugyan az vonatkozik rá mint a bárium nitrátra de házi előállítása nem célszerű mivel ez eléggé a salétromsav stroncium karbonát reakciójára korlátozódik.\n\n#Stroncium karbonát SrCo3 és Bárium Karbonát BaCo3:\nFazekasonál érdemes érdekődni ez iránt vagy ahol fazekasonak forgalmaznak alapanyagokat.Vagy vegyszerbolt internetről rendelsz.\n\n#Salétromsav HNO3: \nInternetről rendelsz,vegyszerbolt,vagy házilag megcsinállod.\n\n#Kénsav H2SO4: \nAkkumlátor savként kapsz autósboltban féltömény kénsavat.Ezt egy főzőpohárban besűrítheted elektromos főzőlapon vagy lásd salétromsav.\n\n#Sósav HCl:\nVan 30%-os háztartási,festékboltokban azt érdemes megvenni.\n\n#Kálium Permanganát,Hipermangán KMNO4: \nVegyszerboltoban,gyártónál  kapni ide már úgynevezett végfelhasználói nyilatkozat kellhet ez azt tartalmazza hogy semmi illegálisra nem használlod és hogy te vagy a végfelhasználló.50kg ig nem engedélyköteles vegyszer és magánember is megkaphatja. Borászat ahol élelmiszeripari segédanyagokat árulnak.Mondhatod hogy mangántalanitó berendezésbe kell abban nagyobb mennyiségben használják.Pirotechniában kerülendő az alkalmazása ezért nem tanácsos erre az alapanyagra alapozni.\n\n#Kálium Klorát KClO3: \nKülfödről rendelsz de az UNIIÓS országokban egy rendelet végett csak cégeknek adják hivatalosan ki.Pult alol veszel vagy megcsinállod. Pirotechniában erősen kerülendő az alkalmazása enyhébb dörzsölésre is pl flashban különössen kénnel keverve hajlamos begyulladni híresen kerülendő anyag pirotechnikai célra.Elektrolízissel való házilagos előállítása mostanra már igen csak elterjedt.\n\n#Nátrium Klorát NaClO3:\nUgyan az a helyzet vele mint a kálium kloráttal.Ez mivel hidroszkopikus pirotechnikai célra alkalmatlan.\n\n#Nátrium Perklorát NaClO4:\nUgyan az a helyzet vele mint a nátrium kloráttal.Ez mivel erősen hidroszkopikus pirotechnikai célra alkalmatlan.(előállítása még egyszer olyan nehéz mint a Nátrium Kloráté Naclo3).\n\n#Ammonium Perklorát NH4ClO4:\nKülföldről sokkal könnyebb beszerezni mint az egyébb perklorátokat.Pirotechnikában pl hasznos rakétahajtóanyag.\n\n#Kálium Perklorát KClO4:\nBeszerzési szempontból megegyezik a klorátokéval,nehezebb beszereznisokkal drágább,még egyszer olyan nehéz elkészíteni,viszont pirotechnikában így vagy úgy mindenképp megéri szert tenni ná.Házilagos gyártása egyre elterjetebb.Megbízható nagy erejű színes csillagelegyekhez és sok máshoz kulcsfontosságú alapanyag.Aki házilagos pirotechnikával foglalkozik annak gyakorlatilag nélkülözhetetlen alapanyag.Előáálítása bonyulut és körülményes házilag de minden erőfeszítést megér a kapott végeredmény.Ha csak sima petárdákat készítünk kifejezetten csak ahhoz már bőségessen megér minden erőfeszítést.\n\n#Kálium Hidroxid KOH:\nVegyszerboltokból vagy hazai Magyar webshopokban rengeteg helyen kapni külföldi rendelés teljesen felesleges hatalmas belőle a kínálat.\n\n#Nátrium Hidroxid NaOH: \nLásd Kálium Hidroxid.\n\n#Kálium Karbonát vagy Kálium hidrogén karbonát:\nSzölészeti borászati szaküzlet vagy ugyan az érvényes rá mint a kálium hidroxidra vagy nátrium hidroxidra rengeteg helyen kapni.\n\n#Nátrium Hidrogén karbonát NaHCO3: \nSzódabikarbónaként kapni.De nagyobb tételben érdemesebb netről megrendelni töménytelen helyen kapni.\n\n#Nátrium Klorid NaCl:\nSima konyhasó,ha szenyezettebb kell aztali ha tisztább finomított.\n\n#Kálium Metabiszulfit K2S2O8:\nBorkén ként keresd szölészeti borászati szaküzlet.\n\n#Kálium Klorid KCl: \nHázilag nagy mennyiségben előállítható a piros kavicsos kálium klorid műtrágyából.Csak bő forró vítben teljesen fel kell oldani pár nap ülepítés ezután szűrés majd bő vízben újrakristályosítom leöblítem kiszárrítom.Egy roppant egyszerű folyamat.\n\n#Ammonium Nitrát NH4NO3: \nMegveszed a 38% nitrogéntartalmú 10 kg-os ammonium nitrát műtrágyát ez nagy tisztaságú ammonium nitrát.\n\n#Kálcium nitrát CaNO3: \nVízoldható műtrágyaként keresd mint a kálium nitrátot.Vagy rendelsz netről.\n\n#Cink por Zn:\nAz elemek külső borítása cinkből van.Ezt általában külföldről lehet és érdemes beszerezni.vagy vegyészeti szaküzlet.\n\n#Vízüveg (nátrium szilikát vizes oldata):\nFestékbolt,háztartási bolt.\n\n#Denaturált szesz:\nlásd vízüveg\n\n#Nátrium nitrát NaNO3: \nHázilag nagy mennyiségben egyszerűen előállítható vagy külföldről rendelsz.\n\n#Rézoxiklorid CuOCl: \nMezőgazdasági bolt.\n\n#Réz szulfát: \nRézgálic néven mezőgazdasági bolt\n\n#Lenolaj: \nKeresd nyers lenolajként festék vagy háztartási boltban ez tiszta fött adalék nélküli lenolaj.oldószere a lakkbenzin vagy más néven a lakkbenzin higító.\n\n#Aceton: \n1 literes kiszerelésben kapható festék vagy autós boltban másik megoldás vegyszerbolt vagy hazai gyártótol rendelsz egy zsugorfóliás tételt.Itt felhívnám a figyelmet hogy a körömlakklemosó nem aceton az egy keverék ami acetont is tartalmaz de nem aceton!\n\n#Bórsav:\nGyógyszertár háztarási bolt,vegyszerbolt.Nem összekeverendő a borkősavval ami C4H6O6.\n\n#Szalicilsav:\nGyógyszertár 100g os kiszerelésben kapható.\n\n#Nátrium Benzoát:\nGyógyszertár mezőgazdasági bolt 100g os kiszereléstől kapható.\n\n#Mangán dioxid MNO2: \nRendelsz vagy a szén cink elemekben a grafit rúd és a cink között lévő anyag szennyezett fomában amit meg kell tisztítani.Egy nagyon olcsó alapanyag nem kell érte külföldre menni.Vagy vegyészeti szaküzlet.\n\n#Oxálsav: \nFőleg méhészetben használatos olcsó alapanyag a továbbiakban lásd Mangán dioxid beszerzését.Szölészeti borászati szaküzletben festékboltban is érdemes iránta érdeklődni.\n\n#Gipsz:\nGlettelőgipszet ajánlok mivel avval sokáig lehet dolgozni és lassan szárrad ellenben a sima gipszel.",
				"added": 1543260255
			}
		],
		"1541349808_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 10,
				"body": "A lassabb keverékek sokszor effektívebbek.Az alumíniumos keverékek nagyobb fénnyel égnek el mint a magnéziumos változatok.A photoflash powders keverékek az egyik leg fényesebbek.A magnézium az alumíniumnál sokkal érzékenyebb és reaktívabb.Kálium perkloráttal már a magnézium túl érzékeny.De kis adagokban biztonságosan még kezelhető.A kén a történetben a tapasztalataim alapján már nem sokat oszt meg szoroz az érzékenységen.Én nem tanácsolom a magnéziumot nagy tételben.Egy százalékos arányt kell venni a keverésnél alapul.Nagyon erős keverékeknél mint a KCLO4 Al vagy Mg elő fordulhat hogy a keveréknél ha túl erős.Egyszóval túl gyors a pukkanó effekt hosszát még egyszer akkorára kell növelni.Befojtva a túl erős keverék nagy petárdákban éghet úgy el hogy keveset vagy nem látsz belőle semmit.A teljes anyag mindig 100% lesz.Pontosabb tized grammos mérleggel lehet kalkulálni 1 grammal. Arányosan az oxidállószer redukáló szerből először érdemes megállapítani a legerősebb arányt.Az említett photoflash receptekpen 60% magnálium vagy magnézium és alumínium por keverék van megadva és 40% KClO4.Ez biztos hogy fényesebb de gyengébb arány.És elég drága.De a Az M46 Photoflash Bomb egy profi katonai recept.Az én tapasztalatom két féle képpen lehet csökkenteni az égési sebességet.A fémporból el kell venni 5% ot és ezt kénnel helyettesíteni.De ilyen erős keverékeknél 15% kénpor felé nem érdemes menni.Ha magas a fémpor és oxidállószer aránya ez a fényen még keveset ront.A másik megoldás hogy csökkentjük a fémpor mennyíségét 5% onként és növeljük az oxidálló szerét helyette 5% al.Az 50:50% az  55:45% és a 60:40% között nagy különbségek vannak.A fény erejét és a sebességet itt mindig nézni kell.Nem szokták szinte soha a fémpor esetén többet használni mint az oxidállószer.A magnézium lehet itt a kivétel.De itt is vagy alumíniummal keverve vagy mint magnálium ötvözet.Itt az M46 nál fényt az biztos hogy az alumínium adja! Szóval aktív anód esetén is alufóliábol hozzá kell mérni ha másból nem is alufóliából az aluport. A magnézium meg az erőt.A kénnel való katalizálás 5% tól kezdődhet és 15% lehet maximum.Szerintem túl érzékeny és drága.Házi magnáliumot használva megérheti.Én egy KClO4/Al/S 50/40/10% ot használnék.Ha valakinek nagyban az is túl gyors akkor KClO4/Al/S 50/35/15% re módosítanám.Azt a problémát meg már mondanom se kell ha malomban lenne gyártva a magnálium az ínert atmoszférában készülhet.Illetve nyom nélkül lassan párolgó ínert folyadékkal kell felönteni hogy ellepje.Mert ahogy oxigén éri a nyitásnál azonnal kigyullad! Olyan kimagaslóan nagy fényű keverékeket ami szuper jó petárdába azt nem nagyon fogtok kevergetni.Ami van fent ott az oldalakon receptek ezeknek az igazán erős fényű speciális flasheknek ott a 95%-a alkalmatlan erre.A másik meg az hogy a báriumos változattól messze le fog maradni.Egy modosított picit effektívebb de valamivel gyengébb KClO4/Al/S 50/35/15% sokkal többet ér.",
				"added": 1543260882
			}
		],
		"1543483968_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 12,
				"body": "The homemade potassium and sodium chlorate KClO3 NaClO3\n\n recommend you to use stable kclo4 in modern pirotechnics star compositions,whisle mix,flash powder,the kclo3 are to dangerous and is no longer used in modern pyrotechnics for this purpose.\n\nYou can find the potassium perchlorate documentations here: How to make potassium perchlorate kclo4\n\nCathodes in a chlorate cell: Graphite,Titan\n\nAnodes in a chlorate cell: MMO or homemade anodes like:Magnetite,Manganese dioxode.Or you can use graphite but if the solution not concentrated or becomes alkali its will crash fast.\n\nPotassium Chlorate\n\nSolubility in water\n\n3.13 g/100 mL (0 °C)\n\n4.46 g/100 mL (10 °C)\n\n7.3g/100 mL (20°C)\n\n13.21 g/100 mL (40 °C)\n\n53.51 g/100 mL (100 °C)\n\nMelting point    356 °C\n\nBoiling point 400 °C decomposes\n\nIt Burns In Combination With Fuels, Shellac And Rosin Producing A High Temperature Flame  And White Smoke Of Kc-1 Particles. When It Is Mixed With Sulfur Or Antimony Tri- Sulphide, The Sensitivity To Shock Or Friction Is Highly Increased. It Would Be Ideal To Reject This Material From Fireworks. It reacts vigorously, and in some cases spontaneously ignites or explodes, when mixed with many combustible materials. It burns vigorously in combination with virtually any combustible material, even those normally only slightly flammable (including ordinary dust and lint). Mixtures of potassium chlorate and a fuel can ignite by contact with sulfuric acid, so it should be kept away from this reagent. Sulfur should be avoided in pyrotechnic compositions containing potassium chlorate, as these mixtures are prone to spontaneous deflagration. Most sulfur contains trace quantities of sulfur-containing acids, and these can cause spontaneous ignition - \"Flowers of sulfur\" or \"sublimed sulfur\", despite the overall high purity, contains significant amounts of sulfur acids. Also, mixtures of potassium chlorate with any compound with ignition promoting properties (ex. antimony(III) sulfide) are very dangerous to prepare, as they are extremely shock sensitive.\n\nHow to use kclo3: Before you use always heat the grinded fine powder more than 200°C-300°C minimum for 10 minites usin stirring in a pan using a hot plate or gas stove to remove the chloric acid.Its temporarily gives more stability in the mixtures. If the kclo3 contains moisture its will be much more unstable and sensitive for friction.\n\nPotassium chlorate production:The ony process what worth it at home was the potassium chloride electrolysis.Another process like hypochlorite heat are not worth it! Dissolve 1g kcl+2,9g H2O and you will get a saturated 34,7 g/100 ml (20°C)  kcl solution at 20°C.In a 0,4L cell you must dissolve 137g kcl+400g H2O.You must keep the pH pH 6-7 at the end of the process.Maximum 6V 4-6A should be used.A 6V 4A  car battery charger works perfeltly in 0,5-5l cells.In bigger cells like 10 liter cells you can use more Amps but you can not use more than 6-7V or your eletrodes will go bust fast.The cell temperature is not important. What is important you must keep the pH 6-7.The cell pH always goes alkaline and more and more KOH it is produced what slow down the production and reduce the yield if you does not keep the pH 6-7.The ideal temperature are 30-45°C in sommer but it does not matter if the cell temperature are goes down 20°C in winter cold. Heating a homemade chlorate cell are a bad idea its increases the electrodes and other erosion in the cell and lot of more problem.The coplete conversion are about 1 week.All kcl slowly convert to kclo3 and crystals insaide the cell the less soluble kclo3.To clean the kclo3 minimum 99,5-99,8% pure you must use sedementation,filtration ad re crystallisation.If the kclo3 contain insoluble impurities like graphite you must dissolve completly the kclo3 and serval days wait to get a clean solution. Insoluble impurities will collapse at the bottom of the vessel.But if the kclo3 crystalls are clean you must first wash with ice cold water than 2 time recrystall itt in a boiling water.The more soluble contamination like kcl,KOH are stays in the solution.And the kclo3 are crystalls insaide the solution.You must very slowly cool down the solution to get large kclo3 crystalls.Than siple wash again the crystalls in ice cod water.Than a hot plate or gas stove on a low level completly dry in a pan. \n\n![kep](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/1543484259-kclo3.jpg)\n\n The extreme powerful kclo3 flash powder: The original mixture is made with kclo4.In the original mixture the finely powdered potassium perchlorate 200°C-300°C heated than at room temperature mixed with sulfur powder at 5:1 ratio than milled again in a ball mill 24 hour the 2 component.And mixed 6:4 with 3-4 micron dark aluminium powder, and sifted in a sieve 3-4 times.Thereafter are thoroughly mixed in a mortar and paste in small doses so that the constituents are well mixed and sifted in a sieve again.If the components they are not well-mixed to a homogeneous powder the flash powder will minimum 50% it will be weaker.This method with kclo3 are not possible.With kclo4 potassium perchlorate the mixture are stable and highly resistence for friction.And the kclo4+s 5:1 mixture is not flammable.With kclo3 the mixture are highly sensitive for friction.And kclo3+S  friction sensitive and easy ignite.The catalysed mixture are much more powerful with kclo3 and kclo4 than the classic 70/30  kclo4/Al mixture.If the kclo3 are heated before use 200-300°C to get a chloric acid and moisture free chlorate its will be less sensitive for friction.You can mix the grinded sulfur with the aluminium powder than with kclo3.The mixture have the potassium perchlorate extreme power and bright but its highly sensitive for friction.With magnesium powder the kclo3 are too much sensitive.With magnesium powder the kclo3 or kclo4 flash powders are not so effective unlike with aluminium powder.Kclo3 with magnesium gives a more reactive and faster flash powder and its easier blow up in larger quantities than the aluminium version.Magnesium powder with sulfur without oxidiser make a fast flashpowder by it self.With SB2S3 the mixture are sensitive like sulfur.Mixing kclo3 with magnesium are too dangerous. Mixing kclo3 with magnesium and sulfur or SB2S3 are almost egal to get the mixture ignite from friction when you work with it.The standart kclo3/Al 70/30 less powerful than Kclo4 or kclo3 Al/S 50/40/10%.If you carefully mixed together the ingredients mixed in a mortal and pastle to make the ingredients homogeneous.Its will be more than 50% powerful as if the mixtures were just shaken together.Remember kclo3 with sulfure are friction sensitive.With kclo3 safely not possibble to make a exteme powerful flash powder like the kclo4/Al/S 50/40/10% with 3-4 micron dark aluminium powder.\n\n \nSodium chlorate\n\nSolubility in water\n\n79 g/100 mL (0 °C)\n\n89 g/100 mL (10 °C)\n\n100 g/100 mL (20 °C)\n\n125 g/100 mL (40 °C)\n\n220.4 g/100 mL (100 °C)\n\nSodium chlorate production: Dissolve 1g Nacl+2,8g H2O keep the pH 6-7.The process are same with the potassium chlorate production except the naclo3 more soluble than nacl so no crystallization occurs in the solution.Plus minimum the process time was double than the kclo3 production time.You must mix the naclo3 with sugar and test how its burn to test it.And you must use methyline bue test to check your chlorate was completly ready and the perchlorate start forming.This point you must stop the cell or your anodes will damage!When perchlorate start forming your naclo3 are copletly ready.\n\nYou can find detailed Hungarian guides on home-made chlorates and perchlorates on my blog: [Receptek Sufnipirotechnikusoknak](http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/)\n\nAnd here is an English Decentralized professional page on the theme. It contains all the important details about professional home production of chlorates and perchlorates: [The Chlorates and Perchlorates](http://127.0.0.1:43110/1RuLFAr8pJMdwMWaLfp5X5ousDZHXv8K4/)\n",
				"added": 1543484335
			},
			{
				"comment_id": 27,
				"body": "#Making more stable the KClO3 and  KClO3 Sulfur compositions befor use.Without unwanted chemical reactions.\n\nI made a method for those who want to try or make this absolute unstable and friction sensitive potassium chlorate sulfur aluminum flash powder.To make it the possible safest way without igniting the composition from friction.\n\nAs far as stability, you will need to avoid chloride contamination, avoid \"flowers of Sulfur\" and use either Frasch process or oil refinery byproduct Sulfur instead. The grade used for vulcanizing rubber is good.\n\nFor KClO3 / Al or KClO3 / Al / S 50/40/10 I have developed a recipe that can greatly reduce its sensitivity to abrasion.And increase its storage stability.Noticeably abrasive flash powder has made it an appropriate mode to resist occasional rubbing against friction! It is neither stable nor well handled!Neither the chloric acid in the chlorate nor the bound moisture is neutralized by this method, which causes frictional sensitivity and stability problems.\n\nYou can read the method on my site: http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/\n\nThis is simple potassium bicarbonate or potassium hydrogencarbonate KHCO3.It is very important that this is not potassium carbonate K2CO3 because it attacks aluminum not like KHCO3! Other carbonates and hydrogen carbonates like NaHCO3,CaCO3 it can cause adverse reactions to color and other mixed substances.Like hygroscopic chlorates.\n\nThe setup is simple heat 200°C minimum 10 minuts the KClO3.When i'ts cold down the current KClO3 we need to calculate 5% KHCO3. 1/4 added to the sulphur and the other grinded with the KClO3.\n\nNever mix more than 5 grams of flash powder at a time.\n\n-The KClO3 powder must be heated at 200 ° C for a minimum of 10 minutes to get rid of bound humidity and chloric acid.\n\n-After this the KCLO3 with the 3/4 of the 5% KHCO3 should be measured.\n\n-A quarter KHCO3 is crushed with sulfur in the other added after heating KClO3.\n\n-Fresh to immediately load into the product, do not leave the flash powder standing.",
				"added": 1579963854
			}
		],
		"1543484518_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 13,
				"body": "Barium Nitrate Ba(NO3)2\n\nhttp://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/US2010046%20Process%20of%20producing%20barium%20nitrate.pdf\n\nProperties\n\nUsed in production of green flame and stars.In flash powders its have a white extremly bright effect with 3-4 micron dark aluminium powder.Its used in extreme bright and loud stun granades  30% Ba(no3)2 30% KCLO4 40% 3-4 micrin dark aluminium.(The catalised version are much better 30% Ba(no3)2 30% KCLO4 30% Al 3-4 micron 10% S Sulfur).See How to Build Flash/Stun Grenades By George Dmitrieff.\n\nSolubility in water:\n\n 4.95 g/100 mL (0 °C)\n\n10.5 g/100 mL (25 °C)\n\n34.4 g/100 mL (100 °C)\n\nHealth risks\n\nLike all soluble barium compounds, barium nitrate is toxic by ingestion or inhalation. Symptoms of poisoning include tightness of muscles (especially in the face and neck), vomiting, diarrhea, abdominal pain, muscular tremors, anxiety, weakness, labored breathing, cardiac irregularity, and convulsions. Death may result from cardiac or respiratory failure, and usually occurs a few hours to a few days following exposure to the compound. Barium nitrate may also cause kidney damage.Solutions of sulfate salts such as Epsom salts or sodium sulfate may be given as first aid for barium poisoning, as they precipitate the barium as the insoluble (and non-toxic) barium sulfate.Inhalation may also cause irritation to the respiratory tract.While skin or eye contact is less harmful than ingestion or inhalation, it can still result in irritation, itching, redness, and pain.The Occupational Safety and Health Administration and the National Institute for Occupational Safety and Health have set occupational exposure limits at 0.5 mg/m3 over an eight-hour time-weighted average\n\nHow to make Barium nitrate Ba(no3)2 large quantities,cheaply at home.\n\nProduction I:\n\nCalcium nitrate (Cano3)2: you can buy it in farm shops as fertiliser Barium carbonate BaCo3:You can find is ceramist shops.Ceramist are use it.\n\n842 grams of barium carbonate, 94% pure, and 1456 grams of calcium nitrate, 79.5% pure may be added to 4800 grams of water in an open vessel and boiled for about two hours, at the end of which time the water will have been reduced to about 4000 grams by evapo- 25 ration. The liquid may then be separated from the sludge containing the calcium carbonate, and allowed to cool, say to room temperature, whereupon barium nitrate crystallizes out. After separating the mother liquor from the crystals, as 3 by decantation or a simple filtration, the mother liquor will be found to contain practically all the excess of calcium nitrate and will be available for use in the next batch, while a yield of barium nitrate of about 99% of the theoretical based 35 upon the barium in the barium carbonate will have been obtained.See Patent: US2010046.\n\nProduction II:\n\nProduction of barium nitrate at home in smaller lots.\n\nAnother method is to add barium to carbonate, oxide, hydroxide, small water and nitric acid.\n\nBaCO3 + 2HNO3-> Ba (NO3) 2 + H2O + CO2\n\n If you want to produce strontium nitrate Sr(NO3)2, the first method is unfortunately not working. It is possible to produce strontium nitrate using the strontium carbonate nitric acid method.\n\nSrCO3 + 2HNO3-> Sr (NO3) 2 + H2O + CO2",
				"added": 1543484532
			}
		],
		"1544294712_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 14,
				"body": "Az eddigi legjobb malmos lőporom: A faszén 48 órát volt malmozva ez alacsony hőfokon készült füzfából vastag fadaradokat felhasználva.A KNO3 elektromos főzőlapon át volt szárrítva majd 24 órát volt malmozva.A KNO3 malmozás után főzőlapon ismét át volt szárrítva.A 75/15/10% KNO3/C/S együtt ezután 24 órát volt malmozva.A vékony fűzfaágak nem váltak be csak a fa vastag részeiből készült faszén  valamint a fa 1 hónapot volt szárrítva szenesítés előtt.Itt többen mondták hogy friss fát nem jó szenesíteni mert állítólag nem lesz belőle olyan jó a lőpor mint ha jól átszáradt fát szenesítenénk.A módszer egy rosszabb minőségű faszénből is a legjobbat hozza ki.Megemlíteném lőporkészítéshez különösen bevált a külön alaposan lemalmozott és főzőlapon átszárított összetevők használata.A kész lőpor nem tapadt és homogén volt.A puhafaszén használata kulcsfontosságú volt.Valamint ugyan azon fából készült vékony ágakból sajnos gyenge minőségű faszenet kaptam.A szenesítést egy ásott gödörben végeztem festékes doboz segítségével amit lefedtem egy vaslemezzel.A szenesítés folyamán ügyeltem arra hogy alacsony hőfokon szenesítsek illetve hogy az összes fa biztosan elszenesedjen.A házilag készített faszén éri meg igazán.A bolti grillfaszén hiába egyszerűbb de reaktivitás és teljesítmény terén hatalmas a különbség.",
				"added": 1544294723
			}
		],
		"1557939518_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 15,
				"body": "[Изготовление порошка алюминия.](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1557939117_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nВ данном видео показано получения порошка алюминия из отходов. В банках содержится присадка лития, которая облегчает грануляцию (порошкование). Если используется другой алюминий - например, провода, дюраль, пищевой алюминий то требуется присадка магния 2 - 3% (кроме силумина, там присадка - кремний, он отлично улучшает порошкование). Однако как показал опыт, присадка лития хоть и облегчает грануляцию, но её еле хватает, если есть возможность, лучше делать дополнительно и присадку магния. С магнием и выход значительно больше, и порошок мельче, + в момент кристаллизации перемешивать легче.\n\nНачало опыта - в конце прошлой страницы.\nЗалил видео, целиком. В конце видео порошок алюминия уже застыл, но я на всякий случай продолжил мешать ещё не много (даже застывшая крошка алюминия ниже температуры плавления может слипнуться так, что и молотком не раздробишь). Из за густоты порошка алюминия (в отличии от расплава), в конце видео из дрели выпала мешалка. Но оказалась, что порошок уже готов. Осталось только вытряхнуть порошок из тигля на лист металла (а остатки налипшего порошка соскрести ложкой, и тоже высыпать).\nТеперь остаётся только отсеить нужную фракцию, взвесить.\n__________________\nДля пробы сегодня расплавил сожержимое тигля снова, и добавил магния: примерно 2 - 3 %. Количество порошка не заметно, чтобы оно было явно больше (чем без магния), но зато порошковалось легче и частички получились явно мельче. \n\n![picture](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/making%20aluminum%20powder.jpg)\n![picture](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/making%20aluminum%20powder1.jpg)\n![picture](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/making%20aluminum%20powder2.jpg)\n![picture](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/making%20aluminum%20powder3.jpg)\n![picture](http://127.0.0.1:43110/14YK7V93HNLJb94PFrKj4aQMxPVkrbZ3oL/data/users/17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/making%20aluminum%20powder4.jpg)\n\nВот. Слева - порошок без присадки магния, справа - с присадкой магния (на листе рядом написал - Мg). ООбнаружилось ещё одно отличие - в порошке без магния почти нет мельчайшего алюминия и подобия алюминиевой пыли - а с магнием, есть.",
				"added": 1557940572
			}
		],
		"1562442902_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 16,
				"body": "> [sergery](#comment_1_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC): Hali!Dieselből,vagy más olajból lehet valahogy füstbombát készíteni?A KNO3-as megoldás nem túl költséghatékony,meg már unalmas is :DArról jutott eszembe,hogy ugye ha kevés oxigénnel van elégetve,akkor tud istentelenül kormolni(régebbi kamrás dieselekben főleg :D )\n\nA videóim közt van 3 hivatásos recept is csak klikk a +SEED gombra.Ha online lesz valaki vagy én gépközelben veled egyidőben akkor letöltődnek a videók.Ezek hivatásos receptek.\n\nhttp://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Channel=mx5kevin@zeroid.bit\n\nPróbáld ki a KNO3/glicerin+csapvíz 1:1/cukor 60/40/40 es receptet.Glicerin helyett lehet használni paraffinolajat is.De ehhez a recepthez semmiképp sem viaszt!Az összetevőket főzőlapon úgy kell összefőzni hogy égjen de bő folyadék párologjon ki belőle.A csapvízből lehet többet is belerakni.Ez tömény ködszerű nagyon sűrű füstöt ad.Glicerin nélkül is ki lehet próbálni sima csapvízzel.Kicsiben is nagyon látványos.Köszönő viszonyban sincs a gyenge minőségű gyertyaviaszos receptekkel.Olcsó egyszerű és nagyon látványos.Ha profi kell és lehetőleg színes akkor Ebay vagy pyroshopokban kell venni füstbombához speciális szublimatív szerves porfestéket.Ezekhez KClO3 kell és laktóz (tejcukor).A répacukor túl magas hőfokon ég és elégeti a festéket.KClO3 nélkül nem fog működni!A másik megoldás ami itthon is könnyen beszerezhető és rozsaszín füstöt ad az a Rodamin B.A gyáriakban szinte mindegyik szerves porfesték/KClO3/Laktóz alapú.Jelenleg ezekről tudom hogy jók és sűrű tömény füst érhető el velük.Viszont a színes füstbomba az drága.A legtöbb a neten lévő nem színes füstbomba recept meg egyszerűen gagyi.És köszönő viszonyban sincs egy jó minőségű füstbombával.Ami nem valami erős tömény füstöt képző szublimatív alapanyagot használ az mind gagyi!",
				"added": 1562838636
			}
		],
		"1550752346_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 18,
				"body": "#How to safely publish our work on pyrotechnics on the Internet and actively participate in communities who interested the theme (For Beginners)\n\nI've been working on amateur pyrotechnics for over 10 years. During this time, I've been able to more closely observe and study how the authority works. And those who want to deal with this topic want simple and very effective tips to secure themselves on the Internet against unwanted data collectors. nowhere do I know that someone has been approached by the authorities for publishing pyrotechnic content.However it was rude.However, those who deal with it are watched.However they keep in touch.You listen to their internet traffic through their ISP and intercept their phone in the long run! but in a simple way, we can get out of the danger of general observation and tracking very effectively. So whoever wants to pinch us at the cost of a very serious investigation into us. These few basic things are so effective ny protects us from publishing our own content anywhere.And we are open to participating in these communities.\n\n#How's the general observation going?\n\nFirst of all, in order to protect yourself from the problem, you first need to understand.How to monitor and try to track users.Observe once on our ISP.Also, it goes through all of our data.Secondly, the ISP of the service we use. Or directly to the server that we access.\n\n# If someone there picked out how they are trying to track back?\n\nThey search for the person's existing nickname on the Internet.To find this person in other forums.Who are trying to find out their IP address.Email addresses are trying to obtain specific personally identifiable information.MSN, Facebook, Skype, Viber data.About the services they are interested in the IP address and the email address.If the services get stuck in the IP address and email address.And the information you publish publicly does not get anywhere, the game is usually over here. They also search the Internet.And there always comes up with something related to you!\n\n#How do you get started if you are a beginner?\n\n#Step 1 Protect your identity\n\nFirst and foremost, you need the most effective protection to hide your IP address.And prevent your proxy machine's IP address from being logged by both your ISP and landing page.Also, your ISP can't be read on what pages you go through (so traffic is encrypted). Your browser should not leak and collect data.Also sign in accounts and cookies do not tell us through a proxy.The proxy and VPN provider should not be able to release us.That's all TOR can do. This takes care of the prof for the user. Behind this, feel free to post your content.\n\n#Step 2 Protection against backtracking\n\nAs a rule of thumb, just don't give out anything about yourself that is related to you. And put misleading information first, you need to create a nickname and identity that you haven't used anywhere else, especially with a trusted email account reserved for this purpose.If you have a registered email account somewhere it is very important that you create this for a completely different service. You must access them all through the TOR network. And you should never enter any personal information related to you. Pages that you register with or do not visit without TOR are very important Without a TOR. Because of what interests you, you can keep track of it. Every single page you visit and the commands you send will be logged by the servers! And if you visit them without a tor, your identity is protected! If you buy something unique and traceable, You lie! You don't accidentally refer to a county where you can live. Moreover, in this direction, post deliberately misleading information.If someone searches for and writes to you and puts things related to you there, they are sure to smell you.Accounts linked to your name never use it for any pirate social activity!\n\n#Step 3 Create an Email Account\n\nThis is because if you want to sign up for forums and services they will ask you for an email address. To which email is sent and there is a link you need to click to validate your registration. You can say goodbye to your account.The services are filterable and you cannot recover your account later. It used to be very simple nowadays but it has become very complicated.You used to create and operate an account via TOR today. such as the phone number and secondary email are mandatory. For this reason, it is now mandatory to test them in advance with a test account. Big service providers like Google Gmail, Yahoo, Protonmail, Microsoft must be avoided This is by no means our country!\n\nHow do I do this?\n\n1. First, set up TOR BROWSER. Second, look for smaller but confusing email services from other countries. First, never register with the nickname of your choice but create a test account and then test for a while.If it works, delete the test account During this time, you will know the features of your account. And if anything, your chosen nickname will not be lost.\n\nWhat do I need to pay attention to?\n\n-Ask for phone number in some way.SMS voice calling if there is such a feature already by far avoid the service.\n-TOR at TOR responds to the changing IP address at registration and login.\n-How much it is important to add to the service a secondary email address. And that there is any indication at the service that if you do not lose your password, you cannot identify it and for security reasons do not allow it.\n-The service send or not send you lot of spam mails.\n\nIf the service is entertaining you, look for another one in the beginning! They work like a tiny thing, even switching things up. follow the directions by far must be avoided!\n\nYou can then sign up for different services.Forums, video sharing, and other social sites. Use these whenever you log in through TOR.\n\nStore your passwords and sensitive stuff in an encrypted file.An easy way to do this is to use a password-protected .rar file for this, I recommend winrar.",
				"added": 1564426983
			}
		],
		"1541081558_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 22,
				"body": "KClO3/Al vagy KClO3/Al/S 50/40/10 hez kidolgoztam egy receptet amivel nagy mértékben lehet csökkenteni a dörzsérzékenységét.És a tárolási stabilitását növelni.Így aki evvel tud csak dolgozni az sokkal biztonságosabban teheti meg.Kipróbáltam és a kötött nedvességet tartalmazó érezhetően dörzsérzékeny villanóport megfelelő mód ellenállóvá tette alkalmilag dörzsölés súrlódás ellen!Így sem stabil de már jól kezelhető!A klorátban lévő klórsavat és kötött nedvességet is semlegesítjük a módszerrel ami a dörzsérzékenységet és a stabilitási problémákat okozza.Valamint a kénben lévő esetleges savmaradékot is! \n\nHa veszélyes klorát kén keveréket készítünk fontos a minőségi ventillált kénpor.A rossz minőségű minőségű savas kén mint a granulált kén itt katasztrofális eredményeket okoz!Fontos a kloridmentes KClO3.Ezért ha házilag készítjük 2X dupla annyi tiszta vízben mint amennyi a kikristályosodó klorát kristályosítsuk mindig át.És fontos hogy a krostályokat tiszta hidek vízzel mindkét alkalommal öblítsük le! \n\nA módszert az oldalamon olvashatjátok: http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/\n\nA lényege egyszerű kell vanne borászati szaküzletben kálium bikarbonátot vagy kálium hodrogén karbonátot KHCO3.Nagyon fontos hogy ez nem kálium karbonát K2CO3 mert az támadja az alumíniumot nem úgy mint a KHCO3!A többi karbonát és hidrogén karbonát mint a NaHCO3 szódabikarbóna CaCO3 hidroszkopikos klorátokat képezhet,árt a színnek és más bekevert anyagokkal is káros reakciókat produkállhat.\n\n-5 grammnál több villanóport egyszerre soha nem szabad kikeverni.\n\n-A KClO3 mat porítva nagyon fontos 200°C fokon minimum 10 percet kell hevíteni hogy a kötött párától és a klórsavtól megszabaduljon.\n\n-A KCLO3 hoz mérten 5% KHCO3 mat kell kimérni.\n\n-Negyede a kénnel van elmorzsolva a többi hidegen a KClO3 hevítése után.\n\n-Frissen mindjárt a termékbe kell tölteni a villanóport nem szabad állni hagyni. \n\n-Bárium Kloráthoz: Ha fele arányban Ba(NO3) vel keverjük nem ront jelentősen a hatáson de az érzékenységet jelentősen csökkentjük.A Ba(NO3)2 alumínium porral 1:1 arányban stabil huppanó fehér fénnyel pukkan el ezért nem ront a villanópor égésén.Én a 25% Ba(NO3)2, 25% Ba(ClO3)2, 40% Al, 10% S keverékét ajánlom.A bárium klorát sokkal érzékenyebb mint a kálium klorát!Ezért ezt bárium nitréttal fele fele arányban érdemes csak használni. ",
				"added": 1579920077
			}
		],
		"1561988920_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 24,
				"body": " Kálium klorát stabilizálása közvetlen felhasználás előtt!\n\nAkik kálium klorátot használnak!És kiakarják próbálni a kálium klorát alumínium kén villanóport.Nekik ez most fontos.A módszer nélkül véletlen se próbáljátok ki!\n\nKClO3/Al vagy KClO3/Al/S 50/40/10 hez kidolgoztam egy receptet amivel nagy mértékben lehet csökkenteni a dörzsérzékenységét.És a tárolási stabilitását növelni.Így aki evvel tud csak dolgozni az sokkal biztonságosabban teheti meg.Kipróbáltam és a kötött nedvességet tartalmazó érezhetően dörzsérzékeny villanóport megfelelő mód ellenállóvá tette alkalmilag dörzsölés súrlódás ellen!Így sem stabil de már jól kezelhető!A klorátban lévő klórsavat és kötött nedvességet is semlegesítjük a módszerrel ami a dörzsérzékenységet és a stabilitási problémákat okozza.Valamint a kénben lévő esetleges savmaradékot is! \n\nHa veszélyes klorát kén keveréket készítünk fontos a minőségi ventillált kénpor.A rossz minőségű minőségű savas kén mint a granulált kén itt katasztrofális eredményeket okoz!Fontos a kloridmentes KClO3.Ezért ha házilag készítjük 2X dupla annyi tiszta vízben mint amennyi a kikristályosodó klorát kristályosítsuk mindig át.És fontos hogy a krostályokat tiszta hidek vízzel mindkét alkalommal öblítsük le! \n\nA módszert az oldalamon olvashatjátok: http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/\n\n A lényege egyszerű kell vanne borászati szaküzletben kálium bikarbonátot vagy kálium hodrogén karbonátot KHCO3.Nagyon fontos hogy ez nem kálium karbonát K2CO3 mert az támadja az alumíniumot nem úgy mint a KHCO3!A többi karbonát és hidrogén karbonát mint a NaHCO3 szódabikarbóna CaCO3 hidroszkopikos klorátokat képezhet,árt a színnek és más bekevert anyagokkal is káros reakciókat produkállhat.\n\n-5 grammnál több villanóport egyszerre soha nem szabad kikeverni.\n\n-A KClO3 mat porítva nagyon fontos 200°C fokon minimum 10 percet kell hevíteni hogy a kötött párától és a klórsavtól megszabaduljon.\n\n-A KCLO3 hoz mérten 5% KHCO3 mat kell kimérni.\n\n-Negyede a kénnel van elmorzsolva a többi hidegen a KClO3 hevítése után.\n\n-Frissen mindjárt a termékbe kell tölteni a villanóport nem szabad állni hagyni. ",
				"added": 1579920610
			},
			{
				"comment_id": 25,
				"body": "Részletes Magyar nyelvű útmutatókat klorátok és perklorátok házi gyártásáról a blogomban találtok: [Receptek Sufnipirotechnikusoknak](http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/)\n\nÉs itt egy Angol Decentralizált profi oldal a témában.Ami minden fontos részletet tartalmaz a klorátok és perklorátok profi házilagos gyártásáról: [The Chlorates and Perchlorates](http://127.0.0.1:43110/1RuLFAr8pJMdwMWaLfp5X5ousDZHXv8K4/)",
				"added": 1579920866
			}
		],
		"1579921170_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 26,
				"body": " I made a method for those who want to try or make this absolute unstable and friction sensitive potassium chlorate sulfur aluminum flash powder.To make it the possible safest way without igniting the composition from friction.\n\nAs far as stability, you will need to avoid chloride contamination, avoid \"flowers of Sulfur\" and use either Frasch process or oil refinery byproduct Sulfur instead. The grade used for vulcanizing rubber is good.\n\nFor KClO3 / Al or KClO3 / Al / S 50/40/10 I have developed a recipe that can greatly reduce its sensitivity to abrasion.And increase its storage stability.Noticeably abrasive flash powder has made it an appropriate mode to resist occasional rubbing against friction! It is neither stable nor well handled!Neither the chloric acid in the chlorate nor the bound moisture is neutralized by this method, which causes frictional sensitivity and stability problems.\n\nYou can read the method on my site: http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/\n\n This is simple potassium bicarbonate or potassium hydrogencarbonate KHCO3.It is very important that this is not potassium carbonate K2CO3 because it attacks aluminum not like KHCO3! Other carbonates and hydrogen carbonates like NaHCO3,CaCO3 it can cause adverse reactions to color and other mixed substances.Like hygroscopic chlorates.\n\nThe setup is simple heat 200°C minimum 10 minuts the KClO3.When i'ts cold down the current KClO3 we need to calculate 5% KHCO3. 1/4 added to the sulphur and the other grinded with the KClO3.\n\nNever mix more than 5 grams of flash powder at a time.\n\n-The KClO3 powder must be heated at 200 ° C for a minimum of 10 minutes to get rid of bound humidity and chloric acid.\n\n-After this the KCLO3 with the 3/4 of the 5% KHCO3 should be measured.\n\n-A quarter KHCO3 is crushed with sulfur in the other added after heating KClO3.\n\n-Fresh to immediately load into the product, do not leave the flash powder standing.\n\nThe safe stable way are KClO4 potassium perchlorate.Use KClO4 to make a friction resistence stable flash powder.More about:  [The most possible extreme powerful professional flash powder](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1542580642_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/The+most+possible+extreme+powerful+professional+flash+powder)",
				"added": 1579921261
			}
		],
		"1590170337_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 29,
				"body": "> [pyrobee](#comment_1_17VTVHwQh5LqU7Avb8YZXcSFxBzczQgVvf): Hi ich suche Kclo4\n\nAmmoniumperchlorat NH4ClO4 kann aus England bezogen werden.Es kann verwendet werden,um Kaliumperchlorat KClO4 mit Kaliumhydroxid KOH herzustellen.\n\nIn waage Berechnung der Zutaten\n\n117,5 gramm NH4ClO4 Ammoniumperchlorat+56,11 gramm KOH Kaliumhydroxid.NH4OH und KClO4 wird gebildet im Freien zu tun.In Becherglas viel Wasser kochen bis die Reaktion abgeschlossen ist dann Salzsäure HCl und Hirschhornsalz NH4HCO3 um den pH 7.0 zu stabilisieren.Dann einmal in reichlich klarem Wasser umkristallisieren.\n\nhttps://www.amertek.co.uk/\n\nhttp://www.ammoniumperchlorate.co.uk/index.asp\n\nOder in Ebay kann aus England zu kaufen. \n\nEine andere Lösung\n\nMit Titanium katoden und RuO2+IrO2 MMO Anoden Zuerst Natriumchlorat NaClO3 muss aus Kochsalz NaCl hergestellt werden.Dann wird Natriumperchlorat NaClO4 aus Natriumchlorat NaClO3 hergestellt mit beta Bleidioxidanode PbO2.In Ebay Diese Elektroden kann kaufen.\n\nAlternativ kann reines Platin mit einer Dicke von 2 mm auf einer minimum 7cm lage und 3mm dicke Silberbasis auf eine kleinere Elektrode aufgebracht werden.\n\n[Ungarische hausgemacht  KClO4 Synthese anleitungen](http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/petarda.html)\n\n[The Chlorates and Perchlorates](http://127.0.0.1:43110/1RuLFAr8pJMdwMWaLfp5X5ousDZHXv8K4)\n\n[Make potassium perchlorate KCLO4 from sodium perclorate Naclo4 with electrolysis](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542491459_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\n[Herstellung von Kaliumperchlorat KClO4 Englisch topic](http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1542584939_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/Making+potassium+perchlorate+KClO4)",
				"added": 1593810592
			}
		],
		"1598387125_19D7NHFWkt6teDwTuQuZGRHbSFj9KVwKXA": [
			{
				"comment_id": 30,
				"body": "KNO3/Mg/S 5/4/1 die schnellste Rate mit 40µ 325 mesh oder mit feinerem Magnesiumpulver.KNO3 MG S sind Ein starker BKS.Es wird keine Beschwerden über den Stimme von Licht oder Stärke geben in minimal 0,1 gramm und jeder kilo Größe.Magnesiumanode für Warmwasserspeicher kann zur Herstellung von Magnesiumpulver verwendet werden.\n\n[Make 45u Magnalium Magnesium Powder](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1549521553_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV)\n[KNO3/Mg/S 5/4/1 Knallkörpe 1,6 Gramm](http://127.0.0.1:43110/1CS9y8BCXC7iXTqDMaYnwN9br8WaRbUeJV/?Video=1542489237_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nEs funktioniert genauso wie das 6/6/1-Verhältnis.Seine Stimme und Stärke sind eine Eintragskategorie wo es gut funktioniert.Schwächere Mischungen funktioniert nicht mehr richtig.Ein bisschen stärker und extreme heller mit dem Ba(NO3)2/Mg/S 50/40/10% mishung.Noch stärker mit dem KmNO4/Al/S 60/30/10% aber nicht stabil.Es gibt Natriumpersulfat Mg 1:1 Das ist noch stärker, aber eine unzuverlässige nicht professionelle Mischung.Die extreme Kategorie ist KClO3 das ist empfindlich.\n\nEinstiegskategorien für starke Blitzpulver.Wenn extrem stark bks müssen:\n\nKClO4/Al/S 5/4/1 mit 4-5µ dark Aluminiumpulver wie 4000+ Mesh Eckart German Black 5413 H-Super.Stabil extrem stark.Aluminium muss auch nicht mit Borsäure behandelt werden.Die schnellste KClO4/Al/S Verhältnis.\n\n[Das bestmögliche extrem leistungsstarke professionelle Flash-Pulver]( http://127.0.0.1:43110/13WfLQv2nWXYBNUEL3PkWwGUe3H7qkTF5Y/?Topic:1542580642_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nOder Wird für extra starke Blitzgranaten verwendet Ba(NO3)2 KClO4 Al S 30/30/30/10% mit 4-5µ dark Aluminiumpulver.Plus 2% Borsäure zum Schutz von Aluminiumstaub.Oder 20-35 µ Aluminiumpulver für größere Effekte (blue aluminum).Wenn Sie eine extrem helle und extrem laute Mischung benötigen empfehle ich diese für größere BKS Böller.\n\nDetaillierte Beschreibung auf Ungarisch: [Receptek Sufnipirotechnikusoknak](http://127.0.0.1:43110/16AzWR6xfhVvrmvQCm4mt7rN17CWZTCJYS/petarda.html)\n\n[How to make powerful firecracker flash powders and fine magnesium aluminum powder](Wie man leistungsstarke Kracher-Flash-Pulver und feines Magnesium-Aluminium-Pulver herstellt)\n\nSie werden detailliert vorgestellt Herstellung von starken Flash-Pulvern.Mit KNO3 Mg S,KClO4 Al S,KClO4 Mg/S,KmNO4/Al/S, tests.",
				"added": 1598432747
			}
		]
	},
	"comment_vote": {}
}