{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"4_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 1,
				"body": "Question, once you webseed a file on a cloud service, isn't the host losing their anonymity?",
				"added": 1475280204
			},
			{
				"comment_id": 2,
				"body": "Another question, where does this file go after downloaded and is it continuously seeded from that destination afterwards? Do I have any control over that?",
				"added": 1475280290
			}
		],
		"324_1MRSDFESsBXDGvNoZ5ifztA89XfEahA5ka": [
			{
				"comment_id": 3,
				"body": "Hey BBXXX, If you want someone to pay attention to what you have to say, don't spam the page. That's a sure sign I will not read your advertising garbage.",
				"added": 1476491195
			}
		],
		"2_1FqrPa67PyxHYjvGmqZsa1pcwHKYqtFEEM": [
			{
				"comment_id": 4,
				"body": "At best, this is a money-making scheme by getting users to send bitcoin to an address to engage in fictional crime fantasies. At worst, it is the scum of the darknet here to poison this online community. It is just as likely a federal agent luring would-be sickos and terrorists into divulging personal information. I'm removing this site, and I hope everyone else does the same.",
				"added": 1480049675
			}
		],
		"3_1FqrPa67PyxHYjvGmqZsa1pcwHKYqtFEEM": [
			{
				"comment_id": 5,
				"body": "At best, this is a money-making scheme by getting users to send bitcoin to an address to engage in fictional crime fantasies. At worst, it is the scum of the darknet here to poison this online community. It is just as likely a federal agent luring would-be sickos and terrorists into divulging personal information. I'm removing this site, and I hope everyone else does the same.",
				"added": 1480049740
			}
		],
		"1_137PNA5gLgCTLZTBtzUqCmMoZ752NQGQSJ": [
			{
				"comment_id": 6,
				"body": "Hi, I am very curious how this library works under the hood. The book I selected said \"PDF not available, and that the site owner would attempt to put it online.\" There isn't really a human being taken the trouble to push this book to your zite is there? I read somewhere that all these books were being stored on IPFS. Is that correct?",
				"added": 1480907401
			}
		],
		"1_1FWBt5nWNGEBAycxo5yp34ZsEHrfTJxdF4": [
			{
				"comment_id": 7,
				"body": "I have IPFS installed and still can't get this to work. Anybody else figure it out?",
				"added": 1482184560
			}
		]
	},
	"comment_vote": {
		"2_1KVKzRFAm8LuVfG8zmvqQgLfTd2ggfQNLL": 1
	}
}