{
	"title": "Un kaiju ocupa mucho espacio",
	"description": "Don't mind me. I'm just a peer.\nEnglish/Spanish\nSecurity, p2p, Linux and stuff.\n[@martinv on ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj/martinv@zeroid.bit)",
	"links": "[ZeroNet link](http://127.0.0.1:43110/1HtvVoDg372JsV8iRH2YGwtaCmL2vEihV6/)\n[Via Proxy](https://zero.acelewis.com/#1HtvVoDg372JsV8iRH2YGwtaCmL2vEihV6/)",
	"next_post_id": 30,
	"demo": false,
	"modified": 1502127145,
	"post": [
		{
			"post_id": 29,
			"title": "Nivel aceptable de (in)seguridad",
			"date_published": 1502066724.8,
			"body": "Planteémonos el objetivo hipotético de capacitar a un grupo de 50 personas en cuestiones de seguridad informática. Digamos que estas 50 personas tienen un nivel medio o \"standard\" de conocimientos de informática. Usan teléfonos y computadoras en su día a día, para trabajar y en su tiempo de ocio, pero no tienen ninguna capacitación específica en informática, ni dedican demasiado tiempo en profundizar en el funcionamiento de los servicios y herramientas que utilizan.\n\nEn la práctica me he encontrado con dos grupos o \"escuelas\" de pensamiento en cuanto a cómo abordar esta tarea. La de procurar el mayor nivel de seguridad posible, y la de intentar lograr un nivel de seguridad aceptable.\n\nVoy a decir directamente y sin suspenso que yo simpatizo más con la segunda que con la primera. Este es el por qué:\n\nA los informáticos nos encanta conocer cómo funcionan las cosas, y nos dedicamos a configurar las cosas como más nos gustan y hasta creamos nuestras propias herramientas y soluciones cuando no existen. Sin embargo, la gente que no vive de la informática, por lo general la ve como una herramienta o como un medio, y no necesariamente un fin en sí misma. Durante mucho tiempo intenté \"contagiar\" este entusiasmo con el objetivo de incentivar a la gente para explorar este mundo que me apasiona, sólo para ver como la mayoría se me queda mirando, medio bostezando, para terminar diciéndome \"pero... ¿no me lo podés dejar configurado para que me andé así o asá?. Dicho de otra forma, a los no-informáticos no les interesan los detalles, quieren algo que funcione y que no interfiera con su vida, con su trabajo, con sus comunicaciones y sus distracciones.\n\nNo los culpo. Si yo consultara a un contador para que me resuelva algunos problemas financieros, lo más posible es que yo esté dispuesto a tirarle plata por la cabeza con tal de que arregle esos problemas en vez de intentar hacerme comprender dónde está lo que hice mal, por qué está mal, cómo se puede hacer mejor y cómo debería hacerlo en el futuro. Por más que mis finanzas sean algo vital para la subsistencia de mi negocio y de mi familia, odio la contabilidad, y no tengo tiempo ni ganas de aprender a manejar mis finanzas si tengo a mi disposición alguien que dedicó tiempo y esfuerzo a aprenderlo por mi; Creo que algo similar ocurre con la informática.\n\nVolviendo al caso hipotético, creo que en el largo plazo, es preferible que 20 de esas 50 personas aprendan a cubrirse los flancos más vulnerables usando herramientas simples y utilizando un manojo de reglas fáciles de recordar, a que 1 de esas 50 personas aprenda a convertirse en un fantasma en la Matrix, imposible de rastrear, completamente* anónimo e invulnerable.\n\nGeneralmente he sostenido esta postura, y las críticas que he recibido suelen girar alrededor de cuestiones ideológicas (ese servicio está alojado en un país con el que no comparten su política, o lo que representa), o porque no presto demasiada atención a amenazas que yo (a diferencia de mis críticos) considero altísimamente improbables y poco razonables.\n\nEs una cuestión de demarcación. ¿Cuál es el nivel de (in)seguridad aceptable para cada uno? ¿Abarcamos el problema de manera inclusiva o exclusiva? ¿Tratamos de lograr al menos lo mínimo en mucha gente, o apuntar a conseguir lo máximo posible con los pocos que sean capaces y tengan el tiempo y el interés de afrontar todos los problemas juntos?\n\nComo responsable de la formación, soy yo el que debe elegir dónde se traza esa línea, y ofrecer una base sólida, razonable, que sea escalable y sostenible en el tiempo.\n\nCreo que la primera postura, la de ir directamente a la solución que más se acerque a la perfección genera más miedo que interés, más rechazo que compromiso, y deja a los oyentes anestesiados y con un sentimiento de impotencia y vulnerabilidad que es muy difícil de revertir."
		},
		{
			"post_id": 28,
			"title": "Charla+taller de seguridad y privacidad en Internet",
			"date_published": 1501635867.839,
			"body": "![Flyer-Facebook.png (0x0)](data/img/post_28_Flyer-Facebook.png)\n\nEl **viernes 25 de Agosto** voy a dar una charla en la Facultad Abierta (Rosario, Argentina) sobre **seguridad y privacidad en Internet orientada a periodistas, activistas y militantes políticos**.\n\nEl **sábado 26**, coordinaré un **taller** en el cual pondremos en práctica varias de las recomendaciones vistas en la charla.\n\nEs un proyecto que vengo planificando desde hace bastante y por fin se va a volver una realidad, gracias al apoyo de **Hacks Hackers Rosario**.\n\nLuego del evento publicaré mi experiencia, el feedback recibido y el material entregado a los asistentes para consulta de todo el mundo."
		},
		{
			"post_id": 27,
			"title": "¿De vuelta?",
			"date_published": 1494297528.212,
			"body": "Quizás... tuve que reinstalar Zeronet y todavía no sé si yo soy yo o soy otro yo."
		},
		{
			"post_id": 26,
			"title": "Activar Two Factor Authentication en Facebook (usando Google Authenticator)",
			"date_published": 1485445795.757,
			"body": "Estos son los pasos para activar el two-factor authentication o autenticación de dos factores en Facebook usando la aplicación Google Authenticator.\n\n1. **Acceder** a Facebook y entrar a la página de **Configuración**.\n\n![config.jpg (483x545)](data/img/post_26_config.jpg)\n\n2\\. Cambiar a la sección **Seguridad** y desplegar la opción **Aprobaciones de inicio de sesión**.\n\n![config2.jpg (1262x291)](data/img/post_26_config2.jpg)\n\n3\\. En el método **Generador de códigos**, acceder a **aplicación de terceros**.\n\n![config3.jpg (778x486)](data/img/post_26_config3.jpg)4\\. Abrir la aplicación **Google Authenticator** en el celular, tocar en el botón **(+)** y seleccionar la opción **Escanear código de barras**.\n\n5\\. Escanear el código de barras que se muestra en la pantalla.\n\n![config4.jpg (575x708)](data/img/post_26_config4.jpg)\n\n6\\. Introducir el código correspondiente generado por la aplicación en el campo **Código de seguridad** en la página y luego de un segundo, si el código es correcto (caduca por tiempo y puede ser necesario volver a introducir el nuevo), se indicará que funcionó y se habilitará el botón **Confirmar**.\n\n7\\. **ESTE PASO ES MUY IMPORTANTE**: En la siguiente pantalla se mostrarán los códigos de recuperación. Es muy recomendable imprimirlos y guardarlos en algún lugar seguro. A menos que sepas cómo hacerlo de forma segura, no los guardes en un archivo de texto en tu computadora y mucho menos lo subas a la nube sin antes encriptarlos de alguna forma.\n\n.8 (OPCIONAL) Si te salteaste el paso anterior, podés volver a obtener los códigos de recuperación tocando en **Obtener códigos de recuperación**.\n\n![config6.jpg (549x134)](data/img/post_26_config6.jpg)\n\nLos **códigos de recuperación** se usan para poder acceder a tu cuenta en caso de perder el teléfono o no tener acceso a él.\n\nSin los códigos de acceso ni los códigos generados por el teléfono, **no vas a poder acceder a tu cuenta de Facebook, no importa cuántes veces quieras poner la contraseña, ¡así que guardá los malditos códigos de recuperación en un lugar seguro!**\n\nEspero que les sirva. Siéntanse libres de compartir este artículo con quienes crean que les pueda servir."
		},
		{
			"post_id": 15,
			"title": "Resoluciones de fin de año, ¿por qué no?",
			"date_published": 1483398506.205,
			"body": "Nunca me dejé llevar por los balances del año terminado y las promesas para el próximo año, sin embargo este año voy a iniciarme en la tradición, por lo menos en lo que apunta al futuro.\n\nLa idea que guía mi resolución para el año que viene está tomada/robada del podcast *Hello Internet*, en donde C.G.P. Grey ha hablado largo y tendido de su *\"year of less\"*. \n\nMi \"year of less\" consistirá en *aprovechar mi tiempo de forma más inteligente*, minimizar todo lo posible las inconveniencias y pérdidas de tiempo en tareas como pago de impuestos, facilitar a mis clientes el poder pagarme de múltiples maneras (para que no haya retrasos ni excusas) y yo mismo contar con múltiples formas de pago para no tener que salir a hacer colas y perder días enteros en burocracia.\n\nEl objetivo de mi \"year of less\" es obviamente desocupar recursos para *enfocarme en mi trabajo y en mi familia*. A pesar de ser una resolución que aparenta ser principalmente laboral y económica, espero que repercuta en todas las áreas de mi vida y la de los que me rodean.\n\nBuen año para todos."
		},
		{
			"post_id": 10,
			"title": "META",
			"date_published": 1481935122.847,
			"body": "Lo viví en ***Diaspora*** y ahora lo veo en ZeroNet. \nComo toda nueva plataforma, un montón de gente interesada entra y empieza a ver de qué va, a preguntar cómo se usa esto o aquello, esto no me funciona, cómo puedo hacer esto que hago habitualmente ahí afuera, aquí en ZeroNet, etc. \nComo puede considerarse una plataforma ***alternativa***, atrae a un grupo de gente específico, que no es precisamente una muestra representativa del usuario standard de Internet.\n\nMe da la impresión de que la gente que está hoy en ZN, y permanece, es gente que apuesta por lo que representa ZN, quiere verlo florecer, ganar usuarios y tener mayor alcance y difusión. Esto se manifiesta en forma de una constante autoreferencia a ZN en los blogs y sitios que se ven por aquí. \n¿Cómo hacer esto o aquello en ZeroNet? ¿Por qué ZN es mejor que X? ¿Por qué los infieles que no usan ZN deben morir en la hoguera?, etc.\n\nA continuación voy a dar una ***opinión personal*** sobre cuál creo es la forma más productiva de favorecer el crecimiento de ZeroNet (y de ninguna manera estoy diciendo que yo mismo cumpla con estas formas, sirve también como auto-crítica):\n\n- Usar ZeroNet ***activamente y con frecuencia***: Solamente con visitar y descubrir sitios, dejar comentarios y \"likes\", estamos ayudando a distribuir dicho contenido y a darle vida a la plataforma. Si alguien nuevo entra y ve que lo último publicado es de hace 6 meses, tiene todo el derecho a pensar que la plataforma está muerta.\n- Generar contenido ***original y exclusivo***: Si solamente publicamos links de noticias de \"clearnet\", no creo que se justifique para un visitante el trabajo de usar ZN para ver lo mismo que ve en su lector de noticias, en Twitter o en Reddit.\n- ***No ser arrogante, no juzgar, no evangelizar***: ZeroNet no es para todo el mundo. Entendamos que (todavía) se requiere un nivel de conocimientos muy elevado por sobre la media, y además no todo el mundo **necesita** algo como ZeroNet. Hasta que usar ZeroNet no sea transparente y de lo mismo que como se navega hasta ahora, no creo que tenga mucho sentido luchar contra la corriente.\n\nInvestiguemos, descubramos, mejoremos ZN entre todos y de a poco hagámoslo más fácil de usar, más útil, pero con material propio, no copiado o robado, con contenido rico e interesante y no con más de lo mismo.\n\n***No estoy diciendo que no haya que hablar sobre ZN*** o reflexionar sobre su funcionamiento, sus problemas y su potencial, sino que no nos quedemos ahí. Usemos lo que ya existe para crear un ecosistema variado y atractivo, para que tanto nosotros como los nuevos visitantes vean lo que es posible y quieran quedarse, y para aprovechar el potencial que tiene ZN por sobre otras plataformas similares o por sobre la misma www.\n\nFin del último meta-post de este blog (¿será verdad...?)"
		},
		{
			"post_id": 6,
			"title": "Usar ZN remotamente (ej: desde un celular)",
			"date_published": 1481635901.243,
			"body": "Tenía pensado escribir un artículo sobre cómo usar ZeroNet remotamente, es decir, correr nuestro servidor ZeroNet en una computadora y poder acceder a él a través de la red (local o Internet) con el fin, por ejemplo, de poder usar ZN desde nuestro celular.\nPero se me adelantaron, así que acá les dejo un artículo al respecto, escrito por Raito, de **Hacking to the gate**:\n\nhttp://127.0.0.1:43110/raito.bit/?Post:12:ZeroNet+remoto\n\nUPDATE: Puntualmente cuando intento entrar remotamente desde mi teléfono Android, el navegador empieza a consumir la memoria como un agujero negro y nunca termina de cargar, y además hace que otras aplicaciones que corren en segundo plano empiecen a cerrarse (porque Android intenta libear memoria), como por ejemplo un reproductor de podcast, o incluso el cliente de la VPN.\n¿A alguien más le pasa esto?\n\nUPDATE 2: Parece que el problema es la app de Firefox para Android. Abriendo ZN desde el navegador de Android, carga bien..."
		},
		{
			"post_id": 5,
			"title": "Podcast recomendado: Steal this show\t",
			"date_published": 1481553915.725,
			"body": "Hace poco descubrí el podcast [Steal This Show](https://stealthisshow.com/), creado por **Jamie King**, director del documental **Steal this film**, que trataba principalmente del caso de The Pirate Bay, y fundador de la plataforma **VODO**, que permitía a creadores de contenido audiovisual distribuir sus obras a través de BitTorrent.\n\nEl podcast está auspiciado por [TorrentFreak](https://torrentfreak.com/), uno de los sitios de actualidad sobre cultura p2p más importantes de la actualidad.\n\nEn el [primer episodio de la segunda temporada](https://stealthisshow.com/s02e01/), Jamie entrevista a **Tamas Kocsis**, el desarrollador de **ZeroNet**, y nos cuenta qué pasa detrás de la cortina, y nos permite conocer un poco más sobre quién está detrás de esta plataforma, el porqué de su progreso o falta de progreso, y algunas noticias muy alentadoras que deberían comenzar a tener repercusiones en ZeroNet muy pronto."
		},
		{
			"post_id": 3,
			"title": "La vida P2P",
			"date_published": 1481419679.635,
			"body": "Hace como un año vi una publicación en un blog que hablaba sobre la vida 100% P2P y enumeraba varios servicios alternativos que utilizaban tecnología P2P para no depender de servidores de terceros y no depender de un nodo central en donde está alojada toda la información.\nEse blog estaba alojado en ZeroNet, y desde entonces ZeroNet quedó dando vueltas en mi cabeza.\n\nAl poco tiempo de ver esa publicación, intenté crear mi blog en ZeroNet, pero no tuve éxito. Ahora, un año y pico después, vuelvo a intentar, y si bien sigo lidiando con algunos problemas, creo que ya lo logré. Por lo menos si estás leyendo esto, quiere decir que tuve éxito.\n\n¿Mi motivación?\nNo es derrocar a ningún tirano ni comenzar ninguna revolución. Me gusta la tecnología y la idea de una red descentralizada me interesa desde hace mucho tiempo y ZeroNet creo que es la herramienta que más se está acercando a esa meta.\n\nSeguiré probando ZN, viendo su evolución, y publicando más resultados de experimentos e ideas sobre una vida más distribuida y descentralizada."
		},
		{
			"post_id": 2,
			"title": "Hola ZeroNet!",
			"date_published": 1481415021.299,
			"body": "Primer post obligatorio saludando a la plataforma."
		}
	]
}