{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_17Vhhuwp8hQnqT54AyH3dHEwwH8mxrKM1f": [
			{
				"comment_id": 2,
				"body": "Először is a saját tapasztalataim és magán véleményem a szoftverről.\n\nA clearneten és itt a ZeroNeten is szerver és weboldal tulajdonos vagyok.Több téren is van tapasztalatom mint felhasználó a web alapra írt szoftverekkel,fizetős szerver és ingyenes webszolgáltatásokkal.A most kibontakozó decentralizált technológiákkal.IPFS,darkwebes Tor technológia alatt futó onion siteok.Az IPFS alapra épülő clearnet oldalakkal is megismerkedtem.És én szeretném elmondani hogy miben is látom a ZeroNet jövőjét.\n\nA ZeroNetben én komoly jövőt látok.Ami vetélytársa lehet az az IPFS,de az IPFS a ZeroNet mögött sok mindenben komoly lemaradásban van.A hagyományos weben hiába vannak ingyenes apróbb pl csalogatónak szánt szerver szolgáltatók által üzemeltetett kisebb webszolgáltatások,márol holnapra kapcsolják le róla az ingyenes oldalakat.Az ingyenes blogolási platformokon mint a mindenkilapja vagy a blogger semmi komolyabbat nem lehet felállítani.A leg olcsóbb megosztott tárhely sem a mezei felhasználók pénztárcájához van igazítva.És ez a szolgáltatás a fizetett megosztott tárhely szolgáltatásokat képes kiváltani.\n\nEnnek a szoftvernek az egyik erőssége hogy fejlődni és nem megújulni akar.Ez alatt azt értem van egy jól ismert bevált alap aminek a problémái vannak javítva.És nincs tele rakva felesleges vackokkal amik minden féle problémát okoznak.A szoftveres világ legnagyobb problémája az ész nélküli megújúlás,és hogy felesleges funkciókkal rakják tele a szoftvereket.Példaként a windows,mire végre valamelyik oprendszerüket normálisan megcsinálnák megújítják.És egy félkész termék véget nem érő debuggolási folyamat indul el.Amiből normális szoftver meg sosem lesz! Pedig egyszer már megcsinálták.Miközben a fontos dolgok hiányoznak belőlük.És az eredmény egy rosszul működő összecsapott omladozó vacak lesz.Amit ha szó szerint valaki (kibelezne a felesleges vackoktól) és a fontos funkciók lennének benne fejleszve és javítva.Akkor kapnánk egy jól működő rendszert.A másik véglet ami veszélyeztette ezt a szoftvert de már kinől belőle hogy egy célra megvan írva,de a feladatot normálisan nem végzi el.Én ebben a szoftverben azt szeretem hogy ez nem ezt teszi!",
				"added": 1540104487
			},
			{
				"comment_id": 3,
				"body": "A technikai háttér amiben a szoftver jövőjét látom én.\n\nAmi fontos\n\nA rendszer megosztási rendszerét hibátlanra kell fejleszteni.Ha ez nem történik meg a szoftver egyszerűen elbukik! Ezen téren úgy látom komoly fejlődés van.A rendszerben már minden megvan ami kell.\n\nA funkciók a rendszer átláthatóságát biztosítsák.És ne kövessék el a fejlesztők azt a hibát hogy minden hülyeséggel tele van rakva a szoftver.Miközben a funkciók nincsennek jól kidolgozva.A rendszer maradjon lényegre törő!\n\nEnnek a dolognak a következő úttörője a proxikon át történő kitőrése a nyílt webre.Ahol az oldalakat a google is már indexelheti.Erre kísérlet a konkurens szoftverekben már most is van.Ezzel az IPFS,Tor rejtett szolgáltatások,és ez a szoftver is próbálkozik. A lemaradás ZeroNet esetén meg ott van hogy csak a nagy oldalak elérhetők vele a nyílt webről.IPFS esetém meg gyakorlatilag mindegyik. De amint elérhető lesz a technológiával minden oldal. A megosztott fizetett szerver szolgáltatásokra a szoftver alternatíva lesz.És ha lesz az embereknek egy akár ingyen üzemeltethető rendszer.Mert ebben minden megvan hozzá! Ami a nyilt webről a nagy keresők által megtalálható.Na ekkor fog a szoftver felhasználóinak száma igazán megugrani.Itt fontos hogy a ZeroNet ne maradjon le az IPFS el szemben  ebben a dologban.\n\nPélda:\n\nIPFS decentralizált wikipédia https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/\n\nTor rejtett szolgáltatások esetén pl az onion.to szolgáltatások lásd bővebben:\n\nhttps://www.tor2web.org/\n\nAmik a darknetet indexelik a google segítségével.És a nyílt webről is elérhetőek vele így a rejtett szolgáltatások sima böngészővel is.\n\nNagyon fontosnak tartom hogy az ingyenesség és az önfenntartás,decentralizáltság,anonimitás maradjon meg!",
				"added": 1540111129
			},
			{
				"comment_id": 6,
				"body": "Nagyon úgy néz ki hogy a fejlesztés abbamaradt. 2019 decembere óta semmi érdemi fejlesztés. Sokan meg már azt sem tudják hogy egyátalán a fejlesztő él e?  A globális ZeroNet közösség is úgymond elég gyenge hogy más fejlesztők kézbe vegyék a projektet.",
				"added": 1620714162
			}
		],
		"1_1LoSnDfaYjrwHLzXDPgxW81doTMnVq19hg": [
			{
				"comment_id": 4,
				"body": "Pénz kellene ide és több fejlesztő. Nyitni kellene adományozás terén többféle népszerű kriptovalutára. Egy bányászközösséget létrehozni CPU+GPU bányászati lehetőséggel ahol közösen bányászhatnak az emberek. Nem egy olyan közösséget láttam ahol több gép összefog és működik! A felhasználók tudnak így adományt gyűjteni egy program elindításával. Nyitni lenne érdemes pl Patreonra. Megcélozni nagyobb projekteket, célokat amire adományozhatnának a felhasználók. Létrehozni pénzt termelő projekteket amikből később fix bevételhez jutnak a fejlesztők. Ami már itt lett említve egy okosan elkészített decentralizált webhosting szolgáltatásba lenne ilyen lehetőség. Létre kéne hozni egy szabad oldalt azoknak a fejlesztőknek akik szabadidejükben hozzá tudnak adni a projekthez. Szabadon tölthetnek fel kódokat, scripteket, javíthatnak a szoftveren. Átláthatóbb útmutatók kellenének a felhasználóknak content.json, és más fontos parancsok, útmutatók a W3Shools oldal mintájára. Egy ilyen oldalt hozzá lehetne adni a „Több Oldal” funkcióhoz. Egyszerű opcionális fájlok beállítása kódrészleteket a content.json fájlban is vadászni kell a felhasználóknak.",
				"added": 1589903981
			}
		],
		"1_1GHE8oGuEmzispq5kMaUn8HHgkPtxwvHif": [
			{
				"comment_id": 5,
				"body": "Értelmetlen használhatatlan fos. Tele van ilyenekkel a net, szinte mind a levesben végzi. A nagyobbakat szponzorokkal nyomatják de ugyan az a kontárkodás. A sokadik következő TOR, meg következő Youtube, meg a következő cenzúrázatlan platform ami megy szépen a levesbe. Kipróbálod aztán 5 perc múlva rájössz hogy nem jó semmire.",
				"added": 1619958168
			}
		],
		"2_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 7,
				"body": "Az ötletet tovább kellene vinni úgy ha valaki szakembert keres, kőműves, burkoló, festő. Vagy éppen fordítva munkahelyet. Akkor oda a szakemberek feltölthessenek a munkájukról referenciákat, bizonyítványt, ki mihez ért stb. És visszajelzési rendszer hogy az illető mennyire megbízható. Egyben egy szűrési rendszer ha az adott illető szakember, munkahely, hírdető megbízhatatlan, feketelistákkal is kiegészítve. Ezt ki lehetne terjeszteni termékekre, szolgáltatásokra is. Majd továbbvinni decentralizált érdekeket képviselő online közösségekre, mozgalmakra az ötletet.",
				"added": 1627352804
			}
		]
	},
	"comment_vote": {}
}