{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1,
			"title": "毛左被秘密关押!",
			"body": "北京大学哲学系毕业的年轻“毛左”人士张云帆，十一月在广东一大学校园举办读书会时被警方抓走，刑拘期满后，在没有经过任何司法程序的情况下再遭秘密关押。多位“毛左”人士及知识界人士向广东番禺警方发出联署公开信批评此举，要求警方释放张云帆。\n\n据说“毛左”们发出的公开信已经征集到了350人签名。其中大部分是大学教师，学生和媒体工作者。签署者包括包括左派人士孔庆东、司马平邦等人。令人吃惊的是：自由派学者于建嵘、张千帆也签名了。\n\n请不要嘲笑于建嵘、张千帆等有名的自由派人士，也不要嘲笑其他真假难辨、却有行动能力的“毛左”们。理由很简单，如果心眼不放宽一点，文人很容易蜕变为被政客们利用的刀笔吏。\n\n看看郭文贵全家遭受迫害，还在满口胡言“千年圣君”之类的支那太监式吹捧，就可以知道支那太监糟粕在短期内无法清除干净。\n鉴于支那专政国一直以支那丛林暴政的洗脑术针对大众进行欺诈、洗脑，还有不少人的脑袋瓜里有或多或少的支那太监糟粕，而改变人们的思想，不是一朝一日之功，需要有一个过程。 \n所以在当今的支那专政国，最重要的是要发起一场运动，运动的形式可以灵活多变，但最重要的是：要有一场有实质性“行动”的运动。运动的形式是拥护毛泽东、邓小平，还是特色黑猫，三块表，或者科学发展观，习氏特色真理等等各种真理术语的外在形式口号，那不是关键问题，关键的是，要有一场以任何可能的方式、最符合中国人善于打擦边球的灵活方式， 去推动有实质性“行动”的运动！\n\n一些力挺文贵爆料的人在争论到底是反习，还是拥习，那都是伪命题，不是关键。最重要的是，要有“行动”层面的运动！\n\n零网信息是不怕拍砖的！ 欢迎更多五毛党大驾光临，让零网妙趣横生！希望五毛党们也再接再厉，无论拥护的对象是毛泽东、邓小平，还是新时代的“伟光正”领袖“习近平”，都要拥护到比较真诚的级别，至少比满清专政的那些支那太监们更真诚一点，坚决推行以持枪权捍卫真理的原则，去捍卫伟大领袖，恢复文明，恢复中华！\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1515036794
		},
		{
			"topic_id": 2,
			"title": "郭文贵为何自找死路？",
			"body": "http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/ \n对于如何看待文贵揭发的各种乱象，谢谢网友们的热心关注、热心质疑！\n\n对于郭文贵正在不断揭开、不断掀起的各种复杂乱象，已经有越来越多的网友们正在热烈探讨。郭文贵的现象很复杂，具体表现在好多方面，需要慢慢展开，仔细谈。\n任何一个具体的公民都是具有多重人格特点的、复杂情感交织的矛盾统一体！郭文贵本人也不例外。 普通人的人格不一定有郭文贵那么复杂，但是每个生命所具备的情感交织矛盾统一体，其本质相同！\n在与各地网友的互动之中，很多细节会逐渐展开。\n首先，对郭文贵本人要一分为二来看待。郭文贵在支那粪坑里被洗脑多年，如果智商稍微低一点，很可能已经像马航受难者里面的高级五毛党、为支那伪共“匿产帮”效力的高级特工们一样，已经葬身大海了。但郭文贵比普通的支那太监稍微聪明一点，运气也好一点，因此大难不死，逃过一劫。现在文贵身处民主自由的美利坚国土，但是鉴于文贵被支那粪坑洗脑多年，他身上的支那太监糟粕短期内无法完全去除干净，这方面已经有很多自相矛盾的事实完全展露出来了：\n** 1) 太监转型，道路曲折：**\n 1.1) 金融投机术扭曲了正义维权 \n在郭文贵最亲密的家人—— 他的妻子岳庆芝无法离开支那专政国的时候， 那时，郭文贵反抗的精神最为坚决，公开痛斥“伪共””匿产帮“为“支那蛆”，那时的文贵斗志昂扬， 确实有点将生死置之度外的大义凌然气势。 也正是这种准备决一死战的坚决态度激励了无数国内维权群体，其中一些退伍老兵更是准备以死相拼，冲到街头，不完成民主变革就不回头！ \n\n但是郭文贵有很复杂的另外一方面，他既是一个有战斗力的独狼特工，也是一个非常善于投机的商人。在岳庆芝离开支那专政国后，郭文贵迅速改变态度，要求很多支持他的中国人要“克制”、要“淡定”之类的退缩，这是在赤裸裸地传播“伪共”维稳宣传，这种反复无常的态度，已经给很多支持文贵的人带来麻烦。因为智商正常的人都清楚，长痛不如短痛，全民奋起，全面抗争，是结束支那丛林暴政，走向民主法治的最有效途径。\n\n郭文贵反复无常的变卦，不只是给支持文贵爆料的人们泼了一盆冷水，而且在一场被文贵刻意压制的全民抗争没有发起之后， 一些信息交流不够安全的大陆人士很快也像郭文贵的其他家人一样，很快就受到各种威胁。在暗无天日的网络柏林墙内，一些人甚至受到了各种无法形容的严酷折磨！ \n\n郭文贵各种反复无常、自相矛盾的乱象还表现在，在不同日期的不同视频里，各种情绪化的巨大态度变化几乎是毫无章法、阵脚混乱！ 比如，一方面说，中国很快就会天下大乱，“人民币将如同废纸一样”；一方面又说，大家要“克制”，不要“冲动”，要防止天下大乱。\n\n可是最简单的事实是，中国已经天下大乱，每年数十万起的维权事件就是最简单的证据。各个地方的维权群体内心深处的一致愿望就是，希望有一种力量，能够把各个地方的维权抗争连起来，把分离式的全局混乱凝聚成全局抗争，在全局性的、大规模动荡中，以全民上街、全民共震的方式，有力地冲击支那丛林暴政，扭转伪共“匿产帮”的邪恶误导，让民众从地狱深渊中脱离苦海，摆脱支那丛林暴政，走向民主法治，恢复文明，恢复宪政，恢复中华。 \n\n运动的口号，如果不希望采取“推翻伪共”之类的激烈口号，那么顺着支那太监的习惯，可以把任何类似晋惠帝那样无能的领袖歌颂成“千年圣君”，但是最重要的原则是，既然是“千年圣君”了，自然需要推行持枪权捍卫真理的原则，去捍卫比毛太阳更加伟大的“万古圣君”！\n\n没有人会去搞垮中国，因为“中国”实际上已经不存在，至少在雾霾支那专政的大陆沦陷区已经不存在。\n传统意义上的“中国”，是指能够传承中华文明、尊重中华文明的国度。郭文贵爆料已经让所有人看到：在雾霾支那沦陷区的所谓“中国”大陆，哪里还有什么“中国”，这里甚至连“中共”国也不是。\n逻辑很简单：\n一群连官僚财产都不敢公开的“伪共”“匿产帮”怎么能够代表“伟光正”的“宇宙真理党”之“中共”。中南海剩下的只是一个支那粪坑和支那蛆虫党，哪里还有什么“中共”？ 请支持中南海蛆虫大王的忠诚五毛党们，认真地举几个例子出来，中南海的长尾蛆虫，有几条虫敢公开官僚财产？\n所以网络上面的多数信息，包括一些自我标榜是“反共”先锋的民运精英，其实不是反华反共，而是反蛆除孽，恢复1949年前昙花一现的宪政共和。\n目前首先需要做的，就是各行业、各地区、各种族联合起来，推翻支那丛林暴政，恢复人性、恢复中华！\n\n* *1.2) 维权意识觉醒，促进太监转型！**\n在郭文贵2017年非常有力地抨击“伪共”“匿产帮”为“支那蛆”之后，令人哭笑不得的是，郭文贵居然又很快向中南海的领袖习某人写信，表示服软，并且乞求“伪共”施舍给他公平谈判的机会，只要有机会谈判，什么交易他都会愿意谈。\n\n“伪共”“匿产帮”里那些魔王级别的老蛆王可不是吃素的，它们向来是欺软怕硬之徒。印度已经用铁的事实和赢钱的代价，向世人证明，只要对于支那国来点硬的、狠的招数，那些靠“菜刀实名制”才能勉强维持自信的“伪共”“匿产帮”立刻就会服软，乖乖送上金钱，并且会变得像服从它们的五毛党太监一样，对外极为“文明”，很有天朝“礼仪”风范。\n \n在八字还没一撇，全民抗争的风浪都没有掀起的时候，郭文贵居然把自己想象为梁山泊的宋江，想立刻跟天朝谈判、勾兑。这种软弱的心理，被“伪共”蛆王们完全看透，于是欺软怕硬的“伪共”匪徒自然是变本加厉，以加剧酷刑折磨郭文贵家人，试图进一步加剧郭文贵身上的支那太监病毒，让郭文贵在支那太监病毒和维权意识的剧烈冲突之中，不断地让深谙金融投机、没有政治原则、但有特工技能和抗争精神的支那太监异类郭文贵在自相矛盾中不断地出错。文贵出错越多，时间拖延越久，他被灭口的可能性也就越大。\n\n多数人都容易看出，对于“伪共”“匿产帮”，斗争精神越坚决，正义诉求越有可能实现。 越是妥协服软，越容易遭受屈辱。当文贵准备掀起全民抗争之时，郭文贵的妻子岳庆芝就能够摆脱支那丛林暴政；当文贵试图与中南海谈判和解时，其灾难后果不只是郭文贵的其他家人遭到更严苛的虐待，一些传播文贵爆料的大陆人士也遭到暴政的蹂躏！从这个角度来说，郭文贵反复无常的态度，不只是对他的家人不负责，而且对他本人，对支持他的很多大陆同胞，也是不负责的。鉴于文贵还不会那么轻易地被灭口，希望他有机会改弦更张、重整旗鼓，最好是找到清晰的、正确的战略方向后，再准备发起运动，在未来的时空里，向公众展示的态度最好是能够避免极度反常的自相矛盾。这方面需要灵魂层面的自我剖析，短期内很难实现。 \n\n郭文贵的理智选择完全可以是，全家人都加入美国，这并不影响他刻意强调的“爱国”形象，因为他离开的国度并不是代表中华文明的、把人民当人看的“人民的”“共和国”，而是把人民当成“蝼蚁”一样的“支那丛林专政国”。中国大陆是一片丛林，这方面的最简单佐证就是，文贵自己的爆料 —— “天上宫殿和地上蝼蚁”。 \n\n文贵屡犯错误，一些低级错误虽然没有“伪共”“蛆虫”党那么荒谬，但是值得庆幸的是，他能持续生存的根源是因为，文贵目前是处于美利坚联邦的保护下，美利坚联邦最基本的原则——持枪权捍卫真理的原则绵延数百年而历久弥新，有力地把被支那病毒蓝金黄的希拉里淘汰出局，确保白宫的主人不会完全背叛人类文明，至少不会完全堕落到毫无人性的支那丛林级别。\n\n\n** 2) 中国转型 — 中华文明 ** \n\n严酷的现实不由得让人们更深入地思考，中国转型到底是什么？中华文明到底是什么？\n\n通过最简单的分析，可以看到，人类文明最核心的原则是持枪权捍卫真理，而所谓民主选票之类的程序活动，只是辅助性的表面化形式而已。道理很简单，假如美国没有持枪权捍卫真理的基本原则，那么麦卡锡当年完全可以借“反共”扩大化为名，就不仅仅是冲击数千万美国人，而是在美国也制造一个类似古拉格群岛、支那大饥荒、支那文革之类的人间灾难，麦卡锡之所以难以完全制造出美国版的古拉格群岛、支那文革，不是因为美国人有选票可以更换舞台上善于欺诈的政客，而是因为美国有持枪权捍卫真理的原则，作为最底层的社会规范，在社会运作的动荡期，一直发挥着灵魂层面的中流砥柱作用。也正是因为持枪权捍卫真理的底层规范，时时刻刻在知觉或不知觉地、不断遏制政客、金融寡头、和企业巨头们各种层出不穷的贪婪创意，让各种披着科技创新外衣的敲诈创新、剥削创新因为无法垄断真理的话语权而自然地无法让人类文明全体堕落到类似支那丛林暴政那样的黑暗深渊里。\n\n既然枪支的火药来源于中华文明，所以中华文明的核心价值应该是持枪权捍卫真理。 持枪权捍卫真理，这个最基本的普世原则，虽然在支那丛林专政国暂时被支那雾霾完全湮没，但是中华文明的精神在海外，尤其是在美利坚国土，因为使用火药的枪支被融合到持枪权捍卫真理的美利坚宪法之中， 一直在传承着人类文明的光辉！\n\n推行持枪权捍卫真理的普世原则，同时在实践中避免枪支过于泛滥，利用信息技术，可以把公民的诚信水准和持枪权勋章关联起来，具体的实施是另外一个话题。这里不谈。\n\n中华文明的核心价值是持枪权捍卫真理，中华文明复兴，就是把被支那丛林淹没、被美国政客们刻意隐藏的普世原则——持枪权捍卫真理的基本规范从美利坚国土重新接回来，在东亚大陆上弘扬开来，并世代传承下去。\n\n中国的转型是指，伴随着民智开启，已经在支那太监糟粕中沉沦千年的中国民众维权意识不断加强，太监糟粕不断稀释，在全面展开的金融危机、政治危机、社会动荡中，各地区、各民族基于生存的本能而必然被迫联合起来，一起推翻那一群利用谎言、暴力而不断制造各种史无前例的人间灾难的伪共“支那蛆”。在跨地区、跨民族的民众大联合之中，也将包含部分被愚弄的五毛党，比如类似马航受难者的高级支那特工那样，仅仅因为接触核心机密而葬身大海！\n\n** 3) 支那暴政源头和文明趋势 **\n看看文贵爆料和支那乱象，结合中国的历史来看，可以看出一些乱象源头和文明演变的轨迹和趋势。\n\n假如是南宋岳飞处于郭文贵的困境，在被灭口之前竟然幸运地逃脱死神，来到美利坚，以岳飞的智商和水平，就不会提出是“反习”还是“不反习”之类的口号。岳飞更有可能是高举义旗，掀起“恢复宪政、恢复中华”的历史潮流，因为台面上的傀儡，到底是习氏，还是其他人，那是次要逻辑，这也甚至不是反共与否的话题，因为其中最重要的内涵是推翻“伪共”“匿产帮”主导的支那丛林暴政，不只是解救亿万黎民百姓，也解救那些被“共产主义”洗脑而在支那绞肉机里尔虞我诈的弱势党员，包括薄熙来那样有点理想，却因为不够歹毒、而最终遭到迫害的共党异类，还包括不少被以黑反黑的中小型贪官，一些类似张阳、房峰辉等只是不够阴险、还有一点人性的技术官僚，以及在腐败链边缘的最广大的基层普通党员和士兵们！ \n\n假如是晚清的曾国藩处于郭文贵的困境，在为党国立下功劳后却遭到迫害，最终幸运地逃脱死神，来到美利坚，以曾国藩的迂腐忠诚却又具备洞察人性的智慧，曾国藩不一定提出“恢复宪政、恢复中华”之类的先进口号，他更可能是保皇党，去拥护类似光绪帝或其他个性的“千年圣君”，但历经劫难的曾国藩如果有幸认识美利坚文化，他一定会支持推行持枪权捍卫真理的基本原则，让晚清皇族们意识到，持枪权捍卫真理的基本原则，能够在皇族内部避免支那蓝金黄病毒泛滥而必然导致的无恶不作的自相残杀！\n\n南宋灭亡，因为岳飞没机会反省，根本没机会重建中华；大清灭亡，因为曾国藩的迂腐忠诚没有突破支那太监水平，当然，也更因为慈禧不允许太监们有维权意识，懂得持枪权捍卫真理，延续大清国脉，却妨碍了慈禧特权最大化！慈禧在去见马克思前，临死一刻把光绪帝送进地狱 — — 这个“伟光正”的疯婆娘之所以能够干出比麦卡锡更加疯狂的勾当，不是因为麦卡锡人品比慈禧好，而是因为满清的八旗子弟和汉族精英都没有突破支那太监的“虚伪”忠诚，把慈禧捧为“万岁”真理，却不敢推行持枪权去捍卫“真理”，最终导致虚伪的“真理”很快就腐朽糜烂了！所以，曾国藩根本算不上是晚清的“中兴”名臣，而只是大清灭亡前，回光返照的最后一个高级太监而已。\n\n郭文贵，水平与智商不一定超过岳飞、曾国藩，他是否能够提出引领全局的纲领，目前是个疑问。 至于引领全局的纲领，当如何定夺，有待进一步讨论。有一点可以确定的是，台面上的习近平只是个傀儡，反习与否是次要的逻辑。促进全局运动的纲领性口号，辛灏年、袁红冰等主张“恢复民国”，值得参考，这个口号与“恢复宪政、恢复中华”也不冲突。 “恢复宪政、恢复中华”与真正的“反共”分子不冲突，与一些热衷于复辟毛泽东思想的毛左派也没有太大的明显冲突，因为毛泽东本人是比郭文贵更加复杂得多的人物，毛在1949年前搞过宪政，虽然只是表面化的宪政，但毕竟在舆论层面大力宣传过，甚至搞过黄豆选举。 相对而言， “恢复宪政、恢复中华”是比较中性的口号，是能够容纳各种群体运动的战略口号。\n\n孙中山在一百多年前搞过“同盟会”。那时支持孙中山的人，不是采用“挺孙后援会”之类的名称。如果只是采用挺某某人，气量略显狭隘。既然掀起的是全民维权变革，建议辛灏年、袁红冰等高级谋略大师们在适当的时候，对“挺郭后援会”予以升级，可以是“维权同盟”、“维权联盟”，或者直接采用“宪政联盟”，因为不少关注文贵爆料的人们不一定是直接利益受到损害而需要维权，而是因为宪政法治被彻底扭曲，而必须发出声音，共同声援一场即将到来的全民运动。\n\n** 4) 独狼特工，千年罕见！ ** \n指出郭文贵爆料在不同时段存在的各种自相矛盾的问题，并不是要完全否定郭文贵本人，而是要让更多人看到，太明显的自相矛盾，不利于长期地、大规模地推广一场涉及国家、民族层面的正义诉求的新文化运动。\n\n追求正义、追求公正本身就含有巨大的政治能量。一方面强调追求公正的法治，另一方面又强调对于任何政治组织都不感兴趣，本身又是一件类似文贵爆料那样、非常罕见的盛世乱象！ \n\n其背后的深层次原因，可能是因为具有独狼特工个性的郭文贵在支那官场见过太多弄虚作假的官僚作风，因此对于任何机构组织都不感兴趣，部分原因是因为亲自加入某个组织就要经常会见各种人物，这种活动不利于独狼特工所需要的安全环境。孤独很多时候意味着寂寞，但伴随寂寞，也是相对的安全。这也是郭文贵家人，都不知晓郭文贵很多秘密的缘故。\n\n支那国最顶尖的特工周恩来非常善于各种社交活动，利用人性中的各种弱点，欺骗了国民党的各种官僚，以致于让支那国的特务头目毛太阳都对他敬畏三分。\n\n与历史上的周恩来相比较，中国新出现的企业家特工郭文贵，不一定有周恩来那么华丽的文采、缜密地策划政治活动的严谨思维。毛泽东当年喜欢重用文化水平低的汪东兴，也是因为毛认为汪东兴文化少，好控制。安排草根阶层出生、只有初中文化水平的郭文贵，以体制外的身份，接触了很多高级支那特工都难以接触的核心机密，这很显然属于支那专政国数十年来一直采取的逆淘汰运作。只是“伪共”“匿产帮”的一些长尾蛆王们怎么也想不到，郭文贵竟然具有比一流大学生更加强大的学习能力。在支那官场上见识了太多的尔虞我诈，又逼迫文贵不断地学习各种间谍工具，最终达到了周恩来根本无法达到的，利用高科技获取各种黑幕资料的超级特工技术！\n\n同时，更加重要的是，在支那粪坑里摸爬滚打，郭文贵竟然时刻都不敢忘记数十年前被杀害的兄弟。身处粪坑，与蛆共舞，却总是坚持人性光辉。或许是上天眷顾，最终让他逃过类似林彪、刘少奇那样的灾祸。\n \n如今文贵已经身处多元化的美利坚国土。多元文化就要强调包容。全家遭受迫害，却还在胡言“千年圣君”之类的支那太监式吹捧，这又是一个奇葩乱象。据说这种说法还得到了很多人的响应，由此可知，支那太监糟粕在短期内无法清除干净。\n\n鉴于支那专政国一直以支那丛林暴政的洗脑术针对大众进行欺诈、洗脑，还有不少人的脑袋瓜里有或多或少的支那太监糟粕，而改变人们的思想，不是一朝一日之功，需要有一个过程。\n\n所以在当今的支那专政国，最重要的是要发起一场运动，运动的形式可以灵活多变，但最重要的是：要有一场有实质性“行动”的运动。运动的形式是拥护毛泽东、邓小平，还是特色黑猫，三块表，或者科学发展观，习氏特色真理等等各种真理术语的外在形式口号，那不是关键问题，关键的是，要有一场以任何可能的方式、最符合中国人善于打擦边球的灵活方式， 去推动有实质性“行动”的运动！\n\n一些力挺文贵爆料的人在争论到底是反习，还是拥习，那都是伪命题，不是关键。最重要的是，要有“行动”层面的运动！\n\n所以，一些借用毛泽东旗帜，准备发起行动的毛左人士，他们遭受迫害，同样值得所有人关注。而且，这方面的关注力量越大，越能够揭露习近平企图复辟文革的伎俩必然失败，因为文革既然只是“十年探索”，而不是“十年浩劫”，那么，民间人士学习伟大领袖，再去探索一次，有何不可呢？ 但是多数人都晓得，在民智已开的时代，即使毛泽东复活，运动一旦展开，运动的最终结果，必然是以多数人的意志来决定。在军队高层只能靠“菜刀实名制”勉强维持“伟光正”的年代，无论对内，还是对外，任何大规模的用兵都会导致支那丛林暴政迅速崩塌！\n\n如果是薄熙来或其他更精明的人物处于习近平的位置，伪共同伙是很难像玩弄习近平那样愚弄薄熙来。 让能者去监狱，而让习近平之类的伟人充当台面上的傀儡，这本身又是支那丛林专政的逆淘汰效应。江泽民当年慧眼识垃圾，并变废为宝，让一百多候补委员中成绩倒数第一的习近平脱颖而出，并把他培养为傀儡式的接班人，终于造成各种乱象并发的盛世奇景。\n\n但是，人算不如天算。物极必反。为“伪共”“匿产帮”效力的人，不只是移植器官的医生等普通百姓遭殃，跟随高级特工与马航乘客去大海里喂鱼；类似周永康那样的政法沙皇也是株连九族，毫无天理！\n\n“伪共”“匿产帮”统治中国百姓的手法是比日寇更加凶残的“三光”—— 抢光、骗光、榨光！ “伪共”专政机器内部无休止的权力争夺，伴随着内外危机的全面爆发，必然促进21世纪的中国维权意识全面觉醒 — 让持枪权捍卫真理的基本原则确保中华文明的基本规范 — “己所不欲、勿施于人”的自由理念融合全球！\n\n** 5) 军队国家化是阴谋  ** \n美国本土其实并不是彻底的军队国家化，因为华盛顿当年解散的不是一支军队，而只是一个暂时的军人聚会，其中最明显的证据就是，这些军人回归平民后，仍然手持枪支。 \n\n军人只要没有缴械投降，被解散的军人聚会，随时都可以按多数人的共同意志，组建出一支能够捍卫多数人利益的军队。\n\n所以军队国家化，只是美国对外输出的假文化，这种假文化，如同刻意回避持枪权捍卫真理的原则，只谈选票民主一样，符合普通政客和商人们操纵权力的需求。\n\n脱离了持枪权捍卫真理的普世原则，纯粹的选票民主很容易变质为权力寡头操纵的游戏，东南亚一些地区变质的民主选举，就是违背了普世原则的结果。\n\n真正的普世价值，需要持枪权捍卫真理的普世原则保驾护航。美国数百年来一直不变的文化传统不是单纯的军队国家化，而是军队平民化，平民军人化，其核心表现，就是数百年来历久弥新的持枪权制度，没有任何一个政客能够废除。\n\n希拉里可以在短期内随意造假，误导选民，但是希拉里对杰佛逊的神圣制度原则不够敬畏， 最终被持枪权捍卫真理的选民们抛弃。川普总统如果不尽责，也随时可能被弹劾。社会风气可能局部败坏，美国某些精英可能也被支那蓝金黄病毒完全征服，甚至可能出现局部的丛林化， 但是在持枪权捍卫真理的国土上，总是有一片神圣的净土不可腐蚀，总是有一些高贵的灵魂无法收买！ 除非像支那专政国那样，完全没收民众的持枪权，然后把正义的人士统统送进监狱，否则正义的声音在美利坚国土永远不会被淹没！\n\n持枪权捍卫真理的原则，容易让普通民众把捍卫对象予以神圣化。当多数人都把一种神圣化的价值观融合到持枪权捍卫真理的务实行动之中时，类似推特、Facebook等信息平台利用娱乐至死的“主流”气氛维持信息技术的垄断暴利的文化氛围将被改变，意味着比罗斯福新政更加严肃的时代来临，很多金融寡头、技术寡头们将不得不收敛过去数十年的贪婪扩张，去面对要求公平游戏规则的滔滔民意！\n\n** 6) 香港独立、台湾独立，抑或恢复民国、恢复满清？——恢复宪政！ ** \n中央懦弱，必然导致财阀割据，各地纷争四起。外界盛传，中国是个高效的、中央高度集权的、极权专制国家。这纯粹是以讹传讹。中国其实是个腐败的、低效的、靠野蛮专政高压集权的国家，“菜刀实名制”勉强维持的“伟光正”自信，就是最简单的证据。\n\n印度总理莫迪在基层摸爬滚打过，洞察人性，通过最简单的表面现象，就做出决策，与“伪共”支那国来个硬碰硬的较量，那些靠“菜刀实名制”勉强维持高压专政的伪类们立刻服软， 未开战就投降，送上大量金元，弥补印度的军队开支。这是印度近邻给出的另一个证据。印度和中国的较量充分说明，在两个实力相近的国家较量中，专制国家如果说是高效的话，那么，其最大效率就是欺软怕硬，面对硬实力，以最快的速度投降，这就是专制的最高效率！\n\n最高效的中央集权其实是在民主制度下才能取得。当多数人都同意社会资源的重新分配由社会公认的英明领导人进行统一规划时，就是高效的集权运作。美国在20世纪的大萧条时期的罗斯福新政，本身就是在民主制度下进行高效集权运作的典范。显然，说民主制度不高效，是一种混淆是非、颠倒黑白的逻辑混乱。罗斯福上台前，遭到很多金融寡头的反对，但是最狡诈的金融寡头们，面对持枪权捍卫真理的滔滔民意，也不得不收敛贪婪之心。\n\n1949年前的延安没有发生粮食浮夸风、大饥荒之类的灾难，主要也是因为很多军民持有枪支，虽然持枪权没有写入宪法，但是众多民兵持枪的事实客观上天然地遏制着毛泽东对权力的贪婪，让他很自然地不敢极端过分地无法无天。枪支的火药本来就来自于中华文明，恢复尚武精神，创建尊重持枪权、尊重生命的文化将长久地延续中华文明。\n\n从持枪权捍卫真理的角度来看，所谓“台独”、“港独”都是伪命题，因为在持枪权捍卫真理的文明里面，不只是每个地区都是独立的，有各个地区自己的文化主权，而且每个公民的精神主权也是独立的。在持枪权捍卫真理的文明里，一个国家的主权与每个公民的精神主权是互相融合的。\n\n从这个层面来看，“台独”、“港独”，还是“大一统”专政，或是恢复民国、恢复满清，到底哪个好，都是转移视线的话题，如同民主法治到底是该“反习”、，还是“拥习”，“反毛”、还是“拥毛”一样，都是表面化的肤浅问题，让普通人自找麻烦的困惑而已。无论是“拥习”、“拥毛”、“拥邓”、，还是拥护民国、拥护满清，甚至拥护“台独”、拥护“港独”等，都涉及一个最基本的逻辑 —— 既然把拥护的对象当成真理了，那么至少需要拥护到“持枪权捍卫真理”的级别吧。 \n\n无论披着什么样的“真理”外衣，所有的真理，只要是听起来像人样的、冠冕堂皇的像个“真理”，那么，至少需要持枪权捍卫真理的原则来捍卫吧。\n\n有网友疑问：郭文贵的民主化中国愿望值得支持，习近平宠信台湾艺人黄安，修理其他艺人及封杀作品，这样如何指望中国会法制化和民主。\n\n对于黄安那样以大一统理由享受专政利益的人物来说，因为他们的大一统理由听起来确实像个“真理”，至少冠冕堂皇，像是人说的话，有点符合真理的特征。那么，对于黄安那样的真理党徒，普通人最好少去质疑黄安的意图；相反，应该顺着黄安的“伟光正”外衣，要求黄安们比拥护满清专政的曾国藩等支那太监们要真诚一点，至少要推行“持枪权捍卫真理”的原则，去捍卫他们的所谓“大一统”专政。\n\n对于那些热衷于台独、港独，却又不敢推行持枪权的人们，也是采取对付真理党徒的类似策略，如果台独、港独代表着“真理”，至少需要推行“持枪权捍卫真理”的原则，去捍卫他们的真理吧。信息技术可以把公民诚信和持枪证门槛紧密关联，只要有30%的民众在台湾拥有持枪证，那么马英九等伪君子们就不敢任意纵容“支那猪滚回支那”的中华国耻！\n\n说马英九、蒋经国等是伪君子，其实已经抬举他们了。无数的历史事实说明，伪君子确实比赤裸裸的“伪共”“支那蛆”还是要好很多。台湾暂时不会发生“菜刀实名制”、“暴力拆迁”等伟光正的文化自信产物，但这并不意味着台湾没有被支那蓝金黄病毒渗透、甚至颠覆的危险。 \n\n蒋介石和蒋经国当年明知伪共支那蛆专政会导致整个大陆陷入十八层地狱，但是在1949年前还是过度刻意回避宪政，酿成今日后果。蒋经国在台湾也是因为江南案难以收拾，只好被动地放开党禁报禁，而不敢推行普世价值的核心原则——持枪权捍卫真理的基本宪法，才导致台湾华人面临“支那猪滚回支那”的耻辱！\n\n马英九把蒋经国抬到了圣贤的高度，却仍然回避持枪权捍卫真理的普世原则。很快，国民党被支那蓝金黄病毒腐蚀、败坏。\n\n人性光辉的无限复杂、无限丰富、无限多样化，如同彩虹的七色光一样，可以组合成千差万别的多样色彩！从文学艺术层面看，一千个人的眼里，有一千个不同的哈姆雷特；类似的道理，从哲学信仰层面看，在一亿个人的眼里，就有一亿个不同的多彩世界！\n\n从这个最简单、最朴素的逻辑出发，可以看到，未来的中国不只是“四分五裂”，而是“万分亿裂”，或者更准确地说，应该是“亿差万别”— 因为尊重每个公民独特精神主权的社会，才可能真正地维持“和而不同”的文明底线；换句话说，要维持“和而不同”的文明底线，就必须尊重“亿差万别”的人类社会之最基本的文化特征。 \n \n美国社会能够包容全世界的所有民族文化，并将其汇聚成一个文化的“大熔炉”，其根本原因是因为美国的华盛顿、杰弗逊等开国元勋们采纳了“持枪权捍卫人权”的基本原则，在精英阶层比较妥当地落实了孔子强调的“己所不欲、勿施于人”的普世原则。而枪支的火药来自于中华文明，因此，可以说美国文化是吸收了中华文明之后，反而比赵宋王朝更加规范地传承了儒家文化的“核心理念”，与“己所不欲、勿施于人”的普世原则相对应的，是对自由的规范—正当的自由是“不侵犯别人的同等权利的自由”(freedom without violation of other people's equal rights)。\n \n每个人都想代表真理。追求真理的权利毫无疑问是人权的重要因素。中国文化不大喜欢尖锐的批判，而是喜欢“歌颂吹捧”。人人都想成为“真理”的代表，都想成为被“歌颂”的对象。既然每个人都代表着“真理”，那么，为了维护他们的“真理”，自然应该推行“持枪权捍卫真理”的基本原则。\n \n枪支的火药本来就来自于中华文明。无论是从尚武精神的中华文明来看，还是“和而不同”的传统文化来看，“持枪权捍卫真理”的原则都应该作为最基本的法治规范纳入中华联邦的文明体系之中，作为最底层的法治规范，发挥自然法的作用，在社会文化的最底层，规范人类文明不断变化的各种激烈博弈。\n\n美国宪法制定者之一、近乎圣贤的杰弗逊，看透人性之复杂多变，知道人类的最大敌人就是自身的贪婪，而克制贪婪的有效方式，就是推行持枪权捍卫真理的法治规范。无数的历史也说明，舞台上的政客们，多数是骗人的。\n\n世界上没有后悔药。但是在持枪权捍卫真理的基础上，只要普通百姓的持枪权没有被没收，在他们发觉上当受骗后，持枪权将发挥出捍卫文明底线的巨大力量！ \n\n无论您捍卫的对象是非常精明的“伟光正”，还是比习近平更加可靠的傀儡，只要有持枪权捍卫真理的基本原则，类似古拉格群岛、支那浮夸风之类的大规模人造灾难都很难发生。即使时间倒流，毛泽东、斯大林复活，在美国，他们所能掀起的最大灾难，也很难超过麦卡锡运动所造成的冲击！ \n\n说了这么多细节，其实就是一句话，民主的核心原则不只是选票论道，而是持枪权捍卫真理！\n\n“大同世界”、“共产主义”之类的洗脑术语过于浮夸，但是持枪权捍卫真理的小一统规范，在美国逐渐普及，不但解放了黑奴，也惠泽包括华人在内的其他族裔, 不断地稀释种族歧视的文明糟粕。这个简单的事实说明，持枪权捍卫真理的小一统规范，在全球推广开来，作为普世原则，必然能够有力地捍卫世界和平！\n\n没有持枪权捍卫真理的民主是跛脚的。但话又说回来，即使是伪君子主导的、跛脚的民主比毫无人权、赤裸裸的支那丛林暴政还是要好很多。港澳台地区，作为半民主的文明地带，被支那病毒渗透得最严重，同时由于地缘因素，一旦觉醒，因支那病毒刺激而产生的反作用力最容易影响到雾霾支那沦陷区的中国大陆。\n\n无论是从台独、港独，还是大一统角度，为了遏制支那专政病毒的侵蚀，港澳台地区都应该升级民主制度，把跛脚的选票民主升级到持枪权捍卫真理的普世原则。\n\n没有尚武精神的文明是无法持久的。 敢战方能言和，尚武才能讲理。 为了让台湾人彻底摆脱“支那猪”的耻辱，也为了让港澳台更有力地抵抗支那病毒渗透，半民主的港澳台地区可以各种形式展开推广持枪权的运动，捍卫各个地区的文化主权，同时也是捍卫每个公民的精神主权。\n\n世界上本来没有路，但是走的人多了，就有了路。持枪权捍卫真理的普世原则，其实只是一个浅显的道理，虽然它一直被美国的某些政客们刻意回避，但是，在在信息化的地球村时代，伴随着各种领域的事件传播，全局性的政治危机、金融危机紧密互动，必然有越来越多人看到这一条朴实、简单的文明道路！\n",
			"added": 1516543947
		},
		{
			"topic_id": 3,
			"title": "关于修宪...",
			"body": "127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1632632503_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/Old+Topics ",
			"added": 1520439023
		},
		{
			"topic_id": 4,
			"title": "砸烂郭太监、保护自由女神!",
			"body": "**砸烂郭太监、营救董瑶琼、保护自由女神!**\n\n一些网友可能误解了砸郭和挺郭的矛盾统一关系。\n郭文贵是一个非常典型的、人格严重分裂的两面人。\n砸郭，砸的是郭文贵的太监糟粕，是为了更好地支持郭文贵争当现代公民的转型努力！ \n",
			"added": 1532703454
		},
		{
			"topic_id": 5,
			"title": "和平革命三部曲",
			"body": "(比较繁忙的朋友，看看摘要、革命檄文和说明C部分，就可以。)\n摘要：\n和平革命三部曲：\n1) 标语革命 —抛弃伪共，恢复宪政！\n把反对目标界定为一小撮“伪共”“黄俄蛆”，与基层党员无关！这有利于最大化地减少潜在的冲突，促进和平革命。 \n2) 独立工会革命 — 扎根本地的工会、维权联盟比频繁地进京维权更实在，符合长远之道！\n3) 民变和兵变 — 恢复选举，恢复宪政！是彻底保障退伍老兵利益的长远之道。\n额外说明：\na) 郭文贵病毒 —砸烂太监糟粕，是为了更好地促进郭文贵维权。\nb) 文明转型 — 和平革命的终极目标，恢复中华文明，“持枪权捍卫真理”的“普世原则”。 \nc) 营救董瑶琼符合“重振美国”的战略，更是在维护“自由女神”！\n\n+ **前言—革命檄文**\n\n中国大陆的黄俄“伪共”“匿产帮”背叛习仲勋等革命先辈曾经追求的“宪政民主”，丧尽天良、无恶不作！“伪共”在制造了比古拉格群岛更严重的支那“大饥荒”后，毫无悔改之意，甚至变本加厉，利用奥巴马、希拉里执政期间对“伪共”采取姑息养奸的绥靖政策所导致的文明世界之失误， 越来越疯狂嚣张！\n\n“伪共”对内疯狂掠夺，故意制造比粮食浮夸风更加疯狂的地产浮夸风之泡沫，横征暴敛、 强拆抢劫、草菅人命；欺骗百姓缴纳各种费用，不断地对外大撒币，企图以支那蓝金黄之贿赂腐蚀文明世界的正义声音，以申纪兰式的举手机器之暴政，掩盖成千上万个杨改兰、赵鑫之悲剧！\n\n在文盲比例比“黄俄文革”大幅降低的时代，“伪共”冒天下之大不韪，竟公然企图复辟文革，大肆逮捕709律师，制造各种庞氏骗局，类似泛亚、E租宝等欺诈团伙逍遥法外，维权人士却频繁被失踪。 \n\n上帝要让其灭亡，必先让其疯狂！ “伪共”贪得无厌、嗜血成性，在各种畸形的掠夺泛滥成灾之后，“伪共”竟然妄图长生不老，大肆活摘人体器官，甚至将参与“人体器官”的特务间谍和医生专家全部跟随“马航空难”葬身大海！\n\n在瞒天过海的网络鬼墙GFW的铁幕封锁之下，“伪共”之疯狂最终达到极端变态之程度！ “伪共”黄俄蛆虫帮把贪得无厌的魔爪伸向他们的 “祖国未来的花朵”— 孩子的疫苗身上，在毒食品、毒奶粉造成巨大恐慌、激发强烈民愤之后，利用大量毒疫苗折磨孩子的大规模恐怖犯罪终于再也掩盖不住！\n\n于是，各地群众忍无可忍，革命的火焰此起彼伏！上海董瑶琼公开泼墨暴君，是革命接力赛的第一棒！深圳佳士工人建设独立工会的追求，是当代工人全面觉醒的开始！ 各地退伍军人的频繁维权，和各个阶层的维权抗争交相辉映，让士兵、司机、工人、教师、学生等各种群体的维权活动不断地融合起来，必将在21世纪激发一场史无前例的文明大变革！ \n\n这场文明大变革的主要特点是和平革命 — 是亿万百姓的维权意识在毒食品、毒疫苗等各种社会危机全面爆发的强烈刺激下的历史抉择 — 必然主动抛弃“黄俄”“伪共”“匿产帮”毫无人性的丛林暴政！ \n\n在毒食品、毒疫苗的强烈刺激下，越来越多的民众在抵制“伪共”暴政。 “伪共”暴政机器是一部毫无人性的绞肉机，对内可以绞杀林彪、薄熙来、陈小鲁等所谓贵族精英；对外输出有数千年历史的“太监”病毒，把“太监”病毒隐藏在“孔子学院”的文化伪装之中，加以各种或明或暗的金元外交、蓝金黄特务渗透，不断地腐蚀文明世界，但是在持枪权捍卫人权的现代文明底线遭到挑战之时，以美国为首的整个文明世界已经全面觉醒，坚决反击支那蓝金黄特务渗透！\n\n在各种内外因素的文明合力之下，一场波澜壮阔的和平革命正在展开。\n\n“伪共”对中国人民的迫害最残酷，因此中国人民抛弃“伪共”暴政的意愿也最强烈！ 但是，鉴于“伪共”是一个运作复杂的恐怖犯罪组织，抛弃“伪共”暴政也需要一个过程。“伪共”最高深、最隐蔽的“专政”手法是挂羊头卖狗肉 — 利用习仲勋等革命先辈稍有人性光辉的“共产党员”之历史优点，把习仲勋等人曾经追求过的“民主宪政”挂在“伪共”的专政旗帜上，实际上干的却是比纳粹大屠杀更险恶的“支那丛林暴政”。 \n\n习仲勋生前比较朴素廉洁，没有严重腐败的污点，为了彻底绑架习仲勋，“伪共”公然耗费巨资，给习仲勋打造一个习仲勋自己也会坚决反对的奢华陵墓。这种公然侮辱习氏家风的奢华式腐败，彻底地把习氏拖入大粪坑，只是为了延长“伪共”“黄俄蛆虫帮”的特权腐败，显然是非常愚蠢、无法持久的荒谬举动！\n\n只许习氏建豪华陵墓，不许基层百姓土葬，“伪共”这种邪恶嘴脸在针对死人也暴力强拆棺材、暴力推行火葬的丛林暴政中表现得赤裸裸、极端无耻、野蛮荒谬！鉴于“伪共”欺诈手法隐蔽，一直挂着1949年前曾经有过民主宪政追求的“共产党”的旗号，实际上是一群连官僚财产都不敢公开的“匿产帮”，为了最广泛地促进和平革命，有必要把“伪共”和“中共”区别开来。\n\n“共产”，顾名思义，既然财产都能共享，那么信息也自然也能够“共享”，所以“共产主义”必然不是反对宪政民主的，因为言论都无法自由、信息无法共享，哪里有什么“共产主义”？\n\n所以中国广大人民 — 包括退伍老兵、工人、司机、教师、学生等各个群体的共同敌人不是“中共”，因为从严格的逻辑来看，真正的“中共”在1949年后就消失了。 而习仲勋曾经具备的某些人性光辉，也被习氏豪华陵墓彻底地玷污了！ 所以，真正的“中共”已经不存在，至少在中南海是早就已经不存在了！\n\n“全民共振”的一些理论家们，对于“全民共振”的理论指导比较详细，但是对于这个战略层面的目标界定，没有区分“伪共”和“中共”，是有点缺漏，需要予以完善。\n\n很多人关注的“全民共振”，属于中华复兴、文明变革的一个重要环节。和平革命，大体包含三个环节：标语革命、独立工会革命、民变兵变。这三个环节，简称和平革命三部曲。\n\n+ **1) 标语革命 — 把反对目标界定为一小撮“伪共”“黄俄蛆”，与基层党员无关！**\n标语口号涉及战略性的运作。目前在一些地方出现的标语是“推翻中共”，消灭毒食品、毒疫苗等乱象的根源。鉴于真正的“中共”在中南海已经不存在，但是基层确实还存在部分不怎么贪污、有点类似习仲勋那样的党员，而“伪共”头目也是挂着“共党”的旗号去绑架数千万党员，为了尽量减少潜在的冲突，让体制内的受害者也加入和平革命的运动，建议标语中“推翻中共”的内容改为“推翻伪共”，或者是“抛弃伪共”，完整的口号可以是“全民行动、抛弃伪共，恢复选举、恢复宪政、恢复中华！”\n\n说简单一点，和平革命的目标根本不是鼓励通过暴力推翻“中共”。在大众维权意识已充分觉醒的历史阶段，和平革命的目标是提醒各个阶层的群体，要避免像陈小鲁、王健、雷洋、赵鑫等被消失的人祸，必须恢复选举，恢复习仲勋等先辈在1949年前曾追求过的民主宪政。如果没有正常的选举和被选举权利，没有民主宪政，诉求短期利益的维权抗争很难得到正常公民应有的人权尊严保障。\n\n泛亚、E租宝、访民、冤民等不追求公民选举权，却指望“伪共”的某些头目能够突发善心，就能够从根源上解决他们的正当利益诉求，并且不会违背承诺搞秋后算帐的报复，这种目光过于短浅的投机式维权，很难促进中华文明的全面复兴，也不利于保障维权群体的所有个体之利益！\n\n要真正地做好维权工作，就不必频繁地搞进京维权之类的活动。相反，每个地区的维权群体都应该扎根本地， 努力实现共同的根本目标 — 恢复选举权，把最简单的大口号“全民行动、抛弃伪共，恢复选举、恢复宪政、恢复中华”发布到所有人流量比较大的地方，包括医院、学校的厕所，公交车站的大幅广告牌等；大口号后面可以跟着其它具体诉求的细节内容，比如：\n“抛弃伪共，恢复选举、恢复宪政、恢复中华！消灭毒食品、毒药品、毒疫苗等乱象根源！” \n“摒弃伪共，恢复选举，恢复宪政！彻底解决退伍老兵维权问题！”\n“抛弃伪共，恢复宪政！彻底解决医疗、教育、地产浮夸风乱象！ ”\n… … \n\n民众怒气达到顶点，而黄俄暴政恰好面临内外交困的格局。在标语落实到大范围的公共角落后，任何一个地方的群体运动，会迅速地传播到其它地方，很快形成多个地方全民共振的连锁效应！ \n\n+ **2) 独立工会革命**\n与泛亚、E租宝等那些追求短期利益的维权群体相比较，深圳佳士工人追求独立工会的运动， 更加符合长远的正义诉求，更有利于促进恢复宪政、恢复中华的文明变革，因此“伪共”“黄俄蛆”更加惧怕那些有长远正义诉求的正义人士；他们对追求独立工会的工人也更加野蛮、更加残酷。\n\n但是在亿万百姓不断觉醒，美国正义力量坚决反击的大格局下，无论“伪共”“黄俄暴政”如何疯狂，“伪共”“黄俄蛆”都必然被扫进历史垃圾堆！\n\n在当前，深圳佳士工人建设独立工会的追求，必然促进更多地方的工人运动之汇聚！而每个地方的标语革命之宣传，只要落实到位，很容易与独立工会的运动互相照应，形成共振局面。\n\n+ **3) 民变和兵变**\n基层士兵都来自基层百姓，兵民本一家。很多地方经常出现退伍老兵维权，充分说明多数群众极度厌恶对外大撒币、对内敲骨吸髓的黄俄暴政。但退伍老兵们短期利益诉求不断地受挫后，很快就会明白，要像独立工会那样，建立独立的退伍老兵联盟，恢复选举权、恢复宪政， 才能够落实退伍老兵的长远利益保障。\n\n上述的标语革命之一：\n“摒弃伪共，恢复选举，恢复宪政！彻底解决退伍老兵维权问题！”\n就是彻底解决退伍老兵维权的长远之道。\n\n上述细节为和平革命三部曲，也可以说是全民共振的三要素。\n\n另有一些其它的因素需要注意，保持警惕的同时，还要设法解决。比如：\na) 郭文贵病毒 \n随着时日拖延，郭文贵各种反复无常、自相矛盾的乱象表现得越来越明显。\n\n在郭文贵2017年非常有力地抨击“伪共”“匿产帮”为“支那蛆”之后，令人哭笑不得的是，郭文贵居然又很快向中南海的领袖习某人写信，表示服软，并且乞求“伪共”施舍给他公平谈判的机会，只要有机会谈判，什么交易他都会愿意谈。\n\n“伪共”“匿产帮”里那些魔王级别的老蛆王可不是吃素的，它们向来是欺软怕硬之徒。印度已经用铁的事实和赢钱的代价，向世人证明，只要对于支那国来点硬的、狠的招数，那些靠“菜刀实名制”才能勉强维持自信的“伪共”“匿产帮”立刻就会服软，乖乖送上金钱，并且会变得像服从它们的五毛党太监一样，对外极为“文明”，很有天朝“礼仪”风范。\n \n在八字还没一撇，全民抗争的风浪都没有掀起的时候，郭文贵居然把自己想象为梁山泊的宋江，想立刻跟天朝谈判、勾兑。这种软弱的心理，被“伪共”蛆王们完全看透，于是欺软怕硬的“伪共”匪徒自然是变本加厉，以加剧酷刑折磨郭文贵家人，试图进一步加剧郭文贵身上的支那太监病毒，让郭文贵在支那太监病毒和维权意识的剧烈冲突之中，不断地让深谙金融投机、没有道德底线、没有政治原则、但有特工技能和抗争精神的支那太监异类郭文贵在自相矛盾中不断地出错。文贵出错越多，时间拖延越久，他被历史淘汰的可能性也就越大。\n\n郭文贵的最大败笔：一方面企图当太监，另一方面又想当维权公民。郭太监为了朦胧的公民意识而艰苦维权的奋斗值得鼓励，但是郭太监企图以援郭会名义捆绑海外华人，让所有华人都跟他一起当太监的邪恶企图必然失败。因此，挺郭必须砸郭，只有砸烂郭文贵的太监糟粕，才能砸出具有现代公民意识的郭文贵新公民！\n\n本来郭文贵自己一个人想当太监，那也无可厚非，但前提必须是，太监郭文贵不得以黄俄特务的身份到处污蔑真正追求“民主自由”的正义人士。\n \n但遗憾的是，郭文贵自己一个人想当太监，企图以太监的身份与“伪共”“匿产帮”勾兑， 似乎又经常遭受挫折。郭文贵的政治觉悟和政治智商接近于零，郭文贵自己一个人当太监， 当不成，正确的做法应该是，彻底抛弃太监思维，坚决彻底地与广大民运人士携手努力，那才是正道。但郭文贵反其道而行之，不但威胁已经解体的挺郭后援会的部分民运精英，而且不断地污蔑“全民共振”，到2018年中，甚至公开污蔑追求民主自由的万众瞩目的董建彪、董瑶琼父女、华涌等正义人士。\n \n郭文贵这只因为没有权贵背景而遭受“伪共”迫害的黄俄蛆虫，政治觉悟和政治智商接近于零，目无法治，在美国试图以麦卡锡的手法颠倒是非、混淆黑白，藐视美国法治，玷污自由女神，如此邪恶的黄俄蛆虫郭文贵，必然要遭到美国法律的惩罚，遭受历史的惩罚，并最终遭到广大人民群众的唾弃！\n\nb) 太监糟粕和文明转型 \n郭文贵为了个人私利，可以公开地把复辟文革暴政的暴君称颂为“千年圣君”。 与郭文贵比较，泛亚、E租宝、退伍老兵等群体诉求短期利益的维权，虽然没有郭文贵表现得那么夸张，但是要实现长远的正义诉求，就应该效仿深圳工人的维权方式，扎根下来，追求独立工会、老兵联盟、维权联盟等能够落实长远利益的宪政大道，恢复选举、恢复宪政。\n\n在当前的时代格局里，台面上的习近平只是个傀儡，反习与否是次要的逻辑。促进全局运动的纲领性口号，辛灏年、袁红冰等民运前辈主张“恢复民国”，值得参考，这个口号与“恢复宪政、恢复中华”也不冲突。 “恢复宪政、恢复中华”与真正的“反共”分子不冲突，与一些热衷于复辟毛泽东思想的毛左派也没有太大的明显冲突，因为毛泽东本人是比郭文贵更加复杂得多的人物，毛在1949年前搞过宪政，虽然只是表面化的宪政，但毕竟在舆论层面大力宣传过，甚至搞过黄豆选举。 相对而言， “恢复宪政、恢复中华”是比较中性的口号，是能够容纳各种群体运动的战略口号。\n\n美国宪法制定者之一、近乎圣贤的杰弗逊，看透人性之复杂多变，知道人类的最大敌人就是自身的贪婪，而克制贪婪的有效方式，就是推行持枪权捍卫真理的法治规范。无数的历史也说明，舞台上的政客们，多数是骗人的。\n\n有人主张“新加坡模式”，如果他们真心地捍卫“新加坡模式”这个真理，那么，为了长久地维护这个真理，就应该推行持枪权捍卫“新加坡模式”。如果他们不敢，那么李光耀家族再狡猾聪明，也难以保障“新加坡模式”的持久运作。\n\n只要有持枪权捍卫真理的基本原则，类似古拉格群岛、支那浮夸风之类的大规模人造灾难都很难发生。即使时间倒流，毛泽东、斯大林复活，在美国，他们所能掀起的最大灾难，也很难超过麦卡锡运动所造成的冲击！\n\n简单归纳，大道至简：民主的核心原则不只是选票论道，而是持枪权捍卫真理！\n\n既然枪支的火药来自于中华文明，因此重振美国就是“振兴中华”，真正的中华文明，在海外才有 —— 美国文化是吸收了中华文明之后，反而比赵宋王朝更加规范地传承了儒家文化的“核心理念”，与“己所不欲、勿施于人”的普世原则相对应的，是对自由的规范—正当的自由是“不侵犯别人的同等权利的自由”(freedom without violation of other people's equal rights)。\n\n和平革命三部曲，是为了解决黄俄“伪共”暴政造成的障碍而必须面对的环节，和平革命三部曲，最终目标是为了建立一个尊重持枪权、尊重生命的文化体系，推行持枪权保障人权、持枪权捍卫真理的现代文明基本规范，这也是最朴素的普世原则。\n\n没有“持枪权” 的民主自由是跛脚的，容易被希特勒、斯大林、麦卡锡等政客们颠覆。真正的普世价值需要“持枪权捍卫真理”的“普世原则”来保驾护航，在郭文贵乱象引起越来越多人们关注的时代，中华文明能够在重振美国的文明征程上重返东亚大陆，坚守“持枪权捍卫真理”的“普世原则”，推动世界的持久和平！\n\n+ **c) 营救董瑶琼符合“重振美国”的战略，更是在维护“自由女神”！**\n董瑶琼泼墨暴君，不等于泼墨“中共“，因为像习仲勋那样真正有信仰的“中共”党员，不但会反对“文革”，更会反对暴君终身制的“文革余孽”。所以，董瑶琼泼墨“暴君”，实际上是在帮助习氏恢复习仲勋曾有过光辉形象的历史光环，但习孽智商比郭文贵更低，根本不懂得珍惜习仲勋的历史光辉，只会在历史耻辱中带领“伪共”“匿产帮”堕落到地狱！ \n\n泼墨暴君、恢复仲勋光辉、清除习氏败类，与一些宪政派毛左建立新党的追求也是吻合的，或者说，至少没有大冲突。\n\n董瑶琼惊天一泼，吓得习近平头像全国撤下。这个最简单的事实说明，董瑶琼无意间为大家找到了火山口的爆发点。既然爆发点找到了，火山岩浆就会往火山口汇聚。郭文贵配合“伪共”“匿产帮”抹黑、掩盖事实，就是试图掩盖火山口，保护他们通过专政特权掠夺到的各种利益。\n\n假如特务头目们有能力故意地策划出火山爆发口，在老兵维权时，他们早就策划出兵变和民变了。因此董瑶琼惊天动地的壮举，绝对不会是特务们的策划。\n(另外，已有网友证实：董瑶琼 被“精神病”，但实际上是政治犯！)  \n\n泼墨暴君、向往自由，符合自由女神所代表的价值观。 任何公开侮辱自由女神价值观的言行，都必然会遭到大众的反击，也必定遭受法律的严惩！\n营救董瑶琼也是拯救我们自己，符合川普总统“重振美国”的战略，符合中华传统“己所不欲、勿施于人”的朴素理念；同时，更重要的是，这种努力，也是在维护“自由女神”所代表的神圣文化！\n\n在当前，以和平革命的方式，坚决反击“黄俄专政病毒”，就应该推动标语革命、独立工会革命、凝聚遍布各地的怒火，触动火山大爆发，在全局性的民变、兵变的历史格局中，人民群众必然抛弃造孽深重的“伪共丛林专政”，在“重振美国”的世界格局中，重铸中华文明！",
			"added": 1534693503
		},
		{
			"topic_id": 6,
			"title": "時代革命的新方式New Approach to Hong Kong Peace Revolution",
			"body": "http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/ \n\n大規模的和平變革，可以採用更靈活的方式： \nA new way to promote Peace Revolution 光復香港、時代革命的新方式 \n可以大規模地促進大陸和香港的良好互動。",
			"added": 1596341531
		},
		{
			"topic_id": 7,
			"title": "更灵活的时代革命 Flexible Way of Hong Kong Revolution",
			"body": "http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:4_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/ \n習仲勳 恰巧反對文革暴政，習氏孽障即使再無法無天，也不敢公開污蔑維護習氏祖宗光輝的活動是違法的！ 和平的方式可以更靈活；\n該暴力反抗的，就該由勇武派成立鋤奸隊，針對匪幫頭目，進行定點鋤奸，為最佳。",
			"added": 1596341641
		},
		{
			"topic_id": 8,
			"title": "关于V2Ray、翻墙梯子、ShadowSocks、Psiphon等工具…",
			"body": "现在很多工具不稳定，好用的工具不多。需要了解这方面信息的朋友，请发电邮到 \npearlpeace@tutanota.com \n\n细节见以下链接：\nhttp://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1632632503_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/Old+Topics \n\n如果是其它更先进的工具，请另外电邮交流，或者在FlyChat的自由世界里探讨吧。",
			"added": 1598251166
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"6_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e": [
			{
				"comment_id": 1,
				"body": "至于称呼中国百姓为“支那人”。“支那人”在鲁迅时代是中性词，一些人如果认为是贬义词，那么为了维护支那特色的伟光正，就应该推动持枪权捍卫真理的原则，真正地捍卫“华夏公民”的基本尊严，捍卫华夏民族的基本人格！！",
				"added": 1510363319
			}
		],
		"1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9": [
			{
				"comment_id": 2,
				"body": "http://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1632632503_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX/Old+Topics ",
				"added": 1514980950
			}
		],
		"2_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e": [
			{
				"comment_id": 3,
				"body": "燃教的信息有点灌水的迹象，建议予以适当的提醒。\n允许言论自由，但是言论自由是有规范的。没有规范的乱灌水的信息，那就不是言论自由，而是言论层面的自相残杀，与支那式的丛林内斗没有太大区别。\n站点管理员如果纵容乱灌水的帖子，那就是在糟蹋自己的站点，类似NewGfwTalk那样，五毛党的信息太多，最终效果适得其反，无法聚集人气。\n应该珍惜零网，不该乱灌水，对于乱灌水的ID，予以封禁，是对的。建议各个零网的管理员都学习新零网中文站的管理风格。\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/",
				"added": 1520438056
			}
		],
		"3_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 4,
				"body": "明白了。这样可以减少不同站点的重复发布了。",
				"added": 1520441739
			}
		],
		"4_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx": [
			{
				"comment_id": 5,
				"body": "hdhz网友有刷屏迹象，请网友们注意。即使管理员没空，也不怕。刷屏的信息可以自主屏蔽。\n**[零网用户拥有准管理员的权限 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1END5A3waFfWMTk2DkPDx83CXaYzpnj788/)**",
				"added": 1521080931
			}
		],
		"2_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 6,
				"body": "Something strange happened ?",
				"added": 1532700403
			}
		],
		"1_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 7,
				"body": "自由论坛是个好站点。一些人平时虽然不怎么发布观点，但是对于各个层面的新信息，是一直在关注哦。",
				"added": 1532921700
			}
		],
		"4_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 8,
				"body": "对于中国人是否关心政治，网友有经典论述：\n如果中国人不关心政治，中共为什么要封网？如果中国人不关心政治，中共为什么要打压民运人士？如果中国人不关心政治，中共为什么要重兵镇压群体事件？不是中国人不关心政治，而是独裁者不让百姓关心政治！\n\n 在独裁者如此严厉封锁的情况下，甚至连邓小平的残疾后代邓朴方都对终身制的暴君感到厌恶，而体制外更是有越来越多人觉醒，文明变革，势不可挡！",
				"added": 1532922297
			}
		],
		"6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 9,
				"body": "For people in East Asia where abnormal data blockade often occurs, the flexible ways can help reduce the obstacles.\n**[Great Awakening ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1634708439_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Great+Awakening)**",
				"added": 1634708938
			}
		]
	},
	"comment_vote": {}
}