{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Web-chat encriptado",
			"body": "Los mensajes del chat se encriptan utilizando la encriptación de Vision, pero los comandos del sistema, como el de entrar en la sala, no se encriptan.\nAl mismo tiempo, sólo se almacenan en el servidor los hashes de las conexiones y la lista de salas de los datos.\n\nEl nombre de usuario para el chat se genera aleatoriamente, puede ser cambiado en el futuro por el mismo aleatorio, sólo el nombre y el nombre de la sala son suficientes para la autorización en el chat.\n\nPor defecto, al entrar en el chat, se instala la sala \"PRINCIPAL\" y la clave de cifrado \"por defecto\", puede cambiar estos datos utilizando los formularios de entrada correspondientes.\nCuando cambias la clave de encriptación, la interfaz te pregunta \"¿Ofrecer esta clave a los miembros del grupo?\" Si te niegas, la clave será cambiada sólo por ti, y si aceptas, entonces todos los miembros del grupo que actualmente tienen la misma clave de encriptación instalada que tú intercambiarán claves usando el protocolo Diffie-Hellman. Al mismo tiempo, todos ellos recibirán tu clave, pero aceptarla o no queda a su discreción. Parece un mensaje del sistema con un botón de \"Aceptar\" que dice que un usuario con tal o cual nombre te ofrece su clave de cifrado. Además, si varios usuarios ofrecen su clave de cifrado, los usuarios pueden aceptar cualquiera de ellos e incluso cambiar libremente entre ellos.\n\nLos usuarios con diferente encriptación reciben un texto ilegible entre ellos.\n\nCuando la conexión con el servidor se desconecta, el chat intentará volver a conectarse, para ello se realizan 10 intentos, con un intervalo de 3 segundos.",
			"added": 1636480381
		},
		{
			"topic_id": 2,
			"title": "Chan",
			"body": "Nuevo chan:\nhttp://127.0.0.1:43110/17aXbeKjJXgqnzdbtptUcLo9cNeCTqc79K/",
			"added": 1636488953
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_17um7PR1kBcpsubiDZi7Be7uP6HYDFjyyV": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/1JgLoF6DTW7CKEgF3qewtDVsMvZ2cnf7Tb/",
				"added": 1636480440
			}
		]
	},
	"comment_vote": {}
}