{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "李克强狠抽自己嘴巴：  今年两会，李克强在政府工作报告中吹牛，2018年将减税降费超1万亿元。实际是，仅上半年就加征了1万多亿税收。  政部公布，上半年全国一般公共预算收入104331亿元，增长10.6%。其中税收收入91629亿元，同比增长14.4%。  这不是个骗子政府是什么？",
			"body": "李克强狠抽自己嘴巴：\n\n今年两会，李克强在政府工作报告中吹牛，2018年将减税降费超1万亿元。实际是，仅上半年就加征了1万多亿税收。\n\n政部公布，上半年全国一般公共预算收入104331亿元，增长10.6%。其中税收收入91629亿元，同比增长14.4%。\n\n这不是个骗子政府是什么？",
			"added": 1534092072,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "吃雞神片★中文有碼无碼合集",
			"body": "吃雞神片★中文有碼无碼合集\nhttps://send.firefox.com/download/f1c838a315/#oU9a3jQPXTutnNKph-vKsA",
			"added": 1534173164,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "【影片名稱】：モデルコレクション 碧木凛",
			"body": "【影片名稱】：モデルコレクション 碧木凛\nAugust 29, 2018\n【出      演】：碧木凛\n\n【影片格式】：mp4\n\n【影片大小】： 1.77GB\n\n【影片時長】 :01:02:26\n\n【是否有碼】：無碼\n\n【品      番】 :032417_504-1pon\n\n【影圖預覽】：\n\nhttps://telegra.ph/%E5%BD%B1%E7%89%87%E5%90%8D%E7%A8%B1%E3%83%A2%E3%83%87%E3%83%AB%E3%82%B3%E3%83%AC%E3%82%AF%E3%82%B7%E3%83%A7%E3%83%B3-%E7%A2%A7%E6%9C%A8%E5%87%9B-08-29",
			"added": 1535558027,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "又一中国科学家对共谋盗取美商业机密认罪",
			"body": "涉嫌共谋窃取国际医药公司葛兰素史克制药机密案的第二位中国科学家星期五在费城联邦法庭就一项共谋罪向联邦检察官认罪。据美联社报导，两个星期前，曾在葛兰素史克位于费城的研究机构工作约10年的国际顶尖的蛋白质生物化学家、48岁的癌症研究员薛宇（Yu Xue）已经认罪。薛宇被指控共谋盗取公司商业机密，并转给由薛宇、李涛和梅燕（Yan Me）在中国成立的药物公司。后者在中国南京创办的任诺药业有限公司，受到中国政府的资助，研究和开发抗癌药物，声称将在几年年内推出第一批产品，创造利润过亿。",
			"added": 1537193331,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "在全民昏睡的危楼里，没有人值得拯救",
			"body": "在全民昏睡的危楼里，没有人值得拯救\n在全民昏睡的危楼里，没有人值得拯救？\n文|左手墨迹\n\n作为文化旗手，鲁迅先生无疑是超越时代的，在那个推翻一切旧思想旧制度的时代，各路名家里手都在呼吁人们反抗，也呼吁女性反抗传统走出家庭，只有鲁迅看到了，就算醒来，人们也未必有路可走。正如他在《娜拉走后怎样》中所言：“人生最苦痛的是梦醒了无路可走，做梦的人是幸福的，倘没有看见可走的路，最要紧的是不要去惊醒他”，就像电影《危楼愚夫》，明明知道楼要塌，明明告诉所有人，可就是谁都救不了，因为没有政府安置，醒了也无路可走。\n\n朋友圈总是能看到题目为《在全民昏睡的危楼里，没有一个人值得拯救》的关于《危楼愚夫》的影评，每次看到这样的题目我都感觉哪里不对，直到昨天看完这部电影，才明白到底哪里不对劲。\n\n电影讲述的是住在危楼里的瘾君子，因为找不到自己私藏的钱，而去家暴自己的妻女，在家暴妻女的时候卫生间水管突然爆裂并导致整幢大楼出现裂缝倾斜和地基移位，这个危险被前去修水管的主人公迪马发现，并将其告诉正在开豪华派对的市长和其他市政高官。高官们做的第一件事是，发现危楼安置的预算严重超出财政预算，便为各自贪腐而相互埋怨，然后才让消防局长和城建局长去现场勘查。勘查后得出的结论是，住着820人的大楼已经严重倾斜摇摇欲坠，一天之内必会倒塌，但市长却因为找不到安置房放弃对这820人的营救，并要杀掉知道真相的消防局长、城建局长还有前去报信的主人公迪马。\n\n在即将被杀的最后一刻，城建局长和警察杀手放走了迪马，并告诉他，如果再看到他还会杀了他。迪马连忙回家收拾行李带让妻儿逃亡，在跟家人商量后，他决定自己去疏散危楼里的人们，结果逃出来发现大楼没有立刻倒塌的人们，狠狠的揍了迪马一顿后又各自上楼了。\n\n面对这样的剧情，很多人都甩出了那句“在全民昏睡的危楼里，没有一个人值得拯救”的抱怨和愤怒，可是整个社会贪腐作假，人们不能靠劳动致富，医疗养老教育得不到基本的保障，人人偷盗不劳而获，像迪马父亲那样不作恶，默默无闻做好事的人却被认为是傻子，没有人愿意与之结交，就连妻子都抱怨他；整个社会秩序被颠倒，医院的免费抗菌素被拿出去高价倒卖；养老金社会救助金被掏空；交通等公共产品都是豆腐渣；警察局变成了黑社会；毫无必要的设施却被政府大量采购更新；富人高官子女都移民欧美，整个社会充斥着绝望。试想在这样一个自生自灭的社会，人连基本生存都无法保证时，周围充斥着愚昧暴力赌博和冷漠时，就算他有求生的本能，也是很容易自暴自弃的，这是他们的错吗？\n\n他们当然有错，但他们的错是结果，制度和文化才是根源！社会上的中坚力量都是从八九十年代走过来的，包括该市所有高官都是，他们在黑暗中长大，在恐惧中长大，在权力无所不能的社会中长大，即使苏联解体（《危楼愚夫》是俄罗斯电影），但白色恐怖嵌入人心的恐惧和伤害，不会因为庞然大物的瞬间崩塌而立刻散去，它依然会在人们心里生根发芽，形成某种观念，最后以政治制度的方式体现出来，就是危楼愚夫里贫穷愚昧的俄罗斯，偷盗互害的俄罗斯，贫富悬殊的俄罗斯，毫无安全保障的俄罗斯，频繁动荡的俄罗斯，充满绝 望的俄罗斯，谁才是罪魁？！事实上没有一个人有能力将一个帝国拖到悬崖边，除非一群坏人去骗一群蠢人，众人合力共同滑向万劫不复之地。\n\n\n\n很显然电影中迪马的爸爸是那个没有帮忙作恶的人，而迪马却是那个以一敌众，预挽大厦于将倾的人。但他一个人都没救到，所以人们发出那种“在全民昏睡的危楼里，没有一个人值得拯救”的哀怨，可是我想问问你们，难道因为愚昧群众对良善之行不领情，扬善行善就不重要？！难道没有人重视真相，真相本身就不重要？！如果良善不重要，真相不重要，那我们为什么还要歌颂那个戳穿皇帝新装的小孩，赞美拯救犹太人的辛德勒，向往飞跃高墙的银行家？！因为我们总是在向往飞翔的时候，被自己的实用主义绊倒。\n\n《在全民昏睡的危楼里，没有一个人值得拯救》能够经常刷屏也是因为大多数人的认同，在这篇怨文里，人们都在抱怨愚昧的人不值得拯救，却没有人发现冷漠的自己其实也是罪恶的帮凶。记得电影中，妻子要迪马放弃那些无关紧要的人，希望迪马带着自己和孩子逃亡的时候，迪马说：“我们活的像动物，死的像动物，因为我们对于对方都无足轻重”。他不想再这么像继续像蛆虫一样扭曲的活着，所以他选择留下，即使明明知道没有官方的命令和文件，没有人会听他的，但他还是奔向危楼，每家每户的敲门劝他们离开。\n\n我一直在想，假如那个人是我，面对陌生的毫不领情的同胞，还有随时可能找到并杀了我的警察还有我熟睡的孩儿，我可能也会留下，因为我不想他也像我一样，每天生活在恐惧之下，过着扭曲的一生。即使我什么都改变不了，但我在那样做的时候内心是无愧的，而不是时时从噩梦惊醒，常常为自己的懦弱而悔恨不安。我希望把正义的种子播撒到孩子的心里。\n\n肮脏的世界不会有圣徒，如果还有，那一定是像迪马这样身体力行的闪耀着人性光辉的人。",
			"added": 1537194440,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "全灭途中：一半死刑，一半侥幸",
			"body": "昨天关于公积金的新政，点燃了不同人心中不同的火焰。\n\n大多公开发表的文章都在说，刚需被一招毙命：真正需要房的人，买房从炼狱难度，变成了不可能。\n\n而在私下讨论时，见到的却是另一个维度。这个维度不涉及我们，只有你和我，只有我买到了，你没买到，你死，我活。\n一个小的群体，一半买房的，一半没买的；一半在庆幸，一半在愤怒。\n\n身边有人在问：这个公积金新政，你们有没有很庆幸？\n刚买房的答曰：太有了！\n又问：不知道你没买房的师姐是什么感觉？\n答曰：凉凉了呗。\n\n这个世界上，所有的心存侥幸和幸灾乐祸，都如出一辙。\n好坏对错，无关紧要，只要刀还没有砍到我的头上，就可以偷着乐呵。\n\n这让我想起了那几句话：\n\n当他们杀害犹太人时，我没有出声，因为我不是犹太人；\n当他们杀害共产党人时，我没有出声，因为我不是共产党人；\n当他们对我动手时，已经没有人愿意为我出声了。\n\n感慨最近情景，补充几句：\n\n当他们收割股市韭菜时，我心存侥幸，因为这只是炒股之人的死刑，与我无关\n当他们洗劫创投公司时，我心存侥幸，因为这只是投资公司的死刑，与我无关\n当他们对公积金动手时，我心存侥幸，因为这只是没买房之人的死刑，与我无关\n\n可以想见：\n\n如果有一天，对养老金、医保动手，我依然可以侥幸，因为那只是老人、病人的死刑，与我无关\n如果有一天，对女人、对幼儿出手，我依然可以侥幸，因为那只是女人、小孩的死刑，与我无关\n终于有一天，对幸存者出手了，幸存者依然侥幸，感谢组织让同辈们先死，感谢让我活到了最后",
			"added": 1537195221,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}