{
	"title": "TheCuriousNerd",
	"description": "Game Dev\nI Find Everything Interesting\n\n[My Website On the Internet](https://thecuriousnerd.com/)\n\n",
	"links": "**Bitcoin:**\n_`191Ft74PbnaTDT5QZguq1HS9G8MKruvz64`_\n\n**Ethereum:**\n_`0x34DE0330ba2CD4030bBbFE9B46D31DeFeE1ffa54`_",
	"next_post_id": 7,
	"demo": false,
	"modified": 1533866499,
	"post": [
		{
			"post_id": 5,
			"title": "My Current Project",
			"date_published": 1533029010.746,
			"body": "So lately I've been thinking about the polarization of the world today.\n\nThis has lead me to wonder about possible solutions to this. There is a few interesting things out there. Which ultimately brought me to an interesting project which if successful could help with this issue."
		},
		{
			"post_id": 4,
			"title": "Project Ideas",
			"date_published": 1492667040.723,
			"body": "I have been thinking about things that could be made on here which people could enjoy. I have been mostly thinking that games would help with that. The games I would consider working on would be chess or go/baduk. Though If I had to make one first it would likely be go/baduk.\n\nI think I would first make a page about the game and build from there."
		},
		{
			"post_id": 1,
			"title": "Hello World!",
			"date_published": 1492617379,
			"body": "Hello my name is Alex, and one of the first things you should know about me is that I’m highly curious about everything. Although the things that grab my attention most are things involving technology, the sciences, and of course art.\n\nCurrently I teach parkour and work on various projects. One thing in particular that I’m working towards is becoming a game developer.\n\nI’m also highly interested in language and I speak English, Polish, and know American Sign Language. I eventually plan on learning several languages which hopefully I plan on accomplishing.\n\nThe first computer that I had access to was a HP windows 95 when I was 2 years old.\n\nWhen I went to kindergarten I ended up learning how to use a Macintosh ii. A few years later I gained internet access on a windows 98 machine(whose password I figured out thanks to the web) and I was blown away. I suddenly had access to basically anything at my fingertips. The next several years with technology was mostly spent gaming on consoles until my family got a better computer. This opened up a plethora of games the the RTS’s Warcraft/Starcraft, or the Myst series (Shorah to my fellow uru players).\n\nI soon then started to play mmo’s first with World of Warcraft, then Dungeons and Dragons online, and then EVE online. I currently have a wow sub and Final Fantasy XIV sub. These days I may not find too much time for gaming as I am usually focusing on working on getting my projects out the door but I do try to stream or my social media with things I find interesting."
		}
	]
}