{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1579271298,
			"title": "question about file hosting",
			"body": "i was wondering what the best way to host files on zeronet would be.  I dont want to include files with my zite because then viewers would be downloading them whether they wanted to or not and additionally it would significantly increase the size of the zite.  I also want to use a decentralized method so that files cant easily be censored.  Does zeronet offer any good options to do this? I know there are zites like zeroup that will do this but im not sure if that is better than using bittorrent and a magnet link.  Also if anyone knows of an anonomous method of hosting the files that would be awesome but not necessary . Thanks :)",
			"added": 1579271297
		},
		{
			"topic_id": 1583449441,
			"title": "Can time keeping be achieved in zeronet?",
			"body": "I was thinking about how a messaging platform where messages expire and are removed after a set amount of time would work on zeronet.  i can't figure out how to keep track of time though.  my best idea is to have each post timestamped based on the poster's computer time and from there a central server would continuously check each post and remove ones that have been online past the set expiration date and then push out a new version of the zite.  although this relies on a central server, if the central server were to go offline, the only affect on the zite would be that the old messages are no longer removed.  I dont know if zeronet can use a computer's time to timestamp a post or if a central server could remove expired posts though.  i thought about having a buffer where only a set amount of posts are allowed to be \"online\" but someone could just spam posts and push out real posts.  does anyone else have any ideas?\n",
			"added": 1583449439
		},
		{
			"topic_id": 1589638544,
			"title": "content signing failed, content too large?",
			"body": "does anyone know how to resolve this error?",
			"added": 1589638541
		},
		{
			"topic_id": 1589825556,
			"title": "80% Glock build",
			"body": "Reposting because someone threatened to block my zite if i didnt add a description. just kidding, i aint nobody's bitch, i just thought i should add some more details about my zite so that people arent blindly clicking on a link.  This is an 80% glock 26 compatible kit that i built.  Its not a tutorial, just an overview of the project.  The special thing about 80% firearms is that they arent considered firearms until you put the finishing touches on them.  That means that the government (excluding some states) doesnt and cant track them.  Since they are not firearms they are not required to have a serial number when they are sold and you are not obligated to serialize or report them to the government when you build them.  They require no special license to build, the only caveat being that you do not build them with the intent to sell them.  Additionally, since they are not firearms, just chunks of plastic or metal, you can get them shipped straight to your door.  The only part of a firearm that is considered a firearm is the lower receiver which is what is the \"80%\" part that you must complete the last \"20%\" of to make it into a firearm.  The rest of the parts are unregulated and can be freely bought and sold.  These are commonly referred to as \"ghost guns\" because they cannot be tracked by the government.  This is a good thing though as it prevents the government from knowing who they can take firearms away from if they wanted to.  Canada recently banned many types of firearms that were on a registry which means that the government knows exactly who has them and therefore they can effectively enforce the ban.  This is related to zeronet if you look at the problem from a censorship perspective.  If the government tries to censor firearms, they cannot effectively do that if they dont know where to look for them.  Zeronet exists to avoid censorship by preventing anyone from being able to shut down the spread of information easily.  I only speak about 80% firearms according to United States law, other countries may have other laws concerning them.\nhere is my zite: \nhttp://127.0.0.1:43110/1LPTwy3E2sQThsiuDJpo6PdmQbLbUsq5kA/",
			"added": 1589825551
		}
	],
	"topic_vote": {
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1583449441_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": 1,
		"1582469629_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1,
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1,
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1589825556_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": 1,
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1578981843_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 1,
				"body": "i think the best option is to ban them individually.  a ban by \"admin\" is called censorship, something that this platform was created to evade....",
				"added": 1579271372
			}
		],
		"1578781307_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "i agree",
				"added": 1579271493
			}
		],
		"1579271298_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 3,
				"body": "> [aassddff](#comment_10_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): What lianna said, but i recommend using a folder instead:\"optional\": \"media/.*\",\n\nso if i do this, will that host the entire \"media\" folder or would it allow people to pick which of the files in the \"media\" folder that they wanted to host.  This would also mean i would have to include a notice that indicates that in order to download a file one must choose to host it and then go into the zite's folder and find it there right?",
				"added": 1579282088
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1805_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): there is 'no cornovavirus'  fuCking idiothow 'you people' can 'be so dumb' while 'i'm so intelligent'. [...]\n\nyou 'ARE' not intellegent, AI is 'not' intellegence, rather it is 'StUpIdItY'",
				"added": 1580309203
			}
		],
		"1583450778_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 5,
				"body": "no",
				"added": 1583460436
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_1839_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Strip naked and turn on your webcam (if 18+). [...]\n\ncomes at the cost of your time",
				"added": 1583532498
			}
		],
		"1582469629_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 6,
				"body": "Saluton!",
				"added": 1583532427
			},
			{
				"comment_id": 8,
				"body": "> [jft](#comment_2_1GK9oMGVJgBXnn8XmX9Jn98jnWn5jQgwUc): ĝi estas eksperimentohttp://127.0.0.1:43110/1AgogHwQ4uqRshee5ZvhAEWKEDBSp4VzAn/?Home\n\nĉi tiu retpaĝo ne funkcias por mi",
				"added": 1583533394
			}
		],
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 9,
				"body": "i cant seed it, no peers found :(",
				"added": 1583791726
			},
			{
				"comment_id": 10,
				"body": "still cant find any peers for either of the zites, could it be something wrong with my trackers? @zeroseed @ 4202",
				"added": 1584700909
			}
		],
		"1585269932_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 11,
				"body": "i think that we no longer need such large machines.  we could build such large things again if we needed to but there is no need.  we have better technologies that allow us to do much more in a more efficient manner.  a popular example is that the iphone 4 is more powerful than the computers that took humans to the moon.  the computers of old were huge and filled entire buildings while only being able to do simple math but now they are much more capable in such a smaller form factor.  if you want an example of huge modern machinery, look at todays largest ships.  here is a link with many depictions of the titanic vs todays ships https://duckduckgo.com/?q=titanic+size+comparison&t=brave&iax=images&ia=images",
				"added": 1585411544
			}
		],
		"1589765373_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_2172_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm going to block your site if you don't describe it. I've done this before. [...]\n\noh no im so scared....",
				"added": 1589821853
			}
		],
		"1589825556_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 13,
				"body": "> [driud](#comment_46_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Trackers announcing: 0, error: 0, done: 9Is something weak? No connection.Why?\n\nnot sure",
				"added": 1589826373
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_2177_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Your site is no longer on MOAB. Thank you for the description. We don't know what some people are up to when they start a site, especially when it's unreachable. [...]\n\nthanks :)",
				"added": 1589826387
			},
			{
				"comment_id": 15,
				"body": "> [driud](#comment_47_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Does not connect?\n\ntry now",
				"added": 1589827138
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_2179_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Have you tried to sign and publish yet?\n\nyes",
				"added": 1589828654
			},
			{
				"comment_id": 17,
				"body": "> [driud](#comment_48_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Everything is ok. The second time it opened. Interesting material, Thanks.Greetings.\n\n:)",
				"added": 1589851149
			},
			{
				"comment_id": 18,
				"body": "> [pineapplehead](#comment_13_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes): Thanks for sharing! Seeding!\n\nthanks for taking the time to look at it",
				"added": 1589851165
			},
			{
				"comment_id": 19,
				"body": "> [styromaniac](#comment_2181_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Open the sidebar on your site and set the site title and site description, then sign and publish.\n\ndone",
				"added": 1589851174
			}
		],
		"1589795008_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_2173_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Use Syncronite to help your node find files. [...]\n\nwhere can i find syncronite?",
				"added": 1589851247
			}
		],
		"1590080124_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4": [
			{
				"comment_id": 21,
				"body": "> [blahblah69](#comment_86_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): well it needs one that is updated for sure, i am building the Zeronet moderated directory i  just need people to submit active zites, there is a policy in place where i wont knowingly list links to cp, mindless violence or sexual abuse.admittedly that's not always easy to enforce on a network like this but I am trying my best. Its just a link site at the moment and a redesign in in the works and once i figure out how to get search functionality in it i will be adding it.you can find it here http://127.0.0.1:43110/18QPAtqyoxriNcNAi4mkCHyoLENwTEbFyw/If you have any zites you would like to add please send them to me, also any suggestions or ideas for improvement are always welcome, thank you.\n\nhere is a zite I made\nhttp://127.0.0.1:43110/1LPTwy3E2sQThsiuDJpo6PdmQbLbUsq5kA/",
				"added": 1590111908
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 22,
				"body": "> [edgelordofdecent](#comment_551_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): People need to blow the cops brains out when they are doing this shit if you want to see change.\nthe dude didnt even die from the cops. he had a heart attack and had covid-19. he was drunk as well.  And dont forget he was trying to use counterfeit money.   what the cops did wasnt right but it doesnt deserve the response its getting.",
				"added": 1591387733
			}
		],
		"1599583363_1HWmMKD3nNGY9bRJq5yZ8sRVcvPbtgzbRw": [
			{
				"comment_id": 23,
				"body": "> [papull](#comment_5_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): Try to please her with your dick so much that she forgets iTune exists\ni forgot itunes existed without getting pleased by a dick",
				"added": 1599739912
			}
		]
	},
	"comment_vote": {
		"10_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"108_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"34_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"10_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": 1,
		"314_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"2157_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1133_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"481_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1_1HWmMKD3nNGY9bRJq5yZ8sRVcvPbtgzbRw": 1,
		"26_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": 1,
		"127_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"128_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1
	}
}