{
	"posts": [
		{
			"id": "90bd3aad-fc8d-42c1-8cdd-ca61ce152a03",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c7efbd2c-9a13-4386-b72d-73436fbefd25",
			"body": ">>fffd000e-309b-46de-aaa5-81df5d30875b\n>we all know it's not as anonymous as normal 8chan\nYou know, but people who consider coming here in the future might not know.\nShowing auth_address would be an alternative, but showing actual usernames might be an incentive for people to choose random usernames and switch between them on a regular basis, which might make it harder to distinguish between actual names chosen by the user and randomly generated accounts.\nIf you want anonymity, why are you namefagging in the first place?",
			"time": 1567094832256,
			"files": "[]"
		},
		{
			"id": "adfc7212-515c-4fd7-bb96-b29565d9c09c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>137c3d26-e6aa-4417-90d4-e421ee7c1c31\nI hope you know you are only able to post without a ZeroID account because you installed ZeroNet before the switch to ZeroID.",
			"time": 1567099557390,
			"files": "[]",
			"last_edited": 1567099599890,
			"subject": null,
			"capcode": null
		},
		{
			"id": "08bbc795-d8db-4ebe-9e62-7ca7b1c571ea",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>da92eeb9-952e-460f-8601-af9a1147d1ea\n>Not really, the structure of Freenet is vastly different then ZeroNet,\nWell yeah on Freenet people hold data while not knowing what that data is, so that's a pretty big difference in how it works, but doesn't change the mechanism of how the attack would work.\n>the attack is just pretty strong (as all types of correlation attacks are). They could (and are) also used against Tor and I2P for example\nYou might argue that they both belong to the same type of attack, but there are very important differences. But the most important ones IMO are that ZN **more or less** requires you to have a constant ID whereas in Tor the endpoint would constantly be changing, that in ZN the relationships are one-to-one (one IP or IP range per ID) while in Tor they would be one-to-many (many people hitting the same hidden service or clearnet server), and that due to the reduced number of users on any given ZN zite, it would be like shooting fish in a barrel vs trying to catch fish with your bare hands from a boat.\n>however both have mechanisms in place to mitigate the effectiveness of these attacks\nI don't know about that. On Tor the main way they propose to mitigate these attacks would be by the directory servers blacklisting routers owned by the bad guys. Which is retarded. How are the directory servers supposed to know if any given volunteer running a node is a CIA asset? Guards are just nodes with high availability and bandwidth. Obviously no extensive background checks are done on the owner. And anyone can run bridges, middle or exit relays.\n>however both have mechanisms in place to mitigate the effectiveness of these attacks.\n>That's something I'm looking into right now, but it doesn't really seem to be practical on a plugin level.\nI don't know about that. With plugins it should be fairly doable. Even without cooperation from other clients, all you would need to do would be to generate ZeroIDs and spend them on posts. Some more involved authentication schemes would probably require cooperation though.\n>Nothing we can really do other then waiting for nofish to implement this. Politely asking for that feature might speed things up, though.\nHow about writing the code and ask him to use it? Is he generally too anal retentive about accepting contributions?\nI finally was able to see the thread on Gitcenter. What's the relationship between mater_seed and auth_privatekey? Would master_seed be cryptographically secure (and auth_adresses made from it non correlatable) if the index thing proposed by nofish is used?\n>The state itself relies on Tor to be secure against strong attackers.\nAnd you know that, how? **Just because the government says something \"is so good we use it ourselves\", doesn't mean it actually is. Maybe they just want you to think it is, and they don't actually seriously use it and expect it to work.**\nAnd even if they did use it, why would the US government care about being spied by the US government? They know what servers they're running themselves. We don't. They can configure their clients to only route to US owned servers, and to anyone else it might look like they're a regular user who just happened to go through US owned servers. But we as regular users don't know whether we'll be routed through servers owned by the Five Eyes, Russia, China, or just some random guy hosting a relay in his basement.",
			"time": 1567104504935,
			"files": "[]",
			"last_edited": 1567104593335,
			"subject": null,
			"capcode": null
		},
		{
			"id": "5c4015c8-46ec-47de-a462-33bfa70929dd",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>7ce665fd-4dcd-40ef-b9e1-811a0efc0f0a\nMake sure Tor is set to \"Always\", Trackers are set to \"Tor\", and regularly change your ZeroID (and make it look random like mine).",
			"time": 1567104713335,
			"files": "[]"
		},
		{
			"id": "f3c3dc74-15de-49f5-bd69-605bfdf67ecf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f3419434-0eb7-4416-9d86-54997830109a",
			"body": ">>4ec5e314-ebcf-4936-bbc3-fedd96fb8653\nlmao saved it",
			"time": 1567104921701,
			"files": "[]"
		},
		{
			"id": "5ff36080-e10a-431a-bb04-30eea1b565e6",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>87d2ded1-b09a-4b58-875c-46807f41dad3\nIf you don't use Tor for trackers then the tracker operators know your IP uses the zite. Other peers shouldn't be able to get your IP but who knows. Maybe your trackers still advertise your IP even if you tell them not to. So better safe than sorry. It doesn't make any real difference in loading speeds anyway.",
			"time": 1567105766652,
			"files": "[]"
		},
		{
			"id": "73f1913f-5d9b-433c-89ad-dd3a6eef9256",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>780c1adb-dc4a-4572-beab-6deefe207686\nNo, on Tor Browser you don't need to do anything other than enable 127.0.0.1 in the proxy settings thing to be able to use the ZeroNet at all.",
			"time": 1567106763943,
			"files": "[]"
		},
		{
			"id": "f7f134fa-4ddb-4da0-a93c-dfae8da1cbda",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>0321a763-1648-4ab9-8304-1cffd65d89a5\n>If I want to transfer the ability to edit posts, do I just transfer the ZeroNet/data/users.json file?\nYeah\n>>0321a763-1648-4ab9-8304-1cffd65d89a5\nYou can only edit the posts you made with that particular users.json installed, regardless of whether it was made with a ZeroID or not.",
			"time": 1567107614544,
			"files": "[]"
		},
		{
			"id": "634c5d9c-9517-4dd4-b6c6-7e4d8c2b6602",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "b81d0494-1ea3-4216-a624-1e0962742400",
			"body": ">>8a85617e-0239-4050-88a4-5229a3f01800\nLook into the ALICE programming language. I think the first believable chatbot will be a mix of hardcoded rules written in a more advanced version of a language like ALICE, natural language processing and neural networks to cover the stuff that's too abstract to be covered by the previous two.",
			"time": 1567122694273,
			"files": "[]",
			"last_edited": 1567122725473,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}