{
	"next_topic_id": 19,
	"topic": [
		{
			"topic_id": 1,
			"title": "Dr Fréderic Chaumont, Pr Jean-Bernard Fourtillan: Comment sauver les vaccinés ?",
			"body": "[lbry.com](https://open.lbry.com/@AgoraTVNEWS:5/Comment_sauver_les_vacinn%C3%A9s:a)\n\nFréderic Chaumont, Jean-Bernard Fourtillan et Tal Schaller vous expliquent le vaccin dans cette longue vidéo impossible à diffuser sur YouTube.",
			"added": 1612739174
		},
		{
			"topic_id": 2,
			"title": "Un Oxymètre pour sauver nos enfants et nous aussi ! Maitre Carlo Alberto Brusa",
			"body": "[invidiou.site](https://invidiou.site/watch?v=r8PQfU1ahWk)\n",
			"added": 1612950601
		},
		{
			"topic_id": 3,
			"title": "François Asselineau répond aux accusations",
			"body": "[invidiou.site](https://invidiou.site/watch?v=UWfeVpVZYdU)\n\nFrançois Asselineau revient sur les accusations qui sont portées contre lui en révélant certains des éléments décisifs qui démentent la version des plaignants et de la presse. Ces éléments replacent cette affaire dans sa vraie perspective : la perspective politique.",
			"added": 1613307537
		},
		{
			"topic_id": 4,
			"title": "Jean-Bernard Fourtillan et Frederic Chaumont : \"Et en plus ils s'enrichissent\"",
			"body": "https://open.lbry.com/@AgoraTVNEWS:5/26_Et-en-plus-ils-s%27enrichissent:4\n\nhttp://d.p.h.free.fr/covid19",
			"added": 1613835492
		},
		{
			"topic_id": 5,
			"title": "EPSTEIN - L'histoire d'un Monstre : Espionnage caméras vidéos prostitution de mineures et chantage",
			"body": "[invidious.tube](https://invidious.tube/watch?v=81cPAlswCAk)\n[IPFS](https://ipfs.io/ipfs/bafybeibgijrdbdadzfne6ekpmee65br63tyr6bni4ywrrw7ftoggxb5kei/EPSTEIN-L'histoire.d'un.Monstre:Espionnage.caméras.vidéos.prostitution.de.mineures.et.chantage.mp4)\n\nPour la première fois, voici la vie détraquée du milliardaire Jeffrey Epstein, confident de Bill Clinton, qui a piégé, pendant 20 ans, pour le compte des services israéliens, des milliers de députés, sénateurs, hommes d'affaires, journalistes, stars de cinéma, scientifiques de renom, recteurs et doyens d'universités, premiers ministres, princes et princesses (dont le prince Andrew), et même des présidents avec son réseau de prostitution de jeunes filles. \n\nDe son ascension en tant que professeur de mathématiques en passant par une carrière ratée à Wall Street, on le suit jusqu'à sa gloire et sa déchéance, en passant par sa rencontre capitale avec Ghilaine Maxwell, la fille d'un autre très grand espion du Mossad, Robert Maxwell qui avait acheté les médias britanniques pour le compte d Israël. Alors qu'il se prétendait millionnaire grâce à Wall Street, en réalité Epstein s'était transformé en proxénète spécialisé pour les seuls ultra-riches et tout-puissants qui n'exigent qu'une seule chose: la discrétion la plus totale. \n\nIl invitait tout ce qui était célèbre dans ses différentes luxueuses propriétés, îles privées ou encore à Paris, où toutes les chambres étaient sonorisées et équipées de caméras très discrètes. En leur fournissant régulièrement des gamines, Epstein avait monté le plus grand réseau international de pédophiles, au point que son avion a été surnommé par les contrôleurs aériens le \"Lolita Express\", avion que prenaient régulièrement Bill Gates comme Bill Clinton. Et ensuite il vendait les vidéos aux services. \n\nArrêté par la police américaine une seconde fois pour \"trafic de mineures\" il a été retrouvé mort dans des conditions spectaculaires en août 2019 dans sa cellule du Metropolitan Correctional Center de New York. Un suicide qui a arrangé toutes les célébrités dont les noms se trouvent dans son fameux \"Carnet Noir\". Cette enquête, menée par le grand reporter Dylan Howard et aidé par deux autres journalistes américains, apporte des révélations incroyables sur les activités d'Epstein, de sa \"Madame\" Ghislaine Maxwell et sur la manière dont ils mettaient ces jeunes filles en esclavage pour les ultra-riches, et les abus qu'elles vivaient.",
			"added": 1613908764
		},
		{
			"topic_id": 6,
			"title": "Maitre DI VIZIO Vacciner les plus de 75 ans conseils aux soignants",
			"body": "[invidious.tube](https://invidious.tube/watch?v=Vzae9VMeM6s)\n[IPFS](https://ipfs.io/ipfs/bafybeig3x5ynqqrfutn4ugbjz4zqw45jygvlmi3qn6ucmbxd3nkry6ph3y/Maitre.DI.VIZIO.Vacciner.les.plus.de.75.ans.conseils.aux.soignants.mp4)\nLa vaccination des plus de 75 ans n'ayant pas démontré formellement son efficacité, les médecins doivent recueillir un consentement libre et éclairé des patients. \nIl ne faut pas leur mentir : oui le vaccin a une efficacité supposée sur cette tranche d'âge, mais non elle n'a pas été formellement démontrée.\nNe pas recueillir le consentement, quel que soit l'acte médical est toujours une faute disciplinaire, voire pénale, en particulier chez les populations fragiles.",
			"added": 1613910435
		},
		{
			"topic_id": 7,
			"title": "Dieudonne: condamnation à 90 jours de prison ferme et 40 000 euros",
			"body": "[quenelplus.com](https://quenelplus.com/vod/watch/episode-187-chaud-a-la-tete?mc_cid=03da69490c&mc_eid=UNIQID)\n[dieudo Épisode 187 : Chaud à la tête. invidious.fdn.fr](https://invidious.fdn.fr/watch?v=9WbWjzXVC0w)",
			"added": 1613972675
		},
		{
			"topic_id": 8,
			"title": "Espagne : interruption des injections après le décès de 46 résidents d'une maison de retraite",
			"body": "[fr.sott.net](https://fr.sott.net/article/36559-Espagne-interruption-des-injections-apres-le-deces-de-46-residents-d-une-maison-de-retraite)\n\nLOS BARRIOS, ESPAGNE - La maison de soins infirmiers Nuestra Señora del Rosario (Notre-Dame du Rosaire) est sous le choc en raison de décès massifs après des inoculations d'ARNm. Tous les résidents et travailleurs de l'établissement ont reçu la première dose d'ARNm de Pfizer début janvier, selon le grand média espagnol ABC de Sevilla. La plupart des résidents sont devenus extrêmement malades peu de temps après les injections.\nxdcv\n© ERSAMO FENOY\nOn pense que beaucoup ont attrapé [SRAS-CoV-X de - MIRASTNEWS] la COVID-19, bien qu'ils aient été \"vaccinés contre lui\". Le service de santé andalou a rapporté qu'au moins 46 résidents sont décédés depuis janvier. Pour la perspective, Notre-Dame a une capacité maximale de 145 résidents.\n\nLa Junta de Andalucía (gouvernement régional) est intervenue début février pour réduire le nombre de morts. Mais les gens ont continué à mourir. Le Ministère espagnol de la santé est désormais chargé des mesures d'atténuation.\n\nLa situation reste désastreuse, car au moins 28 résidents et 12 membres du personnel étaient positifs au [SRAS-CoV-2 de la - MIRASTNEWS] COVID-19 la semaine dernière. En conséquence, les responsables de la santé ont interrompu toutes les autres injections d'ARNm. La Fédération des services publics a reproché à Notre-Dame de ne pas agir plus tôt. Le syndicat des travailleurs a déclaré que la réponse était inadéquate après la mort de huit personnes au 18 janvier. Le nombre de morts est passé à 30 le 28 janvier.\n\nL'Espagne est continuellement dans l'actualité liée aux injections d'ARNm. Le ministre de la Santé, Salvador Illa, a déclaré en décembre que son agence tenait une base de données de tous les citoyens qui refusent l'ARNm. Il a déclaré que la liste serait partagée avec tous les membres de l'UE.\n\nUn professionnel de la santé en Espagne a également récemment signalé que plusieurs receveurs d'ARNm avaient été admis dans des hôpitaux de la région de Murcie pour encéphalite.",
			"added": 1614001833
		},
		{
			"topic_id": 9,
			"title": "Vandana.Shiva.contre.les.1%.qui.nous.dominent.'Bill.Gates.Monsanto'.FRANCE-24",
			"body": "[open.lbry.com](https://open.lbry.com/@JeanneTraduction:a/Vandana:c)\n\nSource de la vidéo : \nhttps://www.youtube.com/watch?v=MNM833K22LM&t=35s",
			"added": 1614070200
		},
		{
			"topic_id": 10,
			"title": "Demande judiciaire d'autorisation de respirer librement dans l'espace public",
			"body": "[stopcovid19.today](https://stopcovid19.today/2021/02/25/requete-judiciaire-concernant-lexoneration-de-port-du-masque/)\n\n[Télécharger la requête judiciaire au format PDF](https://stopcovid19.today/wp-content/uploads/2021/02/Masques-REQUETE-PDT-T.J.pdf)\n\nREQUETE\n\nA MADAME OU MONSIEUR LE PRESIDENT\n\nDU TRIBUNAL JUDICIAIRE DE …………………….\n\nM……………………...\n\nReprésentés par Me ……………….Avocat au Barreau de…………...\n\nONT L’HONNEUR D’EXPOSER CE QUI SUIT ...\n\n",
			"added": 1614363028
		},
		{
			"topic_id": 11,
			"title": "Un médecin de l'Institut de cardiologie de Montréal ose parler des risques du vaccin COVID19",
			"body": "https://invidious.fdn.fr/watch?v=GfKRUJPxiBw",
			"added": 1614520766
		},
		{
			"topic_id": 12,
			"title": "Comment les banques centrales pilotent le Great Reset | Olivier Piacentini",
			"body": "[invidious.ethibox.fr](https://invidious.ethibox.fr/watch?v=U0j50fOVB6s)\n\nDans cette vidéo, Olivier Piacentini analyse la prise de pouvoir des banques et ses conséquences dramatiques sur la souveraineté et l'avenir économique des peuples occidentaux.",
			"added": 1614824090
		},
		{
			"topic_id": 13,
			"title": "Le Pr Jean-Bernard Fourtillan répond aux questions du Pr Henri Joyeux: La glande pinéale et le système Veille-Sommeil",
			"body": "[invidious.zapashcanon.fr](https://invidious.zapashcanon.fr/watch?v=3PkX8boc4RU)\n\nNous sommes dans l'incapacité, pour l'instant, d’apporter des réponses individuelles aux très nombreuses questions qui nous sont posées. Nous le regrettons. Dans l’attente d’une organisation adéquate, nous vous adressons une réponse standard qui recouvre l'essentiel des questions qui nous ont été posées jusqu’à présent.\n\nLES PATCHS TRANSDERMIQUES contenant la Valentonine (VLT) et le 6-Méthoxy-Harmalan (6-MH) seront disponibles au 4ème trimestre 2017\n\nMerci pour vos dons, les achats du livre et de la brochure (« La glande pinéale et le système Veille-Sommeil. Applications thérapeutiques ») et vos encouragements.\n\nIls vont nous aider à financer, de manière indépendante, la mise au point des formes galéniques des patchs, afin de les mettre à la disposition des patients, le plus rapidement possible. Vous serez régulièrement tenus au courant de la situation en consultant le site du Fonds Josefa.\n\nEn ce qui concerne les patchs à 2 réservoirs (délivrant 100 microgrammes de 6-Méthoxy-Harmalan, 6-MH, et 400 microgrammes de Valentonine, VLT, pour les maladies de Parkinson et d'Alzheimer, et 50 microgrammes de 6-MH et 200 microgrammes de VLT pour les troubles du sommeil et les dépressions nerveuses), ils seront disponibles courant 2017 (4ème trimestre), comme c’est précisé au bas de la page d'accueil du site du Fonds Josefa.\n\nLes capsules de mélatonine dosées à 3 mg peuvent être achetées sur internet, au prix de 25 € environ les 180 capsules (prise d’1 capsule dosée à 3 mg le soir au coucher, pour protéger ses neurones).\n\nSur le plan pratique, le dosage de la mélatonine dans le plasma sanguin, prélevé à partir de 1h du matin, qui permettra d’évaluer la sécrétion des 3 hormones (MLT, 6-MH, et VLT) par la glande pinéale, prendra un peu plus de temps, car nous devons implanter la méthode de dosage du marqueur mélatonine (selon une méthode de couplage de spectrométrie de masse et de chromatographie liquide, décrite dans nos brevets) dans les laboratoires d'analyses médicales du monde entier. Mais ce délai ne retardera en rien la mise à disposition des patchs en 2017.\n\nTous les renseignements et explications concernant la découverte des hormones du système Veille-Sommeil et ses applications thérapeutiques sont donnés dans le livre et la brochure intitulés \"La glande pinéale et le système Veille-Sommeil. Applications thérapeutiques\", en vente chez Amazon.\n\nD’ici le mois de septembre 2017, 10 Lettres du Pr Henri Joyeux assorties de 5 vidéos cosignées par les Prs Jean-Bernard Fourtillan et Henri Joyeux, auront été publiées. Elles sont consacrées aux applications thérapeutiques qui découlent de la découverte du système Veille-Sommeil :\n\nLa maladie d’Alzheimer (Lettre n°138),\nLa maladie de Parkinson (Lettre n°139),\nLes interviews virtuelles de Jean-Bernard Fourtillan par Aloïs Alzheimer et James Parkinson (Lettres n° 142 et 144),\nLes troubles du sommeil (Lettre n° 147),\nLes dépressions nerveuses (Lettre n° 150),\nToutes les benzodiazépines et apparentées sont des stupéfiants (Lettre N°154)\nLes psychoses\nLes applications thérapeutiques potentielles en perspective. Pour plus d’informations, et pour suivre l’état d’avancement de ces nouveaux médicaments, nous vous conseillons de consulter régulièrement les publications récentes du Fonds Josefa\nMerci de votre confiance,\n\nJean-Bernard Fourtillan, Pr Henri Joyeux et leur équipe\n\nPS:\n\nQue peut-on faire pour améliorer le sommeil et les fonctions mentales des patients atteints de la maladie d’Alzheimer, dans l’attente de la disponibilité des patchs de VLT et de 6-MH (prévue pour le 4ème trimestre 2017) ?\n\nLes patchs à 2 réservoirs, appliqués au coucher et enlevés le matin au réveil, qui permettront de délivrer 100 microgrammes de 6-MH et 400 microgrammes de VLT, sur une période de 8 heures, ne seront pas disponibles, pour les patients atteints de maladies neuro-dégénératives, du type Parkinson et Alzheimer, avant le 4ème trimestre 2017.\n\nDans cette attente, l’administration de Clomipramine (Anafranil® et génériques), à la dose d’un comprimé de 10 mg, le soir au coucher, peut se révèler bénéfique pour ces patients. En effet, les neuropsychiatres ont constaté, depuis de nombreuses années, que l’administration de Clomipramine améliore le sommeil et la cognition chez les personnes âgées et les patients atteints de la maladie d’Alzheimer. Cet effet thérapeutique s’explique par le fait que cet antidépresseur majeur, chef de file des IRN (Inhibiteurs du Recaptage de la Noradrénaline), provoque une stimulation noradrénergique des pinéalocytes (unités cellulaires de la glande pinéale), qui a pour conséquence d’augmenter les productions par la glande pinéale des 3 hormones (MLT, 6-MH et VLT) ; et ainsi d’améliorer le sommeil, la vigilance, et la cognition.\n\nRéférences : « La glande pinéale et le système Veille-Sommeil. Applications thérapeutiques » par Professeur Jean-Bernard Fourtillan. Livre (page 155) et Brochure (page 46).\n\nRéalisation. H. MORIN",
			"added": 1615231434
		},
		{
			"topic_id": 14,
			"title": "Santé-Libre: Conférence-de-presse-slides.pdf",
			"body": "[Santé-Libre: Conférence-de-presse-slides.pdf](https://stopcovid19.today/wp-content/uploads/2021/03/210306-Confe%CC%81rence-de-presse-slides.pdf)",
			"added": 1615306832
		},
		{
			"topic_id": 15,
			"title": "Imposer un vaccin expérimental ou la violation du code de Nuremberg et la déclaration d’Helsinki",
			"body": "[mondialisation.ca](https://www.mondialisation.ca/imposer-un-vaccin-experimental-ou-la-violation-du-code-de-nuremberg-et-la-declaration-dhelsinki/5654391)\n\nAucun essai thérapeutique ne doit être proposé sans le consentement libre et éclairé du cobaye. Cette règle fondamentale d’éthique de la recherche, affirmée lors du procès des médecins nazis à Nuremberg et reprise par la déclaration d’Helsinki de l’Association médicale mondiale est totalement bafouée lorsqu’on prône une obligation vaccinale anti-Covid aux soignants.\n\nMais certains médecins des plateaux télé qui ne précisent jamais leurs liens d’intérêts avec l’industrie, et même le représentant d’un syndicat d’infirmières n’hésitent pourtant pas à en faire la promotion dans les médias !\n\nViolation du Code de Nuremberg\n\nLes vaccins sont expérimentaux. Une obligation vaccinale violerait le Code de Nuremberg et la déclaration d’Helsinki.\n\nLes résultats définitifs du vaccin le plus avancé sont promis pour 2023. Les résultats des vaccins anti-covid n’ayant été ni établis, ni publiés leur utilisation constitue un essai thérapeutique.\n\nOr le Code de Nuremberg1 identifie le consentement éclairé comme préalable absolu à la conduite de recherche mettant en jeu des sujets humains.\n\nSi le représentant de ce syndicat ne corrige pas rapidement son erreur en rappelant les bases éthiques de la médecine et de la recherche, il montrera qu’il n’a agi que comme allié du gouvernement et militant des firmes pharmaceutiques.",
			"added": 1615388515
		},
		{
			"topic_id": 16,
			"title": "Les policiers affectés psychologiquement et à bout professionnellement au bord de la révolte",
			"body": "[invidious.fdn.fr](https://invidious.fdn.fr/watch?v=JC77Vk98HM8)\n\n[IPFS](https://ipfs.io/ipfs/bafybeigc5wbwrkagr7e74nk2cv3rlxxykroiwvchd62dlo5bjv3ocixzqm/Des.policiers.blessés.au.bord.de.la.révolte!-.mp4)\n\n\n Si en 2018, les policiers ont failli désobéir au pouvoir pour rejoindre le peuple, l'insoumission guette d'autant plus à l'aube de 2021.",
			"added": 1615649047
		},
		{
			"topic_id": 17,
			"title": " Coronavirus : la porte ouverte à un système monétaire obligatoire ? Une analyse d’Ernst Wolff",
			"body": "[open.lbry.com](https://open.lbry.com/@coalition:0/2021-03-06_CoronavirusLaPorteOuverteAUnSy_klaTV-18267_1080p:9)",
			"added": 1616457820
		},
		{
			"topic_id": 18,
			"title": "La Justice sud-africaine impose l'ivermectine en tant que traitement contre le Covid-19",
			"body": "[lemediaen442.fr](https://lemediaen442.fr/la-justice-sud-africaine-impose-livermectine-en-tant-que-traitement-contre-le-covid-19/)\n\nL’organisation de défense des droits civiques AfriForum et le Dr George Coetzee ont obtenu aujourd’hui un nouveau succès dans la lutte pour l’accès à l’ivermectine et ses produits composés via la décision de justice enjointe à l’autorité sud-africaine de réglementation des produits de santé (SAHPRA).\n\nCette ordonnance du tribunal détermine qu’un médicament contenant de l’ivermectine comme ingrédient actif doit être homologué par la SAHPRA à partir du 16 mars 2021. L’enregistrement implique que l’ivermectine peut être produite et doit être rendue accessible conformément aux dispositions du paragraphe 14(4) de la Loi. L’ordonnance détermine en outre que SAHPRA et le ministre de la Santé, conjointement et individuellement, verseront une amende équivalente aux dépenses des quatre groupes de demandeurs d’un montant de 1,8 million de rands (plus la TVA).\n\n",
			"added": 1617989203
		}
	],
	"topic_vote": {
		"1_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": 1,
		"1_1HAkWtoENzu446QLtTYyhBq2QvKi8CoxHq": 1,
		"10_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"16_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"18_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {
		"1_12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u": 1
	}
}