{
	"title": "Smart Fools",
	"description": "My Blog.",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1496969009,
	"post": [
		{
			"post_id": 3,
			"title": "let's start from this first study",
			"date_published": 1496968990.593,
			"body": "Blog post body"
		},
		{
			"post_id": 2,
			"title": "Is the World Education System Producing a Society of “Smart Fools”?",
			"date_published": 1496968806.172,
			"body": "At last weekend’s annual meeting of the Association for Psychological Science (APS) in Boston, Cornell University psychologist Robert Sternberg sounded an alarm about the influence of standardized tests on American society. Sternberg, who has studied intelligence and intelligence testing for decades, is well known for his “triarchic theory of intelligence,” which identifies three kinds of smarts: the analytic type reflected in IQ scores; practical intelligence, which is more relevant for real-life problem solving; and creativity. Sternberg offered his views in a lecture associated with receiving a William James Fellow Award from the APS for his lifetime contributions to psychology. He explained his concerns to Scientific American.\n\n[An edited transcript of the interview follows.]\n\nIn your talk, you said that IQ tests and college entrance exams like the SAT and ACT are essentially selecting and rewarding “smart fools”—people who have a certain kind of intelligence but not the kind that can help our society make progress against our biggest challenges. \n\nWhat are these tests getting wrong?\n Tests like the SAT, ACT, the GRE—what I call the alphabet tests—are reasonably good measures of academic kinds of knowledge, plus general intelligence and related skills. They are highly correlated with IQ tests and they predict a lot of things in life: academic performance to some extent, salary, level of job you will reach to a minor extent—but they are very limited. What I suggested in my talk today is that they may actually be hurting us. Our overemphasis on narrow academic skills—the kinds that get you high grades in school—can be a bad thing for several reasons. You end up with people who are good at taking tests and fiddling with phones and computers, and those are good skills but they are not tantamount to the skills we need to make the world a better place.\n\nWhat evidence do you see of this harm?\n IQ rose 30 points in the 20th century around the world, and in the U.S. that increase is continuing. That’s huge; that’s two standard deviations, which is like the difference between an average IQ of 100 and a gifted IQ of 130. We should be happy about this but the question I ask is: If you look at the problems we have in the world today—climate change, income disparities in this country that probably rival or exceed those of the gilded age, pollution, violence, a political situation that many of us never could have imaged—one wonders, what about all those IQ points? Why aren’t they helping?\n\nWhat I argue is that intelligence that’s not modulated and moderated by creativity, common sense and wisdom is not such a positive thing to have. What it leads to is people who are very good at advancing themselves, often at other people’s expense. We may not just be selecting the wrong people, we may be developing an incomplete set of skills—and we need to look at things that will make the world a better place.\n\nDo we know how to cultivate wisdom?\n Yes we do. A whole bunch of my colleagues and I study wisdom. Wisdom is about using your abilities and knowledge not just for your own selfish ends and for people like you. It’s about using them to help achieve a common good by balancing your own interests with other people’s and with high-order interests through the infusion of positive ethical values.\n\nYou know, it’s easy to think of smart people but it’s really hard to think of wise people. I think a reason is that we don’t try to develop wisdom in our schools. And we don’t test for it, so there’s no incentive for schools to pay attention.\n\nCan we test for wisdom and can we teach it?\n You learn wisdom through role-modeling. You can start learning that when you are six or seven. But if you start learning what our schools are teaching, which is how to prepare for the next statewide mastery tests, it crowds out of the curriculum the things that used to be essential. If you look at the old McGuffey Readers, they were as much about teaching good values and good ethics and good citizenship as about teaching reading. It’s not so much about teaching what to do but how to reason ethically; to go through an ethical problem and ask: How do I arrive at the right solution?\n\nI don’t always think about putting ethics and reasoning together. What do you mean by that?\n Basically, ethical reasoning involves eight steps: seeing that there’s a problem to deal with (say, you see your roommate cheat on an assignment); identifying it as an ethical problem; seeing it as a large enough problem to be worth your attention (it’s not like he’s just one mile over the speed limit); seeing it as personally relevant; thinking about what ethical rules apply; thinking about how to apply them; thinking what are the consequences of acting ethically—because people who act ethically usually don’t get rewarded; and, finally, acting. What I’ve argued is ethical reasoning is really hard. Most people don’t make it through all eight steps.\n\nIf ethical reasoning is inherently hard, is there really less of it and less wisdom now than in the past?\n We have a guy [representative-elect Greg Gianforte of Montana] who allegedly assaulted a reporter and just got elected to the U.S. House of Representatives—and that’s after a 30-point average increase in IQ. We had violence in campaign rallies. Not only do we not encourage creativity, common sense and wisdom, I think a lot of us don’t even value them anymore. They’re so distant from what’s being taught in schools. Even in a lot of religious institutions we’ve seen a lot of ethical and legal problems arise. So if you’re not learning these skills in school or through religion or your parents, where are you going to learn them? We get people who view the world as being about people like themselves. We get this kind of tribalism.\n\nSo where do you see the possibility of pushing back?\n If we start testing for these broader kinds of skills, schools will start to teach to them, because they teach to the test. My colleagues and I developed assessments for creativity, common sense and wisdom. We did this with the Rainbow Project, which was sort of experimental when I was at Yale. And then at Tufts, when I was dean of arts and sciences, we started Kaleidoscope, which has been used with tens of thousands of kids for admission to Tufts. They are still using it. But it’s very hard to get institutions to change. It’s not a quick fix. Once you have a system in place, the people who benefit from it rise to the top and then they work very hard to keep it.\n\nLooking at the broader types of admission tests you helped implement—like Kaleidoscope at Tufts, the Rainbow Project at Yale, or Panorama at Oklahoma State, is there any evidence that kids selected for having these broader skills are in any way different from those who just score high on the SAT?\n The newly selected kids were different. I think the folks in admissions would say so, at least when we started. We admitted kids who would not have gotten in under the old system—maybe they didn’t quite have the test scores or grades. When I talk about this, I give examples, such as those who wrote really creative essays.\n\nHas there been any longitudinal follow-up of these kids?\n We followed them through the first year of college. With Rainbow we doubled prediction [accuracy] for academic performance, and with Kaleidoscope we could predict the quality of extracurricular performance, which the SAT doesn’t do.\n\nDo you think the emphasis on narrow measures like the SAT or GRE is hurting the STEM fields in particular?\n I think it is. I think it’s hurting everything. We get scientists who are very good forward incrementers—they are good at doing the next step but they are not the people who change the field. They are not redirectors or reinitiators, who start a field over. And those are the people we need.\n\nAre you hopeful about change?\n If one could convince even a few universities and schools to try to follow a different direction, others might follow. If you start encouraging a creative attitude, to defy the crowd and to defy the zeitgeist, and if you teach people to think for themselves and how what they do affects others, I think it’s a no-lose proposition. And these things can be taught and they can be tested.\n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}