{
	"title": "PepeCyB's Welt",
	"description": "Pepes zweite \"Flüstertüte\"",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 27,
	"demo": false,
	"modified": 1555438223,
	"post": [
		{
			"post_id": 26,
			"title": "Bitte jetzt nicht durchdrehen",
			"date_published": 1555438167.557,
			"body": "![ruhe](img/ruhe.jpg)\n\nKaum wurde die Copyright-Richtlinie durchgewunken, entsteht hier und da Panik.\n\nDa liest man dann in den föderierten/dezentralen Netzwerken, dass die  Kanäle auf den Hubs, Pods etc. vorsorglich mal ganz schnell auf  „privat“ gesetzt werden, neue Registrierungen abgeschaltet…\n\n…dass mancher sich ganz zurückziehen möchte, weil er z.B. für einen  Verein tätig ist und den Service als solcher betreibt… damit sei er ja  „kommerziell“, weil der Verein Einnahmen hat…\n\nWas soll man nur tun, wenn jemand einen Link z.B. auf einen fremden Artikel postet? Da entsteht ja eine Vorschau…\n\nUnd eigene Werke könne man auch nicht mehr einfach so posten oder  Teilen, weil dann die Verwertungsgesellschaften die Hand aufhalten…\n\nIrgendwie scheint da hektisch überreagiert zu werden… und das macht  mir schon ein wenig Angst. Die freien (föderierten/dezentralen) Sozialen  Netzwerke jetzt vor der Öffentlichkeit zu verbergen… das macht sie in  gewissen Teilen doch quasi überflüssig… zerstört sie praktisch. Und  Registrierungen zu sperren, sorgt dafür, dass der Zulauf abnimmt. Der  Normal-Nutzer setzt sich doch keinen eigenen Server auf. Diese Netzwerke  leben doch von den Benutzern, die dort sind und die neu dazustoßen.\n\nVor allem aber gibt es keinen Grund für solche Kurzschlussreaktionen…\n\n---\n\nZuerst einmal muss heute oder morgen niemand was unternehmen. Die  Richtlinie ist verabschiedet und es beginnt eine lange Frist, innerhalb der die  Richtlinie in nationale Gesetze der EU-Mitgliedsstaaten umgesetzt werden  muss… zwei Jahre. Nach Ablauf der Frist oder mit Erlass des jeweiligen nationalen  Gesetzes greifen erst die Regelungen.\n\nAlso hektische Aktivität ist nicht angesagt… erstmal locker durch die Hose atmen!\n\nUnd dann mal schauen, ob und wie man überhaupt reagieren müsste…\n\nDie erste Frage ist, ob die föderierten/dezentralen Netzwerke überhaupt betroffen sind.\n\nWas den Artikel 17 anbelangt, können wir da recht entspannt bleiben,  denn der Artikel betrifft nur „Diensteanbieter für das Teilen von  Online-Inhalten“.\n\nIst man das denn als Betreiber eines Hubs/Pods?\n\nWas ein „Diensteanbieter für das Teilen von Online-Inhalten“ ist, steht in Artikel 2 Nr. 5 der Richtlinie:\n\n> **Artikel 2**\n>\n> **Begriffsbestimmungen**\n>\n> Für die Zwecke dieser Richtlinie gelten folgende Begriffsbestimmungen:\n>\n> …\n>\n> \\6.  „Diensteanbieter für das Teilen von Online-Inhalten“ bezeichnet den  Anbieter eines Dienstes der Informationsgesellschaft, bei dem der  Hauptzweck bzw. einer der Hauptzwecke darin besteht, eine große Menge an  von seinen Nutzern hochgeladenen, urheberrechtlich geschützten Werken  oder sonstigen Schutzgegenständen zu speichern und der Öffentlichkeit  Zugang hierzu zu verschaffen, wobei dieser Anbieter diese Inhalte  organisiert und zum Zwecke der Gewinnerzielung bewirbt.\n>\n> …\n\nSchon bei „Hauptzweck“ sollten die ersten Zweifel entstehen. Ok… bei PeerTube z.B. könnte man das vielleicht schon annehmen…\n\n…aber egal, denn spätestens bei „wobei dieser Anbieter **diese Inhalte organisiert und zum Zwecke der Gewinnerzielung bewirbt**“ ist Schluss.\n\nDas Organisieren und das Bewerben zur Gewinnerzielung trifft nicht.  Da ist es auch völlig egal, ob der Server irgendwo mit Werbebannern  daherkommt oder ob er von z.B. einem Verein betrieben wird, der  Einnahmen hat. Es geht hier nämlich gar nicht darum, ob der Dienst  kommerziell betrieben wird, sondern darum, ob die „großen Mengen“  geschützter Werke organisiert oder beworben werden, um DAMIT Gewinne zu  erzielen.\n\nWeder Einnahmen durch Werbebanner, noch Mitgliedsbeiträge oder sonst  eine Finanzierung ist die von der Definition geforderte Gewinnerzielung  MIT diesen geschützten Inhalten.\n\nBanner etc. mögen einen Dienst schon kommerziell machen… aber nur in  Hinblick auf andere gesetzliche Bestimmungen. Die Richtlinie ist in der  Hinsicht aber recht präzise formuliert… deshalb steht da auch nicht  schlicht „kommerziell“, sondern die Art der Gewinnerzielung ist sehr  scharf umrissen.\n\nAlso hier gibt es keinen Grund zur Panik… „uns“ trifft die Richtlinie zunächst einmal in diesem Punkt nicht.\n\nAbgesehen davon dürfen die Betreiber der Services trotzdem keine  Urheberrechtsverletzung dulden… das war aber auch vor der Richtlinie  schon so.\n\n\n\nNun zu den Links, die Vorschauen erzeugen. Die Befürchtungen diesbezüglich beziehen sich auf Artikel 15:\n\n> **Artikel 15**\n>\n> **Schutz von Presseveröffentlichungen im Hinblick auf die Online-Nutzung**\n>\n> (1)  Die Mitgliedstaaten legen Bestimmungen fest, mit denen Presseverlage  mit Sitz in einem Mitgliedstaat die in Artikel 2 und Artikel 3 Absatz 2  der Richtlinie 2001/29/EG genannten Rechte für die Online-Nutzung ihrer  Presseveröffentlichungen durch Anbieter von Diensten der  Informationsgesellschaft erhalten.\n>\n> Die in Unterabsatz 1  vorgesehenen Rechte gelten nicht für die private oder nicht-kommerzielle  Nutzung von Presseveröffentlichungen durch einzelne Nutzer.\n\nWenn jemand privat bzw. nicht-kommerziell einen Link auf einen  Presseartikel postet (und damit ein Snippet erzeugt wird), dann gibt es  ebenfalls keinen Grund zur Aufregung. Der Artikel zielt ebenfalls darauf  ab, dass die Veröffentlichung von Presseartikeln (oder Teilen davon)  aus kommerziellen Gründen erfolgt… und zwar von DEM, der den  snippet-erzeugenden Link postet.\n\n\n\nJetzt noch kurz dazu, dass beim Veröffentlichen von eigenen Inhalten  irgendwelche Verwertungsgesellschaften mitverdienen. Das ist Quatsch…  das trifft nur dann zu, wenn man einer solchen Gesellschaft selbst  Rechte übertragen hat. Solange man das nicht getan hat, verdient auch  kein Dritter an den eigenen Werken. Artikel 16 kann aber diejenigen  treffen, die z.B. über die VG Wort an ihren Inhalten verdienen. Der  Artikel ist der Türöffner dafür, dass die Verwertungsgesellschaften  wieder deutlich mehr vom Gewinn abbekommen.\n\n> **Artikel 16**\n>\n> **Ansprüche auf einen gerechten Ausgleich**\n>\n> Die  Mitgliedstaaten können festlegen, dass für den Fall, dass ein Urheber  einem Verleger ein Recht übertragen oder ihm eine Lizenz erteilt hat,  diese Übertragung oder Lizenzierung eine hinreichende Rechtsgrundlage  für den Anspruch des Verlegers auf einen Anteil am Ausgleich für die  jeweilige Nutzung des Werkes im Rahmen einer Ausnahme oder Beschränkung  für das übertragene oder lizenzierte Recht darstellt.\n\nAlso insgesamt gibt es keinen Grund zur hektischen Überreaktion… weil  erstens noch Zeit ist (keine Hektik) und weil die Regelungen eh erstmal  nicht die föderierten/dezentralen Netzwerke betreffen.\n\n**Also: Bitte, bitte macht die Netzwerke jetzt nicht kaputt,  weil Ihr panisch werdet, oder weil irgendwer falsche Horrormeldungen in  die Welt setzt.**\n\nDie Richtlinie ist so schon schlimm genug, weil sie das Einfallstor  für eine echte Zensurmaschine werden kann… und schaut Euch mal die  Verordnung (also den Entwurf) zur Verhinderung der Verbreitung  terroristischer Online-Inhalte an… den Artikel 6. Da sollen  Upload-Filter direkt für die Webhoster vorgeschrieben werden.\n\n> **Artikel 6**\n>\n> **Proaktive Maßnahmen**\n>\n> Die  Hostingdiensteanbieter ergreifen gegebenenfalls proaktive Maßnahmen, um  ihre Dienste vor der Verbreitung terroristischer Inhalte zu schützen.  Die Maßnahmen müssen wirksam und verhältnismäßig sein, wobei dem Risiko  und Ausmaß der möglichen Beeinflussung durch terroristische Inhalte, den  Grundrechten der Nutzer sowie der grundlegenden Bedeutung der Meinungs-  und Informationsfreiheit in einer offenen und demokratischen  Gesellschaft Rechnung zu tragen ist.\n>\n> Vorschlag für eine  VERORDNUNG DES EUROPÄISCHEN PARLAMENTS UND DES RATES zur Verhinderung  der Verbreitung terroristischer Online-Inhalte \n\n\n\n**Die gerade erst angenommene Richtlinie ist nur der Anfang der Zerstörung des freien Internet.**"
		},
		{
			"post_id": 25,
			"title": "Füllhorn der Belanglosigkeiten",
			"date_published": 1555433621.916,
			"body": "![bel-title](img/bel_title.jpg)\n\nSeit Anfang März 2018 habe ich einen [Account bei Steemit](https://steemit.com/@derpepe).  Die Anmeldung war da noch echt ein Abenteuer (keine Ahnung, ob sich das  inzwischen gebessert hat) und dauerte einige Wochen bis zur Bestätigung  und Freischaltung.\n\nDer Grund dafür, mich dort anzumelden war schlicht Neugier auf das  Projekt. Wer nicht weiß, was Steemit überhaupt ist… hmmm… na das ist  eine Art Soziales Netzwerk und Blogging-Plattform, die am ehesten noch  mit Reddit zu vergleichen ist… also von der Funktionalität. Die  Umsetzung hingegen unterscheidet sich massiv, denn es ist kein  zentralisierter Dienst, sondern funktioniert dezentral mit  Blockchain-Technik auf Basis der [Steem-Blockchain](https://steem.com/SteemWhitePaper.pdf).\n\nDie Social-Media-Plattform ist dadurch zensurresistent… mit allen  Vor- und Nachteilen. Inhalte, die man in die Blockchain geladen hat,  können nicht wieder entfernt werden… sie bleiben ewig erhalten und  können auch immer abgerufen werden, wenn man den Schlüssel (quasi die  „Webadresse“) kennt.\n\n---\n\nEin netter Nebeneffekt… man kann sowohl mit dem Schaffen von  Inhalten, als auch mit dem „Bewerten“ (voten) von Inhalten theoretisch  (und praktisch) Geld verdienen. Dafür wurden die Kryptowährungen STEEM  und Steem Dollar geschaffen. Wer auf Steemit unterwegs ist, verfügt über  eine sogenannte STEEM Power und eine Reputation… davon hängt es ab, was  bei der Inhaltserstellung und der Bewertung anderer Inhalte  rüberwächst. Deshalb herrschte auch von Anfang an sowas wie  „Goldgräberstimmung“, denn man hatte mit der Teilnahme an einem SN die  Möglichkeit „reich“ zu werden. 😉\n\nAls ich da eingestiegen bin, fand man auch noch einiges an wirklich  interessanten Inhalten, die wenigstens etwas „Mehrwert“ boten. Für mich  war von Anfang an aber klar, dass ich nicht wirklich groß bei Steemit  einsteige, denn ich verfüge über ausreichend andere Plattformen, auf  denen ich (größtenteils auch vollkommen selbstbestimmt) meine Inhalte  mit der Welt teilen kann. Ich brauchte also keine zusätzliche Plattform  und ich habe auch kein Interesse, mit meiner Schreiberei dort Geld zu  verdienen. Ein paar Posts habe ich verfasst, dann aber recht schnell das  Interesse verloren und jetzt auch etliche Monate nicht mehr  reingeschaut.\n\nUm so überraschter war ich, als ich vor ein paar Tagen wieder auf  Steemit ging und sehen musste, was einem dort inzwischen geboten wird.  Wirklich interessante Inhalte – insbesondere im deutschsprachigen  Bereich – findet man fast überhaupt nicht mehr. Sie sind so spärlich,  dass man sie ohnehin zwischen den ganzen Belanglosigkeiten nicht mehr  findet. Es quillt über von Bildern, hanebüchenen Kurztexten und  irgendwelchen „Spielen“ oder Zusammenstellungen zu Sportwetten,  Online-Poker-Casinos etc.\n\nSchaut man sich an, wo da „richtig“ Geld verdient wird (trending),  dann reduziert sich das auch ausschließlich auf solch einen Müll.  Zwischendrin findet man dann noch uninteressante Text- und Fotocollagen  von Selbstdarstellern… unglaublich, aber das Niveau bleibt in meinen  Augen noch deutlich hinter dem von Facebook zurück… das will schon was  heißen. \n\nBeispiele…\n\n*Sport Wetten – Bilanz nach der 10. Woche*\n*Sport Wetten – Bilanz nach der 9. Woche*\n*Die neuen 10 Gebote des Steem*\n*Steem Poker League – The Results of Yesterdays Tourney*\n*Talk Fundition With Mammasitta*\n*5 + 1 Words In English, Every Day (32-33.)*\n*Extra tough Christmas chess riddle (#69). / Knacknuss-Weihnachtsschachrätsel (#69).*\n*Tipp-post Lotto 6 aus 45 für Mittwoch 26.Dezember 2018 Weihnachtsbounty*\n*5 + 1 Words In English, Every Day (30-31.)*\n*Steem Poker League – Come over for some Poker!*\n*Vlog #94 – Fröhliche Weihnachten!*\n*Steem Blitz Chess Tournament December 22nd … And the winner is …*\n*24 Dezember – Adventskalender von @louis88 – FROHE WEIHNACHTEN!!!*\n*Sport Wetten – Bilanz nach der 8. Woche*\n*SteemMonsters Questlog #2*\n*Pottausschüttung #40 Bratapfel Edition – Eure Zimtschnecken der Woche [STEEM zu verschenken]*\n*Unser Lotto Schein für Heute 23.Dezember 2018*\n*Announcement: STEEM SUPER Blitz Chess Tournament Saturday 22nd December 20 GMT/ Ankündigung: STEEM*\n*Chess Lesson 7 – Checkmate / Schach Lektion 7 – Matt*\n*Licensed exchanges and wallets are on the way.*\n*Putting my weekly deposit of 375 more Steem to my collection!!*\n*The @berniesanders Steem Monsters Invitational – 2500 Steem Tournament!*\n*ALTBET RELEASES IT’S MUCH-AWAITED ESPORT BETTING PLATFORM – ABSOLUTELY BREATHTAKING*\n*World of Ether based on Ethereum blockchain ( ↩️ Resteem ▶️ $0.5 👍)\nCris Cyborg Readying for UFC Championship Bout With PIVX In Her Corner\nChibera – Auction House SMT Currency [Tokens]\nVoyager, The Coinbase Killer — New „Feeless“ Exchange Giving Away $25 in BTC*\n\nSchade… die Plattform wäre in meinen Augen durchaus geeignet gewesen,  mal was neues, wertvolles im Bereich Social Media und Blogging zu  werden… aber das Prinzip, wie man da „Geld verdienen“ kann, hat die  Sache inzwischen komplett gegen die Wand gefahren. Offenbar lässt sich  mit Belanglosigkeiten am besten Schütte generieren und das schaukelt  sich dann über Bewertungen noch hoch. Dieser Prozess wird sich auch  nicht mehr umkehren lassen.\n\nFür mich jedenfalls ist Steemit tot. Ich werde da in größeren  Abständen mal reinschauen, um zu gucken, ob ein Wunder passiert, aber  nutzen werde ich diese Plattform nicht mehr."
		},
		{
			"post_id": 24,
			"title": "RSS lohnt",
			"date_published": 1555432684.543,
			"body": "![rss-title](img/rss-title.png)\n\nUm zu Themen, die einen interessieren, auf dem Laufenden zu bleiben,  kann man Newsletter abonnieren, lange Lesezeichenlisten durchklicken,  sich die Gockel-Njuhs entsprechend konfigurieren oder darauf vertrauen,  dass einem die passenden Meldungen in das bevorzugte Soziale Netzwerk  gespült werden.\n\n**Oder man nutzt RSS!**\n\nRSS ist ein Dinosaurier… diese Form der Web-Feeds gibt es schon seit  1999 und sie wurde seitdem weiterentwickelt. Ein RSS-Feed ist eine Art  „Nachrichtenticker“ der Informationen über neue Inhalte auf Webseiten  liefert und wird von unzähligen Seiten angeboten. Viele Seitenbetreiber  wissen vielleicht nicht einmal, dass auch ihre Präsenz sowas anbietet.  Blogs, Nachrichtenseiten, ja sogar Foren bieten auch heute noch  RSS-Feeds an und es ist empfehlenswert, diese zu „abonnieren“ (das  bedeutet, dass man ein Feedreader-Programm mit dem entsprechenden Feed  „füttert“ und es in regelmäßigen Zeitabständen nach neuen Inhalten  schaut und sie einem schließlich präsentiert).\n\n---\n\nBei heise online erschien im Sommer ein Kommentar mit dem Titel „[RSS ist tot und das ist eine Schande](https://www.heise.de/newsticker/meldung/Kommentar-RSS-ist-tot-und-das-ist-eine-Schande-4127128.html)“, in welchem der Autor darlegt, weshalb in seinen Augen RSS „tot“ und das ein echter Verlust sei.\n\nWas den Verlust angeht, kann ich dem Verfasser des Artikels nur  beipflichten, aber den Totenschein möchte ich RSS wirklich nicht  ausstellen. Es schläft vielmehr… und es ist dringend geboten, es wieder  zu erwecken.\n\nSich mit Neuigkeiten und Informationen per RSS zu versorgen, hat  nämlich echte Vorteile. Man stellt sich seinen News-Stream selbst  zusammen, wird nicht mit Werbung genervt und hat die Informationen  zusammen an einem Ort. Gerade in Zeiten, wo man „Nachrichten“ nicht mehr  uneingeschränkt glauben kann, ist es sinnvoll, sich aus  unterschiedlichsten Quellen (natürlich auch die, die nicht unbedingt zur  eigenen „Filterblase“ gehören) zu informieren… und dafür ist RSS  geradezu prädestiniert.\n\nUm RSS-Streams zu abonnieren und anzuschauen, benötigt man einen  Feed-Reader. Es gibt zahlreiche solche Programme… einige sind recht gut,  andere eher mäßig… und sie sind nicht gerade „prominent“. Eine  Alternative ist es, RSS-Feeds mit dem Mailprogramm zu verwenden, sofern  der Mail-Client diese Funktionalität bietet. Der Webbrowser Firefox bot  bis vor kurzem auch einen integrierten Feed-Reader an, der jetzt aber  rausgeschmissen wurde. Es gibt aber auch noch Addons für Webbrowser, die  diese Funktionalität bieten.\n\nGrundsätzlich spricht nichts dagegen, ein extra Programm zu nutzen,  oder den Mail-Clienten. Ich habe selbst bis vor kurzem ausschließlich  Thunderbird dafür benutzt. Allerdings bietet sich die Nutzung im Browser  an, denn es werden einem ja vorwiegend Webinhalte präsentiert… und so  findet man die Feeds da, wo man die eigentlichen Quellen ohnehin  aufrufen will.\n\nIch habe einige Addons ausprobiert, mit den meisten war ich aber  nicht zufrieden. Aber es gibt einen Feed-Reader also Browser-Addon, den  wirklich Spaß macht und den ich wirklich empfehlen kann: [Feedbro](https://nodetics.com/feedbro/)!\n\nFeedbro kann als Addon mit dem Firefox, mit Chromium, Vivaldi und  auch mit Opera genutzt werden. In der Toolbar erscheint nach der  Installation ein Icon, mit welchem man Zugriff auf den Feed-Reader hat.  Feedbro ist sehr gut zu konfigurieren und einfach zu benutzen. Ein Klick  auf das Icon öffnet ein Menü, in welchem die neuesten Feed-Einträge  angezeigt werden.\n\n![fbr01](img/fbr01.png)\n\nMan hat damit unmittelbar Zugriff auf die Meldung. Auch die \nEinstellungen sind in dem Menü erreichbar… und man kann den Feed-Reader \nvon dort aus auch öffnen. Er öffnet sich in einem extra Tab. Hier hat \nman dann einen Überblick über die Feeds und auch die Hierarchie (man \nkann Feeds z.B. in Ordnern gruppieren).\n\n![fbr04](img/fbr04.png)\n\nFeedbro ermöglicht es, Feed-Beiträge zu „favorisieren“, mit Tags zu \nversehen und an verschiedene Dienste zu senden. Eine Hierarchie \nabonnierter Feeds kann auch also OPML—Datei ex- und importiert werden. \nHatte man z.B. schon eine Sammlung von Feeds bei Thunderbird oder in \neinem externen Reader, so kann man dort die Feeds exportieren und mit \nder Import-Funktion ganz einfach in Feedbro importieren.\n\n![fbr05](img/fbr05.png)\n\nEine weitere sehr nützliche Funktion ist das Abonnieren von Feeds direkt\nüber das Menü. Befindet man sich auf einer Webseite und möchte man den \nFeed dieser Seite (so einer angeboten wird) abonnieren, dann klickt man \neinfach auf das Toolbar-Icon und es werden ggf. angebotene Feeds \nangezeigt, die man per Klick abonnieren kann. Das ist besonders bei \nWebseiten nützlich, die ihr RSS-Angebot gut „versteckt“ haben oder es \ngar nicht auf der Seite zugänglich machen. Eine lange Suche nach dem \nRSS-Icon oder dem RSS-Link auf der Seite erübrigt sich.\n\n![fbr02](img/fbr02.png)\n\n\n\n![fbr03](img/fbr03.png)\n\nIch kann nur sagen, dass sich RSS auch heute noch lohnt… heute  vielleicht sogar mehr denn je. Und den Tod von RSS können wir  verhindern, indem wir es nutzen und bei Inhalteanbietern, die keinen  Feed anbieten, einfach einmal nachfragen, ob sie das nicht einrichten  wollen.\n\nWie man RSS nutzt, bleibt jedem selbst überlassen, aber ich kann  wirklich empfehlen, einen Blick auf Feedbro zu werfen. Dieser Reader  macht wirklich Spaß und man ist immer informiert."
		},
		{
			"post_id": 23,
			"title": "Spannend wird es",
			"date_published": 1555432413.84,
			"body": "![spannend](img/spannend.jpg)\n\nJa, spannend wird es, zu beobachten, was die EU mit dem freien Internet vorhat.\n\nEs wird ja schon geraume Zeit an Vorgaben gewerkelt, welche die  Verbreitung von terroristischen Inhalten im Internet bekämpfen sollen.  Es soll eine Verordnung auf den Weg gebracht werden, die den schönen  Titel „ Verordnung des Europäischen Parlaments und des Rates zur  Verhinderung der Verbreitung terroristischer Online-Inhalte“ tragen  soll.\n\nMan beachte… es geht um eine Verordnung, also eine gesetzliche Regelung, die unmittelbar für alle EU-Mitgliedsstaaten gilt.\n\nNun gibt es an der Absicht, die Verbreitung terroristischer Inhalte  im Internet zu bekämpfen, ja wirklich nichts zu kritisieren. Adressaten  sind nur diejenigen, die solche verbreiten wollen. Also eigentlich doch  alles klar, kein Problem, prima Sache…\n\n---\n\nDoch leider wird die Umsetzung etliche Nebenwirkungen haben, die das  freie Internet komplett verstümmeln könnten und nebenbei auch noch  Mechanismen einführen, die geeignet sind, relativ unspektakulär eine  Form der Zensur einzuführen.\n\nSchaut man sich den [Entwurf der Verordnung](https://eur-lex.europa.eu/legal-content/DE/TXT/PDF/?uri=CONSIL:ST_14978_2018_INIT&from=EN)  an, dann stolpert man über einige Punkte, die man so gar nicht glauben  möchte… hilfreich ist es, wenn man sich dazu auch noch das [Factsheet](http://europa.eu/rapid/press-release_MEMO-18-5711_de.htm)  (Pressemitteilung) der EU ansieht. In diesem Factsheet werden nämlich  die beim Lesen des Entwurfs aufkeimenden Befürchtungen bestätigt.\n\nDen miesen Auftakt macht hier die Regelung des Geltungsbereichs und der Adressaten…\n\nDie Verordnung gilt für alle Mitgliedsstaaten der EU. Und an die  Vorgaben müssen sich alle Anbieter von Hosting-Diensten in der EU  halten. Es wird dann auch erklärt, wer denn damit gemeint ist:\n\n> „Hostingdiensteanbieter“ einen  Anbieter von Diensten der Informationsgesellschaft, die darin bestehen,  die durch einen Inhalteanbieter bereitgestellten Informationen im  Auftrag des Inhalteanbieters zu speichern und die gespeicherten  Informationen Dritten zur Verfügung zu stellen;\n\nDas klingt ja erstmal harmlos, trifft es oberflächlich betrachtet nur  Hostingprovider… dann lass die diese Suppe einfach auslöffeln… kümmert  mich als eventueller „Kunde“ (als Inhalteanbieter) ja nicht wirklich,  sofern ich nicht vorhatte, terroristische Inhalte hochzuladen.\n\nDas Factsheet erläutert dann aber, was mit diesem Begriff alles gemeint ist:\n\n> Die neuen Vorschriften gelten auch  für Hosting-Dienste, die Informationsdienste bereitstellen,  einschließlich der Speicherung von durch die Nutzer geteilten  Informationen und der Bereitstellung von Informationen für Dritte.  Beispiele hierfür sind **Plattformen sozialer Medien,  Videostreamingdienste, Video-, Bild- und Audio-Sharing-Dienste,  File-Sharing- und andere Cloud-Dienste sowie Websites, auf denen die  Nutzer Kommentare oder Rezensionen abgeben können**.\n>\n> (Hervorhebung durch mich erfolgt)\n\nNa? Noch immer nicht betroffen? Na vielleicht als Betreiber z.B.  eines Blogs mit Kommentarfunktion jetzt vielleicht doch? 😉 Ok… dem kann  man ja noch vorbeugen, indem man Kommentare grundsätzlich manuell  freischaltet… geht aber nur bei geringem Kommentaraufkommen. Bei einem  Internetforum ist das so schon mal nicht mehr möglich.\n\nUnd überhaupt… das wird doch sicher nur für „die Großen“ gelten… aber eher nicht für kleine Plattformen, oder?\n\nNun, die Hoffnung trügt. Während im „Maas‘schen  Netzzersetzungsgesetz“ noch eine Beschränkung auf große Netzwerke  festgelegt ist, stellt das Factsheet klar:\n\n> Da zunehmend kleinere  Diensteanbieter von terroristischen Inhalten betroffen sind, werden  Unternehmen nicht aufgrund ihrer Größe von den neuen Vorschriften  ausgenommen.\n\nAlso… **das gilt für jeden!**\n\nSo weit, so gut… aber das „Drama“ ist hier noch nicht zu erkennen. Das kommt erst noch…\n\nStellt eine nationale Behörde nun fest, dass auf einer Plattform (das  kann also z.B. auch der Kommentarbereich einer Webseite oder ein  Internet-Forum sein) „terroristische Inhalte“ veröffentlicht wurden,  dann ergeht an den Betreiber (also ggf. auch an den Blogbetreiber oder  den Forenbetreiber) eine sogenannte Entfernungsanordnung. Der Betreiber  muss den Inhalt entfernen. Ist ihm der Inhalt der Anordnung zu dünn,  kann er noch nähere Erläuterungen, aber er bleibt erstmal grundsätzlich  in der Pflicht, zu löschen.\n\nNun mag man meinen, das sei doch gut so, dass solche Inhalte gelöscht werden. Und das ist es ja auch. Aaaaaaber…\n\nJa, aaaaber… es wird für die Umsetzung der Entfernungsanordnung eine  Frist gesetzt, innerhalb der die Inhalte gelöscht werden müssen. **Und zwar genau eine Stunde!**\n\n> Die Hostingdiensteanbieter  entfernen die terroristischen Inhalte innerhalb einer Stunde nach Erhalt  der Entfernungsanordnung oder sperren den Zugang dazu.\n\nJa, richtig gelesen… **eine verkackte Stunde** nach  Eingang der Anordnung auf elektronischem Wege, muss gelöscht oder  nachgehakt (und dann wohl eh gelöscht) werden. Eine Stunde… und schon  sind z.B. Webseitenbetreiber mit Kommentarfunktion oder Forenbetreiber  in den Arsch gekniffen. Sie müssten, um das sicherzustellen, eine  7/24-Betreuung ihrer Präsenzen auf die Beine stellen. Das ist doch  Irrsinn… in welchem Paralleleuniversum leben die Verfasser der  Verordnung eigentlich? Oder ist das Absicht? Für ganz große Anbieter mag  das noch gehen… aber das überfordert mit Sicherheit sogar auch schon  kleinere und mittlere Hostinganbieter.\n\nDas ist jetzt also „Drama“ Nr. eins.\n\nDas zweite Drama folgt sofort…\n\n> Die Hostingdiensteanbieter  ergreifen je nach Risiko und Ausmaß der möglichen Beeinflussung durch  terroristische Inhalte […] proaktive Maßnahmen, um ihre Dienste vor der  Verbreitung terroristischer Inhalte zu schützen.\n\nProaktive Maßnahmen… das bedeutet nichts anderes als **Uploadfilter**.\n\nDas Factsheet konkretisiert:\n\n> Nach den neuen Vorschriften müssen  Hosting-Dienste proaktiv tätig werden, wozu gegebenenfalls die  Einführung von Instrumenten zur automatischen Erkennung gehört, sofern  sie Gefahr laufen, dass über sie terroristische Inhalte bereitgestellt  werden.\n\nUnd auch das ist wieder ein Ding, das nur die ganz großen Player  leisten können. Uploadfilter für Webseiten mit Kommentarfunktion sind  utopisch… und für Foren ebenfalls. Das ist schlicht nicht leistbar.\n\nAbgesehen davon ist das auch ein Einfallstor für Zensur. Es ist  leicht einen Filter so zu erweitern, dass auch andere Inhalte gesperrt  werden… JETZT geht es nur um „terroristische Inhalte“, aber wenn die  Mechanismen erstmal da und gesetzlich vorgeschrieben sind, ist es  verführerisch, diese auch gegen andere „missliebige“ Inhalte zu  missbrauchen.\n\nEs wird also auf jeden Fall spannend, zu beobachten, ob das Dingen  jetzt so durchkommt. Die Innenminister der EU-Staaten (außer  Tschechische Republik und Dänemark) haben schonmal zugestimmt. Und  spannend auch die Frage, wie sich das letztlich auswirken wird. Wird es  wirklich so strikt durchgezogen, dann ist das das Ende des freien Web,  wie wir es kennen. **Dann bleibt nur noch, tatsächlich auf dezentrale P2P-Netze auszuweichen**… und damit zu leben, dass es dort dann auch „terroristische Inhalte“ gibt, die ebenfalls zesurresistent sind."
		},
		{
			"post_id": 22,
			"title": "ZeroNet: Die Grundlagen",
			"date_published": 1530728802.052,
			"body": "Übersetzung des Beitrags “[The Basics](http://127.0.0.1:43110/DevCenter.bit/?/tutorials/the_basics)” von [krixano](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu/krixano@zeroid.bit) und [glightstar](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy/glightstar@zeroid.bit). ([MIT-Lizenz](https://github.com/krixano/ZeroNet-Dev-Center/blob/master/LICENSE))\n\n\n\n## Einführung\n\nBevor wir mit der Erstellung von Zites beginnen, ist es nützlich zu\nwissen, wie Zites bei ZeroNet funktionieren. In diesem Tutorial erfahren\nSie, wie Sie eine leere Zite erstellen, wo Sie Ihren Code ablegen\nkönnen, was Sie benötigen, bevor Sie Ihre Zite veröffentlichen können\nund wie sie aktualisiert, übertragen und sicher aufbewahrt wird.\n\n---\n\nZites bestehen aus grundlegendem Webcode, einschließlich html, css und\njs. Darüber hinaus werden JSON-Dateien zum Speichern von Daten verwendet\nund ZeroNet wird mitgeteilt, welche Datenbanken Sie haben und wie sie\nstrukturiert sind.\n\nDa ZeroNet keinen Server verwendet - alles wird auf Ihren Computer\nheruntergeladen und lokal ausgeführt - gibt es keine Möglichkeit,\nserverseitiges Scripting auszuführen. Dies wird jedoch durch die\nVerwendung der ZeroNet API namens ZeroFrame behoben. Mit dieser API\nkönnen Sie Server- / Site- / Benutzerinformationen abfragen, Dateien\nüber eine WebSocket-Verbindung zu Ihrem ZeroNet-Client laden oder ändern\nsowie Datenbanken abfragen und ändern. [1]\n\n## Eine Zite erstellen\n\nEs gibt derzeit zwei Möglichkeiten zum Erstellen einer Zite. Sie können\neine vorhandene Zite klonen oder Sie können Ihre eigene Zite von Grund\nauf neu erstellen. Wenn Sie sich entscheiden, eine Zite zu klone, gibt\nes viele davon, aus denen Sie wählen können, einschließlich [ZeroBlog](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/).\nWenn Sie jedoch Ihre eigene Zite von Grund auf neu erstellen möchten,\nwird in den nächsten Tutorials behandelt. [2]\n\nUm eine Zite zu klonen, finde eine Zite, die du klonen willst, besuche\ndie Zite, damit sie auf deinen Computer heruntergeladen wird. Als\nnächstes gehe zurück zu ZeroHello und finde die Zite in der Sidebar.\nKlicke auf das Menüsymbol und klicke auf „Klonen\".\n\nUm eine leere Zite zu erstellen, gehen Sie zu ZeroHello, klicken Sie\noben links neben dem ZeroHello-Logo auf das Menüsymbol und klicken Sie\nauf „Neue, leere Zite erstellen\". Sobald Sie darauf klicken, werden Sie\nzu Ihrer neuen leeren Zite weitergeleitet. Notieren Sie sich die\nAdresse, das ist die Adresse, die die Leute benutzen werden, um Ihren\nOrt zu besuchen. Eine leere Zite wird alles einrichten, was Sie\nbrauchen, um mit dem Erstellen einer Zite von Grund auf zu beginnen.\n\n## Die Seitenleiste\n\nDie Sidebar ist *der* Ort, an dem Sie Informationen zu beliebigen Orten\nabrufen können. Sie kann durch einen Besuch einer Zite erreicht werden,\nindem Sie den transparenten Kreis mit der 0 in der Mitte nach links\nziehen. Hier können Sie einen interaktiven Globus sehen, den Sie drehen\nkönnen, der alle Peers über dem Globus anzeigt. Es gibt eine Liste von\nverschiedenen Eigenschaften darunter:\n\n1. **Peers**: Zeigt an, mit wie vielen Peers Sie verbunden sind, wie\n   viele Verbindungen Sie herstellen können, wie viele Onions verwendet\n   werden und wie viele Peers insgesamt vorhanden sind\n2. **Datentransfer**: Zeigt an, wie viele Daten auf der geöffneten Zite\n   gesendet und empfangen wurden\n3. **Dateien**: Zeigt an, wie groß die Summe der verschiedenen\n   Dateiformate ist\n4. **Größenbeschränkung**: Zeigt an, wie viel des Dateigrößenlimit Sie\n   verwenden (in%), wie viel freier Speicherplatz auf Ihrer Festplatte\n   zur Verfügung steht, und eine Eingabe, um das Zites-Dateigrößenlimit\n   festzulegen\n5. **Optionale Dateien**: Zeigt an, wie viele Daten Sie von allen\n   optionalen Dateien auf der Zite heruntergeladen haben\n6. **Herunterladen und helfen, alle Dateien zu verteilen**:\n   Umschalten, wenn Sie *alle* optionalen Dateien herunterladen und\n   verteilen möchten\n7. **Datenbank**: Zeigt an, wie groß die Datenbank ist, den Pfad zu ihr\n   (relativ zum Zite-Pfad), eine Schaltfläche zum erneuten Laden des\n   Datenbank-Schemas und eine Schaltfläche zum Neuerstellen der\n   Datenbank\n8. **Identitätsadresse**: Zeigt an, wie viel Speicher Sie auf der Zite\n   benutzt haben, dessen Gesamtmenge vom Eigentümer festgelegt wurde,\n   und Ihre Authentifizierungsadresse mit einer Schaltfläche, um ein\n   anderes Konto auszuwählen\n9. **Seitenkontrolle**: Die erste Schaltfläche versucht, die\n   neueste verfügbare Version für jeden verbundenen Peer abzurufen, die\n   zweite puffert den Download neuer Daten, und die dritte löscht die\n   komplette Version von der Festplatte\n10. **Websiten-Adresse**: Zeigt die Zite-Adresse an (dies kann\n    hilfreich sein, um die Zite in Ihrem Datenverzeichnis zu finden,\n    wenn Sie über eine .bit-Adresse darauf zugreifen)\n11. **Fehlende Dateien**: Zeigt eine Liste aller Dateien an, die laut\n    ZeroNet-Client fehlen\n12. **Das ist meine Seite**: Schalter, um umzuschalten, wenn du diese\n    Zite besitzt. Wenn dies aktiv ist, werden einige andere Elemente\n    darunter angezeigt\n\nDer Listenteil **Das ist meine Seite**:\n\n1. **Seitentitel**: Eingeben, um den Titel der Zite zu ändern\n2. **Seitenbeschreibung**: Eingabe, um die Beschreibung der Zite zu\n   ändern\n3. **Speichern Sie die Websiteeinstellungen**: Eine Schaltfläche, um\n   die letzten beiden Eingaben in die `content.json`-Datei der Zeit zu\n   speichern\n4. **Inhalt veröffentlichen**: Eine Liste von Dateien, die Sie\n   unterschreiben können (klicken Sie auf diese, um sie in die Eingabe\n   unten einzufügen), ein Feld zum Eingeben der Datei, die Sie\n   signieren / veröffentlichen möchten, eine Schaltfläche zum Signieren\n   der ausgewählten Datei und eine weitere zum Veröffentlichen bei\n   verbundenen Peers\n\n## Wo wird eine Zite lokal gespeichert?\n\nWenn Sie den Code für Ihre Zite ändern müssen, finden Sie Ihre Zite im\nOrdner `ZeroNet_Root/data` unter dem Verzeichnis Ihrer Zite-Adresse. Dies\nentspricht der in der Seitenleiste angezeigten `site-address`. Wenn Sie\nzum ersten Mal starten, sollte dieses Verzeichnis eine Datei\n`content.json`, eine Datei `index.html` und ein `js`-Verzeichnis enthalten, in\ndem sich die Datei `ZeroFrame.js` befindet.\n\n## content.json-Datei, was ist das?\n\nWenn ein Besucher Ihre Zite besucht, wird als erstes die Datei\n`content.json` der Zite heruntergeladen. Diese `content.json`-Datei enthält\nalle anderen Dateinamen, die heruntergeladen werden müssen, um die Zite\nzusammen mit ihren Hashes zu verwenden, damit sichergestellt werden\nkann, dass sie die richtigen Dateien herunterladen. Dies gibt im Grunde\nInformationen über den Inhalt de Zite. Diese Datei enthält auch eine\nkryptografische digitale Signatur, die vom Eigentümer erstellt wurde, um\nzu überprüfen, ob die Datei `content.json` von anderen Personen, als dem\nBesitzer des Zite-Objekts, manipuliert wurde. Die Datei enthält weitere\nInformationen, wie die ZeroNet-Version, für die die Zite erstellt wurde,\ndie geänderte Nummer, die angibt, welche Version der Zite\nheruntergeladen wird, den Titel und die Beschreibung der Zite, die\nAdresse, aus der Sie die Zite geklont haben, und weitere wichtige\nInformationen .\n\n## Signieren der content.json-Datei\n\nWenn Sie Änderungen an Ihrer Zite vornehmen, einschließlich der Datei\n`content.json`, müssen Sie die Datei signieren. Dies stellt sicher, dass\njedes Mal, wenn eine Person Ihre Zite herunterlädt, diese Änderungen vom\nZite-Besitzer vorgenommen wurden. Wenn Sie Ihre `content.json`-Datei\nsignieren, werden die Hashwerte für alle auf Ihrer Zite gespeicherten\nund verwendeten Dateien aktualisiert.\n\n**HINWEIS:** Wenn Sie diese Datei nicht signieren, können Besucher diese\naktualisierte Version Ihrer Zite aus Sicherheitsgründen nicht\nherunterladen. Wenn Sie keine Peers haben, können sie Ihre Zite\nüberhaupt nicht besuchen, da sie eine *signierte* `content.json`-Datei nicht\nan anderer Stelle herunterladen können.\n\n**Stellen Sie sicher, dass Sie diese Datei signieren, bevor Sie sie**\n**veröffentlichen.**\n\nUm diese Datei zu signieren, gehen Sie in die Seitenleiste und klicken\nSie im Abschnitt **Dies ist meine Website** auf Sign.\n\n## Wie Zites gesichert sind\n\nZeroNet schützt Zites mit privaten und öffentlichen Schlüsseln, wobei\nder öffentliche Schlüssel die Adresse Ihrer Zite ist. Der private\nSchlüssel wird immer auf Ihrem Computer in der Datei `users.json` im\nVerzeichnis `ZeroNet_Root/data` gespeichert. Dieser private Schlüssel\nwird verwendet, um eine digitale Signatur zu erstellen und den Hash der\nDatei `content.json` in seinem aktuellen Zustand zu verschlüsseln (mit\nAusnahme der digitalen Signatur, die in der Datei gespeichert ist).\nDiese digitale Signatur (und verschlüsselter Hash) wird dann in dieser\nDatei gespeichert. Wenn ein Besucher die Datei herunterlädt,\nentschlüsselt er zuerst die digitale Signatur mit dem öffentlichen\nSchlüssel der Zite (die Adresse der Zite). Dann verifizieren sie die\nDatei, indem sie den Hash der Datei mit dem Hash vergleichen, der\nentschlüsselt und über die digitale Signatur gesendet wurde.\n\nDadurch bleibt Ihre Zite sicher, denn die einzige Person, die die\ndigitale Signatur erstellen kann, die den Hash der Datei `content.json`\nenthält, ist die Person mit dem privaten Schlüssel - der Zite-Besitzer.\n\n## Veröffentlichen Sie Ihre Zite\n\nUm Ihre Zite zu veröffentlichen, signieren Sie einfach Ihre\n`content.json`-Datei und klicken auf „publish\" in der Seitenleiste. Diese\nSchaltflächen befinden sich in der Seitenleiste unter dem Abschnitt\n**Dies ist meine Website**. Wenn Sie keine Peers haben, müssen Sie nicht\nauf „Veröffentlichen\" klicken. Beim Veröffentlichen wird die Datei\n`content.json` an andere Peers gesendet. Ohne Peers ist dies nicht\nerforderlich, da diese Peers Ihre Zite von Ihrem Computer herunterladen,\nwenn sie Ihre Zite besuchen.\n\n## Halten Sie Ihre Zite online\n\nUm Ihre Zeit online zu halten, benötigen Sie zuverlässige und stets\naktive Peers. Wenn Ihr Computer nicht ständig mit ZeroNet verbunden ist,\nmüssen Sie entweder genügend Peers haben, um sicherzustellen, dass Ihre\nPeer-Anzahl nicht auf null fällt, wenn Sie offline sind, oder Sie müssen\nmindestens einen Peer finden, der immer online ist.\n\nEs kann eine gute Idee sein, Ihre Zite mit ZeroNet-Proxies zu verteilen,\nzum Beispiel [bit.surf](http://bit.surf:43110/). Um dies zu tun, besuchen Sie Ihre Seite einfach\nmit dem Proxy Ihrer Wahl. Dies wird dazu beitragen, Ihre Zite online zu\nerhalten, indem Sie einen anderen Computer mit der Zite ausstatten.\n[bit.surf](http://bit.surf:43110/) ist eine gute Wahl, wenn Sie ZeroNet-Suchmaschinen wie [RVRE](http://127.0.0.1:43110/rvre.bit)\nnutzen möchten.\n\nSie können Ihre Zite auch zu [New ZeroNet Sites](http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n) hinzufügen, wodurch nicht\nnur Ihre Zite weiter verbreitet wird, sondern auch Seeder, die aus\ndieser Liste neuer Zites stammen.\n\nUnd schließlich können Sie Ihre Zite auch zu [ZeroSites](http://127.0.0.1:43110/Sites.ZeroNetwork.bit) hinzufügen, damit\nsie leichter gefunden werden kann.\n\n## Aktualisieren Ihrer Zite\n\nDie Aktualisierung Ihrer Zite ist ziemlich einfach. Nachdem Sie\nÄnderungen an der Zite vorgenommen haben, müssen Sie zunächst Ihre Zite\nsignieren. Dadurch werden die Hashwerte und die digitale Signatur in der\nDatei `content.json` aktualisiert. Nachdem Sie dies getan haben, klicken\nSie auf \"Veröffentlichen\". Dadurch wird die neue Datei `content.json` an\nmaximal 6 verschiedene Peers gesendet. Diese Peers überprüfen, ob die\nDatei neuer ist als die, die sie bereits haben. Wenn dies der Fall ist,\nladen sie den Rest der Dateien herunter, die geändert / aktualisiert\nwurden (durch Vergleich der Hashes in der neuen Datei content.json mit\nden Hashes in der alten Datei `content.json`, um festzustellen, ob sie\nsich geändert haben).\n\nNachdem ein Peer die aktualisierten Dateien gespeichert hat, sendet er\ndiese mit der gleichen Methode wie oben an andere Peers. Schließlich\nhaben alle Peers die aktualisierten Dateien.\n\nBeachten Sie, dass vor einem Peer-Download die geänderten Dateien\nzunächst geprüft werden, ob die Datei `content.json` vom Zite-Besitzer\ngeändert wurde, indem der Hash der Datei mit dem entschlüsselten Hash\nder digitalen Signatur verglichen wird. Und nachdem sie die\naktualisierten Dateien heruntergeladen haben, werden sie auch mit den\nHashes in der Datei `content.json` überprüft.\n\n------\n\n[1] Es gibt eine Seite auf ZeroNet Read The Docs, die einen Verweis auf\ndie ZeroFrame [API](http://127.0.0.1:43110/1Docsfk5uLvuXkL4U13eYDxCm2gzi1fNQq/site_development/zeroframe_api_reference/) gibt.\n\n[2] Es gibt auch [dieses Tutorial](http://127.0.0.1:43110/blog.zeronetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1) von ZeroBlog."
		},
		{
			"post_id": 21,
			"title": "Prima: DU hast Dich entschlossen, ZeroNet auszuprobieren!",
			"date_published": 1530713445.362,
			"body": "![entschlossen_title.jpg](img/entschlossen_title.jpg)\n\nNun musst Du Dich da zurechtfinden. Das wird schon… ist nicht so kompliziert. Deutschsprachige Inhalte sind noch Mangelware, aber der Zustand bessert sich. Und um dem abzuhelfen, kannst Du ja selbst z. B. ein (Dein) Blog auf 0net umsetzen.\n\n---\n\nSo hat das Lilith gemacht und mir den Link \"spendiert\". Leider konnte ich mir das Ergebnis nicht anschauen… und das hat einen Grund: Ihr ZeroNet (die ZeroNet-Software) lief zu dem Zeitpunkt, als ich den Link ausprobieren wollte, nicht.\n\n\n\n**Dazu mal ein paar Erklärungen:**\n\nLegst Du eine Seite in 0net an, so existiert die im ersten Moment NUR auf Deinem eigenen Rechner und liegt in dem lokalen Verzeichnis auf Deinem Rechner. Wenn die 0net-Software nun läuft und jemand (z. B. ich) die Seite anfordert, so landet die Anforderung letztlich bei Deinem Rechner und quasi (vereinfacht gesprochen, WAS übertragen wird, kann man festlegen) der gesamte Inhalt des Verzeichnisses wird beim Anforderer heruntergeladen und in ein gleichlautendes Verzeichnis gespeichert und die Signatur überprüft (um die Seite zu verifizieren). Er sieht die Seite nun mit 0net.\nHätte er die Seite aufgerufen (so wie ich), während Deine 0net-Software nicht läuft, so hätte er eine Fehlermeldung erhalten (keine Peers, content.json kann nicht geladen werden). Bei 0net ist es so, dass eine Seite nur abrufbar ist, wenn MINDESTENS ein Rechner, auf dem das Seitenverzeichnis samt Inhalt liegt, die 0net-Software laufen lässt (und der Rechner natürlich mit dem Internet verbunden ist).\n\nHätte in Liliths Fall jemand, bevor sie den Rechner ausgeschaltet oder die 0net-Software beendet hat, die Seite angesurft, so hätte ich sie auch sehen können, wen derjenige sein 0net noch \"eingeschaltet\" hätte. Wenn ich sie dann angesurft (und damit den Verzeichnis-Inhalt heruntergeladen) hätte, so gäbe es zu dem Zeitpunkt dann schon 2 Peers, die die Seite im 0net anbieten. Wenn Du dann Dein 0net auch wieder gestartet hättest, wären es sogar schon drei.\n\nEs ist also sinnvoll und wichtig, dafür zu sorgen, dass die eigene Seite nach Erstellung von möglichst vielen anderen 0net-Nutzern angesurft wird, weil diese dann dafür sorgen, dass die Seite erreichbar ist.\n\nAber wie macht man das? Das ist sehr einfach… man muss den anderen 0net-Nutzer nur mitteilen, dass es was neues im 0net gibt. Perfekt dafür ist die Seite [0list](http://127.0.0.1:43110/0list.bit/). Dort stellen sehr viele Nutzer (ich denke quasi alle) ihre Seiten vor. Und Du machst das auch, indem Du auf \"+Add new site\" klickst, den Titel Deiner Seite eingibst und im Feld darunter die Linkadresse zu Deiner Seite.\n\nWichtig nun: Jetzt 0net nicht gleich beenden… ne Weile laufen lassen. Ab und zu mal auf ZeroHello schauen und gucken, ob sich in der Seitenleiste links was zeigt. Neben Deiner Seite (also den \"Knopp\", mit dem Du diese aufrufen kannst) steht nämlich ne kleine Zahl, die die Anzahl von Peers angibt. Steht da ne \"1\", dann gibt es noch keinen, der Deine Seite ebenfalls anbietet (der eine bist nämlich Du selbst). Aber in der Regel finden sich nach einiger Zeit einige Peers ein. Dann kannst Du 0net auch beenden… Deine Seite sollte erreichbar bleiben (also so ab 5 Peers ist das schon ganz gut).\n\nHast Du ne Stunde gewartet, oder zwei… und es bleibt bei \"1\" Peer, dann kannst Du tricksen. Du musst die Seite einfach über einen (derzeit gibt es leider nur einen einzigen mir bekannten funktionierenden) Proxy aufrufen. Damit gibt es dann zumindest EINEN weiteren Peer und Du musst nicht online bleiben und 0net laufen lassen… die Seite bleibt für alle erreichbar. Wenn dann jemand durch 0list darauf aufmerksam wird (während Du schon offline bist), kann er sie trotzdem aufrufen und Du hast einen weiteren Peer dazugewonnen.\n\nDas mit dem Proxy funtioniert so (denke dran, während Du das machst, muss Dein 0net noch laufen):\n\nDu rufst die Adresse\n\nhttps://www.zerogate.tk/\n\nauf.\n\nist… mal am Beispiel von Liliths Seite, die ja\n\n`http://127.0.0.1:43110/18vmpzoowv3eWQ3jNF4FvK6jtdTYn2Lbwc/`\n\nlautet ganz einfach\n\n18vmpzoowv3eWQ3jNF4FvK6jtdTYn2Lbwc\n\nSie hätte also\n\n`https://www.zerogate.tk/18vmpzoowv3eWQ3jNF4FvK6jtdTYn2Lbwc/`\n\naufrufen müssen.\n\n\n\n**Was habt Ihr daraus jetzt gelernt?**\n\nGenau… eine Seite braucht mindestens einen zusätzlichen Peer (zum eigenen), damit sie erreichbar bleibt… fünf sind erstrebenswert… besser mehr.\n\n\n\n**Ach ja… noch ein Hinweis:**\n\nWenn Du neue Inhalte zu Deiner Seite hinzufügst, musst Du das nicht wieder bei 0list posten. Jeder, der Peer ist, bekommt die neuen Inhalte füher oder später automatisch auf seinen Rechner geschaufelt.\n\nUnd ZeroNet kann man echt dauerhaft laufen lassen. Es verbraucht extrem wenig Ressourcen. Bei mir läuft es, solange der Rechner an ist… ohne dass ich irgendwelche Performance-Einbußen bemerke. Vorteil: Man kann 0net-Seiten jederzeit aufrufen und man unterstützt das ZeroNet, weil man als Peer lange Zeit zur Verfügung steht.\n\n\n\nDieser Artikel richtet sich speziell an Einsteiger bei ZeroNet ohne  großartige IT-Affinität. Wer detailliertere Informationen (z. B. zu den  Dateien, die heruntergeladen werden und zur Integritätsüberprüfung)  haben möchte, schaut in die KnowledgeBase, z. B. hier: [Die Grundlagen](https://pepecyb.hu/knowledge/zeronet-die-grundlagen/)"
		},
		{
			"post_id": 20,
			"title": "ZeroNet, Tor und Arch-Linux",
			"date_published": 1530657046.651,
			"body": "![problem_loesung.png](img/problem_loesung.png)\n\nEin kleines Problem tauchte vor (keine Ahnung wann… ich hab echt  nicht mitbekommen, wann das genau passierte… muss nach einem Update des  Tor-Pakets passiert sein) einiger Zeit unter Arch-Linux bei der  Verwendung von ZeroNet in Verbindung mit Tor auf.\n\n---\n\nDer Start von ZeroNet.sh  führte zu der Fehlermeldung, dass die Verbindung zu Tor nicht  hergestellt werden könne. Die Ursache war schnell gefunden: Das  Verzeichnis /var/lib/tor,  das dem Benutzer ‘tor’ und der Gruppe ‘tor’ zugeordnet ist, war zwar  für den Benutzer ‘tor’ noch lesbar, nicht jedoch für Benutzer, die auch  in der Gruppe ‘tor’ waren (was ich ja mit dem Befehl usermod -a -G Tor [deinlinuxbenutzer] erreicht hatte [1]).\n\nEin **sudo chmod 750 /var/lib/tor**  führte dann dazu, dass alles wieder funktionierte. Allerdings nicht  lange. Sobald der Service ‘tor’ gestoppt wurde und dann wieder  gestartet, waren die Verzeichnisrechte auf 700 zurückgesetzt… ZeroNet  bockte danach selbstverständlich wieder im Hinblick auf Tor.\n\nIch habe dann eine Weile gesucht und fand in der Konfigurationsdatei für Tor (/etc/tor/torrc) die Zeile **DataDirectoryGroupReadable 0**,die dazu führt, dass das Datenverzeichnis (/var/lib/tor) für Gruppenmitglieder (Gruppe ‘tor’) auf nicht-lesbar gesetzt wird.\n\nAlso schnelle mal geändert: **DataDirectoryGroupReadable 1** … und ein laaaanges Gesicht gemacht. Es änderte sich nix. Nach dem Start des Tor-Services (systemctl start tor  … oder auch beim Autostart nach dem Booten) sind die Verzeichnisrechte  trotzdem wieder auf 700 gesetzt… also für Gruppenmitglieder NICHT  lesbar.\n\nHabe mir dann noch die Service-Datei (/usr/lib/systemd/system/tor.service)  angeschaut, dort aber nix gefunden. Auch ein eher unsortiertes  Herumsuchen in den Konfigurationsdateien des Systems brachte mich nicht  weiter.\n\nWas tun? Nun, wenn man Arch-Linux nutzt, dann ist der erste Weg, die  Suche nach dem Problem auf den Projektseiten. Habe mich durch die Wikis [2 / 3] und die Foren gewühlt… aber leider auch nix gefunden. So habe ich dann die Frage im [deutschsprachigen Forum](https://bbs.archlinux.de/viewtopic.php?id=31728) [4] gestellt. Schließlich ist Arch “berühmt” für die hilfsbereite und kompetente Community.\n\nKurze Zeit später erreichten mich auch schon die ersten  Lösungsvorschläge. Die meisten klangen vielversprechend, führten aber  letztlich nicht zum Erfolg. Aber dann kam ein Tipp vom Fori schard, der  das Problem auf seinem System nachvollzogen hat und es mit einem  zusätzlichen Eintrag in der torrc beheben konnte: **CacheDirectoryGroupReadable 1**\n\nEin weiteres Forenmitglied, das sich reingehängt hat, GerBra, hat  dann auch noch genaueres zu dem Problem herausgefunden. Die Lösung  funktioniert, wenn man nicht noch zusätzlich einen anderen Pfad für das  CacheDirectory setzt. Dann nämlich entspricht das CacheDirectory dem  DataDirectory. Und hier liegt auch ein “Fehler” bei Tor vor, denn die  Konfigurationsvariable CacheDirectoryGroupReadable überschreibt faktisch die Einstellung, die man mit der Konfigurationsvariablen DataDirectoryGroupReadable  getroffen hat, sofern beide den selben Pfad nutzen. Eigentlich kein  wirklicher Fehler, eher eine Inkonsistenz. Ich werde das mal melden und  schauen, ob und wie das Problem gelöst wird. Ich denke, es wird keine  hohe Priorität erhalten, denn es handelt sich dabei eher um ein  Konfigurationsproblem… ich hätte jetzt keine Idee, wie man das besser  priorisieren könnte.\n\n**Abschließend für alle Arch-Linux-User, die meine kleine Anleitung Einfacher Start mit ZeroNet nutzen:** In der Datei **torrc** die Zeilen\n\n`DataDirectoryGroupReadable 1`\n`CacheDirectoryGroupReadable 1`\n\nergänzen… dann klappt es (wieder)!\n\n**Und dann noch ein dickes Dankeschön an die hilfreichen Foris des deutschen Arch-Linux-Forums!**  Nicht nur, dass das Problem gelöst wurde… es ging auch noch extrem  flott… innerhalb eines Tages (von gestern 21:24 bis heute gg. 12:30… und  auch Foris schlafen ja nachts vielleicht mal).\n\n------\n\n[1] <https://pepecyb.hu/2018/03/07/einfacher-start-mit-zeronet/>\n[2] <https://wiki.archlinux.org/>\n[3] <https://wiki.archlinux.de/title/Hauptseite>\n[4] <https://bbs.archlinux.de/>"
		},
		{
			"post_id": 19,
			"title": "Einfacher Start mit ZeroNet",
			"date_published": 1530656343.014,
			"body": "![zn-start_title.png](img/zn-start_title.png)\n\n\n\n**Was ist ZeroNet?**\n\nNun… ääähm… wozu das Rad neu erfinden? Um die Idee hinter ZeroNet und  die Eigenschaften zu erläutern greife ich hier einfach auf die  offizielle Dokumentation zurück, die ich hier einmal übersetzt habe.\n\n***Inoffizielle Übersetzung der ZeroNet-Dokumentation*** (<https://zeronet.readthedocs.io/en/latest/>):\n\n---\n\n**Was ist ZeroNet?**\n\nZeroNet verwendet Bitcoin-Kryptographie und Bittorrent-Technologie, um ein dezentrales, zensurresistentes Netzwerk aufzubauen.\n\nBenutzer können statische oder dynamische Websites in ZeroNet  veröffentlichen und Besucher können auswählen, ob sie die Website auch  anbieten möchten. Websites bleiben auch dann online, wenn sie nur von  einem Peer angeboten werden.\n\nWenn eine Website von ihrem Eigentümer aktualisiert wird, erhalten  alle Knoten, die diese Website anbieten (frühere Besucher), nur die  inkrementellen Aktualisierungen des Website-Inhalts.\n\nZeroNet verfügt über eine eingebaute SQL-Datenbank. Dies macht die  Entwicklung von inhaltslastigen Websites einfach. Die DB wird auch mit  Hosting-Knoten mit inkrementellen Updates synchronisiert.\n\n**Warum?**\n\n- Wir glauben an offene, freie und unzensierte Kommunikation.\n- Keine Zensur: Nachdem etwas veröffentlicht wurde, gibt es keine Möglichkeit, es zu entfernen.\n- Kein Single Point of Failure: Inhalte bleiben online, auch wenn nur ein Peer sie anbietet.\n- Unmöglich abzuschalten: Es ist nirgendwo, weil es überall ist. Die  Inhalte werden von jedem Benutzer, der dies wünscht, bereitgestellt.\n- Schnell: ZeroNet nutzt die Bittorrent-Technologie, um Inhalte schneller bereitzustellen als zentralisierte Server.\n- Funktioniert offline: Sie können auf die Seite zugreifen, auch wenn Ihr Internet nicht verfügbar ist.\n- Sicher: Das Eigentum an Inhalten wird mit derselben Kryptographie gesichert, die auch Ihre Bitcoin-Geldbörse schützt.\n\n**Eigenschaften**\n\n- Einfache, konfigurationsfreie Einrichtung.\n- Passwortlose BIP32-basierte Autorisierung: Ihr Konto ist durch die gleiche Kryptographie geschützt, wie Ihre Bitcoin-Geldbörse.\n- Aktualisierte Seiten in Echtzeit.\n- Unterstützung für Namecoin.bit-Domains.\n- SQL-Datenbank-Unterstützung: Ermöglicht eine einfachere Website-Entwicklung und schnellere Seitenladezeiten.\n- Anonymität: Volle Tor-Netzwerkunterstützung mit versteckten Diensten (.onion) statt ipv4-Adressen\n- TLS-verschlüsselte Verbindungen.\n- Automatische Öffnung des uPnP-Ports.\n- Plugin für Multiuser-Unterstützung (openproxy).\n- Funktioniert mit jedem Browser/OS.\n\n**Wie funktioniert es?**\n\nNachdem Sie ZeroNet installiert und ausgeführt haben, öffnen Sie eine  Website unter: http://127.0.0.1:43110/{zeronet_site_address} (z.B.  http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D).\n ZeroNet wird dann das Bittorrent-Netzwerk verwenden, um Peers zu finden,  die die Site verteilen, und den Inhalt der Site (HTML, CSS, JS…) von  diesen Peers herunterladen.\n Jede besuchte Seite wird auch von Ihnen angeboten.\n Jede Website enthält eine Liste aller Dateien, die in der Website in  einem SHA512-Hash verwendet werden, und eine Signatur, die mit dem  privaten Schlüssel des Website-Eigentümers generiert wird.\n Wenn der Website-Eigentümer die Website ändert, dann unterschreibt  er/sie eine neue Liste und veröffentlicht sie an die Peers. Nachdem die  Peers die Integrität der Dateiliste überprüft haben (mit Hilfe der  Signatur), laden sie die geänderten Dateien herunter und veröffentlichen  den neuen Inhalt an andere Peers.\n\n\n\nOk… jetzt soll es aber endlich losgehen!\n\nWer auf dieses kleine Tutorial verzichten möchte, der kann natürlich auch die Dokumentation verwenden: <https://zeronet.readthedocs.io/en/latest/>\n\n## Ansonsten: Anschnallen… ZeroNet hebt jetzt ab!\n\n### Installation\n\nDie Installation ist, wie ich schon im Artikel [Zeit für Alternativen](https://pepecyb.hu/2018/03/05/zeit-fuer-alternativen/) angemerkt habe, ausgesprochen einfach.\n\nZunächst [besorgt man sich das passende Programmpaket](https://zeronet.readthedocs.io/en/latest/using_zeronet/installing/) (Bundle) für Windows, macOS, Linux64 oder Linux32 und entpackt es an einer beliebigen Stelle.\n\nNun startet man unter Windows das enthaltene Programm ZeroNet.exe,  unter macOS das Programm ZeroNet.app oder unter Linux ZeroNet.sh.\n\n#### Erster Start\n\nTja… und dann läuft es auch schon. Startet man nun einen Webbrowser und gibt in der Adresszeile <http://127.0.0.1:43110/> ein, so landet man auf der Seite ZeroHello.\n\n![zn01-768x58.png](img/zn01-768x58.png)\n\nLinks findet man eine Seitenleiste mit dem ZeroNet-Logo und einem Menü  (⁝). Darunter findet man diverse Links zu ZeroNet-Seiten (Zites). Rechts oben gibt es ein Symbol, über das man das Projekt durch Spenden  unterstützen kann, sowie zwei Statusfelder. Das erste ist mit “Port:”  bezeichnet und sollte im Idealfall den Status “opened” zeigen. Daneben  wird der Status des Tor-Netzwerkes (zur Anonymisierung) gezeigt  (“Tor:”). Dort sollte “available” stehen.\n\n![zn02-182x300.png](img/zn02-182x300.png)\n\n![0.png](img/0.png)\n\nRechts neben den Statusanzeigen findet man noch ein Icon “O”… fährt man  mit dem Mauszeiger darüber, so ändert es sich in das Bekannte  “Hamburger-Menü” (☰). Ein Klick darauf führt immer zur Seite ZeroHello.  Dieses Icon findet man auf jeder Zite, so dass man darüber immer mit  einem einfachen Klick zur “Startseite” ZeroHello gelangen kann.\n\n![zn03.png](img/zn03.png)\n\nDas Menü hat weist aber noch eine Besonderheit auf. Man kann es mit  gedrückter Maustaste nach links ziehen und öffnet damit eine weitere  Seitenleiste (rechts), mit Status-Informationen über die Seite, das  Netzwerk, verbundene Peers etc., sowie einigen Einstellmöglichkeiten.\n\n![zn05-300x234.png](img/zn05-300x234.png)\n\nHat man nun die Seite ZeroHello aufgerufen, so kann es sein, dass  beim Staus “Port:” leider “closed” steht. Es ist sinnvoll noch ein wenig  zu warten und die Seite ggf. zu aktualisieren, weil ZeroNet versucht,  den benötigten Port 15441 per UPnP zu öffnen, was manchmal ein wenig  dauert. Klappt das nicht, so sollte man zunächst seinen Router  dahingehend überprüfen, ob UPnP aktiviert ist. Ist das nicht der Fall,  sollte man UPnP in den Router-Einstellungen erlauben und ZeroNet erneut  starten. Bringt auch das keinen Erfolg, so muss man den Port 15441 in  den Router-Einstellungen unter “port forwarding” freigeben. Das ist von  Router zu Router verschieden. Bei YouTube findet man aber zu sehr vielen  Routern Anleitungen (z. B. <https://www.youtube.com/watch?v=aQXJ7sLSz14>).\n Allerdings funktioniert die Freigabe via UPnP bei den meisten Routern problemlos, weshalb dieses Problem eher selten ist.\n\n### ZeroNet und Tor\n\nWird ein Fehler beim Status “Tor:” gezeigt, dann kann man ZeroNet  natürlich ganz normal nutzen, muss sich aber im Klaren darüber sein,  dass man nicht anonym unterwegs ist. Grundsätzlich ist die Idee von  ZeroNet ja auch nicht, ein “Darknet” zu bieten, sondern ein verteiltes  Netzwerk, bei dem man von Hostern unabhängig ist und wo Zensur oder  Unterdrückung von Inhalten praktisch nicht möglich ist. Die Option, Tor  zu nutzen, fügt dem Konzept das Onion-Routing-Prinzip zu, wodurch die  eigene Identität verschleiert wird.\n\nUnter Linux und macOS muss man dazu Tor installiert haben. Wie das  funktioniert, sollte bekannt sein… bei Linux hängt es ja auch von der  gewählten Distribution und deren Paketmanagement ab.\n\nBei Debian und Ubuntu (sowie deren “Ablegern”) sollte man, um immer  die aktuellste Version von Tor zu nutzen, das entsprechende Repository  zur Quell-Liste hinzufügen.\n\nDies geschieht durch Zufügen von\n\n`deb http://deb.torproject.org/torproject.org <DISTRIBUTION> main`\n\nzur Datei /etc/apt/sources.list (<DISTRIBUTION> durch die Bezeichnung der eigenen Distribution ersetzen).\n\nNun benötigt man noch die Signatur-Schlüssel für das Repo, das man durch\n\n`gpg --keyserver keys.gnupg.net --recv A3C4F0F979CAA22CDBA8F512EE8CBC9E886DDD89`\n `gpg --export A3C4F0F979CAA22CDBA8F512EE8CBC9E886DDD89 | sudo apt-key add -`\n\ndem Schlüsselring “unterhilft”.\n\nDann\n\n`apt update`\n\nzum Aktualisieren der Repo- und Paket-Listen und schließlich mit\n\n`apt install tor`\n\nTor installieren. Beachte: Diese Schritte muss man “als root” durchführen!\n\nNun muss man die Konfiguration von Tor noch anpassen. Man editiert  die Datei /etc/tor/torrc und entfernt bei den auskommentierten Zeilen\n\n`ControlPort 9051`\n\nund\n\n`CookieAuthentication 1`\n\ndie “#” am Zeilenanfang.\n\nUm die entsprechenden Leserechte für die benötigten Verzeichnisse zu  erhalten, muss man seinen (Linux-) Benutzer noch der entsprechenden  Gruppe zuweisen.\n Die Gruppe (bei Debian ist das z. B. debian-tor) findet man mittels\n\n`ls -al /var/run/tor/control.authcookie`\n\nheraus. Die Zuweisung erfolgt dann durch\n\n`usermod -a -G <Benutzergruppe für Tor> [deinlinuxbenutzer]`\n\nDurch ein beherztes\n\n/`etc/init.d/tor restart`\n\noder (bei systemd)\n\n`systemctl restart tor`\n\nwird der Dienst gestartet.\n\nWer **Arch** (oder einen Ableger… für mein Manjaro musste ich es auch so machen) nutzt, muss ein wenig anders vorgehen:\n\n`usermod -a -G Tor [deinlinuxbenutzer]`\n\nDann in der Datei /etc/tor/torrc die “#” vor\n\n`ControlPort 9051`\n\nund\n\n`CookieAuthentication 1`\n\nentfernen\n\nund die Zeilen\n\n`DataDirectoryGroupReadable 1`\n`CookieAuthFileGroupReadable 1`\n`CookieAuthFile /var/lib/tor/control_auth_cookie`\n`DataDirectoryGroupReadable 1`\n`CacheDirectoryGroupReadable 1`\n\nanfügen.\n\nTor neu starten (s. o.) und nach einem Neustart sollte ZeroNet auch mit Tor laufen.\n\nWindows-Nutzer können sich das sparen, weil Tor durch das ZeroNet-Bundle beim ersten Start automatisch installiert wird.\n\nUm ZeroNet mit dem Tor-Browser zu nutzen, muss man dort in den Einstellungen für den Proxy\n\n`127.0.0.1`\n\nunter “Kein Proxy für” / “no proxy for” eintragen und den Browser anschließend neu starten.\n\nNun sollte ZeroNet mit offenem Port und (im Idealfall) mit Tor laufen…\n\n### Eine ID zulegen!\n\nAls nächsten Schritt sollte man sich eine ZeroID zulegen… das ist  quasi eine Benutzerkennzeichnung, die man für etliche Seiten benötigt.  Mit dieser ID kann man z. B. ZeroMail verwenden und sich auf vielen  Seiten “einloggen”, um z. B. zu Kommentieren, Postings abzusetzen etc.  Dies geschieht auf der Seite ZeroID. Der Prozess, um sich eine ID  anzulegen, ist sehr einfach.\n\nUnd nun kann man fröhlich stöbern. Welche Seiten für den Einstieg interessant sind, habe ich ja schon [HIER](https://pepecyb.hu/2018/03/05/zeit-fuer-alternativen/) erzählt.\n\n### Eigene Seite\n\nWen man nun Lust bekommen hat, eine eigene Seite anzubieten, kann man  ganz flott eine “leere” Seite anlegen, indem man auf der Seite ZeroHome  im Menü den Punkt “Create new, empty site” auswählt oder ZeroNet  beendet, in das Programmverzeichnis (Eingabeaufforderung / Terminal)  wechselt und dort\n\n`zeronet.py siteCreate`\n\neingibt.\n\nZeroNet teilt einem dann den öffentlichen (Site address… man kann  seine Seite bei ZeroNet dann mit http://127.0.0.1:43110/<Site  address> aufrufen) und auch den privaten Schlüssel mit und bestätigt  die Erzeugung der leeren Seite:\n\n`- Site private key: .................................`\n `- Site address: ..................................`\n\n`- Site created!`\n\nIm Datenverzeichnis von ZeroNet findet man nun ein Unterverzeichnis,  das den Namen der “Site address” trägt… dort hinein kann man nun seinen  Content schreiben, der nach Aufruf der Adresse gezeigt wird.\n\nDas Verzeichnis enthält zunächst die Dateien\n\n`content.json`\n\nund\n\n`index.html`\n\nsowie das Verzeichnis\n\n`js`\n\nIn der Datei content.json kann man einige Einstellungen vornehmen… z. B. den Seitennamen und einiges mehr.\n\nDie Datei ZeroFrame.js im Verzeichnis js sollte man nicht löschen.\n\n### Klonen\n\nEinfacher ist es, wenn man eine vorhandene Seite klont. Hat man eine  Seite gefunden, die man klonen möchte (geeignet für den Einstieg sind  die Beispielseiten ZeroBoard, ZeroBlog, ZeroTalk, ZeroMe… ), so findet  man sie bei ZeroHome ja auch in der linken Seitenleiste. Ein klick auf  das Menü der jeweiligen Seite, öffnet damit das Drop-Down-Menü, wo man  den Eintrag “Clone” findet und auswählt.\n\n![zn04-300x229.png](img/zn04-300x229.png)\n\nNun hat man eine eigene (man kann sie also selbst verändern) Kopie  der gewählten Seite. Jetzt muss man sie noch anpassen… z. B. beim Blog  das Logo ändern oder den Titel anpassen, unerwünschte Inhalte löschen  etc. Ein paar Beispiele zur Modifikation dieser Seiten folgen als neue  kurze Artikel hier.\n Am besten, man experimentiert ein wenig und schaut sich die im  jeweiligen Seiten-Verzeichnis vorhandenen Dateien einmal an. Hat man was  versaubeutelt, so löscht man einfach das Verzeichnis der eigenen Seite  und startet ZeroNet neu.\n\nJa… nun haben wir unser eigenes Angebot “erschaffen”… aber sehen kann das noch niemand.\n\n### Signieren und veröffentlichen\n\nMan muss die Zite zunächst noch signieren und veröffentlichen.\n\nVon der Befehlszeile aus macht man das mit den Befehlen\n\n`zeronet.py siteSign <Site address>`\n\nund\n\nder Eingabe des anschließend abgefragten privaten Schlüssels.\n\nEin\n\n`zeronet.py sitePublish <Site address>`\n\nveröffentlicht die Seite schließlich.\n\nVon ZeroHello aus geht das auch, indem man die “0” von rechts nach  links zieht und unten auf den Button “sign and publish” klickt.\n\nSie ist zwar jetzt verfügbar, aber es kennt noch niemand die Seitenadresse. Die muss man also noch publik machen.\n\nEin guter Schritt dazu ist es, die Seitenadresse (ggf. mit einer kurzen Beschreibung) auf der Seite 0list (<http://127.0.0.1:43110/0list.bit/>) zu posten. Sehr rasch wird die Seite dann von anderen Peers aufgerufen und verteilt sich damit im Netz.\n\nSo… das sollte für den Einstieg genügen… weiter ins Detail gehe ich in weiteren Artikeln zu ZeroNet…"
		},
		{
			"post_id": 18,
			"title": "Zeit für Alternativen",
			"date_published": 1520281885.461,
			"body": "![alternativen_title-300x150.jpg](img/alternativen_title-300x150.jpg)\n\n#Die Schlinge zieht sich immer weiter zu…\n\ndas [Netzdurchsetzungsgesetz](https://www.gesetze-im-internet.de/netzdg/BJNR335210017.html) (NetzDG) ist beschlossen, andere Länder denken darüber nach, ähnliche Regelungen zu treffen, die Betreiber der großen Netzwerke haben schon immer bestimmt, welche Inhalte bei ihnen zulässig sind… und setzen jetzt verstärkt auf „künstliche Dummheit“, um unerwünschte Inhalte automatisch auszufiltern… na und jetzt denken sie in der EU wirklich ernsthaft darüber nach, [dass Uploadfilter eingesetzt werden sollen](http://ec.europa.eu/newsroom/dae/document.cfm?doc_id=50118) (Kapitel 2 Nr. 18 “_Proaktive Maßnahmen_“)… zunächst „freiwillig“, letztlich aber dann auch verpflichtend.\n\nDabei geht es dann ja zunächst vorwiegend um „terroristische Inhalte“ (der „Schutz“ vor Terrorismus ist der Türöffner für jedes Gesetz, das die persönliche Freiheit massiv einschränken soll), aber auch um Aufstachelung zu Hass und Gewalt, Darstellungen des sexuellen Missbrauchs von Kindern („Kinderpornografie“ ist auch ein beliebter „Dietrich“, um Regelungen durchzusetzen, die der Bürger sonst nicht widerspruchslos hinnehmen würde), Produktfälschungen und Urheberrechtsverletzungen.\n\n---\n\nDas ist schon ein breites Spektrum, und wenn nun „künstliche Dummheit“ (nichts anderes sind ja Upload-Filter auch) ein so weites Feld beackern soll, wächst die Gefahr, dass auch harmlose Inhalte einfach geblockt werden, immens an. Halbwegs vernünftige Filter (die trotzdem noch viele legale Inhalte ebenfalls aussieben werden) können aber nur von den Big Playern im Anbietergeschäft realisiert werden. Trotzdem sollen auch die kleinen und mittleren Anbieter zum Einsatz von Filtern gezwungen werden. Das bedeutet für diese, dass sie sich entweder in Abhängigkeit von den „Großen“ begeben müssen und deren Technik nutzen, oder dass sie selbst etwas einsetzen, was dann womöglich noch unzulänglicher ist.\n\nDas NetzDG setzt solche Automatismen nicht voraus, was aber kein Stück besser ist. Hier werden die Inhalte zwar erst nachträglich ausgefiltert, aber es besteht – nach weit verbreiteter Meinung… und auch nach meiner Auffassung – die Gefahr des Overblockings, weil drakonische Strafen angedroht sind, wenn beanstandete Inhalte nicht ganz schnell getilgt werden. Hier wird von Laien (denn rechtswissenschaftlich sind es solche) erwartet, in kürzester Zeit eine rechtliche Bewertung von Inhalten vorzunehmen und zu reagieren. Da das kaum möglich ist, wird dann wohl eher schnell mal was gelöscht, was eigentlich völlig in Ordnung ist, bevor man sich in Gefahr begibt und der Konzern zu Strafen verdonnert wird.\n\nUnd es schadet ja auch nix, denn dem Nutzer ist eh keine wirkliche Möglichkeit gegeben, gegen eine unberechtigte Löschung vorzugehen. Gefickt eingeschädelt, das!\n\nDas (einstmals) freie Internet wird also immer weiter kaputt gemacht… und die Einschränkungen werden immer größer. Und es kann JEDEN treffen… die Wahrscheinlichkeit wird um so größer, je mehr automatisiert geblockt wird (womöglich durch „künstliche Dummheit“). Beispiele dafür findet man bald täglich irgendwo im Netz.\n\n##Was tun? Wir sind doch machtlos.\n\nNööö… im Gegentum… wir können wirklich etwas dagegen tun. Dafür müssen wir nicht einmal die „Komfortzone WEB X.0“ (fragt mich nicht, bei welchen „X“ wir inzwischen angekommen sein sollen) aufgeben… die können wir trotzdem weiter benutzen, sofern es da noch interessante Inhalte gibt. Aber zusätzlich wäre es dringend erforderlich eine neue Infrastruktur aufzusetzen, die gegen solche Überregulierungen, gegen Zensur und staatliche Repressionen immun ist.\n\nNicht falsch verstehen… WIRKLICH illegale Dinge sollten in einem Netzwerk genauso verfolgt und unterbunden werden, wie in der realen Welt. Aber der Kampf gegen solche Inhalte darf nicht dazu führen, dass wir unsere Freiheit völlig aufgeben.\n##Alternativen\n\nNa jedenfalls gibt es schon heute sehr gute Alternativen zum „herkömmlichen„ Internet: die [dezentralen Netzwerke](https://de.wikipedia.org/wiki/Dezentrales_Netzwerk) / [P2P](https://de.wikipedia.org/wiki/Peer-to-Peer) (=Peer-to-Peer)-Netzwerke. Bei diesen Systemen gibt es keine zentralen Server, auf die man seine Inhalte schaufelt und von wo sie dann von anderen abgerufen werden können… hier wird man selbst Teil des Netzwerkes, verbindet sich direkt mit etlichen anderen in diesem Netzwerk und hält seine Inhalte selbst bereit.\n\n##IPFS\n\nSehr bekannt und derzeit hoch gehandelt ist das [IPFS](https://ipfs.io/) (InterPlanetary File System), welches das Bitcoin Blockchain-Protokoll nutzt, um ein unabhängiges „Dateisystem“ bereitzustellen. Hier können Inhalte nahezu jeglicher Art anderen zur Verfügung gestellt werden… also auch Webseiten. Jeder hat die Möglichkeit, solche Inhalte abzurufen und jeder kann sie auch lokal speichern und damit auch wieder für andere Nutzer zur Verfügung stellen. Dass das IPFS derzeit mehr in den Fokus der Öffentlichkeit gerückt ist, liegt nicht zuletzt daran, dass es mit [Steemit](https://steemit.com/) für den Aufbau einer sozialen Netzwerksstruktur genutzt wird, mit der man nebenbei theoretisch (und praktisch) sogar Geld verdienen kann. Auf Steemit setzt auch die wirklich gut nutzbare YouTube-Alternative [DTube](https://d.tube/) auf.\n\n![IPFS-300x234.png](img/IPFS-300x234.png)\n\nKlar habe ich IPFS ausprobiert… und ab und an läuft es bei mir auch (allerdings – das muss ich zugeben – nur, wenn ich es konkret einsetzen muss)… aber für mich hat es zu viele konkrete Nachteile. Es verbraucht wirklich ordentlich Netzbandbreite und auch die Systemlast ist zeitweise so groß, dass der PC nahezu unbenutzbar wird. Leider kann man die Nutzung der Bandbreite und der Systemressourcen nicht konfigurieren… ich hoffe aber, dass ein solcher Mechanismus in (hoffentlich naher) Zukunft implementiert wird. Zur täglichen Nutzung ist es aus diesen Gründen für mich aber nicht geeignet.\n\n##I2P\n\nEin weiteres, schon länger existierendes Netzwerk ist [I2P](http://www.zeronet.io) (Invisible Internet Project), das zusätzlich zur verteilten Infrastruktur auch noch anonymisiert und pseudonymisiert. Es ist also, was das anbelangt, eher mit dem TOR-Netzwerk zu vergleichen. Die Daten werden verschlüsselt und anonymisiert übertragen.\n\n![I2P-300x234.png](img/I2P-300x234.png)\n\nIm Vergleich zu IPFS ist die Nutzung aber eher träge. Selbst wenn man eine ganze Weile mit dem Netzwerk und damit mehr Peers verbunden ist, ist die Geschwindigkeit recht eingeschränkt und es ist sehr (sehr!) oft der Fall, dass bestimmte Ressourcen trotzdem nicht erreichbar sind. Dafür ist die Systemlast deutlich geringen und auch die Bandbreitennutzung, die sich auch komfortabel einstellen lässt. Obwohl es das Netzwerk schon recht lange gibt, findet man nur schwer Inhalte, die einen interessieren… und oft sind diese dann nicht einmal erreichbar, selbst wenn das Programm schon seit Tagen läuft. Auch I2P habe ich ausprobiert (und nutze es… allerdings wirklich sehr selten)… doch auch das halte ich nicht für wirklich praxistauglich… das „klassische Internet“ kann es nicht ersetzen, obwohl es viele vergleichbare Protokolle unterstützt.\n\n##Freenet\n\n[Freenet](https://freenetproject.org/) habe ich auch einmal ausprobiert. Auch das funktioniert auf ähnliche Weise. Allerdings kann würde ich es nicht als Alternative zum „klassischen Internet“ ansehen, weil es nicht wirklich leicht einzurichten und zu nutzen ist. Außerdem ist man bei diesem System darauf angewiesen, sich konkret mit anderen Nutzern (Peers) zu verbinden… die muss man erstmal finden oder dazu überreden, das System zu installieren. Ob Freenet inzwischen sinnvoll nutzbar ist, kann ich nicht beurteilen, da meine Versuche schon einige Jahre zurückliegen.\n\n##DAT / Beaker-Browser\n\nEin weiteres verteiltes P2P-System ist das [DAT](https://datproject.org/) Projekt. Dieses System ist am ehesten mit dem IPFS zu vergleichen. Auch mit DAT kann man Dateien und Verzeichnisse mit anderen teilen… also auch Webseiten. Hier erfolgt die Übertragung ebenfalls verschlüsselt.\n\n![DAT-300x236.png](img/DAT-300x236.png)\n\nIm Vergleich zu IPFS geht DAT aber deutlich ressourcenschonender mit dem eigenen Computer um. Dafür ist die Nutzung aber auch nicht so komfortabel… es sei denn, man greift auf das Beaker-Browser-Projekt zurück. Beaker-Browser ist ein Webbrowser (mit ihm kann man auch im „normalen Internet“ surfen), der auf das DAT Projekt zurückgreift. Mit dem Browser ist man in der Lage, Content, der auf dem eigenen Rechner liegt, mit anderen zu teilen… diesen also anzubieten. Man kann klassische Webseiten anbieten, Beaker kommt aber auch mit Webseiten zurecht, die mit Markdown gestaltet sind. Die Adressen sind allerdings auch wieder recht kryptisch (lange Hashes) und zentrale Verzeichnisse findet man nicht (vielleicht gibt es sie… ich habe sie noch nicht gefunden). DAT / Beaker ist also durchaus praxistauglich, jedoch ist die Nutzung wohl eher dazu gedacht, Daten sicher auszutauschen… für ein „alternatives Internet“ taugt es in meinen Augen derzeit noch nicht. Die eigenen Inhalte stehen auch nur dann zur Verfügung, solange man online ist oder, wenn ein anderer Nutzer sie lokal gespeichert hat und ebenfalls anbietet.\n\n![Beaker-300x234.png](img/Beaker-300x234.png)\n\n##Mein Favorit: ZeroNet (0Net)\n\nEs gibt noch einige andere Netzwerke und Projekte, ich komme aber jetzt zu meinem persönlichen Favoriten: ZeroNet.\n\nIm Vergleich zu z.B. Freenet oder I2P ist ZeroNet (auch 0Net) ein noch recht „junges“ Projekt, aber hier findet man schon jetzt eine Struktur, die gut aufgestellt ist.\nWie bei anderen dezentralen Netzwerken werden bei 0Net Webseiten (Zites genannt) nicht durch eine IP identifiziert, sondern durch einen öffentlichen Schlüssel (genauer einer Bitcoin-Adresse). Der ebenfalls vorhandene private Schlüssel ermöglicht es dem Eigentümer einer Website, Änderungen zu signieren und zu veröffentlichen, die sich über das Netzwerk verbreiten. Der Zugriff auf die Websites erfolgt über einen gewöhnlichen Webbrowser, wenn die ZeroNet-Anwendung, die als lokaler Webhost für solche Seiten fungiert, läuft. Zusätzlich zur Bitcoin-Verschlüsselung verwendet ZeroNet Tracker aus dem BitTorrent-Netzwerk, um Verbindungen zwischen Peers auszuhandeln. ZeroNet ist zunächst nicht anonym, jedoch können Benutzer ihre IP-Adresse mit Hilfe der eingebauten TOR-Funktionalität verstecken. Wird eine Zite durch einen anderen Nutzer aufgerufen, so wird dieser Besucher ebenfalls zum Anbieter der Inhalte (Seeder). Solange es auch nur einen einzigen Seeder gibt, kann eine Zite nicht gelöscht werden, was auch Dritten die Möglichkeit nimmt, die Seite zu unterdrücken oder Zensur zu üben.\n\n###Einfache Installation\n\nEin wesentlicher Vorteil von ZeroNet ist die wirklich einfache Installation (für Linux, Windows, OS-X, FreeBSD). Selbst die Nutzung von TOR zur Anonymisierung ist sehr einfach. Für Windows-Nutzer ist dies bereits im Bundle enthalten, Nutzer anderer Betriebssysteme müssen TOR zusätzlich installieren und einmal konfigurieren (sehr gut beschrieben)… dann fluppt 0Net prima über das TOR-Netzwerk.\n\n###Startseite: ZeroHello\n\nHat man 0Net gestartet und ruft man im Webbrowser http://127.0.0.1:43110 auf, so landet man auf der Seite ZeroHello. Von dieser Seite aus kann man einige Einstellungen vornehmen… und sofort die ersten Zites erreichen. In der linken Seitenleiste der Seite findet man etliche Links zu wichtige Zites… darunter auch die Beispiel-Zites (ZeroBoard… ein Message-Board, ZeroBlog… ein Beispiel-Blog, ZeroTalk… ein Forum, ZeroMail… ein ZeroNet-Mailprogramm zum Versenden von verschlüsselten P2P-Mails, ZeroChat… ein Chatprogramm, ZeroMe… ein dezentrales soziales Netzwerk – vergleichbar mit Twitter, ReactionGIFs… eine Plattform für Bilder und Videos).\n\n![ZeroHello-300x234.png](img/ZeroHello-300x234.png)\n\n###Erste Orientierung\n\nEin sehr guter Einstieg ist ZeroSites (http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/)… hierbei handelt es sich um ein Verzeichnis sehr vieler Zites. Und hier findet man dann auch noch interessante andere Seiten, wie z. B. ZeroVote (http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/), das so funktioniert, wie Reddit, das Git Center (http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/), mit dem ein dezentrales Git-Hosting möglich wird, das ZeroWiki (http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/)\n\n###Suchmaschinen\n\nFür die Suche bemüht man am besten Zirch Automated Search (http://127.0.0.1:43110/1SearchPd3khzLtsxTxKYhYUohk7c1QYd/), Zoogle Zearch (http://127.0.0.1:43110/13EYKqmPpwzBU4iaQq9Y4vfVMgj8dHeLkc/) oder Kaffiene Search (http://127.0.0.1:43110/kaffiene.bit/). Damit findet man schon allerhand interessante Seiten.\n\nZeroUp (http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/) ist eine Filesharing-Plattform… auch nicht übel.\n\nWenn man eigene Seiten anbietet und man die – wie bei vielen anderen Systemen ebenfalls – kryptische URL sinnvoll kürzen mag, kann man sich eine Kurz-URL bei ZeroShortener (http://127.0.0.1:43110/0sh.bit/) erzeugen lassen.\nEingene Seiten anbieten\n\nEigene Seiten? Ja genau… eigene Seiten! Und das „für umme“, denn seine eigenen Zites hostet man selbst (und jeder weitere Seeder, der die Seite aufgerufen hat).\n\nEine eigene Zite zu erstellen ist sehr einfach. Man kann einfach eine leere Zite erzeugen, die man dann mit einer selbst erstellten „klassischen“ Webseite „befüllt“ oder man klont eine beliebige andere Zite und verändert die Inhalte (und, wenn man kann und will auch die Funktionalität). So kann man seine eigene ZeroME-SN-Seite mit wenigen Klicks erstellen… ein Blog ist schnell geklont und mit eigenen Inhalten versehen… es ist nahezu alles möglich.\n\nWie das alles funktioniert, werde ich hier in einem eigenen Artikel als „Tutorial“ beschreiben… es sollte eigentlich jeder damit klarkommen. Man kann ganz einfach als passiver Nutzer agieren oder man bietet selbst Inhalte an… und kein Upload-Filter blockiert einem die eigenen Beiträge.\n\n**Ich kann es WIRKLICH empfehlen, ZeroNet auszuprobieren. Die Installation ist kinderleicht und man findet sich sehr schnell zurecht. Die Zites an sich sind gut nutzbar und es gibt schon sehr viel zu sehen und vieles, wo man mitmachen kann.**\n\nZeroNet geht außerdem auch sehr schonend mit den Ressourcen um… bei mir läuft es bei jedem Rechnerstart automatisch mit… und ich merke das überhaupt nicht."
		},
		{
			"post_id": 17,
			"title": "Das ist kein Nachrichtenportal…",
			"date_published": 1518883384.288,
			"body": "##…das ist ein öffentliches Scheißhaus!\n\n![scheisshaus](img/scheisshaus-218x300.jpg)\n\nDen Begriff Fake-“News” fand ich schon vermessen, wenn es darum ging, dass Facebook solche verbreiten würde… und nun spulen sich auch noch die ganzen Main- oder Neben-Stream-Medien und “Journalisten” darüber auf, dass Facebook ihre Seiten und Posts nicht mehr bevorzugt behandelt, sondern gleichwertig mit Katzenbildchen.\n\nMeine Güte… Facebook IST KEIN NEWS-PORTAL! Facebook ist viel näher dran an einem öffentlichen Scheißhaus. Da wird auch belangloser Mist an die Wände geschmiert. Und nur weil jemand nach dem Geschäft die Bildzeitung oder den Focus hat liegen lassen, ist das noch lange kein Presseclub, sondern immernoch ein öffentliches Scheißhaus.\n\n---\n\nWer sich über die Geschehnisse in der Welt informieren will, der surft richtige Nachrichtenportale an, Webpräsenzen von Medien (und lässt dabei die in der öffentlichen Meinung geschmähten nicht aus) und bildet sich eine eigene Meinung. Zu glauben, Facebook (oder Twitter, was eher bekritzelten Laternenpfählen entspricht) wäre eine Nachrichtenquelle ist vollkommener Schwachsinn. Wie blöd muss man sein, das zu glauben? Das ist und war ja auch nie Sinn und Zweck von FB und nun sollen die Uhren wieder zurückgedreht werden.\n\nDeshalb gibt es auch keine Fake-“News” bei FB… das sind Gerüchte… das ist Flurfunk… Hintergrundrauschen. Fake-News findet man bei den Medien… aber gegen diese “Nachrichten” wird nicht vorgegangen. Und weil die Medien ihre Produkte im Scheißhaus platzieren, wird aus dem Scheißhaus auch kein News-Portal. Der Kram liegt halt da rum, wo es stinkt!\n\nUnd bei Facebook gibt es auch keine “Zensur”! Wer sich da registriert, der geht einen Vertrag mit einem gewinnorientierten Privatunternehmen ein und unterwirft sich damit den Richtlinien, die dieses Unternehmen festgeschrieben hat. Niemand hat Anspruch darauf, dass seine Inhalte auch wirklich veröffentlicht werden oder bleiben. Und wenn bislang ohnehin schon Inhalte durch undurchschaubare Richtlinien und intransparente Überprüfungen ausradiert wurden oder auch mal Zugänge gesperrt wurden, so wird das jetzt durch das NetzDG noch verschärft, weil die Betreiber der großen Sozialen Netzwerke (SN) vom Gesetzgeber unter Druck gesetzt werden und rechtliche Würdigungen in kürzester Zeit durchführen sollen, für die Horden studierter Juristen teilweise Jahre brauchen.\n\nWer an einem SN teilnehmen möchte und nicht “zensiert” werden will, der wählt eines der ja nun schon länger bekannten freien, verteilten oder föderierten Netzwerke, wie [Diaspora*](https://diasporafoundation.org/), [Hubzilla](https://project.hubzilla.org/page/hubzilla/hubzilla-project), [GNUsocial](https://gnusocial.de/) oder [Mastodon](https://joinmastodon.org/). Die haben auch den großen Vorteil, dass sie allein schon durch das Fehlen der Gewinnorientierung aus dem NetzDG herausfallen… und im Gegensatz zu FB und Co. sind sie auch noch kostenlos! Ja, denn im Scheißhaus, bei den Laternenpfählen oder den (beschmierten) Telefonkästen (Instagram) und ähnlichen Plattformen zahlt man sehr wohl… und zwar mit seinen Daten… sehr vielen Daten… sehr persönlichen Daten. Das fällt bei den freien Netzwerken weg.\n\nUnd an die Mainstream- und Nebenstream-Medien kann ich nur die Empfehlung richten: Nutzt auch Ihr die freien, verteilten oder föderierten Sozialen Netzwerke und ermutigt Eure Leser, Euch dort zu folgen… das ist für Euch kostengünstiger und Maaß kann Euch DA auch nicht in den Schritt greifen.\n\nUnd nochmal an alle, die es nicht verstanden haben: Die Kritzeleien an den Toilettenwänden sind KEINE NEWS! </rant>"
		},
		{
			"post_id": 16,
			"title": "Teuflisches Javascript?",
			"date_published": 1518882815.971,
			"body": "![Title JS EVIL](img/jsevil-300x267.png)\n\nImmer öfter wird Kritik an Webseiten geäußert, die Javascript (JS) einsetzen. Einerseits, weil das immer ein Sicherheitsrisiko darstellen kann(!), andererseits, weil es auch tatsächlich Webseiten gibt, die man tatsächlich nur nutzen kann, wenn Javascript im Browser zugelassen ist.\n\nIch sehe das, obwohl ich selbst bei Javascript auch zurückhaltend bin, trotzdem differenziert. Viele Funktionalitäten einer Webseite (die heute nun wirklich kein einfaches Textdokument – Gopher ist ja leider gestorben – oder ein Textdokument mit Bildern sind) werden mittels JS realisiert. Das sind oft Funktionen, welche die Benutzung des Webauftritts komfortabler in der Benutzung machen, sinnvolle Möglichkeiten bereitstellen und auch für eine modernere Optik sorgen.\n\nGrundsätzlich spricht also nichts dagegen, wenn eine Webseite bestimmte Dinge mittels JS realisiert… es sollte nur nicht dazu führen, dass die Seite unbenutzbar wird oder die Informationen ohne aktiviertes JS nicht zur Verfügung gestellt werden. Und man sollte auch mit JS sparsam umgehen und bemüht sein (sofern möglich) externe JS-Quellen (also Bibliotheken auf anderen Servern) zu vermeiden.\n\n---\n\nAls Nutzer empfehle ich, Javascript nur DANN zuzulassen, wenn es unbedingt erforderlich ist und man den Quellen vertrauen kann. Gerade wo die Prozessor-Lücke Spectre durch die Medien galoppiert, sollte man mit JS vorsichtig sein, denn mit JS ist ein “Angriffsszenario” unter Ausnutzung dieser Schwachstelle durchaus denkbar. Aber auch schon vor Bekanntwerden dieser Lücke war es empfehlenswert, nicht jeder Webseite einfach das Herumwüten mit JS zu gestatten. Das kürzlich erst in den Medien – leider nur am Rande – erwähnte Session Replay (SR) ist eine “Spionage-Methode”, die ebenfalls auf JS-Einbindung basiert und deshalb auch durch eine unbedarfte Zulassung von JS greifen kann. Wer sich dafür interessiert, was SR alles so macht, sollte sich das “heute nur kurze” Video bei SemperVideo dazu anschauen: [Achtung Aufnahme: Session Replay](https://hooktube.com/watch?v=UvbqV0Y9sno)\n\nUnd wer nun meint, er sei davon sicher nicht betroffen, der kann gerne mal einen Blick in die [Liste der 10.000 beliebtesten Seiten](https://webtransparency.cs.princeton.edu/no_boundaries/session_replay_sites.html), die SR einsetzen, anschauen… da ist so einiges dabei, was vermutlich bei vielen zum Standard-Surf-Repertoire gehört.\n\nEin Adblocker ist das Mindeste, was man einsetzen sollte… nicht (nur) deshalb, weil Werbeeinblendungen häufig wirklich nerven können, sondern weil auch viele Angriffe durch Schadsoftware erfolgen, die man sich durch Werbung in den Browser schaufelt.\n\nEs ist also ausgesprochen sinnvoll – in meinen Augen absolut notwendig – JS nur dann zuzulassen, wenn die Quelle ok ist und JS notwendig ist (erscheint). Häufig wird dafür NoScript empfohlen, was grundsätzlich auch nicht verkehrt ist. Ich halte jedoch die Alternative [uMatrix](https://github.com/gorhill/uMatrix/) für wesentlich besser. uMatrix wird nachgesagt (und der Programmautor sagt das ebenfalls), dass es nur für “fortgeschrittene” Nutzer sei. Ich muss allerdings sagen, dass das schlimmer klingt, als es tatsächlich ist. Man muss sich mit der Funktionsweise vertraut machen und sich daran gewöhnen, bei Seiten, die man erstmals ansurft und die sich dann nicht so verhalten, wie man es erwartet, die entsprechenden Einstellungen vorzunehmen. Das muss man aber nur ein Mal machen und kann die Einstellungen speichern. Anschließend bemerkt man nicht, dass uMatrix im Hintergrund werkelt. Mit uMatrix hat man deutlich mehr in der Hand, als mit NoScript. Schon in der Grundeinstellung arbeitet uMatrix sehr zuverlässig und macht z. B. auch einen anderen Adblocker nahezu überflüssig. Allerdings ist in der Grundeinstellung die Ausführung von JS zumindest von der Originalseite nicht blockiert. Das ist aber nicht sinnvoll, wenn man sich die möglichen “Bedrohungslagen” durch ausführbare Skripte anschaut. Deshalb sollte man, wenn man wirklich auf Nummer Sicher gehen will, Skripte in der Grundeinstellung generell blocken. Dazu ruft man die Optionsseite von uMatrix auf und wählt den Reiter “Meine Regeln”.\n\nDort klickt man im rechten Bereich (“Temporäre Regeln”) auf “Bearbeiten und fügt die Zeile\n\n`* * script block`\n\nein.\n\nUm diese Option dauerhaft zu speichern, klickt man anschließend noch auf “← Dauerhaft speichern”.\n\n![um_01](img/um_01.png)\n\n![um_02](img/um_02.png)\n\n![um_03](img/um_03.png)\n\nNun werden diverse Webseiten nicht auf Anhieb funktionieren. Dann klickt man beim Browsen auf das uMatrix-Symbol und gibt das frei, was zur Funktionalität erforderlich und vertrauenswürdig (aus vertrauenswürdigen Quellen stammt) ist. Wenn man will, kann man dann durch einen Klick auf das Schloss-Symbol diese Auswahl für die jeweilige Seite auch dauerhaft speichern.\n\nDas macht zunächst ein wenig Arbeit (für die Seiten, die man ständig ansurft), aber man gewöhnt sich das sehr schnell an und es geht in Fleisch und Blut über… und man muss es im Regelfall ohnehin nur ein Mal machen, wenn man die Auswahl speichert.\n\nEine Videoanleitung zu uMatrix (bezieht sich da auf Chrome, uMatrix gibt es aber für sehr viele andere Browser und das Prinzip ist identisch) findet man auch wieder bei SemperVideo: [Chrome: uMatrix – Das wichtigste Addon](https://hooktube.com/watch?v=af0tUR0GZUI)\n\nDas ist das (von vielen weiteren Dingen), die man beim Surfen tun kann, um halbwegs sicher zu sein… nun aber nochmal zurück zu JS auf Webseiten. Trotz dieser Szenarien (die man recht gut abwehren kann) bietet JS auch so einiges, weshalb es Blödsinn ist, es zu verteufeln. So gibt es inzwischen viele Seiten, die z. B. das Bootstrap-Framework einsetzen (ein Open-Source-Framework) und damit funktionale und responsive Seiten zur Verfügung stellen. Dann sind häufig auch JS-Funktionen eingebunden. Das lässt sich recht einfach bei uMatrix erkennen und es spricht nichts dagegen, die entsprechenden Quellen freizuschalten. Klar kann man auch auf dem Standpunkt stehen, grundsätzlich solche Routinen nicht zuzulassen. Solange die Seite benutzbar bleibt, bringt das auch keine Nachteile.\n\nBei Webseiten, die aber ohne JS einfach nicht laufen wollen, muss man halt abwägen, ob man darauf verzichten möchte, oder nicht. Sofern nicht zu erwarten ist (uMatrix zeigt einem ja, was da eingebunden wird), dass einem Schlimmes untergeschoben wird, halte ich es für übertrieben, solche Seiten (wegen JS) zu verteufeln. Wer “amish” surfen will, der soll das tun… das muss jeder für sich selbst entscheiden. JS grundsätzlich zu verteufeln ist aber nach meiner Auffassung extrem… und alles Extreme hat auch so seine Nachteile…\n;)"
		},
		{
			"post_id": 15,
			"title": "﻿Ich versuch‘s nochmal – Verschlüsselung",
			"date_published": 1518881308.076,
			"body": "![GPG Title](img/gpg_title.jpg)\nVor etwas über zwei Jahren habe ich für eMail-Verschlüsselung geworben (Immer diese Postkarten…)… und hatte gehofft, dass ich irgendwann einmal an mehr Adressaten verschlüsselte Mails versenden kann und auch verschlüsselte Mails bekomme… oder zumindest signierte.\n\nFazit?\n\n**Sechs!**\n\nIn meinem Adressbuch befinden sich SECHS Mail-Adressen, zu denen es einen GPG-Schlüssel gibt. Davon sind DREI Kontakte, mit denen ich regelmäßiger Mails austausche, von denen wiederum ein Kontakt GPG nicht mehr verwendet (weil da irgendwas schief gelaufen ist… Passphrase vergessen… oder so).\n\nWas eine miese Quote!\n\nDas Problem ist ja für mich vor allem, dass ICH keine verschlüsselten Mails versenden kann, wenn der Partner nicht mitspielt (und einen Schlüssel zur Verfügung stellt)… und damit werde ich gezwungen, sämtliche Korrespondenz auf die sprichwörtliche „Postkarte“ zu schreiben.\n\n---\n\nKlar… ein großer Teil der eMails, die man (also auch ich) schreibt, sind inhaltlich eher belanglos oder nicht besonders schützenswert. Also wozu verschlüsseln? Nun, einfach DESHALB verschlüsseln, weil ich es MIR vorbehalten will, WER denn den Inhalt meiner Nachricht lesen können soll. Es geht mir also nicht darum, die Inhalte zu verbergen, sondern darum, dass ich bestimmen möchte, wer in meine Mails reinschaut. Das ist eine Frage der Privatsphäre. Schicke ich eine Mail, dann ist sie (in der Regel) für eine bestimmte Person bestimmt. Diese Person soll lesen können, was ich geschrieben habe… ich will aber nicht, dass noch irgendwer sonst mitlesen kann – egal, wie belanglos der Inhalt sein mag.\n\nBeispiel: In meiner Schublade mit meinen Schlüppern gibt es nichts kompromittierendes… die sind ganz normale Durchschnitts-Schlüpper, wenn sie da drin sind auch immer gewaschen und nicht kaputt… wenn also jemand FREMDES (darum geht es ja bei den Mails auch) da reinschauen würde, wäre es völlig unschädlich. Trotzdem stelle ich die Kommode mit meiner Schlüpper-Schublade nicht vor das Haus auf die Straße und gebe damit jedem die Möglichkeit, darin rumzuwühlen (und vielleicht sogar Schlüpper mitgehen zu lassen oder anderen Mist in die Schublade zu packen… ich will auch nicht dass jemand am Inhalt meiner eMail manipuliert). Meine Schlüpperschublade ist einer meiner PERSÖNLICHKEITSBEREICHE. Und ICH bestimme, wer die aufmachen darf.\n\nSo sehe ich das auch mit den eMails. Selbst wenn da nix „kompromittierendes“ drinsteht… eine von mir verfasste Mail ist auch mein PERSÖNLICHKEITSBEREICH.\n\nNa… nun versuche ich nochmal, vielleicht ein paar Leute zu erreichen und zur Mitfahrt im [GPG-Zug](https://gnupg.org/) zu überreden.\n\nDie Nutzung ist doch wirklich nicht mehr kompliziert. Etliches ist sogar noch einfacher geworden.\n\nAls Linux-Nutzer ist bei den meisten Distributionen GPG schon installiert. Wer nun z. B. Thunderbird als Mail-Client verwendet, der installiert sich einfach [Enigmail](https://www.enigmail.net/index.php/en/) als [Addon](https://addons.mozilla.org/de/thunderbird/addon/enigmail/?src=search). Damit lässt sich im Handumdrehen ein Schlüssel erzeugen und mit einem Klick auch auf einen Schlüsselserver hochladen. Damit ist schon fast alles erledigt. Die Voreinstellungen erlauben es, eigene Mails verschlüsselt zu senden und empfangene verschlüsselte Mails ganz einfach lesen zu können.\n\nWer mit Windows unterwegs ist (und womöglich Outlook nutzt), der installiert sich [GPG4Win](https://www.gpg4win.de/). Da ist ein Plugin für Outlook schon drin (wenn auch unter Windows Thunderbird zu Einsatz kommt, ist Enigmail angesagt… zusätzlich). Auch GPG4Win ist inzwischen ganz leicht zu verwenden. Die [Dokumentation](https://files.gpg4win.org/doc/gpg4win-compendium-de.pdf) ist prima und hilft wirklich prima beim Start.\n\nUnd Apple-Nutzer nutzen die [GPG Suite](https://gpgtools.org/) in der aktuellen Version. Die ist vergleichbar leicht zu verwenden und es gibt da ein wirklich leicht nachzuvollziehendes [Tutorial](https://gpgtools.tenderapp.com/kb/how-to/first-steps-where-do-i-start-where-do-i-begin-setup-gpgtools-create-a-new-key-your-first-encrypted-mail).\n\nSoll mir keiner erzählen, das wäre alles zu kompliziert. Ist es wirklich nicht. Und es lohnt sich! Ab dem Zeitpunkt der Installation und Inbetriebnahme (klingt wichtiger und komplizierter, als es ist) steht der verschlüsselten (oder zumindest signierten – was vor unautorisierten Manipulationen der Mail warnt) eMail nix mehr im Weg.\n\nNun bin ich gespannt, ob es vielleicht doch mehr als nur sechs Kontakte werden, mit denen ich verschlüsselt kommunizieren kann… und ob in Zukunft vielleicht doch die eine oder andere verschlüsselte Mail mehr an mich einfliegt."
		},
		{
			"post_id": 14,
			"title": "﻿Schade drum, aber mit mir nicht, Firefox!",
			"date_published": 1508006319.257,
			"body": "![foxfinger](img/foxfinger.jpg)\n\nNun bin ich vor ein paar Wochen „Fremdgehen“ endlich wieder zum Firefox zurückgekehrt (wenn ich es mir recht überlege, bin ich erst „untreu“ geworden, als ich erstmals gelesen hatte, dass cliqz als Testpilot-Projekt an den Start gehen soll und es evtl. dann „fest“ in den Fuchs eingebaut werden soll) und nun **DAS!**\n\nDa soll also (zunächst) einem Prozent der Nutzer das [cliqz-Addon](https://pepecyb.lima-city.de/k7m0) untergejubelt und bei der Gelegenheit auch gleich aktiviert werden. Gut, für mich wäre das eigentlich unproblematisch, denn wenn ich das weiß kann ich es ja auch sofort wieder wegputzen.\nAber es gibt sehr viele Nutzer, die das entweder nicht wissen, die Problematik des Addons und der Technologie nicht kennen und/oder es gar nicht merken, dass man es ihnen untergeschoben hat. Und auch sehr viele Nutzer haben keine Böcke, erst groß am Browser rumzuschrauben, bevor sie lossurfen.\n\n---\n\nGerade diejenigen, die es gar nicht wirklich merken (vielleicht wundern sie sich nur, wie sich das Suchfeld bzw. das URL-Eingabefeld plötzlich verhält und werden es für ein neues Such-Feature halten) werden hier, ohne explizit darauf aufmerksam gemacht zu werden, zu „Versuchskaninchen“. Denn genau DAS ist ja Sinn und Zweck der Aktion. Es sollen Daten gesammelt werden, um cliqz vielleicht noch besser an die Surfgewohnheiten anzupassen… und nebenbei fallen auch Daten für den Index und die Werbemaschinerie an.\n\nWas ich besonders widerlich finde, ist das Vorgehen der Browser-Macher. Sie hätten ja das Addon durchaus gleich „mitliefern“ und es per opt-in zur Aktivierung anbieten können, wobei sich mir auch nicht erschließt, weshalb nun ausgerechnet dieses umstrittene Addon denn zum „Lieferumfang“ gehören sollte. Wäre es der „Burner“, dann müsste man es nicht im FF „verstecken“, dann würden es diejenigen, die es unbedingt wollen und toll finden, selbst nachinstallieren. Mitliefern und opt-out ist jedenfalls nicht akzeptabel!\n\nNeee… aber im Gegentum… das Dingen wird mit laufendem Motor mitgeschickt.\n\nDass dieses Addon „umstritten“ ist, ist auch nicht verwunderlich. Mag ja sein, dass der Datenschutz bei dem Burda-Wurmfortsatz tatsächlich ganz besonders groß geschrieben wird und dass die übertragenen Daten tatsächlich spätestens auf deren Server anonymisiert werden. Sie schreiben immer, man könne ja den Quelltext einsehen und erkennen, das da nix böses passiert… ok… im Prinzip richtig… aber was ich nicht sehen kann, ist was mit den Daten von mir dann **TATSÄCHLICH** passiert, wenn sie erst einmal auf deren Server liegen… dass da alles strikt anonymisiert wird muss ich ihnen schon glauben… und von Glauben halte ich nicht viel. Nicht ohne Grund bin ich aus der Kirche ausgetreten, weil ich nix von „Glauben“ halte und manch „Glauben“ schon viel Leid über die Menschheit gebracht hat. Und ihr TÜV-Siegel können sie sich gerne dorthin stecken, wo die Sonne nie hinscheint. Wenn ich mein Auto zum TÜV bringe, bekomme ich eine Plakette… und wenn ich dann zu Hause einen Tuning-Chip reinkloppe, dann weiß das keiner, die Plakette prangt aber trotzdem auf dem Nummernschild.\n\nUnd nun mal zum Nutzen…\n\nDie wollen also einen Suchindex aufbauen… der soll uns „unabhängig“ vom Gockel machen… also müsste er schon besser sein. Hmmm… das sind mächtig große Fußstapfen! Nun haben sie vielleicht ihren Wunderzaubersuchindex… und dann wollen sie mir bei der Suche genau DAS präsentieren, wonach ich wirklich suche. Wenn sie aber gar nicht wissen, wonach ich bisher gesucht habe, dann können sie mir doch nichts anbieten, was mir speziell weiter hilft. Sollte es also stimmen, dass meine Suchmuster, meine Verhaltensdaten (und andere Daten) nicht rückverfolgbar sind, dann wird mir da ein Ergebnis präsentiert, das irgendwo ein Cocktail aus den gesammelten Daten vieler unterschiedlicher Menschen ist. DAS trifft dann aber nicht unbedingt meinen „Geschmack“. Überdies wird durch diese Einschränkung (zugeschnittene Trefferlisten SIND IMMER eine Einschränkung) auch wieder eine Filterblase geschaffen… auch wenn sie größer ist. Und diese Filterblase liegt dann auch noch in den Händen von Burda… na herzlichen Dank!\n\nIch suche schon seit langem mit einer lokalen searX-Instanz und anderen Metasuchmaschinen. Mag sein, dass die mir dann nicht meine Wünsche von den Augen ablesen… aber ich bin durchaus in der Lage, mir aus den Trefferlisten das zu ziehen, was ich suche. Es heißt ja auch **SUCH-Maschine**… wüsste die Maschine, was ich wirklich suche, müsste sie eher **FINDE-Maschine** heißen… heißt sie aber nicht… also ist sie auch keine Maschine die das FINDET, was ich suche, sondern eine Maschine, die mich selbst bei der SUCHE unterstützt. Mein Resthirn reicht aus, dann aus der Sammlung selbst das herauszuSUCHEN, was ich finden wollte. Danke… ich kann auch noch alleine gehen und brauche auch kein autonomes Fahrzeug!\n\nDie Krönung ist aber, dass dieses Addon auch noch ein ganz besonderes Gimmick enthält… Man will mir nämlich irgendwann „Produktempfehlungen“… ja auf mich zugeschnittene Werbung präsentieren… ganz nach meinen vermeintlichen Vorlieben.\nAuch das natürlich unter strengster Wahrung des Datenschutzes. Wie sie das machen wollen (nennt sich MyOffrz) haben sie auch erläutert:\n\n\n\n>Die komplette Überprüfung, inwieweit die Bedingungen zum Ausspielen eines Angebots erfüllt sind, erfolgt ebenfalls ausschließlich lokal auf dem Rechner.\n\n>Sämtliche Angebote werden vorab an alle verfügbaren Browser und -Erweiterungen geschickt, wo sie zunächst nur im Hintergrund auf Abruf warten. Erst wenn das Verhalten des Nutzers den zuvor definierten Auslöseregeln mit weiteren Bedingungen entspricht, wird das jeweilige Angebot aktiv und im passenden Moment im Browser angezeigt. Ein Auslöser kann beispielsweise die Eingabe einer Suchanfrage sein oder der Besuch einer bestimmten Webseite. Auf diese Weise stellt MyOffrz sicher, dass der Nutzer nur Angebote zu sehen bekommt, die ihn wirklich interessieren und ihm einen echten Mehrwert bieten. Und das alles, ohne seine Privatsphäre zu gefährden.\n\n> [Quelle: cliqz/MyOffrz](https://pepecyb.lima-city.de/0Lnk)\n\nKlingt ja erstmal „harmlos“… aber man muss sich das mal auf der Zunge zergehen lassen. Zunächst schnüren sie mal ein Bündel von Werbung aus den (angeblich anonymisierten) Suchmustern der Nutzer. Dieser **Eimer voll** ~~Gülle~~ **Werbung** ist aber nicht auf irgendwem persönlich zugeschnitten. Egal! Jeder bekommt den Eimer ungewollt in den Rechner geschoben… also den ganzen bunten Strauß von Werbung (die ja ggf. auch ein Sicherheitsrisiko darstellen kann… dazu haben andere schon ausreichend geschrieben). Er wird einem nur nicht angezeigt… aber er **liegt auf dem eigenen Rechner!**\n\nSucht man nun fröhlich herum, so wird nach und nach ein Muster des Suchverhaltens auf dem eigenen Rechner angelegt (also alles schön datenschutzkonform) und irgendwann, wenn das Feature aktiviert ist und genügend Infos auf dem Rechner sind, wählt das Addon aus besagtem Eimer anlässlich einer neuen Suchanfrage eine passende Werbung und strickt die in die Treffer ein.\n\nAbgesehen davon, dass ich **KEINE WERBUNG SEHEN MÖCHTE** und alles dafür tue, dass Werbung gar nicht erst zu mir durchdringt, ist das ja mal ne feine Idee. **Der Nutzer wird selbst zum Teil der Werbewirtschaft und der Rechner des Nutzers teilweise eine Werbemaschine.** Wozu denn Werbung auf dem eigenen Server vorhalten und über erschummelte Daten an die Nutzer verteilen, die dann vielleicht auch noch so einen bösen Blocker haben und die Werbung sie gar nicht erreicht. Nööö… der Dreck wird dem Nutzer mit dem Addon (gleich oder später… wohl eher später) geliefert, ohne dass er das merkt… und dann ist es der Rechner dieses Dödels, der dem Nutzer selbst die Werbung unterhilft.\n\nAlso wenn ich mir das alles anschaue, dann halte ich cliqz für einen widerlichen Haufen Dreck. Und der wird mir unter Umständen heimlich mit dem Browser Firefox auf den Rechner geklatscht und gleich aktiviert. Klar gehöre ich - hab ich ja schon erwähnt - zu den Nutzern, die das wissen und den Mist sofort wegputzen würden… aber das Verhalten der Macher von Firefox geht mir mal sowas von gegen den Strich. Ihr Ziele und Ideale haben sie damit (sie hatten ja schon einige „Ausrutscher“ in der Vergangenheit) endgültig verraten. Tja… dann eben nicht der Firefox.\n\nUnd das ist schade… denn wenn ich geschrieben habe, ich sei seit einiger Zeit wieder zum Fuchs zurückgekehrt, dann muss ich dazu sagen, dass es sich dabei um den Nightly handelt… also schon der mit dem neuen, ressourcenschonenden und leistungsstarken „Motor“. Damit macht das Surfen echt wieder richtig Spaß. Auch die wichtigsten Erweiterungen zur Keksverwaltung, uMatrix, HTTPS und einige andere laufen wieder oder ließen sich adäquat ersetzen… da passte also alles. Aber nach dem Ding… ist Schluss mit lustig!\n\nHeute habe ich mir (nachdem ich mir den [Waterfox](https://www.waterfoxproject.org/) angeschaut habe… ist auch ne nette Alternative… [Palemoon](https://www.palemoon.org/) ist nicht mein Ding, aber Teil meines Vier (nicht nur drei)-Browser-Prinzips… kommt mir aber echt zu altbacken) [IceCat](https://www.gnu.org/software/gnuzilla/) aus den Quellen compiliert (muss man aber nicht, gibts auch schon „vorgekocht“), mit allem bestückt, was ich brauche (und einiges bordeigenes abgeschaltet)… und ich muss sagen, dass der Browser echt auch nicht übel ist, selbst wenn er auf dem ESR-Stand 52.X ist. Muss ich halt ein wenig warten… der FF 59 soll ja wieder ein ESR werden… und ich hoffe dann auf die nächste „große“ Version auch bei IceCat.\n\nIch kann nur jedem raten, mal zu überlegen, ob es wirklich Firefox sein muss, selbst wenn man den Mist abschalten könnte. Eine Abstimmung mit den Füßen und auch entsprechende Kommentare an den einschlägigen Stellen können nicht verkehrt sein.\n\nUnd mit **Waterfox** oder **IceCat**… und wem es nix ausmacht auch mit **Palemoon**… ist man sehr ordentlich unterwegs.\n\nDie sonstigen Alternativen (QupZilla/Falkon, Midori, Arora… etc… etc…) kommen zumindest für MICH nicht in Betracht… da fehlt mir mein uMatrix (JA, ich WILL alles unter Kontrolle haben… und nach kurzer Zeit hat man sich an das angeblich so umständliche Freischalten von Funktionen gewöhnt und es stört echt nicht mehr)."
		},
		{
			"post_id": 13,
			"title": "﻿Chinesischer Schreibtisch - Deepin Desktop Environment",
			"date_published": 1508005225.732,
			"body": "![DDE Title](img/ddetitle.jpg)\n\nNun war ich zwei Jahre mit Gome3 \"unterwegs\". War keine schlechte Zeit, denn das Konzept war nach kurzer Zeit im Kopp und ich hatte nach einigen Wochen schon echte \"Schwierigkeiten\", wenn ich ein eher \"klassisches\" DE unter die Finger bekam (so mit Hauptmenü und ohne \"heiße Ecken\"). Auch die Shortcuts waren schnell in Fleisch und Blut übergegangen.\n\nAber nach und nach fühlte sich für mich das System immer \"zäher\" an… nun habe ich auch nicht den Highend-Rechner, sondern ein Arbeitstier, aber trotzdem sollte es nicht so sein, wenn man neben offenem Firefox (mit Tab-Suspender) und Thunderbird vielleicht mal ein Terminal, einen Texteditor, Gimp und ab und an mal LibreOffice öffnet. Das sollte der Rechner nebst Speicher wuppen. Aber ich hatte das Gefühl, als wäre da doch ein wenig Kaugummi drin.\n\n---\n\nSchaut man sich dann an, was Gnome3 so an Speicher und Prozessor konsumiert, war klar: Ich probiere es mal mit einem \"leichteren\" Desktop aus. XFCE hat mich (hatte das schon öfter mal ausprobiert) wieder nicht glücklich gemacht… Look & Feel sind mir echt zu \"altbacken\". Aber alles lief da schon flüssiger. Mate mit Compiz im Rücken war schon ein wenig näher an dem, was ich mir vorstellte und ebenfalls nicht so \"hungrig\". Dann stolperte ich über Budgie… DAS war schon eher das, was ich mir vorgestellt habe. Von KDE und damit von Qt-basierten Desktops war ich schon nach dem Ende von KDE3 weg… das aktuelle Plasma fühlte sich nett an, war auch flotter als mein Gnome3, aber warm werden konnte ich damit nicht. Budgie war da näher an meinen Erwartungen dran. Als ich nun las, dass Budgie auf dem Sprung von Gtk3 nach Qt ist, war ich trotzdem verunsichert. Nach Jahren Gtk-lastigem DE und auch Nutzung von Programmen, die überwiegend mit Gtk daher kamen, war ich mir nicht sicher, ob mir das schmecken würde.\n\nAlso habe ich mich mal nach DEs umgeschaut, die Qt unter der Haube haben (und nicht KDE heißen ;) )… LXQt fühlt sich an wie ein laufendes Experiment und Lumina noch mehr. Ich stieß dann auf das [Deepin Desktop Environment (DDE)](https://wiki.deepin.org/index.php?title=Deepin_Desktop_Environment)… der Oberfläche der chinesischen Distribution Deepin. Viele Infos waren im Netz nicht zu finden, aber mein Manjaro (von dem ich absolut nicht weg will und deshalb auch einen Wechsel zu Deepin als Distribution ausschließt) bietet ein sehr gut angepasstes DDE. Die Installation ging flott vonstatten… und das fühlte sich gleich richtig gut an. Nicht ressourcenhungrig, flott und elegant. Die speziellen Programme (Video- und Music-Player, Dateimanager, Bildverwaltung etc.) waren auch sofort angenehm zu bedienen. Das entsprach dem, was ich mir vorgestellt habe. Und das Bedienkonzept hatte ich auch sehr schnell gefressen. Insgesamt sehen die Qt-Applikationen sehr gefällig aus und laufen auch \"geschmeidig\". Schnell noch Xed als Qt-basierten Texteditor als \"Ersatz\" für gedit installiert (ein Blick lohnt sich)… und nun bin ich schon eine Weile mit DDE unterwegs und habe nicht das Gefühl, bald wieder wechseln zu müssen.\n\nWer einen modernen, flott laufenden, konsistenten und ressourcenschonenden Desktop ausprobieren mag, dem kann ich DDE echt ans Herz legen.\n\nIn der Grundkonfiguration kommt DDE schon ordentlich daher. Allerdings findet man (je nach Unterbau und genutzten Paketen) Icons auf dem Bildschirm… etwas, das ich schon lange nicht mehr hatte und auch nicht mehr haben wollte. Die wird man aber ganz flott los (allerdings habe ich ne Weile nach einer Einstellung dafür gesucht… die es nicht gibt): Einfach den Inhalt des von DDE neu angelegten Verzeichnisses \"Arbeitsplatz\" löschen… und weg sind sie.\n\nIch habe das Dock (aus alter Gewohnheit) an den oberen Bildschirmrand befördert und den \"effizienten Modus\" gewählt… es erscheint dann wie eine klassische Bildschirmleiste. Der \"Mode Modus\" lässt es wie ein Dock aussehen… das ist nicht so meine Welt, aber wer es mag, kann es auch so haben. Im Dock befinden sich schon einige Programmstarter, die auch als Umschalter zwischen laufenden Programmen fungieren.\n\n![desktop01](img/desktop01.png)\n\nFährt man (Standardeinstellung) in die obere linke Bildschirmecke, so öffnet sich (hey… fühlt sich an wie Gnome3) der Programmstarter (in der Grundeinstellung bildschirmfüllend… mit gut funktionierender Suche und links einer Leiste der Programmkategorien). Ein Rechtsklick auf einen Programmstarter öffnet ein Kontextmenü… nun kann man den Starter entweder auf den Bildschirm schicken (wie gesagt… nicht mein Ding) oder an das Dock (oder man kann es für einen Autostart beim Anmelden auswählen). Schnell war mein Dock mit den Startern bestückt, die ich brauche.\n\n![menu01](img/menu01.png)\n\nDie Bildschirmecken haben aber auch noch mögliche andere Funktionen. Voreingestellt ist die linke untere Ecke mit der Anzeige einer Übersicht über die laufenden Programme (Taskmanager), die man darüber auch anwählen kann.\n\n![task01](img/task01.png)\n\nDie rechte untere Ecke öffnet das \"Kontrollzentrum\"… hier kann man alle DDE-spezifischen Einstellungen vornehmen. Außerdem findet man dort auch eine Wetter-App und die Systembenachrichtigungen.\n\n![control01](img/control01.png)\n\nWelche Ecke jetzt für welche Funktion zuständig sein soll, kann man ganz einfach einstellen, indem man auf dem leeren Desktop das Kontextmenü aufruft (Rechtsklick). Hier kann man die Ecken dann nach eigenem Gusto belegen.\n\n![corner01](img/corner01.png)\n\nÜber dieses Kontextmenü gelangt man auch schnell zu den Anzeigeeinstellungen (aus dem Kontrollzentrum) und zur Wahl des Hintergrundbilds (das man für jeden virtuellen Desktop festlegen kann).\n\n![hinterg01](img/hinterg01.png)\n\nZwischen den virtuellen Arbeitsflächen wechselt man mit Super + -> bzw. Super + <-. Leider lässt sich das nicht für eine Bildschirmecke (oben rechts wäre bei mir noch \"frei\") festlegen. Es existiert aber ein entsprechender Starter im Dock, so dass man die Hand nicht unbedingt von der Maus nehmen muss.\n\n![vdesk01](img/vdesk01.png)\n\nJetzt alle DDE-spezifischen Einstellungen hier vorzustellen, würde den Rahmen des Artikels sprengen… aber ich werde mich einmal an eine deutschsprachige Anleitung dazu machen, die dann auch hier bei PepeCyB's Welt erscheint. Ebenso Hinweise bzw. Anleitungen zu den DDE-Programmen, die ich hier jetzt nur kurz vorstelle:\n\nBesonders gelobt wird der Deepin System Monitor. Das hat sicher seine Berechtigung, denn das Programm kommt nit sinnvollen Funktionen daher… allerdings ist das eine eher ressourcenhungrige Anwendung, weshalb ich nach wie vor den Taskmanager von XFCE bevorzuge. Wem der Appetit des Systemmonitors aber nix ausmacht, der wird damit zufrieden sein.\n\n![sysmon01](img/sysmon01.png)\n\nDer Dateimanager ist anfangs ein wenig \"gewöhnungsbedürftig\", funktioniert jedoch gut und für alltägliche Aufgaben sehr gut.\n\n![ddf01](img/ddf01.png)\n\nMusicplayer und Videoplayer sind auch gut zu gebrauchen (sofern man nicht ohnehin VLC nutzt).\n\n![music01](img/music01.png)\n\n![video01](img/video01.png)\n\nDer Bildbetrachter ist ordentlich und funktional… ebenso die Fotoverwaltung.\n\n![bild01](img/bild01.png)\n\nEin ordentlicher Voice-Recorder und auch ein Screen-Recorder werden angeboten.\n\n![voice01](img/voice01.png)\n\n![screen01](img/screen01.png)\n\nEin Kalender ist auch mit an Bord.\n\n![kalend01](img/kalend01.png)\n\nas Deepin Terminal hat mich positiv überrascht. Zunächst dachte ich, das wäre nix für mich, weil ich Tilix nutze, dessen Tiling-Funktion für mich sehr wichtig ist. Nun habe ich aber entdeckt, dass das Deepin Terminal diese Funktion auch bietet. Die Shortcuts sind schnell erlernt… und so nutze ich nun dieses Terminal.\n\n![term01](img/term01.png)\n\n**Mein Fazit:** Für mich ist DDE der Desktop meiner Wahl… nicht ressourcenhungrig, optisch ansprechend und geschmeidig in der Bedienung. Wer neugierig ist, sollte sich DDE mal in der Praxis anschauen."
		},
		{
			"post_id": 12,
			"title": "Die Unsitte mit den Unworten",
			"date_published": 1493241923.642,
			"body": "![unwort](img/unwort.jpg)\n\nDa hat sich einmal wieder die Jury, die der oberste Wächter über gute und schlechte Wörter ist, Gedanken gemacht und… mir war das schon lange klar… „Gutmensch“ zum Unwort des Jahres 2015 „gekürt“. Damit ist dieses Wort in sehr vielen Bereichen quasi „geächtet“ und selbst Unbedarfte scheuen sich nun, es zu verwenden, egal, was sie damit meinen und egal, in welchem Kontext sie es verwenden wollen. Sie beschleicht unbewusst, das unangenehme Gefühl, ein Tabu zu brechen und durch die Verwendung eines „schlechten“ Wortes, als „schlechter Mensch“ angesehen zu werden.\n\n---\n\nDie alljährliche Wahl des „Unwortes“ ist mir sowas von zuwider. Angeblich soll es sich dabei um Wörter handeln, die „gegen das Prinzip der Menschenwürde“ und „Prinzipien der Demokratie“ verstoßen, weil sie „einzelne gesellschaftliche Gruppen diskriminieren“ oder „euphemistisch, verschleiernd oder gar irreführend“ sind.\n\nDas erkläre mir bitte jemand… z. B. anhand der (in den letzten Jahren „gewählten“) Unworte alternativlos, Lügenpresse, Gutmenschen. Während vor einigen Jahren oftmals noch Wörter bzw. Wortgruppen gewählt wurden, die in speziellen Einzelfällen (und quasi nur dort und nicht im allgemeinen Sprachgebrauch) wirklich im schlechten Kontext verwendet wurden, beschleicht mich das Gefühl, dass diese Institution in jüngster Vergangenheit dazu benutzt wird, das Aussprechen bestimmter Gedanken (die nur noch im Kopf frei sind) zu erschweren, indem man bestimmte Begriffe als „Unworte“ labelt und damit eine Scheu provoziert, dieser zu benutzen. Hier wird die Sprache als Machtinstrument missbraucht.\n\nWenn Politiker „alternativlos“ verwenden, um ihre Vorstellungen bzw. das Durchsetzen ihrer Ideen ohne Möglichkeit einer Diskussion durchzusetzen, dann ist das durchaus negativ und dieser spezielle Fall sollte angeprangert werden. Das Wort an sich wird dadurch doch aber kein „schlechtes“ Wort und kann in vielen anderen Situationen durchaus berechtigt verwendet werden. Durch diese obskure „Wahl“ hingegen wird es aber pauschal negativ belegt und sehr viele Menschen versuchen, es zu verhindern. Die Freiheit der Sprache wird so indirekt eingeschränkt.\n\nWenn ich z. B. anhand eines nachweislich erlogenen Berichts eines bestimmten Mediums (Beispiele möchte ich jetzt nicht anführen, es gab im vergangenen Jahr mehr als genug Fälle, die den meisten bekannt sein dürften) ein solches als „Lügenpresse“ bezeichne, dann ist das ein Ausdruck meiner persönlichen Meinung (die ich ggf. durch Beweise belegen kann), macht mich aber noch lange nicht zum Nazi, nur weil das Wort in dieser Zeit, auf die die deutsche Geschichte gerne reduziert wird, gerne und mit schlechten Absichten verwendet wurde. Hey… ich habe zu dieser Zeit noch nicht gelebt und ich habe mit Nazis aber sowas von nix am Hut. Ich verwende das Wort, weil es Bestandteil der deutschen Sprache ist und meine Gedanken zu einem bestimmten Sachverhalt kurz, knapp und treffend zum Ausdruck bringt. Ich trage, wenn ich es verwende, noch lange kein braunes Hemd. Wer mir dies unterstellen will, der – so vermute ich – will davon ablenken, dass die Verwendung wohl ein „Treffer“ war.\n\nNun… jetzt werden also viele vermeiden, das Wort Gutmensch zu verwenden. Schließlich würde damit ja die Hilfsbereitschaft vieler Menschen diffamiert. Nun, ich werde es verwenden, wenn ich solche Menschen beschreiben will, die ihre (echte?) Hilfsbereitschaft instrumentalisieren, in der Öffentlichkeit als Kopfschmuck tragen und mich auch noch mit dem moralischen Zeigefinger anprangern, weil ich ihrem Beispiel nicht folge, sondern entweder andere Ansichten oder (wie in meinem Fall) einfach andere Prioritäten habe (ja, auch ich engagiere mich in einigen Bereichen, ich gehe damit aber nicht hausieren und klage auch niemanden an, der dies nicht tut… ich versuche auch nicht, andere von meiner Sicht in diesem Bereich ums Verrecken zu überzeugen).\n\nIch lasse mir die Verwendung meiner Muttersprache nicht von irgendwelchen „Institutionen“ zurechtbiegen, um zu versuchen, mir den Ausdruck bestimmter Gedankengänge, die einigen nicht in den Kram passen, zu erschweren.\n\nWirklich schlechte Gedanken kann man nicht durch die Ächtung bestimmter Wörter aus den Köpfen bringen. Das ist nur die Unterdrückung von Symptomen. Liebe „Sprachwissenschaftler“… kümmert Euch lieber um den Kern Eures Aufgabengebietes und überlasst es den wirklich Verantwortlichen, an den Ursachen(!) zu arbeiten."
		},
		{
			"post_id": 11,
			"title": "Jetzt neu: Das grüne Rot… oder das Huhn aus dem Blumentopf",
			"date_published": 1493241763.674,
			"body": "![grht](img/grht.png)\n\nVorneweg: Ich habe absolut keine Probleme mit Menschen, die für sich selbst entschieden haben, sich rein vegetarisch zu ernähren oder die ein veganes Leben führen wollen. Ich habe auch nichts dagegen, mich mit solchen Menschen über diese Themen auszutauschen.\n\n---\n\nEs gibt viele Gründe, weshalb man sich für einen dieser Wege entscheidet… auch zahlreiche wirklich gute Gründe. Wer zum Beispiel von der Fleischerzeugung und -verarbeitung angewidert ist und deswegen nun auf Fleisch und Fleischprodukte verzichten möchte, der hat eine für mich nachvollziehbare Entscheidung getroffen. Oder wer zum Vegetarier wird, weil er nicht nachvollziehen kann, was ihm auf dem Lebensmittelmarkt verkauft wird… wer keine Böcke hat, Fleisch von Tieren zu konsumieren, die vielleicht unwürdig oder unter Qualen gehalten oder geschlachtet wurden… wer keine Lust auf einen Chemie- oder Medikamentencoktail beim Fleisch- oder Wurstkonsum hat… nun den kann ich voll und ganz verstehen. Ich selbst habe den Vorteil, dass ich das Fleisch bzw. die Fleischprodukte, die ich konsumiere nach bestimmten Kriterien aussuchen (und sogar bezahlen) kann. Und ich muss auch nicht jeden Tag Fleisch auf dem Teller haben… habe ich auch nicht. Ich ernähre mich selbst auch immer wieder „vegetarisch“ (teilweise vielleicht in sehr „frei ausgelegter“ Form, weil ich in der Kartoffelsuppe gerne ein wenig geräucherte Speckwürfel für den guten Geschmack habe), denn es ist auch nicht immer Fleisch auf dem Teller. Die Fleischprodukte, die bei mir über den Herd gehen… na, bei denen weiß ich ziemlich genau, woher sie kommen und ich weiß, dass die Tiere ein „menschenwürdiges“ 😉 Leben hatten. Darauf lege ich Wert. Diese persönliche Entscheidung führt dazu, dass ich eben kein Vegetarier bin.\nAuch die Entscheidung zu einem veganen Leben (da geht es ja nicht nur ums Essen) ist doch jedem erwachsenen Menschen selbst überlassen. Mag sein, dass es für den einen oder anderen einfach moralisch zwingend ist… ob es gesund ist, wage ich persönlich zwar zu bestreiten… aber jeder soll doch so glücklich werden, wie es ihm beliebt.\n\nAber nun zum eigentlichen Thema: Ich habe jetzt einen roten Lack erfunden, der grün ist! Ja… tatsächlich! Wer eine Fläche grün lackieren möchte, der greift einfach zu meinem roten Lack und wird sich hinterher über ein sattes Grün freuen können!\nNachdem ich den Produktionsprozess für den Lack nun komplett entwickelt habe, bin ich schon beim nächsten Projekt: Das pflanzliche Huhn. Es ist mir gelungen, Eier dazu zu bringen, in Blumenerde zu keimen, so dass ein rein pflanzliches Huhn heranwachsen kann. Das wird sicher auch sehr schön im Blumenkasten auf dem Balkon aussehen und jeder kann sein eigenes Suppenhuhn im Beet produzieren.\n\nNa? Bin ich jetzt durchgeknallt? Neee! Bin ich nicht! Ist alles nur erfunden! Vollkommener Blödsinn, wie mir jeder bestätigen wird. Ich wollte Euch nur verarschen!\n\nVerarschen? Macht man sowas? Gehört sich das?\nAnscheinend ja, denn etliche Lebensmittelhersteller tun das ja auch. Damit meine ich nicht irgendwelche unbewiesenen Versprechen bezüglich ihrer Produkte. Das ist zwar auch nicht fein, aber gehört wohl „dazu“. Aber wenn ich in letzter Zeit immer wieder mit Werbung für Produkte wie „grünes Rot“ oder „Hühnerpflanzen“ belästigt werde, dann fühle ich mich wirklich verarscht.\n\nWenn ein Lebensmittelhersteller vegetarische Produkte anbieten möchte… nun, dann muss er sich dafür passende Bezeichnungen einfallen lassen. Dafür gibt es bestimmt bezahlte Mitarbeiter, die sowas können. Die Bezeichnung muss auch nicht „ulkig“ oder „abstoßend“ oder „verrückt“ sein… da findet sich sicher etwas, was passt, gut klingt und gefällt.\n\nAber sagt mal, wollt Ihr mich verarschen?\n\nWas – Scheiße nochmal – ist denn „Veggie Fleischsalat mit Gurke“? Bitte mal (das Wort, nicht den Salat) auf der Zunge zergehen lassen… FLEISCHsalat ohne Fleisch! Da ist, wenn man nachliest, dann „Vegetarisches Eiweißerzeugnis Typ Lyoner“ verarbeitet, das aus Öl, Eiweiß, Algenkram und Johannisbrotkernen hergestellt ist („Lyoner“ empfinde ich auch als ziemlich unverschämt, denn das ist die Bezeichnung für eine FLEISCHwurst!). Keine Spur Fleisch ist dabei. Aber sie nennen es FLEISCHsalat. Warum das denn? Wenn ein Vegetarier sich entschließt, auf Fleisch zu verzichten, dann wird er wohl auch auf das Wort Fleisch in seinen Lebensmitteln verzichten können (ok, ok… Fruchtfleisch ist was anderes… aber da weiß jeder, dass damit kein tierisches Produkt gemeint ist). Was hätte denn gegen „Johannisalat mit Gurke“ gesprochen. Das hätte doch eher gepasst. Wenn jemand auf Fleisch verzichten möchte, dann wird er doch keinen Fleischsalat essen wollen.\n\nDann erfährt man von „Vegetarischen ****** Chickenburgern“. Bitte? Ein Chickenburger ist ein Burger (Brötchen) mit einer Chicken-Frikadelle (ick sach Boulette) drin. Chicken ist das englische Wort für Huhn (gallus gallus domesticus). In einem Chickenburger sollte also ein Stück durchgedrehtes, geformtes und gebratenes (gegrilltes?) Hühnerfleisch drin sein. Lese ich Chickenburger, dann ist das ein Gericht mit Hühnerfleisch. DAS KANN NICHT vegetarisch sein! Huhn ist Fleisch. Die Zutatenliste des Produkts offenbart auch, dass da kein Fleisch drin ist, sondern irgendwas mit Soja etc. Das ist auch ok. Also sollte man das Produkt doch „Vegetarischer ****** Burger“ nennen. Dann weiß jeder, dass da kein Fleisch drin ist. Aber wer Huhn draufschreibt, der muss doch auch Huhn reinmachen (scheint so zwar gesetzlich nicht vorgeschrieben), ansonsten ist das absoluter Hirnriss.\nWarum – frage ich erneut – muss denn Chicken im Namen enthalten sein? Will ein Vegetarier denn Huhn essen? Will er, dass sein Essen „Huhn“ heißt?\nDie Firma hat noch mehr solche Korken im Angebot… „Vegetarischer Schinken Spicker“. SCHINKEN ist… ich sags mal locker… der Arsch vom Schwein (oder von einigen anderen TIEREN). Es gibt „Schinkenersatzprodukte“… also müsste es „Vegetarischer Schinkenersatzprodukt Spicker“ heißen… ok… das klingt jetzt blöd… aber irgend ein netter Name mit „Wurst“ hintendran müsste der Marketingabteilung doch wohl einfallen. Mit SCHINKEN hat das Produkt jedenfalls nichts zu tun.\nOde wie wäre es mit „Vegetarischer ****** Fleischwurst“? FLEISCHwurst! Ich sag nix weiter dazu!\n\nDas ist eine Entwicklung, die mir so richtig auf den Piss geht! Nichts gegen vegetarische Produkte (die genannten Sachen können prima schmecken… bin sicher, sie könnten vielleicht auch mir schmecken… wenn ich sie denn probieren würde… was ich aber aufgrund der offensichtlichen Verarsche aus Prinzip nie tun werde…), aber solange sie kein pflanzliches Huhn im Blumentopf züchten können, gibt es kein „vegetarisches Chicken-Irgendwas“!\n\nFrüher habe ich auch nicht verstehen können, weshalb es „Grünkernbouletten“ oder „Tofuschnitzel“ gabe… weshalb vegetarische Fleischersatzprodukte unbedingt so wie echte Fleischprodukte geformt sein müssen… aber das leuchtet mir doch ein. Das Auge isst mit… und oftmals ist die Form auch einfach praktisch. Damit habe ich auch keine Probleme. Aber ein Produkt, dass kein Fleisch ist, „Fleisch“ zu nennen… dafür gibt es jetzt wirklich keine plausible Begründung. Da wird versucht, einen Trend auszunutzen und die Leute echt zu verarschen… für dumm zu verkaufen.\n\nUnd jetzt hacke ich Holz aus Wasser, um heute Abend das Wohnzimmer kalt zu heizen."
		},
		{
			"post_id": 10,
			"title": "How much is the fish?",
			"date_published": 1493240547.984,
			"body": "![hmitfish](img/hmitfish.jpg)\n\nEher zufällig bin in vor Kurzem über die Shell „**fish**“ gestolpert… also ich habe davon gelesen. Also schnell mal installiert und aufgerufen.\n\nOk… ist halt ne Shell, dachte ich. Ein wenig bunter, aber nix… Mooooooment…\n\nSchon beim Eintippen der ersten Kommandos fällt auf, dass da doch einiges anders ist. Es werden direkt bei der Eingabe Vorschläge gemacht, ein Tippen auf TAB öffnet dann eine Liste aller Kommandos, die so beginnen, wie die ersten eingegebenen Buchstaben… und durch diese Liste kann man mit den Cursortasten navigieren und mit der Eingabetaste den Befehl auswählen.\n\n![hmitf_02](img/hmitf_02.png) ![hmitf_03](img/hmitf_03.png)\n\nDas ist ja schon mächtig komfortabel.\n\n![hmitf_05](img/hmitf_05.png)\n\n---\n\nGibt man help ein, so wird der System-Webbrowser gestartet (oder wenn er schon offen ist, ein neuer Tab geöffnet) und die Hilfeseite geöffnet. Hier findet man alle internen Kommandos von fish und die Kontrollstrukturen zur Shellprogrammierung. Außerdem ein FAQ-Bereich und ein Tutorial. Insgesamt ist die Dokumentation wirklich sehr ausführlich… so sollte das auch sein. Weitere Informationen , insbesondere zur Shell-Programmierung und zum Erstellen von Completions (automatische Vervollständigung) findet man auch bei [stack overflow](https://stackoverflow.com/), wenn man im Suchfeld fish oder fishshell eingibt.\n\nWill man fish konfigurieren, so kann man das von Hand erledigen, es geht aber auch recht einfach über ein Web-Interface.\n\n![hmitf_06](img/hmitf_06.png)\n\nGibt man fish_config ein, so startet Fish einen einfachen lokalen Webserver, öffnet den Browser und man landet auf der Konfigurationsseite. Auf dieser Seite kann man sehr einfach die Farben und den Prompt einstellen, Funktionen und Variablen anschauen, die History anschauen und Einträge daraus löschen, Bindings anschauen und schließlich Abbreviations (Abkürzungen für Befehlszeilen) bearbeiten.\n\n![hmitf_04](img/hmitf_04.png)\n\nDie Installation wird auf der [Homepage von fish](https://fishshell.com/) gut erläutert… bei meinem Debian war das mit einem\n\n`sudo apt-get install fish`\n\nim Handumdrehen erledigt, weil sich das Programm in den offiziellen Quellen befindet.\n\nEine wirklich tolle Angelegenheit ist auch die TAB-Selection von Parametern auch externer Programme. Gibt man ein Kommando ein und dann den „-“ oder „–“ für einen Parameter und betätigt die TAB-Taste, dann wird eine Auswahlliste der Parameter angezeigt (mit Erläuterungen), die man auch wieder mit den Cursortasten auswählen kann.\n\nSchon nach kurzer Zeit habe ich festgestellt, dass fish für mich echt perfekt für die tägliche Arbeit ist. Diese Shell wird zwar oft als „Einsteiger-Shell“ angepriesen, aber weshalb sollte ich auf Komfort verzichten, nur weil ich mich mit der bash auch gut auskenne. Wenn ich es bequemer haben kann, dann lasse ich mir das auch gefallen. Deshalb ist fish jetzt als Standard-Shell bei mir eingestellt.\n\nAnfangs muss man sich aber auch ein wenig umstellen, weil die sich doch ziemlich vom POSIX-Standard, den man von bash und co. gewohnt ist, unterscheidet.\n\nEs gibt aber auch noch einige weitere Quellen im Internet, wo teilweise auch auf diese Besonderheiten oder Unterschiede eingegangen wird.\n\nDie erste „Herausforderung“ für mich war der Midnight Commander (mc). Ich habe unter bash immer das Wrapper-Script verwendet, mit dem man nach Beenden des mc im letzten ausgewählten Verzeichnis landet. Nun, diese Scripts funktionieren NICHT! Weder die (ba)sh-, noch die csh-Version. Aber ich war echt erstaunt, wie schnell sich das mit Bordmitteln der fish erledigen ließ. Viel einfacher, als man denken mag.\n\nIn der Shell kann man Funktionen erstellen (der Editor ist auch angenehm komfortabel). Also habe ich eine Funktion „m“ erstellt:\n\n```function m\n  /usr/bin/mc -P ~/.temp/mcwd\n  cd (cat ~/.temp/mcwd)\n  rm ~/.temp/mcwd\nend```\n\nUnd siehe da… das hat schon funktioniert. Die Eingabe von „m“ in der Shell startete den mc und nach Beendigung landete man im letzten Verzeichnis. Prima!\n\nWenn man eine solche Funktion erstellt hat und loggt sich aus, ist sie aber leider wieder weg. Fish hat aber ein Konfigurationsverzeichnis (~/.config/fish/) und dort gibt es ein Unterverzeichnis für Funktionen, die beim Einloggen automatisch eingelesen werden und so dann zur Verfügung stehen. Man muss aber dafür keinen extra Editor bemühen, die Funktion einhämmern und dann dort als Datei abspeichern. Hat man die Funktion in der Shell erstellt und man ist zufrieden damit, so genügt es das Kommando funcsave zu verwenden. Damit wird die Funktion automatisch im Autostart-Verzeichnis gespeichert.\n\nAlso rasch\n\n`funcsave m`\n\neingegeben… und seither steht mir m dauerhaft zur Verfügung.\nWeil man sich aber daran gewöhnt hat, „mc“ einzugeben, wenn man den Midnight Commander starten will, habe ich noch ein entsprechendes Alias definiert (das läuft so, wie man es von der bash kennt):\n\n`alias mc „m“`\n\nUm dieses Alias auch direkt nach jedem Login zur Verfügung zu haben trägt man die Zeile einfach in die Datei config.fish ein (~/.config/fish/config.fish), die man ggf. erst erzeugen muss (touch config.fish), wenn sie noch nicht vorhanden ist.\n\nDie ganze Angelegenheit hat mich incl. „Einarbeitungszeit“ in die Systematik von fish vielleicht ne Viertelstunde gekostet. Fish ist wirklich einfach!\n\nDas war jetzt hier auch nur ein ganz kurzer und kleiner Einblick… es gibt noch unzählige wirklich tolle Features. wenn man sich durch die Dokumentation gelesen hat, ist man schlauer… und man entdeckt immer wieder neue Möglichkeiten.\n\nAch, ein kleines „Schmankerl“ fällt mir gerade noch ein…\n\nHat man sich in ein Verzeichnis gehangelt und dort liegt eine Datei, die man mit dem Standard-Programm für den Dateityp öffnen möchte, so gibt man ganz einfach nur\n\n`open <Dateiname>`\n\nein… schon wird die Datei mit der voreingestellten Anwendung geöffnet.\n\nodt-Dateien sind bei mir z. B. mit LibreOffice 5.1 verknüpft. Habe ich nun eine Datei „Dokument.odt“ und ich gebe in fish\n\n`open Dokument.odt`\n\nein, wird LO-Writer gestartet und die Datei geöffnet. Das ist schon sehr praktisch.\n\nIch kann es echt empfehlen, sich fish einmal anzuschauen. Das ist auch kein „Rückschritt“. Ich bin ja selbst auch mit bash sehr fit, habe aber die Vorteile von fish für mich entdeckt und genieße den größeren Komfort.\n\n_**Links:**_\n\n1: [Fish-Webseite](https://fishshell.com/)\n\n2: [The missing fish shell tutorial](https://geowarin.github.io/the-missing-fish-shell-tutorial.html)\n\n3: [Speaking UNIX: Go fish!](https://www.ibm.com/developerworks/aix/library/au-spunix_fish/)\n\n4: [Shell Translation Dictionary](https://github.com/fish-shell/fish-shell/wiki/Shell-Translation-Dictionary)  (Übersicht, um (ba)sh-Kommandos in fish umzusetzen)\n\n5: [starrhorne/Fish-Shell-Scripts](https://github.com/starrhorne/Fish-Shell-Scripts)\n\n6: [zmalltalker/fish-nuggets](https://github.com/zmalltalker/fish-nuggets)"
		},
		{
			"post_id": 9,
			"title": "Eine Erklärung für die sinkende Arbeitslosenquote",
			"date_published": 1493240217.411,
			"body": "![experten](img/experten.jpg)\n\n![ironie](img/ironie.png) Gestern kam mir die Erkenntnis. Die immer noch sinkende Arbeitslosenquote erklärt sich nicht dadurch, dass immer mehr Menschen, die von staatlicher Unterstützung leben müssen, aus der offiziellen Statistik herausgelogen werden… nein…\n\nDie Erklärung ist ganz einfach und offensichtlich: Die Agentur hat es geschafft, unglaublich viele Arbeitssuchende in Lohn und Brot zu bringen… sie hat sie zu\n\n<p style=\"text-align: center;\"><strong>T E R R O R I S M U S E X P E R T E N</strong></p>\n\nausgebildet… und die haben aller Arbeit gefunden!\n\nIn den letzten drei Tagen (Dezember 2016 / seit „Hardenbergplatz“) habe ich aus Interesse mal mitgezählt… vier Sender… ELF verschiedene Terrorismusexperten. Wenn man dann die Sendervielfalt berücksichtigt und noch andere Medien, wie Radiosender, Zeitungen, Magazine hinzurechnet und man aufgrund meiner Beobachtung mal hochrechnet, dann hat jedes dieser Medien im Durchschnitt 2,75 Terrorismusexperten… damit kann man Millionen aus der Arbeitslosigkeit retten.\n\nVöllig klar also, weshalb die Quote sinkt.\n\nIch schätze, wenn man heute Jugendliche befragt, was sie später mal werden wollen, dann bekommt man zur Antwort nicht mehr „Superstar“, sondern „Terrorismusexperte“. Gut, dass es so viele Experten für ein so vielschichtiges Phänomen wie den Terrorismus gibt… DIE können uns wenigstens die Welt mal RICHTIG erklären ![ironie](img/ironie.png)"
		},
		{
			"post_id": 8,
			"title": "Hätte, hätte, Fahrradkette!",
			"date_published": 1493239664.613,
			"body": "![specu](img/specu.jpg)\n\nDa wartet man und wartet… wartet gespannt… die Spannung steigt… und jetzt ist es klar: Die bösen Russen haben in den amerikanischen Wahlkampf eingegriffen… und der noch bösere Putin hat den Auftrag gegeben. Und jetzt wollen sie Angie stürzen.\n\n<p><span style=\"text-decoration: underline;\">Amerikanischer Geheimdienst:</span></p>\n\n>   Wir gehen außerdem davon aus, dass…\n>\n>    … Einschätzung…\n>\n>    Wir sind auch überzeugt…\n>\n>    Wir gehen davon aus, dass…“\n\n---\n\nUnd dann noch als zusätzliche Meldung, eine Aussage des <span style=\"text-decoration: underline;\">Bundesamtes für Verfassungsschutz</span>:\n\n>    Für den Hackerangriff auf Computer der Organisation für Sicherheit und Zusammenarbeit in Europa (OSZE) im Dezember könnte Russland verantwortlich sein.\n\nSelbst wenn die Geheimagenten jetzt nicht unbedingt ihre Beweise auf den Tisch legen können (oder wollen), so wäre doch zu erwarten gewesen, dass sie knallhart raushauen, dass es Beweise oder eindeutig belastende Indizien gibt… dass man Hintermänner kenne, Server-Logdateien russische Hacks belegen… halt sowas.\n\nAber nein, man **geht davon aus**, **hat eine Einschätzung**, **ist überzeugt**, weil könnte! Das ist schon kein „im Trüben fischen“ mehr, das ist ein großer Eimer voll… **NICHTS**! Unser Verfassungsschutz argumentiert mit einem deftigen „**könnte**„. Hut ab! Mag sein, dass diese Experten daran glauben… aber der Glaube sollte der Kirche vorbehalten bleiben.\n\nFatal nur, dass aus diesen unbelegten Behauptungen Konsequenzen folgen. Darauf habe ich keine Böcke!\n\n \n\n<p><span style=\"text-decoration: underline;\">Nachtrag:</span></p>\n\nWer das „Beweismaterial“ des US-Geheimdienstes nachlesen will, der völlig ohne Beweise auskommt, kann sich das gerne antun:\n\n[Background to “Assessing Russian Activities and Intentions in Recent US Elections”: The Analytic Process and Cyber Incident Attribution](https://www.dni.gov/files/documents/ICA_2017_01.pdf)"
		},
		{
			"post_id": 7,
			"title": "Gebt mir bitte noch 50 Jahre!",
			"date_published": 1493238291.73,
			"body": "![stop-noch50jahre](img/stop-noch50jahre.jpg)\n\nIch habe mir fest vorgenommen, 100 Jahre alt zu werden… bei bester Gesundheit und wachem Geist. Die Hälfte hab ich rum… jetzt hätte ich gerne noch 50 Jahre. Und zwar 50 Jahre in Frieden und Freiheit… UND mit heilem Arsch!\n\nWas ist denn los mit der Welt? Sind jetzt alle vollkommen bekloppt geworden? Muss die Weltbevölkerung wieder dezimiert werden? Fehlt der Kick? Reichen wahnsinnige Extremsportarten oder Selfies, am kleinen Finger über einer tiefen Schlucht hängend oder auf der Spitze eines Kirchturms balancierend nicht mehr aus? Meine Güte… wer des Lebens überdrüssig ist, der soll doch einfach damit Schluss machen… aber lasst MICH damit in Ruhe und zieht mich vor allem nicht da mit rein!\n\nLetztes Jahr geht der Scheiß in der Ukraine los und es wird – so erscheint es einem – ums Verrecken versucht, einen Krieg inmitten Europas loszutreten… die Fäden laufen AUCH über den Atlantik in einem ovalen Büro… knapp 8.000 km vom Ereignisort entfernt… zusammen und werden da kräftig gezogen. Die Marionetten in Berlin und anderen europäischen Hauptstädten tanzen auch prima an anderen Fäden mit… die Stahlhelme sind poliert!\n\n---\n\nSchade für die Initiatoren, dass es letztlich doch noch nicht wirklich gekracht hat… aber das Thema ist noch längst nicht abgegessen… weiter wird ordentlich Kriegsgerät in die Nähe geschafft… wenn’s doch noch klappt, dann können „wir“ da ein Heiden-Spektakel veranstalten. Macht ja nix, dass sich das Ganze vor „unserer“ Haustür abspielen wird und dass vielleicht… wenn es so richtig brennt… nicht nur Rauch, sondern auch Flammen durch die Tür dringen und der Tanz dann sogar bei „uns“ zu Hause auch noch stattfindet. Diejenigen, die ihre Interessen durchdrücken wollen, sitzen ja schön weit weg und können sich das Ganze aus der Loge anschauen.\n\nLeider gab es dann doch zu viele „Ablenkungen“, dass der Brandherd Ukraine so ein wenig aus dem Fokus des öffentlichen Interesses geraten ist… aber es gibt da ja noch andere Feinde. Syrien ist auch gar nicht so viel weiter weg. Und die Ereignisse in Paris haben dazu geführt, dass sehr viele Menschen sich nun konkret und direkt bedroht fühlen (auch ich bin entsetzt über die Anschläge und mir tun die Opfer und deren Angehörige unglaublich leid), selbst wenn das Sterben in der Mitte Europas nur ein Fliegenschiss im Vergleich zum Sterben im nahen Osten ist. Schon setzt sich die Meinung durch, die Terroristen verstünden nur eine Sprache… die des Krieges… sie müssten vernichtet werden. Dumm nur, dass es sich nicht einrichten lässt, die IS-Kämpfer in einen eingezäunten Bereich zu bringen und da wegzubomben. Die sind so uneinsichtig… die halten sich in weit verstreuten und auch von UNSCHULDIGEN und UNBETEILIGTEN bewohnten Regionen auf… die müssen dann halt auch mit zerrissen werden… Kollateralschäden sagt man heute und versucht darüber hinwegzutäuschen, dass es bei diesen Kollateralschäden um Menschen geht, die einfach mal getötet werden. Dass ein solches Vorgehen nicht gerade dazu führt, „uns“ Sympathien in diesen Gegenden einzubringen (ich kann nachvollziehen, das die Überlebenden echt sauer auf die Mörder ihrer Frauen, Männer, Brüder, Schwestern, Kinder, Großeltern sind… ich würde nicht anders empfinden… und auch die Betroffenen der Anschläge in Paris empfinden ja derzeit nicht anders) und zu erneuter Gegengewalt führen wird, ist ausgesprochen logisch. Trotzdem werden jetzt schon mal die Flinten geputzt (rein virtuell) und vor allem diejenigen, die sich nicht an diesem Krieg persönlich beteiligen müssen, schreien laut, dass „wir“ da mal kräftig aufräumen müssen… lasst uns mal „unsere“ Kinder bewaffnen und da hin schicken… äääh… also jetzt nicht MEINE Kinder… aber generell „unsere“ Jungs und „Mädels“… also die ganzen ANDEREN Kinder… vielleicht nicht aus der Familie und dem Freundeskreis. aber ja… trotzdem… sind ja auch noch andere da.\n\nJeder, der sein Maul derzeit so aufreißt, sollte ein Gewehr in die Hand gedrückt bekommen und man sollte ihm sagen: „Na dann geh doch schon mal los nach Syrien und Umgebung! Verteidige DU uns schon mal dort in der Fremde!“ Die entgeisterten Gesichter kann ich mir lebhaft vorstellen.\n\nTrotzdem geht der militärische Kampf gegen den IS unvermindert weiter (es ist ja nicht so, dass da erst seit Paris bombardiert wird… auch wenn es einem die Pressemeldungen so suggerieren) und wird halt noch verschärft. Dass es da absolut nicht um „freiheitliche Werte“ geht, sondern viel mehr um materielle Werte und Macht (=Geld=Macht=Geld=Macht…), macht die Sache aber nicht unkomplizierter. Da werden diverse Süppchen gekocht. Die an Syrien grenzende Türkei… also deren Machthaber… haben gar kein so großes Interesse daran, den IS zu bekämpfen… da liegt das Hauptaugenmerk auf die Beseitigung von Assad. Der tut nämlich nichts gegen die Kurden, die auf dem besten Weg dazu sind, sich in unmittelbarer Nachbarschaft zur Türkei quasi ein autonomes eigenes Gebiet zu sichern… das geht nun wirklich nicht… Also DER muss vordringlich weg… nach den Vorstellungen von Herrn Erdoğan. Der IS… ach den kann man so tolerieren… schließlich kann man bei dem ja sogar super günstiges Erdöl (nicht offiziell… so blöd ist man nicht) für Millionen und Abermillionen kaufen. Der „böse“ Putin (wir erinnern uns… das beim Ukraine-Konflikt geschaffene Feindbild) hat wieder ganz andere Interessen. Auch er greift da ein, schießt gegen IS aber auch gegen andere Rebellen-Gruppen, die ihrerseits gegen Assad kämpfen. Das passt dem türkischen Chef natürlich nicht… aber trotzdem sind Türkei und Russland keine Kriegsparteien.\n\nUnd jetzt das! Da schießen diese völlig durchgedrehten Vollpfosten ein russisches Flugzeug ab, weil es kurzfristig und minimal den Luftraum der Türkei verletzt hat. Schade… Timing hat nicht gestimmt… das Flugzeug war leider schon wieder aus dem türkischen Luftraum raus, als es abgeschossen wurde… also es wurde ein Flugzeug im FREMDEN Luftraum runter geholt. Das ist wie einem flüchtenden Angreifer in den Rücken zu schießen und dann zu behaupten, man habe sich verteidigt. Ein Notwehrschuss in den Rücken ist selbst hierzulande schwer vor Gericht durchzudrücken. Außerdem… und das sollte man nicht vergessen… sind Russland und Türkei keine kriegführenden Parteien, die gegeneinander kämpfen oder sich bedrohen. Das russische Flugzeug war mit Sicherheit keine Bedrohung für die Türkei. Man hätte diplomatisch ordentlich ein Fass aufmachen können… aber nein, Herr Erdoğan und seine irrsinnigen Gefolgsleute holen den Flieger mal rasch runter. Haben die den Arsch offen? Ist diesen Wahnsinnigen eigentlich klar, was sie mit solch einem Vorgehen heraufbeschwören können? Na ja… man kann sich ja alles erlauben, wenn man nur pfeifen muss und schon kommen die großen Brüder um die Ecke, um einen zu beschützen (NATO).\n\nIch bin so naiv gewesen, zu glauben, die NATO würde sich erst einmal „bedeckt“ halten. Sowas dämliches, das zu glauben (oder zu hoffen)…\n\nNato-Generalsekretär Jens Stoltenberg: „Wir sind solidarisch mit der Türkei und unterstützen die territoriale Unversehrtheit unseres türkischen Nato-Verbündeten.“\n\nAlles klar… sollte der Russe (was ich nicht glaube… wovon ich echt nicht ausgehe) militärisch auf den Vorfall reagieren, dann springt die NATO an die Seite der Türkei und dann wird dieses wertvolle Mitglied des Bündnisses aber mal so richtig gegen die Bösen verteidigt. Na wer sagt‘s denn? Vielleicht ist es ja doch noch drin, auch deutsche Soldaten gegen Russland zeitnah in den Krieg zu führen. Bewaffnet schon mal die Kinder… aaaber MEINE nicht… und nicht… … … na ja…\n\nAch ja, der Strippenzieher im ovalen Büro hat es sich auch nicht nehmen lassen, zu verkünden: „Die Türkei hat wie jedes Land das Recht, ihren Luftraum zu verteidigen.“\n\nPrima! Wer hat DICH denn eigentlich gefragt? Was hast DU denn damit zu schaffen, Du „Friedensnobelpreisträger“? (Den hat er ja bekommen “für seine außergewöhnlichen Bemühungen, die internationale Diplomatie und die Zusammenarbeit zwischen den Völkern zu stärken“… jetzt hab ich vor Lachen wieder Schnappatmung…)\n\nUnd dann wird noch großkotzig zur „Besonnenheit“ in dieser Auseinandersetzung aufgerufen. Wer hat denn wessen Flugzeug vom Himmel geholt? Wer hat denn unbesonnen gehandelt?\nEs wird um „Deeskalation“ gebeten. Wer hat denn eskaliert?\n\nWir können nur hoffen, dass die Sache echt irgendwie im Sande verläuft, sonst haben wir ein großes Problem. Wir müssten nämlich den Türken zur Seite stehen und ggf. gemeinsam mit ihnen gegen Russland vorgehen. Na ja… passt prima dazu, dass Erdoğan ohnehin hofiert wird, egal, was er so macht. Erstmal müssen jetzt ein paar Milliarden aus der EU fließen, damit er den Flüchtlingszustrom ein wenig bremst (Osterhase und Weihnachtsmann werden ihm sicher dabei helfen… ach ja… und die Zahnfee…). Es geht dabei um die Flüchtlinge, die übrigens auf dem Weg zu „uns“ sind, weil „wir“ die Konflikte, die zu ihrer Flucht geführt haben, zum großen Teil mit verursacht haben und das Feuerchen schön weiter am brennen halten (während es da kracht und wir nicht wissen, wie viele Menschen noch vor Krieg und Gewalt zu uns flüchten müssen, verkaufen „wir“ weiter schön Waffen nach dort, die für noch mehr Destabilisierung sorgen… Glückwunsch…).\n\nAch… macht doch was Ihr wollt! Brecht doch einfach einen Krieg vom Zaun… der vielleicht ganz Europa und angrenzende Regionen vom Antlitz dieses Planeten putzt… ABER LASST EUCH – verdammte Scheiße – DAMIT NOCH 50 JAHRE ZEIT! Wenn ich abgetreten bin, könnt Ihr echt machen, was Ihr wollt, aber haltet mich aus diesem Scheiß raus! Mischt euch nicht überall ein… versucht so wenig Unfrieden, wie möglich zu stiften… nur noch 50 Jahre bitte. Nach mir die Sintflut!"
		},
		{
			"post_id": 6,
			"title": "Der Gockel wird weggesperrt",
			"date_published": 1493237745.977,
			"body": "![ausgegockelt](img/ausgegockelt.jpg)\n\nAus dem Fratzenbuch bin ich nun schon geraume Zeit raus… und vermisse nichts! Beim Gockelplus bin ich noch geblieben und habe das SN genutzt, um das Erscheinen neuer Artikel zu streuen. Das, was mich an für mich interessanten Informationen von G+ erreichte, war wenig… sehr wenig.\n\nHeute habe ich dann mal wieder meine Cookies durchstöbert… Hut ab! An die 60 Kekse, die mir aus dem Dunstkreis des Gockels in den Speicher geschissen wurden. Und das, obwohl ich Gockel ansonsten meide. Meine Suche findet mit ixquick oder StartPage statt, meine News beziehe ich aus einigen anderen Quellen und Installationen auf dem Android (der Grund, weshalb ich meinen Gockel-Account nicht löschen werde) führe ich direkt vom Smartphone durch. Den letzten Keks-Hausputz hatte ich vor ca. acht Wochen gemacht und seit dem habe ich selten den Gockel+ aufgerufen, wenn ich einen Artikel streuen wollte. Irre, was man sich dabei schon „einfängt“.\n\n---\n\nNun ist aber gut! Wenn ich mir anschaue, wie viele Klicks ich via G+ auf meine Artikel bekomme, dann stimmt für mich das Kosten- (überfüllte Keks-Kiste, die vornehmlich dazu dient, Informationen über mich zu sammeln und mich mit zwar unerwünschter, aber ach so perfekt auf mich abgestimmter Werbung zu belästigen und mich bei den Suchergebnissen in der Filterblase gefangen zu halten) -Nutzen-Verhältnis nicht.\n\nDie Konsequenz: Ich habe das an Funktionen (mit „Mehrwert“???) bei G+ deaktiviert, was geht, lösche als letztes noch die Kekse und werde G+ nicht mehr nutzen. Der Gockel kommt auf die Keks-Blacklist… und gut is‘.\n\nWer mir auf G+ folgt, der kann das gerne auch bei Diaspora* tun ( [pepecyb@pod.geraspora.de](https://pod.geraspora.de/people/8fb1b7f0a544013422ca4860008dbc6c) ), wo ich auch die Infos über neue Artikel hier und der Dampfdruck-Presse (DDP) streue. Außerdem kann jeder, der Infos über die DDP haben möchte, mit dieser auch bei Diaspora* teilen ( [dampfdruck_presse@diasp.eu](https://diasp.eu/people/66f5ba80ae2701325af05404a6b20780) ). Infos gehen so nicht verloren. Auch Friendica werde ich in gleichem Maße nutzen und auch dort kann man mich finden ( [PepeCyB](https://friendika.me4.it/profile/pepecyb/) ). Demnächst wird auch dort ein Forum für die DDP eingerichtet… für alle, die nur diese Informationen möchten.\n\nAnsonsten… niemand muss mich über irgendwelche Messenger von SN anschreiben… ich hab‘ doch auch ’ne Mail-Adresse. Mehls schreiben, wird immer möglich sein.\n\nWer sich nun ganz doll dagegen sträubt, sich bei Diaspora* oder Friendica einzufinden, nur um über neue Inhalte hier oder in der DDP informiert zu bleiben… nun, der trägt sich einfach für den jeweiligen Newsletter ein.\n\nWie man mich erreicht, habe ich ja eh schon einmal hier und da geschrieben…\n\nAlso: Nicht wundern, wenn ich bei G+ nicht mehr in Erscheinung trete."
		},
		{
			"post_id": 5,
			"title": "Lachen: selten und nur noch im Keller",
			"date_published": 1493236943.483,
			"body": "![krebs](img/krebs.jpg)\n\nDer lampukische Krebsforscher und Arzt Julkifaz Mollerapschek, der für die WHO Krebsforschung betreibt, hat in einer großangelegten Studie festgestellt, dass Lachen extrem krebserregend ist. Regelmäßiges Lachen führt unweigerlich zu Zwerchfellkarzinomen, bösartigen Lachfalten-Tumoren und zusätzlich nicht selten zu Morbus Basedow mit ausgeprägter endokriner Orbitopathie bis hin zur kompletten Abstoßung der Tränendrüsen bei Lachanfällen.\n\n![Proptosis_and_lid_retraction_from_Graves_Disease](img/Proptosis_and_lid_retraction_from_Graves_Disease.jpg)\n<div id=\"html-attribution\" style=\"display: block;\"><sup> Jonathan Trobe, M.D. - University of Michigan Kellogg Eye Center, <a href=\"https://commons.wikimedia.org/wiki/File:Proptosis_and_lid_retraction_from_Graves%27_Disease.jpg\" target=\"_blank\">Proptosis and lid retraction from Graves' Disease</a>, <a href=\"https://creativecommons.org/licenses/by/3.0/legalcode\" target=\"_blank\">CC BY 3.0</a> </sup></div>\n\nLachen schadet also der Gesundheit und es wird vermutet, dass mindestens 2/3 sämtlicher tödlich verlaufender Krebserkrankungen entweder von rotem Fleisch, gepökelten oder geräucherten oder gegrillten oder gebratenen Fleischprodukten, dem Konsum von Nikotin oder vom Lachen herrühren. Das restliche Drittel – so vermutet Mollerapschek, der diesbezüglich schon die nächste Studie für die WHO plant – ist auf Sex zurückzuführen.\n\n---\n\nDie WHO wird in naher Zukunft eine Lachempfehlung herausgeben. Nachdem schon die Tagesdosis für Zucker nach unten korrigiert wurde und die Empfehlung für eine Beschränkung des Fleischkonsums bevorsteht, erwägt man, bezüglich des Lachens, einen dem FCTC entsprechenden völkerrechtlichen Vertrag auf den Weg zu bringen, welcher der Eindämmung des Lachens dienen und diese vorantreiben soll.\n\n![smile](img/smile.jpg)\n\nVorerst empfiehlt Mollerapschek, nicht häufiger als einmal wöchentlich für nicht mehr als 23,48 Sekunden zu lachen. Sofern möglich, sollte man zum Lachen dann auch noch in den Keller gehen, weil das dort meist vorherrschende feucht-kühle Raumklima und das Fehlen ausreichender Beleuchtung verhindern kann, spontan die genannten Krebsarten oder die Basedow‘schen Immunerkrankung zu bekommen.\n\n \n\nGottseidank gibt es die Gesundheits-Taliban der WHO, die uns ein Leben ohne Genuss und ohne Spaß bescheren, dass dadurch aber nahezu ewig währt. Lebenswert? Nö… aber wer lange leben will, soll ja auch nix davon haben… das wäre ja noch schöner…"
		},
		{
			"post_id": 4,
			"title": "Danke Axel, danke Springer!",
			"date_published": 1493236109.765,
			"body": "![danke](img/danke.jpg)\n\nHuuups! Da ruft man [BLÖD](http://donotlinkfb.com/dmwc) auf und steht vor heruntergelassenen Jalousien. Und weshalb? Nun, weil man einen pöhsen Adblocker verwendet. Das geht ja mal wirklich nicht. Schließlich sind stets und ständig über 500 hochqualifizierte und seriöse, unabhängige, wahrheitsliebende Journalisten 48 Stunden am Tag unterwegs, um als erste mit Mordopfern Interviews zu führen, die Schurken der Welt bloßzustellen und dem Leser die wirklich echt ehrliche absolute Wahrheit in mundgerechten Happen zu servieren. Und das kostet nunmal Geld, das sich dieses Qualitätsmedium nur über Werbeeinblendungen oder bezahlte Inhalte verschaffen kann.\n\n![bloed](img/bloed.png)\n\n---\n\nJetzt komme ich Arschloch daher und klaue denen quasi ihren wohlverdienten Lohn. Nein… pfui Teufel… was für ein mieser Charakter doch in mir schlummert. Also werde ich ausgesperrt. Aber wenn ich mag, kann ich mich ja erpressen lassen. Entweder ich schalte jefällichst den miesen Blocker aus oder ich zahle künftig dafür, dass ich die WAHRHEIT erfahren darf.\n\nAllerdings haben sie da die Rechnung ohne den Wirt gemacht! Nun kann es mir nämlich nicht mehr passieren, dass ich versehentlich (durch irgend einen unbedachten Klick) auf ihr Schmierblatt gerate und mir den Dreck anschauen muss. Das spart auch Nerven und schon meinen ohnehin empfindlichen Reizmagen. Und deshalb sage ich: „Danke Axel, danke Springer!“\n\nIch bin wirklich nicht auf die „Medien“ dieses Verlagshauses angewiesen, denn ich weiß schon, wo und wie ich mich umfassend informieren kann. Und dazu verwende ich gerne auch unterschiedliche Quellen, über deren Hintergründe ich recherchiert habe und mache mir letztlich mein eigenes Bild(!).\nDer Verlag kann sich also ganz locker mal seine Inhalte da hin stecken, wo die Sonne nie hinscheint.\nWeder lasse ich mich von ihnen dazu bewegen, meinen ihre Seite bei meinem Blocker auf die Whitelist zu setzen, noch werden sie für ihren Dreck auch nur einen Cent oder Forint von mir sehen.\n\nLetztens habe ich auch einen Artikel von einem Blogger gelesen, der alle Nutzer von Adblocking quasi als asoziale Diebe beschimpft hat. Nun, der hat bei mir natürlich auch gewonnen. Dieses Blog ist nicht nur auf der Blacklist von [Disconnect](https://disconnect.me/), sondern auch auf meiner persönlichen Blacklist von Seiten, die ich nicht sehen möchte, gelandet. Klar verstehe ich, dass es Menschen gibt, die ihren Lebensunterhalt (ich schätze sowieso eher nur zum Teil) über Werbeeinnahmen finanzieren. Das ist auch legitim, wenn man nicht, wie ich z. B., seine Inhalte wirklich FREI verfügbar machen möchte. Wenn die Seite dann mit guten und wertvollen Inhalten glänzt… mir also einen Mehrwert bringt, mich unterhält oder informiert… mir Ideen oder Tipps vermittelt… und wenn dann die Werbung noch nicht zu plakativ ist und die Seite zukleistert… nun, dann kommt die Seite selbstverständlich auf die Whitelist. Damit habe ich keine Probleme. Aber ich lasse mich nicht beschimpfen, wenn ich SELBST bestimmen möchte, ob und was ich an Werbung sehen möchte und was und wie nicht. Wenn ich dann künftig ausgesperrt werde, gräme ich mich nicht, sondern sehe es als Befreiung von unnützem Ballast. Wie gesagt… sind mir die Inhalte etwas wert, so werde ich nicht verhindern, dass der Betreiber seine Inhalte über Werbung monetarisiert. Ich bin in solchen Fällen auch gerne bereit, dafür eine angemessene Zahlung zu leisten… WENN es mir der Inhalt wert ist – wie gesagt.\n\nNoch ein Hinweis an Axel und an Springer… wenn ihr schon das Gitter vor Euer Dreckblatt macht, verwendet doch ein anständiges Schloss. Man kann den Mist nämlich sehr wohl auch ohne Werbung schauen. Die Methode zum Aussperren ist mehr als dilettantisch! Einfach Skripte blocken und man kann sich an den bunten Bildern mit flachen Texten weiter ergötzen. Ich nehme die hochgezogene Zugbrücke aber gerne als solche an… danke Axel, danke Springer!"
		},
		{
			"post_id": 3,
			"title": "﻿Immer diese Postkarten…",
			"date_published": 1493235696.391,
			"body": "![postcard](img/postcard.png)\n\n…die im eMail-Eingang landen. Postkarten? Ja, Postkarten! Jede unverschlüsselte Mail ist im Prinzip eine Postkarte… oder wie ein Brief im unverschlossenen Umschlag. Meist sind die Postkarten nicht einmal unterschrieben.\n\nNa ja, fast alle scheinen damit leben zu können, dass es möglich ist, den Inhalt der Mails zu lesen. „Sie haben ja auch nichts zu verbergen und es ist doch auch nicht schlimm, wenn es eigentlich um Belanglosigkeiten geht.“\n\nDas kann man so sehen… ich sehe das aus einer anderen Perspektive. Erstens ist das „Zukleben“ des Umschlags (Verschlüsseln), wenn man es vernünftig eingerichtet hat, nicht aufwändiger, als ein Häkchen zu setzen… und außerdem ist es mir egal, ob ich Belanglosigkeiten oder dunkle Geheimnisse versende. Es HAT niemand mitzulesen! Und ich will auch niemanden die Gelegenheit geben, mitzulesen. Völlig egal, was ich schreibe… das geht trotzdem niemanden was an. Wenn es jeder lesen können soll, kann ich es auch öffentlich in einem SN posten.\n\n---\n\nWas ich aber an der Postkarten-Angelegenheit noch viel belastender finde: Ich bin „gezwungen“, auch Postkarten an diese Empfänger zu schicken. Alles regt sich über die NSA-Affäre auf, schimpft, dass man immer und überall ausgespäht wird… aber keiner macht sich die (wirklich winzige) Mühe, zumindest den eigenen eMail-Verkehr dagegen abzusichern. Wenn es darum geht, eine neue App fürs Smarty zu installieren… na das passiert eher gestern als heute. Ebenso ist es mit Software für den Computer, wenn es um Spielchen oder neue Betriebssystem-Versionen geht (bei letzteren nehmen viele sogar wochenlange Probleme, Konfigurationsorgien etc. in Kauf)… aber einfach schnelle mal GNUpg installieren, ist doch zu viel verlangt. Schade! MIR kann jeder an meine bekannten (und eher unbekannten) eMail-Adressen verschlüsselte Mails senden (so derjenige denn GNUpg installiert hat)… meine öffentlichen Schlüssel können jederzeit vom Keyserver gezogen werden. Sie liegen aber auch hier bereit. Also gar kein Dingeling… alles machbar. Und wenn jemand selbst einen Schlüssel hat und ihn veröffentlicht hat (oder mir zur Not zukommen lässt), dann ist es klar, dass ich meine Mails auch verschlüsselt sende. Und ich unterzeichne (signiere) meine Mails auch gerne.\n\nIst denn der Aufwand groß? Nein, ist er nicht!\n\nWer Windows verwendet, der zieht sich [Gpg4win](http://www.gpg4win.de/), wer einen Apple sein Eigen nennt, greift zu [GPG Tools](https://gpgtools.org/) und wer Linux verwendet, der findet das eh in seiner Distribution… meist auch mit vernünftigen Frontends.\n\nHat man die Software, dann muss man nur noch rasch ein Schlüsselpaar erzeugen und es kann los gehen.\n\nEin paar Worte zum Schlüsselpaar bzw. zum Prinzip der Verschlüsselung mit GNUpg…\nErzeugt man ein sogenanntes Schlüsselpaar, so ist man im Besitz zweier Schlüssel. Der eine ist der geheime Schlüssel. DEN darf man auf keinen Fall weiter geben. Der wird zum Entschlüsseln und signieren gebraucht. Jeder, der ihn hat, kann eine verschlüsselte Mail an den Eigentümer (also den, der ihn erzeugt hat) entschlüsseln. Und er kann im Namen des Eigentümers Mails verschicken und signieren, so dass der Empfänger darauf vertraut, dass die Mail vom Eigentümer kommt. Gerät dieser Schlüssel in fremde Hände, so kann derjenige dann verschlüsselte Mails lesen und auch noch vorgaukeln, er sei der Eigentümer, wenn er Mails damit signiert. Also das Dingen unbedingt gut aufheben und unzugänglich machen.\n\nDer öffentliche Schlüssel hingegen darf und soll weit gestreut werden. Jeder der über diesen verfügt kann nämlich verschlüsselte Mail an den Eigentümer senden und bei Empfang von Mails von diesem Eigentümer überprüfen, ob sie denn wirklich von diesem Stammen und unverändert sind (wenn der die Mail nämlich signiert).\n\nUm seinen Schlüssel möglichst jedem zugänglich zu machen (den öffentlichen natürlich), kann (und sollte) man diesen auf einen öffentlichen Schlüsselserver laden. Damit hat jeder die Möglichkeit, den öffentlichen Schlüssel zu erhalten. Hat derjenige, der ihn sich vom Schlüsselserver geholt hat, seine eMail-Software korrekt für GNUpg eingerichtet, kann er vor dem Versenden einer Mail an den Empfänger (Schlüsseleigentümer) wählen, dass diese verschlüsselt wird. Diese Mail kann dann nur von dem gelesen werden, der in Besitz des passenden geheimen Schlüssels ist. Erhält man eine Mail von dem Schlüsseleigentümer und er hat sie signiert, so kann man (gut eingerichtete vernünftige Mail-Programme machen das automatisch) sehen, ob die Mail wirklich vom angegebenen Absender stammt und dass sie (hoffentlich) inhaltlich nicht verändert wurde.\n\nDie meisten Mail.Programme erlauben dieses Verfahren inzwischen und etliche haben die Funktionalität sehr gut integriert. Mir persönlich gefällt die Integration in Thunderbird besonders gut. Man nutzt dazu die Erweiterung „[Enigmail](https://addons.mozilla.org/de/thunderbird/addon/enigmail/)“ . Diese Erweiterung (als Plugin) kommt mit einer recht komfortablen Schlüsselverwaltung und erlaubt Ver- und Entschlüsseln, Signieren und die Prüfung von Signaturen auf ganz einfache Art und Weise.\n![keys](img/keys.jpg)\nMan kann damit sogar neue Schlüssel erzeugen, Widerrufs-Zertifikate ebenfalls (sollte man bei Schlüsselerzeugung auf jeden Fall machen… damit kann man einen Schlüssel öffentlich als ungültig deklarieren, wenn er in die falschen Hände gefallen ist oder man schlicht das Passwort vergessen hat) und man kann Schlüssel auf einen öffentlichen Schlüsselserver hochladen bzw. von dort welche beziehen (importieren).\n\nInstallation, Schlüsselerzeugung und Nutzung sind heute wirklich extrem einfach geworden… und deshalb verstehe ich nicht, warum alle immer noch „Postkarten“ verschicken und mich dazu nötigen, ebenfalls „Postkarten“ zu versenden. Ich freue mich über jede verschlüsselte Mail, die ich bekomme… und auch über signierte. Den Schlüssel (öffentlichen) schnapp ich mir und danach kann erst einmal keiner in die Korrespondenz schauen.\n\nIch hoffe, dass ich in Zukunft deutlich öfter eMails in verschlossenen Umschlägen bekomme (und solche dann auch versenden kann)."
		},
		{
			"post_id": 2,
			"title": "Ich lebe in einem „Schurkenstaat“",
			"date_published": 1493231702.207,
			"body": "![schurkenstaat](img/schurkenstaat.jpg)\n\n…zumindest könnte ich das Gefühl bekommen. Es ist schon erstaunlich, wie derzeit durch die Presse das Bild vermittelt wird, dass Orbán Viktor ein Schweinehund und sein Land Ungarn die dunkelste Ecke in der ganzen EU ist. Fakt ist leider, dass Ungarn inmitten der Balkanroute liegt, die von vielen Flüchtlingen und Migranten genutzt wird. Weil „die feine Angie“ und ihre Vasallen… und nicht zuletzt die Presse… nun aber eine ausgeprägte „Willkommenskultur“ in Deutschland propagieren, ist es nur logisch, dass sich mehr und mehr Menschen über diese Route in Richtung Deutschland aufmachen. Wer könnte es ihnen verdenken? Und es werden immer mehr. Diese Menschen laufen an der Ungarischen Grenze auf, überwinden sie und sind… schwupps… auf dem Gebiet der EU, wo ja so wohldurchdachte gesetzliche Regelungen existieren, dass das alles völlig ohne Probleme ablaufen muss. Das Dublin Abkommen bestimmt nun, dass die Menschen in dem Land, in welchem sie in der EU ankommen, ihren Asylantrag stellen müssen und dass dieser auch dort bearbeitet wird und sie sich dort so lange aufhalten müssen. Ungarn… aber halt! Nun hat es die Balkanroute an sich, dass ein nicht unbedeutender Teil der Flüchtlinge und Migranten aus den Gebieten Syrien und Umgebung erstmalig in Griechenland den Boden der EU betreten. Und von dort aus geht es dann weiter… bis sie in Ungarn erneut die EU erreichen. Hab ich da jetzt was falsch verstanden? Wenn Dublin nicht ausgesetzt ist (wird ja mal so, mal so propagiert… je nachdem, wie es gerade am besten in die eigene Argumentation passt), dann müsste es bereits in Griechenland greifen. Aber auf die griechische Regierung wird nur wegen der Euro-Krise geschimpft. Das zwar auch in einer Art und Weise, die oft weit über das Erlaubte und noch viel weiter über gute Erziehung hinaus geht… aber zum Verfahren bezüglich der Flüchtlinge wird irgendwie nix gesagt. Braucht ja auch nicht… dafür haben wir ja Orbán und die Ungarn. Ist doch immer gut, wenn man zwei Boxsäcke hat, auf die man einprügeln kann. Noch schöner ist es, dass die ungarische Regierung machen kann, was sie will… es ist IMMER falsch.\n\n---\n\nEs strömen also nicht unbedeutend viele Menschen ins Land. Ungarn hindert sie daran, das Land Richtung Norden („Germany, Germany“) zu verlassen… DAS ist aber mal falsch. Werden Flüchtlinge oder Migranten aufgegriffen, die sich nicht haben registrieren lassen, so wird nach den Gesetzen verfahren und sie werden zunächst inhaftiert. Auch das ist falsch. Rauten-Angie bricht europäisches Recht, indem sie verkündet, für Flüchtlinge aus Syrien würde Dublin „ausgesetzt“… man würde sie in Deutschland aufnehmen, obwohl sie vorher schon in der EU waren (man kann Deutschland eigentlich kaum anders erreichen, es sei denn, man wirft die Menschen aus dem Flugzeug ab oder die Flüchtlingsdampfer schippern zum Hamburger Hafen). Aufgrund der eifrig gerührten Werbetrommel „Alle sind willkommen, wir gewähren Euch Unterschlupf“ ist der Zustrom in den vergangenen Wochen und Monaten aber erheblich angestiegen und viele „Unregistrierte“ haben es nach Budapest geschafft. Die stehen nun vor dem Bahnhof, kaufen sich gar Tickets nach München oder Berlin… der Druck stiegt und der Bahnhofsvorplatz ist nun auch nicht als „Auffanglager“ ausgelegt. Das ist halt ein Platz inmitten der Hauptstadt. Also wird (nicht zuletzt aufgrund der Aussage der Raute) dem steigenden Druck nachgegeben und es wird zugelassen, dass viele der dort aufgelaufenen Flüchtlinge die Züge besteigen und sich auf den Weg in ihre neue Wahlheimat machen. Aber… das war natürlich auch wieder VOLLIG falsch. Und so wird der Transfer wieder unterbunden… was ebenfalls wieder VÖLLIG falsch ist. Egal was geschieht… es ist immer falsch. Das wird dann (zur Ablenkung von anderen Themen) in der Presse fein ausgeschlachtet und mit Vokabeln „der rechtspopulistische Orbán“, „fremdenfeindlich“, „nationalistisch“, „rassistisch“, „rechtskonservativ“ geschmückt und so ein ausgesprochen unangenehmes Klima geschaffen. Die Ungarn (samt Regierung) werden in ein derart schlechtes Licht gerückt, dass ich gar nicht so viel essen kann, wie ich kotzen möchte.\n\nAber die Propaganda trägt Früchte. Wenn über solche Berichte diskutiert wird, finden sich immer mehr Menschen, die ganz klare Vorstellungen davon haben, wie es um Ungarn bestellt ist und wie man mit Ungarn verfahren müsste.\n\nBeispiele gefällig?\n\n_„Dazu gehört auch, dass man Orbán und den Ungarn klar macht, dass ihr jetziges Verhalten nicht tolerierbar ist. Auch Sanktionen gegen die Ungarn könnten dabei helfen.“_\n\n_„Ich glaube, die Ungarn sollten die EU verlassen. Das dort herrschende Gedankengut passt einfach nicht in ein freiheitliches und vereintes Europa des 21. Jahrhunderts. Nicht Viktor Orbán ist das Problem, sondern Ungarn.“_\n\n_„Die Menschen in Ungarn, die allesamt von der EU profitiert haben, wollen heute nicht einmal Kriegsflüchtlinge menschlich behandeln. Wir sollten mit der EU neu beginnen und diese unchristlichen Heuchler ausschließen.“_\n\n_„Ungarn sollte, solange Orban regiert, aus der EU ausgeschlossen werden. Mit so einem Despoten macht sich die EU lächerlich die doch so die Menschenrechte hoch halten. Das ist die Politik gegenüber Diktatoren, die dieses Flüchtlingsproblem erst möglich gemacht hat.“_\n\n_„Inhumanität ist sein Programm.“_\n\n_„Ungarn ist ein zutiefst nationalistischer Staat. Orbán betreibt menschenverachtende Politik. Ein großer Teil der ungarischen Bevölkerung heißt seine Politik gut.\nRassismus, Antisemitismus…\nDemokratische Grundrechte und Werte werden mit Füßen getreten.“_\n\nSolche Kommentare werden, wie gesagt, immer mehr… die Saat ist aufgegangen… die Propaganda greift. Solche Gedanken setzen sich fest. Gerne auch bei Menschen, die noch nie in Ungarn waren und sich nicht einen Hauch mit der Politik, Wirtschaft und Kultur, geschweige denn der Geschichte Ungarns befasst haben. Die Presse und die Politiker sagen es vor und es wird munter nachgeplappert.\n\nDen Vogel hat kürzlich der Grünen-Fraktionsvorsitzende Anton Hofreiter abgeschossen ganz öffentlich… und war in sehr vielen Medien nachzulesen:\n\n>    _+++ Hofreiter: „Herr Orbán ist eine Schande als Regierungschef“ +++\n    Der Grünen-Fraktionsvorsitzende Anton Hofreiter kritisiert die harte Haltung des ungarischen Regierungschefs Viktor Orbán scharf. „Herr Orbán ist eine Schande als Regierungschef für jedes Land, aber er ist eine Schande für Europa, denn er tritt die europäischen Werte mit Füßen“, sagte der Grünen-Politiker im ZDF. „Und es ist grotesk, dass er sich aufs Christentum beruft bei seinen Maßnahmen. Das ist eine Beleidigung für jeden, der gläubig ist.“_\n\nHut ab! Jetzt habe auch ich es begriffen: Ich lebe in einem Schurkenstaat!\n\nNicht falsch verstehen… ich bin wahrlich kein Fan von Orbán. Ich halte ihn für ein durchtriebenes Subjekt, das vor allem auf seinen eigenen Vorteil und den Vorteil seiner nahen Anhänger bedacht ist. Mein Gott, was hat der hier im Lande auch schon Scheiße gebaut… meist zulasten des ungarischen Volkes. Und es handelt sich um planvolles Vorgehen, das erkennt jeder, der sich das mal genauer anschaut. Gerne provoziert er auch die EU, um dann wieder zuhause in besserem Licht dazustehen. Und er macht (meist nur verbale) Zugeständnisse an Parteien, die wirklich am äußersten rechten Rand agieren… und damit an deren Anhänger… das aber weniger, weil er das Gedankengut teilt, sondern, weil er diese Menschen (die ja unabhängig von ihrer Gesinnung… man kann sie ja auch nicht „eliminieren“… auch Ungarn sind) für die nächsten Wahlen zum Zwecke der Machterhaltung abholen will. Das sind Dinge, die mir zutiefst zuwider sind und weswegen ich nicht glücklich darüber bin, dass er mit seinen Genossen hier regiert. Das Problem jedoch ist, dass es keine wählbaren Alternativen gibt. Dadurch wird er Ungarn wohl leider noch eine ganze Zeit erhalten bleiben.\n\nHier werden aber Propagandamittel ausgepackt, die nicht nur den Staatschef diskreditieren, sondern gleich das ganze Volk in Sippenhaft nehmen. Und da läuft mir dann die Galle über.\n\nÜber die Menschen, die hier leben macht sich eh keiner Gedanken. Es mag ja für Deutsche lächerlich klingen, wenn hier an den Grenzen Flüchtlingsströme im fünfstelligen Bereich auflaufen. Aber Ungarn ist jetzt nicht das wohlhabende Land, dass nur mit dem Finger schnippen muss, um diesen Ansturm (für Ungarn ist es das… schaut Euch mal an, wie klein es ist) nach hohen Standards gerecht zu werden. Ich bin sicher, dass es hier jede Menge Menschen gibt, die gerne auch spontane Spendenaktionen mit Sachspenden für die Ankömmlinge organisieren würden… leider kann sich das die Mehrzahl aber nicht erlauben. Wenn man hier als Briefträger in Vollzeit (über 20 Jahre dabei) monatlich mit nicht einmal 250 Euro nach Hause geht, dann ist es schwierig, da noch etwas abzuknapsen. Ich kenne wirklich sehr viele Menschen, die den Winter über frieren, weil sie sich entscheiden müssen, entweder Holz zum Heizen zu kaufen oder was zum Essen. Das ist kein Witz. Sicher geht es den Ungarn meist noch besser, als etlichen Flüchtlingen, aber das Hemd ist einem trotzdem immer noch näher als die Hose. Und nun komm‘ mir keiner mit St. Martin oder dem barmherzigen Samariter… das sind weltfremde Utopien.\n\nDeutschland ruft: „Kommt alle her!“ Die Hoffnungsvollen (die auch noch über das Kapital verfügen, sich die Tour zu erlauben… die wirklich Ärmsten der Armen bleiben hängen, sobald sie das Kriegsgebiet verlassen haben und leben da absolut beschissen) machen sich auf den Weg und dann sollen sie in einem Land bleiben, dass die Massen nicht stemmen kann (gerne wird dann wieder angeführt, dass Ungarn ja so viel Kohle aus der EU erhalte… ja klar… das wird in die Schaffung und Erhaltung der Infrastruktur gesteckt… und das wirklich… das kann man selbst mit halb geschlossenen Augen hierzulande sehen). Nun, dann beschimpft man die, die sich das nicht ausgesucht haben… Sie werden beschimpft, weil sie die Schengen-Außengrenzen sichern (Zaun), wie es ihre Pflicht ist, man beschimpft sie, wenn sie die Flüchtlinge einfach weiterlotsen und man beschimpft sie, wenn man sie rechtskonform doch nicht weiter strömen lässt. Damit hat man einen Boxsack… ist doch prima… lenkt klasse von zahlreichen massiven eigenen Fehlern ab. Dass damit die Ungarn an sich in Misskredit gebracht werden… na, das nimmt man so hin… schadet ja nix… ist eh weit genug weg… und unbedeutend sind sie auch… wo gehobelt wird, da fallen Späne… ab und zu muss man halt ein Bauernopfer bringen…؟\n\nAlso lebe ich in einem Schurkenstaat… und das ist auch gut so!"
		},
		{
			"post_id": 1,
			"title": "Willkommen in PepeCyB’s Welt!",
			"date_published": 1433033779.604,
			"body": "![willkommen](img/willkommen.jpg)\n\nMeeensch, die Welt braucht doch nicht noch ein Blog. Nein, braucht sie nicht. Aber es schadet auch nichts, selbst wenn keiner liest, was ich hier zum Besten gebe. Meine [Dampfdruck-Presse](http://127.0.0.1:43110/15NETkTzVm3Pi9re24HsKgAuDBdS5ZBXwB/) ist die Dampfdruck-Presse und bleibt die Dampfdruck-Presse (DDP)… das ist da, wo ich über‘s Dampfen schreibe. Und über alles, was da so mit dran hängt. Aber es soll halt die DAMPFdruck-Presse bleiben.\n\nNun hat es sich ergeben, dass in den letzten Wochen einige Artikel dazu gekommen sind, die zwar irgendwo aus meinem Hobby, dem Dampfen, hervorgegangen sind und auch ein paar Berührungspunkte zu dem Gebiet haben, es aber doch Artikel waren, die sich ein wenig mit dem eigentlichen Themenschwerpunkt gerieben haben.\n\nUnd so gibt es jetzt „PepeCyB’s Welt“! (Nicht über das Apostroph zwischen „B“ und „S“ stolpern… das braucht es da nicht und ist eigentlich falsch, aber „CyBs“ sieht einfach be…scheiden aus…)\n\nUnd es gibt noch etliche andere Themen, über die ich gerne ab und an (oder öfter?) schreiben möchte, die aber nun wirklich nichts mit der Dampferei zu tun haben. Die auch noch in die DDP zu packen, würde sie einfach zu weit vom eigentlichen Thema wegbringen. Worüber ich schreiben werde? Nun, das wird sich finden… recht schnell. Interessensgebiete habe ich mehr als genug. Also lasst Euch überraschen, schaut ab und an mal herein oder auch nicht…"
		}
	],
	"tag": [
		{
			"value": "Allgemein",
			"post_id": 1
		},
		{
			"value": "Ungarn",
			"post_id": 2
		},
		{
			"value": "Verschlüsselung",
			"post_id": 3
		},
		{
			"value": "Sicherheit",
			"post_id": 3
		},
		{
			"value": "Medien",
			"post_id": 4
		},
		{
			"value": "WHO",
			"post_id": 5
		},
		{
			"value": "Soziales_Netzwerk",
			"post_id": 6
		},
		{
			"value": "Google+",
			"post_id": 6
		},
		{
			"value": "Politik",
			"post_id": 7
		},
		{
			"value": "Politik",
			"post_id": 8
		},
		{
			"value": "Meinung",
			"post_id": 9
		},
		{
			"value": "Linux",
			"post_id": 10
		},
		{
			"value": "Shell",
			"post_id": 10
		},
		{
			"value": "Kommentar",
			"post_id": 11
		},
		{
			"value": "Meinung",
			"post_id": 12
		},
		{
			"value": "DDE",
			"post_id": 13
		},
		{
			"value": "Deepin",
			"post_id": 13
		},
		{
			"value": "Desktop",
			"post_id": 13
		},
		{
			"value": "Firefox",
			"post_id": 14
		},
		{
			"value": "CLIQZ",
			"post_id": 14
		},
		{
			"value": "GPG",
			"post_id": 15
		},
		{
			"value": "Verschlüsselung",
			"post_id": 15
		},
		{
			"value": "Javascript",
			"post_id": 16
		},
		{
			"value": "uMatrix",
			"post_id": 16
		},
		{
			"value": "Facebook",
			"post_id": 17
		},
		{
			"value": "Diaspora",
			"post_id": 17
		},
		{
			"value": "Hubzilla",
			"post_id": 17
		},
		{
			"value": "GNUsocial",
			"post_id": 17
		},
		{
			"value": "Mastodon",
			"post_id": 17
		},
		{
			"value": "dezentral",
			"post_id": 18
		},
		{
			"value": "P2P",
			"post_id": 18
		},
		{
			"value": "ZeroNet",
			"post_id": 18
		},
		{
			"value": "ZeroNet",
			"post_id": 19
		},
		{
			"value": "dezentral",
			"post_id": 19
		},
		{
			"value": "ZeroNet",
			"post_id": 20
		},
		{
			"value": "Tor",
			"post_id": 20
		},
		{
			"value": "ZeroNet",
			"post_id": 21
		},
		{
			"value": "Einstieg",
			"post_id": 21
		},
		{
			"value": "ZeroNet",
			"post_id": 22
		},
		{
			"value": "Grundlagen",
			"post_id": 22
		},
		{
			"value": "Internet",
			"post_id": 23
		},
		{
			"value": "Internet",
			"post_id": 24
		},
		{
			"value": "Internet",
			"post_id": 25
		},
		{
			"value": "Internet",
			"post_id": 26
		}
	]
}