{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Voy a preparame por si tuviera que huir de España en cualquier momento",
			"body": "Así és, nunca se sabe cuando vamos a tener que uir de este país por lo que sea, pueden pasar cientos de cosas, lo primero que voy a hacer es meter una parte de mi sueldo en bitcoins, en cartera fisica controlada por mí, cuando vaya ahorrando compraré DNI falso de españa  y pasaporte falso para en principio escapar, y id falso de otro país aún por determinar, en la dark web los venden, despues seguiré ahorrando para en cualquier momento poder irme, la cuenta de bitcoin siempre irá conmigo, y una vez en el pais donde haya creado mi id nueva abriré cuenta con la documentación falsa y podré ir pasando bitcoins que seguramente haya ya pasado a otra moneda mas anonima tipo zcash o monero, estudiaré cual de las 2 es mas estable, el plan está aún en pañales, por eso lo pongo aquí, acepto sugerencias, no voy a contar porque pero en particular en mi caso es mas probable que el caso de huida sea necesario en un futuro.",
			"added": 1525689786
		},
		{
			"topic_id": 2,
			"title": "podemos irnos a este foro consolidado en la DW",
			"body": "http://s6cco2jylmxqcdeh.onion/w/\n\npara registrarse hace falta un email torbox  http://torbox3uiot6wchz.onion que luego podemos usar para otras paginas en la deep web, que opinais?",
			"added": 1526124865
		}
	],
	"topic_vote": {
		"1_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": [
			{
				"comment_id": 1,
				"body": "No estoy hablando de irme a un pais mejor, simplemente de tener un plan de contingencia y fondos para huir cuando me haga falta sin dejar rastro",
				"added": 1525704786
			},
			{
				"comment_id": 2,
				"body": "> [pq9p](#comment_9_141t775YRGcErzqqn4dwUyUQqZrjhdnN3n): ● bitcoins....   No es mas seguro una cuenta en un paraiso? Vale vas a tener que viajar pero va a ser mas estable que bitcoins... tambien puedes hacer las dos cosas● pasaportes. Mira en perú, allí hacen certificados de universidad y dnis seguro por 700 ñapos (euros!) O en tailandia. No es aconsejable seguir por aqui, pero si lo haces vete a las canarias. Desde allí podrías escapar a las Azores portuguesas.. de alguna forma. En la darkcueva ni mires, lo mejor es el trato personal.● En serio dejate de monedas● Idea: Crea tu una nueva identidad. Suplanta la identidad de algun niño vietnamita o congoleño para que sea facil sobornar al colegio o lo que sea y ve abriendote paso en la sociedad.\n\ngracias por tus consejos, aunque no compre en la dark, si que tengo que buscar ahí a alguien que los haga personalmente",
				"added": 1525765130
			},
			{
				"comment_id": 3,
				"body": "> [zero900](#comment_10_1PgEenXoGTDU9urEFYJSsxH8wkbvy3UyVH): Id aportando ideas. Siempre hay que tener un plan B. Quedan 2 siestas para campos de concentración masculinos. Al tiempo.\n\nesa és la idea de este post que la gente aporte ideas, yo a medio plazo quiero tener cubierta una posible huida, tenerlo todo preparado, si no se dá, de viejo siempre puedo recuperar lo ahorrado",
				"added": 1525765275
			}
		],
		"4_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 4,
				"body": "te lo pone al cambiar a tor\nTor always mode enabled, please restart your ZeroNet to make it work.\nFor your privacy switch to Tor browser and start a new profile by renaming the data directory.\nte viene a decir que cambies de identidad",
				"added": 1525770322
			}
		],
		"2_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": [
			{
				"comment_id": 5,
				"body": "> [ciudadanozero](#comment_35_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP): es bastante buen foro la verdad, lo unico prohibido como es logico el CP\n\neso no debe ser problema, y es un foro estable, yo hace mas de 5 años que lo visito, ha cambiado de dirección onin 3 veces pero se mantiene",
				"added": 1526194171
			}
		],
		"3_12wH9Vw9gydwdHWQVRP1iZFpy9YyidBoHP": [
			{
				"comment_id": 6,
				"body": "+1",
				"added": 1527239542
			}
		]
	},
	"comment_vote": {}
}