{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1565530789_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "If on windows, stop the zeronet service (task manager - processes) and cut/paste the folder onto an external harddrive. Twould be nice to also have that hard drive encrypted.\n\nOr just purchase a larger drive (preferably SSD) and clone your whole current system to the new disk via SATA or USB adapter. Instructions are all over the web to do these tasks and the new disks even come with free software downloads. All you really need is a new disk and cable or available interfaces.",
				"added": 1565531873
			},
			{
				"comment_id": 2,
				"body": "I think we should be keeping these installations on external disks so they're easy to swap around, copy, clone and move to larger disks.",
				"added": 1565531946
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 3,
				"body": "We give out straight jackets to those types here.",
				"added": 1565629057
			}
		],
		"1565629267_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 4,
				"body": "TOR browser is not included in the bundle, which seems like a mistake. TOR browser settings must be modified to not proxy on local IP 127.0.0.1\n \nTOR browser is a necessary addition in case a zeronet zite links to a tracker server (like an image an en email that dials home and tells the sender you viewed it) outside the network which could leak your actual IP.\n\nYour IP will be sending encrypted zeronet data to other torrent nodes but not necessarily leaking your IP elsewhere unless you don't use TOR and your browser connects out on the clearnet.\n\nPages are downloaded and cached locally, starting on first visit. Subsequent visits should be faster than the net can allow, assuming they up to date.",
				"added": 1565629584
			},
			{
				"comment_id": 5,
				"body": "> [bvcfbfbcbcvd](#comment_7_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): \"The pages are stored on your harddrive.\" But all the sites in the ZeroNet can't be downloaded by every node/client? Surely you must only mean ones I have \"chosen to host\" or accessed recently?\n\nCorrect. Only zites you visit or choose to host are downloaded and stored.",
				"added": 1565629656
			},
			{
				"comment_id": 6,
				"body": "> [bvcfbfbcbcvd](#comment_6_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): This is a very alarming quote from the FAQ: \"Is ZeroNet anonymous? It's no more anonymous than BitTorrent, but privacy (the possibility to find out who is the owner of the comment/site) will increase as the network and the sites gains more peers.\" I'm very confused about this.\n\nThey can see you are transferring bittorrent data but not what you are posting via said encrypted data.",
				"added": 1565629703
			}
		],
		"1566395604_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 7,
				"body": "bad parenting and even worse governing by nanny state uncle sam",
				"added": 1566398390
			}
		]
	},
	"comment_vote": {
		"12_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU": 1,
		"1_12KbcTzaEjQyNsWtKV7JSXyE8eJNRuj8EP": 1,
		"55_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1
	}
}