{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1621674323,
			"title": "Irlandia.Ransomware (Conti)",
			"body": "Irlandia.\nRansomware (Conti)  uderzył w piątek (14.05.2021r.)\n\nWiele szpitali oraz klinik zaraportowało w piątek, że utraciło dostęp do swoich systemów IT (dostępy do danych pacjentów, informacje o zaplanowanych wizytach, czy dostęp do e-maili). W pewnych przypadkach musiano anulować większość wizyt, które nie były pilne.\n.\nMany hospitals and clinics reported on Friday they had lost access to their computer systems — suddenly shut out of patients' records, appointment booking and email systems — prompting some to cancel most non-urgent appointments\n.\nReuters donosi o wykorzystaniu przez ransomware luki 0-day. Wspomina również, że część systemów wyłączono z obawy przed gwałtownym rozpowszechnieniem się ransoma.\nOficjalne oświadczenie wygląda tak:\n.\nThere is a significant ransomware attack on the HSE IT systems. We have taken the precaution of shutting down all our our IT systems in order to protect them from this attack and to allow us fully assess the situation with our own security partners\n\n\n*W systemach informatycznych HSE dochodzi do znaczącego ataku ransomware. Podjęliśmy środki ostrożności, aby wyłączyć wszystkie nasze systemy informatyczne, aby chronić je przed tym atakiem i umożliwić nam pełną ocenę sytuacji z naszymi partnerami w zakresie bezpieczeństwa*\n.\nOd akcji minęło już kilka dni, jednak cały czas nie udało się uporać z incydentem…\nCzęść systemów nie działa „bo ransomware”, część systemów została ręcznie wyłączona z obawy przed infekcją. W wielu szpitalach przełożono planowane zabiegi. Z kolei szantażyści zażądali kwoty ~$20 000 000.\nWg „przechwałek” atakujący buszowali w sieci przeszło 2 tygodnie, podczas których udało się wykraść ponad 700 GB danych, a finalnie zaszyfrować część infrastruktury:\n.\nKomentarz;\nGreg\n19 maja, 2021 | 6:43 pm\nPodobno mieli Windowsy XP.",
			"added": 1621674322
		},
		{
			"topic_id": 1622041028,
			"title": "TO TYLKO JESZCZE JEDEN KONIEC ŚWIATA.",
			"body": "-TO TYLKO JESZCZE JEDEN KONIEC ŚWIATA-\n.\nZa nami szesnaście miesięcy istnego pogromu mitów. Podejrzewam, że perspektywa wielu z Was mocno się w tym czasie zmieniła, a nastawienie do historii, polityki, mediów i powszechnie obowiązującej wiedzy przeszło gruntowną weryfikację.\nNiemal wszystko, w co wierzyliśmy, okazało się iluzją – pustym, nic nieznaczącym frazesem. Pozornie bezpieczny, przewidywalny i w miarę stabilny świat rozsypał się jak suche liście. Wolność, która miała stanowić filar funkcjonowania zachodniego świata, nie istnieje. Ze zróżnicowanej, ale pięknie rozwijającej się populacji, staliśmy się cywilizacją zombie – zbieraniną przestraszonych i zdezorientowanych żywych trupów.\nKończy się świat, jaki znamy. Obudziliśmy się w rzeczywistości, w której prawdziwa medycyna, prawdziwa nauka, logiczne myślenie, zdrowy rozsądek i szeroko rozumiana normalność nie są już brane pod uwagę. Okazało się, że nasza cywilizacja ma w swojej naturze głęboko zakorzenioną skłonność do tyranii. Zarówno pierwsza, jak i druga rzecz, absolutnie mnie szokuje i zasmuca.\nJest 2021 rok, a ludzkość zachowuje się tak, jakbyśmy mieli rok 1921. Zdeptano z ziemią elementarną wiedzę z zakresu mikrobiologii i fizjologii – to, jak działa system odpornościowy, czym jest oddychanie, czym jest powietrze, jak niebezpieczne jest wdychanie własnego dwutlenku węgla, co powoduje astmę i grzybicę płucną, co uruchamia procesy rakowe komórek mózgowych.\nJednym ruchem pogrzebano również rolę psychiki w prawidłowym funkcjonowaniu ludzkiego organizmu i utrzymywania odporności. Choć kraje o diametralnie innej strategii epidemicznej udowadniają, że zasłanianie ust i nosa kawałkami materiału nie ma kompletnie żadnego znaczenia w ograniczaniu liczby zakażeń, elity rządzące większości państw wciąż zmuszają do tego swoich poddanych.\nCzekają nas trudne lata brutalnej zmiany ustrojowej. To jest dopiero początek resetu, jesteśmy na przedsionku zmian, dlatego tak ważne jest teraz dbanie o własną kondycję fizyczną i psychiczną. Rozsądnie dysponuj własną energią, bo będzie Ci potrzebna, jak nigdy wcześniej.\nFESTIWAL ABSURDÓW\nPewnie wielu z Was uzna teraz, że odleciałem jak etatowy foliarz, ale ja nie wierzę w istnienie tego wirusa. Uważam, że gdyby istniał, dawno zostałby wyizolowany, czyli fizycznie oddzielony od reszty materiału genetycznego i pokazany niedowiarkom jako niezbity dowód swojej prawdziwości. Do dziś nic takiego się nie stało, a masońska wikipedia pokazuje jedynie zdjęcia jakiegoś golonawirusa, tylko jakiego? Tych jest przecież kilkadziesiąt.\nWielu niezależnych, niesprzedanych Big Pharmie naukowców i lekarzy twierdzi, iż nie ma podstaw do uznania nowej choroby na świecie. W 2018 roku przechodziłem bardzo ostrą grypę, przy której dobry tydzień nie czułem smaku jedzenia, a po zejściu 39-stopniowej gorączki dochodziłem do siebie jeszcze kilka tygodni, dusząc się i kaszląc tak, jakbym miał wypluć własne płuca. To znaczy, że nie tylko legendarny ZARZ-KOW2 powoduje ciężkie i nietypowe symptomy kliniczne.\nPodejrzewam, że ogromną rolę w „odczuwaniu objawów” tzw. kowala-19 odgrywa również serwowana od szesnastu miesięcy psychoza. Ludzka podświadomość potrafi sprawić, że człowiek poczuje niemal wszystko. Gdy Orson Welles w 1938 roku czytał słynną „Wojnę Światów”, Amerykanie wybiegali z domów, bo dosłownie czuli swąd spalenizny. Taki mechanizm jest bardzo dobrze znany podczas badań nad lekami, kiedy jednej grupie pacjentów podaje się środek aktywny, a drugiej placebo. Bardzo często obie grupy uzyskują takie same wyniki poprawy lub pogorszenia stanu zdrowia. Psyche zawsze rządziła somą, bo wszystko dzieje się w głowie.\nNawet jeśli ten wirus istnieje, to nadal nie wiemy, czy to on stoi za przyczyną objawów. Infekcje górnych i dolnych dróg oddechowych wywołuje ponad dwieście różnych wirusów. Jednak współczesna medycyna nie dysponuje narzędziami pozwalającymi określać, który z nich dokonuje spustoszenia w organizmie. Diagnozowanie chorób zakaźnych jest jedną z najtrudniejszych rzeczy w medycynie. Tymczasem obecny świat przypomina miejsce zbrodni, w którym widnieje cała masa odcisków palców, ale śledczy już po kwadransie wiedzą, kto zabił. Absurd, śmieszność, niedorzeczność.\nPrzypominam, że od lat w każdym sezonie grypowym w Polsce notowano kilka milionów zachorowań na grypę. Dziwnym zbiegiem okoliczności w minionym sezonie zarejestrowano jedynie półtora miliona przypadków, za to przybyło 2 miliony 800 tysięcy zachorowań na kowala-19. Grypa znika, a w jej miejsce ląduje kowal, czysta magia. Oczywiście najmocniejszym argumentem wszystkich wyznawców nowej religii jest to, że na grypę umiera zaledwie sto osób rocznie, a na kowala już ponad 70 tysięcy. Ci ludzie nie rozumieją, że liczby te wynikają z bezczelnej podmiany modelu statystycznego. Dotychczas, gdy infekcja pomogła komuś przenieść się na tamten świat, to w karcie zgonu wpisywano chorobę przewlekłą jako przyczynę śmierci, a nie infekcję. Od półtora roku natomiast przyczyną zgonu zawsze jest kowal-19.\nStrona ‚Our World In Data’ podaje, że jeszcze w 2017 roku dwa i pół miliona ludzi na świecie zmarło z powodu infekcji dolnych dróg oddechowych. Oficjalnie na kowala umarło trzy i pół miliona, ale wiemy już w jaki sposób uzyskano te liczby. Czy widzicie już, jak to wszystko jest zrobione? Ludzie od zawsze umierali na infekcje dolnych dróg oddechowych, do 2000 roku około trzy miliony w każdym sezonie grypowym. Moim skromnym zdaniem wszystko, co obserwujemy, jest mieszaniną rządowej propagandy i medialnego prania mózgów. Nie dzieje się nic, co nie działo się w poprzednich latach, a rzeczy cykliczne i naturalne, jak infekcje, zapalenia płuc i ostre odmiany grypy są uznawane za nową, straszliwą chorobę, jakiej nigdy wcześniej nie było.\nPATOLOGICZNA NATURA CYWILIZACJI\nDla mnie, jako osoby uznającej wolność za wartość nadrzędną, ewidentna tendencja rasy ludzkiej do budowania kolejnych totalitaryzmów jest przerażająca. Wydawało się, że koszmary XX wieku zostawiliśmy dawno za sobą, że takie rzeczy jak faszyzm, nazizm, rasizm i komunizm są wyłącznie odległymi wspomnieniami.\nOkazało się jednak, że terror ustrojowy to nie ospa czy inna choroba wieku dziecięcego, którą można sobie odhaczyć po jednokrotnym przechorowaniu. Obecny świat jest ponurym dowodem tego, że nasza cywilizacja ma w swoim DNA naturalną predyspozycję do tyranii, do bezwzględnego zniewalania ludzi. Dzieje się tak dlatego, że rządzący światem system jest de facto ciągle taki sam jak dawniej, jego mechanizmy są niezmienne i jeśli pojawi się sposobność, maszyna niechybnie z niej skorzysta.\nNiestety instalowanie lęku jako narzędzia kontroli społecznej jest nadal bardzo aktualne. Strażników obozowych zawsze jest zbyt mało, dlatego system musi jakoś sprawić, by obywatele kontrolowali się sami. Tak było przy narodzinach każdego ustroju totalitarnego. Strach jest najpotężniejszym narzędziem inżynierii społecznej, jakie kiedykolwiek istniało. Nie ma i nigdy nie będzie skuteczniejszej metody kontroli niż odwoływanie się do pierwotnych instynktów, bo w zdecydowanej mierze nadal jesteśmy zwierzętami.\nChyba wszyscy zdążyli również zdać już sobie sprawę, że instytucja wyborów w świecie demokracji parlamentarnej nie ma kompletnie żadnego znaczenia, bo o wszystkim i tak decyduje międzynarodowy system finansowy. Państwami nie rządzą politycy, bo oni nie mają własnych pieniędzy, są tylko pośrednikami między bankiem centralnym a społeczeństwem.\nNatomiast „lekarze”, którzy składali przysięgę Hipokratesa, okazali się bezwzględnymi najemnikami korporacji farmaceutycznej i zwykłymi nierobami, a „naukowcy” i „eksperci rządowi” bezwstydnie kłamiącymi kelnerami aparatu ucisku.\nDożyliśmy czasów, w których nie możemy już ufać naszym liderom, i nie mam tu na myśli wyłącznie ministrów, posłów, premierów i prezydentów – mam na myśli całe zaplecze elit rządzących, w tym przedstawicieli świata nauki, mediów, biznesu i medycyny.\nPolitycy, urzędnicy wyższego i niższego szczebla, „dziennikarze”, „eksperci rządowi”, „ekonomiści”, „lekarze”, „naukowcy”, celebryci – wszyscy kłamią, bo wszyscy już dawno zostali kupieni albo po prostu boją się mówić prawdę, gdyż ta naraziłaby ich na ostracyzm własnego środowiska. Stopnień fałszu i powszechnego zakłamania jest tak potworny, że będzie nam bardzo trudno się z tego wygrzebać. Obecny świat przypomina wielopoziomową zabawę w głuchy telefon, przebywamy w gabinecie luster.\nNOWY PORZĄDEK ŚWIATA\nJesteśmy świadkami ogólnoświatowej walki ze złem. Na naszych oczach odbywa się globalny zamach stanu. Stawką w grze jest wolność, normalność, zdrowie i nietykalność cielesna. Obecny rząd skazał na śmierć ponad sto tysięcy Polaków, odbierając im prawo do opieki zdrowotnej, za którą zapłacili własną krwawicą. Odarto ich z godności i porzucono jak bezdomne psy.\nW szpitalach i DPS-ach trwa masowa eutanazja, a w telewizorach pranie mózgu na poziomie propagandy Korei Północnej. Politycy paradują z groteskowymi szmatami na obłudnych gębach, oficjalnie uczestnicząc w jakimś zboczonym masońskim obrządku, a celebryci pokroju Musiała, Lindy, Pazury czy Kubicy wypinają dla nich tyłki i liczą pieniądze za swoje usługi.\nNa całym świecie od eksperymentalnej substancji umierają setki tysięcy ludzi, ale prawdziwy rozmiar śmierci, kalectwa i bezpłodności ukaże się dopiero za kilka lat, kiedy poznamy długofalowe efekty tej trucizny.\nW tej chwili Biden, Merkel, Macron, Pinokio i reszta globalistycznych marionetek poluzowują więzy, łaskawie pozwalając Wam oddychać na ulicy. Nie dajcie się na to nabrać, to nie jest żadna zmiana docelowa, to klasyczny krok wstecz, dawno przewidziane wytchnienie wakacyjne. Właśnie tak wprowadza się zmiany systemowe, na jesień wszystko wróci do „normy”.\nNiech nikt się nie łudzi, że ta operacja samoistnie się zakończy. Rozpoczęło się modelowanie nowego porządku świata i tego procesu nikt już nie zatrzyma. Nie przyjdzie nas ocalić żaden Trump, ani inny fałszywy mesjasz, tylko my sami możemy to zrobić. Ludzie będą musieli jednak odwołać się do pierwotnych instynktów, do drzemiących w nich pokładów siły, po które musiały dawniej sięgać poprzednie pokolenia również postawione pod ścianą. Tu nie będzie taryfy ulgowej czy jakiejś drogi na skróty, nikt za nas tego nie zrobi.\nW obecnej sytuacji widzę wyłącznie dwie możliwości – powolną zagładę cywilizacji (upadek klasy średniej, korporacjonizm, szczepionkowy terror i pełzający totalitaryzm) albo wojnę. Z każdym miesiącem nabieram bowiem przeświadczenia, że ostatecznie nie obędzie się bez konfrontacji bezpośredniej, dosłownej, fizycznej. To nie stanie się jutro czy za miesiąc, ale wcześniej czy później do tego dojdzie i warto już teraz zacząć się do tego przygotowywać.\nObecna sytuacja jest poważniejsza niż jakakolwiek wojna konwencjonalna, dlatego że swoim zasięgiem obejmuje każdego i przenicowuje wszystkie dziedziny życia. Po raz pierwszy w historii źródłem zła nie jest jedno określone państwo, partia czy organizacja terrorystyczna. Źródłem zła są globalne elity finansowe, centralni bankierzy, media i korporacje. Przez kilkadziesiąt ostatnich lat oplatali nas pajęczą siecią, aż nagle postanowili wyjść z cienia. Rzucili świat na kolana rękami usługującym im polityków i „dziennikarzy”, których jedynym zadaniem jest indoktrynowanie i podsycanie strachu. To sprawia, że linia frontu jest wszędzie, a od strefy wojennej nie da się uciec.\nŚwiat będzie podzielony na dwie równe części. Wyznawcy nowej normalności nie pozwolą na to, by ludzie starej cywilizacji się nie podporządkowali, bo w ich oczach są zagrożeniem. Oni wybrali maski, dystans, szczeżuje i paszporty kowalowe. Dobrowolnie dali się zaprowadzić do obozu, bo tylko tam czują się bezpiecznie.\nCO DALEJ?\nKonia z rzędem temu, kto potrafi przewidzieć, jak to wszystko dalej się potoczy, ponieważ zawsze gdzieś po drodze pojawiają się nowe czynniki. Moim skromnym zdaniem w ciągu najbliższych kilku lat banki centralne wprowadzą CBDC i przejmą rolę mniejszych banków komercyjnych, które przy walucie cyfrowej przestaną być potrzebne i upadną. Do 2030 roku świat przejdzie na energię odnawialną, a gotówka zostanie wycofana. Połowa ludzkości się zaszczeżuje, a reszta będzie do tego przymuszana. Większość państw (w tym Polska) wprowadzi certyfikaty odporności, bez których nie będzie się dało normalnie funkcjonować w społeczeństwie, w zasadzie już się to dzieje.\nOsoby nieostemplowane nie dostaną paszportów, więc nie kupią wejściówki na samolot, a później biletu na pociąg czy autobus. Bez certyfikatu nie będzie się dało wejść do szkoły, urzędu czy szpitala. Nie będzie można zarejestrować się na zabieg, a potem wręcz fizyczne wkroczyć do sklepu czy przychodni lekarskiej. Ostatecznie rząd zamrozi antyszczeżujowcom wypłatę emerytur.\nNieostemplowana budżetówka nie dostanie wypłat, a sektor prywatny będzie przymuszany do szczeżuj w każdy możliwy sposób. Być może ktoś mi powie, że to absurdalne i niemożliwe. Cóż, to samo mówiło się o holokauście w nazistowskich Niemczech lat trzydziestych. Przypominam, że Hitler doszedł do władzy w 1933, a wojna wybuchła dopiero sześć lat później. Każdy totalitaryzm przypomina ciężkie, stalowe koło zamachowe – powoli się rozkręca, ale kiedy już to zrobi, bardzo trudno je zatrzymać.\nPodejrzewam, że po wejściu w życie CBDC rząd założy wszystkim niezależne konta bankowe wprost od banku centralnego, czyli w naszym przypadku NBP. Każdy dostanie jakieś pieniądze, z których będzie mógł korzystać, ale oczywiście pod warunkiem szczypnięcia się. Od samego początku bowiem taki właśnie był cel tej operacji – reset gospodarczy, eliminacja klasy średniej, wycofanie gotówki, wprowadzenie CBDC i ostemplowanie stada. Wszyscy mają być podpięci do systemu i kontrolowani 24/7, wszyscy mają być zabankowani, bez względu na to, czy ktoś tego chce czy nie. Oczywiście stemplować się będzie trzeba co roku – nie po to takim wysiłkiem budują neofaszystowskie państwo, by przepustki obozowe rozdawać bez daty ważności. To będzie kontrola ludzkości par excellence.\nTO NIE SĄ ĆWICZENIA\nOdnoszę wrażenie, że większość społeczeństwa nadal nie zdaje sobie sprawy, w jak poważnej sytuacji się znaleźliśmy i że zmiana systemowa dokona się tak czy inaczej. Centralni bankierzy musieli to zrobić, bo w przeciwnym razie system rozleciałby się jak domek z kart. Istota problemu tkwi w tym, że nie mamy alternatywy płatniczej. Żeby ludzkość mogła się wyzwolić z tego cyrku, musiałby powstać nowy, rasowy, niezależny od banków centralnych system walutowy, a to się raczej nie wydarzy za naszego życia. Ewentualnie możemy przenieść się do lasu i tam budować świat alternatywny. Pytanie, czy neofaszystowski rząd pozwoli swoim obywatelom tworzyć społeczności poza systemem.\nJeszcze raz wzywam wszystkich moich rodaków do obywatelskiego nieposłuszeństwa wobec władzy, która stała się jawną tyranią. Nie pozwólcie na to, by rządzący krajem psychopaci przejęli całkowitą kontrolę nad waszym życiem. Trzeba zatrzymać to szaleństwo, bo żyjemy w niewoli, a z każdym rokiem będzie gorzej. To już nie jest moje ani twoje państwo, to jest nasz wróg. Kraj jest pod okupacją.\nKiedy władza działa wbrew podstawowym prawom obywatela (ziemskim i boskim), suweren ma pełne moralne prawo wypowiedzieć takiej władzy posłuszeństwo. To jest wręcz jego obywatelski obowiązek. Jesteśmy dumnym narodem. Nasi przodkowie oddawali życie za to, byśmy mogli cieszyć się wolnością. Nie możemy pozwolić na to, by ich poświęcenie poszło na marne.\n.\nKomentarz...\n. Przypadkowo znaleziony artykuł godny uwagi dotyczący nas wszystkich bez względu na podziały\nPo mimo jego długości wierzę że zawartość treści w pełni zrekompensuje czas jego czytania.\n.\nPozdrawiam.",
			"added": 1622041026
		},
		{
			"topic_id": 1622418520,
			"title": "Dr. Jens Bengen - Zamordowany.",
			"body": "Dr.  Zamordowany.\n.\nDr. Jens Bengen –  zamordowany…?\nW Dojczlandii coraz szerzej mówi się o nagłym zgonie dra Jensa Bengena w dniu 26 maja 2021. Oficjalnie odebrał sobie życie. Informacja ta pochodzi m.in. od jego brata, który oświadczył: mój brat poległ w korona-wojnie przeciwko ludzkości.\nDr Jens Bengen należał do grona pierwszych lekarzy w Dojczlandii, którzy demaskowali oszustwo rzekomej „pandemii” świrusa. Zasłynął latem ubiegłego roku wydawaniem atestów zwalniających z przymusu noszenia namordników: założył nawet w tym celu stronę internetową, z której można było ściągnąć i wydrukować sobie podpisany przez niego atest, w którym wystarczyło tylko wstawić własne imię i nazwisko oraz adres. Za te atesty był wściekle atakowany przez łże-media, polityczne marionetki i posłuszną światowej lichwie izbę lekarską. Jego atesty okrzyczano jako „nielegalne” i były ścigane przez policję:\nhttps://www.haller-kreisblatt.de/region/22846755_Polizei-warnt-Masken-Muffel-zeigen-illegales-Attest-aus-dem-Internet.html\nBywały nawet przypadki wytaczania procesów osobom powołującym się na jego atesty.\nhttps://www.augsburger-allgemeine.de/schwabmuenchen/Schwabmuenchen-Ohne-Maske-im-Bus-Frau-zeigt-falsches-Attest-und-landet-vor-Gericht-id59411261.html\nPrzy czym dr Bengen oficjalnie w jego filmie poinformował – i miał rację – że każdy uczciwy lekarz każdemu pacjentowi chcącemu taki atest otrzymać, powinien go wystawić. Przypomniał, że narzucone przez marionetki okupanta nie chronią przed wirusami, natomiast długotrwałe ich noszenie może zaszkodzić każdemu. Przez co każdy lekarz powinien każdemu chętnemu taki atest wystawić. I za to spotkała go wściekła nagonka. Wypowiadał się w wielu filmach, założył na yt kanał pt „Miecz prawdy” („Schwert der Wahrheit”), ale większość jego filmów była kasowana. Wypowiadał się także i w innych sprawach – znał oszustwo systemu bankowego, wiedział o planach NWO, krytycznie mówił o wszelkich szczepieniach. Zamieszczam jeden ze znalezionych linków poświęconych jemu:\nhttps://report24.news/schock-corona-kritscher-arzt-der-ersten-stunde-beging-tragisch-selbstmord/\nA tu jego kulawe tłumaczenie na język polski:\nhttps://translate.google.com/translate?hl=pl&sl=de&u=https://report24.news/schock-corona-kritscher-arzt-der-ersten-stunde-beging-tragisch-selbstmord/&prev=search&pto=aue\n„Kulawe” gdyż np. źle tłumaczy jego wypowiedź o tym, że pod przykrywką fałszywej pandemii chce się narzucić nam przymusowe szczepienia:\n„In diesem Video erklärt Dr. Bengen, dass Massenzwangsimpfungen bevor stehen”.\n(W tym video wyjaśnia dr. Bengen, że czekają nas masowe przymusowe szczepienia).\nNatomiast automatyczny „tłumacz” przetłumaczył to tak:\n„W tym filmie dr. Bengen, że masowe szczepienia są nieuchronne.”\nNieuchronne zamiast przymusowe…\nDr Jens Bengen zawsze pozostawał wierny jednej z najważniejszych zasad etyki lekarskiej – primum non nocere – po pierwsze nie szkodzić. I dlatego m.in. wystawiał wszystkim atesty zwalniające z obowiązku noszenia namordników. I dlatego też ostrzegał przed wszelkimi szczepionkami, nie tylko przed ludobójczym koktajlem big pharmy nazywanym bezczelnie „szczepionką” na świrusa.\nOdszedł człowiek odważny, odważny lekarz i świadomy obywatel. Pytaniem pozostaje jedynie, czy rzeczywiście sam sobie odebrał życie, czy też dopadł go seryjny samobójca. Bo on grasuje nie tylko w Polsce, ale i na całym „wolnym i demokratycznym” zachodzie.\nBlog polski oddaje hołd temu odważnemu człowiekowi.\nCześć pamięci dra Jensa Bengena!\nopolczyk",
			"added": 1622418517
		}
	],
	"topic_vote": {
		"1623926456_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1612974506_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 1,
				"body": "Zawsze jest jakiś wybór? To tylko od ciebie zależy, czy jesteś się gotów przesiąść z osła na KONIA.\nDecyzja należy do ciebie. Jest to niezależna decyzja.",
				"added": 1612984760
			},
			{
				"comment_id": 2,
				"body": "@awruk;\nWłaśnie uruchomilem ZeroNeta, na Yandex-ie,  To są wolne media, śmiga jak brzytwa. Można być zszokowanym.,\nAle to działa. Powiem krótko; inny świat. \nJak szukasz? To zawsze coś znajdziesz ciekawego dla siebie. windows, tuba, okulary, pejsbuk, to są archaiczne przeżytki.\nTrzymajcie się ciepło.",
				"added": 1612985299
			}
		],
		"1617137397_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 3,
				"body": "Historyczna prawda, czasami może zaboleć? I jednocześnie zadziwić czytelnika, który nigdy się nie interesował jak to kiedyś bywało. Szczególnie to można zobaczyć w polityce, jakimi pokrętnymi ścierzkami  chadza. W sumie Ciekawe Fakty historyczne, warto przeczytać, i zastanowić się nad dzisiejszymi sojuszami strategicznymi. Czytaj, / jako mięso armatnie /.",
				"added": 1617289564
			}
		],
		"1618103384_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 4,
				"body": "Ważny temat, ale chyba źle rozumiany przez ogół czytelników. \"Bezpieczeństwo osobiste\". Powinno się o tym mówić codziennie, aż do bulu,  czytaj - aż do skutku.",
				"added": 1618188017
			}
		],
		"1618368827_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 5,
				"body": "Wspomnienia? Ile trzeba czasu, żeby dowiedzieć się prawdy? 50-lat? 100-lat? Nigdy?\nPytania bez odpowiedzi? A może te odpowiedzi są na wyciągniecie ręki? Trzeba tylko sięgnąć.\nKręcą ludźmi jak tylko chcą.",
				"added": 1618407334
			},
			{
				"comment_id": 13,
				"body": "Zapomniałeś o papieżu, który całuje żydom ręce, całej rodzinie. Papież i dwie bankierskie rodziny? To powinno dać trochę do myślenia. Film B.Pawlikowskiej o zdrowym jedzeniu? Gdzie jest wytłumaczone jak niezdrowe jedzenie nam szkodzi. Jak funkcjonuje cały organizm? Wszyscy wiemy, tylko nikt tego nie stosuje. \nFilm o Moskwie; jakie zaszły tam zmiany w ciągu dwudziestu lat. Można tylko pozazdrościć Rosjanom \"Putina\".\nHakerzy, fil dokumentalny; troszkę już zabytkowy i nie całkiem dokładny, ale napewno ciekawy dla nowicujuszy. \nPandemia to zbiorowe zabójstwo; dr.Hałat. to też ciekawa pozycja, która daje dużo do myślenia. Dotyczy tych mocno zaszufladkowanych. Ziemia istota żywa; Też ciekawy temat? Walka o wolność a może Nie.\nI chyba najważniejszy, dotyczący polaków; To Spis powszechny. Jest to informacja, co nas czeka w niedalekiej przyszłości. Przykład, Niemcy też zrobili spis powszechny Holendrom? A potem najbogatszych wywieźli do obozu.Czużby mamy powtórkę z rozrywki? Ten spis robi prywatna firma z Izraela. \nSmiertelne żniwo; gdzie matka opowiada o śmieci dziecka po zaszczepieniu. I niechęci lekarzy do pomocy. To wszystko trzeba zobaczyć, aby zrozumieć pewne zachowania tego nierządu. I Globalistów. Dalsze filmy to ,Prezydent Tanzanii, który odmówił zaszczepienia swojego narodu. Dentysta sadysta; Jak się zatruwa młode pokolenie? A do przeczytania; Nasze jedzenie codzienne; gdzie są wyszczególnione wszystkie chemikalia jakie są dodawane do jedzenia. I my to codziennie jemy. Jaki jest tego skutek?",
				"added": 1619094187
			}
		],
		"1618429064_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 6,
				"body": "Podstawowy błąd w sztuce myślenia; MOŻNA WYŁĄCZYĆ,  a powinno być napisane; MOŻNA USUNĄĆ.  Jest to ewidentna różnica. W każdym Linuxie, są Repozytoria, w których można odinstalować jakiś program, Jak i błyskawicznie zainstalować. To trwa , naprawdę sekundy. Odinstalowany program, jest usuwany z dystrybucji. \nCo ZROBIONO ? żeby temu przeszkodzić? Niektóre programy powiązano ze sobą skutecznie. Teraz nie jest możliwe odinstalowanie niektórych programów, które są zbędne, ale jednocześnie spełniają rolę konia trojańskiego. Szary obywatel, nie potrafi tej przeszkody przeskoczyć samodzielnie. Potrzebny jest Informatyk z prawdziwego Zdarzenia. A tych ludzi jest trudno znaleźć. A co do - UBUNTU -, to zostało wykupione dlatego, że uzyskało sporą popularność, w sród ludzi;  Spec służby nigdy nie pozwolą, na rozwój takiej sytuacji, i przejęcie kontroli nad społeczeństwem.\n Oczywiście są programy / dystrybucje, które spełniają te wymogi bezpieczeństwa. Jest jedno ALE, operator musi być na odpowiednim poziomie WIEDZY. Tym wyznacznikiem jest umiejętność obsługi TERMINALA / KONSOLI. \nI nie chodzi tutaj o wpisanie / skopiowanie jednego polecenia, czy może dwóch. Hasło dnia brzmi: UBUNTU - nie jest już LINUXEM. Jeśli ktoś twierdzi, że Ubuntu to dalej Linux? To taka osoba nie wie co wygaduje. To na tyle, dodatkowej informacji dla czytelników.",
				"added": 1618430728
			},
			{
				"comment_id": 14,
				"body": "Linux,=Wiedza. Bez tego nic nie bedzie, żadnej rewolucji. Linux wymusza myślenie, a tego wszyscy się panicznie boją. Ludzie się boją samodzielnego myślenia.",
				"added": 1619094378
			}
		],
		"1618366115_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 7,
				"body": "Tak, warto przejrzeć te materiały.",
				"added": 1618438893
			}
		],
		"1618579779_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 8,
				"body": "To by tylko świadczyło o tym, że  rośnie świadomość użytkowników. Jak bardzo?  100-tys. to nie jest wiele jak na skalę obłożenia tych kont przez użytkowników. Trzeba poczekać trochę, być może, że to się zmieni na korzyść wolnej komunikacji. Jak ktoś powiedział jedna jaskółka nie czyni wiosny. Jeszcze jedna sprawa; Zarejestrowanie? Nie znaczy że używam. Mogłem tylko na próbę zarejestrować, i na drugi dzień przestać używać. A konto figuruje jako czynne, cały czas. Myślę że to jest pozytywny ruch w kierunku wolność słowa. A druga sprawa, „ONI”, NIGDY nie  ODPUSZCZĄ. To jest PEWNIK, nie ma takiej opcji. Będą musieli za chwilę założyć nową instalację, Pytanie? Na  ile sprawdzoną , i na ile gwarantującą BEZPIECZEŃSTWO??? \nTemat jest wciąż otwarty, i trudny do sprawdzenia. Ciągła reklama, że coś jest bezpieczne powoduje u ludzi galimatias w ich ograniczonych głowach. Ludzi trzeba zresetować, albo przeprogramować. Jeśli tego nie zrobimy? To te zabiegi zmiany nic nie dadzą. Jest takie powiedzenie; \n-STARA  KURWA  W  NOWYM  FUTRZE.-  Jak była stara? Tak została stara. Tylko OPAKOWANIE, się zmieniło. Nic więcej w tym życiu doczesnym. Ludziom dużo brakuje do osiągnięcia wyższego poziomu Wiedzy? Cieszy tylko fakt, że tych obudzonych jest coraz więcej.",
				"added": 1618599331
			}
		],
		"1618579412_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 9,
				"body": "WIERUTNA BZDURA. W czasach Stalina, nikt nie myślał o komórkach? To było wtedy pojęcie nieznane. Telefon był na korbkę, plus łącznica telefoniczna, na kablach wtykanych. Można zobaczyć takie urządzenie, w muzeum Techniki w Warszawie. / na przykład /. Druga sprawa, to Stalin był nie techniczny, a to tylko oznacza, że nie miał bladego pojęcia o technice. Trzecia sprawa, Stalin był prostym i prymitywnym człowiekiem, tak jak świński ogon. / taka przenośnia /. To była też marionetka, jak większość wszystkich przywódców, światowych. Tylko bardzo NIELICZNI, mogli decydować o tym co robią? Cała rzesza tych ludzi to są marionetki, pociągane za sznurki. \nPrzykładem jest, nasz nomen / omen, BOLEK – wel Wałęsa? To był żart zrobiony przez bezpiekę, z ludności robotniczej. Która i tak tego nie mogła ogarnąć / zrozumieć. Tyle mówi Historia; a zazwyczaj historia nie kłamie. / ta prawdziwa /.\nZamiast nazwiska STALIN ? Jakby wstawić inne nazwisko? To by się pewnie zgadzało. Te nazwiska, które coś decydują? To skrywają się w cieniu mrocznej historii. Można się tylko domyślić kto za tym stoi? Obecnie jest nagonka propagandowa na Rosję, czasy powrotu do Zimnej Wojny. Tylko czasy się mocno zmieniły i dzisiaj to wszystko wygląda już inaczej. Druga sprawa; TO jest różnica po miedzy telefonem a Srajfonem? Ta różnica jest ogromna i niezaprzeczalna. \nJak działa taki srajfon, i co robi?   To chyba wszyscy wiemy, a jeśli NIE? To osoby które tego nie rozumieją? Tutaj nie mają nic do szukania, to nie jest ich poziom, wiedzy. Jest to Poziom PRZEDSZKOLE, które znajduje się na innym pietrze tego budynku.  / proszę tylko bez urazy /. Temat oprogramowania do tych wynalazków to jest całkiem inny problem? I bez większego już znaczenia. Zamiana nic nie da i nic nie pomoże. Tylko wycofanie tego wynalazku. \nSamo zgodzenie się na wprowadzenie tego wynalazku jest zamachem na naszą WOLNOŚĆ, i życie.\nWprowadzenie tego wynalazku, przeszło bez większego problemu. Historii już nie cofniemy, \nCel został osiągnięty. Zło tym razem znowu wygrało. Można by było przestać używać, ale większość ludzi się nie zgodzi na to. W starych przepowiedniach, tych sprawdzonych; jest powiedziane: I każdy dostanie znamię szatana.\n**SRAJFON  TO  JEST  ZNAMIĘ  SZATANA**.",
				"added": 1618601658
			},
			{
				"comment_id": 12,
				"body": "Problem jest chyba bardziej złożony, niż nam się wydaje. Blokada, czy brak blokady? Punktem wyjścia jest człowiek, który już został zaprogramowany. Przeprogramowanie wsteczne jest bardzo trudne. O ile, już jest niemożliwe.",
				"added": 1619092549
			}
		],
		"1618602969_19xhtyj7LfruJTijwdhgR7yocsLVrLgSuP": [
			{
				"comment_id": 10,
				"body": "Zawsze tak jest, że pierwszy pomysł jest DOBRY. Potem ten pomysł zostaje przejęty przez ludzi który chcą zarobić i mieć władzę? W tym momencie należy już się wycofać. To tak jak wchodzeniem na szczyt góry? Wchodzi my do momentu stanięcia na czubku; Potem już może być tylko upadek w dół. Ten niby, rozwój zawsze prowadzi do śmierci i agonii tego dobrego wynalazku. Podobnie jest z ZeroNetem? Człowiek który to wynalazł, / Węgier /. Chciał dobrze, i było to dobre. Zostało to przejęte przez CIA,  i  poprawione. To jeszcze nie było takie złe. \nNastępne poprawki sprawiły, że ten projekt został z rozmysłem zniszczony. On jeszcze żyje, ale już dogorywa. Nasuwa się jeden wniosek;\n LUDZIE  JESZCZE  NIE  DOROŚLI  DO  WOLNOŚCI  SŁOWA.",
				"added": 1618605083
			}
		],
		"1618726346_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 11,
				"body": "Niezły wykład, podobnie myślę. Królestwo kłamstwa.",
				"added": 1618747788
			}
		],
		"1619507046_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 15,
				"body": "*Jakie inne kraje? ( w tym polska ).*\n.\nPrima aprilis, już był w tym roku. Taka usługa, to duże wyzwanie dla informatyki? / w tym zachodniej /.\n.\ndużo zdrówka życzę.",
				"added": 1619520673
			}
		],
		"1619526269_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 16,
				"body": "Dobry opis do filmu; Jak można zmontować przekazywaną treść? Film obejrzałem, na pierwsy rzut oka, nie można nic jemu zarzucić? Powstaje pytanie? A gdzie jest Cenzura, która pozwala to przepuścić przez gęste sito?\n Może słodko Śpi??? Czy to nie jest dziwne, że pewne słowa są ścigane, po przez zbanowani; a inne słowa już nie koniecznie? To tylko chyba zależy kto ten materiał umieszcza. I jakiego ma opiekuna?\nChociarz w tym Filmie jest pokazane dużo prawdy? Bo inaczej by nikt, w to nie uwierzył? Wystarczy, że odcedzimy tą prawdę od kłamstwa i zamierzonej zmyłki.\nPozostaje pytanie? Po co to robią? Co znowu zamierzają?  Zapraszam do dyskusji. \nBrawo Sasza.",
				"added": 1619528400
			},
			{
				"comment_id": 20,
				"body": "Każdy kij ma dwa końce; dzisiaj zarabiam, a jutro moje dzieci, i moja rodzina umrze. Wybór należy do mnie, mogę wybrać pomiędzy rodziną a zarobkiem zadrukowanego papieru. Jutro już nie będzie nawet papieru.",
				"added": 1620826407
			}
		],
		"1619880888_1CfWNmALwroEPSsRqZrrdFcatYizitZ6r3": [
			{
				"comment_id": 17,
				"body": "Teatr nie teatr; ale \"MY\" siedzimy na widowni. Możemy oberwać rykoszetem po ryju? Bardziej mnie martwi ukrojona? Angole wysłali na Morze Czarne swoją flotę wraz z lotniskowcem. To jest realne zagrożenie dla nas. Szukają dziury w całym? Mogą przypadkowo znaleźć. Rosjanie przerzucili  170-tys. wojska na granicę z Donbasem, potrzebowali na to parę dni; Teraz zabrali 50-tys. z powrotem w głąb Rosji. To świadczy o olbrzymiej mobilności tych wojsk. Chodzi o szybkość reagowania. To był kubeł zimnej wody, na rozpalone głowy z Pentagonu.",
				"added": 1620457677
			},
			{
				"comment_id": 18,
				"body": "@svvarog, \n.  Ostatnio można zauważyć niepełne ładowanie i ściąganie filmów. Brak osób seedujących? Co najmniej jest trochę dziwne; Zwłaszcza po tych usprawnieniach dotyczących dystrybucji. Pytanie brzmi? Czy to jest wroga robota??? Czy tylko przypadek i brak zainteresowania ludzi tym zakątkiem internetu. Ja mam dziwne odczucia w tej sprawie. Pomijam ludzką głupotę i indolencję. Wszyscy oczekują CUDU - ? Ale sami nic nie zamierzają zrobić w tym kierunku.\n.\nCIEKAWOSTKA, -techniczna.\n. Uruchomiono pierwszą linię internetu KWANTOWEGO-, pomiędzy Moskwą , a → \nSant Petersburgiem, , odległość 800-km, Na jesieni tego roku, ma być tej sieci dużo więcej. Znając systematyczność Rosjan? Można zacząć się obawiać, że pozostaniemy wraz zachodem w czarnej DUPIE. To taka łagodna prognoza, na najbliższe miesiące.\nA może być znacznie gorzej, ja widzę takie możliwości. Jako kraj mamy olbrzymie zaległości techniczne spowodowane rozmyślną dewastacją zasobów ludzkich. Ale to jest temat na odrębny artykuł. \npozdrawiam.",
				"added": 1620553870
			}
		],
		"1620662392_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 19,
				"body": "Stara historia, którą teraz można swobodnie poczytać. Dzisiaj to niema żadnego znaczenia, oprócz nauki na przyszłość.",
				"added": 1620805021
			}
		],
		"1618538921_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 21,
				"body": "Za dwa lata się nie przesiądziesz; dlaczego? bo zostaniesz daleko w tyle, życie biegnie szybko. Opóźnienie jednego roku? to cała wieczność w informatyce. Kiedyś były modne wyścigi rowerowe, \"Wyścig Pokoju\". Jeśli tam odpadłeś od głównego peletonu, to było już pozamiatane, żadnych szans na jakiekolwiek zwycięstwo. Podobnie jest dzisiaj z internetem, już wchodzi internet kwantowy. Jak chcesz go dogonić, nie będąc na bieżąco?\n.\nWracając do głównego wątku dyskusji. Teraz jeszcze można zmienić nawet całą dystrybucję. Ja to już robiłem parę razy z pozytywnym skutkiem. Oczywiście wymagało to trochę nakładu pracy. Ale efekt był piorunujący, bo oprócz  nowej dystrybucji, jeszcze czegoś się nauczyłem. Udowodniłem sobie, że potrafię się wdrapać na szczyt niemożliwości dla innych alembików? Samodzielnie wszedłem na sam czubek .Wszystko zależy od ciebie, czy chcesz być w głównym peletonie? Czy na szarym końcu wyścigu szczurów.",
				"added": 1620827729
			},
			{
				"comment_id": 25,
				"body": "Specjalistą? Musisz być sam dla siebie. To tak jak , najlepszym adwokatem, też jesteś Sam dla Siebie. Nikt Ciebie nie będzie bronił? Tak jak \"TY\" sam siebie.\npozdr.",
				"added": 1622624727
			}
		],
		"1621556211_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 22,
				"body": "Dziada należało by odstrzelić, zasługuje na to z całą pewnością. \nJednak chyba mały RESET - jest potrzebny. Bez tego  chyba się nie obędzie.\npozdrawiam wszystkie małpy, i świnie.",
				"added": 1621556942
			},
			{
				"comment_id": 28,
				"body": "To nie jest szaleniec? On pracuje dla Gadów, Jest przez nich finansowany. I jest przez nich wspierany Finansowo. Jest to tylko figura na szachownicy, taki Skoczek.",
				"added": 1624537954
			}
		],
		"1621674323_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": [
			{
				"comment_id": 23,
				"body": "Też popieram, mieli Windowsy? to dobrze im tak. Mogli zainstalować sobie Linuxy.\npozdr.",
				"added": 1622406664
			}
		],
		"1622418520_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": [
			{
				"comment_id": 24,
				"body": "Tak się załatwia oponentów i przeciwników. To tylko dzięki nim wiemy co się dzieje na świecie, Nie tak?\npozdr.",
				"added": 1622418738
			}
		],
		"1621854532_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 26,
				"body": "Trochę prawdy w Temacie \"Tabu\". Wszyscy boją się ten temat poruszać.",
				"added": 1622624994
			}
		],
		"1622662817_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 27,
				"body": "Tak, taka nasza obojętność na ludzką krzywdę. Kiedyś tak nie było? Czyli szczepionki i opryski działają. To dobry znak aby zrobić depopulację. I przygotować  nowe  miejsce, pod zasiedlenie.\npozdr.",
				"added": 1622744896
			}
		],
		"1622035388_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 29,
				"body": "Jeśli dużo krzyczą? to znaczy, zabolało. A może to był całkiem inny scenariusz? Może ratowali kogoś? A może przeszkodzili w czymś? My możemy teraz tylko gdybać;  Podam przykład, Pamiętacie dwie Wieże Center? Potem było ich już trzy, a na koniec okazało się że tych budynków było aż pięć? Pierwszy Film, który pokazywał jak samolot przeleciał przez budynek? Ten film znikł z YouTuba, dosyć szybko; Ale pozostał gdzie indziej. Zamknięte piętra, nieczynne; I późniejsze wybuchy na tych piętrach. I na koniec, wywiezienie gruzu z tych budynków w nieznanym kierunku. Dzisiaj po latach, już patrzymy trochę inaczej na te zdarzenie. A większość to zapomniała już całkowicie co tam się wydarzyło. Czas pokaże o co chodziło z tym samolotem i Protasiewiczem?\npozdr.",
				"added": 1624544017
			}
		],
		"1623926456_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 30,
				"body": "*Tak więc widać już wyraźnie, kto stoi za światowym „forum ekonomicznym”, „wielkim resetem” i Klausem Schwabem. Jest on po prostu najemnikiem banksterskiej sitwy*\n. To jest odpowiedź na pytanie? Kto siedzi przy tym Pokerze??? Kto jest, wykonawcą tego planu? Teraz wystarczy prześledzić przepływ gotówki; Pomiędzy jednym kontem, a drugim?\npozdrawiam.",
				"added": 1624726018
			}
		],
		"1626053945_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 31,
				"body": "Putin + Doradcy, wiedzą co robią? Są zorientowani, co się szykuje? A nas uśpili, i wyłączyli samodzielne myślenie. \nTo zrobili, Ci co zarządzają, Bantustanem?\npozdr.",
				"added": 1626295703
			}
		],
		"1626904569_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 32,
				"body": "Ciekawy temat? i dobrze napisany. Polecam. Zapoznaj się z tym materiałem.",
				"added": 1626935925
			}
		],
		"1634380149_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 33,
				"body": "Tak; to jest stare, ale śmieszne.",
				"added": 1634406971
			}
		],
		"1636101927_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 34,
				"body": "To są wymuszone zakupy; Albo wcześniej uzgodnione, albo jeszcze coś innego?",
				"added": 1636325148
			},
			{
				"comment_id": 38,
				"body": "Dostałem alergii na szczepionki; Jak słyszę szczepienie, to scyzoryk sam mnie się otwiera w kieszeni. Któregoś razu mogę nie zdzierżyć?\npozdrawiam.",
				"added": 1636756404
			}
		],
		"1636327067_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 35,
				"body": "Włos się jeży na głowie; w połączeniu z artykułem o sprzedaży, zaczyna się robić ciekawie. Co jeszcze kryją te zastrzyki, oprócz tych cech wymienionych? Puzzle zaczynają się układać w całość tworząc pewien obraz zamachu na ludzkość... Co będzie dalej, czarno to widzę. Łobuzy, się dobrze przygotowali do tej akcji;  To dlatego też szczepią dzieci, chodzi o nadanie numeru kolejnego; dwanaście cyfr, litery i kropki? Ile z tego można ułożyć kombinacji???\nChyba trochę dużo, pytanie? Jak dużo, dla wszystkich zainteresowanych wystarczy...Cholera jak ludzie się nie obudzą, to będzie straszny smród, istne szambo. Jak mogli się na to zgodzić zarządzający???\nA co wy o tym myślicie? Napiszcie koniecznie jakie jest wasze zdanie w tym temacie. Ja jestem porażony.\nPozdrawiam.",
				"added": 1636325997
			},
			{
				"comment_id": 36,
				"body": "**Takie sobie przemyślenia**...\n.\n. Kraj ma duże ilości węgla, a to oznacza niezależność? A niezależność nie jest lubiana przez mocarstwa; Być niezależnym, to znaczy można być nieposłusznym. Z węgla można zrobić gaz, do tej pory, tak się robiło i było dobrze. Zdurnienie ludzi osiągnęło niebezpieczny poziom?\n.  Mam na myśli tych którym się podaje zastrzyki w których jest tlenek Grafenu. A inny zastrzyk ma żywe organizmy? To są dwa różne zastrzyki, i od różnych firm; Tych firm jest parę i też mają coś innego na składzie zastrzyku. W tej chwili jeszcze nie jest wiadomo co tam jest ukryte i do czego to ma służyć?Prawdopodobnie chodzi o sztuczną Inteligencję?Tak więc mamy już pewne założenia techniczne wprowadzone do obrotu pomiędzy ludzi.\n. Pierwszy zastrzyk, żywe organizmy, które żyją samodzielnie i poruszają się samodzielnie.\n. Drugi zastrzyk, tlenek Grafenu, który wytwarza numer obozowy, adres IP, który można zdalnie   odczytać. Ten numer w połączeniu ze srajfonem wyznacza pozycję gdzie przebywa dany osobnik.\n. Trzeci zastrzyk, / nie jest do końca sprawdzone /. Można sterować tym człowiekiem???\nWszystkie następne zastrzyki też mają za cel jakieś zadanie do wykonania. Wszystkie są kontrolowane przy pomocy; 5G, / telekomunikacja /. A srajfon to jest lokalizator miejsca pobytu. Brakuje tylko sterowania, takiej konsoli? I nią może być trzeci zastrzyk...\n. A co wy myślicie w tym temacie?\n.\n  pozdrawiam.",
				"added": 1636361404
			}
		],
		"1636109745_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 37,
				"body": "Trochę poezji, też jest dobre. A to ma sens i pewien przekaz.",
				"added": 1636389199
			}
		]
	},
	"comment_vote": {}
}