{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1522504967_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 1,
				"body": "> Пришел Ваня Иванов, увидел ошибки, неточности, и исправил их. Версия последнего набрала больше лайков, стала основной.\n\nТут есть проблема: когда Ваня Иванов отправит несколько мелких исправлений то его версия будет с 0 лайками и никто ее не увидет а значит и не поставит лайк.",
				"added": 1522564145
			},
			{
				"comment_id": 2,
				"body": "> [geekless](#comment_5_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Да, её увидят только те, кто подумает «тут вот надо исправить, дай-ка посмотрю версии, может быть, кто-то уже исправил и опубликовал».\n\nДумаю что они скорее опубликуют точно такие же исправления от своего имени чем будут перечитывать сотни вариантов одного и того же документа.",
				"added": 1522564746
			},
			{
				"comment_id": 3,
				"body": "С PoW тоже неоднозначно, с одной стороны есть бюджетные мобильные устройства, с другой - всякие топовые i9 у которых производительность отличается на порядок-другой.",
				"added": 1522565183
			}
		],
		"1525347553_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 4,
				"body": "Можно подгрузить все и потом поиском по странице.",
				"added": 1525349655
			}
		],
		"1556293876_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 5,
				"body": "> [if0](#comment_6_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Случаются разные жизненные ситуации, в которых создателю хаба будет совсем не до ZN и его пользователей. Или он просто потеряет интерес к данной сети и не захочет продолжать свою деятельность.\n\nХаб не требует поддержки со стороны своего создателя.",
				"added": 1559025427
			},
			{
				"comment_id": 6,
				"body": "> [if0](#comment_7_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А как же размер профиля - каким образом устанавливется лимит на посты? Или каждый пользователь может постить тексты любого размера в неограниченном количестве?\n\nЕсть лимит по умолчанию, который применяется ко всем, для кого явно не указан другой.",
				"added": 1559061808
			},
			{
				"comment_id": 7,
				"body": "> [if0](#comment_8_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Что делать в случае исчерпания лимита на заброшенном хабе?\n\nУдалить свои старые записи, завести новую учетку или переехать на другой хаб.",
				"added": 1559125682
			},
			{
				"comment_id": 8,
				"body": "> [if0](#comment_10_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Тогда сеть станет неработоспособной, из-за длинных очередей синхронизации, \"благодря\" которым новые сообщения будут распространаться со значительной задержкой\n\nС чего бы ей стать от этого неработоспособной? Что касается задержки, то не вижу в ней ничего плохого.",
				"added": 1559648837
			},
			{
				"comment_id": 9,
				"body": "> [if0](#comment_13_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Но что произойдет, если их количество возрастет до нескольких тысяч, причем большинство из них будут не сайты, а вспомогательные ресурсы - хабы.\n\nКаждый ресурс, вне зависимости от того, сайт он или хаб, автономен и не мешает остальным.\n\n> Придется непрерывно загружать сотни файлов content.json (и data.json - которые могут иметь значительный объем) в течении каждой секунды.\n\nКак раз для решения этой проблемы как раз и придуманы хабы.\n\n> Вторая проблема: отсутстве гарантии достижения читаеля анонсов изменений контента паблишера\n\nРано или поздно они синхронизируются через другие пиры.\n\n> на клиенте должна происходить постоянная ротация трекеров\n\nОна и происходит.\n\n> Это убъет основую имхо фитчу ZN - возможность большую часть времени находиться оффлайн, подключаясь для синхронизации на время активного взвимодействия с сетью.\n\nЗадержка синхронизации не означает необходимость постоянно быть онлайн. При синхронизации все обновления будут выкачаны с ближайших пиров и туда же будут залиты апдейты.\n\n>  Или придется длительное время (десятки минут или часы) ждать после отправки сообщения пока его смогут прочитать другие пользователи форума.\n\nТакая ситуация возможна. Но ждать совсем не обязательно онлайн.",
				"added": 1559668047
			},
			{
				"comment_id": 10,
				"body": "> [if0](#comment_14_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Вместо 10 сообщений в сутки их станет 1000?\n\nНичего страшного не случится. Во первых клиент умеет передавать diffы, во вторых 1000 сообщений в сутки это чуть меньше сообщения в минуту, сайт же синхронизируется куда меньше минуты. В третьих мало кто будет подписываться на все это сразу.",
				"added": 1559712763
			}
		]
	},
	"comment_vote": {}
}