{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroMail Update Fehler",
			"body": "Moinsen,\ngrade frisch zum ersten mal ZeroNet installiert und gleich meinen Spaß damit gehabt 👍\nLeider scheint ZeroMail nicht updaten zu wollen; der Prozess bleibt immer bei 10 Dateien stecken, welche sich einfach nicht updaten lassen wollen.\nHat da einer einen Rat?\nThxalot,\nFroxlR",
			"added": 1524841017
		}
	],
	"topic_vote": {
		"2_19czZMtAoro4WBfRHtjRrSLosuwRnfFt4r": 1,
		"1_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW": 1,
		"1_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1_15hc2rjxos5QEpHrrLo6ruAhzJG5w9PYKo": 1,
		"5_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": 1,
		"1_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": 1,
		"4_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1_1NxHLTcNysskS1fr6tYvrLdbD3d1qqjLYf": [
			{
				"comment_id": 1,
				"body": "Bringt leider nix :( Kann ich irgendwie nachschauen, welche Dateien das sind (z.B. irgendeine Logfile)?\nThxalot",
				"added": 1524938126
			},
			{
				"comment_id": 2,
				"body": "Moinsen,\num das ganze zu konkretisieren: Ich hab die Debug.log gefunden und dort ist ersichtlich, dass es sich um die data.json verschiedener Nutzer handelt. Meistens waren es so um die 8 Peers mit 2-3 Workern.\nDann ist es natürlich auch nachvollziehbar, dass @lin0x und ich keine Antwort vom Echobot bekommen.\nUND FETTE ERGÄNZUNG: In der sites.json sind ja auch alle Dateien aufgeführt: https://pastebin.com/rVdkB6pw (löscht sich nach einem Monat).\nBB,\nfroxlr",
				"added": 1524991319
			},
			{
				"comment_id": 3,
				"body": "Moinsen,\nich wollte nur fix melden, dass trotz Fehlern das Mailen erstmal gut funktioniert.\nBin echt gespannt, was die Zukunft für ZeroNet noch bringt 👍\nThxalot an alle Beteiligten.\nfroxlr",
				"added": 1525174495
			}
		],
		"1_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 4,
				"body": "Nun, ich denke kompliziert wird es dann, wenn man ja argumentieren kann, dass alles auf der lokalen Platte liegt (also nichts anderes, als würde ich deinen Blog als TAR runterladen und entpacken). Allerdings würde ich sagen, dass du praktisch gesehen, die Seite als Hoster immer noch bereitstellst. Aktuell wird es wohl kaum jemanden jucken, aber spätestens, wenn hier die Rechtsparolen auftauchen, wird das Frau Neuland sicherlich interessieren.\nWeil du das ganze neue ansprichst: Lustigerweise ist das mMn komplett hinfällig, denn im ZeroNet werden schonmal keine Vorratsdaten vom Webserver gespeichert 😂\nGrundsätzlich würde ich aber immer auf Nummer sicher gehen.",
				"added": 1525619906
			},
			{
				"comment_id": 7,
				"body": "> [funkyz](#comment_1_1FfehjDFd2F1BmLNJxaeESs44SR47RNKrb): Dann müsstest du aber voraussetzen, dass alle deine Leser ZeroNet nutzen?\n\nWas das Voraussetzen angeht: Es gibt einige öffentliche Gateways, die *normale* Nutzer benutzen können, um Zites anzusurfen: zeroproxies.bit",
				"added": 1531040126
			}
		],
		"1_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW": [
			{
				"comment_id": 5,
				"body": "Moinsen,\nalso bei mir wie auch bei einigen anderen Usern funktioniert der Bot entweder gar nicht oder antwortet erst nach langer Zeit. Wenn du das Versenden testen willst, schicke lieber eine kurze Nachricht an einen Nutzer. Ich denke, die wenigsten hier stört es, wenn du sie kurz anschreibst.\nBB,\nfroxlr",
				"added": 1525702701
			},
			{
				"comment_id": 6,
				"body": "> [garlic](#comment_1_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW): Ja, das habe ich geshen vorein paar Tagen...Files scheinen bei mir nicht zu fehlen...Gibt es vielleich einen Ansprechpartner für ZeroMail/EchoBot?\n\nNaja, für ZeroMail kannst du die offizielle GitHub Repo nehmen und dort Issues posten.",
				"added": 1525971555
			}
		],
		"2_13eAqDw564Ut7PKZnmrCHeMUKc8PQk4Xaj": [
			{
				"comment_id": 8,
				"body": "Am besten wäre ja ZeroMe oder ZeroBlog, um seine Meinung zensurfrei zu verbreiten ;)",
				"added": 1533732132
			}
		],
		"5_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": [
			{
				"comment_id": 9,
				"body": "Jo, ich hab mir da auch vor einiger Zeit in einem Pod angemeldet. Scheint eine coole Sache zu sein, vielleicht kann man das mit ZeroNet verbinden 🤔",
				"added": 1539722457
			}
		],
		"1_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": [
			{
				"comment_id": 10,
				"body": "Kurze Frage zum technischen Hintergrund:\nWird durch so eine Blockliste nur das Darstellen der einzelnen content.json-Files lokal unterdrückt oder werden die entsprechenden Inhalte eines Users gar nicht erst gespeichert (und damit im Zweifelsfall weiterverbreitet 🤔) ?\nThxalot,\nFroxlR",
				"added": 1550088440
			}
		],
		"1_1EMwggFtxm9Ub7LkE3TLGgNBX8cWyDsv57": [
			{
				"comment_id": 11,
				"body": "geht 😝",
				"added": 1555082002
			}
		],
		"4_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 12,
				"body": "Also ich mach Mathe mündlich, war aber am entsprechenden Freitag trotzdem in der Schule. Tatsächlich waren viele irritiert, dass dieses Mal viel Wert auf Erklären usw. gelegt wurde. Ebenfalls sollen wohl einige Aufgabenstellungen nicht 100% genau gewesen sein (es gab eine Aufgabe mit Vektoren, bei der kaum ersichtlich war, welche Punkte genommen werden mussten). Das mit dem Taschenrechner ist übrigens korrekt, auch wenn es keine 30 Minuten war. Sofern man aber die entsprechende Aufgabe mit SolveN lösen wollte, waren das sicherlich um die 5 Minuten, die der Rechner gebraucht hat.",
				"added": 1557826297
			},
			{
				"comment_id": 13,
				"body": "> [frankenstein91](#comment_48_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5): okay es kann sein, das der Schüler hier nach der Prüfung übertrieben hat... bzw. sich solche Wartezeit auch anders anfühlt im Stress. Trotzdem würde mich immer noch die Aufgabe an sich neugierig machen?\n\nIch schau mal, ob die Aufgaben bereits von Sachsen freigegeben wurde. Ich halte euch auf dem laufenden 👍",
				"added": 1557944742
			}
		]
	},
	"comment_vote": {
		"2_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6": 1,
		"4_17HsAnNw1DYuQgTAzjE1jFXdPXEQs9PGuJ": 1,
		"8_17HsAnNw1DYuQgTAzjE1jFXdPXEQs9PGuJ": 1,
		"9_17HsAnNw1DYuQgTAzjE1jFXdPXEQs9PGuJ": 1,
		"4_15N3xc7Kp1V1fABsruRHcMCrEK1VFHx98R": 1,
		"2_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": 1,
		"48_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1
	}
}