{
	"title": "Neanderthals' realm",
	"description": "Allegory of the Cave",
	"links": "- [Source code](https://github.com/HelloZeroNet)\n- ---\n- [ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1KGXyTfCaaiFWrqoUeY1ku5ULVnEatNhpE/neanderthals@zeroid.bit)\n- [给我写信](/Mail.ZeroNetwork.bit/?to=neanderthals)",
	"next_post_id": 11,
	"demo": false,
	"modified": 1543661748,
	"post": [
		{
			"post_id": 9,
			"title": "一个人的自由",
			"date_published": 1529504248.053,
			"body": "仍然没有节点，看不到外界，外界也无法造访此地。天地间只有自己的回音。不过除此以外，这里的确如其承诺，没有管控、没有限制、没有禁忌，除了百无禁忌的言论之外，其余所有都被比较安全地隐藏起来。一切都是自由的，就像回到了二十年前的互联网，有种阔别已久的怀念。\n\n只是这样的氛围与自由，仅仅属于自己一个人。"
		},
		{
			"post_id": 8,
			"title": "关于节点的谜题",
			"date_published": 1529296923.199,
			"body": "很久没有回来，似乎这里变得越发贫瘠。不用说新世界的拓荒，就连原来开垦出来的一些土地也渐渐荒芜乃至枯萎，要么停止于原来的内容，要么甚至连节点都渐渐连接不上，连带着土地与果实一同消失。总之，以前听说此地的信息可以获得永久保存，但现在看来并非如此，包括这里也是一样。\n\n节点尽皆枯萎，没有节点，这个博客同步了两三天之后都难以链接，总是显示无法更新。也许和这个博客的情况类似，之前新发的那些小站点大都难以链接，整个网络和数月之前相比几乎没有什么变化。真是糟糕的情况，没有新内容导致无法吸引来客，无法吸引来客导致没有新内容。更糟糕的是，不仅没有新内容，连以前的很多内容都已经消失不见。\n\n以前总觉得虽然此地尚属荒原，但就像几百年前的新大陆，有一整个新世界供人开垦。那些生机勃勃的，但不容于旧世界的信息可以在这片新大陆上野蛮生长，直至填满荒原。但现在看来，似乎人们仍旧宁愿沉迷于旧世界腐朽而堕落的纸醉金迷，守着那点越发贫瘠的精神世界不愿离去，只因为这是可以躺着得到的东西，而无需起身探索。似乎人们看着那些转瞬即逝的、充斥代义字符的、只鳞片爪的、真伪难辨的信息就已经足够。\n\n节点的干涸，有来自外部的压力，但总觉得似乎更有自发的、难以理解的内在因素，到底是什么？"
		},
		{
			"post_id": 5,
			"title": "飞鸟的踪迹",
			"date_published": 1516514428.113,
			"body": "新生代时期，哺乳类最终夺取了顶端的生态位。但由于最初与恐龙竞争的失败，哺乳类纷纷转入地下的结果是，几乎所有的哺乳动物都成了色盲。就算后来灵长类因为寻求果实的需求，依靠红色视蛋白的突变获得了新的感光性，但相对于恐龙及鸟类而言，也十分孱弱。\n\n目前看来，之前想象的隐匿其实并没有那么保险。就算在 ZeroNet 的环境里使用 Tor Always 模式，一则并不能保证没有其他暗哨，二则仅就 Tor 这个模式本身的安全性而言，仍需观察。更不用说各个维度各种各样无孔不入的监视手段，腐朽与愚昧在这种地方却爆发出惊人的想象力。毕竟这不是以往在旧大陆中架起天线瞭望远方那么简单的事，而是将脆弱的自身推向前台。退化已久的发声器官摆脱压制后当然希望放声嘶吼，但弱小与无知不是生存的障碍，傲慢才是。这片看似自由的荒原生机勃勃，但头顶高悬的利剑并没有消失。"
		},
		{
			"post_id": 4,
			"title": "来到荒原",
			"date_published": 1516200095.075,
			"body": "虽然听说这里是自由之地，但这么多年来见过那么多城堡倾覆，通道被封禁，早已经习惯了道路以目。想说些什么，却仍然害怕着身后注视的目光，似乎随时就会被发现踪迹。就像某种创伤后遗症，惊惧使然。\n\n虽然举目一片荒凉，不过毕竟这里是自由之地，半年前气氛最紧张的时候建立的这个保留地，慢慢地也可以利用起来，可以写一些东西。虽然自己的博客已经太久没有更新。\n\n然而最重要的还是藏好自己。\n\n- 不要暴露自己的位置。\n- 不要透露自己的身份。\n- 不要记录自己的过往。\n- 不要与现实产生关系。"
		},
		{
			"post_id": 3,
			"title": "neanderthalsrealm.bit",
			"date_published": 1500824940.194,
			"body": "注册了一个域名，[neanderthalsrealm.bit](http://127.0.0.1:43110/neanderthalsrealm.bit)，感谢 domains4free 以及 ZeroNet 上各种教程的帮助。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!",
			"tag": "ZeroNet"
		}
	]
}