{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1560835926,
			"title": "New Alt Media as A New Norm {Protestant}",
			"body": "Trying to create share url for gab/minds/steem it seems really hard to do \n> I'm still on the way of 'learn to code' btw | really noobs, please help\n\n[url=https://postimg.cc/9zCYM370][img]https://i.postimg.cc/9zCYM370/things-that-void-from-new-alt-soc-med.png[/img][/url]\nhttps://postimg.cc/9zCYM370/db42cabe\n\nNaysayer will say \"they're just protesting for a while, if the situations is fixed they'll go back to the 'main fascist platform' again\"\nMy response as always \"No, until something able to be punished - they'll more likely repeat the abominable actions. We're not just a protestant.\"\n*We should make new social media more convenient to use, to give yet-to-move user more attractions.",
			"added": 1560835925
		},
		{
			"topic_id": 1561187203,
			"title": "Cocoscope (supposedly youtube competitor), now REMOVES POLITICAL CONTENT",
			"body": "https://www.bitchute.com/video/aMKmvB6Y4jL4/\n\nThis is all only warning sympthom, ONLY GET WORSE, if only there're: \n1. Payment Processing Competitor\n2. YT Partner Competitor\n\nBeware global dumbing-down",
			"added": 1561187201
		},
		{
			"topic_id": 1561217538,
			"title": "He also got impersonated, wouldn't have known if not using : invidio.us or tube.poal.co",
			"body": "I just notice today, that brother nathanael (http://brothernathanaelchannel.com/watch_video.php?v=N7AN3SYUN89R) are censored and outright deleted by Youtube (2 days ago). He never advocated violence and just stating the truth. If I have no invidio.us/tube.poal.co, I would hadn't known about this.\n\nIf you don't know about Br.Nathanael, he's just one of the rarest jewish christian who live in the monastery in the US. Constantly giving amazing content in which moral value preserved. Hated by the judaism-jews the most of course. He's basically commenting around crucial-secular topics, like war - economy - etc. 'The message before the messenger.'\n\nSorry for spamming twice today.",
			"added": 1561217535
		}
	],
	"topic_vote": {
		"1560529461_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1560426998_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1560679668_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": 1,
		"1560995957_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1561124344_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1561215507_17SMqmrxtMGcem3hpoQ35bi48E4TWeS5p6": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1560227102_1D7aG9GPhaCuEEiGRQpUZGZkMQVEGRga9H": [
			{
				"comment_id": 1,
				"body": "Excuse in this post-truth era is just f*rt, you can't believe everything gov said.\nIMHO if there's any people involved in this war, it's only Saudi & Iran. These 2 big boy are always against each others (sunni-shia | oil monopoly, etc), US are only interested in profit (if any, let the war spread far to control vital pipeline) and mitigate collateral damage to their dollars (oil price too high, collapse will be faster). Some of my patron, geopolitics savy said, US actually no need to involve deeply in this fight. Let those two fight by themself, it's never involving USA to begin with. It only happens that \"Jared Al Arabia\" trumps son-in-law known tightly connected to Saudi via Israel connection. Arab Saudi is only a shishkebab they're too lazy and only count on their pocket money in contrast with Persian Iran which is hardwork-oriented, because many sanctions given to them by US.\n\nAnd also commenting to Iran might attack other country, it wouldn't happen. Russia - although not so close with Iran - will not let that happen. \n\nthis might need further research, only to share my tiny thought about this.",
				"added": 1560233454
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_224_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Americans rejoice, you will pay 'for another war again'.What could be more pleasing and educational, to go and invade another country because you are unable to produce 'a Proper economy'. [...]\n\nYea, it's so sad the people there is really dumbed down: can't even decide to choose 1 BTC or 1$, so sad.\n\n> [sheendocks](#comment_46_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): Iran, DPRK, and Venezuela. Iran has IRGC, DPRK has a huge army and China on its side, what does Venezuela have except backing from Cuba? Venezuela is at the top of the hit list I'm afraid but they'll keep pushing for a peaceful overthrow first and then resort to war if that fails. Hopefully, Russia will step in if Venezuela is attacked but no guarantee.\n\nRussia obviously will step in, it's all about oil price. Russia's total export dominated by energy by nearly up to 70%, if you follow the news US are known to always (orchestrating) sabotaging the oil price (when they need money the most). And btw don't say US as biggest oil producer by now, it's fracking oil which is  environmentally hazardous, hi-risk and output will only be lower and lower in near future. Venezuela is the new project of 'petrodollar rebirth' and as goes in Syria in last 2018, that's the Russia's bottom-line, Putin will go crazy if US too much meddling there. Remember BRICS? US has sabotaged Brazil and Ru-Cn just let it go ... but Syria (pipeline), Venezuela (petrodollar-rebirth) and Iran (as Belt&Road nodes) are crucial for the next multipolar world project.\n\n> [asabiyyah](#comment_2_1D7aG9GPhaCuEEiGRQpUZGZkMQVEGRga9H): I don't believe that profit is a serious motivator for the Americans. It seems to me they really exist solely to die for Israel. I'm sure Iran would have gladly played nice in the interantional economy if America had kept up it's end of the nuclear deal. This would have allowed america to accomplish it's strategic interest, stable oil output, with lower troop commitment and simultaneously freed up soldiers to use to threaten China. I don't advocate for aggression either but that seems to me to be something that is legitimately in the interest of the US. War with Iran seems to only be in the interest of Israel.\n\nNew news here : *Now Trumps want to talk with Iran*\nhere's why : http://thesaker.is/why-trump-now-wants-talks-with-iran/\n\nLittle digress: Yes, I'm sure american are enslaving themself to Israel die-heart-ly. Still I can't find the reasons why?\nAnd I only know from Ron Paul he once said that middle-east was to be dominated by Israel to establish the hegemony and reasons of west to be part of asian continent. Zbigniew Brezinsky has doctrine about eurasia, which if I'm not mistaken whoever rule it will rule 'the entire world' - economically - and another continent could just be forgotten from civilizations. Maybe the target is banishing 'anti-american' sentiment, but that's hard it's like trying to erasing memory from humanity.\n\nclosing: \nOld world is dwindling and dying out, their rampant meddling by their covert operations has come to an end. Without dollar to support where could you go to work? Manipulations of stock market will come to an end. Time to start the industry machine again for real.",
				"added": 1560577201
			}
		],
		"1559682182_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 2,
				"body": "Stop buying fossil fuel?\nWatch this crash course by Christ Martenson - he's amazing economic guy, and notice how intertwined are the relation of economy - energy - environment we have right now. \nhttps://www.youtube.com/watch?v=T7up38Jyv0w&list=PLRgTUN1zz_ofJoMx1rB6Z0EA1OwAGDRdR\n\nBelieve it or not, we may die faster from chemical & nuclear pollutions (which is *miraculously always* ignored by MSM) compared to the over-zoomed climate change. Btw, to care with your environment =/= commie .. I don't agree with that.",
				"added": 1560242898
			}
		],
		"1560529461_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "Don't let them rule",
				"added": 1560531002
			}
		],
		"1552760858_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg": [
			{
				"comment_id": 4,
				"body": "> [xcape2net](#comment_4_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If we wanted moderation, we would be on reddit, were we can be shadow-banned without any explanation given.\n\nabsolutely true",
				"added": 1560531326
			}
		],
		"1560452233_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA": [
			{
				"comment_id": 5,
				"body": "Beside apocalypse, in the time of censorship & technocrat-authoritarian out there there's less reasons for the people to get offline from this safe space. Maybe: We need many content creator inside zeronet",
				"added": 1560532091
			}
		],
		"1560426998_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 6,
				"body": "Next candidate: \n+ thinkspot : at least patronized by JBP, he stake his credibility on this site.\n+ PJW's one: watch his new video, he want to create one too https://www.bitchute.com/video/nn-Qj8HC3sg/\n\n-----\nHere's what I think, it's all about money, energy and content {MEC}:\n+ I think the problem is never with social media itself, but the bank & the medium incentive 2be given to the people. \n+ The people itself = the center of our interest, you can create random website and successful only if the 'MEC' is safe and has constant output. Youtube now is only exist because of privilege to be the first, has a payment system and has a lot of content, imagine if there's a new website to guarantee the payment and all the creators boycotting youtube, deleting the content there/ at least hide from the users, limit new video if published in youtube and move & promote theirs in that other site? They can still safe keep their content using content id (preventing reupload), that's a lotta damage!\n> btw youtube is now I can say the most shameless creature we can observe in the world. Biased algorithm, changing-as-they-want kind of rule, erasing evidence when deleting channel, anti critique, etc.\n+ Also about new MEC, if there's a smart guy with a backing out there: create the new one! Let the big company rotting itself in the entertain-them-tube and let small creative company creating ads on the new intelligence and free speech supportive group. Big companies will fall in the end and in the end demographics matters.\n+ but actually it doesn't matter, content creator can also create ads agency by them-self. And this trends maybe surging up in the future and put the coffin to the Goolag Adsense, the things that most creator - afraid of.\n+ and also there's is threat from smear-merchant-mainstream-media that should be addressed, by bulletproof forum-site, to let point 4 works well.\n\nMaybe this is just out of topics,\nsorry for my broken english.",
				"added": 1560533192
			}
		],
		"1560304454_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 7,
				"body": "You need philosophy to balance religion",
				"added": 1560534202
			}
		],
		"1560710420_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 9,
				"body": "Next Reset = Black Swan Event,\n+You can predict nothing - this era, every case is unprecedented\n+But it might be worse considering the political tension in the world",
				"added": 1560721488
			}
		],
		"1559028625_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": [
			{
				"comment_id": 10,
				"body": "Is there any info how to make stereo to mono in a video using ffmpeg?",
				"added": 1560795655
			}
		],
		"1560835926_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD": [
			{
				"comment_id": 11,
				"body": "> [duende](#comment_85_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, moron.\n\nTeach me how to be a good barbarian senpai",
				"added": 1560919301
			}
		],
		"1560995957_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 12,
				"body": "to learn islam is read qur'an and understand it's teachings, btw to give a title referred to a video about tulsi gabbard you made me freeze for a second.\n\nBtw I want to violate rule here, since this is only can be done using YT: \nhttps://www.youtube.com/channel/UCx76ixH7qXAUTusATvICXpg/search?query=shia\nhttps://www.youtube.com/channel/UCx76ixH7qXAUTusATvICXpg/search?query=sunni\n>at least you can see url clearly\n\nLearn Islamic Terrorist better through christian apologetic (specifically: vs Islam), I assure that you can find unbiased  perspective from that. Muslim will lie (taqqiya) if you ask them. \n\nAlso there's a verse about that: https://quran.com/8/12\nإِذْ يُوحِي رَبُّكَ إِلَى الْمَلَائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُوا الَّذِينَ آمَنُوا ۚ سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُوا الرُّعْبَ فَاضْرِبُوا فَوْقَ الْأَعْنَاقِ وَاضْرِبُوا مِنْهُمْ كُلَّ بَنَانٍ - 8:12\ntranslate on web: [Remember] when your Lord inspired to the angels, \"I am with you, so strengthen those who have believed. I will cast terror into the hearts of those who disbelieved, so strike [them] upon the necks and strike from them every fingertip.\"\ntranslate by google: Your Lord will suggest to the angels that I am with you, and establish those who believe. I will raise in the hearts of those who disbelieve the terror, and strike upon your necks, and smite them all with children.\n> notice the difference, always translate qur'an verse twice using google's one or another mode\n\n... and look false interpretations to cover-up the their oopsies: \nhttps://discover-the-truth.com/2014/09/29/quran-812-i-will-cast-terror-into-the-hearts-of-those-who-disbelieve-therefore-strike-off-their-heads/\n\n.... When we get to read the verses in its context, does it promote the killing of innocents? The answer is NO! Even when Muslims were being persecuted by the mighty army of Quraish, God Almighty encouraged Muslims to offer peace if they, the enemy stopped hostilities against them (Muslims) ...\n\nThat's the teachings, look the meaning, it's not about 1 time teachings but that's Muhammad's eternal teachings. Terrorism is born through the prophet. :)",
				"added": 1561089987
			}
		],
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 13,
				"body": "Truth is .... Taking quote from James Corbett, truth is only known its really true or not only in the end of times. Better to seek freedom so that we can achieve truth.\n\nIf there's a light there's a darkness, we veil ourself to take care of our sanity. Write what's common sense that truly inside of our mind and avoiding to be beaten by mind-engineering-algorithm via technocracy. Who cares they called us as ghouls if we can keep our clear mind by writing.\n\nExpect smear-merchant will attack ZN in near future. Don't forget they never attack youtube for protecting pedhopiles. What's on progress? They're now is accelerate the disabling of economic to many journalist & content-creators because chaos will come but internet can't be suspended (bread and circus).",
				"added": 1561090461
			}
		],
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 14,
				"body": "If you're in surveillance state better to always use facade: \n1-3 real seen connections to random websites (which is 'logical' for a long time browsing)\nother (real one) as encrypted connections\n\n+ use dnscrypt to hasten your load avoid dns hijacking\n+ use startpage.com as it will encrypt the search query | you can load url anonymously there.",
				"added": 1561091049
			},
			{
				"comment_id": 15,
				"body": "Also you can try, buy 1 flashdisk 32gb, then try to install linux (ubuntu mate 18.04 amd64 is good) on pendrive (not as live cd) and use them as daily driver. Install vpn and crucial data there. Easy and quick to hide.",
				"added": 1561091559
			}
		],
		"1560968142_1GnMepQGSHSi7yBqqi86T65hRgon3KyJtS": [
			{
				"comment_id": 16,
				"body": "> [mg0](#comment_57_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I won't go on talking about how christians profess love and stuff while their god is/was so blood-thirsty over the aeons. Afaik, the bible has a visible separation in two called the old and the new testament which, if I've been told properly, comes from the 'change of lead' from God (say, the god of christian religions) to Jesus the Christ which is the True Son of God (and God itself among other things) and who changes everything to be way less war-military and more hippie-like (Pardon everyone as many times as need, if someone slaps your cheek show the other one, etc ...). [...]\n\nYou need to read qur'an for savageness. I mean maybe there's calling to destroy in c̶h̶r̶i̶s̶t̶i̶a̶n̶i̶t̶y̶ (((judaism))) but never a plus with torture and rape (like in the most 'peaceful' religion on earth: Islam). \n\nlisten to https://invidio.us/watch?v=tYGW5vHM5XY as of why there's seemingly violence in bible, muslim always attack this 'in respond' of their eternal-violence-calling by Muhammad (muslim rarely answer, they just respond).\n\n> [reeeeeeeeeeeeeee](#comment_11_1MutjWS9dBUHWpg67kCVznJn2uG3z4n8Rr): You seem shocked. Is it because these things might actually have happened, or because these things are regarded as holy scripture by billions of people, or both? [...]\n\nAs of the link of bart ehrman for the demand 'zoomed-in-detailed-version', I've read it. And he's pointing the discrepancy or archaeological (((call of authority))) to further strengthen his argument. I know it's written in 2013, the time before Donald Trump can imagine himself to call \"Fake news\" but if there's no direct photos, referral book and documentary about that maybe it's not worth of me (or us) to gamble the faith.\n\nMy attitude to a religion is better to prove it in quantum-physics-theoretical-way or in philosophical-moral-discourse than to proof to the root core physical, as I'm not Rothschild who have so much of passive income. As pragmatist as it's, better to keep society in peace than to be in suspense afraid if there's suicide bomber spawn next to you at any time. Also if God is exist, just ask him to prove to you as another sentient-being (not a merely delusions), as simple as that.",
				"added": 1561092903
			}
		],
		"1561124344_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 17,
				"body": "Let me put some random thought: \n+ Do Rothschild or Rockefeller still a citizen, and why? \n> I don't know the details but I suspect they're (despite their bank accounts) still a citizen.\n> Because without good and loyal soldiers, everything you declare are for naught, (((power is law))).\n> So long as magic yet invented everyone will need everyone else\n\n+ I like the speeches of Yanis Varoufakis, he often emphasizing about nowadays (compared to historical ages) politics doesn't have a concrete power. That's why politics often bought by 'the merchant' because politician is in its weaker (or even weakest) form right now than in the past.\n> In the past people's career rising up from a military, and politics also means having private soldiers + connections to noble's bloodline dynasty. Lastly worth to consider in the past, gold was always safe in the king's vault. Now? Even random single soldier could have a possibility to hold 3 humongous kingdom's vault of gold using a bank notes. Law is more and more liberal.\n\nAbout \" ... that these movements were created and were not related to anything spontaneous ... \" of course, humanity is existential. Human exist outside not only to his/her inside, it's either people bend to ur own will or you bend to people's will. Chaos and order are only the romance we see.",
				"added": 1561184812
			}
		],
		"1561187203_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD": [
			{
				"comment_id": 18,
				"body": "> [uuuuuu](#comment_1_17SMqmrxtMGcem3hpoQ35bi48E4TWeS5p6): People much too easily succumb to pressure, or possibly blackmail. I know of at least one person who had a Cocoscope though never visited that site myself. Bitchute is controlled as well I've seen channels and videos be deleted on there and they are registered in London, not the best area you can be in. Censorship is everywhere and will get worse and worse, the worst part is that you don't know what's being censored. :'( [...]\n\nyeah... I think only ZN type overlay network who will survive in that storm in near future.",
				"added": 1561216555
			}
		],
		"1561215507_17SMqmrxtMGcem3hpoQ35bi48E4TWeS5p6": [
			{
				"comment_id": 19,
				"body": "I more concerned about the sauce :D",
				"added": 1561216600
			}
		],
		"1561219511_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 20,
				"body": "Truth and money never walk side by side. \n\nBtw guys, imagine if crypto in the end is just an empty check. Every where, every new scheme they promised crypto if we're going to their side supposedly creating contents and attract users. When I realized this I just pick the platform/crypto with most user available as humans is the center of the reality. Can't put my eggs to 10.000 baskets.",
				"added": 1561281270
			}
		],
		"1561288542_14hmCEXpoVdYQqeve93LpieDx2k8aFyT66": [
			{
				"comment_id": 21,
				"body": "Maybe out of topic, \nBut imagine new era with total surveillance system in which IoT are mandated to put in every house available. imseeyou.apk must be installed in android. antinaughty OS must be your operating platform etc. Wrong words 10 years ago could be used to punish you today etc. \n\nin the new era: true reality is your mask, 'your mask'/anon-id in darknet like this will be ur reality. You're called by Mr.Robot or Mr.Dank etc. Your avatar is your soul. In the real world all you do are all just facade to satisfy government and society, but the real thing of you are expressed written in darknet. It's not about porn, drugs, etc. Even porn and drugs can't achieve the top most pleasure that human need.\n\nWe're going there, training here for transitions.",
				"added": 1561326268
			}
		],
		"1561325952_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 22,
				"body": "+ It smells like multi level marketing scheme, you're lured by the humongous benefit with a little effort but then in the end the pay-out is fuzzy, the system still new, complicated and everything new demands victims :D\n+ Also they're forgetting the real reasons of why social media exist, it's not about to create money/coin, but to talk & communicate to each others. I think those social media will fail, except minds.com. Plus people would only migrate to Island in which have decent populations, not others with full facility but no people.\n+ Then last but not least, although crypto-coin is new and attractive but it doesn't mean could easily bypassing government and fiat currency in the real world. Only coin with the most user & not violating 'decentralization-principle' will prevail.",
				"added": 1561327210
			}
		]
	},
	"comment_vote": {
		"4_19mAuNGqnePcvAmLuq6856A4PNY5MdySsc": 1,
		"4_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"54_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"88_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"4_13w8Qs6be4zmpf7S41f8DuL7PrKqn7ma1S": 1,
		"800_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"5_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1_12geqRc1Rut17RTkX3gxMYSujKdUNwP68R": 1,
		"291_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_17SMqmrxtMGcem3hpoQ35bi48E4TWeS5p6": 1,
		"28_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}