{
	"next_topic_id": 26,
	"topic": [
		{
			"topic_id": 1592839559,
			"title": "Youtube?",
			"body": "Czy ZeroNet ma coś podobnego do Youtube?\nI fundamentalne pytanie: Jak w przypadku np takiego Youtbe-podobnego produktu ma się cenzuda XXX?\nChciałbym używać zamiast YT czegoś innego, ale boje się o materiały XXX (mam dzieci)",
			"added": 1592839558
		},
		{
			"topic_id": 1594290989,
			"title": "Nowa grupa/strona",
			"body": "Jak utworzyć taką nową stronę jak np ZeroTalk Polska?",
			"added": 1594290987
		},
		{
			"topic_id": 1595401739,
			"title": "Alternatywa dla ZN",
			"body": "Trzepiąc internet znalazłem stronę alternatywną dla ZeroNet.\nNie jest to oczywiście odpowiednik 1:1, ale na tą chwilę skupię się na tamtej stronie, ponieważ tam wszystko działa. Tzn youtube dziala, wszystko się wczytuje.\nDodatkowo tam można sobie dorobić, bo wszystko jest opartę o kryptowalutę.\nZeroNet oczywiście cały czas wspieram, nie opuszczam.\nZainteresowanych zapraszam tutaj https://lbry.tv/$/invite/@fornakter:a",
			"added": 1595401736
		},
		{
			"topic_id": 1599395958,
			"title": "Opieka medyczna - naziści",
			"body": "Chciałbym poinformować wszystkich, którzy aktualnie tak rzetelnie opiekują się nami, podczas \"pandemii\" - jesteście jak ci naziści, ktorzy wykonywali polecenia Hitlera.\nSzkodzicie społeczeństwu, kaleczycie ich, doprowadzacie do zgonów. Wszystko robicie ŚWIADOMIE.\nJestem tego pewien na 100%.\nŚwiat was z tego rozliczy.",
			"added": 1599395954
		},
		{
			"topic_id": 1599924496,
			"title": "Protest w Warszawie 12.09.2020",
			"body": "Dzisiaj odbył się protest przeciw covidowy w Warszawie.\nNiby ludzi z każdym protestem przybywa, ale wg mnie dalej za mało.\nCzy ludzie aż tak dalej ufają debilnej władzy i boją się \"plandemii\"?",
			"added": 1599924491
		},
		{
			"topic_id": 1600262768,
			"title": "Bezkarność+ Gdzie jesteście PiSowcy?",
			"body": "Chciałbym się dowiedzieć, czy są tutaj jacyś PiSowcy. Pokażecie się? Czy schowacie głowę w piach?\nTeraz PiS was wy**cha w d**y bez mydła tak, że się zesracie.\nGdzie wasze mądrości co do praworządności tych złodziei, dyktatorów.\nGdzie są ci, co na ulicy chodzą w maseczce. Ci co jeżdżą sami w samochodzie w maseczce. To pokazuje wasz poziom IQ.\nMam nadzieję, że do was PiSowska milicja zapuka jako pierwszych.",
			"added": 1600262762
		},
		{
			"topic_id": 1600583969,
			"title": "5G i filtr",
			"body": "Co filtruje fale 5G? Przez co nie przechodzą?",
			"added": 1600583962
		},
		{
			"topic_id": 1601719088,
			"title": "Trump w koronie",
			"body": "Chyba Trump za bardzo się starał covidowi, to go \"zachorowali\" :D\nPodobnie było z jakimś brytyjskim urzędnikiem, nie pamiętam jak on się nazywał.\nO dziwo kaczora nic nie tyka, ani szumowiny na wakacjach. Przypadeg? Nie sondze.\n\nPS. Jak tam przygotowania do drugiej fali? Politycy już gotowi, tylko szkoda, że lekarze nic nie wiedzą.",
			"added": 1601719080
		},
		{
			"topic_id": 1602350815,
			"title": "Szpiegowanie telefonów",
			"body": "Szukam więcej informacji na temat szpiegującego programowania Pegasus.\nOgólnie to jestem bardzo ciekaw, ile informacji w tle Google i Apple przesyła o nas w tle.\nTak naprawdę to te systemy są już tak rozbudowane i skomplikowane, że cieżko w to uwierzyć, że nie szpiegują.\nZresztą podobnie jest z Windows 10, który ciągle się zmienia i tak naprawdę, zanim ktoś znajdzie coś szpiegującego to wprowadzają aktualizację.",
			"added": 1602350806
		},
		{
			"topic_id": 1605552425,
			"title": "2021 - Koniec tego co znacie.",
			"body": "Myśleliście, że 2020 był straszny? \nSpokojnie, 2021 będzie jeszcze gorszy.\nKaczor? Morawiecki? To pionki.\nNad nimi siedzi Bill Gates. Oni wykonują polecenia. Zamordowanie ich nie zlikwiduje problemu.\nHitler też był pionkiem, tak samo jak B.G.\nSzykujcie się na wojnę domową, wojnę światową, masowe groby.\npotkamy się w 2022 na tamtym świecie.\nDo zobaczenia.",
			"added": 1605552415
		},
		{
			"topic_id": 1608051891,
			"title": "Tajemnica Fatimska",
			"body": "No i co z tą przepowiednią? Ktoś wie jak brzmi? \nOgólnie to uznaje za totalną bzdurę i manipulację. Skoro inne się sprawdziły, to wychodzi na to, że i ta ukryta się sprawdzi.\nSkoro ma się sprawdzić, to czemu się na nią nie przygotować?\nCzy to raczej będzie na zasadzie: jak minie ta data, coś się stanie, to wtedy tam wpiszemy, że to to.",
			"added": 1608051880
		},
		{
			"topic_id": 1608998976,
			"title": "Krzeslo Lakhowskiego",
			"body": "Ostatnio trafilem na temat krzesła Lakhowskiego. \nJednak nie rozumiem jego działania.\nCzy może mi ktoś łopatologicznie wytłumaczyć jak to działa? Tzn co to za fale, albo do jakich fal jest podobne.\nCzy jest możliwość zrobienia takiego krzesła w warunkach domowych?",
			"added": 1608998964
		},
		{
			"topic_id": 1609346983,
			"title": "Torrenty",
			"body": "Jaką stronę z torrentami poleciacie?",
			"added": 1609346970
		},
		{
			"topic_id": 1609762064,
			"title": "Co z ZeroNet'em?",
			"body": "Czy ta sieć się rozwija? Go odpowiada za ewentualne błędy? Wygląd? \nOdsuwam boczny panel i widzę \"Połączony: 9\" to oznacza, że 9 osób utrzymuje sieć?\nKim są osoby(?) Onion?",
			"added": 1609762050
		},
		{
			"topic_id": 1610376246,
			"title": "Polecam filmik wstawiony dzisiaj. Nowy porządek.",
			"body": "Nowy Porządek Świata skasowany! Horror, który czeka ludzkość. Youtube PL (ZN). Z normalnego Youtuba pewnie zniknie za klika godzin.\n\nhttp://127.0.0.1:43110/15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h/?watch=1610375932_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY\n\nPS. Nie wnikam, kto to nagrał, nie jestem ani za ani przeciw, chodzi mi tylko o to, o czym mówi.",
			"added": 1610376231
		},
		{
			"topic_id": 1610822859,
			"title": "Trump",
			"body": "Cześć.\nCzy może mi ktoś streścić temat Trumpa i jego banów?\nJaki był powód? Czemu tak się stało i oczywiście interesują mnie też nieoficjalne wersje.",
			"added": 1610822843
		},
		{
			"topic_id": 1611995160,
			"title": "Instalacja Linuxa",
			"body": "Utworzyłem nowy temat, żeby nie robić mieszanki w jednym\nChciałbym zainstalować Linuxa NA pendrive.\nNie Live CD, tylko instalacja na penie.\nWiem, ze jest to możliwe, bo już raz tak zrobiłem. Tylko że pen był 16Gb i USB 2.0, więc prędkość działania jak i pojemność pena nie pozowlały na normalne uzytkowanie systemu.\n\nKupiłem 64Gb USB 3.0, ale miałem już problem z instalacją. Podczas tworzenia partycji Linux dosłownie rozwalił pena. Nic się nie dało z nim zrobić.\n\nZ posta \"Co to jest Linux-fx\" wyczytałem, że najlepiej zainstalować Debian 8.\nZ tego co nalazłem na stronie \nhttps://www.debian.org/releases/jessie/debian-installer/\ndużo jest wersji.\nCzy ja mam wybrać amd64?\nCzy żeby zainstalować musze pobrać wszystkie obrazy CD/DVD?\n\nPS. W moim laptopie nie mam czytnika CD/DVD",
			"added": 1611995143
		},
		{
			"topic_id": 1612974506,
			"title": "Media bez wyboru :D",
			"body": "Media bez wyboru, debile bez \"Trudnych spraw\" :D\nChciałbym tylko przedstawić drugie dno całej sytuacji.\nMedia, takie biedne, bo chcą ich opodatkować, płacz bardzo ;(\nPotem będzie, że wygrali, że wywaliczyli\nOni som fajni, bo wygrali, trzeba ich oglondać.\nJa pierdole, ludzie to debile.",
			"added": 1612974488
		},
		{
			"topic_id": 1614277389,
			"title": "Messenger FB",
			"body": "FB znowu jakies testy robi? :)\nA może to jest na zasadzie: zobaczcie, jacy jestescie bezradni bez messengera.",
			"added": 1614277370
		},
		{
			"topic_id": 1614797718,
			"title": "Nowy porządek a kryptowaluty",
			"body": "Wszyscy wiemy, że aktualna sytuacja doprowadza do upadku tego co znamy - systemu finansowego.\nZa kilka lat, wszystko ma być płacone \"online\", inwigilacja 100%, zero gotówki. \nJakie może mieć miejsce w tym świecie, świat kryptowalut?\nZaznaczam, że chodzi mi o RASOWE kryptowaluty, czyli zdecentralizowane, z otwartym kodem. Waluta, którą mając na portfelu offline, jest tylko Twoja. \nOgólnie temat  kryptowalut znam dobrze, ale daleko mi do eksperta. \nZ tego co je znam, jest w nich szansa, na odłaczenie się od kontrolowanych pieniędzy.\nChciałbym poruszyć ten temat, proszę o sensowne i logiczne wypowiedzi.",
			"added": 1614797698
		},
		{
			"topic_id": 1615661591,
			"title": "5G i covid.",
			"body": "Zapraszam do zapoznania się z filmem i - jak zwykle - do merytorycznej dyskusji\n\nJeżeli takowa jest potrzebna.\n\nhttps://www.bitchute.com/video/rYq3mYxlHhsi/?fbclid=IwAR1hgRZKbfH0IWY_4egsUC0plY7Dy7xNfsPvnmfRgdD9zIieFqCL-XRJjAY",
			"added": 1615661570
		},
		{
			"topic_id": 1616400315,
			"title": "A polacy dalej w śnie zmowym",
			"body": "https://www.youtube.com/watch?v=4Vq7S3N0YTs",
			"added": 1616400293
		},
		{
			"topic_id": 1616836050,
			"title": "Dubaj",
			"body": "Czy zna ktoś może REALNĄ sytuację covidową w Dubaju? Wydaje mi się, że ten kraj ma silny głos w sprawach globalnych.\nCzy oni też wprowadzili covid? Czy jednak się postawili? Przecież nie wyobrażam sobie, że ktoś do nich przychodzi o mówi \"Macie tutaj 30mln euro, wprowadzcie covid\" bo by ich wyśmiali.\nCzyli jak wprowadzili, to znaczy, że też biorą w tym udział.",
			"added": 1616836027
		},
		{
			"topic_id": 1620816778,
			"title": "To wszystko to teorie spiskowe!",
			"body": "Jest wirus, zabija, a oto dowody!\nhttps://www.youtube.com/watch?v=SF6Ev_EXg9w",
			"added": 1620816754
		},
		{
			"topic_id": 1629535835,
			"title": "Lewy paszport covidowy",
			"body": "Zna ktoś jakiegoś lekarza, który wystawi lewe zaświadczenie, że szczepionka jest przyjęta?",
			"added": 1629535810
		}
	],
	"topic_vote": {
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"1614911443_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": 1
	},
	"next_comment_id": 121,
	"comment": {
		"1592306794_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 1,
				"body": "Świetnie wszystko opisałeś.\nOd zawsze mówię, że PiS o PO to to samo, ale co ja tam się znam...",
				"added": 1592838858
			}
		],
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": [
			{
				"comment_id": 2,
				"body": "Ja tutaj jestem nowy, nie ogarniam jeszcze do końca co gdzie klikać. Myślę, że prostota w obsłudze ma tutaj duże znaczenie",
				"added": 1592838999
			},
			{
				"comment_id": 3,
				"body": "Już nawet tutaj się musimy żreć między nami?\nJak i na FB tak i tutaj znajdą się w końcu instytucje/ludzie, ktorzy beda chcieli zlikwidować te \"podziemie\".\nZnajdą się ostrzy hejterzy, spamerzy itp.\nJak wtedy sobie z nimi poradzić? Jak odróżnić debila od debila wysłanego przez rząd?",
				"added": 1593604480
			}
		],
		"1592839559_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 4,
				"body": "> [driud](#comment_52_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): fornakter → Masz tutaj, dwa YouTube, - Takie dostały nazwy; Trochę nierozważnie. Drugi to ,\" YouTube PL\". Tutaj masz tylko sprawdzone i pożyteczne materiały. Dotyczace zdrowia, techniki, historii, budowy człowieka, kościoła, i polityki.Trafisz tam, po przez , ZeroSites, → kliknij gwiazdkę, kliknij napis, → zainstaluje się tobie w spisie. Jeśli masz pytania to pytaj? Postaram się odpowiedzieć. Jest tam 350- wybranych fimów, / selekcja /. Dzieci mogą ogladać. Niema tam śmieci porno, itp.\n\nA jak zrobić minaturkę niestandardową?",
				"added": 1593604788
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 5,
				"body": "Czemu po raz 12?",
				"added": 1593632206
			},
			{
				"comment_id": 6,
				"body": "Super wypowiedzi - wszystkich.\nAle wracam do głównego wątku, bo chyba uciekliśmy trochę od niego w innym kierunku.\nCo z tymi plikami? Może mi ktoś wyjaśnic, żebym nie popełniał jego błędu?\n",
				"added": 1593632969
			},
			{
				"comment_id": 7,
				"body": "@druid - gdzie się sprawdza ile jest akutalnie osób?",
				"added": 1593684699
			},
			{
				"comment_id": 8,
				"body": "Wow, nie wiedziałem o tym menu z boku :D\nOgólnnie to spoko sprawa ten ZN, ale widzę, że jeszcze dużo roboty tutaj czeka...",
				"added": 1593696888
			},
			{
				"comment_id": 9,
				"body": "szybie pytanie - co to w tych statystykach jest \"Onion\"?",
				"added": 1593766627
			}
		],
		"1565086389_1JZcGPhLfmeACHEXu4R16hrU2Rz6wBgYoY": [
			{
				"comment_id": 10,
				"body": "Popieram, ten system powinien być zakazany globalnie. To prowadzi kontroli w skali Europy, a ktoś już tak chciał zrobic...",
				"added": 1593767003
			}
		],
		"1594290989_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 11,
				"body": "> [driud](#comment_59_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Zajrzyj na ZeroWiki Polska. Tam jest trochę opisane na ten temat jak sklonować. Potem możesz to zmodernizować. Jeśli wiesz o co chodzi, / bezpieczeństwo /. Zrobienie strony, to jedno; a drugie to zrobić by była bezpieczna. Samo klonowanie, to dosyć prosta sprawa. Ale ta druga cześć, to już nie koniecznie.\n\nMożesz rozwinąć temat bezpieczeństwa? Jestem tutaj nowy i dopiero się uczę co i jak.",
				"added": 1594367621
			}
		],
		"1576790901_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 12,
				"body": "A można było nazwać ZeroTube :D",
				"added": 1594368430
			}
		],
		"1594760103_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 13,
				"body": "Jak postawić taki blog?",
				"added": 1594922563
			}
		],
		"1595401739_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 14,
				"body": "> [adam123](#comment_5_1JBU6gqPYoNmpeTw9JMurELPAFxCQ3CsmC): To nie jest alternatywa dla ZeroNeta. Dlaczego? Bo posiada serwer i chce moje dane ; Adres poczty mailowej. Kolego wypchaj się tym wynalazkiem. Ja chciałbym być w miarę anonimowy + wrzucone materiały / nieśmiertelne /. Nie wiem kim jesteś? ale propozycja jest wypaczona. Ja nie skorzystam z tego wynalazku; pozostanę przy ZeroNecie. Inwalida, bo inwalida; ale wolny od Cenzury. / no może sobie cenzura poczytać w w wolnych chwilach z pożytkiem dla siebie /.\n\nO, wyszła yntelygencja. \nWypchaj się takimi wypowiedziami. Goole wie o tobie i tak więcej niż ci sie wydaje, a tutaj się znalazł wielki anonymous.\nChciałbym tylko dodać, że to co znika z YT bez problemu się utrzymuje tutaj, nie ma cenzury bo jest tworzone przez ludzi a nie korporacje. Ma otwarty kod źródłowy i jest zdecentralizowany.\nTak więc zanim zaczniesz tak ambitnie komentować zapoznaj się lepiej z tematem.",
				"added": 1595405787
			},
			{
				"comment_id": 15,
				"body": "@kapec tworzone przez ludzi tutaj znaczy co innego niż w przypadku YT.\nCo do banów: nie znam tej strony aż tak dobrze, żeby się wypowiedzieć w temacie Twojego bana, ale znam dużo ludzi, którzy mieli usuniete/zbanowane konto na YT a tutaj sobie zyją swobodnie. Dział XXX mówi sam za siebie.\nPunkciki a kryptowaluty to dwie rozne sprawy. Zgaduje, że nie znasz tego tematu, ale mogę się mylić.",
				"added": 1595439992
			},
			{
				"comment_id": 16,
				"body": "Jak to ma się do tematu?\nW/w strona działa i nie ma taz takiej cenzury jak na Youtube, dlatego uważam, że jest warta uwagi.\nZeroNet? Zostaje tutaj, wspieram, czekam aż się rozwinie do takiego poziomu, żeby wciągnąć Youtube, jestem za tym.\n\nTemat googla. Ciekawe jak NIE chcesz uzywać ich aplikacji :D Ile telefonów na rynku nie mają Androida? To, że ustawisz w aplikacji \"nie zezwalam na dostęp do plików na telefonie\" nie oznacza, że Google nie wchodzi w dane.  To oni rozdają karty.\nIOS? Nie miałem, ale nie dam sobie ręki uciąć, że nie szpiegują. Wręcz byłbym zdziwiony (mocno) jak by tego nie robili.",
				"added": 1595521386
			},
			{
				"comment_id": 19,
				"body": "> [plonacy1perun](#comment_4_15UPxFMtZojHw5JYJs9JQQ11kNa8Xn7YB4): Porażka myślenie.\n\nPorażka wypowiedz",
				"added": 1599591088
			}
		],
		"1598206333_19ffx3PUJM1UJsgBRQR3j1nM2MR1ESdwcE": [
			{
				"comment_id": 17,
				"body": "> [driud](#comment_74_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Panowie przestańcie bujać w obłokach; Cały czas chodzi o to, żeby nie używać open source.  To podstawa tego założenia. Macie być kontrolowani przez 24-godziny. Tylko nieliczni zapaleńcy szukają na własną rękę, czegoś na zastępstwo. Nie próbujcie; / takie powiedzenie /,  Panu Bogu świeczkę, a diabłu Ogarek.Bo to nie będzie nigdy funkcjonowało. Trzeba się zdecydować; Czy wybieramy, - BOGA,  czy - DIABŁA..  jak gmail sam usuwa spam?    A dlaczego nie używasz poczty Linux-owej? Tam niema spamu i reklam..  Po co seedować film na torrentach, jak można wgrać na youtube?  Tylko to co jest na Torrentach, to nigdy nie będzie na TUBIE.  / taki mały mankament /. Ja cały czas wyobrażam sobie appkę na smartfony, w której społeczeństwo na złość rządowi przesyła sobie niewygodne artykuły,  Nie po to stworzono, srajfona abyś mógł sobie przesyłać co tylko zechcesz. To co jest robione to jest długofalowa operacja, rozciągnięta w czasie.. TO JEST GOTOWANIE ŻABY.Masz nie zauważyć; że jesteś ugotowany. Taki jest ostateczny Cel.\n\nDokładnie, rewelacyjnie to ująłeś. \nUżywając Google używasz... internetu Google, a nie... internetu :)\nTaka prawda.\nI podobnie jest w przypadku Windowsa i oczywiście Androida. Wszystko jest w zamkniętej \"kuli\" i tam masz siedzieć. Oni decydują jakie informacje do Ciebie przychodzą i co masz czytac. Czyli praktycznie to co robi TV, tylko tutaj wydaje się Tobie że czytasz to co chcesz. A w przypadku TV wiesz, że ogldasz to co musisz a nie to co chcesz :)",
				"added": 1599396431
			}
		],
		"1599395958_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 18,
				"body": "> [driud](#comment_78_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Do tej pory nikt nie został rozliczony. Zakładam, że tak dalej będzie się działo, aż do końca świata. Dlatego śmieją się nam w prosto w nos.\n\nNa świece coraz więcej buntów. W Polsce dalej cisza...",
				"added": 1599568084
			}
		],
		"1599924496_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 20,
				"body": "> [driud](#comment_80_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Władza nie jest debilna; To są farbowane lisy, / azylanci /. Zgodnie z tysiąc letnią tradycją, jak pastwisko pozostanie bez trawy i wody, czytaj / bez możliwości wyrwania kasy / . To się przeniosą na inne pastwisko. Od zawsze tak robią, od kiedy istnieją. To są  ludy wędrowne, Wypasanie łatwowiernych owieczek to ich specjalność.Ludzie = owieczki, które wierzą w  czarnego wilka, który ich pożre na śniadanie. Pasą się tłumnie w jednym miejscu, a strach niemożliwy ich    zżera, Czego się boją?  To już zdążyli zapomnieć, było to tak dawno temu. Teraz się boją cały czas, tak na wszelki wypadek. Owieczki nie wiedzą, że pojadą na wycieczkę do Rzeźni. Główny pejsaty i brodaty pasterz obiecuje im niemożliwe atrakcje. / puszczenie krwi na żywca/. Biedne nie mogą się doczekać, kiedy je zaszczepią przeciw głupocie i załadują do bydlęcych wagonów. Każda owieczka dostanie numer identyfikacyjny,  czyli  / czip /.I od tego momentu jest już na dożywotnim urlopie, który się zakończy w ubojni koszernej. Tak żeby było \"GIT\".Wszyscy będą zadowoleni i szczęśliwi. Najbardziej będzie zadowolony kierownik ubojni, który mnóstwo szekli dostanie. Proszę się nie pchać do wagonów; miejsca starczy dla każdego, a jeśli będzie potrzeba podstawimy nowe wagony.\n\nCiekawe ile nas zostanie po tym holokauście. Hitler to pewnie przy B.G. to pikuś.\nB.G. chciałby wybić pół planety i śmiało o tym mówił.",
				"added": 1599995765
			}
		],
		"1600583969_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 21,
				"body": "> [sasza](#comment_19_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB): Ograniczyc uzywanie, a najlepiej nie uzywaj. 4G- tobie wystarczy. tez sie we lbie gotuje.\n\nA w czym to pomoże? Ja na 3G cały czas siedzę.\nTo, że nie będę uzywać, to nie oznacza, że fale nie będą sobie latać wszedzie?",
				"added": 1601200958
			}
		],
		"1601719088_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 22,
				"body": "> [driud](#comment_84_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Chyba Trump za bardzo się starał covidowi, to go \"zachorowali\".Wiesz co to jest teatr Lalek? To jest przedstawienie dla mas. Jak można na coś zachorować? Jeśli tego czegoś  niema. Tenisówek prowadzi grę wyborczą, i ma dużo poważnych przeciwników, / zabójców, morderców /. Więc unika niepotrzebnych spotkań.  / jak załatwili Kenediego?, też się nie zgadzał, /.  Podobnie załatwili Kaczyńskiego; / bo się też nie zgadzał /. Wybrali tego który się zgadzał. Polityka to jest rzeźnia, występuje tam rzeźnik i baran.Pomijam inne aspekty polityczne . Koniokrady nie przebierają w środkach. Tego uczy Historia.\n\nWiem o tym, nie jednego usunęli, bo przeszkadzał.",
				"added": 1601803117
			}
		],
		"1602385407_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 23,
				"body": "Ale przecież to nie tyczy się tylko Polski ale i całego świata. Wszędzie stosuje się lekarstwa, które nie leczą, tylko zaleczają. GMO stosuje się nie tylko w Polsce. Tak samo z chemikaliami, nawozami itp.\nSieci \"G\" są cieżkim tematem, bo cięzko znależć rzetelne źródło informacji na ten temat.\nTak samo jak z jonizacją powietrza od elektryczności. Rozmawiałem z osobą, która współpracowała z monterami wysokich napięć. Pracowali po 20 i więcej lat przy wysokich napięciach, zero problemów ze zdrowiem.",
				"added": 1602445567
			},
			{
				"comment_id": 25,
				"body": "> [driud](#comment_86_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Temat nie jest wcale  ciężki,  To kwestia gdzie szukamy tej \"Wiedzy\". Rejon naszego zamieszkania jest mocno ograniczony przez Cenzurę. Są miejsca gdzie można coś niecoś znaleźć. Ujawnienie tego miejsca powoduje, jego natychmiastowe zniszczenie, / zlikwidowanie /... Musimy pamiętać, że wszystko jest kontrolowane, / każda wypowiedź, i kto to mówi? /.  I zostaje  niszczone w przypadku zagrożenia.  Jak można tam dotrzeć? do tych stron? Do tych wiadomości?  Potrzebna jest zmiana myślenia, jak i stosowanego oprzyrządowania. Potrzebny jest cały zestaw narzędzi. Ale pozostaje cały czas nasz sposób myślenia. Potrzebna jest Wiedza z dziedziny, szpiegowanie, włamanie, zabezpieczenie. Ta wiedza pozwala znaleźć dziurę w tym systemie, aby wymknąć się  spod-kontroli. Wtedy można zacząć  bezpiecznie podróżować po świecie Wiedzy. / tej prawdziwej /.pozdr.\n\nDlatego jestem tutaj. Gdzie wiedza i prawda potrafi ujrzeć światło dzienne. \nZnam \"złe miejsce w internecie\" gdzie pewnie dowiedziałbym się wszystkiego na ten temat. Ale to nie jest dla mnie. Nie wiem czy moja rodzina by na tym nie ucierpiała.",
				"added": 1603102527
			}
		],
		"1602350815_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 24,
				"body": "> [cddd43hk](#comment_1_17tqEvyx1QiwVo6nbBe9F6UtWcPRzRUavU): zawodowo zajmuje sie tym tematem uniwersytet w toronto - https://citizenlab.ca/dziwne pytanie , bo pegasus nie słuzy do szpiegowania leszczyków i raczej ciebie nie dotyczyinfo o tobie to zupełnie inna historia , inne instytucje , inny sprzetjak chcesz , popros , opisze ci skad kto i co wie o tobie wszystko , dosłownie wszystko\n\nJak to skąd. Telefon, komputer i pewnie już nowe TV. Dostęp do informacji o nas jest bardzo prosty. Co więcej - sami na to pozwalamy.\nNajgorsze jest to, że nie ma alternatywy do oprogramowania na telefon. O ile na komputer możemy zainstalować Linuxa, to na urządzenia mobilne sytuacja jest patowa.",
				"added": 1603102245
			},
			{
				"comment_id": 26,
				"body": "> [kapec](#comment_35_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Jest przecież Replicant i LineageOS do tego są też alternatywy dla wszystkich \"usług\" googlowych\nAlternatywa dla Google Play? A to ciekawe.\nPoza tym te dwa OSy działają na garstce telefonów, nikt tego nie rozwija.\nJa mam w domu chyba z 10 telefonów, żaden z tych OSów nie obsługuje ich.",
				"added": 1604821165
			}
		],
		"1604953099_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 27,
				"body": "To jest najmniejszy problem. \nPoczekajcie na 2021, odechce wam się wszystkiego, wszystko zostanie wam zabrane. \nSerie samobójstw, masowe groby.\nSpotkamy się na tamtym świecie.\nPrzypomnicie sobie ten wpis w 2021r.",
				"added": 1605552171
			}
		],
		"1605552425_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 28,
				"body": "> [kapec](#comment_39_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I co niby Ci wielcy wyzyskiwacze zyskają jak skończą im się ludzie do wyzyskiwania?\n\nA skąd ja mam wiedzieć?\nZapytaj się tych, co chcą nas wsadzić w technokrację i wytępić pół świata, bo jest nas za dużo.\nTylko ciekawe czemu w kraju, w którym się narodził wirus już sobie z nim poradzili, co więcej, bez szczepionki.",
				"added": 1605683911
			},
			{
				"comment_id": 29,
				"body": "https://img-9gag-fun.9cache.com/photo/aXgOLNg_460svvp9.webm",
				"added": 1605696852
			},
			{
				"comment_id": 30,
				"body": "Do 2030 roku będzie wprowadzona technokracja. Aktualny system monetarny i socjalizm/kapitalizm nie bedzie istnial.",
				"added": 1606073898
			},
			{
				"comment_id": 31,
				"body": "> [sj29msn5kz0ldmn](#comment_1_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): ok moze to i prawda, ale podaj jakies przyklady, dlaczego tak uwazasz bo teorii o koncu wszystkiego bylo wiele i jak dotad dalej tu jestesmy...\n\nMówiąc w skrócie - internet aż kipi od tych inforamcji.\nBill Gates, człowiek, który był komputerowcem nagle stał się światowym \"królem\" zdrowia. Gdzie tutaj sens?\nSą artykuły w internecie, w których jest opisane ile osób zabił i okaleczył szczepionkami w krajach 3 świata.\nW 2009r oficjalnie wypowiedział się, że szczepionki to skuteczny sposób na depopulację planety.\nWykłady, na ktorych chwalił się wzorem, obliczeniami, w jaki sposób skutecznie wyeliminować ludzkość.\nW końcu nagrania, na których radośnie (tak, z uśmiechem na ustach i euforią) wskazuje na to, że będzie szczepić dzieci szczepionkami GMO.\nA kto jest nad Hitlerem XXIw. ?",
				"added": 1606673795
			},
			{
				"comment_id": 32,
				"body": "https://eprudnik.pl/bill-gates-szczepionki-jako-czynnik-depopulacji/",
				"added": 1606673824
			},
			{
				"comment_id": 33,
				"body": "A, i jeszcze niedawno się wypowiedział, że każde pokolenie będzie miało swoją pandemie. \nŻe co 20 lat trzeba będzie wszystkich szczepić.",
				"added": 1606673875
			},
			{
				"comment_id": 36,
				"body": "Jakiś błąd w filmie, muszę pobrać na nowo i uploadować",
				"added": 1606758129
			},
			{
				"comment_id": 37,
				"body": "> [driud](#comment_124_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Już ,H.Czerniak, funkcjonuje. seeduje go. Dzięki. Jest dwa razy większy od poprzedniego filmu.pozdr.\n\nBłąd był w samym pliku, nie włączał się w Windowsie. Pobrałem na nowo, tak jak mówisz, jest 2x większy i działa",
				"added": 1606816177
			}
		],
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 34,
				"body": "> [kapec](#comment_43_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Ja tam się zaszczepię chociażby dla samego dobra ogółu. No chyba że wcześniej sam zachoruje i wytworze własne przeciwciała to wtedy nie będzie potrzeby.\n\nMasz gąbkę zamiast mózgu. \nPierwsze podstawowe pytanie - czy przeżyjesz szczepienie.\nDrugie - Jak przeżyjesz, to ciekawe czy nie okaleczy cie to>\nOstatnie - nie okaleczy? Super! Nie staraj się o potomka. Stawiam katę piwa, że nie urodzi się zdrowe.",
				"added": 1606674215
			},
			{
				"comment_id": 35,
				"body": "> [kapec](#comment_43_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Ja tam się zaszczepię chociażby dla samego dobra ogółu. No chyba że wcześniej sam zachoruje i wytworze własne przeciwciała to wtedy nie będzie potrzeby.\n\nPomijając fakt, że nikt się nie będzie Ciebie pytać, czy masz przeciwciała. Będziesz MUSIAŁ się zaszczepić i tyle. Jak nie z jednego powodu to drugiego.",
				"added": 1606674257
			}
		],
		"1608039600_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 38,
				"body": "\"Ziemia jest płaska\"\nDziekuje, skończyłem czytać.",
				"added": 1608048867
			},
			{
				"comment_id": 45,
				"body": "Temat CO2 to jedno, i tak, jest jego za malo.\nTemat płaskiej ziemi, no cóż. Jest dużo przykładów wskazujących na to, że nie jest.\n\nPierwszy - odległy przykład. Inne planety w galaktyce. Wszystkie są kuliste, ruch obrotowy na to wpływa, tak samo księżyc, zawsze go widzimy okrągłego.\nDrugi - Skoro ziemia jest płaska, jak wyjasnisz roznice w godzinach? U nas noc, w Ameryce dzień? Na logike, skoro jest płaska to na całej ziemi powinien być dzień w jednym czasie. Weź zeszyt, włączoną żarówkę i oświetl tak, żeby na połowie było światło a na drugiej nie.\nNo i chyba ostatni przykład, bo już naprawdę nie wiem jak podejść do tematu. Wybierz się w podróż do okoła świata.\nPolska -> USA ->  Chiny  -> Polska\nCały czas będziesz się przemieszczać na zachód a wylądujesz w domu. Czary-mary?\nPS. Lecąc samolotem zobaczysz, że ziemia jest okrągła.",
				"added": 1608199333
			},
			{
				"comment_id": 46,
				"body": "Masakra, gdzie ja trafilem :/\nOk, ziemia jest płaska. Znajdz kogoś, kto wyśle zdjęcie z jej krawędzi. \nDziekuje, dobranoc.\n\nCo do leczenia, już też tutaj polecieliście. Farmakologia to nic innego jak trucie ludzi. Leczenie to ziołolecznictwo. Koniec tematu. Bez jakiś wymysłów  i pomysłów. Ludzie od dawna się leczyli ziołami i leczyli mnóstwo innych chorób, ktorych nasi lekarze nie są w stanie wyleczyć. \nDziekuje, dobranoc.",
				"added": 1608288908
			},
			{
				"comment_id": 47,
				"body": "> [driud](#comment_146_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): @fornakter; Jesteś bardzo nerwowy, nikt ciebie nie namawia, ani nie zmusza do zmiany swoich poglądów...Ale, zawsze możesz wysłuchać i obejrzeć filmy zebrane na YouTube PL. Zadam tobie taki proste pytanie? czy Ciebie nie zastanawia dlaczego ten normalny Tube, Wycina te wszystkie  filmy??? Jeśli są na wariackich papierach? to umrą śmiercią naturalną, prawda? a jeśli jest inaczej? Jeśli jest inaczej niż uczyli w szkole? Ja też chodziłem do szkoły, i mam jej nie mało; Tylko nigdy nad tym się nie zastanawiałem, tak samo jak Ty. I pewnie bym umarł z tą wiedzą, jaką mnie zaprogramowali, / czytaj /. Nauczyli... Ja też miałem dużo wątpliwości? Proste doświadczenia, które ja samodzielnie mogę ogarnąć. Zacząłem sprawdzać, i powstała coraz to większa konsternacja. Szkoła swoje, a życie swoje. A Ja po środku. Obejrzyj sobie  na spokojnie te filmy, które zostały polecone;  Będziesz miał pytania? ja osobiście Tobie na nie odpowiem. To nie jest wiara kościelna, że masz w coś uwierzyć. Tutaj ty decydujesz czy pozostajesz przy starym? Czy może zaczniesz się przyglądać temu nowemu. Tutaj niema żadnego przymusu. Chcesz się rozwinąć wewnętrznie?  to musisz złamać pewne dogmaty. To jest początek drogi, poznania prawdy. Ja zawsze będę służył pomocą, w  wyjaśnieniu sprawy. Tutaj niema przymusu, tutaj niech będzie ciekawość poznania nowego?pozdrawiam.\n\nUwaga - odpowadam po raz drugi. Skoro Waszymi argumentami są filmiki na Youtube, a moje argumenty nie trafiają więc je powtórzę ostatni raz:\n* Wybierz się w wycieczkę dookoła świata\n* Lecąc samolotem jak wybierzesz odpowiedni lot (odpowiednia godzina) w kierunku zachód, zobaczysz słońce \"wstające\" zza horyzontu.",
				"added": 1608351643
			},
			{
				"comment_id": 49,
				"body": "> [gafel2](#comment_17_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Kolego fornakter. Przecież ja nie namawiam Ciebie do wiary w wiedzę pokazaną na filmy na YT. Namawiam do obserwacji otaczającego świata i wyciągania wniosków. Weź kartkę papieru (albo arkusz typu Excel) i policz sobie różnicę między wysokością a długością ramion trójkąta równobocznego. Ramiona to promień tej kuli (łatwo znaleźć) Ziemskiej, a podstawa to te 10 km. Mi uparcie wychodzi z obliczeń 2 metry. Nie chcą wyjść 2 cm, których bym nie zauważył w naturze. Potem znajdź jakiś kawałek płaskiej Ziemi, o długości 10 km, najlepiej jezioro, i spróbuj zobaczyć taką kopułę patrząc na to własnymi oczami. Jeśli Tobie to się oda, to zacznę szukać, co jest ze mną nie tak. Jeśli nie zrobisz tego doświadczenia, bo jesteś przekonany, że to niemożliwe, to... [...]\n\nNajwidoczniej wielkość kuli jest podana błędnie, a nie to, że jesteśmy latającym talerzem.",
				"added": 1608391245
			}
		],
		"1607981410_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 39,
				"body": "I co to niby ma być?",
				"added": 1608051689
			},
			{
				"comment_id": 42,
				"body": "> [driud](#comment_134_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Jest to lista przykazań pewnego ludu. Który zamierza rządzić całym światem. Co chcesz jeszcze wiedzieć?\n\nTyle to się domyśliłem.\nPytanie: po co im kierowanie całym światem. Jak przejmą nad nim kontrolę - co jest nieuniknione - nad czym wtedy będą chcieli panować?",
				"added": 1608106070
			},
			{
				"comment_id": 43,
				"body": "spoko, nie tylko Ty jesteś świadomy aktualnej sytuacji, a czasami tak piszesz, jak byś był jedyną osobą, która posiada taką wiedzę. Nie bierz tego do siebie, to nie wbita.\nMyślę, że duża ilość osób, które uzywają ZeroNet to są świadomi ludzie, dlatego tutaj są.\n\nTo, że wymyka im się spod kontrolli, to może być tylko takie nasze złudzenie. Wszelkie protesty, bunty do tej pory są kontrolowane - czytaj: byli gotowi na nie.\nDoskonałym przykładem są pseudo-protesty w naszym kraju.\nOrganizują je sami \"aktorzy\" którzy pod dziwnymi pretekstami próbują niby zjednoczyć kraj, a tak naprawdę gówno robią.\nGdzie popełniają błąd? Myślę, że \"w korzeniach\". Pomimo internetu (braku kontaktu) ludzie dalej posiadają instynkt, podświadomość, tylko teraz potrafią Cie wyczuć przez świecący ekran.\nPrzykładem są jutuberzy, którym się nie udaje, bo grają sztucznie. Jeżeli jesteś naturalny/prawidziwy, będziesz mnieć oglądalność.\n\nSmartfony - to oczywiste, że są do kontrolowania nas. Tak samo jak \"wspaniały\" Windows 10. Nasze maszyny są już tak potężne, że w tle mogą wysyłać OGROM informacji na nasz temat, bez utraty wydajności.\nDlatego chcę przesiąść się na Linuxa, a na telefon trzena napisać swoj system...",
				"added": 1608113012
			}
		],
		"1607453657_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 40,
				"body": "Skoro Rosja dała się covid-propagandzie, to kim oni są na skalę światową? Takim samym pionkiem jak i my. A skoro jest pionkiem, nie on decyduje kiedy i z kim będzie walczyć.",
				"added": 1608052233
			}
		],
		"1608051891_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 41,
				"body": "> [driud](#comment_132_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Jedna podstawowa sprawa; Ta przepowiednia wywodzi się z kościoła. Pytanie? czy jest prawdziwa? Odpowiedzi należy udzielić sobie samemu. Zobaczmy co się dzieje dzisiaj w kościele? Jakie niskie morale. Co kościół Wie? A czego nie chce nam powiedzieć, żeby nas nie martwić. A może to wszystko to ukartowana gra? Tak jak reszta.pozdrawiam.\n\nJasne, biorę to pod uwagę, ale niby tyle świadków było.\nPytanie się nasuwa: gdzie są teraz (byli) ci swiadkowie?",
				"added": 1608105979
			},
			{
				"comment_id": 44,
				"body": "> [driud](#comment_135_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): A jeśli świadkowie byli podstawieni? Nie można wykluczyć takiej opcji? / myślenie abstrakcyjne /. \n\nPróbuje wysłać emaila do Ciebie testowego, nigdy nie uzywalem ZeroMail, przycisk \"Zaszyfruj i wyślij wiadomość\" wydaje się być nieaktywny. Nie mogę wysłać emaila. Wiesz może co na to poradzić?",
				"added": 1608113558
			}
		],
		"1608325060_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 48,
				"body": "> [sasza](#comment_33_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB): Ja, sie chyba niedam zaszczepic. Tak na wszelki wypadek. Moje ryzyko. Duzo skladnikow ma ta szczepionka? To sa wszystko szkodliwe skladniki, dziwne.\n\n90% narodu poleci z pocałowaniem reki po szczepionke",
				"added": 1608351814
			}
		],
		"1608998976_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 50,
				"body": "W internecie jest bardzo mało informacji na ten temat, wystarczy wpisać w wyszukiwarkę (byle nie Google!) to się pokaże tylko kilka wyników, reszta to stolarze i tapicer.\nOgólnie to chodzi o to, że te krzesło wysyłało jakieś fale (magnetyczne?) do organizmu, pobudzając komórki i bardzo pozytywnie wpływając na zdrowie. Nie dotyczy Ciebie np choroba nowotworowa.\nWyczytałem też, że twórca został zwyczajnie zamordowany a po kilku dniach od zabójstwa zlikwidowali wszystkie krzesła w szpitalach.\nSzukam tutaj więcej informacji, ponieważ w necie jest ich bardzo mało.\nhttps://tabelazdrowia.pl/wyjasnionie-oscylatora-lakhovskyego-krzeslo/",
				"added": 1609003416
			},
			{
				"comment_id": 51,
				"body": "Widzę właśnie, że wykonanie w domu takiego czegoś jest praktycznie niemożliwe. Ale dalej nie rozumiem działania.",
				"added": 1609003868
			},
			{
				"comment_id": 52,
				"body": "> [driud](#comment_157_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Dzięki za podpowiedź.Działanie można przyrównać do biorezonansu, ale badanie zamiast godzin zajmuje minuty..To tłumaczy dlaczego wycofali te urządzenia ze szpitali? Było dobrze i tanio. dlatego są takie trudności z wejściem na rynek. Ja dalej szukam. Jakby nie było to jest wynalazek, \"TESLI\". A On nie był za bardzo lubiany, przez bogatych właścicieli  przemysłu. Dodatkowo przemysł zbrojeniowy, który zagarnął jego wynalazki i patenty. Czyżby już wtedy NWO,  już działało??? Wychodzi na to, że TAK.pozdrawiam.\n\nTo było oczywiste, że te urządzenie zostanie wycofane, bo jest za dobre.\n\n\"Różnica\" w przypadku Tesli i Lakhovskiego jest taka, że ten drugi sam opracował te urządzenie, bez kontaktu z Teslą.\n\nNWO i pochodne dzialaja od dawna, od momentu jak pojawili się Federalni i zaczeli drukować pieniądze, ta zaraza się utrzymuje do dnia dzisiejszego i zatruwa nam życie.",
				"added": 1609067369
			},
			{
				"comment_id": 54,
				"body": "Najgorsze, że tak naprawdę nikt tego nie produkuje. Pewnie cześć osób ze strachu...",
				"added": 1609310158
			},
			{
				"comment_id": 59,
				"body": "> [gafel2](#comment_47_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Cieszę się, że ktoś jeszcze WIE, że częstotliwości mogą leczyć :-)Nie tylko szkodzą.Harmonia leczy. Chaos szkodzi.Uziemianie... od kilku lat skarpetki i buty zakładam tylko wtedy, gdy jadę do miasta. Z reguły raz w tygodniu, maks. 2 dni. Chodzenie boso po trawie, również zimą - rewelacja. Po śniegu - też.Kiedy nauczymy się nosić buty z przewodzącego materiału? - indiańskie skórzane mokasyny zdaje się przewodziły?Kto pamięta, że jeśli musimy rozmawiać przez komórkę, najlepiej jest robić to boso, na trawie. Ochronny potencjał ziemi przenosi się na całego człowieka i chroni przed szkodliwym promieniowaniem.Kto stosuje w pracy ochronne uziemione maty pod bosymi stopami?\n\nNo dobra, to mam troche głupie pytanie.\nCzy da radę poznać, które buty są uziemieniem?",
				"added": 1609755041
			},
			{
				"comment_id": 70,
				"body": "Problem zarobków to problem bardziej indywidualny, dużo ludzi nie chce być bogadymi.\nPoza tym zioła nie są aż tak drogie żeby emeryt nie mógł sobie na nie pozwolić, ale na leki za pteki wydać 500zł - nie ma problemu.\n\nCo do uziemienia, to by był rewelacyjny pomysł, tylko jest jedno ALE\nLudzie nie uwierzą w to, że to ma jakieś znaczenie. Zresztą koncerny i korporacje zadbają o to, żeby na koniec i tak kasa do nich leciała. Zwyczajnie dodadzą na opakowaniu od butów \"uzmiemione\" i tyle w temacie.",
				"added": 1610103329
			},
			{
				"comment_id": 71,
				"body": "Kolejnym tematem jest kwestia komfortu, musy to być tak wykonane, żeby nie przeszkadzać podczas chodzenia, kawał drutu odpada :D",
				"added": 1610103448
			}
		],
		"1609163095_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 53,
				"body": "Bardzo ciekawe informacje, zastanawialem sie przez jakis czas, jak tam Putin sobie radzi z koroną. Przecież to nie jest osoba, która daje sobie dmuchać w kaszę.\nA jeżeli dał by się propagandzie covid, to co taki kaczorek może? \nChciałbym, żeby ten temat był w miarę aktualizowany, na temat aktualnej postawy/sytuacji Rosji. Bo w internecie propaganda ładnie działa i cięzko jest znaleźć jakieś informacje na ten temat.",
				"added": 1609169061
			},
			{
				"comment_id": 57,
				"body": "> [sasza](#comment_37_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB): Jak tam Putin sobie radzi z koroną.Z tego co widać gołym okiem, to robi powoli ale systematycznie. Robi uniki, długo się zastanawia. / robi to celowo /. Tak jak zrobił z główną księgową. Przesunął Ją na pozycję wyższą niż była, tylko na tym nowym stanowisku nic nie mogła już zrobić. Pęnsja była wyższa, był Medal, Laurka kwiaty telewizja.. Był Awans który do niczego nie prowadził. Taka taktyczna zagrywka. Została dalej pod kontrolą, ale już bez zębów. Już nie mogła ugryźć.Co do aktualizacji, to nie ma problemu. Materiału jest dużo, To zależy jak bardzo temat będzie związany z nami.\n\nNie znam tematu księgowej, ale ciekawe.\nWychodzi na to, że Putin pomimo swojej niby nieciekawej reputacji działa dalej według swoich zasad.",
				"added": 1609429670
			}
		],
		"1609346983_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 55,
				"body": "> [arione](#comment_29_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Mam torrenty z domen ktore juz są offline. Chcesz?\n\nMoże inaczej\nSzukam aplikacji do grafiki wektorowej Serif Affinity Designer",
				"added": 1609429207
			},
			{
				"comment_id": 67,
				"body": "Mi to się przypomina DC++, aplikacja, która działała rewelacyjnie i opierała się czysto na P2P, zdecentralizowanie oczywiście. Ta technologia wyprzedziła tamte czasu (jakieś 15 lat temu).\nChodziło o to, że dołączałeś do kanału (coś jak czat) i udostępniałeś swoje pliki na dysku. Jeżeli ktoś czegoś szukał, a Ty to miałeś, mógł pobrać od Ciebie. Ty wysyłałeś z max prędkością (można było ustawić jaki będzie max). Jeżeli ktoś w tym samym kanale miał ten sam plik, mógł ściągać go od dwóch osób i wtedy ściągał 2x szybciej.\nTo było rewelacyjne.",
				"added": 1609934149
			},
			{
				"comment_id": 68,
				"body": "Widzę, że jest jeszcze, ale ostatnia aktualizacja była w 2018r.",
				"added": 1609934189
			}
		],
		"1608946398_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 56,
				"body": "> [gafel2](#comment_39_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Ta sonda wbijana w mięso to było raczej urządzenie do badania zawartości azotanów albo azotynów. To pokazuje w swoich filmikach Marcin Bustowski. Zaufanie do producenta to jedno, a sprawdzenie - to inna sprawa. A na przykład jajka? Owszem, kurki biegają po trawie, a co było wcześniej lane na tę trawę? Zamarzył mi się taki nieinwazyjny miernik... Inaczej ich nie zmusimy do zmiany zachowań, jak ekonomicznie. Nie kupując skażonego towaru. Od lat to znamy: inaczej produkują dla siebie, inaczej - do sklepu.\n\nNapis na opakowaniu \"Eko\" jest tylko do podbijania ceny.\nLudzie są takimi idiotami, że aż szkoda gadać.\nCena tak naprawdę nie ma znaczenia.\nCi najbiedniejsi kupią byle gówno, żeby tylko coś zjeść.\nNatomiast ci z normalną ilością pieniędzy i bogaci, kupią cokolwiek, bez względu na cenę. I tutaj słowo \"Eko\" zbiera żniwa. Nawet jak nasrasz do pudełka.",
				"added": 1609429476
			}
		],
		"1609539623_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 58,
				"body": "Dobre, bardzo dobre.\nCzyli Putin dalej nie daje sobą pomiatać, jak zawsze.",
				"added": 1609574530
			},
			{
				"comment_id": 60,
				"body": "> [sj29msn5kz0ldmn](#comment_12_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): to wypierdalaj do Wielkiej Putinowskiej Rosji i wczuj sie w zwyklego obywatela ktory tam ma niewiele lepiej niz w Korei Pln\n\nO, odezwał się ten, co może w kraju robić co chce.\nJak nie odróżniasz dyktatury od demokracji, to Twoj problem, nie mój.\nFB, YT, Twitter itp wcale nie prowadzą do wolności, wręcz przeciwnie.",
				"added": 1609755173
			}
		],
		"1609543281_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 61,
				"body": "Przecież Bill powiedział, że każde pokolenie będzie miało swoją epiemię i wszyscy będziemy musieli się szczepić co pokolenie.\nAle dalej mówcie, że to teoria spiskowa.\nTak samo jak powiedział, że uwielbia szczepionki i dzieki zastosowaniu medycyny i lekarzy można szybko zmniejszyć o 15% populacje.",
				"added": 1609760903
			},
			{
				"comment_id": 63,
				"body": "> [gafel2](#comment_48_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Mam wrażenie, że o wszystkim, co jest planowane, jesteśmy uprzedzani z jakimś wyprzedzeniem. Jakby ktoś \"chciał\", abyśmy w końcu obudzili się (jako społeczeństwo). Poziom absurdu spada już niepokojąco nisko - ciągle nic. Przykład: uprzedzali, że restrykcje będą przede wszystkim dotkliwe. Są? a może jeszcze za mało? - że do przekonywania nas zatrudnią \"celebrytów\". Zatrudnili. W żenujący sposób, odwołując się do doświadczeń z PRL-u. Do wpychania się w kolejki bez kolejki. Czy na młodych też to działa??? [...]\n\nRożnica jest taka, że trzeba oddzielać ludzi posiadających wiedzę, od tych z wyższym IQ.\nBardzo dużo ludzi nie widzi między tym roznicy. I dlatego ktoś, kto ma doktorat potrafi zachowywać się jak debil.\nJa już się uodporniłem na takie osoby, po prostu im nie przetłumaczysz i tyle. TVP jest ich światem. \nZauważcie, że ich głowy już są tak wyprane, że nawet jak im powiesz prawdę z argumentami, to i tak ją wyprą.",
				"added": 1609795204
			},
			{
				"comment_id": 64,
				"body": "BTW jeżeli ktoś wyskakuje mi z tematem szczepionki, to ja zawsze pytam:\n- ok, a gdzie jest szczepionka na HIV?\n- nie ma, bo to co innego\n- ale co innego, i to i to jest wirus\n- ale ten jest inny\n- ale w 3 miesiące? A co z katarem, to też wirus. Podaj mi przykład wirusa, który został wyleczony.",
				"added": 1609795393
			},
			{
				"comment_id": 65,
				"body": "> [gafel2](#comment_50_18pL2XYAH4CcNJpsRiwBPh1HkyG9m3iGW7): Zdrowy - wydaje mi się najlepszym określeniem. Odporny na infekcje to tylko podzbiór. Dla mnie zdrowy organizm to taki, który ma stabilną homeostazę i duże zapasy na różne nieoczekiwane tryby awaryjne. A więc odporny na zakażenia bakteryjne, odporny na zimno, odporny na promieniowanie (w tym - poparzenia słoneczne), szybko leczy rany, odporny na uszkodzenia ścięgien (nie rwie sobie wiązadeł kolanowych na nartach), na złamania (w poważniejszych wypadkach), a ewentualne złamania leczy sobie nie 6 tygodni, a np. 6 dni (a może krócej?), odporny na głód i trucizny - i co tam jeszcze może nas dotknąć ze strony środowiska.Jeśli 40 latek przy zwykłym upadku łamie sobie obojczyk, to powinno być dla niego ostrzeżenie o najwyższym stanie zagrożenia. Nie jest zdrowy, w sensie przytoczonym wyżej. [...]\n\nJa się interesuje tematem zdrowia od jakiś 15 lat, ale w moim przypadku to bardziej forma \"hobbistyczna\". Taki znachor ;)\nOgólnie to co zrobili z nami lekarze, telewizja i leki to woła o pomstę do nieba. Jesteśmy powoli mordowani na własne życzenie. Niedługo nasza rasa będzie życ po 40 lat. Ale pewnie o to im chodzi. Hitler zabił za mało ludzi, im chodzi o systematyczne mordowanie ludzi na skalę globalną. I udaje im się to. Powoli, po trochu będą obcinać nam lata życia.\n\nSkoro jest niby takie przeludnienie, to czemu na całym świecie nie stosuje się przymusowych rodzin 2+1 dziecko? W czym byłby problem? Przyrost ujemy zagwarantowany. Zero masowych mordów, szczepien na sile.",
				"added": 1609871937
			},
			{
				"comment_id": 66,
				"body": "> [driud](#comment_171_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Jedna ważna Uwaga!!!  Hitlera finansowali , Rothschildowie, chodziło o zniszczenie, ZSRR. Niemcy niszczą Rosję. A zwycięzców  zniszczy Atlanta,  chodziło o aliantów. Oni mieli się nawzajem pozabijać.\n\nHitler miał układy z Rithschildami, IBM, Fordem. To oni podpowiadali ogólne założenia Hitlera, dawali jemu pieniadze. \nA potem? Właściciel IBM nawiązał kontakt z... Billem Gates. Ups...\n\nPS. Dalej uważam, że pomimo różnych planów i strategii, głównym celem ludzi kierujących Hitlerem było wymordować jak najwięcej ludzi.\nPS2. Zobaczcie jak całą uwagę w historii skupia się na Hitlerze, to on jest głównym złoczyńcą, on tego wszystkiego dokonał. A kto stał nad nim? Nie ma o tym ani słowa.",
				"added": 1609880357
			}
		],
		"1609762064_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 62,
				"body": "Informowałem, zapraszalem, przekazywałem więdzę. \nLudzie tego nie chcą. To jest \"za trudne\", są za wygodni, za głupi.\nTyle w temacie \"reklamowania\" ZeroNeta\n\nCzyli co, Tor nie jest tak \"dyskretny\" za jakiego sie go uwaza?",
				"added": 1609794845
			},
			{
				"comment_id": 69,
				"body": "Nie to, że za poważny, ale dużo się rozpisaliście i trochę zboczyliście z tematu, a ja aktualnie mam okreś dużej liości pracy.",
				"added": 1610102718
			},
			{
				"comment_id": 72,
				"body": "Czy może ktoś się jaśniej wypowiedzieć, co dokładnie macie na myśli mówiąc \"Tor\"? Przecież ZeroNet tez z niego korzysta(?). \nPrzeglądarka Tor mnie odrzuca, jest archaiczna i beznadziejna w praktyce. Czy ona też działa na sieci Tor?",
				"added": 1610117736
			},
			{
				"comment_id": 73,
				"body": "Teraz mi się coś skojarzyło odnośnie prywatności.\nFirmy, korporacje, milionerzy.\nOni nie mogą sobie pozwolić na prześladowanie (czytaj: podsłuchiwanie i zbieranie informacji), muszą wykonywać połączenia poufne, nie wykazywać swojej obecności w danym miejscu czy dawać możliwość zbierania o nich informacji.\nJednak ci wszyscy uzywaja iPhone.\nZdaje sobie sprawę, że podczas poważnych rozmów, kiedy są podejmowane decyzje, rozmawiają na żywo, ale proszę was, w dzisiejszych czasach nie ma takiej opcji, żeby uniknąć rozmów całkowicie, stawiam, że odbywa się ich bardzo dużo.\nI pojawia się kolejna sprawa. \nJa na dzien dzisiejszy jestem \"za słaby\" ale istnieje potencjał w nowym oprogramowaniu na telefony. System prosty, dający możliwość używania podstawowych funkcji, dużo lżejszy od iOS i Androdia, co za tym idzie - zabierający dużo mniej baterii, no i oczywiście bez tysiąca pracujących aplikacji w tle, bez zbierania o Tobie informacji.",
				"added": 1610124325
			},
			{
				"comment_id": 74,
				"body": "Używam komputera i niestety Windowsa, bo miałem problem z Linuxem (instalacją).\nNie wiem skąd taki pomysł, że uzywam ZeroNeta na telefonie.\n\nOstatnie cytowane zadnie wyrwałeś z kontekstu.\nJasne, że mogą nas podsłuchiwać itp, ale posiadając aktualne oprogramowanie nie tylko słuchają o czym rozmawiasz, ale i to co piszesz, w czym, gdzie jestes i jakie masz aplikacje.\nPropo wyrwanego kontekstu - chodziło o OS na telefon niezalezy, napisany przez nie-korporacje. Bez szpiegujących aplikacji. Pozostałoby tylko podsłuchiwanie rozmów.",
				"added": 1610128514
			},
			{
				"comment_id": 75,
				"body": "Mam starego laptopa, chyba tak zrobie.\nMi się spodobał LinuxFX ale to dlatego, że z komputera nie tylko ja będę korzystać, ale też np żona. Ona używa tylko podstawowych funkcji komputera i przesiadka \"chamska\" na linuxa będzie ją meczyć. LinuxFX wygląda prawie tak samo jak Win.\n\nA problem z linuxem na nowym kompie mam taki, że Linux nie obsługuje RST, a nie wiem czy da się wyłączyć RST bez komplikacji na aktualnym systemie Win.\n\nPróbowałem zainstalować Linuxa na pendrive, ale go zepsułem :D",
				"added": 1610215240
			}
		],
		"1610225804_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 76,
				"body": "Dzieki a info, czy jeszcze jakaś wersja Linuxa nie jest Linuxem? Żebym wiedział.\nBrałem pod uwagę też ZorinOS",
				"added": 1610354427
			},
			{
				"comment_id": 77,
				"body": "> [arione](#comment_46_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Różne dystrybucje mają mocniejsze i słabsze strony a użytkownicy mają różne potrzeby i priorytety. No i oczywiście umiejętności. Masz jakieś doświadczenia z jakimkolwiek L?\n\nMam ale nie duże.\nLubie temat komputerów itp, ale aktualnie nie mam czasu na to, żeby podszkolić się w działaniu Linuxa, szukam czegoś, co zwyczajnie będzie działać i nie szpiegować mnie na każdym kroku",
				"added": 1610383767
			},
			{
				"comment_id": 78,
				"body": "Na tą chwile mi wystarczy tyle informacji :)",
				"added": 1610395483
			},
			{
				"comment_id": 79,
				"body": "Skąd najlepiej ściągnąć i jaką wersję Debiana?",
				"added": 1611918529
			},
			{
				"comment_id": 80,
				"body": "> [xenovich](#comment_18_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2): NIe ma już Instagramu ZeroMe. Mało ciekawego tam było dlatego go  nie seedowałem. Z zeroneta ginie to co ludzie zostawili na pastwę losu. Ale to też i dobrze bo znika stąd badziewie.\n\nSory, ale jak to ma się do tematu?",
				"added": 1611931739
			}
		],
		"1611995160_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 81,
				"body": "@tueerin spoko, jednak Linuxa w domu uzyalbym tylko ja, a przeniesienie go w kieszeni do innego laptopa bardzo by mi odpowiadało, dlatego nie mam jakiś dużych wymagań odnośnie ilości pamięci tip.",
				"added": 1612021200
			},
			{
				"comment_id": 82,
				"body": "Z tego linku\nhttp://cdimage.debian.org/cdimage/archive/8.6.0-live/amd64/iso-hybrid/debian-live-8.6.0-amd64-kde-desktop.iso\nNie mogę utworzyć LiveCD na pendrive\nUżywam Rufusa, wcześniej działało, tutaj nie chce\nZmieniałem ustawienia podczas tworzenia kilka razy, w żadnej konfiguracji nie działa.",
				"added": 1612171078
			},
			{
				"comment_id": 83,
				"body": "Nie działa, nie bootuje. Nie wiem w czym problem.",
				"added": 1612173772
			}
		],
		"1613863319_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 84,
				"body": "Ktoś jest zaskoczony? Bo ja wcale.",
				"added": 1614277248
			}
		],
		"1614277389_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 85,
				"body": "> [sasza](#comment_49_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB): Dla wiekszosci, to jest bezradnosc duzego stopnia. jakich konkretow oczekujesz?Prawdopodobnie przygotowuja jakies nowe gowno, ktore ma to dotychczasowe  ZASTAPIC. Bedzie lepiej obserwowac wszystko. nie zapominajcie o sztucznej inteligencji.\n\nPropo tego, pewnie podczas awarii monitorowali sieć, z czego ludzie korzystali jak nie z messengera :)",
				"added": 1614437106
			},
			{
				"comment_id": 86,
				"body": "Widzę, że ta Vivaldi wygląda jak Opera",
				"added": 1614495626
			}
		],
		"1614797718_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 87,
				"body": "Spokojnie, nawołuje do urzymania tematu i kultury wypowiedzi.\n@druid, dlaczego twierdzisz, że piramida finansowa? Sprecyzuj, rozszerz swoją wypowiedz.\nŻe waluta wirutalna? Aktualnie kasa na koncie bankowym jest wirtualna, a w dodatku nie jest nasza. W przypadku kryptowalut, jest ona wirtualna, ale jest Twoja. Co więcej nie podlega inflacji z powodu dodruku, transery globalne nie są obarczone dodatkowym ryzykiem i kosztują tyle samo co lokalne.\n\n@klempa brak prądu, internetu dotyczy też aktualnego wymuszanego na siłę systemu płatności.",
				"added": 1614931923
			},
			{
				"comment_id": 89,
				"body": "Nie ma indealnego rozwiązania. Handel wymienny jest problematyczny, ze względu na właśnie walutę, którą trzeba płacić - czyli towar.\nW jaki sposób zapłacisz za kupno domu? Podstawisz tira z fantami pod jego dom i niech sobie to wypakuje?\nW jaki sposób \"zmierzysz\" dostatek? W ilości kontenerów z fantami na posesji?\nPieniądze rozwiązują ten problem. Bez znaczenia czy krypto czy fiaty.\nKolejnym problemem, że za kaczkę dostaniesz 2 siatki drewna na opał. Co w przypadku, jak ktoś kaczki nie potrzebuje? Marźniesz w zimę? Pieniądze są łatwe do przechowywania na później, każdy się zgodzi na przyjęcie ich w zamian za towar.",
				"added": 1615014953
			},
			{
				"comment_id": 90,
				"body": "Tradycyjna waluta dopóki miała odpowiednik w złocie się sprawdzała. W momencie braku odpowiednika, staje się bezużyteczna.\nJak jest bezużyteczna, potrzeba zastąpić ją czymś innym.\nTylko kierunek, który aktualnie przybieramy, jest jeszcze gorszym niż FIAT.\nZnam wady kryptowalut, ale czy aktualny system finansowy nie jest gorszy? A wirutalne fiaty jeszcze gorsze?",
				"added": 1615035646
			},
			{
				"comment_id": 91,
				"body": "> [driud](#comment_248_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Można kupić srebro i złoto; Są to małe blaszki zapakowane w plastyk. każda ma certyfikat , wartość można przeliczyć na dzisiejszą złotówkę czy euro. Zajrzyjcie na Alegro. Takie srebro można kupić Łotwie, dużo taniej.Można tym płacić, tak jak handel wymienny. Potrzeba zebrać grupę chętnych, którzy zechcą to wprowadzić. Jak znajdę film na ten temat to wrzucę na YouTube PL, Sporo czytałem na ten temat; To można zrealizować całkiem spokojnie. Jedna najmniejsza blaszka; nie kosztowała drogo? Teraz już nie pamiętam. ceny. Spróbuję coś znaleźć na ten temat. Takimi blaszkami można się wymieniać i robić zakupy.Pozdrawiam.\n\nCzekam na takie informacje. Z checią zacznę kupować złoto.\nA wracając do kryptowalut. \nZłotem nie zrobisz przelewu na zasięg, nie kupisz na np na allegro z płatnością przy odbiorze :)",
				"added": 1615105741
			},
			{
				"comment_id": 92,
				"body": "Pod pewnymi względami takie coś jest krokiem w tył, jeżeli chodzi o przemysł i rozwój. Ale krokiem w przód jeżeli chodzi o prywatność.\nTa w dzisiejszych czasach jest niedoceniana i bagatelizowana.",
				"added": 1615130502
			},
			{
				"comment_id": 93,
				"body": "Korporacje mają większą moc niz się wydaje.\nWystarczy, żeby jedna firma się wyłamała i przyjmowała w krypto i wszystko się posypie jak domek z kart.\nPoza tym jest dużo ludzi, ktorzy uzywają 2 walut. Nie widzę problemu w tym, żeby też używać dwóch. Albo konta takiego, gdzie trzymasz same krypto, a w momencie płacenia w biedrze za chleb i mleko jest przewalutowane.\n\nTylko problem z samym Bitcoinem jest taki, że trasakcja trwa kilka minut, a w sklepie dopuszczalne jest kilka sekund.",
				"added": 1615368386
			},
			{
				"comment_id": 94,
				"body": "Takie komentowanie czyjejś wiedzy sobie daruj, bo tak naprawdę nie wiesz z kim rozmawiasz. I o ile do tematu kryptowalut podchodzę z dystansem, to na pewno by się znalazł temat, w którym bym Cie zaorał. Więc głupiego szukaj gdzie indziej.",
				"added": 1615581675
			}
		],
		"1614911443_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": [
			{
				"comment_id": 88,
				"body": "Nie miałem problemu z tym, ale to pewnie nieświadomie, ponieważ domyślnie mam na innej pratycji, czyli E:\\Zero ;)",
				"added": 1614932098
			}
		],
		"1615135071_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 95,
				"body": "Ja mam troche inne pytanie - po co oni chcą wyludnić planetę? Ewidentnie chodzi o wymordowanie jak największej ilości ludzi, a tych co przezyli - utrudnic ich zycie do granic mozliwości.\nTylko po co?\nCo wtedy jak na planecie zostanie 20% aktualnej ludności?",
				"added": 1615582316
			},
			{
				"comment_id": 96,
				"body": "No więc tak - takie życie jest bez sensu. Żyjesz tylko po to, żeby cierpieć, walczyc i umrzeć.\nReligia jest stworzona po to, żeby zaślepić ten bezsens życia i sztucznie nadać życiu sens.",
				"added": 1615823687
			},
			{
				"comment_id": 97,
				"body": "Kwestia niepełnosprawności to oddzielny duży temat.\nAktualnie niepełnosprawność jest promowana, reklamowana, traktowana jak \"prawidłowość\" i nakreślane są (na siłę czy nie) zalety takiego życia.\nOsoba niepełnosprawna może liczyć na profity, na ktore nie może liczyć zdrowy. Zdrowy jest traktowany jako gorszy.\nTo oznacza, że rząd chce chorego, niepełnosprawnego narodu.",
				"added": 1616340357
			}
		],
		"1616448209_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 98,
				"body": "W oficjalnych mediach podali, że umarł na covid",
				"added": 1616593410
			},
			{
				"comment_id": 99,
				"body": "Chciałbym tylko dodać, ze w zaistniałych okolicznościach, kaczor zrobi wszystko, żeby utrzymać propagandę covid w kraju i sprzeda kraj za paczkę ryżu, aby tylko przeżyć.\nTutaj nawet 500 000 ludzi na ulicy nic nie zdziała, wyprowadzi wojsko, zamorduje kilka(set) ludzi, a w telewizji powiedzą, że tłum się rzucił na spacerujące wojsko.\nZrobi wszystko, żeby przeżyć.",
				"added": 1616655994
			}
		],
		"1619526269_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 100,
				"body": "Ten filmik jest na zasadzie: zabijamy was i robimy z was debili, ale zarabiam 10k i dlatego bede dalej to robić.",
				"added": 1620815602
			}
		],
		"1618538921_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 101,
				"body": "> [sasza](#comment_54_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB): Panowie, niedlugo juz koniec. Juz na jesieni wchodzi nowy internet niezalezny. Pozostalo jescze pare miesiecy do wprowadzenia i zinstalowania. Koniokrady sie zesraja na rzadko. YANDEX, jest juz do tego przystosowany i przygotowany. Bedziecie mieli do wyboru, zmiane albo pozostac dalej w szambie. To postawi swiat na glowie. A co do Linux-a, to jest to dystrybucja dla ludzi? Matoly pozostaja na windowsie, z wyboru? Albo z glupoty. Rosja wprowadza nowe dystrybucje oparte na Linux-ie, zasila one urzedy i wojsko. To wszystko jest juz instalowane, dlatego jest tyle szkolen bezplatnych dla ludzi. Wisienka na Torcie bedzie nowy internet.\n\nTrochę się rozpędziłeś. Wziąłeś pod uwagę takie osoby jak np ja? Nie mam czasu siedzieć przy kompie i klepać linijki, żeby zainstalować sterowniki. Kolejna sprawa, to to, że aktualnie dysk twardy mam uruchomiony w jakimśtam programie do optymalizacji działania dysku, czego nie można normalnie wyłączyć, a Linux tego nie obsługuje. Roboty od zajebania. Przesiądę się na Linuxa za jakieś 2 lata, jak system będzie zasyfiony.",
				"added": 1620815891
			},
			{
				"comment_id": 102,
				"body": "> [tomasz2](#comment_21_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6): Za dwa lata się nie przesiądziesz; dlaczego? bo zostaniesz daleko w tyle, życie biegnie szybko. Opóźnienie jednego roku? to cała wieczność w informatyce. Kiedyś były modne wyścigi rowerowe, \"Wyścig Pokoju\". Jeśli tam odpadłeś od głównego peletonu, to było już pozamiatane, żadnych szans na jakiekolwiek zwycięstwo. Podobnie jest dzisiaj z internetem, już wchodzi internet kwantowy. Jak chcesz go dogonić, nie będąc na bieżąco?.Wracając do głównego wątku dyskusji. Teraz jeszcze można zmienić nawet całą dystrybucję. Ja to już robiłem parę razy z pozytywnym skutkiem. Oczywiście wymagało to trochę nakładu pracy. Ale efekt był piorunujący, bo oprócz  nowej dystrybucji, jeszcze czegoś się nauczyłem. Udowodniłem sobie, że potrafię się wdrapać na szczyt niemożliwości dla innych alembików? Samodzielnie wszedłem na sam czubek .Wszystko zależy od ciebie, czy chcesz być w głównym peletonie? Czy na szarym końcu wyścigu szczurów.\n\nNie da się być w pierwszym peletonie we wszystkim. Jeżeli poświęce dużo czasu na zrobienie własnej dystrybucji Linuxa to muszę znaleźć na to czas i pieniądze. Bedę w tyle z pracą, albo rodziną, albo wolnym czasem, albo we wszystkim po trochu.\nZrobiłeś, gratuluje. Ja aktualnie uczę się dużo nowych rzeczy do nowej pracy i mam przeprowadzkę. Jeżeli wg Ciebie to nie są ważne sprawy, tylko wyklepanie Linuxa na pamięc to współczuje.\nJesteś pierwszy w peletonie Linuxowym, a w którym miejscu jesteś w życiu prwyatnym?",
				"added": 1621150272
			},
			{
				"comment_id": 103,
				"body": "> [arione](#comment_73_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Fornakter. Linuks jest z nami już od czterdziestu lat. Nie musisz robić nowej dystrybucji. Po kilku godzinach badania tematu możesz już zaczynać użytkowanie. Dalej już dobierasz wersje do potrzeb i umiejętności.\n\nWersja nie jest bez znaczenia, co udowodnił jakiś czas temu @druid.\nA propo @druida, jak zawsze wypowiedź z rozmachem ;) Wiem jak to wszystko wygląda, ale ten świat jest tak stworzony, żebyś nie dał rady orientować się we wszystkim. Nie ma takiej szansy. Jesteś ekspertem w komputerach? Możesz przerąbać sobie w tematach finansów, bo poświęciłeś czas na komputery. Poświęcisz czas, staniesz się pro w finansach i komputerach? To np w kwestii podatków, prawa ktoś dobierze się Tobie do 4 liter.\nZa dużo tego, za szybko. Nasze mózgi są genialne, ale nie \"nieskończone\".\nProstym przykładem są gry.\nJedna osoba tworzy dzwięk/muzykę.\nDruga - grafikę\nTrzecia - fabułę\nCzwarta - Programowanie backend\nPiąta - frontend\nSzósta - Betatester.\n(To jest oczywiście przykład)\nGracz natomiast widzi tylko efekt końcowy. Widzi to na co patrzy, ale nie wszystko co zostało stworzone. Widzi ułamek całości, którą tworzyło 6 osób. \nI my tak samo, mamy dostęp tylko do ułamka. 6 osób wokół nas tworzy i daje możliwości, a my czerpiemy tylko ułamek, bo nie damy rady złapać tego wszystkiego co robi 6 osób.\nCzy jak włączasz grę, to zaczynasz od przeczytania kodu żródłowego, fabuły, sposobu wykoania muzyki i dopiero siadasz do gry?",
				"added": 1621534910
			},
			{
				"comment_id": 105,
				"body": "Pierwsze złyszę (w moim przedszkolu) że dzieci dostają grę komputerową. Raz, max 2x w tygodniu puszczają bajkę, ale to i tak jak nie ma pogody. Bo jak jest pogoda to pół dnia siedzą na dworze. W szkołach to co od zawsze. Rywalizacja. Każdy pokazuje jaki ma telefon a co w nim. Kiedyś się tłukło kijami i rzucało kamieniami.",
				"added": 1621593215
			}
		],
		"1621391720_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 104,
				"body": "Więc czego używać?",
				"added": 1621587769
			}
		],
		"1621638953_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 106,
				"body": "Korona świrus nie istnieje. Testy, którymi rzekomo się robi na wykrywanie nie są do tego. W dodatku w Chinach już nie ma korony bez szczepionki? Fale elektromagnetyczne jakie są wywoływane przez przewody elektryczne, Wi-Fi, 4G i 5G obniżają naszą odporność i sprawiają, że produkujemy antyciała, które wykrywa test PoCoRobić.\nA choroby? A to grypy już nie ma? Na grypę się nie umiera? Grypa to bardzo silna choroba, można mieć powikłania, a śmierć z powodu grypy nie jest jakąś nowowścią. Co roku sezon jesienno-wiosenny jest sesonem chorobowym i oczywiście \"grypowym\".",
				"added": 1621757553
			},
			{
				"comment_id": 107,
				"body": "> [driud](#comment_287_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Potrzeba było, 1,5-roku, żeby dotarło, że to jest ściema? Niektórzy dalej wierzą w bajki, z mchu i paproci. Teraz mamy kampanię reklamową w mediach, na temat szczepień. Ciekaw jestem na czym się to skończy?pozdrawiam.\n\nJa od początku mówiłem o tym, że to jakaś ściema. \nJak się skończy? Zostanie utworzone getto, dla nie-zaszczepionych. Tylko po co? Skoro szczepionka chroni, to po co getto? Zeby nie uciekali, postawią mur, druty u góry, wojsko przy murach, bezie pilnować.\nCoś mi to przypomina...",
				"added": 1621870388
			},
			{
				"comment_id": 108,
				"body": "https://cdn.24.co.za/files/Cms/General/d/10897/4b82f86609c34503a675ee04bdde17e8.jpg",
				"added": 1621870491
			},
			{
				"comment_id": 109,
				"body": "> [driud](#comment_289_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): @fornakter;To nie chodzi o getto? To ma być eliminacja niewygodnych. Starych, Schorowanych, Inaczej myślących, Nieposłusznych.\n\nTo wszystko ma działać wielopoziomowo. Obydwoje możemy mieć rację.",
				"added": 1621885134
			}
		],
		"1623926456_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 110,
				"body": "Dróg i sznurków jest dużo. Może nasze wnuki się dowiedzą prawdy... może.",
				"added": 1625513749
			},
			{
				"comment_id": 115,
				"body": "> [driud2](#comment_10_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x): Tą prawdę można już dziś poznać, wystarczy swój umysł otworzyć? Trzeba się nauczyć przytomnie patrzeć.W wojsku było takie powiedzenie; Obecny nieprzytomny.pozdrawiam.\n\ndruidzie kochany ;) Zapewniam Cie, że nie jesteś jedyną osobą tutaj, która ma oczy otwarte i się rozgląda :)\nProblem polega na tym, że tak samo jak jesteśmy specjalnie szukiwani, okłamywani na każdym kroku, tak samo ciężko jest znaleźć jedną drogę do tego, kto tym wszystkim kieruje. Na tym świecie jest kilka wątków które się toczą, każdy prowadzi do kogoś innego. Ale jestem pewien, że nad nimi też ktoś jest.",
				"added": 1625597848
			}
		],
		"1623615171_193fCp5MWKjfmbNuSd5thzbfDsCj5whHTQ": [
			{
				"comment_id": 111,
				"body": "A co sądzicie o Signalu?",
				"added": 1625513868
			}
		],
		"1621854532_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 112,
				"body": "Izrael jest strategicznym państwem w centrum swiata.\nTutaj się wszystko skończy albo zacznie.",
				"added": 1625514031
			},
			{
				"comment_id": 114,
				"body": "> [driud2](#comment_11_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x): Trzecią światową zacznie malutkie państwo; Tyle mówi stara przepowiednia. Chyba nie jest trudno zlokalizować tego malucha???pozdrawiam.\n\nCiężko jednoznacznie określić \"wojna\". Tak samo jak ciężko określić \"koniec świata\". Czyjego świata? Jakiego? Którego? Bo na tą chwilę to wszystko wskazuje na to, że upadnie świat Rzymsko Katolicki. Upadek religii, koniec jego rządów, kłamstw, morderstw itp.",
				"added": 1625597593
			}
		],
		"1622818687_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 113,
				"body": "Kto wystawia lewe paszporty covidowe?",
				"added": 1625514507
			}
		],
		"1624997273_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 116,
				"body": "> [brn](#comment_1_1KmVK8U1zxhTvKtmxgNEkeixANS9dRunm4): sauce?\n\nNie wszystko na ZeroNet da się \"zasuczować\", często to są wnioski użytkowników po obserwacjach kilku źródeł. \nMówiąc inaczej - to jest 'sauce' co widzisz wyzej.",
				"added": 1626085432
			}
		],
		"1626571418_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 117,
				"body": "Jest jeszcze trzecia strona medalu(?)\nDlaczego się zaszczepiłeś?\n- Bo chcę wyjechać na wakacje\n- Bo w TV powiedzieli, że trzeba\n- Bo chce iść na koncert \n- [Dopiszcie swoje]\n\n2 z 3 wymienionych punktów są realne, z życia wzięte, znam takie osoby.",
				"added": 1626861802
			},
			{
				"comment_id": 118,
				"body": "Za mało nas jest, żeby coś zdziałać. Najlepsze jest to, jak bardzo ludzie mają wpojone, że kaczor nas ratuje. Rozmawiałem z jednymi przez internet, dla nich to normlane, że biorą szczepionkę, ale ona nie daje poprawy w odporności na wirusa. Dla nich to normalne i oczywiste, że ja niezaszczepiony im zagrażam. Dla nich to oczywiste jak to, że rano się robi jasno. Nie widzą w tym bzdury. Co więcej, jak im pokazujesz palcem debilizmy, olewają to. Totalny człowiek-beton. Jak im powiedziałem, że w internecie są powszechnie dostępne filmy, na których mówią, że dzieki odpoiedniej pracy lekarzy i szczepieniom zmniejszą populację swiata o 15%.\nKazali mi wysłać link.\nOdpowiedziałem - jak nie jesteś w stanie poświecić 15min na znalezienie czegos na ten temat, to ja tego za ciebie nie będę robił. Poszerzanie wiedzy wymaga inicjatywy, a nie połykania wszystkiego co podaje telewizja.\nOczywiscie wysmiali to i olali, bo im wystarczy to, ze włączą TV.",
				"added": 1629022744
			}
		],
		"1629535835_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 119,
				"body": "> [efi3](#comment_66_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ): Wyjaśniam co następuje. Zastrzyk ma coś co przyrząd pomiarowy rozpoznaje? / tlenek grafenu /. Na granicy, przechodzisz przez bramkę i ona rozpoznaje, czy był zastrzyk, czy nie był? Zaświadczenie możesz mieć przy sobie, i tak Ciebie zawrócą. To jeszcze nie jest we wszystkich krajach wprowadzone. Nowsza wersja ma mieć numer szczepionki? który będzie się wyświetlał, w świetle UV-u. Na grandę chcą dać wszystkim te zastrzyki. Ten temat jest rozwojowy. Kupienie zaświadczenia? Może się okazać lipą. W jednym kraju funkcjonuje, a już w drugim mają inne metody. Chcą żebyśmy wzieli zastrzyki i siedzieli w domowym areszcie. Ta gra jest już prowadzona 18-miesięcy. Trochę późno się obudziłeś. Temat rzeka.Pozdrawiam.\n\nMożna oczyścić organizm z grafenu i innych metali cięzkich, w tym rtęć - która powoduje padaczkę.",
				"added": 1630757169
			}
		],
		"1632644671_19TrKZA9ifR8bvPbL64AbNqttCDkWfErWF": [
			{
				"comment_id": 120,
				"body": "Ktoś może mi to łopatologicznie wytłumaczyć?",
				"added": 1636047024
			}
		]
	},
	"comment_vote": {
		"52_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"28_1At298vUijuhjA2GtqXEydC8csRnhETzdH": 1,
		"54_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"19_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": 1,
		"37_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"126_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"156_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"100_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": 1,
		"116_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": 1
	}
}