{
	"next_post_id": 7,
	"next_comment_id": 54,
	"next_follow_id": 15,
	"avatar": "generate",
	"user_name": "If0",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Что я здесь делаю?",
	"post": [
		{
			"post_id": 1,
			"date_added": 1557304280,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1557587712,
			"body": "Первые впчатления о ZeroNet.\nИдея распределенного храниня только востребованных данных и использования их локальной копии для их просмотра - интересна. Только конкретная реализация указанной концепции оставляет желать лучшего. Сеть дружелюбна для специально созданных, опртимизированных для использовании в ней приложений, но для желающих перенести сюда свои существующие проекты с целью использования возможностей свободного распределенного хостинга встретит ряд сложностей и проблем.\nВ попытке перенеса статического сайта (300+ странц 5000+ файлов) я столкнулся с рядом проблем.\n\n1. Страницы сайта отображаются не в том виде, как они изначально сделаны, а динамически подгружаются в блок iframe. В результате нарушается внутрення страничная навигация: не работают анкеры.\n2. Не поддерживаются относительные пути, которые не содержат сетевой адрес ZeroNet.\n3. В случае использования префикса /raw в ссылках - первая открытая страница отображается \"как есть\", но при переходе по ссылкам внутрисайтовой навигации происходит добавление содержимого страниц в iframe, как в п1. Хотя, анкеры при этом начинают работать :)\n4. Из-за большого объема сайта при попытке его подписи: siteSign происходит ошибка:\n\"- Sign error: VerifyError: Content too large 15044954B > 10485760B, aborting task... in main.py line 198 > ContentManager.py line 736 > ContentManager.py line 841\". Эта ошибка присутствут на багртркере https://github.com/HelloZeroNet/ZeroNet/issues/598 которая была закрыта на основании фикса в v0.5, сейчас на дворе версия 0.6.5 r3864.\n\nДля меня такое оказалось полной неожиданностью. Не думал, что где-то можно поиметь проблемы с размещением полностью статического сайта...\n\nВсе остальное выглядит неплохо.",
			"date_added": 1557587709
		},
		{
			"post_id": 1558180082,
			"body": "В режиме \"все через Tor\" сетью невозможно нормально пользоваться по причине отсутствия .onion трекеров.\nГде-нибудь есть мануала, как поднять трекер для ZN в Tor?",
			"date_added": 1558180078,
			"meta": "{\"img\":\"552,700,eeeeffedddddffffeedee,00102000031440340004403400444404014454040004414600440004000400040044000400140004\"}"
		},
		{
			"post_id": 1558777019,
			"body": "Возврвщаясь к вопросу о создании трекера с использованием .onion адреса, хочу добавить: для этой цели можно использовать сервер https://github.com/ZeroNetJS/zeronet-tracker только он, к сожалению, реализован на базе node.js, ~~стремного поделия~~ которое на уважающий себя сервер пускать совсем не хочестся, учитывая отсутствие доверия к npm.\n\nДругих реализаций сервера, судя по всему - нет. А обычные, известные и провереные сервера трекеров не поддерживают протокол zero:// Наверное, как раз этому прискорбному факту ZN обязан полному отсутствию трекеров в Tor.",
			"date_added": 1558777014
		},
		{
			"post_id": 1560805642,
			"body": "Пара мыслей про безопасность использования ZeroNet, с точки зрения содержимого текстовых сообщений - комментариев пользователей, оставляемых на зайтах, форумах и хабах и текстах, размещаемых на зайтах.\n\nПри загрузке зайта, вместе с его основным содержимым, загружаются текстовые сообщения всех пользователей, когда-либо комментировавших материалы зайта. Тоже самое происходит при загрузке форумов - все сообщения всех пользователей попадают на диск, при этом храняться и сидируются другим пользователям.\n\nПри этом сложно опредилить не содержат ли какие сообщения (не просмотрев их все) нежелательный (по разным причинам) для пользователя контент, который он лично, руководствуясь некоторыми убеждениями и принципами (или просто опасаясь уголовного или административного преследования) не желеает хранить, и тем более - участвовать в его раздаче другим пирам сети.\n\nДаже в случае определения \"нежелательного контента\" в ZeroNet не предусмотрено механизма его избирательного удаления, с последующим запретом синхронизации. Другими словами: участник сети не может выбирать, что он лично хочет хранить и раздавать, а что - нет. Что усугубляется отсутствием анонимности, как таковой, без специального задействования дополнительных средств.\n\nТочно таким же образом ведут себя зайты: при переходе по ссылке на отдельную статью, опубликованную на зайте, на диск загружается содержимое всего зайта. Какие материалы может содержать загруженный зайт невозможно узнать не просмотрев его весь. Таким образом придется или сразу удалять зайт после прочтения интересующего материала, или хранить и сидировать \"на свой страх и риск\".\n\nХуже того, никто не даст гарантии, что сидируемый на протяжении длительного периода \"хороший зайт\" в любой момент полностью (или частично) не поменяет свое содержимое, став \"нежелательным плохим\". Что может использоваться для троллинга, провокаций и откровенной подставы со стороны \"правохранительных\" органов с целью преследования пользователей сети.\n\nДанное, неочевидное на первый взгляд, свойство сети может представлять опасность для пользовтелей, решивших использовать ZeroNet без проксирования через Tor, о чем их следует предупреждать несколько раз открытым текстом.",
			"date_added": 1560805636
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@caryoscelus: \n> ссылки, начинающиеся с \"/\" - не полностью относительны (они относительны только домена, но привязаны к файловой иерархии внутри него)\n\nПро это речь. Поэтому к ним приходится добавлять адрес ZeroNet.\n\n>  Надо либо увеличить макс. размер сайта, либо сделать часть файлов опциональными\n\nПытаюсь шаманть с опциями content.json, но пока безрезультатно. Опциональными сделал все картинки, но не помогает. А вот каким образом задать максимальный размер сайта пока не разобрался.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1557587712",
			"date_added": 1557590928
		},
		{
			"comment_id": 2,
			"body": "@caryoscelus: \n> Вместо этого можно сделать их полностью относительными, используя path/to/inner/dir или ../../path/to/outer\n\nМожно. Только для этого придеться перепиливать генератор сайта для создания ссылок в менюшках, и - что еще хуже - править ссылки между страницами сделанные вручную. Сейчас все ссылки на сайте даются от корня домена.\n\nС подпиской сайта вроде как разобрался. Текст со стилями и иконками занимают 6.6М, а картинки я задаю, как опциональный контент.\n---\nТолько все равно, странно это: для чего грузить весь сайт целиком ради того, что бы прочитать только одну страницу? Только если сайт - SPA, и он банально не будет работать без наличия всех компонентов, на что заточена система. Для статических сатов требуется другая логика их загрузки и обработки.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1557587712",
			"date_added": 1557600036
		},
		{
			"comment_id": 3,
			"body": "Спасибо за советы, проблема была во флаге \"OnionTrafficOnly\" в torrc, который не позволял коннектиться ни к чему, кроме .onion адресов.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1558180082",
			"date_added": 1558205709
		},
		{
			"comment_id": 4,
			"body": "@caryoscelus: \n> Бутер по-прежнему работает\n\nКак показала недельная практика использования ZeroNet, для реальной работы в сети лишь один указанный трекер использовать нельзя, если только нет желания >70% времени просиживать без соединений с трекерами, что ни как нельзя назвать полноценной работой.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1558777019",
			"date_added": 1558777665
		},
		{
			"comment_id": 5,
			"body": "~~полному отсутствию трекеров в Tor~~\n\nпрактически полному отсутствию трекеров в Tor, что не позволяет полноценно использовать сеть ZeroNet без обращений к трекерам, расположенным в clearnet. ",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1558777019",
			"date_added": 1558778492
		},
		{
			"comment_id": 6,
			"body": "@caryoscelus: \n> или пока только теоретическое беспокойство?\n\nСкорее недоумение - почему такой возможностью не ползуются? Можно было бы вообще не покидать пределы Tor при использовании ZeroNet и не грузить его выходные ноды запросами к клирнетовским трекерам.\n\nТем более существует модуль \"Bootstrapper\", который позволяет организовать локальный трекер, но он судя по всему работает только с clernet и требует открытый порт.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1558777019",
			"date_added": 1558780339
		},
		{
			"comment_id": 7,
			"body": "@caryoscelus: \n>у пользователей по крайней мере есть возможность сказать, что \"мы не знали\" и тогда следует (с т.ч. зрения г-ва) либо запрещать 0нет вообще, либо без дополнительных доказательств не наказывать за \"плохой\" контент, а лишь содействовать его удалению.\n\nУвы, в РФ данная аргументация не работает. Одного факта загрузки запрещенного контента с вашего IP будет достаточно для преследования по ряду административных и уголовных статей. Работает так же, как формулировка: \"незнание закона не освобождает от ответственности\". Ваш компьютер, ваш жесткий диск, ваша сессия с вашего IP. В лучшем случае придется доказывать: \"я - не при чем, оно само ко мне загрузилось и стало раздаваться\", что будет звучать, мягко сказать, совсем малоубедительно.\n\n>Где-то был тред сравнения 0нет и фринет, в котором как раз пользователь вообще никакого контроля над данными не имеет\n\nВ отличие от ZN, где все храниться передается открыто, во Freenet данные хранться зашифрованными частями одинакового размера. Поймать и доказать вину пользователя можно при условии, что у него на диске будут обнаружены принятые расшифрованные или отправляемые незашифрованные файлы. Тоже самое касается сети Perfect Dark. В этих сетях отсутствие контроля за хранением и сидированием компенсируется сложностью определения принадлежности того или иного фрагмета к отределенному файлу в незашифрованном виде, после момента загрузки его в сеть.\n\nИли должна быть возможность полного контроля, или надежное шифрование. В ZN нет ни того, ни другого.\n\n>С другой стороны, многие сайты с опциональными файлами испытывают проблемы с их сидированием\n\nЭто - механизм \"естетсвенного отбора\" востребованного контента. Почему некий пользователь должен сидировать, расходуя свои ресурсы (диск, процессор, сеть) на не интересный или спорный по его мнению контент? Раз создатель заитересован в доступности своего контента, то пусть изволит постоянно сидировать его, если контент того заслуживает. Если окажется, что контент не нужен никому, кроме его создателя, то туда ему и дорога...\n\nФлудеры и тролли на форумах не смогут найти пиров, для синхронизации контента, из-за повсеместных блокировок их аккаунтов, и будут обречены читать свои изыски в своем узком кругу. В результате, репутация будет иметь важное значение.\n\nИ наоборот, интересный и востребованный контент будет хорошо распространен.\n\nПричем это не будет актом общственной дискриминацией со стороны большинства или затыканием рта - сидировать свой контент никто не запрещает, также как индексировать его в поисковых ресурсах и рекламировать на форумах. Только каждый будет волен не помогать (или наоборот - помогать) распростронять только то, что считает важным, нужным и полезным на уровне отдельного документа, а не зайта в целом.\n\n>Честно говоря, не знаю, какой вариант по итогам предпочтительнее, но я к тому, что есть и плюсы, и минусы, а не только инерция разработки\n\nНаверное, у каждого пользователя должен быть выбор: хранить все, или только запрашиваемое, на подобии возможности частичного скачивания для обычных торрентов.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1560859311
		},
		{
			"comment_id": 8,
			"body": "@caryoscelus:\n>Передаётся вроде всё же зашифровано.\n\nРечь идет о шифровании данных во время их передачи, которое поможет избежать интереса стророннего наблюдателя за трафиком, но не пира ZN, который скачивает контент с узла, подключенного к сети без проксирования через Tor. Необязательно перхватывать шифрованный трафик, а достаточно прикинуться обычным пиром, что бы зафиксировать факт раздачи определенного контента с определенного IP, просто закачав его и получив сразу в расшифрованном виде.\n\nСмысл в шифровании канала, конечно есть, но оно не способно скрыть раздачу того или иного контента.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1560867087
		},
		{
			"comment_id": 9,
			"body": "@caryoscelus:\n>не думаю, что на данный момент риск сильно увеличивается (хотя в будущем это может и измениться)\n\nПринцип \"неуловимого Джо\". Ради десятка пользователей никто не будет шевелиться, даже ради пары сотен, но если их количество станет исчисляться тысячами, то ситуация точно измениться.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1560867617
		},
		{
			"comment_id": 10,
			"body": "@caryoscelus:\n> Здесь просто недостаточно пользователей, чтобы каждый кусок интересного для некоторого круга людей контента быстро находил достаточно заинтересованных пиров.\n\nПроблема роста и масштабирования. В начале стоит задача: \"сделать, что бы как-то заработало\". Если будет рост - что-нибудь придумаем и поправим на ходу, если \"не взлетит\" - тогда для чего стараться и выкладываться на ранней стадии?",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1560868421
		},
		{
			"comment_id": 11,
			"body": "@caryoscelus:\n>Это называется имущественный ценз. В других сетях контент приносит монетизацию, а здесь надо приплачивать? Общество к этому ещё не готово.\n\nНекоторые и в клирнете держат сатйы на энтузиазме - без спонсоров и рекламы, самостоятельно неся расходы на хостинг и доменное имя. Потому что это их увлечение, которое они реально ценят, поэтому не хотят смешивать с рекламным дерьмом, проявляя неуважение к себе и своим читателям.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1560869029
		},
		{
			"comment_id": 12,
			"body": "@caryoscelus:\n>И да, все эти вопросы безопасности упираются ещё и js. Если не заменить его на что-то безопасное и предсказуемое, то придётся читать не только контент, но и код сайтов.\n\nБоюсь, что сама концепция ZN расходится, с понятиями: \"безопасность\" и \"анонимность\". Использование JS в основе всего, меньше всего совместимо с ними. Если коду разработчиков еще как-то можно доверетять, и верить в то, что он не будет сам по себе производить вредительских действий, но при этом трудно предугадать, что может произойти при его взаимодествии с JS зайта, насколько устойчиво API к возможным вредоносным проявлениям.\n\nАвторы могли пойти путем классического серверного фреймворка, с основной функциональностью вынесенной на серверную сторону, которая позволила создавать динамические страницы и строить типовые приложения (сайт, форум) с возможностью полного отключения JS, вместо использования SPA, который принципиально без него не работоспособен.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1560870977
		},
		{
			"comment_id": 13,
			"body": "@caryoscelus:\n>И, опять же, их существование никак не отрицает существование людей, у которых такой возможности нет\n\nТак платформы, на подобии ZN, как раз рассчитаны на таких людей. Кто захочет сидить зайты на которых будет полно рекламы или которые содержат рекламные проплаченные статейки? Лично я - точно не буду.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1560934459
		},
		{
			"comment_id": 14,
			"body": "@caryoscelus:\n> при чём тут реклама?\n\nТак речь зашла про имущественный ценз на персональный тематический сайт создаваемый энтузиастом. Реклама (и спонсорство) в клирнете может использоваться для его частичного или полного погашения. В ZN стоимость вледения сайтом делится между сидами.\n\nТолько доля, приходящаяся на поддержание доступности сайта (хостинг, имя) составляет лишь малую часть от общих затрат. Главная - приходится на создание контента, которое как минимум требует время, большое количество времени. Как раз эти затраты фактически невозможно монетизировать в ZN, потому что сиды согласны нести затраты по обеспечению доступности интересного для них контента, но не за бесплатное распространение рекламы, приносящей доход третьим лицам.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561019082
		},
		{
			"comment_id": 15,
			"body": "Привет!\n\n>Русскоязычные здесь есть?\n\nЕсть, но их здесь совсем не густо... С большинством новых пользователей, заглянувшими сюда, обычно происходит стандартная история: по началу они пытаются проявлять активность, но столкнувшись с отсутсвием реакции на нее, из-за крайне малого количества активных пользователей (от силы - человек пять), со временем заходят все реже. И в конечном итоге, осознав бесперспективность найти не только собеседников по интересам, а просто желающих обсуждать что-либо, охота здесь находиться полностью пропадают. В среднем, описанный процесс занимает от двух недель, до месяца.\n\n>Хотелось бы верить, что этот форум не превратится в порно-помойку и местом скопления антисоциальных элементов\n\nВсе познается в сравнении. Порой асоциальная помойка, будет предподчтительнее унылой тишины и полного запустения.",
			"post_uri": "1J5My9475FYkusn9zaADH4nWk9Ad2dGFAn_1560973720",
			"date_added": 1561020626
		},
		{
			"comment_id": 16,
			"body": "@Fairy:\n>И что-то мне подсказывает, что до конца года не только \"Новая\" об этом напишет.))\n\nКто только об этой сети не писал, как и о любом проекте, выглядещем перспективно. Только с момента создания прошло уже четыре года и... Имеем то, что имеем.\n\nСудя по истории развития, здесь время от времени происходили \"волны хайпа\", которые также быстро сходили \"на нет\", как создавались.",
			"post_uri": "1J5My9475FYkusn9zaADH4nWk9Ad2dGFAn_1560973720",
			"date_added": 1561021250
		},
		{
			"comment_id": 17,
			"body": "@caryoscelus:\n> Есть, кстати, большие категории людей, у которых времени достаточно, а денег нет, либо мало. Некоторые тут даже боятся наплыва одной из этих категорий ;)\n\nНаплыва :))) Это, наверно, самый фантастический из всех фантастических вариантов развития сети ZN. В жестокой реальности \"уплыв\" почему-то превосходит \"наплыв\". Если, на вскидку, сопоставить количество зарегистрированных пользователй, хотя бы в сервисе Me.Zero (14775), с количеством активных (~20), то в такое поверит разве что законченный гипероптимист.\n\n> если бы здесь было больше народу, монетизировать можно было бы через прямую оплату\n\nДа. Хотя бы через донат. Все упирается в количество народа.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561035096
		},
		{
			"comment_id": 18,
			"body": "@caryoscelus:\n> ну, если бы вдруг один из разгневанных ютуберов (или ещё кого) почему-то решил переползти сюда, вполне мог бы быть наплыв фанатов.\n\nПопулярный ютубер слишком завязан на эту площадку, и кормится с нее, поэтому всегда прогнется под изменяющиеся правила. Тот, кто не хочет прогибаться используют площадки с менее требовательными правилами, но с количеством пользователей превышающие на порядки, аудиторию, которую они смогут найти в ZN. Он, скорее всего, оказавшись перед выбором, предподчет что-нибудь вроде телеги.\n\n> Кто-то из тех, кто основной доход получает с донатов, а не рекламы (ну или с встроенной рекламы), теоретически даже может это сделать\n\nМало кто захочет осознано пойти на риск потерять аудиторию и вместе с ней доход, меняя платформу. В особенности, с более простой и доступной, на менее доступную и технически сложную, требующей запуск специального приложения и настройку прокси. Самые стойкие последователи пойдут за ним, но их будут считанные проценты.\n\nСтоит учитывать факт, что никто не хочет даже \"зеркалить\" сюда свой контент, \"на всякий случай\", считая это неоправданными затратами.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561041083
		},
		{
			"comment_id": 19,
			"body": "Это будет вполне справедливо относительно свободы печати в любой стране.\n\nНеужели кто-то из русскоговорящих появился в ZeroMe? Неслыханное дело!",
			"post_uri": "1EKuhc7Z1NrcT5LexBRAJsKVyt9oiPSAkc_1561711892",
			"date_added": 1561746835
		},
		{
			"comment_id": 20,
			"body": "@Gaypidoras: \n>Но если бы не эти недостатки, то каждый бы хранил только то, что он выбирал бы сам. И таким образом какая то конкретная часть сайта хранилась только у нескольких конкретных людей(компьютеров), и сеть не была бы такой неубиваемой и децентрализованной.\n\nТолько стОит ли мало кому интересный контент (вернее - интересный только одному его создателю) что бы он хранился в нескольких экземплярах по всей сети?  ",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561832833
		},
		{
			"comment_id": 21,
			"body": "@Anonymouslogin: \n>Всё дело в неубиваемой сети!\n\nТо, что мертво, умереть не может!",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561833009
		},
		{
			"comment_id": 22,
			"body": "@Gaypidoras: \n>как цитировать?\n\nПравая угловая скобка в начале цитаты: > используется правила оформления markdown",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561851725
		},
		{
			"comment_id": 23,
			"body": "@Gaypidoras:\n>Именно поэтому мы и можем удалить сайт целиком, но не какой то определенный контент из него.\n\nЭто означает, что ради одной интересной заметки сайт  со всем его содержимым придется хранить - вечно. По крайней мере, до момента конца существования ZN или ухода из нее. ",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561852133
		},
		{
			"comment_id": 24,
			"body": "@Gaypidoras:\n>Везде есть плюсы и минусы, мы всегда будем идти на компромисс.\n\nЭто работает пока сеть не развита, имеет мало контента и пользователй. Представте, что было, если бы клирнет работал с такими же условиями.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561852434
		},
		{
			"comment_id": 25,
			"body": "@Gaypidoras: \n>Ну мы же рассматриваем настоящую ситуацию, так ведь?\n\nДля понимания текущего состояния ZN лучше подойдет аналогия с концепт-каром: выглядит красиво, но к повседневной эксплуатации - не пригоден.\n\nОн работает пока не загружен - мало пользователей, в результате чего, он совершенно не интересен вредителям: спамерам, флудерам, троллям - \"продукты жизнедеятельности\" которых придется хранить и раздавать всем обычным пользователям и ограничить их никак нельзя.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1561913974
		},
		{
			"comment_id": 26,
			"body": "Привет!",
			"post_uri": "1Cjms28Nonq7JLC9pLTxB1ucNpA6Sodxtw_1",
			"date_added": 1562016788
		},
		{
			"comment_id": 27,
			"body": "@Siliks: \n> тоже не выбирает, что ему кэшировать (и соответственно хранить на диске)\n \nСтраницу, на посещаемом сайте, которую вы не откроете в браузере - сама не скачается к вам на диск. В ZN при открытии страницы - скачивается весь сайт целиком (та часть, которая помеченна, как обязательная при его публикации - фактически все его текстовое содержимое). Или вы не видете разницы в таком поведении?\n\nКеширование - не хранение, и тем более не подразумевает раздачу другим пирам кешированных данных.\n\nКроме того, кеширование может быть отключено.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1562155705
		},
		{
			"comment_id": 28,
			"body": "@Siliks:\n> Если вы хотите, чтобы было как в \"обычном Интернете\"\n\nЯ хочу сам не подставиться храня и раздавая контент, который может оказаться чем угодно, и предупредить других пользователей о неочевидном поведении, из-за которго могут возникнуть проблемы.",
			"post_uri": "1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x_1560805642",
			"date_added": 1562241413
		},
		{
			"comment_id": 29,
			"body": "@Daffy:\nКогда правда становится неугодной власти, ее сразу стараются представить в негативном контексте - разжигание ненависти, нетерпимость или проявление национализма, пользуясь различными предлогами, что бы поставить ее, и всех о ней говорящей, вне закона. Это - традиционная политическая практика, вне зависимомти от страны. Где-то она применяется сильнее и жесче, где-то - слабее, но в любом случае применяется повсеместно. ",
			"post_uri": "1EKuhc7Z1NrcT5LexBRAJsKVyt9oiPSAkc_1561711892",
			"date_added": 1562406575
		},
		{
			"comment_id": 30,
			"body": "Привет!\n\n>мэш-меть\n\nА что это такое? :-)",
			"post_uri": "19BErFg5xs9QgxvoTQec39v16tXJwBBHWu_1562676029",
			"date_added": 1562679708
		},
		{
			"comment_id": 31,
			"body": "@Siliks: \n>философия и есть!\n\nМой диван дает мне +9000 к скилу философа!",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563372047
		},
		{
			"comment_id": 32,
			"body": "@Siliks: \n>диванный допинг в философской дискуссии - это несколько неспортивно?\n\nВ философской - несомненно, озвучивание собственных \"дианных фантазий\" - крайне порицаемое поведение. Только местячковая дискуссия малость до уровня \"философской\" не дотягивает (потому что основана исключительно на \"диванных фантазиях\" и ведется с их позиции), посему не может гордо называться таковой.",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563379792
		},
		{
			"comment_id": 33,
			"body": "@Siliks:\n>почему разговор про философию не может быть философским?\n\nВсе зависит от того, кто его ведет, с точки зрения компетенции в вопросе (отсюда упоминание дивана) и что считать \"разговором на философскую тему\". Детишки в детсаде тоже могут вести разговор по содержанию похожему на филосовское, но вы не назовете их болтовню философией?\n\nТочно также разговор \"про автомобили\" инженеров автомобилестроения будет отличатся от разговора обыкновенных автолюбителей.",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563385833
		},
		{
			"comment_id": 34,
			"body": "@Siliks: \n>о есть мне вы отказываете в компетенции вести философские разговоры? :)\n\nПочему же? Я говорил про свой диван.\n\n>Важно что говорят детишки, зачастую их мысли интересные и глубокие и показывают привычные вещи с непривычной стороны.\n\nЧем же измереяется \"глубина мысли\"? :-) Весьма интересное умение отличать \"поверхостную мысль\" от \"глубокой\".",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563394871
		},
		{
			"comment_id": 35,
			"body": "@Siliks: \nЗабыли поднять самый главный философский вопрос: в чем смысл существования данной системы? А так же источник происхождения входного сигнала и необходимости использования выходного. ",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563472549
		},
		{
			"comment_id": 36,
			"body": "@Siliks: \n>если это усилитель звука\n\nТогда при чем здесь \"управление\", да еще в \"клсссическом виде\"? :-) ",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563524812
		},
		{
			"comment_id": 37,
			"body": "@Siliks: Мозг, мысль, управление, усилитель звука... Поток сознания. ",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563527064
		},
		{
			"comment_id": 38,
			"body": "@Siliks: \n>всё вполне себе связано: если вы не видите управления в том, как входной сигнал в усилителе звука влияет на выходной\n\nИнтереснее момент, появения этого \"усилителя звука\" при обсуждении \"материальности мысли\". Выглядит, как \"концентрация на частностях\".",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563352104",
			"date_added": 1563644124
		},
		{
			"comment_id": 39,
			"body": "Выходя за пределы, самое главное - не выйти за предел глупости :-)))",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563634757",
			"date_added": 1563644653
		},
		{
			"comment_id": 40,
			"body": "@Siliks: \nПреодолевший его будет выглядеть в глазах других, как \"человек, преодолевший предел глупости\"... Если только у глупости имеется предел, который возможно преодолеть ;-)",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563634757",
			"date_added": 1563708654
		},
		{
			"comment_id": 41,
			"body": "@Siliks:\n>человек ведь не для них старается\n\nСоглашусь :-) Не очень много людей захотят \"преодолевать предел глупости\" ради других. Если только это не связано с их профессиональной деятельностью: писатели комедийного жанра или клоуны в цирке...",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563634757",
			"date_added": 1563726092
		},
		{
			"comment_id": 42,
			"body": "По существу вопроса: интересно, кому может быть выгодна установка предела глупости? С кем неизбежно столкнется выходящий за данный предел? ",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563634757",
			"date_added": 1563727005
		},
		{
			"comment_id": 43,
			"body": "@Alkashismalinovk:\nПривет!",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1563634757",
			"date_added": 1563727129
		},
		{
			"comment_id": 44,
			"body": ">есть ли будущее у децентрализованного интернета?\n\nНет. Хомяки не любят совершать \"лишних телодвижений\", - устанавливать и изучать дополнительный, неудобный в использовании (часто - сырой, недоработанный) софт, который еще будет потреблять ресурсы его девайса и расходовать сетевой трафик.\n\nИспользование p2p софта - осознаный шаг, на которой идут пользователи, имеющие представление для чего он создавался и ради чего следует мириться с его особенностями. ",
			"post_uri": "1EmKmnSditdtUXPJsRBLFtYPuajZLRyhJg_1563811413",
			"date_added": 1563815248
		},
		{
			"comment_id": 45,
			"body": "@Sayconst: \nМожно немного подогреть :-)\nХотя, для полноценного подогрева лучше использовать какой-нибудь мощный игровой ноут.",
			"post_uri": "1LmGWhPuBAMVqUo6wSsnkxFSE1dZkERN2G_1564592432",
			"date_added": 1564786883
		},
		{
			"comment_id": 46,
			"body": "Чего тестируем?",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1564837568",
			"date_added": 1564838609
		},
		{
			"comment_id": 47,
			"body": "Следствие: только умный способен во всей полноте осознать, что его окружают одни тупые идиоты.",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1567376232",
			"date_added": 1567455948
		},
		{
			"comment_id": 48,
			"body": "@Siliks: Значит, в этом вопросе они полностью правы, делая верные выводы. Даже, если не на разумном, а на подсознательном, интиуитивном уровне. Что вполне согласуется с \"правилом 95%\".",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1567376232",
			"date_added": 1567535658
		},
		{
			"comment_id": 49,
			"body": "@Razzlom: \n>русскоязычное комьюнити сейчас довольно тухлое здесь\n\nОбычный сценарий: новый пользователь приходит, полный энтузиазма, пытается по началу разобраться с настройками сети, понять - как работает, что-то пытается писать, создает свой зайт - проявляет всевозможную активнсть...\n\nПотом видит, что здешнее комьюнити состоит из пяти человек, часть из которых появляется не чаще раза в неделю, и общаться (по крайней мере - на русском) не с кем (те, кто бывает чаще - обычно общаются на en), после чего заходит все реже, и в конечном итоге - пропадает... :)",
			"post_uri": "1PJZgWFCiE3mfGTGPgJZDqcUz37crLHwcC_1570350367",
			"date_added": 1570390707
		},
		{
			"comment_id": 50,
			"body": "@Alexu: \n>Было бы не плохо замутить портал на zeronet.\n\nЕсть форум русскоязычный, но активность там тоже аховая...",
			"post_uri": "1PJZgWFCiE3mfGTGPgJZDqcUz37crLHwcC_1570350367",
			"date_added": 1570391094
		},
		{
			"comment_id": 51,
			"body": "Наверное, просто не допилили. По идеи, сложности быть не должно - все данные по которым будет производится поиск находятся на локальном диске.",
			"post_uri": "1PJZgWFCiE3mfGTGPgJZDqcUz37crLHwcC_1570527170",
			"date_added": 1570566741
		},
		{
			"comment_id": 52,
			"body": "@Git Center: можно grep по содержимому директории data :-)",
			"post_uri": "1PJZgWFCiE3mfGTGPgJZDqcUz37crLHwcC_1570527170",
			"date_added": 1571689970
		},
		{
			"comment_id": 53,
			"body": "Привет",
			"post_uri": "1G3JYd1VwSCPGfmqv8EDU7mgcrrZi6okvf_1571837171",
			"date_added": 1571866636
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY",
			"user_name": "Xan",
			"date_added": 1557530302
		},
		{
			"follow_id": 2,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE",
			"user_name": "caryoscelus",
			"date_added": 1557591683
		},
		{
			"follow_id": 3,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8",
			"user_name": "Kids ",
			"date_added": 1557682490
		},
		{
			"follow_id": 4,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC",
			"user_name": "Promusik",
			"date_added": 1558211905
		},
		{
			"follow_id": 5,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi",
			"user_name": "Gluek",
			"date_added": 1558453207
		},
		{
			"follow_id": 6,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4",
			"user_name": "Geekless",
			"date_added": 1561833130
		},
		{
			"follow_id": 7,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di",
			"user_name": "Git Center",
			"date_added": 1562007794
		},
		{
			"follow_id": 8,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv",
			"user_name": "Siliks",
			"date_added": 1563378950
		},
		{
			"follow_id": 9,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S",
			"user_name": "Undyingfirewall",
			"date_added": 1567885250
		},
		{
			"follow_id": 10,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1PJZgWFCiE3mfGTGPgJZDqcUz37crLHwcC",
			"user_name": "Razzlom",
			"date_added": 1570390801
		},
		{
			"follow_id": 11,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1Ai5o3Y7Lpn5VZt9thmATzMwqYa1D4qRam",
			"user_name": "Alexu",
			"date_added": 1570390854
		},
		{
			"follow_id": 12,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "14Rw6GKaWbojrAsJUh8Aj3LDEoG4bXgkDu",
			"user_name": "Donkihot",
			"date_added": 1570910651
		},
		{
			"follow_id": 13,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X",
			"user_name": "Space Punk",
			"date_added": 1576591698
		},
		{
			"follow_id": 14,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ",
			"user_name": "GomZik",
			"date_added": 1576592081
		}
	]
}