{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1,
			"title": "Play  en zeronet para ver peliculas",
			"body": "Shures una pregunta la pagina Play en zeronet todas las peliculas estan en ingles? no veo nada en español...",
			"added": 1525589852
		},
		{
			"topic_id": 2,
			"title": "foro 4chan en deep web",
			"body": "Buenas shures del inframundo, sabeis la dirección onion de 4 chan o por zeronet ?",
			"added": 1525702826
		},
		{
			"topic_id": 3,
			"title": "que le pasa al @tonto de HIlario borrando post?",
			"body": "el Hilo de CSI de Josu Ternera , siendo totalmente legal , va y lo borra, este tio ya se pasa de censor, es un echenique en potencia, que opinais shurs? \n¿que le motiva a censurar todo lo que se mueve?, dinero?Grandes lobbys le pagaran dinero para que el foro sea un rebaño de ovejas con pensaiento único, porque no le encuentro otra explicación",
			"added": 1525710205
		},
		{
			"topic_id": 4,
			"title": "Duda Por nuestra seguridad",
			"body": "Cada vez que te conectas a Zeronet con tu usuario a traves de TOr , si alguna vez lo haces a traves de chrome sin la ip oculta, ¿ya queda asociado ese usuario a esa ip publica para siempr?",
			"added": 1525761621
		},
		{
			"topic_id": 5,
			"title": "zeronet en ios",
			"body": "es posible desde el movil entrar a zerocoches, he intentado por una web atraves de un proxy y entra en todo zeronet menos en zerocoches....forohackers a mi",
			"added": 1525809783
		},
		{
			"topic_id": 6,
			"title": "El diario más censurado de la historia Daily Storm",
			"body": "Con lo que me he topado por la DW, ni idea de que existiera...\nhttp://elstormer6vrre53.onion/category/espana/",
			"added": 1525936475
		},
		{
			"topic_id": 7,
			"title": "Esto es lo que está consiguiendo el listo de ILITRI",
			"body": "http://fs1.directupload.net/images/180510/lxq542ft.png",
			"added": 1525975149
		},
		{
			"topic_id": 8,
			"title": "Fundador de \" The Pirate Bay\" Dominios posibles para nuevo foro... alternativas",
			"body": "Peter Sundle, fundador del “tracker” de BitTorrent The Pirate Bay ha presentado este miércoles su nueva empresa: un servicio de registro de dominios como otro cualquiera pero con una importante diferencia: promete salvaguardar la identidad de sus clientes. Se llama Njalla.\n\nNormalmente, estas empresas facilitan los datos del dueño del dominio a través del “WHOIS”. Aunque ya existen varias que ofrecen enmascaran el nombre de sus clientes.\nEn Njalla se da un paso más en la privacidad, ya que los clientes no comprar dominios, dejan que la compañía del sueco se encargue de ello. Es decir, se crea una capa más de protección, aunque todo dependa de la confianza que depositen los usuarios en el servicio.\n\n“Necesitamos Njalla porque estamos yendo en la dirección equivocada como sociedad con respecto al derecho de todo individuo a permanecer en el anonimato”, dice Sundle a Torrent Freak . “Las redes sciales nos presionan para desprendernos del anonimato y los servicios cada vez están más centralizados. Necesitamos alternativas”.\n\nMuchos de sus potenciales clientes podrían ser aquellos perseguidos por llevar a cabo acciones que violan las leyes de derechos de autor de varios países como The Pirate Bay en su día. A Sundle no le preocupa, ya que dice que las autoridades van a por lo que se realiza, no la dirección.\n\nEl servicio permite transferir dominios u obtener uno nuevo. Las DNS pueden ser hospedadas por los usuarios o por la compañía y se puede pagar en Bitcoins.\n\nLa web ya está en funcionamiento y cualquier internauta puede consultar los precios de los diferentes dominios ofertados.\nhttps://njal.la/#pricing",
			"added": 1526030205
		},
		{
			"topic_id": 9,
			"title": "hilo de la polla chica",
			"body": "Buenas shur acaban de tirar un hilo con el que me partia la polla de un nota con la polla chica, ilitri es tonto o q le pasa. LOs hilos mas entretenidos se los carga.",
			"added": 1527583233
		},
		{
			"topic_id": 10,
			"title": "video de el anillo pa cuando?",
			"body": "shures el video lo teneis alguno?",
			"added": 1530126050
		}
	],
	"topic_vote": {
		"1_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": 1,
		"1_19fU8RcgGQeeZ5uENZCvDLN6Rd1DaXRXCo": 1,
		"2_17JkZDD6K36ZYQVT1uy2D1VN39HpJyYa34": 1,
		"1_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": 1,
		"3_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": 1,
		"2_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": 1
	},
	"next_comment_id": 44,
	"comment": {
		"2_17JkZDD6K36ZYQVT1uy2D1VN39HpJyYa34": [
			{
				"comment_id": 1,
				"body": "> [xoruku](#comment_1_12JhFfeRjaDFCMXiyo81SiwRhgH7HK9tAN): Dejo esto que he copiado de forogulag. Créditos al shur que lo puso, me he quedado sin cuneta y no tengo ni puta idea de su nick. \n> · https://t.me/vkm_bot descarga directa de música (escribes el nombre de cualquier canción y te devuelve el enlace). Para guardarlas en el móvil, cuando esté descargada y puedas reproducirla, le das a los 3 puntos del mensaje y haces click en la opción de Guardar.· https://t.me/scihubot ponéis el link del artículo científico de pago y os pasa el enlace de descarga directa.· http://telegram.me/osumwalls fondos de pantalla para móviles con calidad excelente.· https://t.me/joinchat/AAAAAELxnQDWGLtugzYMXg toda la prensa española actualizada.· https://t.me/joinchat/AAAAAEbza13psV_PFSJqxQ últimos números de muchas revistas españolas.· https://telegram.me/YTAudio_Bot pegas el enlace de un vídeo de YouTube y te envía el enlace de descarga directa de su audio.· http://telegram.me/apkpremium descarga gratuita de aplicaciones de pago.https://t.me/SeguridadInformatica Seguridad informatica\n> De todo un poco:\n> · https://telegram.me/MiTrackingBot bot que permite hacer un seguimiento mediante notificaciones automáticas de los envíos de paquetería de las principales empresas (Amazon, AliExpress...).· https://telegram.me/AmazonGlobalBot bot que permite comprobar la evolución del precio de un producto en Amazon.· https://telegram.me/descargasdirectas enlaces de descarga directa de software de todo tipo.· https://telegram.me/gamee juegos en Telegram para retar a vuestros amigos.· https://telegram.me/todosloscanalestelegram lista de canales para que busquéis por vuestra cuenta. Pecan de publicitarse entre ellos en exceso.· https://telegram.me/vkm_bot descarga directa de música (escribes el nombre de cualquier canción y te devuelve el enlace). Para guardarlas en el móvil, cuando esté descargada y puedas reproducirla, le das a los 3 puntos del mensaje y haces click en la opción de Guardar.· https://telegram.me/scihubot ponéis el link del artículo científico de pago y os pasa el enlace de descarga directa.· https://telegram.me/dicebot siempre va bien tener un dado a mano para ver quien paga la cena.· https://telegram.me/gizmodo_bot envía artículos interesantes de diversos temas (ciencia, historia, curiosidades...). Lo bueno es que no resulta pesado porque llegan entre 4 y 9 boletines por día y son rápidos de leer.· https://telegram.me/canalceliaco información y recetas relacionadas con la intolerancia al gluten.· https://telegram.me/ALErtBot permite crear recordatorios. Introduces el mensaje que quieres que te llegue y la hora deseada.· https://telegram.me/AnetA6, https://telegram.me/Anet_A8 impresoras 3D (ver URL para modelo).· https://telegram.me/zonaretro emuladores e infinidad de roms.· https://telegram.me/electricos publicaciones y más información relacionada con la electricidad.· https://telegram.me/Nutricion recopila artículos de blogs de nutrición.· https://telegram.me/alejandroperezyt canal de un Youtuber que analiza productos aportando datos y justificando cada cosa que dice, útil también como orientación sobre qué producto merece más la pena.· http://telegram.me/apkpremium descarga gratuita de aplicaciones de pago.https://t.me/IcomaniacoAlerts alertas de ICO y cryptonovedadeshttps://t.me/CuponesMcDonalds Su nombre lo dice, cupones McDonald's\n> Canales de imágenes y fotografía:· https://t.me/beautiful_land fotos artísticas/paisajes.· https://t.me/surrealpics imágenes surrealistas.· https://t.me/virginpunch arte digital, fondos de escritorio y tutoriales.· https://t.me/historygram fotos y anécdotas históricas.· http://t.me/osumwalls fondos de pantalla para móviles con calidad excelente.t.me/UrbexWorld imágenes de lugares abandonados, urbex, arte urbanoCanales de vídeos: películas y series para ver en streaming o descargar.· https://t.me/streamitas películas.· https://t.me/joinchat/AAAAAD-JNolow1nk9iRJVg películas.· https://t.me/RickYMortyenCastellano todos los capítulos de Rick y Morty en castellano.· https://t.me/cinepalomitas películas.· https://t.me/joinchat/AAAAAESHSfGsiLu29MUsKw series.· https://t.me/joinchat/AAAAAEHzag5sCzWu4Vv_Aw películas.· https://t.me/joinchat/AAAAAEDwfNKtfVT0lzjF9Q vídeos de deportes.· https://t.me/YTAudio_Bot pegas el enlace de un vídeo de YouTube y te envía el enlace de descarga directa de su audio. Para guardarlo en el móvil, cuando esté descargado y puedas reproducirlo, le das a los 3 puntos del mensaje y haces click en la opción de Guardar.· https://t.me/MP3full álbumes subidos en .rar a calidad 320.· https://t.me/MP3fullsoundtrack BSO de películas, series y videojuegos subidas en .rar a 320.· https://t.me/YTAudio_Bot pegas el enlace de un vídeo de YouTube y te envía el enlace de descarga directa de su audio.· https://t.me/zonadocus documentales de diferentes temáticas.· https://t.me/SeriesGram\n> Prensa/revistas: últimos números en PDF para descarga directa.· https://t.me/joinchat/AAAAAELxnQDWGLtugzYMXg toda la prensa española actualizada.· https://t.me/joinchat/AAAAAEbza13psV_PFSJqxQ últimos números de muchas revistas españolas.· https://t.me/joinchat/AAAAAEtlYggRpa3aHO1hhQ periódicos y revistas.· https://t.me/rtnoticias canal de Rusia Today.\n> Humor: de buen y mal gusto...· https://t.me/zhestgif GIFs de violencia +18 (accidentes de tráfico, tiroteos...).· https://t.me/chorradastelegram· https://t.me/chorradasgifst.me/humornegroygore Canal de humor negro y gore, sticker pack propio\n> Canales de libros: descarga directa en mobi, epub, PDF...· https://t.me/librosmobi· https://t.me/joinchat/AAAAAE0Soj71OhfBREXLOQ· https://t.me/joinchat/AAAAAD-n94Cm7nS0fVziyw descarga de cómics de Marvel.· https://t.me/geeklibrary ebooks para programadores y geeks.· https://t.me/EnglishMaterial material para aprender inglés.· http://t.me/locosxloslibros· https://t.me/LibrosZorro· https://t.me/libros\n> Canales de shurs:· http://t.me/newselectedmusic música electrónica de actualidad (incluso días antes de salir) en mp3 a 320kbps (no RIP).· https://t.me/ultimahorafc noticias frescas de todo tipo difundidas por shurs.· https://t.me/resistenciae información difundida por un shur muy patriótico.· http://t.me/Funnynimals un shur se dedica a compartir GIFs de animales graciosos.· http://t.me/radioska un shur comparte en descarga directa las mejores canciones de Ska.· https://t.me/stoyka un shur comparte sus gustos personales. Principalmente, música metal y fotografía (paisajes, universo Tolkien, fotografías propias....).· https://t.me/sextipsesp : un shur comparte consejos sexuales para complacer a vuestras parejas. Cuenta con buzón de sugerencias/preguntas anónimo.· https://t.me/TeConPastas descarga directa de anime en HD con subtítulos en castellano.· https://t.me/curiosea datos e imágenes curiosas, efemérides, hechos y fotos históricas, música, frases célebres, sexualidad y un sin fin de cosas cosas.\n> Canales de chollos: estos canales suelen ser basura, utilizan referidos en sus enlaces y se copian unos de otros. Huid de ellos.· https://t.me/descuentos· https://t.me/Chollos· https://t.me/chollometro· https://t.me/chollocuponesamazon· https://t.me/canalchollobot· https://t.me/EspaChollos· https://t.me/descuentoscomida descuentos de comida.· https://t.me/canalninja· https://t.me/xiaomioffers_bot , https://t.me/Chollos_Xiaomi: descuentos para los xiaomieros.· https://t.me/canaldechollos· https://t.me/CholloCanales canal de canales de chollos. Para que os intoxiquéis de chollos.· https://t.me/ofertasropa ofertas de ropa.· https://t.me/chollosenamazon· https://t.me/notengosueltohttps://t.me/CuponesMcDonalds\n\nmuy buena aportacion shur, gracias",
				"added": 1525588319
			}
		],
		"1_19fU8RcgGQeeZ5uENZCvDLN6Rd1DaXRXCo": [
			{
				"comment_id": 2,
				"body": "> [ushurario](#comment_6_1KKSpUM5yc3BML9psRK2fML6mJ2mKnRD2y): Has hecho lo de modificar el archivo que te dije? Y lo de excluir 127.0.0.1 del proxy? Tienes que hacer AMBAS cosas. Yo uso Mac y así funciona.\n\nGRANDE!! mis dies",
				"added": 1525588554
			},
			{
				"comment_id": 3,
				"body": "En MAc cada vez que se le da a la app de Zeronet porque coño se abre en Chrome de inicio? y no se va a TOR a pesar de estar marcado",
				"added": 1525588663
			}
		],
		"1_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 4,
				"body": "> [arbol](#comment_4_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9): Si shur esta todo en ingles, pero tambien te da la opcion de buscar subtitulos en otros idiomas.Habia un Play en español que se llama ZeroFlix o AnimeZero (http://127.0.0.1:43110/16MSit65b2i7XFsTQyvTB1zwd8kfbcegQ4), pero no funciona\n\nGracias Shur",
				"added": 1525590357
			}
		],
		"1_1JJkfbPoQhrmjk6SpHWNf4MEEEWAwFv1C2": [
			{
				"comment_id": 5,
				"body": "pero play está en inglés..",
				"added": 1525618700
			},
			{
				"comment_id": 6,
				"body": "> [arbol](#comment_6_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9): Si juntas Play y Soda Player, los subtitulos se descargan automaticamente de opensubtitles\n\npero subtitulos escritos entiendo no?",
				"added": 1525623376
			}
		],
		"1_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 7,
				"body": "al pulpo pol ni de coña me lo como",
				"added": 1525628881
			}
		],
		"1_17JkZDD6K36ZYQVT1uy2D1VN39HpJyYa34": [
			{
				"comment_id": 8,
				"body": "enlace caido....alma caritativa",
				"added": 1525642525
			},
			{
				"comment_id": 9,
				"body": "la veo un poco tocada mentalmente",
				"added": 1525645794
			}
		],
		"1_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": [
			{
				"comment_id": 10,
				"body": "no nos dejes con la intriga..",
				"added": 1525693862
			}
		],
		"3_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 11,
				"body": "+1",
				"added": 1525724154
			}
		],
		"3_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 12,
				"body": "casi como yo",
				"added": 1525760929
			}
		],
		"4_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 13,
				"body": "> [doncipote](#comment_10_1GqCXXyUYQrKJF1zrtGH4yxapQUQAGWVLd): En teoría con el modo tor siempre activado debería ser suficiente no? A mi es que con navegador Tor no me va, ni siguiendo el tuto :/\n\nyo lo del modo tor solo no me fio ni de coña, pasale esto a tu navegadorpara sabe si es seguro Panopticlick se llama, enlace de la clearnet: https://panopticlick.eff.org/",
				"added": 1525800740
			},
			{
				"comment_id": 17,
				"body": "ami tb me va muy rapido  aqui en zeronet y en onion mas lento, he hecho pruebas de ip y seguridad del navegador TOR configurado al maximo de seguridad y todo correcto.",
				"added": 1525894258
			}
		],
		"1_1DiV63jkL4C9uqTAJ7kfuk465ifcrvBbeR": [
			{
				"comment_id": 14,
				"body": "tor si o si",
				"added": 1525803054
			},
			{
				"comment_id": 43,
				"body": "que pasó guey",
				"added": 1526670084
			}
		],
		"5_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 15,
				"body": "> [pq9p](#comment_17_141t775YRGcErzqqn4dwUyUQqZrjhdnN3n): prueba a ponertelo en el pc o en una raspberry,.. a modo de nodo y conectate a traves de el.\n\nbuaf ni zorra como hacerlo",
				"added": 1525843655
			}
		],
		"1_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": [
			{
				"comment_id": 16,
				"body": "> [mol34](#comment_3_1QHQwahb3NY1K4SW1pz9M38XykreTXufsQ): si teneis invitacion para forocoches, llevo buscandola mucho tiempo. Enviadla a mol34@hotmail.com\n\nque te gusta un Forpus mol34",
				"added": 1525843766
			}
		],
		"1_1BtvTmkd3psSAD1Fyaz13nP5Rdfuj3peBf": [
			{
				"comment_id": 18,
				"body": "porqué no,  miarma?",
				"added": 1525931897
			},
			{
				"comment_id": 24,
				"body": "venga coño spameemos zerocoches, con cunetas falsas",
				"added": 1525976672
			}
		],
		"1_1JrmrM8rYUPphHfLiq6c42G3cpZMike7r4": [
			{
				"comment_id": 19,
				"body": "ve ahorrando, 600.000 euros de multa son muchos euros",
				"added": 1525969293
			}
		],
		"2_13VaS2XUc4paeNGrGQcjFuq6oaHMTnjT79": [
			{
				"comment_id": 20,
				"body": "buena iniciativa",
				"added": 1525970195
			},
			{
				"comment_id": 26,
				"body": "van a caer multitud de cunetas, más que niños muertos en una eyaculación...",
				"added": 1525979345
			},
			{
				"comment_id": 38,
				"body": "la funcion de esto es colgar las cosas que ilitri censura en fororeich",
				"added": 1526224375
			},
			{
				"comment_id": 39,
				"body": "> [arbol](#comment_38_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9): Osea que vamos a seguir soltando billetes a ilitri?\n\npensándolo así , no me mola la idea la verdad",
				"added": 1526243022
			}
		],
		"2_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": [
			{
				"comment_id": 21,
				"body": "no lo veo... porque no hacemos un foro  .onion?",
				"added": 1525971177
			},
			{
				"comment_id": 22,
				"body": "-en primer lugar, la censura la da ilitri (fuera ilitri se acabó la rabia)\n-en segundo lugar: los servidores deberian estar alojados en otro lugar fuera de España.\n-llegado el caso de un bloqueo de dominio, proxy y fuera.\nEl principal problema que le veo que no puede ser algo muy rocambolesco su acceso ya que el trafico se vería afectado.",
				"added": 1525972538
			},
			{
				"comment_id": 29,
				"body": "net2 quiero admin, los que empezamos en zeronet y queremos aportar nos merecemos iniciar esta nueva andadura, todos juntos...",
				"added": 1526016748
			},
			{
				"comment_id": 32,
				"body": "> [net2](#comment_28_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr): ¿Alguno se le ocurre una idea de como evitar el registro por mail? He pensado que igual es buena idea habilitar el registro sin mail, lo malo es que si se pierde la contraseña se pierde la cuenta.\n\nhombre a ver, perder la cuenta, si el foro llega a tener embergadura y tráfico es una putada... yo veo mejor si es por tema de anonimato, que las cuentas provengan todas de protonmail.com  por ejemplo con servers en suiza y correos son encriptados, o de cuentas de Secmail  de la DW http://secmailw453j7piv.onion/src/webmail.php",
				"added": 1526153180
			},
			{
				"comment_id": 37,
				"body": "> [net2](#comment_30_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr): El foro no registra las IP\n\ny eso?",
				"added": 1526163717
			}
		],
		"1_12zrAgQV3EDef7kGBNrn1nfnwBczyovPtT": [
			{
				"comment_id": 23,
				"body": "entiendo que tiene unos cuernos como el padre de Bambi",
				"added": 1525976620
			}
		],
		"7_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 25,
				"body": "> [ioc](#comment_28_1BxoC1C7mdBnZgCRtshd7pxQDfiJysFLBC): Buena estrategia de marketing, pero como no suelte invis, esa gráfica va a volver a su nivel normal.\n> Si quiere incrementar la actividad de un forro, debe hacer 2 cosas: 1º- Un tema que focalice a su foro y 2º- Una vez conseguida la atención, debe aprovecharla incrementando así la actividad de este cediendo más invis.\n> No me responsabilizo de los usuarios que pueda generar, quizás son de peor calidad o de mejor.\nAdemas es tal cual lo comentas, con solo ver los temas candentes más buscados...http://fs1.directupload.net/images/180510/ap6qm4yb.png",
				"added": 1525977321
			}
		],
		"4_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 27,
				"body": "tambien los mP? como sabes eso fuck mosquitoes?",
				"added": 1525979871
			}
		],
		"1_14G2wv4cuxKPhE94pDN6ZEBtScjcm2uyGV": [
			{
				"comment_id": 28,
				"body": "puff activando acceso, saludos a la GC... oh wait",
				"added": 1525982122
			}
		],
		"3_17Yr1nddo5LnE9vxbqAgJ6mK8kEBJZZbNz": [
			{
				"comment_id": 30,
				"body": "ese mismo articulo es el que deberiamos spamear",
				"added": 1526027832
			}
		],
		"5_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 31,
				"body": "lo he visto esta mñana y a simon le queda poco para estar dando palos en el mercadona...",
				"added": 1526057266
			}
		],
		"1_19JwR8jbwUH8Nyo4JffMMxt7hu8HUhPS7c": [
			{
				"comment_id": 33,
				"body": "en el navegador de tor, al lado de la cebolla verde hay una S, pulsa y habilita el javascript temporalmente para toda la pagina... y me cuentas",
				"added": 1526153470
			},
			{
				"comment_id": 34,
				"body": "le has puesto que a la direccion 127.0.0.1  nada de proxys¿",
				"added": 1526154056
			},
			{
				"comment_id": 36,
				"body": "> [arbol](#comment_35_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9): A lo mejor el nivel de seguridad afecta en algo, ni idea shur\n\nno, porque yo lo tengo al maximo y ningun problema",
				"added": 1526162841
			}
		],
		"2_1LN2SJuN2XMLjCZttsXLdsyq3kwiFnS7yj": [
			{
				"comment_id": 35,
				"body": "es bastante buen foro la verdad, lo unico prohibido como es logico el CP",
				"added": 1526154109
			}
		],
		"1_1KKSpUM5yc3BML9psRK2fML6mJ2mKnRD2y": [
			{
				"comment_id": 40,
				"body": "foroReich no cesa en su censura",
				"added": 1526287465
			},
			{
				"comment_id": 42,
				"body": "> [ioc](#comment_31_1BxoC1C7mdBnZgCRtshd7pxQDfiJysFLBC): Pues a la hermana melafo\n\nni con un palo",
				"added": 1526594425
			}
		],
		"1_1PrGqYS76NH78qs54gS2c4ddjpk5VRK2bA": [
			{
				"comment_id": 41,
				"body": "> [pepepotam](#comment_3_1F66PvnjaGjTJxYBAm1kUfQ6M3yuz87Kx1): http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1j13A3eCxHJ8W8z1NC5MszVAh4UtWFa32/1525735008-QnVyYnVqYQ==.zip no va no pasa de los 5mb descargados\n\na mi me pone ...not found",
				"added": 1526293855
			}
		]
	},
	"comment_vote": {}
}