{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1611804314,
			"title": "Zeronet Tor Trackers",
			"body": "I noticed that there is like only 1 default zero net trackers. Any other tor trackers?",
			"added": 1611804313
		}
	],
	"topic_vote": {
		"1611802829_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": 1,
		"1611861018_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"1622828057_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": 1,
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 87,
	"comment": {
		"1_1B5iBCuHQgbGdgTJmM2A2pZNVfpfp3EU5u": [
			{
				"comment_id": 1,
				"body": "you can use hugo and probably even hexo, since these output static files. \n\nFor hugo, just have to copy the \"public/\" folder to the zeronet folder that corresponds to your zero site\nFor hexo, just deploy via rsync to the zeronet folder that corresponds to your zero site\n\nIDK how to do it with jekyllrb but I am sure as heck there is a way, you just need to copy the files it outputs to your zeronet site folder.\n\nHugo example\nhttp://127.0.0.1:43110/126fBtopb2n7Pc42KhZyZyHhZKrecAdMdR/",
				"added": 1492201928
			}
		],
		"1_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": [],
		"1_1BiouZaoK2zKaqSihxi7LudLqix6ynXYtj": [],
		"1_1KAjEoAZg6djJXPT5i4VMRwMZkghqRJ1zC": [],
		"3_1KAjEoAZg6djJXPT5i4VMRwMZkghqRJ1zC": [],
		"11_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "Yeah zeronet is more like a more security relaxed and modern web technology version of freenet.",
				"added": 1495855660
			}
		],
		"1_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X": [],
		"1_1PqLL4biB8q67AMyeDJCYz34EihFDVzXBp": [
			{
				"comment_id": 19,
				"body": "It can be, however people are too stupid to click install so we need more proxies imo.",
				"added": 1496105415
			}
		],
		"1_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": [
			{
				"comment_id": 20,
				"body": "you can make a board, similar to this one, or make our own leftchan here. I hadn't thought about it but its a simple 1 2 click.\n\nI wouldn't be so quick to say that anarchists dominate ZN because not that long ago there were a bunch of chinese people(they were writing in mandarin but its still an assumption on my part), then before that a bunch of Trump supporters(or alt-right people?), etc. etc.\n\nHonestly, I think ZN is mostly filled with trolls than anything else... but what do we expect from the internet?\n\nI do consider myself an anarchist. Specifically I guess I am an ancom, but thats because I don't trust people like \"band together\" and do good or take care of people. (we should care for one another but that is because I am also a christian)\n\nI like to operate on a distrust model. I assume the worst \"X\" until I see otherwise. (yes, I am aware communism corrupts but I also advocate for allowing watch dog organizations to keep people in government on the straight and narrow path)\n\n> [planespherev3](#comment_213_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Too bad so many anarchists here still believe in representative democracy.  [...]\n\nI wouldn't be so quick to that either. Well again it depends where you are looking at. I certainly wouldn't blame the anarchists to believe in representative democracy because I know from experience that people are lemmings. (the problem of \"mob mentality\" and \"cognitive dissonance\" is strong with our societies and it is dangerous)\n\nThey will follow any \"cause\" so long as you make it relateable or entertaining enough for them. One day they will advocate overthrowing the state, the next... they advocate for \"X\" stupid thing.\n\nLong example... (tl;dr below)\n\nI personally believe we should be like Jesus, basically live humbly and not give a shit about the government.  if you read the part of the bible that talks *specifically* about Jesus and in particularly his disregard for both roman law and jewish law (in matthew, john, luke, and mark), we can actually see that Jesus is acting like an anarchist, he tells us that we shouldn't be concerned with the jewish laws; we should just LIVE peacefully and he rebelled against the jews who thought all 600 laws (however many, idk) there fair and just. (mind you Jesus also told his followers to just pay their taxes but did not really acknowledge the title/power the Caesar held when crucified)\n\nHowever as much as I like Jesus and compare him to an anarchist, we know he was very compassionate, he explicitly told his followers to unconditionally love... However, I have to remember that after Jesus died, the catholic church took christianity all over the place: \"its about sin and we should be sorry (live in penance or spread Jesus via *force*)\", \"no gay is a worse sin than drinking because...?\", \"oh but we should worry about abortions, never mind the bible preaches the opposite of pro-life\"... and many christian people just lose sight of the original idealism that Jesus gives us. \n\nbasically the same shit we see in every god damn religion; love one another... and yet this is so hard for many religious people to do. \n\ntl;dr... I can't think of a better example of a lemming example than the church I grew up in. People think lies just because a priest (a person of \"power\") says its true and do not bother to think critically or understand the truth. (and yes that truth involves even questioning God, we may not be that special or complex)",
				"added": 1498192749
			},
			{
				"comment_id": 22,
				"body": "whatever, here you go. A board for talking all things anarchy. (ancoms, ancaps, etc rejoice)\n\nslide to the little \"burger\" (the settings button on the top right hand) to the right and select \"download and help distribute all files\" and we can all just host the damn thing.\n\nhttp://127.0.0.1:43110/1MUdFSVRfzKrW9zvvQbebGk2VDekcYXtW9\n\nIt should work unless... I'm dumb. (which is entirely possible)",
				"added": 1498450908
			}
		],
		"1_1KjKGbXe5KwQkmHdtsyhp1TzRieGu3wPBw": [
			{
				"comment_id": 21,
				"body": "United States",
				"added": 1498361691
			}
		],
		"1_1Ho48cxWwRFdDChHksp1fhdPvGmpaiZfcH": [
			{
				"comment_id": 23,
				"body": "\" host internet sites that don't get pulled down by different powers in the world.\"\nYou came to the right place friend. The only way to censor zeronet, i2p, and IPFS is if the government begins to censor at the DNS level but even then, these systems can still work with ease if they decide to remove DNS records, censor IP ranges, and what not.\n\n\n\"I don't know if ZeroNet itself is the future or some other solution but I am really interested in the way it works with it's decentralized solution.\"\nYeah zeronet isn't the only solution. I personally would love it if freenet won this war because it does not require the use of javascript... but where I live, my ISP will slow me down the instant I start running it.\n\nWhichever wins it will have to be a very adaptable and modular system. I agree.",
				"added": 1503173050
			}
		],
		"8_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": [
			{
				"comment_id": 24,
				"body": "Since Zeronet is peer to peer do we really need it to distribute content? people that like things just need to click a little button to distribute content.\n\nWhat this would be for is for content providers I assume? \n\nbut in that case I think a zeronet version of say like patreon would suffice.\n\nWhat other usecases would enabling a miner in the browser really do for Zeronet or people that make content?",
				"added": 1506361081
			}
		],
		"1_17H8EGEoNF1z2AXFtXmBQJLHTmh7gMGzzS": [
			{
				"comment_id": 25,
				"body": "You guys need a way to submit bugs and the like.\neg. This video plays nice BUT when I click the download link, something you are running is concatenating your link to download videos. \nhttp://127.0.0.1:43110/kopykate.bit/?Topic:4_1LeZqbLv8mMF9Q9qvQeJX8mivvG7ykJUeC/Beep+Beep+I+m+a+Sheep+Minus8+Version#\n\nThe video says the link is https://www.kittyseedbox.tk/kittify/uploads/Beep%20Beep%20I\nbut in reality the full url is https://www.kittyseedbox.tk/kittify/uploads/Beep%20Beep%20I'm%20a%20Sheep.mp4.torrent",
				"added": 1506361414
			},
			{
				"comment_id": 26,
				"body": "> [orien3242](#comment_25_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): You guys need a way to submit bugs and the like.eg. This video plays nice BUT when I click the download link, something you are running is concatenating your link to download videos.http://127.0.0.1:43110/kopykate.bit/?Topic:4_1LeZqbLv8mMF9Q9qvQeJX8mivvG7ykJUeC/Beep+Beep+I+m+a+Sheep+Minus8+Version# [...]\n\nNevermind I did not read... :x",
				"added": 1506361450
			}
		],
		"1511956110_1AZYSfyeKjZbAN9BPYYFf1FCSm9ujLXMcu": [
			{
				"comment_id": 27,
				"body": "I would alos love to see i2p support but I remember a joke I'd like to share, IDR who said it but it was on I2P IRC.\n\n\"You either develop for I2P or get paid.\"",
				"added": 1512354581
			}
		],
		"1511798060_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 28,
				"body": "on it.",
				"added": 1512354622
			}
		],
		"1524090493_1A38V1SUbZeW7nLwZjBtXj2suQJuh3L1Sk": [
			{
				"comment_id": 29,
				"body": "How to access deep web child porn.\n\n1- Obtain gun\n2- Aim at your own head\n3- Pull trigger\n4- Success",
				"added": 1524109906
			}
		],
		"1530800079_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [],
		"1531226793_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [],
		"1532295492_1C9Px1MBmLUnwGHX8SoBTPYyM6S7HC2Lou": [],
		"1532143906_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 34,
				"body": "> [pag](#comment_6_1Bppp2Vnp1JiQQyhL6JFsP8Gznfb8cKAB5): A genetics origin for homosexuality makes no sense. Homosexual couples will naturally have fewer children than heterosexuals, so this trait would have been selected against and it would have disappeared over time.\n\nThings like cancer and auto immune diseases can proliferate via genetics as a deficiency of certain genetic traits.\n\nA composite gene that needs 2 or more flags missing can cause things like MS or make a person prone to other auto immune diseases.\n\nStudies have also found there are hormonal components to sexuality. Things like increased levels of progesterone in people seem to have a co-relation with people whom are willing or able to accept having a homosexual encounter.\n\nThere is certainly a genetic component we are missing.",
				"added": 1537129173
			}
		],
		"1571185468_15io4gegLAkgg9jNErcMyY6bpD64HULMCw": [
			{
				"comment_id": 35,
				"body": "Be gay and do crime, brother",
				"added": 1571188481
			}
		],
		"1571752607_1E8JhJj7ukAx8ukr1iwV4Qvgn3UZkai6vP": [
			{
				"comment_id": 36,
				"body": "you have to give it time to load all the posts. I don't normally boot into zeronet but when I do I have to wait like around 4-8 hours to see all posts from large volume sites like millchan. (mind you I go offline for months at a time and load zeronet off a usb portable hard drive on a machine that is 8 years old)\n\nRemember the site isn't hosted on a central server all the posts and stuff is on your hard drive so if you have an old machine or a mechanical spinning drive it will take some time to load all the hundreds of freaking thumbnails.\n\nDecentralized does not necessarily mean faster than what you are used to seeing other normie sites like 4chan or 8chan or 2chan or whatever.",
				"added": 1571796663
			}
		],
		"1571697285_1koSUG26DkPTFK23zE8JNnpeVQsCuPJhr": [
			{
				"comment_id": 37,
				"body": "cool story bro.",
				"added": 1571796715
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 38,
				"body": ">banning on a decentralized psuedo-nonymous network\n\nare you new here? just block him on your feed or whatever or just ignore the crazies. We do it AFK when we just pass the crazy people who say the end of days are nearing all the time.",
				"added": 1580187491
			},
			{
				"comment_id": 39,
				"body": "> [tawny](#comment_3_1DMbBh3c4jvrGNycqXj6X2vsDuoSkvynKe): Don't ban, just mute it (sorry, him...)\n\ndid you just assume an anonymous crazy person's gender? you gon' get it now.",
				"added": 1580187561
			}
		],
		"1580063953_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 40,
				"body": "enable tor only mode through bridges you trust and you can access zeronet from deep web. \n\nanother thing you can do is buy a host on a VPS and run zeronet from there via a VPN or SSH port forwarding.",
				"added": 1580187940
			}
		],
		"1580070228_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [],
		"1580020434_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 43,
				"body": "it needs a UI revamp. Like its great in theory F2F networks are really great for privacy and really hard for state like adversaries from attacking them but the UI is so shit. \n\nits laggy, permissions on sharing are confusing and tedious if you have a group larger than 20, the web ui lacks features. \n\nbut its like a better alt to like freenet imo.",
				"added": 1580188500
			}
		],
		"1580253527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 45,
				"body": "piratebox is a favorite but its more federated.",
				"added": 1580359591
			}
		],
		"1611017756_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": [
			{
				"comment_id": 46,
				"body": "> [zonateam4622](#comment_7_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs): same problem over tor i think Tor continue to Received ddos attack .. i am using whonix and Vanguard the addon i see possible bug or Attack on tor .. Each hours ..  https://www.technadu.com/attack-tor-causes-v3-onion-downtime-experimental-fix-land-soon/240121/ [...]\n\nits a bug check the tor twitter and update your version of tor. \n\nhttps://twitter.com/torproject/status/1348416870249074688",
				"added": 1611023389
			},
			{
				"comment_id": 49,
				"body": "> [zonateam4622](#comment_8_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs): a bug okais but for the whonix workstation i have Update the tor to the last if is patched already .. i dont speak well english but for the gateway .. i dont see how to upgrade tor .. in whonix check all same to be ok .. tor 0.4.4.6 recommended i think is whonix need to offer a new version of tor for whonix . ? is maybe the problem why i have update failled with all of my project on zeronet , and i see in vanguard log   possible tor bug or possible attack at Each hours .. is continue !\n\nno worries. Americans also not great at english. LOL \n\n4.4.6? hmmm... may be ddos then. That is the newest tor. Hopefully they will stop playing soon.",
				"added": 1611059615
			}
		],
		"1610974197_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 47,
				"body": "Three things I always use now. \n\n- GPG with trezor or some GPG hardware\n- 7zip full AES encryption\n- Stegosnow (or a variant I am working on)",
				"added": 1611023532
			}
		],
		"1610487411_1Etm6vDz6ED5oGHsXGFpCDb3PNw8shgdx": [
			{
				"comment_id": 48,
				"body": "Why do you think people like Elon and other companies like Nissan and Ford and SPRINTING to \"renewable energy\" they see that the cash cow is almost dead and that people will pay for the illusion that everything will be okay and fixed.",
				"added": 1611023603
			}
		],
		"1610822564_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 50,
				"body": "tor only mode. I might enable non tor mode one day though. \n\nCQEGAcOXxsFNBF7CmGMBEADfUqbNdGQoxxrwUNIdlR8JUK4XE6ncG65qIB+iWpVQ\nl571KGUCzWiWBci5D5VIUN37kqNTzEdAfM+qjhZ/PO+zStkHzz8jFrX0pgK5Q0Pq\n1VAR222zUu+vZjpW5nq7Qy8jeMTOb7MfyoEjZZewR2CAtuPEkKiI0vdyjjDYV3hr\nwvyqZcr25B/mk4eJFdMoUJO8wIXiGVw361SX1+ngP1E3QuNKv+l/uXabxSXzSg2O\nMlAxfALeMlRmaL9mpCIxq7MpoF3e5m9u3DGlDYmEFIpGTMyrlI/XE7WCRd5XUcLv\nlWQ4VkYOkN8w5AAGDp6Ii6H2Y95t2CMi/4AKeNaMoPHoivhfMkMn7kJqLTwzqveN\nBsYnv0/kUlsGok40Z4j3xED3Xq0HJHXTH/hUKERo2bfgyF2vIbjm37sQJUaSxF6D\nsqjeZqGc/CZVlshm1yUCMfV8UH4m0/9h6xAIHb04XrWSv6ZFepX8xRioMi6M3GBS\noP5mNZpLAw1uN8VCHmqWNcniPwLvM0v8AAnCMSh2nkrrP3ju+wPKgyVlFLxc5uLs\nAc8sGSAeWQ+awz0JxYwGLWyuZcw8SoK9v3nw0AnZGS+Mq6jVhh4lFhA4TUhA5tiJ\nofAZB8fiJ7k2hYQ+CjIwuMxPBi2KYshLCCp1aZLRYH/4BXiNQGdDoKXii3FgK2JW\nSQARAQABzSNqb2Vkb2UgKEdlbmVyYXRlZCBieSBSZXRyb1NoYXJlKSA8PsLBXwQT\nAQIAEwUCXsKYYwkQNklnEUtTwR0CGQEAAOdNEACgDYayaUgTIvugW14mIubckH0g\nfHF4FgjZQJddsSz6y07XO3AdiDZ8syn9lRvVsQl4Ei9LM5aanmBuqjRs0ftK/st3\nA5Io2yzHjRFNlmBg0AZJ0pekSzfQqSicYR7c6kKIfDOSniUDlOXIXYpi7w1CUq9Q\nbBvdztCWhxlymqpGxp7F76SeN1wdq76SdFV2+l7GxfCY07HJO32cV6l/sYcSEKUX\nbj8HToUovGM1o0OA3mQzHqxBqfa3WU2BlX1Ph/hAL7aFPKckrW5W3K3Pb2FaT6Qi\ncdehON5dsYLZatybSHl+H2OfZAVbJc2rbsQLaRjr5aVnXtiwrSzIHjYcox/zNvzN\nRMZKwM1XnlLGQ6mhZcVNuT9QHjopT6tm2pachzxV9SVSqGmJ75dUEFMK7ielG8JF\nZF5hRH7xoig0ztHOKCByxDyuizf7FRfqrIit6Ndg9fvDvgTJGDQmfpTTB9011oDD\n8+skY+GWuRvKbIZvC0T9K7uLlc9j7XCUSt2d0NvTh8G0Se8v8w8c3WdNDZIfVopP\nfX0xkEYOKtdi0Dr1aO0elDAsGRGGpJZsd3XuWBYMPKJiEb82jpb9k8p7u3GY1nU3\nu0PXUI9CoJUyjew1RpTTQon9O7ktWHgZfPKaSlT6He4g73yx32hLzs6B6qmqs3bt\nNO+rmGLV+m3L9JzCCAgbamF6aXRmd3IzeDRrbTV6My5vbmlvbjo5ODc4BghncmVh\ndGZveAUQtm0HfhBpF4/CTwzYUyRotAcDjFrr",
				"added": 1611060062
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 51,
				"body": "> [simonbellamy](#comment_32_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT): What about Wire, Wickr, Threema?\n\nif its not open source and 3rd party verified its not good. Full stop.",
				"added": 1611095022
			},
			{
				"comment_id": 55,
				"body": "deltachat? uses any IMAP server. It would work wonderfully also with i2p to be honest. \nTor would take some work to make it work.",
				"added": 1611803977
			}
		],
		"1611103567_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": [
			{
				"comment_id": 52,
				"body": "sounds like a good reason to switch to brace",
				"added": 1611114542
			}
		],
		"1611098873_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [
			{
				"comment_id": 53,
				"body": "so did anything happen?",
				"added": 1611190537
			}
		],
		"1611726067_13tGzarcdadLitoZsqPPW8WHypGtdNxz9L": [
			{
				"comment_id": 54,
				"body": "they already are using it.",
				"added": 1611803472
			},
			{
				"comment_id": 62,
				"body": "> [getoutofthis](#comment_1_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7): If there are opinions existing in the world so convincing, that they can convince so many people, why should anyone want that opinions to be silenced? If a thing is so convincing it must be the truth. How else can you know which is truth when not allowing an open discussion about it? The truth can be anything. It is true even if you think it is not or it is bad or evil. The truth will always find its ways into reality and the mind of the people.\n\nHello me from 8 years ago. You are right. However understand that the truth will sometimes lead us away from happiness and fullfillment. Even though the truth seems like it will bring about balance to the world. It won't because people would prefer a lie that makes them happy than the truth that will cause them turmoil. \n\nSo take my advice and control the lie so people don't reject the truth. \n\nLove you pal. You don't tell yourself that enough.",
				"added": 1611926403
			},
			{
				"comment_id": 63,
				"body": "> [quantumkitty](#comment_3_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Either way, just mute them, or sit back and laugh with us [...]\n\nI like laughing at people who think trusting all of the world's problems on 1 thing. \"its the jews fault\" or \"only this person can stop criminal immigrants\" as though these things are the simple explanation for why things like death and suffering exist.\n\nGuess what no jews = you still die alone with gallons of cum in your stomach hoping femboys will love you. Congrats 5head.",
				"added": 1611926685
			}
		],
		"1611804314_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": [
			{
				"comment_id": 56,
				"body": "zero://boot3rdez4rzn36x.onion:15441\nzero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443\nudp://tracker.coppersurfer.tk:6969\nudp://amigacity.xyz:6969\nudp://104.238.198.186:8000\nhttp://tracker01.loveapp.com:6789/announce\nhttp://open.acgnxtracker.com:80/announce\nhttp://open.trackerlist.xyz:80/announce\nzero://2602:ffc5::c5b2:5360:26312\n\nOnly 1 onion based tracker",
				"added": 1611804364
			},
			{
				"comment_id": 57,
				"body": "> [qzm](#comment_25_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX): You need syncronite. I’ve got 125 trackers connected.Http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/\n\nhmmm... they should add that to \"top life hacks\" videos. Thats an interesting method.",
				"added": 1611834139
			},
			{
				"comment_id": 58,
				"body": "> [477](#comment_2_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4): These trackers are support tor. [...]\n\nThanks. Added.",
				"added": 1611834151
			},
			{
				"comment_id": 67,
				"body": "> [2024](#comment_17_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg): I love onions.\n\nsame",
				"added": 1612052606
			}
		],
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": [
			{
				"comment_id": 59,
				"body": "> [seagrove](#comment_2_1MaS4T9CrHQknQputukkd923qhYAkpXB5V): Why can't I see the content of this post，but can reply?\n\ngive it time. Remember each \"zite\" is basically a torrent. So if there aren't many peers or more likely your ISP does not like torrents, they can and might slow down your connection to zeronet sites (\"zites\")",
				"added": 1611835810
			}
		],
		"1611883036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 60,
				"body": "> [styromaniac](#comment_2934_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Or message Nofish on ZeroMail.\n\nI sent him a post a while ago but he hasn't replied or done nothing.",
				"added": 1611887828
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 65,
				"body": "> [arione](#comment_15_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY):\nok",
				"added": 1611927476
			},
			{
				"comment_id": 66,
				"body": "> [werevolt](#comment_7_19ZUAyEjVPBC7EDfQoBfaugohL6HzE1qWt): Users, it's obvious that some of your comments from the thread are gone. YOU ARE SEEDING TOO POORLY YOU ARE USING POOR OS ETC\n\nNo I am deleting comments because I don't want to reach my limit.",
				"added": 1612005564
			}
		],
		"1612299574_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": [
			{
				"comment_id": 68,
				"body": "> [zeroflag](#comment_5_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu): True. But then why not download from there in the first place?\n\nYou know it might be a good idea to share the offical magnet links for official ISOs. The whole point of zeronet is to literally replace the normal old internet and make it uncensorable.",
				"added": 1612301414
			},
			{
				"comment_id": 69,
				"body": "> [zeroflag](#comment_6_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu): Well, the internet is basically just computers and routers. So the essence for torrenting and ZeroNet as well. [...]\n\nSorry to burst your bubble but your hypothetical will LITERALLY never happen. Even in the wake of big tech censorship, WSB, and internet shutdowns in oceanic countires tor and zeronet traffic have not significantly increased. \n\nIf you think people are dumb enough to download fake linux distro why don't you and I try to convice like debian or other linux distros to have offical repos and sites on zn?",
				"added": 1612323519
			}
		],
		"1613587814_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 70,
				"body": "go into your zeronet folder to see your comments and delete your old comments.",
				"added": 1613591045
			}
		],
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 71,
				"body": "Florida is the  place to go after you kill 5 people and then want to settle down and marry your cousin with a pet alligator",
				"added": 1616259575
			},
			{
				"comment_id": 72,
				"body": "> [sword00000](#comment_54_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S): The establishment hated DeSantis all throughout 2020. Now in 2021, turns out he was right, and a lot of people love him\n\nfrom 2016-2020 the republican party was the establishment and people loved that he brown nosed Trump because he echoed a lot of Trumpisms",
				"added": 1616338702
			}
		],
		"1622967007_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 73,
				"body": "dear stupid,\nnext time a school shooting happens drop your address so I can literally kill you without a gun. I'll make sure to knock politely and ask your mommy if you can come out to play and then pat your loved ones in the head.",
				"added": 1623148971
			},
			{
				"comment_id": 74,
				"body": "> [fbipurgers](#comment_27_1GcwzZUdjRJgy64A6owbCayRMbsJgHCw1v)\nlol are you implying you know that the US is authoritarian even under republican rule or are you implying that somehow nazi germany outlawed guns for its citizens?",
				"added": 1623175684
			},
			{
				"comment_id": 75,
				"body": "lol so much brain rot. a2 2a 2ndA fbi cia \n\ny'all want to fight for freedom but then don't want to risk your own anuses on going to china or russia and freeing all the people there. I wish I could say \"don't have children\" but I can see the incest train is still chugging along.",
				"added": 1623242207
			},
			{
				"comment_id": 76,
				"body": "> [1cool](#comment_6_1Jx6T54kHfQvJBEP7HvtnDWrXNkjX7gepk): why should anyone in the states give a shit about russians and chinks?\n\n1. because zeronet was made by a chinese person\n2. because i2p was made by a russian\n3. because despite having a USA USA USA anonymous internet (tor) y'all always end up thinking the CIA bugged it\n\nI don't see you being smart enough to make a \"MADE IN USA\" zeronet retard.",
				"added": 1623475444
			},
			{
				"comment_id": 78,
				"body": "> [1cool](#comment_7_1Jx6T54kHfQvJBEP7HvtnDWrXNkjX7gepk): Who said anything about making another zeronet?  I care about the individual freedoms of americans over those of the chinese.  Why is that such a strange concept to you?\n\nSo no new zeronet? enjoy getting digitally fucked with no updates from \"the chink\" who made zeronet, retard. So with no updates from him in months you will effectively be running outdated software. Unless... you are going to do updates for zeronet you will keep on using this chink software and like it with a USA patriotic smile and say \"thank you nofish may I have more of your shit?\"\n\nYou can only worry about your own freedom because thats never guaranteed even in the US.",
				"added": 1623512063
			},
			{
				"comment_id": 80,
				"body": "> [1cool](#comment_8_1Jx6T54kHfQvJBEP7HvtnDWrXNkjX7gepk): nigger what are you even on about?  if zeronet stops getting updated people will just use something else.  you sound like a boomer.\n\ndear retard, \nYeah I'm a boomer and let me tell you its your zoomer fornite idea of just moving away to something else why 800 mother fucking drug dealers in the US got arrested the past few months for using and FBI created chat app. \n\ndrug dealers today, dissenters tomorrow.",
				"added": 1623590996
			},
			{
				"comment_id": 84,
				"body": "> [kapec](#comment_105_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I thought he was Hungarian.\n\nI could be wrong. honestly if time has taught me anything its that american burgers like OP and myself have this high sense of superiority when \n1. we don't remember who the fuck does what?\n2. we think that guns are somehow a replacement for critical thinking when it comes to defending freedoms",
				"added": 1624073710
			}
		],
		"1623356651_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 77,
				"body": "> [g8wl6n](#comment_2_1QArHQfn2ikmHDuqvBPcDPpomSrJtKqiZB):  it's fast and reliable but we need a better solution without all the java script crap, this have so much potential\n\nIts called freenet or gnunet but enjoy dealing with the child porn shit there. Also there is retroshare with is C based but enjoy the dead scene there. There is no pleasing you guys.",
				"added": 1623475539
			},
			{
				"comment_id": 79,
				"body": "> [g8wl6n](#comment_4_1QArHQfn2ikmHDuqvBPcDPpomSrJtKqiZB): well cp is here too\n\nyeah but we have blocklists that advise what to stay away from and you don't distribute images by default",
				"added": 1623588771
			}
		],
		"1623652167_1ByyvGdKSdKTywR6F8tmFAk3RsWUHP962E": [
			{
				"comment_id": 81,
				"body": "Git storage: \nhttp://192.168.1.206:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/",
				"added": 1623670200
			},
			{
				"comment_id": 82,
				"body": "there is also text based storage. \nhttp://192.168.1.206:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/",
				"added": 1623670353
			},
			{
				"comment_id": 83,
				"body": "> [baduser](#comment_36_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): You should really replace your local IP with 127.0.0.1. No need to expose your internal network addresses to the world (also they don't work for anyone except yourself).\n\noops sorry.",
				"added": 1623692044
			}
		],
		"1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA": [
			{
				"comment_id": 85,
				"body": "so what you are telling me is that you are the reason why suffering and evil exists today and will continue to flourish?",
				"added": 1624073893
			},
			{
				"comment_id": 86,
				"body": "> [adherent](#comment_1_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA): I've been doing more research and I think I was misguided. I should not have said become God I should have said become like God. \"On earth as it is in Heaven\" is what I meant\n\nlike and is are both states of active being. You are still taking responsibility for all the evil things out there.",
				"added": 1624302749
			}
		]
	},
	"comment_vote": {
		"8_1HxiFjyEUfLeqvXza7TqV1h4mpo167JnrL": 1,
		"19_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5": 1,
		"1_1KAjEoAZg6djJXPT5i4VMRwMZkghqRJ1zC": 1,
		"336_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"15_13Zs1NLz7LS9NsWtaQLwBmUZEXfz1i3agg": 1,
		"63_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"338_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_19pNrZbnLjLmrvT58rRhhabTS6BE7nyP4E": 1,
		"924_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"69_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"366_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_19nnrnW6z3bd5zwdmw1mspxauqY4Eram85": 1,
		"214_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"2_18ts75nBNcXqWm6edB8pzn6Hr34JVUCrfx": 1,
		"2_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni": 1,
		"68_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": 1,
		"26_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"3_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": 1,
		"40_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"515_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY": 1,
		"1_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": 1,
		"30_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"29_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu": 1,
		"65_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"71_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"2007_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY": 1,
		"38_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"2_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz": 1,
		"561_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"2_14bm4C2yZgQkeB6SYLABAPwDboQFH3igtU": 1,
		"26_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": 1,
		"4_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"7_1Pxg9q2iUdQkbwgT459ArjQ12mpXN8cyEB": 1,
		"2_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4": 1,
		"4_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E": 1,
		"73_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"3_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"27_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"10_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN": 1,
		"6_1PrKiM2DPUkTbSHX58i25rhuHGNZ1BX7PM": 1,
		"13_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8": 1,
		"5_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": 1,
		"15_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"95_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1_14pSxPyLcN166TsqVnVQK8ZPLwdzHTkdki": 1
	}
}