{
	"message": [
		{
			"body": "@yilmazerkan@zv: Hey any idea why I seem to be getting \"content publish failed\" on several sites with my zv ID but afaict not with my zeroid ID?",
			"date_added": 1460949044873
		},
		{
			"body": "hmm, actually I think it's because I have a couple of very large sites trying to download, so the zid vs zv may be a red herring",
			"date_added": 1460949697896
		},
		{
			"body": "@lily@zv: catchan does not work for me.",
			"date_added": 1460953120474
		},
		{
			"body": "@yilmazerkan@zv: I'm not getting echoes from erkan@zeroverse.bit in mail.zeroverse.bit, but I also got \"content publish failed\" so it's not clear to me I ever sent anything.",
			"date_added": 1460953184179
		},
		{
			"body": "Well now it worked.",
			"date_added": 1460953323966
		},
		{
			"body": "No echoes'",
			"date_added": 1460957548042
		},
		{
			"body": "@yilmazerkan@zv: When I try to send mail via ZeroMail using my zv ID, I get a lot of \"file invalid\" errors.",
			"date_added": 1460957570111
		},
		{
			"body": "@yilmazerkan@zv: on mail.zeroverse.bit?",
			"date_added": 1460958046901
		},
		{
			"body": "I'm wondering if the problem is that I initially registered (on ZeroMail) with my zeroid.bit ID?",
			"date_added": 1460958062036
		},
		{
			"body": "ok I'll try again",
			"date_added": 1460958079388
		},
		{
			"body": "nada",
			"date_added": 1460958131493
		},
		{
			"body": "hmm, I'm seeing nothing",
			"date_added": 1460958179557
		},
		{
			"body": "I can only imagine it's my two IDs",
			"date_added": 1460958192908
		},
		{
			"body": "can I delete the site?",
			"date_added": 1460958203476
		},
		{
			"body": "Oh, this is a problem.",
			"date_added": 1460958302948
		},
		{
			"body": "All the emails went to redacted@zeroid.bit",
			"date_added": 1460958312046
		},
		{
			"body": "well I logged out of redacted@zeroverse.bit and in to redacted@zeroid.bit and now I see all the emails you sent to redacted@zeroverse.bit",
			"date_added": 1460958408054
		},
		{
			"body": "So all the emails seem to come in to redacted@zeroid.bit regardless of whether I send them from redacted@zid or redacted@zv",
			"date_added": 1460958490232
		},
		{
			"body": "are you seeing them come from two separate addresses?",
			"date_added": 1460958518215
		},
		{
			"body": "Maybe both addresses have the same private key?",
			"date_added": 1460958525948
		},
		{
			"body": "well, and same public key",
			"date_added": 1460958545128
		},
		{
			"body": "are the IDs certificates of some kind?",
			"date_added": 1460958583804
		},
		{
			"body": "what't strg?",
			"date_added": 1460958721304
		},
		{
			"body": "ah ok. ctrl-shift-r made two of the messages disappear, but the last two are to the two different addresses. And re-logging in as redacted@zeroverse.bit and doing ctrl-shift-r again shows no messages, and then when I switch back and reload I see the messages again. So I don't think it's the cache.",
			"date_added": 1460958906163
		},
		{
			"body": "are you seeing any messages in the zv one?",
			"date_added": 1460959649127
		},
		{
			"body": "@yilmazerkan@zv: But are those messages I've sent or messages I've received? Or can you tell/",
			"date_added": 1460959788959
		},
		{
			"body": "I just sent yilmazerkan@zeroverse.bit an email",
			"date_added": 1460959816359
		},
		{
			"body": "from redacted@zeroverse.bit",
			"date_added": 1460959830257
		},
		{
			"body": "Everything I've sent shows up in my sent folder",
			"date_added": 1460959906079
		},
		{
			"body": "Ok",
			"date_added": 1460959908615
		},
		{
			"body": "5 or 6 iirc",
			"date_added": 1460959975755
		},
		{
			"body": "Does everybody using mail.zeroverse.bit download every message everybody else has sent to anyone?",
			"date_added": 1460960027274
		},
		{
			"body": "we need to figure out a more scalable way to handle that kind of data",
			"date_added": 1460960202686
		},
		{
			"body": "Maybe that just means \"integrate IPFS\"",
			"date_added": 1460960214792
		},
		{
			"body": "Yeah, I'd seen that. Just wasn't sure if it was doing something similar to optional files.",
			"date_added": 1460960256743
		},
		{
			"body": "yes, just to my zeroid.bit account. The other one still has an empty inbox.",
			"date_added": 1460960363659
		},
		{
			"body": "I did.",
			"date_added": 1460960425086
		},
		{
			"body": "does your machine have to be online for mails to work, or is there some provision in ZeroNet for authorized IDs to modify a site?",
			"date_added": 1460960523424
		},
		{
			"body": "I assume you mean need not, since must not would mean that if it were online mail@zeroverse would not work.",
			"date_added": 1460960701531
		},
		{
			"body": "what I meant was, in order to actually send email, since that's modifying the site",
			"date_added": 1460960738587
		},
		{
			"body": "I should dig through the site's data folder",
			"date_added": 1460960758087
		},
		{
			"body": "how does it find messages to put in the inbox?",
			"date_added": 1460960985681
		},
		{
			"body": "I'm guessing that's what's failing here.",
			"date_added": 1460960997378
		},
		{
			"body": "@yilmazerkan@zv: but when you send me a mail it doesn't go into my folder, right? it goes into your folder",
			"date_added": 1460961382058
		},
		{
			"body": "which means the site has to find which messages to display somehow",
			"date_added": 1460961397257
		},
		{
			"body": "@yilmazerkan@zv: also you need to put instructions for how to allow zeroverse users in a more obvious place.",
			"date_added": 1460961456376
		},
		{
			"body": "I was thinking on the zeroverse.bit page itself",
			"date_added": 1460961898620
		},
		{
			"body": "there needs to be a more scalable way to do this",
			"date_added": 1460961925376
		},
		{
			"body": "like, just allow any certificate rooted in a namecoin domain",
			"date_added": 1460961995798
		},
		{
			"body": "or at least, have the public key in the namecoin domain and just let people list the domains they want to trust without needing to also copy the public key",
			"date_added": 1460962124475
		},
		{
			"body": "Anyway, I need to go. I'll debug this more later. Thanks for your help!",
			"date_added": 1460962144385
		},
		{
			"body": "tap-drag on the 0 in the upper right does not work on a tablet :(",
			"date_added": 1460990630505
		},
		{
			"body": "@circle@zid: fortunately places with colder climates also tend to have much lower population densities. The problem is that the people who migrate first will be the poorest, so they need to find a way to fund new infrastructure to support the migrants. Which means enticing rich people to move now.",
			"date_added": 1460990720995
		},
		{
			"body": "But what we really need to be doing is figuring out how to make everyone, even the poorest, able to generate wealth.",
			"date_added": 1460990856354
		},
		{
			"body": "Otherwise we'll be in a situation where those who can afford to move, move, and those who can't afford to move die.",
			"date_added": 1460990895309
		},
		{
			"body": "Food is a bigger concern than heat waves, though, particularly in societies where a large fraction of the population survive by subsistence farming.",
			"date_added": 1460990941952
		},
		{
			"body": "If food production drops, people will starve both because food will be expensive and because those who were surviving on their own farming can no longer feed themselves.",
			"date_added": 1460990965030
		},
		{
			"body": "a basic income is fine but then you have the problem of creating an underclass of recent migrants who don't qualify",
			"date_added": 1460991615119
		},
		{
			"body": "because I have difficulty imagining people supporting basic income for new migrants, and if new migrants qualify they will resist allowing migrants in at all",
			"date_added": 1460991643624
		},
		{
			"body": "maybe colder countries could just let people buy their way in",
			"date_added": 1460991708036
		},
		{
			"body": "well if you let anyone have it you could rapidly run out of money",
			"date_added": 1460991767778
		},
		{
			"body": "well I think you still want market prices so that people can decide what tradeoffs to make",
			"date_added": 1460991800201
		},
		{
			"body": "but when you say \"money is less important\" I think \"basic necessities are so cheap that a basic income becomes affordable to most countries\"",
			"date_added": 1460991847821
		},
		{
			"body": "and maybe we would be there if so many countries didn't subsidize inefficient farming",
			"date_added": 1460991876934
		},
		{
			"body": "people hate large scale farming but it's much more efficient",
			"date_added": 1460991895739
		},
		{
			"body": "it's sustainable in that farmers have no interest in destroying their land, but it does have externalities because of pesticides, pollen, effect on insects of insecticide-containing GMOs, use of fossil fuels to make fertilizer",
			"date_added": 1460991964100
		},
		{
			"body": "but I think we should address those problems directly and not give up the economies of scale",
			"date_added": 1460991991053
		},
		{
			"body": "oh, monoculture, too",
			"date_added": 1460991999181
		},
		{
			"body": "oh sorry I'm talking too fast",
			"date_added": 1460992016964
		},
		{
			"body": "I wonder what happens to the callback for loading more messages? Does it get canceled or just not do anything when it's called?",
			"date_added": 1460992105693
		},
		{
			"body": "Even if they could succeed in making the phones secure, the networks aren't secure.",
			"date_added": 1461006624616
		},
		{
			"body": "And there is no such thing as a purely open source phone. The baseband software will never be open source.",
			"date_added": 1461006651361
		},
		{
			"body": "I suspect that if you run an up to date version of Android without all the crapware that vendors pile onto it, Android is as secure as anything else you might run.",
			"date_added": 1461008190775
		},
		{
			"body": "At least, anything with actual functionality.",
			"date_added": 1461008198102
		},
		{
			"body": "The main issue with Android security is that there are a lot of people running old versions and vendors installing crapware and then not patching it.",
			"date_added": 1461008258803
		},
		{
			"body": "Relying on carriers to get around to issuing patches, and on users to apply them, is a losing battle. I know people who won't apply patches because they're worried about them breaking things.",
			"date_added": 1461008665313
		},
		{
			"body": "Because of course vendors never issue patches that only fix security bugs.",
			"date_added": 1461008682097
		},
		{
			"body": "I know of many a \"no-op\" change that has resulted in breakage.",
			"date_added": 1461008933054
		},
		{
			"body": "This is why we need systems like Nix, where you can roll back to a known-good state at any time. Harder to do with data, though, since it's not like you can automatically revert newly-written data to the old schema.",
			"date_added": 1461009000925
		},
		{
			"body": "If the API is forward compatible you could log the operations and reapply them after rolling back, I guess. That's also very hard to do generically, though.",
			"date_added": 1461009068366
		},
		{
			"body": "Most data is not stored relationally with a schema, though. Most of it is \"document-store\" style, where you could use json or xml and just ignore fields you don't recognize.",
			"date_added": 1461009164635
		},
		{
			"body": "rooting your android is not a good way to keep it secure, though",
			"date_added": 1461009188777
		},
		{
			"body": "nor is unlocking the bootloader",
			"date_added": 1461009219563
		},
		{
			"body": "there are a bunch of copy-on-write and log-structured filesystems.",
			"date_added": 1461009260873
		},
		{
			"body": "ZFS and BtrFS are both copy-on-write",
			"date_added": 1461009278378
		},
		{
			"body": "you can't roll back to any point in time but snapshots are incredibly cheap",
			"date_added": 1461009306986
		},
		{
			"body": "ubuntu is supposedly getting native support for zfs",
			"date_added": 1461009342980
		},
		{
			"body": "Which I assume means the installer",
			"date_added": 1461009349012
		},
		{
			"body": "zfs also makes it pretty cheap to make new containers, but you need block deduplication to keep your containers from taking up more and more space as you update them. Assuming you update them through the normal means and not by updating a \"golden container\" and then re-cloning all your other containers each time.",
			"date_added": 1461009455155
		},
		{
			"body": "you could do something similar with nix since nix never actually changes anything, so every version you've ever installed remains available until it's garbage collected after no longer being referred to by any configuration",
			"date_added": 1461009522783
		},
		{
			"body": "but nix requires more modifications to packages in order to get them to play nice",
			"date_added": 1461009551105
		},
		{
			"body": "separate filesystems are also very cheap with zfs, so you could actually have a filesystem per package",
			"date_added": 1461009607159
		},
		{
			"body": "then use some kind of union filesystem to control which packages each container can see, kind of like tinycore does",
			"date_added": 1461009640772
		},
		{
			"body": "I guess docker does that too, but for emulating copy-on-write",
			"date_added": 1461009666240
		},
		{
			"body": "I really like the idea of a system with the immutability of nix but that's transparent to the applications",
			"date_added": 1461009755092
		},
		{
			"body": "I don't know how you'd handle overlapping dependencies, though. Nix doesn't care if you mix versions other than your normal symbol versioning problems",
			"date_added": 1461009847950
		},
		{
			"body": "But maybe that's a bad enough problem that you shouldn't allow mutually conflicting dependencies within a single container anyway. Nix pretends that problem doesn't exist, but intuitively it seems like you really can't.",
			"date_added": 1461009911026
		},
		{
			"body": "/me sets off to build Yet Another Linux Distro, with zfs volumes as packages.",
			"date_added": 1461009972845
		},
		{
			"body": "It seems unlikely to me that they're intentionally making older models slower. More likely they just reduce the testing they do on older models to basic smoke tests and not performance tests.",
			"date_added": 1461045220336
		},
		{
			"body": "If you're writing software for newer, more capable platforms, it's inevitable that it will run slower and slower on older platforms.",
			"date_added": 1461045245975
		},
		{
			"body": "Obviously this also works to their advantage, but given that they'd have to go out of their way not to do it, it seems silly to attribute it to some kind of sneaky agenda.",
			"date_added": 1461045308066
		},
		{
			"body": "The fact of the matter is you don't really \"buy\" an iPhone (or any handset really)",
			"date_added": 1461045329494
		},
		{
			"body": "You're really just renting Apple & AT&T",
			"date_added": 1461045338087
		},
		{
			"body": "And the phone you think you \"bought\" is really just an accessory to Apple's software, which is a moving target, and AT&T's network",
			"date_added": 1461045378877
		},
		{
			"body": "It's like how you still have to pay a huge payment up front for the privilege of leasing land in many countries, even though you don't actually own the land, you just have a 30 year lease or something",
			"date_added": 1461045421079
		},
		{
			"body": "If you really want computing hardware that will last a long time, you better have a vendor that you can trust to issue security fixes without throwing in a bunch of new features without caring about perf regressions",
			"date_added": 1461045511426
		},
		{
			"body": "Linux generally is in this category. GNOME, not so much. Though there are plenty of lightweight forks and lightweight desktops/window managers",
			"date_added": 1461045543264
		},
		{
			"body": "Android is probably a better OS for this purpose than iOS since there are so many low-end devices being sold even today.",
			"date_added": 1461045583883
		},
		{
			"body": "Ok, I'll shut up now.",
			"date_added": 1461045635479
		},
		{
			"body": "good morning",
			"date_added": 1461045655468
		},
		{
			"body": "I like Vernor Vinge's idea of a \"mature computing base\", where there's a bunch of ancient software that never changes because it's \"done\" - has only received security fixes for a few decades or centuries and there are no more bugs left",
			"date_added": 1461045755251
		},
		{
			"body": "This attracts me to the Heritage Project, but unfortunately that's muddied a bit by the fact that they've added unicode support",
			"date_added": 1461045791461
		},
		{
			"body": "So it needs a few more decades for that to bake. Hopefully they won't add anything else in the meantime.",
			"date_added": 1461045841127
		},
		{
			"body": "The best books for the mature computing base idea are the first two books of the Zones of Thought series",
			"date_added": 1461045894253
		},
		{
			"body": "Especially the second one",
			"date_added": 1461045905015
		},
		{
			"body": "The Peace War is more like a better \"makers\"",
			"date_added": 1461045926071
		},
		{
			"body": "(different series)",
			"date_added": 1461045952283
		},
		{
			"body": "All of those books are about people overcoming much more powerful adversaries by being clever",
			"date_added": 1461046107376
		},
		{
			"body": "Kind of like us :)",
			"date_added": 1461046121221
		},
		{
			"body": "ok, gotta go. back later. have a good day!",
			"date_added": 1461046201505
		},
		{
			"body": "Everyone shows as \"anonymous\" in my tox friends list",
			"date_added": 1461106828296
		},
		{
			"body": "that's not very useful",
			"date_added": 1461106832303
		},
		{
			"body": "@ezra@zid: that's me",
			"date_added": 1461106882117
		},
		{
			"body": "I have yet to successfully chat with anyone in tox",
			"date_added": 1461106925300
		},
		{
			"body": "I added you on tox because I know your tox id :)",
			"date_added": 1461106949689
		},
		{
			"body": "Because you shared it in here.",
			"date_added": 1461106954134
		},
		{
			"body": "I have never heard \"did we raise pigs together\" but I think I can guess its meaning.",
			"date_added": 1461106984498
		},
		{
			"body": "the world of people interested in privacy and with the technical chops to even be able to use tor + tox is a small one",
			"date_added": 1461107030491
		},
		{
			"body": "@ezra@zid: I set my nick in Toxic with /nick",
			"date_added": 1461107048517
		},
		{
			"body": "I think in Antox you always set your nick so I'm guessing you're also using Toxic and that's just its default nick",
			"date_added": 1461107074776
		},
		{
			"body": "(that = Anonymous)",
			"date_added": 1461107082426
		},
		{
			"body": "Oh, ok",
			"date_added": 1461107175810
		},
		{
			"body": "I think they show up as their ID in antox",
			"date_added": 1461107190113
		},
		{
			"body": "The list of non-accepted requests seems to be per-client",
			"date_added": 1461107207743
		},
		{
			"body": "It's pretty decent AFAICT",
			"date_added": 1461107258206
		},
		{
			"body": "I have no idea if it works, though, since as I said you are my first successful contact.",
			"date_added": 1461107274400
		},
		{
			"body": "tox seems to be the first p2p chat system to get any traction",
			"date_added": 1461107341776
		},
		{
			"body": "I think 10 is more than I ever had in XMPP outside of google chat",
			"date_added": 1461107356437
		},
		{
			"body": "@yilmazerkan@zv: I still see no messages in my mail.zeroverse.bit inbox when logged in as redacted@zeroverse.bit.",
			"date_added": 1461107550092
		},
		{
			"body": "What ezra said. JZA?",
			"date_added": 1461107776531
		},
		{
			"body": "0net://1AZ9fPvDPmCPdcbEt37YW2bDtdNx3h5RmG/",
			"date_added": 1461107854514
		},
		{
			"body": "Shows 13 peers not",
			"date_added": 1461107864048
		},
		{
			"body": "now",
			"date_added": 1461107865182
		},
		{
			"body": "I tried that too, but that may have fallen prey to the \"publish failed\" problem",
			"date_added": 1461107923409
		},
		{
			"body": "well, I'm using tor",
			"date_added": 1461107935408
		},
		{
			"body": "@yilmazerkan@zv: 1. I do.",
			"date_added": 1461108151390
		},
		{
			"body": "@yilmazerkan@zv: ok",
			"date_added": 1461125000474
		},
		{
			"body": "@yilmazerkan@zv: no reply in either account",
			"date_added": 1461125157288
		},
		{
			"body": "@roguehat@zid: Kinda alive is only slightly dead!",
			"date_added": 1461125468351
		},
		{
			"body": "@erkan@zid: that's what I sent",
			"date_added": 1461126202640
		},
		{
			"body": "@erkan@zid: I see no response in either account though",
			"date_added": 1461126251505
		},
		{
			"body": "I need some interesting ipfs urls",
			"date_added": 1461126459773
		},
		{
			"body": "It seems a lot easier to discover stuff on freenet",
			"date_added": 1461126468255
		},
		{
			"body": "@yilmazerkan@zv: it must be how it constructs the inbox then",
			"date_added": 1461126485714
		},
		{
			"body": "I would think they would be encrypted with different keys",
			"date_added": 1461126521090
		},
		{
			"body": "I wrote a long article about how the matrix sucked and then it got deleted",
			"date_added": 1461126551260
		},
		{
			"body": "followed",
			"date_added": 1461126593729
		},
		{
			"body": "@yilmazerkan@zv: btw there is a bug in selecting your account",
			"date_added": 1461126682377
		},
		{
			"body": "if I'm logged out of a site and then try to log in and it doesn't support zeroverse.bit, my redacted@zeroverse.bit ID is grayed out. But if I'm logged in and go to change, redacted@zeroverse.bit is not grayed out",
			"date_added": 1461126720403
		},
		{
			"body": "@yilmazerkan@zv: I just got \"just username, no domain in to-field\" from you in my redacted@zeroid.bit inbox",
			"date_added": 1461126822232
		},
		{
			"body": "@roguehat@zid: I like your whisper app",
			"date_added": 1461126841099
		},
		{
			"body": "zeronet is very similar to an idea I had a while back for doing real apps in freenet",
			"date_added": 1461126860071
		},
		{
			"body": "but I did not want to write java and the python support was not so great so I gave up",
			"date_added": 1461126884812
		},
		{
			"body": "also I did not know very much about javascript security yet",
			"date_added": 1461126893809
		},
		{
			"body": "I didn't know about iframe sandbox, or maybe it wasn't widely supported yet",
			"date_added": 1461126943312
		},
		{
			"body": "stupid developers",
			"date_added": 1461127199690
		},
		{
			"body": "the \"zeronet protocol\" extension for chrome it not really a protocol, it just transparently replaces \"zero\" at the beginning of a url with \"localhost:43110\"",
			"date_added": 1461127243331
		},
		{
			"body": "and vice versa",
			"date_added": 1461127249663
		},
		{
			"body": "actually it seems to be slightly more complicated than that, but nevertheless at some point is looking for the string \"zero\"",
			"date_added": 1461127300427
		},
		{
			"body": "not zero/, not zero:, just zero",
			"date_added": 1461127307981
		},
		{
			"body": "somehow this chat ended up being just \"zeromedia.bit\" in my url bar",
			"date_added": 1461127328735
		},
		{
			"body": "giving web developers regular expressions is like giving toddlers flame throwers",
			"date_added": 1461127408810
		},
		{
			"body": "I found a way to see polls on zeropolls without actually voting",
			"date_added": 1461127606035
		},
		{
			"body": "just use the bug I mentioned earlier to \"log in\" with a zeroverse.bit iD",
			"date_added": 1461127619836
		},
		{
			"body": "then you vote and see the results, but since it doesn't allow zeroverse.bit IDs, your vote will never get published",
			"date_added": 1461127642762
		},
		{
			"body": "@yilmazerkan@zv: I just got \"test to redacted@zeroverse.bit\" to my redacted@zeroid.bit account.",
			"date_added": 1461127677764
		},
		{
			"body": "@yilmazerkan@zv: just the one from yilmazerkan@zeroverse.bit.",
			"date_added": 1461127859251
		},
		{
			"body": "Twister suddenly showed 2250 new posts and it's hanging. That seems suspicious.",
			"date_added": 1461129618380
		},
		{
			"body": "@yilmazerkan@zv: ok",
			"date_added": 1461131930092
		},
		{
			"body": "@yilmazerkan@zv: Nothing.",
			"date_added": 1461131941430
		},
		{
			"body": "@yilmazerkan@zv: I have nothing important in my data dir, so feel free to delete it.",
			"date_added": 1461131954301
		},
		{
			"body": "@yilmazerkan@zv: why shouldn't I just delete the entire site?",
			"date_added": 1461160389166
		},
		{
			"body": "@yilmazerkan@zv: Ok I've deleted the whole site and gone back there and it still shows nothing in my zv inbox. I don't want to log into the zid account since I'm assuming it will recreate the dir.",
			"date_added": 1461160876971
		},
		{
			"body": "Though maybe not if I'm blocked",
			"date_added": 1461160889220
		},
		{
			"body": "@yilmazerkan@zv: I did not get enough sleep, so my day has not been very productive so far.",
			"date_added": 1461190373706
		},
		{
			"body": "I've mostly been researching ways to make some decentralized anonymous doohickey possible to run without installing anything, like via webrtc.",
			"date_added": 1461190402969
		},
		{
			"body": "Right, I don't want to use it inside tor, I want to use it to replace tor.",
			"date_added": 1461192074377
		},
		{
			"body": "Since it doesn't reveal your IP any more than running tor does, i.e. you can tell someone is running tor but not what they're doing over it, whereas if you visit hidden sites over tor, it could use webrtc to reveal your ip",
			"date_added": 1461192159237
		},
		{
			"body": "but that's from using a \"raw\" web browser with tor",
			"date_added": 1461192178422
		},
		{
			"body": "I want to use something closer to what zeronet does, with everything being in a sandbox",
			"date_added": 1461192193302
		},
		{
			"body": "so that requires some kind of onion routing or mixnet layer on top of webrtc",
			"date_added": 1461192258886
		},
		{
			"body": "Well I'm hoping someone's already done it or at least built most of the pieces, since I don't actually have the time to do it myself.",
			"date_added": 1461193119805
		},
		{
			"body": "@yilmazerkan@zv: Nice!",
			"date_added": 1461265923473
		},
		{
			"body": "I am in the 100 club, which seems to be a very small club.",
			"date_added": 1461268326072
		},
		{
			"body": "Well that person is in a very lonely club.",
			"date_added": 1461268422501
		},
		{
			"body": "@yilmazerkan@zv: You mean besides its being ugly? I think it's a useful list.",
			"date_added": 1461277955647
		},
		{
			"body": "Might be more useful to do it as a wiki.",
			"date_added": 1461277972429
		},
		{
			"body": "The main thing that worries me about all those apps is that the app publisher is in complete control over whether your stuff actually gets encrypted. They could update the app to publish everything in the clear or add a backdoor.",
			"date_added": 1461278033644
		},
		{
			"body": "We really need client-side encryption built into ZeroNet, in the thing outside the iframe sandbox (the frame?)",
			"date_added": 1461278072969
		},
		{
			"body": "We could have special, unforgeable textboxes & upload buttons/dialogs that give the user feedback about whether what they type is actually being encrypted.",
			"date_added": 1461278136298
		},
		{
			"body": "Well for wiki you have some kind of registration process",
			"date_added": 1461278159115
		},
		{
			"body": "no",
			"date_added": 1461278192181
		},
		{
			"body": "site admins can't inject any code that's not run within the iframe sandbox, right?",
			"date_added": 1461278215368
		},
		{
			"body": "it says \"from your hard drive\" which sounds scary",
			"date_added": 1461278221834
		},
		{
			"body": "if site admins can inject python code I'm going to need to stop using 0net",
			"date_added": 1461278252377
		},
		{
			"body": "I'm guessing not, though, because that would be incredibly stupid.",
			"date_added": 1461278579235
		},
		{
			"body": "Last gasp before they go bankrupt?",
			"date_added": 1461279335336
		},
		{
			"body": "According to the Reddit link there was a bid in February, but no mention that it was accepted.",
			"date_added": 1461279537096
		},
		{
			"body": "@yilmazerkan@zv: About it being broken?",
			"date_added": 1461280190636
		},
		{
			"body": "Is there something I need to do to fix it?",
			"date_added": 1461280209532
		},
		{
			"body": "I had a syntactically invalid users/content.json, but I've since fixed it",
			"date_added": 1461280248557
		},
		{
			"body": "what is the error?",
			"date_added": 1461280256570
		},
		{
			"body": "and are you still getting it?",
			"date_added": 1461280262237
		},
		{
			"body": "what's the error?",
			"date_added": 1461280327499
		},
		{
			"body": "Oh WebSocket handleRequest error: TypeError: 'NoneType' object does not support item assignment in UiWebsocket.py line 98 > UiWebsocket.py line 178 > UiWebsocket.py line 467",
			"date_added": 1461280379797
		},
		{
			"body": "@yilmazerkan@zv: look in data/users/content.json under the site dir and see if there is a comma afterand see if there is a comma after \"bitmsg/.*@zeroid.bit\": { \"max_size\": 15000 } ? ",
			"date_added": 1461280969611
		},
		{
			"body": "weird, zeroid.bit got replaced with 0mail",
			"date_added": 1461281017668
		},
		{
			"body": "actually @zeroid.bit got replaced with //0mail",
			"date_added": 1461281041302
		},
		{
			"body": "dammit",
			"date_added": 1461281044072
		},
		{
			"body": "ATzeroid.bit gets replaced with //0mail",
			"date_added": 1461281059317
		},
		{
			"body": "me@zeroid.bit",
			"date_added": 1461281068420
		},
		{
			"body": "@yilmazerkan@zv: look in data/users/content.json under the site dir and see if there is a comma afterand see if there is a comma after \"bitmsg/.*//0mail\": { \"max_size\": 15000 } ?",
			"date_added": 1461281086820
		},
		{
			"body": "I discovered a bug in this chat",
			"date_added": 1461281096322
		},
		{
			"body": "Nothing to do with my blog",
			"date_added": 1461281107301
		},
		{
			"body": "I edited the content.json directly. Is there anything special I need to do after that?",
			"date_added": 1461281198467
		},
		{
			"body": "I just signed and published a second time.",
			"date_added": 1461281221252
		},
		{
			"body": "oh that's not good",
			"date_added": 1461281233616
		},
		{
			"body": "Ok, well, I am pretty sure that would cause None to show up on line 467 of UiWebsocket.py :)",
			"date_added": 1461281311009
		},
		{
			"body": "since the only place None can get there is in the includes processing",
			"date_added": 1461281322369
		},
		{
			"body": "@yilmazerkan@zv: I did not change it before initially publishing my blog, but I've changed it twice since, the first to a syntactically invalid form",
			"date_added": 1461281355632
		},
		{
			"body": "Ah that is probably the problem",
			"date_added": 1461281438708
		},
		{
			"body": "Of course I didn't do that. How could I possibly know to do that?",
			"date_added": 1461281447009
		},
		{
			"body": "Ok I did the thing in the UI",
			"date_added": 1461281513453
		},
		{
			"body": "See if that fixes it?",
			"date_added": 1461281520063
		},
		{
			"body": "yay",
			"date_added": 1461281562528
		},
		{
			"body": "Thanks for letting me know. Maybe now I'll get some more peers",
			"date_added": 1461281575326
		},
		{
			"body": "I saw that.",
			"date_added": 1461282024970
		},
		{
			"body": "ZeroBlog appears to have no support for 0net URLs",
			"date_added": 1461282035912
		},
		{
			"body": "Or if it does, it's using some syntax other than the regular link syntax.",
			"date_added": 1461282049401
		},
		{
			"body": "[name](0net://blahblah) doesn't work.",
			"date_added": 1461282065721
		},
		{
			"body": "foo",
			"date_added": 1461282537699
		},
		{
			"body": "We should not be assuming that everyone is going to be running their daemon at http://localhost:43110",
			"date_added": 1461282559843
		},
		{
			"body": "I guess I could do it as a relative url?",
			"date_added": 1461282608050
		},
		{
			"body": "/me tests that",
			"date_added": 1461282612338
		},
		{
			"body": "yes that works! I just leave off the http://localhost:43110 part and start with the slash",
			"date_added": 1461282660836
		},
		{
			"body": "[this blog post](/zeroblog.bit/?Post:34:you+have+to+tell+siteSign+what+to+sign,+specifically)",
			"date_added": 1461282674977
		},
		{
			"body": "Ok, gotta go. Thanks again for your help!",
			"date_added": 1461282735794
		},
		{
			"body": "What's PLAY?",
			"date_added": 1461343375009
		},
		{
			"body": "@yilmazerkan@zv: My concern about any shield law is that I don't want the government deciding who qualifies as a \"journalist\"",
			"date_added": 1461343438208
		},
		{
			"body": "IMO everyone is a jounalist.",
			"date_added": 1461343461069
		},
		{
			"body": "@yilmazerkan@zv: That nymag article is a good reason to use Markdown for everything.",
			"date_added": 1461343585567
		},
		{
			"body": "@yilmazerkan@zv: Can you (or anyone) try 'git clone http://localhost:43110/1MCfWoCtcbPXYc3rhYhKeSAWVpzAQYyWKS/git/testrepo.git' please?",
			"date_added": 1461347748057
		},
		{
			"body": "Just making sure I didn't miss anything in my instructions.",
			"date_added": 1461347776849
		},
		{
			"body": "@erkan@zid: So fetching a sub-url doesn't automatically fetch the site unless you do it in your browser?",
			"date_added": 1461353477169
		},
		{
			"body": "muja@zid: @redacted@zv: Just tried it and it works, but only AFTER I visited the site.",
			"date_added": 1461353509857
		},
		{
			"body": "This sounds like a ZeroNet bug/misfeatures",
			"date_added": 1461353574321
		},
		{
			"body": "The other possibility is it didn't work the first time because I was the only one hosting it and I'm in Tor",
			"date_added": 1461353599648
		},
		{
			"body": "but as long as there are enough peers it will work for everyone the first time",
			"date_added": 1461353615824
		},
		{
			"body": "/me wonders if 50% of the seeds deleting the site repeatedly might cause problems for someone trying to git clone :)",
			"date_added": 1461353720638
		},
		{
			"body": "what do you mean?",
			"date_added": 1461353751103
		},
		{
			"body": "oh so the site never appears",
			"date_added": 1461353759128
		},
		{
			"body": "or rather the git repo?",
			"date_added": 1461353767558
		},
		{
			"body": "but it did work when you visited via browser?",
			"date_added": 1461353782238
		},
		{
			"body": "I wonder if there's js in the index.html that causes ZN to download the rest of the site?",
			"date_added": 1461353812046
		},
		{
			"body": "Ah, trailing /. that's no problem",
			"date_added": 1461354862514
		},
		{
			"body": "I think without the trailing / is technically invalid in http anyway",
			"date_added": 1461354873171
		},
		{
			"body": "Well it's my site, so I'd prefer not to delete it.",
			"date_added": 1461355258202
		},
		{
			"body": "IPFS seems completely broken.",
			"date_added": 1461363955355
		},
		{
			"body": "Fetches just hang.",
			"date_added": 1461363964803
		},
		{
			"body": "/me waves.",
			"date_added": 1461702347081
		},
		{
			"body": "Yeah, everything's great.",
			"date_added": 1461702813700
		},
		{
			"body": "Made a bit more progress with ipfs",
			"date_added": 1461702823369
		},
		{
			"body": "Seems as if it was just slow as opposed to being completely broken.",
			"date_added": 1461702834004
		},
		{
			"body": "Too slow to really host images embedded in web pages in, as far as I can tell.",
			"date_added": 1461702885539
		},
		{
			"body": "Yeah, I can't tell if the problem is at my end or what.",
			"date_added": 1461704152999
		},
		{
			"body": "If it remains this slow for everyone I don't understand how people think it can replace the web.",
			"date_added": 1461704208229
		},
		{
			"body": "The problem could be that I'm forwarding over ssh",
			"date_added": 1461704232371
		},
		{
			"body": "Or maybe the gateway serializes requests",
			"date_added": 1461704295092
		},
		{
			"body": "I'm going to do a bit of experimenting on my own",
			"date_added": 1461705927506
		},
		{
			"body": "@iforgotmyusernam@zv: hi",
			"date_added": 1461731094380
		},
		{
			"body": "hi @yilmazerkan@zv: ",
			"date_added": 1461735960679
		},
		{
			"body": "/me waves",
			"date_added": 1461906702407
		},
		{
			"body": "/me waves",
			"date_added": 1461952734053
		},
		{
			"body": "@yilmazerkan@zv: The menu in ZeroHello always tells me ZN is up to date.",
			"date_added": 1461952797259
		},
		{
			"body": "@flyman@zid: It's not any different than the \"earth is only 6000 years old\" religion.",
			"date_added": 1461953982425
		},
		{
			"body": "If the earth was created with dinosaur fossils already existing, it's not much of a stretch to claim it was created with humanity & all existing human knowledge & artifacts & memories already existing.",
			"date_added": 1461954030928
		},
		{
			"body": "I think \"god created the universe 15 billion years ago\" also counts as creationism.",
			"date_added": 1461954075546
		},
		{
			"body": "I believe god is us, or rather, god is what all life is destined to eventually become.",
			"date_added": 1461954105481
		},
		{
			"body": "Probably not much different from the Overmind of Childhood's End, only not existing yet.",
			"date_added": 1461954138064
		},
		{
			"body": "Well the latter is the \"intelligent design\" philosophy.",
			"date_added": 1461954161496
		},
		{
			"body": "Which is really \"destroy childrens' ability to think critically.\"",
			"date_added": 1461954172877
		},
		{
			"body": "It's not a religion. Childhood's End is a book by Arthur C. Clarke",
			"date_added": 1461954206424
		},
		{
			"body": "Was recently made into a miniseries.",
			"date_added": 1461954224058
		},
		{
			"body": "The miniseries was OK. Not better than the book.",
			"date_added": 1461954657575
		},
		{
			"body": "Probably the only movie version that was better than one of Arthur C. Clarke's books is 2001.",
			"date_added": 1461954692447
		},
		{
			"body": "You don't have to remember things for them to have a long lasting impact on you.",
			"date_added": 1461964988013
		},
		{
			"body": "The effects ripple outward in your life like waves after a rock drops in the water.",
			"date_added": 1461965034208
		},
		{
			"body": "Only without there necessarily being any damping (loss of energy)",
			"date_added": 1461965060745
		},
		{
			"body": "pacman -> arch -> systemd -> yuck",
			"date_added": 1462044843362
		},
		{
			"body": "winning without fighting is exactly our strategy",
			"date_added": 1462044938514
		},
		{
			"body": "arch is a linux distribution which uses systemd",
			"date_added": 1462045015575
		},
		{
			"body": "systemd is a virus",
			"date_added": 1462045023553
		},
		{
			"body": "which is in the process of infecting the linux kernel and most distros",
			"date_added": 1462045047294
		},
		{
			"body": "hiya @yilmazerkan@zv",
			"date_added": 1462045287611
		},
		{
			"body": "pacman is the name of the PACkage MANager in Arch Linux.",
			"date_added": 1462045309680
		},
		{
			"body": "apk -> alpine, emerge -> gentoo, pkg -> freebsd (also ports), dpkg/apt -> debian/ubuntu, rpm/yum -> fedora/red hat/centos",
			"date_added": 1462045424919
		},
		{
			"body": "I'm sure I'm missing some",
			"date_added": 1462045436492
		},
		{
			"body": "butch -> sabotage, sorcery -> source mage",
			"date_added": 1462045515204
		},
		{
			"body": "yaourt is arch",
			"date_added": 1462045541481
		},
		{
			"body": "I forget what suse's thing is called.",
			"date_added": 1462045565629
		},
		{
			"body": "nix -> nixos",
			"date_added": 1462045682205
		},
		{
			"body": "ah yast",
			"date_added": 1462045756362
		},
		{
			"body": "been a while since I've used suse, and never opensuse",
			"date_added": 1462045767435
		},
		{
			"body": "I think last time I used it was before it was bought by novell",
			"date_added": 1462045781090
		},
		{
			"body": "If IPFS worked it would be cool to have an OS whose applications all lived in IPFS",
			"date_added": 1462045842654
		},
		{
			"body": "and were cached locally",
			"date_added": 1462045848858
		},
		{
			"body": "0install, like Rox's thingy",
			"date_added": 1462045855338
		},
		{
			"body": "what's it doing? What do you mean?",
			"date_added": 1462046032509
		},
		{
			"body": "Oh, no. I found a couple candidate javascript libraries, but there's no frontend",
			"date_added": 1462046112057
		},
		{
			"body": "Frontend coding isn't really my thing",
			"date_added": 1462046120005
		},
		{
			"body": "I think part of why there are no javascript-based gitlab/github things is that they would have to either have git repositories on the same server or the git server would have to support CORS",
			"date_added": 1462046203109
		},
		{
			"body": "so far github has refused to support CORS. Not sure about gitlab",
			"date_added": 1462046218984
		},
		{
			"body": "How does ZN prevent cross-site requests? Or does it?",
			"date_added": 1462046273632
		},
		{
			"body": "I guess if there's no \"allow-same-origin\" in the sandbox XHR is impossible anyway",
			"date_added": 1462046300140
		},
		{
			"body": "we need a decentralized bountysource-like thing",
			"date_added": 1462046382732
		},
		{
			"body": "haha you overestimate my free time",
			"date_added": 1462046494710
		},
		{
			"body": "I can make minor incremental improvements on things, but a new app is beyond my present time availability",
			"date_added": 1462046513270
		},
		{
			"body": "I'm hoping to inspire/enable others",
			"date_added": 1462046541853
		},
		{
			"body": "bbl",
			"date_added": 1462046544654
		},
		{
			"body": "@yilmazerkan@zv: that is true but I'm too much of a perfectionist",
			"date_added": 1462048993210
		},
		{
			"body": "This looks like crap in chrome on Android but it's unusably slow in Firefox on android",
			"date_added": 1462049028975
		},
		{
			"body": "I get caught up in allnalysis paralysis",
			"date_added": 1462049107335
		},
		{
			"body": "ZN is not decentralized enough for me yet",
			"date_added": 1462049134856
		},
		{
			"body": "Gnunet is better but has no users",
			"date_added": 1462049153356
		},
		{
			"body": "The problem is that gnunet is just a platform, similar to freenet but with no web frontend",
			"date_added": 1462049341666
		},
		{
			"body": "Freenet is successful because of the web front-end, just like zeronet",
			"date_added": 1462049372582
		},
		{
			"body": "Zeronet is more successful because it's simpler tonset up and more interavtive",
			"date_added": 1462049428573
		},
		{
			"body": "Interactive",
			"date_added": 1462049453349
		},
		{
			"body": "And no need for plugins",
			"date_added": 1462049467668
		},
		{
			"body": "Yeah",
			"date_added": 1462049482612
		},
		{
			"body": "It would be fine if anyone built apps on it but there is a chicken and egg problem",
			"date_added": 1462049502801
		},
		{
			"body": "Using gnunet just makes it that much harder for your users",
			"date_added": 1462049526889
		},
		{
			"body": "Tor is much simpler.",
			"date_added": 1462049566805
		},
		{
			"body": "But it provides less",
			"date_added": 1462049574378
		},
		{
			"body": "You still have to build your own DHT and/or blockchain on top of it.",
			"date_added": 1462049598492
		},
		{
			"body": "Maybe ethereum will give us an easy to use blockchain",
			"date_added": 1462049723942
		},
		{
			"body": "Then we just need a dht",
			"date_added": 1462049739283
		},
		{
			"body": "Maybe Twister's modifications to libbittorrent will be sufficient",
			"date_added": 1462049797645
		},
		{
			"body": "Or libtorrebt I guess it's called",
			"date_added": 1462049810419
		},
		{
			"body": "Libtorrent",
			"date_added": 1462049820143
		},
		{
			"body": "@teszt@zid: You mean something like http://<sitename>.bit/<path> ?",
			"date_added": 1462055319783
		},
		{
			"body": "That could be done with a proxy pretty easily",
			"date_added": 1462055344488
		},
		{
			"body": "though you'd probably want the proxy to also resolve other .bit addresses too, and you'd probably want the user to be able to distinguish, so maybe use a fake TLD for ZN .bit addresses",
			"date_added": 1462055462696
		},
		{
			"body": "of course if you're using a proxy it could just be <site addr>.0net or whatever",
			"date_added": 1462055485290
		},
		{
			"body": "so doesn't need to have a .bit registered, same as .onion",
			"date_added": 1462055498065
		},
		{
			"body": "you could do that with an off-the-shelf proxy in fact",
			"date_added": 1462055577194
		},
		{
			"body": "there's some crazy russian proxy that can do all kinds of address routing iirc",
			"date_added": 1462055589153
		},
		{
			"body": "https://3proxy.ru/",
			"date_added": 1462055743382
		},
		{
			"body": "@yilmazerkan@zv: Ethereum is released",
			"date_added": 1462055872628
		},
		{
			"body": "Blockchain-savvy people I trust think ethereum is the future",
			"date_added": 1462055897004
		},
		{
			"body": "Everyone is asleep I guess",
			"date_added": 1462061132793
		},
		{
			"body": "Still asleep.",
			"date_added": 1462070866225
		},
		{
			"body": "@yilmazerkan@zv: So you end up with the central bank owning most of the nation's companies. Which means Japan is becoming China or the USSR.",
			"date_added": 1462129554414
		},
		{
			"body": "Because the central bank is no more accountable to the people than the Communist Party is.",
			"date_added": 1462129574407
		},
		{
			"body": "@yilmazerkan@zv: That DARPA one sounds like a repeat of the old Clipper proposal in the US in the 1990s, which got shot down",
			"date_added": 1462129621238
		},
		{
			"body": "The proposal was to make everyone use a specific crypto chip whose keys were escrowed by the government",
			"date_added": 1462129646392
		},
		{
			"body": "DARPA probably wants to make their own Bitcoin/Ethereum so they can force everyone to use it and outlaw any competitors",
			"date_added": 1462129667201
		},
		{
			"body": "I'm guessing it will be about as successful as Clipper was.",
			"date_added": 1462129681963
		},
		{
			"body": "@yilmazerkan@zv: ZN should not have a built-in marketplace, it should just add components to make it usable for such a thing",
			"date_added": 1462129763662
		},
		{
			"body": "/me is reading the scrollback backwards",
			"date_added": 1462129825308
		},
		{
			"body": "Hi @erkan@zid",
			"date_added": 1462131312803
		},
		{
			"body": "I don't think 2x2 = 5 or 11 in any base",
			"date_added": 1462131341708
		},
		{
			"body": "I guess it's 11 in base 3",
			"date_added": 1462131357277
		},
		{
			"body": "/me is making a new dockerfile for zeronet using alpine & talking to tor in another container",
			"date_added": 1462131394605
		},
		{
			"body": "which means I'll have to publish my tor dockerfile too",
			"date_added": 1462131421442
		},
		{
			"body": "since you need /var/run/tor as a volume",
			"date_added": 1462131427831
		},
		{
			"body": "hi @muja@zid",
			"date_added": 1462146615747
		},
		{
			"body": "@muja@zid: Because it's hard to do lots of things well",
			"date_added": 1462149193791
		},
		{
			"body": "Better to do one thing well, and in ZN's case that is being an alternative to \"the web\"",
			"date_added": 1462149227772
		},
		{
			"body": "Ah so it was Craig after all",
			"date_added": 1462207956692
		},
		{
			"body": "Now he can get coopted by DARPA to build their one-blockchain-to-(literally)-rule-them-all",
			"date_added": 1462207986208
		},
		{
			"body": "@erkan@zid: We need a way to delegate authorization for posting things like comments to another site",
			"date_added": 1462208034316
		},
		{
			"body": "so that everyone doesn't have to manually add other root signers",
			"date_added": 1462208048797
		},
		{
			"body": "or whatever we call second degree signers",
			"date_added": 1462208056093
		},
		{
			"body": "@erkan@zid: I found at least one post claiming that the signature Wright has offered as evidence he's Satoshi does not actually validate, and further that it's a bag of bytes that exists in the blockchain already. https://github.com/patio11/wrightverification",
			"date_added": 1462208308859
		},
		{
			"body": "My own opinion is that Wright is a con artist looking for attention.",
			"date_added": 1462208332460
		},
		{
			"body": "@erkan@zid: As far as I know, Wright has yet to produce a valid signature, which would mean stealing a private key would be unnecessary.",
			"date_added": 1462210031830
		},
		{
			"body": "@erkan@zid: Also, you are assuming he is rational. It's possible he has borderline personality disorder. Or schizophrenia, which tends to develop in one's 20s but can develop later or slowly.",
			"date_added": 1462210128617
		},
		{
			"body": "Or he picked up a methamphetamine or other habit. Meth can produce schizophenia-like symptoms.",
			"date_added": 1462210162301
		},
		{
			"body": "Anyway if he produces a valid signature and nobody else comes forward, I'd be convinced.",
			"date_added": 1462210210788
		},
		{
			"body": "Mass surveillance is why I'm here. I'm avoiding the self-censorship.",
			"date_added": 1462212957199
		},
		{
			"body": "But the problem is much worse than mass surveillance. A lot of people are really bought in to the status quo.",
			"date_added": 1462213029806
		},
		{
			"body": "Americans cannot speak out against the police without fear of reprisals from their own (white) communities.",
			"date_added": 1462213051966
		},
		{
			"body": "According to most white Americans the police can do no wrong.",
			"date_added": 1462213067509
		},
		{
			"body": "This has always been a problem in small towns, for example.",
			"date_added": 1462213104312
		},
		{
			"body": "It's not necessarily a bad thing - the main point of society is to marginalize deviant behavior",
			"date_added": 1462213138132
		},
		{
			"body": "And society actually tolerates a much more diverse array of viewpoints now than it did in the past",
			"date_added": 1462213169681
		},
		{
			"body": "viewpoints and behaviors",
			"date_added": 1462213181742
		},
		{
			"body": "we just need to make it easy to \"opt out\" of observation when one wishes",
			"date_added": 1462213224701
		},
		{
			"body": "while also making it easier to protect oneself from harm",
			"date_added": 1462213255090
		},
		{
			"body": "including the harm we could be enabling by allowing people to opt out of observation",
			"date_added": 1462213270512
		},
		{
			"body": "but also the harm that's enabled by giving one group a monopoly on violence",
			"date_added": 1462213286009
		},
		{
			"body": "@erkan@zid: Not at all. The NSA are one of the producers of harm that I want to enable people to protect themselves from",
			"date_added": 1462216327413
		},
		{
			"body": "You cannot protect people from harm by giving other people power over them and then trusting those people to do the right thing with that power.",
			"date_added": 1462216406449
		},
		{
			"body": "You protect people by giving them the power to protect themselves.",
			"date_added": 1462216425494
		},
		{
			"body": "I wonder if Craig Wright is trying to get the real Satoshi Nakamoto to come out",
			"date_added": 1462216664722
		},
		{
			"body": "Ah, yes, the signature DOES validate, but it's pulled off the block chain, so Wright did not produce it. https://dankaminsky.com/2016/05/02/validating-satoshi-or-not/",
			"date_added": 1462216771775
		},
		{
			"body": "Everyone knew that before. Now they know it doubly so.",
			"date_added": 1462218460709
		},
		{
			"body": "I'm starting to wonder if Craig might be working for someone who wants to find the real Satoshi",
			"date_added": 1462218505296
		},
		{
			"body": "Along with Gavin",
			"date_added": 1462218509312
		},
		{
			"body": "Which would explain why he seems to have fooled Gavin",
			"date_added": 1462218522990
		},
		{
			"body": "No, I think he's trying to get the real Satoshi to come forward to protect people from getting scammed.",
			"date_added": 1462218916347
		},
		{
			"body": "@erkan@zid: thanks for the link :)",
			"date_added": 1462221618974
		},
		{
			"body": "@muja@zid: That tweet looks like a joke to me. The reddit article he links to mentions nothing about Andresen's commit access being removed.",
			"date_added": 1462221681913
		},
		{
			"body": "The most likely explanation is that Andresen just fell for it himself, and he may have gone a little overboard in his endorsement as a response to the initial skepticism.",
			"date_added": 1462221745206
		},
		{
			"body": "And as a result he's going to end up with his own credibility dragged down in the wake of this.",
			"date_added": 1462221777096
		},
		{
			"body": "Wow, Andresen's comment is very weaselly. It makes me not want to trust him ever again.",
			"date_added": 1462222437284
		},
		{
			"body": "Oh, hey, that leads to another possible motive for this scam: destroy Gavin Andresen's credibility.",
			"date_added": 1462222702862
		},
		{
			"body": "@muja@zid: Not sure. But the two most plausible reasons for Wright's having scammed Gavin directly are that he either wanted to use Gavin's credibility to scam the public, or he wanted to harm Gavin's credibility.",
			"date_added": 1462255703268
		},
		{
			"body": "It's possible he knew he couldn't scam everyone but hoped to scam enough people to make some money. Or he's delusional and thought he could scam everyone. Or he's working for someone with their own motives.",
			"date_added": 1462255743423
		},
		{
			"body": "@erkan@zid: I'm having trouble publishing a new version of my git repo zite",
			"date_added": 1462255760636
		},
		{
			"body": "The spinner just hangs there",
			"date_added": 1462255772863
		},
		{
			"body": "and if I close the side menu and reopen it it's black",
			"date_added": 1462255782305
		},
		{
			"body": "\"Delete\" is also hanging on another zite",
			"date_added": 1462255925415
		},
		{
			"body": "Restarting and/or updating fixed the problem with publishing the git zite.",
			"date_added": 1462256854841
		},
		{
			"body": "And now I have an actual useful repo there! http://localhost:43110/1AZ9fPvDPmCPdcbEt37YW2bDtdNx3h5RmG/?Post:15:New+blog+post",
			"date_added": 1462256888057
		},
		{
			"body": "Ok, gotta go. TTFN",
			"date_added": 1462256952656
		},
		{
			"body": "@musickiller@zid: Not for cookies specifically, no. NoScript and uMatrix or RequestPolicy",
			"date_added": 1462295455248
		},
		{
			"body": "Looks like my dockerfiles are popular already :)",
			"date_added": 1462295480944
		},
		{
			"body": "I'm already starting to think beyond Docker, though, since Docker feels very much like a hack to me.",
			"date_added": 1462295501944
		},
		{
			"body": "ZFS snapshots seem like a much better solution to the problem than overlay filesystems",
			"date_added": 1462295532424
		},
		{
			"body": "And running a privileged daemon makes me very uncomfortable.",
			"date_added": 1462295558767
		},
		{
			"body": "\"Good job protecting your system from your applications with containers there, but we just went ahead and hacked in through Docker itself.\"",
			"date_added": 1462295589517
		},
		{
			"body": "The userns support in Docker seems like something of an afterthought, but once you have userns support you don't actually need a privileged daemon anymore.",
			"date_added": 1462295640683
		},
		{
			"body": "Mounts still require something",
			"date_added": 1462295668481
		},
		{
			"body": "Go to sleep earlier :)",
			"date_added": 1462299870402
		},
		{
			"body": "If you are a slow caffeine metabolizer, you might want to consider weaning yourself off it",
			"date_added": 1462299893670
		},
		{
			"body": "(caffeine, not sleep)",
			"date_added": 1462299898900
		},
		{
			"body": "or switch to something stronger like modafinil :)",
			"date_added": 1462299913147
		},
		{
			"body": "just don't abuse it to stay awake for more than 3 days straight or you might die",
			"date_added": 1462299925291
		},
		{
			"body": "I posted about my docker thoughts: 0net://1AZ9fPvDPmCPdcbEt37YW2bDtdNx3h5RmG/?Post:16:Beyond+Docker",
			"date_added": 1462299997100
		},
		{
			"body": "I'm probably going to end up making my own linux distro, but no matter because it will be super simple",
			"date_added": 1462300043275
		},
		{
			"body": "simple in terms of not having any features, not simple as in easy to do",
			"date_added": 1462300053102
		},
		{
			"body": "@erkan@zid: VM? Just containers.",
			"date_added": 1462300268957
		},
		{
			"body": "May only support running under VMs initially, though, to avoid having to include lots of drivers.",
			"date_added": 1462300334135
		},
		{
			"body": "in the default kernel anyway. People can always build their own kernel.",
			"date_added": 1462300350547
		},
		{
			"body": "The short answer is \"because E=mc^2\"",
			"date_added": 1462302944347
		},
		{
			"body": "If the mass were greater than or equal to the sum of its parts, it would not stay together at all.",
			"date_added": 1462302982678
		},
		{
			"body": "There has to be some kind of energy \"well\" holding it together, that it has to climb out of in order to separate",
			"date_added": 1462303008923
		},
		{
			"body": "Another way of looking at it is \"rest mass is not a conserved quantity\"",
			"date_added": 1462303070116
		},
		{
			"body": "total energy is conserved, and momentum is conserved, and charge is conserved, and spin is conserved",
			"date_added": 1462303098169
		},
		{
			"body": "You can't separate a hydrogen atom into its component parts without putting energy (and thus mass, because E=mc^2) back in.",
			"date_added": 1462303397536
		},
		{
			"body": "It's common practice for people who deal with relativity on a regular basis to just say c=1 and use the same units to measure time and distance, so the equation simplifies to E=m",
			"date_added": 1462303458807
		},
		{
			"body": "You can go a step further and set the reduced planck constant to 1 as well, at which point energy and momentum can both be measured in radians per second",
			"date_added": 1462303521743
		},
		{
			"body": "if you keep going with that approach all your units disappear and you get \"planck units\"",
			"date_added": 1462303572012
		},
		{
			"body": "planck length, planck time, planck temperature, planck energy, planck mass, etc",
			"date_added": 1462303606684
		},
		{
			"body": "planck energy and planck mass being the only ones in the general range of being useful for anything, though they're still inconveniently small for macroscopic stuff and inconveniently large for atomic scale stuff",
			"date_added": 1462303647964
		},
		{
			"body": "and besides we don't know them precisely enough for them to be practical as units for \"real\" work",
			"date_added": 1462303673847
		},
		{
			"body": "because we don't know the gravitational constant precisely enough",
			"date_added": 1462303724593
		},
		{
			"body": "We know the speed of light exactly because a meter is defined as the distance light travels in a vacuum in 1/299792458 sec",
			"date_added": 1462303814108
		},
		{
			"body": "I should say we know it exactly in m/s or any velocity unit exactly defined in SI",
			"date_added": 1462303849407
		},
		{
			"body": "the kilogram is still defined based on an actual prototype but not for long probably",
			"date_added": 1462303899436
		},
		{
			"body": "Nothing I stated was opinion, so there's nothing to disagree about.",
			"date_added": 1462304788989
		},
		{
			"body": "I could qualify with \"according to relativity\" for some of it, at which point even less to disagree with.",
			"date_added": 1462304812208
		},
		{
			"body": "The fact that mass is not conserved has been proven beyond any possible doubt.",
			"date_added": 1462304881903
		},
		{
			"body": "They built the atomic bomb based on that principle, so it also has practical applications.",
			"date_added": 1462304949935
		},
		{
			"body": "What we don't know is where the rest mass of fundamental particles comes from.",
			"date_added": 1462305053713
		},
		{
			"body": "Or inertia, for that matter.",
			"date_added": 1462305091475
		},
		{
			"body": "@reffter@zv: that would require leaving zeronet",
			"date_added": 1462306049505
		},
		{
			"body": "@erkan@zid: Remember that git thing I was working on?",
			"date_added": 1462309398799
		},
		{
			"body": "http://localhost:43110/1MCfWoCtcbPXYc3rhYhKeSAWVpzAQYyWKS/",
			"date_added": 1462309424204
		},
		{
			"body": "Success!",
			"date_added": 1462309432944
		},
		{
			"body": "I was browsing around through suckless's git repos and realized they were using static html generation, so I found the tool they use and used that.",
			"date_added": 1462309474914
		},
		{
			"body": "It doesn't support README.md, so I'll just write plain text READMEs. Not a big deal.",
			"date_added": 1462309619189
		},
		{
			"body": "Next step is to write some CSS and a commit hook.",
			"date_added": 1462309652540
		},
		{
			"body": "It's still not possible to give others commit access, though.",
			"date_added": 1462309666743
		},
		{
			"body": "I'm not sure what to do about that. It seems like a design more like IPFS is more appropriate. Or maybe people can just \"fork\" and send pull requests, with just one actual maintainer per repo.",
			"date_added": 1462310197903
		},
		{
			"body": "I wrote a blog post about it: http://localhost:43110/1AZ9fPvDPmCPdcbEt37YW2bDtdNx3h5RmG/?Post:17:Browsable+Git+Repositories+in+ZeroNet",
			"date_added": 1462310316465
		},
		{
			"body": "Maybe one could write a git plugin that would work with the ZeroNet API and handle only being able to write in a user-specific directory",
			"date_added": 1462310745008
		},
		{
			"body": "A plugin for git, not zeronet, though I should also look into the ZeroNet plugin API.",
			"date_added": 1462310762548
		},
		{
			"body": "Speaking of API, of course it should be possible to publish from the CLI without shutting down the server, since it can be done through the web interface. Is there a CLI that talks to the web interface?",
			"date_added": 1462310804469
		},
		{
			"body": "Ah, good to know",
			"date_added": 1462315178637
		},
		{
			"body": "Still, I would feel more comfortable talking to the server rather than mucking with files behind its back",
			"date_added": 1462315199477
		},
		{
			"body": "Gavin Andresen is a fucking idiot. https://dankaminsky.com/2016/05/03/the-cryptographically-provable-con-man/",
			"date_added": 1462339114427
		},
		{
			"body": "I don't know what \"personal\" stuff Wright told him that convinced him to back him as Satoshi, but at this point, he needs to just accept that he's been conned and come clean with everything.",
			"date_added": 1462339202476
		},
		{
			"body": "Of course, the media are just as bad",
			"date_added": 1462340378508
		},
		{
			"body": "No matter how many times they are wrong, they don't change their behavior even slightly.",
			"date_added": 1462340395564
		},
		{
			"body": "We just need to put them out of business with crowdsourced journalism.",
			"date_added": 1462340699843
		},
		{
			"body": "@erkan@zid: Do my git html indexes work for you?",
			"date_added": 1462344151650
		},
		{
			"body": "@",
			"date_added": 1462344189216
		},
		{
			"body": "@ancap says they're getting \"not found\"",
			"date_added": 1462344196871
		},
		{
			"body": "I'm guessing it's ransomware.",
			"date_added": 1462373751675
		},
		{
			"body": "Oh, no, it's worse. It's enterprize PC management software.",
			"date_added": 1462373783853
		},
		{
			"body": "Sounds like either @akkuvijay@zid is trying to violate the policy of the company that owns their computer or has a stolen computer and doesn't have a copy of Windows to reinstall.",
			"date_added": 1462373815084
		},
		{
			"body": "@erkan@zid: From reading that and the page it links to, \"extended evolutionary synthesis\" is a relatively minor shift in thinking that the media has blown way out of proportion because the creationists will seize any opportunity to declare Darwin wrong.",
			"date_added": 1462373995300
		},
		{
			"body": "@redacted@zv: By \"that directory\" do you mean the index.html?",
			"date_added": 1462374049952
		},
		{
			"body": "The length of time it takes to build twister kind of scares me",
			"date_added": 1462374123079
		},
		{
			"body": "given how much less functionality it has than zeronet",
			"date_added": 1462374137597
		},
		{
			"body": "even building the docker container for zeronet, which involves installing all the dependencies over the net and compiling some python extension modules, takes about 1/10 the time",
			"date_added": 1462374197099
		},
		{
			"body": "@erkan@zid: Ok, that's what you should see.",
			"date_added": 1462389923655
		},
		{
			"body": "Seems like it may take a while for my updates to propagate, possibly since I'm on Tor.",
			"date_added": 1462389943071
		},
		{
			"body": "Hmmm. Unfortunately, sabotage's package manager butch doesn't seem to support git, but there don't appear to be actual releases for the suckless base utilities (sbase ubase hbase)",
			"date_added": 1462390173212
		},
		{
			"body": "That sounds like a strange view of time",
			"date_added": 1462392228154
		},
		{
			"body": "Anyone on Tox?",
			"date_added": 1462394439228
		},
		{
			"body": "TC @flyman@zid",
			"date_added": 1462394879018
		},
		{
			"body": "tox is p2p and also works over tor",
			"date_added": 1462394904233
		},
		{
			"body": "@yilmazerkan@zv: I have no idea. It's not like what I did was hard.",
			"date_added": 1462463708910
		},
		{
			"body": "Whether I inspired them or they're following my instructions or they coincidentally came up with the same idea at the same time, I'm glad more people are doing git in zeronet",
			"date_added": 1462463754191
		},
		{
			"body": "I only see posts from petercxy",
			"date_added": 1462464287660
		},
		{
			"body": "But I'm only looking at ZeroTalk",
			"date_added": 1462464297271
		},
		{
			"body": "@yilmazerkan@zv: Exactly what I would have expected the lying sack of shit to say.",
			"date_added": 1462476548578
		},
		{
			"body": "@flyman@zid: lol",
			"date_added": 1462477410051
		},
		{
			"body": "Apparently Jon Matonis has backed down even less from his original claims than Andresen did",
			"date_added": 1462477437973
		},
		{
			"body": "So either they know stuff I don't, or they are failing to accept they are wrong because of the cost to their reputation they will need to accept",
			"date_added": 1462477501504
		},
		{
			"body": "This sound more like psychology than systems theory.",
			"date_added": 1462479118039
		},
		{
			"body": "Well, with some paranormal bs thrown in :)",
			"date_added": 1462479135739
		},
		{
			"body": "Thoughts to not bring about reality except through physical actuators like our muscles",
			"date_added": 1462479156800
		},
		{
			"body": "do not",
			"date_added": 1462479167689
		},
		{
			"body": "Though I believe it is a side effect of our development of language that we believe otherwise",
			"date_added": 1462479188457
		},
		{
			"body": "We ascribe magical power to words",
			"date_added": 1462479232623
		},
		{
			"body": "Also, precisely the same neurons fire when we remember something or think about doing something as fire when we perceive it or act",
			"date_added": 1462479284508
		},
		{
			"body": "In fact, I believe that a large part of why we can actually think as much as we do without immediately acting it out is that we have very developed inhibitory systems",
			"date_added": 1462479322342
		},
		{
			"body": "yes children clearly think that words have the power to affect their environment",
			"date_added": 1462479342380
		},
		{
			"body": "I recall one child who used to think saying goodbye caused people to leave",
			"date_added": 1462479354122
		},
		{
			"body": "and that if you did not say goodbye they could not leave",
			"date_added": 1462479371623
		},
		{
			"body": "have you heard of aphantasia?",
			"date_added": 1462479395191
		},
		{
			"body": "apparently an appreciable fraction of the population do not form pictures in their head",
			"date_added": 1462479411113
		},
		{
			"body": "their visual centers do not fire when they remember things, even faces",
			"date_added": 1462479426068
		},
		{
			"body": "yes children are not very good at telling the difference between memory, dreams, and stories they heard",
			"date_added": 1462479458035
		},
		{
			"body": "because it's all the same set of neurons",
			"date_added": 1462479470452
		},
		{
			"body": "I actually have plenty of \"memories\" where I don't knwo if they actually happened to me or if they were dreams or storeis",
			"date_added": 1462479537364
		},
		{
			"body": "@yilmazerkan@zv: could be! can you \"picture something in your head\"?",
			"date_added": 1462479560868
		},
		{
			"body": "usually people with aphantasia think \"picture it in your head\" is just a figure of speech and not literal",
			"date_added": 1462479578245
		},
		{
			"body": "@yilmazerkan@zv: I have taken very few drugs",
			"date_added": 1462479594467
		},
		{
			"body": "it's just how memory works, also I have a very vivid imagination",
			"date_added": 1462479610448
		},
		{
			"body": "when you say \"drawing it\" are you imagining drawing it with your hand, or are you imagining it appearing as if someone else were drawing it?",
			"date_added": 1462479685266
		},
		{
			"body": "then you are imagining yourself watching it being drawn, which I doubt one would do if they had aphantasia",
			"date_added": 1462479729091
		},
		{
			"body": "ah",
			"date_added": 1462479759512
		},
		{
			"body": "@flyman@zid: That's interesting. That sounds like the top of the visual hierarchy is being activated but not much below it, so you don't have the rest of the experience of \"seeing\"",
			"date_added": 1462481482584
		},
		{
			"body": "I sometimes have dreams like that, too, in fact I have no idea if much below the top of my visual hierarchy gets activated, but a lot of associations certainly do, far more than when I'm awake",
			"date_added": 1462481514398
		},
		{
			"body": "But I don't know, a lot of my dreams are very visual. I have some pretty strong visual memories from some of them",
			"date_added": 1462481543606
		},
		{
			"body": "Is it bad that I'm fascinated by malware platforms?",
			"date_added": 1462481607934
		},
		{
			"body": "I'd find this recent Python one more interesting if it were ACTUALLY crossplatform instead of just being hyped up as crossplatform just because it uses Python",
			"date_added": 1462481642331
		},
		{
			"body": "what I'm not sure of is if it was using python source or bytecode",
			"date_added": 1462481736004
		},
		{
			"body": "python is huge either way, and the whole point of using a vm used to be that it made your overall code size smaller",
			"date_added": 1462481832456
		},
		{
			"body": "not that most vms these days have anything to do with reducing resource consumption",
			"date_added": 1462481846670
		},
		{
			"body": "/me is also alive.",
			"date_added": 1462557869933
		},
		{
			"body": "@erkan@zid: Apple knows better than their users what their users want. The user obviously wanted those files deleted and just doesn't realize it.",
			"date_added": 1462557925453
		},
		{
			"body": "That sounds like a trick question.",
			"date_added": 1462565268690
		},
		{
			"body": "Puns are literally lost in translation.",
			"date_added": 1462566879383
		},
		{
			"body": "I had some pretty strange dreams last night",
			"date_added": 1462567715943
		},
		{
			"body": "In one I was either checking into or trying to retrieve something from a hotel that was being inundated on the upper floors by very thick lava",
			"date_added": 1462567739498
		},
		{
			"body": "but the lava was also evil",
			"date_added": 1462567750505
		},
		{
			"body": "Were the 4 balls each half the size of his 2 balls?",
			"date_added": 1462569837813
		},
		{
			"body": "And did he have twice as much testosterone?",
			"date_added": 1462569845324
		},
		{
			"body": "It would be harder to ride a bike I suppose",
			"date_added": 1462569857669
		},
		{
			"body": "@teszt@zid: Tails supports saving to an external read/write device/partition",
			"date_added": 1462569913408
		},
		{
			"body": "though it might be better to have a way to generate keys from passphrases, which is pretty easy for elliptic curves since practically any random sequence of bytes is a valid private key.",
			"date_added": 1462569962396
		},
		{
			"body": "@flyman@zid: don't know about expectations and dreams. They do seem to relate to what I'm thinking about, often delayed by several days",
			"date_added": 1462570020557
		},
		{
			"body": "even weeks",
			"date_added": 1462570025658
		},
		{
			"body": "I'm more likely to dream about stuff that happened years before than about stuff that's going on right now",
			"date_added": 1462570049004
		},
		{
			"body": "\"Sussman said that in the 80s and 90s, engineers built complex systems by combining simple and well-understood parts. The goal of SICP was to provide the abstraction language for reasoning about such systems.  Today, this is no longer the case. Sussman pointed out that engineers now routinely write code for complicated hardware that they dont fully understand (and often cant understand because of trade secrecy.) The same is true at the software level, since programming environments consist of gigantic libraries with enormous functionality.\"",
			"date_added": 1462570143172
		},
		{
			"body": "http://www.posteriorscience.net/?p=206 This depresses me and I'm not sure if it should.",
			"date_added": 1462570165556
		},
		{
			"body": "I've always \"programmed by poking\" but at the same time I really like the idea of software being able to fit into your head",
			"date_added": 1462570212161
		},
		{
			"body": "I think that once more than one person is working on a piece of software it becomes way more complex than it needs to be",
			"date_added": 1462570241710
		},
		{
			"body": "Even supposed \"RISC\" processors have way more instructions than one can remember these days",
			"date_added": 1462570349691
		},
		{
			"body": "@teszt@zid: right, so generating keys from passphrases & salt may be a better approach",
			"date_added": 1462570406842
		},
		{
			"body": "Though if you have a large number of users running such a system, sites will probably end up disappearing a lot",
			"date_added": 1462570454278
		},
		{
			"body": "unless you have generous users with persistent operating systems seeding every site",
			"date_added": 1462570481487
		},
		{
			"body": "@teszt@zid: that would be nice, would also eliminate the copy & paste",
			"date_added": 1462570504300
		},
		{
			"body": "assuming people use memorable (but secure) passphrases like diceware or something",
			"date_added": 1462570525686
		},
		{
			"body": "any practical passphrase will have way less than 256 bits of entropy but I am not sure that matters since it'd still be too hard to brute force",
			"date_added": 1462570616106
		},
		{
			"body": "private salt would certainly help, though I would not use email address because that could be used to provide evidence that someone owns a site",
			"date_added": 1462570810131
		},
		{
			"body": "but you could have a private less secret part, private more secret part, and salt",
			"date_added": 1462570824837
		},
		{
			"body": "still, it's a lot for a person to type in if you want a lot of entropy. 128 bits or less is practical",
			"date_added": 1462570948263
		},
		{
			"body": "8 words from xkcdpasss + 2 digits",
			"date_added": 1462571002548
		},
		{
			"body": "ah true",
			"date_added": 1462571010149
		},
		{
			"body": "could probably do it with 6 xkcdpass words plus public salt and keystretching",
			"date_added": 1462571073355
		},
		{
			"body": "@teszt@zid: well you should use argon2 anyway",
			"date_added": 1462571348561
		},
		{
			"body": "bcrypt is vulnerable to parallelization (as are the others)",
			"date_added": 1462571376095
		},
		{
			"body": "so can bcrypt",
			"date_added": 1462571384724
		},
		{
			"body": "you may be thinking scrypt",
			"date_added": 1462571399193
		},
		{
			"body": "but argon2 is the state of the art in memory-hard functions",
			"date_added": 1462571407628
		},
		{
			"body": "https://github.com/P-H-C/phc-winner-argon2",
			"date_added": 1462571425915
		},
		{
			"body": "I think people shy away from memory-hard functions because they want to run them in browsers and mobile phones and don't necessarily know how much memory they can safely use",
			"date_added": 1462571478144
		},
		{
			"body": "you can't just shove everything out of memory in order to hash a passphrase but you can monopolize some cores for a short time",
			"date_added": 1462571525628
		},
		{
			"body": "I think people have successfully run ZN on android",
			"date_added": 1462572811570
		},
		{
			"body": "Python isn't hard to get working on Android",
			"date_added": 1462572818532
		},
		{
			"body": "though it takes up a lot of resources",
			"date_added": 1462572829551
		},
		{
			"body": "This emerging world of user-device-as-cache is missing an easy-user-operated-persistent-server option",
			"date_added": 1462572983762
		},
		{
			"body": "seems like docker is becoming the standard container management system, but there is no standard way to deploy to commodity cloud services yet",
			"date_added": 1462573043630
		},
		{
			"body": "and data management is still a problem",
			"date_added": 1462573062814
		},
		{
			"body": "it's fine if you have no state, but that leaves you with pretty trivial applications",
			"date_added": 1462573077116
		},
		{
			"body": "maybe managed mysql, at least for non-sharded apps, or maybe just virtualized filesystems using your own mysql container if you need a database, or... what, tahoe LAFS for clustered storage?",
			"date_added": 1462573186687
		},
		{
			"body": "and of course docker containers tend to get built on random bases",
			"date_added": 1462573219052
		},
		{
			"body": "and the bases are not necessarily updated on any reasonable schedule",
			"date_added": 1462573239867
		},
		{
			"body": "it's always sad when I come back hours later and I'm still the last person who talked",
			"date_added": 1462593499322
		},
		{
			"body": "but I guess I shouldn't expect people to be on super early in the morning in Europe or in the late evening in the US",
			"date_added": 1462593566490
		},
		{
			"body": "maybe Chinese and Australians",
			"date_added": 1462593580334
		},
		{
			"body": "@erkan@zid: Happy twistday!",
			"date_added": 1462594100702
		},
		{
			"body": "I always wanted a carbureted gas guzzler with a big belt-driven supercharger on top & spikes all over it & a machine gun on the back",
			"date_added": 1462630033985
		},
		{
			"body": "Mad Max and Star Wars aren't so different. It's like living on Tatooine.",
			"date_added": 1462630116178
		},
		{
			"body": "And who wouldn't want to live on Tatooine?",
			"date_added": 1462630128692
		},
		{
			"body": "/me speaks directly to your mind.",
			"date_added": 1462817650091
		},
		{
			"body": "We need streaming over ZN so I can start Radio Free ZeroNet",
			"date_added": 1462823992756
		},
		{
			"body": "@yilmazerkan@zv: Well I think we'd want to emulate multicast over DHT or something",
			"date_added": 1462825060599
		},
		{
			"body": "though maybe it would be better to treat it like a torrent",
			"date_added": 1462825107284
		},
		{
			"body": "an infinitely long torrent",
			"date_added": 1462825114927
		},
		{
			"body": "each block being 30 seconds or whatever latency you want to tolerate",
			"date_added": 1462825140636
		},
		{
			"body": "hmm, I'm starting to wonder if this could be done with a zerosite that updates every 30 seconds plus a plugin",
			"date_added": 1462825235588
		},
		{
			"body": "just have a few 30 second chunks in files, delete the oldest and add the newest every 30s",
			"date_added": 1462825284873
		},
		{
			"body": "that's kind of how plex handles on-the-fly transcoding",
			"date_added": 1462825365287
		},
		{
			"body": "just does it in chunks and then stitches the chunks together",
			"date_added": 1462825375386
		},
		{
			"body": "What is the language the ZeroFrame API docs use? Is that CoffeeScript?",
			"date_added": 1462825642457
		},
		{
			"body": "Hmm, I'm guessing I probably can't access the web audio API frmo within the zeroframe",
			"date_added": 1462825757528
		},
		{
			"body": "I think we're discussing two different kind of portals here. There's the stargate one whose event horizon looks like water, and there's the \"portal\" one where it's just a translucent blue or orange, with there being no difference in functionality between the two other than to designate the ends",
			"date_added": 1462900019526
		},
		{
			"body": "then we have the star trek: deep space 9 wormhole and the The Expanse rings",
			"date_added": 1462900059217
		},
		{
			"body": "and the stargates in the Buck Rogers TV series",
			"date_added": 1462900070027
		},
		{
			"body": "https://johnkennethmuir.files.wordpress.com/2011/08/ftl1979.jpg",
			"date_added": 1462900150711
		},
		{
			"body": "But I guess the real discussion is whether that's a valid multiple choice question",
			"date_added": 1462900190360
		},
		{
			"body": "Hey, I'm going to blow your minds.",
			"date_added": 1462900214732
		},
		{
			"body": "Entropy is a measure of the amount of information needed to describe a system",
			"date_added": 1462900240889
		},
		{
			"body": "The entropy of a black hole is proportional to the area of its event horizon.",
			"date_added": 1462900256061
		},
		{
			"body": "A black hole is the highest entropy state of matter.",
			"date_added": 1462900265127
		},
		{
			"body": "The entropy of the universe can only increase, never decrease.",
			"date_added": 1462900303369
		},
		{
			"body": "Therefore, the most entropy you can have in a region of space is determined not by the volume of the region, but by the area of any arbitrary boundary around the region",
			"date_added": 1462900350408
		},
		{
			"body": "That's assuming that black hole formation doesn't somehow increase the entropy of the surrounding space.",
			"date_added": 1462900364772
		},
		{
			"body": "https://en.wikipedia.org/wiki/Holographic_principle",
			"date_added": 1462900438408
		},
		{
			"body": "Ok, now to blow your mind a second time.",
			"date_added": 1462900586554
		},
		{
			"body": "You've probably heard of Hawking radiation, which is the notion that black holes have a temperature",
			"date_added": 1462900602216
		},
		{
			"body": "Well, it turns out that non-black-hole event horizons also have a temperature. Including the event horizon that forms when any object is accelerating.",
			"date_added": 1462900631790
		},
		{
			"body": "https://en.wikipedia.org/wiki/Event_horizon#Apparent_horizon_of_an_accelerated_particle",
			"date_added": 1462900826055
		},
		{
			"body": "@flyman@zid: Entropy is not really complexity.",
			"date_added": 1462907255245
		},
		{
			"body": "The universe could end up as a bunch of black holes",
			"date_added": 1462907291777
		},
		{
			"body": "So it would be \"dead\" for all practical purposes",
			"date_added": 1462907303332
		},
		{
			"body": "Roger Penrose has a theory about it involving a massive change of scale, where the remains of this universe become just ripples in the next one",
			"date_added": 1462907341125
		},
		{
			"body": "I'm more interested in the potential relationship between the universe and computation, and the potential for breakthroughs in space propulsion",
			"date_added": 1462907402564
		},
		{
			"body": "Ok, here's another one for you, rooted in much more controversial physics",
			"date_added": 1462907594119
		},
		{
			"body": "It's possible that what we know as quantum mechanics comes from particles getting \"knocked around\" by a background radiation field",
			"date_added": 1462907657686
		},
		{
			"body": "essentially, brownian motion",
			"date_added": 1462907680694
		},
		{
			"body": "Oh, and another one.",
			"date_added": 1462907947638
		},
		{
			"body": "Relativity discards the notion of a privileged reference frame, but that doesn't mean that it's been proven that there isn't one. In fact, the lorentz transformations that cause massive particles to become infinitely massive as they approach the speed of light predates relativity",
			"date_added": 1462908020277
		},
		{
			"body": "it was created for the purpose of explaining how the michelson morley experiment could give the results it did (speed of light the same in all directions regardless of motion) even in the presence of a luminiferous ether",
			"date_added": 1462908129733
		},
		{
			"body": "it doesn't even require weird geometry",
			"date_added": 1462908189502
		},
		{
			"body": "it's just the result you get in four euclidean dimensions if light is your only yardstick",
			"date_added": 1462908216290
		},
		{
			"body": "Kind of. I've spent a lot of time thinking about it. I can imagine rotations in 4d.",
			"date_added": 1462908450707
		},
		{
			"body": "I have more trouble imagining the 3d \"sponge\" I think the universe actually is :)",
			"date_added": 1462908478198
		},
		{
			"body": "where you have 0d objects \"stretched\" into 1d worldlines that extend out only along light cones (really, expanding or contracting spheres) and changing directions when they intersect with other worldlines, forming a network of these intersections that appears to be a 4d spacetime",
			"date_added": 1462908643836
		},
		{
			"body": "Intuitively it seems like that should be able to map into a 3d object, but I have no idea what the mapping would be",
			"date_added": 1462908721102
		},
		{
			"body": "Maybe analogous to a hologram, where points become waves and vice versa",
			"date_added": 1462908741967
		},
		{
			"body": "of course, real world holograms are based on only a single wavelength",
			"date_added": 1462908769341
		},
		{
			"body": "maybe the wavelength for the universal hologram is the planck length?",
			"date_added": 1462908790371
		},
		{
			"body": "that's one possible model where the speed of light is still a speed limit",
			"date_added": 1462908846391
		},
		{
			"body": "there's another possible model where the speed of light only acts like a limit because of the way matter interacts with the fields that pervade the universe",
			"date_added": 1462908899701
		},
		{
			"body": "and you have the higgs field, which is a scalar field which has the same value everywhere, and the electromagnetic field, which is a vector field and 0-valued most places",
			"date_added": 1462908973436
		},
		{
			"body": "photons move at the speed of light because they do not interact with the higgs field",
			"date_added": 1462908990104
		},
		{
			"body": "but they do interact with the electromagnetic field",
			"date_added": 1462909000490
		},
		{
			"body": "not higgs particles, the higgs field",
			"date_added": 1462910384115
		},
		{
			"body": "higgs particles are just a consequence of the higgs field",
			"date_added": 1462910409597
		},
		{
			"body": "The Higgs field is weird. It is constant-valued.",
			"date_added": 1462923876749
		},
		{
			"body": "",
			"date_added": 1462985929042
		},
		{
			"body": "",
			"date_added": 1462985974057
		},
		{
			"body": "@flyman@zid: You wrote phonetic English using cyrillic letters, didn't you?",
			"date_added": 1463005012343
		},
		{
			"body": "I know the cyrillic alphabet well enough to be able to read it with some effort.",
			"date_added": 1463005086540
		},
		{
			"body": "\"I am slao can generate something you probably not will able to translate with your translating methods\"",
			"date_added": 1463005290103
		},
		{
			"body": "also",
			"date_added": 1463005292773
		},
		{
			"body": "sigh, I have a choice between a fast compile that crashes from running out of memory at -j4 or a really slow compile that so far seems to have enough memory",
			"date_added": 1463010951530
		},
		{
			"body": "that's what I get for running this on a vps.",
			"date_added": 1463010978278
		},
		{
			"body": "but it also means I can work on it from anywhere which is nice",
			"date_added": 1463010997003
		},
		{
			"body": "Matrix sucked",
			"date_added": 1463070702303
		},
		{
			"body": "Fine as an action film but the story itself was something of an afterthought. Could have taken place as easily in ancient China.",
			"date_added": 1463070920569
		},
		{
			"body": "Just swap the agents out for gods or masters of black magic or something.",
			"date_added": 1463070945915
		},
		{
			"body": "And come on, humans as an energy source? We're not as efficient as gas turbines.",
			"date_added": 1463070972221
		},
		{
			"body": "I should say we're not EVEN as efficient as gas turbines.",
			"date_added": 1463070982629
		},
		{
			"body": "Would have made sense if they were using us to supplement some shortcoming on their part like creativity.",
			"date_added": 1463071042391
		},
		{
			"body": "But no, they used us for something we're terrible at.",
			"date_added": 1463071061932
		},
		{
			"body": "And that machines are very good at.",
			"date_added": 1463071070231
		},
		{
			"body": "Also, apparently they knew about \"a form of fusion\" but not good ol' fission? Plenty of uranium and thorium on the planet.",
			"date_added": 1463071103580
		},
		{
			"body": "Don't need sunlight for energy at all.",
			"date_added": 1463071116926
		},
		{
			"body": "@xsunshine@zid: you could almost certainly do some kind of \"streaming\" by dividing up the stream into chunks and treating them as regular files, with a javascript player, EXCEPT I am not sure if it's possible to do gapless playback inside the ZeroFrame. May require writing a plugin, though I'm sure such a plugin would be welcome.",
			"date_added": 1463071623213
		},
		{
			"body": "Latency would need to be on the order of a minute or so",
			"date_added": 1463071661563
		},
		{
			"body": "@flyman@zid: While that's a reasonable explanation, I don't think it was the intent.",
			"date_added": 1463081519309
		},
		{
			"body": "Building cross toolchains sucks, especially when the only reason you're building the cross toolchain is to build a native toolchain for the other platform.",
			"date_added": 1463085815186
		},
		{
			"body": "Actually, I'm not sure which sucks worse, building a working cross toolchain or crosscompiling a native toolchain.",
			"date_added": 1463085860591
		},
		{
			"body": "As far as I can tell binutils doesn't ever expect to be built in an environment that cannot produce shared libraries.",
			"date_added": 1463085895308
		},
		{
			"body": "At least, not on Linux i386/x86_64",
			"date_added": 1463085919809
		},
		{
			"body": "I'm hoping I can fool it by compiling musl with -fPIC",
			"date_added": 1463086437047
		},
		{
			"body": "I may need to abandon using musl-cross or at least modify it because it doesn't give me fine-grained enough control of the process",
			"date_added": 1463086476130
		},
		{
			"body": "it has features to handle static-only musl but I'm using a more recent binutils than it has bee ntested with",
			"date_added": 1463086506634
		},
		{
			"body": "of course, I'm building a native toolchain and then will just use that to build another toolchain and discard it, but I think I will still ahve the same problem with binutils",
			"date_added": 1463086567175
		},
		{
			"body": "I may just need to patch binutils",
			"date_added": 1463086585191
		},
		{
			"body": "Woo! Success!",
			"date_added": 1463091073974
		},
		{
			"body": "Now I need to compile enough other crap that I can chroot into it and test it out",
			"date_added": 1463091132550
		},
		{
			"body": "Ah, it does appear I should not be using musl-cross to compile my stage0",
			"date_added": 1463091362256
		},
		{
			"body": "/me waves",
			"date_added": 1463418343574
		},
		{
			"body": "I never thought I'd find a window manager I'd like better than i3, much less one that's smaller, but I have: spectrwm",
			"date_added": 1463418855071
		},
		{
			"body": "Still a little bloated for my taste, but I haven't had the time to put in the work to make a less bloated one usable",
			"date_added": 1463418878240
		},
		{
			"body": "so I started on some work to bring interactive maps to zeronet",
			"date_added": 1463422484677
		},
		{
			"body": "there is not a huge amount of documentation on hosting your own vector tiles",
			"date_added": 1463422519344
		},
		{
			"body": "I have the tiles now but still need to figure out how to generate fonts",
			"date_added": 1463422563140
		},
		{
			"body": "my goal is no requests outside zeronet",
			"date_added": 1463422576310
		},
		{
			"body": "longer term goal is completely decentralized wikipedia-like-thing and openstreetmap-like-thing",
			"date_added": 1463422602596
		},
		{
			"body": "the OSM schema is not adequate though",
			"date_added": 1463422629747
		},
		{
			"body": "also, I'm not sure if it's doable with ZeroNet now or ever since it's multiple views of one amorphous very large collection so it's better to incorporate by reference",
			"date_added": 1463422797638
		},
		{
			"body": "I have an idea of how one would do it with IPFS",
			"date_added": 1463422816918
		},
		{
			"body": "twister keeps crashing. that's a bit concerning.",
			"date_added": 1463425219232
		},
		{
			"body": "/me waves",
			"date_added": 1463630854170
		},
		{
			"body": "/me waves",
			"date_added": 1464024512340
		},
		{
			"body": "@flyman@zid: just use IPFS and have people use one of the IPFS gateways to retrieve it",
			"date_added": 1464032843528
		},
		{
			"body": "Though there are zeronet gateways as well right?",
			"date_added": 1464032854823
		},
		{
			"body": "@flyman@zid: np. Seeya",
			"date_added": 1464039725565
		},
		{
			"body": "Sorry about being so slow to reply. I don't remember to check back to this window that often since I keep it on a different virtual desktop. The ZeroFrame needs to have an API for generating browser notifications.",
			"date_added": 1464039793052
		}
	]
}