{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "[Projet] [Science] Dupliquer la base de données Sci-hub sur Zeronet ?",
			"body": "Salut !\n\nVoici sci-hub : http://sci-hub.cc/. Il s'agit d'un projet visant à regrouper des torrents de documents académiques.\n\nJe serais très intéressé par une version incensurable similaire à Play : tant qu'un pair existe, le site existe !\n\nJe n'ai pas de compétences en programmation (il faudrait que je m'y mette…). Y a-t-il un moyen de dupliquer la base de données sur Zeronet ?",
			"added": 1462031224
		}
	],
	"topic_vote": {
		"1_1Hc27i6BKGT75oVCnPdA6KnmzCeFnFmQEP": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1B1MshmrKWod7ebWLR6Hiv7zyc4vGuwGnY": [
			{
				"comment_id": 1,
				"body": "J'espère que frenchpopcorn.com, qui a fermé, pourra maintenir un site sur Zeronet ^^",
				"added": 1462093085
			}
		],
		"1_1Hc27i6BKGT75oVCnPdA6KnmzCeFnFmQEP": [
			{
				"comment_id": 2,
				"body": "Je ne suis pas un connaisseur, mais pour ce que j'ai lu : je te suggère de bloquer les requêtes vers des sites tiers. Pour ce que j'ai compris, Zeronet est conçu pour ne pas permettre d'injection Javascript.\n\nCependant, comme il en a besoin, tu peux essayer Freenet, sans Javascript.\n\nAs-tu un message de Malwarebyte plus détaillé ?\n\nIl existe des OS plus sécurisés que Windows par ailleurs. OpenBSD est la référence absolue, mais je ne sais pas s'il a un gestionnaire de paquets. Et tu as Qubes OS, qui est basé sur Fedora et a donc des dépôts relativement conséquents, mais il ne prend pas le MP3 en charge (pour privilégier des formats audio libres).",
				"added": 1462131386
			},
			{
				"comment_id": 3,
				"body": "Zeronet fonctionne avec du Javascript. On peut faire des requêtes tierces vers d'autres sites, ce pourquoi il faut fermer les requêtes externes depuis 127.0.0.1 ; mais je considère les deux choses suivantes :\n\n1) Un pair ne peut pas modifier le contenu de ce qu'il partage, uniquement de ce qu'il émet ;\n2) Je ne sais pas ce que le code source de Zeronet permet. Je te suggère de contacter thekill38@zeroid.bit, qui a l'air de le connaître (par zeromail, si tu as envie, mais garde à l'esprit que chaque pair en aura une copie).",
				"added": 1462172170
			}
		],
		"1_1NbaJh8RrnVZU4VDBxoyUUkDcWHTM6SH7h": [
			{
				"comment_id": 4,
				"body": "@do3n: salut, non, pas du tout. Je me mettrai au Rust plus tard, et je ne suis absolument pas motivé par les langages web (ça m'a l'air d'un ennui profond). Zeromail ?",
				"added": 1462732570
			}
		]
	},
	"comment_vote": {}
}