{
	"title": "Bug Company",
	"description": "The ONLY war video analysis on 0Net",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1540781089,
	"post": [
		{
			"post_id": 13,
			"title": "Mucky Trenches",
			"date_published": 1540779487.741,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=HGzfCBsUGuA)\n\nClearnet Archive [LINK](http://www.aparchive.com/metadata/youtube/af5ff5b339b4a25489c259d132349ce5)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1540779622_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\n**Location:** Near Majevica Hills, Tuzla, Bosnia\n\n**Date:** May 12, 1995\n\n**Friendly Forces:** Bosnian Army\n\n**Enemy Forces:** Serbian Rebels\n\n**Event:** Yugoslav Wars\n\n0:01 to 0:08- Mud. One of the most hated terrain features. Not only is this a pain to move around in, it caused many soldiers in WW1 to acquire immersion foot, or also known as \"trench foot\".\n\n0:09- Booger hook on the kill switch.\n\n0:12- Cameraman gets flagged.\n\n0:23- Zastava M53\\. Sorta like the MG3, just with a slower rate of fire. It appears either the MG has bad ammo, or is dirty....or both.\n\n0:48- Artillery being dropped.\n\n1:02- More of that mucky mud. This is exactly the kind of fighting in Ukraine right now. GET OUT OF THE TRENCHES!!!! They didn't work in WW1, they wont work now.\n\n1:23- Can you spot the sniper's next target?\n\n1:26- Finally, a good solder. He takes a shot (aiming) and then finds cover, scanning his next shot.\n\n1:44- Rounds and artillery are getting closer to the trench.\n\nNot much to comment after that. These conflicts were some nasty events that happened. Terror in the streets, or nightmares in the woods, pick your poison. This wasn't the footage I had in mind for tonight, but I think it'll open the stage for the next post."
		},
		{
			"post_id": 12,
			"title": "Improvements",
			"date_published": 1540437611.303,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=27vQYmckvHE)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1540437589_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nLocation: Donetsk International Airport, Donetsk Oblast, Ukraine\n\nDate: Sometime between September 28, 2014 - January 21, 2015\n\nEvents: Second Battle of Donetsk Airport\n\nFriendly Forces: Ukrainian Armed Forces\n\nEnemy Forces: Separatists Forces\n\nIt was hard to identify exactly who is who, but it's a good guess.\n\n0:01- Beautiful country side, shame it's torn from the war\n\n0:10- Sounds like a very close, incoming rocket?\n\n0:34- Oh boy, another pet peeve. This soldier needs to back up. Half of his rifle is hanging outside the window.\n\n0:40- This is almost the perfect sniping room that I was talking about a few post ago. It's dark, the windows have \"junk\" in them. All they need to do is block that window and make hole or a crack of some sort to shoot through. It'' conceal their muzzle flash and position.\n\n0:52- to 1:17- Yup, I think you got them all. Why are they mag dumping? Unless they are trying to engage targets in that tower WAYYY out there. They should be using that SVD instead.\n\n1:20- The soldier is holding a homemade 12.7x99mm bolt action anti-material rifle. I'm not sure if they are in production or if this is another homemade version.\n\n1:35- Armed convoy driving down the runway. These soldiers need to mount that MG or utilize the bipod. Also they keep walking in each other's line of fire....At least the one guy has hearing protection on!\n\n1:48- Looks like a tank or an armoured vehicle.\n\n2:00- The anti-material rifle in action. Also I can not identify the unit patch on his left arm.\n\n2:17- You can see the airport terminal in the distance (to the east). I believe they are standing on a control tower.\n\n2:26- armoured vehicle is making another pass. You can see the defenders using rockets, but don't lead them on well enough. The vehicle also fires back.\n\n2:52- An explosion goes off. I'm not sure what it was, as the soldiers were alive.\n\nI love talking about the Ukrainian Civil War, it has both side with very modern technology and fighting styles, yet it also shows people with no/less combat experience fighting."
		},
		{
			"post_id": 11,
			"title": "Primitive Brain",
			"date_published": 1539832806.776,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=Nd9a0uvcNJM)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1539833034_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nOriginal Archive Clearnet [SITE](http://www.aparchive.com/metadata/youtube/b0652224a08c9255cfb728a7d9471cac)\n\nLocation: Monrovia, Liberia\n\nDate: May 8th,1996\n\nEvents: First Liberian Civil War\n\nFriendly Forces: National Patriotic Front of Liberia (NPFL)\n\nEnemy Forces: Unknown\n\nSo I won't be too harsh as these militiamen have zero training....forget that, war is war!\n\n0:01-0:06- Looks like something from a Fallout game.\n\n0:15- Looks like 308/7.62 NATO rounds.\n\n0:20-0:26- Women \"...cease fire?\" Man \"Huh?!\" Women \"So you're gonna hold the cease fire?\" Man \"I'm not getting into....\"\n\n0:27- Man thinking about his last moments before he blasts off the rocket of justice.\n\n0:32- He is holding an AMD-63.\n\n0:38- Whole tribe is walking to the paintball arena.\n\n0:43- This is what happens when you forget to stock up before the zombie outbreak.\n\n0:53- If Hank Hill was Liberian.\n\n0:59- Guy on the right has an SLR with some mags tapped up. Guy on the left fumbles with his mag.\n\n1:34- NPFL skips down the street.\n\n1:41- You can see 2 individuals crossing the street on the other side.\n\n1:49- The gunshot goes off, this signifies the two tribes to \"fight to the death\". Only a warrior will win.\n\n1:53- The Rebels take up both the left side of the street, next to a building, and the right sidewalk, with no cover.\n\n1:58, 2:04, 2:11, 2:15, 2:23- What did I just witness? Please tell me this didn't happen.\n\n2:45- Guy almost got shot twice there.\n\nSo in case you were wondering what someone who has zero training or knowledge with their weapons looks like. This is why modern militaries teach, train, recite, and train some more. With no knowledge we resort back to our primitive brains."
		},
		{
			"post_id": 10,
			"title": "Loosing Control",
			"date_published": 1539230146.154,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=COI2fA7LEdE)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1539230220_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nFriendly Forces: Syrian Arab Army\n\nEnemy Forces: ISIS\n\nSo this video really doesn't have much in content, but it shows what happens when you \"loose your cool\" under stress. You can even tell when the insurgents are giving commands, they are all screaming at the same time and giving opposite directions.\n\nI'm not saying you wont loose your nerve, but you need to calm down and THINK. That will save yourself AND your squad mates."
		},
		{
			"post_id": 9,
			"title": "Good 3 Man Squad Tactics",
			"date_published": 1539057171.664,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=nc-Pm9S8E8g)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1539057247_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nLocation: Donetsk Sergei Prokofiev International Airport, Donetsk, Ukraine\n\nDate: Between September-November 2014\n\nFriendly Forces: Dnipro Battalion\n\nEnemy Forces: Separatist forces\n\nEvent: Second Battle of Donetsk Airport\n\nBackground: This video follows three soldiers in a reconnaissance unit. They start to receive enemy fire and proceed to retreat to a safe zone. The beginning text roughly translates to \"we are being surrounded.\"\n\n0:01-0:25- The soldiers receive small arms fire and seek cover/concealment. As they retreat to cover, one of the soldier radios in (probably to update their squad). They use decent tactics by covering their retreat\n\n0:28- The machine gunner jump out in the open, I hate when soldier do this, it's bad and also dangerous.\n\n0:37- More pop shots, just suppressing fire.\n\n0:53- Kinda a bad leap frog. The other two soldiers should have suppressed his movement across the street.\n\n1:04- Better cover and movement plan. You can see they are doing it by the book: shoot, move, communicate.\n\n3:27- They are getting ready to move out.\n\n3:31- Good spot. The MG and camera man ran behind concealment and are not separating,working together as a unit.\n\n4:16- Again, moving down the street, using cover and concealment, they use an abandoned garage for cover.\n\n4:22- The soldiers preform a \"tactical reload\"\n\n4:27- Soldier radios, updating the situation. This is crucial, it does make or break a battle.\n\n4:48- The soldier regain their breath and cover each other as they exit the garage.\n\n4:55- They find another garage, this is good cover.\n\n5:32- MG sprays down allyway after leaving the garage.\n\n5:56- The video starts to end, but the soldiers are able to escape.\n\nGood tactics in this video. We can observe 1) The squad stayed together, working as a team. 2) Consistent communication between the squad and through the radio. 3) The squad observed that the enemy was surrounding them and needed to retreat. 4) They followed their assumed role of being a recon unit and not an infantry unit."
		},
		{
			"post_id": 8,
			"title": "All Is Not Quiet On The Eastern Front",
			"date_published": 1538972513.777,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=t80odtinSM0)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1538972468_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nLocation: Eastern Europe\n\nDate: 1941-1945\n\nEvent: Eastern Front: World War 2\n\nSadly these are modern sound effects added to the video (well made). But the video footage is real. Not much to comment on, these are real and well train soldiers fighting against each other."
		},
		{
			"post_id": 6,
			"title": "No Ammo BMPs: Urban Engagements",
			"date_published": 1538882181.365,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=i9x0TEZlPKw)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1538882117_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nLocation: Ilovaisk, Ukraine\n\nDate: Augest 18, 2014\n\nFriendly Forces: Armed Forces of Ukraine and Territorial Defence Battalions\n\nEnemy Forces: Donbass People's Militia and Russian Ground Force\n\nEvent: Battle of Ilovaisk\n\nWe will be watching the Ukrainian side, which was one of the groups to storm the city. The Ukrainian forces can be identified by the yellow armbands and two white vertical stripes on vehicles.\n\n0:17- Are technicals still a thing? They don't seem armoured, they might be used for transport instead of a fighting vehicle.\n\n0:24- NOPE! I was wrong. You can see that truck is going in reverse, using the grenade launcher (can't tell which model) for support.\n\n0.27-Also, they need to spread out. One rocket or explosion on the tank can wipe out most of those soldiers. Sure, use the BMP for cover, but space out.\n\n0:35- I'm not sure why they are engaging with small arms when they have a BMP. At this point, they need to keep moving and use the BMP as cover and support it as well.\n\n1:00- Rocket was deployed from the Ukrainian side. I'm assuming the BMPs have no ammunition? Seems odd.\n\n1:04- The soldiers are advancing slowly up to the city...in a MASS gaggle! You can also observe quite a few rocket launchers on their backs. Black smoke can be seen in the distance from a vehicle. (possibly from the rocket launcher from earlier?)\n\n1:13- They need to use cover and concealment. Sure they took cover along the barricade in the road, but there is a whole section of woods right beside them.\n\n1:38- Burning car.\n\n1:57- Looks like a old cache. The soldier recording needs to get out of that view from the open.\n\n2:13- I can't tell where his head is facing, but it's horrible room clearing.\n\n2:20- Rounds can be observed going through the dry wall. This time the soldier is smart and staying away from the rounds. I would recommend going into another room, such as back by the stairwell for cover. But good job staying away!\n\n2:44- This isn't too bad right now but....\n\n3:02- WAY too many people in that room! Especially when a few soldiers are at an \"at ease\" mentality (sitting down, facing enemy gunfire, weapons not at the ready, people walking/standing in front of windows)\n\n3:08- Linking a machine gun belt into a drum. It might be for that PKM used earlier.\n\n3:25- That's a BIG KNIFE (soldier with yellow safety glasses).\n\n3:28- Close up of what appears to be a M72 Law or an RPG-22\n\n4:03- They could be waiting around for action, but still a bad spot to do it.\n\n5:07- Better formation than earlier. They just need a bit more distance (such as 5-7 meters)\n\n5:23- Heavy action starts. I'm not sure if it's the same day, or when the OPFOR encircled the Ukrainians a few days later.\n\n5:36- The only sane thing here, a doggo!\n\n5:39- YES! FINALLY! They are using tactics and their head by using the BMP for cover! Still, not a single spent round has been fired from that BMP\n\n6:33- Patient dog awaits the outcome of his new owner."
		},
		{
			"post_id": 4,
			"title": "Rookie Sniping Mistake",
			"date_published": 1538713939.778,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=rXzBnIM2YCo)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1538713888_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nLocation: Raqqa, Syria\n\nFriendly Forces: Kurdish YPJ (Women's Protection Unit)\n\nThis brave warrior cheated death. But a few things that could have mitigated this.\n\n1) The blue headgear. I don't know the details, it could have been a unit/team identifier, but it sticks out. Blue on white is a dead give away.\n\n2) Major complaint here, I see it a lot in combat footage. Back away from the window/sniping hole! It's harder to spot someone when they are in a dark part of a building instead of a bright, wide open widow.\n\n 2A) Setting up a black blanket or tarp to hide their silhouette. This is harder to pull off in the daytime, during battle, but it helps conceal your position.\n\n3) Sticking your muzzle outside the window makes a large muzzle flash and dust cloud. Again, move further back in the room.\n\n4) firing from the same position/spot. Either move to another location, or peak around something like a table or wall.\n\nAll in all, she is very luck for being less trained and more unequipped than her enemies. I don't know if she is still alive, quiet a few female snipers were KIA during that time frame."
		},
		{
			"post_id": 3,
			"title": "Failed ISIL VS Peshmerge Offensive",
			"date_published": 1538622830.369,
			"body": "Clearnet YouTube [LINK](https://www.youtube.com/watch?v=aM3ElTvF52I)\n\nZeronet YouTube [LINK](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1538628712_1EXZCkPCtDHABTMqza4cA43BD4caTEpoB)\n\nLocation: Mosul, Iraq\n\nTime: March ? 2017\n\nFriendly Forces: Iraqi troops, Peshmerga, other allied fighters\n\nEnemy Forces: ISIL\n\n1:13- Sending in suicide bombers...great way to start this video off!\n\n1:43 to 1:47- Those look like rows of anti-tank launchers?\n\n1:53- Loose formation, no armour support. Also MG3 is being used.\n\n2:00 Armoured vehicle to the right was shelled by a tank (You can observe the tank to the far right, just near the peak of the hill top).\n\n2:04 to 2:09 -Wasting ammunition.\n\n2:12 -It should be on your person...\n\n2:27 -Poor Abu Hajaar, he is just happy he has a shiny new MG to play with.\n\n2:52 to 2:59 -Why are you picking on Abu Hajaar?! You asked him to cover you!\n\n3:06 -Better raise that puppy in the air!\n\n3:16 -AAnnddd that's why.\n\n3:24 -Destroyed armoured vehicle.\n\n3:34 -Abu Hajaar is just doing is job, spraying with the MG. No need to yell at him Abu Abdulla!\n\n3:35 to 4:38 -Cluster fuck is happening.\n\n4:41 -Vehicle hit, either by an anti-tank launcher or a tank.\n\n4:59 -Again, it should be on your person...\n\n5:07 -....SHOULD BE ON YOUR PERSON!\n\n5:08 -RIP Khattab\n\n5:22 -Should deploy that MG3 for suppressive fire. Also looks like there is blood on his sling\n\n5:25 -Whiskey Tango Foxtrot, WHY ARE YOU ROLLING. WHY ARE YOU RUNNING IN THE OPEN?!\n\n5:35 -Terr (Abu Ridhwan) got shot (terr with the Go Pro on)\n\n5:46 -Abu Hajaar was the smart one here. He left because his friends were picking on him. Who was the \"smart\" one now?\n\nMost of those fighters were killed. There is a Peshmerga footage of the offense floating around somewhere."
		},
		{
			"post_id": 1,
			"title": "Welcome!",
			"date_published": 1433033779.604,
			"body": "Come watch these war videos and listen to my criticism.\n\nShoot me a message at floppycasio@zeroid.bit"
		}
	]
}