{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"4_1CQAzBixetRWrEto8hLKTKcA7oCDBuNdu8": [
			{
				"comment_id": 1,
				"body": "利益的争夺罢了，把美帝吹成了天使，隔夜饭要吐出来了。懒得打字，转一篇别人的吧\n\n作者：许杨\n链接：https://www.zhihu.com/question/272262535/answer/367292225\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n1、叙利亚内战是不是都怪美国或者俄罗斯？不是。不单单是叙利亚，“阿拉伯之春”后所有阿拉伯国家的军政动荡本质上还是它们自身的原因。而叙利亚是非常典型的例子：首先，叙利亚内部有宗教矛盾。阿萨德家族属于伊斯兰教阿拉维派，原本是一个小众教派，后来得到伊朗的承认而成为了什叶派的一个分支（这显然是出于政治目的），而绝大多数的叙利亚人民属于伊斯兰教逊尼派，双方对伊斯兰教理解不同，素有矛盾，而恐怖主义恰恰是极端逊尼派所孕育出来的恶魔。第二，叙利亚内部有民族问题。除了阿拉伯人外，该国边疆地区生活着大量库尔德人，他们一直有独立建国的愿望。而库尔德人在土耳其、伊拉克等国家也有分布，势力庞大。电影《天国王朝》中率领穆斯林抵抗十字军的英雄萨拉丁就是库尔德人，并非阿拉伯人。最后，叙利亚内部有阶级矛盾。和她的穆斯林兄弟们一样，叙利亚的强人政治最终没能让国家走向富强，贫富差距过大、社会资源分布不公广泛存在，一旦有了导火索，反叛便有了燎原之势。诚然，美俄在叙内战中确实扮演了重要的角色，起到了推波助澜的作用。但从本质上看，叙内战的主要原因还是自身内部矛盾使然。\n\n2、美国和俄罗斯为什么在叙利亚互不相让？先说俄罗斯，与人们普遍的认知不同，俄罗斯的综合实力并不强大。苏联确实是世界强权，但俄罗斯已经是明日黄花，其GDP和广东省相当，远不如韩国，其军事科技也基本上在吃苏联的老本儿，唯一欣欣向荣的就是能源产业——俄罗斯是世界第一大产油国，超过人们熟知的沙特。传统上，中东地区几乎都是苏联的势力范围，但苏联衰落后力量锐减，无法继续支撑庞大的盟友阵容，如今只有叙利亚还是俄罗斯的小兄弟。如果失去了叙利亚，俄罗斯在中东就彻底没有了同盟。某种程度上，叙利亚是俄罗斯在中东地区的底线，就如同东乌克兰是其在欧洲的底线一个道理。所以，尽管与美国实力差距悬殊，俄罗斯仍然拼尽全力保卫阿萨德政府。需要说明的是，俄罗斯虽然纸面实力薄弱，但其战争潜力仍然是巨大的，历史已经无数次证明了这一点。美国毫无疑问是世界第一强权，但遗憾的是，在中东地区她的地位并不稳固，而且越来越不稳固。在中东，美国似乎陷入了一个怪圈——支持谁，谁完蛋。比如伊朗——美国支持巴列维政府，巴列维被伊斯兰革命搞下台，伊朗彻底站在了美国的反对面。比如伊拉克——两伊战争中美国支持萨达姆，萨达姆背叛美国，于是美军入侵伊拉克，战后伊拉克开启民主化，但是民主化后，什叶派人数多，所以必然会选出什叶派的政府首脑，而什叶派亲近什叶派的大本营——伊朗，于是，数千美国大兵的埋骨地伊拉克不可阻挡地倒向美国的老对手。比如阿富汗——苏联入侵阿富汗后，美国大力扶持阿富汗当地反苏武装，结果塔利班做大（包括拉登），拉登搞了911，美国入侵阿富汗，阿富汗陷入内乱，变成烫手山芋。比如埃及，萨达特在美国斡旋下和以色列媾和，结果被国内极端分子刺杀，穆巴拉克接任后继续亲美，但在“阿拉伯之春”中被搞下台，美国见死不救，穆兄会上台后奥巴马立刻访问埃及，结果穆兄会执政不到一年下台，塞西对美不再信任。比如利比亚，卡扎菲执政时，至少美国还可以找他谈判，如今谈判都不知道该找谁，利亚比彻底混乱，连美国大使都被打死。比如也门，内乱后胡塞武装势力庞大，又是一个什叶派武装，背后有伊朗站台。比如土耳其，在和俄罗斯的屡次冲突中，美欧的暧昧表现让土耳其明白，自己是无论如何也无法“脱亚入欧”的，于是和俄罗斯关系反而亲近了一些……总之，在“阿拉伯之春”后，美国丢掉了中东地区几乎所有盟友和潜在盟友，多了一大堆敌人——讽刺的是，阿拉伯之春的后果如此具有颠覆性，恰恰也有美国的助推。民主国家一定亲美吗？非也，历史上，西方人给中东制造了太多的流血冲突，导致中东民众完全不能信任美国。所以，越是民主的中东国家，越是反美，反而独裁领导人出于深远考虑，愿意和美国合作。但是，独裁领导人都被“阿拉伯之春”干掉了……如今只有沙特和美国关系较好，但双方也缺乏信任，毕竟一个是民主自由的灯塔，一个是最落后、最保守的君主独裁国家，而且和恐怖主义有着千丝万缕的联系。因此，美国虽然强大，但在中东也无路可退，面对咄咄逼人的俄罗斯和伊朗，面对各怀鬼胎的海湾国家，叙利亚是必争之地。美国和俄罗斯的利益在叙利亚针锋相对地冲突，双方退路似乎都不多，但总体看美国还是要强不少。\n\n3、叙利亚政府军是否真的使用了化学武器？我觉得可能性几乎没有。经过多年战争，叙政府军已经基本收复了大城市和重要地区，此时使用化学武器，反而授人以柄，而且收效甚微，实在难以理解。同样道理，俄罗斯在英国毒杀特工，也是在特工平静生活多年，而俄罗斯就要举办世界杯，最需要国际友好环境的情况下，这实在匪夷所思。需要特别指出的是，联合国委派的化武核查员14号就要进驻叙利亚，美国却选择在14号凌晨空袭“化武基地”，何必这么心急？如果叙利亚确有化武，美国为什么不等一等联合国核查的结果呢？关于化武这个问题，我在上一篇文章中有详细论述：美国打击叙利亚这剧本可以参评奥斯卡了当然，叙利亚政府军是否使用化学武器，本身并不重要，只是一个借口。南联盟没有使用化武，美国照样轰炸了；伊拉克阿富汗没有使用化武，美国照样打掉了。中国从来没有使用过化武，从1840年到1945年，挨了多少顿揍？是化武的问题吗？显然不是。\n\n4、既然叙利亚内战有政府的问题，为什么政府军反而即将胜利？叙利亚有内部矛盾，所以内战，但矛盾不足以支撑社会彻底改朝换代的动机，再加上域外大国的参与，所以叙利亚政府军即将获胜。就好像唐朝也有规模浩大的安史之乱，因为均田制、府兵制的失败积累了大量的社会矛盾，所以才给了安、史之流可乘之机，但唐朝依然镇压了安史之乱，并继续存在了152年之久。叙利亚政府有罪，但恐怕罪不至死，还有很多的支持者，这是本质原因。只是，经历了内战，叙利亚想重回和平稳定，恐怕要数十年甚至上百年才行。\n\n5、美国这次打击叙利亚是全面打击的先兆吗？不是。实际上，总体看，叙利亚反对派大势已去，美国已经丧失了武力推翻阿萨德政府的机会。在所有反对派中，实力最为强劲的库尔德武装和阿萨德矛盾最小，反而可以谈判，其他武装根本是“烂泥扶不上墙”。如果要推翻阿萨德，美国必须派陆军入侵叙利亚，但有了伊拉克和阿富汗的前车之鉴，再加上国内政治经济形势的不确定，这个可能性几乎没有。美国这次打击，是手术刀般的，也是警告性和示威性的，其目的应该是在未来叙利亚重建中搏得话语权，同时打击俄罗斯的国际影响力。甚至说，叙利亚可能只是美国对付俄罗斯的一个棋子，近段时间，冬奥会禁赛、驱逐外交官、打击叙利亚……美国和北约似乎在对俄罗斯进行一次合围，在世界杯举行之前，恐怕还是多事之秋。大家可以想想08年北京奥运会之前，西藏发生了什么，造成了多大的损失，死了多少平头百姓。\n6、如果叙利亚政府被推翻，叙利亚人民会过得更好吗？不，绝对会过得更差。叙利亚政府虽然犯了很多错误，但毕竟是一个世俗化的、趋向现代文明的政府。在上世纪90年代，叙利亚人几乎家家有车，过得相当不错。如果反对派掌权，那毫无疑问将把叙利亚变成另外一个阿富汗——叙反对派鱼龙混杂，与恐怖组织有千丝万缕的联系，其行为极端保守，又缺乏经验，他们一旦掌权，先不说自己的内斗，就算团结一致，也只会把叙利亚变成一个神权国家。而后，几乎必然地，他们又会站在美国的对立面，就像当年塔利班和本拉登一样，因为极端主义追求的就是彻底摧毁西方文明。如果感兴趣，可以通过下面这个链接，了解叙利亚反对派的具体构成。叙利亚反对派概述（该文写作时间较早，如今情况可能已经变化）\n7、中国应该持何种态度？中国不应该介入中东，除非国家安全遭到严重威胁。事实证明，中东是大国坟场，是一片太过复杂而混乱的土地。闷声发大财才是最好的。\n\n8、叙利亚人民为什么值得同情？叙利亚人民所经历的一切，中国人都经历过。当一个国家强大时，它是棋手；弱小时，它是棋子；四分五裂时，它就变成棋盘了。国际社会是弱肉强食的最好例证，中国曾经是自然法则最大的受害者。所以我们应该同情叙利亚，我们曾经就是叙利亚。当你有实力时，可以不讲理——比如，最近，英国拍卖公司即将拍卖抢走的中国文物，中国抗议了，人家说这符合法律；而当我们讨论叙利亚，说美国的袭击不符合国际法时，人家又说了，叙利亚使用化武，这是一个道德问题。所以，当你和他们谈道德的时候，他们和你谈法律；当你和他们谈法律的时候，他们和你谈道德。怎么谈，他们都有“理”。直到今天，中国也还在承受着“叙利亚之痛”，因为历史具有强大惯性，这种伤痛并不体现在物质上，而更多地体现在人心上——直到今天，还有很多同胞对国际政治缺乏一种基本的客观态度，他们天真地以为美国和西方是永远正确的，我请这种人好好想一想——恐怖分子的恐怖袭击，可以炸死一百人，砍死几十人，而美国总统签署一个命令，就可以让几十万人头落地——你如何保证那几十万人中没有你？在美军历次行动中丧生的那些叙利亚人、伊拉克人、阿富汗人，他们也是看着美国大片，喝着可口可乐长大的人，他们可能非常爱美国，但是他们死了，悄无声息，没人知道，就像水倒进了水中。\n\n不要跪下，你跪下了，别人在取你人头时，甚至都懒得看你一眼。",
				"added": 1523983759
			}
		]
	},
	"comment_vote": {
		"1_14z9GwDksv6SnmR4EUnPFxFt8uTLiKfJS1": 1
	}
}