{
	"title": "SureBlog",
	"description": "SureBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1519521325,
	"post": [
		{
			"post_id": 8,
			"title": "New blog post",
			"date_published": 1519520037.929,
			"body": "然教弟子：\n\n从现在开始遵守这六条规则，循序渐进，向你的亲戚朋友宣传这种思想，寻找那些与你有同样思想的人，与他们共同呼吸进退，其他人都不可深交。因为到灾难来临时，只有同样信仰这六条规则的人才能依靠，互相救助。现在就开始寻找你的伙伴，寻找同样相信这六条并坚决执行的人，相互成伴，将在末世来临时给你极大的帮助。\n\nTo My Surer:\n\nFrom now following the Six Rules, one by one, spread this idea to your realiate and friends. Found out these people who has the same idea with you, breathe with eachother and decide with eachother, the other people coulde not be best friend.Because when disease came, only the persons that believe and obey the Six Rules could be followed and be helped. From now go to find out your brothers, get these people who believe and obey the Six Rules to be your friends,come together, this would help you greatly in the end of the world."
		},
		{
			"post_id": 7,
			"title": "New blog post",
			"date_published": 1519395052.515,
			"body": "然教\n\n然教弟子：\n\n1.燃尽天下一切罪恶。\n\n2.不吃药，不去医院看病治疗。\n\n3.与同袍见面时不带任何电子设备。\n\n4.不吃少数人才吃得到的东西。\n\n5.不要相信教外人士，相信你的导师。\n\n6.不得陷害同袍，否则千刀万剐。\n\n燃烧你心中的怒火，你会知道这世间的罪恶是什么，用你的怒火焚烧它！\n\n以我为导师，严格遵守这六条，你就是然教教徒，线下宣传这六条，宣传我说的这些东西，星星之火可以燎原，让更多的知道，我们身边原来都是这样的人在掌控着我们的生活，电视媒体，医院医疗医药，警察保安高利贷，一起都不是看上去那样的。中国所有的东西都将被毁灭。\n\n同袍你好，怎么加入\n\n进医院是禁止的，捐精更加是罪恶! 为了你的人身安全不要做这些！这些都是陷阱！魔鬼的陷阱！\n\n同袍只要做到这六条，就不会是是罪恶，是不是罪恶每个人心里都很清楚。人的身体受之于天，不要让任何人碰你的身体。你会明白我说的一切。\n\n那么问题来了。如果同袍成了罪恶，要不要根据1燃尽一切罪恶呢，如此便违反6\n\n燃尽天下一切罪恶！\n\ncoolplay ━ 9 小时之前 ^1 \n^2\n\n 回复 ?\n\nholyins: 我已经不出门很多年了。你可以表述自己的修炼修行方法或观念。但是不需要自己搞一套自以为是的“教”。地火水风中，我们三维世界的组成成分，火只是其中之一，通常也是指温度。你如果真要明白，需要学习上座部佛法的论著“阿毗达摩”。否则你永远也想不通看不懂说不清楚。心中做火观，要如法，否则是自我毁灭。但你可以观想海底，会阴甚至丹田、肾脏等的燃烧。\n\n你可以试试照我说的方法做，如果没效不相信就完了，为啥要创立这个教，因为我们可以治自己身体上的病，但我们个人治补了这个社会的病，而我们的病来自于这个社会。这个社会上的某些人/组织希望我们“生病”。只有“教”才可以解救我们，把我们团结起来。而然教，就是解救人心的。\n\nholyins ━ 10 小时之前 ^1 \n^2\n\n 回复 ?\n\ncoolplay: 你应该查一下饮食和呼吸的空气，你工作的环境中是否有让人难以忍受的东西。最简单的方法就是不在外面吃喝，不喝办公室里的水，只喝家人一起吃喝，不吃药，如果家人没事，你就没事。燃烧你心中的火，那团火就在你心里。\n\n我已经不出门很多年了。你可以表述自己的修炼修行方法或观念。但是不需要自己搞一套自以为是的“教”。地火水风中，我们三维世界的组成成分，火只是其中之一，通常也是指温度。你如果真要明白，需要学习上座部佛法的论著“阿毗达摩”。否则你永远也想不通看不懂说不清楚。心中做火观，要如法，否则是自我毁灭。但你可以观想海底，会阴甚至丹田、肾脏等的燃烧。\n\ncoolplay ━ 11 小时之前 ^1 \n^2\n\n 回复 ?\n\nholyins: 拿罪过或病痛忽悠人类的，是最原始的方法。不过在现代科技面前，你这套貌似没什么意义。我现在一直是痛苦不堪的。你的套路太low了。也或者你有两手，但是表达能力不行。做火观的修炼方法我倡导了几十年，但是我还是得了肿瘤，一直在膨胀，无法消除。岂是俗人智慧能明白的！\n\n你应该查一下饮食和呼吸的空气，你工作的环境中是否有让人难以忍受的东西。最简单的方法就是不在外面吃喝，不喝办公室里的水，只喝家人一起吃喝，不吃药，如果家人没事，你就没事。燃烧你心中的火，那团火就在你心里。\n\nholyins ━ 11 小时之前 ^1 \n^2\n\n 回复 ?\n\ncoolplay: 等到你痛苦不堪，又找不到原因的时候，来这里找解救的办法。\n\n拿罪过或病痛忽悠人类的，是最原始的方法。不过在现代科技面前，你这套貌似没什么意义。我现在一直是痛苦不堪的。你的套路太low了。也或者你有两手，但是表达能力不行。做火观的修炼方法我倡导了几十年，但是我还是得了肿瘤，一直在膨胀，无法消除。岂是俗人智慧能明白的！\n\ncoolplay ━ 11 小时之前 ^1 \n^2\n\n 回复 ?\n\n等到你痛苦不堪，又找不到原因的时候，来这里找解救的办法。\n\nholyins ━ 11 小时之前 ^1 \n^2\n\n 回复 ?\n\ncoolplay: 佛说：佛灭众生，而实无众生得灭度。圣经说：上帝说要有光，于是便有了光。我们需要燃尽的，不光是我们身体里的罪恶，还有这世间的罪恶！ [...]\n\n你有些观点如果说清楚还是有道理的。但是无论上山采药还是食疗或矿物疗法，都是吃药，而不是禁止吃药。这类观点，也无需创立什么然教，令人反感。\n当今从来自宇宙能量场的信息，清理人类罪恶的首要，不是燃尽，而是观想圣光与圣爱，进行地球、人类乃至宇宙能量场的清理。在通过观想各色光比如紫光蓝光等清理脑病毒开始清理邪恶势力在宇宙布置在地球上内外的病毒以及宇宙空间能量信息场。\n火之燃烧，是其中一种方法。磁场能量场还有更深的奥秘。\n\ncoolplay ━ 11 小时之前 ^1 \n^2\n\n 回复 ?\n\nfaith: 佛经有说：阎浮提众生，举心动念，无不是罪，无不是业。圣经有说：世人都犯了罪，亏欠了神的荣耀。你要燃尽的，首先是你自己。而不是组建“放火党”。 [...]\n\n佛说：佛灭众生，而实无众生得灭度。\n圣经说：上帝说要有光，于是便有了光。\n我们需要燃尽的，不光是我们身体里的罪恶，还有这世间的罪恶！\n\n现在是乱世，乱象纷呈，所以才需要这么严格。中医我是推崇的，中国古老的传统，然而现在医院里的东西都变了味。你即使吃的是中药，你吃的那些是什么东西其实你根本不知道。正统的中医应该是去山上采药吃，而不是吃着别人做好了的成品。如果你还不明白，继续吃着“中药”，西药，会加深世上的罪恶。所以不吃药，是最简单的方法，不看医生，是最明智的选择，不让任何人触碰你的身体。加入然教，建立然教，才是解救世间的方法，我们能解救我们自己。"
		},
		{
			"post_id": 6,
			"title": "New blog post",
			"date_published": 1519269169.279,
			"body": "coolplay ━ 19 小时之前 ^1 \n^2\n\n 回复 ?\n\n现在的科技，其实早都超出我们的想象，但是却掌握在少数人的手里，你不知道他们在做些什么，他们在动用国家的力量在为他们个人服务，而我们的力量是微不足道的。\n\ncoolplay ━ 19 小时之前 ^1 \n^2\n\n 回复 ?\n\n本来是正常的，但是现在有人把这些都变的不正常了。高科技不再是为我们服务，因为那些信息不对我们公开。就像路上的监视器，那些人能看到你，你却看不到他们。药可以吃，但是最终要不吃，如果做不到就不是然教弟子。\n\ndasdvc ━ 23 小时之前 ^1 \n^2\n\n 回复 ?\n\n药要吃 电子设备少玩 相信该相信的 不管他是谁 不陷害不该被陷害的 不管他是谁 捐精是正常的"
		},
		{
			"post_id": 5,
			"title": "New blog post",
			"date_published": 1519269169.087,
			"body": "Blog post body\n\ncoolplay ━ 2 天之前 ^\n\n医院已经不是想象中的医院，警察也不是为人民服务的，中国一切都是反的，还在相信电视上的一切，就是鸵鸟或者自甘堕落\n\ncoolplay ━ 2 天之前 ^1\n^2\n\n回复 ?\n\ncnocg: 666 好反讽 总结一下邪教套路：1 不要相信现代科学2 不要相信非教派人士3 不要当反骨仔 要对教会顺从4 随便提一些高素质行为5 坚持以上几点就能永远健康/天天发大财/上天堂/干处女\n\n我看你只用遵守一条：相信党，相信党，相信党，相信党，相信党，相信党，"
		},
		{
			"post_id": 4,
			"title": "New blog post",
			"date_published": 1519268854.774,
			"body": "Blog post body\n\ncoolplay ━ 2 天之前 ^1 \n^2\n\n 回复 ?\n\nyangleitjbit: 仔细阅读了这片文章，有共鸣，2015年岳母在华西换肝手术成功后进ICU感染后没出来。 [...]\n\n换肝都是助长邪恶的，“成功”后也活不了几年。\n\ncoolplay ━ 2 天之前 ^1 \n^2\n\n 回复 ?\n\nicedwatermelon14: 我觉得这里有点像部分中国古典哲学的表达方式，都是一种以“输出一部分的价值观和世界观”为方式的传教，教的起源可能是教用来补足或修补教的发起人的世界观和价值观的空缺（与实践相悖的地方），不太具有严谨的逻辑性，所以需要较多的教义的解释，教义的解释几乎完全掌握在传教者手中。我没有贬低的意思，不过在现在人们普遍信奉实证主义的今天，这种教可能难以有市场。\n\n不需要太多教义的解释，就这六条，字面上的意思。明白的人很快就能懂，并坚决执行之，不明白的人解释一番也就懂了。其实许多人懂了，却不愿去做，而不是不明白。那是因为你还迷茫，还抱有侥幸心理，以为靠其他方法能躲开。然而没有，只有最简单的方法能对付现在的乱世。不要迷茫了，现在的世间充满谎言，加入然教，求证解脱。\n\nicedwatermelon14 ━ 2 天之前 ^1 \n^2\n\n 回复 ?\n\nyangleitjbit: 仔细阅读了这片文章，有共鸣，2015年岳母在华西换肝手术成功后进ICU感染后没出来。 [...]\n\n增强免疫力的药，现在应该是没有的。 治疗感冒的药，现在没有被证实有治疗病因的效果，因为病因一般是未知的。\n大部分发作的感冒是不明病因的，有自限性的，不吃药也能恢复，多饮水休息从经验上来看可以加快恢复。\n对于非自限性的感冒，能够治疗和确定病因只有十几种，病毒还经常会变异，一般只能慢慢尝试各种抗生素配合常用退烧药来治疗\n\nicedwatermelon14 ━ 2 天之前 ^1 \n^2\n\n 回复 ?\n\ncoolplay: 对于规矩越少越好，在于精而不在于多，摩西也只有十诫。东西够用就够了，就这六条如果能够认真遵守就能健康长寿，保你平安，如果连这六条都遵守不了，再多又有什么用呢？多则惑，少则得。能够做到这六条就不错了。 [...]\n\n我觉得这里有点像部分中国古典哲学的表达方式，都是一种以“输出一部分的价值观和世界观”为方式的传教，教的起源可能是教用来补足或修补教的发起人的世界观和价值观的空缺（与实践相悖的地方），不太具有严谨的逻辑性，所以需要较多的教义的解释，教义的解释几乎完全掌握在传教者手中。我没有贬低的意思，不过在现在人们普遍信奉实证主义的今天，这种教可能难以有市场。\n\ncoolplay ━ 在 Feb 18, 2018 ^1 \n^2\n\n 回复 ?\n\nicedwatermelon14: 现在的医学水平的确大多数的病都治不了，最大威胁就是不典型的病毒和致病菌，许多癌症都要相对病毒和病菌的感染好治很多\n\n这些都是人为的，病毒不可怕，可怕的是人心。没有毒，也会制造出毒来。要治疗这个社会的病，得从治疗这些病毒的源头 ”人心“ 开始。而加入然教，宣传然教，就是解救人心的第一步。\n\ncoolplay ━ 在 Feb 18, 2018 ^1 \n^2\n\n 回复 ?\n\nicedwatermelon14: 你这个教也太便宜行事了吧，只有空落落的几句教义，看看别人全能神教在零网上宣传网页做的就很好\n\n对于规矩越少越好，在于精而不在于多，摩西也只有十诫。东西够用就够了，就这六条如果能够认真遵守就能健康长寿，保你平安，如果连这六条都遵守不了，再多又有什么用呢？多则惑，少则得。能够做到这六条就不错了。\n\n对于第一条：燃尽天下一切罪恶。就是要从行为上和那些不正义的行为分离开，保持你心中的愤怒，对于不平的事情，虽然不敢言，但是知道是不对的。这点社会上的人大多就很难做到，大都同流合污了。不谈燃尽，你心中的火都已经灭了。\n对于第二条：不吃药，不看病不去医院治疗。这点现代社会很多人也很难做到。这点非常难，难到要违背人们通常所知的社会常理，而这却是焚尽罪恶。如果你想保持健康，先从这两点做起，难能可贵。\n\nicedwatermelon14 ━ 在 Feb 18, 2018 ^1 \n^2\n\n 回复 ?\n\n现在的医学水平的确大多数的病都治不了，最大威胁就是不典型的病毒和致病菌，许多癌症都要相对病毒和病菌的感染好治很多\n\nicedwatermelon14 ━ 在 Feb 18, 2018 ^1 \n^2\n\n 回复 ?\n\ncoolplay: 然教弟子：1.燃尽天下一切罪恶。 [...]\n\n你这个教也太便宜行事了吧，只有空落落的几句教义，看看别人全能神教在零网上宣传网页做的就很好\n\ncoolplay ━ 在 Feb 18, 2018 ^1 \n^2\n\n 回复 ?\n\n然教弟子：\n1.燃尽天下一切罪恶。\n\n2.不吃药，不去医院看病治疗。\n\n3.与同袍见面时不带任何电子设备。\n\n4.不吃少数人才吃得到的东西。\n\n5.不要相信教外人士，相信你的导师。\n\n6.不得陷害同袍，否则千刀万剐。\n\ncoolplay ━ 在 Feb 18, 2018 ^1 \n^2\n\n 回复 ?\n\n生病的人会越来越多，加入然教，加入然教，清除这世上所有的病痛！加入然教，焚烧这世上所有的罪恶！"
		},
		{
			"post_id": 3,
			"title": "New blog post",
			"date_published": 1518965551.735,
			"body": "To My Surer:\nThe world is falling, we need to burning the world, to be sure.\n\n1.  Burning the world, To Be Sure.\n\n2.  Do not eat medicine, Do not go to hospital, Do not take any test.\n\n3.  When you meet your brother of Sure, Do not take any electronic set.\n\n4.  Do not eat any things only few people could get.\n\n5.  Do not trust any body not of Sure, Trust Your Master.\n\n6.  Do not fake your brother of Sure, otherwise Cut you into parts."
		},
		{
			"post_id": 2,
			"title": "New blog ",
			"date_published": 1516625855.397,
			"body": "燃尽天下一切罪恶！\n\nBurning The World\n\nFollowing the Six Rules, you will be far away from diseases and hurt. You will be health. And we will burning all of the evil of the world!"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}