{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"6_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 1,
				"body": "yvesrogne retourne à ta bouteille.",
				"added": 1502319216
			},
			{
				"comment_id": 2,
				"body": "Les nôtres sont les autres des autres et les autres sont les notres. Welcome refugies !",
				"added": 1502360205
			},
			{
				"comment_id": 3,
				"body": "Plutôt que de te soucier des hôtel Formule 1 en faillite ( ce que tu appel des château ) rachetés pour une bouchée de pain, penche toi sur le budget des armése ( 2ème de l'Etat) qui sert à soutenir tout ce que le monde connaît de dictature et à livrer des armes à des enfants-soldats. La France est une salope.",
				"added": 1502360456
			}
		],
		"1_1Fz1UWSCDr6RCVf7vR3BwoCg9vftURH97i": [
			{
				"comment_id": 4,
				"body": "C'est une mauvaise idée d'associer tor et torrents. Sinon hadopi ça existe encore ?",
				"added": 1503221522
			}
		],
		"1_1NbaJh8RrnVZU4VDBxoyUUkDcWHTM6SH7h": [
			{
				"comment_id": 5,
				"body": "Peut-être essayer de contacter les auteurs du site, pour qu'ils t'aident. Leurs objectifs affichés semblent compatibles avec ZeroNet. Reste à voir si c'est un discours de façade qui cache un business.",
				"added": 1508242293
			}
		],
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 6,
				"body": "et les chinois du FBI on en parle quand ?",
				"added": 1508242712
			}
		],
		"1_1KvhtxCVN75qypa87L4K99Um5Bmgrrvxm5": [
			{
				"comment_id": 7,
				"body": "Le \"darknet\" n'est pas plus infréquentable que le reste du web, qui lui-même n'est pas plus infréquentable que les rue de ta ville . Beaucoup de propagande pour contrôler nos vies.",
				"added": 1508243369
			}
		],
		"1_14vLvVLEdigErDmmewFFBkoHKWiiMQtsBi": [
			{
				"comment_id": 8,
				"body": "Quand tu vois \"hacher\" \"darknet\"  ou \"intelligence artificielle\" dans le titre d'un documentaire, ça sent bon le sensationnalisme inculte.",
				"added": 1508243593
			}
		]
	},
	"comment_vote": {}
}