{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 2,
			"category": "movies",
			"title": "Charlie Chaplin - The Greatest Speech Ever Made",
			"torrent_imdb": "https://dl.dropboxusercontent.com/s/hfr2xej5171a2el/charlie_logo.jpg",
			"body": "## _Webseeded by KopyKate - Quality 24/7 torrents!_\n &nbsp; \nI'm not the editor or original owner of this content. But this is an excellent compilation video containing Charlie Chaplin's amazing final speech from The Great Dictator, created by http://www.youtube.com/user/thelakeys...",
			"magnet": "https://dl.dropboxusercontent.com/s/pvi9i2b678j8nue/CHARLIE_CHAPLIN_GREATEST_SPEECH_%5BKOPYKATE%5D_480p.torrent",
			"torrent_file": "data/users/1DTUNWykvXLbxZud5a8gJsq7DxmxcGk52E/undefined",
			"added": 1475532866
		},
		{
			"topic_id": 4,
			"category": "movies",
			"title": "Paradise Island - Live",
			"torrent_imdb": "",
			"body": "Late 90s",
			"magnet": "magnet:?xt=urn:btih:ca5aa6797ec6f6a15c5c6922fb44e7209a442dd1&dn=Paradise+Island+-+Live.mp4&tr=udp%3A%2F%2Fexodus.desync.com%3A6969&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&tr=wss%3A%2F%2Ftracker.btorrent.xyz&tr=wss%3A%2F%2Ftracker.fastcast.nz&tr=wss%3A%2F%2Ftracker.openwebtorrent.com&tr=wss%3A%2F%2Ftracker.webtorrent.io",
			"torrent_file": "data/users/1DTUNWykvXLbxZud5a8gJsq7DxmxcGk52E/undefined",
			"added": 1478431913
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_12rMePjZCdJVqTaAYf3Dg3fk3bYFfTPDsP": [
			{
				"comment_id": 1,
				"body": "Not working for me. Which browser should I be using? I was wondering if someone would integrate WT with Zeronet. Can anyone confirm that WebRTC does not leak IP?",
				"added": 1475279840
			}
		],
		"9_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 2,
				"body": "Thanks for the info KopyKate. For what it's worth, WebTorrent posts this info on their FAQ:\n\n\"Does WebTorrent leak your IP address when using a VPN? I heard that WebRTC leaks your IP address.\n\nNo.\n\nWebRTC data channels do not allow a website to discover your public IP address when there is a VPN in use. The WebRTC discovery process will just find your VPN's IP address and the local network IP address.\n\nLocal IP addresses (e.g. 10.x.x.x or 192.168.x.x) can potentially be used to \"fingerprint\" your browser and identify across different sites that you visit, like a third-party tracking cookie. However, this is a separate issue than exposing your real public IP address, and it's worth noting that the browser already provides hundreds of vectors for fingerprinting you (e.g. your installed fonts, screen resolution, browser window size, OS version, language, etc.).\n\nIf you have a VPN enabled, then WebRTC data channels will not connect to peers using your true public IP address, nor will it be reveled to the JavaScript running on the webpage.\n\nAt one point in time, WebRTC did have an issue where it would allow a website to discover your true public IP address, but this was fixed a long time ago. This unfortunate misinformation keeps bouncing around the internet.\n\nThere's now a spec that defines exactly which IP addresses are exposed with WebRTC. If you're interested in further reading, you can read the IP handling spec for yourself.\"",
				"added": 1475339779
			},
			{
				"comment_id": 3,
				"body": "KopyKate,  I was able to view your webseeded videos, but I question why we have to host our files on a cloud service first. Doesn't that kind of reverse engineer the tech so that we are back to just streaming from one source? That also seems to lower personal security because a dropbox account can be flagged and banned. Please fill me in, if I'm wrong.",
				"added": 1475339899
			}
		],
		"2_1DTUNWykvXLbxZud5a8gJsq7DxmxcGk52E": [
			{
				"comment_id": 4,
				"body": "Kopykate,\n\n I uploaded this new one and it works. You can get rid of the other copy that did not work. It would be nice if you could provide an edit option for videos that we have personally uploaded. By the way, how hard is it to embed the ability to Chromecast these videos? If we had that, then I think there is great potential to build a ZeroNetflix that would have the same ease of use that we expect from traditional streaming content. Of course, it would also be nice if we could figure out how to integrate the features of Plex media center to pull cover art and metadata down as well. I'm not a coder or web developer, so I'm just hopeing someone can make it happen!",
				"added": 1475533204
			},
			{
				"comment_id": 7,
				"body": "> [thebitbrine](#comment_2_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa): It's already possible with WebTorrent to stream videos to AirPlay, Chromecast, XBMC, etc.\n\nI am able to do that with the Webtorrent Desktop application, but it would be really slick if we could do that from the browser based video that is playing back, like what Youtube does if you own a Chromecast.",
				"added": 1475974635
			},
			{
				"comment_id": 8,
				"body": "> [thebitbrine](#comment_2_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa): It's already possible with WebTorrent to stream videos to AirPlay, Chromecast, XBMC, etc.\n\nI am able to do that with the Webtorrent Desktop application, but it would be really slick if we could do that from the browser based video that is playing back, like what Youtube does if you own a Chromecast.",
				"added": 1475974717
			}
		],
		"11_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 5,
				"body": "Kopykate, \nHow do I become a seeder for this content? When I watch the video I become a peer, but I don't think I'm a permanent seeder. I also don't even know where this file goes. I assume it streams to my temp internet files. Maybe there is a way to make a Seeder option so that popular content stays online most of the time? I don't mind hosting some media to support the effort.",
				"added": 1475533532
			},
			{
				"comment_id": 6,
				"body": "Now I get it! Thank you for your patience.",
				"added": 1475545374
			}
		]
	},
	"comment_vote": {}
}
