{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 1,
				"body": "That is so fucked up any 25 yo that wants to fuck a 12 yo deserves to be shot and left to bleed out",
				"added": 1565915321
			},
			{
				"comment_id": 2,
				"body": "> [kaffie](#comment_1032_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Truly amazing that you didn't even read the post. The argument was for an age of consent at 18 and an age of marriage at 12. So they wouldn't be fucking a 12 year old. That said, I still don't really see the argument. People that young really don't have a full grasp on life, let alone enough information to determine a partner for the rest of their life.\n\nBruv why else would you want to marry a kid thats the loophole some pakies use to fuck kids marriage is a long ass commitment that a lil kid cant properly comprehend",
				"added": 1565915919
			},
			{
				"comment_id": 3,
				"body": "> [lampshade](#comment_18_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR): women should not vote or drive...or talk much\n\nTURKEY SANDWICH",
				"added": 1565941533
			}
		],
		"1565940672_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 4,
				"body": "hey peanutbutter is nice",
				"added": 1565941629
			}
		],
		"1566012765_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 5,
				"body": "> [dkeyzjkeys](#comment_12_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R): btw don't get at me on normalizing pedophilia, I'm trying to normalize animal culture and see the truth of it.  All mammals fuck within a year of ovulation.  So why don't we?  I'm presenting the argument, I personally love fucking grannies.  Jizzing in them is way better than condoms.\n\nMost animals are also retarded",
				"added": 1566013658
			}
		],
		"1566015881_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 6,
				"body": "> [dkeyzjkeys](#comment_19_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R): Guys if you wanna fuck 12 year old imo it's fine but we will pound you if you do it for real.  Look at all the pedo shit you want, not what we are going for.\n\nboi what fed wouldn't want to bust a pedo any sickfuck that wants to watch a lil kid getting fucked is watching a lil kid getting raped lil kids cant consent",
				"added": 1566042661
			}
		],
		"1566020351_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 7,
				"body": "lol stop trying to promote your crypto here zcash works just fine",
				"added": 1566043283
			},
			{
				"comment_id": 13,
				"body": "> [trotski](#comment_11_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV): Personally I prefer Monero, but there's no need for one ZN currency so long as people can engage in exchange\n\nShut up before i kill you with a ice pick",
				"added": 1566069422
			},
			{
				"comment_id": 14,
				"body": "> [trotski](#comment_13_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV): Love to see you try! Mexicans aren't allowed in my country\n\nif Stalin could get you killed with a ice pick across the world i can",
				"added": 1566070108
			}
		],
		"1566038009_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 8,
				"body": "yeah its called a street corner",
				"added": 1566044001
			}
		],
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 9,
				"body": "who cares the 500 euro note is leaving if you need high density money the 1k Swiss franc works wonders the more restrictive the eu gets the bigger the black market can become giving more money to non retards",
				"added": 1566044213
			},
			{
				"comment_id": 10,
				"body": "> [undisclosed](#comment_48_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): (((Who))) runs the conversion business between crypto and cash?\n\nyeah those dam nwo sea people r takin r jobz",
				"added": 1566044288
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 11,
				"body": "k bye",
				"added": 1566044635
			}
		],
		"1565985176_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 12,
				"body": "> [nowotny](#comment_18_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw): If the protesters in 1989 couldn't do shit, the ones in Honk Kong don't stand a fucking chance. 80% of them are probably zoomers who've never even touched a gun before, they're fucked.\n\nLets be honest tho there will proly be a bunch a guns that magically appears on the hk side that the cia totally didn't send",
				"added": 1566048070
			}
		]
	},
	"comment_vote": {
		"1_15KqJWMF66JypCYG6hy4MnMJTVcpS29igp": 1,
		"54_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"9_1FB7wEXbNVmiRnVw9JSCnibwrhYVK4uFaP": 1,
		"55_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}