{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "> [caropc1v4](#comment_3_1ME7Z5WLJyFnN6E32MqxEN8GLdezQYebjk): Fim dos Dias 1999 Dubhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1576246847_1D3gPBmPyX2SbVovCxevZ1sdbFHT6M9pH3\n\n#Fim dos Dias - Filme 1999\nJericho Cane (Arnold Schwarzenegger) é um amargurado guarda-costas que perdeu a mulher e a filha em um ataque terrorista. Nos últimos dias de 1999 um de seus clientes, um banqueiro (Gabriel Byrne), sofre uma emboscada. Na investigação que se segue, Cane descobre a macabra trama de uma seita que espera pela chegada de satã e escolheu Christine York (Robin Tunney) para gerar o filho das trevas. Ele agora deve fazer de tudo para protegê-la e evitar o fim dos tempos.\n- https://open.lbry.com/F1MD0SD14SDUB-(1):5",
				"added": 1576330616
			},
			{
				"comment_id": 2,
				"body": "#OS MESTRES DO DINHEIRO\n\nOs Mestres do Dinheiro, ou The Money Masters, é um documentário de 1996 que discute o conceito de dinheiro, dívidas e impostos, descrevendo o seu desenvolvimento, desde os tempos bíblicos até tempos recentes. De acordo com o filme, o sistema monetário moderno está não apenas diretamente ligado ao crescimento e fortalecimento de banqueiros internacionais, mas subordinado a eles.\n\nProduzido por Patrick Carmack e apresentado e dirigido por Bill Still, o documentário afirma que famílias globalistas como os Rothschild controlam a economia dos Estados Unidos, via oferta monetária. Eles utilizam seu poder de emitir dinheiro para benefício próprio, endividando países, gerando crises e financiando conflitos armados há séculos.\n\nO filme também critica o sistema bancário de reservas fracionárias e os aspectos da regulação bancária moderna e do sistema de banco central, como o FED (Federal Reserve System).\n\n- https://open.lbry.com/os-mestres-do-dinheiro:f",
				"added": 1576333657
			},
			{
				"comment_id": 3,
				"body": "#[FOUCAULT](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Michel_Foucault.html) X [CHOMSKY](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Noam_Chomsky.html): EXISTE ALGUMA COISA QUE SEJA INATA À NATUREZA HUMANA? | DEBATE EM VÍDEO\n\n- https://open.lbry.com/Debate--Noam-Chomsky---Michel-Foucault---sobre-a-natureza-humana:0",
				"added": 1576335176
			}
		]
	},
	"comment_vote": {}
}