{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1544138092,
			"title": "FrameworkJS has been launched!",
			"body": "# FrameworkJS has been launched!\n**On ZeroNet, no need to recreate the same things for every new project you begin. Framework.js already comes with the basic libs and features ZeroNet needs**.\n\nIt already includes the basic features expected from a web framework, plus more!\nIt includes, for reading: Headings, Paragraphs, Blockquotes, Badges, Images, Navbar, Logo\nFor forms: buttons, sticky buttons, inputs, text areas\nFor webpage/app: navbar/header, header menu, navmenu, scroller, footer\nOther elements: Tiled lists, longcard lists\nCSS classes: .full-size, .no-opacity, .color, .color-bg\n\n**For ZeroNet, FrameworkJS is the first usable framework, and the world's first click-to-clone web framework.\nOn FrameworkJS site, just click \"Create your own zite\", and it will redirect to your brand new project. You can also use FrameworkJS on your current project.\nZite owner can call JS to clone your own site or another site. Also, FrameworkJS is doing the begin of UltraApps with the detection of clearnet/zeronet, and supports ZeroNet dark theme. It also comes with the most useful ZeroNet libs**.\n\nFramework isn't better, because ZeroNet didn't implemented yet the new features I suggested for site clonning.\n\nFrameworkJS also includes Bootstrap and Material Design ready to use.\n\nUse it on your project, and copy/paste the JS/CSS (except the custom ones) when a new version of Framework is launched.\nhttp://127.0.0.1:43110/fmwk.bit/\nhttp://framework.js.org/\nhttps://github.com/Plasnerd/Framework.js/releases/tag/r1",
			"added": 1544138091
		}
	],
	"topic_vote": {
		"1519759218_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1544138092_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1544138092_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 1,
				"body": "> [leftside](#comment_5_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Plz show me a simple proof-of-concept example :)\n\nDid you mean, zites working with Framework?",
				"added": 1544229872
			},
			{
				"comment_id": 2,
				"body": "> [leftside](#comment_6_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): If possible, showing it with Zeronet will be great :)\n\nShowing it with ZeroNet? Framework is already working on ZeroNet. What did you mean?",
				"added": 1544286340
			},
			{
				"comment_id": 3,
				"body": "> [leftside](#comment_7_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I simply want to know what exactly Framework JS can do in practical way.\n\n* Simply click on \"Create your own zite\", and you will be redirected to your brand new project with instructions for how to modify it\n* Detect if its on ZeroNet or on Clearnet (the begin of UltraApps' hybrid app concept)\n* Automatic dark theme\n* API to clone own zite or other zites (like Git Center works with its repos - that API will be useful for blogs, forums, and other CMS on ZN)\n* Built-in Bootstrap, Material Design, Roboto/ZeroNet font, Material Icons\n* Basic things that are need from a web framework",
				"added": 1544369181
			}
		]
	},
	"comment_vote": {
		"10_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"5_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"6_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"7_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"3_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1
	}
}