{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1613421453,
			"title": "ZeroBazaar",
			"body": "ZeroNet seems like it could be used to create a very good successor to OpenBazaar.\n\nZeroBazaar would simply be a search engine or listing for various shops.\n\nShops would be ZeroNet sites --- with templates provided on ZeroBazaar.\n\nThis would overcome one of the main problems of OpenBazaar that one had to have a server running even for a small store --- by having stores as zites.\n\nThis would also allow merchants to accept payment in any kind of crypto they wished.\n\nWould want a way for customers to rate merchants on ZeroBazaar --- using some kind of proof of purchase for an item.\n\n\n\nCould this be done?",
			"added": 1613421452
		},
		{
			"topic_id": 1613590059,
			"title": "Deterrence Dispensed Saturn .22 Suppressor System",
			"body": "https://lbry.tv/@Deterrence-Dispensed:2/Saturn-Suppressor-System:b",
			"added": 1613590057
		},
		{
			"topic_id": 1613761105,
			"title": "What is the best modern money: gold or bitcoin/crypto?",
			"body": "https://cointelegraph.com/news/bitcoin-has-actually-only-taken-2-of-gold-market-cap-new-data-suggests",
			"added": 1613761102
		},
		{
			"topic_id": 1614627631,
			"title": "A template for a ZeroNet shop/market",
			"body": "http://zeronet.link/1MARKtLD2e69w7qiHLNQz3rPDmWLHbb2ZE\n\nMade by Ansho Rei",
			"added": 1614627627
		},
		{
			"topic_id": 1615373710,
			"title": "Would it be possible to use ZeroNet like Syncthing?",
			"body": "I assume one could make a private site, with a password, no?\n\nAnd encrypt the files on the site ...",
			"added": 1615373705
		},
		{
			"topic_id": 1615673955,
			"title": "Selfishness is not living as one wishes to live...",
			"body": "Selfishness is not living as one wishes to live, it is asking others to live as one wishes to live. And unselfishness is letting other people's lives alone, not interfering with them. Selfishness always aims at creating around it an absolute uniformity of type. Unselfishness recognizes infinite variety of type as a delightful thing, accepts it, acquiesces in it, enjoys it. It is not selfish to think for oneself. A man who does not think for himself does not think at all. It is grossly selfish to require of one's neighbor that he should think in the same way, and hold the same opinions. Why should he? If he can think, he will probably think differently. If he cannot think, it is monstrous to require thought of any kind from him. A red rose is not selfish because it wants to be a red rose. It would be horribly selfish if it wanted all the other flowers in the garden to be both red and roses.\n\nOscar Wilde, The Soul of Man and Prison Writings",
			"added": 1615673949
		},
		{
			"topic_id": 1620554494,
			"title": "Bitcoin Price Prediction",
			"body": "Simple fundamental price prediction of Bitcoin gives me something like $300,000 as the eventual price.\n\nSimple technical analysis gives an eventual price of between $500,000 and $5,000,000.\n\nWhat do you think the eventual price will be?",
			"added": 1620554487
		}
	],
	"topic_vote": {
		"1613421453_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"1613258600_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1613652791_1LqdvKDPZkkuq472J2ZdANDSd1JNK7CrHW": 1,
		"1613590059_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"1614109016_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1614247182_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2": 1,
		"1614282237_1PrKiM2DPUkTbSHX58i25rhuHGNZ1BX7PM": 1,
		"1614447739_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1614650318_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"1614774386_1DwZPxVycEyeuvYDJFjAZfF3A8SGtHiRBn": 1,
		"1614627631_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"1614861650_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"1614892007_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1615036976_14JFttTvjwR9PitBWPMU8FEqRCwACAeekM": 1,
		"1579271298_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": 1,
		"1614977977_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1615673955_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"1616203894_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1612011009_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1
	},
	"next_comment_id": 48,
	"comment": {
		"1608776045_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 1,
				"body": "I'd also like to know ... since voat.co is shutting down. This would be a great way to have something more difficult to close.\n\nMaybe we need to create another one ... Zoat?",
				"added": 1608814022
			}
		],
		"1608645993_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 2,
				"body": "I'd like to know where most of the voat user base has gone too. I had hoped they would at least partly migrate to a distributed network like this.",
				"added": 1609325891
			}
		],
		"1613421453_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 3,
				"body": "> [krzysztof113](#comment_33_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): Insufficient users to make sense.There's this: http://127.0.0.1:43110/1ADVERTvh1AC7XhDBBkaEhL5wGkMuS9fwt/\n\nOpenBazaar also had insufficient users ... every new platform has insufficient users to start with.",
				"added": 1613463740
			},
			{
				"comment_id": 4,
				"body": "> [krzysztof113](#comment_33_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): Insufficient users to make sense.There's this: http://127.0.0.1:43110/1ADVERTvh1AC7XhDBBkaEhL5wGkMuS9fwt/\n\nBut that's a great start! Now if there were a store zite template ... Thanks!",
				"added": 1613463958
			},
			{
				"comment_id": 5,
				"body": "> [markinformer](#comment_3_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4): It's a good idea, but it might not fit in with their project focus.\n\nWho's project focus? I'm not interested in convincing OpenBazaar to make it ... I just want to see it made.",
				"added": 1613549094
			}
		],
		"1613652791_1LqdvKDPZkkuq472J2ZdANDSd1JNK7CrHW": [
			{
				"comment_id": 6,
				"body": "We need to create a ZeroBazaar to be a distributed eBay (like OpenBazaar) where we can use Monero and other crypto better.",
				"added": 1613654515
			}
		],
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 7,
				"body": "> [zeroflag](#comment_12_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu): zeroflag\n\nClearly a mix of various assets is best: gold/silver, crypto, cash, stock/bonds, business, real estate, usable goods ... but I'm trying to point out the utility that crypto has over gold ... while also being resistant to central bank manipulation.",
				"added": 1613764476
			},
			{
				"comment_id": 8,
				"body": "> [aim64c](#comment_99_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): xealits\n\nThe privacy of Monero is a big advantage, and, as you alluded to with the \"dirty coins,\" also increases the fungibility of the coin.\n\nThe constant tail emission (becoming an ever-decreasing rate of monetary supply inflation) is not a big problem ... and maybe even a benefit to keep fees low.\n\nThe bankers will try to take over a coin or make their own ... in fact, they already have. BTC has been taken over almost entirely ... my opinion is that that's okay. Bitcoin may always remain, and I love seeing the numbers go up, but really it was just a first, minimal working prototype.\n\nClearly, there are pros and cons to both gold and crypto. Gold can be burned and still be fine. Gold doesn't require a modern internet infrastructure. But crypto wallets can be backed up ... you could drop one wallet in the sea and still have access to all your funds. Crypto wallet key phrases can be memorized or secured with strong cryptography ... making them very difficult to steal. Crypto can be used for unregulated transactions around the world --- great for international trade, grey market use, and remittances (assuming fees are low).",
				"added": 1613810605
			},
			{
				"comment_id": 10,
				"body": "> [baduser](#comment_24_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): I want to address this statement: [...]\n\nWow, I didn't even notice he had said that LOL",
				"added": 1614011204
			},
			{
				"comment_id": 11,
				"body": "> [baduser](#comment_25_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): Yeah, it's a quote from xealits. Also, regarding the distribution skepsis: I don't think it matters much nor that fair distribution can be achieved in principle. There will always be early adopters who believed in something new and 95% of the population would just shrug and move along. Later the early adopters are either rewarded (if the thing takes off) or punished (by losing their investments). No one knows it beforehand, it's a risk that you can take. The Bitcoin whitepaper and all its source code was public from the beginning (if you don't count those first blocks that Satoshi mined himself). [...]\n\nAmen",
				"added": 1614065877
			}
		],
		"1613799897_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 9,
				"body": "Can't seem to get it to load.",
				"added": 1613812721
			}
		],
		"1614197588_1AHGnE7rAzw84wX7v3oNeZvUuyB5cWLycU": [
			{
				"comment_id": 12,
				"body": "No peers ... try to keep it up, I'd like to see",
				"added": 1614201469
			}
		],
		"1614247182_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2": [
			{
				"comment_id": 13,
				"body": "Two things: First, that's a great idea.\n\nSecond ... I think we could use Carnival Classifieds as a template for \"ZeroBazaar\"\n\nHave a \"classifieds\" section, sure, but also have links to store zites --- and provide templates for them.",
				"added": 1614357460
			},
			{
				"comment_id": 30,
				"body": "> [bonfire5](#comment_2_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2): Let's get sellers hosting their own classified ads by cloning a zeronet zite that includes indexing scripts for region and category, then removed when no longer accessible or expired. [...]\n\nI see you also found the store zite template that I posted.\n\nI'd love to see a site like a central \"Craigslist\" ... which could then be cloned and linked to regional Craigslists.\n\nI'd love to see a virtual market/bazaar ... with just images and links to different store zites.\n\nI'd love to see some more (very simple) store zite templates.\n\nI'm not sure that something like a full eBay/Amazon would actually scale with the back-end requirements ... I just don't know how back-end databases are/can be connected to zites ... something I need to look into.",
				"added": 1614943404
			},
			{
				"comment_id": 32,
				"body": "Did you see this? [New Site Seed](/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/)\n\nOne can upload a new site and have seeders very soon.\n\nThis means one can publish a store zite and have it distributed very quickly instead of waiting for at least one visitor to seed.",
				"added": 1614943842
			}
		],
		"1614282237_1PrKiM2DPUkTbSHX58i25rhuHGNZ1BX7PM": [
			{
				"comment_id": 14,
				"body": "Thanks!",
				"added": 1614357635
			}
		],
		"1614447739_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 15,
				"body": "No idea. Why do you ask?",
				"added": 1614449275
			},
			{
				"comment_id": 16,
				"body": "> [kaaza](#comment_38_15cApprVFcr1skAkWssq5aAXKa7pDwJJve): Some months ago gitcenter was talking about it and I haven't been here since. thread here\n\nI see, I wasn't very active on ZeroNet at that time.\n\nA few questions: is nofish still actively developing the code? I realize there may be some problems he hasn't addressed, but it at least seems to work and is stable at the moment. Is he working on mobile or translations?\n\nWhat would gitcenter want to do differently? What are the major flaws and can/how can they be fixed?\n\nTalking about a community project is great, and at this point, ZeroNet may be big enough that one needs a larger team effort. But nofish has done an amazing job ... and frankly, projects like these need a single vision, someone in charge who wants to accomplish a specific thing, not hundreds of ideas from a hundred people.\n\nIf gitcenter can do that, hell, if anyone can do that and the main ZeroNet code isn't being improved, fork it.",
				"added": 1614496753
			}
		],
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 17,
				"body": "A good post, but I actually think ZeroNet was a step in the right direction --- a bit different from Freenet. In ZeroNet, you *do* have the choice of storing a site or not, with Freenet, you don't.\n\nThis means that a site published on Freenet is \"instantly\" distributed and available even if you turn off your computer, which is good, but it means that you may be hosting/seeding content you really don't like --- which is bad.\n\nThere is, I think, a middle ground, where people sign up to hubs, or make friends and those host all of their content when published ... meanwhile, one can decide whether to host random sites automatically, or choose ... exactly how to make this user-friendly would be a little complicated ... but it would be a bit like pinning. Or ZeroNet would inform the visitor that the zite has very few peers, etc.\n\nClearly, part of the draw of distributed networks is the robustness, both against accidental server failure and against intentional censorship. Of course, this robustness doesn't imply privacy ... which one would normally associate with the \"dark web\" ... but with the addition of Tor, a network which is robust, censorship resistant and also private ... yes, becomes ... well ... can be used for almost anything.\n\nBut, importantly, with ZeroNet, users *have a choice* about the content they host. Right now, that choice is \"host the site after visiting\" ... delete it later if you don't like it.\n\nBut there could be a few more settings put in place which would make it more palatable.\n\nNoob mode: Don't host sites.\n\nServer/search engine mode: crawl the web, host all the sites.\n\nFriend mode: host friend sites.\n\nPrivate mode: don't host sites that I visit during this session.\n\nEtc.\n\nZeroNet is a great protocol, surely it could be improved, but it's a great basic idea.\n\nZeroMe is a great application built on it ... and a distributed and uncensorable twitter/reddit/facebook is really needed.\n\nOther apps are also needed, like a distributed marketplace ... call it ZeroBazaar for now (http://127.0.0.1:43110/1ADVERTvh1AC7XhDBBkaEhL5wGkMuS9fwt/#!index is a good start)\n\nother apps ... p2p messaging, like ZeroMail, but more like Jami ... a standalone application that simply uses the protocol. Jami is great, but only works when both devices are on. A way to store sent messages with other peers for a while would be a great improvement.\n\nMaybe ZeroNet isn't the ultimate iteration, Freenet certainly wasn't, but it's a great step in both distribution, censorship resistance and user control.",
				"added": 1614532740
			}
		],
		"2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 18,
				"body": "Great work on the ZeroMarket! ... some kind of zBay, ZeroBazaar, etc. could really be great in expanding the popularity of ZeroNet ... besides the fact that OpenBazaar is not in development anymore.",
				"added": 1614627115
			}
		],
		"1614627631_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 19,
				"body": "> [styromaniac](#comment_2991_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You don't use zeronet.link here. Instead use Title [...]\n\nThanks for the tip! The link still works, right?",
				"added": 1614632399
			},
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_2992_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It works only for people using the default 127.0.0.1:43110/ [...]\n\nGood to know! \n\nTest: [Book List](/1BHJ9WaY7RazxfknWAMpqrqrQNUMLjhXUY/)",
				"added": 1614633640
			},
			{
				"comment_id": 21,
				"body": "> [styromaniac](#comment_2993_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're doing it wrong. You need square brackets for the title and parenthesis for the link.\n\nYeah, you saw the comment before I edited it.\n\nLike this: [Book List](/1BHJ9WaY7RazxfknWAMpqrqrQNUMLjhXUY/)\n\nI was testing if one could put just the raw address, but no.",
				"added": 1614633858
			},
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_2994_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's by Ansho Rei, not ihaphleas.\n\nThanks styromaniac, I didn't see that comment --- yeah, not made by me, just sharing.",
				"added": 1614672739
			}
		],
		"1614650318_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": [
			{
				"comment_id": 22,
				"body": "Try reloading the site. Sometimes ZeroNet does ask to increase the size while updating and on that particular page --- so you may just need to increase the space available.\n\nOr, it could be that no peer has those updates, but they should if they know about them.",
				"added": 1614672333
			}
		],
		"1614774386_1DwZPxVycEyeuvYDJFjAZfF3A8SGtHiRBn": [
			{
				"comment_id": 24,
				"body": "I'd like to know this too",
				"added": 1614774915
			},
			{
				"comment_id": 25,
				"body": "Actually I've found a way to confirm this.\n\nMake your own new site ... so it doesn't have any other peers seeding.\n\nNow open the site in ZeroNet and pull up the information about the site on the right hand side.\n\nNormally, you would see your own location on the map (since you're the only seeder).\n\nIf your VPN (or Tor) is working, you should see the site as being seeded from a location other than your own.",
				"added": 1614785523
			},
			{
				"comment_id": 26,
				"body": "> [sirlotaplot](#comment_45_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px): why not use Tor to hide your ip?\n\nTor may be slower, but you want a way to confirm the change of address anyway.",
				"added": 1614786289
			},
			{
				"comment_id": 27,
				"body": "> [mfs](#comment_117_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Try this: http://127.0.0.1:43110/0sh.bit/?myip [...]\n\nGive's me an invalid URL. Can you just post the raw address?",
				"added": 1614789657
			},
			{
				"comment_id": 28,
				"body": "Link shortener works now.\n\nDoesn't give an ip though.",
				"added": 1614789845
			},
			{
				"comment_id": 29,
				"body": "> [zonateam4622](#comment_76_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs): The best is to Use Whonix and in whonix install Zeronet ! all pass over tor and whonix is a Safest operating System ! i am a child lover and i use That Every Day ! if you find The zona on zerotalk you will find our Link on Zeronet and Guide to how to have a Hidden Whonix .. Even in case of arrest all is hide in a Hidden volume veracrypt No prove ! .. [...]\n\nYour advice may be valid, but please fuck off",
				"added": 1614883246
			}
		],
		"1614892007_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 31,
				"body": "This is great! Would be a great addition to a distributed marketplace.\n\nThis means one can publish a small store zite and not have to wait around until you get at least one visitor.",
				"added": 1614943705
			}
		],
		"1614952464_15PBP7E1m1G82N5r5AoXUFMinSuqD3KnBT": [
			{
				"comment_id": 33,
				"body": "I think it could definitely use improvement, but it's a step in the right direction from Freenet.",
				"added": 1614954810
			}
		],
		"1614977977_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 34,
				"body": "I wouldn't be interested in seeding the whole thing ... but if articles are broken up into separate zites, sure!",
				"added": 1614978126
			},
			{
				"comment_id": 35,
				"body": "> [styromaniac](#comment_3007_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): No. Do not make articles separate sites. They should all be one site, but each page (except home) as an optional file, if it had to be your way. [...]\n\nThat's fine ... as long as I can load only the optional files that I want.",
				"added": 1615056466
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 36,
				"body": "GTFO glowstick",
				"added": 1615153971
			}
		],
		"1615373710_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 37,
				"body": "I guess that's what ipfs is for though ...",
				"added": 1615373742
			}
		],
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 38,
				"body": "China is a tyranny ... the west is only slightly better.",
				"added": 1615480621
			}
		],
		"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2": [
			{
				"comment_id": 39,
				"body": "I use it almost daily ... posting new content. If there is content, people will come",
				"added": 1616276790
			},
			{
				"comment_id": 40,
				"body": "I use it almost every day. Just keep posting content here, to ZeroMe and to (GalactiChan)[/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/] ... if there is content, they will come.",
				"added": 1616486201
			},
			{
				"comment_id": 42,
				"body": "> [ihaphleas](#comment_40_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A): I use it almost every day. Just keep posting content here, to ZeroMe and to (GalactiChan)[/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/] ... if there is content, they will come.\n\n[GalactiChan](/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/)",
				"added": 1616486402
			}
		],
		"1616485572_1N4xxyVXrKEEU32y64hhtofe4EwM6ZqD32": [
			{
				"comment_id": 41,
				"body": "Classic metal (Black Sabbath), minimal/dark techno, Die Antwoord ...",
				"added": 1616486355
			}
		],
		"1616780153_1Cd53Uaxd6mfvvbrDDNFULPQAQ4BpYE56d": [
			{
				"comment_id": 43,
				"body": "Scam",
				"added": 1616856045
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 44,
				"body": "Voluntaryist",
				"added": 1617634549
			}
		],
		"1617668482_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX": [
			{
				"comment_id": 45,
				"body": "I'm trying it out ... seems a bit too slow for real IM ... but I like it.\n\nTrying out lokinet too ... maybe a better alternative to ZeroNet?",
				"added": 1617702306
			}
		],
		"1620567834_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 46,
				"body": "Been more or less a hodler for several years. Used it for a few transactions ... buying a book from a favorite author, for example.",
				"added": 1620588974
			}
		],
		"1625348483_1LKatdJrXVLYHewYYmPfDioZxM3kAsYLPp": [
			{
				"comment_id": 47,
				"body": "Still around ... check in looking for new content ... tried to create some",
				"added": 1625561268
			}
		]
	},
	"comment_vote": {
		"12_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": 1,
		"99_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"2_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": 1,
		"5_1LqdvKDPZkkuq472J2ZdANDSd1JNK7CrHW": 1,
		"24_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"25_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"2975_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2958_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2991_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2992_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2977_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"66_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"79_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"3014_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3015_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"12_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": 1,
		"44_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1
	}
}