{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1578145206_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"1577903734_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1582060549_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1579836220_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 1,
				"body": "you might mute us, but the information will still be here. get yourself a pair of horse blinkers for real life too so you can only see the tunnel ahead of you.\n\n\"just too many people who don't believe the official narrative here, let me not look into it or it might upset my worldview\"",
				"added": 1580096078
			},
			{
				"comment_id": 2,
				"body": "> [lightingball](#comment_11_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK): That's different. Racists and porn are damaging one's mental healthy. I would never install any horse blinkers on my horse because the blinkers does not block the threatens, however the mute function in zeronet is really blocking some good damage.\n\nI think you need those horse blinkers. The mental health you speak of is your subconscious trying to make you aware of your own cognitive dissonance you're wading through up to your neck.",
				"added": 1580455998
			}
		],
		"1582060549_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 3,
				"body": "> [jonathn](#comment_7_1MLqjfXio3ZiogLZaoDaqsFxLBbhinzvPN): Can i look at the content before i seed it ?\n\nyes of course. it works just like a torrent. videos that you open up start seeding automatically. if you go into the data folder for IFS you can delete them again. \n\nif you have the space and bandwidth please help distribute the entire cluster.",
				"added": 1582143925
			},
			{
				"comment_id": 4,
				"body": "> [bwcolor](#comment_5_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU): personally i think that is wrong and dangerous to seed an entire cluster without checking its content. maybe can be useful to create a zerotalk clone where we can publish our material posted on IFS? (by doing this anyone could search it by using zerohello, improving visibility). If you manage IFS another good option to add can be seeding an entire (trusted) channel\n\nyou can clone the IFS zite and make your own and upload all the content only want on your own cluster.",
				"added": 1582144091
			},
			{
				"comment_id": 5,
				"body": "> [xplosive](#comment_11_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): I have not seen this so far. I clicked on the link to check what kind of content is available on the platform at the moment, but the website does not even load. It says \"Loading...\", but nothing is happening. I waited for long minutes.\n\nworks fine on my end. check your connection.",
				"added": 1582625705
			},
			{
				"comment_id": 6,
				"body": "> [alfr](#comment_5_1LrW8M76omSeDjzbscCJUPndJuoYgQd626): works fine on my end. check your connection.\n\ntested on 3 other machines as well. check your browser and connection.",
				"added": 1582626087
			}
		]
	},
	"comment_vote": {
		"2_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"24_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"19_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1561_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"46_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"3_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": 1,
		"44_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"45_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"4_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": 1,
		"7_1MLqjfXio3ZiogLZaoDaqsFxLBbhinzvPN": 1,
		"3_1LrW8M76omSeDjzbscCJUPndJuoYgQd626": 1,
		"4_1LrW8M76omSeDjzbscCJUPndJuoYgQd626": 1,
		"5_1LrW8M76omSeDjzbscCJUPndJuoYgQd626": 1,
		"6_1LrW8M76omSeDjzbscCJUPndJuoYgQd626": 1
	}
}