{
	"next_topic_id": 22,
	"topics": [
		{
			"topic_id": 1,
			"title": "Hello ZeroTalk!",
			"body": "Post your test messages here!",
			"added": 1423439701
		},
		{
			"topic_id": 2,
			"title": "ZeroNet sites",
			"body": "Post your ZeroNet sites here\n\nPlease, also provide some short description.",
			"added": 1423442562
		},
		{
			"topic_id": 3,
			"title": "ZeroNet ideas",
			"body": "Features, sites and everything else",
			"added": 1423442649
		},
		{
			"topic_id": 4,
			"title": "How does it works?",
			"body": " - When you visit a site from version 0.2.0 ZeroNet generates you a BIP32 based, unique bitcoin address / private key combo\n - You requests an own data.json file from site owner that is allowed to be modified and signed by your address\n - If you want to comment, you modify your data.json, sign it using your private key and publish directly to other peers without contacting the site owner\n\nWhy is it better than ZeroBoard?  \n - When you create a new comment on ZeroBoard you have to contact the site's private key owner to put your comment to messages.json data file, sign it and publish to the peers\n - Using ZeroTalk you only have to contact once the site owner after that you can distribute your comments decentralized way, directly to other peers\n\nWhy is \"Request access\" necessary?  \n - To have some kind of control over the content and users.\n - Later the registration http request can be changed to other, more decentralized way. Eg.: the site users able invite new users or remove misbehaved users by using multisig voting",
			"added": 1423448182
		},
		{
			"topic_id": 5,
			"title": "New features: Comments num, Reply, Upvote, Topic groups",
			"body": "If you can't see the number of comments on ZeroTalk main page, then you have to update your ZeroNet.\n\nhttps://github.com/HelloZeroNet/ZeroNet",
			"added": 1423612675
		},
		{
			"topic_id": 7,
			"title": "Slow rendering in Chrome",
			"body": "For some reason the iframe rendering is slow in latest versions of Chrome, please post your results here.\nhttp://127.0.0.1:43110/1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr/test/render.html",
			"added": 1424875726
		},
		{
			"topic_id": 8,
			"title": "Articles about ZeroNet",
			"body": "News, Blog posts, other media mentions",
			"added": 1425816833,
			"type": "group"
		},
		{
			"topic_id": 9,
			"title": "Bluish Coder: Decentralized Websites with ZeroNet",
			"body": "Jan 15, 2015: ZeroNet is a new project that aims to deliver a decentralized web. It uses a combination of bittorrent, a custom file server and a web based user interface to do this and manages to provide a pretty useable experience.\n[...]\n\nhttp://bluishcoder.co.nz/2015/01/15/decentralized-websites-with-zeronet.html",
			"added": 1425816833,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 10,
			"title": "NewsBtc: ZeroNet Marries Bitcoin with Torrents to Build Web 3.0",
			"body": "Jan 18, 2015: Quietly, and to little fanfare this week, a new project emerged which may give us an early glimpse of what the internet of the future will look like.\n[...]\n\nhttp://www.newsbtc.com/2015/01/18/zeronet-marries-bitcoin-torrents-build-web-3-0/",
			"added": 1425816834,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 11,
			"title": "Cryptorials: How To Make Censorship Resistant P2P Websites Using ZeroNet",
			"body": "Feb 13, 2015: ZeroNet should look pretty similar to the regular internet while you are using it, but it works using torrent-like software combined with Bitcoin’s encryption. \n[...]\n\nhttp://cryptorials.io/make-censorship-resistant-p2p-websites-using-zeronet/",
			"added": 1425816835,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 12,
			"title": "The Hacker News: MegaNet — New Decentralized, Non-IP Based and Encrypted Network",
			"body": "Feb 18, 2015: At the beginning of new year, a new open source project known as ZeroNet launched that aims to deliver a decentralized web platform using Bitcoin cryptography and the BitTorrent network.\n[...]\n\nhttp://thehackernews.com/2015/02/meganet-decentralized-internet.html",
			"added": 1425816836,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 13,
			"title": "Transmission: How about a distributed YouTube?",
			"body": "Mar 5, 2015: One of the really fun things about ZeroNet is that taking the central server out of the equation, forces you to re-examine how multi-user websites work. Maybe that's just me, though.\n[...]\n\nhttp://127.0.0.1:43110/1GrFTzKpxcfJMqxtswRbvcETaj3wHQq1Gt/?Post:5:How+about+a+distributed+YouTube+",
			"added": 1425816837,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 14,
			"title": "New ZeroNet documentation",
			"body": "Please, tell me what you want to see in the docs.\nhttp://zeronet.readthedocs.org/",
			"added": 1426041131
		},
		{
			"topic_id": 15,
			"title": "Transmission: A JSON caching layer for quicker development and running of ZeroNet sites",
			"body": "Mar 11, 2015: But we could do it a quicker way, by doing all that in one go (and in smaller chunks on updates), we could reduce that to 1 lookup per post, by using a caching layer.\nhttp://127.0.0.1:43110/1GrFTzKpxcfJMqxtswRbvcETaj3wHQq1Gt/?Post:7:A+JSON+caching+layer+for+quicker+development+and+running+of+ZeroNet+sites",
			"added": 1426184423,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 16,
			"title": "Display all sites without searching",
			"body": "Something like new google chrome bookmarks or http://deweyapp.io/ would be nice.",
			"added": 1426796906,
			"parent_topic_hash": "2@6"
		},
		{
			"topic_id": 17,
			"title": "ZeroNet: Open Source Alternative of Project Maelstrom",
			"body": "Few days back we discussed about BitTorrent’s new Project Maelstrom which has potential to change the way we interact with Internet. When BitTorrent first announced Project Maelstrom, some where back in December 2014, bunch of open source developer started a project called ZeroNet – an open alternative of Project Maelstrom. It is now available on all platforms whereas Project Maelstrom is available on only windows.\nhttp://fossbytes.com/zeronet-open-source-alternative-of-project-maelstrom/",
			"added": 1429357559,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 18,
			"title": "Presentation about how ZeroNet works",
			"body": "Cryptography of ZeroNet, Site visiting, Site updating, Multi-user sites, Current status, Future plans.\nhttps://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000",
			"added": 1429993652
		},
		{
			"topic_id": 19,
			"title": "NODE: The ZeroNet Interview: Rethinking The Internet",
			"body": "I recently spoke to Tamas, the creator of ZeroNet, an interesting project which aims to change the way our internet is constructed and accessed. This is definitely one to keep an eye on.\nhttp://n-o-d-e.net/post/118311659326/the-zeronet-interview-rethinking-the-internet",
			"added": 1430957680,
			"parent_topic_hash": "8@2"
		},
		{
			"topic_id": 20,
			"title": "ZeroNet specific benchmark results",
			"body": "Post your built-in benchmark results here.\nhttp://127.0.0.1:43110/Benchmark",
			"added": 1432633401
		},
		{
			"topic_id": 21,
			"title": "New version of ZeroTalk forum",
			"body": "Supports ZeroID and Cloning (will be enabled after some more testing)\nhttp://127.0.0.1:43110/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT",
			"added": 1436299397
		}
	],
	"next_message_id": 163,
	"comments": {
		"1@2": [
			{
				"comment_id": 1,
				"body": "Markdown test:\n - 1\n - 2\n - 3",
				"added": 1423439749
			},
			{
				"comment_id": 2,
				"body": "UTF8 teszt: Árvíztűrőtükörfúrógép",
				"added": 1423441224
			},
			{
				"comment_id": 3,
				"body": "# H1 test",
				"added": 1423443605
			},
			{
				"comment_id": 4,
				"body": "Thanks, still missing important features, but i will keep working on it :)",
				"added": 1423445567
			},
			{
				"comment_id": 5,
				"body": "test123",
				"added": 1423501207
			},
			{
				"comment_id": 7,
				"body": "Topic's last comment date / total comment number is now displayed if you pull the latest version from GitHub.",
				"added": 1423532456
			},
			{
				"comment_id": 10,
				"body": "Editing test... _edit: Edited2_",
				"added": 1423700170
			},
			{
				"comment_id": 20,
				"body": "test 12345",
				"added": 1424732648
			},
			{
				"comment_id": 21,
				"body": "btag: Yes, working now. Thanks for contribution, i'm going to check the modifications, but i have some questions, do you have irc/skype/tox/etc, account?",
				"added": 1424829199
			}
		],
		"4@2": [
			{
				"comment_id": 6,
				"body": "its just to prevent abuse, its defined per user in `data\\1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\\data\\users\\content.json`, so its easy to rise if the site owner see you are not a bad person ",
				"added": 1423501330
			},
			{
				"comment_id": 8,
				"body": "Modify / delete comment is not added to web ui yet, but if you interested how ZeroNet works:\n\n - Find your auth_address and auth_privatekey in data/users.json after line `\"1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\": {`\n - Modify/delete comment in data/1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ/data/users/[your auth_address]/data.json\n - Execute `zeronet.py siteSign 1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ --inner_path data/users/[your auth_address]/content.json`\n - Enter your auth_privatekey\n - Execute `zeronet.py sitePublish 1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ --inner_path data/users/[your auth_address]/content.json`\n - Congratulations you did it! :)",
				"added": 1423533234
			},
			{
				"comment_id": 66,
				"body": "> [Winter_Fox](#comment_8_82): How do the messages get added to the site without being signed by the owners key?\n\nEvery user has a separate file that can be signed by his/her private key. It's like many smaller site within a site.\n(eg. your file: `data/1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ/data/users/14nYoENfoNcxtdXAKeAH4tgdicvZUeGdyk/content.json`)",
				"added": 1428799900
			}
		],
		"1@13": [
			{
				"comment_id": 9,
				"body": "Some ideas:\n- Decentralized marketplace\n- Decentralized, encrypted email-like messaging between users\n- ZeroNet site directory where anyone can put his/her site and allow users to comment the other sites",
				"added": 1423595985
			},
			{
				"comment_id": 54,
				"body": "> [und3rd0g](#comment_1_70): i think zerotalk could become a stable social networking and messaging platform , if nofish will continue developing it . adding messaging and some kind of profile for users to be able to establish will be quite sufficient .\n\nStill thinking about it, I think many, smaller email provider-like sites (but fully transparent and end-to-end encrypted) would be the best working solution with zeronet. \nMessaging sites could deliver messages between each other. So if you have an account at MyZeromail.bit you could send an encrypted message to bob@OtherZeromail.bit.\n\nIn result you don't have to store everyone's message but only who is using the same provider as you and its allows less-centralized site development.",
				"added": 1428266408
			},
			{
				"comment_id": 55,
				"body": "> [und3rd0g](#comment_2_70): I do not get how U quote me nofish :( I'm too lazy to go checking trough the code :D\n\nYou have to click on the date of the comment. (yeah, its hard to find, going to put a reply button soon :) )\n",
				"added": 1428423484
			},
			{
				"comment_id": 58,
				"body": "> [Raystonn](#comment_1_76): Git for ZeroNet would be a great start.\n\nZeroNet is not limited to web. You can distribute any kind of files: binary, source code or even a git repository. Its also possible to use as decentralized, p2p auto-update platform.\n\nI'm planning to create a site for ZeroNet source code as example and I found some git client written in javascript, so i think its also possible to create a simple site to browse the source code modifications.\n\n> [Raystonn](#comment_2_76): After that, please go for end-to-end encryption.\n\nYes, its planned, one of python library we use is [broke the SSL support](https://github.com/gevent/gevent/issues/477), waiting for new release that fixes the problems. After that it should not be hard.",
				"added": 1428618086
			}
		],
		"5@2": [
			{
				"comment_id": 11,
				"body": "Now you can edit and delete your previous Topics and Comments!",
				"added": 1423700434
			},
			{
				"comment_id": 12,
				"body": "Elmit: The edit function not working or the comments number displaying?\nIt should look like this:\n![comments](http://i.imgur.com/eZCMRMw.png)",
				"added": 1423738007
			},
			{
				"comment_id": 13,
				"body": "Please try using the new 0.2.1 version.\n\nChanges: http://www.reddit.com/r/zeronet/comments/2sgjsp/changelog/",
				"added": 1423953792
			},
			{
				"comment_id": 17,
				"body": "Topics now also ordered by creation time.",
				"added": 1424368629
			},
			{
				"comment_id": 29,
				"body": "> [nofish](#comment_17_2): Topics now also ordered by creation time.\n\nAdded simple reply function (by clicking on comment creation time)",
				"added": 1425250979
			},
			{
				"comment_id": 34,
				"body": "Added upvote for topics and sub-topic groups.",
				"added": 1425819158
			},
			{
				"comment_id": 35,
				"body": "Upvote feature also added to comments",
				"added": 1425857736
			},
			{
				"comment_id": 36,
				"body": "> [Oxilic](#comment_11_6):\n> Is it currently possible for me to moderate my own sub-topic to do things like removing off-topic posts? \n\nIts not possible, you cant edit other user's data file.\n\n> Edit:  I created one editing my data file and then publishing it manually.  Is there an easier way to do that?\n\nNo, atm you have to edit the data file manually",
				"added": 1425898296
			},
			{
				"comment_id": 41,
				"body": "> [juicicoo](#comment_9_20): Could there be an option chose sorting? By either creation date, last post, number of comments? And possibly a pinging feature so someone knows when they are responded to.\n\nTopic ordering will be easy using the new SQL Layer that comes with 0.2.6 (released in days).\n\nI have been thinking about \"notification\" feature, but its not easy, maybe it would work this way: \n- An user could sign up to a result of sql query. And if the query is matched in any new content (comment replied, got new message, etc.) then he got a notification of it or its got listed on ZeroHello.\n- This allows some kind of notification center like feature, but need more thinking, more ideas/solutions are gladly welcome. :)",
				"added": 1426695813
			}
		],
		"3@2": [
			{
				"comment_id": 15,
				"body": "**juicicoo**: New, better network code with tor support and passive publishing is coming in next months\n\n**Diver**: [Step-by-step tutorial to have yourself a ZeroBlog](/1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8/?Post:3:How+to+have+a+blog+like+this) and [ZeroNet developer's documentation](https://github.com/HelloZeroNet/ZeroNet/wiki/ZeroNet-developer's-documentation) (i'm going to add the new ZeroFrame API commands to the docs later today)",
				"added": 1424193952
			},
			{
				"comment_id": 16,
				"body": "I'm [planning](https://github.com/HelloZeroNet/ZeroNet/issues/31) to add Namecoin support, but could not find any reliable way to resolve Namecoin domains and [light clients in not ready yet](http://www.reddit.com/r/Namecoin/comments/2vjwds/whats_the_best_way_to_get_namecoin_domain_info/).",
				"added": 1424286073
			},
			{
				"comment_id": 25,
				"body": "> [matt](#comment_5_10): What about using https for protecting p2p channels? I saw that you're working on replacing 0mq now, so this would definitely have to wait until after that, but there's a few schemes that could be used here to pass p2p traffic over https.\n\nYes, its planned, unfortunately [gevent's ssl is broken yet](https://github.com/gevent/gevent/issues/477), will look at it later.",
				"added": 1424984905
			},
			{
				"comment_id": 26,
				"body": "> [underd0g](#comment_3_17): I think the frontpage tiles are a bit too big :D\n\nYes, its does not works well with many sites, planned features: Bookmarking, Display the current/allowed size, Highlight sites changed since your last visit.\n\nIt would be nice if anyone know good examples of displaying similar type of data. (maybe switch to listing view?)",
				"added": 1424985697
			},
			{
				"comment_id": 27,
				"body": "> [juicicoo](#comment_4_20): Thanks nofish! \n> Are user ids on zerotalk permanent (multiple users with same I'd possible?)? Is a reset available? Does my IP link to the user name? A possible privacy/anon concern? If it is linked to my IP, could it be transferred over to be used from another IP?\n\nEvery user identified by a bitcoin address (yours 1MnMf7DxYcvG4xVdqba6PrCY9D3jLJeLcn), to transfer to an another machine you have to copy your data/users.json file and you are done.\n\n> [juicicoo](#comment_5_20): Another thing, would a file upload site be viable? Perhaps as a distributed Dropbox/cloud (private or public) solution or something?\n\nFile upload is possible, planning to add avatar feature to ZeroTalk\n\n> [juicicoo](#comment_6_20): Is there something that can be done to improve the proxy usage? ie clicking on a localhost link while using the zeroproxy leads to the localhost link, instead of being proxied.\n\nIt's not easy problem, it could be fixed some ways:\n - Using javascript replace every http://127.0.0.1:43110 to current access url\n - In theory it would be possible to create zero:// [custom protocol handler](https://developer.mozilla.org/en-US/docs/Web-based_protocol_handlers), so we can access sites by zero://1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ/?Topic:3@2/ZeroNet+ideas#Reply, but it didnt worked for me in chrome.\n - Create browser extension that automatically fixes the urls and probably allows you to access sites by zero:// prefix\n - Add a custom entry to OS's hosts file: zeronet that always points to your proxy server\n",
				"added": 1424986391
			},
			{
				"comment_id": 28,
				"body": "> [TheSeven](#comment_2_51): Why do ZeroNet sites link to http://127.0.0.1:43110/... in the first place instead of using relative links?\n> A link to e.g. /1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ should work equally well inside ZeroNet and would also work with proxies.\n\nIt's fixed in ZeroTalk now: every link starting with http://127.0.0.1:43110/ automatically converted to relative link.\n\n\n> [underd0g](#comment_4_17): is there going to be private messaging here on the board ?\n\nI think there will be a separate site for end-to-end encrypted, private messaging.",
				"added": 1425250794
			},
			{
				"comment_id": 30,
				"body": "> [underd0g](#comment_3_17): I think the frontpage tiles are a bit too big :D\n\nJust updated ZeroHello: now the tiles are smaller if you have more than 6 sites added and they have white border if updated in last 24h.",
				"added": 1425344586
			},
			{
				"comment_id": 32,
				"body": "> [Oxilic](#comment_2_6): Add an upvote downvote and report button to zerotalk.\n\nUpvote feature added to topics. If its works then I will also add it to comments. Also planning to add Topic categories so we can separate ideas, sites, links etc.",
				"added": 1425602814
			},
			{
				"comment_id": 68,
				"body": "> [und3rd0g](#comment_6_70): nofish , have you considered making a web-frontend for configuring the proxy ? \n\nIn my initial vision the pressing circle on the top-right corner would bring up a sidebar and you could set  site-specific settings there (copy/create identity, size limit, bw used, connected peers, etc.)\nWell...later :)",
				"added": 1428959845
			},
			{
				"comment_id": 93,
				"body": "> [hailtotheking](#comment_9_131): \n> Is it possible to use .bit domains Hybrid Style ? That means: if IP available go to Internet if somehow marked with \"Zeronet\" in the JSON use it for Zeronet as well.\n\nI think its possible, but need testing and benchmarking the performance drawbacks of it. ",
				"added": 1429665409
			},
			{
				"comment_id": 110,
				"body": "> [Monster](#comment_5_145): Supporting BitID authentication protocol https://github.com/bitid/bitid\n\nThe current authentication is similar to BitID customized for ZeroNet.",
				"added": 1430760307
			},
			{
				"comment_id": 111,
				"body": "> [p2p](#comment_52_62): what about a decentralized G+ or facebook in ZeroNet?\n\nIn ZeroNet every user holds every data, so its not ideal for big sites (yet).\n\n> [p2p](#comment_51_62): I've described a PoS decentralized user registration \n\nIts really hard to fight spam in a fully decentralized registration. Using your PoS with 100 nodes with 24h IP ban a bot could create 100 fake account per day using one IP. And if we limit user account creation to IP then probably it makes impossible to register an account using Tor.\n\nUsing authentication sites there is many possible solutions to control registrations (Proof of burn, Proof of bitcoin stake, Invite only, Namecoin IDs, Bitmessage, Email verification, Social media login, Captcha etc.) and i don't see too much drawbacks of it.",
				"added": 1430787329
			},
			{
				"comment_id": 115,
				"body": "> [underd0g](#comment_6_17): when are we gonna have avatars here on forum ?\n\nAfter the upcoming core modifications, ZeroTalk will require some changes to support trusted authorization providers. I will also try to include the avatar support with it.",
				"added": 1432066810
			},
			{
				"comment_id": 131,
				"body": "> [oracle](#comment_9_212): People want their IP's hidden so they use Tor or I2P to help with that, but is there a way to build something into zeronet itself to hide IP's without having to use another program like Tor or I2P\n\nIt can be possible, but it would not be as secure as other networks. You need 1000s of computers on fast line to have a fast and secure anonymity network. So its much better option to use already existing ones than reinventing the wheel.",
				"added": 1434733252
			},
			{
				"comment_id": 132,
				"body": "> [ezekiel](#comment_1_219): Save last position on previous page. I notice that sometimes pages are back at the top when you go back on a page... I don't know if this is a ZeroNet quirk, or a ZeroTalk quirk.\n\nI also find it disturbing, but not found any good solution for this problem:\nSome months ago the Chrome stopped restoring the scroll position of iframes on back button. It's still works on firefox, but not on chrome.\n\nProbably as workaround it would be possible to store the current scroll position as cookie and restore when you next navigate to page.",
				"added": 1434827238
			},
			{
				"comment_id": 138,
				"body": "> [idealcoder](#comment_10_210): Oracle - I am pretty sure the ZeroNet blog, uses markdown, so you can add an image using that. \n> ![alt text](https://github.com/adam-p/markdown-here/raw/master/src/common/images/icon48.png)\n> You could store the image in your site folder and then link to it.\n\nYes, it works, but its recommended to put every content within the site's `data` dir, to keep your images after re-cloning (updating) from the parent ZeroBlog site.\nIt's also planned to add file upload feature to webui until then you can use the `![myimg](data/img/anything.jpg)` format.",
				"added": 1435078472
			},
			{
				"comment_id": 157,
				"body": "> [oracle](#comment_24_212): Mediagoblin can be used for audio, images and video.\n\nMediagoblin is not P2P, its just a server for your content. Currently you can use (and embed) large files using [webtorrent](https://github.com/feross/webtorrent).",
				"added": 1436866470
			},
			{
				"comment_id": 159,
				"body": "> [oracle](#comment_25_212):  If people have to keep downloading stuff like webtorrent to add stuff to zeronet they will not use it. \n\nThey don't have to download anything, webtorrent is written in pure javascript, you can embed it to your webpage.\n\n> [oracle](#comment_25_212):  You need something like a media uploader built into zeronet like wordpress has.\n\nYou have to understand ZeroNet is not a webpage or a complete application, but its an framework, so asking file uploader built in zeronet is like asking solitaire built in Firefox. \nZeroBlog, ZeroTalk or ZeroHello just sample sites. File uploading is a javascript feature, so if you want to create an application that features web uploader.\n\nBut i'm understand your concerns: ZeroNet is still in early stages, it needs better applications and it not ready for mass adoption of non-technical people.",
				"added": 1436907045
			}
		],
		"2@31": [
			{
				"comment_id": 18,
				"body": "It's an unfinished content update: \n\nThe user 1NAKbzLfAGMAPKUYGuQnxrEKJeu4MCVyyQ published a new `content.json` file (its holds user file's sha512 hashes), but the new, updated file (`data.json`) that holds the user's comments is never reached the network for some reason.\n\nAlready working on new network code that minimizes this kind of problems and already made new modifications that handles better missing files by limiting maximum retry to 2 times in every 20 minutes per file. It will be out on next week.",
				"added": 1424621762
			}
		],
		"1@31": [
			{
				"comment_id": 19,
				"body": "Its working for me and cant find any error message in log.\n\nIf you can reproduce it, please paste your javascript console log (`F12`)",
				"added": 1424640500
			}
		],
		"1@7": [
			{
				"comment_id": 22,
				"body": "ZeroNet does not do any keep-alive checking yet, so the number is not accurate.",
				"added": 1424862711
			}
		],
		"7@2": [
			{
				"comment_id": 23,
				"body": "- Win8.1 Chrome 40.0.2214.115 m: 30fps\n- FF 35, IE11: 60fps\n\nWithout iframe (127.0.0.1:43110/media/1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr/test/render.html): 60fps everywhere\n",
				"added": 1424876093
			},
			{
				"comment_id": 74,
				"body": "> [link](#comment_1_102): 25-45 FPS on Chrome Version 42.0.2311.90 dev-m\n\nCan you also check it without the frame please?\n127.0.0.1:43110/media/1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr/test/render.html",
				"added": 1429222553
			},
			{
				"comment_id": 145,
				"body": "Added a workaround for slow rendering in Chrome (`backface-visibility: hidden` to body), please let me know if you experience any problem could be related with it. (updated ZeroHello, ZeroBlog, ZeroTalk)\n\nAlso updated the scrolling test with backface-visibility toggle. For me its massive speedup: 12fps -> 60fps when running on fullscreen.",
				"added": 1435926432
			},
			{
				"comment_id": 146,
				"body": "> [FrenchGeek2](#comment_2_184): Oscillating between 21 and 60 fps on Ubuntu. ( so without any useful hardware acceleration )\n\nIn every 4 second its periodically changes between the old `backface-visibility: initial` and the new `backface-visibility: hidden`, which one is gives you more fps? (the current mode is displayed on the bottom of the page) Thanks!",
				"added": 1436002266
			}
		],
		"1@45": [],
		"1@50": [
			{
				"comment_id": 31,
				"body": "In theory there is no way to find your site if you don't publish the address. If you want to keep your site in front of public eyes i think at the moment there is no way to \"ban\" the searchbot.",
				"added": 1425383299
			}
		],
		"1@18": [
			{
				"comment_id": 33,
				"body": "It's required mostly for security reasons: \n - All site using the same domain (127.0.0.1) without the frame there is no way to restrict cross-site the data access (cookie, local storage, cors).\n - This way wrapper javascript is isolated from page variable environment and every Websocket request is filtered by Wrapper its also possible to allow special commands (eg. setting page's storage limit) to be executed by only by the wrapper frame. If the page would be allowed to connect directly to server it would not be possible.\n\nCurrently its possible to access html files without the frame, but probably it will be disabled in the future.\n\nPer-page local storage is accessible using the WrapperApi ([example](https://github.com/HelloZeroNet/ZeroTalk/blob/master/js/TopicShow.coffee#L41)), if you need other javascript feature that is limited by the iframe sandbox let me know and it will be added in the future version. :)\n(The [WrapperApi document](https://github.com/HelloZeroNet/ZeroNet/wiki/ZeroFrame-API-reference-documentation) is a little outdated at github, but i promise i will update it soon)",
				"added": 1425747798
			}
		],
		"13@2": [
			{
				"comment_id": 37,
				"body": "> [NoktaStrigo](#comment_5_31): Isn't it planned to allow users store sites only partially?\n\nYes, its planned feature, but first we need big file support. It needs lots of work (file splitting, pre-file allocation, piece choking, peertable etc.) and maybe its smarter to use a more mature and optimized torrent client for big files.\n\nZeroNet is made for websites, so bigfile features is not priority yet. You can store around 100.000 message in 100MB, so if you don't want to use it for video/audio/etc. the optional files is far from necessary yet. ",
				"added": 1425921457
			}
		],
		"15@2": [
			{
				"comment_id": 38,
				"body": "I'm currently working on this, you can follow the development progress [on reddit](http://www.reddit.com/r/zeronet/comments/2yq7e8/a_json_caching_layer_for_quicker_development_and/)",
				"added": 1426339042
			}
		],
		"2@20": [
			{
				"comment_id": 39,
				"body": "ZeroNet is an alternative, p2p website distribution platform and its not focused on anonymity features yet. It does not try to compete with 10+years old projects (ZeroNet is only 2 months old), but in the next months Tor (and maybe i2p) support will be added, so you can easily hide your IP if you want.\n\nIf you want full anonymity you can use [freenet](https://freenetproject.org/) or [i2p](https://geti2p.net/en/).\n\nPlease share us if you have any other suggestions to be able to use for \"DARKNET STUFF\".\n\nThanks!",
				"added": 1426421954
			},
			{
				"comment_id": 40,
				"body": "Sorry, there is no logout feature yet using the webui. The only way to forgot the user is deleting `data/users.json` file. \n\nI have some ideas to make ZeroNet proxy-friendly, on the next week i will explain my thoughts.",
				"added": 1426458848
			},
			{
				"comment_id": 53,
				"body": "> [hamster](#comment_2_71): If you want use this like a darknet, an anonymous routing is required.\n\nCurrently experimenting with it probably Tor or I2P support going to be the next major feature :)",
				"added": 1428265594
			},
			{
				"comment_id": 56,
				"body": "> [und3rd0g](#comment_4_70): nofish dont go the tor way please . tor is backdoored .\n\nCurrently experimenting them, i want to implement both, not sure yet which comes first, but I cannot see any easy solution yet, so help/ideas/suggestions greatly welcomed.",
				"added": 1428439484
			},
			{
				"comment_id": 57,
				"body": "> [p2p](#comment_10_62): see:twister-core 0.9.22: Tor support available http://twister.net.co/?p=366DHT traffic may be TCP-tunneled http://twister.net.co/?p=363\n\nI'm not sure if its a good idea to tunnel tor traffic to clearnet. We not tied to libtorrent or mainline (torrent) DHT, so i think we can modify the protocol (or use a different one) to allow to store .onion/.i2p addresses and make it work between Tor/i2p clients.",
				"added": 1428596690
			},
			{
				"comment_id": 61,
				"body": "> [p2p](#comment_11_62): when many people say Tor support, I think they mean supporting to use Tor as a SOCKS5 proxy. So I don't understand when you talked about .onion addresses.\n\nIn Tor network you can reach an another computer using his .onion address. Its the \"IP address\" of Tor network. \n\nIf you want to talk with an another peer without tunneling it to clearnet you must know his .onion address. So if we want a proper solution we need a something that able to store not only clearnet ip addresses, but also .onion (and .i2p) address and accessible using TCP.",
				"added": 1428658727
			},
			{
				"comment_id": 62,
				"body": "> [p2p](#comment_12_62): I got what you meant. But I don't think .onion address is  the \"IP address\" of Tor network. I think if a Tor node doesn't run hidden service, it has no .onion address.\n\nYes, you need to run hidden service to have .onion address. If we don't support .onion addresses then it's not possible to start a new site on Tor network, you going to need peers on clearnet who is stores your site, so its not secure anymore.\n\nStarting a hidden service is pretty easy (2 line in config file), to make it even easier i'm going to pack a Tor client with preconfigured hidden service, so you don't have to edit any file just start using `zeronet.py --tor` and its automatically start the tor node with the proper settings. (and shuts down when you closes zeronet)",
				"added": 1428688471
			},
			{
				"comment_id": 70,
				"body": "> [p2p](#comment_16_62): TorUser: p2p: In Twister we can use Tor as SOCKS proxy to read & post, can send private messages to clearnet nodes.  \n> You can also read and post using zeronet & tor, but creating new sites is not possible.\n\nThe problem is every zeronet site is independent, if there is no clearnet node using the site then noone can help you.\n",
				"added": 1429004093
			},
			{
				"comment_id": 72,
				"body": "> [p2p](#comment_21_62): If someone starts a new site using Tor and promotes the site somewhere, is it possible for clearnet users (who want to help) to download the site and transfer the site's data to other clearnet users when the owner (Tor node) is offline? If it is not possible yet, please make it possible.\n\nIts already possible by running a zeroproxy (zeronet on a public ip)\n\nTo do that you have to start zeronet using `--ui_ip \"*\"` (and enabling multiuser plugin is recommended). After that anyone can access your zeronet interface on your public ip address. This allows anyone to \"kickstart\" his/her website by addig the site to your client.",
				"added": 1429177781
			},
			{
				"comment_id": 73,
				"body": "> [p2p](#comment_22_62): Hmm，running a zeroproxy may be a workaround.But when I run python ./zeronet.py    --proxy 127.0.0.1:9050 --disable_udp sitePublish XXXXXXXXXXXXXXXXXXXXXXXit says:\"Port not opened, passive publishing not support yet\"It is strage. \n\nYeah, that limitation no longer required, removed it. (you can update your zeronet by executing update.py or re-download from github)",
				"added": 1429201084
			}
		],
		"3@20": [
			{
				"comment_id": 42,
				"body": "If you don't want to use javascript you don't have to: static html sites are also supported. There is some example out there: http://127.0.0.1:43110/media/1BLuish1ZbwVfPaCSDVQkg5WW58hqEoYQw/index.html (you can safely browse this site even in command-line lynx browser)\n\nIts also not limited to web content, you can use it to distribute binary data or your own thin-client.",
				"added": 1426851319
			},
			{
				"comment_id": 43,
				"body": "Thanks for suggestion I will look at Tox's peer finding method.",
				"added": 1426852788
			},
			{
				"comment_id": 69,
				"body": "> [unknown](#comment_1_90): nofish when I clicked on your link, I got \"Media referer error\"Exactly how it was spelled too.\n\nYes, cross-site linking disabled for security reasons, you have to open it by manually copy/paste the link to your browser. (its a pretty big site, so probably you have to open it first normally to give permission to store 100MB of data) \nBypassing the javascript api is not an official feature yet maybe it will be in the future if there is need for it.\n\nThanks, the typo is fixed in the latest commit.",
				"added": 1428972260
			}
		],
		"16@2": [
			{
				"comment_id": 44,
				"body": "> [NoktaStrigo](#comment_6_31): Feature of downloading sites only partially is planned, but not implemented yet, as far as I know.\n\nIt's already possible to download only some files from site, but its not efficient. To make it officially supported we need a feature that allows find peers to specified files.\n\n> [Oxilic](#comment_12_6): The problem with that is that storing the images for each site gets big quickly, and 30,000 sites would be at around 1GB.\n\nWe very far from 30.000 sites :) Storing screenshot only for top 1000 site could be a solution if its become problem (10-20MB storage)\n",
				"added": 1426941848
			}
		],
		"1@59": [
			{
				"comment_id": 45,
				"body": "Hello, welcome to ZeroNet! :)\n\nHow did you find it?",
				"added": 1427217168
			}
		],
		"1@60": [
			{
				"comment_id": 46,
				"body": "Thanks! Updated the install instructions: https://github.com/HelloZeroNet/ZeroNet",
				"added": 1427283618
			}
		],
		"1@64": [
			{
				"comment_id": 47,
				"body": "Yes it's possible: start using `zeronet.py --ui_ip \"*\"` \n\nyou can also add `--ui_restrict 1.1.1.1` to allow the conection to web ui only from 1.1.1.1 ip address",
				"added": 1427575435
			}
		],
		"1@62": [
			{
				"comment_id": 48,
				"body": "Thanks :)\n\nThe first time you try to access a site by domain the ZeroName site is automatically added to your sites, so no need to open in manually, but it could not hurt :)",
				"added": 1427850858
			},
			{
				"comment_id": 49,
				"body": "> [p2p](#comment_5_62): one thing I want to ask: I pressed enter between sentences, why the post is shown without Line break?\n\nSite uses [markdown syntax](https://help.github.com/articles/markdown-basics/) that only breaks your text if you press the enter twice. Its also frustrates me sometime probably im going to find some workaround to break with one enter.\n\nBtw you can edit/delete your previous posts and topics by hover your mouse over the text and pressing the **§** icon. (This also needs to be changed something more clear)",
				"added": 1427882997
			},
			{
				"comment_id": 50,
				"body": "> [p2p](#comment_7_62):  yep, pressing the enter twice works. I'm waiting for your workaround.\n> oh, pressing the § icon works. I haven’t known it before.  It really needs to be changed something more clear.\n\n§ changed to pencil icon, i think its clear enough\n\nAnd single line\nbreaks also working :)",
				"added": 1428020356
			},
			{
				"comment_id": 51,
				"body": "> [p2p](#comment_8_62): BTW, in your latest article, I think it should be April 2 instead of Mar 2 : )\n\nThanks, fixed :)\n\n> And do you know Twister, a fully decentralized P2P microblogging platform？It has \" DHT relay mode \" to fully support Tor.\n\nI didn't knew it, after quick look its sound similar to ZeroNet, i will try it later.",
				"added": 1428024754
			}
		],
		"1@16": [
			{
				"comment_id": 52,
				"body": "Thanks for reporting, fixed in the [latest commit](https://github.com/HelloZeroNet/ZeroNet/commit/2d588a5006a8deab707f13ee870db9f2a8f3624c).\nI really need to find something for automated testing...\n\nCongrats for first non *zeronetwork.bit domain in the registry http://127.0.0.1:43110/bluishcoder.bit works here. :)\n\nI forgot to add some information to the ZeroName site (updated now):\n\nTo make the homepage (ZeroHello) link to your site domain you have to add a \"domain\" key to your site's content.json file, for example:\n\n```\n {\n  \"address\": \"1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\", \n  \"background-color\": \"#F5F5F5\", \n  \"description\": \"Decentralized forum demo\", \n  \"domain\": \"Talk.ZeroNetwork.bit\", \n  \"files\": {\n  ...\n```\n\nThanks!",
				"added": 1428064973
			}
		],
		"1@78": [
			{
				"comment_id": 59,
				"body": "sure, its opensource: https://github.com/HelloZeroNet/ZeroTalk\nyou can reach me at zeronet irc channel @ freenode if you have any questions",
				"added": 1428654943
			}
		],
		"2@78": [
			{
				"comment_id": 60,
				"body": "Username editing not supported yet, but its possible later.\n\nThere is no password in zeronet, its works like bitcoin: when you first started zeronet a new bitcoin address/privatekey generated for you. Every content you create (comment, topic upvote, etc.) is signed by your private key like your bitcoin transaction.\n\nYou private keys is at `data/users.json`, you have to backup this file if you want to keep your identity safe.",
				"added": 1428655344
			},
			{
				"comment_id": 65,
				"body": "> [Winter_Fox](#comment_7_82): Can zeronet sites read this file or only get the pub key?\n\nThey can only access to user's public key generated to site. The content signing is done by zeronet client, your private key never leaves your computer.",
				"added": 1428759533
			}
		],
		"2@2": [
			{
				"comment_id": 63,
				"body": "> [Winter_Fox](#comment_3_82): Attempted to set up a blog. If anyone could test it that would be awesome. \n> http://127.0.0.1:43110/17WUZGKQ1AhZLT8vENfWKb3ZvsrCAscsKg\n\nWorks for me!",
				"added": 1428748358
			},
			{
				"comment_id": 64,
				"body": "> [Winter_Fox](#comment_4_82): Awesome. Zeronet is really cool. Much better then I expected.\n\nYou can post images by copy it to your site directory (data/17WUZGKQ1AhZLT8vENfWKb3ZvsrCAscsKg) then insert using `![image alt](anyimg.png)`\n\nI'm planning to add image upload to editing interface, but haven't got there yet.",
				"added": 1428752383
			}
		],
		"1@82": [
			{
				"comment_id": 67,
				"body": "If you ddos all peers than its possible, but I think its really hard to do. And you would still able to browse your local copy of the site, only the updates would be slower, so I don't think it worth to do.",
				"added": 1428831824
			}
		],
		"1@90": [
			{
				"comment_id": 71,
				"body": "If you change the link to ` <a href=\"Bookbag/index.html\" target=\"_top\">Here</a>` then it should work.\n\nAccessible using this url: http://127.0.0.1:43110/15VVHT6AhAZDSJinHKZMf9VTc1uCGG1HvZ/Bookbag/index.html",
				"added": 1429042343
			}
		],
		"2@62": [
			{
				"comment_id": 75,
				"body": "~~The problem is the clients only add the address to his known sites if he was able to download it.~~\n\n~~So you can't push your new modifications to peers that hasn't downloaded it yet. (btw i think you should remove the ip addresses)~~\n\nLooks like i was wrong and it do works in my testings:\n - Created new site on local, Tor-ed machine: `zeronet.py siteCreate`\n - Opened the generated address on server machine `http://server:43110/siteaddress`\n - Executed `zeronet.py --debug --debug_socket --proxy 127.0.0.1:9050 --disable_udp sitePublish siteaddress` on local Tor-ed machine\n - The site do loaded on the server.\n\nPlease the first client has to has an open port to access your site. Later it can be solved by supporting Tor hidden address clients and allow to define bootstrap hidden addresses in site links like accessing site `http://127.0.0.1:43110/132bG9oC1A8jz2ouVwGZyQ5asrNsE4Vr@kSkOreiosEo.onion` means it try to ask the site from kSkOreiosEo.onion address if no other found. (define the hidden address in the url only needed until at least one clearnet peer pickup up your site, after that the other clients can be found using the peer exchange)",
				"added": 1429264969
			},
			{
				"comment_id": 76,
				"body": "> [p2p](#comment_26_62): the ip addresses were masked.THX! I'll test in debug mode. Can other people see your site created in your Tor-ed machine?\n\nAfter one clearnet peer with open port pickup up your site then anyone can access it from him. ",
				"added": 1429274758
			},
			{
				"comment_id": 77,
				"body": "> [p2p](#comment_27_62): But how can I publish a new site when no one knows my site's address?If I tell a man ( with open port) my new site's address BEFORE I publish it through Tor,  can he get my site?\n\n - You create a new site: 16ynw3e3G6mVz3LkaztXufXqjRtyZjPJ3K\n - The clearnet peer with open port open the site (he could not find any other peers, so the page loading screen is displayed)\n - The Bittorrent trackers stores his ip:port as possible peer for your site\n - You executes sitePublish command\n - Your client connects to bittorrent tracker using Tor and you found his ip:port as possible visitor\n - You connect to his ip:port and your client send the files to he\n - The page loads he and he becomes seeder of your site",
				"added": 1429275900
			},
			{
				"comment_id": 78,
				"body": "> [p2p](#comment_29_62): Oh, I'll be near 20K limit in ZeroTalk, help!\n\nBumped to 50k. (congrats you are the first user who reached the 20k limit :) )",
				"added": 1429282271
			},
			{
				"comment_id": 79,
				"body": "> [p2p](#comment_30_62): Haha, you have not reach 20K? I thought you posted more than me. Or you are the site owner, no limit for you?\n\nI did (currently at  37.5K / 150K limit)",
				"added": 1429284420
			},
			{
				"comment_id": 81,
				"body": "> [p2p](#comment_31_62): So you have 150K, I have 50K, others still have 20K? you can adjust the limit for a specific user?\n\nSure, its a simple file: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/data/users/content.json",
				"added": 1429290090
			}
		],
		"1@105": [
			{
				"comment_id": 80,
				"body": "You have to use `../Python/python.exe zeronet.py siteCreate` if you have ZeroBundle",
				"added": 1429289990
			},
			{
				"comment_id": 82,
				"body": "> [salvotnt](#comment_2_105): : (     path error.... not found\n\nThis should work (notice \\ instead of /, sorry I used to linux):\n`e:\\Web\\2015-04-15\\ZeroBundle-v0.1.0\\ZeroBundle\\ZeroNet>..\\Python\\python.exe zeronet.py --version`\n`- Starting ZeroNet...`\n`ZeroNet 0.2.9`",
				"added": 1429292415
			},
			{
				"comment_id": 83,
				"body": "> [salvotnt](#comment_4_105): test page here: http://127.0.0.1:43110/1LHt9Ry3aoH7tBmbbKyquu7wEK2EE7yzcs\n\nConnection failed, you must have an open port to create a new site",
				"added": 1429298093
			},
			{
				"comment_id": 84,
				"body": "> [salvotnt](#comment_5_105): updated , please reload...\n\nI was able to download the content.json and index.html, but other files (images, css, js) are missing, do you have them in place?",
				"added": 1429397416
			},
			{
				"comment_id": 85,
				"body": "> [salvotnt](#comment_6_105): yes , please http://127.0.0.1:43110/1LHt9Ry3aoH7tBmbbKyquu7wEK2EE7yzcs\n\nits better, but data.json still missing :)",
				"added": 1429398652
			},
			{
				"comment_id": 86,
				"body": "> [salvotnt](#comment_7_105): updaded test blog http://127.0.0.1:43110/1LHt9Ry3aoH7tBmbbKyquu7wEK2EE7yzcs\n\nYes, now everything looks fine! :)",
				"added": 1429435072
			},
			{
				"comment_id": 87,
				"body": "> [salvotnt](#comment_8_105): thanks , nofish.\n> what about changing layout , existing any editor ?\n\nYou can edit the posts using the web interface (clicking on § character) and can change the layout using html/css.",
				"added": 1429436862
			}
		],
		"1@115": [
			{
				"comment_id": 88,
				"body": "It has an extra space after the address: `\"\": \"15jy2npsEZsGsWMavAdJmV1NZBPeLUpfPG \"` http://namecha.in/name/d/brainwallets\n\nBut it should be good now (added ignore all invalid characters in address)",
				"added": 1429456162
			}
		],
		"14@2": [
			{
				"comment_id": 89,
				"body": "> [bts](#comment_3_121): I'd like to know how the network works. How the files saved and transferred among peers? Is a site saved as one big file or split as multiple files? Thanks.\n\nI'm planning to create slides/animation about how the content distribution works, but have not found any good tool for it. If no better found i'm going to use google docs's presentation app. :)\n\nFiles are saved as the site owner has it. (you can check for example data/1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8 dir for ZeroBlog files). This allows to use zeronet to distribute any other content like: Git repository, Auto-updated application source code or syncing excel files between computers.\n\n> [pipasmalucas](#comment_1_123): It would be great to have a documentation about templating website on zeronet. As is nor PHP or HTML based. how to do a link to an other page for exemple. how to organize content. thanks a lot :)\n\nTemplating is really up to you, there is tons of javascript template engines out there. I have not used any for ZeroTalk/Blog: Just created the [template html node](https://github.com/HelloZeroNet/ZeroBlog/blob/master/index.html#L64-L71) with display: none then using this with [jquery's clone()](https://github.com/HelloZeroNet/ZeroBlog/blob/master/js/ZeroBlog.coffee#L77-L80) function.\n\nAs linking every link must have a target=\"_top\" attribute because the zeronet sites are running within sandboxed iframe to get more security. \n\nIt's recommended to put all dynamic content (eg. posts) within the data directory.",
				"added": 1429568836
			}
		],
		"3@62": [
			{
				"comment_id": 90,
				"body": "SSL support is planned, but gevent's (the python library we use for event system) [ssl support is broken yet](https://github.com/gevent/gevent/issues/477), waiting for fix...",
				"added": 1429575967
			}
		],
		"1@129": [
			{
				"comment_id": 91,
				"body": "Yes, the site owner can edit/remove posts, topics or delete users.",
				"added": 1429641533
			}
		],
		"2@131": [
			{
				"comment_id": 92,
				"body": "sorry, but this is already posted: http://127.0.0.1:43110/talk.zeronetwork.bit?Topic:1@107/127+0+0+1+43110+less+browsing+using+chrome+extension\n\nYou can edit/delete your posts/topic by using the pencil icon that appears when you hover over your post.",
				"added": 1429664673
			}
		],
		"1@125": [
			{
				"comment_id": 94,
				"body": "It can be possible, but p2p applications on mobile is not ideal. It needs constant online presence that can drain the battery in very short time. And for example Apple does not allow any server applications on iOS.",
				"added": 1429696021
			},
			{
				"comment_id": 97,
				"body": "> [TheAkashicTraveller](#comment_1_139): How about some way of sharing the content from a home computer to your portable device? Come to think of it what about have a ZeroNet box (raspberry pi?) and sharing to all of your devices? This would also let you use one username for sites like this.\n\nYes, this is supported you can start using `zeronet.py --ui_ip *` this allows you to connect to your ZeroNet from anywhere. \n\nYou can restrict the access to ip address using `--ui_restrict 123.123.123.123`, password based security not available yet, but it would be a good idea. (created a [github issue](https://github.com/HelloZeroNet/ZeroNet/issues/91) for it)\n\nEnabling the Multiuser plugin allows more than one users to use the same box with different identities. (browser cookie based authentication)",
				"added": 1430012144
			},
			{
				"comment_id": 98,
				"body": "> [und3rd0g](#comment_7_70): wouldn't it be better to have public-facing proxies where we can browse zeronet when we don't have possibility to run it ? there were a couple of them , but all died recently :(\n\nIt would be nice to try it, but in long-term its recommended to run your own zeronet client because the proxy owner is able to view your private key.",
				"added": 1430042547
			},
			{
				"comment_id": 100,
				"body": "> [und3rd0g](#comment_8_70): I ment for browsing purposes only . Running zeronet on android is even less private than in the public proxy scenario . I might or might not manipulate your data , you can't be certain . But google will most certainly log everything you do on your android .\n\nBrowsing is ok, but if you want to post to any site you have to send your private key to the proxy owner.",
				"added": 1430054472
			}
		],
		"1@131": [
			{
				"comment_id": 95,
				"body": "No other Namecoin features planned yet and please don't send any money to zeronet namecoin addresses, I don't own any Namecoin wallet/address. If you want to support the project: http://zeronet.readthedocs.org/en/latest/zeronet_development/donate/",
				"added": 1429714403
			},
			{
				"comment_id": 104,
				"body": "> [7331yugsiht](#comment_8_138): But I feel I need to give some to the namecoin project as well because 0net won't take off without the shorten names provided by namecoin. So I feel they are both equally important.\n\nSupporting normal icann domains (.com, .net, etc.) is also possible in case namecoin (and all similar) project are shutdown for any reason.",
				"added": 1430252229
			}
		],
		"1@138": [
			{
				"comment_id": 96,
				"body": "> [7331yugsiht](#comment_2_138): Previous post was formatted for posting on Disqus, Here is a cleaner version of the list suitable for this forum:\n\nThanks for the list, you can edit/delete your previous post by hovering over it then pressing the pencil icon.\n+ if you remove the `<a href=\"\">` part from line 3 the links will be displayed as clickable element.",
				"added": 1429996458
			}
		],
		"18@2": [
			{
				"comment_id": 99,
				"body": "> [p2p](#comment_43_62): nice slide! \n> \n> what happen if a site owner private key is stolen by NSA or sth? can NSA  delete content of the site in all nodes? in other words, does ZN have  versioned backup?\n\nYou can create a script easily that backups the data dir every 24 hour, so you can create a new site when its got deleted. In theory - since we use the same cryptography as Bitcoin - it can be possible to use hardware-based signing method (eg. Trezor) which makes this kind of attack impossible.\n\n> have you seen my suggestion of decentralized user registration in ZeroTalk using proof of stake? any comment?here:http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:2@62/Start+a+new+site+using+Tor+can+you+see+my+site\n\nThere is no blockchain involved in zeronet, but every site is independent, so you can create a site that has PoS based. Probably in the next few months there will be a feature (trusted authorization partners) that allows you to use the same identity between sites without contacting the site owner.\n\n",
				"added": 1430043371
			},
			{
				"comment_id": 101,
				"body": "> [p2p](#comment_45_62): when you go to implement P2P \"github\", please consider it.\n\nDecentralized Github requires other features (commit messages, push/pull, merge, and the history has to be also synced) so its totally different. It would be easy to do a backup plugin for zeronet, but it greatly increase the used hdd space, so probably it will not be enabled by default.\n\n> I didn't mean Brute-force attack, I meant other attacks like key logger, malicious software...\n\nBrute-force attack is [impossible in Bitcoin-type encryption](http://bitcoin.stackexchange.com/a/3205), hardware based signing method is only protect you from key loggers and similar attacks.\n\n> register to trusted authorization partners may not work in China because GFW may block them. built-in cross-site decentralized user registration is far more difficult to block.\n\ntrusted authorization partners = cross-site user auth:\n - You register at trustedzeronetid.bit (using http, namecoin, email, bitmessage or anything it totally up to the site),  \n - The site owner give you a certificate of the registration\n - You visit myblog.bit that trust in certificates provided by trustedzeronetid.bit\n - You post on myblog.bit using the same auth_address you used to register at trustedzeronetid.bit + the certificate of the registration",
				"added": 1430151900
			},
			{
				"comment_id": 103,
				"body": "> Seems you didn't get my point. NSA may NOT use Brute-force attack, it may use  key logger/ malicious software instead. hardware based signing does cost money, right?\n\nI know what you mean: hardware based signing IS protect you from key loggers. It's an usb device that holds your private key that needed for site modifications and never let your computer to access it. \nIf you want to modify your site you have to send the hash of your content.json to it, push a hardware button on it then it will send back the sign to your computer.\nSo it makes your site impossible to modify without pushing a hardware button on your hardware key.\nI think its much better solution to protect your site from modifications than re-creating it on different address every week.\n\n> if trustedzeronetid.bit offers many ways to register, it would be great. but I still believe  decentralized user registration ( maybe PoS )is more difficult to block by Chinese Great Fire Wall.\n\nIf they can block bitmessage then they can block zeronet, so no point to register. \n\nI think its poor user experience if you have to wait weeks before you can register on a site. And if we only let 1 stake per ip then it makes staking from Tor network almost impossible.",
				"added": 1430212843
			},
			{
				"comment_id": 106,
				"body": "> [p2p](#comment_48_62): I think PoW  wastes energy in usage of user registration, so PoS may be an  alternative.\n\nPlease describe your idea, how would you use PoS for registration without IP limit and days of waiting.",
				"added": 1430299198
			},
			{
				"comment_id": 109,
				"body": "> [p2p](#comment_49_62): (s)he just sends request to miners, NO coin needed, NO PoW for the user. miners do PoW. \n\nIf no PoW on client side then how does the miners know if its a good user or just a bot that constantly sending the registration requests from different IP addresses (eg. using tor)?\n",
				"added": 1430472444
			}
		],
		"3@138": [
			{
				"comment_id": 102,
				"body": "I have not tried, but: https://shapeshift.io/",
				"added": 1430157481
			}
		],
		"1@148": [
			{
				"comment_id": 105,
				"body": "> [twolostnames](#comment_1_148): Ok, here's my problem, I have two test sites I created\n\nBoth working for me!",
				"added": 1430299060
			}
		],
		"3@105": [
			{
				"comment_id": 107,
				"body": "it would be useful to include link :)",
				"added": 1430325705
			},
			{
				"comment_id": 108,
				"body": "> [salvotnt](#comment_12_105): Have you planned to adding bbcode in zerotalk forum ? \n\nYou can use [Markdown syntax](https://help.github.com/articles/markdown-basics/) to format your comments\n\n> I like to have interactive sites , blogs is not what I love: Zero interactivity with user...Are welcome any plugin like disqus for blogs :useful I think.\n\nYes already working on it, probably it will be the next mayor feature of zeronet.",
				"added": 1430328507
			}
		],
		"19@2": [
			{
				"comment_id": 112,
				"body": "> [Oxilic](#comment_19_6): \"[TA] There is no way to measure the total number,\" \n> You could add google analytics to track how many users there are, I currently have it on zerosearch and it works well.\n\nI prefer not to let google to spy on the users.",
				"added": 1431025256
			}
		],
		"2@163": [
			{
				"comment_id": 113,
				"body": "Here is a discussion about the domain names: https://github.com/HelloZeroNet/ZeroNet/issues/83#issuecomment-94332474\nProbably the best idea yet is to change .bit to .zerobit to avoid mixing with standard sites hosted on same domain. Adding new characters to domains is not a good idea: Namecoin does not support or nor the browsers.",
				"added": 1431106430
			}
		],
		"1@176": [
			{
				"comment_id": 116,
				"body": "I2P is an anonymity network. You can hide your IP using it, but you still need server to host content.\nZeronet is a p2p website platform that allows you to host websites without central server, but does not hide your ip.\nYou can use Zeronet over Tor or i2p if you want to hide your ip. So you can't compare them because has totally different purpose.",
				"added": 1432416514
			}
		],
		"20@2": [
			{
				"comment_id": 117,
				"body": "CPU: Core2Duo E8200\nOS: Win8.1 64bit\n\nBenchmarking ZeroNet 0.3.0 (rev193) Python 2.7.9 (default, Dec 10 2014, 12:24:55) [MSC v.1500 32 bit (Intel)], platform: win32...\n\nCryptBitcoin:\n- hdPrivatekey x 10..........0.712s [x0.98: OK]\n- sign x 10..........0.370s [x0.95: OK]\n- openssl verify x 100..........0.363s [x1.02: OK]\n- pure-python verify x 10..........1.570s [x1.02: OK]\n\nCryptHash:\n- sha512 x 10 000..........0.917s [x1.09: OK]\n\nDb:\n- Open x 10..........0.092s [x1.41: Fine]\n- Insert x 10 x 1000..........0.899s [x1.11: OK]\n- Buffered insert x 100 x 100..........1.398s [x0.93: OK]\n- Total rows in db: 20000\n- Indexed query x 1000..........0.267s [x0.94: OK]\n- Not indexed query x 100..........0.648s [x0.93: OK]\n- Like query x 100..........1.884s [x0.96: OK]\n\nDone. Total: 9.31s",
				"added": 1432633439
			},
			{
				"comment_id": 123,
				"body": "Some cheap VPS (<=$5/mo) total time:\n - [OpenVZ](https://openvz.io/): 3.52s \n - [We Love Servers](http://weloveservers.net): 2.74s\n - [Vultr](http://www.vultr.com/?ref=6813419): 2.15s",
				"added": 1434053189
			},
			{
				"comment_id": 134,
				"body": "> [Interfect](#comment_2_221): What do we do with these now that we have them?\n\nThese numbers represent the users computer speed, using this the site developers can get a little perspective about the users cpu and hdd speed.",
				"added": 1434840270
			}
		],
		"1@185": [
			{
				"comment_id": 118,
				"body": "> [fruitlunch](#comment_1_188): Is it possible to use in the tor browser?\n\nI have not tested, but it should work on any modern browser (eg. supports websocket)",
				"added": 1432846212
			},
			{
				"comment_id": 130,
				"body": "> [randoguy](#comment_2_21): consider allowing us to set an onion HS as the advertised external IP for our zeronet installations, and using Tor-only for everything including peer discovery\n\nIt would be nice, but the torrent trackers only allows to store ipv4 addresses and have not found any better solution yet.",
				"added": 1434644011
			}
		],
		"4@62": [
			{
				"comment_id": 119,
				"body": "It's a good idea, and planned feature.\n\nI think this way would be the best: Every sites would allow to \"sign up\" to sql queries. So you could add zeroblog posts to your timeline or ZeroTalk new topics created, new comments on your topics or if someone replied on your comment.",
				"added": 1433079946
			},
			{
				"comment_id": 128,
				"body": "> [oracle](#comment_4_212): What about a social network like Diaspora.\n\nDiaspora is more decentralized than facebook, but - far as i know - it's not P2P. Your content is hosted on ruby on rails servers called \"pods\".",
				"added": 1434565220
			}
		],
		"1@181": [
			{
				"comment_id": 120,
				"body": "Probably you are in passive mode. You have to forward the port 15441 on your router to your rpi ip address and then it should work..",
				"added": 1433322137
			},
			{
				"comment_id": 121,
				"body": "Looks like the connection is successful now, but missing the `data/1Atifm3m3wqUo7RqD2GPnyG6PKSxCk3g4c/content.json` file. Please try to run `zeronet.py siteSign 1Atifm3m3wqUo7RqD2GPnyG6PKSxCk3g4c`",
				"added": 1433328984
			},
			{
				"comment_id": 122,
				"body": "> [AuHg](#comment_2_181): @nofish  same result after running siteSign.  \n\nIts working for me now: Bootstrap UI Site",
				"added": 1433353745
			}
		],
		"1@211": [
			{
				"comment_id": 124,
				"body": "Current default limit is 10MB/site, if this limit is reached then the user will be asked if he want to give more space to the site.\n\nFor multi-user sites its also possible to have per user data limit. (if reached the site owner able to give more space to user) You can see your limit and the space you used on the top left corner on this site.",
				"added": 1434541608
			},
			{
				"comment_id": 125,
				"body": "The project's bitcoin address is [1QDhxQ6PraUZa21ET5fYUCPgdrwBomnFgX](https://blockchain.info/address/1QDhxQ6PraUZa21ET5fYUCPgdrwBomnFgX)\nThanks! :)",
				"added": 1434544739
			},
			{
				"comment_id": 126,
				"body": "> [testname345](#comment_4_211): Sent, btw you have a twitter DM :)\n\nWow thanks! :)\n\nYeah, i got the message. I'm open for cleanup, but I need to check what exact modifications need for pep8. Probably need to rename some files, but the auto-updater script does not handle the file renames yet, so it needs more testing before we do it.",
				"added": 1434551499
			},
			{
				"comment_id": 127,
				"body": "> [idealcoder](#comment_6_210): Am I right in saying that when a site updates only the pages that have changed are sent - so the network traffic is minimal from regular updates?\n\nYes, when someone make a change he/she sends the new content.json file to other users that holds the user's files sha512 hash and the clients based on that downloads the changed files from other peers.\nLater it can be improve by sending only the changed part of the file (diff) to other clients, but its not an issue yet.",
				"added": 1434559311
			}
		],
		"1@212": [
			{
				"comment_id": 129,
				"body": "At current form zeronet is not really up for this kind of tasks. Need more magic have support for p2p, searchable big database. ZeroNet sites are mostly javascript based, so it will not work using traditional crawlers.\nRelated project: http://yacy.net/en/index.html",
				"added": 1434580661
			}
		],
		"1@221": [
			{
				"comment_id": 133,
				"body": "The ZeroNet is still in experimental status, its possible that some change will broke the older sites.",
				"added": 1434840064
			}
		],
		"1@220": [
			{
				"comment_id": 135,
				"body": "I don't see it as a big threat, because you are in full control over your hosted content. If you found a site suspicious you can remove it anytime. \n\nAlso planning to add a FAQ page to the documents to keep this questions answered: https://github.com/HelloZeroNet/ZeroNet/issues/56",
				"added": 1434879359
			}
		],
		"1@223": [
			{
				"comment_id": 136,
				"body": "An idea for a twitter-like large site: If someone wants to create a new zerotwitter account he/she clones an empty twitter account (like we have the clone feature for ZeroBlog) and using that site to publish new posts.\nIf someone wants to follow an another user he/she downloads and starts serving the other user's zerotwitter site like any other zeronet site.\nTo be able to access all followed user's twitter on one page we can create \"zerotwitter merger\" sites that has read access to user's all served zerotwitter sites.\nUsing this way the scalability issues can be solved, because you only store, serve and receive the updates for the users you following.\n\n> [moshe](#comment_1_223): Also there is a problem of custom searching..\n\nSearch in decentralized P2P data that you don't have is probably a more complicated problem and need more work, but its not impossible: http://yacy.net/",
				"added": 1434890252
			},
			{
				"comment_id": 137,
				"body": "> How can I release a new feature to all the profiles an once?\n\nIt's possible to update the cloned sites from the parent source code while keeping the user's data (comments, posts, etc.). This method can be automatized, but I don't think its a good idea, because it gives the parent site owner ability to modify every cloned site at once without any control.\n\n> [ezekiel](#comment_2_219): every time I try to connect to Zero Mozilla Developer Network, the client freezes. ZeroNet seems to be fine for small sites, but I'm not sure why it is choking on bigger sites... \n\nThe mozilla dev network site contains more than 100.000 file, its very extreme, I dont think it will supported anytime soon. \n\n> I tried another site with a MP4 and it also choked on that.\n\nZeroNet does not have big file support yet. Its planned, but probably its better to use torrent for static, large files. It's more mature and well-supported.",
				"added": 1434899116
			}
		],
		"1@230": [
			{
				"comment_id": 139,
				"body": "We just started a [tutorial on ZeroBlog](http://127.0.0.1:43110/blog.zeronetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1) and all site's source code avalible on [github](https://github.com/HelloZeroNet?tab=repositories).",
				"added": 1435253256
			}
		],
		"2@230": [
			{
				"comment_id": 140,
				"body": "Install [Tor](https://www.torproject.org/) then start it with `zeronet.py --proxy 127.0.0.1:9050 --disable_udp`",
				"added": 1435271925
			}
		],
		"3@230": [
			{
				"comment_id": 141,
				"body": "If you want to post to site you don't own then you have to contact the site owner. In this site this is done using a simple http request, but you can use any other communication form (email, bitmessage, bitcoin transaction, etc.)\nThis is required to have control over the users. Without this you can't do anything to prevent spam to your site.\nMore info: http://zeronet.readthedocs.org/en/latest/using_zeronet/sample_sites/\nOr: https://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000\n\nSoon this site will be changed to accept zeroid accounts, so you can request username using decentralized messaging form, bitmessage.\n\n(you have the option to publish your site's private key, so anyone can interact your site without contacting the site owner, but then you will loose the possibility to remove misbehaving users)",
				"added": 1435274307
			},
			{
				"comment_id": 142,
				"body": "> [QuickSilver](#comment_2_230): nofish, I was thinking that you could build an admin section that would require a private key to verify a string that changed  like they do on ELIGIUS BitCoin pool (eligius.st) to validate your account to access the DB to make modifications to the DB, and moderate users. Would that work?\n> Dude, Congratulations on this website, it is very smooth. Zeronet is very interesting, and I'm very excited to see where this can go.\n> I found Zeroid (http://127.0.0.1:43110/zeroid.bit) and looks pretty good. I have my ID created and ready for you to make the change. hehe\n\nThanks, I try to do my best :)",
				"added": 1435280375
			}
		],
		"2@107": [
			{
				"comment_id": 143,
				"body": "Try access your router webui using http://192.168.1.1 or http://192.168.0.1 then look for and enable UPnP support then restart zeronet.\nIf still not works then try look for forward section. Its different in every router, here is a tutorial on youtube: https://www.youtube.com/watch?v=aQXJ7sLSz14 (you have to forward port 15441)",
				"added": 1435571715
			}
		],
		"3@212": [
			{
				"comment_id": 144,
				"body": "Unfortunately  it's not possible, only 1 application can use the port on same machine.",
				"added": 1435682486
			}
		],
		"1@250": [
			{
				"comment_id": 147,
				"body": "Thanks for the question, i just added to faq:\nIt's no more anonymous than BitTorrent, but privacy (the possibility to find out who is the owner of the comment/site) will increase as the network and the sites gaining more peers.\n",
				"added": 1436178045
			}
		],
		"21@2": [
			{
				"comment_id": 148,
				"body": "Please help testing it!\n\nI will leave it some more days of testing then it will replace the current ZeroTalk forum (it will remain accessible, but without new user registrations and the talk.zeronetwork.bit will be pointing to new forum)",
				"added": 1436299896
			},
			{
				"comment_id": 153,
				"body": "> [verian](#comment_1_278): so how is it working out?\n\nEverything fine, probably on the next week its going to replace this forum.",
				"added": 1436575794
			},
			{
				"comment_id": 160,
				"body": "> [XGame](#comment_1_322): It's slow, and I don't see all of the messages in internet explorer. I have to select all text on the page to see the text, otherwise it blends into the website.\n\nPlease define \"slow\" (sync, display, scroll, response time etc.) and send screenshot of the borken layout, it works fine here in IE11.",
				"added": 1437146611
			},
			{
				"comment_id": 161,
				"body": "> [XGame](#comment_3_322): Please look at the image below. \n\nI was able to reproduce problem in this, current version of forum, but not on the new one. (my IE version: 11.0.9600.17842) \n\nThe initial sync could take a while depending on your CPU and network connection, but its a one-time task, the new forum has some fixes on this.",
				"added": 1437157209
			}
		],
		"1@247": [
			{
				"comment_id": 149,
				"body": "Unfortunately developing for trust-less P2P architecture requires completely different solution and thinging than traditional client<>server way, so you can't use any of existing source code.",
				"added": 1436387755
			},
			{
				"comment_id": 152,
				"body": "> [gubaguba](#comment_1_273): how are votes stored here?did my (signed) vote get broadcast to all my neighbors and they forwarded those to their peers.How are loops avoided? DAG architecture?\n\nWhen you create a new vote, you update/sign your data file then [publish it to 5 random peers](https://github.com/HelloZeroNet/ZeroNet/blob/master/src/Site/Site.py#L290). When a peer got a new and valid file he/she [publishes to 5 other random peers](https://github.com/HelloZeroNet/ZeroNet/blob/master/src/File/FileRequest.py#L91). Its simple, but has many unnecessary communication, if anyone know better solution please let me know :)\n\n> [S466531257BOSS](#comment_1_272): @ nofish: Would you mind to explain your whole thoughts on this ? -- In which way do you think the differences manifest to not being transferrable/convertable ?\n\nThe first and most biggest difference: Using the traditional model most of the logic done in server-side, in ZeroNet you don't have server-side. You have to everything on client-side using ZeroFrame API that allows you to access and modify the database.",
				"added": 1436462697
			}
		],
		"1@213": [
			{
				"comment_id": 150,
				"body": "there is to way to start zeronet:\n - `start.py`: Start zeronet and open browser\n - `zeronet.py`: Start without opening a browser window",
				"added": 1436392771
			}
		],
		"1@274": [
			{
				"comment_id": 151,
				"body": "ZeroNet CPU usage is negligible. It's possible to port it to C, but you won't see much improvement, the CPU intensive parts (cryptography, database) are using libraries that is written in C (SQLite and OpenSSL).",
				"added": 1436458952
			}
		],
		"1@219": [
			{
				"comment_id": 154,
				"body": "It completely up to the site owner what he/she puts in the directory. If you find any suspicious you can issue a warning and stop hosting the site.",
				"added": 1436608613
			},
			{
				"comment_id": 155,
				"body": "> [ezekiel](#comment_5_219): issue a warning to whom? the site owner? \n\nTo other users eg. using zerotalk.\n\n> who is liable for the content - the site publisher, or every peer that hosts it?\n\nAre the hosting company liable for users content?",
				"added": 1436692620
			},
			{
				"comment_id": 158,
				"body": "> [zqueal](#comment_3_243): There needs to be a set restriction for transferred files. For example, a ZeroNet site that I connect to should not be able to download an executable binary file onto my computer for any reason.\n\nZeroNet sites have the same permission as any other sites you visit over the internet, so they does not able to execute any file on your computer.",
				"added": 1436866587
			},
			{
				"comment_id": 162,
				"body": "> [XGame](#comment_5_322): This is not true.. other sites on the internet pop open a window asking where you want to save the file if it's an .exe....\n\nThe popup window is depending on http protocol contet-type header, if its served as image then it will be saved on your computer without asking anything.\n\nEven the oldest Internet Explorer does not allow to execute any file from your computer, if it could then you are not safe anymore, since any site can simply execute \"C:\\windows\\system32\\format.com c:\" without any problem.",
				"added": 1437495357
			}
		],
		"1@281": [
			{
				"comment_id": 156,
				"body": "To generate new identity you have to delete data/users.json file, but if you do this then you will also lost other sites settings.\nBtw. in some days this forum will be deprecated and replaced by the [new one](http://127.0.0.1:43110/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT) that uses ZeroID usernames.",
				"added": 1436720112
			}
		]
	},
	"topic_votes": {
		"1@6": 1,
		"1@49": 1,
		"2@2": 1,
		"4@2": 1,
		"1@18": 1,
		"1@35": 1,
		"15@2": 1,
		"5@2": 1,
		"8@2": 1,
		"3@6": 1,
		"1@59": 1,
		"1@60": 1,
		"14@2": 1,
		"1@64": 1,
		"1@13": 1,
		"1@2": 1,
		"1@62": 1,
		"1@71": 1,
		"1@70": 1,
		"67@69": 1,
		"1@69": 1,
		"1@86": 1,
		"2@82": 1,
		"1@91": 1,
		"1@77": 1,
		"2@6": 1,
		"17@2": 1,
		"1@115": 1,
		"209@69": 1,
		"1@107": 1,
		"1@78": 1,
		"3@2": 1,
		"1@134": 1,
		"1@138": 1,
		"18@2": 1,
		"3@105": 1,
		"1@103": 1,
		"19@2": 1,
		"2@129": 1,
		"4@62": 1,
		"20@2": 1,
		"1@211": 1,
		"1@217": 1,
		"1@242": 1,
		"2@107": 1,
		"1@247": 1,
		"21@2": 1
	},
	"comment_votes": {
		"1@52": 1,
		"35@2": 1,
		"1@59": 1,
		"1@62": 1,
		"2@62": 1,
		"1@61": 1,
		"7@64": 1,
		"9@2": 1,
		"3@10": 1,
		"1@20": 1,
		"10@64": 1,
		"5@9": 1,
		"7@62": 1,
		"6@16": 1,
		"1@72": 1,
		"1@74": 1,
		"1@75": 1,
		"2@77": 1,
		"5@78": 1,
		"2@75": 1,
		"3@82": 1,
		"4@82": 1,
		"73@2": 1,
		"6@131": 1,
		"1@129": 1,
		"3@138": 1,
		"6@138": 1,
		"7@138": 1,
		"2@107": 1,
		"14@105": 1,
		"17@105": 1,
		"15@105": 1,
		"3@129": 1,
		"1@184": 1,
		"54@62": 1,
		"19@105": 1,
		"1@185": 1,
		"1@182": 1,
		"1@186": 1,
		"20@6": 1,
		"22@6": 1,
		"7@17": 1,
		"1@196": 1,
		"1@197": 1,
		"4@211": 1,
		"11@212": 1,
		"10@210": 1,
		"1@230": 1,
		"3@184": 1,
		"61@62": 1,
		"1@261": 1,
		"3@278": 1
	}
}