{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Фидонет",
			"body": "Всем привет. Слышал здесь кто-нибудь про Фидонет? (Видел в треде с перекличкой, что да).\nСеть на анонимная, но тоже децентрализованная и тоже за свободный обмен информацией. А ещё она очень старая и сейчас перерождается, то бишь модем уже не нужен.\nПредлагаю на основе ZeroNet сделать эхо-архив)",
			"added": 1508668161
		}
	],
	"topic_vote": {},
	"next_comment_id": 22,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 3,
				"body": "> [lectro](#comment_1_1M7Z68osMzGwETnXKpQ4nsT2Ut3pjtyi5f): Так так всем привет .... Первый вы меня слышите это на связи Кассиопея\n\nНа связи Darkstar! Координаты траектории: 07063.38000",
				"added": 1510597021
			},
			{
				"comment_id": 4,
				"body": "> [dude](#comment_42_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): djazz заходишь на другого провайдера имен и создаешь учетку. Потом на сайтах в настройках боковой панели внизу есть опция поменять текущий идент. У некоторых сайтов для этого даже своя кнопка есть.Как использовать несколько учеток с одного провайдера - не знаю, не пробовал.\n\nУже существуют альтернативные провайдеры имён? Я уже все свои ники потерял: для одного потерялись файлы с приватными ключами, а для двух других повисла регистрация.",
				"added": 1518627286
			}
		],
		"11_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 5,
				"body": "> [j0ystick](#comment_3_1HhmPBWdrDiPcQ2Dk2vBCmeaEd6RjbbQYz): Угрожать они могут только кулаком в монитор, ведь они сами выложили эти фото. Однако, могут привлечь за распространение ЦП, есть им 18 нет. Но во-первых, на тебя Российское законодательство не действует, во-вторых, они сами попадут под распространение, если заяву напишут. Советую тебе этим больше не заниматься и дать этим долбоебам номер Вольнова.\n\nДва чая во второй степени этому господину.\n\n> [gluckman](#comment_10_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Смотря в какой стране живёшь. Но скорее всего ничем. Полиция из России вряд ли будет писать в полицию твоей страны.\n\nА как же Интерпол?",
				"added": 1533802864
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 6,
				"body": "-1\nСкоро сменю акк. [ОТМЕНЕНО]",
				"added": 1533804643
			}
		],
		"7_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 14,
				"body": "Бамп годному треду, вот духом настоящего даркнета повеяло!",
				"added": 1535302055
			}
		],
		"6_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": [
			{
				"comment_id": 13,
				"body": "Нет! Не норм! Так он быстрее сдохнет! Но сейчас с ним (пока ещё) всё хорошо.",
				"added": 1535300461
			}
		],
		"1590837476_1JQ4t8CN9SneVvs69mGzgjwotoqPm6rL8N": [
			{
				"comment_id": 15,
				"body": "Δα. Ведь больше никто не укажет мелкомягким на их законное место.\n/thread",
				"added": 1590857048
			},
			{
				"comment_id": 16,
				"body": "> [cra](#comment_115_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Уже точно не помню как называлась тогда система окружения рабочего стола, но она поддерживала всякие разные скины и скрипты с плагинами.\n\nНе Talisman случайно? Всё думаю что-то такое поставить, но на XP с семёркой и опенсорсное.\nА то в последней Explorer.exe уж больно нестабильный какой-то стал. XP - так, за компанию ради винды-Франкенштейна, в которой всё, что можно, заменено опенсорсом (помнится, Haiku так и делали, IMHO поэтому дальше ушли). Emerge Desktop, вроде, норм, LXDE напоминает...\n\n> [cra](#comment_116_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Ну, Windows 3.11 это не полноценная ОС, это оболочка для DOS.\n\nНу не скажите. Тогда бы она под FreeDOS в расширенном режиме запускалась. Уже точно не помню, где, но на форумах разработчиков есть тема, о том, что 3.1 работает только поверх M$-DOS, потому что во время работы выгружает какие-то его части и загружает на их место свои (а при выходе делает наоборот). Да и ядро с дровишками у неё есть, так что, по Угриновичу за 8 класс, это вполне себе ОСь. :-)",
				"added": 1591031500
			},
			{
				"comment_id": 17,
				"body": "> [cra](#comment_127_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Та, про которую я говорю как-то на букву \"L\" вроде бы называлась.\n\nТогда LiteStep... LDE(X)... Интересно, если честно.\n\n> [cra](#comment_127_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Что вы сказали про Haiku я не понял.\n\nAFAIK во время разработки Haiku для обеспечения бинарной совместимости с BeOS разрабатываемый \"альтернативный\" компоненет тестировался в настоящей BeOS. React OS же разрабатывается с нуля.\n\n> [cra](#comment_127_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Интересно, почему http://emergedesktop.org/ заблокирован Роскомнадзором? Там-то чего криминального они нашли? :D\n\nДык, и сайт React OS заблокирован, и 7-zip.org. Давно уже причём. Чую, наученные горьким опытом с Telegram, наши чиновники заметили в опенсорсе угрозу. :-) (В каждой шутке...)\nДействительны ли блокировки до сих пор - не знаю, у меня сценарий PAC настроен, так что покуда это достаточное условие комфортного обзора клирвеба - оно же IMHO и необходимое...",
				"added": 1591473652
			},
			{
				"comment_id": 18,
				"body": "> [zombibi](#comment_27_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): src kernel win2k по всему инету валяется. скопировать может и не копировали, но тексты смотрели.\n\nО да, об этом слышал. А ещё слышал о какой-то \"чистке от следов обратной разработки\" ещё где-то в нулевых.\n\n> [zombibi](#comment_27_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): В течении 15 минут все гламурные кисо\n\nВот это вряд ли. Те, кто смог бы - уже тут сидят, судя по увиденному вчера в ZeroMe))0).\n\n> [zombibi](#comment_27_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): любители просмотра кисовых видео, установят себе на смартфонах тор;)))). \n\nВот это гораздо более вероятно.",
				"added": 1591653692
			}
		],
		"1591036220_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 19,
				"body": "Зато пользовательские ресурсы больше не поддерживает.\n\n> [satoxyn1](#comment_24_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): с недавнего времени и полноценные звонки.\n\nЗначит, Legacy действительно Legacy, и пора с него валить, эх.",
				"added": 1591965185
			},
			{
				"comment_id": 20,
				"body": "> [anotherneko](#comment_191_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Ну по качеству аудио токс очень сложно переплюнуть, оно там на голову выше всего остального, что мне доводилось пробовать.\n\nПомню, пробовал ещё в 2016. Тот же лучший файлообменник (в хорошем смысле), только без офлайн-доставки, и аккаунты локально хранит. Если я когда-нибудь и замучу свой Linux-КПК (а планы такие определённо есть), то qTox/uTox (зависит от того, что под armhf соберётся), скорее всего, будет штатным приложением для звонков. А Pechkin (и даже не XMPP!) - штатным мессенджером^W аналогом почтовика.",
				"added": 1592207530
			}
		],
		"1593637018_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 21,
				"body": "> [exhumator](#comment_39_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq): А каков принцип работы? Как у Zeronet? Устанавливается программка, а работает через браузер?\n\nНасколько я понял, здесь больше похоже на I2P.",
				"added": 1596469996
			}
		]
	},
	"comment_vote": {
		"2_19M6S4PQBFoq7kg7Bv6t4U8aRs9qrVMyat": 1,
		"4_112P12yusWzfvzAUiEbL6YUzWg33hfGxae": 1,
		"1_1MQqqyhzHNpasgGk6wwQLc2QnSUsaocdRA": 1,
		"1_1K6GgFxLQ5n1U2oAsrkVoGqmr2K8C2egJ4": 1,
		"27_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq": 1
	}
}