{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1611103567,
			"title": "Brave browser to implement IPFS",
			"body": "Brave is now going to offer native integration with a peer-to-peer networking protocol and is the first mainstream browser to do. \n\nThoughts?\n\nhttps://reclaimthenet.org/brave-ipfs/",
			"added": 1611103566
		},
		{
			"topic_id": 1611620311,
			"title": "Youtube algorithm glitch.",
			"body": "By using this exploit you can:\n1. Gain more views on your videos by getting recommended more\n2. Gain thousands of subscribers by not even uploading\n3. Gain preferential promotion in the algorithm and use it to become giant \n4. Use this to push your competition away by gaining more interactions than they can even get close to managing!\n\nTHIS IS FOR PEOPLE WHO HAVE ACCESS TO THE COMMUNITY TAB AS A CONTENT CREATOR\n\nhttps://youtu.be/Ej0Kijd4_4Q",
			"added": 1611620309
		}
	],
	"topic_vote": {
		"1611411500_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1611192483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "> [aim64c](#comment_63_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): This would be like saying the horse-drawn plow would lead to the destruction of civilization.  Back in the day, upward of 60% of the population was employed in agriculture.  Most people spent the majority of their time tending to the task of producing crops or their own survival needs (such as gathering fuel for fires to cook with and heat or storing said grown food).The reduction in manpower necessary to produce food is part of what allowed for the innovation which drove the industrial revolution and scientific innovation.UBI is a fundamentally failed idea because it doesn't address the economy.  The economy is the exchange of goods and services.  Money and Currency are simply mediums to facilitate this exchange and, when accrued, represent an invested potential to motivate labor forces.  IE - The fact I have 100 ounces of silver sitting on the table means that I can motivate people to take time out of their day to apply themselves to the thing I want done in exchange for that silver.  If their time is more heavily occupied, then it will obviously take greater incentive to get them to pull themselves away.  If all they were doing was getting pissed at their raid getting wiped for the fifth time that day, then they might be open to doing something that will at least get them paid.  UBI doesn't address the underlying exchange of goods and services, it simply provides a consistent injection of currency into the market, which usually does not stimulate market activity, but instead bloats prices for existing activity. [...]\n\nK",
				"added": 1611198397
			}
		],
		"1611260804_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": [
			{
				"comment_id": 2,
				"body": "barrier to entry is good. this just gives room for tech illiterate normies to muck things up",
				"added": 1611436038
			},
			{
				"comment_id": 3,
				"body": "> [aim64c](#comment_73_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): There are a few things you should consider.First - What is the difference between wanting to turn all of the internet into a propaganda platform for only approved ideas... and jealously guarding a platform from the presence of the unapproved?Second - It should be rather obvious by now what the endgame of Google et al is.  How much longer do you think Zeronet.io and github repositories will be up?The distribution of ideas and the representation of them in art and discussion is culture.  Whether you realize it or accept it, this platform represents a strategic weapon in the culture war.  It will not be left alone by either side(s) of that culture war.  For now, it is relatively obscure, but word will start to get around. [...]\n\nTLDR.",
				"added": 1611446916
			},
			{
				"comment_id": 7,
				"body": "> [aim64c](#comment_74_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): And you wonder why the world is slipping away into oblivion.\n\njust playing the devils advocate and trolling a bit. what you said was legit but who cares when people don't want to read things that long? You should just write a blog and link it to the end of your topics. I'm sure more people would listen that way instead of it being lost in the comments and glanced over as a wall of text(which it is).putting it here in the comments just makes it seem like it's not supposed to be at the forefront of conversation. Might consider doing that myself.",
				"added": 1611613599
			}
		],
		"1611396015_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": [
			{
				"comment_id": 4,
				"body": "thanks for bumping this you retards. just let it die.",
				"added": 1611447889
			}
		],
		"1611411500_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 5,
				"body": "bump",
				"added": 1611527961
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 6,
				"body": "https://www.youtube.com/watch?v=hfhCEwbRRsI&feature=emb_title",
				"added": 1611529397
			}
		],
		"1604952415_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 8,
				"body": "HAHAHA OP is a script kiddie.",
				"added": 1611627778
			}
		],
		"1611620311_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": [
			{
				"comment_id": 9,
				"body": "> [thedarkmaster](#comment_5_18qRmb5CCTuAwYDYLRGC9cZrnRe4Bt3rjb): \n\nk",
				"added": 1611632928
			}
		],
		"1610913965_17DwXt69rTzQ2mdL3LPLSW9rfNWNQgKcxt": [
			{
				"comment_id": 10,
				"body": "CQEGAcGYxsBNBGAQwkcBCACqtp7jjd/M3MG6VC6BjUqtRoqPLv6ygMF+XtjkLfAl\nyDFAYYyW68LX5kOe7x5G8z3o16zdYSbgituZUbrPAEhm8Ff3gObmDycsLLdWm+o3\nssozPhXDiYJNXgxe5pcYB5Kbr2On6lLl4lYJs8Lisq3CXTYuBF71OxUAEYvzOZ8k\nSFmm/51gEEHsKFGx1NntpSBTE3X2RSDlvv18c0eyFzInpoEqZXta/EdJbLrGvwMW\n1iUIC8gRyF99M+wOUxUuoHSdvDnRaoMQNIhY39HddOC1VIuuOq0qb9W9BN9eeL/C\nTbX5/bp2b/gwXHhoBpnehQpoFFPt2/1N6MrCLciG2WOVABEBAAHNJHJvdGFsdXMg\nKEdlbmVyYXRlZCBieSBSZXRyb1NoYXJlKSA8PsLAXwQTAQIAEwUCYBDCRwkQOb8k\nFcUaQ3MCGQEAADZwB/4+b0pL65wI95ZyOFEm0uiwymAELcGsMUDLVOvAN7TZT1eo\nCKFh41prsT4J/aH5+H3dPAXpzXE/h0rUGPTr1RIWV2igBzeCT0RHWFxi3YaNWBfS\nKIKQ0vI9OFEKJlKBDEQ3X0rhS0QaBTnBWhXa9daK8v/WRTKODAr+MZjjUpZmXRs3\nsLZenho4trqlmRtGnUkr5RTa/YcKIN/Efupyqah3yZ9yff1i20Bp9enWpT/xFYgf\nWRM+KDVKgM+aS8jocncOrfymtO4DmC7QKTpc4u2XNBspO8F5bHLltJUCwHPjciqg\nEWiNE10FIePRVn4X/4T9nFu+mIpGQuD6bu2miCyMAgYAAAAAAAADBsCoAWoOVQQA\nBgtNeSBjb21wdXRlcgUQaYBUivGdiMe1PRlt4/uxcAcDKggU",
				"added": 1611711162
			}
		]
	},
	"comment_vote": {
		"2_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": 1,
		"6_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": 1
	}
}