{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1P3rCvY9Ns2PQVuT1GhdHBBuZzMYX8M1rf": [
			{
				"comment_id": 1,
				"body": "Bonjour, très intéressé par pour Elite-tracker. J'ai du mal à trouver un site correct pour les ebooks fr depuis la chute de T411. A mon sens, il se joue en ce moment la bataille cruciale du net. Soit on rebondit soit ils nous laissent avec une offre vod ou autres lamentable. \nMerci dans tous les cas, \nDjack",
				"added": 1499526738
			},
			{
				"comment_id": 2,
				"body": "> [horacio](#comment_1_1K6iU6dHsLJN7A2uEgFD8qhZdPJoR3jEsi): Bonjour à tous. J'espère que ygg, animé par des ex de t411, va décoller. Bonne chance, on a hâte de contribuer. Je propose un surnom approprié :\"bibliothèque numérique d'Alexandrie\". Qulle richesse en oeuvres anciennes et rares ; nous sommes nombreux à leur devoir beaucoup...@djack, as-tu essayé http://www.t411.telechargementz.tv/ebooks/  ?En attendant, je suis demandeur d'une invitation à Ethor, ou Elite...mais étant nouveau sur ZN, je ne sais pas comment je la recevrais (si je la reçois un jour). Merci.\n\nMerci Horacio, \nJe connaissais pas le lien. Bon, ça vaut pas encore feu T411 mais c'est toujours intéressant ! T'inquiète, j'ai mis un peu de temps à comprendre pour le zeromail moi aussi. \nBonne chance\n",
				"added": 1499623130
			}
		],
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 3,
				"body": "Vous énervez pas bande de débiles. Reprenez votre vie en main, ça vous évitera de concentrer votre haine de branleur sur les autres. Que ce soit clair, le problème est en vous. Si vous commencez à l'accepter, vous vous rendrez compte que ça ira mieux et que vous n'aurez plus besoin de perdre votre énergie à trouver et à accuser des boucs émissaires. Vous croyez vraiment que sans les juifs, le monde irait bien mieux ? Il n'y a qu'eux qui vous ont créé des problèmes ? Tout les autres sont aussi gentils que vous qui passez votre temps à haïr des inconnus ? Sérieux, ça ne vous semble pas un peu bancal ?",
				"added": 1505462573
			}
		]
	},
	"comment_vote": {}
}