{
	"next_topic_id": 3,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 30,
	"comment": {
		"1578781307_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Where do you expect this Universal Basic Income to come from, exactly?",
				"added": 1579051523
			},
			{
				"comment_id": 3,
				"body": "I love Yang Gang stans because they unironically think giving people money will lift them out of poverty. Nah brah. You're poor because you make poor choices.",
				"added": 1579053347
			},
			{
				"comment_id": 6,
				"body": "> [thorburn](#comment_31_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): No, I don't do drugs other than my ADHD meds, I do need to fund my cam girl habit and half naked Twitch thot donations. Don't worry though because the more I pay them the easier it will be for them to contribute to our UBI payments. What goes round comes around after all! You should stop being so short sighted and selfish.\n\nDude I'm all for UBI if it lets me get more money selling drugs",
				"added": 1579053634
			},
			{
				"comment_id": 9,
				"body": "> [thorburn](#comment_32_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): We is all kewlies with UBI then bro (or whatever you identify as no transfobe). :)\n\n>no tranfobe\n\nNO. I AM CALLING THE SPLC ON U",
				"added": 1579073875
			}
		],
		"1578699066_1CCh1G3AX8DRk9Fehp28Vevreid7GgLCjj": [
			{
				"comment_id": 4,
				"body": "Yo I got dat kush and adderall hit a nigga up",
				"added": 1579053423
			}
		],
		"1578598282_18uBiau5EHMAmYC7JqrvMwhwKm15cJqc5a": [
			{
				"comment_id": 5,
				"body": "I'm not sure what you're talking about, but I do know this: You gotta have a big dick or you ain't shit.",
				"added": 1579053519
			}
		],
		"1578854998_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "> [draugrdeathlord](#comment_376_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): If you don't click through, it's not innocent sexting between teenagers it's pedos extorting minors into sending more by threatening them with exposure. [...]\n\nNew ZN user here. Why am I not able to see who you're replying to?",
				"added": 1579054853
			},
			{
				"comment_id": 8,
				"body": "> [draugrdeathlord](#comment_399_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Because I don't use the reply function unless I am either replying to someone other than the most recent post or if I do use it I trim down to exactly what I'm replying to so I don't waste my content space.\n\nIt shows the name I just can't see their post",
				"added": 1579073824
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 25,
				"body": "> [styromaniac](#comment_1723_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): So... you think that retrospect will save your finances... [...]\n\nWhat are you on about man? Dude was clearly attacked by the guy and maybe I'm misremembering, but I think I heard the thief shout \"I'll kill you whitey!\"",
				"added": 1579322593
			}
		],
		"1579155770_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "All it ever shows me is Joe Rogan and Drinking Bros.",
				"added": 1579190814
			},
			{
				"comment_id": 26,
				"body": "> [bigbadbob](#comment_881_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): That makes perfect sense, judging by your username.\n\nBroMoment.jpg",
				"added": 1579387519
			},
			{
				"comment_id": 27,
				"body": "> [draugrdeathlord](#comment_460_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Beefdiesel-and-son-vealdiesel.jpg\n\nYo Veal Diesel isn't even in pre-K yet and the little dude's already crushing pussy. The other day I saw him shotgun a juicebox, just like his old man.",
				"added": 1579412108
			}
		],
		"1579175552_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic": [
			{
				"comment_id": 12,
				"body": "Just do what my old man does and ship that shit overseas like a boss.",
				"added": 1579207622
			},
			{
				"comment_id": 20,
				"body": "> [fucktaxes](#comment_6_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic): care to add any info here ? http://localhost:43110/1AJ6CWi9aRADpZ5HSBMVqcEJBrroBKpXZE\n\nNah but I can tell you it's all legitimate. You have enough money and know the right people. There are ways, bro.",
				"added": 1579242332
			}
		],
		"1576215313_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 13,
				"body": "> [thetruth](#comment_35_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): To all commenters, I would appreciate you staying on the topic, share your experience and not drifting away, subject to a new thread, thanks...\n\nNo prob brah.",
				"added": 1579207659
			}
		],
		"1576287725_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 14,
				"body": "I thought Isis was that spy agency with the hot milf from Arrested Development?",
				"added": 1579207798
			},
			{
				"comment_id": 28,
				"body": "> [thetruth](#comment_97_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): The same goes for AL QAIDA...\n\nAnd Al Con Queso, the Mexican-Islamic terror group right at our nation's doorstep!",
				"added": 1579618644
			}
		],
		"1579208009_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "I had a buddy who was depressed. We got him laid and now he's gucci. I would try that first because the only bloating that guy gets is a boner.",
				"added": 1579207933
			},
			{
				"comment_id": 18,
				"body": "> [megatonjim](#comment_22_18xxerUUwEh2hVsNw1Ym6pML9JfwiKLUJT): This motherfucker is a liar, a thief and a drug dealer. Here is his current information:Otha Howard Ishmael289-86-503273 Liberty AvePortsmouth, OH 4566204/04/1974Mother Maiden Name: Rielly740-353-4224\n\nnot your personal army",
				"added": 1579231840
			},
			{
				"comment_id": 22,
				"body": "> [jaka](#comment_25_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD): Clean your room! -Jordan B Peterson\n\nHe's not wrong, man.",
				"added": 1579298123
			},
			{
				"comment_id": 23,
				"body": "Bro I tried not eating at night and I feel dope! I can't believe this even helps people who aren't depressed.",
				"added": 1579298301
			}
		],
		"1579185629_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 16,
				"body": "Bruh. I've been looking into spinning fire. Got anything on that in there?",
				"added": 1579208231
			},
			{
				"comment_id": 17,
				"body": "> [draugrdeathlord](#comment_430_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): How strange one of the popular blocklists has this site on it.\n\nWhat for? And where can I grab one of those? Tired of seeing all these conspiracy dudes.",
				"added": 1579208323
			}
		],
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 19,
				"body": "Total myth. My buddy knows this dude who's all about conspiracies and we asked him what his thoughts on Epstein killing himself were. And this dude went off on us about someone called \"The Finders\" - which sounds totally badass right? Well they're apparently not badass at all because these guys kidnap kids for guys like Larry King to rape and murder and shit. And supposedly not only is this dude NOT the Larry King I was thinking of, but he's still alive and kicking after all that credit union shit got busted in the 80s. Shit's a trip.",
				"added": 1579241852
			}
		],
		"1579246090_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 21,
				"body": "It's got a pretty badass cyberpunk aesthetic in all the pictures I've seen. Hope they get their freedom and shit.",
				"added": 1579253490
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 24,
				"body": "I believe in you brah!",
				"added": 1579298335
			}
		],
		"1579833952_1PJqSeaog4kXbkvrjmjG7bxJBCVFD9FU4r": [
			{
				"comment_id": 29,
				"body": "Aliens, bro. What's up with that?",
				"added": 1579868519
			}
		]
	},
	"comment_vote": {
		"1684_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"323_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"32_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"430_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"432_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"432_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"412_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"881_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_16MCT32TGBn7SiaTscfUog4wQbJUDVbsDR": 1,
		"460_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1
	}
}