{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "O que é fé? O que a Bíblia diz sobre a fé?",
			"body": "Fé é acreditar que uma coisa é verdade e agir de acordo com essa crença. Todo mundo tem fé em alguma coisa. A Bíblia diz que devemos ter fé em Deus e no Seu poder para mudar nossa vida. Somos salvos pela fé em Jesus.\n\n#O que a Bíblia diz sobre a fé?\n1. Fé é acreditar, mesmo sem ver\n- “Ora, a fé é a certeza daquilo que esperamos e a prova das coisas que não vemos.” - Hebreus 11:1 – não podemos ver Deus, nem o Céu. Ter fé em Deus é acreditar mesmo sem ver.\n\n2. Deus se agrada com a fé\n- “Sem fé é impossível agradar a Deus, pois quem dele se aproxima precisa crer que ele existe e que recompensa aqueles que o buscam.” - Hebreus 11:6 – se você não crê em Deus, como poderá aceitar Jesus como Seu filho, que morreu por você?\n\n3. Deus te ajuda a ter fé\n- “Pois vocês são salvos pela graça, por meio da fé, e isto não vem de vocês, é dom de Deus;” - Efésios 2:8 – para ser salvo você precisa compreender que Jesus morreu por seus pecados, aceitar isso como verdade e agir, declarando-O como seu salvador. Isso é fé. Deus nos ajuda a ter fé, dando entendimento e convicção da verdade.\n\n4. Fé é uma escolha\n- A fé não implica falta de evidência. Jesus deu muita evidência aos discípulos para acreditarem (Atos dos Apóstolos 1:3). Ter fé é acreditar na evidência. Eu posso não crer que o sol vai nascer amanhã, mesmo com a evidência de ter sempre amanhecido todos os dias de minha vida. A fé é uma escolha.\n\n#Que significa ter fé?\n1. Compreensão\n- Para ter fé, é preciso compreender aquilo em que você acredita. Sem compreensão não há fé verdadeira, só uma aceitação cega sem utilidade. Alguém pode explicar para você qual ônibus você precisa pegar mas se você não compreender não vai ajudar.\n\n2. Aceitação\n- Quando você compreende, você precisa decidir se aceita como verdade ou não. Você pode compreender as instruções para pegar o ônibus mas achar que estão erradas. Ter fé implica acreditar que é verdade.\n\n3. Ação\n- Agir prova que você tem fé. Se você não pegar o ônibus depois de ouvir as instruções, será que você acreditou mesmo na informação? Uma nova crença muda naturalmente coisas em sua vida.\n\nTodo mundo tem fé e vive de acordo com sua fé. Quem tem fé que o sol vai nascer amanhã dorme sem preocupar com isso durante a noite. Quem tem fé que a ciência é o caminho para a verdade procura aprender mais da ciência. Quem tem fé que Deus existe tenta agradá-Lo.\n\nNossa fé em Deus vai aumentado na medida em que compreendemos mais. Por isso é muito importante estudar a Bíblia para entender o que Deus tem para você e aceitar essas verdades. Isso depois será refletido em sua vida diária (Tiago 2:22). A fé leva à ação.",
			"added": 1552851032
		},
		{
			"topic_id": 2,
			"title": "A fé sem obras é morta - o que isso significa?",
			"body": "A Bíblia diz que a fé sem obras é morta porque a verdadeira fé salvadora produz uma mudança na vida de quem crê. A velha vida não pode continuar. A pessoa salva por Jesus tem o coração voltado para o bem e isso se reflete em sua vida.\n\nTiago 2:17-19 diz que as obras dão vida à fé. São as nossas obras que provam que temos fé em Jesus. Sem obras que revelam uma vida dedicada a Deus, a fé é inútil.\n\n#As obras são necessárias para a salvação?\nNão, as obras não nos salvam. A Bíblia é muito clara: apenas a fé em Jesus nos salva (Efésios 2:8-9). Não podemos nem precisamos fazer nada para merecer a salvação. Com sua morte e ressurreição, Jesus nos dá acesso gratuito à salvação, através da fé.\n\nA salvação é um presente de Deus, que Ele nos dá porque Ele é bom. Ele não nos salva por causa de nosso mérito. Ninguém consegue atingir o nível de perfeição de Deus para merecer a salvação. Somente a fé no poder de Jesus pode nos salvar (Romanos 3:23-24).\n\n#Então por que a fé sem obras é morta?\nA fé sem obras é morta porque não fez diferença nenhuma na vida da pessoa. A fé salvadora em Jesus implica arrependimento dos pecados e a transformação do coração (2 Coríntios 5:17). Quando o Espírito Santo entra no coração na conversão, surge o desejo de seguir Jesus e abandonar o pecado. Essa mudança interior vai depois se refletir nas ações exteriores.\n\nNossas crenças influenciam nossas ações. Se uma pessoa diz que tem fé em Jesus mas isso não afeta sua vida de maneira nenhuma, essa fé é suspeita. Quem é salvo por Jesus vai mostrar os frutos dessa fé em sua vida (Mateus 7:18-20).\n\nSe a fé em Jesus é apenas acreditar, até os demónios acreditam! A fé salvadora é algo maior, que mexe com o coração e transforma a vida. A fé nos leva a agir. Quem ama a Deus também ama seus irmãos e ama o bem (1 João 4:20-21).\n\nAs boas obras não salvam mas são a prova que somos salvos. Esse é nosso objetivo na nossa nova vida com Jesus: realizar as boas obras que Deus preparou para nós (Efésios 2:10).",
			"added": 1552851106
		}
	],
	"topic_vote": {
		"1_12v6isNzUBMu7qmZosCrKuhRgeu1qPiUbs": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_12v6isNzUBMu7qmZosCrKuhRgeu1qPiUbs": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1
	},
	"next_comment_id": 16,
	"comment": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 1,
				"body": "Ora, a fé é a certeza daquilo que esperamos e a prova das coisas que não vemos.\nPois foi por meio dela que os antigos receberam bom testemunho.\nPela fé entendemos que o universo foi formado pela palavra de Deus, de modo que o que se vê não foi feito do que é visível.\nPela fé Abel ofereceu a Deus um sacrifício superior ao de Caim. Pela fé ele foi reconhecido como justo, quando Deus aprovou as suas ofertas. Embora esteja morto, por meio da fé ainda fala.\nPela fé Enoque foi arrebatado, de modo que não experimentou a morte; \"ele já não foi encontrado porque Deus o havia arrebatado\", pois antes de ser arrebatado recebeu testemunho de que tinha agradado a Deus.\nSem fé é impossível agradar a Deus, pois quem dele se aproxima precisa crer que ele existe e que recompensa aqueles que o buscam.\nPela fé Noé, quando avisado a respeito de coisas que ainda não se viam, movido por santo temor, construiu uma arca para salvar sua família. Por meio da fé ele condenou o mundo e tornou-se herdeiro da justiça que é segundo a fé.\nPela fé Abraão, quando chamado, obedeceu e dirigiu-se a um lugar que mais tarde receberia como herança, embora não soubesse para onde estava indo.\nPela fé peregrinou na terra prometida como se estivesse em terra estranha; viveu em tendas, bem como Isaque e Jacó, co-herdeiros da mesma promessa.\nPois ele esperava a cidade que tem alicerces, cujo arquiteto e edificador é Deus.\nPela fé, Abraão — e também a própria Sara, apesar de estéril e avançada em idade — recebeu poder para gerar um filho, porque considerou fiel aquele que lhe havia feito a promessa.\nAssim, daquele homem já sem vitalidade originaram-se descendentes tão numerosos como as estrelas do céu e tão incontáveis como a areia da praia do mar.\nTodos estes ainda viveram pela fé, e morreram sem receber o que tinha sido prometido; viram-nas de longe e de longe as saudaram, reconhecendo que eram estrangeiros e peregrinos na terra.\nOs que assim falam mostram que estão buscando uma pátria.\nSe estivessem pensando naquela de onde saíram, teriam oportunidade de voltar.\nEm vez disso, esperavam eles uma pátria melhor, isto é, a pátria celestial. Por essa razão Deus não se envergonha de ser chamado o Deus deles, pois preparou-lhes uma cidade.\nPela fé Abraão, quando Deus o pôs à prova, ofereceu Isaque como sacrifício. Aquele que havia recebido as promessas estava a ponto de sacrificar o seu único filho,\nembora Deus lhe tivesse dito: \"Por meio de Isaque a sua descendência será considerada\".\nAbraão levou em conta que Deus pode ressuscitar os mortos; e, figuradamente, recebeu Isaque de volta dentre os mortos.\nPela fé Isaque abençoou Jacó e Esaú com respeito ao futuro deles.\nPela fé Jacó, à beira da morte, abençoou cada um dos filhos de José e adorou a Deus, apoiado na extremidade do seu bordão.\nPela fé José, no fim da vida, fez menção do êxodo dos israelitas do Egito e deu instruções acerca dos seus próprios ossos.\nPela fé Moisés, recém-nascido, foi escondido durante três meses por seus pais, pois estes viram que ele não era uma criança comum, e não temeram o decreto do rei.\nPela fé Moisés, já adulto, recusou ser chamado filho da filha do faraó,\npreferindo ser maltratado com o povo de Deus a desfrutar os prazeres do pecado durante algum tempo.\nPor amor de Cristo, considerou a desonra riqueza maior do que os tesouros do Egito, porque contemplava a sua recompensa.\nPela fé saiu do Egito, não temendo a ira do rei, e perseverou, porque via aquele que é invisível.\nPela fé celebrou a Páscoa e fez a aspersão do sangue, para que o destruidor não tocasse nos fihos mais velhos dos israelitas.\nPela fé o povo atravessou o mar Vermelho como em terra seca; mas, quando os egípcios tentaram fazê-lo, morreram afogados.\nPela fé caíram os muros de Jericó, depois de serem rodeados durante sete dias.\nPela fé a prostituta Raabe, por ter acolhido os espiões, não foi morta com os que haviam sido desobedientes.\nQue mais direi? Não tenho tempo para falar de Gideão, Baraque, Sansão, Jefté, Davi, Samuel e os profetas,\nos quais pela fé conquistaram reinos, praticaram a justiça, alcançaram o cumprimento de promessas, fecharam a boca de leões,\napagaram o poder do fogo e escaparam do fio da espada; da fraqueza tiraram força, tornaram-se poderosos na batalha e puseram em fuga exércitos estrangeiros.\nHouve mulheres que, pela ressurreição, tiveram de volta os seus mortos. Alguns foram torturados e recusaram ser libertados, para poderem alcançar uma ressurreição superior.\nOutros enfrentaram zombaria e açoites, outros ainda foram acorrentados e colocados na prisão,\napedrejados, serrados ao meio, postos à prova, mortos ao fio da espada. Andaram errantes, vestidos de pele de ovelhas e de cabras, necessitados, afligidos e maltratados.\nO mundo não era digno deles. Vagaram pelos desertos e montes, pelas cavernas e grutas.\nTodos estes receberam bom testemunho por meio da fé; no entanto, nenhum deles recebeu o que havia sido prometido.\nDeus havia planejado algo melhor para nós, para que conosco fossem eles aperfeiçoados.\n\n- Hebreus 11:1-40",
				"added": 1552850903
			},
			{
				"comment_id": 2,
				"body": "#O que é fé? O que a Bíblia diz sobre a fé?\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_12v6isNzUBMu7qmZosCrKuhRgeu1qPiUbs/O+que+f+O+que+a+B+blia+diz+sobre+a+f\n\n#A fé sem obras é morta - o que isso significa?\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:2_12v6isNzUBMu7qmZosCrKuhRgeu1qPiUbs/A+f+sem+obras+morta+o+que+isso+significa",
				"added": 1552851170
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 3,
				"body": "#Filosofia - Claudio Costa\n\nO objetivo do canal é essencialmente educativo: expor introdutoriamente ideias filosóficas de maior importância.\n- https://www.youtube.com/user/ruvstof",
				"added": 1552851286
			},
			{
				"comment_id": 4,
				"body": "#Robert Fogelin\nRobert John Fogelin foi um filósofo americano. Foi professor de filosofia e professor Sherman Fairchild nas humanidades do Dartmouth College, onde lecionou desde 1980. Ele foi eleito membro da Academia Americana de Artes e Ciências em 2005.\n- http://libgen.io/search.php?req=Robert%20J.%20Fogelin&column=author",
				"added": 1552854287
			},
			{
				"comment_id": 5,
				"body": "#Filosofia – Livros em PDF\n- https://farofafilosofica.com/category/livros-e-bibliografias/filosofia-livros-em-pdf/",
				"added": 1552858934
			},
			{
				"comment_id": 6,
				"body": "#A Ética segundo Immanuel Kant\n\n- https://youtu.be/w16fiPorHJY",
				"added": 1552858951
			},
			{
				"comment_id": 7,
				"body": "#Kant: É possível a metafísica como ciência?\n\n#\"Duas coisas enchem meu coração de admiração e veneração sempre renovadas e crescentes: o céu estrelado sobre mim e a lei moral dentro de mim\".\n\nO filósofo alemão Immanuel Kant (1724-1804), merecidamente, figura entre as estrelas de primeira grandeza no céu estrelado sobre nós, a saber: Sócrates, Platão e Aristóteles, por exemplo. Neste artigo recortaremos o percurso de Kant ao indagar sobre a possibilidade da metafísica como ciência e, oportunamente veremos como este monumental filósofo funda a ética na racionalidade. O famoso imperativo categórico nada mais é que a razão (independente da religião) fundando a \"lei moral dentro de nós\".\n\nPara compreendermos a filosofia kantiana, convém contextualizar o momento histórico no qual suas teorias foram desenvolvidas. O filósofo francês René Descartes (1596-1650), aplicando um método de raciocínio absolutamente lógico, numa dieta sem precedentes, reduzira a compreensão da existência humana em res cogito (coisa pensante) e res extensa (coisa que possui extensão): corpo e mente. Kant foi herdeiro deste dualismo cartesiano, assim como também vivera a influência do surgimento da mecânica newtoniana. Com a física de Isaac Newton, a implicação da relação fenomenológica causa-efeito fora estabelecida. A ciência físico-matemática impõe seus sistemas de leis.\n\nA física trata da realidade, de fatos mensuráveis e matematicamente demonstráveis. Quanto à metafísica, o termo foi utilizado pela primeira vez por Aristóteles para distingüir seus escritos de física daqueles que estavam para \"além\" da física. A metafísica se ocupa de abstrações intangíveis e não demonstráveis empiricamente (pela experiência) tais como a existência de objetos transcendentes, como Deus ou a Alma, por exemplo.\n\nNo início da obra Crítica da Razão Pura, Kant afirma que todo conhecimento começa com a experiência, mas logo à seguir esclarece que isso não prova que todo ele derive da experiência. Nossa mente nos pré-condiciona a alguns conhecimentos sem que haja comprovação de sua veracidade pela experiência, impressões dadas pelos sentidos.\n\nO tempo e o espaço, por exemplo, são denominados conhecimento \"a priori\" porque nossa faculdade de inteligir esses conceitos são dados à nossa mente sem que haja necessidade de uma comprovação empírica.\n\nTempo e espaço são elementos apriorísticos porque somos (res extensa), pensamos (res cogito), enfim, quando \"existimos\" já contamos com eles. As demais interações que tivermos com o mundo partirão do pressuposto de que ocupamos um lugar, num tempo.\n\nJá nossos sentidos (visão, olfato, paladar, audição e tato) nos proporcionam conhecimentos - do mundo que nos cerca e de todos os objetos que nos cercam neste mundo - por meio da sensibilidade que vem da experiência de ter tido algum tipo de contato com o que se nos apresenta. A esse tipo de conhecimento Kant denominou \"a posteriori\".\n\nDentre os problemas sobre os quais o filósofo de Königsberg se debruça está a busca em saber se seria possível estabelecer a metafísica como ciência (lembremo-nos que ciência para Kant é a mecânica newtoniana). Entendendo-se como ciência um conhecimento universal e necessário. Universalidade significa exatamente o que a palavra diz: universal porque se cumpre em todos os casos ou que se vale sem exceção.\n\nJá necessidade quer dizer que um enunciado é logicamente necessário quando sua negação implica uma contradição, por exemplo: se definirmos um triângulo como uma figura de três lados, logo, uma figura de três lados é um triângulo. Nas palavras de Mario Porta: \"a lógica explicita a legalidade da Razão, sendo essa (a razão) a fonte da necessidade presente naquela (a lógica)\". Ciência seria conhecimento que reune as qualidades de universal e necessário . A matemática, por exemplo, trata-se de um juízo (entendimento) universal e necessário. Retomando a indagação: é possível a metafísica como ciência?\n\nKant conclui que não pois é impossível que comprovemos, através da racionalidade, a existência ou não de algo como a metafísica que, se existe, está fora do âmbito do que se estabeleceu como ciência (Universalidade e Necessidade).\n\nDe fato, é mesmo irracional querer comprovar com a razão algo que corre por fora dos trilhos por onde serpenteiam os vagões da racionalidade. A razão não tem como dar conta do que foge à possibilidade de entendimento ou seja, da inteligibilidade do sujeito cognoscente e a inexata metafísica, como alma d outro mundo, vagueia para além dos domínios da razão.\n\n#Saiba Mais:\n\n- Crítica da Razão Pura - Immanuel Kant Fundação Calouste Gulberkian\n\n- A filosofia a partir de seus problemas - Mário Ariel González Porta Ed. Loyola",
				"added": 1552859051
			},
			{
				"comment_id": 8,
				"body": "#Immanuel Kant\n\nImmanuel Kant (1724-1804) é a figura central da filosofia moderna. Ele sintetizou o racionalismo e o empirismo do início da era moderna, estabeleceu os termos para grande parte da filosofia do século XIX e XX e continua exercendo hoje uma influência significativa na metafísica, na epistemologia, na ética, na filosofia política, na estética e em outros campos. A idéia fundamental da \"filosofia crítica\" de Kant - especialmente em suas três Críticas: a Crítica da Razão Pura (1781, 1787), a Crítica da Razão Prática (1788) e a Crítica do Poder do Julgamento (1790) - é humana autonomia. Ele argumenta que o entendimento humano é a fonte das leis gerais da natureza que estruturam toda a nossa experiência; e que a razão humana se dá a lei moral, que é nossa base para a crença em Deus, liberdade e imortalidade. Portanto, o conhecimento científico, a moralidade e a crença religiosa são mutuamente consistentes e seguros porque todos se baseiam na mesma base da autonomia humana, que é também o fim final da natureza de acordo com a cosmovisão teleológica do julgamento reflexivo que Kant introduz para unificar a teoria teórica. e partes práticas de seu sistema filosófico.\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fkant%2F",
				"added": 1552859161
			},
			{
				"comment_id": 9,
				"body": "#Aristóteles\n\nAristóteles (384-322 a.C.E.) é um dos maiores filósofos de todos os tempos. Julgado apenas em termos de sua influência filosófica, apenas Platão é seu par: as obras de Aristóteles moldaram séculos de filosofia desde a antiguidade tardia até a Renascença, e até hoje continuam a ser estudadas com interesse aguçado e não antiquário. Um prodigioso pesquisador e escritor, Aristóteles deixou um grande corpo de trabalho, talvez totalizando até duzentos tratados, dos quais aproximadamente trinta e um sobrevivem. Seus escritos existentes abrangem uma ampla gama de disciplinas, da lógica, metafísica e filosofia da mente, através da ética, teoria política, estética e retórica, e em campos essencialmente não-filosóficos como a biologia empírica, onde ele se destacou na observação detalhada de plantas e animais. e descrição. Em todas essas áreas, as teorias de Aristóteles forneceram iluminação, encontraram resistência, suscitaram debates e, em geral, estimularam o interesse constante de um público permanente.\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Faristotle%2F",
				"added": 1552859383
			},
			{
				"comment_id": 10,
				"body": "#David Hume\n\nGeralmente considerado um dos mais importantes filósofos a escrever em inglês, David Hume (nascido em 1711, 1776) também era bem conhecido em seu tempo como historiador e ensaísta. Um mestre estilista em qualquer gênero, suas principais obras filosóficas - Um Tratado da natureza humana (1739-1740), As investigações sobre o entendimento humano (1748) e sobre os Princípios da moral (1751), bem como seus diálogos pós-humanos sobre o natural Religião (1779) - permanece ampla e profundamente influente.\n\nEmbora os contemporâneos mais conservadores de Hume tenham denunciado seus escritos como obras de ceticismo e ateísmo, sua influência é evidente na filosofia moral e nos escritos econômicos de seu amigo íntimo Adam Smith. Kant relatou que o trabalho de Hume o despertou de seu “sono dogmático” e Jeremy Bentham observou que a leitura de Hume “fez as escamas caírem” de seus olhos. Charles Darwin considerou seu trabalho como uma influência central na teoria da evolução. As diversas direções em que esses escritores tomaram o que aprenderam ao lê-lo refletem tanto a riqueza de suas fontes quanto a ampla gama de seu empirismo. Hoje, os filósofos reconhecem Hume como um expoente completo do naturalismo filosófico, como um precursor da ciência cognitiva contemporânea, e como a inspiração para vários dos mais significativos tipos de teoria ética desenvolvidos na filosofia moral contemporânea.\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fhume%2F",
				"added": 1552859486
			},
			{
				"comment_id": 11,
				"body": "#Filosofia da Religião\n\nFilosofia da religião é o exame filosófico dos temas e conceitos envolvidos nas tradições religiosas, bem como a tarefa filosófica mais ampla de refletir sobre questões de significado religioso, incluindo a natureza da religião em si, conceitos alternativos de Deus ou realidade última, eo significado religioso de características gerais do cosmos (por exemplo, as leis da natureza, o surgimento da consciência) e de eventos históricos (por exemplo, o terremoto de 1755 em Lisboa, o Holocausto). A filosofia da religião também inclui a investigação e avaliação de visões de mundo (como o naturalismo secular) que são alternativas às visões de mundo religiosas. A filosofia da religião envolve todas as principais áreas da filosofia: metafísica, epistemologia, teoria do valor (incluindo teoria moral e ética aplicada), filosofia da linguagem, ciência, história, política, arte e assim por diante. A seção 1 oferece uma visão geral do campo e sua importância, com as seções subsequentes cobrindo os desenvolvimentos no campo desde meados do século XX. Essas seções abordam a filosofia da religião como praticada principalmente (mas não exclusivamente) em departamentos de filosofia e estudos religiosos que estão na tradição amplamente analítica. A entrada conclui com destaque para a crescente amplitude do campo, como mais tradições fora das fés abraâmicas (judaísmo, cristianismo e islamismo) tornaram-se o foco de importantes trabalhos filosóficos.\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fphilosophy-religion%2F",
				"added": 1552859561
			},
			{
				"comment_id": 15,
				"body": "#Argumentos morais para a existência de Deus\n\nArgumentos morais para a existência de Deus formam uma diversificada família de argumentos que raciocinam desde alguma característica da moralidade ou da vida moral até a existência de Deus, geralmente entendida como um criador moralmente bom do universo. Os argumentos morais são importantes e interessantes. Eles são interessantes porque avaliar sua solidez requer atenção a praticamente todas as questões filosóficas importantes tratadas na metaética. Eles são importantes por causa de sua proeminência em argumentos apologéticos populares de crença religiosa. Provas disso podem ser encontradas na surpreendente popularidade do mero cristianismo de C. S. Lewis (1952), que é quase certamente o livro de apologética mais vendido no século XX, e que começa com um argumento moral para a existência de Deus. Muitas pessoas comuns consideram a religião como fornecendo, de alguma forma, uma base ou fundamento para a moralidade. Este fato pode parecer favorecer os argumentos religiosos para a moralidade, em vez de argumentos morais para a crença religiosa, mas se alguém acredita que a moralidade é de alguma forma \"objetiva\" ou \"real\", e que essa realidade moral requer explicação, argumentos morais para a realidade de Deus sugerir-se. A aparente conexão entre moralidade e religião parece, para muitas pessoas, apoiar a afirmação de que as verdades morais requerem um fundamento religioso, ou podem ser melhor explicadas pela existência de Deus, ou algumas qualidades ou ações de Deus.\n\nApós alguns comentários gerais sobre argumentos teístas e um breve histórico de argumentos morais, este ensaio discutirá várias formas diferentes do argumento moral. Uma distinção importante é aquela entre argumentos morais que são de natureza teórica e argumentos práticos ou pragmáticos. Os primeiros são melhor entendidos como argumentos que começam com alegados fatos morais e argumentam que Deus é necessário para explicar esses fatos, ou pelo menos que Deus fornece uma melhor explicação deles do que os relatos seculares podem oferecer. Os últimos tipicamente começam com reclamações sobre algum bem ou fim que a moralidade exige e argumentam que este fim não é atingível a menos que Deus exista. Se essa distinção é difícil e rápida será uma das questões a serem discutidas, pois alguns argumentam que argumentos práticos por si mesmos não podem ser a base da crença racional. Para responder a essas preocupações, os argumentos práticos podem incluir também uma dimensão teórica.\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fmoral-arguments-god%2F",
				"added": 1552862247
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 12,
				"body": "#Devils Line\n\nVampiros parecem estar vivendo entre os humanos, mas isto ainda é uma dúvida para o governo pois suas aparências são idênticas a nós e não precisam beber sangue. Mas quando eles tem algum desejo ou se irritam, podem se tornar monstros incontroláveis. Acompanhamos Tsukasa, um estudante universitário que foi resgatado do ataque de um vampiro, e Anzai, seu salvador e membro de uma força-tarefa policial sombria o qual se especializaram em crimes relacionados a estes seres.\n\n\n\n- https://www.superanimes.site/anime/devils-line",
				"added": 1552860805
			},
			{
				"comment_id": 13,
				"body": "#Devil May Cry\n\nO anime é Baseado na serie de jogos de mesmo nome da produtora Capcom, segue abaixo uma introdução a história do personagem principal. Em Devil May Cry o personagem principal se chama Dante, um rapaz meio-demônio, meio-humano. Há 2000 anos, a humanidade era submissa aos demônios, porém um dia um poderoso demônio simpatizou com os humanos e sozinho prendeu toda sua espécie no inferno. Esse demônio ficou conhecido como o Lendário Cavaleiro das Trevas Sparda. Ele viveu entre os humanos, sem ser percebido, por quase dois milênios e teve dois filhos com uma humana chamada Eva. Seus filhos Dante e Vergil herdaram seus poderes. Sparda, deu a cada um deles uma espada de poderes sobrenaturais e Eva deu a cada um, um colar.\n\n\n- https://www.superanimes.site/anime/devil-may-cry",
				"added": 1552860831
			},
			{
				"comment_id": 14,
				"body": "#Golden Boy\n\nGolden Boy é uma série de mangá escrita por Tatsuya Egawa, sobre um jovem de 25 anos chamado Oe Kintaro, que viaja pelo Japão em sua bicicleta. O mangá foi originalmente serializado na revista Super Jump da Shueisha, em 1992. Recebeu adaptação para anime, no formato OVA com 6 episódios, produzidos pela Shueisha em conjunto com a KSS em 1995. Apesar das cenas de nudez, orgasmo, e masturbação feminina, a série de anime não é estritamente do gênero hentai, ao contrário do mangá, que se torna pornográfico a partir do segundo volume.\n\n\n\n- https://www.superanimes.site/ova/golden-boy",
				"added": 1552861029
			}
		]
	},
	"comment_vote": {}
}