{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1632058450,
			"title": "Ataque",
			"body": "Um ataque já está programado, ele ira parecer acidente natural, por isso já estão divulgando a possibilidade dele acontecer (vulcão nas Ilhas Canárias). Na realidade é uma retaliação da guerra comercial. Vem sendo planejado a muito tempo, as ilhas é um ponto turísticos de remadores muito material de competição chega com fiscalização reduzida na ilha. A muito tempo eles simulão os efeitos de uma erupção nesse vulcão.  Uma tecnologia nuclear será utilizada, numa profundidade que a assinatura de radiação se confunde com a natural. Os testes foram realizados na Corea do norte, um pais fechado que só serviu de cortina de fumaça.  Muitas autoridades mundias sabem disso, mas esperam lucra nas bolsas, e na reconstrução das cidades costeiras. Essa informação privilegiada vale mais dinheiro que ouro. Por isso eles mantem o segredo não ha mais patriotas no mundo se a população não souber está valendo.",
			"added": 1632058449
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 1,
				"body": "> [zerohope](#comment_1_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT): Ten people and you get ten opinions. Thank you for your replies.From the replies here:-80% are convinced that corona is a hoax or at least have strong doubts about it-20% believe that corona is what \"they\" told us [...]\n\né interessante ver que não é só brasil que essa pandemia parece ter sido criada pelos políticos. Aqui houve muito dinheiro sendo liberado para classe politica controlar a pandemia, regras que dificultavam a corrupção forma removidas. As eleições também forma prejudicadas. O interesse no isolamento social parace ser o principal foco. Pois pessoas isoladas são mais susceptíveis a lavagem cerebral. Essa pandemia pareceu um esforço coordenado. Pode ser um grupo muito rico que influenciou toda classe politica do mundo. Pode ter sido feito utilizando inteligencia artificial  e dinheiro. Mas aqui no Brasil houve mortes que pareceram assassinatos. Pessoas chegaram com pequenos problemas no hospital e morreram no outro dia.  Muitos dos que morreram foram de outras causas. Mas o medo faz as pessoas pararem de raciocinar. Hoje diria que uns 30% aqui em Sergipe no Brasil não está com medo do corona vírus. \n\nIt is interesting to see that it is not just Brazil that this pandemic seems to have been created by politicians. Here, a lot of money was released for the political class to control the pandemic, rules that hindered corruption were removed. The information was also damaged. The interest in social isolation seems to be the main focus. Because people are more susceptible to brainwashing. This pandemic created a coordinated effort. It may be a very rich group that has influenced every political class in the world. It may have been done using artificial intelligence and money. But here in Brazil there were deaths that looked like murders. People arrived with minor problems at the hospital and died the other day. Many of those who died were of other causes. But fear stops people from reasoning. Today I would say that some 30% here in Sergipe in Brazil is not afraid of the corona",
				"added": 1607864879
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 2,
				"body": "Yes, it is a scam.",
				"added": 1607884995
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 3,
				"body": "Uma vez eu copiei uma pagina de internet que descobrir por acaso. A pagina continha vários termos de buscas, quase infinito, um verdadeiro spam de buscador e essa pagina apontava para um site. Eu fiz uma copia e apontei para meu site, assim o google indexava e aumentava as visualizações do site. Mas de alguma forma depois de uma semana o google tirava a pagina da lista de indexação. Para verificar se ainda estava na lista eu coloquei uma tag de joaofilho9000 ela não existia na internet na época assim só aparecia no buscador se o Google indexasse o spam. Depois de alguns meses eu enjoei e deixeis essa brincadeira para lá. O problema é que o Yahoo continuo indexando essa pagina por algum tempo  e alguém copiou minha pagina. Muitos copiaram e joaofilho9000 que não existia na internet passou a existir aos centenas de milhares, apontando para diferentes sites. E eu nem me dei conta dessa tragedia porque joaofilho9000 era meu e-mail pessoal.  Eu coloquei no ar por volta de  2006, imagine quantas coias de la para cá foram feitas, centenas de milhares, uma loucura. Fim das contas, investigadores acaram que eu tinha alguma coisa com essa tonelada de sites. Como se alguém que vai fazer coisa ilegal coloca seu nome nisso. Mas eles não veem que não tem nenhum elo ligando esse milhares de sites é só o efeito copia e cola da internet. O problema é que esse investigadores invadem meu computador todo tempo, coloque um Firewall prensense o IDS snort, tudo que você imaginar , mas eles invadem,  com a tecnologia de ponta, usando falhas que só são divulgas na internet messes depois. E pasmem o IP que mais invade meu computador é do google. Eu estou escrevendo essa historia para eles lerem e porque sei que aqui é resiliente a censura. \" Não me importa que investiguem meu computador, meus dados, minha vida,  mas vocês estão deixando minha internet muito lenta. Se meu computador não ficasse tao lento eu não ficava formatando toda hora.  Vocês já pegaram meu lixo, já me seguiram, já grampearam, já fizeram tudo. Eu não sou um gênio , nunca criei nada relevante, como teria escondido alguma coisa dessa vigilancia toda. Não existe elo nenhum é só o efeito de copia e cola da internet.",
				"added": 1636680829
			}
		]
	},
	"comment_vote": {
		"6_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1
	}
}