{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "不要让海量的信息淹没了自我或幸福",
			"body": "这次回老家一趟，看到的景象令我产生很多感慨。不管是到亲戚家，还是在路上，不管是大人，还是屁大的小孩，都是低头的手机族，除了那些年龄大不咋会用手机的老人外。刷微信，抢红包，发视频，晒图片，都忙的不亦乐乎。我原先也沉浸于其中不亦乐乎，夜夜零点。\n&nbsp;  \n      可当自己渐觉空虚时，我及时抽身而出。看到全民沉浸其中，我忍不住发问，整天刷微信抢红包到底感觉如何？没事干，图热闹图玩呗。唉，有时候放下手机后也挺空虚，无聊。??\n&nbsp;  \n       我似乎看到微信像一条无形却吸引力十足的牢固的绳索，牵住了无以计数人的鼻子，让他们忘了时间，忘了自己心里的豪情梦想。我在想，比尔盖茨，马云这些创业者是否也整天刷微信抢红包呢？应该不是，他们都特明白自己想要什么，明白自己该为想要的生活  想实现的梦想去扎扎实实的做点什么。他们的时间金贵，应该不舍得这样的耗费自己的生命。?\n&nbsp;  \n       这也促使我认清了创大业者和一般人的区别：一般人满足滞留在自己的现状，而创业的人目光总是越过了现状，看向未来，始终热血沸腾地凝望着自己的青云之志。但作为人，也总有一样的地方。这就是每个人都有个朴素的愿望：过得好，过的幸福。?\n&nbsp;  \n       可在这4G时代，怎样才叫过的好，过的幸福呢？这答案恐怕是见仁见智了。下面是我自己思索。\n&nbsp;  \n       人最本质的需要是被认可，不仅仅是认可你的职业、地位、经济收入等外显性的东西，更重要的是认可你的形象，精神，你的梦想。一句话，需要认可就是需要伯乐。\n&nbsp;  \n     可伯乐难遇，千古共叹。俞伯牙与钟子期的高山流水酬知音的故事令多少人为之神往，又令多少人为之心碎。我也反复的追问自己？??自己的伯乐在哪里？英明睿智的领导  知心的铁杆朋友，赏识你的贵人，在事业发展的关键时刻给你点拨的导师。这些算是对伯乐的初步印象，以为伯乐定是别人，而自己是一匹等待慧眼的千里马。\n&nbsp;  \n       岁月荏苒，白驹过隙。转眼间已到中年，渐渐的明白，真正的伯乐一直在身边，只是自己懵懂不知罢了。别人对自己才华业绩的认可?固然可贵，但真正的伯乐却在于自己对自我的准确把握和认知，对自我形象    自我发展   自我价值实现的认可与满足上。用耳闻能详的例子来说，南唐后主李煜要是不去当皇帝，而是做适合他至情至性的才子诗人，每日吟诗雅歌，留一段与娥皇女英的浪漫佳话，那该是多么的幸福。你内敛文静就不要强求豪放洒脱，他执意功成名就很难欣赏南山东篱下的淡雅芬芳的菊花。\n&nbsp;  \n       现今  生活在4G这物质充裕与高科技运用更便捷的时代，飞机高铁私家车使相见变得指日可待，而一部智能手机就使世界鲜活地呈现在你眼前。想吃饭美团打折网购，相隔千里想见随时就可视频，手机里的名单越来越多，微信天天刷。可内心却渐渐感到空虚，幸福感一点点的降低，为什么呢？ 在一个又一个的早晨与黄昏，在一次次的放下手机之后，我闭上双眼陷入沉思  求索。  \n&nbsp;  \n       为什么呢？我常在困惑中思索求解。最终悟得，很多人被海量的信息麻痹了神经淹没了自我，丧失了人生的目标，丧失了对自我的把握和追求（再加上眼睛生疾医生告诫，现在我基本除了工作原因就不咋看微信，我不愿在盲目的浏览，我有我的追求。）。人终究不同于他物，而是万物之灵长，这灵长两字实在深刻微妙。小时候就对张贤亮的《灵与肉》印象深刻，知道灵与肉相对，知道灵才是幸福的栖息地。长大后欲望之眼一路闪烁，物质和梦想交叠相错，难分彼此。闯荡到城市扎住了脚，高档小区内买了一百四十四平米的华屋美院。而汽车也只是不感冒没买。新鲜幸福了一段日子，一切又归于平淡，一切似乎又庸常无味。\n&nbsp;  \n       可见物质优渥并不代表心灵幸福愉悦。我用不着排斥物质享受以示清高，只要我不以物质为追求。我更喜欢用物质去创设自己喜欢的氛围，用钱营造生活的品味情调，以物质为工具更自由的做自己喜欢的事。\n&nbsp;  \n     这些年来，经常给僻远山区捐助?一些好的衣物（羽绒服已经捐了三件，大衣四件，其它的更多）及种类多样的课外书；一盆盆的各式绿色植物都被我安置在家里的角角落落，营造绿色的世界   触目怡爽的环境；给那些身处苦难中的人以真诚的帮助和祈祷（可惜去年我捐助过的那个得了白血病的孙菲菲最终还是不幸感染去世）；给身边的人带去更多的温馨欢乐。\n&nbsp;  \n      细细追思，自己作为一个从小就沉浸在看书的乐趣中长大的人，以后又学了文科教了书，深受儒家安贫乐道随适而安的熏陶浸润，生活简朴  淡泊，喜爱自然，喜欢远足，喜欢拍摄，喜欢读书，喜欢侍弄花草，看重真情，喜欢写点心灵文字抒发性灵寄托自己的家国情怀。?\n&nbsp;  \n        了解自己，做自己喜欢的事情，简单质朴，珍惜平淡日子里的点点滴滴的闪亮。除了用心的在工作里寻找并创造更多的快乐，我的业余生活也更充实而丰富，读读书，游游泳，练练瑜伽，写写感受，陪伴亲人，乐活当下。?\n&nbsp;  \n      一切源于找到了自我，听从内心找到梦想，并愉快地行走在路上。\n&nbsp;  \n      走在奔向梦想的路上，生活简单又充实，一切繁杂喧扰，自然被屏障在视野之外。\n",
			"added": 1525617167
		},
		{
			"topic_id": 2,
			"title": "“去中心化”时代的中心化现象",
			"body": "互联网时代的一个流行说法叫“去中心化”，然而，现实中的中心化现象却比过去更加突出了。这是为什么？\n&nbsp;  \n　　在信息传播领域，人人都是自媒体。这是典型的去中心化。但是，绝大多数人的信息被海量信息淹没了，每天总有那么几条信息“上头条”，成为比过去中心化时更热的热点。这是不是去中心化所产生的中心化现象？\n&nbsp;  \n　　移动互联网的普及，使连接无处不在。如果物联网实现，那么一切皆可连接。当连接点无限分散时，互联网的基础平台会越来越中心化。在中国，BAT越来越大，挤压得同业小公司很难生存。在全世界，互联网基础平台何尝不是如此？\n&nbsp;  \n　　在互联网商业领域，淘宝、微商实现了“人人皆可商业”。然而，淘宝却越来越大，成为商业领域的巨无霸，年营收超过中国半数以上省份的GDP。\n&nbsp;  \n　　上述现象，其实《长尾理论》中早就有预测。“长尾更长，大头更大”，可能是互联网时代的典型特征。\n&nbsp;  \n　　信息，使“去中心化”成就更大的中心\n&nbsp;  \n　　早期的互联网还不是去中心化的，比如门户网站，虽然在技术上是基于互联网，但在内容生产和传播上与传统媒体没有太大差异。\n&nbsp;  \n　　现在的互联网，其内容已经不再是专业或特定人群所产生，而是由全体网民共同参与、人人创造的结果。任何人，都可以在网络上表达自己的观点或发表原创内容。美国的Twitter、Facebook，国内的微信、博客等网络服务商所提供的服务都是去中心化的，任何参与者均可提交内容，网民共同进行内容协同创作或贡献。每一个网民均成为一个微小且独立的信息提供商，从而使得互联网更加扁平，内容生产更加多元化。\n&nbsp;  \n　　信息领域的去中心化，大致可以归纳为几点：1.人人可以成为信息内容生产者和传播源，即所谓的自媒体；2.除法律禁止外，信息源上传和传播没有门槛和审查；3.只要有需要，即使小众化信息，也可以通过无门槛的手段获取，如搜索引擎。\n&nbsp;  \n　　信息领域的去中心化，既是技术进步的结果，也是互联网的开放、共享精神的结果。开放，意味着信息源的多元化，能以自由意志传播信息。共享，意味着信息传播和获取的成本更低、更便利。\n&nbsp;  \n　　互联网时代，虽然信息源是去中心化的，但每天真正吸引注意力的是少数信息，其中“头条”仍然是影响力最大的信息。不论任何时代，注意力资源的稀缺永恒存在。正因如此，必然产生信息传播的筛选机制，并最终形成中心化的传播现象。\n&nbsp;  \n　　注意力资源的稀缺包括两方面：一是受众的注意力是有限的，不可能有无限多的时间接受无限多的信息。既然如此，只有在短时间内获取更有价值的信息；二是媒体的资源是稀缺的。如果说传统媒体“头版头条”是注意力焦点的话，电子媒体同样如此。所以“上头条”仍然是对稀缺资源的争夺。\n&nbsp;  \n　　对注意力资源和媒体稀缺资源的争夺，必然形成媒体对信息源的筛选，寻求最大公约数和最大吸引力。\n&nbsp;  \n　　信息筛选，包括网民个人筛选和媒体筛选。每个网民每天都能获取海量信息，但传播给他人的信息一定是经过筛选的。通常，对一个人有用的信息，对另一个人可能是垃圾信息。如果一个人总是在朋友圈传播垃圾信息，就可能被朋友圈“拉黑”。如果一个人一天只传播一条信息，那么一定会传播自认为对朋友圈最有用的信息。如果传播多条信息，一定会把自认为最有用的信息“置顶”。\n&nbsp;  \n　　媒体以传播信息为业，而电子媒体的显示界面，如PC显示屏、手机显示屏，比平台媒体更小，所以互联网的“上头条”比传统媒体的“上头版”更难。电子媒体为了把最有价值的信息传播出去，同样会对信息进行筛选。\n&nbsp;  \n　　媒体让有最大公约数和最大吸引力的信息“上头条”，“赢者通吃”现象再次发挥作用。因为“头条”信息有最大公约数和最大吸引力，而受众获取“头条”又能最便捷。如此，媒体领域的中心化现象就不可避免。\n&nbsp;  \n　　整体“去中心化”，局部“中心化”更突出\n&nbsp;  \n　　从整体看，信息传播去中心的趋势很明显。从局部看，中心化却更加突出了，比如“大V”、粉丝、群主等，都是典型的局部中心化现象。\n&nbsp;  \n　　整体的去中心化，是以过去的信息传播高门槛甚至垄断为对应参照的。互联网时代，局部意见领袖的角色反而被放大了。\n&nbsp;  \n　　传统媒体时代，由于信息传播受限，意见领袖的声音传播也是受限的，要么是“高冷”的意见领袖，要么是小范围、小领域的意见领袖。而互联网的出现，使意见领袖的声音可以超越空间，传递到更远的地方，所以，意见领袖比过去更多了。大一点的意见领袖，如“大V”、“公知”、“名嘴”；小一点的意见领袖，如群主、公众号。现在，微信群主的格局已经结构化了，比如家长群、社区群、兴趣群。\n&nbsp;  \n　　这些借助互联网工具兴起的局部中心化的意见领袖，角色不容忽视。\n&nbsp;  \n　　如果说去中心化将每个人的角色摊薄的话，那么局部的中心化将个体的角色又放大了。粉丝，就是互联网时代局部中心化的一个典型现象。马云、雷军、罗振宇、吴晓波等，他们就是利用互联网的便利，积累了相当大的粉丝量，形成了局部中心化现象。即使他们的传播带有强烈的商业化色彩，但相比过去的中心化传播，却有着更大的影响力。\n&nbsp;  \n　　苹果的传播，同样也是利用了局部中心化的作用。苹果的一个新品发布会，没有给媒体支付广告费，但吸引了全世界的自媒体传播，并影响到传统媒体跟进，堪称一种传播奇迹。\n&nbsp;  \n　　去中心化的思维，造就更大的中心化平台\n&nbsp;  \n　　能够吸引最小的单元参与，就能做成最大的事情。这就是去中心化的思维，达成中心化的结果。在互联网的平台领域和互联网商业领域都是如此。\n&nbsp;  \n　　每个时代都有这个时代的基础平台。互联网时代，如目前国内的BAT，国外的谷歌、Facebook等，都是互联网时代的基础平台。它们既是商业化的，又是免费的公共平台。因为免费，所以参与者是没有门槛的，能够造就中心化的事业。\n&nbsp;  \n　　美国的互联网平台，利用它的语言优势和影响力，甚至扩展成为世界的互联网平台。中国的互联网平台，虽然有语言障碍，但仍然持续向境外渗透。互联网时代的基础平台，有着强烈的垄断色彩，一旦被认同，就会对同业形成高强度的挤压。比如：中国的搜索引擎市场，百度几乎一统天下。\n&nbsp;  \n　　甚至有人提出一种观点：小型经济体，如新加坡、台湾、香港等，很难建立独立的互联网基础平台。这意味着，基础平台一定是中心化的，除非某个经济体是全封闭的。\n&nbsp;  \n　　一般而言，平台门槛越高，参与者越少，参与者的规模越大。比如：如果搜索引擎是收费的话，那么参与者以机构和高收入者为主。然而，互联网的基础平台恰恰几乎是免费的，免费的背后，还要有盈利的商业模式。有些基础平台虽然免费，但没有盈利的商业模式，比如博客、微博等，在技术的颠覆与迭代中，就很容易被淘汰。有些基础平台，初期不是免费的，但后来逐渐免费了。如在360之前，杀毒软件是商业行为，现在被360转变成为基础平台。\n&nbsp;  \n　　互联网的基础平台，现在看来都是流量入口。当互联网“连接一切”的时候，掌握流量入口是关键。掌握了流量入口，就能控制流量成本，带来衍生的商业模式。未来凡是流量入口的平台，都可能免费，都可能成为基础平台，哪怕现在是商业化的。所以，未来会有更多的商业项目，因为免费而成为公众平台。\n&nbsp;  \n　　谁能为最小的经营单元提供平台，谁就能够做成最大的事业。\n&nbsp;  \n　　阿里巴巴是第一个这样做的。它的第一批入驻的商户，都是无法跨越传统商业门槛的人，即所谓的C店商户。马云把这些商户聚集起来，做成了一个庞大的生意。但是未来的困境也在于此，因为阿里巴巴的门槛越来越高。\n&nbsp;  \n　　Uber也是如此。Uber在短期内成为一个巨型商业平台，平台的参与双方，专车是个体，租车客也是个体，是最小的经营单元。这是一个典型的中心化与去中心化的矛盾体。\n&nbsp;  \n　　像海尔这样的巨型企业，本来就是中心化的，却正在将自己变成一个去中心化的企业。海尔倡导的“员工创客化”，是将庞大的员工队伍变成若干个“小微组织”，这是去中心化的表现。同时，“企业平台化”，将公司变成投资平台、付薪平台，这又是中心化的举措。\n&nbsp;  \n　　这就很奇怪了，为什么在用去中心化的思维达成中心化的结果呢？\n&nbsp;  \n　　乔布斯曾说，普通岗位，一个人的效率可能是普通人的一二倍；创意岗位，一个人的效率可能是普通人员的几十倍。所以，苹果把普通部门都外包出去，只保留创意部门。\n&nbsp;  \n　　互联网时代，凡是可以不依赖创造力和想象力的东西，最终会被机器和计算机替代。对于创意岗位，创意与人员数量没有关系，甚至人员越少，创造力越强。所以，经营单元的创意化、去中心化是趋势。\n&nbsp;  \n　　互联网时代，原来被忽视的小众需求，通过互联网工具（如微信、微商）有了“配对”的可能。商业的本质就是“信息不对称”，互联网为发现信息不对称提供了工具。\n&nbsp;  \n　　也许未来还会有类似Uber这样的商业工具，将消费者的需求与厂商的供给“自动配对”，那么将会造成一个更大的反差：用去中心化的思维，造就更大的中心化平台。\n",
			"added": 1525617895
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}