{"next_paste_id":3,"next_comment_id":0,"paste":[{"paste_id":0,"description":"Lucas 18:9-14","body":"A alguns que confiavam em sua própria justiça e desprezavam os outros, Jesus contou esta parábola:\n\"Dois homens subiram ao templo para orar; um era fariseu e o outro, publicano.\nO fariseu, em pé, orava no íntimo: ‘Deus, eu te agradeço porque não sou como os outros homens: ladrões, corruptos, adúlteros; nem mesmo como este publicano.\nJejuo duas vezes por semana e dou o dízimo de tudo quanto ganho’.\n\"Mas o publicano ficou à distância. Ele nem ousava olhar para o céu, mas batendo no peito, dizia: ‘Deus, tem misericórdia de mim, que sou pecador’.\n\"Eu lhes digo que este homem, e não o outro, foi para casa justificado diante de Deus. Pois quem se exalta será humilhado, e quem se humilha será exaltado\".\n\nLucas 18:9-14","language":"text/plain","encrypted":false,"added":1595907446},{"paste_id":1,"description":"Nootrópicos e doping mental | Nerdologia","body":"Mattay, Venkata S., Joseph H. Callicott, Alessandro Bertolino, Ian Heaton, Joseph A. Frank, Richard Coppola, Karen F. Berman, Terry E. Goldberg, and Daniel R. Weinberger. \"Effects of dextroamphetamine on cognitive performance and cortical activation.\" Neuroimage 12, no. 3 (2000): 268-275.\nVarvel, S. A., and A. H. Lichtman. \"Evaluation of CB1 receptor knockout mice in the Morris water maze.\" Journal of Pharmacology and Experimental Therapeutics 301, no. 3 (2002): 915-924.\nDe Jongh, Reinoud, Ineke Bolt, Maartje Schermer, and Berend Olivier. \"Botox for the brain: enhancement of cognition, mood and pro-social behavior and blunting of unwanted memories.\" Neuroscience & biobehavioral reviews 32, no. 4 (2008): 760-776.\nHusain, Masud, and Mitul A. Mehta. \"Cognitive enhancement by drugs in health and disease.\" Trends in cognitive sciences 15, no. 1 (2011): 28-36.\nSnyder, Allan. \"Explaining and inducing savant skills: privileged access to lower level, less-processed information.\" Philosophical Transactions of the Royal Society B: Biological Sciences 364, no. 1522 (2009): 1399-1405.\nBostrom, Nick, and Anders Sandberg. \"Cognitive enhancement: methods, ethics, regulatory challenges.\" Science and engineering ethics 15, no. 3 (2009): 311-341.","language":"text/plain","encrypted":false,"added":1596318494},{"paste_id":2,"description":"7 benefícios do Ginkgo biloba e Como tomar","body":"EXAMINE. Ginkgo biloba. Disponível em: <https://examine.com/supplements/ginkgo-biloba/>. Acesso em 27 Fev 2019\n\nHEALTHLINE. 12 Benefits of Ginkgo Biloba (Plus Side Effects & Dosage). Disponível em: <https://www.healthline.com/nutrition/ginkgo-biloba-benefits>. Acesso em 27 Fev 2019\n\nGORBY, Heather E.; BROWNAWELL, Amy M.; FALK, Michael C. Do specific dietary constituents and supplements affect mental energy? Review of the evidence. Nutrition Reviews. Vol.68(12). 697-718, 2010\n\nBUDSON, Andrew E.; SOLOMON, Paul R. Perda da memória, doença de Alzheimer e demência. 2.ed. Rio de Janeiro: Elsevier, 2018. 172-176.\n\nTIAN, Jinfan; LIU, Yue; CHENA, Keji. Ginkgo biloba Extract in Vascular Protection: Molecular Mechanisms and Clinical Applications. Current Vascular Pharmacology. Vol.15(6). 532 - 548, 2017","language":"text/plain","encrypted":false,"added":1596319290}],"comment":[]}