{
	"posts": [
		{
			"id": "7063de12-c190-4ffe-a50a-6564062f8d87",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "685d8464-0a68-4b10-bfad-e5bca5474f02",
			"body": ">>81f6ba00-9932-415c-8d80-2e193611091b\n>They care about making money and have no incentive to protect your information.\nIs not that simple. They do have an incentive to protect your information because of the risk of being found out and losing clients, but then they also have an incentive to cooperate with law enforcement under the table so they don't get hit too hard with lawyer fees or even fines ordered by a court.\nSo I suppose most of the time they make a deal with LE to provide as much information as the officers want as long as that information doesn't get presented in court and is just used as a lead to obtain the actual evidence that will be presented in court somewhere else.",
			"time": 1567005066975,
			"files": "[]",
			"last_edited": 1567005108075,
			"subject": null,
			"capcode": null
		},
		{
			"id": "cc6cb877-6231-4496-aca2-5d2839a24980",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c37ad527-072c-48e6-9c8a-d27b976c51e1",
			"body": ">>c37ad527-072c-48e6-9c8a-d27b976c51e1\n>Nuclear experts had speculated that Russians were testing SSC-X-9 Skyfall, a prototype cruise missile that could reach any corner of the world with a nuclear reactor as its power source\nThat would make sense, I guess. Except there should be some elements with longer lifetimes, but maybe they weren't emitting detectable levels of radiation. Maybe the explosion didn't blow up the fissile material to the atmosphere, or maybe the power levels involved meant there weren't enough by-products to cause strong radiation levels.\nI was wondering what could do that. When nukes explode, they release a shit ton of radiation and would be found out almost immediately by other countries. And if they are destroyed by an explosion coming from an external source, then they shouldn't release any radiation at all. I guess an external explosion could detonate some of the conventional charges in it, causing a brief supercriticality but not an outright nuclear explosion. I'll wait for Thunderf00t's take on this.\n>5 men dead\nWhat the fuck were they thinking having people around when testing that thing?\nEdit:\nhttps://en.wikipedia.org/wiki/9M730_Burevestnik\n>and stated it was linked to an accident involving the test of an \"isotope power source for a liquid-fuelled rocket engine\".\nhttps://russianmilitaryanalysis.wordpress.com/2019/08/15/mystery-explosion-at-nenoksa-test-site-its-probably-not-burevestnik/\nThat would make sense too. Russians are big into RTGs, they even used them for lighthouses. Conventional rockets would be more likely to explode than a small nuclear reactor. But then again does that site even launch or manufacture space rockets? Why would a rocket with an RTG be fueled if it wasn't already in the launchpad?\nEdit2:\n>Looks like its not a RTG based on the isotopes detected, and instead a nuclear reactor. Also unlikely to have been a missile, and the initial explosion may have taken place underneath the platform rather than above it.\nOh, so it seems it was indeed a reactor.",
			"time": 1567006595905,
			"files": "[]",
			"last_edited": 1567007587505,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}