{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1536035206_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": 1,
		"1540635037_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"7_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1536035206_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 1,
				"body": "The solution does not lie in creating \"a\" new internet; I believe we will eventually evolve the internet into separate networks of machines. Granted, there are so many computers in this world, the illusion of a global internet will emerge: a network of ten machines in Germany and one of ten machines in America where one machine in Germany is in some way connected to a single machine in the American network, for example. There is no emergent property of combined networks, in this case.",
				"added": 1536284924
			}
		],
		"1540055841_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 2,
				"body": "Well, generally you get money by providing something someone wants.Advertising generally doesn't work because because it compromises the very product you're selling, especially on a small scale when you're reliant on a small number of advertisers. Aristotle went into town, took questions, gave people advice for their problems, and accepted donations in return. I think that's a pretty solid business model if you're not actually selling something.",
				"added": 1540057980
			}
		],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 3,
				"body": "I'm a gay male so I can only speak from my own biased perspective, but hopefully it provides some relevant observations. I've never been able to look/question deeply enough to find a decisive origin for the way I feel. I was abused by my mother for almost all of my life before leaving home at 18, and I will accept that some of my intense hatred of women is due to that. But I would characterize the sexual personae of men and women more generally as the Dionysian vs the Apollonian. It's a primal dichotomy that permeates western civilization (which is to say, civilization). The female is Dionysian: all-consuming, destructive, an altar upon which we destroy ourselves and sacrifice our futures to ease the pains of the present. The Apollonian male created civilization and culture as a way to save himself from the violent, hideous chaos and death-worship of the female, which is why females are dead set on destroying civilization, and when they sink their claws into the arts, they produce anti-culture. They envy men because they cannot create, only destroy, and this goes as deep as things like the penis being directive and pointing as opposed to receptive and useless. While I think homosexuality is at some level genetic, it manifests in my mind as an appreciation of strength, beauty, intelligence, creation etc., things women embody the exact opposites of. I think males are drawn together by this shared desire Good. Most draw the line at friendship, which is the purest form of relationships as it is untainted by lust, but for some, it replaces sexual relations altogether. My point being that it (sexuality) does not exist in a realm of its own but rather originates from the same desire for Good and a better world, that all males have, that draws virtuous men towards one another. And suffice it to say, there's a reason all of the feminine wastrel fags hang out with women.",
				"added": 1540059124
			},
			{
				"comment_id": 4,
				"body": "To add some statistical evidence:\nI would avoid studies set out to find genetic factors of homosexuality, and instead sue information we already know about homosexuality to logically tie it to genetic factors. Homosexuals have higher IQs than average, and intelligence is largely genetic. Homosexuals males are shorter on average than heterosexual males, and height is genetic. Homosexuals are less often overweight; this could be because they seek to attract other males, who value appearance whereas females only value wealth, but it's worth mentioning that weight has genetic predispositions and relates somewhat to personality which is 60-80% genetic.\nYou could argue that IQ and personality trends may result in someone choosing to become homosexual just as high IQ correlates with lifestyle choices like Atheism and Vegan diets. However the correlation between physical factors like height (and some other, less conclusive physical growth indicators like digit ratios) and homosexuality would imply that it is tied in some way to physical development, either as a genetic product or in a way similar to a genetic product. I have my doubts that having shorter fingers or shorter stature creates a psychological complex that turns men gay.",
				"added": 1540059784
			},
			{
				"comment_id": 5,
				"body": "> [moor](#comment_20_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): quick question, is lust in the eyes of the beholder (subject) or on the object (the thing that you lust for) ?\n\nWell, the more I think about it, the harder it is to say. tl;dr lust is in the eyes of the beholder: love is objective and good but doesn't always feel good to uphold and fight for, while lust is a subjective preference and always feels good to pursue.\n\nGenerally speaking, like attracts like. The \"opposites attract\" adage doesn't really pan out in real life: high IQ people mate with each other, attractive people tend to mate with each other (and it's been found that intelligence and beauty go hand in hand, and that attractiveness is a better indicator of intelligence than level of education), happy people get with happy people, depressed people get with depressed people. Because your looks, your personality, your intelligence, are all largely genetic, then for your genes to reproduce and dominate, they must be paired with similar genes, otherwise they are diluted or snuffed out. This is a gross oversimplification of genes but you get the idea. And I don't mean this to devalue the love we feel for our partners--by reducing it to genetic survival--but that's one of the effects, that is inextricable.\nSo, where does lust differentiate from love, in those regards? Because both love and lust have that gene-reproduction component to them. Ultimately, good people all want the same thing. Happiness is the one thing we seek for its own sake, all else we seek in the pursuit of happiness. But because of empathy, the virtuous abhor happiness that comes from the misery of others, so we also seek freedom, for all. Freedom to pursue your own will while being free from the will of others. Obviously it is usually in our best interest to compromise with the wills of others because multiple people can produce exponentially more than individuals working separately (which is what makes empathy so important). So when you love someone, that involves a consideration of the Other. If you are virtuous, and they are virtuous, and all good people want the same thing because morals are universal (whereas preferences are subjective), then you both not only want happiness for yourselves but for each other. We are altruistic towards good people whom we love because we can educate them in happiness and virtue which makes them more able to make us happy. Lust is immoral and concerned only with your own subjective preference. It is the gene-reproduction drive minus virtue (primarily the virtue of empathy). Lust is the complete absence of consideration for the object. The lust one feels towards another person is a lust for the aspects of oneself that one sees in that object. Love values the object BECAUSE it is \"Other\" and is independent of the subject.",
				"added": 1540062495
			},
			{
				"comment_id": 6,
				"body": "> [moor](#comment_21_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): lust is sincere, its a feeling.\nAh okay, well I definitely don't think it exists in a vacuum either. But like I said, love and lust both have the same foundation of gene replication and the pursuit of happiness, love is simply lust + morality. Lust is a feeling but more specifically it's an impulse: the shadow of a virtue. So, in Jungian psychology you have the archetypes of the human soul, and each archetype has a fully actualized version, and a shadow. The King wishes to create life, and justice, and does not inherently wish to rule over others, but rather is personally strong. The shadow of the King is the Tyrant, who personally creates life and justice and order but at great expense to others, because he is weak and cannot create anything himself (I think men naturally have a tendency to actualize this aspect of their psyches while women dwell in the shadow thereof). The Lover also has a flip-side, that seeks to make all relationships physical and lustful, with so little regard to love and romance that they eventually sacrifice parts of themselves to gain to \"love\" of others. The consequences of lust go beyond just ruining your personal relationships with others: it becomes self destructive at a point because you'll give yourself up just to get it.",
				"added": 1540076454
			}
		],
		"1540133695_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 7,
				"body": "Tox is great--I've tried using Discord on my Debian machine and it just constantly breaks, not to mention I hate basically everything about Discord anyway, and Tox is the best open source voice chat program I've used.",
				"added": 1540238696
			}
		],
		"7_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 8,
				"body": "Free Domain Radio, largest philosophy show in the world. The host, Stefan Molyneux is an excellent writer and philosopher, an ardent, practical anarchist who throws his weight behind crypto currencies, decentralized networks etc., as means of taking our lives back from the state. Even if you're not into anarcho-capitalism, he has a lot of shows on classical philosophers, and has a weekly call-in show that is mainly him giving advice to callers.",
				"added": 1540692593
			}
		]
	},
	"comment_vote": {}
}