{
	"posts": [
		{
			"id": "fb197d86-0099-41e8-b8c3-efceb96f9ff0",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "All AMD Processors Since Phenom II Have BadBIOS Circuitry That Leaks to the Military",
			"body": "Title gives my conclusion from empirical events I witnessed and inside info. PSP runs on the same circuit, but isn't the backdoor per se, which has been around for much longer.\n\nThe same way AMD was able to change the crypto algorithms for the Zen chip they licensed to China, they can change how the CPU behaves at any system, even those already deployed. This can also be used to sabotage any program or computation, making BadBIOS vastly nastier than Stuxnet.\n\nAmerican military made a grave mistake to partner with the morons of the Brazilian military, who are letting knowledge of this spread like a fire (and misusing it for petty profit and inside jobs to justify a police state). Israel, UK and France also have access, but are much more professional.",
			"time": 1616829527026,
			"files": "[{\"name\":\"laura-ockel-RoZWxeFL27k-unsplash.jpg\",\"thumb\":\"eaea29e01a202fbc15addb72ba29e9e1401baff8-thumb.jpg\",\"size\":156973,\"type\":\"image/jpeg\",\"original\":\"eaea29e01a202fbc15addb72ba29e9e1401baff8.jpg\",\"directory\":\"1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG\"}]"
		},
		{
			"id": "cd1b8280-8341-4ca7-92d3-bbbda31641b3",
			"directory": "users/1BpazHWKsD9aZ4xwg6n5hWNNLtGtkQn5zX",
			"uri": "suicided",
			"thread": "9f2ea54a-9dde-4396-86ae-790175af4704",
			"body": "He was killed for trying to expose the covert surveillance deployed by the US military. His latest tweets were all about how tech companies were being subverted from inside.",
			"time": 1624639555014,
			"files": "[]"
		},
		{
			"id": "6dd5ad1a-aa5c-4504-8b86-fd86e2754eee",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"subject": "App Dev Admits TikTok and his App Use Data Stolen from People's Minds",
			"body": "Author of the Randonautica app confirmed on a Livestream that both his app and TikTok are using data they steal from user's minds with hardware backdoors.\n\nHis naivety is thinking the military isn't using this for terrorism.\n\nSource: https://www.youtube.com/watch?v=cn77LzVhous [38:50 - 42:59]",
			"time": 1632848714304,
			"files": "[{\"name\":\"Randonautica.mp4\",\"thumb\":\"686557eb8c31a2338edfddb718ddb1d0bf601331-thumb.jpg\",\"size\":29737288,\"type\":\"video/mp4\",\"original\":\"686557eb8c31a2338edfddb718ddb1d0bf601331.mp4\",\"directory\":\"1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG\"}]"
		},
		{
			"id": "68254e56-1133-4ca1-9f99-ff3db3028054",
			"directory": "users/1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei",
			"uri": "conspiracies",
			"subject": "China Stole NSA's Remote Neural Monitoring Tech and Now Spies on The Minds of All",
			"body": "Video (5 minutes) with a short description of the current state of affairs regarding brain spying with Remote Neural Monitoring by China:\n\nHost 1: https://www.bitchute.com/video/kUIfnbFORViS/\n\nHost 2: https://kraut.zone/w/bmaWSdr5EStn172JqKZYL4\n\nHost 3: https://old.reddit.com/r/randonauts/comments/pxcnd3/dev_admits_tiktok_and_randonautica_use_data/\n\nThe morons in Washington kinda know, as Matthew Pottinger wrote to them: \"Assembling dossiers on people has always been a feature of Leninist regimes. But Beijing’s penetration of digital networks worldwide has taken this to a new level. The party compiles dossiers on millions of foreign citizens around the world, using the material it gathers to influence and intimidate, reward and blackmail, flatter and humiliate, divide and conquer. As Bill Evanina’s written testimony today made plain, Beijing has stolen sensitive data sufficient to build a dossier on every American adult—and on many of our children, too, who are fair game under Beijing’s rules of political warfare.\"\n\nhttps://nypost.com/2021/08/09/senate-panel-warned-china-has-enough-data-for-dossiers-on-all-americans/",
			"time": 1634691529791,
			"files": "[{\"name\":\"Randonautica.mp4\",\"thumb\":\"95255e1dd5187d4a1b86a3d3630bfb2fd7dbd992-thumb.jpg\",\"size\":29737288,\"type\":\"video/mp4\",\"original\":\"95255e1dd5187d4a1b86a3d3630bfb2fd7dbd992.mp4\",\"directory\":\"1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}