{
	"next_topic_id": 40,
	"topic": [
		{
			"topic_id": 1565132888,
			"title": "Stop being fat.",
			"body": "A healthy body is a healthy mind. Stop eating trash. Start working on your body. You have no excuse but the laziness mental barrier stopping yourself from becoming better.",
			"added": 1565132887
		},
		{
			"topic_id": 1565237461,
			"title": "The holocaust never happened",
			"body": "Now you know, you're welcome",
			"added": 1565237459
		},
		{
			"topic_id": 1565251237,
			"title": "Hate speech does not exist.",
			"body": "There is only free speech, you communist faggot",
			"added": 1565251234
		},
		{
			"topic_id": 1565294669,
			"title": "What gets repeated, gets remembered.",
			"body": "You might give someone the best advice in the world, but say it once and they forget.\nWhat you repeat, gets remembered. This principle applies across the board.\nYou repeat playing a game alot, you remember how to play it well.\nYou repeat physical exercise, your body will remember.\nConsistency is an requirement if you want to get something done. Don't get lazy.",
			"added": 1565294665
		},
		{
			"topic_id": 1565297074,
			"title": "Share music",
			"body": "Share songs you like, heres a song I like:\nhttps://www.invidio.us/watch?v=98bhoap1ies",
			"added": 1565297069
		},
		{
			"topic_id": 1565298754,
			"title": "Jour-anal-ist thread",
			"body": "Ask questions here for your clickbait articles. You can come too Kelly.\nI'll bump this periodically if they don't bite immediatelly",
			"added": 1565298748
		},
		{
			"topic_id": 1565493657,
			"title": "Stop watching porn",
			"body": "Stop being a useless cumbrain. Be better.",
			"added": 1565493650
		},
		{
			"topic_id": 1565542665,
			"title": "Stop being fat.",
			"body": "Start exercising you whale.",
			"added": 1565542657
		},
		{
			"topic_id": 1565557785,
			"title": "Jews control the media",
			"body": "No worries fam, this one is on me",
			"added": 1565557776
		},
		{
			"topic_id": 1565614209,
			"title": "Depression is a fake illness.",
			"body": "There is no depresssion in the jungle.\nDepression is a disease of those in too much comfort and complacency. \nTake away that comfort, and their depression falters. Fact.",
			"added": 1565614199
		},
		{
			"topic_id": 1565617632,
			"title": "Gamers",
			"body": "rise up",
			"added": 1565617621
		},
		{
			"topic_id": 1565620281,
			"title": "commies are stupid nerds lmao",
			"body": "https://www.invidio.us/watch?&v=bHRxu3XrsHg\nThis is the people you're arguing with, remember that l o l",
			"added": 1565620269
		},
		{
			"topic_id": 1565639604,
			"title": "How do you mute someone? -idiot",
			"body": "Resident commie is spamming",
			"added": 1565639591
		},
		{
			"topic_id": 1565651343,
			"title": "Not seeing certain users",
			"body": "I see people responding to a user I can't see, that user being: usr0\nHow to fix?",
			"added": 1565651329
		},
		{
			"topic_id": 1565667891,
			"title": "The holocaust never happened",
			"body": "Your daily dose",
			"added": 1565667876
		},
		{
			"topic_id": 1565695257,
			"title": "Stop watching porn",
			"body": "You're fucking up your brain, idiot",
			"added": 1565695241
		},
		{
			"topic_id": 1565739655,
			"title": "Hey, the holocaust never happened",
			"body": "Holocoaster, jew soap, skin lampshades, shrunken heads and masturbation machines. All lies.",
			"added": 1565739638
		},
		{
			"topic_id": 1565777168,
			"title": "Have you exercised yet today?",
			"body": "Stop making excuses. Get off the chair fatty.\nThere is no perfect time. The perfect time was yesterday.",
			"added": 1565777150
		},
		{
			"topic_id": 1565832419,
			"title": "There is no hope.",
			"body": "You cannot change the system using the system.\n\nAll supposedly right-wing, based and redpilled modern political movements are a cuckservative or controlled op and are only there to serve as a distraction to entirely circlejerk instead of an actual solution.\nAmong others: Trump, FN, PVV, AfD, One Nation, etc etc\nThe individuals in these kind of movements are not the smartest or most aware of men(Read: boomers), and they would rather have them participate in the rigged politics than realise there is no hope and only violence will get them what they want.\n\nYou want to save your people? Make tons of them.\nYet, Richard Spencer (fat), saves the white race, by having a cute dog and a squarehead russian girlfriend.\n\nPolitics is only a pressure vent for frustration.\nPay as little taxes as possible, stop feeding the system that is actively destroying you.",
			"added": 1565832400
		},
		{
			"topic_id": 1565852058,
			"title": "You can edit your posts",
			"body": "This could totally be abused tbh. \nDiscussion A claims C said B and C claims they said D.\nA is correct about his B claim\nC changes his post to D\nThe record has been correctedâ„¢\n\nWhy is this a feature?",
			"added": 1565852038
		},
		{
			"topic_id": 1565868212,
			"title": "Abortion is a good thing.",
			"body": "Racial hygiene.\nOnly trashy people will get an abortion, thereby cleaning up your people by murdering the brainlets before they are born.\nA normal pregnant girl won't suddenly decide to have an abortion just because it's there.\n\nAs for those Christians who are against this because you are killing a life,\nYes, it is a life. It is a mind and soul you are ending with your actions.\nYes, it is murder.\nI don't care. Only degenerates and whores use abortion clinics, I lose no sleep over losing trash.",
			"added": 1565868191
		},
		{
			"topic_id": 1565914543,
			"title": "oh shit nigger this is be that subreddit shit",
			"body": "it had the feature all along,",
			"added": 1565914521,
			"parent_topic_uri": "1565912878_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM"
		},
		{
			"topic_id": 1565914656,
			"title": "Make a group, nerd",
			"body": "You want to discussion on a certain topic without holocaust deniers flooding your post?\nEasy, make a group! \nThere you can discuss whatever you might want, it's like a subreddit, or a board on a chan site!\nJust select group when making your topic and you are done!",
			"added": 1565914633
		},
		{
			"topic_id": 1565915104,
			"title": "WE NEED TO GO DEEPER",
			"body": "AAAAAAAAAAAAAAAAAAAAAAAA",
			"added": 1565915080,
			"parent_topic_uri": "1565914773_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n",
			"type": "group"
		},
		{
			"topic_id": 1565915120,
			"title": "based",
			"body": "",
			"added": 1565915095,
			"parent_topic_uri": "1565915104_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9"
		},
		{
			"topic_id": 1565915181,
			"title": "The holocaust never happened",
			"body": "Second post boys",
			"added": 1565915155,
			"parent_topic_uri": "1565914998_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1565915806,
			"title": "The age of echo-chambers is here.",
			"body": "With the discovery of groups by our pioneers, a new phase is motion.\nNow just add image posting, and we are golden.",
			"added": 1565915779
		},
		{
			"topic_id": 1565986750,
			"title": "the holocaust never happened",
			"body": "you made it this far",
			"added": 1565986722,
			"parent_topic_uri": "1565986540_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG"
		},
		{
			"topic_id": 1565991945,
			"title": "we have to go deeper",
			"body": "hide the nuclear codes somewhere down here",
			"added": 1565991916,
			"parent_topic_uri": "1565989014_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3",
			"type": "group"
		},
		{
			"topic_id": 1565992280,
			"title": "There is no perfect time.",
			"body": "Start you lazy nerd.\n You say in a day but then the sun rises and you do nothing. \nPush your fucking out of that bed. Get over the mindset of laziness.\nPush your mind to through with it. Steel yourself. \nWhen shit gets real and you're still soft and fat, you'll be fucked.",
			"added": 1565992250
		},
		{
			"topic_id": 1566056701,
			"title": "Pssst",
			"body": "The holocaust never happened",
			"added": 1566056670
		},
		{
			"topic_id": 1566081034,
			"title": "ä½ ä¸ºä»€ä¹ˆä¸æ€äº†ä½ çš„æ”¿åºœï¼Ÿ",
			"body": "æˆ‘ä½¿ç”¨è°·æ­Œç¿»è¯‘",
			"added": 1566081002,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1566146346,
			"title": "Stop drinking.",
			"body": "It is a waste of money. To become willingly retarded and fuck your brain up is idiotic.\nIt only shows how you can't deal with the problems in your life, so you escape by drinking yourself stupid.",
			"added": 1566146313
		},
		{
			"topic_id": 1566175915,
			"title": "Start doing exercise, you lazy fuck.",
			"body": "Do not quit. Do not fail. Do not falter. Do not give up.\n\nYou wanna get out of feeling like shit all the time? Stop being a cow and put yourself to it. Force yourself through the suffering to get healthy. If you keep going after the first day you're doing better than 80% of men.\nYour feelings are not unique, men have felt them before and resolved them, or have failed. \nTake comfort in knowing that your actions have already been done before, and that succes is only a matter of my your initiative and willpower.",
			"added": 1566175881
		},
		{
			"topic_id": 1566178230,
			"title": "All publicity is good publicity",
			"body": "ðŸ¤”\nI've entertained the idea of telling big news corporations and journos about this super bad babby killin nazi redneck kkk zite, with the intent of getting them to sperg out like they always do, and getting more individuals on here.\nI'm not sure though, your thoughts would be appreciated.",
			"added": 1566178195
		},
		{
			"topic_id": 1566180600,
			"title": "It's music time",
			"body": "Give me your greatest tunes\nNegative xp - Scott Pilgrim vs. the World Ruined a Whole Generation of Women\nhttps://www.invido.us/watch?v=TSKizLRFbTo",
			"added": 1566180564
		},
		{
			"topic_id": 1566253605,
			"title": "Simple and effective.",
			"body": "Make it simple and alot.\n\nYou want to get your message out, your politics, your brand, whatever. \nDo not make it complicated. That is boring and people will not be interested.\nIt is the difference between:\n\"Healthcare today is very expensive, my campaign will seek to make the program single payer  assisted bix watermelon with very much intent towards X and Y and Z\"\nAnd\n\"Make healthcare cheap again\"\n\nWhat gets repeated gets remembered.\nUnderstand that your message has to be  out there. You can give someone the best advice in the world but if you do not repeat it, people will forget.",
			"added": 1566253568
		},
		{
			"topic_id": 1566526419,
			"title": "deneppah reven tsuacoloh eht",
			"body": "Reverse it!",
			"added": 1566526381
		},
		{
			"topic_id": 1567260953,
			"title": "The holocaust never happened",
			"body": "Been awhile, wooden gas chamber doors are still not worthwhile.",
			"added": 1567260914
		}
	],
	"topic_vote": {
		"1564963792_17i73awrYG3UfPMGBeDo3J4XuadYwctRvz": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1565132888_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565142123_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1,
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": 1,
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565250613_1H12MuvP4JeeK74scutN2fbNbUbdSgZ1Lz": 1,
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565294669_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565297074_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": 1,
		"1565542665_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565538736_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": 1,
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1565642608_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"1565716215_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": 1,
		"1565667891_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": 1,
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565907502_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": 1,
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565889331_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"1565995598_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1,
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566056701_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565617632_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1566146346_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1566065435_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1566216762_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1566400778_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": 1
	},
	"next_comment_id": 188,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "the holocaust never happened tbh",
				"added": 1565065694
			},
			{
				"comment_id": 2,
				"body": "> [0nettestid](#comment_2_1HQ42LN1m8HQeBdKxRANi66HhHmjD1Nocz): Is there a way to host images here?\n\nDon't think so, you'll have to use some third party service for that.",
				"added": 1565128535
			},
			{
				"comment_id": 170,
				"body": "Welcome\nThe holocaust never happened",
				"added": 1566176056
			}
		],
		"1564106401_1EsM7XQ7MNtL2M8e823PoNiZMy2SBmWKHi": [
			{
				"comment_id": 3,
				"body": "It's a buzzword tactic made up to make you shut up. Your opinion/demeanor was too off the charts for these nerds.\nThese people are giant hypocrites, It's not about the actual defintion of racism, just a label to slap on you if you've been a bad goy. \nBut pointing out the hypocrisy of these leftist fags has been done for years on end by all sorts of e-celebs and other characters. The time for action was yesterday.",
				"added": 1565128781
			},
			{
				"comment_id": 4,
				"body": "> [thecollector](#comment_4_1EsM7XQ7MNtL2M8e823PoNiZMy2SBmWKHi): d. Im not a racist, what makes you say that? he replied \"your white, so your automatically a racist and started laughing\" see my problem with this is that in America this can lead to serious problems for me. And its next to impossible to \n\nHeh, sounds like you were just being fucked with. They realise the kind of power they wield with that kind of talk. Brush it off, these people's thoughts are opinions are worthless.",
				"added": 1565128898
			}
		],
		"1564963792_17i73awrYG3UfPMGBeDo3J4XuadYwctRvz": [
			{
				"comment_id": 5,
				"body": "Walking barefoot like your ancestors did is the way the human body is designed to walk. It's better for your health to walk barefoot on the front of your feet.\nEvery opportunity I get I walk barefoot. In the city theres lots of glass and other trash on the floor, so I'm forced to wear shoes, temperature, or I have to out of social expectance. \n>but it's not clean!\nLmao, you can clean your feet as much as you can with your shoes. I use the mat on my feet aswell as my shoes.",
				"added": 1565129225
			}
		],
		"1565120423_13r1hwu6tyYeZsWk48DQDqtq9AN5GWQXmo": [
			{
				"comment_id": 6,
				"body": "The holocaust never happened lol",
				"added": 1565129296
			}
		],
		"1565107716_152fY68b7kM9nj4ErMRzbP64dVtj21dngk": [
			{
				"comment_id": 7,
				"body": "Friends. Unironically. How does that fat ugly  retard get a GF while your nice being, groomed hair and body caring ass doesn't? The law of averages.\nThat fat ugly retard has a bunch of friends, and those friends have friends. \nIn the time he hangs out with them he keeps meeting different girls and unknowingly honing his skill of talking to them, and eventually a girl decides to open her legs for him. \ntl;dr get friends nerd\nI'll defer you to this video, by a chadcel:\nhttps://www.youtube.com/watch?v=AFrd9xNt8kQ",
				"added": 1565129661
			}
		],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 8,
				"body": "Freedom is non-negotiable. These people will lose theirs if they do not do more than riot in the street. Nobody will help them in maintaining other then themselves. There is all the means out there for the people to start their own insurrection, they need to make the arms necessary. the iron, the chemicals and the machies, it's already there. These people need to learn to use the tools of modern warfare, that being the difference to the prospering of your people or becoming like the bugmen on the mainland. \nI can't give you freedom, but I can give you the know-know to acquire it. And that's worth more than gold.\nShoot politicians. Shoot their benefactors. Shoot the financier. Shoot the cop protecting the system. Cut the grid. Burn their institutions. They either get with the program or perish like the communists they are.",
				"added": 1565130182
			},
			{
				"comment_id": 21,
				"body": "> [atomiserxenolith](#comment_119_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Playing into their hands. Chinese authorities salivating at the prospect. You can't fight a violent cult (the State) with violence ... only by exposing the violence that lies at the heart of the State ... the extortion of taxation that feeds it ... and conducting trade outside the purview of the State - i.e. economic and political approach - military is bad tactics\n\n> >you can't fight the state\nWhat are the protests then? What are the riots with using umbrellas as roman shield tactics? The people fighting in the streets right at this moment?\nYou say that the entire prospect is useless, you imply that they should stop protesting aswell. Better just lay down and die.\nYou are wrong. Every freedom loving person in the world should have a rocket launcher, rifle and tank. That if someone wishes to take their freedom, they will pay in blood. If they wish to keep the freedom with the Chinese at the gate, they will have to fight for it. Hong Kong is more an asset than a threat for the Chinese. \nIf the people hold a torch to the city, show the Chinese they would rather burn the whole city than give it up to a communist, they'll fuck off and keep it to psyops.\n\nIt's the difference between blackpilling yourself to non-action because you think the government has infinite omnipotent power, to realising it is not so and fighting for what you believe in.",
				"added": 1565181592
			},
			{
				"comment_id": 84,
				"body": "Bump",
				"added": 1565639692
			},
			{
				"comment_id": 174,
				"body": "Kill the communist.\n\nThe insurrection should have started years ago. They knew this day was coming yet sat in comfort and didn't prepare. \nNow when the day finally breaks that freedom is fading, they aren't ready and are scrambling for their umbrellas.\nThey have the industrial capacity to produce arms and ammunition. If they wanna preserve freedom for the future generation they should be prepared to give their time, their money and life if necessary.\nOrganize, train and arm your protesters with all that you can muster. Virtue signalling with pepe signs and your shot-out eye will get you nowhere.\nASSume that no nation, no company, no foreigner will help you. Redditors will do nothing but squirm in their room.\n\nIt is only you in this fight. Your and your people's future freedom or enslavement depend on what you do now.",
				"added": 1566180863
			}
		],
		"1565132888_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 9,
				"body": "> [zagnut](#comment_6_1PEwg6PYQnsUL34EkvgnG2ckZ9PAYaixbb): The fact that you posted this tells me your mind is not healthy. Being preoccupied with others is a sure sign of very low self esteem and a probable victim of abuse. [...]\n> don't get healthy\n\nThere is nothing wrong with seeking to uplift your fellow man from being fat and unhealthy.\nYour message shows only that you care very little about the state of the people around you. I actually do. \nYou equate me trying to get people healthy and starting exercise, with trying to force them to have certain opinions, like the Communist chinese government does. That is wrong. \n\nIf you are an asking for a purpose to be healthy, that is a problem in and of itself. \nI know the difference between being overweight, depressed and generally feeling like shit all the time, to being healthy, having the vigor and energy to do everything I want in this world.\nYou want to be a fat piece of shit with heart problems, go ahead. But do not expect me to feel sorry for you.\nI will shine in the sun with those that heed the message.",
				"added": 1565136667
			},
			{
				"comment_id": 10,
				"body": "Matter of fact, I will go on to list some the advantages that you get when being healthy:\n-increases bone density\n-improves heart health\n-decreases injury rate\n-increases insulin sensivity\n-reduces risk of cancer\n\nhttp://health.harvard.edu/staying-healthy/strength-training-builds-more-than-muscles\nhttps://www.ncbi.nlm.nih.gov/pubmed/15628572\nhttp://colinchamp.com/muscles-fight-cancer/\n\nOn another note, the people that lash out so rude and negatively like this are nothing special. I've seen them many times before and they all act the same and say the same things. \nYou cannot convince them to get out of the mental hole they are digging themselves in, or are already in. They only show the world how much they can't cope with their own person. They will need to realise themself that they are wrong.",
				"added": 1565137625
			},
			{
				"comment_id": 12,
				"body": "Stop making excuses. If you have 2 legs to stand on you have no excuse.\n The fact you are fat is not a physical issue, it is in the mind. Your will is what is keeping you back more than anything. \nI cannot convince you to become healthy, you can only do that yourself. \nShed the mental weight that is keeping you back from being your physical best.",
				"added": 1565140885
			},
			{
				"comment_id": 13,
				"body": "> [zagnut](#comment_7_1PEwg6PYQnsUL34EkvgnG2ckZ9PAYaixbb): Don't be mad, baby girl. The effort you put in shit talking others is a deflection your poor self image. Nothing wrong with that. Just work on it. You will start to realize that you only shit on others as a way to deal with your own shortcomings. I am sure your parents did the best they could. But some parents are just shit and raise shit kids. [...]\n\nHere you see the sheep in his natural habitat.\nYou have dreams and aspirations, to rise above the average and the unhealthy standards, to go beyond what people think is possible. To rise up, and bring those around you with you.\nThey will attempt to strike you down, demoralize you into stopping what you are doing. They promote laziness, eating unhealthy and give little concern for their own body. \nThey would rather pat your back while you eat yourself to death and getting a limb cut off instead of calling you on your bullshit and making you improve your health. \nThis person does not care for his fellow human being's wellbeing , how unhealthy and trash they are. They would rather have everyone be a grey mass that has no actual convictions about anything.\n\nBut I do not give a damn what this person or society thinks, I will combat you day and night. if you are fat, you need to lose weight. You need to get healthy. \n>but my feelings!\nI don't give a damn about your feelings, I will tell you what you need to hear, not what you want.",
				"added": 1565141949
			},
			{
				"comment_id": 16,
				"body": "> [blackwatch88](#comment_4_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc): Hambeast fatfucks are the filthiest eye-sores known to mankind. Fucking parasitic lardassed gigantic slobby blob of shits deserve to be purged like the worthless degenerate subhuman pigs they are and roasted on a spit to feed the starving people from whom they stole life-saving food and rendered to produce an alternate fuel much like whale oil. Oink oink you fucking abomination repulsive orges.\n\nIn general fat people are quite disgusting I find, but to write them off like thatis wrong. These people can save themself and have saved themself before. They just have to gather the willpower to make it happen.\n You can't give the fatties healthiness, but you can give them the know-how to acquire it. And that my friends, is worth more than a whole gym complex of steel.",
				"added": 1565144221
			},
			{
				"comment_id": 18,
				"body": "Bump",
				"added": 1565179734
			},
			{
				"comment_id": 24,
				"body": "Bump. Get healthy.",
				"added": 1565196571
			},
			{
				"comment_id": 30,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_606_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): clarity of thinking is done when they're nothing left to digest, when the digestion is finished.you see it when you jump one or two lunch, at a moment the digestion is done (nothing left), then the same moment the FLUX NECESSARY to Think Clearly is Back ('OR AVAILABLE'). [...]\n\nI can think clearly the entire day through, I don't need to have an empty stomach to think clearly. Where are you getting this from?",
				"added": 1565237548
			},
			{
				"comment_id": 31,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_627_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): good for you, if you have something else interesting 'to tell me', don't hesitate 'i'm here'\n\nTalking like you did in your other post, the one about clarity of mind. You type like a schizophrenic. \nCommunication and articulation is key in discussion, if people do not understand what you're saying, even if it is correct, you will have no impact. Truth is necessary to make an effective action.\nI had to read your post a couple of times to understand what you were trying to say. \nI still want to know where you're getting it from that you have to digest everything in your system before you can think clearly, it sounds like bullcrap.",
				"added": 1565238060
			},
			{
				"comment_id": 38,
				"body": "Bump",
				"added": 1565293441
			},
			{
				"comment_id": 50,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_637_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you still don't get it kiddo it's not facebook here [...]\n\nHave you exercised today friend? Stop being unhealthy.",
				"added": 1565305143
			},
			{
				"comment_id": 52,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_644_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): no one cares about you.\n\nIndeed, no one in this world will change anything for you. Expecting other people to do the work you want done is stupid, you have 2 legs and arms, do it yourself. \n\nYou want to change something in this world? Start with the man in the mirror.",
				"added": 1565306959
			},
			{
				"comment_id": 56,
				"body": "start doing pushups retard",
				"added": 1565362794
			},
			{
				"comment_id": 61,
				"body": "BUMP",
				"added": 1565391063
			},
			{
				"comment_id": 64,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_734_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): don't have 'things to study', or you're supposed to 'be the larvae' 'you're actually are'.\n\nNo u, schizo",
				"added": 1565404065
			}
		],
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 11,
				"body": "*dabs*",
				"added": 1565138090
			}
		],
		"1565142123_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 14,
				"body": "Screencapped. I've never heard this perspective before, very interesting. Certainly draws parallels with what's going on right now. \n\n> [h3bhkj5gqz4n3pjm](#comment_569_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): go take your pills and drop the internet connection.this is not 'social media' here you don't have to prove anything to anyone.\n\nYou have nothing to say but slander and trash. You cannot beat the argument and therefore attack the person behind it, in an attempt to get them to stop. You are unironic evil.",
				"added": 1565142515
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 15,
				"body": "Image uploads when?",
				"added": 1565142708
			}
		],
		"1565144194_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 17,
				"body": "It works",
				"added": 1565144266
			}
		],
		"1565175754_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 19,
				"body": "I haven't seen your religion post but I do notice what you're talking about.\nThis is not natural behavior, not to say for example that the jews are not involved in all such of subversive things, \nbut you can see it's a concerted effort to push a away the new kind of person that can't see through all the refuse yet. There are twitter/reddit posts discussing that because they cannot win the argument, they have to fill the place with trash. And that's what you're seeing now. \n\nThe same exact on thing happens on imageboards and it's all done by the same kind of people. Reddit, twitter checkmark journos, government agents etc.\nThese people are as loud as possible to drown out any discussion that would find or discuss the truth. They would rather have you be annoyed by them to leave the site rather than watch actual or participate in discussion and argument. The system does not agree with the fact the discussion is as open as it is.\nThey want you to neutralize you, to make you stop talking about stuff like this at all, as it's dangerous to their power.\nThese people cannot beat the argument, so decided they have to resort to being subversive, slimy and screaming.\nThe truth is necessary to make an effective action, they know this, so they seek to suppress the truth.\n\nThe first shots in the American revolution were from paper and pen, not the gun.",
				"added": 1565180690
			}
		],
		"1565141784_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 20,
				"body": "You're correct. But it can be relatively easily solved compared to other nation's problems.\nThe whole of western europe is stuck with a large amount of non-european immigrants, putting it lightly. \nThat are only growing in size and influence. Japan does not have this problem.\n> They are degenerate\nYes, but they don't have 10 million muslims on their island. And when they finally decide to stop being so hedonistic and faggoty, when they realise that their own people are more important than their own pleasure and wellbeing, they won't have to deal with them. \nIf the same were to happen in the US, Europe or Oceania, you'd have all these people that are there to deal with. You'd need a war to make it happen, in Japan you don't.",
				"added": 1565181025
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 22,
				"body": "There is nothing wrong with wanting to stop the genocide of your race.\nThere is nothing wrong with calling out those that are working towards the genocide of your race.\nHomosexuals are vile pedophiles that corrupt society and the people in it. They are disgusting and deserve death. Link related:\nhttps://www.bitchute.com/video/FNqiV8kL4cc/",
				"added": 1565187884
			},
			{
				"comment_id": 25,
				"body": "> [bigbadbob](#comment_23_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): To find balance one must avoid extremes.  child abuse and calling for the death of groups are both extreme.  Who needs to worry about \"gov\" taking freedoms when the \"media\" can gaslight people into doing their dirty work.  In times like these people really need to question their own beliefs.   We eat so many lies that if we start to believe them we can easily jump to false conclusions and act while the powers that be sit back with popcorn.  i know the media attacks \"white people\"  but when was the last time you had your family hacked up?   There would be no time for shit posting if you were actually on the run.   i know things seem bad but noone knows the future.   speculation is silly.\n\nYou make a lot of noise but you say nothing. \nYou imply this is only speculation. You are wrong. \nAll Western european and American capitals have or are becoming minority white. Non-white immigrants are now the majority in areas that a decade ago used to be white. These are undeniable realities. \nWhen the media calls for people to not have children, yet when asked why they push so hard for immigration it's because of the low birhrates. You can see the relation there. \nThe dots are out there clear as day, you just need to connect them. \nAnd you cannot also the deny the jewish influence in this conspiracy. Here is a quote from Barbara Spectre, founding director of Paideia, the European Institute for Jewish Studies in Sweden:\n\n\"Europe has not yet learned how to be multicultural. And I think we are going to be part of the throes of that transformation, which must take place. Europe is not going to be the monolithic societies that they once were in the last century. Jews are going to be at the center of that. It's a huge transformation for Europe to make. They are now going into a multicultural mode, and Jews will be resented because of our leading role. But without that leading role, and without that transformation, Europe will not survive.\" \n\nWestern people, white people, native europeans, whatever term you may use are actively genocided. I will not stand by and let that happen. The banker, the politician, the journalist, the usefull idiot and whomever is responsible will face justice for this tremendous crime.",
				"added": 1565229460
			},
			{
				"comment_id": 26,
				"body": "> [tamamshud](#comment_4_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): Barbara Spectre is a 'literally who'. And most \"pro-immigration\" lobbying comes the private sector, the owners and execs of which are majority non-jewish.Also no one is getting \"genocided\" because a bunch of people aren't having more children. Which btw, is mostly because of the cost of child-rearing, and stagnant (real) wages since the late 70s. [...]\n\nYou're correct. All these right wing politicians that are supposedly going to fix everything, are only controlled opposition. Even if they were to gain power, nothing will change. \nPolitics is a sham. It is only a pressure vent for the people's frustration.\nTrump, AfD, FN, PVV, whatever. Pick your poison.\n\nInstead of going out and killing, burning and destroying the system responsible for this mess, people put their ballot in a box and think they're making a change, they have the hope that things will get better from politics. That is wrong.\nOnly real change will come from violence against the system and overthrowing of said system.\n\nThere is no political solution, it died in 1945. There is no hope for change using the system.",
				"added": 1565230870
			},
			{
				"comment_id": 27,
				"body": "> [tamamshud] there is no white genocide\n\nWrong. There is white genocide. \nNot that you will ever say it though, even when the last white person dies on this planet you'll still argue there was not a genocide, but that doesn't matter.\nThe people's anger and frustration is pointed in the wrong direction. \nIt is not the worshipper in the mosque or brown person eating a taco that is the mastermind of the invasion. Think bigger.\nLike you said, private sector.\nIt is the capitalist in his factory, the (((banker))) in his mansion, the politician in his congress. \nIt is the financier pumping money into NGO's to bring Africans into Europe. \nRealise that the real enemy is not the people you see on the street or that you see on the TV,\nbut the individuals in the high rises, the policemen and the soldier protecting and importing those people. \nThey all need to hang.",
				"added": 1565231893
			},
			{
				"comment_id": 28,
				"body": "> [tamamshud](#comment_7_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): And here it is: Typical alt-right hypocrisy.The starvation of millions is an atrocity. But the intentional slaughter of dozens of millions, the systematic annihilation of the Polish nation and it's cultural heritage (See the razing of Warsaw), the strategic bombing of non-military targets (Coventry, Rotterdam, etc.), the genocidal siege of Leningrad (~600,000-1 million deaths), the planned destruction of Paris, the occupation of Czechoslovakia,  the anti-partisan actions in the Balkans and Greece, Generalplan ost, the Dutch famine of 1944, slave labor of native White Europeans? Just a statistic.\n\nThe holocaust never happened. It was a lie they have been milking for the last 75 years.",
				"added": 1565232662
			},
			{
				"comment_id": 29,
				"body": "> [bigbadbob](#comment_53_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): are you two gonna have sex now?   get a load off?\n\nCan't beat the argument, attack the person. Heh :)\nBut yeah gays are disgusting and deserve death tbh, unironically.",
				"added": 1565234934
			},
			{
				"comment_id": 42,
				"body": "> [zeronetanon4] Kelly Weill\nhttps://www.thedailybeast.com/author/kelly-weill\nhttp://www.occidentaldissent.com/2018/08/16/journofa-daily-beast-reporter-follows-multiple-antifa-accounts-on-twitter/\nA little commie slut, would fugg it out of her tbh",
				"added": 1565295495
			}
		],
		"1565184146_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 23,
				"body": "CJDNS? What is that?",
				"added": 1565188748
			}
		],
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 32,
				"body": "> [kidcourageous](#comment_70_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): No, again, my great grandpa literally was an SS officer who saw Auschwitz. Do not fucking take away my ancestors' accomplishments faggot. [...]\n\nThe weather might be nice in Tel Aviv, but not nice enough to make the holocaust real.",
				"added": 1565242813
			},
			{
				"comment_id": 33,
				"body": "> [bober](#comment_24_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): I think it happened. But it was mostly unintentional. Because Germans are fucking incompetent. So they probably really wanted to build recreational camps for Jews ... but somehow that state planned project turned into industrialized mass murder. [...]\n\nWooden gaschamber door. That opens inwards. \nMasturbation machines, giant electric chairs, literal holocoasters that end in an oven.\nShrunken heads, skin lampshades and jew soap. Even admitted lies in the mainstream media.\nThe supposed gas chambers were used for delousing of the camp's population's clothes, as there was an epidemic of typhus.",
				"added": 1565249606
			},
			{
				"comment_id": 37,
				"body": "Bump",
				"added": 1565293413
			},
			{
				"comment_id": 41,
				"body": "> [eighty4](#comment_6_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): The thing that really boggles my mind though is that if the nazis thought that all jews are parasites and must die, and had them all nicely rounded up in the concetration camps, why did they just let them sit around and fed them for six years instead of, you know, exterminating them and all [...]\n\nNope. The Germans were more respectfull towards their enemies in battle and in captivity. \nUnlike the Soviets, who went through Europe raping and looting everything in sight, with capitalist America backing them up. The katyn massacre, the holodomor, red terror. You name it. \nUnlike the British, who even when asked repeatedly for a peace treaty, denied it, and set in motion the death of 60 million people.\nUnlike the same British, who firebombed an entire city with women and children in it. With their only defence being this event, a virulent lie.",
				"added": 1565294970
			},
			{
				"comment_id": 55,
				"body": "Based",
				"added": 1565317289
			},
			{
				"comment_id": 59,
				"body": "The people that lied about shrunken heads, skin lampshades and jew soap lied about a whole lot more.",
				"added": 1565363137
			}
		],
		"1565250613_1H12MuvP4JeeK74scutN2fbNbUbdSgZ1Lz": [
			{
				"comment_id": 34,
				"body": "Stop eating unhealthy. Stop drinking alchohol. \nPizza and beer rule the people like heroine does for an addict, it is unhealthy.\nPeople drink alchohol to willingly become retarded for a time, it is poison, to yourself and those you affect with your behavior.\nPeople are addicted to pleasures and vices, and never realise their potential.",
				"added": 1565251154
			}
		],
		"1565289153_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 35,
				"body": ">me retarded?\nyes\nfirst google result, lmao",
				"added": 1565292706
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 36,
				"body": "Without 8chan being shoah'd I wouldn't have found this place, matter of fact I would have no incentive to use zeronet at all. That goes for alot of new users. \nI know I'll stay here even if 8chan comes back up, this place, the people in it and the platform in general. is great.",
				"added": 1565293221
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 39,
				"body": "Hi news\nThe holocaust never happened",
				"added": 1565293572
			},
			{
				"comment_id": 45,
				"body": "Kelly is pretty cute bros tbh\nhttps://twitter.com/KELLYWEILL/status/1109954416193560579",
				"added": 1565297923
			},
			{
				"comment_id": 46,
				"body": "> [nickwa](#comment_256_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): \"Even without the spotty reputation, Zeronet is harder to use than a conventional browser\"This is the funniest line I read. Like comon, ZeroNet is not that hard...\n\nYou underestimate the capacity of an idiot. Anything harder than plug and play tier apps already filter out a large group of retards",
				"added": 1565298225
			},
			{
				"comment_id": 48,
				"body": "> [styromaniac](#comment_905_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): What's weird is that she could be one of us. She seems pretty easy to talk to.\n>pretty easy to talk to\nYou got a crush there friend? :^)",
				"added": 1565299362
			},
			{
				"comment_id": 53,
				"body": "> [anshorei](#comment_9_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): > On peer-to-peer site ZeroNet [...]\n\nPretty good read tbh, learned something too",
				"added": 1565307314
			}
		],
		"1565288635_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 40,
				"body": "Listen, kid, my dad works for zeronet and I decide the rules around here. First off, if you don't hate all POC minorities you obviously don't belong in this place, this place is only for HATE and BIGOTRy. back to facebook, nancy. \n try me and get btfo nerd",
				"added": 1565294123
			}
		],
		"1565294669_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 43,
				"body": "> [fodase](#comment_9_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): Same principle applies on \"climate change\" propaganda, among others.\n> [woobeewoobee](#comment_2_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf): really any propaganda, and it helps if multiple sources are saying the same thing\n\nIndeed, it can be used for good and bad. \nMass media are one of the most prominent users of this.\nRepeat internet nerds bad, it gets remembered.\nRepeat orange man bad, it gets remembered.\nRepeat masculine bad, it gets remembered.\nRepeat whitey bad, it gets remembered.\nThat's why theres people that know more ins and outs of Trump's bathroom schedule than they know the geography of their own country. The media is their reality. \nBut there is another side. Keep telling that fatty to get thin, and he will. I applied the principle to myself and good things come of it. To think it can only be used by malicious forces is wrong.",
				"added": 1565296744
			},
			{
				"comment_id": 57,
				"body": "> [scotcyguy2](#comment_21_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): If that's true....why was I so shit at French in school :D\nCase in point famalam, you repeated french school so much, that you remember it even now.\nIf you had only one french class in your entire school career, you'd have forgotten. \nTbh",
				"added": 1565362899
			},
			{
				"comment_id": 63,
				"body": "BUMP",
				"added": 1565391105
			}
		],
		"1565297074_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 44,
				"body": "> [btfo](#comment_2_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX): I like KPOPEspecially TWICE, CLC and MOMOLAND\nPost a link please, I don't wanna tire myself searching tbh",
				"added": 1565297421
			},
			{
				"comment_id": 47,
				"body": "> [skazz99](#comment_1_13YvCoYRybBDaZYcQk74gjYJRHNFcCp1zm): Kill pop from FLOTWhttps://www.invidio.us/watch?v=pC3hPMgsGB8\n\nliked it, beginning was a bit too slow for me, the rest of the song I found very enjoyable. \nWill listen to in the future.\nhttps://www.invidio.us/watch?v=AI9isVy1Xv4",
				"added": 1565298621
			},
			{
				"comment_id": 49,
				"body": "> [nicholasp](#comment_2_1BVM1tUAAF6LDVDHWdVegeAntPhSG9w4Kk): Currently just ShareTube http://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/\n> [mfs](#comment_11_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Do we have a ZeroNet answer to invidio?\n\nIf there was a repository of music on zeronet i'd use that instead tbh\nAlso I really like this song:\nhttps://www.invidio.us/watch?v=x2KRpRMSu4g",
				"added": 1565299674
			},
			{
				"comment_id": 51,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_636_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): drop your \"share\" things kiddo, not interested 'in being dumb'. [...]\nI'm quite interested what a schizophrenic like yourself has as music tastes",
				"added": 1565305203
			},
			{
				"comment_id": 58,
				"body": "https://www.invidio.us/watch?v=ec0XKhAHR5I\nA round pointy hat",
				"added": 1565363014
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 54,
				"body": "this guy needs objective proof on why ownership is even a thing\nAnd yet they don't understand why they get laughed at. Let your beliefs influence tangible reality and we can actually have a conversation, tbh",
				"added": 1565317223
			},
			{
				"comment_id": 62,
				"body": "BUMP",
				"added": 1565391088
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 60,
				"body": "schizos lmao",
				"added": 1565363210
			}
		],
		"1565492359_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 65,
				"body": "I don't know what you're referring to with \"turn this world upside-down\", but if you mean taking down, burning and overall entirely erasing the globohomo nightmare we've been living in since the end of world war 2, I'll take that.\nPeople are too complacent. Too spoiled. They might be smart but they are addicted to their comfort, their vices. \nThe television, netflix, porn, videogames, food and all the other sins. All comforts by modern society making them soft, fragile. \nWeak.\n\nSmart does not mean self-aware, or aware at all. I was once like the thing I describe above. The esoteric knowledge I gained from the internet is invaluable in lifting myself up from that cesspool.\nMake those people aware, make them active, make them realise the things they indulge in are a negative and then, then they will do the best for this world. \nDo not expect someone in so much comfort and complacency to stand up by himself. \n\nBut look in the mirror,  you aren't any different. You want to see change, start with yourself.",
				"added": 1565493400
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 66,
				"body": "the holocaust never happened xd",
				"added": 1565493617
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 67,
				"body": "Based. Invade Iran and die for Israel time",
				"added": 1565542309
			},
			{
				"comment_id": 87,
				"body": "bump",
				"added": 1565639754
			}
		],
		"1565542990_1CmgfFAZ5VHekkpKkKAfTX3EcjQjsaKmXR": [
			{
				"comment_id": 68,
				"body": "Why should I care about some hentai site?",
				"added": 1565543783
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 69,
				"body": "> [myriri](#comment_28_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): As expected the trannies make everything about them and force us to focus on them ignoring more important topics.\n\n> communist\n> tranny\n\"awkscually im xyzbdkeib\"\nnot surprised tbh",
				"added": 1565543854
			}
		],
		"1565505415_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 70,
				"body": "Yeah I remember when those supposed 6 million worth of human ashes showed up in Israel :^)",
				"added": 1565543906
			}
		],
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 71,
				"body": "Kelly probably still browses here for a story tbh\nhttps://twitter.com/KELLYWEILL/status/1121896108085710848\nI wanna fuck her so bad bros",
				"added": 1565551002
			},
			{
				"comment_id": 72,
				"body": "Any of you bros know where kelly lives? \nhttps://twitter.com/KELLYWEILL/status/1108893564036096000\nI wanna politely ask her to suck on my pp",
				"added": 1565613856
			}
		],
		"1565601152_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 73,
				"body": "I bet jews taste icky tbh",
				"added": 1565614226
			}
		],
		"1565614209_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 74,
				"body": "> [dreams](#comment_1_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i): i disagree. are the suicides fake too? will these dead people just turn up one day and say, for example: \"surprise! i didn't really blow my head off with a shotgun due to mental illness. that's some fake science shit, dickhead. I was just pretending\" ?\n\nSuicide =/= mental illness.\nBeing a pussy bitch =/= mental illness\nYour local cutting depressed quirky teenage girl is spoiled. She has comfort and complacency, which I agree is not directly the cause but is the prerequisite. Without those prerequisites she would not be depressed.\n\nThere is no depression in the tribes deep in the jungle. The monkey in the trees does not have depression. The fish in the sea does not. Depression however is not sincerely a human condition:\nThere is a chimp that was fat, spoiled, had comfort and complacency. No outside pressures like hunger forcing him to find food. And he snapped from that depression. Also an interesting video on that chimp.\nhttps://en.wikipedia.org/wiki/Travis_(chimpanzee)\nhttps://www.youtube.com/watch?v=wLHCuzW3-uA",
				"added": 1565615846
			},
			{
				"comment_id": 76,
				"body": "> [techtheawesome](#comment_2_15X6BqzUSyF6s3JionhVFccAf52FAJ7Xpd): I disagree on this because being a pussy bitch =/= depression.Its like gaming disorder, people who play 20h/weekend and still go to work normally in weekdays =/= game addicts. Game addicts are classified when they disregard sleep, eat, sit for so long that their leg's tissue starts to die. This also goes depression, people who have them also have extreme behaviour that we can base on and diagnose like chronic sadness,.. etc, its not the same stereotype pussyness is the ones who have depression.  [...]\n\nWe're arguing semantics. Agree to disagree on that tbh\n\nThat gaming addiction stems from the same source, comfort and complacency. \nIf the gamer had the pressure of hunger to be out in the forest finding food, he would not be sitting on his chair wasting his life away.\nSame goes for depression, take away the pillars keeping up that condition, and you will see it fade away really fast.",
				"added": 1565616641
			},
			{
				"comment_id": 78,
				"body": "> [techtheawesome](#comment_6_15X6BqzUSyF6s3JionhVFccAf52FAJ7Xpd): the fact that they didnt, despite awareness of it is what define the illness people have depression cant just magically will themselves out of it even if they wanted to\n\nExceptions do not trump the rule. \nThe guy you describe is an exception. Game addiction in general is not a mental illness. \nThe guy that masturbated for 48 hours is an exception. Masturbation addiction in general is not a mental illness.\nSame goes depression. \nAll is sourced from too much comfort, too much spoils.\n\nThe rich, the succesfull, the ones with the big cars tend to have the most troubles with their own mind, they are on the most pills, most medication for depression among other things. They are so cuddled it destroys them.\n\nThrow away your comfort, throw away perpetual pleasure seeking, as it will only lead to self destruction.",
				"added": 1565617601
			},
			{
				"comment_id": 79,
				"body": "> [223556](#comment_78_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Exceptions do not trump the rule.The guy you describe is an exception. Game addiction in general is not a mental illness.The guy that masturbated for 48 hours is an exception. Masturbation addiction in general is not a mental illness.Same goes depression.All is sourced from too much comfort, too much spoils. [...]\n\nWhy are so many middle class teenagers on SSRI's, xanax, zolof, whatever?\nThey are too comforted, it makes them weak. Both mentally and physical. They get prescribed medications that only numb them to the pain their situations created for them, and does not attack the actual source:\nLaziness, comfort and complacency.\nAnd the real medicine being hardship.\n\nYou will not see the kids in the favela on those same medications, or having the same conditions. They are too busy getting shot and stabbed for that.",
				"added": 1565618178
			},
			{
				"comment_id": 85,
				"body": "bump",
				"added": 1565639739
			},
			{
				"comment_id": 93,
				"body": "Also, I am wondering about how to pull a person out of that spiral of self pity, sadness and loneliness.\nI never quite got close to the kind of despair other people experience, and what I was in myself, I was able to pull out with my own thoughts and actions. \nHowever, how do you do this for another person? What do you tell them?\nObviously they have to convince themself that what you're saying is the right thing \nWhat know-how can I give them that will cause them to better themself?",
				"added": 1565650876
			}
		],
		"1565616025_1NGt8D4sXPBMF7nYD4wDE9Zsj9gtKiqGgH": [
			{
				"comment_id": 75,
				"body": "Welcome to the fray, friend.",
				"added": 1565616082
			}
		],
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 77,
				"body": "Dilate",
				"added": 1565617232
			}
		],
		"1565637531_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 80,
				"body": "She can learn my language any time - suck and fuck\nâ”¬â”´â”¬â”´â”¤ ÍœÊ– Í¡Â°) â”œâ”¬â”´â”¬â”´",
				"added": 1565638053
			},
			{
				"comment_id": 89,
				"body": "Compare their faces, all smiles and laughs. Kelly just has that cold hard psycho stare",
				"added": 1565648639
			}
		],
		"1565638691_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 81,
				"body": "communism is for nerds and fags tbh",
				"added": 1565638737
			},
			{
				"comment_id": 82,
				"body": "> [223556](#comment_81_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): communism is for nerds and fags tbh\n\nhttps://www.youtube.com/watch?v=bHRxu3XrsHg\nLook at these fucking idiots, these are the people that are going to win the civil war? lmao\nthey're the most capistalist cuddled comforted shitheads on planet earth, and perhaps that's the reason they have such a shitty ideology",
				"added": 1565638874
			}
		],
		"1565638982_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 83,
				"body": "Wrong.\nThe labor howard provides is worth more , remember that he is not the owner, he is an employee. He is at the helm of a giant corporation and the moves up there matter alot, his salary is that big for a reason. \n\nI do find the condition of people having to live paycheck to paycheck, very horrible. This corporatism is disgusting. But they mostly have themself to blame, kick the fucking alchohol, kick the cigs, kick the expensive new phone. Live frugally and save money. Be smart. \n\nI don't know a solution, but your leftist tranny garble however is not one. Your supposed end-game is everchanging and it always ends in death. \nI refuse to let that happen. \nAnd a starbuck's service employee is hard work? heh, try metalworking kid.",
				"added": 1565639515
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 86,
				"body": "bump",
				"added": 1565639748
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 88,
				"body": "bump",
				"added": 1565639764
			}
		],
		"1565645808_1NkqJSocDr3nAa6WWDCAHgtf3ftwBUGGCK": [
			{
				"comment_id": 90,
				"body": "Political compass is for losers tbh\nThe holocaust never happened",
				"added": 1565650111
			},
			{
				"comment_id": 96,
				"body": "> [hggggfff](#comment_16_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y): I seriously doubt that if i remember how ham radio, the early internet and the golden time of p2p filesharing was like. [...]\n\ntranny btfo once again.\nI wonder if he'll ever grow out of it.  He shouldn't respond in such a bullshitty way and just made a coherent argument, instead of going on for pages on pages on every single detail like an autist.",
				"added": 1565668125
			},
			{
				"comment_id": 107,
				"body": "> [memesadler](#comment_48_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): So we have an elevated class who is allowed to reap massive profits doing nothing but getting low interest rates. And they earned it all on their own. How do I get in on this? Why are so many in this banking cartel Jewish despite their vast minority? What are their connections?\n\nNepotism tbh\nJust marry a kikess and money will flow. Make sure you sound neurotic and act real stingy tho",
				"added": 1565730836
			}
		],
		"1565644143_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw": [
			{
				"comment_id": 91,
				"body": "> [otterclock](#comment_2_1NP1nJFi28CVWVt5nUkmzCnb9Vcuyau8yN): Don't do opiates, or you'll never cum for hours.\n\nSpeaking from experience there pal?",
				"added": 1565650524
			}
		],
		"1565642608_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 92,
				"body": "wagecucks lmao\nIf your worldview so small that you never see or think bigger than your local tesco supermarket, suicide might be in order for you, tbh",
				"added": 1565650626
			}
		],
		"1565651343_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 94,
				"body": "> [styromaniac](#comment_973_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Might be a blocklist? Usr0 isn't on MOAB though, so some other one, perhaps?\n\nI don't know how to use those and if there was a global one he obviously wasn't on it, as people respond to the post.",
				"added": 1565656935
			},
			{
				"comment_id": 95,
				"body": "> [usr0](#comment_7_1A66iTtvyEopuCML2LGYZMN56dUf9ppLYY): Not sure what's going on either, I can see your posts fine\n\nPerhaps it's just a fluke, as I can see your post now.\nThe specific post I couldn't see was this one:\n>usr0: Depression is a by product of consumerism, individualism and asphalt culture. Embrace national socialism.\nIt's existence only known to me because other people replied to it. I don't know how much I'm missing tbh",
				"added": 1565657376
			}
		],
		"1565689652_1NpBKuyaBfogcHY7Whe1YM59brNqLHmGBn": [
			{
				"comment_id": 97,
				"body": "No, we're all dumb here. You can go back now.",
				"added": 1565689985
			}
		],
		"1565689573_1JjyvqhjWDqSncWvSoGxAGKr4SNXr1Kwpi": [
			{
				"comment_id": 98,
				"body": "Well, this site decentralized, there is no central authority that would represent the political view of the whole userbase.",
				"added": 1565690070
			},
			{
				"comment_id": 99,
				"body": "Well, this site decentralized, there is no central authority that would represent the political view of the whole userbase.",
				"added": 1565690076
			},
			{
				"comment_id": 100,
				"body": "Well, this site decentralized, there is no central authority that would represent the political view of the whole userbase.",
				"added": 1565690080
			},
			{
				"comment_id": 112,
				"body": "My political views correlate with whatever society deems acceptable at the current time.",
				"added": 1565777404
			}
		],
		"1565706281_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 101,
				"body": "â€œNever interfere with your enemy when he is making a mistake.â€\nPerhaps they are friends, they're letting them know their opsec is shit",
				"added": 1565707927
			},
			{
				"comment_id": 102,
				"body": "â€œNever interfere with your enemy when he is making a mistake.â€\nPerhaps they are friends, they're letting them know their opsec is shit",
				"added": 1565707975
			}
		],
		"1565705959_1NVRyK6ptrG3XmmvMp5WEcxfjeeLaDPRDx": [
			{
				"comment_id": 103,
				"body": "Based",
				"added": 1565708218
			}
		],
		"1565716215_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 104,
				"body": "Seething nerds lmao\nSeems they didn't get me\nShould be ruled by the constitution tbh, violation of the 1st amendment\nPlatforms that get so big the population becomes dependent on it, be that google, facebook etc etc, should have it's rules based on the constitution. \nWhat that means is, unless the content is by law illegal to distribute or have (Sekrit docs, CP, Bill clinton's rape mp4s), it cannot be deleted or supressed by the host company.",
				"added": 1565717651
			},
			{
				"comment_id": 105,
				"body": "> [223556](#comment_104_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Seething nerds lmaoSeems they didn't get meShould be ruled by the constitution tbh, violation of the 1st amendmentPlatforms that get so big the population becomes dependent on it, be that google, facebook etc etc, should have it's rules based on the constitution.What that means is, unless the content is by law illegal to distribute or have (Sekrit docs, CP, Bill clinton's rape mp4s), it cannot be deleted or supressed by the host company.\n\ntl;dr\nWhen companies start acting like governments, they will be treated as such.",
				"added": 1565718160
			}
		],
		"1565695545_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 106,
				"body": "Kill politicians",
				"added": 1565726446
			}
		],
		"1565737032_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 108,
				"body": "You need a woman more than a man to increase the population.\nSmells fishy tbh",
				"added": 1565739566
			}
		],
		"1565739655_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 109,
				"body": "> [en1gma](#comment_6_1Dv4WujRBuQiwcfAGHy3aLQxVe3S68xtpc): i know it sounds unbelievable, but it happened.\n\nThe notion that the  people who lied about jew soap, skin lampshades, shrunken heads, steam chambers, electric floors, literal rollercoasters of death, anus gas pumps, and the peddle-drive brain bashing machine aren't telling the truth about gas chambers with wooden doors that open inward is totally unbeknownst to you?\n\nThe holocaust is big business.",
				"added": 1565742952
			},
			{
				"comment_id": 110,
				"body": "The chemistry of auschwitz\nhttps://www.invidio.us/watch?v=g4pEEQz7xoQ\nA great doc, would recommend a watch if you seek truth.",
				"added": 1565743353
			}
		],
		"1565667891_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 111,
				"body": "> [gannarchism](#comment_3_1GKvSWUo9g1J3RscxqQJBrHm7ge8Pdcdb3): can't you just like, not hate people based on things they can't control?\nThe truth will set you free friend. \n\nJew soap, skin lampshades, shrunken heads, steam chambers, electric floors, literal rollercoasters of death, anus gas pumps, peddle-drive brain bashing machine gas chambers with wooden doors that open inward. \n\nAll. Lies.\n\n\"It is easier to fool a man than to convince him he has been fooled\"",
				"added": 1565777335
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 113,
				"body": "There is no omnipotent being.\nThis does not mean however the principles attached should be thrown away aswell.",
				"added": 1565777527
			}
		],
		"1565811747_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 114,
				"body": "Im not gonna read all this garble\n\nThe holocaust never happened",
				"added": 1565831380
			},
			{
				"comment_id": 116,
				"body": "Hot take, all supposedly right-wing, based and redpilled modern political movements are a cuckservative or controlled op and are only there to serve as a distraction to entirely circlejerk instead of an actual solution.\nAmong other: Trump, FN, PVV, AfD, One Nation, etc etc\nThe individuals in these kind of movements are not the smartest of men(Read: boomers), and they would rather have them participate in the rigged politics then realise there is no hope and only violence will get them what they want.\n\nYou want to save your people? Make tons of them.\nYet, Richard Spencer (fat), saves the white race, by having a cute dog and a squarehead russian girlfriend.\n\nPolitics is only a pressure vent for frustration.\nPay as little taxes as possible, stop feeding the system that is actively destroying you.",
				"added": 1565832193
			},
			{
				"comment_id": 128,
				"body": "the virgin effort post\nthe chad holocaust never happened",
				"added": 1565907826
			}
		],
		"1565823101_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 115,
				"body": "Third position, I kill the guy fucking his daughter, I don't want handicapped down syndrome fuckers running around.\n\nFirst thing, no problem.",
				"added": 1565831529
			}
		],
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 117,
				"body": ">E. Can pass the handing over of a password, so you are not charged with obstruction or contempt.\n> obstruction or contempt.\nThat's a thing? Can't you plead the fifth? lmao",
				"added": 1565848177
			},
			{
				"comment_id": 120,
				"body": "> [crazylime](#comment_103_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): You realize this goes for just about everything, not just ZN.  You have no idea what all your phone apps are putting on your storage.  Or your PC apps.  Malware is a problem on all computing devices.  You have the same risk with any closed source third party application you install.  You could have CP on your mobile phone with just the apps you installed from the legit apps store, because many of those contain malware and may be doing who knows what.  There are apps secretly mining crypto, stealing your data, hosting files you don't want.  There's no lack of malicious attacks your devices are under just from the innocent looking apps you install.\n\nYes, but this is spooky scary esoteric h4XX0rman territory and therefore you are misogynist 9/11 truther baby killer incel nazi, so extra care will be given to that exact thing, just to get you.\nThey don't give a shit about a normie's bix nood smartphone's content, as they have no impact.\nAlso a potential argument would be \"Yes but judge, this man downloaded this app from a trustedâ„¢ source, so therefore it is the distributing company's fault and not my client's for this illegal content\" \n\nMeanwhile, zeronet is decrentalized and that argument will not work.",
				"added": 1565852405
			}
		],
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 118,
				"body": ">capitalism\n>socialism/communism\nTwo sides of the same coin. Part of the same problem.\nThe bolshevik revolution was funded by capitalist jewish bankers. \nhttp://www.wildboar.net/multilingual/easterneuropean/russian/literature/articles/whofinanced/whofinancedleninandtrotsky.html\nThe USSR was supplied by capitalist America's lend-lease program, and that being the reason they won. \nAnd nothing has changed since then, your resident black block is funded by those same class of people. All being led by the same delusion.\nThe corporation that funds the NGO that brings in more non-whites, the corporation that hires illegals as they work for less and the skelly commie on the street.\nDo not have tunnel vision. The corruption is everywhere, in every corner of society.\n\nHowever, there is one entity keeping it all together, one ring to rule them all, the government. The system, and the ones protecting it.\nDo you think you're gonna be facing Mohammed, JesÃºs and Tyrone on the street? You're wrong.\nYou're gonna be fighting the authorities. Jim the cop and Mike the soldier more than anyone. Until the system buckles they will die for their paycheck.",
				"added": 1565849069
			},
			{
				"comment_id": 119,
				"body": "> [unadu] work your ass of while your taxmoney pays for 12 refuggees and 50 niggers??\n\nSuck the system dry.\n\nDon't work for this system, don't pay taxes like the lemming. Search up Varg Vikernes, already has 8 and counting to his name, with no job and a meager income.\nTake everything from the system, give nothing back.\nEvery child is a good child. Another person for the future. \nTake welfare, take benefits, take food stamps. You are a leech and that is the point. Death by a thousand cuts.\n\nhttps://www.invidio.us/watch?v=1nN1HqAps4Y \nSome numbers on welfare, 1:30 in.\nIn 13 states, a mother with 2 children receives more in benefits than by earning 15$ an hour at a job.\nEat your heart out.",
				"added": 1565851002
			}
		],
		"1565852058_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 121,
				"body": "> [undisclosed](#comment_42_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): I'm fine with the status quo.  I wouldn't want edits to propagate.\nIt has hilarious potential\n\n>[xxpussyslayer9000] so what do you guys thinkg of gnatzies???\nI FUCKING HATE THEM!!! \n\n>[xxpussyslayer9000] so what do you guys think of black americans???\nI FUCKING HATE THEM!!! \n\nbased",
				"added": 1565864377
			},
			{
				"comment_id": 123,
				"body": "> [lampshade](#comment_12_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR): so if i wrote thief i could change it to nigger?\n\nYes. :^)",
				"added": 1565898380
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 122,
				"body": "> [eighty4](#comment_19_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): Id love to know how many people have muted this dude at this point\n\nhi reddit",
				"added": 1565869331
			},
			{
				"comment_id": 124,
				"body": "> [xlk](#comment_40_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): What about so called \"After Birth Abortion\"? Is that my right as well? Where's the red line? And where's my hairline?\n\nMake it a 40 year old after birth abortion, I really do not care. If you're handicapped, homosexual, a criminal, junkie, whore degenerate and all the other trash that corrupt your people you death is only a net positive. \nThe only reason these abominations like frederick brennan and literal brainlets that only have 20% of their brain are born is because of modern medicine and society's weak mindset. \nI would never wish upon somebody to spend their life like that. And I don't care if hes in or out the womb it makes no difference, it's still a person.",
				"added": 1565899474
			},
			{
				"comment_id": 131,
				"body": ">Lol creationists resort to violence because they can't argue.\nI've never found creationists argue at all with the content in the OP.\nWhen they go argue with pro-choice people, they go off the base assumption that those people think like them, which they do.\nI don't.",
				"added": 1565909158
			}
		],
		"1565889331_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 125,
				"body": "> [pseudonymity](#comment_25_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM): \"who have to be muted, which is not something I want to do as it doesn't actually block them for anyone else\" [...]\n\nIt's dangerous information, in their mind. \nAnnoyance is not the point. They don't care about them seeing it. It goes deeper than just annoyance.\nThey don't want the new user seeing this kind of content, it is too esoteric, too dangerous of information to have to in their minds. \nThe truth will set you free.",
				"added": 1565901342
			},
			{
				"comment_id": 126,
				"body": "> [xcape2net](#comment_304_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Go back a month in ZeroTalk, and you will see that ZeroNet was a friendlier place before the invasion of the 8Chan people.  :(\n\nCloudfare's kneejerk reaction was a blessing in disguise. I've learned alot since then about zeronet and how it functions. Knowing that I can post here with jannies fucking with my shit is liberating.",
				"added": 1565907492
			},
			{
				"comment_id": 139,
				"body": "> [nickwa](#comment_384_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I honestly see less of a cesspool here than on Twitter. ZeroNet is pretty friendly.\n\nIf you're obnoxious, a spammer, whatever, people can just mute you. Because of the nature of decentralized platforms, the individual user holds the power to what they can and want to see, and not be a central authority like the (((trust and safety council))). \nReddit soy dislikes this because they do not seek for themselves to not see the content anymore, but everyone els aswell. It must be censored. \n\nWe are free and boundless, they are shackled and driven.",
				"added": 1565991794
			}
		],
		"1565907502_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 127,
				"body": "This but unironically",
				"added": 1565907576
			}
		],
		"1565542665_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 129,
				"body": "> [bigbadbob](#comment_282_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Im not hungry but ill just eat some more anyways... always room for pie...  and ice cream...  w/cinnamon sugar:)\n\nYou destroy yourself to spite me. You are only hurting yourself. I do not care, eat yourself to death. \nThe smart and intelligent will heed the advice and join me in paradise.",
				"added": 1565907908
			}
		],
		"1565907846_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": [
			{
				"comment_id": 130,
				"body": "> [xianc78](#comment_52_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): Just clone this site and make a forum dedicated to any subject that you are interested in.\n\nThat's too obscure. You'd relatively do alot of labor for just one topic.\nIt needs to be centralized in here, like a sub style reddit. With some general topics being created by nofish and users having the opportunity to make their own. \n I don't know how to do it since I'm a tech brainlet.",
				"added": 1565908337
			},
			{
				"comment_id": 132,
				"body": "> [memesadler] I made this as a split from the general talk area\nAnd you'd need to have the link to actually get in it.\nI'd prefer something like 8chan with a list of different topic talk zites, the pph and the amount of posts to determine where I want to go, or centralized all the way.\n\nCan image posting be added? Ofcourse only as an optional thing to download.",
				"added": 1565909393
			},
			{
				"comment_id": 137,
				"body": "Well gentlemen, it has been solved. Make a group\n We are few now, but when we are many groups can be used to categorise the topics.\nWe don't need any other zite, or bullshit like that.",
				"added": 1565914775
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 133,
				"body": ">this time im serious guys\nyeah ok",
				"added": 1565910210
			}
		],
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 134,
				"body": "Reminder, pedos are\n-lower iq\n-manlets, 2.5 cm below average, double the effect from smoking while pregnant\n-left handed (gay)\n-ugly\nhttps://www.youtube.com/watch?v=EeJxkwrUwAA",
				"added": 1565910648
			},
			{
				"comment_id": 135,
				"body": "> [cryptonrefuse](#comment_9_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8): Over here FBI\n>FBI over here*\nReminder that the FBI ran the biggest pedo site for quite a while lmao",
				"added": 1565910945
			}
		],
		"1565885910_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 136,
				"body": "nice larp tbh",
				"added": 1565914443
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 138,
				"body": "based",
				"added": 1565936713
			}
		],
		"1565966228_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn": [
			{
				"comment_id": 140,
				"body": "Video games are a waste of time and money.\nI will harden up physically and mentally instead of draining my life into a video game.",
				"added": 1565991883
			}
		],
		"1565969602_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 141,
				"body": "Unlike you virgin worker niggers I would be a chad card carrying member of the highest elite of the party.\nMight get drunk and give away crimea idk",
				"added": 1565992080
			},
			{
				"comment_id": 142,
				"body": "> [trotski] Prostitutes would choose clients they wanted and fuck them because they wanted to\nThose are regular girls, how retarded. \nThe mental gymnastics you have to go through to arrive at this belief, lmao\nCommies deserve death.",
				"added": 1565993192
			},
			{
				"comment_id": 143,
				"body": "> [kaffie]\nThat has be a convoluted larp. Like it's trying to make communists look bad.",
				"added": 1565994981
			}
		],
		"1565992280_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 144,
				"body": "> [somerando] eh but bed is so comfy~\nStay weak and dine on your bread and circus like the rest of the sheep. I will become better while you falter in laziness, trash.",
				"added": 1565995531
			}
		],
		"1565995598_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 145,
				"body": "Petty criminals all need the bullet. \n> himself to be the judge, the jury and the executioner over a $2 beer,\"\nHoly based\nYou steal a blade of grass out of my yard you're getting lit up, I'm glad to spend the money in ammunition just to do a service to the community by removing your thief ass.",
				"added": 1565996350
			},
			{
				"comment_id": 146,
				"body": "> [znnex] \nYikes, porky lives rent free in your head. \nGo look at a picture of a nintendo switch to cope with your seething rage",
				"added": 1565997916
			},
			{
				"comment_id": 150,
				"body": "> [hdidnothingwrong](#comment_19_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe): Found a mugshot of Beverly Loverson, the alleged witness.  I bet she is making shit up. [...]\n\nLooks like that lying blob from the Zimmerman trial.",
				"added": 1566049686
			}
		],
		"1565942944_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 147,
				"body": "Ching Chongers better rise up. Their freedom is earned by blood or lost by it.\nThey have no back up, no nation state sending them arms for their revolution. I wonder how they'll solve this problem when they go up against an armed and armored opponent.",
				"added": 1566006392
			}
		],
		"1565969344_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 148,
				"body": "The first mistake was working for the government.",
				"added": 1566006908
			}
		],
		"1566019704_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 149,
				"body": "I only mute spam.\nI find even the most retarded communist might sometime come along and bring a good argument, in which case I wanna respond to it when it's there\n\nDangerous freedom over peaceful echochamber",
				"added": 1566049497
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 151,
				"body": "See you next week",
				"added": 1566050371
			}
		],
		"1566014817_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 152,
				"body": "hebrew fragility\nthat's funny shit",
				"added": 1566050396
			}
		],
		"1566056701_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 153,
				"body": "> [h3bhkj5gqz4n3pjm]\nWhat gets repeated gets remembered friend.\nI will shout what you need to know, constantly, never stopping.\n\nThe struggle is eternal, it never ends.",
				"added": 1566064047
			},
			{
				"comment_id": 154,
				"body": "Never stop saying what is right.\n\nPeople will forget, people will falter.\nMentality will degenerate, crumble into laziness and complacency once again.\nI repeat my goals constantly to myself when I'm doing shit, keeps my moral high and my mind clear.",
				"added": 1566064581
			},
			{
				"comment_id": 158,
				"body": "> [memesadler] Any good suggestions?\nThe chemistry of Auschwitz is a documentary that cemented everything I already thought about it. \nhttps://www.invido.us/watch?v=g4pEEQz7xoQ\nAn image or a PDF that summarizes all the inconsistencies and lies would be great tbh",
				"added": 1566081837
			},
			{
				"comment_id": 161,
				"body": "> [h3bhkj5gqz4n3pjm]the first struggle that must end to free yourself is in you\n\nIndeed, you wanna make a change in this world, start with the man in the mirror.\nThese things don't happen overnight. You have to have the drive and discipline to do what's necessary. \nYou ask a man to die for his people, he will oblige with enthusiasm, but you ask him to suffer, he will be reluctant.",
				"added": 1566143408
			},
			{
				"comment_id": 180,
				"body": "BUMP\nAll shall know",
				"added": 1566253330
			}
		],
		"1566065435_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 155,
				"body": "Based\nHe got caught tho? What a nerd.",
				"added": 1566066979
			},
			{
				"comment_id": 156,
				"body": "> [h3bhkj5gqz4n3pjm]\nbtfo\nSounds like a stupid commie tbh. \nI agree with the actions and the methods but to fail in even this simple task and get caught just shows how retarded and ill prepared you are. \nSame goes for that guy attacking the immigration center in the US, failed spectacularly.",
				"added": 1566068362
			}
		],
		"1566020351_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 157,
				"body": "Learn to articulate. This is not the way.\nCommunication is as important as your message. \nYou come off as a 80s used car salesman that's trying to get me to buy a 100 year old beater for a premium price.\nYou make it more about yourself than the coin, I I I.\nI don't know what's best,\nbut my idea would be to objectively present the product with a touch of humor.",
				"added": 1566069094
			}
		],
		"1566074416_1PGDKdsYUcJajEbqqgb91pJp1rUzznwGvU": [
			{
				"comment_id": 159,
				"body": "> [kidcourageous] On all levels except physical, I am a german\n> [kidcourageous] [heils]",
				"added": 1566083394
			}
		],
		"1566086206_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 160,
				"body": "> [n00dle](#comment_20_1C5WofUXvg54BgL9AiS2Mqdq3erQBGogXB): Heh, good old Kermit. Someone should make him read Mein Kampf & \"leak\" it to some Leftist media for lulz. [...]\n\nWe'll finally go full circle to people only trusting information they hear from the physical people around them",
				"added": 1566088931
			}
		],
		"1566146346_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 162,
				"body": "> [bitwolf] [drunkard ramble]\nWrong.  Stop drinking.\n\nI will not let people destroy themselves. To see someone drink themselves to death, have no money and the general unhappiness from it is disgusting. I refuse to let that happen. I will not be silent while you poison yourself. \nSpite me and drink more, I don't care, only better that you serve as an example.\nThose who are smart will heed the truth and stop ruining themselves.",
				"added": 1566158017
			},
			{
				"comment_id": 164,
				"body": "Only truth matters.\n\nIt does not matter if the pack is with or against me. The truth needs and will be said anyway. \nSociety can get fucked. \nDo not be bound by popularity or peer pressure. Be selfless, give no thought to personal insults or attacks. \nTruth is painful and hard to hear. It is frustrating for someone to challenge your comfort zone, you can see they lash out in anger from it.",
				"added": 1566161329
			},
			{
				"comment_id": 165,
				"body": "> [anonymouslogin] [Blackpill ramble]\nBe healthy. Do not poison yourself.\n\nKeep swimming in your own depressed illusion. Keep being dead weight.\nI will shine in the sun with those worth a damn.",
				"added": 1566162501
			}
		],
		"1566153558_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 163,
				"body": "Assume that all high up politicians, CEOs, talk show hosts, media talking heads, and all other places of power are in the disgusting pedophile clique. Epstein was only brought out because of the sitting president. \nThis has been going on for decades.\nThey all need to die.",
				"added": 1566159939
			}
		],
		"1566159714_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 166,
				"body": "Kill politicians.",
				"added": 1566163499
			}
		],
		"1566165386_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 167,
				"body": "> anime",
				"added": 1566167151
			}
		],
		"1566171789_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 168,
				"body": "They're inspiring tbh\n\nThey had such rapid succes fighting against their own people, it gives me inspiration for my own struggle.\nEven being so inbred, retarded and generally very stupid, they beat out the established military fast and hard. To know that even a retard can accomplish those things tells me someone with real prowess can do it even faster.\nIt took a foreign intervention to stop their advance. Only Russia and America's bombing campaigns caused them to gain ground.",
				"added": 1566173518
			},
			{
				"comment_id": 173,
				"body": "Communism and capitalism are different sides of the same coin.\n\n(Jewish) Bolshevik revolutionaries got their funding from jewish wall street bankers.\nCommunists only won world war 2 because of American materiel provided through lend-lease.\nYPG is dependent on US airstrikes for their success.\nAntifa literally gets into protests by Soros funded busses.",
				"added": 1566180079
			}
		],
		"1566174527_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": [
			{
				"comment_id": 169,
				"body": "Waste of money and braincells tbh",
				"added": 1566175363
			}
		],
		"1566178418_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 171,
				"body": "Yes. I'm the shadow man dabbing on you at night.",
				"added": 1566178624
			}
		],
		"1566175915_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 172,
				"body": "> [anon12621] What for?\nStop being weak. Rise yourself up and bring those around you with you.\n\n-increased bone density\n-improved heart health\n-decreased injury rate\n-increases insulin sensivity\n-reduces risk of cancer.\n\nAsking for a purpose to be healthy, is a problem in and of itself.\nI know the difference between being overweight, depressed and generally feeling like shit, to being fit, vigorious and having all the energy to do whatever I want to achive.\n\nSuch thoughts are only a negative force on yourself and the people around you. They only show how little you care about the state of yourself and the people around yourself.\nComfort and complacency are the causes for such thoughts. Another extension of depression and other wellness diseases.\nBut I cannot convince you to get out of the mental hole you dug yourself in, you need to realise yourself that you are wrong.",
				"added": 1566178976
			},
			{
				"comment_id": 177,
				"body": "FATTIES RISE UP\n(from your gaming chair)",
				"added": 1566212615
			}
		],
		"1566200523_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad": [
			{
				"comment_id": 175,
				"body": "based",
				"added": 1566212274
			}
		],
		"1566178230_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 176,
				"body": "Indeed, deplatformitation(heh) causes an influx new users.\nIt held true for 8chan, but only because there was a group of smart motivated people willing to put in time to make it happen. Like you said, easy to follow instructions. \nEven if the user influx isn't massive, the actual freedom here is invalueble, and with enough propagating of these instructions, by the law of averages, users will trickle in and join the ranks.\n\nPoint being there needs to be an easy guide to get zeronet unto a non-tech savvy individual's computer.",
				"added": 1566212590
			}
		],
		"1566210711_19J2r2jEXdB6jpjPGJtRGSAQQLqPpJFGzV": [
			{
				"comment_id": 178,
				"body": "Ø¢Ø²Ù…Ø§ÛŒØ´ Ú©Ø±Ø¯Ù†\nSend an email to nofish to ask for an Iranian forum lol",
				"added": 1566213792
			}
		],
		"1566216762_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 179,
				"body": "Send nofish an email\nI wanna be able to press a button and scroll all the way down to follow a discussion",
				"added": 1566217324
			}
		],
		"1566256283_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 181,
				"body": "https://www.invidio.us/watch?v=P_R2aGLLqUA\nHeard this one on of those baphometti gore webms, pretty good",
				"added": 1566257141
			},
			{
				"comment_id": 183,
				"body": "> [styromaniac@kxoid.bit](#comment_133_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): It sounds like a bunch of farts.\nwell that's like, your opinion man\n\npost music you like, boomer",
				"added": 1566258722
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 182,
				"body": "The virgin vpn vs the chad bare ip",
				"added": 1566257220
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 184,
				"body": "You're a long list",
				"added": 1566343771
			}
		],
		"1566395604_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 185,
				"body": "We 1984 noaw\nConstrict the noose more, it motivates",
				"added": 1566526276
			}
		],
		"1566746537_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": [
			{
				"comment_id": 186,
				"body": "i asked for an increase in space and i got it \nfirst got a 50k up now a 100k without asking\nshouldn't be that way but it does work tbh",
				"added": 1566781637
			}
		],
		"1567100668_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 187,
				"body": "Walk on. Literally. These people will not change.\nWatch this video:\nhttps://www.invidio.us/watch?v=F1vlpybMwRI",
				"added": 1567268723
			}
		]
	},
	"comment_vote": {
		"176_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"13_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"5_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"62_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"27_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"12_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"6_1EQNT6dAhq1cJPhZrHeSP6PSKNfVLt9Hje": 1,
		"8_1AARpJL8Wxtq6J3iwc5bHinsPxQFc1Z2z1": 1,
		"3_13oVVVvkDc7ekDw3xkrYVQPiTqLurrrgqN": 1,
		"42_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"955_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"90_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"41_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"104_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"22_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": 1,
		"114_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"32_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": 1,
		"2_1E8JvffZu6ejczxGd1eGg9LJw5sRSmHVoz": 1,
		"41_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"32_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"9_13Qv7muvCuG3BqEDzwYAdGtBzoD47Ls7K8": 1,
		"19_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": 1,
		"767_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"141_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"143_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"144_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"2_14ZZDCbrWsetVv3dVGUjKk6f274tvvHQDx": 1,
		"93_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"149_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"789_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"797_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"162_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"9_19nmLTEGX8iQPtCSwQ9TnSDVJRxCBgFpSy": 1,
		"28_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1
	}
}