{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1637321609,
			"title": "bug: images don't load after being uploaded on ZeroMe",
			"body": "Hi!\n\nI've uploaded a ZeroMe image, and here I still don't see it. Is it OK?",
			"added": 1637321608
		}
	],
	"topic_vote": {
		"1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 1,
				"body": "@geekless does your site use zerome permission only to be able to open user's zerome profile?",
				"added": 1635604264,
				"modified": 1635604275
			},
			{
				"comment_id": 2,
				"body": "> [geekless](#comment_57_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Yep\n\nHmm... What do you think about annoying \"grant access\" request if someone doesn't want such functionality?) For example, on my phone, I don't want to download the whole ZeroMe to see avatars here.. Maybe a switch is some settings is possible?",
				"added": 1635605120
			},
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_58_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): display the user avatar\n\nI really love how you(?) have implemented integration with ZeroUp in your blog! I think it's better. Big or optional files may be less reliable, but a person would only need to download those, unlike ZeroMe)",
				"added": 1635605268
			},
			{
				"comment_id": 4,
				"body": "Do you think it would be hard to add different colors to this Zite?\n\nBlue is nice, but I like green more, like the one on my Blog. Also, red, orange, purple come to mind.\n\nI think it's possible to add color palettes to the settings, or even let users set the color they want (latter part I don't know how to implement, but it really should be possible...)",
				"added": 1637320508
			},
			{
				"comment_id": 5,
				"body": "> [smashbuckler](#comment_10_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): green colors\n\nlove the logo! =D\nAnd color combination in nice)",
				"added": 1637370555
			}
		],
		"1637321609_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": [
			{
				"comment_id": 6,
				"body": "It has started to appear, after a while.. Don't know. I've reloaded the zite a few times then. Why would the picture be here now all of a sudden o_O",
				"added": 1637370625
			}
		]
	},
	"comment_vote": {
		"60_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}