{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1621790517,
			"title": "How to defeat Marxists?",
			"body": "Marxists are mushrooming across the western world at a worrying rate. \n\nThey use various tactics, which are more less identical to their previous historical take over attempts.\n\nIt leads to the question, on how to harvest this current crop...\n\nWe don't have to forget, that due to their structure, they follow an ideology, and as such \"leaders\".\n\nContrary to them, we can behave as a swarm, and like termites,  eat them, before they do it to us.\n\nI believe the fastest way to collectively eliminate marxists, is by famines.\n\nThey don't want the free market, let them eat their \"marxist cake\".\n\nOf course it's hard for the inexperienced and naive to see little children and pregnant marxists contaminated human beings perish from hunger... but it works fast. \n\nIn less than 30 days, they are dead.\n\nNow as we have the collective solution to eradicate marxists colonies, let's find ways at an individual level to obliterate them at this isolate level.\n\nAnd let's ask ourselves, what are they? Who are they? and how to win?\n\nMy first idea, is to ignore them.\n\nand the best way is to make ourselves stronger.\n\nBecause if we are stronger individually, the swarm only grows in power.\n\nLet's make, let's build, let's store, let's learn...\n\nSecondly, let's deprive them of everything that isn't profitable to you, for example you have a marxist having a job from you? find a replacement.\n\nYou find a marxist trading partner, fuck him.\n\nSo that we master all, and those little demons even collectively just become feed to us even individually.\n\nin short : the 4 pillars :\n\nstronger, smarter, wiser, wealthier.\n\nlet's win.\n\nAnd Glory to Heroes of the Swarm who will individually annihilate the marxist collective.",
			"added": 1621790516
		},
		{
			"topic_id": 1622481390,
			"title": "UNO global Agenda 2030 > COVID > OCDE PILLAR 1",
			"body": "I think the highly skilled caligraphs of China will quickly get were I am going there... For those in the killing arts, it means that a lot of round eyes and their children will perish for what they attempted to do against WE THE PEOPLE OF CHINA, It may means the real beging of a war cloacked in shadows, were rich white old fucks will be hunted down worldwide by the death squad so fast and mortals that even loyld austin will shit for all the people he knew if he chose to stand against us.\n \nConcretly, the western world + china is facing a redoutable western inbedded domestic enemy, backed by thrid world corrupt nations seeking to loot the generational work of the west while destroying the raise of China.\n\nAs the western forces are stupid and dumb and completly unable to fight, win and kill their own domestic enemies, and as this people have declared war on china, and the world, it seems appropriate to expose you my little theory... Understand that this theory, if proven right change the course of history, once again :).\n\nSo under the current taxing system, based on physical reality, like shops and factories, the market country can extract taxation. It sounds good if you are the west or China... understand that yes a yuge part of the western manufacturing was first moved to china to serve the domestic market who then took over those losers and started to prosper since the opening up by Deng Xiaoping... (when flood of pla/mss assassin start to seek you by order of the CCPSC you are so better to be bin laden hunted by losers who will never have the right to fire)... Conrectly it means that the chinese state and western state are good in this position.\n\nHowever with more and more trade going full automatic, russia and enjoys some transportations benefits (being in the middle, and we know that the ruskies \"green suits\" have deep hands... \n\nNow with this Pillar I the Ocde seeks to modify the whole approach in favor of market countries... which means, where there is high population grow. Sadly, most of those places, BY THEIR OWN FAILLINGS, are nothing more than commercial plantations, ruined and destined to failures, as long as they don't root out the corruptions plaguing them, and I mean all their feodal mindset based on serf / ecological harvesting.\nWith this global tax regime modification, those corrupt people, will be able to extract more taxes that they won't use for their people, but to continue their lifestyle, based on corruption.\n\nWhich results in the west and china, losing out... and a good way to destabilize those countries during the establshiment of this new regime, global id, global tax id, global gov, which by definition will be ruled by those suckers of the third world, or more exactly those enslaving and destroying them since generations... \n\nreleasing a bio weapon structured to wipe china and the old people in europe makes perfect sense.\n\nof course the trisomics in america, always jumps on china china china, as the bag guy for their own issues (neo feodalism ala pedopelosi/trump etc), to be unable to see through the scam, or more exactly being exactly as those people ruling the third world.\n\nthe situation may seem dire, but not for China ! \n\none the buffering of this other plague is processing, meaning the counter strike hasn't yet happen, and it seems that once cleared, it may be the fatal blow to the uno attempt to take over the world.\n\nOf course it's super nice to frame it as an attack by american forces on first the food supply of china with the bioweapon against the pig, to make believe to a pivot to the human (ace2, receptor density) and lead to a further distrust (not lightened by the continuation of american hostilities regarding the integrity of china refering to the island of taiwan).\n\nThe real question is why do they hate us?\n\nfor those in the west who may have commited this their idea is that by merging their corruption into the global system of corruption, anchoring with a one world gov, and start a global tax racket seems a nice idea to foster generational indestructible wealth...\n\none question arising is if the cia is again on the take of this one world gov, trying to become some kind of global enforcement or just to stupid, buzy, arrogant, \"educated\" to see through the constant brainwashing they are exposed to by their 6 private medias group that they pretend to control, but who in reality subvert them constantly by just at every request of the cia to follow order... meaning constant mist of brainwashing masked by collaboration.\n\nI love this theory.\n\n2nd question, Who control this OCDE? I guess it's the UNO? but it could be the vatican (to add a little religious conspiracy to the narration and make it fully interesting)...\n\nanyway, as the saying goes, when china army moves, little pheasant fly... or at least try, through the ranks, as always, knowing that their were they face, will soon be no more.\n\ndo you understand what I am saying?\n\nthis is a war.\n\nwho\nimf\n\ndod (uncertain, way too black, but never know as obidet are clearly lost, open border, regime change etc)... \n\nit's impressive because this framework works...\n\nadd the epstein gang to dislocate cia trust... hmmm... but as the fanatiks would say : I see no reason to nuke now all around israel... \n\nso there is enough time to decypher it and see if it fits the reality... but I like this referential framework...\n\n\nthe problem of those poor fucks (the \"globalists\") is that they can't appreciate chinese patriotism or nationalism, as china is a thousand year old nation (formerly an empire, but it's just the ultimate leadership structure which evolved...(finally)). Why? they don't understand mandarin slang...\n\nand if this theory is proven right, it would too explain the nail gun assassinations in the financial sectors, as those peons got it before I could even have an idea of that... yeah... they always lay crumbs, and worst their ripple (closed sourced shit) travel and travel... to once reach those knowing how to read them...\n\nthis is doom harbinging, level max for the potential enemies, and a lot of lulz for the spectators of this blood bath, I hope it will be gore ! with splashing a lot of those they raised as their kids death... \n\nfight (or think and find what's wrong, and if not, fasten your rocket seat belt...).\n\na little disclaimer, I don't think \"I am so smart\", just found pieces of a puzzle, and curiously they all fit together, but the puzzle dimension is still unknow, and it's more a 3d puzzle, meaning that sometime it interacts with another layer, sometimes not, it's fluid and not as simple surface)...\n\nwelcome to the whales dives... and don't forget to say hi to the squids of war, yeah yeah, it goes deeper, even if you never imagined it, because all those before you already died before the squids :D.",
			"added": 1622481388
		},
		{
			"topic_id": 1622667866,
			"title": "I hope the 26 FBI agents who arrested Roger Stone, will be tortured and then killed, like rabid animals",
			"body": "what's their name, address, biometric data, family? ohh, I am sure this data is well stored acrossed the world, defended by MAD policies, so those little fuckers time will come to be handled as waste, as enemies of mankind, to be tortured, maybe even by being feeded their families before being crucified like the animals they are...\n\nand then swarming up the chain of command until last of those occupiers and seeker of the annihilation of mankind are killed...\n\nwaging war against all componenets of the american regime... until one day, the last of those daring to cary this flag of hell is killed... for finally achieving the relic flag...\n\nthe last american flag...\n\nwar against this putrid perfid deviant fallen nation...\n\none day... never soon enough, but patience is virtue in a fight against the enemies of mankind themselves.",
			"added": 1622667863
		}
	],
	"topic_vote": {
		"1622481390_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 1,
				"body": "> [elr23423nksdasd](#comment_6_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP): I never said I wanted to sensor you. Just pointing out the obvious: You fell for corporate conservative propaganda and all your views in the end just protect big corps, as if people like Jeff had your best interests in mind. It's what conservative media blast you with constantly: the other side is all secretly evil communists. They convince you that the source of your problems isn't the problem, the problem is the solution and we need more of the source of the problem, which lead to insane conspiracy theories because people won't admit that the plain and obvious source of the problem is the problem. Anyone who doesn't agree is secretly evil and part of some grand conspiracy and facts are all fake news. Of course, they're also good at making you feel oh so smart and so much better than everyone. Obviously if I win in a system I'm just better than everyone and it's everyone's fault that they lose. If I win the musical chair, it's because I'm so much better, circumstances be damned and it doesn't matter that there isn't enough chairs for everyone. You think you're so much better that you can kill people, think about that.\n\nYou seem well informed on marxism. I have a few questions.\n\nWhy does marxism need to be hegemonist, aka convert the whole world to marxism? Isn't the ideology and system deriving from it so great and awesome that the successes and utopia provided by it, are in themselves enough to incite everyone to follow the lead? I guess, it's because of the \"capitalists\" in foreign lands that it doesn't work as expected and as such those enemies of the people (capitalists) have to be hung with the cord they sell?\n\nAnd why it's all about marxism, and never about engelsism, leninism, trostkyism (Bronsteinism), stalinism or gorbachevism? Why it's all about marxism? not even maoism... or Deng Xiaopingism? I am confused on this part... castrism (cuba) neither... \n\nThanks in advance !",
				"added": 1621884633
			},
			{
				"comment_id": 2,
				"body": "> [elr23423nksdasd](#comment_7_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP):Tons of propaganda because of fear of change especially by the owner class who stand to lose. [...]\n\nI think you have a transitory lack of understanding about the reality, or maybe it's me who is confused:\n\nI don't fear people who own things and propose to sell those things to me, as it's me who decided what I buy or for whom I work for. As such I don't consider those people to be potential owners of me.\n\nContrary to the collectivists / marxists, who by the use of the state forces (police, judges, politicians, parlements, presidents) believe that they own, my body (forced vaccination, war on drugs), my work (taxation), my savings (taxation), my liberty. Making them technically and literally, my masters.\n\n\n\n> [elr23423nksdasd](#comment_7_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP): Either system only work if many people participate in it. [...]\n\nThat's for me the fundamental difference, in a well regulated market, there is mostly only FREE WILL, as in free market. In a marxist system there is no place for individual liberty (my choice) as all decision are taken by the real owner of the body of man.\n\nI know you can't understand the distinction, be it by a lack of general culture and most probably intelligence or experience...\n\nAnd finally, you know nothing about those stuff, I guess you read once \"marx theory main book\" and moved along chanting with your friends, until they make more money from the market than you and let you down :). \n\nHave fun.",
				"added": 1621968563
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 3,
				"body": "How to destroy the 4th temple - without building it first ^^.",
				"added": 1621968654
			}
		],
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 4,
				"body": "This is what happens when you really want to follow the crowd and do what everyone else is doing:\n\nhttps://www.banthis.tv/watch?id=60ac3aefb0d09748137c5190\n\nA young teen girl is now experiencing shocking medical symptoms after taking the Johnson & Johnson COVID vaccine.\"\n\nThis will probably bankrupt her family. Who will pay these hospital bills? \n\nAs people were warned before taking the vaccine that #1 doesn't protect you or anyone else from COVID and #2 it is an experimental vaccine.  If you take it and your life is destroyed or you die from it, tough shi*, there will be no compensation.  F U!",
				"added": 1621969602
			}
		],
		"1622474302_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 5,
				"body": "I like those who attempt to build selffulling prophecy by trying to craft undefeatable narrative :\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1622481390_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d/UNO+global+Agenda+2030+COVID+OCDE+PILLAR+1\n\nthen, they discover the realm of war... and die (get executed, shot, shelled, burned, ashed or even frozen :D and the list goes on)... ask the survivors :).\n\nbro, don't stand in pla way... \n\nor you die :)\n\nahahha.\n\nand yes it makes me laugh, 1 your arrogance, 2 your desilusion, 3 what are you, but a pawn... \n\nremember PRC...\n\nfind what the p stand for... and note the t before, as 1.",
				"added": 1622481593
			}
		],
		"1622667866_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 6,
				"body": "and that's one thing I profoundly despise in men like michael flynn, beyond running a psyop harvesting scam, is that he wouldn't never have the dignity, honest and sense of duty to line those mother fuckers and kill them... never... muppet.\n\nhow do you think you can fight and defeat those things without killing them one by one? how? by words? pffff... ridicule, pathetic, weak... servile and domesticated.",
				"added": 1622667975
			}
		]
	},
	"comment_vote": {}
}