{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": 1,
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Another solution: government prevents large social media platforms from banning users or removing content unless it breaks the law. Pipe dream that congress would ever do that, but then again, where are the alternative platforms??",
				"added": 1634964259
			},
			{
				"comment_id": 2,
				"body": "> [quantumkitty](#comment_15_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): They're here and all over the place. People just aren't using them for reasons I listed above\n\nYour idea of a viable alternative solution is good, but it doesn't address the issue of how to get everyone onto the same social media site. Either it's been smeared into oblivion like Gab, succumbed to the establishment like Parler, or is explicitly a \"conservative\" social media platform. Obviously the ideal is that everyone uses one neutral and benevolent platform - but how would you get people off the other ones, and how would you avoid what happened to Gab?\n\nDecentralization is an appealing solution but judging by how active this place is it's pretty clear that such a future is far away – not to mention, there would not even be the baseline no-illegal-stuff moderation.",
				"added": 1634964777
			},
			{
				"comment_id": 3,
				"body": "> [transcoder](#comment_39_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): they'd at that point simply come out and make a national ToS which bans those same things anyway. The US government via biden has been instructing platforms to ban so called hate speech for a while now. there was a press conference with Psaki where she stated that outright\n\nIn principle that's unconstitutional, and would be easy to strike down if they tried building it into a ToS.",
				"added": 1634965698
			}
		]
	},
	"comment_vote": {
		"94_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"3_1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93": 1,
		"276_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"7_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1_1PhKRUSRcgdvTe1X3SLNYe7CmpaFDn92HB": 1,
		"1_1Hiqq5zy6pScwUbR3wzLL2MrprBEDBfK9z": 1
	}
}