{
	"title": "Pour la France",
	"description": "APoil",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1501185421,
	"post": [
		{
			"post_id": 8,
			"title": "En vacances",
			"date_published": 1501185149.193,
			"body": "![47813_1454058344397_1021454971_31115234_5283772_n.jpg (0x0)](data/img/post_8_47813_1454058344397_1021454971_31115234_5283772_n.jpg)"
		},
		{
			"post_id": 7,
			"title": "Autre distro pour Raspberry",
			"date_published": 1496954075.684,
			"body": "Tenez je viens de tomber la dessus un peu par hasard, en gros c'est comme un Home Cinema sur le Raspberry Pi ;)\n\nhttps://www.max2play.com/download/18906/"
		},
		{
			"post_id": 6,
			"title": "Linutop OS et Raspberry pi",
			"date_published": 1496266878.211,
			"body": "[http://127.0.0.1:43110/1E7cBjoPgdgcDjSDUGZLDUUMHFBLozQGos](http://127.0.0.1:43110/1E7cBjoPgdgcDjSDUGZLDUUMHFBLozQGos)\n\nCet article parle du système Linutop OS qui peut maintenant être porté sur Raspberry pi ;)\n\nIl faut que je test ça bientôt!"
		},
		{
			"post_id": 5,
			"title": "Payer la TV en France...",
			"date_published": 1496214958.515,
			"body": "L'impôt s'appelle la redevance et ça me coûte 140€ par an... Quand je vois la merde qui passe à la TV, j'ai vraiment envie d'arrêter de la payer. Les médias qui mentent, qui racontent n'importe quoi, qui crachent un peu sur les hommes politiques (mais pas trop, parce que ces derniers font des cadeaux fiscaux aux journaleux..) etc...\n\nA la base, cet impôt devait servir à financer les retraites et aider les personnes âgées mais évidemment, c'est parti dans des causes bidons... Déjà, enrichir indiractement les hommes politiques et ensuite payer des affaires... Comme d'habitude, les contribuables n'ont pas de retour sur investissement.. Les impôts augmentent tous les ans, et rien ne nous profitent! Il n'ya pas d'argent pour les hôpitaux, les retraites, les routes, les infrastructures mais pour faire construire des mosquées et faire construire des pièces d'architectures vraiment horribles, sans oublier le changement de nom des régions de France (qui coûtent des millions...), là y'a pas de soucis...\n\nLes journalistes lèche-cul de ce pays n'en mènent pas large alors qu'ils sont très bien informés quand ils veulent (le canard enchaîné)..\n\nJ'aimerais bien que la redevance TV serve à inciter la création de chaînes à l'exemple d'ARTE.. Ce sont de véritables journalistes, à l'image de Wikileaks. Arte est une des seules chaînes qui n'abrutissent pas les gens, avec leurs émissions et documentaires.\n\nDonc en 2018, je demanderais à ne pas payer la redevance TV. Je vous donnerai la marche à suivre!"
		},
		{
			"post_id": 4,
			"title": "Stockholm maintenant...",
			"date_published": 1491587507.17,
			"body": "Allez, quel est le prochain pays? Un d'Europe je suppose, puisque tout le monde peut entrer et venir sans aucune limitation...\n\nLes frontières doivent assurer leur rôle..."
		},
		{
			"post_id": 3,
			"title": "Elections présidentielles 2017",
			"date_published": 1490365552.964,
			"body": "Elles sont plombées par les scandales et les affaires gauche / droite..\n\nEn tant que contribuable, je m'aperçois de plus en plus que mon argent est dilapidé dans tous les sens, sauf pour moi et le peuple français... Mon quotidien se dégrade, je paie de plus en plus d'impôts, je n'aurai pas de retraite, l'immigration est favorisée, les cas soc' pullulent à l'aide des aides sociales...\n\nLe gouvernement dit qu'il n'y a pas d'argent pour les hôpitaux, les routes, les retraites, la Sécurité Sociale... MAIS IL Y A DE L ARGENT POUR LES CLANDESTINS ET LES AFFAIRES POLITIQUES!\n\nIL FAUT QUE CA CHANGE URGEMMENT"
		},
		{
			"post_id": 2,
			"title": "Il est temps!",
			"date_published": 1490285260.021,
			"body": "Il faut fermer nos frontières, comme le font 95% des pays du monde. On voit bien, avec l'attaque de Londres, que l'on doit cesser d'accepter toute la misère du monde. L'afflux de migrants étant toujours de plus en plus important ( surtout avec l'accord de la Turquie), on est submergés de tous les côtés, on ne maîtrise plus rien.\n\nLa France est dépassée de partout, elle est la risée du monde.. Tout le monde vient se faire soigner gratuitement, alors que nous, contribuables et citoyens, nous n'avons pas les moyens de nous soigner de manière honorable.\n\nLe constat est le même pour les retraites: les travailleurs Français ne sont pas mieux logés que les étrangers, bien au contraire. Un immigré qui reste 2 ans en France et atteint 65 ans, touche dans les 850 € / mois. Un Français au SMIC toute sa vie ne gagne pas ça alors qu'il a cotisé pendant 42 ans et même plus.\n\nLa France va droit dans le mur, les pays étrangers l'ont bien compris, il suffit de regarder leur presse. Quant à la nôtre, bien sûr, elle est à la botte du gouvernement donc elle nous cache tout!\n\nBon à plus tard les patriotes!"
		},
		{
			"post_id": 1,
			"title": "Pour ma France chérie",
			"date_published": 1486076400,
			"body": "Tous les jours, on assiste lamentablement à de la connerie numérique et \"intellectuelle\". Les chaînes d'info de merde qui font tout pour rendre les Français abrutis.. Il suffit de voir la génération qui arrive. Beaucoup de gosses instrumentalisés par les réseaux sociaux et le manque d'instruction de leur famille...\nON EST DANS LA MERDE"
		}
	]
}