{
	"title": "ZeroNet@Balancer",
	"description": "ZeroNet и другие распределённые p2p-социальные сети",
	"links": "*   [Balancer's Blog](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)\n*   [Info@Balancer](/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/)\n*   [Balancer's Wiki](/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/)",
	"next_post_id": 57,
	"demo": false,
	"modified": 1541852250,
	"post": [
		{
			"post_id": 56,
			"title": "Flickr RIP",
			"date_published": 1541851684.428,
			"body": "_[Кросспост с Хабра](https://habr.com/post/429148/#comment_19348508) на тему закрытия 1Тб места на Flick с удалением архивов пользователей._\n\n…\n\nСколько их таких было… Год за годом подтверждается утверждение, что централизованным сервисам в отношении долговременного хранения данных верить нельзя. Никогда. Что бы они не обещали и какая бы у них не была до этого репутация. Сменятся в очередной раз менеджеры и очередные труды юзеров превращаются в тыкву.\n\nРекомендуемым тут селфхостам тоже верить нельзя. Мало кто озаботится бэкапами. Пропадёт интерес. Наконец, человека не станет — и всё, ничего не останется. У меня так несколько раз наследие почивших знакомых пропадало… Жизнеспособность таких решений ещё ниже, чем централизованных.\n\n![1529054871_Nash-sayt-pereezzhae_demotions.ru.jpg (700x628)](data/img/post_56_1529054871_Nash-sayt-pereezzhae_demotions.ru.jpg)\n\nС распределёнными решениями всё сложнее. Да, очень интересно выглядят таковые, например, на #ActivePub. Тот же #Mastodon, если в роли микроблогов, но фотки с тегами можно и там размещать. Активно пилится и «вот-вот почти работает» #PixelFed — это уже полноценный фотохостинг. Но с ними практически та же беда. Сеть в целом при проблемах конкретных узлов будет работать как ни в чём ни бывало. Но вот пользователям таких нод ничуть не легче. Упал твой сервер — всё, как ни в чём ни бывало ты продолжить работать не сможешь. И ссылки снова становятся тыквами.\n\n* * *\n\nИдеальным решением тут были бы полностью децентрализованные решения, типа моей любимицы, #ZeroNet. Но и там есть свои косяки. На публикацию в ZN нельзя дать гарантированно долгоживущую ссылку из в обычном Интернет. Да, есть публичные ZN-прокси (гейты), через которых можно получить доступ к контенту ZN, в том числе по прямым ссылкам. Но они, как правило, недолговечны, их легко блокируют из-за того, что наряду с легитимным контентом они предоставляют доступ и к противозаконному. Ссылки после этого при ручной замене хоста на другой будут жизнеспособны, но это требует активного действия читателя, это сегодня для большинства сложно и не нужно. Другая проблема — в ZN сегодня нет качественных фотохостингов. Есть собственные блоги — фотографии можно размещать там. Но не это не нормальные фотогалереи. Есть пара ранних реализаций фотогалерей, но они кривые и глючные… Для себя я, всё же, выбрал в качестве базы для долговременного хранения публикации в блогах ZeroNet, «бессрочность» хранения и независимость от сторонних людей подкупает. Но ссылки на свои материалы я даю через свой же прокси, и когда он накроется, то хотя материалы в ZN будут доступны, ссылки в обычном Интернете пропадут…\n\nСловом, идеала нет. Но твёрдо ясно одно: централизованные ресурсы в отношении долговременного хранения — это худшее из плохого :)"
		},
		{
			"post_id": 55,
			"title": "ZeroNet прокси proxy.zeronet.a0z.ru",
			"date_published": 1541148864.328,
			"body": "Я тут одно время начал бездумно кидать в клирнет ссылки на свои ZN-ресурсы через [www.zerogate.tk.](http://www.zerogate.tk.) Но этот прокси, оказывается, работает весьма не часто. Так что решил забить на прозрачность добавления и для _легитимных_ ресурсов давать ссылки через мой старый полузаброшенный proxy.zeronet.a0z.ru. По крайней мере его работоспособность я могу поддерживать :D Добавление новых сайтов там заблокировано, но я надёргал кучу ресурсов, которыми пользуюсь. Если надо добавить кого-то ещё, чтобы и другие могли давать ссылки через него — пишите, добавлю. И, наоборот, если там увидите ресурс, нарушающий те или иные законы, который я зевнул, свистните мне, я его почищу. Не хочется, чтобы этот прокси блокировали :)"
		},
		{
			"post_id": 54,
			"title": "Логика в ZeroTalk",
			"date_published": 1541147548.873,
			"body": "Если в блеклист вносится топикстартер, то весь топик не показывается. Это, в общем, не есть хорошо, потому что потом не контролируешь, что пишут другие в топик. И там тоже могут быть люди, которых надо банить :) А так получается, что можно распространять контент, который ты распространять не можешь/не хочешь. Наверное, надо будет на своих патчах ZT такое поведение поправить. Если, конечно, это не на уровне вообще ZN-фреймворка."
		},
		{
			"post_id": 53,
			"title": "Статистика переходов",
			"date_published": 1539411571.574,
			"body": "В ZeroTalk нет никакой статистики популярности топиков. Но немного оценить интересы простых смертных можно через количество переходов (Views), которое считается на моём [централизованном форуме](http://forums.balancer.ru/viewforum.php?id=253) :)\n\n![2018-10-13_09-19-09.png (844x872)](data/img/post_53_2018-10-13_09-19-09.png)"
		},
		{
			"post_id": 52,
			"title": "Ловите ветер всеми парусами ©",
			"date_published": 1539084636.12,
			"body": "На фоне грядущего закрытия G+ очень удобный способ активации пропаганды ZeroNet :) Я этим на своих ресурсах уже занимаюсь, но чем нас будет больше, тем оно весомее :D\n\n![googleplusevil-495x247.jpg (495x247)](data/img/post_52_googleplusevil-495x247.jpg)"
		},
		{
			"post_id": 51,
			"title": "Странное с трафиком",
			"date_published": 1538258186.052,
			"body": "Сегодня заметил, что [River of News](/newsriver.bit/) порождает огромный входящий(?!) и выходящий трафик. Собственно почти весь суточный трафик — его, что-то сильно за гигабайт. Всего за период с установки: _Получено: **27098**.89MB, Отправлено: **39761**.65MB_. Снёс нафиг, даже не стал разбираться, что там гонит такой объём.\n\n**P.S.** _дизайна блога не пугайтесь, это не надолго, потом допилю — просто, как всегда, если ждать, пока доделаю до конца, то никогда не доделаю :D_"
		},
		{
			"post_id": 49,
			"title": "ZeroNet без Интернет ;)",
			"date_published": 1537544596.863,
			"body": "Отвалился дома Интернет. И тут же, бац — от Билайна SMS с извинениями. Первый раз такое получаю за много лет :D\n\n![Capture__2018-09-21-18-18-19.jpg (1001x900)](data/img/post_49_Capture__2018-09-21-18-18-19.jpg)\n\nНу, на мобильном пофиг, а вот прибитый гвоздями к домашней сети десктоп простаивает. И только ZeroNet можно спокойно пользоваться :D Да, синхронизации нет, но то, что загрузилось — доступно и интерактивно. Как в прежнюю эпоху FIDO :)\n\n**Update от 04:33**: Сижу, пишу по форумам, в ZeroMe… И машинально поглядываю на ZeroHello, нет ли ответов :D Кстати, возможен финт ушами. Можно засинкать ZeroNet с ноутом, а потом вывести его в Интернет через телефон. И всё написанное, по идее, уйдёт в сеть. Или даже прямо с телефоном сперва в локалке попробовать засинкать (там у меня ZeroNet-клиент стоит), а потом с телефона в Интернет отправить. Наверное, так сейчас и сделаю, а то ноут цеплять ломает. Только с ZeroMe этот трюк не пройдёт, из-за миллиона мелких файлов, я на телефоне ZeroMe не держу.\n\n---\n\n**Update от 11:31**: Кстати, отправить сообщения ночью через телефон так и не вышло. Что-то у меня ZeroNet под Android сломался o_O Надо будет переустановить:\n\n![Capture__2018-09-22-04-39-23.jpg (542x900)](data/img/post_49_Capture__2018-09-22-04-39-23.jpg)"
		},
		{
			"post_id": 48,
			"title": "ZeroLSTN работает",
			"date_published": 1537049910.307,
			"body": "Прогресс. Сижу, слушаю свой [рабочий плейлист](/ZeroLSTN.bit/?/playlist/1528087000296) (пока ещё частичный, тестовый) в #[ZeroLSTN](/ZeroLSTN.bit/). Дозрело до использования :) И никакой злобный буратино не выпилит…\n\n![2018-09-16_00-53-48.jpg (1200x676)](data/img/post_48_2018-09-16_00-53-48.jpg)\n\nСегодня добил, таки, CORS-ошибки при использовании ZeroLSTN через Web-прокси. Так что можно слушать в дороге онлайн :)"
		},
		{
			"post_id": 47,
			"title": "Обсуждения разные",
			"date_published": 1535280730.411,
			"body": "Три условно свежих топика на #LOR по теме распределённых сетей:\n\n- [Безопасная альтернатива социальным сетям](https://www.linux.org.ru/forum/security/13486945)\n- [У кого есть собственные узлы Diaspora-ы?](https://www.linux.org.ru/forum/talks/14424973)\n- [Твиттер РИП, да здравстует Мастодон!](https://www.linux.org.ru/forum/talks/14433779)"
		},
		{
			"post_id": 46,
			"title": "IPFS в ZeroNet на примере хостинга картинок",
			"date_published": 1525606931.52,
			"body": "В ZeroNet нет нормальных решений для хостинга картинок на одних сайтах с целью вставки на другие сайты. Когда-то давно в таких случаях зайт подгружался автоматически по любому запросу на его файл по ссылке, но по очевидным причинам такое поведение было изменено. И теперь при попытке открыть ссылку на левый зайт появляется запрос о загрузке этого зайта.\n\nНо в случае ссылки на картинку такой подход не сработает. Нужно или предупреждать пользователя, чтобы он загрузил необходимый зайт или пользоваться ресурсами Интернет (Клирнет), чтобы иметь постоянную и загружаемую ссылку на картинку.\n\nТут есть два подводных камня:\n\n1.  Многие ресурсы Клирнета не гарантируют со временем доступность файлов вообще и по хотлинками в частности.\n\n2.  Некоторые пользователи Даркнета блокируют обращения к сайтам Клирнета.\n\nВыход может быть такой:\n\n1.  Грузим картинку в IPFS. В частности, через хостинг картинок [ipfs.pics](https://ipfs.pics/). Однако, отдаваемые им ссылки не лучший вариант. Во-первых, нет гарантий того, что этот сервис не накроется в будущем (он уже не раз падал), во-вторых, он часто тупо тормозит. К тому же у него нестандартный формат IPFS-ссылок, поскольку принято, что они хранятся в каталоге `/ipfs/`.\n\n2.  Меняем в URL полученной ссылки `https://ipfs.pics/` на `https://gateway.ipfs.io/ipfs/`. Это стандартный гейт IPFS, быстрый, надёжный и, главное, стандартный.\n\nПосле второго пункта наступает рай для даркнетчиков. Они могут поднять у себя IPFS-демон («поднять» в простейшем случае = [скачать архив с бинарником](https://dist.ipfs.io/#go-ipfs), распаковать и запустить `ipfs daemon` — всё) и поставить в браузере одно из IPFS-расширений. Например, [для Хрома и Оперы](https://chrome.google.com/webstore/detail/ipfs-companion/nibjojkomfdiaoajekhjakgkdhaomnch) ([GitHub](https://github.com/ipfs-shipyard/ipfs-companion)). Расширение само определяет наличие локального IPFS-демона и при его наличии все похожие на IPFS ссылки направляет на него. При отсутствии такого демона — на публичный гейт. Тоже может быть полезно, если кто-то использует нестандартный гейт.\n\nВот и на картинке пример такой переадресации:\n\n![](https://gateway.ipfs.io/ipfs/QmaZT9ghH7cJrtC1uso9dha22RAHQKeCWJLYSARM3pj1sz)\n\nОстаётся, правда, некоторый минус в том, что когда-то может накрыться ipfs.io, а картинки с него при отсутствии к ним обращений будут вычищены их кешей гейтов, но тут уже могут помочь энтузиасты, запинивая IPFS-файлы по ID :)"
		},
		{
			"post_id": 45,
			"title": "Как сделать свой ZeroNet-прокси",
			"date_published": 1524768176.702,
			"body": "_Для [mastodon.wrk.ru/@balancer/99927242450927526](https://mastodon.wrk.ru/@balancer/99927242450927526)_\n\nОгромный плюс ZeroNet в том, что можно давать доступ к его материалам из обычного Web'а. Для этого служит так называемый «механизм прокси», когда фактически включается мультипользовательский режим. Всё, что для этого нужно, переименовать каталог `plugins/disabled-Multiuser` в `plugins/Multiuser`.\n\nНо есть большая проблема. Пользователи таких прокси, хотя не имеют доступа к системным функциям, могут сами добавлять зайты. И это хорошо. По началу. Потом вся нода быстро оказывается забита тоннами прона :) В этом случае может помочь опция `--multiuser_no_new_sites`. Пользователи смогут спокойно посещать имеющиеся зайты, но не смогут добавлять новые.\n\nНу и так прокси будет открыт на стандартном порту 43110 на localhost'е. Хотя можно указать другие IP и порт, часто удобно посадить ZeroNet за NginX'ом и отдавать его контент по доменному имени. Для этого нужно в самом ZN разрешить работу с этим именем: `--ui_host proxy.zeronet.a0z.ru`. И в NginX сделать соответствующий конфиг:\n\n```conf\n\nserver {\n    server_name proxy.zeronet.a0z.ru;\n\n    location / {\n        proxy_pass        http://127.0.0.1:43110;\n        proxy_http_version  1.1;\n        proxy_set_header    Host        $host;\n        proxy_set_header    X-Real-IP   $remote_addr;\n        if_modified_since   before;\n\n        proxy_read_timeout  600s;\n        proxy_send_timeout  600s;\n\n        access_log /var/log/nginx/$host-access.log;\n    }\n\n    location /Websocket {\n        proxy_pass http://127.0.0.1:43110;\n        proxy_http_version 1.1;\n        proxy_read_timeout 1h; #for long live websocket connetion\n        proxy_set_header Upgrade $http_upgrade;\n        proxy_set_header Connection \"upgrade\";\n    }\n}\n```\n\nТак и работает прокси [https://proxy.zeronet.a0z.ru](https://proxy.zeronet.a0z.ru) — ну, разве что там https используется, но это другая история :)"
		},
		{
			"post_id": 44,
			"title": "Распределение Даркнета",
			"date_published": 1524700285.665,
			"body": "Фальстарт (см. комменты)\n\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/1524658997"
		},
		{
			"post_id": 43,
			"title": "Работа над",
			"date_published": 1524329414.525,
			"body": "Сегодня довольно продуктивно поработал над ZeroTalk и ZeroBlog. Обновил ряд своих зайтов. Освоил работу с исходниками на CoffeeScript, поковырял, как оно работает с БД. Думаю, сделать разбивку по страницам в ZeroTalk, чтобы получить классические форумы, проблемы не должно составить. Но вот как туда всобачить аттачи картинок — это надо ломать голову. Может, попробовать сделать это через допиленные имиджборды, типа Millchan? Оно будет требовать лишнего телодвижения, зато позволит разделить лёгкий текстовый контент форума от тяжёлых аттачей. Что идеологически чуть более верно. Особенно, если этот контент  в Милчане опциональный (надо пощупать будет)."
		},
		{
			"post_id": 42,
			"title": "Работа над ZeroTalk",
			"date_published": 1524308245.553,
			"body": "Решил к допиливанию ZeroTalk подойти всерьёз и правильно.\n\n*   Завёл [«мой референсный» ZeroTalk](http://127.0.0.1:43110/15zr8fG5h9FZu6dt5CC9kQ1F7PMpiGu6Tm). Будет использоваться для первичной разработки (и, если кому что-то нужно, обсуждения разработки)\n\n*   [Завёл форк](https://github.com/Balancer/ZeroTalk) оригинального ZeroTalk, чтобы патчить не компилированый уже JS, а оригинальный CoffeeScript.\n\n*   Буду все свои копии ZT клонировать с этой версии.\n\nПока отличия чисто косметические:\n\n*   Возможность настроить в конфиге баннер (красную фигню сверху-слева) и навигационное меню.\n*   Показываются картинки и видео по ссылкам (аттачей нет и не скоро будут, я даже не знаю пока как к ним подступать)\n*   В тексте, чисто под свои задачи, в списке поддерживаются `[x]` чекбоксы.\n*   Зайт приведён в нормальное для разработки состояние. Ну и хоть пощупал вкратце, что такое CoffeeScript :)\n*   Русский язык «из коробки»"
		},
		{
			"post_id": 41,
			"title": "Приложения ZeroMe",
			"date_published": 1518927860.315,
			"body": "Попался ещё один интересный интерфейс к ZeroMe. Явный закос под Mastodon. Неплохо выглядит, но, к сожалению, фигово работают картинки.\n\n[http://127.0.0.1:43110/sakana.bit/](http://127.0.0.1:43110/sakana.bit/)\n\n![2018-02-18_07-22-24.jpg (1200x646)](data/img/post_41_2018-02-18_07-22-24.jpg)"
		},
		{
			"post_id": 40,
			"title": "Движки ZeroBlog'ов",
			"date_published": 1518925554.174,
			"body": "Категорически не хватает тегов :-/ Конечно, есть ещё [ZeroBlogPlus](/15mSYzsDxzarssqtV1pFPKqoCTaLdjVB2f/). Но он базируется на старой, с глюками версии ZeroBlog. Надо бы как-то попытаться накатить изменения из него на нынешний ZeroBlog.\n\nВ копилку: есть ещё [Poster](/1J2ZJjs97wEcW36x5d9f1QnPVPVDv8wbJ/) — но формат этого блог-движка слишком нестандартный, вебдванольный и без тегов."
		},
		{
			"post_id": 39,
			"title": "Мысли о фотоальбомах в ZeroNet",
			"date_published": 1517966091.64,
			"body": "С [видео в ZeroNet](/1GmoFQHVjYj4xDZZ5oMNnkGhvnfY1w3pPM/?Post:18:Лошадь+Апокалипсиса+в+Москве) более-менее устаканилось. Теперь в том же духе и в свете отказа от IPFS надо подумать о фотках. Первой мыслью когда-то у меня было выкладывать полноразмерные [тяжёлые фото в IPFS, а в ZeroNet в блогах класть превью](/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:22:Фотографии+в+блогах) и ссылки на полноразмерный вариант в IPFS. Потом, во-первых, стало лениво делать это вручную, во-вторых, я [разочаровался в IPFS](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:28:IPFS:+разочарование) и я начал выкладывать фотки как есть, средствами ZeroBlog. Т.е. средним размером. С одной стороны, это создаёт независимые, базирующиеся только на ZN зайты, с другой, создаёт приличные объёмы и не создаёт выкладывать полноразмерные фото, а они бывают иногда нужны :)\n\nСейчас думаю продолжить свой тренд делать всё средствами ZeroNet и для жирных фоток делать отдельные блоги-фотоальбомы. Лёгкость клонирования диктует не лепить всё в одну тяжёлую кучу, общий зайт со всем на свете, а делать отдельный клон под каждую атомарную порцию данных. Фотоальбом прекрасно под это подходит. Можно, конечно, делать совсем статический сайт, но тогда нельзя будет, например, комментировать его. Поэтому удобно задействовать ZeroBlog. А фотографии туда класть в виде обычного ZeroBlog-превью на 200k + полноразмер в виде опционального файла. Последнее, правда, пока потребует жёсткой ручной (то есть скриптовой, конечно) работы. Но получиться должно интересно.\n\nВ идеале, конечно, в ZeroBlog должна быть возможность делать такое автоматом. Загрузил фотку, а она вставилась не в уменьшенном виде, а в виде опционального полноразмера и так как сейчас."
		},
		{
			"post_id": 38,
			"title": "«Проверить файлы»",
			"date_published": 1517383597.22,
			"body": "Обнаружил неприятность. Зашёл через прокси в свой блог — вижу комменты, которых нет у меня на локалхосте o_O «Обновить» не помогает. А вот после «Проверить файлы» комменты внезапно появились.\n\nПотыкался в собственные зайты и в избранное — в ряде случаев после команды «проверить файлы» увидел процесс закачки файлов.\n\nПолучается, что ZN иногда «затыкается» и не замечает файлы. Видимо, надо поставить периодический вызов `siteVerify` в cron."
		},
		{
			"post_id": 37,
			"title": "География ZeroNet",
			"date_published": 1516392785.721,
			"body": "В обновлённой версии ZeroNet появилась более подробная статистика. Трафик, зайты и т.п. Интересна раскладка пиров по странам :)\n\n![2018-01-19_23-12-42.png (1341x406)](data/img/post_37_2018-01-19_23-12-42.png)\n\n**Update**: обновил домашний сервер. Тут цифры потолще:\n\n![2018-01-19_23-24-37.jpg (1200x371)](data/img/post_37_2018-01-19_23-24-37.jpg)"
		},
		{
			"post_id": 36,
			"title": "zeronet.a0z.ru",
			"date_published": 1514620508.993,
			"body": "Обновил страничку [http://zeronet.a0z.ru/](http://zeronet.a0z.ru/)\n\nОсвежил процесс инсталляции под Windows, добавил пару ссылок."
		},
		{
			"post_id": 35,
			"title": "Видео в ZeroNet",
			"date_published": 1514541973.962,
			"body": "Продолжение эпопеи. Пока не зарелизят обновление Rev3173+, с которым можно будет попробовать дальше ковырять автоматическое подключение по запросу ZeroUp-зайта с видео, решил, всё же, не останавливаться и заменить всюду YouTube на ZeroNet, а про необходимость загрузки соответствующих зайтов просто указать в описании. Раскидал видео, частично по ZeroUp, частично по своему клону. Одна только ссылка не была заменена, т.к. там 360°-видео, которое в HTML5 в лоб не показать.\n\nТак что отказ от YouTube, со всеми его минусами, можно считать практически состоявшимся :)\n\nИнтересно, что последнее видео с локальной машины (за NAT) никак не хотело уходить наружу. Само описание ушло сразу и легко, а вот в сидах «снаружи» всё время был 0. При том, что желающих скачать сразу было 15-17 пиров. Около часа, наверное, извращался, прежде чем ушло. В другой раз буду аплоадить сразу на внешний сервер.\n\nВот чего в ZeroUp не хватает, это описания файлов. Желательно, с Markdown :) А то ко многим файлам было бы полезно добавить подробности, например, со ссылкой на блог, где лежит подробная информация."
		},
		{
			"post_id": 34,
			"title": "Китайцы в ZeroMe",
			"date_published": 1514315530.855,
			"body": "Смотрю, в ZeroMe сейчас процентов 90 трафика — китайский. Ну, китайцев в ZeroNet дофига, но всё равно — много как-то, обычно и они раньше на английском писали больше. Интереса ради почитал через Гуглопереводчик. В принципе, и перевод с китайского в нём заметно лучше стал. До уровня почти готовых текстов с английского не дотягивает, но смысл уже понятен, а не как когда-то «голубой круг кусать железо» :) В основном срачи на тему религии. Исламизм, терроризм, атеизм как религия и всё то, о чём у нас на форуме модно было сраться лет 10 назад :)\n\nПример перевода без редактирования:\n\n> Похоже, что исламский культ не позволяет снимать образование. Это относится к культу. В нормальном мире свобода от религии свободна. Свобода от политических партий различна, тогда как культизм иной. Это больше похоже на продажу пирамид.\n> \n> Однако ужас МЛМ заключается в том, что в нем есть мечети как основа для обучения террористическим идеям, постоянный поток продукции.\n\nИнтересно, что не смотря на громоздкие картинки иероглифов, текст на китайском языке занимает заметно меньше места, чем на русском :) Иероглифы компактнее слов."
		},
		{
			"post_id": 33,
			"title": "Тормоза ZeroHello из-за ZeroMe?",
			"date_published": 1514314355.981,
			"body": "ZeroMe, кстати, с некоторых пор стала чудовищно тормозить стартовую страницу. При чём, что интересно, после удаления соответствующего зайта заново добавить не могу — создаётся пустой каталог и ничего не происходит. Но всё начинает снова тормозить :) При этом [ZeroMePlus](/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6/) и [ZeroMe Reloaded](/Me.Mkg20001.bit/) работают отлично :)\n\nnofish писал, как я понял, что эта проблема была вылечена в каком-то новом, ещё не релизом билде ZN и в обновлённом коде ZeroMe:\n\n- [Slow-loading activity feed (or not loading at all)](/Talk.ZeroNetwork.bit/?Topic:1512900119_1L2fmHSaFKB4vFN1GX3KQyZQfaB9CDUF3b/Slow+loading+activity+feed+or+not+loading+at+all) @ ZeroTalk\n\nНо я пока ZN до девелоперской не обновляю, для тестов видео нужна релизная версия :)"
		},
		{
			"post_id": 32,
			"title": "Коротко о клонировании зайтов",
			"date_published": 1513565028.077,
			"body": "> [zeroghostuser](/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:2_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC#comment_1_171qmSgBM4H3Lpk5ZZV33bVkbnWL8FVVSU): @balancer73, а где можно прочитать по подробнее про клонирование зайтов?\n\nДля большинства зайтов (где это не запрещено явно, например, из-за целей отладки или сложной архитектуры) это делается в меню зайта в левой колонке на стартовой странице. Т.е. два клика — и у тебя готова своя чистая (без данных) копия зайта. Так клонируются ZeroBlog'и, ZeroTalk'и, ZeroWiki.\n\nЕсли клонирование зайта явно не разрешено, то это нужно делать вручную. Всё равно в ZeroNet у тебя есть полная копия любого зайта. Скажем, мне не подходит то, что в ZeroUp минимальный размер файла 10Мб. А мне нужно и меньше выкладывать. Я лезу в консоль и пишу `./zeronet.py siteCreate`. Получаю адрес (хеш) нового пустого зайта и приватный ключ для его публикации. Потом копирую все файлы ZeroUp и во всех файлах исправляю его адрес на свой. Ну и плюс подправляю всё, что найду сопутствующего — название, адрес владельца, лимиты и т.п. Дальше публикую его как и любой другой зайт — копия готова."
		},
		{
			"post_id": 31,
			"title": "Видео в ZeroNet, всё же, будет ;)",
			"date_published": 1513564297.899,
			"body": "Вчера в ZeroMe возникла [большая переписка](/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1513511944), результатом которой стал вариант, когда при открытии зайта с видеовставкой выдаётся предложение загрузить зайт, на котором находится видео :)\n\nУвы, если пользователь потом удалит зайт с видео, корректно обнаружить это уже не получится. @Nofish говорит, что поправил это в r3173\\. Будем ждать всеобщего обновления ;)"
		},
		{
			"post_id": 30,
			"title": "Видео в ZeroNet",
			"date_published": 1513508303.421,
			"body": "После того, как YouTube перестал играться через `iframe` на локалхосте без верных хедеров и попробовал одно время подёргать разработчиков в GitHub, но потом решил поэкспериментировать (точнее, продолжить ранние эксперименты) с размещением видео в самой ZeroNet через ZeroUp. Оригинальный ZeroUp не годится, так как там ограничение на минимальный размер 10Мб, а у меня может быть меньше :) Сделал клон. Работает нормально. Хотя пока раздачи никто не поддерживает, первые загрузки могут заметно много времени отнимать.\n\nВот пример в английском блоге:\n\n[![](data/img/post_30_zeronet-zeroup-video.jpg)​​​​​​​](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?Post:54)\n\n* * *\n\n**Плюсы**:\n\n*   Единая система, кроме ZeroNet больше ничего не нужно. Нет зависимости от капризов YouTube или, там, пропажи пиров в IPFS (с ней я тоже экспериментировал ранее).\n\n**Минусы**\n\n*   Показ видео начинается не сразу. Иногда старт основательно задерживается.\n*   Опера у меня один раз так закешировала кривое недокаченное начало файла и в упор его отказывается проигрывать, только скачать :)\n*   Нет возможности выбора качества и видеопотока, как в YouTube."
		},
		{
			"post_id": 29,
			"title": "Git Center",
			"date_published": 1512829882.754,
			"body": "Кстати, видели уже Git Center?\n\nhttp://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/\n\nНе смотрел, как он хранит коммиты (Merger, судя по всему, но не знаю, как распределяется при длительной работе), но это целый «ZeroNet GitHub» :)"
		},
		{
			"post_id": 28,
			"title": "ZeroNet vs i2p",
			"date_published": 1512352505.95,
			"body": "> **[Karapuz@LOR](https://www.linux.org.ru/news/conference/13843105?cid=13863479)**\n> а чем оно [ZeroNet] от i2p отличается?\n\ni2p — это только транспорт. Обеспечивает анонимную передачу данных и только. Из готовых распределённых решений в i2p только раздача торрентов. Сайты в i2p централизованные. Из-за этого две концептуальных беды:\n\n1.  Сайты дохнут. Очень часто дохнут. Особенно, учитывая то, что большинство из них стоит где-то на кухне под столом дома у сайтовладельца или на копеечном хостинге.\n\n2.  Доступ к сайтам чудовищно тормозной. Иногда в сочетании с первым пунктом вообще непонятно, это никак пробиться до сайта не можешь или он лёг.\n\nВ ZeroNet подход другой.\n\n1.  Все ZN-сайты (зайты) полностью распределённые. Автор может опубликовать зайт, дождаться, пока его начнут использовать и вообще грохнуть у себя — зайт будет продолжать работать.\n\n2.  Сеть не заточена под передоз анонимности, как i2p, вся анонимность там осуществляется по желанию через Tor со всеми его плюсами и минусами. Зато работает очень быстро, задержки в распространеннии обновлённой инфо по сети часто не более секунд. И все зайты сперва выкачиваются к тебе на локалхост, что обеспечивает множественную репликацию и максимлаьно возможную скорость работы. В общем, даже в офлайне.\n\n[Кросспостинг с LOR](https://www.linux.org.ru/news/conference/13843105?cid=13865414)"
		},
		{
			"post_id": 27,
			"title": "Взлетит ли ZeroNet?",
			"date_published": 1512275977.373,
			"body": "> [floodping](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:25#comment_1_1DvqmS7maVsxLZJmCn6NEtnfS7hVKskvdk): Но взлетит ли это все?\n\nТут зависит от того, что каждый вкладывает в понятие «взлёта» :) Если составление конкуренции централизованным соцсетям — то я тоже сомневаюсь. 99% народа удовлетворит состояние дел в FB или ВК при любых разумных ограничениях в них. Котики, фоточки из отпусков, вот это всё — под санкции никогда не попадут :) А пользоваться централизованными ресурсами проще. И даже если ресурс ждёт крах, как LiveJournal, ICQ или MySpace, то просто перейдут на другой подобный.\n\nЕсли ожидать, что тут просто станет достаточно шумно и людно для живого общения на любую тему — думаю, это вполне возможно. Надеюсь, ZN будет ещё активно расти и сам стараюсь прикладывать разумные усилия по её популяризации :) Хотя, если такого не произойдёт, то я не очень удивлюсь :) Но, скорее всего, людей тут ещё станет больше.\n\nЕсли же под «взлётом» подразумевать востребованность сети для себя лично — для меня она уже «взлетела». Даже при отсутствии множества активных читателей, ZN прекрасный склад для хранения своего следа в сети, который не зависит от капризов держателей централизованных ресурсов :) Да, я тут себя представляю пока всё ещё менее активно, чем на централизованных ресурсах, но это больше от того, что я никуда не спешу и ленюсь заниматься постоянным кросспостингом, ожидая, когда это всё смогу свалить на плечи [Infonesy](/17yiPtXkxqJY6RDyxfh1ZYYWhdq92tbQpE/) :)"
		},
		{
			"post_id": 26,
			"title": "География ZeroNet",
			"date_published": 1512184830.022,
			"body": "Раньше не следил как-то за числом активных и возможных соединений в ZeroNet. И оно чаще измерялось сотнями. А тут вижу на ноуте — 17723 доступных пира. Интересно стало глобус покрутить :)\n\n![__________013.png (400x554)](data/img/post_26___________013.png)\n\n---\n\nБольше всего пиров в Европе и, особенно, в Восточной Азии. Китай, Япония — рулят в ZN.\n\n![__________014.png (395x399)](data/img/post_26___________014.png)\n\nЧуть меньше в США и Канаде.\n\n![__________015.png (390x401)](data/img/post_26___________015.png)\n\nВ Южной Америке пиров не мало, но по побережьям. Видимо, в центральной части никто не живёт :D\n\nЕщё меньше пиров в Африке, но даже там присутствуют:\n\n![__________016.png (396x392)](data/img/post_26___________016.png)\n\nВ случае России видна большая неравномерность в заселении:\n\n![__________017.png (396x367)](data/img/post_26___________017.png)"
		},
		{
			"post_id": 25,
			"title": "Обновлён движок блога",
			"date_published": 1511846381.55,
			"body": "Привёл свои ZeroBlog'и в соответствие оригинальному. А все CSS-правки вынес в отдельный файл. Так проще обновляться. Вижу немало дополнений в `all.js`, но фиг знает навскидку, что они делают. Так, визуально, после обновления разницы большой нет :)"
		},
		{
			"post_id": 24,
			"title": "ССЗБ",
			"date_published": 1508913544.323,
			"body": "С некоторых пор на ноуте перестал обновляться ZeroNet. Всё руки не доходили разобраться. Сейчас занялся этим вопросом. Вижу по логам, что не может соединиться с Tor. Но Tor запущен, доступен, висит на портах, отзывается на проверки. А в ZeroNet: `TorManager Starting self-bundled Tor, due to Tor proxy port 127.0.0.1:9050 check error: No connection` и всё тут.\n\nЛомал голову минут 20, пока не заметил, что в скрипте запуска ZeroNet у меня стоит «на всякий случай» ещё и `service tor start`. А он не просто запускает tor, оказывается, а **пере**запускает. И тут же запущенный ZeroNet не находит Tor :) Поставил задержку в секунду — всё завелось :) Оказывается, ZN не умеет пересоединяться к Tor, если при старте первого последний недоступен."
		},
		{
			"post_id": 23,
			"title": "ZeroUp — раздача больших файлов",
			"date_published": 1507216893.349,
			"body": "Ну, вот. Новый этап в жизни ZeroNet :) Раздача больших файлов работает. И я даже склонировал для теста [ZeroUp](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/) — файлы в 2.1Гб раздаются без проблем :D\n\nНовый этап — потому что теперь за него могут взяться правоторговцы... :-/"
		},
		{
			"post_id": 22,
			"title": "Фотографии в блогах",
			"date_published": 1507008515.607,
			"body": "Решил отказаться от использования [одной] IPFS для фотографий зеро-блогов. Нет возможности гарантировать, что файлы в IPFS будут доступны годы спустя без моей активной поддержки. И может так получиться, что блог в ZeroNet останется, а фотографии в нём, хранящиеся в IPFS, станут уже недоступны. Конечно, лимит в 200 кбайт на фото очень серьёзный, но зато есть гарантия, что фото останутся доступны всегда, пока доступен блог.\n\nТак что, наверное, буду фотки в блоги кидать прямо в ZeroNet, а уже с них давать ссылку на полноразмер в IPFS. Если последний пропадёт, то хотя бы что-то останется :)\n\nХотя тут возникает интересная техническая задача — обеспечить максимальное качество фото в 200кбайт. Как по разрешению, так и по степени сжатия. Пока не смог автоматизировать процесс. Делаю в ImageMagick одновременный ресайз в 1024..1280px с сохранением с качеством 70..85\\. Но вот с сочетанием этих двух параметров приходится играть вручную :-/"
		},
		{
			"post_id": 21,
			"title": "Идеи использования ZeroNet",
			"date_published": 1506245134.202,
			"body": "Недавно пришла в голову ещё одна интересная особенность ZeroNet. Зайты в ней могут быть абсолютно анонимного авторства. Т.е. сделал статью на блоге, дал утянуться через какой-нибудь прокси через Tor, утянули желающие — и всё, можно у себя удалять. При желании можно где-то оставить ключ и тогда можно будет со временем отредактировать откуда угодно. При желании можно ключ грохнуть, тогда изменить уже никому ничего не получится.\n\nПравда, это касается только небольших объёмов. Скажем, с видео так уже не получится, всё равно кто-то должен сидеть на его раздаче :)"
		},
		{
			"post_id": 20,
			"title": "Zites.cf",
			"date_published": 1503980034.565,
			"body": "Обнаружил, что на [http://www.zites.cf](http://www.zites.cf) не работали картинки. Обрубался кривой реферер при работе прокси [http://www.zerogate.tk](http://www.zerogate.tk)\n\nСам не замечал сперва, так как обычно сперва смотрел зайты прямо из ZeroNet и картинки кешировались. А там ZeroNet ругался на несоответствие адресов сайта и реферера:\n\n```\n[21:34:47] Ui.UiServer Media referrer error: 1AdhUSJLmpUE7Aq5nPBkUuxgcWaUfqtS84 not allowed from http://www.zites.cf/\n```\n\n* * *\n\nПроблему правильно побороть так и не смог, и поэтому пока отключил кеширование CloudFlare (всё равно нагрузка ещё не велика). Подмена реферерна на NginX прокси не помогает, та же фигня:\n\n```\n[21:57:51] Ui.UiServer Media referrer error: 1AdhUSJLmpUE7Aq5nPBkUuxgcWaUfqtS84 not allowed from https://www.zerogate.tk/\n```\n\nТакже вчера прикрутил к сабжу комментарии на Disqus. Не хотел, потому что обратной связи пока нет и при наличии комментария в копии, автор оригинала в ZeroNet не будет извещён. Но попросили :) Надо будет работать дальше над двухсторонней связью в рамках Infonesy.\n\nUpdate: я отличал блоги от неблогов по ZiteID клонируемого сайта. Учитывал только клоны с официального ZeroBlog. Оказывается, что многие клонируются с других блогов. В т.ч. я и сам так делал, клоны со своих :) Теперь определяю по наличию постов в `data.json`. Число блогов (на той же базе) выросло с 60+ до 90+ :)"
		},
		{
			"post_id": 19,
			"title": "Публикация зайтов",
			"date_published": 1503979894.66,
			"body": "> [ukraine](/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7#comment_13_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Сделал siteSign и sitePublish, но 1JcpTgRn1Vc1A3nKqWHRYsDGcFykwGTnWd так и не появился в сети\n\nС первичным распространением зайта всегда есть сложности. Если ты только создал его и сделал `sitePublish`, то он сам по себе никуда ещё не уйдёт. ZeroNet в отличие от многих других p2p-сетей не химичит с трафиком, подсовывая кому-то что-то, что он не заказывал. Соответственно, и твой контент при первой публикации никуда не уйдёт.\n\nПравильный путь — `sitePublish`, оставить машину на раздаче, отдать ссылку кому понадобится. Когда скачают, тогда уже можно сниматься с раздачи (хотя зачем? — больше пиров, легче доступность).\n\nПрактический путь — после публикации сайта попытаться открыть его через один из открытых прокси. Прокси его скачает и оставит на раздаче. Минус в том, что прокси может забиваться никому не нужной информацией :)\n\nЕсть ещё тонкости — при первичной раздаче очень неохотно уходят данные через Tor. Точнее, очень сложно и долго находится нода-инициатор. Тут можно для ускорения процесса временно выключить Tor, загрузить зайт на доверенный прокси и снова включить Tor.\n\nТакже при изменениях в первую очередь, с высоким приоритетом уходят данные в `*.json`, а потом уже прочий контент (`html`, `css`, `js`). Поэтому при изменениях зайта файлы самого зайта могут расходиться дольше."
		},
		{
			"post_id": 15,
			"title": "На чём делать зайты",
			"date_published": 1502779067.423,
			"body": "ZeroNet предоставляет довольно широкие возможности встроенными приложениями и практически неограниченные — при расширении своими приложениями. Но последним мало кто занимается, а первое имеет некоторые ограничения.\n\nУ меня сейчас возникает две задачи, которые на ZeroNet не имеют лобового решения:\n\n## 1\\. Простой статический сайт. C комментариями o_O\n\nЕсли речь о простой статике, то это вообще не вопрос. ZeroNet работает с таким из коробки. Но что если нужно какие-то материалы сайта комментировать и обсуждать?\n\n* * *\n\nПервое очевидное решение такое же, как и у статических сайтов в обычном Интернете — **[Disqus](https://disqus.com/)** (или менее удобные аналоги — Facebook, ВКонтакте...). У этого решения много плюсов: проверенное, популярное, интегрируется с популярными социальными сетями. Но его централизация ставит крест на самой идее использования ZeroNet. Завтра такой сервис закроется или аккаунт пользователя будет забанен — и привет!\n\nВторое почти очевидное решение — заводить отдельный **ZeroTalk** для обсуждения. На странице с материалом пишем ссылку на топик в ZeroTalk и там обсуждаем что угодно и сколько угодно. Недостаток такого подхода — на странице с материалом не видно обсуждения. Нужно вручную создавать темы и давать на страницах на них ссылки. Очевидно, что это сильно повышает трудозатраты.\n\nВот третий вариант для меня относительно неожиданный :) **ZeroBlog** в роли сайта. А что, отдельная запись блога — статья. Со всеми комментариями и прочим. Отдельно — записи, служащие для навигации по такому зайту. ZeroBlog позволяет указать любую дату, так что вешаем в начале блога запись с корневой навигацией и дальше — получается обычный сайт :) Этот метод я и [принял на вооружение сейчас](/1AdhUSJLmpUE7Aq5nPBkUuxgcWaUfqtS84/).\n\n## 2. Сайт для коллективной работы.\n\nВот тут пока всё не очень хорошо :-/ Готовое решение — только ZeroWiki. Неплохо, но мало. Нет обсуждений. Слабые возможности навигации, иерархии. Приходится использовать связку ZeroWiki + ZeroTalk. Есть ещё «ZeroReddit» — [ZeroVoat](/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/). Но он ещё очень сырой и сильно глючит при клонировании. К тому же, работает на MergerSite, а это, с одной стороны, плюс, с другой — не позволяет разделить данные."
		},
		{
			"post_id": 14,
			"title": "ZeroNet для Android",
			"date_published": 1502362836.393,
			"body": "Кто-то сделал вариант ноды ZeroNet под Android:\n\n[https://play.google.com/store/apps/details?id=net.mkg20001.zeronet](https://play.google.com/store/apps/details?id=net.mkg20001.zeronet)\n\nСам не тестировал."
		},
		{
			"post_id": 13,
			"title": "ZeroNet в Telegram",
			"date_published": 1499429314.908,
			"body": "Напомню, что в Telegram есть пара чатов, касающихся ZeroNet\n\n*   [@decentralized_social](https://t.me/decentralized_social). Русская группа по децентрализованным соцсистемам.​\n\n*   ​​[@zeronetchat](https://t.me/zeronetchat). Англоязычная группа по ZeroNet."
		},
		{
			"post_id": 12,
			"title": "Zeronet Central",
			"date_published": 1499429159.218,
			"body": "«Reddit в ZeroNet», **[Zeronet Central](http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/)** продолжает развиваться.\n\nПоявилась подписка на обновления (что резко может поднять эффективность!), появился визуальный редактор. К сожаленю, в HTML, а не Markdown, но это и свои плюсы имеет.\n\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?view:topic+topic_id=1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUwtopic3"
		},
		{
			"post_id": 11,
			"title": "Активность разных социальных систем",
			"date_published": 1494618899.041,
			"body": "> [varakin](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:17_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw#comment_5_1BR2d8kCqCBaFWLQ9KXnNbJzLmcPJ3DdTL): Вообще, концепт этой сети очень жизнеспособный.\n\nДа, я оценил. Среди распределённых систем там самая высокая активность лайков и комментариев на первые же сообщения.\n\nВсё руки не доходят придумать ранжир разных соцсетей на тему активности на единицу подписчиков, на единицу активности и т.п. Вон, в G+ у меня более 500 подписчиков (и, в отличие от Инстаграмма и т.п. — в основном не роботы), но обратная связь на публикации одна из самых слабых. Т.е. понятно, что сеть почти умирает, но даже на пике активности там было достаточно вяло всё.\n\nСамые активные по обратной связи сейчас (относительно судить сложно, нужно критерии выработать) у меня это:\n\n* * *\n\n*   Facebook (это понятно, много народа)\n*   ZeroNet (видимо, потому что сеть мне нравится и я тут активность большую развил :D)\n*   Pinterest (но она непригодна для общения, только для ссылок с картинками)\n*   Steemit (видимо, людей привлекает возможность заработать)\n*   Instagram (для общения не пригодна, на фотки активность огромная, но почти всё — боты :D)\n*   Mastodon (видимо, из-за недавней высокой рекламной активности)\n\n## Ссылки\n\n- [Особенности контингента разных распределённых соцсетей](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:26:Особенности+контингента+разных+распределённых+соцсетей)"
		},
		{
			"post_id": 10,
			"title": "Статическое гейтование",
			"date_published": 1494600284.002,
			"body": "Только что заметил, что не смотря на обилие ZeroNet-прокси, позволяющих гостям из обычного Web'а смотреть ZeroNet и на возможность Гугла индексировать JS-сайты, тем не менее ни одного материала из ZN в Гугле нет. Теперь думаю, надо сделать генератор статических сайтов для индексации ZN. Тут много полезного, а без Гугла сложно находить :)"
		},
		{
			"post_id": 9,
			"title": "FAQ: Как начать раздачу своего зайта, если компьютер нужно увести в офлайн, а его никто не скачал?",
			"date_published": 1492794846.821,
			"body": "1.  Идём на список [Proxy в ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies).\n2.  Выбираем прокси. Пусть это будет, скажем, [https://zn.maly.io/](https://zn.maly.io/).\n3.  Берём ID нашего зайта из URL, например, `1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi`.\n4.  Открываем его на этом прокси, дописав в адресную строку: [https://zn.maly.io/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi](https://zn.maly.io/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi)\n5.  Дожидаемся, пока прокси утянет сайт.\n6.  Profit! Можно выключаться, сайт доступен другим пользователям.\n7.  Можно повторить на нескольких прокси (тем паче, с какими-то соединение может долго тормозить)."
		},
		{
			"post_id": 8,
			"title": "Ещё одно использование ZeroNet",
			"date_published": 1492704943.645,
			"body": "До последнего времени, если нужно было просто поделиться картинкой где-то на форуме, использовать Твиттер. Выложить достаточно просто, могут подписаться те, кому интересно, надёжность хранения весьма высокая. Хотя смутило недавнее удаление некоторых аккаунтов, которые я читал, но...\n\nСегодня решил попробовать делать размещение таких картинок в виде блог-записей в ZeroNet :) Кидаем в блог, даём ссылку на прокси.\n\n1. В таком виде точно никто запись не удалит.\n2. Можно развернуть в комментариях блога более продвинутую дискуссию, чем в Твиттере\n3. Дополнительная популяризация ZeroNet :)\n4. Даже при потере прокси пользователи, которым интересно, всё равно смогут получить доступ к записи через свою Zero-ноду или другой прокси. Хотя это и потребует ручной работы, но данные будут доступны.\n\nМинус, впрочем, тоже есть — уже упомянутая возможность падения/закрытия прокси :) Хотя, конечно, я даю ссылку на свой прокси, который будут сам же и поддерживать, но в общем случае это может быть проблемой.\n\nПример: [пост в дискуссии на LOR'е](https://www.linux.org.ru/forum/general/13309958?cid=13367221) и ссылка на [Потребление памяти в 32 бит ARM Ubuntu](/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/?Post:4:Потребление+памяти+в+32+бит+ARM+Ubuntu)"
		},
		{
			"post_id": 7,
			"title": "Новый ZeroNet Alpha",
			"date_published": 1492536576.146,
			"body": "[http://127.0.0.1:43110//me.plasmmer.bit/](http://zeronet.home.balancer.ru/me.plasmmer.bit/)\n\nВыглядит приятнее. Можно задавать свой фон и гибко настраивать множество параметров. Навскидку пока других изменений не нашёл. Работает :)"
		},
		{
			"post_id": 6,
			"title": "Количество пиров ZeroNet",
			"date_published": 1492493916.885,
			"body": "Какие-то сумасшедшие цифры на внешнем сервере. На других машинах в 10 раз меньше :)\n\n![2017-04-18_08-38-17.png (0x0)](data/img/post_6_2017-04-18_08-38-17.png)"
		},
		{
			"post_id": 5,
			"title": "Git over ZeroNet",
			"date_published": 1492492864.312,
			"body": "О! [Git over ZeroNet](/1xxooZ7s8iDz3u56i5mNQ1XGmwF8Zvnw9/)\n\nСам пока не щупал. Но интересно."
		},
		{
			"post_id": 4,
			"title": "«Что такое ZeroNet?»",
			"date_published": 1488218107.213,
			"body": "Обновил страничку [http://zeronet.a0z.ru/](http://zeronet.a0z.ru/)\n\nЕсли кому нужно использовать для того, чтобы кому-то рассказать об этой сети, можно пользоваться :)"
		},
		{
			"post_id": 3,
			"title": "ZeroNet 0.5.3",
			"date_published": 1488215084.306,
			"body": "ZeroNet [обновился до версии 0.5.3](/Blog.ZeroNetwork.bit/?Post:105:New+version+0.5.3). Главные изменения:\n\n*   Поддержка прямой отдачи файлов из архивов как из каталогов. Полезно для экономии места на css/js. Но, как по мне, так это копейки, всё равно место жрут картинки и JSON :)\n\n*   Возможность запрета загрузки новый зайтов пользователям многоюзервских прокси. Для меня это, как раз, полезная опция :)\n\n*   ZeroBlog/ZeroTalk/ZeroMe — множество автоподписок. На визиты, на комменты. В общем, полезно, ИМХО. Активность должна быть повыше.\n\n*   На прокси теперь можно авторизоваться через master_seed и управлять им (обновление, перезапуск и т.п.)"
		},
		{
			"post_id": 2,
			"title": "ZeroNet прокси",
			"date_published": 1487427754.353,
			"body": "Перенёс прокси [https://proxy.zeronet.a0z.ru/](https://proxy.zeronet.a0z.ru/) на другой сервер. Теперь не должно быть проблем исчерпания свободного места."
		},
		{
			"post_id": 1,
			"title": "Tor vs клонирование зайтов",
			"date_published": 1487221680,
			"body": "При создании зайта первичная публикация очень неохотно и медленно идёт (если вообще идёт, я не дождался!), если стартовая нода находится на Tor. Поэтому, для ускорения раздачи Tor нужно выключать. Потом, когда нода разойдётся, Tor можно включить снова."
		}
	]
}