{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1580849186,
			"title": "PeerTube in Censored web",
			"body": "https://joinpeertube.org/\ndemo\nhttps://vid.lelux.fi/videos/overview\n\nIt is in the censored web, but it is a fine recommendation to give to people, who do not use the ZeroNet. Helps to lessen the importance of the YouTube, Vimeo, Facebook and alike.",
			"added": 1580849185
		},
		{
			"topic_id": 1581116791,
			"title": "As of Today(2020_02_08) the U.S. President can do Anything",
			"body": "https://youtu.be/_Z3qgRvMHCU?t=66\n\nSummary: the Donald Trump asked Ukrainian president that either the Ukrainian president uses its state apparatus to work against the political opponent of the Donald Trump to increase the chances of the re-election of the Donald Trump or the Donald Trump will tell Pentagon to not ship the anti-tank rockets that the Ukraine needs to fight against Russian invasion. The Republican Party officially said that this is an OK thing from the U.S. president to do and did not remove him from office. Had the Donald Trump been removed from office, its vice president, the Mike Pence would have taken over and the Republican Party representative, the Mike Pence, would still be in the White House, in the role of the president of the U.S. and the Republican Party would have not lost the presidential position from their ranks.\n\nThe consequence of this decision is that now it is official that it is OK for the U.S. president to ask a foreign government that either that foreign government pays a billion or two to the personal non-profit, \"a fund\", of the president or may be builds a Trump hotel for free for the Trump, or the U.S. will not help out its military ally that has a war with some U.S. military adversary like China or Russia. For example, the Trump may say that either the Hong-Kong bankers pay his de facto personal, formally \"nonprofit\", bank account or the U.S. will not help the Hong-Kong against the mainland China. Now it's official, officially legal at the highest level, not any kind of a conspiracy theory at all.\n\nThe French president already announced that Europe must not be a bystander in the new arms race, where the U.S. and the Russia upgrade their nuclear weapons. Wasn't the World War 2 (WW2) already harsh enough for the U.S.? If the Europeans are forced to properly arm themselves, then heaven forbid, what will happen again. The U.S. will probably retain the \"Hollywood factor\", but technologically the U.S. biggest particle accelerator at Fermilab\nhttps://www.fnal.gov/\nhas been closed, the biggest one still operating is in Europe. The mainland China, Japan and Russia also have their accelerators operational and probably the world's best war robots are the ones sold by the Estonian company, Milrem.\nhttps://www.youtube.com/watch?v=gDJdEY1VcPo\nhttps://www.youtube.com/watch?v=IlgUdaJpNhs\nhttps://milremrobotics.com/themis/\n\nUnlike other robots that are just radio controlled, the Milrem robots have been designed to have the capability to be totally autonomous and operate, even patrol and fire, at the environment, where the Russian army jams all radio communication. In Estonia there is culturally no requirement that there must be a human in the loop and if the situation becomes really bad, then the robots can be seen as \"autonomous mobile mines\" that patrol and shoot everything that is not identified as friendly force. They can be seen as area denial weapons that, if the situation in terms of jamming allows, can be de-armed and placed to guard some other area. Interestingly, one not so widely known fact is that the nuclear fuel for the very first Soviet Nuclear bombs was also produced in Estonia, at a small town called Sillamäe, which remained a \"closed town\" during the whole Soviet Union era, because it had some factories that produced various things for the soviet military.",
			"added": 1581116789
		},
		{
			"topic_id": 1581249874,
			"title": "Brainwashing by Brainwashing Specialists",
			"body": "Google used brainwashing for a \"good purpose\", which was to discourage mad-mentally-retarded-Islamic-terrorist-wannabe-s from becoming murderers. \nhttps://www.wired.com/2016/09/googles-clever-plan-stop-aspiring-isis-recruits/\nhttps://archive.fo/IKtkH\nBrainwashing potential murderers to not commit murders looks like the right thing to do, right? How about making all convicted pedophiles wear a radio beacon, a leg ring, that puts them on a map so that a special app at a small child's phone can warn the child against the pedophile Makes the living environment safer, right? The general scheme is to develop and test the various repressive measures on a small minority that the majority of the population despises. Once the repressive measures have been tested to work, they will be used on that dumb majority that did not see it coming to them. The brainwashing machine explained: \n\nhttps://spir.aoir.org/ojs/index.php/spir/article/view/10472/8342\n\nThe same file on ZeroNet:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/merged-CDN/15fDN4wasXuyS8krtKvrxEVmWWLz6Qh518/data/users/1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD/2018_10_xx_aoir_org_HOW_IS_SOCIAL_MEDIA_GATEKEEPING_DIFFERENT_A_MULTIPLATFORM_COMPARATIVE_ANALYSIS_OF_THE_NEW_YORK_TIMES_keywords_brainwashing.pdf\n\nThank You for reading this post.",
			"added": 1581249871
		}
	],
	"topic_vote": {},
	"next_comment_id": 83,
	"comment": {
		"1578268512_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 1,
				"body": "I have 2 aspects to it. First of all, the Edward Snowden's behaviour is as American as it gets. The shoddy escape planning, the sincere belief that if the ills of the Government are revealed to the public, then things will be OK and fixed, the sincere American patriotism of accepting the risks just in the name of doing the Right Thing for the America. In my view, he is certainly a hero, but unfortunately slightly stupid, naive hero. Was it worth it? Not the way he expected it to be, but in an unexpected way HUGELY WORTH IT. The way he was treated by the U.S. government and the various European governments PROOVED that in reality in the 21. century there is no way to tell publicly about the ill-doings of the Western governments without being the target of repressions. With China, Russia, Arab states that's kind of granted, but the fact that it also holds for the Western governments, not just the U.S., was TOTALLY NEW INFORMATION and interestingly I haven't read or heard the Edward Snowden itself ever talking about that aspect of his case. He just talks/writes about the revelations and mass surveillance, but the mass surveillance part is kind of irrelevant in a sense that the \nhttps://en.wikipedia.org/wiki/ECHELON\nwas public knowledge long before his revelations became public and already in year 2003 or so we (as students) were told at our cryptography lecture that a good way to design software is to apply encryption whenever possible, because if there is an opportunity for some party to abuse the situation, it will get eventually abused. So, from that point of view, the existence of the mass surveillance project does not really change anything, because, well, if the software developers did their job properly, the agencies may try what they may, they would just not succeed. The key lengths, strengths of crypto algorithms can also be bumped up with some spare strength without knowing almost anything about the surveillance projects, because the minimum feature size of digital logic microchips and therefore their maximum computational power is public knowledge. It's obvious that the agencies have the money to create their own custom crypto breaking chips, so the key sizes that are not reachable for the agencies are kind of calculable without any leaks.\n\nAnd what has really changed after the revelations? From software development point of view, pretty much nothing. Software developers and hardware developers still rely on standard crypto libraries that have some standard key lengths and  standard algorithms that can be broken by the agencies and that is a Good Case. Often times the developers think just about features, not security, and the end users also pay just for features, not security. The sales people can always lie about the security of the products and hardly anybody audits, whether there is any truth there, specially, if the products use some \"standard and publicly approved\" crypto chips or crypto algorithms. People want the IoT appliances to run as long as possible from a single set of batteries or from a single charge and in general the case tends to be that the stronger the crypto, the more calculations need to be done, but the more calculations need to be done, the more current/power the IoT device consumes and the bigger the power consumption, the faster the battery empties, so the security wise crappier IoT device manufacturer wins the race with their argument that their device can work longer with a single charge or single set of batteries. Or how many \"ordinary people\" encrypt their plain email? Has the number of GMail users or Facebook users declined because of the Snowden revelations? I guess not.\n\nThe major change that the Edward Snowden case brought to the world was the knowledge that the advertised Western Values of treating crime reporting parties well REALLY DO NOT HOLD. If we add the Bradley_Manning/Chelsea_Manning case to the mix, then we get clear cover-ups of blatant murder by the U.S. government\nhttps://en.wikipedia.org/wiki/July_12,_2007,_Baghdad_airstrike\nThe way the Snowden and the Manning were treated clearly sent the Western Values DOWN THE TUBES in a GRAND SCALE. Even if the Edward Snowden is/were a Russian spy, his bad treatment by the U.S. government is a TOTAL INTELLIGENCE FAILURE IN A GRAND SCALE, because it allowed the Russian and Chinese intellectual top brass, the future Russian and Chinese top engineers, to see that there is no point of emigrating from the Russia or China to the West, because value wise people, who report horrible corruption and wrongdoings, literally murders by the government, get really bad treatment there, but at the same time the Russian and Chinese top universities are \"for free\" while the western engineering salaries barely cover the university tuition fees of the children of the engineers. Russian top universities and Chinese top universities are certainly not worse than the \"average\" Western top universities, at least what regards to the skills that people acquire there. The Pentagon can be pretty sure that the graduates of Russian universities and Chinese universities are able to design such weapons to Russia and China that are able to properly challenge the West. Those BRIGHTEST hearts and minds were alienated with the bad treatment of the Edward Snowden and the Bradley/Chelsea Manning. It is exactly THOSE YOUNG PEOPLE and also the current Russian and Chinese engineers and scientists that will notice things and that will DETERMINE THE ARMS RACE, not the average Facebook users that will continue uploading everything to the Facebook even after the Edward Snowden revelations. From that point of view even if the CIA/FBI/whoever-else suspected or knew the Edward Snowden to be a Russian spy, they should have made sure that he gets a really good, non-repressive, treatment, because the current solution is AN ABSOLUTE FAILURE FROM PSYCHOLOGICAL OPERATIONS POINT OF VIEW and from the point of view of WINNING HEARTS AND MINDS OF THE INTELLECTUALLY BRIGHTEST Russians and Chinese. Intelligence agencies always need \"assets\", spies on the other side. Often times the best \"traitors\" at the other side are \"traitors\" due to ideological reasons, like the ones spying for the Soviet Union disliked how people were treated in the capitalist society and the ones spying for the U.S. side disliked, how the Soviet regime treated the soviet people. The CIA very likely LOST many future \"traitors\" in Russia and China due to the way the Edward Snowden and the Bradley/Chelsea Manning were treated. I emphasize, it is not the \"average\" person, who determines, what will happen in the world in the grand scale. It is always the brightest people that determine the outcomes. Even the Donald Trump, as stupid as he is at very many things, is actually quite bright in real-estate business and reality-shows, because there are plenty of people, who inherit great wealth from their parents, but only few are capable of achieving the brand, for better and for worse, that the Donald Trump has been able to achieve during his lifetime. It would have been easy for him to just take the inheritance, do drugs, be an \"investor\", live off of some rental income and not bother with any of the real estate business or reality show business, but, bastard or not, he certainly worked hard on his business projects, regardless of whether they are ethically questionable and in debt or not. That is to say, in a narrow context even the Donald Trump is actually a very bright guy. Horrible at very many things, not necessarily a nice guy either, but a bright guy at a narrow context. Even if his presidential campaign was just another effort to promote his hotel chain business, he certainly succeeded and the various diplomats book a room at the Washington horribly overpriced TRUMP hotel just to please him. Again, not nice, but a success. \n\nThe summary is that regardless of whether the Edward Snowden is/was a Russian spy or not, the mistreatment of him by the Western government is a TOTAL INTELLIGENCE FAILURE in terms of loosing the hearts and minds of the people, who now will start working for the Russian weapons programs and Chinese weapons programs in stead of emigrating to the West, specially given the cost of living in the U.S. if the cost of the children university tuition fees and healthcare fees are added to the list of expenses. The purpose of the CIA and other Western intelligence agencies is to PREVENT the enemies of the U.S. from developing good weapons, not to facilitate the creation of a new Cold War style arms race. The Western European governments also totally failed by not offering the Edward Snowden asylum, specially the Germany. And nobody, not even the Edward Snowden itself, talks about that SERIOUS FAILURE of the western intelligence agencies.\n\nHave a nice day.",
				"added": 1578293638
			},
			{
				"comment_id": 7,
				"body": "> [consus](#comment_6_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3): Are the good guys really the \"good guys\" anymore? In my opinion no.\n\nGood or bad is a matter of perspective, but stupid or smart can be objectively evaluated in a sense that IF the party P_1 has a goal G_1 and it fails to meet the G_1, then the P_1 is stupid and if it meets the G_1, then it can be considered smart. Whether the G_1 is known for making such an evaluation, is another matter and it turns out that Computer Science has a vast branch that tries to derive the goal of an agent from the actions of the agent and it turns out to be a very difficult task indeed. In the case of humans, not bots, there's also the problem that the action A_1 for achieving the goal G_2 can be absolutely idiotic, like a rain dance (A_2) for getting rain to the farm fields (G_3) and even if there were a correlation between the A_2 and the G_3, there might be absolutely no causal relationship between the A_2 and the G_3. \n\nThe supermafiosi, for example, Hitler, can be literally STUPID. Getting back to the British and the French for the WW1 reparations, where the German side started the WW1 to literally to enslave the enslavers (the French and the British had their extortion colonies outside of Europe, think of India, Africa, etc.) was not nice, but not that big of a sin either, just sloppy and cynical and cutting edges in terms of being principled. However, Hitler was ABSOLUTELY STUPID to open the Eastern war front before finishing war in the west. Think of the justifications or Nazi ideology what You will, but opening the Eastern front before completing the war in the west was STUPID. Even if the goal was to exterminate all Jews in all Europe, it is smart to divide the task to sub-tasks and then rigorously complete the sub-tasks, but the Hitler did not do that and went with emotions, therefore NOT FULFILLING HIS GOAL and that makes him objectively stupid in that narrow context. \n\nThe George Walker Bush, the Obama, the Trump? Well, if the goal of the Trump was to just promote his hotel business then that certainly has succeeded in a big way, which makes him objectively smart in that narrow context. If the U.S. economy plummets, people won't visit his hotels either and there's just not enough billionaires to fulfill his hotels, so good U.S. economy certainly is a Good Thing for his hotel chain, but in my opinion it is not at all that certain that he, the Trump, actually self understands that or even has that kind of a goal, despite the Make-America-Great-Again propaganda-slogan.  The Trump is certainly really good at scaring away all smart people from around himself, but on the other hand, probably by accident, he gets some things really right. I loved, how he told the German supermafia war minister (\"minister of defense\") that why should America spend money on defending Germany from Russia, if the Germany buys Russian gas through \n\nhttps://en.wikipedia.org/wiki/Nord_Stream\n\nand pays Russia so that the Russian government can advance its army? All of that during a time, when the U.S. think-tanks have years said that the only way to handle Russian expansionist nature\n\nhttps://en.wikipedia.org/wiki/Russo-Georgian_War\nhttps://en.wikipedia.org/wiki/Annexation_of_Crimea_by_the_Russian_Federation\nhttps://en.wikipedia.org/wiki/Soviet_Union\n\nis to use a \"containment policy\", meaning, just keep the Russian bear financially starved so that it can not modernize, build, its army. As the business environment in Russia is horrible due to the rampant corruption, although corruption in Ukraine and India is much worse, just that unlike the Ukrainian and Indian corruption, the Russian corruption is orderly, well organized, officially enforced with the Russian state apparatus, the modern Russia, with the population size of roughly 1/3 of the U.S. or 1/5 of the European Union, does not really produce hardly anything. Russia has really good universities, their military industrial complex is actually really advanced and unlike what the Western propaganda says, the Russian semiconductor foundries can actually produce really competitive, really good microchips, but it is the hopeless business environment in Russia that does not really allow the Russian firms to properly produce even for just Russian own internal market. Hence the need to import almost all commodities. To import, one needs to export. As the Russian economy is not able to produce for its own, internal, consumption, except food (thank God that it can produce at least food), it certainly can not produce anything for the export, except weapons, which they sell to India, Turkey, Africa, China, Latin-America. The weapons sales do not cover the expenses that the Russia has in terms of commodity imports, so they really need to export something that they can produce and that tends to be natural resources, gas, oil, mining products\n\n(The \"Нефть\", pronounced roughly like \"nieft\", stands for \"oil\" in Russian. The phrase \"ja liubliu nieft\" in the music video translates as \"I love oil.\" Another phrase in the song, rough translation: \"If I'm in Milan(Italy), then that means that there is oil in Russia.\" \"Ja liubliu Rassiju\" stands for \"I love Russia\". Basically, it's a Russian parody music video about the Russian heavy dependence on gas and oil exports.)\nhttps://www.youtube.com/watch?v=EucLgHzuZaw\n\nThe irony is that the old oil and gas fields start to become depleted and to open new ones the Russia needs investments in terms of oil and gas extraction infrastructure (the pumps, the pipes, the roads, the power lines, etc.) and the Russian oligarchs do not want to make those investments, so they find stupid westerners to be ripped off by doing the investments. The stupidity of the westerners to invest to Russian terrotory with the excuse of a \"great potential\" is a  centuries old trend, but only a few get to pull their assets and earned profits out, back to West, before the assets get robbed from them. Whoever invested to Russia about 10 years before the communist revolution of the 20. century certainly lost if not everything, including their life, then a great amount. The real estate developers of Dresden and Berlin did not fare so well either during the WW2. And then the 21. century Germans buy Russian gas with a price that finances the payment of brand new pipelines\n\n(There are literally 2 pipelines going side by side, as if one weren't enough. When they first started to plan that project, I was thinking to myself that a huge undersea pipeline with that length must be probably one of the planet Earths' most ambitious construction projects so far, and now, in year 2020, the 1. pipeline is ready and operational and the 2. pipeline next to it, as big as the 1. one, is at least 2/3 completed. )\nhttps://en.wikipedia.org/wiki/Nord_Stream\nhttps://www.youtube.com/watch?v=c-22vmB4cdQ\n\nYou may imagine, what the situation would look like, if the Donald Trump, after its presidency, were to be literally and publicly paid hundreds of millions of dollars by the Russian Kremlin apparatus and then hired to be at some politically important position of the Russian gas or oil export firm. That is exactly, what happened with the Germans, all public, no secrecy or \"revelations\" what so ever. The true German Realpolitik.\n\nhttps://www.bbc.com/news/world-europe-41447603\n\nAs if the German Volkswagen scandal \n\n(German auto giant Volkswagen caught lying on a spectacular scale | 60 Minutes Australia)\nhttps://www.youtube.com/watch?v=k65Z-62hIr8\n\nwere much different. Whether that would serve any goal of the Donald Trump, I do not know. In my opinion interesting questions are, do the U.S. billionaire class believe to keep their wealth after the current Washington empire falls, all empires have fallen so far at some point in time, and do the members of the billionaire class even realize that the Washington empire is able to fall? \n\nFrom military strength point of view the U.S. has nosedived in many important areas. For example, the major nuclear physics research takes place all in Europe, Russia, China, Japan, because the Fermilab accelerator got closed and the U.S. does not have their own huge particle accelerators in the U.S. any more, but the Soviet Union era Russian particle accelerator is still operational and in use, the Chinese have something, the Japanese have something and the biggest, most powerful, particle accelerator is the one in Europe, at CERN. University level education in the U.S. and U.K. is not accessible to many people, because they can not afford it. The medical services in the U.S. are not accessible to the general population and in the U.K., where it is accessible, the medical services have remarkably low quality. On top of that the U.S. still uses paper-checks while some European banks, yes, official, regular, banks, emit their own cryptocurrency, which is not anonymous like the Bitcoin, but which allows people to build online shops in a very flexible manner and that has a fixed, official, exchange rate in relation to the €. That is to say, if this goes on, it might be that at some point the U.S. will loose even its status as a global financial center. Offering security services through NATO seems to be the main way, how the Washington can make itself relevant to Europe and other regions. As the saying is, the main export of the United States of America is security. However, the Pentagon is a huge bureaucracy. Even the ex-Pentagon officials complain at some think-tank presentations/panels that the brightest people do not want to work at the U.S. government joints any more, because there are too many security related restrictions and the \"private sector\" has taken the lead in scientific discoveries and cutting edge research. (Search for \"Pentagon sequestration think-tank\") \n\nHaving a lot of dollars is useless, if the prices are horribly high. If China and Russia are able to produce their top notch weapons that are able challenge the U.S. produced weapons much cheaper then it does not matter that they have \"little money\", but the China has also a lot of money and unlike Russia has relatively good business conditions, as long as the earned money is never exported from China. Probably the new Chinese leadership will ruin some of the Chinese economy, because absolute power corrupts absolutely and the previous Chinese communist party was actually, among themselves, within the gigantic party, quite democratic, but now they have a \"Stalin\" analogue, the life-long president, and that can not possibly work out for the benefits of the rest of the Chinese communist party, not to mention the \"common Chinese\". That \"Chinese Stalin\" may actually prolong the life of the U.S. empire, because it makes the Chinese empire less competitive, both militarily and certainly economically, despite the increase in aggressiveness. The \"Chinese Stalin\" is pretty much a sign that the \"Chinese economic miracle\" starts to reach its end again, enters its classical decline period, which may take about 50 years till it reaches its total bottom, but after the new regime has collapsed again, there will be another rise again and the idiots in the West will start to  talk about \"China on the rise\" again, and so on and so forth. As cynical as it may sound, the destruction of the Hong-Kong by the mainland China is actually a Good Thing from Washington perspective, because the destruction of the Hong-Kong makes the China financially, economically, weaker, which in turn reduces its ability to build its army. Probably the Russian intelligence agencies also work hard to destroy the Hong-Kong, \"help the friendly neighbor, China\", and that for the very same reason, why the western intelligence agencies might work on destroying it: the weaker the Chinese economy, the better the parity between the China and the Russia from the Russian perspective. China is already economically way more powerful than Russia and any small slowdown of Chinese economic development helps the Russian side. Bit by bit, chip by chip.\n\nAre the George Walker Bush and the Obama stupid? I do not know, but they both certainly accept torture. George Walker Bush ordered torture and the Obama made sure that the torturers were never brought to justice. What I wonder is that the Iraq'i people must certainly be a hopeless bunch of loosers, because so many civilians died as \"collateral damage\" during the Iraq war, not even the Saddam Hussein killed that many, despite being a horrible dictator, and yet the George Walker Bush is still alive and well or at least the mainstream media has not reported any assassination of him. In Europe or Russia the initiator of such amount of death would have been killed long time ago as a revenge and the actual Stalin was, supposedly, constantly in fear that he might get assassinated. The Soviet NKVD killed Soviet dissidents even at the other side of the planet, far outside of the Soviet Union borders. At Soviet occupied territories at least the smarter bunch of the soviet leadership knew very well that if they go \"too far\", they will get assassinated by the locals, no matter what, and the assassinations are not some emotional stupid tries, but well planned and carefully carried out. At least that is the culture and history at some regions of Europe. And yet, the Iraqi Arabs kill each other, blow themselves up with bomb vests, yell with black ISIS flags and totally fail to defend their region against foreign murderers. The U.S. commanders, who accepted \"collateral damage\" are certainly murderers, just as if a person does not care to hit the breaks of a car, when seeing somebody accidentally falling on the road, because, well, \"Who cares? I'm in a hurry and the law is on my side.\" I wonder, if those commanders even care, if their loved ones are also some \"collateral damage\" to some bad business practices of some huge U.S. corporation. Like, \"Uups, we had some nasty poison in our products that caused some nasty cancer that shortened some people's life for about 20 years, but who cares? Our lawyers and public relations people will take care of it and the law is on our side.\" Or do those commanders ever love anybody at all? Even themselves, apart from masturbation? They blow up people's homes with bombs, children and non-combatants in the houses. They raid a house and hold someones's grandmother at gunpoint and go through other people's belongings without ever being invited to the home of those people. After that they fly back to the U.S. for Christmas and be the \"soft, lovely U.S. hero back from work\", \"respect their neighbors\", \"be gentle to Your wife/girlfriend\". Psychology wise it all works out perfectly, the Milgram experiment, the Stanford Prison Experiment, \n\nhttps://www.ted.com/talks/philip_zimbardo_the_psychology_of_evil\n\nthe tendency to evaluate things the way people around oneself evaluate things. (Note: to avoid that effect, write Your comments/answers to forums before reading, what others have answered, written, because that way Your answer is more unique, contributes more, as it is not effected by the thoughts of others, which should also be read, but only after writing one's own answer.)\n\nIs the West the \"good guys\"? I guess it is only as good as WE SELF MAKE IT TO BE. There will always be bastards in any group of people, but if the \"good guys\" do nothing, as was the case with the Nazi Germany, the bastards will represent the whole group. OUR OWN CHOICE! Our effort to develop technical anti-censorship measures, like the ZeroNet, is one way to work towards making OUR GROUP, the West, better.\n\nThank You for reading my post.",
				"added": 1578390854
			}
		],
		"1566600878_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 2,
				"body": "> [duck0](#comment_128_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): On that same token, are there any other projects worth looking at which offer the same type of decentralization that 0net does? Perhaps projects can be merged, or development be integrated from other offerings.\n\nThe closest to the ZeroNet is the Dat protocol wrapper, the \nhttps://beakerbrowser.com/\nthat has a mirroring service for its \"zite\" analogues\nhttps://hashbase.io/\nI guess the same company might as well extend its offerings to other P2P networks. The problem with the hashbase.io is that it can not guarantee the mirroring to its clients due to being a non-anonymous service. A proper mirroring service needs to be anonymous, available only over Tor and for that may be the following service provider might be useful:\nhttp://kowloon5aibdbege.onion/",
				"added": 1578297735
			}
		],
		"1578260544_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "In stead of the supermafia that robs people, the Government, there can be nonprofits that do the job. What is actually often times needed is NONPROFIT SERVICES, because sometimes a for-profit model just ruins the service. Think of the Linux Foundation or the Apache Foundation or foster care. A for-profit foster care would be awful indeed. There is nothing that says that a violent, robbing, Government has to offer those non-profit services. Even prisons that hold serial murderers might be financed like the \"tiger shelters\" are financed: the serial murderers can be seen as mentally ill people that act like dangerous animals and if people donate to tiger shelters, they might as well donate to the \"serial murderer shelters\", which are the prisons. If there is not enough donations, then just like with the tigers, executions of inmates follow or the inmates are released to the wild, where they can be executed by the people, who protect their neighbourhood, or the inmates are transferred to other \"serial murderer shelters\" that do have enough donations.",
				"added": 1578302653
			},
			{
				"comment_id": 5,
				"body": "> [randomshits](#comment_403_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Let's take New Zealand's social service programs for example. Do you believe those would be better managed under a private organisation?\n\nI do not know about the New Zeland's social service programs, but I do know that a private organization does not have to be a for-profit organizations and the Christian social aid programs, including foster care, are all PRIVATE ORGANIZATIONS. At the very start the Red Cross was also a private organization and the \nhttps://www.doctorswithoutborders.org/\nis also a PRIVATE ORGANIZATION. A non-profit, but still a PRIVATE ORGANIZATION. Isn't the democracy propaganda idea that \"people have the power\" inherently an idea, where PEOPLE CAN FORM PRIVATE ORGANIZATIONS TO DO THINGS? Some people choose to abuse other people, others choose to help other people and then there are kind of midlleground, which are the honest businesses, freelancing businesses, small firms that are not there to earn a profit, but they do it in a neutral manner, without hurting the social environment and without polluting the nature. On the other hand, the business model of a Government is to rob people, apply violence, enslave people (\"conscription\") and then brainwash the idiots by telling that we are so good and useful, because we help You or Your fellow citizens with the resources that we robbed from You, look how well our \"social programs\" work. \n\nThe idea that the fellow citizens could be helped by a non-robbing, non-violent non-profit PRIVATE ORGANIZATION is just a taboo.",
				"added": 1578340500
			},
			{
				"comment_id": 8,
				"body": "> [moor](#comment_358_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): except that for them to exist someone needs to do the dirt work to make it possible to extract, transport, distribute, sell, consume. you really believe that these nice people would exist without coercion from someone?\n\nWhy does that coercion have to be \"someone\"? Isn't the life of a lone person on an uninhabited island coercive enough for that person to start doing things that he rather not do, if the problems didn't exist? Like find food, build a shelter, find ways to masturbate, find ways to fight off or avoid illnesses (cook meat before eating)? Did You enjoy setting up Your computer or were You coerced by the need to set up Your computer before having the possibility to use it? You may argue that using a computer is a made-up need that people can live without, but for some reason You are currently reading this text here, satisfying Your \"nonexistent need\". The same with freelance truck drivers and couriers(the ones, who transport things), show owners, who do not hire anybody (the ones, who distribute and sell), and so forth. At some point some people think that may be in stead of working alone they could  CO-OPERATE with other freelancers, forming a CO-OPERATIVE, like is the case in Spain.\n\n(Richard Wolff on the Mondragon cooperatives)\nhttps://www.youtube.com/watch?v=mKbukSeZ29o\n\nPeople work out of the coercion of the environment, like need for food, shelter, medical services, etc. but there is not that \"SOMEONE\" coercing them. Like, who coerces the passengers of a sinking ship to move into life boats? What about a fine or a \"death penalty\" for the \"crime\" of sinking with the ship in stead of walking into a life boat? In the case of ships there is a captain, but the passengers are that captain's clients and the agreement is that the passengers pay the captain for his services and agree to obey the commands of the captain during the voyage, just like restaurant guests must obey the commands of the restaurant owner during their stay in that restaurant. From that point of view the captain of the ship, even if he owns the ship, is not the same to the passengers as the CEO of a megacorporation is to the employees of the megacorporation. The employees of a megacorporation are just idiots, who voluntarily took a bad deal and they also have the option to resign and work as freelancers or form a CO-OPERATIVE.\n\n> [moor](#comment_358_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH):  if you don't understand the concept of nationalism or of government and why it is so predominant you can't possibly know or conceptualize how to live without it.\n\nI understand perfectly well that the dumber people yearn for someone to tell them, how they must live their lives and that many, if not most, people trade their financial freedom and personal materialistic wealth in for the psychological satisfaction of the feeling of \"belonging to a group\", which is something that the megacorporations with their corporate T-shirts and \"corporate identity\" offer very well. Once upon a time, over 10 years ago, I applied for a job at one international megacorporation. Salary wise they gave me a truly poor offer, but the Human Resources person explained that the bright side of their offer is that the company is internationally well recognized and has a GOOD REPOTATION. I politely declined their offer without saying anything provocative and took an offer from another company that offered me literally twice the salary, but in my private thoughts I was thinking: \"If I'm going to a shop and want to buy something, then do I need to pay with MONEY or can I pay my bills with Your company's GOOD REPUTATION?\" After a few other wage labor gigs I eventually was pushed out of my comfort zone of a \"well paid\" corporate engineer and I haven't worked as wage laborer for years. Got myself MORE FREEDOM AND MORE MONEY. Let the idiots toil at the corporate wage labor and live from pay-day to pay-day and hope that they can pay their bills with \"good reputation of their employer\". In a way one can argue that monetary price does depend on karma of the buyer, \"reputation\", but employer's bad reputation can only increase the monetary price and employer's good reputation does NOT decrease the price.\n\nBut, of course, people can still keep on believing that the only way for humans to CO-OPERATE is that there is some abusive king or CEO or \"lead committee\"(parliament) that then coerces others to do something. It is so painful for the slackers to look into a mirror and say to themselves: \"I'm just an idiot, who does not have self discipline and hence I want my parents to tell me, how to live, my school teacher to tell me, how to live, my university professor to tell me, how to live, and after graduating the university, I yearn for my boss to tell me, how to live, because I'M JUST SUCH A SLACKER THAT I JUST DO NOT WANT TO SPEND TIME THINKING ABOUT THAT HARD PROBLEM OF FIGURING OUT, HOW I SHOULD LIVE MY OWN LIFE! Please, dear King, coerce me!\"\n\nhttps://web.archive.org/web/20101202052907/http://secure.spicecash.com/hosted_galleries/fhwlp47/7.jpg",
				"added": 1578397066
			}
		],
		"1578271375_1A82FtkVV7GxU5RZvT3GJDGRTJKdqVLqoo": [
			{
				"comment_id": 6,
				"body": "You may want to post that question to the \"ZeroTalk Tech\" forum:\nhttp://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/\n\nThat's where some actual ZeroNet developers hang out. At the main ZeroTalk forum, where the current thread resides, the technical threads tend to get lost between all the rest of the non-technical threads. Just create a new topic at the ZeroTalk Tech and add a link to the current thread to Your opening post.",
				"added": 1578340974
			}
		],
		"1578444583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "> [lightingball](#comment_4_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK): Nuclear-weapons experts aren't immediately concerned about a \"tactical\" (or limited) nuclear strike against Iranian targets, but they said Trump as president made it a much likelier possibility.\n\nThere is no practical need for that, because the U.S. has a conventional bomb that is as powerful as the smallest tactical nukes would be. On the other hand, a small \"suitcase bomb\" contains so little fission material that the Iran has probably enough fission material to create many such weapons and use them in stead of conventional warheads on top of their current missiles. It is interesting that the U.S. bases did not have proper anti-missile weapons. I had an impression that the U.S. military leaders on the ground new, what they were doing, but as the lack of equipment in the abundance of money shows, the U.S. military leaders were either slackers or incompetent.",
				"added": 1578524193
			},
			{
				"comment_id": 10,
				"body": "> [undisclosed](#comment_78_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Erdogan's men could be deployed in Iraq for the role of cannon fodder.\n\nIf there exist conventional weapons like the missiles that hit the U.S. military bases, then isn't it so that the classical human soldier based ground troops are a cannon fodder of the 21. century? It would have been idiotic to use swords in WW2, because the weapon systems have evolved and the other side would have shot the swordsmen with machine guns, as was the case with U.S. troops versus \"heroic\" Japanese troops during the WW2, where the Japanese \"heroic\" soldiers got basically slaughtered, as if the Japanese had learned nothing from the first time, when their professional samurais got slaughtered by amateurs with firearms. Now the Pentagon that understood the value of weapons very well during the Cold War between the U.S. and the Soviet Union has lost its edge by hoping that the Iran is like the kamikaze-fools in Afghanistan, but the reality is that the Iran is THE ONLY ARAB COUNTRY and ONE OF THE FEW COUNTRIES ON PLANET EARTH that can properly develop its own weapon's systems. Obviously they learn from everybody, including the Russians, and they use subcomponents from where they can get them, including the Russian military industrial complex, but they do their own development in very high level and sophisticated manner. They probably lack the capacity to take on the U.S., but they certainly have the skills in the population, provided that the Iranian regime has not mistreated the more brainy part of its population so badly that they have emigrated from Iran like the Kasparov has emigrated from Russia and the Albert Einstein had emigrated from the Nazi Germany. \n\nThe Iranian regime executes homosexuals, places journalists in jail or executes them, but I believe that the same Iranian regime can be \"corrupt\" enough to let some gays live, if they find the gays to be useful enough to their military industrial complex. Think of some modern day analogue of the Alan Turing, who was ultimately still mistreated, but he was not executed and jailed, \"only\" his balls were destroyed by the British regime. I'm not totally sure, if the Islamic amputation of hands/legs is better or worse than having one's balls destroyed, but the Alan Turing sure was not sitting in jail and therefore had an opportunity and even the money to escape. What makes the Iranians truly different from the rest of the Arabs is that they tend to take their time to think. You may find many jokes on the net, how the Iranians are \"slow\" and the rest of the Arabs are \"fast\". That is a very big strength and probably also explains, why they, unlike their neighbours, are able to develop many things, including their own weapons. \n\nMy bet is that weapons will beat cannon fodder and the actual military competition is in terms of who can attract the brains that are good at developing the weapons and their production facilities. The Iran with its intolerance of gays, its mistreatment of women, has a pretty bad start, a serious handicap, in that matter, despite their very big strength of taking their time to think. I believe that if the Iranians did not suppress free speech, repress gays, repress women, then they would wipe out the U.S. in military arms race simply because they have more patience and that they take their time to think, whereas the Americans have the serious handicap of using the principle that a quick decision is better than no decision. From that point of view the fact that the Iran is such a repressive Islamic dump is a Good Thing for the U.S., because it keeps the Iran from becoming militarily stronger than the U.S.",
				"added": 1578535160
			}
		],
		"1578520851_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_1648_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Neat idea. I hope calculators and watches use that tech.\n\nNeat idea only for some applications. If You inhale the Tritium, then with the halve life of 12 years it will create cancer cells in Your body for 12 years, unless it exits the body through some mechanism. Take random shots at a shooting range for 12 years in a row at random directions and the probability is pretty good that at least once You will hit the middle of Your target board. Create cancer cells for 12 years in the row and the probability is pretty good that You'll be able to create something that the immune system is not able to eliminate before it multiplies too much or the continuous need to destroy multiplying cancer cells overpowers the immune system and something else might get You before the cancer. What might make sense is the use of some chain of nuclear reactions, where there are no gaseous chemicals or the whole battery is placed to some really high pressure canister, where the gases do not escape before becoming nonradioactive/inert through nuclear reactions. During the Cold War era a different type of nuclear batteries was widely used in Soviet Union light houses:\n\nhttps://www.iaea.org/sites/default/files/publications/magazines/bulletin/bull48-1/48105994247.pdf\n\nhttps://web.archive.org/web/20190711004258/https://englishrussia.com/2009/01/06/abandoned-russian-polar-nuclear-lighthouses/\n",
				"added": 1578540522
			}
		],
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 12,
				"body": "I use ZeroNet because of its technical properties. There are also other P2P-web solutions that store web pages in a distributed manner like the \nhttps://beakerbrowser.com/\nhttps://freenetproject.org/\nhttps://geti2p.net/\nbut the ZeroNet has the technically best implementation. \n\nTECHNICAL QUALITY MATTERS!\n\nThe rest of the argumentation is about technical enforcement of the freedom of speech and as I just mentioned, there are many tools for that. The \"P2P-web\" is not the only tool that is needed for technical enforcement of freedom of speech. For example, e-mail and messaging services like the \nhttps://bitmessage.org/\nhttps://matrix.org/\nhave their niche. The ZeroNet is capable, but not optimal, for fulfilling that niche.",
				"added": 1578660569
			},
			{
				"comment_id": 13,
				"body": "> [consus](#comment_10_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3): Porn, passwords, warez,\n\nThe WWW of the early days certainly was not able to compete with the PornHub. Nor are the \"anonets\", unless You are after child porn.",
				"added": 1578660979
			},
			{
				"comment_id": 14,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1614_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): By definition these people spoil things because they 'can't control themselves'.\n\nAnd You are TOO STUPID to understand that the way to handle those people is to not get involved with them. You may militarily, violence wise, or otherwise win them, but winning them is as USELESS as killing the ants. Just keep Your own living environment clean from the ants and do not worry about the ants in the wild forests where You never walk. \n\nThe main problem with the centralized net is that it tends to get censored, but the very fact that the ZeroNet runs on the same IPv4 network, where the centralized WWW runs, demonstrates that the centralized IPv4 network, with all its flaws like the technical possibility to switch it off by some dictator, has enough privacy that projects like the Tor are able to tunnel the traffic of other applications like the ZeroNet. True IPv4 network censorship starts the moment services like the Tor are tampered with, which is the case in China and the Great Firewall of China. Switching off the IPv4 network is a step up from the tampering with Tor traffic. Another words, You do not have to walk into a Nazi bar and announce that their big idol, Hitler, is an idiot, provided that the Nazis have not taken over all bars in town. If they have taken over all bars in town, then Your main task is to get at least one of the bars back from the Nazis, not to convince that the Nazis should change their minds or suddenly start to be reasonable. Just stand for Your interests so that Your own space, living environment, is according to Your needs and let the idiots be idiots. Besides, You do not seem to worry too much about the idiots in Africa, Afghanistan, Russian prisons, U.S. megachurches, ..., because they are not in Your living environment. \n\nTechnically the most fundamental requirement to \"publicly\" publish any material at all, be it blogs, scientific papers, books, electrical schematics, etc. is to allow those people, whom one does not know, to access it. A Catholic priest that rapes an altar boy probably does not want that raping video published, as tends to be with the writings of properly investigative journalists and the various state officials of various states, but that's just a conflict of interests and the same principle applies: either they do not bother You and live \"in the woods like the ants\" or You fight them to get rid of that threat. The fact that the ants are numerous and You are just one does not change that. Nor does that fact change, if in stead of ants there are wolves or monkeys, just the task is more difficult, but basically the same. One idea to deal with the monkeys and wolves is to lower their IQ by making them drunk. Facebook and some dumber computer games seem to do it really well. Just measure the time that the fools spend on Facebook and think to Yourself that during all that time they probably do not do anything that goes against Your interests. It's a bit like giving interesting toys to children to make them busy enough so that one can concentrate one's own work.\n\nThere's a beautiful saying: \"A mother's song to its baby to make the baby calmly fall asleep is also propaganda.\"",
				"added": 1578662259
			},
			{
				"comment_id": 15,
				"body": "> [xeu100]():I'm not doing anything illegal, nor do I plan on doing anything illegal, \n\nIf You get a death sentence, then living is illegal for You. Unless You are suicidal, You probably plan to stay alive and therefore You are doing at least one \"illegal\" activity. And You will get a death sentence, if You create a protest sign and march with it in Saudi Arabia. You may look up the videos Yourself, where they literally chop people's heads off with a sword at a public execution ceremony. Luckily they do it with just one, \"clean\", swipe, unless You are \nhttps://en.wikipedia.org/wiki/Assassination_of_Jamal_Khashoggi\nwho was cut to pieces and literally sent down the toilet, piece by piece. You may want to look at the following video:\nhttps://livestream.com/accounts/14770704/events/4958510/player?autoPlay=true&mute=false\nThe original announcement of that video:\nhttps://theintercept.com/a-conversation-about-privacy/",
				"added": 1578663188
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 16,
				"body": "So, if the ZeroNet is technically so good at enforcing freedom of speech, the next step the centralized net censorship creators try is to do is to introduce censorship through social manipulation. Oh well, just another day on the Net....",
				"added": 1578664237
			}
		],
		"1579733691_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 17,
				"body": "Thank You for the compliment. \n\nOn a more serious note, I wonder, when do people ultimately understand that \"the Internet\" is not the same as \"selection of the best bits that I personally like\"? The idea that there is a need for a personalized, PRIVATE, search engine that cherry-picks the content according to the preferences of its owner just does not seem to occur to many people.",
				"added": 1579761083
			}
		],
		"1579755041_1JYGp4onxvJxFQovjVFrxjC4hpSSDzXEzi": [
			{
				"comment_id": 18,
				"body": "That's stupid of You. How about putting out at least some Zite, where You show off Your skills, unless You accept to be non-anonymous and post Your GitHub account here so that people can look at Your samples from there.",
				"added": 1579761229
			}
		],
		"1579442143_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 19,
				"body": "Is there any particular reason, why I should waste my time on such a dull topic? Isn't it obvious that the ZeroNet is not just-another-Facebook-or-other-social-media-portal. I wonder, why people think of ZeroNet as some sort of a portal or forum in stead of seeing it as a technology for publishing offline-viewable web pages? May be the ZeroTalk as the default page of ZeroNet node is misleading people? May be in stead of ZeroTalk there should be a technical description, what the ZeroNet is and then there should be a link to the ZeroTalk, so that people do not have the belief that\n\nZeroNet == ZeroTalk\n\n??",
				"added": 1579761521
			}
		],
		"1580240024_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 20,
				"body": "The plants just need to die in the autumn and rot away without being speed-rotten to shit in the stomach of some cow or human. By the way, the birds and insects that feed off of dead bodies, like vultures, should also become vegans...or, oh, plants are not for eating....",
				"added": 1580348624
			}
		],
		"1580580478_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 21,
				"body": "> [bart101] Zeronet is a four year old project and it seems that Zeronet has failed at creating a way for non-coders to create a nice website on Zeronet, so if your a non-coder try WebStudio\n\nGuess what, THE INTERNET is not an application, but A TECHNOLOGY FOR APPLICATIONS. The ZeroNet is also NOT AN APPLICATION, but a TECHNOLOGY FOR APPLICATIONS. If You can't code Yourself, then You hire someone, who crates that \"WYSIWYG\" application for You, just like it is the case with the classical Internet and WITH COMPUTERS IN GENERAL. They are a technology for applications, not applications themselves, just like raw meat or flour is a substance for making food, not ready-made food itself.",
				"added": 1580714388
			},
			{
				"comment_id": 22,
				"body": "> [filips](#comment_424_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Decentralized... But still relies on centralized servers and domains.\n\nSo does any DHT during bootstrapping, unless the bootstrapping data comes with the initial development deliverables, may be a text file in the source tree, may be some source code with hardcoded IP-addresses. But those hard-coded IP-addresses themselves are a central point of failure, a target for censorship, etc. During the bootstrapping the issue is fundamental. What is possible after the bootstrapping depends on, how many nodes the DHT has, because for decentralization at any point of time there has to be enough nodes to keep the DHT alive and if there aren't enough of them, then a set of some static IP-address based, centralized, servers can help out. ",
				"added": 1580714719
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 23,
				"body": "> [anonymuse](#comment_18_1LyfppYhaZN1PyhrN6TM8hTkEX6BHMBX6u): What i miss is having uncucked unlimited uncensored search results. \n\nNot a perfect solution, but a few options that may slightly alleviate the situation:\n\nhttps://metager.de/\nhttps://www.mojeek.co.uk/\nhttps://yacy.net/\nhttps://www.peteyvid.com/\n\nThe closest to a proper P2P search engine is the YaCy, but it is really unstable and hangs. If You really want to use the YaCy, then do not make it index a lot of pages, only Your own and a few of Your friends home pages just to make those pages available on the YaCy P2P network and hope that if others do the same, the YaCy will provide some alternative search results. Also, if You are not totally ready to start using the alternative search engines then You may want to use the mainstream search engines through the \n\nhttps://www.startpage.com/\n\nmeta-search-engine. Even if it does not give any extra privacy, it certainly offers less cluttered view to the search results. For scientific papers You may want to use the following links:\n\nhttps://www.frontiersin.org/\nhttps://www.semanticscholar.org/\nhttps://www.biorxiv.org/\nhttps://cds.cern.ch/\nhttps://arxiv.org/\nhttp://v2.sherpa.ac.uk/opendoar/\nhttps://fidmath.de/en/\nhttps://www.zbmath.org/\nhttp://laser.portal.knowledgediscovery.org/\nhttp://www.diva-portal.org/smash/search.jsf?dswid=9861\nhttp://etheses.whiterose.ac.uk/\nhttps://usegalaxy.org/\nhttps://pqdtopen.proquest.com/search.html\n\n",
				"added": 1580715479
			},
			{
				"comment_id": 24,
				"body": "> [qqstejgk77rtkats](#comment_15_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi): Agreed, and many of those people had solid/specific expertise they were willing to share.\n\n> [qqstejgk77rtkats](): Usenet was really, really good for problem solving.\n\nNowadays there is the stackexchange.",
				"added": 1580726350
			}
		],
		"1554128617_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 25,
				"body": "You're a developer, who wants to work on the ZeroNet, and Yet You are such a looser, who does not even set up, DVELOP, Your shop that You self could use for offering Your ZeroNet related services. Start by DEVELOPING that payment system Yourself, set at least that up, and then announce that YOU OFFER SERVICES. Right now it's a lot like You are walking to a physical market, where other people, merchants, have set up their sales booths with GOODS ON \n DISPLAY and You are just whining that You are such an awesome merchant, who could sell a lot of goods, but You do not bother to set up Your sales booth and You do not even have a \"printed magazine\" with photos of Your goods with You. \n\nShow some code on GitHub or somewhere, where it is tied to Your real identity, so that You can be accountable for plagiarism, if You claim to have written something that You have not written Yourself. Then set up that sales site/zite to demonstrate that You can actually DO SOMETHING with ZeroNet and then MAY BE someone other than a total idiot might consider Your services.\n\nWhat would You self think of a developer, who is such a slacker that it does not bother to do even that much as to set up a system FOR COLLECTING MONEY? ",
				"added": 1580840890
			}
		],
		"1580594957_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5": [
			{
				"comment_id": 26,
				"body": "https://www.vim.org/\n\nHas a high learning curve, but all major IDEs at least partly support Vi/Vim key bindings, even the Microsoft Visual Studio. Sometimes the IDEs need a plugin for the Vi/Vim key bindings support. The key bindings should be learned like words of a foreign language: one key binding per day combined with repetition/use of the bindings from previous days. Before starting to learn the Vim key bindings, one should be able to type without watching the keyboard and that can be learned in about 2 weeks, about 2h of practicing per day, provided that the training tool is right. Here's one really good training tool:\n\nhttp://www.doorwayonline.org.uk/typing/\n\nPlease note that the sound part is an important element of the typing training, so please make sure that You have headphones or otherwise have switched in the sound. The main benefit of being able to type without watching the keyboard is the ability to use a much more ergonomic working position and the ability to keep one's attention on the content of the writable text in stead of being distracted by the physical activity of entering the text. Imagine, how hard it would be to write with a plain pen, if in stead of thinking about what to write, the thoughts are distracted by the effort of using the pen. The same applies to using a keyboard: it helps a lot, if one can just think one's thoughts in stead of being distracted by the effort of entering text. The Vim key bindings just reduce the amount of keystrokes that one has to make, when coding/programming. An alternative to the Vim is the \n\nhttps://www.gnu.org/software/emacs/\n\nbut the Emacs key bindings do not reduce the number of keystrokes as much as the Vim key bindings do. May be it could be said that the Emacs is more \"verbose\" than Vim, but the succinctness of the Vim does come with the price of a pretty high learning curve. Expect it to take about a year to learn most of the Vim key bindings after You already master the typing without watching the keyboard.\n\n Thank You for reading this comment.",
				"added": 1580844671
			}
		],
		"1580783002_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 27,
				"body": "What regards to the \"millennial hyper-individualistic mentality\", then I do remind You that both, the Edward Snowden and the Bradley/Chelsea Manning, are also millennials. How does their altruism compare with Yours? Oh, and what did millennials' parents generation achieve? Apart from sexual freedom, hippy movement I certainly can not remember much, at least not at the western, U.S. side. At the Soviet occupied regions in Eastern-Europe the parents of the millennials have built up almost everything that is there, except the old infrastructure from previous eras. After the collapse of the Soviet Union the materialistic situation at the previously occupied Eastern-European regions was awful and the parents of the millennials had to learn the basics of capitalism, how to run their own business, because running a private business was literally a criminal offense in the communist Soviet Union. Given that the Internet, the WWW part of it, appeared in the early 90-ties, the Internet wasn't much of a source for learning materials, because there wasn't that much material online yet. \n\nThe Cold War between the Soviet Union and the U.S. was fought mainly by the grandparents of the millennials. But it is an interesting question, what deeds do define my generation, the millennials generation? I would like to think that given that younger generations are not at the age of an experienced specialists, it is the millennials, who have to bare the hardcore-specialist roles in 2020 and the world is, what we make it to be. Be it Orwell 1984 or be it something else. Privacy in the age of IoT seems to be the battle of the millennials. Add war robots and other computerized military equipment, including targeting analysis, to the mix and the privacy technology topics are very relevant in the context of who dies and who lives on the battlefield, if there even exists such a thing as a battlefield that clearly any more.\n",
				"added": 1580846406
			}
		],
		"1579381945_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 28,
				"body": "> With millennials and Gen Z's also having fewer kids as a result of the shitty economic environment they grew up in, there's also a risk that the future will have a lot less young people\n\nWrong. The idiots in India and Africa will reproduce like cockroaches. The same with Arabs: about 10 years ago there was a time, when about 50% of the Saudi Arabian population was younger than 30 years. If that high percentage of population is without proper life experience, then obviously that kind of a population is easy to manipulate/brainwash by whoever is at the throne.",
				"added": 1580847726
			},
			{
				"comment_id": 29,
				"body": "I think that one easy fix might be that just like sperm and eggs are stored frozen for later use,  some other tissues can be stored for later cloning. Just a very small piece, the size of a fire match head, of young fat tissue will probably help a lot at the old age and it doesn't take that much space in storage. On the other hand, as with everything, including open source software, it's about getting the work done. We got the computers, we got the compilers, and yet we still do not have all the software that we need.",
				"added": 1580848140
			}
		],
		"1580849186_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": [
			{
				"comment_id": 30,
				"body": "> [driud](#comment_34_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): This is an independent site available on the regular network.\n\nThe PeerTube is not just one single site/seed-server, but a federation of seed-servers on the censored network. It's a lot like the \nhttps://fediverse.party/\nexcept that in stead of multiple different applications that share a communiation protocol there is just one application, where the deployed instances, the seed servers, share information about the videos that they seed. A beautifully polished piece of software that certainly can compete with the YouTube from end user comfort point of view, but has the fundamental flaw that it is on a censored network. On the other hand, the very fact that it is on the censored network gives it its advantage of being the middle-step for people, who do not yet use the ZeroNet or other non-censored software defined networks. I guess it is only a matter of time, till lawyers or the supermafiosi/governments start to take those seed servers down, but it is certainly a right tool for a very specific task. It fulfills its niche well.",
				"added": 1580924572
			}
		],
		"1580335642_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 31,
				"body": "> [ranshit](#comment_80_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Scihub/Libgen is at 33 terabyte\n\nWhat do You use for a file system? Some virtual file system like the \nhttp://www.xtreemfs.org/\nhttps://www.gluster.org/\nhttps://lizardfs.org/\n?\n\nIf all of the zites are at the folder\n\n    <ZeroNet home>/data\n\nlike \n\n    <ZeroNet home>/data/<zite folder>\n\nthen how is the performance of the file system? What does \n\n    cd <ZeroNet home>/data/\n    time ls >/dev/null\n\nshow? Thank You for Your answers.",
				"added": 1580925054
			},
			{
				"comment_id": 32,
				"body": "> [labor](#comment_2_1BtohSFtgv5SNQ4i6Gu7ox5cYttW8Jkoxk): Those who host should be anonymous. When there is accountability for posts, illegal porn will reduce.\n\nYou do realize that the moment You eliminate anonymity, it is the supermafia/governments that can apply censorship for whatever reason. If that's the case, then what's the point of using the ZeroNet at all other than redundancy in P2P hosting?",
				"added": 1580925303
			},
			{
				"comment_id": 33,
				"body": "> [styromaniac](#comment_1775_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's about not seeing it. I don't mind it, but my family wouldn't want to see the thumbnails.\n\nThat's a nice summary of an interesting use case that is more general than just some porn hosting matters. Another way to phrase it might be: how to reuse downloaded zite folders for multiple profiles.",
				"added": 1580925628
			},
			{
				"comment_id": 34,
				"body": "> [qqstejgk77rtkats](#comment_17_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi): Don't know if SciHub would fit on a drive that size, but if someone does the work setting it up - least I could do is seed it.\n\nI suspect that to allow others, who do not have so much storage space to spend, help with the seeding the SciHub mirror should be divided to multiple, smaller, zites. The only viable way to do it is to do it automatically and the conversion software should take future updates to account, specially those kinds of updates that add data. The upstream updates that remove data should NOT remove that data from the ZeroNet mirror. \n\nEasy for me to write, hard for others to do, but I've got my own open source software projects to worry about.",
				"added": 1580926567
			}
		],
		"1580721027_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 35,
				"body": "As a capitalist anarchist I certainly oppose all forms of communism, including cyber-communism. People, who want to use the word \"communism\" in an anti-rip-off meaning certainly do not have a clue, what real-life communism is. How about using the word \"nazism\" for something that has a positive meaning? Would that work out? I guess not, but for some reason the word \"communism\" is seen as a positive word, without even realizing that \"communism\" and Marxism are not even always the same thing.\n\nIt's even kind of funny, but sad, that someone, who creates some anti-rip-off and anti-censorship community on a anti-censorship network does not realize that communist regimes had far heavier censorship than the western capitalistic regimes ever had. How about the year 2020 communist China and its Great FireWall of China? Ain't communism a great regime that supports freedom of speech and lacks censorship... \n\nHow about cyber-islamism? It's also anti-western. Let's just not pay attention to the fact that the modern Saudi Arabia literally chops off the heads of protesters and that in Islamic regions women do not have the same rights as men and that gays are literally being hung in Iran. But it is anti-western, so .... cyber-islamism, anybody? The Iran even has an official motto: \"Death to America!\" I'm not sure, what the Chinese version of it is. \n\nOr may be cyber-putinism? Hopefully You know that a man called Putin is a very important man in year 2020 Russia.",
				"added": 1581062907
			},
			{
				"comment_id": 36,
				"body": "> [moor](#comment_386_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): 1) communism isn't about anti-copyright, its about one owning the fruits of their labour.\n\nWrong! In communism, as the word hints, THE COMMUNITY OWNS EVERYTHING. You DO NOT own the fruits of YOUR labor. But if You are at the top of the hierarchy of the \"community\", possibly a communist party leader (other parties are forbidden/killed/imprisoned/eliminated), then You can certainly determine, what will happen to the fruits of other people's labor. \n\nThe formal communist saying: \nFrom those with the capability, to those with the need.\n\nParody that extends that saying:\nThe communist party leadership has the greatest needs and the smallest capability.",
				"added": 1581063739
			},
			{
				"comment_id": 37,
				"body": "> [moor](#comment_389_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): yeah, well, you know, that’s just, like, your opinion, man.\n\nYeah, let's redefine \"torture\", like the George Walker Bush did. After all, one can use any word for any meaning in one's own text.",
				"added": 1581111688
			},
			{
				"comment_id": 38,
				"body": "> [fractalzoomer@kxoid.bit](#comment_13_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC): Besides, in these communities no one \"owns\" content as it is stored on many different people's computers and accessible and copy-able by everyone for no cost and with free software.\n\nThe Communist Party always needs control. It needs to de facto OWN content. That's what censorship in communist regimes and other regimes is about: the regime OWNS ALL CONTENT and the regime tells, what can be done with the content. I hope that this is clear enough explanation that the word \"communism\" does not include the sharing aspect of the social arrangement. I find it interesting, how the people in The West very consistently ignore the fact of life that the moment resources are scarce, their use will be PRIORITIZED and the ones at the top of the social hierarchy certainly higher priority access to the scarce resources than the rest of the population. In the case of the communist regimes it's the Communist Party leadership and even within the party the ones ranking higher have higher priority access than the lower ranking party members.\n\nA concrete example is that at some time period Western music was forbidden in the Soviet Union. In modern Russia the media is also heavily censored. Not as heavily as during the Soviet Union times, but for \"some unknown reason\" journalists, who cross the Kremlin line(s) too much, tend to die through some violent cause, including being poisoned. A thing that tends to be left unnoticed is that there are truly multiple types of censorship and the supermafiosi, so to speak \"state actors\", are not the only party that tries to apply censorship. The various cover-ups of product related flaws is one example out of many, including the relatively recent (last 10 years) Boeing case. Side-effects of drugs might be something that the pharmaceutical companies, not just the big ones, sometimes hide. \n\nMedia companies censor forums just to dumb the discussion down, because there are less smart people in the population than dumb ones, but if each person pays the same fee and the arguments of the smart people discourage the dumber ones from consuming/paying_for the media, then it makes plain business sense to alienate the small smart, paying, community to keep the big dumb, paying, community and political censorship or advertisement has nothing to do with that decision. The same reason, why the Hollywood produces dumb movies, even when they could do better. The same in gaming industry: the DeusEX series was too intelligent and smart, did not pay enough, so some dumber games like \"Grand Theft Auto\"\n\n",
				"added": 1581112130
			}
		],
		"1581100642_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 39,
				"body": "The ZeroNet is not for real-time communication. The architecture of the ZeroNet is that signed copies of files are shared and if a ZeroNet site, generally called as zite, has a newer version, let's say, the original author of a zite adds another entry to its blog, then a newer signed version of the file(s) get(s) distributed around. Forums like the current one contain multiple posts, which are signed files. It is possible to distribute sound files like OGG, MP3, WAV, etc. but the classical streaming is not possible. For real-time communication the Tor network should be used. You may also study the \nhttps://matrix.org/",
				"added": 1581114848
			}
		],
		"1581116791_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": [
			{
				"comment_id": 40,
				"body": "> [cannabissmoker](#comment_1_1FmC53ZDqp15korLaKkB5XENMJguuxrzLT): I fucking hate trump!\n\nI'm not necessarily a Trump fan either, but given what the alternatives were at the previous U.S. presidential election, then one can say without any exaggeration that the Trump SAVED AMERICA. I do recall that thanks to the Russian intelligence services and the WikiLeaks it turned out that the Democratic Party leadership was intentionally downplaying Bernie Sanders and up-playing the Hillary Clinton. That leak led to the resignation of the Democratic Party leader, Deborah Wasserman Schultz\nhttps://en.wikipedia.org/wiki/2016_Democratic_National_Committee_email_leak\nhttps://archive.is/wip/6Vslb\n\nAdd to the fact that the Hilary Clinton wanted to repress Julian Assange, Edward Snowden, Bradley/Chelsea Manning. If that sort of slick ESTABLISHMENT had won, then it would be pretty bad for the America. Even the then FBI director, the one that the Trump fired, the James Comey, \nhttps://en.wikipedia.org/wiki/Dismissal_of_James_Comey\nhttps://archive.is/wip/ILZOv\npretty much new, what he was doing, when timing the announcement of the relatively irrelevant investigation of one of the Democratic Party figures, a Hillary Clinton collaborators. Think of it, the James Comey, the head of the FBI, has pretty much nothing to do with mainstream politics except pleasing the politicians and given the choice between pleasing the establishment or taking the path of intentionally BURNING HIS CAREER he intentionally chose to burn his career while being at the very top of it. Given that the FBI has the duty of conducting counter-intelligence, he probably knew pretty well, how nasty establishment the Democratic Party is, so he put himself on the line not because he likes Trump, quite the opposite, as he describes at his book, but because that slick Democratic Party establishment, where even within the Democratic Party itself the top leadership mistreats other Democratic Party members, would be far more worse than some extravagant, narcissistic, in many cases incompetent reality-show star.\n\nSo, I believe that the Trump truly saved America. On the other hand, I also think that it is really bad that the Trump did not get impeached in 2020_02. Leaving the Trump in office like that is such a bad decision that it will have Orwellian results even after the Trump is voted out of office or his 2. presidential term ends.",
				"added": 1581229395
			}
		],
		"1582169978_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": [
			{
				"comment_id": 41,
				"body": "Is there any particular reason, why any sane person would like to rape anybody, specially an old man?",
				"added": 1582188670
			}
		],
		"1582173702_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 42,
				"body": "I do point out that You actually have paid taxes in the form of \"value added tax\"(VAT), \"sales tax\", \"realestate tax\"(if You rent real estate then the landlord pays that from the rent that it receives.), tax on gasoline, etc. So bleed the beast as much as You can. You may also want to learn, how the people in the former communist Soviet Union bled the beast. They bled it so well that the beast was not able to resist the pressure in the form of the costs of the arms race with the U.S. With the Soviet Union it was really a 2-front situation: the Soviet Union would have not collapsed without the arms race financial pressure, but on the other hand, the Soviet Union would have been able to withstand the arms race financial pressure, if the people of the Soviet Union had stepped up the work and kept the Soviet Union financially/materialistically strong enough. It's a lot like with lethal diseases: a single disease can be survivable, if backup systems compensate, but 2 diseases at the same time, one harming the systems that might offer backup to handle the other disease can be lethal with a much greater probability. The same with checkmate in chess: it often takes at least 2 enemy buttons to make a checkmate.",
				"added": 1582189453
			},
			{
				"comment_id": 44,
				"body": "> [robione](#comment_478_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Indeed, ruskies know how to bleed the system well.\n\nNot just the Russians. Also OLDER people of many other nationalities, who experienced life in the Soviet Union first hand. Think of the Poles, the East-Germans, Lithuanians, Latvians, Estonians, etc. Unfortunately the younger generation does not quite understand, what the Soviet Union was. The U.S. young that for some weird reason do not want to live in Cuba, are specially uninformed, specially those, who demand that the Washington should rob/tax  people more in stead of getting out of the way of the Young by not enforcing the monopoly of old businesses (think of the patent system and the copyright system for the WaltDisney Mickey Mouse) and allowing the Young to create more \"new Facebook's and Google's\" that, IF THE YOUNG SO CHOOSE, are not evil. The Facebook and Google founders clearly did not consider the privacy of their users important, but may be some new entrepreneur comes up with something different. Obviously the idiots demanding more taxes do not even consider creating their own businesses. \n\nWhat regards to the horrific cost of university level education in the U.S. and the related student debt, then that's also for idiots, because the students do have the opportunity to learn German and French and go to a German or French university. For example, English is not my native language either, so it is perfectly OK for me to expect that other people can also learn at least one foreign language to the level that they can attend a foreign university. Not to mention the fact that often times the European universities, think of reputable universities like the major German and French universities, have courses in English, so the Americans do not even have to be that good at German or French. What regards to the observation that many European students attend the horribly expensive U.S. universities, then the catch is that most of those European students DO NOT PAY A DIME for that, they get grants/stipends and receive their diplomas without accumulating any student debt at all. I know one person, who first got a PhD in physics from his home country, at a university that is at the top 1% at the global ranking, and then chose to get another physics PhD from a less reputable U.S. university just to have some more easily understandable paper/diploma to show to U.S. employers. Basically the U.S. university PhD was a kind of an \"easy project\" for him, because the level of the non-top-U.S. universities is so low, if compared with the major European universities. The top-U.S. universities are a different matter, but not too hard, as proved by one other person from my home country. That other person got his PhD in physics from Harvard, without paying a dime for it, and now basically lives off Washington supermafia/government loot(tax money) by working for some Washington supermafia financed institute/laboratory, having fun with physics research. ",
				"added": 1582228530
			}
		],
		"1581695503_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 43,
				"body": "Educating people about various\nhttps://www.privacytools.io/\nsounds like a good idea, but the PROBLEM is that many of the tools are not that well polished, so the recommendations should be chosen wisely. The ZeroNet that I love tends to be quite hard to set up by a \"boomer-granny\", not to mention the fact that the \"boomer-granny\" probably only has windows, with the latest and greatest hardware, if she has the money and wants to be \"cool\". People should not be lured to a trap of believing that they have privacy, when in reality they do not have it. On the other hand, the more people use the various kinds of different privacy enforcement tools, even if they use them on the backdoored Windows on a backdoored Intel CPU\n\n(\"Joanna Rutkowska: Towards (reasonably) trustworthy x86 laptops\")\nhttps://www.youtube.com/watch?v=rcwngbUrZNg\n\n(A public letter to Intel from the author of the MINIX3.org operating system\nthat the Intel chose to run their backdoor implementation with.)\nhttps://www.cs.vu.nl/~ast/intel/\n\nThe AMD CPU-s are literally no better than those of Intel. The AMD CPU-s have the same kind of ARM CPU based backdoor-implementation that the Intel has and a nice joke is that the ARM CPU, even the very same type that ins embedded to the AMD CPU, has also \"secure zone\"/backdoor-software-space, but in stead of embedding another CPU in it, the ARM CPU uses CPU working modes. So the Intel/AMD CPU includes an ARM CPU, which in turn can have multiple execution modes. The newer RISC-V will not save the day from privacy point of view, because having those back-door-software-execution capabilities in the Intel/AMD CPU-s is a matter of policy of the Intel and AMD and they can use that policy with whatever CPU that they produce and business wise it is the Intel and AMD that produce literally ALL non-ARM-laptop and desktop CPU-s of the year 2020 planet Earth. \n\nFor servers there's an option of Fujitsu SPARC \nhttps://en.wikipedia.org/wiki/SPARC\nand IBM PowerPC\nhttps://en.wikipedia.org/wiki/PowerPC\nbut the IBM is just another U.S. company that aims for revenue first and end user privacy non-first. The Fujitsu \nhttps://en.wikipedia.org/wiki/Fujitsu\nis a Japanese version, but they bow to the Japanese government, which bows to the Washington, so even if the SPARC technology itself is not fundamentally backdoored, the companies can always use the SoC(System-on-a-Chip) approach and add some extras to their system. \n\nFrom hardware backdoors point of view probably the ultimate scheme for creating backdoors is not to change the component/transistor count of a non-backdoored CPU, but rather alter the electrical schematics of the CPU by changing the electrical properties of the transistors that are already in the non-backdoored CPU.\n\n(\"Stealthy Dopant-Level Hardware Trojans\")\nhttps://web.archive.org/web/20190715084226/http://vcsg.ecs.umass.edu/publications/BeckerChes13.pdf\n\nFrom that point of view, even if one owned a semiconductor foundry, there would be the risk that someone hacks into the production line and it would be very hard, if not impossible, to really know, whether the design-wise non-backdoored CPU-s have backdoors in them or not. From that point of view probably the best option from security point of view is self-produced FPGA-s combined with some randomization at the hardware description language compiler side, so that each computer instance has slightly different use of the FPGA-s, which means that the chance that the malware developers have exactly the same hardware level implementation of a CPU with a given ISA(Instruction Set Architecture) is very small. This is, where the importance of the Project IceStorm\nhttp://www.clifford.at/icestorm/\nbecomes very evident. Basically, what is needed is, is what both, the Intel engineers have done with their Pentium CPU\n\n(\"Intel Nehalem Processor Core Made FPGA Synthesizable\")\nhttp://www-inst.eecs.berkeley.edu/~cs150/sp10/Collections/Papers/nehalemFPGA.pdf\n\nand what the Russian researchers have done for developing their own CPU architectures:\n\nhttps://upload.wikimedia.org/wikipedia/en/thumb/1/12/MCST-4R_FPGA_prototype.gif/1280px-MCST-4R_FPGA_prototype.gif\nhttps://en.wikipedia.org/wiki/MCST-R1000\n\nNone of those solutions is applicable to the general population, because the only hardware that even the most security conscious people from the general population can access is what they can buy. The only hardware that they can have access to is either old Intel/AMD hardware, the ~700MHz single-core CPU-s, which have been extensively studied and are supported by GCC, Linux, or the modern, but backdoored, hardware. It is not a matter of technical capabilities, but rather, what is being produced and marketed. Currently the only non-Chinese FPGA companies on planet Earth are also U.S. companies, meaning, The West is in deep trouble, because the Orwell-ianization of The West eliminates the distinct advantage of The West that The West has/had over the China. \n\nIn a way it's kind of interesting that the U.S. intelligence agencies that fear the China do not understand that their game is over, if The West looses its military edge over China and the only thing that the China can not copy, \"steal\", is the non-Orwellian culture, the very thing that the Washington and the U.S. intelligence agencies currently try to undermine. If this goes on, then given the stricter privacy laws of the European Union supermafia, it might very well be that it is the mainland Europe that has to come to the rescue of the U.S. and the U.K., provided that the \"civil society\" of the mainland Europe gets its act together and keeps developing the Tor and ZeroNet, etc. They are all international projects, but many of them tend to originate from Europe. ThePirateBay was a Swedish \"project\", the ZeroNet as a project founded by ThePirateBay members therefore originates from Sweden. The FPGA compiler project, the Project IceStorm, originates from Austria. The Linux originates from Finland. The absolute prominent project of the free software movement, the GCC, originates from the U.S. and the BSD operating system originates from the U.S. I'm not sure about the Tor, but I guess that was mainly a U.S. project, despite the fact that its development has largely moved to Europe. One can not under-estimate the importance of the 90-ties U.S. RedHat in terms of making the Linux available to the masses and developing the packaging system and developing many drivers and doing a lot of Linux porting work in general. Of course the C programming language originates from the U.S. and the C++ is originally created by an European, but basically the C++ is a U.S. project, because he worked mostly in the U.S. while working on the C++. \n\nI find it quite ironic that the \"banksters\" get a lot of criticism, but it is exactly those very U.S. banksters, stock market sharks, that actually form the market for the high-end-FPGA-s that are the best components for creating properly secure CPU-s/computers. The stock market sharks use them for their custom AI-implementations and custom network cards. The U.S. banksters are the ones, who also hire the C++ crator, the \nhttps://en.wikipedia.org/wiki/Bjarne_Stroustrup\nIt is interesting that the banksters seem to be clever enough to know that they would not be able to run their business under the Chinese or Russian/Soviet regime, so they actually spend some of their wealth to protect their turf and finance the development of C++. C++ is not the programming language of the Pentagon, the Pentagon has Ada, which historically failed in favor of C/C++ and as it turns out, the newest Pentagon fighter, the F-35, uses C++ for avionics/control_software, probably because the Ada is a de facto proprietary programming language, owned by a single company, the AdaCore. From that point of view it is technically precise to say that the Washington/Government technology project, the Ada programming language, has failed and it is the base technology project of the banksters, the C++ programming language, that keeps the year 2020 most modern fighter plane, the F-35, flying, and the failure of the modern version of Ada is not on the technical side, but on the social side, as often tends to be the case with most Government/supermafia/state projects regardless of the capital of a particular supermafia.\n\nAnyways, despite the fact that the general population does not have any kind of a chance to get secure hardware, it is still worth for them to start using privacy enhancement tools to make the traffic analysis more difficult, not impossible, but just more difficult, for all Orwellian agencies. It is exactly in the shadows of this general traffic that the real hactivists can have their properly secure network traffic and hactivism in general. So, indeed, propagate the following URL:\n\nhttps://www.privacytools.io/",
				"added": 1582196697
			}
		],
		"1581923364_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": [
			{
				"comment_id": 45,
				"body": "> [mrsex](#comment_1_158mjMWcgfLDnSd8Q7kEivftCtr3hA2aj4): i am a chinese ,a new user i hear that here can safe from gov's control.\n\nWelcome, but please be aware that the ZeroNet offers only the possibility to publish without the possibility of censors to take down information, but to get anonymity, the ZeroNet has to be tunneled through Tor. On the other hand, the middle ground that does NOT provide anonymity, but alleviates the situation, is to switch in encryption. The ZeroNet python start-up script console parameter is \"--force_encryption\", like\n\n    python2 ./zeronet.py --force_encryption\n\nThe Great FireWall of China will probably block all Tor traffic, so that's an issue, but You might try to create a VPN-connection to some Western server, for example, Your own rented VPS (Virtual Private Server). You may try to tunnel Your traffic through an SSH tunnel. If that works, then You might be able to still use the Tor.",
				"added": 1582231008
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 46,
				"body": "Some version of the ZeroNet docs on the ZeroNet itself:\nhttp://127.0.0.1:43110/1Docsfk5uLvuXkL4U13eYDxCm2gzi1fNQq/\n\nZeroNet Dev Center set of ZeroNet related tutorials:\nhttp://127.0.0.1:43110/14pM9huTYzJdyQyHRj6v2kfhMe8DrxwpGt/",
				"added": 1582231828
			}
		],
		"1582025950_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 47,
				"body": "How about the reason that there is no other WORLD WIDE network available that I can afford. The ZeroNet and Tor also depend on the censored internet, the IPv4 network. What regards to the lack of reliability, then the plain internet connection from my local Internet Service Provider is currently the best that I've got. I do point out that the IPv4 network started to get used by re-using existing network hardware, which was the telephone network. There were such devices called MODEM-s. A MODEM stands for Modulator-DeModulator. A phone line MODEM was a device that was in the role of a network card and it could be an external device that connected to the computer over the parallel port, the same old port that was used for connecting printers.\n\nOn the other hand, some of the very old, telephone line based, \"bulleting board\" systems function even today. I do not know all of them, but FidoNet is one of them.\n\nhttps://www.fidonet.org/\nhttp://filegate.net/\nhttp://ftsc.org/\n\nThe classical one, the one, where the Linus Torvalds announced the Linux, was USENET and since text transmission was supported, binary files like images were first converted to text.\n\nhttps://en.wikipedia.org/wiki/Usenet\n\nhttps://en.wikipedia.org/wiki/Base64\nhttps://en.wikipedia.org/wiki/Uuencoding\nhttp://parchive.sourceforge.net/\n\nThere are some alternative grassroots network hardware projects, but they are not covering the whole planet. A partial list of them:\nhttps://guifi.net/\nhttps://wirelessleiden.nl/\nhttps://www.funkfeuer.at/\nhttps://freifunk.net/\nhttp://servalproject.org/\n\nWhat regards to the routing protocols, then here are a few more prominent ones:\nhttp://www.olsr.org/\nhttps://www.open-mesh.org/\n\nYou may want to look at the following video for introduction:\n\"[DEFCON 20] Off-Grid Communications with Android: Meshing the Mobile World\"\nhttps://www.youtube.com/watch?v=Kl5sMPXs3cI\n\nYou may think of the routing task as finding a path in a city, from one house to another. There can be multiple paths and the paths can be the same regardless of how the house \"addresses\" are written down. In The West houses are \"addressed\" by street name and house number, but in Japan houses are \"addressed\" differently, mainly by \"house number within a batch of houses\".\nhttps://en.wikipedia.org/wiki/Japanese_addressing_system\nJust like a route from one house to another can differ, depending on whether one uses a truck, a small car or a bike, the routing in a mesh network can also depend on the capabilities of the devices. Small volume of low-speed communication might be routed from one small microcontroller device to another, but a video is another matter. What is certain, is that devices join and leave the network at any time, so a static map does not make sense, and there are so many devices on planet Earth, in the future also on other planets, that it is not possible for a device to include a \"world map\" of devices. The old, nicely static, IPv4 and IPv6 systems were developed for a situation, where the adversary can only nuke or bomb a facility or raid at most some of the facilities, not all of the facilities at once. An \"underground\" mesh network has a far more difficult task to solve.\n",
				"added": 1582399388
			}
		],
		"1582366551_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 48,
				"body": "> [ranshit](#comment_96_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Search engines act like the internet didn't exist in 2010 just as the US housing crash never happened in 2007.\n\nAnd that is, why people need to run their own P2P-search engine instances like the \nhttps://yacy.net/\n\nNo one is able to index the whole internet, not even Google with its huge datacenters can, but People Have the Power by running a P2P-searchengine instance that indexes just a small part of the network, only the some of the parts that might interest the owner of the P2P-searchengine owner the most, and the decentralized search engine network can be even more capable than the Google is. Just dedicate Your old computer to that cause and that will eventually solve the problem. Your choice! \n\n> [styromaniac](#comment_1828_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): One day, on the clearnet, bots that act humanly will outnumber humans online.\n\nThat's not a bad thing, provided that the bots actually serve the human, who owns the computer. A P2P-searchengine spider is also \"an online bot\".",
				"added": 1582401818
			},
			{
				"comment_id": 49,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1867_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): 'a pointless generation with no future'.\n\nIt is the DUTY of the older generations to give a future for the newer generations. In science/engineering, all great scientists/engineers stand on the shoulders of scientists before them. Why shouldn't historical records be useful in other fields? It's only the older generations that can DOCUMENT THE EVENTS OF THEIR TIME and the failures and successes, lessons learned by them, the older generations. It is the DUTY of younger generations to USE THOSE RECORDS, think critically of them, and then USE THEIR OWN MINDS to make NEW KINDS OF MISTAKES that differ from the mistakes of older generations. Then document the mistakes and successes for even newer generations to learn from and also retain/pass_on the records created by the older generations. At least that's what museums/archives/libraries are for, unless the museums/archives/libraries are used for propaganda and used so that that the \"unwanted records\" are censored/removed.",
				"added": 1582402189
			}
		],
		"1582442446_1JmxhPt4FDP7rTmmaxoKdwTSDhwg5YSatG": [
			{
				"comment_id": 50,
				"body": "Is there any reason, why the \"bad stuff\" would not be on ZeroNet or FreeNET or I2P just like it is on the censored net? Where do You get this idea that a censorship free publishing network censors the material that You consider bad?",
				"added": 1582451263
			}
		],
		"1574730236_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 51,
				"body": "The core of any \"social network\" is to offer people an ego-trip by creating a bubble, where people can look at themselves and think, how beautiful, awesome, important, top of the line they are. That may suit to extroverts like the Donald Trump and other narcissistic people, but the core concept of a \"social network\" is based exactly on offering narcissists that ego-trip. May be many clever people understand that and do not want to waste their time on such a nonsense like a \"social network\"? Advertising social networks to non-narcissistic people is a bit like sincerely kindly offering cigarettes to a non-smoker and assuming that since I smoke, other people must also enjoy that poisonous activity. \n\nThank You (for the \"cigarette\"), but the world is more complex than that.",
				"added": 1582451980
			}
		],
		"1582033580_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 52,
				"body": "> [robione](#comment_484_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): why hasn't someone decided to visit and do a makeup swap and sneak him out to another country..?\n\nWhich country? The Chinese certainly do not want any freedom-of-speech-and-state-transparency advocate. The Kremlin KGB/FSB knows that the moment they succeed carrying out such an intrusive operation, it's gloves off also for the CIA: snatch Assange from The West, snatch anybody from Russia. The European supermafiosi are just social lambs, very social, but also dumb like lambs, so they do not violate the social norm of bowing to Washington, just as long as they get to live their well paid, happy, prosperous, life without having to spend time on any \"dumb activity of making the world a better place\". For them the world already is good: they can afford anything that the technology has to offer, no war in Europe, life is great!\n\nIn my opinion the Julian Assange is a hero and helped The West a lot, but the smart thing for him to do would have been to focus on fixing his own home turf, the Australia, first. Step-by-step. For example, the Australian spermafia does not even have the basic privacy protections for its tax-slaves/citizens. Also, the Australia is a kind of an easy case in a sense that the Australian way of life is threatened by the mad Islamists at the very same set of islands, where the Singapore is, the expansionist China, sometimes Japan, given the nasty regime that the Japan had during the WW2, but apart from that the Australia only has natural issues like forest fires, horribly poisonous spiders and snakes and scorpions and other dangerous creatures like that, which is hard to deal with, but not as bad as human armies. So, from that point of view, I do not quite understand, what the Julian Assange did outside of Australia at first place. He had plenty of issues to solve at his home country, the Australia. If he likes Swedish women, then he could have fucked them as a tourist or better yet, start a romantic relationship and \"get a wife\". \n\nAll in all, I think that the Julian Assange was on the right path, his heart was/is at the right place, but he is clearly TERRIBLY UNORGANIZED. He was totally unprepared, when he started the WikiLeaks project. Or may be he thought that he is too weak to take on China and Russia, so he tries The West as a weaker target and work his way up from there. After all, the European supermafia human rights social_demands/laws are the most exhaustive on planet Earth, so running some transparency journalism organization like WikiLeaks should be easier in Europe than it is in Australia and U.S. A thing that the Assange certainly failed to do was to learn the European history. Had he learned the European history, he might have discovered that in Europe there is always the 2 rule systems: the supermafia social_demands/\"law\" and the actual social rules that NEED TO BE ENFORCED. He totally forgot about, ignored, the enforcement part and took on a project that he was ILL-PREPARED for. \n\nI'm not saying that it is possible to get by without public confrontation of the powerful. By the powerful I mean various actors, not just supermafia/state actors. For example, the Tor network developers and developers of many P2P-systems in general certainly have to expect to be exposed, non-anonymous, at least the core of them, but the PERSISTENT work has to be done in small chunks that are within the means of the freedom-of-speech-and-pro-human-rights-fighters. As the saying goes: freedoms are lost bit-by-bit. The reverse is also true: \n\n    freedoms ARE GAINED bit-by-bit. \n\nThe issue is that not that many people have the persistence, calmness, rigor to think things trough thoroughly, patience to work on a huge goal without visible positive feedback on a long-term bases systematically, bit-by-bit. Just think of Your own co-workers, neighbors, friends: how many of those people have the human characteristics that enable them work, FOR YEARS on a project WITHOUT POSITIVE FEEDBACK and then be reserved, systematic, thorough, self-disciplined at that activity? The Assange was a bit like the Donald Trump in a sense that he enjoyed the stage, the publicity and as the nature of the WikiLeaks changed from giving presentations and interviews at fancy pubs to sitting in a room and being forgotten by the press, he must have fallen into deep depression, to the point that he failed to work with the materials that he leaked. He just dumped them indiscriminately, unlike before, where he actually organized a team to work through the materials, authenticate the sources, etc. He even snapped at the Amy Goodman(democracynow.org) at one of the interviews that she did with her, despite the fact that the Amy Goodman and her team has always supported the WikiLeaks effort and made a big effort to portray the WikiLeaks in a very positive light and also give ample show time to the WikiLeaks_project/Julian_Assange. That was sad to watch. That interview was taking place, when he was at the Ecuadorian embassy. The Amy Goodman's democracynow.org was probably one of the very few global news sites that took the effort to cover his stay at the embassy. So, I think that the Assange's heart was at the right place, but as of 2020 that man is a useless wreck, not somebody, who is able to run a WikiLeaks organization the way it should be run. Another problem with the Assange is that he clearly failed to make the WikiLeaks project self-supportive. Right now it seems that if the Assange steps out of the stage (death, vacation, time off to restore health, whatever), the WikiLeaks seems to stop existing. He should certainly be smart enough to understand, how attractive target he becomes like that, specially to the CIA and others and not because he cares about his life, but because he cares about his project, the WikiLeaks project.\n\nAll in all, I think that the WikiLeaks project is over. The biggest lessons learned from the Julian Assange, Bradley/Chelsea Manning and the Edward Snowden case is that in The West the actual freedom of press and freedom of speech DO NOT EXIST. None of the 3 men (Chelsea Manning considered himself to be a male during the leaks) probably wanted the world to give that kind of a lesson. All of the Edward Snowden revelations could be summarized with the phrase, \"If there is a technical weakness, the supermafiosi will take advantage of it.\", something that IT-students were taught at public universities all around the world long before the Edward Snowden had become a celebrity. The Bradley/Chelsea Manning leaks can be summarized with a phrase, \"In war zones the army does whatever it wants with  whomever it wants and it will be official, officially covered up by multiple ranks of high officials.\", which is something that is probably known even since the Napoleon times, although for me it was news that the U.S./western army did not consider it a mishap, but something that should be officially approved by not court-martialling the murderers. So there was new information in the Manning leaks. The biggest news about the Edward Snowden case was, how he got treated, not what he revealed. We would have never been able to know that without the Edward Snowden actually being the \"guinea pig\". I guess that kind of a \"revelation\" was not what he himself had in mind, when he leaked the materials. \n\nI find it kind of interesting, how far the American short-sightedness goes at the U.S. intelligence agencies. One could argue that the bigger the mess, the bigger the budget of the agencies, so it makes sense to create a mess, but wasn't the WW2 hard enough on the U.S. economy? If the U.S. and its advertised values like freedom of speech, freedom of press, loose their appeal around the world, and they WILL loose their appeal if the U.S. itself does not have those and the U.S. army officially accepts murdering of non-combatants, as proved by the Manning leaks, and torturing, then people can very much say that the local dictator or a communist party is actually better than \"the democracy\", because at least the dictator spends a considerable amount of its money on healthcare and education of the population. Education under a dictatorship of course means that some population groups are banned from higher education and those, who are allowed to enroll a university, are banned from studying subjects that show, how bad the dictatorship is in many respects, but the rest of the subjects can be at a very high quality, just like mathematics and technical fields like electronics and civil engineering were in the Soviet Union. The China with its lack of freedom of speech and pretty advanced technical capabilities and flexible semi-capitalist economy has caught the attention of the Washington bureaucratic elite, and yet with the repression of Julian Assange, the Manning, the Snowden, the U.S. has totally lost its capability to take the \"high road\" in that matter. The Donald Trump is quite a difficult character, but had the Hillary Clinton won the 2016. U.S. presidential elections, then the situation would be much worse. A narcissistic fool is far safer as a U.S. president than a slick, well polished, skillful, well experienced white collar crook.",
				"added": 1582667769
			},
			{
				"comment_id": 56,
				"body": "> [aspidochelone](#comment_357_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): If they kill him they claim the baggage of martyrdom without the deterrent effect of torture.\n\nI suspect that You might be right with this one. On the other hand, martyrs can be created by torturing people, so their choice probably depends on, who is their target audience for the \"public hanging\". What happened to the Edward Snowden already sent the message to the smarter bunch of the audience, so Assange might be \"reserved\" for the dumber part? \n\nIt is interesting to think that the Donald Trump can actually pardon Julian Assange, specially given that he is very well aware of him, at least was during his 2016 election campaign. It would also be a nice way to shove it to the Democrats, because the Democrats, specially the Hillary Clinton, wanted Assange to be tortured at the U.S. custody, which is why Assange worked against the Hillary Clinton by helping anybody, who opposed the Hillary Clinton, which by chance happened to be the Trump. ",
				"added": 1582925294
			}
		],
		"1581540627_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 53,
				"body": "So now the U.K. officially has the Orwell's \"Ministry of Truth\" that decides, what content is harmful.",
				"added": 1582671492
			},
			{
				"comment_id": 54,
				"body": "> [moor](#comment_393_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): has ever \"capitalism\", that is, free markets, private property, little to no regulation and/or government ever existed? if so when? how well did it work?\n\nYes, that has existed in about 1991, when Estonia departed from the Soviet Union. It worked very well, to the point that the year 2020 Estonia is not the dump that it was during the Soviet Union era. It was possible in the 90-ties because the state was so poor that THERE WAS NOT EVEN MONEY FOR THE POLICE. Russian mobsters roamed around, the owning of firearms became very popular, the business of private security companies flourished and sometimes tourists literally thought of an ordinary private security company escort convoy as some military escort. At first the Russian mobsters extortion policy worked, after all, there literally was no Police to stop them, but at some point people had enough and the Russian mobsters ended up in  a forest with their legs shot. That's all official history and just one story out of many.\n\nThe private security companies handled the crooks so there wasn't even that much of a need for a Police. Till this day, year 2020, it is legal for a private security company in Estonia to literally conduct an arrest and handcuff people, after which the arrested will be given over to the state Police. Unlike the U.K. Police, the year 2020 Estonian private security company operatives can carry guns, pistols, openly, and they often do. Some bigger year 2020 night clubs have special rooms for keeping arrested violent people till they are handled over to the state Police and that's all official/public. The 90-ties military escort like convoys with private security companies being the guardians were usually ordinary cargo transports of relatively ordinary, but valuable, goods, like computers, televisions, kitchen appliances, may be even furniture. Electronics was a lot more expensive in the 90-ties than it is today, specially at the former Soviet Union regions that have been cut off from the western trade for decades. \n\nI'm not sure, whether it would work in the U.S. or U.K., but in Estonia the scenario, where the Police ceases to exist and classical repression from some huge hierarchy does not exist, certainly DID NOT come with the Hollywood madness, where everybody robs everybody, gangs extort, etc. The Russian mobsters tried and they did not get too far. Yes, there were bombs and shootings, but the evolution did its job and the dumber ones lost their lives in that evolution pretty quickly. The system stabilized itself. The difference between the Southern ever-lasting wars and violent conflicts in the North is that in the North the killing is thorough and systematic, so once it ends, it actually ends either because everybody, who were targets, are dead or that the sides realize that they want to stay alive and back off, seek for peace with the other side. Historic records are from the WW1 and WW2 era, where after the end of one occupation and start of another occupation, the local collaborators of the previous occupation were executed by the locals that were repressed by the previous occupation. Add some political assassinations of the officials of the occupying party to the mix during the occupations, and that leads to a culture, where the smarter bunch understands very well that once the violent conflict starts, it is possible to be a target for years, until the other side finds a \"right\" opportunity to carry out the assassination properly WITHOUT GETTING CAUGHT. \n\nSo, a system without a supermafia/state is possible and it will be a mess at first, when the fools try the limits, but in practice the system stabilizes itself pretty quickly, the dumber ones die off pretty quickly and the ones, who survive, can actually have an excellent life without artificial, state-induced, monopolies. It's not a pretty world for slackers and dumb people, but it is a proper world for hardworking and smart people, who want to live without being a parasite and accept the idea that other people must be treated respectfully regardless of their current job/business. In that world having high education, even a doctoral degree, will not guarantee high income, but having good brains and skills that tend to correlate with higher education, certainly helps.\n\nAt least, that's the Estonian 90-ties history. That kind of an Anarchy is a tough world for SMART people and there really is no room/time for fooling around, so many people will hate it from the bottom of their heart, specially the bureaucratic types that would like to just work at some routine, mundane, job at some office from 9.00-17.00, and then think about \"work-family-balance\", but for entrepreneurial and hard-working smart people it is probably the best that there can be. Tough, but better than the alternatives.\n\n\nWhat regards to the American _crapitalism_ then it has more to do with people being lazy standing for their interests than the idea that merchants can hire others and set their prices freely. If a worker signs a really bad job contract in stead of seeking for a better contract from someone else than it's really the worker's fault and yes, there are those white collar crooks that will abuse such workers and that starts the downwards spiral for those workers, where at some point they even lack the money to conduct a proper job seek to get a better deal. Then the communist politicians, another set of vultures, step in and start with their statement that if they take over 50% (a tax rate in Estonia, Finland, Sweden, etc.) of that poor worker's salary (\"income tax\", \"social security tax\", etc.) and also about 30% of the employer's dividends, then they can offer \"social security\" and \"help\" that poor worker. Obviously the worker is not in a position to actually enforce its interests so that the \"social security\" would cover a kind of health-care services that actually are needed to solve the problem, but the dumb workers, who signed the bad contract at first place, do not think that much, so they believe the communists. At some point the communists themselves live lavishly from tax money and \"fair leaders\" and the worker still struggles to pay for the food, shelter, medical services, transport. In Estonia, the start in the 90-ties was excellent, but knowledge about the fact that there will be the white collar crooks, who will abuse the situation, was lacking, so by about 2017 the situation with some of those workers was so bad that an ordinary city monthly bus ticket would have cost the worker about 1/3 of its net salary, about 100€, so the communists, in various parties, decided that since the worker pays about 50% or more of its salary to the state anyway, it is monetarily more beneficial to pay that 100€ from tax money just to get the ~150€ tax money from that worker in stead of letting the worker quit its job and start protesting and demanding social_services and consuming Police_repression_workhours without paying any taxes at all. That's how the year 2020 capital of Estonia, the Tallinn, got its \"free public transportation\".\n\n\nIntroducing free public transport in Tallinn (Estonia)\nhttps://www.youtube.com/watch?v=avTNnYlSGVo\n\nThe joke is that although the ride can be \"free\", but if a person forgets to log its \"free\" ride with an RF-ID ticket card, the person can still get a 400€ fine for riding \"without a ticket\", which is greater than the whole month's net salary of some of the workers, the ones that get the officially accepted \"minimum wage\". I guess the minimum wage in 2020 was 480€/month, but before that it was about 200€/month. With those figures the Estonian government boasts that Estonia is a rich country, the 30% tax money from the dividends of the white collar crooks that pay their workers the minimum salary is pretty nicely sized, government top officials get about 10k€/month net salaries + travel compensation and other types of compensations and bonuses. The Finns have been smarter. There the abuse of workers has been handled by non-profit worker unions that actually stand for the dumber part of the workforce and protect them from the white collar crooks.\n\n\n\n",
				"added": 1582674373
			},
			{
				"comment_id": 55,
				"body": "> [moor](#comment_402_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): also you can guess that not a lot of people share this same idea of yours, that should be a warning to why it may not work...\n\nI never said that people with different ideologies must live together. Nor did I say that smartness is defined through financial wealth. Material wealth and financial wealth are 2 separate things. \n\nFor example, money as a computer-game-point-sum can be pretty worthless in terms of what it can buy materialistically, specially in war zones or just in a situation, where there aren't that many goods to go around, like was the case during the few last years of the Soviet Union. In Estonia even some not-that-rich people had literally a shoebox with Russian Rubles that they were not able to convert to the new Estonian local currency, the kroon, because the Estonian local currency was backed up by actual foreign currency and the Bank of Estonia fixed the Estonian currency to the German Deutschmark, meaning, no matter what happened at the exchange rate with other currencies, the exchange rate between the Estonian currency and the German Deutchmark stayed constant and to deliver on that promise, the Estonian central bank, the Bank of Estonia, needed to have foreign currency, the German Deuchmarks, which obviously were hard to get for a poor former Soviet Union occupied area like Estonia. Hence the amount of Rubles, what people were allowed to exchange for the new, Estonian, currency, was rationed per person and the Rubles that were saved, became worthless. After the currency exchange some people made fun of the situation by using the Rubles as a decorative element or even literally as a wall-paper replacement, because an actual wall-paper costs Estonian currency at the building supplies store, but the useless Rubles from the savings shoe-box are \"available for free\". So, it actually made financial sense to use the money notes of halve-life-savings in a role of a wall-paper, even if there were barely enough of them to cover just one wall of a single, relatively small, room.\n\nWhat regards to Your statement about happyness, then the antidepressants can make even severely injured and enslaved people happy. So happyness might not be the smart thing to yearn for. But the state of being SMARTLY CONTENT is certainly worth pursuing, with occasional rare dots of happyness that are like spices in food. The fools, who say that they are so happy while they suffer a lot due to a lack of some materialistic resource are just plain stupid. Buying oneself a 2. sports car or 2. castle that one does not even have time to use properly, is an example of a foolish act, where it really does not make sense to work so much for money. On the other hand, the people, who make such purchases do not really work that much to earn that money, so for them it's just a note at a list of personal property, something to talk about at  social events and parties. When I was referring to hard working and paying attention to the materialistic side, then I was assuming that the financial wealth is spent wisely, not just on 2. sports car or 2. castle. \n\nThe parasites, communists and the dumb workers that act as the goons of the communists, that want to rob the hard-working people of their honestly earned materialistic fruits, should be treated as enemy combatants and then the rest depends on, whether they want to choose a violent way to fight it out or some other way that does not involve bloodshed. It's up to them and just like plain mobsters and foreign armies, the troves of dumb workers that are being directed by some \"Lenin\", will get violent resistance. Fire with fire. Violence with violence. May be the dumb ones can also be party brainwashed with propaganda, id est the \"psychological operations\", \"strategic communication\", \"public relations\", whatever-phrase-that-the-propaganda-masters-come-up-next.\n\nThank You for reading this text.",
				"added": 1582823097
			}
		],
		"1581768780_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 57,
				"body": "> I bet they'll have more cases than China in a month ... not because I think China will have it under control.\n\nOh, they will, with mass executions. It's the Chinese Way. After all, the red color at communist flags symbolizes blood.",
				"added": 1582997429
			}
		],
		"1583204943_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 58,
				"body": "Evolution is tough. Not all people are meant to work together. On the other hand, in Europe the Swiss (\"the right\") and the Norwegians (\"the left\") are able to trade with each other. The key is to avoid a situation, where everybody has to live by the same rules. It would be stupid to expect hardworking scientific types to live by the same rules that weekly-drunk-lets-do-drugs-and-streetrace type of factory workers and other classical laborers live. It's not even about, who has more education or money. Bloomberg and Trump and many Hollywood stars may own a private jet, but they are certainly not like the rich Wall-Street nerds like the mathematician that actually got Trump election campaign financially and otherwise on the track at the 2016. elections. Trump NEEDED the \"Cambridge Analytica\" and a Hollywood star as he is, he would have NEVER been able do do business with those nerdy mathematicians without the help of that Wall-Street nerd-mathematician, who wanted to get him elected.\n\nThat is to say, it's not just about left-right, rich-poor, scientist-laborer, but a key thing that pays also an important role is the PSYCHOLOGICAL NATURE OF PEOPLE. Not all people have the capability to calmly, rationally, think and then actually stick to their plan in a systematic manner and in stead of straying from the plan, actually update the plan systematically, in a calm manner, and then again rigorously stick to the plan. And then there are the ones, who will abuse anybody, whom they can abuse. The emotional fools that can not calmly analyse and stick to their self-assembled plan are an easy victim.  How many times have You fell to be a victim of an advertisement? Works, right?\n\nhttps://www.wired.com/2016/09/googles-clever-plan-stop-aspiring-isis-recruits/",
				"added": 1583207261
			}
		],
		"1583203227_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 59,
				"body": "Borgs: resistance is futile.\nhttps://www.youtube.com/watch?v=rtEaR1JU-ps\n\n> [edgelordofdecent](#comment_429_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): I believe this is a shitpost\nNo, it is not a shitpost, but great humor. As a matter of fact the ideology here is not even unique. The idea that the God is one hell of a nasty surveillance system, a lot like the Santa Clause with its helpers, and computers can take over that  role, the role of total surveillance, has been described at a year 2000 computer game, the DeusEX. Here's a clip with conversation subtitles:\nhttps://youtu.be/gl8ku1mgImo?t=12347",
				"added": 1583309704
			}
		],
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 60,
				"body": "Very simple. The ones, who do not want to participate, for whatever reason, can be killed, if they are a \"problem\", or they can be ignored. The rest of the idiots will slavishly make sure that the leadership of the Communist Party has materialistically wealthy life. The Cuban and Soviet Union and Chinese leadership had/has a far higher living standard than the other people. Some of the intellectual elite, who do not mind bowing to the Communist Party, can be bought by hiring them at universities and giving them a lot of \"grant money\", so they are also happy and do the weapons development. From military point of view it was the Soviet Union that won the cold war by developing technology that allows to put heavy nuclear bombs on orbit, rendering the NORAD and other Hollywood stuff of the United States of America useless. As it turns out, at the end of the Cod War the U.S. still could not produce the kind of effective rocket engines that were developed by the Soviets. \n\nHowever, the catch is that IDEOLOGY LIMITS TECHNOLOGY DEVELOPMENT AND ADOPTION. For example, The Internet, the classical WWW, could have also originated from the Soviet Union\n\nhttps://www.youtube.com/watch?v=sioFuw-leAU\n\nbut due to censorship computers would have NEVER replaced typewriters and any kind of non-controlled communication equipment, where people can just send letters easily and quickly from European side of the Soviet Union to Eastern side of the Soviet Union and even have possibly anonymous forums is just out of the question. Software like TeX could have NEVER been developed in the Soviet union due to the censorship issues, even if everyone had more powerful computers at home than the U.S. and Brits had. The same with the open WWW. Nowadays the open WWW is also censored, but it is a fact that crypted connections and ZeroNet style P2P-connections are possible at the Western IPv4 and IPv6 network, so as long as Tor connections are not blocked like in China, the Western IPv4 and IPv6 network can be considered relatively free even in year 2020.  Another example, where culture defines, what kind of technology is even possible, is the porn industry. Plain porn movies with everything visible are still censored in 2020 Japan, South-Korea, China, obviously the Arab countries, generally Isalmic countries. A site like the PornHub would never be able to come to existence in Japan, China. The same with banking: the reason, why European banks depend on American banks so much is that the European supermafiosi/governments are so mad about robbing/taxing that they just stifle the banksters so much that in order to operate they have to carry out many deals outside of Europe, in New York. It's kind of ironic, how the European supermafiosi want autonomy from the Washington supermafia, and yet they stifle the local banksters so much that they introduce a heavy dependence on the Washington supermafia. And that is the mechanism, how the Washington declares the \"banking rules\" to Europe: Washington tells the New York banksters and those declare/enforce the rules on European banksters.  It's not that they Washington banksters have better technology, it's just culture that declares, which technology can thrive and which will be inhibited.\n\nIt's not all roses in the U.S. either. The very same way, how the American culture allows the American banking industry to be the top-dog of banking on the planet Earth, the American patent system pretty much places the America to a serious disadvantage in relative to Europe and in some narrow context also China and Russia. Just like the Europeans depend on American banks, the American tech industry actually depends, heavily, on European development services. At some point the semiconductor industry was such that the semiconductor foundries, the micrhchip factories, that were able to mass-produce the fastest chips on planet Earth were mostly owned by Americans, but the top-notch equipment that actually created the microchips, were all developed either in Europe or in Japan, because the American vendors just were not able to deliver that top-of-the-line production equipment. So, the top CPU-s of Intel and AMD were imported from America, but produced with European and Japanese equipment. A classical case of European technology sold world-wide by Americans include the AVR microcontroller, the ARM CPU. From open source software point of view BSD is American, UNIX/POSIX is American, but from origin point of view the Linux and MINIX are European. Eclipse IDE is American, probably, but the NetBeans is European. C/C++ and GCC are American. I'm not sure, but at least from funding point of view the LLVM is also American. Yet the FPGA compiler project, the IceStorm, is Austrian/European. KiCad is European, from CERN. The Arpanet is American, but the WWW is European, from CERN, and then taken over by Americans, the W3C, World Wide Web Consortium, the IETF, etc. \n\nSo the Communists may pay their obedient intellectuals at Communist universities whatever they want, but there are technologies that the Communist ideology just will not allow to flourish. On the other hand, if the Chinese manufacturers paid the U.S. patent trolls the patent fees for the various memory card related patents, then the world would probably not have a common memory card interface standard and the memory cards would be much more expensive than they are in 2020. So the Communist culture of denying property ownership, including the repression abstraction called \"intellectual property\", can give advantages of distributing and copying those technologies that are not censored. \n\nIt's kind of interesting to think that China tries to censor communication and yet allows to produce such a high capacity information medium like a memory card and all of that without making the memory card to spy on people. For example, in the North Korea the official supermafia Linux distribution has \"antivirus software\" that treats documents with politically censored content as malware by deleting them automatically.\n\n\"Florian Grunow, Niklaus Schiess: Lifting the Fog on Red Star OS\"\nhttps://www.youtube.com/watch?v=8LGDM9exlZw\n\nSo, who wants communism? Mainly the communists and people with limited intellectual capability. But there are a lot of those people, so democracy leads to communism. On the other hand communism is not the opposite of vulture capitalism. Quite the contrary, communism is exactly what is taking place at American megacorporations, where fools, employees, donate a lot of their work to the elite, the \"investors\" and live from pay-check to pay-check. The classical corporate \"resource planning\" is actually a lot like the planned economy of a communist state and the Enterprise Resource Planning software (ERP-software) is actually a communist's wet dream. A true opposite to the vulture-capitalism/communism is freelancing and the middle-ground between freelancing and vulture-capitalism/communism is the formation of cooperations, worker-owned companies, where shares are distributed equally according to the work-hours worked for the company. It's the cooperations that the \"marxist\" Richard Wolff actually advocates at his various presentations/talks.\n\n\"Richard Wolff: \"Democracy at Work: A Cure for Capitalism\" | Talks at Google\"\nhttps://www.youtube.com/watch?v=ynbgMKclWWc\n\n\"Richard Wolff on the Mondragon cooperatives\"\nhttps://www.youtube.com/watch?v=mKbukSeZ29o\n\nBut of course, the mainstream wants people to believe the narrative that the vulture-capitalism is The Capitalism and that the de facto Communism that the megacorporations actually implement is \"somewhere else\", \"somewhere, where there are no nice private megacorporations\", \"somewhere at a very bad place far-far away from the place, where You live\". Obviously the openly communists do not mind that narrative of the vulture-capitalists, because it's nice to have a distinguishing sales argument that sets them apart from their main competitors that actually are very much like the openly communists themselves are. So the openly communists compensate the negative message with the \"positive lie\" that the communists \"care for the people\". Just look at the living standards of the Chinese Communist Party members and then look at the medical care or the work safety enforcement that the Chinese coal miners get. Or pick Cuban leadership and the \"common Cuban\", or Soviet leadership and the \"common Soviet citizen\". A lot of \"care\" goes into it, doesn't it? And do not forget to compare the living standards of American megacorporation leadership and the \"common employee\", who struggles with modest daily bills, including basic healthcare related bills. But the fools, who love the Communism despite getting the short end of the Communist stick are not the intellectuals, who would become freelancers. A Chinese coal miner as a freelancer? A typical factory assembly line worker as a Freelancer? (More likely than the coal miner, but not really.) A fast-food restaurant worker as a freelancer, developing a product and handling the sales and supermafia bureaucracy? May be, if they are young people, who work there by accident, but not in practice. Just like wolves stay alive, because ultimately they still get fed at some other creature's expense, the megacorporate leaders, communists, get a wealthy life as long as the work of idiots has materialistic value. Once the robots take over all the jobs that the \"proletariat\" is able to do, the communists will try to rob the freelancers and cooperatives by taxing robots, real estate or what not, like it is in France, and if that fails, the communists will starve, the idiots, the former \"proletariat\", will be kept alive by some mercy non-profit (and due to the increased level of automation it can be done with relatively small amount of money, cheaply, so a small amount of \"animal shelter\" donation campaigns will suffice), and that's the end of Communism/vulture-capitalism as we know it. \n\nYou have the option to SPEED UP THAT PROCESS by automating the idiots away. Expect a big mess at first, taxation of robots, etc. but the kingdoms fell with the sound of snapping guillotines at the French Revolution (which wasn't a single event but a decades long process) and the current Communist/vulture-capitalist order will not go away without its struggle. Just like democracy fell back to dictatorships in the form of Hitler and Stalin, it is expected that the \"idiot democracy free\" community of freelancers and cooperatives, basically, a community of capitalist anarchy, will also sometimes fall back to its predecessor state, some \"representative democracy\", but just like the dictator Hitler wasn't a final step for Germany, after some bloodshed the democracy came back, the capitalist anarchy can also be restored by getting rid of the \"idiot representative democracy\".\n\nThank You for reading my post.",
				"added": 1583435110
			},
			{
				"comment_id": 62,
				"body": "> [kec](#comment_2_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN): communism and, specifically socialism, is not at all what you think that they are, and have been brainwashed, inculcated and otherwise taught to believe that they are.\n\nI do not need to be brainwahsed about communism. I have lived in the communist state, the Soviet Union. It was awful. The former soviet occupied areas did not switch from communism to capitalism because anybody forced them to. We did it, because we saw that the communist version did not work. And, boy, how big was our surprise, when we got to see the Western Side of the Iron Curtain and noticed that many of the true, old, westerners were IDIOTS, who think that acceptance of BAD DEALS is a natural think to do in capitalistic society and on top of that the old westerners themselves really DID NOT KNOW CAPITALISM! It seems that the dumber part of the population, the ones that need a boss, church, state to tell them, what to do, is as dumb anywhere on the planet Earth.\n\nThe rest of the contemplation is, should the hard-working small business owners pay for the well being of the tax-collectors and the elite of the various parties and the slobs, who go to vote for any of such parties in stead of changing the system, or should the hardworking small business owners let the tax-man and the party elite starve. People, who think that they can get government grants, usually professors at some universities, or be at the top of the food chain politically, tend to love communism, as do the idiots, who are actually being fed on. The fact that the Castro lived a much more affluent and freer life than his \"Cuban Comrades\" just does not occur to the dumb ones dreaming of communism. \n\nI suggest You move to Cuba. If that's not good enough, try Vietnam. What a hell are You doing here, on ZeroNet, if the Chinese censorship is not a problem for You? After all, the main purpose of the Chinese censorship is to keep the dumb masses at China blind from the Chinese Communist party human rights violations and that is done to keep the Chinese Communist Party in power. So, if You love communism, then You have to accept _the_whole_package_, not cherrypick space technology and propagandistic comradship.\n\nWhat regards to the \"food insecure children\" and the living from paycheck to paycheck, then that has nothing to do with capitalism or communism. It has to do with the fact that regardless of what the political system is, some part of the population consists of IDIOTS, who loose their money at some casino, do drugs or drink or even if they are sober, then they accept bad deals by giving in to the ones, who offer the bad deals. The only way, how the children of such people can get properly fed and cured is that other, RATIONAL, people take care of those children and there is absolutely no fundamental reason, why those other rational people can not be people from some non-profits in stead of some \"government agency\". There is no need to be a _Christian_ for running such non-profits and as a matter of fact there is not even a need for such non-profits, if people care more about their neighbours. The comradship? If that does not exist right now, then it will not exist after the communists have forbidden the hard working people from owning the fruits of their labor. The people will be fundamentally the same. The same amount of % of the population will be idiots and slobs, the same % of children will need to be taken care of by someone other than their parents, etc. Except that with Communism there is an extra amount of repression by the Communist Party and that entails censorship and You may study the collapse of the Soviet Union to know more about those matters. Have fun!",
				"added": 1583991858
			},
			{
				"comment_id": 63,
				"body": "> [kec](#comment_2_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN): Rather than expounding that private, all powerful corporations retain control over the manufacturing capacity of a nation, communism in contrast, puts forth that the community - the people, or a social group - retain control of the manufacturing capacity. \n\nWas that the case in the Soviet Union? I do not think so and I've lived in the Soviet Union. You may want to think about the human interactions that led to such situation. You can NOT choose, cherrypick humans for Your perfect Communist Society. You have to work with the humans that exist and with the humans that exist You have to look at a community as a system of humans that interact with each other. You may change the humans over some longer time period by making them duller through censorship or propaganda, but You can not choose them. Even if You can shoot/execute the ones You do not like, the initial batch to start with is still something that You can not choose. Try to answer the question, what went wrong in the Soviet Union according to Your understanding? Why the Soviet Union collapsed according to Your understanding? If the answer is that people lacked comradship and were too greedy, then try to answer, why that is and how could You use the same greedy people with lacking comradship to form Your perfect Communist society?",
				"added": 1583993295
			}
		],
		"1583690992_1LzhWqcrjmmkQjaKuse2XQWuQiKSpFZ7Kv": [
			{
				"comment_id": 61,
				"body": "> [xplosive](#comment_29_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): Just a random English comment passing by. I do not understand a single word.\n\nNeither do I, but it seems to be NOT Russian. My Russian is really poor, but I usually recognize at least some Russian words. It is some Slavic language other than Russian.",
				"added": 1583706098
			}
		],
		"1583980969_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 64,
				"body": "I think that the \"single\" versus \"in relationship\" classification is too primitive. For me erotic relationships are for fun, both, for sex, and for intellectual enjoyment. And between those pleasurable interactions I do not want to have anything to do with anybody, because I want to concentrate on my work. So, a true friend with benefits for years is a very nice option, provided that the rules for biological safety are in place. No need to be single. No need to be \"in relationship\". Just joy!\n\nWhen the right time comes, the friend with benefits can also deliver children, if that's what we agree on and plan to do. When that happens, temporarily, for about 5 years I guess, there is a need to move together, but after the child becomes about 6 years old, it can be back to the friend-with-benefits regime with her/him, just that the children then have rooms at 2 houses/apartments, one at dads place, another at mother's place and occasionally the daddy and mommy will still fuck and talk philosophy :-D\n\nhttps://www.youtube.com/watch?v=SHAQlFq6TFg",
				"added": 1583994310
			},
			{
				"comment_id": 65,
				"body": "> [xplosive](#comment_44_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): So a woman once broke my heart. No other woman will do that again.\n> I am happy that now I am single. And I am independent.\n\nNah, the first love will be remembered indeed, but no worries, Your heart can be broken many times :-D \n\nBy the way, in a way it is much better if others break Your heart than You inadvertently break someone else's heart. I broke someone's heart without wanting to break her heart and I feel guilty about it till this day, more than 10 years after the event. I hope that she has forgotten me, but may be not, because she was really into me. I just took her as a nice friend, someone to talk to and to dance with. Usually I do not catch any positive attention, but at another situation, with another lady, I felt bad, when one waiter/bar-maid almost fell in love with me from the first sight and turned clumsy while smiling(trying to hold back a smile) and could not get her eyes off of me, when she was serving me behind a counter of one cafeteria/diner. She was good-looking, but, I'm a difficult guy so, I've got my own complexities, specially in terms of not turning enough attention to other people's feelings. Oh well, happens.",
				"added": 1583996100
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 66,
				"body": "Correct. IT-industry it is, but it takes a special \"weirdo\" to find ZeroNet, Freenet, I2P, ... interesting. Most IT-people could not care a thing about privacy matters or the fact that computers by their very nature are an extension of human brain, that search engines can apply censorship by just hiding some relevant information like it is the case in China, etc. After all, it was some IT-person, who wrote the computer virus that attacked hospitals, who wrote the software that carried out the mass-surveillance, who wrote the software that the Saudi Arabia, Iran, North-Korea, China, etc. use for seeking dissidents and applying censorship.\n\nIt's a lot like with doctors: it was the doctors, who developed the George W. Bush era torture techniques and conducted the various lethal or otherwise injuring experiments on prisoners. Some doctors torture for money and fame, some try to cure and some are just in-different, as long as they get paid. The IT-industry is no different: it's not just the skills that matter, but also personal beliefs, personal philosophy.\n\nIt is interesting, how book-burning is considered something bad, but when it comes to the digital version of book-burning, then the Western population really does not mind at all. I point out that the problem is not that people consider computers irrelevant and prefer paper-books. People understand very well that computers are the new book-shelves, and yet they do not mind digital censorship. Usually the more social a person is, the more the person wants to run with the herd and the more easily that person can be manipulated to carry out activities that are harmful to that very person or to its loved ones. Add to that some lack of knowledge about IT-systems and the easier the pray.\n\nIt seems to me that it's not just Africa that needs IT-tech-support-aid nowadays. If You think, how big a IT-tech-support person's hourly wage is, then many people just can not afford the IT-tech-support that they need for setting up a ZeroNet node or teaching them the basics of Linux or software development or other basic skills so that they can individually study more. That's the reason, why I sometimes offer totally free tech support to elderly people at my neighbourhood and try to help others to use the various IT-facilities that exist nowadays. It makes at least my neighbourhood at this   World a better place. People won't suffer so much and they save a lot of time that way. They can spend that saved time on more productive work or just rest to be at a better shape at that more productive work. I am selfish in a way that I refuse to help lazy people and I refuse to do other people's work that others have the skill to do, but are too lazy to do. Sometimes I offer my services at a very small price to make my services affordable to some hardworking person, who just can not afford the full price, but I refuse to work for those high-paying clients, whom I consider to be either slackers or bastards. \n\n> [bubbleghost](#comment_1_1GbAD8KRx8aHKRE4PZs8pT4xPVLUfrGMRc): Lots of foreigners now in IT. We need the good ol' days back.\n\nWhat would those old days look like? The way I distinguish myself from Indian cheap labor is quality. My definition of quality is not what everybody considers appropriate. For example, I have noticed that Americans do NOT care about reliability and Japanese, do care about reliability, but only, if the solution is very old and tested out during some very long time period. Consequently it is impossible to sell something novel to the Japanese, because anything novel is by definition NEW, NOT OLD, and it is impossible to sell anything reliable to the impatient Americans, because if the reliability is not important, then why should they pay for the laborious proper solution, if they can just pick some cheap and crappy service from India or God-knows-where? Besides, the crappier the job, the less time it takes to do it and Americans tend to prefer fast delivery to proper deliverables. On the other hand, there is one niche, where quality seems to be always important regardless of cultural background: science, research. Scientists, including the ones at the private laboratories, do not tolerate software that calculates things wrongly. Those intelligent people are also a joy to serve. They are demanding, but their high demands also keeps my competition at bay, so good for me! Add the fact that scientists can burn through a lot of money and some of them are always almost broke, and I even have a price advantage, because the big software development companies charge much more than I do.\n\nAnother interesting modern niche that seems to be emerging, is the various embedded devices, which all need some kind of desktop/mobile/server software nowadays. A company that does a bad job at that will bear heavy monetary  losses, so quality will be a nice barrier against the cheap crap-writers from India. Those devices also need firmware, the software that goes into the microcontrollers. Printers, watches, toys, wall-clocks, microwave ovens, even plain electric drills contain firmware nowadays. An electric drill operates by using a large field transistor that operates a Pulse-With-Modulation mode, meaning, it switches on and off very rapidly, at least thousands of times per second, and the drill speed is determined by the percentage that the transistor is in the on-state. It is firmware, software running in a microcontroller, that measures the drill trigger position and then switches the field-transistor on and off according to the  drill trigger position. That is to say, with the emergence of the various IoT and with the lowering of the electronics prices in general, the need for firmware developers should increase, because almost everything has some firmware in it. You might not believe it, but even ordinary USB-memory-sticks and memory-cards have a microcontroller in them that implements wear-leveling, error correction, etc. Often times the firmware for that microcontroller has been loaded to the chip at the factory or the chip might have it designed in as a mask level ROM(read-only-memory). There are a lot of opportunities, but those opportunities are not for amateurs, for some average Joe that learned to program a year before applying for the job. Obviously most of those opportunities are NOT at the big corporate world, but for freelancers. Social people, who yearn for corporate life, will not enjoy those jobs, unless they rent a desk at some co-working space. \n But, for those, who want to work hard as freelancers, opportunities do exist.\n\nHere's a test case: pick some small store at Your local area and see, if You can deliver a proper, functioning, e-shop with payment integration and merchant tutoring to that shop for about 500$ within 2 days. With 20 working days in a single month that's 20*250$=5000$/month, which isn't much, but is a very good start.  Before talking/writing to the store owner, test Your skills by creating an online shop for Yourself. Use Your own e-shop for charging Your customers. A few components to consider:\n\nhttps://www.2checkout.com/\nhttps://stripe.com/\nhttps://fastspring.com/\n",
				"added": 1584771606
			},
			{
				"comment_id": 69,
				"body": "> [happyhippo](#comment_15_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly): This is a beautiful thought, thanks for sharing!\n\nThank You for the compliment :-)\nI wish that the topic just weren't so grim....",
				"added": 1584787655
			},
			{
				"comment_id": 70,
				"body": "> [kynoxxx](#comment_2_1JQT9rnHDwo6i2dCySE9dEZPNpLLYXKmW7): I host ZN on a private and separate network with long-range WiFi antenna connecting to my neighborhood who has weak or no normal internet connection at all. ZN is the only platform that suits this kind of scenario. Well, it is free of charge to my neighborhood.\n\nA few links that might interest You.\n\nLocal document library:\nhttps://outernet.is/\nhttps://www.widernet.org/\n\n\nShoddier than ZeroNet, but easier for non-technical end-users:\nhttps://beakerbrowser.com/\n\ne-mail replacement for situations, where connections are not that reliable:\nhttps://bitmessage.org/\n\nIf nothing else works, then there are still the pre-WWW-era technologies, Usenet, FidoNet, Gopher:\nhttps://nzbget.net/\nhttps://en.wikipedia.org/wiki/Gopher_(protocol)\nhttp://ftsc.org/\nhttps://www.fidonet.org/\n\nA really good introduction to mesh-networks and routing:\nhttps://www.youtube.com/watch?v=Kl5sMPXs3cI\n\nMANET routing protocol:\nhttps://github.com/ProjectSPAN\n\nOLSR routing protocol:\nhttp://www.olsr.org/\nhttp://wirelessafrica.meraka.org.za/wiki/images/a/a6/Olsr-thomas-elektra.pdf\nhttp://wirelessafrica.meraka.org.za/wiki/images/a/ad/Linkup-meraka-short.pdf\n\n\nVarious mesh-networking protocol related projects:\nhttp://www.smesh.org/\nhttp://www.wing-project.org/\nhttps://www.open-mesh.org/\nhttp://www.bmx6.net/\nhttps://libremesh.org/\nhttps://commotionwireless.net/\nhttp://servalproject.org/\n\n\nHardware projects:\nhttp://netsukuku.freaknet.org/\n\nGerman social project:\nhttps://freifunk.net/en/\n\nNAS-storage creation Linux distro:\nhttps://www.openmediavault.org/\n\nSkype replacement for voice chat:\nhttps://tox.chat/\n\nYouTube alternative:\nhttps://joinpeertube.org/\n\nSome sort of shoddy P2P-FTP:\nhttps://www.pp.io/\n\nJust some things to experiment with to find out, whether they work at Your situation:\nhttps://ricochet.im/\nhttps://briarproject.org/\nhttps://status.im/\nhttps://silence.im/\nhttps://coy.im/\nhttps://sandstorm.io/\n\nSomething to consider mirroring on the ZeroNet one day:\nhttps://theanarchistlibrary.org/category/topic/\n\n\nDocumentation for non-technical users:\nhttps://www.bypasscensorship.org/\nhttps://www.privacytools.io/\n\nPurely text based data transfer (WWW, Usenet, etc.) can be used for transferring binary files and images by converting the binaries to text and back. There are standard-tools for that at the package collections of major Linux distributions.\nhttps://en.wikipedia.org/wiki/Base64\n\nI hope that at least something here is useful to You :-)",
				"added": 1584791310
			},
			{
				"comment_id": 71,
				"body": "> [zeromed](#comment_7_1Fct94e4PRpnXyWzFi679369yUL6aKrsej): a place where everyone can talk freely and where cooperation exist instead competition\n\nI like the competition of ideas. I also like the competition of different open source projects, as long as the competition is based on technical merits, not lawyers or money or marketing. There's also the issue that different people have different requirements, so from that point of view seemingly competing projects do not necessarily compete. In my view that holds for both, open source projects, and classical businesses that might not even be IT-businesses. I also prefer not to pay monopoly prices for my commodities and I do not mind having competition myself, because then I have someone to look up to and learn from.",
				"added": 1584791673
			}
		],
		"1584324810_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 67,
				"body": "Just imagine, what the picture would look like, if the CV-19 were as infectious as it is now, but in stead of causing some mild flu and killing some elders and HIV-positives it would act like the HIV does? \n\nWriting about jokes, would You still ask job seekers to send You their CV? Ask Your sales guys to use Viral Marketing!",
				"added": 1584776849
			}
		],
		"1584769181_13W2cW8ZhgjC9KJXzvPXyCkafHsiegKvyu": [
			{
				"comment_id": 68,
				"body": "I do not believe the conspiracy part, but it puzzles me that professional merchants do not make sure that their sales area is pristine. There is no need to be rich to be clean and China does have a sewage system and human-consumable clean water. I wonder, will some of the merchants be executed for the deaths that the CV-19 caused within the Chinese population or the reduction of tax revenue that the CV-19 outbreak caused to the Beijing government?",
				"added": 1584777252
			}
		],
		"1584939910_1LyiVyfhYN2tEhwMJRCcxEFyBekXbqcMk7": [
			{
				"comment_id": 72,
				"body": "Wising death to people, who are annoying, but loving towards You is something that You must consult with Your psychotherapist about. Imagine, how annoying You yourself were to Your parents, when You were a small kid. And yet they did not wish You death. Instead they made a great effort to help You, to cure You, to offer tasty food, may be even icecream, to You. And You wish them death simply because they are annoying and mistaken about politics. \n\nIf You are so heartless, then please consult Your psychotherapist so that Your psychotherapist helps You to learn to cope with Your condition. You won't become any more sensitive or loving, but You may avoid prison by avoiding committing murders, because often times empathy is what stops people in rage and if You psychiatrically lack that emotion at a critical moment, then there is nothing stopping You from killing someone in rage, unless You have obtained the skills to control Yourself and to recognize certain situations. Psychotherapy is basically an individual study, where the psychotherapist is in a role of a personal teacher and there will be homework, exercises between psychotherapy sessions, that a patient needs to do. Like with school: the teacher won't give skills, capabilities. It is the pupil/student that need to do the learning itself. The teacher/lecturer is only for feedback, guidance, consultation. There are different forms of psychotherapy and not everything is suitable for every condition. You may try cognitive psychotherapy for a start, but a proper psychiatrist can help You to choose the type of therapy that might work with You. As with medicine, there's a chance that You have to experiment with different types of psychotherapy, because not all versions suit to all persons.\n\nKeep in mind that many murders are committed while being drunk or under influence of drugs and this is, where the emotions are the only think keeping people from harming others. If You lack the emotions that keep You from trouble, You have to compensate them with learned skills.",
				"added": 1584977332
			}
		],
		"1584935552_1LyiVyfhYN2tEhwMJRCcxEFyBekXbqcMk7": [
			{
				"comment_id": 73,
				"body": "> [6ty](#comment_3_1LyiVyfhYN2tEhwMJRCcxEFyBekXbqcMk7): I don't care if zuckerberg listeners to me i got nothing to hide.\n\nForward all of Your private conversations and drug dealing details to the FSB and FBI. You've got nothing to hide? Are You sure that You have paid all taxes full? No issues with drunk driving, speeding limits? Parking? How about telling Your ex-es, how You cheated on them? What about telling Your parents, where and how You masturbated, when You were a teenager? After all, You've got nothing to hide. Please tell Your childhood crush-es about Your former feelings and how You jerked off by thinking about them. You've got nothing to hide. Or may be tell some of Your training mates or friends or colleagues, how You jerked off to fantasies about them? By the way, You may also post Your credit card number and related passwords/codes to this forum, because You have got nothing to hide. Hour home address and photo would also be a nice start, with instructions, where to find the spare key to Your house/apartment and details about, when You are at home or at work/school. If You do not find that anything is missing from Your house/apartment, then You may want to keep an eye on different porn sites, because there might be some videos about You that You have not uploaded there Yourself. After all, You've got nothing to hide. When You visit Saudi Arabia or Iran or other Islamic regions, make sure that You have proof about sex with people that You have not married and the best option would be sex images with people that are of the same gender as You are. You've got nothing to hide, even if it will literally cost You Your life at those Islamic regions. Want to try vacation in Egypt, where homosexual relations are considered a crime? The following article links to a nice video, where the star guest is the Edward Snowden.\n\nA Conversation on Privacy:\nhttps://theintercept.com/a-conversation-about-privacy/",
				"added": 1584979730
			}
		],
		"1584818151_1LnUZ9Csee6oXiuNsZXXWvtBTeT3qHFT4y": [
			{
				"comment_id": 74,
				"body": "http://127.0.0.1:43110/newsriver.bit/\n\nThe best option for an alternative news feed is to create one for Yourself from blogs of different academics. The tool for the job is an RSS-reader, which visits all of the blogs in Your personal news feed and checks, whether there are any new posts. My personal news feed consists of about 300 different blogs, some of which have only a few postings per year. That way You can pick the sources You trust and totally bypass all middle-men, including journalists. That was the core idea behind RSS-readers, when the Aaron Swartz originally came up with the idea of a feed-reader, an RSS-reader.\n\nhttps://www.rollingstone.com/culture/culture-news/the-brilliant-life-and-tragic-death-of-aaron-swartz-177191/\n\nhttps://quiterss.org/\n\nThat's the best way to get news independently, but, of course, as with ZeroNet, it takes a bit of time to set up, because You have to cherry-pick the blogs that You trust. I suggest that You try to pick bloggers with different occupations and from from different regions of the world to get a better overview. You may also add ZeroNet blogs to the feed. The URL of a ZeroNet blog RSS feed would be the http://127.0.0.<and so forth>.",
				"added": 1584980573
			}
		],
		"1584987289_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 75,
				"body": "> [broo49664](#comment_25_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3): Well I found that: https://yacy.net/\n\nThe YaCy is a great idea, but my tests over years show that its implementation is such that it keeps a lot of data in RAM and once the RAM runs out, it crashes. It's designed for huge servers with 10-s of GiB of RAM to spare, not laptops or desktop computers. Basically, THE IMPLEMENTATION OF THE YACY IS CRAP AND SEEMS TO HAVE BEEN CRAP FROM THE VERY START! But the ideas there are good, just that good ideas without a proper implementation are almost worthless. Also, when someone thinks of implementing their own P2P search engine, then please take to account the fact that there will be malicious nodes on the P2P-network and not that many people are willing to spend money on hosting  other people's data.\n\n\"The Economics of Censorship Resistance\"\nhttps://www.cl.cam.ac.uk/~rja14/Papers/redblue.pdf\n\nOn top of that HDD/SSD traffic is a bottle-neck for all P2P-systems, meaning, the end user experience suffers unless the P2P-applications like Freenet and ZeroNet and so forth are running on a dedicated machine, not the machine that the end user uses as a workstation. Not that many people are willing to keep their old computers running to host P2P-applications and those, who do, can not run a sloppily Frankenstein-ed beast like the YaCy on those machines.",
				"added": 1585011887
			}
		],
		"1585126326_1HaT5L4XJXR57nzthKTuYUZ1jprSRgK9eU": [
			{
				"comment_id": 76,
				"body": "> [styromaniac](#comment_1962_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): In your nearest prison.\n\nMay be the user named \"fuck10yo\" is also about 10 years old and 10 year old boys would love to meet a girl that is as interested in sex as the \"lolita\" in that movie. Do not jump to conclusions. When I was that young, I sure would have loved it, but the issue with 10 year old girls is that they're not mentally that mature. Isn't that a pity that at an age, when one has sex on one's mind a lot more than at older age, the biology just makes it an impossible thing to get. May be at age 14, 15, 16 there's a better chance, because then people have already have some brains and the smarter bunch of the 16-year-olds might even be able to form fuck-pairs. \n\nMy recommendation is that if You're 16 or 17 year old boy and some 20-something girl wants to have sex with You, then GO FOR IT! Just ask for a doctor's certificate first to make sure that the girl does not have any sexually transmittable diseases (You have to provide her with Your certificate, those tests do not cost that much and specialized clinics, often times near dermatology related medical institutions, offer those tests), ask that Your \"first time\" takes place during that time interval of her biology, when she can not get pregnant and USE CONDOMS. And then just do her doggy style or what's exactly Your preference :-D \n\nThe oral versions are not that good and do not require the period related planning, so I suggest You use that nice chance for something vaginal. Also, make sure that You agree with her that it is SEX ONLY, NOT A LOVE AFFAIR. The term to use is \"friends with benefits\". \n\nIf You are not a teenage boy or a teenage girl, just a pedophile older than 20, then I suggest You either get Yourself a sex doll, some sex toys or consult with Your psychotherapist. One's own fun MUST NOT come at the expense of others. It's not always possible to deliver orgasms to another person while having one's attention on one's own feelings, but that's not a problem, because it can be compensated with the reversing of roles, so that at some other time one works only on the other person to get the other person an orgasm and it takes some learning how to deliver an orgasm to another person anyway, because even people that have the same gender have different turn-ons and turn-offs and fantasies, but injuring someone's mental health is certainly off limits.",
				"added": 1585143287
			}
		],
		"1585207808_1KtNz7B6oMUBcPKCTZuSTbphZ2s7RTYCk1": [
			{
				"comment_id": 77,
				"body": "Tor is just an overlay network, a protocol that depends on the IPv4/IPv6. If there is no IPv4 and no IPv6 network in place, Tor will become useless. In theory after the sea cables are cut between continents, satellite phones and satellite phone based IPv4 connections might still work, but given the price of such connections it is unlikely that someone is willing to pay for it just to let some guy stream YouTube music over it. Operators of various chat systems like the \nhttps://telegram.org/\nor some hactivists running\nhttps://bitmessage.org/\nmight use their own custom software to convey only some of the traffic of those chat applications over their own financed satellite links and may be at some point some messages might be transmitted from the Western side to extra censored areas by using the\nhttps://othernet.is/\nand then there is also the option of radio amateur relay stations, but it is a very low-volume traffic and it requires special software at the service operator side. All-in-all, forget Tor in those scenarios, but You may build Your own link, at Your own expense, to transfer some small-olume ZeroNet or \nhttps://beakerbrowser.com/\npages from one region to another and help to keep information spreading that way. The ultra-rich in China are probably using western satellite telephones and their modems for daily business operations anyway, as do probably Russian oligarchs and the various Arab business people. If You're working on some university cube-sat project, then You might want to create Your own relay satellite that picks data up at one side of the globe and dispatches it at the other side of the globe. It would make an awesome ZeroNet zite distribution link. The Chinese and Russians and alike have the capability to shoot down satellites, but they try to do it with a laser, so You may want to design some mirrors to protect the side that points to Earth. The other side is for solar panels. Make sure that the mirrors disperse the beam so that You won't inadvertently hit a passenger plane or someone on the ground with the high intensity reflected beam. The dispersing of the beam makes Your satellite easily visible, but it's visible anyway due to the downlink signal. May be a huge \"satellite dish\" can be 2 in one: a dispersing mirror that protects the satellite and a reflector for the directed antenna. The frequencies of the shooting laser and the radio waves differ and that difference might be leveraged. ",
				"added": 1585213648
			}
		],
		"1584618126_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 78,
				"body": "> [consus](#comment_23_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3):  The western \"ladies first\" thing needs to be rethought.\n\nIn samurai era Japan the \"ladies first\" rule was used with a purpose of getting an early warning about enemy samurais in the room. A lady enters the room first, screams, when seeing enemies or just dies, if the enemies chop the lady with a sword first, but that gives the men the small time delay that is needed for drawing their own swords. The same with the Japanese politeness gesture of serving food to the guests first. The idea that if the food is poisoned with something fast-acting, then the guests are in the role of an early warning by having the symptoms, dying.",
				"added": 1585215018
			},
			{
				"comment_id": 79,
				"body": "> [mg0](#comment_247_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Maybe censoring and punishing it as if child pornography is meant to reduce the chances of interspecies transmission of diseases and avoid the origination of new viable hybrids.\n\nOh, the Catholics would LOVE that meme in the context of the current corona virus :-D\n\n> [mg0](#comment_248_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Well, transparency and honesty is a privilege for only the poorest and most honorable of people. Don't expect it in politicians, law makers or doctors as either it isn't as convenient for them or they can't do against it since they are part of a greater system that pretty much loathes transparency.\n\nNot all doctors are the same. Neither are all politicians, specially the ones that don't get elected.",
				"added": 1585215169
			}
		],
		"1584337202_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 80,
				"body": "You may try the \"t2\", newer version, of the \nhttps://sourceforge.net/projects/mmmv-repackaging-projects-t1/files/repackaging_projects/repackaged_ZeroNet/\n\nYou may register a loop-back IP-address, something like 127.0.0.<foo> and use Linux settings to make sure that only one of the Linux users is able to access that IP-address.",
				"added": 1585286393
			}
		],
		"1586655304_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 81,
				"body": ">  impact of science on society is that humans are quickly being dehumanized\n\nIf what dogs do is dog-ain and what humans do is humane, then killing, torture, mass murder, wars are a vary humane phenomena.",
				"added": 1586706557
			}
		],
		"1586627246_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 82,
				"body": "You may want to get some references to various projects and papers from \n\nhttps://www.softf1.com/cgi-bin/tree1/technology/flaws/silktorrent.bash/wiki?name=List+of+Similar+Projects\n\nhttps://www.softf1.com/cgi-bin/tree1/technology/flaws/silktorrent.bash/wiki?name=Attic+001+for+Holding+Various+Files\n\nor just clone the ~40GiB sized Fossil repository by using the instructions at\n\nhttps://www.softf1.com/cgi-bin/tree1/technology/flaws/silktorrent.bash/wiki?name=User+Guide",
				"added": 1586706943
			}
		]
	},
	"comment_vote": {
		"1543_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"650_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"188_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"333_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"360_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"50_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"7_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"1554_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"184_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1593_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"187_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"313_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"380_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"78_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"386_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1614_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"103_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"26_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": 1,
		"9_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi": 1,
		"1811_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"70_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"347_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"16_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi": 1,
		"2_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"80_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1_1BtohSFtgv5SNQ4i6Gu7ox5cYttW8Jkoxk": 1,
		"74_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"343_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"14_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi": 1,
		"83_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"348_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"7_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": 1,
		"55_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"1_1DMbY7iz2fHswMG2BofjDZiwpDoecrf9SM": 1,
		"353_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"30_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"30_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"404_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"357_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"36_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": 1,
		"679_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"977_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"980_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"493_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"9_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"12_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"440_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": 1,
		"23_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"441_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"84_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1
	}
}