{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565341946,
			"title": "Zeronet will not open the side-bar || Internal error: AttributeError: 'Config' object has no attribute 'autodownload_bigfile_size_limit'",
			"body": "When I try to open the side-bar with the config and seed info and such, it spams me with this error:\n\nInternal error: AttributeError: 'Config' object has no attribute 'autodownload_bigfile_size_limit'\nUiWebsocket.py line 85 > UiWebsocket.py line 232 > Sidebar/SidebarPlugin.py line 536 > Sidebar/SidebarPlugin.py line 324\n\nOn multiple fresh installs of zeronet from the zeronet clearnet page. Ideas?",
			"added": 1565341945
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1546815090_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "I'm having the same error running Artix on a fresh install. \n\nMy tor hidden service will not run, at boot, or manually. It just throws permissions errors. \n/var/lib/tor only contains two files (state, lock) and one empty folder (keys)\nAnd tor is not creating an auth cookie (torrc is set to place it in /var/lib/tor)\n\nWhen I try to load the tor service manually with \"sudo rc-service tor start\" \"rc-service tor start\" \"sudo /etc/init.d/tor start\" or \"/etc/init.d/tor start\" I get the following error, or a variant thereof:\n * rc-service: Permission denied\nthe tor file in init.d is owned by root\n\nThe tor-browser workaround does not work for me, either. Nor can I access zeronet from the tor-browser. \n\nI configured according to the zeronet guide, which works flawlessly on my other systems using different distros. I've also tried the arch repo version of tor, the aur version of tor, and the version from tor's website. \n\nNo errors in any of my system logs. Zeronet logs didn't have anything useful, either. \n\nIdeas?",
				"added": 1565258457
			}
		],
		"1565341946_1PK8e7ccdA28Xi8mDbmZd6SLQSgZaxDAzg": [
			{
				"comment_id": 2,
				"body": "Oh also, it does this in every browser",
				"added": 1565342065
			},
			{
				"comment_id": 3,
				"body": "> [testuserpleaseig](#comment_4_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU): afaik when you open the side bar for the first time there is a download for the \"globe\" maybe just manual download the GeoLite2-City.mmdb file?\n\nMind checking your zeronet folder and letting me know where I should put the file?",
				"added": 1565343661
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 4,
				"body": "I can actually see less posts on 08chan tonight, than I could last night on the same install for some reason.\n\nI can't even open the O menu because I get this error:\n\nInternal error: AttributeError: 'Config' object has no attribute 'autodownload_bigfile_size_limit'\nUiWebsocket.py line 85 > UiWebsocket.py line 232 > Sidebar/SidebarPlugin.py line 536 > Sidebar/SidebarPlugin.py line 324\n\nSo I can't post because I'm stuck on a random ID.",
				"added": 1565349925
			},
			{
				"comment_id": 11,
				"body": "> [undisclosed](#comment_1_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): saythe\n\nI think you may be right. I tried some other Zeronet pages, and this only happens to me on 08chan. I can change identities and open the menu on every other site.",
				"added": 1565396405
			},
			{
				"comment_id": 12,
				"body": "So until that somehow gets fixed, I won't be able to post on 08chan since I'm stuck on a randomly gen ID.",
				"added": 1565396465
			},
			{
				"comment_id": 13,
				"body": "I am stuck on a random ID with 08chan. If I try to open the O menu to change my ID, I get the following error:\n\n Internal error: AttributeError: 'Config' object has no attribute 'autodownload_bigfile_size_limit'\nUiWebsocket.py line 85 > UiWebsocket.py line 232 > Sidebar/SidebarPlugin.py line 536 > Sidebar/SidebarPlugin.py line 324\n\nOn multiple installs.\nThe menu works on every other zeronet page. \nCould someone who CAN post echo this post into the sticky for me so the BO sees it? I know there are others with this same problem and none of us can post the bug.",
				"added": 1565405484
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 5,
				"body": "> [testuserpleaseig](#comment_5_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU): drugs are good\n\ndrugs are cringe",
				"added": 1565350216
			},
			{
				"comment_id": 6,
				"body": ">What do you suggest should be done about mixed countries like the US? We're mostly \"white\" but the original people were native americans. There's a lot of mexicans/hispanics here though as well. Should we restore the US back to the native americans?> [kaffie](#comment_933_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): First my questions, then my comments/questions on the topics you listed. [...]\n\nHispanics have their own continent to go back to, and it is conveniently right next door. \n\nAs for Native Americans, I empathize with them because they did lose their countries to conquest, and they have nowhere else to go. Its a complicated one to deal with, because the Native Americans were not one big monolithic culture like many think, and many tribes hold strong connections to certain regions for historical reasons, so its not like you could give them a single contiguous region of America and call it good. My best answer for this is that I do not think it would be impossible to come up with an amicable solution for this and I would like them to be part of this conversation. \n\nHowever the premise that they were the original people here is a widely held misconception originating from colonists in the 15th/16th century. However today we know that the North American Mound Builders had settled America at least 4,000 years before the earliest estimations of the beginnings of the Clovis migration. Its not like they didn't have society and culture either, they were at least about as developed as the Aztecs, millenia earlier. Additionally, all of the oldest skeletons and mummies discovered in the Americas have cranial structures far closer to Chinese/European features than Native American. Ötzi/Kennewick man is controversial and I won't get into that, but the Tulum wet mummies, Chimalhuacán Man, Tlatilco Man, and all the others, are well established to not have any relation with Native Americans, predate them by millennia, and still occupied the Americas millenia after the Native Americans arrived. This does not fit the definition of indigenous in any way.  \n\nSo I reject the entire premise of your question. They're simply were the most recent people to conquer North America when colonists arrived and did the same thing to the Native Americans, that the Natives did to the people before them. But it sucks that they have nowhere else to go, so I would like to work out a fair solution between both peoples. This one is complex and it would not be fair for me as a European, to decide their fate without their input on it. \n\nAdditionally, I am also empathetic to Blacks who have slave ancestors and their immediate families, because they were brought here against their will by Jews and Europeans. The majority of Blacks in America do not have any slave ancestors, or connection to this land longer than a few decades. For those who do, I would propose giving them a contiguous region of North America to settle and govern as they best see fit. The rest can go do the same back home.\n\nNational Socialist foreign policy boils down to, \"you rule you, I rule me.\" I'm willing to make concessions and help undo mistakes of the past, so long as it is done in a way that helps these peoples establish their own autonomy outside of my country. The American social experiment is exactly as described, and a failed one at that. Yes quality of life will lower for the first generation of Blacks going back to Africa however in the long run I genuinely believe they will be happier in control of their own fate. Latin America wouldn't be nearly as bad of a place to be if the United States had a government that wasn't interested in constantly meddling in their affairs, and if people unhappy about its current state stuck around to make change rather than pack their bags and migrate to the US. \n\n>For those who have ended up in mixed cultures who lost our history and culture, what do you suggest moving forward? Make a melting pot \"white\" culture in the US? Or return to countries of origin and attempt to assimilate? Break off and make our own nation? How do we restore the multiple white cultures?\n\nMixed race individuals lacking cultural identity in the United States are unfortunately a relic of broken society and immigration policy set in place against the will of the American people. It is legitimately sad, and I empathize with the individuals in this case. I would worry less about individuals who exist today, and more about what can be done to create a healthier society less conducive to miscegenation so that less people are born into this unfortunate circumstance. Being rootless and without ties to culture is a bad place to be, and I would go as far as to say that plenty of 100% white Americans are in a similar situation mentally and spiritually.",
				"added": 1565356375
			},
			{
				"comment_id": 7,
				"body": "> [aspidochelone](#comment_26_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): It certainly did not seem implausible that IQ could have diverged between the populations ... but where are the genes? [...]\n\nYou do not need to know exactly what genes and enzymes are at play, nor their mechanisms, in order to prove that a trait is a genetic expression. More often than not in modern science, we don't know the exact mechanism behind an expression. This logic only ever seems to come up when people discuss race and IQ. Apply it to any non politically controversial genetic expression or trait without a known mechanism and you'll understand why.",
				"added": 1565356829
			},
			{
				"comment_id": 8,
				"body": "I don't think the race and IQ thing even matters that much though. In a hypothetical world where we invert the idea of \"racial supremacy\" and say the average African is two standard deviations smarter than the average European, they still aren't me and I'm still not them.",
				"added": 1565357388
			},
			{
				"comment_id": 9,
				"body": "> [aspidochelone](#comment_28_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): @saythenword: Here's https://omim.org/ .  Find me some genetic conditions (with multiple live patients to study) that haven't been mapped to any chromosome. [...]\n\nSure yeah, tell me the exact and complete genetic mechanism behind cyclical vomiting syndrome or sarcoidosis. The entire argument you make is, \"The scientific community has not yet discovered something, or for sociopolitical reasons, neglected to research certain things. Therefore it does not exist.\" Which is flawed logic. \n\nFor a brief thought experiment on this, pick any genetic condition or phenotypically expressed trait that we DO know the entire complete mechanism behind today. Now lets pretend that we are having this discussion in 1960. Try to prove its existence to me without contemporary research. \n\n>You say Africans aren't you and aren't them. Are Europeans? If you're an American, are Americans? Why? A surgeon could cut the link between the left and right hemispheres of your brain and one wouldn't know what the other is doing -- would you be you?\n\n>Are Europeans?\n\nYes.\n\n> Are Americans?\n\nNo. \n\nBoth of these are subjective questions that typically boil down to, where exactly do you decide to draw the line on a genetic cluster. But I also factor culture and history in as well. Finns for example might be a bit on the outside of the grouping of other European genetic clusters, but I would subjectively define them as white for these reasons. You're just making appeals to purity. \n\n> A surgeon could cut the link between the left and right hemispheres of your brain and one wouldn't know what the other is doing -- would you be you?\n\nYes. \n\n>Truth is, they are you and you are them. We may not understand it, but consciousness is some kind of fundamental, universal phenomenon. It is an Atman that sees through billions of eyes and works with billions of separate memories and moves billions of different hands. Whether we have physical nerves that bind one part to another in one head, or bonds of family and love, or bonds of perceived shared culture and color, these things are secondary. Consciousness is a single force in its essence.\n\nCephalopods are likely conscious as well. Are you a cuttlefish?",
				"added": 1565384187
			},
			{
				"comment_id": 10,
				"body": "Ultimately though, pointing to fringe cases in regards to the existence of race or the definition of white means little to the greater point that races do exist and have differences. I would go as far as to say that the line often drawn in biology to define separate species, is much thinner than the outwardly observable differences in races to the average lay person, entirely leaving IQ out of the question. There are humans walking around and living today who are almost entirely Denisovan, yet we will define entirely separate species of outwardly identical birds because of differences in their diet. The \"race does not exist\" or \"what is white\" arguments have been nothing more than a tool to bludgeon whites with, with no validity behind them, since the discovery of Neanderthal, and later Denisovan DNA in modern humans. \n\nNational Socialist Germany banned the use of IQ testing, with good reason. I could care less about \"superiority\" or the endless pissing match of \"what race is better?\" I am white, and I love my own people and put them ahead of out-groups. And I support other races in their endeavors to do the same for themselves. There isn't much more to it.",
				"added": 1565391039
			}
		]
	},
	"comment_vote": {}
}