{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1617906794,
			"title": "Who are seeding files on galactichan?",
			"body": "Some days ago due to a server error i turned off my seedbox but most of my files keep many seeds online and can be downloaded entirely and easily. Also some other files created by other users are online without my seedbox support (while other not).  I want to understand how you are contributing to the site! 游땕 Who are seeding files on galactichan? And What you are seeding? Anyone Is running a seedbox other than me?",
			"added": 1617906793
		},
		{
			"topic_id": 1618137037,
			"title": "Keep zeronet clean!",
			"body": "Today i banned the First pedo board created on galactichan by using my blocklist.  Its obvious that Someone want to sabotate also mi zite. users, at contrary of millchan, here are safe anyway due to the disabled auto download of any content on the site, but we should keep clean the homepage also from  the links to this unwanted content to avoid any problem (for users that decide to trust blocklist...here on galactichan you are the only responsible for What you are sharing). I recomment you to subscribe to my blocklist and to kaffee spamlist and Moab. Also Ask anyone here to report me or to the others blocklist's owners any illegal user. Also i Ask blocklist owners to monitor galactichan and make ban where needed",
			"added": 1618137035
		}
	],
	"topic_vote": {},
	"next_comment_id": 23,
	"comment": {
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 1,
				"body": "> [xianc78](#comment_73_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): This is an imageboard, not a video sharing site.\n\nMy Plan was to create a filesharing site with no censorship and a community incorporated that help the file seeding. This should allow to create P2P communities that cannot be shut down. Other objective for me was to spread my research work outside Academy that refuse it and to promote copyleft artists. The millchan engine in my opinion Is the best on zeronet because less bugged than ifs and with a Very flexible moderation system. If you want you can change the aspect of the site forking it",
				"added": 1617739486
			},
			{
				"comment_id": 2,
				"body": "More info here\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N",
				"added": 1617739665
			},
			{
				"comment_id": 22,
				"body": "> [warfare](#comment_63_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv): I see that you are a strong defender of galacticchan... I would really be happy to be able to share videos, however, I don't want to seed other people videos, just mine, and that those who seed mine, again can chose to just seed mine... it's all this bulk sharing that I am very wary of...\n\nYou can seed What you want. Galactichan bis Very flexible. You can seed/ban entire users, posts, boards or also single files. To seed single files Just click on \"seed\" option displayed in every file and you Will seed only that file (or Just play audio and video files you want). I created galactichan...because of this i defend It 游때",
				"added": 1619169797
			}
		],
		"1617682154_1JWZXEvbBFR9yXCndM4R9FdV9ZJPVXniT7": [
			{
				"comment_id": 3,
				"body": "Your music Is offline...i cant seed It due to copyright...but i suggest you to play the last songs that in uploading on the board cc music. They are the same gendres of fallout radios and are composer by Kevin MacLeod, One of the best and more famous cc musicians.  Im not seeding these last mp3s with my seedbox for some days but in sure these songs Will have Peers 24h/24 anyway 游땕",
				"added": 1617889463
			},
			{
				"comment_id": 4,
				"body": "> [soundtracks](#comment_1_1JWZXEvbBFR9yXCndM4R9FdV9ZJPVXniT7): my music is now online with 5 or more peers per file...but i can't play your mp3! :D copyright always win! :D\n\nDont speak too soon! 游땕游때 I Will put my files online again now! 游땕 Probably there are Sync problems as Always! 游때 I Hope  that geekless Will solve this problem with his zeronet fork in future 游땕 Im sure that also my files Will have dozen Peers! 游때",
				"added": 1617906472
			},
			{
				"comment_id": 10,
				"body": "> [captain404](#comment_36_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): flac dont work, but it s kind of overkill some good old mp3 always work and everywhere\n\nI dont enabled FLAC streaming because P2P streaming use low bandwidth and FLAC can overload the network (look at my compressed vids...) If you want you can upload FLAC in a zip file or fork the zite",
				"added": 1617941258
			}
		],
		"1617906794_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": [
			{
				"comment_id": 5,
				"body": "> [houtje](#comment_14_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): dunno; newfag hereI turned on seeding but... how do you change the folder (drive) where zeronet stores data?\n\nSimple. Copy your zeronet folder in another location",
				"added": 1617910000
			},
			{
				"comment_id": 6,
				"body": "> [certy](#comment_44_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif): there is a config file... maybe start to play there :). [...]\n\nShould not. What errore you recieve? File format?",
				"added": 1617910033
			},
			{
				"comment_id": 7,
				"body": "> [certy](#comment_44_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif): there is a config file... maybe start to play there :). [...]\n\nTry to use zip format. Should work",
				"added": 1617915345
			},
			{
				"comment_id": 8,
				"body": "> [houtje](#comment_15_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): so galactichan is the way to go? I was looking around on 08chan... is there much difference beside galactichan only loading images you choose?\n\nAlways spoiler. Dont download anything in auto.(to avoid any legal problem) Increased max filesize. More file formats",
				"added": 1617916066
			},
			{
				"comment_id": 9,
				"body": "> [houtje](#comment_17_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): to avoid auto download, you never increase the max file size?\n\nNo. I tried to increase max filesize as an indipendent feature 游때 i dont know if worked",
				"added": 1617941084
			}
		],
		"1618137037_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": [
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_3062_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It was posted by an account Anonymous if it was even an account at all. You sure I can block that user?\n\nYes. Amy user on galactichan are identified by an unique id. Look at my blocklist. Any user have @galactichan suffix and a Key id",
				"added": 1618144351
			},
			{
				"comment_id": 12,
				"body": "http://127.0.0.1:43110/16soWyYc1kTobaevbN25FJjWL2qf9PWvFG/\n\nLook at First entry under users\n\nIf you ban any user on galactichan you Will find the id in your locale blocklist. In that case i mute the user from the board men칯 in home Page. Just Copy It in your blocklist",
				"added": 1618145313
			},
			{
				"comment_id": 13,
				"body": "> [houtje](#comment_48_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): yeah this is the rumour going around everywhere, especially on 4chan. It makes sense though; imagine thousands of people start flooding into this place... they will never ever be able to stop it. There is no company to coerce to block their customer from using their hosting services. There is no site owner to pay off. There are no janitors nor moderators. It's all about self-moderation and self-responsibility. I can't get over how genius this is.\n\nIs Very difficult to shut down my site because There Is no server, no Money involved and the private Key was destroyed. For moderation...strenght Is numbers! If anyone here create a public blocklist we Will have hundreds of new mods! 游때",
				"added": 1618211033
			},
			{
				"comment_id": 14,
				"body": "> [ssdifnskdjfnsdjk](#comment_1023_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i have not understood this saying by @zeroseed5\"if anyone here create a public blocklist we Will have hundreds of new mods! \"(i know what blocklist sites are), but these are managed by single person, unless maybe the priv. key is shared manually to other people.\n\nBlocklists can be manager also by more than One (anyone that have the private Key). You can also manager the site yourself locally banning Who you want...you Will not risk nothing because you dont download any illegal content without your permission (at contrary of millchan with its previews)",
				"added": 1618229306
			},
			{
				"comment_id": 15,
				"body": "> [houtje](#comment_50_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): A porn blocklist would be cool too - I think literally 90% of the data on this network is porn.Is there a zite where users can inform the blocklist owner of other malicious content and users?  [...]\n\nThere Is a porn blocklist somewere in the zerowiki. Im only worried about  illegal things.",
				"added": 1618314739
			},
			{
				"comment_id": 16,
				"body": "> [zeroseed5](#comment_15_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg): There Is a porn blocklist somewere in the zerowiki. Im only worried about  illegal things.\n\nTi report any malicios user use zerotalk",
				"added": 1618315290
			}
		],
		"1618583185_1P7A6cCSYV4EdGzGfKT64SLp2FGevvmgZ9": [
			{
				"comment_id": 17,
				"body": "Use Galactichan. Zeromusic for me Is broken\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/",
				"added": 1618585558
			},
			{
				"comment_id": 18,
				"body": "> [febriansasi](#comment_7_1P7A6cCSYV4EdGzGfKT64SLp2FGevvmgZ9): How about ZeroLSTN ? http://127.0.0.1:43110/ZeroLSTN.bit\n\nNever work for me. File are not seeded",
				"added": 1618588644
			},
			{
				"comment_id": 19,
				"body": "> [nohidie](#comment_26_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf): What I don't understand is why not use the torrent protocol? What is wrong with it? It works.\n\nFor 3 reasons\n\n1) my objective Is to create a meld between  the P2P community and the P2P network itself, to prevent the dead share of torrents in case the P2P community site Will be destroyed (this happened for example to tntvillage, the biggest italian torrent community)\n\n2) zeronet allow to distribuite files easily also using tor.\n\n3) i want to use my site to promote indipendent artist and creators as we want during the First 2000's. An interesting side effect of piracy was the emerging of many new artists thanks to internet in a meritocratic system. I want to recreate this",
				"added": 1618690075
			},
			{
				"comment_id": 20,
				"body": "> [slfsrvingpltcn](#comment_12_1B7Rs1nGkNUzS2ccFdn34ANbxS2KVb2mTE): but why don't you use simply torrent magnet link to link the files, otherwise if it's distributed you always risk to lose low interests files... and in a sense isn't it digital darwinism? the problem with unfiltred or batch seeding of file, specially if uncensored is that the pedo/fbi can insert what ever they want. [...]\n\nIf you want magnet links on zeronet you can use zerotorrent. Galactichan have 2 advantages on torrents:\n\n1) you can auto seed files and users. This help to keep files online also without a seedbox (most files on the site are almost Always online)\n\n2) tor allow Easy anonymous P2P\n\nFor illegal files the site dont download them automatically. You are the only responsible of What you are sharing (similar to emule search that can find illegal files...but you are legit until you download them) Also users and indexes can be blocked easily. The site Is safe thanks to This",
				"added": 1618776048
			}
		],
		"1618959746_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 21,
				"body": "You are retards! You can use also zeronet thanks to these techs! Why dont leave to dont be hypocritical?",
				"added": 1619081514
			}
		]
	},
	"comment_vote": {}
}