{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "В России берут под контроль шифрованный интернет-трафик",
			"body": "В России берут под контроль шифрованный интернет-трафик с  01.09.16\nГосударство находится на грани нарушения конституционного права граждан на тайну связи\n\nВ рабочую группу вошли представители всех силовых ведомств, Минэкономразвития, Минкомсвязи и отраслевые эксперты из Российской ассоциации электронных коммуникаций (РАЭК). Эти специалисты должны подготовить свои рекомендации по регулированию шифрованного трафика в интернете и представить свои рекомендации Совбезу до 1 июля 2016 года.\n\nПо оценке Роскомнадзора, доля шифрованного трафика в России в 2015 году составила порядка 15%, а в 2016-м может превысить 20% (По данным «Ростелекома», доля шифрованного трафика в его сети составляет около 50%). Это угрожает возможностям государства по эффективному контролю коммуникаций в Сети.\n\nОсобое беспокойство у регуляторов вызывает end-to-end шифрование мессенджеров, которые к тому же отказываются ставить на своих серверах оборудование типа СОРМ и сотрудничать с ФСБ. «Мессенджеры работают на той же коммерческой \"поляне\", что и традиционные операторы связи. Но они абсолютно \"пиратским\" способом \"отъедают\" у них аудиторию. Можно назвать это недобросовестной конкуренцией. Никто не говорит о чтении переписки граждан в мессенджерах, но для них должны быть выработаны правила существования в России», — говорил в феврале Александр Жаров.\n\nКроме того, рабочая группа «прорабатывает вопрос» работы с анонимайзерами и Tor. «Речь идёт о шифрованном трафике, роль которого нарастает, о сжатии трафика, как легальном, которое применяется в браузерах и других программах, [так и нелегальном] в иных самодельных способах обхода блокировок: прокси-серверах, анонимайзерах и т.д.», — сказал Жаров. \nОкончание стати\nисточник https://geektimes.ru/post/274584/\n\n",
			"added": 1461412145
		},
		{
			"topic_id": 2,
			"title": "Поисковик",
			"body": "Надеюсь многие сами туда занесут свои сайты))\nhttp://127.0.0.1:43110/zerosearch.bit",
			"added": 1461414537
		},
		{
			"topic_id": 3,
			"title": "Митингт против путина",
			"body": "В вашем городе был митинг?\n80% что был. Однако этого не показали по телику, а толпу почти сразу же пытались разогнать.",
			"added": 1490976197
		},
		{
			"topic_id": 4,
			"title": "Нарвался на статью о биткоинте в России",
			"body": "Вот старая статья о запрете биткоина в Росси \nhttps://rublacklist.net/9833/\nМеня поразил этот текст\n     \"....О Центральном банке Российской Федерации» официальной денежной единицей (валютой) Российской Федерации является рубль. Введение на территории России других денежных средств и выпуск денежных суррогатов запрещается....\" \n    То есть доллар в России можно и другие валюты можно а биткоин нельзя?? \nНу как же... эту валюту они не могут контролировать, значит что? \n   Правильно избавимся от нее и объявим ее в не закона.  А если просмотреть курс валют?\n0.01 bitcoin (BTC) равняется 631.70 российский рубль (RUB) (на текущую дату)\nНичего удивительного что они так недовольны",
			"added": 1491325352
		}
	],
	"topic_vote": {
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1
	},
	"next_comment_id": 6,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "+1",
				"added": 1490818503
			}
		],
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 2,
				"body": "> [unit875309](#comment_6_1NookiGyirahMX3VKqwaFiouHhy7X3g4DE): Да, был. Да, не показали. Да, цензура. Хочешь поговорить об этом? ИМХО, цензура вполне приемлема для людей, так чего возмущаться?\n\nНаши черти не хуже американских  миллиардеров. Зажрались и в наглую обдирают народ.\nДалеко ходить не надо:\n2 или 3 года назад ввели бумагу на подтверждение собственности  (недвижимое имущество), однако в начале это бумажка стоила ... 0р. Теперь эту же бумажку нужно в обязательном порядке  обменять на новую + заплатить за нее всего-то 2000 р.\nВот так и деньги из воздуха делают...",
				"added": 1491157017
			},
			{
				"comment_id": 3,
				"body": "> [avoiddowntime](#comment_32_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): Где это? Что это? Ссылка есть?\nВот статья. Я просто сам собственник поэту меня коснулось. \nТеперь чтобы лишить вас собственности достаточно будет удалить пару строк из реестра :D \nВот же п*доры  \nhttps://ria.ru/society/20160708/1461682564.html",
				"added": 1491229718
			},
			{
				"comment_id": 4,
				"body": "> [avoiddowntime](#comment_33_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE): \"Какие митинги? Какой Медведев? Какая коррупция? У нас тут людей в метро взрывают! Вы что?? Вы враг народа!\" Удобно...\n\nОга у нас мир и порядок)",
				"added": 1491230032
			}
		],
		"4_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 5,
				"body": "Ну про отмывание в битконте прям глаза раскрыли \nhttp://forklog.com/za-majning-bitkoinov-v-rossii-nakazaniya-ne-budet-minfin/\nтакое чуство что это в долларах не делают :D",
				"added": 1491325963
			}
		]
	},
	"comment_vote": {
		"53_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"33_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE": 1,
		"9_1NookiGyirahMX3VKqwaFiouHhy7X3g4DE": 1
	}
}