{
	"next_post_id": 71,
	"next_comment_id": 26,
	"next_follow_id": 21,
	"avatar": "jpg",
	"user_name": "Wang Hisaohigh",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "A Marxist inside.\n\n[My Zeronet Blog](http://127.0.0.1:43110/15CTUyQvz1qT4dqjWT2Wmd4XbV5hesrMtL/)",
	"post": [
		{
			"post_id": 1590530440,
			"body": "我在某WeChat群組裡提到杭州要將監控碼做成日常狀態，感嘆這玩意可能影響工作。有人跳出來說「數位列寧主義」，並推薦端的文章。敢問數位監管與列寧主義有什麼關係，不要把所有發財的勾當都放到猶太人頭上，畢竟斯諾登還在流亡。污名文革、列寧、斯大林、毛澤東是這個時代的陰溝老鼠們的共同哀歌了。",
			"date_added": 1590530433
		},
		{
			"post_id": 1590598056,
			"body": "如何查看自己在hub中的配额？我还是决定回到moonhub了。",
			"date_added": 1590597995
		},
		{
			"post_id": 1590598707,
			"body": "我真的不懂有些人為什麼要樂此不疲地在微信發一些敏感詞句與敏感圖片，這種作法無異於把生殖器放到案板上去喊別人來喊？所有呢，如果被切了生殖器，就不要喊疼喔。",
			"date_added": 1590598687
		},
		{
			"post_id": 1590598997,
			"body": "前舊，我在zerome上更新訴尖椒部落勞動爭議的維權動態，不少zeronet網友給我打氣，我非常感謝。不過由於zerome配額已滿，無法更新最新動態。後來，被我瞎折騰，導致此前的數據丟失，現在已申請增加了配額。跟大夥通報一下仲裁結果，仲裁委裁定尖椒部落係非法解僱，我已經拿到經濟賠償金，謝謝大家。",
			"date_added": 1590598976
		},
		{
			"post_id": 1590599088,
			"body": "希望大家可以幫我的我的博客 http://127.0.0.1:43110/15CTUyQvz1qT4dqjWT2Wmd4XbV5hesrMtL/ 做種，我一定會努力寫作。",
			"date_added": 1590599066
		},
		{
			"post_id": 1590599368,
			"body": "這麼多年過去了，zeronet還是一如既往的荒涼，時間好像從未流逝。",
			"date_added": 1590599345
		},
		{
			"post_id": 1590599668,
			"body": "像Mastodon這種偽去中心的網路服務，不就是相當於做了一個sns版的Email協議嘛，但如果Twitter和微博不加入這種協議，這無異於手淫Twitter吧。",
			"date_added": 1590599644
		},
		{
			"post_id": 1590617134,
			"body": "hugo可以搭建zeronet站点吗？求教。",
			"date_added": 1590617109
		},
		{
			"post_id": 1590652756,
			"body": "zeronet在dockerHub上居然没有一个可以跑起来的arm64 arch镜像，唉。",
			"date_added": 1590652730
		},
		{
			"post_id": 1590685535,
			"body": "折騰了這麼長時間，我終於成功在N1上部署了zeronet docker。",
			"date_added": 1590685508
		},
		{
			"post_id": 1591286366,
			"body": "是日六四紀念，我的心情是複雜的。我們身處一個大時代，資本主義秩序面臨著前所未有的變化，但許多人卻永恆地停留在歷史中。慾往何去，恐怕是每一個從那個時代走過來的人要急需回答的。但不管怎樣，我永遠與勞工在一起，我是一個馬克思主義者。",
			"date_added": 1591286338
		},
		{
			"post_id": 1591321105,
			"body": "呃，我的微信被永久限制使用。",
			"date_added": 1591321076
		},
		{
			"post_id": 1591454957,
			"body": "互聯網死了，我們唯有復活它。萬維網理應是用戶與用戶的互聯，而不應是用戶通過電信運營商連接IT資本寡頭的服務器。IT資本寡頭援引服務條款，肆意中止用戶使用，就算新羅馬法第一修正案也無權禁止。",
			"date_added": 1591454927
		},
		{
			"post_id": 1610766926,
			"body": "上個月某天，我正在搬磚，線外急忙忙趕過來說，讓我趕緊跟他去預約「禮品」，這是最後的預約時間了。現在就跟他去樓下拿手機預約，幾分鐘就可以搞定。另外一個線外幫我頂崗，我成功預約了「新春大禮品」。這是F廠工會在國曆新年派給工人的「福利」，只有「正式工」有，派遣工沒有。這是我作為F廠「正式工」第一次享受這種「福利」。\n\nF廠「工會」除了作為上訪部門，還有一個重要功能就是給工人派「禮品」，這筆支出可能佔據了這個部門主要預算投入。我在做派遣工期間，我的同事也預約過一次年度「禮品」，可以選被褥四件套、小電飯煲、雙肩包等等。我其中一個同事預約了四件套，被褥可以換新了；另一個同事預約了小電飯煲，在宿舍可以住泡麵吃了。她們都很開心，唯一抱怨的就是排隊時間過長，有些人排隊領「禮物」要花掉兩到三個小時。\n\nF廠「工會」的「禮品」，派遣工是沒有的。去年中秋節，「工會」給工人派發了G省特色蛋黃月餅。當然，派遣工也不是一點「福利」都沒有，有的勞務派遣公司也給派遣工準備了月餅。但是我的勞務派遣公司距離較遠，所以我只好放棄了這份中秋「福利」。\n\n昨晚大概十點半的時候，線外通知說十一點吃中飯時間去樓下領「禮包」。我問線外，領到之後放哪啊？我的搭檔說，可能要拆開，才能放進鞋櫃。要知道，我們的鞋櫃空間很小，冬衣都放不下。\n\n中午吃飯時間一小時，今日我吃完比往常加快了許多。在食堂，我十幾分鐘吃完飯後，我就去順利領到了「禮包」。上樓的路上，我看到不少工人都手提一個大袋子。\n\n我到了鞋櫃區，看到了頗為壯觀的景象，鞋櫃上掛了很多大「禮包」。大家真是心思巧妙，直接用把大禮包鎖在了鞋櫃外面。同事抱怨說，明明可以下班後再發，現在搞得這麼麻煩，放都沒地方放。\n\n聽說往年F廠在國曆新年都是直接派50偽幣的紅包，現在改派「大禮包」了。一個同事說，直接發錢，不好嗎？另一個同事說，直接發錢，它們怎麼吃回扣呢？「去投訴？人家肯定會說發禮包是符合集團政策的。」\n\n「我們現在在做什麼，我們早早就停下了腳步。一切我們都領教過了，它的做法也沒有前途。我們現在想要什麼，只要還能生活在中國，每天都會有小恩小惠。」—黃金剛《另一個工人的觀點》",
			"date_added": 1610766895
		},
		{
			"post_id": 1610766938,
			"body": "近日S市大型電子廠某部門工價：泰西2021年01月10-11日，純工價24元，03月01日起，純工價22元。泰西2021年01月12-15日，01月純工價28元，02月純工價25元，03月純工價22元，工期為三個月。",
			"date_added": 1610766906
		},
		{
			"post_id": 1610766945,
			"body": "昨天，我之前線上的同事發來他的工資到賬微信消息截圖，在綠廠做派遣工，上個月實發工資有六千多偽幣。我們紛紛表示羨慕，並感嘆他真聰明。在我們部門加班感覺要變少之際，跑路去D市綠廠，太聰明了。",
			"date_added": 1610766912
		},
		{
			"post_id": 1610766957,
			"body": "昨晚收線早，7點下班，大概5點40分就收線了。這是我來這棟樓之後，收線最早的一次。我去廁所洗完手後，就在車間閒逛，遇到了之前樓的隔壁線上一女工。\n\n她都跟我感嘆過好幾次，這裡太累了，還是前加工舒服。這次聊到也許很快就要白班夜班合併，很多人會返回之前的樓，聽說那裡要做新產品了。但是我們這批被分過來的人，很可能回不去了。但聽說這棟樓也快拆線了，我們都感嘆趕緊快拆線吧。\n\n這位女工，我非常欽佩。在以前的樓，下班打卡，我們排隊時經常前後站著，所以聊天比較多。她今年3月份來F廠，6月份轉正。來這棟樓後，泰西新年放假四天，她告訴我，從來F廠到現在，她今年都沒休息超過兩天。現在這棟樓太累了，手不能停，放假四天的話，要好好休息休息了。\n\n這幾年，她都在外面打工，銀行卡裡都有十幾萬了。一個在外面租房住，賺了錢自己攢著，不給家裡。她結婚後，生了一個女兒，婆婆與丈夫都很不滿意，想讓她再生。她用四川口音的國語跟我說：「女人又不是生孩子的工具，我才不生呢，生個屁喔。」",
			"date_added": 1610766923
		},
		{
			"post_id": 1611448778,
			"body": "昨日23时45分，F廠LH廠區週邊有一人確認感染COVID-19。我昨晚夜班，吃完午飯，12點10分開線後，線外就開始統計大家的住址，進行摸底排查。\n\n我一邊搬磚，一邊和我的搭檔閒聊疫情相關，全技員就突然跑過來問我們住哪？我們蛤蛤大笑，在此前，這不都問過好多遍了嗎？全技員在我們詢問我們之前，線外和稽查人員已經開始督促大家，讓把口罩戴好。要知道，都很久沒人提醒將口罩戴好了。這場面，令我們覺得好笑。\n\n前段時間，南震旦疫情緩和，雖然工廠還是每日發送口罩，並強制要求佩戴，但是很多工人都鬆懈了，雖然戴著口罩，但嘴巴和鼻子都露在外面，大概因為幹活會覺得憋氣吧。好幾次發口罩時，我都見到不少工人當場將口罩的金屬條取出，因為很多人戴著口罩過不了金屬檢測門。\n\n前舊，廠門口的入廠人臉識別門禁也升級了。升級後的門禁，在檢測人臉的時候，也會實時監測體溫。更早之前，我所在的樓，有那麼一兩天，進入車間刷門禁的時候，要求間隔一點五泰西米。\n\n要說F廠的防疫措施怎樣，我想說它的表面功夫做得還不錯，至少直到現在，還每日配發一個口罩，要求每日在工作地與居住地進行手機APP定位打卡。\n\n等到今早下班的時候，線長在班後會強調，這次的感染者距離廠區特別近，大家沒事不要亂跑。千萬要記得APP定位打卡，兩天不打卡，取消入廠權限。現在F區週邊確認一個案例，入廠權處理會麻煩，可能會要求提交核算監測報告。線長最後提醒大家，如果不打卡，被取消了入廠權限，上不了班，就「賺」不到錢了。",
			"date_added": 1611448743
		},
		{
			"post_id": 1611583364,
			"body": "今天轉白班了，夜班轉白班太痛苦，下午三點過後，我和我的搬磚搭檔都陷入到了不清醒的狀態。要知道，夜班與白班有十二個小時的時差，但工人只有二十四個小時的時間用來翻轉晝夜。\n\n臨近國曆新年放假，白班與夜班合併，只保留一個班次。在F廠，拆線與國曆新年前夕，都會進行和班。和班之後，那些「剩餘的人」，要麼自行辭工了，要麼會被分流到別的樓層。\n\n一個新品，就有一條新線；一個新品過氣，就會有一條線被拆。快消時代的電子產品迭代速度越來越快，架線與拆線也愈加頻繁。因此，工廠會頻繁調動工人，它们就像徵調物資一樣，絲毫不考慮工人的感受。\n\n曾經有同事跟我抱怨，剛剛適應了新環境，也與同事也熟絡起來了，但這樣就會被打散再重組。這個消費主義時代，電子廠的工人們也更難以建立緊密的聯繫。\n\n這次和班，從對班過來幾位同事告訴我們，她們班次的監工對產量的佈置與我們這個班次完全不同。對班監工會將當天產量平分到每個工位，在開線時，就會告知當日產量。在對班，如果一個人做得快，就可以早收線，早休息。\n\n我們班次的監工從不告訴我們當日產量，就算我們詢問，她們也會說不知道。每日，整個班次一起完成了當日產量，我們才會集體收線。在這種模式下，每個工站都會摸魚打渾，導致最後收線較晚。\n\n在F廠，基層監工對於生產的安排有相當大的自主性。在每個線長管理的縫隙之中，每個工人都有自己的生存之道，或摸魚打渾，或快快生產，不管怎樣，都要讓自己多休息少幹活。",
			"date_added": 1611583328
		},
		{
			"post_id": 1611585604,
			"body": "今天中午，我一邊搬磚，一邊與我的搭檔討論國曆新年「留守」加班可以「賺」多少錢。\n\n此前有消息說，國曆新年放假四天，加班七天。我們估摸著，七天加班，如果按兩倍工資計算，每天有三百塊偽幣加班費，再加上工廠「獎勵」「留守」七百塊偽幣，那麼我們「賺」到二千八百塊偽幣加班費。\n\n即便有將近三千塊加班費，到手工資也就只有五六千塊偽幣而已。我們不僅大呼「黑廠」，同事說，人家都有專業人士在算，妳能算過它們嗎？\n\n去年因為疫情，F廠給工人疫情補貼，所以泰西曆2、3月份，許多工人的工資都有八九千塊偽幣，有的甚至有上萬塊偽幣。去年10月份之前，每個F廠「正式工」的到手工資差不多也有六千塊偽幣。\n\n這對比太強烈，同事感嘆，「去年，進廠難；今年，回家難。」就在我們嘆氣之際，線長與線外從我們工站路過，線外大呼，「留守」沒班加了，放假十二天。\n\n這可是個大消息。要知道，近舊北震旦疫情反覆，導致許多工人不能返鄉，本想著加班「賺」一票，這可倒好，滯留S市吃喝都是一筆費用。\n\n這個消息像一塊石頭投入了池塘，在工人之間擴散開來。在搬磚之餘，在鞋櫃處更換防靜電衣之際，在食堂吃飯之時，「『留守』沒班加」的消息穿透了紛雜傳入我耳。\n\n等到下班班後會，線長正式官宣了「『留守』沒班加」。他說因為疫情原因，導致供應商在國曆新年無法供貨，所以這邊也不生產了。\n\n「留守」到底能加幾天班？在一個月之間，工廠統計了好幾次「留守」工人名單，也變換了幾次說法，從全有班加有「奖励」，到放假七天，再到放假四天，最後到沒班加。\n\n對於F廠的「正式工」來講，這是一個買方市場。我們出賣自己的勞動力，至於何時使用，使用多久，都是買家說了算。\n\n為了更好的生活，我們想要更高的工資，所以我們「自願」加班。可我們沒有權力要求加班，也沒有權力拒絕加班。\n\n我們國朝工人只有一種自由，那就是將自己賣出去的「自由」。賣多少，賣多久，完全由「供需關係」決定，工人只能選擇賣或者不賣。",
			"date_added": 1611585567
		},
		{
			"post_id": 1611784571,
			"body": "我中獎了，中了LH區數字偽幣紅包的籤。脫碳入硅，可以體驗一把數字偽幣了，這個國朝很賽博。然後吐槽一下，這個LH區的數字偽幣抽獎活動應該是全市既定政策，此前已有其它區抽籤活動，允許全市範圍內在地臣民參與，但LH區給硬拗成「春節福利」，有點好笑，而且只需在地營業法人給「留守人員」報名，不許個人報名。LH區發出這個「福利」消息後，沒過兩日，其轄區內就出現一名確診案例，令人不禁感嘆因果報應。",
			"date_added": 1611784533
		},
		{
			"post_id": 1611784580,
			"body": "上次被约谈，官差加了我的微信，说方便联络。刚刚在食堂吃饭，官差又说想约谈我，唉。",
			"date_added": 1611784541
		},
		{
			"post_id": 1612046699,
			"body": "聽同事說，有傳聞F廠某部門，「留守」加班人員有高額「獎金」，只放假兩天，有兩天三倍工資可以「賺」。據說加班十天，「獎金」加上加班費，可以「賺」近五千偽幣。",
			"date_added": 1612046659
		},
		{
			"post_id": 1612048966,
			"body": "请问一个空的zerosite，如何安装zeroblog？",
			"date_added": 1612048925
		},
		{
			"post_id": 1612365482,
			"body": "我們部門每月「福利」一卷衛生紙，大概衛生紙既便宜又看起來比較大吧？這樣，花最少的錢，可以送最大的「福利」。",
			"date_added": 1612365440
		},
		{
			"post_id": 1612365506,
			"body": "臨近國曆新年，我們車間的工人越來越少，或跑路，或請假，回去返鄉過年了。昨日，我們端早點名，本來12組機，24個人，結果一共才有7個人到，線外無奈地說，只能開3組機了。\n\n等到九點多，我和我的搬磚夥伴愕然發現，已經開了10組。原來隔壁樓也和班了，夜班的人被分流，很多人都分流到我們樓了，缺人的工位被迅速補充了人力。我的搬磚夥伴感嘆「F廠最不缺的就是人」。\n\n下班後時，男工發兩卷衛生紙，女工發三卷衛生紙。衛生紙「福利」的配額，男工每月一卷，女工每月兩卷。這次發送，上個月與這個月和起來發，很顯然，女工虧了。我一個同事這樣說，「F廠真狡猾，昨天那麼多人跑路，它今天發，嘖。要是中國所有人都這麼想事情，這個國家早就完了。」",
			"date_added": 1612365463
		},
		{
			"post_id": 1612438603,
			"body": "中午吃饭的时候，我收到官差信息，说晚上要约我。七点下班后，我走出车间，拿出手机，看到官差微信说去某饭馆，先不要吃，她们也没吃。我现在回家洗漱一下，就去赴约。那好吧，我们现在走吧。",
			"date_added": 1612438559
		},
		{
			"post_id": 1612447756,
			"body": "我现在已经回来，官差说不让我发朋友圈。没啥事，约谈我干嘛？我是良民。",
			"date_added": 1612447711
		},
		{
			"post_id": 1612525655,
			"body": "走出車間，到了鞋櫃區，我聽到一位女工長嘆一口氣，獨自念道：「終於解脫了，可以休息了。」明日起，放假十二天，我們樓今年國曆新年沒班加。",
			"date_added": 1612525609
		},
		{
			"post_id": 1612530294,
			"body": "今天上午，隔壁線全技員又在大喊大叫，讓員工快點做。我跟隔壁工位的同事吐槽這個天天屌人的全技員，我同事這樣說，「出了車間，（他）什麼都不是，也就是在工廠，要是在我們老家農村，早被打了。」",
			"date_added": 1612530247
		},
		{
			"post_id": 1612859749,
			"body": "放假期間，所有工人必須使用工廠APP進行每日定位打卡，讓工廠知曉自己的活動軌跡。如若不打卡，開工後，可能會被取消入廠人臉識別權限。線長按照工廠要求建了一個微信群，我們線所有每日在群內進行接龍，發每日定位打卡的截圖。每日十點鐘後，他做統計後，再報給上級。線長在群裡抱怨說，這比上班還累。",
			"date_added": 1612859701
		},
		{
			"post_id": 1613741840,
			"body": "昨日開工，因為沒有按時拿到核酸檢測報告，有幾位同事無法取得廠門人臉識別門禁權限。開工前三天時，線長在微信群通知我們關注一個微信訂閱號，上傳偽相府的健康碼與行程碼，外省人員還需上傳核酸檢測報告。\n\n工廠的各個部門對於返鄉同事的入廠權限有著不同規定。我所在的部門要求，所有工人都必須每日使用工廠app進行定位打卡，在G省本省活動，只要每日定位就可以直接獲得開工後的入廠權限；一般風險的外省人員需獲得核酸檢測報告；中高風險地區的外省人員除核酸檢測報告外，還需要在指定宿舍隔離兩天。\n\n在放假前，線外及其幹部都放風說外省的同事回家可能要隔離十五天天。這隔離兩天與隔離十五天，區別也太大了點吧。",
			"date_added": 1613741791
		},
		{
			"post_id": 1613743004,
			"body": "今日，我們段產能比較低。開了10組機，只有4組是本線人員，另外6組都是由其它樓借調過來的支援人員組成。雖然這個活是簡單的機械重複的體力勞動，但也講究熟能生巧，熟練工每小時產能是35-38個，新人每小時最多做30個。\n\n有人年前就跑路了，還有人選擇年後跑路不過來了。國曆新年過後，人員大減少，按照線長的說法，「各個部門都缺人，只能這裡借一點人，那裡借一點人，人員非常混亂」。\n\n在下班班會強調這個，線長是想表達老員工要「辛苦」一下。這個垃圾搬磚線，人員流失非常快。所以，線長每次下班會總是強調，大家「辛苦」一下。\n\n之前有一天，有同事早早完成了額定產量，就停下，不做了。線長過來問，被告知早就超額完成了產量，線長狼狽走開。等到下班會，他拐彎抹角地說，這個廠是計時的，不是計件的。\n\n後來，我們同事之間都互相調侃，不要做快了，我們可是計時的，不是計件的，畢竟做多了也沒有獎勵。\n\n「尊貴的線長大人」，妳要知道啊，我們來F廠，不是來「辛苦一下」的，我們是來「賺錢」的。",
			"date_added": 1613742954
		},
		{
			"post_id": 1613813821,
			"body": "泰西2021年02月20日，S市大型電子廠某部門純工價為25元，合同期到04月30日，外省人員需提交核酸檢測報告才能報名。",
			"date_added": 1613813770
		},
		{
			"post_id": 1613920066,
			"body": "看到中介发的微信朋友圈，入职F厂已不再要求核酸检测报告，持绿码即可。今天，我们线国历新年防疫打卡群里，好几个同事都在抱无法成功提交健康码或核酸检测报告，无法取得入厂权限和宿舍权限。她们都在问怎么办，但工厂并没有安排工作人员解答。",
			"date_added": 1613920014
		},
		{
			"post_id": 1615208706,
			"body": "今天是國際婦女節，按照國朝律令，婦女節為部分臣民假期，婦女臣民放假半天，可F廠的女工們在婦女節並沒有帶薪假。\n\n為什麼工廠不放假，因為按照律令，在這些屬於部分臣民的法定假期，如果那些臣民正常上班的話，資方不需要額外支付加班費。\n\n沒有加班費的假期，還能算假期嗎？\n\n目前，國朝法定假期每年只有11天，這裡說的法定假期是指加班需要支付三倍加班費的假期，而那些屬於部分臣民的假期，大概只有八旗集團及其包衣可以享受吧。\n\n今天，F廠的文員都拿到了節日禮物，一束植物生殖器，而產線工人除了得到部分男工的節日祝福「過節要開心點」外，什麼都沒有。\n\n且不論，產線工人跟別人講起自己的職業時得到的鄙夷（工廠工人會被認為沒本事沒出息），就算在工廠內部，它們在婦女節都要刻意創制出一個對體力勞動者赤裸裸的歧視。\n\n聽說在F廠有一種說法：「坐辦公室的」看不起產線上的，覺得她們學歷低素質差；而產線工人覺得那些「坐辦公室的」，除了打混摸魚外，什麼都不幹。\n\n但產線上的一位同事跟我講，他不覺得「坐辦公室」需要什麼特別的技能，「不就是做個表格嘛，誰學不會？」他不覺得「坐辦公室的」有什麼高級的。\n\n是的，我們憑力氣吃飯，要自己看得起自己。",
			"date_added": 1615208653
		},
		{
			"post_id": 1615392719,
			"body": "這幾天，我被轉調回最初的樓，那個樓要開新品線了。昨天打卡還要回那個搬磚樓，因為距離比較遠，所以下午六點線外就放我回去打下班卡了。\n\n我換好防靜電衣，回到搬磚線，這時已經六點半了。這個飛機拉車間，還有好多人未收線。我去找我一個女工朋友，想要告訴她，我被轉調回去的消息。\n\n到了她們線，我找來找去，看到一個女工滿臉疲憊，用盡力氣從流水線上拖拽著一個又一個機台到自己的工位。透過她的眼睛，整個宇宙的疲倦都湧進了我的身體。一下子，我整個人都不好了。\n\n等到排隊打卡的時候，我的朋友排在我前面，我看到她也是一臉倦意。「每天都收線這麼晚，沒有停，好累喔」我問她什麼時候跑路，她說先做著吧，實在做不下去了，就辭工。\n\n跑路也沒處去啊，外面工價好低，才二十多塊，和F廠正式工也差不了多少。聽說藍廠前舊招了一批小時工，老找藉口不開工，跑路了一大半。「打工就這樣，先做著吧」",
			"date_added": 1615392665
		},
		{
			"post_id": 1615392729,
			"body": "今天我們線來了幾個新同事，其中一個小伙，腳非常臭。在休息區，他坐在我後面，那味道都沖倒我的頭皮上了。\n\n他的工價二十一塊，兩週前工價還是二十六塊的時候，他還進不了。為什麼呢？那時候，他跑路還未滿一個月。\n\nF廠有規定，辭工再進來，需要滿一個月；自離跑路需要滿三個月。\n\n他說進F廠的人再去小廠根本待不下去，沒一天就會跑路。很多人做完工期，寧可玩一個月，也不去小廠。他也不例外，住了一個月的「掛屄」床位，又回來了。\n\n我猜，住廉價床位，大概是他不講衛生的原因吧。\n\n小時工是許多青年工人的選擇，她們根本不在意社保，做完工期就跑，再奔向新的工期，彷彿永恆的輪迴。",
			"date_added": 1615392674
		},
		{
			"post_id": 1615610695,
			"body": "前天開始，我所在的樓開始下七點半，上班八個鐘，加班兩個半鐘，總共十個半鐘。被轉調到這個樓後，我每天除了中間休息的十分鐘可以坐著，其它時間都是站著。\n\n昨天七點才收線，直接站到癱瘓。昨晚回家後，什麼都不想做，早早睡下，今天早早起床。要知道，今天週六，加班工資為正常工資的兩倍，十個鐘有三百塊偽幣。嗯，我要做好加班準備。\n\n前幾個月，因為國曆新年「換班」，導致收入非常低。今天本來大幹一場，「賺」它三百塊偽幣。萬萬沒想到，到了十點四十，全技員突然喊停，讓我們去吃飯了。好奇怪啊，平時都是十一點去吃飯。\n\n吃完飯，在便利店門口，新來同事跑來告訴我，其它樓層已經下班，我們也回去打卡下班。回到車間，線長說不知道什麼原因突然喊停，她也是第一次遇到。她讓我們打卡下班，週一正常上班。\n\n線長說，反正明天也要休息，都回去好好休息一下吧。害，我們這些普工週六都不能「正常」加班，工資還夠生活嗎？今天加班三小時，只「賺」到九十塊偽幣。\n\n聽說突然喊卡的原因是出現了批量不良，我和幾個新來的同事議論說，管它呢，出現再多不良，又與我們有什麼關係呢？",
			"date_added": 1615610639
		},
		{
			"post_id": 1617284105,
			"body": "近舊，國朝開始推廣臣民大規模接種國產新冠疫苗。今天下午，我們線全技員開始統計本線接種人員信息，自願報名，不強制。我報名了，我們線大概有三分之一工人報名了接種國產新冠疫苗。一位不願接種的工人說，「妳們膽挺肥啊，我還沒結婚」；另一位自願接種的工人說，「免費接種疫苗，妳還要怎樣？」",
			"date_added": 1617284048
		},
		{
			"post_id": 1617719696,
			"body": "上週六，加班，下七點，加班十個鐘，三百塊大洋到手……明天後天放假兩天。然後，今天線長把我提拔為「線外幹部」了，我一臉懵圈-。-我在考慮要不要跑路？",
			"date_added": 1617719638
		},
		{
			"post_id": 1617719705,
			"body": "泰西2021年04月06日，S市大型電子廠某部門純工價為23元，合同期到06月30日。",
			"date_added": 1617719646
		},
		{
			"post_id": 1617719715,
			"body": "今天，有一位新同事下午請假去處理銀行卡問題，中午開線後，他的工位空了，我去做工。\n\n不一會，全技員走過，看到我說，「妳現在是幹部了，這不是妳幹的活了，妳來回看看就可以了。」\n\n下午，線長對我和另一位「物流」說教道，不能一直做操作工，要往上走，妳們現在多學習點，以後就算出去再找工作，也有經驗，可以應聘線長。\n\n線長說做線長年入十萬元，還可以在車間到處吹牛，而操作員收入五六萬，這能一樣嗎？\n\n到了下班時間，全技員跟我說，我下七點半，而其它工人則下七點。我討厭加班，這真讓人惆悵啊。\n\n在F廠，許多基層監工摸魚打混，安排工人們賣力做工，而工廠則會施捨各種小恩小惠。\n\n嗯，我又想起來了黃金剛的歌《另一個工人的觀點》。",
			"date_added": 1617719655
		},
		{
			"post_id": 1618476031,
			"body": "今天，我又裝病請病假了，準備在家躺尸一天。上次，我去社康開病例單，醫生硬生生給我開了國藥，這次我特別強調要泰西藥。一盒白加黑、一盒消炎藥，可以留作備用藥了。昨天，我跟一個IPQC姑娘要了微信，聊天後，我才知道原來她早就發現我做工不停。",
			"date_added": 1618475970
		},
		{
			"post_id": 1621641372,
			"body": "我們樓又快倒閉了，這次已經沒有本單位的樓可供分流了。昨晚，由主線的科長還有線組長帶隊，我們兩百多個「正式工」被安排去另一個「事業群」支援，到培訓教室進行交接。\n\n有同事說科長、線組長都要去支援，乾脆去她們那邊開條新線得了，這樣乾活還舒心，也好管理。\n\n到了新教室後，來了一個HR，對我們宣講（威逼利誘）。他先說本單位已經沒有「案子」做了，留下來只能五天八小時，或者乾脆放假，社保也會停掉；對接的單位有班加，而且做的活也差不多，畢竟大家都經歷過「死亡二線」，沒有什麼做不了的。到時候有了新「案子」，大家再回來。\n\n大家一臉鄙夷，都說你停社保試試看啊，五天八小時也挺好啊，不乾活拿底薪，再找個兼職做，不香嘛。\n\nHR請對接的樓層的領導講話，那位領導先說她們那邊活都是打螺絲和檢測，而且大部分工位都是站著的，妳不能想坐著就坐著，想站著就站著。至於檢測呢，還要學習英文單詞。\n\n提到加班，這位領導說，我們這邊加班一般是60小時。當然也是按照效益來的，效益好的話，能有80個小時。最後說，大家明晚週六沒有班加。\n\n害，我們現在加班都快60個鐘了，妳們那邊一個月才60個鐘，明天還不讓加班。\n\nHR問誰不想去，舉手。有好多人舉手，然後HR說，不去的同事就去另一間教室。結果所有人都出來了，一個都沒剩下。無奈之下，HR又是一頓威逼利誘，但依舊無人選擇再去。\n\n我跟同事說，沒想到我們還有「選擇的權利」。同事這樣回答，畢竟還有「工會」在中間卡著。\n\n我們回去後，又打混了一整夜。「這工打得真窩囊。」「打工只能這樣，像賣豬仔一樣被趕來趕去。」",
			"date_added": 1621641310
		},
		{
			"post_id": 1622112783,
			"body": "週一分到新線，新線長問有沒有要辭工的，我舉了手。中午，線長拿了寫好的辭工單讓我簽字，還告訴我現在辭工很麻煩，建議我自離。挑戰了F廠近一年，我終於要跑路了。 ​​​\n\n在新工站，我和同事吹水。有兩位同事都在B廠做過汽車生產流水線，他們說給汽車打螺絲好累。有一位年輕同事問，汽車不都是自動化生產嗎？那位挑戰過B廠的同事說，妳汽車廣告片看多了吧？妳還真信吶？什麼廠不需要人？就像我們這個工站吧，不也是自動化嘛，不需要人嗎？蛤蛤，我差點笑死。\n\n這週前三天都是下五點，沒有班加。每天下午，我們一般四點多就可以做完產量，收線後休息，同事們可以一直吹水到下班。今天午飯過後，十二點十分開線，全技員逐個工站通知，今天下七點，並告知了產量，比下五點多好多。我和我的小夥伴拼命地做，想早點做完，然後休息。\n\n萬萬沒想到，到了快五點，全技員通知我和幾個下週跑離職手續的同事，「妳下五點」。要知道，我們做了比下五點要多很多的產量，同事破口大罵，「為什麼現在才通知我們下五點」。全技員說，「難道妳還想四點就收線」。\n\n在F廠，有個慣例，辭工前的三天沒班加。我們這些要跑路的人，被全技員套路了。",
			"date_added": 1622112720
		},
		{
			"post_id": 1622202428,
			"body": "今天有一棟員工宿舍樓被封樓，需要所有住戶都做核酸檢測。這導致我們線好幾個同事沒能來上班，聽說她們有低薪領。早上開線後沒多久，全技員就喊我們幾個下週辭工的人去主線「支援」，原來主線因為宿舍封樓沒能來上班的人更多。我被「支援組」的人帶到主線後，那邊的全技員給我分配了掃碼的工作，從流水線撿下機台，然後掃描二維碼，挺簡單的一活兒。可我沒做多久，線外就喊我去搬磚。搬磚就是來回搬運一個很重的治具，我不想做。我跟他說，我做不了這活，太難了，妳把我退回去吧。線外說，「妳要回去的話，就找我們全技員，就是那女孩。」全技員聽我說明情況後，把線外一頓呵斥，「人家就來支援一天，妳調什麼工站」。全技員讓我回去掃碼，這真的是一個稍輕鬆的工站。嗯，來F廠一年，我已經是老油條了。遇到不喜歡的工站，我絕對不做。因為我知道，F廠不會輕易開除員工。",
			"date_added": 1622202364
		},
		{
			"post_id": 1622203068,
			"body": "明天週六，雙倍工資，十個鐘有三百偽幣加班費。因為下週我就要辭工了，所以它們不許我加班。三百偽幣加班費，我「賺」不到了。",
			"date_added": 1622203003
		},
		{
			"post_id": 1623668201,
			"body": "我向一位前同事問起近況，他告訴我他在D市跑外賣，每天可以「賺」200塊。我又問他，200塊要跑多久，他說10小時，而他正在挑戰每天16小時，這樣可以入月一萬元。\n\n他跟我抱怨D市的單價沒S市高，可為什麼不來S市跑外賣呢？原來S市有規定電動車上牌照要有1年以上的社保繳納記錄。\n\n那是一個疲憊的上午，南國的南端，S市天氣還很宜人，他到F廠挑戰，糊裡糊塗做了正式工，試用期底線只有2300塊。他被分到我們線，全技員讓他跟我學徒，我們倆聊得來，連去食堂吃飯都一起。\n\n當他得知小時工的工資怎麼都比正式工高後，他就跑路了。\n\n他的微信暱稱是「李志」，我問他「這個世界還會好嗎」，他說，「這個世界會不會好，我不知道，但我過得很好。」",
			"date_added": 1623668135
		},
		{
			"post_id": 1624055684,
			"body": "昨天，我點了一份「京醬肉絲」，外送員找了半天，才送到村口的「防疫檢查站」。最近，S市出現疫情，城中村已不許外賣進入，外賣被統一放置在村口的桌子上。要是放在三年前，我要是看到「防疫檢查站」這種裝置，大概會覺得這是科幻片。",
			"date_added": 1624055617
		},
		{
			"post_id": 1624143385,
			"body": "聽說S市衛健委的微信訂閱號出圈了，這大概算是娛樂驅逐嚴肅的典範了。要放正常時刻，趣味科普當然好，可確診病例拖著晚發布，活動軌跡不詳細，就有點不務正業了吧。不要發些不痛不癢的科普，求您了，官老爺們，能做好疫調嗎？能公開透明嗎？直到昨晚，大概是D市前天開了發佈會公佈詳細軌跡，S市衛健委終於公布了一次「詳細」軌跡。",
			"date_added": 1624143317
		},
		{
			"post_id": 1624143413,
			"body": "昨日起，S市展開第二輪全市核酸檢測，F廠響應官府號召，由「幹部」帶隊，以線為單位，展開LH廠區全員核酸檢測，如若不按時完成核酸檢測，將會被取消入廠門禁權限。昨日，我亦看到房东發出的社區動員核酸檢測的通知。",
			"date_added": 1624143344
		},
		{
			"post_id": 1634618313,
			"body": "Apple已與納粹無異，那些產品廣告拍得光鮮亮麗，疊積木一般組裝而成，好似科幻大片，人們卻不知這些產品是由產線工人使用氣力將治具來回搬運，組裝而成。搬來搬來的產品污濁了工人的防靜電衣，也摀住了終端用戶的眼睛。我說，Apple的產品沾滿了尿液，並不是誇張，因為上完小解，不洗手，這是中世紀作坊的常態。",
			"date_added": 1634618243
		}
	],
	"post_like": {
		"13t3sJJF35Eei5GApCSAVFp65aZjjZB5jE_1571736622": 1590532265,
		"129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71_1583680671": 1590703642,
		"129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71_1590561671": 1590703737,
		"19nRJRoLJ3NqQiWJhSHPdiMDHN17NoRgTY_1593692737": 1593692849
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "歡迎來到zeronet",
			"post_uri": "1L11g7Cb69gLDmsApdWp1CJnxh9qgwKWx7_1590497204",
			"date_added": 1590528815
		},
		{
			"comment_id": 2,
			"body": "歡迎來到zeronet。",
			"post_uri": "139HrHdyaPTDGSrD9ZWt46qTkcQUCWaMWx_1",
			"date_added": 1590528871
		},
		{
			"comment_id": 3,
			"body": "國朝崛起是大事件，所謂「热爱文革的小屁孩」只不過是這一趨勢的表徵，問題的關鍵在於我們應該回應這個時代。",
			"post_uri": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco_1589621217",
			"date_added": 1590529878
		},
		{
			"comment_id": 4,
			"body": "@birdvd: 谢谢",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1590599088",
			"date_added": 1590650999
		},
		{
			"comment_id": 5,
			"body": "呃，好像一直可以编辑吧",
			"post_uri": "1L11g7Cb69gLDmsApdWp1CJnxh9qgwKWx7_1590682373",
			"date_added": 1590703262
		},
		{
			"comment_id": 6,
			"body": "@猫叉酱: 跑起来很正常啊",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1590685535",
			"date_added": 1590804185
		},
		{
			"comment_id": 7,
			"body": "@Halo1117: 还有什么是安全的？",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1590530440",
			"date_added": 1591170373
		},
		{
			"comment_id": 8,
			"body": "@猫叉酱: 是否有这方面的资料？",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1591454957",
			"date_added": 1591554347
		},
		{
			"comment_id": 9,
			"body": "@Halo1117: 灯塔已灭。",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1591454957",
			"date_added": 1591554970
		},
		{
			"comment_id": 10,
			"body": "@猫叉酱: 谢谢",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1591454957",
			"date_added": 1591814825
		},
		{
			"comment_id": 12,
			"body": "欢迎来到自由世界。",
			"post_uri": "19nRJRoLJ3NqQiWJhSHPdiMDHN17NoRgTY_1593692737",
			"date_added": 1593692866
		},
		{
			"comment_id": 13,
			"body": "妳的工作属于狗屁工作吗？",
			"post_uri": "19nRJRoLJ3NqQiWJhSHPdiMDHN17NoRgTY_1593772216",
			"date_added": 1594216711
		},
		{
			"comment_id": 14,
			"body": "@猫叉酱（小号）: 不认识。",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1610766957",
			"date_added": 1610843810
		},
		{
			"comment_id": 15,
			"body": "@Asfgsgeg: 谢谢关心",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1611784580",
			"date_added": 1612046685
		},
		{
			"comment_id": 16,
			"body": "@猫叉酱（小号）: \b这就是国朝",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1611784580",
			"date_added": 1612046702
		},
		{
			"comment_id": 18,
			"body": "@A7oiz: 我很穷的",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1611784580",
			"date_added": 1612046761
		},
		{
			"comment_id": 19,
			"body": "@A7oiz: 这样操作，好像评论会出问题",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1612048966",
			"date_added": 1612365428
		},
		{
			"comment_id": 20,
			"body": "@Tommykakashi: 请勿造谣。",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1612447756",
			"date_added": 1612525652
		},
		{
			"comment_id": 21,
			"body": "@落后起跑然后放弃的乌龟: 北震旦人",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1617719715",
			"date_added": 1618475952
		},
		{
			"comment_id": 22,
			"body": "@Tommykakashi: 妳猜，蛤蛤",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1623668201",
			"date_added": 1624055647
		},
		{
			"comment_id": 23,
			"body": "@Yes I am: 請問妳在台灣嗎？",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1623668201",
			"date_added": 1624055687
		},
		{
			"comment_id": 24,
			"body": "@Yes I am: 我真的说太夸张。",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1624055684",
			"date_added": 1624143256
		},
		{
			"comment_id": 25,
			"body": "@Yes I am: 對岸的朋友，妳好。你們沒有疫苗打，但消息說我們打的疫苗防護效果不大。",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1623668201",
			"date_added": 1624143465
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di",
			"user_name": "Git Center",
			"date_added": 1590528074
		},
		{
			"follow_id": 2,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1590528074
		},
		{
			"follow_id": 3,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "16YxtnaTrCSbvCXSYxrnvobmYnqtidxG23",
			"user_name": "Hellozeronetwork",
			"date_added": 1590528091
		},
		{
			"follow_id": 4,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1590528111
		},
		{
			"follow_id": 5,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF",
			"user_name": "猫叉酱（小号）",
			"date_added": 1590528416
		},
		{
			"follow_id": 6,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz",
			"user_name": "猫叉酱",
			"date_added": 1590528427
		},
		{
			"follow_id": 7,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta",
			"user_name": "瓶子",
			"date_added": 1590528496
		},
		{
			"follow_id": 8,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1GAWwPWreQXo1CwcefCgL6w5wYPkNFWbsj",
			"user_name": "西木野真姬",
			"date_added": 1590528513
		},
		{
			"follow_id": 9,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ",
			"user_name": "P2P",
			"date_added": 1590528588
		},
		{
			"follow_id": 10,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "163cCAVJzhzn2hYne8LtFjyAfDbRQP1vv2",
			"user_name": "Nexusoneus",
			"date_added": 1590528937
		},
		{
			"follow_id": 11,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco",
			"user_name": "数字崇拜",
			"date_added": 1590529029
		},
		{
			"follow_id": 12,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz",
			"user_name": "A7oiz",
			"date_added": 1590596121
		},
		{
			"follow_id": 13,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1CMt5cmxdfa3b9LaVYBCi55KSKBgVEQ1Hg",
			"user_name": "Natalia",
			"date_added": 1590690613
		},
		{
			"follow_id": 14,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv",
			"user_name": "Lajos Nagy",
			"date_added": 1590691733
		},
		{
			"follow_id": 15,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71",
			"user_name": "zeromepro",
			"date_added": 1590703537
		},
		{
			"follow_id": 16,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS",
			"user_name": "Ansho Rei",
			"date_added": 1590704184
		},
		{
			"follow_id": 18,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1Q9vgKagehDHwvhYF32zpRPuDaBNDQ3PaE",
			"user_name": "苏苏苏苏苏",
			"date_added": 1590809360
		},
		{
			"follow_id": 19,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1E3BgcKR864JaJQA85Zb5Gqr4YDzt1v7XR",
			"user_name": "Bankruptcy",
			"date_added": 1612530391
		},
		{
			"follow_id": 20,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "18ba33oMX3eLmrzXdu8CqU19LqoGjXtZc",
			"user_name": "Yes I am",
			"date_added": 1624143394
		}
	]
}