{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Если я правильно все понимаю, то ЗероНет уже способен и без интернета работать. Видел твиттер разработчиков, где они показывали синхронизацию других зайтов в Зеронете без интернета. Просто по локалке, используя Bluetooth или Wi-Fi. Не помню, чтобы какие-либо другие P2P-сети способны были на это. Очень напоминает это мне мессенджер FireChat на самом деле.",
			"post_id": 49,
			"date_added": 1542220425
		},
		{
			"comment_id": 2,
			"body": "> [balancer73](#comment_28_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Речь о посторонних форумах :) Часто полузаброшенных.\n\nНу тогда это не бан на форуме, а блокировка **только** на твоей ноде.\nАлсо, я столкнулся с похожей темой. Связанна она с авторизацией и именами на форумах. Я запилил возможность логинится на форуме через сторонние ID-сервисы, так как мне не нравится \"родной\" ZeroNet'овский. Я подключил KaffieID. И вроде все пошло хорошо. Однако когда я отредактировал себе никнейм на регистраторе, а потом решил посмотреть как оно на форуме, то ничего у меня не изменилось. Старые имя осталось прежним. Более того, при новом постинге, я снова постил со старым именем. Я попытался связаться с разработчиком, но она мне сказала, что проблема в том, что ZeroNet не умеет автоматически обновлять content.json Тогда я вручную заменил старый приватный ключ на новый в моей учетной записи и подписал потом зайтовским приватным ключом. Имя везде изменилось, но только вот беда: в тредах которые были созданы мной удалились все не мои ответы. Сложилось такое ощущение что зайт просто удалил старые треды и создал их с нуля с новым именем, просто дата там осталась прежняя. \n",
			"post_id": 54,
			"date_added": 1542221382
		},
		{
			"comment_id": 3,
			"body": "Ну, звучит может быть в каком-то плане здорово, но проблема здесь в том, что в ЗероНет просмотры можно накручивать легко, так как он децентрализованный и отчасти анонимный. ",
			"post_id": 53,
			"date_added": 1542221555
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}