{
	"pages": [
		{
			"id": "d96d1a40-56dc-11e8-837b-1f1bd95decdc",
			"body": "FIBRE OTTICHE DA RECORD\n\nIn Danimarca, ad oggi, risiede la fibra ottica più veloce al mondo.\nUna singola fibra ottica capace di trasmettere una velocità pari a 43 Tbps, tale da poter scaricare un DVD di 1 GB in 0,2 millisecondi o 5,4 TB al secondo. Un risultato tecnologico mai raggiunto prima, frutto della ricerca della Technical University della Danimarca (DTU) che, migliorando sia il proprio record del 2009 che quello segnato dal Karlsruhe Institute Of Technology nel 2011, è riuscita a superare ogni velocità raggiunta precedentemente dalla fibra ottica.\nLa caratteristica più importante di questo traguardo tecnologico è l'utilizzo di un singolo laser e di una singola fibra.\nIn questi anni ci sono state numerose dimostrazioni di centinaia di terabit per secondo trasmesse lungo fibre multiple grazie a laser multipli. Il lato negativo di queste dimostrazioni è la lontananza dalla realtà: quando si parla di linea commerciale, nella maggior parte dei casi è composta da una singola fibra e un singolo laser.\nMotivo per cui i 43 Tbps raggiunti dal DTU sono il risultato con più potenziale pratico per il prossimo futuro.\nDuole ricordare però che stiamo parlando non di una singola fibra ottica ma multi-core.\nNello specifico, la fibra utilizzata ha sette core ed è sviluppata dalla giapponese NTT.\nQuando nel 2011 Karlsruhe registrò il nuovo record mondiale di 26 Tbps queste fibre multi-core erano più rare e soprattutto più costose, nel 2014, sono invece prodotti molto più abbordabili.\nAl momento, la linea commerciale più veloce non supera i 100 Gbps mentre si sta lavorando per portare nel 2017 una linea a 400 Gbps.  La tecnologia a fibra ottica non è più recentissima, tuttavia solo negli ultimi due anni abbiamo assistito a una diffusione sempre maggiore sul nostro territorio, con offerte che in alcune regioni iniziano a diventare appetibili. Mentre noi italiani aspettiamo ancora per accedere \"in massa\" a questa tecnologia (almeno in tutti i centri urbani), in altri paesi dell'Unione Europea la ricerca corre veloce. E' il caso della Danimarca, dove alcuni ricercatori del DTU (Technical University of Denmark), hanno stabilito il nuovo record mondiale di trasmissione su singola fibra e singolo laser.\nSi parla di ben 43 Terabit per secondo, un risultato straordinario che non ha precedenti proprio perchè ottenuto su singola fibra. Ma come è stato possibile raggiungere questo traguardo? n realtà dietro questo successo dei ricercatori danesi c'è un \"trucco\". Gli studiosi infatti si sono serviti di una fibra \"Multi-Core\", che appare come una singola fibra ma all'interno è costituita da diversi canali indipendenti, in questo caso si parla di 7 canali. Il risultato quindi può essere migliorato con fibre a più \"Core\", come del resto si intuisce dallo schema sopra riportato. Parlando infine in termini più pratici, 43 Terabit per secondo equivalgono a circa 5,4 TeraByte al secondo; per trasferire 1GB di dati quindi impiegheremmo 0,02 secondi! Se siete appena passati a un nuovo abbonamento che prevede l'utilizzo della fibra ottica, vi sembrerà di essere su un altro pianeta rispetto ai vecchi servizi ADSL che ancora imperversano sulla nostra penisola. Fermate però l'entusiasmo perchè dagli USA arrivano notizie di una nuova tecnologia che farà a dir poco impallidire qualsiasi tipologia di rete messa a punto fino ad ora, anche i 43 Tb/s dei Danesi che fecero scalpore questa estate. Un team di studiosi formato da esperti della University of Central Florida e della Eindhoven University of Technology, hanno infatti messo a punto una rete in fibra ottica capace di raggiungere una velocità di trasferimento pari a 255 Tb/s. Avete capito bene, circa 31,8 Terabyte al secondo, ovvero l'intero traffico globale attraverso un unico cavo. Per dare un'idea delle prestazioni immaginiamo di trasferire 1GB in 31 microsecondi, 1TB in appena 31 millisecondi, oppure scaricare tutti e 317 mila film su IMDB in due ore e mezza. Come spesso avviene per tecnologie a fibra di questa tipologia, il team ha utilizzato 7 \"canali\" (o core) indipendenti su una griglia esagonale con approccio spatial multiplexing, l'unico modo a quanto pare per giungere a queste velocità. Il test è avvenuto su una distanza di un chilometro, non ci sono tuttavia notizie di una imminente diffusione di questa tecnologia per lunghe distanze.\n\n                                                                                                                                                                                      timetraveller01\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
			"date_added": 1526236717540,
			"slug": "lista-ziti-torrent"
		}
	]
}