{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "Если у государства есть возможность взять хостера за жопу, VPN ничего не добавляет к безопасности.",
			"post_id": 4,
			"date_added": 1525150034
		},
		{
			"comment_id": 2,
			"body": "Спасибо за обзор.\n\n**Телеграм** — отличная попытка, товарищ полковник, но нет, кушате сами. Привязка к телефону — сразу всё было понятно.\n\n**Bitmessage** скорее напоминает прототип самого себя, чем реальный клиент. Только недавно дыры, приводящие к исполнению атакующего кода или зависанию клиента, закрывали. Многих возможностей нет и неизвестно, когда будут. Хотя в теории всё возможно, но на практике с manpower как обычно.\nИ непонятно, поможет ли PoW от DDoS-атак. Вангую, что нет.\n\nУточнение насчёт:\n\n> Используется bitcoin-подобная сеть\n\nОна не bitcoin-подобная. Ни к какому консенсусу члены сети не приходят, просто пересылают друг другу письма.\n\n**Tox** — пока самый многообещающий по технологиям, но это не значит, что юзабельный. Посмотрим, как будет дальше.",
			"post_id": 6,
			"date_added": 1525625830
		},
		{
			"comment_id": 3,
			"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Насколько я понял они просто взяли всю идею bitcoin, просто вместо денег пересылают сообщения. Ну и PoW там нужен для генерации блоков, как и в bitcoin\n\nНет, там иной принцип. Если упрощенно и не совсем корректно, то так:\nКаждое сообщение имеет срок хранения в сети. Чем больше срок, тем сложнее у него PoW. Клиент вычисляет PoW и отправляет письмо в сеть. Оно расходится по всем узлам и просто хранится.\nКлиенты отказывается принимать сообщения с некорректным PoW или протухшие. Когда локально хранимое сообщение протухает, клиент его удаляет.\nТехнически это близко к ZN, но далеко от биткойна. Можно сказать, это \"ЗероНет с запланированным устареванием контента\". Ну и плюс шифрованный, а не публичный.",
			"post_id": 6,
			"date_added": 1525626618
		},
		{
			"comment_id": 4,
			"body": "> [deepstrelok](#comment_10_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Насчет соц. индекса неплохо было показано в некоторых сериях Черного Зеркала.\n\nГениальный минисериал.",
			"post_id": 7,
			"date_added": 1526001381
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"6": 1
	}
}