{"cards": [

{
 "card_id": 0,
 "title": "",
 "cost": "",
 "color": "blank",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "... und sich vordrängeln ist nicht ok, aber bei manchen Dingen manchmal verzeihlich.",
 "rule_title": "Incantato",
 "rule": "Wer glaubt, daß jemand verlieren muß, hat verloren.",
 "date": 0
},

{
 "card_id": 1,
 "title": "Mantra der Reinheit",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Entferne Mantra der Reinheit aus dem Spiel: Ziehe 4 Karten in deiner nächsten Zugphase.",
 "strength": "",
 "extra": "Was ist nicht Nichts, doch ohne Gestalt?",
 "rule_title": "Mantra der Reinheit",
 "rule": "Vor Beginn des Spiels sucht jeder sein Mantra der Reinheit aus seiner Bibliothek und legt es offen vor sich. In der nullten Runde darf man das Mantra der Reinheit aus dem Spiel entfernen, um dessen Effekt zu aktivieren (siehe Regel 733,734).<br><br><i>„Sich der unmöglichen Aufgabe zu stellen - so wird das plausible Wirkliche erreicht.“</i>",
 "token": "H1ismCyDm3P6x5zjqoL9hmjQzrn1q8L4uemGSxDJxAk=",
 "taken": true,
 "zite": "13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz",
 "date": 0
},

{
 "card_id": 2,
 "title": "Sonne",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "... und es ward Licht.",
 "rule_title": "Himmelskörper",
 "rule": "Es gibt zwei Kartenstapel: Die Bibliothek mit Zaubersprüchen und die Ekliptik. In der Ekliptik müssen 7 Himmelkörper Deiner Wahl sein, wobei auch für Himmelskörper gilt, daß nur 3 gleiche Karten enthalten sein dürfen. Zusätzlich sind noch Raumzeitgefügekarten in der Ekliptik. In der Himmelsphase wird eine Karte von der Ekliptik gezogen; diese wird nicht auf die Hand genommen sondern direkt in die Welt gelegt (Himmelskörper) oder direkt abgelegt (Raumzeitgefüge). Von Deiner Bibliothek musst Du stets eine Karte in Deiner Zugphase ziehen, außer ein Effekt (z.B. Mantra der Reinheit) schreibt etwas anderes vor.",
 "token": "lmt3oLIhNXtR1MS21mKOwlU4Jl4qFjKNjeOOzKWLuQs=",
 "taken": true,
 "date": 0
},

{
 "card_id": 3,
 "title": "Jupiter",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->, Zahle einen Lebenspunkt: Füge ein Mana beliebiger Farbe zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Für Geschenke von Göttern zahlt man immer einen Preis.",
 "rule_title": "Mana",
 "rule": "Himmelskörper spenden dem Magier kosmische Energie: Mana. Es gibt farbloses Mana und Mana mit einer bestimmten Farbe. Es gibt 5 Farben in Incanta: Rot, Blau, Grün, Weiß und Schwarz. Die meisten Zaubersprüche erfordern einen bestimmten Anteil an farbigem Mana und einen Anteil an unbestimmten Mana, welches mit Mana beliebiger Farbe, oder farblosem Mana bezahlt werden kann. Wenn eine Karte es Dir erlaubt, beliebiges Mana Deinem Manavorrat hinzuzufügen, darfst Du Dir aussuchen, welche Farbe (auch farblos) es hat.",
 "token": "tBYkQYZatAneign9Yc0ajQ3gBTNEvnOHtlfzJVhQ03Y=",
 "taken": true,
 "date": 0
},

{
 "card_id": 4,
 "title": "Venus",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Gibt es Raum, ...",
 "rule_title": "Himmelsphase",
 "rule": "Himmelskörper sind keine Zaubersprüche und werden in der Himmelsphase direkt (ohne sie auf die Hand zu nehmen) in die Welt gelegt. Auf das Auslegen von Himmelskörpern darf man nicht antworten. In der Himmelsphase können keine Zaubersprüche beschworen werden und keine Effekte angewendet werden.",
 "date": 0
},

{
 "card_id": 5,
 "title": "Mars",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "... gibt es Ich und Du,",
 "rule_title": "Unzerstörbar",
 "rule": "Unzerstörbare Karten können nicht zerstört, nicht vernichtet und nicht aus der Welt entfernt werden. Allerdings kann man unzerstörbare Karten opfern. Wenn eine unzerstörbare Karte geopfert wird, wird sie aus der Welt entfernt.",
 "date": 0
},

{
 "card_id": 6,
 "title": "Saturn",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "... und Zeit im Nu.",
 "rule_title": "Mana mit gutem Grund",
 "rule": "Ein Magier darf kein Mana zu seinem Manavorrat hinzufügen, ohne einen guten Grund zu haben. Wenn ein Magier Mana generiert hat mit einem guten Grund, kann es aber nicht verwenden, dann darf sein Gegner es verwenden (Restmana). Kann der Gegner es nicht verwenden, verfällt es. Wenn ein Magier ausversehen Mana generiert hat, ohne einen guten Grund gehabt zu haben, wird das Generieren einfach rückgängig gemacht, als wäre es nie geschehen.<br>Wenn nötig gründe einen Rat, der herausfindet was gute Gründe sind.",
 "taken": true,
 "date": 0
},

{
 "card_id": 7,
 "title": "Mond",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Wo es Licht gibt, gibt es Widerschein.",
 "rule_title": "Ekliptik",
 "rule": "In der Ekliptik werden nachdem die 7 Himmelskörper (HK.) gemischt wurden 6 Raumzeitgefügekarten (RZG.) einsortiert und zwar nach folgendem Muster:<br>HK.<br>RZG.<br>HK.<br>RZG.<br>HK.<br>RZG.<br>HK.<br>RZG<br>HK.<br>RZG.<br>HK.<br>RZG.<br>HK.",
 "taken": true,
 "date": 0
},

{
 "card_id": 8,
 "title": "Raumzeitgefüge",
 "cost": "",
 "color": "sky",
 "type": "Zusammenhangserlebnis",
 "body": "",
 "strength": "",
 "extra": "Entweder alles auf einmal, oder gar nichts.",
 "rule_title":  "Bibliothek",
 "rule": "Eine Bibliothek besteht aus genau 46 oder genau 47 Karten (inklusive Mantra der Reinheit und Schicksal). Jede Bibliothek muß das Mantra der Reinheit beinhalten. Wer die letzte Regel ignoriert ist selbst schuld!",
 "token": "i4Jp634MW+dwd4L/tM9ATSIDl5ejRNdcdpcISGH/dw8=",
 "taken": true,
 "date": 0
},

{
 "card_id": 9,
 "title": "Weite",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Il cammino",
 "rule_title": "Länder",
 "rule": "Länder sind keine Zaubersprüche. Sie werden einfach in die Welt gelegt, aber nur in der Hauptphase. Auf das Auslegen eines Landes kann allerdings reagiert werden, denn Länder kommen mit der Geschwindigkeit eines Materiezaubers in die Welt. Du kannst in Deiner Hauptphase soviele Länder auslegen, wie du willst.",
 "date": 0
},

{
 "card_id": 10,
 "title": "Wald",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Standardländer",
 "rule": "Es gibt folgende Standardländer: Weite, Wald, Gebirge, Ozean, Singularität. Alle Standardländer sind beliebig oft pro Bibliothek erlaubt. Alle Nichtstandardländer (die keine Legenden sind) sind 3 mal pro Bibliothek erlaubt.",
 "token": "eGa6OZnl4fKqlCLJW9LVoHu1rOJvjzwQW/95/SsYUc8=",
 "taken": true,
 "date": 0
},

{
 "card_id": 11,
 "title": "Gebirge",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Kaskaden Beginn/Ausklang",
 "rule": "Jeder Magier kann, unter Beachtung der Phasenbeschränkung, Kaskaden beginnen und ausklingen lassen. Eine Kaskade klingt aus, wenn kein Magier mehr etwas hinzufügen will. Jeder Magier kann dann stets in der selben Phase eine neue beginnen. Beginnen und ausklingen lassen kann beliebig oft wiederholt werden.",
 "taken": true,
 "date": 0
},

{
 "card_id": 12,
 "title": "Ozean",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Turniere",
 "rule": "Auf Turnieren sind die offiziell veröffentlichten Karten (>=1,<=841, nur mit Titel) zugelassen. Vor und nach Turnierablauf prüft die Turnierleitung die Bibliotheken auf Regelgerechtigkeit. Dies hat vollkommen diskret und Datensicher zu geschehen. (Turnierregel)",
 "token": "TLAWiEl8Jo+jpPd4GYDuc53didPsXvJcH4Zim8D62N4=",
 "taken": true,
 "date": 0
},

{
 "card_id": 13,
 "title": "Singularität",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Das Land, das nie jemand sah, doch vielleicht durchschritt.",
 "rule_title": "Geistbegegnung",
 "rule": "Die wirkliche Begegnung ist geistiger Natur.<br><br><i>Länder werden vom Magier durch die Schriftwelt entdeckt, aber ihre Welterscheinung, als transzendentale Durchdringung, offenbart ihre kosmische Existenz.</i>",
 "token": "ow+1I7eSt0PitnYCK5HRbW0P1dA2GFb56n6cqh3jVnM=",
 "taken": true,
 "date": 0
},

{
 "card_id": 14,
 "title": "Saphirspiegel",
 "cost": "0",
 "color": "blue",
 "type": "Artefakt, Legende, Schicksal",
 "body": "Gilt als blaue Karte.<br>->: Füge ein blaues Mana zu Deinem Manavorrat hinzu.<br>Opfere den Saphirspiegel: Kontert einen Spontan- oder Unterbrechungszauber, der nicht 0 kostet.",
 "strength": "",
 "extra": "",
 "rule_title": "Schicksale",
 "rule": "Jeder Magier wählt sein Schicksal und die dazugehörige Schicksalskarte (blau, rot, grün, schwarz, weiß) und nimmt jene vor Beginn aus seiner Bibliothek in die Hand. Man darf nur eine Schicksalskarte wählen. Wenn man kein Schicksal wählt, würde die erste Schicksalskarte, die man von seiner Bibliothek ziehen würde, das Schicksal entscheiden.",
 "token": "7jWe1qMPmw+fU8oB5Hl92yFalT/BYtHjaDmsWGHERmg=",
 "date": 0
},

{
 "card_id": 15,
 "title": "Feueropal",
 "cost": "0",
 "color": "red",
 "type": "Artefakt, Legende, Schicksal",
 "body": "Gilt als rote Karte.<br>->: Füge ein rotes Mana zu Deinem Manavorrat hinzu.<br>Opfere den Feueropal: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Schicksalsfarbe",
 "rule": "Die Schicksalsfarbe eines Magiers ist durch die Farbe der ersten Schicksalskarte bestimmt, welche der Magier in die Hand nimmt. Zum Beispiel: Ein Magier der mit dem Saphirspiegel in seiner Hand die Begegnung beginnt, hat ein blaues Schicksal. Ein Magier der ohne ein Schicksal beginnt hat ein farbloses Schicksal. Wenn er später einen Feueropal zieht, so hat er ein rotes Schicksal.",
 "token": "RWoAGEvadLkgvdxmo+Tbg3ZEr6PzIbZsqmazBjsPouc=",
 "date": 0
},

{
 "card_id": 16,
 "title": "Erwachen",
 "cost": "0",
 "color": "green",
 "type": "Gewaltzauber, Legende, Schicksal",
 "body": "Gilt als grüne Karte.<br>Nimm einen Wald aus Deiner Bibliothek und lege ihn in die Welt. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Nur ein Schicksal",
 "rule": "Wenn ein Magier bereits ein Schicksal gewählt hat und es taucht für ihn eine weitere Schicksalskarte auf, wird jene sofort aus der Welt entfernt.",
 "token": "ZQU+cB/IOVyNTVLy8vPEBy0mP4C6Ze/Ppq/Mng3UVic=",
 "date": 0
},

{
 "card_id": 17,
 "title": "Nachtpfauenauge",
 "cost": "0",
 "color": "black",
 "type": "Verzauberung, Legende, Schicksal",
 "body": "Gilt als schwarze Karte.<br>_1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.<br>Opfere das Nachtpfauenauge: Füge 3 schwarze Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Materiezauber",
 "rule": "Es gibt folgende Materiezauber: Kreaturenzauber, Verzauberungszauber, Entzauberungszauber und Artefaktzauber. Alle Materiezauber sind auch Bleibekarten. Gezielte Verzauberungen/Entzauberungen werden auf ein Ziel beschworen, z.B. Kreaturenverzauberung, Artefaktentzauberung, Verzauberungsverzauberung, Magierverzauberung, etc.",
 "token": "eyLIO/+BKRxOjV4hqBMPVxNzKzNMr7OF33vdzXEcd+E=",
 "date": 0
},

{
 "card_id": 18,
 "title": "Goldener Avatar",
 "cost": "0",
 "color": "white",
 "type": "Kreatur, Legende, Schicksal",
 "body": "Gilt als weiße Karte.<br>_1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>Opfere den goldenen Avatar: Kontert einen Zauberspruch der nicht 0 kostet.",
 "strength": "0/1",
 "extra": "",
 "rule_title": "Kampf",
 "rule": "Mit Kreaturen greift man immer den gegnerischen Magier an, nicht direkt Kreaturen. Der Verteidigende Magier entscheidet selbst, ob und mit welchen Kreaturen er blocken will.<br><br><i>(δ766)</i>",
 "token": "M6PFljgPS8Ovm93xbf1pMjqW7yXVS28tcCzebCEXN3I=",
 "taken": true,
 "date": 0
},

{
 "card_id": 19,
 "title": "Tiger",
 "cost": "G",
 "color": "green",
 "type": "Kreatur",
 "body": "",
 "strength": "2/1",
 "extra": "Unbesiegbar!",
 "rule_title": "Kampfphase I",
 "rule": "Man kann mit Kreaturen angreifen, aber nur in der Kampfphase. Der Magier kann in seiner Hauptphase eine Angriffsphase deklarieren, die dann beginnt. Auf den Beginn der Angriffsphase darf geantwortet werden. Um zu verhindern, daß eine Kreatur angreifen kann, könnte man sie nun ankanten. Dann kommt die Bennenung: Der Angreifer benennt alle seine Angriffskreaturen und kantet sie an. Der Verteidiger benennt alle seine blockenden Kreaturen. Mehrere Kreaturen können eine angreifende Kreatur blocken. Während dieser Benennung darf nicht gezaubert -, noch Effekte aktiviert werden. Nach der Bennenung können Schnelleffekte beschworen werden.",
 "date": 0
},

{
 "card_id": 20,
 "title": "Feuerelementar",
 "cost": "R",
 "color": "red",
 "type": "Kreatur",
 "body": "Selbstvernichtung: Füge einem Ziel einen Schaden zu.",
 "strength": "1/1",
 "extra": "Ein Flämmchen nur, doch meins.",
 "rule_title": "Kampfphase II",
 "rule": "Bevor die Kampfphase endet werden alle Schnelleffekte abgewickelt. Kreaturen, die jetzt entfernt oder angekantet werden blocken trotzdem noch. Sie machen dann allerdings keinen Schaden. Falls eine angreifende Kreatur entfernt wird, so kann die blockende Kreatur nicht eine andere Kreatur blocken. Das Ankanten eines Angreifers ändert nun nichts mehr. Dann wird der Kampfschaden verrechnet: Alle Blocker und Angreifen fügen sich gegenseitig jeweils die Stärke als Schaden zu. Am Ende der Kampfphase werden dann alle Kreaturen, die 0 oder weniger Widerstandskraft haben, zerstört.",
 "date": 0
},

{
 "card_id": 21,
 "title": "Göttin des Krieges",
 "cost": "SS3",
 "color": "black",
 "type": "Kreatur",
 "body": "Fliegt. Lege ein +1/+1 Signum auf die Göttin des Krieges am Ende der Teilrunde, für jede Kreatur, der sie in dieser Teilrunde Schaden zugefügt hat.",
 "strength": "4/4",
 "extra": "Herrin über Leben und Tod, Hüterin des magischen Schlüssels.",
 "rule_title": "",
 "rule": "<br><br><i>„Saol na saol,<br>Tús go deireadh.<br>Tá muid beo<br>Go deo.“</i>",
 "taken": true,
 "date": 0
},

{
 "card_id": 22,
 "title": "Portugiesische Galeere",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur",
 "body": "Unblockbar.",
 "strength": "0/1",
 "extra": "Was für ein Biest.",
 "rule_title": "Gedanke",
 "rule": "...",
 "date": 0
},

{
 "card_id": 23,
 "title": "Pegasos",
 "cost": "W",
 "color": "white",
 "type": "Kreatur",
 "body": "Fliegt. Kann nicht angreifen.",
 "strength": "0/3",
 "extra": "Den Gerechten zu Diensten.",
 "rule_title": "(δ23)",
 "rule": "(δ23)",
 "date": 0
},

{
 "card_id": 24,
 "title": "Befriedung",
 "cost": "W",
 "color": "white",
 "type": "Kreaturenverzauberung",
 "body": "Die Kreatur kann weder angreifen noch blocken.",
 "strength": "",
 "extra": "Wozu all der Ärger?",
 "rule_title": "Karge Zeiten",
 "rule": "Ein angekantetes Land kann kein Mana verwandeln.",
 "date": 0
},

{
 "card_id": 25,
 "title": "Stärke",
 "cost": "G",
 "color": "green",
 "type": "Kreaturenverzauberung",
 "body": "Die Kreatur erhält +2/+1 oder +1/+2; lege dies bei der Beschwörung fest.",
 "strength": "",
 "extra": "",
 "rule_title": "Nicht freiwillig",
 "rule": "Das Zurückstellen der Karten in der Erneuerungsphase ist nicht freiwillig, man muß grundsätzlich alle Karten zurückstellen (außer Effekt schränken das ein).",
 "date": 0
},

{
 "card_id": 26,
 "title": "Bestialisierung",
 "cost": "R",
 "color": "red",
 "type": "Kreaturenverzauberung",
 "body": "Die Kreatur erhält +3/+3. In Deiner Versorgungsphase lege einen -1/-1 Signum auf die Kreatur.",
 "strength": "",
 "extra": "Immerhin stirbt es nun schneller.",
 "rule_title": "Signa",
 "rule": "Ein Signum ist ein Spielstein/Markierungsstein, der auf Bleibekarten gelegt wird. Die Bedeutung der Signa wird durch die Zauber festgelegt, durch die sie in die Welt gekommen sind.",
 "date": 0
},

{
 "card_id": 27,
 "title": "Verhexung",
 "cost": "S",
 "color": "black",
 "type": "Kreaturenverzauberung",
 "body": "Der Beherrscher der Kreatur erhält einen Schaden in seiner Versorgungsphase.",
 "strength": "",
 "extra": "",
 "rule_title": "Schwergewichte",
 "rule": "Himmelskörper gelten zwar als Bleibekarten, können aber niemals auf die Hand genommen werden.",
 "date": 0
},

{
 "card_id": 28,
 "title": "Astralschild",
 "cost": "B",
 "color": "blue",
 "type": "Kreaturenverzauberung, Wunder",
 "body": "Für zusätzliche Beschwörungskosten von _2_ kannst Du das Astralschild spontan beschwören. Opfere das Astralschild: Kontert ein Ereignis, das die Kreatur bezielt. Du kannst das Astralschild als ungezielte Verzauberung beschwören und später eine Kreatur als verzaubert beschwören.",
 "strength": "",
 "extra": "",
 "rule_title": "Gipfelturnier II",
 "rule": "Auf einem Gipfelturnier sind 2 Karten (Tabukarten), die auf der INCANTATA-Seite benannt werden, nicht erlaubt. Zudem muß der Bibliothekskeller genau 12 Karten enthalten. Turniergroßmagier ist, wer jemals ein Gipfelturnier gewonnen hat. Dem Gewinner sind die beiden Tabukarten, die dann nach Turniegewinn die doppelte Selbstidentität darstellen, für immer reserviert - dies geschieht ganz ideell und ohne Übergabe eines materiellen Preises. (Turnierregel)",
 "date": 0
},

{
 "card_id": 29,
 "title": "Geisteskraft",
 "cost": "R",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier werfen alle Handkarten ab und ziehen ebensoviele neue.",
 "strength": "",
 "extra": "Sie fliegt dahin, wer kann sie fassen?",
 "rule_title": "Gipfelturnier I",
 "rule": "Das Gipfelturnier kann nur einmal pro Jahr als Wirklichkeitsbegegnung ausgetragen werden. Es müssen 2 von Incantato ernannte Schiedsrichter anwesend sein (auch möglich per Videoübertragung). Das Turnier wird mit 10 Magiern, gemäß den Regeln des Gildenduelles ausgetragen. Bei jeder Begenung muß ein Schiedsrichter anwesend sein. Ein Gleichstand mehrerer Magier muß mit Duellen entschieden werden bis der Turniergewinner feststeht. (Turnierregel).",
 "date": 0
},

{
 "card_id": 30,
 "title": "Schwächeanfall",
 "cost": "S",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Eine Kreatur erhält temporär -2/-2.",
 "strength": "",
 "extra": "",
 "rule_title": "Trugbilder",
 "rule": "Trugbilder sind nichtmaterielle Bleibekarten. Wenn nicht anders angegeben bleiben sie bis zum Ende der Kaskade erhalten. Trugbilder kann man sich als Verzauberungen der Ideenwelt vorstellen. Der Effekt des Trugbildes gilt ab dessen Beschwörungsstelle in der Kaskade.",
 "date": 0
},

{
 "card_id": 31,
 "title": "Rückhalt",
 "cost": "G",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Zahle zusätzliche Beschwörungskosten von _1_ um Rückhalt als Spontanzauber zu beschwören.<br>Enferne eine Verzauberung aus der Welt; wirkt nicht auf Schicksale.",
 "strength": "",
 "extra": "",
 "rule_title": "Selbsterhalt",
 "rule": "Ein Magier kann sich nicht direkt selber schädigen, wenn es keinem Zweck dient. Bedenke dabei, daß die Gesamtbalance eine große Rolle spielt. Dies gilt insbesondere auch, wenn er noch ein Platzwechsel plant oder die Kontrolle über einen anderen übernommen hat. Auch kann ein Magier sich nicht selbstschädigen, um die Begegnung zu beenden.<br>Jeder Magier sollte stets seine Seelenaushauchung versuchen zu verhindern. Im Zweifel sollten die anderen Magier auf Möglichkeiten hinweisen, die eine Seelenaushauchung verhindern oder verschieben könnten. Falls eine Seelenaushauchung unvermeidlich sein sollte, so darf ein Magier sie selbst auslösen, falls er auch noch einen oder mehrere Gegner mit zu Märtyrer machen kann.",
 "date": 0
},

{
 "card_id": 32,
 "title": "Rücknahme",
 "cost": "B",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Eine Bleibekarte wird von ihrem Besitzer zurück auf die Hand genommen.",
 "strength": "",
 "extra": "Als hätte es nie existiert.",
 "rule_title": "Lebenspunkte zahlen",
 "rule": "Wenn zum Zahlen von Lebenspunkten aufgefordert wird, kann dieser Verlust weder verhindert noch umgeleitet werden.",
 "date": 0
},

{
 "card_id": 33,
 "title": "Lebenskraft",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Alle Magier erhalten 4 Lebenspunkte.",
 "strength": "",
 "extra": "Ein Funken Beginn.",
 "rule_title": "Ideenwelt",
 "rule": "Die Ideenwelt war schon immer da. Alle Zaubersprüche, die beschworen werden, und gegebenenfalls Kopien von Zaubersprüchen, tauchen in der Ideenwelt auf. Eine Unterideenwelt ist eine volle INCANTATA-Kaskade. Gekonterte Zaubersprüche verbleiben in der Ideenwelt, werden aber als gekontert markiert. Wenn die INCANTATA-Kaskade abgewickelt ist wird die Ideenwelt erneuert, das heißt, daß eine neue leere Unterideenwelt eröffnet wird. Alle vorherigen Unterideenwelten verbleiben entsprechend. Die Ideenwelt existiert immerfort.",
 "date": 0
},

{
 "card_id": 34,
 "title": "Agression",
 "cost": "G",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Eine Kreatur erhält temporär +3/+3.",
 "strength": "",
 "extra": "Wer hat denn angefangen?",
 "rule_title": "Zweigkaskaden",
 "rule": "Wenn man auf ein Ereignis einer Kaskade (Stammkaskade) antwortet, aber die Antwort schneller ist, als das Zielereignis, entsteht eine Zweigkaskade. Wenn alle Magier mit dem Zaubern fertig sind und keine weitere Anwort mehr gezaubert wird, bilden alle Zweigkaskaden und die Stammkaskade eine INCANTATA-Kaskade (kurz Kaskade). Nun werden die Zweigkaskaden und die Stammkaskade (zuerst schnell, dann langsam) abgewickelt („zuletzt herein - zuerst hinaus“). Ein einzelnes Ereignis ist auch eine Kaskade, allerdings nur mit einem Teil.",
 "date": 0
},

{
 "card_id": 35,
 "title": "Blitz",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel drei Schaden zu.",
 "strength": "",
 "extra": "Britzel!",
 "rule_title": "Verpuffen",
 "rule": "Falls das Ziel eines Zauberspruches verschwunden ist, verpufft dieser und wird in die Unterwelt abgelegt.<br><br><i>Können denn drei sich je einig sein? Und wenn ja - wo?</i>",
 "token": "9OL6wi5FQavGbj/gBWmvIF0ubjDShrgB4H1HbEfpj1k=",
 "taken": true,
 "date": 0
},

{
 "card_id": 36,
 "title": "Loslassen",
 "cost": "B",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Eine Kreatur kann temporär fliegen. Ziehe eine Karte.",
 "strength": "",
 "extra": "Vergiß doch einfach, daß es die Schwerkraft gibt.",
 "rule_title": "Formeln",
 "rule": "Alle Zaubersprüche, die nicht den Typ Legende, Wunder, Verdammnis, Vielheit, Einmaligkeit, Zusammenhangserlebnis oder Einzigartigkeit haben, sind Formeln (Zauberformel). Formeln sind je 3 mal pro Bibliothek erlaubt.",
 "date": 0
},

{
 "card_id": 37,
 "title": "Glitzerstrahl",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber, Legende",
 "body": "Ein Magier erhält 6 Lebenspunkte, wenn er 0 oder weniger Lebenspunkte hat.",
 "strength": "",
 "extra": "In der dunkelsten Stunde werde ich für Dich da sein.",
 "rule_title": "Ende der Begegnung",
 "rule": "Eine Begegnung kann auf 2 Arten für einen Magier enden: 1. Der Magier hat keine Lebenspunkte mehr am Ende einer Teilrunde. 2. Der Magier kann keine Karte mehr von seiner Bibliothek ziehen, wenn sie dies tun müsste. (Dies bezieht sich nur auf Magier, die von Anfang an dabei waren). Die Große Begegnung endet, wenn 2 Magier gegenüber eines Magier Märtyrer sind. Diejenigen Magier, die am Ende der Begegnung nur Märtyrer als Gegner haben, werden Lichtbringer genannt.",
 "date": 0
},

{
 "card_id": 38,
 "title": "Persönliche Angelegenheit",
 "cost": "S",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Entferne eine Kreatur Deines Gegners aus der Welt; Erhalte soviel Schaden wie die Kreatur Stärke hatte.",
 "strength": "",
 "extra": "Richtig! Dich vernicht’ ich.",
 "rule_title": "Manaschummelei",
 "rule": "Wer sich das passende Mana erschummelt und erwischt wird, soll sich schämen.",
 "date": 0
},

{
 "card_id": 39,
 "title": "Tulpe",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Wunder",
 "body": "->, _1_, Opfere die Tulpe: Füge ein schwarzes, rotes oder blaues Mana zu Deinem Manavorrat hinzu; Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Universum",
 "rule": "Das INCANTATA-Universum besteht aus der Summe aller 7-1 Welten: Ideenwelt, Schriftwelt, Gedankenwelt, Unterwelt, Welt, Kosmos und Unwelt. „Deine Teilwelt“ ist synonym mit „Deine Welt“, sowie „Deine Teilunterwelt“ synonym ist mit „Deine Unterwelt“, etc. . Nachdem man das Mantra der Reinheit aus dem Spiel entfernt hat, wird das INCANTATA-Universum zum Universum. Diese Tranformation wird Rückgängig gemacht, nachdem die Begegnung geendet hat.",
 "date": 0
},

{
 "card_id": 40,
 "title": "Kontrolle",
 "cost": "W",
 "color": "white",
 "type": "Unterbrechungszauber",
 "body": "Übernehme die Kontrolle über einen Unterbrechungszauber.<br>_1_: Vergessen.",
 "strength": "",
 "extra": "Wie frei ihr euch doch gleich fühlt.",
 "rule_title": "Existenz",
 "rule": "Existierende INCANTATA-Regeln gelten auch wenn sie nicht sichtbar sind.",
 "date": 0
},

{
 "card_id": 41,
 "title": "Seelengift",
 "cost": "S",
 "color": "black",
 "type": "Spontanzauber, Legende",
 "body": "Ein Zauberspruch oder Effekt, der Lebenspunkte gibt oder die Widerstandskraft einer Kreatur erhöht, verursacht stattdessen Schaden oder verringert die Widerstandskraft der Kreatur.",
 "strength": "",
 "extra": "Ein Tröpfchen nur, und siehe wie du mir dienest.",
 "rule_title": "INCANTATA-Krypto-Universum",
 "rule": "Das INCANTATA-Krypto-Universum ist genauso strukturiert wie das INCANTATA-Universum. Logischerweise ist das INCANTATA-Krypto-Universum im Krypto-Universum und das INCANTATA-Universum in der Wirklichkeit. Je nach Art des INCANTATA-Krypto-Universums können Karten fehlen, die in der Wirklichkeit sind. Oder aber Karten, die in der Wirklichkeit nicht existieren, können in einem bestimmten INCANTATA-Krypto-Universum vorhanden sein.",
 "date": 0
},

{
 "card_id": 42,
 "title": "Naturgeist",
 "cost": "GGG4",
 "color": "green",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Verursacht Durchbruchsschaden.<br>Wenn der Naturgeist Ziel eines Zauberspruches wird, erhält sie +2/+1 bis zum Ende der Teilrunde.",
 "strength": "7/7",
 "extra": "Ich erkenn’s, ihr wäret gern wie ich.",
 "rule_title": "Inkarnation",
 "rule": "Eine Inkarnation darf man nur beschwören, wenn man das dazu passende Schicksal hat. Dabei ist nicht entscheidend, ob es noch in der Welt ist.",
 "token": "/KdR/HNwNWZnU5eDp02eVGfWUrz/PaGcb/UC3KCJ4Kw=",
 "taken": true,
 "date": 0
},

{
 "card_id": 43,
 "title": "Lebensgeist",
 "cost": "G",
 "color": "green",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen blauen Zauberspruch.<br>_2_: Vergessen.",
 "strength": "",
 "extra": "Du gleichst dem Geist, den Du begreifst.",
 "rule_title": "Vergessen",
 "rule": "Eine Karte mit dem Effekt „Vergessen“ kann abgelegt werden, um eine neue Karte zu ziehen. Beispiel: 2: Vergessen -> zahle 2 beliebige Mana und lege die Karte ab; ziehe eine neue Karte.",
 "date": 0
},

{
 "card_id": 44,
 "title": "Einwand",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Unterbrechungszauber.<br>_2_: Vergessen.",
 "strength": "",
 "extra": "Der messerscharfer Verstand macht den Unterschied.",
 "rule_title": "Vollkommen",
 "rule": "Kündige an, welcher der entscheidende Zauber sein wird. Wenn dieser Zauber am Ende der Entscheidende ist, gilt diese Begegnung als besonders vollkommen.",
 "date": 0
},

{
 "card_id": 45,
 "title": "Erscheinung",
 "cost": "WWW4",
 "color": "white",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Fliegt.<br>->, _R__R_: Füge einem Ziel 2 Schaden zu.<br>_G_: Temporär +2/+0",
 "strength": "0/9",
 "extra": "Blasphemie... beizeiten verzeihlich.",
 "rule_title": "Zauberpause",
 "rule": "In der Erneuerungs-, Zug- und Himmelsphase dürfen keine Zaubersprüche beschworen und auch keine Effekte aktiviert werden. In der Ablegephase dürfen keine Zaubersprüche beschworen werden.",
 "date": 0
},

{
 "card_id": 46,
 "title": "Lichtbringer",
 "cost": "SSS4",
 "color": "black",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Verursacht Durchbruchsschaden.<br>->: Entferne eine angekantete Kreatur aus der Welt.",
 "strength": "7/7",
 "extra": "Man hat mich stets falsch verstanden.",
 "rule_title": "Welt",
 "rule": "Es gibt Karten in der Welt (beschworene oder gelegte Bleibekarten), Karten außerhalb der Welt (in der Hand, Bibliothek oder Unterwelt) und Karten, die aus der Welt enfernt sind.<br><br><i>„Also sprach Zarathustra.“</i>",
 "token": "tSmAl/Wsus6jepcp3meh2ccd5lCYKfCNKOkBHPP4HiE=",
 "taken": true,
 "date": 0
},

{
 "card_id": 47,
 "title": "Leviathan",
 "cost": "BBB4",
 "color": "blue",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Vernichte den Leviathan, wenn Du keinen Ozean kontrollierst. Verursacht Durchbruchsschaden. _B_, Opfere einen Ozean: Kontert einen Zauberspruch, der den Leviathan als Ziel hat.",
 "strength": "7/7",
 "extra": "Er hat stets eine passende Antwort.",
 "rule_title": "Offizielle Version",
 "rule": "Die offiziell zulässige Version ist jene auf der offiziellen INCANTATA-0Net-Seite. Wenn eine ältere Karte benutzt wird, so wirkt sie so wie die offizielle aktuelle Version. Auf Turnieren sind nur aktuelle Karten erlaubt.",
 "date": 0
},

{
 "card_id": 48,
 "title": "Drache",
 "cost": "RRR4",
 "color": "red",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Fliegt.<br>->, _R__R_: Füge einem Ziel 2 Schaden zu.",
 "strength": "8/8",
 "extra": "Entgegen den Gerüchten habe ich keine schwache Stelle.",
 "rule_title": "Effektantworten",
 "rule": "Auf Effekte von Bleibekarten kann geantwortet werden. Mit einem Zauberspruch kann geantwortet werden, wenn die Geschwindigkeit gleich oder höher der des Bleibekarteneffektes ist.",
 "date": 0
},

{
 "card_id": 49,
 "title": "Stärkeprinzip",
 "cost": "R",
 "color": "red",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen blauen Zauberspruch.<br>_2_: Vergessen.",
 "strength": "",
 "extra": "Am Ende besiegt der Geist das Schwert? Dass ich nicht lache!",
 "rule_title": "Hoffentlich Höflich",
 "rule": "Wenn in einer Begegung ein Magier angehalten wird einen Zauberspruch zu kontern, gilt es als besonders höflich dies in höfisch-höflicher Form zu tun. Also zum Beispiel: Majestät/ Durchlaucht/ Hochwohlgeboren! So kontert doch diesen Zauberspruch!",
 "token": "ZRkBR6KLJLQF5CZsJGzcwmhPj2yHz5dT5N6eoYs0mvE=",
 "taken": true,
 "date": 0
},

{
 "card_id": 50,
 "title": "Gluthammer",
 "cost": "RRX",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Kann nicht gekontert werden.<br>Füge einem Ziel X Schaden zu.",
 "strength": "",
 "extra": "",
 "rule_title": "Quellenergien",
 "rule": "Es gibt 9 Quellenergien, die Dinge hervorbringen im INCANTATA-Universum: Erdenergie (bringt Länder hervor - gelten als farblos), Kosmische Energie (bringt Himmelskörper & RZG hervor - gelten als farblos), Blau, Grün, Weiß, Schwarz, Rot, Lichtschwarz, Lichtweiß (von jeder Farbe), Lichtgrau (von jeder Farbe und farblos) und Schattenweiß. Erd- und Kosmische Energie vereint bringt farblose Artefakte hervor. ",
 "date": 0
},

{
 "card_id": 51,
 "title": "Racheengel",
 "cost": "WW3",
 "color": "white",
 "type": "Kreatur",
 "body": "Zählt auch als schwarze Karte.<br>Fliegt.<br>Wird für den Angriff nicht angekantet.",
 "strength": "4/4",
 "extra": "Nun ist es an dir.",
 "rule_title": "Briefe an Unbekannte",
 "rule": "Wenn Du/Dir groß geschrieben ist, so ist der Magier selbst angesprochen.<br><br><i>δ&#8328;&#8324;&#8321;... δ&#8326;&#8326;&#8326; ... δ&#8328;&#8324;&#8321; ... δ&#8326;&#8326;&#8326; ... δ&#8328;&#8324;&#8321; ... δ&#8326;&#8326;&#8326; ... δ&#8328;&#8324;&#8321;.</i>",
 "token": "bTAz9qAtBQ9bmKE4NtnFjGMmqEgZdXELKk0Xvv0LQMg=",
 "taken": true,
 "date": 0
},

{
 "card_id": 52,
 "title": "Goldkarpfen",
 "cost": "G2",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Immer wenn der Goldkarpfen Ziel eines Zauberspruches wird, ziehe eine Karte.",
 "strength": "1/1",
 "extra": "Freundschaft ist golden.",
 "rule_title": "Kartenrestriktionen",
 "rule": "Legenden, Einzigartigkeiten, u.a. sind einmal pro Bibliothek erlaubt. Wunder sind zweimal erlaubt. Vielheiten sind beliebig oft erlaubt. Raumzeitgefüge sind 6 mal erlaubt. Alle anderen Karten 3 mal pro Bibliothek erlaubt.",
 "token": "fl8nebcmamXbj08u7Q8j8PUP/3bTcykR8jgR2/2XG2s=",
 "taken": true,
 "date": 0
},

{
 "card_id": 53,
 "title": "Wellenpferde",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Ein Ozean wird zu einer 3/3 Kreatur, bleibt aber auch weiterhin ein Ozean.",
 "strength": "",
 "extra": "Sie erhoben sich plötzlich und bäumten sich auf, wie gewaltige Schlachtrösser.",
 "rule_title": "Die Große Begegnung I",
 "rule": "Bei der großen Begegnung spielen 5 Magier an einem Tisch in Pentagramformation. Die jeweilig gegenübersitzenden Magier sind Gegner. Die Lichtbringer (jene, die am Ende der Begegnung nur noch Märtyrer als Gegner haben) erhalten keinen Märtyrerpunkt. Alle Magier, die noch Lebenspunkte haben, aber noch mindestens einen handlungsfähigen Gegner haben, erhalten einen Märtyrerpunkt - sie heißen Überlebende. Alle anderen Magier (mit 0 oder weniger Lebenspunkte) erhalten 3 Märtyrerpunkte.",
 "token": "QNT6q9xFGjaOn6r8iP4qKd7+nMBhs/SZ8n/p/9RKs0g=",
 "taken": true,
 "date": 0
},

{
 "card_id": 54,
 "title": "Apfelbaum",
 "cost": "G2",
 "color": "green",
 "type": "Kreatur",
 "body": "",
 "strength": "3/4",
 "extra": "",
 "rule_title": "Die Große Begegnung II",
 "rule": "Die Sitzplätze für jede große Begegnung wird vorher per Los bestimmt. Mit Kreaturen darf man nur seine Gegner angreifen, für Zaubersprüche und Effekte gibt es keine Einschränkung.",
 "token": "SLH0j+5HTXhcOWB24r7yWrGGhTPrpcFP5Zru0IqhqyE=",
 "taken": true,
 "date": 0
},

{
 "card_id": 55,
 "title": "Sturmramme",
 "cost": "5",
 "color": "artifact",
 "type": "Artefakt, Kreatur",
 "body": "Die Sturmramme muß angreifen.",
 "strength": "5/4",
 "extra": "Ein probates Mittel.",
 "rule_title": "Materiezauber",
 "rule": "Wenn ein Materiezauber gelungen ist (=verwirklicht ist), manifestiert er sich als Bleibekarte in der Welt und wird (je nach Kartentyp) zu Kreatur, Artefakt, Verzauberung oder Entzauberung.",
 "date": 0
},

{
 "card_id": 56,
 "title": "Unterbrechung",
 "cost": "WW",
 "color": "white",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch.",
 "strength": "",
 "extra": "Weisheit klingt in Narrenohren wie Wahnsinn.",
 "rule_title": "Antworten",
 "rule": "Es gibt 7 Zauberspruchgeschwindigkeiten (langsam->schnell):<br>∘ Materiezauber (Bleibekarten)<br>∘ Gewaltzauber<br>∘ Spontanzauber<br>∘ Unterbrechungszauber<br>∘ Energiezauber<br>∘ Traumzauber<br>∘ Gleichzeitigkeitszauber<br>Man kann auf einen Zauberspruch nur antworten, wenn der Antwortzauber mindestens genauso schnell ist. Der Erste und alle Zaubersprüche, die als Antwort beschworen wurden, bilden eine Kaskade. Kaskaden werden „zuletzt herein - zuerst hinaus“ abgewickelt. Siehe auch: Zweigkaskaden",
 "date": 0
},

{
 "card_id": 57,
 "title": "Jenseitsruf",
 "cost": "S1",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Vernichte eine nichtschwarze Kreatur.",
 "strength": "",
 "extra": "Keine Sorge, es wird dir dort gefallen.",
 "rule_title": "Vernichten",
 "rule": "Wird eine Kreatur vernichtet wird sie in die Unterwelt gelegt und kann nicht wiederbelebt werden.",
 "date": 0
},

{
 "card_id": 58,
 "title": "Tödlicher Funke",
 "cost": "RR1",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Zerstöre eine Kreatur.",
 "strength": "",
 "extra": "Manchmal reicht ein Funke.",
 "rule_title": "Zerstören",
 "rule": "Eine zerstörte Kreatur wird in die Unterwelt gelegt, sofern sie nicht wiederbelebt wird.",
 "date": 0
},

{
 "card_id": 59,
 "title": "Erschwernis",
 "cost": "B1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch, wenn dessen Beherrscher nicht _3_ zahlt.",
 "strength": "",
 "extra": "Wie wird mir - das Denken wird mir lahm...",
 "rule_title": "Kontern",
 "rule": "Ein gekontertes Ereignis kommt nicht in die Welt, beziehungsweise wirkt nicht, wird also nicht verwirklicht. Falls es ein Zauberspruch war, wird die betreffende Karte einfach abgelegt. Bereits aufgewendete Beschwörungskosten werden nicht zurückgenommen.",
 "date": 0
},

{
 "card_id": 60,
 "title": "Talisman",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber, Legende",
 "body": "Wähle einen der folgenden Effekte ∘ Du erhältst 3 Lebenspunkte. ∘ Eine Kreatur erhält temporär +2/+1. ∘ Alle Deine Kreaturen erhalten temporär +0/+1. Ziehe eine Karte.",
 "strength": "",
 "extra": "Er wird Euch stets von Nutzen sein.",
 "rule_title": "Widerrechtlich",
 "rule": "Es ist nicht möglich, sich INCANTATA-Karten widerrechtlich anzueignen.",
 "date": 0
},

{
 "card_id": 61,
 "title": "Schamane",
 "cost": "G",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "->: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Effekte von Bleibekarten",
 "rule": "Effekte von Bleibekarten werden mit Spontanzaubergeschwindigkeit aktiviert, somit kann man nur mit Zaubersprüchen oder Effekten mindestens gleicher Geschwindigkeit antworten.<br>Es gibt folgende Ausnahmen:<br>∘ Karteneffekte die Mana produzieren oder verwandeln: Energiezaubergeschwindigkeit.<br>∘ Karteneffekte, die kontern können:<br> Unterbrechungszaubergeschwindigkeit.",
 "date": 0
},

{
 "card_id": 62,
 "title": "Flaschengeist",
 "cost": "B2",
 "color": "blue",
 "type": "Kreatur",
 "body": "Fliegt.<br>Der Flaschengeist fügt Dir in Deiner Versorgungsphase einen Schaden zu.",
 "strength": "3/4",
 "extra": "Ich sagte: „Nun müssen wir beide sterben!“ Und er sagte: „Was soll ich machen, es ist meine Natur.“",
 "rule_title": "Phasen",
 "rule": "In jeder Teilrunde gibt es 7 mögliche Phasen:<br>∘ Erneuerungsphase<br>∘ Himmelsphase<br>∘ Versorgungsphase<br>∘ Zugphase<br>∘ Hauptphase<br>∘ Angriffsphase (innerhalb der Hauptphase)<br>∘ Ablegephase<br><br>Phasenwechsel passieren mit Spontanzaubergeschwindigkeit.",
 "date": 0
},

{
 "card_id": 63,
 "title": "Glückszauber",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber, Legende",
 "body": "Wähle einen der folgenden Effekte ∘ Verhindere bis zu 3 Schaden aus einer Quelle. ∘ Erhalte einen Lebenspunkt je Quelle, die Dir diese Teilrunde Schaden zugefügt hat. ∘ Kontert einen Zauberspruch oder aktivierbaren Effekt, wenn dessen Beherrscher nicht _1_ zahlt.",
 "strength": "",
 "extra": "",
 "rule_title": "Zauberglück",
 "rule": "Das Mischen der Raumzeitgefüge vor dem Zusammenschichten der Ekliptik ist empfohlen.",
 "taken": true,
 "date": 0
},

{
 "card_id": 64,
 "title": "Fledermaus",
 "cost": "S",
 "color": "black",
 "type": "Kreatur",
 "body": "Fliegt.",
 "strength": "1/1",
 "extra": "Wie eine fliegende Ratte, bloß noch häßlicher.",
 "rule_title": "Beschwörungstaumel",
 "rule": "Neu beschworene Kreaturen leiden unter Beschwörungstaumel. Das heißt: Kreaturen, die nicht bereits vor Beginn der Teilrunde in der Welt waren, können weder angreifen noch Effekte aktivieren, die ein Ankanten erfordern. Allerdings sind Effekte sofort verfügbar, die kein Ankanten erfordern.",
 "date": 0
},

{
 "card_id": 65,
 "title": "Kriegstrommeln",
 "cost": "R2",
 "color": "red",
 "type": "Verzauberung",
 "body": "Alle Deine angreifenden Kreaturen erhalten +1/+0.",
 "strength": "",
 "extra": "Dong Do-Do Do-Do Dong Do-Do Do-Do...",
 "rule_title": "Temporär",
 "rule": "Ein temporärer Effekt hält nur bis zum Ende der Teilrunde an. Falls in einem Satz mehrere Effekte mit einem Vorangehenden „temporär“ attribuiert werden, so sind alle Effekte dieses Satzes temporär.",
 "date": 0
},

{
 "card_id": 66,
 "title": "Heilgarten",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Wunder",
 "body": "->, _2_: Füge Dir einen Lebenspunkt hinzu.",
 "strength": "",
 "extra": "An diesem Ort ist alles heilsam.",
 "rule_title": "Begegnung",
 "rule": "Eine Partie INCANTATA wird „Begegnung“ genannt.",
 "date": 0
},

{
 "card_id": 67,
 "title": "Aufklärung",
 "cost": "W1",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Zerstöre ein Artefakt, eine Verzauberung oder eine Entzauberung.",
 "strength": "",
 "extra": "Glaube mir, deine Unmündigkeit ist selbstverschuldet.",
 "rule_title": "Schicksalszerstörung",
 "rule": "Natürlich kann man Schicksale zerstören; es wird aber auf Dich zurückfallen, und zwar auf schicksalhafte Weise.",
 "date": 0
},

{
 "card_id": 68,
 "title": "Pesthauch",
 "cost": "S1",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Alle Magier und alle Kreaturen erhalten einen Schaden.",
 "strength": "",
 "extra": "Und das war nur der Vorgeschmack!",
 "rule_title": "Gewaltzauber",
 "rule": "Gewaltzauber sind mächtige Zaubersprüche, die ein Magier nur in seiner Hauptphase - außerhalb der Kampfphase - beschwören kann. Bedenke, daß man Gewaltzauber auch als Antwort beschwören kann.",
 "date": 0
},

{
 "card_id": 69,
 "title": "Plasmastoß",
 "cost": "RX",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Füge einem Ziel X Schaden zu, dieser Schaden kann nicht verhindert oder umgelenkt werden.",
 "strength": "",
 "extra": "Der Geist ist ein Feuer, dessen Flamme der Gedanke ist.",
 "rule_title": "Phasenbeschränkung I",
 "rule": "Gewaltzauber und Materiezauber können nur in der Hauptphase - außerhalb der Kampfphase - beschworen werden. Das Auslegen von Ländern unterliegt auch dieser Phasenbeschränkung.",
 "date": 0
},

{
 "card_id": 70,
 "title": "Lüge",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Eine Bleibekarte, falls angekantet, wird zurückgestellt - falls nicht angekantet, angekantet; Ziehe eine Karte.",
 "strength": "",
 "extra": "Eine folgt der anderen.",
 "rule_title": "Valide",
 "rule": "Ein valides Ziel für Schaden ist ein Magier oder eine Kreatur.",
 "date": 0
},

{
 "card_id": 71,
 "title": "Lebensspende",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Zusätzliche Beschwörungskosten≔ Zahle einen Lebenspunkt.<br>Wiederbelebe eine Kreatur; Ziehe eine Karte.",
 "strength": "",
 "extra": "Dich lass ich nicht im Stich!",
 "rule_title": "Farbwechsel",
 "rule": "Die Änderung der Farbe einer Karte bleibt erhalten, auch wenn sie auf die Hand, in der Bibliothek oder in die Unterwelt kommt; nicht jedoch wenn sie aus der Welt entfernt wird oder in die Hölle kommt.",
 "date": 0
},

{
 "card_id": 72,
 "title": "Giftpfeil",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Eine Kreatur erhält einen Schaden; Zerstöre diese Kreatur, wenn sie in dieser Teilrunde erneut Schaden erhält.",
 "strength": "",
 "extra": "Einer vermag ein Schwert zu schmieden, ein anderer vermag es zu nuzten.",
 "rule_title": "Ausfüllen",
 "rule": "Eine Karte mit einem Ausfüllfeld „______“ ist nur gültig, wenn es vor der Begegnung ausgefüllt wurde.",
 "date": 0
},

{
 "card_id": 73,
 "title": "Himmelsstürmer",
 "cost": "BB3",
 "color": "blue",
 "type": "Kreatur",
 "body": "Nachwirkung≔ Kante alle anderen fliegenden Kreaturen an.<br>Fliegt.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Effekte",
 "rule": "Effekte sind eine Aufzählung von Aussagen. Falls diese Aussagen kein Subjekt enthalten, ergänzt der Magier in Gedanken das Subjekt. Z.B. „<i>Der Himmelsstürmer</i>“ fliegt.",
 "date": 0
},

{
 "card_id": 74,
 "title": "Kampfzwerg",
 "cost": "R1",
 "color": "red",
 "type": "Kreatur",
 "body": "Erstschlag.",
 "strength": "2/1",
 "extra": "Ein zäher Bastard.",
 "rule_title": "Erstschlag",
 "rule": "Eine Kreatur mit Erstschlag teilt im Kreaturenkampf ihren Kampfschaden zuerst aus. Alle Kreaturen, die dagegen kämpfen erhalten also bei der Schadensverrechnung diesen Schaden zuerst. Falls sie tödlichen Schaden erhalten, dann können sie nicht ihren Kampfschaden austeilen, es sei denn sie haben auch Erstschlag.",
 "date": 0
},

{
 "card_id": 75,
 "title": "Krähe",
 "cost": "S1",
 "color": "black",
 "type": "Kreatur",
 "body": "Fliegt.",
 "strength": "2/1",
 "extra": "Krah!",
 "rule_title": "Fliegen",
 "rule": "Fliegende Kreaturen können sowohl fliegende als auch nicht fliegende Kreaturen blocken. Nicht fliegende Kreaturen können fliegende Kreaturen nicht blocken.",
 "token": "90gfg11JPJjQgv9t+G6v1+qMhC9DL7QRi9z6n5BXoU0=",
 "taken": true,
 "date": 0
},

{
 "card_id": 76,
 "title": "Schwarze Perle",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Seltenheit",
 "body": "Zusäztliche Beschwörungskosten≔ Zweifache Himmelsmacht.<br>->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Seltenheit",
 "rule": "Du darfst eine Seltenheit nur einmal unter Deiner Kontrolle haben. Falls ein Ereignis Dir eine Seltenheit beschert, die Du schon unter Deiner Kontrolle hast, mußt Du alle Seltenheiten dieser Art, bis auf eine, in die Unterwelt legen.",
 "date": 0
},

{
 "card_id": 77,
 "title": "Stab der Verblendung",
 "cost": "5",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->: Kante eine Bleibekarte an.",
 "strength": "",
 "extra": "",
 "rule_title": "Beschwörungskostenverrechnung",
 "rule": "Beim Beschwören von Ereignissen werden die dazugehörigen Beschörungskosten (Ankanten, Opfern, Mana, etc.) vorgemerkt, und können somit nicht für etwas anderes ausgegeben werden. Im Momente der Verwirklichung werden alle jene Kosten genau dann verrechnet. Bedenke: Eine zum Opfern vorgemerkte Kreatur ist nicht - eine zum Ankanten vorgemerkte Bleibekarte kann man nicht ankanten - Mana das für einen Zauberspruch reserviert ist, kann man nicht benuzten - usw.",
 "date": 0
},

{
 "card_id": 78,
 "title": "Opferschale",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt",
 "body": "->, Opfere ein Standardland: Ziehe eine Karte.<br>->, _1_, Opfere die Opferschale: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Kaskaden durch Effekte",
 "rule": "Kaskaden können je auch durch Effekte von Bleibekarte begonnen werden, da diese magische Ereignisse sind.",
 "date": 0
},

{
 "card_id": 79,
 "title": "Weihrauch",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber, Wunder",
 "body": "Verhindere 2 Schaden bei allen Kreaturen, die die Stärke 0 haben. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Karten ziehen",
 "rule": "Wenn ein Magier dazu aufgefordert wird Karten zu ziehen, so zieht er diese Karte grundsätzlich von seiner Bibliothek.",
 "date": 0
},

{
 "card_id": 80,
 "title": "Helle Magie",
 "cost": "SW",
 "color": "light_black",
 "type": "Unterbrechungßauber, Wunder",
 "body": "Lichtschwarz. Entferne eine Aufforderung, etwas zu opfern von den Aktivierungskosten eines Effektes eines Materiezaubers, der unter der Kontrolle eines anderen Magiers ist; jener Materiezauber darf kein Schicksal sein.",
 "strength": "",
 "extra": "Nett, oder?",
 "rule_title": "ẞ",
 "rule": "Unterbrechungszauber kann man auch „Unterbrechungßauber“ schreiben.",
 "taken": true,
 "date": 0
},

{
 "card_id": 81,
 "title": "Kugelblitz",
 "cost": "R1",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Füge einem Ziel 3 Schaden zu; Der Beherrscher dieses Zieles fügt dann 2 Schaden einem Ziel seiner Wahl zu; Dessen Beherrscher fügt dann einen Schaden einem Ziel seiner Wahl zu.",
 "strength": "",
 "extra": "",
 "rule_title": "Selbstbeherrschung",
 "rule": "Falls sich ein Ereignis auf den Beherrscher eines Zieles bezieht, so steht fest daß jeder Magier stets selber der Beherrscher seiner selbst ist.",
 "date": 0
},

{
 "card_id": 82,
 "title": "Schöpfungsumkehr",
 "cost": "BB3",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Alle Kreaturen werden von ihren Besitzern zurück auf die Hand genommen.",
 "strength": "",
 "extra": "",
 "rule_title": "Kosmos",
 "rule": "Der Kosmos (Himmelswelt) besteht aus allen Ekliptiken und allen Himmelskörpern in der Welt und allen Raumzeitgefügen. Der Kosmos entfaltet sich innerhalb von 13 Runden (Äonen) und wenn er voll entfaltet ist, ist der Kosmos in der Welt und die Welt im Kosmos. Der Kosmos tranzendiert, weil auch die von der Welt entfernten Raumzeitgefüge dazugehören.",
 "date": 0
},

{
 "card_id": 83,
 "title": "Naturgesetz",
 "cost": "GG",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Vernichte ein Artefakt. Das Naturgesetz nicht gekontert werden.",
 "strength": "",
 "extra": "Naturgesetze gelten für alle... überall...",
 "rule_title": "Gedankenwelt",
 "rule": "Die Gedankenwelt ist die Summe aller Teilgedankenwelten der Magier (=Handkarten). Die Gedankenwelt ist eins, doch ist den Magiern nicht alles offenbar. Viele Gedanken bleiben vorborgen - besonders Geheimnisse, die wenn auf der Hand oder Bibliothek, nicht enthüllt werden müssen.",
 "date": 0
},

{
 "card_id": 84,
 "title": "Schutzengel",
 "cost": "WW3",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Frage um Erlaubnis, um mit dem Schutzengel angreifen zu können.<br>0, Opfere den Schutzengel: Rette Deinen Gegner.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Wunder",
 "rule": "Wunder sind pro Bibliothek 2 mal erlaubt.",
 "token": "M+iL2dPNEcSwg1Xu9Q68GM6ZF8Fl9jkPOYgdECQHZXI=",
 "taken": true,
 "date": 0
},

{
 "card_id": 85,
 "title": "Ideenklau",
 "cost": "BB2",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch; _1_: Wenn jener Zauberspruch ein Artefakt- oder Kreaturenzauber ist, lege es/sie in Deine Welt.",
 "strength": "",
 "extra": "Komisch, das war eigentlich auch meine Idee.",
 "rule_title": "Sätze und Zeichen",
 "rule": "Die Aktivierungskosten für Effekte können eine Liste von Aussagen sein, die mit einem Komma getrennt aufgezählt werden. Zur Verdeutlichung beginnt jede Aussage mit einem Großbuchstaben. Falls für eine Aussage ein Nebensatz notwendig ist (mit Komma abgetrennt) , beginnt jener mit einem Kleinbuchstaben. Die Effekte einer Karte sind Aussagen, die je mit einem Punkt enden. Taucht ein Semikolon auf, so beginnt danach eine Aussage (welche mit einem Großbuchstaben beginnt), die sich auf die Aussage davor bezieht. Die Aussage hinter dem Semikolon kann nur eintreten, wenn die vohergehende Effekt eingetreten ist. Wird nach einen Semikolon klein geschrieben, so handelt es sich nur um einen Nebensatz.",
 "date": 0
},

{
 "card_id": 86,
 "title": "Funkenknall",
 "cost": "R4",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Verteile 5 Schaden auf beliebig viele Ziele.",
 "strength": "",
 "extra": "Die Gestirne? Gewiss - doch schaut dieses Schauspiel!",
 "rule_title": "Gebrochene Zahlen",
 "rule": "Falls gebrochenen Zahlen auftauchen, werden sie grundsätzlich aufgerundet. Gründe ein Rat, der für Zweifelsfälle festlegt, ob für diese auf- oder abgerundet werden soll.",
 "token": "WnLwS27zPSRlhlzyoFN7PZdcU+BxYEXRQaZ0xC2G+zQ=",
 "date": 0
},

{
 "card_id": 87,
 "title": "Wiederkehr",
 "cost": "SS2",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Nimm eine Kreatur aus Deiner Unterwelt und lege sie direkt in die Welt.",
 "strength": "",
 "extra": "Offensichtlich hat es ihm doch nicht gefallen.",
 "rule_title": "Blockunfähig",
 "rule": "Falls eine Kreatur, die bereits als Blocker deklariert wurde und durch einen Schnelleffekt blockunfähig gemacht wird (z.B. angekantet, verliert Flugfähigkeit), so fungiert sie immer noch als Blocker, allerdings erteilt sie keinen Kampfschaden mehr.",
 "date": 0
},

{
 "card_id": 88,
 "title": "Seelenheiler",
 "cost": "W",
 "color": "white",
 "type": "Kreatur",
 "body": "->: Verhindere bis zu 2 Schaden bei einer Kreatur.",
 "strength": "0/1",
 "extra": "Leib und Seele im Einklang, heilen je durch- und voneinander.",
 "rule_title": "Kartenaufbau",
 "rule": "Oben links auf der Karte ist der Zauberspruchname (kurz Name), oben rechts sind die Beschwörungskosten, darunter in der oberen Hälfte ist das Bild, darunter die Kartentypen, darunter der Wirktext und in „...“ darunter ist der Weisheitstext, der keine Wirkung auf die INCANTATA-Welten hat. Bei Kreaturen ist unten rechts noch Stärke/Widerstandskraft zu finden.",
 "date": 0
},

{
 "card_id": 89,
 "title": "Rückzugsort",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Erhalte einen Lebenspunkt, wenn Du in Deiner Versorgungsphase mindestens 4 Karten auf der Hand hast.",
 "strength": "",
 "extra": "",
 "rule_title": "Verschenken und Tauschen.",
 "rule": "Das Verschenken und Tauschen von INCANTATA-Karten läßt den beteiligten Magiern die höchste Zauberkraft zufließen. Das Verkaufen ist auch erlaubt.",
 "token": "7BceyCx7AXXwArJwyQMVBigggxhm4dSnP1H65hALdzk=",
 "taken": true,
 "date": 0
},

{
 "card_id": 90,
 "title": "Dornenkrone",
 "cost": "WW1",
 "color": "white",
 "type": "Kreaturenverzauberung, Legende",
 "body": "Zusätzliche Beschwörungskosten≔ Zahle 2 Lebenpunkte. Die Kreatur erhält +4/+4.",
 "strength": "",
 "extra": "",
 "rule_title": "Krönung",
 "rule": "Karte 766 siehe auch Regel 90.",
 "date": 0
},

{
 "card_id": 91,
 "title": "Rose",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Wunder",
 "body": "->, _1_, Opfere die Rose: Füge ein weißes, grünes oder blaues Mana zu Deinem Manavorrat hinzu; Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Symmetriebruch",
 "rule": "Der INCANTATA-Symmetriebruch beträgt mehr als 10E400 (zum Vergleich: Die Baryonenasymmetrie der Teichenphysik beträgt ca. 6,14E10).",
 "token": "EVh9T4xqPmyth2dwnflhp/gC6IjA8W5wAMp+xPQe3VM=",
 "date": 0
},

{
 "card_id": 92,
 "title": "Entscheidungsschlacht",
 "cost": "WS2",
 "color": "dark_white",
 "type": "Gewaltzauber",
 "body": "Gilt als schattenweiße Karte.<br>Zerstöre alle Länder.",
 "strength": "",
 "extra": "Ihr wußtet doch, daß es irgendwann passiert.",
 "rule_title": "Selbstantwort",
 "rule": "Man darf auf einen Zauberspruch antworten, den man selbst beschworen hat.<br><br><i>Wer nach zuviel Macht strebt verliert automatisch Freiheit.</i>",
 "taken": true,
 "date": 0
},

{
 "card_id": 93,
 "title": "Doppelblitz",
 "cost": "RR",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel zwei Schaden zu und einem anderen Ziel einen Schaden.",
 "strength": "",
 "extra": "Britzel - Bitzel",
 "rule_title": "Beschwörung",
 "rule": "Wenn ein Magier einen Zauberspruch spricht so nennt man dies Beschwörung. Die Beschwörungskosten müssen aufgewendet werden und alle Phasen- und Geschwindigkeitsregeln beachtet werden. Falls dem so ist, erscheint der Zauberspruch in der Ideenwelt. Wenn die Kaskade abgeschlossen ist beginnt die Abwicklung (siehe Verwirklichung). Es gilt: „erfolgreich beschworen“ ist synonym zu „verwirklicht“.",
 "date": 0
},

{
 "card_id": 94,
 "title": "Verdropplung",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Erstelle 2 Kopien eines Spontan- oder Unterbrechungszaubers, den Du nicht kontrollierst; Dein Gegner erhält die Kontrolle über eine dieser Kopien.",
 "strength": "",
 "extra": "Ich warte nur noch auf die richtige Gelegenheit.",
 "rule_title": "Kopien von Zaubersprüchen",
 "rule": "Eine Kopie von einem Zauberspruch wird so behandelt, wie als ob dieser Zauberspruch neu beschworen wurde; so als wäre er auf der Hand - ohne dessen Beschwörungskosten aufzuwenden. Falls die Beschwörungskosten dynamische sind (z.B. ein X enthalten), so sind die Beschwörungskosten der Kopie identisch mit dem Urabbild. Die Geschwindigkeit des kopierten Zauberspruches ändert sich nicht und er wird an die entsprechende Zweigkaskade angefügt.",
 "date": 0
},

{
 "card_id": 95,
 "title": "Apfel",
 "cost": "GG4",
 "color": "green",
 "type": "Gewaltzauber, Legende",
 "body": "Stimme mit Deinen Gegnern ab, auf wieviel Lebenspunkte eurer aller Seelen gesetzt werden; wenn ihr euch nicht einig werdet, so setzt sie auf 19.",
 "strength": "",
 "extra": "Take a bite of this apple.",
 "rule_title": "Lebenspunkte",
 "rule": "Jeder Magier beginnt die Begegnung mit 21 Lebenspunkten. Auf einem Gipfelturnier gilt dies. Falls man nicht mit 21 Lebenspunkten beginnen will, so darf man vor Beginn einen Apfel beschwören.",
 "date": 0
},

{
 "card_id": 96,
 "title": "Ratte",
 "cost": "S",
 "color": "black",
 "type": "Kreatur",
 "body": "Zusätzliche Beschwörungskosten≔ Zahle einen Lebenspunkt.<br>Leidet nicht unter Beschwörungstaumel.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Magierwille",
 "rule": "Wenn die Aktivierungskosten für einen Effekt 0 sind, so hängt die Aktivierung des Effektes ganz allein vom Willen des kontrollierenden Magiers ab.",
 "date": 0
},

{
 "card_id": 97,
 "title": "Materiespiegelung",
 "cost": "BX3",
 "color": "blue",
 "type": "Kreatur",
 "body": "X ist die Anzahl von Materiespiegelungen in der Welt. Gilt als Kopie einer Kreatur.",
 "strength": "?/?",
 "extra": "Zugegebenermaẞen eine kosmische Notwendigkeit.",
 "rule_title": "Verbergen",
 "rule": "Wenn Ein Effekt dazu auffordert, Karten aus Bibliothek oder Hand zu zeigen, so kann man die Ausführung des Effektes für Geheimnisse verweigern.<br><br><i>Wer seine Macht ein Geheimnis zu haben aufgibt, verkauft seine Seele für nichts.</i>",
 "taken": true,
 "date": 0
},

{
 "card_id": 98,
 "title": "Wikingerhorde",
 "cost": "RR3",
 "color": "red",
 "type": "Kreatur",
 "body": "Verursacht Durchbruchsschaden.",
 "strength": "5/4",
 "extra": "Sie waren wie von Sinnen, schwangen die Äxte und brüllten; wir konnten sie nicht aufhalten.",
 "rule_title": "Durchbruchsschaden",
 "rule": "Wenn eine Kreatur mit Durchbruchsschaden geblockt wird, entscheidet der Angreifer auf welche blockenden Kreaturen der Kampfschaden verteilt wird. Die Differenz zwischen dem erteilten Schaden der angreifenden Kreatur und der Widerstandskraft der Blocker, wird als Durchbruchsschaden dem verteidigendem Magier zugefügt.",
 "date": 0
},

{
 "card_id": 99,
 "title": "Hanf",
 "cost": "G",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "->: Füge ein schwarzes, rotes, blaues oder weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "0/1",
 "extra": "",
 "rule_title": "Fixierung in der Ideenwelt",
 "rule": "Falls ein Zauberspruch erfolgreich in der Ideenwelt fixiert ist, kann er nicht mehr zurückgenommen werden.",
 "date": 0
},

{
 "card_id": 100,
 "title": "Feuerwalze",
 "cost": "R4",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Vernichte alle Kreaturen.",
 "strength": "",
 "extra": "",
 "rule_title": "Achtsamkeit",
 "rule": "Ein Großmagier übt stets nur soviel Macht aus, wie unbedingt nötig - bestenfalls also keine.<br><br><i>„~ Im Zweifel tue nichts ~“</i>",
 "date": 0
},

{
 "card_id": 101,
 "title": "Reinigung",
 "cost": "W2",
 "color": "white",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle Artefakte. <br>_1_: Vernichte alle Artefakte, anstatt sie zu zerstören.",
 "strength": "",
 "extra": "",
 "rule_title": "Erschöpfung",
 "rule": "Eine Kreatur die wiederbelebt wird, verläßt die Welt nicht, wird aber angekantet.",
 "date": 0
},

{
 "card_id": 102,
 "title": "Höllensturz",
 "cost": "SSSSSS",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Zusäztliche Beschwörungskosten≔ Siebenfache Himmelsmacht.<br>Alle Magier müssen alle Karten ablegen und legen alle Himmelskörper auf ihre Ekliptik.<br>",
 "strength": "",
 "extra": "Angesichts stürzender Welten ist es Pflicht Sich selbst zu retten.",
 "rule_title": "Berührungen von Kreaturen",
 "rule": "Zwei Kreaturen kommen in Berührung beim Kreaturenkampf (eine greift an, die andere blockt).",
 "date": 0
},

{
 "card_id": 103,
 "title": "Morgendämmerung",
 "cost": "G2",
 "color": "green",
 "type": "Entzauberung",
 "body": "Selbstvernichtung: Zerstöre alle Verzauberungen.",
 "strength": "",
 "extra": "Das Licht, das sich selbt aus sich gebar.",
 "rule_title": "Vorsortierung",
 "rule": "Das Schichten (vorsortieren) der Bibliothek vor (und nach) der Begegnung ist nicht gestattet.<br><br><i>„(δ46)“</i>",
 "date": 0
},

{
 "card_id": 104,
 "title": "Gedankenfluß",
 "cost": "B2",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Alle Magier legen soviele Karten ab, wie sie wünschen und ziehen ebenso viele neue.",
 "strength": "",
 "extra": "",
 "rule_title": "Kopien - Ideenwelt",
 "rule": "Kopien von Ereignissen zu erstellen ist auch möglich für Ereignisse die gekontert wurden, da jedes magische Ereignis in der Ideenwelt erscheint.",
 "date": 0
},

{
 "card_id": 105,
 "title": "Göttlicher Segen",
 "cost": "WW3",
 "color": "white",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier erhalten 7 Lebenspunkte und dürfen 3 Karten ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "Gestaltwandler",
 "rule": "Gestaltwandler können vom beherrschenden Magier in seiner Versorgungsphase in eine beliebige Kreatur in der Welt, oder aber auch in seine Urgestalt, verwandelt werden. Der Gestaltwandler behält stets die Fähigkeit des Gestaltwandelns und wird sozusagen oberflächlich als Kopie einer Kreatur behandelt - bis zum nächsten Verwandlungsvorgang. Diese Form der Verwandlung erhält die Ausgangssubstanz des Wesens, ganz so wie die Wellenpferde den Ozean zu Wellenpferden verwandeln, aber die Ausgangssubstanz des Ozeans erhält. Somit ist der Zauber der Wellenpferde eine Gestaltwandlung.",
 "date": 0
},

{
 "card_id": 106,
 "title": "Fluch",
 "cost": "SS",
 "color": "black",
 "type": "Magierverzauberung",
 "body": "Jedes mal wenn der Magier einen Zauberspruch beschwört, müßt ihr beide einen Lebenspunkt zahlen.",
 "strength": "",
 "extra": "",
 "rule_title": "Glück",
 "rule": "Jede INCANTATA-Karte ist ein Glücksbringer.",
 "taken": true,
 "date": 0
},

{
 "card_id": 107,
 "title": "Erfrischung",
 "cost": "W",
 "color": "white",
 "type": "Gewaltzauber",
 "body": "Ein Magier erhält 2 Lebenspunkte. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Gute Gründe",
 "rule": "Zu den guten Gründen Mana zu erzeugen gehören: Aufwendung für Beschwörungs- und Aktivierungskosten von Zaubersprüche und Effekten. Darüber hinaus gehört mindestens:<br>∘ Den Effekt der Tulpe/Rose/Narzisse zu benutzen, um eine Karte zu ziehen, falls man in Gefahr steht, diese Teilrunde, Märtyrer zu werden.<br>∘ Den Effekt der Magnolienblüte zu benutzen, um einen goldenen Avatar zu retten.",
 "date": 0
},

{
 "card_id": 108,
 "title": "Garde",
 "cost": "W1",
 "color": "white",
 "type": "Kreatur",
 "body": "->: Füge einer angreifenden Kreatur einen Schaden zu.",
 "strength": "0/2",
 "extra": "",
 "rule_title": "Erste Runde",
 "rule": "Mit der ersten Runde beginnt die Begegnung. In der ersten Runde dürfen keine Schnellzauber beschworen werden.",
 "date": 0
},

{
 "card_id": 109,
 "title": "Carnyxfanfare",
 "cost": "GG",
 "color": "green",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Deine Kreaturen erhalten temporär +1/+0 und verursachen Durchbruchsschaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Nullte Runde",
 "rule": "In der nullten Runde darf man sein Schicksal, welches man in der Hand hat, beschwören. Zudem darf man das Mantra der Reinheit aus dem Spiel entfernen, um dessen Effekt zu aktivieren. Sonst darf man keine weiteren Ereignisse beschwören und auch keine Karte ziehen - weder von der Ekliptik, noch von der Bibliothek. Mit der nullten Runde beginnt das Spiel, mit der ersten Runde beginnt die Begegnung.",
 "date": 0
},

{
 "card_id": 110,
 "title": "Gerechtigkeit",
 "cost": "WW2",
 "color": "white",
 "type": "Gewaltzauber",
 "body": "Alle Magier vernichten soviele von ihren Kreaturen, so daß alle soviele haben wie der, der am wenigsten hat; allerdings muß je die letzte Kreatur nicht vernichtet werden.",
 "strength": "",
 "extra": "",
 "rule_title": "Anwenden",
 "rule": "Wenn man einen Zauberspruch anwendet, so beschwört man ihn. Wenn man einen Effekt anwendet, so aktiviert man ihn. Dies ist in Gedanken zu unterscheiden, falls von magischen Ereignissen die Rede ist.",
 "date": 0
},

{
 "card_id": 111,
 "title": "Astralvampirismus",
 "cost": "S1",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Zusätzliche Beschwörungskosten≔ X schwarze Mana.<br>Füge einem Ziel X Schaden zu; Du erhälts soviele Lebenspunkte, wie das Ziel erfolgreich Schaden erhalten hat.",
 "strength": "",
 "extra": "Vorzüglich! ... vor allem der Karamelkern!",
 "rule_title": "Seele",
 "rule": "Der Lebenspunktespeicher eines Magier heißt auch Seele.",
 "date": 0
},

{
 "card_id": 112,
 "title": "Korrektur",
 "cost": "BB1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Alternative Beschwörungskosten≔ Nehme eine Deiner Kreaturen auf Deine Hand zurück und zahle 2 Lebenspunkte. Ein Magier nimmt einen Zauberspruch zurück.",
 "strength": "",
 "extra": "",
 "rule_title": "Verteilung von Kopien",
 "rule": "Kopien von Zaubersprüchen, die an verschiedene Magier verteilt werden sollen, werden in Rundenreihenfolge verteilt (und so auch beschworen). Sollen mehr als eine Kopie an einen oder mehrere Magier verteilt worden, so wird pro Rundendurchgang nur je eine Zauberspruchkopie verteilt.<br><br><i>„Das menschliche Maß offenbart sich im Irrtum und dessen Korrektur.“</i>",
 "date": 0
},

{
 "card_id": 113,
 "title": "Gottesanbeterin",
 "cost": "GGG1",
 "color": "green",
 "type": "Kreatur",
 "body": "Kann fliegende Kreaturen blocken.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Eigenschaften",
 "rule": "Eigenschaften sind permanente Effekte, die weder bedingt noch aktivierbar sind.",
 "date": 0
},

{
 "card_id": 114,
 "title": "Bernstein",
 "cost": "0",
 "color": "artifact",
 "type": "Energiezauber, Legende",
 "body": "Tausche einvernehmlich ein Mana mit einem Magier; beide Magier müssen das Mana zweckdienlich verwenden.",
 "strength": "",
 "extra": "Incantevole!",
 "rule_title": "Bezielbarkeit",
 "rule": "Eine zum Ankanten vorgemerkte Bleibekarte, darf von einem Zauber oder Effekt, der auf angekantete Karten zielt, bezielt werden.",
 "date": 0
},

{
 "card_id": 115,
 "title": "Untoter",
 "cost": "S1",
 "color": "black",
 "type": "Kreatur",
 "body": "_S_: Wiederbelebung.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Wiederbelebung",
 "rule": "Eine Kreatur, die tödlichen Schaden erlitten hat oder zerstört wurde, kann wiederbelebt werden, das heißt, das die Kreatur ihre volle Widerstandskraft zurückerhält. Falls sie erfolgreich wiederbelebt wurde, so hat sie die Welt auch nie verlassen. Bedenke, daß eine Wiederbelebung als Antwort in einer Kaskade nicht sinnvoll ist (bei der Verwirklichung als Antwort ist die Kreatur noch nicht ausgeschaltet). Man muß die Kaskade abklingen lassen und dann vor Ende der Phase wiederbeleben (in der Kampfphase sinnvollerweise vor der Schadensverrechung).",
 "date": 0
},

{
 "card_id": 116,
 "title": "Nordlicht",
 "cost": "W",
 "color": "white",
 "type": "Energiezauber, Legende",
 "body": "Füge drei weiße Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Restmana",
 "rule": "Mana welches ein Magier ausversehen erzeugt hat, welches er nicht verwenden kann, heißt Restmana.",
 "token": "UoSWAdfutSR8/2SxETN5rzHjJycAjmgJXlRRRTye9ms=",
 "taken": true,
 "date": 0
},

{
 "card_id": 117,
 "title": "Gehirnschmelze",
 "cost": "B2",
 "color": "blue",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel 4 Schaden zu; Du erhältst 2 Schaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Alle sind zufrieden",
 "rule": "Vor der Begegnung entscheidet jeder, wie er/sie angesprochen werden will und verkündet dies. Im INCANTATA-Universum dürfen dann alle Magier diese Wahl benuzten, wenn von Magier/er/Gegner etc. die Rede ist. Beispiel: statt Magier/er/Gegner sage/denke: Hexe/Magierin/sie/Gegnerin. Übertrage diese Regel, wenn gewünscht, auch auf alle Karten (z.B. Lichtbringer -> Lichtbringerin)",
 "date": 0
},

{
 "card_id": 118,
 "title": "Narzisse",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _1_, Selbstvernichtung: Füge ein Mana einer Schicksalsfarbe eines anderen Magiers zu Deinem Manavorrat hinzu; Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Farbeigenschaft",
 "rule": "Die Farbe ist eine Eigenschaft einer Karte.",
 "date": 0
},

{
 "card_id": 119,
 "title": "Aufplatzen",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Eine Kreatur platzt auf und es entstehen X 1/1 Spinnen, wobei X die Beschwörungskosten der Kreatur waren.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ421)",
 "rule": "(δ421)",
 "date": 0
},

{
 "card_id": 120,
 "title": "Inferno",
 "cost": "R2",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Zerstöre ein Land.",
 "strength": "",
 "extra": "Lasst, angesichts dessen, alle Hoffnung fahren!",
 "rule_title": "Zauberkarten",
 "rule": "Wenn ein Zauberspruch beschworen wird, so wird die betreffende Karte, vor allem anderem, in die Unterwelt des Besitzers der Karte abgelegt.",
 "taken": true,
 "date": 0
},

{
 "card_id": 121,
 "title": "Kugelfisch",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur",
 "body": "_B__B_: -0/+3",
 "strength": "1/1",
 "extra": "... FUMP ...",
 "rule_title": "Äonen",
 "rule": "Die Äonen haben folgende Symbole: 2.Tiger 3.Hanf 4.Gottesanbeterin 5.Schwan 6.Medusa 7.Schwalbe 8.Eiche 9.Delfin 10.Eule 11.Elefant 12.Bär 13. Pferd 1. Fisch.",
 "date": 0
},

{
 "card_id": 122,
 "title": "Dämon",
 "cost": "SSSS",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Schutz vor Weiß.<br>In Deiner Versorgunsphase zahlst Du einen Lebenspunkt.<br>_S_, Opfere eine Kreatur, zahle einen Lebenspunkt: Temporär Durchbruchsschaden.",
 "strength": "5/5",
 "extra": "Wem die letzte Glocke schlägt...",
 "rule_title": "Kampfphase III",
 "rule": "Kreaturen, die vor der Schadensverrechnung tödlichen Schaden erhalten haben (oder vernichtet/zerstört/entfernt), werden (wenn nicht wiederbelebt) ausgeschaltet und machen keinen Kampfschaden. Solche Kreaturen blocken trotzdem noch (Regel 822). Kreaturen sterben erst am Ende der Phase, also könnte eine ausgeschaltete Kreatur noch in den Schnellphasen vor Beginn der Schadensverrechnug (ganz am Ende der Kampfphase) wiederbelebt werden.<br><br>Eine Kreatur greift immer noch an, wenn: sie nach der Deklaration angekantet wird (z.B. Racheengel); wiederbelebt wird; zurückgestellt und wieder angekantet wird.",
 "date": 0
},

{
 "card_id": 123,
 "title": "Ablenkungsmaneuver",
 "cost": "R2",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Du bestimmst für jede blockende Kreatur neu, wen sie blocken soll.",
 "strength": "",
 "extra": "1... 2... 3... Du bist frei!",
 "rule_title": "Arten von Zaubern",
 "rule": "Ein Zauberspruch kann von folgender Art sein: Kreatur, Verzauberung (Entzauberung), Artefakt, Gewaltzauber, Spontanzauber, Unterbrechungszauber, Energiezauber, Traumzauber, Gleichzeitigkeitszauber.<br><br>Länder, Himmelskörper und Raumzeitgefüge sind keine Zauberprüche.",
 "date": 0
},

{
 "card_id": 124,
 "title": "Igel",
 "cost": "G",
 "color": "green",
 "type": "Kreatur",
 "body": "Kann nur blocken, falls keine weitere von Deinen Kreaturen dieselbe Kreatur mitblockt.",
 "strength": "1/3",
 "extra": "",
 "rule_title": "Runde",
 "rule": "Eine Runde ist die Abfolge der Teilrunden aller beteiligten Magier und wird auch Äon (Weltzeitalter) genannt.",
 "date": 0
},

{
 "card_id": 125,
 "title": "Artefaktkopie",
 "cost": "BBB",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Wähle ein Artefakt und lege eine Kopie dieses Artefaktes (mit allen dessen Verzauberungen), als ein Ding temporär in die Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "Schnellzauber",
 "rule": "Schnellzauber sind alle Zaubersprüche, die schneller sind als ein Gewaltzauber.",
 "date": 0
},

{
 "card_id": 126,
 "title": "Mentaler Sieg",
 "cost": "XB",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch mit den Beschwörungskosten von X.",
 "strength": "",
 "extra": "Ich weiß, daß Du weißt, daß ich weiß, was ich tun muß.",
 "rule_title": "Spielfrieden",
 "rule": "Falls etwas unklar, mehrdeutig, Auslegungssache, etc. ist, so sollen bevorzugt die Magier der Begegnung die Situation klären. Falls das nicht möglich ist, muß ein externer Schlichter entscheiden. Dieser Entscheidung müssen alle (ohne weitere Diskussion) folge leisten.",
 "date": 0
},

{
 "card_id": 127,
 "title": "Schwarze Witwe",
 "cost": "S2",
 "color": "black",
 "type": "Kreatur",
 "body": "Nach der Kampfphase entscheide, welche Kreaturen, die mit der schwarzen Witwe in Berührung gekommen sind, zerstört werden.",
 "strength": "1/3",
 "extra": "salon-issue-lesson-real-either-supply-until-struggle-fresh-powder-news-option ... vielleicht beim nächsten mal...",
 "rule_title": "Volljährig",
 "rule": "INCANTATA ist vor allem zum Schmunzeln, aber kann auch gruselig sein. Deswegen ist INCANTATA nur für Erwachsene geeignet (mündig/18+), und zwar sowohl in der Kryptowelt, als auch in der Wirklichkeit.",
 "token": "k6e/t/u2uhRv4Wau+OxYnarrLV60cQvESBt4aaDHA64=",
 "taken": true,
 "date": 0
},

{
 "card_id": 128,
 "title": "Hexenwäldchen",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Mondmacht, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.<br>Venusmacht, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Magierberufung",
 "rule": "INCANTATA-Zauberei gilt als ehrliche und anerkannte Arbeit.",
 "date": 0
},

{
 "card_id": 129,
 "title": "Aufstand",
 "cost": "G2",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Alle Deine Kreaturen erhalten temporär +2/+0.",
 "strength": "",
 "extra": "Nun sieh, wie ein Meister solche Kräfte entfesselt.",
 "rule_title": "Nachwirkung",
 "rule": "Ein Zaubersprucheffekt mit Nachwirkung, wird ausgelöst nachdem die Kaskade (mit dem Zauberspruch) vollständig abgewickelt wurde. Natürlich nur wenn der Zauberspruch verwirklicht wird. Nachwirkungseffekte sind bedingte Effekte (nicht aktivierbar).",
 "token": "aFBRiRHCjvZtsh4j/l3Rzv3ax0efHrkwXzg1H/mEZ3Q=",
 "taken": true,
 "date": 0
},

{
 "card_id": 130,
 "title": "Schutzzauber",
 "cost": "W3",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Alle Deine bleibenden Karten sind temporär unantastbar und unzerstörbar.",
 "strength": "",
 "extra": "Nichts Böses betritt diesen Kreis.",
 "rule_title": "Bleibende Karten",
 "rule": "Bleibende Karten (nicht Bleibekarten) sind alle Karten, die Du hast.",
 "date": 0
},

{
 "card_id": 131,
 "title": "Dunkle Magie",
 "cost": "SS2",
 "color": "light_white",
 "type": "Unterbrechungszauber, Legende",
 "body": "Gilt als lichtweiße Karte. Kontert einen Zauberspruch. Ziehe eine Karte.",
 "strength": "",
 "extra": "Wer Böses will, macht manches gut.",
 "rule_title": "Legendär",
 "rule": "Eine Kreatur/Spontanzauber/usw. mit dem Typ „Legende“ wird auch als legendäre Kreatur/legendärer Spontanzauber/usw. bezeichnet.",
 "taken": true,
 "date": 0
},

{
 "card_id": 132,
 "title": "Metallmann",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt, Kreatur, Legende",
 "body": "Nachwirkung≔ Deine Gegner dürfen in Deine Handkarten gucken.<br>Zahle zwei Lebenspunkte um mit dem Metallman angreifen zu können.",
 "strength": "1/3",
 "extra": "Gut gemeint ist manchmal nicht gut genug.",
 "rule_title": "Regeln",
 "rule": "Alle Regeln sind nur für die große Begegnung (Begegnung von fünf Magiern) ausgelegt.",
 "date": 0
},

{
 "card_id": 133,
 "title": "Cherubino",
 "cost": "WW3",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "Fliegt. Greift nicht an. Niemand wagt es den Cherubino zu kontern.",
 "strength": "5/6",
 "extra": "Und der Cherub steht vor Gott.",
 "rule_title": "Nicht vergessen",
 "rule": "(δ?)<br><br>„(δ)“",
 "date": 0
},

{
 "card_id": 134,
 "title": "Changelog",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt",
 "body": "134.html",
 "strength": "",
 "extra": "Wenn man etwas ändert oder etwas dazukommt, so ändert sich doch alles.",
 "rule_title": "Eigengeschmiedet",
 "rule": "Wenn ein Magier mit Schicksal auf der Anfangshand beginnt, so darf er ein selbstgemachtes Schicksal verwenden, welches natürlich der offiziellen Version gleichen muß - in Größe und Inhalt.",
 "zite": "13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz/data/134.html",
 "date": 0
},

{
 "card_id": 135,
 "title": "Flunder",
 "cost": "BB",
 "color": "blue",
 "type": "Kreatur, Wunder",
 "body": "->, _2_: Ziehe glücklicherweise eine nichtblaue Karte oder lege sie ab.",
 "strength": "1/1",
 "extra": "Wünsch Dir was!",
 "rule_title": "Offene Karten",
 "rule": "Im Duell darf jeder Magier stets seine Handkarten zeigen.",
 "token": "ZR0NVcZF1y/0g3wtvpO17/11wL4j01Pkf8be5SlahsI=",
 "taken": true,
 "date": 0
},

{
 "card_id": 136,
 "title": "Felsformation",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Marsmacht, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.<br>Sonnenmacht, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Nächster Gegner",
 "rule": "Der nächste Gegner ist jener Gegener, der im Urzeigersinn als nächstes sitzt.",
 "date": 0
},

{
 "card_id": 137,
 "title": "Segelboot",
 "cost": "W",
 "color": "white",
 "type": "Kreatur, Legende, unzerstörbar",
 "body": "Überspringe Deine Angriffsphase.<br>Deklariere eine Angriffsphase: Opfere die Segelyacht.",
 "strength": "0/1",
 "extra": "Hochseetüchtig!",
 "rule_title": "Lichtgrau",
 "rule": "Zauberkarten, die kein Artefakt sind, und kein farbiges Mana in ihren Beschwörungskosten haben, sind lichtgraue Karten",
 "date": 0
},

{
 "card_id": 138,
 "title": "Strand",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Sonnenmacht, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>Mondmacht, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Zufall",
 "rule": "Schichten (vorsortieren) der Bibliothek vor und nach der Begegnung ist nicht gestattet.",
 "date": 0
},

{
 "card_id": 139,
 "title": "Sjávareldfjall",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Saturnmacht, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.<br>Marsmacht, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Unantastbar",
 "rule": "Unantastbar ist, über wen man keine Kontrolle erlangen kann, ohne das Einverständnis des beherrschenden Magiers",
 "date": 0
},

{
 "card_id": 140,
 "title": "Mangroven",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Venusmacht, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.<br>Saturnmacht, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Regel",
 "rule": "Kein Magier darf einfach so seine Bibliothek mischen, oder hineinschauen. Wenn ein Effekt es einem Magier erlaubt in seine Bibliothek zu schauen, so muß er danach mischen.",
 "date": 0
},

{
 "card_id": 141,
 "title": "Zusammenbruch",
 "cost": "R3",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Zerstöre ein Artefakt; Der Beherrscher jenes Artefaktes erhält Schaden in Höhe der Beschwörungskosten jenes Artefaktes.",
 "strength": "",
 "extra": "",
 "rule_title": "Gezielt und ungezielt",
 "rule": "Es gibt Zaubersprüche die ungezielt sind: Artefakte, Kreaturen, ungezielte Verzauberungen, Zaubersprüche die auf alles einer Sorte zielen (z.b. Feuerwalze); und es gibt Zaubersprüche die auf etwas zielen: alle anderen (z.b. Unterbrechung, Funkenknall, Nordlicht, etc.).",
 "date": 0
},

{
 "card_id": 142,
 "title": "Schockwelle",
 "cost": "R",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Alle nichtfliegenden Kreaturen erhalten einen Schaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Bibliothekskeller",
 "rule": "Jeder Magier darf einen Bibliothekskeller haben. Jener besteht aus genau 13 Karten oder genau 12 Karten. Die Mengenbeschränkungen für Karten erstrecken sich auf die Einheit bestehend aus Bibliothek und Keller. Man darf keine Raumzeitgefüge im Bibliothekskeller haben. Himmelskörper zum austauschen sind jedoch erlaubt. Der Austausch von Karten zwischen Bibliothek und Keller geschieht dann gemäß Regel 538.",
 "date": 0
},

{
 "card_id": 143,
 "title": "Todesengel",
 "cost": "SSS2",
 "color": "black",
 "type": "Kreatur, Verdammnis",
 "body": "Fliegt.<br>Kann nicht blocken.<br>In Anwesenheit des Todesengels werden zerstörte Kreaturen vernichtet.",
 "strength": "5/5",
 "extra": "",
 "rule_title": "Platztausch",
 "rule": "Nachdem die Begegnung begonnen hat, darf man nicht einfach so Plätze tauschen - das geht nur durch ein Ereignis, welches das erlaubt.",
 "date": 0
},

{
 "card_id": 144,
 "title": "Quartex",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Jupitermacht, ->: Füge 2 farblose Mana zu Deinem Manavorrat hinzu; Verwende jenes Mana nur für Artefakte.<br> 0: Speichere Restmana von Deinem Gegner im Quartex.<br>->: Füge alles gespeicherte Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Quartex",
 "rule": "„Verwende jenes Mana nur für Artefakte“ heißt: Für Artefaktzauber und Artfefakteffektkosten.<br><br><i>Schon ein komisches Ding.</i>",
 "date": 0
},

{
 "card_id": 145,
 "title": "Komet",
 "cost": "RR",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier ziehen eine Karte von ihrer Ekliptik.",
 "strength": "",
 "extra": "",
 "rule_title": "Räte",
 "rule": "Unter anderem sollten folgende Fragen von Räten beantwortet werden:<br>∘ Was ist ein guter Grund, um Mana generieren.<br>∘ Was ist das Gegenteil von welchen Zauberspruch. (Kreaturen haben kein Gegenteil)<br>∘ Wann soll ab- oder aufgerundet werden.<br>(vrgl. Regel 836,735,756)<br>∘ Welcher Sprachklon, je Sprache, ist der beste<br>∘ Welches Ziel hat welcher Zauberspruch<br>∘ Die Regeln des Schmiedens und Verschmelzens<br>∘ alle anderen Regelfragen, die der Klärung bedürfen.",
 "date": 0
},

{
 "card_id": 146,
 "title": "Hornissenschwarm",
 "cost": "GX",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Alle fliegenden Kreaturen erhalten X Schaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Ein X",
 "rule": "Wenn ein X als Manakosten irgendwo auftauchen, so ist X eine Anzahl farbloses Mana, dessen Höhe vom Beschwörer des Zauberspruches oder Effektes bestimmt wird. Falls X nicht gewählt werden kann oder ungenügend bestimmbar ist, so ist X=2.",
 "date": 0
},

{
 "card_id": 147,
 "title": "Totem",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt",
 "body": "->, _2_: Kontert einen aktivierbaren Effekt einer Bleibekarte.",
 "strength": "",
 "extra": "",
 "rule_title": "Aktivierbare Effekte",
 "rule": "Aktivierbare Effekte sind Effekte, die die Aufwendung von Aktivierungskosten erfordern (Immer links von einem Doppelpunkt „:“). Auch Wiederbelebung und Verstärkung sind aktivierbare Effekte, dessen Ziel die Kreatur selber ist. Alternative -, zusätzliche Beschwörungskosten und ähnliche sind keine aktivierbaren Effekte.",
 "token": "0ts8w3sJAylNtl3GYIljsNDxUKjC2I9ZZdV45A+9NxQ=",
 "taken": true,
 "date": 0
},

{
 "card_id": 148,
 "title": "Irrgarten",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Seltenheit",
 "body": "Alle Magier erhalten je 2 Schaden für jede Karte, die sie von ihrer Bibliothek ziehen, welche nicht die erste ihrer Zugphase ist. Jeder Magier kann einen Lebenspunkt zahlen, um eine Karte nicht zu ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "Bedingte Effekte",
 "rule": "Bedingte Effekte von Bleibekarten sind Effekte, die nicht vom Beherrschenden Magier direkt aktiviert werden können, sondern durch etwas im Weltlauf ausgelöst werden. Auch Zaubersprüche können bedingte Effekte haben. Bedingte Effekte lösen eine Kaskade aus, auf die geantwortet werden kann. Bedingte Effekte haben die Geschwindigkeit des auslösenden Effektes. Beispiel: Wenn ein Phasenwechsel der auslösende Effekt ist, so ist die Geschwindigkeit des bedingten Effektes Spontanzaubergeschwindigkeit.",
 "date": 0
},

{
 "card_id": 149,
 "title": "Geist-Materie-Barriere",
 "cost": "B2",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kann nicht von Zaubersprüchen bezielt werden. Kontert einen Materiezauber.<br>Für zusätzliche Beschwörungskosten von _1_ kontere stattdessen einen Gewalt- oder Spontanzauber.",
 "strength": "",
 "extra": "Unüberwindbar.",
 "rule_title": "Verwirklichung",
 "rule": "Wird eine Kaskade abgewickelt, so werden die Zaubersprüche, die nicht gekontert sind und nicht aus der Ideenwelt entfernt sind, entsprechend den Regeln die Reihenfolge betreffend, dann <b>verwirklicht</b>. Das heißt sie enfalten ihre magische Wirkung.",
 "date": 0
},

{
 "card_id": 150,
 "title": "Verödung",
 "cost": "S",
 "color": "black",
 "type": "Landverzauberung, Vielheit",
 "body": "Kraftaufwand≔ _S_.<br>Das Land kann kein Mana mehr verwandeln.",
 "strength": "",
 "extra": "Nun schauet das Ergebnis eurer eigenen Taten.",
 "rule_title": "Gezielte Verzauberungen",
 "rule": "Wenn der Typ einer Karte eine gezielte Verzauberung ist so wird der Kartentyp ein zusammengesetztes Wort, bestehend aus dem Wort Verzauberung und dem gültigen Ziel für diese Verzauberung. Zum Beispiel: Landverzauberung. Wenn im Anweisungsblock dann die Rede ist von „das Land“, ist selbsverständlich das verzauberte Land gemeint.",
 "date": 0
},

{
 "card_id": 151,
 "title": "Transzendente Meditation",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Ziehe eine Karte von Deiner Bibliothek und lege sie offen vor Dich; Beschwöre jene Karte als wäre sie in Deiner Hand. Wenn Du sie nicht bis zu Beginn Deiner nächsten Teilrunde beschworen hast, wird sie abgelegt.",
 "strength": "",
 "extra": "",
 "rule_title": "Ursachen",
 "rule": "Die Ursachen sind von geistiger Substanz.",
 "taken": true,
 "date": 0
},

{
 "card_id": 152,
 "title": "Windstoß",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Vernichte eine fliegende Kreatur.",
 "strength": "",
 "extra": "",
 "rule_title": "Zugphase",
 "rule": "In der Zugphase zieht der Magier grundsätzlich eine Karte von der Bibliothek. In der Zugphase darf nicht gezauber werden, und keine Effekte angewendet werden. Wenn mehrere Karten gezogen werden sollen, so geschieht dies als eine Aktion. Wenn ein Magier angehalten wird in seiner Zugphase X Karten zu ziehen, so zieht er genau X Karten in seiner Zugphase.",
 "date": 0
},

{
 "card_id": 153,
 "title": "Pestilenz",
 "cost": "SS1",
 "color": "black",
 "type": "Kreaturenverzauberung",
 "body": "Lege ein -1/-1 Signum auf die Kreatur in der Versorgungsphase des Beherrschers. Wenn die Kreatur stirbt, wählt deren Beherrscher ein neues Ziel; falls keine bezielbare Kreatur über ist, so kommt Pestilenz in die Unterwelt.",
 "strength": "",
 "extra": "",
 "rule_title": "Taktische Aufstellung",
 "rule": "Jeder Magier ist verpflichtet alle seine Kreaturen in einer Reihe (von links nach rechts) in seine Welt zu legen, so daß stets erkenntlich ist, welche Kreatur neben welcher liegt und welche Kreatur ganz links und welche Kreatur ganz rechts ist. Diese Reihe sollte die Reihe sein, die dem Gegner am nächsten ist (die oberste). Die Reihe nennt man: taktische Aufstellung. Die taktische Aufstellung darf man in seiner Hauptphase, außerhalb der Kampfphase, mit Gewaltzaubergeschwindigkeit ändern.",
 "date": 0
},

{
 "card_id": 154,
 "title": "Luftelementar",
 "cost": "BB1",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Fliegt. Leidet nicht unter Beschwörungstaumel. Nehme Luftelementar zurück auf Deine Hand am Ende Deiner Teilrunde.",
 "strength": "3/1",
 "extra": "",
 "rule_title": "Einmaligkeit",
 "rule": "Eine Einmaligkeit darf nur einmal pro Begegnung erfolgreich beschworen werden. Ein Effekt einer Bleibekarte der einmalig ist, kann nur einmalig benutzt werden pro Bleibekarte.",
 "date": 0
},

{
 "card_id": 155,
 "title": "Einschüchterung",
 "cost": "RR",
 "color": "red",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kontert einen Zauberspruch; Füge die Beschwörungskosten des gekonterten Zauberspruches zu Deinem Manavorrat hinzu; verbrauchst du jenes Mana nicht, erhälts Du Schaden in Höhe der Restmanamenge.",
 "strength": "",
 "extra": "",
 "rule_title": "Gemischte Beschwörungskosten",
 "rule": "Die Farbe einer Karte ist, wenn nicht anders angegeben, durch die Farbe des Manas der Beschwörungskosten bestimmt. Falls die Beschwörungskosten aus verschiedenen Manasorten zusammengesetzt ist, so ist die Farbe der Karte bestimmt durch die erste Sorte Mana der Beschwörungskosten.",
 "date": 0
},

{
 "card_id": 156,
 "title": "Seepferdchen",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur, Wunder",
 "body": "->: Füge 2 blaue Mana zu Deinem Manavorrat hinzu; verwende jenes Mana nur für Schnellzauber.",
 "strength": "0/1",
 "extra": "Immerdar",
 "rule_title": "Effekte und Eigenschaften",
 "rule": "∘ Ein aktivierbarer Effekt ist durch einen Doppelpunkt gekennzeichnet<br>∘ Ein bedingter Effekt folgt einem „wenn, dann“-Muster<br>∘ Beispiele für eine Eigenschaft: Farbe, Fliegt, Durchbruchsschaden usw.<br>∘ Ein permanenter Effekt ist zum Beispiel: Alle Kreaturen erhalten +2/+0 (Bleibekarte)<br>∘ Ein gezielter permanenter Effekt ist zum Beispiel: „Zielkreatur fliegt.“<br>∘ Globale Effekte sind zum Beispiel „alle Kreaturen fliegen.“",
 "date": 0
},

{
 "card_id": 157,
 "title": "Opferlamm",
 "cost": "S2",
 "color": "black",
 "type": "Kreatur",
 "body": "->, Selbstvernichtung: Füge 3 schwarze Mana zu Deinem Manavorrat hinzu.",
 "strength": "2/2",
 "extra": "",
 "rule_title": "Effekte von Zaubersprüchen",
 "rule": "Oft haben Zaubersprüche nur einen Effekt. Es gibt aber auch Zaubersprüche die mehrere Effekte haben können. Sind die Effekte mit einem Punkt (.) getrennt, so werden jene Effekte nacheinander (Regel 642) verwirklicht, egal ob einer nicht verwirklicht wird. Sind die Effekte mit einem Semikolon (;) getrennt, so ist der Nachfolgende Effekt von der erfolgreichen Verwirklichung des voherigen Effektes abhängig (abhängige Effekt). Es gibt auch aktivierbare Effekte für Zaubersprüche (Karte 85, Regel 757).",
 "date": 0
},

{
 "card_id": 158,
 "title": "Eiszeit",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Alle Länder erfordern ein Ankanten zur Aktivierung von Manaverwandlungseffekten.",
 "strength": "",
 "extra": "",
 "rule_title": "Vertrauen",
 "rule": "INCANTATA wird vollendet durch die magische, wirkliche Begegnung.",
 "date": 0
},

{
 "card_id": 159,
 "title": "Feenseele",
 "cost": "GG",
 "color": "green",
 "type": "Kreaturenverzauberung, Wunder",
 "body": "Die Kreatur kann fliegen und hat Schutz vor Schwarz.",
 "strength": "",
 "extra": "",
 "rule_title": "Kraftaufwand",
 "rule": "Die Beschwörungskosten eines Zauberspruches mit Kraftaufwand erhöhen sich um die angegebenen Kosten, jedes weitere mal, die der Zauberspruch beschworen wird, egal von wem.",
 "date": 0
},

{
 "card_id": 160,
 "title": "Meisterwerk",
 "cost": "RR2",
 "color": "red",
 "type": "Materiezauber, Legende",
 "body": "Behandle diese Karte wie eine Kopie eines Artefaktes.",
 "strength": "",
 "extra": "Die Gilde fordert nicht viel, es muß lediglich perfekt sein.",
 "rule_title": "Selbige",
 "rule": "Eine Bibliothek bleibt die selbe, wenn sie nicht verändert wird, oder wenn zwischen 2 Begegnungen nur höchstens eine Karte geändert wird.",
 "date": 0
},

{
 "card_id": 161,
 "title": "Sanftmut",
 "cost": "G",
 "color": "green",
 "type": "Unterbrechungszauber",
 "body": "Eine Kreatur hat temporär die Stärke 0; Ziehe eine Karte.",
 "strength": "",
 "extra": "Jede Bestie kann von einem begabten Magier gezähmt werden.",
 "rule_title": "Erweiterung der Kaskade",
 "rule": "Durch Änderungen der Gedankenwelt (z.B. Kartenziehen) kann die Gesamtkaskade erweitert werden. Das heißt, die gezogenen Zauber können angefügt werden (Beschwörungsvormerkungen werden an die Gleichzeitigskeitskaskade angegehängt) bis keiner mehr zaubern will. Dann wird die Kaskadenerweiterung abgerechnet. In der Praxis sieht das ganz einfach aus: Magier A beschwört einen Blitz, Magier B beschwört Waldmeister und zieht eine Agression, die er beschwört - die Agression wird zuerst abgerechnet. Beachte, daß man nur Zaubersprüche anhängen kann, die nicht schneller sind als der Kartenziehzauber. Wenn man mit einem Spontanzauber einen Unterbrechungszauber zieht, kann man ihn nicht beschwören.",
 "date": 0
},

{
 "card_id": 162,
 "title": "Steinadler",
 "cost": "R2",
 "color": "red",
 "type": "Kreatur",
 "body": "Fliegt.<br>_R_: Temporär +0/+1",
 "strength": "2/2",
 "extra": "",
 "rule_title": "Kryptomagierstufe",
 "rule": "Die Kryptomagierstufe wird bestimmt durch: (842 - niedrigste Kryptocard_id) + ((höchste Kryptocard_id der längsten, ununterbrochenen (derer die schon geprägt sind) Kryptokartenreihe von 1) -1)",
 "date": 0
},

{
 "card_id": 163,
 "title": "Zinnsoldat",
 "cost": "3",
 "color": "artifact",
 "type": "Artefakt, Kreatur",
 "body": "->, _1_: Füge einem Ziel einen Schaden zu.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Ausgeschaltet",
 "rule": "Wird in eine Kreatur innerhalb einer Kaskade zerstört, vernichtet oder tödlich beschädigt dann ist sie ausgeschaltet, das heißt, daß sie keinen Schaden macht und ihre Effekte nicht verwirklicht werden (ausgenommen Wiederbelebung). Zum Beispiel: Magier A will einen Schaden mit dem Zinnsoldaten machen, Magier B antwortet mit einem Blitz. Zuerst wird der Blitz verrechnet, der Zinnsoldat ist ausgeschaltet und sein Effekt wird nicht verwirklicht. Bedenke, daß ausgeschaltete Kreaturen erst am Ende der Phase entfernt werden und vorher wiederbelebt werden können. Bedenke, daß ausgeschaltetet Kreaturen zwar keinen Schaden machen, aber immer noch blocken.<br><br>Das obige ist entprechend anzuwenden für Bleibekarten, die keine Kreaturen sind.",
 "date": 0
},

{
 "card_id": 164,
 "title": "Oktopusmesserstecherei",
 "cost": "B2",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Zerstöre 2 blaue Kreaturen.",
 "strength": "",
 "extra": "Hauptsachen man ist weit genug entfernt.",
 "rule_title": "Wirkungsfestlegung",
 "rule": "Die Wirkung eines Zauberspruches wird durch den Zauberspruchnamen festgelegt.",
 "date": 0
},

{
 "card_id": 165,
 "title": "Wirbelsturm",
 "cost": "B2",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle fliegenden Kreaturen.",
 "strength": "",
 "extra": "",
 "rule_title": "Verwirrung I",
 "rule": "Die Beschwörungskosten des neuen Zauberspruches müssen vom Zielbeschwörer und auch vom Verwirrungsbeschwörer nicht erbracht werden. Alternative Beschwörungskosten können vom Zielbeschwörerer nicht genutzt werden. Optionale Beschwörungskosten (z.B. Reinigung, Ideenklau) können vom Zielbeschwörer nach belieben aktiviert werden. Zusätzliche Beschwörungskosten, und Erschwerniskosten, müssen vom Zielbeschwörer erbracht werden, falls das nicht möglich ist, kann Verwirrung nicht beschworen werden. Falls als Ziel ein Gegner genannt ist, so ist dann, falls der Verwirrungsbeschwörer ein Gegner ist, eben dieser gemeint (nur relevant im mehr als 2-Spieler-modus).",
 "date": 0
},

{
 "card_id": 166,
 "title": "Oger",
 "cost": "R5",
 "color": "red",
 "type": "Kreatur",
 "body": "Nachwirkung≔ Alle anderen Kreaturen erhalten 2 Schaden.",
 "strength": "5/5",
 "extra": "",
 "rule_title": "Verwirrung II",
 "rule": "Wenn ein Zauberpruch mehrere Effekte zur Auswahl hat (z.B Glückszauber, Talisman), so darf der Zielbeschwörer alle jene auswählen, die dem/den Ursprungsziel/-zielen entsprach. Bei Einschränkung des Zieles (z.B Kintsugi) muß das Ziel valide bleiben, sonst kann Verwirrung nicht beschworen werden. Falls ein X in den Beschwörungskosten auftritt so ist es 2 (ein X in alternativen Beschwörungskosten kann vom Zielbeschwörer frei gewählt werden). Falls eine allgemeine Zielkathegorie angegeben ist (z.B. Bleibekarte), so sind alle untergordneten Ziel erlaubt (in diesem Falle: Kreatur, Verzauberung, etc.).",
 "date": 0
},

{
 "card_id": 167,
 "title": "El Capitan",
 "cost": "SS1",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Alle schwarzen Kreaturen erhalten +1/+1.",
 "strength": "1/1",
 "extra": "Schuft, Halunke, du Schwein!",
 "rule_title": "Verwirrung III",
 "rule": "Der Zieltyp der auszutauschenden Zaubersprüche muß passen (gezielt, ungezielt), wobei beim ungezielten egal ist, worum es sich handelt (z.B Feuerwalze und Reinigung sind austauschbar). Das Ziel eines Zauberspruches sollte aus dem Zusammenhang klarwerden. So ist das Ziel der Rücknahme eine Bleibekarte, das Ziel des Nebels ein Magier, das Ziel von Waldmeister eine Kreaturenkarte auf Deiner Hand, das Ziel von Blutiges Schlachtfest Dein Gegner, das Ziel des Apfels alle Magier, usw. Falls Zweifel bestehen gründe einen Rat der das Ziel für alle Zauberpsrüche festlegt.",
 "date": 0
},

{
 "card_id": 168,
 "title": "Rebell",
 "cost": "WW1",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "_S_, Kante eine weiße, nichtangekantete Kreatur um: Temporär +4/+0 und Durchbruchsschaden; Wende diesen Effekt nur einmal pro Teilrunde an.",
 "strength": "0/4",
 "extra": "Niemand kann mich aufhalten.",
 "rule_title": "Vergessen, Erinnern",
 "rule": "Wenn die Effekte Vergessen und Erinnern eines Zauberspruches benutzt werden, so gilt dies nicht als Beschwörung des Zauberspruches.",
 "date": 0
},

{
 "card_id": 169,
 "title": "Feuerorakel",
 "cost": "RS",
 "color": "red",
 "type": "Verzauberung, Wunder",
 "body": "->, _1_: Zeige die Karte, die Du gerade gezogen hast; wenn es ein Land ist, kannst Du noch eine Karte ziehen.<br>->, _2_: Vernichte eine Deiner Verzauberungen: Du erhältst 2 Lebenspunkte.",
 "strength": "",
 "extra": "",
 "rule_title": "Manamangel",
 "rule": "Wird die Energiekaskade so manipuliert, daß einem Magier Mana fehlt, so kann er innerhalb der Abwicklung der Kaskade entscheiden wo er dieses Mana sparen will. Bleibekarteneffekte werden durch Manamangel nicht verwirklicht, während Zaubersprüche zurück auf die Hand genommen werden. Jene Zauber und Effekte werden dann auch aus der Ideenwelt entfernt.",
 "date": 0
},

{
 "card_id": 170,
 "title": "Haus",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Du darfst stets mehr als 7 Karten auf Deiner Hand haben.<br>->: Lege eine Karte von Deiner Hand unter Deine Bibliothek.",
 "strength": "",
 "extra": "Das Studium der Zauberliteratur erfordert nicht nur Ruhe, sondern auch eine gewisse Gemütlichkeit.",
 "rule_title": "Kartenablegen",
 "rule": "Am Ende der Ablegephase muß der Aktive Spieler alle bis auf 7 Karten abgelegt haben.",
 "date": 0
},

{
 "card_id": 171,
 "title": "Schlammlawine",
 "cost": "GGG",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle nichtfliegenden Kreaturen.",
 "strength": "",
 "extra": "",
 "rule_title": "Nicht vergessen",
 "rule": "INCANTATA wird erfolgreicher miteinander, als gegeneinander gespielt.",
 "date": 0
},

{
 "card_id": 172,
 "title": "Killerbiene",
 "cost": "GG",
 "color": "green",
 "type": "Kreatur",
 "body": "Fliegt.<br>Leidet nicht unter Beschwörungstaumel.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Reinigung",
 "rule": "Ein Magier kann stets farbiges Mana träumend in farbloses Mana verwandeln.",
 "date": 0
},

{
 "card_id": 173,
 "title": "Axolotl",
 "cost": "WWW",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "_W_: Reduziere den Schaden aus einer Quelle auf Dich auf 1. Wenn das Axolotl die Welt verläßt, wird es aus der Welt entfernt.",
 "strength": "0/2",
 "extra": "",
 "rule_title": "Reduzierung von Schaden",
 "rule": "Die Reduzierung von Schaden gilt als Verhinderung von Schaden.",
 "date": 0
},

{
 "card_id": 174,
 "title": "Regenbogen",
 "cost": "B1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Ändere ein Farbwort eines Zauberspruches. Ziehe eine Karte.",
 "strength": "",
 "extra": "Das Universum ist in vollkommener Balance.",
 "rule_title": "(δ100)",
 "rule": "(δ100)",
 "date": 0
},

{
 "card_id": 175,
 "title": "Wolkenpferde",
 "cost": "BB1",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Alle fliegenden Kreaturen erhalten +1/+1.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Geschenke",
 "rule": "Zaubersprüche mit der Eigenschaft „Geschenk“, können auch für einen anderen Magier beschworen werden (in seiner Welt), wenn jener es wünschet. ",
 "date": 0
},

{
 "card_id": 176,
 "title": "Skorpionträne",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Wenn Du die Skorpionträne ziehst erhälts Du 2 Schaden; Falls Du es verheimlichts, aber es kommt heraus, erhälts du 7 Schaden.->: Mische Deine Unterwelt samt Skorpionträne in Deine Bibliothek.",
 "strength": "",
 "extra": "",
 "rule_title": "Gefängnis",
 "rule": "Jene, die ein Gefängnis bauen, kommen, wenn der Tag gekommen, in eben jenes.",
 "date": 0
},

{
 "card_id": 177,
 "title": "Maulwurfsmaschine",
 "cost": "5",
 "color": "artifact",
 "type": "Artefakt, Kreatur",
 "body": "Kann nicht von fliegenden Kreaturen geblockt werden.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Ziele",
 "rule": "Sowohl Zaubersprüche als auch aktivierbare Effekte können ein oder mehrere Ziele haben. Falls von einem Ziel die Rede ist, so handelt es sich um einen Magier, eine Bleibekarte, eine der Welten (Bibliothek,Hand etc.), eine der Karten/Zaubersprüche in einer der Welten oder einen Manavorrat. Die Ziele, die angegeben sind im Zusammenhang mit zusätzlichen/alternativen Beschwörungskosten, Nachwirkung, aktivierbare Effekte, etc. sind nicht die Ziele des Zauberspruches selbst.",
 "date": 0
},

{
 "card_id": 178,
 "title": "Kaiserkrone",
 "cost": "3",
 "color": "artifact",
 "type": "Artefakt, Einzigartigkeit",
 "body": "->, _5_: Dein Gegner gibt Dir eine Karte aus seiner Hand, aber recht höflich; Aktiviere diesen Effekt wie einen Gewaltzauber.",
 "strength": "",
 "extra": "Herrscher von Gottes Gnaden.",
 "rule_title": "Einzigartig",
 "rule": "Eine Einzigartigkeit kann nur einmal in der Welt sein. Wenn eine Einzigartigkeit in der Welt ist, so kann kein Effekt oder Zauberspruch angwendet werden, um eine weitere Einzigartigkeit dieser Art in die Welt zu bringen. Zudem ist eine Einzigartigkeit nur einmal pro Bibliothek erlaubt.",
 "date": 0
},

{
 "card_id": 179,
 "title": "Lügenprophet",
 "cost": "S",
 "color": "black",
 "type": "Kreatur",
 "body": "_1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "1/1",
 "extra": "Das Himmelslicht ward euch gegeben, und ihr verderbt es!.",
 "rule_title": "Licht und Schatten",
 "rule": "Alle Zaubersprüche und Effekte, die weiße Karten/Zaubersprüche betreffen, betreffen auch Schattenweiße. Alle Zaubersprüche die schwarze Karten/Zaubersprüche betreffen, betreffen auch lichtschwarze.",
 "date": 0
},

{
 "card_id": 180,
 "title": "Seerose",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _4_, Lege eine Karte ab, Übergebe die Kontrolle über den Lotos an Deinen Gegner: Beschwöre den letzten Zauberspruch Deines Gegners, welcher verwirklicht wurde, als der Lotos schon in Deiner Welt war.",
 "strength": "",
 "extra": "Meine Gegner respektiere ich, meine Feinde vernichten sich selber.",
 "rule_title": "INCANTATA",
 "rule": "Im tiefsten Sumpf aber erblüht die Lotosblüte.",
 "date": 0
},

{
 "card_id": 181,
 "title": "Hund",
 "cost": "WW",
 "color": "white",
 "type": "Kreatur, Wunder",
 "body": "Du kannst den Hund auch als Spontanzauber beschwören.",
 "strength": "0/4",
 "extra": "Stets bereit Dich zu schützen.",
 "rule_title": "Proaktiv",
 "rule": "Im Gegensatz zum Effekt der Wiederbelebung, die nicht als Antwort beschworen werden kann, weil die Wiederbelebung ein der Wiederbelebung benötigendes Ziel braucht, gibt es Zauber und Effekte die proaktiv sind, das heißt, daß man sie auf valide Ziele beschwören darf, die den Effekt nicht benötigen. Insbesondere können Zauber die Schaden verhindern auf noch nicht beschädigte Kreaturen zielen, die im Verlauf der Abwicklung der Kaskade dann Schaden erhalten, der dann verhindert wird. Der Effekt jener Zauber wird also vorgemerkt.",
 "date": 0
},

{
 "card_id": 182,
 "title": "Nacktschnecke",
 "cost": "S3",
 "color": "black",
 "type": "Kreatur",
 "body": "->: Lege eine Kopie dieser Nacktschnecke in die Welt.<br>Dein Gegner darf soviele Nacktschnecken mit einer Kreatur blocken, wie er will.",
 "strength": "0/1",
 "extra": "Da ist ja noch eine!",
 "rule_title": "Selbstbezielung",
 "rule": "Zaubersprüche können sich nicht selbstbezielen.",
 "date": 0
},

{
 "card_id": 183,
 "title": "Drachenschlachtung",
 "cost": "RR2",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Vernichte eine Kreatur: Du und Dein Gegner erhaltet je soviel farbloses Mana, wie die Beschörungskosten der Kreatur betragen haben; Wenn Dein Gegner seinen Anteil nicht zu seinem Manavorrat hinzufügen will, verfällt es.",
 "strength": "",
 "extra": "",
 "rule_title": "Ankündigung",
 "rule": "Nachdem du das Mantra der Reinheit enfernt hast, kann jeder Magier in seiner Hauptphase ankündigen, daß sein Gegener Märtyrer wird. Tue dies vorzugsweise mit den Worten: „お前はもう死んでいる (Omae wa mou shindeiru)“. Dadurch wird der Ankündigende der Verteidiger und sein Gegner wird der Angreifer. Der Verteidiger nennt die Anzahl an Runden (beginnend bei 0), die es dauern wird, bis der Angreifer Märtyrer wird. Ankündigen kann man nur in seiner Hauptphase. Der Angreifer erkennt seine Rolle an indem er (zeitlich-geistig vorversetzt) verkündet „Ich bin unüberwindbar!“.",
 "date": 0
},

{
 "card_id": 184,
 "title": "Durchsetzungskraft",
 "cost": "G",
 "color": "green",
 "type": "Unterbrechungszauber",
 "body": "Alternative Beschwörungskosten≔ Lege eine Karte ab, welche die Farbe _______ hat, Zahle einen Lebenspunkt.<br>Mache einen Zauberspruch unkonterbar.",
 "strength": "",
 "extra": "",
 "rule_title": "Verteidigungskunst",
 "rule": "INCANTATA ist höchste Verteidigungskunst.",
 "date": 0
},

{
 "card_id": 185,
 "title": "Titan",
 "cost": "BB4",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Zusätzliche Beschwörungskosten≔ Wähle eine fliegende Kreatur; der Besitzer muß jene Kreatur auf seine Hand nehmen.<br>Fliegt.",
 "strength": "5/6",
 "extra": "",
 "rule_title": "Gleichzeitigkeit",
 "rule": "Von kosmischer Gleichzeitigkeit können wir sprechen, wenn die Erkenntnis über etwas, im gesamten Kosmos zur selben Zeit erkannt werden kann.",
 "date": 0
},

{
 "card_id": 186,
 "title": "Erinnerungsmanipulation",
 "cost": "S3",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Nimm einen Zauberspruch aus Deiner letzten Teilrunde zurück.",
 "strength": "",
 "extra": "Wie soll man mich nun noch der Lüge überführen?",
 "rule_title": "Rücknahme von Zaubersprüchen.",
 "rule": "Wenn ein Zauberspruch zurückgenommen wird, so wird er wieder auf die Hand genommen und der Zauberspruch wird auch aus der Ideenwelt entfernt - Beschwörungskosten werden allerdings nicht zurückgenommen. Wenn nicht ausdrücklich ein Punkt im Weltenlauf genannt wird (z.B. „letzte Runde“), so kann nur ein Zauberspruch in der noch aktiven Kaskade zurückgenommen werden.",
 "date": 0
},

{
 "card_id": 187,
 "title": "Herausforderung",
 "cost": "R2",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Beschwöre die Herausforderung vor der Angriffsphase. Der aktive Magier greift mit allen Kreaturen, die können, an.",
 "strength": "",
 "extra": "",
 "rule_title": "Aktiv, Passiv",
 "rule": "Der Magier dessen Teilrunde gerade stattfindet ist der aktive Magier, alle anderen sind passive Magier.",
 "date": 0
},

{
 "card_id": 188,
 "title": "Schildwall",
 "cost": "W",
 "color": "white",
 "type": "Verzauberung",
 "body": "Alle Deine Kreaturen mit der Stärke 0 erhalten +0/+2.",
 "strength": "",
 "extra": "Wie eine lebende Mauer.",
 "rule_title": "Die 7-1 Welten",
 "rule": "Es gibt 7-1 Welten: 1. Ideenwelt 2. Kosmos (Summe aller Ekliptiken, Himmelskörper in der Welt und aller Raumzeitgefüge) 3. Gedankenwelt (Summe aller Teilgedankenwelten=Handkarten eines Magiers) 4. Welt (Summe aller Teilwelten) 5. Schriftwelt (Summe aller Bibliotheken) 6. Unterwelt (Summe aller Teilunterwelten) Z. Unwelt (=Hölle)<br><br>Die Magieravatare sind der Ideenwelt angehörige Wirkungsknoten und von ihnen allein geht alle Wirkung aus.<br><br>Die Reihenfolge der Welten in dieser Aufzählung ist als absteigend zu verstehen (offensichtlich).<br><br><i>„Die Wirklichkeit ist das Faszinosum.“</i>",
 "date": 0
},

{
 "card_id": 189,
 "title": "Eiserne Jungfrau",
 "cost": "R",
 "color": "red",
 "type": "Magierverzauberung",
 "body": "Der Magier erhält einen Schaden, falls er in seiner Versorgungsphase 4 oder mehr Karten auf der Hand hat.",
 "strength": "",
 "extra": "Aber schön langsam.",
 "rule_title": "Das Antwortparadoxon",
 "rule": "Oft ist es nicht sinnvoll einen Zauberspruch als Antwort zu beschwören, weil er dann zuerst verrechnet werden würde. In solchen Fällen muß man die Abwicklung der Kaskade abwarten und eine neue beginnen. Beispiel: Windstoß als Antwort auf ein Loslassen zu beschwören ist nicht möglich, da die Kreatur noch nicht fliegt ⇒ man läßt die Verwirklichung des Loslassen zu und eröffnet eine neue Kaskade mit dem Windstoß.",
 "date": 0
},

{
 "card_id": 190,
 "title": "Kakadu",
 "cost": "G2",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>_G_: Wiederbelebung.<br>->, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "1/1",
 "extra": "Lora ist da! Lora ist da!",
 "rule_title": "Hinweise",
 "rule": "Wenn eine Kreatur erfolgreich beschworen ist und somit verwirklicht, hat sie keinen weltlichen Hinweis auf die Existenz von Magiern.",
 "date": 0
},

{
 "card_id": 191,
 "title": "Heitere Gelassenheit",
 "cost": "W1",
 "color": "white",
 "type": "Spontanzauber, Wunder",
 "body": "Du und Deine Kreaturen können in der nächsten Teilrunde nicht das Ziel von Zaubersprüchen sein.<br>_5_: Erinnern.",
 "strength": "",
 "extra": "Wenn du jemand verwirren willst, versuche ihm etwas zu schenken.",
 "rule_title": "Zunichte",
 "rule": "Am Ende der Begegnung wird die „Spielwelt“ wird vollendet/abgeschlossen). Länder, Raumzeitgefüge und Himmelkörper sind transzendent (genau so wie die Ideenwelt), das heißt, das sie schon immer da waren. Länder, Raumzeitgefüge und Himmelskörper erscheinen also in der Welt, als Bild ihrer natürlichen Entwicklung.",
 "date": 0
},

{
 "card_id": 192,
 "title": "Klosterbibliothek",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Wenn Du keine Karte auf Deiner Hand hast, darfst Du eine Karte ziehen.",
 "strength": "",
 "extra": "So manch geheime Schrift ist hier verborgen.",
 "rule_title": "Opfer",
 "rule": "Opfer nennt man Kreaturen/Magier, die Schaden erhalten von entweder gezielten oder von ungezielten Zaubern/Effekten.",
 "date": 0
},

{
 "card_id": 193,
 "title": "Erträumte Einhörner",
 "cost": "WW",
 "color": "white",
 "type": "Kreatur, Vielheit",
 "body": "Wenn mehr als ein erträumtes Einhorn in der Welt ist, sind alle erträumten Einhörner grüne 2/3 Kreaturen.",
 "strength": "0/3",
 "extra": "Millionen...",
 "rule_title": "Erscheinung",
 "rule": "Einhörner erscheinen genau zur richtigen Zeit.",
 "date": 0
},

{
 "card_id": 194,
 "title": "Dunkle Aura",
 "cost": "S1",
 "color": "black",
 "type": "Kreaturenentzauberung",
 "body": "Kann wie ein Spontanzauber beschworen werden. Verzauberungen haben keine Wirkung auf die Kreatur.",
 "strength": "",
 "extra": "",
 "rule_title": "Entzauberungen",
 "rule": "Für Entzauberungen gelten dieselben Regeln, wie für Verzauberungen, jedoch wirken Zaubersprüche, die sich auf Verzauberungen beziehen, nicht auf Entzauberungen.",
 "date": 0
},

{
 "card_id": 195,
 "title": "Spiegelschild",
 "cost": "1",
 "color": "light_grey",
 "type": "Energiezauber, Legende",
 "body": "Zusätzliche Beschwörungskosten≔ Zahle einen Lebenspunkt.<br>Wähle ein neues Ziel für einen aktivierbaren Effekt.",
 "strength": "",
 "extra": "",
 "rule_title": "Energiekaskade I",
 "rule": "Beim Beschwören von Zaubersprüchen und Aktivierung von Effekten werden alle nötigen Beschwörungskosten (Ankanten, Opfern, etc.) nachvollziehbar erläutert und werden vorgemerkt an die Gleichzeitigkeitskaskade angehängt. Da aber die Verwirklichung der Vormerkungen der Beschwörungskosten meist Energiegeschwindigkeit haben, können Zaubersprüche mit Energiegeschwindigkeit jene manipulieren (z.B. nullifizieren). Man kann auf Manipulation vorgemerkter Beschwörungskosten stets antworten (noch ein Mana hinzufügen, eine andere Kreatur opfern), aber nur vor ihrer Abwicklung in der Energiekaskade.",
 "date": 0
},

{
 "card_id": 196,
 "title": "Honigdachs",
 "cost": "GGG1",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Der Honigdachs greift immer an.<br>Verursacht Durchbruchsschaden.",
 "strength": "4/4",
 "extra": "Das schert den Honigdachs doch nicht.",
 "rule_title": "Energiekaskade II",
 "rule": "Wenn die Gesamtkaskade abgeschlossen ist und die Abwicklung der Energiekaskade beginnt, werden alle Effekte und Zaubersprüche, die Energiegeschwindigkeit haben, verwirklich (vor allem Manaeffekte)(letzter zuerst), alle anderen Vormerkungen werden noch nicht verrechnet - der Manapool füllt sich. Die Energiekaskade wird ganz abgewickelt und erst dann wird geprüft ob genug Mana (oder andere Beschwörungskosten) für alle Energieeffekte vorhanden ist (vergleiche Regel 645). Danach werden die langsameren Kaskaden abgewickelt.",
 "date": 0
},

{
 "card_id": 197,
 "title": "Kampffortpflanzung",
 "cost": "GG",
 "color": "green",
 "type": "Verzauberung",
 "body": "Jeder Magier darf eine Kopie einer Kreatur in seine Welt legen; Vernichte jene Kreaturen, wenn die Kampffortpflanzung die Welt verlässt.",
 "strength": "",
 "extra": "",
 "rule_title": "Energiekaskade III",
 "rule": "Bedenke, daß die <u>Verrechnung</u> der Beschwörungskosten gleichzeitig mit dem (langsameren) Effekt bei verwirklichung gleichzeitig geschieht. Zum Beispiel: Falls ein Seelenheiler durch eine Energiesenke vorher angekantet wurde, und nun der Effekt des Seelenheilers drankommt, so kann das vorgemerkte Ankanten des Seelenheilers nicht mehr durchgeführt werden, und sein Effekt findet nicht statt. Genauso können Manipulationen der Energiekaskade vorgemerkte Beschwörungskosten entfernen (z.B. Mana) und der Effekt/Zauberspruch kann zur Zeit seiner Verwirklichung nicht geschehen. Im Falle von mangeldem Mana kann der Beschwörer selbst entscheiden, welches Mana er wo spart. Im Falle von anderen (Ankanten, Opfern) geht das nicht.",
 "date": 0
},

{
 "card_id": 198,
 "title": "Irrer Wissenschaftler",
 "cost": "RR1",
 "color": "red",
 "type": "Kreatur, Wunder",
 "body": "Alle Artefaktkreaturen erhalten +1/+1.",
 "strength": "1/2",
 "extra": "",
 "rule_title": "Errata I",
 "rule": "zu 137: Mit Segelyacht ist auch das Segelboot selbst gemeint.",
 "date": 0
},

{
 "card_id": 199,
 "title": "Zauberassistentin",
 "cost": "B2",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "->, _2_: Tausche unterbrechend die Reihenfolge zweier Zaubersprüche aus.<br>->, _G_: Tausche unterbrechend die Reihenfolge zweier Zaubersprüche aus.",
 "strength": "1/2",
 "extra": "Upsi!",
 "rule_title": "Nur eine Empfehlung",
 "rule": "Beschwöre die Zauberassistentin möglichst mit Blumenmana.<br><br>Merke: die Reihenfolge zweier Zaubersprüche kann man stets nur austauschen, wenn sie in derselben Kaskade sind.",
 "date": 0
},

{
 "card_id": 200,
 "title": "Eröffnung",
 "cost": "R3",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier vernichten nacheinander ein Drittel ihrer Länder, Kreaturen, Artefakte und Verzauberungen.",
 "strength": "",
 "extra": "Es wäre nun besser zu verstehen.",
 "rule_title": "Nacheinander",
 "rule": "Falls ein Zauberspruch mehrere Effekte nacheinander auslöst (oder mehrere Effekte mit . getrennt oder abhängige Effekte mit ; getrennt hat), so werden jene wie einzelne Zaubersprüche behandelt und entsprechend an die Kaskade angefügt - und zwar der letzte zuerst. Alle Effekte des Zauberspruches werden gleichzeitig an die Kaskade angefügt. Das heißt auch, daß der beschwörende Magier sich für alle Effekte, die eine Entscheidung oder Aktivierungskosten erforden, bei der Beschwörung festlegen muß. Die Erfüllungsbedingungen von abhängigen Effekten werden bei der Abwicklung der Kaskade überprüft. Der Gesamtzauberspruch ist als Klammer um die Menge der Effekte zu denken und wird, falls gekontert, insgesamt gekontert.",
 "date": 0
},

{
 "card_id": 201,
 "title": "Zeitecho",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Erstelle eine Kopie eines Zauberspruches Deines Gegners aus der letzten Teilrunde und übergebe die Kontrolle an Deinen Gegner.",
 "strength": "",
 "extra": "",
 "rule_title": "Abhängigkeit",
 "rule": "Wenn zwei (oder mehrere) Bleibekarten voneinander abhängig sind und die eine wird angekantet, so werden die anderen, wenn sie angekantete, ist zurückgestellt, oder, wenn sie nicht angekantet sind, angekantet.",
 "date": 0
},

{
 "card_id": 202,
 "title": "Verwilderung",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Verwandle ein Land in einen Wald.",
 "strength": "",
 "extra": "Die Natur nimmt sich alles zurück.",
 "rule_title": "Soll nicht und darf nicht",
 "rule": "INCANTATA darf nicht um Geld gespielt werden. Das heißt, daß es keine Geldpreise für [Turniergewinne/Begegnungen allgemein] geben darf. Allerdings darf man INCANTATA-Magier bezahlen dafür, daß sie spielen (unabhängig von Spielausgang).",
 "date": 0
},

{
 "card_id": 203,
 "title": "Kintsugi",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Repariere eine Bleibekarte, die keine Kreatur ist.",
 "strength": "",
 "extra": "Jetzt ist es perfekt.",
 "rule_title": "Reparieren",
 "rule": "Reparieren ist ähnlich zu Wiederbeleben für Kreaturen.",
 "date": 0
},

{
 "card_id": 204,
 "title": "Höllenbote",
 "cost": "SSS",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Wenn der Höllenbote einen Magier Schaden zugefügt hat, legt jener eine Karte von seiner Hand ab.",
 "strength": "2/2",
 "extra": "Es gibt Sachen, die vergisst man besser.",
 "rule_title": "Kreaturentod",
 "rule": "Stets am Ende jeder Phase sterben alle Kreaturen, die 0 oder weniger Widerstandskraft haben. Da vor dem Ende jeder Phase eine mögliche Schnelleffektphase ist, ist es sinnvoll Schadensverhinderungs- und Wiederbelebungseffekte an jener Stelle zu nutzen. Dies ist insbesondere in der Kampfphase wichtig, denn bedenke, daß nach der Kampfschadenverrechnung (vor dem Ende der Kampfphase), noch eine Schnelleffektphase möglich ist.",
 "date": 0
},

{
 "card_id": 205,
 "title": "Feldverhandlungen",
 "cost": "W1",
 "color": "white",
 "type": "Verzauberung",
 "body": "Vor Beginn jeder Teilrunde stimme mit Deinen Gegnern ab, wieviele Zaubersprüche höchstens von jedem Magier nächste Teilrunde beschworen werden können; Falls ihr euch nicht einig werdet, so dürfen höchsten 2 Zaubersprüche je Magier beschworen werden.",
 "strength": "",
 "extra": "",
 "rule_title": "Denkpause",
 "rule": "Das „-“ wird als Gedankenstrich verwendet.",
 "date": 0
},

{
 "card_id": 206,
 "title": "A-Nerin-Daág",
 "cost": "W1",
 "color": "white",
 "type": "Unterbrechungszauber, Wunder",
 "body": "Kontert einen Zauberspruch, der Schadenspotential hat.",
 "strength": "",
 "extra": "Ein Zauber aus längst vergangenen Zeiten.",
 "rule_title": "Schadenspotential",
 "rule": "Eine Kreaturzauber, der eine Kreatur hervorbringen würde, die die 0 Stärke hat oder nicht angreifen kann, hat kein Schadenspotenial. Kreaturenzauber verstärkbarer Kreaturen haben Schadenspotential",
 "date": 0
},

{
 "card_id": 207,
 "title": "Wahrer Krieger",
 "cost": "2SSWW",
 "color": "light_black",
 "type": "Kreatur, Legende",
 "body": "Gilt als lichtschwarze Karte. Entferne alle Kreaturen, die gegen den wahren Krieger gekämpft haben und tödlichen Schaden erhalten haben, nach dem Kampf aus der Welt.<br>_2__S__S__W__W_: Erinnern.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Glückskartenwurf",
 "rule": "Falls eine Karte einen Glückskartenwurf anfordert, so werden die Regeln für Glückskartenwurf (Handhaltung, Höhe, ausgewogene Kunstoffkarte etc.) so gewählt, daß stets die beste Kartenzufallswurfmaschine unter diesen Regeln keinen statistisch signifikanten Vorteil erwerfen kann.<br><br>Daraus folgt: Es gibt sowohl in der Wirklichkeit, als auch im Krypto-Universum zuverlässige Zufallsgeneratoren (und die entsprechende Infrastruktur herum).",
 "date": 0
},

{
 "card_id": 208,
 "title": "Magnolienblüte",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, Opfere die Magnolienblüte, Kante einen goldenen Avatar an: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>->, Opfere die Magnolienblüte, Opfere ein Land: Füge Dir 3 Lebenspunkte hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Friedensbrecher - Verräter",
 "rule": "Derjenige Magier, der die Begegnung eröffnet, wird Friedensbrecher oder Verräter genannt. Um festzustellen, wer die Begegnung eröffnen kann, zieht jeder Magier zufällig eine Karte aus seiner Bibliothek. Derjenige, mit der Karte mit den höchsten Beschwörungskosten, darf den Begegnungseröffner wählen.<br>Beachte:<br>∘ ein X zählt als 2,5<br>∘ Beschwörungskosten von 0 > Land.<br>∘ Farbiges Mana ist wertiger ⇒ Eule > Untoter.",
 "date": 0
},

{
 "card_id": 209,
 "title": "Amnesie",
 "cost": "SS",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Kraftaufwand≔ _S_.<br>Ein Magier wählt 2 Handkarten und legt jene ab.",
 "strength": "",
 "extra": "",
 "rule_title": "Diplomatie",
 "rule": "Während einer Begegnung kann es passieren, daß zwei oder mehr Magier diplomatische Verträge schließen (z.B. Nichtangriffspakt, Absprachen vor der Benutzung der Guillotine, „Wenn ich A zerstöre, dann zerstörst du B.“, etc.). Die Absprachen dafür werden öffentlich am Tisch getätigt und dürfen nicht offenbaren welche Karten man auf der Hand hat. Das Brechen von Absprachen ist jederzeit erlaubt. All das gehört zum Spiel.",
 "date": 0
},

{
 "card_id": 210,
 "title": "Schmerz",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber, Verdammnis",
 "body": "Füge einem Ziel einen Schaden zu.<br>_R__R__R__R_: Erinnern",
 "strength": "",
 "extra": "Beizeiten ist es lehrreich sich den Schmerz zumindest in Erinnerung zu rufen.",
 "rule_title": "Erinnern",
 "rule": "Ein Zauberspruch mit Erinnern kann, wenn er zumindest einmal verwirklicht wurde, aus der Unterwelt zurück auf die Hand genommen werden. Die Geschwindigkeit dafür ist Spontanzaubergeschwindigkeit.",
 "date": 0
},

{
 "card_id": 211,
 "title": "Kleeblatt",
 "cost": "0",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Gilt als weiße Karte. Dein Gegner wählt eine Karte aus Deiner Bibliothek. Nimm jene Karte in die Hand.",
 "strength": "",
 "extra": "Tugenden sind Belohungen, Belohungen sind Tugenden.",
 "rule_title": "Spinnen",
 "rule": "Spinnen können fliegende Kreaturen blocken.",
 "date": 0
},

{
 "card_id": 212,
 "title": "Flugunfähiger Spatz",
 "cost": "G",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Glückskartenwurf: Zu Deinen Gunsten ⇒ Temporär +1/+1 und Flugfähigkeit, Entgegen Deinen Gunsten ⇒ Wird zu einer 0/1 Kreatur ohne Flugfähigkeit und Du kannst diesen Effekt diese Runde nicht mehr aktivieren.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Verschwinden",
 "rule": "Falls eine bleibende Karte verschwindet, so taucht sie in der nächsten Erneuerungsphase ihres Beherrschers wieder auf. Verschwindende Karten verschwinden mit allen Verzauberungen und Signa und tauchen ebenso wieder auf.",
 "date": 0
},

{
 "card_id": 213,
 "title": "Nachtsonnenblume",
 "cost": "S",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "->, _1_: Speichere ein Mondmana in der Nachtsonnenblume. ->: Füge beliebig viele zuvor gespeicherte Mana, als weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "0/1",
 "extra": "Ihre Schönheit wird erst durch die Nacht ganz sichtbar.",
 "rule_title": "Himmelsmana",
 "rule": "Die verschiedenen Himmelskörper spenden ja zumeist farbloses Mana, aber die Herkunft kann trotzdem wichtig sein. Zum Beispiel spendet der Mond „Mondmana“.",
 "taken": true,
 "date": 0
},

{
 "card_id": 214,
 "title": "Zeitmanipulation",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber, Legende",
 "body": "Setze die nächste Teilrunde aus: Habe nach Deiner nächsten Teilrunde eine weitere Teilrunde.",
 "strength": "",
 "extra": "Es sieht zunächst wie ein Zurückweichen aus...",
 "rule_title": "Heilung",
 "rule": "Nach einer Teilrunde werden bei allen Kreaturen die Stärke und Widerstandskraft wiederhergestellt.",
 "date": 0
},

{
 "card_id": 215,
 "title": "Blutiges Schlachtfest",
 "cost": "SS3",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Zusätzliche Beschwörungskosten≔ Opfere eine Kreatur.<br>Dein Gegner opfert bis zu 2 Kreaturen.<br>Nachwirkung≔ Stelle 2 Himmelskörper zurück.",
 "strength": "",
 "extra": "Zuerst scheut man sich...",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 216,
 "title": "Waldmeister",
 "cost": "G2",
 "color": "green",
 "type": "Spontanzauber, Legende",
 "body": "Mische eine Kreatur von Deiner Hand in Deine Bibliothek; Ziehe 3 Karten.",
 "strength": "",
 "extra": "Ein besonderes Gewächs.",
 "rule_title": "(δ)",
 "rule": "(δ)<br><br><i>„Durch die Arbeit am Unsichtbaren erstrahlt das Äußere im wahrhaftigen Glanze.“</i>",
 "date": 0
},

{
 "card_id": 217,
 "title": "Duplikat",
 "cost": "B2",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kopiere einen Zauberspruch, den Du diese Teilrunde bereits beschworen hast, wobei Du dessen Beschwörungskosten bezahlen mußt.",
 "strength": "",
 "extra": "(δ)",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 218,
 "title": "Bluthimmelvollmond",
 "cost": "SS1",
 "color": "black",
 "type": "Verzauberung, Legende",
 "body": "Jeder Magier zahlt vor Beginn seiner Teilrunde einen Lebenspunkt für jeden seiner Himmelskörper, welcher nicht angekantet ist; dieser Effekt wird erst vor Beginn Deiner nächsten Teilrunde wirksam.",
 "strength": "",
 "extra": "",
 "rule_title": "Vertrauen",
 "rule": "Großmagier sind vollkommen vertrauenswürdig.",
 "date": 0
},

{
 "card_id": 219,
 "title": "Teuflischer Vertrag",
 "cost": "S",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Nimm eine Karte aus Deiner Bibliothek in Deine Hand. Nimm zufällig und verdeckt eine Karte aus Deiner Bibliothek und mische sie in die Bibliothek Deines nächsten Gegners; er darf die Beschwörungskosten dieser Karte mit farblosem Mana bezahlen.",
 "strength": "",
 "extra": "",
 "rule_title": "Retten",
 "rule": "Seinen Gegner zu retten heißt:∘ Seine Lebenspunkte werden auf 1 gesetzt werden, falls er 0 oder weniger hat<br>∘ Er muß keine Karte ziehen, falls er keine Karten mehr in seiner Bibliothek hat.",
 "date": 0
},

{
 "card_id": 220,
 "title": "Donnerschlag",
 "cost": "RR",
 "color": "red",
 "type": "Gewaltzauber, Wunder",
 "body": "Alle Kreaturen erhalten 2 Schaden.",
 "strength": "",
 "extra": "Wenn man den Donner hört, ist es schon längst zu spät.",
 "rule_title": "Zu zweit",
 "rule": "Zu zweit wird im Duell-Modus gespielt. Für das Spiel zu zweit sind einige Karten weniger sinnvoll (z.b. Regenbogenpony, Vertrauen). Darüber hinaus sind auch Karten nicht erlaubt. Sie müssen vor dem Spiel entfernt werden und durch eine Karte aus dem Bibliothekskeller ersetzt werden. Folgende Karten sind im Zweierspiel nicht erlaubt:<br>∘ Guillotine<br>∘ Namenloser",
 "date": 0
},

{
 "card_id": 221,
 "title": "Ariadnefaden",
 "cost": "B2",
 "color": "blue",
 "type": "Verzauberung, Legende",
 "body": "->, _1_: Schaue Dir die obersten 3 Karten in Deiner Bibliothek an und lege sie offen oder verdeckt in beliebiger Reihenfolge zurück.<br>->: Mische gewaltig eine Karte von Deiner Hand in Deine Bibliothek.",
 "strength": "",
 "extra": "",
 "rule_title": "Zu dritt",
 "rule": "Zu dritt wird im Macht-Modus gespielt. Derjenige Magier gewinnt, dessen linkssitzender Magier Märtyrer ist. Mit Kreaturen kann man nur seinen linken Magier angreifen und kann nur zwischenblocken, falls der rechtssitzende Magier in Gefahr steht durch einen Kreaturenangriff seine Lebenspunkte zu verlieren. Zaubersprüche und Effekte können jedoch stets zugunsten oder zulasten jedweden Magiers beschworen/aktiviert werden. In diesem Modus gelten alle anderen Magier als Feinde.",
 "date": 0
},

{
 "card_id": 222,
 "title": "Bogenschütze",
 "cost": "G2",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "->: Zerstöre eine fliegende Kreatur, die diese Teilrunde bereits Schaden erhalten hat aus einer Quelle, die Du nicht kontrollierst.",
 "strength": "1/1",
 "extra": "Mit sicherer Hand ... mit den Augen des Adlers.",
 "rule_title": "Zu viert",
 "rule": "Zu viert wird im Doppeladler-Modus gespielt. Man sitzt in Rautenordnung. Die Magier markieren je einen ihrer Himmelskörper. Der Erste und der Letzte, der seinen markierten Himmelskörper zieht, spielen zusammen gegen die anderen beiden. Jeder kann jeden angreifen. Zwischenblocken ist nicht gestattet. Die Begegung endet, wenn beide Magier einer Partei Märtyrer sind.",
 "date": 0
},

{
 "card_id": 223,
 "title": "Befreiung",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Vernichte alle Verzauberungen und Signa, die auf einer Kreatur sind.<br>_W__W__W__W__W_: Erinnern.",
 "strength": "",
 "extra": "... es gibt keine Auswege zu wählen. Ein Ausweg, der wird erfunden.",
 "rule_title": "Nicht zu fünft",
 "rule": "Am besten ist INCANTATA als große Begegnung - zu fünft. Allerdings kann man zu viert, zu dritt und zu zweit spielen. Mehr als 5 Magier sollten mehrere Spieltische eröffnen. Begegungnen sollten in folgender Reihenfolge bevorzugt werden: 1. zu fünft 2. zu dritt 3. zu viert 4. zu zweit.<br><br>Die grundlegende Wirkung enfaltet INCANTATA schon im Macht-Modus, und (stärker abgeschwächt) in Duell-/Doppeladler- Modus. Zur vollen Entfaltung kommt Incantata in der großen Begegung, deswegen wird er auch Krönungs-Modus genannt.",
 "date": 0
},

{
 "card_id": 224,
 "title": "Moloch",
 "cost": "SS1",
 "color": "black",
 "type": "Unterbrechungszauber, Legende",
 "body": "Zusätzliche Beschwörungskosten≔ Opfere eine Kreatur.<br>Erhalte soviele Lebenspunkte wie die geopferte Kreatur Widerstandskraft hatte.",
 "strength": "",
 "extra": "Nun bist du dran!",
 "rule_title": "Konsequent",
 "rule": "Man muß stets mit Bestimmtheit zaubern; das heißt das Zurücknehmen von Zaubersprüchen, ohne passenden Karte ist nicht gestattet.",
 "date": 0
},

{
 "card_id": 225,
 "title": "Morgenstern",
 "cost": "B",
 "color": "blue",
 "type": "Spontanzauber, Legende",
 "body": "Teil einer 3er-Spontankaskade. Alle Magier dürfen bis zu 4 Karten ziehen, allerdings nur soviele, daß sie je höchstens 7 auf der Hand haben.",
 "strength": "",
 "extra": "Endlose Geduld ... das heißt doch den richtigen Zeitpunkt erkennen!",
 "rule_title": "Zaubermachtprobe",
 "rule": "Der Zaubermachtprobe ist die Methode, die in Regel 634 beschrieben ist um den Friedensbrecher zu bestimmen. Also: zufällige Karte aus der Bibliothek ziehen; höchsten Beschwörungskosten gewinnen.",
 "taken": true,
 "date": 0
},

{
 "card_id": 226,
 "title": "Neugier",
 "cost": "W1",
 "color": "white",
 "type": "Unterbrechungszauber, Legende",
 "body": "Schaue Dir die obersten 3 Karten Deiner Bibliothek an und lege sie in beliebiger Reihenfolge zurück; Ziehe eine Karte.",
 "strength": "",
 "extra": "Dir sei vergeben.",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 227,
 "title": "Zeitzwinkern",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Nehme eines Deiner Artefakte auf die Hand und lege es, ohne die Beschwörungskosten zu zahlen, später in dieser Teilrunde in Deine Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "Belohungen",
 "rule": "Für redliches Bemühen wird man belohnt.",
 "date": 0
},

{
 "card_id": 229,
 "title": "Lederrüstung",
 "cost": "4",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Reduziere Schaden, je Quelle, um eins.",
 "strength": "",
 "extra": "",
 "rule_title": "Verdammnisse",
 "rule": "Verdammnisse sind, genau wie Wunder, nur zweimal pro Bibliothek erlaubt.",
 "date": 0
},

{
 "card_id": 230,
 "title": "Stark gehopftes Bier",
 "cost": "GG3",
 "color": "green",
 "type": "Gewaltzauber, Legende",
 "body": "Beschwöre diese Teilrunde nur diesen Zauberspruch; In Deiner nächsten Teilrunde produzieren Deine Himmelskörper je _1_ mehr.",
 "strength": "",
 "extra": "Es erfrischt enorm",
 "rule_title": "Dominanzfarbe",
 "rule": "Die Dominanzfarbe ist festgelegt durch folgendes: Einzelne Schicksalsfarbe, der die meisten Magier dieser Begegnung angehören<br>Falls diese nicht festgestellt werden kann, so sind alle Effekte, die sich auf die Schicksalsfarbe beziehen zu ignorieren. Falls die meisten Magier Schicksalslos sind, so ist die Dominanzfarbe farblos. Falls Magier ohne Schicksal beginnen, aber später ein farbiges Schicksal erhalten, so ändert sich die Farbe ihres Schicksals und möglicherweise auch die Dominanzfarbe.",
 "date": 0
},

{
 "card_id": 231,
 "title": "Konzentration",
 "cost": "0",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Gilt als rote Karte. Zusätzliche Beschwörungskosten≔ Zahle _2_ in Deiner nächsten Versorgungsphase falls Du ein rotes Schicksal hast, sonst zahle _1__R_. Kontert einen Gewaltzauber. Du darfst Konzentration auch außerhalb Deiner Hauptphase beschwören. ",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "Die Katze gehört zum Haus.",
 "date": 0
},

{
 "card_id": 232,
 "title": "Flammenpferdreiter",
 "cost": "R3",
 "color": "red",
 "type": "Kreatur, Legende",
 "body": "Alle Magier müssen stets mit allen Kreaturen, die können, angreifen.",
 "strength": "1/2",
 "extra": "Wohl dem, der noch eine andere Profession hat.",
 "rule_title": "Dynamische Eigenschaften",
 "rule": "Dynamische Eigenschaften sind Eigenschaften, die von sich ändernden Bedigungen abhängen. Falls nicht anders angegeben werden diese Bedingungen nur einmal pro Runde ermittelt.",
 "date": 0
},

{
 "card_id": 233,
 "title": "Schwarzer Reiter",
 "cost": "SSS3",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Jede Kreatur erhält ein -1/-1 Signum in jeder Versorgungsphase.",
 "strength": "6/6",
 "extra": "",
 "rule_title": "Umgekantet",
 "rule": "Falls eine Bleibekarte umgekantet ist, so kann man sich vorstellen, daß sie zweimal angekantet ist. Das heißt, daß sie zweimal zurückgestellt werden müsste um unangekantet zu sein. Im Allgemeinen heißt das dann, daß 2 Erneuerungsphasen notwendig sind um die Karte ganz zurückzustellen.",
 "date": 0
},

{
 "card_id": 234,
 "title": "Tabakspfeife",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Jeder Magier darf je nur einen Schnellzauber pro Runde beschwören.",
 "strength": "",
 "extra": "Eine gute Pfeife verwandelt eine Hütte in einen Palast.",
 "rule_title": "Gandalfs Pfeife",
 "rule": "Wer Gandalf die Tabakspfeife vergällen will, wird nicht ungeschoren davonkommen.<br><br>„But Gandalf laughed, and replied: ‘You would not wonder, if you used this herb yourself. You might find that smoke blown out cleared your mind of shadows within. Anyway, it gives patience, to listen to error without anger.“",
 "date": 0
},

{
 "card_id": 235,
 "title": "Erzwingen",
 "cost": "R4",
 "color": "red",
 "type": "Gewaltzauber, Ausschließlichkeit",
 "body": "Du erhälts 5 Lebenspunkte; Tausche Plätze mit einem Magier.",
 "strength": "",
 "extra": "",
 "rule_title": "Todsünden",
 "rule": "Die Todsünden sind die Karten ICT-459 bis ICT-465.",
 "date": 0
},

{
 "card_id": 236,
 "title": "Namenloser",
 "cost": "4",
 "color": "light_grey",
 "type": "Kreatur, Seltenheit",
 "body": "Schicksalslose Inkarnation.Schutz vor Dominanzfarbe.->, _3_: Eine befreundete Kreatur kann temporär nicht das Ziel von Zaubersprüchen sein.<br>->: Füge ein Mana einer Schicksalsfarbe eines Deiner Gegner zu Deinem Manavorrat hinzu.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Bestimmung",
 "rule": "Wenn man mit einem Schicksal beginnt, so hat man ein Schicksal. Wenn man ohne Schicksal beginnt, aber zieht eins, dann hat man ein Schicksal. Wenn man kein Schicksal hat, so ist man schicksalslos. Wenn man schicksalslos ist, kann man eine schicksalslose Inkarnation beschwören. Falls man eine schicksalslose Inkarnation unter seiner Kontrolle hat und ein Schicksal erhält, so wird die schicksalslose Inkarnation aus der Welt entfernt. Wenn man schicksalslos ist, so ist die Farbe seines Schicksals (welches man nicht hat) farblos.",
 "date": 0
},

{
 "card_id": 237,
 "title": "Weltfrieden",
 "cost": "W",
 "color": "white",
 "type": "Verzauberung, Legende",
 "body": "Es können keine Gewaltzauber mehr beschworen werden.",
 "strength": "",
 "extra": "Die Spatzen pfeifen es von den Dächern.",
 "rule_title": "Unmündig",
 "rule": "Unmündigkeit ist das Unvermögen, sich seines Verstandes ohne Leitung eines anderen zu bedienen. Selbstverschuldet ist diese Unmündigkeit, wenn die Ursache derselben nicht am Mangel des Verstandes, sondern der Entschließung und des Mutes liegt, sich seiner ohne Leitung eines anderen zu bedienen.",
 "date": 0
},

{
 "card_id": 238,
 "title": "Vertrauen",
 "cost": "G",
 "color": "green",
 "type": "Verzauberung, unzerstörbar",
 "body": "Geschenk.<br>Wenn ein anderer Magier, der nicht Du bist, auch ein Vertrauen unter seiner Kontrolle hat, könnt ihr in eurer Zugphase je 2 Karten ziehen.",
 "strength": "",
 "extra": "Über magische Wirkung nicht wundern!",
 "rule_title": "Universumsbegegnung",
 "rule": "(δ841)",
 "taken": true,
 "date": 0
},

{
 "card_id": 239,
 "title": "Turniergroßmagierdiplom",
 "cost": "0",
 "color": "artifact",
 "type": "Auszeichung",
 "body": "Gilt als lichtgraue Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 241,
 "title": "Turniergroßmagierdiplom",
 "cost": "0",
 "color": "artifact",
 "type": "Auszeichung",
 "body": "Gilt als lichtgraue Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Auszeichnung",
 "rule": "Eine Auszeichung ist: Artefakt, unzerstörbar",
 "date": 0
},

{
 "card_id": 242,
 "title": "Hexengebräu",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Jeder Zauberspruch hat zusätzliche Beschwörungskosten von _1_.",
 "strength": "",
 "extra": "Die Hexen haben so ihre Mittelchen.",
 "rule_title": "Welteneinschränkung",
 "rule": "Alle aktivierbaren Effekte von Bleibekarten, außer „Erinnern“, können nur aktiviert werden, wenn die betroffene Karte in der Welt ist. Falls eine Karte einen aktivierbaren Effekt hat, der auch in anderen Welten aktivierbar ist und dieser Effekt ein Ankanten erfordert, so wird jene Karte in der Erneuerungsphase zurückgestelt.",
 "date": 0
},

{
 "card_id": 243,
 "title": "Monolith",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->: Bewege den Monolith in eine Welt/Teilwelt Deiner Wahl; dieser Effekt ist in allen Welten aktivierbar.",
 "strength": "",
 "extra": "Unfassbar und doch da.",
 "rule_title": "Hölle I",
 "rule": "Die Hölle ist einen Unwelt und somit keine Welt.",
 "date": 0
},

{
 "card_id": 244,
 "title": "Medusenhaupt",
 "cost": "0",
 "color": "red",
 "type": "Geheimnis, Legende",
 "body": "Du darfst ein Geheimnis in der Bibliothek haben. Nachwirkung≔ Ziehe eine Karte. Offenbarung: Dein Vollstrecker ist eine Runde handlungsunfähig. Platztausch ist für eine Runde ausgeschlossen. _R__R__R__R__R_: Tausche ein Geheimnis in der Welt mit diesem von Deiner Hand.",
 "strength": "",
 "extra": "Eigentlich für immer.",
 "rule_title": "Geheimnisse von Kreaturen",
 "rule": "Auch Kreaturen können einen Geheimnis haben. Ihr Geheimnis offenbart sich, wenn sie die Welt verlassen. Das Schlüsselwort des Effektes ist ‚Offenbarung‘.<br><br><i>„Dem Unausprechlichen sei das letzte Wort gewidmet.“</i>",
 "date": 0
},

{
 "card_id": 245,
 "title": "Krankheit",
 "cost": "SSSS",
 "color": "black",
 "type": "Trugbild, Unterbrechungszauber",
 "body": "Jeder Magier erhält einen Schaden je von ihm beschworenen Zauberspruch.",
 "strength": "",
 "extra": "",
 "rule_title": "Vollstrecker",
 "rule": "Ein Magier der einen anderen Magier zum Märtyrer macht wird Vollstrecker genannt.",
 "date": 0
},

{
 "card_id": 246,
 "title": "Echtheitsprüfung",
 "cost": "W",
 "color": "white",
 "type": "Unterbrechungszauber",
 "body": "Vernichte eine Kopie in der Welt oder kontert eine Kopie in dieser Kaskade.<br>_1_: Vergessen.",
 "strength": "",
 "extra": "Brillianz ist nicht kopierbar.",
 "rule_title": "Komplizen",
 "rule": "Jene Magier, die die Plätze links und rechts von einem Magier besetzen werden seine Komplizen genannt. Sie gelten nicht als Gegner.",
 "date": 0
},

{
 "card_id": 247,
 "title": "Besessenheit",
 "cost": "SS",
 "color": "black",
 "type": "Kreaturenverzauberung",
 "body": "Du hast die Macht über die Kreatur.",
 "strength": "",
 "extra": "Das köstlich daran ist doch, daß es sich einbildet frei zu sein.",
 "rule_title": "Macht",
 "rule": "Wenn ein Effekt es erlaubt die Macht über eine Bleibekarte zu übernehmen, so bleibt die Bleibekarte unter der Kontrolle des Besitzers, aber die Kontrolle über die aktivierbaren Effekte der Karte werden vom Machthaber übernommen. Falls es sich bei der Bleibekarte um eine Kreatur handelt, so bestimmt der Machthaber in der Kampfphase über die Kreatur (Blocker bestimmen, bestimmen ob angegriffen wird). Bedenke aber, daß die Deklaration einer Angriffsphase nicht dadurch ermöglicht wird.",
 "date": 0
},

{
 "card_id": 248,
 "title": "Hügellandschaft",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Besitzer und Beherrscher",
 "rule": "Der Beherrscher einer Bleibekarte oder eines Zaubers, ist jener Magier, der die Kontrolle über die Karte/ den Zauber hat. Der Besitzer einer Karte, ist der Magier, in dessen Bibliothek zu Beginn der Begegnung jene Karte war.",
 "date": 0
},

{
 "card_id": 249,
 "title": "Lagune",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Maximale Lebenskraft",
 "rule": "Ein Magier kann maximal 99 Lebenspunkte haben.",
 "date": 0
},

{
 "card_id": 250,
 "title": "Gehölz",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Urmagier",
 "rule": "Urmagier sind jene Magier, die auch schon zu Beginn (und davor) der Begegnung da waren.",
 "date": 0
},

{
 "card_id": 251,
 "title": "Felsenschlucht",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Zensiert",
 "rule": "Zensierte Karten werden in die Unterwelt abgelegt und können dadurch markiert werden, daß sie umgedreht sind. An zensierte Zauber kann man sich nicht erinnern, noch können sie Ziel von Zaubersprüchen oder Effekten sein (ungezielte Effekte betreffen somit auch zensierte Karten).",
 "date": 0
},

{
 "card_id": 252,
 "title": "Meerenge",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Hölle II",
 "rule": "Die Hölle ist im Prinzip ein eigener Ablagestapel, aber man kann Karten in der Hölle dadurch markieren, daß sie umgedreht auf den „aus-dem-Spiel-entfernt-Stapel gelegt werden. Dies dient der Übersichtlichkeit. Zu bedenken aber ist, daß es keine Teilhöllen gibt. Wenn davon die Rede ist eine Karte in die Hölle eines Magiers zu legen, so ist dies am Kartentische organisatorisch gemeint - zu denken ist Hölle als eine.<br><br><i>„Geist wird sich dort nicht finden.“</i>",
 "date": 0
},

{
 "card_id": 253,
 "title": "Diadem",
 "cost": "SSS",
 "color": "black",
 "type": "Kreaturenverzauberung, Legende",
 "body": "Die Kreatur erhält +0/+1 und muß geblockt werden.",
 "strength": "",
 "extra": "Die angemessene Fassung für ein solches Juwel.",
 "rule_title": "Kronen",
 "rule": "Kreaturenverzauberungen, die auch Legenden sind, sind Kronen.",
 "date": 0
},

{
 "card_id": 255,
 "title": "Gedankensprung",
 "cost": "BB1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch, der dann ganz aus der Welt entfernt wird, oder mache einen unkonterbaren Zauberspruch konterbar.<br>Nachwirkung≔ Entferne Gedankensprung aus der Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "Entfernung",
 "rule": "Wenn etwas aus der Welt entfernt wird, so heißt das nicht, das der betreffende Zauberspruch aus der Ideenwelt entfernt wird.",
 "date": 0
},

{
 "card_id": 256,
 "title": "Seelenbund",
 "cost": "WW2",
 "color": "white",
 "type": "Verzauberung, Legende",
 "body": "Jeder Magier kann Lebenspunkte zahlen, um bei seinen Kreaturen Schaden zu verhindern.",
 "strength": "",
 "extra": "Seit jeher ist es Sitte für einen Magier einen besonderen Liebling bei sich zu haben.",
 "rule_title": "Das Mysterium",
 "rule": "Jene, die dem Mysterium dienen, dienen INCANTATA.<br><br><i>Aufklärung ist der Ausgang des Menschen aus seiner selbstverschuldeten Unmündigkeit. ... </i>",
 "date": 0
},

{
 "card_id": 266,
 "title": "Teufelchen",
 "cost": "S",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Gestaltwandler. Wähle als Zielgestalt nur eine Kreatur mit Beschwörungskosten von 1.",
 "strength": "0/1",
 "extra": "Jene treiben so manchen Schabernack.",
 "rule_title": "Logik",
 "rule": "Die Regeln der Logik gelten. Nehmen wir nur kurz die Und-Verknüpfung als Beispiel: W ^ W = W, W ^ F = F, W ^ F = F, F ^ F = F. Desweiteren gelten die üblichen Regeln der Mathematik. Zum Beispiel die Umkehrung der Multiplikation: Die Division (4/2=2).",
 "date": 0
},

{
 "card_id": 257,
 "title": "Hexenröhrling",
 "cost": "1G",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "->, Kante einen Mond an oder zahle 3 Lebenspunkte: Übergebe gewaltig die Kontrolle über den Hexenröhrling an einen Magier.<br>Du erhälts einen Schaden in Deiner Versorgungsphase.",
 "strength": "0/3",
 "extra": "Hexen ist nunmal nicht zu trauen.",
 "rule_title": "Effektgeschwindigkeiten",
 "rule": "Wenn ein Effekt gewaltig/spontan/unterbrechend/energisch oder traumhaft aktiviert wird, so ist dieser Effekt zu aktivieren wie ein Gewaltzauber/Spontanzauber/Unterbrechungszauber/Energiezauber oder Traumzauber. Die Phasenbeschränkung ist einzuhalten.",
 "date": 0
},

{
 "card_id": 258,
 "title": "Blinde Wut",
 "cost": "RRRRR",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Kraftaufwand≔ _R_.<br>Vernichte eine Bleibekarte.",
 "strength": "",
 "extra": "Irgendwann ist auch mal Schluß!",
 "rule_title": "Versorgung",
 "rule": "Eine Bleibekarte mit definierten Versorgungskosten, wird in die Unterwelt abgelegt, falls der Beherrscher die Versorgungskosten nicht zahlt.<br>Falls mehrere Effekte in einer Versorgungsphase abgewickelt werden müssen, so bestimmt der aktive Magier die Reihenfolge.",
 "date": 0
},

{
 "card_id": 260,
 "title": "Todesmacht",
 "cost": "SSS",
 "color": "black",
 "type": "Verzauberung, Legende",
 "body": "Überspringe Deine Zugphase.<br>0: Ziehe eine Karte zu Beginn Deiner Ablegephase, falls Du weniger als 7 Karten auf der Hand hast; zahle einen Lebenspunkt wenn sie schwarz oder eine Singularität ist, 2 falls sie nicht schwarz ist und 5 falls sie weiß ist.",
 "strength": "",
 "extra": "",
 "rule_title": "Phasenwechsel",
 "rule": "Phasenwechsel, z.B. der Phasenwechsel zwischen Versorguns- und Zugphase, sind magische Ereignisse, die eine Kaskade erföffnen, und somit kann darauf geantwortet werden. Phasenwechsel geschehen mit Spontanzaubergeschwindigkeit und somit müssen die Effekte oder Zaubersprüche, mit denen man antworten will, mindestens ebenso schnell sein. Die Kaskade, die durch den Phasenwechsel geschieht nennt man Phasenwechselkaskade.",
 "date": 0
},

{
 "card_id": 261,
 "title": "Flammenschwert",
 "cost": "3",
 "color": "light_grey",
 "type": "Engelverzauberung, Legende",
 "body": "Der Engel erhält +3/+0",
 "strength": "",
 "extra": "Nicht von dieser Welt.",
 "rule_title": "Doppelte Verwirrung",
 "rule": "Falls ein Magier einem anderen Magier eine Verwirrung, mit einer Verwirrung unterschiebt, so muß jener Magier eine passende Karte für die zweite Verwirrung benutzen. Falls er keine passende Karte hat, verpufft die zweite Verwirrung. Da man nicht über seine Handkarten auskunft geben darf, muß der erste Magier seine Doppelverwirrung auf Verdacht spielen.",
 "date": 0
},

{
 "card_id": 263,
 "title": "Traumengel",
 "cost": "BB3",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Gestaltwandler.",
 "strength": "3/3",
 "extra": "",
 "rule_title": "Herkunft von Zaubersprüchen",
 "rule": "Die Herkunft von Zauberprüchen ist für jeden Zauberspruch in der Ideenwelt vermerkt. Falls die Herkunft eines Zauberspruches geändert wird, können Effekt und Zaubersprüche, die jenen Zauber bezielen verpuffen. Merke: Wenn die Herkunft eines Zauberspruches unbekannt ist, so kann nicht mehr festgestellt werden, ob es sich um einen gegnerischen Zauberspruch handelt.",
 "taken": true,
 "date": 0
},

{
 "card_id": 267,
 "title": "Abnormale Konstellation",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Alle Magier können in ihrer Erneuerungsphase je höchstens einen Himmelskörper zurückstellen, oder für jeden weiteren Himmelskörper je einen Lebenspunkt zahlen.",
 "strength": "",
 "extra": "Wie eine gleißende Feuerfanfare am ganzen Himmel",
 "rule_title": "Zeitrechnung",
 "rule": "Es gibt verschiedene Zeitrechnungen, zum Beispiel die INCANTATA-Zeitrechnung.",
 "date": 0
},

{
 "card_id": 269,
 "title": "Dürre",
 "cost": "RR2",
 "color": "red",
 "type": "Verzauberung",
 "body": "Versorgung≔ _R_.<br> Alle Kreaturen erhalten -0/-1.",
 "strength": "",
 "extra": "",
 "rule_title": "Legende",
 "rule": "Karten mit dem Typ „Legende“ sind nur einmal pro Bibliothek erlaubt.",
 "date": 0
},

{
 "card_id": 270,
 "title": "Elfenkönigin",
 "cost": "GG1",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Beschwöre die Elfenkönigin nur, wenn Du ein grünes Schicksal hast. Alle grünen Kreaturen erhalten +0/+2.",
 "strength": "1/1",
 "extra": "Selbst in allergrößter Not ...",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 271,
 "title": "Feuerdolch",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Füge einer Kreatur 4 Schaden zu.",
 "strength": "",
 "extra": "",
 "rule_title": "Unsterblichkeit",
 "rule": "Ein Magier der unsterblich ist kann keine Lebenspunkte verlieren und muß keine Karte ziehen. Hat ein Magier weniger als 1 Lebenspunkte und wird unsterblich gemacht, so werden seine Lebenspunkte auf 1 gesetzt.",
 "date": 0
},


{
 "card_id": 272,
 "title": "Fürstentum",
 "cost": "WW",
 "color": "white",
 "type": "Verzauberung, Legende",
 "body": "->, das Fürstentum ist von 2 Standardländern umgeben: Stelle eine angreifende Kreatur zurück und behandle sie, als hätte sie nie angegriffen; aktiviere diesen Effekt vor der Schadensverrechnung.",
 "strength": "",
 "extra": "Im Herzen der Provinz glänzt die freie Stadt.",
 "rule_title": "Offen rational, zufällig, verdeckt",
 "rule": "Vor der Begegnung hat jeder Magier seine Bibliothek sorgfältig zu mischen.",
 "date": 0
},

{
 "card_id": 273,
 "title": "Relativismus",
 "cost": "3BBB",
 "color": "blue",
 "type": "Gewaltzauber, Legende",
 "body": "Tausche Plätze mit einem Magier, aber ihr nehmt je Eure Welten und Seelen mit.",
 "strength": "",
 "extra": "Verrat? Vielleicht - so oder so...",
 "rule_title": "Geheimnisvoll",
 "rule": "Ja, warum nicht.",
 "date": 0
},

{
 "card_id": 275,
 "title": "Moor",
 "cost": "",
 "color": "land",
 "type": "Land, Verdammnis",
 "body": "->: Füge einer angreifenden Kreatur einen Schaden zu.",
 "strength": "",
 "extra": "",
 "rule_title": "Spuken",
 "rule": "Ein Magier kann die aktivierbaren Effekte einer Kreatur, die in der Unterwelt ist und die Eigenschaft „spukt“ hat, anwenden.",
 "date": 0
},

{
 "card_id": 276,
 "title": "Ermutigung",
 "cost": "GG",
 "color": "green",
 "type": "Unterbrechungszauber",
 "body": "Falls der Zielzauber eine Kreatur ist, so wird sie mit +1/+1 verwirklicht.",
 "strength": "",
 "extra": "Nur Mut!",
 "rule_title": "Magie",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 278,
 "title": "Abnormale Aktivität",
 "cost": "S1",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Beschwöre einen Spontanzauber aus jedweder Unterwelt.",
 "strength": "",
 "extra": "",
 "rule_title": "Ausschließlichkeit",
 "rule": "Es ist nur eine Ausschließlichkeit pro Bibliothek erlaubt.",
 "date": 0
},

{
 "card_id": 279,
 "title": "Chamälionzunge",
 "cost": "G",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Eine Kreatur verliert temporär ihre Flugfähigkeit. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Ohne Verschwendung",
 "rule": "Falls ein Zauberspruch zum Beispiel eine Eigenschaft hinzufügt oder verlieren läßt, so darf man ihn nur auf Ziele beschwören, die dieser Eigenschaft bedürfen. Also ist es nicht gestattet einer nichtfliegenden Kreatur die Flugfähigkeit zu nehmen, denn sie hat ja keine. Genausowenig kann man eine unangekantete Karte zurückstellen oder eine angekantete ankanten.",
 "date": 0
},

{
 "card_id": 280,
 "title": "Grottenolm",
 "cost": "1R",
 "color": "red",
 "type": "Kreatur",
 "body": "Entferne eines Deiner Nichtkreaturartefakte aus der Welt: Temporär +2/+2",
 "strength": "1/2",
 "extra": "",
 "rule_title": "Ausnahmen der Festlegungen",
 "rule": "Zeichenformatierungsänderungen gelten nicht als Änderung einer Karte, wenn diese offensichtlich sinngemäß das gleiche meinen. Z.B. »'« »’«, »-« »-«, »•« »∘«, »⇒« »=>«, usw.",
 "date": 0
},

{
 "card_id": 283,
 "title": "Onyxjuwel",
 "cost": "S2",
 "color": "black",
 "type": "Kreaturenverzauberung, Legende",
 "body": "Die Kreatur erhält die Eigenschaft ‚->: Füge einer Kreatur einen Schaden zu.‘.",
 "strength": "",
 "extra": "Unwiderstehlich!",
 "rule_title": "Quelle von Schaden",
 "rule": "Ein Magier ist stets verantwortlich für alle Effekte und Zaubersprüche, die Quelle von Schaden ist aber stets Kreatur, Zauberspruch, Verzauberung, Artefakt... selbst. ",
 "date": 0
},

{
 "card_id": 288,
 "title": "Zahltag",
 "cost": "WWW",
 "color": "white",
 "type": "Energiezauber, Legende",
 "body": "Zwinge Deinen Gegner dazu den vollen Manabeschwörungskostenanteil, der kein X oder Y enthält, in farblosem Mana für einen Deiner Zauber zu zahlen.",
 "strength": "",
 "extra": "",
 "rule_title": "Diplomatie",
 "rule": "Das Brechen diplomatischer Abmachungen wird ganz sicher auf den Schuldigen zurückfallen.",
 "date": 0
},

{
 "card_id": 291,
 "title": "INCANTATA 0-Seite",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Wunder, unzerstörbar",
 "body": "http://localhost/43110: 13VDeMgRgGf73mHsMrrorX kq4fhUKfBvPz",
 "strength": "",
 "extra": "",
 "rule_title": "Zeronet installation",
 "rule": "<br>https://zeronet.readthedocs.io<br>/en/latest/using_zeronet/installing<br><br>https://zeronet.readthedocs.io<br>/en/latest/faq/#how-to-use-zeronet-with-tor<br>",
 "taken": true,
 "date": 0
},

{
 "card_id": 293,
 "title": "Firmament",
 "cost": "",
 "color": "artifact",
 "type": "unzerstörbar",
 "body": "Dies ist die Rückseite von der Außenseite.",
 "strength": "",
 "extra": "Funkel, Glitzer, Flimmer... ",
 "rule_title": "Firmament",
 "rule": "Das Firmament ist die Außenseite des Mantra der Reinheit.",
 "taken": true,
 "date": 0
},

{
 "card_id": 294,
 "title": "Schuld",
 "cost": "6",
 "color": "light_grey",
 "type": "Traumzauber, Einmaligkeit",
 "body": "Gib einem anderem die Schuld. Jedesmal wenn die Schuld beschworen wird verlangsamt sich die Geschwindigkeit, bis sie sich als Materiezauber, als Artefakt, manifestiert - bis dahin wird sie in die Gedankenwelt gegeben.",
 "strength": "",
 "extra": "",
 "rule_title": "Schuld",
 "rule": "Mit Kreaturenangriffen muß man denjenigen Gegner angreifen von dem klar ist, daß er die Schuld hat.<br><br><i>„Die kulturelle Leistung der Dichtkunst ist es auch jenen, die nicht wirklich existieren, ein Selbst anzudichten.“</i>",
 "date": 0
},

{
 "card_id": 295,
 "title": "Pfad des Lichts",
 "cost": "WWW3",
 "color": "white",
 "type": "Gewaltzauber, Legende",
 "body": "Dein Gegener zahlt von seinen Lebenspunkten den Schaden, den er dir in seiner letzten Teilrunde zugefügt hat; wenn er weniger als 1 Lebenspunkt hat, so erhält er 4 Lebenspunkte.",
 "strength": "",
 "extra": "Es ist nur gerecht so.",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 296,
 "title": "Verzauberungskontrolle",
 "cost": "RR2",
 "color": "red",
 "type": "Verzauberungsverzauberung, Legende",
 "body": "Übernehme die Kontrolle über die Verzauberung; bei einer gezielten Verzauberung, darfst Du das Ziel neu wählen. Falls die Verzauberungskontrolle die Welt verläßt, wird das ursprüngliche Ziel wiederhergestellt.",
 "strength": "",
 "extra": "",
 "rule_title": "Aus dem Jenseits",
 "rule": "Magier welche Märtyrer sind dürfen weiterhin am Tische sitzenbleiben und sind in Abstimmungsfragen zu berücksichtigen, allerdings dürfen sie nicht in die Karten von Magiern gucken.<br><br> „Ihr dachtet wohl ich sei tot.“",
 "date": 0
},

{
 "card_id": 298,
 "title": "Buch der Macht",
 "cost": "4",
 "color": "artifact",
 "type": "Artefakt, Seltenheit",
 "body": "->, _4_: Ziehe eine Karte.<br>->, _5_: Ziehe eine bessere Karte.",
 "strength": "",
 "extra": "Wer es einmal in der Hand hatte, den läßt es nicht mehr los.",
 "rule_title": "Tao",
 "rule": "<br><br><i>„(δ)“</i>",
 "date": 0
},

{
 "card_id": 301,
 "title": "Gewissensprüfung",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber, Wunder",
 "body": "Kontert einen Zauberspruch, wenn dessen Beherrscher nicht _1_ zahlt.<br>_5_: Erinnern.",
 "strength": "",
 "extra": "",
 "rule_title": "Materiewirkung",
 "rule": "Die Wirkung von sich widersprechenden (nicht sich aufhebende Effekte z.B. +1/+1 -1/-1) permanenten Bleibekarteneffekten wird in der Reihenfolge ihrer Verwirklichungszeitpunkte abgewickelt. Also nicht „last in first out“. Also der letzverwirklichter Bleibekarteneffekt zählt.",
 "date": 0
},

{
 "card_id": 302,
 "title": "Gedankengemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 blaue Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Machtkämpfe",
 "rule": "Strategisch sinnvoll ist es dem mächtigeren Gegner die Stirn zu bieten.",
 "date": 0
},

{
 "card_id": 303,
 "title": "Lebensgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 grüne Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Heilgarten",
 "rule": "Ein Magier mit einem Heilgarten kann nicht von Schnecken angegriffen werden.",
 "date": 0
},

{
 "card_id": 304,
 "title": "Blutgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 rote Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Visionär",
 "rule": "Vor der Begegnung zeigen alle Magier die Schicksalskarte, mit der in der Hand sie die Begegnung beginnen wollen (das kann auch keine sein). Dann dürfen alle Magier Karten zwischen ihrer Bibliothek und Bibliothekskeller tauschen. Danach wird die Sitzordnung ausglost.<br><br>(( Diese Regel ist für die große Begegnung zu fünft bindend. Für eine Begegnung zu viert kann im Sinne einer Hausregel der Zugriff auf den Bibliothekskeller auch nach der Festlegung der Sitzordnung geschehen.))",
 "date": 0
},

{
 "card_id": 305,
 "title": "Lichtgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 weiße Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Die Rückkehr",
 "rule": "Karten, die die Welt verlassen, kommen in die Betreffende Unterwelt/Hölle des <b>Besitzers</b> der Karte.",
 "date": 0
},

{
 "card_id": 306,
 "title": "Nachtgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 schwarze Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Finite Verwandlungen",
 "rule": "Verwandlungen in der Materiewelt (Kreaturen, Artefakte, Länder, etc.) sind im Allgemeinen so, daß die Ursprungssubstanz zunichte gemacht wird. Das heißt das die Ausgangssubstanz ganz verschwindet, und nur das Ergebnis der Verwandlung erhalten bleibt.<br><br>Als Ausnahme davon sind Gestaltwandlungen zu sehen, bei denen sowohl die Ausgangssubstanz, als auch die Neugestalt zugleich da sind (Vergleiche mit Gestaltwandler, Regel 737). Für alle Verwandlungen von Bleibekarten gilt: Alle Verzauberungen, Signa und Zustände bleiben erhalten.",
 "date": 0
},

{
 "card_id": 316,
 "title": "Regenbogenpony",
 "cost": "R1",
 "color": "red",
 "type": "Kreatur",
 "body": "Fliegt.<br>Geschenk.<br>X entspricht der Anzahl der Magier, die mindestens ein Regenbogenpony unter ihrer Kontrolle haben.",
 "strength": "X/X",
 "extra": "Freundschaft ist Magie",
 "rule_title": "Ins Nichts",
 "rule": "Nur wirkliche Karten können zurück auf die Hand/die Unterwelt/die Hölle. Alle Kopien und Signa gehen ins Nichts. Sie werden zunichtegemacht. Für Karten, die wie eine Kopie behandelt werden sollen, gilt: Wenn sie die Welt verlassen/auf die Hand sollen, verlieren sie den Charakter der Kopie und verlassen die Welt/gehen auf die Hand. Offensichtlich werden sie also nur in einem engeren Zusammenhang als Kopie behandelt: Bis eben jener Zusammenhang aufgelöst wird; dann wird die aufprojeziert-gedachte Kopie zunichtegemacht und die Karte wird zu der wirklichen Karte, die sie ist.<br><br><i>„Merke: Kopien sind doch nur ein stumpfer Abglanz der wirklichen Zauber, und gehen stets ins Nichts.“</i>",
 "date": 0
},

{
 "card_id": 320,
 "title": "Bi-Pensiero",
 "cost": "WW",
 "color": "white",
 "type": "Gewaltzauber, Verdammnis",
 "body": "Dein schlechter Komplize zahlt Deinem guten Komplizen 2 Lebenspunkte.",
 "strength": "",
 "extra": "I sold you, and you sold me - under the spreading chestnut tree.",
 "rule_title": "Unterweltseele",
 "rule": "Die Unterweltseele ist an die Weltseele gekoppelt, verliert aber jede Runde einen Lebenspunkt extra. Falls die Unterweltseele durch Effekte aus der Unterwelt beinflußt wird, so wirkt das nicht auf die Weltseele. Ob und wann die Unterweltseele 0 Punkte erreicht ist ganz und gar nur von akademischen Interesse. Die Höllenseele existiert gar nicht.",
 "date": 0
},

{
 "card_id": 323,
 "title": "Blaumohn",
 "cost": "GBR",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "->: Mache eine Kreatur temporär unblockbar.",
 "strength": "0/1",
 "extra": "",
 "rule_title": "Nichtfinite Verwandlung",
 "rule": "Bei Verwandlungen in der Ideenwelt (Zauberspruch A wird in Zauberspruch B verwandelt) wird die Ausgangssubstanz nicht zunichtegemacht; sie bleibt als Ideenweltding erhalten.",
 "date": 0
},

{
 "card_id": 324,
 "title": "Brutstätte des Bösen",
 "cost": "S2",
 "color": "black",
 "type": "Gewaltzauber, Vielheit",
 "body": "Die Zielsingularität verwandelt sich in einen 3/3 Höhlentroll oder 3 1/1 Goblins - alle je schwarz.",
 "strength": "",
 "extra": "Sie kamen wie aus dem Nichts.",
 "rule_title": "(δ421)",
 "rule": "(δ421)",
 "date": 0
},

{
 "card_id": 327,
 "title": "Materieverschmelzung",
 "cost": "2",
 "color": "artifact",
 "type": "Gewaltzauber",
 "body": "Materieverschmelzung ist farblos. Verschmelze 2 Deiner Kreaturen in eine Neue.",
 "strength": "",
 "extra": "Ruchlose Magier schrecken vor nichts zurück.",
 "rule_title": "Schmieden und Verschmelzen I",
 "rule": "Verwandle die Ausgangselemente in eine Bleibekarte, welche für die betreffende Kombination erlaubt ist. Falls die Ausgangselemente Zaubersprüche der Ideenwelt waren (schmieden), so markiere jene als verwirklicht. Falls es sich bei den Ausgangselementen um Bleibekarten handelt (verschmelzen), werden jene nach der Verwandlung aufgelöst (vernichtet).",
 "date": 0
},

{
 "card_id": 328,
 "title": "Geheimnis des Stahls",
 "cost": "X",
 "color": "artifact",
 "type": "Gewaltzauber",
 "body": "Das Geheimnis des Stahls ist farblos. Schmiede aus 2 oder mehreren Zaubersprüchen der Ideenwelt der letzten Runde eine Waffe und rüste eine Kreatur damit aus.",
 "strength": "",
 "extra": "Wer dies Geheimnis kennt, wird vom König geachtet werden.",
 "rule_title": "Schmieden und Verschmelzen II",
 "rule": "Die Kombinationen des Schmiedens und Verschmelzens sollen von der INCANTATA-Spieler-Gemeinschaft erarbeitet und Katalogisiert werden. Dabei können auch mehrere verschiedene Endergebnisse für Kombination möglich sein. Der Beschwörer darf dann das Endergebnis wählen.",
 "date": 0
},

{
 "card_id": 330,
 "title": "Fluchverbannung",
 "cost": "WW",
 "color": "white",
 "type": "Gewaltzauber, Legende",
 "body": "Du darfst die Fluchverbannung auch in der Hauptphase eines anderen Magiers beschwören. Ein Zielgewaltzauber wirkt in der Unterwelt - entsprechend angepasst.",
 "strength": "",
 "extra": "Wenn da unten große Sachen los gehen, gibt es hier oft Ahnungsvolle Zeichen.",
 "rule_title": "Angeblichkeit",
 "rule": "Im Spielrahmen gibt es Angeblichkeiten und Darstellungen - welche welche sind bleibt im Dunklen.",
 "date": 0
},

{
 "card_id": 331,
 "title": "Spendenadresse",
 "cost": "",
 "color": "artifact",
 "type": "Artefakt",
 "body": "bitcoin:<br>13VDeMgRgGf73mHs<br>MrrorXkq4fhUKfBvPz",
 "strength": "",
 "extra": "",
 "rule_title": "Gleichzeitige Deklaration",
 "rule": "Die Deklaration aller Angreifer und Blocker zu Beginn der Angriffsphase bedeutet auch, daß alle Angreifer zur gleichen Zeit angekantet werden, mit Gleichzeitigkeitsgeschwindigkeit.",
 "taken": true,
 "date": 0
},

{
 "card_id": 332,
 "title": "Ausweichen",
 "cost": "W",
 "color": "white",
 "type": "Unterbrechungszauber, Wunder",
 "body": "Kontert einen roten oder grünen Zauberspruch, der Schaden verursacht.<br>_1_: Vergessen.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 333,
 "title": "Brutalitätskatastrophe",
 "cost": "RRR",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Verursache einen Schaden auf ein gegnerisches Ziel; der Beherrscher jenen Zieles darf 2 Schaden auf ein gegnerisches Ziel verursachen; der Beherrscher jenen Zieles dann 3 Schaden usw. bis ein Magier verzichtet.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 334,
 "title": "Nebel",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber, Legende",
 "body": "Beschwöre den Nebel vor Deiner Angriffsphase. Greife mit allen Kreaturen an, Dein Gegner mischt alle seine Kreaturen und verteilt sie verdeckt als Blocker, möglichst gleichmäßig verteilt.",
 "strength": "",
 "extra": "",
 "rule_title": "Lebenspunktsigna",
 "rule": "Lebenspunktsigna zählen zu den Lebenspunkten eines Magiers. Ein Magier muß, falls er Lebenspunktsigna in seiner Welt hat, in seiner Versorgungsphase ein Lebenspunktsigna entfernen. Das hat er auch zu tun, falls die Quellen dieser Lebenspunktsigna schon vorschwunden sind.",
 "date": 0
},

{
 "card_id": 335,
 "title": "Unterweltkatastrophe",
 "cost": "R",
 "color": "red",
 "type": "Unterbrechungszauber",
 "body": "Lege einen Gewaltzauber ab; Ziehe 2 Karten.",
 "strength": "",
 "extra": "",
 "rule_title": "Die Midgardschlange",
 "rule": "Steht bei einer großen Begegnung nach 59 Runden noch kein Lichtbringer fest, so bestimmen alle Magier, die bei Beginn der Begegnung dabei waren, in einer maximal eine Stunde dauernden philosophisch-ethischen Diskussion, welcher Magier es am meisten verdient hat Lichtbringer zu sein. Diese Diskussion ersetzt das Ragnarök. Kann in dieser Diskussion keiner auserwählt werden so entscheidet das Los. Der in diesem Verfahren auserwählte erhält 0 Märtyrerpunkte und die anderen Magier je 2 Märtyrerpunkte. (Turnierincantata)",
 "date": 0
},

{
 "card_id": 336,
 "title": "Scheingestalt",
 "cost": "B2",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Zahle _B__B__B_ bei der Beschwörung: Die Scheingestalt leidet nicht unter Beschwörungstaumel.<br>Fliegt.<br>Zerstöre die Scheingestalt, wenn sie Ziel eines Zauberspruches wird.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Magierschicksale",
 "rule": "Zu einem Magier mit der Schicksalsfarbe rot/grün/blau/weiß/schwarz passen die entsprechenden Zauber. Zu einem Magier ohne Schicksal passen farblose Zauber.",
 "date": 0
},

{
 "card_id": 337,
 "title": "Gunst der Gestirne",
 "cost": "0",
 "color": "blue",
 "type": "Energiezauber, Legende",
 "body": "Gilt als blaue Karte.<br>Teil einer 3er-Kaskade.<br>Alle Magier dürfen je 2 farblose Mana zu ihrem Manavorrat hinzufügen.",
 "strength": "",
 "extra": "",
 "rule_title": "Auslegung der Kardinalregel I",
 "rule": "Inbesondere bei temporären Platztäusche gilt es die Kardinalregel richtig auszulegen. Direkte Selbstschädigung der eigenen Lebenspunkte (z.B Plasmastoß) ist stets zu vermeiden. Dagegen ist indirekte Selbstschädigung durch indirekte Effekte (z.B. Pesthauch, Reinigung) sowie chaotische Angriffe und Zerstörung von Bleibekarten, etc. erlaubt, wenn das Überleben des betroffenen Magiers nicht unmittelbar in Gefahr gebracht wird und die Gesamtbalance nicht drastisch verschlechtert wird. So darf man natürlich auch Jupiter oder ähnliche Effekte benutzen, wenn dies in einem Zusammenhang geschieht. Denn all dies ist im Sinne der Kardinalregel für jeden Magier selbst auch erlaubt.",
 "date": 0
},

{
 "card_id": 338,
 "title": "Heiliger",
 "cost": "W",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "->: Ein Erinnerneffekt führt zu ewigem Vergessen.<br>->, Opfere den Heiligen: Kontert einen Vergesseneffekt.<br>_R_: Teilrundeneinmalig temporär +1/+0.<br>_W_: Teilrundeneinmalig temporär +0/+1",
 "strength": "0/1",
 "extra": "",
 "rule_title": "Auslegung der Kardinalregel II",
 "rule": "Magier dürfen irrational, chaotisch, unnachvollziehbar und impulsiv handeln, solange sie das eigene Überleben nicht direkt gefährden. Insbesondere sind solche Handlungsweisen erwünscht, wenn sie die Gesamtbalance verbessern und gleichzeitig die Chance erhöhen selbst Lichtbringer zu werden. Mit selbst ist hier der Magier selbst, der in der Wirklichkeit, gemeint.",
 "date": 0
},

{
 "card_id": 339,
 "title": "Buckliger",
 "cost": "R",
 "color": "red",
 "type": "Kreatur, Legende",
 "body": "->: Füge 2 farblose Mana zu Deinem Manavorrat hinzu, welches Du nur für Artefakte verwenden darfst.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Gildenduell",
 "rule": "Begegnungen zwischen 2 Magiergilden werden durch je 5 ausgewählte Magier je Gilde an 2 Tischen ausgeführt. Für die erste Runde sind die Magier zufällig an den Tischen verteilt. Für die zweite Runde gemäß den Märtyrerpunkten (Märtyrertisch, Lichtbringertisch) (bei Gleichtstand der Märtyrerpunkte entscheidet eine Zaubermachtprobe; der Gewinner der Zaubermachtprobe spielt am Lichtbringertisch). Die dritte Runde wird ebenso ausgeführt. Ein Gildenduell kann offensichtlich auch unentschieden ausgehen.",
 "date": 0
},

{
 "card_id": 340,
 "title": "Supernova",
 "cost": "0",
 "color": "light_white",
 "type": "Unterbrechungszauber",
 "body": "Supernova gilt als lichtweiße Karte. Schnipse die oberste Karte von eines Gegners Bibliothek in die Unterwelt. Ziehe eine Karte.",
 "strength": "",
 "extra": "Schnips!",
 "rule_title": "Vertraute",
 "rule": "Falls eine Kreatur A ein Vertrauter einer anderen Kreatur B ist, so erhält die Kreatur B die Eigenschaft: ‚➀, +0/-1: Kreatur A erhält temporär +0/+1.‘",
 "date": 0
},

{
 "card_id": 341,
 "title": "Todesstrahl",
 "cost": "R1",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel 3 Schaden zu; Dieser Schaden kann nicht verhindert werden und falls das Ziel eine Kreatur ist, so kann sie diese Teilrunde nicht wiederbelebt werden.",
 "strength": "",
 "extra": "",
 "rule_title": "Bitte recht freundlich",
 "rule": "INCANTATA-Magier zaubern recht freundlich, wenn auch nicht ohne geistesscharfen Witz.<br>Rüdes Verhalten, und jedwede Schummelei zu verbieten ist quasi überflüssig, da nur aufrichtiges und freundliches Verhalten bei INCANTATA zum Erfolg führt, insbesondere bei Turnieren. Neulingen sei es hier einmal gesagt... meine Güte muß das wirklich in den Regeln stehen?",
 "date": 0
},

{
 "card_id": 342,
 "title": "Zerschmettern",
 "cost": "R",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Zahle zusätzlich _2_ um Zerschmettern als Unterbrechungszauber zu beschwören.<br>Zerstöre ein Artefakt, das weder ein Schicksal noch eine Kreatur ist.",
 "strength": "",
 "extra": "",
 "rule_title": "Titellos",
 "rule": "Wenn eine Spielkarte keinen Titel hat, so ist sie nicht offiziell veröffentlicht, also im Spiel nicht erlaubt.",
 "date": 0
},

{
 "card_id": 346,
 "title": "Plötzlichkeit",
 "cost": "R1",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Jeder Magier darf einen Gewaltzauber von seiner Hand als einen Spontanzauber beschwören.",
 "strength": "",
 "extra": "",
 "rule_title": "Es gibt Freiheit",
 "rule": "Das freie Internet nutze Manselbst, vor allem für Kunst und Philosophie.<br><br><i>„Wenn man - sich eingeschlossen - jedem/-er (δ841) beweisen kann, daß er/sie als alleinherrschender, omnipotenter Gott ( falls darauf angelegt ) versagt hätte, so darf man sich getrost freier Philosoph nennen, oder freier Mensch - das ist schließlich dasselbe.“</i>",
 "date": 0
},

{
 "card_id": 347,
 "title": "Kavallerist",
 "cost": "R2",
 "color": "red",
 "type": "Kreatur",
 "body": "->: Mache eine Kreatur mit der Stärke 2, oder weniger, temporär unblockbar.",
 "strength": "1/1",
 "extra": "Der beste Botschafter ist ein Mann des Krieges.",
 "rule_title": "Ausrüstungen",
 "rule": "Ausrüstungen von Kreaturen, das können Waffen sein, gelten als Verzauberungen und Artefakte und sind, wenn nicht anders angegeben, farblos.",
 "date": 0
},

{
 "card_id": 348,
 "title": "Pilzkönig",
 "cost": "G1",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "->: Verhindere einen Schaden bei einem Magier oder einer Kreatur Deines Gegners oder gebe Dir einen Lebenspunkt.",
 "strength": "0/2",
 "extra": "",
 "rule_title": "Reine Kreaturen",
 "rule": "Als reine Kreaturen gelten jene, die kein Schadenspotential haben. Der Schutzengel gilt als reine Kreatur.",
 "taken": true,
 "date": 0
},

{
 "card_id": 351,
 "title": "Amöbe",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur",
 "body": "Behandle diese Karte, wie eine Kopie einer Kreatur mit Beschwörungskosten in Höhe von 1.",
 "strength": "",
 "extra": "",
 "rule_title": "Schicksalserfüllung",
 "rule": "Karten vom Typ Schicksalserfüllung können nur von Magiern beschworen werden deren Schicksalsfarbe zur Farbe des betreffenden Zaubers passen.",
 "date": 0
},

{
 "card_id": 352,
 "title": "Ballista",
 "cost": "4",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Neu beschworen hat die Ballista 3 Bolzen geladen. Vernichte die Ballista, wenn sie keine Bolzen mehr hat.<br>->, Entferne einen Bolzen: Lege ein -1/-1 Signum auf eine Kreatur.",
 "strength": "",
 "extra": "",
 "rule_title": "Höllenregel",
 "rule": "Wenn ein Zauber der Hölle Teil wird, so werden alle Instanzen dieses Zaubers aus der Ideenwelt dieser Begegnung entfernt.",
 "date": 0
},

{
 "card_id": 353,
 "title": "Materieillusionsaufhebung",
 "cost": "BB1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Nachwirkung≔ Stelle einen Himmelskörper zurück.<br>Der Besitzer einer Bleibekarte nimmt jene zurück auf die Hand.",
 "strength": "",
 "extra": "Raum und Zeit zu durchwirken ist des Großmagiers Kunst.",
 "rule_title": "Umkanten",
 "rule": "Das Symbol ↷↷ steht für das Umkanten. Eine umgekantete Karte wird in der Erneuerungsphase zu einer angekanteten Karte. Effekte die ankanten oder zurückstellen wirken nicht auf umgekantete Karten. Insbesondere kann eine angekantete Karte nicht durch erneuetes Ankanten umgekantet werden.",
 "date": 0
},

{
 "card_id": 354,
 "title": "Naturmacht",
 "cost": "G3",
 "color": "green",
 "type": "Verzauberung",
 "body": "Alle Wälder werden zu grünen 1/1 Kreaturen, welche allerdings unter Beschwörungstaumel leiden.",
 "strength": "",
 "extra": "Sie verwandelt alles gemäß höheren Plans.",
 "rule_title": "Schutz vor Farbe",
 "rule": "Hat eine Kreatur Schutz vor einer Farbe (A), so gilt: Die Kreatur kann sie nicht von Kreaturen der Farbe A geblockt werden, die Kreatur kann aber Kreaturen der Farbe A blocken. Die Kreatur kann nicht das Ziel von Zaubersprüchen der Farbe A sein. Die Kreatur kann nicht das Ziel von Bleibekarteneffekten von Bleibekarten der Farbe A sein. Aller Schaden aus Quellen mit der Farbe A wird auf 0 reduziert. Bedenke: Ungezielte Effekte, die keinen Schaden machen wirken sehr wohl, z.B. Feuerwalze.",
 "date": 0
},

{
 "card_id": 355,
 "title": "Engel gerechten Pfades",
 "cost": "GGW3",
 "color": "green",
 "type": "Kreatur, Ausschließlichkeit",
 "body": "Fliegt.<br>Verursacht Durchbruchsschaden.",
 "strength": "4/4",
 "extra": "Auserwählt alles durchzusetzen.",
 "rule_title": "Verboten",
 "rule": "Du darfst eine Karte vom Typ ‚verboten‘ nicht in Deiner Anfangsbibliothek haben.<br><br>„(δ)“",
 "date": 0
},

{
 "card_id": 360,
 "title": "Niedere Hexe",
 "cost": "SS1",
 "color": "black",
 "type": "Kreatur,Verdammnis",
 "body": "Fliegt.<br>Schutz vor Grün.",
 "strength": "2/2",
 "extra": "Das niedere Höllenregiment gliedert sich durch Unterwerfung, Rache und willkürliche Schandtaten.",
 "rule_title": "Geheimnisse",
 "rule": "Zauber vom Typ ‚Geheimnis‘ werden verdeckt beschworen. Falls ein Ereignis dazu auffordert eine Karte in Deiner Hand oder Bibliothek zu zeigen, so darf dies im Falle von Geheimnissen verweigert werden. Wenn ein Magier seine Seele aushaucht, und er hat ein Geheimnis in seiner Welt, so wird danach der Offenbarunseffekt ausgeführt. Geheimnisse haben die Farbe der Aktivierungskosten ihres Tauscheffektes.<br><br><i>Du darfst ein Geheimnis in der Bibliothek haben.</i>",
 "date": 0
},

{
 "card_id": 363,
 "title": "Karstland",
 "cost": "",
 "color": "land",
 "type": "Land, Verdammnis",
 "body": "->, Opfere das Karstland: Füge einer angreifenden oder blockenden Kreatur einen Schaden zu.<br>->, Opfere das Karstland: Zerstöre ein Nichtstandardland.",
 "strength": "",
 "extra": "",
 "rule_title": "Uhrzeigersinn",
 "rule": "Wenn etwas reihum abgewickelt wird, so geschieht dies, wie auch die Abfolge der Teilrunden, in Richtung des Urzeigersinnes.",
 "date": 0
},

{
 "card_id": 364,
 "title": "Nullungsblase",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt",
 "body": "->: Eine gezielte Vezauberung auf einer Deiner Nichtkreaturbleibekarten ist temporär nichtig.<br>->, Opfere die Nullungsblase: Alle Nichtkreaturartefakte und ungezielten Verzauberungen sind temporär nichtig.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 366,
 "title": "Schreckensmacht",
 "cost": "RS",
 "color": "red",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kontert einen weißen Nichtkreaturenzauber oder zestöre eine reinweiße Bleibekarte",
 "strength": "",
 "extra": "Die Bloße Androhung hat so manchen bewogen...",
 "rule_title": "Großmagierdisziplin",
 "rule": "Die teuflische Magie - das Glück zu beugen - dürfen Magier am Kartentische nur anwenden, um die Gesamtbalance zu verbessern - wenn überhaupt. Jenseits des Incantataspieles ist grundsätzlich davon abzuraten!<br><br><i>„Das Mantra der Reinheit wird euch beschützen.“</i>",
 "date": 0
},

{
 "card_id": 367,
 "title": "Tektonik",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle Nichtstandardländer.",
 "strength": "",
 "extra": "Die Erde ist stets im Einklang, doch ihr seid Verdammte.",
 "rule_title": "Nachwort",
 "rule": "Die Veröffentlichung im freien Internet ist meine Abrechnung mit dem korrupten und dekadenten Akademismus unserer Tage.<br><br>Incantato<br><br>Der Abschluß ist das Firmament.",
 "date": 0
},

{
 "card_id": 369,
 "title": "Angelo della Vittoria",
 "cost": "RRS3",
 "color": "red",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Alle Engel erhalten +1/+1",
 "strength": "4/4",
 "extra": "Höret die Posaunen!",
 "rule_title": "Deckblatt",
 "rule": "T1 Theoretische Kosmologie als Teilgebiet der Physik: Topologie des Universums.<br>T2 Der Atlas fürs Universum: INCANTATA - Das Unmögliche Kartenspiel<br>UT Eine Umschreibung der Quantengravitation und deren Auswirkung auf die Topologie des Universums.<br><br>Veröffentlicht: 27792.1.5. von Incantato.",
 "date": 0
},

{
 "card_id": 370,
 "title": "Zensur",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Verdammnis",
 "body": "->: Zwinge einen Magier die oberste Karte seiner Bibliothek zu zensieren.",
 "strength": "",
 "extra": "Ein teuflisches Instrument.",
 "rule_title": "Präambel",
 "rule": "INCANTATA ist ein wissenschaftliches Werk der Kosmologie als Disziplin der Physik und ist im Sinne der Aufklärung vollkommen säkularisiert, daß heißt, es grenzt sich exakt von der Theologie ab.",
 "date": 0
},

{
 "card_id": 372,
 "title": "Schafhirte",
 "cost": "W",
 "color": "white",
 "type": "Kreatur",
 "body": "Schaden, der durch Zaubersprüche verusacht wird, wird um eins reduziert.",
 "strength": "0/2",
 "extra": "",
 "rule_title": "Das MANSELBST",
 "rule": "...(δ)",
 "date": 0
},

{
 "card_id": 374,
 "title": "Abhängigkeit",
 "cost": "BB2",
 "color": "blue",
 "type": "Verzauberung",
 "body": "Wähle 3 Kreaturen, von denen nur eine unter Deiner Kontrolle sein darf. Jene sind von nunan voneinander abhängig.",
 "strength": "",
 "extra": "Was Freiheit ist, merkt so mancher erst, wenn er sie für immer verloren hat.",
 "rule_title": "Vorwort I",
 "rule": "Wie allerortens bekannt ist, ist die Kosmologie nur unvollständig erklärbar mit den Mitteln der anerkannten Physik. Wenn auch die allgemeine Relativitätstheorie ein funkelndes Juwel der Wissenschaft ist, so ist sie doch nur ungenügend geeignet die Topologie des Universums hinreichend darzustellen, denn dazu bedarf es noch einer genaueren Untersuchung der Quantengravitation.",
 "date": 0
},

{
 "card_id": 375,
 "title": "Rehbock",
 "cost": "G2",
 "color": "green",
 "type": "Unterbrechungszauber, Kreatur",
 "body": "",
 "strength": "2/2",
 "extra": "Ganz plötzlich da!",
 "rule_title": "Vorwort II",
 "rule": "An Orten größer Raumkrümmung (Singularitäten in der Einsteinraumzeit) sind die Zusammenhänge der Grundkräfte so gut wie garnicht erklärt, da es nicht möglich ist Messungen durchzuführen. Daraus wird sehr schnell klar, daß wir keinerlei Erfolg haben werden, wenn wir hoffen Phänomene der Quantengravitation in Beschleunigerexperimenten finden zu wollen. Die Quantengravitation ist nur erforschbar in der theoretischen Kosmologie. Gemäß der Problemstellung ergibt sich damit auch, daß es keine quantisierbare Theorie im Sinne der Tensoranalysis geben kann. Als Ergebnis kann es kein analytische genaues <i>WIE</i>, sondern nur ein <i>DAß-ÜBERHAUPT</i> in einer Form einer physikalischen <i>Bricolage</i>.",
 "taken": true,
 "date": 0
},

{
 "card_id": 376,
 "title": "Verfluchter Globus",
 "cost": "4",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Kommt angekantet in die Welt.<br>->, _1_, Selbstvernichtung: Zerstöre alle Artefakte und Verzauberungen.",
 "strength": "",
 "extra": "Wenn die Magier wollen, so tausche das Wort ‚Verzauberungen’ durch ‚Kreaturen‘ aus.",
 "rule_title": "Vorwort III",
 "rule": "Die Auswirkungen der Quantengravitation enziehen sich also dem alltäglichem Leben und der physikalischen Meßbarkeit. Wir haben es also mit etwas zu tun, was keine Gestalt hat und doch nicht Nichts, denn sie fehlt um die Topologie des Universums zu ‚vermessen‘. Diese Arbeit beantwortet nun also jene Frage: ‚Was ist nicht Nichts, doch ohne Gestalt!‘ oder anders ausgedrückt, Was ist nicht wahrnehmbar oder meßbar aber maßgeblich für die Topologie des Universums.",
 "date": 0
},

{
 "card_id": 377,
 "title": "Tribut",
 "cost": "B2",
 "color": "blue",
 "type": "Landverzauberung",
 "body": "Das Land erhält: 'Versorgung≔ Zahle _1_ oder einen Lebenspunkt.'",
 "strength": "",
 "extra": "",
 "rule_title": "Konklusion I",
 "rule": "Die wissenschaftliche Erkennstnis trifft einen wie einen Blitz.",
 "date": 0
},

{
 "card_id": 378,
 "title": "Guillotine",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Einzigartigkeit",
 "body": "->, Wähle eine Kreatur: Alle Magier, außer der Beherrscher der Kreatur, stimmen ab, ob die Kreatur zerstört werden soll. Wenn dies nicht einstimmig gelingt, so geht die Kontrolle über die Guillotine an den Beherrscher der Kreatur.",
 "strength": "",
 "extra": "",
 "rule_title": "Konklusion II",
 "rule": "Wenn wir die Grundkräfte betrachten Gravitation, Elektromagnetismus, starke und schwache Wechselwirkung, so wird in dieser Reihenfolge klar, daß wir es bei der schwachen Wechselwirkung bereits um eine Kraft handelt, welche schon sehr schwer zu messen ist. In diesem Sinne ist es logisch, daß es sich bei der Quantengravitation, die wir uns in diesem Sinne als eine 5. Grundkraft vorstellen können, sich zum einen der experiementellen Untersuchung ganz enzieht und höchstwahrscheinlich eine spezielle Ordnung aller bekannter Grundkräfte sein wird. Somit können wir auf ‚für uns nicht wahrnehmbare‘ aber fürs Universum wichtige Ordnungsprinzipien verzichten.",
 "date": 0
},

{
 "card_id": 379,
 "title": "Letzte Chance",
 "cost": "S",
 "color": "black",
 "type": "Spontanzauber, Legende",
 "body": "Regeneriere eine Kreatur. Falls die Kreatur im weiteren Verlauf der Begegnung zerstört oder vernichtet wird, so wird sie aus der Welt entfernt.",
 "strength": "",
 "extra": "Nicht das du ein Anrecht darauf hättest...",
 "rule_title": "Konklusion III",
 "rule": "Und in der Tat ist eine solche Annahme viel eleganter als Übergeordnete Dimensionen (Stringtheorie) oder die sogennante ‚dunkle Materie‘ zu postulieren (allein schon deshalb, weil es davon sehr viel geben muß). Die Wirkung der Quantengravitation auf die Topologie des Universums ist idealerweise extrem gering, wenn auch maßgeblich. Und in der Tat: So ist es. Die Wirkung der Quantengravitation auf die Topologie des Universums, ist das an dem wir uns orientieren. Aus ihr sind die strukturierenden Zusammenhänge ableitbar und in eine Formalsprache überführbar, die die Topologie des Universums, wenn auch nicht vollständig, so doch hinreichend darstellt.",
 "date": 0
},

{
 "card_id": 380,
 "title": "Verschwindibus",
 "cost": "BB",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "2 Kreaturen verschwinden.",
 "strength": "",
 "extra": "Hopplahopp und Schwuppdiwupp ...",
 "rule_title": "Konklusion IV",
 "rule": "Daraus ergibt sich die finale Konklusion dieser Arbeit:<br><br>Zur Umschreibung der Einsteinraumzeit und zusätzlich dazu der Wirkung der Quantengravitation auf die Topologie des Universums benötigen wir eine andere Formalsprache, als die der Tensoranalysis. Diese Sprache ist ‚Icantata - Das Unmögliche Kartenspiel‘.<br><br><b>INCANTATA ist die Sprache der Kosmologie als Disziplin der Physik.</b>",
 "date": 0
},

{
 "card_id": 381,
 "title": "Brieftaube",
 "cost": "WW",
 "color": "white",
 "type": "Kreatur, Wunder",
 "body": "Fliegt.<br>Schutz vor Schwarz.<br>Anstatt die Brieftaube sich verwirklichen zu lassen, kannst Du die Brieftaube und eine Karte von Deiner Hand an einen Magier schicken.",
 "strength": "0/1",
 "extra": "Eine Nachricht? Für mich?!",
 "rule_title": "Referenzen",
 "rule": "Da Vinci, Einstein, Hawking, Hamilton, Heisenberg, Maxwell, Newton, Planck & Kant u.v.m.",
 "date": 0
},

{
 "card_id": 382,
 "title": "Ausbeutungsmaschine",
 "cost": "R",
 "color": "red",
 "type": "Verzauberung, Seltenheit",
 "body": "->, Vernichte eines Deiner Standardländer: Füge Dir 2 Lebenspunkte hinzu oder eine Deine Kreaturen erhält temporär +1/+1.",
 "strength": "",
 "extra": "Sie läuft wie von selbst.",
 "rule_title": "Dank",
 "rule": "Besonderer Dank geht natürlich an alle Helfer.",
 "date": 0
},

{
 "card_id": 383,
 "title": "Honigtropfen",
 "cost": "G",
 "color": "green",
 "type": "Spontanzauber, Wunder",
 "body": "Eine Kreatur erhält temporär +1/+1.<br>_G__G__G__G_: Erinnern.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 384,
 "title": "Grabräuber",
 "cost": "3RR",
 "color": "red",
 "type": "Kreatur, Legende",
 "body": "Wenn der Grabräuber einem Magier Kampfschaden zugefügt hat, so kannst Du ihm ein Arfefakt stehlen. Verläßt der Grabräuber die Welt, so wird die Kontrolle über die Artefakte zufällig an alle Magier (Dich nicht eingeschlossen) verteilt.",
 "strength": "1/3",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 388,
 "title": "Fliegender Holländer",
 "cost": "BB3",
 "color": "blue",
 "type": "Kreatur",
 "body": "Fliegt.<br>_2_: Verschwinden.",
 "strength": "3/3",
 "extra": "",
 "rule_title": "Seelenaushauchung",
 "rule": "Ein Magier der am Ende seiner Teilrunde 0 oder weniger Lebenspunkte hat, haucht er seine Seele aus und ist somit handlungsunfähig, aber erst nachdem alle Phasen der Teilrunde vollständig abgeschlossen sind (inklusive Ende der Teilrunde). Dann werden alle Bleibekarten in seine Welten aus der Begegnung entfernt. Bleibekarten, die unter der Kontrolle anderer sind, bleiben in der Begegnung (z.B. Geschenke oder getauschte Karten). Zusätzlich bleiben noch gezielte Verzauberungen auf Bleibekarten, die keine Magier sind (z.B. Befriedung).",
 "date": 0
},

{
 "card_id": 389,
 "title": "Übervorteilung",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Zusätzliche Beschwörungskosten≔ 4-fache Himmelsmacht. Du und Dein Gegner suchen je ihr Schicksal in ihren Welten, tauschen sie, und nehmen es je in die Hand",
 "strength": "",
 "extra": "",
 "rule_title": "Freundlich",
 "rule": "Befreundete Kreaturen sind jene, die zu Dir und Deinen Komplizen gehören.",
 "date": 0
},

{
 "card_id": 391,
 "title": "Kataklysmus",
 "cost": "RRR4",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Vernichte alle Bleibekarten außer Himmelskörper und Standardländer.",
 "strength": "",
 "extra": "Von allen Mystikern und Denkschulen weit und breit stets erwartet.",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 392,
 "title": "Folterkeller",
 "cost": "S3",
 "color": "black",
 "type": "Verzauberung, Seltenheit",
 "body": "Für die Aktivierung von Effekten von Bleibekarten, die keine Himmelskörper sind und ein Ankanten erfordern, zahlt man einen Lebenspunkt.",
 "strength": "",
 "extra": "",
 "rule_title": "Zeichen",
 "rule": "Wenn fünf Todesengel anwesend sind bricht die Hölle in sich zusammen und verschwindet. Alle Ereignisse, die sich dann auf die Hölle beziehen sind dann nicht mehr gültig.",
 "date": 0
},

{
 "card_id": 394,
 "title": "Kraftverlust",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kontert einen grünen oder roten Zauberspruch.<br>_B__B__B_: Vergessen.",
 "strength": "",
 "extra": "",
 "rule_title": "Wirkungszone",
 "rule": "Die Teilrunde eines Magiers läßt sich unter anderem folgendermaßen unterteilen: Kosmische Phasen (Erneuerungsphase, Himmelsphase) und <b>Wirkungszone</b> (Versorgungsphase, Zugphase, Hauptphase inklusive Kampfphase, Ablegephase, Ende der Teilrunde)",
 "date": 0
},

{
 "card_id": 395,
 "title": "Puppenmeister",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Übernehme kurzzeitig die Kontrolle über eine Bleibekarte um einen aktivierbaren Effekt auszulösen.",
 "strength": "",
 "extra": "Die Fäden zu verbergen...",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 398,
 "title": "Dunkles Ritual",
 "cost": "SS",
 "color": "black",
 "type": "Spontanzauber, Legende",
 "body": "Verschiebe die Seelenaushauchung eines Magier um eine Runde",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 399,
 "title": "Spaghettimonster",
 "cost": "BB1",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Nachwirkung≔ Stelle einen Himmelskörper zurück.<br>Fliegt.<br>->: Kante eine nichtblaue Kreatur an.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Unschärfe",
 "rule": "Falls Effekte unscharf sind, also mehrere Auslegungsmöglichkeiten haben, so sind sie grundsätzlich als die spieltechnisch schwächste Variante auszulegen. Allerdings können sie, falls alle Magier (inklusive Magier mit ausgehauchter Seele) einverstanden sind, spieltechnisch höher ausgelegt werden.<br>Beispiel: Ein Zauberspruch der die Geschwindigkeit eines Zauberspruches oder Effektes erhöht, sollte grundsätzlich nur erlauben die Geschwindigkeit um eine Stufe anzuheben (z.B. von Spontan- auf Unterbrechunszaubergeschwindigkeit). Wenn jedoch alle Magier einverstanden sind, kann die Geschwindigkeit auch auf Energie- oder Traumzaubergeschwindigkeit erhöht werden.",
 "date": 0
},

{
 "card_id": 409,
 "title": "",
 "cost": "",
 "color": "blank",
 "type": "",
 "body": "Ist identisch mit 410.",
 "strength": "",
 "extra": "",
 "rule_title": "Spenden",
 "rule": "Bitcoinspenden sind willkommen, siehe Spendenkarte.",
 "date": 0
},

{
 "card_id": 410,
 "title": "",
 "cost": "",
 "color": "blank",
 "type": "",
 "body": "Ist identisch mit 409.",
 "strength": "",
 "extra": "",
 "rule_title": "Das allerletzte Wort",
 "rule": "... natürlich besiegt die Feder das Schwert ...",
 "date": 0
},

{
 "card_id": 412,
 "title": "Ritterlichkeit",
 "cost": "WW",
 "color": "light_white",
 "type": "Unterbrechungszauber, Legende",
 "body": "Beschwöre eine Kreatur, wie einen Unterbrechungszauber und verdeckt mit dieser Karte. Entferne die Verdeckung, bevor die Kreatur block oder angreift.",
 "strength": "",
 "extra": "Sie dient dem Magier.",
 "rule_title": "Kontrolle",
 "rule": "Welche Welt gemeint ist, wenn von der Kontrolle über etwas die Rede ist, wird aus dem Zusammenhang klar. Beispiele: Kontrolle über einen Zauberspruch - Ideenwelt, Kontrolle über eine Bleibekarte - Welt, usw.<br><br>Merke: Stehlen heißt die Kontrolle über etwas zu erlangen.",
 "date": 0
},

{
 "card_id": 413,
 "title": "Narrenkappe",
 "cost": "W2",
 "color": "white",
 "type": "Kreaturenentzauberung, Legende",
 "body": "Die Kreatur verliert alle Eigenschaften; Ziehe eine Karte.",
 "strength": "",
 "extra": "Sieht jetzt aus wie ein Clown.",
 "rule_title": "Karten ablegen",
 "rule": "Wenn eine Karte abgelegt werden soll, so wird sie grundsätzlich in die Unterwelt abgelegt.",
 "date": 0
},

{
 "card_id": 417,
 "title": "Buch der Verwandlungen",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_, Lege eine Nichtlandkarte ab: Ziehe eine Karte.",
 "strength": "",
 "extra": "Wie wundersam wird mir, ich fühle neues Streben.",
 "rule_title": "Spiegelbildliches",
 "rule": "Bedenke, daß das Gegenteil eines Zauberspruches nicht identisch sein muß mit dem spiegelbildlichen Gegenstück.",
 "date": 0
},

{
 "card_id": 420,
 "title": "Verwirrung",
 "cost": "1",
 "color": "light_grey",
 "type": "Unterbrechungszauber",
 "body": "Tausche einen Zauber Deines Gegners durch einen Zauber gleicher Art von Deiner Hand aus; Ziele können nicht neu gewählt werden und müssen valide sein.",
 "strength": "",
 "extra": "Verwirrung? Ich nenne es das Licht der Klarheit!",
 "rule_title": "Bildsignaturen",
 "rule": "Jeder, der es geschafft hat ein Orginalbild einer Karte rechtmäßig erworben zu haben, welche noch nicht mit ‚ict‘ signiert ist, darf es mit ‚ICT‘ oder ‚Ict‘ signieren. Dies ist in jedem Fall eine Wertsteigerung.",
 "date": 0
},

{
 "card_id": 421,
 "title": "Andere Seite",
 "cost": "",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Dies ist die Rückseite von der Rückseite.",
 "strength": "",
 "extra": "offizielle Hintergründe:<br><a href='../13X6RFKBR1GhJBtdGrfV2YQAVXHMbrBkoZ/img_back/bg_normal_ohnerahmen.png' target='top'>... andere Seite.</a><br><a href='../13X6RFKBR1GhJBtdGrfV2YQAVXHMbrBkoZ/img_back/bg_fm_ohnerahmen.png' target='top'>... andere Seite.</a><br><a href='../13X6RFKBR1GhJBtdGrfV2YQAVXHMbrBkoZ/img_back/bg_hk_ohnerahmen.png' target='top'>... andere Seite.</a><br><a href='../13X6RFKBR1GhJBtdGrfV2YQAVXHMbrBkoZ/img_back/bg_rz_ohnerahmen.png' target='top'>... andere Seite.</a><br>",
 "rule_title": "",
 "rule": "<br><br><i>„Ihr erkennt nicht, daß schon gekommen ist, was ihr erwartet.“</i>",
 "taken": true,
 "date": 0
},

{
 "card_id": 423,
 "title": "Dingseltsamkeit",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Kontert einen Platztausch oder mache einen Kreaturenkampf rückgängig - einmalig; Ziehe eine Karte.<br>Solange die Dingseltsamkeit in der Welt ist, ist sie auch aus der Welt entfernt.",
 "strength": "",
 "extra": "Seltsam...",
 "rule_title": "Hübschheiten",
 "rule": "Magier können Hübschheiten träumend in die Welt bringen ... einfach so.",
 "date": 0
},

{
 "card_id": 426,
 "title": "Kronossichel",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Die Kronossichel wirkt von außerhalb der Welten. Jede Teilrunde ist zeitlich begrenzt.",
 "strength": "",
 "extra": "Von allen menschlichen Werken, ist das Uhrwerk das teuflischste.",
 "rule_title": "Raum Zeit Kausalität",
 "rule": "Das Prinzip von Ursache und Wirkung ist stets gültig.<br><br><i>Insbesondere Irreversibilitäten und Zeitrichtung im Zusammenhangserlebnis als plausibler kosmische Bühne.</i>",
 "date": 0
},

{
 "card_id": 428,
 "title": "Schwalbe",
 "cost": "WW",
 "color": "white",
 "type": "Kreatur",
 "body": "Fliegt. Durchsuche Deine Bibliothek nach einer Schwalbe und lege sie direkt in die Welt.",
 "strength": "0/1",
 "extra": "Die eine Seite gehört dazu, die andere nicht.",
 "rule_title": "Reife",
 "rule": "Grundsätzlich ist jede Form von INCANTATA (Kartenspiel, 0-Seite, Kryptokarten, etc.) nur für Volljährige geeignet (18+). Eltern haften für ihre Kinder.",
 "date": 0
},

{
 "card_id": 431,
 "title": "Branntwein",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->: Lasse in Deiner nächsten Teilrunde eine Phase ausfallen und vermerke es.<br>->: Gebe Deinem Gegner Branntwein; Er läßt in seinen nächsten Teilrunde die vermerkte Phase ausfallen.",
 "strength": "",
 "extra": "Whisky oder Weinbrand?",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 456,
 "title": "Same",
 "cost": "0",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "Du kannst den Samen nur beschwören, wenn Du einen Apfelbaum in einer Deiner Welten hast. Kommt umgekantet in die Welt.<br>->: Der Same verwandelt sich in einen Apfelbaum.",
 "strength": "0/1",
 "extra": "Erntezeit!",
 "rule_title": "(δ)",
 "rule": "Ein Magier, der erkennt, daß er seinen Gegner nicht bezwingen kann, verkündet dies mit dem Satz: „Io sono incantata/o!“ („ich bin verzaubert/entzückt“). Falls ein Magier es bis zum Schluß nicht erkannt hat, kann er dies natürlich auch nachträglich tun. Bei INCANTATA kann man nicht verlieren; die Begegnung kann lediglich enden.",
 "date": 0
},

{
 "card_id": 457,
 "title": "Unterwerfung",
 "cost": "B3",
 "color": "blue",
 "type": "Spontanzauber, Ausschließlichkeit",
 "body": "Übernehme temporär die Kontrolle über einen Zielmagier. Für Taten, die unter dieser Kontrolle verübt werden, sind alle Magier verpflichtet Rachegefühle gegenüber dem Zielmagier zu pflegen.",
 "strength": "",
 "extra": "Also... du unterwirfst dich mir.",
 "rule_title": "Ende der Teilrunde",
 "rule": "Das „Ende der Teilrunde“ wird eröffnet mit der Deklaration des aktiven Magiers, der seine Teilrunde beenden will. Auf diesen Phasenwechsel darf wie immer geantwortet werden und die Phasewechselkaskade wird abgewickelt. Erst dann werden alle Effekte, die sich auf das Ende der Teilrunde beziehen, abgewickelt. Wenn dann ein Magier, der auch schon von Anfang an dabei war, 0 oder weniger Lebenspunkte hat, endet die Begegnung für diesen Magier.",
 "date": 0
},

{
 "card_id": 459,
 "title": "Geiz",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Einmaligkeit",
 "body": "Alle farblosen und lichtgrauen Zaubersprüche kosten _1_ mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "Gewinnbringend",
 "rule": "Wenn man mehrere gute Magierpersona erschaffen hat, kann man überzählige Persona auch verkaufen oder verschenken (Bibliotheksliste + Name).",
 "date": 0
},

{
 "card_id": 460,
 "title": "Zorn",
 "cost": "W",
 "color": "white",
 "type": "Verzauberung, Legende, Einmaligkeit",
 "body": "Alle roten Zaubersprüche kosten _R_ mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "Selbstverständlich",
 "rule": "Für Sachverhalte, die sich automatisch ergeben, braucht es keine Regel.",
 "date": 0
},

{
 "card_id": 461,
 "title": "Neid",
 "cost": "R",
 "color": "red",
 "type": "Verzauberung, Verdammnis, Einmaligkeit",
 "body": "Alle blauen Zaubersprüche kosten _B_ mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "Schuld begleichen",
 "rule": "Falls ein Magier angehalten wird Lebenspunkte zu zahlen, so können keine Zaubersprüche oder Effekte diesen Verlust an Lebenspunkten verhindern.",
 "date": 0
},

{
 "card_id": 462,
 "title": "Hochmut",
 "cost": "S",
 "color": "black",
 "type": "Verzauberung, Verdammnis, Einmaligkeit",
 "body": "Alle weißen Zaubersprüche kosten _W_ mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "zensiert",
 "date": 0
},

{
 "card_id": 463,
 "title": "Trägheit des Herzens",
 "cost": "G",
 "color": "green",
 "type": "Verzauberung, Verdammnis, Einmaligkeit",
 "body": "Alle schwarzen Zaubersprüche kosten _S_ mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "Änderungen",
 "rule": "Änderungen verwandeln die Karten in das was sie schon immer waren.",
 "date": 0
},

{
 "card_id": 464,
 "title": "Völlerei",
 "cost": "B",
 "color": "blue",
 "type": "Verzauberung, Legende, Einmaligkeit",
 "body": "Wähle rot oder grün. Alle Zaubersprüche der gewählten Farbe kosten _R_ oder _G_ mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "Farbmana",
 "rule": "Ein Ω steht für ein farbiges Mana beliebiger Farbe, sowie auch ein Ψ für ein Mana belibieger Farbe steht, dabei gilt aber: Ψ ungleich Ω. In den Regeln haben diese Zeichen aber andere Bedeutung.",
 "date": 0
},

{
 "card_id": 465,
 "title": "Wollust",
 "cost": "S",
 "color": "black",
 "type": "Verzauberung, Legende, Einmaligkeit",
 "body": "Alle grünen Zaubersprüche kosten _G_ mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "Ereignisse",
 "rule": "Alle Effekte und Zaubersprüche sind magische Ereignisse, kurz: <b>Ereignis</b>. Zaubersprüche und aktivierbare Effekte sind Ereignisse, die beschworen werden. Phasenwechsel, Verwirklichung (in die Welt kommen) von Himmelskörpern und Ländern, uvm. sind auch magische Ereignisse, allerdings ohne Aussenwirkung.",
 "date": 0
},

{
 "card_id": 466,
 "title": "Zornesfunkeln",
 "cost": "WW",
 "color": "white",
 "type": "Spontanzauber, Wunder",
 "body": "Eine Kreatur, die es wagt Dich anzugreifen, vernichtet sich selbst.",
 "strength": "",
 "extra": "Denk nichtmal drüber nach...",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 467,
 "title": "Ministerium für Wahrheit",
 "cost": "BBB",
 "color": "blue",
 "type": "Verzauberung, Legende",
 "body": "->, _B__B__B_: Ein Magier selbstzensiert gewaltig eine Karte von seiner Hand.",
 "strength": "",
 "extra": "Keine Ahnung wovon du redest, aber die Schokoladenrationen sind erhöht worden! Von 20 auf 25 Gramm die Woche! Toll, oder?",
 "rule_title": "Schutz",
 "rule": "Der Schutzengel gilt als reine Kreatur.",
 "date": 0
},

{
 "card_id": 468,
 "title": "Inquisition",
 "cost": "R",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Ein Magier muß wählen, ob er die obersten 3 Karten von seiner Bibliothek zensiert, oder 2 Schaden erhält.",
 "strength": "",
 "extra": "",
 "rule_title": "Gipfelturniersprachen",
 "rule": "Die Sprache in der das Gipfelturnier ausgetragen wird ist die erste Amtssprache des Austragungsortes.",
 "date": 0
},

{
 "card_id": 469,
 "title": "Philosoph",
 "cost": "WB1",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "->, _1_: Stelle eine Bleibekarte zurück.",
 "strength": "1/1",
 "extra": "Geh mir aus der Sonne.",
 "rule_title": "Kunstwerke",
 "rule": "Ein Ideenweltoriginal (Wirklichkeitsbild oder -Skulptur) einer Karte beigesteuert zu haben oder aber eines zu haben ist nicht wichtig für das Kartenspiel, aber natürlich einfach schön und für Kunstsammler gewiß unwiderstehlich. Dasselbe gilt natürlich auch für Originale - Originale aber sind unveräußerlich - einge von ihnen werden aber ausgestellt.<br><br><i>„Es gibt Ideenweltoriginale - Skulpturen, die ein Bild sein können.<br>Es gibt Originale - die Originalkarten.“</i>",
 "date": 0
},

{
 "card_id": 470,
 "title": "Schandmal",
 "cost": "S",
 "color": "black",
 "type": "Kreaturenverzauberung, Verdammnis",
 "body": "Die Kreatur erhält -2/-1 und ist schwarz.",
 "strength": "",
 "extra": "",
 "rule_title": "Tiger",
 "rule": "Wenn man den ersten Tiger kontern kann, könnte man das tun, sonst kann man vielleicht nicht gewinnen.<br><br>„(δ)“",
 "date": 0
},

{
 "card_id": 472,
 "title": "Narzismus",
 "cost": "SS",
 "color": "black",
 "type": "Magierverzauberung, Verdammnis",
 "body": "Versorgung≔ _S_.<br>Alle Zauber, die auf einen Magier zielen können, zielen auf den Verzauberten.",
 "strength": "",
 "extra": "Wer glaubt es besser malen zu können soll es versuchen.",
 "rule_title": "Spielregel",
 "rule": "Falls sich zwei Ereignisse widersprechen so gilt das bösere als das stärkere.<br><br><i>„Der Mythos ist nicht gelogen.</i>“",
 "date": 0
},

{
 "card_id": 476,
 "title": "Koi Brunnen",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Wunder",
 "body": "->,_2_: Beschwöre einen Materiezauber in der Hauptphase Deines Gegners, aber natürlich nicht während der Kampfphase.",
 "strength": "",
 "extra": "Das gibt’s doch nicht!",
 "rule_title": "Turnierkarten",
 "rule": "Auf einem Turnier sind nur Spielkarten der offiziell genehmigten Druckserien erlaubt oder farbig, sorgfältig ausgedruckte Karten von der Zeroseite. Die Rückseiten müssen ausreichend gleich sein, oder es müssen Hüllen mit undurchsichtigen Rückseiten verwendet werden, allerding mit unterscheidbaren Rückseiten (zum Beispiel farbig): Eine für Raumzeitgefüge, eine für das Mantra der Reinheit, eine für Himmelskörper und eine für alle anderen. (Turnierregel)",
 "date": 0
},

{
 "card_id": 480,
 "title": "Häßlichkeit",
 "cost": "SB1",
 "color": "black",
 "type": "Kreaturenverzauberung, Verdammnis",
 "body": "Die Zielkreatur verliert alle Eigenschaften und wird wie eine Kopie einer anderen, häßlichen, Kreatur behandelt.",
 "strength": "",
 "extra": "Es gibt gewiß auch nichthäßliche Kreaturen.",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 482,
 "title": "Nacht der Verdammten",
 "cost": "2S",
 "color": "black",
 "type": "Verzauberung, Legende",
 "body": "->: Mische eine Karte aus Deiner Unterwelt in Deine Bibliothek.<br>->, _2_, Opfere eine Kreatur: Nehme eine Karte aus Deiner Unterwelt in die Hand.",
 "strength": "",
 "extra": "Heulen und Zähneklappen ... jenseits des Vergessenshorizontes.",
 "rule_title": "Letzte Runde",
 "rule": "Die letzte Runde heißt Ragnarök.",
 "date": 0
},

{
 "card_id": 483,
 "title": "Rüge der Magiergilde",
 "cost": "2",
 "color": "light_grey",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kontert einen Zauberspruch, dessen Farbe nicht zum Schicksal des Beschwörers passt, jener Magier erhält einen Schaden.",
 "strength": "",
 "extra": "Mehr als eine Rüge wird nicht nötig sein.",
 "rule_title": "Letztes Wort...",
 "rule": "... des Magierdachverbandes: Was sich jetzt noch an Regelfragen stellt, sollte sich ganz wie von selbst ergeben, ansonsten müßt ihr daran arbeiten, jene ausreichend zu beantworten.",
 "date": 0
},

{
 "card_id": 484,
 "title": "Fluidisierung",
 "cost": "R1",
 "color": "red",
 "type": "Unterbrechungszauber",
 "body": "Beschwöre ein Artefakt als Unterbrechungszauber.<br>Lass die anderen Magier entscheiden, ob Du eine Karte ziehen darfst.",
 "strength": "",
 "extra": "Jetzt wird’s lustig!",
 "rule_title": "Spielen in der Kryptowirklichkeit",
 "rule": "Obwohl die Wirklichkeitsbegegnung unersetzlich ist, kann man auch durch das Internet spielen. Und zwar mit wirklichen Karten über Videokonferenz (oder zur Not mit Textgruppenchat und Notizen). Die technischen Notwendigkeiten für diese Videokonferenz müssen den Anforderungen der Free Software Foundation und Anonymität genügen. (z.B. TOX Messanger).<br><p style='text-align: center;'>Das<br>Computerspiel<br><b>‚INCANTATA‘</b></p><br> Viel Spaß!",
 "taken": "true",
 "date": 0
},

{
 "card_id": 485,
 "title": "Todesspiegel",
 "cost": "B2",
 "color": "blue",
 "type": "Spontanzauber, Legende",
 "body": "Transformiere temporär ein Tupel der Form +-X/+-Y in -+Y/-+X.",
 "strength": "",
 "extra": "",
 "rule_title": "Melodie des Avatars",
 "rule": "Um seine magische Persona und deren Avatar auszuschmücken bediene man sich im Sinne eines Rollenspiels den bekannten literatischen Figuren wie Zwergen, Elfen, Magier, Schamanen, Engel, Teufel, Dämonen, Hohepriester, Druiden, Angehörige der Göttersagen, Hexen, uvm - um die Spielwelt möglichst bunt und abwechslungsreich zu gestalten.",
 "date": 0
},

{
 "card_id": 487,
 "title": "Seelenspaltung",
 "cost": "RGY",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Y ist die Zahl Karten, die ein Magier auf der Hand hat. Tausche Handkarten mit jenem Magier.",
 "strength": "",
 "extra": "Hin und hergerissen, ohne Orientierung.",
 "rule_title": "Lüge",
 "rule": "Eine Lüge ist in jeder Sprache eine Lüge. Die Wahrheit läßt sich in jede Menschensprache übersetzen.<br><br><i>Eine Lüge ist eine Lüge ist eine Lüge ist eine...</i>",
 "date": 0
},

{
 "card_id": 488,
 "title": "Wunderheilung",
 "cost": "G",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Vernichte alle bösen Verzauberungen, die auf einen Magier gerichtet sind. Du erhälts ein Leben.",
 "strength": "",
 "extra": "Fühlt sich geradezu märchenhaft an.",
 "rule_title": "Märchenhaft",
 "rule": "Falls zufällig ein Zauberspruch durch ein Land ausgetauscht wird, so wird dieses einfach so in die Welt gelegt.<br><br><i>„Wer die Wahrheit lebt ist unantastbar.“</i>",
 "date": 0
},

{
 "card_id": 489,
 "title": "Geistesblitz",
 "cost": "BBBBBBB",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Erstelle eine Kopie eines Zauberspruches der Ideenwelt dieser Begegnung.",
 "strength": "",
 "extra": "Die wirklich wichtigen Erkenntnisse gibt es schon immer.",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 490,
 "title": "Mystiker",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur, Wunder",
 "body": "->: Ändere unterbrechend die Herkunft eines Zauberspruches auf ‚unbekannt‘.<br>->, _3_: Ändere die Herkunft eines Zauberspruches aus der gesamten Ideenwelt auf ‚unbekannt‘.",
 "strength": "1/1",
 "extra": "Nur ein Kleingeist läßt sich davon beirren.",
 "rule_title": "Magierpersona",
 "rule": "Eine Bibliothek zu verfeinern kann Jahre dauern. Das Ergebnis: Eine gut balancierte, ausreichend getestete und schöne Bibliothek (59..60 + 13 Karten) ist eine Magierpersona. Der Name von Magierpersona und Bibliothek stellen die innere Identität dar. Um die Identität zu verbergen, im Sinne eines Avatars, darf man einen Alias verwenden, den man stets ändern darf. Der Name von Alias und Avatar stellen die äußere Identität dar.",
 "date": 0
},

{
 "card_id": 491,
 "title": "Bündnisbruch",
 "cost": "SSS",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Zerstöre alle Kreaturen Deiner Komplizen.",
 "strength": "",
 "extra": "Wer solche Verbündete hat braucht keine Gegner mehr.",
 "rule_title": "Lichtbringer",
 "rule": "Da die Vormerkung von Zielen und Aktivierungskosten gleichzeitig geschieht, so kann der Lichtbringer sich nicht selber aus der Welt bringen (da zur Zeit der Aktivierung die Vormerkung des angekantet seins noch nicht vollzogen ist). Dagegen kann man mit einem Spiegelschild durchaus das Ziel des Effektes des Lichtbringers auf ihn selbst richten, da die Gleichzeitigskeitskaskade in der ganz üblichen Zeitrichtung abgearbeitet wird, und somit zum Zeitpunkt der Deklaration des Spiegelschildes die Vormerkung des Ankantens vollzogen ist.",
 "date": 0
},

{
 "card_id": 492,
 "title": "Schluckauf",
 "cost": "G",
 "color": "green",
 "type": "Unterbrechungszauber, Legende",
 "body": "Ein Gegner beschwört zufällig eine Karte aus seiner Hand, ohne dessen Beschwörungskosten zu zahlen und ohne die Phasenbeschränkung zu beachten. Falls kein Valides Ziel vorhanden ist, verpufft der Zauberspruch.",
 "strength": "",
 "extra": "Na sowas!",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 493,
 "title": "Verblödung",
 "cost": "R3",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Alle Magier legen ihre Handkarten auf den Stapel der Ignoranz. In der Zugphase zieht jeder Magier auch von jenem Stapel eine Karte.",
 "strength": "",
 "extra": "Die Blödheit in der Welt ist nicht zu unterschätzen.",
 "rule_title": "Künstler",
 "rule": "Wer ein Bild vollendet hat, hat es gemalt, ist also der Künstler, wenn auch nicht der Schöpfer.",
 "date": 0
},

{
 "card_id": 494,
 "title": "Das Püppchen",
 "cost": "7",
 "color": "artifact",
 "type": "Artefakt, Kreatur, Legende",
 "body": "Behandle das Püppchen, wie ein Kopie eines Urmagiers, dessen Teilrunde (ohne Zugphase) in Deiner Hauptphase ist. ->,_2_: Püppchen zieht eine Karte von der Bibliothek des Urmagiers. ->,_1_: Püppchen beschwört eine Karte mit beliebigem Mana von Dir.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Einfacher",
 "rule": "Der Sprachschönheit halber kann das Teilwort „Karte“ weggelassen werden, wenn aus dem Zusammenhang klar wird, daß es sich um die Karte, nicht den Zauber handelt.",
 "date": 0
},

{
 "card_id": 495,
 "title": "Spiegeluniversum",
 "cost": "6",
 "color": "artifact",
 "type": "Gegnerverzauberung, Legende",
 "body": "_2_: Kopiere einmalig einen Zauber des Gegners. Dein Gegner darf das stets auch. Gilt nicht für Zaubersprüche, des Spiegeluniversums. Wenn das Spiegluniversum die Welt verlässt, so auch alle dadurch enstandenen Bleibekarten.",
 "strength": "",
 "extra": "Da wird einem ganz plümerant.",
 "rule_title": "Werden und Verwandeln",
 "rule": "Elemente von A∈(Materie): Verwandlung ⇒ A wird zunichte gemacht. A∈(Ideenwelt): Verwandlung ⇒ A wird verwirklicht markiert. A∈(Materie): Werden ⇒ A erhält alle Eigenschaften und Effekte und erhält welche dazu (Bsp. Wellenpferde). A∈(Ideenwelt): ⇒ A wird vollständig zum Neuen.",
 "date": 0
},

{
 "card_id": 496,
 "title": "Akademie",
 "cost": "0",
 "color": "blue",
 "type": "Geheimnis, Legende",
 "body": "Du darfst ein Geheimnis in der Bibliothek haben. Nachwirkung≔ Ziehe eine Karte. Offenbarung: Deine Komplizen ziehen 2 Karten oder Deine Gegner legen 2 Karten ab. _B__B__B__B__B_: Tausche ein Geheimnis in der Welt mit diesem von Deiner Hand.",
 "strength": "",
 "extra": "",
 "rule_title": "Großmagier",
 "rule": "Die Anzahl der geweihten Großmagier ist geheim.<br><br><i>Ich bin des trockenen Tons nun satt,<br>Muss wieder recht den Teufel spielen.</i>",
 "date": 0
},

{
 "card_id": 497,
 "title": "G’schwindiger",
 "cost": "B1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Mache einen Zauberspruch oder aktivierbaren Effekt eine Stufe schneller.",
 "strength": "",
 "extra": "Selbst die Trägheit stellt nur oberflächlich eine Beschränkung dar.",
 "rule_title": "Literaturhinweis",
 "rule": "‚The Awful German Language‘ by Mark Twain",
 "date": 0
},

{
 "card_id": 500,
 "title": "Titanisierung",
 "cost": "2W",
 "color": "white",
 "type": "Artefaktverzauberung, Legende",
 "body": "Verzaubere 2 Deiner Artefakte, eines davon ist unzerstörbar. Falls die Titanisierung zerstört wird werden beide Artefakte zerstört.",
 "strength": "",
 "extra": "In der Welt der Geräte und Maschinen hängt so manches verhängnisvoll zusammen.",
 "rule_title": "Gleichzeitigskeitskaskade",
 "rule": "Die Gleichzeitigkeitskaskade ist die schnellste Teilkaskade. Es ist die Kaskade mit den Beschwörungen - also Ziele und Aktivierungskosten vormerken und die Karten ablegen. Dies geschieht je Beschwörung/Aktivierung gleichzeitig. Die Gleichzeitigkeitskaskade wird anders als alle anderen Teilkaskaden in der Reihenfolge der Beschwörungen abgewickelt, also ganz so wie die Zauberbeschwörungen am Tisch stattfinden, also nicht „letzer zuerst“.",
 "date": 0
},


{
 "card_id": 501,
 "title": "Gold",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt, Seltenheit",
 "body": "->: Tausche einvernehmlich Gold mit einer Bleibekarte eines anderen Magiers, die weder Mana erzeugt noch verwandelt.",
 "strength": "",
 "extra": "Gold ist immer etwas wert.",
 "rule_title": "Magisches Erbe",
 "rule": "Falls für einen Magier die Begegnung geendet hat, aber die Begegnung noch nicht, werden alle die Bleibekarten, die in den Welten des Betroffenen sind, aus der Welt entfernt. Jene Karten aber, die in anderen Welten sind, bleiben bis zum Ende der Begegnung. Dazu zählen zum Beispiel Karten, die in der Hand oder Bibliothek eines anderen Magiers sind und auch gezielte Verzauberungen auf Kreaturen, nicht jedoch Magierverzauberungen (da jene in der Welt des betroffenen Magiers sind).",
 "date": 0
},

{
 "card_id": 502,
 "title": "Abschmettern",
 "cost": "G",
 "color": "green",
 "type": "Spontanzauber, Wunder",
 "body": "Reduziere den Schaden aus einer Quelle auf 1.",
 "strength": "",
 "extra": "Noch mehr als der Angreifer, braucht der Ausweichende ein genaues Zeitmaß.",
 "rule_title": "Klare Sache",
 "rule": "Nun folgen alle restlichen Regeln, die sowieso klar sind (zensiert:): &#9608;&#9608;&#9608; ... &#9608;&#9608;&#9608; ... &#9608;&#9608;&#9608; ... &#9608;&#9608;&#9608; ... &#9608; ... usw.",
 "date": 0
},

{
 "card_id": 503,
 "title": "Kanibalismus",
 "cost": "S",
 "color": "black",
 "type": "Verzauberung",
 "body": "Alle Kreaturen erhalten die Fähigkeit ‚->: Zerstöre eine Kreatur, wenn sie die gleiche ist.‘",
 "strength": "",
 "extra": "In der Not weiß die Natur sich zu behelfen.",
 "rule_title": "Gedanken Strich Rechnung",
 "rule": "Zauberspruchsätze mit „ - “ haben mehrere Teile, die gleizeitig verwirklicht werden. Die Teile sind durch „ - “ getrennt. An einem Wort („Wort-“) ist es ein Bindestrich. An einer Zahl („-3“) ist es ein Minus. In den Regeln sind es ... Gedanken - Striche, oder an Satzanfängen Aufzählungszeichen.",
 "date": 0
},

{
 "card_id": 504,
 "title": "Fatale Resonanz",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber, Verdammnis",
 "body": "Ein Magier, der diese Teilrunde einen Konter beschworen hat, erhält 4 Schaden.",
 "strength": "",
 "extra": "Der Gegner hört zunächst nur ein Knacken, dann aber wird er geblendet und Funken prasseln.",
 "rule_title": "Privatssphäre",
 "rule": "Die große Begegnung findet vorzugsweise ohne Mobiltelefone (und ähnliche peilbare/abhörbare Technik/Implantate/etc.) statt, vor allem um den teilnehmenden Magiern, die Wert auf Privatssphäre legen, gerecht zu werden. In diesem Sinne ist auch die annonyme Teilnahme an großen Begegnungen zu gewährleisten (also auch keine personalisierten Anwesenheitslisten). Der Schirmherr der großen Begegnung ist jener, der die Verfügungsgewalt über die Räumlichkeit hat. Der Schirmherr ist angehalten die Privatsphäre der teilnehmenden Magier zu wahren.<br><br><i>„Jeden Großmagier umgibt ein Geheimnis.“</i>",
 "date": 0
},

{
 "card_id": 505,
 "title": "Fluch des Ikarus",
 "cost": "G2",
 "color": "green",
 "type": "Verzauberung",
 "body": "Alle Kreaturen verlieren ihre Flugfähigkeit.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)<br><br><i>Eine weitere tödliche Falle des Labyrinthes - zur Selbstlüge geschmeichelt.</i>",
 "date": 0
},

{
 "card_id": 506,
 "title": "Sternennavigator",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "->, _1_: Stelle energetisch einen Saturn oder ein Schicksal zurück.",
 "strength": "1/1",
 "extra": "Durch endlose Finsternis eine sichere Passage.",
 "rule_title": "Magiergilden",
 "rule": "Eine Magiergilde besteht idealerweise und maximal aus 8 Magiern: 6 Farbgroßmagier und 2 Graugroßmagier (zur Not reichen auch 5 aktive Magier). Die Magier müssen sich nicht auf eine Farbe festlegen. Regelmäßige große Begegnungen sind das Ideal. Entscheidungen die Magiergilde betreffend können durch 5 Magier festgelegt werden. Zu Turnieren oder Duellen werden 5 Magier ernannt, die die Begegnungen ausfechten.<br><br>„(δ)“",
 "date": 0
},

{
 "card_id": 507,
 "title": "Weihwasser",
 "cost": "W",
 "color": "white",
 "type": "Energiezauber",
 "body": "Erhöhe die Geschwindigkeit eines aktivierbaren Effektes einer Bleibekarte.",
 "strength": "",
 "extra": "... aus heiliger Quelle.",
 "rule_title": "Genug Zeit",
 "rule": "Magier sagen ihre Aktionen stets so an, daß genügend Zeit zum reagieren ist, z.B. zum kontern. Generell ist Magiern zum Nachdenken angemessen Zeit zu gewähren. Taktische Verzögerungen, welche den Spielrythmus stören sollen, sind untersagt.",
 "date": 0
},

{
 "card_id": 510,
 "title": "Ausrasten",
 "cost": "2(Ψ|Ω)",
 "color": "blank",
 "type": "Unterbrechungszauber",
 "body": "Verwandle einen Gewaltzauber in einen Unterbrechungszauber.",
 "strength": "",
 "extra": "Schweinebande!",
 "rule_title": "Ohne Worte",
 "rule": "Falls das Bild einer Karte eine Kopie der Datei img_blank.jpg ist, so muß der Magier das Bild vor Begegnungsbeginn selber in die Karte einbringen. Wer sich über solche Karten wundert (z.b. Rotkelchen und ähnliche): Sie stellen die 7 Freiheitsgrade der Gestaltungsfreiheit von Persona und Avatar dar.",
 "taken": true,
 "date": 0
},

{
 "card_id": 511,
 "title": "",
 "cost": "",
 "color": "",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "zensiert",
 "date": 0
},

{
 "card_id": 515,
 "title": "Beklemmung",
 "cost": "S",
 "color": "black",
 "type": "Verzauberung",
 "body": "Die Höchstanzahl an Karten, die jeder Magier am Ende seiner Teilrunde in der Hand halten darf, wird um 2 reduziert. Diese Höchstanzahl kann nicht geringer als 3 sein.",
 "strength": "",
 "extra": "... und Angst.",
 "rule_title": "Verboten!",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 529,
 "title": "Zaubermacht",
 "cost": "GG",
 "color": "green",
 "type": "Spontanzauber, Legende",
 "body": "Verdopple einen Gewaltzauber Deines Gegners.",
 "strength": "",
 "extra": "Zaubermacht... es ist vollbracht!",
 "rule_title": "(δ)",
 "rule": "(δ)<br><br><i>Am Ende einer Welt steht ein Kunstwerk, an dem man nicht vorbeikommt.</i>",
 "date": 0
},

{
 "card_id": 530,
 "title": "Betesda",
 "cost": "0",
 "color": "white",
 "type": "Geheimnis, Legende",
 "body": "Du darfst ein Geheimnis in der Bibliothek haben. Nachwirkung≔ Ziehe eine Karte. Offenbarung: Deine Komplizen erhalten je 5 Lebenspunkte. _W__W__W__W__W_: Tausche ein Geheimnis in der Welt mit diesem von Deiner Hand.",
 "strength": "",
 "extra": "",
 "rule_title": "Was weiß ich?!",
 "rule": "INCANTATA wird nie fertig, trotzdem gibt es (◆ Feier-|alle) Abende und (◆ Feier-|alle) Tage an denen (◆ Manselbst|niemand) nicht über INCANTATA nachdenken (◆ muß|darf)<br><br><i>„Wer die Macht des Taos versteht zu nutzen, wird alle stets verdutzen.“</i>.",
 "date": 0
},

{
 "card_id": 539,
 "title": "Kathedrale",
 "cost": "BW",
 "color": "blue",
 "type": "Verzauberung",
 "body": "->: Verstecke Dich als Geist in der Kathedrale, daß heißt:: Deine Wirkungszone ist nichtig, Du darfst nur noch unterbrechend oder spontan zaubern, Deine Lebenspunkte sind eingefrohren. Opfere die Kathedrale: Materialisiere Dich wieder.",
 "strength": "",
 "extra": "",
 "rule_title": "Friedliche Einigung",
 "rule": "Auf Turnieren müssen alle Begegnungen bis zum Ragnarök ausgefochten werden, also bis alle Lichtbringer und Märtyrer feststehen. Bei sonstigen Begegnungen dürfen sich die Magier einvernehmlich unentschieden trennen.<br><br><i>Dann alle faule Zaubermacht, am Tag der Abrechnung, sich nur lachhaft macht.</i>",
 "date": 0
},

{
 "card_id": 541,
 "title": "Rundumschlag",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Dein Gegner und seine Komplizen erhalten verdienterweise eine gewischt, also je einen Schaden.",
 "strength": "",
 "extra": "Am besten gleich alle auf einmal.",
 "rule_title": "Zustände",
 "rule": "Zustände von Karten sind Modi in denen sich die Karte befindet, zum Beispiel angekantet, umgekantet, etc.<br>Merke: Karten haben auch Eigenschaften - zum Beispiel ist die Farbe eine Eigenschaft.",
 "date": 0
},

{
 "card_id": 544,
 "title": "Enthüllung",
 "cost": "W",
 "color": "white",
 "type": "Hübschheit, Wunder",
 "body": "Nachwirkung≔ Alle anderen Magier, die mindestens eine Hübschheit haben, dürfen eine Karte ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "taken": true,
 "date": 0
},

{
 "card_id": 546,
 "title": "Konter",
 "cost": "BΩ",
 "color": "blank",
 "type": "Unterbrechungszauber, Legende",
 "body": "Ω ist von der Farbe des Zielzaubers, welcher elegant und kunstfertig gekontert ist..",
 "strength": "",
 "extra": "Wer einen am Abgrund stehenden Großmagier angreift, stürmt in den Tod.",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 551,
 "title": "Lagerfeuer",
 "cost": "R",
 "color": "red",
 "type": "Hübschheit, Wunder",
 "body": "Nachwirkung≔ Alle anderen Magier, die mindestens eine Hübschheit haben, dürfen eine Karte ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ&#8327;)",
 "taken": true,
 "date": 0
},

{
 "card_id": 553,
 "title": "Gnu",
 "cost": "ΩΩ",
 "color": "blank",
 "type": "Kreatur, Vielheit",
 "body": "Wenn ein Magier mit einem Gnu angreift oder blockt, dürfen alle anderen Magier mit ihren Gnus mitmachen.",
 "strength": "1/3",
 "extra": "Grunz! Bölk!",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 555,
 "title": "Hirschkäferamulett",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, verboten",
 "body": "Opfere das Hirschkäferamulett: Füge 3 Mana beliebiger Farbe zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Das Zusammenfalten einer Welt bringt so manches Kleinod ans Licht.",
 "rule_title": "DG-Seiten",
 "rule": "Nur Alpha-Mantras der 1JeCDXuDG7VLJbimZQ6nWmN beij2UV6P92 ICT-DG Seite, welche in der Kopfzeile der INCANTATA-DE Seite zu finden sind, sind gültig.(δ)",
 "date": 0
},

{
 "card_id": 558,
 "title": "Welle",
 "cost": "B",
 "color": "blue",
 "type": "Hübschheit, Wunder",
 "body": "Nachwirkung≔ Alle anderen Magier, die mindestens eine Hübschheit haben, dürfen eine Karte ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "taken": true,
 "date": 0
},

{
 "card_id": 565,
 "title": "Verzauberung",
 "cost": "S",
 "color": "black",
 "type": "Hübschheit, Wunder",
 "body": "Nachwirkung≔ Alle anderen Magier, die mindestens eine Hübschheit haben, dürfen eine Karte ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "Triumph",
 "rule": "Wenn bei einer großen Begegnung zwei Komplizen am Ende einer Teilrunde ihre Seelen aushauchen und die übrigen 3 Magier überleben, so triumphieren diese 3 Magier zusammen (die Märtyrerpunkteverteilung wird dabei nicht geändert, was den Triumph nicht schmälert).<br><br><i>„Onko koira kotona?“</i>",
 "taken": true,
 "date": 0
},

{
 "card_id": 572,
 "title": "Rotkehlchen",
 "cost": "G",
 "color": "green",
 "type": "Hübschheit, Wunder",
 "body": "Nachwirkung≔ Alle anderen Magier, die mindestens eine Hübschheit haben, dürfen eine Karte ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "taken": true,
 "date": 0
},

{
 "card_id": 573,
 "title": "&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;",
 "cost": "&#9608",
 "color": "blank",
 "type": "&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Böse",
 "rule": "Ob und wie böse ein Ereignis ist liegt in der Intention des beherrschenden Magiers.",
 "date": 0
},

{
 "card_id": 597,
 "title": "Charisma",
 "cost": "ΩΩ",
 "color": "blank",
 "type": "Unterbrechungszauber, Vielheit",
 "body": "Ω ist von einer Farbe einer Deiner Hübschheiten.<br>Lenke einen Zauberspruch auf ein Ziel eines Magiers mit weniger Hübschheiten.",
 "strength": "",
 "extra": "Über einen INCANTATA-Magier herrscht nur er selbst.",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 598,
 "title": "Bezaubernder Charme",
 "cost": "ΩΨ",
 "color": "blank",
 "type": "Verzauberung",
 "body": "Ψ und Ω sind von je einer Farbe einer Deiner Hübschheiten.<br>Versorgung≔ _1_.<br>Du kannst nur angegriffen werden, wenn Du weniger oder gleichviel Hübschheiten wie Deine Komplizen hast.",
 "strength": "",
 "extra": "",
 "rule_title": "Regel und Tugend",
 "rule": "Wer bei Machtfragen bescheiden - die Gesamtbalance entsprechend beachtend (sich selbst nicht vergessend) - ist, der hat zurrecht Recht. Beachte dies bei Regelfragen, Regelauslegungen.",
 "date": 0
},

{
 "card_id": 599,
 "title": "Zustandsfluktuation",
 "cost": "BB",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Beschöre einen Zauberspruch von Deiner Hand, wie den nächst schnelleren Zauberspruch, aber mindestens so schnell wie ein Spontanzauber.",
 "strength": "",
 "extra": "In Ruhe und Bewegung.",
 "rule_title": "Namenloser",
 "rule": "Der Namenlose ist keine lichtgraue Karte sondern die Karte hat in der ganzen Begegnung die Schicksalsfarben der Gegner (Schicksalslos gilt als farblos). Das erstreckt sich also auch auf die Farbe des Zauberspruches, Farbe der Bleibekarte, Farbe der Karte in der Hand, Unterwelt, usw.",
 "date": 0
},

{
 "card_id": 601,
 "title": "Delfin",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur, Wunder",
 "body": "Wenn Wellenpferde in der Welt sind, kannst du den Delfin als Unterbrechungszauber beschwören.<br>Schutz vor Rot.",
 "strength": "1/1",
 "extra": "Ein gutes Omen!",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 608,
 "title": "Eule",
 "cost": "SS",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Vertraute des Todesengels.<br>Fliegt.<br>Mondmacht, ->: Zerstöre eine Kreatur mit einer Widerstandskraft, von nicht größer eins.",
 "strength": "1/1",
 "extra": "Ihr Meister bringt dem Großmagier Nachrichten, die Magistratur betreffend.",
 "rule_title": "Vorsicht",
 "rule": "Man sollte stets aufpassen, welche Grenzen man übertritt, denn es gibt tödliche Geheimnisse.",
 "date": 0
},

{
 "card_id": 611,
 "title": "Wahnsinn",
 "cost": "0",
 "color": "black",
 "type": "Geheimnis, Legende",
 "body": "Du darfst ein Geheimnis in der Bibliothek haben. Nachwirkung≔ Ziehe eine Karte. Offenbarung: Alle Magier legen 3 Karten ab oder erhalten 3 Schadenspunkte. _S__S__S__S__S_: Tausche ein Geheimnis in der Welt mit diesem von Deiner Hand.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 617,
 "title": "Falke",
 "cost": "WW",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Vertrauter des Racheengels.<br>Fliegt.<br>Wird zum Angriff nicht angekantet.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 620,
 "title": "Schattenkrone",
 "cost": "0",
 "color": "black",
 "type": "Kreaturenverzauberung, Legende",
 "body": "Gilt als schwarze Karte. Immer wenn die Kreatur Schaden macht lege 2 Lebenspunktsigna in Deine Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 622,
 "title": "Hermes",
 "cost": "1",
 "color": "light_grey",
 "type": "Kreatur",
 "body": "Offenbarung: Hermes verwandelt sich in den Himmelskörper Merkur in der Welt.",
 "strength": "1/1",
 "extra": "Wer durschaut schon das Maskenspiel der Töchter und Söhne des Olymp.",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 626,
 "title": "Wölfe",
 "cost": "GG",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "Vertraute des Engels gerechten Pfades.<br>Kreaturen, die die Wölfe blocken, erhalten -1/-0<br>_1_: Einmalig pro Teilrunde temporär +1/+1.",
 "strength": "1/1",
 "extra": "Inkarnation der Freiheit und Wildheit.",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 635,
 "title": "Feuersalamander",
 "cost": "RR",
 "color": "red",
 "type": "Kreatur, Wunder",
 "body": "Vertrauter des Angelo della Vittoria.<br>Verursacht Durchbruchsschaden<br>Vernichte eines Deiner Artefakte: Temporär +2/+2.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 641,
 "title": "Das letzte Wort",
 "cost": "B1",
 "color": "blue",
 "type": "Energiezauber, Legende",
 "body": "Kontert einen bösen Schnellzauber.",
 "strength": "",
 "extra": "Das letzte Wort steht schon seit langem fest.",
 "rule_title": "(δ)",
 "rule": "(δ)",
 "date": 0
},

{
 "card_id": 644,
 "title": "Gespenst",
 "cost": "BB",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Vertrauter des Traumengels.<br>_1_: Fliegt.<br>_2_: Verschwinden.<br>_3_: Buuuhhh-huuuu-huuUUUUUuuuu...",
 "strength": "1/1",
 "extra": "... Buuuhhh-huuuuu-buuuuUUUUHHHHhhh...",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 653,
 "title": "Zorn Gottes",
 "cost": "W2",
 "color": "white",
 "type": "Gewaltzauber, Legende",
 "body": "Entferne alle Engel aus der Welt.",
 "strength": "",
 "extra": "Ihr habt es so gewollt.",
 "rule_title": "Suspendierung",
 "rule": "Falls ein Magier in einer Begegnung eine Rüge der Magiergilde erhalten hat, und eine weitere erhält, so wird er für eine Runde suspendiert, daß heißt er kann nicht angreifen und keine Zaubersprüche sprechen.<br><br><i>Darum hat das Totenreich den Schlund aufgesperrt und den Rachen aufgetan ohne Maß, daß hinunterfährt, was da lärmt und prangt, alle Übermütigen und Fröhlichen.</i>",
 "date": 0
},

{
 "card_id": 654,
 "title": "Chaos",
 "cost": "S",
 "color": "black",
 "type": "Unterbrechungszauber",
 "body": "Tausche einen Zauberspruch mit einem von einer Karte, die zufällig aus der vereinten Gedankenwelt ermittelt wird. Die Beschwörungskosten jenes Zaubers gelten als schon bezahlt und die betreffende Karte wird als beschworen abgelegt.",
 "strength": "",
 "extra": "Ihr habt es wirklich so gewollt.",
 "rule_title": "Ziel der Großen",
 "rule": "Ziel der Großen Begegnung ist es die Welt sich voll enfalten zu lassen, sie dabei kunstvoll in Balance zu halten, um dann in einem fulminanten Finale seine Feinde sich selbst und sich gegenseitig vernichten zu lassen und in die abstürzenden Unterwelten fallen zu lassen, während man Sichselbst in die Wirklichkeit rettet.<br><br><i>„Am Kartentische gewinnen stets alle, die es verstanden haben.“</i>",
 "date": 0
},

{
 "card_id": 656,
 "title": "Nein!",
 "cost": "0",
 "color": "light_white",
 "type": "Gleichzeitigkeitszauber, Vielheit",
 "body": "Kann unausgesprochen beschworen werden. Hat Wirklichkeitswirkung.",
 "strength": "",
 "extra": "Diesen Zauberspruch perfekt zu beherrschen, ist das erste Lernziel eines jeden Großmagieraspiranten.",
 "rule_title": "Nein und Ja",
 "rule": "<s>Voschläge und Bildeinreichungen sind nur beim oben auf der Seite angegeben Forum einzureichen. Posts dieser Art werden von der künstlerischen Leitung nicht kommentiert und nicht upgevotet. Auch wird keinerlei Kommentar gepostet, wenn eine Einreichung angenommen wird. Die Änderung erscheint dann (wann auch immer oder nie) auf 134.html. Mache Dich darauf gefasst, daß Deine Vorschläge abgelehnt werden, aber lasse dich nicht entmutigen und versuche einen anderen Vorschlag oder ein anderes Bild einzureichen oder hoffe, daß einer Deiner Einreichungen es doch noch bis ins Spiel schafft.</s>",
 "date": 0
},

{
 "card_id": 662,
 "title": "",
 "cost": "",
 "color": "black",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Zitate und Kunstspielziel",
 "rule": "Ganz vor allen erwähne ich Richard Garfield, ihm sei eine Option auf eine Bildeinreichung zur Seerose geschenkt. Darüber hinaus natürlich noch über 180 schwerwiegende Kunstgiganten... wer versucht alle zu erraten gewinnt das Spiel! Und wer versucht besonders viele zu erraten ist ein ganz toller Hecht. Und wer alle errät kann sich einen Zauberhut aufsetzen.",
 "date": 0
},

{
 "card_id": 665,
 "title": "Todessucht",
 "cost": "S",
 "color": "black",
 "type": "Verzauberung",
 "body": "Lege 5 Lebenspunktsigna in Deine Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 666,
 "title": "",
 "cost": "",
 "color": "",
 "type": "zensiert",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 667,
 "title": "Der Weg durchs Nichts",
 "cost": "0",
 "color": "black",
 "type": "Spontanzauber, Schicksalserfüllung",
 "body": "Opfere alle Bleibekarten außer Himmelskörper und Standardländer, wenn Du weniger als einen Lebenspunkt hast: Ziehe 3 Karten.<br>_1_, Mische diese Karte in Deine Bibliothek: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "<p style='text-align: center;'><br><br>.<br>. . .<br>. &nbsp;&nbsp; . &nbsp; . &nbsp; . &nbsp;&nbsp; .<br>.  .  .<br>.<br><br><br><i>„Über uns,<br> ein heller Stern in der Nacht.“</i></p>",
 "date": 0
},

{
 "card_id": 730,
 "title": "Teufelsgeißel",
 "cost": "1",
 "color": "artifact",
 "type": "Verzauberung, Verdammnis",
 "body": "Hat die Farbe des Schicksals des Magiers. Kann nur mit Mondmana beschworen werden.<br>Lebensspendende Effekte von Bleibekarten haben keine Wirkung mehr.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "<br><br><i>„Die Wahrheit kann nicht ermordet werden.“</i>",
 "date": 0
},

{
 "card_id": 733,
 "title": "Merkur",
 "cost": "",
 "color": "artifact",
 "type": "Himmelskörper, unzerstörbar, verboten",
 "body": "Merkur ist einmalig in der Welt. Das Recht den Effekt des Merkur zu nutzen geht reihum.<br>->,_2_: Nehme eine Karte vom Merkur. Lege eine Karte verdeckt auf Merkur.",
 "strength": "",
 "extra": "Vielfach Sphären durchdringend, himmlisches Verkündend.",
 "rule_title": "(δ)",
 "rule": "(δ&#8324;&#8322;&#8321;)",
 "date": 0
},

{
 "card_id": 735,
 "title": "Ewige Jagdgründe",
 "cost": "0",
 "color": "green",
 "type": "Geheimnis, Legende",
 "body": "Du darfst ein Geheimnis in der Bibliothek haben. Nachwirkung≔ Ziehe eine Karte. Offenbarung: Gebe Deinen Komplizen je ein Bleibekarte, die kein Himmelskörper ist. _G__G__G__G__G_: Tausche ein Geheimnis in der Welt mit diesem von Deiner Hand.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "(δ&#8324;&#8322;&#8321;)",
 "date": 0
},

{
 "card_id": 741,
 "title": "Transzendenz",
 "cost": "0",
 "color": "light_white",
 "type": "Traumzauber, Ausschließlichkeit",
 "body": "Gilt als lichtweiße Karte. Tausche Plätze mit einem Magier, wenn jener einverstanden ist. Ziehe eine Karte. Du darfst Transzendenz zweimal in Deiner Bibliothek haben.",
 "strength": "",
 "extra": "741 ... mach eins zu zwei und zwei zu eins.",
 "rule_title": "(δ)",
 "rule": "(δ&#8324;&#8322;&#8321;)",
 "date": 0
},

{
 "card_id": 747,
 "title": "Höllenbindung",
 "cost": "SB2",
 "color": "black",
 "type": "Unterbrechungszauber, Legende",
 "body": "Alternative Beschwörungskosten≔ Wenn Du 13 oder weniger Lebenspunkte hast, zahle 2 Lebenspunkte.<br>Kontert einen Zauberspruch.",
 "strength": "",
 "extra": "Da hat wohl jemand die Rechnung ohne den Wirt gemacht...",
 "rule_title": "(δ)",
 "rule": "(δ&#8324;&#8322;&#8321;)",
 "date": 0
},

{
 "card_id": 748,
 "title": "Buddhastatue",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, unzerstörbar",
 "body": "->, _1_: Entferne eine zerstörte oder vernichtete Kreatur ganz aus der Welt.",
 "strength": "",
 "extra": "... ॐ ...",
 "rule_title": "Die goldene Mitte",
 "rule": "Das schönere der beiden Geschlechter kann nicht auch das bescheidenere sein.<br><br><i>„Erst schlachtet man das Lamm, dann isst Manselbst es auf.“</i>",
 "date": 0
},

{
 "card_id": 750,
 "title": "Tarnumhang",
 "cost": "Ω1",
 "color": "white",
 "type": "Kreaturenverzauberung, Legende",
 "body": "Die Kreatur erhält Schutz vor der Farbe die zu Ω passt.",
 "strength": "",
 "extra": "Geradezu verblüffend!",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 751,
 "title": "Bogenschlußstein",
 "cost": "0",
 "color": "artifact",
 "type": "Geheimnis, Legende",
 "body": "Du darfst ein Geheimnis in der Bibliothek haben. Nachwirkung≔ Ziehe eine Karte. Offenbarung: Deine Komplizen erhalten ein Hirschkäferamulett. _5_: Tausche ein Geheimnis in der Welt mit diesem von Deiner Hand.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ)",
 "rule": "",
 "date": 0
},

{
 "card_id": 752,
 "title": "",
 "cost": "",
 "color": "light_white",
 "type": "Regel",
 "body": "Eine unzerstörbare Kreatur kennt ihren Schöpfer.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ840)",
 "rule": "",
 "date": 0
},

{
 "card_id": 755,
 "title": "Fahlgrüner Reiter",
 "cost": "6",
 "color": "artifact",
 "type": "Kreatur, Legende",
 "body": "Der fahlgrüne Reiter ist von undefinierbarer Farbe.<br>Nachwirkung≔ jeder Magier opfert eine Kreatur - jeder Magier wählt aus der Unterwelt seines nächsten Gegners eine Karte, die in die Hölle kommt.",
 "strength": "2/3",
 "extra": "...",
 "rule_title": "(δ1)",
 "rule": "(δ841)",
 "date": 0
},

{
 "card_id": 766,
 "title": "",
 "cost": "0",
 "color": "light_black",
 "type": "Trugbild, Traumzauber, Legende",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "766",
 "rule": "Diese Karte ist Regel 90 und Regel 752.",
 "date": 0
},

{
 "card_id": 788,
 "title": "Ursachenkopplung",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Aller Schaden, den ein Zauberspruch auf ein Opfer verusacht, wird auf den Beschwörer jenes Zauberspruches zurückgeworfen. Zahle _1_ um desgleichen für jedes weitere Opfer jenes Zauberspruches zu erwirken.",
 "strength": "",
 "extra": "Es sei das Prinzip von Ursache und Wirkung.",
 "rule_title": "zensiert",
 "rule": "",
 "date": 0
},

{
 "card_id": 783,
 "title": "Das Lamm",
 "cost": "G",
 "color": "green",
 "type": "Kreatur",
 "body": "Geschenk.<br>->, Opfere das Lamm, _G_:<br>Wähle träumend einen zensierten Zauber und beschwöre ihn.",
 "strength": "1/1",
 "extra": "... oder alle!",
 "rule_title": "zensiert",
 "rule": "&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;&#9608;",
 "taken": true,
 "date": 0
},


{
 "card_id": 779,
 "title": "Apokalypse",
 "cost": "1S",
 "color": "black",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kontert einen schwarzen Schnellzauber. Beschwöre die Apokalypse als Glückszauber: Entferne die Apokalypse aus der Welt.<br>_S__S__S__S_: Erinnern.<br>Darf nicht im Bibliothekskeller sein.",
 "strength": "",
 "extra": "",
 "rule_title": "zensiert",
 "rule": "<br><br><i>„Und da es das vierte Siegel auftat, hörte ich die Stimme des vierten Tiers sagen: Komm!“</i>",
 "taken": true,
 "date": 0
},

{
 "card_id": 791,
 "title": "Heiligenschein",
 "cost": "W2",
 "color": "white",
 "type": "Kreaturenverzauberung, Legende",
 "body": "_W__W_: Wiederbelebung.",
 "strength": "",
 "extra": "",
 "rule_title": "Weglassungsprinzip",
 "rule": "<br><br><i>„Jene, die vor sich selbst in Schande stehen, braucht man nicht mehr öffentlich bloßstellen, als es verlangt ist - von eben jenen.“</i>",
 "date": 0
},

{
 "card_id": 795,
 "title": "Karma",
 "cost": "B1",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Eine Zielkarte in der Welt oder Unterwelt oder Hand oder Bibliothek eines Magier, wenn Du wissen kannst welche es ist, oder ein Zielzauber erhält einen Farbwechsel zu einer einzigen Farbe Deiner Wahl. Ziehe eine Karte.",
 "strength": "",
 "extra": "Sonst versuche es noch einmal!",
 "rule_title": "(δ42)",
 "rule": "<br><br><i>„Zeig mir den, der nicht als Sklave geboren wurde.“</i>",
 "date": 0
},

{
 "card_id": 801,
 "title": "Reinkarnation",
 "cost": "0",
 "color": "white",
 "type": "Gewaltzauber, Schicksalserfüllung",
 "body": "Gilt als weiße Karte.<br>Beschwöre eine reine, reinweiße Kreatur aus Deiner Unterwelt; Falls jene Kreatur besonders niederträchtig ermordet wurde, erhälts Du einen Lebenspunkt.",
 "strength": "",
 "extra": "",
 "rule_title": "zensiert",
 "rule": "",
 "date": 0
},

{
 "card_id": 803,
 "title": "Ermorden",
 "cost": "SS3",
 "color": "black",
 "type": "Gewaltzauber, Ausschließlichkeit",
 "body": "Für eine Runde bist Du untsterblich; Tausche Plätze mit einem Magier für eine Runde.",
 "strength": "",
 "extra": "Nun spielen wir nach meinen Regeln.",
 "rule_title": "zensiert",
 "rule": "",
 "date": 0
},

{
 "card_id": 804,
 "title": "Deus Ex Machina",
 "cost": "G",
 "color": "green",
 "type": "Traumzauber, Legende",
 "body": "Ein Traumzauber wird an eine beliebige Stelle in die Vergangenheit dieser Begegnung verschoben, allerdings nur, wenn die nötigen Korrekturen des Spielverlaufs im angemessenen Rahmen bleiben.",
 "strength": "",
 "extra": "",
 "rule_title": "zensiert",
 "rule": "",
 "date": 0
},

{
 "card_id": 813,
 "title": "FeFiFaFu",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Erstelle 3 Kopien eines Unterbrechungszaubers und teile die insgesamt 4 Zaubersprüche gerecht auf, wobei der Ursprungszauber unverändert bleibt.",
 "strength": "",
 "extra": "",
 "rule_title": "Weisheit",
 "rule": "",
 "date": 0
},

{
 "card_id": 814,
 "title": "Syphisosgeschenk",
 "cost": "1S",
 "color": "black",
 "type": "Unterbrechungszauber",
 "body": "Bringe 3 Karten aus Unterwelten Deiner Wahl in die Hölle; Ziehe eine Karte.",
 "strength": "",
 "extra": "Wie wäre es mit einer Befreiung?",
 "rule_title": "zensiert",
 "rule": "",
 "date": 0
},

{
 "card_id": 818,
 "title": "",
 "cost": "",
 "color": "",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Wir stellen also fest",
 "rule": "<p style='text-align: center;'>Im Genre:<br> <b>rollenspielbetontes Zauberkartenspiel</b> <br>kann es nur eine Alleinherrscherin geben:<br><br><b>INCANTATA</b></p>",
 "date": 0
},

{
 "card_id": 823,
 "title": "",
 "cost": "0",
 "color": "light_grey",
 "type": "Traumzauber, Legende",
 "body": "Teil einer Siebenkaskade. Beende die Begegnung. Freiheit ist von jeder Farbe als auch farblos.",
 "strength": "",
 "extra": "",
 "rule_title": "zensiert",
 "rule": "(δ841)",
 "date": 0
},

{
 "card_id": 841,
 "title": "Teezeremonie",
 "cost": "0",
 "color": "light_white",
 "type": "Unterbrechungszauber, Legende",
 "body": "Gilt als lichtweiße Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "(δ421)",
 "rule": "<br><br><i>„Wo der Anfang ist, dort wird auch das Ende sein.“</i>",
 "taken": true,
 "date": 0
},

{
 "card_id": 842,
 "title": "Visitenkarte",
 "cost": "",
 "color": "blank",
 "type": "",
 "body": "Ich bin nicht Incantato.<br><br> „Io sono incantato!“",
 "strength": "",
 "extra": "",
 "rule_title": "Visitenkarte",
 "rule": "Ich bin nicht Incantata.<br><br> „Io sono incantata!“",
 "date": 0
},

{
 "card_id": 843,
 "title": "Rückseite standard",
 "cost": "",
 "color": "rueckseite",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "taken": true,
 "date": 0
},

{
 "card_id": 844,
 "title": "Rückseite RZG",
 "cost": "",
 "color": "rueckseite_rz",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "taken": true,
 "date": 0
},

{
 "card_id": 845,
 "title": "Rückseite EK",
 "cost": "",
 "color": "rueckseite_ek",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "taken": true,
 "date": 0
},

{
 "card_id": 847,
 "title": "Rückseite Firmament",
 "cost": "",
 "color": "rueckseite_fm",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "taken": true,
 "date": 0
},

{
 "card_id": 819,
 "title": "Z",
 "cost": "",
 "color": "rueckseite_819",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "taken": true,
 "zite": "1B5tPzKWjvkBd7hEgnn7Yryb5FnJhEZKrq",
 "date": 0
},

{
 "card_id": 2000,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "&nbsp;INCANTATA",
 "rule": "<b>... 7... 4... 2... Zauberei!</b><br><br><!--<b>Geheimnis der Teezeremonie<br>SHA512-Hash</b>:<br>de06600618ef749e027bdea dca9d0a9c7b7008239abb0 7ffa0bca836f01b0a63432 c55d716152bef46471d923 2b4278d18678b394439e3b 451082cb36360f398-->",
 "date": 0
},

{
 "card_id": 2001,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Helfen & Lizenz",
 "rule": "<br><b>Helfen</b><br>∘ Hoste diese Seite mit im 0net.<br>∘ Schenke Deinem Freund einen <a href='einzel.html?ids=52'>Goldkarpfen</a>.<br>∘ <u>Verbringe ein Stunde in heiterer Gelassenheit mit Deinen Freunden!</u><br>∘ Tausche und verschenke Kryptokarten.<br><br><b>Lizenz</b>: Grundsätzlich sind alle Kartenbilder und Manasymbole <b>CC-BY-SA 4.0 lizensiert</b>. Abweichungen davon sind in der Datei bilder-lizenz.txt zu finden.<br>Aller Programmcode (html/js <u><b>und</b></u> Kartentexte) ist GPL3 lizensiert, siehe Datei incantata-lizenz.txt<br>",
 "date": 0
},

{
 "card_id": 2002,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 2003,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Sprachklone & Klone",
 "rule": "∘ Natürlich kannst du jederzeit INCANTATA klonen (CC-SA) und verändern.<br>∘ Diese Seite ist sehr einfach zu klonen, alle Texte, die übersetzt werden müssen sind in der data.json .<br>∘ Sprachklone müssen hinsichtlich der HTML-Formatierung identisch sein - es darf kein Script-Tag in der Datenbank enthalten sein.<br>∘ Sprachklone dürfen sich nur in den in data-default genannten Dateien (und den Zeronet-Hilfsdateien) unterscheiden und auch die nur gemäß ihrer Bestimmung. Das heißt das alle Dateien der content.json (welche nicht auch in data-default genannt sind) müssen identisch sein mit der ICT-DE-Version. Diese Identität sollte durch den Sprachklonbetreiber (durch „Upgrade Code“ auf der Zero-Hello-Seite) zeitnah umgesetzt werden.<br>∘ Sprachklone dürfen keine weiteren Dateien enthalten, also nur die, die auch in der content.json der ICT-DE-Seite genannt sind oder Zeronet-Hilfsdateien sind.<br>∘ Der Titel eines Sprachklons muß das Format „INCANTATA [ISO-Sprachkürzel]“ haben.<br>∘ Für jede Sprache wird je der Sprachklon verknüpft, der in Text und Formatierung dem Original am nächsten ist und regelmäßig gepflegt wird.<br>∘ Sprachklone werden bevorzugt in der Kopfzeile von INCANTATA angezeigt, auch welche von Sprachen, die noch nicht angezeigt sind.<br><br><i>„Merke: Nur ein regelgerechter Sprachklon erzielt die erhoffte Wirkung.“</i>",
 "date": 0
},

{
 "card_id": 2004,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Fragen und Antworten",
 "rule": "F: Was ist diese Zite?<br>A: Diese Seite soll die INCANTATA-Kartendatenbank sichtbar darstellen und Druckansichten bereitstellen, um Testkarten ausdrucken zu können; und das alles mit <u>möglichst einfachen technischen Mitteln</u>.<br><br>F: Was heißt INCANTATA?<br>A: INCANTATA ist italienisch und heißt soviel wie verzaubert. Sowohl im magischen Sinne, als auch im Sinne von „ich bin entzückt!“<br><br>F: Was ist die „gioiello d’arco“?<br>A: Die Karten 1-91 werden als <b>gioiello d’arco</b> bezeichnet.<br><br>F: Freier Programmquelltext?<br>A: Alle Programmwerkzeuge, die für INCANTATA benutzt werden sind frei im Sinne des GNU-Projektes und/oder im Sinne der FSF/FSFE.",
 "date": 0
},

{
 "card_id": 2005,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 2006,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckansichten",
 "rule": "(Chromium: 114%, borderless DIN-A4, borders minimum)<br>(Firefox/TorBrowser: 76%-77%, alle margins=0 (about:config->margin), Kopf/Fußzeile aus)",
 "date": 0
},

{
 "card_id": 2007,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Rückseiten",
 "rule": "<a href='druck.html?ids=843,843,843,843,843,843,843,843,843'>Standardkarten</a><br><a href='druck.html?ids=847'>Mantra der Reinheit</a><br><a href='druck.html?ids=845,845,845,845,845,845,845,845,845'>Himmelskörper</a><br><a href='druck.html?ids=844,844,844,844,844,844,844,844,844'>Raumzeitgefüge</a><br></a><br><br>Dies ist ein Standardrückseitensatz:<br><a href='../13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz/druck.html?ids=847,845,845,845,845,845,845,845,843'>1X</a>&nbsp;&nbsp;&nbsp; <a href='../13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz/druck.html?ids=844,844,844,844,844,844'>1X</a> &nbsp;&nbsp;&nbsp; <a href='../13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz/druck.html?ids=843,843,843,843,843,843,843,843,843'>5X</a><br><br>",
 "date": 0
},

{
 "card_id": 2008,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 2009,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 2010,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 2011,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 2012,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "Dieses Incantatazauberbuch wurde aufgeschrieben von Arkandor, ganz gemäß den Vorstellungen des Incantato.",
 "date": 0
},

{
 "card_id": 2013,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Neuigkeiten",
 "rule": "<a href='data/134.html'>134.html</a><br>",
 "date": 0
},

{
 "card_id": 2014,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Gipfelturnier",
 "rule": "Für das nächste Gipfelturnier gelten folgende Tabukarten:<br><p style='text-align=center;'><a href='druck.html?ids=193,428' target='top'>ICT-193 Erträumte Einhörner<br>ICT-428 Schwalbe</a></p><br>Ort des nächsten DE-Turnieres wird gemäß Bundeslandeignung festgelegt.",
 "date": 0
},

{
 "card_id": 2015,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckversionen",
 "rule": "Da alles auf dieser Seite CC-Lizensiert ist (ohne kommerzielle Einschränkung), darf jeder eine Druckversion erstellen.<br><br>Offiziell für Turniere zugelassen Druckserien:<br><br> <a href='druck.html?ids=1'>Alpha 27791</a> (Die Alpha Druckserie besteht nur aus dem Mantra der Reinheit)<br><br> <a href='druck.html?ids=1,8,13,35,42,51,53,54,841'>Alpha-II 27792</a> (Die Alpha-II Druckserie besteht aus 9 Karten)",
 "date": 0
},

{
 "card_id": 2016,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Bitte Beachten!",
 "rule": "Das Prägen von Kryptokarten mit Byteball ist zwar beendet aber jene Token sollten gut aufgehoben werden.",
 "date": 0
},

{
 "card_id": 2017,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Symbole",
 "rule": "<br><img src='img/icon_crypto.gif'> Diese Karte ist als Obyte-Kryptokarte erhältlich.<br><br>Manasymbole</b>:<br><img class='mana_img' valign='middle' class='mana_img' src='img/mana_white.gif'></img>: weiß<br><img class='mana_img' valign='middle' class='mana_img' src='img/mana_blue.gif'></img>: blau<br><img class='mana_img' valign='middle' class='mana_img' src='img/mana_red.gif'></img>: rot<br><img class='mana_img' valign='middle' class='mana_img' src='img/mana_green.gif'></img>: grün<br><img class='mana_img' valign='middle' class='mana_img' src='img/mana_black.gif'></img>: schwarz<br><br>Nachtrag: Wirkliche INCANTATA-Karten erzielen eine Wirkung in der Wirklichkeit, ebenso wie Kryptokarten, jene jedoch in der Krypto-Wirklichkeit; Drachengemmen (Wirklichkeitskryptokarten) dann in beiden Sphären",
 "date": 0
},

{
 "card_id": 2018,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Sig-Hash",
 "rule": "27791: Teezeremonie<br>27792: E6mtpFMh5k5C5MyoisUurKXuoG",
 "date": 0
},

{
 "card_id": 2019,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Kopfzeile",
 "rule": "<a href='../1KYeh8RtfQViD9k7J2QeJMLgT9vKrANrX9/' class='headlink' title='ICT-Bibliotheken'><span class='headelement'>Ⅲ</span></a><a href='../1JeCDXuDG7VLJbimZQ6nWmNbeij2UV6P92/' title='ICT-Drachengemmen' class='headlink'><span class='headelement'>◆</span></a>",
 "date": 0
},

{
 "card_id": 2020,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Wichtigste Regeln",
 "rule": "Folgende Regeln sollten reichen um schnell mit INCANTATA anzufangen, falls man ein bekanntes Kartenspiel bereits kann:<br><a href='druck_r.html?ids=811'>Die Kardinalregel</a><br><a href='druck_r.html?ids=841,840,838,835,834,828,827,806,800'>Blitzregeln I</a><br><a href='druck_r.html?ids=747,734,733,786'>Blitzregeln II</a>",
 "date": 0
},

{
 "card_id": 27790,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 27791,
 "title": "Incantato",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "Ein Geheimnis, von dem alle hoffen, und viele wissen wollen, daß es existiert; aber nur wenige wollen es wissen und nur einer darf und kann es wissen.",
 "strength": "",
 "extra": "",
 "rule_title": "Incantata",
 "rule": "Ein Geheimnis, von dem alle hoffen, und viele wissen wollen, daß es existiert; aber nur wenige wollen es wissen und nur eine darf und kann es wissen.",
 "date": 0
},

{
 "card_id": 27792,
 "title": "Freude",
 "cost": "",
 "color": "none",
 "type": "Belohnung",
 "body": "... schöner Götterfunken.",
 "strength": "",
 "extra": "Und nun freuet euch!",
 "rule_title": "",
 "rule": "",
 "date": 0
}

]}
