{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Identidade Revelada – entraves na busca por informação pública no Brasil",
			"body": "Publicação que narra 16 casos de pessoas que requisitaram informações junto a órgãos públicos e tiveram problemas por terem suas identidades expostas como autores dos pedidos.\n\n- https://web.archive.org/web/20181221031108/http://artigo19.org/wp-content/blogs.dir/24/files/2018/05/Identidade-Revelada-%E2%80%93-entraves-na-busca-por-informa%C3%A7%C3%A3o-p%C3%BAblica-no-Brasil.pdf",
			"added": 1546331657
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_1PZFAVu7Bb4XniQuw2hMjZmPwFcPu8nkqB": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": [
			{
				"comment_id": 1,
				"body": "#Geometria Plana em nível IME/ITA\n- https://www.youtube.com/playlist?list=PLN8OTSLpUpRy1bGiTxpqJw0hoYg9azMDv",
				"added": 1546301495
			},
			{
				"comment_id": 2,
				"body": "#Bizus IME/ITA\n- https://www.youtube.com/results?search_query=super+exatas+bizus+ime+ita",
				"added": 1546301531
			},
			{
				"comment_id": 3,
				"body": "#CURSO ITA MATEMÁTICA - Aeronáutica/FAB\n- https://www.youtube.com/playlist?list=PL6OOVP7bVa4_77efjStxqVZsRXqTPlRAW",
				"added": 1546301569
			},
			{
				"comment_id": 4,
				"body": "#Curso de Matemática do IME - Exército\n- https://www.youtube.com/playlist?list=PL6OOVP7bVa48buaDOkiUyhXsOHwgDdZ_K",
				"added": 1546301606
			},
			{
				"comment_id": 5,
				"body": "#Percurso Educacional IME/ITA\n- https://www.youtube.com/results?search_query=percurso+educacional+ita+ime",
				"added": 1546301721
			},
			{
				"comment_id": 6,
				"body": "#Matemática ITA/IME: https://www.youtube.com/playlist?list=PLtCEhbE6vS-TvGe7j3wGDQiOetA1DMXWf\n#Física ITA/IME: https://www.youtube.com/playlist?list=PLtCEhbE6vS-QCLajkbB4vGIBYjkClDdcq\n#Química ITA/IME: https://www.youtube.com/playlist?list=PLtCEhbE6vS-SwGAARqaxw749M688EtjpN",
				"added": 1546301924
			},
			{
				"comment_id": 7,
				"body": "#Química - IME/ITA\n- https://www.youtube.com/channel/UCSldlnRCAPVKxXbpmIBC2SA",
				"added": 1546302103
			},
			{
				"comment_id": 11,
				"body": "#Recomendações de livros\n\n#Física\n- Sears – Fonte teórica. Ajuda a compreender os conceitos físicos sem simplificações do ensino médio.\n- Tópicos de Física (3 volumes) – Exercícios para ficar familiar com novos assuntos.\n- Renato Brito (2 volumes) – Tudo o que você vai precisar de mecânica para ITA e IME. Tem teoria e exercícios com soluções.\n- Opcional: Arun Kumar, DC Gupta (indianos) – Bons para aprofundar exercícios. As questões e a teoria são muito no estilo ITA e IME. Muitos exercícios têm soluções.\n- Evitar: Fundamentos da Física da Editora Moderna – Exercícios repetitivos e fracos. Teoria simplificada.\n- Evitar: Moysés, Irodov, Saraeva – Apesar de cair várias questões deles, fazer o livro é alopração desnecessária. Os professores já selecionaram questões relevantes e colocaram nas apostilas.\n#Matemática\n- Matemática Ciência e Aplicações do Iezzi (3 volumes) – Consultar teoria resumida e fazer os exercícios para ficar familiar com assuntos novos.\n- Fundamentos da Matemática Elementar – Aprofundar na teoria em tópicos que forem precisos. (Por exemplo, matrizes e introdução a cálculo)\n- Números Complexos e Polinômios do Caio Guimarães – Tudo o que você vai precisar de complexos e polinômios para ITA e IME. Tem teoria e exercícios com soluções.\n#Química\n- Feltre (3 volumes) – Consultar teoria em tópicos que você estiver precisando.\n- Reações Orgânicas do Pelisson – Excelente teoria para reações orgânicas. Tem um resumo de reações orgânicas no final das reações que vale ouro.\n- Físico-Química do Nelson Santos – Bom livro de questões com soluções em todos os assuntos de físico-química.\n- Site Rumo ao ITA – Materiais sobre assuntos que é preciso decorar, como cores de compostos e polímeros.\n- Evitar: Livros de universidade como Atkins e Brady – Eles não são suficientemente direcionados para ITA ou IME.\n#Mentalidade\n- A Arte de Aprender por Josh Waitzkin – Escrito por um campeão nacional em Xadrez e campeão mundial em Tai Chi Chuan, esse livro foi meu primeiro contato com uma mentalidade atlética competitiva. Deixou uma forte impressão em mim desde mais novo.\n- Desafios à Força de Vontade por Kelly McGonigal, PhD – Baseado em pesquisas científicas e com senso de humor, explica a natureza humana que leva a fazer ou não fazer as coisas. Uma ótima leitura para evitar armadilhas de produtividade.\n- O Poder do Hábito por Charles Duhigg – Também baseado em pesquisas científicas e com um caráter narrativo, explica a ciência da formação de hábitos e como tomar proveito dela para formar os hábitos que desejamos.",
				"added": 1546318351
			},
			{
				"comment_id": 12,
				"body": "#Como a meditação pode reformular nossos cérebros: Sara Lazar na TEDxCambridge 2011\n- https://youtu.be/m8rRzTtP7Tc",
				"added": 1546318571
			},
			{
				"comment_id": 13,
				"body": ">álgebra\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVSHJKdjg0NDBhUjA\n\n>aritmética\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVZnBKelYyRFYwSHM\n\n>bizus\n\nhttps://drive.google.com/open?id=0B2EQE0cvo_j9ZWM5Mjc3U3ZpYm8\n\n>cálculo\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVY1lTMkxDX0JNSnc\n\n>física\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVa3Q2YVpDeXlYbUU\n\n>geometria\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVRi0zT095SU1PNXc\n\n>português\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVY09qeVNscWNXblE\n\n>inglês\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVOWFSQzMyUjN3Ymc\n\n>química\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVTkJWaHdvOERScHc\n\n>história\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVeU5BalJiY3JlQk0\n\n>POTI _ Polos Olímpicos de Treinamento Intensivo\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVWTlsX0VrNmZJTHc\n\n>Turma Especial CN/EPCAr\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVSG02azJUazFEVDg\n\n>Simulados/Folhinhas\n\nhttps://drive.google.com/open?id=0B8gnfxVjcjVVcHM3OE1BNTRpTk0\n\n>challenge books:\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVLTJMUW5KdURMX2c\n\n>técnicas de resolução e demonstração:\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVdHFWWjVwNmNfdzg\n\n>Coleção Fundamentos da Matemática Elementar:\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVOXlYU2ROTDZPb0U\n\n>Peruanos de matemática (ime/ita/obm):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVZTJ1SjNxQWkzTmc\n\n>Putnam Questions\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVd0NHRlBmQ3ExaG8\n\n>Russos \n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVUk5zMkFxQWVWU3c\n\n>Problem solving skills\n https://drive.google.com/folderview?id=0B8gnfxVjcjVVS05LSld0ZXFZTTA\n\n> Questões ITA separadas por matéria\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVY1RGMDBaZ0NpY00",
				"added": 1546319862
			},
			{
				"comment_id": 15,
				"body": "#Instituto Tecnológico de Aeronáutica\n\n- https://drive.google.com/folderview?id=15hZmoseAnoo-aSXpriuCN5kPq0_nLUbA",
				"added": 1546321579
			},
			{
				"comment_id": 17,
				"body": "#PaperX IME/ITA - Questões e Simulados\nPrepare-se para as provas do IME, ITA e demais vestibulares através de questões de anos anteriores e simulados com questões inéditas.\n- https://imeita.paperx.com.br/",
				"added": 1546331201
			},
			{
				"comment_id": 19,
				"body": "#Como montar o seu horário de estudos para passar no ITA\nO ideal é adequar o exemplo apresentado neste vídeo à sua realidade.\n- https://youtu.be/fx_O2Y3KpTk",
				"added": 1546332973
			},
			{
				"comment_id": 20,
				"body": "#Como passar em ENGENHARIA no ITA - Papo de Vestibular [Completo] HD\n- https://youtu.be/dzVggv0rPw0",
				"added": 1546333213
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 9,
				"body": "#Tenrou: Sirius The Jaeger\nSirius The Jeager se passa na Capital Imperial em 1930. Um grupo de pessoas carregando caixas de instrumentos musicais apareceram em Tóquio. Eles são chamados de Jaegers, aqueles que vieram caçar vampiros. Um jovem chamado Yuliy estava entre eles com uma impressionante serenidade e aura incomum. Sendo um lobisomem atrás de vingança pela sua aldeia destruída por vampiros, Yuliy e os Jaegers se envolvem em uma batalha mortal pelo misterioso arco sagrado conhecido como o Arco do Sirius.\n\n\n- https://www.superanimes.site/anime/tenrou-sirius-the-jaeger",
				"added": 1546313149
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 10,
				"body": "Colossenses 3:14-15 – “Acima de tudo, porém, revistam-se do amor, que é o elo perfeito. Que a paz de Cristo seja o juiz em seu coração, visto que vocês foram chamados para viver em paz, como membros de um só corpo. E sejam agradecidos”.\n\nHebreus 12:10-11 – “Nossos pais nos disciplinavam por curto período, segundo lhes parecia melhor; mas Deus nos disciplina para o nosso bem, para que participemos da sua santidade. Nenhuma disciplina parece ser motivo de alegria no momento, mas sim de tristeza. Mais tarde, porém, produz fruto de justiça e paz para aqueles que por ela foram exercitados”.\n\nSalmos 37:7 – “Descanse no Senhor e aguarde por ele com paciência; não se aborreça com o sucesso dos outros nem com aqueles que maquinam o mal”.\n\nEclesiastes 3:11 – “Ele fez tudo apropriado ao seu tempo. Também pôs no coração do homem o anseio pela eternidade; mesmo assim ele não consegue compreender inteiramente o que Deus fez”.\n\nSalmos 34:8 – “Provem e vejam como o Senhor é bom. Como é feliz o homem que nele se refugia”!\n\nTiago 4:13-17 – “Ouçam agora, vocês que dizem: “Hoje ou amanhã iremos para esta ou aquela cidade, passaremos um ano ali, faremos negócios e ganharemos dinheiro”. Vocês nem sabem o que acontecerá amanhã! Que é a sua vida? Vocês são como a neblina que aparece por um pouco de tempo e depois se dissipa. Em vez disso, deveriam dizer: “Se o Senhor quiser, viveremos e faremos isto ou aquilo”. Agora, porém, vocês se vangloriam das suas pretensões. Toda vanglória como essa é maligna. Portanto, pensem nisto: Quem sabe que deve fazer o bem e não o faz comete pecado”.\n\n1 Pedro 1:3 – “Bendito seja o Deus e Pai de nosso Senhor Jesus Cristo! Conforme a sua grande misericórdia, ele nos regenerou para uma esperança viva, por meio da ressurreição de Jesus Cristo dentre os mortos”.\n\nSalmos 51:10-11 – “Cria em mim um coração puro, ó Deus,\ne renova dentro de mim um espírito estável. Não me expulses da tua presença nem tires de mim o teu Santo Espírito”.\n\nJeremias 29:11 – “Porque sou eu que conheço os planos que tenho para vocês’, diz o Senhor, ‘planos de fazê-los prosperar e não de causar dano, planos de dar a vocês esperança e um futuro”.\n\nFilipenses 3:12-15 – “Não que eu já tenha obtido tudo isso ou tenha sido aperfeiçoado, mas prossigo para alcançá-lo, pois para isso também fui alcançado por Cristo Jesus. Irmãos, não penso que eu mesmo já o tenha alcançado, mas uma coisa faço: esquecendo-me das coisas que ficaram para trás e avançando para as que estão adiante, prossigo para o alvo, a fim de ganhar o prêmio do chamado celestial de Deus em Cristo Jesus. Todos nós que alcançamos a maturidade devemos ver as coisas dessa forma, e, se em algum aspecto, vocês pensam de modo diferente, isso também Deus esclarecerá”.\n\n2 Coríntios 5:17 – “Portanto, se alguém está em Cristo, é nova criação. As coisas antigas já passaram; eis que surgiram coisas novas”!\n\nIsaías 40:31 – “mas aqueles que esperam no Senhor renovam as suas forças. Voam alto como águias; correm e não ficam exaustos, andam e não se cansam”.\n\nEzequiel 36:25-27 – “Aspergirei água pura sobre vocês e ficarão puros; eu os purificarei de todas as suas impurezas e de todos os seus ídolos. Darei a vocês um coração novo e porei um espírito novo em vocês; tirarei de vocês o coração de pedra e, em troca, darei um coração de carne. Porei o meu Espírito em vocês e os levarei a agir segundo os meus decretos e a obedecer fielmente às minhas leis”.\n\nFilipenses 3:13-14 – “Irmãos, não penso que eu mesmo já o tenha alcançado, mas uma coisa faço: esquecendo-me das coisas que ficaram para trás e avançando para as que estão adiante, prossigo para o alvo, a fim de ganhar o prêmio do chamado celestial de Deus em Cristo Jesus”.",
				"added": 1546316008
			},
			{
				"comment_id": 16,
				"body": "Ó SENHOR, Deus do céu, tu és grande, e nós te tememos! Tu és fiel e guardas a tua aliança com aqueles que te amam e obedecem aos teus mandamentos. Olha para mim, ó Deus, e ouve as orações que faço dia e noite em favor dos teus servos, o povo de Israel. Eu confesso que nós, o povo de Israel, temos pecado. Os meus antepassados e eu temos pecado. Com os nossos atos, temos pecado contra ti e não temos obedecido aos teus mandamentos. Não temos obedecido às leis que nos deste por meio de Moisés, teu servo.\n- Neemias 1:5-7",
				"added": 1546325346
			}
		],
		"1_1PZFAVu7Bb4XniQuw2hMjZmPwFcPu8nkqB": [
			{
				"comment_id": 18,
				"body": "#Faça pedidos de acesso à informação sem revelar sua identidade.\n\nA Lei de Acesso à Informação (Lei 12.527/2011), também conhecida como LAI, regulamenta o direito constitucional do cidadão de acessar qualquer informação pública sem que seja necessário apresentar o motivo. Ela obriga órgãos públicos a considerar a publicidade como regra e o sigilo como exceção e vale para os três poderes da União, Estados, Distrito Federal e Municípios.\n\n- https://queremossaber.org.br/",
				"added": 1546331808
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 21,
				"body": "#Classe Mortal – Deadly Class\nAmbientada no final dos anos 1980, a história gira ao redor de um adolescente desiludido que é recrutado para um grupo de jovens assassinos. Enquanto equilibra o seu código moral com uma vida cada vez mais dura, suas incertezas podem se tornar fatais.\n- https://megaseriehd.com/series/classe-mortal/",
				"added": 1546333859
			},
			{
				"comment_id": 22,
				"body": "#Marvel’s Runaways – Os Fugitivos\n\nE se seu maior inimigo estiver mais perto do que você imagina? É esta a realidade de seis adolescentes nada parecidos, mas que enfrentam um inimigo em comum: os próprios pais. Agora, o nerd Alex (Rhenzy Feliz), a independente Nico (Lyrica Okano), a bela Karolina (Virginia Gardner), a durona Gert (Ariela Barer), o galã Chase (Gregg Sulkin) e a inocente Molly unem forças em uma missão cujo campo de batalha começa em suas casas.\n- https://megaseriehd.com/series/os-fugitivos/",
				"added": 1546333903
			}
		]
	},
	"comment_vote": {
		"15_1PZFAVu7Bb4XniQuw2hMjZmPwFcPu8nkqB": 1
	}
}