{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"category": "movies",
			"title": "VALKYRIE.DRIVE.BHIKKHUNI.FIXED",
			"torrent_imdb": "",
			"body": "Title: VALKYRIE DRIVE -BHIKKHUNI-\nGenre: Action\nDeveloper: Meteorise,HONEY∞PARADE GAMES\nPublisher: Marvelous\nRelease Date: 21 Jun, 2017\n\nAbout This Game\nA mysterious illness suddenly broke out in girls in their\nteens and twenties, enhancing them mentally and granting them the\nability to change their bodies into highly lethal weapons. The cause of\nthe illness was a virus, currently classified into two types: the\n\"A-Virus\" and \"V-Virus\".The world government enacted a law to\ncare for patients infected with the Virus. Five secret artificial\nislands were established to quarantine the infected patients. One such\nquarantine island: Bhikkhuni, the island famous for successfully\ncontrolling the \"V-Virus\". Girls who enroll in Bhikkhuni's school can\novercome the virus. And thus, it is a school with many hopeful\napplicants.Among them is a pair of sisters infected with the\n\"V-Virus\". The elder Rinka Kagurazaka, whose innocent grace hides power\nwithin. The younger Ranka Kagurazaka, whose outgoing energy belies her\nfrailty.They are still unaware that there is only one way to control the virus.And that is… for infected patients to battle each other.To battle amongst themselves.~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~FROM THE CREATORS OF SENRAN KAGURAIn VALKYRIE DRIVE -BHIKKHUNI-\na mysterious virus known as the A-Virus infects young women,\ntransforming them into weapons known as 'Extars' or those that control\nthem, 'Liberators'. However, the voluptuous Valkyries are infected with a\nunique strain, the VR-Virus, allowing them to take on either role at\nwill. Proving incredibly difficult to cure, they are sent for quarantine\nto the sun-soaked island of Bhikkhuni where a treatment is put into\nplace: the Valkyries engage in combat against one another to strengthen\nboth mind and body and allow them greater control of the Virus. Who runs\nthe island? What is the secret of the Virus? Will you choose Order or Chaos? This and more will be answered throughout your time with VALKYRIE DRIVE -BHIKKHUNI-.Fully remastered in 1080p, 60FPS with native support for even higher resolutions!Choose between 7 unique playable characters to learn and master, each with their own playstyle!Battle your way through 24 Story Missions and crank up the difficulty or change your character for even more replayability!Print\nthe underwear of your wildest and sexiest dreams by earning Bhikkhuni\nPoints through combat prowess to spend on Echigoya’s revolutionary\nLingerie Printer! Engage in fast-paced arena based online multiplayer with up to four players!Full-featured dressing room for deep customization of all playable characters — from hair to accessories, clothing and more!Support\nfor both Steam cloud saving, achievements, and exclusive trading cards,\nplus backgrounds, emoticons and badges to unlock!\n\nSystem Requirements\nMinimum:OS: Windows VistaProcessor: 1.8 GHz or equivalentMemory: 1 GB RAMGraphics: 512 MB VRAM or aboveStorage: 8 GB available space\nRecommended:OS: Windows 8/8.1/10Processor: Intel Core2 Duo E4500 | AMD Athlon 64 X2 4200+Memory: 2 GB RAMGraphics: GeForce 9500 GT (1 GB) | Radeon HD 4650 (1 GB)Storage: 8 GB available space",
			"magnet": "magnet:?xt=urn:btih:35FCBACF34C90FF80BDBF8BCB0697C6D78AA1D57&dn=VALKYRIE+DRIVE+-BHIKKHUNI-+%28FIXED%29&tr=udp%3A%2F%2Ftracker.opentrackr.org%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969%2Fannounce&tr=udp%3A%2F%2Fp4p.arenabg.ch%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.aletorrenty.pl%3A2710%2Fannounce&tr=udp%3A%2F%2Feddie4.nl%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.ilibr.org%3A80%2Fannounce&tr=udp%3A%2F%2Ftracker.ilibr.org%3A6969%2Fannounce&tr=udp%3A%2F%2Ftracker.zer0day.to%3A1337%2Fannounce&tr=udp%3A%2F%2Fp4p.arenabg.com%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337%2Fannounce&tr=udp%3A%2F%2F9.rarbg.me%3A2710%2Fannounce&tr=udp%3A%2F%2F9.rarbg.to%3A2710%2Fannounce&tr=udp%3A%2F%2Ftracker.zer0day.to%3A1337%2Fannounce&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce&tr=udp%3A%2F%2Fcoppersurfer.tk%3A6969%2Fannounce",
			"torrent_file": "data/users/1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse/VALKYRIE.DRIVE.BHIKKHUNI.FIXED.torrent",
			"added": 1529287245
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}