{
	"next_post_id": 70,
	"next_comment_id": 123,
	"next_follow_id": 28,
	"avatar": "jpg",
	"user_name": "Ansho Rei",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Developer, musician, freedom and privacy advocate.\n\n---\n## My Projects\n### Zites\n[Ansho Rei ZeroBlog](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ)\n\n[ZeroMarket](/1MARKtLD2e69w7qiHLNQz3rPDmWLHbb2ZE)\n\n[1+Gallery](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4) & [GalleryHubPlus](/14NFfVBBAFbNdqX4nyGjyBF1BRSz7jn2QP)\n\n[ZeroNet in the Eyes of the Media](http://localhost:43110/1NEwsvyrAoEWU64ZozwdfgEUQhwxiCrh1t/)\n\n[Svelte Router GitCenter](/1RouTcR3exTZ1MQxBQu9kTWUucW4GBZHL)\n\n### ZeRuNet\n[zerunet](/14mVJrvB1XqtC4Aq55BmXyf9yXUN9iWwd8) (\\\\zē·rün·net\\\\): ZeroNet written in the rust programming language using Actix for an actor-based design. In a very early stage of development.\n\n[zerucrypt](/1M4Wwi5x5RUN1QJoS6CcnQh515FMtRNg1d): Rust library that signs and verifies ZeroNet content.\n\n[ZeroNet Protocol](/1H3ct93gHL9BgtTnyrqJrkjn4NdociFFTn): Rust implementation of the ZeroNet Protocol, built with zerunet and the Rust implementation of a ZeroNet tracker in mind. Works, but coming updates will break you code.\n\n[ZeroNet Tracker](/1EtS177qrqicnGtGzktcMPEeL13FeLKJEG): A ZeroNet Tracker written in Rust, ~doesn't actually work yet~ ~partially~ works. Add my tracker: `zero://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion:15442` to your list.\n\n[UPnP-Brunch](/14zM5cN9f7LuqzG7mQm9DdBDYJWMub8vgt): UPnP-punch in Rust, barely works, will be revised when necessary for ZeruNet.\n\n### Utilities\n[Coma-D](/1NiZXNcqDCtpDh9c4t8dbQknLCHr4GWkPR): Console-based MangaDex Downloader\n\n[Rust0gal](/1KJquoRGNoC3sZWj56WEtSaLKg9hYupnX9): ZeroNet Gallery management utilities. Create manifest.json, generate thumbnails or update the file/thumbnail listing. Add, sign, and publish your galleries.\n\n### Games\n[ryneverse](/18H4VczfkHAwcgWUnyyz7fGhbqhQzny4r1): An idea for a world sandbox game written in rust.\n\n---\n\nI check ZeroMe on a near daily basis, and can always be found in Riot's ZeroNet chatroom in case of emergencies.\n\nProud owner of a Russian anime bot account (TM) working as a Chinese spy to infiltrate the USA occupation forces within the rightful territory of the European Union to sell their secrets to the Iranians so they can instruct Kim Jong Un on how to build a nuke to glass Mekka at the behest of Netanyahu.",
	"post": [
		{
			"post_id": 1,
			"date_added": 1564782914,
			"body": "[Ansho Rei | Bridging the Gap in P2P](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:2:Bridging+the+Gap+in+P2P)"
		},
		{
			"post_id": 1565298354,
			"body": "I've posted a new blog post: [Addressing some of the Rampant Disinformation spread about ZeroNet in these past couple of days](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:5)\nIt's hard to find time to write these between my job and my time spent tinkering with zite development, but considering how chaotic this week has been I felt there was a need to explain in detail how ZeroNet works for the newcomers who've decided to stay, and why they should ignore the idiots spouting lies on the clearnet.",
			"date_added": 1565298352
		},
		{
			"post_id": 1565564487,
			"body": "Over the weekend I've tried every single Svelte router module and none of them like ZeroNet very much. So I made my own. I'll be adding it to Git Center soon.",
			"date_added": 1565564484
		},
		{
			"post_id": 1565606183,
			"body": "Here's a link to my friendly [Svelte ZeroNet Router](/1RouTcR3exTZ1MQxBQu9kTWUucW4GBZHL) repository, I'll probably write a blog post about using Svelte and my router to build a simple Zite.",
			"date_added": 1565606179
		},
		{
			"post_id": 1565990717,
			"body": "Working on a DeviantArt + Pinterest inspired zite.\n\nThe zite will be built modularly and all of it will be released on Git Center so that it's easy for others to use any parts they want. I'm realizing that we'll need a tool like npm to automatically download the right packages from Git Center to build a project.",
			"date_added": 1565990712
		},
		{
			"post_id": 1567186638,
			"body": "New blog post: [ZeroNet, Bitcoin Cryptography and a consideration of different ICA/DNS systems within the network](http://localhost:43110/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:6) Some of you have probably read an earlier draft of the post (I accidentally published it a couple of times while I was still working on it, which means my foremost priority now is implementing a “Draft” functionality to ZeroBlog++), I recommend having a quick read through it again as I think it’s much better now!\nI’ll try to get my thoughts on how I believe ZeroNet could be improved with the help of a further developed Name.Yo down in another blog post soon, otherwise I will just drop it on ZeroTalk or ZeroMe.",
			"date_added": 1567186632
		},
		{
			"post_id": 1567884231,
			"body": "A couple of old articles and blogposts about ZeroNet were added to the [ZeroNet News Archive](http://localhost:43110/1NEwsvyrAoEWU64ZozwdfgEUQhwxiCrh1t) including one from just days after the original release of ZeroNet (12th of January 2015), an interview with Nofish by the owner of NODE, and another from the now defunct DeepDotWeb.",
			"date_added": 1567884224
		},
		{
			"post_id": 1569237600,
			"body": "New blog post (kinda, I wrote most of it two weeks ago) about a somewhat different topic from usual: [A Musical Interlude](http://127.0.0.1:43110/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:4:A+Musical+Interlude)",
			"date_added": 1569237592,
			"meta": "{\"img\":\"900,313,fffdddcccbbbeeeaaa,012232322043333355340233333324\"}"
		},
		{
			"post_id": 1569711934,
			"body": "",
			"date_added": 1569711925,
			"meta": "{\"img\":\"900,557,000110210310321632531743742422432221,00123411111112564121111478422012147732102921AA42102AB44AA4B1\"}"
		},
		{
			"post_id": 1573594668,
			"body": "Finally installed Yacy. The search results are far from optimal, but it works remarkably fast. One of the things that is quite exciting is that you often find obscure sites in the results where Google or Bing would only turn up results from the big ones (social media, wikipedia, etc.)",
			"date_added": 1573594658
		},
		{
			"post_id": 1574368257,
			"body": "```\n*************\n*           *\n*   VALVE   *\n* HALF-LIFE *\n*           *\n*************\n```\n\nhttps://youtu.be/O2W0N3uKXmo",
			"date_added": 1574368246
		},
		{
			"post_id": 1574584639,
			"body": "I've been writing ZeroNet from scratch and so far I've got the encryption and the wrapper working.",
			"date_added": 1574584627
		},
		{
			"post_id": 1574796048,
			"body": "Working on zerunet while listening to caryo's \"meanwhile\" album, served through zerunet :-)\n@caryoscelus: Thank you for a perfect API-less test site!",
			"date_added": 1574796035
		},
		{
			"post_id": 1575837098,
			"body": "Just implemented SSDP/UPnP in Rust for zerunet, and damn that stuff was counterintuitive. I was surprised there was no solid library for this yet.",
			"date_added": 1575837084
		},
		{
			"post_id": 1576426884,
			"body": "WEEK 50 STATUS UPDATE:\nI haven't worked much on zerunet this week, but here's a general overview of what I did do.\n\n- [G] I've tried IntelliJ as Rust IDE and I like it so far (compared to Atom and VSC). Only gripe I've had is that the shortcuts for creating new files/folders are annoying. For the foreseeable future I'll be sticking to it.\n- [G] [Jami](https://jami.net/) is pretty sweet for voice/videocalls. No need to fill in an e-mail or telephone number. Getting started takes two buttons, and a key exchange. It's reminds me a bit of retroshare, without the retro and without the share. Just calls and chats. And a lot easier to install for normies.\n- [R] I've watched a couple of talks about Rust, particularly about the new async/await and its history, the best one was probably [WithoutBoats talk YT](https://www.youtube.com/watch?v=skos4B5x7qE) (green threads vs os threads, the old await! macro, futures and of course the new async/await feature itself).\n- [R] Looked into [Amethyst](https://amethyst.rs/) as game engine, looks really neat. I've worked with [Piston](https://www.piston.rs/) before, but I'll likely try Amethyst instead when I do a next project. It doesn't work on my work laptop though because it requires Vulkan... I'd love to use it combined with the Dyon scripting language.\n- [ZN] Multiple instances of zerunet now find each other through local peer discovery... they don't actually do anything yet though. Major roadblock here has been that rmp_serde does not have flags to encode/decode enums to strings. There's a couple of related MRs open for it, but due to backwards compatibility not much is happening for now. In the end I gave up and just used match over strings instead of enums.\n- [ZN] I've been thinking about the design of a feature for ZeroNet that would allow merger-like zite interoperability using Linked Data. At some point I'll likely implement it for zerunet as an experimental feature, but interoperability with ZeroNet is a priority.",
			"date_added": 1576426869
		},
		{
			"post_id": 1576427908,
			"body": "I nearly forgot, I added badges to the zerunet Gitcenter repository!\nThey're dummy badges though, still need to set up CI for the whole thing.",
			"date_added": 1576427892,
			"meta": "{\"img\":\"900,158,ddeccecbdddf,01210333330133333333\"}"
		},
		{
			"post_id": 1576440794,
			"body": "Did some basketweaving not too long ago.",
			"date_added": 1576440777,
			"meta": "{\"img\":\"900,675,321310331552984773642753764000b95952874631a96842,001002345321620000202177882911A36BC31920C21DBAAA834290D67732E891667F114811DFB701\"}"
		},
		{
			"post_id": 1577057186,
			"body": "WEEK 51 STATUS UPDATE:\nI've been very busy with work (finishing up a project to be delivered tomorrow) as well as the whole Christmas thing. Still managed to get some things done this weekend though.\n- [G] Had a Christmas concert this week. It was ok, I guess.\n- [G] Made a new recording of a composition of mine.\n- [ZN] Researched how trackers work. It's the next part of ZeroNet I'd like to tackle.\n- [ZN] I've solved a couple of issues with local peer discovery:\n   - ensure buffer is large enough to contain max sized siteListResponse messages (100 sites)\n   - site address_hashes as serde_bytes instead of normal byte arrays &[u8]/Vec<u8>\n   - detect local ip to use.\n- [RV] Started designing a game called ryneverse. It's mostly just something to think about while cycling or doing other mundane things for now. But maybe when zerunet takes off I'll put some time in actually programming the thing.",
			"date_added": 1577057168
		},
		{
			"post_id": 1577349869,
			"body": "Merry Christmas to all you ZeroNauts!",
			"date_added": 1577349850
		},
		{
			"post_id": 1577650700,
			"body": "WEEK 52 STATUS UPDATE:\nIt has been a rather productive week.\n- [ZN] Added a peer-manager actor, which passes peer actor addresses to the site actors.\n- [ZN] Generate compatible peer_id's\n- [ZN] Adapt local peer discovery to the actor model\n- [ZN] Have local peer discovery send new peers to the peer-manager, return the proper sitelistresponse.\n- [ZN] Merged the peer discovery to master and started a new branch for peer connections. I'll try to make sure pushed branches always compile from now on.\n\nI'm pretty optimistic about how progress will go over the coming weeks. My plan is to first get a couple of zites like Hello and ZeroMe working passively (i.e. display, no interactions) so that I can test data transfer over peer connection when I implement those. It should be easy to integrate new peer discovery systems with the peer manager, i.e. trackers, pex and DHT, but considering I'll just be connecting my test rigs to each other for now it doesn't make much sense to develop those until file exchange is implemented.\n\nRight now a lot of variables are still hardcoded, I've added console arguments, but they don't do anything yet. Slowly transitioning towards console arg + config file is a running sidequest I'd like to make progress on this week as well.",
			"date_added": 1577650680
		},
		{
			"post_id": 1577752249,
			"body": "I spend 5 hours wrestling with ActorFutures, ResponseActFutures and a whole host of other actix and futures concepts, and my code finally compiles again! When I'm through with this I'll have to write a blog post about all of this undocumented stuff I'm learning.\nThen again, a lot of it will become deprecated when actix switches to std::futures (which I'm looking forward to!)\n\nWith this out the way development should pick up speed again.",
			"date_added": 1577752228
		},
		{
			"post_id": 1578094590,
			"body": "Oh boy, I updated actix to the latest version and now everything is broken :-/\n\nIt had to happen at some point though, and I've honestly been pretty stoked about working with Rust's new async/.await feature, but a lot of my dependencies didn't support it yet.\n\nNow that I've placed every suprise future that popped up in a block_on executor cargo says there's only 5 errors left.. And the error messages look pretty arcane to me. But hey that's what weekends are for!",
			"date_added": 1578094568
		},
		{
			"post_id": 1578097613,
			"body": "- The JoinAll future no longer implements the TryFutureExt trait (or whatever it used to be.\n- ResponseActFuture no longer requires an Error Type to be given\n- Actix-Web wants handlers to be async (but for some reason the compiler had a really hard time telling me so, the error messages were ridiculous)\n- Websockets now handle Result<Message, ProtocolError>, which is a definite improvement, but also one the compiler could not describe in terms I am able to understand\n\nAnd with that zerunet compiles again! *(and does nothing because of missing executors)*\n\nWell, it looks like all other development on zerunet is on halt until I sort out async/.await properly.",
			"date_added": 1578097590
		},
		{
			"post_id": 1578270715,
			"body": "WEEK 1 STATUS UPDATE:\n\nFirst update of the new year, so let me wish you all a Happy New Year!\n\n~~Let me first of all apologize for the lack of updates on Git Center. I haven't cleaned up my commits yet. I will publish them during the upcoming week.~~\nI pushed it anyway, that way I can't lose all of the work I did.\n\n- [ZN] I updated all of the dependencies. Due to Actix's move from the futures crate to std::futures this meant a lot of time getting it to compile again and then more afterwards getting it to also work again. I'm not entirely happy with my adjustments yet, but I can now make progress in other areas and refine some of the asynchronous parts at a later date.\n- [ZN] I implemented a couple of API responses as adding some dummy ones (hard-coded responses because they require variables from components that do not exist yet), thanks to this browsing sites like [ZeroNet in the Eyes of the Media](/1NEwsvyrAoEWU64ZozwdfgEUQhwxiCrh1t/) now works without problem. ZeroHello will take some more time.",
			"date_added": 1578270691
		},
		{
			"post_id": 1578643321,
			"body": "I've managed to compile rust to wasm and then run it a page served by ZeroNet. Soon I'll be able to run ZeruNet from within ZeroNet! \\*EVIL LAUGHTER\\*\n\nAll I would need to do is write wrapper that does all of the file access for ZeruNet through the ZeroNet API...",
			"date_added": 1578643296
		},
		{
			"post_id": 1578907406,
			"body": "WEEK 2 STATUS UPDATE:\nThe weekend wasn't very productive. I bought some new parts for my desktop computer and spent the whole of Friday evening disassembling my desktop computers and building the one I wanted. The biggest problem I encountered was getting it to boot from the right hard drive afterwards. Turned out I forgot to cable my SSD compartment... so that was stupid.\nThen my kitten died, so we held a vigil and buried her. I wasn't in any mindset to work on zerunet after that so I played some vidya and watched some videos to take my mind off things. I really recommend Internet Historian's \"*Engoodening of No Man's Sky*\", very balanced and funny analysis of the history of the Hello Games studio and their failure and subsequent success with the game *No Man's Sky*.\nThe games I played were AoE2:DE, some D:OS2 and Rise of the Tomb Raider.\n\n- [ZN] Figured out how to build ZeroNet websites using Rust-to-WASM (without needing any permissions). It's not an optimal solution however because it has JS turn the base64 string for the WASM file, which it gets from the wrapper, into a ByteArray before it can be run. But I'm confident this is something that can be improved upon later.\n- [ZN] Manage peers with their addresses (whether they be IPV4/6, Onion, I2P and LokiNet). I'm only implementing IPV4 for now though.\n- [ZN] Serve FileGet requests, including asking peers for the files ... but not receiving them yet.\n- [ZN] Make sites subscribeable for websockets. With this ZeroHello no longer gives any errors when loading! Pushing updates to subscribed websockets is something that'll have to wait until file exchange is implemented.",
			"date_added": 1578907380
		},
		{
			"post_id": 1580414102,
			"body": "WEEK 4 STATUS UPDATE:\nI know I'm a bit late with this one, almost two weeks late actually. But there wasn't much to talk about previously. I spend two weekends working on peer communication, only to then discover that rmp_serde can read straight from a TCP socket, rendering most of my work futile (but at least I learned some stuff).\n\n- [G] I'll be going to [FOSDEM](https://fosdem.org/2020/) in Brussels this weekend. I'll probably hang around in the  \"Decentralized Internet and Privacy\" room as much as possible, visiting the 0 A.D. guys at some point as well as Krita and Godot. If you don't particularly care about your privacy/pseudonymity, feel free to talk to me!\n- [ZN] Receive (small) files from peers.\n- [ZN] Fix bug with ZeroHello (broken with Jan 15 update I fear, @Nofish: You should probably look into behavior of ZeroHello with missing user settings, \"sites_section_hide\" in particular!)\n\nI won't be able to do much this weekend (see FOSDEM above), but I would like to add merger support before then.",
			"date_added": 1580414075
		},
		{
			"post_id": 1580842262,
			"body": "WEEK 5 FOSDEM EDITION:\nI went to FOSDEM in Brussels this weekend and had a blast. I thoroughly enjoyed the \"Decentralized Internet and Privacy\" Devroom, as well as some Rust. There's still a lot I have to catch up on that I didn't get to do in the short amount of time I had.\nThe best part was undoubtedly meeting people with a similar interest and discussing our projects. Those whom I got a chance to talk to included people who'd heard of ZeroNet (hopefully you decided to give it a try, welcome!), and even some whose zites are still around!\n[FOSDEM 2020 Kave](/1HCB4nWeM44g7eSxNRuhViophDH9ha8jV2/index.html)\n\nI'm continuing zerunet development, but more on that next week.",
			"date_added": 1580842234
		},
		{
			"post_id": 1581374469,
			"body": "WEEK 6 STATUS UPDATE:\nThis week brings some much needed security, until now my Rust implementation just blindly accepted anything you threw at it ... well ... almost anything. A smart algorithm for choosing who to download from, prioritizing important downloads etc. is non-existent still. I've been thinking a lot about how I should do it and I've just not found a solution I like.\n- [G] Did some basket weaving!\n- [ZN] Required files are downloaded automatically\n- [ZN] File hashes and sizes are verified before writing to disk\n- [RV] Tinkered a little with amethyst, thinking of smaller game projects I'd like to give a try (something I can actually finish). I've got some ideas, but zerunet is more important.",
			"date_added": 1581374440
		},
		{
			"post_id": 1582478230,
			"body": "I've published [ZeruCrypt](/1M4Wwi5x5RUN1QJoS6CcnQh515FMtRNg1d), the module of zerunet that signs and verifies content, as an individual library to Git Center's Repository Index. Hopefully someone finds it to be useful.",
			"date_added": 1582478200
		},
		{
			"post_id": 1582478568,
			"body": "Interesting read for those who're looking for data ownership and privacy.\n[Schneier on Security: Inrupt, Tim Berners-Lee's Solid, and Me](https://www.schneier.com/blog/archives/2020/02/inrupt_tim_bern.html)",
			"date_added": 1582478537
		},
		{
			"post_id": 1582839905,
			"body": "Is it me, or is it getting a bit pandemicky?",
			"date_added": 1582839873
		},
		{
			"post_id": 1583181539,
			"body": "WEEK 9 STATUS UPDATE:\nLast week I published a first version of ZeruCrypt which had only signing and verification, this has been extended to include creation of new address/privkey pairs. With that out of the way I've started drafting how to handle databases, required for merger functionality as well as inter-session storage (which was lacking).\n\n- [ZN] Add keypair creation to ZeruCrypt\n- [ZN] Split UPnP-Brunch from main project, it's not really in a working state though, I'll get back to fixing it when I need it for ZN.\n- [ZN] Create new sub-project ZeruContent that uses ZeruCrypt to sign and verify content.\n- [ZN] Add preliminary support for users.\n- [ZN] Start work on database interaction.\n- [G] Getting worried about Corona.",
			"date_added": 1583181506
		},
		{
			"post_id": 1583796988,
			"body": "WEEK 10 STATUS UPDATE:\nThis weekend has mostly been wasted on trying to make the database interactions backend agnostic. My hope was that users could choose to set up Postgres to be used instead of Sqlite. I've had to give up this aspiration for now because I realize very few people would have bothered to use the feature anyhow and I've had to go back to square one too many times. Hopefully I'll be able to return to this at a later date.\n\n- [ZN] List of sites is now stored in sqlite database between sessions.\n- [ZN] Bunch of database stuff for JSON, content, optional files etc. is implemented, but not integrated with zerunet yet (so guess what's up for this week?)\n- [ZN] Been thinking a lot about how to deal with merger db's, all I know is that it's going to be quite a lot of work.\n- [G] Still worried about Corona.",
			"date_added": 1583796954
		},
		{
			"post_id": 1584312726,
			"body": "WEEK 11 STATUS UPDATE <174>:\nFinally put some work into database interaction (looking forward to have ZeroTalk working!), only building and filling the database so far. This is the first part that I've implemented where the Rust implementation should really shine over the Python implementation. Serde should allow transferring ownership of memory from the file that is read, over to the queries which can then be executed ... theoretically. I haven't actually gotten it to work that way yet. So yeah, it works, but could do with some serious improvements.\n- [ZN] Did some good ol' spring cleaning in the code.\n- [ZN] Create Sqlite database from dbschema.json\n- [ZN] Read json files with proper regex into database.\n\nPlans for next week:\n- Look into Diesel dynamic schemas and whether those can provide a cleaner/more efficient way to construct insert statements for zite db's\n- Implement API for querying the zite db's",
			"date_added": 1584312691
		},
		{
			"post_id": 1584754722,
			"body": "New blog post: [Building an E-Commerce Solution with ZeroNet](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:8:Building+an+E-Commerce+Solution+with+ZeroNet)\n\nThe zerunet project has temporarily been placed on halt to develop a ZeroNet application that I think is important in the current situation. Many shop are unable to function due to the lockdowns and unless they start transitioning to delivery they may not survive the coming year.\nIn this blog post I explain the privacy and security considerations behind what I'm currently calling ZeroMarket. If everything goes according to plan, I should have an Alpha version ready Sunday the 22th of March.",
			"date_added": 1584754686
		},
		{
			"post_id": 1584894236,
			"body": "You can try out the [ZeroMarket Live Demo](/1MARKtLD2e69w7qiHLNQz3rPDmWLHbb2ZE/), it's a ZeroNet-based E-Commerce solution. For more details about how ZeroMarket handles private information [you can read my blog post](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:8:Building+an+E-Commerce+Solution+with+ZeroNet), not everything mentioned there is implemented yet though.\n\nPlease note that admin functionality will not work without the private key! In the future I intend to put some dummy data in so that you can fully explore the Customers, Orders, Stock and Settings screens in the demo.\n\n**IMPORTANT**: This is still in early development, it's not ready to be used.",
			"date_added": 1584894199,
			"meta": "{\"img\":\"900,596,876766776877999887998ddd9cafffeeeceecdeceddef,01222331435500245565777777777899999999999A9A99A9999BC9C9DDAD9AEAE9AAAA\"}"
		},
		{
			"post_id": 1588370119,
			"body": "The Departure",
			"date_added": 1588370081,
			"meta": "{\"img\":\"900,506,5536887549bb9aa8dd9de674887875784897562342221996,01234534650789ABBB4777A7CCCCDD7C799D00EE702992CCEE09F99992DE\"}"
		},
		{
			"post_id": 1588370131,
			"body": "The Vibrato",
			"date_added": 1588370092,
			"meta": "{\"img\":\"900,506,564775684895975774653432443db9ddbaa98998a5ac6cd9,011234311510012456565010646756580089456852223AB4C10DDDEFBC4C\"}"
		},
		{
			"post_id": 1588444303,
			"body": "Watch [Thaïs, a Musical Shortfilm](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:9:Tha%C3%AFs,+a+Musical+Short+Film) on my ZeroNet blog. This video was filmed and recorded over three days last weekend.",
			"date_added": 1588444263,
			"meta": "{\"img\":\"900,506,877677767878666345335766566234124555977024014,00011000022345556730208999AB300CBDDEEB300C47777033C022003C30\"}"
		},
		{
			"post_id": 1588792174,
			"body": "I want to give a quick recap of what's changed with [1+Gallery](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4) going from v1.0 to v1.1:\n- *Improved queries*: new 'lang' and 'hub' queries, this type of query uses OR instead of AND, so you can search multiple hubs.\n- *Bookmarks*. Whenever you view a gallery the page you stop at is stored locally (not synced), you can then continue where you stopped by clicking the cover. If you finished the gallery a checkmark is shown.\n- A new *compact grid view* that doesn't show any data except the gallery's language and bookmark status. This is currently opt-in, but might become the default (opt-out) if people like it.\n- *Recent comments* can be found on the front page.\n- *Markdown* can now be used in comments.\n- *Preloading* pages ... except on Firefox, which has a bug.\n- *Lazy loading* of all thumbnails, this should result in a smoother experience.\n- *Edit Gallery* button is shown if you are the owner of the gallery.\n- *French and Dutch translations*, because baguettes deserve love too.\n\nA full changelog for 1+Gallery is available [on Git Center](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?191JBSmjUStVdF6zxqujN2MZUk1KaphEPe/CHANGELOG.md@master)\n\nHub owners get a little treat as well!\n- Landing page redirect has 3 second delay and show a button to cancel redirect. This should allow you and your visitors to get to the hub's ZeroNet panel without hassle.\n- 'New', 'Unsigned' and 'All' are now tabs instead of confusing buttons.\n- A delete button. It's best not to delete galleries that have already been signed though, because ZeroNet will not delete them on other's instances. This is something that should be addressed in ZeroNet itself.\n- Zipped galleries are supported. But you'll have to create them using the [Rust0gal](/1KJquoRGNoC3sZWj56WEtSaLKg9hYupnX9) command, not through the hub interface. Archived galleries still have some weird behaviour in 1+Gallery, but it should be nothing major.\n\n**How to update your hub?** It's best to just copy main.js and main.css from [GalleryHub](/14NFfVBBAFbNdqX4nyGjyBF1BRSz7jn2QP) to your hub and sign it.\n\n**Don't have a hub yet?** Now's an excellent time to give it a try, just go to [1+Gallery](/1PGaLLNiadMzrmw6MMMnpZnskwFcdgZoS4), click on the hubs tab and there should be a button to create a new one, just for you!\nIf you encounter any problems feel free to send me a ZeroMail or make an issue on the Git Center repo.\n\n**What does the future hold?** Nothing concrete. It's no where near good enough yet. Except for some bugfixes I hadn't touched this project in nearly a year so it was definitely in need of some tinkering. Mangadex had some problems in begin January, then Mangarock went down last month and those set me thinking. I feel I have a responsibility to maintain this project now, and also that there's a potential future for it should more such sites bite the dust. Imagine scanlator groups each running their own GalleryHub and you accessing all of them from one central zite. One can dream, ey?",
			"date_added": 1588792133
		},
		{
			"post_id": 1589049770,
			"body": "When the goal of your day's programming is to make sure nobody notices anything has changed, motivation is rather fleeting.",
			"date_added": 1589049728
		},
		{
			"post_id": 1589149904,
			"body": "It's a bit soon to be bumping the minor version of 1+Gallery again, but I feel it's warranted. So hereby I'm announcing 1+Gallery **v1.2.0**.\n\nA lot of the code was restructured over the weekend and all dependencies updated to the latest version, something I've postponed multiple times because it's boring low-reward work.\n\nWhat changed?\n* Sort the results of your queries.\n* Upgrade to Less v3 fixes some styling issues\n* Hopefully you don't notice any other changes, because that would mean I introduced a bug!",
			"date_added": 1589149861
		},
		{
			"post_id": 1590186053,
			"body": "[GalleryHub+](/14NFfVBBAFbNdqX4nyGjyBF1BRSz7jn2QP/) [v1.1.3](/114AZoCSLsZu6Ktfnfu64Uoh8pcdVYFhSX/) *(minor)*, **What's new?**\n- Change the redirection address from the settings tab.\n- Change the default language, gallery type and SFW/NSFW rating for you hub from the settings tab.\n- Moved settings from `config.json` into `content.json`.",
			"date_added": 1590186009
		},
		{
			"post_id": 1591145573,
			"body": "I've got my Rust implementation of the ZeroNet protocol to do what I want it to now but it's a bit hacky for now:\n\n`bytes -> rmp_serde::decode -> custom_type w/ ByteBuf -> serde_json::encode -> json::Value -> serde_json::decode -> output_type`\n\nRmp_serde doesn't decode bytearrays to Vec<u8>, but will to ByteBuf if given the chance. A custom Value type prioritizes ByteBuf over Vec<Value> to get around this. But now this custom type still has to be cast to a variable type T and because I'm a bit lazy right now I just have json_serde encode it as json::Value and then decode it to T to give back to the libraries user.\n\nAll that time spent adding async and now ser/de is going to be slow as hell, for now at least. The most important thing is that it does what it's supposed to.\n\n> ME: \"You can't just keep serializing and deserializing to different types until you get what you want!\"\n\n> ALSO ME: \"Serializer go brrrrrr...\"",
			"date_added": 1591140428
		},
		{
			"post_id": 1592437167,
			"body": "I'd be grateful if some people could add `zero://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion:15442` to their tracker list\n\nWARNING: It doesn't fully work yet. The tracker exchanges handshakes and announces fine, but the announce responses are still incomplete and/or inaccurate.\n\nRight now it supports ipv4, ipv6 and onionv2 addresses, and probably crashes on onionv3, i2p and loki addresses because those are unimplemented lol (feel free to try and crash it if you want!)",
			"date_added": 1592437121
		},
		{
			"post_id": 1592849244,
			"body": "My ZeroNet Tracker ([trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion](trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion)) should fully support onion announces now. You can add\n`zero://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion:15442` to your trackers to use it. You can also visit the onion URL using Tor to explore the tracker's peers, hashes and uptime.\n\nIn order to test it I've started a ZeroNet instance with all other trackers disabled and successfully downloaded ZeroHello and ZeroTalk, as well as discovering other `zero://` trackers.\n\nThe source code is available from my profile.",
			"date_added": 1592849197
		},
		{
			"post_id": 1593200426,
			"body": "ZeruCrypt test coverage: 89.13%\nZeroNet Protocol test coverage: 65.76%\nZeroNet Tracker test coverage: 43.00%",
			"date_added": 1593200378
		},
		{
			"post_id": 1594121688,
			"body": "As someone who's used Rust since before 1.0 came out in 2015, but who's never needed to implement macros before it came as a surprise that the documentation is a bit limited. Rust, and a lot of Rust libraries, have amazing documentation. Once you get beyond the very simple macros I haven't found any good source of documentation, luckily with my experience with Rust I'll probably get there on my own by exploring the [Syn: Rust Syntax Parser docs](https://docs.rs/crate/syn/1.0.33), and then I can make a blog post about it that no one will find.\n",
			"date_added": 1594121639
		},
		{
			"post_id": 1594246061,
			"body": "For the past couple of months I've had this idea in my head of a Git Center CI, basically it's a program that you'd point to a list of Git Center repos and it will run tests, generate coverage, docs, etc. and then publish to the repo with those changes.\n\nMy current plan of action is to use [toast](https://github.com/stepchowfun/toast) to containerize the whole thing.",
			"date_added": 1594246011
		},
		{
			"post_id": 1594294897,
			"body": "Git Center badges generated by my experimental Git Center CI Runner using toast. The CI is currently only running on the [ZeruCrypt repo](/1M4Wwi5x5RUN1QJoS6CcnQh515FMtRNg1d). The docs badge is actually a link to the documentation built by the runner.",
			"date_added": 1594294846,
			"meta": "{\"img\":\"900,70,bbebadbbbabcabbaae,0110203450\"}"
		},
		{
			"post_id": 1594411100,
			"body": "New blog post: [From Git Center Repositories to Rust Registries](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:11:From+Git+Center+Repositories+to+Rust+Registries)",
			"date_added": 1594411048
		},
		{
			"post_id": 1594435609,
			"body": "Now that I've got CI on Git Center and [a Rust registry on ZeroNet](http://localhost:43110/1CRAteZVBUYrnx8jj9x87A1zCnptrWFhPH), the next step is updating my toast scripts to automatically publish new versions of my libraries when the build & tests pass. These developer-oriented projects will make my work on zerunet easier and hopefully others will find them useful as well.",
			"date_added": 1594435555,
			"meta": "{\"img\":\"900,556,46466746366885c465eeeeedcccccbddcdccddd,01022222223432222222050222222267777777777898889AB87C7CCCCCAC\"}"
		},
		{
			"post_id": 1594474550,
			"body": "I've just read [this interesting blog post about Rust error handling](https://nick.groenen.me/posts/rust-error-handling/) and seeing as that has always been a bit of a blind spot in my code I'll make that my focus this weekend.",
			"date_added": 1594474495
		},
		{
			"post_id": 1595294377,
			"body": "So the plan is forking Javelin, having it output HLS through a special writer that wraps around a PeerMessageWriter. No idea whether the end result will be compatible with Streamz...",
			"date_added": 1595294321
		},
		{
			"post_id": 1595335851,
			"body": "Ok, just updated zerucrypt, zerusign and zerusign_derive so I should be able to work on streamz_pmw this evening.",
			"date_added": 1595335794
		},
		{
			"post_id": 1595784172,
			"body": "It's now literally one single command to publish my crates to ZeroNet (`$: cratez-publish`). Registry address is an env variable, ideally it should be read from cargo's configuration instead.",
			"date_added": 1595784114
		},
		{
			"post_id": 1595784751,
			"body": "Unfortunately, due to rust-bitcoin's hard dependency on secp256k1 v0.17.1 (I need 0.17.2) I've had to add an updated version to my own registry. I expected them to properly maintain their dependencies. Hard dependencies on patches at this stage of development isn't proper.",
			"date_added": 1595784692
		},
		{
			"post_id": 1595785770,
			"body": "Played around with wasm-bindgen and it has gotten a lot better. I should probably update my ZeroNet wasm guide.",
			"date_added": 1595785710
		},
		{
			"post_id": 1598004470,
			"body": "Someone recently proposed inter-operating with other filesharing networks on Github, but here's what makes that hard:\n\nHashing algorithms used to identify files on the network:\n- ZeroNet: SHA512 (trimmed to 256 bytes)\n- Freenet: SHA256\n- IPFS: Multihash (defaults to SHA256)\n- RetroShare: SHA1\n\n- GNUNet: Couldn't find, plz let me know!",
			"date_added": 1598004409
		},
		{
			"post_id": 1599678833,
			"body": "I've updated my ZeroNet tracker (v0.1.4a). It's gotten a little cleaner and now it actually listens to the delete flag in announces.\nCurrently everything is held in memory, but I'm going to add an optional SQLite feature next so that it doesn't lose track of peers after a short shutdown.\n\nIf you want to help me test my tracker, you can add:\n`zero://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion:15442`\nto your list of trackers (obviously you need Tor enabled!).\n\nThere's also [some statistics available at the same onion address](http://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion/).",
			"date_added": 1599678771
		},
		{
			"post_id": 1599768463,
			"body": "ZeroNet Tracker v0.1.5 is live. Nothing fancy. It now uses clap and the rust env macro to use Cargo.toml data during compilation, this just means the version number on the stats page will always be correct.",
			"date_added": 1599768400
		},
		{
			"post_id": 1599907370,
			"body": "My dashboard visualizing the statistics made available at http://trackd5xiih3z7xyvvkyz2n65lehqziayjpxzsau3mwccwlelxrdrgid.onion/stats\n\nThe color change happens whenever a new version is set live and the gap was when Tor crashed.\n\nFrom the downward spikes in the hash count it's clear that the janitor is being a bit too zealous and cleaning up peers just before they re-announce. In v0.1.6 I will increase the timeout.",
			"date_added": 1599907306,
			"meta": "{\"img\":\"900,253,112222333223332232343,001001111100200003001141155655\"}"
		},
		{
			"post_id": 1601590478,
			"body": "I've got some a bunch of projects that I'm working on that I've made great breakthroughs with in the past couple of weeks, and now I'm starting to think I prefer being stuck on problems. Now I don't know which one(s) to focus what little time I have on. And I should really make time to write blog posts about my progress, but that'd mean having even less time.",
			"date_added": 1601590413
		},
		{
			"post_id": 1601916571,
			"body": "New blog post: [Using ZeroNet to Build a Point of Sale System](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:15)",
			"date_added": 1601916505,
			"meta": "{\"img\":\"900,675,210542631952974665888a99000abbccdeef778bbc455545,0010020234222002233554120100004421567708102169AAB980135CDBB5802300ECA1880100FC71\"}"
		},
		{
			"post_id": 1603318496,
			"body": "Just published the [ZeroFrame-rs repository](http://localhost:43110/19aDztXdkcR9YAKGoWwB58oCinmWqHwQwe) for use in Rust WASM projects on ZeroNet (with e.g. Yew or Oxygengine). It is not feature-complete and the API is subject to change.\n\nZeroFrame-rs v0.1.1 is also available from the Cratez registry.",
			"date_added": 1603318429
		},
		{
			"post_id": 1603398568,
			"body": "New blogpost about Game Development and WASM on ZeroNet: [Publishing an Oxygengine Project on ZeroNet](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:16:Publishing+an+Oxygengine+Project+on+ZeroNet) in which I show how to build and publish one of the demo projects included with the game engine.",
			"date_added": 1603398500
		},
		{
			"post_id": 1603713161,
			"body": "Youtube has been behaving very strangely for me. Channels I never subscribed to are showing up in my subscription feed. The first time I noticed this a few days ago I thought I must have subscribed to them so long ago that I forgot (they hadn't published new videos in a while so it would have been normal for me to not have seen them in my feed).\n\nToday it happened again, this time with a new channel, with as good as no views (all videos under 100 views). I won't say which because I don't think it's their fault. How many ridiculous bugs has Youtube had over the past 5 years?\n\nI remember when Susan claimed videos *not* appearing in feeds was not a thing only for Youtube to claim to have fixed it months later. Or when subscribers counts suddenly started decreasing without people actually unsubscribing. Or when people got some random other person's home page instead of their own.\n\nIt's also possible I've been hacked or left a session open on someone else's device. But 1) I don't use other people's devices. 2) Subscribing to random channels is the weirdest kind of prank to do with access to my account. 3) The programmers behind Youtube have proven themselves incompetent (or they use too many interns).",
			"date_added": 1603713092
		}
	],
	"post_like": {
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1563740460": 1564783060,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1564783736": 1564783795,
		"1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160563": 1565200971,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1564948061": 1565310750,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1564940037": 1565310752,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1564939437": 1565310754,
		"1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565311654": 1565372080,
		"1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565263100": 1565372114,
		"1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565429481": 1565462109,
		"1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565429448": 1565462111,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1565528500": 1565546240,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1565528883": 1565546244,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1565529031": 1565546250,
		"1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565555505": 1565805897,
		"1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1566082741": 1566082971,
		"1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1566181724": 1566236598,
		"1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX_1569615994": 1569628181,
		"1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC_1569791697": 1569926960,
		"12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq_1570295069": 1570433062,
		"1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7_1576335856": 1576427038,
		"1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7_1576617742": 1576617794,
		"168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3_1578437450": 1578440956,
		"1DayEKa2rD34C5ymFDtUBzr7za2wyM1fwD_1581109124": 1581122358,
		"1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7_1581116357": 1581179367,
		"18q4jNHETPqtSCQF9hBHKxVgtNUkQL2kTF_1582271655": 1582317032,
		"1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1583275204": 1583357216,
		"15pmmLorKU3aiCbeF6HftTLY7Ji29DGBkS_1584339731": 1584352328,
		"13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1585686691": 1585698740,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1586009676": 1586039667,
		"1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1_1586009576": 1586039670,
		"1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591364509": 1591536059,
		"13CY9hRSR31gPzrfDrMRiNaaRwsv16XSA9_1592525702": 1592558166,
		"1JeTJBQxC7CuQFxijHjjEqKgQnXJhRFF94_1592916464": 1592939279,
		"1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1593303150": 1593385202,
		"1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1597838964": 1597846336,
		"129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71_1600766340": 1601733409,
		"129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71_1601057026": 1601733415,
		"17KJTfEhSfdJHgyCqvjD4yMVU1a55bcrs8_1597908828": 1602706069
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Would have happened at some point or another. They're not left, nor right. They're status quo and this means subversive technologies like ZeroNet are their enemy. They still don't even like \"traditional\" social media, and consider those to be too subversive. But at least they have some power of those, be it through tarnishing the companies behind them or through a combination of propaganda and lobbying as we've seen in the EU.\nThere is no way for the media to hold that power over ZeroNet.",
			"post_uri": "1NWrRbFXqVEgHfKpKZpijSiSuuksvXgNVN_1565108338",
			"date_added": 1565115536
		},
		{
			"comment_id": 2,
			"body": "@SSDifnskdjfnsdjk: it could be used to gather the IP's of ZN users, which could be dangerous for people in countries were ZN is banned. It's not really doxxing though",
			"post_uri": "163cCAVJzhzn2hYne8LtFjyAfDbRQP1vv2_1565095689",
			"date_added": 1565115670
		},
		{
			"comment_id": 3,
			"body": "Dark theme is amazing, sad that old zites don't always support it.",
			"post_uri": "1Avp8UHcU4e2F3LDSh66sRhs9G5zmbnQ7u_1565257260",
			"date_added": 1565288142
		},
		{
			"comment_id": 4,
			"body": "I recommend upgrading to [ZeroBlog++](/19fZJhX7FGENeRRLB8ftgrziBJ5vsLtFog/), it's what I use for mine. This one has some nice features such as tags, a ToC, drafts and probably some other things I can't remember rn. To upgrade your blog:\n1. Shut down ZN.\n2. Edit your blog's content.json\n3. Replace the cloned_from field to the address of ZeroBlog++ (`19fZJhX7FGENeRRLB8ftgrziBJ5vsLtFog`) and save the file.\n4. Start ZN again and go to ZeroHello\n5. Click on the three dots next to your site and select \"Upgrade Code\" from the menu.\n6. Clear your browser's cache because you'll likely still have the old cached CSS messing with the layout. The easiest way to do this in most browsers is F12, then going to the network tab and setting \"Disable Cache\" to true, then reloading the page (Ctrl+R). After that you can close the devtools again with F12.",
			"post_uri": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565311654",
			"date_added": 1565367361
		},
		{
			"comment_id": 5,
			"body": "Guess I'll be mocking Samsung as well then.",
			"post_uri": "1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj_1565331050",
			"date_added": 1565371935
		},
		{
			"comment_id": 6,
			"body": "You draw well. There's some other ZeroNet users around who post their art and I've been thinking of building a deviantart inspired zite. (I'm the 1+Gallery dev btw) Would you be interested in something like that? No promises, kinda busy with work.",
			"post_uri": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565263100",
			"date_added": 1565372222
		},
		{
			"comment_id": 7,
			"body": "It's like a Twitter without annoying blue checkmarks acting all holy.",
			"post_uri": "16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr_1565257400",
			"date_added": 1565372280
		},
		{
			"comment_id": 8,
			"body": "Tor browser has a problem with ZeroMe.",
			"post_uri": "136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT_1565443588",
			"date_added": 1565461999
		},
		{
			"comment_id": 9,
			"body": "good morning :-)",
			"post_uri": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565430391",
			"date_added": 1565462170
		},
		{
			"comment_id": 10,
			"body": "20MB for a rotating circle seems a bit heavy... Is it supposed to do anything else? It also looks like there's a bit too many font files included, dunno why you'd need a couple of dozen?",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1565979807",
			"date_added": 1565984984
		},
		{
			"comment_id": 11,
			"body": "plz fund ZeroNet :-p",
			"post_uri": "177ryN1xKyznvLDzJ6XZ9UP4xTfBErZMEu_1",
			"date_added": 1566079968
		},
		{
			"comment_id": 12,
			"body": "I get two errors (Brave):\n> VM36:30 Uncaught ReferenceError: Page is not defined    at VM36:30\nand (end omitted for brevity)\n> ERROR Error: Uncaught (in promise): SecurityError: Failed to execute 'replaceState' on 'History': [...]",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1566082741",
			"date_added": 1566083562
		},
		{
			"comment_id": 13,
			"body": "I think the problem might be that it's not prompting me to accept the NOSANDBOX permission.",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1566082741",
			"date_added": 1566085600
		},
		{
			"comment_id": 14,
			"body": "c'est assez facile utilisant les blocklist, mais je suis en train de programmer un système plus traditionel. J'en parlerai sur mon blog. Il s'agit d'un système mélangé consistant d'un site central qui est aussi un merger. Les admins du site seront capable de designer des moderateurs et des janiteurs. Janiteurs sont capable de moderation non-destructive en marquant des post/utilisateurs, mais sans les virez du platform. Mods sont capable de moderation destructive virant des cert completement MAIS parce que le site est merger aussi ils seront encore capable de publier etc. sur leur hub a eux.",
			"post_uri": "13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx_1566127050",
			"date_added": 1566130994
		},
		{
			"comment_id": 15,
			"body": "@Watteau: c'est probablement que je ne l'ai pas bien expliqué, j'espère finir au moins un proof-of-concept cette semaine et en avoir écrit un blog avec screenshots pour montrer comment ça marche.",
			"post_uri": "13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx_1566127050",
			"date_added": 1566165971
		},
		{
			"comment_id": 16,
			"body": "Good to know how dangerous that is. I hope a better way to deal with the iframe problems is soon found.",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1566181724",
			"date_added": 1566236648
		},
		{
			"comment_id": 17,
			"body": "Ubuntu 64bit, no problem either with ZeroMail on rev4206.",
			"post_uri": "13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx_1568144678",
			"date_added": 1568186024
		},
		{
			"comment_id": 18,
			"body": "@Eieio: You fell for our ruse >:-D",
			"post_uri": "15uwquFdsTdaW21FrMrxPVouFn4LNSQ3Gz_1",
			"date_added": 1568480411
		},
		{
			"comment_id": 19,
			"body": "je ne suis pas francophone, mais je vous comprends :-) il y avais qq gilets jaunes, mais malheureusement les autres n'ont jamais suivis.",
			"post_uri": "1AkWfxEERvxEkADiM5tWzSB3uGjYAUfroi_1568903749",
			"date_added": 1568912746
		},
		{
			"comment_id": 20,
			"body": "ranking sites is hard to get right",
			"post_uri": "13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1568855665",
			"date_added": 1568912867
		},
		{
			"comment_id": 21,
			"body": "Hey there, I'm the dev for 1+gallery. If you have specific features you think would improve the user-experience when reading comic books, could you list them. I probably won't be implementing them soon (working on a couple of other projects atm, and very little time free time to start with), but I'm definitely going to keep improving the site. I don't know of any alternatives rn. There was someone a while back who was developing one, but it never got finished.",
			"post_uri": "1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC_1569791697",
			"date_added": 1569799570
		},
		{
			"comment_id": 22,
			"body": "@Saintian: Quick summary of the points you brought up with my reactions in parentheses. The good news is some of these are so simple that I'll make sure to do them soon.\n- option to fit width rather than height, with scroll (fairly easy)\n- space scroll down first and next page if at bottom (really easy)\n- per-gallery bookmarks (requires thinking about right implementation)\n- option for two-page view on wide screens (not a priority)\n- option for endless scrolling (moderate)\n- page turning animations (personally don't like these, sorry)\n\nSome further comments:\n1. 1+Gallery is not solely focused on comic-books (although that does seem to be the most popular content), people also use it for photos, drawings, etc.\n2. 1+Gallery has a tag system, but only the uploaders of a gallery (or comic book) can change the tags on that content. I was planning to implement user-voted tags, but never got around to doing it, doesn't feel like there's enough demand for it and might be hard to get done in a way that can't easily be abused. (working on some ideas for moderated platforms that I could integrate it with)\n3. As stated before I personally don't like page turning animations, although I most certainly should (and will) improve the experience of changing pages (don't just use fileNeed, but actually preload in browser as well, don't superimpose fullscreen image over normal, etc.) Animation likely won't ever be added, even as an option (unless someone else adds them). They'd make little sense for the other types of content hosted on the merger network.\n4. In the long term I'll be rebuilding 1+Gallery from scratch at some point. It's currently a continuation of 0-gallery written in Vue and I've been getting a lot of experience using Svelte, which I'm starting to prefer. On top of that I think some of the software design decisions both I and my predecessor made were mistakes and a fresh starts seem like the best way to clean the code up...",
			"post_uri": "1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC_1569791697",
			"date_added": 1569871224
		},
		{
			"comment_id": 23,
			"body": "@Saintian: pushed a small update yesterday that removes the scrollbar in fullscreen mode (something I've been wanting to do for a long time) and allows you to use space to scroll down & go to next page if at bottom. I didn't test it on different browsers yet so it might not always function correctly.\nAs for tags `:tag_name` to include `!:tag_name` to exclude. tags can also be namespaced like `artist:breugel`. You can find more information on the filter tab.",
			"post_uri": "1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC_1569791697",
			"date_added": 1569914543
		},
		{
			"comment_id": 24,
			"body": "Too many :-)",
			"post_uri": "1BW9otdX8k7waP625pbqikDgWxyAU5PSqn_1569895732",
			"date_added": 1569961692
		},
		{
			"comment_id": 25,
			"body": "It has definitely been getting more active since I joined about a year ago. It's a very slow growth though (except for the short-lived explosion following the 8ch shutdown)",
			"post_uri": "12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq_1570295069",
			"date_added": 1570433514
		},
		{
			"comment_id": 26,
			"body": "@Pexo: It's written in rust and uses Actix as actor framework. 1) Rust because (properly written code) allows for great performance and lower memory usage compared to almost any other language (certainly python) with the memory safety and strong type system as a bonus. 2) The Actix framework because it makes concurrency easier to implement.\nI've made a [Git Center repository](http://localhost:43110/14mVJrvB1XqtC4Aq55BmXyf9yXUN9iWwd8) with what I have so far (i.e. only serving static sites that have already been downloaded using ZeroNet-py), it's probably a year away from working (I've been working on it since aug/sept). \nFor now I'll be focusing most of my time on handling the websocket's messages before actually implementing peer connections.\n\nOf course everything is subject to change :-)",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1574584639",
			"date_added": 1574794792
		},
		{
			"comment_id": 27,
			"body": "Hello!",
			"post_uri": "1CSbdHFNoAimEwYJVeTAiX7GcS7pR2j1jP_1",
			"date_added": 1574796071
		},
		{
			"comment_id": 28,
			"body": "It is awesome how fast and easy the updates are.",
			"post_uri": "1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7_1576335856",
			"date_added": 1576427414
		},
		{
			"comment_id": 29,
			"body": "srsly I wasted so much time trying to get it to work with enums :-(\nit's not like it's a speed, safety or whatever requirement\nit's just that I hate code not being the way it should be\nand a string is definitely the way it should not be",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1576426884",
			"date_added": 1576427654
		},
		{
			"comment_id": 30,
			"body": "What am I looking at?",
			"post_uri": "12yk6fSLY85rKGkemD5wSDAiNvcXG9pqHe_1576420970",
			"date_added": 1576428127
		},
		{
			"comment_id": 31,
			"body": "@Pexo: I can't really say, I've only ever used tox for chat, never voice/video. It was really quick to set up both on Linux (Ub 18.04 LTS) and Android, and because there's only one application (Jami) rather than different ones (Antox, Qtox, Utox, Antidote, etc.) for each operation system it was relatively easy to convince less tech-savy people to try it.\nI've had a videocall freeze once though, but the program was running fine. This could've been a network issue (both sides were on wireless and one was moving around), I'll have to use it more to say how reliable it is.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1576426884",
			"date_added": 1576439455
		},
		{
			"comment_id": 32,
			"body": "@ulrichard: That's so sweet.\n\nI really like traditional crafts and wish I'd done more of them as a kid. A decently-made (or better!) basket is not only beautiful, but can also remain useful for the rest of their lives. I have two baskets from the time of my great-great-grandparents and they're still in a good state (that's largely because they haven't been used in ages, but it still goes to show just how awesome the craft is!)",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1576440794",
			"date_added": 1576524010
		},
		{
			"comment_id": 33,
			"body": "@Draugrdeathlord: cut him some slack, he's not advertising. It's all decentralization or development related open source projects.",
			"post_uri": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1577564374",
			"date_added": 1577622583
		},
		{
			"comment_id": 34,
			"body": "@Draugrdeathlord: Drop in, right now I'm running it on my py3 data folder. Ideally zerunet and ZeroNet should remain 100% compatible both ways, but I won't guarantee that.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1577650700",
			"date_added": 1577651827
		},
		{
			"comment_id": 35,
			"body": "@Topnet: You might want to look into https://radicle.community/",
			"post_uri": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1578294584",
			"date_added": 1578305165
		},
		{
			"comment_id": 36,
			"body": "What am I looking at?",
			"post_uri": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1578335413",
			"date_added": 1578397551
		},
		{
			"comment_id": 37,
			"body": "@Pexo:\n> Make it work on Tor Browser in the default config.\n\nIt's just going to break in the next version anyway, why bother?\n\n@Filip Š:\n> create browser extension which runs ZeruNet Wasm and provides access to ZeroNet without installing it\nThe biggest problem is that it would not have file storage, so the plugin would always be leech-only.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1578643321",
			"date_added": 1578917444
		},
		{
			"comment_id": 38,
			"body": "@Sarou: I post a weekly update of the progress I'm making with my projects, especially when they are ZeroNet-related.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1578907406",
			"date_added": 1578992406
		},
		{
			"comment_id": 39,
			"body": "@Anotherone: You could set the ZeroNet config to not launch the browser, and just bookmark ZeroHello in the Tor browser. If you set ZeroNet as start-up application you can just open Tor browser to browse ZeroNet and it'll keep content synced in the background.",
			"post_uri": "17BYwjP6Ugv94ZazKdGNmx9FmtPiX7cgkB_1",
			"date_added": 1579050106
		},
		{
			"comment_id": 40,
			"body": "@Realjohndoe: That really depends on what community you join.",
			"post_uri": "1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge_1580554095",
			"date_added": 1580555807
		},
		{
			"comment_id": 41,
			"body": "Hi there, I'm not much of a prepper, but I do see myself as a bit of a software prepper i.e. trying to store and build software in preparation of some future event/collapse. I'm also a musician, violinist. I hope you enjoy your stay, and I'll be looking forward to pictures of that cabin.",
			"post_uri": "1DayEKa2rD34C5ymFDtUBzr7za2wyM1fwD_1581109124",
			"date_added": 1581122561
		},
		{
			"comment_id": 42,
			"body": "Would Rust qualify? :-)",
			"post_uri": "1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7_1581116357",
			"date_added": 1581122698
		},
		{
			"comment_id": 43,
			"body": "@Moor: As @Clearnet said: Rust is compiled using LLVM, and one of its pillars is the concept of ***zero-cost abstraction***.\n> C++ implementations obey the zero-overhead principle: What you don't use, you don't pay for [Stroustrup, 1994]. And further: What you do use, you couldn't hand code any better.\n> *-- Stroustrup*\nSo the answer is, pretty much like C++.\nAs for your question about really small embedded stuff, Rust should be viable, although I've heard somewhere you might need to use an alternative formatter (std one will increase binary size), and use the right LLVM configuration (e.g. optimizing low-memory usage over performance) it really depends on just how small you want to go.\n\nPersonally there's two implementation I want to see of ZeroNet: Rust and Haskell. There's only one I'm willing to develop though.",
			"post_uri": "1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7_1581116357",
			"date_added": 1581179322
		},
		{
			"comment_id": 44,
			"body": "It's not hard, you just clone one and change some variables. But why do you want to?",
			"post_uri": "1F173rBNKkGpKsD2cVHDdxShgvKTRdjwMM_1582310825",
			"date_added": 1582316926
		},
		{
			"comment_id": 45,
			"body": "@Saymyname: Perfectly fine reason.",
			"post_uri": "1F173rBNKkGpKsD2cVHDdxShgvKTRdjwMM_1582310825",
			"date_added": 1582469222
		},
		{
			"comment_id": 46,
			"body": "@Filip Š: Yes, I've also split UPnPBrunch and ZeruContent from the core already (but those aren't ready for publication yet, source is available though see links on my profile), but a lot of it won't be useful without the rest I imagine.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582478230",
			"date_added": 1582587403
		},
		{
			"comment_id": 47,
			"body": "@Filip Š: Good thing you say so now, I hadn't really thought about that. I might have to change my architecture somewhat to deal with that.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582478230",
			"date_added": 1582649523
		},
		{
			"comment_id": 48,
			"body": "Wouldn't you just have a e.g. Rust/Go/C/etc. client that communicates with any ZOS implementation? I don't like the idea of running 5 ZeroNet instances because some frontend dev \"likes doing it that way\"",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582478230",
			"date_added": 1582649695
		},
		{
			"comment_id": 49,
			"body": "Welcome to ZeroNet, I heard something about the_donald getting nuked, what happened exactly?",
			"post_uri": "1Hoa24W5CNPLBBCgR62eh2X8HuNxzDDbaW_1",
			"date_added": 1582839184
		},
		{
			"comment_id": 50,
			"body": "@Realjohndoe: I heard somewhere HIV medicine actual helps against it, so maybe they're in luck, that medicine's going to be worth gold.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1582839905",
			"date_added": 1582841998
		},
		{
			"comment_id": 51,
			"body": "@zeronetpro: That would be appreciated. I'm afraid it's not really at a stage where I'm ready to accept other's contributions, but we'll see how far I can get by May. Depending on how things go with Corona going around I might get a break and focus solely on this project.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1583181539",
			"date_added": 1583797326
		},
		{
			"comment_id": 52,
			"body": "No, not since the early Chinese videos. But if you have any feel free to share.",
			"post_uri": "1C1K4c9VkvmwB8eAsqC9RiukD2qmyuYUXQ_1583994094",
			"date_added": 1584012782
		},
		{
			"comment_id": 53,
			"body": "Are people vaccinated against it?\nHow often do unvaccinated people experience ADE from Dengue by your knowledge?\nAre there cases of vaccinated people experiencing ADE from Dengue by your knowledge?",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1583977827",
			"date_added": 1584012995
		},
		{
			"comment_id": 54,
			"body": "@Aassddff \n🇧🇷\n👑 Σ: ADE (Antibody Dependent Enhancement) occurs when the bonding of antibodies on a virus \"enhances\" the virus, allowing it to bond with receptors it wasn't capable of bonding with before, or improving it's chances of bonding with specific receptors. Dengue is best known for this, in some cases the immune response actually helps the virus spread faster. In SARS and MERS (close family of the current COVID-19/SARS-ncov2/Wuflu whatever you wish to call it) this was also observed.\nADE makes it much more difficult to produce a vaccine because a badly made vaccine actually risks helping the virus because it could push the immune system to produce these virus enhancing antibodies.\nThere is reason to believe the current outbreak could benefit from this as well. If so, I doubt we'll see a vaccine any time soon.",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1583977827",
			"date_added": 1584026370
		},
		{
			"comment_id": 55,
			"body": "@Xplosive: Should probably get extended within a couple of days, in the meantime check out some other sites :-)\nWhen I'm done with zerunet I'll start experimenting with solutions to a lot of the small annoyances such as allowed space limits.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1584312726",
			"date_added": 1584356937
		},
		{
			"comment_id": 56,
			"body": "@SSDifnskdjfnsdjk: thank you for reporting, will look into that\nEDIT: found it, this looks to be a bug that can occur if the site is loaded before the product list has been downloaded, if you reload the page it should be fine. Will fix so other people who visit for the first time don't experience that.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1584894236",
			"date_added": 1584900857
		},
		{
			"comment_id": 57,
			"body": "@styromaniac@zeroid.bit: what does that do exactly?",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1584894236",
			"date_added": 1584901413
		},
		{
			"comment_id": 58,
			"body": "@styromaniac@zeroid.bit: ok, I added it, let me know whether it works",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1584894236",
			"date_added": 1584907147
		},
		{
			"comment_id": 59,
			"body": "@styromaniac@zeroid.bit: >there's no reason it wouldn't\nYou underestimate my ability to introduce bugs :-)\n@nekololi: wait until I add the ability to attach images to products ;-p",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1584894236",
			"date_added": 1584911117
		},
		{
			"comment_id": 60,
			"body": "@SSDifnskdjfnsdjk: I will resume work on ZeroMarket this evening/tomorrow, I'll look into it then. When the decision was made to not take it into product yet on Monday I continued working on it. I added some testing features for switching between guest/admin mode that may not be working correctly or just lack explanation.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1584894236",
			"date_added": 1585312181
		},
		{
			"comment_id": 61,
			"body": "Your space should get extended automatically if it's near limit for a while.",
			"post_uri": "1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS_1588458571",
			"date_added": 1588463809
		},
		{
			"comment_id": 62,
			"body": "Keep exploring :-)",
			"post_uri": "1PHArszbKFgyrXJybYqtNsdespm1UzaAud_1588668205",
			"date_added": 1588674796
		},
		{
			"comment_id": 63,
			"body": "@Mg0: Thank you for the heads up. I have him blocked. I was very supportive of his ideas last summer (I even wrote an entire blog post that culminated in my appraisal of his IPZN project), but since then I've come to realize that every conversation I've had with him has resulted in nothing but lost time on my part. Internet drama is bad for everyone involved so I avoid engaging in any. I suggest he do the same and work on his dream project(s) instead of expecting others to do so for him. If/when he has something to show I will unblock him.",
			"post_uri": "1PHArszbKFgyrXJybYqtNsdespm1UzaAud_1588668205",
			"date_added": 1588782983
		},
		{
			"comment_id": 64,
			"body": "@Sirlotaplot: I've got a WIP branch for it that kinda works, but it's more work than I expected. I will probably have to rework the page/chapter navigation a bit so I can do a clean implementation.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588865108
		},
		{
			"comment_id": 65,
			"body": "@Mg0: Zipped galleries **do not** require downloading the entire file before viewing, only the chunks containing the viewed images have to be downloaded. Although the file explorer and ZeroNet files tab may say a zip takes 100mb, it only takes as much disk space as the chunks you've accessed/downloaded.\n\nYou may need to upgrade to the latest ZeroNet version if you're having trouble, Anoa and me submitted a bugfix for the Zip behavior last week.\n\nDoes this address your concerns?",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588895304
		},
		{
			"comment_id": 66,
			"body": "@Mg0: Yes, I don't really think there's a good way for me to show what pages are hosted. I could show the % of the archive downloaded, and could probably use fileNeed({required: false}) to detect if a file has been downloaded or not, but that would require a separate call for each page so I'd have to combine it with the lazy-load.\nWhat is the reason you want to reconstruct it? I'm might look into whether I can change Rust0gal to reproducibly archive files if that's desired.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588921908
		},
		{
			"comment_id": 67,
			"body": "@Mg0: The mean reason is the number of optional files ballooning. An archived gallery is 5 files if generated using Rust0gal [img.zip, thumbs.zip, manifest.json, content.json, cover], all of which except for content.json and manifest.json can be made optional. The same gallery can be anything from fifty to tens of thousands of optional files.\n\nMangadex has over 40k manga's. Some are hundreds of chapters while other are oneshots, let's just assume most are on the small size and they're on average around 500 optional files, half of which are thumbnails.\n\nThat's **20 million, compared to 80k**.\n(I would be surprised if it's actually that low, IIRC @Sirlotaplot said he already had 2 million files on his hubs, which would mean he's hosting 10% of what Mangadex has. That has to be wrong, right? My estimate must be way too low?)\n\nWhat if you're also subscribed to hubs offering Western comics, fanart, paintings, war posters, magazines, etc. Keep on multiplying that number. Those optional files all have to be stored in content.db, and the bigger that gets the longer ZeroNet will take to start due to SQLite's loading times.\n\nAs for changing files: archives are for exactly that, archiving. **If you're going to be changing the images at a later date you should not use archives**. 1+Gallery and the related GalleryHub will always remain backwards compatible with non-archived galleries. Manifest is not archived so updating description, tags, name, etc. are all fine.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588957480
		},
		{
			"comment_id": 68,
			"body": "It would be interesting if ZeroNet could update Zip files by just requesting the changed files, and then altering the Zip. I don't know enough about Zip to say whether something like that is even possible off-the-cuff, but when I get back to zerunet development I will look into that.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588957880
		},
		{
			"comment_id": 69,
			"body": "@Mg0: Ok, could you tell me what the required arguments for the zip command are?",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588958256
		},
		{
			"comment_id": 70,
			"body": "@Mg0: I've done a quick search online and scrolled through the zip manual and I can't find anything related to stripping creation/modified dates, permissions shouldn't be the problem though. ZeroNet also supports tar.gz, but that's just going to be worse because that does also store the permissions and decompressing a chunk requires previous chunks from what I understand.\n\nI will take a look at that link you posted.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588960905
		},
		{
			"comment_id": 71,
			"body": "@Mg0: I think it's going to require a move away from Zip, and that means it's going to take a while to figure out and develop.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588961125
		},
		{
			"comment_id": 72,
			"body": "@Mg0: Thank you! I will see what I can do with that!",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1588792174",
			"date_added": 1588982826
		},
		{
			"comment_id": 73,
			"body": "Safe is always better than unsafe, but if you can prove that your unsafe cannot panic it's fine to use unsafe.\n\nWait, we're not talking about Rust? My bad :-p",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1589122860",
			"date_added": 1589149168
		},
		{
			"comment_id": 74,
			"body": "You can join multiple hubs and can then switch between them from the three dots next to your username, IIRC (I haven't tried it)",
			"post_uri": "144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY_1589376583",
			"date_added": 1589377876
		},
		{
			"comment_id": 75,
			"body": "@Aassddff ✠ Σ 🇧🇷 👑: I hate how lots of places allow you to make accounts using e-mail, but they then go on to lock your account until you verify using mobile texts, what's the point in allowing e-mail only signup then?",
			"post_uri": "1JfAyi1JV5YaBjNZ9Jfu73TVR9Jeg7H5re_1590085047",
			"date_added": 1590105559
		},
		{
			"comment_id": 76,
			"body": "@Mg0: That's been in 1+Gallery for a week or so, I did indeed forget to mention :-p",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1590186053",
			"date_added": 1590275084
		},
		{
			"comment_id": 77,
			"body": "@Sirlotaplot: Sorry to hear that zipping isn't a solution for you, @Mg0 has also informed me about problems with it. I will see if I can think of any other solutions, it likely won't happen without a plugin or improving the ZeroNet code itself.\n\nAs for the continuous scrolling mode: I've restructured the gallery viewer code in order to facilitate implementing that, but I haven't gotten around to actually doing it. I'll try to find some time for it this week.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1590186053",
			"date_added": 1590390905
		},
		{
			"comment_id": 78,
			"body": "@Sirlotaplot: I've added a setting for continuous scroll that you can test, there's still some bugs that have to be fixed e.g. it doesn't play nice with the bookmarking feature. I'd hoped to fix that yesterday evening but I had a headache and ended up going to bed before dinner. I will work on it tonight though.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1590186053",
			"date_added": 1590480784
		},
		{
			"comment_id": 79,
			"body": "The way ZeroMe works everyone has 50KB available space, after that you either have to have your hub's admin increase your size limit or delete old posts or use another hub. Kaffie has a very high default limit.",
			"post_uri": "1Pzdk2BVXp3LMFBdS6vga5djkgLwQ2BehV_1590504709",
			"date_added": 1590504492
		},
		{
			"comment_id": 80,
			"body": "@ulrichard: The code is public, you can find the links to the Git Center repositories on my profile. ZeruCrypt is finished, ZeroNet Protocol works (but needs optimization and polishing), all of the others are a work-in-progress. I'm currently writing my own tracker to properly test my protocol implementation before I integrate it with the base project.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1591145573",
			"date_added": 1591181870
		},
		{
			"comment_id": 81,
			"body": "The safest way to do it is probably to copy `main.js` and `main.css` from the [demo](/14NFfVBBAFbNdqX4nyGjyBF1BRSz7jn2QP/) over to your hub's directory. The easiest is to use the \"Upgrade Code\" option on ZeroHello, but that will only work if you cloned from the demo hub.\n\nIt's always a good idea to back up your `main.js` and `main.css` first so you can revert if there is any problems.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1590186053",
			"date_added": 1591714094
		},
		{
			"comment_id": 82,
			"body": "The only setting that was available before was the redirect, if you changed that you should go to the settings tab after the update and reset it.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1590186053",
			"date_added": 1591727745
		},
		{
			"comment_id": 83,
			"body": "Je suis d'accord que le comportement des médias est dégoutant, je dirai même qu'ils veulent plus de violence parceque cela leurs fait de l'argent. Mais c'est quand-même indéfensable aussi le comportement des policiers dans le cas de George Floyd et le casier judiciaire n'y change rien qu'il devrait être en prison au pire et non pas mort.\n\nLe cas le plus surprenant était quand Twitter avait suprimé un video par Trump en défense de Floyd et après les médias Américains n'ont eût honte de dire que Trump était resté silencieux.\n\nJ'en ai vraiment marre du mafia de Silicon Valley.",
			"post_uri": "16p5GeaN7icACoKSnL2oKrhHq62qkNyD3_1591793663",
			"date_added": 1591799422
		},
		{
			"comment_id": 84,
			"body": "@SSDifnskdjfnsdjk: A modern browser can easily eat 8GB of RAM with the right browsing habits.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591813380
		},
		{
			"comment_id": 85,
			"body": "Isn't that also a song by Machinae Supremacy? Pretty good if you like metal :-)",
			"post_uri": "15ebtdT12VepdkSH4fX5qkRdXkM5Kpf7t8_1592233537",
			"date_added": 1592292281
		},
		{
			"comment_id": 86,
			"body": "Turns out I'd already added more error handling than I thought, no crashes on unimplemented addresses, no crashes at all so far actually. I will make sure exchanging onion addresses works over the weekend, and do some cleaning in the code, but over all this is encouraging.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1592437167",
			"date_added": 1592585068
		},
		{
			"comment_id": 87,
			"body": "What's the catch?",
			"post_uri": "1EBF1shuPUuqAh9rnr7XLnAzYP42j4o2dW_1592582328",
			"date_added": 1592585098
		},
		{
			"comment_id": 88,
			"body": "@SSDifnskdjfnsdjk: I haven't investigated, but it might not automatically forward onion trackers, I have not encountered any in the wild at least, only ipv4 and ipv6 trackers. What's special about this tracker is that it will also support ZeroNet instances using onionv3, i2pb32 and loki addresses.\n\nAnd theoretically it should also be more efficient, although I still have to benchmark that.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1592849244",
			"date_added": 1592857497
		},
		{
			"comment_id": 89,
			"body": "@SSDifnskdjfnsdjk: the standard zero tracker announce goes something like this:\n```{ ADD: [ipv4, onion], NEED: [ipv4, onion], hashes: [1ADDRESSHASH], onions: [tquaiskvesoti] }```\n\nTranslation: \"Hey Tracker, add me to the ipv4 and onion lists and give me back the ipv4 and onion peers for these hashes, oh and my onions for these hashes are...\"\n\nThe only thing that mine will do differently is that it will also support adding and asking for `[onionv3, i2pb32, loki]`.\n\n- OnionV3 is the new generation of Tor addresses\n- [I2P](https://geti2p.net/en/) is an Anonymous Network Layer, similar to Tor, but it's better for p2p.\n- [LokiNet](https://lokinet.org/) is a blockchain-based alternative to Tor and I2P.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1592849244",
			"date_added": 1592903238
		},
		{
			"comment_id": 90,
			"body": "As someone who doesn't understand much Chinese, where on ZeroNet is the Chinese community active? I don't see many around, so I assume they have their own zites?",
			"post_uri": "1JeTJBQxC7CuQFxijHjjEqKgQnXJhRFF94_1592916464",
			"date_added": 1592939277
		},
		{
			"comment_id": 91,
			"body": "[ZeroNet Documentation](/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1) doesn't have all the information it should, but it's a good place to start.\n\nThere isn't a good way to find good sites that I know of. ZeroSites ranking is biased towards old established sites, some of which have better alternatives and it has also collected a lot of trash over the years. But you can find the [sites that I personally recommend](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/?Post:10:Ansho+Rei+Recommends) on my blog and I think shouting out good sites is the best way to share them!",
			"post_uri": "1CemwjNRNe6WGnRGhNcYdSWk3LQZMxwkba_1593072794",
			"date_added": 1593074852
		},
		{
			"comment_id": 92,
			"body": "I had a fruitful Sunday. Contrary to what scripture prescribes, I worked all day building a chicken coop to protect 20 little chicks from the big bad fox. When the structure was finished the chicks had already fallen asleep so I had to pick them up one by one and place them inside, but I will rest soundly tonight knowing they will live to see another day :-)",
			"post_uri": "1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1593303150",
			"date_added": 1593385201
		},
		{
			"comment_id": 93,
			"body": "Up is always up on a flat earth, unless you live in Australia.",
			"post_uri": "146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf_1594174829",
			"date_added": 1594206731
		},
		{
			"comment_id": 94,
			"body": "I agree :-) though more interoperability between alt-nets would be great i.e. ability to download site via ZeroNet/IPFS/FreeNet/etc. and seeding it to all networks.",
			"post_uri": "146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf_1594175099",
			"date_added": 1594206827
		},
		{
			"comment_id": 95,
			"body": "@ulrichard: From a user's perspective Rust macros are great. I've had a lot of experience with serde and rocket and the amount of work saved by derive macros in particular is priceless.\n\nDiving into writing my own they're on a whole new level. That may just be because I've gotten too comfortable with the kind of Rust I understand. There's a bunch of new syntax to learn, and a couple of libraries like syn and quote and then the hardest part is that I don't know what good macro code should look like.\n\nHere's what happens when your language does not have macros: https://gradha.github.io/articles/2015/01/the-day-go-reinvented-macros.html",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1594121688",
			"date_added": 1594229605
		},
		{
			"comment_id": 96,
			"body": "I've got a prototype running for [zerucrypt](/1M4Wwi5x5RUN1QJoS6CcnQh515FMtRNg1d), but unfortunately I've already hit the first roadblock: the svg images don't update because of browser caching.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1594246061",
			"date_added": 1594248169
		},
		{
			"comment_id": 97,
			"body": "@ulrichard: No, I hadn't heard about that one, but it looks very interesting! Bookmarked.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1594121688",
			"date_added": 1594574440
		},
		{
			"comment_id": 98,
			"body": "I've been thinking this as well :-)",
			"post_uri": "1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL_1594568893",
			"date_added": 1594574505
		},
		{
			"comment_id": 99,
			"body": "@Astrr: I wouldn't want a separate ZeroNet instance running for each app unfortunately.",
			"post_uri": "1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL_1594568893",
			"date_added": 1594667700
		},
		{
			"comment_id": 100,
			"body": "@Astrr: You'd need to have two apps: a base ZeroNet app and then frontend-only apps that tell you to install the base if it is not.",
			"post_uri": "1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL_1594568893",
			"date_added": 1594683128
		},
		{
			"comment_id": 101,
			"body": "@Astrr: if you've got any questions you can always contact me on ZeroMail or Matrix/Riot.\n\n@Realjohndoe: ZeroNet doesn't work with i2p out of the box, and the code handling the connections isn't well structured (it does a lot of `if onion then`), I've already rewritten the protocol and connections in Rust to handle onionv3 and i2p and it could easily be extended to handle more networks. The full ZeroNet implementation is far from ready though.",
			"post_uri": "1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL_1594568893",
			"date_added": 1594825116
		},
		{
			"comment_id": 102,
			"body": "The solution is buying your music in a format that you actually own, not necessarily physical, I buy digital music from bandcamp where you can download as FLAC :-) I then have a Raspi NAS that I can stream from.",
			"post_uri": "1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL_1594842044",
			"date_added": 1594843116
		},
		{
			"comment_id": 103,
			"body": "what do you mean by webapp?",
			"post_uri": "1EeY8m5yksyatyZkftUz6vKsa7MZiyTjP2_1594978127",
			"date_added": 1594996365
		},
		{
			"comment_id": 104,
			"body": "@Hz8112: ZeroMe is not a static website, we are dynamically adding posts to it. 1+Gallery, ZeroTalk, KopyKate, and plenty of others are also not static. Using the PeerMessage some sites are real-time updated like StreamZ (video streaming) and Thunder (IRC-like). GDrive is a bad idea, no one wants to host your random files, so you either need an incentivized network (using crypto) or you need to find a community that is interesting in seeding the content. Otherwise it will be short-lived. Small static sites like blogs survive on ZeroNet because it is more trouble to delete them than to keep seeding them.",
			"post_uri": "1EeY8m5yksyatyZkftUz6vKsa7MZiyTjP2_1594978127",
			"date_added": 1595031989
		},
		{
			"comment_id": 105,
			"body": "Do you mean the network is slow, or just that people aren't very active? The network shouldn't be, there's actually even experimental livestream through ZeroNet, but yeah, it'd be nice if more people posted.",
			"post_uri": "1EeY8m5yksyatyZkftUz6vKsa7MZiyTjP2_1594917923",
			"date_added": 1595032252
		},
		{
			"comment_id": 106,
			"body": "@Realjohndoe: Peers within ZeroNet are recognized by their address, and the address is defined in the python code as either `x.x.x.x`, `x:x:x:x:x:x` or `xyz.onion`, so although you could technically route the clearnet traffic through i2p, you'd still be sharing an address with peers and trackers (and not an onion one, unless you're routing Tor through I2P), losing the anonymity it would offer when used \"natively\". From what I recall I2P isn't designed to have exit nodes so it's not going to be reliable even if it works. We really need to add native I2P support so that it benefits from the same benefits as the ZeroNet over Tor implementation. I've looked into this before and it looks feasible with SAM3, but I'm currently focused on other projects.",
			"post_uri": "1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL_1594568893",
			"date_added": 1595372750
		},
		{
			"comment_id": 107,
			"body": "@Z3r: Best place to ask me these kind of questions would be on Matrix. I believe you're using stable, and this feature is only available on nightly. If you're using rustup you can find more information about this here: [Managing rust versions with rustup](https://doc.rust-lang.org/nightly/edition-guide/rust-2018/rustup-for-managing-rust-versions.html).",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1595335851",
			"date_added": 1595785469
		},
		{
			"comment_id": 108,
			"body": "If you published to other peers your content should still be there when you download the hubs again.",
			"post_uri": "146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf_1595558172",
			"date_added": 1595785613
		},
		{
			"comment_id": 109,
			"body": "@Eltheal: If you recreated your profile on the same hub as before you may have overwritten the data, otherwise it's possible they're still on the other hub.",
			"post_uri": "146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf_1595558172",
			"date_added": 1595796884
		},
		{
			"comment_id": 110,
			"body": "@zeromepro: responded, Matrix is the fastest way to get my attention",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1595785770",
			"date_added": 1597248119
		},
		{
			"comment_id": 111,
			"body": "Looking pretty.",
			"post_uri": "1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2_1597838964",
			"date_added": 1597846355
		},
		{
			"comment_id": 112,
			"body": "@Geekless: True, but this would not work retroactively, only for newly signed `content.json` files.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1598004470",
			"date_added": 1598114285
		},
		{
			"comment_id": 113,
			"body": "@猫叉酱（小号）: that doesn't matter because none of the others are using SHA512 anyway.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1598004470",
			"date_added": 1598365974
		},
		{
			"comment_id": 114,
			"body": "I think people have already mirrored the entirety of Wikipedia on IPFS, but seeing as IPFS doesn't grant anonymity that may not be enough.",
			"post_uri": "13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1599743078",
			"date_added": 1599855860
		},
		{
			"comment_id": 115,
			"body": "@NotTheFishBowl",
			"post_uri": "12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY_1602074613",
			"date_added": 1602082909
		},
		{
			"comment_id": 116,
			"body": "@Mg0: Thank you for your insightful comment on the blog post! I will take time to respond, but I don't yet know when.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1601916571",
			"date_added": 1602438016
		},
		{
			"comment_id": 117,
			"body": "> Embed the safety of the public in system designs, enabling companies to act against illegal content and activity effectively with no reduction to safety [...]\n\nWhat a joke. Either you support encryption or you are against it. There is no \"secure encryption, but we should be able to break it whenever we want\".",
			"post_uri": "1G7yH3iZyr6CQY5NG2YcXCKmkbfXz83h1w_1602464839",
			"date_added": 1602574260
		},
		{
			"comment_id": 118,
			"body": "@Notime: Yes. On top of that criminals will have an absolute field day when they figure out how to abuse the \"secure\" backdoor. Or when some rogue agent at a company or department sells information about the backdoor.",
			"post_uri": "1G7yH3iZyr6CQY5NG2YcXCKmkbfXz83h1w_1602464839",
			"date_added": 1602669741
		},
		{
			"comment_id": 119,
			"body": "Now I'm curious what the image is.",
			"post_uri": "17KJTfEhSfdJHgyCqvjD4yMVU1a55bcrs8_1602588056",
			"date_added": 1602706110
		},
		{
			"comment_id": 120,
			"body": "You can also [try the demo here on my blog](/13T79X7tG8Fi3EZCev3xU1wYTtFHHnqWGQ/data/wasm/oxygengine-pokemon/). The only downside is the ZeroNet button in the top-right corner, would be nice if there was a way to disable that.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1603398568",
			"date_added": 1603403531
		},
		{
			"comment_id": 121,
			"body": "I can confirm that the demo even works on the Tor Browser ... kinda. There's a noticeable performance hit, but still happy to find this out.",
			"post_uri": "1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS_1603398568",
			"date_added": 1603710240
		},
		{
			"comment_id": 122,
			"body": "You might want to tell people what your site is about, people often don't click random links.",
			"post_uri": "1HQedZKCLnU1C5XjNAV1no34wSZWcAeWUU_1603634393",
			"date_added": 1603710686
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1CURUEzG3RXRZXS9pRgpt3x9Fi4DsN2ZD1",
			"user_name": "Helblindi",
			"date_added": 1564783057
		},
		{
			"follow_id": 2,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK",
			"user_name": "blurHY",
			"date_added": 1564836790
		},
		{
			"follow_id": 3,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1564838234
		},
		{
			"follow_id": 4,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di",
			"user_name": "Git Center",
			"date_added": 1564838238
		},
		{
			"follow_id": 5,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1564838243
		},
		{
			"follow_id": 6,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz",
			"user_name": "Port220irq5dma1",
			"date_added": 1565357164
		},
		{
			"follow_id": 7,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ",
			"user_name": "P2P",
			"date_added": 1565442539
		},
		{
			"follow_id": 8,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE",
			"user_name": "caryoscelus",
			"date_added": 1565546631
		},
		{
			"follow_id": 9,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n",
			"user_name": "Crazylime",
			"date_added": 1566085513
		},
		{
			"follow_id": 10,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ",
			"user_name": "ulrichard",
			"date_added": 1566400196
		},
		{
			"follow_id": 11,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC",
			"user_name": "Saintian",
			"date_added": 1570212239
		},
		{
			"follow_id": 12,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ",
			"user_name": "Wanditoast",
			"date_added": 1571224433
		},
		{
			"follow_id": 13,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd",
			"user_name": "Styromaniac",
			"date_added": 1574808981
		},
		{
			"follow_id": 14,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4",
			"user_name": "Lianna",
			"date_added": 1575151354
		},
		{
			"follow_id": 15,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7",
			"user_name": "Clearnet is Bad",
			"date_added": 1576427033
		},
		{
			"follow_id": 16,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS",
			"user_name": "SSDifnskdjfnsdjk",
			"date_added": 1576428465
		},
		{
			"follow_id": 17,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ",
			"user_name": "GomZik",
			"date_added": 1577316393
		},
		{
			"follow_id": 18,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "184rhnxM89SU1gDuPEaQPjynfytkRtSEVd",
			"user_name": "Topnet",
			"date_added": 1577399187
		},
		{
			"follow_id": 19,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K",
			"user_name": "Thunder",
			"date_added": 1584147801
		},
		{
			"follow_id": 20,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm",
			"user_name": "lavaphox",
			"date_added": 1585698744
		},
		{
			"follow_id": 21,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "18fLf6bqfzvGLvMA2DrEmDxiqvnAWyN6dv",
			"user_name": "空澄砂夜",
			"date_added": 1588385390
		},
		{
			"follow_id": 22,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj",
			"user_name": "ZeroLSTN",
			"date_added": 1588431225
		},
		{
			"follow_id": 23,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4",
			"user_name": "Geekless",
			"date_added": 1591226752
		},
		{
			"follow_id": 24,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD",
			"user_name": "Mkg20001",
			"date_added": 1591226812
		},
		{
			"follow_id": 25,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi",
			"user_name": "Eibriel",
			"date_added": 1595498040
		},
		{
			"follow_id": 26,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71",
			"user_name": "zeromepro",
			"date_added": 1601733402
		},
		{
			"follow_id": 27,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "17vG5C1mYW8hhP9Lotauao1tAWpbMbPQiw",
			"user_name": "eyenx",
			"date_added": 1602060719
		}
	]
}