{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Ajuda com a ZeroNet no Manjaro Linux - Resolvido",
			"body": "Olá falantes da lingua portuguêsa, preciso de uma luz.\nEstou tentando acessar a ZeroNet com o For ativado, porém, não consigo fazer isso sem ter que entra no terminal como root.\nGostaria de fazer rodar a ZeroNet direto com o Tor sempre q precisar entrar em terminal nem nada só clicar em um ícone. Alquém tem uma luz ?! Agradeço a sua leitura.",
			"added": 1535316227
		}
	],
	"topic_vote": {
		"1_1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK": 1,
		"1_1PCYHhrL3dQCiB3cSHU2xk2M7rKk7Y6mUd": 1,
		"1_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"73_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"2_1JhUUAX5XGxPzMvEcGsiMTpKZ44rg2F4tQ": 1,
		"1_1JhUUAX5XGxPzMvEcGsiMTpKZ44rg2F4tQ": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK": [
			{
				"comment_id": 1,
				"body": "> [marionunes](#comment_2_1JsNmMgnbw85F25Drfg5YQ3Zdai6pyvHLd): Não sei quanto a essa versão que você utiliza, mas o normal é instalar o tor, deixa-lo rodando, há uma pequena alteração num arquivo de configuração do tor para que o Zeronet consiga por ele mesmo publicar portas e rotear informações pela rede Tor.\n> Proceda da seguinte forma.\n> apt install tormcedit /etc/tor/torrcRemova o caracter # das linhas ControlPort 9051 e CookieAuthentication 1 (line ~57)\n> /etc/init.d/tor restart\n> Execute o comando usermod -a -G debian-tor [seuusuario]\n> Logout/Login com seu usuário e tente novamente acessar a Zeronet.\n\nObrigado pela dica mas já tinha seguido esse passos na pagina de documentação do projeto e não deu resultado porém achei essse post ( https://github.com/HelloZeroNet/ZeroNet/issues/1440 ) do github em que outra pessoa apresentava o mesmo problema. E era porque o tutorial da documentação estava incompleto, faltava mais algumas edições no arquivo torrc. Agora está tudo certo obrigado pela ajuda.",
				"added": 1535343984
			}
		],
		"1_1xm3wUZda9fxCaKUSgkNCvHrwBPnLS6ni": [
			{
				"comment_id": 2,
				"body": "#0books\n [Começando com o Linux - Comandos, serviços e administração - Casa do Codigo](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1DP9XK8Dt78S274fGkH7M6jhoQjmwQfEPK/Comeando%20com%20o%20Linux%20-%20Comandos,%20servios%20e%20administrao%20-%20Casa%20do%20Codigo.pdf)",
				"added": 1536347140
			}
		],
		"2_1CcSAqVEXCdPyYKP4d7JHeCFxBB4bt7jtM": [
			{
				"comment_id": 3,
				"body": "já cheguei a usar a Demonsaw porém a comunidade não me parece tão ativa, principalmente no Brasil.\nAté onde eu pesquisei não encontrei comunidades brasileiras em torno desse projeto, o que é uma pena.",
				"added": 1567883541
			}
		]
	},
	"comment_vote": {}
}