{
	"next_topic_id": 4,
	"topics": [
		{
			"topic_id": 2,
			"title": "[Troll post] ZERONET IS NOTHING BUT A JS SHIT",
			"body": "~~IT CAN NEVER BE USED FOR DARKNET STUFF~~\n\nThis username was logged in http://zero.shaknaisrael.com:43110.  I'm not sure if it was the owner of the juicicoo account that posted this or someone else using his proxy.  Either way, there should be a log out button :)",
			"added": 1426400991
		},
		{
			"topic_id": 3,
			"title": "ZN sucks like hell cuz it needs 2 run JS.",
			"body": "Totally Darknet Unfriendly Fuck",
			"added": 1426850292
		}
	],
	"next_message_id": 14,
	"comments": {
		"1@13": [
			{
				"comment_id": 1,
				"body": "Decentralized Wiki/Site directory with voting on the links/contents!",
				"added": 1424143641
			}
		],
		"3@2": [
			{
				"comment_id": 2,
				"body": "Use over tor?",
				"added": 1424143775
			},
			{
				"comment_id": 4,
				"body": "Thanks nofish! \nAre user ids on zerotalk permanent (multiple users with same I'd possible?)? Is a reset available? Does my IP link to the user name? A possible privacy/anon concern? If it is linked to my IP, could it be transferred over to be used from another IP?",
				"added": 1424925363
			},
			{
				"comment_id": 5,
				"body": "Another thing, would a file upload site be viable? Perhaps as a distributed Dropbox/cloud (private or public) solution or something?",
				"added": 1424925996
			},
			{
				"comment_id": 6,
				"body": "Is there something that can be done to improve the proxy usage? ie clicking on a localhost link while using the zeroproxy leads to the localhost link, instead of being proxied.",
				"added": 1424926302
			},
			{
				"comment_id": 7,
				"body": "Thanks for the responses guys!\n\nInterestingly enough, I guess that btc address is stored on the proxy server for me. I suppose resetting the name is as easy as deleting the file? I'm interested in the sc for the proxy now.. Time to dig in.",
				"added": 1425015451
			}
		],
		"1@6": [
			{
				"comment_id": 3,
				"body": "Dark Net Plan Reddit",
				"added": 1424247625
			}
		],
		"2@20": [
			{
				"comment_id": 8,
				"body": "and I can only imagine what this jerk means when he says 'darknet stuff' .\nbtw did the owner of this proxy intentionally leave himself logged into the forum ??",
				"added": 1426455502
			}
		],
		"5@2": [
			{
				"comment_id": 9,
				"body": "> [nofish](#comment_17_2): Topics now also ordered by creation time.\n\nCould there be an option chose sorting? By either creation date, last post, number of comments? And possibly a pinging feature so someone knows when they are responded to.",
				"added": 1426557911
			}
		],
		"3@20": [
			{
				"comment_id": 10,
				"body": "Probably a LE honeypot",
				"added": 1426850445
			},
			{
				"comment_id": 11,
				"body": "Didn't know I only need 2 add the /media in front of the address. L0L\n\nPerhaps you guys can learn something from the decentralized Tox which can be easily torified via Tor's TCP.",
				"added": 1426852660
			},
			{
				"comment_id": 12,
				"body": "BTW, it seems I also need 2 add /index.html at the end of the address.\n\nU guys rock really. ZN is absolutely a huge deal 2 the future of Darknet that needs 2 be decentralized than ever. Especially after the recent Evolution admins' exit scam shit..\n\nOnce ZN is able 2 be torified (e.g. run on Tails), lots of things will never be the same.",
				"added": 1426853998
			},
			{
				"comment_id": 13,
				"body": "Bitmessage can be torified as well. I've managed 2 run both of Bitmessage & Tox on Tails/Whonix.",
				"added": 1426860020
			}
		]
	},
	"comment_votes": {}
}