{
	"posts": [
		{
			"id": "86d8e11d-87bf-453f-a4d5-38f1675c7c30",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "39ed84b5-63f4-41c1-9499-a7e9901006c5",
			"body": "Yes? I am right now.\nJust do full device VPN tor with orbot, and run the zeronet client for android.\nZeronet client will say you're not using tor, but go to whatismyip and check yourself, you're good.\nThis isn't rocket science.\nPs: I've been a zeronet fan since it's invention and holy fuck you guys just made it 100x faster than ever.",
			"time": 1565171869985,
			"files": "[]"
		},
		{
			"id": "559c905f-af2a-4bfd-a8f0-9ffdd98abbf9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": "I know many of you think phone posting sucks, but it's a great way to get more anons on boards.\n\nZeronet and tor work just fine on phones and my God, anons, zeronet has never been faster.\n\nToday is the proof that p2p uncensorable websites actually fucking works and a ddos attack would actually speed the network up, it's hilarious. \n\nThis zite, even in tor, is faster than 8ch on clearnet was for me.\n\nI'm impressed as fuck.\n\nRun orbot tor with full device VPN and run zeronet client on a good browser with anti fingerprint.\n\nOrfox and zeronet don't play super nice but your ass isnt hanging out on full device VPN anyway.\n\nGodspeed, warriors of free speech. I think far too many people are misunderstanding our plight.  We have opinions and want to discuss them. The reason insane murderous people post in places like this is because we're unfiltered. \n\nMost of us still think they're faggots.\n\n",
			"time": 1565173252088,
			"files": "[{\"name\":\"Dnq9jC5U0AEFUM8.jpeg\",\"thumb\":\"6956e0aa43d7d760af3bed2e58ae8f4cbe09326e-thumb.jpg\",\"size\":111064,\"type\":\"image/jpeg\",\"original\":\"0ca13c42a6eaca853c64d283c737906dc0540880.jpg\",\"directory\":\"1MCx1sZXzZ6noVbi6ETSWZZKR3w5a819cZ\"}]"
		},
		{
			"id": "cc97454e-6770-4b09-b296-3462821f0b37",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>ed2cfb31-1f51-4814-bb2e-6bf9a1e87eb4\nWho are you replying to?",
			"time": 1565173729347,
			"files": "[]"
		},
		{
			"id": "970c308e-02a8-474a-91cc-8dab467b65f1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a88b135c-69cd-44aa-a1b0-24d9597a75af",
			"body": "Zerotalk is a reddit like site and it's a default zite",
			"time": 1565174317861,
			"files": "[]"
		},
		{
			"id": "95a91b91-0847-45e1-a9ff-6435d1ba0787",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>32b37b9c-03e6-4b97-a7e1-6875206f7c52\nWe already have webtorrent video sites, newfag.\nWe've had an uncensorable popcorntime clone for -years -now, 0play.\nWelcome to the party.\n>>870e59c8-4214-4669-8d69-b29390f2d193\nMany of the things you are saying are nonsense. The zite requires a private key to update the back end.\nYou could fork it and update it yourself but then you have a new zite. You can't just \"greasemonkey\" or bullshit like that. The zite owner would have to accept connections from your fork.\nJust make suggestions in the sticky, not here.\n",
			"time": 1565175658601,
			"files": "[]"
		},
		{
			"id": "d0a10661-cba4-4163-9cf8-982d6a62b4f4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>24d31333-4b4a-4563-95ac-032c76a278bf\nAgain, you can add your own shit and make yourself a 4chanx like extension if you want, sure.\nBut you have to submit to the site with the same hash checked scripts since everything is private public key checked to prevent tampering. \nYou can give yourself more power user features but you can't change the flaws in the Zite with your own spitshine. \nWhy not just fork the zite and do some real changes?\n\nI've been a millchan 0chan user for years now, as slow as it is, and some of us are surprised you didn't go there, but at the same time I get it, many of us are cryptoanarchists and lainposters.\nThis influx of newfags is super entertaining, and it will be good for the network. \n\nPs, i2p is not inherently better.  Zeronet's performance works just like it.\n\n3 days ago all of zeronet was slow as fucking balls, now it's literally faster than clearnet. Thanks for that, indexing speed is godlike now.\n>>3ecc3f57-bbbf-4bb3-8f93-3d763f90471d\nIt's a -little- encrypted.\nAll it shows is peer to peer traffic torrent like traffic and you'll be a member of that peer list, whatever your ip appearance is to the network.  A trusted VPN is therefore technically as secure as tor for zeronet traffic. I reccomend just running tor as a full device VPN, and enabling tor in zeroconfig but not setting it to always. That way you get both clearnet idoits and tor seeds but you're behind tor yourself via vpn/proxy. \nIt's been real fast in the last 24 hours.\n",
			"time": 1565177041951,
			"files": "[]"
		},
		{
			"id": "25e0b994-1fe8-4a0f-95cd-9e409e945ccc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>724385e9-741b-49e2-8804-7e92f006d749\nBy trusted VPN I mean a VPN you personally trust, and then maybe also connect to that through tor.\nZeronet is a trust net.\nIf you connect to it over the clear without a vpn/proxy you share your ip and everything you access with your closest peers.\nYou can see your peers and the best guess physical location right in zeroconfig, that part is no secret.\nYou have to be on the network and accessing the same content to know what that content is, but that's as far as it goes.\nIt also piggybacks on bitcoin's blockchain for indexing so we need that working too, though that likely won't be an issue until the end of time.\nAs long as literally one bootstrap method exists we are eternally here.\nWelcome anyways, hopefully we can greenpill some people to this side of the web. We've always been here, we just don't get many visitors.\nThere's a lot of similar darknet apps like twister and secure scuttlebutt protocol stuff too. Ipfs is starting to make things like thst more viable without basic user hosted storage. If enough of you put the hours in, a binary and apk for the entire system could be user friendly for anyone to use.\nI would also love the ability to build local trustnets and meshnets with fellow anons that don't require a direct connection to a subscription ISP too.\nThere's enough free wifi around these days to build free and fast relays.",
			"time": 1565178170590,
			"files": "[]"
		},
		{
			"id": "a82f274b-91db-4a55-b8ea-6a86403d9efd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>d0169130-1327-425b-aae4-00211b2aec89\nIkr\nZeronet IS A CLEARNET TRUSTNET WITH NO TUMBLING OR IP OBFUSCATION.\nUnless your connecting ip is obfuscated behind tor or a VPN or both, your ass is hanging out of the network, so don't be stupid.\n\nIt's very easy to protect your identity unless you want to seed. Change your identity on zeroconfig every once and a while and you can even full device VPN on tor using something like orbot on android even. \n\nThat being said zeronet is also a bit of a privacy leak for tor itself.",
			"time": 1565178391031,
			"files": "[]"
		},
		{
			"id": "5fe6b1c6-91dd-4b1b-a483-d0e46f8c4630",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>dd377f66-61ae-4b0b-b072-663408bc8e26\nIf you're on tor and seeding a zite, you're seeding and leeching from a hidden service, technically, because you yourself are one. Everyone here is a client and server.\nIf you have zeronet configured to only use tor, everyone you connect to is on tor.\nIf you're set to allow onion and clear connections, you're technically BOTH and connecting to both.\nIf your whole device is using something like orbot for android and routing ALL traffic to a full device tor VPN, even though zeronet thinks you're not on tor, you are. Plus now clearnet is seeding you too. But you're behind tor, so it doesn't matter.\nAlso most ISP doesn't care that you're using tor. Many clearnet sites have tor iframes so people can browse tor without installing software.\nIt's not as open ended as you, or as scary as you think.\nEasy way to deal with the nefarious files problem is to simply destroy your cache when you're done, or run the cache on a ram drive.\nIt's bad for the network, though, unless you have active peers.",
			"time": 1565178996588,
			"files": "[]"
		},
		{
			"id": "fa459840-c9eb-463d-8ce9-b318cbf3f2b3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>2df1594d-4c24-4d25-a165-6ebe9f632dd9\nI mean unless you want to actually be a high uptime seeder of a zite like this one.\nThat being said CAN webseed zites on things like AWS ec2 instances and such or any other web host with shell access. Doesn't need personal browsers. \nYou could stick a solar powered raspberry pi with a headless zeronet config with tor on a public wifi and seed the site for everyone as long as the hardware is physically on. \nThis protocol is surprisingly resistant to censorship in a way that unlike 8ch, there's no head to cut off.\nIt's truly an infinate hydra.\nI'm quite frankly shocked most of you are just figuring this out now.\nI've been deeply concerned about censorship of the web for a long time, over a decade, and i knew this day would come.\n",
			"time": 1565179363238,
			"files": "[]"
		},
		{
			"id": "0583ed84-2ed8-4a66-9069-b1484e28ed2b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>2ea7ca82-0ac8-4ed9-ac4c-ec220c47bb18\nNature of the beast.\nNobody here has a realtime version of the ZITE *say it right newfags!!! Reee* because we're all bitorrenting shit to each other.\nPlus millchan engine has potato development held on with sticks and bubblegum.\nGo help out on github if you believe in this protocol. \nI believe ipfs and ssbp has as much potential and is more anonymous but I'll likely always use both.\nI've been dinking with p2p darknet services since the majority of the world was still on 56k.",
			"time": 1565179832200,
			"files": "[]"
		},
		{
			"id": "5dd66a79-2892-4524-ae8d-fa6fe20952fb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "67107dc8-1cce-4474-9064-f9f47d80e399",
			"body": ">>4bc46a02-cd4c-453f-a529-c69e10b12a09\nIf you run a full system VPN over tor you get to enjoy their speeds to you while also using tor yourself.\nIt's their funeral. \nNot that its really all that bad unless you live in a dysfunctional dystopian police state.\nJust browsing a site on the clearnet and stumbling across cp isn't illegal. Sharing it intentionally is.\nIf you can explain to a jury that everyone here is a seeder and you're honest about it, as long as you haven't intentionally done something to put you in the eyes of the law enforcement you're probably fine.\nI'm just a curious cypherpunk, honestly. ",
			"time": 1565180104276,
			"files": "[]"
		},
		{
			"id": "e0595862-ba88-469e-8606-f0e116c3de0f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0283adaa-1644-4658-8668-91ad653d344a",
			"body": ">>e9dcad69-318a-4eb3-93e2-2d84dc00fa72\nWhite ancestors were tattooed. \nThe celts, the Vikings, and othet northern Clovis and ice age tribes.\nWe brought that tradition to others and they copied us.\nNative Americans said the tall eagles brought them the markings, probably the light haired caucasians who landed there first.\nGfys",
			"time": 1565220008042,
			"files": "[]"
		},
		{
			"id": "53229834-c600-463e-9896-2d0479bd3432",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0283adaa-1644-4658-8668-91ad653d344a",
			"body": ">>8f9b64b9-055d-4638-80c8-a81d97a8b564\nThen you reject the tradition of your ancestors,  kike.\n",
			"time": 1565220229010,
			"files": "[]"
		},
		{
			"id": "9455a22a-9ed8-4d27-ba64-f78e5c97b42c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0283adaa-1644-4658-8668-91ad653d344a",
			"body": "http://siberiantimes.com/culture/others/features/siberian-princess-reveals-her-2500-year-old-tattoos/\n\nStupid fucking kikes think tattoos aren't a white tradition? Wait until you find out about the caucasian people who used to live in what is now known as mainland China. The mummies they dug up are covered in them and have blonde hair and blue eyes.\n",
			"time": 1565220537245,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}