{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Как меня заебали эти псевдо помошники stackoverflow",
			"body": "Сука ибаные тупорылые дауны сука, вот я не понимаю нахуй неужели сука сложно написать готоворе решения и или нормально помочь человеку с его вопросом.\nВсе эти площядки уебанские где сидит одна нерусь stackoverflow которая типо помогает людям на деле нехуя не может помочь. Навыдумывали ебаные правила что нужно конкретный сука код, конкретный сука вопрос. А бля без этого сука не как, даешь вопрос без кода наченают писать что вопрос обширный не соответствует сука правилам и ставят дизлайки. Какие нахуй это помошники, это пидоры а не люди. Спрашиваешь нахуй они это делают а они пишут типо человек не учится если ему сразу скинуть готовое решения. Сука блять а нахуя мне учитсься когда есть много людей которые потратили куча лет на обучения, нахуя мне изучать эти сука сложные алгоритмы вот нахуя мне тратить столько лет что бы понять как это правильно писать. Я не понимаю нахуй что за люди пошли в интернете, нахуя эти правила, вот небыло никаких правил никогда, все писали обширные вопросы помогали друг другу, а сейчас сука на тебе правила блять придумали, ЕБАНУЦА!!! Сука правила нам нахуй не хватало, а как же мы бля без правил сука жили, теперь нахуй даже матерится нельзя забанят, неправильно задашь вопрос заменусуют нахуй и удалять сообщения, а если 2 раза задашь не так так вообще аккаунт удалять в пизду. Регестрируешься заного а тебе пишут вы лох новичек писать не можете, ахуенно блять!\nВот обьясните мне ктонибудь правильно они поступают почему нахуй нельзя помогать всем подряд без ебаный правил, если не хочешь не отвичай кто то другой поможет у кого настроение есть. Но бля нахуя придумывать это все и всех под свою дудку тащить. Ебаные администраторы модераторы нахуй надеюсь они там вымрут нахуй все и их ебаный проект закроется в пизду и что бы блять сдохли они там все, меня реально бесит этот ебаный уебешьный сайт stackoverflow надеюсь его нахуй удалять с интернета а фирма обонкротица вместе с их админестрацией и модераторами. А пидр который придумал правила сдохнет от чумы.",
			"added": 1562862050
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_1MGvRSZ8W9qJZgrQ6yJmwCfHWdfBA9hYrQ": [
			{
				"comment_id": 1,
				"body": "И тебе привет ебасосина",
				"added": 1562862307
			}
		],
		"1_1BkKy5cCZuUqCCeUQgGG74HM6U6ArJpfnt": [
			{
				"comment_id": 2,
				"body": "> [bck](#comment_10_1DxGigTCBo6WXFTBNdktErhmnbq3vfMvJB): так не пользуйся и пиши всё сам или если не хватает мозгов, то плати деньги за обучение. В интернете тебе никто ничем не обязан\n\nДа иди ты нахуй долбаеб, ежу бля понятно что никто ничем не обязан, я говорю про то что нахуя блокировать.\nМеня ебет что неустраивает администрацию, а ты видать вообще дебил нехуя не понял о чем я писал.",
				"added": 1562875215
			}
		]
	},
	"comment_vote": {}
}