{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1627203485,
			"title": "Should PLA liberate the Fidji's?",
			"body": "I saw that the google founders (and traitors to mankind) have evicted the natives and are hiding there... I would find so funny to dispatch the 1st naval combat group in the area and pass over their shitty hideout mach speed max at the closed ground possible to blast their whole windows complex, just before a nice storm, and just after the first passage, full hardware electronic attack using an old nsa tool, to burn their gears, to then land and maybe capture them to trade them against meng... hehehehe. or not, just black site inner mongolia, those hell spawns, must die.\nahahahha.\nI can't wait to see the pla railguns in action :) space force better fasten their spacesuit...\nand taiwan... and taiwan...  I won't say more, but a jap, should have STFU and apologized bowing so low the ground would sink by his shame and remorse, which he didn't... \nthere will be consequences.\nliberation > fidji proposal /on.",
			"added": 1627203484
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 1,
				"body": "On the 31.7.2021 the Putin fan's club is officially deleted.\nReason : putin failed.\nPutin had one mission : protect russian women.\nproof of failure : https://www.bitchute.com/video/8igTQdzyy6it/\n(Russian girl regrets getting the poison injection from Sputnik V!)\nAs such if the man leaves his post for one day for geneva, and the same day the mayor of moscow instaure the diktat and nothing is being done to resolve terminally the situation before the 31.7.2021, there will be no choice but to terminate terminally the putin fan's club.\nthe fastest option is the public assassination of the mayor of moscow, to retablish order and liberty inside the russian federation. \nOtherwise it will be considered as fallen, hopeless, and putrid.\nthe consequences will be terrible for those involved in this abject treason.",
				"added": 1627202517
			}
		],
		"1618427843_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 2,
				"body": "Dear Talibans,\nSeeing the recovery of the territory, specially first the food producing area, the combat determination, and as you know, as the will of Allah will lead here is my problem or proposal:\nwe need a transport corridor from china to pakistan through afghanistan 200m wide.\nwe wish to first take the actual \"roads\", blast tunnels open to short cut all dangerous terrain (safe for you as easy to blow)\nwe wish then, in milimetric concertation with the local farmers and owners, to use a 200m wide band to link each of the tunnels (without yours, and the one of the owner full support we won't be able to maintain it)\nthen once in progress, to move every 100, 200km a modern air defense system manned by us, defended by you, so that this massive investment in progress could be realized sustainably.\nit will of course change dramatically afghanistan.\nHowever it's a proposal, for you to discuss.\nat first just a modernized road, then highway, trains, maglev and more. 200m is reasonnable for us to be able to pack it all. \nFurthermore we wish that all the river and flash fooding area be done by bridges, and as much as possible above the agricultural capable land.\nthere are benefits, there are costs.\nyou are master of it.\nps plz kill all the americans and their contractors, they are childrapists motherfucker kuffars traitors nolives... aka inhumans, soon but safely and securly, but ALL. 0 survivors (aka they must not be able to flee by the air) and if you think about it with the integrated air defense system along the Afghani corridor those hellspawns won't ever be able to fly over you again, guaranteed. \nit's a full package.\nlong live the talibans and the ccp !\nps2 seen the \"golden\" girls? 10m gun, sword... sportspeople, nothing compared to PLA front lines :).",
				"added": 1627202937
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 3,
				"body": "ahahah 3rd boosters kiddies? ahhahah... remember IDF fall, you are on your own :). ahhh what a plan so does the pfizer fuck the immunity long term and makes you lose mastery of your immune system and dependent on booster shot? ahahhaha... epic fail in progress, can't wait to see the \"judaic justice\" applied to those responsible... or not, will see... if the zioMASONIC part or what ever this kuffar plan call itself succeed in taking you out. bashar brigades, are combat ready, trained, experienced, and no alone in the wide islamic world :D.\npressure pressure... \na crazy project, the alayaha... 70 years already? not even a war warm up in the islamic world :).",
				"added": 1627203208
			}
		]
	},
	"comment_vote": {}
}