{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1601382291,
			"title": "Inception movie on IFS!",
			"body": "http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1AvKHsDLDzwhNyzdUzktZMiS816sxMcg1n_item_83+type:video\n\nNew movie on IFS! i used this to test a new ffmpeg command that should give better quality videos and fix a problem that occurs expecially converting Full HD movies (the final video resolution was'nt defined in the previous command, because of this very often output videos quality was bad converting full HD videos)\n\nThis is the new command:\n\n-f mp4 -b:v 400k -s 352x240 -r 25 -aspect 16:9 -vcodec libx264 -b:a 56k -acodec aac -movflags faststart \n\ni also changed the frame rate from 30 to 25 fps (this should improve quality) and audio bitrate from 80 to 56 kbps (this should allow to create smaller files without significant loss of audio quality)\n\nIf you don't want to use the command line a good GUI for ffmpeg is MystiQ: \n\nhttps://www.pling.com/p/1340589/\n\nhttps://github.com/swl-x/MystiQ",
			"added": 1601382290
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1600902116_1A2q7qJ8xFsE2p1sdzkN87rQQx5Hdkdppx": [
			{
				"comment_id": 1,
				"body": "If you are a team dedicated to torrents why don't try IFS ? is 100% anonymous (because it run in the zeronet network and it can use TOR). Maybe you can publish your files on IFS and also in the bittorrent network (publishing the magnet urls in zites like zerotorrent, in this way the zeronet network will have some benefit and also you will have more visibility and an emergency place to be used if you must escape from clearnet). I you want to to this call me:\n\nIFS: http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/\n\nzerotorrent: http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3",
				"added": 1600939264
			},
			{
				"comment_id": 3,
				"body": "> [mider9](#comment_1_14JBuhWmQJe8GP1roMMqVWDFwzUBftP8eK): IFS is way too slow. Impossible to share movies with this.\n\nof course IFS is not suitable for HD movies, but high compressed ones can be streamed and if you  create a .zip with the movies inside the file can be shared easily without streaming.\n\nexample: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597083511_14ADWoY886HnM8jPeipXarxAfyQANiMTQj\n\nI don't tell you to stream movies ONLY in IFS, i'm telling you to create your torrents and share magnet URL on clearnet (in your official site) and in zerotorrent (in this way if you clearnet site will be forced to close your community still alive here). In this way also the zeronet community will see and seed them easily (many here can't go to clearnet)\n\nIf you will create also low definition copies of your torrent we are very pleased if you share also on IFS! My seedbox will provide a permanent seed for them and without any cost for you. In this way this network can grow  (with advantages for us and for you). Also people that can't use clearnet torrents (example chinese) will thank your team!",
				"added": 1600942423
			}
		],
		"1600938682_1HWappq1u9E879YHcrSH8kZjcrzBxwwn65": [
			{
				"comment_id": 2,
				"body": "i can try to search these books and put them on IFS\n\nEDIT: i found some books and uploaded them on ifs!",
				"added": 1600939413
			}
		],
		"1601116187_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 4,
				"body": "im' seeding my files on IFS and i created a seedbox for this task. You should download and stream almost all easily!\n\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/",
				"added": 1601197632
			}
		],
		"1602432068_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 5,
				"body": "i can see this. could you upload it on IFS? (if this is a vid use these instructions, start compression using a max 720p file or the result will be poor): http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1601382291_12C4ypkzVhDg4g8xjS8DARB1LcFTauXcXN",
				"added": 1602567980
			}
		],
		"1601382291_12C4ypkzVhDg4g8xjS8DARB1LcFTauXcXN": [
			{
				"comment_id": 6,
				"body": "i saw that by using a fullHD (1080p) or higher resolution as input file the result will be very poor. i suggest to convert max 720p files with this instructions to obtain good results",
				"added": 1602568080
			},
			{
				"comment_id": 8,
				"body": "> [griefingitalia](#comment_1_1GiGAaP11CvM4XWGHxqtHixfbJyUQTUH6x): @musicz4 in some scenes by using a bitrate of 400 kbps the video quality is very bad. I created my last videos by increasing this parameter to 450 and the quality improved without increasing the file size too much. Check my last videos! [...]\n\nThanks for the advice! I will use this in my next videos!",
				"added": 1602743711
			}
		],
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 7,
				"body": "> [j4s0f](#comment_9_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ): Just upload the largest file you can think of to test zeronet. Maybe also Forest Gump\n\nThere are the 3 movies of The Lord Of Rings Extended edition. All works perfectly on IFS!\n\nThe Lord of the Rings - the Fellowship of the Ring (750 MB): http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1AvKHsDLDzwhNyzdUzktZMiS816sxMcg1n_item_241+type:video\n\nThe Lord of the Rings -The Two Towers (773 MB): http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1AvKHsDLDzwhNyzdUzktZMiS816sxMcg1n_item_242+type:video\n\nThe Lord of the Rings - The Return of the King  (868 MB): http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1AvKHsDLDzwhNyzdUzktZMiS816sxMcg1n_item_243+type:video\n\nActually my dedicated seedbox can help to stream almost any video files created with my settings (also longer ones like this, with the limit of 1 GB). In my opinion all zeronet file sharing zites actually can work as well as bittorrent for downloading and streaming audio/video, with the advantages of a community that can't be censored and the TOR network;  but some seedboxes must be used  to keep the files online, expecially newer ones (in a similar way than bittorrent network).  In my opinion simple file sharing actually works on IFS also without any seedbox and also for larger files.\n\nnot mine example (6 GB, actually 8 seeds online and working by using  TOR network): http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_1PmagXPm9EpReQTJrrsgBYignpgeGzCrZ6_item_21+type:archive",
				"added": 1602595176
			}
		],
		"1603487223_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 9,
				"body": "my seedbox is seeding this!",
				"added": 1603517693
			}
		],
		"1591525925_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 10,
				"body": "> [bats](#comment_39_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): @musicz @musicz4 @musicz5 Are you still doing requests? If yes, I'd appreciate (and seed) uploads of Mr. Stitch from 1995 and also Mr. Frost from 1990.\n\nok. i will search and publish also these movies",
				"added": 1604563295
			},
			{
				"comment_id": 11,
				"body": "> [bats](#comment_39_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): @musicz @musicz4 @musicz5 Are you still doing requests? If yes, I'd appreciate (and seed) uploads of Mr. Stitch from 1995 and also Mr. Frost from 1990.\n\nMr Frost 1990:  http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_17MmT5Gr5cN1t3FzJdE2fsr68pXvHsQzBU_item_4+type:video\n\nMr Stitch 1995: http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_17MmT5Gr5cN1t3FzJdE2fsr68pXvHsQzBU_item_3+type:video",
				"added": 1604607970
			}
		],
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": [
			{
				"comment_id": 12,
				"body": "> [sudoroot64](#comment_20_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG): I propose each tuber self host, or pay someone else to.\n\nMy seedbox is seeding any vid uploaded on IFS :)\n\nPlease only convert them by using ffmpeg (or its GUI MistiQ) with this command to allow a more efficient streaming:\n\n-f mp4 -b:v 450k -s 352x240 -r 25 -aspect 16:9 -vcodec libx264 -b:a 56k -acodec aac -movflags faststart",
				"added": 1605523562
			}
		]
	},
	"comment_vote": {}
}