{
  "title": "国外新闻速递",
  "description": "转载国外新闻",
  "links": "- [Source code](https://github.com/HelloZeroNet)",
  "next_post_id": 186,
  "demo": false,
  "modified": 1461105192.125,
  "post": [
    {
      "post_id": 185,
      "title": "DW 希拉里幕僚涉巴拿马文件",
      "date_published": 1460972100,
      "body": "\n<p>\n（德国之声中文网）据美国报业集团McClatchy报道，在巴拿马文件中，出现了好几个与克林顿家族关系不一般的人的名字，包括比尔和希拉里·克林顿曾经的幕僚和捐赠者。比如希拉里2000年竞选参议员时的财务总管菲亚克霍夫（Gabrielle Fialkoff），以及加拿大采矿企业家吉乌斯特拉（Frank Giustra），他曾向克林顿基金会捐赠三千万美元。</p>\n<p>\n此外，曾在上世纪90年代通过间接途径向民主党捐款的澳门房地产大亨吴立胜（Ng Lap Seng）的名字也在巴拿马文件中出现。有关报道的依据是从巴拿马莫萨克·冯赛卡律师事务所泄露出来的内部文件。</p>\n<p>\n同样参与巴拿马文件调查报道的《南德意志报》记者在对相关原始文件内容进行分析后，未能发现上述人士或克林顿夫妇有不当行为。菲亚克霍夫在接受记者询问时，否认自己在英属维京群岛拥有一家名叫Upac Holding的空壳公司。文件显示，该公司的持股人还包括菲亚克霍夫的兄弟和她已经去世的父亲。此外该公司是2012年才注册成立的，而希拉里竞选参议员已是十年前的事了。</p>\n<p>\nMcClatchy在线版的报道也称，克林顿夫妇与冯赛卡公司并无直接关联，但上面提到的该公司客户与克林顿家族的密切联系却是不可否认的。这使得克林顿家族与金融巨富阶层的密切关系再次受到关注。</p>\n<p>\n据《南德意志报》报道，过去数十年，克林顿夫妇为了竞选以及为其基金会筹资，共接受了30亿美元的捐款。其中希拉里就通过讲演、报告从华尔街多个金融机构获得了200万美元的报酬。仅在投资银行高胜所做的3次演讲，就为她带来了67.5万美元的收益。此外人们也怀疑，在希拉里担任外长期间，克林顿基金会的捐赠者有可能获得过好处。</p>\n<p>\n与财富阶层的\"亲密接触\"在本次竞选中给希拉里·克林顿带来的却是巨大的不利。她在党内的竞争对手桑德斯（Bernie Sanders）竞选的核心议题就是将对批评矛头指向华尔街银行、大型康采恩和富人。其竞选筹资主要来自小笔捐赠的桑德斯认为，巴拿马文件证明了他的观点，即目前的政治制度就是为有钱有势阶层服务的。</p>\n<p>\n现在，报道揭示冯塞卡公司的客户中有人同克林顿家族有关联，对桑德斯不啻是个利好消息。本周二（4月19日），人口众多的纽约州将举行初选，对桑德斯和克林顿来这都是重要的一役。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 184,
      "title": "DW 习近平提议规范干部家属经商行为",
      "date_published": 1461006240,
      "body": "\n<p>\n(德国之声中文网)这次由习近平主持的会议指出，规范领导干部配偶、子女及其配偶经商办企业行为是\"贯彻全面从严治党要求的一个重要举措\"。会议决定在上海先行开展试点的基础上，继续在北京、广东、重庆、新疆开展试点。</p>\n<p>\n新华社在其报道中引述与会人士称，中国当局今后\"要严格界定经商办企业行为，细化规范程序，明确操作依据，确保规范工作有序进行；要把集中规范和日常监管有机结合起来，规范工作基本完成后，要转入常态化管理，推动形成常态化、长效化的制度安排。\"</p>\n<p>\n中央全面深化改革领导小组由习近平本人担任组长，是中国共产党以及国家各领域改革的最高领导机构。三名副组长--总理李克强、中共中央书记处书记刘云山、副总理张高丽也参加了周一举行的会议。</p>\n<p>\n<b>\"巴拿马文件\"涉及习近平、刘云山、张高丽的家族成员</b></p>\n<p>\n在今年4月3日披露的\"巴拿马文件\"中，全球上百名政要以及社会名流在避税天堂开设离岸公司的事实被揭露。文件至少涉及8名现任或前任中共中央政治局常委的家人。习近平的姐夫、前总理李鹏的女儿也位列其中。</p>\n<p>\n文件显示，2009年9月，习近平的姐夫邓家贵成为两家英属维尔京群岛空壳公司的独立董事和股东。这两家公司分别叫作Best Effect Enterprises Ltd 和Wealth Ming International Limited。法律咨询事务所莫萨克·冯赛卡帮助邓家贵取得前者的公司印章。当时，习近平是九名中共中央政治局常委之一、国家副主席。当习近平分别与2012年和2013年被任命为中共总书记以及国家主席时，邓家贵的这两家公司便被搁置。</p>\n<p>\n牵涉到\"巴拿马文件\"中的还有现任中共中央政治局常委刘云山、张高丽的家族成员(分别为刘云山的儿媳以及张高丽的女婿)。</p>\n<p>\n<b>最高层首次表态</b></p>\n<p>\n\"巴拿马文件\"披露后，中国外交部曾称之为\"捕风捉影\"，《环球时报》则称这是西方\"打击非西方世界政治精英和关键组织的一种新手段\"。中国高层首次对\"巴拿马文件\"表态的是外长王毅。他4月8日与德国外长施泰因迈尔(Frank-Walter Steinmeier)会晤时说，中国政府已经看到了\"巴拿马文件\"所透露和澄清的信息，有意弄清事实真相。</p>\n<p>\n而此次习近平在中央全面深化改革领导小组会议上的表态，则是中国最高领导人在\"巴拿马文件\"披露后首次就干部家属经商问题发表看法。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 183,
      "title": "DW 琥珀价格暴涨：都是中国人惹的祸？",
      "date_published": 1459603980,
      "body": "\n<p>\n（德国之声中文网）中文和波兰语对外国人来说是充满挑战的难关，波兰和中国可不仅仅有着这一个共同点，这两个国家的民众都有着对琥珀的偏爱。最近格旦斯克举行的国际琥珀展会\"Amberif\"上可以清楚地感受到这一点。该展会自称是全球最大型的国际琥珀展，来自14国的480家参展商展出了珠宝、琥珀原石和加工器具。展馆中随处可见中国买家的身影，他们拿出放大镜对琥珀进行鉴定，拖着越来越重的行李箱穿梭在各个展位之间。</p>\n<p>\n尽管有着时差，一些商人还是直接在展会上为\n<a href=\"/zh/中国去年购买全球一半的奢侈品/a-19051997\">中国的客户下单</a>，微信平台得到了充分的利用，人们把照片和价格传到中国，那一头的买家决定是否出手。</p>\n<p>\n格旦斯克珠宝公司NAC 的Marta Siemionko表示：\"中国人喜欢琥珀--这对我们来说既是好事，又是坏事。\"一方面，琥珀首饰能在中国这个巨大的市场热销：\"但是，随着时间的推移，现在中国人自己已与供应商和原料市场建立了联系。价格都涨到天上去了。这样一来，我们这些珠宝生产商推出波兰市场能够接受价格的琥珀珠宝越来越不容易。\"</p>\n<p>\n另外一个他感到遗憾的是，越来越多的珠宝生产商迎合中国的审美去设计首饰：尤其是个头大、闪闪发光的珠宝受到中国客户的钟爱。</p>\n<p>格旦斯克展会的拉鸿（Ewa Racho）补充表示：\"琥珀的价格5年涨了至多8倍。\"一颗普通的琥珀现在每一克售价达到18欧元。品质好的或者是罕见的色彩身价更是暴涨。一名珠宝商人杨林（音）介绍说：\"白色的琥珀每克2000欧元起价。\"他和波兰伙伴Sebastian Tajl在云南开了两家珠宝店：\"琥珀不仅仅是波罗的海的黄金，它现在要比黄金还贵。\"</p>\n<p>\n崔亮欣（Nancy Chui）六年前创办了琥珀思雅Amberozia公司，她介绍说：\"几年前，琥珀在中国又火了起来。\"她与商业伙伴凯丽（Alicia Kelly）销售琥珀首饰，每年还会举办一届琥珀展：\"我们希望能够帮助波兰设计师打入我们的市场。香港的客户着重品质和优秀的设计。他们与大陆人不同。\"她的声音听起来有些傲慢：\"对他们来说，重要的是琥珀足够大，不重视设计。\"</p>\n<p>\n琥珀到底有着什么样的魔力呢？崔亮欣道出了其中一个原因：\"琥珀是佛教七宝之一。仅排在翡翠之后。因为翡翠矿床面临枯竭，琥珀是人们最好的选择。另外有人说琥珀有着治愈功效，它有着历史气息，又蕴藏着生机。\"</p>\n<p>\n格旦斯克展会发言人拉鸿指出，中国的经济增长也放缓之后，中国买家在格旦斯克出手也谨慎了起来：\"不过人们现在对琥珀的兴趣并未减少。\" 杨林介绍说，许多波兰产商现在都适应了中国人的品味：\"对中国人来说琥珀本身十分重要，和波兰人喜欢镶银的喜好不同。\"虽然现在购买的热情有所减退，但是他认为这波琥珀热还并没有冷却：\"也许人们得花点时间省钱买一款特别的珠宝。这样，琥珀对他们来说价值更高。物稀则贵，越贵、越稀有的琥珀越受到客户的欢迎。中国人爱显财富。\"</p>\n<p>\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</p>"
    },
    {
      "post_id": 182,
      "title": "DW 德国亲子鉴定规矩多 爸爸在哪难知晓",
      "date_published": 1461059760,
      "body": "\n<p>\n（德国之声中文网）德国联邦宪法法院周二（4月19日）判决：来自北威州的罗曼（Inge Lohmann）无权强制要求她认为是自己生父的Wilhelm C.作DNA亲子鉴定。</p>\n<p>\n宪法法院副院长基尔希霍夫（Ferdinand Kirchhof）解释起诉人败诉的理由是：（罗曼）对自己出身的知情权和相关人员（Wilhelm C.）的基本人权相悖。</p>\n<p>\n法院在作出判决前，罗曼解释提起诉讼的理由：\"我只是想知道，我是谁，我从哪里来，我想我有权利知道这些。\"</p>\n<p>\n2008年以来，德国子女确实有权请求父母双方进行基因血缘检测，查明其出身。但前提条件是，这些父母必须是法定的父母。</p>\n<p>\n而罗曼和Wilhelm C.目前的关系并不符合这一个条件。但是有不少迹象显示，今年88岁、身体不好的Wilhelm C.可能就是罗曼的爸爸，他在她的诗集里写下非常私密的内容，两人都有绘画和写诗的才能。1950年，是Wilhelm C.帮刚出生的罗曼登记了户口，罗曼在家里出生时，Wilhelm C.也在现场。罗曼说：\"我就奇怪了，一个陌生人为什么会见证我的出生？\"</p>\n<p>\n1955年．罗曼的母亲就想通过亲子鉴定来判断孩子的血缘来源，那个时候还没有DNA亲子鉴定。这一起诉当时就被依法驳回。对于罗曼而言，宪法法院是她了解自己出身的最后希望，现在看来，这一希望也已破灭。</p>\n<p>\n<b>如何查明血缘关系？</b></p>\n<p>目前德国有两种合法的方式来查明谁是孩子的父亲：身世澄清和父权诉讼。罗曼的案例属于前者。2008年开始，在特别案例中，德国允许当事人在不用承担法律后果的情况下要求查明身世。也就是说，即使罗曼胜诉，Wilhelm C.被要求做了亲子鉴定，也并不改变他们之间的法定关系。</p>\n<p>\n而父权诉讼的意思是：一名男性如果怀疑自己的孩子不是亲生的，则有权不承认自己的父亲身份。如果不确定父亲的身份，可以要求进行DNA亲子鉴定，但是必须要有过硬的理由。亲子鉴定的结果是有法律后果的，直接影响到抚养权和赡养费义务，也就是说，对相关人员的生活会有很大的影响。</p>\n<p>\n<b>法律逐步修改</b></p>\n<p>\n十年前，亲子鉴定在德国并不是一件难事，只要花上三百到八百欧元，带上孩子的一根头发，或者孩子吐掉的口香糖，父亲们就可以在私人实验室里秘密鉴别孩子是不是自己的亲生骨肉。但是秘密鉴定的结果并不能够作为呈堂证据，早在2005年1月，联邦法院就做出了上述判决。直到2006年，时任司法部部长奇普里斯（Brigitte Zypries）叫停秘密亲子鉴定，理由是秘密亲子鉴定侵犯了儿童的权利。</p>\n<p>\n持续多年的拉锯战之后，联邦议会于2009年通过了基因测试法。根据这一新法，基因测试将在自愿原则基础上进行，在测试前，有义务为接受测试者提供咨询。秘密进行亲子鉴定者将被课以直至5千欧元的罚款。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 181,
      "title": "DW 欧元区主席不再排除希腊破产的可能性",
      "date_published": 1328386500,
      "body": "\n<p>\n汉堡/慕尼黑</p>\n<p>\n欧元区主席容克要求希腊在实施已达成一致的改革措施方面做出更多的努力。这位卢森堡首相在接受《明镜周刊》采访时表示，假如希腊不能做到这一点，那么该国也就不要指望能够得到其他国家的团结支持，这样也许两个月之后希腊就得申请破产了。容克说：\"假如我们确定，希腊的一切都将走向失败，那么也不需要制定新的救助方案了，也就是说，到3月份希腊就会发表破产声明。\"尤其在国有企业私有化计划的实施方面，希腊明显没有完成原先的许诺。</p>\n<p>\n与此同时，即将离任的德意志银行总裁阿克曼周六也发出警告，欧元区面临崩溃的危险。在慕尼黑参加安全会议的他表示，现在整个欧洲的命运都悬于一线，希腊在其中扮演着重要的角色。在周六之周日夜间，他还将飞往雅典。</p>"
    },
    {
      "post_id": 180,
      "title": "DW 哪里去留学？中印学生仍青睐美国",
      "date_published": 1448182860,
      "body": "\n<p>\n（德国之声中文网）周一（11月16日）美国非营利性组织\"国际教育研究机构\"和美国国务院共同公布了一项年度调查报告。报告显示，2014-15学年，约100万到美国的留学生中约三分之一来自中国。</p>\n<p>\n过去两年，中国一家留学咨询机构公布的2013和2014年\"中国留学生意向调查报告\"显示，美国一直是中国留学生的首选地。</p>\n<p>\n<b>印度留美学生增加</b></p>\n<p>\n不过专家也表示，去年前往美国留学生人数增长最多的国家是印度。来自印度的留美学生人数去年增长了30%，超过13万。</p>\n<p>\n负责研究和评估的这家美国非营利性机构副总裁拉吉卡班‧达里（Rajika Bhandari）表示，\"这一增长主要集中在研究生阶段，我们知道，美国大学先进的科学和研究设施对印度留学生一直具有很强的吸引力。\"</p>\n<p>\n报告显示，来自巴西的留学生人数也出现大幅上升，从13000人增加至23000人，但数量仅占美国国际留学生人数的2%。</p>\n<p>\n去年，纽约大学已连续第二年成为国际留学生人数最多的学校，超过13000人。紧随其后的是南加州大学、哥伦比亚大学和亚利桑那州立大学。他们中每所院校的留学生人数都超过11000人。</p>\n<p>\n国际教育研究机构的报告还称，去年，国际留学生为美国经济贡献了300亿美元。</p>\n<p>\n美国仍是国际留学生的首选地。但就美国本土学生而言，其出国留学的人数则相对较少。报告显示，2013-14学年，美国约30万学生出国深造。该数字虽稳步上升，但仍仅占美国大学本科学生人数的2%。</p>\n<p>\n美国学生最热门的留学国家是：英国、意大利和西班牙。几乎一半的美国留学生选择前往欧洲国家学习。</p>"
    },
    {
      "post_id": 179,
      "title": "DW 欧盟要求结束钢铁业“不公平”竞争",
      "date_published": 1460798220,
      "body": "\n<p>\n（德国之声中文网）鉴于欧洲钢铁行业的严峻局势，欧盟委员会要求在全球范围内采取应对措施。欧盟当局认为，有必要共同努力，抵制钢铁行业前所未有的一系列\"不公平\"的贸易行为。4月18日在布鲁塞尔举行的欧盟高层会晤将就这一问题进行磋商。</p>\n<p>\n此外，欧盟钢铁工业面临着中国廉价竞争的严峻挑战。欧盟委员会认为，最近3年中，欧洲从中国进口的钢铁产品大幅增加。</p>\n<p>\n<b>制定反倾销措施</b></p>\n<p>\n为了保护当地的钢铁工业，欧盟委员会制定了一系列针对中国和其它国家的反倾销和反补贴措施，同时建议对可能损害欧洲钢铁制造商利益的钢铁进口实行新的预警系统，但这首先要征得所有欧盟国家的同意。欧盟委员会主席容克（Jean-Claude Juncker）也强调了保护欧洲钢铁工业的重要意义。</p>\n<p>\n周一，来自中国、印度和欧盟国家的高层领导人以及经济界代表将出席在布鲁塞尔举行的会晤。世贸组织代表和欧盟贸易专员马姆斯特罗姆(（Cecilia Malmström）也将参加会晤。2015年，欧洲钢铁工业的就业人数大约有32万8千人。同时该行业还在其他工业领域，如汽车行业扮演着重要的零件供应商的角色。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 178,
      "title": "DW 《十年》夺香港金像奖最佳电影 陆媒噤声",
      "date_published": 1459713420,
      "body": "\n<p>\n（德国之声中文网）香港电影金像奖颁奖礼于当地时间周日（4月3日）晚上举行，但中国内地多家媒体，包括央视、腾讯都没有转播颁奖礼。此前曾有消息称，北京当局因为触及港陆矛盾的《十年》获得提名，因而下达禁播令。亦有港媒在周日颁奖礼前夕报道，指网络流传一份中国广电总局的宣传指示，明令禁止\"炒作涉及港独议题的《十年》\"，所有的电视、网站、广播要避免出现相关视频镜头。</p>\n<p>\n在颁奖礼上，负责颁发最佳电影的香港电影金像奖主席尔冬升表示，筹备颁奖礼期间，发生一些复杂事情，希望明年不再发生，似是暗示禁播风波。他又直言，过程中一名年轻编剧向他查询，是否在典礼的稿件中不可提及《十年》，尔冬升以美国总统罗斯福一句名言回应，\"我们最需要恐惧的，是恐惧本身。\" 随即他宣布《十年》获得最佳电影，台下掌声如雷。</p>\n<p>\n\n</p>\n<p></p>\n<p>\n<strong>监制：感谢港人 香港为时未晚</strong><br>\n《十年》监制蔡廉明接受奖项时坦言，\"多谢金像奖够胆把这个奖项颁给我们，也多谢投票给我们的评审。\"他指出，《十年》已经超越了一部电影，在制作上有很多不足，仍要继续学习，但得奖令他感到香港电影还有很多可能性，只要用心、用真诚拍摄电影，原来可以很有力量。\"所以要多谢香港人，是你们告诉我们，香港为时未晚。\"</p>\n<p>\n另一名监制兼导演伍嘉良表示，从电影技艺角度而言，《十年》而夺得最佳电影，实在有愧，但感谢金像奖评审对电影的肯定。\"最初我们没有想过票房和奖项，我们很简单只是为了为香港说一些话，做一些事情，在我们的岗位上走出一步。《十年》曾经有一个阶段有机会出现不到，但有不少人支持我们，好想为香港为公义、为不公发声的人，我们会继续学习，谦卑地创作。\"</p>\n<p>\n一众导演在颁奖礼后接受访问时，被问到得奖会否担心北京政府的态度，他们表示香港是自由城市，也有电影自由，自己没有犯法、没有做错事，只是用电影的天马行空开放性平台，去创作出所想的故事。</p>\n<p>\n\n</p>\n<p>内地媒体报道 <b>均不提《十年》得奖</b></p>\n<p>\n《十年》以黑马姿态夺奖，其新闻度不输横扫最佳男、女主角和男、女配角等七个奖项的《踏血寻梅》。不过，电影《十年》在中国内地已成为敏感字，多个内地媒体包括新华社、新浪及搜狐和腾讯等网站，报道金像奖消息都未见\"完整\"得奖名单，对《十年》获得最佳电影的消息绝口不提。</p>\n<p>\n资深影评人、香港演艺学院电视电影学院院长舒琪表示，《十年》是香港宣言，值得获奖。他接受德国之声访问时又指，《十年》获奖显示金像奖甄选机制公平，未受干预，带出了一个重要的讯息。\"内地若企图用任何方式影响机制，也不会成功。\"那么《十年》夺奖，会否影响香港电影进军内地呢？他称不作揣测，只谓内地对电影一向有审查机制。然而，本土电影在香港仍有市场，是否能够成功，除了影片本身能否令观众有共鸣之余，也取决于投资者。</p>\n<p>\n而据香港《苹果日报》报道，电影投资人林建岳认为，《十年》获奖是香港电影界的不幸，原因是《十年》没有得到其他奖项提名，亦非最卖座，证明不具备最佳电影的质素，成为最佳电影是政治绑架了专业，将电影评奖活动政治化。</p>\n<p>\n<b>官媒批如思想病毒</b> <b>在港公映座无虚席</b></p>\n<p>\n《十年》以十年后香港为蓝本，预视香港未来的黑暗面，五个导演制作出五个不同风格、围绕社会议题的故事，当中不乏被视为在中央政府眼中的敏感题材，港独主义、《国家安全法》、广东话被淘汰的恐惧、保育及文革红卫兵重现的可能。</p>\n<p>题材来得\"敏感\"，惹来内地关注。中国官媒《环球时报》曾发表社评批评，电影完全荒诞、宣扬绝望、带给香港社会的害处很可能大过好处，犹如思想病毒。</p>\n<p>\n然而，被《环球时报》贬为\"思想病毒\"的这部电影却触动香港人的心灵。纵使该电影在高峰期只在全港六间戏院上映，但连场爆满，上映近两个月，录得逾600万港元票房。电影先后在香港十二间大专院校巡回演出，在4月1日，即颁奖礼前两天，《十年》于全港三十多处地方公映，数千人观赏该片，几乎所有地方均座无虚席。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 177,
      "title": "DW 专访科隆艺术展总裁：我们会继续发展",
      "date_published": 1460706660,
      "body": "\n<p>\n（德国之声中文网）德国之声：艺术品买卖是一直都存在的贸易方式。不过，五十年前刚刚建立艺术品交易市场的主意在当时仍然是非常不同寻常的。 艺术博览会是不是改变了我们对艺术的态度呢？今天我们是不是把艺术当成一种商品了呢？</p>\n<p>\n达尼尔·胡格：又是又不是。艺术博览会将艺术大众化了，通过博览会能够使更多的人对购买艺术品产生了兴趣。科隆艺术展同卡塞尔文献展一样，都是大型的艺术盛会，都会吸引大量的人来参观。科隆艺术展为现代艺术提供平台，画廊和活着的艺术家都来参展。这一做法彻底改变了艺术市场。</p>\n<p>\n德国之声：科隆艺术展的历史充满了波折，都有哪些重大事件呢？</p>\n<p>\n达尼尔·胡格：大事太多了。其中之一应当是1970年，柏林艺术品商维纳·布劳克以11万马克出售了博伊斯Joseph Beuys的装置艺术《狼群》。这是当时德国在世艺术家作品售价的记录。相比之下，同一时期美国流行艺术家利希滕施泰因（Roy Lichtenstein)的绘画作品可以买到10万马克。德国艺术品的售价明显偏低。还有就是2007年雅尼斯·库耐利斯的装置艺术《12匹轻骑》，这是对1969年的再现，艺术家将真马带到了展会上。1976年玛丽娜·亚巴拉莫维奇和乌莱的装置艺术也是一个高潮。科隆艺术展的历史上有过很多次高潮和轰动事件。我们现在出了一本很好的书，讲的就是科隆艺术展的历史。</p>\n<p>\n德国之声：科隆艺术展经历过那些困难呢？</p>\n<p>\n达尼尔·胡格：科隆艺术展是艺术市场兴盛和衰败的反映。艺术平市场疲软的时候，科隆展会也不景气。科隆艺术展经历过一系列的危机，许多危机接踵而至。七十年代末，甚至曾经考虑过停办的可能性。当时，科隆艺术展一蹶不振，情况很不好。进入公元两千年后，科隆艺术展也曾遇到困难，因为伦敦和迈阿密也突然办起了艺术展。不过，近来科隆艺术展的情况又恢复正常了。</p>\n<p>\n德国之声：以前艺术商和画廊老板是举办艺术展的主要推动力，而现在展会管理公司操控着展会的一切。这种专业化发展，或者说商业化发展，对展会本身有好处吗？</p>\n<p>\n达尼尔·胡格：由专业的展会管理公司承办艺术展，这种现象很早以前就有了。由专业公司承办会给展会本身带来很多好处。参展商租赁展台的费用会降低。服务设施更加完备。专业化发展是一个总体趋势，一些新生的，由画廊主办的展会也在朝这一方向发展。</p>\n<p>\n德国之声：在科隆艺术展上，也常常会涉及文化政策问题，比如艺术品交易，税务问题以及文化艺术品的保护等等。今年是科隆艺术展成立五十周年庆典，今年也会涉及这些问题吗？</p>\n<p>\n达尼尔·胡格：是的，新的文化艺术品保护法也将是今年的重要话题，尤其对那些从事战后艺术品和古典现代艺术品交易的商家和画廊来说。我个人对文化艺术品保护法持反对意见。因为这些画廊所作的工作，正是对那些被遗忘的艺术家进行重新发现和发掘。对这些艺术家进行营销是非常重要的，这有利于提升这些艺术家的地位。当一个艺术及的作品达到一个相当高的价格水平后，允许将他的作品出售到国外，比如出售给美国的一些博物馆本来是理所当然的事情。但新的法律堵住了销售渠道，总之这项法律带来了很多问题，应该对此进行思考。</p>\n<p>\n德国之声：很多其他地方的艺术展已经超过了科隆艺术展。那些有钱的艺术品收藏家更愿意光顾巴塞尔，香港或者迈阿密的展会。作为科隆艺术展的总裁，您还为科隆艺术展感到自豪吗?</p>\n<p>\n达尼尔·胡格：（笑）我更愿意这么说，是的，自从科隆1967年开办艺术展以来，是出现了一些新的展会：巴塞尔艺术展，巴黎国际现代艺术博览会，马德里Arcor展，伦敦的《冰冻》艺术展以及迈阿密的展会等等。总是会有新的展会出现，旧的展会关门。展会的平均寿命是10到15年，然后很多展会就消失了。芝加哥艺术展在长达20年的时间里，一直是美国最重要的艺术展，但后来却无法维持下去了。德国也曾经有过一段时间的柏林艺术展。但科隆艺术展一直得以生存，我们也会生存下去。从质量层面看，能和我们相提并论的展会并不多。依我看来，在现代艺术，古典现代派以及战后艺术领域，科隆艺术展在全球范围内属于前五名。今年展会的情况也是出乎意料的好。</p>\n<p>\n<i>达尼尔·克劳德·胡格（</i><i>Daniel Claude Hug</i><i>）是美国艺术品商人，2008年起担任科隆艺术展总裁。</i></p>\n<p>\n<i>德国之声致力于为您提供客观中立的新闻报道，以及展现多种角度的评论分析。文中评论及分析仅代表作者或专家个人立场。</i></p>\n<p>\nLINK: http://www.dw.de/dw/article/0,,19181053,00.html</p>"
    },
    {
      "post_id": 176,
      "title": "DW 如何诊断帕金森氏病症",
      "date_published": 1460880240,
      "body": "\n<p>\n（德国之声中文网）笔迹开始模糊，同之前相比，字迹变小，而且变化，看得出颤颤巍巍且没有规则。这些迹象可能是帕金森氏开始时的症状。</p>\n<p>\n一些病人说，嗅觉也发生了变化。对此医生通过检查可以作出诊断。波恩大学神经科医生维尔纳说，他们的标准化检查使用香草和玫瑰油，对嗅觉减弱或者完全失去嗅觉的症状能够作出客观判断。在肢体颤抖、变得僵直、肌肉紧张、动作幅度越来越小这些帕金森氏主要症状出现之前，嗅觉系统早已出现异常。</p>\n<p>\n不过，病症的出现以及病症的重轻因人而异，但出现了以上症状的两种，估计离帕金森氏病便不远了。</p>\n<p>\n人们估计仅德国一个国家，患帕金森综合症的病人就高达24万至28万之多，患者年龄多在50岁至60岁之间。</p>\n<p>\n<b>黑区</b></p>\n<p>\n帕金森氏病是人的中枢神经系统发生了病变。大脑里的神经细胞不断死亡。所谓的\"黑质\"核团（Substantia nigra）在健康状态下应该呈黑色，但患了帕金森氏病，这一细胞区域逐渐死亡，而黑色也逐渐消失。</p>\n<p>\n\"黑质\"里的细胞能产生多巴胺（Dopamin），一种传递信息的物质，可将一种神经细胞捕捉的信息传递到另外的神经细胞。维尔纳医生说，帕金森症状之所以出现，最主要是因为多巴胺物质的不足。如果\"黑质\"里的细胞减少了平时的60%至70%，人的动作也会减缓，肌肉变得僵硬，会颤抖，身体不稳。</p>\n<p>\n早期帕金森氏症状会发生在夜间，病人的家属会观察到患者在梦里做出特别强烈的反应：睡梦里，患者手舞足蹈，还有的大喊、大叫或者大哭。没有得帕金森氏的正常人睡梦里的行动局限在眼睛部位。</p>\n<p>\n医药界通常使用补充多巴胺的药物治疗帕金森氏。重者也会动手术，将模仿电极植入大脑，由一个向大脑的相关区域输入电波。研究显示，这一手术疗法对重症病人的效果更好，也比药物治疗效果显著。但即便采取手术疗法，医生建议病人应继续吃药，药量可以少一一些。</p>\n<p>\n<b>及早治疗</b></p>\n<p>\n如能及早发现病情，也可以较好地控制其发展。但大多数情况下，病人就医时已经很晚，因为他们把一些症状当作了一般的老年症状。</p>\n<p>\n这些年来，了解和治疗帕金森氏的研究不断取得进展。为维尔纳医生说，\"黑质\"里的细胞以及传递信息的多巴胺物质并不是人们知道的唯一影响病症的东西。他说，有迹象显示，神经系统里的细胞会同肠胃系统沟通，而肠胃病症有可能是帕金森病的初始。</p>\n<p>\n维尔纳医生表示，德国同许多国家一样都拥有以帕金森氏作为研究课题的研究所。\"我们完全有理由希望，从科研当中产生出治疗手段，减缓帕金森氏的病情发展。\"</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 175,
      "title": "DW 英国表态支持国际法庭仲裁南海案",
      "date_published": 1461045960,
      "body": "\n<p>（德国之声中文网）北京称，海牙永久仲裁法庭在此案上没有司法管辖权。菲律宾于2013年向仲裁庭提交了诉状。预计今年年中将作出裁决。</p>\n<p>\n英国外交部次官斯怀尔（Hugo Swire）4月18日向一家华盛顿智库表示，中国的强硬行动导致南中国海紧张情势加剧。他说，仲裁庭作出的任何判决都对双方有约束力，但这也可以成为中菲重新对话的契机。</p>\n<p>\n斯怀尔在\"战略与国际研究中心\"表示，英国将与美国及更广泛的国际社会站在同一立场上，对相关裁决作出回应。</p>\n<p>\n斯怀尔同时驳斥有关英国不愿挑战北京、因为希望获得中国投资的说法。他说，伦敦将\"继续为支持规则、反对压制而响亮发声\"。</p>\n<p>\n去年10月中国国家主席习近平访英期间，两国签署超过300亿英镑的商业协定，包括中国投资英格兰核电站的计划。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 174,
      "title": "DW 大学入门",
      "date_published": 1430835120,
      "body": "\n<p>\n<strong>德国高校的入学条件</strong></p>\n<p>\n希望到德国留学深造的同学，应该在中国境内就开始相应的准备工作。首先是确定自己的学历及德语能力是否符合进入德国大学的要求。\n<a href=\"https://www.aps.org.cn/zh/\" rel=\"nofollow\" target=\"external\" class=\"icon external\">德国驻华大使馆学术审核部</a>（简称APS）是这一方面的权威机构，也是所有留德学生必须通过的第一道关口。在审核部通过相应的面试和学术审查之后，持审核证书才能向各德国高校的外事处（Akademisches Auslandsamt）递交申请材料。\n<a href=\"http://www.daad.org.cn/zh/\" rel=\"nofollow\" target=\"external\" class=\"icon external\">德国学术交流中心</a>DAAD中文官网也为有志来德深造的同学提供了极其详尽的信息。 （德国高效种类 \n<a href=\"/zh/universität/a-6343639\">Universität</a> \n<a href=\"/zh/fachhochschule/a-6343720\">Fachhochschule</a> \n<a href=\"/zh/private-hochschule/a-6343686\">Private Hochschule</a> \n<a href=\"/zh/kunst-und-musikhochschule/a-6346822\">Kunst- und Musikhochschule</a> \n<a href=\"/zh/pädagogische-hochschule/a-6346885\">Pädagogische Hochschule</a> \n<a href=\"/zh/kirchliche-hochschule/a-6346974\">Kirchliche Hochschule</a> \n<a href=\"/zh/berufsakademie/a-6347750\">Berufsakademie</a>）</p>\n<p>\n<strong>德语班（语言水平）</strong></p>\n<p>\n要在德国读大学又决定不学英语授课的专业，那就必须证明自己具备足够的德语水平。对此德国有各种考试，如DSH——外国人高校入学德语水平考试，由各大学自己举办。申请者在本国就可参加的德语考试为“TestDAF”（对外德语考试，简称“德福考试”）。德国学校毕业或可出示歌德学院相应级别的德语结业文凭者，则可免去考试。德国的大学和世界各地的歌德学院都开设相应的高级德语班，学完可达考试水平。</p>\n<p>\n<strong>双晋升</strong><strong>服务（<strong>Dual Career</strong><strong>）</strong></strong></p>\n<p>\n如今要想吸引优秀科学家和顶尖学者到本校落户，必须要有新的招数才行，安置家属便是许多德国大学推出的新招，其内容不仅是帮助解决孩子的照看问题，而且还包括解决其配偶的工作问题，以使两人都能在职场上大有作为，双双晋升。配偶的工作可安排在本校，也可安排在与高校合作的企业。</p>\n<p>\n<strong>双元制学业（</strong><strong>Duales Studium</strong><strong>）</strong></p>\n<p>\n有些高校（应用科技大学）与特定公司合作，提供双元制教育，具体意味着高校学业和职业培训相结合。完成双元制学业的学生，不仅可以获得职业培训证书，而且还有学位证书。</p>\n<p>\n<strong>精英大学</strong></p>\n<p>\n德国至今有九所精英大学，国家额外拨款用于资助其科研和未来规划。这个所谓“精英倡议”2005/2006年由联邦政府启动，旨在重点推出德国一些大学，增强其在国际上的竞争力。有幸中选的德国大学有慕尼黑工业大学、慕尼黑大学（路德维希－马克西米利安大学）、亚琛工业大学、柏林自由大学、海德堡大学、哥廷根大学、卡尔斯鲁厄大学、弗赖堡大学和康斯坦茨大学。要了解他们各自在“精英倡议”框架下提出的方案，可以登陆他们的官方网站查询。(\n<a href=\"/zh/2012德国再评精英大学/a-16029199\">2012德国再评精英大学</a>)(\n<a href=\"/zh/德国精英大学/a-6389760\">德国精英大学</a>)</p>\n<p>\n<strong>专业多样化</strong></p>\n<p>\n迄今在德国攻读文科硕士（Magister）、理工硕士（Diplom）或师范的学生，必须自己组选专业。文科硕士要选三个专业，师范（即须通过国家考试）选两个专业，理工硕士选一个专业。引进学士硕士制后，原则上只要选一个专业即可。不过也有很多大学推出了在内容上相互补充或旨在更好地满足经济界需求的专业组合。这样以来便生成了很多新专业，且越来越多。高校指南网即可给出最全面的概况：www.hochschulkompass.de。 （\n<a href=\"/zh/高校学科应有尽有/a-6343459\">高校学科应有尽有</a>）</p>\n<p>\n<strong>函授学业</strong></p>\n<p>\n读大学但不用履行到校的义务，这对上班族来说越来越有吸引力。一些专业本是特地为网络授课量身打造的，有些还可供国外合作院校的学生学习。德国只有一所函授大学，即座落在北莱茵—威斯特法仑州哈根市的哈根函授大学，其重点为企业管理专业。学习材料要么邮寄要么网传。学生和老师一直保持联系。国外感兴趣者也可报名参加函授。</p>\n<p>\n<strong>经费资助</strong></p>\n<p>\n非奖学金生来德国读书，必须至少证明他有足够的钱支付第一年的开销，就是说必须在账户上存大约8000欧元。德国政府的资助只面向德国学生，或在特殊情况下面向欧洲学生。父母经济能力不强的学生可通过所谓“联邦教育促进法”（BAföG）得到国家的资助。经济陷入困境的，可向学校的大学生服务部或教会的高校组织求援。(了解更多申请奖学金的方式 \n<a href=\"/zh/daad奖学金与erasmus/a-6385276\">DAAD奖学金与Erasmus</a> \n<a href=\"/zh/德国人民学习基金会的奖学金/a-6389411\">德国人民学习基金会的奖学金</a> \n<a href=\"/zh/政治基金会的奖学金/a-6389171\">政治基金会的奖学金</a> \n<a href=\"/zh/无党派背景的奖学金/a-6388071\">无党派背景的奖学金</a>)</p>\n<p>\n<strong>本科学业（</strong><strong>Grundständiges Studium</strong><strong>）</strong></p>\n<p>\n如果录取前提要求是已完成了本科学业，指的是你必须已读完一次大学，拿到一个学位。目前德国大学的毕业学位有学士、理工硕士（Diplom）、文科硕士（Magister）和国家考试（Staatsexamen）。</p>\n<p>\n<strong>学籍注册</strong></p>\n<p>\n想学某个专业，必须到相应的高校注册。原则上，每个学生都可以自由选择高校和老师。私立大学、艺术和音乐类院校以及体育学院一般通过考试或面试来决定是否录取。紧俏的专业还有特殊的筛选程序，往往依照高中毕业成绩。办理注册，需要填写相应的申请表，证明德语水平（针对用德语授课的专业），如在本国已开始就读大学，则要出具所在本国高校的证明，还有医疗保险的证明。此外还要交“学期杂费”，这也属于办理注册手续的内容。</p>\n<p>\n<strong>入学名额限制</strong>（<strong>Numerus Clausus，简称N.C.</strong>）</p>\n<p>\n当一个专业的申请者数量多于学习位置时，就要限制入学名额。这时，只有高中毕业成绩很好的学生，才能得到学习位置。由于大部分外国留学生都是通过交换项目或奖学金计划入学的，因此不受N.C.限制，而是按另外的录取规定入学。</p>\n<p>\n<strong>大学生服务部</strong></p>\n<p>\n德国有58个大学生服务部，负责大学生的社会福利事宜。他们经营学生宿舍，出资营运学生食堂，提供托儿服务，并从维护大学生利益的角度出发参与高校政治，在经济和文化上对大学生提供支持。</p>\n<p>\n<strong>学习费用</strong></p>\n<p>\n大学生服务部的部分经费来自所谓的“学期杂费（Semesterbeitrag）”。学期杂费的其它用途还有：用于大学行政管理以及作为社会福利费拨给大学生在高校的代表机构——大学生委员会（AStA）。所有学生在办理注册手续时都必须缴纳学期杂费。除了学期杂费，有些联邦州还增添了学费，各大学的收费高低不一，现每学期最高500欧元。</p>\n<p>\n<strong>学习位置交易所（</strong><strong>Studienplatzbörse</strong><strong>）</strong></p>\n<p>\n紧俏专业，报名人数很多，各大学必须在众多报名者中挑选录取。一般来说，人们往往同时申请多所大学，期待被自己所钟爱的学校录取。如果此时你收到另一所大学的录取通知书，但却不想放弃被最钟爱大学录取的希望因此还要等到最后，那么录取你的学习位置就被冻结了，往往直到（过了你的报到日期）临近开学时才又向其他对这个位置有兴趣的学生开放。为了让人全面了解哪些大学、哪些专业尚有空位，德国高校校长联席会议决定设立一个“学习位置交易所”：www.freie-studienplaetze.de。每次新学期开始前，该网站都会登出“最后一刻的空位”。与此同时，网上平台“Studieren.de”也开始提供学习位置交易服务。该平台也同各高校合作，掌握有关最新数据，在学期结束前几周登出空位情况：www.studieren.de/freie-studienplaetze。</p>\n<p>\n<strong>残疾人学习</strong></p>\n<p>\n德国大学生服务总部（Deutsches Studentenwerk）为残疾学生设立了咨询点。有些大学的设施都考虑了残疾人的需求。各地大学生服务部也提供无障碍宿舍。此外，德国每所高校都有一名残疾人事务专员。有些高校的残疾学生和非残疾学生还一起自发组织了利益团体，向残疾人提供咨询和帮助。</p>\n<p>\n<strong>带孩子学习</strong></p>\n<p>\n有孩子的学生也能得到大学生服务部的帮助。工作人员会向他们介绍住所和特地为大学生子女设立的幼儿园、托儿所。想吸引各国高级学者或学生的大学常常提供特别的“一揽子服务”，其中包括介绍托儿位置、合适的中小学和住所。相关信息可在各校外事处获取。</p>\n<p>\n<strong>外国留学生欢迎中心</strong></p>\n<p>\n新来乍到的外国留学生，可到各大学的外事处寻求有关校内各种手续、流程的咨询和帮助。有些大学还特地设立了“欢迎中心”，为外国留学生提供咨询，甚至还配上所谓的“伙伴（Buddies）”。“伙伴”们自己也是学生，高年级学生，他们帮助新同学熟悉本校、熟悉新城市里的新生活。一些大学还在新学期伊始特别安排一系列活动，向外国新生介绍德国的风土人情，带其参观游览本市。有些院系的同专业学生联合会（Fachschaft）也专门组织新生欢迎活动。</p>\n<p>\n<strong>录取规定</strong></p>\n<p>\n有些专业特别抢手，乃至出现“录取限制”。比如医学系录取与否决定于高中毕业成绩。为分配医学系抢手的学习位置，德国还专设了“高校录取基金会（Stiftung für Hochschulzulassung）”，由其集中分配全德医科学习位置。但在大部分情况下，看中哪个大学，你就必须直接到那个大学申请。该校哪些专业限制录取？如何申请？这些情况都可向该校打听。为保险起见，应同时申请多所大学。外国留学生的录取工作由各校外事处负责。欲同时申请几所大学的，也可将材料一总递送“德国高校国际留学申请服务中心”（uni-assist）。该中心审查材料是否齐全后，再分别递送你想申请的各个高校。</p>"
    },
    {
      "post_id": 173,
      "title": "DW 第100届普利策奖颁发",
      "date_published": 1461069780,
      "body": "\n<p>\n（德国之声中文网）南加州大学副教授阮越清（Viet Thanh Nguyen）的处女作《同情者》<b>（</b>The Sympathizer<b>）</b>以越战为题材。普利策奖管理人普赖德（Mike Pride）在宣布获奖人名单时指出，这部间谍惊怵小说讲述了有双重人格、生活在两个国度的一名男人的故事。</p>\n<p>\n1975年，阮越清随父母以难民身份从越南来到美国。</p>\n<p>\n<b>因对奴工的调查获奖</b></p>\n<p>\n普利策奖根据报业巨子约瑟夫·普利策（Joseph Pulitzer）的遗愿设立于1917年，近几十年来声誉日隆，被视为全球地位最高的新闻奖。授奖范围包括媒体，也包括、戏剧、小说等艺术工作，以及知识性图书。今年是普利策奖满100届。</p>\n<p>\n美国多家主流传媒成为本届普利策奖大赢家。</p>\n<p>\n美联社因对东南亚的一个渔业作坊内奴工的调查获普利策\"公共服务奖\"。获奖人是4名记者，他们在18个月时间里调查记录了印尼等东南亚国家海鲜食品业的有损于人类尊严的劳动条件。</p>\n<p>\n美联社记者们揭露了当事国渔业内普遍存在的奴工现象，跟踪调查了从捕捞到销售的整个过程，使相关企业受到压力。有一次，为确切搞清楚涉事船只的名字，记者们藏身于一辆货车内整整4天。他们的采访报道问世后，影响巨大，导致2000多名奴工重获自由，多名嫌犯被捕，价值数百万美元的货物被没收，并引发东南亚多国渔业的全面改革。</p>\n<p>\n《洛杉矶时报》获突发报道奖。该报报道了两名涉嫌伊斯兰国极端分子在加州圣贝尔纳迪诺郡（San Bernardino）圣诞节活动上的杀人抢劫事件。《纽约时报》因其有关阿富汗女性的文章和反映难民的摄影作品而获奖。《波士顿环球报》、《纽约客》以及佛罗里达《坦帕湾时报》也分别得奖。</p>\n<p>\n<b>评审作品</b><b>3000</b><b>件</b></p>\n<p>\n本年度最佳戏剧奖授予音乐剧《汉密尔顿》。这是一部以首位美国财长亚历山大·汉密尔顿（Alexander Hamilton）为主人公的嘻哈传奇作品，作者是米兰达（Lin-Manuel Miranda）。</p>\n<p>\n普利策奖目前共21项。申请作品今年近3000件，其中涉及新闻业的约1200件。评委会由美国记者和出版人组成。评委会并不评审所有媒体作品，而是只评审提交申请作品。</p>\n<p>\n本年度获奖人各得奖金１万美元。</p>\n<p>\n<em><span lang=\"ZH-CN\" style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\">使用我们的</span></em><em><span style=\"font-size: 10pt; font-family: &quot;Arial&quot;, &quot;sans-serif&quot;; color: #222222\">App</span></em><em><span lang=\"ZH-CN\" style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\">，阅读文章更方便！给</span></em><a href=\"mailto:yingyong@dingyue.info\"><em><span style=\"font-size: 10pt; font-family: &quot;Arial&quot;, &quot;sans-serif&quot;; color: blue\">yingyong@dingyue.info</span></em></a><em><span lang=\"ZH-CN\" style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\">发送一封空白电子邮件就能得到软件和相关信息！</span></em><em><span style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\"><o:p></o:p></span></em></p>"
    },
    {
      "post_id": 172,
      "title": "DW “纳粹名画”将在德国、瑞士展出",
      "date_published": 1459846140,
      "body": "\n<p>\n（德国之声中文网）古利特私人收藏的发现曾轰动一时。2012至2014年间，德国警方在艺术收藏家科内利乌斯·古利特（Cornelius Gurlitt）位于慕尼黑和萨尔茨堡（Salzburg）的住宅内发现了1500多件艺术品。其中有许多被怀疑是在纳粹统治期间通过非正当手段获取的所谓\"被掠夺艺术品\"，包括著名画家夏加尔（Marc Chagall）、利伯曼（Max Liebermann）、马蒂斯（Henri Matisse）和毕加索（Pablo Picasso）的作品。</p>\n<p>\n不少画作是古利特的父亲希尔德布兰特（Hildebrand Gurlitt）留下的遗产，身为艺术商的他曾在二战期间作为中间人为纳粹政权买卖艺术品。2014年5月科内利乌斯·古利特去世，他在遗嘱中将全部收藏赠与瑞士伯尔尼博物馆。</p>\n<p>\n今年冬季，从古利特家族藏品中精选出的一部分将在两个展览上与公众见面。波恩的联邦艺术展览馆（Bundeskunsthalle）和瑞士伯尔尼艺术博物馆（Kunstmuseum Bern）将合作推出两个同时举办的、内容上有不同侧重的特展。目的是展现专业人士对古利特收藏的最新研究进展，通过提供更多信息增加这一神秘\"宝藏\"的透明度。两家博物馆在一份共同声明中表示：\"广大公众应有机会一睹这些数量庞大的艺术品，并获得尊重历史事实和科学性的诠释。\"</p>\n<p>\n此外策展方还希望人们不要忘记那些在纳粹时期受到迫害的艺术收藏家的命运。在波恩举办展览的一个目的就是为那些尚未确定其归属的艺术品进一步寻找线索。</p>\n<p>\n主持策划展览的专家分别是在伯尔尼的马蒂亚斯·弗雷纳（Matthias Frehner）和瓦伦蒂娜·罗卡特利（Valentina Locatelli）以及在波恩的莱恩·沃尔夫斯（Rein Wolfs）和阿尼斯卡·卢林斯卡（Agnieszka Lulinska）。人们还考虑在更多的城市举办这一展览，比如2017年在柏林的马丁·葛罗彼乌斯博物馆（Martin-Gropius-Bau）。</p>\n<p>\n\"古利特案\"于2013年被媒体曝光而引起轰动。为了澄清大批艺术品的来历，德国政府当年就成立了一个特别工作组，专门调查某些艺术品是否属于纳粹时期的\"被掠夺艺术品\"，并将它们归还合法拥有者或继承人。在所调查的500件艺术品中，迄今只有5件被确认为\"被掠夺艺术品\"。</p>\n<p>\n今年3月中旬有关部门宣布，设在德国马格德堡（Magdeburg）的由文化遗产协调中心（Koordinierungsstelle für Kulturgutverluste）管理的\"失落艺术资料库\"（Lost Art Internet Database）将184件疑似被掠夺艺术品的信息收入该资料库，以期日后能解开这些珍宝的身世之谜。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 171,
      "title": "DW 金砖国家及新兴经济体大学排名：百强内中国大学最多",
      "date_published": 1417707120,
      "body": "\n<p>\n（德国之声中文网）2015年金砖国家和新兴经济体大学排名依据《泰晤士高等教育》大学排名的标准，共有 13项严格的考评指标，覆盖了教学、研究、知识传播与国际声望等各个核心任务方面的表现。</p>\n<p>\n排名在第一位的是北京大学，香港《南华早报》消息，上次的排名中北大也位居榜首。这次考评满分为100分，在排名中北大的分数是67.7。清华大学的分数是67.2。</p>\n<p>\n进入百强的中国大学总数从上次的23增加到了27。</p>\n<p>\n进入排行榜数量第二多的是台湾岛内大学，共有19所。其中3所大学进入了前20名。依次为名列第11位的国立交通大学、第18位的国立清华大学和第20位国立成功大学。</p>\n<p>\n路透社指出，参加此次排名的国家包括巴西、俄罗斯、印度、中国和南非这些金砖国家。香港和澳门不包括在内。</p>"
    },
    {
      "post_id": 170,
      "title": "DW 埃以边境发生10年来最严重恐怖袭击事件",
      "date_published": 1344233220,
      "body": "\n<p>\n<span lang=\"DE\">开罗</span></p>\n<p>\n<span lang=\"DE\">极端伊斯兰武装分子昨天（8月5日）攻击了与以色列交界的一个埃及边境警察站，打死至少16名埃及警察。这是十年来埃以交界地区发生的最严重袭击事件。埃及官方媒体援引安全机构报道说，袭击行为是吉哈德（伊斯兰圣战组织）所为，伊斯兰分子从巴勒斯坦加沙地带所挖掘的地道进入埃及境内，对按斋月习惯在日落之后聚集吃饭的埃及警察发起突然袭击。控制加沙地带的哈马斯（伊斯兰抵抗运动组织）一名发言人宣布，将对袭击事件进行调查，并立即关闭该地下通道。以色列国防部长巴拉克敦促埃及总统穆尔西采取坚决行动，制止西奈地区再度发生恐怖袭击行为。穆尔西总统紧急会晤军方高层人士，并宣布将对恐怖分子采取报复行动。</span></p>"
    },
    {
      "post_id": 169,
      "title": "DW 喀布尔发生血腥恐袭爆炸",
      "date_published": 1461050880,
      "body": "\n<p>\n（德国之声中文网）喀布尔市中心周二（４月１９日）发生一起血腥自杀式炸弹袭击事件，导致惨重人员伤亡。阿富汗总统贾尼对路透社作了通报。该国内政部一名发言人透露，爆炸发生在早晨时分，地点是喀布尔的一个繁忙市区。阿富汗新闻电视台TOLO News报道说，至少有20人被炸死。阿富汗卫生部一名发言人称，爆炸发生在位于市中心的情报机构附近，导致7人丧生，327人受伤，其中很多人被送往医院抢救。</p>\n<p>\n极端伊斯兰组织塔利班宣布对此次爆炸袭击负责。塔利班发言人穆贾希德（Zabihullah Mujahid）称，塔利班成员成功进入了阿富汗情报机构建筑物内，实施了爆炸。阿富汗官方未证实这一说法。</p>\n<p>\n数月来，首都喀布尔以及阿富汗其余地区的安全状况恶化。一周前，塔利班宣布发动本年度春季攻势。</p>\n<p>\n今天的爆炸袭击是去年8月导致200多人受伤的恐袭以来最为血腥的爆炸事件，也是塔利班宣布发动本年度春季攻势以来的第一次。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 168,
      "title": "DW 罗塞夫誓言抵抗",
      "date_published": 1461046020,
      "body": "\n<p>\n（德国之声中文网）巴西国会众议院表决通过启动对她的弹劾程序法案后，现总统罗塞夫当地时间4月18日首次发表对全国电视讲话，表现出昂扬斗志。她称，自己足够坚强、有热情和勇气，决不屈服，决不束手就擒，\"正如迄今一生所作的那样，我会继续战斗\"。</p>\n<p>\n<b>拒绝辞职</b></p>\n<p>巴西国会众议院上周日以三分之二多数通过启动对她的弹劾程序法案。现年68岁的罗塞夫在周一的电视讲话中对众议院的表决结果表示愤怒，并指出，她当年获得了5400万张选票，议员们拿不出任何证据可以证明应弹劾总统。她再度指控反对者们是在\"从事政变\"。她称，众院的表决\"是对真相、民主制及民主法治的暴力行为\"。</p>\n<p>\n<b>参院下月表决</b></p>\n<p>\n在众院表决后，相关法案还需通过参议院。根据宪法，只要获得简单多数，相关法案就能通过。一般认为，巴西参议院将批准弹劾罗塞夫法案。参院主席宣布，参院今天起审议相关法案，表决不会早于5月中旬。</p>\n<p>如果参院批准启动弹劾程序法案，罗塞夫前执政伙伴、现在的政敌-副总统特梅尔（Michel Temer）将被委任暂行总统职务180天。特梅尔所在的民主运动党（PMDB）此前宣布退出联合政府，加快了罗塞夫总统政治颓势进程。弹劾程序最后，参院必须再度表决，并必须获得三分之二多数才能罢黜总统，否则，罗塞夫将重登总统宝座。</p>\n<p>\n来自左翼工党阵营的罗塞夫受到指控，要对国家数年来糟糕的经济状况负责。反对者们还指控她在2014年竞选连任过程中，在国家财政预算上作弊，以捞取选票。此外，数月来，罗塞夫也因对半国有的能源巨头-巴西石油公司的腐败调查受到压力。</p>\n<p>\n<em><em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></em></p>"
    },
    {
      "post_id": 167,
      "title": "DW 美联储官员呼吁加息需谨慎",
      "date_published": 1460485500,
      "body": "\n<p>\n（德国之声中文网）据路透社报道，美国央行美联储的领导层认为，应该奉行谨慎的\n<a href=\"/zh/德国专家评美联储加息/a-18924241\">加息政策。</a>美联储费城分支机构主席哈克(Patrick Harker)本周二（4月12日）表示，从原则上来说他支持在经济复苏的情况下继续加息。他说：\"在经济增长持续的背景下，我支持继续推进正常化的进程。\"但是，美联储应该等到价格上涨幅度更高的时候再有所行动。哈克指出，美联储在今年内仍可能分三次调整利息。这取决于2015年第四季度和今年第一季度的微弱增幅是例外还是常态。</p>\n<p>\n哈克认为，美联储每次召开会议的时候都有可能调整利率。但中国经济放缓以及美元汇率走高都有可能威胁到他预测结果的准确性。</p>\n<p>\n美联储的目标是让经济达到2%左右的通货膨胀率。过去，该经济指标一直明显低于这一水平。去年12月，美联储推出了几乎是十年来的首次\n<a href=\"/zh/美联储近10年来首次加息/a-18923336\">加息措施。</a>从此以后，它向商业银行放款的利率就维持在0.25%到0.5%之间。</p>\n<p>\n专家们正在猜测，美联储下一步会选择何时加息。许多人认为可能是2016年年中或年底。外界估计它不太可能在今年4月26日至27日的会议上宣布加息。今年3月的会议记录显示，美联储内部对下次加息的\n<a href=\"/zh/专访美联储加息-老大老二势头已变/a-18924203\">合理时间</a>尚存在争议。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 166,
      "title": "DW 修改人类胚胎基因 中国科学家再引争议",
      "date_published": 1460557440,
      "body": "\n<p>\n(德国之声中文网)这支研究团队是由现年仅35岁的广州医科大学第三医院的范勇博士主导的。在该项引起争议的研究中，范勇的团队在2014年4月至9月间，从87名捐赠者处收集了213枚三原核受精卵--这种受精卵因为无法正常发育，一般会被抛弃。研究人员使用了CRISPER基因编辑技术，对这些胚胎进行了编辑。在26个胚胎中，有4个被成功编辑，即获得了针对HIV病毒的免疫能力。</p>\n<p>\n这项研究上周先是发表在影响力并不大的专业期刊《辅助生殖与遗传学期刊》(Journal of Assisted Reproduction and Genetics)上，但是很快就引起了《自然》、《科学》、《麻省理工科技评论》等大牌科学媒体的关注。《自然》杂志指出，这是全球第二例有关人体胚胎细胞基因编辑的研究。</p>\n<p>\n<b>伦理争议</b></p>\n<p>\n值得注意的是，\n<a href=\"/zh/中国科学家打破禁忌修改人类胚胎基因/a-18411083\">全球首例人体胚胎细胞基因编辑研究</a>，也是由中国科学家完成的；和去年由中山大学的团队发布的研究一样，此次研究也在全球科学界引发了巨大争议。</p>\n<p>\n波士顿儿童医院干细胞生物学家达利(George Daley)对《自然》杂志表示，广州医药大学的这项研究并没有提出有关CRISPER技术能够有效编辑人类胚胎细胞基因的新证据。他认为，要实现预期的潜能，研究人员还有漫长的路要走。</p>\n<p>\n而日本北海道大学的生物伦理学家石井达也则认为，广州医药大学的此项研究\"不过是在玩弄人类胚胎\"。他指出，即便试验是在本来就无法存活的\"问题胚胎\"上进行的，他依然对这类试验的必要性表示质疑。</p>\n<p>\n研究团队的带头人范勇则反驳了这些批评。他在接受广州《羊城晚报》采访时表示，外界评论\"并非就是权威\"，研究环境\"也会不时地改变\"。范勇说，最重要的就是\"在自己所坚信的道路上，认真做好手中的研究，取得自主的知识产权和话语权，不至于将来受制于人\"。</p>\n<p>\n近年来，中国正迅速成为基因研究领域的先行者，在他国犹豫再三的伦理问题上，中国科学家往往有意抢先研究。</p>\n<p>\n而范勇的研究团队在发表的论文中则明确指出，此次实验的所有胚胎在三天后均按照规定被销毁。范勇在接受中国中央广播电台采访时也强调，此次研究\"参照国家研究人类科学干细胞的法律法规，在严格规范下做了这个事情\"，\"是在医院伦理委员会批准、家属知情的情况下进行的\"。而在论文中，范勇和他的同事也写道：\"我们认为任何试图通过改造早期胚胎来生成转基因人类的企图都应严令禁止，直至我们能够解决这些伦理学和科学问题。\"</p>\n<p>\n<b>缺乏明确规范</b></p>\n<p>\n就在去年4月中山大学的科学家完成全球首例基因编辑试验后，同年12月，国际人类基因编辑大会在美国华盛顿召开。该会议由中国科学院、英国皇家学会、美国国家科学院召集，与会各方明确允许科研目的的人类胚胎编辑研究，但禁止临床应用。同时，大会还达成一个共识，认为当前利用 CRISPR 技术对人类胚胎细胞基因进行修饰，是\"不负责任\"的举动。不过该共识并不具备法律效力。</p>\n<p>\n目前，中国尚未就人类生殖细胞基因编辑研究工作制订明确的伦理规范。而在今年2月，英国的独立生育监管部门首次批准了一项研究，允许\n<a href=\"/zh/英国批准科学家尝试修改人类胚胎基因/a-19016179\">利用CRISPR技术对人类胚胎细胞基因进行编辑</a>。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 165,
      "title": "DW 楼继伟：特朗普“不理性”",
      "date_published": 1460981460,
      "body": "\n<p>\n（德国之声中文网）据路透社报道，中国财政部长楼继伟接受《华尔街日报》（WSJ）采访时，驳回了美国总统大选参选人特朗普（Donald Trump）关于对华征收惩罚性关税的言论，称特朗普属于\"不理性的那类人\"。</p>\n<p>\n在这篇周日发表的采访中，楼继伟指出，这位共和党参选人提出要将中国商品的进口税提高到45%的建议，是违反世界贸易组织（WTO）规则的。他还表示，如果美国真的将特朗普的建议付诸实践，那就无法保住世界大国的地位。美国必须意识到，美中两国是相互依赖的。</p>\n<p>不过他也表示理解，在美国竞选过程中，常常会出现较为激进的言辞，这并不能反映下一届政府真正要采取的措施。中国是美国最大的贸易伙伴。</p>\n<p>\n特朗普上周二在纽约州的一次选战活动中指责中国\"拿走了我们的工作和金钱\"，批评北京既不允许自由贸易，也不允许自由竞争，所以如果他当选总统，中国进口商品将会面临高达45%的关税，这样中国才能\"学会公平公正地开展贸易\"。</p>\n<p>\n法新社报道称，正在华盛顿出席国际货币基金组织和世界银行会议的楼继伟，在中国政府高层官员中以出言直率著称。他也是目前对特朗普直接公开表态的最高级别官员。</p>\n<p>\n根据《华尔街日报》称，几乎任何的跨国界提高税率的做法都会触犯世界贸易组织的条例。</p>\n<p>中国政府很少直接出面对特朗普提出批评。国家媒体目前对美国总统大选各党党内初选的报道，大多不带评价导向性，仅有一次例外：上个月《环球时报》发表社评称特朗普是民粹主义者，并且称有人将他与通过选举夺取权力的墨索里尼和希特勒相比。</p>\n<p>\n特朗普的党内竞争对手克鲁兹（Ted Cruz）也对这个\"45%关税\"的建议提出批评：\"如果你们有这样一位总统，他过来告诉你们：如果你买纸尿布，我要对纸尿布征收45%的税；如果你要买车，我要对汽车征收同样的税；还有衣服也是一样。这会对你带来什么帮助？你会感觉受到了伤害\"，这位来自德克萨斯的共和党参议员说。</p>\n<p>\n2015年，美国对中国的贸易逆差额达到3660亿美元，比2014年的3430亿又有所提高。而在2016年头两个月，美对华贸易逆差比去年同期增加了近12%，达到570亿美元。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 164,
      "title": "DW 德语媒体：战略之王和“A4腰”",
      "date_published": 1460474820,
      "body": "\n<p>\n（德国之声中文网）德国《商报》本周二（4月12日）发表了题为\"战略之王\"（Die Strategie-Champions）的客座评论文章，指出中国正在改变经济政策的定位。与西方不同，前美国总统乔治·布什曾经不屑一顾的\"有关远景的玩意儿\"，对于中国来说是值得认真对待的经济发展策略。</p>\n<p>\n耶鲁大学经济学者Stephen S. Roach作为这篇评论文章的作者，首先回顾了中国从改革开放以来在经济发展上获得的傲人成就，特别提出了让中国经济在1980年到2010年期间实现飞速增长的制造型发展模式（Produzentenmodell）。指出，当时的中国注重制造产业.\"尤其是在生产和建筑领域。中国经历了前所未有的活跃发展。\"</p>\n<p>\n\"然而，要想实现到2020年之前全面建成小康社会的目标，制造型发展模式就不是良单妙药。温家宝总理2007年的时候明确指出，这种发展模式'并不均衡，不稳定而且缺乏可持续性。'\"</p>\n<p>\n作者分析了在此之后中国经济政策新方向的三个要素，写道：\"向服务业转型，加速创造就业岗位、加快城市化进程以提高实际收入、建立可靠的社会福利体系，让中国家庭在有保障的情况下，才能够把他们的收入转变成消费。十二五期间的成就令人印象深刻。尤其是每一个经济体在结构转型中都要面对的巨大挑战。而就是在这一点上，中国的战略焦点最为有效：也就是为经济从A到B的转型设定大范围的框架性政策。\"</p>\n<p>\n<b>转个弯上老路？</b></p>\n<p>\n但文章随后评论称：\"中国还远远没有走完这条（经济转型的）路。虽然它在发展服务业和城市化方面已经超额完成目标，但从各种角度来看，其结果不足以建设一个保障有力的社会福利体系。结果是，私人消费在国内生产总值中所占比重只从2010年的35%上升到2015年的37%。\"</p>\n<p>\n作者随后进入文章的重点，提及了中国政府最新提出的\"供给侧改革\"，指出这是中国最新的经济核心策略。其中即包括减少产能和债务，也包括提高生产效率和创新。</p>\n<p>\n作者指出：\"在中国，所有的内部讨论都严格按照一定的章程展开，不会有任何出人预料的事情发生。中国副总理、政治局常委张高丽在一次讲话中谈及中国所面临的'最大威胁'时重申了'供给侧改革'的重要性。于此相对照的是，对于内需型改革，他只是只言片语的带过。\"</p>\n<p>\n作为经济学者，评论作者在文章的末尾总结称：\"每个经济体都必须注重增长公式中的供给侧和需求侧。然而，中国在相关侧重点上的转变看上去像是一个重要的信号。这表明，它正脱离以关注消费为中心的发展模式，返回令其得心应手的制造型发展模式。从传统上来说，中央调控下的劳动型经济更适用于这种模式。\"</p>\n<p>\n<b>瘦身之国</b></p>\n<p>\n《南德意志报》则发表了一篇文章关注中国的瘦身热。在题为《瘦身之国》（Im Reich der Dürre）的文章里，作者关注了中国的\"A4腰\"、\"iPhone膝盖\"等\"疯狂行为\"。指出，这种疯狂目前似乎还\"看不到头\"。</p>\n<p>\n生活在中国的作者在文章开头写道：\"你胖了！不久前，这还是人们见面时夸奖别人的话。身体上的每一公斤都是生活好的体现，因为人们还没有忘记饥荒时吃不饱的日子。现在，这个时代已经过去了。\"</p>\n<p>\n\"如今，在中国的大城市里，这句话是骂人。这个国家的社会以惊人的速度向西方看齐；对瘦身的狂热追求就是一个例子：年轻女孩们都竞相追求让自己的身体达到一定的标准，然后再广而告之。当然是在网上，用自拍的方式，不然还能用什么方式呢？\"</p>\n<p>\n随后，作者仔细为德国读者们介绍了\"反手摸肚脐\"、\"锁骨放硬币\"、\"胸下夹笔(不露乳头)\"和\"iPhone膝盖\"在中国社交网络上疯传的现状。以及部分网友对这些做法的批评。</p>\n<p>\n作者在文章结尾总结说：\"对于所有的这些美眉来说，重要的是展示自己的生活方式。让大家知道她们是又有钱、又有闲的上层人士。目前还看不到这种古怪的选美竞赛何时会结束。今年2月，又冒出了\"A4腰\"，只有腰能完全被一张A4纸遮住的女性才有资格参与。最新的潮流是网红们用100元人民币的钞票围手关节一圈：不能看到丝毫的皮肤。更有甚者已经用10元的纸币来围了。什么时候用1元的呢？也许只有骷髅才能做到。\"</p>\n<p>\n<i>摘编自其他媒体的内容，不代表德国之声的立场或观点</i></p>"
    },
    {
      "post_id": 163,
      "title": "DW 缩短中小学学制能还中国教育之魂？",
      "date_published": 1457528340,
      "body": "\n<p>\n（德国之声中文网）\"教育的本质是：一棵树摇动另一棵树，一朵云推动另一朵云，一个灵魂唤醒另一个灵魂。\"中国作家莫言曾在诺奖颁奖典礼的致词中用诗情画意的语言这样说道。如今，这位有着全国政协委员头衔的诺贝尔文学奖得主再谈教育，并把浪漫抒情的词藻变成了一项内容具体的有关中国教育体制改革的两会提案。</p>\n<p>\n莫言认为，中国小学、初中、高中的\"633\"模式增加了学段衔接的成本，小升初考试和中考增加了师生学业负担和家长的经济、心理压力，由此衍生了重点班、择校热、学区房等困扰民生的社会问题。为了应对小升初、初升高和高中升大学考试，学生在12年中小学教育中最少要花一年半时间复习应考，被折磨得筋疲力尽、厌学情绪普遍。他建议将中小学制由12年改为10年，实行10年连续制免费义务教育，取消小升初、中考两个环节。经过10年基础教育的学生参加升学考试，根据此成绩及平时学习成绩分流。一部分升入大学，一部分升入至少学制两年的职业教育学院。</p>\n<p>\n<b>减负、减负！</b></p>\n<p>\n莫言的这份提案一经报道，很快刷爆朋友圈，引起网上热评。力顶者观点类似，主要从为学生减压的角度，比如\"提案如果通过，或多或少会减轻孩子的压力\"，可以\"还给孩子们本应快乐无忧的时光\"。有人感叹道：\"回想从小到大，教学检查、表演公开课无数，突袭式大扫除无数，不补课的呼声中，连我们自己都觉得不补课学业无以为继。\"也有人为，\"中国的应试教育时间太长，理论时间占据大部分时间，缺少一定的社会实践和动手能力，缩短时间能帮助学生尽早的融入于社会中！\"</p>\n<p>\n<b>\"基础教育根本就是不足！\"</b></p>\n<p>\n批评者则角度多种多样。网名\"叶小轩子\"的新浪微博用户说：\"说实话，有利有弊，就个人观点，一贯制教育固然不错，但说是基础教育占比过大？基础教育根本就是不足的吧。减短时间，就更不合理了，没人可以嫌弃学习时间过长。\"</p>\n<p>\n有网友指出就业压力等问题：\" 欧美学校大都是12年制，而且汉语文很难学，要花时间死记硬背； 中国学生的优势是数理化，没有时间积累能搞透吗？ 培养出一大批基本功不扎实的工程师，还搞什么强国？ 考试方式不改革，其他都不管用。\"</p>\n<p>\n<b>应试制度最公平？</b></p>\n<p>\n更多人则谈到应试教育与社会公平。网友\"Mia米的米\"在新浪微博评论说：\"取消小升初考试已经不公平了，阻止了大部分差学区的孩子向上流动。\"网民\"求是小老虎\"认为：\"现行应试教育制度，是当下中国最公平的制度，是穷人摆脱底下阶级最后机会。富人和上层想把他关上，这些人是混蛋。底层人听信忽悠，信素质教育，信莫言提案，这些人是傻逼。\"</p>\n<p>\n\"伤心的小郎君\"写道：\"莫言提案也是够了，一切不从弱势群体考虑的改革都是耍流氓，那些朋友圈刷屏的，你们就是希望自己孩子没有压力一路到重点大学，山区小孩永无出头之日，对吧？现在跨越阶层的难度不算很大，厉害的再努力点，一代人就能完成，简单的道理，这些老狐狸不可能想不到，为什么还提案？目的总是耐人寻味。\"</p>\n<p>\n\"钟爱自在\"写道：\"关于莫言十年制教改的建议，其实触及不到问题本质。单单教育体制，改来改去就是死胡同。中国政治文化要改，政府与老百姓在法律面前人人平等、公务员再无特权，教育就能正常化了。几千年来教育承载了实现阶层流动的唯一出路（最近几年连靠教育实现阶层流动都困难了），这种文化不改，再怎么改也是白改。\"</p>\n<p>\n还有网友说：\"莫言两会上批评应试教育。而我却觉得在中国人普遍进入小康，中产阶级占主流后才能奢谈这点。 我算是当年应试教育的得益者，那时这些社会问题初露端倪，小县城反应慢，父母也没能力做什么。虽然很累，这辈子再不想考试，但是其实也只有考试中能得到成就感。如果全凭能力，不凭考试，真的出不来县城。\"</p>\n<p>\n<b>行不通？</b></p>\n<p>\n一些人认为莫言的提案很好，但行不通：\"一个没有自由民主观念、社会保障薄弱、看重身份地位之人权钱的社会，做技术工人是没多大吸引力的\"，\"试问有几个家长能正视孩子学习能力不及别人而要去技校的事实？在错误的价值观下，家长往往选择掩耳盗铃断送了孩子无限的未来。\"</p>\n<p>\n新华网发展论坛就\"政协委员莫言建议中小学减少两年，你支持吗\"进行网上投票。按照公布的票数，支持者约占88%，反对者约占11.5%。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 162,
      "title": "DW 德语媒体：中国经济好坏的关键依然在于改革",
      "date_published": 1460990340,
      "body": "\n<p>\n(德国之声中文网)上周，中国官方发布的\n<a href=\"/zh/中国经济增速趋缓-问题依旧/a-19190157\">最新经济数字</a>明显地\n<a href=\"/zh/中国三月份出口增幅远超预期/a-19183577\">好于外界之前的预期</a>。不少分析人士认为，这些数字可能搀了水分。而德国<b>《中巴伐利亚报》</b>周一则刊发了一篇题为\"走钢丝\"的评论，认为不管数字好看与否，中国经济面临问题、亟需改革的基本形势是确凿无疑的。</p>\n<p>\n\"中国经济的增长数字一会这样、一会那样。有一点很清楚：中国经济现在面临着巨大的问题。大量放贷、金融市场高度敏感、全面产能过剩让中国背负了沉重的债务负担。而那些巨大的'僵尸企业'，虽然开工率很低，其雇佣的工人数量却非常庞大。\"</p>\n<p>\n\"中国政府非常当心对局面失去控制、对权力失去掌控，因此依然徒劳地坚守着旧有的行为方式，亟需推行的改革却无从落实。中国本应让其庞大笨拙的国有企业更加灵活、并促进私营经济的发展；此外，中国现在还应当打破国有资本对银行业的垄断。只有采取这样的措施，中国才能从世界工厂转型为现代化的创新型经济大国。\"</p>\n<p>\n<b>《法兰克福汇报》</b>则注意到，中国商飞集团正在悄悄调整其供货商渠道，力争能和波音、空客等老牌巨头一争高下。</p>\n<p>\n\"总部位于上海、成立于2002年的中国商飞集团，现正在试验其新型的民航安全理念。这主要涵盖了计算机控制的自动驾驶系统以及能够取代传统'黑匣子'的设备。……中国商飞美国公司总经理叶伟希望，自动飞行能够成为将来中国民航业的常态，从而尽可能地减少飞行员人工因素的影响。在这种情况下，飞行员的任务就变成了监控计算机系统的运行，只有在紧急情况下才需要人工介入。\"</p>\n<p>\n文章接着指出，商飞美国总经理叶伟的提议固然美好，但是商飞集团的道路并不平坦。旨在同波音737、空客A320竞争的\n<a href=\"/zh/中国首架国产客机c919揭开神秘面纱/a-18821656\">商飞C919</a>，要在2017年才能首飞、2018年开始交付，而现在的500架订单中，绝大多数也是来自中国本土航空公司。</p>\n<p>\n\"为了尽快挤入民航飞机市场，商飞集团需要西方国家供货商的协助。尤其是发动机、飞控系统、起落架等关键部件，几乎都是来自美国企业。但是这种情况很快就会改变。目前，中国航空业产值中，来自外国企业的部分超过一半；而根据北京提出的'中国制造2020'，这一比例应当在短期内大幅削减。届时，C919飞机所需的组件，将主要由遍布境内外的中国企业供货。在商飞集团的采购清单上，一些德国中型企业赫然位居前列。\"</p>\n<p>\n作者还指出，在商飞集团全球布局其供货商网络的同时，中国官方则致力于让一些关键部件国产化。\"就在今年3月，中国政府宣布组建中国航空发动机集团。不过，在这一国有企业能够自主研发并生产航空发动机前，C919将依然使用美国与法国合资企业CFM公司提供的发动机。\"</p>\n<p>\n<i>摘编自其他媒体的内容，不代表德国之声的立场或观点</i></p>"
    },
    {
      "post_id": 161,
      "title": "DW 中国反腐让艺术市场\"躺枪\"？",
      "date_published": 1458977400,
      "body": "\n<p>\n（德国之声中文网）胡润研究院发布的最新《胡润艺术榜》中排名第一的是当代画家是崔如琢。这位72岁的画家擅长大型水墨作品。这份艺术榜榜单按照公开拍卖市场作品总成交额排序公布了100位作品最贵的中国在世艺术家。</p>\n<p>\n2015年，崔如琢全年作品交易额为7.86亿元人民币，遥遥领先于其他对手。排在第二位的是油画家曾梵志，共拍得1.1亿元，但与2014年相比，他作品的成交额下降了62%。2014年，崔如琢的一幅画作创下逾2800万港元成交的高价，之后，这幅作品被误当成垃圾被清洁工丢掉。据《南华早报》相关报道，事情发生后，拍卖行向买卖双方赔偿了一大笔钱以了结此事。就在不久前，崔如琢豪掷一亿捐赠给故宫的消息被多家中国媒体报道。</p>\n<p>\n\"胡润百富榜\"的创始人胡润（Rupert Hoogewerf）表示：\"因为持续的反腐败运动，向政府官员馈赠高价艺术品的现象减少了，另外，中国经济放缓，这影响到了作品的卖出，藏家也变得保守，拍卖行上出现的好作品数量也大幅减少。\"</p>\n<p>\n作为全球第二大经济体，中国经济去年\n<a href=\"/zh/十大风险排行榜中国经济硬着陆居首/a-19123132\">仅增长6.9%</a>，低于政府的\"保7\"目标，也是1990年以来中国经济增长率最小的一年。即便如此，中国还是在2015年超过美国，成为世界上亿万富豪数量最多的地方。今年2月发布的《胡润全球富豪榜》宣布了这个消息。法新社指出，这意味着，潜在的富豪收藏家也在增加。</p>\n<p>\n根据雅昌艺术网的相关报道，2015年中国前100位艺术家作品总成交额约为37亿人民币，相比2014年下滑了45%。</p>\n<p>搜狐新闻报道，《2015胡润艺术榜》指出，去年是近10年来中国艺术品市场热情下降速度最快的一年。只有三名女性跻进排行榜，其中包括94岁高龄的书画大师陈佩秋。</p>\n<p>\n让人略感惊讶的是，阿里巴巴掌门人马云也登上了这份排行榜。他与画家曾梵志联合创作的作品《桃花源》去年十月在香港苏富比拍卖会中拍出近3500万人民币的高价。</p>\n<p>\n曾梵志被认为是较具代表性和国际影响的中国当代艺术家之一。他的超大规模油画《兔子》去年参加了中国当代艺术展\"中国8\"。该艺术展展出了约120位中国艺术家的500多件作品。该展览在德国鲁尔区和莱茵兰8个城市的9座博物馆展出。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><em>yingyong@dingyue.info</em><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 160,
      "title": "DW 可贵的留德机会！国际媒体研究硕士课程欢迎您！",
      "date_published": 1422280920,
      "body": "\n<p>\n该独特的硕士课程是德英双语授课，面向全世界、尤其来自发展中国家和转型国家的具有媒体经验的年轻人。该课程提供10个全额和若干半额奖学金名额。毕业生将获得文学硕士学位。</p>\n<p>\n该课程将研究、讲座和实践经验完美地组合起来，并为学生在通信和媒体行业的职业生涯作好准备。在媒体快速全球化的同时，媒体专业人士要理解媒体与发展合作之间的密切联系也显得很重要。</p>\n<p>\n<i>课程与奖学金</i></p>\n<p>\n课程每年从冬季学期开始，总学费为6000欧元。德国之声学术中心提供一定数量的全额和半额奖学金。</p>\n<p>\n全额奖学金包括承担学费，每个月提供750欧元以供食宿，还承担来德国和学业完成后回中国的旅行费用。申请人必须拥有至少两年的在媒体或与媒体相近的领域的工作经验。</p>\n<p>\n半额奖学金可以为您支付6000欧元的学费，其他的旅行和住宿费用得自己承担。</p>\n<p>\n没有获得全额和半额奖学金的人需要自己承担每个月约800欧元的生活住宿费，以及持续4个学期支付250欧元/月 （合计6000欧元）的学费。</p>\n<p>\n<i>申请人要求</i></p>\n<p>\n获得本科，硕士学位或在被认可的高校获得等值的学位</p>\n<p>\n第一次大学学习毕业后至少有一年的工作经验（在与媒体接近的工作领域）</p>\n<p>\n拥有公认的英语和德语语言证书</p>\n<p>\n<i>申请流程：</i></p>\n<p>\n从现在开始至2015年3月31日，您可以申请2015/16年的冬季学期。</p>\n<p>\n有兴趣报名国际媒体研究课程吗？ 请通过<a href=\"https://dias.fh-bonn-rhein-sieg.de/d3/dwf.asp?FID=0x9B876A3A801CED459EFBF719CDC7669E&amp;DWLink=1&amp;Lang=en\">网上申请</a></p>\n<p>\n网上申请之前，请先检查是否准备好所需材料：</p>\n<p>\n全额奖学金的申请者需额外提供以下文件：</p>\n<p>\n如果资料不是英语或者德语的，请必须附上公证的翻译件。此外，除非被正式通知，否则请勿发原件。只有在被录取之后，您才会被要求在高校递交原件（公证形式）。</p>\n<p>\n联系方式：<br>\n<br>\n德国之声学术中心 DW Akademie<br>\n学生秘书处 <br>\n电话：T +49.228.429-3503<br>\n邮箱： ims@dw.de<br>\n更多信息： www.ims-master.de</p>"
    },
    {
      "post_id": 159,
      "title": "DW 中国人去澳洲手续从简，签证可为10年",
      "date_published": 1460615100,
      "body": "\n<p>\n（德国之声中文网）堪培拉政府今年1月公布的数据显示，过去12个月里，有大约100万中国旅游者前往澳洲旅行，而15年前的这个数字只有10万。从绝对数字看，排在中国之前的只有新西兰。中国前往澳洲的人数不仅增加幅度最大，而且也是在当地消费最多的人群，去年中国旅游者在澳大利亚消费总额为77亿澳元。</p>\n<p>\n<span>特恩布尔</span>表示，澳大利亚政府希望简化签证手续，可以在网上直接申请办理签证手续，而且使用中文。此外，澳方将首次签发有效期为10年的签证。之前实施的8类学生签证将简化成两类。他说，\"此举显示澳大利亚加强重要的旅游业的决心，它不仅是我国经济重要的组成部分，也将两国人民连接的更紧密。\"<span>·特恩布尔</span>补充说，\"越多的中国公民前往澳大利亚，越多的澳洲人前往中国，两国人民相互间的理解也会更多的得到加强，今后包括社会、学术、经济和贸易领域的活动也会获得更多的生机。\"</p>\n<p>\n澳大利亚贸易领域出现萎缩现象后，该国发起了耗资4000澳元的全球性旅游宣传活动，尤其聚焦中国，希望有更多的中国人到澳洲度假。澳大利亚旅游研究报告显示，2014至2015年前，中国人的旅游消费将翻一倍，达到137亿澳元。</p>\n<p>\n随着近年来中国游客的迅猛增加，澳大利亚旅游业成为该国增长速度最快的领域，为50万人提供就业机会。堪培拉经济预测部门说，今年6月前，该国旅游的创收将达1130亿澳元，其中外国旅游者的份额达三分之一。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 158,
      "title": "DW 德国发行流通5欧元硬币",
      "date_published": 1460640480,
      "body": "\n<p>\n（德国之声中文网）到目前为止5元面值的欧元只存在纸币的形式。今天（4月14日），德意志联邦银行推出5欧元面值的硬币。按照规定，每人每天只能去银行换取一枚5欧元硬币，所以一大早就有很多收藏爱好者在银行门前排起了长队。</p>\n<p>\n不过，这种5欧元硬币虽然可以流通使用，但是却仅限于德国境内。第一批量总共压铸了225万枚。其中25万枚是纯收藏用版本，一经上市就被抢购一空。</p>\n<p>\n5欧元硬币的流通并不意味着5欧元纸币就将被替代。德国联邦财政部方面表示，这两种质地不同的货币价值一样，只不过用途有所区别。5欧元纸币在整个欧元区都流通，5欧元硬币仅限于德国境内，而且主要用于收藏。</p>\n<p>\n5欧元硬币的正面中央位置是一张世界地图，外围则是由众多星球组成的外太空，两部分之间被一道合成材料制成的蓝圈隔开。联邦银行表示，这一技术在全世界都是最新的，而且还具备防伪功能。</p>\n<p>\n造币专家和科学家们花了数年的时间研究寻找合适的合成材料。用于铸币的合成材料必须耐寒耐热、防水，对化学品以及UV射线都保持性质稳定。 </p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i> </p>"
    },
    {
      "post_id": 157,
      "title": "DW “德国制造”问题商品超过“中国制造”",
      "date_published": 1460791020,
      "body": "\n<p>\n（德国之声中文网）位于多特蒙德的德国劳动保护和医药局对去年德国呈交给欧盟的186起问题商品报告进行了评估。本周三公布的评估结果显示，其中46种产品为“德国制造”，大约占问题商品的四分之一。“中国制造”问题商品有40件，约占总量的21.5%。</p>\n<p>\n186种问题产品中，35种涉及家用和休闲类产品。其中大部分是材料不合格，比如色素或者铬含量超标。来自中国和亚洲地区的此类商品有28种，只有一种家用和休闲类问题商品来自德国。</p>\n<p>\n<b>中国的问题商品减少</b></p>\n<p>\n报告指出，对过去几年的数据进行比较可以看出，\"中国制造\" 问题商品减少了。2012年和2013年，来自中国的问题商品占30%以上，2014年占27%，今年则将至21.5%。而德国制造的问题商品2013年以来却在逐年增加。在2015年登记的46种\" 德国制造\" 问题商品中，42种涉及汽车制造和配件领域产品。</p>\n<p>\n问题商品也被称为危险商品。186件商品中，30%可能引起呼吸困难或者窒息。23%的商品某些部件可能在使用中脱落、被甩出。其他13%的产品可能导致滑倒、绊倒或者摔跤。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 156,
      "title": "DW 留学德国不得不知道的十件事情",
      "date_published": 1425197280,
      "body": "\n<p>\n（德国之声中文网）去美国留学？由于昂贵的学费，得平均贷款3万美元。那去英国？甚至要贷更多的款。那么还可以去哪里呢？</p>\n<p>\n许多国外学子选择了来德国留学。因为德国生活品质高，学习费用低，公立学校甚至不需要交学费。</p>\n<p>\n那些梦想着到德国来享受免费学习，到慕尼黑一睹啤酒节风采，品尝德国啤酒等等的年轻人，在准备赴德前，还不得不知道下面十件事情。</p>\n<p>\n1、 免费是相对的</p>\n<p>\n只有公立大学是免学费的；私立机构费用相对比较高。人们还必须申请某一个专业，被录取，并且要在与德国学生相同的条件下毕业。</p>\n<p>\n2、 不能总打工</p>\n<p>非欧盟国家的学生需要学生签证。该签证限制了学生一年只能打工120个全天，或者240个半天。在学期间，学生只允许每个星期工作20小时。不过，不用担心养活不了自己，因为德国普遍生活费比美国或英国都低，包括租金、食物、医疗保险和公共交通工具。</p>\n<p>\n拥有欧盟国家护照的学生还可以申请助学金（BAföG）。该助学金一半属于国家资助，一半属于贷款。偿还贷款时还无须付利息。对于非欧盟国家公民来说，只有特殊情况才能获得该助学金。此外，一个好心的建议：请别有打黑工的念头。你会被剥削得很惨；如果被逮住的话，还可能面临被驱逐出境。</p>\n<p>\n3、 奖学金</p>\n<p>\n外国人有机会申请各种各样的助学金和奖学金，不管专业是工程学，德语文化还是艺术。只要成绩好，而且努力地做好你的份内事，那么就有可能获得一个资助名额。</p>\n<p>\n给外国学生的奖学金多数由DAAD（德国学术交流中心）提供，这是国家支持的。也有很多其它的基金会给特定的学科提供资助。如果能拿到奖学金，那么在申请大学时会有一定的优势。</p>\n<p>\n4、 移民是有代价的</p>\n<p>非欧盟国家公民得花很多时间在外管局上。美国公民如果被德国高校录取，可以很快拿到签证。在德国拿到毕业证书之后，你甚至可以在德国呆上18个月，在这里工作。</p>\n<p>\n但是你得有心理准备:尽管有时候你有急切的愿望，德国官僚们也可能无动于衷。你必须自己处理所有事情：医疗保险，资金独立证明，找住宿，到市民办公室注册，申请签证。对于来自发展中国家的学生来说，整个过程会更加复杂：他们得在自己家乡的德国大使馆申请签证。</p>\n<p>\n5、 如何战胜\"纸张战争\"？</p>\n<p>\n留学生在德国唯一不能避免的是跟德国官僚打交道。让自己熟悉官僚德语和德国商务信函的格式；保留所有资料的复印件，将它们有条理地分类。这样能使你迅速准备所需的文件。做好安排，在各种可能发生的情况下对你都有利：从延签到找房。这种方式也许还会让你获得一所梦寐以求的房子，即便竞争者是一对收入不错的雅皮士夫妻。</p>\n<p>\n6、 说德语很重要</p>\n<p>在德国较大的城市，外国学生不需要德语也没问题，何况某些专业是英语授课。但是，学德语还是应该的。这样能跟德国公务员更好沟通，而且更快结交朋友。如果毕业后还有意愿留在德国，甚至工作的话，那学会德语能让你赢得更多机会。点击这里可以浏览德国之声免费网上德语教程。</p>\n<p>\n7、 德国大学不会把你宠坏</p>\n<p>\n在美国私立大学，由于学生支付了昂贵的学费，所以他们理所当然地会受到一些宠爱，例如，有洗衣店，房管局，健康中心等等为学生服务。甚至如果一个学生错过了很多课，他还会受到关心和帮助。</p>\n<p>\n但德国不是这样。所有都掌握在你的手中。你得一手操办。包括如何来到这个陌生的国度，如何上课。例如，一些课程需要出勤和写作业，但有一些就只需要期末考试。</p>\n<p>\n8、 学生宿舍的简单生活</p>\n<p>德国一些大学会给学生宿舍提供正式娱乐活动。有时候小的大学生村或者由简陋的单间组成的居民楼就不是那么吸引人，没有太多的社交活动。</p>\n<p>\n取而代之，你应该发挥自己的魅力，去有德国人住的宿舍楼里逛逛。这样你会认识很多德国人，还可以提高你的德语水平。</p>\n<p>\n找房子不是一件容易的事情。如果运气好的话，直接就被第一个WG给录取。如果运气不好的话，可能得找几个月。不过，那也值得。这些网站对找房会有帮助: wg-gesucht.de, dreamflat.de, studenten-wg.de</p>\n<p>\n9、 你不是第一个</p>\n<p>\n国外生活和学习包含着对自己负责。有时候你会有这种感觉，好像得孤零零一个人去突破很多难关。其实不用害怕。当你敢于来德国，你已经走在了一条无数人都走过的路上了。</p>\n<p>\n不管你得面对多么困难的问题，从申请学生签证，纳税申报还是了解你的德国男朋友或女朋友，你都可以在Toytown Germany的网站上找到相同的问题。针对这些问题已经有过非常生动的讨论。在你提出问题之前，请确定你所提的问题没有被回答过。当真正会使用这些论坛的时候，你会从中获得许多有用的信息。</p>\n<p>\n10、注意：你可能愿意永远留下来</p>\n<p>免费教育？太好了！你是一个聪明而且无畏的人，你知道怎样从人生中寻找更好的东西。所以你动身飞往德国，在这里\"玩\"几年，拿到你的毕业证书，还打点工，然后回国挣大钱，是吗？有可能。也可能不。因为有可能你会一直喜欢德国。那么你就得面临一个为难的问题：要么你得永远告别你的故乡，要么你就心碎地离开这个美丽的国度。当然，也有可能外管局给你省了这一招，当你没有找到工作的时候。</p>\n<p>\n如果你真的爱上德国，那就没有回归路了。正如大卫・鲍伊，在离开德国35年后还为柏林写情歌。但是也有糟糕的命运。为了还清学生时期堆积如山的债务，必须一直忙碌工作。</p>\n<p>\n好好考虑，你想做什么。然后就做吧！</p>\n<p>\nCaitlin Hardee, 来自西雅图，在美国读日耳曼语言文学，在柏林完成一年外国学习。在美国毕业之后，他回到柏林，在那里作为自由记者。</p>"
    },
    {
      "post_id": 155,
      "title": "DW 中国三月份出口增幅远超预期",
      "date_published": 1460547240,
      "body": "\n<p>\n（德国之声中文网）据中国海关总署最新公布的统计数字，今年3月中国经济出口总值增幅远超预期，与\n<a href=\"/zh/中国二月出口跌幅7年最高/a-19101472\">2月</a>环比增加了27.9%，与去年同期相比也增加了18.7%。这也是中国出口贸易额在过去9个月来的首次增加。</p>\n<p>\n路透社之前采访多名经济专家后给出的3月份出口增长速度预估值为2.5%。瑞士宝盛银行（Julius Bär）新兴市场战略研究部的分析师海因茨·吕提曼（Heinz Rüttimann）认为，造成中国3月份出口贸易额显著上升的一大因素是季节性的原因。2月份的出口数字受中国农历春节影响处于极低的水平。3月份的回升也就是理所当然的事情。吕提曼认为，另一个原因是全球制造业产值下跌已经触底，在出口方面仍然依赖制造业的中国经济也不例外。</p>\n<p>\n此次中国出口贸易总值的增长速度也是2015年2月以来的最高值。财经网站\"华尔街见闻\"援引分析人士的判断报道称，中国外贸总体\n<a href=\"/zh/中国经济坏消息不断-政府官员努力保局/a-19112801\">断崖式下跌</a>已经告一段落，但能否持续企稳仍然存疑。</p>\n<p>\n多名经济学者也向路透社表示，最新公布的数据严重受春节季节性因素的影响，不一定能够证明全球需求有所回升。但是，中国投资者已经欣喜地看到股市大盘指数创下3个月来的新高，而且人民币贬值的趋势也得到了一定的缓解。</p>\n<p><b> 中国经济正在回暖</b></p>\n<p>\n在吕提曼看来，中国政府为抵制\n<a href=\"/zh/经济放缓-消费支撑/a-19136962\">经济下滑，</a>也动用了大量的\"杠杆\"型政策手段。包括向市场投入巨大的资金流动量。这位经济学者对比了中国制造业产值和政策资金量的走势，发现在资金量上升的情况下，制造业产值也会随之上升。而目前出口额大幅上升的现象，在很大程度上也与政府加大了资金流动性的供给有关。</p>\n<p>\n\"华尔街见闻\"分析称，美联储暂缓加息，欧日央行宽松势头不减，短期内主要经济体货币政策的稳定和汇率的相对平稳也给了贸易商更多的信心。年初以来，无论是信贷、社会融资规模、房地产投资，还是连创新高的国内大宗商品价格，越来越多的数据都指向中国经济正在回暖。</p>\n<p>\n从短期上来说，吕提曼比较赞成\"华尔街见闻\"关于中国经济回暖的判断。得益于政府的量化宽松政策，吕提曼认为中国经济目前处于通货再膨胀（reflation）的过程。也就是说政府通过信贷、财政等手段向金融和经济领域注入超过常规的资金、货币,以求造成物价上涨、防止通货紧缩。这也从另一方面促成了反映工业生产活跃程度的采购经理人指数（PMI）从三月份开始冲破50的枯荣线，呈扩张趋势。</p>\n<p>\n吕提曼认为，目前各路专家在分析中国3月份出口数据增长时大都忽略了另外一个非常重要的因素，就是日元在三月份的持续走低。这增加了日本的出口成本，在削弱其出口产品竞争力的同时，增加了中国、韩国、台湾等附近亚洲邻国的出口优势。另外，美国经济没有出现人们预期中的大幅下滑，也增加了市场对全球需求回暖的信心。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 154,
      "title": "DW 再等怕你没地儿住！德国“学区房”租金猛涨",
      "date_published": 1461050340,
      "body": "\n<p>\n（德国之声中文网）王磊正在网上寻找4月份的合租房。他一方面为自己不久前获得慕尼黑大学的学习位置感到高兴，另一方面为能找到一个便宜的住处感到头疼。他指着电脑屏幕对德国之声记者说，看看！现在慕尼黑大学附近一间两居室的合租房（WG）冷租在480到650欧元不等，而这一价格仅是一间不到20平米的小屋。租赁描述上写着，设备齐全，拎包入住--这也是刚走出家门的大学生所需要的最基本条件。</p>\n<p>\n德国世界报在线报道称，2016年夏季学期已开始，但许多大学生仍未找到住处。大学各教学楼信息栏里的找房广告贴的到处都是。无需中介费的合租房房源已经没了，小型单元房也极缺。</p>\n<p>\n德国科隆经济研究所（IW）、德国房地产基金会（DREF）与德国搜房网站\"Immobilienscout 24 \"对2010到2015年德国大学生住房租赁市场进行调查后发现，所有受访城市大学公寓的租赁价格均出现两位数增长。德国市场研究机构\"Empirica\"的另一项研究结果表明，大学合租房（WG）是所有房型中涨价最多的。</p>\n<p>\n调查中显示，仅柏林一个30平米的小屋五年来的价格从331欧元涨到了386欧元（约2500元）。类似房型涨幅过快的还有慕尼黑。此外，斯图加特的增幅甚至升高了18.2%。同时，大学附近的房源广告数量减少了三分之一。</p>\n<p>\n2015年，慕尼黑大学生住房的平均租金是580欧元冷租（约4000元），水电费另算。而类似大学公寓在德国北部城市基尔（Kiel）的租金是356欧元。波鸿的价格是329欧元，甚至比慕尼黑便宜了40%。法兰克福大学生租房的均价为505欧元，斯图加特为474欧元，汉堡是454欧元，科隆是453欧元。</p>\n<p>\n中国留学生王磊最终选择了一个离慕尼黑大学十多站路车程的合租房。他将和一个印度人、德国人合租一套三室一厅的房子。租金是520欧元（冷租）。</p>\n<p>\n他说，\"这是目前能找到的在慕尼黑'最理想'的住房。\" 王磊苦笑了一下说，恐怕今后只能是学校、工厂两点一线了。</p>\n<p>\n<b>德国大学生数量五年增长20%</b></p>\n<p>\n德国大学不管校内提供还是校外的公寓房源，依住房结构可以分为合租房（WG）、公寓（ Appartment）、单元房（Wohnung）几种。为大学生提供住</p>\n<p>\n房的业主在市场供需不寻常的发展中获得利益。世界报在线引述德国科隆经济研究所专家的分析称，\"德国大学生数量五年来增长了20%多。原因是德国义务兵役制的取消和德国文理中学学制缩短造成的。另外，高中毕业生的数量增加，也是大学生人数增加的原因之一。\"</p>\n<p>\n根据德国科隆经济研究所（IW）的报告，如今德国人口中大学生比例至少占3.3%。而这一数字在2000年还只有2.2%。</p>\n<p>\n德国科隆经济研究所地产专家迈克尔，福伦达（Michael Voigtländer）对《世界报》介绍说，现在找房的不仅是大学生，单身青年也不少。大学附近方圆两公里以内，30平米大小，带整体厨房的房子最受欢迎。</p>\n<p>\n<b>未来趋势</b></p>\n<p>\n未来几年，德国合租房的租金将比单元房还贵。自2012年以来，德国范围内合租房的价格上涨了21%。科隆市中心合租房价格从333欧元涨到400欧元。</p>\n<p>\n柏林从310欧元涨到400欧元。而位于德国萨克森州的西部城市开姆尼茨（ Chemnitz）的合租房租金最便宜，平均仅216欧元。</p>\n<p>\n看看开姆尼茨的租金，再看看自己520欧元租到的房子，王磊摇了摇头说，\"没办法，为了自己理想的大学，总不能图便宜去那些没人知道的学校吧。\"</p>\n<p>\n王磊只是中国在德留学生的一个缩影。与十几、二十年前不同，今后到德国留学找房子，支付昂贵的房租也是学生和家长们要做好的一个思想准备，尤其在热门城市和大学。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 153,
      "title": "DW 德语媒体：巴拿马新诗和“剩女”心声",
      "date_published": 1460561340,
      "body": "\n<p>\n（德国之声中文网）\"巴拿马文件\"波及众多世界政要和名流，然而这股风吹到中国，却被坚固的\"长城\"挡了个密不透风。《南德意志报》（SZ）周三发表驻京记者评论文章指出，巴拿马已经在中国的微博上消失差不多一个星期了。使用微博搜索功能，输入\"巴拿马\"关键字，得到的回复是\"根据相关法律法规和政策，搜索结果未予显示。\"而使用\"习近平\"和\"巴拿马\"或者\"姐夫\"关键词，也得不到搜索结果。</p>\n<p>\n姐夫，这个原本稀松平常的亲戚称谓，一夜之间再次成为中国数字空间的敏感词。与习近平的姐夫邓家贵一样出现在巴拿马文件中的，还有前总理李鹏的女儿李小琳。《南德意志报》的文章援引\"自由微博\"（FreeWeibo）写道，\"其实在2012年，邓家贵就已经出现在舆论的视野中。当时彭博社（Bloomberg）的记者调查揭露了习近平姐姐及其丈夫的秘密资产。自从那时起，'姐夫'就成为中国网民常用的指代腐败和权力高层裙带关系的暗语。\"</p>\n<p>\n<b>旧诗新咏</b></p>\n<p>\n作者Kai Strittmatter还引用了网民中间流传的一首诗，这首诗模仿余光中的《乡愁》，对巴拿马丑闻给中国高层带来的尴尬进行了辛辣讽刺：\"小时候，巴拿马是一条宽宽的运河，太平洋在这头，大西洋在那头；长大后，巴拿马是一个独立的国家，哥伦比亚在这头，哥斯达黎加在那头；后来啊，巴拿马是一道长长的地峡，北美洲在这头，南美洲在那头；而现在，巴拿马是一堆泄漏的文件，姐夫在这头，小舅子在那头。\"</p>\n<p>\n面对巴拿马文件所引起的轩然大波，北京显然有些措不及防。《南德意志报》的文章分析道：\"北京从三个不同的方向展开回击。\n<a href=\"/zh/中国高层首次对巴拿马文件表态/a-19175020\">外交部</a>驳回了所谓的'捕风捉影'，而审查机构从第一天就开始全面展开工作：'如果在网页上出现外国媒体攻击中国的内容，将会造成严重后果'，这是'中国数字时代'网站曝光的一份高层向媒体编辑部下达的指令。\"</p>\n<p>\n作者认为，中共的宣传机器在这一风波的处理中也迷失了方向。《环球时报》先是在上周发表了一篇评论文章，指出\"偷或编'巴拿马文件'者绝非等闲之辈\"，称之为西方意识形态联盟打击非西方世界政治精英和关键组织的一种新手段。然而，这样的文章反而会吸引中国人对这一话题的注意力，所以这篇评论文章很快又从网络上被删除。</p>\n<p>\n对于巴拿马文件丑闻对中国造成的影响，作者评论道：\"面对普通大众，审查机器运行得还是相当有效，仅有少部分使用翻墙技术手段的城市精英阶层了解到相关信息。然而，中共精英阶层中也有一部分人知晓，这会给习近平带来更大的困扰：这位中共总书记面临着巨大压力，因为他的反腐运动和与之相关的党内清洗运动已经树敌颇多。这些不断曝光的有关他姐夫的丑闻，会使得他的弱点暴露在对手面前。\"</p>\n<p>\n<b>\"我是剩女我自豪\"</b></p>\n<p>\n近日来在中国网络走红的一段视频也引起了德语媒体的关注。德国n-tv电视台网页版发表文章，关注护肤品牌SK-II拍摄的宣传片《剩女反击战（Marriage Market Takeover）》所引起的有关\"剩女\"话题的讨论。由于在德国，年轻女性所面临的婚姻压力并不像在中国那么大，所以文章作者开篇就描述了\"剩女\"这个标签给中国女性造成的阴影：\"在中国，年近30岁还没有找到老公的女性，就会被称作'剩女'。一些有意识选择不结婚的女性可以对此一笑置之，但是对于大多数年轻女性来说，'剩女'这个标签就意味着灾难。\"</p>\n<p>这部短片是SK-II\"改变命运\"系列宣传片中的一部，画面先是展示了多名大龄未婚女性所受到的压力，来自社会，也来自父母。说到苦处，几位女性不禁潸然泪下。不过，短片后半段基调转向积极，展示了她们在上海一座广场挂出自信的特写照片，说出自己的心声，比如：我不想为结婚而结婚，那并不会过得快乐。文章作者评论道：\"言下之意就是：一位有魅力的女性不一定需要男人。……美国女权主义者Leta Hong Fincher在推特种发文写道：终于有一个广告片是在赞美年轻、独立的中国女性。\"</p>\n<p>\n\"仅仅一部宣传片，仅仅因为几个女性挂出自己的照片，写上内心的情感独白，难以想象会对深层次的社会问题带来什么影响。尽管如此，这部短片显示，女性的形象在中国正在发生变化\"，作者指出，该片在发表的头几天就获得了将近200万的点击量。不少女性在评论中写道，她们感觉自己受到了极大鼓舞。</p>\n<p>\n<em>摘编自其他媒体的内容，不代表德国之声的立场或观点</em></p>"
    },
    {
      "post_id": 152,
      "title": "DW 美国顶尖大学：不光只招“官二代 富二代”",
      "date_published": 1422556140,
      "body": "\n<p>\n（德国之声中文网）现年19岁的郭雨琣（音），父母都是媒体人，他们并不富有，亦不属于政府的精英阶层。她以为以这种财政背景，她绝对没有可能考得上\n<a href=\"/zh/qs全球高校排行榜出炉/a-15383996\">美国的著名学府</a>。但她报名考耶鲁大学的时候，当地大学正刚好正尝试招收更多来自不同背景的国际学生。</p>\n<p>\n现在，她是耶鲁大学二年级的学生，已经高兴的在那里哥特式的建筑中找到了方向。大部分人也不会猜想得到，这位来自北京的女学生，学费原来都由大学资助。\"曾经有人问我是不是什么皇亲贵族的远房亲戚，但我不是。\" 郭雨琣说。</p>\n<p>美国顶尖大学正努力摆脱它们\"只招待精英阶层孩子\"的名声，而且不止是针对本土学生，还包括国际学生。美国海外学生之多已经到了一个前所未有的地步，因此，耶鲁、哈佛等高等学府得到了美国国务院的帮助，正尝试吸引更多来自不同经济背景的学生。</p>\n<p>\n每年从中国到美国念书的学生，比任何国家都要多。美国国际教育研究所的资料显示，美国去年有超过\n<a href=\"/zh/在美中国留学生人数创历史新高/a-18069364\">27万5000名中国留学生</a>，占了国际学生总体的31%。随着中国越来越繁荣，很多美国大学开始招募一些可以\"带来资金\"的学生--那些可以全数支付整个课程的人。少数学府如耶鲁则保证会全面满足那些被取录的国际学生的经济需求。</p>\n<p>\n耶鲁大学自2001年起采取了新的国际学生招生政策，政策要求招生不应该受财政状况影响。该校招生院院长库因兰（Jeremiah Quinlan）表示，学校来自中国及其他国家学生的比例此后从3%大幅增加至11%；生源从主要来自高收入家庭，逐渐改变为有较大的背景差异。</p>\n<p>哈佛大学一个学生组织每年都会为数十名中国各省的高中学生组织学院式的研讨会，并向来自中国各省的学生提供财政援助。在耶鲁大学的国际学生，每当放假回家的时候都会充当\"大使\"，跟当地的中学生对话。两家大学的招生人员亦会定期到中国。</p>\n<p>\n不过，在中国精英圈子以外找合适的考生一点也不容易。富有的人能进最好的学校，这种现象在中国甚至比美国更普遍，而且，招生人员指出，考生以为他们一定要有政治背景。而且，语言障碍和实际操作中的困难也是一个问题。在中国，美国高考有名额限制，而且考生必须精通英语。</p>\n<p>\n为了帮助考生解决这些问题，美国国务院的\"美国教育项目\"（EducationUSA program）创建了一个总额有100万美元的基金，为海外学生提供包括申请费在内的资金援助。</p>"
    },
    {
      "post_id": 151,
      "title": "DW 钻石恒久远 骨灰永流传？",
      "date_published": 1459613460,
      "body": "\n<p>\n（德国之声中文网）当挚爱亲友逝去，人们会选择不同的方式来缅怀和纪念。如今的丧葬方式已经摆脱了传统的模式，除了将遗体火化后的骨灰葬入墓穴之外，很多新的墓葬形式也在悄然流行：\n<a href=\"/zh/死后变成一棵树/a-18365287\">树葬</a>、画葬、撒葬、海葬等等。而近年来一种更具创意的形式开始进入人们的视野：\"钻石葬\"。</p>\n<p>\n所谓\"钻石葬\"，顾名思义就是将遗体火化之后的骨灰经过二次高温燃烧，通过高压致密缩减三分之二的体积，自然凝结为一块宝石，也叫生命晶石。其实用从骨灰里提炼出来的碳元素制造钻石的工艺，来源于已经存在半个多世纪的人造钻石技术。而这种生命晶石根据加工工艺的差异，也可以有不同的成色，比如橙黄色、黄绿色、深红色、蓝色和白色等。其中以头名的白色骨灰钻石制作时间最长、工艺要求最高，造价自然也要高于其他成色。</p>\n<p>\n这种加工骨灰钻石的技术最早产生于近10年前的美国，后来传入了亚洲一些人口密集的国家与地区。</p>\n<p>\n据新华社报道，这种可以将挚爱制作成饰品携带在身边的新型葬法被引入上海，\"生命晶石工作室\"近日正式在上海益善殡仪馆挂牌服务。该报道还称，生命晶石的新式葬法\"与中国倡导的文明殡葬新风尚相呼应\"。民政部等九部委联合下发的《推进节地生态葬的指导意见》，明确倡导不保留骨灰的安葬方式。</p>\n<p>那么在德国，这种\"钻石葬\"是否成为人们纪念已故至亲的一个新选项呢？事实上，这种丧葬方式在德国是不被允许的。因为法律规定死者必须要进行埋葬：遗体必须要归于尘土，骨灰也不例外。如果死者在生前曾经明确提出意愿，政府可以容忍亲属将其骨灰带出境，但也最多只能带到瑞士或者荷兰。也就是说，可以将一部分骨灰送出去制作\"钻石\"，然后把余下的骨灰按照传统方式埋葬。据悉，在欧洲制作一枚骨灰钻石的造价在5000欧元以上。</p>\n<p>\n而且在以基督教文化为主流的德国，教会对于将骨灰做成的宝石摆在家里或是作为首饰随身佩戴持怀疑态度，认为这种闪亮浮华的宝石反而会干扰到逝者的安息。</p>\n<p>\n国际火葬联合会（ICF）的道德原则中就包含相关的要求：\"死者的骨灰是不可分割的。\"因此，作为该机构的会员组织，德国联邦殡葬企业联合会（BDB）也原则上反对将骨灰以及任何火葬衍生物加以商业性质的利用。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 150,
      "title": "DW 哪些国家为环保颁发了“限塑令”",
      "date_published": 1459576920,
      "body": "\n<p>\n（德国之声中文网）很长时间内，德国人认为购物时免费获得塑料袋理所当然。但是，这些塑料袋给环境造成的污染开始引起人们的反思。为了保护环境，越来越多的商店开始对塑料袋进行收费。德国人对此举表示欢迎。根据一项最新调查，80%的德国人赞成对\n<a href=\"/zh/鱼的捕食习惯决定其胃里微塑料垃圾/a-18990754\">塑料袋收费</a>，其它国家情况如何呢呢？</p>\n<p>\n<b>意大利</b></p>\n<p>\n在意大利的任何一家超市，顾客付款之后都会被问\"想要袋子吗？\"回答常常是\"不要\"。现在，许多意大利人购物时自备布袋或者是小型手拉车。如果想要袋子，需要花大约15欧分购买一个纸袋或者用\n<a href=\"/zh/不用塑料-也能过日子/a-18951654\">有利环保</a>的材料制作的购物袋。从2011年开始，意大利就禁止使用纯塑料袋。</p>\n<p>\n然而，许多小商店和市场始终无视这一禁令。为了打击违规商贩，2014年意大利政府通过了一项新法：对违反塑料袋禁令的商贩实施罚款，罚款额度可高达25000欧元。</p>\n<p>\n<b>法国</b></p>\n<p>\n从今年7月1日起，法国将明文规定禁止使用一次性塑料袋。许多超市现在就开始不再提供塑料袋。但是水果、蔬菜部仍然是\"塑料袋免费使用的天堂\"，不过从2017年开始也将被取消。根据法国环境部公布的消息，2014年法国各家商店总共提供了50亿个一次性塑料袋，而水果蔬菜部免费提供的塑料袋高达120亿个。</p>\n<p>\n<b>美国</b></p>\n<p>\n许多美国人也对日常生活中使用塑料袋作为包装不以为然。全美大部分地区的商店都免费提供塑料袋，因此美国每年消耗1000亿塑料袋也就不足为奇。不过从10年前开始，很多地区开始改变这种状况。全国20个联邦州中的大约180个城市和地区已经禁止使用及免费发放塑料袋。华盛顿的商店实行一个塑料袋售价5美分的出售方法之后，塑料袋的消费下降了60%。 纽约的商店和超市也在考虑对塑料袋实行收费。</p>\n<p>\n<b>印度</b></p>\n<p>大多数印度人并不觉得使用塑料袋有什么不好。为了节省地方，很多印度人将装有物品的塑料袋挂在家中墙壁上，当作\"廉价吊柜\"。或者用\n<a href=\"/zh/德国垃圾分类再利用的发展历程/a-18671671\">塑料袋装垃圾</a>，放在门口等候拾荒者来取。近年来，印度中央政府和联邦政府都颁发禁令，禁止生产和提供特定尺寸的塑料袋，并且在某些地区，如距离神圣的恒河2公里之内的地区禁止使用塑料袋。不过和印度颁发的许多其它法律规定一样，这些禁令的效果很一般。</p>\n<p>\n<b>中国</b></p>\n<p>\n中国的超市商店从2008年起开始对塑料袋实行收费，每个塑料袋约合2至5欧分。如果商店免费提供塑料袋被发现，有可能受到高达1万元人民币，约合1370欧元的罚款。因此，如今中国超市的塑料袋消费明显减少。特别是中老年人因收入不多，因此花钱很在意。尽管如此，塑料袋依然给中国造成环境污染。</p>\n<p>\n<br>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i>发送一封空白电子邮件就能得到软件和相关信息！</p>"
    },
    {
      "post_id": 149,
      "title": "DW 瑞典政府网站遭黑客攻击",
      "date_published": 1328377200,
      "body": "\n<p>\n斯德哥尔摩</p>\n<p>\n瑞典政府的官方网站周六显然受到了黑客攻击，造成网页无法访问。瑞典政府发言人拉格克兰泽尔（Jacob Lagercranser）证实，政府网站遇到了\"一些问题\"，但是不愿意透露进一步的信息。一个名为\"数字大军\"（CyberForce）的黑客小组在推特（Twitter）上宣布对这一攻击行动负责。该小组自称是黑客组织\"匿名\"（Anonymous）的一部分。\"数字大军\"黑客小组曾经因为对美国联邦调查局和伦敦警察厅之间的一次电话会议发动黑客攻击而引起关注。周五，网络上公布了一段15分钟长的该电话会议录音内容。</p>"
    },
    {
      "post_id": 148,
      "title": "DW 裸体？德国那些想脱就脱的地方",
      "date_published": 1460183580,
      "body": "\n<p>\n（德国之声中文网）休·海夫纳（Hugh Hefner）的《花花公子》杂志被定义为情色杂志。但裸体并不一定要与性联系在一起。裸体甚至是普通到和色情无关--这是每个去过男女混蒸桑拿的人都知道的事情。</p>\n<p>\n德国与法国和意大利的开放程度相比显得有些保守。但这也同德国的气候情况不无关系，在德国年平均温度10度的气候条件下，天体爱好者能做到一丝不挂似乎也显得很\"勇敢\"。在德国一些特定的地方和公共场合，无论什么身材、年龄和健康状况，人们不会因裸体感到羞愧、或担心被抓。</p>\n<p>\n<b>混蒸桑拿</b></p>\n<p>\n来一次放松身心的温泉之旅在德国很受欢迎。这是很容易理解的，因为德国晴天的时候不多，而且即使在夏季，天气的温度也常令人失望。除大型室内游泳池，桑拿和蒸汽浴都提供男女混合浴室。</p>\n<p>\n据德国桑拿协会报告，德国约3000万人经常去桑拿，其中有1700万男性，1300万年女性。全德国有约2300个设施完善的公共桑拿，大部分桑拿要求一丝不挂，而且多数是男女混和。</p>\n<p>\n德国两性对在桑拿全裸这件事似乎并不十分在意，无论周围坐的是谁以及腰间的\"救生圈\"有多大。</p>\n<p>\n<b>自家花园或阳台</b></p>\n<p>\n理论上讲，德国允许在私人宅院或自家房子里晒裸体日光浴，但是最好只在邻居不在家的情况下。</p>\n<p>\n虽然房东不能只因为租房者晒裸体日光浴就终止合同，但邻居仍可提出正式投诉。</p>\n<p>\n自2006年以来，德国法律允许在有私密遮挡条件的花园或阳台，在不干扰其他人、或他人无法看见的情况下裸露。为了避免不必要的处罚，最简单的晒日光浴的做法是，穿上一条短裤。</p>\n<p>\n<b>裸体运动俱乐部</b></p>\n<p>\n德国的裸体文化运动世界闻名。尽管衣服对保护身体有明显的优势，尤其在雨雪天气下，但裸体运动的传统在德国仍坚持了一个多世纪已久。</p>\n<p>\n几千年欧洲文明以来，运动和裸体虽存在密切的联系，可提到德国裸体文化（FKK）的起源要追溯到19世纪末。<br>\n<br>\n上世纪30-40年代纳粹时期，由于道德压力，裸体风潮略显低迷。战后，裸体文化运动在前西德和东德地区同时发展。支持者倡导与自然环境和谐相处，将身体运动与行动自由结合在一起。1963年，德国天体文化协会加入德国奥林匹克体育联合会（DOSB）。目前有约4万会员。每年天体运动爱好者在德国聚会，举行地滚球、排球和游泳等天体活动。</p>\n<p>\n<b>裸泳</b></p>\n<p>\n随着天体运动一个多世纪以来的发展，自然疗法开始盛行。德国北部波罗的海的海滩成了治疗支气管炎和风湿等常见疾病的灵验之地。海滩朝圣者希望通过在海滩裸泳、晒日光浴，使身心获得更多益处。</p>\n<p>\n德国第一个天体浴场（FKK-Strand）是在叙尔特岛（Sylt）建立的，这个德国北部岛屿也因此闻名。此外，在德国北部波罗的海的其他岛屿如博尔库姆（ Borkum）、诺德奈岛（Norderney）、阿姆鲁姆（Amrum）、吕根（Rügen ）等岛屿都设有裸体浴场，但只在特定区域进行。</p>\n<p>\n<b>裸体文化公园</b></p>\n<p>\n德国北部海岸到处都有裸泳浴场，以至于大部分德国游客无法进入海滩。尽管如此游客仍不能在岛上随处乱走，因为岛上一些公园设有天体活动区域，并立有提醒牌。</p>\n<p>\n<b>电视节目</b></p>\n<p>\n为保护青少年，德国命令禁止在黄金时间播放带有色情场景的节目。然而，穿着甚少的裸露镜头也并不少见。</p>\n<p>\n例如在德国电视真人秀\"热带雨林生还计（Dschungelcamp）\"和\"犯罪现场（Tatort）\"这样的节目里，女性的乳房（包括乳头）都能看到。，但其涉及的并不是真正的色情。</p>\n<p>\n尽管德国电视禁止播放色情节目，但午夜23点至凌晨6点为色情节目播放时段。其他时间恐怕要看海夫纳的香艳杂志了。</p>\n<p>\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</p>"
    },
    {
      "post_id": 147,
      "title": "DW 墙外文摘：香港更“本土”，台湾更“一中”？",
      "date_published": 1460905740,
      "body": "\n<p>\n（德国之声中文网）传播学者李立峯在香港《明报》发表文章《多少市民自认属本土派？》，分析最新民调研究的结果，认为\"本土派\"一词已完全渗入公共论述之中。调查中，有超过8％的市民自认属本土派，自称激进民主派的只有不足3％。最多人选择的仍是温和民主派，有32％左右。选择3个代表建制阵营的标志的被访者，加起来有14％左右，而自称中间派或无政治取向的市民，加起来超过四成。</p>\n<p>\n李立峯指出， 8％是一个绝不可以忽视的数字。如果我们再以年龄划分，就会更清晰地见到本土派冒起的势头。表2显示，在45岁或以上的各年龄层，选择本土派的市民比例只有2至3个百分点，在30至44岁的市民当中，本土派支持者有6％，但在18至29岁的市民中，选择本土派的有接近30％，跟温和民主派的39％差不多可以分庭抗礼了。</p>\n<p>\n<b>体制内有多么健康，多少力量？</b></p>\n<p>\n中国时评人莫之许在香港《东网》发表文章《所谓\"两头真\"，所谓体制内健康力量》，批评中共退休老人\"两头真\"现象，认为所谓\"两头真\"，一头是共产极权，一头是宪政民主，两者水火不相容，不可能两头都\"真\"。\"如果晚年为真，就应该对为建立极权体制奋斗，帮助建立共产极权体制，并始终服务于极权体制的运转和巩固有所忏悔，否则，这种说辞，就更像是一种掩饰\"。</p>\n<p>\n莫之许质疑，\"即使是晚年那一点宪政民主鼓吹，又何尝发挥过半点作用呢？这么多年来，无论是民间的维权、抗争行动，还是政治异议和反对表达，都跟这些'两头真'老人不沾边，而他们自以为无比重要的各种'上折子'，也都如泥牛入海，从来不曾激起过一点涟漪\"。</p>\n<p>\n莫之许认为，体制内残留的自由化人士，也要面临不断的挑战，也会出现不断的转变乃至流失。更为重要的是，随着大陆市场化进程的加速，1999年后，体制开始运用市场化成果，加大对知识分子的收编吸纳。知识分子逐渐被编织进了新的利益分配体制而迅速小康了起来，即使是那些依旧坚持自由化基本理念的人士，也大多钝化甚至放弃了自由化的表达，屈服于各种利益和头衔之下。</p>\n<p>\n<b>中共向台湾新政府摊牌</b></p>\n<p>\n政治评论人陈昭南在台湾《风传媒》发表文章《今日肯亚，明日台湾？》，认为\"肯亚（肯尼亚）事件\"已深深触及最为敏感的两岸国家定位问题，也让中共强硬要求台湾新政府所必须接受的\"九二共识\"彻底摊开来接受检验。</p>\n<p>\n陈昭南说，\"马英九的一中各表，那要表的不只是说说而已，而是要经过实际检验的。现在经过几次事件，不只各表是骗人，掳人事件亦正检验出中华人民共和国才是唯一合法之中国吗？中华民国该往哪里摆呢？\"</p>\n<p>\n陈昭南警告说，\"昨天他（中国政府）可以在所承诺的一国两制、港人治港的香港随意让人'被失踪'；今天他也可以在非洲对任何国家透过金援施加政治压力而强行掳人遣送到中国；明天，他就会想要在全世界各地区任意绑架不顺从他的台湾人；再然后的后天，他就可以大剌剌侵门踏户到台湾来让你消失\"。</p>\n<p>\n<b>谁是最大的诈骗集团？</b></p>\n<p>\n台湾《自由时报》发表社论《诈骗共犯？》，认为中国强行掳走台湾人，固然涉及司法问题，弦外之音却在主权，企图落实两岸同属一中。\"未来中国在境外只要想抓它认定的台湾籍嫌犯，尤其是将'台独分子'扣上其他罪名，也可以比照办理了，那还得了！\"</p>\n<p>\n社论质疑，\"台湾要犯偷渡中国，受中国保护表扬，遣返回来几个？现在，竟然在肯亚强行掳人，所谓的司法互助，难道只是证明中国对台湾人民有司法管辖权？一如所谓的一中各表，老共欢迎承认一中，却丝毫不容许各表。说难听一点，老共跟诈骗集团有何不同？\"</p>\n<p>\n[摘编自其它媒体，不代表德国之声观点]</p>"
    },
    {
      "post_id": 146,
      "title": "DW 为什么女性更容易狠心提分手？",
      "date_published": 1460276820,
      "body": "\n<p>\n（德国之声中文网）据德国《图片报》报道，交友网站\"Parship\"就\"谁先主动提出分手\"做了一项调查，结果显示一段感情宣告结束往往是由女性最先提出。85%的受访女性表示，在过往的感情关系中至少有一次是她们先提出分手，而这一比例在受访男性中只占61%。</p>\n<p>\n美国电视剧《欲望都市》的两位编剧贝兰特（Greg Behrendt）和塔齐罗（Liz Tuccillo）曾联合写过一本名为《他其实没有那么喜欢你》的畅销书。这本畅销书被很多女性奉为恋爱宝典。书中列举了很多证明一个男性其实对和自己相处的女性并没有太大兴趣的证据，提醒被爱冲昏头智商降为零的女性迅速跳出\"火坑\"，继续寻找真正懂得珍视自己的\"心灵挚友\"。</p>\n<p>\n也可能正是因为女性在一段感情关系里对男性的考核条目尤其多，所以在综合考核评分之后，女性也就更容易\"甩手走人\"。不过《图片报》采访的感情问题专家黑格曼（Eric Hegmann）也表示，相对于男性而言，女性也是最先会想到去求助专业人士机构拯救感情关系。\"她们发现问题的速度快，然后也会想办法尽快把问题解决掉。但如果男性伴侣回避解决问题，后果自然也是显而易见的了。\"</p>\n<p>\n黑格曼还指出，从统计数据分析，对单身状态感觉满意的女性数量要比男性高，因为女性更注重维护自己的社交圈子，她们也不怎么害怕一个人独处的生活。</p>\n<p>\n<b>六大分手理由</b></p>\n<p>\n\"你不爱我了，我们分手吧。\"这不只是影视作品中的台词，这也的确是现实生活的真实写照。根据Parship网站所做的调查，女性决定分手的最主要原因（16%）常常都是感觉缺少关注与爱护。劈腿（11%）、缺少共同语言（11%）、对未来的设想不同（10%）、外部因素（9%）以及争吵不断（8%）也是容易让女性做出分手决定的重要理由。</p>\n<p>\n情感专家指出，在一段感情关系中，如果两个人之间已经不再相互关注、相互肯定，过上了形同陌路的日子，那么至少在其中一人心里其实已经给这段感情判了死刑。专家还指出，出轨的一方往往是希望能够得到对方的足够关注，但这样的关系大多已经是无药可救了。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 145,
      "title": "DW 安杰丽卡·多姆罗斯庆祝75岁生日",
      "date_published": 1459782360,
      "body": "\n<p>\n（德国之声中文网）2013年，德国总理默克尔被德国电影协会问及最喜欢哪部电影。她回答说是卡洛夫（Heiner Carow)导演的《保罗和保拉传奇》。\"我想起了那些充满激情的爱的场景以及保拉（Angelica Domröse,安杰丽卡·多姆罗斯饰）和建筑工人打交道时的那份坚定\"，默克尔这样说道：\"在商场里，人们希望有她这样的收银员。\"</p>\n<p>\n<b>自由的感觉</b></p>\n<p>\n这部悲喜剧讲述的是东柏林一位带着两个孩子的单身母亲保拉的故事。保拉爱上了温夫里德·格拉策德尔（Winfried Glatzeder）饰演的党员干部保罗。可是保罗已经是有妇之夫，\"生活作风\"不能出问题。保罗一开始为保住仕途而不愿离婚。而保拉却愿意为了保罗冲突世俗的禁锢。她代表了自由这一最高境界的情感。这一角色马上得到东德观众的认同。300多万观众涌向影院，安杰丽卡·多姆罗斯和温夫里德·格拉策德尔成为了明星。</p>\n<p>\n<b>应试被拒</b></p>\n<p>\n安杰丽卡·多姆罗斯的演艺生涯并非一帆风顺。她1941年4月4日出生于柏林白湖，在柏林市中心长大，从小就没有父亲在身边。还是小学生的石油，她就参加了\"小天才之家\"的戏剧班。16岁时，她参加波茨坦电影电视学院的招生未能过关，但之后不久，史拉坦·杜多（Slatan Dudow)聘请她在《爱的困惑》一片中扮演了一个角色。此后，电影学院又录取了她。毕业后，安杰丽卡·多姆罗斯1961年在柏林剧团获得了一个职位，参加了数部布莱希特戏剧作品的表演，1966年被评为年度最佳女演员。</p>\n<p>\n<b>舞台与波希米亚</b></p>\n<p>\n1967年，安杰丽卡·多姆罗斯转到柏林人民舞台当演员，并且同时为东德国有电影公司德发制品厂拍片。她扮演了各种各样的角色，比如在《朱莉亚活着》一片中饰演一名被男友抛弃的怀孕护士，在《谋杀纪事》中扮演一名为父母报仇的犹太人，在冯塔纳的《艾菲·布里斯特》（导演：沃夫冈·鲁德尔，Wolfgang Luderer）中扮演一个因出轨而遭到社会唾弃的孤独的妇女。安杰丽卡·多姆罗斯分别于1971、1973和1975年荣获民德年度最佳电视表演艺术家称号。1976年，她嫁给了与她同舞台，共同拍片的同事赫尔马·塔特（Hilmar Thate)。两人都喜欢开快车，喜欢波希米亚生活。</p>\n<p>\n<b>第二生命</b></p>\n<p>\n在对作曲家沃尔夫·比尔曼（Wolf Biermann)1976年被剥夺东德国籍表示抗议后，安杰丽卡·多姆罗斯和赫尔马·塔特就几乎再也没有接到过角色。1980年，两人决定离开东德。到了西方后，彼得·札德克（Peter Zadek)聘请安杰丽卡·多姆罗斯在法拉达作品改编的电影《每个人都孤独地死去》中扮演角色。之后，她和赫尔马·塔特一起加入了西柏林的席勒剧院。安杰丽卡·多姆罗斯在西德只拍了少量电影，而且只是电视电影，比如弗朗克·贝耶斯（Frank Beyers)的婚姻剧《第二层皮》，埃贡·君特（Egon Günther) 的《汉娜从8至8》。1986年她出演了赫尔穆特·迪特（Helmut Dietl)的经典连续剧《皇家基尔》（《Kir Royal》，在其中扮演一位成功的唱片出品人。在90年代初席勒剧院关门后，安杰丽卡·多姆罗斯的个人生活不再那么光彩耀眼。她也时常与酒精作伴。</p>\n<p>\n<b>以劫机者形象告别荧幕</b></p>\n<p>\n两德统一后，安杰丽卡·多姆罗斯1991年参加了她一生中最重要的导演--克洛夫的电影拍摄。在爱情片《过错》一片中，她扮演了一位曾经在东德一个村庄，后来恋上一位西德码头工人的清洁女工。此外，她还在连续剧《报警电话110》中扮演刑警维拉·比勒维斯基。90年代，安杰丽卡·多姆罗斯自己为席勒剧院和约瑟夫城的维也纳剧院编导了几部剧，但没有获得太大反响。2011年，安杰丽卡·多姆罗斯最后一次拍片，在贝恩特·伯里希(Bernd Böhlich）的一部喜剧片中扮演一位魅力十足的退休老人。为了追求个人自由，她和一群老人一起劫持了一架飞机。这个角色和她敢作敢为的性格非常符合。</p>\n<p>\n2003年，安杰丽卡·多姆罗斯出版了自传《捕捉我自己--我的一生》。该书以萨拉·基尔施（Sarah Kirsch)的一首诗《难过的一天》作为开头。她认为该诗反映出她的精神面貌：一个能量、反抗与优雅的综合体，怀着对自己的陌生感，在一个令她感到距离的世界里。该诗写于1973年，也就是《保罗和保拉传奇》问世的那年。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息</i>！</p>"
    },
    {
      "post_id": 144,
      "title": "DW 越美举行海上联合演习",
      "date_published": 1335167700,
      "body": "\n<p>\n河内</p>\n<p>\n南中国海主权争议持续之际，越南和美国本周举行海上联合演习。美国第七舰队的三艘战舰周一（4月23日）抵达越南中部海港城市岘港，计划同越方人员一起进行为期5天联合救援与紧急行动演练。此次演连不含作战内容。除中国外，越南、菲律宾、马来西亚和文莱等国家也对南中国海提出部分主权要求。国际危机小组研究所在今天发表的一份报告中提出警告说，随着中国近期派出多艘海监船，南中国海冲突可能激化。</p>"
    },
    {
      "post_id": 143,
      "title": "DW “留德华”们讲述留学的点滴体会",
      "date_published": 1422780000,
      "body": "\n<p>\n<b>\"为什么选择来德国？\"</b></p>\n<p>\n--\"因为我学的是德语\"。正在波恩大学留学的陈同学和何同学不约而同地说出了这句话。她们都是同济大学的研究生。因为同济大学与波恩大学有合作交流项目，因此她们有机会来德国交流一年。由于专业的原因，所以她们都想到德国体验一下；</p>\n<p>\n--\"能够支付得起我的生活费用而且德国大学的名声还不错\"。在柏林上学的徐同学以前来过德国实习，对德国印象不错，所以回国之后努力挣钱，然后重返德国。</p>\n<p>\n-- \"像我这个学机械的,在德国也算是机械传统强国吧\"。在锡根大学念机电一体化的胡同学同样由于价格便宜，而且慕德国名声而来。</p>\n<p>\n-- \"可能也是因为中国现在的就业市场不是很好\"。在明斯特大学上学的王同学如是认为。</p>\n<p>\n……</p>\n<p>\n抱着不同的目的，怀着不同的期待，\"留德华\"们踏上这块与中国远隔千里的异国土地。旅程开始了，他们有了什么样的经历呢？</p>\n<p>\n当他们被问到\"最喜欢的是什么\"的时候，何同学觉得上课形式很自由，她发现老师和学生很多互动，学生很积极发言， \"感觉自己也特别想学习\"；陈同学则\"喜欢朋友之间的拥抱\"，而且她最快乐的时候是跟朋友在一起。何同学和胡同学也表达了同样的感受。学机电一体化的胡同学在锡根大学参加了一个社团，跟团队的同伴一起制造赛车去参赛，\"感觉还真能学到很多东西\"；柏林的徐同学在中国经历过实习工作之后，对大学课程还是乐在其中，\"最喜欢的是课程内容很有趣\"；……</p>\n<p>\n除了讲述最喜欢的事情，\"留德华\"们还对德国的空气、环境称赞有加。还有对学生提供很多的优惠，例如坐车，保险等等。胡同学还很欣赏德国很多人性化的设施，例如公交车有专门方便残疾人或者老人上下车的设置。</p>\n<p>\n\"留德华\"们分享了他们的开心时刻之余，也讲述了在异国他乡所遇到的种种困难，例如：</p>\n<p>\n尽管自由的上课形式让何同学很喜欢，可是她也苦恼于\"上课听不懂\"。何同学虽然在国内是德语翻译专业，不过由于交流项目规定必须上日耳曼语言文学的课程，很多内容没有接触过，所以不容易听懂。另外，何同学还经历过艰难的找房子过程。\"由于文化和语言的差异\"，不容易找到，\"投十封，可能有一两封回\"。</p>\n<p>\n与她参加同样交流项目的陈同学在课程上也有同样的困难。此外，陈同学还感觉到有时候营业员对自己的\"一种距离感 \"，这让她感到害怕。</p>\n<p>\n柏林徐同学和锡根胡同学都谈到了德国网络公司给他们造成了不便，徐同学直接吐槽：\"签了两年的合约，过了一个多月的时间才慢慢吞吞来我家装网络，打电话给客服非常困难接通，而且没有英语服务。\"</p>\n<p>\n充满期待地来到德国之后，一些留学生看到了许许多多新鲜的事物，有自由快乐的时光，但是也没少受挫。由于语言障碍，由于文化差异，由于习惯不同等等等等，在生活和学习上常有不如意的时候。那么与中国的大学学习生活相比，有什么不同呢？</p>\n<p>\n\"留德华\"们明显感到德国的学生生活跟中国的不一样。陈同学说：\"在国内，学校什么的都帮你组织好了。你去做就好了。在这边，你要更多的自己去关心，这件事情到底是怎么样?\"；她还说，\"寝室生活也不一样。这边我们住的宿舍，国际化，来自不同国家，男的，女的，大家都在一块。在国内，都是女生宿舍就是女生宿舍\"；何同学和胡同学都觉得德国人的业余活动很无聊。何同学觉得\"这边他们更喜欢亲近大自然的。我们的活动，感觉是更喜欢一群人。\"</p>\n<p>\n留学的这段时间里，他们免不了接触了到德国人，或成为了朋友，或只是见过几面，甚至只是聊过几句，甚至没有交谈过。那么德国人怎么样的人呢？陈同学和胡同学都谈了他们对德国人的印象。</p>\n<p>\n陈同学觉得，\"德国人做什么事情，要把这个来龙去脉要搞清楚。……一件事情，如果跟你理论的话，一定会跟你讲情楚，而且会去争取自己的权益。\"她举了个例子，有一次她坐公交车，有一位女士要下车，可是司机没有开，后来这个女士又按了，最后司机开了。然后这位女士下车走到司机身边，把事情说清楚，搞清楚之后，跟司机友好地道别了。\"对事不对人，她要把事情搞清楚，不是对你这个人有意见。\"</p>\n<p>\n胡同学感觉德国人\"做事一板一眼\"，\"挺严谨的\"；如果深入了解的话，\"内心还是很火热的\"。</p>\n<p>\n在德国经历了许许多多的事情之后，毕业以后他们又何去何从呢？</p>\n<p>\n胡同学打算毕业之后\"最好尽量找份工作，在这边积攒更多经验\"，而暂时没有长远打算。参加交流项目的陈同学和何同学在项目结束之后都得先回国，至于回国之后还会不会来呢？她们都表示因为家人和朋友大部分都在中国，而更喜欢在中国发展。何同学还说，\"也有同学想在德国找工作，他们觉得这边的机会或者条件可能更好。\"</p>\n<p>\n不管以后是 留在德国，还是回国发展，他们的经历对于未来想来德国的学弟学妹们都是有值得借鉴的地方。那么他们对有兴趣来德国留学的中国人有什么建议呢?</p>\n<p>\n胡同学：\"把语言学好；要锻炼自理能力。\"</p>\n<p>\n何同学：\"准备一个好的心态，能够接受一个跟中国完全不一样的生活方式和学习方式。\"</p>\n<p>\n徐同学：\"要明白自己想要什么，要多了解德国人的文化，要多和德国人交流，要融入这个社会。\"</p>\n<p>\n陈同学：\"有一个开放的心态，去接受这边的新文化。当然，还有一点，应该保持中国人应该有的传统。可以两者结合是最好的。\"</p>\n<p>\n王同学：\"学德语很重要……主动地参加别人的活动。\"</p>\n<p>\nPS：准备来德前，不妨浏览德国之声中文网\"留学德国\"专题为您准备的各种小贴士。</p>"
    },
    {
      "post_id": 142,
      "title": "DW 越南风靡阳台种菜",
      "date_published": 1460276640,
      "body": "\n<p>\n（德国之声中文网）越南媒体有关食品污染丑闻的报道接连不断。消费者对食品安全越来越不信任。一方面是食品不卫生导致人们生病。据越南食品安全部门公布的消息，2015年越南共发生171起食品中毒事件，造成5000人中毒，23人死亡。另一方面，是蔬菜水果受到农药污染。来自中国的这类农药\n<a href=\"/zh/中国食品安全漏洞巨大/a-17805141\">污染产品</a>已经引起人们的广泛注意，但是越南本国农产品也越来越多地受到污染。</p>\n<p>\n<b>开垦\"城市菜园\"</b></p>\n<p>\n当下，让居民吃上\"清洁和安全的蔬菜\"不仅在河内和西贡等大城市，而且在乡村也日益成为人们讨论的话题。消费者对食品安全越来越不放心。在市场上，他们互相交流着哪里种植和出售的食品比较安全等信息。科隆大学全球南部研究中心的研究员库尔福特（Sandra Kurfürst）向德国之声表示，为了买到较安全的食品\"人们宁愿跑遍半个市区，就为了去一个值得信赖的商贩那里买肉，到另一个值得信赖的商贩那里买菜以及去第三家店铺买油和米。\"了解河内交通状况的人都知道，这样的采购有可能要耗费几个小时的时间。</p>\n<p>\n为了减少品污染的风险，许多河内的中产阶级人士开始利用房与房之间的空地，阳台或屋顶来种植蔬菜。研究员库尔福斯特对2014年和2015年越南城市居民自给自足的情况进行了调查研究。她很快就发现，自己种植更清洁蔬菜在越南已经成为一个\"热门话题\"。人们也对\"开垦自家菜园，自给自足越来越感兴趣。\"喜欢自己种菜的主要原因除了食品安全的因素之外，也是作为缓解大城市紧张生活的一种业余消遣。种植的蔬菜品种主要是香菜和泰国罗勒香草以及豆芽、西红柿和辣椒等等。</p>\n<p>\n<b>有限的环保意识</b></p>\n<p>\n现在，就连当地媒体也发现了这一趋势。库尔福斯特说：\"媒体不仅大量报道食品安全问题，同时也在关注人们自种水果、蔬菜的趋势。\"众多的用户群，特别是一些年轻人经常在Facebook等社交网站上相互交流最佳种植技术。</p>\n<p>\n不过库尔福斯特也观察到人们缺乏更大范围的环保意识。她说：\"居民在自己种植蔬菜的时候，常常忽略进一步的安全问题。他们很少去考虑土壤和水是否受到污染。\"库尔福斯特列举了河内西湖岸边的一个\"城市菜园\"为例。她说，一些城市居民在那里开垦了一片空地种植蔬菜。空地的后面是一家酒店。酒店的污水未经处理直接排放到湖里。而种菜的居民就用湖里的水来浇灌浇菜。她认为在这方面还需要做大量的宣传教育工作。</p>\n<p>\n由于在阳台和房顶种菜不能满足一家人的需求，很多居民还要额外购买蔬菜。由于2007年和2008年发生两起严重霍乱瘟疫，引发了全国范围的一场卫生运动。政府采取了相关措施。库尔福斯特说，政府颁布了\"有关食品安全的各种法规。\"她认为，\"这是朝着正确的道路迈出的良好一步，但是还有待进一步落实。\"</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 141,
      "title": "DW 德国选项党反伊斯兰教路线遭批评",
      "date_published": 1460983020,
      "body": "\n<p>\n（德国之声中文网）德国穆斯林中央理事会主席马兹耶克（Aiman Mazyek）甚至把德国选项党反伊斯兰教的立场与纳粹的反犹主义相提并论。他在接受北德广播电台（NDR）采访时表示，这是\"自希特勒德国以来首次有一个政党诋毁、威胁一个宗教社群的存在\"。</p>\n<p>\n马兹耶克说，自由民主的基本秩序不是选项党想要的，而是他们想消灭的。\"因此他们现在所要求的不是一场有关伊斯兰教的讨论，这是违悖基本法的。\"\"与德国基本法格格不入的不是伊斯兰教，而是选项党。\"</p>\n<p>\n上周日（4月17日）德国选项党（AfD）领导人表示，对伊斯兰教的批评性政策将是该党纲领的一个重点。该党副主席冯施托尔西（Beatrix von Storch）在接受《法兰克福星期日汇报》采访时说：\"伊斯兰教是一种与我们的基本法格格不入的政治意识形态。\"</p>\n<p>\n选项党勃兰登堡州议会的党团主席高兰德（Alexander Gauland）也提出过要警惕\"德国的伊斯兰化\"，他说：\"许多穆斯林是德国的一部分，但伊斯兰教不是德国的一部分 。</p>\n<p>\n<b>政府发言人：宗教自由要保障</b></p>\n<p>\n上述论调引起德国多个政党代表的批评。执政党之一基民盟议会党团的宗教事务专员荣（Franz Josef Jung）对《世界报》表示，选项党的一些立场日趋极端化。基民盟副主席克勒克纳（Julia Klöckner）也表示，选项党以其论点在民众中制造恐惧。她周一在柏林表示：\"谁符合不符合宪法不是一个党说了算。我们有三权分立的制度，独立的法庭会做出判断。\"</p>\n<p>\n对德国选项党领导人言论引起的争论，联邦政府发言人赛博特（Steffen Seibert）周一在柏林表示，根据德国基本法第四条，宗教信仰、世界观、价值观等表达自由的权利受到保障。这位发言人称，默克尔总理曾多次强调，伊斯兰教毫无疑问是今日德国的一部分。</p>\n<p>\n在野的社民党宗教事务专员格里泽（Kerstin Griese）也批评选项党\"以危险的方式煽动毫无根据的偏见\"。她说，生活在德国的90%以上的穆斯林都是遵守基本法的，而选项党所要求的对宗教活动设限的做法则是违反基本法关于信仰自由的原则的。</p>\n<p>\n左翼党宗教政策发言人布霍尔茨（Christine Buchholz）批评德国选项党通过其仇视伊斯兰教的观点\"毒化社会氛围\"，煽动针对穆斯林的\"种族歧视\"。她认为，这样一个政党要为德国针对难民收容所的袭击案数量持续增长承担部分责任。</p>\n<p>\n<b>还没商量好</b></p>\n<p>\n在选项党内部，反伊斯兰教的路线也引起了争论和批评。莱法州选项党主席荣格（Uwe Junge）周一在接受德意志广播电台采访时表示，施托尔西和高兰德的表述并不代表该党在这一议题上的最终态度，他认为写入党纲的立场将\"更为全面、客观\"，对伊斯兰\"原教旨主义\"和在德国与他人合平共处的穆斯林应该有所区分。但他同时强调，近期大量年轻穆斯林难民涌入德国，在伊斯兰教极端化趋势的背景下，这可能对德国社会构成威胁。\"伊斯兰教是一个政治性宗教，它没有我们一般认为宗教应该具有的隐忍克制、世俗性等特点。\"</p>\n<p>\n德国选项党将在两周后举行的代表大会上通过第一份基本纲领。草案中涉及伊斯兰教的内容包括，要求禁止伊斯兰教的宗教象征进入公共场合，例如禁止清真寺建高塔、用扩音器召唤祈祷以及女性穿着遮盖全身（包括面部）的罩袍。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息</i>！</p>"
    },
    {
      "post_id": 140,
      "title": "DW 印防长访华   敏感话题不少",
      "date_published": 1460984520,
      "body": "\n<p>\n（德国之声中文网）印度国防部长帕里卡尔（Manohar Parrikar）本周一和周二到北京访问，中国官方媒体和政府机构基本沉默，几乎未作报道。 印度媒体则对此次访华之行给予不少关注，并称，两国间数十年来悬而未决的喜玛拉雅地区边界争议属于此行中心议题。</p>\n<p>\n另一件事情可能会扮演至少同样重要的角色：美国新近加强努力，在军事和安全政策领域与印度结盟，以遏止中国的影响。</p>\n<p>\n美国国防部长卡特几天前刚访问过新德里。这位五角大楼负责人结束访印之行后眉飞色舞，对《纽约时报》表示，\"在国际关系上，美印双边关系对21世纪具有具有决定性意义。这一关系现在就已越来越快、越来越明显地在成为现实\"。</p>\n<p>\n<b>华盛顿争取新德里</b></p>\n<p>\n而另一方面，印度国内在对华政策上也已有广泛共识。柏林科学与政治基金会南亚问题专家瓦格纳（Christian Wagner）在接受德国之声采访时表示，面对中国，过去两年来，莫迪为首的印度新政府强化了与美国的关系，例如，两国发表了关于确保南中国海通航自由的共同声明。他指出，印度也同越南和菲律宾等与中国有外交纠纷的东南亚国家合作。他强调，若从中国的角度看，印度在这里采取的是何种政策再清楚不过。他认为，印度正越来越明显地成为某个松散国家集团的成员，该集团致力于制定并实施一种抗衡中国主权及强势要求的战略。</p>\n<p>\n<b>争议与合作并存</b></p>\n<p>\n与此同时，涉及与中国的领土纠纷，印度不得不努力同这个在军事、经济上均高出一头的邻居进行合作、取得谅解。《印度时报》便指出，在就任防长以来的首次访华之行中，帕里卡尔有意安排去成都，访问新组建的解放军西部战区总部。该报强调指出，西部战区是在解放军改革框架内首次建立，负责对整个有争议地区的防卫，中国在相关地区的军事能力由此大为增强。</p>\n<p>\n印度《防卫新闻》写道，边界争议问题\"变得更加复杂，虽数十年谈判，仍未得到解决\"。该报认为，将来的情况也不会有多少好转，因而，两国必须设法在别的领域加强合作，例如在经济领域。</p>\n<p>\n德国科学与政治基金会东南亚事务专家瓦格纳也强调，除边界纠纷外，印中之间还有一系列共同安全政策议题。他指出，鉴于明年正式加入上合组织，印度将强化与中国在中亚的合作；伊斯兰恐怖主义也是两国面临的共同威胁：两国已多次举行联合反恐演习。</p>\n<p>\n<b>中巴友谊</b></p>\n<p>\n不过，在反恐问题上，印中之间也存在分歧。一段时间以来，新德里一直要求将一些巴基斯坦武装组织成员列入联合国制裁名单，而出于对巴基斯坦的荫庇，中国迄今予以阻挠。也就是说，巴基斯坦可以继续指望获得中国方面的\"全天候友谊\"。尤其是印度在美国外交政策中明显增值后，北京的\"友谊\"对伊斯兰堡来说意义便更大。</p>\n<p>\n巴基斯坦对计划中的从印度洋至中国西部的中巴\"经济走廊\"项目寄予厚望。未来数年，总投资达460亿美元的该项目实际上是国家的一个大规模经济计划，投资将不限于基本设施，而且也包括能源领域。</p>\n<p>\n巴基斯坦新近刚指控印度，企图破坏该经济走廊的建设。巴方还在俾路支省（Belutschistan）逮捕了一名曾为印度海军军官的\"间谍\"。这样，中国怎么着也是\"卷入了\"印巴纠纷。帕里卡尔防长在访问北京时当会记着这一点。</p>\n<p>\n<em><span lang=\"ZH-CN\" style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\">使用我们的</span></em><em><span style=\"font-size: 10pt; font-family: &quot;Arial&quot;, &quot;sans-serif&quot;; color: #222222\">App</span></em><em><span lang=\"ZH-CN\" style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\">，阅读文章更方便！给</span></em><a href=\"mailto:yingyong@dingyue.info\"><em><span style=\"font-size: 10pt; font-family: &quot;Arial&quot;, &quot;sans-serif&quot;; color: blue\">yingyong@dingyue.info</span></em></a><em><span lang=\"ZH-CN\" style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\">发送一封空白电子邮件就能得到软件和相关信息！</span></em><em><span style=\"font-size: 10pt; font-family: &quot;SimSun&quot;, &quot;serif&quot;; color: #222222; mso-bidi-font-family: SimSun\"><o:p></o:p></span></em></p>"
    },
    {
      "post_id": 139,
      "title": "DW 医生太难当 考生另选择",
      "date_published": 1434526080,
      "body": "\n<p>\n（德国之声中文网）在德国，医学系不仅有招生名额限制，分数线也最高。与此相应，医学毕业生待遇也不菲。在不久前公布的一项德国起薪最高的行业排行榜中，口腔医学和医学分别排名第十和第四位，其中医科毕业生的平均入行起薪为年收入4万9700欧元。</p>\n<p>\n但在中国，医学却不再是热门。据报道，近年来，各医科院校的临床医学专业分数线下滑，非临床专业则门可罗雀。许多医科院校的招生计划人数远多于上线报考人数，甚至连医科名校，比如北京协和医学院在一些招生地区也面临所谓的\"断档\"局面。医学毕业生的\"起薪\"也让人大迭眼镜。据广东省教育厅2014年高校毕业生就业数据，该省医学本科毕业生初次就业平均月薪为2811元，比全省本科毕业生初次就业薪酬低10.7%；研究生毕业初次就业平均月薪为4042元，比全省毕业研究生初次就业薪酬的平均水平低21.5%。而在许多其它省份，医学毕业本科生和研究生的起薪还远远不能达到广东的水平。</p>\n<p>\n付出与收入不成正比</p>\n<p>\n郑州一所医院的郭医生表示，学医不仅学制长，而且入行门槛非常高，比如想进三甲医院起码要是硕士毕业，甚至是博士毕业。而当医生生活不规律，经常加班、值夜班，压力巨大，收入却相对不高。毕业于四川大学的一位医学女博士毕业生也向德国之声表示，医学专业本科本来就比一般本科学制长一年，而很多医院基本不招本科毕业生，而是至少要招硕士生，甚至博士生。进了医院后，这些硕士、博士毕业生还必须接受一到两年的规范化培训，在此期间月薪仅3000元左右。许多人算了算学医的成本，觉得待遇很差。不仅如此，近年来频频发生的医闹风波、医患矛盾导致的恶性事件更令医生这一职业不再令人向往。比如今年4月，四川省医院普外科主任医生周晓辉就疑因不堪长达8个月的医闹压力在家中自缢身亡。</p>\n<p>\n伤医事件频频发生</p>\n<p>\n衡阳一所医科大学附属医院的何医生向德国之声表示，许多像他这样的医生都不愿让自己的子女再学医。\"医生职业的辛苦是一个原因，但我觉得最大的原因是医患关系恶化，医生行医风险程度在增加。最近频繁出现伤医害医事件，衡阳也有医闹，伤医生、杀医生，还有医生被扒光衣服游行的事件。\"</p>\n<p>\n据中国媒体报道，本周二（6月16日）广西又发生一起严重的伤害医生的事件。广西医科大学附院放疗科的一名覃姓副主任被一名鼻咽癌患者泼汽油大面积烧伤，重度烧伤面积达30%-35%。</p>\n<p>\n何医生表示，现在不管是医生还是护士都对医患关系的恶化感到痛苦。以前医患之间是信任的关系，但现在患者从进医院起就存在与医生的对立。患者担心医生会不会不负责任，会不会过度检查，过度开药，从药品中提成。而医生则会有防范心理，担心患者会不会是难缠的人。山西太原一位医生在接受德国之声采访时也谈到，目前过度治疗、过度开药的风气确实很严重，其中很大原因在于医生的付出和收入不成正比，只有通过开药提高收入。此外，药品定价还涉及到层层利益，许多公立医院实行企业化管理，往往给各科室定创收任务。</p>\n<p>\n政府不作为</p>\n<p>\n广东一所市级医院副院长、心脏外科医生表示：\"大多数医院的正规收入不多，而社会风气和政策也间接支持和鼓励灰色收入。一旦有问题时，灰色收入成为指责医生的原罪。政府的不作为、媒体的误导，民众的不理解，一些医生的低素质，造成了现在尖锐的矛盾。这些情况短时间很难转变。\"</p>\n<p>\n衡阳何医生也认为，对于医患矛盾的加剧，政府和媒体都有不可推卸的责任：\"媒体为了吸引眼球，在医患矛盾出现时，常常偏向患方报道，耸人听闻。而政府对于伤医者必须加强惩治。现在是病人一闹，哪怕出现伤医事件，也不做刑事处理，盲目维稳。此外，政府应该加大对医疗的投入，不要把所有负担都加在患者身上。否则患者期望值会太高。因为医学不像其它行业，花了钱就会取得效果。当然，提高医务人员的水平也很重要。\"</p>\n<p>\n\"高考结束，万一没考好，就报医学院吧。估计二十年后，这个行业还行。\"一位成都医生在微博中感叹道：\"三十年河东三十年河西，人吃五谷杂粮，郎中还是需要的。\"</p>"
    },
    {
      "post_id": 138,
      "title": "DW 中国经济增速趋缓 问题依旧",
      "date_published": 1460701800,
      "body": "\n<p>\n(德国之声中文网）中国经济今年第一季度与去年同期相比只增长了6.7%, 这是七年前爆发全球金融危机以来，世界第二大经济大国经济增幅最低的一次。不过，就总体经济数据而言，中国经济已显示出较为稳定的迹象，因为金融投资，工业生产以及零售业均得到出乎意料的增长。</p>\n<p>\n有鉴于此，中国国家统计局发言人表示，今年经济形势\"有一个良好的开端。\"经济增长又恢复了活力。不过，此番经济增长很大程度上得益于大量贷款的投入，因此，发展势头能够持续多久不得不被质疑。房地产市场从贷款业务扩大范围中受益最多。仅今年三月的房产贷款额度就比去年同期增加了1880亿元人民币。而金融投资的增幅更加出人意料，进入今年以来已经增加10.7%。而去年同期的增幅则为10%。</p>\n<p>\n工业生产的增幅为5.8%(去年同期为5.4%)。专家认为，新的五年计划开始实施以来，更多的资金进入市场，但一些长期性的问题并没有因此得到解决。欧洲商会主席武特克（Jörg Wuttke）对德新社表示：\"今后几个月内经济将呈现平稳发展的状态，但诸如债务负担，生产过剩，需求疲软以及金融市场过热等造成的根本性问题将在年底的时候显示出弊端。\"\"现在还谈不上经济出现了转机，只是得到了暂时缓解。\" </p>\n<p>\n深圳汇丰银行商业学校的巴尔丁（Christopher Balding)表示，目前的经济增长是通过急速增多的贷款发放得以实现的。这位经济学家表示；\"这也暴露了中国领导人对中国经济实际状况的评判。他们很担心，如果政府不提供进一步支持，经济一旦进一步下滑将会引发其他问题。\"他认为，一味增加贷款数额，而不进行必要的改革，是中国一个长久性的问题，但并没有得到重视。</p>\n<p>\n6.7%的经济增幅符合政府此前给出的6.5 - 7.0%的发展目标。去年中国的经济增长率为6.9%,是过去25年来，经济增幅最低的一次。不过对于官方数据的准确性，外界也有一些质疑。</p>\n<p>\n国际货币基金也认为中国经济发展出现趋于稳定的势头，因而在本周早些时候将其预估值上调了0.2%个百分点，达到6.5%,理由是中国国内市场需求表现强劲。服务业的增长抵消了制造业的疲软。中国国家统计局称，今年第一季度服务业确实增加了7.6%，而服务业占总体经济的份额更提升了两个百分点，达到56,9%。国际货币基金发布的预估报告中，也对影响中国经济稳定的风险发出警告，比如企业业绩欠佳以及高额的不良贷款。鉴于改革乏力，企业及金融领域风险增多，有人担心，中国经济发展将在中期内出现问题。而中国经济的跌幅如果超过预期，将对全球经济产生“强烈的负面影响。”</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 137,
      "title": "DW 欧中钢铁争议持续",
      "date_published": 1461071700,
      "body": "\n<p>\n（德国之声中文网）周一（4月18日）晚间，在布鲁塞尔举行的有关钢铁市场严峻形势的会议上，欧盟贸易专员玛姆斯托姆（Cecilia Malmström）对中国出口廉价钢铁产品表示不满。欧委会已针对中国实施一系列反倾销、反补贴措施。</p>\n<p>\n玛姆斯托姆在经合组织的这次会议上说，对许多企业而言，这是事关生死的时刻。</p>\n<p>\n德国钢铁业联合会的马丁·图林格（Martin Theuringer）参与了经合组织的此次会议。他在接受德国之声电视台采访时表示，目前全球钢铁业在产能过剩、利润和贸易冲突方面，正面临50年来最大的挑战。他说，需要全球多边共同解决这一问题，而经合组织会议的结果令人有些失望。<br>\n<br>\n图林格表示，无论是欧洲还是其它各方都不希望与中国发生贸易战，但他强调，鉴于“中国的大规模倾销”，必须加强反倾销措施。<br>\n<br>\n图林格称，中国在全球钢铁市场占有一半的份额，同时，其过剩产能占全球的三分之二。他表示，欧盟钢铁业自2008年以来已削减产能1100万吨，还将继续削减过剩的产能。</p>\n<p>\n\n\n</p>\n<p>北京驳斥指责</p>\n<p>\n但中国贸易部副部长张骥驳斥这样的指责。他说，中国出口的钢铁产品仅占总产量的14%。钢铁市场上供过于求的主要原因在于经济增长趋缓。</p>\n<p>\n今年2月，中国宣布计划裁减钢铁煤炭行业约180万个就业岗位。</p>\n<p>\n2015年，欧洲钢铁工业约有32.8万名员工。此外，钢铁行业也是汽车等工业重要的供货商。经合组织宣布，今年将再度举行会议，就钢铁市场困难形势举行磋商。</p>\n<p>\n<b>欧委会\"反思\"国家补贴</b></p>\n<p>\n在钢铁行业国家补贴的争议上，欧盟内部市场专员别恩科夫斯卡（Elzbieta Bienkowska）发出信号，欧委会可能作出让步。她向《法兰克福汇报》表示：\"我们必须讨论，在如何判断国家补贴的问题上采取更灵活的态度。\"</p>\n<p>\n根据目前的规定，欧委会必须拒绝成员国为本国企业提供补贴。别恩科夫斯卡认为，鉴于钢铁行业的困难形势，欧委会至少应当反思这一做法。她说，欧盟必须商讨继续为该行业减负，\"也包括碳排放交易的负担\"。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 136,
      "title": "DW 奥朗德赢得法总统选举首轮投票",
      "date_published": 1335169440,
      "body": "\n<p>\n巴黎</p>\n<p>\n社会党人奥朗德（Francois Hollande）以微弱多数赢得昨天举行的法国下届总统选举首轮投票。根据周一（4月23日）公布的官方正式计票结果，奥朗德获得28.63%的选票；竞选连任的现总统萨科齐的得票率为27.18%。极右翼政党国民阵线主席让-马丽·勒庞（Jean-Marie Le Pen）获得17.9%的选票，位居第三。根据选举法的规定，作为得票率领先的前两名候选人，奥朗德和萨科齐将在两周后（5月6日）的第二轮投票中对决。参加下届总统竞选的共有10人，选民投票率为79.47%，居数十年来投票率的中游水平。根据迄今的民意调查结果，奥朗德有望赢得第二轮投票，成为法国下届总统。</p>"
    },
    {
      "post_id": 135,
      "title": "DW 维基解密嫌疑线人曼宁出庭受审",
      "date_published": 1328384040,
      "body": "\n<p>\n华盛顿</p>\n<p>\n涉嫌为维基解密（WikiLeaks）提供信息的美军士兵曼宁（Bradley Manning）在美国一家军事法庭出庭受审。法院怀疑这位已经被解雇的士兵和曾经的情报专家在伊拉克服役期间为维基解密提供了超过70万份有关美军和外交人员的秘密情报。相关文件在网络上的曝光使得美国政府一度陷入外交危机。美国军方指控曼宁犯有22项罪行，其中包括通过网络非法散布秘密文件和支持敌人。假如这些罪名被判定成立，曼宁有可能面临终身监禁。</p>"
    },
    {
      "post_id": 134,
      "title": "DW 德国人主张对快捷咖啡盒收取押金",
      "date_published": 1460183220,
      "body": "\n<p>\n（德国之声中文网）用一小盒快捷咖啡可以很快制作一杯咖啡，简易、方便，但是却也制造了大量垃圾。因此，这种小包装的快捷咖啡成了环保人士的眼中钉。根据YouGov市场研究所的一项调查，53%的德国人主张像对塑料瓶饮料收取几欧分押金那样，也对快捷咖啡盒收取押金，让消费者在退回包装盒时拿回押金。</p>\n<p>\n根据德国产品检验基金会的统计，2003年，仅德国的快捷单杯咖啡就制造了13000吨的铝、塑料和有机垃圾。</p>\n<p>\n从理论上来说，空咖啡盒是可以回收再利用的，但是实施起来并非容易，而且每个品牌之间也存在差别。例如对奈斯派索（Nespresso ）铝制空咖啡盒的回收再利用就比较简而易行，而克里格绿山（Keurig Green Mountain）单杯咖啡的塑料盒的回收再利用就十分复杂。该\n<a href=\"/zh/雀巢入股徐福记集团/a-15225753\">咖啡制造商</a>已经表示，在2020年之前研制出方便回收再利用的包装盒。因为对目前的废包装盒需要分别将纸、金属和塑料部分分离之后才能再分别处理。</p>\n<p>\n就连这一单杯咖啡的发明者之一，克里格绿山咖啡公司的其中一位创始人西尔万（ John Sylvan）现在也对包装造成的垃圾感到担忧。他说，只要一想到给环境带来的后果，他就感到心情沉重。</p>\n<p>\n<b>制造商和立法机构应采取措施</b></p>\n<p>\n在德国第二大城市汉堡，所有市政机构都已不再使用快捷咖啡机和与其配套的快捷咖啡。德国联邦议院的绿党代表最近称发展快捷单杯咖啡是误入\"生态歧途\"。他们表示，\"如果企业不尽快拿出自己的保护资源和减少垃圾的方案，就需要立法机构采取措施。\"绿党的网站刊文说，实行征收押金或者环保税有助于解决垃圾问题。如果不采取这些措施，就要考虑通过颁布新的\n<a href=\"/zh/德国垃圾分类再利用的发展历程/a-18671671\">可再生原料</a>法来解决问题。</p>\n<p>\n绿党议员梅瓦尔德（Peter Meiwald ）向德国之声表示，大多数德国人支持对咖啡盒\"征收押金\"。现在轮到制造商和立法机构落实于行动了。</p>\n<p>\n<b>复杂的垃圾分类</b></p>\n<p>\n然而，作为奈斯派索快捷咖啡制造商和全球最大食品公司的雀巢公司并不赞成对咖啡包装征收押金的主张。雀巢公司发言人德雷维斯（Achim Drewes ）认为额外的运输会增加成本，因此主张维持现状。此外，雀巢公司已经加入所谓的\n<a href=\"/zh/德国垃圾处理受称赞/a-15904997\">垃圾回收</a>利用系统-奈斯派索快捷咖啡盒因此可以被送入黄色的可回收原料垃圾箱。</p>\n<p>但是德国环境援助协会的索默尔（Philip Sommer）认为仅此还远远不够。他说：\"如果想对废咖啡包装进行最佳分类，就应该将包装盒内的咖啡垃圾倒入有机垃圾箱内，然后再将空咖啡盒放入黄色的可再生能源垃圾箱。但是大多数消费者认为这样做太复杂，也太浪费时间。\"</p>\n<p>\n索默尔认为实行押金制的方案也不尽人意。他说：\"比征收押金更好的办法是对咖啡盒实行纳税。这样才能真正减少快捷咖啡的消费。\"然而，这种强行纳税的办法是否能够实施还值得怀疑。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 133,
      "title": "DW 利用雷达扫雷",
      "date_published": 1460189100,
      "body": "\n<p>\n（德国之声中文网）扫雷工作，是一项全球性的艰巨任务。世界上有61个国家和地区还有布雷区，有25个国家和地区还有集束炸弹炸开后分散在大片区域、因未爆炸而成为哑弹的子炸弹，这些哑弹的危害性丝毫不亚于地雷。</p>\n<p>\n世界上每天都有大约十枚这样的地雷或哑弹爆炸，使人严重受伤、致残，甚至丧生。永久排除这种危害的唯一办法，就是在有关区域大面积扫雷清雷。但这一工作非常艰难、充满危险，而且也旷日持久，并需要训练有素的专业人员。</p>\n<p>\n<b>作业强度极大</b> <b>并需持之以恒</b></p>\n<p>\n一般来说，扫雷作业是一件非常辛苦的手工活儿。扫雷人员必须手持长杆扫雷器，一寸不差地扫描地面，而为了保护自身安全，他们还要穿戴结实厚重的防护服。而偏偏在非洲，雷区不少，在那里扫雷，着实是件苦力活。</p>\n<p>\n扫雷工作，也可借助经过特殊训练的狗犬或者特别的大鼠来完成。这些动物嗅觉敏锐，可以闻到炸药。而较之狗犬，大鼠还有一个优势，就是体重轻，使得它们即便触碰到地雷也极少会引发爆炸。</p>\n<p>\n金属探测器也可用作扫雷器，但它们有一个弱点，就是不能探测塑料或陶瓷炸弹。一旦这些炸弹漏网，其危害性更大。</p>\n<p>\n<b>雷达可以透视土壤</b></p>\n<p>\n现在，德国航空航天中心（DLR）发明的一种技术即可加快扫雷速度，又可使扫雷工作更加安全。该中心位于奥伯法芬霍芬的高频技术与雷达系统研究所研发出一套名为TIRAMI-SAR的雷达扫雷设备。TIRAMI意即\"实施排雷工具箱\"，源自欧盟同名的TIRAMISU项目；SAR则是指\"合成孔径雷达\"成像技术，该技术对不同雷达数据巧妙地进行分析组合叠加，最后可得到高分辨率、很能说明情况的图像。</p>\n<p>\n迄今为止，SAR技术主要应用于航拍领域，用来识别地表情况，如植被、湿度、土壤特性等情况，并以图像表达。</p>\n<p>\n<b>从近而看</b></p>\n<p>\n不过要想扫雷，则需近视。TIRAMI-SAR扫雷设备的雷达发射和接收天线就安装在一辆卡车上，从斜角探测雷区。扫雷人员只要驾驶卡车沿雷区边缘行进，雷达就会自动扫描雷区，而且只需几分钟，就可扫完面积可达100平方米的雷区。2015年9月，这套设备在比利时扫雷部队DOVO/SEDEE的试验场地进行的现场试验，就取得了这一成绩。</p>\n<p>\nTIRAMI-SAR扫雷设备的雷达天线，其工作频率在500到3000兆赫的超高频范围。它借助极其巧妙的算法，把天线在卡车行驶过程当中所接收到的所有雷达信号，分析处理成一张纸的\"强度图\"。之后将这些强度图叠加起来，便可使所有可疑物体\"原形毕露\"。</p>\n<p>\n也就是说，TIRAMI-SAR扫雷设备有助于扫雷人员快速了解一片雷区的大致险情，但最终的排雷工作，还是要按以往作业方式按部就班来的：先看可疑物体是不是地雷，然后再小心地挖出，最后再解除引信。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 132,
      "title": "DW 多国总统拒访乌克兰",
      "date_published": 1335776460,
      "body": "\n<p>\n布拉格</p>\n<p>\n继联邦德国总统高克（Joachim Gauck）后，捷克总统克劳斯（Vaclav Klaus）、奥地利总统菲舍尔（Heinz Fischer）、斯洛文尼亚总统蒂尔克（Danilo Türk）也取消了原定下月中旬参加在雅尔塔举行的中欧国家峰会的安排。奥地利总统府一名发言人表示，“由于时间紧张和内容上的理由”，菲舍尔总统将不出席此次会议。捷克《人民报（Lidove Noviny）》周一（4月30日）援引总统府一名发言人报道说，克劳斯总统取消乌克兰之行的主要原因是对乌克兰反对派领袖和前政府总理季莫申科遭关押事件的质疑。为抗议恶劣关押条件，季莫申科10天前开始绝食，引起国际社会强烈关注。捷克同乌克兰的双边关系持续紧张。今年1月，捷克向季莫申科的丈夫提供政治避难；一年前，捷克收容了乌克兰前经济部长丹尼利欣（Bogdan Danilischin）。</p>"
    },
    {
      "post_id": 131,
      "title": "DW 研究机构降低德国经济增长预估值",
      "date_published": 1460638380,
      "body": "\n<p>\n（德国之声中文网）经济专家们要比联邦经济部长加布里尔谨慎些。加布里尔部长今年一月曾预估，德国本年度经济增长率将是1.7%。四家最重要经济研究机构周四（4月14日）公布了受联邦政府委托撰写的本年度春季评估报告。根据该报告，2017年，德国经济的增长率将只是1.5%，并且，受庞大难民数量影响，德国失业率将趋高：今年，失业人数约270万，明年增加10万，失业率从6.2%增至6.4%。</p>\n<p>\n参与撰写题为\"温和增长\"的该报告的4研究机构分别是慕尼黑经济研究所（Ifo）、埃森的莱因-威斯特法伦经济研究所（RWI）、柏林的德国经济研究所（DIW）、哈勒的莱布尼兹经济研究所（IWH）。</p>\n<p>\n<b>\"风险因素增加\"</b></p>\n<p>\n专家们在报告中写道：\"2016年初始阶段便已清楚，世界经济在此前数月已明显趋冷\"，坏消息在一月及二月导致全球范围出现估值下跌和\"风险感受\"明显上升。报告称，中国迅速的结构转变是其中一个重要原因：\"这个萎缩过程含有重大景气风险，导致外贸对中国意义的降低以及对原料需求的减少\"。</p>\n<p>\n不过，专家们同时指出，一段时间来，越来越多的迹象显示，全球景气不会在2016年上半年继续弱化，本年度世界经济增长率将大致与温和增长的去年持平：\"2016年增长2.4%，2017年为2.8\"，全球贸易量也将温和增长，今年为2.9%，明年3.4%。</p>\n<p>\n报告强调，德国经济处于缓增态势。专家们指出，受惠于能源价格走低而出现持续性就业扩大、薪资明显上升、购买力增强后，经济增长主要由个人消费支撑，对数量庞大难民的衣食及住房的供应导致的支出也成为一种经济推力，此外，低息政策使内需得到刺激。而从世界景气方面则几乎看不到驱动效果。</p>\n<p>\n<b>投资不旺</b></p>\n<p>\n春季评估报告指出，投资活动增势不强，且是两种状况同时出现：由于低息、就业市场发展良好和个人收入增加以及需求明显扩大，住宅建设将继续增长；\"相反，尽管低息以及企业盈利机会良好，工商业建设以及企业的设备投资在一段时间内增长有限，这也是因为，企业的期待值显著下降\"。</p>\n<p>\n在公共财政方面，预算盈余量减少。与移民融入事业相关，政府开支增加，金融政策略呈扩张倾向。由于来自个人收入税、消费税和社会保险费等方面的收入增加、利息支出减少，今年，联邦财政盈余将为110亿欧元，明年为100亿。</p>\n<p>\n<b>敦促实施扶持增长政策</b></p>\n<p>\n专家们在报告中表示，\"在这一背景下，盈余应仅只用于临时性追加支出，或用于旨在长期提升生产潜力的措施\"。这4个经济研究机构在迄今所作的多个共同评估报告中曾一再陈述促经济增长政策的好处：除导致减少就业者税务负担外，还能增加教育及培训投资，从而提高生产潜力。经济专家们写道：\"如果继续过去数年里不以经济增长为取向的经济政策，将不会有经济的持续性增长\"。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 130,
      "title": "DW 功夫不负有心人   SpaceX成功海上回收火箭",
      "date_published": 1460198820,
      "body": "\n<p>\n（德国之声中文网）约9个月之前经历了火箭爆炸事件后，美国私营航天公司SpaceX现今成功向国际空间站发射了运输补给飞船。SpaceX周五（4月8日）于美国东部的佛罗里达州卡纳维拉尔角成功发射一枚\"猎鹰9号\"火箭。</p>\n<p>\n火箭上搭载的\"天龙号\"无人货运飞船装载了大约为国际空间站准备的约三吨物资和装备。其中包括供国际空间站6名宇航员测试的充气式太空舱。按照计划，这艘飞船将会与本周日与国际空间站对接。</p>\n<p>\n成功海上回收</p>\n<p>\n这也是SpaceX首次在海上成功回收运载火箭。这无疑对环保做出贡献。SpaceX的目标是可以回收，重复使用其价格昂贵的运载火箭，以此降低成本，增大可持续性。</p>\n<p>\n之前，这家航空公司的火箭虽然有过陆地着陆的成功经验，但是海上回收却没有收获成果。就在今年1月中旬，一枚\"猎鹰9号\"火箭在太平洋海上回收失败，在成功将一颗卫星送上太空后，火箭在海上回收时爆炸。</p>\n<p>\n去年6月，原本计划飞往国际空间站的\"猎鹰9号\"火箭在发射两份中之后在空中爆炸。SpaceX公司总裁马斯克(Elon Musk)则透露，初步调查结果显示，在\"猎鹰9号\"火箭的上级液氧罐中出现了过压状况。</p>\n<p>\n发射火箭很\"烧钱\"</p>\n<p>\n周五发射成功后，马斯克在推特上写道\"第一阶段已成功，我们当然感到开心。\" 他还透露，发射一枚火箭的燃料成本约30万美元左右，火箭的制造价格约为6000万美元。</p>\n<p>能够反复利用火箭可以节省百倍的成本。马斯克还表示将会对这枚成功海上回收的火箭进行一系列测试，检验其是否可以再次得到使用。如得到理想的结果，两三个月后就可以再次发射这枚火箭。</p>\n<p>\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</p>"
    },
    {
      "post_id": 129,
      "title": "DW 联合国难民署尚无法证实数百难民海上遇难",
      "date_published": 1460980260,
      "body": "\n<p>\n（德国之声中文网）英国广播公司BBC阿拉伯语节目本周一报道说，可能有多达400名难民在海上遇难。意大利外长真蒂洛尼在卢森堡欧盟部长会议间隙表示，一年前发生在利比亚水域的悲剧又重演了。他说，遭遇海难的难民是从埃及出发的，但他没有提到具体的死亡人数。意大利总统马塔雷拉(Sergio Mattarella)也表示，数百人很可能在一场发生在地中海的难民悲剧中失踪。</p>\n<p>\n德国外长施泰因迈尔先前也称，据其掌握的消息，试图越过地中海抵达欧洲的船只翻船，超过300人遇难。但他的一名发言人也强调，这些信息尚未得到证实。</p>\n<p>\n然而，意大利海岸警卫队则表示，他们尚未获悉有关发生沉船事故的消息。位于开罗的索马里大使馆也不能证实发生海难的消息。</p>\n<p>\n联合国难民署和国际移民组织同样表示不能就是否发生海难能提供准确消息。</p>\n<p>\n意大利安莎通讯社称，意大利救援人员在地中海上找到一艘载有6具尸体的难民船。之前，108名难民在获得营救后向救援人员讲述遇难的船只上载有尸体。</p>\n<p>\n据国际移民组织的统计，去年有3700多人在跨越地中海时遇难身亡，今年在地中海上丧生难民人数目前为止有730多人。</p>\n<p>\n<b>比雷埃乌斯临时难民营遭遇清除</b></p>\n<p>\n周一当天，在希腊与马其顿交界的港口城市比雷埃乌斯(Piräus)临时难民营里，难民之间发生冲突。希腊电视台Skai介绍，难民们因为争夺一部手机而引发冲突，一名由此头部受伤的男子已被送往医院。</p>\n<p>\n数月以来，超过4000名难民生活在比雷埃乌斯的非正式难民营。那里的气氛紧张，难民之间已多次发生冲突。迄今为止，那里的难民却不愿搬去希腊官方正式难民营。他们对那里的情况提出批评，并表示担心自己会被遗忘在正式难民营里。</p>\n<p>\n然而，希腊国防部副部长维特萨斯（Dimitris Vitsas）周末宣布，本周之内，也就是旅游旺季到来之前，比雷埃乌斯港口的难民营将被逐步清除。</p>\n<p>\n据希腊电视台Skai周一报道，清理工作已经开始，比雷埃乌斯有多辆汽车将500名难民送往附近的正式难民营。目前尚没有有关难民们反应的报道。</p>\n<p>\n<b>伊多梅尼卧轨抗议者被疏散</b></p>\n<p>\n在同样位于希腊与马其顿交界的伊多梅尼（Idomeni），一伙在火车铁轨上抗议的人群周一上午被疏散。但是，仍有不少人继续滞留在铁道上。电视画面显示，希腊警方一如既往地没有使用暴力。</p>\n<p>\n这条对希腊经济十分重要的北上铁路31天以来首次再次通行货运火车。难民们将这条边界铁轨封锁了31天，希望借此向当局施压，要求开放通往马其顿的边界，让他们得以继续前往中欧。</p>\n<p>\n<b>欧土协议执行缓慢</b></p>\n<p>\n时隔两周后，从希腊的莱斯沃斯岛（Lesbos）又有难民被送往土耳其。希腊电台Athina 984报道称，周一上午，载有45名巴基斯坦难民的土耳其船只离驶莱斯沃斯岛的首府米蒂利尼（Mytilini），他们将被送往土耳其西部的迪克利（Dikili）。</p>\n<p>\n按照计划，周一一共将有150名难民被送回土耳其。为抗议这种遣返行动，活动人士跳入船坞，试图阻止船只离驶。</p>\n<p>\n3月20日，欧盟与土耳其达成的难民协议正式生效。根据协议，此后从土耳其非法前往希腊岛屿的所有移民，只要未获得难民身份，均将被遣返。但是，由于缺乏人力，难民身份的审核过程漫长。4月4日协议被执行以来，一共仅有300人被送回土耳其。</p>\n<p>\n<em>使用我们的App</em><em>，阅读文章更方便！给yingyong@dingyue.info</em><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 128,
      "title": "DW 叙利亚和谈陷困境",
      "date_published": 1461057480,
      "body": "\n<p>\n（德国之声中文网）代表了多个反对派组织的叙利亚高级谈判委员会（HNC）协调员希贾卜（Riad Hidschab）在解释为何考虑退出日内瓦谈判时表示，阿萨德政权军队继续轰炸、围困平民，在这个时候，继续进行和谈，这\"不能让人接受\"。</p>\n<p>\n斡旋并主持日内瓦会谈的联合国叙利亚问题特使德米斯图拉（Staffan de Mistura）在与反对派方面磋商结束后通报说，叙高级谈判委员会中止\"正式\"参与和谈，但和谈仍可在技术层面继续进行。他表示，\"我们将同所有各方继续讨论\"，\"媾和对话是非常灵活的\"。</p>\n<p>\n由联合国斡旋举行的日内瓦和谈旨在结束持续了5年的叙利亚内战，为建立过渡政府、制定新宪法及自由选举铺平道路。</p>\n<p>\n德米斯图拉同时强调指出，叙利亚国内目前的战火\"令人忧虑\"、人道救援工作进展缓慢。尤其在叙北部地区，新近以来，暴力大幅增加。政府军在当地发动攻势，以在阿勒颇地区切断反对派与外界的联系。</p>\n<p>\n<b>美、俄促停火</b></p>\n<p>\n大多属于伊斯兰阵营的10个反对派武装组织宣布发动针对阿萨德军队的反攻，理由是，政府军不再遵守今年2月达成的停火协议。</p>\n<p>据国际人道组织\"无疆界医生\"提供的数字，为躲避战火，目前，已有超过10万人滞留在与土耳其交界地区。该组织称，至少还有3.5万人逃离了毗邻战区、或被\"伊斯兰国\"占领的难民营，从而被困在\"伊斯兰国\"、库尔德人控制区以及土耳其边界之间的地区。一年来，土耳其只在紧急情况下才允许难民入境。</p>\n<p>\n美国总统奥巴马和俄罗斯总统普京就叙利亚局势举行了电话磋商。据克里姆林宫通报，两位总统在电话交谈中双双强调，将继续坚决致力于促成遵守2月27日起生效的停火协议、保障人道救援通道畅通。白宫透露，围绕停火状态脆弱问题，奥巴马总统再度敦促普京对阿萨德施加影响，要求他遵守停火协议。俄罗斯是阿萨德政权盟友，并在军事上提供支持。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 127,
      "title": "DW \"Whatsapp\"也加入个人数据保护行列",
      "date_published": 1460976600,
      "body": "\n<p>\n（德国之声中文网）\"Whatsapp\"实施\"端到端加密服务\"的消息刚刚宣布，马上成为舆论的焦点。然而对通讯平台来说，是不是提供数据保护从来都不是争议的内容，有争议的是供应商在什么时候，什么情况下提供保护。</p>\n<p>\n对于\"Whatsapp\"用户来说，实施全面加密服务毕竟是个好消息。这则消息是在苹果公司最近与美国联邦调查局（FBI）就解锁iPhone引发争议后传出的。苹果公司拒绝协助美国联邦调查局解锁加州南部圣贝纳迪诺恐怖袭击案枪手之一赛义德·法鲁克所持的手机。除互联网巨头谷歌、Twitter外，拥有\"Whatsapp\"的社交媒体Facebook也加入了支持这一决定的行列中。最终，美国联邦调查局借助第三方的帮助获取到手机中的数据。</p>\n<p>\n欧洲范围内，人们一直对英国出台的\"调查权力法案（Investigatory Powers Bill）\"和计划实施的\"欧盟-美国隐私权保护盾(EU-US Privacy Shield)\"协议有争议。后者旨在取代美国和欧盟达成20年之久的\"安全港协议\"。</p>\n<p>\n现在已有越来越多的供应商将端到端加密视为一种应该具备的标准：</p>\n<p>\nWickr</p>\n<p>\nWickr成立于2011年，是一家主打\"军事级防泄密\"的社交工具和移动APP。用户通过该平台可发送能\"自行销毁\"的信息。</p>\n<p>\nWickr将隐私权视为一项普遍人权。因此该平台使用端到端数据加密标准AES256，对信息进行多层加密加密。</p>\n<p>\n<b>Telegram</b></p>\n<p>\n据称，11月13日巴黎恐袭案的幕后指使是通过\"Telegram\"进行的\"操控\"。</p>\n<p>\n该软件支持两层加密：用户的个人隐私通过\"Telegram\"的客户端和服务器之间的终端加密获得保障。</p>\n<p>\n<b>Messages </b><b>和</b><b> FaceTime</b></p>\n<p>\n苹果公司捍卫其加密技术的声誉由来已久。2013年美国缉毒局 (DEA)一份\"内部报告\"透露的消息称，\"完全无法破解苹果设备之间发送的iMessage信息\"。2011年，苹果公司的实时通讯软件iMessage实施端到端加密技术。此外，通过\"Facetime\"传送的信息也受到端到端加密的加密保护。</p>\n<p>\n<b>Signal</b></p>\n<p>\n\"Signal\"是非赢利团队\"Open Whisper Systems\"公司开发的一个聊天软件。用户在iOS和Android手机上发布的信息和通话内容被加密。2015年以来\"Whatsapp\"与\"Open Whisper Systems\"合作，将加密协议\"Signal-Protokoll\"用于\"Whatsapp\"软件中。</p>\n<p>\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</p>"
    },
    {
      "post_id": 126,
      "title": "DW 就业指南",
      "date_published": 1430833860,
      "body": "\n<p>\n工作签证</p>\n<p>\n原则上，外国人在德国完成学业后可以不受限制地进入就业市场。为此目的，你首先要持毕业证书到当地移民局申请“找工作居留许可”，这种居留许可的最长时限是18个月，其法律基础是居留法第16条第四款的相关规定。</p>\n<p>\n“找工作居留许可”的十八个月时限，是从你接到通过毕业考试书面通知的那一天算起，同注销学籍或获得毕业证书的日期无关。 申请或延长“找工作居留许可”时，你必须要向移民官证明你有能力自行解决生活基本开支，换言之，如果你在银行里没有足够的存款，那么，在寻找工作期间，你也可以不受限制的打工赚钱。要注意的是，只有找到“同专业水准相应的固定工作”，你的居留才能根据德国居留法第18条\n<a href=\"http://www.gesetze-im-internet.de/aufenthg_2004/__18.html\" rel=\"nofollow\" target=\"external\" class=\"icon external\">（§18 AufenthG）</a>的规定转成工作居留，而其他与你所学专业无关的工作，比如酒店服务员或出租司机则很难帮你获得工作签证。</p>\n<p>\n独立开业</p>\n<p>\n留学生同样也可以选择开办公司，独立创业。前提条件是，你要经营的公司业务同你所学的专业有关，同时，你还要证明你的基本生活费用是有保障的。满足上述两点后，你就可以前往所在地移民局根据外国人居留法第21条（\n<a href=\"http://www.gesetze-im-internet.de/aufenthg_2004/__21.html\" rel=\"nofollow\" target=\"external\" class=\"icon external\">§ 21 Abs. 2a AufenthG</a>）的规定申请独立开业居留了。</p>\n<p>\n找工作也是一门艺术</p>\n<p>\n对大部分毕业生来说，找工作都是一件劳心费神的事情。要想在十八个月签证有效期内尽量少碰壁，并找到称心如意的工作，最好的办法就是未雨稠莫尽早动手。比如，学习期间和潜在的雇主建立联系，多做实习，建立必要的人脉，这些都将为日后有的放矢地找工作奠定良好基础。</p>\n<p>\n职业生涯是一个人实现自我价值的重要途径，而正确的自我评判则是开始职业生涯的重要基础。知己知彼，百战不殆，充分了解了自己的兴趣和优势，找工作才能变得得心应手。无论是就业媒介网站，猎头公司，还是各大报章，每天都有大量的招聘启事。阅读了几份招聘启事后你会发现，大多数雇主并不会唯文凭是论，他们更看重应聘者的专业技能。所以，有针对性的应聘适合自己发挥强项的工作就显得非常重要了。</p>\n<p>\n除了关注招聘启事之外，近年来专门针对中国毕业生的企业招聘会也越来越多，这种招聘会有利于双方面对面的交流，无疑是提高就业成功率的好去处。</p>\n<p>\n知道了自己的优势和兴趣所在，就可以有针对性的投递求职信了。 “没有金刚钻，勿揽瓷器活” 的古训，同样适用于今天的职场，不同的是在竞争激烈的因特网时代，仅凭“金刚钻”，未必就能马上揽到瓷器活。在求职过程中，如何包装自己，兜售个人优势，也是一个不容忽视的环节。许多猎头网站上，对于如何写求职信，如何面试等等都有很好的建议，值得借鉴。</p>\n<p>\n德国就业市场前景看好</p>\n<p>\n在德国，涉及外籍专业人才的就业法规越来越宽松，所以，大多数希望在德国就业的外国毕业生都能如愿所偿。 而有些行业甚至存在人才供不应求的情况，比如信息技术和医疗保健领域，高精尖人才的缺口就非常大。</p>\n<p>\n联邦德国经济部和劳动部联合推出了一个专门针对外籍求职者的网站：\n<a href=\"http://www.make-it-in-germany.com/\" rel=\"nofollow\" target=\"external\" class=\"icon external\">make it in germany</a>。在这里您既可以获得最新的就业信息，也可以更多地了解德国，认识德国，以便顺利地融入社会。</p>"
    },
    {
      "post_id": 125,
      "title": "DW Pegida领导人涉嫌煽动仇恨案开审",
      "date_published": 1461055560,
      "body": "\n<p>\n（德国之声中文网）\"Pegida\"运动发起人之一巴赫曼（Lutz Bachmann）涉嫌煽动暴力仇恨（Volksverhetzung）一案4月19日在德累斯顿地方法院开始审理。43岁的巴赫曼被指在脸书上发帖辱骂战争难民和申请避难者为\"废物\"、\"畜牲\"、\"混蛋\"。</p>\n<p>\n检方指责巴赫曼的侮辱性言论侵犯了难民的人权，并煽动了对他们的仇恨情绪，由此扰乱了社会的和平。2014年9月，巴赫曼在脸书上发表了这番评论。根据德国刑法，一旦煽动民众罪名成立，被告可能会面临最高5年的监禁。巴赫曼表示，这是一次政治性的审判，目的是诬蔑他本人以及Pegida运动。</p>\n<p>\n\"Pegida\"是\"爱国欧洲人反对西方伊斯兰化\"运动的简称。2014年10月，该运动首次在德累斯顿举行大规模游行示威，其主要批评目标之一是德国政府的移民和难民政策。2015年年初集会的参与者一度超过2万人。同时\"Pegida\"运动也蔓延到了德国的其他城市。但今年以来仅在德累斯顿还有定期的集会活动，参加人数也减少到几千人。</p>\n<p>\n周二在庭审开始前，巴赫曼的一些支持者来到法院门前，打出\"无罪释放巴赫曼\"的条幅。同时也有反对者呼喊\"巴赫曼进监狱！\"。福音教通讯社援引检察长哈泽（Lorenz Haase）称，对巴赫曼的量刑应该不会超过两年。</p>\n<p>\n巴赫曼本人已有数罪前科，其中包括2010年因买卖可卡因被判刑两年，因此巴赫曼目前仍在假释期内。检方表示，一般来说有前科的被告在下一次审判中可能获刑较重，就巴赫曼来说，可能被处以罚金或监禁。</p>\n<p>\n自上世纪90年代以来，巴赫曼多次触犯刑律，罪名包括故意伤害、入室行窃、偷盗和毒品买卖。据当地媒体报道，他曾受雇于德累斯顿的色情业从事有针对性的盗窃；1998年巴赫曼因盗窃罪被判两年零八个月徒刑后，逃往南非以躲避牢狱之灾。后来他在南非被移民局发现持无效签证，被迫返回德国。在德累斯顿服刑一段时间后，巴赫曼被提前假释，但后来又因其他罪行被判刑。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 124,
      "title": "DW 北极熊要搬往南极了？",
      "date_published": 1459671180,
      "body": "\n<p>\n<strong>北极熊出现在前院里</strong></p>\n<p>\n威廉·班尼斯特（William Bannister）是加拿大小城丘吉尔市的市长。他的家乡，被冠以“世界北极熊之都”，位于加拿大北部曼尼托巴省，哈得逊湾南岸。</p>\n<p>\n班尼斯特对观测到的气候发展、以及因此对北极熊产生的相关后果忧心仲仲。“以前北极熊生活在这里以北数百英里，在哈德逊湾的冰面上”，他说，“现在，冰已经承受不住北极熊的重量，北极熊南下前往陆地了。”</p>\n<p>\n但在这里，它们没有办法捕捉到海豹，只能在别的地方寻找食物。可是这些食肉动物常常离班尼斯特和丘吉尔市的其他居民太近，超过了安全距离。“我宁愿像几年前一样，那时必须组织游客活动，才能见到北极熊，而不是像现在，在自家的前院或者垃圾箱旁遭遇它们。”</p>\n<p>\n丘吉尔市遇到的情况并不罕见，因此它也像许多加拿大北部城镇一样，支持一个名为“加拿大北极熊保护协会”（Canadian Polar Bear Conservation Society）的组织。该组织成立于八年前。“我们为北极熊的生存而努力，也尝试为它们开辟新的生存空间”，博加德（Wolfric Bogarde）说。这位67岁的大胡子加拿大人从前是飞行员，他是“加拿大北极熊保护协会”的创始人之一。该组织已经多次成功地帮助北极熊迁徙——最近一次是从哈德逊湾转移到格陵兰岛一个僻静处——但是到目前为止，这样的迁徙仅限于北极范围内。</p>\n<p>\n<strong>大自然里的危险侵犯</strong></p>\n<p>\n现在情况将有所不同，因为博加德和他的同事有一个最新计划：将首批25只北极熊迁往南极的冰雪大地。4月1日，是南极大陆冬季的开始，第一批北极熊将搬去南极，成为南极洲的一员。加拿大政府负责管理此事，并进行安置。他们支持这一项目。</p>\n<p>\n德国海洋生物学家、动物权利组织“Poisson d'avril”的成员阿恩·佩德森（Arne Pedersen）不认为让北极熊搬家是个好主意。“在整个南极大陆，没有室外活动的北极熊，而且也没有过，”他说。但他同时承认，“当然，南极大陆的冰盖对北极熊来说是非常棒的生存空间。它们可以在那里找到一切它们需要的——能够承载它们体重的冰层，以及它们主要的食物源海豹，而且数量充足。”</p>\n<p>\n然而，这位43岁的汉堡科学家对北极熊这种如此大型的食肉动物的安置仍心存疑虑，如果遭遇自然界不可预知的危险侵犯，后果将可能无法挽回。</p>\n<p>\n<strong>企鹅肉</strong><strong>，</strong><strong>不好吃</strong></p>\n<p>\n佩德森，以及许多生物学家和动物保护者最大的顾虑之一，就是企鹅的福祉。他们尤其担心大型的企鹅，如国王企鹅和皇帝企鹅，它们在广袤的南极大陆冰盖上繁衍，而且到目前为止——至少是在陆地上——没有敌人。只有年幼的企鹅会成为一些猛禽或北极狐的腹中餐。</p>\n<p>\n在水中，逆戟鲸和海豹也会攻击企鹅。“如果现在把北极熊迁往南极”，动物权利组织“Poisson d'avril”的成员阿恩·佩德森担心，“短时间内企鹅的繁殖地就会出现一场真正的大屠杀。”</p>\n<p>\n“加拿大北极熊保护协会”则认为，这种担心毫无根据：“我们在加拿大引进了一些企鹅，在哈德逊湾我们的一个自然保护区成立了一个科学实验点”，博加德说。在方圆几百公里的围栏区域，对北极熊和皇帝企鹅观察持续了数月之久。</p>\n<p>\n博加德承认，“虽然开始时北极熊攻击过企鹅，但是企鹅并没有成为北极熊的潜在食物源。北极熊很快就放弃了捕获的企鹅，转而回到它们的冰孔那里继续捕捉海豹。我猜测，它们并不喜欢吃企鹅。”</p>\n<p>\n如果在将被迁往南极的第一批25只企鹅那里，也观察到同样的情况，博加德说，将会有更多的北极熊被送往地球的另一边，寻找新的家园。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，</em><em>阅读文章更方便</em><em>！</em><em>给</em><em>yingyong@dingyue.info</em><em>发送一封空白电子邮件就能得到软件和相关信息</em><em>！</em></p>"
    },
    {
      "post_id": 123,
      "title": "DW 《十年》预视香港未来黑暗面 导演望港人觉醒",
      "date_published": 1459697880,
      "body": "\n<p>\n（德国之声中文网）在《十年》的世界里，未来的香港似乎更悲切。有人认为，《十年》的出现是因为经历占中。不过，《十年》策划人兼导演伍嘉良接受德国之声访问时表示，电影构思早于2013年底已酝酿，是为了表达对香港前路的无力感，籍此令香港人反思。</p>\n<p>\n伍嘉良在香港土生土长，跟不少香港人一样也爱这片土地，但近几年连番社会争议，反高铁丶国民教育丶政制改革丶免费电视发牌等风波，社会处于困局，前路走到瓶颈。他说，曾与不少街坊倾谈，对于香港现状，大家都无法释怀。\"但很有趣，当大家谈到将来又会变得释放，其实要想得远些，探讨将来是否可以铺路。《十年》就是要拍给现在的香港人看，无论过去现在将来，很多历史都在重演，以写实手法接连历史，让人推敲。\"</p>\n<p>\n<b>题材涉港独恐袭</b> <b>港核心价值受冲击</b></p>\n<p>\n伍嘉良与另外四名年轻导演，在没有创作限制下，构想出五个短篇故事，探讨香港核心价值之馀，剧情也来得坦荡荡。《浮瓜》讲述中国政府为求在香港推行《国家安全法》，联同建制阵营自编自导一场恐怖袭击；《自焚者》提及港独主义者自焚抗争；《方言》中有对广东话被淘汰的恐惧，《冬蝉》对保育意识作了探讨。由伍嘉良执导的《本地蛋》，则承接另外四个故事的背景，设想十年后民众盲从盲撑，下一代成为文革红卫兵的可能。\"触及政治背景只是其中一个层面，事实上故事中也有很多人性选择问题，我们没有也抽离现实，以写实去反映一个时代。\"</p>\n<p>\n《十年》去年在香港亚洲电影节首映，再到正式公映，虽然只曾在八间戏院上画，但上映六周连场满座，录得超过300多万港元票房，更一度击败同期上映的《星球大战》。\"观众有共鸣，自然有讨论，大家过去几年过度抑压，只是我们愿意将大家想法，坦白地在电影中描述，而原来这种坦白已很久没有出现，其实很可悲。\"</p>\n<p>\n<b>环时：《十年》是宣扬绝望</b> <b>如思想病毒</b> </p>\n<p>\n电影赢得掌声与肯定，就连香港立法会的建制派议员也要入场\"观摩\"，亦引起中国内地关注。中国官媒《环球时报》1月22日的社评，以\"《十年》吓唬香港社会，内地管不了\"为题，直斥电影完全荒诞，所描绘的场景十年后不可能在香港出现。而导演们是宣扬绝望，是他们的任性，这个时候冒出来，带给香港社会的害处很可能大过好处。更谓\"希望300多万票房表明它影响的只是香港小众，而且那些港人尚存应有的分辨力和对'思想病毒'的抵抗力\"。</p>\n<p>\n对于批评，伍嘉良一笑置之，反而引用内文反讽批评，\"希望香港人真的对这些思想病毒有抵抗力，凭良知作出判断。\"他慨叹，在梁振英上任特首後，过去几年一直采取排他对抗，冲击港人核心价值，标签反对声音，\"如果一个社会连坦白有勇气都受胁逼，标签也就是另类挑衅。\"</p>\n<p>\n香港大学校委会风波，以至铜锣湾书局失踪事件，更令港人忧虑会失去免于恐惧的自由。伍嘉良认为，香港权贵旨在靠拢中国，未有了解香港核心价值，更以不合逻辑处理问题。如此下去，十年后的香港，各方面均只会逐步收窄。他坦言，创作《十年》就是不愿见到电影中所描绘的情节，终有一日发生，用来提醒香港人抱有希望，\"时势愈恶，愈要觉醒。\"他表示，会继续把握尚存的创作自由，跟随信念行事，不会噤声。</p>\n<p>\n<em style=\"color: rgb(62, 62, 62); font-family: 'MS Song', 'MS Hei'; font-size: 17px; font-variant: normal; font-weight: normal; letter-spacing: normal; line-height: 25px; orphans: auto; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: 1; word-spacing: 0px; -webkit-text-stroke-width: 0px; background-color: rgb(255, 255, 255);\">使用我们的App，阅读文章更方便！给<a href=\"mailto:yingyong@dingyue.info\" style=\"color: rgb(0, 135, 235); text-decoration: none;\">yingyong@dingyue.info</a>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 122,
      "title": "DW 俄中否决安理会叙利亚决议",
      "date_published": 1328377980,
      "body": "\n<p>\n纽约</p>\n<p>\n在联合国安理会对叙利亚决议的表决中，俄罗斯和中国投了否决票，使得这一由阿拉伯国家提交的要求总统阿萨德辞职的草案再度宣告流产。其他的13个安理会成员国，包括美、英、法三个常任理事国，都一致支持这一草案。叙利亚反对派对这一表决结果表示失望。在周六，该国局势继续升级，据人权人士称，在霍姆斯至少有200人在政府军镇压中丧生，但大马士革政府否认这一消息。美国国务卿克林顿对俄中两国反对叙利亚决议的行为进行了强烈批评。她在参加慕尼黑安全会议期间指出，谁阻挠这一决议，就要为叙利亚继续发生暴力流血冲突乃至爆发内战承担连带责任。</p>"
    },
    {
      "post_id": 121,
      "title": "DW 饮茶大国举行咖啡大赛",
      "date_published": 1460277600,
      "body": "\n<p>\n（德国之声中文网）一场国际级的咖啡赛事在上海拉开帷幕。每一名参赛选手出场时，观众席就传呼欢呼声，气氛像奥运会一样热烈。</p>\n<p>\n27岁的格尔拉赫（Daniel Gerlach）来自德国维尔茨堡。他对自己的表现有些懊恼：\"我觉得有点生气，因为作为拿铁艺术家我的表现不太好。我的手在抖，如果我拿杯子的时候手在抖，那就危险了。\"<br>\n</p>\n<p>\n拿铁艺术是一种非常特殊的咖啡艺术形式。参赛选手用牛奶打出的泡沫在咖啡上描画出各种各样的花案图样。</p>\n<p>\n格尔拉赫说，他在杯子上画了两只天鹅，另外一次是画了一只蜻蜓。\"制作的过程中我慢慢地转动杯子，轻轻地晃动，提高画画的难度。\"</p>\n<p>\n这样一场国际级的咖啡赛事在饮茶大国中国举行。大约15年前，即便是在上海这样的大都市，很多人喝的都还只是速溶咖啡。但现如今在上海的大街小巷都可以找到各式各样的咖啡馆。</p>\n<p>\n为意大利一家咖啡机厂商做中国代理的石春燕（音译）说：\"很多中国人现在都有在海外生活过的经历了，他们知道现磨现冲的咖啡喝起来口感要更好。从销售业绩上我们就可以感觉得到。\"<br>\n</p>\n<p>\n来自杜塞尔多夫的咖啡专家彼德林思齐（Mateusz Petlinski）说：\"中国肯定会变成一个极具竞争力的咖啡王国。\"他在品尝了用产自中国云南的咖啡豆研磨泡制的咖啡后评价说：\"这些咖啡还不够完整。还无法达到制作一些特殊咖啡的标准。另外中国的咖啡豆烘烤机仍然处于试验阶段，所以现在也只能看看利用现有的材料能做出什么样的咖啡。\"</p>\n<p>\n格尔拉赫在拿铁咖啡的比赛中取得第19名的成绩。来自澳大利亚、日本、韩国和新西兰的对手实力都很强。有一点让人多少感到意外的是来自东道主中国的参赛选手数量有限。30岁的沈英军（音译）说自己是个咖啡控。他说自己专门赶来想为中国的选手加油，可是却连一个也没看见。\"我挺失望的，不过这种情况很快就会发生改变。我今天在这里看到不少咖啡师学校设置的推介点。中国人善于学习又很勤奋。\"</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 120,
      "title": "DW 半数德国退休人员今后或“没好日子过”",
      "date_published": 1460553480,
      "body": "\n<p>\n（德国之声中文网）\"年轻时努力工作，退休后享受衣食无忧的晚年生活。\"这样的人生安排在德国越来越向少数人的\"专利\"这一趋势发展。西德意志电台（WDR）委托和参与进行的德国退休人员经济状况调查报告显示，2030年以后退休的德国人中，有近半数人的法定退休金达不到贫困线。</p>\n<p>\n换言之，2030以后 \n<a href=\"/zh/勤劳肯干的德国人何时退休/a-19085483\">退休</a> 的人，尽管可以领取法定退休金，但仍然需要获得额外的社会救济才能过上低保生活，目前德国依照收入和生活资本开支制定的贫困线为月收入840欧元。以月收入2000欧元的全职工作者为例，到2030年，此人可获得的法定退休金为870欧元，相当于目前净收入的43.5%，再除去医保，此人2030年每月的收入为800欧元，也就是在贫困线以下。</p>\n<p>\n相比2000年德国的法定退休金水平，当年月收入2000欧元的人还可以领到1060欧元的退休金，相当于净收入的53%。</p>\n<p>\n西德意志电台的这项退休金情况统计同时显示，为了今后退休金不低于贫困线，要在德国持续工作40年，即持续交纳法定养老保险40年，且每月毛收入不低于2100欧元。</p>\n<p>\n<b>德国退休金水平一年不如一年</b></p>\n<p>\n这一预测性统计是以当前德国的就业情况和经济发展水平为基准。不来梅大学经济学教授鲁道夫·希克尔（Rudolf Hickel）和波恩就业前景研究所的威尔纳·艾希霍尔斯特（Werner Eichhorst)均认为西德意志电台这项退休金调查的结果具有说服力。两位专家指出，目前德国的就业市场发展良好，失业率低，但即使这样的形势继续，未来的退休人员的收入状况也不容乐观。</p>\n<p>\n西德意志电台的报告中也指出，十几年后退休面临贫困生活的人，正是当今的低收入者，现在挣的少、有没有额外购买私人养老保险的经济实力，直接导致以后 \n<a href=\"/zh/德国现行养老金制遇信任危机/a-19131463\">退休金低</a> 、晚年生活贫寒。</p>\n<p>\n德国大联合政府执政党之一社民党（SPD）党员、联邦劳工部长纳勒斯（Andrea Nahles）4月12日宣布，将于今年夏天出台一项关于养老保障的全面规划，不乏一些改良措施，旨在避免、或至少缓解退休金水品持续走低的趋势。2017年德国联邦大选的选战热点话题之一也必将围绕民众关心的养老保障问题。</p>\n<p>\n德国法定退休金水平自1990年至今持续下降。德国养老保险联合会（Deutsche Rentenversicherung Bund）公布的数字显示，1990年工龄满45年的退休人员还可以拿到在职时净收入的55%，2000年这一水平降至52.6%，2010年则为52%，目前是将近48%，2030年预计仅为43%。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 119,
      "title": "DW 陈葵背景受质疑 推特驳斥“染红”指责",
      "date_published": 1461058740,
      "body": "\n<p>\n（德国之声中文网）知名社交网络平台推特（Twitter）任命陈葵为新的大中华区总经理的消息一经宣布，在网络上引起热议。其中争议的焦点就在于陈葵曾经有过在中国人民解放军和国家安全机构任职的经历，而推特至今仍然被北京的审查机构封锁。</p>\n<p>\n尽管在中国大陆无法通过正常渠道登陆使用，但是推特仍然是颇受华人欢迎的一个可以用母语自由表达观点的社交平台--尤其是生活在海外的华人。中国已经推出了本土化的\"翻版\"--微博，在这一网络平台上的言论受到政府的严格控制。</p>\n<p>\n旅居美国的媒体人温云超在他的个人推特上发表推文，称陈葵曾经为解放军二炮一研究所工作七年，后来还在一家与公安部有关系的合资企业担任CEO五年。\"由于这个人事决定，人们不得不质疑推特的方向\"，他写道。</p>\n<p>\n陈葵1966年出生于上海，1987年从北方交通大学计算机专业毕业之后，在解放军研究机构担任技术工程师。在先后供职于数家信息技术公司之后，陈葵接任冠群金辰软件公司总经理，而据《环球时报》称，这家企业是美国国际联合电脑公司同中国公安部联合组建。</p>\n<p>\n新华社在其官方推特帐号上发文，祝贺陈葵获得这一任命。而这位新任推特中华\"一姐\"则回应表达感谢，并表示非常期待未来能够更紧密的合作。她在推特上发文，@cctvnews（央视新闻英文频道的官推帐户）写道：\"让我们通力协作，一起把中国的精彩故事讲给世界听！\"</p>\n<p>\n中国国内外的推特用户中，有不少对陈葵的新职务表示质疑。他们有的质问道：\"你想要通过和共产党的媒体合作来达到什么目的？加强防火长城吗？\"还有的网友直接写道：\"这不是共产党宣传的阵地，你走开。\"</p>\n<p>\n对于网友的质疑和批评，推特日前作出回应解释道，在上世纪八十年代，大学生毕业之后国家给分配工作是非常正常的事情。而当时作为计算机专业的毕业生，她是解放军初级工程师的合适人选。该声明继续写道：\"随着九十年代中国经济改革开放的进一步推进，陈葵选择了追求在技术职业生涯的继续发展，并于1994年转到私营领域工作。\"</p>\n<p>\n推特方面还强调，陈葵在金辰公司所扮演的角色是作为美方合作企业美国国际联合电脑公司的代表，她\"从未为公安部工作过\"。</p>\n<p>\n据悉陈葵的工作地点将设在香港。她的上一份工作是微软公司亚太地区的研发负责人。目前，陈葵尚未对推友的质疑做出正式回应。</p>\n<p>\n不过，《环球时报》倒是在4月19日发表了署名单仁平的评论文章，而且标题相当\"劲爆\"--《\"共军\"执掌推特中国区，这噱头火爆》。文章指出，推特并没有正式进入中国网络传播市场，它的中文用户圈大多是海外华人，\"其中最活跃的是敌视中国政治体制的那个小圈子\"。</p>\n<p>\n作者还解释道，陈葵这个\"总经理\"应属\"销售总经理\"，与推特\"内容审查\"大概不会有什么关系。在被宣布任命后与中国官媒的英文账号有过友好互动，这与她要进一步\"开拓中国广告市场\"，希望给中方留个好印象估计不无关系。</p>\n<p>\n最后这篇官媒评论文章还强调，推特不会变成中国的\"微博\"。\"不过它如果想全面进入中国市场，就需围绕遵守中国法律做出相应调整。相信推特会为了公司的利益最大化而反复斟酌。\"</p>\n<p>\n推特公司亚太区副总裁沙列什·拉奥（Shailesh Rao）曾对《南华早报》表示，推特在中国的发展策略主要是做广告生意，向中国网民提供社交平台使用\"目前还不是一个选项\"。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 118,
      "title": "DW 被污染的学校：不止是环境污染的问题",
      "date_published": 1460972700,
      "body": "\n<p>\n（德国之声中文网）据中国官方媒体新华社周一报道，有关当局已经就\n<a href=\"/zh/常州外国语学校500学生因新址污染患病/a-19194331\">常州外国语学校污染事件</a>展开调查。日前，央视新闻曝光了常州外国语学校自从迁到新校址以来，先后有641名学生被送到医院进行检查，其中493人出现皮炎、湿疹、支气管炎、血液指标异常、白细胞减少等异常症状，个别还被查出了淋巴癌、白血病等恶性疾病。</p>\n<p>\n该丑闻一经曝光，引起中国以及国际舆论的关注。路透社报道中指出，波及广泛的环境污染问题是中国从上世纪70年代以来不惜一切代价发展经济的政策所造成的负面效应。虽然执政的中共近年来投入了更多的资源和精力去改善受到污染的空气、水和土壤质量，但是要见到实效恐怕还需要数十年时间。</p>\n<p>\n<b>\"高度负责\"、\"欢迎监督\"</b></p>\n<p>\n在社交平台新浪微博上，#被污染的学校#成为热门话题，点击量超过4千万。4月18日，常州市人民政府新闻办公室通过其官方新浪微博发布声明，称在央视新闻报道\"不该建的学校\"播出之后，常州市委、市政府紧急召开会议，成立联合调查组，\"本着对师生健康高度负责、对环境污染'零容忍'的态度\"，迅速展开相关工作。声明中还指出，3月下旬专业检测机构对学校校内空气、土壤和水质进行监测的结果是\"符合国家标准\"的。</p>\n<p>\n常州市政府还表示，\"欢迎媒体与社会各界的监督\"，对于报道中提及的相关问题，将按照\"客观公正、依法处理、公众参与、信息公开\"的原则，认真调查核实，依法处置，对存在的问题绝不姑息，调查结果将及时向社会公开。</p>\n<p>\n在这条微博下，有网友质问道：\"所以1月份发生的事，现在才知道连夜成立调查组？\"还有网友讽刺地评论道：\"市政府搬过去就是。\"</p>\n<p>\n在其它微博中参与这一讨论话题的网友最为感到气愤的是常州市政府在处理这一事件上的做法。经媒体和网友曝光，其实在2015年常州外国语学校刚刚搬到新校址之后，很多学生就已经同时出现了皮炎、湿疹和其它身体不适症状，引起了家长们的担忧。而在学校所在地附近，原先曾经有三家大型化工厂，而且当时正在进行土地施工，这都是明显的事实。加上很多家长在去学校接孩子的时候，可以明显地闻到异味，这更加坚定了他们对于环境污染造成学生健康受损的怀疑。</p>\n<p>\n然而地方政府对此采取的回应却是压制、隐瞒。有网友爆料，常州外国语学校教学质量在该市首屈一指，原本是不少社会精英家庭子女入学的首选。然而出现环境污染问题之后，不少身为公务员的学生家长还受到了上级的威胁，如果其子女转学离开，家长的工作就将不保。还有多名网友称，曾有家长就学校环境污染问题去抗议，结果政府出动特警将其驱散。若不是此次央视曝光，可能常州地方政府还在继续强行压制此事。</p>\n<p>\n<b>生存安全没保障 越来越多国人选择移民</b></p>\n<p>\n在央视播出的新闻报道中，一位曾在学校附近的化工厂工作过30多年的匿名人士透露，该工厂加工的多种化工产品都是剧毒，有些还是国家严令禁止生产的。而且对于有剧毒污染的生产废料，工厂根本没有进行正规的处理，而是直接将其排到地下暗河，或者掩埋在地下。一位名为\"Rule-of-law\"的网友在微博上评论道：\"选址前之前应该做一下环境监测，环保局难道不应该做这件事？中国的环保局就是政府企业的奴隶，毫无独立性，退一万步讲，原来这块土地上的化工厂超标排放污染物环保局你到底换管没管过？ \"</p>\n<p>\n还有一位网友\"riffharrise\"感慨道：\"知情者都来爆料了，看完后只有一个疑问：这还算是人间？之前我一直觉得自己该待在国内，等局势变好，可能的话做点贡献。然而现在这种疯狂的势头真让人难以招架，我没法再肯定地说会留下来、想留下来了。\"</p>\n<p>\n近年来，涉及食品安全、环境污染和医药安全的丑闻接连曝光。这次\"被污染的学校\"事件令学校家长绝望，也令民众为无辜的孩子感到悲痛；而不久前的\n<a href=\"/zh/中国问题疫苗事件-数十人被捕/a-19135936\">\"毒疫苗\"事件</a>更是令全体家有幼儿的父母感到不安。再加上多年前的\"毒奶粉\"丑闻以来，广大中国父母始终无法对国产的奶粉以及婴儿食品建立信任。因此稍有一些经济实力的家庭都宁愿花大价钱或者寻找代购，去买进口食品，也不愿意购买价格实惠的国产货。更有不少中产以上阶层的中国人都纷纷选择移民海外，除了政治、经济背景之外，环境和食品安全也是重要原因之一。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 117,
      "title": "DW 造访切尔诺贝利近旁\"鬼城\"",
      "date_published": 1458730500,
      "body": "\n<p>\n（德国之声中文网）距乌克兰切尔诺贝利核电站3公里的小城普里皮亚季（Pripyat）其实已不存在。然而，仍不断有人来到这里，新近甚至还有游客，或者像德国环境部长亨德里克斯（Barbara Hendricks）这样的政界人士。他们想看看，或者更确切地说，能感受一下一座\"鬼城\"的生活。普里皮亚季之所以变成一座鬼城，是因为核辐射使人们无法在此生活。</p>\n<p>\n当年的普里皮亚季有居民5万，是一座年轻的城市，住民平均年龄不到30岁。该市1970年方建立，数以千计的人在切尔诺贝利核电站内、外找到了工作，-工程师、医生、技术人员，需要在此定居。1986年4月26日，四号核反应堆发生爆炸，普里皮亚季紧急疏散。当时说，人们只要暂避几天，结果却是永久迁徙。</p>\n<p>\n<b>\"一切都在掌控之中\"</b></p>\n<p>\n亨德里克斯部长感触良深。在切尔诺贝利的这一天日程满满。部长仔细聆听了该电站的负责人讲述拆除进展情况。负责人们称，现在\"一切都在掌控之中\"。实际上，4号核反应堆废墟仍继续有核辐射。</p>\n<p>普里皮亚季是亨德里克斯部长访问的最后一站，正赶上天气奇冷。按当时的一项计划，普里皮亚季新建的游乐园定于1986年5月1日-核事故发生后数天，对外开放。在接受德国之声采访时，这位社民党籍政治家表示，见一见这个一天都未开放过的游乐园，也算是一种吸引游客的项目，但凸现了整个事情的荒诞，不禁让人唏嘘再三。</p>\n<p>\n30年前，切尔诺贝利核电站周围30公里的共76个村庄都作了疏散，迁徙人口达40万。除乌克兰境内居民外，还包括了同样受到大量核辐射的白俄罗斯境内的居民。德国代表团访问了其中的一个村庄。</p>\n<p>\n<b>归来者非老即穷</b></p>\n<p>\n直到今天，切尔诺贝利核电站周围30公里区内应该说还是无法生活。但仍有一些老人回来了。此外，还有一些来自摩尔多瓦等地的赤贫者来到这里。他们就在这个荒无人烟的地方以林木果实充饥，依然受到高核辐射。对这些老人和穷人，当地政府采取了睁一只眼闭一只眼的做法。</p>\n<p>\n很奇怪，核电站本身让来访者毫不动情。这个由混凝土和钢构成的庞然大物现在要围上一个耗资数十亿欧元的护层，以尽可能保护周围环境。</p>\n<p>\n普里皮亚季这样的地方正以一种让人更触目惊心的方式告诉着人们，核事故给人类带来的是怎样的灾难。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 116,
      "title": "DW 耶路撒冷公交车爆炸 至少21人受伤",
      "date_published": 1461007680,
      "body": "\n<p>\n(德国之声中文网)此次爆炸发生在下班高峰时间。在一辆烧毁的公交车上，调查人员已经发现了炸药残留物。根据急救人员掌握的数据，这起爆炸至少造成了21人受伤，其中两人伤势严重。爆炸还波及了附近的另一辆公交车。现场警方透露，发生爆炸的公交车事发时并没有载客，伤者则主要是被波及的另一辆公交车上的乘客。</p>\n<p>\n耶路撒冷警方认定，这起爆炸是一起由极端分子发动的恐怖袭击。不过，警方并没有披露此案的更多细节。</p>\n<p>\n以色列媒体则报道称，爆炸可能是由乘客中的一名巴勒斯坦自杀式袭击者发动的。总理内塔尼亚胡(Benjamin Netanyahu)则表示，要找到凶手并对其“进行清算”。</p>\n<p>\n近十年来，以色列已经发生了多起公交车爆炸事件，其中大多数为恐怖袭击。而自去年9月以来，新一轮的巴以冲突已经造成了200多人丧生。在本周末，以色列还将迎来犹太教的逾越节；不少人担心，巴以冲突可能会进一步升级。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 115,
      "title": "DW 德国大学实录：生多师少 辍学率高",
      "date_published": 1419066960,
      "body": "\n<p>\n(德国之声中文网)根据《明镜在线》援引位于柏林的\"教育与社会经济学研究所\"(FiBS)新近发布的报告，德国的大专院校中，现在一位教职人员平均要辅导15.9个学生。这个数字在2003年还是15.2个。值得注意的是，各个学科的情况大有不同。个别科目辅导老师数量奇缺。例如工程学科：2003年，平均来看，一位教授或者是讲师负责辅导15.6个学生，在2012年数字生长了近50%，需要辅导的学生数量平均有22.4个。\"教育与社会经济学研究所\"的迪特·多门（Dieter Dohmen）表示，情况尤其严重的是大学：\"一个老师原来平均辅导的学生数量为11人，现在的数量约为19.4个。</p>\n<p>\n近几年，德国高专院校\n<a href=\"/zh/德国教育-喜忧参半/a-17911186\">就读生人数不断上升</a>，许多教室挤爆棚。主要原因之一是取消了义务兵役和民役的政策。根据本台之前的报道，从2011年3月起，德国招募新兵将以自愿为原则，很多本来应该服兵役或者民役的年轻男性都选择到大学深造。另外，2011年德国的高中有两批学生同时毕业。一批是正常读了13年的高中毕业生，另一批是因为学制改革，12年就高中毕业的学生。据在居特斯洛(Guetersloh)的高校中心统计，2011-2012 冬季学期一共有50万学生开始读大学第一学期，比以往任何时候都多。师生比例不平衡的问题也渐渐浮上水面。</p>\n<p>\"教育与社会经济学研究所\"的调查显示，德国各个州高校情况相差很大，教师力量奇缺的是北威州和萨克森 - 安哈尔特州，另外，不来梅、萨克森、萨克森 - 安哈尔特州和图林根州的应用科技大学学也缺少师资力量。理工科辍学率高</p>\n<p>\n从学科上来看，德国大学里缺少数学和自然学科的老师。迪特·多门介绍，除了缺少老师，学生念到一半中途而废的现象也比原来严重。他估计，理科缺少辅导教员也是造成学生辍学率高的原因之一。</p>\n<p>\n根据德国大学院校及科学研究中心（DZHW）发布的数据，德国大学中本科生的辍学率达到28%。尤其是数学和自然科学的情况尤为严重，在综合大学学习这两个专业的学生，10名学生中有4名不能完成学业。而数学系学生的辍学率高达47%。许多学生都放弃原有的学系转攻其他的专业。</p>\n<p>\n迪特认为德国政坛应该关注并出台应对措施解决师资力量缺乏的问题。这位教育与社会经济学研究所所长接受《明镜在线》采访时表示，联邦政府和各地区的州政府曾经达成一项协议，每学期开学就给大学拨款2.6万欧元，他说：\"这笔资金够大学聘请足够的人文和社会科学教员。但是还不够聘请理科老师。\"他认为，政府要按照学系的情况给予相应的拨款：\"毕竟，良好的师生比例是降低辍学率的一个重要因素。\"</p>"
    },
    {
      "post_id": 114,
      "title": "DW 欧佩克行将就木？",
      "date_published": 1461052500,
      "body": "\n<p>\n（德国之声中文网）结束恶性循环原本是多哈会议的目标。低油价导致产油国收入减少，收入减少又导致其扩大原油销售，增加原油销售又导致油价进一步下跌。从2014年中期以来，油价已从每桶115美元跌至现在约30美元。</p>\n<p>\n为了结束这样的恶性循环，石油输出国组织欧佩克（OPEC)15个成员国和俄罗斯等非成员国一起在多哈举行会议，力争将产油量冻结在今年一月的水平。早在二月份，沙特、俄罗斯和委内瑞拉就已对此达成一致。然而，在周日（4月17日）6小时的磋商之后，卡塔尔能源部长穆罕默德·萨达(Mohammed Ben Saleh al-Sada)却宣布，与会国为此还需要更多时间。</p>\n<p>\n以前，欧佩克如果开会调整开采量，全球经济都会忐忑不安。而现在呢？曾经如此强大的欧佩克难道成了纸老虎？德国经济研究所能源问题专家克劳迪娅·科姆菲尔特（Claudia Kemfert）在接受一家电视台采访时评论这是\"欧佩克终结的开始\"。她说，会议不能达成一致很令人吃惊，欧佩克本来就没有什么大权，现在还让全世界都看到其成员国是多么四分五裂。她说，伊朗当然想扩大石油生产，但其它国家表现得如此无助实在令人惊讶。</p>\n<p>\n<b>伊朗拒绝限制开采</b></p>\n<p>\n德国商业银行原油分析师卡斯滕·弗里奇(Carsten Fritsch)在接受德国之声采访时表示，本轮欧佩克会议的核心首先是要求沙特不提高石油开采，因为其它国家都已接近开采极限，本来就无法再显著提高产量。但欧佩克中的这位老大哥却站在了其它国家的对立面。弗里奇说，其它国家担心自己的财政，而沙特目前却有其它目的。沙特的宿敌伊朗此次没有与会，伊朗石油部通讯社（Shana）援引该国石油部长桑贾尼（Bidschan Namdar Sanganeh）说，德黑兰不想签署冻结计划，所以没有必要与会。自从\n<a href=\"/zh/欧美解除对伊朗的经济制裁/a-18985097\">欧美取消制裁</a>后，伊朗从未考虑限制开采，而是计划将开采量提高至制裁前的水平，即日产400万桶。但是，只要伊朗不冻结开采量，沙特也就不愿限制开采，因为它担心这样会将自己的市场份额拱手送给仇敌。</p>\n<p>\n弗里奇说，现在必须静观其变，看看一旦伊朗将日产量提高至400万桶后原油市场会如何反应。汉堡世界经济学院（HWWI）能源专家勒舒斯（Leon Leschus）认为，到那时，沙特和伊朗可能又会一起寻找解决方案。他不认为欧佩克已经走到了尽头。\"原因很简单，欧佩克国家还有大量石油蕴藏。\"欧佩克国家的开采量占全球总产量的三分之一，蕴藏量占全球已探明储量的四分之三。此外，勒舒斯说，伊朗已经发出今后愿意合作的信号。</p>\n<p>\n<b>仍有合作的可能</b></p>\n<p>\n本周一，伊朗呼吁所有相关国家继续谈判。伊朗驻欧佩克代表阿德比里（Hussein Kasempur)向伊朗石油部通讯社表示，伊朗支持欧佩克以及非欧佩克国家稳定油价的努力，希望各方不要气馁，继续谈判。俄罗斯也表示，达成一致的大门仍是敞开的。据来自圈内人士的消息，欧佩克将于六月重启磋商。</p>\n<p>\n<b>第二个劲敌</b></p>\n<p>\n阻止伊朗丰满羽翼只是沙特的一个目标。作为全球最大的产油国，沙特还希望通过低油价将来自美国的竞争者挤出市场。多年来，欧佩克一直通过调整开采量来掌控价格。但是，在美国大规模开采页岩油气之后，这样的时代一去不复返了。来自美国的石油涌入市场，引发原油价格猛跌。</p>\n<p>\n<i>使用我们的</i><i>App</i><i>，阅读文章更方便！给</i><i>yingyong@dingyue.info</i><i>发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 113,
      "title": "DW 德国留学实用信息链接",
      "date_published": 1430833740,
      "body": "\n<p>\n.</p>"
    },
    {
      "post_id": 112,
      "title": "DW 留学生活A-Z",
      "date_published": 1430833860,
      "body": "\n<p>\n<strong> 校园生活</strong></p>\n<p>\n<strong>大学生委员会（</strong><strong>AStA）</strong></p>\n<p>\n大学生委员会是大学生的代表机构，一年一度由学生议会选举产生。大学生委员会的代表大都隶属德国各个政党，他们参与高校政治，并设有不同的咨询处。</p>\n<p>\n<strong>大教室（</strong><strong>Audimax）</strong></p>\n<p>\n拉丁文“Auditorium Maximum”，简称Audimax，是大学最大的教室，其用处很多，包括上跨专业的大课、举办活动、召开学生大会等。</p>\n<p>\n<strong>集中课程（</strong><strong>Blockveranstaltungen</strong><strong>）</strong></p>\n<p>\n一般来说，开学期间，研讨会和大课都是每周一次，“细水长流”。而集中课程则是集中时间，如利用一个周末或利用假期里的一周时间，一气授完所有内容。</p>\n<p>\n<strong>校园（</strong><strong>Campus）</strong></p>\n<p>\n在世界上大多数国家，校园都是一个封闭的大学园区，一所高校的所有院系都设在校园里。而在德国，大学的教学楼、行政楼、各个院系往往遍布全城，特别是历史悠久的大学，随着时间的推移，发展扩大，但原有土地面积不够，只得在城里“见缝插针”。</p>\n<p>\n<strong>学分（</strong><strong>Credit Points</strong><strong>）</strong></p>\n<p>\n学分德文叫“Leistungspunkte”（成绩积分），在高校学习取得了一定成绩就能得到。要想证明完成了学业，你必须积够一定的学分。一个学分大约相当于30个工作时。</p>\n<p>\n<strong>延时</strong><strong>c.t. / 不延时s.t. </strong></p>\n<p>\n<br>\n这 些缩写经常出现在课程目录（Vorlesungsverzeichnis）里，表明的是开课时间。德国人原本以准时出名，但他们也往往会在大课或研讨会开 始之前，事先就安排了一定的迟到，这就是所谓的“学院一刻钟”，意即真正开课时间是给定整点时间再加一刻钟，注以缩写c.t.，即拉丁文cum tempore（带延迟时间：一刻钟）的意思。s.t. 即sine tempore（不带延迟时间）则意味着开课时间确实是按所写的整点时间准时开始。</p>\n<p>\n<strong>注销学籍（</strong><strong>Exmatrikulation）</strong></p>\n<p>\n每个学期开始都必须到学校办理返校报到手续，超过预定期限则将被注销学籍，一般来说，就不能在这所大学继续上学了。毕业生则必须自己去注销学籍，即正式退学，但各校规定又不尽相同。</p>\n<p>\n<strong>同专业学生联合会（</strong><strong>Fachschaft</strong><strong>）</strong></p>\n<p>\n同一个专业的所有学生组成一个同专业学生联合会，联合会委员（Fachschaftsrat）或称代表负责维护大家的利益。联合会代表也负责照顾新生，向他们介绍本专业的情况，帮助他们制定自己的课程表。</p>\n<p>\n<strong>系（</strong><strong>Fakultät</strong><strong>）</strong></p>\n<p>\n同属一个知识领域的教学、科研和行政管理单元在大学里称作系。大部分规模较大的综合性大学都设有医学系、哲学系和数学及自然科学系。系的下属单元是研究所或称学院，它们各自都有特定的专业方向。每个研究所又细分为不同的讲座，各由一名讲座教授主持。</p>\n<p>\n<strong>基础课阶段</strong><strong>/ 专业课阶段（Grundstudium / Hauptstudium）</strong></p>\n<p>\n在 引入学士硕士制之前，每个学业都划分成基础课和专业课两个阶段。基础课阶段传授的是基础知识，并通过中期考试（Zwischenprüfung或 Vordiplom）来检验学习成绩。进入专业课阶段，课程内容才开始专业化。因为目前德国有些专业还是以Diplom（德国理工硕士）结业，因而这些专 业仍然保持基础课阶段和专业课阶段之分。</p>\n<p>\n<strong>危难时的辅助——心理治疗和精神关爱</strong></p>\n<p>\n恰 恰是外国留学生常常在适应德国大学学习方面会遇到很多困难。可能和在本国不同，在德国大学，很多事情都得自己操心，组织办理，而且还得用外语。经济困难导 致外国学生的辍学率也相当高。很多大学一开学就为外国学生提供帮助和支援。如果还不能解决问题，不管是因为同学、因为教授，还是因为在外国的生活，你还可 以得到更多帮助，比如去大学设立的心理治疗咨询站。基督教会也在大学设有高校教会，为学生提供精神帮助。</p>\n<p>\n<strong>大学生工作介绍所</strong></p>\n<p>\n想在念书的同时打点零工，大学生委员会（AStA）的工作介绍所可以为此提供帮助。想找学生工的公司和私人，会向工作介绍所打招呼，后者再把工作分配给感兴趣的学生。该介绍所也介绍长期工作。</p>\n<p>\n<strong>成绩证明，或也叫“</strong><strong>Schein（证）”</strong></p>\n<p>\n成功学完一门课，就可得到一张“证”以示证明，证上印有课程名称，有的话还有成绩抑或学分。</p>\n<p>\n<strong>学号（</strong><strong>Matrikelnummer）</strong></p>\n<p>\n每名大学生都会得到一个本校的花名册号，也就是学号。该学号起鉴别作用，会出现在许多文件上中。</p>\n<p>\n<strong>食堂（</strong><strong>Mensa）</strong></p>\n<p>\n大学的食堂叫Mensa，学生用很少的钱就可用餐。学生食堂是由大学生服务部经营的。食品的花样多少和大学的规模有关。小型私立大学往往没有自己的食堂。</p>\n<p>\n<strong>模块（</strong><strong>Modul</strong><strong>）</strong></p>\n<p>\n同 一专业领域的数门课程组成一个模块，意即模块就是一组内容完整的学习单元。模块学习结束后，要进行考试，也就是说，学业当中就已有考试，而且各模块考试成 绩最后会出现在毕业成绩单上。模块下每门课都注有每周课时（SWS），意即该课每学期每周的上课时间。每周2个课时是指该课每周上两节，每节45分钟。从 整个学期来看，每周2个课时一般相当于实打实30个小时的授课时间。整个学业要累计一定数量的每周课时，而且一般也都必须记录在课程登记簿 （Studienbuch）里。</p>\n<p>\n<strong>博士答辩（</strong><strong>Rigorosum</strong><strong>）</strong></p>\n<p>\n除了书面博士论文，还得通过答辩即口试，才可被授予博士头衔。</p>\n<p>\n<strong>返校报到（</strong><strong>Rückmeldung</strong><strong>）</strong></p>\n<p>\n在一定期限内必须去大学返校报到。大多情况下汇过去学期杂费也就够了，表明要继续就读。错过期限，则可能被注销学籍。</p>\n<p>\n<strong>公告板（</strong><strong>Schwarzes Brett</strong><strong>）</strong></p>\n<p>\n<br>\n尽管到了Facebook和微博的时代，大学里还依然有巨幅公告板，上面插满住房广告、寻物启事、抑或各类活动的推介等。</p>\n<p>\n<strong>学期（<strong>Semester）</strong></strong></p>\n<p>\n在德国一学年被分成两个学期。夏季学期四月至十月，冬季学期十月至四月。</p>\n<p>\n<strong>学期优惠车票（</strong><strong>Semesterticket）</strong></p>\n<p>\n学生可以用所谓学期优惠车票，廉价乘坐公共交通工具。钱必须随学期杂费一并汇过去，下学期的车票便有了着落，但德国有些高校不提供学期优惠车票。</p>\n<p>\n\n</p>"
    },
    {
      "post_id": 111,
      "title": "DW 全球基督徒迎来复活节庆典高潮",
      "date_published": 1459079280,
      "body": "\n<p>\n（德国之声中文网）持续数小时的礼拜仪式在梵蒂冈圣彼得大教堂的前庭举行。教宗方济各在那里点燃复活节圣火，并用此点亮了蜡烛。随后，他手持蜡烛、在长长的宗教仪式行列中，带领其他主教们绕行有数千名朝圣者到场的圣彼得大教堂。</p>\n<p>\n<b>问题不能左右生活</b></p>\n<p>\n方济各作为天主教的最高领袖，在复活节的传道词中呼吁人们不应该被所面临的问题和困难征服。必须让\"悲怆心中的希望\"重获新生，不然的话，教会\"就无法给予世界所渴望得到的希望。\"</p>\n<p>这位天主教宗呼吁，信徒们必须走\"相见和互信之路\"。他表示：\"当我们感到悲伤，没有希望，被自己囚禁的时候，就无法找到生活的真谛。\"这位现年79岁的阿根廷人表示：问题总会有的，但不能让问题左右生活。</p>\n<p>\n依照天主教的传统，教宗随后为12名成年和青年人举行了洗礼仪式。他们来自意大利、阿尔巴尼亚、加麦隆、韩国、印度和中国。</p>\n<p>\n复活节期间，全世界的基督徒都会庆祝耶稣从死亡中复活。根据圣经的记载，圣子耶稣于周五受难日当天在耶路撒冷被钉在十字架上。基督徒们相信耶稣在复活节周日这天战胜了死亡，完成了天主救赎人间众生的使命。</p>\n<p><b> 圣彼得广场的复活节礼拜</b></p>\n<p>\n每年复活节宗教庆典的高潮是周日在梵蒂冈圣彼得广场举行的复活节礼拜。今年，在恐怖袭击的阴影下，梵蒂冈特别加强了礼拜现场的安保级别。教皇在礼拜的过程中用那句知名的\"Urbi et Orbi\"来为城市和地球祈福。</p>\n<p>\n在基督教的圣地耶路撒冷，来自全世界各地的数千名基督徒也会在那里举行复活节庆典礼拜。耶路撒冷大主教在圣墓教堂举行礼拜庆祝耶稣复活。根据基督教的教义，这位救世主的坟墓位于耶路撒冷老城区中的一座教堂中。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 110,
      "title": "DW 德警方逮捕多名极右翼恐怖嫌疑人",
      "date_published": 1461060660,
      "body": "\n<p>\n（德国之声中文网）德国联邦警察周二在萨克森州逮捕了涉嫌建立右翼恐怖组织的4名男子和一名女性。据联邦检察院公布的消息，警方还在萨克森搜查了多处住宅及其他场所。被逮捕的五人涉嫌最迟于2015年参与建立极右翼恐怖组织\"弗莱塔小组\"（Gruppe Freital）。迄今为止的调查显示，该组织的目的是针对难民住所以及\"政治异见人士\"，即左派社团的社会公益住所项目进行爆炸袭击。</p>\n<p>\n为此该组织成员从捷克购买了不同型号的数百件燃烧型爆炸物。来自联邦刑侦局、联邦警察和萨克森州警方的两百多名警员参加了周二的搜捕行动。检察院称，此次追查的嫌疑人中，还有的涉嫌谋杀未遂、故意伤害、制造爆炸以及损坏他人财物等罪行。</p>\n<p>\n周二被捕的5人，是4名年龄在18到39岁之间的男性和一名27岁的女性。他们被指与另外3名男子建立了所谓的\"弗莱塔小组\"，在德累斯顿附近的小城弗莱塔（Freital）实施了多起刑事犯罪。检方指控上述8人最迟于2015年7月与其他有相同目的的人结成名为\"弗莱塔小组\"的恐怖组织。有3名嫌疑人，包括该小组的两名领导人Timo S.和Patrick F.已经在接受司法调查。</p>\n<p>\n根据目前的调查结果，这一恐怖主义小组要为3起爆炸袭击事件负责，其中包括2015年9月和11月对弗莱塔两处难民收容所的袭击。10月19日，多名嫌疑人还袭击了德累斯顿一处致力于帮助难民的社会公益居住项目。联邦检察院表示，该恐怖组织是否还制造了更多的袭击事件，是今后的调查工作要澄清的内容。</p>\n<p>\n2015年6月，弗莱塔发生反对在当地设立难民收容所的排外游行示威曾在全德范围引起关注。此外，还曾有一名左翼党政治家的汽车在弗莱塔遭到爆炸物袭击。</p>\n<p>\n<i>使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！</i></p>"
    },
    {
      "post_id": 109,
      "title": "DW 利用干细胞培养皮肤和毛发",
      "date_published": 1460278860,
      "body": "\n<p>\n(德国之声中文网)据美国最新一期学术杂志《科学进展》报道，日本东京理科大学以高木良（Ryoji Takagi）为首的一个研究团队利用小鼠的所谓诱导性多能干细胞（iPS细胞）培养出了皮肤组织。被移植到小鼠皮肤上后，该组织可以发育生长，如同天然皮肤一样。</p>\n<p>\niPS细胞是经人工诱导重编程的体细胞，其自身发育已经到头，就等下一步发育成特定的组织细胞或器官细胞了。它们就像胚胎干细胞一样，具有所谓的发育全能性，经过适当诱导，可以转化成各种各样的体细胞。</p>\n<p>\n<b>信号蛋白诱导发育成所需细胞</b></p>\n<p>\n在该实验中，研究人员先在培养皿中将iPS细胞培养成很小的块状组织。这种所谓的\"胚状体（Embryoid bodies）\"在一般情况下会无序生长，随机转化成各种各样不同类别的组织，但研究人员可以通过添加信号蛋白，影响其转化方向。随后，他们将这些细胞暂时移植到小鼠的肾脏附近，以助其分化增长。</p>\n<p>\n研究人员发现，经过如此处理之后，这些iPS细胞后来就发育成了皮肤细胞层、毛囊以及其它一些皮肤结构。毛囊中，就像正常的毛发一样，含有皮脂腺和肌纤维。随后，研究人员又将如此培养出来的组织，移植到其它小鼠的皮肤上。14天后，在原本并无毛发的这些小鼠的皮肤移植部位，长出了毛发，而且移植组织也和其周边的神经纤维和肌纤维弥合。干细胞研究的一个特别风险，即可能生成肿瘤的风险，在该项实验中却未发生。三个月后，被移植的皮肤组织中依然没有癌细胞。</p>\n<p>\n<b>未来憧憬：实验室培育替代器官</b></p>\n<p>\n参与该项研究的辻孝博士（Takashi Tsuji）在日本理化学研究所发育生物学中心发布的一项公告中表示，希望将来能借助这一方法，\"在实验室里培育出可供移植的完好器官\"。</p>\n<p>\n不过，该研究团队在进一步探索培养其它器官细胞之前，想先尝试培育人体皮肤，譬如用于治疗烧伤患者。</p>\n<p>\n<b>还有很多问题有待解答</b></p>\n<p>\n海德堡的德国癌症中心干细胞与癌症部门主任、HI-STEM干细胞研究所所长安德烈亚斯·特龙普（Andreas Trumpp）对媒体表示，利用小鼠细胞取得的这一新的研究成果，只能算是人们向人造人体皮肤的方向上迈出的第一步。他说：\"这项研究是在已有的一个方案上做出的进一步改进，但凭此方法还得不到纯粹、完整的皮肤，而只是其中一小部分，而且是毛囊含量特别多的一小部分。\"</p>\n<p>\n特龙普表示，该研究也还没有证明这块新皮肤确实完好地具备皮肤的所有功能，譬如皮肤的屏障功能、出汗功能、皮脂腺分泌功能等等。</p>\n<p>\n2006年，日本学者山中伸弥（Shinya Yamanaka）成功地对体细胞进行重编程，得到了iPS细胞，使干细胞研究取得了突破性进展，因而荣获2012年度的诺贝尔生理学或医学奖。</p>\n<p>\n<em>使用我们的</em><em>App</em><em>，阅读文章更方便！给</em><a href=\"mailto:yingyong@dingyue.info\"><em>yingyong@dingyue.info</em></a><em>发送一封空白电子邮件就能得到软件和相关信息！</em></p>"
    },
    {
      "post_id": 108,
      "title": "DW 伊朗宣称批量生产一种短程巡航导弹",
      "date_published": 1328376840,
      "body": "\n<p>\n德黑兰</p>\n<p>\n伊朗宣称已经开始对一种新型导弹进行批量生产。据该国国家电视台报道，这是一种短程巡航导弹，可以对海上的中小型目标进行高精确度打击。据称，该导弹可以直接从快艇上发射，而且飞行高度非常的低，很难被雷达发现。伊朗自称拥有大量的短程、中程和远程导弹，其中的一部分甚至可以打击到以色列以及美国设在中东地区的军事基地。</p>"
    },
    {
      "post_id": 107,
      "title": "voa 专家：习近平忙集权，经济改革无望",
      "date_published": 1461013542,
      "body": "\n<p>美国经济专家指出，中国政府忙于建构集权，经济改革议题失宠，将导致2016年全球经济增长率进一步放缓。</p>\n<p>世界货币基金组织最新预测，把2016年全球经济增长率下调到3.2%。专家指出，中国等新兴经济体经济放缓是导致全球经济下滑的主要原因。</p>\n<p>纽约大学商学院教授努里尔·鲁比尼说:“普遍认为，发达国家和新兴市场经济下滑的部分原因是金融危机，加上发达国家以及中国、俄罗斯和韩国等重要新兴经济人口老龄化。”</p>\n<p>鲁比尼说，除此之外，中国等新兴经济市场民众对经济缺乏信心，存款大于消费，也使得经济增长失去动力。</p>\n<p>专家指出，中国急需经济结构改革，可是中国国家主席习近平忙于建构集权，把经济改革推到了后排。</p>\n<p>花旗集团首席经济学家威廉·比特说：“中国正在进一步集权化，决策权集中的程度高于毛泽东以来的任何时期，难以想象中国成为一个令人满意的非集权市场经济。”</p>\n<p>西方国家一度普遍认为，习近平和中共有办法维持高速经济增长，哪怕增幅有所收窄，也会在6%左右。不过现在外界对这个数字也持怀疑态度。一方面中共没有什么计划，看不出这个目标究竟是否能够维持或现实。另一方面，中国外汇储备一年内从近4万亿美元缩水到3.2万亿美元，急剧跌幅令人担忧。</p>\n<p></p>\n<p>《南华早报》发表文章说，中国目前急需拿出大胆又清晰的经济改革方案，可是两会上宣布的那些政策远不能满足当下的需求。会议中最引入注意的不是具体成果，而是严厉的政治气氛。文章透露，有人要求会议代表谢绝海外媒体的访问，国内媒体则遭到更严格的审查。</p>\n<p>比特表示对2016年中国经济不乐观，担心会硬着陆。</p>\n<p>他说：“我非常担心，在集权过程中，政府不会真正关注经济。我认为这至少会导致周期性硬着陆。”</p>\n<p>观察人士指出，习近平对巩固政权的执着凌驾于制定政策之上。他执政三年多以来，不断巩固自身地位，却没能提出解决经济滞缓的方案，以带领中国经济安然度过这个不明朗的阶段。</p>\n<p>&nbsp;</p>"
    },
    {
      "post_id": 106,
      "title": "voa 美国之音新台长就职 曾任驻京记者",
      "date_published": 1461012530,
      "body": "\n<p>美国之音新台长阿曼达·贝内特（Amanda Bennett）的就职仪式4月18日在美国之音总部大楼举行。</p>\n<p>阿曼达·贝内特一手放在家传的圣经上宣誓就职。</p>\n<p><strong>记者肩负使命</strong></p>\n<p>阿曼达·贝内特是一位获得过普利策奖的资深记者，擅长调查报道；曾经在几个著名媒体机构任职，包括华尔街日报和彭博新闻社。</p>\n<p>贝内特说，记者肩负着使命。她说：“我们进入这个行业不只是为了养家糊口，而是要让世界变得更美好。我们要影响他人，把光明带到黑暗的地方，纠正错误，促使机构为自己的行为负责，挖掘美国人民有权知道的秘密。”</p>\n<p>1987年贝内特在华尔街日报带领团体围绕政府在艾滋病问题上的失误进行系列报导而获得普利策奖。</p>\n<p>阿曼达·贝内特是美国之音第29任台长。有70多年历史的美国之音目前以43种语言以电视、电台和网络等多种形式向世界各地广播。</p>\n<p><strong>美国的声音</strong></p>\n<p>近年来有一些声音认为美国之音（VOA）的使命已经完成。</p>\n<p>对于这种说法，阿曼达·贝内特说，美国之音比以往任何历史时期都有必要存在。</p>\n<p>谈到美国之音的未来远景，贝内特说，美国之音代表的就是美国的声音。她说：“我们讲述美国的故事，我们也用美国自由、公平媒体的价值观把新闻带到那些观众没有其他方式接触到这些新闻的国家。”</p>\n<p>贝内特解释说，讲述美国的故事有广泛的含义，“它包括外交政策、农业，所有那些我们擅长的东西，医药、教育、科技，等等。就拿中国人来说，他们对于投资，金融这些非常感兴趣，巴菲特在中国是大英雄之一。我们有很多非常有意思、非常特别的内容可以呈现给我们的观众。”</p>\n<p></p>\n<p><strong>驻京记者的经历</strong></p>\n<p>阿曼达·贝内特1980年代末还曾经担任过三年驻北京记者。</p>\n<p>谈到这段经历，她特别强调那时候西方人把北京称为Peking。她说，这段经历对她来说，“最让人兴奋的就是，我当时在《华尔街日报》工作，做为世界上最大、最重要的资本主义经济体的一个代表，我能够观察世界上最大、最重要的共产党经济体，看着两国如何学会共事。那很令人兴奋。”</p>\n<p>她说，当时作为一个调查记者最大的挑战是如何说服当地人和她交谈。</p>\n<p>贝内特还是六本书的作者，包括她在2012年出版的《希望的代价》，讲述了她已故的丈夫与癌症做斗争的经历。</p>"
    },
    {
      "post_id": 105,
      "title": "voa 推特染红？新高层背景惹疑虑",
      "date_published": 1461004927,
      "body": "\n<p>主持人：社交媒体推特的新任大中华区主管陈葵，其政治背景持续引发中国网友激烈讨论，不少人甚至到白宫网站联署请愿，要求调查陈葵的背景，反对这项任命案。反对者的理由何在？是否合理？这名推特新高层人士可能给推特带来什么样的转变？下面我们通过SKYPE连线，请前六四学运参与者，也是媒体工作者唐路来谈谈她的看法。</p>\n<p>这几天各界都在对陈葵进行起底，发现她曾经在解放军二炮，也就是现在火箭军的第一研究所担任技术工程师，也曾经担任中国公安部组建的合资公司总经理，军方加上公安部门的双重身份，是不是反对者质疑她的最大原因？还有其他因素吗？</p>\n<p>唐路：这是主要的原因。另外一个是因素是我看到推友在推特上说她以前是思科在中国的负责人。思科对中国的防火墙和网络安全是做了很大贡献，所以大家非常担心。这样的心理我非常理解。有人说推特是一个小酒馆，实际上完全超过了一个小酒馆的概念。我们面对的是中共政府，比纳粹还残酷的一个政府。我们是一支抵抗军，推特是我们这个抵抗军主要的基地。我们利用推特组织了很多活动，有很多团队。如果我们抵抗军的基地让党卫军的一个头头来管了，能想到么？</p>\n<p>主持人：除了我们提到有军方有公安界的背景以外，在她得到这个任命案以后，她在推特上的交流更让大家产生怀疑。介绍一下是什么样的内容引发了各界的质疑？</p>\n<p>唐路：她在推特上的交流，我感到非常愤慨。4月15日的时候，推特的创始人杰克·多尔西（Jack Dorsey）宣布任命她为推特新任大中华地区的总管，马上就有新华社和央视在推特上公开向她庆贺。然后她用英文回帖：“Let’s work together and tell great China story to the world.”意思就是，让我们合作，把伟大的中国的故事告诉世界。</p>\n<p>这个是个什么伟大的中国? 如此公开地在推特上恬不知耻地，公开地向央视和新华社这些中共头号打手献媚，说要合作，这是非常令人愤慨的。</p>\n<p>主持人：有人说陈葵应该做的是要帮助让中国打开对外国社交媒体的限制，到目前为止，陈葵并没有具体回应外界的质疑，对媒体采访的要求也没有回复。您觉得陈葵或者推特应该怎么做才能化解外界，特别是中国网友的疑虑？</p>\n<p>唐路：这是非常明显的，这个要不就是他们公关的一个大的灾难和失误，不然就是他们故意不回应，忽视我们的呼声，故意忽视广大客户的呼声。他们必须做出回应，必须撤掉党卫军的职位。</p>\n<p>主持人：也有部分人士认为反对者的反应太激烈。他们认为陈葵主要负责推广业务，与言论自由，监控言论没有关联，您怎么看这样的说法？</p>\n<p>唐路：这完全不是草木皆兵，大惊小怪。这个消息一出来，很多人非常警觉，是因为有前科，不是推特的前科，而是美国网络公司跟中国政府联合，或者向中国政府磕头，来打压网络人士的前科。雅虎当时把个人用户的信息提供给中国政府，师涛当时判了十年。所以很多网友在推特上说，现在得有多少个师涛，要判多少年啊。现在大家最担心的是墙内的，我们境外要跟中共对立下去，我们不怕，我就不怕，但是我们最担心的是境内的推友。国内推友用户的资料，他们都在说，赶快备份删掉，赶快撤退吧。</p>\n<p>主持人：就在推特宣布这项任命案的当天，上周五也是中国政府推出的第一个全民国家安全教育日。中国当局强调动员全社会来维护国家安全，加强所谓的国安意识。在这样的氛围下，尽管推特被视为是中国翻墙网民的一个安全平台，您对推特未来中文圈的发展乐观吗？</p>\n<p>唐路：非常非常悲观，但是我对中国民主自由的未来不悲观。大家现在是被逼上梁山，每天都有很多推友网友在推上表达对抗的决心，要跟“习特勒”对抗到底。他对国家安全日的评论，是要让群众达到安全幸福的目的，这是非常让人恶心的。意思就是在洗脑，你自愿享受当奴隶的待遇吧，让你被打，被关，被判刑有一种安全幸福感，让你欢呼吧，这个是不能容忍的。这实际上会让更多人被逼上梁山。我们决心更大，所以也不怕推特这些，如果他们不撤掉陈葵，我们就转战其他的地方呗。</p>\n<p>主持人：非常感谢唐路来到美国之音现场。</p>"
    },
    {
      "post_id": 104,
      "title": "voa 重塑斯卡利亚：舞台上的大法官",
      "date_published": 1461003861,
      "body": "\n<p>美国最高法院大法官安东尼·斯卡利亚生前因其保守立场颇受争议，但他的聪明机智一向被众人津津乐道。在美国首都华盛顿有位舞台剧演员神似斯卡利亚，媒体甚至将他的照片误植于斯卡利亚逝世的报道中。记者带我们来到以大法官为主题的舞台剧现场，这位演员也分享了与大法官私交的小趣闻。</p>\n<p>美国最高法院大法官安东尼·斯卡利亚(Antonin Scalia) 骤世的消息，令许多美国人悼念不已。数家媒体发布了大法官微笑的照片- 后来才发现那不是斯卡利亚，而是曾扮演他的演员爱德华·吉洛(Edward Gero)。</p>\n<p>吉洛说：“有位威斯康辛州参议员在推特上发了我的照片，还有Salon.com,赫芬顿邮报等。我相信斯卡利亚大法官在天堂大笑。”</p>\n<p>2015年以斯卡利亚为主题的舞台剧“原旨主义者”（The Originalist）在华盛顿中央舞台（Arena Stage）上演。61岁的吉洛比斯卡利亚小18岁，他们同为出身新泽西的天主教意大利裔，祖父母在意大利的老家仅距离五公里。</p>\n<p>吉洛表示：“我不觉得我在演戏。我感觉像在做自己。”</p>\n<p>保守派的斯卡利亚，支持死刑和反对堕胎、同性恋等强硬立场，让他颇受争议。</p>\n<p>吉洛说：“当斯卡利亚走上舞台，你可以看到观众的反应，他们像在说：“噢，不不不。”我扮过许多观众咬牙切齿的角色，但像这种观众咬牙不去喜欢的角色，还是第一个。不过到了剧末，他们都喜欢了。”</p>\n<p>舞台剧台词：“这个国家一半的人觉得我是个进攻型的，争强好斗，法纪的信徒 。另外一半视我为英雄！进攻型！争强好斗！法纪的信徒！”</p>\n<p>吉洛花了一年时间准备，阅读法律书籍并在法庭上观察斯卡利亚，后来更与他结为朋友。</p>\n<p>吉洛回忆道：“我第一次和大法官见面时，他说：“你长得和我有点像。但你没有连心眉。”我说：“我拔掉了。”</p>\n<p>&nbsp;“他几乎只用右手。有时候他会圈住两指，他常抽雪茄，就好像他边讲话边抽雪茄一样。”</p>\n<p>“他善于倾听。有时他会闭上双眼，因为他正集中精神于对方的一字一句。听论述时他非常敏锐。如果发现一点错误，他会跳起来。”</p>\n<p>他们一道进行飞碟射击 (skeet shooting)，斯卡利亚为吉洛在射击背心上签名。</p>\n<p>吉洛说：“我射中了碟靶，而他没有。他看起来很泄气，“你有新手运。我是个大输家。”他很妙。”</p>\n<p>斯卡利亚辞世的消息令吉洛非常不舍，他也参加了他的葬礼弥撒。</p>\n<p>吉洛表示：“他的太太说：到了我们这个年纪，要交新朋友非常困难。但他显然交到了你这个新朋友。”</p>\n<p>舞台下的吉洛在乔治梅森大学戏剧系已任教25年。<br>\n科班出身的他曾在纽约沉浮八年，早上在早餐店打工，晚上做酒保，其余时间用来试镜和找机会。最后，他得到华盛顿一间剧院的赏识，从此落地生根。</p>\n<p>吉洛说：“做为业界人士有个好处，学生有机会看到，我是否对他们的要求身体力行。所以他们可以来看我的戏，然后想：“他要求我们的，自己是否做到了？”</p>\n<p>吉洛的学生艾米丽·贝里说：“他准备“原旨主义者”时，我在上他的“人物塑造”(characterization)课。他在课堂上讲的，建造角色，花时间与斯卡利亚相处，研读他，我们在课堂上学到的东西，他都应用到了现实。”</p>\n<p>吉洛的学生米娅·阿马多表示：“爱德能够投入感情，融入在角色里，展现出斯卡利亚诙谐又人性化的一面，而不是许多媒体描绘的大怪物。”</p>\n<p>在校园里，他乐于培育更多他心中的“公民艺术家”（citizen artist）。</p>\n<p>吉洛说：“公民艺术家知道戏剧有一种影响力，能够改变想法，提出问题激荡出更大规模的讨论。“原旨主义者”讲的正是公民间的对话。”</p>\n<p>“原旨主义者”计划于2017年春天再度上演。</p>"
    },
    {
      "post_id": 103,
      "title": "voa 美学者：美国对中国的政策一开始就设定错误",
      "date_published": 1461027794,
      "body": "\n<p>在华盛顿一场有关美中关系的研讨会上，有美国学者指出美国对中国的外交政策目标从一开始就设定错误，使得美中关系在软实力的竞争中逐渐失去优势。</p>\n<p>在美国对外政策理事会举行的关于中国改革的研讨会上，这个机构的中国事务资深研究员马佳士(Joshua Eisenman)指出，美国一直希望借由中国经济改革带来民主转型的计划已经证实失败，目前美国政府急需重新评估并调整对中国的外交政策，而当务之急是要改变对中国的基本态度，接受中国现有的模式，接受中国拒绝民主化的事实。</p>\n<p>马佳士说：“我希望我们能放弃要改变中国的这种想法，这种传教式的期盼，希望有朝一日中国能变成基督教国家或解放中国的这种想法一直都是不切实际的，我们从一开始就不应该有这样的想法。”</p>\n<p>在这次名为“习近平掌权下：中国的改革与区域的回应”的研讨会上，马佳士说，美国的对中国的外交政策应该要以美国的国家利益为出发点，但这么做不是要美国忽视中国人权或轻视民主价值观，而是要在与中国就有关议题的交涉过程中找出有效、正确的方法来影响中国的人权状况。马佳士说，从结果来看，美中两国自1990年起至2015年所进行的19次人权对话其实根本效用不大，现在没有用，以后也不会有用。马佳士在研讨会上说：“我们和中共坐下来谈人权时，必须非常实际，必须问自己我们的外交官花时间这么做是否真的值得。如果我们是和普京谈人权，你觉得值得吗？我不知道，也许值得，也许不值得，也许最终结果是好的，我不知道。但要是我来做决定的话，我会加倍增加美国之音、自由亚洲的预算，我认为那是我们必须要花钱的地方。”</p>\n<p>马佳士在会后接受记者提问时表示，在软实力的竞争中，美国政府应该以将讯息直接传达给中国人民为主，积极让中国民众了解美国的核心价值，同时尽可能的防止中国政府阻挠人民接受不同的讯息。</p>\n<p>马佳士还说，中国的对外政策一直是有系统并有长期目标的。他表示，中国寻求的不是全球对中国印象的一夕改变，而是要培养在各地对中国“友好”的种子。以许多非洲国家的例子来说，这样的耕耘正逐渐开花结果，在肯尼亚和南非等国家，当地人民对中国愈来愈友善，这种充满耐心的“长久之计”所发挥的影响力正是美国政府在制订政策时所要重视的。</p>\n<p>&nbsp;</p>"
    },
    {
      "post_id": 102,
      "title": "voa 中国军机在南海有争议岛屿降落",
      "date_published": 1461024975,
      "body": "\n<p>中国表示，一架军用飞机降落在南中国海有争议的一座人工岛屿上，这是中国首次公开承认这样的任务 。</p>\n<p>中国官方媒体星期一报道说，一架正在南海执行空中巡逻任务的海军巡逻机紧急飞赴南沙，降落在永暑礁机场，执行三名重病建筑工人的转运任务。</p>\n<p>在接走患病的工人之后，这架飞机后来降落在海南岛，病患由一辆救护车接走。</p>\n<p>中国外交部发言人陆慷表示，提供紧急救助，是中国军方的传统。他说，“在中国领土上，这样的事情不足为奇。”</p>\n<p>中国去年在有争议的斯普拉特利群岛，也就是中国所称的南沙群岛的这座岛屿上完成了3千米跑道的建设，今年一月开始试飞商业航班。</p>\n<p>本月早些时候，美国国防部长卡特表示，美国对中国在南中国海的行动表示严重关切。</p>\n<p>&nbsp;</p>"
    },
    {
      "post_id": 101,
      "title": "voa 克里:美国将继续致力于实现以巴和平",
      "date_published": 1461049822,
      "body": "\n<p>美国国务卿克里星期一保证，美国在奥巴马总统在任的最后9个月期间将继续争取实现以巴和平。</p>\n<p>克里强调了结束长期冲突的重要性，并说两国方案是唯一可行的途径。</p>\n<p>克里2013年初就任国务卿时，将谋求以巴和平作为首要任务之一。在克里的斡旋下，以色列和巴勒斯坦进行了9个月的和谈，但和平进程于2014年4月中断，双方未能达成任何协议。在此几个月后，加沙地带爆发了持续50天的战斗，造成2100多名巴勒斯坦人死亡，</p>\n<p>在和谈进程中，一个重大障碍是以色列继续在约旦河西岸兴建定居点，而巴勒斯坦将该地区视为未来国家的组成部分。</p>"
    },
    {
      "post_id": 100,
      "title": "voa 美将为菲提供海空观测器材监测南中国海动态",
      "date_published": 1461027438,
      "body": "\n<p>美国将为菲律宾提供海上和空中的一些观测器材,以监测南中国海动态。</p>\n<p>美国驻菲律宾大使菲利普.戈尔德伯格星期一接受CNN 电视台采访的时候说，美方将为菲律宾提供的器材当中，包括可以用于舰船上的感应器以及可以用于观测和搜集海上动态的、附在气球装置上的雷达等通讯器材。</p>\n<p>日本媒体报道说，菲律宾与中国之间在南中国海就海域主权的争端促使菲方在战略和安全领域寻求同美国和日本之间的合作。日本媒体还报道说，就在美国国防部长卡特上个星期访问菲律宾期间，即将在今年六月卸任的菲律宾现任总统阿基诺说服了美方将一些官兵部署到菲律宾。路透社报道说，美方计划在马尼拉以北的一个空军基地部署75名官兵。</p>\n<p>卡特在访问菲律宾期间还提到了美菲两国之间的联合海上巡逻方案。菲律宾和美国之间在1951年签署了安全协作条约。</p>\n<p>另一方面，据中国官媒报道，一架中国海军巡逻机星期天上午降落在南中国海永暑礁，执行病人转运任务。</p>\n<p>这是中国第一次公开军用飞机在永暑礁人工岛降落的消息。包括永暑礁在内的南中国海岛屿、岛礁和海域存在多方声索主权的争议。</p>\n<p>中国官方媒体引用军事专家的话说，这次中国军机在永暑礁机场降落表明，该机场已经具备应用能力。海上巡逻机能起降，战斗机也能起降。</p>"
    },
    {
      "post_id": 99,
      "title": "voa 到霓虹灯外的纽约上州观察选情",
      "date_published": 1461021391,
      "body": "\n<p>离开百老汇的灯火通明和华尔街的银光闪闪，驱车两个小时，就进入了一个完全不同的纽约：绿色的草场、开阔的天空和成群的牛马。在当下的选举季节，小镇选民可能会有大影响。就在纽约州民主党和共和党初选的投票站开门前夕，很多人仍然举棋不定。</p>\n<p>纽约人有不一样的群体。</p>\n<p>离开纽约市，沿着哈德逊河驱车北上，不久就会进入乡村地区。这里属于所谓的“纽约上州”。候选人们也许不常来这些地区竞选拉票，不过，这一群体代表着美国中产阶级的中坚力量。他们在政治观点上的多样性毫不亚于纽约城里人。</p>\n<p>一位纽约上州人对美国之音说，他支持桑德斯，另一位上州人却说，他不会排除川普。</p>\n<p>在初选即将开始之际，很多纽约上州选民仍在观看。在阿塔蒙和根特等小镇，跟其它地方一样，人们最关心的是经济问题。</p>\n<p>特罗布里奇农场(Throwbridge Farms)的业主菲尔·特罗布里奇说：“农业受的打击跟大家一样大，甚至更大。”</p>\n<p>菲尔·特罗布里奇是种牛饲养者。他说，他的政治观点是“支持选择和反对工会”。支持堕胎权利一般是民主党人的立场，反对工会的人往往是共和党人，这让他置身于政治光谱的中间。不过，佛蒙特州国会参议员桑德斯和他的一些支持者让他失望。他觉得，免费上大学的方案在经济上不可行。</p>\n<p>他说：“他（桑德斯）怎么那些主张找到资金？真不知道他们是怎么想的。”</p>\n<p>美国务农人员连年减少，农业对美国政治的影响力也随之减少。不过，农业生产充满变数，这意味着农场主们仍然必须关心政治。</p>\n<p>对纽约农场主来说，农场法案、作物保险和州最低工资等政策问题才是他们最关心的，不过，候选人很少在竞选途中谈这些话题。</p>\n<p>&nbsp;“上星期一，我们刚发芽的水果一夜之间可能损失了一半，” 彼得·坦·埃克说。</p>\n<p>彼得·坦·埃克在纽约州阿塔蒙镇外拥有一家120公顷的印第安梯子农场(Indian Ladder Farms)。对他来说，选举的核心议题是“小政府”。他说，前国务卿克林顿为纽约上州做出过应有的贡献，不过，白宫已经有太多的布什和克林顿了。他觉得，俄亥俄州州长卡西奇可能是个不错的选项。</p>\n<p>他说：“他在俄亥俄做得不错，削减了很多赤字，平衡了几次预算。”</p>\n<p>彼得和菲尔都把他们的农活形容为一种生活方式。他们带着敬意对待牲畜和环境，也希望总统能够带着尊敬对待民众。</p>\n<p>彼得说：“说‘冲那个女人长的那张脸，谁会投她票？’这种话的人，你怎么能够自豪地把他看成是自己的总统？”</p>\n<p>彼得和菲尔还都认同个人责任。他们说，在选举日这天，不能呆在家里不出来。</p>\n<p>菲尔说：“我们至少要试着去选一位我们认为最好的人来做总统，如果我们连试都不试，那我觉得，做为公民，我们就是失职。”</p>"
    },
    {
      "post_id": 98,
      "title": "voa 塔利班在阿富汗首都发动袭击致多人死伤",
      "date_published": 1461053470,
      "body": "\n<p>塔利班叛乱分子星期二上午在阿富汗首都喀布尔进行爆炸和枪击，造成多人死伤。</p>\n<p>袭击目标是一座建筑。有关官员说，该建筑属于阿富汗安全部队一个负责保护政府官员的特殊机构。袭击开始于上午9点左右，当时一名自杀爆炸手引爆了一辆装满炸药的汽车。</p>\n<p>官员和居民说，袭击者和阿富汗安全部队进行了激烈的枪战。</p>\n<p>阿富汗卫生部发言人在喀布尔对美国之音说，救援人员已把198名伤者送到喀布尔几家医院。</p>\n<p>阿富汗总统阿尼对袭击进行“最强烈的”谴责，并说有多人死伤。他表示，这次袭击明确显示塔利班在与阿富汗安全部队的正面作战中已被击败。</p>\n<p>塔利班发言人穆贾希德发送给记者一份声明，宣称对袭击负责。</p>"
    },
    {
      "post_id": 97,
      "title": "voa 成百上千人在美国国会山抗议，多人被捕",
      "date_published": 1461014950,
      "body": "\n<p>根据美国国会警方的消息，大约3百名抗议者星期一在国会游行之后被捕。他们提出一系列诉求，并称他们自己是“民主的觉醒”。</p>\n<p>与占领华尔街运动类似，这个可以团体抗议政治中存在的“大钱”和“黑钱”。该组织声明的目标是“团结起来，唤醒所有人都可以得到，而无需仰赖大钱利益集团的民主。”</p>\n<p>该组织表示，这是必要的温和抵抗行动，这将是这代人的标志。</p>\n<p>在华盛顿联合车站外搭起的台上，迎来了一些著名人物，比如美国全国有色人种协进会主席科奈尔·布鲁克斯以及电讯工人工会主席克里斯·谢尔顿等。西班牙语和手语翻译也在台上，翻译众人的演讲，以及抗议活动参与者在活动开始前承诺非暴力游行。</p>\n<p>前往国会山的游行者手持标语呼喊着反对金钱政治的口号。抗议者向美国参议院大楼的窗户方向挥舞拳头，高喊“好好干你们的工作！”</p>\n<p>数十名抗议者拒绝听从让出国会大厦台阶，否则会有被捕危险的警告。很多抗议者早就做好了被捕的准备。</p>"
    },
    {
      "post_id": 96,
      "title": "voa 厄瓜多尔地震死亡人数升至413人",
      "date_published": 1461053982,
      "body": "\n<p>厄瓜多尔总统科雷亚说，上星期六强烈地震后的重建工作将耗资数十亿美元。至少413人在地震中丧生。</p>\n<p>科雷亚星期一视察了东北部城镇波托维耶霍，现场了解这场7.8级强震造成的破坏。波托维耶霍以及附近城市曼塔和佩德纳莱斯的灾情最重，不过地震给厄瓜多尔全国各地都造成不同程度的破坏。</p>\n<p>厄瓜多尔救援人员星期一在一处被地震摧毁的购物中心的瓦砾中救出3人，他们已经被困超过32小时。</p>\n<p>电视转播了港口城市曼塔进行的引人注目的救援画面，带给厄瓜多尔人以希望。很多失踪的人可能还会被发现。</p>\n<p>这场地震是厄瓜多尔半个多世纪以来最严重的自然灾害。地震还造成2500多人受伤，成千上万人无家可归。</p>"
    },
    {
      "post_id": 95,
      "title": "voa 港人疑北京通过审批单程证输送国安人员抵港",
      "date_published": 1461003280,
      "body": "\n<p>刚刚落马的原河北省政法委书记张越被曝出通过贩卖香港单程证给权贵人士牟利。港人称此种事情由来已久，几乎人尽皆知，并呼吁中国政府将单程证审批权交还香港。</p>\n<p>陆媒网易《路标》4月16日报道，原河北省政法委书记张越每年贩卖一定数量的香港单程证给“有背景的”人士，其中包括去年被财新网起底的盘古大观老板郭文贵的六哥郭文纯。此前，震惊世界的“巴拿马文件”也披露了一些违规持有香港单程证的中共高官亲属，包括中国国家领导人习近平的姐夫邓家贵和前国家总理李鹏的女儿李小琳。但不知这两人的单程证是否也是通过张越获得的。</p>\n<p>香港单程证由中国公安部门派发，每日限额150人。持有者将获准在港合法居住七年，到期后可申请永久性居民身份证资格。单程证的申请门槛较高，通常用于夫妻或子女团聚。2013年4月香港开始禁止父母均不是香港人的孕妇赴港产子后，门槛再次提升，因此单程证的申请人数有所下降。据香港统计处去年的数据，2014至2015年香港人口增长5.69万，其中3.78万人是持单程证定居香港的新移民。</p>\n<p><strong>权贵入港易 </strong><strong>百姓团聚难</strong></p>\n<p>单程证曾经相当值钱。公开数据显示，2004年至2011年间，持单程证赴港的新移民逾31万，其中73.7%为女性。她们通常是嫁到香港，被称为“内地新娘”。和美国的情况相似，这些“内地新娘”中有不少是“假结婚”，媒体不时有报道。</p>\n<p>然而，李小琳等中共高官亲属获得单程证显然不是通过结婚这条路。媒体披露，原河北“政法王”张越贩卖的单程证，一张可以卖到150万至200万。而且“也不是有钱就能拿到，要有很硬的关系才行”。</p>\n<p>前香港《开放》杂志编辑蔡咏梅对美国之音说，“（港人）都知道那边（指大陆）腐败，有特权的人、有钱的人可以有名额，真正需要的人比如夫妻团聚、儿女来香港和家人团聚这种，因为名额有限，反而来不了。”她还称，广东省的名额据说就不够。</p>\n<p>香港社区组织协会2014年发起的调查显示，37%的“内地新娘”在获发单程证之前，曾以双程证的身份赴港照顾子女长达10-15年。双程证主要用于大陆居民赴港旅游、探亲或从事商务、培训、留学等非公务活动，每三个月需要重签。</p>\n<p>但是香港媒体人潘小涛表示，近年没有听说因为拿不到单程证而无法团聚的人。“该团聚的香港人我想已经差不多合资格了，已经来了，”他说。然而即便如此，他也认为单程证的审批权应交还香港。</p>\n<p>他说：“全世界没有一个地方是我让谁来，你就得接受谁。这个完全是不合理的。但现在没办法，不能改。”</p>\n<p>蔡咏梅也表示，港人对于北京负责审批单程证“很有意见”。她说：“香港人就是对谁能够来完全没有决定权，他们来了，我们这边就收。这边就很有意见，现在你也知道太子党这些贪官纷纷都来到香港，拿到单程证。”她认为，这种审批制度是在向香港输送腐败。</p>\n<p>不过中国官媒人民网去年8月发表文章称，北京负责单程证审批工作的原因是“香港根本没有能力审批、限制大量的内地人口来港，正是中国内地执行单程证制度，才为香港‘守好了大门’，这是单程证由内地政府审批不能忽略的历史渊源。”</p>\n<p><strong>港人担心亲中渗透</strong></p>\n<p>蔡咏梅和潘小涛还提出了一种担心，即北京通过控制单程证的审批工作向香港输送国保、间谍或亲共人士，以逐步改变香港居民结构。</p>\n<p>蔡咏梅说：“香港还担心由他们来审批的话，他可能向香港输入那些国保、特工这样身份秘密的人，亲中的，改变整个香港居民的结构。”她认为，这些亲共人士被送到香港后，可能会影响选举的投票结果。</p>\n<p>潘小涛对这一猜测更是深信不疑，认为这种“人才输送”已经由来已久。他说，“这种事情我想在香港，他们的活动为什么渗透力那么强，在各个阶层和各个领域有那么多的渗透能力，跟这个是密不可分的。你看他们如果纯粹是派驻来香港工作的人员的话，不可能，我想他不可能，对社会的控制力不会那么强。所以我觉得，国安人员拿着单程证被派驻来香港，这一点也不意外。”</p>\n<p>香港时事评论员程翔2012年曾在港媒明报撰文《程翔：从十八大看香港地下党规模》。文章称，估计目前香港地下党的规模大约有40万人，占香港人口的百分之五。但是香港时事评论员何亮亮认为这一数字有水分，实际数字可能不到四万。</p>"
    },
    {
      "post_id": 94,
      "title": "voa 美国拟增部队、装备助伊拉克收复摩苏尔",
      "date_published": 1461008900,
      "body": "\n<p>美国国防部长卡特星期一在巴格达宣布，美国将增派2百人的部队和一些阿帕奇攻击直升机，帮助伊拉克部队作战，从伊斯兰国组织手中收复北部城市摩苏尔。</p>\n<p>卡特表示，新增派的美军部队将主要是帮助从基地出发，不断推进，包围伊拉克第二大城市的伊拉克部队实现后勤保障的顾问。他说，他们将在旅部和营部级别担任顾问。</p>\n<p>美国一名高级国防官员说，“每个人都知道伊拉克的战斗主要是争夺摩苏尔的战斗。摩苏尔是伊拉克战事的收官阶段。”</p>\n<p>伊拉克部队3月24日展开收复这个伊斯兰国盘踞城市的攻势。</p>\n<p>一位高级国防官员表示，总共将有8架阿帕奇攻击直升机被派往助战。需要美军部队飞行并维护这些飞机。去年，伊拉克官员拒绝美国提供阿帕奇直升机帮助从伊斯兰国组织手中收复拉马迪的战斗，但是这位美国官员指出，摩苏尔之战将更加艰难。这座城市2014年夏季落入伊斯兰国激进分子之手。</p>"
    },
    {
      "post_id": 93,
      "title": "voa 学个词-2528-ratchet-up",
      "date_published": 1461028703,
      "body": "\n<p>今天我们要学的词是&nbsp;ratchet up. Ratchet up&nbsp;提高，加剧。U.S. Secretary of State John Kerry said that Washington is ready to ratchet up pressure on increasingly aggressive North Korea.&nbsp;美国国务卿克里说，美国随时准备对越来越肆无忌惮的朝鲜施加更大的压力。The Obama administration has requested a quadrupling of defense spending in Central and Eastern Europe for fiscal year 2017, a move critics say would ratchet up Cold-War era tensions with Russia.&nbsp;奥巴马政府要求将2017年财政年度用于中欧东欧的国防开支翻两番，批评人士认为此举会让美俄冷战时期的紧张关系再度抬头。好的，我们今天学习的词是&nbsp;ratchet up,&nbsp;ratchet up,&nbsp;ratchet up...</p>"
    },
    {
      "post_id": 92,
      "title": "voa 厄瓜多尔地震死亡人数超过410人，三人获救",
      "date_published": 1461026772,
      "body": "\n<p>厄瓜多尔救援人员星期一在一处被上星期六强震震平的购物中心的瓦砾中救出三人，这三人已经被困超过32小时。</p>\n<p>电视转播的，在港口城市曼塔进行的引人注目的救援画面，带给厄瓜多尔人以希望，很多失踪的人可能还会被发现。星期六厄瓜多尔西北部沿海地区发生的7.8级强震造成的死亡人数已经升至410人以上。</p>\n<p>这场地震是厄瓜多尔半个多世纪以来最严重的自然灾害。地震还造成2500多人受伤，成千上万人无家可归。</p>\n<p>曼塔、波托维耶霍和旅游城市佩德纳莱斯受地震破坏最为严重，不过地震给厄瓜多尔全国各地都造成不同程度的破坏。</p>\n<p>&nbsp;</p>"
    },
    {
      "post_id": 91,
      "title": "voa 阿富汗首都发生猛烈爆炸",
      "date_published": 1461050007,
      "body": "\n<p>阿富汗首都喀布尔星期二发生一起猛烈爆炸，看来是一名自杀爆炸手所为。</p>\n<p>阿富汗总统哈尼对这次袭击进行“最强烈的”谴责，并说爆炸造成多人死伤。</p>\n<p>爆炸地点在几个政府部门和军方机构附近，几公里外的窗户被震碎，滚滚黑烟弥漫空中。目击者说，爆炸过后不久，该地区传来枪声。</p>\n<p>塔利班宣称对星期二的爆炸袭击负责。自美国领导的联军于2001年推翻塔利班政权以来，塔利班一直从事针对得到西方支持的阿富汗政府的叛乱活动。</p>\n<p>塔利班上星期宣称，将展开春季攻势。</p>"
    },
    {
      "post_id": 90,
      "title": "感谢 dadalang 推荐的全文阅读功能",
      "date_published": 1460953142.145,
      "body": "dadalang 向本站推荐全文阅读功能，使用后效果很好。在此向大家推荐他的个人网站 http://127.0.0.1:43110/1N7GGo4WtYaxwQ9hmmr4mieL3TcafwsbRK/"
    },
    {
      "post_id": 89,
      "title": "VOA 陈冲谈文革和电影审查",
      "date_published": 1460936652.808,
      "body": "洛杉矶—\n\n美籍华裔著名演员陈冲(Joan Chen)星期六(4月16日)在于洛杉矶举行的第26届“百人会”上阐述了自己的成长经历以及作为华裔演员和艺术家在美国的心路历程。期间，陈冲还谈到了中国的“文化大革命”对自己的影响，以及她对电影审查制度兼华裔如何在好莱坞文化中改善形象的看法。\n\n童年最清晰的记忆是外公自杀身亡\n\n陈冲在美国华裔精英组织“百人会”2016年度会议上发表演说期间，首先谈到了自己的成长经历。她说，文化大革命改变了她们一家的生活，而她童年最清晰的记忆是外公自杀身亡这一事件。\n\n陈冲说:“我五岁的时候，文革开始，我的世界颠倒了。我的祖父母和外祖父母因为在欧美学习过，被指责为外国间谍和反革命。我的外公是著名的药理学家，非常骄傲的一个人，因为不愿意承认自己从没有犯过的罪行，决定自己结束自己的生命。“\n\n文革如火如荼的时候，姥姥用偷偷留下的“灵格风”唱片教她英文，平衡了她的教育，让她知道除了文革的单调外，生活还有其他的形式。\n\n姥姥的外语教育还让她考上了当时特别难考的上海外国语学院(现在的上海外国语大学）。\n\n因为幸运没有“上山下乡”\n\n1979年，当时还在上外读书的陈冲，由于在谢晋执导的电影《青春》中扮演哑妹而崭露头角，成为家喻户晓的明星。\n\n陈冲说，她是因为幸运才避免了当时城市年轻人共同面临的“上山下乡”的命运；她还说，哥哥因为父亲的安排，加上他自己的努力，成为了职业运动员，也避免了“上山下乡”。\n\n执导电影谈上山下乡\n\n然而，周边同学、朋友以及邻居纷纷“上山下乡”的故事，却一直萦绕着她，并由此而催生了1998年她首部执导的电影《天浴》。\n\n陈冲说：“《天浴》的故事讲述的是我们这一代人对‘文革’的狂热，我们的牺牲以及最终的幻灭。”\n\n但是，因为政治原因和情色镜头，《天浴》在中国大陆被禁演，甚至影片的拍摄也是偷偷的、仿佛“打游击”一样进行的。这部电影上演后获得广泛好评，并在台湾获得了最佳剧情片、最佳导演与最佳男女主角四大奖项。\n\n电影审查扼杀艺术创造\n\n身为“百人会”一员的陈冲在2016年会上发表演讲期间，还谈到了电影审查制度和艺术家的创造力。她说，《天浴》让她骄傲，因为她在其中追随了个人的想象力，而她也因此而付出了沉重的代价。《天浴》公演后，她被中国政府禁止三年内不准拍戏。\n\n关于电影审查，陈冲说：“肯尼迪总统在纪念美国诗人罗伯特.佛罗斯特时说，‘如果艺术能够滋养我们的文化之根，那么社会必须给艺术家以自由，让他能够追随他内心的想象力，并让这一想象力把他带到他想去的任何地方。我们要永远记住，艺术不是宣传，她是一种真理。……”\n\n陈冲在接受美国之音采访时，承认这个话题敏感，但是坚持说，任何形式的审查都不利于艺术：“每个艺术家都希望有自己的声音。每个市场都有限制，在美国，是制片人和公司对你提出各种各样的要求，如果不是政治要求的话。我觉得任何一种形式的审查，都不利于艺术。“\n影星陈冲影星陈冲\n\n​好莱坞华裔应该撰写自己的故事\n\n谈到好莱坞电影中华裔人士单一和单调的形象刻画，陈冲并没有简单将之归结为好莱坞对华裔的歧视。“它不是真的在那里歧视你，它不知道怎么用你。它不知道怎么为你写，你必须自己创造题材。有很多很有意思的题材，但是得有人写。……得有自己的作者。“\n\n陈冲说，好莱坞涉及到华裔的一些电影，如《喜福会》、《面子》、《初来乍到》、《色戒》和《卧虎藏龙》、《末代皇帝》等，都是好电影，而其中所描述的华裔或是亚裔的形象就很丰满, 故事也非常有人性。"
    },
    {
      "post_id": 88,
      "title": "VOA 何清涟:陈葵女士的到来与中文Twitter的命运",
      "date_published": 1460936506.098,
      "body": "\n何清涟\n\n编者按：这是何清涟为美国之音撰写的评论文章。这篇特约评论不代表美国之音的观点。转载者请注明来自美国之音或者VOA。\n\n自北京时间4月16日开始，Twitter（推特）中文圈为一位名叫陈葵的女士沸腾，并且迅速产生了一封白宫请愿信，反对她任Twitter大中华地区CEO。\n\n陈葵女士并不简单的政治背景\n\n4月16日，BBC在《推特任命首位大中华区掌门人》中对陈葵做了介绍：个人社交网站领英（Linkedin）上的公开资料显示，目前陈的工作地点为香港。在担任推特这一职位前，毕业于北方交通大学计算机科学专业的陈葵一直在中国大陆任职。她曾是微软（Microsoft）和思科（Cisco）驻北京或上海的高管。她还曾于1999年-2005年在北京为一家名为“Jinchen”的合资公司工作，陈葵的个人简历上称，这是一家“由美国国际联合电脑公司(Computer Associates International)与中国公安部（ Ministry of Public Security of China）组建的合资公司，主要业务包括信息安全服务等”。中国公安部是对推特等互联网社交网站进行严格审查的中国机构。\n\n国内一篇2004年的《陈葵：做个IT徐娘蛮好》（《数字商业时代》2004年12月）中对陈葵背景的介绍，补足了BBC介绍的不足部分。该文介绍了陈葵从军队到外企的职业生涯，2004年，她是冠群金辰的女当家，是IT界为数不多的女CEO之一。此前，她在军队里呆过七年，经历过DEC、康柏、3COM等外企公司直到2004年的冠群金辰，“1999年底，陈葵从3COM公司被猎头‘挖’到冠群金辰。就职以来，她带领冠群金辰进行了前瞻性的战略调整，成功完成了从防病毒厂商向全面网络安全解决方案及安全服务提供商的转型，公司销售额成倍增长”，“前些时候，陈葵被国家有关机构评为对中国安全产业有特殊贡献的人，获得这个奖项的人很少，这无疑是对陈葵和她带领的冠群金辰付出努力的一种肯定。所以，陈葵把这个奖看得很重。”\n\n这段话里面的几个关键词很重要：“防病毒厂商”、“网络安全”、“被国家有关机构评为对中国安全产业有特殊贡献的人”，熟悉中国政治的都知道，中国的防病毒、网络安全是与屏蔽信息的防火墙、互联网管控有关的技术用语，而陈葵女士因其表现不俗，还获得只有极少人获得的国家奖项。而中国军队是网络战的主力，比如61398部队，集中了不少优秀的IT业人才，这已由中国对美国的网络战所证明。\n\nTwitter中文用户的担忧并非杞人忧天\n\n而中文Twitter是个什么所在？是中文社交媒体当中极少不受中共控制的言论自由之地，随着Facebook（脸书）扎克伯格访华输诚，Twitter中国几乎成了爱好自由的中国人唯一可去的社交媒体。在伊朗大选、中东北非2011年阿拉伯之春后，Twitter革命、Facebook革命在英文媒体上名噪一时。Twitter中文圈也曾因一个“秘密树洞”的推号发出中国将于3月20日（星期天）下午2时在中国北京、上海、成都、广州等24个城市发动茉莉花革命的消息，让中国政府紧张了大半年，每逢周末就在这些城市戒备森严，也因此，这两家社交媒体被限制进入中国。\n\n因为Twitter不删除内容，不封号，众中文推友称之为“永不打烊的自由小酒馆”。尽管不少五毛、网特混迹其中，每天在上面混淆视听，但有点经验的Twitter中文用户能够看穿这些鬼把戏，也知道这是为了言论自由不得不付出的代价。\n\n当扎克伯格向中共频频晃动橄榄枝，Twitter也爆出要在大中华地区设分公司的消息，但中文Twitter用户们还是怀抱希望，一是希望这事不要成为现实，二是希望就算设，也有个底线。如今大家在忐忑不安中等待了一年多，这只鞋子终于落地，而且是个有中国军队背景的IT女士陈葵，难怪Twitter中文圈沸腾起来。\n\n美国司法有无罪推定原则，依据这一原则，陈葵女士刚上任，还没有对Twitter采取什么管控措施，中文Twitter用户是不是过份敏感了？\n\n从大量已经发生的事实出发，中文Twitter用户并非杞人忧天。全世界都知道中国政府为了驯服互联网这匹野马，投入了天文数字般的巨资。外国公司进入中国市场，为了生存而无法逃脱两大定律：第一，被迫顺应中国的制度环境（包括向中国官员大量行贿）；第二，放弃在本土必须坚守的政治原则与道德律条，顺从中国政府的各种有悖人权原则的要求。前一生存定律，不少美国公司都这样做，其中部分因事情泄露而受到美国司法部门的制裁，因为美国有反海外贿赂法。第二条，则主要发生在高科技公司身上。早在2001年，Greg Walton就发表了一篇“金盾工程：庞大的中国电讯监控系统”（China’s Golden Shield：Corporations and the Development of Surveillance Technology in the People’s Republic of China），以大量事实揭露了众多高科技跨国公司为了竞争中国业务，如何帮助中国政府建立“金盾工程”，以用来监视、窃听或者联机监听。该工程部份是数据库，部份是监视网路，专注于下列安防范围：“出入口监控、反黑客入侵、通信安全、电子计算机配件和软件、解密和加密、电子商业安全、外联网和内联网保安、防火墙、网路通讯、网路安全和管理、安全操作、智能卡保安、系统安全、病毒察觉、信息科技有关服务以及其它”。\n\n美国高科技公司与中国政府合作伤害人权的先例\n\n由于高科技公司与中国政府的合作，2006年1月中旬，美国国会传召美国四大高科技巨头思科、微软、雅虎与Google（谷歌）至国会，针对它们遵守中国审查法律的做法进行质询――这四大公司曾倨傲地拒绝了1月上旬国会的第一次传召，此举大大激怒了美国社会各界人士，针对这四大公司的尖锐批评如潮水一般涌来，不少国会议员将这四大公司在中国的行为与纳粹组织在组织大屠杀过程中利用IBM技术相提并论，舆论批评它们“热情地自愿充当中国政府的审查队伍”。在巨大的社会压力之下，这四大网络公司被迫采取守势，表示该问题对这些公司而言太大了，它们无法依靠自身力量去解决，需要美国政府扮演领导角色。\n\n其中，最值得记取的是2005年雅虎向中国政府提供资料导致中国记者师涛等被捕并判以十年刑期的恶性事件。此事被揭露之后，雅虎遭受国际社会尤其是美国各界的广泛批评，雅虎不得不于2007年11月在一次美国国会听证会上，由联合创始人杨致远向师涛以及另一位因类似事件被捕的王小宁的家人道歉，并在不久之后通过协议了结了由劳改基金会代理受害人家属提起的诉讼。据说雅虎支付了1700万美元人道援助资金，这笔资金由雅虎代表受害人及其家属捐给由劳改基金会等运作的雅虎人权基金会。\n\n2010年1月13日，Google宣布无法忍受对搜索内容的限制将退出中国市场。在这个“缺乏英雄的年代”，这一“说不”，顿时使Google成了中国万众欢呼的英雄。自那之后，谷歌再也无法回到中国市场。\n\nTwitter当然会掌握大量用户信息。鉴于以往美国高科技公司向中国弯腰的事情不断发生，人们很难期待再出现第二家Google，而陈葵女士以前的军人身份，以及海外华人间谍案频发这类事实，令Twitter中文用户对未来的担心完全有道理。\n\n对于Twitter公司来说，也许扩大在大中华地区的业务是种商业考虑，但鉴于Twitter在社交传媒时代的重要作用，该公司事实上还担负着坚持与守护互联网自由的责任，它所在的美国，一向被世界看作民主的灯塔，美国政府也责无旁贷地担当起世界民主自由守护者的责任，因此，我希望美国国会召开一次相关听证会，就此请各专业人士及中国的异议人士与会，就海内外华人对陈葵担任Twitter大中华地区CEO一职公开听证，作出裁决。"
    },
    {
      "post_id": 87,
      "title": "DW 朝鲜劳工出国赚外汇遭剥削",
      "date_published": 1460936477.678,
      "body": "\n\n数名曾在海外打工的朝鲜人诉说了自己在国外工作时受到的血汗剥削及艰辛。尽管在国外讨生活并不容易，他们仍认为“总比留在朝鲜好”。\nNordkorea Zwangsarbeiter im Ausland\n\n42岁的李松姬2000年初起曾经在中国大连的一家朝鲜餐厅工作\n\n(德国之声中文网）在朝鲜人心目中，赴海外打工象征着更好的社会地位，不少人通过贿赂和裙带关系取得这样的机会。42岁的李松姬（音）2000年初起曾经在中国大连的一家朝鲜餐厅工作，如今居住在韩国。她表示，朝鲜的女性憧憬到海外担任女服务员。\n\n李松姬以及其他三名朝鲜人的故事，或许能反映出成千上万被送往海外赚取外汇的朝鲜人的悲惨境遇。人权组织对朝鲜民众在国内人权遭践踏的情形予以谴责，并形容这些在海外打工的朝鲜人是现代版奴工。\n\n李松姬原本计划通过海外工作经验提升社会地位以觅得良婿。另外三名朝鲜男性则希望在一般为期三年的海外工作结束后，购买电视、卡式收录机和冰箱。\n\n90年代末曾在科威特一处建筑工地工作的林日（音）表示，他见过从国外打工返国的朝鲜人抽着高档香烟，出门喝酒。\"对一般人而言，这样的东西遥不可及。\"\nNordkorea Zwangsarbeiter im Ausland\n\n朝鲜人林日曾在科威特作木工，但从未领到承诺给他的每月120美元工资\n\n多名韩国专家及活动分子在访问了近年曾在海外打工的朝鲜劳工或脱北者后得出结论，许多在海外工作的朝鲜人确实与林日持相同观点。\n\n据脱北者们透露，普通朝鲜劳工的月薪不到一美金。许多朝鲜家庭通过非法市场赚钱。\n\n朝鲜政府的生存工具\n\n韩国峨山政策研究院的朝鲜问题专家Go Myong-Hyun表示，\"从我们的观点看来，这是剥削劳工。但对他们而言，出国是特殊利益。他们将其视为摆脱在家乡恶劣生活的机会。问题是朝鲜政府正利用这样的想法。\"\n\n朝鲜当局否认其劳工受到虐待，并称国际的批评是试图破坏其体制的阴谋。韩国情报部门表示，目前有5万至6万朝鲜人在全球约50个国家工作，其中多数人在俄罗斯及中国。部分专家相信，在海外打工的朝鲜人数更高。位于首尔的非营利机构朝鲜战略中心在2012年发表的一份报告指出，朝鲜海外劳工每年为国库赚进1.5亿至2.4亿美元的外汇。\n\n专家一致认为，长期遭受国际制裁的朝鲜正借由扩大劳工出口增加合法外汇收入。多数人被中国的工厂和餐厅雇用，或是在俄罗斯伐木场和建筑工地工作；其他人则在中东参加建筑工程，或在非洲建设大型政治塑像、教授跆拳道或提供健康护理。峨山政策研究院估计，这些人月收入介于120至150美元之间。\nChina Okryugwan Restaurant in Peking\n\n朝鲜在海外经营餐厅赚取外汇\n\n朝鲜通常会派遣生活相对富裕、忠诚的公民出国工作，这样的群体被认为较不易受外国文化影响。朝鲜专家表示，被送出国的多数是已婚男性，其伴侣必须待在国内，以减少其脱北的可能性。\n\n李松姬原本是语文教师，其父以15000朝鲜圆（约合70美金）贿赂当地官员，为她谋得服务员的工作。林日则用20瓶高档酒和30包香烟行贿。1995年至1999年在西伯利亚担任卡车司机的金锡俊（音）表示，他是透过亲戚的牵线取得工作，当他得知能出国时喜出望外，\"那可能是我一生最美好的时刻\"。\n\n然而，多数朝鲜劳工在海外的实际经历都相当悲惨黯淡。\n\n日以继夜的劳动\n\n李松姬表示，她每月只有一天休假，在接获母亲死讯时也必须工作。朝鲜秘密警察监视着女服务员的行动，私藏小费便会挨打。\"有时客人会碰触我们的身体，但我们不能拒绝，因为我们的任务就是尽可能讨好他们，让他们掏出更多钱。当客人为我们斟酒，我们必须一饮而尽，但不能喝醉，否则会被批评对党不忠诚。\" 她回忆称，一些女同事因为无法达到业绩，不得不陪客人上酒店发生关系，获取约650元人民币的报酬。\n\n林日则在科威特作了数月木工。他表示虽然在四周围布满铁丝网的工地从清晨工作至半夜，但未领到承诺给他的每月120美元工资。他在得知附近的孟加拉国和印尼工人每月至少有450美元收入时，心中气愤难平。\n\n另一名曾在俄罗斯伐木场工作的李永浩（音）则任卡车司机。他经常每日工作12至14小时，但从未思考过自己的工作条件。\"奴工？我当时并没有真的想过这样的事。我只想着每月能赚多少钱。\"\nNordkorea Zwangsarbeiter im Ausland\n\n曾在俄罗斯伐木场工作的李永浩表示，他经常每日工作12至14小时\n\n被西伯利亚另一处伐木场雇用的金锡俊与约900名朝鲜人一起工作。金锡俊称，在任职期间曾见到数十名工人死亡，其中许多人是被倾倒的树木压死。\n\n上述四人最后都在海外工作时脱北。逃到韩国的李松姬表示：\"我不想回到一个落后国家。\"李松姬在脱北后得知，朝鲜当局强迫她的亲戚搬迁到偏远地区或实施更严厉的监视，以对她的叛逃进行报复。\n\n其他三名受访的朝鲜男性则对家人的命运一无所知。金锡俊表示，虽然\"在尝到自由的滋味后\"他选择不再回到朝鲜，但他仍思念在朝鲜的家人，包括在他离家时才刚出生不久的女儿。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 86,
      "title": "DW 缅甸大赦政治犯",
      "date_published": 1460936441.756,
      "body": "\n\n缅甸新总统吴廷觉在周日庆祝佛教新年的全国电视演讲中宣布大赦80多名政治犯。他同时表示还将持续释放更多政治犯、活动人士和学生。\nMyanmar Freilassung politischer Gefangener\n\n（德国之声中文网）缅甸总统吴廷觉（Htin Kyaw)在该国佛教新年第一天宣布大赦83名政治犯，以在新的一年里推动该国的民族和解。在新年演讲中，这位全国民主联盟（NLD）政治家还表达了释放更多政治犯的决心。他说：\"我们将继续努力，释放那些因政治议题而面对审讯的政治犯、活动人士和学生。\"\n\n尚不清楚的是，此次获得大赦的囚犯是否真的都是政治犯。据来自亲属的消息，获得大赦的人中有5名2014年被判10年监禁的记者。他们先前曾报道过一个化学武器工厂的修建。\nMyanmar Vereidigung Regierung - Htin Kyaw & Thein Sein\n\n3月30日，缅甸军政府统治结束后的首届民选政府宣誓就职\n\n估计仍有数百名政治犯在押\n\n据警方消息，自三月底新政府就任后，已有近200名政治活跃人士获释，其中包括数十名因参与学生抗议而被关押一年多的人。缅甸监狱目前还关押着多少活跃人士，外界尚不清楚。观察家估计仍有数百名活跃人士在狱中。\n\n吴廷觉总统是诺贝尔和平奖得主、民主领袖昂山素季的亲密助手。因缅甸宪法中的一个条款规定，亲人拥有外国籍者无资格担任总统，身为全国民主联盟主席的昂山素季不能担任总统。不过，除任外长外，昂山素季还任教育、电力及能源部部长，并担任\"国务顾问\"，是吴廷觉身后真正的掌权者。在被任命为\"国务顾问\"，昂山素季发表声明，宣布把释放所有政治犯作为政府的首要任务。在缅甸军政府的统治下，昂山素季被软禁家中长达15年。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 85,
      "title": "DW 常州外国语学校500学生因新址污染患病",
      "date_published": 1460936407.419,
      "body": "\n\n据中国央视报道，江苏常州外国语学校自去年9月搬到新址后，近500名学生先后出现皮炎、湿疹、支气管炎、白细胞减少等异常症状，个别的还被查出了淋巴癌、白血病等。该校附近曾是三家化工厂。\nBodenverschmutzung in China\n\n土壤污染是中国一大问题\n\n（德国之声中文网）本周日（4月17日），中国诸多媒体转载了央视新闻有关江苏常州外国语学校搬新址后近500名学生患病，个别查出淋巴癌的报道。报道称，学校北边的一片工地曾是三家化工厂，其中最大一家名叫常隆化工有限公司。\"一名在常隆化工工作了30多年的老员工说，在他记载的生产日志上，像克百威、灭多威、异丙威、氰基萘酚这样的都属于是剧毒类产品。而厂里职工有时候为了省事，不光将有毒废水直接排出厂外，还将危险废物偷偷埋到了地下，对环境带来了很大隐患。\"\n\n报道还称，一份项目环境影响报告指出，这片地块土壤、地下水里以氯苯、四氯化碳等有机污染物为主，重金属污染物普遍严重超标。\"其中污染最重的是氯苯，它在地下水和土壤中的浓度超标达94799倍和78899倍，四氯化碳浓度超标也有22699倍，其它的二氯苯、三氯甲烷、二甲苯总和高锰酸盐指数超标也有数千倍之多。\"\n\n2014年12月，常隆化工旗下的6家企业因倾倒废酸污染河水，被江苏省法院判罚1.6亿多元的罚款。但当地教育部门则称已做过相应的环评，\"这个地块的土壤，包括检测都是达标的\"。央视报道说，记者经过调查发现，当地官员认为符合规范的评估报告其实存在严重瑕疵--\"环评报告中只考虑了氨氮、重金属、pH值等常规的污染物指标，却没有考虑到农药的成分。\"\n\n家长数月前就与学校交涉\n\n数月前，常州外国语学校新校区附近的\"毒地\"修复问题就引起媒体关注。常州外国语学校与处于修复工程中的\"毒地\"只有一路之隔。去年12月，常外师生们经常闻到刺激性气味，不少学生出现了身体不适的症状，去医院后的检查结果主要为三个症状：甲状腺结节、双侧和全身淋巴肿大、白细胞普遍偏低。家长们质疑学校选址不当并开始与校方交涉。今年1月，常外作出过暂时停课的决定。常州教育官方称，市区两级将采取有力措施确保常外环境空气质量。2月下旬，有报道称，在常外校方与家长仍在在商討检测方案时，学校就通知学生回校报道、复课，还于几天后拿出了一份各项检测指标都达标的检测报告。\n\n据报道，常州外国语学校有初、高中部58个班级，约 2800名师生员工。\n\n一位网名为鱼做de云的网友在微博中说，\"看了常州外国语学校的新闻心里难受极了，致癌物超标近十万倍是什么概念…那些生病的小孩做错了什么？央视新闻的标题是\"不该建的学校\"，那环境就可以这样污染吗？唉。还有不久前的天津爆炸案…生活在一个没有安全感的地方，即使不作恶也可能随时遭殃！ \"\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 84,
      "title": "DW 香港特首之女行李事件引发抗议",
      "date_published": 1460936377.638,
      "body": "\n\n上千人在香港举行示威集会， 抗议特首女儿涉嫌违反机场有关行李的规定。这是受北京支持的梁振英出任香港特首以来，又一度引发争议。目前他的民意支持率越来越低。\nHong Kong Leung Chun-ying Wahlgesetz Reform\n\n上千人在香港举行示威集会， 抗议特首女儿涉嫌违反机场有关行李的规定。这是受北京支持的梁振英出任香港特首以来，又一度引发争议。目前他的民意支持率越来越低。\n\n抗议者当中包括空勤人员，飞行员以及民权活跃人士。示威活动在香港机场的抵港大厅举行，示威者指责梁振英家人获得了特殊照顾。\n\n示威者称，梁振英女儿梁颂昕3月底在机场离境时将手提行李遗留在机场禁区外，香港机管局最后容许将行李送入禁区。而据香港当地媒体称，行李被送入禁区前，梁振英曾致电机场官员。梁振英本人承认曾打过电话，但否认曾对有关官员施压。\nHongkong Protestmarsch 09.11.2014\n\n梁振英上任以来已引发多次抗议\n\n抗议者称，梁振英此举属于滥用职权，并对航空安全造成威胁。\n\n香港空乘人员联合会成员，也是本次示威活动组织者的一位吴姓女士对法新社表示：\"我们坚决反对特权。我们对此次事件非常愤怒。我们决不会保持沉默。\"\n\n示威者的横幅上写着\"在机场安全问题上决不容许有任何妥协。\"\"飞行安全必须百分之百。\"历时三个小时的示威活动最后以示威者绕行机场一周结束。很多旅行者用智能手机拍摄下了示威的场面。\n\n香港主权1997年在\"一国两制\"原则下从英国移交中国。中方承诺，香港的自由五十年不变。但近来越来越多的人担心，由于北京的幕后操控，香港的自由度已经在受到影响。\n\n一名机场发言人表示，梁振英女儿的行李受到了常规安检，飞行安全并没有受到影响。\n\n同1997年以后的历届香港领导人一样，梁振英也是通过一个亲北京精英占据多数的委员会选举产生的。梁出任特首后，不断引发各种争议。比如2012年的豪宅争议以及2014年有关就任前收取澳大利亚巨额酬金的问题。梁振英本人对各类指控一律予以坚决否认。"
    },
    {
      "post_id": 83,
      "title": "BBC 香港空勤人员抗议特首女儿“行李特权”",
      "date_published": 1460936319.146,
      "body": "\n\n    2016年 4月 17日\n\n分享\nImage copyright Getty\n\n香港空勤人员周日（4月17日）在香港机场举行静坐示威，抗议特首梁振英女儿梁颂昕日前被质疑因行李问题滥用特权。\n\n据报道，梁颂昕3月底在机场离境时遗留手提行李在机场禁区外。她随后涉嫌“向机场职员施压”，香港机管局最后容许将行李“直送禁区”。\n\n香港行政长官梁振英在此事曝光后曾发表声明表示，整个事件中，他与机场管理局人员并无任何接触，更谈不上施压。\n\n据静坐抗议组织者表示，周日参加静坐抗议的香港空勤人员和市民约两千人。\n\n多名香港立法会议员也参加抗议，还有前立法会议员表示，香港机场方面至今无人出面交代事件过程，因此质疑有人在特权阴影下不敢讲真话。\n\n周日的静坐抗议还引发冲突。\n\n10多名反对集会者到场示威，批评活动由香港职工会联盟煽动，指参加者小事变大，让香港成为国际小丑。两批人士数度口角，场面一度混乱。\n\n香港政府发言人就在香港国际机场举行的静坐活动回应称：政府了解到社会人士对航空保安的关注，“我们必须重申政府一直非常重视香港国际机场的保安。香港国际机场的航空保安措施均符合国际民航组织的相关规定。”\n\n该发言人还强调：根据国际民航组织的相关规定，所有人士（包括乘客、职员及机组人员），以及他们的手提和寄舱行李，都必须先经过保安检查，才能登上飞机，以保障航空安全。\n\n发言人还透露，事发在3月27至28日，“有关行李的物主获得确认，行李在进入离境禁区前，亦经过保安检查。事件中，机场和航机的安全没有受到影响”。\n\n该发言人还承诺，机场管理局将就此事件向政府提交报告。　“政府评估报告后，如有需要，会作出适当的跟进。”\n\n香港媒体引述空勤人员总工会总干事吴敏儿表示，政府官员未妥善交代整起事件，“今天的集会只是第一步”。\n\n（撰稿/责编：罗玲）"
    },
    {
      "post_id": 82,
      "title": "BBC 日本九州地震：“由衷感谢”台湾的慰问",
      "date_published": 1460936285.139,
      "body": "\n\n    2016年 4月 17日\n\n分享\nImage copyright AP\nImage caption 日本自卫队用直升机将困在山区的平民送出来，自卫队派遣了两万多人参加救灾。\n\n日本官房长官菅义伟表示感谢台湾的慰问和提议支援救灾，但是目前日本只接受驻日美军所提供的援助。\n\n在周日（17日）夜间的记者会上，菅义伟针对有关台湾表示将向日本捐款和提供救灾协助的问题回答说从台湾“外交政府等方面得到了许多的慰问，日本政府想要表达由衷的感谢”。\n\n救援作业\n\n但是菅义伟也说，虽然有数个国家表示愿意协助救灾，不过目前日本只接受驻日美军所提供的援助。\n\n他说，未来将视个别灾区的状况再作决定；根据最新的消息，这次的日本熊本地震已经造成了42人死亡、疏散的人数则高达至少11万人。\n\n台湾在地震发生之后，宣布捐款1000万日元，后来台湾总统马英九指示再提供50万美元的款项。\n\n即将接任总统的蔡英文则宣布捐出一百万元新台币（约3万余美元）、高雄、台北以及台中的市长也宣布捐出一个月的薪资，高雄还开设了帐户方便民众捐款。\n\n灾区物资\n\n在周日下午，日本政府第一批援助物资已经抵达灾区，海上保安厅也派出舰艇前往灾区附近水域协助救灾。\n\n日本政府表示，目前已经准备了90份的餐食供灾民和救援人员使用，日本的通信公司也在当地搭起临时设施，保持通信的畅通并且提供避难居民手机充电的服务。\n\n日本的媒体报道说，从14日到18日零时，地震灾区熊本和大分两县已经出现了至少492次的余震。\n\n有关部门说，担心未来几天还会出现比较强烈的震动，此外当地天气转恶，可能会出现大雨的天气，提高了灾区出现泥石流的可能性。\n\n（撰稿/责编：威克）"
    },
    {
      "post_id": 81,
      "title": "BBC 日本九州地震：美军直升机准备投入救灾",
      "date_published": 1460936234.546,
      "body": "\n\n    2016年 4月 17日\n\n分享\nImage copyright Reuters\nImage caption 美军鱼鹰偏转翼直升机的飞行速度较一般的直升机快速许多\n\n隶属冲绳普天间基地的美军鱼鹰偏转翼直升机已经抵达日本岩口县的岩国基地，准备投入14日发生的九州接连地震救灾工作。\n\n隶属于美国海军的4架鱼鹰式直升机是17日上午从菲律宾出发，经由普天间基地，在日本时间下午6时30分左右抵达日本本州南端的岩国基地。\n\n预计这4架飞机将用来载运前往灾区的日本自卫队人员还有物资，驻日美军指挥官约翰多兰表示，美军将与日方“紧密合作”、提供支援。\n\n日本防卫大臣中谷元周日表示，美军的鱼鹰直升机非常适合用于大规模灾害之后的救灾行动，除了机动力强之外，运输能力也大。\n\n中谷元说，在道路受损无法通行的时候，如果要及早将物资送到灾民手上，能够垂直起降的鱼鹰式直升机是必要的工具。\n\n另外中谷元说，日本自卫队也将从北海道调派一架C-130型运输机和4两救灾车辆，预定18日（周一）进驻熊本机场担任运输的工作。\n\n目前日本九州接连发生的大地震，已经造成42人死亡，在重灾区南阿苏村，目前警方和自卫队上百人在一处发生土石流塌方的地点寻找10名失去联络的村民。\n\n外界通往灾区的道路仍然受阻，不过部分距离灾区较远、受损较轻、原先停驶的铁路交通和高速铁路新干线有望在周一经过完整检查之后，逐步恢复行驶。\n\n（撰稿/责编：威克）"
    },
    {
      "post_id": 80,
      "title": "RFI 日本地震中被困的20名中国游客获救",
      "date_published": 1460846015.314,
      "body": "新华社东京消息，中国驻福冈总领馆16日证实，20名受困于日本地震灾区的中国游客已被全部救出。\n \n\n中新社东京消息：在地处熊本县阿苏山区的一间温泉旅馆“清风庄”，有一个20人组成的中国旅游团被困。中国驻福冈总领馆人士告知，已经设法与团内人员取得联系，得知因地震造成周边道路阻断，该旅馆处在与外界交通隔绝的状态。不过团内人员都未因此次地震而受伤。目前情况是，虽可选择经山区小径步行脱身，但旅馆方面考虑到游客多为60岁以上的老人，怕在途中因强烈余震及次生灾害而遭遇不测，决定仍暂留原地等候救援。\n\n另据新华社东京4月16日消息，中国驻福冈总领馆16日证实，20名受困于日本地震灾区的中国游客已被全部救出。\n据了解，16日凌晨熊本县发生强烈地震后，一个20人组成的中国旅游团被困当地一家温泉旅馆。总领馆得知后，紧急和日本有关方面取得联系。经协调，日方用直升机将20名受困游客救出。\n"
    },
    {
      "post_id": 79,
      "title": "RFI 西班牙工业部长涉巴拿马文件辞职",
      "date_published": 1460845724.896,
      "body": "西班牙工业部长索里亚（Jose Munuel　Siria）因在巴拿马文件中曝光，昨天周五宣布辞职，并决定退出政界。但他否认自己有任何不当行为。他表示选择离开政府是不想给这届政府造成危害。此事发生在距离立法大选3个月之际，让西班牙保守党政府十分尴尬。\n\n今年58岁的若泽•曼努埃尔•索里亚，是西班牙工业，能源，旅游部长。他的名字出现在最近曝光的巴拿马冯塞卡律师事务所的文件名单上，该事务所专门办理在避税天堂成立空壳公司。\n\n一周以来，这位西班牙政府的重要部长一直否认自己与避税天堂有任何瓜葛。但西班牙网络报《机密》（El Confidencial）指出，西班牙从本周一开始不断公布大量巴拿马文件信息，让人感到工业部长索里亚掩盖了自己与设在避税天堂巴哈马和新泽西一些公司的关系。\n\n在西班牙工业能源旅游部长索里亚宣布辞职之前，被巴拿马文件曝光的冰岛总理西格蒙杜尔•贡劳格松（Sigmundur Gunnlaugsson）4月6日在街头抗议的压力下宣布辞职。\n\n索里亚周五在宣布辞去西班牙工业部长时还表示，他从即日起放弃一切政治活动。索里亚宣布辞职后，一直要求他辞职的西班牙反对党社会党领导人桑切斯（Pedro Sanchez ）和中右翼公民党领导人Albert-Rivera立刻要求首相马里亚诺•拉霍伊向议会解释“索里亚案”。\n"
    },
    {
      "post_id": 78,
      "title": "RFI 粤维权律师妄议姐夫被指“公然侮辱他人”遭带走",
      "date_published": 1460845273.079,
      "body": "广东律师葛永喜由于在网上传播巴拿马泄密文件的内容，15日凌晨被警察带走。中国维权律师关注组证实，葛永喜被公安以“公然侮辱他人”为由传唤24小时。\n\n关注组报道指，葛永喜在昨日于微信发布与中国领导人及巴拿马文件有关的改图，图中3名中国领导人邓小平、江泽民和习近平下半身浸在水中，配以文字“巴拿马的河水，真的好深！”习近平在这张改图中说：“不怕，我有姐夫。”\n\n报道指，15日近凌晨时份，葛永喜发出求助消息：“公安局突然上门，不知道什么目的，请关注。”其家人透露，有5名便衣公安上门，称其发布的帖子于网上影响极大，问话后未作出任何手续就将其扣押。\n\n名为“巴拿马的河水”的改图中，邓小平、江泽民和习近平三个人光着上半身泡在水中，邓小平说：“真的好深！”，江泽民惊恐地说：“好易浸死架（好容易浸死人）”，习近平则好整以暇说：“唔（不）怕，我有姐夫。”改图的配文是：“摸着石头原来是过巴拿马河！”\n\n当局一直在网上严密跟踪有关巴拿马文件的信息。这亦是中国首名民众因巴拿马文件被当局带走。报道称，葛永喜的朋友之后一直无法联系他，葛目前被扣留在佛山盐步派出所。\n\n网上消息指，成都网民“民主大木”不久前也因为网上妄议姐夫和小舅子，而被通知到成都苏坡派出所去一趟，他的朋友都要求大家关注事件。\n\n葛永喜毕业于安徽大学，现在是广东安国律师事务所律师，是一名基督徒，他曾是“广州三君子”唐荆陵的代理律师，曾代理过或者介入很多知名维权案件，去年曾遭遇中共当局边控禁止出境。\n\n自巴拿马泄密事件后，大陆多次采取行动打压舆论及消息，官方媒体则发表评论文章质疑文件真伪，而大陆媒体报道巴拿马文件时，也没有提到涉及中国的部份。而在社交网站，有关巴拿马文件的讨论亦被删除，甚至连“姐夫”一词，也因为习近平的姐夫邓家贵被巴拿马文件点名，而都在微博被禁。\n"
    },
    {
      "post_id": 77,
      "title": "RFI 李克强与北大学生用餐食物疑似“特供”专车运送",
      "date_published": 1460845246.235,
      "body": "中国国务院总理李克强14日和15日一连两日走访北京大学和清华大学，并与师生们交流，但有网友踢爆扮演亲民的李克强，在北大农园饭堂与学生用餐时，饭菜乃是专车运送的“特供”，专车停在校园时，还有多个穿着黑色西装的安全人员前后左右保护。\n\n网民“此微博已被作者删除了”在微博帖文称：“旁（朋）友们，你们不久将会看到一个‘总理到农园食堂和学生共进晚餐’的新闻，他进的膳呢，是这个小卡车专程运来的晚餐，学生呢，黑衣人对我说，‘名单上有名字吗，没有，那无关人员不得入内’。”\n\n文字还附上了一张图片，一辆卡车横摆在路上，前后左右有数个“黑衣人”保护。\n\n另一网民“大散关”挖苦说：“莘莘学子，阻于黄绳白线，遥望小车横卧农园，校尉力士环绕肃然，他们深明大义，心下喃喃：‘大丈夫生当如是’。”\n\n此外，李克强人还未到北大，多个身穿潜水装置的安全人员，还潜入校园内的未名湖湖底搜索，而且更在湖边涵洞埋伏。路经学生莫不啧啧称奇，网民“郭晏平”一本正经说：“人多嘴杂，各种敌人无所不在，不得不防啊。”网民“袁国宝”说：“水里那是干嘛呢？” 网民“苏州郎心铁”：“他们是在未名湖里捞老舍么？”\n\n网民“罗新PKU”说：“唉，经济形势真是走低了，首长要吃鱼，只好到未名湖摸。”\n\n根据京华时报报道，李克强一连两天访问北大清华，特别指出在清华访问时，“总理还和同学们玩起了自拍。这可不是总理第一次自拍了，去年一年，他就自拍过至少四次。”\n\n李克强在1977年内地恢复高考后，考上北大法律系，毕业后在职进修，取得经济学博士学位。\n"
    },
    {
      "post_id": 76,
      "title": "RFI 温州官员称土地使用权到期需高价续地引起各方担忧",
      "date_published": 1460845221.995,
      "body": "近日，浙江温州国土资源局官员张少清接受《温州日报》采访，就温州地区出现的土地使用权证到期的的现象，提出解决办法：评估土地价格，重新缴纳“土地出让金”，需缴纳的金额据评估，高达数十万，达到了房产交易价格的三分之一甚至一半。\n\n这一报道在全国引起热烈讨论，被认为可能将引起对现行土地房产制度的震撼。\n\n根据这一报道，温州市国土局土地利用管理处处长张少清介绍，1990年5月，国务院颁布了《城镇国有土地使用权出让和转让暂行条例》（下简称《条例》），开始对城镇国有土地使用权实行有偿出让；该条例规定，居住用地出让年限最高为70年。\n\n90年代初期，温州市区在办理划拨国有土地使用权转让交易时，为了顺利推进，在不超过居住用地最高年限70年的前提下，按20年到70年分档，由受让方自行选择年限，并交纳相应金额。\n\n全国范围内，土地使用权一般是70年，有在深圳、温州等地有部分年限较短的出让，关于土地使用权到期后的处理如何处理仅有隐忧，还没有太多的规定。在温州，从去年开始，20年期限的这批住宅土地使用权到期或即将面临到期。\n温州国土局表示，在研究这个问题，并采取了三个做法，一是积极向上面反映，“这个制度需要顶层设计，我们突破不了，到目前为止还没有收到很明确的答复”。\n\n其次，温州土地局正在研究作为温州地方的普惠性政策及解决意见方案，目前已着手起草政策建议的初稿，近期会组织相关人员进行讨论后提交给上级，这个普惠性政策，“也要在法律框架范围内制定”。\n\n2007年3月通过的《物权法》规定，“住宅建设用地使用权期间届满的，自动续期。”因此，根据物权法，土地使用权“自动续期”，政府不能无偿、强制收回这块土地。\n\n2017年8月修订通过的《城市土地管理法》第二十二条又规定“土地使用权出让合同约定的使用年限届满，土地使用者未申请续期或者虽申请续期但依照前款规定未获批准的，土地使用权由国家无偿收回”。\n\n如何理解两部法律的冲突，资深律师王才亮认为，《物权法》属于人大通过的基础法律，效力应该高于《土地管理法》，上海金融与法律研究院研究员聂日明认为，新修订的法律效力优于旧法。\n\n就此事目前的处理办法，温州国土局认为，“在国家没有具体实施细则的情况下，只能参照国有土地出让的做法，先由第三方评估机构评估土地价格，根据单位地价或折算出楼面地价，算出总的土地出让金，重新签订国有土地使用权出让合同。”\n\n根据这一办法，“续期要缴纳的土地出让金动辄就是几十万，而他们房产交易价也才不超过100万，也就是说，如果要续期，缴纳的土地出让金要占到房产交易价1/3到一半左右。”\n\n温州市国土局官员解释，“只剩两三年使用权的房子，好比开了10多年的二手车，这两者的价值哪个高哪个低，大家一看就知道。”\n\n但他也承认“在实行国有土地有偿使用初期，在办理划拨转出让手续时，在一定范围存在土地使用人为了少缴出让金而选择以较短受让年限的现象，现在让受让人承担，确实有点不公平。”\n\n上海金融与法律研究院研究员聂日明认为，应缴的土地出让金占房价比重如此之高，300万的房产，要缴100万的土地出让金，相当于京沪地区职工社会年平均工资的十几倍，高房价地区的房地产所有人恐怕都是无力承担的。\n他认为，可行的解决路径有两种：第一，大幅度降低“续期”的土地出让金；第二，以每年征收的房产税代替一次性征收的土地出让金，在房产税全面开征以后，对“续期”的土地使用权不再征收出让金。\n"
    },
    {
      "post_id": 75,
      "title": "RFI 纽约华人警察误杀黑人案将宣判，一场族裔冲突山雨欲来",
      "date_published": 1460845194.976,
      "body": "原本4月14日宣判刑期的纽约华裔警察梁彼得误杀黑人青年葛利案，推迟至4月19日宣判。全美国的华人和黑人都以焦躁不安的心情等待宣判结果。美国的这两大少数族裔都扬言，如果宣判的结果不能被接受，他们将采取更为激烈的抗议行动。华人与黑人的一场冲突势所难免。\n\n纽约华人警察梁彼得2014年12月24日在搜查一幢政府公屋大楼时，手枪走火，误杀黑人青年葛利，在六分钟内不予施救，遭检察官起诉。2016年2月11日，法庭陪审团裁定梁彼得二级误杀罪名成立。在事发现场，梁彼得只顾掩饰自己的错误，不对葛利采取抢救措施，成为陪审团裁决的主要理由。此项罪名的刑期可从五年到十五年。\n\n2月20日，美国华人为梁彼得举行了据说有40个城市10万华人参加的游行示威，示威者举着“梁警官无罪”的标语，谴责法院的裁决，是对华人的种族歧视，是让华人警察为白人警察滥用武力广受美国舆论谴责做替罪羔羊。但同一天许多黑人也举行抗性行动。网上流传一段视频：一名黑人女子在一群声援梁彼得的华人前高呼：“黑人生命也是生命！没有人可以得到杀害黑人的通行证，没有人！”\n\n当人们在等待量刑宣判时，本月初，这起案件发生两个意想不到的情况：一是检察官向法院提交报告，要求对梁彼得免予刑罚；二是在判处梁彼得有罪的十人陪审团中，发现有一人隐瞒了自己的父亲曾坐牢的事实。这给支持梁彼得的华人带来希望，华人要求重申梁彼得案和无罪释放梁彼得的呼声越来越高涨。\n\n4月13日，法院举行梁彼得案量刑听证会，华人与黑人都派代表出席，会场气氛紧张。法官宣布：某位陪审员的轻微过错不会改变此案的判决。《纽约时报》也发表文章，相信法官会对梁彼得案做出独立的公正的判决，不会受任何外界因素影响。\n\n近几天来，纽约华人社团接连召开联席会议，声称一旦梁彼得被判刑，不排除发动更大规模的全国游行。而黑人社区领袖则扬言，如果梁彼得被判免予刑罚，他们将瘫痪纽约，并发动全国性的抗议行动。\n\n一场族裔冲突山雨欲来。这一次，不是白人与黑人，而是华人与黑人。纽约华裔社团领袖已紧急通知全市中餐馆和华人商店，4月19日停止营业，紧闭大门，并随时听从召唤，上街游行。\n"
    },
    {
      "post_id": 74,
      "title": "RFI 香港英籍教师深圳遇害残肢湖北捡回",
      "date_published": 1460845168.669,
      "body": "香港理工大学英国籍导师包亚（Hilary Bower）在深圳被肢解案，深圳公安在拘捕死者大陆女友阿玲后，再拘捕两名男亲戚同谋。案情揭发，阿玲因不满同居10多年的包亚向她提出分手，投向为他产下一子的女友，于是伙同两个男性亲戚杀害包亚，并将尸体肢解，自行开车运往1000公里外的湖北家乡掩埋。\n\n深圳公安已寻获碎尸并运返深圳交法医剖验，以确定死因。\n\n就上月22日60岁理大英籍导师包亚由香港入境深圳后遇害失踪案，深圳南山公安当局15日发出通报，证实本月8日拘捕两男一女疑犯，全为湖北咸宁人；包括居于深圳南山区一小区的38岁姓徐女子，她与死者属同居关系，其余两名28岁姓孙及23岁姓刘男子则为徐女同乡。公安调查相信凶案涉及感情纠纷，案件仍在调查中。\n\n英国外交及英联邦事务部则表示 ，会支援死者家属及与大陆当局保持紧密联系。\n\n据悉，包亚感情生活非常丰富，在大陆有多个女友，包括同居的徐女，以及为他诞下现年6岁儿子、早前来港报案的女子。\n\n其后疑徐女自首，向公安讲述犯案经过，因而揭发命案；公安拘捕徐女与两名同乡后，已派员到湖北寻找残肢及准备运回深圳检验。\n\n包亚为香港永久居民，上月22日从香港过关深圳后遇害失踪，他其中一名内地女友上月30日来港报警，亲友则在网上发放寻人启事，本港警方本周二收到内地通知，公布其死讯。至昨早，深圳当局正式发通报证实已破案，拘捕两男一女疑犯，案件涉及感情问题。\n"
    },
    {
      "post_id": 73,
      "title": "DW 德语媒体：中国经济神话之真实的谎言",
      "date_published": 1460845065.038,
      "body": "《南德意志报》援引专家观点指出，中国官方经济数据不仅缺乏可信度，而且还暴露出严重的资本外逃问题。《新苏黎士报》则指出北京对经济的强大干预迟早会走入死胡同。\nChina Regierungs-PK Li Keqiang\n\n官方数据不如“克强指数”靠谱？\n\n（德国之声中文网）在中国国家统计局公布今年第一季度经济增长数据之后，美国经济学家鲍尔丁（Christopher Balding）就在推特上发文指出，中国的GDP增长数据这么的稳定，简直令人称奇。《南德意志报》（SZ）发表文章，介绍了这位美国学术界的\"中国通\"是如何看待中国经济状况的。\"从2009年起，他（鲍尔丁）在北京大学汇丰商学院任教，北大是中国最具影响的高等学府之一，尽管如此，他仍然是中国经济政策最激烈的批评者之一。\"作者接着援引了鲍尔丁对最新公布的经济数据的看法：中央政府设定的每年至少6.5%的增长指标，在这位学者看来是不可能完成的任务。\"我认为现在的增长率应该在2%到4%之间\"，他说。\n\n中国的统计数据真的这么不可靠吗？文章继续写道，鲍尔丁也是因为被学生问自己是否相信官方数据之后，才开始进行相关的研究，他认为大量数据都是被操纵的。\"有些地方政府故意美化其国有企业的业绩，以博得北京的青睐；而另一些则会隐瞒原本不错的数据，为的是得到国家的财政补助。所有人都在互相欺骗。\"\n\n\"连中国总理李克强自己都不相信这些增长数据，2007年他对一些美国外交官透露，自己更愿意去看另外三个数据：能源消耗量、贷款发放量和铁路货运量。当2010年美国使馆的文件曝光之后，以这位经济学博士命名的克强指数就问世了。目前克强指数明显低于官方的增长数据。\"\n\n可怕的真相\n\n最近，鲍尔丁在对官方\"数据谎言\"辨别真伪的过程中还发现了一个惊人的漏洞：\"如果看一看中国海关贸易数据，再和银行的境外转帐交易进行比较的话，就会发现一个巨大的差异。海关统计的进口货物总价值，远远低于转移到境外的资金数额。根据鲍尔丁的估算，在过去的12个月里，大约有5000亿美元流出了人民共和国。这应该是全球最大的资本外逃。\"\n\n《南德意志报》的记者接着分析道，按照法律规定，每人每年可以带出中国国境的现金最多只有5万美金，因此许多试图将资产转移到国外的中国中产阶层，就从进口处贸易中寻找漏洞：\"他们成立贸易公司，比如一家小公司，虽然订单上进口的商品总价值是200万美元，但是真正运进中国的只有价值100万的商品，余下的100万就被存在了国外的帐户上。\"而对于这样的障眼法，当局是很难监控的。鲍尔丁认为，这一资本外流的趋势是无法遏制的。\"（中国的）政府官员称，资本外流的仅仅是因为目前的经济状况。……但我们看到的，却是一场针对北京的信任度投票。\"\n《新苏黎士报》（NZ）也对中国\"看起来很美\"的官方数据之后隐藏的问题提出担忧。该报评论文章写道：\"经济复苏背后的推动力来自国家，是中国政府采取强有力的措施来扶植经济。因此，中国那些常常是出于亏损状态下的国有企业在今年第一季度的投资总额竟然比2015年同期增长了23%以上。换个角度来讲，这也意味着这些原本就债台高筑的国企，如今所背负的债务负担更重了。相应地，银行所面临的呆账坏账比例也会继续上升。\"\n\n此外，房地产业也报告了看似积极的数据。3月份抵押贷款总额上升了6390亿元人民币，新住宅的建设也在继续火热进行。文章记者笔锋一转指出：\"然而在中国已经部分发生饱和的房地产市场，继续加大投资是否还有必要，就是另外一个问题了。总而言之，北京继续延续其对经济进行大力干预的作风。但是未来当政者必须要展示出有别于这种自上而下的控制手法的经济能力，因为这条道路迟早要走近死胡同，不管你愿意还是不愿意。\"\n\n摘编自其他媒体的内容，不代表德国之声的立场或观点\n\n\n\n"
    },
    {
      "post_id": 72,
      "title": "DW 北京与台北的非洲争夺战",
      "date_published": 1460844976.877,
      "body": "日前，肯尼亚向中国大陆遣送台湾籍诈骗嫌疑犯，再次引发了海峡两岸的激烈争执。长期以来，北京与台北一直在对非洲外交方面明争暗斗，北京现在已经占据了压倒性优势。\nSimbabwe Harare Besuch Xi Jinping\n\n(德国之声中文网)1949年国民党败退台湾之后，台海两岸的外交争斗便鲜有停息。其中最主要的游戏规则就是：不论什么国家，只能同时承认北京或台北之中的一个政权。\n\n在非洲，台北的中华民国政权一度具有领先优势，先后曾有30个非洲国家同台北建立正式外交关系。然而，近年来，北京的中华人民共和国政权越发娴熟地运用其经济优势，通过各类援助手段促使非洲国家与台北断交、转而同北京建立外交关系。如今，同台湾保持正式外交关系的非洲国家只剩3个：布基纳法索、圣多美和普林西比、斯威士兰。\nChina Abschiebung von Taiwanesen aus Kenia\n\n台湾嫌犯被遣送到北京\n\n肯尼亚：明确支持北京\n\n就在最近，肯尼亚向中国大陆 遣送了45名台湾籍嫌犯。肯尼亚当局指控这45人犯有诈骗、滞期居留等罪行。现在，北京方面有意正式审理这起案件。\n\n显然，肯尼亚向中国大陆遣送台湾嫌犯，是受到了北京方面的压力。中国是肯尼亚重要的经济伙伴，中资企业在肯尼亚参与多个大型基建项目。肯尼亚外长阿明娜·穆罕默德(Amina Mohamed)说：\"我国和台湾没有官方关系。\"\n\n冈比亚：北京的新伙伴\n\n冈比亚则在最近与台湾断交，转而同中华人民共和国建立外交关系。早在2013年，冈比亚总统贾梅(Yahya Jammeh)就表示，今后更愿意同北京进行合作。不过，北京方面先是婉言谢绝了冈比亚的提议。这主要是因为2008年之后两岸之间的\"外交休兵\"默契：北京与台北互不抢夺对方的邦交国。而在今年3月， 北京方面显然打破了这一默契，正式签署文件与冈比亚恢复外交关系，而后者也与台湾断交。 分析人士认为，这是中国大陆对台湾候任总统蔡英文的威胁，意图遏止民进党的台独倾向。\n\n赞比亚：台海问题左右总统大选\n\n随着\"外交休兵\"被打破，北京与台北之间很可能将开始新一轮的外交争夺战。这场争夺不仅限于争抢对方的邦交国，还包括如何稳住自己的外交伙伴。2006年，赞比亚总统大选期间就发生了这样的案例。当时，候选人萨塔(Michael Sata)抨击了该国中资企业的劳动条件，并表示如果当选总统，他将让赞比亚转而同台湾建立外交关系。中国方面立刻作出了反映，并威胁说，如果萨塔胜选，中国就将中断同赞比亚的外交关系以及经济合作。对于铜矿资源丰富的赞比亚而言，中国这一贸易伙伴在铜矿开采领域起着举足轻重的作用。南非《电讯报》将当年的赞比亚大选称为\"有关中国问题的全民公决\"。事件的结尾也颇有戏剧性：萨塔在2006年的选举中失利，但是不久之后他就转变了态度，开始寻求与北京方面进行对话；对于他的政治生涯而言，萨塔的这一转向兴许多少有所帮助--2011年的大选中，他成功当选了赞比亚总统。\n\n斯威士兰：依旧跟着台湾走\n\n斯威士兰是非洲唯一的君主制国家。和赞比亚不同，斯威士兰并没有令中国市场感兴趣的丰富自然资源。因此，同北京断交、与台北建交的决定并不是那么艰难。台湾提供的发展援助则让斯威士兰获益颇丰：2012年，仅有110万人口的小国斯威士兰获得了台湾援助的价值30万美元的电脑以及价值15万美元的大米。\n\n南非：台湾外交之痛\n\n南非当初由白人种族隔离政权执掌时，曾经是台湾的重要邦交国。北京则支持非国大(ANC)的反种族压迫斗争。90年代，南非政权更迭；1998年，南非便宣布断绝与台湾的正式外交关系，转而与中华人民共和国建交。\n\n南非中国研究中心(CSS)的一项研究指出，时任南非总统曼德拉曾经一度试图同时与北京以及台北保持外交关系。但是对于北京而言，同时承认\"两个中国\"，相当于承认台湾独立。好在南非虽然同台湾断交，但却依然保持着良好的经济合作。在比勒陀利亚以及开普敦，台湾都设有代表处。\n\n进行该项研究的学者格利姆(Sven Grimm)指出，台湾与南非的正式外交关系中断后，台商进入南非市场的难度显著增大。这是因为，台湾经济界代表无法同南非政府官员进行相应的会谈--外交形势不允许。\n\n目前，中国已经成为了南非最重要的贸易伙伴之一，同属\"金砖五国\"集团。目前执政的非国大(ANC)，也依然是中国共产党的重要盟友。可以说，在争夺南非的赛跑中，台湾已经全方位落后。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 71,
      "title": "DW 涉诈骗嫌犯返台获释 国台办吁“纠正错误”",
      "date_published": 1460844946.439,
      "body": "台湾经过交涉，成功阻止马来西亚将20名涉嫌电信诈骗的台籍嫌犯押送大陆。由于台湾未掌握直接诈骗事证，对其“无法可管”，所有人在返台后获释。中国国台办呼吁台湾“立即纠正错误”。\nMalaysia Kuala Lumpur Abschiebung von Taiwanesen\n\n（德国之声中文网）台湾《联合报》周六报道，中国原本打算循肯尼亚模式，将在马来西亚涉嫌电信诈骗的台湾人押送至大陆侦办。在台湾政府的交涉下，涉案的52名台湾人中，已有20人在周五深夜返回台湾。《联合报》指出，经过台湾强烈抗议，中方转变态度，同意依照过去两岸默契让台湾带走涉案的台湾人。美联社指出，马来西亚当局预计也会将其余的32名台湾人遣返台湾接受调查。\n\n台湾外交部指出，此次涉案被马来西亚拘留的嫌犯共有120人，其中台籍53人，陆籍65人，马来西亚籍2人。其中一名台湾籍嫌犯因拥有马来西亚工作证，早先已获释免予遣返。\n\n据台湾媒体报道，20名台籍诈欺嫌犯在抵达台湾后先接受身份查验，因无直接犯罪事证据非\"现行犯\"，全数获释。此一发展引起台湾社会高度关注。台湾中央社引述国民党指出，此举严重影响国人对政府打击犯罪的信心，让台湾遭嘲笑为“诈骗犯的天堂”，政府应亡羊补牢，与马来西亚及大陆落实司法互助，如有犯罪事实应立刻再行收押，不可让他国认为中华民国政府有\"包庇护短\"的情事。\nMalaysia Kuala Lumpur Abschiebung von Taiwanesen\n\n马来西亚周五夜间遣返20名嫌疑人至台湾，所有人在侦讯后获释\n\n台湾传媒\"新头壳\"报道，台湾行政院长张善政周六召开\"处理国人遭外国政府强制遣送至中国大陆案\"研商会议，强调若台湾人涉嫌犯罪，政府绝不护短，并指示法务部透过管道尽速取得资料进行侦办。此外，台湾法务部已正式发函中国公安部，请求中方提供犯罪资料。\n\n中国国台办发言人安峰山周六在回应台湾释放涉案嫌犯时表示，\"台湾方面的这一做法只会纵容日益猖獗的跨境电信诈骗犯罪活动，是对众多受害者权益的漠视和再度伤害，损害两岸共同打击犯罪的合作。\"\n\n他希望台湾方面立即纠正错误，\"使犯罪嫌疑人得到严肃追究和应有惩处，以实际行动证明对受害者合法权益的尊重和维护，避免对双方共同打击犯罪合作和两岸关系发展造成更大伤害\"。\n\n台湾将派代表团协商\"肯尼亚案\"\n\n中国外交部发言人陆慷周五在例行记者会上被问道，此案是否与中方从肯尼亚遣返涉嫌电信诈骗台湾人的案件有关，他并未做出具体答复，只重申\"在处理国与国之间关系的时候，我们一向认为一个中国原则是基础，对所有坚持一个中国原则的政府，我们都给予充分的肯定和积极的评价\"。\nChina Abschiebung von Taiwanesen aus Kenia\n\n日前肯尼亚当局将45名台湾籍电信诈骗犯罪嫌疑人遣送至中国\n\n日前肯尼亚当局将45名台湾籍电信诈骗犯罪嫌疑人遣送至中国，引起台湾方面强烈抗议。北京称希望在大陆对这些诈骗案进行调查。中国当局表示，因为受害者全是大陆居民，北京等地警方已立案审查，所以中方对这些案件享有司法管辖权。台湾方面向肯尼亚方面表示严正抗议，并且谴责北京违反默契，干涉在海外的台湾人的法律事务。\n\n台湾陆委会发言人杨家骏周六表示，陆委会已与法务部、刑事局、海基会共同召开专案会议并成立专案小组，最快于周一启程前往中国，与中方就肯尼亚案进行第一次协商。他透露，专案小组成员人数不会超过10人，以陆委会、海基会、法务部、行政署刑事局等官员为主，届时将视中国派出的协商人员名单与层级，派出最适任人选。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 70,
      "title": "BBC 哥斯达黎加单方中止与中国合建炼油厂计划",
      "date_published": 1460844878.596,
      "body": "中国与哥斯达黎加建交9年后，建交承诺之一的哥斯达黎加国营炼油厂更新扩建计划由哥方单方宣布终止。\n\n哥斯达黎加国营炼油厂RECOPE负责人萨拉•萨拉萨尔（Sara Salazar）女士格林威治时间15日子夜在立法议会收入与公共开支常设委员会上宣布，RECOPE决定按双边协议框架规定终止与中国石油天然气集团设立合资企业“Soresco中哥重建公司”的合作。\n\n哥斯达黎加与中国在2007年6月正式建立外交关系时，北京承诺协助哥斯达黎加政府更新并扩建摩恩（Moin）陈旧的炼油厂，并与中国石油天然气集团成立“Soresco中哥重建公司”展开合作。\n\n萨拉萨尔说： “考虑共和国总审计长的规定，现政府尽一切努力不使国家投资遭受重大损失，最后做出终止前政府所做出承诺的决定。”\n\n过去4年间，哥斯达黎加政府敦促中方对RECOPE提出的大炼油厂计划可行性研究进行修改，但不幸未能达成共识。\n\n哥方也同意依照现行两国合作协议规定，中方对所持有股份向第三方进行转移或出售以便该计划不致中断，但截至宣布终止合作时未有任何进展。\n\n位于利蒙（Limon）港的莫因（Moin）炼油厂是个陈旧的小型炼油厂，目前的炼油能力是每天1.8万桶。耗资15亿美元的扩建工程完成后，炼油能力将提升至每天6.5万桶。\n\n2013年6月中国国家主席习近平访问哥斯达黎加并与钦奇利亚总统签署大炼油厂贷款协议，但该国总审计署却在两周后叫停该计划。\n\n该计划由中国国家开发银行提供9亿美元贷款，其余6亿美元由两大股东中石油与哥石油分担。\n\n由于哥斯达黎加媒体于2013年揭露“Soresco”涉入两国合资项目评鉴报告撰写，更出现庞大的无谓人事开支。中国石油天然气集团随后又在中国反贪下出现高层人事变动，终于导致该计划最终以失败告终。\n\n单方宣布终止合作协议后，哥斯达黎加政府按国际惯例将该决定经由外交途径照会中国政府。由于正值北京周末无法送达，该照会转由中国驻哥斯达黎加大使馆收转。\n\n据“Soresco”律师恩里克•罗哈斯（Enrique Rojas Franco）在15日午（格林威治时间16日）该决定宣布后：“真不好意思，我对哥斯达黎加政府在毫无预警下的作为感到羞愧。”\n\n中美洲哥斯达黎加政府2015年至2030年第7届国家能源计划中，国营炼油厂扩建相关的融资、经济、社会与环保占有相当比重，并投入相当比重的资金与人力。\n\n哥斯达黎加单方撕毁与中国国营企业的合作，中方可依合约规定提交国际仲裁，但截至目前为止中国方面仍未有相关声明。"
    },
    {
      "post_id": 69,
      "title": "BBC 中国批评台湾立即释放遭遣返诈骗嫌疑人",
      "date_published": 1460844834.905,
      "body": "在台湾当局立即全部释放被马来西亚遣返的20名台湾籍电话诈骗犯罪嫌疑人之后，中国方面形容这是纵容犯罪。\n\n涉嫌在马来西亚从事电信诈骗活动的52名台湾籍嫌疑人中的20人星期五晚间遭马来西亚遣返后返回台湾，接受简短询问后在星期六（4月16日）凌晨全部获释。\n\n台湾警方对此解释说，因目前证据不足无法取得传票，在初步询问后，将20人全部释放。\n\n中国国务院台办发言人安峰山就此发表谈话说，台湾方面的这一做法只会纵容日益猖獗的跨境电信诈骗犯罪活动，是对众多受害者权益的漠视和再度伤害，损害两岸共同打击犯罪的合作。\n\n他还说，希望台湾方面立即纠正错误，消除恶劣影响，使犯罪嫌疑人得到严肃追究和应有惩处，以实际行动证明对受害者合法权益的尊重和维护，避免对双方共同打击犯罪合作和两岸关系发展造成更大伤害。\n\n有关台湾方面把这些电信诈骗嫌疑人释放的行动，从台湾岛内也传出批评的声音。\n\n有媒体引述台湾法律界人士的话说，这些人一下飞机就被释放，“既无程序正义，更无司法正义可言”。\n\n台湾国民党发表声明，要求尽速将罪犯绳之以法，以正视听。\n\n国民党批评说，这些人在国外涉及诈骗，经政府争取好不容易可以返回台湾受审，但回国就被以“缺乏事证”，“无法可管”在机场放人，显见我政府准备不周，此举也已严重影响国人对政府打击犯罪信心，让台湾遭外界嘲笑为“诈欺犯天堂”。\n\n国民党主席洪秀柱则通过社交媒体批评说，我国政府基于人权与管辖权，用尽所有手段把人带回来，却又因没有证据，一下飞机就任其鸟兽散，“这是哪门子的管辖”。\n\n（撰文：跃生）"
    },
    {
      "post_id": 68,
      "title": "BBC 遭马来西亚遣返台籍电话诈骗嫌疑人获释",
      "date_published": 1460844749.693,
      "body": "被马来西亚遣返的20名涉嫌电话诈骗的台湾籍人士星期五晚间返回台湾，接受警方简短询问后在星期六（4月16日）凌晨全部放行。\n\n马来西亚官员此前表示，被中国大陆方面通缉的另外32名涉嫌电话诈骗的台湾籍嫌疑人也将被遣返台湾。\n\n据台湾当地媒体报道，涉嫌在马来西亚电信诈骗的52名台湾籍嫌疑人中的20人星期五晚间乘亚航班机抵达台北桃园机场，刑事局派出20名刑警前往机场支援。\n\n报道说，20名嫌疑人在其他旅客离开后才下飞机，由在登机口等候的刑警点名，并带往航警局及移民署面谈室面谈，随后获释。\n\n媒体引述一名嫌疑人的话说，原以为要被带往大陆，很担心，知道被遣送回台，觉得很幸运，因为台湾比较有人权。\n\n还有媒体报道说，记者问一名男子回台湾“爽不爽？”这名男子回答说，“回家很爽呀。”\n\n这20名诈骗犯罪嫌疑人遭遣返后立即获释，显然引起了中国大陆方面的不满。\n\n中国媒体在报道的标题中说，“获释诈骗犯叫嚣：回家很爽，台湾有人权。”\n\n与此同时，台湾方面也就这些嫌疑人立即获释传出不满声音。\n\n有媒体引述台湾法律界人士的话说，这些人一下飞机就被释放，“既无程序正义，更无司法正义可言”。\n\n台湾刑事警察局副局长黄嘉禄表示，刑事局已报请台中地检署指挥侦办，但目前因证据不足无法取得拘票，在初步询问后，将20人都饬回。\n\n他还说，刑事局将依两岸共同打击犯罪及司法互助协议联系机制，洽请陆方提供资料。\n\n（撰文：跃生）"
    },
    {
      "post_id": 67,
      "title": "BBC G20财长加强呼吁对抗“避税天堂”",
      "date_published": 1460844716.123,
      "body": "在华盛顿举行的二十国集团（G20）财长及央行行长会议上，世界主要经济体进一步对加强抵抗“避税天堂”的措施表示支持。\n\n“巴拿马文件”（Panama Papers）披露多国权贵利用离岸公司逃税和洗钱的材料，在全球引起广泛争议之后，各国财政官员加强呼吁，要求各国当局公开离岸空壳公司背后的真正拥有者。\n\n此外，他们还主张将那些在信息共享问题上不合作的避税天堂列入黑名单。\n\n法新社引述G20发表的一份声明指，这些措施对于“防止利用这些实体进行腐败、逃避、资助恐怖分子和洗钱”至关重要。\n\n位于巴拿马的莫萨克·冯赛卡（Mossack Fonseca）法律服务公司的1100多万份内部文件被泄漏，当中显示该公司协助其客户洗钱、避开制裁以及逃避税赋。\n\nG20的有关声明发表前几个小时，“巴拿马文件”中最新的一个涉事官员被公布。西班牙工业部长何塞·曼努埃尔·索里亚（Jose Manuel Soria）被指与离岸公司有关联，他已经于周五（4月15日）辞职。\n\n法新社报导指，文件显示索里亚自1992年起就是一家离岸公司的主管。\n\n其他已经披露的涉事官员包括俄罗斯、冰岛、英国及阿根廷等国的高官。\n\n德国、法国、意大利、西班牙和英国等在周四的会议上提出了应对的方案。\n\n这五个国家表示，他们将会领头建立一个国际共享的数据库，向税务部门及其他管理机构提供空壳公司、信贷基金及其他常用的财产掩护实体的拥有者信息。\n\n法新社指，有关措施对于英美两国来说是个挑战，因为在这两个国家使用空壳公司是合法并且普遍的。\n\n美国财政部长雅各布·卢（Jacob Lew）对有关措施表示支持：“我们要对避税手段和国际税务系统中容许避税天堂的问题采取行动。”"
    },
    {
      "post_id": 66,
      "title": "BBC 巴西总统罗塞夫：弹劾支持者“保护腐败”",
      "date_published": 1460844670.622,
      "body": "巴西总统迪尔玛·罗塞夫指责支持弹劾她的人谴责无辜者以保护贪腐。\n\n罗塞夫在《圣保罗页报》撰文表示，针对她的弹劾案是试图取代合法政府的政变。\n\n一些支持弹劾她的国会议员面临腐败指控。\n\n巴西国会下院周日（4月17日）将就是否因在2014大选之前操纵政府指控而弹劾罗塞夫。\n\n罗塞夫否认这一指控。她在报纸文章中写道：“他们想要给一个无辜的女人定罪并保护腐败，那些领导政变者会允许继续打击腐败吗？他们的合法之处在哪里？”。\n\n她指责对手“试图用欺诈和谎言来撤销一个合法选举出的政府，并用一个不合法的政府取代它”。\n\n罗塞夫否认自己犯下任何罪行：“这是针对共和国、针对民主的政变，且首先针对参与选举过程的所有巴西人选票”。\nImage caption 支持和反对罗塞夫的民众上街示威\n\n巴西国会下院周五（4月15日）开始展开弹劾案相关辩论，预期周日就此投票。\n\n如果三分之二的议员支持弹劾，此案将提交至参议院。参议院的简单多数支持将使总统停职，并面临审判。\n\n巴西媒体报道，支持弹劾的阵营在国会下院可能有足够支持。\n\n总统阵营的一位官员对法新社表示，罗塞夫取消了在巴西利亚对其支持者的演说，集中精力争取下院议员们的支持。\n\n成千上万支持和反对罗塞夫的民众预期本周末在巴西利亚的国会周边地区示威。当局不得不设置金属屏障以分隔对立的双方。\n\n巴西其它一些城市也爆发了示威活动。"
    },
    {
      "post_id": 65,
      "title": "VOA 美议员：美中人权议题最大区别为是否愿被公开批评",
      "date_published": 1460807263.282,
      "body": "华盛顿—\n\n美中两国这个星期就人权议题再次交锋。美国国务院星期三（4月13日）发布了《2015年国别人权报告》，隔一天，中国国务院也如同往年，立刻公布了《2015年美国的人权报告》，指责美国人权问题。不过，美国国会议员对此则回应，美国不会闪躲自己犯下的错误，并勇于接受公开批评，这是美中之间在人权议题上最大的区别。有关详情，下面请看美国之音记者李逸华、常晓在国会山的采访报道。\n\n美国国会及行政当局中国委员会（CECC）星期四（4月14日）就中国目前存在的酷刑问题召开听证。对于中国在同一天发表《2015年美国的人权报告》及《2015年美国侵犯人权事记》，美国国会民主党籍众议员蒂姆.沃兹（Rep. Tim Walz）回应说，美国非常欢迎中国的这份报告，但他强调，美中两国在面对人权问题时的最大区别在于政府能不能接受公开批评检验，他说，那些每天批评美国政府的人不会因为自己的言论而被关进监狱或被酷刑严惩。\n\n“我不会去为美国所做错的事情辩护，但我会捍卫我们接受公开批评的事实。我们可以做的更好，你每天都可以在电视新闻上看到我们哪些地方可以改进做的更好。”\n\n中国在报告中指责美国对世界各国人权妄加批评，而对自身存在的严重人权问题三缄其口。中国在这份1万2000字的报告从六个方面指出美国的人权状况堪忧，包括枪支管理失控、警察暴力执法、金钱和家族政治大行其道、社会问题严重、种族矛盾尖锐、妇女状况恶化和公然侵犯他国人权等。中国政府的这份报告中有关美国的“负面信息”大量来自美国的媒体和民间组织。\n\n西顿霍尔大学法学院教授陆梅吉（Margaret K. Lewis）表示，美国不是完美的国家，美国有许多地方可以被公开批评，但没有人会因为公开批评政府或检讨政府而被失踪，而且在大部分的情况下，美国的法律还是能保护人权。\n\n她举例说，在911事件之后，西顿霍尔大学法学院旗下的研究机构曾发表一份关于关塔纳摩湾监狱的报告，但事后没有人因为这件事受到惩罚。\n\n“每个做这份报告的人都能安全回到家，回到家人身边，没有人因此失业或被逮捕。他们有尽情公开批评政府的自由。事实上，他们还因为自己点出了军中人权问题而高兴庆祝，假如他们是在中国的话，我不认为他们还能有这样的待遇。”\n\n陆梅吉教授说，她的确看到中国在某些地方开始有所改进，但更重要的是当今的中国人权状况还是十分令人担忧。\n\n“我认为美中之间在人权状况上着实有很大的差异，当今中国侵犯人权的情形真的很令人担心。”\n\n美国2015年度各国人权报告的中国部分说，中国这一年有关民权、政治权利、公共利益和少数民族问题的维权组织受到的压制和胁迫明显增加，对法律界的镇压尤其严重。\n\n美中人权对话机制流于形式  中国人权状况持续恶化\n\n美中两国自1990年起至2015年一共举行了19次美中人权对话，这是两国在人权领域的外交对话机制。不过，美国国会及行政当局中国委员会主席、共和党籍众议员克里斯.史密斯（Rep. Chris Smith）认为，光是进行对话没有真正实质性的结果，人权对话只会流于空谈。\n\n“这是条死路。人权对话只有在有实质性、全球性后果产生才会有效。”\n\n史密斯议员还强调，人权对话最重要的意义在于中国能够愿意承认、检讨自己侵犯人权的事实，但现在的发展反而是背道而驰。\n\n史密斯议员说，他希望中国人民能生活在空开、自由的环境，他不是与中国人民为敌，而是无法支持中国政府不尊重自己国家人民的作为。"
    },
    {
      "post_id": 64,
      "title": "VOA “巴拿马文件”真的又是美国搞的鬼？",
      "date_published": 1460807215.663,
      "body": "华盛顿—\n\n继冰岛总理贡劳格松辞职后，西班牙工业、能源与旅游大臣4月15日宣布辞职，成为最新一位因卷入巴拿马文件丑闻而下台的西方国家政要。在“巴拿马文件”在全球范围内持续发酵之际，也有人对曝光文件中没有什么美国人的名字提出质疑，甚至认为此事背后必有更强大的力量，中俄两国都有人指责这是美国的阴谋。那么巴拿马文件到底是不是美国为了整“不友好国家”而搞的一个阴谋？\n“巴拿马文件”真的又是美国搞的鬼？\n\n巴拿马文件出自美国情报机构之手？\n\n美国全国广播公司旗下的财经频道CNBC 4月12日援引一名号称是“史上最牛金融告密人”的话报道说，巴拿马律所莫萨克·冯塞卡内部文件大规模泄露背后可能是美国情报机构所为。此人名叫布拉德利·比肯费尔德(Bradley Birkenfeld)，是美国人，曾经在瑞银(UBS)工作。他说，“在我看来，事件的背后肯定是中央情报局(CIA)。” 比肯费尔德对CNBC表示，已被曝光的名字当中大多来自于与美国不友好的国家，像俄罗斯、中国、巴基斯坦、阿根廷等，但唯独看不到美国人的名字。\n\n在此之前，俄罗斯总统普京上星期表示，巴拿马文件是美国的阴谋，目的是破坏俄罗斯的团结。\n\n在中国，虽然有包括中共总书记习近平在内的八位现任和前任中共最高领导人被点名，他们的家人被披露在海外避税港控制着隐秘的离岸公司，但官方和媒体一直对巴拿马文件讳莫如深。有关巴拿马文件的一切报道和消息都被删除或屏蔽。 “巴拿马”和“姐夫”甚至在网上成为敏感词。党媒人民日报旗下的环球时报4月5日曾发表了题为《偷或编“巴拿马文件”者绝非等闲之辈》的社评。这篇后来很快被删除的社评指称“巴拿马文件”是“西方情报机构”用于打击普京这样的“非西方领导人”，维护西方意识形态的手段。\n\n这篇社评还写到，自维基解密(WikiLeaks)以来，每一次曝料的阐释权都被西方掌握，“对美国不利的事情，即使曝光出来也能大事化小。对普京这样的非西方领导人，只要‘有爆料’，假的也会被当成‘疑似真的’”。\n\n防火长城高筑 静园中国这边独有\n\n随着不断有各国卷入巴拿马文件丑闻的政要被迫辞职或公开个人报税记录或做出澄清，似乎只有中国这边“风景独好”，就好像该事件从未发生过一样。到目前为止，被国际调查记者联盟(ICIJ)报道点名的中国权贵阶层当中，只有已故前中共总书记胡耀邦的儿子胡德华一人就他自己2003年通过莫萨克·冯塞卡律所在英属维尔京群岛开设的离岸公司Fortalent International Holding Ltd.做出了解释。他表示，当时是准备自己的公司在香港上市，拿着自己的钱、自己的中国护照，堂堂正正来注册的。\n\n中国外交部长王毅4月8日在北京与来访的德国外长施泰因迈尔举行的联合记者会上对巴拿马文件做出了迄今为止唯一的中国官方的回应。他说：“中国反腐斗争正在继续进行当中，正像我们的领导人所说的，反腐永远在路上。至于你提到的一个所谓文件，我们看到巴拿马方面也在做出一些表白和澄清。恐怕我们首先要把它搞清楚到底是怎么回事。”然而，中国负责反腐的最高机构——中共中央纪律检查委员会（中纪委）从未对巴拿马文件或者说巴拿马文件所涉及到底离岸公司问题发表过哪怕一句话的评论。\n\n美国人去巴拿马避税？划不来\n\n对于阴谋论之说，国际调查记者联盟成员、前美联社驻北京记者欧蕾珊(Alexa Olesen)4月8日接受美国之音专访时就报道中鲜有美国人的名字做出了解释。“这是有原因的，”她说，“因为莫萨克·冯塞卡公司自己表示，他们不倾向于接纳美国客户。这家公司的经营模式是主要面向欧洲、拉美，还有越来越多地面向亚洲。所以，没有很多美国人出现在报道中是因为莫萨克·冯塞卡根本没有太多美国客户。\n\n2010年，美国国会通过《海外账户纳税法案》(Foreign Tax Compliance Act)，要求外国银行需向美国国税局(IRS)提供美国公民的海外账户信息，不配合者将会受到处罚。这意味，根据法律美国公民有必要在每年向美国国税局申报纳税信息时同时申报自己在海外银行账户的情况。该法在一定程度上起到了震慑作用。另外，美国在2007年与巴拿马签署自贸协定，巴拿马政府为此同意允许美国税务人员查账并修改了本国法律。美国媒体指出，即使有美国人想避税，一般也会找一个他们认为更远更安全的地方，比如瑞士。\n\n还有一种观点认为，美国人没有必要跑到巴拿马这样的国家去开设一个离岸壳公司，他们完全可以在美国本土做这样的事情。\n\n税收与经济政策研究所(Institute on Taxation and Economic Policy)的执行董事马修·加德纳(Matthew Gardner)表示，巴拿马文件所暴露出来的绝不仅仅是巴拿马一个国家的问题，而是一个全球性的问题，特别是在美国，要想开设一个空壳公司以达到隐匿资产或躲税目的完全没有必要去巴拿马这样的国家，美国的一些州、比如内华达州、德拉瓦州和怀俄明州都是很好的避税港。\n\n他说：“我们（美国）的情况是在有些州，包括德拉瓦州、内华达州和怀俄明州，你仍然可以以几乎匿名的方式去注册一个壳公司。在谁持有公司方面，你只需提供非常少的信息。这种做法必须要停止！” 税收与经济政策研究所是华盛顿一个非盈利研究机构。\n\n美国真有“阴谋”，岂不折腾坏了自己的盟友？\n\n如果说，巴拿马文件泄密是美国为了折腾俄罗斯和中国等“不友好国家”的一个阴谋，那么这个阴谋也把美国在欧洲最亲密的盟友英国也拉下了水。巴拿马文件显示，英国首相卡梅伦的父亲曾拥有一个离岸基金公司，而卡梅伦本人也曾从中受益。这让卡梅伦在过去两个星期里备受煎熬。\n\n4月10日，卡梅伦公布了自己过去六年的纳税申报信息，试图以此来平息公众的质疑和批评之声。他表示，无论是他本人还是他父亲都没有做过任何违法的事情，那个基金的收益所需缴纳的税款，以及他父亲2010年去世时他继承30万英镑财产所需支付的税款均已全部缴清。但即便如此，英国媒体仍然质疑卡梅伦在2010年前是否通过其他避税项目获益，反对党和一些民众更是要求他辞职。此外，人们还把在讨论英国在国际离岸金融体系中所发挥的角色这个更大的问题。\n\n美国国内自我审视\n\n在美国，巴拿马文件的曝光也让美国各界再次把焦点集中到利用壳公司避税的问题上。\n\n税收与经济政策研究所的加德纳说：“包括我们组织在内的很多人都提出巴拿马文件不应该只是审视巴拿马一个国家问题的窗口，而应该把它看成是审视一个隐秘的全球财务网络的窗口。在这个网络中美国从头到尾和巴拿马一样发挥着显著作用。\n\n巴拿马文件曝光后，民主党总统参选人桑德斯批评美巴自贸协定为避税港创造机会，但其他人士指出，自贸协定签订后，在巴拿马开避税账户的人少了。\n\n华盛顿智库全球金融诚信(Global Financial Integrity)的执行理事汤姆·卡达蒙(Tom Cardamone)表示，巴拿马文件的泄密为全球反洗钱和打击离岸避税港提供了一个契机，将促使美国政府进一步采取行动。\n\n他说：“国会正在研究一部法案，叫作注册公司透明法案(Incorporation Transparency Act)，该法案将要求任何在打算在美国成立新公司的人必须提供姓名和地址，不是说负责文书工作的律所的地址，而是持有公司的受益人的姓名和地址。国会应通过这部法案，奥巴马政府应当签署。如果是这样的话，那么美国将在企业透明方面成为世界的领导者。这将给美国一个讲台，去敦促G20国家和其他国家也采取类似措施。”\n\n专家：打击避税港符合中国利益\n\n至于中国，卡达蒙表示，如果中国政府对待反腐的态度是认真的，那么与包括美国在内的国际社会一道合作，打击壳公司将符合中国的利益。\n\n“我认为这些位高权重的中国人卷入这一丑闻显示，没有国家能够在从壳公司所带来的跨国洗钱、逃税、腐败等问题中独善其身。消除隐秘的壳公司可以帮助所有国家增加税收、减少腐败，以及保护本国安全，因为恐怖组织秘密地将资金挪入隐秘的壳公司将变得更难。让企业所有权透明所带来的好处多多。我认为，中国作为G20的成员可以成为这方面的领导者。”他说。"
    },
    {
      "post_id": 63,
      "title": "VOA 美国务院再次将中国列为宗教自由特别关注国",
      "date_published": 1460807184.429,
      "body": "华盛顿—\n\n美国国务院星期五表示，依照1998年的《国际宗教自由法》（International Religious Freedom Act of 1998），国务院已经于4月14日通知美国国会，将包括中国在内的十个国家列为“特别关注国家”（Countries of Particular Concern）。\n\n缅甸、中国、厄利特里亚、伊朗、朝鲜、苏丹、沙特阿拉伯、土库曼斯坦、乌兹别克斯坦再次进入特别关注国名单；塔吉克斯坦首次进入这一名单。\n\n美国国务院发言人约翰·柯比在记者会上表示，依照《国际宗教自由法》，针对缅甸、中国、厄利特里亚、伊朗、朝鲜和苏丹的“总统行动”已经执行。\n\n柯比说：“在多数情况下，这些制裁和行动影响的是军与军的关系和救援协助；有些影响的是签证限制。对一些国家实行的是对非军事方面援助的额外限制。”\n\n美国豁免了对沙特阿拉伯、塔吉克斯坦、土库曼斯坦和乌兹别克斯坦执行“总统行动”。《国际宗教自由法》规定，基于“重要国家利益”的需要，总统有权不对某些国家采取行动。\n\n柯比表示：“指定‘特别关注国家’帮助我们关注那些需要国际社会注意的国家和情况。美国每天都在致力于与各政府、公民社会组织和个人合作，努力达到我们在促进和平与稳定方面的共同利益，其中一部分工作就是要通过推进和保护包括宗教自由在内的人权来达到这一目标。”\n\n柯比表示，美国联邦公报（Federal Register）近期将公布美国对这些特别关注国已采取的具体行动和制裁。"
    },
    {
      "post_id": 62,
      "title": "VOA 中国红木家具，东南亚森林的血腥浩劫",
      "date_published": 1460807148.145,
      "body": "泰国曼谷—\n\n最新一期的美国《时代周刊》报道，中国市场对于红木家具的强烈需求已经导致了泰国森林沦为非法盗伐者与护林人之间的战场。实际上，这种状况并不止于泰国境内，整个中南半岛的热带森林正在遭受着前所未有的劫难。进入21世纪以来，非法盗伐木材的现象已经成为泰国、老挝、柬埔寨、缅甸、越南等国的严重问题，根据美国非政府组织“保护国际基金会”（Conservation International）于2011年罗列的世界十大濒危森林数据，这一地区的森林流失速度排在全球第一位。\n\n上世纪90年代之前，日本曾经是从东南亚进口原木的第一大国。然而，随着日本国内对于森林保护认识的逐步加深，消费者对于木制家具的抵制使得日本的原木进口量大幅减少。中国随之取代了日本的原木进口地位，而中国消费者对于红木家具的青睐正是造成这一现象的原因之一。\n\n随着森林面积的缩减，东南亚各国政府都先后推出了不同程度的“限伐令”，然而，巨大的商业利润驱使一波又一波的冒险家深入东南亚林区。由于中国与其中一些东南亚国家陆地接壤，非法盗伐的木材可以更方便地进入中国，而中国海关对于陆地通关的木材是否合法一直采取睁一只眼、闭一只眼的态度，从而在某种程度上变相鼓励了非法砍伐的商人，使得当地盗伐现象加剧。\n\n超过80%的木材都去了中国\n\n《时代周刊》的报道称，1立方米的泰国红木（Siamese Rosewood ，又称黄檀木或者花梨木）在柬埔寨可以卖到5000美元，而走私进入中国后，价格则会翻上10倍。\n\n泰国东北部城市廊开（Nong Khai）的一位家具制造商乌泰告诉记者：“20年前，泰国北部和东北部还可以找到成片的花梨木、柚木等热带硬木树林，现在都已经消失殆尽。现在，我们也要去老挝或者缅甸买木头，但是，泰国市场的价格争不过中国，那些地方的绝大多数红木都被运去中国了，整个东南亚的木材，超过80%都去了中国。泰国仅存的一些红木只有在与柬埔寨接壤的边境地区还能找到。”\n\n《时代周刊》称，由于柬埔寨的森林砍伐一空，那里的盗伐者正逐渐向泰国一侧推进。为了保护这些珍贵木材，泰国于2015年6月组织了护林队，队员们配备了全副武装。而盗伐者们则携带着AK47步枪和手榴弹，双方近来多次交火，造成几十人丧命。护林队队长皮拉福（Piroon Pilaphop）曾对媒体表示：“盗伐者不在乎我们的护林员身份，如果他们撞见我们，他们会毫不犹豫地向我们射击。”\n\n泰国红木等一些品种曾于2013年被列入《濒危野生动植物种国际贸易公约》（CITES）名单，成为第二级受保护野生植物。泰国政府规定，出口红木必须出具官方颁发的许可证书。然而，按照业界人士的说法，可用于制造传统中国红木家具的木材多达30多种，而其中受到保护的只有几种，绝大多数树种并不在保护之列，而中国的家具制造商则不断改变硬木品种，来解决原料受限问题，这就使得泰国的其他树种也受到非法砍伐的威胁。\n\n《时代》引用了东南亚森林问题专家马库斯•哈特克（Marcus Hardtke）的论述：“10年前这些物种没人感兴趣，现在却大受追捧。如果现在不采取强有力的措施，中南半岛很快就会只剩下灌木丛了。”\n\n邻国不堪之苦\n\n在中国南部的邻国当中，越南的森林面积衰减幅度最大，也是世界上去森林化国家中仅次于尼日利亚的第二大国家。越南本土市场对红木家具的需求同样旺盛，实际上，越南早就禁止了原木出口，现在已成为原木净进口国。东南亚木材没有进入中国的那部分，主要是运往越南。由于中越边境的管理比较清晰，很少有非法木材通过中越口岸进入中国。因此，不少精明的中国家具商改变策略，直接在越南设厂制作红木家具，然后把产品运回国销售。\n\n老挝曾经是非法木材进口到中国的一个主要来源地，尽管老挝政府也曾明令禁止，但每年还是有大量的木材流入中国和越南。根据环保组织“环境调查机构”（Environmental Investigation Agency，EIA）2015年公布的数据，老挝非法砍伐的木材是合法伐木业的10倍。一些当地企业通过贿赂官员，假借修建基础设施等名目砍伐森林，“禁伐令”名存实亡。\n\n同样的情况发生在柬埔寨，虽然该国与中国并不接壤，但非法盗伐的木材通过老挝运进中国。据非政府组织“全球见证”（Global Witness）2015年发表的文章称，柬埔寨的富豪狄皮（Try Pheap），正是大量非法盗伐事件背后的金主。除了行贿官员，盗伐者还刺杀执法人员和揭露盗伐事件的记者。\n\n中国的邻居们当中，森林流失最严重的国家当属缅甸。由于缅甸北部长期被民族武装控制，而这些武装维持生活经费则需要变卖大量的自然资源，除了翡翠、宝石之外，木材也是他们换取金钱的重要物资。根据缅甸资源与环保委员会秘书长吴登伦的说法，缅甸的森林覆盖率在十九世纪末曾占国土面积的70％，到1962年下降为57％，2005年为51％，目前仅为20％左右。\n\n缅甸政府从2014年4月1日起完全禁止原木出口，但是在那之后，从云南边境进入中国的缅甸木材仍未绝迹。2015年1月，缅甸政府逮捕了112名中国伐木工人，并对其判以重罪，成为轰动一时的新闻。然而，即使在那次事件以后，中国工人在缅甸非法砍伐被关押的消息仍时有所闻。而实际上，缅甸对非法中国伐木工的拘捕从2004年以来就没有停止过，仅2006年6月，就有427名中国工人被缅甸遣返。\n\n中国官方的不作为引起各国不满\n云南片马口岸旁边堆积的木材，照片中显示的只是其中极少的一部分。（美国之音朱诺拍摄，2014年5月7日）云南片马口岸旁边堆积的木材，照片中显示的只是其中极少的一部分。（美国之音朱诺拍摄，2014年5月7日）\n\n根据环境调查机构的报告数据，2000年至2013年，中国共进口350万立方米红木，价值24亿美元。按照《时代》的说法，即使是史无前例的反腐运动，也没能减缓中国市场对于红木的需求。在云南边境口岸片马镇，熟悉内情的当地人告诉记者，中国木材商已经砍进缅甸100公里。\n\n名义上，中国的中央政府并不支持非法贸易，但是，大量的非法砍伐木材毫无障碍运进云南边境也是不争的事实。记者在缅甸2014年禁止原木出口的政策下达之后，曾经到过云南边境的数个口岸，见到从缅甸过关的大量原木堆积在口岸附近。当地人表示，尽管禁令之后运输木材的货车已经显著减少，但是并没有完全绝迹。\n\n中国地方官员和商人似乎并不理解缅甸人对森林面积锐减的担忧，也不了解缅甸人民逐渐高涨的对于中国商人“掠夺”自然资源的反感，这种对于邻国舆情的无知表现在一些匪夷所思的商业行为中。今年1月，缅甸资源与环保委员会的官员曾向媒体透露，中国某地政府竟然向缅甸建议在边境地区兴建一个以木材贸易为主的工业园区，遭到缅方的严辞拒绝。\n\n非法砍伐现象在中国国内也没有引起消费者和媒体的足够重视。即使是去年缅甸拘捕中国伐木工人的新闻被热炒期间，无论是媒体和读者都缺少对于人类生活环境和森林面积锐减的反思。上个世纪80年代，日本正是掀起了一场全国性的对于森林砍伐的笔战，各种环境保护的非政府组织应运而生，说服地方政府减少政府机构木制办公家具的使用，继而推广到私人消费者中，才使得全国硬木家具的消费量形成拐点，最终促使日本退出原木进口世界第一的位置。"
    },
    {
      "post_id": 61,
      "title": "VOA 香港六四纪念馆面临打压 ",
      "date_published": 1460807077.223,
      "body": "香港—\n\n香港的六四纪念馆于今年2月休馆，这个星期五、也就是胡耀邦逝世27周年纪念日，六四纪念馆重新开放。纪念馆除了展示有关六四事件的证物外，还增添了 “停止滥捕”专题展区，介绍有关习近平上台后整肃意识形态和搜捕维权人士等事件。\n\n香港六四纪念馆位于九龙尖沙嘴，在2014年开幕，但一直多次被大厦业主以官司和行政手段滋扰、另外还要求参观纪念馆的游客进行登记，无疑让许多来自中国大陆的游客望而却步。持续的诉讼让主办方，即香港支联会，难以应付昂贵的讼费；另外，目前纪念馆所在的空间比较狭窄，难以举办更多的讲座和活动。基于以上种种原因，支联会决定另觅新址。\n\n支联会表示，六四纪念馆将会在今年6月4日后关闭，而他们也正在筹款和寻找新址，并希望能够扩建，并希望新的纪念馆能够在一年内再度面世。\n\n六四纪念馆的策展人林汉坚表示，若能实现纪念馆的扩建，届时可将有关雨伞运动和学运等主题的展览也包括进去。"
    },
    {
      "post_id": 60,
      "title": "RFI 美国起诉一美籍华人和广东核电",
      "date_published": 1460762668.781,
      "body": "中国国企广东核电集团（CGN）与一名美籍华人昨天3月14日遭美国司法起诉，被控未经批准，非法在美国境外开发特殊核材料。受到起诉的美籍华人Szuhsiung Ho是核子专家，他还被控从事间谍活动。\n\n美国田纳西州一个地方法庭指控这位音译名叫何楚雄，别名叫艾伦-何（Szuhsiung Ho，别名Allen Ho）的52岁美国公民与中国广东核电集团未经美国能源部批准，非法在美国境外生产和开发特殊核材料。\n\n同时，法庭还指控这名美籍华人核子专家为外国政府从事间谍活动。美国司法部表示，此人遵照中国国有核能公司的指示，接近在美国的核专家，为中国发展制造特殊核材料提供帮助。\n"
    },
    {
      "post_id": 59,
      "title": "RFI 中国菜价暴涨谁是幕后黑手？",
      "date_published": 1460762633.452,
      "body": "中国菜价暴涨引发消费者不安。中国社交网涌现各种吐槽文章。有网民指出，大葱涨到8-10元一市斤，如果按吨计算，价格超过了钢材。有分析认为这轮涨价农民得利甚微，大部分红利流入批发销售环节。调侃之余人们想知道谁是涨价的幕后黑手。\n\n民生茶馆微信指出，比房价上涨更可怕的事情是菜肉价格又涨了。百姓可以不买房，但不能不吃饭。今年3月生猪价格同比涨了57%。而今年3月中国蔬菜当中有八成都涨价。一市斤净西兰花15元，长豆角12.8，大蒜8.8，净大葱10.8...\n\n一些网民吐槽说，“蒜你狠”，“姜你军”，“向前葱”又回来了。还有网友说，“现在能摆一桌子蔬菜的都是土豪”。\n\n中安在线-安徽日报农村版引述分析指出，这一轮肉菜涨价的收益只有很少流到农民口袋里。因为农产品供应领域,一直有“种菜的比不上卖菜的,卖菜的比不上批菜的”的说法。反过来随着农产品价格上涨,农资也跟进涨价。农产品价格有涨有跌,可农资价格却是只涨不跌。\n\n民生茶馆引述分析指出，万物皆涨的幕后黑手是超发货币。宽松货币政策被认为是洗劫民间财富。\n"
    },
    {
      "post_id": 58,
      "title": "RFI 中央社:台人央视重演“未审先判”媒体认罪",
      "date_published": 1460762606.613,
      "body": "中国当局今天4月15日在央视午间新闻节目中，安排两名涉肯尼亚电信诈骗案的台湾嫌疑人在电视上忏悔认罪。中央社说，这是重演“未审先判”的媒体认罪。\n\n这两名在央视认罪的台湾人，一人姓简，一人姓许。简姓疑犯表示知道诈骗是错误行为，对不起中国大陆老百姓，也会接受法律制裁，希望“政府”能够给他一个机会。许姓疑犯也表示他知道错了，真的很对不起，以后会改过自新。\n\n中央社今天发自北京的报道指出，在央视之前，中国新华社先发出长篇报导，披露案情和台湾嫌疑人的认罪忏悔。随后，中国央视以22分钟播出包括台人认罪忏悔的画面，重演未审先判的「媒体认罪」。\n\n在中国央视的午间新闻后，中国法治在线节目也跟进播出肯尼亚案，也有两名台湾人认罪的片段，并显示其中一人在镜头前写下悔过书。\n\n24岁的简姓台湾嫌疑人在中国央视认罪后，他在台湾桃园市大溪区的家人表示，无论有罪没罪，都希望台湾政府协助让简男回台湾接受司法程序调查。\n"
    },
    {
      "post_id": 57,
      "title": "RFI 巴拿马文件风暴吹进20国财长会中美如何面对？",
      "date_published": 1460762580.384,
      "body": "4月15日周五在华盛顿将举行为期两天的20国财长和央行行长会议。由于巴拿马文件在全球掀起反对逃税天堂的风暴，对即将举行的20国财长和央行行长会议产生影响，法国在内的5个国家提出多项打击逃税天堂的措施,但由于涉及并揭秘中国高层家族财富，“巴拿马文件”在中国成为禁忌，中国美国如何面对？使得该会议备受关注。\n\n巴拿马文件风暴的影响力度使得法国和德国政府决定利用20国财长和央行行长会议的机会，将打击全球范围的逃税天堂作为讨论的议题之一。法国，德国，英国，意大利，西班牙5国的财政部长昨天向20国峰会提交信件，指出从2009年开始的20国财长和央行行长会议的目的之一，就包括打击逃税，过度避税，和洗黑钱的活动。20国财长和央行行长会议和其他的国际经济合作组织是打击以上活动最有力的工具。\n\n5国信件提出：希望在2017至2018年间，构建出一个各国自动交换有关离岸公司账户的信息系统(standard de reporting commun)。应该在国际经合组织OCDE现有的合作打击国际洗钱的构架下，继续扩展更大的国际合作范围。\n\n5国信件提出两项具体和明确的计划：一是让各国税务当局能够交换信息，二是开列一个税务不合作国家和地区名单。5国希望20国财长和央行行长会议能够把他们的要求建议列入会议的最后公告当中。\n\n“巴拿马文件”风暴推动法国等欧洲5国率先提出合作打击逃税的建议，法国费加罗报今天在对此进行正面评价的同时，也指出：在建立国际范围内的打击逃税活动的同时，欧盟国家也应该加油努力，因为欧盟国家间尚未建立全欧统一的税务不合作国家和地区名单。\n\n据报道：法国财长萨班将会见美国财长雅各布•卢和中国财长楼继伟。法国媒体评论说：欧洲5国的建议面临的最大阻力还是来自美国和中国。\n\n美国是世界经济的一号老大，有能力获得所有对其感兴趣的和有用的经济税务信息。美国要求别国提交相关信息，但却并不交换自己掌握的信息给其他国家。过度避税成为美国大公司的第一“爱好”和特长，据美国Oxfam的研究报告：在2008到2014年间，50多个美国最大公司为了最大程度的避税，把相当于14000亿美元的经济活动放在逃税天堂，相当于法国年度国民生产毛值的一半。\n\n巴拿马文件风暴吹进20国财长会,但来自中国的阻力，使得欧盟5国财长信件的效果受到怀疑，因为中国处于巴拿马文件风暴的漩涡之中，习近平等九大家族被曝光设立离岸公司的活动。\n"
    },
    {
      "post_id": 56,
      "title": "RFI“巴拿马文件”照亮香港的阴暗面",
      "date_published": 1460762551.849,
      "body": "香港拥有中国大陆其它地区所没有的自由，但也有阴暗面，这在“巴拿马文件”中被曝光，即香港成为了中国大陆企业个人在海外设立离岸公司的渠道和出口。\n\n法新社指出：据国际调查记者同盟的介绍：2015年，在巴拿马莫萨卡-冯塞卡律师事务所注册的离岸公司中，有16300个是中国和香港公司，占了三分之一。在注册离岸公司的人中有中共领导人的家人，有香港首富李嘉诚，有演艺界名人成龙等人，他们中的大部分人的离岸公司设在英属岛屿。而在2009年，如果不是中国经过艰苦谈判的话，香港差一点就被列入了国际经合组织的逃税天堂黑名单。\n\n法新社引用名为“税法公平网路”(Tax Justice Network)的2015年报告说：香港是一切合法与非法经济活动之地，在香港，一切都为不同形式的生意开放绿灯，其中当然有非法经济活动。香港的安全和自由是离岸公司经济活动的两大基本条件。对于中国富人和精英来说，香港是避免提交证明文件和监管的理想之地，也是中国大陆投资者将资金带出境外再投资大陆，从而享受外资优惠的方式。2012年中国大陆的外资中，有45%来自香港，15%来自英属岛屿。香港对外国公司的低税，转移资金的方便，和避税的可能，使其成为离岸公司的天堂。\n"
    },
    {
      "post_id": 55,
      "title": "RFI 张德江下月出席香港论坛被指挺梁振英",
      "date_published": 1460762527.235,
      "body": "身兼中央港澳工作协调小组组长的中共中央政治局常委、全国人大委员长张德江，将应香港特区政府邀请，下个月到港出席“一带一路”高峰论坛。据特首办公室表示，张德江是应特首梁振英的邀请出席的，到时他将发表主题演说。\n\n他将会是2012年时任国家主席的胡锦涛出席回归十五周年活动以来，第一个到访香港的国家领导人。张德江也是所谓人大常委8.31决定的最后拍板人，这个封杀了香港真普选的决定，在2014年触发了为期79天轰动国际的雨伞运动。\n\n南华早报引述一名知情者披露，张德江此行可被解读为支持梁振英政府的一个信号。\n\n梁振英14日表示，张德江出席论坛，充分体现中央重视和大力支持香港在一带一路倡议中的独特功能，亦体现了香港在国家新一轮发展战略中的重要作用。\n\n有建制派立法会议员不认为张德江来港，与近期社会对一国两制，以至港独的争议有关。民建联叶国谦说：“领导人来不会突然心血来潮，一定有他本身的用意，他本身是港澳工作组组长，能近距离地接触香港各界或香港的环境，我相信这点是非常好的消息。”\n\n泛民则希望张德江来港，不只是宣传一带一路。工党议员何秀兰说：“了解新一代为何有这么大的愤怒，亦要了解香港人为何对一国两制完全失去信心。”\n\n香港下一届特首人选，中央虽然尚未表态，但多个有意角逐者已经展开暖身活动，尤其是反梁连任之声，在建制派内亦此起彼落，张德江在这个时刻应邀来港，从另一角度而言，可说是间接为梁振英站台。\n"
    },
    {
      "post_id": 54,
      "title": "RFI 占中发起人朱耀明获德教区颁奖赞扬其争取民主对抗独裁",
      "date_published": 1460762501.649,
      "body": "占中发起人之一的朱耀明牧师获得德国科隆福音派教区颁发Pfarrer-Georg-Fritze纪念奖，表扬他30年来为香港的民主发展不懈的努力。他是第一位获此殊荣的华人。\n\n现年72岁的朱耀明说，他希望这个纪念奖可以为香港的青年在争取民主的路途上，起到鼓励的作风，因为不少人对2014年那次史无前例的静坐示威未能带来实际成果而感到灰心。\n\n朱说：“这个荣誉应该颁给所有的香港人。这个奖是对整个（占中）运动的肯定，而我希望社会能够感到鼓舞，明白到我们的努力并无白费。如果我们向命运低头，我们就会失去一切。”\n\n德国科隆福音派教会教区，是由20个包括路德会等教会组成的教区，成员占了全德国基督徒的大多数，约人口总数的29%，是世界最大的基督教教区之一。\n\nPfarrer-George-Fritze纪念奖在1981年创立，每两年颁发一次，表扬那些敢于以和平手段对抗独裁和强权的个人或团体。\n\n据南华早报报道，教区评审团除了表扬朱牧师为香港民主发展所做出的努力之外，亦对他在1989年天安门镇压之后向逃亡的异见者提供支援表示肯定。\n\n朱耀明早在今年1月中已经获告知成为2015年度Pfarrer-Georg-Fritze纪念奖得主，邀请他出席当地时间4月17日的颁奖礼。但朱牧师没第一时间与家人分享喜悦，反而致电另一位占中发起人陈健民，“我不知道应该如何处理，即刻找到陈健民”，陈健民说支持他接受这个奖项。\n\n与朱耀明一起接受苹果日报访问的陈健民说：“很多人觉得雨伞运动（占领中环）无功而还，失败感沮丧感好大，但很多事情都要长远去看，朱牧得奖，都是对运动的正面肯定，其实运动确有很大的贡献，整代人都觉醒了。”\n\n在旁的朱牧坦言这是说服领奖的理由，“伞运后很多人说是失败，但结果证明都感动到国际”。\n\n朱耀明领奖时会发表题为《敲钟者言》的主题演讲，内容除触及香港民主发展，六四事件及占领运动，亦特别提及铜锣湾书店股东李波失踪案，强调越境掳人的非法行为，令一国两制及《中英联合声明》保障港人的言论及出版自由甚至人身安全，受到侵蚀。\n\n这个奖以Georg-Fritze为名，他生于1874年，1916年成为科隆当地教堂第一位牧师，坚决反对纳粹及希特拉，敢于批评当时教会对迫害犹太人袖手旁观，结果遭迫害至死，科隆教会为引起人们关注独裁政权下的暴力及违反人权事件，表扬以和平方式对抗暴政和协助暴政受害者的杰出人士，于1981年设有关奖项，朱牧是首位华人得奖，获大会发放的1万欧罗，折合约8万多港元奖金，朱牧称会将奖金全数捐赠予推动民主的相关基金。\n"
    },
    {
      "post_id": 53,
      "title": "RFI 解放军报：军人用过手机或电脑不能私下处理",
      "date_published": 1460762469.742,
      "body": "一般人都将用旧了手机或电脑放售二手市场或旧换新用更新的型号，但解放军报警告大陆的军人，不能将使用过的智能手机或平板电脑私下处理，以防泄漏“数据记录”。\n\n \n\n解放军报15日报道，自从《关于进一步规范基层工作指导和管理秩序若干规定》颁布后，一些战区在符合相关保密和管理规定的前提下，逐步放开官兵使用智能手机。但与此同时，加强对官兵们的安全保密教育，并对手机“数据记录”这一可能的失泄密隐患及时进行防范。\n\n报道引述北部战区某部政治处保卫干事韩天阳指出，当韩听说警卫勤务连战士小王准备将其使用过的智能手机拿到地方二手手机店以旧换新时，立即予以制止。同时，督促其按规定将手机上交，由机关保密办对手机中的“数据记录”进行脱密处理后，再返还给个人。\n\n所谓“‘数据记录”是指那些虽已被删除，但通过技术手段仍可被恢复，并产生危害的相关信息。\n\n报道指，经过一番调查，该部发现小王的做法并不鲜见。为此，他们制订出台了《互联网和智能手机使用管理规定》，其中明确指出：无论干部战士，凡个人使用过的智能手机、笔记本电脑、iPad等电子产品都不能私自赠送、倒卖，确因年限过长、硬件损坏等原因无法正常使用的，必须经部队保密部门进行深度脱密处理后，才能自行处置。\n\n该部保密委员会还精心准备了一堂保密教育课：“我们使用智能手机收发信息和邮件、拍摄照片和视频，其中或多或少都会有涉军信息。这些我们认为已经删除的‘数据记录’，一旦被别有用心的敌特分子获取，经过信息恢复和整理，就可能提炼出敏感信息，挖掘出相关军事情报，造成失泄密。”\n\n报道指，这堂课刷新了大家对手机信息安全的认识，弹药分库四级军士长李合念原打算把自己使用过的智能手机邮回老家送给妹妹用。如今，他主动将手机上交保密办进行脱密处理。\n"
    },
    {
      "post_id": 52,
      "title": "RFI 法国继续禁止种植MON810转基因玉米",
      "date_published": 1460762437.624,
      "body": "4月15日，法国最高行政法院取消了在法国禁止种植MON810转基因玉米的决定。MON810杂交玉米种子是获批在欧盟种植的转基因作物之一。3月3日，欧盟委员会排除了法国可以种植MON810杂交玉米种子授权范围。但法国农业部仍禁止种植MON810转基因玉米。\n\n15日，法国农业部在一份声明中表示，尽管最高行政法院取消了禁止种植杂交玉米的决定，法国仍不允许MON810杂交玉米种子的种植。声明还表示，这是法国所持的“中止转基因作物在法国的露天试验”一贯立场的体验。因转基因农作物可产生的风险是不可否认的。\n\n法国农业部还表示，不论是长期还是中期来看，冒这份风险并不会带来长远或中期利益。\n\nMON810转基因玉米由美国孟山都公司研发，在自然生长过程中会产生一种名为BT的毒素，能杀死长期困扰农场的害虫玉米螟，从而使农户省下喷洒农药的成本开支。不过，这种玉米的安全性一直是科学家以及法国乃至欧洲民众争论的焦点。\n\n2008年，法国政府声称这种玉米对“动植物存在不利影响”，暂停了它在国内的种植，三年后，法国最高行政法院判决这项禁令无效；2012年3月，法国农业部等机构再次声明暂停这种转基因玉米的种植，2013年8月，法国最高行政法院再度判决这项禁令无效。法国农业部长斯特凡纳·勒福尔在接受媒体采访时表示，不管最高行政法院的决定如何，法国政府保持一贯立场，即不支持转基因作物。\n\n法国对转基因作物的敌视由来已久。不少法国人认为，转基因技术虽然能提高作物产量或增强作物的抗病虫害能力等，但可能会对环境和人类健康造成不良影响。法国在转基因作物的种植和研究上也不占任何优势，因此一直反对新的转基因产品进入欧盟市场。\n\n除法国外，奥地利、保加利亚、波兰、德国、卢森堡、希腊、匈牙利和意大利也曾禁止种植MON810转基因玉米。\n"
    },
    {
      "post_id": 51,
      "title": "DW 德语媒体：“这些数字当然不准确”",
      "date_published": 1460761798.861,
      "body": "（德国之声中文网）本周五，中国公布了2016年第一季度的经济增长数据，这引起德语媒体的纷纷关注。不过，《每日镜报》（Der Tagesspiegel）首先表达了对数据真实可靠性的怀疑。文章开篇带着讽刺的口吻写道：\"北京的国家统计局总是那么值得信任。周五上午10点整，和以往每次一样，该机构准时公布了最新经济增长数据。然而，不仅公布的时间，连公布的内容都是人们事先完全可以预料的：2016年第一季度6.7%的增长率与政府原先设定的目标分毫不差。\"\n\n作者接着指出，尽管去年中国外贸总量骤降，股市连续动荡，人民币也倍受压力，但是国内生产总值增长率的变化始终维持稳定的步伐：去年四个季度分别是7.0%、7.0%、6.9%和6.8%，然后再到今年第一季度的6.7%。\"这种极为平缓的减速过程放出的信号是：别慌，一切都在我们掌握之中，硬着陆不会发生。\"\n\n越来越多的专家，包括中国经济学家，都已经不再相信官方的经济增长数据。而宏观经济研究者王福重则直接了当地对《每日镜报》表示：\"这些数字当然不准确。\"文章援引这位知名财经评论员写道：\"去年中国的经济增长率应该是在5%左右，而不是官方宣称的6.9%--业界不少其他分析人士也认同这一估计。王福重认为，政府多年来一直在系统性地对统计数字进行'润色'。'如果经济状况不佳，政府也不希望公布糟糕的数据'。相反，在经济繁荣时期，为了不引起人们的过分激动和过高期望，当局还有可能会把增长率改低。\"\n\n最大的问题在于，国家统计局是政府机构，肯定会不遗余力地完成高层下达的指标。\"只有独立的研究机构才能够提供可靠的经济统计数据。\"\n\n中国经济\"感冒\"，世界也要\"打个喷嚏\"？\n\n既然官方统计数据不可信，那么为什么各国财经人士、媒体还是如此关注北京方面每次发布的经济增长率呢？《南德意志报》发表文章指出，中国经济的变革对于全世界的企业和政府来说具有重要意义：\"不计其数的国家对中国经济有很强的依赖性，德国就是其中之一：对于德国企业来说，中国已经是仅次于美、英、法的第四大贸易伙伴。德国的汽车公司向远东地区销售数以百万辆计算的汽车，众多德国中小企业也把自己的机械和设备出口到中国。\"\nElektroofen im Edelstahlwerk Shanghai im Baosteel\n\n钢铁产业存在严重的产能过剩\n\n接下来作者指出了中国经济在尚可的统计数字背后存在的隐患：\"这个国家目前所面对的许多问题，是结构性的问题，并非一朝一夕可以解决。中国经济的迅速增长虽然带来了生活的日益富裕，但是在很多领域，中国的大型企业都出现了严重的产能过剩。仅仅在钢铁产业就有大约130万人面临失业，而在煤炭产业，至少也要削减50万个岗位。\"\n\n而中国经济的疲软，逐渐走低的增长率数字，对于世界来说究竟意味着什么呢？《南德意志报》记者指出：\"中国经济走弱，对于那些原材料出口大国来说会造成格外惨痛的损失，比如巴西和俄罗斯。中国的高速经济增长也造成了石油和天然气市场需求的不断攀升。而前一段时间石油价格暴跌，中国经济疲软也至少是原因之一。\"\n\n摘编自其他媒体的内容，不代表德国之声的立场或观点\n"
    },
    {
      "post_id": 50,
      "title": "DW 澳总理赞邓，促中国继续开放",
      "date_published": 1460761763.206,
      "body": "以政府首脑身份首次访华的澳大利亚总理特恩布尔赞扬已故中国领导人邓小平，敦促中国继续向外部世界开放。\nChina Li Keqiang empfängt Malcolm Turnbull\n\n（德国之声中文网）澳大利亚总理特恩布尔（Malcolm Turnbull）在其访华之行的第二天表达了对互联网自由和外国企业在中国市场获得机会的关注，敦促中国继续发扬已故领导人邓小平的精神，继续对外开放路线。\n\n在中国经济增长速度明显放缓的背景下，特恩布尔以政府首脑身份对中国所作的首次访问由一个千名工商人士组成的代表团陪同，创下历届澳大利亚最大官方访华阵容。中国经济对澳大利亚国内就业市场具有举足轻重的意义。\nMalcolm Turnbull\n\n特恩布尔\n\n在被问及中国新近出台电子商务新登记法及强化对互联网监控、以及中国国内总的人权问题时，特恩布尔周五（4月15日）在北京表示，澳中两国在权益问题上有着定期的和坦率的讨论。\n\n特恩布尔昨天在访华首天访问了上海，宣布澳方将很快在上海成立一个为澳、中企业之间合作服务的业务基地。此后他前往北京，与中国总理李克强出席了两国总理年度会晤。周五，特恩布尔和中国政府副总理汪洋共同出席了中澳工商界首席执行官圆桌会。特恩布尔称，澳中关系进入全面快速发展轨道，愿与中方共同努力推动两国经贸合作的更大发展。\n\n特恩布尔周五对记者表示，正如他日前在上海已说过的那样，“中国越开放就越强大，这是真理”。他称，邓小平曾说过，向世界开放的时候，中国就强，闭关锁国时就弱。他强调指出，是邓小平在30多年前开启了中国历史性的经济改革。\n\n最为世界第二大经济体的中国正试图实现以消费为引擎的经济转型。\n\n根据中国官方今天公布的统计，今年首季，中国经济增长率为6.7％，虽符合预期，但创下7年来最低纪录。\nChina Li Keqiang empfängt Malcolm Turnbull\n\n中澳两国总理检阅军事仪仗队（2016.4.14）\n\n特恩布尔称，李克强总理日前在会晤时告诉他，中方将给予中小企业领域开拓新商务的自由。他指出，一个强大的中国经济会使大家受益。\n\n中澳两国经贸关系密切，去年年底，两国签订了双边自贸协议。不过，在安全事务上，堪培拉是华盛顿的亲密盟友。特恩布尔今天表示，所有涉及南中国海的主权争议都应由各有关方面以和平方式解决。相关海域是国际最重要通商路线之一，商品年输送量约为５万亿美元。除中国对南海提出几乎全部主权要求外，菲律宾、越南、马来西亚、文莱以及台湾等国家和地区也分别提出对南海的部分主权要求。\n\n特恩布尔今天表示，“该地区经济取得的巨大成就，每一个国家，包括我们自己，当然也包括中国在内所取得的成就，都是建立在和平与稳定的基础上的，任何会潜在破坏和平与稳定的行为都违背所有各国的利益”。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 49,
      "title": "DW 维权律师葛永喜因评论“巴拿马文件”被短拘",
      "date_published": 1460761730.744,
      "body": "根据推特等网络社交媒体的消息，中国维权律师葛永喜本周五曾一度被中国警方带走，据称原因是他在社交媒体上对涉及“巴拿马文件”的中国领导人发表的讽刺性评论。最新消息显示，葛永喜目前已获释放。\nPanama Papers Mossack Fonseca\n\n巴拿马文件涉及至少8名现任和前任中国政治局常委的家人\n\n（德国之声中文网）署名\"欧彪峰\"的推特用户于周五（4月15日）晨间发布了据称是律师葛永喜微信帐号的截屏。上面的文字信息显示葛永喜称\"公安局突然上门，不知道什么目的，请关注。\"\"欧彪峰\"表示，有消息传出5名警察曾闯入葛永喜家中，讯问他是否在网上发了关于 巴拿马文件的内容。随后葛永喜被警方带走，其私人电话虽然能够拨通，但却无人接听。\n\n随后据包括\"iY自由港\"的多个推特帐户报道，葛永喜律师已经于15日晚间获释。并公布了和朋友们在佛山盐布派出所门口的合照。\n\n在名为\"葛永喜律师\"的推特帐户上，可以看到目前尚保留的两个与\"巴拿马文件\"有关的贴文。一个是三个小和尚分别捂嘴、捂眼和捂住耳朵的照片，配图文字为：\"'巴拿马文件'之后，接下来的反腐怎么搞？\"第二个推特发贴则分别用图片和文字的形式罗列了百度搜索、谷歌、维基百科以\"巴拿马文件\"为关键词的搜索结果页面截屏，以及中国外交部和新华社对\"巴拿马文件\"的相关反映和报道。\n\n    【公安以“公然侮辱他人”为由对葛永喜律师传唤24小时】图为葛永喜律师在微信发布的图片 pic.twitter.com/JkdvjHNgHu\n    — 中國維權律師關注組CHRLCG (@chrlcg) 2016年4月15日\n\n\"摸着石头原来是过巴拿马河\"\n\n另外据推特用户\"中国维权律师关注组CHRLCG\"的消息，葛永喜律师曾在个人微信帐号上转发了一个象征江泽民、习近平和邓小平赤身过河的经过后期处理的照片，邓小平在照片上的繁体字配词为\"巴拿馬的河水真的好深！\"。习近平的配词是：\"唔怕，我有姐夫！\"，而张开大嘴的江泽民则被配以\"好易浸死㗎！\"的文字。据香港苹果日报4月15日报道，这是网民恶搞巴拿马文件 涉案中国领导人的照片。使用的其实是邓小平在北戴河游泳的照片，原片背景有沙滩、建筑物。邓小平的身后两人原来是他的保镖。据称葛永喜律师对图的评论是：\"摸着石头原来是过巴拿马河\"。\n\n推特用户\"中国维权律师关注组CHRLCG\"还公开了据称是佛山市公安局南海分局向葛永喜家属开具的\"被传唤人家属通知书\"的照片。其中显示，中国当局以\"涉嫌公然侮辱他人\"为由，于4月15日将葛永喜传唤到盐步派出所接受调查。\n\n葛永喜律师为广东安国律师事务所执业律师，曾代理包括 \"广州三君子\"、 \"新公民运动\"在内的多起人权案件。在中国当局于2016年初 逮捕4名广东劳工维权活动人士的过程中，葛永喜曾受家属委托担劳工维权人士的代理律师。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 48,
      "title": "BBC 楼继伟：评级机构调低中国评级展望有偏见",
      "date_published": 1460761647.352,
      "body": "中国财政部长楼继伟周五（4月15日）在华盛顿的一场记者会上表示，国际信用评价机构调低对中国主权信用评级的展望，并不能反映中国经济的实际情况。但他指国际货币基金组织（IMF）调低中国长期经济预期有一定“逻辑性”。\n\n两家国际评级机构穆迪和标普在今年3月先后下调中国主权信用评级展望，由稳定下调到负面。穆迪和标普指出中国政府债务上升，经济再平衡的推进速度可能不如预期。\n\n楼继伟在国际货币基金组织（IMF）总部出席G20财长和央行行长会议后的记者会时对此回应说：“是的，地方政府债务增加，但是我们已经采取了措施，在控制住这种增加的趋势。中国的中央政府债务水平并不是高，我们现在增加中央政府的债务，目的是使得全社会都不能减债了，当然这要通过改革来进行。”\n\n媒体报道中国正酝酿推行“债转股”政策，将企业对银行的负债转化为银行对企业的股权，以此处理企业不良资产。\n\n但楼继伟说目前这项措施“在政府内部讨论中并没有拿出可以立即实施的方案”。\n\n在周四的一场记者会上，中国央行行长周小川在华盛顿同样表示“债转股”的细节还在讨论中。但周小川说：“债转股”是为了减轻已经过高的企业杠杆，主要针对大型企业，包括国企和混合所有制企业，而非杠杆并不高的中小企业。\n\n“评级机构恐怕不太清楚我们正在酝酿这些改革，所以我也不怪他们。因为他们不清楚嘛，”楼继伟说：“国际社会\"历来质疑\"这些国际评级机构。”\nImage caption 此前，穆迪和标准普尔纷纷下调中国展望评级。\n\n楼继伟指中国主权债的市场表现绝大多数时间都高于这些评级机构给出的标准。\n\n“这说明（评级机构）有偏见，”他说：“我希望评级机构可以对评级国家进行沟通，更加全面深入地了解国家经济发展的状况和政策举措，作出更多公正的评价。”\n\n此外中国政府最新公布今年第一季度GDP增长为6.7%。楼继伟指这个数字比去年同期略有下降，但是预期之内，“我们今年预期的目标就是6.5%到7％，而去年是7%左右。本来我们就没有把目标预想那么高。”\n\n在周二发布的一份报告中，国际货币基金组织（IMF）调高了对今明两年中国经济增长预期，但调低了长期中国经济增长预期。对此，楼继伟说IMF“有他们考虑的逻辑性”。\n\n他说中国正在加快进入老龄化社会，是中国经济面临的诸多不利因素之一。\n\n“单考虑一点老龄化比较快的到来的话，今后的增长的就不是很乐观，”楼继伟说。\n\n但是他说中国经济在实施供给策结构性改革，包括放宽金融管制（deregulation），对价格扭曲的矫正，以及推动生产要素更为自由地流动，这“对于资源配置的改善，增长率的提高，是会有长期的效果的。”\n\nG20财长和央行行长在华盛顿后发布公报，指G20成员国将继续采取行动增强国际货币体系的稳定性和韧性，措施包括在2017年IMF年会前完成第15次份额总检查，形成新的份额公式，提高新兴市场和发展中国家的份额占比。\n\n在今年1月，IMF刚刚完成一次份额改革，将中国的投票权份额从3.8%提升至超过6%，让中国的投票权从第6位提高至第3位，仅次于美国和日本。\n\n同时G20财长和央行行长会议公报还指出各国“支持对可能扩大SDR（特别提款权）的使用进行研究。”\n\n楼继伟在记者会上并未对进一步推进IMF投票份额权改革和扩大SDR使用作出解释。\n\n（责编：欧阳成）"
    },
    {
      "post_id": 47,
      "title": "BBC 观察：华人诈骗集团触手伸向发展中国家",
      "date_published": 1460761606.987,
      "body": "肯尼亚（也称：肯亚）诈骗案不只挑起台湾与中国大陆的敏感神经，许多观察人士对诈骗“境外移转”到发展中国家感到讶异。\n\n肯尼亚案之所以受到瞩目，除了因为这是中国首次跨境在第三国强行逮捕台湾人外，也是华人诈骗集团在非洲被破获的最大案例。\n\n这些电信诈骗集团首先这些国家，部分原因是这些国家国内的政局和民生常稳定，对于犯罪等无法有效遏止。 其次是这些国家的司法体系多半不成熟，时常因为搜证与侦办上没有成熟的能力，让很多案件无法进展。\n\n另外，这些国家太偏远且信息能力弱。由于是用国际电话的科技犯罪，让这些发展中国家的信息能力常常无法有效锁定犯罪集团，大大加深了办案难度。\n“已成熟的模式”\n\n过去诈骗在台湾，曾经是这个岛屿在经济起飞时常常看见的手段。 早期有所谓的“金光党”，将伪造的金块随意放置路上，利用不知情的人民捡到后想据为己有的心理，然后诈骗份子佯装路人跳出来想“五五分帐”。\n\n趁着被害人还搞不清楚状况时，诈骗份子提出建议要被害人给他等同黄金价值一半的现金，要被害人自己去银楼典当黄金。 等到被害人拿着原先的伪黄金去典当时，才被老板告知“是假的”。\n\n随着时代演进，陆陆续续出现其他种方式的诈骗，而在 2000 年后，手机开始成为台湾人的必备用具，电信诈骗也随之兴起。\nImage caption 此次肯尼亚（也称：肯亚）事件在台湾引发巨大争议和反思。\n\n台湾最常见的电信诈骗，以诈骗份子“假绑票”、“假受伤”、“假退税”、“假中奖”或是“假援交”等居多。 根据台湾警政署数据，台湾诈骗的高峰是在2006年，总额高达台币186亿（约合5.8亿美金）。\n\n当时许多的电话机房都设在中国，不只大多数台湾人被骗，也让台湾的诈骗手法开始“外销”到中国大陆，但也因此开启了两岸警方合作打击诈骗的模式。 随着两岸合作频繁，中国沿岸大量的机房被取缔，台湾的诈骗案开始减少，台湾政府也大力宣传，民众对于诈骗手法警觉性大增。\n\n当台湾人已经不太容易受骗，中国大陆的机房又被严格取缔下，大部分的诈骗份子就将阵营转移到这两国以外，开始在泰国、印度尼西亚、菲律宾等地，最后又开始朝非洲国家下手，设置机房跟集团。\n两岸打击犯罪界线\n\n虽然犯罪集团挑中这些发展中国家，但这回的肯尼亚案，最受争议的也是在中国当局“跨境逮人”的行为，而中国当局也在稍后声称这样的行为“符合一中原则”，在台湾的政界引起争议。\n\n两岸自从 2009 年 4 月底签署“海峡两岸共同打击犯罪及司法互助协议”后，即展开一连串的引渡以及共同打击犯罪。。 其中在第三章“司法互助”第11条中，双方要基于“人道、互惠”，在双方均同意下，接返受刑事裁判确定人。\n\n而在这次的肯亚案中，台湾嫌疑人是在双方还没有达成共识前，人就先一步被中国官方带走，也让许多台湾人相当诧异。 批评者认为，台湾许多经济罪犯至今潜逃中国大陆，始终抓不回来，但是在肯尼亚案里中方的态度，显然已经不合以往两岸的协议。\n\n中方现在始终认为所作所为“符合一中原则”，甚至要犯人在中央电视台前“忏悔认罪”，“对不起大陆同胞”外还“愿意接受一切法律制裁”。 而官方媒体《环球时报》14日也认为由中国移送“完全合情合理”，甚至该报社论也批评台湾“请给自己留点脸”。\n台湾持续争论不休\nImage caption 台湾法务部长罗莹雪在肯亚案发生后，曾在 13 日发言“跟世界各国相比，台湾的刑法刑度确实比较低”。\n\n台湾法务部长罗莹雪在肯亚案发生后，曾在 13 日发言“跟世界各国相比，台湾的刑法刑度确实比较低”。 台湾立法委员、律师出身的顾立雄15日也引述台湾法条，电信诈欺的刑度为“一年以上、七年以下”有期徒刑，依法不能易科罚金。\n\n而且依“一罪一罚”（骗一人、罚一次）最重可合并执行30年有期徒刑，已是台湾仅次于无期徒刑、死刑的重刑。 同时台湾刑法的「没收」新制，亦可“将诈骗所得全部收归国有，还能进一步向知情的第三人追索”。\n\n顾立雄就质疑罗莹雪不应该身为首长“轻率发言”台湾刑度不够重或是只有“易科罚金”等，也不该在嫌疑人判定罪前就“有罪推定”该批人。\n\n肯尼亚案发生到现在，不只面临的是两岸过去的司法信任危机，也再度唤起台湾人过去诈骗集团的横行的记忆。 而不论这批人是否真的涉案，台湾人普遍对于诈骗的反感，依旧可以在舆论中看见；而中国“跨境逮人”是否合理，也将是两岸持续协商的关键。\n\n（责编：欧阳成）"
    },
    {
      "post_id": 46,
      "title": "BBC 巴拿马文件：普京为提及《南德意志报》有误致歉",
      "date_published": 1460761564.488,
      "body": "俄罗斯总统普京昨天因为误称德国报纸《南德意志报》(Sueddeutsche Zeitung)为美国银行高盛所拥有而道歉。\n\n普京是在周四电视电话讨论中作出上述表示的。\n\n事情的缘由是谁对公布所谓的巴拿马文件负责的问题。这些文件被泄漏给了《南德意志报》，文件暴露了大规模的国际避税行为。\n\n克里姆林宫为此发表了道歉，普京说他被助手误导。\n\n克里姆林宫发言人佩斯科夫（Dmitry Peskov）对记者说，“这是更多要归咎于那些准备汇报文件的人，也就是我。”\n\n“这些信息没有被核查，没有重复检查，我们就把它交给了总统。我们已经（对那家银行）道歉，我们还要为发表这个言论道歉。”\n\n巴拿马文件包括了许多被指参与避税行为的人的名字，也曝光了许多同普京关系密切的人拥有的离岸公司。\n\n普京否认这些被揭露的行为有“任何腐败成分”，他说反对他的人试图利用此在俄罗斯制造不稳定。\n\n《南德意志报》同包括BBC在内的许多媒体和出版商分享了巴拿马文件。\n\n(编译：横路；责编：欧阳成)"
    },
    {
      "post_id": 45,
      "title": "BBC 马来西亚将20名涉电话诈骗台湾人送回台湾",
      "date_published": 1460761441.675,
      "body": "马来西亚星期五（4月15日）将20名涉嫌电话诈骗的台湾籍人士遣返回台湾，尽管北京要求将这些人送到中国。\n\n马来西亚一名官员说，被中国通缉的另外32名涉嫌电话诈骗的台湾人也将被遣返台湾。\n\n马来西亚警方逮捕了119名电话诈骗嫌疑人，其中包括52名台湾籍人士。\n\n台湾外交部星期五晚上在一份声明中说，涉嫌电话诈骗而在马来西亚被拘押的20名台湾人已经登上一架飞往台湾的飞机。\n\n马来西亚官员推迟了飞机的起飞，说他们仍在等待司法批准，但是台湾外交部说，星期五下午，飞机得到准许后已经起飞。\n\n台湾星期五发表的声明说，台湾官员积极参与会谈，向马来西亚方面施加压力，要求把另外32名台湾嫌疑人送回台湾接受调查。\n\n美联社报道，星期五晚上，马来西亚一名官员说，马来西亚已决定把嫌疑人送回各自的国家，依法接受处理。报道，这名官员没有透露姓名因为他没有得到授权接受媒体采访。\n争议\n\n近期电信诈骗案台湾籍疑犯被押送至中国内地的事件所引发的两岸司法权限争议仍在持续。\n\n较早前，45名涉嫌诈骗的台湾人被从肯尼亚押解至中国内地，台湾立法院也在周五（4月15日）发表声明抗议中国当局侵害人权和台湾的司法主权。\n\n中国声称对45名台湾疑犯有执法权，理由是他们诈骗行为当中的受害者是中国大陆人。\n\n台湾批评肯尼亚侵犯了台湾人民的法定权利，也认为中国大陆没有遵守两岸默认互不干涉司法的共识。\n\n中央社报导，台立法院在周五进行朝野协商后发表声明，指海外犯罪的台湾人应遣返台湾审判，“即使涉及管辖权竞合，也应透过协商方式，依相关国际法原理原则予以解决”。\n\n声明指中国当局以强制手段将台湾疑犯押至中国的做法侵害了基本人权，“徒增台湾社会对中国大陆的负面观感”。\n\n台湾法务部、陆委会及刑事局等单位已经确定派出协商团前往大陆就肯尼亚案进行协商，中国大陆方面也已经同意。\n\n（编写：列尔/董乐 责编：董乐）"
    },
    {
      "post_id": 44,
      "title": "BBC 悉尼大学华裔教员公开辱华惹争议",
      "date_published": 1460761410.721,
      "body": "澳大利亚籍华裔教员吴维在微博上发表歧视中国和中国学生的言论，引发多方关注。\n\n据新浪微博号“澳洲事儿”报料，澳大利亚悉尼大学商学院华裔教员吴维在微博上公开发表针对中国、中国留学生的种族主义言论，并发布焚烧自己中国护照过程的视频。\n\nBBC中文网北京时间周五（4月15日）晚九时左右察看微博，吴维的帐号@Pekojima疑似已被删除。\n\n据此前被发布的截屏显示，他自称澳洲公民，悉尼大学拿商学院全奖就读金融系博士学位，同时任教本系必修课，担任head tutor，通晓“你国语”、英语、日语。\n\n据称，此人屡次表达对澳大利亚的热爱之外，也非常推崇日本，经常贬低中国，侮辱留澳中国学生，称其为“留学豚（猪）”。\n\n吴维的言论引起澳洲中国学生的强烈反应。\n\n悉尼大学商学院学生发起网上请愿活动，谴责他的做法，认为“伤害了国际学生社群，直接违悉尼大学工作人员守则”。\n\n中国网友在“澳洲事儿”微博帖子下发布了数百条评论，很多人对他的言论表示愤慨，也有人质疑他的地位。\n\n网友“WRyeoL”说：“这还真是自己人打自己人啊，真是出了国际笑话了，中国人能不能团结点！？即使换了国籍，也别忘了自己曾是中国人，自己祖先是中国人”。\n\n加V微博号“赖凯涛博士”评论说，这人只是在校博士兼职做tutor而已，是助教，相当于中国大学的辅导员，根本算不上正规编制的职员和教职工，就算是博士后有研究员的正职，没有资格带研究生的斗没有资格称呼为“导师”。\n\n消息传来，不仅中国一些媒体在微博上转发，也吸引了澳洲一些媒体的报道。\n\n英国《每日邮报》澳洲版报道，悉尼大学商学院院长格雷戈·惠特维尔证实，正在就此事展开调查。\n\n（编写：张泳，责编：董乐）"
    },
    {
      "post_id": 43,
      "title": "VOA 前藏族政治犯称中国对藏族汉化儿童教育开始",
      "date_published": 1460761335.518,
      "body": "2014年被记者无国界(Reporters Without Borders)评为“100位新闻自由英雄”之一的果洛久美(Golog Jigme，又名久美嘉措)在位于华盛顿的国际声援西藏运动(International Campaign for Tibet)表示，中国政府对西藏境内藏人的汉化体现在不同年龄层次孩子的教育中。\n\n他说，中国政府对藏人儿童、青少年有明确的汉化政策。他尤其强调，很多藏人即使文化水平足够也没有机会上大学，被送至“职业学校”。然而，即便在“职业学校”，他们学习的也是十分有限的技能，甚至与日后就业没有干系，不足以帮助他们成功就业。\n\n果洛久美认为，这些政策为的是创造出一代对藏族文化了解甚少、知识文化水平有限、技艺匮乏的藏人。\n\n果洛久美其人\n\n2008年，他因为协助拍摄纪录片，访问西藏境内藏人对中国政府的看法被捕入狱。2014年流亡印度，最终驻留瑞士。\n\n这位藏族僧人说，他在2007年以前一直致力于和年轻一代工作，通过教课、读书来保护藏语和藏族文化。\n\n2007年，他与另一名制片人开始探讨拍摄一步纪录片，采访西藏境内藏人，将他们对达赖喇嘛、中国政府以及举办奥运会的看法呈现出来。《不再恐惧》(Leaving Fear Behind)得到了国际上的关注，而两位制片人也在之后被捕入狱。\n\n据国际声援西藏运动2014年对果洛久美的采访称，他在经历两次被捕、狱中虐待折磨后，最终流亡印度。\n\n离开西藏后，果洛久美参与过多次联合国听证。"
    },
    {
      "post_id": 42,
      "title": "VOA 奥巴马夫妇2015年缴八万多美元联邦税",
      "date_published": 1460761272.87,
      "body": "华盛顿—\n\n在4月18日报税截止日到来之前，美国总统奥巴马夫妇公布了自家2015年的报税情况。他们在2015年缴纳的联邦税为八万多美元。\n\n白宫星期五（4月15日）下午公布了美国总统奥巴马和第一夫人2015年的报税单。总统一家去年的调整后毛收入为436,065美元，缴纳联邦所得税81,472美 元，实际所得税率约为18.7%。\n\n他们将收入的约14.7%捐赠给了34个不同的慈善机构，总共捐款64,066美元。夫妇二人还向伊利诺伊州缴纳了16,017美元的州所得税。\n\n白宫说，由于奥巴马签署生效的一项对中产阶级扩大减税的法案，总统受到对高收入者的税收优惠限制。白宫同时呼吁封堵那些让富人收益的税收漏洞。\n\n白宫还公布了副总统拜登及其夫人的报税表。他们申报的2015年的调整后毛收入为392,233 美元，缴纳联邦税91,546美元，实际所得税率约为23.3%。他们2015年的慈善捐款为6,620美元。\n\n拜登夫妇向德拉瓦州缴纳了13,729美元的州所得税，拜登还向维吉尼亚州缴纳了3,882美元的州所得税。\n\n美国申报上一年个人所得税的截止日通常是每年的4月15日，但是今年是在18日。因为星期五这天是首都华盛顿的公共假日“解放奴隶日“（Emancipation Day），所以报税截止日顺延至星期一。\n\n不过，“解放奴隶日”通常是每年的4月16日，但是今年的这一天落在周六，因此，假日就往前挪了一天。\n\n无论如何，对那些“临时抱佛脚”的人来说，他们多了一个周末的时间可以用来准备税表。"
    },
    {
      "post_id": 41,
      "title": "BBC 澳大利亚新总理首次访华避谈南海",
      "date_published": 1460720821.897,
      "body": "澳大利亚新任总理马尔科姆·特恩布尔（Malcolm Turnbull）周四（4月14日）从上海开始首次访华之旅。\n\n在中国的金融中心上海，特恩布尔对商界领袖发表了演讲。他高度评价去年签署的中澳双边自贸协定，称其为澳大利亚出口提供了重要的新商机。\n\n澳大利亚1/3的出口来自中国市场。中国当前经济放缓对来自澳大利亚的铁矿石、煤炭以及其他资源型产品造成巨大损失。\n\n去年，澳大利亚和中国的双边贸易额达到1150亿美元，但同比下降6.3%。\n\n特恩布尔此行有超过一千名商界高管陪同，英国《金融时报》（FT）将之称为“澳大利亚有史以来最大的贸易使团”。\n\n特恩布尔称，虽然中国经济增速放缓给澳大利亚经济带来巨大冲击，但澳大利亚正试图从中国刺激消费增长的措施中寻找机会。\n\n“中国经济正朝着消费拉动的方向转型，我们将抓住其中的巨大机遇。”特恩布尔办公室提供的一份演讲稿称。\n\n根据中澳自贸协定（ChAFTA），中国将最终免除几乎所有进口澳大利亚商品的关税。特恩布尔特别指出，澳大利亚的牛肉、牛奶、樱桃、小龙虾以及红酒等产品会从中受益良多。\n\n这项协定针对来自澳大利亚服务业的从业人员，如律师、教育业者以及金融人才放宽就业限制，同时鼓励中资公司如宝钢、光明食品以及房地产商绿地集团等到澳大利亚投资。\n\n中国还是澳大利亚最大的旅游市场，每年有超过100万中国游客到澳大利亚旅游。\n\n特恩布尔称，澳大利亚还将为本国出口商进一步采取贸易便利措施，包括在上海建立一座“降落场”，为澳大利亚商人提供从场地到专业技能的服务。\n\n但他没有提到南中国海争议问题。作为美国的亲密盟友，澳大利亚政府在最近的一份报告中批评了中国在这一争议海域采取的行动。\n\n中国政府对这一批评反应强烈，称澳大利亚应该在中澳贸易关系和澳美安全关系之间寻找平衡。\n十年期签证\n\n最新消息称，特恩布尔在北京透露，澳大利亚将首次针对中国公民开放十年期签证，以吸引更多中国游客刺激本国旅游业。\n\n澳大利亚同时还将首次提供中文及在线签证服务。\n\n法新社称，目前还难以评估这项措施是否会产生互利互惠的效果。\n\n特恩布尔周四晚些时候还和中国总理李克强在北京一起出席了力拓集团（Rio Tinto）和中钢集团（Sinosteel）合资项目的签约仪式。\n\n澳大利亚是发达经济体中少数几个对中国保持贸易顺差的国家。澳大利亚向中国出口大量的资源型原材料。\n\n（编译：川江 责编：萧尔）"
    },
    {
      "post_id": 40,
      "title": "BBC 马来西亚逮捕52名涉电信诈骗的台湾人",
      "date_published": 1460720791.239,
      "body": "马来西亚警方逮捕的119名涉嫌电话诈骗的疑犯中包括52名台湾籍人士，台政府正试图协调要求将他们遣返至台湾。\n\n被捕人士还包括超过60名中国大陆籍人士。台湾中央社报导指，台湾外交部驻马来西亚代表处正与大马当局协调，帮助办理台籍人士返台。\n\n中央社确认案件由中国大陆和马来西亚合办，涉案的台湾疑犯仍身在马来西亚。\n\n目前未证实中国大陆方面是否要求将台湾疑犯押送回中国内地。\n\n近期电信诈骗案台湾籍疑犯被押送至中国内地的事件所引发的两岸司法权限争议仍在持续。\n\n较早前，45名涉嫌诈骗的台湾人被从肯尼亚押解至中国内地，台湾立法院也在周五（4月15日）发表声明抗议中国当局侵害人权和台湾的司法主权。\n\n中国声称对45名台湾疑犯有执法权，理由是他们诈骗行为当中的受害者是中国大陆人。\n\n台湾批评肯尼亚侵犯了台湾人民的法定权利，也认为中国大陆没有遵守两岸默认互不干涉司法的共识。\n\n中央社报导，台立法院在周五进行朝野协商后发表声明，指海外犯罪的台湾人应遣返台湾审判，“即使涉及管辖权竞合，也应透过协商方式，依相关国际法原理原则予以解决”。\n\n声明指中国当局以强制手段将台湾疑犯押至中国的做法侵害了基本人权，“徒增台湾社会对中国大陆的负面观感”。\n\n台湾法务部、陆委会及刑事局等单位已经确定派出协商团前往大陆就肯尼亚案进行协商，中国大陆方面也已经同意。\n\n（编写：列尔 责编：萧尔）"
    },
    {
      "post_id": 39,
      "title": "BBC 深圳警方：香港理工英籍教师\"因情感纠纷\"被杀",
      "date_published": 1460720752.925,
      "body": "深圳南山警方周五（4月15日）在官方微博上公布，香港理工大学英籍导师鲍尔（Hilary Bower）的谋杀案，已拘捕三名疑犯，其中包括死者的同居女友徐某。\n\n警方指，徐某是死者同居17年的女友，因“情感纠纷”心生不满，联同两名疑犯将其杀害。其余两名疑犯是男性，分别28岁和23岁，三人都是湖北咸宁人。\n\n三人在4月8日被捕，而深圳南山警方将会继续调查事件。\n\n香港传媒报道，鲍尔常在香港、深圳两地通勤。鲍尔情感生活复杂，在中国内地有多名女友。死者在3月22日失踪，他的另一名女友八天后到香港报警。\n\n《南华早报》报道，报警的这名女友名叫Shi Xiumei，两人育有一名六岁的儿子。\n\n香港传媒在四月初开始报道鲍尔失踪一事。由于死者早前以900万元的价钱售出名下的一个蛇口单位，死者好友理查‧查尔斯（Richard Charles）曾对传媒指，鲍尔失踪一事可能与交易有关。\n\n据理工大学的网页，鲍尔已在理大执教廿年，并曾在内地，韩国，泰国，西班牙和科威特教学。"
    },
    {
      "post_id": 38,
      "title": "BBC 维权律师葛永喜“因巴拿马文件”被警方带走",
      "date_published": 1460720708.533,
      "body": "中国维权律师葛永喜星期五（4月15日）在广州被警察从家中带走。\n\n一名帮助葛永喜家人的律师向BBC记者透露，他是在午夜被带走的，警方没有给出任何解释。\n\n葛永喜被带走后，他的家人一直无法见到他。\n\n这位帮助葛永喜家人的律师表示，葛永喜被带走可能与他在社交网站推特上发表的评论“巴拿马文件”的帖子有关。\n\n巴拿马律师事务所莫萨克·冯赛卡（Mossack Fonseca）遭泄露的文件显示，至少7名中国现任和前任领导人的家人与这家巴拿马公司所设立的离岸公司有牵连，包括中国国家主席习近平和另两名领导人。\n\n拥有离岸公司在中国并不违法，但根据党章，中国共产党的官员应该“廉洁”，不能从以权谋私，他们的家属也不能从与高层的关系中获利。\n\n中国当局禁止在社交媒体上讨论被泄露出来的“巴拿马文件”。\n\n葛永喜毕业于安徽大学，现在是广东安国律师事务所律师。\n\n他曾代理过或者介入很多知名维权案件。去年当局禁止他出境。\n\n（撰稿/责编：董乐）"
    },
    {
      "post_id": 37,
      "title": "VOA 前美联储主席:中国政府有资源控制债务问题",
      "date_published": 1460720659.043,
      "body": "华盛顿—\n\n国际货币基金组织(IMF)近日对中国的企业债务问题发出警告。前美联储主席本·伯南克则认为，中国政府有资源应对债务问题。\n\n    前美联储主席：中国政府有资源控制债务问题\n\n中国央行副行长易纲在谈到企业债务问题时说，该破产的企业就该破产。不过，他又主张要循序渐进。\n\n国际货币基金组织4月13日发布的一份报告指出，中国目前面临的一大严重问题是企业债务，中国可能处于风险之中的银行对企业的贷款接近1.3万亿美元。\n\n前美联储主席本·伯南克华盛顿的一场活动上表示，中国的债务问题中存在一些“缓解因素”（ameliorating factors）。\n\n他说：“（中国）大多数的债务是人民币债务，因此不会有其他一些国家面临的汇率风险。其次，这些大多是由国内储蓄提供的资金，这也就意味着我们不会看到像上世纪90年代亚洲金融危机时期出现的资本出逃。”\n\n他还表示，中国政府拥有资源应对这个问题。\n\n在布鲁金斯学会举办的这场活动中参与讨论的中国人民银行副行长易纲表示，相比其他发展中经济体，中国的企业债务占GDP的比重较高。他在谈到解决办法时说： “我认为，解决办法是，需要有金融规则，让每一个企业和经济单位对自己的行为负责。如果破产，就让他们破产。”\n\n对于如何建立金融规则的问题，易纲说，中国仍要进行很多改革，包括加强破产法和简化破产程序等。不过他指出，降低企业债务要循序渐进，相关政策制定应当谨慎和纵观全局。\n\n伯南克表示，如果债务问题非常严重，导致对银行系统的信心被削弱，那么有时快速应对会更有效。\n\n易纲在活动上还表示，中国第一季度的经济表现良好，相关经济数据很快就会公布。"
    },
    {
      "post_id": 36,
      "title": "VOA 中国等威权主义政府国际化威胁民主发展",
      "date_published": 1460720539.933,
      "body": "华盛顿—\n\n在最近出版的一本新书中，多位专家学者探讨了近年来以中国、俄罗斯、伊朗等为首的威权主义国家对自由民主带来的挑战和威胁。美国之音记者与其中几名作者进行了交谈。\n\n在《威权主义全球化－民主的挑战》(Authoritarianism Goes Global - The Challenge of Democracy)一书的多位作者看来，浦志强等律师被捕、全球闹得轰轰烈烈的“巴拿马文件”从网上匿迹，以及中央指示媒体姓党等等都显示中国当局变得愈发专制。\n\n这本2016年出版的新书指出，也并不只有中国如此，包括俄罗斯、沙特阿拉伯、伊朗和委内瑞拉等在内的威权主义国家发展了新的工具和策略来牵制民主的传播，挑战自由的国际政治秩序。\n\n参与该书编辑工作的美国国家民主基金会(NED)研究与分析部副主任克里斯托弗·沃克(Christopher Walker)说，这些国家将其国内的镇压方式带上国际舞台。他以中国媒体对外宣传为例。\n\n他说：“我认为，由中国官媒生产的新闻内容现在也向中国以外的其他地方传播。你很少能听到有关西藏或台湾、或是精英阶层腐败的有意义的探讨。这提出了一个关于这些内容性质的真正问题，这些内容在很多地方被越来越多地使用。”\n\n近年来，中国在非洲、拉美、中东等许多国家投入大量资金，进行基础设施建设。沃克称，很多投资或援助与当地的精英阶层有关联，这其中有没有针对贪腐和公信力进行有效的监管是很大的问题。\n\n他说：“我认为这些是被提出的问题，也是一个更大问题的一部分，那就是中国和其他威权主义政权在全球化时代的参与是如何伤害或影响这些地方的民主发展的。 ”\n\n参与这本书的专家学者认为，在威权主义不断进击的同时，民主政权退却了，在应对威权主义带来的威胁方面失败了。"
    },
    {
      "post_id": 35,
      "title": "RFI 红色权贵藏富网络为何禁言？",
      "date_published": 1460688246.762,
      "body": "巴拿马密件曝光，全球140位政要及精英被点名，包括习近平主席在内的八名中共政治局常委或前常委的亲属也被点名。西方国家急忙调查，“清扫门户”，中方却急忙封锁新闻。\n\n中国外交部在记者追问下，终于打破沉默，指前面提到的都是些捕风捉影的消息。但话音刚落，列在『巴拿马档案』名单上的冰岛总理贡劳格松终于被迫辞职，让『环球时报』指称这一切都是“编出”的文件的说法不攻自破。在西方，涉嫌离岸公司藏富或漏税的人，不管地位多高，都得面临舆论监督或司法调查。\n\n国际记者调查同盟(ICIJ)披露的调查报告部分材料显示，中国至少八名政治局常委或前常委家人涉案：中国国家主席习近平姐姐齐桥桥和姐夫邓家贵 2009年在英属维京群岛注册两家基金公司；中共中央政治局常委张高丽和刘云山家族成员的名字也在名单上，他们都在包括英属维京群岛在内的“避税天堂”的 公司担任主管或股东；名单上还有前总理李鹏的女儿李小琳，她和丈夫在李鹏担任总理期间在列支敦士登注册了基金公司Foundation Silo；贾庆林外孙女李紫丹2010年获得一家 在维京群岛注册的公司Harvest Sun Trading，她同时也是另一家在该岛注册公司Xin Sheng Investments的单一股东；薄熙来的妻子谷开来在法国生意合伙人德维耶帮助下在维京群岛设立公司。国际记者同盟 2014年其实就公布过一份调查报告，被点名的中国权贵包括邓家贵、李小琳、温家宝的儿子温云松，彭真的儿子傅亮，邓小平的女婿吴建常，以及腾讯的马化 腾，乐视的贾跃亭等。\n\n巴拿马律师事务所莫萨克.冯塞卡密件披露几天来，一方面，法国、澳大利亚、西班牙等多国对本国涉嫌人员及公司下令展开司法调查，因已故父亲生前拥有离岸公司的英国首相卡梅伦则备受舆论压力，不断出面解释。而这些国家的媒体更是对相关新闻紧紧追踪不放。美国媒体大量报道巴拿马丑闻的同时，集中披露了本国617位涉案的“中间人代理”。与此形成对照的是，中国拼命屏蔽消息，中国与俄罗斯同时力图把这一事件说成是西方制造的阴谋。\n\n巴拿马档案引发的风暴震撼着全球，还在不断地发酵，还有许多材料正在陆续披露。不少观察家的看法是，在网络高速发展的时代，与其屏蔽，遮盖，不如公开、透明，越遮蔽，越引起人们的怀疑。\n\n您如何看巴拿马密件卷起的这场全球性风暴，北京当局为何还要封锁消息、屏蔽关键词？欢迎在法广“大家评说”发表看法。"
    },
    {
      "post_id": 34,
      "title": "BBC 美司法部起诉两名涉嫌窃取敏感技术华人",
      "date_published": 1460688035.582,
      "body": "美国司法部星期四（4月14日）发表声明，分别公布了涉及一名中国公民以及涉及一家中国公司和一名美籍华人的两起危害美国国家安全的案件。\n\n美国司法部的一份声明说，现年52岁的Fuyi Sun（别名Frank Sun）是中国公民，涉嫌参与一项在未经许可的情况下向中国非法出口主要用于宇航和军工领域的高等级碳纤维的活动。\n\n声明说，Sun前来美国同卧底特工会面，试图获得特殊的碳纤维，在星期三被捕。\n\n美国司法部的声明特别指出，这种碳纤维向中国出口必须得到出口许可。\n\n美国司法部高级官员卡林说，“这种碳纤维在宇航和国防领域具有多种用途，受到严格控制。Sun表示愿意支付一笔钱，避开美国的出口法律。”\n\n美国司法部的声明说，Sun已经在星期三晚上在纽约一家地方法院接受指控。\n特殊核材料\n\n美国司法部在星期四发表的另一份声明中说，美国田纳西一家地方法院星期四指控美国公民Szuhsiung Ho（别名Allen Ho）和中国广核集团（CGNPC）非法实施和参与在美国境外生产和发展特殊核材料的活动，而这样的活动需要事先得到美国能源部的授权。\n\n此外，Ho还受到在美国为外国政府从事特务活动的指控。\n\n美国司法部官员卡林说，Ho被控按照中国国有核能公司的指示，接近在美国的核专家，为在中国发展和制造特殊核材料提供帮助。\n\n他说，Ho在没有告知美国司法部的情况下为外国政府从事秘密工作，也没有得到美国能源部的授权。\n\n卡林还说，对那些企图逃避美国法律为外国获取敏感核技术的人提出起诉，是美国司法部国家安全局的首要任务。\n\n（编译：跃生 责编：欧阳成）"
    },
    {
      "post_id": 33,
      "title": "VOA 独家:胡耀邦之子澄清离岸公司注册地址之疑",
      "date_published": 1460687945.732,
      "body": "北京—\n\n已故中共总书记胡耀邦的三子胡德华再次就4月3日曝光的巴拿马文件引起的疑问作出回应，以证据表明其2003年离岸公司注册地址在英属维尔京群岛，而不是北京的胡耀邦故居。\n\n胡德华先生星期四对美国之音表示，他2003年实名开设的那家叫FORTALENT 的公司的注册地址，就是代办注册事宜的事务所在英属维尔京群岛的地址，而不是他在北京的住址。\n图中的Fortalent公司注册地址一栏显示英文的英属维尔京群岛地名。（胡德华提供）图中的Fortalent公司注册地址一栏显示英文的英属维尔京群岛地名。（胡德华提供）\n\n他向美国之音提供的一份日期为2003年11月24日的文件图片显示，（英属维尔京群岛有限公司）公司名称：FORTALENT INTERNATIONAL HOLDINGS LTD (FORTALENT 国际持股公司)，注册地址：AKARA BLDG, 24 DE SASTRO STREET, WICKHAMSCAY I, ROAD TOWN, TORTOLA, BVI。BVI 是英属维尔京群岛的英文缩写。\n\n从这份文件图片显示的信息来看，该国际持股公司的注册地址是在英属维尔京群岛，而不是北京。\n当事人提供的Fortalent 公司注册文件图片显示2003年11月24日的注册信息（胡德华提供）当事人提供的Fortalent 公司注册文件图片显示2003年11月24日的注册信息（胡德华提供）\n\n胡德华还提供了两幅盖有英属维尔京群岛政府公章的英文文件图片。其中一幅图片底部的文字显示，代办离岸公司注册业务的莫萨克冯塞卡有限公司（MOSSACK FONSECA & CO. (B.V.I.) LTD 的所在地是英属维尔京群岛。另一张图片显示，文件页面上的日期和公司名称与上述文件图片包含的信息吻合。\n\n从图片上看，该文件正文的第一段写明，公司名称系FORTALENT 国际持股有限公司。第二段写明，该公司的注册地址是AKARA BLDG, 24 DE SASTRO STREET, WICKHAMSCAY I, ROAD TOWN, TORTOLA, BVI 或该公司随时决定的英属维尔京群岛境内的其他类似地址。\n \n当事人提供的Fortalent 公司注册文件图片显示2003年11月24日的注册信息（胡德华提供）当事人提供的Fortalent 公司注册文件图片显示2003年11月24日的注册信息（胡德华提供）\n\n稍早前，国际调查记者联盟（ICIJ)的欧蕾珊在给美国之音记者回复的电子邮件中提供了Fortalent的董事名册(register of directors)。在住宅地址或注册办公室地址(Residential Address or Registered Office Address)一栏，登记的英文地址显示为No. 25 KUAIJISHI, XICHENG DISTRICT, BEIJNG, CHINA，显然系指北京西城区会计司25号。\n\n国际调查记者联盟4月6日发表的欧蕾珊的报道中写到，胡德华是Fortalent International Holdings Ltd.的股东、董事和实际受益人(beneficial owner)，该公司2003年在英属维尔京群岛成立。胡德华注册该公司时使用了他的家庭住址——他父亲生前任中共总书记时的一套传统四合院。\n\n她的原报道说，胡德华在注册该公司时用他的家庭住址，但没有说注册公司本身地址是这座院子。\n\n从欧蕾珊对相关问题的一些报道叙述来看， 没有引用胡德华提供的上述公司注册信息 。她星期三向美国之音提供的依据显示，那份董事信息的资料上的填写日期为2003年12月18日，不是同年11月24日该公司注册文件注明的日期。\n\n对此，胡德华指出，董事名册住宅地址或注册办公室地址(Residential Address or Registered Office Address)一栏中填写的是他本人的真实住址，用作通信地址，不是注册办公室地址，更不是公司的正式注册地址。\n\n胡德华表示，希望关心这件事的人士注意个人通信地址和公司注册地址之间的区别，不要将两者的性质和功用混为一谈。\n\n胡德华对美国之音作出这些说明后表示， 他希望在上述事实获得澄清后不再就此类问题对媒体发表评论。\n\n几天前，他通过美国之音提出，要求相关媒体就涉及其注册地址的报道内容可能产生的负面影响道歉。\n\n胡德华还就巴拿马文件涉及上述公司的部分和相关报道发表声明表示，“文件中提到的公司，就是一家普通的民营企业。2003年我们国内公司的百十个股东，准备在香港上市，用自己的钱，用中国护照真名实姓，在香港堂堂正正注册公司，这是我们的权利。” \n\n本月早些时候，国际调查记者同盟（ICIJ)公布巴拿马文件，揭露数十个国家政要富商的离岸金融丑闻 。这个事件震撼了世界， 导致冰岛总理引咎辞职 ，有关国家纷纷立案调查，包括美国总统奥巴马、俄罗斯总统普京和英国首相卡梅伦在内的一些国家领导人就这一史上最大规模的离岸金融泄密事件作出回应。\n\n在中国，尽管包括习近平、刘云山、张高丽、李鹏、曾庆红、贾庆林、毛泽东等几代中共领导人的亲属卷入该事件，但当局一直对本国民众保持沉默，并实行全面的新闻封锁。\n\n欧蕾珊之前在接受美国之音采访时说：“ 我很高兴胡德华能够就他的离岸公司公开做出回应，进行澄清。可能的话，我报道中列出的其他人也能够效仿他。” 她还表示，开设离岸公司本身并不见得非法，但人们有问题要问。\n\n到目前为止，胡德华仍然是中国第一位也是唯一一位就巴拿马文件做出正式回应的直接当事人。星期四，他对美国之音表示，媒体应该关注的其他事情，总还是很多的吧？\n\n欧蕾珊之前在接受美国之音采访时说：“ 我很高兴胡德华能够就他的离岸公司公开做出回应，进行澄清。可能的话，我报道中列出的其他人也能够效仿他。”她还表示，开设离岸公司本身并不见得非法，但人们有问题要问。\n\n胡德华卷入巴拿马文件事件受到舆论高度关注的一个重要原因，是因为其父亲是备受许多人崇敬的已故中共领导人胡耀邦。\n\n胡耀邦曾因被指责 “纵容自由化”而遭整肃，但近来官方似乎也视其为中共的正资产，并在不提及其下台原因的情况下给予高度评价。\n\n1989年4月15日，胡耀邦心脏病突发去世，随即引发了成千上万学生和市民上街抗议，掀起反贪腐、反“官倒”和要求民主的大规模运动。当年6月，当局出动军队和坦克残酷镇压了北京的示威民众，举世哗然，史称六四事件。"
    },
    {
      "post_id": 32,
      "title": "DW 浦志强律师执照吊销 美再批中国人权状况",
      "date_published": 1460677938.806,
      "body": "美国国务院发表中国人权状况报告翌日，中国当局正式吊销著名维权律师浦志强律师执照，在人权问题上再显北京\"我行我素\"姿态。\nChina Pu Zhiqiang\n\n（德国之声中文网）中国司法当局周四（4月14日）正式吊销了该国著名维权律师浦志强的律师执照。\n\n正式取消律师资格\n\n现年49岁的浦志强于2014年5月被捕，去年12月被北京市第二中级法院以7条微博定罪，认定犯有 \"煽动民族仇恨\"、\"寻衅滋事罪\"，判处缓刑3年。\n\n浦志强对路透社表示，他今天签收了北京市司法局《行政处罚决定书》的正式文件，他的律师执业许可证被吊销。他没有作进一步的说明，但通过微信朋友圈说，\"做了十九年律师，从今天起不再是了，我相信未来，相信未来会改变\"。他对记者表示，因为仍然处在缓刑期间，不方便接受采访。他强调，\"消息我是坚持要发布的，因为我不再是律师了，我要告诉朋友们知道。\"\nChina Prozess Pu Zhiqiang\n\n一些香港公民声援浦志强（2015.12.15）\n\n根据浦志强本人在网上公布的北京市司法局2016年第一号《行政处罚书》，司法当局称，浦志强故意犯罪，构成中华人民共和国律师法有关应吊销律师执业证书的情况，决定给予吊销律师执业证书的行政处罚。\n\n《行政处罚决定书》称，在法定上诉期内，浦志强未提出上诉，3年缓刑判决已生效。《决定书》称，北京市司法局认为，浦志强因故意犯罪受到刑事处罚，构成律师法和司法部《律师和律师事务所违法行为处罚办法》所规定的\"应当吊销律师执业证书\"的情形，\"经过北京司法局2016年4月12日局长办公会集体研究决定，给予浦志强吊销律师执业证书的处罚。若当事人不服，可在60天内，向司法部或北京市政府申请行政复议，或在6个月内向北京市西城区法院提起行政诉讼\"。\n\n浦志强多年来致力于以法律手段维护公民权益，参与调查多宗社会大案。他作为法律代言人的委托人中不乏著名异议人士，其中就有艾未未和\"新公民运动\"活动分子。该运动呼吁中国领导人公示个人财产、实行政治经济社会改革。浦志强案在西方引起广泛关注。\n\n浦志强曾于2013年实名举报当时尚在位的中共中央政治局常委周永康，要求高层查处政法委系统\"十年维稳\"问题，支持建设真正的法治和宪政。在构成\"犯罪\"的网文中，他要求当局反思在新疆等地区的少数民族政策和宗教政策。\n\n浦志强辩护律师尚宝军对路透社表示，自浦志强去年被判刑以来，吊销律师执照已在预料之中，这意味着他律师生涯的结束，不能再度从事律师一行，除非有一天对他的判决被推翻。\nChina Prozess Pu Zhiqiang\n\n一名浦志强支持者在北京第二中法前被警方带走（2015.12.14）\n\n美国人权报告\n\n观察家注意到，北京司法当局正式吊销浦志强行业执照的消息正值美国国务院公布年度《全球人权报告》翌日。根据该报告，中国国内人权纪录持续恶劣。报告尤其谴责了北京当局过去一年里对法律工作者和律师事务所的打击，强调这一打击还在增强。报告指出，数百名中国律师和法律工作者受到讯问和调查，更有甚者，多人在未经起诉的情况下被秘密关押数月，并且不能同律师及家人见面。\n\n反映了199个国家人权状况的该报告指出，过去一年里，中国当局对维权组织和公民的迫害和打击显著增加，\"对合法社团的迫害事实上非常严重，处理政府眼中'敏感'案件的律师和律师事务所成为打击目标\"。报告指出，当局大量使用让人失踪和严厉软禁等\"法外手段\"，以阻止对政府的批评。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 31,
      "title": "DW 德国核电站工作人员8次进行“假检测”",
      "date_published": 1460677897.976,
      "body": "位于德国巴登符腾堡州的菲利普斯伯格2号（Philippsburg 2)核电站定期都会让一名工作人员对辐射测量装置进行检查。如今，该核电站发现，这名工作人员只是假装进行了检查。该核电站现已暂停运行。\nAtomkraftwerk Philippsburg\n\n菲利普斯伯格2号（Philippsburg 2)核电站\n\n（德国之声中文网）菲利普斯伯格2号核电站目前因年度常规审核本来就没有运行。现在，巴登符腾堡州环境部决定，该核电站在审核后将暂不启动，此外还将对该事件进行听证。环境部通报说，该核电站的运营公司巴符能源（EnBW)经过调查认定，一名工作人员虽然在检查报告中记录了对一台故障显示器的复查结果，但其实他根本没有去检测。调查还显示，该工作人员还假装进行过另外7次检测。\n\n巴符能源公司强调，有关设备的运行功能是有保障的，这一点可以从之前和之后的检测中得到证实。该工作人员属于菲利普斯伯格2号核电站的一个外包服务公司。他为何这样做目前尚不知晓，巴符能源将考虑采取法律步骤。\nKernkraftwerk Philippsburg\n\n绿党籍巴符州环境部长温特施特勒（Franz Untersteller)说，\"这是我第一次在德国听说有意假装进行核电站所要求的检查。\"他说，这非常令人不安，也是不可接受的。\n\n据目前获知的信息，尽管\"假装检查\"事件没有带来安全方面的后果 ，辐射监控也得到保障，但是温特施特勒也指出：\"在巴符能源公司证明设备是按照规定安全运行前，核电站不能重新启动。此外，我期待巴符能源公司采取预防措施，杜绝这样的欺骗事件。 \"\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 30,
      "title": "DW 专访：德国截获大批假药 多数来自中国",
      "date_published": 1460677858.969,
      "body": "德国海关总署的副发言人Wolfgang Schmitz接受德国之声采访，介绍来自中国的假药、在欧走私者的犯罪活动，以及德国和中国海关的合作方式。\nProduktpiraterie in Deutschland\n\n德国之声：官方数据显示，2015年德国海关共截获390万粒假药，是2014年的四倍。为何一年之内有如此迅猛的增长？\n\nWolfgang Schmitz：确实，我们去年不仅截获了更多的假药，也得以调查更多嫌犯。得到这种结果，我们认为多少有以下两点原因，一是调查工作开展得更好了，二是可能出现了更多专门走私假药的犯罪分子。\n\n德国之声：据德国海关官方消息，其中大多假药来自中国。每年都是这样吗？\n\nWolfgang Schmitz：我们所截获的进口商品来自非法发货人，而这些发货人中确实一直以来大多都来自亚洲。中国是亚洲的大国，因此在这里扮演主要角色。我们截获的药品中很多是假药或无效药 。也有些假药来自东欧、土耳其或美国等国家，但亚洲是假药主要来源地。这些药一般通过航运集装箱或海运运到欧洲。我们也发现，网络作为匿名的贸易平台被用作交易药品的途径。这里的犯罪分子大多数来自欧洲，其中也有不少德国人。和武器、香烟或其它假货的走私领域一样，很少有直接的亚洲犯罪分子。但是货物来源地很多都是亚洲，我们的调查发现，发货源头不少都是中国港口。至于这些药品是否是在中国生产的，我们就无从而知了。\n\n德国之声：德国海关总数查获的假药的危害性有多大？\nGefälschte Medikamente Asien\n\n货物来源地很多都是亚洲，发货源头不少都是中国港口\n\nWolfgang Schmitz：这要因药而定。那些用来减肥或壮阳的药如果无效，并不太严重，只是会让人失望。但是如果用来治疗心脏病、止疼、糖尿病和降血压等的药物无效，包括那些不含防疫成分的药品都可能造成生命危险。这些假药的一个很大问题是：我们无法确定里面具体到底有哪些成分。我们的实验室的分析结果显示，有些药完全无效，而有些药的有效成分则超过标准的三四倍，这说明制假药的人非常马虎。\n\n德国之声：过去几年陆续在法国、瑞士和英国等国发现大量来自中国的假药，看来这是个欧洲范围的问题。针对这一问题你们如何应对？\n\nWolfgang Schmitz：首先，我们努力避免假药流入市场，为此我们和所有的欧洲海关进行合作，因为假药的受害者主要是病人，不论他们来自欧洲，还是中国。所以避免假药流入市场是我们共同的目标。不仅欧洲内部有合作，我们也通过和全球其他国家的海关沟通，以获得有关运输的信息。每年全球范围内都会开展检查工作。中国的海关在这里也起到重要的作用。我们在全球建立了一个海关官员联系网络。例如，德国海关总署在北京也有一名负责联系工作的官员，他帮助我们和中国海关沟通，我们会交流有关嫌疑人和嫌疑货物的信息。\n\n德国之声：和中国方面合作打击走私假药的过程中有遇到困难吗？\n\nWolfgang Schmitz：我不会说，合作一切顺利。但是我们的调查主要专注于在德国活动的犯罪分子。他们通常会在亚洲订货或者委托制药，这也是我们和中国海关合作要解决的问题。我们也取得了一定的成就，特别是近几年来，我们得以更加密切的合作，为此我们感到很高兴。这也是我们去年可以截获更多药品的原因之一。\n\n德国之声：普通消费者有办法辨别药品的真伪吗？\n\nWolfgang Schmitz：很可惜的是，如今，在没有专家或仪器的情况下，普通消费者几乎无法辨别药品真伪。以前，还可能通过包装纸上拼错的字母辨别，但随着现代打印、扫描技术的发展，制假者已很少犯这样的错误。制假者在这些方面变得非常专业。我们现在有时还能发现一些药品没有附带德语的服用说明书，这些药是假药的可能性就比较大。令我们欣慰的是，在德国，处方药还是要在药店购买。我们建议所有病人通过医生或药店来鉴别可疑药品的真假，尽量避免在网上购买药物。\n\nWolfgang Schmitz是德国海关总署（Generalzolldirektion）的副发言人。"
    },
    {
      "post_id": 29,
      "title": "DW 德语媒体：相声演员的生存之道",
      "date_published": 1460677801.733,
      "body": "德国讽刺节目惹恼土耳其总统引发了德语媒体的联想：中国的相声是怎么在言论审查和讽刺娱乐之间维系平衡的？此外中国的企业债券拉响警报也引起关注。\nChina Komiker Guo Degang\n\n相声演员郭德刚\n\n（德国之声中文网）德国政治讽刺节目主持人 波默曼因为一首涉嫌侮辱土耳其总统埃尔多安的打油诗而惹上官司、引起外交纠纷的事件，也在舆论界引起了关于讽刺艺术的界限的讨论。《法兰克福评论报》（Frankfurter Rundschau）周四发表驻京记者的文章《生死攸关的审查红线》（Die lebenswichtige rote Linie der Zensur），关注了作为讽刺艺术代表形式的相声在中国所必须遵守的言论限制。\n\n作者开篇介绍了一名女大学生董哲（化名），20岁的她受到文化监管机构的秘密委托，负责定期在北京各相声剧场观看演出，门票自然是不用自己掏腰包，她只需要向文化局提交一份简短的书面报告即可。这名年轻的女孩子几乎带着骄傲认为，自己是在为社会稳定做出贡献，因为在一个有序的社会，不可能让每个人在公开的场合想说什么就说什么，\"在你们西方肯定也不例外\"，她对记者说。\n\n对于中国当局这种不动声色的监控手段，《法兰克福评论报》的记者感慨道：\"中国一方面对言论表达进行着毫无漏洞的监控，另一方面却要维持百花齐放的文化生活，包括小品、相声等。在北京的众多剧院舞台上，喜剧演员的表演不乏政治讽喻性。……因此对于相声演员来说，要清楚被允许的笑话和被禁止的批评之间那条红线在哪里，绝对具有生死攸关的重要性。\"\n\n那么问题来了，这条红线究竟在哪里呢？其实谁也说不清。作为相声业余爱好者的董哲表示，事实上并没有明确的规定，但是有些东西你只要听到，就会意识到它出线了。这位女大学生表示，其实很少有什么涉及政治高层的讽刺内容需要向上级汇报，大多数出问题的内容还是由于\"低俗性\"，比如脏话、性暗示语言等。\n\n这条红线不仅没有明确的定义，而且它还是随时在发生移动的。文章继续写道：\"当政治风向发生扭转的时候，红线有时候也会推移。当然有些话题永远都是禁忌：比如最高领导层是不能讽刺的，还有中共的一党专政。即使是最富有才华的年轻喜剧演员，也不敢在小舞台上冒这个风险。对于观众来说，相声演员一旦越来越有名气，相声作品也就变得越来越无聊了。因为：观众群越大，笑话就越得要政治正确。\"\nBildkombo Jan Böhmermann und Recep Tayyip Erdogan NEU\n\n中国相声演员不会惹上像波默曼这样的麻烦\n\n联系到德国讽刺节目引起的政治风波，作者分析认为，中国的喜剧演员是绝对不会惹上这样的官司的：\"在中国，类似德国喜剧演员目前热衷的针对外国领导人的讽刺，是肯定要落入审查范围的。因为对于像德国这样的友邦，媒体报道几乎都是正面的。国家主席习近平也绝对不会涉足讽刺的泥潭，因为一个讽刺段子而亲自出面大发雷霆。他的宣传机器一定会为他做好这些事情。\"\n\n企业债券危机一触即发\n\n德国财经资讯网站\"金融市场世界\"（finanzmarktwelt.de）则关注了国有企业中国铁路物资股份有限公司日前爆发债券危机的消息。该公司此前宣布其总规模168亿元的债务融资工具4月11日起暂停交易。此举被普遍解读为是极可能无法按时兑付的信号，引发市场对国企信用风险的担忧。\"中铁物资宣布的这一消息带来了中国版'雷曼兄弟'式的震撼：因为这是一家国有企业，信用评级AA+，看起来应该是殷实可靠的。这个消息造成了强烈的不安气氛，因为显然现在谁也不想染指那些信用评级比中铁物资还要低的企业债券了。\"\n\n比单纯的企业债券危机更加可怕的，是它所带来的连锁反应：\"……现在地方政府发行的债券也备受压力：今年4月这类债券的风险酬金已经上升了20个百分点--这一增长幅度为13个月来最高。因此，地方财政是中国潜在的债务危机定时炸弹最明显的征兆：各省通过发行政府债券增加的财政负债比去年增长了66%。\"\n\n文章继续分析认为，债券市场的动荡主要还是缘于去年夏天的股市崩盘：\"许多中国人将资本从股市中撤出，投到了自认为更为保险的债券市场。……中国股市暂时还没有对此（企业债券危机）作出反应--但是在最近的持续低迷背景下，股票市场也面临日益增长的风险。债务总有一天是要偿还的--在中国也不例外！\""
    },
    {
      "post_id": 28,
      "title": "DW 中国计划推广转基因农作物",
      "date_published": 1460677760.648,
      "body": "中国农业部日前专门召开新闻发布会公布转基因作物发展时间表，继2月份中国化工收购瑞士农业科技巨头先正达之后，此举再次证实北京在转基因领域出现政策转向。\nMais Pflanze Feld\n\n转基因玉米看上去其实和普通玉米并没有多少差别\n\n（德国之声中文网）中国农业部周三表示计划在未来数年内大力推广转基因农作物。由于中国目前仅有两种转基因农产品系合法，一是1996年批准投入商业化种植的转基因抗虫棉花，一是2006年批准的转基因抗病毒番木瓜，所以这一最新表态被认为是中国在转基因领域的重大政策转向。\n\n农业部科技教育司司长廖西元在农业转基因专题新闻发布会上表示，\"十三五\"期间将加强棉花、玉米品种研发力度，推进新型转基因抗虫棉、抗虫玉米等重大产品的产业化进程。\n\n玉米是中国产量最大的谷类作物，小麦和水稻次之。不过，大部分玉米都被用作饲料。\"凤凰财经\"分析认为，这次农业部专门找开新闻发布会，首次明确了产业化的时间表，应该是表明政府对待转基因商业化种植的态度已经趋于明朗。\n\n中国计划成为转基因超级大国\nGenverändertes Soja\n\n转基因大豆已经销入中国\n\n目前中国尚未成为转基因农作物的主要生产国，但已经是消费大国。转基因大豆、玉米、棉花和菜籽已经可以销往中国，作为原材料和食品加工配料。经过加工的转基因甜菜也可以进口。\n\n预示着中国政府已经下定决心要让转基因作物在未来国家食品供应安全中扮演重要角色的另一个事件，是今年2月份宣布的国有企业中国化工（ChemChina）收购瑞士农业科技巨头先正达（Syngenta）的交易。后者正是在农用化学品和种子--包括转基因种子领域的全球市场领头羊。交易价格高达430亿美元，并且是现金收购。\n\n转基因作物的种植和推广始终备受争议，一些环保主义者表示担忧，认为转基因作物会危及生物多样性。到2015年年底，三分之二的欧盟成员国都决定禁止在其国境内种植转基因作物。\n\n尽管如此，转基因作物已经在全球大范围普及，2014年转基因作物的全球种植面积已经达到1.815亿公顷，这相当于德国国土总面积的差不多五倍。\n\n2015年，转基因作物种植总面积比前一年减少了1%，这是有史以来的第一次下滑。主要原因是收购价格的下跌和一些地区的严重干旱--比如在南非，几十年不遇的严重旱灾已经导致去年转基因玉米的种植面积从原来的300万公顷锐减到230万公顷。\n\n美国是全球转基因作物种植面积最大的国家，五个新兴国家则占据了2015年全球总产量的差不多一半，它们分别是巴西、阿根廷、印度、中国和南非。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 27,
      "title": "DW 美国称中国同意取消七大行业的出口补贴",
      "date_published": 1460677655.725,
      "body": "美国贸易代表表示，中国已经同意取消金属、农业和纺织业等一系列行业备受争议的出口补贴。但也有知情人士批评指出，该协议还不够全面。\nStahl in China - Rohre Stahlröhre\n\n（德国之声中文网）国际货币基金组织与世界银行的春季会议在华盛顿召开之际，美国贸易代表办公室周四（ 4月14日）在一份声明中表示，根据最新协议，中国已同意结束\"示范基地-公共服务平台\"计划。该计划为七大经济领域的中国企业提供出口补贴。\n\n这一协议是北京为减少同美国在钢铁、农产品、科技和金融业等行业的贸易摩擦上迈出的一步。\n\n大约一年前，美国就中国的上述补贴计划向世界贸易组织(WTO)提出申诉，指该计划\"为大量中国制造商和生产商提供了不公平的、被禁止的出口补贴。\"\n\n美国贸易代表弗罗曼（Michael Froman）在声明中表示\"今日达成的协议涉及这一广泛且复杂的出口补贴计划的所有要素。\" \"协议也确保了必要的透明度，为我们密切监测、证实协议条款是否被履行奠定了坚实的基础。\"\nChina Qingdao Hafenarbeiter steht vor Containern\n\n中国经常被投诉以\"倾销\"方式将产品出口到海外市场\n\n美国贸易代表办公室称，在该计划下获得补贴的中国产业包括纺织业、轻工业、特种化工、医疗产品、五金建材、农业、新材料和包括特种钢和铝产品的金属行业等。\n\n钢铁行业尤受关注，因中国的过剩产能压制了美国供应商。但一位了解协议的消息人士表示，协议还不够全面，对美国的钢铁行业没有太大帮助，因为协议针对的只是特种产品。\n\n去年，美国贸易代表办公室估计，那些为中国出口示范基地企业提供补贴服务的供应者，在这三年来获得中国政府超过10亿美元资金。有些公司每年至少获得63.5万美元的援助。\n\n自2001年加入世界贸易组织以来，中国经常被投诉以\"倾销\"方式，即以不公平的低价格将产品出口到海外市场。根据世界贸易组织规定，进口国家可以对有倾销嫌疑的商品征收惩罚性关税。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 26,
      "title": "RFI 欧盟威胁将对中国低价钢铁采取更多行动",
      "date_published": 1460677605.53,
      "body": "欧盟执委会主席容克周三称，欧盟已准备好在必要情况下，对中国钢铁倾销采取进一步行动。路透社消息，目前英国钢铁业正有约10,000个岗位面临裁撤风险。另据国际钢铁协会周三表示，由于中国经济放缓，今年的全球钢铁需求预计将下降。路透社分析认为，中国钢铁产量占到全球的一半，尽管中国政府宣示要解决产能过剩问题，但那些寄望中国能迅速解决的人，将会感到失望。\n \n\n容克在斯特拉斯堡的欧洲议会上表示，“钢铁业存在问题”，他承诺会对该行业提供支持。一些“脱欧”派英国人士指责说，当前的钢铁业困境是由欧盟政策导致的。\n\n容克将钢铁业形容为需要投资和保护的高科技行业。容克向欧盟议员表示，我们现在正在调查中国的钢铁生产状况，以确定是否对市场倾销。他说，我们会在必要时采取其他措施。但他并未详述会是何种措施。\n\n另据法新社消息，国际钢铁协会周三表示，今年的全球钢铁需求预计将下降，原因是中国经济放缓，但到2017年需求将会持稳。\n\n据国际钢铁协会称，今年全球表观消费量料减少0.8%，至14.88亿吨，明年将反弹0.4%，达到14.94亿吨。该协会认为，中国钢铁表观消费量今年将下滑4%，2017年料减少3%。\n\n据路透社专稿分析，中国正面临越来越大的国际压力，要求化解钢铁供应过剩问题。因为随着中国钢铁向国际市场的大量溢出，陷入困境的海外钢铁生产商面临关停的风险。\n\n中国钢铁产量占到全球的一半，尽管中国政府宣示要解决产能过剩问题，但那些寄望中国能迅速解决的人，将会感到失望。\n\n中国钢铁生产过剩是多年累积的结果，要想根除也将需要多年时间。目前中国经济增速正处于25年来最慢，而且劳资纠纷也呈现上升趋势，中国政府担心的一大隐患是，如果裁掉数百万钢铁工人，将可能带来的社会动荡问题。\n路透社引述一位与中国政府领导层有联系的消息人士称，关停产能无法一夜之间完成，“社会稳定是优先考量。”\n中国经济增速逐渐放缓，导致钢铁业中出现巨大的过剩产能，众多已背负较高债务的生产商，又因严重亏损而进一步承压。许多钢企藉由出口寻找对策。2015中国钢铁出口规模增至纪录高位，这是导致国际钢铁价格跌至10年低位的一个主要因素。\n\n印度塔塔钢铁将撤出英国的决定归咎于包括来自于中国的廉价进口品，这一决定恐让1.5万个就业岗位不保。\n周一，超过4万名德国钢铁业劳工走上街头，抗议中国倾销，另外也抗议产业整并等让他们担心会失去工作的议题。\n各界普遍预期将代表民主党角逐美国总统大位的希拉里克林顿，也加入批评的行列，她周一称“当中国违反规定在我们市场进行倾销时，将使他们尝到苦果。"
    },
    {
      "post_id": 25,
      "title": "RFI 缅甸6.9级强震 波及西藏震感明显 尚无伤亡报告",
      "date_published": 1460677561.911,
      "body": "缅甸西北部周三晚发生６.9级地震，印度、孟加拉国、中国等邻近国家均有震感。法新社消息，但到目前为止，缅甸方面还没有传出任何人员伤亡和财产损失消息。中国媒体称，西藏林芝市、日喀则市、拉萨市、山南地区等地震感强烈。西藏有关部门正核实灾情。\n\n \n\n据法新社引述美国地质调查所（USGS）表示，缅甸此次规模6.9级强震，震中位于摩尼瓦市（Monywa）以北100公里处，距离首都约396公里，震源深度134公里。\n\n据缅甸地震委员会说，当地时间２０时２５分，缅甸西北部地区发生６．9级地震.除全国多处地区有震感外，印度首都新德里和东部城市加尔各答有明显震感。当地电视台画面显示，民众从房屋中跑到街上，一些地方警报声响起，提醒人们注意远离高危建筑物。\n\n另外，孟加拉国首都达卡震感明显，手机信号一度受到影响，市民纷纷逃至室外，邻近缅甸的最大港口城市吉大港也有强烈震感。\n\n据新华社报道，中国国家地震台网测定，４月１３日２１时５５分，缅甸发生７．２级地震，震源深度约１３０公里。受此影响，西藏林芝市、日喀则市、拉萨市、山南地区等地震感强烈。西藏有关部门正核实灾情。\n\n据中国媒体报道，离缅甸较近到林芝市墨脱县震感强烈，据墨脱县政府办副主任索朗曲珍介绍，共感觉到两次震感，“以往墨脱也不时有震感，但都是先感觉到玻璃震动，这次是整座楼都在摇动。”地震导致墨脱通讯信号一度中断，目前已恢复，墨脱县政府正在向各乡镇统计受灾情况。\n\n消息还引述西藏自治区地震局13日晚表示，目前尚未收到人员伤亡及建筑物破坏等信息，该局将进一步加强该区域震情监视和灾情了解。相关分析人员称，之所以会波及离震中较远的西藏，与震级大以及震源深度达130千米不无关系。"
    },
    {
      "post_id": 24,
      "title": "RFI 中国将为种植新型转基因产品开绿灯",
      "date_published": 1460677518.63,
      "body": "中国政府周三宣布，将在未来五年“推进”新型转基因玉米及其他产品的产业化进程。然而在过去十年中，中国未曾允许任何转基因产品的商业化行为。\n\n法新社报道指出：转基因产品常常引发中美两国贸易争端。美国孟山都公司是全球转基因作物的巨头公司。今年2月，它的主要竞争对手、瑞士先正达公司（Syngenta）却同意以430亿美元的价格接受了中国化工集团公司（ChemChina）的收购计划。先正达的两项转基因产品目前已在中国展开了产业化的种植：主要是新型转基因抗虫棉和一种新型抗虫木瓜。\n\n中国农业部在4月13日上午举行的新闻发布会上表示，“十三五“期间，将加强棉花、玉米品种研发力度，推进新型转基因抗虫棉、抗虫玉米等重大产品的产业化进程。\n\n另据报道，按照中国农业部的划分，转基因玉米为一种原料作物。近年来，中国国内玉米产量无法满足需求，每年都要进口300－500万吨转基因玉米。目前，转基因玉米被广泛用作饲料。但玉米同时也被人直接食用。\n\n转基因玉米的产业化必然会引发公众对安全的担忧。近日，包括前化工部长在内的400人联名反对中国化工并购瑞士先正达，理由是担心先正达的农药和转基因种子有“严重危害”。\n\n中国工程院院士、国家农业转基因生物安全委员会主任委员吴孔明在 13日农业部的新闻发布会上强调：美国1996年开始进行转基因玉米和大豆的商业化种植，20年来，每年转基因农作物种植的面积都在增加，到现在一年种植的面积接近30亿亩。这么长 的时间、这么大的消费群体里，没有发现一例因为食用转基因农产品带来健康问题的案例。"
    },
    {
      "post_id": 23,
      "title": "RFI 美菲开始在南中国海进行联合巡逻",
      "date_published": 1460677484.334,
      "body": "美国国防部长卡特周四宣称，美国军队和军事装备将以定期轮驻的方式派到菲律宾，并称两国已开始在南中国海进行联合巡逻。路透社消息，这一军事计划是为了让美国不增加在菲律宾的永久性军事存在，但可显示美菲正在加强安全合作。此外，在本周美菲“肩并肩”联合军演后，至多75名美国军人，将以“轮驻的方式”留在菲律宾。\n\n \n\n路透社引述卡特称，该地区各国对中国的活动表示关切，但美国加强军事存在不是为了挑起与中国的冲突。卡特在马尼拉与菲律宾国防部长一同出席新闻发布会时表示，“美国军队将经常性、定期性驻在这里”。他表示，“我们在这里所做的事情是有数十年历史渊源的模式的一部分，是应盟国之邀而为。”\n\n消息称，据美国五角大楼表示，美菲3月在南中国海进行首次联合巡逻，本月初进行了第二次，未来可能“定期”进行。美国近期与日本在南中国海进行了这类联合巡逻，但这些联合巡逻仍然相对不寻常。\n\n卡特没有具体说明联合巡逻是在南中国海的哪个地方进行的。\n\n卡特称，美军一个飞机小分队以及美国太平洋空军的200名空军士兵将驻在克拉克空军基地，一直持续至本月底。首批飞机小分队包括五架A-10C“雷霆二式”对地攻击机、三架HH-60G“铺路鹰”直升机以及一架MC-130H特种作战飞机。\n\n此外，在本周美国菲律宾“肩并肩”联合军演结束后，至多75名美国军人，其中主要为海军陆战队士兵，将以“轮驻的方式”留在菲律宾。五角大楼称，这些部队将支持“该地区增多的行动”。"
    },
    {
      "post_id": 22,
      "title": "RFI 香港六四纪念馆 9月前被迫关闭",
      "date_published": 1460677436.68,
      "body": "位于香港、全球首座以1989年天安门事件为主题的“六四纪念馆”，在政治与资金因素影响下，预计9月前关闭。营运单位希望另觅新址，但尚未找到新的落脚处。法新社取得的一份法律文件显示，“六四纪念馆”所在地点应做办公室使用，因此违反规定。\n \n\n《中央社》报导，“六四纪念馆”是由香港支联会在2014年成立，以展出影片和照片为主。开馆以来已有2万人参观，超过半数来自中国。\n\n香港支联会主席何俊仁表示，“我们决定另觅新址。我们的对手有稳定的资金支持。”\n\n“六四纪念馆”地处尖沙咀一座商业大厦五楼，成立以来就一直和大厦法团打官司。其他租户顾虑安全，也希望纪念馆能关闭。\n\n何俊仁提到，诉讼费用太过高昂，纪念馆将在今年6月4日后关闭，也可能在8月或9月闭馆。\n\n他认为，租户的抱怨和打压其实有政治目的。大厦管理单位坚持检查造访纪念馆的游客并留下纪录，使一些大陆游客却步。\n\n此外，法新社取得的一份法律文件显示，“六四纪念馆”所在地点应做办公室使用，因此违反规定。\n\n报导指出，香港支联会正在物色新的展览空间，希望更宽敞，也期盼避免再碰上法律问题，但尚未找到新的落脚处。法新社报导，如果纪念馆来不及在关闭前找到新家，展品将先寄存仓库。"
    },
    {
      "post_id": 21,
      "title": "BBC 日本官员称南部强震令数栋房屋倒塌",
      "date_published": 1460677359.284,
      "body": "日本内阁官房长官菅义伟说，南部熊本地区的地震造成数栋房屋倒塌，首相安倍晋三指示尽速掌握任何灾情。\n\n在日本时间周四（14日）深夜间临时举行的地震特别记者会上，菅义伟说，安倍晋三做出了尽快掌握灾情、地方与中央密切联系并共同对应地震以及向民众适时提供避难和灾情的相关消息。\n\n日本南部的熊本地区在当地时间晚上9时26分左右发生了里氏（芮氏、黎氏）6.4级的地震，震源距离地表约10公里、震央也就是震中在北纬32.7度/东经130.7度的位置、在熊本县境内。\n\n熊本县已经向日本政府提出要求，希望陆上自卫队能够投入救灾。\n\n不过日本气象厅表示，这次地震并未带来海啸的威胁，据称，在震区的益城町。有数间房屋起火，另外媒体报道说大约有5个人被困，据称一名被困的女性居民重伤昏迷。\n\n从日本传来的相片显示，由于地震当地一家餐馆的许多饭碗被震下厨柜而摔碎，许多居民冲出居住的楼房到空旷的地方避难。\n\n有些地区也传出小范围停电的情形，在当地的核能发电厂则“安全”并继续运转当中。\n\n部分灾区传出失火和煤气泄漏，但是也有很多地区回报称地震并未造成灾情。\n\n（撰稿：威克，责编：董乐）"
    },
    {
      "post_id": 20,
      "title": "BBC 加拿大安乐死新法案把外国人排除在外",
      "date_published": 1460677325.496,
      "body": "加拿大政府星期四（4月14日）向议会提交一项“安乐死”法案，从而可能在加拿大实现帮助绝症患者自杀的合法化。\n\n但是，法案规定享受“安乐死”的只能是加拿大公民，这为外国人专门到加拿大自杀关上了大门。\n\n法案同时规定，有精神疾病和精神失常状况的人也不得享受“安乐死”。\n\n加拿大最高法院去年撤销了有关禁止医生帮助患者自杀的法律，同时决定等待新法律的出台。\n\n新法案得到了加拿大总理特鲁多的支持，但是需要经过一个委员会的讨论，并且需要议会两院投票表决。\n\n加拿大司法部长威尔逊雷布尔德（Jody Wilson-Raybould）说，这项立法将会保护医务人员的良知权利。\n\n但是，她拒绝直接回答有关为什么不让外国人来加拿大享受安乐死的问题。\n\n她说，“我们是在加拿大和加拿大人的这个前提下考虑问题的。”\n\n两名病故加拿大妇女的家人去年提出的案例促使加拿大最高法院做出了撤销禁止医生帮助患者自杀的法律。\n\n在那之前，帮助他人自杀在加拿大是违法的。\n\n最高法院表示，把帮助他人自杀定为违法，这剥夺了人的尊严和自主权。\n\n现在，加拿大政府提出了新的立法建议。\n\n加拿大魁北克省最高法院已经在去年作出裁决，在魁北克省赋予绝症病人选择在医疗帮助下死亡的权利。\n\n目前，被称为“安乐死”的协助自杀合法化的国家和地区包括，瑞士、德国、阿尔巴尼亚、哥伦比亚、日本以及美国华盛顿州、加利福尼亚州、俄勒冈州、佛蒙特州、新墨西哥州和蒙大拿州。\n\n（编译：跃生 责编：欧阳成）"
    },
    {
      "post_id": 19,
      "title": "BBC 微软因政府获取个人信息纠纷起诉美国政府",
      "date_published": 1460677273.693,
      "body": "微软公司正在对美国政府提出一项法律诉讼，声称在联邦政府机构要求获取私人资料的时候，自己有权把有关信息透露给用户。\n\n微软表示，美国宪法规定，如果政府搜查和收缴公民的财产，公民有知情权。\n\n微软因此认为，为政府获取私人资料的要求保密，这违法了美国宪法。\n\n微软说，在过去18个月时间里，政府提出5624项获取资料的要求，其中一半要求伴随着微软必须就这些要求保守秘密的法庭命令。\n\n微软在诉讼文件中说，“当人们把自己的私人资料从实体储存移送到云端储存的时候，他们并没有放弃自己的权利。”\n\n微软认为，政府利用计算机的云端储存，扩大了自己进行秘密调查的权力。\n\n美国司法部还没有对微软的诉讼发表评论。\n\n这项法律诉讼仅仅是美国大型技术公司同政府发生争执的最新案例。\n\n此前，苹果公司曾要求美国国会带头解决如何在保护个人隐私和国家安全之间保持平衡的问题。\n\n微软总裁兼首席法务官史密斯（Brad Smith）说，起诉美国政府并不是微软轻易做出的决定。\n\n他说，“我们认为，消费者和企业在政府进入他们的电子邮件和记录的时候有权知情。”\n\n“但是，美国政府发出指令，要求电子邮件服务商为这样的法律要求保守秘密，这已成常态。”\n\n“我们认为，这已经太过分了，我们要求法庭解决这个问题。”\n\n史密斯还说，如果最初存在着保密的充分理由，而且这个理由继续存在，检察官应该在必要的情况下为这样的保密命令延期。\n\n“否则的话，我们应该能够告诉用户所发生的事情。”\n\n（编译：跃生 责编：欧阳成）"
    },
    {
      "post_id": 18,
      "title": "BBC 肯尼亚案：台法务部长被指“不站在台湾立场”",
      "date_published": 1460677226.824,
      "body": "肯尼亚（台湾称：肯亚）案争议在台湾持续，法务部长罗莹雪周四（4月14日）成为这场争议的焦点。\n\n在当天接受质询时，罗莹雪数度跟立委交锋。民进党立委段宜康形容她对肯尼亚案这样的态度“相当可耻”，罗莹雪也响应，称段宜康“民粹”，双方一度起了口角。\n\n另一位民进党立委尤美女则说，该起诈骗案也有泰国人涉案，但为何“泰国人送回泰国，台湾人却送到中国？ ”，而罗莹雪则响应：“可能是他没有骗大陆人，他只会说泰国话”。\n\n这起事件连日来在台湾引发多维讨论。罗莹雪曾在 周三发言称：“跟世界各国相比，台湾的刑法刑度确实比较低”。而她的这番话则被一些媒体认为是同情“被诈骗者”，变相默许该批人要被送往中国审讯。\n“不站在台湾立场”\n\n台湾立法院立委黄国昌也是其中对罗莹雪持批评态度的立委之一。他在事后接受BBC中文网记者采访时表示，事件发生到现在，“台湾的内部意见不同调”，是让他在立法院获知最讶异的结果。\n\n“很明显法务部长罗莹雪有一套观点，然后陆委会跟外交部又是一个观点，”黄国昌表示，“亲马英九的罗莹雪，宁愿把自己的国民送给中国，也不会想要保护自己国民。”\n\n黄国昌说，相较于陆委会跟外交部的营救态度更批判中方，罗莹雪“真的很不站在台湾立场”。他还说，罗莹雪的法律认知 “错得离谱”。他说：“一个国家主张的管辖权，跟要不要送到这国，是完全两个层次的事”。\n\n黄国昌在立法院询问罗莹雪时问，除了肯尼亚案外，是否还有其他台湾人被中国发布“红色通缉令”？罗莹雪回答“有”，并举出在1月时，在菲律宾也曾有人被通缉，该人一度找外馆求援，但是在法务部、陆委会及外交部意见相左情况下，该人就自行搭机返台。\n“然后他就死掉了”\nImage caption 黄国昌批评罗莹雪“避重就轻”，并说当该人不知为何被强送古巴时，法务部还在“状况外”。\n\n在立法院接受质询时，罗莹雪还承认曾有一人在巴拿马被中国通缉过，但该人却离奇被移送到古巴，并在之后因不明原因“跳楼身亡”，她后将此称为“然后他就死掉了”。\n\n黄国昌批评罗莹雪“避重就轻”，并说当该人不知为何被强送古巴时，法务部还在“状况外”。\n\n两人得交锋也很快在网络上引发“造句大赛”，各种揶揄罗莹雪言“然后他就死掉了”的话语纷纷出笼。\n“子虚乌有的污蔑”\n\n周四的质询受到了许多台湾媒体的关注。法务部长罗莹雪则称目前一些立委对她的指控 “子虚乌有的污蔑，想给我扣帽子安罪名”。\n\n新华社周三援引中国公安部的发言称，45名被带往中国的台湾人分别涉及2014年年底及上周五破获的电话诈骗案。\n\n由于受害人全为中国公民，北京等地公安机关已立案侦查。依据中国法律规定，中国司法部门对犯罪嫌疑人有司法管辖权。中国称将“严格依法对台湾犯罪嫌疑人开展侦查调查工作”，并向台湾通报侦办进度。\n\n（责编：欧阳成）　"
    },
    {
      "post_id": 17,
      "title": "BBC 美司法部起诉两名涉嫌窃取敏感技术华人",
      "date_published": 1460677188.526,
      "body": "美国司法部星期四（4月14日）发表声明，分别公布了涉及一名中国公民以及涉及一家中国公司和一名美籍华人的两起危害美国国家安全的案件。\n\n美国司法部的一份声明说，现年52岁的Fuyi Sun（别名Frank Sun）是中国公民，涉嫌参与一项在未经许可的情况下向中国非法出口主要用于宇航和军工领域的高等级碳纤维的活动。\n\n声明说，Sun前来美国同卧底特工会面，试图获得特殊的碳纤维，在星期三被捕。\n\n美国司法部的声明特别指出，这种碳纤维向中国出口必须得到出口许可。\n\n美国司法部高级官员卡林说，“这种碳纤维在宇航和国防领域具有多种用途，受到严格控制。Sun表示愿意支付一笔钱，避开美国的出口法律。”\n\n美国司法部的声明说，Sun已经在星期三晚上在纽约一家地方法院接受指控。\n特殊核材料\n\n美国司法部在星期四发表的另一份声明中说，美国田纳西一家地方法院星期四指控美国公民Szuhsiung Ho（别名Allen Ho）和中国广核集团（CGNPC）非法实施和参与在美国境外生产和发展特殊核材料的活动，而这样的活动需要事先得到美国能源部的授权。\n\n此外，Ho还受到在美国为外国政府从事特务活动的指控。\n\n美国司法部官员卡林说，Ho被控按照中国国有核能公司的指示，接近在美国的核专家，为在中国发展和制造特殊核材料提供帮助。\n\n他说，Ho在没有告知美国司法部的情况下为外国政府从事秘密工作，也没有得到美国能源部的授权。\n\n卡林还说，对那些企图逃避美国法律为外国获取敏感核技术的人提出起诉，是美国司法部国家安全局的首要任务。\n\n（编译：跃生 责编：欧阳成）"
    },
    {
      "post_id": 16,
      "title": "VOA 香港六四纪念馆即将被迫关门",
      "date_published": 1460677093.449,
      "body": "全世界唯一纪念1989年的天安门广场镇压的六四纪念馆即将在香港关门。纪念馆的组织者表示，纪念馆场地不被续租是因为政治原因。眼下在实行半自治的香港，有越来越多的人担心北京正在收紧对香港的控制。\n\n自两年前开放以来，香港六四纪念馆受到中国大陆游客的青睐。在中国大陆，有关中国共产党当局出动军队镇压要民主反腐败的和平示威者的事情被禁止提及。香港六四纪念馆由香港市民支援爱国民主运动联合会经营。港支联还组织一年一度的六四纪念烛光守夜活动。"
    },
    {
      "post_id": 15,
      "title": "VOA 记者无国界等呼吁中共允许高瑜出国治病",
      "date_published": 1460676992.215,
      "body": "记者无国界组织4月14日呼吁中国当局允许知名独立媒体人高瑜到德国治病。该组织亚太区负责人伊斯梅尔呼吁国际社会积极支持高瑜，迫使中国当局允许高瑜接受治疗。\n\n与此同时，记者无国界将旅美盲人法律维权人士陈光诚的一段视频放在其官方网站播发，陈光诚在视频中敦促中共兑现高瑜当时取保时的承诺，允许她去德国治病。他提醒中共不要自食其言，否则对自己的未来没有好处。陈光诚在视频中还敦促广大网友关注高瑜出国治病的进展情况。\n\n年过七旬的高瑜，2014年4月涉嫌“为境外非法提供国家秘密罪”被刑事拘留，当年11月高瑜的案子由北京第三中级法院进行了不公开庭审。2015年4月17日，法院对高瑜案进行了宣判。她被判处7年监禁，剥夺政治权利1年。高瑜上诉，二审被改判五年，因健康原因获准监外执行。高瑜被关押期间监控状况恶化。今年3月底她家院子里搭建的储藏室突遭城管人员强拆，高瑜在交涉的过程发生冲突，心脏病发作，后来被送到医院治疗。"
    },
    {
      "post_id": 14,
      "title": "VOA 前毛泽东秘书李锐百岁回首 撰文呼吁宪政",
      "date_published": 1460676922.913,
      "body": "曾任毛泽东通讯秘书、前中组部常务副部长的李锐在其百岁寿辰时发表文章《百年回首》，再次呼唤宪政和普世价值。不过他在文章中称自己“对得起历史，对得起党”，这一言论引发一些民运人士的反弹。\n\n4月13日是李锐的百岁寿筵。由于有关部门的要求，李家只摆了五围的酒席低调庆贺。据港媒明报报道，到场者包括六四事件中入狱的前光明日报记者戴晴、前湖南人民出版社总编辑朱正等50余人。和99岁生日时一样，李锐今年也写作一篇文章回忆过往，并发表在最新一期的《炎黄春秋》杂志上。美国之音记者电话采访李锐，被对方以身体不适的原因婉拒。\n\n“对得起历史 对得起党”\n\n李锐在文章《百年回首》中说：“回首一生，我对得起历史，对得起党，也对得起自己。”文章从李锐儿时的经历写起，讲他受父亲影响，从小就对共产党有好感。之后投身革命，一度被打成“右倾机会主义分子”，发配到北大荒，险些被饿死。文革时，李锐称由于他发表了对时任中央文革小组组长陈伯达的负面看法，被关进了秦城监狱，一关就是八年。\n\n李锐在《百年回首》一文中感叹：“我是真没有想到自己能够活到100岁。我的传记作者宋晓梦说过，我的遭际换在别人身上，可能死过几回了。”他在去年发表的文章《九九感怀》中也引自己的旧诗一首：“百岁当今相见稀，鄙人运气自稀奇。一生苦难知多少，最怕单监与饿饥。”印证了其命运几番波折给他带来的难以磨灭的苦楚。\n\n“唯一忧心天下事  何时宪政大开张”\n\n李锐早年为共产主义事业奋斗，晚年转而主张民主宪政。他在文章《百年回首》中重提88时写作的一句诗，“唯一忧心天下事，何时宪政大开张”，认为中国应遵循“普世规律”，“不能与世界脱节”。\n\n他在《九九感怀》中推崇西方的科学、民主和法治。他说：“人类社会进步，主要靠科学和民主。没有民主，科学也发达不了。还要靠法治，依宪治国，而不是靠什么‘阶级斗争’‘无产阶级专政’，那是不得人心的。中国几千年的传统，就是缺乏民主、科学，只有人治，而无法治。”\n\n有80年党龄的李锐被一部分海外人士评价为“党内民主派”，也有一些学者称他是“两头真”现象的代表。《炎黄春秋》前主编杨继绳在2001年1月的《论自由主义与新左派——中国的一场跨世纪争论》一文中首提“两头真”的概念。他说，抗日战争前后和解放战争时期参加革命的知识分子中有一大批“两头真”的人物：青年时代为追求真理真诚地参加革命、离休以后大彻大悟并真诚地直面社会现实。\n\n历史学者章立凡认为李锐“赢得了人们的尊敬”。他在文章《“两头真”与中间失真》中说：“如李锐、李慎之、何家栋等，在政治生涯中途因讲真话获罪，就发不出声音了，但晚年仍坚持讲真话。”\n\n与之相对，也有观点认为以李锐为代表的“两头真”老人其实是“一生伪”。时评人“文贝”认为他们“回避责任，用西方的民主和自由这种空洞的政治口号来掩盖当年的乱为”。\n\n而在中共“左派”眼中，李锐是“反毛疯子”。红色文化网2013年9月转发了“春晖”发表在《环球视野》的评论文章《李锐是反毛疯子》。文章指李锐受到“境外敌对势力的串联、唆使”，“抹黑、侮辱毛泽东”。文章还说，李锐和《炎黄春秋》的编辑们是“下决心与全国人民为敌，也是下决心与中国共产党、党的中央以及全党为敌”。\n\n五不碰\n\n身在海外的异议人士和民运人士也对李锐在《百年回首》中的观点略有微词，主要是针对李锐称自己“对得起历史，对得起党”。\n\n在独立中文笔会发表过多篇文章的专栏作者莫之许发推特说：“李锐、杜导正这些人，哪一点对得起历史了？放到历史的长河里，他们除了帮助建立并巩固极权体制之外，难道还有其他贡献？李锐、杜导正们的这一辈子，不是在为建立极权体制奋斗，就是和极权体制在一起，他们对得起什么历史，说他不要脸，够客气了。”\n\n莫之许同时还批评了《炎黄春秋》杂志的“五不碰”：不碰多党制、不碰军队国家化、不碰六四、不碰法轮功、不碰现任和上任领导人。\n\n民运人士赖永献也发推说，李锐“能对得起党，必定对不起老百姓”。\n\n另一位民运人士陈闯创发推说：“李锐会这么认为和民间有人附和，大概是因为他们梦想所谓中共民主派会主导政治变革，转型后中共仍能存在，到时这批老家伙就会被作为‘历史的先声’而记住。这就是做梦，到时这些人的道义资源恐怕连被中共枉法审判的薄熙来都比不上。”\n\n胡平：李锐的“对得起党”被误解了\n\n然而，《北京之春》杂志主编胡平认为，李锐的批评者误解了他话中的本意。\n\n胡平4月14日接受美国之音采访时说：“一般人们说‘对得起党’，那当然就是因为共产党要坚持它的一党专制，那么对得起党当然就是要对得起共产党坚持一党专制……但从另一个意义上，‘对得起党’就是说希望这个党好，并不是一些人理解的希望党能够永久的掌握这个政权、垄断政权，而是说他希望这个党变好、改好。”\n\n胡平谈到，李锐参加共产党的时间较早，对党内的一些同志“有相当的感情”。他内心是希望那些人能够顺应历史潮流，接受普世价值。\n\n此外，胡品还批评了当前执政的共产党人，认为他们背弃了当年革命的初衷。他说：“相当一批共产党人当年参加革命或许是抱着为国为民的初衷，但是随着革命的胜利，随着自己掌握了权力，那么他们就把这个初衷置之脑后。当他们意识到他们过去的做法是错误的时候，但是他们还依然坚持过去错误那一套，其实是为了坚持自己的既得利益、坚持共产党的垄断权力。”"
    },
    {
      "post_id": 13,
      "title": "VOA 世界银行: 巴拿马文件显示需要变革",
      "date_published": 1460676823.54,
      "body": "华盛顿—\n\n世界银行常务副行长说，巴拿马文件的曝光损害了公众的信任，使普通公民更不愿意付税，而税收是政府修路、办学和发挥其他政府职能必不可少的。世行第二把手英卓华(Sri Mulyani Indrawati)接受了美国之音吉兰德的专访，她呼吁世界各国的决策者制定新的法律并进行更密切的合作。\n\n从巴拿马律师事务所泄漏的文件暴露了世界各地的富人隐藏财富并避税的做法。\n\n虽然其中大部分活动并不是非法的，但是美国和其他国家的一些决策者说，也许应该把这类做法列为非法。还有许多人呼吁制定更严格的法律，增加隐藏财富的难度。\n\n他们说，当富人得以避税的时候，普通人就会觉得自己受到了不公平的待遇。\n\n世界银行第二把手英卓华说，这种想法损害信任，在最迫切需要经济增长的国家影响增长。\n\n她说： “当这些国家看到他们的一些领导人、精英和富人在国外有账户，他们就会开始问：为什么？有正当理由吗？是不是隐藏了什么？”\n\n研究和咨询机构全球金融诚信（Global Financial Integrity）的专家们说，政府国库受到的冲击是巨大的。\n\n全球金融诚信的汤姆·卡达蒙说：“我们的数字显示，每年有一万多亿美元的非法资金从发展中国家流出，这远远超过每年这些国家收到的所有的外国援助和所有的外国投资。”\n\n报道巴拿马文件的国际调查记者联盟的记者威尔·菲茨吉本说，这些文件显示，数十万家公司以匿名的方式注册，隐藏了所有者的身份，使官员很难追踪匿财和逃税活动。\n\n他说：“许多专家对我们说，一些国家的法律需要修订。”\n\n世行常务副行长兼首席运营官英卓华曾经担任过印尼财长。她说，各国需要配合。\n\n她说：“如果没有国际合作，要追踪这些逃税活动非常困难。”\n\n本星期世界银行和国际货币基金组织在举行高级金融和经济官员会议，银行官员在会上呼吁加强监管与合作。"
    },
    {
      "post_id": 12,
      "title": " VOA 调查记者回应胡德华报道失实指称",
      "date_published": 1460630527.968,
      "body": "林枫\n\n2016.04.14 07:00\n华盛顿—\n\n就已故前中共总书记胡耀邦之子胡德华指责外媒关于其用父亲任总书记时的住址注册其离岸公司的报道不实，撰写该报道的国际调查记者联盟(ICIJ)欧蕾珊（Alexa Olesen）向美国之音提供证据，显示胡德华2003年在英属维尔京群岛注册Fortalent International Holdings Ltd时的确使用了北京会计司胡同25号这个地址。这处地址被认为是胡耀邦的故居之一。\n\n欧蕾珊在给美国之音记者回复的电子邮件中提供了Fortalent的董事名册(register of directors)。在住宅地址或注册办公室地址(Residential Address or Registered Office Address)一栏，登记的英文地址显示为No. 25 KUAIJISHI, XICHENG DISTRICT, BEIJNG, CHINA，显然系指北京西城区会计司25号。\n\n南方人物周刊2011年4月的一期杂志刊登了对胡耀邦长子胡德平的专访，标题是《我的父亲胡耀邦：一个善良的理想主义者的政治实践》。他在专访中谈到胡耀邦1984年为工作方便，从居住了29年的富强胡同6号搬到会计司胡同25号。文章说，“一扇不起眼的蓝灰色大铁门，里面有几户人家，其中朱红色大门里边就是胡耀邦的家——一个四合院。”\n\n国际调查记者联盟4月6日发表的欧蕾珊的报道中写到，胡德华是Fortalent International Holdings Ltd.的股东、董事和实际受益人(beneficial owner)，该公司2003年在英属维尔京群岛成立。胡德华注册该公司时使用了他的家庭住址——他父亲生前任中共总书记时的一套传统四合院。\n\n胡德华本人在接受美国之音独家专访时特意强调，有媒体曾报道他的离岸公司注册地址是胡耀邦任总书记时的四合院是“谎言”。他对美国之音说：“我回来查了一下注册文件，我可以肯定地告诉你，并通过你转告所有报道和关注此事的媒体和通讯社，注册地址绝不是他们所报道的什么‘胡耀邦出任总书记时居住的四合院。”\n\n他在一份书面声明中说：“请编造此谎言的媒体和通讯社拿出他们的证据，如果拿不出来，我将保留对他们诉诸法律的权利。因为他们的报道，已经严重侮辱和丑化了前中共中央总书记和我本人，他们必须对他们的错误所造成的严重后果负责，做出公开道歉并给予令人满意的赔偿。”\n\n国际调查记者联盟所报道说的是胡德华在注册公司时用了自己的住家地址，也就是他父亲胡耀邦任中共总书记时的北京西城区会计司胡同25号的地址，而不是说公司本身的地址是这座四合院。\n\n到目前为止，胡德华仍然是中国第一位也是唯一一位就巴拿马文件做出正式回应的直接当事人。他最早4月7日在接受香港明报和香港有线电视采访时曾表示，自己注册离岸的Fortalent是为了帮助自己的公司在香港上市，是“拿真名实姓、中国护照堂堂正正地来注册的。”\n\n欧蕾珊之前在接受美国之音采访时说：“ 我很高兴胡德华能够就他的离岸公司公开做出回应，进行澄清。可能的话，我报道中列出的其他人也能够效仿他。”她还表示，开设离岸公司本身并不见得非法，但人们有问题要问。\n"
    },
    {
      "post_id": 11,
      "title": "美国之音 被肯尼亚判无罪却遣返中国 诈骗涉案台人母亲吁放人",
      "date_published": 1460630421.413,
      "body": " 被肯尼亚判无罪却遣返中国 诈骗涉案台人母亲吁放人\n\n2016.04.14 08:24\n\n台湾公民在肯尼亚涉及电信诈骗案的嫌疑人被强行遣返中国，引起台湾朝野不满，一名涉案人的母亲说，她的儿子已经被肯尼亚法庭判定无罪，不懂为何会被送到中国，她担心儿子在中国无法得到公平审判，希望中国尽快放人让儿子回到台湾。下面是美国之音卫视新闻的报道。\n\n28的刘泰廷是被肯亚遣返回中国的45名台湾公民之一。根据中国公安部的声明，他已经在星期二抵达中国境内。\n\n肯尼亚将涉案台湾人遣返中国在台湾引起极大愤怒，台湾政府指责北京强行掳人。  \n\n路透社取得的手机视频显示，被关押的台湾人星期二正奋力抵挡肯尼亚一个牢房的房门，阻止警察进入房里将他们遣返。\n\n肯尼亚政府说，这些被关押的嫌疑人在境内非法滞留，他们从哪里来就会被送回哪里。\n\n肯尼亚与台湾没有正式关系，它将台湾视为“一个中国”的一部分，与北京当局立场一致。\n\n刘泰廷的母亲瑞秋·刘对路透社说，她的儿子已经被肯尼亚法庭判定无罪，希望中国让她儿子回到台湾。\n\n她说： “OK, 不管怎么样我们还是希望他回到我们自己国家来受审判，不管他是有罪无罪，即使是有罪的那些人，我们也希望是到台湾来，受我们台湾的司法审判。”\n\n中国公安部说，这些台湾嫌疑人涉及在中国实施诈骗手段，导致中国民众蒙受巨大损失，甚至有人自杀身亡。\n\n刘泰廷的母亲说：“当然我们认为是对我们人权的不尊重。肯尼亚都判无罪了，孩子一直讲，我们都无罪了为什么还不能回家？我们家属的诉求也只是希望孩子是平安的，能够受到公正的待遇。”\n\n中国公安部说，这个诈骗团伙在肯尼亚首都内罗毕设立诈骗窝点，向北京、江苏、湖南、四川等九个省的居民实施诈骗，涉案金额达数百万人民币，由于受害人都在中国，因此必须在中国进行调查。\n"
    },
    {
      "post_id": 10,
      "title": "法广 山寨版“BBC” 談 巴拿马文件却只字不提 中国",
      "date_published": 1460628294.724,
      "body": "发表时间 11-04-2016 更改时间 11-04-2016 发表时间 16:14\nmedia\nBBC网站山寨版谈巴拿马文件却略去中国部分，2016年4月5日网页。\n网络截图\n\n中国大陆近日惊现一个与英国广播公司BBC中文网站相似的网站，网站的名称为「中国商业广播网」的网站，英文名為Business Broadcast of China，簡稱BBC NEWS（網址：www.bbcnews.com.cn），网站从名称到网页设计，都与在中国境内被封锁的英国BBC中文网站相似，经中国网民以及港台媒体报道之后，这一网站又彻底改头换面。\n\n中国大陆山山寨海外网站并非首次。据透露，山寨BBC中文网站的拥有者“合肥商传通互联网科技有限公司”，旗下就有多个假冒外国新闻网站，如“法语学习网”假冒成法新社的中文网，当然，网站隐蔽处标明“我们并不是法国新闻社（AFP）”，但该站的网址（http://www.afpnews.com.cn）还是相当直接地用了法新社的简称，网站内亦有广告收益。同类网站还包括 “NewsTimes中文网”、“每日经济中文网”等。\n\n这些网站的设计模仿原版网站，亦不忌讳地报道一些遭中国国内封锁的消息，包括“巴拿马泄密文件”的新闻。\n\n不过，值得注意的是，山寨版“BBC”关于巴拿马泄密事件的报道完全没有中国大陆部分。该网站4月5日刊登有关巴拿马文件的报道，标题为：巴拿马文件泄密文件都有谁？文章介绍了巴拿马文件中榜上有名的绝大多数西方国家以及俄罗斯等国的政界以及商界要人，但却唯独缺少有关中国的部分。\n\n而且，这篇文章目前已近从该网站撤出。由此引发的疑问是： 北京是否正在尝试打破沉默，公开谈论巴拿马文件？安徽合肥互联网公司山寨BBC网站是出于自发还是受旨于中共宣传部门其目的显然是为了要鱼目混珠？"
    },
    {
      "post_id": 9,
      "title": "自由亚洲 问题疫苗受害儿童六位家长北京维权被刑拘",
      "date_published": 1460628041.181,
      "body": "2016-03-26\n\nm0326-ql2p1.jpg\n易文龙（首位）等六位疫苗受害者家长在北京街头维权。（家长提供/记者乔龙）\nPhoto: RFA\nm0326-ql2p2.jpg\n疫苗受害者家长被公安带上警车。（家长提供/记者乔龙）\n\n山东、河北、山西、四川、安徽及黑龙江等地的疫苗受害儿童的家长易文龙、金玲等六人，3月12日“两会”期间在北京西单街头维权，被北京警方羁押，目前被以“涉嫌寻衅滋事罪”刑事拘留。\n\n中国问题疫苗事件持续发酵，当局声称严查非法疫苗买卖的同时，对在网络上发布相关消息的人士，采取严厉的打压手段。近日在网上流传一条“西安问题疫苗流向接种站”的消息。西安市公安局莲湖分局3月25日称，警方发现传播该消息的是一名王姓女子，已对谣言传播者处以治安拘留5天。\n\n3月12日，中国全国“两会”期间，疫苗患儿家长易文龙、金玲、史桂芹、裴雪、杨丹及惠杰6人，在北京西单长安街排队行走，每个人身披写有“中国青年报义工”字样的丝带，手持该报刊登的“被恶魔选中的家庭：8岁儿童因接种疫苗致瘫”一文，沿途派发。最近被以“涉嫌寻衅滋事罪”刑事拘留。其中四川疫苗受害家长裴雪，因怀有5个月身孕，未被羁押。她26日 告诉自由亚洲电台记者：“六位涉寻衅滋事，包括我本人，我是孕妇，取保候审。当时我们吃完午饭两点多，从西单地铁口出去，披着写有中国青年报义工，走了不 到十分钟，就被警察拦下了。因为我们的孩子都是疫苗受害者。中国青年报报道了王红军一家（疫苗受害者），他们地方卫生局和他们打官司，一审判赔136万，二审撤回赔偿，相当于三年的官司白打了”。\n\n裴雪称，官员叫他们寻法律途径解决，但是从新疆患儿家长王红军状告卫生局被判败诉，让家长们感到法律途径无望，因此希望在两会期间向政协委员及人大代表寻求帮助：“我们不愿意走司法程序，因为公检法不公平，再说疫苗没有立法，没有补偿标准。我们去北京的目的第一是给孩子看病，第二是在两会期间去给孩子维权，呼吁疫苗立法”。\n\n据维权网3月25日报道，易文龙等六名疫苗受害者家长被以“寻衅滋事罪”刑拘，家人近日才得知消息，易文龙被关押在山西太原西城看守所。家属已委托余文生律师担任其辩护人。易文龙女儿在山西高温疫苗事件中，因疫苗致急性播散性脑脊髓炎，一直未得到妥善处理。\n\n易文龙的妻子任姬凤26日对记者说，她是从另一位患儿家长口中得知丈夫被刑拘，至今未接到公安的通知：“没有，到现在为止，我也没有接到。河北河间市叫惠杰的（家长）她的老公接到通知了。一个叫惠杰、一个叫金玲、杨丹等”。\n\n惠杰的丈夫任强对记者说，他的孩子2005年因问题疫苗致残，曾到多家医院治疗，但见效甚微：“现在残疾了，一条腿瘫痪。现在恢复到能走路，但是一条腿长，一条腿短。男孩，现在12岁。2014年（政府）承认是疫苗异常反应，现在省里补偿36万多元”。\n\n记者：但是你们认为呢？\n\n回答：这点补偿肯定不够啊，孩子后期的手术治疗，费用非常大。\n\n记者：你们去北京上访多少次了？\n\n回答：上访次数太多了，已经无数次了。\n\n数日前，山东问题疫苗被揭发在没有经过严格的冷藏存储，而且在临近保存期限的情况下，被运输销往24个省区市。公安部官员称，涉案疫苗大部份已经被使用，目前查扣2万剂。疫苗大多流向偏远的农村乡镇接种点，但是具体流向还需进一步调查。\n\n\n特约记者乔龙/责编：吴晶"
    },
    {
      "post_id": 8,
      "title": "东网 WHO在疫苗风波中扮演不光彩角色",
      "date_published": 1460627948.965,
      "body": "\n2016-03-30 01:13\n\n作者: 傅桓\n\n英文简称为WHO的世界卫生组织驻华代表处日前澄清，在山东疫苗事件中它们所发的疫苗无害声明是真实的，总部知道并同意代表处的声明。在这次沸沸扬扬的疫苗风波中，WHO发表声明的网站被认为是“山寨”，这个境外组织的声明也被认为是假的。\n\nWHO声明包括“疫苗应该正确储存和管理……但必须注意的是，不正确储存或过期的疫苗几乎不会引起毒性反应，因此在本事件中，疫苗安全风险可能非常低。确切地说，若儿童接种了过期或不当储存的疫苗，其面临的风险在于缺乏对该疫苗所针对疾病的预防能力。”\n\n驻华代表处现在出来澄清这个声明确有其事，表明该组织听到了网络上对世界卫生组织的不满，属于一种危机公关，挽回声誉之类的。但老实讲，经此一役，世界卫生组织在华的声誉注定会受到不好的影响，形象上会打负分，澄清了声明的真实性，掩盖不了其欺骗性。\n\n说世卫组织的声明带有“欺骗性”，是从两个角度来看的：一是它片面地强调了修辞，没有去看现实中疫苗的实际流通状况，以及贪腐对疫苗安全性的破坏，特别是接种者接种了无效疫苗之后所受到的风险威胁。世界卫生组织试图用它的身份来让声明中的修辞变得可信。\n\n另一个角度，是看WHO声明在舆论及风波中被利用的状况。它成为医学科学依据一样的权威说明，被负有疫苗监管失察责任的部门拿来证明疫苗事件的低危害性——从一定意义上讲，它也成为责任部门逃避相应责任的借口——WHO是拿机构声誉为疫苗风波中的渎职行为背书。\n\n在本次疫苗风波中，因为2010年、2013年两次大的假疫苗风波，民众对疫苗管理体制有了清楚的认识。即使民众对一个有监管效能的疫苗体制不再抱以希望，但依旧抱着治病救人的态度，诉诸责任感，试图唤醒疫苗体制理应具备的功能，但民众是失败了的。\n\n官方对疫苗事件的立场不是回应民众的诉求，不是从呼应责任感出发的，而是站在了情绪维稳与行政脱责的立场上。在这种情况下，世界卫生组织这个声明就被当作了权威来源，加入了到了强行抚慰社会的大合唱中。民众质疑这个声明，其实是愤懑于WHO在此事中承担的粉饰作用。\n\n从出现的时机与实际起到的作用看，世界卫生组织的声明都不是独立的，它在民众最需要政府搞清楚六年来失效疫苗的流向时出现，引导民众讨论疫苗的有效性，极大地转移了舆论焦点。因而，这份声明很可能也不是无辜地被舆论所“裹挟”，它展现了修辞中的意图，不冤枉。\n\n在后来三部门的新闻会上，WHO的声明果然被反复提起，有时作为权威，来说服社会追问与恐慌的无必要、不科学；有时作为证据，来佐证官方无所作为、不专注焦点问题的合理性。\n\n疫苗事件属于公共卫生安全事件，WHO对此发言本属于无可厚非，但不该是走向单一的科普派立场，用“安全无毒”四个字将问题疫苗6年来在至少18省市的流通实情一笔勾销。一个超脱成员国利益、捍卫独立价值、真正追求科学权威的国际组织不应该这样行事。\n\n五六年间，在经受了数次问题疫苗风波后，只要是对国情稍有认知的，都不会否认问题疫苗不只是科学问题，会清醒地判断这是操纵、欺骗与腐败的必然结果。监察失守，问责消失，既得利益纠缠不休，问题疫苗有着体制化的缺陷，而WHO毅然决然地汇入建制化的成因。\n\n疫苗问题主要是本届人民不行，现在，这种嘲笑超越了国界，连境外组织也可以碰瓷“本届人民”了，而且是以赛先生的名义，辅助以高大上的国际机构的架势。但正像疫苗风波中人们对WHO声明所起的疑心，声明不等于清白，质疑不等于误会，兴许可以扪心自问：Who是谁？为Who说话？"
    },
    {
      "post_id": 7,
      "title": "DW 中国高层首次对\"巴拿马文件\"表态",
      "date_published": 1460623935.145,
      "body": "外交部长王毅是首位针对\"巴拿马文件\"公开表态的中国政府高层领导人。在与德国外长施泰因迈尔共同面对国际媒体的记者时，王毅表示中国政府已经看到了\"巴拿马文件\"所透露和澄清的信息，有意弄清事实真相。\nChina Deutschland Steinmeier bei Wang Yi\n\n（德国之声中文网）据路透社报道，本周五（4月8日），中国外长王毅与德国外长施泰因迈尔（Frank-Walter Steinmeier）会晤后在举行记者见面会时报表示，中国有意搞清与\"巴拿马文件\"有关的细节。这也是中国最高领导层成员首次针对\"巴拿马文件\"的公开表态。\n\n一位匿名人士向《南德意志报》提供的\"巴拿马文件\"据称记录了全球上百名政要和名人是如何通过位于巴拿马的法律服务公司莫萨克•冯赛卡（Mossack Fonseca）在逃税天堂隐藏财富。文件涉及至少8名现任和前任中国政治局常委的家人，包括中国国家主席习近平的姐夫和前总理李鹏的女儿。负责宣传事务的刘云山以及副总理张高丽的亲属也被指涉及利用离岸公司隐瞒资产运作。主持分析相关数据的国际调查报道记者联盟（ICIJ）指出， 在莫萨克•冯赛卡律所的全球业务中，来自中国大陆和香港的离岸公司比例占到29%。\n路透社报道称，中国外长王毅与施泰因迈尔共同出席记者会时表示，中国政府看到了 \"巴拿马文件\"所透露和澄清的信息。但他补充说，恐怕先要弄清事实。除此以外，王毅没有进一步说明中国政府是否会根据\"巴拿马文件\"所透露的信息采取行动。他只是说，在中国人民的支持下，反腐取得了进展。正如中国领导人习近平所说，中国会继续走反腐的道路。\n\n    “巴拿马文件”涉及至少8名现任和前任中国政治局常委的家人，包括习近平的姐夫和李鹏的女儿。法新社和路透社昨日（4月5日）报道，中国外交部当天举行例行记者会，外交部发言人洪磊被外国记者问及“巴拿马文件”时回答，“对于这种捕风捉影的东西，我们不作评论。”\n \n之前，中国外交部发言人洪磊称\"巴拿马文件\"是\"捕风捉影的东西\"，因此拒绝置评。中国党媒《环球时报》则在第一时间发表评论称：\"偷或编'巴拿马文件'者绝非等闲之辈\"，最受关注的打击对象是包括俄罗斯总统普京在内的\"非西方国家领导人\"。评论指出，像巴拿马文件这样的\"大泄密\"，是西方意识形态联盟\"打击非西方世界政治精英和关键组织的一种新手段。\"该评论发布几日后被中国审查机关屏蔽。在包括《环球时报》、\"凤凰网\"等媒体的网站上已经无法找到评论原文。\n\n到目前为止，德国外交部没有透露施泰因迈尔是否与王毅谈及\"巴拿马文件\"一事。德国外交部表示，施泰因迈尔此次访问中国的重点是能源转型。他已经在北京为一个有关能源转型的展览揭幕。周六，德国外长将前往湖南长沙，为当地德国企业的一处新厂房揭幕，并和该企业的年轻技术学员见面。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 6,
      "title": "DW“巴拿马文件”之家属藏富的中国领导人",
      "date_published": 1460623865.001,
      "body": "“巴拿马文件”揭露上百名政要和名人如何在逃税天堂隐藏财富。据报道，文件涉及至少8名现任和前任中国政治局常委的家人，包括中国国家主席习近平的姐夫和前总理李鹏的女儿。\nChinesischer Präsident Xi Jinping\n\n（德国之声中文网）1150万份文件涉及214000家离岸公司过去40年的纪录，而这些文件都来自位于巴拿马的法律服务公司莫萨克•冯赛卡（Mossack Fonseca）。\n\n莫萨克•冯赛卡的公司网站上提供英文、西班牙语和中文三种语言服务。公司简介中介绍： \"如果您需要最合适的信息关于注册离岸公司，我们的专业技能和知识将成为你最好的商业盟友\"。该公司还提到其优势之一是机构保密、技术不断升级。该公司在中国大连、杭州、宁波、青岛、上海、深圳、济南和香港设立办公室。\n\n《南德意志报》最先获得、\"国际调查报道记者联盟（ICIJ）分享的\" 巴拿马文件（Panama Papers）\" 涉及全球约140名政要，其中12名是现任和前任 国家元首。文件指出以下现任和前任中国领导人的家人或朋友在海外拥有秘密资产：中国国家主席习近平姐夫邓家贵、前总理李鹏之女李小琳、中国政协前主席贾庆林外孙女李紫丹以及原中共重庆市委书记薄熙来妻子谷开来的法国生意伙伴多维尔（Patrick Henri Devillers）。\n\n法新社5日援引“巴拿马文件”报道称，文件涉及至少8名现任和前任中国政治局常委的家人。莫萨克•冯赛卡公司在中国设立的办公室比其他任何国家都多。\n\n英国《卫报》指出，莫萨克•冯赛卡的一项内部调查显示，中国人在其离岸公司所有者中占比最大，其次是香港。\n\n陆媒未提中国领导人\nPanama Papers\n\n引起全球关注的“巴拿马文件”\n\n文件显示：2009年9月，邓家贵成为两家英属维尔京群岛空壳公司的独立董事和股东。这两家公司分别叫作\"Best Effect Enterprises Ltd\" 和\"Wealth Ming International Limited\"。莫萨克•冯赛卡帮助邓家贵取得前者的公司印章。目前未知两家公司的用途。当时，习近平是九名政治局常委之一。当习近平分别与2012年和2013年被任命为中共总书记以及国家主席时，邓家贵的这两家公司便被搁置。\n\n中国大陆媒体对\"巴拿马文件\"鲜有报道，相关关键词 遭遇审查。\n\n不少港台媒体报道了此事，并提及习近平的家人。香港《苹果日报》指出，邓家贵两家公司的登记地址为香港谢斐道。该报记者根据登记地址上门，发现该单位门口与一般住宅无异，并无张贴任何公司名称等资料，记者按门铃但无人回应，也听不到屋内有声响。邻居表示该单位是一般住宅，\"平时好少见到，不过是有人住的。\"\n\n台湾三立新闻报道称，在两岸三地的境外金融调查中，\"国际调查记者联盟\"与香港《明报》、台湾《天下杂志》及德国《南德意志报》合作，其中台湾部分有超过1.6万名客户，在海外注册境外公司。\n\n李鹏的女儿和贾庆林的外孙女\nChina Li Xiaolin\n\n李鹏的女儿李小琳榜上有名\n\n\"\"国际调查报道记者联盟在其网站公布的“巴拿马文件”介绍，李小琳与丈夫刘智源是“Fondation Silo”基金的受益权所有人，这一位于列支敦士登的基金是一家于英属维尔京群岛开立的“Cofic Investments Ltd”公司的唯一股东，该公司成立之时，李鹏仍为中国总理。这对夫妇的瑞士律师告诉莫萨克•冯赛卡，“Cofic Investments Ltd”的资金来源是协助客户从欧洲向中国出口重型机械的利润。莫萨克•冯赛卡似乎不知道李小琳是中国前总理的女儿。这名瑞士律师特别提供了李的香港护照以进行相关背景审查，相关文件也以“刘李小琳”称呼她，由此可能使莫萨克•冯赛卡更难将李小琳和李鹏联系在一起。\n\n文件另外指出，贾庆林外孙女李紫丹在美国斯坦福大学读书时，已是\"Harvest Sun Trading\"有限公司的单一股东，该公司于2009年在英属维京群岛注册。文件显示，2010年12月，中国名表零售连锁集团亨得利创始人张瑜平将该公司以1美元的价钱转让给李紫丹。李紫丹同时也是另一家英属维京群岛注册公司\"Xin Sheng Investments\"的单一股东。这两家公司是两家在北京注册的咨询公司的母公司。由于李紫丹以英属维京群岛公司的名义持有这两家公司，其名字无需刊登在公开的注册文件上，由此使她的这些公司资产得以保密。\n\n并非首次被提名\nDeutschland Titelseite Süddeutsche Zeitung Panama Papers\n\n《南德意志报》最先获得“巴拿马文件”\n\n\"国际调查记者联盟\"曾于两年前发表过一份调查报告，披露中国高层官员家属在海外拥有秘密资产。当时的报告指出，除了邓家贵和李小琳在海外注册有离岸公司外，前总理温家宝的儿子温云松和女婿刘春航、前任国家主席胡锦涛的堂侄胡翼时和已故领导人邓小平的女婿吴建常等人也榜上有名。据2014年的这份报告估计，2000年以来，中国流失到境外的资金至少有1万亿，甚至可能高达4万亿美元。具体路线难以追踪。\n\n追溯到更早的2012年，彭博新闻社（Bloomberg）也发表过一篇英文报道，题为\"习近平富豪亲属揭示精英阶层财富\"。报道称，时任中国国家副主席习近平的亲属拥有企业资产3.76亿美元，间接持有一家价值17.3亿美元的稀土企业18%的股份，以及一家技术企业2000万美元的资产。其中，彭博社追溯到的大部分资产归习近平的姐姐齐桥桥、其丈夫邓家贵和女儿张燕南所有。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 5,
      "title": "DW“巴拿马文件”李嘉诚“榜上有名”\n",
      "date_published": 1460623796.225,
      "body": "据澳大利亚ABC电视台报道，香港首富李嘉诚也是“巴拿马文件”所涉及的莫萨克•冯赛卡律师事务所的客户。据报道，长江基建通过该事务所在香港的办公室，在巴拿马和英属维京群岛开设了一系列子公司。\nLi Ka-shing\n\n香港首富李嘉诚\n\n（德国之声中文网）澳大利亚ABC电视台上周花大篇幅报道与\"巴拿马文件\"相关的新闻。电视报道中也提到香港首富李嘉诚。据报道，\"巴拿马文件\"中包含李嘉诚香港身份证的图像。报道中还称，长江基建要求莫萨克•冯赛卡律师事务所为其业务提供最高级别的保密。\n\n香港《南华早报》就此报道向长江基建提出问询，对方回应说，长江基建完全遵守了公司运作所在国家的法律。\n\n澳大利亚媒体的报道中也并未指出长江基建存在任何违法违规行为，只是称这家公司在缴税的问题上未能保持充分的透明度。\n\n《南华早报》在其报道中写道，\"业内人士指出，香港很多公司出于多种理由都会设立离案公司，这种做法本身没有问题。即使这些离岸公司通常会在贪腐弊案中出现，而且被用于秘密转移违法所得\"。\n\n《纽约时报》在一篇报道中指出，中国公民在海外开设离岸公司并非违法，而且存在着很多这样做的理由。数以千计的中国人在英属维尔京群岛以及塞舌尔拥有类似的离岸公司。不过，\"巴拿马文件\"让人们窥探到中国的政治精英已深入到全球律师以及富裕商人的巨大网络，可以通过支付费用构建的这些公司能够隐去他们的个人财富。\n\n\"巴拿马文件\"中涉及至少8名现任和前任中国政治局常委的家人，包括中国国家主席习近平的姐夫和前总理李鹏的女儿。负责宣传事务的刘云山以及副总理张高丽的亲属也被指涉及利用离岸公司隐瞒资产运作。彭博通讯社曾在2012年报道了习近平家族海外财富事宜，但本次的报道称邓曾还拥有3家离岸公司，但这是在习近平上任中共总书记及国家主席之前。主持分析相关数据的国际调查报道记者联盟（ICIJ）指出， 在莫萨克·冯赛卡律所的全球业务中，来自中国大陆和香港的离岸公司比例占到29%。\n\n上周，中国外长王毅与到访的德国外长施泰因迈尔共同出席记者会时表示，中国政府看到了 \"巴拿马文件\"所透露和澄清的信息。但他补充说，恐怕先要弄清事实。除此以外，王毅没有进一步说明中国政府是否会根据\"巴拿马文件\"所透露的信息采取行动。他只是说，在中国人民的支持下，反腐取得了进展。正如中国领导人习近平所说，中国会继续走反腐的道路。\n\n使用我们的App，阅读文章更方便！给yingyong@dingyue.info发送一封空白电子邮件就能得到软件和相关信息！"
    },
    {
      "post_id": 4,
      "title": "VOA 美国人权报告: 中国强势抓捕律师反映当局内心不安",
      "date_published": 1460623610.377,
      "body": "叶凡, 张蓉湘\n\n最后更新 2016.04.14 09:25\n华盛顿—\n\n4月13日星期三美国国务院发布了2015年度各国人权报告。美国国务院官员说，中国在这一年大规模逮捕律师以及从海外劫持异议人士的动向尤其引人担忧。\n\n    美国人权报告: 中国强势抓捕律师反映当局内心不安\n\n美国2015年度各国人权报告的中国部分说，中国这一年有关民权、政治权利、公共利益和少数民族问题的维权组织受到的压制和胁迫明显增加，对法律界的镇压尤其严重。\n\n报告说，那些处理政府定为“敏感”案件的律师和律师事务所受到骚扰，被抓的律师在毫无指控情况下在秘密地点受到数月监禁，不能获取法律援助和与家人见面。\n\n主管民主、人权和劳工事务的助理国务卿汤姆·马利诺夫斯基在接受美国之音记者采访时指出，中国这一年大规模逮捕律师以及从海外劫持异议人士的动向尤其引人担忧。\n\n他说：“我们看到律师在电视上被示众，还没有在法庭起诉就被指控犯罪，我们看到有人从香港和其它国家被劫持回中国，只是因为他们出版了一本书，这些都不符合中国自己的法律。美方对此感到极度关切；那些考虑在中国投资的外国投资者也十分关切；那些多年与中国接触的基金会、非政府组织和大学也很关心这些问题。”\n\n今年3月，美国和其它11个国家在联合国人权理事会上发表了批评中国人权记录的联合声明。马利诺夫斯基表示，美国将继续与伙伴和盟友在敦促中国保障人权上铸建一道共同阵线。\n\n他说：“至于我们的影响，我想中国政府关心自己在世界上的合法性。当美国公开发声时，即便只是一个简单的声明，例如我今天跟你说的这些，中国政府一般都会注意。他们对我们谈论这些问题感到不满。我想这就告诉我，他们在乎自己在世界上的名声。当各国一同告诉中国，他们的做法是错误的时候，我们能产生影响。”\n\n这位美国国务院官员在星期三的新闻发布会上介绍了2015年各国人权问题中出现的一些新动向。\n\n中国全国人大常委会2015年12月通过了《反恐怖主义法》，美国则担心这部法律可能导致中国言论、结社、和平集会和宗教自由被进一步限制。马利诺夫斯基说，中国通过立法将和平的活动方式和新闻报道与恐怖主义混淆，这尤其令人担忧，因为其它国家很可能会套用中国的做法。\n\n马利诺夫斯基说，高压统治的原因是一种不安。他说，试图在表面展示力量的政府实际上表现了很大的内在弱点。\n\n他说：“中国人更加富裕，他们的期待变得更高，就像其他地方的人们一样，中国人希望居住在一个尊重法治、惩治并暴露腐败、不去隐瞒环境问题的国家。他们要的和其他国家人民一样。政府感受到了这一点，于是感到不安，并采取镇压。”\n\n美国国务院根据美国国会的要求，每年发表各国人权报告，今年已经进入第39年。中国政府认为，美国的做法是在干涉别国内政。\n\n美国国务卿克里在星期三的记者会上说：“这些报告中提到的准则是普世准则。它们不是美国编造出来的，不是美国试图强加给人民的武断标准。这些是世界上大多数国家采取并接受的普世人权标准，有些国家虽然同意但是违反了这些标准。”\n\n今年发表的人权报告提到了斯里兰卡、缅甸和越南等亚洲国家取得的民主进步。克里在记者会上说，越南仍是一党制国家，但是越南政府已经承诺允许成立独立工会，这是工人结社自由的重要进步。"
    },
    {
      "post_id": 3,
      "title": "VOA 卡特取消访华 中国官媒开骂",
      "date_published": 1460623553.7,
      "body": "华盛顿—\n\n美国国防部长卡特4月13日抵达菲律宾访问。卡特这次亚洲之行，取消了原定对中国的访问，只去印度和菲律宾，让中国如鲠在喉。官媒说，“卡特爱来不来”，更表示在南中国海问题上不会看美国的脸色。\n\n卡特在结束对印度的访问后，星期三抵达菲律宾。本周美国和菲律宾还举行联合军演，高调展现两国间的密切军事合作。\n\n卡特计划观看一次远程导弹系统发射，必要时这种导弹系统可以覆盖菲律宾宣称主权的南中国海领土，不过美国没有证实是否会在菲律宾部署这种导弹。\n\n另外，根据一项新协议，菲律宾将允许美国在5个菲律宾军事基地上修建设施，让美国在菲律宾各地部署部队、飞机和舰艇，数量超过以往几十年。\n\n在抵达菲律宾之前，卡特在4月10号开始对印度进行了3天访问，这是他不到1年来第二次访问印度，他还特地选择印度国防部长巴里卡尔的家乡果阿作为第一站，以突出美国对印度的重视。\n\n美国军方明确表示，希望和印度加强合作，尤其是在抗衡中国方面。\n\n中国对卡特取消访华的计划深为不满，官媒环球时报发表评论说：“中美发展两军关系不是谁求谁，尤其不是解放军求着美军的事情。”\n\n观察人士指出，卡特取消访华计划，是对中国在南中国海非法行动的抗议。\n\n国际评估和战略中心资深研究员理查德·费舍尔说：“这非常明显是政治决策，美国长久以来第一次取消和中国的定期会谈，实在是因为中国在南中国海的行动不仅让美国，而且让很多亚洲国家都无法接受。”\n\n菲律宾是二战以来美国在亚洲最长久的盟友之一，1991年菲律宾民族主义情绪高涨，政府因此关闭了美军基地。\n\n环球时报指责说，美国来南中国海不是为了保护菲律宾等国“权益”，“南海的领土纠纷完全成了美介入这一地区的战略借口”，缺少正当性和正义性。\n\n可是费舍尔指出，正是由于近年来中国在南中国海的扩张行动，菲律宾迫切需要美国支援，两国军事关系才迅速回暖。\n\n卡特上星期说，美国将向菲律宾提供4000万美元的军事援助，改善菲律宾的巡逻舰艇，并提供无人驾驶监视飞艇，监视菲律宾控制的南中国海岛屿。\n\n菲律宾目前用来保卫其宣称主权的南中国海领土的，只有2艘将近50年船龄的美国海岸警卫队快艇和2架战斗机，而这两艘快艇时常抛锚。中国可以无所顾忌地在南中国海修建岛礁，并驱逐菲律宾渔民。\n里查德•费舍尔，国际评估与战略中心资深研究员里查德•费舍尔，国际评估与战略中心资深研究员\n\n专家指出，美国在菲律宾增加军力将会改变南中国海的力量平衡。\n\n费舍尔说:“美国和菲律宾早就应该加强军事合作，抵制中国在南太平洋攻击其他国家岛屿并对这个地区实行军事控制。”\n\n不过，环球时报评论强硬地指出，南中国海是美中战略角力的“示范区”，美方施加再大的压力，中方都没有后退的可能性。\n\n另一方面，虽然印度对中国海军近年来在印度洋上的日益活跃感到不安，可是新德里历来谨慎小心，不和任何国家走得太近。\n\n上个月，美军太平洋司令部司令哈里斯说，美国希望把每年和印度的联合海军演习，扩大成跨太平洋联合巡逻。\n\n不过印度表示没有这个计划。\n\n费舍尔说，印度之所以小心翼翼并不是看不到威胁，事实上印度非常担心中国，非常担心中国大力支持巴基斯坦的核武器项目，可是印度需要时间来适应这种冷战局势，因此不要把印度反应缓慢看作是不情愿和美国合作。\n\n印度是世界上国防预算最大的国家之一，可是在军力方面仍然存在很大差距。\n\n美国军火制造商期望，美印改善关系会促进他们和印度交易。上星期，美国洛克希德·马丁公司和波音公司向印度国防部推荐各自的飞机。\n\n波音在一份声明中说，正在和印度商谈在印度生产F/A-18E/F超级大黄蜂飞机的可能性。\n\n洛克希德的一位发言人表示，该公司也参与了谈判，谋求为印度制造战斗机的机会。\n\n有关官员透露，印度还提出向美国购买40架掠夺者无人侦察机。"
    },
    {
      "post_id": 2,
      "title": "BBC 特写：东京官民追踪一毒鱼折射社会是非观",
      "date_published": 1460623418.078,
      "body": "日本东京筑地鱼市场本周二卖出一条毒鱼“玫瑰红斑”（ Variola Louti）令东京沸沸扬扬地追踪骚动，终于在周三（4月13日）下午获得东京中央区一中华料理店报称买下该鱼并提供给6名消费者，但6人并没感到中毒症状后，终于暂时落下帷幕。\n\n这场骚动始于周二早上8点左右，东京都政府驻筑地市场的“市场卫生监察所”职员例行到鱼市场内巡查时，对某个鱼摊上贩卖的一条颜色鲜红的石斑鱼起疑，相信可能是日本政府列为有毒的“玫瑰红斑”，于是拍下照片回办公室核查，核实后立即返回鱼市场、试图禁卖时，该条来自宫崎县的重约1.2公斤、长约45公分的毒鱼已经以4500日元（约42美元）的价格售出。\n\n日本政府厚生劳动省食品安全委员会官网上，图文并茂地说明“玫瑰红斑”的特征和毒性是：“红或棕色，尾鳍深弯，体内积蓄雪卡毒素（Ciguatera），过去22年收集到中雪卡鱼毒78案例报告中，最多的16例来自玫瑰红斑。玫瑰红斑肉和内脏都有毒，中毒后主要症状是神经系统出现温度感觉异常、瘙痒、四肢肌肉和关节痛、头痛、头晕、乏力和排尿难。此外消化系统有腹泻、呕吐、腹痛、恶心症状纪录；循环脏器有心律不齐、低血压、脉弱症状纪录。其中神经中毒症状轻者一周治愈，重者可达数月至一年以上，极罕见死亡案例”。\n人海网鱼\n\n东京都政府当天立即发出告示寻找毒鱼下落，并向各大传媒发放消息和拍摄的照片，以求协助全力追踪。\n\n周二晚起，此一消息上了各大传媒头条，令整个日本开始关注。东京更是官民分头忙找鱼，各大传媒除了报道、呼吁禁食外，还发动驻外地记者走访各地渔港、鱼市场，探寻渔民、鱼贩对玫瑰红斑的认识与见解。\n\n结果发现大部分渔民也不大能分辨有毒或无毒石斑鱼，其中有记者在冲绳鱼市场上找到一条待售的疑似玫瑰红斑，当地鱼贩说“从来不知有毒，一贯拿来卖”，于是该记者再寻求冲绳县政府，证实冲绳县政府所列的毒鱼名单中没有玫瑰红斑。\n\n当东京街头巷尾连日悬挂着“那条鱼究竟去哪儿了”、“传媒这么吵，不会还看不到吃下去吧”的疑案时，周三晚东京都政府宣布，中央区一中华料理店当天下午打电话报称，他们买下了那条鱼并在当晚以清蒸料理分别供给两组、共6名客人食用了。该店说，他们是周三看到报道才知道全城追踪毒鱼，于是立即设法找到消费客人、追查是否中毒，好在6人都称没感到中毒症状。\n东京文化\n\n东京都政府经核查该店收据和消费途径等确认后，周三晚正式宣布追查到的结果。东京都解释说，中毒通常在食后1至8小时内发生，周二晚进食后到周三下午仍没感到中毒症状的话，说明中毒的可能性很低。至此东京全城像如释重负。\n\n全球最大规模的鱼市场-东京筑地鱼市场也是东京著名的旅游景点，每周一至六运行的筑地市场在上午11点结束主要营业前，穿行的鱼车、叫卖的吆喝、购货的商家和东京人与拿着相机徘徊在鱼摊间、围观一条条乌黑油亮的肥硕金枪鱼拍卖的游客们令筑地市场内景象忙乱。\n\n但毒鱼案说明，忙乱表象中仍有东京都政府管理食品安全细致至一条鱼的责任感；有传媒固执追求食品安全的使命感；有市民高度重视食品安全的意识和不乘机诈取赔偿的是非观。\n\n而这些常在的感觉和意识、观念可能也反映了与日俱增的访日游客们所看不到的日本社会里自古存在的东京武士文化、大阪商业文化、京都贵族文化等的潜在差异之处。\n\n（责编：萧尔）"
    },
    {
      "post_id": 1,
      "title": "BBC 维权人士浦志强：从今天开始我不再是律师",
      "date_published": 1433033779.604,
      "body": "中国维权人士浦志强周四（4月14日）向BBC中文网证实，他的律师资格被取消。周三，北京司法局印发了《行政处罚决定书》，明确决定吊销其律师执照。\n\n浦志强向BBC中文网证实消息是真的，并称：“实际上我也希望让那些以为我是律师的朋友知道，从今天开始我就不再是律师了。”\n\n浦志强还表示，对自己律师执照被吊销的决定并不意外，也是个必然的结果。他解释称：“从认定和判决我有罪并且处以刑罚的那天起到今天，它是个正常流程，也是一个必然的结果。司法局也必须这么做。”\nImage caption 去年12月，浦志强被关押期间，示威者要求当局释放浦志强。\n\n2015年12月，北京市第二中级法院就中国维权律师浦志强涉嫌“煽动民族仇恨罪”、“寻衅滋事罪”一案裁定浦志强有罪，两罪并罚，判处三年有期徒刑，缓刑三年。\n\n庭审当天，北京二中院外驻扎了大量警力，包括多名疑似便衣警员。BBC记者埃文斯及其采访队报道说，多名到法院外声援浦志强的民众被便衣人员拉走。\n\nBBC采访团队随后遭警察没收记者证件，警察指控BBC记者无照进行连线报道，违反中国法律。\n\n美国与欧盟等西方政体认为浦志强只是行使其言论自由，纷纷要求中国无罪释放浦志强，中国则多次强调外国“必须尊重中国的司法主权”。\n\n浦志强也在自己的社交平台微信上表示，做了19年律师，从今天起不再是了。我相信未来，相信未来会改变。\n维权人士浦志强\n\n浦志强于1965年出生，河北人。曾于北京求学期间，参与1989年天安门学生绝食事件。\n\n浦志强1995年开始考取律师资格，1997年正式执业。浦志强从业初主要代理商业案件，后来开始涉足维权和异议人士案件。\n\n他曾代理异议人士谭作人、重庆涉黒案辩护律师李庄和异议艺术家艾未未的税务案件等。\n\n并于2013年开始在中国社交媒体微博上“实名举报”时任中共中央政法委书记周永康，表达对其维稳模式的不满。\n\n（撰文：觅云 责编：萧尔）"
    }
  ]
}
