{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1524294522,
			"title": "Balancer.ZeroTalk",
			"body": "Форум для использования в качестве базового для доработок перед клонированием, а также для обсуждения ZeroNet-разработок.",
			"added": 1524294521
		},
		{
			"topic_id": 1524295020,
			"title": "Работа с картинками",
			"body": "Пока поддерживаются только картинки с внешних ресурсов.\n\n```\n![](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/data/img/post_85_20130511-1718-img_3912.jpg)\n```\n\n![](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/data/img/post_85_20130511-1718-img_3912.jpg)",
			"added": 1524295018
		},
		{
			"topic_id": 1524297715,
			"title": "Отличия от оригинального ZeroTalk",
			"body": "- Поддержка картинок и видео в Markdown.\n- Возможность указывать в `content.json` баннер сайта и навигационное меню.\n- Русский интерфейс «из коробки»\n",
			"added": 1524297712
		},
		{
			"topic_id": 1524298219,
			"title": "Вставка видео в посты",
			"body": "Вставляется точно также как картинка, видео определяется по расширению `.mp4`\n```\n![](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/moscow-apocalypse-horse--youtube=2eFMLw_wik0--zeronet=17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD.mp4)\n```\n\n![](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/moscow-apocalypse-horse--youtube=2eFMLw_wik0--zeronet=17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD.mp4)",
			"added": 1524298215
		},
		{
			"topic_id": 1524304010,
			"title": "Планы / ToDo",
			"body": "- [ ] Перевести дизайн на Bootstrap3 (или даже Bootstrap 4?).\n- [x] Осилить работу с исходниками Coffeescript, чтобы можно было нормально патчить.\n- [ ] Сделать настройку показа или нет картинок в конфиге.\n- [ ] Внешние (не в ZeroNet) картинки не показывать, а выводить предупреждение с возможностью показать картинку кликом.\n- [ ] Реализовать привычные для форумов разбивку на страницы и сортировку постов от старых к новым.\n\n:)",
			"added": 1524304005
		},
		{
			"topic_id": 1524307975,
			"title": "Материалы по разработке ZeroNet",
			"body": "- [ZeroNet site development tutorial #1](/Blog.ZeroNetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1)@ZeroBlog\n- [Кодинг, разработка сайтов и приложений в ZeroNet](/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7/+ZeroNet)@Ru-ZeroTalk",
			"added": 1524307969
		},
		{
			"topic_id": 1524308016,
			"title": "Ход работ",
			"body": "Сделал форк: https://github.com/Balancer/ZeroTalk",
			"added": 1524308009
		},
		{
			"topic_id": 1524312251,
			"title": "Millchan — имиджборда/галерея",
			"body": "Надо будет тоже причесать.\n\nИсходники: https://gitgud.io/mcdev/Millchan\n\nОсновной зайт: http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/",
			"added": 1524312243
		},
		{
			"topic_id": 1524971902,
			"title": "Мысли по размещению картинок средствами форума",
			"body": "Пока — только мысли.\n\nЯ сделал показ картинок средствами Markdown для внешних ресурсов и это сразу же сильно оживило форумы. Я вижу наличие сразу множества клонов своего форка ZeroTalk :)\n\nНо этого мало. Нужно делать нормальный аплоад.\n\n- Вариант, типа ZeroBlog'ов отпадает сразу. Форумы будут жиреть не по дням, а по часам. У меня на форуме в клирнете народ кладёт по 50-60Гб аттачей в год + не меньше утягивается и кешируется по внешним Интерне-ссылкам. Никакой форум в ZeroNet такое не потянет.\n\n- Вариант IPFS. Не смотря на [моё разочарование в этой системе](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:28:IPFS), это интересный вариант. И я в ручном режиме пользуюсь им сейчас для размещения фоток. Если сделать аплоад фотки через JS из формы ответа на внешние гейты, то это будет довольно просто для юзера. Минусы в том, что это используется сторонний ресурс, в IPFS нет контроля над уровнем избыточности/достаточности пиров и появляется зависимость от внешнего гейта для аплоада. При отказе такового, форум потеряет часть функционала.\n\n- Вариант с опциональным контентом  в рамках форума. Привлекательный и его надо рассмотреть.  Как и вариант с общим Merger-сайтом. Но меня немного отпугивает перспектива такого подхода. Годы спустя объёмы централизованного Merger-сайта могут стать очень большими даже с учётом опциональности.\n\n- Больше всего мне кажется интересным вариант, который реализовали в [ZeroLSTN](/ZeroLSTN.bit/) (упс, а что это он у меня не грузится сейчас?). Там пользователями(!) создаётся Merger-сайт под отдельный жанр. И вся работа дальше идёт с теми «жанрами»/merger-сайтами, на которые ты подписан. Вот это, ИМХО, могло бы стать прекрасным решением и для форумов.",
			"added": 1524971893
		},
		{
			"topic_id": 1525669678,
			"title": "Кастомное оформление и обновление движка",
			"body": "`custom.css` теперь кладётся в `data/custom.css` и не затрагивается при обновлениях движка через опцию `Upgrade code`. Таким образом теперь можно безопасно обновлять клоны этого форка штатными средсвами, не теряя оформление.",
			"added": 1525669668
		}
	],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"1524295020_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "И тест в ответе:\n\n![](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/data/img/post_85_20130511-1800-img_3969.jpg)",
				"added": 1524295047
			},
			{
				"comment_id": 2,
				"body": "Блин. Не понимаю, почему у меня прошлый раз не получилось. Всё реально просто, в одну строчку :)",
				"added": 1524295283
			},
			{
				"comment_id": 4,
				"body": "Пока не поддерживаются никакие параметры разметки, только сама вставка.",
				"added": 1524298540
			},
			{
				"comment_id": 6,
				"body": "> [rohn](#comment_1_1DDrZXzLsyuk2zrdwd3eQWUP7eypt6L5tQ):  Можно это поправить?\n\nИМХО, вставлять картинки в base64 — сильно перегружать посты. Но попробую.",
				"added": 1525169270
			},
			{
				"comment_id": 10,
				"body": "Тест отсутствующей картинки:\n\n![](foo)\n\n:D",
				"added": 1525611157
			},
			{
				"comment_id": 12,
				"body": "> [geekless](#comment_9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Самое близкое к движку галлереи изображений — http://127.0.0.1:43110/1D2C23aAoHeoJsvPjZZxS9bt3i93uRVfUP/ Но что-то он у меня не работает как надо.\n\nУ меня — тоже. Судя по попадающимся «escape from iframe» рассчитано на старые версии ZeroNet. На десктопе показывает фотки, на ноуте — пусто. Ну и социального функционала мало.",
				"added": 1525617264
			},
			{
				"comment_id": 13,
				"body": "> [geekless](#comment_10_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Не знаю, отчего так.\n\nЭто всё тоже какие-то заморочки с кроссайтовой безопасностью. Из-за этого теперь в ZeroNet, например, [MDWiki](http://dynalon.github.io/mdwiki/#!index.md) не работает — зацикливается на этой процедуре. А жаль, статические сайты было бы очень удобно делать.\n\n...\n\nС 0-Gallery, вроде, разобрался: http://127.0.0.1:43110/1Q6A7Wu7LKJv9bTnMjpYRhU8gQWi7jfpxW/\n\nТолько, как я понял, редактировать штатно после аплоада ничего нельзя. Как и дозагружать фотки.",
				"added": 1525618284
			}
		],
		"1524298219_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 3,
				"body": "Пока не поддерживаются никакие параметры разметки, только сама вставка.",
				"added": 1524298534
			},
			{
				"comment_id": 11,
				"body": "Тест не существующего видео:\n\n![](foo.mp4)",
				"added": 1525613001
			}
		],
		"1524308016_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 5,
				"body": "Забавно, как криво с точки зрения архитектуры ZN я раньше дорабатывал форумы и блоги. Стоит включить `--debug`, как все css разваливаются, ибо компилируются дважды :)",
				"added": 1524309352
			}
		],
		"1525248944_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 7,
				"body": "> Хорошо бы иметь на каждого юзера профиль со списком его тем, комментариев, датой последней активности и полем \"о себе\".\n\nВ приложениях такого нет и быть не может по сути ZN. В конкретной инфо о пользователе там, где её можно ввести, всегда можно дать ссылку на блог, который предварительно несложно завести :)",
				"added": 1525252582
			},
			{
				"comment_id": 8,
				"body": "> [geekless](#comment_5_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Не распарсил.\n\n- Унифицированного профиля в приложениях ZN быть не может\n- В тех приложениях, где пользователь может оставить о себе какую-то инфо, проще всего дать ссылку на свой профиль отдельным приложением\n- Лёгкость клонирования ZeroBlog'ов делает удобным создать один «блог-профиль», заполнить его всей нужной инфо и давать ссылку не него :) Заодно и обратная связь в комментах будет.",
				"added": 1525331792
			}
		],
		"1525528993_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 9,
				"body": ">UPD. Создал эту тему здесь по той причине, что на Ру.Зероталкс уже почти закончился лимит, а здесь 200к и админ постоянно бывает в сети\n\nВообще, ближе по тематике тут [Infonesy.Talks](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/) :)\n\nТам обсуждаются распределённые системы в целом и ZeroNet  в частности. А тут — только вопросы, связанные с движком ZeroTalks. Так что я бы перенёс дискуссию туда. \n\nНо если тут, то главное возражение — сейчас народ не идёт в ZN (и другие полностью децентрализованные сети) даже при наличии прямой рекламы. Так что более сложные варианты, типа стеганографии, не помогут привлечь тем более :)\n\n…\n\nПодобные меры могут помочь в какой-то мере в той гипотетической ситуации, когда в ZeroNet уже есть масса народа, народ левый и скандальный, средств регулирования, типа WoT и игнора недостаточно и хочется сформировать суб-сообщество с барьером вхождения :)",
				"added": 1525533023
			}
		],
		"1524971902_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 14,
				"body": "Альтернативное решение: [ZeroTalk with images](/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN/). Кажется, заброшено. Кривовато. Файлы грузятся неопциональными и прямо на форум.",
				"added": 1526244067
			}
		],
		"1535439560_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 15,
				"body": "По ссылке — Not Found :)\n\nИМХО, в ZN без привлечения сторонних сущностей, фотки лучше или в ZeroMe кидать, или в клон ZeroUp (в оригинальном 10Мб, ЕМНИП, минимальный размер, но в http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/ такого лимита нет.",
				"added": 1535480300
			},
			{
				"comment_id": 16,
				"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): У меня открылось. И да, там клон ZeroUp\n\nА у меня упорно:\n\n```\nNot Found\ndata/users/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/stickied-topic-position-bug.png\n```\n\nДаже когда открываешь с самого зайта по ссылке. Видимо, пиры найтись не могут с источником.",
				"added": 1535530492
			},
			{
				"comment_id": 17,
				"body": "> [geekless](#comment_11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Да, отследил на ванильном движке тоже. Непостоянный баг.\n\nПосмотрю в сентябре, как в Москву вернусь. На ноуте с мобильным интернетом ломает ковыряться :)",
				"added": 1535530528
			},
			{
				"comment_id": 18,
				"body": "> [geekless](#comment_13_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Подозреваю, что мы с anotherneko сидим в tor-only сегменте сети.\n\nСтранно, на зайте показывалось, что у файла 12 пиров. Загрузил зайт на «белой» удалённой машине — и тут же всё открылось и на ноуте в деревне :) Прямо мгновенно, без видимой задержки на загрузку :)",
				"added": 1535533586
			}
		]
	},
	"comment_vote": {}
}