{
	"file": {
		"1555670839-597327-GeoLite2City.zip": {
			"title": "GeoLite2-City",
			"size": 27141810,
			"date_added": 1555670840
		}
	},
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1555670851,
			"title": "GeoLite2-City",
			"body": "[ GeoLite2-City.zip](data/users/1Q8k2yxiuC9cPAasswdL7GuijdcQC5iRFB/1555670839-597327-GeoLite2City.zip)",
			"added": 1555670850,
			"parent_topic_uri": "1532872907_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1555673634,
			"title": "【安卓应用专区】",
			"body": "",
			"added": 1555673632,
			"parent_topic_uri": "1532872907_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz",
			"type": "group"
		},
		{
			"topic_id": 1555673679,
			"title": "APK",
			"body": "",
			"added": 1555673676,
			"parent_topic_uri": "1555673634_1Q8k2yxiuC9cPAasswdL7GuijdcQC5iRFB"
		},
		{
			"topic_id": 1555673777,
			"title": "【Windows应用专区】",
			"body": "",
			"added": 1555673772,
			"parent_topic_uri": "1532872907_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz",
			"type": "group"
		},
		{
			"topic_id": 1555673789,
			"title": "Windows应用",
			"body": "",
			"added": 1555673783,
			"parent_topic_uri": "1555673777_1Q8k2yxiuC9cPAasswdL7GuijdcQC5iRFB"
		},
		{
			"topic_id": 1555760053,
			"title": "如果一个人类身上所有的微生物同时消失会发生什么？",
			"body": "如题，我们都知道人体中存在着大量的微生物，且它们中的大多数对维持正常的生理活动非常重要。那么如果一个正常人体表和体内的所有微生物同时在某种神秘力量的作用下消失（这个过程不对身体造成任何直接影响）会有什么后果呢？后续是否有治疗的必要和可能？",
			"added": 1555760046,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1555760630,
			"title": "如果一个物体以足够快的速度来回运动，能否改变其内部分子结构？",
			"body": "",
			"added": 1555760622,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1555760671,
			"title": "如果这个世界上每个人都足够聪明并足够诚实，是否所有人对事物的看法最后会趋于一致？",
			"body": "",
			"added": 1555760662,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1555670851_1Q8k2yxiuC9cPAasswdL7GuijdcQC5iRFB": 1,
		"1555416986_1MhCdLnT4dyAk3HGiY6p9bJxhDvF3Spamd": 1,
		"1555673634_1Q8k2yxiuC9cPAasswdL7GuijdcQC5iRFB": 1,
		"1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1555512312_1GWtddwTWnfPiNy74196ckmKiKSeFtE9XM": 1,
		"1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1555512367_1GWtddwTWnfPiNy74196ckmKiKSeFtE9XM": [
			{
				"comment_id": 1,
				"body": "同样作为亲历过暴动的新疆人，我也无邀怒答一发吧。\n\n因为国情不同，具体情况不同，包括即便同样亲历的人，因为立场角度不同，所经历也不相同，每个人也有每个人自己角度的看法。很多东西只能参考。我也只能给出一些建议，具体还是要看事发时的情况。题主问的是大规模暴乱，以我国目前情况来看不需要准备成战乱状态或者废土状态。\n\n首先从我个人经历的经验给出一些建议，作为一个普通人，你可以没有超出常人的技能，可以没有经过任何训练，可以没有各种物资和装备。但是你不能没有警惕心。如何保护自己，意识才是第一位的。在遇到突发情况的时候，你根本不知道发生了什么，你没有上帝视角。所以提前戒备非常重要。如果你看到不自然聚集起来的人群，或是连续看到多个神情紧张鬼祟，身上还有什么特殊标记或者古怪服装，平时在这根本看不到的。那么你应该尽快离开这片区域。事发当天我就在路上看到多个穿着黑袍的人，我只是奇怪平时根本看不到这样的人，怎么今天突然冒出这么多。但我没多想，毕竟承平已久。然后我买完东西出来打算等车的时候，公交车等了很久都不来，因为公交车过来的方向已经发生暴动交通堵死了，但我不知道。然后我听见了骚动声，有人说那边打人了，还有人过去要看热闹。我的建议是：没事别看热闹。如果你们先是等车不正常的等很久马路上任何过来的车都没有，那必然交通出现情况，建议不要傻等，徒步离开选择别的交通方式。如果没等你离开就听见有骚乱声。我建议你们迅速撤离。\n\n如果你不走运，乘坐的公交车驶向暴乱方向，必然会因为堵车而停下车，建议留意下停车是堵车还是什么情况，如果听见骚乱声。请让司机开门让你下车。就算前面是打架，一时半会也过不去了，别傻等着。下车换别的路打车回家，出租车司机消息更灵通，哪里堵车都有车载电台联系。如果有暴动他们会比你更早得到消息。如果你回家之路上发生暴动，建议去朋友家，或者远离暴动的地方找个旅馆住一晚都好，别死心眼一定要回家。当天我姨姨的同事有一个坚持回家的，大家都说闹事了，别回家了，那边乱。他说我开车直接回家不停，没事。然后他死了。我同学打车，出租车司机说那边过不去了，闹事了，他来我家躲了一晚上。前两天我们还在一起吃饭。\n\n如果你开车碰到暴徒堵路，能掉头离开就别管交通规则了，没法掉头就开车冲撞过去，别管撞死几个，轧死都算正当防卫。撞过去以后再掉头离开。为什么让你们掉头不是一路撞过去，因为前面可能路都被堵死，被焚烧的公交车什么的横在路上，你开的不是铲车你就撞不过去。别指望你能一路碾压穿过暴动区。你不是在玩侠盗猎车。如果前方已经有车停在那，还有一群暴徒正在砸车，正在把人从车里拉出来砍死，你根本撞不过去，然后一时半会掉不过头，那么扔下车跑吧。别舍不得车还想着怎么掉个头。车被砸了有保险，没保险国家也有补偿。命没了虽然也有补偿，但你是花不到了。\n\n如果你直接碰到暴徒在对你行凶。首先还是跑吧，不需要跑的比暴徒快，比其他人快就够了，即便是普通人，体力也不相同，跑两步就喘的也是普通人，能一口气跑个几公里的也不算超人。这种时候如果平时多进行体育锻炼体能比较好跑得比较快的人显然生存几率更大。我个人建议平时没事多锻炼，即便为身体健康也是好的。万一遇到事能跑多远跑多远，能一直跑回家最好不过。不要进入商店躲藏，那都是被洗劫的目标。根据近两年的情况，我个人建议不要试图去政斧、部队寻求庇护，如果出了大规模暴动，这些部分必然第一时间接到通知，然后会严防死守，放不放你进去不一定，但是把你当成冲击机关的暴徒击毙，不是不可能。同样如果你碰到赶来维稳的军警，也请听从指挥，让你绕开走就不要往前冲，不要跟见了亲人一样往前疯跑。军警因为要直面暴徒，近些年牺牲的人数也不断增多，精神压力都很大，请不要刺激他们导致走火。不要因为看到救星来了过分激动，一定注意不要做出任何可能引起误会的举动。如果你身后还有暴徒追赶，别挡着射击视线，该找掩体找掩体。如果看对面枪都举起来了，请立刻抱头趴下。\n\n在暴动之初只要跑离骚乱中心还是有机会打到车的，跑到足够远的地方打车回家。打不到车也能跑多远跑多远。尽量远离骚乱。逃跑的时候尽量远离人群，暴徒肯定会盯着人多的杀。同样也尽量避免狭窄小巷。如果在人群密集的地方被挤在人群当中，也不要试图去其他方向，因为那很容易被人挤倒然后被人群踩死。顺着人群走到相对空旷一点的地方再分散。\n\n如果实在没跑掉，被堵住了，我个人不建议装死。暴徒很多的话，就从你身上踩过去你也从假死变真死。而且真正核心暴徒是少数，大部分都是被煽动从众的暴民，那些暴民也只是普通人，没受过训练，真砍人也会手软，但是他们会给尸体补刀来发泄自己的暴力欲望。看着没什么明显伤口好像还有气的，上去暴打一顿，又安全又爽快。还有摸钱包手机搜索战利品的，发现你身体还还是热的就会给你补刀的。这个我见得太多了。装死逃脱几率其实很小。\n\n同样我也不建议反抗，除非对方堵的不严实，你有机会突围出去，那么拼一把也可以，反正都是死，拼一把或许还有生路。不然你就是赵子龙，赤手空拳靠两条腿，你又能打几个？我的建议是藏起来，比如车底下，比如大型垃圾箱。如果有民居你敲门打开放你进去最好不过。但是别抱太大希望，这种情况下愿意庇护你的人并不多。如果已经被打了，根本跑不掉，我还是建议你往停着的车底下钻。会议部分几率对方没耐心跟你玩躲猫猫直接追打其他人去了，实在连车都没有，靠墙抱头蜷缩身体，如果没碰到一定要宰个人过过瘾的，你还有几率活下来。其实不是所有人都有杀人的胆量，很大一部分从众的暴民只是暴打一顿过过瘾就完了。躺在墙根保护好头，对方如果有武器很难直接挥下来打到你，因为会打到墙上。顶多拿石头砸你，保护好头致死率并不高。如果对方试图把你拖出来，或者扒开你保护头的手臂。我那建议你直接跟他拼了吧，对方打定主意要弄死你了。哪怕咬他一口再被打死也能解解恨。\n\n如果你逃出来了，受伤了，伤得不很重的话，去安全地方找个药店紧急处理一下伤口吧，伤的很重估计你也出不来了。别指望打110、120什么的，早就打爆了，那会根本打不通的。那会医院走廊都躺满了伤患，伤得不重能自己处理就别去医院了，伤的轻了根本顾不上你，还不如自己找个药店处理一下更快。要是怀疑骨折什么的，那还是去医院处理吧，毕竟你自己没法给自己正骨，去远离暴乱中心的医院伤患会少些，你更容易接受到及时的治疗。\n\n如果碰到政斧主导疏散什么的，让你干嘛就干嘛，别觉得还能溜出去捡个便宜，或者觉得人都聚一起目标更大更不安全想找个没人地方躲起来之类的脑残想法。有这种想法的人我都见过，现在坟头草已经不止三尺高了。那会在街上乱晃的被发现当暴徒击毙，可是不给你赔偿的，还不如被暴徒打死还有赔偿。\n\n即便在家里躲过去，三天之内，尽量别去暴乱中心小巷里。那会还有很多漏网的暴徒正在被抓捕，还不安全。如果能采购饮水和食物，去买够三天的就够了，最多够用一礼拜的，再多也没必要，给别人留点吧。就算没买到也不用太过担心。放心，以目前国内情况，政斧不会看着你渴死饿死的。无论多大规模，快反部队一天之内就能赶到和荡平暴徒。只是外面会有一些漏网的暴徒等待抓捕，三天内尽量少出门。如果工作地点需要穿过暴动区，最好请几天假，估计你不请假单位也会停工两天。反正我知道有几个人第二天觉得已经天下太平了，家里说外面乱要不先别去上班了，还说不上班喝西北风啊，要相信政斧。然后出门再没回来。所以即便暴乱被镇压下去，最初几天依然要小心，不过最多一周秩序就会恢复正常。\n\n如果社区组织居民巡逻，可以报名，但是如果有人叫你去报仇雪恨，反打暴徒去，我建议不要去。别觉得什么要有血性之类的。在家里老实待着吧，政斧需要的是维持秩序，你们上街报私仇，显然是破坏秩序，乱世用重典，到时候抓典型抓的都是你们。\n\n至于心理调节什么的我懒得说了，太脆弱的人被自然淘汰掉也好。",
				"added": 1555760164
			}
		],
		"1555512312_1GWtddwTWnfPiNy74196ckmKiKSeFtE9XM": [
			{
				"comment_id": 2,
				"body": "外面的混混们！ㄟ( ▔, ▔ )ㄏ\n\n你们确定，要攻打..o(￣ヘ￣*o)\n\n中央党校？Σ( ° △ °|||)︴",
				"added": 1555760209
			}
		]
	},
	"comment_vote": {}
}