{
	"next_topic_id": 62,
	"topic": [
		{
			"topic_id": 1630722132,
			"title": "社交软件研究",
			"body": "",
			"added": 1630722129,
			"type": "group"
		},
		{
			"topic_id": 1630722359,
			"title": "飞聊在绝大部分应用商店下架 字节社交的首场败仗",
			"body": "飞聊停飞，是字节社交的开始还是结束？\n\n字节吃了社交赛道上的首个败仗。\n\n近日，Tech星球获悉，字节跳动两年前重磅推出的社交产品飞聊App“停飞”。这距离飞聊App两周岁生日，还有不到19天的时间，飞聊已在绝大部分应用商店内下架，且官网也无法提供下载。\n\n通过七麦数据提供的信息可以发现，飞聊在苹果应用商店和安卓应用商店内已经下架了一个月左右。小米和OPPO的应用商店虽然显示还在架，但Tech星球尝试去这两家应用商店内搜索飞聊，但分别显示该App已下架和该App正在调整中，暂无法提供下载。\n\n另外，Tech星球也于近日前往飞聊的官网（feiliao.com)，虽然仍有介绍飞聊App的信息显示，但点击“下载”按钮后，会跳转至空白页面，说明官网渠道已经无法提供移动端的正常下载。\n\n一位资深的产品经理表示，这意味着，飞聊已正式关闭全网的下载通道，距离官方的正式关停只差一个公告，或者可能连公告也不会出，因为飞聊的发布，采取的是冷启动的方式，悄然诞生、黯然离去也许是终局。\n\n另据一位原飞聊员工向Tech星球透露，飞聊在去年1月份发布PC版时，被外界视为飞聊将入局PC的社交市场，此时的飞聊团队仍然有200多人，但是从去年年底，飞聊团队组织架构发生了变化，其产品负责人单袆现已离职，飞聊的大多数技术团队也都转岗至字节跳动的教育线、抖音等，仅保留少数的维护和运营人员，负责飞聊的日常。\n\n此外，因为内部对飞聊的未来并不乐观，所以为了减少运营成本，飞聊仅维护iOS端的用户的版本更新，安卓端从去年4月份起，就已经停止版本的迭代。\n\n还记得飞聊上线之初，字节跳动官方就曾表示：“飞聊”是我们在社交领域的一次探索和尝试。对于字节而言，在QQ和微信这两座社交大山的面前，字节的社交之路注定不会平凡，不到两年，随着飞聊的全网下架，意味着字节的兴趣社交已被画上阶段性句号。字节的社交出路又会在何方？\n\n-----------------------------*/*******-------------------------\n\n上线两年，飞聊“飞”的并不顺利\n\n2019年，可以称作是字节的社交元年，在这一年内，字节有多款社交产品上线。\n\n同年1月，字节就上线了两款社交产品，一款是主打短视频社交的多闪，于1月5日高调面世，另外一款则是主打图片社交，类似于INS的社交产品“心图”。心图是不为人所知的一款字节系社交产品，这款社交产品晚于多闪十几天，采取冷启动的方式出现在各大应用商店内。\n\n然而，字节并不会把鸡蛋放在一个篮子里，而是采取多条线赛跑的方式，去探索最适合自己的社交方向，于是就有了另外一款社交产品，放在了兴趣社交赛道。\n\n2019年5月20日，字节跳动宣布上线社交产品“飞聊”。定位是一款开放性兴趣社交产品，是即时通讯软件和兴趣爱好社区的集合，致力于帮助用户发现共同爱好。这款社交产品选择在当时上线，正是看中了兴趣社交头部产品“即刻”下架后，留下的市场空隙，而飞聊希望自身能够填补这一市场。所谓理想是美好的，但现实确很残酷，飞聊并没能在兴趣社交中取得优势地位。\n\n上线之后，被外界定位为将会冲击“微信”的“飞聊”，并不顺利。起初，“飞聊”尝试将微信用户引流到飞聊内。吃了闭门羹后，字节开始调动自身资源，通过今日头条和抖音这两大拥有亿级用户资源的平台为其导流。\n\n不久后，今日头条上线开通“飞聊公共主页”功能入口，该功能针对头条平台的部分优质创作者，有利于创作者在飞聊率先获取流量粉丝，受邀账号可开通飞聊公共主页并同步头条账号内容。\n\n紧接着，今日头条和抖音又上线飞聊的专属分享窗口，为飞聊引流。很显然，这种引流并没有多大作用，因为今日头条和抖音在当时主要是内容平台，它们虽有亿级用户，但并未能形成社交关系链，无法像当年QQ那样为微信引流。而飞聊作为社交平台，仅靠字节系的内容去维护和深挖社交关系，显然也不太可能。\n\n打铁还需自身硬。飞聊的核心玩法，就是通过创建多个“小组”的形式，形成不同爱好者的聚集地，用户们可以在其中以较低的门槛产生互动。飞聊为了让兴趣爱好者们广交好友，于是在人际关系上选择了进一步开放，比如不需要加好友就可以直接和对方聊天、不需要同意就可以直接加群，降低用户之间的社交门槛。\n\n对于刚起步的飞聊，这些办法是很有效果的，据七麦数据显示，其上线一个月内，安卓端的日均下载量高达9万次，但好景不长，一个月后，其下载量开始下跌。\n\n作为兴趣社交产品，首先要考虑的就是精准推荐同好好友，就像今日头条和抖音那样。但恰恰相反，飞聊似乎并没有考虑精准推荐的颗粒度。当时，有部分用户反映，第一次进入飞聊时，却发现飞聊并不能匹配到自身的兴趣圈子，而且也找不到志同道合的朋友时，就会让用户对飞聊留下并不好的第一印象，继而让用户觉得飞聊用处不大，并把这种不愉快的体验感，告知身边正在使用飞聊的好友，从而造成飞聊口碑上不去，用户还要流失的局面。\n\n另外，众所周知，兴趣文化是一群人约定俗成的一种行为模式，它需要时间的沉淀，以帮助人们形成这种习惯。所以，社区文化的建设是个强运营的事情。飞聊在自身文化和内容都很贫瘠的情况下，想快速切入，并形成独特的小组文化，实属难上加难。\n\n可以说，飞聊在前期的运营失利，导致了其体验差强人意，用户外流似成定局，飞聊也意识到了其问题所在，做出了相关的补救措施，其中，补救的重点是以内容建设为主。\n\n图片\n\n压垮飞聊的最后一根稻草\n\n如果没有优质的内容，兴趣社交就是个伪命题。\n\n2019年下半年，飞聊运营启动了一个名为“闪光计划”的项目，并在同年11月升级为“闪光计划2.0”。专注于培养小组组长对内容的创作和运营，也就是为组长进行流量扶持以及权力上的加持。\n\n图片\n\n这个计划的根本目的，就是为了打造头部小组，以质量取胜，形成头部效应，吸引更多的用户加入其中，从而带动中腰部的小组组长的积极性，参与到小组的内容建设。\n\n飞聊采取了闭门造车的方式，搭建内容体系。以高校为阵地，开始在各大高校内进行宣传和小组入驻邀请，并在各大高校设置了相关的校园大使，运营和建设小组，但是这一缺点也很明显，因为贴吧的存在，导致飞聊存在可替代性，如何让各高校的学生加入并认可飞聊，显然，依靠一个校园大使很难完成任务。\n\n而在内容的建设上，校园大使也并不能每天都能保持大量内容的更新。一位曾是飞聊校园大使的同学告诉Tech星球，他们当时的自创内容很少，再加上没有飞聊的指导和协助，所以主要还是依靠搬运，通过在本校的贴吧以及微博中，搬运部分有趣的内容到飞聊小组内，但效果不佳，因为内容同质化的前提下，大家还是喜欢逛贴吧等社区，所以也就导致了飞聊内许多高校小组的内容没有办法深耕，收效甚微。\n\n既然闭门造车不行，可以尝试引入外部力量，今年最火的ClubHouse，依靠的就是名人效应，而飞聊团队确实考虑引如大V入驻，但考虑到成本等原因，最终放弃了这个选项。\n\n在如今“圈子”流行的年代，单靠飞聊现在的运营模式与功能，与众多同质化的产品竞争，很难有所建树。\n\n内容和运营上的双向失利，让飞聊改变了方向，开始谋划PC市场。“这或许是飞聊的最后一次尝试”，一位原飞聊的员工表示。\n\n2020年1月，飞聊上线PC版，此版本最大的特点就是剔除了兴趣小组功能，转为纯IM属性，同时加入了线上办公功能，比如文件的存储等，这是飞聊的又一次尝试，也是最后的一次尝试，遗憾的是，飞聊的电脑版并未激起浪花，现在也是很久没有更新，飞聊的PC之行，也就此告一段落。\n\n此后，飞聊在其功能上再无重大更新，团队开始缩减，仅保留少量日常维护和运营人员，虽然能够降低开支，但也导致了监管问题的频发，这成为压倒飞聊的最后一根稻草。\n\n由于飞聊上仍然具有社交和支付功能，再加上监管的缺失，这为不法人员提供了便利，通过在网上搜索相关词语，可以发现飞聊成为了一些不法分子犯罪的温床，这是飞聊所不愿意看到的一面，这也是飞聊衰败的一个缩影。\n\n据一位接近飞聊的人士透露，飞聊在社交上的失利，以及后期监管问题的出现，直接导致了飞聊如今全网下架的结局，这是飞聊团队所不愿意看到的结果，但也不得不做出下架的决定，飞聊成为了字节在社交上吃下的首个败仗。\n\n图片\n\n字节的社交困局与野望\n\n在飞聊上的失利，间接的促成了字节在社交探索方向上的改变。\n\n回望字节此前社交上的5驾马车：多闪、心图、飞聊、飞书和抖音。如今，还在发力的还有飞书和抖音，这也是字节现在所依仗的两个核心产品。\n\n2020年初，由于疫情的影响，线上办公逐渐兴起，飞书凭借即时沟通、共享日历、在线文档、音视频会议、云盘等功能进行了深度整合作，赢得了许多企业的青睐。覆盖了不同规模、不同行业的各种公司，其中不乏有几十万员工数的知名企业。\n\n另外，飞书也成了字节在商业方面的社交和沟通平台，目前抖音电商等商家用户已经接入到飞书中。飞书已然成了字节在争夺B端流量入口的核心。\n\n抖音则是字节在社交布局中的又一枚棋子。抖音做社交的想法一直都有，最初是通过打造多闪，作为附属抖音的一款独立社交App去进行探索，但是效果并不理想，主要还是因为多闪定位的“短视频社交”，在当时并不被用户所接受。\n\n随后，抖音开始围绕自身去搭建社交体系。先后上线“连线”、“视频聊天”、“朋友”、“抖一抖”、“一起看”等社交功能，在熟人和陌生人社交上都有涉足，试图在不断试错的过程中，找到突破口。\n\n\n字节跳动中国区CEO张楠认为，抖音的社交功能是个自然发生的过程，用户的表达互动需求在抖音内部开始发酵，促进了抖音的社交。她认为，抖音的本质和核心是人，抖音为每个人提供了视频化的表达方式，并围绕人提供服务。越来越多用户在抖音上的视频化表达，让抖音逐渐从一种娱乐方式变成一种社交方式，未来还可能成为一种生活方式。\n\n如今，字节在社交领域屡战屡败的情况下，实现字节横跨内容与社交两大领域的野心，唯有抖音是最有希望成功和最符合的那一个社交化产品。彭博分析认为，抖音目标是今年日活用户达6.8亿，电商规模达5000-6000亿元。如果在2021年，抖音希望其他业务，比如游戏、电商等业绩再上一台阶，则需要注重沉淀社交关系链。这对抖音生态内的电商带货、知识付费、游戏分发三方面，将带来积极影响。\n\n未来，不排除字节会上线其他的社交产品。但可以肯定的是，现阶段的抖音和飞书，将分别承载着字节在C端和B端的社交野望。字节的社交之路，注定还要经历一番风雨。",
			"added": 1630722355,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1630722411,
			"title": "微信圈子",
			"body": "微信圈子，是微信的一个功能。\n2021年5月28日，微信圈子发布公告表示，因业务发展方向调整，于2021年12月28日正式停运。",
			"added": 1630722406,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1630722461,
			"title": "【有利可图】腾讯朋友再次关停，阿里“Real如我”停服运营，大厂社交为何屡败屡战？",
			"body": "打败微信的，绝不是下一个“微信”。\n\n6月28日，腾讯宣布因业务发展策略调整，将在2021年6月30日关闭旗下“腾讯朋友”的服务器，正式停止该App的运营，这个在2019年12月份复活的App，仅仅存活了不到两年就再次被关停。\n\n“腾讯朋友”其实已经不是第一次关停，早在2017年8月，腾讯就已经停止运营该App，只不过在当时也没有掀起多少波澜，只是引来了少数用户的感叹，随后就很快被其它的互联网新闻所掩埋。\n\n腾讯“朋友”的前身是朋友网，原名QQ校友，是腾讯公司打造的真实社交平台，为用户提供行业、公司、学校、班级、熟人等真实的社交场景，对标当时火热的人人网，但最终还是由于校园社交的没落，终在2017年8月6日停止运营。\n\n实际上，除了腾讯“朋友”外，2021年也成为了其他家社交产品谢幕最密集的一年。2019年，在社交领域沉默许久的阿里再度启动“来往”项目，由原“来往”产品负责人陈航负责。并在同年，正式公开其社交新产品“Real如我”，被外界解读为阿里在社交上的又一次大跃进。\n\n但在2021年5月，有不少用户收到了阿里“Real如我”的关停信息，意味着运营了近两年的“如我”并没有找到适合基于地理上的校园社交发展路线，并在6月17日停服运营，也宣告了阿里在社交领域上的再次失败。\n\n除了阿里、腾讯这两大巨头外，像京东、字节、百度、小米等大厂的社交产品，虽然没发布正式停服的通知，但也在2021年选择了低调下架处理，或者长期不更新导致App已无法正常使用，这样的做法无异于是另外一种形式的关停。\n\n2021年，似乎成为了大厂们社交产品的终点站，微信之后，已有十年之久再没出现下一个“微信”，无论是作为社交巨头的腾讯，还是积极参战的其他大厂，面对后微信时代的社交，都没能交上一份完美的答卷。\n\n屡败屡战的大厂们，其破局之道又在何方？\n\nBBATJ的滑铁卢\n\n马化腾曾表示：年轻人在互联网上喜欢的东西我越来越看不懂，这是我最大的担忧。美国“阅后即焚”Snapchat非常火，我们自己用起来觉得没什么意思。每天早上醒来最大的担心是，不理解以后互联网主流用户使用习惯是什么。\n\n如今看来，不仅是作为社交巨头的腾讯，其他的玩家也很难去理解互联网主流用户的社交心态。\n\n2019年成为了各家发力新社交的重要一年。在这一年，涌现出字节跳动、快手这样的新势力，也有像搜狐、阿里、百度这样在社交领域蛰伏多年的老玩家，携带新社交产品卷土重来。\n\n据不完全统计，发现从2019年起到目前为止，具有代表性的社交产品已有三十多款相继面世。\n\n但是，其中绝大部分的社交产品，目前都已经下线或停运。\n\n以腾讯为代表，其推出的猫呼、回音、轻聊、有记、朋友、灯遇交友、欢遇等7款社交产品中，只剩下“有记”还在主流的应用商店内，但也有数月未更新。同时，可以发现腾讯这7款社交产品分属视频、语音、职场、匿名、相亲等5大社交细分赛道，选择这5条细分赛道，也是看中了其巨大的市场以及还未固化的份额。\n\n特别是规模超亿元的互联网婚恋交友市场，腾讯一口气就推出了轻聊、轻缘、欢遇和对聊等4款产品，也希望能够分得一杯羹，但现实是想当红娘的腾讯未能如愿，在其他赛道上也表现的平平无奇。\n\n而百度、京东、阿里这些老玩家，也避开微信的锋芒，在他们的生态下寻找社交发力点，他们这一次不约而同的选择了校园社交。\n\n2019年起，百度、京东、阿里相继推出了校园社交产品听筒、梨涡和Real如我。这三款社交产品的定位互不相同，听筒侧重匿名社交，梨涡侧重校园社交+电商玩法，Real如我则是真实社交。\n\n行业分析人士认为，这3家大厂选择做校园社交，看中的是学生作为社交产品中的活跃群体，有更多的时间可以用来交友，可以迅速成为各自产品的用户。但互联网分析师葛甲则表达了不同的看法，认为校园社交本身是成立的，但是由于国内用户更习惯使用的是即时通讯，所以导致校园社交在国内很难做起来。事实也正如葛甲所说，这三款校园社交产品最终还是走向了关停或停更的状态。\n\n除了老一派的玩家外，也涌入了不少的社交新贵，主要以字节和快手为代表。字节推出了短视频聊天App多闪和兴趣社交App飞聊，快手则推出了短视频聊天App一甜面聊、音乐短视频社区避风、宠物社区毛柚和音乐社区小森唱。\n\n但这些新产品同样面临着下架甚至关停的局面。其中，被字节寄予厚望的飞聊App已经在多个应用商店内下架，而且飞聊目前也无法正常使用，快手的毛柚、避风和一甜面聊也有数月未进行版本更新，这对于产品而言，是极不正常的现象。\n\n可以看出，无论是社交巨头，还是新老玩家，在社交领域上都遭遇到不同程度的滑铁卢。难道是现在的用户对社交突然不香了吗？当然不是。\n\n相比于大厂们在社交上的节节败退，一些规模不大的社交新势力却在一路高歌猛进。\n\n2016年底，一款基于兴趣图谱建立关系，并以游戏化玩法进行产品设计的新一代年轻人虚拟社交产品Soul上线。截至2021年3月，Soul App是行业同品类中日均DAU启动次数最高的APP之一，也是日均发布率和Z世代用户渗透率最高的App之一。\n\n仅从Soul的数据来看，Soul无疑是成功的一款社交产品。众所周知，陌生人社交App都面临着两个陌生人“破冰”的问题。在陌生人社交中，陌陌、探探选择了荷尔蒙社交，而入局较晚的Soul则选择了灵魂配对的玩法。\n\nSoul的灵魂匹配玩法，避免与陌陌、探探这类以颜值论高低的社交产品竞争，更加强调内在美，主打非颜值，和内容的社交，让更多的年轻人能够自由表达交友的诉求，解决因颜值社交所带来的问题。这也是让Soul在已有陌陌和探探这两大陌生人社交巨擘的情况下，能够突围的核心功能。\n\n2018年，相亲赛道上的一款名为“伊对”的App也异军突起，这是一款通过实时视频互动解决陌生人社交破冰的障碍，同时为单身人士创造并提供多场景的线上相亲机会的相亲交友App。目前注册用户超4000万，并颇受资本青睐，获得由小米、云九资本联合领投的B轮融资。\n\n国内的单身人口已经突破2.4亿，但是在众多相亲交友App中，都缺乏一个高效和有趣的产品来服务这些用户群体的恋爱交友需求，“伊对”恰好踩中了市场需要。\n\n伊对短短3年在互联网相亲赛道上跑出来，除了“直播+相亲”创新模式外，也开始向同行业关注较少的下沉市场用户提供差异化服务，让本地人利用闲暇时间来当红娘，因地制宜，较好地解决了本地人单身人群在线上相亲无话可聊的痛点。\n\n此外，还有一款在泛娱 乐社交细分领域脱颖而出的社交App玩吧。通过推动社交场景娱 乐化，以小游戏、语音互动等方式为用户创造丰富和封闭的娱 乐场景，释放社交压力的同时增加趣味性和沉浸感，契合了当下95、00后的新型社交需求。\n\n一位00后的用户表示，玩吧是当下很火的一款社交娱 乐App，下载的用户也比较多，基本上他身边十个人，有九个人手机里都有这款App。或许这只是个例，但也透露出像玩吧这类社交产品在年轻人中的地位。\n\n在体验上，玩吧App除了游戏丰富外，社交方式也很广泛，不仅可以通过玩友ID加好友，游戏加好友，还可以通过话题广场下，寻找兴趣一致、有共同话题的“同好”加好友。这样的社交方式使年轻人获得了更多的朋友，激发了社交兴趣。而在热门话题下，也可以分享自己的作品和经验，遇到志同道合的朋友，以兴趣驱动社交，类似于“即刻App”一样。\n\n正是基于表达自我，获得认同感和归属感，才让玩吧能够成为年轻人手机中必不可少的应用。\n\n除了以上具有代表性的社交新势力外，还有像TT语音、微光、会玩等产品正霸占社交赛道，社交新势力正成长为大厂们的有力竞争者，虽然很难再造另一个“微信”，但新势力的崛起，也让更多的企业和个人看到了社交细分赛道上的无限可能。而对于大厂而言，一场激战在所难免。\n\n社区成大厂的下一个野望\n\n面对新势力们的挑战，大厂们虽屡战屡败，但并没有放弃，仍然选择迎战，而且还选择了以社区作为社交玩法进行探索和发力。\n\n在今年对外官宣关闭兴趣部落、腾讯朋友后，腾讯开始着力打造社区玩法。不久前，腾讯推出QQ看点社区，将内容和社区进行结合，打造吸引年轻用户的内容资讯平台。\n\n此外，腾讯于近日冷启动了一款名为“Q次元”的社交App。据悉，Q次元是为年轻人量身打造的一站式多元群组社区。\n\n体验发现，Q次元是腾讯首次尝试群组聊天的App，打破了以往的一对一聊天模式，并且采用了语音聊天室的玩法，加强了娱 乐化。其次，是通过划分频道群聊，花式构建多话题实时聊天的特性，可快速找到想要加入的话题，高效地浏览关注的信息。此外，还支持自定义创建和管理群组内的频道，可为群组成员添加各类“身份”等玩法。\n\n据一位前腾讯产品经理介绍，这款产品是由PCG创造营打造的重要创新App。腾讯推出Q次元App，可以看作是腾讯将以往的点对点社交方式向群组聊天的玩法转变，也可以理解为在QQ之外，再造一个“QQ群”。早在2012年，QQ群就开始向社交化方向试探，希望把即时通讯和社区化紧密结合起来，加强即时社交同时搭建异步社交。Q次元正是被腾讯赋予在这条路线进行探索的先行军。\n\n可以看出，腾讯正在以社区作为未来社交发展的一大路线。除了嗅觉灵敏的腾讯外，字节和快手也在探索社区玩法。\n\n快手率先于今年早些时候，推出了一款名为“小森唱”的原创音乐社区，拥有音乐播放、音乐智能创作功能，也可以让众多音乐爱好者进行交流，\n\n“小森唱结合了音乐+社区的玩法，能够满足用户在听音乐、创造音乐的同时，还能通过社区互动，增加用户的留存”，一位产品运营表示。\n\n而字节旗下的抖音在社区的建设上则更加干脆。据悉，抖音于近期在其App内测试了同城社区功能——抖音同城圈子。\n\n字节跳动CEO张楠此前在谈到抖音的社交功能时表示，抖音的社交功能是个自然发生的过程，用户的表达互动需求在抖音内部开始发酵，促进了抖音的社交。她认为抖音的本质和核心是人，抖音为每个人提供了视频化的表达方式，并围绕人提供服务。越来越多用户在抖音上的视频化表达，让抖音逐渐从一种娱 乐方式变成一种社交方式，未来还可能成为一种生活方式。\n\n如今看来，张楠的话正在一一实现，从此前的连线、抖一抖交友，再到如今的抖音同城圈子，抖音正在实现社交从点到面的过程，字节的社交玩法也迎来了重大升级。\n\n无论是社交新势力，还是大厂们，他们的社交之路，注定还要经历一番风雨。寻找下一个“微信”，已成为他们的共同目标。也许不久后，这些少年们能够达到与“孤独求败”的张小龙，“过招”的境界。",
			"added": 1630722455,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1630722535,
			"title": "陌陌出小组功能了，大家怎么看？",
			"body": "",
			"added": 1630722528,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1630722560,
			"title": "递爪停服，类Clubhouse中国还有机会吗？",
			"body": "",
			"added": 1630722552,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1630722703,
			"title": "如何评价知乎的「圈子」功能？",
			"body": "",
			"added": 1630722694,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1630724652,
			"title": "游戏资讯",
			"body": "",
			"added": 1630724642,
			"type": "group"
		},
		{
			"topic_id": 1630724674,
			"title": "第三鸟称竞速游戏《滑板鸟》将于9月16日发售",
			"body": "今年E3上亮相的“第三鸟称”竞速游戏《滑板鸟》本定于8月发售，因一些特殊原因，延期一个月，将在9月16日正式发售。该作有着滑稽可爱的小鸟和丰富的地图场景，玩家将操控小鸟进行各种滑板炫技。游戏支持简体中文。",
			"added": 1630724663,
			"parent_topic_uri": "1630724652_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631062328,
			"title": "你做过哪些愚蠢的事情？",
			"body": "",
			"added": 1631062314,
			"parent_topic_uri": "1623916421_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631067573,
			"title": "主攻“社区社交”，Q次元能成为下一个“QQ”吗？",
			"body": "编辑导语：伴随着移动互联网的快速普及与新一代用户群体的成长，社交领域的各个玩家们或在熟人社交、或在陌生人社交赛道上推出相应的社交产品或软件功能，以求能获得年轻用户群体的青睐。本篇文章里，作者对社交软件Q次元的推出做了一定剖析，一起来看一下。\n\n人类永远都会有表达和沟通的欲望，这也是“社交”熠熠生辉的重要原因。\n\n事实上，身为这一代互联网原住民，在代沟、被鸡娃压力、独生、留守等时代因素的叠加影响下，他们的内心更细腻，也更渴望交流与表达。\n\n为了占领这块市场。互联网大厂不断推出社交APP，但又很难弄清楚“这群年轻人究竟想要什么”，所以，互联网大厂这些年的社交产品又屡屡扑街。\n\n在社交领域，最有“发言权”的腾讯也屡次碰壁。前脚刚下架了“朋友”的腾讯，后脚立马又上线了“Q次元”。\n\n那么，这款名称和QQ极其相似的社交软件到底有何特别之处？Q次元会成为下一个QQ吗？\n#一、定位“群组社区社交”，Q次元是什么新物种？\n\n在自己的核心领域，腾讯向来守的很紧。从来不会放过任何一个“带威胁”的敌人，也不会错过任何一次扩大底盘的机会。\n\nQ次元就是由腾讯PCG创造营打造的一站式多元群组社区，它的目标就是为了吸引年轻人。\n\n根据笔者观察，Q次元以“群组”为载体，用户可以在相应的群组下搭建自己的频道，频道可选择文字频道和语音频道。产品还处于测试阶段，暂时只能通过扫描分享的群组二维码才能加入。\n\n那么，Q次元和QQ有什么区别？可以说，Q次元是取之于QQ，不仅在交互界面上与QQ相似，而且文字频道也类似QQ群聊天，可以笼统地理解为，Q次元就是独立的“QQ群”。\n\n但是在定位上，两者有所不同，QQ更加倾向于点对点社交方式，而Q次元更加倾向于群组聊天。\n\n除此之外，Q次元还吸取了现有大热APP的优点，例如，语音频道就类似于之前大火的多人实时语音Clubhouse，由频道主发起并主持，用户可以选择上麦，也可以选择旁听。\n\n可以说，Q次元打造了一个中间地带。比QQ、微信这种熟人聊天软件稍远，又比微博这种大众社交媒体更近，根据官方描述，Q次元是一个更真实，更有趣，更有深度的社交空间。\n\n那么，从点对点社交方式到侧重于群组聊天，腾讯在打什么算盘？\n#二、Q次元藏着腾讯背后什么野心？\n\n巨头不会打无准备的仗，更不会做没意义的事。那么，腾讯借着这个QQ群角色的APP是为了达到什么目的呢？\n\n从用户需求角度，Q次元是为了满足年轻人日益多元的交友需求。随着Z时代的成长，亚文化在中国也逐渐发展起来，目前在年轻人中比较活跃的圈层文化有兽设、Pia戏、语C、娃圈、姬圈等。\n\n由于亚文化是与父辈文化和主导文化既抵抗又合作的一种社会文化，所以大多数亚文化圈子里的人习惯于“圈地自萌”，年轻用户的“圈层意识”明显，有意地将小众圈层从大众里区隔开，并对圈子有着极高的珍视程度和保护意识。\n\n但同时圈子内的人又有沟通交流的欲望，这个时候就需要一个类似QQ群的陌生人社区社交软件。\n\n毕竟，在现有的陌生人社区平台上（例如某吧和某乎）现在越来越商业化，有很多广告，`*用户信息筛选成本高*`，所以更加期待“纯绿色”的交流软件，Q次元也是顺应了用户的需求。\n\n从腾讯自身角度来看，在陌生人赛道中，腾讯却始终没能做出和自己“社交地位”所匹配的APP。在规模超亿元的互联网婚恋交友市场，腾讯曾推出了轻聊、轻缘、欢遇和对聊等4款产品，但腾讯未能如愿，这四款APP在赛道上表现的平平无奇。\n\n在巨头疯抢的校园社交领域，腾讯更是铩羽而归。2021年6月底，腾讯“朋友App”（前身朋友网，原名QQ校友）发布了一则公告：由于业务发展策略调整，2021年6月30日关闭服务器，正式停止运营。\n\n连“后起之秀”都比不过，更不要提超越“陌陌”、“探探”和“soul”，而腾讯亟需利用“社区社交”翻盘。\n\n那么，Q次元真的能够为腾讯提供一次在陌生人赛道中逆袭的机会吗？笔者认为，主打 “社区社交”的Q次元确实可能。\n\n2019年，华兴资本董事总经理刘佳宁在一次公开演讲中表示，互联网综合社区的价值还未被充分挖掘。\n\n而且社区是唯一能够密切连接内容、创作者和大众用户的产品，依靠着“社区文化”为载体，各界都已经出现了巨头。如中长视频的B站、图文界的知乎、健身界的keep、音乐领域的网易云。\n\n腾讯也眼馋社区的价值很久，终于在自己熟悉的社交领域找到了用武之地。毕竟通过熟人网络打造社区氛围局限性很大，只有从陌生用户上下手，才能相似的生活方式和文化理念，形成一个很好的社区。\n\n那么，“Q次元”真的能够成为下一个QQ吗？\n#三、“Q次元”能够成下一个QQ吗？\n\n根据腾讯2021年第一季度财报，微信及WeChat合并月活12.4亿，而根据中国互联网络信息中心第47次中国互联网络发展状况统计报告显示，目前我们国家的网民数量为9.89亿人。\n\n可以说，在熟人社交领域，腾讯已经占据了绝对的龙头地位。微信和QQ成为熟人社交赛道两座大山，这些年里不断有攀越者，但始终未能超越这两座高峰。\n\n其中，QQ的月活为6.06亿。虽然相比于高峰时期QQ8亿月活有所下跌，但年轻人占比是在上升的。《2019腾讯00后研究报告》显示，64.3%的00后通过QQ来获取明星信息；而易观也有数据显示，QQ用户中95后占比高于25%，活跃渗透率TGI高于微信。\n\n所以，想成为下一个QQ，Q次元还得先抓住年轻人，但是这一届年轻人可没那么好抓。\n\n首先，QQ之所以能够一直保持活力，很大程度上是因为QQ在不断自我更新。已经21岁高龄的QQ还保持着自我突破的热情，接连推出“兴趣部落”、“QQ小程序”、“小世界” 、“QQ看点”、“小游戏”等新功能，借此增强用户粘性和用户留存时长。\n\n而Q次元却只是一个年轻的社交软件，暂且没有显示出特别之处，想要拿下年轻人还需要不断地完善、更新、突破。现在断言其发展有点言之过早。\n\n其次，现在的市场状况也不似当年，QQ的起步阶段并没有很强大的对手，顶多是主打陌生人聊天的聊天室。但现在新兴力量不断崛起，Q次元面对的是更加激烈的市场竞争。\n\n除了多闪App、飞聊App、积目APP、一甜面聊App等陌生人交友APP之外，还有垂直社区APP，例如宠物社区毛柚、音乐社区小森唱、音乐短视频社区避风。这些都是Q次元的潜在竞争对手。\n\n所以，现在的Q次元不能与当年的QQ相提并论，面对“花心”的年轻人，Q次元的未来充满变数。而且，即便是在社区社交这条细分赛道上，腾讯既不是“第一个吃螃蟹的人”，也很难成为“时代的终结者”。\n\n在这个赛道，前有百度贴吧、豆瓣兴趣小组，包括虎扑、知乎、微博超话等老牌社区产品，都活跃在市场中。后有互联网大厂相继入局，Q次元很难占得头筹。\n\n最近，社区成为互联网大厂的新战场：抖音于近期测试了一个名为“同城圈子”的社交功能。致力于帮助抖音用户找到更多志趣相投的朋友；而360也没有闲着，推出了一款名为“顽皮橙旅行”的App。这同样是一款社区产品，定位是游玩同好社区。\n\n另外，社区社交也是一块难啃的骨头，即便是有着天然的社交优势的腾讯，也尝到了失败的滋味。\n\n早在2012年，QQ群就开始向社交化方向试探，希望把即时通讯和社区化紧密结合起来，但成效甚微；今年1月，QQ兴趣部落宣布停运；五月末，腾讯旗下的一款社区产品“微信圈子”也宣布关停。\n\n那么，什么才是一款好的社区产品？根据笔者的理解，一款好的社区产品中，用户与产品并非是供求关系，而是共生关系。社区产品为用户提供价值，而用户也能在成长过程反哺社区。\n\n而且，在社区产品凝聚了一群有细分需求的重度用户之后，更加重要的是是如何变现。光靠“为爱发电”是行不通的，Q次元还得找到一条合适的商业化路径。\n\n更值得一提的是，拿下“社区社交”并非是Q次元的重点，对标B站才是。根据企查查APP显示，近日，腾讯科技（深圳）有限公司申请“Q战”商标，国际分类涉及设计研究、社会法律、科学仪器等，目前商标状态均为“注册申请中”。\n\nB站从一个“小破站”开始，发展到如今超3000亿市值的上市公司，“社区”的力量功不可没。自2018年3月上市后，连续多个季度的财报均超出市场预期，其股价在一年多的时间里翻了近8倍。\n\n既想比肩QQ，又想对标B站，这样来看，Q次元的野心不小。但在任何行业，谁懂年轻人，谁就有未来，腾讯能否搞懂每一代年轻人，这点需要打一个问号，但确定的是，在任何时候，腾讯都没有停止对新时代、新社交方式的探索。",
			"added": 1631068566,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631069030,
			"title": "裂变、分享、传播：App推广社交玩法全解析",
			"body": "流量为王的时代，社交平台一直以来都是各家必争的重点流量阵地，为此，多数App都设计了相应的裂变玩法和社交平台分享功能。\n\n移动互联网时代，流量为王。在App获取流量的过程中，有资金的砸广告，没资金的铺渠道，但是不管你有钱没钱，社交平台都是必须重点争夺的流量阵地。\n\n毕竟，截至2018年底，微信及WeChat的合并月活跃账户数增至约10.98亿、QQ的整体月活跃账户数增至8.07亿、微博月活跃用户达4.65亿，社交平台巨额的流量红利足以孕育出拼多多、瑞幸咖啡这样的独角兽。\n\n为了获取社交平台流量，绝大多数App都会设计相应的裂变玩法和社交平台分享功能，因为这既是内容分发最有效的途径，也是拉新促活的低成本实现方法。\n#一、App社交分享的形式\n\n《社交红利》一书认为：社交红利（收益）=信息✖链接✖互动，可以认为社交的构成要素是内容、关系、互动，其中社交关系是核心。\n\n需要有基础的分享形式，App社交关系的各种玩法和互动逻辑才能成立。先来看下App社交分享的主流形式有哪些，主要结合微信上的分享形式分析。\n1. 文字分享\n\n淘宝、天猫只能以口令形式在微信中传播，用户复制该段文字，再到App中打开，才能进入相关商品页面，这种形式既是为了绕过微信的屏蔽机制，也是为了实现邀请者和被邀请者之间的层级关系绑定。但去年微信已经开始在朋友圈封禁口令码、识别码的外链形式，因此口令码分享的传播有一定限制，可以改用图片二维码的方式在朋友圈传播。\n\n2. 邀请码分享\n\n这是体量较轻的一种分享形式，主要也是以文字信息作为分享载体，通常会“复制”“粘贴”的用户就会操作这种形式。展现形式上：\n\n    网易星球附带文案说明、邀请码以及App下载链接，类似文字口令分享\n    什么值得买简单粗暴，方便被邀请人直接复制邀请码信息，但邀请人还需要再自行向被邀请人解释邀请码用处\n    支付宝的搜索码和邀请码本质上形式一致，但支付宝的分享数字是可点击操作的，用户可以点击蓝色数字直接复制\n\n3. 网页链接分享\n\n这是分享形式中最常见的一种，绝大多数网页分享实际上都是以H5落地页作为载体，只是展现的形式不同，这种方式是承载信息最直接、最全面的一种，H5网页链接分享可以通过第三方 openinstall 的 Deep Link（深度链接）技术优化用户体验，让用户从社交平台上点击分享页面直接打开App进入该场景页，缩短流量的转化路径。\n\n从分享的操作流程上看，无论填写邀请码还是网页链接填写手机号码，除了用于识别双方邀请关系外，给用户带来的操作成本都会比较高。使用 openinstall 免填邀请码功能，能够让被邀请人点击分享页面，下载App注册后自动完成层级关系绑定，无需填写邀请码、无需在分享页面注册手机号码、邮箱等信息也能完成邀请分享关系的追踪，这种方案理论上能让分享的流程缩至最短、邀请效率达到最大化。\n4. 图片分享\n\n读图时代，分享图片取得的效益往往不会太差，除了要保持视觉信息的完整性、设计上要抓人眼球外，还可以植入二维码链接、App名称、Solgan、LOGO一类的元素。本质上二维码形式也只是H5页面的延伸，只是改变了展现形态，用户的进入方式由点击打开链接，变为扫码进入内容页。\n\n5. 动图分享\n\n当然，用户的分享需求是不可预知的，可以根据产品特性配合使用场景多开发一些特殊功能。如果App形式偏向视频类型，可以考虑开发动图制作功能，比如：\n\n    优酷视频、腾讯视频、Bilibili视频站等视频内容为主的App都会在视频播放过程附带GIF截取功能，方便用户截取有意思的画面。\n    一闪一类的VLOG剪辑App甚至给动图附带滤镜、编辑、尺寸缩放等功能，用户可以自行美化动图再进行分享。\n\n有意思的是，微信中分享的GIF格式会变成【动画表情】，这在微信中还是有很大传播价值的。\n\n6. 音频分享\n\n分享音频到微信中可以直接点击播放，但网页交互体验上并不算很好，无法挂起页面继续收听，也无法查看完整歌词等，完整功能要打开App后才能实现。展现形式上，音频的分享页面与普通的网页分享相比狭长一些，分享封面上也有播放CD的图标，这些特征方便用户辨认类型。\n\n7. 小程序分享\n\n现在越来越多App都会在微信平台上开发小程序，在此基础上，App分享页面会自动转化为小程序分享。用完即走、能与微信生态（比如公众号）互相跳转是小程序的优点，目前主流的视频类App、工具类App都会开发一个，但小程序有限的体量导致它无法容纳过多的功能，只能满足特定场景下的部分用户需求，因此还是要做好引导，能引流回App自然是更好。\n\n值得一提的是，小程序的分享页面展示明显要比网页分享要大得多，简直是霸屏了。\n\n#二、常见的App社交分享三大类别\n\n在结合这些分享形式的基础上，我们可以组合出许多玩法。App社交推广方式一般包含三大类别：用户自传播、推荐式分享、邀请式裂变。从主要的特征如下：\n\n    用户自传播：指App本身蕴含有一定的传播因素，用户认可产品的服务或价值，即便没有奖励，也会自发、自愿、主动分享给朋友。\n    推荐式分享：指用户只需分享指定内容，无需负责转化分享对象，即可获得物质或精神上的奖励，形式上更像是向好友推荐分享好东西或话题。\n    邀请式裂变：指用户首先要分享指定内容，而好友必须完成相应操作，才能获得相应奖励，这种形式一般以“邀请”或“助力”的名义进行，最有可能形成裂变。\n\n本文将从这三个类别详细解析App的传播、分享、裂变形式和方法，聊聊产品在【社交分享】方面的多种选择。\n#三、用户自传播\n\n要点在于在App各个场景中渗透入分享功能，比用户先一步考虑到分享需求，只要产品的内容或服务具有价值，触及到用户实际需求，流量的自然传播也就水到渠成。\n1. 内容有趣、产品有用\n\nApp一般右上角要常置分享功能，当用户认为内容有趣或产品有用，自然会产生分享需求，比如好商品、好音乐、好电影、好书籍等。此外，绝大部分核心页面也可以多备一个分享按钮，可以起到暗示作用，同时减少用户分享的思考成本和操作路径。\n\n在内容或产品页面搭配奖励性质的文案或设计，能更好的激励用户分享。\n\n2. 盘点、测试类个性表达\n\n这类分享基本以H5结合图片作为入口传播，【有趣、具备社交属性】是这类玩法的特点，主要触及用户的自我表达需求，如：\n\n    QQ20周年的轨迹测试，触及用户群的情怀，容易联想到读书时代、网恋、QQ游戏、踩一踩等场景，从而引发用户自我传播\n    支付宝、网易云音乐一年一度的年终总结，从“账单”“音乐菜单”下手，触及“钱包、消费”和“音乐偏好”等因素，有时候产品比你更懂自己\n    网易系的H5常年刷屏，但实际因为“网易新闻”出品而去下载App的用户并不多，这种形式更多的是品牌营销和趣味分享\n\n3. 完成产品体验时分享\n\n当用户完成产品体验后，往往会处于情绪的顶点，或难过或兴奋，此时用户会比平时更乐意主动传播该信息，即使没有任何激励措施，在荣誉或炫耀心理的驱使下，只需增加一个分享提示，用户实现App自传播就是自然而然的事情。\n\n4. 有实时分享需求\n\n这种属于用户刚需，例如：石墨文档、有道云笔记出于办公需求的协作功能服务，滴滴出于人身安全需求的车程功能服务。如果产品有较强的动态服务能力，可以考虑开发相关功能。\n\n#四、推荐式分享\n\n这种方式从流程上看，产品需要付出一定的成本用于激励，属于单向奖励制，用户仅需纯粹分享相关内容，即可获得相应奖励。原则上只负责向好友推荐分享产品信息，不负责App拉新转化的结果。\n1. 朋友圈打卡分享\n\n近期朋友圈大火的“打卡返学费”行为遭到腾讯封禁，这种形式目前已经行不通了。其主要形式为：号召用户在朋友圈分享学习课程、分享学习成果等，激励手段主要是坚持多次分享就能返学费、送实体书等物质奖励，或者勋章成就等精神奖励。这种方法集中在英语类、读书类在线教育产品领域，主要是利用分享人的利益或荣誉驱使，让潜在用户产生焦虑从而加入。比如：在朋友圈看到朋友天天在学习、健身，潜在用户也会想要下载App或使用该服务提升自己。\n\n2. 分享可得更好的产品体验\n\n这种形式基本可以归纳在游戏和答题类产品上，建立分享规则引导用户通过分享以获得更多游戏奖励或更好的产品体验。例如游戏App惯用的打卡形式【每日首次分享得奖励】，以及微信游戏类小程序、答题类产品的【分享可得复活卡】。\n\n3. 分享可得现金\n\n与上一条不同的是，这类用户分享的出发点不在于获得更好的产品体验，而在于现金奖励可提现，是阅读类、资讯类产品常用的获客手段，分享要求一般为产品的某项功能或内容。但目前分享即可获得奖励（现金或积分）的App已经很少了，只发现百度和微博App还有分享即可获得奖励的机制，为了防止薅羊毛行为，这种形式需要从设备唯一性、提现门槛等方面做限制。\n\n#五、邀请式裂变\n\n常见的各种裂变形式大多是双向奖励制，要求用户一定要邀请好友参与产品核心业务的体验，双方才可获得奖励，这种形式下受邀方必然会成为新用户。要点在于奖励的侧重方如何选择，以及核心业务的体验形式，在社交平台上衍生出来的玩法也是非常的多。\n1. 老带新裂变\n\n几乎所有的App都有【邀请有礼】一类的常置入口，这是裂变玩法中为数不多的可以长期开展的拉新活动，通常把产品核心业务的体验作为活动流程，采用双向奖励是比较有效的一种奖励形式，要注意在流程中绑定双方邀请关系，典型案例瑞幸咖啡的送TA咖啡，依靠这种裂变形式实现高效拉新。\n\n2. 优惠券裂变\n\n常见于用户消费完成后分享，一般分享到社群，引导用户抢夺奖励池中的优惠券，优惠券可以作为二次消费的诱饵，分散到受邀用户手中，这种玩法的关键点在于奖励的“随机性”，在不确定因素下，只要不亏，用户都会有动力抢夺奖励。\n\n3. 拼团裂变\n\n依靠熟人社交，典型案例为拼多多，用户发起拼团任务，邀请好友参与就能一起低价购买。如今又衍生出预售团、抽奖团等形式，这种组团参与的玩法能获得较高的转化率，特点是吸引到的下沉用户较多。\n4. 砍价裂变\n\n同样需要邀请好友参与，这种方法操作成本较低，好友仅需在社交平台上参与一次点击，即可帮邀请者获得折扣。砍价裂变实际上更重社交，基本以“砍价”“助力”等形式文案，给受邀者一种获得感和仪式感，走过路过每个群里都帮忙砍一刀、助力加速，大部分产品还会在砍价完提示二次分享可以获得更大的助力，鼓励用户继续裂变更多社交种子圈。\n\n5. 分销裂变\n\n与砍价的差别在于分销的结果不是享受优惠，而是获得佣金，用户只需要邀请好友参与购买，即可获得相应回报，常见于知识付费领域，比较成功的如：网易戏精课、三联中读、知识星球。但要注意分销等级不能超过三层。\n#六、总结\n\n本文将社交分享从形式到玩法做了一些归纳分析，总结下来有以下几点建议：\n\n    要抓准用户心态，把握展示分享功能的时机，如完成任务或产品体验后的分享提示；排行榜、荣誉勋章、成就的查看环节植入分享功能等\n    从应用技术上改进，注重用户体验，合理利用技术手段来优化分享环节转化率，比如 openinstall 的 Deeplink 、免填邀请码等功能\n    从邀请流程上改进，多样化思考网页、图片、分享码等形式的特点，选择最佳的推广流程，尽可能为用户节约操作成本，缩短转化路径，避免过度流失\n    社交分享，渠道是关键，要熟悉、合理利用平台规则，不要过度营销，如朋友圈打卡的封杀、分销的底线等\n    产品本身的内容和价值才是王道，用户分享的最重要因素是对产品的认可，打磨产品的核心功能，才能让分享行为进化到裂变、自传播的阶段\n    挖掘产品的核心价值或特色功能，通过社交分享将其放大，比如：动图制作后分享到微信成为表情包传播；早期拼多多的拼团、砍价裂变，都是将产品特色乘以社交平台属性后得出的结果\n    做好渠道效果监控，把握好每一个功能、每一次传播带来的效果，通过控制变量的手段改进产品或优化推广环节\n\n在什么产品上，基于什么样的用户，使用什么形式去分享达到什么目的，大家可以从以上分享的案例和形式中找找答案。\n\n#七. 邀请码饥饿营销，制造神秘感。",
			"added": 1631069195,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631070525,
			"title": "生活学研究",
			"body": "",
			"added": 1631070508,
			"type": "group"
		},
		{
			"topic_id": 1631070551,
			"title": "家庭物资储备数量",
			"body": "家庭采购员",
			"added": 1631070533,
			"parent_topic_uri": "1631070525_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631070566,
			"title": "赶礼",
			"body": "",
			"added": 1631070547,
			"parent_topic_uri": "1631070525_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631070873,
			"title": "腾讯内测游戏社交App“NokNok”，能成为游戏界的微信吗？",
			"body": "腾讯欲再造一座社交大山，打造一款游戏界的“微信”。\n\n今年4月，腾讯平台与内容事业群（PCG）宣布组织架构和人事调整，互动娱乐事业群（IEG）天美工作室群总裁姚晓光，兼任平台与内容事业群（PCG）社交平台业务负责人。动作频频，似乎预示着游戏和社交会碰撞出火花。\n\n不出所料，腾讯将游戏和社交进行了完美融合，Tech星球独家获悉，PCG内测了一款名为“NokNok”的游戏社交产品，中文名为“闹闹社区”，整个主题偏像素风，内部称之为“KK”。这也是姚晓光掌舵PCG事业群3个多月后，带来了首个社交产品。\n\n据悉，“NokNok”定位是一个完全开放、自由免费、高质量交流的社区平台。按照官方公开的信息显示，NokNok在4月正式立项，随即开始搭建基础功能、消息发布、bot订阅、图片发送等功能，5月起，增加了私聊、群广播、视频发布、bot可视化配置等功能；6月，官方进一步结构化消息、群星标、消息态度等功能，7月进行灰度测试。\n\nTech星球体验后发现，NokNok提倡的是群组聊天，将1对1的聊天模式进行了弱化。\n\n每个群组内可设置多个频道，满足不同时段和不同兴趣用户的需求。群聊内除了聊天外，还可以进行社交，用户可以发送自己的游戏档案，档案相当于个人名片，可以显示用户绑定Steam、NS等平台的数据。通过绑定这些平台的游戏数据，可以较为直观的看到对方游戏熟练度，以及是否存在相同爱好的游戏，便于精准交友。\n\n同时，NokNok也支持用户主动创建群组。可创建的群组类型有4种，分别为“游戏模板”，适合重度游戏爱好者，讨论游戏心得；“公会模板”，公会玩家的专属基地，便于游戏之间的交流；此外还有“KOL模板”，是个建造用户的私人营地，与粉丝面对面交流；最后则是“空白模板”，可以自定义群组类型。\n\n群组创建好后，即可加入群聊并进行运营。目前，根据规则，若想初创的群里拥有曝光度，需要多加人、多聊天，有几率会被官方推荐到“发现群组”页面，获得流量支持。\n\n由于该App仍然处于测试和调整阶段，所以像语音聊天、投票、接龙、QQ和微信第三方登录等功能仍然缺失，官方表示在后期会对这些问题进行完善。另外，官方明确表示，NokNok将会是一个跨端的社交产品，将推出H5、PC版，这也就意味着，这款产品不局限于手游用户，同样也适合端游用户，打造一个多元游戏聊天平台。\n\n行业分析人士认为，NokNok对标的是海外游戏聊天应用与社区“Discord”。近日，《原神》官推，由于《原神》官方Discord服务器已经达到了80万人的容量上限，官方不得不开启第二个服务器。而在前段时间，《原神》的官方Discord服务器用户量达到80万，“Discord”不仅在海外，在国内的火爆显然易见，NokNok的推出，也透露出腾讯对这种爆款产品的渴望，希望自身最终能够成为国内游戏玩家在游戏中沟通协作的首选工具，成为游戏界的社交“一哥”。\n\n此外，随着国内互联网的流量增长放缓，QQ月活继续下降，腾讯急需在社交上找到下一条出路，而此次选择游戏和社交进行结合，不难看出，腾讯希望集合其在游戏和社交上的优势，打造一款应用于游戏界的超级App，这款社交App或许会是一条新的流量增长点。\n\n从近几年的社交产品趋势看，发展熟人社交基本成为一个死胡同，作为熟人社交的微信，由于多年沉淀，早已经成为用户联系和日常必不可少的工具，新的社交产品很难颠覆其地位，甚至蚕食微信的份额，同为熟人社交的QQ，其月活如今已跌至微信的一半，就是最好的证明。而目前仍在活跃的小众社交产品，则主要以荷尔蒙社交为主，虽然活跃度高，但社交关系并不牢固，同时存在监管风险，很难做大。\n\n游戏社交不一样，游戏是兴趣爱好，基于兴趣的社交，可以创造粘性更强的共同话题进行交流，并催化、维持或强化自身与他人之间的关系，进行一系列互动行为，以此能够巩固社交产品的活跃度。另外，基于腾讯游戏在国内处于前列的地位，可以更好的发挥自身的渠道和流量优势，例如在后期采取向NokNok进行引流，进一步提升NokNok的生存空间和用户量。\n\n而随着未来NokNok会开发PC版本，表明腾讯看中的是多端的流量，而不是局限于移动端，其目的就是做大做强，成为游戏界的超级社交App。\n\n另外，也可以发现腾讯在社交上的打法有所改变。不久前曾推出一款多元群组聊天App“Q次元”，是腾讯近两年来，推出的为数不多的社区产品，采用文字和语音群组聊天的方式，注重不同用户聊天习惯。\n\n紧接着又推出看点社区，再到此次的NokNok，可以看出腾讯将以往的点对点社交方式向群组聊天的玩法转变，而NokNok的运营也表示，“Nok希望把所有热爱游戏的人都凝聚在一起，它告诉我们这是未来游戏无数条路中的其中一条。”预示着社群将成为腾讯接下来在社交产品打造上的重要发力方向。\n\n姚晓光主管PCG后的首个游戏社交产品“NokNok”已经浮出水面，NokNok能否成长为腾讯的下一座社交大山，还需要时间去观察",
			"added": 1631070853,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631073203,
			"title": "原神频道",
			"body": "",
			"added": 1631073180,
			"parent_topic_uri": "1630724652_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631073221,
			"title": "光遇频道",
			"body": "",
			"added": 1631073197,
			"parent_topic_uri": "1630724652_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631074870,
			"title": "信息时代的核心——传播学",
			"body": "信息时代，传播无处不在。人们穿的服装，配戴的饰物，发的每一条微博或朋友圈，换的每一个头像、用的每一个表情包，都在传递着自己的情绪，传递着想让人了解的风格和信息。有趣的是这个研究人类信息交流的学科竟是由口吃患者创办的，这个人就是传播学之父施拉姆。更神奇的是在传播学的四大奠基人中没有人承认自己做的是传播学的研究，而且他们来自各种行业，如身为政治学家的拉斯韦尔，作为数学家和心理学家的拉扎斯菲尔德，还有同是心理学家的霍夫兰和卢因。因此传播学成了一门包罗万象的学问。\n\n那么传播学到底是怎样一个学科，专业的前景与就业又是怎样的？\n\n一、专业介绍\n\n有人说新闻无学，广告无学，公关无学，但是不会说传播无学。传播学是“学”，理论性很强的一门学科，具有丰厚的理论基础，如有关媒体控制的议程设置理论；有传播过程存在的两级传播、媒介即信息；还有传播效果相关的皮下注射论、沉默的螺旋、数字鸿沟、第三人效果等。\n\n中国人民大学新闻学院郭庆光教授编写的《传播学教程》第二版中系统的论述了传播学的定义：“一般认为，传播学是研究社会信息的传递与社会信息系统的运行规律的学科。它的研究内容涵盖了人类一切传播活动和现象规律。”\n\n在社会高度信息化的过程中，新的传播技术在不断地刷新着认识，传播学为人文社会科学的理论创新和知识创新提供了新的动力。按照传播的主体划分，传播可以分为人内传播（也称自我传播）、人际传播、组织传播、群体传播、大众传播与新媒体传播等。今天的网络传播突破了上述划分，它消除了上述传播的界限，所以有人把它称之为大众－人际传播。除了按参与主体划分外，按照传播发生的语境，还可以细分出跨文化传播、国际传播、全球传播等传播形态。\n\n（一）学习内容\n\n传播学专业本科的学习是围绕人类信息传播有关的问题开设的课程。具体各个高校不同，但是大致上有传播学史类课程，如传播学基本原理、批判传播学等；还有传播学与其他社会要素或者其他社会领域的关系类课程，如政治传播、社会传播、艺术传播、影视传播、健康传播等，另外还有传播实务类的课程。\n\n随着信息技术互联网技术的发展，大数据和新媒体方面的人才缺口扩大，传播学的培养方向也随之发生很大的变化，主要方向有网络传播、新媒体传播、媒体市场调查与分析、网络媒体经营与管理等等。\n\n学习传播学，生活中的很多问题都会得到思考，而且对自我、人群、社会等等会有深入的认知，比如网红的诞生、热点事件的舆论反转、微信爆文十万加的诞生，亦或是日常生活里简单的交流沟通，都有传播学规律的存在。\n\n（二）传播学VS新闻学\n\n传播学和新闻学有着不可分割的联系。在2020年教育部颁布的本科专业目录中，传播学和新闻学都归为文学中的新闻传播大类。\n\n在研究范围上，新闻学是传播学研究的一部分。传播学专业关注包括新闻传播在内的更广阔和深远的信息传播领域。李彦冰老师认为，在今天的媒介环境已经发生变化的情况下，粗略来说二者的区别就是：新闻学所专注的是新闻信息的采集、生产和传播。而传播学要研究的是人类社会信息系统及其运行，所涵盖的范围更广泛。",
			"added": 1631074845,
			"parent_topic_uri": "1623916421_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631074972,
			"title": "什么值得聊",
			"body": "社会新闻\n行业动态\n工作安全\n生活难题\n思考研究\n兴趣爱好\n科技进展\n\n市场行情\n交通状况",
			"added": 1631412143,
			"parent_topic_uri": "1623916421_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631075313,
			"title": "被微信绑架的年轻人：不回微信就拜拜",
			"body": "自微信诞生以来，每个人多了个“亲人”。\n\n微信到底有多亲，一组大数据可窥一斑。\n\n有“互联网女皇”之称的华尔街证券分析师玛丽·米克尔，曾发布过一份《2017年互联网趋势报告》。\n\n报告指出，中国用户平均每天投入到移动应用的时间约为31亿小时，其中，投入到微信中的时间约为9亿小时，占比29%左右。\n\n目前，在中国，超过10亿人在使用微信，也就是说，单人日均使用微信时长高达90分钟左右。\n\n实际上，很多人每天使用微信时长，远超这个数字。许多年轻人都是重度“微信依赖症”患者。\n\n与其说，他们被微信绑架了，不如说，他们面带着微笑，主动把时间和生活送给了微信。\n\n就连微信创始人张小龙都曾感慨：“用户使用微信的时间太长，频率太高了。”\n\n微信成了许多人的全世界\n\n许多人早上醒来第一件事情，就是摸出手机，看微信。\n\n只要没漏掉一条微信，没漏看一个朋友圈，他们就会觉得“世界在手”。\n\n一次，朋友给我发手机截图时，我注意到一个细节，他有几千条未读微信。我好奇地问他，都是工作微信吗？\n\n他说，跟工作没关系，大多都是朋友间的嬉闹，但他每条都会看，一条都不落下。就像得了“强迫症”，不逐条看完，心里就不踏实。\n\n他的这种状态，并不少见。就这样，很多人的生活，被微信占满了，甚至取代了。\n\n上周末，同事和几个同学相约一起吃饭。虽说，几个人在一座城市，但已好久没见了。\n\n聚会之前，她欢天喜地的，可聚会之后，她沮丧地告诉我，不如不见。她形容的聚会场景，我一点都不陌生。\n\n一坐下来，大家各自拿出手机，目不转睛地盯着屏幕，连寒暄的时间都省了。\n\n可笑的是，他们面对面坐着，却在共同的微信群里聊起了天。就连点评菜品，他们都懒得开口，而是发微信到群里。\n\n我们花费了太多时间和微信在一起，却吝啬于把时间给现实中的人。\n\n原本，微信是为了加强与人沟通而诞生，可现在，它的存在成了许多人的全世界，另一端连接的那个人，反而变得不再重要。\n\n微信被赋予太多“意义”\n\n微信占用了时间，也绑架了思想。\n\n在微信的使用中，它慢慢被赋予了太多毫无意义的“意义”。\n\n比如，不秒回的人，一定不爱你。不回信息的人，更是罪不可赦，哪怕他是偶尔为之。\n\n这些“意义”，在要求人们做一个自动回复机器人，全年无休，时刻在线。只要有人发信息，立刻弹出回复“亲，我在呢”。\n\n不得不说，这些“意义”，误导了很多人。而这些被“意义”误导的人，又用它们去绑架别人。在人与人的交往中，它们甚至有着一票否决的特权。\n\n在一次聚会中，阿芳认识了一个新朋友。两人聊得很投机，分别时互加了微信。当时，阿芳正在学烘培，常在朋友圈分享自己的作品。\n\n一天，阿芳收到对方的微信，请教怎么做生日蛋糕。对方想亲手做一个蛋糕，送给男朋友。那天，阿芳忙得不可开交，没有第一时间看到微信。\n\n晚上，阿芳一看到信息，立刻着手回复。她录了长长的语音，却发送失败，微信提示，她已不是对方好友。因为没有及时回复消息，对方已经跟她说拜拜了。\n\n显然，她没有通过对方的“意义”测试。可是，阿芳真的打心眼里珍惜这份新友谊。遗憾的是，阿芳再多真诚，也没赢了“意义”，友情就此止步。\n\n微信被演绎出太多“表情”\n\n朋友阿宽说，微信聊天时，他最怕“表错情”。\n\n原本，微信表情是用来活跃气氛的，可没想到，它们有那么多令他不解的含义。\n\n去年，经朋友介绍，阿宽认识了一个女孩。见面之后，双方互生好感，愿意继续交往。\n\n可是，几个月之后，女孩就跟他说了“拜拜”。他不知道，哪里出了问题。\n\n朋友告诉他，对方觉得他不真诚，微信聊天时高冷又敷衍。\n\n阿宽翻出聊天记录，让朋友帮忙“诊断”。朋友边看边摇头，阿宽的微信聊天，尽在雷区。\n\n朋友圈出了他的“错误”，就像给了他一个个“红叉叉”，触目惊心。\n\n在使用微信表情上，阿宽几乎没用对过。“微笑”这个表情，阿宽以为表示了友好温和，没想到却是个“假笑”。想到自己频频使用该表情，阿宽不禁起了一身冷汗。\n\n在他没使用表情的地方，依然是满屏“错误”表情。例如“嗯”“哦”等词语，会让对方觉得，阿宽正一脸冷漠和不耐烦地看着屏幕。\n\n朋友的一番“诊断”，让阿宽觉得很冤枉。明明，他发微信时，总是带着满脸甜蜜。\n\n在发送“嗯”时，他甚至对着屏幕隆重地点了点头。可是，没想到，这些充满感情的语气词，到了对方那端，被演绎出那么多“坏表情”。\n\n这实在有点讽刺。面对面相处时，你给予的热情真诚，始终敌不过微信帮你演绎出的“冷漠无情”。\n\n​\n\n微信正在套路我们的生活\n\n我们对微信倾注了如此多的热情，拼命“解读”它，但它却并没有使我们的生活和人际交往变得更好。\n\n牛津大学人类学家罗宾·邓巴，曾提出过一个著名理论，叫“邓巴数字”。\n\n该理论指出，人的大脑新皮层大小有限，这决定了，一个人的社交人数上限为150人，而深入交往的仅为20人左右。\n\n在传统社会，我们深入交往的人，一般是接触最频繁的亲人、朋友、同学等。在人际交往中，这些是“强关系”，除此之外的，通常是“弱关系”。\n\n和弱关系相处久了，人们会变得不擅长处理“强关系”。微信的过度使用，正在将我们的“强关系”变成泛社会化关系。\n\n一个微信号，最多可有5000名好友。许多年轻人的微信里，动辄几百上千个“好友”。\n\n这样的好友群看似庞大，可当你想倾诉时，却找不出一个合适的倾诉对象。在不知不觉中，那些“强关系”，都被你弄丢了。\n\n同时，在微信交流中，那些洞彻微信“意义”和“表情”的人，令你欢喜，却不一定是“同道中人”。你深谙套路，却可能正在被别人套路。\n\n无论是生活，还是人际关系，微信总在给我们一种假象。\n\n它让你觉得拥有了更丰富的生活，却只是日复一日对着屏幕；它让你觉得拥有了更多好友，却只是变得更加孤独。\n\n放下微信才能迎来真生活\n\n微信本身没有错，错的是使用它的人和方式。\n\n我们把微信当成全世界，失去了真实的生活触觉。\n\n几年前，英国作家兼导演加里·特克曾拍过一个叫《抬起头》的短视频，呼吁大家放下手机。里面的每句话，都令人警醒。\n\n“我有四百二十二个朋友，但我很孤单。我跟他们每天都说话，但没有一个人真的了解我。”\n\n“我们乐于分享某次经历，但如果没人陪伴，快乐是否依旧？”\n\n“我们身边的孩子们，自出生开始，就看着我们活得如同机器人，并认为这是正常的。”\n\n“当我是个孩子时，我从不在家。我和朋友们，骑着自行车，到处游荡。现在，公园里那么的寂静，让人心生寒意。”\n\n靠微信和冰冷的手机屏幕，我们很难感受到生活的丰富、有趣和温度。\n\n是时候从手机上抬起头来，看看身边的人和事，让他们成为你今天的焦点。仅仅是开始与人交谈，生活就会悄悄发生变化。\n\n家人和朋友，不要只放在微信好友列表里，而要给予高质量的陪伴。\n\n一句暖心的话语，一个真诚的拥抱，一副可依靠的肩膀，永远胜过套路成熟的微信聊天，胜过隔着屏幕的嘘寒问暖。",
			"added": 1631075286,
			"parent_topic_uri": "1623916421_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631078548,
			"title": "社区社交",
			"body": "大型社区\n子社区\n小型团体",
			"added": 1631078520,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631079263,
			"title": "互联网与生活",
			"body": "聊天软件\n支付软件\n社交软件\n搜索引擎\n输入法\n应用商店\n浏览器\n网盘\n流量池\n用户数据",
			"added": 1631090881,
			"parent_topic_uri": "1630722132_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631094521,
			"title": "为什么医生开的药方看不清写的是什么？",
			"body": "",
			"added": 1631094491,
			"parent_topic_uri": "1623916421_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631184058,
			"title": "垃圾桶",
			"body": "回收负面情绪",
			"added": 1631184023,
			"type": "group"
		},
		{
			"topic_id": 1631184163,
			"title": "你身边的智障是什么样的？",
			"body": "他做出了哪些事情",
			"added": 1631184127,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631238804,
			"title": "小丑竟是我自己",
			"body": "",
			"added": 1631238767,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631238815,
			"title": "今天思考什么",
			"body": "",
			"added": 1631238777,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631238830,
			"title": "完成本阶段任务",
			"body": "",
			"added": 1631238791,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631238844,
			"title": "了解新事物",
			"body": "",
			"added": 1631238804,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631277223,
			"title": "大秦：不装了，你爹我是秦始皇 作    者：头顶一只喵喵",
			"body": "赵浪一觉醒来，发现自己来到了秦朝。好在家境还算富裕。只是算了算时间，大秦只有三年的寿命，赵浪便鼓起勇气，和自己那几个月才回来一次的便宜老爹说道，“爹，始皇帝三年之后必死，大秦将亡，到时候天下大乱，我们早做准备造反吧！”便宜老爹先是一愣，随后点头同意。赵风顿时兴教育，练新军。就当他羽翼丰满，准备天下争雄时。便宜老爹突然来到了他的面前，“不装了，摊牌了，你爹我是秦始皇。”",
			"added": 1631277182,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631323139,
			"title": "震惊！贴吧发现吉尼斯世界水怪",
			"body": "经验+3",
			"added": 1631323385,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631323844,
			"title": "软件墓地",
			"body": "轻芒杂志停止运营，为什么优秀的app总是被企鹅送上法庭？",
			"added": 1631323801,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631353358,
			"title": "小说术语",
			"body": "来都来了\n做过一场\n阴间新闻\n倒吸一口凉皮",
			"added": 1631412028,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631353524,
			"title": "国内web2.0网站的自我审查是否过度并伤害了用户体验？",
			"body": "新浪微博、豆瓣、百度贴吧等等的审查制度既不公开，也无规律可循。抛开制度性原因，自我审查的力度是不是有点过了？",
			"added": 1631353479,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631353645,
			"title": "我忽悠了异界",
			"body": "苏陌继承了游戏与欺诈之神神格，穿越到了异界。原本，他只是想做做游戏，忽悠忽悠人，但谁料一不小心就改变了整个世界的画风，忽悠出了一段被封禁的太古历史。有不敬苍天的弑天一脉，姑苏慕容！有独断万古，统御万族的太古无上天帝！有亘古不灭，藏身幕后设计万族，搅动万古局势的道门周一仙！更有金身...\n\n撒谎流小说",
			"added": 1631353599,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631412118,
			"title": "今天你炼丹了吗？",
			"body": "做饭",
			"added": 1631412071,
			"parent_topic_uri": "1623916421_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631754459,
			"title": "Veloren",
			"body": "是受《立方体世界》、《荒野之息》、《我的世界》等游戏启发制作的独立RPG，完全开源免费。",
			"added": 1631754461,
			"parent_topic_uri": "1630724652_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631754604,
			"title": "为什么 Minetest 无法取代 Minecraft？",
			"body": "作为完全开源的沙盒类游戏，为什么 Minetest 无法像 Minecraft 一样形成如此庞大的生态圈？",
			"added": 1631754555,
			"parent_topic_uri": "1630724652_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631755358,
			"title": "抗风险能力",
			"body": "",
			"added": 1631755308,
			"parent_topic_uri": "1631070525_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631767481,
			"title": "硬核游戏",
			"body": "矮人要塞\n异星工厂\n边缘世界",
			"added": 1631767430,
			"parent_topic_uri": "1630724652_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631795968,
			"title": "我，诈骗了全世界 作  者：小丑萨克",
			"body": "M国联邦调查局总部，顶级机密会议室。调查局最高长官严厉训话道：“李轩，全球最高级别通缉犯。”“他伪装过的，从医生、律师到警员再到政客、商人！”“这是一个史无前例的巨骗！”“就在昨天，他把自由女神像卖给了南韩……”“最关键的是……他的手续全都合法！”“事涉联邦尊严，就算是全线封锁，也要把这家伙抓到！”一片议论声响起。...",
			"added": 1631795916,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631796073,
			"title": "我的细胞游戏 千里祥云 著",
			"body": "昔日奔腾的江水，如今呈现血一般的殷红。\n　　低沉的嘶吼于群山中回荡，古老的吟诵在沙漠中飘扬。\n　　猩红的血影走上黑暗的街头，无名的尸体倒在寂静的小巷。\n　　怪异病毒弥漫帝国，致命瘟疫无声传播，垂死的病人在苦苦挣扎。\n　　\n　　感染了病毒的江佐为了活下去，他将自己的身体改造成一款游戏——\n推广游戏，招募玩家，创建副本，组建最强细胞防线！",
			"added": 1631796020,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631796150,
			"title": "多好的视力才能挑出鱼刺？",
			"body": "吃鱼太麻烦了。太危险了",
			"added": 1631796096,
			"parent_topic_uri": "1631070525_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631796340,
			"title": "全职艺术家 作  者：我最白",
			"body": "“音乐、影视、绘画、书法、雕塑、文学……”“你都懂？”“略知一二。”“都会一点的意思？”“嗯，都会亿点的意思。”怀揣系统，靠艺术征服世界，成为各界人士顶礼膜拜的无冕之王。...",
			"added": 1631796285,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631796400,
			"title": "我，超级资本家！ 作  者：超级资本家",
			"body": "沈枫穿越到平行世界，获得“估值系统”，对所有资产、项目都能进行精确的评估，从此开启了神级资本家之路。“叮，XX破产软件公司估值1000万，破产清算出售价100万，获利900万。”“叮，城郊地皮估值10亿，拍卖价2亿，获利8亿。“”叮，上市公司002599，股票估值每股1200元，现价200元，获利1000元每股。“.",
			"added": 1631796344,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631867908,
			"title": "家里进过哪些小动物？",
			"body": "",
			"added": 1631867851,
			"parent_topic_uri": "1623916421_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		},
		{
			"topic_id": 1631887577,
			"title": "常见套路",
			"body": "走路就能赚钱\n支付宝打卡赚钱\n拼多多的好友助力100元现金怎么拿？到底要邀请多少用户？\n\n感觉跟什么快手极速版之类的很像啊\n\n所谓的看视频赚钱",
			"added": 1631887623,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631927129,
			"title": "微信针对外链发布内容管理规范：用户可在一对一聊天场景中访问外部链接",
			"body": "今日，为落实工信部对外链管理提出的专项指导意见，腾讯发布关于《微信外部链接内容管理规范》调整的声明。\n声明中提到，将在“安全为底线”的前提下，以“四项原则三条措施”，“分阶段、分步骤”来实施第一阶段的互联互通。\n整体遵循外链开放原则如下：\n1、防止出现违反国家法律法规的行为；\n2、防止出现过度获取用户隐私、危害网络信息安全与数据安全的行为；\n3、防止出现过度营销、诱导分享等有损用户利益的行为；\n4、坚持用户为本，将更多选择权交给用户。\n\n外链管理措施将分阶段分步骤实施，第一阶段将于9月17日起开始执行，具体包含：\n1、在确保信息安全的前提下，用户升级最新版本微信后，可以在一对一聊天场景中访问外部链接。\n2、为用户提供自主选择权。群链接因涉及广大接收方用户，我们将继续开发功能便于用户自主个性化选择。\n3、设立外链投诉入口，用户可以举报违法违规外链。平台将按照相应规则处理，并对外链提供平台的管理有效性设立信用分级。",
			"added": 1631927070,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631942973,
			"title": "他不是xxxx的问题，他真的是那种，很特殊的.....这到底是什么梗？",
			"body": "美人鱼体",
			"added": 1631942913,
			"parent_topic_uri": "1631184058_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc"
		},
		{
			"topic_id": 1631959561,
			"title": "高考零分的我成了大国科学家 作    者：三勺麻汁",
			"body": "【【“脑洞大开”征文大奖赛】参赛作品】\n\n    一觉醒来。\n\n    张萧重生到高考考场。\n\n    他当时就懵逼了。\n\n    “别人都是回到高考前一个月，我这……”\n\n    【叮！大国重器系统觉醒，当前宿主获得3nm纳米芯片计算公式，第五代发动机设计图，龙眼毫米级卫星定位系统！】\n\n    “这有啥用？我就问给我这些有什么用？”\n\n    一个小时后。\n\n    张萧从考场出来。\n\n    记者：这么快就出来，这位同学一定是学神吧！\n\n    张萧：呵呵，我是不是学神不知道，但我知道，我交了白卷！",
			"added": 1631959500,
			"parent_topic_uri": "1623925028_1GRCviBTHHhLzzBoSvknVHnkjWYFRG641w"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1631074870_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc": [
			{
				"comment_id": 1,
				"body": "标题党 --- UC震惊部",
				"added": 1631074989
			}
		],
		"1519894923_12Nde7P12Nnbeqa8Gdtyg6nPtz9VY2Q99B": [],
		"1631796073_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc": [
			{
				"comment_id": 3,
				"body": "故意抑制玩家的能力，让玩家花钱解锁自己本来就有的能力，这么缺德的主意反正现在的江佐是想不出来。\n\n这让我想到了百度云，迅雷\n\n可不就是吗，故意限流",
				"added": 1631800868
			}
		],
		"1631927129_125vWBHepSUHXMGnwoDtiteTo9AfNTCUXc": []
	},
	"comment_vote": {}
}