{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1560807628,
			"title": "Restrictions",
			"body": "Well, I'm on a boarding school and Tor is prohibited, so I am trying alternatives. Is there something that says that I'm using ZeroNet? I use their network (in this moment I'm in a cafe) and they don't want any peer to peer encryption. Basically they want to have absolute control in every connection I have or anything that has to do with the internet.",
			"added": 1560807627
		},
		{
			"topic_id": 1561066486,
			"title": "Hidden OS?",
			"body": "Well, I don't know if this is the right place to post this, but I have found quite difficult my OS encryption. I'm on a boarding school and they want to know what everybody does on the internet or on your offline computer usage, even if it's private. So I am trying to install in my PC another OS, leaving Windows as the decoy OS and the hidden one I thought Ubuntu or maybe Zorin OS could be OK. But once I installed VeraCrypt, the option of \"create hidden operating system\" is unavailable and so is every other option that has to do with the hidden OS. I've searched on the internet but I haven't found any answers. Then I found that someone had an issue similar to mine and someone told him that the problem was something with the UEFI. I have a Dell XPS 15 and I think I have that UEFI thing, but I don't really know. So, what can I do to install a hidden OS?",
			"added": 1561066484
		}
	],
	"topic_vote": {
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 1,
				"body": "> [atomiserxenolith](#comment_95_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Sounds like a school project that might actually be useful one day. How to avoid online regulation. This is why:Chinese Social Credit. To answer your question I think not superficially, but it depends how hard an entity is trying to find out what you're doing. Ultimately I suggest getting ready to defend your actions on the grounds of free speech, rather than overly relying on technical hide holes (Julian Assange comes to mind). Technology is neutral, politics is not.\n\nBut what could I say if the \"internet use\" policy of the school says that it is particularly prohibited the use of P2P, torrents or anything that could anonymize my actions through the internet. How powerful are the intern rules of a private organization?",
				"added": 1561065722
			},
			{
				"comment_id": 2,
				"body": "> [hardee](#comment_3_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H): does your school have a net security team? or did they just lazily block DNS requests and known tor connections. If they're incompotent, you can just use some free barely known vpn service to circumvent it and use tor bridges to make it less obvious, and/or change your MAC address to one of the school admin's (which shouldn't be too hard if you do a scan the LAN (scan the LAN, heh).Also I tested it on Wireshark, and all packets relating to communicating with zeronet turned out encrypted so you're good.\n\nYes, they have. I haven't seen them yet, but the \"internet use\" policy says that if they find something suspicious about me, they have the freedom of searching my room and scanning everything in my computer, cloud services (I have to provide them all the necessary passwords) and even flash drives. So I am afraid of using even a VPN. Anything that I could do to circumvent this?",
				"added": 1561066031
			}
		],
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 3,
				"body": "> [trustmenot](#comment_7_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75): Hi guy,can you point out why you do want to install a hidden os instead of a persistent - live USB distro? I've been using it in my office for 3 years...\n\nBecause my school can search at any moment what am I storing in any of my USBs, Tor is prohibited (they don't say nothing about Live OSs, but they could also see what I have there.",
				"added": 1561158692
			},
			{
				"comment_id": 4,
				"body": "> [qspitzer](#comment_15_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): https://www.supremecourt.ohio.gov/rod/docs/pdf/0/2009/2009-Ohio-6426.pdf [...]\n\nActually it's in the UK. Does that change something?",
				"added": 1561192458
			}
		]
	},
	"comment_vote": {}
}