{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1577633593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1577670809_1A3waYKZyT69Wd7kEGQwiZk9Tf9cZFDtiv": 1,
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": 1,
		"1577009989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 1,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1403_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): he's just a lunatic as all religious living in an illusory world and tending to recruit weak people like children 'into his communist cult'.\n\n你怕是还活在特朗普政台的美好幻想中，一个强大的政府教派在不违背自己的底线同时能够包容、管理和协调其他教派，你们的资本主义很软弱，只能靠强权政治狗咬人，然而却不敢咬我们中国，终究自欺欺人罢了，你们的命不能握在你们的手中，我们能。",
				"added": 1577584801
			},
			{
				"comment_id": 4,
				"body": "美国陷入内部政治斗争；种族歧视；强权政治；资本控制舆论随意抹黑；中国人在推特和facebook的反抗言论的相关账号遭批量删除还被美狗随意抹黑，美帝还意图干扰中国内政，你们以为中国是伊拉克？至于美帝为什么要花那么多资金打伊拉克我至今搞不懂，你们搞懂了？你们以为打击香港，试图冲击港币体制进而疯狂敛财就可以打击中国经济？那是1997年以前而不是2019年。你们美国政府的理念与世界发展背道而驰，建议闭关锁国。中国的香港，台湾和西藏问题全都都在预料之中，也是历史的遗留问题，因此出现了一带一路，中国喜欢交朋友，不喜欢到处签合约乱结盟。美政试图控制舆论打击中国经济，美政没做到，看来特朗普会相当失望，没想到中国会把香港问题长久的控制在香港范围内吧。中国的领土权是最后的底线，特朗普政府不是很牛逼？把战舰开过来试试？",
				"added": 1577593257
			},
			{
				"comment_id": 5,
				"body": "> [draugrdeathlord](#comment_37_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Luoye do you really think that th Chinese economy will not also suffer ? The rest of the world (except Australia) is actually moving to alternative sources for even rare earth metals. [...]\n\n经济影响肯定会的，如果还没有”一带一路“的情况下，这个经济打击中国很难承受。但此时的中国不是彼时的中国，即使被美帝经济打击了，将中国华为列入实体清单，从长远角度来看我们很乐意这种状况，而且在中国国内各大开发商大肆发展经济，全球的压力下逼迫着所有的企业进行转型和升级，全球第一座人工智能城市雄安新区的建设也在稳步推进中，大量的传统企业也被迫着压力转型和升级，中国国内过去太过安逸作为中国人的我都有点不适应。微软、谷歌和苹果不用看也是相当反感美国政府的行为，这是在给他们制造一个更加强大的敌人。本来中国国内大部分人都可以安逸死，你们却偏偏要逼我们自强，又是何必呢！作为一个中国普通公民的我，除了感觉整个社会的就业压力在增大，但更多也是对那些过度安逸的人产生影响而已。",
				"added": 1577595937
			},
			{
				"comment_id": 6,
				"body": "> [draugrdeathlord](#comment_41_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Luoye I can see what you mean and yeah the western world is doing terrible, but what is the alternative ? The Chinese way of life ? We don't like your way either and the west is trying to find a better way for ourselves. [...]\n\n至于游戏时间的监管，这个问题比较糟糕，中国如今16亿人口，56个民族，各种各样的宗教信仰，治理起来比任何一个国家的情况都来得复杂，而且小孩子（未成年人）是最容易被影响的一批人，中国教育本就比较严格也比较辛苦，游戏相对来说更容易在短期内获得成就感，玩物丧志这种情况在中国很严重，小孩子的自制力也差，作出限制是很有必要的，但是最重要的还是要看家庭的教育，如果家长让你玩的话，那什么限制都限制不了，所以中国的游戏娱乐限制问题重点是在于家长而不全是社会问题。整个社会的压力都很大，有内因也有外因，中国式的教育适合中国也不完全正确，所以教育也在不断的改变，你试想一下56个民族，各种各样宗教信仰的人，超过16亿人口，放到美国中提倡你们那种自由，这样的一个国家到底会分裂成多少块都不好说，何况美国两个政党就能搞得天翻地覆。我听过一个美国移民到中国的妇女说:“美式教育太过自由，完全放纵孩子他们很难有机会找到正确的道路；中国的教育比较严格，提倡听话，更加类似于军人的思想，这时候老师的质量很重要”，然后那妇女说在特定的阶段主张不同的教育方式对孩子来说可能会得到更好的发展。",
				"added": 1577599102
			},
			{
				"comment_id": 7,
				"body": "> [draugrdeathlord](#comment_42_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Luoye regarding the artificial intelligence city, we call them smart city's and that sounds SCARY !! I will never want to be tracked and traced and watched and sanctioned by an A.I I like privacy and freedom and the right to go and do what I want when I want aslong as I'm not hurting anyone else.\n\n任何重大改变前都需要一个试行阶段，人工智能城市雄安新区是全球第一个试点城市，所以也不是只有中国自己在建设。顶级的工业设计师、城市规划师等都是来自于全球范围的。假若雄安新区这种模式能够成功，会给全世界的未来之城建设提供新思路，毕竟这也是全球顶尖工程师的智慧结晶。",
				"added": 1577599139
			},
			{
				"comment_id": 8,
				"body": "> [luoyewuheng](#comment_6_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN): 至于游戏时间的监管，这个问题比较糟糕，中国如今16亿人口，56个民族，各种各样的宗教信仰，治理起来比任何一个国家的情况都来得复杂，而且小孩子（未成年人）是最容易被影响的一批人，中国教育本就比较严格也比较辛苦，游戏相对来说更容易在短期内获得成就感，玩物丧志这种情况在中国很严重，小孩子的自制力也差，作出限制是很有必要的，但是最重要的还是要看家庭的教育，如果家长让你玩的话，那什么限制都限制不了，所以中国的游戏娱乐限制问题重点是在于家长而不全是社会问题。整个社会的压力都很大，有内因也有外因，中国式的教育适合中国也不完全正确，所以教育也在不断的改变，你试想一下56个民族，各种各样宗教信仰的人，超过16亿人口，放到美国中提倡你们那种自由，这样的一个国家到底会分裂成多少块都不好说，何况美国两个政党就能搞得天翻地覆。我听过一个美国移民到中国的妇女说:“美式教育太过自由，完全放纵孩子他们很难有机会找到正确的道路；中国的教育比较严格，提倡听话，更加类似于军人的思想，这时候老师的质量很重要”，然后那妇女说在特定的阶段主张不同的教育方式对孩子来说可能会得到更好的发展。\n\n限制自由？只要你没有犯法，没有发表反动的言论和参与反动行动，谁限制你自由？",
				"added": 1577599540
			},
			{
				"comment_id": 9,
				"body": "> [draugrdeathlord](#comment_45_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): It is true, our western school system is garbage especially since the late 1990s when the classes got to big and multicultural pressures began to necessitate changes to how teachers teach. We also moved more towards mixing boys and girls together in classes and boys in particular suffer during puberty with the distraction of girls around. [...]\n\n总的来说，中国社会的每一次调控对中国人民来说都是利大于弊，这些制度规则的文字经过第三方过滤后，在西方国家的群众看到的东西就不一样了。在2010年以前，其实很多中国人都向往西方那种自由，其实就是盲目听信谣言；在2013年之后，习近平上任后，一带一路的政策使中国进入了全面开放，中国的发展比以前更快，中国几乎和世界大部分的国家经济发展上都接轨起来，走出国门的人越来越多，同时越来越多海外厉害的华侨愿意回来国内发展，这个时候那些听信谣言的人突然就清醒过来，因为有了对比，发现外面世界也不过如此。在一带一路以前，中国和其他国家的信息对于中国人民来说其实是很闭塞的，现在全面开放了，每年超过1亿的中国人走出了国门，也越来越多的国外游客和高素质的移民来到中国，这样信息也流通了，中国内陆的人也不像以前那样好骗了。香港的教育资源、媒体和法治权都掌握在英国和美国手上，香港的年轻人的结局早就被注定的了。香港事件、台湾事件只会让全体中国人更加团结。\n\n虽然中国有很多很多的朋友，但是中国的崛起如此的快引来的敌人也不少，这个你应该懂什么意思吧？至于雄安新区的出现肯定是利大于弊的，雄安新区主要是用来解决中国北京的城市问题（Big city disease），中国北京和中国雄安这两个城市是相邻的，你可以了解一下“大城市病\"的问题。相信这个“大城市病”，不单止中国有，其他国家同样存在，这些问题都很严重，同样需要解决，大家都没有一个好的解决方案，中国首先来做这个事而已。一旦解决了，无非就是减小大城市的压力，释放生产力，带动更多的就业，防止城市更多的人才流失，这里很难完全说得清楚这个问题，雄安新区的意义不仅仅只有这点，它包括了高尖端科技未来走向、大城市病问题、生活、文化等一个未来的走向。雄安新区和原子弹的性质不一样，一个是社会层面的问题，一个是国防层面的问题。没有原子弹核武器的国家那岂不是任由美帝欺负？\n\n虽然我没有了解西方那些国家的科技发展的具体问题，在中国的科技发展和生活是息息相关的，如果新科技的出现没有明显的解决当前的社会新问题，从而带来更多的就业和创业机会，那么这种技术在中国是发展不起来的。你们很难想象得到像是微信(wechat)，淘宝，支付宝，抖音，Bilibili等一些软件平台到底给中国带来了多少的就业和创业机会，这些机会超过千万甚至亿。",
				"added": 1577609355
			},
			{
				"comment_id": 10,
				"body": "> [speedbroken](#comment_7_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh): Do you acknowledge the fact that the police, under the influence of CCP, has been conducting violence against the protesters, some of which are actually peaceful? If you do not, then your argument would only possibly work in your own world. If you do acknowledge the fact, then you are not committed to the universal value, which invalidates your argument for people sharing the universal value. [...]\n\n所以才说你们活在特朗普政府的虚影下，什么警察对抗议者行暴？你们是否搞清楚那些到底是抗议者还是暴徒/不法分子？那些全是暴徒，不法分子，打人根本需要看对方是谁，西方那边不是很多记者过来？只有被暴徒痛扁后才敢说真话，说真话后马上被美国政府封杀，你们真的有了解过状况？不了解状况就乱抹黑？facebook和推特上还有存在真相？中国用户大部分的账号全部被封杀你们清楚？美帝当初每天给不法分子每人每天提供超过400$怂恿他们游行示威搞破坏这事你们清楚？你们是不是也要睁一只眼闭一只眼？没有美帝后面大力的推动香港会乱成这样？",
				"added": 1577620044
			},
			{
				"comment_id": 11,
				"body": "> [speedbroken](#comment_6_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh): Do not get distracted. The post is about Hong Kong. Regardless of how Chinese government possibly works fantastically or miserably elsewhere, it does not do Hong Kong justice.\n\n中国政府如何为香港伸张正义？你了解香港回归时中国的一国两制的条约？我倒是希望香港事件多点发生在美国和英国，这样的风景线美帝自己也喜欢，这也是美帝自己说的。",
				"added": 1577620875
			},
			{
				"comment_id": 12,
				"body": "> [draugrdeathlord](#comment_48_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): You can try to make excuses for police brutality, the protesters are trying to protect their way of life, you can call their way wrong all you want but thats what they want and china should respect that. [...]\n\n如果是抗议者还好，当初是谁在后面让抗议者升级为暴徒？他们捍卫自己的生活方式没错，以为中国公民不清楚情况？错就错在于美帝花了大笔钱让游行示威升级为暴力事件，在你们政府看来就是所谓的经济打击。",
				"added": 1577620928
			},
			{
				"comment_id": 13,
				"body": "> [thetruth](#comment_34_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): This is the thing that worries me the most, i will fight against a social credit system until they kill me.\n\n你这些话只对了一部分，中国的一国两制的制度麻烦了解一下。中国政府不像美帝那样可以随意撕毁任何的条约，一旦中国政府干预香港司法和经济，就会遭到美帝联合其他国家对中国进行议论上的打击，从而进一步进行经济打击。中国政府不是在观望，更多的是在忍耐。犯我中华者，虽远必诛。香港的领土是属于中国，除此之外，香港的其他东西还是掌握在英国佬的手上，麻烦这一点你搞清楚这一点。香港年轻一代人的教育被美英干预，香港的媒体被英美控制，香港本地人根本无法拥有真正属于他们的自由，这些都是历史遗留的问题。",
				"added": 1577621791
			},
			{
				"comment_id": 14,
				"body": "----------------------------------------------------中国的自由与西方国家的自由---------------------------------------\n        我们的价值观不一样，事实上任何一个政府都在洗脑自己的人民，但都是以价值观为导向的，大体分类就是资本主义和社会主义。事实上，中国人更加相信有节制的自由，不相信西方国家那套绝对自由的言论，实际上西方的国家变得越来越糟糕，中国变得越来越强大，中国每一个地方都在变得更好，这一点你们永远无法否认，你们在害怕中国，但同时越来多人喜欢上中国。\n\n        随着中国每一代人的长大，只要我们有点想法，我们就可以翻墙阅览全球被开放的资料，也能轻易的到其他国家看看，了解全球各个地区的生活，能够了解到世界每一个地方是有多么的美好同时也有多么的糟糕，我们能够作出正确的选择，你们部分人迷失在你们所想的自由中导致你们的社会越来越糟糕，社会主义是在考虑全国普通人的利益建立的，资本的发展和壮大在哪个国家都无法避免，社会主义会制衡资本的无限壮大。\n\n       换个程序员角度来看，也就是架构问题，庞大的业务和程序需要一个高可用的架构，需要容错机制，各种各样的机制。庞大的架构都需要一个调度中心，一个高可用的调度中心，调度中心如何保持高可用，如何保证安全。共产党在朝一种高可用、可容错的架构演进。资本主义很容易形成多个不可控的小型调度中心，问题没严重前看似没问题，问题一旦严重，你们如何控制？美国人很聪明，特别在程序上，但是治理国家，就连最基本的种族歧视问题都没解决，呵呵。\n\n       事实上，社会最难控制的因素就是年轻人，因为他们的知识不足，社会阅历不足，对整个社会形态甚至当地的小社会形态的认知都不充分。你们这些资本家就会想方设法去拉拢他们，忽悠他们，他们成为你们资本家的炸药，最典型的就是香港的年轻人，被西方所谓的自由洗脑，最终还是成为美国和英国政府对抗中国的一颗翻不起多大风浪的炸药。\n       别问题主我住在哪里，我就住在香港对面--深圳。我和他们之间只是隔着一条江，此前我过香港只是简单的乘上地铁就可以过去了，现在我为他们的行为感到作呕。但是有部分勇敢香港年轻人过来大陆上大学，渐渐了解到中国大陆人的想法，看见中国大陆的农村也正在与飞快的速度建设起来，大陆人城市人思想足够开放，对大陆人的偏见渐渐就没有了，比香港大多本地人相处得更加融洽，英国伦敦其实和中国大多数的四线城市的样子差不多。一开始我们相信是为了他们所谓的自由，但最后他们只是想发泄，想破坏他们自己的故乡，到处抢夺普通人的物品，不管是香港人、内陆人还是国外游客，他们只想攻击和撕碎，这就是所谓的暴徒、不法分子。\n\n       都是中国人，我们只是隔着一条江，他们被美国人和英国人洗脑，学校充斥着各种各样的教条主义，被他们那种自由洗脑，他们的自由多么的高尚，相比之下中国大陆的自由是多么的可怕。我们的距离只是搭个地铁的时间，不到10分钟的车程，如此的近。他们连过来和我们一起生活彼此了解的勇气都没有，他们只是个懦夫，他们只喜欢接受着各种各样的教条主义，刚好符合自己的就一直追随下去，连最基本的事物辩证的能力都没有。\n\n       其实西方所谓的自由在普通成年人的眼里，在香港和在中国大陆有什么区别？该有的压力你在哪个社会都一样有。真正的区别也就是手握大量的资本的资本家，资本家关心法律怎样保护他们以方便他们用他们的方式为所欲为，他们是在压榨普通人，资本主义的国家资本掌握大权，法律无形中在保护他们，他们的法律蒙上一层迷雾，从来没有向着普通群众靠拢过。70亿的人口，普通群众占90%以上，当你杀死90%的人口，剩下的10%也会自动动态平衡，最后还是百分之90%的普通人，全体都是资本家这是个大同社会，是白日梦。韩国女明星崔雪莉以及她的好友的死，法律没能拯救她们，我得知消息我很伤心，我看过她很多电视剧，在韩国，漂亮的女人是资本家的玩物，一不小心，你连梦想奋斗的选择权都没有。\n\n       其次就是小孩子，中国的教育比较辛苦，先是强迫你接受12年的义务教育，然后到了大学放你自由，你甚至很不适应，但总有一部分人适应了小学初中和高中、适应了大学、适应了社会，渐渐这些人学会了隐忍、学会了坚持、学会了如何在恶劣环境下制造机会，在关键时刻给予敌人致命一击，中国的高速发展离不开这一群人。那些失败的人开始为自己的失败找借口，无论在哪个社会都是，这很可悲，明明自己很懒惰，却偏偏怪别人。\n\n      中国的人口基数大，整体知识文化水平偏低，国外很多有敌对倾向的人总喜欢用”大部分“这个词来试图抹黑共产党，抹黑中国。你们的阴谋很无聊啊。\n\n      香港是一个被资本压制到极限的一个小型社会，资本主义的最终形态就是压迫、控制，中国一直都在考虑共存，怎样去平衡资本与普通人的关系，法律上真正达到人人平等，我们每一次都能作出正确的选择，社会变得越来越好是最好的证明。\n       \n       总结：我们中国每年超过1亿人出国旅游，见惯各种形形色色的生活，看遍你们口口声声所说的那种自由，每年依然有大量的华侨回国发展，而且一年比一年多。其实也就一个原因，中国的环境要比你们的环境好得多，中国每年在朝着好的方向变化得足够快，国家用行动来给我们信心，你们的政府却没有给你们信心，西方很多的国家却在无时无刻动乱，甚至我们有时不理解为什么美国可以充当地球警察随意干扰你们国内的事务，你们的国家到底是有多么的弱小？能不能学学中国，学学俄罗斯？",
				"added": 1577805896
			},
			{
				"comment_id": 15,
				"body": "> [luoyewuheng](#comment_14_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN): ----------------------------------------------------中国的自由与西方国家的自由---------------------------------------        我们的价值观不一样，事实上任何一个政府都在洗脑自己的人民，但都是以价值观为导向的，大体分类就是资本主义和社会主义。事实上，中国人更加相信有节制的自由，不相信西方国家那套绝对自由的言论，实际上西方的国家变得越来越糟糕，中国变得越来越强大，中国每一个地方都在变得更好，这一点你们永远无法否认，你们在害怕中国，但同时越来多人喜欢上中国。 [...]\n\n以上文章转发过来的，中国需要更多的朋友，中国人也需要更多的朋友，朋友之间讲究的是包容，他们可以保留他们的差异，但必须得认可我们，否则我们没法一起变得更强大，这也是经济全球化更进一步发展的最应该具备的精神。",
				"added": 1577806239
			}
		],
		"1577276871_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 2,
				"body": "> [re4tsf9e](#comment_21_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): There are many commendable qualities to Chinese culture and civilization, but they usually aren't realized because Chinese always stifle one another. Perhaps why Chinese expats always seem to do so well (shaking head).\n\n呵呵，先搞好你们美国人自己的内政先吧，比中国还乱，中国也就香港特殊，谁的锅你们不懂？香港只是领土回归，法治权没回归，还是在该死的英国佬手上，之前我们一直期待特朗普进一步插手香港和台湾，这样我们政府就可强势的真正的收复统一香港和台湾，没想到特朗普如此的怂，纸老虎一只！",
				"added": 1577586551
			},
			{
				"comment_id": 3,
				"body": "这篇帖子居心何在，故意抹黑我们中国香港警察？到处乱造谣？你们还没睡醒？你们活在美国政府的谎言下真的可悲",
				"added": 1577586804
			}
		]
	},
	"comment_vote": {
		"13_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1,
		"345_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"14_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1,
		"15_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1
	}
}