{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1612044848,
			"title": "Народ, есть анархисты?",
			"body": "Мои контакты Tox\n144D521D3E19D2A4BF7E2018D5BB74EF943BCCEB42AEA783F6B2802A0BD467338322322E8251\nЗнаком с идеями анархо-коммунизма, анархо-синдикализма. Есть на какую тему пообсуждать.",
			"added": 1612044847
		},
		{
			"topic_id": 1612171411,
			"title": "Клирнетная нода Retroshare и Freenet",
			"body": "Retroshare:\nCQEGAcGWxsBNBGAWSeEBCACj7i5r79S+L6ApCKpA+LhIIYiTGu5ADCsmho3WlrB8\n53PdwflQdThkYGSCj39pNUAuclofUNQMxOm24ppjNBVds3wosxuVvCDLpzqkzEft\ngvFnaJyI8kSCdTK2P5ZJ4pMrQ5Cl3dghNK5/9n3ATFFhhXEvXsgwA3z+L2GW24B1\nUkyIA4tkwYUymN28V85La3Gemee1IdP08j7XB5ZWAKqNXbd8p1evCSIHd6ebnv7x\nomRpK16AwO1w8UB11qqKt58cxJxfUnoibMGSSWSAKnGy0h7U8yz/FEBJ3e6n39qZ\n7C/ydufc3bHVav5wzUTm3pzXt1BmjCVDFhXgcHTK8eURABEBAAHNInByYWlkIChH\nZW5lcmF0ZWQgYnkgUmV0cm9TaGFyZSkgPD7CwF8EEwECABMFAmAWSeEJENG63vJE\nB5tZAhkBAAAzcQf+JjuYwabUCEcTM3pz2WVNft7SqvUTYtWQGKTzasLEznfJJd/6\nuOJuD7n1ygDhUghN2mqXfLIBavHyAFl4uwMuqCXngZueJQd0Pv5XFlRaTQ2XmvhH\neV2kETX6b51JtB036fLcVaDUqtISIufh1OpY1HOLLxeSE/DyII2l54szZYAHk26F\nbQEQuqtVVnqlW66UKjhVPM3g2f62XinWsYIG6W6JM3UVvM6qiMQq421Oljdw24g9\neAGbcA1XzmSNqBTfXaIgyUpzC5lSVR+mN93MPOVcsby+4tePpvlxclKeFZiPxRCj\nNjhoK4C3CUkC8N7psKfOr9bsed51CUt2y25SnQIGCskKm81IAwbAqABwzUgEAAYL\nTXkgY29tcHV0ZXIFEPocfcPV3R9d7PSbGUFiCAMHAwIWsg==\nFreenet:\nidentity=-OgmsXXJ75wdLRV4AA5UN3TTXLV~dDPSW6UdpFL9AiY\nlastGoodVersion==RnJlZCwwLjcsMS4wLDE0NzU\nlocation==MC4yMDM1NTA2MjUzNzE0ODM5NA\nmyName==RnJlZW5ldCBub2RlIHdpdGggbm8gbmFtZSAjLTQxMDYzNjA2NzUxNDI0NjU5Mw\nopennet=false\nsigP256=MEYCIQDkDgwBvI-bD2DQha2mJrtfSctCZc7TuRsuq1NlJ6UNXQIhAIXLGqLgT1fdA8ma9sZynKAHY6irqb685UxtchIN8SDZ\nversion==RnJlZCwwLjcsMS4wLDE0ODk\nark.number=1\nark.pubURI=SSK@wMzZ41VmHxUcaxEZ8TQT4sHoYjDurPqlAeR8ic7dNDk,oRR1VEatLDH8YFMoXnDpK2Xb-3d2CQPxVOUPaIjNrqQ,AQACAAE/ark\nauth.negTypes=10\necdsa.P256.pub=MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAEEONbhiU7qjiN-2oSvlbzsX2KzOu13wprUZrRRstu4bz7S94-0UXhVKzlXaB64HSRIOtg8BjyHpjwGyjjDVw0VQ\nphysical.udp==MTkyLjE2OC4wLjExMjo2MDk5MzsxMjcuMC4wLjE6NjA5OTM7MTg1Ljk0LjIxMy4xOTc6NjA5OTM\nEnd",
			"added": 1612171409
		},
		{
			"topic_id": 1612805001,
			"title": "Экономические взгляды Петра Кропоткина и вызовы XXI века",
			"body": "Вадим Дамье, Дмитрий Рублев. Экономические взгляды Петра Кропоткина и вызовы XXI века\n\nВадим Дамье, Дмитрий Рублев\n \n\nЭкономические взгляды Петра Кропоткина и вызовы XXI века\n \n\nНаучное творчество и практическая деятельность Петра Кропоткина удивительно разнообразны: выдающийся ученый-географ и активный революционер-анархист, биолог и историк, философ и социолог. Его по праву можно считать одним из последних энциклопедистов - людей, прекрасно разбирающихся в самых различных отраслях человеческого знания. Некоторые из его научных выводов и предвидений не были по достоинству оценены современниками и только десятилетия спустя неожиданно приобрели новое звучание.\n\nИменно это произошло и с экономическими взглядами Кропоткина. Мыслитель одним из первых поставил вопрос о разрыве с логикой индустриальной цивилизации, в основе которой лежит стремление к росту любой ценой, к максимальному увеличению производства ради производства и потребления ради потребления, невзирая на экологические и гуманистические ограничения[1]. Век спустя многие из его аргументов и выводов были вновь сформулированы и развиты в русле экологического и других новых социальных движений конца ХХ - начала ХХI века.\n\nИнтерес к экономическим взглядам Кропоткина подкрепляется кризисным характером пути, по которому идет развитие современного человечества. Данный кризис носит не столько чисто экономический, сколько системный характер. Он затрагивает весь комплекс взаимоотношений между социумом и окружающей средой, то есть естественными основами его существования. Общество сталкивается с его проявлениями в самых различных сферах и областях: обострением экологических проблем (истощением ресурсов, ростом количества отходов, техногенными катастрофами, изменениями климата и так далее)[2], резкой поляризацией богатства и нищеты в мире и почти в каждой стране, что, в свою очередь, порождает упадок целых областей и регионов, крупные передвижения больших масс населения. Нарастание напряженности и противоречий в обществе влечет за собой рост потенциала межгосударственных и межэтнических конфликтов.\n\nРецепты преодоления кризисных явлений, которые предлагаются сегодня большинством политических, социальных и экономических школ и течений, как представляется, не выводят человечество за рамки породившей их системы координат. В либерально-рыночных моделях человеческая деятельность носит в целом хаотический характер, напоминая движение частиц в термодинамике, а результаты экономических усилий и рыночных операций, как справедливо отмечал французский философ Андре Горц, часто не соответствуют целям и задачам, которые ставят перед собой участники этих процессов[3]. Результатом становится не только дегуманизирующее отчуждение человека от общественно значимых решений, отрыв непосредственного производителя от потребителя и от результатов собственного труда, но и стремление производителя в поисках максимальной выгоды переложить груз издержек на общество в целом, на «третьих лиц», окружающую среду или последующие поколения, оставляя им в наследство груз нерешенных экологических и социальных проблем[4]. Централизованно-плановая модель экономики не является в этом отношении серьезной альтернативой рыночной системе, так как равным образом нацелена на рост любой ценой. Сторонники корпоративно-капиталистической и государственно-капиталистической («реально-социалистической») моделей полагают, что экономический рост обеспечит одновременно и максимальную прибыль, и максимальное увеличение общего богатства, и решение социальных проблем, и увеличение капиталовложений. Однако нацеленность на рост не решает экологических проблем и ведет лишь к истощению ресурсов. К тому же централизованное планирование «сверху» неминуемо нацелено на обслуживание властных интересов «центра», то есть управляющей элиты, а не на сохранение экологического равновесия.\n\nДанные обстоятельства побуждают обратиться к моделям экономического развития, ориентированным на удовлетворение потребностей конкретных людей, на максимальную стабильность экологической системы и на обращение к гуманным и социальным аспектам экономики. Именно такую модель предлагал Петр Кропоткин.\n\nЯвляясь представителем антиавторитарно-социалистического течения общественной мысли, Кропоткин придавал первостепенное значение гуманистическим целям социального развития. Отстаиваемый им анархический коммунизм не имел ничего общего с государственническим коммунизмом марксистов. Точкой отсчета в его модели являлась человеческая личность, основным ориентиром служило ее освобождение и всестороннее развитие. Вот как он писал об этом в работе «Анархия, ее философия, ее идеал»:\n \n\n«Коммунизм представляет собой… лучшую основу для развития личности - не того индивидуализма, который толкает людей на борьбу друг с другом… а того, который представляет собою полный расцвет всех способностей человека, высшее развитие всего, что в нем есть оригинального, наибольшую деятельность его ума, чувств и воли»[5].\n \n\nОбщество, за которое выступал мыслитель, рисовалось ему в виде основанной на свободном договоре федерации территориальных, производственных и иных общин, каждая из которых, в свою очередь, должна была представлять собой федерацию личностей.\n \n\n«[Члены общества] смогут прилагать свои знания и способности к производству на пользу всех; и для этого они будут складываться в организации, так устроенные, чтобы сочетать наличные силы для производства наивозможно большей суммы благосостояния для всех, причем в то же время личному почину будет предоставлен полнейший простор»[6].\n \n\nСоответственно, экономические решения в таком обществе надлежало принимать «снизу вверх», суммируя потребности индивидов и сообща согласуя их друг с другом в интересах всех.\n\nГуманистический подход Кропоткина стал выражением культуры «модерна» с характерными для нее аспектами эмансипации личности в культурной и политической сфере и в то же время - попыткой придать «модернизации» гармонизирующее и эгалитарное направление. В этом отношении он вполне соответствовал мысли, высказанной в конце ХХ столетия философом Андре Горцем, о том, что модернизации необходимо самой модернизироваться[7].\n\nАнархо-коммунистическая концепция Кропоткина имеет корни в традициях народничества. Как и у народников, предлагаемая им модель «модерна» носила избирательный характер. Отсюда характерное для него отрицание прогрессистских идей «западнических» течений общественной мысли (либерализма и марксистского социализма) в связи с неприятием дегуманизирующих аспектов индустриально-капиталистической системы. Так, Кропоткин подверг уничтожающей критике разрушение связанной со структурами традиционного общества культуры солидарности и взаимопомощи:\n \n\n«В результате везде - в законе, в науке, в религии - торжествует теперь теория, гласящая, что люди могут и должны добиваться собственного счастья, не обращая никакого внимания на чужие нужды. Это стало религиею нашего времени, и люди, сомневающиеся в ней, считаются опасными утопистами»[8].\n \n\nВ этой связи мыслитель рассматривал уничтожение крестьянской общины (с сопровождающим ее разорением крестьянства) и становление того, что сегодня принято называть анонимным и безликим «массовым обществом», когда «при современной системе общественной жизни все узы единения между обитателями одной и той же улицы и соседства исчезли»[9]. Такие явления Кропоткин считал искажающими и уродующими природу человека, для которой, как он считал, характерен естественный закон социальности и взаимопомощи.\n\nВ том, что касается экономики, Кропоткин задолго до экологов обрушивался на расточительность индустриальной модели, при которой происходит широкомасштабное расхищение естественных ресурсов, энергии и человеческих сил. Он замечал, «к какой ужасающей трате человеческих сил приводит современный порядок»[10], как человеческий труд затрачивается «на производство предметов, совершенно бесполезных или служащих исключительно для удовлетворения бессмысленного тщеславия»[11], на производство вооружений, на посреднические, бюрократические и пропагандистские нужды, «на то, чтобы при помощи рекламы заставить вас купить вещь, совершенно ненужную, или навязать покупателям товар дурного качества»[12]. Кропоткин видел причины такого положения в том, что «производство совершенно потеряло из виду потребности и приняло ложное направление»[13]. Он считал необходимым «преобразовать производство так, чтобы оно на самом деле удовлетворяло потребности»[14].\n\nПодобно большинству современных ему мыслителей, Кропоткин возлагал большие надежды на общественный прогресс, на развитие науки и техники. Тем не менее, он отвергал традиционное позитивистское представление о «линейном» прогрессе в жизни социума. Развитие в одних областях и сферах в условиях несправедливого, иерархического общества, в представлении Кропоткина, сочеталось с регрессом и упадком в других, с дегуманизацией и отчуждением человеческой личности, распадом социальных связей. Неудивительно, что он не воспринимал технику как нечто «нейтральное» в том, что касается социальных последствий ее применения. Отсюда вытекала критика им «современной фабричной системы» (то есть индустриальной системы организации производства и разделения труда): деквалификации работников, утраты ими ремесленных навыков и формирования нового типа работника, который знаком лишь с узким набором операций и действий и не в состоянии понимать смысл и цель производственного процесса в целом.\n \n\n«Современный идеал рабочего сводится, по-видимому, к следующему: женщины, девочки, мальчики, не зная ровно никакого ремесла и не имея ни малейшего представления о промышленности, в которой они заняты, в течение целого дня и целой жизни обречены производить одну и ту же мельчайшую частицу чего бы то ни было, […] делать пружины к перочинным ножам или “восемнадцатую часть булавки”. Они рабы машины, бессознательные члены механизма чудовищных размеров, не имеющие никакого понятия, зачем и почему равномерно движется машина. Ремесло, требующее искусного мастера, обречено на исчезновение как никуда не годный остаток прошлого, и ремесленник, находивший эстетическое наслаждение в произведении своих рук, заменен теперь живым рабом при железном рабе»[15].\n \n\nТрагизм такого положения, по мнению Кропоткина, состоял не только в господстве техники над «тупеющим» человеком, но и в том, что узкоспециализированный работник не склонен ставить вопрос о смысле и цели производства в целом, а следовательно - не склонен и стремиться к контролю над ним и к производственному самоуправлению. Ведь «идеал капиталистической промышленности - это ребенок, смотрящий за машиной, в которой он ничего не понимает и не должен понимать; а рядом с ним - надсмотрщик, налагающий на него штрафы, если его внимание хоть на минуту ослабеет»[16], далее - организатор производства и так далее. Ставя проблему таким образом, мыслитель на десятилетия опередил свое время: о появлении деквалифицированного типа «массового рабочего» в рамках атомизированного «массового общества» и о связанной с этим утратой радикализма рабочим движением социологи заговорили лишь во второй половине XX столетия.\n\nЕще одна тема, волновавшая Кропоткина, - это развитие международного разделения труда и широкий ввоз импортных товаров, что вело к разорению местного производства, приближенного к нуждам конкретных людей, и усиливало зависимость целых стран, регионов и континентов от безликого мирового рынка или от экономики развитых индустриальных держав, - «то, что называют “развитием” запоздалых в индустрии стран, то есть попросту грабежом их»[17]. В то же время он не был ни приверженцем национального экономического протекционизма (в духе поощрения «национального производителя»), ни сторонником традиционного для народников противопоставления экономических укладов России и Запада. Его подход к экономическим проблемам отличает универсализм. Полная реализация предлагавшейся им альтернативной модели общественного устройства, с точки зрения Кропоткина, была возможна лишь во всемирном масштабе.\n\nВ основе этой модели лежали критерии, которые мы могли бы определить такими сегодняшними терминами, как гуманизация, экологизация и диверсификация экономики, преодоление односторонности и зависимости отдельных региональных и страновых экономических комплексов. В определенном смысле это было путем к «иной», альтернативной, «глобализации».\n\nПреобразование экономики, предложенное Кропоткиным, всесторонне и начинается с самой ее основы - формы организации производства. Он писал - если употреблять современную нам терминологию - о необходимости децентрализации производства и системы управления, развития малых гибких технологий в индустрии и малых форм организации труда, преодолении жесткого разделения труда, о развитии сферы услуг, сопряженном с повышением роли технологического фактора, науки и образования, развитии сетевой структуры экономических, политических и общественных связей.\n\nОтрицая элементы индустриально-капиталистического устройства, связанные с подавлением человеческой личности, Кропоткин допускал сохранение некоторых из технологий индустриального общества, необходимых для удовлетворения материальных потребностей населения. Но в его модели они ставились в совершенно иной по существу постиндустриальный контекст. Прежде всего в работе «Поля, фабрики и мастерские» (и некоторых других) он поставил под сомнение тезис большинства экономистов о том, что создание крупной промышленности является непременным условием социального прогресса. Мыслитель доказывал жизнеспособность мелкого производства даже в условиях индустриального общества, его способность перенимать технические новшества и достижения:\n \n\n«Мелкая промышленность одарена необыкновенной живучестью, она подвергается всевозможным изменениям, приспосабливаясь к новым условиям, и продолжает бороться, не теряя надежды на лучшее будущее. […] Возникает […] множество маленьких мастерских с новейшими газовыми и электрическими двигателями, которые изыскивают для себя новые специальности»[18].\n \n\nМалые формы производства, полагал Кропоткин, способствуют развитию у работника интеллектуальных способностей, «изобретательности» и рационализаторства, художественного вкуса, а в итоге - формированию навыков интеграции интеллектуального и физического труда, возвращению к ремесленному пониманию целостности производственного процесса на основе современных технологий.\n\nРазвитие мелких форм организации производства в кооперативных и общинных формах, по мысли Кропоткина, позволило бы возродить ремесленные и творческие навыки, утраченные при индустриальной системе, и сделать шаг к преодолению отчуждения, приближению производства к потребителю и восстановлению контроля производителя над своим трудом. В работе «Взаимопомощь как фактор эволюции», анализируя характер производства в средневековой ремесленной мастерской, Кропоткин объяснял причины высокого качества выпускаемой в ней продукции следующим образом:\n \n\n«Ручной труд рассматривался в средневековых [...] артелях, гильдиях, как благочестивый долг по отношению к согражданам, как общественная функция [...], столь же почетная, как и всякая другая. Идея справедливости по отношению к общине и “правды” по отношению к производителю и к потребителю, которая показалась бы такой странной в наше время, тогда проникала весь процесс производства и обмена. [...] Средневековый ремесленник производил не на неизвестного ему покупателя, он не выбрасывал своих товаров на неведомый ему рынок: он, прежде всего, производил для своей собственной гильдии; для братства людей, в котором все знали друг друга, в котором были знакомы с техникой ремесла. [...] Кроме того, не отдельный производитель предлагал общине товары для покупки - их предлагала гильдия. [...] При такой организации для каждого ремесла являлось делом самолюбия не предлагать товаров низкого качества, а технические недостатки или подделки затрагивали всю общину»[19].\n \n\nВслед за английским писателем Уильямом Моррисом, выступившим со страстной эстетической критикой индустриально-капиталистического общества[20], Кропоткин поддерживал идею внедрения в современное производство техники средневекового ремесленного мастерства, а также - интеграции искусства в производственный процесс и быт трудящихся:\n \n\n«Для развития искусства нужно, чтобы оно было связано с промышленностью тысячами промежуточных ступеней, которые сливали бы их в одно целое, как справедливо говорили Рескин и великий социалистический поэт Моррис. Все, что окружает человека, - дома и их внутренняя обстановка, улица, общественное здание [...] - все должно обладать прекрасной художественной формой»[21].\n \n\nОднако Кропоткин не предлагал просто «вернуться назад», в доиндустриальный мир. Он ставил вопрос о разработке и внедрении новых технологий, небольших по масштабам и соответствующих тому, что сегодня называют «человеческим измерением». Условием развития малых форм производства, по его мысли, должны были стать современные методы интеграции труда (промышленного и сельскохозяйственного, физического и интеллектуального, творческого и производительного, исполнительского и управленческого), самоуправление и самоорганизация производственных единиц, а также - внедрение новейших изобретений, развитие наукоемких отраслей в промышленности и сельском хозяйстве. Так, уже в 1890-х годах в работе «Хлеб и воля» он предполагал в будущем развитие альтернативных видов энергетики (солнечной) и микробиологии:\n \n\n«Какой-нибудь Муше изобретет машину, которая сможет направлять и заставлять работать солнечные лучи, вместо того, чтобы добывать из недр земли солнечную теплоту, заложенную там в виде угля. Будут сделаны опыты над орошением земли культурами микроорганизмов - мысль вполне рациональная, но еще новая, осуществление которой даст, вероятно, возможность разводить в земле живые клеточки, необходимые растениям как для питания их корешков, так и для разложения составных частей почвы»[22].\n \n\nПри этом мыслитель не предполагал полностью отказаться от крупных форм организации производства в тех отраслях и сферах, где они совершенно необходимы. Он указывал на то, что, например, в тяжелой промышленности и машиностроении (чугуно- и сталелитейной, добыче полезных ископаемых, судостроении, трубопрокатном деле, электроэнергетике, на транспорте и других отраслях) и даже отчасти в текстильной индустрии вполне допустимы крупные предприятия[23]. Но и в этих отраслях он предлагал сохранить сектор ручной работы и малых форм производства (например по художественной выделке тканей)[24].\n\nКак видим, в вопросах организации производства Кропоткин отстаивал, по существу, выход за пределы индустриальной цивилизации, преодоление индустриальной логики. В этом смысле его вполне допустимо считать одним из первых теоретиков постиндустриализма. Характерно, что сам термин «постиндустриализм», введенный в оборот в 1914 году Анандом Кумарасвами, автором работ по доиндустриальному развитию азиатских стран, использовался в те годы для обозначения модели экономического развития, о которой писал Кропоткин. Так, теоретик английского либерального социализма Артур Пенти обозначал таким образом систему производственных отношений, где автономное малое производство с интеграцией ремесленных и художественных техник возрождается для преодоления социальных противоречий индустриальной системы[25].\n\nМногие современные теоретики постиндустриализма в своих построениях нередко повторяют выводы и предложения российского мыслителя. Среди некогда забытых, но ныне возродившихся или высказанных заново идей можно обнаружить и концепцию двухсферной экономики с небольшими разукрупненными формами при одновременном удовлетворении базовых потребностей за счет крупного, автоматизированного производства (Андре Горц[26], Йозеф Хубер[27] и другие), и представления о небольших производственных единицах, основанных на наукоемких, гибких и небольших по размерам технологиях (Элвин Тоффлер[28] и другие), и вывод о взаимосвязи между «альтернативными» и экологически приемлемыми технологиями, экономией ресурсов, с одной стороны, и децентрализованным, общинным устройством социума, с другой (Мюррей Букчин[29] и другие).\n\nИзменение формы организации производства должно, по мысли Кропоткина, сделать возможным преодоление индустриального типа разделения труда и более рациональным перераспределение труда в обществе. Он предполагал, что с помощью интеграции среднего и профессионального, гуманитарного и технического образования удастся подготовить всесторонне способного и развитого индивида, способного освоить самые различные занятия и роды деятельности, преодолевая навязываемую современным обществом узкую специализацию.\n \n\n«Прежде всего он [человек] выполнит - в виде ли земледельческого, в виде ли промышленного труда - тот труд, который он должен отдать обществу как свою долю участия в общем потреблении. Затем он употребит вторую половину дня, недели или года на удовлетворение своих артистических или научных потребностей»[30].\n \n\nРезультатом перераспределения труда в обществе и внедрения новых технологий должно было стать и общее сокращение рабочего времени до 4-5 часов в день. Отметим, что идея рациональной занятости, сокращения рабочего дня и увеличения сферы досуга в настоящее время весьма популярна в профсоюзных и экологических кругах.\n\nДалее, Кропоткин предлагал осуществить широкую диверсификацию производства на основе соединения различных его форм и отраслей, общей децентрализации и разукрупнения. В таких работах, как «Хлеб и воля», и особенно «Поля, фабрики, мастерские», он выдвинул идею максимально возможного регионального самообеспечения на основе интеграции промышленного и земледельческого труда, диверсификации регионального хозяйства:\n \n\n«…Каждая страна, каждая географическая область [могла бы иметь возможность] возделывать у себя нужные ей хлеб и овощи и производить… большую часть предметов, которые она потребляет. Это разнообразие - лучший залог развития промышленности посредством взаимодействия различных ее отраслей, залог развития и распространения технических знаний и вообще движения вперед»[31].\n \n\nРечь, разумеется, шла не о создании мелких, полностью замкнутых общин и не об абсолютной автаркии. Преобразования предполагалось начать «в довольно большой промышленной и земледельческой области, захватывающей и город, и деревню, а отнюдь не в одном только городе»[32]. Опора в первую очередь на собственные резервы и ресурсы позволила бы сэкономить энергию, природные запасы и человеческие силы.\n \n\n«Мы, конечно, не хотим этим сказать, что нужно устранить всякий обмен и что каждая местность должна стараться производить все, и именно то, что при данных условиях ее климата может расти только благодаря более или менее искусственной культуре. Мы хотим только показать, что теория обмена в том виде, в каком она проповедуется теперь, сильно преувеличена и что многие из ныне совершающихся “обменов” бесполезны и даже вредны»[33].\n \n\nИными словами, самоуправляющийся регион не сможет сам производить все необходимое и вынужден будет в этих случаях вступать в отношения с другими регионами и федерациями, координируя с ними свою деятельность «снизу», через систему двойной федерации, то есть на основе суммирования потребностей и статистического учета. При этом допускалось расширение импорта изделий, не производимых в стране, «обмен которых является необходимостью». Предполагалось расширить и «обмен в области изобретений, искусства и науки»[34].\n\nТаким образом, на место специализированного и централизованного производства встало бы максимально возможное региональное самообеспечение на основе интеграции труда и диверсификации хозяйства. Модель новой индустрии и сельского хозяйства, по Кропоткину, представляла бы собой сеть автономных диверсифицированных производственных комплексов, ориентированных в первую очередь на самообеспечение предприятия, затем - на удовлетворение потребностей населения конкретного региона, затем - других регионов и лишь в последнюю очередь - на экспорт. Примерно те же предложения выдвигаются в рамках современных концепций экорегиональной экономики.\n\nПредлагаемая Кропоткиным система экономических отношений далека от рыночной системы. В то же время - это не централизованное планирование, а своего рода децентрализованное, основанное на прямой демократии и системе «заказов», поступающих снизу, непосредственно от потребителей. Мыслитель полагал, что ни рынок, ни административно-бюрократическое управление не позволяют переориентировать производство непосредственно на удовлетворение потребительских нужд, сэкономить человеческие силы и ресурсы. Он считал необходимым «перестать производить для неизвестных покупателей»[35] и обратиться «к потребностям и вкусам» конкретных потребителей[36]. Вот почему в центре его интересов оказывались методы и способы выявления потребностей и потребительских нужд, которые затем и должны были, по его мысли, ориентировать развитие производства. По существу, Кропоткин предвосхитил соответствующие представления, сложившиеся в конце ХХ века в рамках концепций «альтернативной экономики»[37]. Сначала предполагалось осуществить «изучение потребностей человечества и средств удовлетворения их с наименьшей бесполезной потерей человеческих сил»[38]. Когда люди установят свои потребности и определят пути их удовлетворения, они могли бы приступить к тому, чтобы «согласовать единичные усилия людей и направлять их к общей цели - удовлетворению нужд всех членов общества, - а не предоставлять удовлетворение этих нужд всем случайностям разрозненного производства»[39].\n\nВ основу механизмов выявления и удовлетворения потребностей, а, следовательно, и регулирования производства Кропоткин предлагал положить принципы самоуправления, «прямой демократии». Эта функция в его модели возлагалась на городские и сельские территориальные союзы граждан (свободные коммуны), а также на многочисленные свободные отраслевые структуры (от экономических до культурных и досуговых), имеющие возможность формироваться в различные сети и объединения. Само единство общества в этой ситуации неизбежно ставится в зависимость от участия человека во множестве различных сетей[40]. Постепенно социально-экономическому устройству общества предстояло приобрести очертания, близкие сетевому, освободившись от четкой привязки к территории и превратившись в экстерриториальные, параллельно существующие организации по симпатиям и интересам.\n\nВ работах «Речи бунтовщика» и «Хлеб и воля» Кропоткин представляет систему, в которой решения принимаются cнизу, в общинах, и согласовываются представителями на конференциях на основе инструкций избирателей. Деловая направленность мероприятия, привязанная к конкретным проблемам производства и потребления, по мнению Кропоткина, обеспечит быстрое принятие и согласование решений:\n \n\n«Назначение и посылка доверенных на совещание понятно тогда, когда сто, двести и даже тысяча человек, ежедневно сталкивающихся между собою на работе за общим делом и потому знающих друг друга и знающих дело, обсудив какой-нибудь вопрос, приходят к какому-нибудь заключению и выбирают доверенного, чтобы столковаться с другими такими же доверенными по этому частному вопросу. Избрание происходит тогда вполне сознательно; и каждый знает, что он может поручить своему уполномоченному. Мало того: этот уполномоченный только изложит другим доверенным соображения, которые заставили пославших его придти к тому или иному заключению. Не имея права навязывать что-либо, он постарается найти почву для соглашения и вернется домой с прямым предложением, которое уполномочившие его могут принять или отвергнуть»[41].\n \n\nТакая форма координации экономики приблизит управление к потребностям регионов, к непосредственным запросам населения, поможет учесть многочисленные природные и социальные условия. Согласовательный характер совещательных структур, в отличие от директивно-управленческого, может способствовать сглаживанию противоречий, переносу инициативы и ответственности за решения вниз, непосредственно к коллективам производителей и потребителей[42].\n\nКонечно, Кропоткин связывал реализацию своей модели с революционным, радикальным преобразованием общества на основе всеобщего самоуправления. Но характерно, что он постоянно стремился обнаружить элементы и черты будущих общественных процессов уже в рамках тенденций развития современного ему социума. Следуя его примеру, небезынтересно задаться вопросом: насколько актуальны могли бы оказаться предложения и идеи ученого для решения проблем, с которыми сталкивается сегодняшняя российская экономика?\n\nСреди этих проблем - специфическое, зависимое место России на мировом рынке (в первую очередь в роли поставщика сырья и вооружений), гипертрофированное развитие нефтегазовой отрасли (имеющей тенденцию превратиться в своего рода «моноотрасль»), упадок ряда отраслей, работающих на внутренний рынок, и сельского хозяйства (не в последнюю очередь за счет широкого импорта соответствующих товаров из-за рубежа), региональные диспропорции, рост бедности и социального неравенства, экологический кризис. Как представляется, господствующие в настоящее время концепции (открытого рынка, с одной стороны, и покровительства отечественному товаропроизводителю, сырьевой ренты, национализации недр и использования доходов от нефти и газа для социального и технологического развития, с другой) не позволяют радикально разрешить трудности, вставшие перед хозяйством страны. Не является альтернативой и возвращение к модели советского протекционизма и централизованного директивного планирования.\n\nИдея регионального самообеспечения и ориентации на местные ресурсы и возможности, которую отстаивал Кропоткин, позволила бы возродить в стране промышленное производство, ориентированное на внутреннего потребителя, а также, в первую очередь, сельское хозяйство. Последний момент чрезвычайно болезнен в условиях начинающегося мирового продовольственного кризиса и в ситуации, когда внедрение генетически модифицированных продуктов увеличивает зависимость стран периферии от развитых индустриальных держав (в частности в отношении поставки семян).\n\nДиверсификация экономики, предлагавшаяся Кропоткиным, могла бы вывести страну из положения нефтегазового придатка ведущих мировых экономик. Из экономической модернизации, по Кропоткину, неизбежно вытекал бы отказ от экономической модели, ориентированной на топливно-энергетический комплекс и производство сырья на экспорт, от ориентации на развитие сталелитейной промышленности и упора на развитие военных отраслей. Альтернативой этим процессам стала бы переориентация производства на внутреннее потребление, развитие науки, техники, образования. И это не означало бы возвращения к экономической модели СССР, ориентированной на тяжелую промышленность. Модель Кропоткина предполагает сосредоточение на развитии экологических и альтернативных технологий, обрабатывающей промышленности и сельского хозяйства.\n\nНаконец, ориентация на развитие местного и регионального производства могла бы способствовать решению проблемы перераспределения ресурсов и материальных средств между центром и регионами как в мировом масштабе, так и на уровне страны, что позволило бы разрешить проблему острых диспропорций и неравенства.\n \n_______________________________________________________________\n \n\n1) Об экономике как системе, в которой действует принцип «расти или умри», см. подробнее в работах американского экологического теоретика Мюррея Букчина: Bookchin M. Der Weg aus der ökologischen Krise // Bookchin M. Hierarchie und Herrschaft. Berlin, 1981. S. 52-55.\n\n2) См.: Медоуз Д., Рандерс Й. Пределы роста. 30 лет спустя. М., 2007.\n3) См.: Gorz A. Kritik der ökonomischen Vernunft. Berlin, 1989.\n4) О рыночной экономике как «экономике неоплаченных издержек» см.: Kapp K.W. Soziale Kosten der Marktwirtschaft. Frankfurt a. M., 1988.\n\n5) Кропоткин П.А. Анархия, ее философия, ее идеал // Кропоткин П.А. Анархия, ее философия, ее идеал: Сочинения. М. 1999. С. 243.\n\n6) Он же. Записки революционера. М., 1988. С. 389.\n7) Gorz A. Op. cit. S. 13.\n\n8) Кропоткин П.А. Взаимопомощь как фактор эволюции. М., 2007. С. 177.\n9) Там же. С. 217.\n\n10) Он же. Хлеб и воля // Он же. Хлеб и воля. Современная наука и анархия. М., 1990. С. 191.\n11) Там же. С. 38.\n12) Там же. С. 39.\n13) Там же. С. 191.\n14) Там же.\n\n15) Он же. Поля, фабрики и мастерские. (Земледелие, промышленность и ремесла.) М., 1908. С. 5-6.\n\n16) Он же. Хлеб и воля… С. 197.\n\n17) Он же. Современная наука и анархия // Он же. Хлеб и воля… С. 486.\n\n18) Он же. Поля, фабрики и мастерские... С. 113, 114, 130.\n\n19) Он же. Взаимопомощь как фактор эволюции… С. 152-153.\n\n20) Подробнее см.: Метен А. Социализм в Англии. СПб., 1898. С. 83-115.\n\n21) Кропоткин П.А. Взаимопомощь как фактор эволюции… С. 127.\n\n22) Он же. Хлеб и воля… С. 234.\n\n23) Он же. Поля, фабрики и мастерские. С. 122.\n24) Там же. С. 161.\n\n25) См.: Иноземцев В.А. Постиндустриальный мир Даниэла Белла // Белл Д. Грядущее постиндустриальное общество. Опыт социального прогнозирования. М., 2004. С. XII.\n26) См.: Gorz A. Les chemins du paradis. Paris, 1983.\n\n27) См.: Huber J. Wer soll das alles ändern. Die Alternativen der Alternativbewegung. Berlin, 1980.\n\n28) Тоффлер Э. Третья волна. М., 2004.\n\n29) См.: Bookchin M. Towards a Liberatory Technology // Bookchin M. Post-Scarcity Anarchism. San Francisco, 1971. Последняя идея близка значительной части участников современных экологических движений. Вот как характеризовала эти представления первый лидер германской Партии зеленых Петра Келли: «Здесь и в третьем мире мы должны придти к тому, что жизнь станет проходить в небольших по размеру общинах, обеспечивающих человеку высокую степень самоопределения и участия в принятии решений и предоставляющих индивиду солидарность и безопасность. Высокоразвитая, небольшая и мягкая техника должна быть ориентирована на масштабы человека, природы и окружающей среды (применение солнечной энергии и биологических процессов при добыче энергии и сырья, высокоэффективное использование всех ресурсов, внедрение экологических процессов для удобрения почвы и борьбы с вредителями, повторная обработка использованных материалов, изготовление предметов высокой надежности, служащих длительное время), а люди - обладать всесторонними навыками. Ремесло, искусство и наука будут нести на себе отпечаток не конкуренции и эгоизма, а партнерства и товарищества» (Kelly P.K. Die vierte Partei // Die Grünen: Personen, Projekte, Programme. Stuttgart, 1980. S. 76).\n\n30) Кропоткин П.А. Хлеб и воля… С. 117.\n31) Там же. С. 206.\n\n32) Он же. Современная наука и анархия… С. 383.\n\n33) Он же. Хлеб и воля… С. 214.\n\n34) Он же. Поля, фабрики и мастерские… С. 105.\n\n35) Он же. Хлеб и воля… С. 214.\n36) Там же. С. 235.\n37) См., например: Gorz A. Les chemins du paradis.\n38) Кропоткин П.А. Хлеб и воля… С. 189.\n39) Там же. С. 195.\n\n40) Он же. Речи бунтовщика. Пг.; М., 1921. С. 212-213.\n41) Там же. С. 195.\n\n42) Там же. С. 260; он же. Хлеб и воля… С. 56-57.\n\n \n\nИсточник: Неприкосновенный запас № 67 (№5/2009)\nhttps://aitrus.info/node/467?fbclid=IwAR324E8AtGOFvi9TCPIUwz9f_1IjH2n06hlK-CMP7CRx3jwI4Jl486k0mlE",
			"added": 1612804998
		}
	],
	"topic_vote": {
		"1611078994_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY": 1,
		"1610779568_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": 1,
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1612044848_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": [
			{
				"comment_id": 1,
				"body": "> [jk7](#comment_112_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): не, товмайор, так не пойдёт!\n\nЧё, токс разве клирнетный?",
				"added": 1612127342
			},
			{
				"comment_id": 4,
				"body": "> [zyxline](#comment_16_1HNTCqyYKENbotBRdXLFyB8iqyU3UNTWtW): Молодец, быстро его раскусил. Этот хер на многие ресурсы предлагает зайти для компрометации\n\nПолковник Краснов. Это вы?",
				"added": 1612309527
			},
			{
				"comment_id": 5,
				"body": "> [zombibi](#comment_97_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): тяжела и неказиста жизнь простого анархиста....\n\nНу, я так не думаю. Я считаю, что с помощью большевиков мы замутим мировую революцию, а потом...",
				"added": 1612545696
			}
		],
		"3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 2,
				"body": "А может давай забаним jk7, шизик он какой-то",
				"added": 1612173065
			},
			{
				"comment_id": 3,
				"body": "> [cra](#comment_156_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): Вообще, я как бы не в теме, не вникал, но вроде как тут нет функционала модерирования и бана. Т. е. как бы \"нет цензуре\" же. Или я неправ?\n\nЯ анархист, но не отрицаю того, что если человек неприятен обществу, то общество должно отвернуться от человека. Так работает RetroShare. В качестве системы самоцензуры может выступать Хабр.",
				"added": 1612269586
			}
		],
		"1612510082_1Gbwkkeq9Uq7vKhigxExP8Wnjs7fBEWWKR": [
			{
				"comment_id": 6,
				"body": "С поиском истины вы зашли слишком далеко. Тут вам только нужно найти кто прав, а кто виноват.",
				"added": 1612545812
			}
		],
		"1599993973_1LBxgBiCcnTFh4mEyaF3ycmPY2ciC3c3Kj": [
			{
				"comment_id": 7,
				"body": "Проприетарщина полнейшая.",
				"added": 1612545992
			}
		],
		"1612171411_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": [
			{
				"comment_id": 8,
				"body": "> [topnet](#comment_125_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): Стопудова через 3 месяца здохнет\n\nНе всегда же мне держать ПК включенным. Да и айпи меняется постоянно, с перезагрузкой роутера.",
				"added": 1612607980
			},
			{
				"comment_id": 9,
				"body": "> [cra](#comment_160_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): В чём проблема сделать, чтобы IP не менялся?\n\nНу, такая у нас сеть. Впрочем, это не так уж страшно, IP раз в неделю, если не в месяц меняется.",
				"added": 1612812809
			}
		],
		"1612616752_1Gbwkkeq9Uq7vKhigxExP8Wnjs7fBEWWKR": [
			{
				"comment_id": 10,
				"body": "> [cra](#comment_161_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): О, ништяк, у нас ещё один наркоман. Теперь jk7 не одинок. Веселее будет.\n\nЯ даже не понимаю, как такому ублюдку как jk7 вообще интернет провели. Возможно только по родственным связям.",
				"added": 1612812940
			}
		],
		"1612805001_17JnHiRfgz1bvhsC2ii8naN9tMwMHzG1zg": [
			{
				"comment_id": 11,
				"body": "> [zombibi](#comment_102_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC): jk7, может вам интересны и другие демократические \"подвиги\"? опять же, гугль, англоязычные источники. тоже самое без усилий по  переводу: ttps://ru.wikipedia.org/wiki/%D0%AD%D0%BA%D0%BE%D0%BB%D0%BE%D0%B3%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B0%D1%8F%D0%B2%D0%BE%D0%B9%D0%BD%D0%B0%D0%A1%D0%A8%D0%90%D0%BF%D1%80%D0%BE%D1%82%D0%B8%D0%B2_%D0%92%D1%8C%D0%B5%D1%82%D0%BD%D0%B0%D0%BC%D0%B0 . причем все как то молчат и не вспоминают о том сколько граждаских там погибло.\n\nЗабань jk7, как я это сделал. Он токсик ужасный.",
				"added": 1613340589
			}
		]
	},
	"comment_vote": {}
}