{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1CVs2JWP6SDK4ghEcXG1HA5hwMajUsBRWv": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"2_1JWzeTyK26d4RAYsyHethugMvfKfQJQSCt": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 1,
				"body": "#O MENTALISTA\nPatrick Jane (Simon Baker) é um consultor independente para o California Bureau of Investigation (CBI). Ex-golpista, antes disso ele fingia ser um psíquico e médium. Cinco anos antes dos eventos do episódio piloto, Jane foi à televisão e disse que suas habilidades ajudaram a polícia a fazer o perfil de um serial killer chamado Red John. Este, então, furioso com a mentira, vingou-se matando a mulher e a filha de Patrick. Ele, então, juntou-se à equipe da Agente Teresa Lisbon (Robin Tunney) e utiliza sua alta capacidade de observação para ajudar a encontrar o assassino de sua família. \n\n- https://megaseriehd.com/series/o-mentalista/",
				"added": 1545620208
			},
			{
				"comment_id": 5,
				"body": "#Leverage\nEm Leverage conhecemos um grupo de \"Robin Hoods modernos\": um time de ladrões e hackers que se unem para se vingar das pessoas que usam seu poder e riqueza para prejudicar os mais fracos. Encabeçando o grupo de trapaceiros que aplica golpes em grandes corporações está Nathan Ford. Após ter perdido seu filho, ele é convencido a participar do grande golpe, com a promessa de se vingar de sua antiga companhia de seguros. Juntam-se a ele Sophie Devereaux, uma trapaceira que usa seus dotes artísticos para conseguir o que quer; Eliot Spencer, um \"especialista em recuperações\" com incríveis habilidades de luta; Alec Hardison, um mago da tecnologia e equipamentos que mantém a equipe conectada; e Parker, uma ladra excêntrica que adora saltar de prédios ou se meter em lugares apertados. Juntos, estes golpistas aplicam sua energia, seu raciocínio rápido e mente afiada para assegurar a justiça para os excluídos da sociedade.\n\n\n- https://week-series.com/leverage/",
				"added": 1545622411
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 2,
				"body": "#Ulysses: Jehanne Darc To Renkin No Kishi\nFrança, século 15, durante a Guerra dos Cem Anos com a Inglaterra. Montmorency, o filho de um nobre, mergulha no estudo da magia e da alquimia numa escola de cavaleiros. No entanto, após a derrota da França, a escola é atacada e Montmorency é forçado a fugir. Enquanto corre, ele conhece uma garota chamada Jeanne.\n\n- https://www.superanimes.site/anime/ulysses-jehanne-darc-to-renkin-no-kishi",
				"added": 1545620284
			},
			{
				"comment_id": 3,
				"body": "#Double Decker! Doug & Kirill\nNa cidade-estado de Lisvalletta, dois sóis iluminam a manhã. Seus moradores levam vidas tranquilas, mas nas sombras da cidade, o crime e o tráfico de drogas rolam soltos. O \"Hino\", uma droga altamente letal e perigosa, é uma das mais comercializadas. A Unidade Especial de Investigação SEVEN-O se especializa no combate ao Hino. Para combater esse problema, a unidade usa o Sistema Double Decker, que se baseia na ação de duplas de \"parceiros\". Um investigador experiente, Doug Billingham forma dupla com Kirill Vrubel, uma novata com habilidades misteriosas e desconhecidas.\n\n- https://www.superanimes.site/anime/double-decker-doug-kirill",
				"added": 1545620317
			},
			{
				"comment_id": 4,
				"body": "#Sword Gai: The Animation\nSword Gai conta a história de Gai, ainda jovem perdeu sua mãe, que encontrou a morte num bosque, ele então foi adotado pelo espadachim Amon. Anos depois, Gai se torna aprendiz de Amon e durante a forja de uma espada acaba perdendo o braço direito. Amon então, para ajudá-lo, molda a espada demoníaca Shiryu com a forma de um braço, para assim substituir o braço de Gai, que agora pode se fundir com a arma e lutar contra seus inimigos.\n\n\n- https://www.superanimes.site/ova/sword-gai-the-animation",
				"added": 1545620388
			}
		],
		"2_1JWzeTyK26d4RAYsyHethugMvfKfQJQSCt": [
			{
				"comment_id": 6,
				"body": "#Hidrato de metano\nO hidrato de metano é a mistura de dois componentes, o hidrato de gás e o metano, que são os que mais abundam em estado natural.\n- https://web.archive.org/web/20170825023513/http://www.scielo.br/pdf/rbg/v18n3/a13v18n3.pdf",
				"added": 1545623659
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 7,
				"body": "E, quando chegaram à multidão, aproximou-se-lhe um homem, pondo-se de joelhos diante dele, e dizendo:\nSenhor, tem misericórdia de meu filho, que é lunático e sofre muito; pois muitas vezes cai no fogo, e muitas vezes na água;\nE trouxe-o aos teus discípulos; e não puderam curá-lo.\nE Jesus, respondendo, disse: Ó geração incrédula e perversa! até quando estarei eu convosco, e até quando vos sofrerei? Trazeimo aqui.\nE, repreendeu Jesus o demônio, que saiu dele, e desde aquela hora o menino sarou.\nEntão os discípulos, aproximando-se de Jesus em particular, disseram: Por que não pudemos nós expulsá-lo?\nE Jesus lhes disse: Por causa de vossa incredulidade; porque em verdade vos digo que, se tiverdes fé como um grão de mostarda, direis a este monte: Passa daqui para acolá, e há de passar; e nada vos será impossível.\nMas esta casta de demônios não se expulsa senão pela oração e pelo jejum.\n\n- Mateus 17:14-21",
				"added": 1545631004
			},
			{
				"comment_id": 8,
				"body": "A ti, SENHOR, levanto a minha alma.\nDeus meu, em ti confio, não me deixes confundido, nem que os meus inimigos triunfem sobre mim.\nNa verdade, não serão confundidos os que esperam em ti; confundidos serão os que transgridem sem causa.\nFaze-me saber os teus caminhos, Senhor; ensina-me as tuas veredas.\nGuia-me na tua verdade, e ensina-me, pois tu és o Deus da minha salvação; por ti estou esperando todo o dia.\nLembra-te, Senhor, das tuas misericórdias e das tuas benignidades, porque são desde a eternidade.\nNão te lembres dos pecados da minha mocidade, nem das minhas transgressões; mas segundo a tua misericórdia, lembra-te de mim, por tua bondade, Senhor.\nBom e reto é o Senhor; por isso ensinará o caminho aos pecadores.\nGuiará os mansos em justiça e aos mansos ensinará o seu caminho.\nTodas as veredas do Senhor são misericórdia e verdade para aqueles que guardam a sua aliança e os seus testemunhos.\nPor amor do teu nome, Senhor, perdoa a minha iniqüidade, pois é grande.\nQual é o homem que teme ao Senhor? Ele o ensinará no caminho que deve escolher.\nA sua alma pousará no bem, e a sua semente herdará a terra.\nO segredo do Senhor é com aqueles que o temem; e ele lhes mostrará a sua aliança.\nOs meus olhos estão continuamente no Senhor, pois ele tirará os meus pés da rede.\nOlha para mim, e tem piedade de mim, porque estou solitário e aflito.\nAs ânsias do meu coração se têm multiplicado; tira-me dos meus apertos.\nOlha para a minha aflição e para a minha dor, e perdoa todos os meus pecados.\nOlha para os meus inimigos, pois se vão multiplicando e me odeiam com ódio cruel.\nGuarda a minha alma, e livra-me; não me deixes confundido, porquanto confio em ti.\nGuardem-me a sinceridade e a retidão, porquanto espero em ti.\nRedime, ó Deus, a Israel de todas as suas angústias.\n\n- Salmos 25:1-22",
				"added": 1545631060
			},
			{
				"comment_id": 9,
				"body": "O SENHOR é a minha luz e a minha salvação; a quem temerei? O SENHOR é a força da minha vida; de quem me recearei?\nQuando os malvados, meus adversários e meus inimigos, se chegaram contra mim, para comerem as minhas carnes, tropeçaram e caíram.\nAinda que um exército me cercasse, o meu coração não temeria; ainda que a guerra se levantasse contra mim, nisto confiaria.\nUma coisa pedi ao Senhor, e a buscarei: que possa morar na casa do Senhor todos os dias da minha vida, para contemplar a formosura do Senhor, e inquirir no seu templo.\nPorque no dia da adversidade me esconderá no seu pavilhão; no oculto do seu tabernáculo me esconderá; pôr-me-á sobre uma rocha.\nTambém agora a minha cabeça será exaltada sobre os meus inimigos que estão em redor de mim; por isso oferecerei sacrifício de júbilo no seu tabernáculo; cantarei, sim, cantarei louvores ao Senhor.\nOuve, Senhor, a minha voz quando clamo; tem também piedade de mim, e responde-me.\nQuando tu disseste: Buscai o meu rosto; o meu coração disse a ti: O teu rosto, Senhor, buscarei.\nNão escondas de mim a tua face, não rejeites ao teu servo com ira; tu foste a minha ajuda, não me deixes nem me desampares, ó Deus da minha salvação.\nPorque, quando meu pai e minha mãe me desampararem, o Senhor me recolherá.\nEnsina-me, Senhor, o teu caminho, e guia-me pela vereda direita, por causa dos meus inimigos.\nNão me entregues à vontade dos meus adversários; pois se levantaram falsas testemunhas contra mim, e os que respiram crueldade.\nPereceria sem dúvida, se não cresse que veria a bondade do Senhor na terra dos viventes.\nEspera no Senhor, anima-te, e ele fortalecerá o teu coração; espera, pois, no Senhor.\n\n- Salmos 27:1-14",
				"added": 1545631102
			}
		]
	},
	"comment_vote": {}
}