{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1576177062_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1576008880_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 1,
				"body": "> [haxxer](#comment_1_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk): درس دارم خودم.دارم برای سرگرمی اینکارو میکنم\n\nبرید توی بخش ZeroMail\nhttp://127.0.0.1:43110/Mail.ZeroNetwork.bit/\nو \ncreate my inbox\nرو بزنید تا بتونیم با ایمیل باهم در ارتباط باشیم",
				"added": 1576009878
			}
		],
		"1576185412_16VNPV97D22nLggFssEwQXScnyUGX2cHjq": [
			{
				"comment_id": 2,
				"body": "پوففففف بازم شماها؟",
				"added": 1576206764
			},
			{
				"comment_id": 4,
				"body": "جی میگید شماها؟ یکم فکر کنید\nمگه انقلاب قبلی به نفع مردم شد که این بشه؟ اونچه که باید تغییر کنه فکر من و توعه\nبا این فکر هرکسی از هرجایی بیاد وضعیت همینه",
				"added": 1576366875
			},
			{
				"comment_id": 5,
				"body": "> [beygi1368](#comment_1_19E14rWN77YTRpN3j1diXKM97q5WBytw6z): یعنی میگی بچسبیم به همین آخوندای انگل؟! یا بریم به دوستان اون خاتمی بیخایه رای بدیم؟!\n\nهیچکدوم!\nاول فک کنیم کجای فکر کردن رو اشتباه رفتیم که وضعمون این شد.\nوقتی فکرمون رو تصحیح کردیم اونموقع وقت تصمیم گیریه که چیکار باید کرد.\nچون دروغ رو میپذیری که دروغ میگن بهت \nاگه نپذیری کسی نمیتونه بهت دروغ بگه\nالان کشورهای اروپایی فکردی چی باعث میشه نتونن به مردمشون دروغ بگن و نتونن قانون شکنی کنن؟",
				"added": 1576869539
			},
			{
				"comment_id": 6,
				"body": "> [samhv64](#comment_2_15xJB7FfbvRoSjdoKbCoBytdAUu3qYpYyG): اینکه بخوای اینجوری فکر کنیم که ممکنه رژیم بعدی بدتر از این رژیم میشه کار اشتباه هست ... این طرز فکر فقط به ما ضربه میزنه.... در انقلاب قبلی مردم گول حرفایی رو خوردن از روی سادگی و نا آگاهی .... وعده هایی چون آب و برق مجانی و اتوبوس رایگان و مسکن میسازیم  پول نفت رو بین مردم تقسیم میکنیم .... و به مردم گفتن شما فقط به معنویت احتیاج دارید ... باید دنبال باید برید دنبال معنویات بقیه امور باما.... و اینجوری مردم رو با وعده بهشت هم در این دنیا و هم در آخرت گول زدن....اما پس از ۴۰ سال ما کارنامه سیاهی رو میبینیم که نیاز به انقلاب داره ونه اصلاح ...مردم امروز ما آگاه تر شدن و به سادگی مردم ۴۰ سال قبل نیستن و کاملا آگاه شدن به مسائل سیاسی و دینی ... ما نیاز به انقلاب داریم و رژیم بعدی هم اگر قرار باشه منابع ملی رو برای مردم استفاده نکنه بازهم انقلاب میکنیم .....\n\nبه لوپ بی نهایت خوش آمدید!",
				"added": 1576869582
			}
		],
		"1576177062_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 3,
				"body": "تاریخ اینترنت دیسنترلایز ایران تورو فراموش نمیکنه",
				"added": 1576286862
			}
		],
		"1576755597_1Eis3Dbj6Ygoh5kid89DGnXKiwpXxDenoU": [
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_5_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): all the iranians go fuck yourself\n\nwhy you didn't stop spamming here dude?",
				"added": 1576869832
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_8_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): because you've done the same on  Zer0Talk for days and you fellows didn't listennow you pay\n\nLOL\nThose days we haven't a specific forum to talk and post and forced to do that\nBTW\nI think your spams isn't harmful at all\nso help yourself",
				"added": 1576871323
			}
		]
	},
	"comment_vote": {}
}