{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1569605502,
			"title": "Thomas Cook collapse",
			"body": "And it's just the beginning. All major UK companies will collapse. Unemployment will skyrocket.",
			"added": 1569605501
		}
	],
	"topic_vote": {
		"1569227990_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 1,
				"body": "most black people are of low iq. many whites are also of low iq. all very-religious people are of low iq. communists and liberals also are of low iq. they all should be sterilized in order to save the future of mankind. blacks have to stay in africa where they belong.",
				"added": 1568654373
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 2,
				"body": "in your opinion?",
				"added": 1568654520
			}
		],
		"1568417535_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 3,
				"body": "we all are gonna die, sooner or later",
				"added": 1568654576
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 4,
				"body": "religion (when is extremism, fundamentalism) is a symptom of a genetic inherited mental deficiency. the inability to separate real from fiction in adult age. that's why hitler wanted to kill them all, not just the jews. of course, mental incapable people can't build civilization. they can only destroy civilization. atheism is a non theistic religion, so it's the same mental deficiency, it manifests in a different way. there is no difference between an atheist, a radical muslim, a fundamentalist christian, an orthodox jew.",
				"added": 1568713699
			},
			{
				"comment_id": 5,
				"body": "> [moodswing](#comment_4_1F8RgqojbeyvDmM4m2U1ALv6vvMSA4LsSF): You can have mass deception and slavery under liberal atheism too. It's not really an improvement in that regard. Christianity placed certain obstacles in front of progress, but so does atheism and liberalism, but in different ways. [...]\n\nyes. i agree. and that's why more than half world popuilation is genetically damaged.",
				"added": 1568713810
			}
		],
		"1568774393_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 6,
				"body": "the jews are no worse than the pentecostals/evangelicals. the niggers are our punishment for importing slaves from africa.",
				"added": 1568798979
			},
			{
				"comment_id": 7,
				"body": "> [toyata](#comment_105_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): But by law of natural selection and survival of the fittest mixing is strength, avoiding leads to mongoloid down syndrome like degeneration, as was common within the mediveal noble houses.\n\nby the law of bullshit false science...",
				"added": 1568823483
			}
		],
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": [
			{
				"comment_id": 8,
				"body": "mmmh... because he is?",
				"added": 1569605607
			},
			{
				"comment_id": 10,
				"body": "> [ratsmack](#comment_82_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): I'll agree to a point... Trump 10% Jew pawn... Hillary 100% Jew owned.\n\nwhat's with americans and the jews. are the jews really so powerful? they believe that a man crossed the sea on foot. they are obviously retarded. you give them too much credit.",
				"added": 1569687857
			},
			{
				"comment_id": 11,
				"body": "> [randomshits](#comment_178_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): I don't know anymore. Americans have a tendency to circumcise their children soon after birth without even a need to follow the Hebrew faith.\n\nCivilization is over",
				"added": 1569693638
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 9,
				"body": "if it was mainstream it would be called Google",
				"added": 1569605958
			}
		]
	},
	"comment_vote": {
		"11_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1
	}
}