{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1572969962_15nUU5yZG7DU7QXf7TT9BtK1gsZEB5uo3j": [
			{
				"comment_id": 1,
				"body": "> [aspidochelone](#comment_256_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): There's a cottage industry in \"racist symbols\".  So like somebody uses prison code to make \"heil hitler\" into \"hh\" then translates into \"88\", and suddenly the very letter \"88\" is a racist symbol.  The same, amusingly enough, is true for \"14\" for no other reason than some racists started saying \"14 words\".  I assume that if you take 88 + 14 = 102 it is probably also a racist symbol, so better be wary of that number.  (To think we USED to make fun of the Chinese for banning stuff with 6 and 9 in it!)  Also, don't forget that the \"OK symbol\" because some trolls on 4chan thought it would be funny to see if idiots would attack the symbol if they said it was racist AND THEY DID.  https://www.nbcnews.com/news/sports/cubs-fan-banned-wrigley-field-after-flashing-white-power-symbol-n1003681  Seriously, there are people with lupus whose autoimmune responses are better behaved than the U.S.  Hell, for that matter, nobody even remembers the Nazis stole the swastika and their \"Aryan\" name from brownish-colored folks in India who never went near Germany.  Back during the Second World War all the classic buildings in Chicago kept their swastika trim because they thought schoolyard bullying was restricted to the young - boy were they wrong!  Maybe ZeroNet should come up with a racist-hunter catechism that links EVERY SINGLE NATURAL NUMBER to racists.  Like 1 is racist because it's the Master Race by itself, 2 is racist because it's the number of words in heil hitler, 3 is racist because it's the number of slave ships Columbus first sailed to Hispaniola...\n\nProps to you for turning a shitpost on its head and providing an interesting and informative response!",
				"added": 1573116097
			}
		]
	},
	"comment_vote": {
		"256_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_1Nid4gCpVzB3m9XYXciHvTPUd7dYPXexD6": 1,
		"32_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"7_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"8_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": 1
	}
}