{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Como hago para mantener mi usuario en otra pc?",
			"body": "Es decir, instalo zeronet en otra pc e ingreso a zeroid.bit para usar este mismo nombre de usuario. ¿Se puede?",
			"added": 1527814332
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_1HdCZUfNgcjinB2LUKrajPcWDHigQzASKh": [
			{
				"comment_id": 1,
				"body": "Bueno",
				"added": 1527814129
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 2,
				"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1HCAwG8dMb946FEm9eu2LX1YkBxsJHyseJ/danniel@zeroid.bit",
				"added": 1527814191
			},
			{
				"comment_id": 3,
				"body": "a ver si activan",
				"added": 1527814198
			}
		],
		"1_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 4,
				"body": "creo que somos unos 10 jajaj.\nfuera de joda, comparto tu visión, me parece fascinante esta tecnologia, espero que crezca mucho",
				"added": 1527814483
			}
		],
		"1_1HCAwG8dMb946FEm9eu2LX1YkBxsJHyseJ": [
			{
				"comment_id": 5,
				"body": "> [jlxip](#comment_15_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): Es \"users.json\", está en la carpeta \"Data\" dentro del directorio donde hayas descomprimido ZeroNet.La idea sería respaldar ese archivo para guardar los certificados (identidades).Para restaurarlo, en una nueva instalación de ZeroNet, se abre para que se generen los archivos importantes, luego se cierra, y se reemplaza el archivo \"users.json\" por la copia de seguridad.Esto, aunque guardará las identidades (permitiendo publicar con el mismo ZeroID, así como modificar los mensajes ya existentes), hará que sea necesario volver a descargar todas las páginas, así que también recomiendo crear un archivo de texto con las direcciones de las páginas que más visitas para asegurarte de que no te falta ninguna, y así tener todo lo de antes en el feed.\n> También, como nota, es importante no tener dos instalaciones de ZeroNet con las mismas identidades, ya que el archivo \"users.json\" tiende a cambiar con regularidad, y si usas una instalación para una cosa, y otra para otra, los archivos serán distintos y te habrás metido en un barrizal.\n> Por último, para hacer la copia de seguridad, recomiendo modificar el archivo de inicio de ZeroNet, de tal forma que cada vez que cierres ZeroNet se suba una copia de seguridad a algún servidor (en mi caso, a una VPN), aunque también puedes copiarlo a un disco duro o algo.\n\nAhora si pude, tuve que copiar el contenido del json, la parte de certs, dentro del nuevo hash creado",
				"added": 1527886443
			}
		],
		"2_1HCAwG8dMb946FEm9eu2LX1YkBxsJHyseJ": []
	},
	"comment_vote": {
		"15_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1
	}
}