{
	"pages": [
		{
			"id": "0ba37fd0-b2e9-11ea-ad19-cfe5e14d6fdb",
			"body": "# Criticism of ZeroNet\n\nTo inform you that ZeroNet is not perfect, but a proof-of-concept.\n\n1. Lack of modularity, and collaboration, compared to IPFS. \n2. No DHT feature, only a workaround by tracker exchange, which is more centralized.\n3. Single point of failure, in multiple ways\n    - ZeroName system, relying on a single vps run by nofish, and the workarounds, like NameYo, are not sufficient.\n    - Development of Zeronet. Imagine nofish is hacked. In the field of blockchain, this problem has been solved.\n    - ZeroID. The whole zeronet relys on it heavily, other IDs are mostly non-unique. Non-unique IDs are very vulnerable to spamming.\n      As far I know, there's a bot written by a zeronet developer which is successful in registering a lot of zeroids. If he were willing to attack zeronet, he could easily flood it on any site using zeroid. Blacklist wouldn't work in this situation. \n4. Poor performance\n    - Using sqlite, which requires syncing the database each time you get/publish new data, and rebuilding it if your database was corrupted unluckily. The whole thing can be done gracefully like Orbit-db or GUN. \n    @ssdifnskdjfnsdjk\n    \n    I think that no skilled zeronet developers ever wanted to run zeronet proxy. If they try it on a single or dual CPU thread system and really host at least 20 sites including larger ones like Millchan and its optional files, then they would discover zeronet is useless, super slow, lagging. https://github.com/HelloZeroNet/ZeroNet/issues/2312\nI am running proxy for some time. Tried several Linux OS, py2, py3, maximize disk and other threads in /Config but the result is nearly unusable ZN instance - page loading from half a minute to several minutes.\n5. Data duplication\n    - You may think duplication makes it harder to detect pirating. This is ridiculous, as you lose efficiency on data transport and you get nothing on anonymity.\n6. Other weird designs\n    - Now in ZeroNet API, there's a RSA encryption item, but one day, a new encyption method called XYZ is invented, and nofish keeps adding new APIs. This is just an example, and this indicates why designing a good dweb framework is hard.\n\n@blurhy\n\nI think he has already realized that the project is outdated and stopped adding new features, but only maintains it.\nThe whole design of the project was not carefully thought over in the first place.\nIt is simply a rewrite of Freenet. If there had been IPFS, he would have started ZeroNet based on IPFS.\nIPFS is founded in 2015, and this requires a team, at least there're multiple tech leaders. It's too hard for someone to code the complete protocol stack alone, or he's genius.\nI wrote this wiki, for you who blindly believe ZeroNet is perfect, being lazy to explore anything other than ZeroNet.\n\nI couldn't even find a criticism page on this, so this page is fairy necessary.\n\n@mrchu\n\"I'm just the translator for some of these pages in Portuguese and I still don't know much about programming, but I already noticed that ZeroNet works a bit strange. Zeronet occupies a large a huge (REALLY HUGE) storage space on the computer just to download files to load websites (something like a cache). On the surfaceweb there is no such thing, websites are loaded instantly and without downloads of up to 300mb of page content. As a old user of this network, I have noticed what @blurhy said, the project is out of date and there was no significant updates for ZeroNet. actually, the closest of a significant change was the zeronet mobile.\"\n\n## Critism on search engines\n\nEach year, there're always some search engines being created for ZeroNet, and some are discontinued.\n\nWhat's the reason behind the phenomenon ?\n\nThe so-called 'search engines' are actually indexes, which require a single point, the owner, to maintain it continually.\nAs I point out above, there're some weird and careless designs, making it difficult to improve the performance.\n\n@blurhy\n\nI gave up Horizon search after realizing the fundamental flaws of Zeronet.\nProbably, other developers would also face the same problems and stop their projects.\n\n## Criticism on PoW proposal\n\n@blurhy\n\nPoW is not only a waste of energy, but also non-sense to FPGA. Spammers always have more power to win the energy wasting competition, just like how several laregest miners dominate bitcoin, causing it centralized.\n\nOne obvious example is, mobile phones can't afford PoW, so that it's centralized. PoW itself can centralize the network, without blockchain.\n\n",
			"date_added": 1592652458061,
			"slug": "criticism"
		},
		{
			"id": "0bcdb000-b2dc-11ea-9798-67dacace7796",
			"body": "![image](https://i.ibb.co/pxZQLpm/Pics-Art-06-20-06-52-44.png)\n\n# Kaffiene\n\nKaffiene is a [[search engine]] developed by [[Kaffie]] for [[ZeroNet]] [[zite|zites]]. It uses naive and [[regex]] queries to search through a plain-text index of sites along with hand-picked tags. The site freely shares its index and is [[cloneable]]. There are currently over 1185 sites listed in the index.\n\nIn [[April 23]], year of [[2017]], Kaffiene [has become open-source](/zeronews.bit/?Post:4:Kaffiene+is+now+open-source). \n\n\n\n## See also\n\n* [[ZeroSearch]]\n* [[Kidsearch]]\n* [[bwoi]]\n* [[Zearch]]\n\n\n## External links\n\n* [Official zite](/kaffiene.bit/) [📎](/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba)\n* [on 0list](/0list.bit/?Topic:2_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/Kaffiene+Search+Engine) [📎](/186THqMWuptrZxq1rxzpguAivK3Bs6z84o/?Topic:2_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/Kaffiene+Search+Engine)\n* [developer blog (Kaffie)](/kaffie.bit/) [📎](/1N6zp6jCXPBktNMPfe7UJBpQGyfCq7k2M8)",
			"date_added": 1592646874880,
			"slug": "kaffiene"
		},
		{
			"id": "a5019360-b2da-11ea-8e67-89b761f53cb7",
			"body": "Tor\n===\n\n![image](https://i.ibb.co/SymQMmz/Pics-Art-06-20-06-42-29.png)\n\nWhat is Tor?\n---\nTor is a service that helps you to protect your anonymity while using the Internet. Tor is comprised of two parts: software you can download that allows you to use the Internet anonymously, and the volunteer network of computers that makes it possible for that software to work.\n\nWho created the Tor network?\n---\nThe core principle of Tor, \"onion routing\", was developed in the mid-1990s by United States Naval Research Laboratory employees, mathematician Paul Syverson and computer scientists Michael Reed and David Goldschlag, with the purpose of protecting U.S. intelligence communications online.\n\nNowadays the software is maintained by the [Tor Project](https://torproject.org) and has stemmed into several child projects based on it, such as the TorBrowser (for desktop systems) , Orbot (for Android systems) and others.\n\nIs it illegal to use the Tor Browser?\n---\nUsing Tor to browse the Internet is not illegal. \nHiding your IP address and browsing history is not illegal in and of itself. \n\nHowever, don't forget that the concept of legality varies according to the laws of a given place. The above is true for the United States, and probably for most of Europe and South America as well, but might be different for your country.\n\nHow do you connect to the Web through the Tor network?\n---\nThe simplest way is using the Tor Browser Bundle which contains all the required tools. To install it, go to [www.torproject.org](https://www.torproject.org) and download the appropriate file for your operating system. (Check the PGP signature of the downloaded file to verify integrity). Run the downloaded file, choose an extraction location, then open the folder and click Start Tor Browser.  Depending on where you are, you may need use bridges such as obfs4 or meek-google.",
			"date_added": 1592646272918,
			"slug": "tor"
		},
		{
			"id": "38429fd0-b2d5-11ea-9127-85faf3f2363e",
			"body": "![image](https://i.ibb.co/58j3krW/Pics-Art-06-20-05-51-27.png)\n\n# Welcome to ZeroWiki\n\n[[ZeroWiki]] is a wiki platform that has been built for the [[ZeroNet]] network.  This wiki is a public, decentralized, and [[cloning|clonable]] site that can be used for taking notes, storing snippets, and sharing knowledge through the creation of [[FAQ]]s, Tutorials, and other documentations. \n\nYou can view the [[help|help page]] for a more in-depth view of how it works, or practice some of your [[zerowikiformat| formatting]] skills on the Wiki's [[sandbox]] page.\n\n- - -\n\n### Getting Started:\n- [[zeronet|What is ZeroNet?]]\n- [[zite|What is a \"Zite\"?]]\n- [[mute|Muting a user]] \n\n#### ZeroNet Websites (zites):\n- [[zearch| List of Search Engines]] \n- [[List of Zites]]\n\n#### Zeronet Information:\n- [[hubs|List of ZeroMe Hubs]]\n- [[proxies|List of proxies, allowing you to view ZeroNet from clearnet]]\n- [[blocklists|Zeronet Blocklists]] \n- [[zerome|What is ZeroMe?]]\n\n#### ZeroWiki Dev:\n- [[ZeroWiki:Format|ZeroWiki writing format]]\n- [[Dev ideas|Development ideas]]\n- [[args|A list of Zeronet.conf parameters & arguments]]\n- [[markdown|Markdown Formatting Syntax for ZeroWiki and ZeroTalk]]\n- [[sandbox|Sandbox, you can play with it before editing other pages]]\n\n#### Programming/Development:\n- [[devresources|List of resources for ZeroNet and Zite development]]\n- [[criticism|Criticism of ZeroNet]]\n\n#### Misc:\n- [[wallofshame|The Copyright Wall of Shame Community Edition]]\n- [[copytrollquotes|A Collection of Quotes by Copyright Trolls]]\n\n#### Useful wikis:\n - [New ZeroWiki](/1LX2wiouHctuUXtu5WkVM9TJJ3YoL6gAfm/) - Clone of ZeroWiki\n - [ZeroTuto, learning resources and tutorials related to ZeroNet](/1Jtjb5CU9aod4jtz8hF5NPPqFKofRSsb4x/)\n  \n*Please note that [[ZeroWiki]] is still beta software, it may have bugs and lack some features\n[[ZeroWiki:Issues|Propose features and report bugs here]].*  \n  \n\n---\n[日本語](/1Ezhw23VBpj1p9oZ5pf6z5HyBMVMR3Mgwm/)  [Deutsch](/1JJCiVtA6wY9Rmxq7JJS3EvKAFKpki3VKq)  |  [Français](/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/) |  [Español](/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ) |  [Italiano](/167Yc4dxV2ysL7CQYeyuXpobxBKkkZ7Rpj/) |  [Português](/1QJ8rDLmn4CE2VXpMotAi7bDryRmNLM7Rm/) |  [Polski](/1MeChXgGR3oZ26EPZS9dwbUyu1TacM2Y6T/) | العربية | فارسی | עברי  | [Русский](/1KKzUpPB2D533yKaiWA71GX44DUESsRhxU/) | [Українська](/1Ewfx8U1QvPs61QoKvoCdx775CLv1xbC7/) | Esperanto",
			"date_added": 1592643942990,
			"slug": "home"
		},
		{
			"id": "d305d5c0-b2d3-11ea-8430-c1ae1e0b0c81",
			"body": "![image](https://i.ibb.co/58j3krW/Pics-Art-06-20-05-51-27.png)\n\n# Welcome to ZeroWiki\n\n[[ZeroWiki]] is a wiki platform that has been built for the [[ZeroNet]] network.  This wiki is a public, decentralized, and [[cloning|clonable]] site that can be used for taking notes, storing snippets, and sharing knowledge through the creation of [[FAQ]]s, Tutorials, and other documentations. \n\nYou can view the [[help|help page]] for a more in-depth view of how it works, or practice some of your [[zerowikiformat| formatting]] skills on the Wiki's [[sandbox]] page.\n\n### Getting Started:\n- [[zeronet|What is ZeroNet?]]\n- [[zite|What is a \"Zite\"?]]\n- [[mute|Muting a user]] \n\n#### ZeroNet Websites (zites):\n- [[zearch| List of Search Engines]] \n- [[List of Zites]]\n\n#### Zeronet Information:\n- [[hubs|List of ZeroMe Hubs]]\n- [[proxies|List of proxies, allowing you to view ZeroNet from clearnet]]\n- [[blocklists|Zeronet Blocklists]] \n- [[zerome|What is ZeroMe?]]\n\n#### ZeroWiki Dev:\n- [[ZeroWiki:Format|ZeroWiki writing format]]\n- [[Dev ideas|Development ideas]]\n- [[args|A list of Zeronet.conf parameters & arguments]]\n- [[markdown|Markdown Formatting Syntax for ZeroWiki and ZeroTalk]]\n- [[sandbox|Sandbox, you can play with it before editing other pages]]\n\n#### Programming/Development:\n- [[devresources|List of resources for ZeroNet and Zite development]]\n- [[criticism|Criticism of ZeroNet]]\n\n#### Misc:\n- [[wallofshame|The Copyright Wall of Shame Community Edition]]\n- [[copytrollquotes|A Collection of Quotes by Copyright Trolls]]\n\n#### Useful wikis:\n - [New ZeroWiki](/1LX2wiouHctuUXtu5WkVM9TJJ3YoL6gAfm/) - Clone of ZeroWiki\n - [ZeroTuto, learning resources and tutorials related to ZeroNet](/1Jtjb5CU9aod4jtz8hF5NPPqFKofRSsb4x/)\n  \n*Please note that [[ZeroWiki]] is still beta software, it may have bugs and lack some features\n[[ZeroWiki:Issues|Propose features and report bugs here]].*  \n  \n\n---\n[日本語](/1Ezhw23VBpj1p9oZ5pf6z5HyBMVMR3Mgwm/)  [Deutsch](/1JJCiVtA6wY9Rmxq7JJS3EvKAFKpki3VKq)  |  [Français](/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/) |  [Español](/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ) |  [Italiano](/167Yc4dxV2ysL7CQYeyuXpobxBKkkZ7Rpj/) |  [Português](/1QJ8rDLmn4CE2VXpMotAi7bDryRmNLM7Rm/) |  [Polski](/1MeChXgGR3oZ26EPZS9dwbUyu1TacM2Y6T/) | العربية | فارسی | עברי  | [Русский](/1KKzUpPB2D533yKaiWA71GX44DUESsRhxU/) | [Українська](/1Ewfx8U1QvPs61QoKvoCdx775CLv1xbC7/) | Esperanto",
			"date_added": 1592643343644,
			"slug": "home"
		}
	]
}