{
	"post": [
		{
			"name": "No name",
			"body": "> ZeroID won't help website owners get rid of spam, because ZeroID can't revoke a certificate or block users in any way if they got a certificate from ZeroID.\n\nCan you revoke a nanasi certificate remotely if you are not the owner? To me that doesn't sound like a positive thing. It sounds like a way to censor people.",
			"time": 1468854615512,
			"hash": "bbf9tXu3xY7Jbh9RwgdDolx+4uw+wgfhxFSBjqKoUus="
		},
		{
			"name": "No name",
			"body": "I wouldn't think you could to be fair. It is local to the users computer and only they can remove it.\n\nAlso, what is the difference between Zero and ZeroVerse ID's? I'm not really understanding.",
			"time": 1468856568986,
			"hash": "2Qlm+NnEkLqXoVxqYl+rxGfjZsudHuNIqum3Uvygpok="
		},
		{
			"name": "No name",
			"body": ">>56c4Fg+Y\n\nI hope you made up those keys or else they are now public. Lets try to forget that though.\n\nSo ZeroID is centralized, is ZeroVerse? Is it an improved ZeroID or just a (kinda) mirror so that ZeroID isn't the only option and is so slightly more decentralized.",
			"time": 1468858332159,
			"hash": "q2nTZiN4vb9bwS2Ej5RNmVNwjJhJWmeSnrA1wa9CrYo="
		},
		{
			"name": "No name",
			"body": ">>MZSVXLGn\n\nOkay. So I am really not understanding why ZeroID works the way it does, especially with nanasi providing proof of concept.",
			"time": 1468863208883,
			"hash": "/7CFU8RnRjLiOUZ8iMQzDR2HP+zs2I8QpICOquc3Hr8="
		},
		{
			"name": "No name",
			"body": ">>MZSVXLGn\nEssentially what are the negatives of a nanasi-like system over the current ZeroID system.",
			"time": 1468863284527,
			"hash": "6u2X0X9HKeXrn/9QiOBAS5DrCtK3x5QR8XrfdK9WZ0A="
		},
		{
			"name": "No name",
			"body": ">>pB9UdZlN\n\nPersonally I would see removing a rate limit as a benefit. It is not as though we are (realistically) going to run out of account name, and if we do, just add an extra character to the account name and we have a bunch more.\n\nTherefore there are no reasons against a decentralized ID system other than that @nofish wants to maintain (a certain amount of) control over the service.\n\nZeroID's are optional and not why I came to ZeroNet and whilst they remain centralized I will just ignore and not use them.",
			"time": 1468863971275,
			"hash": "WbTGIJwEEOQhORqeMUS1TtRA0nnjiPLdDlCrxg6NqHs="
		},
		{
			"name": "No name",
			"body": ">>SsjY3NkS\n\nPlease create this. Seriously, create this.\n\nI did some math\n\nAssuming 100 trillion account creations per second (a number far beyond any reality, at least until quantum computing) and that usernames only accepted lowercase letters and numbers, and that each user name was 16 characters long, it would take...\n\n(36^16)÷100000000000÷60÷60÷24÷365.2425 years\n\nwhich is equal to\n\n2521999.307774211 years\n\nto exhaust all names. It wouldn't rely upon any server and so would be sustainable. Why is this not the default system for ID's?\n",
			"time": 1468864587154,
			"hash": "xK5eJ7ofM8skI49jNod8A/KiY1j8Qqs1psA3O+QrBEU="
		},
		{
			"name": "No name",
			"body": ">>FqvHKj7q\n\nYes but you can use Tor to create a whole bunch of accounts with the centralized system and still spam a site, its no different. Yes its an issue, but not one which the centralized system doesn't ultimately share.",
			"time": 1468866419055,
			"hash": "N4JkuCHein4wo1asLnNzNrDeoNfAtem8vmPfUkrdobw="
		},
		{
			"name": "No name",
			"body": "You can, just move users.json out of your data folder and then you can make another account. Or, copy and delete just the nanasi account from the users.json file.",
			"time": 1468907434656,
			"hash": "YFz6qN7hLl3T7NPZ24jutX7wqrGLRrUT/RgGhDjY7h4="
		},
		{
			"name": "No name",
			"body": "Calm down. I think we got the point, you can make 3D text, cool. I'm sure its nothing a search engine couldn't have solved but thanks, now please shut up!",
			"time": 1469026428699,
			"hash": "RiQLJ0teh5Z4NUrP0UkyA8PY3LOLJWVHmh0eNYDSMVs="
		}
	]
}