{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky": 1,
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": 1,
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"3_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": 1,
		"2_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": 1,
		"1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"2_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1
	},
	"next_comment_id": 13,
	"comment": {
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 1,
				"body": "> [redfish](#comment_7_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): Кому нужен архив трэкера, например, а кому нужен живой трэкер?\n\nА в чём проблема с трекером? Всё так же, как и с сайтом, на котором мы находимся прямо сейчас, как и с ZeroMe, 0chan и многими другими. Один раз накодил и запостил сайт - всё, пользователи могут до бесконечности постить туда новые треды, посты, загружать картинки, фильмы, торренты, и так далее.",
				"added": 1505079327
			},
			{
				"comment_id": 5,
				"body": "Необходимость борьбы со спамом не значит что надо вводить какую-то жесткую централизованную цензуру или модерацию. По-моему, в большинстве случаев достаточно кнопки \"перестать принимать, распространять,  и рендерить информацию от пользователя запостившего это\". Тем более что в зеронете любой контент подписан его автором.",
				"added": 1505409835
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_172_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): создание новых пользователей ничего не стоит и их можно делать по новому для каждого сообщения.\n\nВ случае с zeroid оно осуществляется через внешний сервис с необходимостью proof-of-work. По-моему иметь внешние сервисы с защитой в таком духе для identity провайдеров - это самое простое решение. Дёшево и сердито. Если какой-то из таких сервисов упал можно развернуть новый и одной строчкой разрешить его на сайте. В идеале, конечно, полная децентрализация, можно делать network-of-trust с коллективной кармой пользователей и сокрытием/баном после достижения каких-то распределённых показателей, но это сложно.",
				"added": 1505411926
			},
			{
				"comment_id": 7,
				"body": "https://github.com/HelloZeroNet/ZeroID/issues/3#issuecomment-195774924",
				"added": 1505412000
			},
			{
				"comment_id": 8,
				"body": "> [balancer73](#comment_173_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): это очевидное решение\n\nЭто механизм коллективного и распределяемого консесуса о бане. То есть решение что пора перестать принимать/передавать трафик от человека в такой схеме распространияется по сети всем участникам и они все его автоматически банят вместо того чтобы банить спамеров индивидуально каждый у себя вручную. Но это никак не поможет с возможностью автоматической регистрации новых identity. По ссылке упоминается proof-of-burn - необходимость для регистрации сжигать биткоины. Вот это дельно.",
				"added": 1505413080
			}
		],
		"3_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 2,
				"body": "Ку-ку ёпта",
				"added": 1505260279
			},
			{
				"comment_id": 12,
				"body": "Почему так мало людей на нульче, может никто не знает? http://127.0.0.1:43110/0chan.bit/",
				"added": 1505820175
			}
		],
		"2_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 3,
				"body": "Впервые слышу. Вообще, для \"p2p encrypted messaging\" постоянно tox советуют.",
				"added": 1505260430
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 4,
				"body": "Вжух",
				"added": 1505260638
			}
		],
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 11,
				"body": "Еби всех наркохерок подряд, живи на вписонах в притонах, ставь хмурый по вене, ебашь фен регулярно без отходов. Имхо это самый осмысленный и приятный способ саморазрушения, а если ещё и не сдохнешь так вообще шикардос.",
				"added": 1505738871
			}
		]
	},
	"comment_vote": {
		"107_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"29_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD": 1,
		"175_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"24_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": 1,
		"38_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": 1,
		"36_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD": 1
	}
}