{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [jayofthezero](#comment_1_16nArdxrSaNThNp83kL8E6NLL9WD98iUne): Dove into the \"Wendy's\" tag on Pixiv. I do not regret my action.\n\nI haven't really checked out Pixiv, generally, but probably will after finding out how much of the Wendy's stuff was on there.\n\nAlso, looks like you were able to make it to the site after all, which is great. Thanks for reading and thanks for the heads up about using a proxy to boost peers. I'll probably do that once I get zeronet running on another machine laying around.",
			"post_id": 2,
			"date_added": 1495172113
		},
		{
			"comment_id": 2,
			"body": "Yeah, that is one of the shortcomings of the thing being centered around people all with the same occupation. It's not something I struggle with too much anymore, but I'm also pretty familiar with the work now. Takes some getting used to, for sure.",
			"post_id": 3,
			"date_added": 1495398665
		},
		{
			"comment_id": 3,
			"body": "> [jayofthezero](#comment_4_16nArdxrSaNThNp83kL8E6NLL9WD98iUne): My problem is that I'm really bad at finding hentai I like. The premise could be good, and the art interesting, but all it takes is for one thing to turn me off and the product is basically ruined for me. Which makes it hard for me to spend my money on purchasing something that can't be returned, or isn't a service which I can always move onto a different product if one of them doesn't suit me. If Fakku was a Netflix for hentai, I'd be more likely to pay.\n\nFAKKU actually does have a subscription service, though I'm not really sure exactly what their subscription content contains. At thirteen bucks a month, it isn't something I would subscribe to for more than a month or two, but for avid readers it's probably not a bad deal. I prefer physical copies of books and magazines, if possible, which is why I have bought what most interested me directly.\n\nI do like the idea of a hentai focused Netflix, though. I would be a lot more likely to use that for OVAs and movies rather than manga.",
			"post_id": 5,
			"date_added": 1496851269
		},
		{
			"comment_id": 4,
			"body": "> [jayofthezero](#comment_5_16nArdxrSaNThNp83kL8E6NLL9WD98iUne): Ouch, $13 is a bit high for the amount of hentai I read. And it seems like the selection is a bit limited.\n> I've given up on physical mostly because I just don't have space to put things, and I'm anticipating having to move in the near future. So I mostly buy things that I know are DRM free or I can rip the DRM off of, since if I'm paying to own it I better own it, not license it. Subscription services I'm okay with not owning things since I'm basically paying a monthly admission to walk into somebody else' library and borrow whatever I want.\n\nYep, I definitely agree. I don't go for physical versions of movies or tv anymore but still really enjoy physical books and games. I wish I could be more minimalist as stuff like moving is a huge ordeal when you have a bunch of crap...\n\nI and wholeheartedly agree on DRM. I'm trying my best to use GOG to buy PC games, or get them directly from the devs if possible in order to rely less and less on Steam. The amount of control companies have over how you experience stuff you paid for drives me crazy. Subscription services mostly get a pass from me because they do all the heavy lifting with regard to hosting the content and providing the delivery method. If they do that well and have stuff I am interested in for a reasonable price, I don't mind paying up. I still like to cut out the middle man with regard to contributing to creators, though, whenever possible.",
			"post_id": 5,
			"date_added": 1496863202
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}