{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1HAkWtoENzu446QLtTYyhBq2QvKi8CoxHq": 1,
		"1_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": 1
	},
	"next_comment_id": 8,
	"comment": {
		"3_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 1,
				"body": "Il est protégé par le système parce qu'il est juif, riche et célèbre. En gros, il est intouchable.",
				"added": 1588836244
			}
		],
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": [
			{
				"comment_id": 2,
				"body": "> [anshorei](#comment_2_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): je ne suis pas vraiment francophone, mais je lurk ici de temps en temps\n> \nTu rôdes (lurk) ici :-)",
				"added": 1588837336
			}
		],
		"5_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 3,
				"body": "> [raojer](#comment_1_1MqxdXR2WSoFYBH6MtbWmA4E1wnJrXt6EH): On est d'accord. C'est devenu compliqué de trouver des choses nouvelles sur internet.Si quelqu'un connait des bonnes adresses à partager...\n\nAether\nflote.app  \npoal.co\nbitchute\nbitwave.tv\netc.",
				"added": 1612685712
			}
		],
		"1_1HAkWtoENzu446QLtTYyhBq2QvKi8CoxHq": [
			{
				"comment_id": 4,
				"body": "C'est un complot bien préparé.",
				"added": 1612685805
			}
		],
		"1_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": [
			{
				"comment_id": 5,
				"body": "La résistance existe dans le coeur des gens, elle peut être silencieuse / invisible.\nLa résistance passe par les choix qu'on fait au quotidien mais pas seulement.\nExemples : n'achète aucun produit d'Amazon, Apple, Facebook, Microsoft, etc. \nAnnule ton abonnement à Netflix ou autre propagande déguisée sous forme de divertissement. Refuse de lire, d'écouter ou visionner la propagande idéologique qui te pose problème.\n\nLa résistance existe aussi dans les manifestations, va dans les manifs et parle aux gens, tu verras qu'ils sont organisés. Pourquoi tu crois que Facebook et Youtube sont super contrôlés et censurés ? Les gens utilisaient ces médias sociaux pour s'organiser et communiquer leur idées politiquement incorrectes ou leur rebellion contre le système.\n\nRemet en question tout ce qui vient du gouvernement, à commencer par ton éducation. ",
				"added": 1612686554
			}
		],
		"3_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": [
			{
				"comment_id": 6,
				"body": "> [nopharma](#comment_6_1HAkWtoENzu446QLtTYyhBq2QvKi8CoxHq): En même temps, sur des vrais réseaux sociaux, il ne peut qu'y avoir des gens de gauche, puisqu'ils ont un grand côté social\n\nc'est faux",
				"added": 1612686629
			},
			{
				"comment_id": 7,
				"body": "> [mrjack](#comment_2_1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH): Je me suis déjà fait censuré sur une instance Mastodon (miaou.drycat.fr) alors que je n'ai écrit aucune insulte ni de termes péjoratifs. Quand tu vois tous les gauchos qui traînent sur ce réseau, tu comprends mieux la situation. Ils ne supportent pas la critique...\n\nEssaye Poal.co  ou Flote.app  ou Aether pour éviter la censure.",
				"added": 1612686689
			}
		]
	},
	"comment_vote": {
		"7_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": 1,
		"5_1A31a72fpaL91LqW6h3EjNB4PLM9iHjiit": 1,
		"3_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4": 1,
		"19_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": 1
	}
}