{
    "article": [
        {
            "title": "Reactions to the Tiananmen Square protests of 1989",
            "text": "{{Use dmy dates|date=February 2012}}\nThe [[events at Tiananmen]] were the second  of their type shown in detail on Western television.<ref name=strahan>Strahan, A. ''Australia's China: Changing Perceptions from the 1930s to the 1990s.'' Cambridge University Press, 1996. p.302. {{ISBN|978-0-521-48497-8}}.</ref> The Chinese government's response was denounced, particularly by Western governments and media.<ref name=sd>[http://www.gwu.edu/~nsarchiv/NSAEBB/NSAEBB16/documents/36-04.htm \"China: Aftermath of the Crisis\"] State Department Bureau of Intelligence and Research, (27 July 1989)</ref> Criticism came from both [[Western Europe|Western]] and Eastern Europe, North America, Australia and some east Asian and Latin American countries. Notably, many Asian countries remained silent throughout the protests; the government of India responded to the massacre by ordering the state television to pare down the coverage to the barest minimum, so as not to jeopardize a thawing in relations with China, and to offer political empathy for the events.<ref name=Indexpress>[http://www.indianexpress.com/news/places-20-years-apart/470938/0 Places 20 years apart – column by C. Raja Mohan], ''Indian Express'', 4 June 2009</ref> North Korea, Cuba, [[Czechoslovakia]], and [[East Germany]], among others, supported the Chinese government and denounced the protests.<ref name=sd/> Overseas Chinese students demonstrated in many cities in Europe, America, the Middle East, and Asia against the Chinese government.<ref name=sc>[https://news.google.com/newspapers?id=o7cSAAAAIBAJ&sjid=6vkDAAAAIBAJ&pg=4308,858040&dq Troubles in China provoke protests], Spokane Chronicle, 7 June 1989, page A8</ref>\n\n== National reaction ==\nSome Chinese citizens deplored the incident at Tiananmen Square, and believed that the massacre of peaceful protesters was deplorable, and was done with such brutal force as to not inspire any further protests by citizens. The Chinese government blocks all website based searches in China with any regard to the massacre at Tiananmen Square.<ref>Straub, G. (2001). ''Rhythm of Compassion''. Tuttle Publishing. p. 111. {{ISBN|978-1582900582}}.</ref>\n\nHowever, the period of relative political stability, order and economic growth that resulted after the crackdown from 1990 till 2012 saw steadily rising Chinese standards of living, with over 663 million (according to the World Bank) Chinese citizens lifted out of poverty.<ref>{{cite web|url=http://www.imf.org/external/pubs/ft/weo/2012/02/weodata/weorept.aspx?sy=2010&ey=2017&scsm=1&ssd=1&sort=country&ds=.&br=1&pr1.x=51&pr1.y=6&c=512%2C446%2C914%2C666%2C612%2C668%2C614%2C672%2C311%2C946%2C213%2C137%2C911%2C962%2C193%2C674%2C122%2C676%2C912%2C548%2C313%2C556%2C419%2C678%2C513%2C181%2C316%2C682%2C913%2C684%2C124%2C273%2C339%2C921%2C638%2C948%2C514%2C943%2C218%2C686%2C963%2C688%2C616%2C518%2C223%2C728%2C516%2C558%2C918%2C138%2C748%2C196%2C618%2C278%2C522%2C692%2C622%2C694%2C156%2C142%2C624%2C449%2C626%2C564%2C628%2C283%2C228%2C853%2C924%2C288%2C233%2C293%2C632%2C566%2C636%2C964%2C634%2C182%2C238%2C453%2C662%2C968%2C960%2C922%2C423%2C714%2C935%2C862%2C128%2C135%2C611%2C716%2C321%2C456%2C243%2C722%2C248%2C942%2C469%2C718%2C253%2C724%2C642%2C576%2C643%2C936%2C939%2C961%2C644%2C813%2C819%2C199%2C172%2C733%2C132%2C184%2C646%2C524%2C648%2C361%2C915%2C362%2C134%2C364%2C652%2C732%2C174%2C366%2C328%2C734%2C258%2C144%2C656%2C146%2C654%2C463%2C336%2C528%2C263%2C923%2C268%2C738%2C532%2C578%2C944%2C537%2C176%2C742%2C534%2C866%2C536%2C369%2C429%2C744%2C433%2C186%2C178%2C925%2C436%2C869%2C136%2C746%2C343%2C926%2C158%2C466%2C439%2C112%2C916%2C111%2C664%2C298%2C826%2C927%2C542%2C846%2C967%2C299%2C443%2C582%2C917%2C474%2C544%2C754%2C941%2C698&s=NGDPD&grp=0&a= |title=Report for Selected Countries and Subjects |publisher=Imf.org |date=2006-09-14 |accessdate=2013-05-30}}</ref> Trust and legitimacy of the Chinese government also remained high and increased from 83% in 2007 to 87% in 2010 according to the 2010 Pew Research Center Study.<ref>{{cite web|url=http://www.pewglobal.org/2011/03/31/upbeat-chinese-public-may-not-be-primed-for-a-jasmine-revolution/ |title=Upbeat Chinese Public May Not Be Primed for a Jasmine Revolution &#124; Pew Global Attitudes Project |publisher=Pewglobal.org |date=2011-03-31 |accessdate=2013-05-30}}</ref> It also found that the Chinese people were satisfied (87%) with their Government and feel that their country is moving in the right direction (74%).\n\n==Organizations==\n'''{{flagu|UN}}:''' Secretary-General [[Javier Perez de Cuellar]] was concerned at the incident, adding that the government should uphold the utmost restraint, but also noted that the [[UN Charter]] prohibits interference in member states' internal affairs (especially member states with a [[UN Security Council|Security Council]] veto).<ref>\"Bush halts arms sales to China.\" ''Chicago Tribune'', 6 June 1989.</ref>\n\nFrom 7 August to 1 September 1989 the [[Sub-Commission on Prevention of Discrimination and Protection of Minorities]] (a part of the [[Commission on Human Rights]]) met in Geneva for its thirty-seventh meeting. This meeting was the first time since the killings in June \"that a human rights meeting ha[d] begun discussing the subject.\"<ref>[https://select.nytimes.com/gst/abstract.html?res=FA0712FD3E5E0C748DDDA10894D1484D81 \"U.N. Panel Is Asked to Condemn China\"], ''The New York Times'', 17 August 1989. (accessed 26 November 2010).</ref> At the meeting resolution 1989/5 was adopted by secret ballot on 31 August 1989. The resolution, also called \"Situation in China\" states the Committee was concerned about what had occurred in China and the implications the crackdown would have on the future of human rights.<ref name=\"UN1\">[http://daccess-dds-ny.un.org/doc/UNDOC/GEN/G89/137/73/PDF/G8913773.pdf?OpenElement Commission on Human Rights, \"Report of the Sub-Commission on Prevention of Discrimination and Protection of Minorities on its Forty-First Session\"], E/CN.4/1990/2, page 34, resolution 1989/5.</ref> The resolution has two points:\n\n# Requests the Secretary-General to transmit to the Commission on Human Rights information provided by the Government of China and by other reliable sources;\n# Makes an appeal for clemency, in particular in favour of persons deprived of their liberty as a result of the above-mentioned events.<ref name=\"UN1\"/>\n\nOn 1 December 1989 the permanent representative of People's Republic of China (PRC) to the United Nations Ambassador Li Luye replied to the Sub-Commission's adoption of resolution 1989/5 by stating that it was \"a brutal interference in China's internal affairs.\"<ref name=\"UN2\">[http://documents-dds-ny.un.org/doc/UNDOC/GEN/G90/103/03/pdf/G9010303.pdf?OpenElement Commission on Human Rights, \"Question of the Violation of Human Rights and Fundamental Freedoms in any part of the World, with particular reference to Colonial and other Dependent Countries and Territories\"], E/CN.4/1990/52, page 2, paragraph 3; page 32–33, paragraph 65; page 33, paragraph 66.</ref> Li also stated that the \"Spokesman of the Foreign Ministry of the People's Republic of China issued a statement on 2 September 1989, solemnly declaring the firm objection of the Chinese Government to the resolution and deeming it to be illegal and null and void.\"<ref name=\"UN2\"/>\n\nAt the forty-sixth session of the Commission on Human Rights in January 1990 Li distributed a letter as a document for the meeting. In the letter Li reaffirms the position of the Chinese Government toward the resolution and that \"actions to put an end to the turmoil and quell the rebellion were justified and legitimate.\"<ref name=\"UN3\">[http://documents-dds-ny.un.org/doc/UNDOC/GEN/G90/102/50/pdf/G9010250.pdf?OpenElement Commission on Human Rights, Letter from Ambassador Li Luye], E/CN.4/1990/55, page 3–4.</ref> He also states that the punishment of \"criminals\" who have \"violated the criminal law\" is justified and that a small number of Western nations are using the United Nations to interfere internal affairs, which is a clear and complete violation of the UN Charter and international relations.<ref name=\"UN3\"/>\n\nThe forty-sixth session found the Chinese claim of interference in internal affairs indefensible and that \"massive violation\" of human rights concerned of the international community.<ref name=\"UN2\"/> It also stated that China had accepted voluntarily the obligations of upholding the human rights of its citizens.<ref name=\"UN2\"/> When accepted into the United Nations in 1971, China was \"bound by established human rights standards which are part of the customary law or which have been accepted by the international community.\"<ref name=\"UN2\"/>\n\n{{flagicon|Europe}} The '''[[European Economic Community]]''' condemned the government response and cancelled all high level contacts and loans. They planned a resolution at the [[UNHCR]] criticising China's human rights record.<ref>Youngs, R. ''The European Union and the Promotion of Democracy.'' Oxford University Press, 2002. {{ISBN|978-0-19-924979-4}}.</ref><ref>''Los Angeles Times'', 19 June 1989.</ref> The EU maintains an [[European Union – People's Republic of China relations#Arms embargo|arms embargo]] against China to this day.\n\n== Countries ==\n[[File:Tiananmen-Wroclaw-plDominikanski.jpg|thumb|right|A memorial in the Polish city of [[Wrocław]] depicting a destroyed bicycle and a tank track is a symbol of the Tiananmen Square protests]]\n'''{{Flagu|Australia}}:''' The Prime Minister, [[Bob Hawke]], wept at a memorial service in the Great Hall in Parliament. The [[Australian government]] granted Chinese students a four-year asylum to stay in Australia.<ref name=strahan/><br>\n'''{{flagu|Burma|1974}}:''' The government supported the actions of the Chinese government, while opposition leader [[Aung San Suu Kyi]] condemned them, saying: \"We deplore it. It [[8888 Uprising|happened in Burma]] and we wanted the world to stand by Burma, so we stand by the Chinese students.\"<ref name=nyt>[https://query.nytimes.com/gst/fullpage.html?res=950DE4DE153CF93BA35755C0A96F948260 Turmoil in China; Asian Diplomats Express Concern], New York Times, 8 June 1989.</ref><br />\n'''{{Flagu|Canada}}:''' The External Affairs Minister [[Joe Clark]] described the incident as \"inexcusable\" and issued a statement: \"We can only express horror and outrage at the senseless violence and tragic loss of life resulting from the indiscriminate and brutal use of force against students and civilians of Peking.\"<ref name=nst>[https://news.google.com/newspapers?id=vrUTAAAAIBAJ&sjid=NpADAAAAIBAJ&pg=6544,1211131&dq World leaders outraged at army action], ''[[The New Straits Times]]'', 6 June 1989</ref>  In [[Vancouver]], [[Vancouver's Reaction to the 1989 Tiananmen Square Massacre|varying reactions to the military action]] led to friction in the city's Chinese community.<br />\n'''{{flagu|Czechoslovakia}}:''' The [[government of Czechoslovakia]] supported the Chinese government's response, expressing the idea that China would overcome its problems and further develop socialism. In response, the Chinese side \"highly valued the understanding shown by the [[Czechoslovak Communist Party]] and people\" for suppressing the \"anti-socialist\" riots in Beijing.<ref>{{cite book|last=Columbus|first=Frank H.|title=Central and Eastern Europe in transition, Volume 1|publisher=Nova Publishers|year=1998|page=23|isbn=978-1-56072-596-1}}</ref><br />\n'''{{Flagu|France}}:''' The French Foreign Minister, [[Roland Dumas]], said he was \"dismayed by the bloody repression\" of \"an unarmed crowd of demonstrators.\"<ref name=nyt1>[https://query.nytimes.com/gst/fullpage.html?res=950DE2D6143FF936A35755C0A96F948260&sec=&spon= The West Condemns the Crackdown], New York Times, 5 June 1989.</ref><br />\n'''{{flagu|East Germany}}:''' The government of the [[German Democratic Republic]] approved of the military action. On 8 June the [[People's Chamber|Volkskammer]] unanimously passed a resolution in support of the Chinese government's use of force. High-ranking politicians from the ruling [[Socialist Unity Party of Germany|SED]] party, including [[Hans Modrow]], [[Günter Schabowski]] and [[Egon Krenz]], were in China shortly afterward on a goodwill visit. In contrast, members of the general population, including ordinary SED party members, participated in protests against the actions of the Chinese government.<ref>{{Cite news| last = Hansen | first = Sven  | title = Der Sargnagel aus Fernost  | newspaper=Taz.de   | date = 2 June 2009  | url = http://www.taz.de/1/politik/deutschland/artikel/1/der-sargnagel-aus-fernost/| accessdate =20 May 2010| postscript = <!--None-->}}\n</ref><br />\n'''{{flagu|West Germany}}:''' The West German Foreign Ministry urged China \"to return to its universally welcomed policies of reform and openness.\"<ref name=nyt1/><br />\n'''{{flagu|Holy See}}:''' The Holy See of Vatican City has no official diplomatic relations with China, but Pope [[John Paul II]] expressed hope that the events in China would bring change.<ref name=nyt1/><br />\n'''{{flagu|Hong Kong|1959}}:''' The military action severely affected perceptions of the mainland. 200,000 people protested against the Chinese government's response, with the latter considering the protests as \"subversive\". The people of Hong Kong hoped that the chaos on the mainland would destabilize the Beijing Government and thus avert its reunification with the rest of mainland China. The [[Sino-British Joint Declaration]] was also called into question.<ref>Mansfield, Y. & Pizam, A. Tourism and safety in the PRC. ''Tourism, Security and Safety: From Theory to Practice.'' 2006. p. 197. {{ISBN|978-0-7506-7898-8}}.</ref><ref>Yahuda, M. B. ''Hong Kong: China's Challenge.'' Routledge, 1996. {{ISBN|978-0-415-14071-3}}.</ref> Demonstrations continued for several days, and wreaths were placed outside the [[Xinhua News Agency]] office in the city.<ref name=sc/> This further fueled the [[Waves of mass migrations from Hong Kong|mass migration wave of Hong Kong people]] out of Hong Kong.<br />\n'''{{Flagu|Hungary}}:''' The [[Hungarian government]], which was undergoing political reform, reacted strongly to the incident. The Foreign Minister described the events as a \"horrible tragedy\", and the government expressed \"shock\", adding that \"fundamental human rights could not be exclusively confined to the internal affairs of any country.\" Demonstrations were held outside the Chinese embassy. Hungary was the only country in Europe to have substantially reduced relations with China in the aftermath of the events.<ref name=columbus>Columbus, F. A. ''Central and Eastern Europe in Transition.'' Nova Publishers, 1998. p. 22-23. {{ISBN|978-1-56072-596-1}}.</ref><br />\n'''{{Flagu|India}}:''' The [[government of India]] responded by ordering the state television to pare down the coverage to the barest minimum. The government’s monopoly over television two decades ago helped Prime Minister [[Rajiv Gandhi]] signal to Beijing that India would not revel in China’s domestic troubles and offer some political empathy instead.<ref>[http://www.indianexpress.com/news/places-20-years-apart/470938/0 Places 20 years apart], ''[[The New Indian Express]]'', 4 June 2009</ref><br />\n'''{{Flagu|Italy}}:''' The [[Italian Communist Party]] leader [[Achille Occhetto]] condemned the \"unspeakable slaughter in progress in China\".<ref name=rg>[https://news.google.com/newspapers?id=wmsVAAAAIBAJ&sjid=m-EDAAAAIBAJ&pg=6742,1267678&dq World condemns Tiananmen bloodshed], The Register Guard, 5 June 1989, page 5A</ref><br />\n'''{{Flagu|Japan}}:''' The [[Japanese government]] called the response \"intolerable\" and froze loans to China. Japan was also the first member of the [[G7]] to restore high level relations with China in the following months.<ref>Klien, S. ''Rethinking Japan's Identity and International Role: An Intercultural Perspective.'' Routledge, 2002. p. 89. {{ISBN|978-0-415-93438-1}}.</ref><ref>China rips US for halting arms flow, aiding dissident, Chicago Sun Times, 8 June 1989.</ref><br />\n'''{{Flagu|Kuwait}}:''' Kuwait voiced understanding of the measures taken by the Chinese authorities to protect social stability.<ref>Huwaidin, M. B. ''China's Relations with Arabia and the Gulf, 1949–1999.'' Routledge, 2002. p. 196. {{ISBN|978-0-7007-1730-9}}.</ref><br />\n'''{{flagicon|Portugal}} [[Macau]]:''' 150,000 protested in Macau.<ref>Bruning, Harald (11 Jun. 1999) [http://www.thestandard.com.hk/news_detail.asp?pp_cat=&art_id=30611&sid=&con_type=1&d_str=19990611&sear_year=1999  \"June&nbsp;4 memory fades\"]</ref><ref>Carroll, J. M. \"A Concise History of Hong Kong.\" Rowman & Littlefield, 2007. {{ISBN|978-0-7425-3422-3}}.</ref><br />\n'''{{flagu|Mongolia|1949}}:''' Many reformists had been aware of the international reaction to the military action, and chose to follow the democratic changes in Eastern Europe and the Soviet Union.<ref>{{cite book|last=Bruun|first=Ole|author2=Odgaard, Ole |title=Mongolia in transition|publisher=Routledge|year=1996|page=32|isbn=978-0-7007-0441-5}}</ref><ref>{{cite book|last=Rossabi|first=Morris|title=Modern Mongolia: from khans to commissars to capitalists|publisher=University of California Press|year=2005|page=18|isbn=978-0-520-24419-1}}</ref><br />\n'''{{Flagu|Netherlands}}:''' The [[Cabinet of the Netherlands|Dutch government]] froze diplomatic relations with China, and summoned the Chinese Chargé d'Affaires Li Qin Ping expressing shock at the \"violent and brutal actions of the People's Liberation Army.\"<ref name=sc/><br />\n'''{{flagu|Philippines|1986}}:''' President [[Corazon Aquino]] expressed sadness at the incident, urging the Chinese government to \"urgently and immediately take steps to stop the aggressive and senseless killing by its armed forces\".<ref name=nst/> Socialist labor organization [[Kilusang Mayo Uno]] at first initially supported the action taken by Chinese authorities, though later issued a \"rectified position\" which blamed \"insufficient information and improper decision making process\".<ref>West, L. A. ''Militant Labor in the Philippines.'' Temple University Press, 1997. p. 178. {{ISBN|978-1-56639-491-8}}.</ref> The Communist Party also expressed opposition due to its line considering China as \"Revisionist\" after renouncing Maoism and reviving Capitalism.\n<br />\n'''{{Flagu|Poland}}:''' The [[Polish government]] criticised the response of the Chinese government but not the government itself. A government spokesman called the incident \"tragic\", with \"sincere sympathy for the families of those killed and injured.\" Daily protests and hunger strikes took place outside the Chinese embassy in Warsaw.  The government also expressed hope that it did not affect Sino-Polish relations.<ref name=columbus/>\n\nAfter Solidarity assumed the political leadership of Poland, the new government issued new stamps to commemorate the student protests in Tiananmen Square in China in the Spring of 1989.<ref>\"Solidarity commemorates Tiananmen Square,\" Making the History of 1989, Item No. 104, [http://chnm.gmu.edu/1989/items/show/104 Making the History of 1989]</ref>\n\n'''{{flagu|Romania|1965}}:''' [[Nicolae Ceauşescu]] praised the military action, and in a reciprocal move, China sent [[Qiao Shi]] to the Romanian Communist Party Congress in August 1989, at which Ceauşescu was re-elected.<ref>{{cite book|last=Suettinger|first=Robert L.|title=Beyond Tiananmen: The Politics of U.S.-China Relations 1989–2000|publisher=Brookings Institution Press|year=2004|page=105|isbn=978-0-8157-8207-0}}</ref><br />\n'''{{Flagu|Republic of China}} (Taiwan):''' President [[Lee Teng-hui]] issued a statement on 4 June strongly condemning the mainland Chinese response: \"Early this morning, Chinese communist troops finally used military force to attack the students and others demonstrating peacefully for democracy and freedom in Tiananmen Square in Peking, resulting in heavy casualties and loss of life. Although we anticipated this mad action of the Chinese communists beforehand, it still has moved us to incomparable grief, indignation and shock.\"<ref>[http://belobog.si.umich.edu/clair/corpora/corpora/us_congressional_record/101/101.sen.19890607.050.html Events In Beijing (Senate – 7 June 1989)]</ref> The authorities also lifted a ban on telephone communications to encourage private contacts and counter the [[Media blackout|news blackout]] on the mainland.<ref name=sc/><br />\n'''{{Flagu|Singapore}}:''' Prime Minister [[Lee Kuan Yew]], speaking on behalf of the Cabinet, said they were shocked and saddened by the response of the Chinese government, adding that \"we had expected the Chinese government to apply the doctrine of minimum force when an army is used to quell [[civil disorder]].\"<ref name=nst/><br />\n'''{{flagu|Soviet Union}}:''' General Secretary Mikhail Gorbachev did not explicitly condemn the actions, but called for reform. There was an interest on building relations on a recent summit in Beijing, but the events fueled discussion on human rights and Soviet foreign policy. There was some private criticism of the Chinese response.<ref name=sd/> Newly formed opposition groups condemned the military action. Ten days after the incident the government expressed regret, calling for political dialogue. Public demonstrations occurred at the Chinese embassy in Moscow. A spokesman on 10 June said the Kremlin was \"extremely dismayed\" at the incident.<ref>Wishnick E. ''Mending Fences: The Evolution of Moscow's China Policy, from Brezhnev to Yeltsin.'' University of Washington Press, 2001. p.106-107. {{ISBN|978-0-295-98128-4}}.</ref><ref>[https://query.nytimes.com/gst/fullpage.html?res=950DE2DC1638F933A25755C0A96F948260 TURMOIL IN CHINA; Kremlin Dismayed, Aide Says], New York Times, 10 June 1989.</ref><br />\n'''{{Flagu|South Korea}}:''' The Foreign Ministry expressed \"grave concern\" and hoped for no further deterioration of the situation. The statement also encouraged dialogue to resolve the issue peacefully.<ref>Zhang, L., Nathan, A. J., Link, P. & Schell O. ''The Tiananmen Papers: The Chinese Leadership's Decision to Use Force Against Their Own People – In Their Own Words.'' PublicAffairs, 2002. {{ISBN|978-1-58648-122-3}}.</ref><br />\n'''{{Flagu|Sweden}}:''' The [[Government of Sweden|Swedish government]] froze diplomatic relations with China.<ref>Reaction swift to bloodshed in China. Associated Press, 7 June 1989</ref><br />\n'''{{Flagu|Thailand}}:''' The [[Thai government]] had the warmest relations with Beijing out of all [[ASEAN]] members, and expressed confidence that the \"fluid situation\" in China had passed its \"critical point\", though it was concerned that it could delay a settlement in the [[Cambodian–Vietnamese War]].<ref name=nyt/><br />\n'''{{Flagu|United Kingdom}}:''' The Prime Minister, [[Margaret Thatcher]], expressed \"utter revulsion and outrage\", and was \"appalled by the indiscriminate shooting of unarmed people.\" She promised to relax immigration laws for Hong Kong residents.<ref>Carroll, J. M. ''A Concise History of Hong Kong.'' Rowman & Littlefield, 2007. {{ISBN|978-0-7425-3422-3}}.</ref><br />\n'''{{Flagu|United States}}:''' The [[United States Congress]] and media criticized the military action. President [[George H. W. Bush]] suspended military sales and visits to that country. Large scale protests against the Chinese government took place around the country.<ref name=nyt1/> George Washington University revealed that, through high-level secret channels on 30 June 1989, the US government conveyed to the government of the People's Republic of China that the events around the Tiananmen Square protests were an \"internal affair\".<ref>{{cite web|author=National Security Archive |url=http://www.gwu.edu/~nsarchiv/NSAEBB/NSAEBB16/documents/index.html#d33 |title=United States State Department \"Themes\" Declassified 2 July 1998 |publisher=Gwu.edu |accessdate=2013-05-30}}</ref><br />\n'''{{Flagu|Vietnam}}:''' despite Vietnam and China's history of strained relations, the [[Vietnamese government]] quietly supported the Chinese government. Media reported on the protests but offered no commentary, and state radio added that the PLA could not have stopped the action after \"hooligans and ruffians insulted or beat up soldiers\" and destroyed military vehicles. The government expressed that it wanted better relations with China, but did not want to go to the \"extremes of Eastern Europe or Tiananmen\" – referring to its own stability.<ref>Jeshurun, C. ''China, India, Japan and the Security of Southeast Asia.'' Institute of Southeast Asian Studies, 1993. {{ISBN|978-981-3016-61-3}}.</ref><br />\n'''{{flagu|Yugoslavia}}''': The national news agency [[Tanjug]] in the [[Non-Aligned Movement|non-aligned]] country said the protest became a \"symbol of destroyed illusions and also a symbol of sacrificed ideals which have been cut off by machine gun volleys and squashed under the caterpillars of heavy vehicles.\"<ref name=rg/>\n\n==Reaction of Chinese in North America, Hong Kong and Taiwan==\n\n===The [[Communist Party of China]] and the aftermath of the incident===\nThe [[Communist Party of China]], under the leadership of Premier [[Li Peng]] and party leader [[Jiang Zemin]], sought to minimize the impact of the Tiananmen Square Massacre on China's international image. They gave multiple \"reassuring public speeches\"<ref name=\"Surjit Mansingh 1991\">Surjit Mansingh, \"Beijing and Overseas Chinese,\" ''China Report'' 27, no. 4, (1991): 325</ref> in an attempt to avoid the loss of [[Most Favoured Nation]] trade status with the United States as well as to alter the opinion of [[overseas Chinese]].<ref name=\"Surjit Mansingh 1991\"/> Beijing offered inducements to the overseas Chinese intellectuals that lead the overseas pro-democratic movements, attempting to regain their loyalty.<ref name=\"Surjit Mansingh 1991\"/>  Many overseas Chinese, however, view the 4 June Incident as yet another example of communist repression in a long string of similar incidents.<ref>G.P Deshpande, \"The Chinese Political System in the Wake of Tiananmen,\" ''China Report'' 27, no. 4 (1991): 269</ref>\n\n===Hong Kong===\nFollowing the crackdown, rallies supporting Tiananmen Square protesters erupted throughout the world. In the days following the initial crackdown, 200,000 people in Hong Kong formed a massive rally, one of the largest in Hong Kong's history, to mourn the dead and protest the Chinese government's brutality.<ref name=\"ReferenceA\">Eric Skelton, \"CHINA: THE TIANANMEN MASSACRE Emotional crowd of 30,000 marches on consulate,\" ''The Globe and Mail'', 5 June 1989 A9</ref> This protest was also tinged with fear, however, as the spectre of [[Chinese reunification|reunification with China]] hung over their heads. Reunification, even under the \"[[one country, two systems]]\"<ref name=\"Margaret Scott 1989\">Margaret Scott, \"Hong Kong on Borrowed Time,\" ''New York Times'', 22 Oct 1989, A31</ref> doctrine sent hundreds of thousands of Hong Kongers scrambling for a chance to immigrate to another country.<ref name=\"Margaret Scott 1989\"/> In the end \"thousands of people ... disillusioned and worried about their future, moved overseas\".<ref name=CNN>[http://articles.cnn.com/1997-06-04/world/9706_04_tiananmen.hong.kong_1_szeto-wah-final-hong-kong-tiananmen-square?_s=PM:WORLD Final Hong Kong memorial for Tiananmen massacre], CNN, 4 June 1997.</ref> But many Hong Kong denizens continued to protest the crackdown in the [[China|PRC]], calling for unity with the Chinese people in fighting for democracy.<ref name=\"CNN\"/>\n\nFollowing the massacre, Hong Kong's largest ever protest erupted as people protested in support of the student movement. This protest was organized by the newly created [[Hong Kong Alliance in Support of Patriotic Democratic Movements in China]]. Over 1.5 million joined the march. Hong Kong's protest was the largest protest against the crackdown outside Beijing.\n\n=== Taiwan ===\nWhile many in Taiwan also protested the CCP's handling of the 4 June crackdown, going so far as to stage a \"[[hands across the island]]\"<ref name=\"Richard Bernstein 1989\">Richard Bernstein, \"In Taiwan, Sympathies Lean Toward Home,\" ''New York Times'', 4 June 1989, 121</ref> demonstration, there seemed to be an ambivalence to the events in China. [[Chou Tien-Jui]], publisher of a weekly news magazine called ''[[The Journalist]]'' commented that \"people in Taiwan think that Tiananmen Square is very far away. ... They think that we have plenty of local issues to be concerned about.\"<ref name=\"Richard Bernstein 1989\"/>  Other than the Hands across the island demonstration, there seemed to only be a \"muted and controlled local response to the upheaval in China.\"<ref name=NYT>[https://query.nytimes.com/gst/fullpage.html?res=950DEFD61E3DF937A35755C0A96F948260 CRACKDOWN IN BEIJING; IN TAIWAN, SYMPATHY AND ALOOFNESS], ''New York Times'', 4 June 1989.</ref> What demonstrations did happen seemed \"more dutiful than enthusiastic\".<ref name=\"NYT\"/> President [[Lee Teng-hui]] issued a statement on 4 June commenting that \"although [the Taiwanese government] anticipated this mad action of the Chinese communists beforehand, it still has moved us to incomparable grief, indignation and shock\".<ref name=\"US Congressional Record\">[http://belobog.si.umich.edu/clair/corpora/corpora/us_congressional_record/101/101.sen.19890607.050.html Events In Beijing (Senate – 7 June 1989)], ''US Congressional Record'', 7 June 1989.</ref>\n\n===Canada===\n5 June 1989 was marked by mass protests against the Beijing government by [[Chinese Canadians]]. The Chinese consulate in Toronto was picketed by 30,000 protesters of Chinese descent or their supporters.<ref>Eric Skelton, \"CHINA: THE TIANANMEN MASSACRE Emotional crowd of 30,000 marches on consulate,\" ''[[The Globe and Mail]]'', 5 June 1989 A.9</ref> Members of the protest called for an end to the bloodshed<ref name=\"ReferenceA\"/> as well as \"death to Premier [[Li Peng]]\".<ref name=\"ReferenceA\"/> Five Hundred Chinese Canadians rallied in front of the Chinese consulate in [[Vancouver]].<ref name=\"ReferenceA\"/> In [[Halifax Regional Municipality|Halifax]], one hundred Chinese students protested the actions of the [[People's Liberation Army|PLA]] and the resulting violence.<ref name=\"ReferenceA\"/> Chinese students at the [[University of Manitoba]] held their protests in the provincial legislature. Allan Chan, from the [[University of Calgary]], commented that the government action was inevitable because \"the students tried to push too hard ... [and that] you can't change a whole society overnight\".<ref name=\"ReferenceA\"/> Yan Xiaoqiao, a PhD chemistry student enrolled in [[Simon Fraser University]], said \"today is one of the darkest days in Chinese history\".<ref name=\"ReferenceA\"/> Many of the Chinese foreign exchange students studying in Canada opted to apply for [[permanent residency]] in the aftermath of 4 June rather than return to China.<ref>Wendy Stueck, \"Tough choices for Chinese: Many students apply for residency following Tiananmen massacre,\" ''The Vancouver Sun'', Sept 11, 1989, B6</ref>\n\nThere were international responses toward the Tiananmen Square protests of 1989. In [[Vancouver|Vancouver, British Columbia]], the Chinese community was among those who stood up against the [[Chinese Communist Party|Chinese Communist Party’s]] decision to take military action against student protesters. To demonstrate their support of the students in Tiananmen Square, various Chinese Canadian Organizations protested in Vancouver.\n\n====Vancouver's Chinese community protests====\n[[File:Goddess of Democracy at UBC.jpg|thumb|upright|Goddess of Democracy replica at the Vancouver campus of the University of British Columbia]]\n\nUsing tactics similar to those used by the university students in Beijing, 1,000 protesters took to Granville Street in Vancouver, British Columbia and marched to the Chinese Consulate. The ''[[Vancouver Sun]]'' reported that protesters wore black armbands, carried banners with slogans like \"Li Peng, you are a beast!\" or \"Today's menu Deng Xiaoping Stew—Free delivery all over China\" and demanded a statement from the consul-general.<ref name=\"Gawthrop\">Gawthrop, Dan. \"1000 in City Protest Killings Series: China in Crisis.\" ''The Vancouver Sun'', 5 June 1989, p. B1.</ref> Members of various Chinese organizations attended the demonstration including vice-president of the [[Chinese Benevolent Association]] of Canada, Gim Huey. Huey said that the weekend massacre in Beijing has ended support for state communism in China.<ref name=\"Gawthrop\"/> Chinese university students from British Columbia also participated in the events. A student from the University of Victoria said, \"Tiananmen Square has never been attacked by any government, even the Japanese, Chinese culture has a long civilization that was destroyed by the government\".<ref name=\"Gawthrop\"/>\n\nIn the following weeks the demonstrations continued. On 6 June 1989, 5,000 members of the Vancouver Chinese community, also marched down Granville Street in Vancouver to the Chinese Consulate and held a 40-minute candlelight memorial service.<ref>''The Province''. \"5,000 Here Chide China.\" 7 June 1989. p. 4.</ref> Six days later, on 12 June 1989, more members of the Vancouver's Chinese community rallied in Vancouver's [[Vancouver Chinatown|Chinatown]]. A group of 13,000 protesters joined this rally, which was followed by a speech by local political leader, [[Ed Broadbent]] of the [[New Democratic Party of Canada|New Democratic Party]]. Broadbent called for the immediate withdrawal of the Canadian Ambassador in China and an [[emergency debate]] of the crisis by the [[United Nations Security Council]].<ref>McLellan, Wendy. \"Beijing Ambassador's Withdrawal Called For.\" ''Vancouver Sun'', 12 June 1989, p. B1.</ref> Afterward, demonstrators took turns expressing their feelings about the Chinese Government's decisions to use military violence on students. A Chinese student from Simon Fraser University stated, \"For each of those who have fallen, 1,000 Chinese will come forward and rise up\".<ref>Rees, Ann. \"Thousands Mourn.\" ''The Province'', 12 June 1989, p. 4.</ref>\n\n====Dispute over the Goddess of Democracy in Vancouver====\nOn 22 August 1989, Vancouver's Chinese community, as well as other human rights activists, united at Robson Square to commemorate the 1989 Tiananmen Square Massacre with an art exhibition. The exhibition displayed different media sources such as videos, images, news clippings, and included discussions for a replica of the Beijing students, '[[Goddess of Democracy]]'.<ref name=\"parton\">Parton, Nicole. \"Goddess of Democracy a Hot Lady in Vancouver.\" ''The Vancouver Sun'', 22 August 1989.</ref>\n\nAfter the exhibition, the community debated on an appropriate space for a replica statue. Members of Vancouver's 'Society in Support of Democratic Movement' believed a replica of the 'Goddess of Democracy' should be placed in Vancouver's [[Dr. Sun Yat-Sen Classical Chinese Garden]] The garden's namesake is the nationalist leader, considered to be the father of modern China).<ref name=\"parton\"/> However, the garden's boards of trustees did not want the statue, because the garden was not a political forum.<ref name=\"parton\"/> Others speculate that the trustees did not want the statue because the Chinese Communist Party donated more than $500,000 to the building of the Dr. Sun Yat-Sen Garden.<ref name=\"parton\"/> The 'Goddess of Democracy' debate continued on 26 August 1989 and Gim Huey, chairman of Vancouver's Chinese Benevolent Association, pleaded that the statue must be in Dr. Sun Yat-Sen Garden, stating that it was \"not political\" but was \"promoting freedom and democracy\".<ref name=\"Farrow\">Farrow, Moira. \"Democracy Statue Squabble Intensifies.\" ''The Vancouver Sun'', 26 August 1989, p G15.</ref> Huey believed that \"Dr. Sun Yat-Sen stood for freedom and that's the whole spirit of the Garden\".<ref name=\"Farrow\"/> When talks with the Vancouver Parks Board failed, the proposed replica statue had no home. Finally, after much lobbying, the 'Vancouver Society in Support for the Democracy Movement' was optimistic when new talks began with the University of British Columbia. Reportedly, \"the society approached UBC through a campus organization of Chinese students and scholars and got a warm welcome\".<ref>Farrow, Moira. \"Tiananmen Statue site proposed: Society seeks UBC site for the replica of Tiananmen statue.\" ''The Vancouver Sun'', 4 October 1990 P. A18.</ref> Talks were successful in finding the statue a home, and these plans were followed through as the 'Goddess of Democracy' statue was moved to the grounds of the University of British Columbia.\n\n====Split over National Day in Vancouver====\n[[National Day of the People's Republic of China|China's National Day]], celebrated on 1 October, further stirred up feelings over the Tiananmen Square Massacre. National Day celebrates the founding of the Peoples Republic of China. In Vancouver, the Chinese community was divided on how to celebrate National Day. Two separate events were planned. Supporters for democracy in China proposed a 24-hour fast along with a reenactment of the Beijing students' tent camps.<ref name=\"hendrickson\">Hendrinkson, Bob. \"For friends and Foes of China: Protests set up to counter Anniversary Celebration in Vancouver.\" ''The Province'', 29 September 1989 P. 41.</ref> The Chinese Cultural Center and Chinese Benevolent Association proposed that regular National Day events like lion dancing and dinner should take place. Bill Chu from the 'Canadian Christians for Democratic Movement in China' claimed that, decisions to continue regular National Day celebrations were another Chinese government cover-up and said that telephone polls showed that \"71.6% of Vancouver's Chinese community opposed celebrations\".<ref name=\"hendrickson\"/> Tommy Toa, former director of the Chinese Benevolent Association stated, \"To celebrate national Day without condemnation of the current Chinese government is hypocritical [...] I believe if we celebrate anything we should celebrate the courage and determination of the Chinese people seeking democracy\".<ref name=\"farrowm\">Farrow, Moira. \"Chinese Community Split Seen: National Day Events Differ.\" ''The Vancouver Sun'', 25 August 1989 p. B1.</ref> In reaction to the pro-democracy stance, the director of the Chinese Cultural Center Dr. K.T Yue said that because Canada still recognized the Chinese government, \"we go along with the government\", even though he sympathized with the democracy movement.<ref name=\"farrowm\"/>\n\nOn 1 October 1989, the National Day events unfolded with two clear stances. A protest of more than 500 pro-Democracy supporters, was held outside the Main Street [[SkyTrain (Vancouver)|SkyTrain station]] in Vancouver, against the Tiananmen Square Massacre.<ref name=\"wong\">Wong, Victor Chew. \"Chinese Split on National Day.\" ''The Province'', 1 October 1989, p 25.</ref> Chan Kwok-Kin criticized those who attended the regular National Day celebrations stating, \"I think those who are feasting are doing so for personal gain\".<ref name=\"wong\"/> Others like the Chinese Benevolent Association's president, Bill Yee, defended their National Day celebration, arguing that it was rooted in a 30-year-old tradition.<ref name=\"wong\"/>\n\n=== Setting a [[precedent]] in law – United States ===\nAs veterans of the 4 June movement settled into lives in their adopted countries some, like [[Wang Dan (dissident)|Wang Dan]] chose to continue the fight against the [[Chinese Communist Party|CCP]]. He, along with 4 other protesters launched a lawsuit against [[Li Peng]] for his part in the military crackdown. Their goal was to \"prove that he is accountable for the crime, and that this kind of crime, the [[human rights violation]], is beyond China's borders\".<ref>\"China's Li Peng sued in U.S. court over Tiananmen rights abuses,\" ''New York Times'', Sept 01, 2000, A. 24</ref>\n\n==References==\n{{reflist|30em}}\n\n{{DEFAULTSORT:Reactions To Tiananmen Square Protests Of 1989}}\n[[Category:1989 in international relations]]\n[[Category:History of Vancouver]]\n[[Category:Tiananmen Square protests of 1989]]\n[[Category:Reactions]]",
            "slug": "reactions-to-the-tiananmen-square-protests-of-1989",
            "date_updated": 1517983357565,
            "imported": "https://en.wikipedia.org/wiki/Reactions to the Tiananmen Square protests of 1989"
        }
    ]
}