{
	"comment": [
		{
			"comment_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1comment1",
			"body": "<p>Ciekawy tekst. Moze powalic z nog. Kto by pomyslal? Ze to takie kombinatory...</p><p>Samo zycie.</p>",
			"body_p": "Ciekawy tekst. Moze powalic z nog. Kto by pomyslal? Ze to takie kombinatory...Samo zycie.",
			"topic_id": "1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRwtopic14",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"comment_parent_id": 0,
			"added": 1567346762134
		},
		{
			"comment_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1comment2",
			"body": "<p>Ciekawa analiza sytuacji. Faktycznie, to gowniano wyglada dla nas, Wniosek, ugotuja nas jak zabe.</p>",
			"body_p": "Ciekawa analiza sytuacji. Faktycznie, to gowniano wyglada dla nas, Wniosek, ugotuja nas jak zabe.",
			"topic_id": "1JLshD4RyXz1QgpDfsSQsvk5TPgTM4MEKCtopic2",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"comment_parent_id": 0,
			"added": 1579634795408
		},
		{
			"comment_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1comment3",
			"body": "<p>Dobre i ciekawe. Jak mocno nas skolowali?</p>",
			"body_p": "Dobre i ciekawe. Jak mocno nas skolowali?",
			"topic_id": "1JLshD4RyXz1QgpDfsSQsvk5TPgTM4MEKCtopic5",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"comment_parent_id": 0,
			"added": 1581801684670
		},
		{
			"comment_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1comment4",
			"body": "<p>Interesujace sprawy. Tak trzymaj.</p>",
			"body_p": "Interesujace sprawy. Tak trzymaj.",
			"topic_id": "1JLshD4RyXz1QgpDfsSQsvk5TPgTM4MEKCtopic14",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"comment_parent_id": 0,
			"added": 1583060971200
		},
		{
			"comment_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1comment5",
			"body": "<p>Ciekawe, spojrzenie na pieniadze pozyczone dawno temu, ale oddac to juz inna sprawa.</p>",
			"body_p": "Ciekawe, spojrzenie na pieniadze pozyczone dawno temu, ale oddac to juz inna sprawa.",
			"topic_id": "1JLshD4RyXz1QgpDfsSQsvk5TPgTM4MEKCtopic15",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"comment_parent_id": 0,
			"added": 1583153069435
		},
		{
			"comment_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1comment6",
			"body": "<p>To wszystko zaczyna sie ukadac, w jedno calosc.</p>",
			"body_p": "To wszystko zaczyna sie ukadac, w jedno calosc.",
			"topic_id": "1GbrGWLCUP7wZJH1sEY9nFzre9AL24hGq1topic6",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"comment_parent_id": 0,
			"added": 1604597316054
		}
	],
	"next_comment_id": 7,
	"user": [
		{
			"user_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1",
			"user_name": "Eldzmne5REv7w@zv.anonymous",
			"added": 1567347394286
		}
	],
	"next_user_id": 2,
	"topic": [
		{
			"topic_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1topic1",
			"channel_id": "1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRwch4",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"title": "-Narzędzie Przymusu",
			"body": "<p>2020.01.22.03.text-Wiedza-5-G-Narzędzie Przymusu.</p><p>Witam;jest to przedruk, z Klub Inteligencji Polskiej. Autorstwa, Ewa Pawela.</p><p><br><br>&nbsp;</p><p><i>37 lat temu, w styczniu 1982 roku, zdawałam w Paryżu w ramach magisterium z językoznawstwa ogólnego egzamin z teorii informacji. Egzamin był pisemny i mieliśmy w rozprawce pod tytułem „Rola telekomunikacji w XXI wieku” streścić cykl wykładów profesora Borysa Rybaka, który przez cały semestr roztaczał przed nami wizje ówczesnych światowych elit odnośnie przyszłości społeczeństw i całego rodzaju ludzkiego.</i></p><p><i>W telegraficznym skrócie jego narracja była następująca. Po okropnościach drugiej wojny światowej i barbarzyństwie Holokaustu trzeba było uczynić wszystko, aby podobna sytuacja nie powtórzyła się nigdy więcej. Ponieważ w czasie wojny człowiek pokazał całe zło, do jakiego jest zdolny, należało go całkowicie przemodelować jako gatunek i tak zarządzać masami ludzkimi przy pomocy cybernetyki, informatyki i elektroniki, by móc sprawować całkowitą kontrolę nad każdym przejawem życia społecznego. Szczególny nacisk kładziono na wyeliminowanie tzw. złych instynktów i emocji poszczególnych jednostek a także na zapobieganie rozprzestrzeniania się tych negatywnych nastrojów wśród ludzi.</i></p><p><i>Kluczem do bezkolizyjnego zarządzania tym „folwarkiem ludzkim” miała być właśnie telekomunikacja. Należało bezwzględnie zatomizować społeczeństwo oddzielając człowieka od człowieka przy pomocy elektronicznych urządzeń, które z czasem stałyby się dla ludzi niezbędnymi protezami, bez których nie wyobrażaliby sobie życia. Następnie zdalnie – przedrostek TELE w tytułowej telekomunikacji był najważniejszym elementem tej układanki – i precyzyjnie za pomocą fal radiowych określonej częstotliwości chciano wpływać na wszystkie parametry psychofizyczne człowieka tak, by spełniał wszelkie oczekiwania swoich „projektodawców” czy „programistów”.</i></p><p><i>Ulubioną metaforą tego procesu przemieniania ludzi w ubezwłasnowolnione, zdalnie sterowane obiekty inżynierii społecznej było twierdzenie Pana Profesora, że za jakieś 20 do 30 lat będzie można bez problemu zamieniać, jak ich nazywał „chuliganów stadionowych” w potulne, łagodne i całkowicie zadowolone ze swego losu „baranki”.</i></p><p><i>Zapytacie Państwo: A gdzie w tym wszystkim jest 5G?</i></p><p><i>Otóż egzamin dotyczył kolejnych etapów wprowadzania tego „szczytnego” planu w życie i pod koniec należało opisać sytuację docelową, gdzie przy pomocy wszechobecnej infrastruktury łączności będzie można monitorować w czasie realnym (tzn. bez opóźnienia w przesyle sygnału) całą ludzkość, a co za tym idzie, wpleść nas wszystkich w cybernetyczną pętlę zadaniową, podobnie jak to robimy z komputerami. Chodziło w tym przede wszystkim o zbudowanie globalnego interfejsu mózg-komputer, gdzie za pośrednictwem urządzeń telekomunikacyjnych podwójnej łączności będzie można uśrednić czy ujednolicić ludzkie zachowania i obdarzyć nas wszystkich świadomością roju (hive mind).</i></p><p><i>5G jest właśnie próbą zbudowania tego systemu totalitarnej łączności, przed którym nie będzie ucieczki, zaś obiecywany nam jako świetlana przyszłość Internet Rzeczy będzie tylko krótkim etapem przejściowym do wprowadzenia Internetu Ludzi, kiedy tylko zaczipowane osoby będą mogły korzystać z otaczających nas urządzeń przez co ziści się proroctwo apokaliptyczne o znaku bestii.</i></p><p><i>Podsumowując, wszystko zmierza ku temu, byśmy już dzisiaj, po wprowadzeniu technologii 5G, mogli być dowolnie modyfikowani w naszych reakcjach fizjologicznych, emocjonalnych i kognitywnych przez zewnętrzną przestrzeń informacyjną, w której zostaniemy bezapelacyjnie zanurzeni. Nieprzypadkowo, tak gęsto rozmieszczone w naszym otoczeniu nadajniki 5g będą emitować sygnały w częstotliwościach fal milimetrowych, gdyż są to właśnie częstotliwości, na jakich porozumiewają się podstawowe cegiełki naszych organizmów. Częstotliwości drgań naszych błon komórkowych, częstotliwości tak zwanej biokomunikacji. Współdzielenie tego pasma częstotliwości bioelektromagnetycznych przez ludzkie bioprocesory i przez otaczające nas urządzenia elektroniczne ma służyć zdalnej modyfikacji i obróbce naszych naturalnych procesów życiowych i może się odbywać kompletnie poza świadomością jednostki i z całkowitym pominięciem jej wolnej woli.</i></p><p><i>W telegraficznym skrócie jego narracja była następująca. Po okropnościach drugiej wojny światowej i barbarzyństwie Holokaustu trzeba było uczynić wszystko, aby podobna sytuacja nie powtórzyła się nigdy więcej. Ponieważ w czasie wojny człowiek pokazał całe zło, do jakiego jest zdolny, należało go całkowicie przemodelować jako gatunek i tak zarządzać masami ludzkimi przy pomocy cybernetyki, informatyki i elektroniki, by móc sprawować całkowitą kontrolę nad każdym przejawem życia społecznego. Szczególny nacisk kładziono na wyeliminowanie tzw. złych instynktów i emocji poszczególnych jednostek, a także na zapobieganie rozprzestrzeniania się tych negatywnych nastrojów wśród ludzi.</i></p><p><i>Kluczem do bezkolizyjnego zarządzania tym „folwarkiem ludzkim” miała być właśnie telekomunikacja. Należało bezwzględnie zatomizować społeczeństwo oddzielając człowieka od człowieka przy pomocy elektronicznych urządzeń, które z czasem stałyby się dla ludzi niezbędnymi protezami, bez których nie wyobrażaliby sobie życia. Następnie zdalnie – przedrostek TELE w tytułowej telekomunikacji był najważniejszym elementem tej układanki – i precyzyjnie za pomocą fal radiowych określonej częstotliwości chciano wpływać na wszystkie parametry psychofizyczne człowieka tak, by spełniał wszelkie oczekiwania swoich „projektodawców” czy „programistów”.</i></p><p><i>Ulubioną metaforą tego procesu przemieniania ludzi w ubezwłasnowolnione, zdalnie sterowane obiekty inżynierii społecznej było twierdzenie Pana Profesora, że za jakieś 20 do 30 lat będzie można bez problemu zamieniać, jak ich nazywał „chuliganów stadionowych” w potulne, łagodne i całkowicie zadowolone ze swego losu „baranki”</i></p><p><i>W czerwcu 1995, w rok po uruchomieniu na Alasce amerykańskiego systemu HAARP, Michael Persinger, designer broni neuronowych i słynny wynalazca „kasku Boga” na łamach czasopisma naukowego ”Perception and Motor Skills” stwierdził: „ technicznie bezpośrednie oddziaływanie na znaczną część około 6 miliardów ludzkich mózgów bez pośrednictwa klasycznych metod sensorycznych, a poprzez generowanie informacji nerwowych w środowisku fizycznym, w którym zanurzeni są wszyscy członkowie gatunku…jest obecnie marginalnie wykonalne”.</i></p><p><i>Zatem od 1995 roku Armia Amerykańska dysponowała narzędziem do zdalnego wpływania na populację planety i należało tylko przeprowadzić szeroko zakrojony eksperyment, z udziałem ludzkich królików doświadczalnych wszystkich ras, kultur, narodowości czy języków, by sprawdzić metodami naukowymi, czy faktycznie Władcy Marionetek otrzymali uniwersalny instrument „strojenia” ludzi według swoich potrzeb i oczekiwań. Dla dziesiątek, o ile nie setek tysięcy ludzi na całym świecie oznaczało to prawdziwe piekło na ziemi, gdyż eksperymentatorzy latami sprawdzali, jak daleko można się w tym zdalnym sterowaniu ludzkim bioprocesorem posunąć. Czy można z normalnego, porządnego człowieka uczynić pijaka, pedofila, terrorystę samobójcę? Zmienić komuś orientację seksualną? Wywołać zdalnie raka, cukrzycę, udar lub zawał? Wreszcie czy można spowodować, że kochająca matka zabije własne dzieci? A wszystko to na żywym, ludzkim i najczęściej niczego nieświadomym materiale…</i></p><p><i>Oficjalnie nazywa się to programem kontroli umysłu (mind control). Informacje o tym, jak to działa oraz dokładny opis patentów DARPY, US NAVY czy AIR FORCE, które to umożliwiają, można bez trudu znaleźć w Internecie bądź poczytać o tym w całej serii powszechnie dostępnych książek. Nie jest to bynajmniej wiedza tajna, nawet nie poufna, tylko umiejętnie skrywana. Wystarczy tylko chcieć do niej dotrzeć</i></p><p><i>O samym HAARP powstały dwie książki o znamiennych tytułach: „Anioły nie grają na tej harfie” Nicka Begicha i Jeane Manning oraz „HAARP – broń ostateczna Jerry’ego Smitha, co zwięźle pokazuje, jakie cele przyświecały jego powstaniu. Za ojca i największego promotora tej złowrogiej instalacji, dającej Stanom Zjednoczonym niepodważalną hegemonię w świecie, a będącej jednocześnie bronią geofizyczną, klimatyczną i psychotroniczną, uważany jest dr Naftali Berg, wieloletni dyrektor Departamentu Badań Naukowych w Sekretariacie Obrony USA, mózg Pentagonu oraz doradca kilku kolejnych prezydentów Stanów Zjednoczonych. Dr Berg był rabinem, członkiem chasydzkiego ruchu Chabad Lubawitch nazywanym przez swoich współwyznawców dumą lub super bronią Chabadu. Jemu też zawdzięczamy wprowadzenie zasady tzw. „podwójnego zastosowania” technologii wojskowych, czyli możliwości ich użycia także wobec cywilów w czasach pokoju.</i></p><p><i>HAARP jest systemem wielu dipolowych anten zdolnych do emitowania w kierunku jonosfery spójnych wiązek energii bardzo dużych mocy. Po odbiciu od lustra jonosfery można te wiązki fal elektromagnetycznych kierować na dowolny obszar na ziemi. Anteny HAARP mogą pulsować promieniowaniem mikrofalowym z jedną tysięczną jednego Hertza, co oznacza, że instalacja ma możliwość precyzyjnego kontrolowania ludzkiego mózgu w zakresie częstotliwości od 1 do 100 Hz, czyli w paśmie na którym pracuje nasz układ nerwowy.</i></p><p><i>Polskie ofiary tych eksperymentów są na tej Sali i za chwilę kolega opowie, jak wygląda nasza codzienność i z jak wielkim, zadawanym zdalnie, cierpieniem musimy się mierzyć praktycznie każdego dnia. Ja ograniczę się tylko do zacytowania dwóch tytułów wymyślonych przez innego naszego kolegę, członka stowarzyszenia polskich ofiar kontroli umysłu STOPZET, co oznacza Stop Zorganizowanym Elektronicznym Torturom. Ten kolega swój blog zatytułował </i><a href=\"https://thoughtsnotmine.wordpress.com/\"><i>„Thoughts NOT Mine” (czyli Myśli NIE moje)</i></a><i> a kanał na You Tube, który prowadzi nazwał MIND WARS PL (czyli Wojna o umysł).</i></p><p><i>I o to tu tak naprawdę chodzi. Zarówno HAARP jak i sprzężony z nim lada moment system technologii 5G zrodziły się w laboratoriach wojskowych i są środkami do zdobycia totalnej dominacji nad światem. Obecnie te technologie wojskowe przenoszone są do naszej przestrzeni cywilnej, instalowane w naszych miastach i po wsiach po to, żebyśmy zgodnie z założeniami najnowszej doktryny wojennej tak Stanów Zjednoczonych jak i Federacji Rosyjskiej mogli być elementami przyszłego globalnego pola bitwy o wszystko.</i></p><p><i>Dlatego właśnie rozgorzała tak zacięta wojna miedzy mocarstwami o to, czyja infrastruktura sieci 5G będzie wykorzystywana na świecie. Dlatego też wszyscy zaczęli nagle odmieniać słowo „cyberbezpieczeństwo” przez wszystkie przypadki. Nie jest to bynajmniej wojna handlowa, jak usiłuje się to nam wmówić, gdyż te marne 17 kwintylionów dolarów potencjalnego zysku nigdy nie zwróci nakładów finansowych potrzebnych do umieszczenia na orbicie okołoziemskiej 20 tysięcy satelitów geolokacyjnych. To jest wojna o władzę nad światem, gdzie zwycięzca bierze definitywnie wszystko. Przysłowiowa gra końcowa (Endgame).</i></p><p><i>Na antenie NTV możecie Państwo wysłuchać wywiadów z paroma światowej klasy ekspertami od broni najnowszej generacji. Klikając na stronę NTV a potem wchodząc na playlistę Mind Control będziecie mogli zapoznać się z opiniami dr Barry’ego Trowera, dr Roberta Duncana, Marka Steela i innych. Wszyscy oni powtarzają jak mantrę, że 5G nie ma bynajmniej służyć do telekomunikacji, telemedycyny, wprowadzenia samochodów autonomicznych czy zoptymalizowania infrastruktury inteligentnych miast. To co się nam przedstawia jako wielkie atuty tej technologii, to tylko jej poboczne aplikacje, mające umożliwić cel podstawowy, czyli potencjalne wymierzenie w każdego z nas, w każdym momencie naszego życia, wiązki broni energii skierowanej.</i></p><p><i>Do dowolnego zastosowania: do inwigilacji i podsłuchów, do zdalnego odczytywania i modyfikowania wszelkich danych i sygnałów płynących z i do naszego ciała, a tym samym do wpływania na nasze zdrowie i zachowanie. Wreszcie, jeśli taka będzie wola i kaprys tych u władzy, technologia 5G umożliwi przeprowadzenie depopulacji czyli fizyczną eliminację tych, którzy zostaną uznani za zbędnych lub niewygodnych.</i></p><p><i>Tak jak w sztukach Czechowa, jeśli w pierwszym akcie wśród rekwizytów znajduje się strzelba, to wiadomo, że przed końcem sztuki wypali. Dlatego zawczasu zdejmijmy tę strzelbę ze ściany i oddajmy ją szybciutko do Muzeum Bardzo Złych Pomysłów. W przeciwnym przypadku, dzięki satelitom szpiegowskim Ziemia znajdzie się bezpowrotnie w otulinie z mikrofal, &nbsp;a nasze organizmy będą się musiały przystosować do całkowicie sztucznych częstotliwości środowiska technologicznego. Ofiary kontroli umysłu wiedzą jak to jest uciążliwe i jak bardzo „odczłowiecza”, bo funkcjonują od lat w interfejsie mózg-maszyna.</i></p><p><i>Technologia komunikacyjna 5G jest całkowicie odmienna od swych poprzedniczek. Zupełnie inna jest struktura i funkcje anten nadawczo-odbiorczych a także sama architektura sieci. Tak jak przy polu anten dipolowych HAARP, przy antenach typu MIMO kilka a nawet kilkadziesiąt elementów (komórek) nadajnika działa razem, aby generować pole wysokiej częstotliwości zaprojektowane specjalnie dla 5G w celu zwiększenia ich przenikalności. Natomiast zastosowanie szyku fazowanego nadawanego sygnału pozwala na dokładne namierzanie ruchomego celu i skierowanie nań bardzo spójnej wiązki energii o dużej mocy</i></p><p><i>Według oficjalnej wersji wydarzeń technologia 5G pozostaje w fazie testowej i nie została jeszcze nigdzie wprowadzona na dobre do przestrzeni publicznej. Znowu nic bardziej mylnego, gdyż już od kilku lat w anteny 4G były wbudowywane nadajniki 5G i mamy wszelkie podstawy by twierdzić, że od tamtej pory prowadzi się ściśle tajne wojskowe eksperymenty w oparciu o te nadajniki 5G, system HAARP oraz satelitarny nadzór tak zwanych targetów – ludzkich namierzanych celów.</i></p><p><i>Wszystko wskazuje na to, że także dyplomaci amerykańscy w Havanie i w Kantonie mogli paść ofiarą tego zbrodniczego procederu. Trzy niezależne zespoły lekarzy i naukowców, które ich badały, ogłosiły, że doznane urazy i objawy chorobowe są całkowicie zbieżne z tymi zgłaszanymi na całym świecie przez ofiary kontroli umysłu. Także rozliczne patologie zaobserwowane wśród mieszkańców Gateshead, miasta na północy Wielkiej Brytanii, gdzie potajemnie zainstalowano nadajniki 5G na latarniach ulicznych, wskazują na identyczny mechanizm ich powstawania</i></p><p><i>Profesor Beatrice Golomb z kalifornijskiego Uniwersytetu Medycznego w San Diego publicznie stwierdziła, że we wszystkich trzech przypadkach etiologia, a zatem i czynnik patogenny mogą być podobne. Jej zdaniem chodzi tu o znane efekty impulsowego promieniowania elektromagnetycznego o częstotliwości radiowej i mikrofalowej. Podkreśla też powszechnie znany fakt, że fale milimetrowe o wysokiej częstotliwości (95 GHz) są wykorzystywane przez wojsko do nieśmiercionośnej kontroli tłumu (ADS active denial System – aktywny system odmowy) . Technologia 5G znajduje się w tej samej grupie wysokiej częstotliwości (6 GHz – 100 GHz) podczas gdy nasza obecna technologia mikrofalowa 3G i 4G wykorzystuje dłuższe fale.</i></p><p><br>&nbsp;</p><p>Autor: Ewa Pawela</p>",
			"embed_url": "",
			"type": "topic",
			"added": 1579800775944,
			"body_p": "2020.01.22.03.text-Wiedza-5-G-Narzędzie Przymusu.Witam;jest to przedruk, z Klub Inteligencji Polskiej. Autorstwa, Ewa Pawela.&nbsp;37 lat temu, w styczniu 1982 roku, zdawałam w Paryżu w ramach magisterium z językoznawstwa ogólnego egzamin z teorii informacji. Egzamin był pisemny i mieliśmy w rozprawce pod tytułem „Rola telekomunikacji w XXI wieku” streścić cykl wykładów profesora Borysa Rybaka, który przez cały semestr roztaczał przed nami wizje ówczesnych światowych elit odnośnie przyszłości społeczeństw i całego rodzaju ludzkiego.W telegraficznym skrócie jego narracja była następująca. Po okropnościach drugiej wojny światowej i barbarzyństwie Holokaustu trzeba było uczynić wszystko, aby podobna sytuacja nie powtórzyła się nigdy więcej. Ponieważ w czasie wojny człowiek pokazał całe zło, do jakiego jest zdolny, należało go całkowicie przemodelować jako gatunek i tak zarządzać masami ludzkimi przy pomocy cybernetyki, informatyki i elektroniki, by móc sprawować całkowitą kontrolę nad każdym przejawem życia społecznego. Szczególny nacisk kładziono na wyeliminowanie tzw. złych instynktów i emocji poszczególnych jednostek a także na zapobieganie rozprzestrzeniania się tych negatywnych nastrojów wśród ludzi.Kluczem do bezkolizyjnego zarządzania tym „folwarkiem ludzkim” miała być właśnie telekomunikacja. Należało bezwzględnie zatomizować społeczeństwo oddzielając człowieka od człowieka przy pomocy elektronicznych urządzeń, które z czasem stałyby się dla ludzi niezbędnymi protezami, bez których nie wyobrażaliby sobie życia. Następnie zdalnie – przedrostek TELE w tytułowej telekomunikacji był najważniejszym elementem tej układanki – i precyzyjnie za pomocą fal radiowych określonej częstotliwości chciano wpływać na wszystkie parametry psychofizyczne człowieka tak, by spełniał wszelkie oczekiwania swoich „projektodawców” czy „programistów”.Ulubioną metaforą tego procesu przemieniania ludzi w ubezwłasnowolnione, zdalnie sterowane obiekty inżynierii społecznej było twierdzenie Pana Profesora, że za jakieś 20 do 30 lat będzie można bez problemu zamieniać, jak ich nazywał „chuliganów stadionowych” w potulne, łagodne i całkowicie zadowolone ze swego losu „baranki”.Zapytacie Państwo: A gdzie w tym wszystkim jest 5G?Otóż egzamin dotyczył kolejnych etapów wprowadzania tego „szczytnego” planu w życie i pod koniec należało opisać sytuację docelową, gdzie przy pomocy wszechobecnej infrastruktury łączności będzie można monitorować w czasie realnym (tzn. bez opóźnienia w przesyle sygnału) całą ludzkość, a co za tym idzie, wpleść nas wszystkich w cybernetyczną pętlę zadaniową, podobnie jak to robimy z komputerami. Chodziło w tym przede wszystkim o zbudowanie globalnego interfejsu mózg-komputer, gdzie za pośrednictwem urządzeń telekomunikacyjnych podwójnej łączności będzie można uśrednić czy ujednolicić ludzkie zachowania i obdarzyć nas wszystkich świadomością roju (hive mind).5G jest właśnie próbą zbudowania tego systemu totalitarnej łączności, przed którym nie będzie ucieczki, zaś obiecywany nam jako świetlana przyszłość Internet Rzeczy będzie tylko krótkim etapem przejściowym do wprowadzenia Internetu Ludzi, kiedy tylko zaczipowane osoby będą mogły korzystać z otaczających nas urządzeń przez co ziści się proroctwo apokaliptyczne o znaku bestii.Podsumowując, wszystko zmierza ku temu, byśmy już dzisiaj, po wprowadzeniu technologii 5G, mogli być dowolnie modyfikowani w naszych reakcjach fizjologicznych, emocjonalnych i kognitywnych przez zewnętrzną przestrzeń informacyjną, w której zostaniemy bezapelacyjnie zanurzeni. Nieprzypadkowo, tak gęsto rozmieszczone w naszym otoczeniu nadajniki 5g będą emitować sygnały w częstotliwościach fal milimetrowych, gdyż są to właśnie częstotliwości, na jakich porozumiewają się podstawowe cegiełki naszych organizmów. Częstotliwości drgań naszych błon komórkowych, częstotliwości tak zwanej biokomunikacji. Współdzielenie tego pasma częstotliwości bioelektromagnetycznych przez ludzkie bioprocesory i przez otaczające nas urządzenia elektroniczne ma służyć zdalnej modyfikacji i obróbce naszych naturalnych procesów życiowych i może się odbywać kompletnie poza świadomością jednostki i z całkowitym pominięciem jej wolnej woli.W telegraficznym skrócie jego narracja była następująca. Po okropnościach drugiej wojny światowej i barbarzyństwie Holokaustu trzeba było uczynić wszystko, aby podobna sytuacja nie powtórzyła się nigdy więcej. Ponieważ w czasie wojny człowiek pokazał całe zło, do jakiego jest zdolny, należało go całkowicie przemodelować jako gatunek i tak zarządzać masami ludzkimi przy pomocy cybernetyki, informatyki i elektroniki, by móc sprawować całkowitą kontrolę nad każdym przejawem życia społecznego. Szczególny nacisk kładziono na wyeliminowanie tzw. złych instynktów i emocji poszczególnych jednostek, a także na zapobieganie rozprzestrzeniania się tych negatywnych nastrojów wśród ludzi.Kluczem do bezkolizyjnego zarządzania tym „folwarkiem ludzkim” miała być właśnie telekomunikacja. Należało bezwzględnie zatomizować społeczeństwo oddzielając człowieka od człowieka przy pomocy elektronicznych urządzeń, które z czasem stałyby się dla ludzi niezbędnymi protezami, bez których nie wyobrażaliby sobie życia. Następnie zdalnie – przedrostek TELE w tytułowej telekomunikacji był najważniejszym elementem tej układanki – i precyzyjnie za pomocą fal radiowych określonej częstotliwości chciano wpływać na wszystkie parametry psychofizyczne człowieka tak, by spełniał wszelkie oczekiwania swoich „projektodawców” czy „programistów”.Ulubioną metaforą tego procesu przemieniania ludzi w ubezwłasnowolnione, zdalnie sterowane obiekty inżynierii społecznej było twierdzenie Pana Profesora, że za jakieś 20 do 30 lat będzie można bez problemu zamieniać, jak ich nazywał „chuliganów stadionowych” w potulne, łagodne i całkowicie zadowolone ze swego losu „baranki”W czerwcu 1995, w rok po uruchomieniu na Alasce amerykańskiego systemu HAARP, Michael Persinger, designer broni neuronowych i słynny wynalazca „kasku Boga” na łamach czasopisma naukowego ”Perception and Motor Skills” stwierdził: „ technicznie bezpośrednie oddziaływanie na znaczną część około 6 miliardów ludzkich mózgów bez pośrednictwa klasycznych metod sensorycznych, a poprzez generowanie informacji nerwowych w środowisku fizycznym, w którym zanurzeni są wszyscy członkowie gatunku…jest obecnie marginalnie wykonalne”.Zatem od 1995 roku Armia Amerykańska dysponowała narzędziem do zdalnego wpływania na populację planety i należało tylko przeprowadzić szeroko zakrojony eksperyment, z udziałem ludzkich królików doświadczalnych wszystkich ras, kultur, narodowości czy języków, by sprawdzić metodami naukowymi, czy faktycznie Władcy Marionetek otrzymali uniwersalny instrument „strojenia” ludzi według swoich potrzeb i oczekiwań. Dla dziesiątek, o ile nie setek tysięcy ludzi na całym świecie oznaczało to prawdziwe piekło na ziemi, gdyż eksperymentatorzy latami sprawdzali, jak daleko można się w tym zdalnym sterowaniu ludzkim bioprocesorem posunąć. Czy można z normalnego, porządnego człowieka uczynić pijaka, pedofila, terrorystę samobójcę? Zmienić komuś orientację seksualną? Wywołać zdalnie raka, cukrzycę, udar lub zawał? Wreszcie czy można spowodować, że kochająca matka zabije własne dzieci? A wszystko to na żywym, ludzkim i najczęściej niczego nieświadomym materiale…Oficjalnie nazywa się to programem kontroli umysłu (mind control). Informacje o tym, jak to działa oraz dokładny opis patentów DARPY, US NAVY czy AIR FORCE, które to umożliwiają, można bez trudu znaleźć w Internecie bądź poczytać o tym w całej serii powszechnie dostępnych książek. Nie jest to bynajmniej wiedza tajna, nawet nie poufna, tylko umiejętnie skrywana. Wystarczy tylko chcieć do niej dotrzećO samym HAARP powstały dwie książki o znamiennych tytułach: „Anioły nie grają na tej harfie” Nicka Begicha i Jeane Manning oraz „HAARP – broń ostateczna Jerry’ego Smitha, co zwięźle pokazuje, jakie cele przyświecały jego powstaniu. Za ojca i największego promotora tej złowrogiej instalacji, dającej Stanom Zjednoczonym niepodważalną hegemonię w świecie, a będącej jednocześnie bronią geofizyczną, klimatyczną i psychotroniczną, uważany jest dr Naftali Berg, wieloletni dyrektor Departamentu Badań Naukowych w Sekretariacie Obrony USA, mózg Pentagonu oraz doradca kilku kolejnych prezydentów Stanów Zjednoczonych. Dr Berg był rabinem, członkiem chasydzkiego ruchu Chabad Lubawitch nazywanym przez swoich współwyznawców dumą lub super bronią Chabadu. Jemu też zawdzięczamy wprowadzenie zasady tzw. „podwójnego zastosowania” technologii wojskowych, czyli możliwości ich użycia także wobec cywilów w czasach pokoju.HAARP jest systemem wielu dipolowych anten zdolnych do emitowania w kierunku jonosfery spójnych wiązek energii bardzo dużych mocy. Po odbiciu od lustra jonosfery można te wiązki fal elektromagnetycznych kierować na dowolny obszar na ziemi. Anteny HAARP mogą pulsować promieniowaniem mikrofalowym z jedną tysięczną jednego Hertza, co oznacza, że instalacja ma możliwość precyzyjnego kontrolowania ludzkiego mózgu w zakresie częstotliwości od 1 do 100 Hz, czyli w paśmie na którym pracuje nasz układ nerwowy.Polskie ofiary tych eksperymentów są na tej Sali i za chwilę kolega opowie, jak wygląda nasza codzienność i z jak wielkim, zadawanym zdalnie, cierpieniem musimy się mierzyć praktycznie każdego dnia. Ja ograniczę się tylko do zacytowania dwóch tytułów wymyślonych przez innego naszego kolegę, członka stowarzyszenia polskich ofiar kontroli umysłu STOPZET, co oznacza Stop Zorganizowanym Elektronicznym Torturom. Ten kolega swój blog zatytułował „Thoughts NOT Mine” (czyli Myśli NIE moje) a kanał na You Tube, który prowadzi nazwał MIND WARS PL (czyli Wojna o umysł).I o to tu tak naprawdę chodzi. Zarówno HAARP jak i sprzężony z nim lada moment system technologii 5G zrodziły się w laboratoriach wojskowych i są środkami do zdobycia totalnej dominacji nad światem. Obecnie te technologie wojskowe przenoszone są do naszej przestrzeni cywilnej, instalowane w naszych miastach i po wsiach po to, żebyśmy zgodnie z założeniami najnowszej doktryny wojennej tak Stanów Zjednoczonych jak i Federacji Rosyjskiej mogli być elementami przyszłego globalnego pola bitwy o wszystko.Dlatego właśnie rozgorzała tak zacięta wojna miedzy mocarstwami o to, czyja infrastruktura sieci 5G będzie wykorzystywana na świecie. Dlatego też wszyscy zaczęli nagle odmieniać słowo „cyberbezpieczeństwo” przez wszystkie przypadki. Nie jest to bynajmniej wojna handlowa, jak usiłuje się to nam wmówić, gdyż te marne 17 kwintylionów dolarów potencjalnego zysku nigdy nie zwróci nakładów finansowych potrzebnych do umieszczenia na orbicie okołoziemskiej 20 tysięcy satelitów geolokacyjnych. To jest wojna o władzę nad światem, gdzie zwycięzca bierze definitywnie wszystko. Przysłowiowa gra końcowa (Endgame).Na antenie NTV możecie Państwo wysłuchać wywiadów z paroma światowej klasy ekspertami od broni najnowszej generacji. Klikając na stronę NTV a potem wchodząc na playlistę Mind Control będziecie mogli zapoznać się z opiniami dr Barry’ego Trowera, dr Roberta Duncana, Marka Steela i innych. Wszyscy oni powtarzają jak mantrę, że 5G nie ma bynajmniej służyć do telekomunikacji, telemedycyny, wprowadzenia samochodów autonomicznych czy zoptymalizowania infrastruktury inteligentnych miast. To co się nam przedstawia jako wielkie atuty tej technologii, to tylko jej poboczne aplikacje, mające umożliwić cel podstawowy, czyli potencjalne wymierzenie w każdego z nas, w każdym momencie naszego życia, wiązki broni energii skierowanej.Do dowolnego zastosowania: do inwigilacji i podsłuchów, do zdalnego odczytywania i modyfikowania wszelkich danych i sygnałów płynących z i do naszego ciała, a tym samym do wpływania na nasze zdrowie i zachowanie. Wreszcie, jeśli taka będzie wola i kaprys tych u władzy, technologia 5G umożliwi przeprowadzenie depopulacji czyli fizyczną eliminację tych, którzy zostaną uznani za zbędnych lub niewygodnych.Tak jak w sztukach Czechowa, jeśli w pierwszym akcie wśród rekwizytów znajduje się strzelba, to wiadomo, że przed końcem sztuki wypali. Dlatego zawczasu zdejmijmy tę strzelbę ze ściany i oddajmy ją szybciutko do Muzeum Bardzo Złych Pomysłów. W przeciwnym przypadku, dzięki satelitom szpiegowskim Ziemia znajdzie się bezpowrotnie w otulinie z mikrofal, &nbsp;a nasze organizmy będą się musiały przystosować do całkowicie sztucznych częstotliwości środowiska technologicznego. Ofiary kontroli umysłu wiedzą jak to jest uciążliwe i jak bardzo „odczłowiecza”, bo funkcjonują od lat w interfejsie mózg-maszyna.Technologia komunikacyjna 5G jest całkowicie odmienna od swych poprzedniczek. Zupełnie inna jest struktura i funkcje anten nadawczo-odbiorczych a także sama architektura sieci. Tak jak przy polu anten dipolowych HAARP, przy antenach typu MIMO kilka a nawet kilkadziesiąt elementów (komórek) nadajnika działa razem, aby generować pole wysokiej częstotliwości zaprojektowane specjalnie dla 5G w celu zwiększenia ich przenikalności. Natomiast zastosowanie szyku fazowanego nadawanego sygnału pozwala na dokładne namierzanie ruchomego celu i skierowanie nań bardzo spójnej wiązki energii o dużej mocyWedług oficjalnej wersji wydarzeń technologia 5G pozostaje w fazie testowej i nie została jeszcze nigdzie wprowadzona na dobre do przestrzeni publicznej. Znowu nic bardziej mylnego, gdyż już od kilku lat w anteny 4G były wbudowywane nadajniki 5G i mamy wszelkie podstawy by twierdzić, że od tamtej pory prowadzi się ściśle tajne wojskowe eksperymenty w oparciu o te nadajniki 5G, system HAARP oraz satelitarny nadzór tak zwanych targetów – ludzkich namierzanych celów.Wszystko wskazuje na to, że także dyplomaci amerykańscy w Havanie i w Kantonie mogli paść ofiarą tego zbrodniczego procederu. Trzy niezależne zespoły lekarzy i naukowców, które ich badały, ogłosiły, że doznane urazy i objawy chorobowe są całkowicie zbieżne z tymi zgłaszanymi na całym świecie przez ofiary kontroli umysłu. Także rozliczne patologie zaobserwowane wśród mieszkańców Gateshead, miasta na północy Wielkiej Brytanii, gdzie potajemnie zainstalowano nadajniki 5G na latarniach ulicznych, wskazują na identyczny mechanizm ich powstawaniaProfesor Beatrice Golomb z kalifornijskiego Uniwersytetu Medycznego w San Diego publicznie stwierdziła, że we wszystkich trzech przypadkach etiologia, a zatem i czynnik patogenny mogą być podobne. Jej zdaniem chodzi tu o znane efekty impulsowego promieniowania elektromagnetycznego o częstotliwości radiowej i mikrofalowej. Podkreśla też powszechnie znany fakt, że fale milimetrowe o wysokiej częstotliwości (95 GHz) są wykorzystywane przez wojsko do nieśmiercionośnej kontroli tłumu (ADS active denial System – aktywny system odmowy) . Technologia 5G znajduje się w tej samej grupie wysokiej częstotliwości (6 GHz – 100 GHz) podczas gdy nasza obecna technologia mikrofalowa 3G i 4G wykorzystuje dłuższe fale.&nbsp;Autor: Ewa Pawela"
		},
		{
			"topic_id": "1EJyEGqxcQNBkoDMyZVtpGhSXzpkdGDnZ1topic2",
			"channel_id": "1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRwch6",
			"user_id": "Eldzmne5REv7w@zv.anonymous",
			"title": "NASZE JEDZENIE.",
			"body": "<p>NASZE JEDZENIE.</p><p>.</p><p>Dodatki do naszego Jedzenia – E- kody.<br>.<br>E-kody na jedzeniu&nbsp;</p><p>. 1. Nieszkodliwe dodatki: E100, E101, E103, E104, E105, E111, E121, E126, E130, E132, E140, E151, E152, E160, E161, E162, E170, E174, E175, E180, E181, E200, E201, E202, E203, E236, E237, E233, E260, E261, E263, E270, E280, E281, E282, E290, E300, E301, E303, E305, E306, E307, E308, E309, E322, E325, E326, E327, E331, E34 , E335, E336, E337, E382, E400, E401, E402, E403, E404, E405, E406, E408, E410, E411, E413, E414, E420, E421, E422, E440, E471, E472, E473, E474 E475 E480&nbsp;</p><p>. 2. Podejrzane dodatki: E125, E141, E150, E153, E171, E172, E173, E240, E241, E477&nbsp;</p><p>. 3. Niebezpieczne dodatki: E102, E110, E120, E124&nbsp;</p><p>. 4. Zaburzenia zdrowia:&nbsp;</p><p><i>.Zaburzenia jelit: E220, E221, E223, E224&nbsp;</i></p><p><i>.</i>Zaburzenia trawienia: E338, E339, E340, E341, E450, E461, E463, E465, E466, lody E407&nbsp;</p><p><i>.Zaburzenia skóry: E230, E231, E232, E233&nbsp;</i></p><p><i>.</i>Zniszczenie witaminy B12: E200&nbsp;</p><p><i>.Cholesterol: E320, E321&nbsp;</i></p><p><i>.</i>Wrażliwość nerwów: E311, E312 *&nbsp;</p><p>.Zgnilizna jamy ustnej: E330 jest najbardziej niebezpiecznym (rakotwórczym) (zawarty m.in. w SCWEPPES CYTRYNOWY, AROMATYCZNEJ MUSZTARDIE, MIESZANCE Z MEZZO, MIĘSIE KRABA, SERIE BONBELOWYM, GRZYBACH w puszkach)&nbsp;</p><p>. 5. Dodatki rakotwórcze: E131, E142, E210, E211, E213, E214, E215, E216, E217, E239 UWAGA: E123 jest bardzo rakotwórczy !! Zakazany w USA i krajach WNP. Zwróć szczególną uwagę na te dodatki do następujących produktów spożywczych: E123 / E110, UWAGA! (Gummy Bears, TREETS, SMARTIES, guma do wina HARIBO, soczewica czekoladowa, budyń śmietankowy ZOTT, paluszki rybne IGLO, dorahm KRAFT z crème fraiche, salami KRAFT, pasta serowa, budyń waniliowy E102, E110, gotowe sosy wszelkiego rodzaju.)</p><p>. 6. UWAGA !!! Dla guanylanów i glutaminianów z serii E600, E605 - trucizna na nerwy PROSZĘ: odłóż słuchawkę i używaj! Chodzi o zdrowie twoje i twoich dzieci. Zapobiegaj stosowaniu tych dodatków, starannie wybierając kupowane produkty. Ostatecznie kupujący decyduje o składzie produktu. Pomyśl o zdrowiu swoich dzieci.&nbsp;</p><p>. 7. Aluminium: E173 (barwnik glinowy), E520 (stabilizatory siarczan glinu), E521 (siarczan glinowo-sodowy), E523 (siarczan glinowo-amonowy), E554 (środek oddzielający, sole krzemionkowe, glinokrzemian sodu), E555 (krzemian glinowo-potasowy), E556 (wapń krzemian glinu), E598 (krzemian glinowo-wapniowy). Aluminium w wodzie pitnej: Wodociągi wykorzystują aluminium jako flokulant.</p><p>.</p><p><i><strong>Skopiuj tę listę i przekaż ją znajomym i znajomym!</strong></i></p><p>.</p>",
			"embed_url": "",
			"type": "topic",
			"added": 1618790735949,
			"body_p": "NASZE JEDZENIE..Dodatki do naszego Jedzenia – E- kody..E-kody na jedzeniu&nbsp;. 1. Nieszkodliwe dodatki: E100, E101, E103, E104, E105, E111, E121, E126, E130, E132, E140, E151, E152, E160, E161, E162, E170, E174, E175, E180, E181, E200, E201, E202, E203, E236, E237, E233, E260, E261, E263, E270, E280, E281, E282, E290, E300, E301, E303, E305, E306, E307, E308, E309, E322, E325, E326, E327, E331, E34 , E335, E336, E337, E382, E400, E401, E402, E403, E404, E405, E406, E408, E410, E411, E413, E414, E420, E421, E422, E440, E471, E472, E473, E474 E475 E480&nbsp;. 2. Podejrzane dodatki: E125, E141, E150, E153, E171, E172, E173, E240, E241, E477&nbsp;. 3. Niebezpieczne dodatki: E102, E110, E120, E124&nbsp;. 4. Zaburzenia zdrowia:&nbsp;.Zaburzenia jelit: E220, E221, E223, E224&nbsp;.Zaburzenia trawienia: E338, E339, E340, E341, E450, E461, E463, E465, E466, lody E407&nbsp;.Zaburzenia skóry: E230, E231, E232, E233&nbsp;.Zniszczenie witaminy B12: E200&nbsp;.Cholesterol: E320, E321&nbsp;.Wrażliwość nerwów: E311, E312 *&nbsp;.Zgnilizna jamy ustnej: E330 jest najbardziej niebezpiecznym (rakotwórczym) (zawarty m.in. w SCWEPPES CYTRYNOWY, AROMATYCZNEJ MUSZTARDIE, MIESZANCE Z MEZZO, MIĘSIE KRABA, SERIE BONBELOWYM, GRZYBACH w puszkach)&nbsp;. 5. Dodatki rakotwórcze: E131, E142, E210, E211, E213, E214, E215, E216, E217, E239 UWAGA: E123 jest bardzo rakotwórczy !! Zakazany w USA i krajach WNP. Zwróć szczególną uwagę na te dodatki do następujących produktów spożywczych: E123 / E110, UWAGA! (Gummy Bears, TREETS, SMARTIES, guma do wina HARIBO, soczewica czekoladowa, budyń śmietankowy ZOTT, paluszki rybne IGLO, dorahm KRAFT z crème fraiche, salami KRAFT, pasta serowa, budyń waniliowy E102, E110, gotowe sosy wszelkiego rodzaju.). 6. UWAGA !!! Dla guanylanów i glutaminianów z serii E600, E605 - trucizna na nerwy PROSZĘ: odłóż słuchawkę i używaj! Chodzi o zdrowie twoje i twoich dzieci. Zapobiegaj stosowaniu tych dodatków, starannie wybierając kupowane produkty. Ostatecznie kupujący decyduje o składzie produktu. Pomyśl o zdrowiu swoich dzieci.&nbsp;. 7. Aluminium: E173 (barwnik glinowy), E520 (stabilizatory siarczan glinu), E521 (siarczan glinowo-sodowy), E523 (siarczan glinowo-amonowy), E554 (środek oddzielający, sole krzemionkowe, glinokrzemian sodu), E555 (krzemian glinowo-potasowy), E556 (wapń krzemian glinu), E598 (krzemian glinowo-wapniowy). Aluminium w wodzie pitnej: Wodociągi wykorzystują aluminium jako flokulant..Skopiuj tę listę i przekaż ją znajomym i znajomym!."
		}
	],
	"next_topic_id": 3
}