{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1578268512,
			"title": "Snowden's Revelation and Result",
			"body": "Was it worth it? Exposes a vast unconstitutional conspiracy to save the internets, and ends up in exile. Is this guy just naive? a bit slow? or overly idealistic? The American gov made new laws to make legal what what was and still is unconstitutional, and the only thing Snowden proved was, yes we are in a surveillance state. The Patriot Act provisions keep getting extended...fucking TSA its been 20 years now!! the FISA courts are still a rubber stamp....500,000,000 phone taps OK'd by one warrant WTF! Why are people not going down to the CIA, NSA, data centers and screaming murder, instead of groups of fat neck beard men, and purple haired 400lbs lesbian apes sitting on the corner talking about PEACE......go have another candle lighting ceremony like in Chicago for those who are shot, fake fucks!",
			"added": 1578268511
		},
		{
			"topic_id": 1588273161,
			"title": "Bakersfield Drs. Dan Erickson and Artin Massihi Condemned on MSM.",
			"body": "https://calmatters.org/health/2020/04/debunking-bakersfield-doctors-covid-spread-conclusions/ \nSeemed that they only disputed where the numbers came from, but I don't see how that would disprove what these doctors were saying.",
			"added": 1588273159
		},
		{
			"topic_id": 1589664235,
			"title": "Senate Votes to Allow FBI to Look at Your Web Browsing History Without a Warrant",
			"body": "https://www.vice.com/en_us/article/jgxxvk/senate-votes-to-allow-fbi-to-look-at-your-web-browsing-history-without-a-warrant\n\nVPN check, air gapped laptop check, TOR plus VPN check, bleachbit check, P2P encryption check, mobile phone vpn check, faraday cage for phone check, cellphone jammer check, GPS jammer check, radar detector check, laser jammer check, RFID protection check, using same password check, same username check, deleted twitter check, but not facebook check,",
			"added": 1589664232
		}
	],
	"topic_vote": {
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1580821606_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1580758021_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	},
	"next_comment_id": 37,
	"comment": {
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 1,
				"body": "Start eating, Iran will launch some cyber attacks, shoot some AK-47s into the air, a couple of dumb fire missles/morters, and probably get pissier, protective and more bold in the use of its navy, but that's it. It will help Trump get elected! No Obababo/Biden FBI, CIA, making up laws, illegal executive grabs of power, Democrat politicians getting sweet deals in Ukraine.",
				"added": 1578267463
			},
			{
				"comment_id": 2,
				"body": "Trump is about as Zionist as Muhammad.",
				"added": 1578267696
			},
			{
				"comment_id": 24,
				"body": "No more Democrats spewing their anti-American, counterculture, bullshit demagoguery leaders like Nancy Pepsi or Hillllllary Clintox. What happened to Seth Rich, oh he slipped on Banana peel died. Nancy Pepsi is married the sausage king  of California. And John Heinz Kerry provides the ketchup, while David Duke, makes everything taste all white.",
				"added": 1585387015
			}
		],
		"1578268512_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 3,
				"body": "the internet would have come about eventually, anyways I doubt the guy who designed it would have done so knowing shitlords like Bush,Obaobobo, Clapper would turn it against their own countrymen.",
				"added": 1578270283
			},
			{
				"comment_id": 4,
				"body": "> [fib](#comment_49_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): Go to the gates of your closest military base and camp out. Say what you think is wrong if you get asked. Hold a sign if you don't want to talk. [...]\n\nSlaves are the lowest form. If you think you can get by read what the Romans thought about and did to the slaves they captured in battle. Better to die.",
				"added": 1578276923
			},
			{
				"comment_id": 5,
				"body": "> [fib](#comment_51_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): Then all of us Americans were born to die. There's nothing left to build for anyone whose life matters enough to justify the resources they will consume.\n\nSo we have souls and rights and a constitution that recognizes and organizes a confederation. But, if we have a leader that can dictate the future course of a nation based on his own common sense, then anyone's judgement would do just the same. Watching the Golden Globes; Ellen DeGeneres gets recognized for being a homosexual, and oppressed, Global Warming is mentioned over and over and over, and the people fleeing Australian wildfire are shown great sympathy.......Meanwhile in Russia.......Edward Snowden sits in a cold apartment, watching the snow fly, and his life slowly extinguish.",
				"added": 1578280147
			},
			{
				"comment_id": 6,
				"body": "> [sfs9](#comment_1_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): I have 2 aspects to it. First of all, the Edward Snowden's behaviour is as American as it gets. The shoddy escape planning, the sincere belief that if the ills of the Government are revealed to the public, then things will be OK and fixed, the sincere American patriotism of accepting the risks just in the name of doing the Right Thing for the America. In my view, he is certainly a hero, but unfortunately slightly stupid, naive hero. Was it worth it? Not the way he expected it to be, but in an unexpected way HUGELY WORTH IT. The way he was treated by the U.S. government and the various European governments PROOVED that in reality in the 21. century there is no way to tell publicly about the ill-doings of the Western governments without being the target of repressions. With China, Russia, Arab states that's kind of granted, but the fact that it also holds for the Western governments, not just the U.S., was TOTALLY NEW INFORMATION and interestingly I haven't read or heard the Edward Snowden itself ever talking about that aspect of his case. He just talks/writes about the revelations and mass surveillance, but the mass surveillance part is kind of irrelevant in a sense that thehttps://en.wikipedia.org/wiki/ECHELONwas public knowledge long before his revelations became public and already in year 2003 or so we (as students) were told at our cryptography lecture that a good way to design software is to apply encryption whenever possible, because if there is an opportunity for some party to abuse the situation, it will get eventually abused. So, from that point of view, the existence of the mass surveillance project does not really change anything, because, well, if the software developers did their job properly, the agencies may try what they may, they would just not succeed. The key lengths, strengths of crypto algorithms can also be bumped up with some spare strength without knowing almost anything about the surveillance projects, because the minimum feature size of digital logic microchips and therefore their maximum computational power is public knowledge. It's obvious that the agencies have the money to create their own custom crypto breaking chips, so the key sizes that are not reachable for the agencies are kind of calculable without any leaks. [...]\n\nYes I agree the western democracies backed off like cowards. I believe they got used to the status quo, and western \"democracies\"/monarchies; people had no rights. And we knew about Echelon way back in the 70s, 80s. But for America right now,  congress is a rubber stamp, the judicial system defers to congress and the government, leaving nothing else but the executive.   Was Bush the guy that crossed the Rubicon or was it Obama, or did the fall start a long time ago? Are the good guys really the \"good guys\" anymore? In my opinion no. \n\n",
				"added": 1578371288
			},
			{
				"comment_id": 7,
				"body": "> [aspidochelone](#comment_311_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I think Snowden's \"revelations\" were all stuff we knew already.  The effect was to get the courts to start using the information in court because it was no longer \"secret\".  He never told us about shit we know is going on, like antivirus software scanning your hard drive for secret/classified information, or mobile phones using directional antennas to watch you in your room.  And then ... he ended up hanging out in Russia as a dissident. [...]\n\nCourts won't touch it. Look at the results of the suit against AT&T. The court said \"we can't act without proof\" and the government made the proof top secret. All we have is an executive who can write presidential orders and can pick justices, since congress is a rubber stamp.",
				"added": 1578372651
			}
		],
		"1578585187_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "I aspired to the purity of the blessed machine. Your kind cling to your flesh as if it will not decay and fail you. One day the crude biomass you call a temple will wither and you will beg my kind to save you. But I am already saved. For the Machine is Immortal.",
				"added": 1578609248
			}
		],
		"1578171577_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 9,
				"body": "Meanwhile in America......student tuition climbs higher, auto loans climb,  debt peonage soars, the NSA, FBI, CIA, violate your constitution, create permanent records from your DNA, metadata, and stage an open coup against an elected president, with the help of your elected leaders, under the guise of \"abuse of power\" and \"ignoring congress\" LOL hahaha as if there actually was a congress, its really just a rubber stamp, the judiciary is useless depending on who the dictator in chief decides to stack the court with...Yeah not really caring about Iran....",
				"added": 1578622865
			}
		],
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 10,
				"body": "Porn, passwords, warez, credit card generators, scripts, gossip...all the stuff I miss from the way the internet was",
				"added": 1578623260
			}
		],
		"1579208009_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "Try sleep deprivation. You'll be depression free for a short time.",
				"added": 1579500434
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 13,
				"body": "Don't watch anything above year 2000 with some exceptions. There's plenty of movies made in the last 80 years to tell every story without the politically correct propaganda bullshit.",
				"added": 1579583028
			}
		],
		"1579602906_1JH7GXsReuXYWoJKuREooRvjbWP15sMN2N": [
			{
				"comment_id": 14,
				"body": "PSP playstation single player, fuck the NSA, we are human there's always a mistake, always",
				"added": 1579854967
			},
			{
				"comment_id": 15,
				"body": "PSP playstation single player, fuck the NSA, we are human there's always a mistake, always",
				"added": 1579855082
			}
		],
		"1580186317_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 16,
				"body": "Canadian Bacon.....Think of your children pledging allegiance to the maple leaf. Mayonnaise on everything. Winter 11 months of the year. Anne Murray, all day, every day.",
				"added": 1580264910
			}
		],
		"1580225894_1LyfppYhaZN1PyhrN6TM8hTkEX6BHMBX6u": [
			{
				"comment_id": 17,
				"body": "Developed countries don't need to allow immigrants AND foreign trade to be successful.",
				"added": 1580265059
			}
		],
		"1581116791_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": [
			{
				"comment_id": 18,
				"body": "Hunter Biden smoking crack and snorting cocaine off of Burisma Company's executive boardroom table, while getting 1.5 billion for sitting on his ass playing with a yo-yo, while Nancy Pelosi is crying her eyes out about America being taken over by a power hungry president with what little fluid her mummified, botox injected, living corpse like body has left. The Ammerican president checking with the new Ukrainian President, a county known for corruption about 400 billion$ in aid is being responsible not quid pro quo. Now the Democrats using the FBI to oust a democratically elected president, there's a really good image of how corrupt and power ridden American politics is, lets not forget the FBI acquitted Hillary for nothing when they had tons, mountains, of evidence against her.",
				"added": 1581311836
			}
		],
		"1582649582_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 19,
				"body": "USA isn't \"puritanical\" its christian, but increasingly agnostic. The American government consists of the legislative, executive, and judicial with more weight being put on the executive and judicial. The current trend of counterculture activists using the judicial system as a sledgehammer to further their causes, by passing laws increasingly in favour of their issues. Feminists in America and the laws they have instituted favouring women over men, and the justice system's employees taking the idea of \"attacker\", \"victim\" have given women in general  an advantage. Such as Weinstein, Cosby...etc a woman finding herself with a picture naked, even if fake, would be dealt with harshly as a consequence.",
				"added": 1582670390
			}
		],
		"1583203227_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 20,
				"body": "Computers and secularism are a two dimensional look at life.",
				"added": 1583463080
			}
		],
		"1583777872_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 21,
				"body": "On a control panel you see a big red button labeled \"Don't Push\". What do you do? You answer the phone only if you know who's calling.",
				"added": 1583867329
			}
		],
		"1583980969_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 22,
				"body": "Red Flags: marriageable women are 26 and under, anything over and single probably has mental or emotional problems. Single mothers, taking care of another man's spawn is emasculating. Women with crazy mothers, since the daughter is probably nuts too. Any women who threatens self abuse or rape to force a relationship. Body index considered overweight, under weight prefered. Women with guy friends only. Women with no friends. Feminists. Aggressive behavior, loud, noisy, bossy or controlling. Partner count of over 6 by 25. Women who have a reputation as a whore. Women who've had a previous relationship and cannot let go. Women that have advanced education, or earn a high salary since they will likely choose the career over you. Women that are taller than you (somewhat subjective). Women that do not shave. Drug addicts. Women who are open to having a threesome, since for some reason it fucks them up emotionally. Gold diggers. Stay within your own race (somewhat subjective). These demons are fuck material and nothing more, since you cannot make a wife out of a slut. Choose young before she can commit these mistakes, and always wear protection and prenuptial if marrying since you will go bankrupt after a divorce.",
				"added": 1584147378
			}
		],
		"1584618126_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 23,
				"body": "Weird, when a woman rapes a boy without consent, or has sex with animals, society, or maybe just men, consider the victim to be lucky. Man puts his penis into a cow's vagina, or forces a horse to fuck him in the ass, and suddenly its animal cruelty. Maybe the whole feminist thing is bullshit, maybe women of domestic violence aren't victims, maybe they want to be beaten; women have fantasies of rape, and she can provoke an argument into violence. The western \"ladies first\" thing needs to be rethought. Not the concept, the execution. A woman needs to act like a lady first before she is given the privilege of being treated like one.",
				"added": 1585186704
			}
		],
		"1585516116_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 25,
				"body": "Scared shitless about the economy. Watched what happened during the last recession, and see it happening it all over again. Not as scared about the Chinese virus as I am people commiting suicide, families getting booted, men lining up for work, homeless camps appearing.",
				"added": 1585688354
			}
		],
		"1585684832_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 26,
				"body": "So this Snowden shit started with Clinton? I thought it was Nixon and the FISA courts. Clinton, Bush, Bush Jr., Obama, Trump. For all their bullshit about draining the swamp and preserving the Constitution, they continue  making laws that undermine those freedoms.",
				"added": 1585790465
			}
		],
		"1586990520_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [
			{
				"comment_id": 27,
				"body": "What does money mean anymore? Let's have a universal income, fuck it.",
				"added": 1587063486
			}
		],
		"1588273161_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 28,
				"body": "https://www.bitchute.com/video/bU8XWFlo8cNN/",
				"added": 1588389179
			},
			{
				"comment_id": 29,
				"body": "So.....let us sum the vid up. 1. wearing a mask won't help 2. social distancing doesn't help 3. staying inside doesn't help 4. all those things will make your immune system weaker 5. if you're old or really young then yes do those things in 1-3. 6. don't fucking repeat the word SAFE or SAFETY its propaganda. 7. Buy a gun.\n\nNow then. Did this virus come from the food market in Wuhan or the Lab only 900 ft from the food market? What about the Chinese couple who got kicked out of Canadian virus lab? What about those virus samples sent to Wuhan lab? What about the missing lead chinese scientist working on viruses in bats, patient zero? Why did China at first say it was man made? Then said it was from a food market? WTF is China doing in the South China Sea on those islands while we talk about the virus? Why are the USA marines getting rid of their Abrhams tanks and focusing on China suddenly? AND MORE IMPORTANTLY....universal income, and electronic money as a means of control. There are no bills higher than $100 in circulation.",
				"added": 1588455496
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 30,
				"body": "Zeronet is neeeeeither. It just so happens that the people who take issue with the government find themselves on the margins of society, along with other \"undesirables\", anti-social computer nerds, boys who get addicted to internet porn, and intellectual neurotic introverted neurotics.",
				"added": 1588462663
			}
		],
		"1589664235_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 31,
				"body": "So nice of them to do this while everyone is unemployed, and being denied their civil liberties cause \"virus\".  Well my friends, the only way the government will stop is when they do not have the resources to do so, and when left and right wing stop wanting more fucking \"SAFETY\". (I hate that damn word! It's an excuse for everything!) The only way that's going to happen is during struggle, strife, famine, WAR. I think instead of making laws, politicians should be finding ways to reduce laws. That was the purpose of the checks and balances...",
				"added": 1589675620
			},
			{
				"comment_id": 32,
				"body": "Lets us not forget....our fallen brothers who have watched CP or downloaded cartoons of CP and gone to prison. Disgusting? Yes. Criminal? Absolutely not! Yes women are the problem, but so is bad weather, taxes, and swarms of locust; They are all forces of nature, which we must ready ourselves for. Which is why I have a camera in my car, home, bedroom, and not that Amazon or Chinese crap either. Which brings us to another topic altogether. RFID skimming. Something everyone overlooks, harmless, innocent, fast, cheap, but huge consequences down the road.",
				"added": 1589771952
			},
			{
				"comment_id": 35,
				"body": "https://sourceforge.net/projects/nfcproxy/\n\nSkim away!",
				"added": 1589772347
			}
		],
		"1589742530_19ZUAyEjVPBC7EDfQoBfaugohL6HzE1qWt": [
			{
				"comment_id": 33,
				"body": "Facebook? that's so 2000...",
				"added": 1589772039
			}
		],
		"1589765373_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 34,
				"body": "There's no peers so...",
				"added": 1589772084
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 36,
				"body": "A troll strikes again!",
				"added": 1608046430
			}
		]
	},
	"comment_vote": {
		"1_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"10_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"8_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"23_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"23_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": 1,
		"2107_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"53_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"24_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": 1,
		"51_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"59_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"56_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"11_1DN3VWX7wRD71B6i3GYvVkBXzJWWUGFb1Q": 1
	}
}