{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "p2p网络：靠众人之力形成的网络",
			"body": "",
			"added": 1522843435,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "老司机发车为何不用eD2k了?谈eD2k和电驴的兴衰",
			"body": "如果你在秋名山身经百战，那么一定会知道“电驴”这个词。在很多人的印象中，这是一度非常流行的下载软件，所使用的是“eD2k”开头的专有下载链接。但是近几年，“电驴”和eD2k渐渐走向了衰落，近几年司机们飚车越来越少使用eD2k，反而Magnet磁力链接成为了常态。\n在离线下载任务框中，电驴还写在磁链前面，但事实上人们更常用磁链，这是为什么呢？\n\n　　很多用户就会有疑问，虽然“电驴”的开发商和运营者VeryCD已经转型，网络少了一个eD2k资源的宝库，但为何其他站点也越来越少用eD2k呢？eD2k和Magnet磁链用起来似乎并没有什么不同，大家都可以用迅雷旋风之类的工具下载，eD2k甚至还更早被离线下载所支持，为什么大家都远离了eD2k？今天，就一起来谈谈这话题吧。\n\n　　你真的了解“电驴”和eD2k吗？\n\n　　要谈论eD2k，首先需要了解“电驴”的历史和本身。实际上，人们最熟知的VeryCD电驴，并不是原始意义上的电驴，而且VeryCD电驴有沽名钓誉之嫌。电驴的历史可以追溯到VeryCD远未诞生的2000年，MetaMachine公司开发了一款名为“eDonkey”的软件，翻译过来就是“电驴”的意思——这才是真正意义上的电驴。\n大家都习惯于把VeryCD电驴当成下载软件，但需要强调的是，eDonkey电驴并不是一款下载软件，eD2k链接也不是为下载而生的。eDonkey电驴是一款共享软件，首次使用了eD2k构建eDonkey网络，任何文件都可以生成对应的eD2k链接，分享给所有使用eDonkey网络的用户。一旦你在eDonkey电驴中共享某个文件，该文件就会生成对应的eD2k链接，其他人也可以在eD2k网络中搜索并下载到你共享的文件。\n\n　　在2002年，有个德国开发者不满足于eDonkey电驴的功能，开发出了支持eD2k协议的第三方开源客户端——eMule，也就是大家所说的电骡。电骡加入了大量eDonkey电驴不支持的新功能，特别是支持KAD网络，这可以说是让eMule彻底有别于eDonkey电驴的根本原因。\neDonkey电驴所使用的eDonkey网络，虽然也是基于P2P共享，但是仍然离不开中央服务器。一群人使用eDonkey电驴进行文件共享，必须要有中央服务器来作为通讯中心，为用户提供查找文件等服务。而KAD则是更彻底的P2P，只需要用户作为节点，用户之间能够直接连接，完全脱离了中央服务器。\n\n　　KAD网络对于eD2k协议的意义非凡。在2004年，eDonkey电驴由于版权方面的控诉停止开发，eDonkey网络中的中央服务器成为了eDonkey电驴涉及盗版的证据。而开源的eMule电骡，一方面没有涉及商业活动，另一方面支持KAD网络，用户之间共享盗版可以推给是用户的自发行为，因此得以经受住版权商的压力巍然不动。\n\n　　到这里，我们可以稍微整理一下电驴、eD2k的关系了。\n\n　　eDonkey电驴：电驴原版，商业软件，可通过eDonkey网络共享文件。\n\n　　eDonkey网络：利用P2P技术构建的共享网络，但需要中央服务器建立连接。\n\n　　eD2k：eDonkey网络所使用的协议，eDonkey网络所共享的文件会生成eD2k开头的链接。\n\n　　eMule电骡：eDonkey电驴的第三方客户端，开源软件，除了支持eDonkey网络，还支持KAD网络。\n\n　　KAD网络：更彻底的P2P共享网络，不需要中央服务器，和eDonkey网络互联，协议也是eD2k。\n\n　　好了，我们继续往下说VeryCD电驴吧。\n\nVeryCD电驴：推动eD2k在中国流行\n\n　　说到电驴/电骡在中国的流行，VeryCD版“电驴”是绕不过去的。很多朋友都知道VeryCD，上面的海量资源相信大家都有所耳闻。不过实际上，VeryCD的站点上并没有储存着浩如云烟的资源，上面的资源实际上是eD2k链接。不得不说，有这样一个站点实在是十分方便，直接通过eMule搜索eD2k网络，资源可是多如乱麻，你只能通过关键字来搜索，遇到标题党，还会下到葫芦娃。\n\n　　VeryCD把eD2k资源进行了整合，建立起了eD2k分享平台，一度成为了中国大陆浏览量最大的资源分享网站之一。既然涉及了eD2k资源的业务，VeryCD自然也会推出相应的客户端——很难想象自己的站点需要外链到其他网站来下载客户端，才能使用站点的服务，对吧？于是，VeryCD就拿eMule来开刀了。\n\nVeryCD已经转型，以前提供了大量eD2k链接，促进了“电驴”在中国的流行\n\n 　　前面提到，eMule是一款开源软件，这给VeryCD提供了根基。VeryCD使用了eMule电骡的源代码，开发出了VeryCD电驴，这也是中国网民最熟悉的“电驴”。和eMule电骡相比，VeryCD电驴更易上手，不需要进行复杂的配置，也不需要钻研什么共享，直链VeryCD网站的资源，因此在国内广受欢迎。一时间，VeryCD电驴大有成为装机必备之势，eD2k和“电驴”在中国的兴盛，到达了顶峰。\nVeryCD电驴在一开始还保留KAD网络的搜索，后继版本就只能搜索VeryCD自身了\n\n　　好景不长，从2009年开始，中国加强了网络版权把控，VeryCD被迫转型，撤下了几乎所有的eD2k共享链接。依凭于VeryCD网站的VeryCD电驴，失去了立足的根本，自然而然隐没在了历史的潮流中。\n\n　　不过，尽管VeryCD电驴退潮，但eMule电骡和eD2k依然没有倒下，毕竟它们依仗的是eD2k网络。只要有人在用eMule共享文件，eDonkey和KAD网络就仍会在运行。按理说，这是一个近乎完美的P2P资源共享架构，然而在这些年，eD2k链接的热度却也在明显下滑——eMule原版从五年前每周70W的下载量，下降到了仅仅2W多。在很多资源站上，提供的都是Magnet磁链或者BT种子，eD2k并不是老司机开车的主流。\n在离线下载盛行的现在，正统的BT软件例如μtorrent还有人玩，但用正统eMule下资源的，恐怕真的是非主流中的非主流了。为何eD2k不如BT受欢迎？这要从它俩的根本区别说起。\n为何人们不再爱用eD2k？\n\n　　虽然都是一串链接，但eD2k和Magnet磁链有着根本性的不同——eD2k对应的eMule电骡是一个共享软件，而Magnet磁链对应的BT软件则是下载软件。这让它们在使用上，有着很多根本性的区别。\n　前面提到，eMule实际上是一个共享软件，eD2k协议为共享而生。正统eMule的使用流程和BT有着巨大区别，它一般是这样子使用的。\n\n　　开启eMule后，第一件事做的并不是什么下载，而是设置共享目录，该目录中的所有文件，都会实时共享到eDonkey和KAD网络中。目录中共享了的文件都会生成eD2k链接，所有人通过相应的eD2k链接，都能够拿到你共享的文件，一旦有人下载相应文件，那么你的eMule客户端就会上传数据。我们平时使用eD2k链接下载，资源也是来自他人eMule所共享的文件的。当然，共享目录中也可以啥都不放，但很多eMule客户端都拥有队列优先级机制，上传得少，下载速度也会被限制。\n设置好了共享目录后，需要配置upnp以获取HighID。在eMule中，HighID能够更直接地进行P2P传输，无论是上传还是下载还是资源搜索，都更有力。此外，要在eMule中获得比较好的体验，还需要设置防止吸血客户端的IPFilter、设置一个可靠的eD2k服务器更新列表等等。可以说，eMule的使用非常繁杂，如果你只想简单下载点东西，eMule完全不适合你。\n和eD2k相比，基于BT网络的Magnet磁链就简单多了。BT为下载而生，某个资源只要有人在进行相关的下载上传任务，就可以源源不断地流传了，BT软件的客户端也不需要额外的设置，只要添加Magnet磁链就可以运转。另外，eD2k的共享是基于文件的，而BT任务可以基于文件夹。只需要一条Magnet链接，就可以下载到整堆整堆的文件，这点eD2k链接做不到。\n\n　　简而言之，eD2k的特点，决定了它处处受制，具体体现如下。\n\n　　◆eD2k的正统客户端eMule配置复杂，难以上手。\n\n　　◆eMule一旦开启，默认会不断上传共享了的文件，这种大流量的上传任务，并不适合中国上传带宽较窄的互联网。一些运营商为了减少上传的压力，甚至直接封杀了KAD协议，让eMule无用武之地。\n\n　　◆eMule封杀迅雷旋风等吸血客户端。迅雷等客户端有吸血机制，从eMule拿数据，但并不回传数据给eD2k网络，这让很多eMule客户端都使用IPFilter封杀了迅雷。不少人发现迅雷下eD2k下不动，渐渐也就不用eD2k的链接了。\n\n　　◆HighID越来越难以获取。在eMule中，HighID会获得比较快的速度，但这需要公网IP。现在运营商普遍给用户提供内网IP，这限制了eMule的传输效率。\n\n　　◆一个eD2k链接只能下载一个文件。与之相比，BT一个任务可以下载多个文件。下载资源合辑的时候，一个磁链总比一行行eD2k链接方便。\n\n　　另外，eMule的真正作用在于共享，但国人很少意识到这点。看到eD2k链接，很多人的第一反应就是用迅雷等工具去下载，这在无形中也破坏了eD2k网络的共享生态。种种原因下，eD2k尽管还有人用，但流行度就远不能和Magnet磁链相比了。\neD2k实际上比磁链更优秀，利用eMule就可以搜索全网的eD2k资源，而磁链则不能\n\n　　总结\n\n　　从技术的角度来说，eD2k协议要比Magnet磁链更加先进。eD2k网络不仅可以共享文件，还支持资源搜索、通讯等功能，可谓是个能脱离HTTP存在的理想P2P网络，很能体现“人人为我，我为人人”的精神。不过，eMule繁杂的配置令很多人望而却步，少了VeryCD的推动，eD2k越来越远离主流网民的视野。也许将来出现更易用的客户端、网络带宽进一步发展后，eD2k能够重新兴起吧。",
			"added": 1522933031,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "BT已死离线当立？谈离线下载和P2P的兴衰",
			"body": "虽说大家找资源的时候，口头满怀感情道出的那句依然是“求种”，但实际上，这两年真正使用BT下载的人是越来越少了。在数年前，最热门、最劲爆的软件列表中，你总能够看到各种BT下载软件，如比特彗星啦，比特精灵啦等等。这些BT下载软件一次又一次地刷透人气榜，而迅雷、快车等下载软件，也莫不将支持BT下载作为最大的卖点。\n和数年前相比，BT的关注度可谓一跌再跌\n\n　　流行就如同是往返不定的季风，几年过去，BT软件制霸用户下载的时代已是远离。纯BT下载软件热度每况日下，年轻一些的朋友，应该没怎么经历过盯着BT种子健康度慢慢上升、心中暗爽这类事情了吧。当年为人所津津乐道的BT、eMule慢慢淡出网民的视野，有多少人还记得这类DHT分布式下载网络，曾让人发出过“下载从此摆脱中央服务器”的欢呼？人们大概没想到，中央服务器不仅没死，这两年居然还能节节反攻。乖乖掏腰包买离线下载服务，成为了很多人的日常。\n离线下载取代了BT、eMule等P2P传输，成为了最流行的下载方式\n\n　　凭借着离线下载，中央服务器没有像当初人们预想的那样，被P2P这张大网缠住，反而将P2P用户群冲得有点支离破碎。在从前，人们发现中央服务器不靠谱，大家团结就是力量，纷纷携手P2P。渐渐地，人们发现离线服务器这样的中央服务器居然能比P2P更加靠谱，有道是自从有了渣雷，妈妈再也不用担心冷门资源断奶了。绝大部分人从不乐意花钱购买正版，但愿意付费买离线下载服务弄盗版的大有人在，离线下载的魅力也从此可见一斑。\n付费购买离线下载服务，已经成为了中国互联网最常见的消费行为之一\n\n　　的确，和P2P相比，离线下载拥有非常多的好处。首先，使用离线下载，等于是离线下载服务器代劳你参与P2P——买手机有人肯花钱雇人排队，下东西花点钱让服务器帮忙，也十分正常；其次，从离线服务器中下载文件，速度要比P2P靠谱得多，平心而论，下完就跑的绝对是大多数人；再者，中国毛细血管一样的上传网络并不适合P2P，不是做种不用心，奈何ADSL不给力啊。\n上行带宽不足的ADSL，更加适合从中央服务器直接下载而非P2P传输\n\n　　离线的红火衬托出了BT等P2P传输的冷清，曾经的叱咤网络的枭雄们看着用户乐滋滋下载来自BT软件的种子，又眼睁睁地看着种子投奔到了离线下载行列中。P2P下载在普通用户间的热度一落千丈，有人甚至放出神论，称P2P已死，离线下载才是未来。\n\n　　然而事实是否真的是这样吗？BT、eMule等P2P真的已经行将就木了吗？“人人为我、我为人人”，DHT分布式下载曾承载过乌托邦般的梦，共享主义的理想是否真的已经被商业承托、以离线下载为代表的中央下载服务器击得粉碎？\n离线下载的风行的确已经慢慢让普通用户嗅不到BT等P2P下载软件的味道，但这是否意味着P2P已经是时候退出时代的舞台了呢？答案是清晰而又明确的，不是。虽说BT等P2P下载正在衰落，但离消亡的终点还有十万八千里不止。\n\n　　虽然BT软件的流行度的确已经大不如前，但这并不代表BT的热度已经完全消退。大范围的P2P在中国已经退潮，但小范围的浪涌却未曾平息，甚至这两年还愈演愈烈。BT有一种特别的扩展形式，名字叫“PT”，也就是私有服务器“Private Tracker”的缩写。PT可以让人们在小范围内进行私密文件分享，通过流量统计可以进行更加严格的资源管理——这意味着你再也不用担心在PT中下到葫芦娃了。\nPT站点往往都有严格的管理系统，内容及其传输都受到严格控制\n\n　　使用PT私密分享的内容往往会比公网流传的来的精彩，在这个高清时代，蓝光原盘之类的资源无疑极具诱惑力。离线下载可以弄到公网BT的内容，但对PT却无能为力。PT凭借着自身的良好生态，在小范围内混得风生水起。\n\n　　不过，就算抛开PT不谈，要说离线下载能将BT淘汰，这说法也太过不切实际。离线下载的资源，来自P2P的数都数不清。除非迅雷、旋风之类的能够亲自给你生出资源，不然用着离线下载说BT会被淘汰，就如吃着碗里的说种地过时，未免也太忘本。\n离线下载对普通用户来说的确比P2P更好用，但其根源还是P2P\n\n　　饮水思源，离线服务器也只是BT、eMule等P2P网络中的一环，而且往往是带吸血性质的一环。离线下载的兴旺，本质上并不是中央服务器重新压制了P2P，而是中央服务器借助P2P的力量再次崛起。没有P2P，离线下载根本不可能如此枝繁叶茂。\n离线服务器往往是P2P网络中吸血的一环，只下载，而不向P2P网络上传\n\n　　所以，问题到这里就变成了，BT、eMule等P2P下载软件，风头是否还有机会再次压过离线下载？DHT分布式网络构建起的资源分享王国，是否有机会再次复兴？\n　实际上，历史曾经给我们这个问题的参考答案。eMule是世界上最流行的P2P网络之一，和BT的流行度不相上下。从eMule的发展史中我们可以看到，eMule的兴旺发达离不开中央服务器的倒下。eMule的前身是eDonkey，和eMule不同，eDonkey虽然也可以利用P2P下载，但却无法摆脱中央服务器。eDonkey盛极一时，然而树大招风，大树挨刀，由于拥有太多涉及版权的内容，eDonkey在2006年被迫赔偿3000万美元并停止开发。而无需依赖中央服务器的eMule，则蒸蒸日上。\n只要中央服务器倒下，整个下载服务都会瘫痪，而P2P（左）则没有这个问题\n\n　　毫无疑问，背后有大规模商业公司作为支撑的中央服务器是强大的，然而与此同时它又是脆弱的。中央服务器的强大在于它是很强很大的一个点，比分散在P2P网络中的每一点都要强。但是，正是由于它只是一个点，所以中央服务器一旦倒下，它所构建的网络会全数灰飞烟灭。也许只有在版权意识单薄的中国大陆，离线服务器和网盘这类的提供下载服务的中央服务器才有机会承载起如此巨量的盗版资源吧。西方国家密密麻麻的DHT节点，也印证了涉及版权问题的中央服务器，没法在法规健全的社会中生存。\n    P2P网络的强大不仅在于它能覆盖每一个使用它的用户，更在于它只需要用户。eDonkey的倒下见证了中央服务器的脆弱，但只要有一个使用eMule的人，他所依凭的KAD网络却不会消失。这几年，中国的版权管制也逐渐开始收紧，一批批涉及非法版权内容物的网站被整顿或者洗白，你能看到百度MP3变成了正版授权的百度音乐，优酷土豆等视频站上的盗版内容被删除并替换成为正版授权视频。这不禁让人心生疑虑，离线下载和网盘服务器中的海量盗版内容，还能生存多久？\n  有用户就有P2P，P2P一直未曾消亡，在人们需要的时候，P2P会重新兴旺起来\n\n　　BT、eMule等P2P下载从未消亡，也几乎不可能消亡。只要互联网存在，P2P就不会绝迹。离线下载或者版权管制也许能够降下P2P的热度，但却无法彻底冻结P2P。在版权日趋收紧的大环境下，谁能保证离线下载会一直提供如此多的内容下载并保持火热？也许到那时P2P会重新兴起吧。当然，最后还是要说一句，传播盗版终究是不对的，保护知识产权，人人有责。",
			"added": 1522934095,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "网盘/离线不靠谱？离线下载越来越坑该换用啥",
			"body": "最近几年，网盘/离线下载悄然兴起，如果哪个下载工具不带有离线下载功能，那它几乎就无法进入主流用户的视野。人们纷纷抛弃了传统的下载方式，乖乖缴上了离线下载的会员费，BT、eMule等P2P下载似乎变得门可罗雀，看着就像是一副药丸的样子。\n\n然而，形势正在发生变化，网盘/离线下载在这个内容管控日益严密的今天，慢慢变得有点寸步难行。从115网盘的分享关闭、百度云的8秒教育片事件，到最近的QQ旋风停止营业，离线下载正一点点冰凉着司机们的心。\n\n为什么会变成这样子呢？第一次有了全能的下载工具，让人不必再受繁杂的下载协议所困扰；第一次有了高速得难以想象的离线下载服务器，让人不必再眼巴巴对着冷门资源苦苦等待。\n\n两种下载方式结合在一起，造就出了中国特色的下载神器，本以为抛弃BT、eMule等传统下载、随时随地用电脑手机开车的日子已经触手可及。然而迅雷走向转型，旋风已然死亡，网盘们跑路的跑路，限流的限流。为什么离线下载服务会频频遭遇挫折？\n\n离线下载的兴起：P2P资源的搬运工\n\n离线下载之所以流行，是和中国特色的网络环境分不开的。在世界上，P2P可以说是最主流的下载方式，P2P用户节点之间能进行数据传输的机制，解决了传统HTTP下载不堪重负的局限。但是，P2P在中国却遇到了巨大的挑战。\n\n十数年前，BT、eMule等P2P下载在我国兴起，下载人数越多速度越快的机制，令很多网民啧啧称奇。然而，P2P下载的局限在中国的网络环境下暴露了出来——我国普遍使用的是ADSL网络，上传带宽远小于下载带宽，需要足够多人参与上传，才能获取一个相对理想的下载速度。\n\n上传带宽小，一方面意味着上传速度慢，另一方面意味着很多人下完资源就会跑路，毕竟让P2P占着窄小的上传毛细血管对上网体验影响太大。如此一来，很多稍微冷门一点的资源，速度往往就是龟爬；只靠一两个人做种的更冷门的资源，基本就只能对着任务列表烧香，祈祷能获得稍微一丁点的速度。离线下载的出现，破解了P2P在中国的困局。\n\n和P2P相比，离线下载拥有非常多的好处。首先，使用离线下载，等于是离线下载服务器代劳你参与P2P，大公司的服务器水管肯定比你家的大，不但能快速完成P2P而且还能喂饱你的下载带宽；其次，离线下载服务器能够使用哈希码匹配已经存在于服务器上的文件。\n\n如果之前有人完成了和你一样的离线任务，那你这次的离线下载就可以“秒下”了，无论热门冷门资源都能够满速拖回本地；再者，离线下载能够服务于多个设备，用PC用手机乃至用路由器都可以发起离线任务，你甚至不需要把资源下回本地，也能够访问离线服务器在线看片。得益于种种好处，离线下载抢尽了P2P的风头，有人甚至放出神论，称P2P已死，离线下载才是未来。\n\n然而，后来的事我们都知道了。离线下载受到了种种掣肘，人们不得不又把目光重新投到了P2P身上。\n\n离线下载的局限：树倒猢狲散\n\n在下载速度方面，离线下载无可挑剔。本质上，离线下载是有互联网大公司背书的HTTP下载。在这个年代，互联网大公司的确有撑起离线下载服务器的实力，但这也是需要付出成本代价的。\n\n离线下载和在线视频播放一样，都是非常耗费带宽的互联网服务，所需要花费的成本也是巨大的——君不见视频网站们为了填回带宽成本的巨坑，在视频中插播了多少无厘头广告。但离线下载，很难做到在线视频那个级别的广告密度，盈利一直是离线下载所需面对的头疼问题。\n\n为此，离线下载服务提供商们不仅在客户端乃至页面插入了大量广告，还推出了一系列高价的会员服务。但即便如此，起到的效果似乎也并不拔群。例如迅雷9已经对客户端进行了大幅改版，加入了更多和下载无关的功能，这些功能大多与推广相关。\n\n如果传统的下载服务就有强劲的盈利能力，想必是不会走这条路子的。而QQ旋风则干脆关停了离线服务器，QQ旋风在市场上已经缺乏竞争力，还留着这个烧成本的服务的话，实在需要太多的情怀了。\n\n除了成本方面的局限，离线下载也更容易受到内容管控方面的影响。背后有大公司作为支撑的离线服务器是强大的，然而与此同时它又是脆弱的。离线服务器的强大在于它是很强很大的一个点，比分散在P2P网络中的每一点都要强。但是，正是由于它只是一个点，所以离线服务器一旦倒下，它所构建的网络会全数灰飞烟灭。\n\n下载软件和网盘们一股脑推出了离线下载功能，但近年来离线下载服务纷纷遭遇了内容管制方面的压力。为此，115网盘关闭了分享功能，并将离线下载划归会员专属；迅雷、旋风和百度云则在不断和谐离线服务器中的内容，辛辛苦苦把片子拖回本地，打开一看原来是8秒钟的劝善真言，司机们的心情是崩溃的。\n\n面对愈发严格的审核，以及本来就巨大的带宽成本，离线下载服务越来越缩手缩脚，提供给用户的服务也越来越坑——动不动就提示某个资源无法离线，交了的会员费仿佛是在打水漂；或者动不动就被限速，看着10K每秒的速度想死的心都有。一些人心生疑问，以离线服务器中心的下载网络，似乎真的不靠谱，那么该换用啥？\n\n是时候回归P2P了：我为人人，人人为我\n\n近两年网盘掀起关闭潮、离线内容被不断和谐的景象，令人不由得想起eDonkey的往事。eDonkey翻译成中文就是“电驴”，这可是正牌的电驴而不是VeryCD的那个李鬼。eDonkey开发出了eD2k网络，但仍需要使用中央服务器来作为通讯中心，为用户提供查找文件等服务。\n\neDonkey盛极一时，然而树大招风，大树挨刀，由于拥有太多涉及版权的内容，eDonkey在2006年被迫赔偿3000万美元并停止开发。而无需依赖中央服务器的eMule，则蒸蒸日上。\n\neMule同样支持eD2k协议，但和eDonkey不同，eMule支持KAD网络。KAD网络是一个纯粹的P2P网络，不需要任何中央服务器也可以进行数据传输。借助着去中心化的KAD网络，eMule成为了世界上最主流的下载方式，版权方只能针对某个用户提出相应控诉，而无法摧毁掉整一个下载网络。P2P网络的强大不仅在于它能覆盖每一个使用它的用户，更在于它只需要用户——只要有一个使用eMule的人，他所依凭的KAD网络却不会消失。\n\n面对愈发严格的内容管制，P2P的确要比离线下载更加靠谱。在现阶段，我国尚未启用针对P2P的流量监控机制，P2P下载越来越被玩得花样迭出。例如，你可以在小范围内玩PT，也可以在大范围用神秘代码来开车。尽管大家的上传带宽普遍仍是小水管，但总比只能对着资源干瞪眼的离线下载强。\n\n不过，P2P非常依赖“我为人人，人人为我”的共享精神。只有足够多的人自觉参与到上传，P2P下载才会有可观效果。然而，国内很多下载软件都带有吸血性质，只从eMule、BT网络中拿数据，并不会把数据回传到正统的P2P软件中。追根溯源，离线下载服务器也只是P2P网络中的一环，而且往往是带有吸血性质的一环。\n\n离线下载的兴旺，本质上并不是中央服务器重新压制了P2P，而是中央服务器借助P2P的力量再次崛起。没有P2P，离线下载根本不可能如此枝繁叶茂。如果P2P下载想要重新兴旺起来，恐怕也有赖于用户们的自觉。\n\n当然，P2P下载也不是无懈可击。例如在国外，就有运营商使用了流量监控技术来管制P2P，遏制盗版行为。离线下载靠不住了，可以转用P2P；当P2P也被封锁时，该用什么呢？这是个难以回答的问题。\n\n后话\n\n随着版权的规范化，离线下载和网盘还会继续面临挑战。旋风已经退出江湖，转型的迅雷还会坚持多久？网盘风雨飘摇，百度云会一直巍然不动吗？在这个大环境下，个人的奋斗或许是多谈无益的，让我们继续见证离线下载的历史进程将走向何方吧。",
			"added": 1522934229,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "tox中文群",
			"body": "5EE85FD7B4B6BD8FD113A1E8CC5853A233008B574E07F2CC76A7EA43AE24AE07",
			"added": 1522991345,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "zeronet能导入别人的data文件夹（如vps）吗，作为一个阅读器，不需要有联网功能",
			"body": "",
			"added": 1522994873,
			"parent_topic_uri": "8_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_1A6WmKMHKo9FSuRvHNmNznziALNTaurERp": [
			{
				"comment_id": 1,
				"body": "i2p里的邮箱不是去中心的，手机i2p邮箱是去中心的",
				"added": 1522840448
			},
			{
				"comment_id": 3,
				"body": "互相支援",
				"added": 1522908229
			}
		],
		"1_1B8mFJ7QazWvzGE7jkQHv22tEiqDspjyFU": [
			{
				"comment_id": 2,
				"body": "> [gongzisun](#comment_7_1B8mFJ7QazWvzGE7jkQHv22tEiqDspjyFU): zeromet用来浏览咨询感觉还不错，但是要是分享文件我是不愿意\n\nzeronet发表帖子，用zeromux,onionshare分享文件",
				"added": 1522907565
			}
		],
		"15_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 4,
				"body": "> [bingyuhuo](#comment_56_1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS): 导入了之后还是上不去啊\n\n谷歌有教程，能下zeronet那么应该能上谷歌吧",
				"added": 1522938089
			}
		],
		"7_12eyn7aqnDpzq5WKEZARAt9imQ1sRagAsm": [
			{
				"comment_id": 5,
				"body": "下载下来慢慢看",
				"added": 1522994921
			}
		],
		"1_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": [
			{
				"comment_id": 6,
				"body": "这个地址是宗教，不要看了",
				"added": 1522997341
			}
		]
	},
	"comment_vote": {}
}