{"next_paste_id":7,"next_comment_id":0,"paste":[{"paste_id":1,"description":"Análise e mensagem do Salmo 133","body":"Este salmo davídico se volta para importância da comunhão e do relacionamento adequado na comunidade. Este salmo também é muito cantado nos dias de hoje pelos judeus em Jerusalém. Com vimos acima, esse salmo é pós-exílico, ou seja, foi escrito depois do cativeiro babilônico, que durou de 586 a.C. até 539 a.C.\n\nHá uma combinação estranha nesse salmo, pois sabemos que óleo e orvalho não se misturam! Que relação esses elementos têm a ver com a união fraternal? O verso dois descreve que esse “viver em união” deve ser como o óleo precioso derramado desde a cabeça, e que desce sobre a barba de Arão até a gola de suas veste.\n\nIsto se trata de uma referência à consagração do sacerdote.  O óleo deveria descer sobre toda a sua veste sacerdotal. Portanto, entendemos que a consagração deve ser plena e absoluta.\n\nA ideia que o texto pretende transmitir é a seguinte: a união entre os irmãos deve ter relacionamento, santidade e santificação. Não pode haver uma verdadeira união sem santidade perante Deus. E essa santificação deve produzir um ambiente de confraternização entre os irmãos, portanto, vamos nos unir.\n\nFonte: https://web.archive.org/web/20201020062836/https://demonstre.com/deus/salmo-133/","language":"text/plain","encrypted":false,"added":1609449251},{"paste_id":2,"description":"Lista de Filmes Comunistas sobre a República Popular da China","body":"Assistam ou pelo menos baixem antes que eles sejam deletados.\n\nTodos os filmes estão disponíveis no Google Drive:\nhttps://drive.google.com/drive/u/3/folders/1ljTpa1Qe6eZkXIoglFhz7ef8zAZjGHmp\n\nLISTA:\n\n1- A Fundação de um Partido\nhttps://youtu.be/YFcbFwiORF8\n\n2- A Fundação de um Exército\nDisponível apenas no Google Drive\n\n3- A Fundação de uma República\nhttps://youtu.be/fs3099Cv-zc\n\n4- Juventude (Fānghuá)\nhttps://youtu.be/YHHT27DQ0b4\n\n5- Os Chineses (La Chinoise)\nDisponível apenas no Google Drive\n\nOs três primeiros filmes são uma trilogia, e foram encomendados pelo Partido Comunista Chinês.\n\nO quarto filme se passa na época da Revolução Cultural e também na época da Reforma e Abertura.","language":"text/plain","encrypted":false,"added":1609637907},{"paste_id":3,"description":"Por que falar de neoliberalismo em plena pandemia?","body":"Após o fim da primeira guerra mundial os países do centro - Europa e Estados Unidos - passaram a repensar o modelo socioeconômico liberal que defendia o livre mercado e a pouca intervenção do Estado na economia. Com o fim da guerra e a crise econômica de 1929, a teoria liberal é desgastada em razão da incapacidade do liberalismo em reverter o cenário de desemprego e miséria. Com a crise da teoria liberal, surgiram (ou ressurgiram) correntes teóricas que repensavam a forma de organização social e, por vias democráticas ou autoritárias, aproximavam o Estado como agente ativo na economia e na garantia dos direitos básicos dos cidadãos.\n\nCom o desgaste da teoria, o modelo de Estado intervencionistas e que garantia o bem estar social ganhou força na década de 1930. No mesmo período os liberais passaram a reformular a teoria liberal, fundando aquilo que hoje é denominado neoliberalismo. Em razão do crescimento dos modelos do bem estar social, o neoliberalismo não teve impacto e influência imediata. Contudo, passou a ser formulado nas academias e a ser pensado partindo do pressuposto que o liberalismo fracassou em organizar a sociedade e com a tentativa de corrigir os motivos desse fracasso. Foi apenas na década de 1970 que o neoliberalismo passou a ser influente e, consequentemente, a ganhar poder e passar a gerir a sociedade.\n\nUma das mudanças principais na teoria foi a modificação do pensamento naturalista de que as forças do mercado financeiro propiciariam espontaneamente o equilíbrio social e econômico. De acordo com a ideologia neoliberal, o Estado não deve ser suprimido nas relações sociais e econômicas e, assim, nega a perspectiva liberal de que o mercado sozinho irá garantir a liberdade individual e o equilíbrio econômico. Para o neoliberalismo, é necessário se construir uma ordem institucional e jurídica que proteja e incentive o funcionamento do mercado e a competição entre as pessoas.\n\nSendo assim, o Estado seria responsável por regular a competição, a concorrência e permitir o livre mercado. E, com a alimentação da força do livre mercado, o Estado seria controlado por esse próprio mercado, sendo impedido de tornar-se totalitário e de usurpar as liberdades individuais.\nNo entanto, o neoliberalismo não se voltou apenas para o controle do mercado e do Estado, mas seria fundamental na construção de uma “nova razão” do mundo, ou seja, uma nova forma de organização social. Seria um poder cultural de modificar a forma de se pensar e de se estar no mundo, forjando as instituições a partir da perspectiva da competitividade e construindo a subjetividade dos indivíduos a partir da lógica de concorrência entre as pessoas, que leva a individualização do sujeito. \n\nPara o neoliberalismo, o individualismo gera aspectos positivos para a sociedade, porque ao concorrerem entre si, as pessoas geram bem estar coletivo. Ainda de acordo com essa “nova forma de estar no mundo”, o sucesso e o fracasso seriam baseados na meritocracia, ou seja, na perspectiva de problema individual para o desemprego, a miséria, a fome. Em outras palavras, o sujeito seria responsável por não conseguir emprego e ter uma boa vida e não seria um problema coletivo da sociedade, sendo assim, não seria a função do Estado agir para garantir empregos e promover garantias sociais de saúde, moradia, educação e alimentação.\n\nEssa perspectiva não só relativiza, mas nega a ideia de solidariedade. Ou seja, recusa a ideia de coletividade, para valorizar a livre iniciativa do indivíduo. E, ainda, entende que os indivíduos devem ser submetidos ao risco, ou seja, não podem ter garantias trabalhistas, previdenciárias e de saúde, pois devem temer o desemprego, a velhice e a morte com a finalidade de se manterem produtivos para o sistema.\n\nQuando Jair Bolsonaro se recusa a traçar estratégias federais para combater a pandemia e não se responsabiliza, enquanto chefe de Estado, pelo alastramento do coronavírus, apoia-se justamente na ideologia neoliberal de que a saúde e a vida do indivíduo não é um problema coletivo, mas individual. Cabe, assim, ao indivíduo manter-se vivo e produtivo, pois apenas dessa forma poderá garantir o seu próprio bem estar social. \nÉ em razão do viés neoliberal do atual governo federal, por exemplo, que o auxílio emergencial foi, inicialmente, rechaçado por Bolsonaro. No início da pandemia, o Presidente da República posicionou-se veementemente contra o auxílio e foi apenas em razão da oposição que o programa emergencial foi implementado. Hoje, contudo, Bolsonaro se vangloria do programa e omite em seus outdoors espalhados pelas cidades do Brasil que, a depender dele, o auxílio emergencial não existiria.\n\nAs críticas ao neoliberalismo são extensas, mas a atual situação do Brasil permite uma síntese em relação a pelo menos uma dessas críticas. Ao posicionar-se em defesa da abertura dos comércios e contra o isolamento social, Bolsonaro deixa evidente que sua preocupação maior é com a saúde do mercado, mesmo que para manter essa saúde, sejam necessárias mais de 117 mil mortes evitáveis de brasileiras e brasileiros. Trata-se, novamente, de inibir que o Estado aja ativamente para garantir a saúde, a moradia, a alimentação e a educação das pessoas. E, assim, responsabilizar individualmente cada um de nós pelo sucesso ou pelo fracasso de manter nossa dignidade e de nos mantermos vivas e vivos.\n\nE pior, por tratar-se de uma nova forma de organização social, o neoliberalismo, impregnado em nossa subjetividade enquanto sujeitas e sujeitos no mundo, faz com que milhares, ou melhor, milhões de brasileiros e brasileiras ajam com tanta naturalidade frente à elevada quantidade de mortes causadas pelo vírus. A escassez do sentimento de coletividade, a falta de solidariedade e empatia para com os demais e a inexistência de uma consciência de responsabilidade social repercute, exatamente, na ausência de revolta contra um governo que, até hoje, não fez absolutamente nada para impedir o contágio e a morte.\n\nO coronavírus adoece e mata. O neoliberalismo é um vírus que destrói toda e qualquer forma de vida. Precisamos de uma vacina para ambos.","language":"text/plain","encrypted":false,"added":1610030886},{"paste_id":4,"description":"Segredos brasileiros são bisbilhotados há décadas por outros países | Fonte: https://web.archive.org/web/20201104224551mp_/https://www.fab.mil.br/notimp/mostra/03-08-2013#n62699","body":"A denúncia do ex-técnico da NSA Edward Snowden de que os EUA usam métodos sofisticados para nos espionar, que gerou furor nos meios governamentais, não deveria ter causado tanta comoção.\n\nCasos ocorridos nos anos 80 e 90, e até antes, mostram que os segredos políticos e tecnológicos do Brasil são bisbilhotados há décadas não só pelos americanos, mas também por franceses, israelenses e sabe-se lá quem mais.\n\nDocumentos ultraconfidenciais do extinto Serviço Nacional de Informações revelam que várias instituições do governo e indústrias estratégicas foram alvo permanente de espionagem externa --os mais visados eram o CTA (Centro Técnico Aeroespacial) e o Instituto de Estudos Avançados da Aeronáutica, em São José dos Campos (SP).\n\nCom o SNI voltado para o \"inimigo interno\", a atividade de contraespionagem era praticamente nula no Brasil. Mesmo assim, vez por outra, investigavam-se agentes de \"países amigos\", como John James Gilbride Jr., que também utilizava os nomes John Gilbraith ou Jack O\"Brian. Credenciado como vice-cônsul para assuntos econômicos, fachada comumente usada pela CIA no exterior, operou no Brasil de 1988 a 1992, nos consulados dos EUA no Rio e em São Paulo. Estava empenhado em recrutar cientistas e pesquisadores do CTA, principalmente do programa aeroespacial. Deixou o país quando já estava \"queimado\" --ou seja, identificado como agente empenhado em ações prejudiciais a interesses brasileiros.\n\nApurou-se que Gilbride nunca fora diplomata de carreira. O assunto foi encoberto, já que o governo do Brasil queria evitar a eclosão de um escândalo diplomático.\n\nO espião americano marcara almoço com importante cientista brasileiro numa churrascaria da alameda Santos (SP). Os agentes brasileiros que o vigiavam descobriram ser impossível pôr escutas no local devido à fortíssima interferência das antenas de rádio e TV. Terminado o almoço, o americano despistou nada menos que 11 agentes.\n\nO interesse estrangeiro recaía também sobre os centros de pesquisa de universidades como a Unicamp e a USP, com tentativas persistentes de aliciar técnicos e cientistas.\n\nEntre 1983 e 1985, a então Telesp, hoje Vivo, teve roubados carros e macacões dos serviços de manutenção. Após os furtos, a Polícia Federal localizou gravadores em postes do Vale do Paraíba.\n\nEsses grampos --especulou-se-- objetivavam registrar telefonemas de pessoas ligados ao setor aeroespacial.\n\nMORTE MISTERIOSA\n\nA misteriosa morte do tenente-coronel José Alberto Albano do Amarante, da Aeronáutica, em 3 de outubro de 1981, evidenciou a atuação de um espião do Mossad, o célebre serviço secreto de Israel.\n\nNos anos 70, o Brasil desenvolvia secretamente um programa nuclear para fins militares. Parceria com o Iraque assegurava os altos recursos financeiros necessários à sua execução; em troca, os iraquianos teriam acesso aos conhecimentos tecnológicos dos cientistas brasileiros.\n\nO responsável pelo programa na Aeronáutica era Amarante, engenheiro eletrônico pelo Instituto Tecnológico da Aeronáutica visto como o pai da pesquisa nuclear no país.\n\nEm outubro de 1981, ele foi atacado por uma leucemia galopante: morreu em dez dias. Sua morte passou a ser investigada pela Aeronáutica --teria sido contaminado de propósito por radiação.\n\nA família acreditava que o cientista fora morto pelos serviços secretos de EUA e Israel, mas nada se comprovou. Na época, a mulher de Amarante contou que ele se queixava de ser seguido quando ia a SP ou ao Rio. Depois, quando seus restos mortais foram exumados para novo enterro no Rio, a família constatou sinais de violação da sepultura.\n\nAmarante fundara o Laboratório de Estudos Avançados, grande centro de estudos destinado a se constituir na espinha dorsal da pesquisa nuclear do país. Seu objetivo era ambicioso: desenvolver o enriquecimento de urânio por raios laser (usados para detonar a reação nuclear), em vez do sistema de centrífugas, mais oneroso e lento.\n\nNo exterior, cresciam as suspeitas de que as experiências objetivavam desenvolver armas nucleares, o que sempre foi negado pelo Brasil.\n\nESCUTAS NO HOTEL\n\nAs investigações sobre a morte de Amarante revelaram a existência de um misterioso personagem, Samuel Giliad ou Guesten Zang, um israelense nascido na Polônia, que lutara contra os alemães na Segunda Guerra.\n\nO israelense, apelidado de \"Mister Pipe\" por fumar cachimbo, chegou a São José em 1979 para gerir o Hotel Eldorado, o principal da cidade, que hospedava muitos estrangeiros, civis e militares, envolvidos em atividades industriais e científicas na área.\n\nExtremamente simpático, Giliad mancava de uma perna devido a um tiro levado na guerra, contava. Hábil, instituiu no Eldorado reuniões sociais de secretárias e gerentes de indústrias, gente solitária capaz de soltar a língua estimulada por drinques. Assim, tinha acesso a informações valiosas: sabia quais delegações visitavam quais indústrias da região e, sempre que possível, a razão das visitas.\n\nO israelense tentou se aproximar de Amarante, mas o oficial o repelia: nunca atendeu a nenhum convite. Passou a frequentar o dentista que atendia Amarante, procurando marcar horários logo depois dos do oficial.\n\nO coronel aborrecia-se com a insistência, e suas suspeitas cresceram quando o dentista o alertou das perguntas que Giliad fazia: \"O que é que a Aeronáutica está construindo em Cachimbo (Pará)? Ouvi dizer que se trata de uma grande pista de pouso. Mas para que servirá, se já existem as de Manaus e Belém?\".\n\nEra em Cachimbo que estava sendo preparado o local para a primeira experiência do projeto nuclear brasileiro.\n\nDiante dessas perguntas, o alarme foi dado, e Giliad passou a ser vigiado de perto. Descobriu-se que ele tinha cinco passaportes com nomes diferentes e instalara escutas nos quartos e demais dependências do hotel, para ouvir hóspedes e empregados.\n\nApós dois anos, o israelense bateu em retirada de forma hábil quando percebeu que a vigilância crescia: publicou anúncio num jornal local procurando uma acompanhante para dividir despesas numa viagem à Argentina.\n\nO Centro de Informações e Segurança da Aeronáutica errou ao responder ao anúncio enviando um agente (homem). Percebendo que fora desmascarado, Giliad deixou a cidade e desapareceu.\n\nFoi durante a ação do agente israelense em São José que a mídia internacional revelou que o Brasil fazia remessas secretas de urânio enriquecido ao Iraque, disfarçadas em material bélico da Avibrás.\n\nFoi também durante a sua estada na região que o \"Latin America Weekly Report\" noticiou a misteriosa morte de Amarante, expondo suas atividades secretas com impressionante riqueza de detalhes.\n\nFinalmente, quando se divulgou, em 1981, a história das remessas secretas, o Mossad já sabia de tudo e as documentara com fotos. O episódio brasileiro, acreditam os especialistas, serviu como manipulação da opinião pública para que Israel justificasse seu bem-sucedido ataque aéreo ao complexo atômico de Tamuz, no Iraque.","language":"text/plain","encrypted":false,"added":1611439978},{"paste_id":5,"description":"Ezequiel 33","body":"Esta palavra do Senhor veio a mim:\n\"Filho do homem, fale com os seus compatriotas e diga-lhes: ‘Quando eu trouxer a espada contra uma terra e o povo da terra escolher um homem para ser sentinela,\ne ele vir a espada vindo contra a terra e tocar a trombeta para advertir o povo,\nentão, se alguém ouvir a trombeta mas não der atenção à advertência e a espada vier e tirar a sua vida, ele será culpado de sua própria morte.\nUma vez que ele ouviu o som da trombeta mas não deu atenção à advertência, será culpado de sua própria morte. Se ele desse atenção à advertência, se livraria.\nMas, se a sentinela vir chegar a espada e não tocar a trombeta para advertir o povo e a espada vier e tirar a vida de um deles, aquele homem morrerá por causa de sua iniqüidade, mas considerarei a sentinela responsável pela morte daquele homem’.\n\"Filho do homem, eu o fiz uma sentinela para a nação de Israel; por isso ouça a minha palavra, e advirta-os em meu nome.\nQuando eu disser ao ímpio que é certo que ele morrerá, e você não falar para dissuadi-lo de seus caminhos, aquele ímpio morrerá por sua iniqüidade, mas eu considerarei você responsável pela morte dele.\nMas, se você de fato advertir o ímpio para que se desvie dos seus caminhos e ele não se desviar, ele morrerá por sua iniqüidade, mas você estará livre da sua responsabilidade.\n\"Filho do homem, diga à nação de Israel: ‘É isto que vocês estão dizendo: \"Nossas ofensas e pecados são um peso sobre nós, e estamos desfalecendo por causa deles. Como então poderemos viver? \" ’\nDiga-lhes: ‘Juro pela minha vida, palavra do Soberano Senhor, que não tenho prazer na morte dos ímpios, antes tenho prazer em que eles se desviem dos seus caminhos e vivam. Voltem! Voltem-se dos seus maus caminhos! Por que iriam morrer, ó nação de Israel? ’\n\"Por isso, filho do homem, diga aos seus compatriotas: ‘A retidão do justo não o livrará se ele voltar-se para a desobediência, e a maldade do ímpio não o fará cair se ele se desviar dela. E se o justo pecar, não viverá por causa de sua justiça’.\nSe eu garantir ao justo que ele vai viver, mas ele, confiando em sua justiça, fizer o mal, nada de justo que fez será lembrado; ele morrerá por causa do mal que fez.\nE, se você disser ao ímpio: ‘Certamente você morrerá’, mas ele se desviar do seu pecado e fizer o que é justo e certo;\nse ele devolver o que apanhou como penhor de um empréstimo, se devolver o que roubou, se agir segundo os decretos que dão vida e não fizer mal algum, é certo que viverá; não morrerá.\nNenhum dos pecados que cometeu será lembrado contra ele. Ele fez o que é justo e certo; certamente viverá.\n\"Contudo, os seus compatriotas dizem: ‘O caminho do Senhor não é justo’. Mas é o caminho deles que não é justo.\nSe um justo se afastar de sua justiça e fizer o mal, morrerá.\nE, se um ímpio se desviar de sua maldade e fizer o que é justo e certo, viverá por assim proceder.\nNo entanto, ó nação de Israel, vocês dizem: ‘O caminho do Senhor não é justo’. Mas eu julgarei cada um de acordo com os seus próprios caminhos\".\nNo quinto dia do décimo mês do décimo segundo ano do nosso exílio, um homem que havia escapado de Jerusalém veio a mim e disse: \"A cidade caiu! \"\nOra, na tarde do dia anterior, a mão do Senhor esteve sobre mim, e ele abriu a minha boca antes de chegar aquele homem. Assim foi aberta a minha boca, e eu não me calei mais.\nEntão me veio esta palavra do Senhor:\n\"Filho do homem, o povo que vive naquelas ruínas em Israel está dizendo: ‘Abraão era apenas um único homem, e, contudo, possuiu a terra. Mas nós somos muitos; com certeza receberemos a terra como propriedade’.\nEntão diga a eles: ‘Assim diz o Soberano Senhor: Uma vez que vocês comem carne com sangue, voltam-se para os seus ídolos e derramam sangue, deveriam possuir a terra?\nVocês confiam na espada, cometem práticas repugnantes, e cada um de vocês contamina a mulher do seu próximo. E deveriam possuir a terra? ’\n\"Diga isto a eles: ‘Assim diz o Soberano Senhor: Juro pela minha vida, que os que restam nas ruínas cairão pela espada, e que entregarei os que estão no campo aos animais selvagens para serem devorados, e que os que se abrigam em fortalezas e em cavernas morrerão de peste.\nTornarei a terra um deserto abandonado. Darei fim ao poder que se orgulha, e tão arrasados estarão os montes de Israel que ninguém vai querer passar por lá.\nEles saberão que eu sou o Senhor, quando eu tiver tornado a terra um deserto abandonado por causa de todas as práticas repugnantes que eles cometeram’.\n\"Quanto a você, filho do homem, seus compatriotas estão conversando sobre você junto aos muros e às portas das casas, dizendo uns aos outros: ‘Venham ouvir a mensagem que veio da parte do Senhor’.\nO meu povo vem a você, como costuma fazer, e se assenta diante de você para ouvir as suas palavras, mas não as põe em prática. Com a boca eles expressam devoção, mas o coração deles está ávido de ganhos injustos.\nDe fato, para eles você não é nada mais do que alguém que entoa cânticos de amor com uma bela voz e que sabe tocar um instrumento, pois eles ouvem as suas palavras, mas não as põem em prática.\n\"Quando tudo isso acontecer — e certamente acontecerá — eles saberão que um profeta esteve no meio deles\".\n\nEzequiel 33:1-33","language":"text/plain","encrypted":false,"added":1611798927},{"paste_id":6,"description":"Provérbios 21","body":"O coração do rei é como um rio controlado pelo Senhor; ele o dirige para onde quer.\nTodos os caminhos do homem lhe parecem justos, mas o Senhor pesa o coração.\nFazer o que é justo e certo é mais aceitável ao Senhor do que oferecer sacrifícios.\nA vida de pecado dos ímpios se vê no olhar orgulhoso e no coração arrogante,\nOs planos bem elaborados levam à fartura; mas o apressado sempre acaba na miséria.\nA fortuna obtida com língua mentirosa é ilusão fugidia e armadilha mortal.\nA violência dos ímpios os arrastará, pois recusam-se a agir corretamente.\nO caminho do culpado é tortuoso, mas a conduta do inocente é reta.\nMelhor é viver num canto sob o telhado do que repartir a casa com uma mulher briguenta.\nO desejo do perverso é fazer o mal; ele não tem dó do próximo.\nQuando o zombador é castigado, o inexperiente obtém sabedoria; quando o sábio recebe instrução, obtém conhecimento.\nO justo observa a casa dos ímpios e os faz cair na desgraça.\nQuem fecha os ouvidos ao clamor dos pobres também clamará e não terá resposta.\nO presente que se faz em segredo acalma a ira, e o suborno oferecido às ocultas apazigua a maior fúria.\nQuando se faz justiça, o justo se alegra, mas os malfeitores se apavoram.\nQuem se afasta do caminho da sensatez repousará na companhia dos mortos.\nQuem se entrega aos prazeres passará necessidade; quem se apega ao vinho e ao azeite jamais será rico.\nO ímpio serve de resgate para o justo, e o infiel, para o homem íntegro.\nMelhor é viver no deserto do que com uma mulher briguenta e amargurada.\nNa casa do sábio há comida e azeite armazenados, mas o tolo devora tudo o que pode.\nQuem segue a justiça e a lealdade encontra vida, justiça e honra.\nO sábio conquista a cidade dos valentes e derruba a fortaleza em que eles confiam.\nQuem é cuidadoso no que fala evita muito sofrimento.\nO vaidoso e arrogante, chama-se zombador; ele age com extremo orgulho.\nO preguiçoso morre de tanto desejar e de nunca pôr as mãos no trabalho.\nO dia inteiro ele deseja mais e mais, enquanto o justo reparte sem cessar.\nO sacrifício dos ímpios já por si é detestável; quanto mais quando oferecido com más intenções.\nA testemunha falsa perecerá, mas o testemunho do homem bem informado permanecerá.\nO ímpio mostra no rosto a sua arrogância, mas o justo mantém em ordem o seu caminho.\nNão há sabedoria alguma, nem discernimento algum, nem plano algum que possa opor-se ao Senhor.\nPrepara-se o cavalo para o dia da batalha, mas o Senhor é que dá a vitória.\n\nProvérbios 21:1-31","language":"text/plain","encrypted":false,"added":1612019537}],"comment":[]}