{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1604801704,
			"title": "Chinese Style Internet Censorship Incoming",
			"body": "The CCP puppet leaders Biden and Kamala will not allow them and their dealings with the CCP and the ongoing pillage of Americans to be questioned. I predict they will further crackdown on social media then sabotage access to p2p networks to prevent any dissidents from arising starting next year. \nThere will be continuous sweeps on social media like the ones carried out earlier this year and during the election to shutdown and censor almost every user that speaks out against the puppet leaders reign.\n\nThey will use covid-19-21 as an excuse to lock and shut everyone down for their entire 4 years presidency to prevent any kind of protest or uprisng, they will censor EVERYTHING and send the ANTIFA mob to shut down anyone that challenges it. This is it, this is the real deal, we are living in a CCP style dictatorship. We must make moves now, and prepare.\n\nEveryone must boycott facebook, twitter, youtube, reddit, google etc starting today, they must be made illegitimate, new ones should be created or alternatives should be used in place before it is too late. These mainstream platforms must be  disenfranchised ASAP,. Politicians in the west need to stop using and relying on them! Why are they using them in the first place? They are all CCP owned collecting your personal information/activity, giving it away to third parties and used to spread propaganda or censor speech. The infrastructure has all been setup for the CCP dystopia to take place, now they just need to activate it when the puppet leaders are sworn in.\n\nThey will also come after decentralized and encrypted platforms. if that happens that will be it. You will be left in the dark like the billions of Chinese living under the CCP dictatorship. They could carry out all kinds of sabotage operations to shut down ZeroNet for example and make it harder or almost impossible to access p2p networks. We must do everything possible to prevent this from happening and reinforce access these networks. They are already planning it:\n\nhttps://foundation.mozilla.org/en/blog/fellow-research-decentralized-web-hate/:\n\nFellow Research: The Decentralized Web of Hate\nMozilla\nBy Mozilla | Nov. 2, 2020 | Fellowships & Awards\n\nNew research from Mozilla Fellow Emmi Bevensee examines how P2P technologies are being leveraged to spread toxic content — and how some are pushing back.\nDecentralized and open-source technologies play an outsized role in keeping the internet healthy. But like any technology, they can also be harnessed by bad actors — and put to use making the internet a less healthy, more dangerous place.\n\nToday, Mozilla Fellow Emmi Bevensee is publishing a new research into just this: How hate groups in the U.S. are using Peer-2-Peer (P2P) technologies to spread disinformation, amplify toxic content, and incite violence. The report, titled “The Decentralized Web of Hate” is an investigation into the online tools and tactics used by the modern white supremacist movement and will be published by the Rebellious Data LLC consulting firm that Emmi and their team are launching to do social good data science. The report also examines possible solutions to current problems.\n\nSays Emmi: “As major internet platforms like Twitter and YouTube crack down on hate groups, these online communities don’t just go away. Instead, there’s been an exodus to spaces that are more difficult to scrutinize and moderate, but still have the potential to reach a mass audience.”",
			"added": 1604801703
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1604792929_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 1,
				"body": "There won't be a democracy to implement it.",
				"added": 1604803059
			}
		]
	},
	"comment_vote": {}
}