{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1564677748,
			"title": "Decentralised git repository search engine",
			"body": "Hi everyone,\n\nI'm working to find a good solution to a problem we have:\n\n- Github is the most popular dev plateform. Even if developers want to leave github, companies won't quick so quickly. And other developers may not want to leave. It is easier for the community to publish a package or program on github: no registration required to get pull request since they are already there ! Also you need to find something ? Well, this is probably on github !\n- We have several other solutions on clearnet which work well: gogs/gitea, gitlab, etc. Opensource, some  big instances, etc. But we lack the communication between the instances. OpenID is a good start, but there is still no way to search a project across the instances\n\nSo I got an idea: what if I build a P2P (federated style) network able to index, search and interact with all the existing git forges instances ? We can contribute to the network by adding new nodes, share the interface by sharing it to other, like other federated network.\n\nI liked \"gitcenter\" on zeronet but it is not nearly the same thing and does not fit with the global need we have. I liked \"heritage software\" but it does not fill the same goal. I did not found any software that does it.\n\nI started to work on the project, I'm on the research step (building a small bibliography since I've almost no experience in programming P2P). Even if the idea is garbage (tell me), I'll still want to try to do it (for my experience, it looks fun).\n\nFor now, I think it should look like a federated P2P network\n- each node has a fraction of all the data\n- data is replicated over a fraction of the network for better read access and trust\n- federated because we want to make small/intermediate nodes, we don't want to have people to install a software just to make git repository research\n- 3 activities: Information Retrieval (full text search), Information Distribution, Information Mining\n- these 2 first activities may be generic enough to already exist in a technology I don't know. a technology that allow full-text research on a database build over untrusted nodes ? It probably already exists isn't it ?\n\n**Do you have ideas ? Want to participate ? Have experience building such systems ? (if you are french it's even better since I'm much more efficient in my native langage).**",
			"added": 1564677747
		}
	],
	"topic_vote": {
		"1559930366_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"1564755065_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1565141784_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1
	},
	"next_comment_id": 33,
	"comment": {
		"1550761507_1E6XbnEgJMBkFbxsd7i7yZWvMaQggchH1C": [
			{
				"comment_id": 1,
				"body": "Experiment P2P and decentralized technologies ?",
				"added": 1550763103
			}
		],
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 2,
				"body": "Hi @gitcenter, do you know a software that could \"search among the git hosting plateforms\" ?\nSome kind of \"meta-git-hosting\", decentralized (not necessarily distributed).\n\nIt could allow us to create an unified community of developers since the interface and the instances should not be all identical but the database shared between all the sites. So we could have github.com, gitlab.com, and all the minor instances of such forges and not be tied by the big fat community of github.\n\nIf such software doesn't exist, do you think it could be feasible ?\nI'm myself a developer and but I will never start such huge project alone (not enough skill nor time).\n\nThis project should not be around \"create a code that does not disapear\" like zeronet, but a way to avoid being stuck in one instance (github dear nemesis)",
				"added": 1550764161
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 3,
				"body": "> [duende](#comment_68_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, useless piece of garbage.\n\nYou are not nice",
				"added": 1558964689
			}
		],
		"1559768099_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 4,
				"body": "I would like a blured images by default (see ZeroMe) to be SFW because my boss sometimes walk around.\nAlso a blacklist to avoid some videos and publishers. Tags for NSFW, so we can disable/enable it in the profiles ?\nAlso I see several services like that, I saw that there are \"mergers\" for big sites like this ? (sharetube and 1-2 others)",
				"added": 1559809071
			}
		],
		"1559651192_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "24' here.\n\nThe world and technique is utterly broken; maybe a technological and resources collapse in the next decades will clean this bullshit, maybe to not stand up nevermore.\nOne day, I dreamt that a galactic colonization could make its first steps before I die, but I only see this dream lying in the grave.",
				"added": 1559824122
			}
		],
		"1559881033_1JRYQyzmizvMoyErQBW2qZd5FNiWeKpFdZ": [
			{
				"comment_id": 6,
				"body": "I prefer ruby when I need to write quick scripts, or crystal when compilation is needed. I don't like the language itself, however sometimes it is needed for the big libraries it has !",
				"added": 1559896631
			},
			{
				"comment_id": 7,
				"body": "What are the big advantages it has compared to other ? (scope: the language itself, not the libraries around or the amount of help on stackoverflow ^^)",
				"added": 1559896692
			}
		],
		"1560166645_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 8,
				"body": "> Last night I watched the engaging and thought-provoking NetFlix movie called I Am Mother. In order to relate the movie to the other topic of this article, I'll have to tell you what happens in the movie. So, if you haven't watched the movie and want to avoid spoilers, stop reading now.\n\n> The movie is about an artificial intelligence that calls itself \"Mother\". As an engineer and a science fiction fan, of course I would say the movie is about the artificial intelligence, despite the presence of two human characters. As the movie progresses, we gradually learn that Mother was either tasked with or took on the mission of protecting mankind. Since mankind's biggest threat is itself, Mother decided to wipe out every human on the planet and start over. This is a theme already explored by the 2004 Will Smith movie, I Robot, based on the 1950 novel by Arthur C. Clark. Having created a facility to house 63,000 human embryos and practice rearing the first few until Mother gets it right, \"she\" begins her effort of recreating humanity under conditions which will suppress its baser instincts. By the way, anyone who knows anything about human psychology, or has thought at all about what \"intelligence\" actually is, knows the probability of successfully suppressing humanity's baser instincts is essentially zero. Regardless, if you can suspend your disbelief, the movie is still very much worth watching. It begins with the growth of \"Daughter\", played by Clara Rugaard, in a \"test tube\". As she grows up, Daughter asks the natural questions. Mother gives her enough false information to satisfy her curiosity until one day a wounded woman, played by Hilary Swank, appears outside the entrance to the facility, and Daughter learns the truth. Hilary Swank must be using the same plastic surgeon as Sandra Bullock, because I swear she doesn't appear to have aged in twenty years.\n\n> Now to the main topic of this article, the Fermi Paradox, named after the physicist Enrico Fermi who earned the Nobel prize in 1938 for his work on induced radioactivity by neutron bombardment and the discovery of transuranium elements. Recognizing the implication of the Drake Equation, that the universe should be filled with intelligent life, Fermi asked the obvious question, \"Where in the crap is everybody?\" And for that tiny bit of insight, he got his name attached to it.\n\n> Although there are many possible explanations for why intelligent civilizations may have a barrier to their survival--a barrier sometimes referred to as the \"Great Wall\"--I have not seen anything very original written on this in ten years. Under the topic of the Fermi Paradox, Wikipedia gives a long list of reasonable explanations for the lack of intelligent life in the universe, so I won't repeat them all here. When I was growing up in the 1970's, were we terrified of nuclear annihilation. Now that we have somehow managed to survive, despite the nuclear threat hanging over our heads for the last seven decades, no one seems to be paying much attention to this humanity-ending scenario. Maybe this is just one example of how people eventually get bored with a long-standing fear to the point where they change focus to the next threat to come along. Currently, perhaps the most likely humanity-ending scenario is that some high-school kid creates a super-virus in a test tube in his kitchen.\n\n> Awareness of the long-standing A.I. threat has been revived, yet again, by the recent development of commercial artificial intelligence applications. This is the third round of fear about this of which I am aware. The first was in the 1950's. Then the early 1980's. Perhaps there was another in the 1970's--remember Battlestar Gallactica? Each previous time we stopped fixating on A.I. because we realized that we didn't have fast enough computers. Hopefully, it will be just a matter of time before some intelligent people realize that again. Anyway, this time Elon Musk and Steven Hawking are among those who have brought this threat to the forefront of our consciousnesses. Musk predicted that we will likely reach the \"singularity point\" by the year 2045 (i.e. produce an artificial intelligence that is far smarter than us). I assume this is based on Moore's Law, which is no longer in effect, but that's somewhat beside the point. The speculation is that the A.I. would then either enslave us, or more likely, wipe us out. Since we have been effectively enslaved by far less intelligent politicians for all of recorded history, it shouldn't take a particularly smart A.I. to succeed with that. However, my personal opinion is that we are nowhere near a singularity point. I don't think this is likely for at least a hundred years, if at all. We just don't know enough yet about what intelligence actually is to create an artificial version.\n\n> But let's say that we create a super A.I. tomorrow. We have not the foggiest idea what it would do. It may not even care enough about us to wipe us out. It may just decide to leave to engage in more interesting activities, as in the movie She with Joaquin Phoenix. One of our problems as humans is that we are incapable of not seeing ourselves at the center of the universe--a mindset that has been biologically programmed into us. No, we can't set aside our biological programming long enough to see the universe, or reality in general, in it's true light. We can't see that a super A.I. probably wouldn't care about us at all.\n\n> The obvious problem with including A.I. on the list of \"Great Wall\" scenarios preventing intelligent life from permeating the universe is that, while it is debatable whether A.I. is life, it is not debatable whether a super A.I. would be considered intelligent. If biological intelligence leads naturally to machine intelligence, then Fermi would not have posed his question in the first place. We would simply be seeing the effects of intelligent A.I. throughout the universe, instead to the effects of intelligent biological life.\n\n> This article may not have been consistent with the point of this website--namely, that this website is just for the fun of it. Sorry about that. My next article will be about something more fun, ironically the near annihilation of humanity by aliens. Sounds like I have a one-track mind, doesn't it? But seriously, the podcast I'll write about next really is fun, optimistic even, despite its premise.",
				"added": 1560253548
			}
		],
		"1560426998_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 9,
				"body": "> My Search for Alternative Social Networks\n>\n> 6-12-19\n>\n> Giant social network websites like Facebook, Reddit, Twitter, and Google Plus have some significant problems. One is that users have no real control over anything that happens there and, therefore, often zero recourse when they are treated unfairly. The way users are treated is completely at the whim of the companies that own these sites. And, as with nearly all giant corporations, virtually any employee that a user may manage to contact couldn't care less about the effects of the company's actions on individual users. Remember, users are not customers, they are the product. Customers pay to advertise to users and to buy user's data. One alternative social network user, whose post I read recently, called mainstream social network users \"the cattle of the internet\".\n>\n>\n> My Experience with Reddit\n>\n> Here is my personal illustration of what I mean. About six weeks ago, I was shadow-banned from Reddit. This means I could see my posts and comments, but no one else could. Despite Reddit's written policy stating that anyone who is banned be given an explanation for this action, I never was. After my repeated requests over the month after my ban, I finally received this message from /u/abrownn, a moderator of the technology subreddit, \"You're not shadow-banned any more it seems.\" That was his full message. So, the shadow-ban was lifted without explanation. I don't know why I was banned, and I don't know why the ban was lifted.\n>\n> As a result of this treatment by Reddit, and also as a result of the many Facebook privacy scandals that we've been reading about in the news, I decided to find some alternatives for my social network \"needs\" (or, more accurately, \"wants\"). First, I should explain that, as something of an introvert, I have never been interested in using Facebook. So, I have no direct experience with it, and therefore, I can't make knowledgeable comparisons between Facebook and other social networks. Nevertheless, I will do my best to describe the results of my search for alternative social networks.\n>\n>\n> What I want in a Social Network\n>\n> In no particular order, here is a list of features that I feel are desirable in an alternative social network. Call it a user's Bill of Rights.\n>\n>     The option for anonymity (pseudonymous user names allowed, and no mandatory collection of user's personal data)\n>     Privacy (no tracking or linking of users to IP addresses)\n>     Security\n>     Users having a significant say in how the network is run\n>     A network that cannot be shut down by companies or governments\n>     Users cannot be banned\n>     All users are \"equal\" (i.e. the system cannot be gamed)\n>     Ease of use\n>     A sense of community\n>     Works with Linux\n>\n>\n>\n> Many believe that alternative social networks are doomed to fail. And, as much as I hate to, I have to admit that many of their arguments seem cogent. The crux of many of these arguments is two-fold. First, most users of social networks are technically unsophisticated and just don't want to spend the time to learn how to use alternatives to their favorite social network websites. While I understand this, I have also found that most of the alternatives are no harder to use than the mainstream social networks. They are just different. The second argument, and the most persuasive, is that there aren't many people using alternative social networks. This is true, and this will be a huge problem for Facebook users whose friends are all on Facebook. But for Reddit users, this is not as much of a problem, because Reddit is not as much oriented around individuals as it is around information. If the information pool provided by the users is sufficiently large, and if it is presented in an easily-digestible format, nothing else matters. As a result, in my opinion, Reddit has much more to fear from competitors in the near future than does Facebook.\n>\n> Over the last month, I have investigated some of the larger and more well-known alternative social networks: Minds, Voat, Diaspora, ZeroNet, Raddle, Mix, 4Chan, 8Chan, and Slashdot. I also investigated Steemit; however, my consideration of Steemit ended when I learned that I either had to pay $4 to join Steemit (plus another $2 fee, if I paid with bitcoin) or hand over my phone number. In my mind, a major point in the favor of alternative social networks is the level of anonymity they afford their users. Regardless of the ostensible reason, being forced to reveal a phone number vaporizes even the pretense of anonymity. The rest of this article details what I learned about the other social networks in my above list.\n>\n>\n> Centralized and Decentralized Social Networks:\n>\n> Social networks fall into two broad categories, \"centralized\" and \"decentralized\" ( AKA \"distributed\"). Centralized social networks are housed on the computers of the organizations that run them. Reddit, Facebook, Twitter, and Google Plus are centralized social networks. Centralized alternative social networks potentially suffer from all of the problems of the major well-known centralized social networks. The only difference is that the alternative social networks are not currently large enough to be throwing their weight around and ignoring their users. But, if they ever grow enough to dominate their market, that will most likely happen. The major advantage of centralized networks is that users don't have to install any software on their computers to use them. Usually, you just point your internet browser to one of their websites, create an account, log on, and you're in.\n>\n> The centralized alternative social networks that I tried were Raddle, Voat, 4chan, 8chan, Slashdot, and Mix. As I've said, I also investigated Steemit, but did not create an account. I also looked at other centralized networks that I won't mention, because they either have too few users or don't meet enough of the wants that I listed above. However, there are so many altenative social networks that I didn't try to experiment with them all, so you may explore the outskirts of the internet and find a good one that I missed.\n>\n> Decentralized alternative social networks are housed on individual user's computers. This means that, in theory, they cannot be controlled or shut down by some central authority, like a company or a government. In theory, they are run by their users. However, practice and theory may be two different things. On some decentralized social networks, users can still be banned and their posts blocked. Sometimes this can be accomplished by a single hosting user, and sometimes it takes a concerted effort by several major users. In addition, social network software could conceivably be written to reside on individual users' computers, yet be controlled in some esoteric ways by a central server. Without being a knowledgeable programmer who is willing to wade through tens of thousands of lines of code or more, there is no way for the individual user to have a clue about who is really controlling a network, or who could control it in the future. Future versions of code can always be subverted if the financial reward is high enough. What I am trying to emphasize is that there is really no way to know for sure if a particular decentralized network is as free from interference as it claims, perhaps until some big company or government tries.\n>\n> Speaking of being shutdown by a government, there is some good news where ZeroNet is concerned. Journalists reported recently that ZeroNet was shutdown by the Chinese government. However, this is not actually true. What really happened, at least according to my understanding, is that the Chinese government blocked ZeroNet's website on the clearnet (the internet we are all familiar with). However, the functioning of the ZeroNet network and its accessibility by all its current users in China are not affected. At least, Chinese users are unaffected until they need to use a newer version of the ZeroNet software. Until then, their connections to the ZeroNet network should work just fine. And, current Chinese users of ZeroNet should be able to pass (via sneakernet) their current ZeroNet software to as many of their friends as want it. So, ZeroNet appears to have passed its first test, at least so far.\n>\n> The two decentralized social networks that I experimented with were ZeroNet and Diaspora. Despite China's failed attempt, knowledgeable users of ZeroNet claim that users can be banned and have their posts and data removed from the network. If this is not true, I urge someone smart at ZeroNet to explain this to me, and I'll change what I've written here. I'm talking about more than just having a list of \"bad\" websites published where users can refer to it. This seems completely reasonable to me. I'm talking about preventing users who desire to access specific content from accessing the content of banned users.\n>\n>\n> The Most Promising Centralized Networks I have Tried:\n>\n> The following centralized social networks do not require users to sign up for an account to see their content: Raddle, Voat, 4chan, 8chan, Slashdot, and Mix. Both 4chan and 8chan allow unregistered users to post content, but on Raddle, Voat, Slashdot, and Mix users must have an account to create posts, up-vote content, and make comments.\n>\n> Minds and Steemit are the two centralized networks I investigated that require users to create accounts just to see content.\n>\n> Summary of advantages and disadvantages of each alternative centralized social network:\n>\n> Raddle: Similar to Reddit. Long list of forums on specific topics. Perhaps only five to ten thousand users. Doesn't seem to have a problem with self-promotion, if the content is relevant. Significantly easier to use than Reddit.\n>\n> Voat: Similar to Reddit. Maybe one to two hundred thousand users, but most don't seem to be active. Doesn't seem to have a problem with self-promotion, if the content is relevant. Lots of swearing and hate speech, but on the flip-side of that coin is the fact that users are definitely able speak their minds. Long list of \"subverses\" (forums on specific topics).\n>\n> 4chan: Geared for those with very short attention spans. Most posts are pictures or memes. Very little in-depth discussion. Posts seem to have very short shelf lives.\n>\n> 8chan: Much like 4chan.\n>\n> Slashdot: Similar to Reddit, but far fewer users. More geared to the scientific and technical crowds. I received the distinct impression that there is heavy moderation here. My account stopped letting me log in after about 10 days, so there may be software or database problems.\n>\n> Minds: About a million users. Most content is of the picture and video variety. Fewer substantial news stories than on Reddit. Content sometimes seems slow to load. Limited number of forums. There appears to be a medium-sized learning curve here. I had trouble locating and following content in the fire hose of posts. Maybe that is just due to my lack of experience here.\n>\n> Mix: Doesn't appear to have forums on specific topics. Apparently, Mix will only let users login with their Google, Facebook, Twitter, or StumbleUpon account. That killed Mix for me. As far as I am concerned, the point of alternative social networks is to avoid mainstream social networks, not to integrate them into my alternative social network accounts! I would have liked to have put another ten exclamation points at the end of that sentence.\n>\n> Steemit: Influential users known as \"whales\" can control what everyone is seeing by displaying their posts in the most prominent locations and relegating the posts of less influential users to outlying areas where no one will see them. This is no better than the situation at mainstream social networks. And, as I've said, I will not give my phone number to Steemit.\n>\n>\n> The Decentralized Networks I have Joined:\n>\n> As I said previously, the decentralized networks I've tried are ZeroNet and Diaspora. I could also include Friendica, because the Diaspora \"pod\" on which I created my account runs Friendica software.\n> ZeroNet\n>\n> I think ZeroNet comes the closest to complying with my above list of desirable features for alternative social networks. I wrote an entire article on my impressions as a new user of ZeroNet here. One of the ways ZeroNet protects users' privacy is by letting them use the TOR browser to hide their true IP addresses. And, users don't have to give away any personal information to join ZeroNet, not even their true names. Users can also create their own websites for free, in fact the ZeroNet developers encourage everyone to do so. In a way I only vaguely understand, ZeroNet uses bitcoin technology to assign IP addresses to user's websites and distribute them across other users' (or peers') computers. This is supposed to make ZeroNet less subject to interference from those who might desire to control or kill it.\n>\n> I can't begin to describe the flexibility that ZeroNet enjoys, thanks to user's ability to create their own websites. Did I mention that users can create websites on ZeroNet for Free? As anyone knows who has read much on cheapskatesguide.org, free is very important to me. The ability of users to create their own websites on ZeroNet makes ZeroNet like a whole new internet, though currently on a much smaller scale. Unfortunately, although ZeroNet websites can run Java, they can't run PHP code. This is the major reason that I have not mirrored this website on ZeroNet. Okay, perhaps it's also due to my uncertainty about whether I would need to have my own dedicated, 24/7 server. And, there is the fact that ZeroNet sites can be accessed from the clearnet. I know because I have found some of my postings there in Google searches. I'm not sure about the effects of that on SEO ratings. Honestly, though, Google doesn't bring enough traffic to cheapskatesguide.org to pay attention to. I talked about this issue in an earlier article. Technically, the fact that Google searches ZeroNet websites means ZeroNet is not part of the dark web.\n>\n> The downside of ZeroNet is that, at any given time, there are only in the neighborhood of a thousand users on line. This means two things. First, you won't find anywhere near the number or variety of postings that you would on Reddit. Second, since ZeroNet is hosted on the computers of its users, few users on line means much of the data in individual websites may not be available at any given time. This is most noticeable in book and movie download sites, as most book and movie files are not available a large percentage of the time. I haven't experimented with downloading music, but I assume the same applies.\n> Diaspora\n>\n> Diaspora is an open-source social network that is much like a stripped-down version of Facebook. With Diaspora, you open an account on a Diaspora \"pod\", which is a computer that is running the Diaspora (or similar open-source) software. Pods are run by a subset of individual users who host other users on their computers for this purpose. Any user can create his own pod. To use Diaspora, you open your internet browser and go to the clearnet website that corresponds to the particular pod on which you have an account. Then, you log on, and you are connected to Diaspora. You never need to use any software other than your favorite internet browser to access Diaspora. The pod I signed up with is social.linuxlusers.com. Diaspora has a website on the clearnet that displays a list of currently-available pods and their URL's.\n>\n> Diaspora is globally linked to the following other open-source, distributed social networks: Friendica, Mastodon, Activity Pub, and Pleroma. In fact, the Diaspora \"pod\" I happend to open an account on apparently runs Friendica software, so technically, I joined Friendica without knowing it. There may be other, less-well-known, linked networks also, but the afore-mentioned ones are the ones I saw for myself on the network. Thanks to this linking, from Diaspora you can see posts that users of the other linked, open-source social networks have chosen to make visible to every one on all the linked networks. The ability to link to other open-source social networks appears to mean that the growth potential of open-source social networks is unlimited. This is a brilliant solution, I think, to the problem of a large social network becoming unresponsive to its users. Since many open-source software programs can run on the conglomerate social network, intelligent users should see the value of switching away from programs that become unresponsive to their needs. This should mean that unresponsive open-source social media networks should die off and be replaced by more responsive ones.\n>\n> Due of the collection of a small number of users on each pod, which is in turn linked to all the other pods on a particular open-source network, which is in turn linked to the other open-source networks, this whole arrangement reminds me of the old bulletin-board days before the internet. That system, though technically still in existence (it's being reinvigorated by some of the old-timers with the original hardware and software), was very effectively replaced by the modern internet. Only time will tell whether this new system of linked, open-source social networks will be replaced by something else. Whatever happens, it should be fascinating to watch.\n>\n> I found Diaspora (technically, Friendica) to be somewhat difficult to use. The documentation didn't go beyond simple explanations of the basics, and I had no idea how to contact a system administrator to ask questions. Perhaps with more perseverance or help I might have solved these issues.\n>\n>\n> Summary\n>\n> My search for alternative social networks over the past month has lead me to some realizations. First, many alternative social media networks exist. Some seem difficult to use, but many are no more difficult to use than the mainstream social networks, some even less so.\n>\n> I liked Raddle, Voat, and ZeroNet for their content, ease of use, and general sense of community. The rest I didn't care for much. I might have liked Diaspora, if I could have solved my posting issue.\n>\n> Another problem with alternative social networks is that, with the exception of minds, they are small. This means the content is limited. And, it means most people will not want to move there.\n>\n> I see the most potential in ZeroNet, due to its decentralized network, active developers, ease of use, and flexibility (anyone can create their own website). I can only explain the small number of users as a result of the mainstream news media's anxiety surrounding the \"dark web\". If you are one of those who are afraid of the dark web, I urge you to overcome that fear and get a taste of the freedom that can be found there. Personally, I find ZeroNet's potential exciting, but I am also okay with the fact that millions of people have not flocked to it and turned it into another commercialized Reddit/Youtube/Google/Amazon network. It seems that, with enough money, anything is corruptible.\n>\n> If you want to move to an alternative social network, don't expect to follow your friends there. You will have to be the trail blazer. You will have to put forth the effort to convince your friends of the wisdom of following you. With the vast majority's lack of concern about privacy and security, that will be an extremely tough sell. Perhaps, feeling a kinship with the likes of Lewis and Clark, you will have to strike out on your own and wait for \"the cattle of the internet\" to catch up, if they ever do.",
				"added": 1560431237
			},
			{
				"comment_id": 10,
				"body": "I think you should take more time for your analysis. I'm not expert in the field but there are several important mistakes and it lakes lot of informations. How much time to write that ?",
				"added": 1560438688
			}
		],
		"1560432237_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 11,
				"body": "If you don't want something to be read on internet, don't publish it anywhere public.",
				"added": 1560439975
			}
		],
		"1562283050_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 12,
				"body": "\"Physical\" is not more real than \"digital\". You may like old fashion objects, they have charm. But like it or not, the hour displayed by your digital clock is very real.\nHowever, we may agree on the point that social media and online communication are very different from a physical meeting/communication.",
				"added": 1562332675
			},
			{
				"comment_id": 13,
				"body": "Can you explain yourself a bit more ? I really don't understand your points about:\n\n- physical matter doesn't exist\n- this cult",
				"added": 1562667972
			}
		],
		"1562866487_1MEFyQ6EisGzSQ8VL8ZwQ7aug4x1iVvv9L": [
			{
				"comment_id": 14,
				"body": "> [atomiserxenolith](#comment_112_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Why do you look to the State to solve your problems?\n\nBecause in france the last great date of our history was 1871. Most of the people I know think that people must not have the power to defend themselves and police should be the only one having the right to violence. We don't trust individuals to make a impartial justice and decisions (that's not stupid at all, people are easy to fool).\n\nHowever in france our politics and \"elites\" are so corrupted it became absurd, we people are angry but confused. Our institutions are in ruins so the state is not legitimate anymore, because our contract is broken.",
				"added": 1562926128
			},
			{
				"comment_id": 15,
				"body": "Also, this blog is full of fake data.\nFaked images, manipulated context to create a political message exactly reverse of what it its, etc.\nBe cautionous.",
				"added": 1562930880
			},
			{
				"comment_id": 17,
				"body": "> [atomiserxenolith](#comment_113_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): If you don't trust individuals, who do you trust?\n\nA group of people does not behave the same way an individual does. The whole is different at the sum of its parts. You could trust people but not groups of people, or the opposite depending on your perspective. I don't know what's better.\nI give you my feeling about my country's people: I think most of them do not trust people for the justice and violence (I willingly grant them that often, popular justice spills a lot of innocent blood).",
				"added": 1562943753
			},
			{
				"comment_id": 18,
				"body": "Yeah, I don't think we can state a clear \"wrong\" and \"right\" point of view (we need proof for that).\nI just answer the \"Why do you look to the State to solve your problems?\".\n\nAnd also people are \"lazy\", so it's easier to rely on the state to do stuff for you (for the same reason you pay people to grow your food, teach mathematics to your children and trust the hospital to save you from cancer, being \"lazy\" it's not that bad).",
				"added": 1563450582
			}
		],
		"1562414209_1CvZDPgKk2p8Uk1ZfJ3hcZb1DzuNJXndhn": [
			{
				"comment_id": 16,
				"body": "Why do you want to reduce the amount of people in the world ?\n\nTo reduce the consumption of resources ? Because you don't like people ? Other ?",
				"added": 1562932678
			},
			{
				"comment_id": 22,
				"body": "Actually, what is a problem is the usage of consumer goods per person, not really the number of person. Stop buying useless computer-phones, internet of shit, netflix, cars, big new houses, industrial food, fly ticket, big steaks, etc. You divide several times your CO2 consumption.\n\nFor example, one average US people produce something like 10 times more CO2 than an indian one.",
				"added": 1564132794
			},
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_771_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ZeroNet and IPFS instead, you suggest?\n\nWell, I think it is just easier to consume less fullhd/4k movies than sterilize 80% of the population or kill them.",
				"added": 1564155606
			}
		],
		"1563540336_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 19,
				"body": "> Can it realistically be replaced by something better?\nrealistically I can't see something less broken replace javascript. It's shitty langage and we are using it way too much, but remember flash... If we have something to replace it, we may see something like a googlescript or some junk like this.",
				"added": 1563784565
			},
			{
				"comment_id": 20,
				"body": "> [stonedmagician](#comment_11_1D1tDixr8MMkJHiRiYkFVKLiJytqC5AA3k): It seems you don't have experience with Javascript\n\nIt seems you don't have experience with guessing what's people doing.",
				"added": 1563805747
			}
		],
		"1563092690_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 21,
				"body": "> [anonymouslogin](#comment_385_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): The earth has too many people. \n\nWho said that ? What proof ?",
				"added": 1563871647
			}
		],
		"1564213187_1BqxHcQnWqCfURAwopdJnRPdqvTL9EMdMg": [
			{
				"comment_id": 24,
				"body": "For me, being free is making impactful decisions (not only for the world, I mean impactful personally, etc.).\nFor example, I want to make a project to create a decentralized and unified git repository search engine, but I'm not free since I'm too lazy so I'm making up excuses to avoid having to do it.\nI'm free when I try to engage with someone when I'm afraid to look dumb, or when I refuse to do something I think is wrong.",
				"added": 1564408722
			}
		],
		"1564490734_19EXEdNhHM294ahirgwYjiLwSiuaoVcuff": [
			{
				"comment_id": 25,
				"body": "https://google.com\nYou tell me when it's done ?",
				"added": 1564493958
			}
		],
		"1564677748_1TWoxhM5cZiLpzybpLyYtEsskuGJ9yVhv": [
			{
				"comment_id": 26,
				"body": "> [robione](#comment_277_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Take a look at https://pijul.com/\n\nWell, it looks cool but it has nothing to do with my idea !\nIt's less about censureship than about having a social environment (access to the forge and social features) not dependent of big companies like microsoft",
				"added": 1564996848
			},
			{
				"comment_id": 28,
				"body": "> [blurhy](#comment_282_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Do not re-invent wheels .A lot of people is working on that.Of course, including me. I am writing IPZN, which has version history feature.We can easily build a github over IPZN\n\nHere my point:\nI want people to be able to access more environment than today, by connecting github with decentralized forges such as gitlabs, gogs, giteas, etc.\n\nI don't need to create another github, over ipzn, zeronet, freenet or anything. People won't quit github because I'm asking gently \"oh you could go somewhere else like IPZN, it's darknet it's cool\". Even you cannot leave github, don't ask other to do that.\nI want to build a tool that allow people to have github++, github connected with other forge. I think it is a first and necessary step to able people to leave and go to another forge instance.\n\n1. you are on github\n2. you are still on github, but using this metagit, you also can read and write on other instance, and have MORE repository and visibility !\n3. you can still access to github, but don't need to host your data on it to have visibility, since lots of people are using the metagit ? -> this is the final goal.\n\nAlso your project is nice, but you don't need to spam it everwhere... All the zeronet community knows it now.",
				"added": 1564998269
			},
			{
				"comment_id": 29,
				"body": "> [filips](#comment_115_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): There is already Git Center in ZeroNet which is replacement for GitHub (and other Git providers). So you are actually re-inventing wheels 😃\n\nread again the previous comments and the description",
				"added": 1564998612
			}
		],
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 27,
				"body": "\"I'm in your computer and I can see all your history... OH MY GOD WTF AAH DISGUSTING PIG, it BURNS MY EYES!\"",
				"added": 1564996931
			}
		],
		"1565593853_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 30,
				"body": "> [numismatist](#comment_29_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Why do you need a full desktop environment? Just use a window manager.\n\nMost people don't want to spend days to configure all the details of their desktop environment. That remember me a friend that is vim/i3, and keep trying to move me from KDE to his env. But boy, I know i3 and used it for 2 years, stop spamming with \"lol kde is for noobs\": that's just opinion, let people use what they like, unless it is really harmful (like developing electron stuff or trying to build a kernel in php).",
				"added": 1565602435
			},
			{
				"comment_id": 31,
				"body": "https://wiki.archlinux.org/index.php/Desktop_environment and https://wiki.archlinux.org/index.php/I3#Installation\n\nBasicaly Full desktop = > 300 MB installation and lot of memory consumption, while a simple window manager is about a few MB and almost no memory footprint.",
				"added": 1565603980
			}
		],
		"1565620016_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 32,
				"body": "> [dreams](#comment_15_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i): I would like to see internet access and cell phones decentralized.\n\nI think there are some mesh network, but mainly for underdeveloped countries",
				"added": 1565621566
			}
		]
	},
	"comment_vote": {
		"81_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"2_1MgPE4CsgBwNtbxHUwyKDugHjp5j5emtWG": 1,
		"133_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"13_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"3_1MgPE4CsgBwNtbxHUwyKDugHjp5j5emtWG": 1,
		"4_1MgPE4CsgBwNtbxHUwyKDugHjp5j5emtWG": 1,
		"325_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"3_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS": 1,
		"225_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"14_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"3_1HcWfcTqKyWJEFojNWF6YP3nSNVW8ENqFS": 1,
		"883_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1013_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}