{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1611305216_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 1,
				"body": "You are right to disapprove bad behavior but you're missing one thing :\nThe existence of this \"dark webs\" is the expression of one self freely.\nEven if you disapprove some of those expressions (and trust me, id do too), there are other things that can be of value.\nJust get the content that you want and even create content you want to share (which is probably the best option to do in these kind of places).",
				"added": 1606131547
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 2,
				"body": "You matter in this world, whether you can perceive it or not.\nIf you don't, you should do things that makes you happy as often as you can.\nEven if it means saying 'no' to others.",
				"added": 1606577027
			},
			{
				"comment_id": 3,
				"body": "> [sj29msn5kz0ldmn](#comment_12_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): what if I have severe social anxiety, my job drains the fuck out of me, and my chances of finding a better one are next to zero...\n\nAsk yourself this : Is there at least one person in the world,  while living the same circumstances as you are, is happy or happier ?\n\nYou can be that person if you teach yourself to see something positive to you out of everything negative you live.\nYeah my job too can be overwhelming at some point but what does this it teach me ? That i'm strong, that i'm more concerned about the world and the people that what i would think, that i'm smarter and more patient than many others because i keep going and find solutions out of each problems that i encounter.\n\nYou live the same, you're just too focus on what is dark than what is bright.\nIf you take the time to look at what's bright, at some point, the only things you will see will be bright and brighter.",
				"added": 1606583273
			}
		]
	},
	"comment_vote": {}
}