{
	"next_comment_id": 17,
	"comment": [
		{
			"comment_id": 1,
			"body": "КГ/АМ тест",
			"post_id": 2,
			"date_added": 1462019325
		},
		{
			"comment_id": 2,
			"body": "во",
			"post_id": 2,
			"date_added": 1462021820
		},
		{
			"comment_id": 3,
			"body": "> [zerro](#comment_1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): КГ/АМ тест\n\nСам такой",
			"post_id": 2,
			"date_added": 1462027906
		},
		{
			"comment_id": 4,
			"body": "Нет бы написать большой, развернутый комментарий, чтобы было сразу видно, где переносы, где отступы.\n\nА так чё, этого же никто не видит. ",
			"post_id": 2,
			"date_added": 1462028132
		},
		{
			"comment_id": 5,
			"body": "Ты это зачем сейчас написал\nВот ч\n> [zerro](#comment_3_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Сам такой\n\n",
			"post_id": 2,
			"date_added": 1462029579
		},
		{
			"comment_id": 6,
			"body": "Я не могу ничего написать, а если бы и мог, то не осилил бы форматирование. Вот так. ",
			"post_id": 2,
			"date_added": 1462033458
		},
		{
			"comment_id": 7,
			"body": "> [zerro](#comment_1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): КГ/АМ тест\n\n",
			"post_id": 2,
			"date_added": 1462041072
		},
		{
			"comment_id": 8,
			"body": "# Комментарий Семёна\n\nВсё написанное выше является только способом продемонстрировать форматирование. Автор не имеет ничего против стиля оформления официального зероблога, лишь демонстрирует альтернативу. ",
			"post_id": 7,
			"date_added": 1462048824
		},
		{
			"comment_id": 9,
			"body": "gjhkl",
			"post_id": 2,
			"date_added": 1462347395
		},
		{
			"comment_id": 10,
			"body": "Textcsdfsf",
			"post_id": 2,
			"date_added": 1462350041
		},
		{
			"comment_id": 11,
			"body": "Что-то подобное пытались пилить в [Shift](http://shiftnrg.org), но теперь они ебнулись с переходом на лиск. ",
			"post_id": 1,
			"date_added": 1475146424
		},
		{
			"comment_id": 13,
			"body": "Копилефт лицензии требуют вирусности на производном продукте. Если это не соблюдается, это нарушение лицензии. \n\n> Creative Commons, Разлицензия и т.д. чем не угодили?\n\nОни угодили, но вот только они почти отказ от авторства. В моем же случае возможно такое что: написал я допустим книгу, и у себя на сайте размещаю две кнопочки: \"Купить лицензионную копию\" и \"Загрузить нелицензионную(техническую) копию\". И во втором случае никакого преследования человека не ожидает. Или, купив бумажную книгу с копирайтом, человек может быть уверен, что книга распространяется так, как того хотел автор. А без копирайта, значит просто платит за бумагу. Ставить копирайт в противном случае же, это мошенничество. Тут следует вспомнить вопрос о торговле пиратской продукцией, и в этом контексте хорошо видна разница.\n\nНасчет юридического контекста, это все нарабатывается практикой. Будут люди разделять подобное, будет практика. Свободные лицензии так и набирали силу. \n\nИ ещё, в моем случае это свод основопологающих принципов. Они позволяют описывать лицензионное соглашение в произвольной форме, EULA например. И это не будет копирастией. ",
			"post_id": 50,
			"date_added": 1476009230
		},
		{
			"comment_id": 14,
			"body": "Тут важно правильно обозначить грань между общественным достоянием и нелецензионной копией. От общественного достояния производную работу лицензировать можно, а от нелицензионной копии нельзя.",
			"post_id": 50,
			"date_added": 1476009430
		},
		{
			"comment_id": 15,
			"body": "Наверно ты не понял. Я не про свободные лицензии, а про почти классический копирайт, только с правом читать. То есть информация, сама по себе в распространении ограничена быть не сможет, но в то же время, автор защищен от воровства и плагиата.\n\nНу, допустим CC-BY-SA. И плюс я хочу ограничить выпуск копий, как мне это сделать? Вот есть моя работа, я хочу продавать с сайта, но не хочу чтобы кто-то ещё имел возможность продавать. ",
			"post_id": 50,
			"date_added": 1476051197
		},
		{
			"comment_id": 16,
			"body": "> [zalex](#comment_4_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): CC-BY-SA-NC - То же самое, но запрещает использование в коммерческих целях.\n\nНо мне не нужен запрет использования в коммерческих целях. Приобретенную копию пусть человек использует. И как это сделать сейчас кроме костылей ввиде двойного лицензирования?",
			"post_id": 50,
			"date_added": 1476062246
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"2": 1
	}
}