{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Disque 100",
			"body": "#O que é?\n\nO Disque 100 funciona diariamente, 24 HORAS POR DIA, incluindo sábados, domingos e feriados.\n\nAs ligações podem ser feitas de todo o Brasil por meio de DISCAGEM GRATUITA, de QUALQUER TERMINAL TELEFÔNICO FIXO OU MÓVEL (CELULAR), bastando discar 100.\n\nO serviço pode ser considerado como “pronto socorro” dos direitos humanos pois atende também graves situações de violações que acabaram de ocorrer ou que ainda estão em curso, acionando os órgãos competentes, possibilitando o flagrante.\n\n#O Disque 100 recebe, analisa e encaminha denúncias de violações de direitos humanos relacionadas aos seguintes grupos e/ou temas:\n\n \n\n- Crianças e adolescentes\n- Pessoas idosas\n- Pessoas com deficiência\n- Pessoas em restrição de liberdade\n- População LGBT\n- População em situação de rua\n- Discriminação ética ou racial\n- Tráfico de pessoas\n- Trabalho escravo\n- Terra e conflitos agrários\n- Moradia e conflitos urbanos\n- Violência contra ciganos, quilombolas, indígenas e outras comunidades tradicionais\n- Violência policial (inclusive das forças de segurança pública no âmbito da intervenção federal no estado do Rio de Janeiro)\n- Violência contra comunicadores e jornalistas\n- Violência contra migrantes e refugiados\n \n\n#O que você precisa informar para registrar uma denúncia pelo Disque 100?\n\n- Quem sofre a violência? (vítima)\n- Qual tipo violência? (violência física, psicológica, maus tratos, abandono, etc.)\n- Quem pratica a violência? (suspeito)\n- Como chegar ou localizar a vítima/suspeito\n- Endereço (estado, município, zona, rua, quadra, bairro, número da casa e ao menos um ponto de referência)\n- Há quanto tempo ocorreu ou ocorre a violência? (frequência)\n- Qual o horário?\n- Em qual local?\n- Como a violência é praticada?\n- Qual a situação atual da vítima?\n- Algum órgão foi acionado?\n\n#Quem pode utilizar este serviço?\nQUALQUER PESSOA pode fazer uma denúncia.\n\n \n\n#O Disque 100 recebe denúncias anônimas?\nSIM. O Ministério dos Direitos Humanos recebe denúncias anônimas e fornece número de protocolo para que o denunciante possa acompanhar seu andamento.\n\n \n\n#O Ministério dos Direitos Humanos só recebe denúncias por telefone?\nNão! Você tem três opções para registrar sua denúncia: Disque 100, aplicativo Proteja Brasil e Ouvidoria Online.\n\n \n\n- Disque 100: O usuário disca para o número 100, passa pelo atendimento eletrônico e, após selecionar a opção desejada, é encaminhado ao atendimento humano. O atendente registra a denúncia e fornece o número do protocolo.\n\n- Aplicativo Proteja Brasil: O usuário vai à loja de aplicativos do seu celular e faz o download, gratuitamente, do aplicativo Proteja Brasil, disponível para iOs e Android. Rapidinho, respondendo um formulário simples, o usuário registra a denúncia, a qual será recebida pela mesma central de atendimento do Disque 100. Se quiser acompanhar a denúncia, basta ligar para o Disque 100 e fornecer dados da denúncia. \n\n- Ouvidoria Online: O usuário preenche o formulário disponível em http://www.humanizaredes.gov.br/ouvidoria-online/ e registra a denúncia, a qual também será recebida pela mesma central de atendimento do Disque 100. Se quiser acompanhar a denúncia, basta ligar para o Disque 100 e fornecer dados da denúncia.\n\n \n\n#O que acontece após o registro da denúncia?\nA denúncia será analisada e encaminhada aos órgãos de proteção, defesa e responsabilização em direitos humanos, respeitando as competências de cada órgão.\n\n- Fonte: http://www.mdh.gov.br/mdh/informacao-ao-cidadao/disque-100",
			"added": 1546641207
		},
		{
			"topic_id": 2,
			"title": "Missão DT",
			"body": "Liderada pelos pastores Gustavo Bessa e Ana Paula Valadão Bessa, a Missão DT pretende levar a adoração a Jesus aos confins da terra. Um autor cristão escreveu que só existe Missão porque ainda não existe a Adoração a Jesus em muitos lugares do mundo. Muitas nações não adoram a Jesus porque nunca ouviram falar dEle! A Missão DT visa juntar a sua voz à voz de muitos outros cristãos a fim de que o conhecimento da glória de Deus encha a terra como as águas cobrem o mar.\n\n- http://missaodt.org/",
			"added": 1546641853
		},
		{
			"topic_id": 3,
			"title": "Análise de Incidência - FUVEST",
			"body": "#Os assuntos mais frequentes na prova da FUVEST\n- https://web.archive.org/web/20180727204329/https://www.vestibular1.com.br/informativo/analise_incidencia_fuvest.pdf",
			"added": 1546666384
		}
	],
	"topic_vote": {
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"1_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"1_17ngq9wqgRWuFfkv6AhkH7rF5XwZdxCAb8": 1,
		"2_17ngq9wqgRWuFfkv6AhkH7rF5XwZdxCAb8": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"3_17ngq9wqgRWuFfkv6AhkH7rF5XwZdxCAb8": 1
	},
	"next_comment_id": 34,
	"comment": {
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": [
			{
				"comment_id": 1,
				"body": "#Fundamentos de Matemática Elementar\n\nFundamentos de Matemática Elementar - Vol. 1 - Conjuntos - Funções\n- https://web.archive.org/web/20181222190505/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_01.pdf\n\nFundamentos de Matemática Elementar - Vol. 2 - Logaritmos\n- https://web.archive.org/web/20181222190601/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_02.pdf\n\nFundamentos de Matemática Elementar - Vol. 3 - Trigonometria \n- https://web.archive.org/web/20181222190634/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_03.pdf\n\nFundamentos de Matemática Elementar - Vol. 4 - Sequências, Matrizes, Determinantes, Sistemas\n- https://web.archive.org/web/20181222190643/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_04.pdf\n\nFundamentos de Matemática Elementar - Vol. 5 - Combinatória, Probabilidade\n- https://web.archive.org/web/20181222190655/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_05.pdf\n\nFundamentos de Matemática Elementar - Vol. 6 - Complexos, Polinômios, Equações\n- https://web.archive.org/web/20181222190703/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_06.pdf\n\nFundamentos de Matemática Elementar - Vol. 7 - Geometria Analítica\n- https://web.archive.org/web/20181222190713/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_07.pdf\n\nFundamentos de Matemática Elementar - Vol. 8 - Limites Derivadas Noções de Integral\n- https://web.archive.org/web/20181222190721/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_08.pdf\n\nFundamentos de Matemática Elementar - Vol. 9 - Geometria Plana\n- https://web.archive.org/web/20181222190734/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_09.pdf\n\nFundamentos de Matemática Elementar - Vol. 10 - Geometria Espacial\n- https://web.archive.org/web/20181222190907/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_10.pdf",
				"added": 1546618025
			},
			{
				"comment_id": 3,
				"body": "#DICAS\n\nIME: https://web.archive.org/web/20170127170507/https://www.elitecampinas.com.br/vestibulares/ime/dicas/index.asp\n\nITA: https://web.archive.org/web/20170127020335/https://www.elitecampinas.com.br/vestibulares/ita/dicas/index.asp",
				"added": 1546619981
			},
			{
				"comment_id": 4,
				"body": "#INSTITUTO TECNOLÓGICO DE AERONÁUTICA  - Orientações para a Redação \n- http://www.vestibular.ita.br/orientacoes_redacao.pdf",
				"added": 1546620182
			},
			{
				"comment_id": 5,
				"body": "#Partiu Revisar | Estudos\n\nO Partiu Revisar é um aplicativo gratuito e fácil de usar, que gerencia, de maneira rápida e fácil, o agendamento de revisões em uma frequência que reforça seus estudos para concursos públicos, OAB, vestibulares / ENEM e provas em geral. Desenvolvido por um concurseiro, o programa é baseado nos estudos sobre a \"Curva do Esquecimento\", realizados pelo psicólogo alemão Hermann Ebbinghaus. \n\n\"Mas o que é essa tal de Curva do Esquecimento?\". Bem, os estudos de Ebbinghaus sobre a memória humana descrevem que, logo após as primeiras horas de aprendizado, nossa capacidade de retenção do conteúdo sofre uma perda exponencial. Em suas experiências, o psicólogo notou que logo nas 24 horas seguintes ao aprendizado podemos esquecer de 50% a 80% das informações! Em um período de 30 dias, esse percentual cai para cerca de 2%!\n\nSegundo Ebbinghaus, a repetição é um fator decisivo e essencial para uma maior retenção daquilo que aprendemos. Revisões periódicas (feitas a cada 24 horas, 7 dias, 15 dias e 1 mês após o agendamento), são responsáveis por fixar cada vez mais o conteúdo, convertendo-o em conhecimento.\n\nA ideia, portanto, é realizar revisões cíclicas, relembrando o conteúdo em tempos cada vez mais espaçados, para obter novamente 100% da curva de aprendizagem e atingir excelentes resultados em provas. É aí que entra o Partiu Revisar, automatizando esse ciclo e facilitando as revisões. :)\n\nO hábito de revisar faz parte da rotina de todo aquele que objetiva o sucesso nos estudos e é sempre citado nas dicas de quem já foi aprovado em concursos públicos! A releitura do conteúdo estudado é fundamental para fixação da informação e estímulo da memória. Potencialize seus estudos! O Partiu Revisar é a ferramenta que faltava para auxiliá-lo rumo à aprovação em concursos públicos, vestibulares / ENEM, ou OAB!\n\n- https://play.google.com/store/apps/details?id=info.andersonsoares.partiurevisar\n- APK: https://anonfiles.com/M5G3Fepdb6/Let_s_Review_Study_v1.1.4_apkpure.com_apk | SHA-256: 2b2f210a255aba22733113ca01207b103c648c6454fcda5ccea85825b72c6392",
				"added": 1546620931
			},
			{
				"comment_id": 13,
				"body": "#IME 2016 - Motivacional\n- https://youtu.be/XgVwbcvO6Q4\n\n#RobotIME - Instituto Militar de Engenharia\n- https://youtu.be/7cPcnFvh8D0",
				"added": 1546648274
			},
			{
				"comment_id": 14,
				"body": "#MATEMÁTICA - IME 2012 / 2013 - Objetiva\n- https://www.youtube.com/playlist?list=PLkR_H1P7x1rwACdhSsXZJvUmLhQ9qtLIF\n\n#MATEMÁTICA - IME 2012 / 2013 - Discursiva\n- https://www.youtube.com/playlist?list=PLkR_H1P7x1rzBzhi92K_5pwieDjGeMPft",
				"added": 1546649863
			},
			{
				"comment_id": 15,
				"body": "#MATEMÁTICA - IME 2016/2017 - OBJETIVA\n- https://www.youtube.com/playlist?list=PLkR_H1P7x1rxoBHTamCs9Gg8qqr3QPWsk",
				"added": 1546650083
			},
			{
				"comment_id": 16,
				"body": "#IME 2017/2018 - MATEMÁTICA\n- https://www.youtube.com/playlist?list=PLkR_H1P7x1rwr_LIvlB3hQ0cJzR8AM-7b",
				"added": 1546650125
			},
			{
				"comment_id": 17,
				"body": "#Referencial Não Inercial\n- https://www.youtube.com/playlist?list=PLN8OTSLpUpRyNEAzUi-b88z_8y5iNagFu",
				"added": 1546650320
			},
			{
				"comment_id": 18,
				"body": "#Vínculos Geométricos\n- https://www.youtube.com/playlist?list=PLN8OTSLpUpRy8r-VuX6duP0EqsQJRTVKx",
				"added": 1546650385
			},
			{
				"comment_id": 19,
				"body": "#ITA - Polinômios\n- https://www.youtube.com/playlist?list=PLN8OTSLpUpRzIX4SWeLoVhFHvQas8M9rJ",
				"added": 1546650444
			},
			{
				"comment_id": 20,
				"body": "#LIVE IME/ITA - Trigonometria (Matemática)\n- https://youtu.be/ufIL8JL51Go\n\nPDF: https://anonfiles.com/kbBbGbpab5/SUPER_EXATAS_pdf",
				"added": 1546650622
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 2,
				"body": "#Fundamentos de Matemática Elementar - Vol. 11 - Matemática Comercial, Financeira, Estatística\n- https://web.archive.org/web/20181222191031/https://www.doraci.com.br/downloads/matematica/fund-mat-elem_11.pdf",
				"added": 1546618125
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 6,
				"body": "#O Preço da Liberdade\nDesesperado e precisando de dinheiro, na esperança de recuperar a custódia de sua filha, James (Joel Smallbone) embarca em uma entrega sem fazer perguntas. Mas quando ele descobre o que está entregando, deve fazer uma escolha que vai mudar a sua vida. Inspirado em eventos reais.\n\n- https://ok.ru/video/371880430096",
				"added": 1546631381
			},
			{
				"comment_id": 22,
				"body": "#MILAGRES DO PARAÍSO\nChristy (Jennifer Garner) e Kevin Beam (Martin Henderson) são pais de três garotas: Abbie (Brighton Sharbino), Annabel (Kylie Rogers) e Adelynn (Courtney Fansler). Eles vivem em uma confortável casa, junto com cinco cachorros, e acabam de abrir uma clínica veterinária, o que fez com que tivessem que apertar os cintos e hipotecar a casa. Cristãos convictos, os Beam vão à igreja com frequência. Um dia, Annabel começa a sentir fortes dores na região do abdomem. Após muitos exames, é constatado que a garota possui um grave problema digestivo. Tal situação faz com que Christy busque a todo custo algum meio de salvar a vida da filha, ao mesmo tempo em que se afasta cada vez mais de sua crença em Deus.\n\n- https://www.ok.ru/video/85801241270",
				"added": 1546652816
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 7,
				"body": "#Envio de Arquivo Anônimo\nEnvie seus arquivos anonimamente e de graça em AnonFiles\n\n- https://anonfiles.com/",
				"added": 1546631426
			},
			{
				"comment_id": 32,
				"body": "#Hackers dizem ter dados de seguros relacionados ao ataque do 11 de setembro\n\n- https://www.engadget.com/2019/01/01/hackers-claim-to-have-9-11-insurance-data/",
				"added": 1546673774
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 8,
				"body": "#Cientistas corrigiram falha fotossintética, aumentando o crescimento de culturas em 40%\n- https://sci-hub.tw/10.1126/science.aat9077",
				"added": 1546631860
			},
			{
				"comment_id": 26,
				"body": "#O que significa remissão espontânea e quando acontece\nA remissão espontânea de uma doença acontece quando existe uma redução acentuada no seu grau de evolução, que não pode ser explicada com o tipo de tratamento que está sendo usado. Ou seja, a remissão não significa que a doença está completamente curada, porém, devido à regressão da sua evolução, apresenta maiores chances de cura.\n\n\n- https://www.tuasaude.com/remissao-espontanea/",
				"added": 1546657306
			},
			{
				"comment_id": 27,
				"body": "#Fique de bem com o seu cérebro: como usar a neurociência para ter uma vida melhor\n\n\nA palestra terá por objetivo apresentar ao público descobertas recentes da neurociência relevantes ao bem-estar e aplicáveis em seu cotidiano e desempenho profissional, como a interação positiva entre saúde física e saúde mental; o papel fundamental do prazer e da motivação para o desempenho e o bem-estar, a função da felicidade e da tristeza saudáveis em nossas vidas, e a importância do tratamento em caso de tristeza ou felicidade não- justificáveis.\n\nAs diferenças entre o estresse agudo, o estresse crônico e o antecipada (a ansiedade) e como tirar partido deles, a importância do sono e do exercício físico para a saúde mental, e as contribuições da educação continuada, da responsabilidade, do senso de propósito e das relações sociais para o bem-estar.\n\n- https://youtu.be/-WpVs5o6EMY",
				"added": 1546657633
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 9,
				"body": "#ATLANTIS\nA extinta cidade de Atlantis é um lugar tão antigo quanto misterioso. Deusas com cabelo de cobra, palácios tão grandes que dizem terem sido construídos por gigantes e todo tipo de estranheza está presente. É nesse reino que começa a aventura de Jason (Jack DOnnelly), que vai trazer à vida a vasta extensão de mitos e lendas gregas. \n\n- https://megaseriehd.com/series/atlantida/",
				"added": 1546633789
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 10,
				"body": "#Lazarus\n\n- http://www.lazarus-ide.org/index.php\n\nO Lazarus é um IDE de plataforma cruzada compatível com Delphi para o Desenvolvimento Rápido de Aplicativos. Ele tem uma variedade de componentes prontos para uso e um designer de formulários gráficos para criar facilmente interfaces gráficas complexas.\n\nVocê pode criar seus próprios aplicativos comerciais ou de código aberto. Com o Lazarus você pode criar navegadores de arquivos, visualizadores de imagens, aplicativos de banco de dados, software de edição de gráficos, jogos, software 3D, software de análise médica ou qualquer outro tipo de software.\n\n#Tutoriais de Pascal e de Lazarus\n- http://wiki.freepascal.org/Lazarus_Documentation#Lazarus_and_Pascal_Tutorials",
				"added": 1546636253
			},
			{
				"comment_id": 11,
				"body": "#Curso de Java\n- https://www.youtube.com/playlist?list=PLesCEcYj003Rfzs39Y4Bs_chpkE276-gD\n\n#Java Orientado a Objetos\n- https://www.youtube.com/playlist?list=PLesCEcYj003RzkQBaNOOl7zwlIGOfeo1y\n\n#Curso de Android\n- https://www.youtube.com/playlist?list=PLesCEcYj003QeYKOo6NyjmHub4QKue63g",
				"added": 1546636781
			},
			{
				"comment_id": 12,
				"body": "#Rust\nUma linguagem de programação de sistemas que roda incrivelmente rápido, previne falhas de segmentação e garante segurança entre threads.\n\n- https://doc.rust-lang.org/",
				"added": 1546637294
			},
			{
				"comment_id": 21,
				"body": "#Codecademy\nCodecademy é a maneira mais fácil de aprender programação. É interativo, divertido e você pode fazer junto com seus amigos.\n- https://www.codecademy.com/",
				"added": 1546651684
			},
			{
				"comment_id": 33,
				"body": "#LibreTaxi\nUma alternativa grátis e open source ao Uber/Lyft, para conectar passageiros e motoristas.\n- https://libretaxi.org/index-pt.html",
				"added": 1546677660
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 23,
				"body": "#Cyborg 009: The Cyborg Soldier\nBlack Ghost, uma sociedade secreta que manipula todas as ações globais através do submundo, ambiciona levar as guerras, que caminham lado-a-lado com a humanidade desde seu nascimento, para o espaço. Para isso, inicia-se o projeto ciborgue, que consiste na produção de super-soldados para serem usados como armas por Black Ghost. No entanto, uma das mentes brilhantes por trás do projeto, o professor Isaac Gilmore, é atormentado por sua consciência a abandonar o projeto e assim organiza uma rebelião que visa a libertação dos 9 protótipos 00. Joe Shimamura é o protagonista da história que se inicia quando este se junta ao grupo rebelde que decide então utilizar de suas novas aprimoradas habilidades para se voltar contra seus próprios criadores e dar um fim ao período de caos e destruição propagado por Black Ghost. Em meio as suas aventuras, Joe e seus companheiros biônicos ainda se envolvem em conflitos com cientistas megalomaníacos que brincam de Deus em suas experiências na área de genética, terroristas do Oriente Médio, visitantes do futuro, mitos trazidos a vida pelo avanço da tecnologia, habitantes de civilizações perdidas e até cultos religiosos com fins inescrupulosos, tudo isso enquanto lidam com seu drama pessoal por terem sido privados de sua humanidade para serem convertidos em armas de destruição em massa. Agora eles buscam compensar sua existência lutando pela paz e justiça.\n\n- https://www.superanimes.site/anime/cyborg-009-the-cyborg-soldier",
				"added": 1546654738
			},
			{
				"comment_id": 24,
				"body": "#Brave 10\n\nDepois de quase um ano da batalha de Sekigahara, conhecemos Kirigakure Saizou, um ninja do clã Iga que busca a verdade sobre sua vida. Um dia Saizou encontra Isanami, uma garota do santuário de Izumo, sendo atacada por assassinos. Depois de algumas lutas básicas, ele descobre que ela está viajando ao lado de Sanada Yukimura em busca do santuário em Shinshuu, logo após Izumo ter sido destruído por um ataque. Yukimura também está em busca de 10 guerreiros que possam usar suas forças para ajudá-lo a alterar o rumo da história e da guerra que se prepara. E Isanami é uma das que fará a diferença com seu poder no decorrer desse trajeto…\n- https://www.superanimes.site/anime/brave-10",
				"added": 1546654992
			},
			{
				"comment_id": 25,
				"body": "#Mahou Senshi Louie\n\nLouie, um estudante fortão de um grupo de magia, depois de muita relutância, entra para um grupo de três garotas ( a bandida, Genie, a lutadora, e Melissa, a sacerdotiza), virando assim um companheiro de aventuras. Enquanto exploram ruínas, batalham com criaturas das trevas, e fazem novos amigos, eles também desvendam um plano maquiavélico no reinado.\n\n- https://www.superanimes.site/anime/mahou-senshi-louie",
				"added": 1546655091
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 28,
				"body": "#Filosofia e Neurociência • PEDRO CALABREZ\n\n- https://youtu.be/WbiZv9CaFJ8",
				"added": 1546657792
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 29,
				"body": "#O Poder do Hábito – Charles Duhigg\n\nDurante os últimos dois anos, uma jovem transformou quase todos os aspectos de sua vida. Parou de fumar, correu uma maratona e foi promovida. Em um laboratório, neurologistas descobriram que os padrões dentro do cérebro dela – ou seja, seus hábitos – foram modificados de maneira fundamental para que todas essas mudanças ocorressem. Há duas décadas pesquisando ao lado de psicólogos, sociólogos e publicitários, cientistas do cérebro começaram finalmente a entender como os hábitos funcionam – e, mais importante, como podem ser transformados. Embora isoladamente pareçam ter pouca importância, com o tempo, têm um enorme impacto na saúde, na produtividade, na estabilidade financeira e na felicidade. Com base na leitura de centenas de artigos acadêmicos, entrevistas com mais de trezentos cientistas e executivos, além de pesquisas realizadas em dezenas de empresas, o repórter investigativo do New York Times Charles Duhigg elabora, em O poder do hábito, um argumento animador: a chave para se exercitar regularmente, perder peso, educar bem os filhos, se tornar uma pessoa mais produtiva, criar empresas revolucionárias e ter sucesso é entender como os hábitos funcionam. Transformá-los pode gerar bilhões e significar a diferença entre fracasso e sucesso, vida e morte. Duhigg conclui por que algumas pessoas e empresas têm tanta dificuldade em mudar, enquanto outras o fazem da noite para o dia. Descobre, por exemplo, como hábitos corretos foram cruciais para o sucesso do nadador Michael Phelps, do diretor executivo da Starbucks, Howard Schultz, e do herói dos direitos civis, Martin Luther King, Jr.: “Eles tiveram êxito transformando hábitos. Todos começam com um padrão psicológico. Primeiro, há uma sugestão, ou gatilho, que diz ao seu cérebro para entrar em modo automático e desdobrar um comportamento. Depois, há a rotina, que é o comportamento em si. Para alterar um hábito, é preciso modificar os padrões que moldam cada aspecto de nossas vidas. Entendendo isso, você ganha a liberdade – e a responsabilidade – para começar a trabalhar e refazê-los”, diz o autor. Um dos exemplos citados pelo autor diz respeito a ele próprio. Duhigg explica como conseguiu parar de consumir cookies no meio do dia de trabalho ao compreender o hábito que o levava diariamente a uma cafeteria para comê-los, mesmo sem fome – as visitas diárias ao lugar ocorriam por necessidade de socialização. “Refiz o hábito e, agora, pelas 15h30, levanto da minha mesa e procuro alguém para conversar por 10 minutos. E não como um cookie há seis meses”, conta ele. A prática é um dos segredos para a mudança: “Tarefas que parecem incrivelmente complexas no início, como aprender a tocar violão e falar uma língua estrangeira, podem se tornar muito mais fáceis depois de executadas inúmeras vezes. Maus hábitos, como fumar e beber demais, são superados quando aprendemos novas rotinas e a praticamos incessantemente.” Há ainda, segundo Duhigg, os chamados “hábitos mestres”, capazes de desencadear uma série de reações no modo da pessoa organizar sua própria vida. Um bom exemplo de um hábito mestre é o exercício físico. “Quando as pessoas começam a se exercitar regularmente, começam a mudar outros comportamentos que não estão relacionados à atividade física. Passam a comer melhor e a levantar da cama mais cedo. Fumam menos e se tornam mais pacientes. (…) Não está completamente claro porque isso ocorre, mas está provado que exercício é um hábito mestre, que propaga mudanças em todos os aspectos da vida.”\n\n- https://anonfiles.com/J4ZfGcpebd/O_Poder_do_Habito_-_Charles_Duhigg_pdf | SHA-256: e17d7fdf320f52a3b0cdb4ed44389ab74d47ea06e8d7614d6e6b30c471b2756d",
				"added": 1546659137
			},
			{
				"comment_id": 30,
				"body": "#Aprendendo Inteligência, 2ª ed. (2008) - Pierluigi Piazzi\nDurante muito tempo, acreditou-se que a inteligência fosse uma característica inata. O fator genético era considerado bem mais influente que o fator ambiental. Porém, as mais recentes descobertas das neurociências mostram que a inteligência pode ser aprendida, e que esse fato não se dá durante as aulas, mas no momento do estudo individual, extraescolar. Inteligência, talento e vocação são características que podem ser adquiridas com facilidade e um pouco de esforço. Aprendendo inteligência apresenta um panorama do que há de errado na maneira como os alunos encaram os estudos, além de demonstrar, de forma simples, que os erros mais comuns podem ser evitados. Também oferece preciosas dicas de como aproveitar melhor o tempo – por incrível que pareça, estudando menos e aprendendo mais!\n\n- https://anonfiles.com/Hdx3Hapebc/_Pierluigi_Piazzi_Aprendendo_Intelig_ncia_2_e_b-ok.cc_pdf | SHA-256: 997501a3097b796a81845869aeb12460cd7f07c017acc53e5fc07180fdcb2b8a",
				"added": 1546666152
			},
			{
				"comment_id": 31,
				"body": "#A arte da Guerra – Sun Tzu\nO mundo de hoje vive em uma competição feroz, principalmente no âmbito profissional. Milhares de pessoas e organizações enfrentam batalhas diárias, seja na luta por uma promoção ou na disputa por mercados. Vence, em geral, quem está mais bem preparado. Por esse motivo, esta obra, escrita pelo cientista militar e comandante chinês Sun Tzu há 2.400 anos, tem inspirado milhões de leitores da atualidade em inúmeros países. Grandes líderes políticos e empresarias têm usado os princípios das táticas e estratégias militares para chegar a vitórias que transformam o cenário do mundo. O texto original de A arte da guerra de Sun Tzu sofreu inúmeras versões e adaptações. Neste livro, você encontra a versão integral da obra, com todos os 13 capítulos originais, complementados pela interpretação e aplicação moderna do general chinês Tao Hanzhang, um dos arquitetos da Revolução Comunista. Os conselhos de Sun Tzu sobre precisão, timing, manobras, estratégia, flexibilidade, liderança e conhecimento dos pontos fortes e fracos do inimigo são muito poderosos e revelam-se tão verdadeiros e eficazes nos dias de hoje quanto foram no passado para diversas gerações.\n\n- https://anonfiles.com/S8QdH4p8b8/_sun_tzu_a_arte_da_guerra_b-ok.cc_pdf | SHA-256: 4cc1f4144a0a298d25846780e653dd91887555ac52ea1d1ee00d704e873827bf",
				"added": 1546673502
			}
		]
	},
	"comment_vote": {
		"17_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1
	}
}