{
	"next_topic_id": 14,
	"topic": [
		{
			"topic_id": 1,
			"title": "Пробуем завести свой «форум»",
			"body": "Собственно, тест.\n\n![Image](https://gateway.ipfs.io/ipfs/QmctvtMBmPWdAPvN46UgG1YpcrsJ7c9wCwEqR6S4JPsQey)",
			"added": 1475392314
		},
		{
			"topic_id": 2,
			"title": "Юмор с Авиабазы",
			"body": "Илья Муромец рассказывает, как он сражался с Лернейской Гидрой:\n— Отрубаю ей голову — на её месте четыре вырастает. Четыре отрубаю — три вырастает. Три отрубаю — семь.\n— Ну и что?\n— Что, что; полчаса рубил — никакой закономерности.\n\n// http://kbb.livejournal.com/886646.html\n// via http://juick.com/stanislavv/2850577",
			"added": 1477012801
		},
		{
			"topic_id": 3,
			"title": "Чат Авиабазы",
			"body": "Запущен Rocker.Chat на [chat.balancer.ru](http://chat.balancer.ru).\n\n- Хранится у себя, поэтому нет лимитов на историю, количество аттачей и т.п.\n- Хороший современный чат, конкурент Slack. Поддерживает Markdown-разметку сообщений, TeX-формулы в сообщениях, фотки/аттачи.\n- Есть (кроме браузера) приложения под все популярные платформы.\n- Недостаток более-менее заметный только один — нет гостевого доступа. Но это компенсируется наличием [дополнительной] авторизации через Facebook/Twitterg/Google/GitHub.",
			"added": 1477323631
		},
		{
			"topic_id": 4,
			"title": "Ну что, будут тут живые авиабазовцы? :)",
			"body": "В свете телеграмахии становится актуально. Какие там федеративные сети, когда по Арубе/DO/Хетцнеру/ScaleWay пошли долбить...",
			"added": 1524233056
		},
		{
			"topic_id": 1524432615,
			"title": "География Авиабазы в ZeroNet",
			"body": "Однако, Авиабаза в ZN уже географически широко представлена :) Поскольку «настоящих» форумчан тут всего двое, как я понимаю, это всё посторонние любопытные и какие-то технические ноды. К вопросу о том, как живёт сеть даже при отсутствии прямо заинтересованных.\n\n![](https://gateway.ipfs.io/ipfs/QmZLSFR3YDa2QfdE4LVthDmCE2TSub1LnwTabJ9wMc7nH2)",
			"added": 1524432610
		},
		{
			"topic_id": 1524978098,
			"title": "Видео, прибитые на YouTube",
			"body": "Отрабатываю автоматическое выкладывание в ZeroNet. Пока запостил ролик вручную, с командной строки:\n\n![](/big.kopykate.bit/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Apache-kills-i5g53_wIfGI.mp4)\n\nДва Апача занимаются расстрелом Талибана в Афганистане в 2013 году. Видео удалено c YT за натуралистичный контент.\n\n- [Страница с видео на KopyKate](/big.kopykate.bit/?Video=1524977240_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw)",
			"added": 1524978092
		},
		{
			"topic_id": 1525082339,
			"title": "Обмен информацией с «большими форумами»",
			"body": "Начерно запустил трансляцию обновлённых топиков с тех ZeroTalk, где я общаюсь, на форумы Авиабазы: http://www.wrk.ru/forums/viewforum.php?id=253\n\nПока ещё сыро, много багов и TODO. Навскидку:\n\n- [ ] Не выводятся новые топики, только те, в которые есть ответы\n- [ ] Косяки с оформлением + надо будет дать инструкции на тему ZeroNet\n- [ ] Надо также подключить и ZeroBlog'и с комментами.",
			"added": 1525082332
		},
		{
			"topic_id": 1525340361,
			"title": "Су-30СМ разбился у берегов Сирии",
			"body": "«3 мая около 09:45 мск при наборе высоты после взлета с аэродрома Хмеймим над акваторией Средиземного моря потерпел катастрофу российский истребитель Су-30СМ. Оба летчика, до последних минут боровшиеся за самолет, по докладу с места, погибли», - сказали в ведомстве.\n\n![](http://www.balancer.ru/sites/ph/te/telegra/file/53a7e9564cbbfe405da4d.jpg)\n\nВ Минобороны отметили, что, «по предварительной информации, причиной авиакатастрофы могло стать попадание в двигатель птицы». «Никакого огневого воздействия по самолету не было», - сказали в ведомстве.",
			"added": 1525340353
		},
		{
			"topic_id": 1527319248,
			"title": "Авиабаза распределённая",
			"body": "Копилка-заметка во время работ по [Flatnesy](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1526300155_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Flatnesy)",
			"added": 1527319239
		},
		{
			"topic_id": 1527416780,
			"title": "«Оценка в боевой обстановке»: на что способны крылатые ракеты истребителя Су-57",
			"body": "*26 мая 2018, 23:31*\n\nАлександр Бовдунов\n\nРоссия испытала в Сирии оперативно-тактические крылатые ракеты истребителя пятого поколения Су-57. Об этом сообщил министр обороны России Сергей Шойгу. По словам главы оборонного ведомства, ракеты применялись в боевых условиях. Испытание такого вооружения в боевой обстановке крайне важно, подчёркивают военные эксперты. По их мнению, в арабской республике могла тестироваться управляемая ракета Х-59МК2 с проникающей или кассетной боевой частью. В Минобороны РФ подчеркнули, что полученные после испытаний данные позволили приступить к модернизации 11 типов самолётов и вертолётов.\n\n![«Оценка в боевой обстановке»: на что способны крылатые ракеты истребителя Су-57](https://cdni.rt.com/russian/images/2018.05/article/5b093b6e370f2c29528b457b.jpg)\n\n-   © Александр Куденко / РИА Новости\n\n## Боевая обкатка\n\nМинистр обороны России Сергей Шойгу заявил, что ВКС в феврале 2018 года испытали в Сирии современные крылатые ракеты для истребителя пятого поколения Су-57. Заявление было сделано на заседании коллегии Министерства обороны, состоявшемся в пятницу, 25 мая 2018 года.  \n\n> «Для оценки в боевой обстановке заявленных возможностей разрабатываемой военной техники в феврале текущего года проведены практические пуски перспективных оперативно-тактических крылатых ракет с самолёта пятого поколения Су-57», --- сказал Шойгу.\n\nВ ходе доклада министр обороны России подчеркнул важность сирийского опыта для совершенствования отечественных оборонительных систем. В частности, он отметил, что в регионе было испытано более 60 серийных и перспективных образцов вооружений ВКС.\n\nПолученные данные позволили приступить к модернизации «11 типов самолётов и вертолётов», сообщает Минобороны России.\n\nВ конце января 2018 года Борис Обносов, генеральный директор корпорации «Тактическое ракетное вооружение», проинформировал СМИ, что Су-57 приступил к [новой фазе испытаний](https://russian.rt.com/russia/article/473864-su-57-oruzhie-novoe-pokolenie) с применением новейших авиационных средств поражения (АПС).\n\nСообщения о российских самолётах Су-57 в воздушном пространстве Сирии появились в феврале 2018 года. По информации российского Минобороны, Су-57 были в Сирии [всего два дня](https://russian.rt.com/russia/article/487902-rossiya-minoborony-su-57). 24 мая 2018 года глава Объединенной авиастроительной корпорации (ОАК) Юрий Слюсарь подтвердил журналистам, что эти машины действительно проходили тогда боевую обкатку в Сирии. \n\n«Испытание любого вооружения в боевой обстановке даёт максимальное количество информации для разработчиков и эксплуатантов, --- заявил в интервью RT военный эксперт, основатель портала Military Russia Дмитрий Корнев. --- Особого военного смысла применять в Сирии такое оружие нет, это важно скорее с точки зрения разработки и развития вооружений».\n\n## Уникальные ракеты\n\nСу-57, ранее носивший названия ПАК-ФА и Т-50, --- новейший российский истребитель пятого поколения, аналог самых современных американских ударных самолётов F-22 и F-35.\n\nКроме авиационной 30-миллиметровой пушки 9-А1-4071К, ракет класса «воздух --- воздух» и корректируемых авиабомб КАБ-500С в зависимости от целей Су-57 может оснащаться ракетами класса «воздух --- поверхность». Это Х-38МЭ --- высокоточная ракета малой дальности, противорадиолокационная ракета Х-58УШКЭ, тактическая противокорабельная ракета Х-35УЭ и управляемая ракета Х-59МК2.\n\n![](https://cdni.rt.com/russian/images/2018.05/original/5b093c93370f2cae518b458b.jpg)\n\n-   Х-59МК2 \n-   [© Vitaly V. Kuzmin](https://www.vitalykuzmin.net/search#q=%D0%A5-59)\n\nИсточник в оборонно-промышленном комплексе России сообщил, что в Сирии, вероятно, была испытана именно последняя из перечисленных ракет. По его словам, с учётом характеристик: дальности полёта до 285 км и возможности применения против широкого спектра наземных целей --- Х-59МК2 наиболее подходит на роль вооружения, которое могли тестировать в боевых условиях на территории САР.\n\n> «Это очень крутая ракета, бьёт на 285 километров, идёт по рельефу, очень точная. Она бьёт по живой силе противника», --- заявил RT директор Центра стратегической конъюнктуры Иван Коновалов.\n\nЭксперт отметил, что в Сирии вряд ли использовались в боевой обстановке ракеты класса «воздух --- воздух» из--за отсутствия воздушных боёв. Удары по позициям террористов могли наноситься ракетами Х-59МК2 класса «воздух --- поверхность» с проникающей или кассетной боевой частью.\n\n«Если речь идёт о Х-59МК2 и подобных ей ракетах, то это тактическое оружие, --- отметил Дмитрий Корнев. --- В нынешнем виде она является самонаводящейся. На последней версии установлена головка самонаведения. На предыдущих --- телевизионная». Эксперт отмечает, что для управления ракетой требуется наличие стрелка-оператора, который до захвата цели будет сопровождать её, а потом включит систему самонаведения. После этого Х-59МК2 работает по принципу «выстрелил --- забыл».\n\nВ Сирии могли тестироваться и другие уникальные оперативно-тактические ракеты, стоящие на вооружении Су-57. К примеру, К-37М/РВВ-БД --- самая дальнобойная в мире ракета класса «воздух --- воздух» (максимальная дальность --- чуть более 300 км), Х-58УШКЭ (дальность --- до 245 км) с фугасной боевой частью предназначена для борьбы с радиолокационными станциями противника, а Х-35УЭ --- противокорабельная ракета с дальностью пуска 260 км и захвата цели 50 км.\n\nПоследняя предназначена для уничтожения надводных целей и способна лететь над гребнями волн на маршевом участке полёта на высоте 10---15 м, снижаясь при приближении к цели до 4 м. Важное преимущество Х-35УЭ  --- сложность её обнаружения благодаря применению стелс-технологий и спутниковому наведению на цель, что позволяет использовать практически незаметный для РЛС сигнал малой мощности для управления ракетой.\n\n![](https://cdni.rt.com/russian/images/2018.05/original/5b093b97370f2c64518b4575.jpg)\n\n-   Су-57 \n-   [© Vitaly V. Kuzmin](https://www.vitalykuzmin.net/)\n\n## «Важная веха»\n\nВо время выступления Сергея Шойгу на кадрах презентации российского военного ведомства был показан пуск крылатой ракеты из отсека внутри фюзеляжа Су-57.\n\n«Это может быть ракета Х-58 со складывающимися крыльями, это может быть Х-59 со складывающимися крыльями, это может быть что-то ещё», --- прокомментировал презентацию Дмитрий Корнев.\n\nПо мнению эксперта, отработка пусков из внутрифюзеляжных отсеков имеет большое значение для Су-57. «Безусловно, это очень важно. Одним из свойств самолётов пятого поколения является применение систем вооружений из закрытых отсеков. Это позволяет самолёту до применения ракет обходиться без демаскирующих признаков», --- отметил Корнев, добавив, что ракеты на подвеске, с которыми ранее был замечен Су-57, были хорошо заметны для РЛС противника.\n\n«Открыл отсек, выпустил ракету, закрыл отсек. Время нахождения в демаскированном состоянии серьёзно сокращается», --- объяснил Корнев.\n\nТакие испытания свидетельствуют о том, что доработка российского истребителя пятого поколения подходит к концу, считает эксперт. «Это важная веха в подготовке Су-57 к принятию на вооружение», --- резюмировал Дмитрий Корнев.\n\n-   Проверено Сирией: на что способны крылатые ракеты истребителя Су-57\n- Источник: https://russian.rt.com/russia/article/517063-su-57-siriya-ispytaniya-rakety",
			"added": 1527416770
		},
		{
			"topic_id": 1536399336,
			"title": "Блог Авиабазы в ZN",
			"body": "Завёл сабж: http://127.0.0.1:43110/1abLogr5aYPHyNH4K1FAg62Heasr5RzTH/\n\nПока там, наверное, ничего интересного не ожидается, но пусть будет :)",
			"added": 1536399325
		},
		{
			"topic_id": 1539088687,
			"title": "Джефф Безос подписал первое крупное соглашение о доставке грузов на Луну",
			"body": "Глава Blue Origin и Amazon Джефф Безос подписал соглашение о намерениях с двумя немецкими аэрокосмическими компаниями. Оно предусматривает транспортировку «нескольких метрических тонн» грузов на поверхность Луны. База на спутнике должна стать плацдармом для полетов к Марсу.\n\nКосмический проект [конкурента](https://hightech.plus/2018/09/18/spacex-otpravit-v-turisticheskii-polet-vokrug-luni-yaponskogo-milliardera) Илона Маска и SpaceX стал для руководителя Amazon делом жизни, по его собственным словам. Детали миссии Blue Moon Безос уже [раскрыл](https://hightech.plus/2018/10/04/bezos-raskril-detali-pervoi-lunnoi-missii-blue-origin) ранее в рассылке для сотрудников: сначала на Луне построят базу, которая станет плацдармом для полетов к Марсу и дальше, а потом всю тяжелую промышленность выведут за пределы Земли.\n\nВ рамках реализации этого замысла Безос подписал на Международном конгрессе астронавтики в Бремене письмо о намерениях с компаниями OHB Space Systems and Security и MT Aerospace.\n\n> Ни в этом документе, ни в пресс-релизах не уточняется, о каком именно грузе идет речь, но скорее всего это будет инфраструктура, предназначенная для создания «лунной экономики».\n\nЭто соответствует намерению Blue Origin отправлять на Луну грузовой транспорт, который поможет использовать находящиеся там ресурсы.\n\nОдновременно стало известно о запуске проекта Moon Race — соревнования между Blue Origin, Space X, Airbus Air и другими космическими агентствами по разработке технологии, которая сможет обеспечить частным компаниям возможность вести бизнес на Луне.\n\nПодать заявку на участие можно будет в начале 2019\\. Кандидаты смогут выбрать одну из четырех категорий, в которой должны будут предоставить инновационное техническое решение. Это производство, то есть разработка инструментов и средств использования лунных ресурсов; энергетика — разработка технологии выживания лунной ночью; ресурсы — получение «первой бутылки лунной воды»; и биология — создание первой лунной оранжереи, [сообщает](http://www.moondaily.com/reports/Bezos_Blue_Origin_signs_on_to_ship_supplies_to_Moon_by_2023_999.html) Moon Daily.\n\nТаким образом, частные компании США смогут заниматься бизнесом на Луне. Несмотря на то, что Договор о космосе 1967 года, подписанный и США, запрещает частную собственность в космосе, в этом году Палата представителей Конгресса одобрила Акт о коммерческом использовании космоса частными предприятиями. В нем говорится, что американские компании не обязаны следования правилам Договора о космосе.  \n\n«Лунное соглашение», которое как раз [регулирует](https://hightech.plus/2018/08/22/dobicha-resursov-na-planetah-i-asteroidah-ne-protivorechit-kosmicheskomu-pravu) справедливое использование ресурсов Луны и небесных тел, появилось в 1979 году. До сих пор его подписали или ратифицировали только 13 стран, среди которых нет ни США, ни России, ни Китая.\n\n- [Источник](https://hightech.plus/2018/10/09/dzheff-bezos-podpisal-pervoe-krupnoe-soglashenie-o-dostavke-gruzov-na-lunu)",
			"added": 1539088675
		},
		{
			"topic_id": 1543478711,
			"title": "А теперь со всей этой херней мы попробуем взлететь...",
			"body": "*13 Октября 2009*\n\nВ детстве, помню, рассказывали этот анекдот. Стюардесса в салоне нового лайнера объявляет о то, что находится в самолете:\n — На первой палубе - багаж, на второй - бар, на третьей - поле для гольфа, на четвертой бассейн.\nИ добавляет:\n — А теперь, господа, пристегнитесь. Сейчас со всей этой хуйней мы попробуем взлететь.\nВобщем, было бы смешно, если бы не было так грустно.\n\nНа картинке внизу изображён сверкающий свежей краской совершенно новый, не налетавший ни часу лётного времени, Airbus 340-600 - один из самых крупных когда-либо построенных пассажирских самолётов. Фото сделано возле ангара в Тулузе (Франция), где комфортабельный аэролайнер запаркован в ожидании своей команды.\n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_0.jpg)\n\nНаконец появилась команда воздушного корабля: пилоты и механики Abu Dhabi Aircraft Technologies (ADAT). Им предстояло провести все наземные испытания купленного арабской страной самолёта (в первую очередь проверку работы турбин) до того, как А340-600 будет отправлен в Абу-Даби и пополнит флот Etihad Airways.\n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_1.jpg)\n\nАрабская команда оттаксировала самолёт к площадке, где проводятся испытания турбин, и... при совершенно пустом самолёте врубили все четыре турбины на полную мощность в режиме взлёта. Поленившись ознакомиться с Инструкциями по пользованию, абу-дабцы понятия не имели, насколько лёгок А340-600, почти не загруженный топливом, без пассажиров и багажа.\n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_2.jpg)\n\nКогда турбины были разогнаны на всю катушку, в пилотской кабине со страшной силой взревела сирена, предупреждающая об ошибочно выбранном режиме: бортовые компьютеры решили, что пилоты пытаются совершить взлёт в то время, как параметры самолёта не сконфигурированы по топливу и нагрузке, а закрылки, элероны, хвост и проч. не приведены в положение, требуемое для взлёта. \n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_3.jpg)\n\nЧтобы избавиться от назойливого рёва сирены, один из пилотов потянул рычаг выключения размыкателя, ответственного за Ground Proximity Sensor (устройство, распознающее наземные препятствия, мешающие взлёту).\n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_4.jpg)\n\nПосле этого самолётные компьютеры окончательно решили, что самолёт идёт на взлёт - пилоты понятия не имели, что они отключили устройство безопасности, не позволяющее взлетать/приземляться с включёнными тормозами.\n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_5.jpg)\n\nБортовой компьютер автоматически освободил все тормоза на колёсах шасси и самолёт вихрем понёсся вперёд...\n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_6.jpg)\n\nСреди команды из семи человек не нашлось НИ ОДНОГО достаточно умного, чтобы снизить обороты турбин с максимальных оборотов до минимума. В результате двухсотмиллионный новенький самолёт врезался в железобетонный защитный барьер, превратив А340-600 в груду развалин.\n\n![А теперь со всей этой херней мы попробуем взлететь...](http://ruero.com/pic/121009/340/image_7.jpg)\n\nНикаких сведений о пострадавших членах команды самолёта не сообщается, так как Франция и Абу-Даби полностью перекрыли все каналы информации, касающиеся этого инцидента. Объявлено лишь, что освещение этой истории считается оскорблением по отношению к арабам-мусульманам.\n\n*Источник: <http://modeblog.ru/read-to/read-interesnoe/433-arab-avia>*",
			"added": 1543478698
		}
	],
	"topic_vote": {
		"1524924071_17yxw1nenctXqn6BaoR5zx6M1QJSijsoMY": 1
	},
	"next_comment_id": 47,
	"comment": {
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "Ответ с другой машины.",
				"added": 1475392500
			},
			{
				"comment_id": 2,
				"body": "Тест после переименования.",
				"added": 1475393919
			},
			{
				"comment_id": 9,
				"body": "Обновил движок форума. Есть русский интерфейс, поддерживаются картинки (но пока только с других ресурсов, внешние).",
				"added": 1524321992
			},
			{
				"comment_id": 10,
				"body": "И чуть-чуть подпилил дизайн в более синие цвета вместо красных :)",
				"added": 1524322241
			}
		],
		"2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 3,
				"body": "- Сколько времени в открытом космосе может находиться человек без скафандра?\n- Да практически вечно...\n\n(блин, надо на тему картинок форум патчить, чтобы Markdown их показывал)",
				"added": 1503337632
			}
		],
		"4_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 4,
				"body": "Вот, тоже для теста мобильную версию поставил :) Хотя я обычно через свой прокси предпочитаю.",
				"added": 1524234967
			},
			{
				"comment_id": 5,
				"body": "Неплохо. Вот что значит переносимость проекта на Питоне. Штатно обновил сейчас ZeroNet со стартовой страницы. Только сама не перезапустилась, подождал минуту и вручную запустил. После обновления работает.\n\nПрикол в том, что оно обновляется через саму же сеть ZN, поэтому и потенциальные блокировки в Гуглоплее  не страшны.\n\n...\n\nПойду на десктоп, увеличу лимиты на размер сообщений :)",
				"added": 1524235547
			},
			{
				"comment_id": 6,
				"body": "Да, на телефоне не нужно ставить ZeroMe, GIF Time и т.п. У них базы тяжёлые :)",
				"added": 1524235603
			},
			{
				"comment_id": 7,
				"body": "Ну, вот, «2Мб хватит всем» © :D",
				"added": 1524235762
			},
			{
				"comment_id": 8,
				"body": "> [zerobod](#comment_1_1PWU9fvXXssw4fBrAw3xVSQGXyPHAqy8kF): А что ставить?\n\nМожно любые форумы, всё, что *Talk — в них только текст, поэтому весят мало.\n\nБлоги бывают и тяжёлые, но если он весит больше 10Мб, то после выкачивания первых 10Мб будет предупреждение с запросом, не увеличить ли лимит для блога до 20Мб (и потом — далее). Так что всё, что *Blog тоже можно ставить. Да и реально тяжёлых блогов не много.\n\nWiki разные весят мало, там только текст, и их очень мало.\n\nНужно быть осторожным с сайтом с контентом по запросу (разные видео и анимации) и «merger—сайтами». Первое будет качать файлы при попытке обратиться к ним, например, в видео ткнёшься, видео выкачивается, потом лежит на телефоне, раздаётся :) Во втором случае — это по сути базы данных, которые могут использоваться разными приложениями. Например, ZeroMe как раз такой случай. Там хабы весят уже по десяткам мегабайт, но, что хуже, это десятки тысяч мелких файлов. В таких случаях при загрузке сайта будет запрос на подключение соответствующего merger-сайта.\n\nЛюбой непонятный сайт можно удалить в левом боковом меню (на мобильном интерфейсе открывается на стартовой странице при нажатии на мелкую фигулину внизу слева), но обычно это бывает делать лень :)\n\nНачать можно с http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/\n\nИли с http://127.0.0.1:43110/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/\n\nНу а самый богатый каталог (но не полный) — http://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
				"added": 1524249328
			},
			{
				"comment_id": 22,
				"body": "> [batwus](#comment_6_13yRawmXqacaE3GGKGv8ZgBtLBpvpVY2eS): как это редактировать? никак?\n\nНаводишь мышку на свой текст. Слева появляется карандашик. Жмёшь, редактируешь:\n\n![](https://gateway.ipfs.io/ipfs/QmYXUZ7kHjFbVLDvK51CBTjB4FgCd4HWdY5tnSMwDvvDNU)",
				"added": 1525390567
			},
			{
				"comment_id": 28,
				"body": "> [android69](#comment_2_19eNXtGfkViZhka9umGZ7NdvSEqAXRpgxy): Я живой\n\nКу! :)",
				"added": 1525434996
			},
			{
				"comment_id": 32,
				"body": "> [rest](#comment_1_1Cmx3U2PcuenTQqQJnokbGNDnHJ4zP6ED8): Почему у меня ник с собакой?\n\nНики, вообще, сейчас принято писать с собаки. Началось с Твиттера, но прижилось очень широко. Но в данном случае, скорее всего, речь о ноде, выдавшей сертификат. Это как с E-mail, формат `user@server`.",
				"added": 1535881682
			},
			{
				"comment_id": 33,
				"body": "> [skotskripalya](#comment_2_1KRXUMdAAQG7mVFfukcjzXrur2A1iSXodj): А точнее (((\n\nТак что конкретно интересует? :)\n\nЕсть входная страница, где в левой колонке отображаются загруженные сайты (или «зайты», как их обычно называют, zeronet sites -> zites). Форматы сайтов могут быть очень разные. Самые популярные — блоги и форумы (как этот). Блоги обычно на движке ZeroBlog и в названии содержат слово Blog, форумы на движке ZeroTalk и содержат слово Talk :)\n\nПримеры:\n\n- [Форум Infonesy](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/)\n- [Мой блог](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)\n\nЕщё активно используются микроблоги, а ля Твиттера, но они все на одном движке/зайте — ZeroMe. Например, [моя лента там](/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/balancer73@zeroid.bit).\n\nЕсть немного видеохостингов:\n\n- [KopyKate](/big.kopykate.bit/)\n- [RU Video](/1videomkrGfLUNe2RaQJqbumb4nTgbp2J/)\n\nФайловые хранилища:\n\n- [ZeroUp](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/)\n- [ZeroUp@Balancer](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/) (выключен минимальный лимит на 10Мб)\n\nЗачатки музыки:\n\n- [ZeroLSTN](/ZeroLSTN.bit/)\n\nВики:\n\n- [ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/)\n- [Balancer.Wiki](/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/)\n\nИ т.д., и т.п. :) Уточняй, что ещё требуется.\n\n…\n\nА, да, о самой архитектуре. Когда открываешь какой-то сайт, он скачивается тебе на машину и начинает раздаваться от тебя. Обычно выкачиваемый объём не очень большой, если сайт больше 10Мб, то выводится предупреждение и нужно явно подтвердить. Тяжёлые файлы (видео, музыка, полноразмерные фотки) качаются по обращению к ним. Удалить ненужные сайты можно на стартовой странице в их контекстном меню (три вертикальных точки возле названия).\n\nДвижки большинства сайтов можно скопировать (клонировать) себе, чтобы сделать такой же собственный сайт. Например, берёшь блог, в контекстном меню выбираешь \"клонировать\" и получаешь чистый пустой блог, который можешь вести сам.",
				"added": 1535883326
			},
			{
				"comment_id": 34,
				"body": "> [stpaulus](#comment_1_1ACuyzfqJgZxS9cjSSFqPWv9QaKCcrVgCK): как тяжко оказывается к новому интерфейсу приспосабливаться...\n\nДа, форумы тут больше соответствуют контексту «пост + комменты» — порядок «вверх ногами» и без разбивки на страницы. В принципе, вопрос решаемый, можно и переписать в более привычный вид. Просто пока не горит.",
				"added": 1535892300
			},
			{
				"comment_id": 35,
				"body": "> [davex](#comment_1_1CX6YV5TarLaHj7KzGrHJt3PGxexUz7y6S): Тест (первый мой пост здесь, надеюсь бить не будут)\n\nТут пока не за что бить :D Да и инструментов таких нет, максимум можно в игнор занести :D",
				"added": 1535919456
			},
			{
				"comment_id": 36,
				"body": "> [valentinnn](#comment_1_18vnhKJaJ1BK4Teoj1ijbjZsg9Mm7Qej1f): как себе аватарку прицепить, а то я без аватарки себя прям голым очучаю\n\nПока никак. Это изначально слишком анонимная система :D Но буквально вчера мне в голову пришла идея, что можно придумать что-то типа gravatar.com — отдельный сайт для ZeroNet, где можно выкладывать свой аватар, а другие сайты смогут его использовать :) Надо будет подумать, как лучше сделать.",
				"added": 1535972338
			},
			{
				"comment_id": 37,
				"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Еще можно забанить :D\n\nЭто не будет честный привычный бан. Писать-то автор сможет и дальше :) Ну, если не считать принудительную блокировку записей владельцем сайта.",
				"added": 1535972399
			},
			{
				"comment_id": 38,
				"body": "> [geekless](#comment_4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Есть и привычный бан. max_size = 0 для идентификатора пользователя, и все хосты удалят его данные. \n\nРазве удалят? ИМХО, только новые не сможет. Хотя не проверял. А так — да, я отмечал, «*если не считать принудительную блокировку записей владельцем сайта*».",
				"added": 1535975595
			},
			{
				"comment_id": 39,
				"body": "> [geekless](#comment_5_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Можно ZeroMe подключить в качестве источника\n\nЗная один только ZeroID/хеш юзера невозможно узнать, на каком хабе ZeroMe хранятся данные. И поэтому ссылку по ним не сгенерировать.\n\n`http://127.0.0.1:43110/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/avatar.jpg` — вот это `1BLueGvui1GdbtsjcKqCf4F67uKfritG49` заранее неизвестно.\n\nТ.е. у меня идея делать что-то типа `http://127.0.0.1:43110/1zerovatar.bit/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/avatar.jpg`.\n\nХотя, это же всё равно юзеру надо на новом сайте регистрироваться… Теоретически можно придумать отдельный маленький (сильно ограниченный по объёмам, чтобы не мусорили) ZeroMe-хаб для таких ZN-граватаров и базовой инфо :)",
				"added": 1535975849
			},
			{
				"comment_id": 40,
				"body": "> [geekless](#comment_7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если бы это было невозможно, сам ZeroID не мог бы делать поиск пользователей по имени\n\nЗная только идентификатор — нельзя. Нужно ещё дёргать базу реестра. И задачу уже нельзя решить статическим вызовом, только через запросы к БД. В результате простая косметика превращается в активное программирование :)",
				"added": 1535976340
			},
			{
				"comment_id": 41,
				"body": "> [geekless](#comment_9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Там проще всё. Сначала через кроссайтовый запрос напрямую читаем 1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV/data/userdb/<ID>/content.json, потом сразу подставляем в <img> кроссайтовую ссылку на аватар.\n\nПо два запроса на каждый аватар получается. Хотя для локалхоста (и асинхронно), конечно, не шибко критично. Так что, наверное, сработает, да. И новой сущности не нужно.",
				"added": 1535978123
			},
			{
				"comment_id": 42,
				"body": "> [oob0imah](#comment_2_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): ну да. вышел, зашел снова. признают меня. видать и впрямь проблема в кириллице\n\nАга.",
				"added": 1535988539
			},
			{
				"comment_id": 43,
				"body": "> [oob0imah](#comment_3_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): ну, раз я сам догадался о причине проблемы, то будем считать, что порог вхождения я преодолел :)\n\n:D",
				"added": 1535990454
			},
			{
				"comment_id": 44,
				"body": "> [oob0imah](#comment_4_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): oob0imah \n\noob0imah-баг :)",
				"added": 1535993988
			},
			{
				"comment_id": 45,
				"body": "Ну, вот вам и черновые аватарки для теста :) Обуждение — http://127.0.0.1:43110/1ideasVz3NzYp24L2tzkt6Prp81xqmTJv/?Topic:1536099680_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/ZeroTalk+avatares",
				"added": 1536099725
			}
		],
		"1524432615_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 11,
				"body": "> [paulelms](#comment_2_1B2bJtwCjwokiJCzXSsDPRo8ghTG8YJutc): А, я понял смысл поста — здесь должно быть изображение ;-)Заглушка отобразилась только спустя время, когда изображение не смогло загрузиться.\n\nКартинка на IPFS лежит. Наверное, нужно в дизайне вокруг картинок добавить какие-то бордюрчики, чтобы при отсутствии загрузки было видно :)",
				"added": 1524466284
			},
			{
				"comment_id": 12,
				"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Лучше вместо ipfs.pics использовать ipfs.io, у меня тоже картинка не грузится из zn, приходится вручную дергать.\n\nЯ просто ленивый и подставил как есть после аплоада :) Сейчас отредактирую.",
				"added": 1524474558
			},
			{
				"comment_id": 21,
				"body": "Не знаю, кто все эти ~~люди~~ ноды, но Airbase.Talk раздают уже, как минимум, 126 узлов ZN :)\n\n![](https://gateway.ipfs.io/ipfs/QmXKBPaNAiP45Wynu2a1aDiQZpMiroKscwETvGEKecddGC/2018-0503-airbase-talk-geo.png)",
				"added": 1525378586
			},
			{
				"comment_id": 30,
				"body": "Количество раздающих узлов стабильно упало до ~25-29 штук. Цифры примерно одинаковые на разных нодах, внешних и внутренних. Похоже, это сейчас и есть реальное число узлов-подписчиков :)",
				"added": 1526188107
			}
		],
		"1524908162_13Bk8YRvoit5Mb7QFNRLLxFUajTSmxXcoz": [
			{
				"comment_id": 13,
				"body": "> [poll](#comment_3_13Bk8YRvoit5Mb7QFNRLLxFUajTSmxXcoz): Тэги другие. :(\n\nДа. [Markdown](https://ru.wikipedia.org/wiki/Markdown). Он сейчас всюду используется и на голову обошёл BBCode :)\n\n---\n\n[![](https://gateway.ipfs.io/ipfs/QmU7dX65Cirmv6XWAwu351RR6XSyBJJZfv2ExF4KG2UDQh/2018-04-28_13-56-23-800x.png)](https://gateway.ipfs.io/ipfs/QmXdeX73X3HieHMiT3Jx24tWK2bXR8qNBDRTdnFhyk1Lt2/2018-04-28_13-56-23.png)\n\n---\nТвой вариант будет таким:\n\n```\n![](http://kedr-pult-1.inp.nsk.su/DETECTOR/ATC/PIC/flower.jpg)\n```\n\n![](http://kedr-pult-1.inp.nsk.su/DETECTOR/ATC/PIC/flower.jpg)\n\nМнемоника:\n\n- Ссылки в Markdown базируются на принципе `текст ссылки (сама ссылка)`. Типа, `Авиабаза (www.airbase.ru)`. Поскольку текстом ссылки может быть не целое слово, то текст ссылки берётся в квадратные скобки (ну и пишется без лишних пробелов между скобками): `[Форумы Авиабазы](http://forums.airbase.ru)` → [Форумы Авиабазы](http://forums.airbase.ru).\n\n- Если ссылка является картинкой и перед ней поставить восклицательный знак, то такая ссылка вставляется как картинка.\n\n- В случае картинки текст ссылки не обязателен. Так и получаем формат `![](http://сайт/картинка.jpg)`.\n\n- Я ещё от себя добавил, если «картинка» оканчивается на `.mp4`, то это видео :) Пример: [Вставка видео в посты](/15zr8fG5h9FZu6dt5CC9kQ1F7PMpiGu6Tm/?Topic:1524298219_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/)",
				"added": 1524913357
			},
			{
				"comment_id": 14,
				"body": "> [poll](#comment_3_13Bk8YRvoit5Mb7QFNRLLxFUajTSmxXcoz): Тэги другие. :(\n\nВот, кстати, полезный инструмент: [Как скопировать статью из Clearnet в ZeroNet ](/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:6:Как+скопировать+статью+из+Clearnet+в+ZeroNet)\n\nПример такой копипасты: [GDPR как оружие массового поражения](/1QHkZVa1z3TRrerAqjExERavvodW75bA3c/?Topic:1524754909_13Nambun2kMQsdG9vCTvtZSnsivADA2Qro/GDPR).\n\nПравда, минус в том, что картинки в таком случае берутся с оригинального сайта. Соответственно, могут пропасть или быть защищены от хотлинкинга.",
				"added": 1524913669
			},
			{
				"comment_id": 15,
				"body": "> [evgeniz](#comment_1_17U6jiQcZygFEwudgSCnGpWG4RWWSQ4rdP): разраз... проверка...\n\nЕсть контакт :)",
				"added": 1524916013
			},
			{
				"comment_id": 16,
				"body": "> [smesharik](#comment_1_17yxw1nenctXqn6BaoR5zx6M1QJSijsoMY): И пофиг на блокировки.\n\nДело даже не в блокировках. Их можно обходить. А вот то, что отсюда никто не грохнет видео, как это постоянно случается с YouTube — это большой плюс :)\n\nТолько народа не хватает, чтобы для комфортной работы хватало пиров. Если раз в 10 поднять число пользователей ZeroNet, вот тогда лафа будет :)",
				"added": 1524927253
			}
		],
		"1524978098_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 17,
				"body": "> [anotherneko](#comment_2_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Похоже для воспроизведения нужно подключить KopyKate\n\nДа, естественно :) Видео же оттуда берётся.\n\nНадо будет допилить движок форума, чтобы можно было в настройках указать сайты, которые требуется загрузить для полноценной работы.",
				"added": 1525020914
			},
			{
				"comment_id": 19,
				"body": "> [helicopter](#comment_1_15P3kUm9867QYk1Z2CMDmdR7AcE6PxmCEu): Тоже не воспроизводится.\n\nХм. А если прямой ссылкой? — http://127.0.0.1:43110/big.kopykate.bit/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Apache-kills-i5g53_wIfGI.mp4\n\n> No video with supported format and MIME type found\n\nЕсли KopyKate нет, то по этому адресу отдаётся простой HTML с сообщением о том, что зайт не загружен, естественно, что такое «видео» воспроизвестись не может :)",
				"added": 1525158722
			}
		],
		"1525082339_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 18,
				"body": "> [deepstrelok](#comment_1_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Сначала подумал, что будет автодобавление записей со всей информацией в базу форума. Но нет. Прокси.\n\nДа, я подумал, что для привлечения внимания, лучше контент оставлять в ZN :)",
				"added": 1525084550
			},
			{
				"comment_id": 29,
				"body": "В какой-то мере интересная статистика переходов в ZN с основных форумов («Просмотров» тут на самом деле «Переходов с клирнета на ZN-прокси»).\n\n![](https://gateway.ipfs.io/ipfs/QmdmWSey5xSPFrpuHpbnwLxpUitq9GiMjg6im2MZsQdtjR)",
				"added": 1525926820
			}
		],
		"1525340361_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 20,
				"body": "> [Переслано из WarGonzo]\n> По информации WG вылет СУ-30 из базы Хмеймим был связан с патрулированием сирийских берегов и прилегающей к базе акватории.\n\n> Остов самолета СУ-30, включая кабину пилотов, уцелили. От удара об воду оторвались одно из крыльев и хвостовая часть, - также сообщает подробности крушения источник WG.\n\n> Стартовали работы по поднятию корпуса СУ-30 со дна Средиземного моря\n\n> Военные водолазы, работавшие на месте катастрофы подтвердили гибель пилотов\n\n> Как сообщили WG очевидцы - пилоты как минимум 5 раз пытались выравнять носовую часть истребителя во время падения\n\n> Очевидец из Джабли сообщил WG, что двигатель СУ-30 заглох через 40 секунд после взлета на высоте порядка 200 метров. Перед тем как ударится о воду истребитель перевернулся в воздухе как минимум 3 раза и затем упал в воду левым боком «хвостом вниз». Первыми к месту катастрофы подошли два рыбацких баркаса в надежде спасти пилотов. \n\n> По словам местных глубина моря в этом квадрате составляет 17 метров. К слову, по информации нашего источника уже среди военных, распространяемое в соцсетях фото крушения - фейк.\n\n- https://t.me/airbase_ru/82475",
				"added": 1525345865
			}
		],
		"1524924071_17yxw1nenctXqn6BaoR5zx6M1QJSijsoMY": [
			{
				"comment_id": 23,
				"body": "> [batwus](#comment_3_13yRawmXqacaE3GGKGv8ZgBtLBpvpVY2eS): страницы не найдены\n\nДа, тут хитрость есть, надо будет её расписать потом подробнее.\n\n- Видео на самом форуме не хранятся. Они хранятся при помощи ZeroNet-сайта KopyKate: http://127.0.0.1:43110/big.kopykate.bit/\n- Сам сайт, пока его не откроешь не загрузится. Т.е. нужно открыть его по ссылке выше.\n- Кроме того, размер этого сайта уже больше 10Мб, а это в ZeroNet вызывает предупреждение и запрос, грузить ли его дальше. Нужно при открытии дождаться появления соответствующего вопроса сверху-справа и подтвердить (увеличение лимита до 20Мб).\n- Вот после этого видео на форуме будут показываться :)",
				"added": 1525390759
			},
			{
				"comment_id": 24,
				"body": "> [batwus](#comment_7_13yRawmXqacaE3GGKGv8ZgBtLBpvpVY2eS): Not FoundAdding new sites disabled on this proxy [...]\n\nА, ты через прокси ходишь. Нет, через прокси видео работать не будет. Надо ставить у себя локальный клиент ZeroNet.",
				"added": 1525395860
			},
			{
				"comment_id": 25,
				"body": "> [batwus](#comment_8_13yRawmXqacaE3GGKGv8ZgBtLBpvpVY2eS): я не хожу\n\nВангую — ходишь :D И у тебя в адресной строке светится `https://proxy.zeronet.a0z.ru/…`. И ты нажал на ссылку на форумах.\n\nZeroNet работает без серверов. Для этого ставится специальная программа на комп, которая становится твоим собственным персональным сервером (нодой/узлом ZeroNet), с которым работаешь только ты. А он в фоне от тебя занимается обменом данными с другими нодами, так что тебе становится пофиг на провайдеров. И при «штатной» работе у тебя в адресной строке светится адрес твоего компа: `http://127.0.0.1:43110/…`. Но в ZeroNet сделали клёвый шаг, позволяя настроить ноду в режим, когда через неё в сеть могут заходить пользователи обычного Интернета ничего не устанавливая, чтобы посмотреть что к чему или чтобы на ресурсы сети можно было давать ссылки в обычном Интернете. Как я и делаю на форумах Авиабазы.\n\nЧтобы работать в ZeroNet полноценно, нужно скачать программу-клиент ( https://github.com/HelloZeroNet/ZeroNet-win/archive/dist/ZeroNet-win.zip ), распаковать и запустить.\n\nТолько возникает проблема переноса этого твоего аккаунта. Его подтверждением является приватный ключ, который сейчас хранится только в памяти zeronet-прокси и как только я его перезапущу, он исчезнет. И ты никогда не сможешь писать от имени `batwus`.\n\nСейчас сохрани твой приватный ключ на прокси:\n\n![](https://gateway.ipfs.io/ipfs/QmbrCVCnJpSQu1jq6LPE92TnsbkQ8MDSbnvAmJ5br7A3iR/2018-0504-zeronet-user-menu-003.png)\n\n![](https://gateway.ipfs.io/ipfs/QmXXR3QYpisrC9fUduXYJg5BSh33LzA1KATjBQyAcpwhei/2018-0504-zeronet-private-key-004.png)\n\nА я поищу, как можно попробовать восстановить приватный ключ ZeroID.",
				"added": 1525415788
			},
			{
				"comment_id": 26,
				"body": "> [balancer73](#comment_25_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А я поищу, как можно попробовать восстановить приватный ключ ZeroID.\n\nАга, всё, нашёл. Если придётся потом восстанавливать аккаунт или логиниться на другом прокси, нужно будет при логине ввести этот ключ и тогда, при заходе на сайт ZeroID как для регистрации, автоматически восстановится твой аккаунт.",
				"added": 1525416332
			},
			{
				"comment_id": 27,
				"body": "Вот на этом прокси просмотр ролика в этом топике работает:\n\nhttps://www.zerogate.tk/1Jb5ZdmvTzVnHpa2hayjQk3H2kZgNVbmBb/?Topic:1524924071_17yxw1nenctXqn6BaoR5zx6M1QJSijsoMY/+021",
				"added": 1525418263
			}
		],
		"1527319248_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 31,
				"body": "Rslsync ключ с тестами по видео: BZGD4GMU36OIB7MLHG2SFCMCXDTS27TND\n\n…\n\nДумаю, имеет смысл разделять сайт по основному контенту (тексты + основные картинки) и тяжёлое видео. Про потенциально большие фотогалереи пока не думал. Но, очевидно, что там в любом случае будет деление по авторам фотогалерей.",
				"added": 1527319271
			}
		],
		"1543478711_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 46,
				"body": "> [dude](#comment_1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): картинки не видно.\n\nМожет, стоит блокировка загрузки с других сайтов? Например: http://ruero.com/pic/121009/340/image_0.jpg\n\nЯ не стал перевыкладывать в IPFS/etc, картинки показывают пока на оригинальный сайт. Вручную ломает, а скрипт для автоматизации процесса ещё не написал :)",
				"added": 1543505460
			}
		]
	},
	"comment_vote": {
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_17yxw1nenctXqn6BaoR5zx6M1QJSijsoMY": 1
	}
}