{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 1,
				"body": "Zeronet was working well for me before the V2 phaseout. So IMO, the first and only initial focus should be on updating Zeronet to V3 Tor. And this upgrade should be easy enough for mere mortals to perform.\n\nI'd love some new essential features (no bloat)...but please keep ZeroNet as minimalist as possible.",
				"added": 1637594687
			},
			{
				"comment_id": 2,
				"body": "There was a fellow years ago who argued that moving to a Blake hash would solve many problems. That's a big jump...but long term might be worth considering. My biggest criticism of the existing ZeroNet is it's \"heaviness\". I much prefer lightweight and fast software.",
				"added": 1637594857
			},
			{
				"comment_id": 8,
				"body": "I've given up upgrading to V3 Tor for now. Continue to beat these old Tor browsers, despite the need to replace them every time you close. The Tor browser immediately updates itself without permission.\n\nNeed a V3 update which uses the standard Zeronet upgrade function from the config screen.....",
				"added": 1637855154
			}
		],
		"1637516974_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN": [
			{
				"comment_id": 3,
				"body": "If I recall, Play just contained standard torrents. So could you explain the utility of that to me because I still don't get it. In contrast, I2P torrenting provides pretty complete protection.",
				"added": 1637595001
			},
			{
				"comment_id": 5,
				"body": "> [killerwhale905](#comment_21_1PB1YKkXjDp7fy4WC1bB9iw6V9Hp2thxWN): Yes Play was just a torrent catalog of sorts. its just like the yify movies site on the clear-web. Only with no ads and a nicer website experience. Ive never tried I2P torrenting before. Only P2P over tor or some other proxy.\n\nI prefer utilities without web interfaces like transmission, but must admit that I2Snark (?) seems to work pretty well. In many ways, torrenting may be the sweet spot for I2P. Other applications struggle a bit due to the latency of that network.",
				"added": 1637606997
			}
		],
		"1636789811_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 4,
				"body": "Just post it to any appropriate chan on Zeronet using a new ZeroID key (zip up your normal key - user.json I think, then generate another). Post only with that new key. After you've posted your video and are satisfied everything works - destroy that unique key with a full wipe). Unpack your old key and return to normal posting.\n\nThereafter, your video survives as long as people seed it. No one can delete without your destroyed key. And there is zero provable connection to you. Mission accomplished.\n\nNation states have the ability to detect internet traffic volume and could conceivable \"break\" Tor to some extent just by watching volume. But Zeronet secures it's connections with TLS while transferring files with BitTorrent. Can't imagine a more nightmarish situation for nation states than someone using Tor, TLS, and BitTorrent. Only I2P would beat that.Bottom line? You can't be censored. They can't take it down. Only individual Zeronet users can censor you by refusing to seed.\n\nAs I see it, 99% of users would censor CP. But most would never censor political speech. Even over the top political speech. So posting on Zeronet puts nation states in an impossible situation. They could only censor by shutting Tor down - because Tor is centralized. Once Zeronet acquires I2P transport - even that possibility goes away.\n\nDid you know that sites on ZeroNet routinely go down? And no one notices because they keep running normally due to seeders? Happened. There are also dead people here. Or sites which were created by no dead people - but still live on.\n\nSome of the newer systems like TaosLFS or IPS may have advantages over Zeronet. but Zeronet is the \"little engine that could.\" Simple often works.\n\nOur biggest problem right now is that monkeywrench the Tor people threw at us with their V2 phaseout. If we can get past that and upgrade to V3 - there is no stopping Zeronet.",
				"added": 1637596301
			}
		],
		"1637341086_1Q3bW6Z7c5Fe8Nnr9T93pEBgSrR5erPgyk": [
			{
				"comment_id": 6,
				"body": "> [xanadu](#comment_91_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): 127.0.0.1:43110/Stats\n\nStrangely, I'm using the original unmodified Zeronet with with the Tor browser proxy (had to downgrade to an older version since V2 support was removed on the new). I'm using V3 trackers easily on an Ubuntu 18.04 variant - and all are stable. Weird?",
				"added": 1637607485
			},
			{
				"comment_id": 7,
				"body": "> [inis](#comment_10_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ): Thanks, I didn't know about this feature. [...]\n\nYeah, one might think he would notify everyone out of simple courtesy. Unfortunately, all of us owe him - he doesn't owe us jack. Wish I had coding skills :(",
				"added": 1637607658
			}
		]
	},
	"comment_vote": {}
}