{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1570061009,
			"title": "How to read Comic Books on ZeroNet (tutorial)",
			"body": "(One of my posts on ZeroMe)\n\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1DMTYjzfkFHyB8yZ37sMBuTirTUp5bWLQC/1570060441\n\nI've talked to the zite dev, and he might implement some more features aimed at comic book reading but at the moment it works fine as both a fit-to-width and fit-to-height fullscreen comic book reader.",
			"added": 1570061008
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 1,
				"body": "Have you tried Voat? I left there because of the blatant racism. I haven't seen any real racism so far on ZeroNet, only edgelords.",
				"added": 1569729921
			},
			{
				"comment_id": 3,
				"body": "> [ilduce](#comment_4_1CAq9Lor26iBmSMSQpXiBJUL6b6Y5WU8UA): no racists on voat you filthy nigger.  go back to your synagogue kike.\n\nIf I'm not as racist as you'd want, how do  you expect me to be insulted by being compared to black people?\n\nYou're too stupid to insult me, and I don't like stupid people. Muted.",
				"added": 1569741263
			}
		],
		"1569711666_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_20_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): As long as they're not paying for it or actually touching anyone, it seems to me there isn't any support being offered to the miscreants.\n\nWhat's the point of PornHub Premium if they thousands of free videos?",
				"added": 1569730087
			}
		],
		"1570017594_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 4,
				"body": "ZeroWorld, a tweaked version of ZeroTalk, supports pictures.\n\nhttp://127.0.0.1:43110/1K3zGnsgcppi47PMdpLAVj2t79s3D7viEX/\n\nThey autoload and thus seed I assume.",
				"added": 1570052997
			}
		],
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 5,
				"body": "> [randomshits](#comment_190_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): For you guys who use strict tor, I hope you don't use Apple or Microsoft products and have ditched your mobile phones as well. (Those can be used against you just as easily) Life is too short to live in constant fear [...]\n\nZN on TOR on my Linux computer, tunneled through a logless VPN on my router with custom firmware. As soon as decent open source CPU's are available, I'm jumping the Intel/AMD built-in spy chip shit ship.\n\nOn my phone I run LineageOS, a custom ROM based on AOSP without any Google apps. Next stop, the Librem 5.\n\nLife's too short to live in constant fear, lets not wear seatbelts.\n\n> [nitrowing](#comment_1_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe): I usually use Opera GX with the built-in VPN turned on\n\nThis doesn't mask your real IP on ZeroNet. Also, on free VPN's your browsing habits such as what sites you visit, how long you stay and at what times is the product the VPN provider sells.",
				"added": 1570054185
			}
		],
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 6,
				"body": "Buttons are missing graphics and images not showing... Any ideas?",
				"added": 1570055146
			},
			{
				"comment_id": 7,
				"body": "> [ssdifnskdjfnsdjk](#comment_934_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): LEFT corner the menu has the checkbox to automaticaly load images. once i ticked it, and reloaded page, it then loaded the images..\n\nDeleting and reloading the zite+your tip, it worked. Thanks!",
				"added": 1570130884
			}
		],
		"1570142685_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": [
			{
				"comment_id": 8,
				"body": "The main fucking page is ZeroHello, ZeroTalk is one of the default suggested site.\n\nExamples of interest-based forums could be ZeroGamingTalk (http://127.0.0.1:43110/1J789oNvwoawy3xjfhfxEfvTeNk61JYf4Y/) and 0/SciFi (http://127.0.0.1:43110/1BrgXu4E6jzdtvwec9oEU5Fir7355yeJF3/).",
				"added": 1570166294
			}
		],
		"1570159543_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 9,
				"body": "Testing formats, all links to official ZeroHello\n(1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D):\n\nRaw:\n\nhttp://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\n\n/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\n\n1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\n\nNameCoin:\n(Why the weird domain? Dunno, but found several domains linking to ZeroHello, this is a random one).\n\nhttp://127.0.0.1:43110/heiha.bit\n\n/heiha.bit\n\nheiha.bit\n\nName.YO:\n\nhttp://127.0.0.1:43110/hello.yo\n\n/hello.yo\n\nhello.yo\n\nMarkdown\n\n[ZeroHello](/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D)\n",
				"added": 1570207160
			}
		],
		"1570206751_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 10,
				"body": "It was down on one union circuit but when I renewed identity it worked.",
				"added": 1570207336
			}
		],
		"1570208803_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 11,
				"body": ">I see many Chinese language pages that appear to have been updated for a long period, and then were abandoned. Is the Chinese ZN just so isolated that it exists separately from us in a kind of balkanized way? Or is this the result of Chinese government countermeasures?\n\nWithout being able to understand what the different Chinese zites are/were about, I'm assuming they're a general range of zites comparable to the English language zites.\n\nI've had to purge my zite list several times after visiting ZeroSites-type zites and exploring what turned out to be outdated and abandoned English language zites. In my experience 2/3rds of the zites I've visited have been abandoned.\n\nPersonally I think the same thing happened to those unupdated Chinese zites, people just lost interest.",
				"added": 1570210084
			}
		]
	},
	"comment_vote": {
		"155_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"77_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"3_149JsPomUWvpfHqaAPPZhdxu24FGnKVnCg": 1,
		"11_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"934_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"29_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1
	}
}