{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV": [
			{
				"comment_id": 1,
				"body": "зацените идею:\n\nДецентрализованная система самоуправления с регистрацией по паспорту с хранением истории и сделок(заказ - исполнение) между пользователями в блокчейне, без модераторов, каждый сам себе модератор, которая будет постепенно вытеснять снизу вверх управленцев. Это как профсоюз только более живучая.\n\nкак вариант система самоуправления\nв которую люди будут скидываться деньгами на подобии ЖКХ\nсоздавать темы для обсуждения реализации каких то проектов, голосовать в которых деньгами(плата за ЖКХ), начиная от обустройства жилища далее объединяться с другими людьми для чего то большего например постройки дороги и тд\nчтобы исполнители регестрировались в этой же системе\nсома система децентрализованная и хранится на ПК позователей\nрегистрация по паспорту\nчтобы вся история(переписки, реализация проектов, косяки) хранилась в блокчейне никогда не удаляется и ее не возможно было изменить\nкаждый сам себе модератор, без цензуры сверху\n\nесли такая система будет реализована то она будет существенно более эффективная чем текущая бюрократия\n\nвсе захотят ее использовать вместо текущих ЖКХ компаний т к дешевле\nа дальше она снизу вверх будет вытеснять управленцев, вплоть до того что например в мэрии можно будет сделать своего представителя от системы, который все вопросы будет выносить на обсуждение в форум и ничего не сможет сам решать(по официальной договоренности) и тд, не будет накладных расходов на бюрократию\n \nа еще добавлю\nв этой же системе возможно делать кооперативы так же без лишней бюрократии \nну и в развитии если наберется критическая масса людей то и гайки будет намного сложней закручивать",
				"added": 1527353302
			},
			{
				"comment_id": 2,
				"body": "> [anotherneko](#comment_79_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Кто и как будет регестрировать и проверять паспорт на уникальность и предмет мэдскилзов в пеинте? Как быть с теми кто потерял свои ключи?\n\nну самый простой вариант - сотрудничать с гос услугами, система то прозрачно и нет никаких оснований с ней бороться\nвариант deepstrelok тоже норм\n\nфишка системы не в протиьвопоставлении комуто а надежности и равности всех участников без централизации",
				"added": 1527921182
			}
		]
	},
	"comment_vote": {}
}