{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1618161310,
			"title": "Conspirationism is a mental health issue !",
			"body": "We are right now developing a conspirationism vaccine injected directly in the mother ovaries to prevent all emergence of this terrible disease. We hope that soon, through a careful mandatory vaccination program to be able to heal and help all the children of the world. Thereafter they will all be forever happy and healthy.\n\nFor more informations on this great investment, please use zeromail ! \n\nLet's together make the world a better place, for all !",
			"added": 1618161309
		},
		{
			"topic_id": 1618203663,
			"title": "White Live Matter is a conspirational, terrorist and racist idea !",
			"body": "We the wisest experts, based on our scientific laws and moral superiority, have decided that it was time to white genocide the west, and replace, this native conspirationalism inflicted native population with other people of our own choosing.\n\nWe don't tolerate opposition to our plans. Due to our certificates of advanced highest studies, and our limited attendance conferences, we always know what's right for us all.\n\nWe will censor all opposition, arrest and hunt you down. Remember it's always for your own good and the betterment of the community.",
			"added": 1618203661
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1618088512_13F2Tpa4B5BT72c2Qg3eSLWsGhjZPiCp2g": [
			{
				"comment_id": 1,
				"body": "Zoomers, boomers, language used by conspirationists!",
				"added": 1618161074
			}
		],
		"1618161310_1AjYqBvptvn6szy3VytC28obDFqsBM27jp": [
			{
				"comment_id": 2,
				"body": "Zeronet is already infected ! it's terrible. Red Zone !!! If only we could have saved you, by protecting your mothers... The Good News is that we will succeed with your wives and daughters, so that one day, the earth is conspiration free ! It will be such a great and pleasant future, with trust between our benevolent, kind, smart and wise authorities and us. Together to a brighter future !",
				"added": 1618165646
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_3065_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Not sure if satire.\n\nYou should be careful... it's already a symptom, to ask question, to think by yourself? Who do you believe to be? We are here only for your own good... I am sure you will prove your good faith and trust in us by volunteering for our safe and free vaccine against conspirational behavior and thought. You know we are Drs, we know what's good for you, sadly we don't have yet a vaccine against Illness anxiety disorder (IAD), but as soon as it is, rest assure we will take it, even twice, to be sure.",
				"added": 1618171748
			},
			{
				"comment_id": 4,
				"body": "> [houtje](#comment_43_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): you're really not sure if satire?\n\nYou don't see how this conspirationism illness is spreading across the world? Don't worry, it's not your duty. We the Doctors know better. And we affirm to you that it's necessary that all females of the world receive this therapy in the form of this vaccine against conspirationism. It's to protect the children. Only a patient suffering for CIS                            (conspirationism illness sydrome) would doubt our words of wisdom and knowledge.\n\nAre you a doctor? So you see, if already you believe to be one, when you don't have the official accreditation, I may fear it's too late for you... Don't worry we have already a final solution, you will be well treated.",
				"added": 1618173105
			},
			{
				"comment_id": 5,
				"body": "> [houtje](#comment_44_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): Nice wordsI am my own doctor, but thank you for your concern.You may now kindly fuck off\n\nI am obligated to report you to the international bureau of conspirationism prevention, care and treatment.",
				"added": 1618173349
			},
			{
				"comment_id": 6,
				"body": "I told you, that conspirationism is a contagious disease...",
				"added": 1618176884
			},
			{
				"comment_id": 8,
				"body": "Apparently, you have bought an unapproved by our benevolent FDA tinfoil hat; certainly made of russian aluminium, which has been proven by our scientific test to be of inferior quality, compared with the certified tinfoil hats. We the Expert, knows that you shouldn't take vit. c or d as nutritional supplement (or zinc, magnesium, etc) but aluminium and mercury. With this treatment and some fluoride, your delusional state may improve a little bigbadbob.",
				"added": 1618203323
			},
			{
				"comment_id": 10,
				"body": "> [karhen](#comment_31_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2): you are on to somthing here... Aren't doctors in the medical profession ( the ruling class love to have title before their name, like highest supreme priest of the egyptian delta area), all suffering from IAD ?\n\nDoctors are always right, and know better ! The only more esteemed individuals are those with a PhD, apply I have 10 ! So all must obey me, because I am certified wiser, smarter and accredited. \n\nIt's hierarchical feodal order, my underlying, simple doctors, obey, otherwise, our orders, which we rule with a iron fists (to get the undegraduade female student to please us).\n\nSo OBEY MY AUTHORITAY!!!\n\n> [karhen](#comment_27_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2): you are fucking sick in your mind, all aluminium are the same... duh !\n\nare you crazy? CNN tells you what is true, and what isn't. It's russian, and russian = bad.\n\n> [karhen](#comment_31_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2): you are on to somthing here... Aren't doctors in the medical profession ( the ruling class love to have title before their name, like highest supreme priest of the egyptian delta area), all suffering from IAD ?\n\nThose who have been contaminated by the conspirationism plague...",
				"added": 1618211782
			}
		],
		"1618137037_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": [
			{
				"comment_id": 7,
				"body": "> [seidoken](#comment_13_1Pxg9q2iUdQkbwgT459ArjQ12mpXN8cyEB): Yeah I was kind of embarrassed when I found out that this thing that I have been looking for for years has existed for years but it took 8chan getting taken down for me to find it.\n\nFundamentally, it's because you are not an expert ! A Dr, like me, knows naturally and intuitively such things. Maybe you are not sharing Zeronet with your friends? Why?",
				"added": 1618202985
			},
			{
				"comment_id": 9,
				"body": "zeronet is the best p2p opensource platform I ever tried, because of the mute function, so a state operator like captain404 can be muted to never read his filthy propaganda ever again, if I wish so, not if a higher than me authority (how possible, lol) decides...",
				"added": 1618211268
			}
		],
		"1618203663_1AjYqBvptvn6szy3VytC28obDFqsBM27jp": [
			{
				"comment_id": 11,
				"body": "Why don't conspirationists woreship our most important financiers? because they suffer from the illness. Bloomberg and Sorros only ever did \"god's work\".",
				"added": 1618211867
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 12,
				"body": "CNN is the most trusted news source in the world. Saying otherwise is another symptom of the conspirationism disorder...",
				"added": 1618211942
			}
		],
		"1618183859_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 13,
				"body": "> [karhen](#comment_26_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2): retroshare (open source / private/darknet networking system) : http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1570989643_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1 [...]\n\nanother super spreader, at least you didn't mention bitmessage, absolute red zone :).",
				"added": 1618211990
			}
		]
	},
	"comment_vote": {}
}