{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"3_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": [
			{
				"comment_id": 1,
				"body": "Парни я чет не понял, объясните по понятиям какого чурку обсуждаем, тот который видос снял?\nИ что вы такого поняли чего я не понял что этот чурка гнелой и там лайков дахуя ему наставили.\nЯ как бы может тупой пизда и не понимаю что за замут, и что вы такого увидели там.\nПо мне чурка как чурка, причем который испугался какой то девки которая на него не так посмотрела, лох какой то. Щяс все знают что бабы в России мужиками правят че он засал не понимаю. Да и в принципе всегда так было, женский пол доминировал и правил всегда.\nКарочи нехуя я не понял только слова чурки который жаловался хуй знает на что.",
				"added": 1562462193
			},
			{
				"comment_id": 2,
				"body": "Вообще давно пора нахуй войну кому то объявить а то заебало чет сидеть яйца мять.\nВот щяс бы время когда все на мечах и луками хуярились, вот было время ебать, не то что сейчас бля рекошетом в голову попадут и откинулся. Вот тогда было заебись тапором нахуй по бошке или мечем по ногам нахуй, и кравищи дахуя вот это я понимаю нахуй жизнь.",
				"added": 1562462376
			},
			{
				"comment_id": 3,
				"body": "А еще ахуенная тема кольчуга по наследвству передавалась от отца к сыну вот эта пизда было круто, все учились владением оружия ближнего боя и больше чем 30 лет обычно не жили и в принципе нахуя надо до старости жить эта полная хуйня, одни болячки до потеря памяти и мороки куча, а тут бац и умер потому что тебя ебнул более молодой и опытный соперник.",
				"added": 1562462759
			},
			{
				"comment_id": 4,
				"body": "Так вот по поводу чурак, карочи смотрю я дневник хача ахуенная тема и мужики не врут нехуя сколько зарабатывают, как живут все показывают ничего не скрывают, так что ментолитет у хачей вроде нормальный.\nМожет какой то чурка и гнелой но точно не все, я про русских тоже молчу нахуй, половина те еще кидалы а вот эти хохлы вообще пиздец кидать людей любят. Карочи меня бесят именно кидалы, когда человек намеренно\t\t\t пытается наебать, вот такие люди меня пизда бесят это гнелые уебки которых надо просто нахуй вешать.\nИ само собой все эти уебки сидят в провительстве думают что кидать людей пока они не видят нехуя нормально.\nКак меня бесят эта ебаная шайка с путином которые сука давно должны были повесится нахуй, я бы их всех ебнул, прогнили полностью уже суки. И какой пример показывают молодому поколению, щяс молодое поколение увидет что такие уебаны на верхушки сидят и тоже будут намеренно наебывать и что в итоге мы получим, гнелую нацию нахуй нам это надо вот вы скажите мне.",
				"added": 1562462984
			}
		]
	},
	"comment_vote": {}
}