{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Riusciranno i gruppi armati del Kurdistan (YPG, YPJ, IRPGF, PKK) a raggiungere il loro obiettivo di creare delle Regioni Autonome fondate sui principi della Carta del Contratto Sociale del Rojava?",
			"body": "CARTA DEL CONTRATTO SOCIALE DEL ROJAVA\n\nPrefazione:\n\nNoi popoli che viviamo nelle Regioni Autonome Democratiche di Afrin, Cizre e Kobane, una confederazione di curdi, arabi, assiri, caldei, turcomanni, armeni e ceceni, liberamente e solennemente proclamiamo e adottiamo questa Carta.\nCon l’intento di perseguire libertà, giustizia, dignità e democrazia, nel rispetto del principio di uguaglianza e nella ricerca di un equilibrio ecologico, la Carta proclama un nuovo contratto sociale, basato sulla reciproca comprensione e la pacifica convivenza fra tutti gli strati della società, nel rispetto dei diritti umani e delle libertà fondamentali, riaffermando il principio di autodeterminazione dei popoli.\nNoi, popoli delle Regioni Autonome, ci uniamo attraverso la Carta in uno spirito di riconciliazione, pluralismo e partecipazione democratica, per garantire a tutti di esercitare la propria libertà di espressione. Costruendo una società libera dall’autoritarismo, dal militarismo, dal centralismo e dall’intervento delle autorità religiose nella vita pubblica, la Carta riconosce l’integrità territoriale della Siria con l’auspicio di mantenere la pace al suo interno e a livello internazionale.\nCon questa Carta, si proclama un sistema politico e un’amministrazione civile fondata su un contratto sociale che possa riconciliare il ricco mosaico di popoli della Siria attraverso una fase di transizione che consenta di uscire da dittatura, guerra civile e distruzione, verso una nuova società democratica in cui siano protette la convivenza e la giustizia sociale.\n\nSezione I\n\nPrincipi generali:\n\nArticolo 1:\nQuesto contratto è chiamato Carta del contratto sociale per l’autogestione democratica nelle Regioni Autonome di Afrin, Cizre e Kobane [d’ora in avanti “la Carta”], e rappresenta un rinnovato patto sociale tra i popoli delle Regioni Autonome. Il preambolo del contratto sociale per l’autogestione democratica è parte integrante del presente contratto.\n\nArticolo 2:\nA. Il popolo è la fonte di autorità ed esercita la sovranità attraverso le istituzioni e le assemblee elettive, in accordo con la Carta.\nB. La fonte e fondamento della legittimità dei consigli del popolo e degli organi amministrativi della società si basano sui principi democratici fondamentali per una società libera.\n\nArticolo 3:\nA. La Siria è un paese indipendente, libero e democratico, con un sistema parlamentare fondato sui principi del decentramento e del pluralismo.\nB. Le Regioni Autonome Democratiche sono composte dai cantoni di Afrin, Cizre e Kobane, che formano parte integrante del territorio siriano.\nC. La Regione di Cizre è condivisa tra arabi, curdi, assiri, armeni, ceceni; musulmani, cristiani e yazidi, secondo il principio della convivenza pacifica e della fratellanza.\nD. L’assemblea legislativa elettiva rappresenta tutti e tre i cantoni delle Regioni Autonome.\n\nArticolo 4:\nLa struttura dell’amministrazione nelle Regioni Autonome\na. L’Assemblea Legislativa\nb. I Consigli Esecutivi\nc. L’Alta Commissione per le elezioni\nd. La Suprema Corte Costituzionale\ne. I consigli municipali e provinciali\n\nArticolo 5:\nLe città capoluogo sono:\nQamishlo per il cantone di Cizre;\nAfrin, per il cantone di Afrin;\nKobane per il cantone di Kobane.\n\nArticolo 6:\nTutti gli individui e le comunità sono uguali davanti alla legge per diritti e doveri.\n\nArticolo 7:\nOgni città, villaggio o regione in Siria, accettando la Carta, ha diritto a formare cantoni che faranno parte delle Regioni Autonome.\n\nArticolo 8:\nTutti i cantoni nelle Regioni Autonome si fondano sul principio dell’autogoverno locale. Possono eleggere liberamente i propri rappresentanti e i loro organi amministrativi, ed esercitare tutti i loro diritti in maniera coerente con gli articoli della Carta.\n\nArticolo 9:\nLe lingue ufficiali della provincia di Cizre sono il curdo, l’arabo, l’assiro. Tutte le comunità hanno diritto a ricevere l’istruzione nella propria lingua madre.\n\nArticolo 10:\nLe Regioni Autonome non interferiranno negli affari interni degli altri stati, preservando i buoni rapporti di vicinato con i paesi confinanti e impegnandosi a risolvere pacificamente i conflitti.\n\nArticolo 11:\nLe Regioni Autonome hanno diritto a essere rappresentanti da una bandiera, un simbolo e un inno, che saranno definiti per legge.\n\nArticolo 12:\nLe Regioni Autonome fanno parte integrante della Siria. Sono un modello per un futuro sistema decentrato di amministrazione federale in Siria.\n[continua a leggere su://bit.ly/1MNhKcn]",
			"added": 1525454965
		}
	],
	"topic_vote": {
		"1_1EpAaZ4JDhaxQATgn71TAKNKmsZ16DbMPb": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1JswAAVtEfcM2tDgAc2rEyqMacMfimWUeq": [
			{
				"comment_id": 1,
				"body": ":)",
				"added": 1525455613
			}
		]
	},
	"comment_vote": {}
}