{
	"next_post_id": 22,
	"next_comment_id": 23,
	"next_follow_id": 9,
	"avatar": "jpg",
	"user_name": "Erinlalouve",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "DevOps kaj iomete FullStack. Mi estas virino transexual, plenkreska bebo, humanista, fervorulo de naturo, fervorulo de serioj / animoj / filmoj",
	"post": [
		{
			"post_id": 1518650827,
			"body": "bonan tagon zeronet!",
			"date_added": 1518650825
		},
		{
			"post_id": 1519337980,
			"body": "Dreamworks devas ami min ... Post Drako venos la nova sezono de Voltron en Netflix",
			"date_added": 1519337976
		},
		{
			"post_id": 1519339255,
			"body": "Mi ŝatas ĉi tiun musikon multe #ProjectOctopath\n\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1519339129_1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2",
			"date_added": 1519339250
		},
		{
			"post_id": 1519400284,
			"body": "malĝoja... ĝi ne eblas proxy_pass ZeroMe por havi bela url :(",
			"date_added": 1519400278
		},
		{
			"post_id": 1519402537,
			"body": "Migrado de mia infrastructuro al docker swarm terminado \\O/",
			"date_added": 1519402530
		},
		{
			"post_id": 1521978065,
			"body": "Fuck this end... Super Shenron way too small, Goku not dead and has no envy to transmit his knowledge... This end does not give the new reason behind goku's death at the beginning of the last dbz episode... Everything else was cool tho...",
			"date_added": 1521978057
		},
		{
			"post_id": 1526739103,
			"body": "just crossed a return to the futur 2 Delorean in my little town... I think Marty and Doc are lost... ><",
			"date_added": 1526739094
		},
		{
			"post_id": 1526991155,
			"body": "thank you Digital Extreme for inexistant support... 2 automatic answer when I created the ticket and after that, nothing, meaning no way to access my warframe account where I put 400h of my life  and a lots of money :'(",
			"date_added": 1526991145
		},
		{
			"post_id": 1531474968,
			"body": "20 july next warframe devstream, hope they will say: warframe on switch is certification ready (in the AMA Panic Button said it takes less than a year to make switch port and Warframe port started right after Doom...)",
			"date_added": 1531474957
		},
		{
			"post_id": 1531486087,
			"body": "YES!!!!! http://127.0.0.1:43110/big.kopykate.bit/?Video=1531485690_1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2",
			"date_added": 1531486075
		},
		{
			"post_id": 1532071923,
			"body": "2 peoples are working silently in the middle of the night in the sewers with a truck with flashing light to prevent accident, My first though was \"hey they must be spies in a mission!\". I may have watched too much spy movie recently... XD ",
			"date_added": 1532071910
		},
		{
			"post_id": 1535058444,
			"body": "My fluffy dog ❤",
			"date_added": 1535058430,
			"meta": "{\"img\":\"900,506,ccaccbeee987532310730ba8aab875878a98642544766444,01122134567011013456777182355699AAA0B44C4DAAAE9CDD554F809DDD\"}"
		},
		{
			"post_id": 1535366149,
			"body": "I'm pretty sure that here in France we will have politics that will say that video game is responsible for the massacre... Politicizing everything is not something specific to France but this is definitely a national sport :(",
			"date_added": 1535366134
		},
		{
			"post_id": 1535660733,
			"body": "1h full hour searching for a bug in my code just to discover that symfony doesn't respect voters decision with the DELETE action because it doesn't send DELETE directly but instead rely on an internal curl that doesn't respect 403 or 302 HTTP Code -_-'",
			"date_added": 1535660717
		},
		{
			"post_id": 1535732551,
			"body": "found this line on a website my company just got to maintain... That's truly ugly ><\n    <img src=\"{{asset(asset(publication.document.file|replace({'pdf': 'png'})))}}\" alt=\"{{publication.title|default('Publication')}}\" class=\"img-full-width\" width=\"145\" height=\"145\">",
			"date_added": 1535732534
		},
		{
			"post_id": 1535794187,
			"body": "Justed finished episode 2 of Jack Ryan and I have to admit this is a really ambitious tv show but at the same time, this is not a Tom Clancy's one: the way the RAID enter the appartment under the fire is not accurate and Special/Assault forces accuracy is something important for Tom Clancy... Take for example the st denis assault, the settings is the same as this episode and there was only 1 victim, the dog diesel, after an assault that was multiple hours long...",
			"date_added": 1535794169
		},
		{
			"post_id": 1536024641,
			"body": "My dog just got another epileptic seizure and this time it's because of a PSYCH episode where they have added a lot of stromboscopic light... Seriously, why on earth would you put stromboscopic light on a Familial TV show?! Was Pokemon and all the japanese children send to the hospital because of that not enough to understand it's a bad and dangerous idea ?!",
			"date_added": 1536024622
		},
		{
			"post_id": 1536344139,
			"body": "@anyone \nWhat is the equivalent of zeronet.py SiteSign but for user content so I can auto add content as myself on a zite I develop with multi users? thanks :)",
			"date_added": 1536344119
		},
		{
			"post_id": 1537483292,
			"body": "Ok Netflix and WonderStorm, now that you have sold me the universe of #TheDragonPrince I want more: a second season, the videogame and books, lot of books and of course a Silmarilion kind of book :)",
			"date_added": 1537483271
		}
	],
	"post_like": {
		"1LkCpkL3TohdyYnrnEbUtPDKLag9XHbgVV_1519080620": 1519338859,
		"16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8_1530582054": 1530706204,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1534988475": 1535106789,
		"1HsqTRXrexcrmX1zPDBukYGFjS85oGogyL_1535361979": 1535367279,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1535327856": 1535367292,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1535945031": 1535963758,
		"1P6cEvA3RLuk9FGyNY9kCb9C8L231jVhiK_1536104179": 1536157960,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1536341048": 1536343545,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1536429221": 1536444827,
		"1P637LjpHSj3PdwRs9tC8BBV6dMtygDhsw_1539072759": 1539093126,
		"168LyXF27YeknvCoPEZB3jM8gpb1npT44v_1539332205": 1539332540,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1539501191": 1539601807
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "it will be almost impossible... Mastodon is based on Ruby on Rails, but what you can do is making your own network that use ActivityPub so it can connect to the federation but the drawback is that no one inside the federation will be able to follow you unless they use ZeroNet.What would be interesting is that ZeroMe integrate ActivityPub :)",
			"post_uri": "1MBaap4J4DvH7DaSZEgNY5m6Lhe5EUYw6N_1519361510",
			"date_added": 1519392382
		},
		{
			"comment_id": 2,
			"body": "@styromaniac@zeroid.bit: I just installed a Mastodon instance locally and a Peertube and followed all the exchange between all he developpers about the network compatibility with GNU Social, Mastodon and Peertube. But after a few months I have decided to remove them both and move to ZeroNet. Why? Because I think that even if Mastodon and Peertube are a first true move to decentralizing the web like it was meant to be, they still rely on the same assymetric paradigm that leaded to the main problem on the WWW: clients/servers with only a few percent of www users that know how to properly maintain a local server. IMOA I think ZeroNet is the true successor of the WWW (Tim Berners-Lee would be proud :) ) and to that point even if I think integrating ActivityPub on ZeroMe would be interesting, I don't think it would be a good think for ZeroMe on the long term (Because it's just a protocol to decentralized broken assymetric WWW) :/",
			"post_uri": "1MBaap4J4DvH7DaSZEgNY5m6Lhe5EUYw6N_1519361510",
			"date_added": 1519503371
		},
		{
			"comment_id": 3,
			"body": "@ssdifnskdjfnsdjk@zeroid.bit: it's a french teaser for the next Alexandre Astier movie (Alexandre Astier is a well known humorist, actor, producer in france)",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1531486087",
			"date_added": 1531486514
		},
		{
			"comment_id": 4,
			"body": "@Mormon: as far as I know kopykat is the biggest youtube like on zeronet and I try not to put outside link in zeronet (for obvious reason)... Will check ZeroUp...",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1531486087",
			"date_added": 1531733267
		},
		{
			"comment_id": 5,
			"body": "@Dscx: death threat as your first comment here, bravo you are the dumbest troll ever to flag yourself so quickly...",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1535058444",
			"date_added": 1535068903
		},
		{
			"comment_id": 6,
			"body": "@Eibriel: thank you :)",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1535058444",
			"date_added": 1535270977
		},
		{
			"comment_id": 7,
			"body": "@Walllling: I don't think that anything can kill video games, but video games are the new black sheep here and any violence in USA pretty much lead to a tiring debat about how video games makes child violent and should be ban...",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1535366149",
			"date_added": 1535379789
		},
		{
			"comment_id": 8,
			"body": "@Pad: I seed for every video I watch because I think it's important to give back so zeronet philosophy can work but I think there are a few problem with peer/seed part of kopykate because I can go to a page and see that the peer/seed is 0/0, I refresh it become 7/10 and that happen a lot ^^",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1535570563",
			"date_added": 1535661206
		},
		{
			"comment_id": 9,
			"body": "Mi komencis Esperanto ne antaŭ longe, Mi pensas, ke ĉi tiu lingvo estas bona kun ZeroNet.",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1535965407",
			"date_added": 1536010699
		},
		{
			"comment_id": 10,
			"body": "sorry for your loss. It's a modern parody of sherlock holmes.",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1536024641",
			"date_added": 1536047849
		},
		{
			"comment_id": 11,
			"body": "@Godlike1: yes she is alive but the seizure are closer every time, that's why I'm mad that this time it happened only 2 weeks after the last and because of a good but totally stupid tv show only because amazon prime don't warn people before... ",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1536024641",
			"date_added": 1536157928
		},
		{
			"comment_id": 12,
			"body": "@Binchan: thank you :)",
			"post_uri": "1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1536344139",
			"date_added": 1536414698
		},
		{
			"comment_id": 13,
			"body": "does a real reddit-like social network exist here on zeronet? I know ZeroBoard is a good start but is far from a true reddit-like and said mysql multiple time it would be great to have that here :)",
			"post_uri": "15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC_1538083313",
			"date_added": 1538140152
		},
		{
			"comment_id": 14,
			"body": "@Bussdee: problem with social network is not to split user community when not needed, if a reddit already exist it's counter productive starting another fork.",
			"post_uri": "15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC_1538083313",
			"date_added": 1538340328
		},
		{
			"comment_id": 15,
			"body": "@Kaffie: ok sad, as said to Bussdee I hopted one already exist, but since it's not the case, I will see if I can make a proper clone ^^",
			"post_uri": "15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC_1538083313",
			"date_added": 1538340390
		},
		{
			"comment_id": 16,
			"body": "if you already know a programming language, start by looking/modifying simple scripts to know the basic and increase in complexity until you are familiar with the language, that's how my school has made me learn a lot of different languages :)",
			"post_uri": "1BPagz4bpTRnLZburKCZ41JQa9tQbCH8Qc_1538252841",
			"date_added": 1538340723
		},
		{
			"comment_id": 17,
			"body": "@Bussdee: a lot of pressure, I'm not the kind to do promises but I will try to do my best :)",
			"post_uri": "15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC_1538083313",
			"date_added": 1538381116
		},
		{
			"comment_id": 18,
			"body": "it depends of your NAS, synology plays well with zeronet for example...",
			"post_uri": "1AtZRXEYqPxrprXiSK9Ncd4cSfFACFZWvL_1538380734",
			"date_added": 1538383066
		},
		{
			"comment_id": 19,
			"body": "@Bussdee: I have done a few site on ZeroNet but right now before starting the code itself, I need to find a proper clean way of doing a big project... Reproducing reddit itself is not that difficult on older client/server paradigm, doing the same on ZeroNet is still not natural for me and I will need that before starting the roadmap. I'm not slow neither and you can expect something on git center during the month and I will be able to know what I need at this moment :)",
			"post_uri": "15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC_1538083313",
			"date_added": 1538383371
		},
		{
			"comment_id": 20,
			"body": "I don't know for netgear, but it seems that it run on a proprietary OS with ssh access, so I would start by activating the ssh following this doc: https://kb.netgear.com/30068/ReadyNAS-OS-6-SSH-access-support-and-configuration-guides and see if it's possible to install all zeronet dependencies. If not, the only way would be to install GNU/Linux in order to get all dependencies on the NAS...",
			"post_uri": "1AtZRXEYqPxrprXiSK9Ncd4cSfFACFZWvL_1538380734",
			"date_added": 1538393129
		},
		{
			"comment_id": 21,
			"body": "to be fair it would be way easier to buy a raspberry pi and install zeronet on it :/",
			"post_uri": "1AtZRXEYqPxrprXiSK9Ncd4cSfFACFZWvL_1538380734",
			"date_added": 1538393173
		},
		{
			"comment_id": 22,
			"body": "where is the end of the earth for them? can we come too with a lot of pop corn, because we will surely need it ^^",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1557680621",
			"date_added": 1557937351
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4",
			"user_name": "Kopykate",
			"date_added": 1535066364
		},
		{
			"follow_id": 2,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1536331982
		},
		{
			"follow_id": 3,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX",
			"user_name": "Indeep",
			"date_added": 1536333780
		},
		{
			"follow_id": 4,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS",
			"user_name": "ssdifnskdjfnsdjk@zeroid.bit",
			"date_added": 1536333834
		},
		{
			"follow_id": 6,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4",
			"user_name": "Geekless",
			"date_added": 1536343367
		},
		{
			"follow_id": 7,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1HSJXS26WAFxab3etLidavpj5zki3bC1Pm",
			"user_name": "Tumbleweed",
			"date_added": 1537437505
		},
		{
			"follow_id": 8,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1537481992
		}
	]
}