{
	"next_topic_id": 61,
	"topic": [
		{
			"topic_id": 1609428015,
			"title": "答复",
			"body": "答复",
			"added": 1609428014
		},
		{
			"topic_id": 1609599997,
			"title": "二〇二一年新年贺词",
			"body": "2020年是极不平凡的一年。面对突如其来的新冠肺炎疫情，我们以人民至上、生命至上诠释了人间大爱，用众志成城、坚忍不拔书写了抗疫史诗。我们克服疫情影响，统筹疫情防控和经济社会发展取得重大成果。“十三五”圆满收官，“十四五”全面擘画。全面建成小康社会取得伟大历史性成就，决战脱贫攻坚取得决定性胜利。改革开放创造了发展奇迹，今后还要以更大气魄深化改革、扩大开放，续写更多“春天的故事”。经历了一年来的风雨，我们比任何时候都更加深切体会到人类命运共同体的意义\n\n　　■ 2021年是中国共产党百年华诞。百年征程波澜壮阔，百年初心历久弥坚。从上海石库门到嘉兴南湖，一艘小小红船承载着人民的重托、民族的希望，越过急流险滩，穿过惊涛骇浪，成为领航中国行稳致远的巍巍巨轮。胸怀千秋伟业，恰是百年风华。我们秉持以人民为中心，永葆初心、牢记使命，乘风破浪、扬帆远航，一定能实现中华民族伟大复兴\n\n　　■ 站在“两个一百年”的历史交汇点，全面建设社会主义现代化国家新征程即将开启。征途漫漫，惟有奋斗。我们通过奋斗，披荆斩棘，走过了万水千山。我们还要继续奋斗，勇往直前，创造更加灿烂的辉煌\n\n　　　　 \n\n　　新华社北京12月31日电 新年前夕，国家主席习近平通过中央广播电视总台和互联网，发表了二〇二一年新年贺词。全文如下：\n\n　　大家好！2021年的脚步越来越近，我在北京向大家致以新年的美好祝福！\n\n　　2020年是极不平凡的一年。面对突如其来的新冠肺炎疫情，我们以人民至上、生命至上诠释了人间大爱，用众志成城、坚忍不拔书写了抗疫史诗。在共克时艰的日子里，有逆行出征的豪迈，有顽强不屈的坚守，有患难与共的担当，有英勇无畏的牺牲，有守望相助的感动。从白衣天使到人民子弟兵，从科研人员到社区工作者，从志愿者到工程建设者，从古稀老人到“90后”、“00后”青年一代，无数人以生命赴使命、用挚爱护苍生，将涓滴之力汇聚成磅礴伟力，构筑起守护生命的铜墙铁壁。一个个义无反顾的身影，一次次心手相连的接力，一幕幕感人至深的场景，生动展示了伟大抗疫精神。平凡铸就伟大，英雄来自人民。每个人都了不起！向所有不幸感染的病患者表示慰问！向所有平凡的英雄致敬！我为伟大的祖国和人民而骄傲，为自强不息的民族精神而自豪！\n\n　　艰难方显勇毅，磨砺始得玉成。我们克服疫情影响，统筹疫情防控和经济社会发展取得重大成果。“十三五”圆满收官，“十四五”全面擘画。新发展格局加快构建，高质量发展深入实施。我国在世界主要经济体中率先实现正增长，预计2020年国内生产总值迈上百万亿元新台阶。粮食生产喜获“十七连丰”。“天问一号”、“嫦娥五号”、“奋斗者”号等科学探测实现重大突破。海南自由贸易港建设蓬勃展开。我们还抵御了严重洪涝灾害，广大军民不畏艰险，同心协力抗洪救灾，努力把损失降到了最低。我到13个省区市考察时欣喜看到，大家认真细致落实防疫措施，争分夺秒复工复产，全力以赴创新创造，神州大地自信自强、充满韧劲，一派只争朝夕、生机勃勃的景象。\n\n　　2020年，全面建成小康社会取得伟大历史性成就，决战脱贫攻坚取得决定性胜利。我们向深度贫困堡垒发起总攻，啃下了最难啃的“硬骨头”。历经8年，现行标准下近1亿农村贫困人口全部脱贫，832个贫困县全部摘帽。这些年，我去了全国14个集中连片特困地区，乡亲们愚公移山的干劲，广大扶贫干部倾情投入的奉献，时常浮现在脑海。我们还要咬定青山不放松，脚踏实地加油干，努力绘就乡村振兴的壮美画卷，朝着共同富裕的目标稳步前行。\n\n　　今年，我们隆重庆祝深圳等经济特区建立40周年、上海浦东开发开放30周年。置身春潮涌动的南海之滨、绚丽多姿的黄浦江畔，令人百感交集，先行先试变成了示范引领，探索创新成为了创新引领。改革开放创造了发展奇迹，今后还要以更大气魄深化改革、扩大开放，续写更多“春天的故事”。\n\n　　大道不孤，天下一家。经历了一年来的风雨，我们比任何时候都更加深切体会到人类命运共同体的意义。我同国际上新老朋友进行了多次通话，出席了多场“云会议”，谈得最多的就是和衷共济、团结抗疫。疫情防控任重道远。世界各国人民要携起手来，风雨同舟，早日驱散疫情的阴霾，努力建设更加美好的地球家园。\n\n　　2021年是中国共产党百年华诞。百年征程波澜壮阔，百年初心历久弥坚。从上海石库门到嘉兴南湖，一艘小小红船承载着人民的重托、民族的希望，越过急流险滩，穿过惊涛骇浪，成为领航中国行稳致远的巍巍巨轮。胸怀千秋伟业，恰是百年风华。我们秉持以人民为中心，永葆初心、牢记使命，乘风破浪、扬帆远航，一定能实现中华民族伟大复兴。\n\n　　站在“两个一百年”的历史交汇点，全面建设社会主义现代化国家新征程即将开启。征途漫漫，惟有奋斗。我们通过奋斗，披荆斩棘，走过了万水千山。我们还要继续奋斗，勇往直前，创造更加灿烂的辉煌！\n\n　　此时此刻，华灯初上，万家团圆。新年将至，惟愿山河锦绣、国泰民安！惟愿和顺致祥、幸福美满！\n\n　　谢谢大家！",
			"added": 1609599995
		},
		{
			"topic_id": 1609913282,
			"title": "怎么看待比特币暴涨？",
			"body": "怎么看待比特币暴涨？\n\n卢克文\n\n昨天 18:00\n\n\n最近比特币大涨，已经突破了3.4万美元，一枚比特币价值20多万人民币，拥有100个比特币就是两千多万资产，许多人心态崩了，大多都是抱怨自己没有在比特币3000元历史近期最低价时买进，错过了一次暴富的机会，言辞间悔怨之情，溢于言表。\n\n这其实是一种赌徒心态。比特币暴涨的原因我已经说过了，是美元不断贬值的结果，但我今天想聊聊另一件事。\n\n我自己曾经在几年前买过一枚比特币，就是想体验一下买卖过程，知道这个新生玩意是怎么回事，买完后我就忘了这回事，现在已经完全忘记了密码，不过我完全不在乎，我从来没打算，也没什么兴趣去从这种事物里获取财富。我相信我没这个命。几十年艰苦的生活经历让我养成了一种认知：就是容易得到的东西，也特别容易失去；通常越难得到的东西，也比较难失去。\n\n我自己在多年的创业过程中，一直告诫自己，绝不能把主要精力放在赚那种一次性快钱上，而应该想办法建立完整的良性循环的商业体系，一个月稳定赚十万，比一次性赚一百万但没了退路要健康。\n\n赚了一次快钱，你就会产生亢奋感，从此否定了人生积极的一面，否定了勤劳，坚韧，刻苦这些宝贵的人格，从此产生路径依赖，总想搞一把大的，下次再搞一把更大的，总想着三十岁以前退休，过纸醉金迷的生活。这种亢奋感也容易扭曲你的人格，你会沉迷于刺激性的人生滋味，去豪赌，去泡夜店，去吸毒。\n\n但你认真的经营一家公司，认真的经营一份事业，你收获的是另一种完全不同的踏实感，在这个过程中，你收获的不仅仅是钱，更有经营技巧，商业认知，团队精神，价值判断等等。成长时感到温暖的不止自己，还有身边的每一个人。填充一个人的生命，不仅仅是金钱这么简单，还有更丰富更复杂的事物待你挖掘，人生有酸甜苦辣咸五味，缺一种味道都是不完整的。钱当然要赚，但不能让赚钱的味道冲散了人生其它滋味。\n\n再说，有再多的钱，也不能乱花，花钱有如往生活里放盐，太少当然不行，放太多，还会使生活由鲜美变成苦咸。这二十年来，我见过太多喜欢赚快钱的人，他们赚得快，亏得更快，亏急了，想赚更快的钱，结果有的跳了楼，有的坐了牢，家破人亡比比皆是。凡是一直想投机梭哈人生的，十个人里最多一个靠好命活了下来，凡是认真做实事的，能坚持十年二十年的，十个里面七八个能有大成就。人要抵御赚快钱的诱惑是很困难的，这个就是精神毒品，吸一口就止不住。快钱世界里，通常只有背后真正的庄家能赚钱，而庄家，往往只有一个。\n\n我写这篇文章是想告诉大家，如果你身边有人侥幸靠比特币赚了一笔，而你却在苦哈哈地读研，考律师证，工程师证，报关证，会计师证，不要被别人的暴富去打乱你人生的节奏，他的意外之财背后，是无数人的尸骨，而你苦学的将来，是良性循环的康庄大道。一个人只拥有比特币而没有事业，就像一个国家有石油却放弃了工业化，大家都知道，这只是资源诅咒，没有哪个国家，哪个个人会真的变强大。如果那个暴富的人在你面前炫耀，你要捉住想抽他脸的那只手，礼貌地说一句恭喜就行。然后继续在你正常也正向上升的人生努力。我们要做自己人生真正的主人，从奋斗中成长，而不是成为癫狂的赌徒，在刺激中沉沦。",
			"added": 1609913279
		},
		{
			"topic_id": 1609918564,
			"title": "央行法币好，天灭比特币...",
			"body": "央行法币好，天灭比特币，退币保平安，人在做，天在看，击鼓传花留祸患，庞氏骗局害众生，钱财必须银行放，手握存折有保障，众生都为钞票来，被人鼓噪忘前缘。政府媒体说真相，教你脱险莫拒绝，上网搜索九评比特币，有真相...",
			"added": 1609918560
		},
		{
			"topic_id": 1610203439,
			"title": "所有对数字货币有兴趣的，欢迎常来看看...",
			"body": "",
			"added": 1610203434
		},
		{
			"topic_id": 1610376321,
			"title": "匿名币初探",
			"body": "大白币说 | ZenCash- 何以称王“匿名币”\n原创 昊无边Eric  白话区块链  2018-01-25\n白话区块链\n\n从入门到精通，看我就够了！\n\n说到区块链，现在大多数人直接想到的就是比特币，不过随着数字货币的发展，各类细分应用都在自己的领域中招兵买马，其中匿名货币也是其中一支，目前最为人所知的就是Dash, Zcash, XMR等等。\n\n但是今天我们要为大家介绍的，可能并不在大家熟知的列表里面，但是它却能拳打Dash，脚踢Zcash，顺便肩上还能扛个Monero。没错，这就是标题所说的ZenCash, 那么ZenCash到底为何有如此潜力。别着急，更多精彩内容正在路上。\n\n一、匿名币的演进\n从名字就可以看出，ZenCash代表着某种可以支付的Cash，而且不知道小伙伴们有没有发现，ZenCash和Zcash看起来非常像，其实这两者之间确实也有一段渊源。\n\n大家应该知道Zcash是从比特币而来，这主要是因为比特币虽然可以让人们安全地自我掌控资产，但是由于账本公开，基于地址的资产状况可以被任何人查阅。然而资产的保密性显然是非常重要的，如果资产不多，可能你不会在意，但是如果当我们的资产达到一定数额，安全和保密就成为刚需了。虽然我是很想认识很多土豪的，只不过土豪大多并不想被别人知道。\n\n所以基于此痛点，Zcash通过零知识证明技术诞生了，它和比特币最大的不同之处在于转账的时候有2种方式可选——透明模式和保密模式。Zcash的保密模式在交易时会自动隐藏区块链上所有交易的发送者、接受者及数额。\n\n但是Zcash的融资方式饱受争议，Zcash团队为了维持项目的正常运转，规定前四年挖矿的20%归为团队所有，这对于挖矿者来说是不公平的，所以后来矿工又从Zcash上分叉出了Zclassic。 这个Zclassic其实和Zcash完全一样，除了一点——它将所有收益全部给到了矿工。这样矿工当然支持，不过这也出现了一个严重问题：就是系统维护完全依赖于免费提供服务的爱好者。可想而知，那样的效率有多低。\n\n最后美国三位前政府军事人员从Zclassic身上分叉出了一个更完美的版本，就是我们今天要说的ZenCash，和之前的Zcash和Zclassic相比，它解决了最重要的一个现实问题：就是团队可持续发展！！\n\n二、重要的运营模式\n为什么要着重强调ZencCash的运营模式？因为如果一个项目没有持续稳定的资金支持，即使它的技术再好，最后也要面临资金困境。区块链项目不像传统商业模式，可以有明确的盈利模式，区块链项目团队的主要收益是和资产价格有关的，所以唯一能让团队长期获取收益的方式就是：稳定的令牌（token）收入，以及令牌（token）在发展过程中的稳定增值。如果项目本身的价值无法支撑团队的发展，那么就必须得引入资金，社区的分歧与团队的中立性就会收到挑战。\n\n例如前段时间非常火的比特币分叉事件，比特币Core团队目前就是受雇于BlockDream，但是这个公司也正在做闪电网络（比特币侧链）项目，这也是比特币社区产生严重分歧的重要原因之一。\n\n更深入地来说，区块链技术最大的优势就是去中心化，也就是没有任何一方可以停止代码的运行，所执行的决定必然会按照代码运行下去。但是我们必须得承认，凡是软件就会遇到Bug或升级，就需要有人去维护，而维护是要有成本的，维护的团队要保持中立并且不能有过大的权力。\n\n依旧是拿比特币社区来说，比特币区块链是由Core团队维护的，那么他们其实相对来说就对比特币系统有绝对的权力，甚至可以单方面撕毁与社区达成的共识，这就导致了很多分叉的链，其实也稀释了比特币原本的价值。所以，如果完全靠自觉来维护社区，很可能会面临效率与质量不高的问题。\n\n比较下几种匿名币的商业模式：\n\nMonero： 资金模式依赖于开发人员为项目义务的贡献, 项目方不会给项目贡献者提供报酬，也许这就是为什么到现在还没有一个用户友好的手机钱包。\n\nZcash：项目团队为了活下来，在前面4年将会收取矿工收益的20%作为团队发展基金。其实这对矿工来讲是非常不公平的，也导致了矿工不愿意将算力过多投入，所以也就造成了Zclassic的分叉。\n\nDash: 总体来讲会更合理，它将10%的矿工收益归属团队，也有可能实现长远发展，但是和ZenCash比起来还不够完善。\n\nZenCash: 通过使用Treasury Model来处理资金问题。每2.5分钟会有12.5个Zen被开采出来。 在这一模式下，88％的采矿奖励属于矿工。ZenCash的“项目基金”就会获得8.5％的奖励，剩下的资金奖励给安全节点。\n\n现在，每天有7,200个新的ZenCash被开采。其中612枚（8.5％）属于ZenCash的项目基金。按目前的价格计算大概是2.35万美元，每年约为858万美元。随着币价的上涨，后续团队的资金实力相信也将会越来越强（注：为发文时coinmarketcap网站上的ZenCash价格）。\n\n自筹资金对于项目能否按照原始白皮书推进意义非常重大，这就好象一个家庭需要持续有现金流一样重要，也是项目能否坚持下来的前提条件。一个好的模式将会大大地提高项目的运作效率。任何一个创业团队，都需要足够并且持续的现金流，来支撑产品研发和技术创新的探索。区块链公链竞争越来越激烈，团队的资金状况就是取胜的关键因素之一。\n\n三、技术优势\n开头我们说到ZenCash可以在“匿名币”称王，那么到底它和其他匿名币项目例如Monero，Zcash还有Dash比起来优势在哪呢？\n\n我们之前说过，Zcash, Dash, Monero也属于匿名币，不过很尴尬的是在2016年，美国联邦调查局直接截获了12000枚Monero；2017年执法人员从暗网市场药物供应商AlphaBay的领袖Alexandre Cases查获3700个Zcash。\n\nMonero和ZEC 都是目前加密货币排名最高的两位，被查获的原因，是因为他们并没有实现信息的端对端传输以及端对端加密，而这其实正是Zencash最大的优势。\n\n你可能不知道，现在的大多数加密货币，都是采用明文传输的，这意味着数据可能会被拦截，窃听和记录。使用Monero或Zcash这种匿名货币，或许还有些隐私，最起码不会暴露你转账给谁。但记录你的Monero或Zcash的行为，再结合你近期的网站访问记录，也依然能分析出很多信息。\n\n在监听的常态下，采用端对端加密的ZenCash，通讯数据是完全加密的，在网络传输时无法被监听。我们可以像使用大型网站一样，使用并信赖ZenCash，因为它使用了TLS技术实现端对端加密，把用户安全放在第一位。\n\n总结来看，ZenCash在技术上有以下优势：\n\n1、端对端加密\nZenCash的“安全节点”的解决方案。根据白皮书，安全节点“确保系统保持分布，有弹性，并且安全。通过执行节点之间的加密通信，ZenCash可以防止被窃听。有了端对端加密，就可以基本解决信息被拦截的可能性。即使有人截取了信息，也理解不了里面的内容。ZenCash的安全节点目前在全世界已经部属了6000+个，而比特币用了9年时间才部署了8000+个节点。\n\n2、域前置\n域前置(Domain Fronting)，是用来隐藏访问目的网站的。ZenCash创始团队一开始就将其作为重要功能，现在的ZenCash也已经实现。使用Domain Fronting，原本ZenCash的使用行为，在监听者看来会被认为你在使用百度，亚马逊AWS，阿里云。\n\n3、其他扩展加密功能\nZenTalk是一个安全的通信网络，允许您从能一对多广播消息；\nZenPub是一个能匿名发布和存储文档的平台；\nZenHide 将为用户提供能力环游密的加密商务闭环。（大多数商业活动都有保密需求，ZenCash作为公链，能提供全套解决方案，从而增加企业信息安全性，降低安全成本，并减少企业安全部门心理压力）；\n\n最重要的，ZenCash继承了Bitcoin，Zcash，Zclassic的全部优点。同时具备了POW工作量证明，实现了基于零知识证明的匿名交易。\n\nZenCash拥有公开交易、匿名交易两种选择。使用T地址你的交易公开透明，完全可查。使用Z地址，零知识证明确保转账毫无足迹，任何信息（发送方钱包地址，接收方钱包地址，转账金额）都不会被公开，除非你愿意，否则连接收方都不知道是谁给它转的币。\n\n此外，ZenCash可以与其他区块链一起工作，说明ZenCash的交互性非常好。假设你想设置一个ETH智能合约，也可以通过ZenCash处理付款屏蔽地址。此外，ZenCash已经与区块链顶级研发团队IOHK合作，让开发者能在ZenCash公链上开发一些加密的DApp。\n\n四、团队背景\n在理解ZenCash的运行机制后，我们能发现它对所有的加密细节考虑得非常周到。这让我们对开发团队非常感兴趣——\n\nRob Viglione:\n他是前美国空军官员，他在卫星雷达，太空运载火箭和作战支援情报方面有丰富经验。\n\nRolf Versluis:\n毕业于美国海军学院。毕业后，他被任命为核潜艇的军官。\n\nJoshua Yabut:\n约书亚·雅布特（Joshua Yabut）是NASA和前国民警卫队执行官的前网络安全专家。\n\n团队成员在特殊部门及安全领域的背景是ZenCash的又一大特色。\n\n五、总结\n当匿名币逐渐被更多人理解并接受之后，我们将能更加清楚地认识到ZenCash在安全性上的价值。",
			"added": 1610376315
		},
		{
			"topic_id": 1610380247,
			"title": "论坛的字数限制我总是设置不好，哪位高手来指点一下，先谢了....",
			"body": "对应站点下的content.json文件已经修改了，但似乎总还是不对，字数稍微长点就无法发布..",
			"added": 1610380240
		},
		{
			"topic_id": 1610427293,
			"title": "目前美国的乱象，尤其是现任总统都被媒体封号，而且是各大媒体统一封号的情况是非常适合中国有所表态的。",
			"body": "哪怕说一些半咸不淡的话，都非常合适。\n但可惜的是，由于之前外卖部大错着（选票都没统计完，各方都没确认就祝贺拜登了，不能简单地用对拜登谄媚来解释），中国方面现在已经不适合再做任何表态，因为要顾及之前的表态，以及拜登的感受，稍一疏忽，之前的祝贺的投入就都沉没了，甚至可能让拜登生怨。\n而如果这种大是大非的事情都不做表态，那未免就过于伪善了，而且还坐实谄媚之嫌，大概这就是所谓的尴尬吧...",
			"added": 1610427285
		},
		{
			"topic_id": 1610959805,
			"title": "全球各国央行自去年8月到11月连续成为黄金净卖家",
			"body": "世界黄金协会(WGC)周一(1月11日)表示，全球各国央行在11月成为黄金净卖家，因其卖多买少。\n\n这已经不是2020年第一次发生这种情况了。全球央行在去年8月和9月也是净卖家。去年8月份标志着长达一年半的月度黄金购买期的结束。\n\n去年11月，全球官方黄金储备减少了6.5吨。世界黄金协会研究经理Krishan Gopaul上周表示：“就像8月和9月央行也是净卖家一样，这是几笔大规模抛售抵消了持续的温和买盘的结果。”更详细的数据显示，去年11月全球央行总共购买了16吨黄金。储量增加最多的国家是乌兹别克斯坦(8.4吨)、卡塔尔(3.1吨)、印度(2.8吨)和哈萨克斯坦(1.7吨)。另一方面，去年11月全球央行售出了23.3吨黄金，其中土耳其黄金销量最高。\n\n“在土耳其，国内需求上升导致国内商业银行与央行之间的交易增加，导致该国储备减少20.9吨。这不是央行降低黄金储备的战略决定。蒙古是另一个引人注目的出售国，将官方黄金储备减少了2.4万亿美元。”\n\n金价在去年8月份见顶后，在去年11月份开始盘整。去年11月底，金价一路跌破1800美元/盎司。世界黄金协会的报告称，各国央行对黄金的需求变得“更加多变”，原因是肺炎大流行加剧了不确定性和财政压力。\n\n“现在断言之前持续净买入的趋势是否还将继续，或者其是否已经结束，转而出现了新的趋势，可能还为时过早。12月和2021年初的数据对帮助构建更大的图景至关重要，”Gopaul说。\n\n总体而言，世界黄金协会认为，各国央行并未改变其储备中对黄金需求的想法。“黄金在2020年的表现(+25%)在需要的时候提振了储备组合。我们去年进行的央行调查显示，黄金作为一种风险缓解资产的作用非常重要。虽然近几个月来一些不确定性有所缓解(如美国大选和英国退欧)，但疫情对经济的影响仍构成重大风险，需要加以管理。”",
			"added": 1610959796
		},
		{
			"topic_id": 1611120613,
			"title": "还是节点少，希望大家多多收藏关注....",
			"body": "收藏，关注，每天在zeronet起始页左侧栏的子菜单里点更新....",
			"added": 1611120603
		},
		{
			"topic_id": 1611387493,
			"title": "字节跳动申请数字支付方式专利",
			"body": "根据专利摘要显示，该方法的一具体实施方式分为三步，第一步是响应于接收到用户发出的用于生成数字货币钱包的生成指令，获取用于创建数字货币钱包的用户信息。\n\n　　随后，将根据预设密钥生成方法生成的密钥对的公钥和用户信息发送给数字货币钱包服务商对应的第一服务端，以使第一服务端基于公钥和用户信息向数字货币发行登记机构对应的第二服务端执行注册数字货币钱包的注册操作。\n\n　　根据接收到的第一服务端基于注册操作发送的用于创建数字货币钱包的创建信息，创建数字货币钱包。安装在终端设备中的该数字货币钱包可以被安装在同一终端设备中的其他应用调用。",
			"added": 1611387482
		},
		{
			"topic_id": 1611580236,
			"title": "数字货币要来了？",
			"body": "经济日报发布时间：01-2519:41《经济日报》官方帐号\n　　近段时间，各国纷纷加快了数字货币的研发工作。虽然，对于数字货币可能带来的问题，业界仍有不同意见，比如保护消费者个人隐私、保护金融体制稳定性等，但毋庸置疑的是，发展数字货币已经成为大势所趋。唯一不同的是，有些经济体真打算尽快推出数字货币；有些经济体则认为，推不推再商量，先研发出来再说，别掉队比什么都重要。\n\n　　欧盟：数字欧元箭在弦上\n\n　　欧洲央行行长日前表示，希望在5年内使数字欧元成为现实。这一表态相当于欧洲央行的“政策宣示”，数字欧元的推出已经是箭在弦上，不得不发了。多年来，欧洲一直在使用和推广电子支付方面犹豫不决，对于数字化货币更是慎之又慎。2018年，欧盟颁布《第五版反洗钱令》，认识到发展数字货币是必然趋势。\n\n　　日前，欧洲央行行长克里斯蒂娜·拉加德在演讲时表示，希望在5年内使数字欧元成为现实。一时间，数字欧元成为热门话题。这一表态相当于欧洲央行的“政策宣示”，数字欧元的推出已经是箭在弦上，不得不发了。\n\n　　多年来，欧洲在使用和推广电子支付方面一直犹豫不决，对于数字化货币更是慎之又慎。欧盟长期以来没有推出主权加密货币的计划，主要是出于保护金融安全及保持欧元稳定的考虑。当然，欧洲人极为看重的个人隐私问题也是数字货币绕不过去的坎。\n\n　　2020年12月24日在比利时布鲁塞尔拍摄的欧盟委员会总部大楼前的欧盟旗帜。张铖摄（新华社）\n　　不过，到了2018年，欧盟颁布《第五版反洗钱令》，认识到发展数字货币是必然趋势，开始规范并监督私人数字货币的使用。如今，全球企业每天的数字化交易额达数万亿美元。在这种背景下，欧洲央行也不得不紧跟时代潮流，并于2020年10月首次公布了发展数字欧元的计划。\n\n　　欧洲当地评论员认为，在中美引领全球技术的当下，欧洲发现自己很难在战场上找到位置。为此，欧盟会努力重新定义并扩大其数字主权，建立一个基于规则和标准的数字空间。一方面，要通过强化数字支付等领域的反垄断监管，规范数字市场秩序；另一方面，要加快构建促进隐私保护和技术创新的“数字经济单一市场”，打造欧洲云和数据解决方案。其中的关键因素就是尽快推出数字欧元。",
			"added": 1611580224
		},
		{
			"topic_id": 1611754914,
			"title": "刚刚突然无法发布，各位请注意更新..",
			"body": "突然发生的，现在应该已经恢复，谢谢大家...",
			"added": 1611754901
		},
		{
			"topic_id": 1611757758,
			"title": "现金的消亡与货币的未来之战",
			"body": "来源：链捕手 \n　　在未来，我们将会拥有私人的、匿名的现金替代品。但在电视剧《黑镜》所描述的未来中，你口袋里的钱对你无所不知。\n \n###　　币世界-现金的消亡与货币的未来之战\n\n　　随着央行数字货币与加密货币走向主流社会，现金的使用价值受到较大程度削弱。而加密开发工程师、未来主义者Daniel Jeffries在本文中认为，现金的消亡不可避免，而且西方在数字货币的竞争中已经远远落后于中国，并对西方国家的保守策略提出猛烈批评，同时对未来的公众隐私状况感到极度担忧。\n\n　　作者/Daniel Jeffries\n　　编译/Alyson、Echo\n\n　　在未来，我们将会拥有私人的、匿名的现金替代品。但在电视剧《黑镜》所描述的未来中，你口袋里的钱对你无所不知。\n\n####　　现金正在消亡。\n\n　　但随着现金的消亡，隐私的未来变得极不确定。在之前的文章中，我曾说过政府将在二十年内使现金消失。但是现在，我认为它用不了那么久。中国坚持不懈地推动并建立国家背书的数字货币，席卷全球的经济灾难以及比特币、以太坊等去中心化加密货币的惊人崛起，都加快了现金消亡的时间进程。现在唯一的问题是用什么取代它？是去中心化的加密货币，还是以国家驱动的数字货币更具有优势？\n\n　　早期开源社区是十分强大的，在中心化力量了解到自身受谁冲击之前，就发布了比特币和基于隐私的现金替代方案，例如Zcash和Monero，各个国家和地方都在密切关注它，并且已快速学会和适应，几乎世界上每个中央银行都在迅速制定自己的数字货币计划。\n\n　　这意味着关于未来可能有两种截然不同的愿景。一是现金被消灭，国家数字货币成为货币的主要形式，货币将与你的身份验证和位置数据有关，你所做的一切都由功能强大的政府计算机记录下来，甚至，这些计算机对你的了解比你对你自己了解的更多，去中心化的货币将变成非法的。\n\n　　二是国家的货币系统剔除了现金，但我们可以看到与其并行的、开放的、基于隐私之上的数字货币系统，这种开放性使其拥有和现金的相同匿名属性。\n\n　　请注意，在这两种情况下，实物现金都将不复存在。但这将造成两种截然不同的未来，一种情况，你可以更好的控制你的钱；另一种情况，你将被你的钱控制。\n\n####　01　未来之战\n\n　　毫无疑问，为货币的未来而战就是控制权之争。现在谁拥有控制权？谁将失去控制权？谁能获得更多控制权？\n\n　　每当社会结构发生变化时，权力就会随之变化。当控制权易手时，有人会获得更多权力，有人则会失去权力。我们已经看到这种权力在整个历史的弧度中一次又一次地来回摆动。\n\n　　币世界-现金的消亡与货币的未来之战\n\n　　罗马硬币上刻着长久统治者的面孔\n　　古希腊时代，去中心化国家被罗马帝国的中央集权所取代，但是随后帝国走向解体，取而代之的是一些由基督教以及古希腊遗留的艺术、建筑和数学理想松散结合而成、不断变化的民族国家集合体。权力由集中到下放，如此循环往复，贯穿整个人类历史的长河。\n\n　　货币的演变反映了人类历史的进程。当人们想找到一种方式以此替代物物交换，货币便随着时间的推移进化为信用，并且可以用它来交易任何东西，从马到奶酪。当国家政权不稳定时，货币更多是地方性的。通用货币的发展使得进行国际交易的人可以在之后兑换回当地货币。\n\n　　民族国家的崛起反映了货币的崛起。随着小部族逐渐沦为封建领地，突袭和战争将边界推到更稳定的状态，货币演变成更为普遍接受的标准。我们越来越多地看到诸如黄金和白银之类的贵金属在人们所认为的货币中占主导地位。而后珍贵的奖章被压制成具有固定价值的硬币。使用硬币后，我们又开始使用由贵金属背书的小纸片。最终，随着各国脱离金本位制，我们切断了与贵金属的联系。此时，实体货币的进化已经达到顶峰。\n\n####　02　现金之战\n\n　　就像我们看到化学胶片发展了一百多年而突然被数码相机取代了一样，纸币也将遭受同样的命运。它将被流动性强、易于转移的数字货币所取代。\n\n　　向无现金社会的转变始于数年前。现在中国已经是一个基本没有现金的社会，这是一个巨大的变化，而在我2014年访问中国时，现金仍然是主流。仅仅7年，中国86%的人使用移动支付代替现金，跳过了古老的Visa和万事达POS系统。\n\n　　2016年底，印度总理莫迪发文件禁止国家大部分的货币流通，目的是减少腐败并让人们纳税，但一年后被叫停；澳大利亚曾试图禁止使用现金购买1万块以上的物品，这项措施也以失败告终。这些早期的失败并不意味着现金的胜利，仅是一种尝试。\n\n　　这些例子清楚地表明政府将现金看成一种威胁。因为现金几乎无法被国家控制，政府无法轻易监控现金流向，包括谁拥有它以及用它买了什么。随着民族国家成为地球上的终极力量，他们夺取了印钞权，并取缔了任何其他人利用法律和武力创造货币的权力。国家已经习惯了这种控制。\n\n　　最初，印有该民族国家象征的实体货币是声望的最终来源，拥有货币意味着拥有独立的力量。但这一切随着货币变得越来越虚拟化而开始改变。随着虚拟化程度的提高，货币失去匿名性，变得更易于跟踪。随着1950年代和1960年代信用卡的兴起，货币及其流向变得越来越透明，由Diner's Club和Visa等私人公司持有的实物分布式账本详细记录了这一动作。随着计算机和网络在1980年代和1990年代席卷全球，所有这些分布式账本都变得数字化，并且变得更加透明，控制这笔钱的流动变得比印钱本身更加重要。\n\n　　现在，政府已经习惯于查看每笔交易及其去向，他们不想失去控制权。消灭现金将永远消除匿名性。如今只有一个问题：他们还难以摆脱现金。\n\n　　正如我们在印度看到的，人们拒绝交出现金并用掉它们。一年后，印度不得不将这些钞票重新投入流通，因为他们的数字系统还没有准备好处理这些钞票。在澳大利亚，这场流行病粉碎了任何一种错觉，即澳大利亚已经有了一个强大到足以取代现金的数字支付系统。\n\n　　最终要取缔现金，国家所需要的不仅仅是法律。一项新技术拥有几乎所有旧技术的特征和一堆新的不可替代的功能时，原本占主导性的旧技术才会消失，这就是数字货币的用武之地。真正的数字货币并不是来自一个国家，创新始于比特币。\n\n####　03　民族国家反击战\n\n　　大多数民族国家对比特币国际化、去中心化的性质感到恐惧，政府享受货币供应的控制权已久，以至于他们无法再想象像丝绸或盐之类的国际货币了。\n\n　　民族国家对加密货币感到恐惧和愤怒。当Facebook试图启动Libra时，国会和其他世界各国政府都在追随他们；当Telegram试图构建一种完全可扩展的数字货币时，美国政府却将它们粉碎了，尽管它们从认可的投资者那里筹集了所有资金。\n\n　　但是，当美国和其它政府在恐惧中做出反应时，中国却在密切关注区块链，他们比世界上任何其他国家都了解自己的力量。当其它超级大国不看好区块链及比特币，或处在盲目的恐惧中时，中国已开始大力建设区块链。\n\n　　中国的数字人民币点燃了「扼杀现金」的导火索，加速了全球现金的消亡。中国的数字支付系统让世界各国感到震惊。他们比西方强国领先多年。中国已经开始测试数字人民币，进行空投，让市民用免费的钱买东西。根据我看过的视频和评论来看，这是一个很好的平台。它让用户无论是否离线都可以通过触摸手机来兑换现金，并在之后同步交易。\n\n　　中国很聪明。他们没有像Doom博士这样愚蠢的西方经济学家对比特币的巨大价格波动进行抨击，而是看到了一种扭曲比特币最初的自由主义设计的方法——建立一个中央控制的数字化管理中心。\n\n　　他们认为，这是建立一个国家支持体系的一种方式，这个体系可以轻松跨越国界、轻松突破国际制裁，最终甚至粉碎美国主导的国际货币体系。他们利用区块链的底层技术，然后将其抛之脑后，用集中控制的工具取代了那些理想主义特征。一种基于许可、口授的「共识」模式，让那些原始的乌托邦理想处于水火之中。\n\n　　中国人还看到，一种由难以改变的算法规则控制的去中心化货币，这意味着政府不能再通过取消部分货币流通或印刷更多的货币来贬值或膨胀货币，他们将失去实施货币管制的能力，告诉人们一次可以取出多少或可以寄给别人多少。以隐私为中心的加密货币更糟糕，因为这意味着每个人背后都有铁板钉钉般的加密协议，但调查人员想走捷径而不是做真正的监视工作。\n\n　　中国看到了一切，希望在加密货币占领世界之前先行一步。因此中国迅速采取行动，其禁止国内进行比特币交易。然后，他们建立了一个中心化的数字现金体系，以迅速粉碎去中心化的货币。他们将通过「一带一路」倡议，让中国人在发展中经济体大量投资，修建道路、桥梁和基础设施，或提供贷款，从而为人民币散播种子。很快，他们就会期望发展中国家用数字人民币偿还这些贷款。\n\n　　一开始他们可能会面临一些阻力，但最终那些没有大规模建设支付和银行基础设施的小国将看到它是多么简单、容易和无害，他们将开始越来越多地使用数字人民币。他们还将看到美国和欧洲仍在使用的落后、陈旧、荒谬的银行体系，并将其完全忽略。\n\n　　想通过西方系统汇款吗？写一张便条，签名、扫描、然后传真给他人。也许一天之后有人收到了。如果想和美国人做生意的话，除非一个第三世界国家的人一开始就可以得到银行账户，或者一个小国家的企业可以遵守所有的FACTA要求。\n\n　　因此，当他们在与古板的国际银行体系抗争时，他们或许会选择在智能手机上启动他们的数字人民币钱包，或者在桌面上使用一个漂亮的数字仪表盘，然后使用中国的系统在几秒钟内就可以在全世界范围内获取利益。猜猜之后他们选择了哪一个？\n\n　　当美国放弃在其他国家的领导地位和投资，转而以一种荒谬的「我是第一」的民族民粹主义世界观向内看时，中国人却在投资未来。当美国人在打一场毫无意义的破坏性文化战争时，中国人在全世界70多个国家投资，这些国家政府不稳定、基础设施落后，中国用修路建桥的方式来购买未来，而美国却在筑墙。\n\n　　当然，西方世界不希望看到一种中国货币主宰第三世界，世界上其他国家的央行都在竞相建立自己的数字货币来应对这一威胁，但西方已经远远落后。意大利希望实现完全无现金化，欧洲也是如此，它加强了对数字欧元的研究。但西方大国正面临着和中国差距过大的困境。\n\n　　不过，西方列强终会迎头赶上，很快我们将展开国家数字货币的全面军备竞赛，争夺霸权。他们中的一些人将受到可怕的IT和程序员的阻碍，一些人将有暗黑的设计，一些人将破坏安全协议并遭到黑客攻击，但他们中的一部分人将有好的结果，失败的国家将简单复制成功的国家。\n\n　　有了新的中央银行数字货币，国家就有权对你的钱包进行全面的监视，你所做的每笔交易、你到过的每一个地方……所有这些都可以获取你的身份、历史记录和地理位置数据。十年后，你就不再报税了，每次你在旧货拍卖会上买一台二手烤面包机时，它们都会被自动扣除。如果出了差错，你可以打电话抗争，或者让会计帮你退款。而政府会免费向你贷款一年，这些钱甚至不会从中央银行转移到私人银行机构，它会直接进入你的口袋，你的钱知道你做过的一切。\n\n　　中央银行数字货币将加速到来。尽管加密社区中有与之相反的原始规定，但人们绝对会使用这些中央银行数字货币。甚至，他们会为此感到自豪。\n\n####　04　信任的特质与去中心化货币的不足\n\n　　当然，只有当政府运转良好时，人们才会感到自豪和高兴。当事情进展顺利时，体制中的弊端将不会影响到足够多的人并进入公众的视线，只有「坏人」才会付出代价，但可能不是普通公民接触到的任何人。因此这个系统将主要适用于大多数人，他们不会在意隐私，因为他们只是给孩子买尿布、在亚马逊上买书或在当地商店买咖啡。\n\n　　币世界-现金的消亡与货币的未来之战\n\n　　但是，当政府出现问题时，就像我们在美国国会大厦起义中看到的那样，他们的想法将会迅速改变。一个国家背书的货币与控制它的政府一样，你必须信任它，为了信任它，你必须信任它背后的人。你不能将制度视为固定的概念。\n\n　　美国不是固定的。每个政府机构背后都有一群人，他们一直在运转。IBM是一家公司，但是公司总是在变化，那是因为它背后的人正在改变。信任基于谁在掌权，以及他们如何使用这种权力。信任是不断变化的。信任经常被打破，只要一次失信就可以永远粉碎它。一个男人可能对妻子忠诚十年，但在背叛他的一瞬间，信任就不在了。\n\n　　「传统货币的症结在于使其运转所需的全部信任，必须信任中央银行不会使货币贬值，但是法币的历史充满了对信任的破坏。」中本聪在2009年写道。\n\n　　当政府发疯时，他们现在有权把这种疯狂传染给你。想把你辛苦挣来的钱搬到另一个没有那么疯狂的人掌权的国家吗？但你不能，因为货币管制，你的钱将被冻结，把钱花在国内或别的地方吧。\n\n　　也许你认为这是一件好事，一个民族国家不应该拥有控制资金流入和流出该国的权力吗？他们只是试图保护自己的公民和经济免受影响。如果你住在冰岛，感受可能会有所不同。冰岛在2008年金融危机后实行了严格的货币管制，直到2017年才结束。这意味着，住在那里的每个人都只是在幻想中拥有自己的钱，而他们从来没有真正拥有过。\n\n　　你不能在海外买房，不能投资特斯拉股票，只能将资金投资于当地的企业，但这些企业正在受苦受难，收益微乎其微甚至为负。\n\n　　当然，加密领域的很多人都认为，没有一个头脑正常的人会选择国家背书、处于监视下的货币，而不是去中心化的隐私保护系统。一般人不在乎隐私，他们不知道隐私意味着什么。他们没有想过，或许生活在完全曝光在政府之下的世界里。\n\n　　币世界-现金的消亡与货币的未来之战\n\n　　他们从未居住在东柏林，密码警察随时会出现在你家里，并以任何理由将你带离；他们从来没有住在委内瑞拉，突然经济崩溃，买面包需要花一年的薪水。\n\n　　这就是为什么他们会迅速采用自己国家强加的任何中心化数字货币的原因，如果政府简化它或强制使用它，或者两者兼而有之，这将加快数字化进程。\n\n　　在《加密技术发展的五把钥匙》中，我写道，要使去中心化的加密货币腾飞，不仅需要资金，还需要形成一个完整的生态系统，该系统需要分配货币、自动交换货币并用该货币提供商品和服务，而无需重新转换为法币。没有人能像中央集权的交易系统那样，创造出一个能阻止所有货币交易的超级交易系统。\n\n　　但相反，如今加密社区所做的只是在中本聪愿景上做一些小的迭代，用更新、更快的区块链让加密货币走得更快。他们创造了隐私级货币Zcash和Monero。他们提出了新的办法来升级区块链，而不需要进行分叉。\n\n　　但是除此之外，它们还是一样。\n\n　　目前还没有一款只能用加密货币购买的杀手级应用程序。除了空投、矿工和中心化交易所之外，目前仍然没有更好的方法来分发代币。这些只是将旧世界的中心化分配机制移植到新世界。虽然已经有去中心化交易平台，但你需要有加密货币来使用它们，并不能在那里换法定货币。加密货币的分发机制反映了中央银行自上而下的货币分发机制，矿工和交易所取代了中央银行和商业银行。\n\n　　我们需要在分配、经济和商业方面进行一场革命，使去中心化的货币真正腾飞。目前，加密货币充其量算是一种投机资产，它使一些人暴富，仅此而已。其体验仍然令人恐惧和困惑，几乎没有什么可以使用的，仅是对货币未来的一场测试。\n\n　　中心化数字货币已经成为现实，如果想看到保护隐私的去中心化货币，那我们就必须加快步伐，提高创造力，CBDC来得越来越快，我们的时间很紧迫。\n\n####　05　这就是一切的终结\n\n　　我的一位好朋友今年去世了，这让我想到了加密用户体验以及它对我们所有人的意义。\n\n　　我们很多年前一起进入加密货币领域，它是我们友谊源远流长的基础之一。我们达成协议，如果我们中的一个人死亡，另一个人将帮助他的家人找到并出售他的所有加密货币。当我坐下来使用与他那快要淘汰掉的智能手机相关联的两个密匙进行身份验证时，我会想「谁能为我做这些？我的钱将与我一同消失。」\n\n　　我和我的朋友完全信任对方。我会确保他的家人得到每一枚加密货币，他也会为我做同样的事。但不难想象，有人对拥有的加密货币并不谨慎。幸运的是，我的朋友做出了明智的选择，其他人可能就没那么幸运了。可怕的用户体验就在此，加密货币发展速度还不够快，无法与普通人接轨。\n\n　　要使加密货币真正流行起来，必须易于使用和易于入门。我说的是「三次点击」，只需点击三次即可设置一个钱包进行为期三周的汇款，然后在交易所进行KYC，并确保你牢牢地记住了密码。这样你就不会在失去所有钱的情况下而永远没有客服帮处理，例如可能有人永远遗失了7002个、价值共2.2亿的比特币，仅仅因为他不记得把密码纸放到了哪里。\n\n　　当去中心化货币难以走出起步阶段时，中国进行着令人震撼的央行数字货币平台测试。由于西方国家落后一步，他们开始对去中心化货币进攻，这使得坚持隐私的货币更难获得吸引力。\n\n　　美国金融犯罪制裁部门试图在将政府移交给新的领导层之前迅速通过一套新的规则。该法规迫使交易所在每次有人进行3000美金以上汇款时都要保留姓名、电话号码和地址。因此，如果一位母亲给女儿汇款，交易所就需要将他们的姓名都保存在一个高度安全的政府数据库中，这个数据库决不会被黑客入侵。\n\n　　即使西方国家落后于中国，他们也会迎头赶上的，他们不能不追赶，因为金钱即力量，且这不仅仅是权力拥有者的力量，一个百万富翁或亿万富翁掌握着很多权力，但他们的经济实力与一个大型经济体相形见绌。\n\n　　印刷货币的人拥有世界上真正的权力，铸币的权力与神的力量相匹敌，民族国家比任何人都知道这一点。他们现在拥有这种权力，并且不想失去它。为了保持这种状态，他们不得不消灭现金并消除去中心化货币的威胁。\n\n　　不幸的是，中本聪可能已经给了他们这样做所需的武器。中本聪梦想创建一个不被控制的、去中心化的、无需信任的系统，但在创建区块链时，他/她可能无意中向中心化权力赋予了锁链，将我们所有人永远捆绑在一起。",
			"added": 1611757744
		},
		{
			"topic_id": 1612085833,
			"title": "已群体免疫的玛瑙斯再度爆发严重疫情，说明做鸵鸟无效，全球生产物流体系面临挑战",
			"body": "群体免疫”这个概念，从疫情开始到现在一直饱受争议。\n　　最近TheLancet和Science的两篇论文再次将“群体免疫”带回人们的视野：巴西一座曾被认为达到“群体免疫”的城市，再次遭遇了疫情高峰。\n\n###　76%感染率，群体免疫形成\n\n　　这座巴西第八大的城市名叫马瑙斯，坐落于亚马逊热带雨林中，拥有超过500年历史的辉煌岁月。然而，炎热的环境和糟糕的抗疫，让马瑙斯不堪一击的医疗系统在数月前已经土崩瓦解过一次。但是，在最初的疫情高峰过后，马瑙斯市的感染率出乎意料地出现了下降的趋势。5月开始，马瑙斯的日增确诊病例数开始下降，到了8月，日增死亡人数更是趋近于0。\n\n　　1月15日，Science发表了一篇关于马瑙斯疫情的论文。研究人员选取了自玛瑙斯的不同月份血液样本，并对其中的新冠病毒抗体IgG进行检测。在感染新冠之后，新冠病毒抗体IgG可以在患者康复后的一段时间里测出。因此，普通人群中，IgG阳性率可以近似等同于人群中的新冠患病率。\n\n　　4月，巴西马瑙斯新冠的人群患病率为4.8%（95%置信区间3.3～6.8%）。到了5月，这个数字增长到44.5%（95%置信区间39.2～50.0%）。6月，这个数字达到了峰值52.5%（95%置信区间47.6～57.5%）。\n\n　　研究人员据此预估，马瑙斯人群感染率在7月时达到约66.2%(95%置信区间61.5～80.1%)，在10月时则达到约76.0%(95%置信区间66.6～97.9%)。而据文献显示，亚马逊地区新冠病毒的基本传染数R0为2.5～3.0，按照公式[1-(1/R0)]x100%计算，达到群体免疫的阈值为60%～67%。\n\n　　也就是说，当人群中有超过67%的人形成对病毒的免疫后，病毒传播速度就会大大减缓，无法在人群中进一步传播。仅从数字来看，马瑙斯在10月就已经达到了理论上的“群体免疫”。\n\n####　　群体免疫为何失效？\n　　被雨林包裹、与世隔绝的马瑙斯，在达到了76%的感染率后，“意外地”成为了全球首个完成群体免疫的地方。而从数据上来看，7～10月马瑙斯的病例数在“群体免疫”建立起来之后，确实有了明显的下降。然而，在进入2021年后，看似早已风平浪静的马瑙斯疫情死灰复燃。\n\n　　仅2021年1月的头三个星期，马瑙斯就新增了1333例新增新冠病例。据CNN报道，仅仅1月14、15两日，马瑙斯就有29名患者由于氧气短缺而死于新冠肺炎。1月11日。巴西卫生部长帕祖耶洛前往马瑙斯视察疫情时表示：“这是所有人始料未及的情况”，“疫情发展得太快了”。\n\n　　所谓“群体免疫”为何失效？1月27日发表在TheLancet上的一篇文章提出了4点见解。\n　　第一，76%感染率这个数据毕竟是一个通过建模、修正等方式得出的数字，存在出错的可能性。在12月新的一波疫情高峰来临前，马瑙斯实际上可能并没有达到群体免疫的标准。\n\n　　第二，英国一项研究提示，感染后的血清抗体滴度会随着时间的推移而降低，这或许也可以解释为什么会出现二次感染病例。而马瑙斯大多数病例都是在2020年3至5月感染的，那么在7到9个月后，康复者血清中的新冠抗体浓度可能不足以起到有效的保护作用。\n\n　　第三，既往感染者血清中的新冠抗体可能并不能对抗变异毒株。目前，正在巴西流行的变异毒株包括了B.1.1.7和P.1两种，其中P.1突变株正是1月12日在马瑙斯被首次检出。一项初步研究发现，马瑙斯目前的新冠感染病例中，P.1突变株的占比达42%。\n\n　　此外，包括马瑙斯在内的巴西多个地区最近又检出了一种新的突变株：P.2，这是一种B.1.128的亚谱系突变株，和P.1突变株一样，都在刺突蛋白发生了E484K突变。而此前多个体外实验表明，E484K突变可能会使新冠病毒发生免疫逃逸，让中和性抗体的作用减弱。也就是说，马瑙斯的既往感染者仍有可能二次感染新的突变病毒。\n\n　　最后，如果高传播性的变异毒株成为流行毒株后，R0因此提高，达到全体免疫所需要的人口百分比也随之上涨，原本形成的群体免疫，可能被再次打破。\n\n　　Science的另一篇评论文章认为，马瑙斯的例子是对全球抗疫的一次警示：即便在高水平感染的情况下，群体免疫也很有可能无法实现。而在追求“群体免疫”的过程中，付出的代价可能是惨痛的。马瑙斯的死亡率目前在0.17%至0.28%之间，但该地区人口比较年轻，对于其他老年人口比例更高的地区来说，结果可能会更加严重。",
			"added": 1612085818
		},
		{
			"topic_id": 1612413970,
			"title": "从这几天的盘面和消息看，似乎确实有犹太资本试图大举进入数字货币领域的迹象...",
			"body": "当然证据不是很充分，不过我的感觉很多时候是非常准确的。\n可能我在本坛之前关于混乱，军阀进入政治舞台，甚至元首的分析让某些人担心了，不排除他们在为某种最坏的可能做准备，毕竟数字货币绝对比瑞士银行要靠谱多了。\n至于其他的，大家慢慢看吧......",
			"added": 1612413954
		},
		{
			"topic_id": 1612456316,
			"title": "CNN：美国防部长召集军队高层，计划未来60天内暂停美军活动，加强打击军内白人至上和右翼极端主义",
			"body": "CNN：美国防部长3日召集军队高层，计划在未来60天内暂停美军活动，加强打击军队内部的白人至上和右翼极端主义。国防部没透露美军活动暂停的时间长度，60天将根据指挥官具体的安排，并未提到将采取何种形式行动\n\n　　美国全国广播公司（NBC）报道，美国国防部当地时间3日下令全军范围内暂停任务，以解决军中的极端主义问题。\n\n####五角大楼全军停摆\n\n　　五角大楼发言人约翰柯比3日称，近期接管美国防部的首位黑人防长劳埃德&#8226;奥斯汀在当天举行的各军种领导人会议上宣布：未来60天内，全军各部门停摆，以讨论白人至上主义和类似的极端主义所构成的威胁。\n\n　　“在场的所有人没有人不同意这是个问题。”柯比说。与会者还包括美军参谋长联席会议主席马克米利和副主席约翰海滕等。柯比称，这一命令是为了让军方领导人清楚地表明，白人至上主义和其他极端主义意识形态在军队中没有立足之地，且会议旨在听取军队各方意见，了解他们如何看待这一问题。\n\n　　柯比还表示，今年1月6日国会大厦骚乱事件给国防部“敲响警钟”。 报道称，美军部分现任和前任服役人员参与了此次围攻，而五角大楼目前也正就该机构是如何新招募士兵以及如何追踪军中极端主义分子而接受审查。\n\n　　NBC表示，在美国军队中，“停摆”的目的通常是为将整军注意力集中在一个严重的问题上，要求每个单位和每个级别暂停日常活动来讨论这一问题。不过，目前五角大楼尚未提供数据来概述这一问题的严重程度。",
			"added": 1612456299
		},
		{
			"topic_id": 1612708718,
			"title": "老实说我确实没有看出来dogecoin的特点在哪里。",
			"body": "特斯拉和SpaceX的创始人埃隆·马斯克（Elon Musk）不仅发推文表示自己最喜欢的加密货币可能是狗狗币，其还把自己的Twitter账户简介改为了“狗狗币前CEO ”。\n老实说我确实没看懂这波操作，也没看出来dogecoin的特色在哪里，当年除了量特别大之外似乎没有任何特色，后来好像销毁过几次，但始终没有什么新消息爆出来，实在看不出其价值点在哪里。\n给私仓喊淡带盐？没这个必要吧，\n总之确实没看明白，欢迎高手指教........",
			"added": 1612708700
		},
		{
			"topic_id": 1612792394,
			"title": "各领域都有大佬开始对比特币表态，我断定很快拥有比特币将成为身份和地位的象征，并成为一种潮流和时尚，甚至谈论它都会是智慧和知识的象征..",
			"body": "针对今日特斯拉对比特币投资15亿美元一事，灰度创始人、前首席执行官Barry Silbert转发此前推特内容，“显然，在MicroStrategy和灰度之间存在着某种比特币购买竞赛”，他艾特马斯克并表示，玩家3加入了比赛，祝你好运。\n\n　　我以为类似这样的情况肯定会越来越多，会有越来越多的人站队，并表态的。尤其各行业各领域的头面人物都不得不站队表态，甚至手脚慢一点的将来都会不好意思跟其他人打招呼，因为这表明自己在学识和智慧上别人low了很多。\n\n　　要不了多久拥有比特币将不仅仅会成为一种财富、身份、智慧、知识的象征，更会是一种潮流和时尚，甚至公开谈论比特币都意味着智慧、认知和B格.......",
			"added": 1612792375
		},
		{
			"topic_id": 1612935801,
			"title": "希望摩根是对的：摩根大通认为马斯克过于大胆，其他公司不敢效仿..",
			"body": "以尼古劳斯·帕尼吉左格卢（Nikolaos Panigirtzoglou）为首的摩根大通银行策略师在一份报告中写道，主流企业若想效仿特斯拉的做法首先要面临的主要问题就是比特币的高波动性。特斯拉的做法过于大胆，其他企业恐怕不敢轻易效仿。\n\n　　业内专家们目前正在讨论，特斯拉的这一高调举措是否会在业内产生连锁反应，其他上市公司是否也会进行类似的投资。\n\n　　一般情况下，上市公司购买资产时需要考虑到资产的波动性问题。公司的投资组合中，除了国债，还有银行存款、货币市场基金以及短期债券。这些资产都用一个共同特点——年化波动率基本上在1%左右徘徊。然而，如果把比特币也纳入资产负债表，情况顿时就会发生改变。众所周知，比特币是波动率奇高的资产。\n\n　　小摩策略师表示，公司增加1%的比特币配置，就能导致整体的投资组合的波动性大幅提高。这样的配置意味着，如果比特币的年化波动率高达80%，那么包含有比特币的投资组合的波动性将升至8%。\n\n　　摩根大通(JPMorgan)的策略师写道，不管最终有多少公司效仿特斯拉，本周的声明无疑突然改变了比特币的近期走势，导致了更多资金流入比特币，帮助比特币彻底突破了4万美元大关。比特币此次的涨势会持续多久，可能取决于是否有更多非投机性的机构资金流入比特币，比如那些流入“灰度比特币信托”（Grayscale Bitcoin Trust）的资金。\n\n　　不过，他们认为，特斯拉此举让这一趋势（大公司投资比特币）受到了关注。",
			"added": 1612935781
		},
		{
			"topic_id": 1613030525,
			"title": "推特公司首席财务官西格尔接受媒体采访时称，推特对特朗普账号的封禁是永久性的",
			"body": "推特公司首席财务官西格尔在当地时间2月10日接受媒体采访时称，推特对特朗普账号的封禁是永久性的，即使特朗普再次竞选并获胜，他也不会被允许重新注册推特。\n\n　　西格尔说，“我们的政策是这样的，当你从平台上被移除，你就被（永久）移除了，无论你是评论员、CFO还是前任或现任公职人员。请记住，我们的政策是为了确保人们不煽动暴力。如果有人这样做，我们必须将他们从服务器中移除，且不再被允许回来。”（央视记者 殷岳）\n\n　　所以，很明显，最终会有越来越多多人选择有零网或者暗网，不过对零网和暗网的扼杀也会越来越严酷，这与当初比特币的境遇何其相似....",
			"added": 1613030504
		},
		{
			"topic_id": 1613196669,
			"title": "摩根大通联席总裁Daniel Pinto认为，摩根大通最终将不得不进入比特币（BTC）领域..",
			"body": "区块天眼APP讯 : 摩根大通联席总裁Daniel Pinto表示，目前公司进入比特币领域的需求“还没有达到”，但他确信“在某个时候会达到”。\n\n　　美国主要投资银行摩根大通的联席总裁Daniel Pinto认为，摩根大通最终将不得不进入比特币（BTC）领域。这位高管在周五对CNBC表示，摩根大通是否决定推出比特币服务，将取决于客户对比特币交易的需求。虽然目前的需求还不够强劲，但Pinto对需求的进一步增长有信心：“随着时间的推移，如果发展出一种资产类别，将被不同的资产管理公司和投资者使用，我们将不得不参与进来，现在还没有达到需求，但我相信在某个时候会达到的。”\n\n　　在Pinto发表上述言论之前，围绕摩根大通的一些看涨信号已经出现一段时间了。据报道，在今年1月的一次内部电话会议上，摩根大通全球市场负责人Troy Rohrbaugh承认，该行越来越多的员工在询问其比特币计划。据知情 人士报道，Pinto已经表示，他对比特币持开放态度。\n\n　　考虑到摩根大通首席执行官Jamie Dimon以反对比特币闻名，摩根大通可能进军比特币领域似乎有些讽刺意味。2017年9月，Dimon称比特币是一种“欺诈”，将其比作“郁金香狂潮”，并预测比特币会出现大规模崩盘。当时，比特币的交易价格在3500美元左右。三个月后，比特币的价格达到了20000美元，尽管不久之后，比特币进入了持续多年的熊市。\n\n　　2020年11月，比特币的市值超过了摩根大通，达到3520亿美元。在这一里程碑出现之前不久，Dimon将比特币比作带有监管控制的专有区块链网络，并表示：“比特币有点不同，但我不感兴趣。”\n\n　　摩根大通策略师过去对比特币给出了好坏参半的信号。据报道，2020年10月，摩根大通曾暗示，比特币的价格在长期内将翻二或三番。几个月后，摩根大通策略师John Normand和Federico Manicardi认为，在市场严重紧张时期，比特币是最不可靠的对冲工具。",
			"added": 1613196647
		},
		{
			"topic_id": 1613311203,
			"title": "苦口婆心给富豪，尤其是犹太富豪们指了条明路，也没见他们有什么表示....",
			"body": "sigh....",
			"added": 1613311180
		},
		{
			"topic_id": 1613398063,
			"title": "PayPal预将其数字钱包打造成各国央行向不同收入水平的消费者分发CBDC的渠道",
			"body": "　　IFTNews国际财经讯：周四，在线支付巨头PayPal PayPal 举行了投资者日活动。在活动中，PayPal 首席执行官丹舒尔曼透露了该公司作为中央银行数字货币(CBDC)分销商的计划。换句话说，PayPal 的数字钱包可能成为各国央行向不同收入水平的消费者分发CBDC的渠道。此外，与第三季度相比，PayPal 的交易收入增长了12%，达到57亿美元。每活跃账户交易40.9笔，总支付金额达2770亿美元。尽管来自旅行社和垂直行业的交易量下降了约50％，但该数字代表即期增长39％，与外汇无关增长36％。\n　　PayPal 首席执行官表示：“在未来两、三或五年内，我们将拥有多少(数字钱包)，我们是各国央行和政府分发这些数字化货币形式的完美补充。”\n　　此外，PayPal 首席执行官透露，该公司正在研究智能合约。它还在考虑对其他非加密资产进行代币化。\n　　“这是一个几十年难得的机会，这个系统的基本轨道将被重新定义，我们有机会帮助塑造它。”他表示。\n　　随着PayPal 成为CBDC分销商，更多的客户将对其产品感兴趣，特别是与加密相关的产品。值得注意的是，PayPal 客户的交易活动显著增加。据该公司称，使用其加密服务的PayPal 客户数量在每周交易中增加了12%。部分原因是，使用加密货币的美国PayPal 客户中，有超过40%的人会返回来完成另外两笔以上的交易。\n　　PayPal 在2020年底增加了对加密货币的支持。目前，用户可以通过PayPal 购买、持有和出售比特币(BTC)、以太坊(ETH)、比特币现金(BCH)和莱特币(LTC)。今年晚些时候，PayPal 计划大幅提高加密货币的实用性。该公司希望将其作为全球2,600万商家购买商品的资金来源。\n　　事实证明，推出加密购买选项是PayPal 朝着正确方向迈出的一步。最近，该公司发布了2020年第四季度业绩，其增长好于预期。根据收益报告，该公司新账户数量同比增长72%，本季度达到1600万。",
			"added": 1613398039
		},
		{
			"topic_id": 1613636855,
			"title": "这几天太平淡了，什么可说的都没有....",
			"body": "比特币创新高，媒体似乎挺激动，各种所谓的大师，大神，专家也纷纷发言，说些不知所云的陈词滥调。\n可我的感觉就是，太平淡了，以至于什么可说的都没有...",
			"added": 1613636830
		},
		{
			"topic_id": 1613829732,
			"title": "国际支付巨头纷纷布局数字货币，Visa已支持全球35家数字货币服务商",
			"body": "来源：雷锋网\n\n原标题：国际支付巨头纷纷布局数字货币，Visa已支持全球35家数字货币服务商\n\n2月20日消息，国际支付巨头Visa（维萨）已经与全球35家领先的数字货币平台或数字钱包合作。\n\n这些机构都是经过国家许可或者受相关部门监管的数字货币平台，比如数字支付平台Wirex、数字货币交易平台Coinbase和Fold、加密资产借贷平台BlockFi、奥地利加密交易平台Bitpanda、加密借记卡平台Crypto.com等。\n\n业内人士表示，Visa与数字货币服务商的合作，让消费者可以更快、更容易地转换数字货币，并将这些资金实时存入到他们的Visa凭证上\n\n这不是Visa第一次布局数字货币，早在2019年Visa便投资了加密货币托管服务商Anchorage。\n\nAnchorage对区块链技术进行了多年的探索，是一家致力于为数字货币生态系统建立安全基础设施的公司。Visa投资Anchorage，被认为是其在数字货币领域布局的一次“小试牛刀”。\n\n此后，Visa的研究团队继续探索，进行了包括Zether和Flyclient在内的多项创新。\n\n据公开信息显示，Zether协议是一种保密的支付机制，兼容以太坊和其他智能合同平台，旨在为交易增加更深一层的匿名性。2019年5月，摩根大通看好这一协议，宣布将其应用到自己的区块链网络中。而FlyClient是一个技术框架，可使移动设备更轻松地验证区块链交易。\n\n6月，Facebook新推出虚拟加密货币Libra，Visa也参与其中，后因为以法国为首的欧盟五国联手抵制Libra进入市场而退出。\n\n2020年5月，美国专利商标局（USPTO）发布信息，Visa提交了一份专利申请，使用区块链技术创建数字货币。该专利适用于数字美元以及其他中央银行发行的数字货币，比如英镑、日元和欧元。这份专利支持世界上任何国家中央银行的实物货币的数字化。\n\n2020年7月22日，Visa发布了一篇名为《推进数字货币——Visa对新的数字货币支付流程的展望》的文章，称数字货币有潜力将数字支付的价值扩展到更多的人和地方，因此，Visa希望帮助塑造和支持它们在未来货币中扮演的角色。\n\n在Visa与数字货币钱包合作之时，数字货币钱包同样也在寻求利用Visa的全部功能。\n\n比如Visa Direct通过与Visa的全球网络结合，可以使更广泛的消费者能够更快、更容易地转换数字货币，并将这些资金实时存入到他们的Visa凭证上。\n\n目前除Visa之外，Mastercard、Paypal等国际支付巨头也纷纷布局数字货币。\n\n近日，Mastercard便表示与巴哈马中央银行合作，推出了全球首个巴哈马沙预付卡，预付卡使人们可以选择立即将数字货币转换为传统巴哈马元，并在Mastercard支持的任何地方支付商品和服务。PayPal也表示，未来数月将向英国市场提供加密数字货币服务。",
			"added": 1613829706
		},
		{
			"topic_id": 1614329193,
			"title": "摩根大通：投资者可将1%的仓位配置于比特币",
			"body": "摩根大通成为了又一家提出投资者可利用比特币实现投资组合多元化的华尔街金融机构。\n\n　　策略师们近期吹捧加密货币，称其可以用来对冲股票、债券和大宗商品等传统资产的大幅震荡。相比大举押注比特币，他们的建议是持有相对较小的头寸，即便价格大幅走低，也不会蒙受过大损失。\n\n　　“在配备多种资产的投资组合中，投资者可能可以部署1%的仓位到加密货币，从而令经风险调整的整体投资组合回报实现增益，”Joyce Chang和Amy Ho等策略师在周三的一份报告中指出。\n\n　　加密货币可能相对比较新颖，且波动幅度较大，但也与其他资产基本没有关联度，可能可以成为良好的对冲工具。前美联储经济学家、Cornerstone Macro LLC的Roberto Perli和Benson Durham进行了计算，发现增加一定数量的加密资产，通常可在一定程度上降低股票投资组合的波动性。\n\n　　“来自ETF发行人难以满足的买方压力，封闭式基金和大型上市公司增持比特币，需求明显超过了供应，”Amber Group合伙人Annabelle Huang表示。\n\n　　Ark Investment Management的Cathie Wood最近接受采访时表示，如果所有企业将10%的现金投入比特币，那么会令其价格上涨20万美元。\n\n　　但是，摩根大通表示，数字货币的用途有限。“加密货币是投资工具，不是融资货币，”摩根大通的策略师指出。“因此，如果考虑用货币来对冲宏观事件，我们还是建议选择日元或美元等融资货币来进行对冲。”",
			"added": 1614329166
		},
		{
			"topic_id": 1614668763,
			"title": "高盛重启加密数字货币交易部门",
			"body": "来源：新浪财经\n\n据一位知情人士透露，在比特币价格飙升的情况下，高盛集团正在重新启动一个加密货币交易部门。\n\n因此事尚未宣布而要求不具名的知情人士称，高盛2018年曾开启加密货币交易业务，之后暂停，现计划3月中旬开始提供比特币期货等产品。高盛发言人拒绝置评。\n\n加密货币一度被高盛等精英公司回避，但现在正在赢得信任，其他银行和金融机构也有相关业务计划。纽约梅隆银行2月中旬表示，将持有、转让和发行数字货币，并称这是一家全球性银行首次为客户提供此类服务。万事达卡公司也表示，将允许持卡人在其网络上以加密货币进行交易。该公司上个月表示，正在“积极参与”全球中央银行的数字货币计划。\n\n高盛重启加密货币交易部门之际，数字资产过去几个月火箭式飞升。比特币价格过去一年上涨超过5倍，而且Paul Tudor Jones、Stan Druckenmiller和埃隆·马斯克等投资者竞相入局。马斯克的特斯拉公司2月份宣布购买了15亿美元的比特币。\n\n上个月，两只比特币ETF开始在加拿大交易，Purpose比特币ETF上市两天就卖出近4亿美元的基金份额。",
			"added": 1614668735
		},
		{
			"topic_id": 1614668960,
			"title": "Coinbase对纽约用户开放AAVE、UNI等13大币种交易服务",
			"body": "新浪财经发布时间：03-0203:47新浪财经官方帐号\n\nCoinbase对纽约用户开放AAVE、UNI等13大币种交易服务\n3月2日早间，Coinbase官方发推宣布，Aave (Aave)、 Balancer (BAL)、Band Protocol (Band)、Bancor (BNT)、 Compound (COMP)、 The Graph (GRT)、Loopring (LRC)、 Maker (MKR)、 Ren (Ren)， Synthetix (SNX)、 Uniswap (UNI)、 Wrapped Bitcoin (WBTC)以及yearn.finance (YFI) 十三大币种已对纽约用户开放交易服务。\n\n-----------------------------------------------\n注意注意，以上币种基本都是Defi币种....",
			"added": 1614668931
		},
		{
			"topic_id": 1614831363,
			"title": "盘点这些年接受比特币支付的那些国家及支付案例，所有接受比特币支付的都赚大了，接受越早赚得越多..",
			"body": "目前，虽然加密货币市场依旧火爆，但其在不同国家的待遇并不相同。一些国家对其持抵制态度，而另一些国家则在扩大其使用。比特币支付逐渐从大学、慈善机构等非营利性机构，向广泛的商业服务场景扩展。以下盘点了近几年比较有影响力的比特币支付案例。\n\n　　德国\n　　早在2013年8月，德国财政部就认可比特币为合法的私有资产，拥有者可以使用比特币缴纳税金或用作其他用途。\n　　在2016年，德国国内的能源巨头Enercity就宣布接受比特币支付，居民可用比特币支付电力、燃气、供暖和饮用水账单。同年，德国一所国家认证的私人商业大学——柏林ESMT，首次接受比特币作为货币使用支付学费和其他所有费用。\n　　事实上，卢恩大学并不是第一家对比特币敞开怀抱的大学，此前，塞浦路斯尼科西亚大学、英国的坎布里亚郡大学、纽约国王学院、澳大利亚弗林德斯大学、加拿大的西蒙·弗雷泽大学德国柏林ESMT大学都已陆续接受比特币支付。\n　　2017年7月，德国最大食品配送网站Lieferando.de已经宣布开始接受比特币支付，其拥有超过11000家合作餐馆、390万用户。\n\n　　俄罗斯\n　　2015年10月，俄罗斯最大的搜索引擎以及互联网服务商Yandex宣布计划将比特币引入他们的金融平台Yandex.Money，支付该平台上的交易商进行比特币支付。\n　　2016年俄罗斯莫斯科的一家咖啡店成为镇上唯一一家接受比特币来购买咖啡喝羊角面包的店。\n　　2017年5月中旬俄罗斯宣布2017年9月1日在线零售商Ulmart开始接受比特币支付，Ulmart是俄罗斯最大的在线零售商，每个月网站的浏览量超过2000万人，商品数量和服务项目将近1200万项，一些数额比较大的商品将允许使用比特币支付。\n　　2017年6月，俄罗斯汉堡王宣布开始在部分门店推广比特币支付，用户可使用比特币在店内消费。\n\n　　加拿大\n　　2016年9月加拿大多伦多安装了一台比特币ATM机，\n　　2017年3月加拿大多伦多办事处的内部餐厅Bistro 1858接受比特币支付，并且鼓励员工在Bistro 1858餐厅使用比特币支付。\n\n　　西雅图\n　　西雅图比特币钱包供应商ipay you 宣布将比特币转账到星巴克应用当中，用户可以使用数字货币进行购买星巴克，这样宣示着数字货币的时代即将到来。\n\n　　英国\n　　2014年2月，英国计算机销售巨头SCAN宣布开始接受比特币支付。\n　　2017年5月，英国机场停车服务提供商SkyParkSecure正式接受比特币作为支付方式，覆盖区域包括伦敦。利物浦、格拉斯哥和贝尔法斯特等城市的机场。\n　　2017年7月，英国化妆品巨头Lush宣布其线上商场开始接受比特币支付。\n　　2017年9月，英国The Collective公寓和租户开始可以用比特币支付租金。\n　　2017年9月，英国伦敦著名黄金交易所与BitPay达成合作，正在开始接受比特币作为支付方式来购买其贵金属产品。\n\n　　印度\n　　2015年7月，印度知名在线预订车票网站eTravelSmart与比特币钱包和商户付款处理器Unocoin达成合作，开始支持印度用户使用比特币购买车票。\n　　2016年6月，印度知名比特币交易平台Coinsecure和美国比特币支付处理商BitPay建成合作关系，将为广大印度商家提供比特币支付服务。\n\n　　瑞士\n　　2016年5月瑞士楚格镇议会决定将接受比特币支付公共服务。\n　　2017年1月瑞士跨国服务巨头兼四大会计事务所之一的安永（Ernst&young）是该行业首个接受使用比特币支付的公司，客户在该公司咨询或审计服务都可以使用比特币支付。安永（Ernst&young）的办公楼内设立了一台比特币ATM机。\n　　2017年10月瑞士公立大学卢恩大学开始接受比特币支付学生费用，校方在与Bitcoin Suisse AG合作，每周学生支付的比特币由Bitcoin Suisse AG换汇为瑞士法郎然后支付给学校，其中，汇率风险由Bitcoin Suisse AG 来承担。\n\n　　意大利\n　　2015年5月，意大利公共事业公司NordOverst Energie与比特币支付处理公司Tinkl.it达成合作，支付消费者用比特币来支付电力和天然气费用。\n　　2016年11月，意大利最大的出租车公司Cooperative Radio Taxi350接受比特币支付租车费用。Cooperative Radio Taxi350在罗马拥有3700辆出租车，每年提供超过100万的出租车服务。\n\n　　日本\n　　2016年，日本允许比特币用户使用比特币来支付水电费。\n　　2017年4月，日本大型零售商Bic Camera和日本知名比特币交易所、支付公司Bitflyer合作，宣布开始接受比特币支付。\n　　2017年5月，日本乐桃航空与新生代日本比特币交易所、支付公司B i t p o i m 达成合作，宣布计划在年底前接受使用比特币购买机票。并开拓旅游景点的纪念品商铺、转餐厅和酒店提供比特币收款服务。\n　　2017年6月，Anshin Oyado、Comicap等知名胶囊酒店与coincheck达成合作、宣布开始接受比特币支付。\n　　2017年7月，日本新版消费法案正式生效，取消了8%的比特币消费税。就在法案生效的几天后，日本商业巨头Recruit Lifestyle宣布其购物APP已经正式准备好支持比特币，兑现了今年四月做出的“让超过260,000家零售店接受比特币支付”的承诺。\n　　2017年8月，日本最大C2C票务平Ticket Camp与Coincheck达成合作，宣布开始 接受比特币支付。\n　　2017年8月，日本大型连锁百货商场marui和比特币交易所Bitflyer达成合作，宣布开始接受比特币支付。\n\n　　韩国\n　　2016年9月韩国两天应用KaKao Talk看好比特币的发展，并且支持用户在聊天应用中使用比特币进行转账，谁又能说这不是一个比特币的时代。\n\n　　美国\n　　2012年11月，全球互联网最流行的博客系统wordpress宣布接受比特币支付。\n　　2013年2月，全球知名的社交新闻网站reddit宣布称其网站的gold服务通过coinbase接受了比特币支付。\n　　2014年1月，美国游戏巨头Zynga宣布与BitPay合作，多款游戏开始接受比特币支付。\n　　2014年1月，美国零售巨头overstock开始接受比特币支付，这是全球最早接受比特币支付的大型零售商。\n　　2014年5月，美国卫星电视Dish Networks开始支持比特币支付。\n　　2014年6月，美国大型珠宝连锁店瑞兹（REEDS）开始接受比特币支付。\n　　2014年7月，全球计算机巨头戴尔公司与比特币交易平台及支付公司coinbase达成合作，开始接受比特币支付。\n　　2014年7月，美国著名的新一代专业电子商务网站新蛋网正式接受比特币支付。\n　　2014年12月，全球IT巨头微软公司宣布开始接受比特币支付，美国所有的windows10用户可以使用比特币来支付应用程序、游戏等。\n　　2015年3月，日本最大的线上零售平台乐天商场美国站宣布与比特币支付服务公司bitnet达成合作，将接受比特币支付。\n　　2015年8月，美国领先的租车服务公司bandago宣布开始接受比特币支付。\n　　2015年8月，美国顶尖的电子产品在线零售商tigerdirect宣布开始接受比特币支付。\n　　2015年10月，游戏巨头G2A与BitPay建立合作关系，将在其G2A.COM市场接受比特币支付。\n　　2016年1月，支付巨头Ingenico公司与比特币支付公司BitPay达成合作，允许全球范围内的实体店通过他们的pos终端接受比特币支付。\n　　2016年3月，美国著名贵金属销售商JM Bullion与比特币支付服务公司达成合作，开始接受比特币支付。\n　　2016年4月，全球你最大的综合性数字发行平台steam开始接受比特币支付。\n　　2016年9月，美国第一家期货考评员公司允许通过比特币进行股票和贵金属交易。\n　　2017年5月，美国停车服务提供商Top Airport Parking宣布开始接受比特币和其他25种加密货币来支付在丹佛国际机场的停车服务费，该公司的母公司还计划年底再30个美国机场提供加密货币支付服务。\n\n　　法国\n　　2016年8月，法国一家国际汽车旅馆公司Isilines接受比特币支付\n　　2016年8月，法国第三大公交公司Isilines与法国比特币创业公司Paymium达成合作，开始接受比特币支付。\n　　2016年11月，法国巴黎Passage du Grand Cerf成为法国第一个接受比特币支付的购物市场，其中20家门店将开始接受比特币支付。\n\n　　波兰\n　　2015年3月，波兰最大的移动运营商之一T-Mobile与支付处理商InPay合作，开始接受比特币作为话费充值的支付方式。\n　　2017年6月，荷兰最大食品配送网站Pyszne.pl宣布开始接受比特币支付，其拥有5062家合作餐厅和883000位活跃消费者。\n\n　　拉斯维加斯\n　　2016年3月拉斯维加斯Derek Stevens’ Golden Gate 酒店赌场和 D Las Vegas 赌场酒店等等越来 越多的商店都支持比特币支付。\n\n　　非洲\n　　2016年3月，非洲最大电商平台Bidorbuy增加比特币支付选项。\n　　2017年9月，南非大型连锁超市Pick n Pay接受比特币支付。\n\n　　欧洲\n　　2016年2月份欧洲高端奢侈品经销商Ace接受使用比特币购买高端珠宝和手表。\n\n　　菲律宾\n　　2017年8月，菲律宾电商平台Pinoy Travel和Metrodeal比特币汇款应用Coins.ph接受比特币支付。目前，在菲律宾、比特币已可以用来支付学费、进行国内汇款、支付网络、租赁费、水电费、信用卡账单等各种费用。\n\n　　墨西哥\n　　2015年10月墨西哥电子商务零售商Famsayunxu 使用比特币在线购物。\n\n　　马来西亚\n　　2016年6月，马来西亚主要的在线手机和电子零件零售商i-Pmart宣布开始接受比特币作为付款方式。\n\n　　委内瑞拉\n　　2016年12月，由于委内瑞拉持续的通货膨胀问题，国际旅行机构Destinia宣布将比特币列为委内瑞拉航班的优先支付选项。\n\n　　格鲁吉亚\n　　2015年10月，格鲁吉亚领先的电子支付提供商UniPAY与比特币支付服务公司Snapcard达成合作，此次合作可让UniPAY平台的55000名活跃用户使用比特币等加密数字货币支付。\n\n　　特内里费岛\n　　特内里费岛，西班牙人口最多的岛屿，这里距离非洲海岸有300公里的路程。该岛因五星级酒店以及豪华的生活方式而出名，目前岛上已经有了超过12家比特币商家，其中包括发廊，公寓，服装店以及酒店。\n\n　　西撒哈拉\n　　Dakhla Lagoon，位于西撒哈拉海岸的一个美丽的旅游景点，游客可以在这里冲浪、游泳、观看海豚。游客可以通过网上订购平台Adormo使用比特币进行预订。\n\n　　哈萨克斯坦\n　　哈萨克斯坦是世界上最大的内陆国家，出奇的是，在该国最大的城市阿拉木图，有不少商人接受比特币。除了律师事务所和出租店，哈萨克斯坦的主要电子产品零售商Satam也接受了比特币。\n\n　　荷兰\n　　2014年1月，荷兰能源公司Bas Nederland开始接受比特币支付，包括水电燃气费等，成为全球第一个接受比特币的能源公司。\n　　2015年8月，全球历史最悠久的航空公司之一LOT波兰航空开始接受比特币支付，覆盖该航空公司超过60个全球目的地航班的机票。\n　　2016年2月，荷兰的阿纳姆市迎来了第100家接受比特币支付的商家，阿纳姆拥有众多比特币商家且比特币在当地已成为一种主流的支付方式，被比特币爱好者们称之为比特币之城。\n\n　　苏丹\n　　苏丹是非洲第三大国，截至目前，该国仅有一家比特币商家，其名为Visa4Sudan。这家商家不仅为顾客提供Visa卡和万事达卡的开卡服务，还充当了当地的比特币交易所。\n\n　　巴基斯坦\n　　巴基斯坦伊斯兰共和国，拥有超过1.8亿人口的国家，该国拥有三家比特币商家。它们分别是Ishraqi（服装店），D.I.T Planet （一家信息技术公司），以及巴基斯坦最大都市卡拉奇当地的一家技术研究中心。\n\n　　西伯利亚\n　　位于西伯利亚诺地区里尔斯克城的一家汽车修理店“Voltage”接受了比特币支付。俄罗斯广阔的地域上接受比特币的商家寥寥无几，而“Voltage”是这里方圆数千里范围内，你能找到的唯一一家可以花费比特币的地方。\n\n　　伊朗\n　　伊朗是世界第18大人口大国，这里拥有超过7800万的居民，然而这么一个人口大国，仅有一家比特币商家。波斯鞋（Persian Shoes），这是一家位于伊斯法罕的手工鞋制造商，该公司已经在制鞋行业拥有超过70年的历史，除了比特币，他们暂不接受其它形式的支付方式。\n\n　　芬兰\n　　2017年10月芬兰一家名为Nordic Law的律所宣布允许客户使用比特币付款，Nordic Law是位于芬兰赫尔辛基的一家律所，专门处理商业和税务法问题。希望能够更好地满足客户需求，同时适应新的业务环境。\n\n　　瓦努阿图\n　　2017年10月，一个由80个热带岛屿组成的南太平洋群岛国家，正式宣布该国投资移民项目将允许外国人通过支付20万美元来获得其公民身份，或者等价的比特币来支付。",
			"added": 1614831333
		},
		{
			"topic_id": 1615387439,
			"title": "摩根大通涉足加密数字货币业务，将发行比特币相关产品。",
			"body": "据cointelegraph报道，在摩根大通递交给美国证监会（SEC）的文件中表示，该公司将发行一款与加密货币相关的结构性票据。\n\n　　摩根大通表示，该产品不会直接投资比特币，而是投资相关公司。其中，20%的资金将投资于Microstrategy，投资Square的资金约为18%。剩下的资金将投资于包括Riot Blockchain 、英伟达、PayPal和AMD等公司。\n\n　　报道称，摩根大通推出的新产品代表了机构投资者可以进入高歌猛进的加密货币市场的众多方式之一。此前华尔街已经在关注数字货币，这在很大程度上解释了比特币背后强大的价格支撑。根据TradingView的数据，这种旗舰数字货币周二的交易价格高达54888美元。\n\n　　另外，此前美图公司也发布公告称，该公司已于2021年3月5日在公开市场交易中购买了15000单位的以太币和379.1214267单位的比特币，这两种加密货币的总对价分别约为2210万美元和1790万美元。\n\n　　美图公司董事会认为，加密货币具有足够的升值空间，并且在此时通过将其部分现金储备金分配到加密货币，可以用作资金管理中分散持有现金的风险。",
			"added": 1615387408
		},
		{
			"topic_id": 1615387736,
			"title": "“黄金将会消亡”？亿万富翁们纷纷押注比特币",
			"body": "来源：金十数据\n\n　　美东时间3月2日，美国证券交易委员会（SEC）主席的提名人加里詹斯勒（Gary Gensler）在参议院银行委员会听证会上，发表了对比特币的一系列看法，导致比特币短线一度下跌至43000美元附近。\n\n　　詹斯勒被称为“美国20年来最激进的监管者”，他曾有过铁腕整治金融业的从政经历。自从詹斯勒被提名为SEC主席人选，比特币支持者担心对比特币的监管会加严，因此詹斯勒的表态广受市场关注。\n\n　　但是金融博客零对冲发现，虽然詹斯勒在听证会上对一些细节避而不谈，其实他比许多人预期的还要支持比特币。詹斯勒的原话是：“比特币和其他加密货币为金融规划和投资者包容度带来了新的思路。我将与其他委员会合作，促进新的创新方式，但核心是确保投资者受到保护，就像证券受到证券交易委员会的监管一样。”这让加密货币投资者松了一口气，随着市场担忧情绪逐步消散，比特币3月3日重新回升至52000美元以上，以太坊也重回1600美元以上。\n\n　　01 风险投资家提姆·德雷珀支持比特币\n\n　　随后，亿万富翁、风险投资家、人称“比特币超豪放派”的提姆·德雷珀（Tim Draper）也在社交媒体上进一步提升了比特币的知名度。据CoinTelegraph报道，德雷珀在众多大公司中选择了买入Netflix，因为认为它是最有可能将比特币纳入资产负债表的公司。\n\n　　德雷珀还认为亚马逊在未来会增加比特币支付选项。他指出，多年来，消费者一直在使用加密货币间接购买产品。因此他表示：“亚马逊可能很快就会开始接受比特币。”\n\n　　德雷珀还认为加密货币将成为首选货币，其价格将飙升。当初比特币的价格还不到4000美元时，德雷珀就认为比特币的价格在2022年或2023年初将达到25万美元。他还说：“比特币并不会完全取代美元。不过我认为，在未来如果你用美元买东西时，人们会取笑你。”\n\n　　这与花旗的说法不谋而合。周一，全球最大的投资银行之一花旗发表报告称，比特币正处于一个“临界点”，有一天可能“成为国际贸易的首选货币”。\n\n　　同样唱多加密货币的大投行还有高盛。据知情人士透露，在比特币价值飙升之际，高盛集团将重启加密货币交易平台。据悉，高盛已经重启了其加密货币交易部门，将从下周开始为客户交易比特币期货和无本金交割远期合约（NDF）等交易服务。\n\n　　02 亿万富翁马克·丘班表示比特币将取代黄金\n\n　　此外，亿万富翁马克·丘班（Mark Cuban）在社交媒体上发表长文警告，黄金作为一种价值储存手段“将会消亡”。\n\n　　马克·丘班表示，比特币和以太坊可以让投资者变成银行家，因为它允许无摩擦的价值交换，并可沿用到商业和个人。马克·丘班还对黄金的未来做出了预测：“我们今天看到的加密技术只是概念验证。随着技术不断发展，即变得更好、更便宜、更快，将会有新的应用程序，甚至更新换代，取代今天的加密技术。但黄金永远不会有所改变，这就是为什么黄金作为价值储存手段会消亡的原因。”\n\n　　知情人士透露，马克·丘班将把投资组合中3%的资金配置在比特币上，并考虑投资可持续的加密货币挖矿业。\n\n　　03 谷歌暗增”加密货币“选项\n\n　　就连多年来对加密货币又爱又恨的谷歌也转变了风向。据coinvore报道，谷歌财经本周在其页面中悄悄增添了一个“加密货币”选项。\n\n　　金融零对冲认为，这是谷歌对加密货币相当微妙的“投降”方式。\n\n　　就在两年前，谷歌负责产品管理、广告隐私和安全的副总裁斯科特·斯潘塞（Scott Spencer）公开表示，禁止任何与加密货币相关内容的广告，把加密货币与广告欺诈、恶意软件和内容骗局混为一谈，此举震惊了市场。\n\n　　不过，随着越来越多知名机构和投资者对加密货币表示支持，谷歌现在似乎正逐渐认可加密货币。最后，零对冲根据比特币的库存流量比模型，预测比特币在年底将达到10万美元，到2025年底将达到100万美元。\n\n　　零对冲表示，似乎又有一场持有比特币的热潮。因为根据Decrypt报告显示，流通中的比特币总量进一步下降，这表明持有比特币用户正在增加，往往也意味着投资者正在将其持有的比特币用于长期投资，而不是寻求短期收益。\n\n　　量子经济比特币分析师JasonDeane称：“数据清楚地显示，比特币的需求很高而且投资者的信心很足，这意味者短期内投资者不会卖出他们新获得的比特币。”",
			"added": 1615387704
		},
		{
			"topic_id": 1616039832,
			"title": "一行字新闻：摩根斯坦利成首家为客户提供比特币基金的美国大行",
			"body": "摩根士丹利成为首家为其富有客户提供比特币基金渠道的美国大型银行，该行将推出三只基金，让投资者能够持有比特币。\n\n来源网易，内容只有一行字：https://www.163.com/dy/article/G5B16B2I05198NMR.html，而且原始出处华尔街见闻已经删帖，但未见任何辟谣声明，也未见相关机构否认上述信息。",
			"added": 1616039799
		},
		{
			"topic_id": 1616138585,
			"title": "鲍威尔表示中央银行数字货币将必须与现金共存",
			"body": "来源：国际衍生品智库\n\n　　美联储主席鲍威尔表示，潜在的央行数字货币将需要整合到现有支付体系中，与现金和其他形式的货币共存。鲍威尔周四在瑞士巴塞尔举行的一次支付会议上发表预先录制的视频讲话称，“国际清算银行（BIS）和包括美联储在内七家央行的最新报告，评估了央行数字货币帮助央行实现其公共政策目标的可行性。”鲍威尔说：“与今天的话题有关，报告中强调的三个关键原则之一是，央行数字货币必须与现金和其他类型货币在一个灵活创新的支付系统中共存。新冠危机使人们更加关注需要解决我们当前跨境支付安排的局限性。“",
			"added": 1616138551
		},
		{
			"topic_id": 1616162180,
			"title": "这年头还有抢着奔数字货币鄙视链最底端去的，而且居然还是混金融圈的，美国银行：没有理由支持比特币",
			"body": "新浪财经发布时间：03-1918:55新浪财经官方账号,优质创作者\n　　来源：汇通网\n\n　　美国银行表示：“持有比特币的唯一原因是价格的上涨，而只有当大公司大量购买比特币时，比特币价格才会上涨。因为虽然加密货币的供应和排放率是固定的，但对它的需求可能会波动，在市场上造成巨大的涟漪。比特币还变得与风险资产相关，它与通胀无关，而且仍然非常不稳定，这使得它不适合作为财富储存或支付机制。”\n\n　　比特币涨势纯粹来自资金流入\n\n　　事实上，在过去的几个月里，像特斯拉、Square、MicroStrategy、Grayscale等大型机构公司一直在购买价值数十亿美元的比特币。美国银行称：这些购买行为成为比特币价格持续上涨的主要推动力。该行补充道：“因此，持有比特币的主要投资组合理由不是多样化、稳定回报或通胀保护，而是纯粹的价格升值，这取决于比特币的需求是否超过供应。”\n\n　　该行分析师还声称，约9300万美元的净流入足以推动比特币价格上涨1%。相比之下，需要18.6亿美元才能带动黄金价格。\n\n　　比特币交易导致大量碳排放\n\n　　美国银行认为：除了价格波动，比特币对生态系统的影响也极其有害。该行指出：对比特币交易进行核实所产生的二氧化碳排放量约60吨，相当于整个希腊的排放量。每10亿美元的比特币流入，会带来相当于120万辆冰车的二氧化碳排放量。如果价格涨到100万美元，比特币可能会超越日本，占据世界第五大碳排放国的地位。”该分析师补充称：比特币复杂的基础设施和对环境的巨大影响也导致交易速度缓慢。区块链每小时只能验证14000笔交易，而Visa每小时可以处理超过2.36亿笔交易。\n\n　　最后，美国银行表示：“比特币是一种高度集中的资产，目前95%的比特币仅由2.4%的比特币地址持有。在我们看来，如此小比例的比特币账户持有大部分流通的比特币，这使得这种工具不适合作为支付机制，甚至不适合作为投资工具。它还会造成社会和治理问题。”\n\n　　伦敦经济学院（London School of Economics）Jon Danielsson最近也表示：比特币和法定货币不能共存，比特币作为货币的概念没有意义。",
			"added": 1616162145
		},
		{
			"topic_id": 1616474080,
			"title": "数字货币鄙视链卡位续篇，鲍威尔：加密资产更像黄金而不是美元，更多是用于投机",
			"body": "鲍威尔：加密资产更像黄金而不是美元，更多是用于投机\n金融界发布时间：03-2306:00万象大会年度获奖创作者,北京富华创新科技发展有限责任公司官方帐号\n来源：智通财经网\n\n智通财经APP获悉，周一，美联储主席鲍威尔表示，加密资产具有很大的波动性和投机性，全球加密资产的监管尚不到位。他认为，加密资产更像黄金而不是美元，更多的是用于投机，而不是作为支付手段。\n\n鲍威尔强调，央行数字货币的工作并不是由比特币等其他发展中的私营部门货币推动的，央行并不急于推出数字货币。\n\n在过去几年里，美联储一直在研究自己的数字支付系统，以促进更快的资金转移，最终产品的亮相可能会在未来两年内发生。与此同时，美联储还对央行数字币是否有必要或是否实用进行了其他探究。\n\n鲍威尔表示，美联储在决定做任何事情之前都会深思熟虑。“为了推进这项工作，我们需要国会、政府、广大公众的认同，我们还没有真正开始这项公众参与的工作，市场可以期待我们在开发央行数字货币的问题上会非常谨慎和透明地行动。”\n\n波士顿联储去年与麻省理工学院就开发央行数字货币的多年研究达成合作，这项工作预计需要两到三年的时间。鲍威尔表示，在美联储着手发行数字货币之前，国会可能必须通过某种类型的授权立法。\n\n鲍威尔还指出，新冠肺炎的大流行强调了开发更好的支付系统的重要性，以便资金能够快速到达需要的人手中。",
			"added": 1616474044
		},
		{
			"topic_id": 1616475728,
			"title": "美元的支柱已经在崩塌，以为靠改头换面搞一个数字美元就能摆脱困境？",
			"body": "美元的支柱已经在崩塌，不是一两个支柱在崩塌，甚至不仅仅是军事，工业，高科技，民生，所谓民主体制这些支柱都在崩塌，而是所有的一切，能想到的几乎所有甚至包括好莱坞电影内的一切，都在崩塌。\n因此这种情况下首当其冲的是给美元找到新的支撑点，和新的支柱，否则想靠美元改头换面，搞个数字美元来渡过难关是一厢情愿，甚至是可笑的，而且留给美国的时间和各种政策空间并不很多。\n与此同时，最无需强调的显然是美元的重要性，美元是否是美国的一切这或许倒不是特别重要，重要的是美元是某些人某些家族的一切，一旦美元崩塌，一切都会灰飞烟灭。所以，不要抱任何不切实际的幻想....",
			"added": 1616475691
		},
		{
			"topic_id": 1616650623,
			"title": "米帝脱困的正确只有数字货币和数字经济，其他路子，包括以所谓人权为由借新疆棉花搞事，都是找死..",
			"body": "米帝想解脱困局正确的方向只有以数字货币为代表的数字经济，其他的路都走不通，如果强行走就是找死。\n　　当初日本也曾对米帝构成优势，半导体业甚至把intel都打趴下，第一台笔记本电脑也是东芝，软盘也是日本最新发明，但最终是米帝凭借在数字电子技术和互联网技术方面的不断创新的能力，最终压倒性优势，由此将日本彻底击败，再加上中韩崛起的夹击，从而使得日本全线崩坏的。\n　　目前中国在数字货币领域的政策如我之前多次指出的那样，有种种问题，由此使得中国本来在该领域全球领先的态势，出现了严重滞后，而且由于前期步子太大定调太高，现在已经很难转身。从而出现了大的空档，米帝如果想摆脱困境，这是唯一的脱困方向，其他的挣扎，包括此次以所谓人权为由拿新疆棉花找事，其实都只是找死，只会让那些原本在中国占据大量市场的洋品牌，特别是高端洋品牌迅速衰败，甚至团灭！这种败着再来几次，手里就真没什么筹码了。\n　　必须指出的是，中国毕竟和日本天壤之别，虽然可以藉由数字货币和数字经济摆脱困境，但指望单纯通过数字货币和数字经济彻底击败中国是不可能的，而且即使摆脱困境必要的成本依然是需要付出的，包括外部战线的必要收缩，内部的某种妥协，特别是对数字经济的某种优先和让利等等等等。\n　　对中国而言，这些年我不断在多个论坛给出大量的深入分析，和诸多政策建议，包括对数字人民币，对比特币更是从很多年前就如祥林嫂一般喋喋不休地建议有关早作准备，包括建立必要的比特币储备等等，如果有关部门稍微用点心整理一下，就能知道该怎么办。\n　　我个人对明史相当有偏好，也正是因此，对大国夕阳总是心存某些不忍，再加上数字货币确确实实是人类有史以来最伟大的发明，具备将人类诞生以来一直困扰人类的，先贤们一直绞尽脑汁想要解决，但却从无效果的某些重大问题从根本上解决的潜力，因此总是不由自主地想给各方都出些建议，总是希望大家都朝着顺应历史潮流的方向发展，但似乎总是明珠投暗....",
			"added": 1616650585
		},
		{
			"topic_id": 1616686473,
			"title": "特斯拉正式接受在美国的顾客以比特币作为支付方式",
			"body": "紧接上个月的行动，特斯拉正式接受在美国的顾客以比特币作为支付方式。据 Musk 在 Twitter 的补充，他们在结算入帐时也会以比特币进行，不会兑换为法定货币，而且还透露了是使用他们内部的一个开源工具来处理接收到的比特币。\n　　据特斯拉的支援页面所指，顾客只需要透过比特币钱包扫描 QR 码或是使用位址的方式进行支付，要注意的是特斯拉希望顾客以确实比特币金额来交易，否则就会取消订单。目前特斯拉只接受美国地区的订单，以及以比特币交易，其他地区和其他加密货币就仍未支持，不过 Musk 有透露将会扩展至其他地区的。\n　　特斯拉上月宣布以「分散和最大化」投资为由，购入价值 15 亿美元的比特币，同时就宣布接受以比特币进行交易。是说，比特币对于传统投资人来说是个高风险资产，因此特斯拉也主动交出投资方向的警告，包括会受加密货币独有的「恶意攻击」和「技术障碍」等风险。至于特斯拉在购买比特币时的作价也是没有公开，就时间点来看大概是在三万至三万五千美元水平，而今天就已经升值至五万多美元了（2021 年 3 月 25 日）。",
			"added": 1616686434
		},
		{
			"topic_id": 1616736271,
			"title": "H&M的事情已经有人在有组织地带节奏了，意图很明显就是希望将损失限定在1-2个品牌。",
			"body": "反应还挺快，估计是派了专人盯着隐月。\n　　现在已经有人在带节奏了，而且是非常明确的有组织带节奏，同时在多个论坛展开，意图很明显，就是希望将损失尽量限定在有限的1-2个洋品牌，而且理由很漂亮，集中兵力打歼灭战，呵呵呵呵，显然这些人素质水平实在太差，并不胜任。他们根本不什么叫军事，更不懂什么叫战役。\n　　毛主席说的集中兵力打歼灭战是在什么情况下，那是在当年面对远比我们更强大的蒋介石，日寇，以及米帝国主义，联合国军等的特定情况下的战役战术指导思想。因为敌强我弱，而且是实力相差极为悬殊，在这种情况下才不得不集中自己的力量，以便实现在某个特定的时间和空间条件下的，强弱逆转，从而在这个局部以更大力量彻底击败对手，由此削弱对手，并进一步促使强弱发生整体转换。生搬硬套毛主席的战术战役思想，除了证明这些人是傻逼之外，没有任何其他作用，似乎这些人还长期混迹军事论坛，尤其其中想当一部分骨干应该还与海外军事机构有密切关系，并有很深的军事背景，我真不知道这些人这些年是怎么混的。\n　　实际上目前的中国在工业领域乃至商业领域（尤其电商和支付领域）已经初步具备了全球领先的态势，在这种情况下，哪里还需要集中力量去搞一个H&M？？当然是借此良机，彻底达成全面的战役战略优势。\n　　在这里，我非常善意地给这些傻货，尤其是那些混鼎盛和超大的，鼎傻超傻的傻逼们普及一下大纵深理论：寻找对方薄弱环节，捕捉战机，求得一点突破，随后必全力涌入，不管不顾十万里奔袭直插其纵深，全面席卷其后方一切，彻底摧毁敌方一切可能的力量.....\n　　最后，真诚地提醒一下这些傻货的主子，如此重要且关键的时刻，让傻逼去做如此重要的事情，最后当然只能得到傻逼的结果！",
			"added": 1616736231
		},
		{
			"topic_id": 1617105823,
			"title": "Visa宣布支持用虚拟货币稳定币支付结算",
			"body": "　　虽然不少人对于加密货币一直持有怀疑态度，但实际情况却是包括比特币在内的加密货币越来越吃香。据外媒报道，全球支付巨头Visa在周一表示，将允许使用加密货币稳定币（USDC）在其支付平台上进行支付结算交易，而这意味着数字货币已经得到了主流金融行业的认可。\n\n　　Visa国际组织表示，已经与支付和加密平台Crypto.com合作并推出了试点项目，计划在今年晚些时候向更多合作伙伴提供该服务。\n\n　　Visa加密主管Cuy Sheffield表示，世界各地的消费者对能够访问、持有和使用数字货币的需求越来越大，而我们的客户也同样有这种需求。而稳定币（USDC）是一种稳定的加密货币，其价值直接与美元挂钩。Visa此举正值包括美国纽约银行梅隆公司、贝莱德和万事达卡在内的主要金融公司纷纷采用一些数字货币之际，而这也引发了人们对加密货币将成为投资组合中重要组成部分的预测。\n\n　　上周，特斯拉美国官网显示，购买特斯拉汽车已支持使用比特币来付款。同时，特斯拉创始人埃隆·马斯克也在推特上宣布：“你现在可以使用比特币购买特斯拉。”这也进一步巩固了比特币在金融领域的地位。\n\n　　据了解，Visa国际组织(VISAInternational)是一个联盟组织，是世界上最大的信用卡和旅行支票组织，其前身是1900年成立的美洲银行信用卡公司。1974年，美洲银行信用卡公司与西方国家的一些商业银行合作，成立了国际信用卡服务公司，并于1977年正式改为Visa国际组织，成为全球性的信用卡联合组织。\n\n　　Visa拥有全球最具规模的电子支付网络，将持卡人、商户，并将数万家互相竞争的Visa会员金融机构紧密联系在一起，为财务产品和专业服务开拓全新领域，提供了多元化选择、方便快捷的服务，以及妥善理财的能力。（快科技）",
			"added": 1617105782
		},
		{
			"topic_id": 1617286773,
			"title": "中本聪是谁....",
			"body": "比特币从免费赠送都无人愿意要到暴涨数十万倍，这不得不说是个传奇，而相较于比特币而言，它的创始人中本聪更加传奇，因为至今为止，中本聪是谁，这依旧是一个谜题。\n\n　　2011年比特币走向正轨之后，比特币在一封电子邮件中写道：“我已转移到其他事物上去了”，从此以后就没了中本聪的消息，他从网络上彻底销声匿迹。\n\n　　中本聪是一个资深密码学极客，他发布过的任何信息，甚至和任何人的交流都经过了加密处理，也从来未曾透露过自己的个人信息。\n\n　　在论坛上，他留下的生日是1975年4月5日，但这应该不大可能是他的真实生日，不过4月5日这一天在历史上也是有深意的，因为在1933年的4月5日，美国总统罗斯福颁布法令，规定所有美国公民持有黄金是非法的。这或许是中本聪对政治的一次隐喻，也表明他想创造一种不受政府管控的货币的决心。\n\n　　中本聪在消失之后，引起了大量网友和黑客的好奇，因为他本人的账户拥有上百万枚比特币，早在2014年，这些币的价值就已经超过了十亿美元，如果按现在６万美元的价格计算，那么中本聪的比特币资产将高达６百亿美元。然而至今仍没有人知道中本聪是谁，也很可能是一个团队，因为2008年时，他创造的区块链算法实在太精密，不像是一个人能够完成的。\n\n　　从名字上来看，中本聪这是一个日本人，那么中本聪到底是哪国人？他曾在论坛上自称自己是一名日本43岁的男性，他2008年公布比特币时，是通过自己注册的网站公布的，而这个比特币官网注册时使用的服务器，的确是在日本，不过中本聪的英语实在太流畅，而且他从来没有使用过日文。\n\n　　所以很多人怀疑，这个日本名可能只是烟雾弹，他很可能是英国或者是美国人。这么多年来，网友一直没有放弃过寻找中本聪，早在2013年，就有人爆料称，在数学领域有着突出贡献的望月新一就是中本聪，不过这很快就被证实是假消息，因为望月新一只是精通数学，对编程或者密码学完全不懂。\n\n　　之后也陆陆续续出现过很多消息称找到了中本聪，可无疑都是假的，完全经不起推敲，也拿不出有力的证据。不过在2014年，却有一个人跳出来称自己就是中本聪，并给出了一些证据，他就是克雷格赖特。\n\n　　可在广大网友的追问下，克雷格并不能自圆其说，他的证据无法证明他的身份，所以最终克雷格只好撤回了自己的言论，不过也因此收获了“澳洲中本聪”这一外号。\n　　如今比特币价格在六万美元左右，而直到今天，中本聪也没有出来发言过，或许对他来说，比特币能发展成现在这样，已经是最大的惊喜了，他如果出现，势必会引起不必要的麻烦和纠纷，还是静静地做一个富豪好了。",
			"added": 1617286731
		},
		{
			"topic_id": 1617543572,
			"title": "数字货币的突破方向...",
			"body": "　　数字货币从比特币一路走来，发展到defi，看着红红火火，不断发展，但实际上都还是在货币金融圈里闹腾，刻薄一点都是自己玩儿自己，这样是不会有大的出路的。\n　　因此，defi只是小赛场，里边几条小赛道，数字货币发展到今天，必须往货币金融体系之外发展，这样才能真正影响世界，否则只是在金融之上玩儿金融，自己玩儿自己是没有出路的。\n　　其实业界虽然没有明说，但实际上一直在寻求突破，寻求数字货币走出货币金融小圈子，走向整个世界的途径，NFT就是业界目前一度认为的方向，许多人雄心勃勃甚至不惜血本，在这个风口聚集了极大量的资金和团队，但不得不说这个方向肯定是错的。由于种种问题，这个方向并不能真正实现突破，相反倒是和可能搞出新版的荷兰郁金香，甚至一地鸡毛..........\n　　接下来，如果所料不错整个业界将需要一段时间来反思，调整，最终NFT将会逐步冷却，资金和团队将会堆积到一个新的真正的突破方向上，一个全新的阶段应该会开始......",
			"added": 1617543529
		},
		{
			"topic_id": 1617545178,
			"title": "桥水基金：美股泡沫已达1929大萧条一半水平，美联储成最大驱动力",
			"body": "来源: 网易：https://www.163.com/dy/article/G68G6CMG0519D4UH.html\n\n　　全球最大对冲基金桥水创始人达利欧近日接受采访时警告称，当前美股的泡沫规模已经达到了引发2000年互联网泡沫破裂和1929年“大萧条”等历史性市场崩盘的一半水平。\n　　他警告说，一些表现出色的股票受益于专注于价格的投机性交易，他将近期的市场波动归因于投资者转向“肉制品和土豆”类股，这些公司不像一些科技公司那样从疫情交易中受益。\n　　他解释称，支撑美股当前估值的重要因素，是高流动性和低利率环境，而投资者的行为也是目前美股泡沫形成的原因之一。投资者看重过往绩效的倾向，正导致市场过度扩张，尤其是在科技股领域，而美股已接近过去某些历史性泡沫的一半水平，投资者应该当心未来美股的低回报。\n　　达利欧还说，很多新东西的到来带来了变革，但投资者倾向于根据过去来做出推断，却不太关注价格，当这种情况发生时，就开始出现某种程度上的泡沫。\n\n　　达利欧说：“根据我们的衡量标准，泡沫还没有达到2000年和1929年的水平了，但似乎现在已经在半路上了。”。因此从价值的角度来看，可以预见的是相对于其他资产，股市回报会缩水。在被问及何种因素恐会导致泡沫最终破裂时，达利欧表示，美联储的政策是需要关注的最大驱动力，随着低利率环境持续下去，美联储官员们正面临难题。一方面是可以上调利率，但这可能导致股市暴跌，并对经济增长造成阻碍；另一方面是当局可以通过购买政府债券来维持低利率，但这将导致进一步的通胀。",
			"added": 1617545134
		},
		{
			"topic_id": 1617985305,
			"title": "亿万富翁投资者Mike Novogratz表示，比特币被接受的速度是令人惊讶的，",
			"body": "　　亿万富翁投资者Mike Novogratz表示，比特币被接受的速度是令人惊讶的，预计其总市值将比肩黄金，甚至可能超过黄金。\n\n　　近期黄金市场继续震荡不前，而比特币价格的持续走高被认为是黄金承压的原因之一。亿万富翁投资者Mike Novogratz表示，比特币被接受的速度是令人惊讶的，预计其总市值将比肩黄金，甚至可能超过黄金。\n\n　　“比特币被接受的速度超出预期。”去年至今比特币价格大涨，诸多机构也纷纷入场，比特币价格一度突破6万美元大关。\n\n　　Novogratz认为，整个比特币市场的市值超过黄金市场将只是时间问题。“年初的时候我认为比特币价格6万美元就是目标，那么其市值就是黄金市场的10%左右，但一旦达到10%，就会看向20%，之后就是50%，甚至100%。”目前整个比特币市场的市值约1.1万亿美元，黄金市场的市值则在10.9万亿美元左右。Novogratz认为，更多机构会入场比特币。“越多投资者入场，尤其是大机构入场，那么要拒绝比特币就会变得越难。”\n\n　　去年以来，越来越多机构进入比特币市场。比如美国股票交易平台Robinhood表示，今年一季度有950万用户在该平台上使用数字货币进行交易，环比前一季度的170万增长极为明显。\n　　（文章来源：黄金头条）",
			"added": 1617985260
		},
		{
			"topic_id": 1617985862,
			"title": "根据CFRA Research的分析师的说法，VanEck，Fidelity Investments和Valkyrie Digital Assets可能在长达两年的时间内都不会看到美国监管机构批准的比特币ETF。",
			"body": "根据CFRA Research的分析师的说法，VanEck，Fidelity Investments和Valkyrie Digital Assets可能在长达两年的时间内都不会看到其#比特币#交易所交易基金（ETF）或美国监管机构批准的ETF。\n　　比特币\n　　CFRA ETF和共同基金研究负责人Todd Rosenbluth在CNBC ETF Edge周一的采访中告诉主持人Bob Pisani，他相信美国证券交易委员会（SEC）将延长考虑比特币ETF首次提出的时间表。由投资管理公司VanEck在1月发布。SEC于3月15日正式承认收到了比特币ETF申请，使监管机构可以在4月29日之前做出决定或延长截止日期。\n\n　　罗森布鲁斯说：“我们已经有一些公司已经通过了备案程序，或者已经提交了文件，但正在等待进一步的澄清。”“美国证券交易委员会不太可能尝试选择赢家，至于谁先出现，我认为我们更有可能看到他们（如果他们确实批准了ETF）批准了多个比特币相关的ETF。”\n\n　　他加了：“我们已经有许多公司进入。我们认为在未来的一两年中可能会看到一个，但对于何时答案是肯定的，我们没有明确的时间表。”\n\n　　VanEck和Valkyrie都于1月份向美国证券交易委员会（SEC）申请了注册，以组建比特币ETF，3月之后是富达（Fidelity）。监管机构没有给出任何决定的迹象，但是鉴于其此前对批准加密ETF的态度似乎沉默寡言，许多专家并不希望很快做出决定。\n\n　　美国可能尚未批准加密ETF，但加拿大公司在北美一直处于领先地位。总部位于多伦多的Purpose Investments在2月推出了比特币ETF，据报道，Ninepoint Partners也计划将其比特币信托产品也改为交易所交易基金。投资基金经理3iQ和Evolve Funds Group都宣布已向加拿大监管机构提交招股说明书，以批准开始交易加密ETF。\n\n　　在上个月提交富达基金文件之后，罗森布鲁斯表示，“这是美国证券交易委员会何时批准比特币ETF的问题，而不是是否批准这一问题。” 他似乎暗示星期一，即使在美国获得批准，也可能为寻求组建加密ETF的公司打开闸门。\n\n　　皮萨尼说：“如果他们批准某人，他们将批准所有人。”，另据报道，高盛准备在2021年发布其第一个比特币和其他加密资产的投资渠道。",
			"added": 1617985816
		},
		{
			"topic_id": 1618063871,
			"title": "西方崛起的最大秘密只有一条：战争和屠杀是利润最大的生意，这个秘密一旦被中国的底层知道，一切就都太晚了...",
			"body": "　　西方崛起的最大秘密只有一条：战争和屠杀是利润最大，效率最高的生意，这个秘密一旦被中国的底层知道，一切就都太晚了。\n　　中华民族毫无疑义是最能打的民族，抗美援朝就不说了，即使在最颓废的晚晴，即使是最后的湘军大佬刘锦棠死后，湘军已经凋零得一塌糊涂的时候，湘军一支偏师仍可在娘子关大败八国联军，以至于百多年后西方仍不得不想方设法将其淡化。\n　　所以，千万不要真的让中国卷入战争，一旦打起来世界会发现国人多可怕，国人也会发现外国有多面，以现在国人的进取精神和商业头脑，战争的价值必将被极大地开发出来，很多新玩儿法会层出不穷，一旦让底层发现，战争比商业来钱快万倍，多万倍，轻松万倍，还有大量用钱无法衡量的好处，是没有人能拦得住他们的。\n　　最底层要过好日子，要过幸福生活，要过与西方人平等甚至人上人的日子，而且要尽快过上，这些是高层根本压不住的，而且目前底层的国人因为普遍被压抑，因此普遍心怀戾气，特别是哪怕最垃圾的白人黑人，在中国也能耀武扬威颐指气使，因此底层国人，身处多座大山的重压之下，尤其是男性底层国人的怒气、怨气、戾气都快爆棚了，所以真到那个时候，整个世界都是要颤抖的，我这可真不是吓唬某些人，千万不要让中国明白上面这个秘密，让他们觉得好战必亡才是正途。而实际上任何大国的崛起都是靠战争，中国也毫不例外，西方的整体崛起和近现代的辉煌更是完完全全靠战争和屠杀（准确地说应该是纯靠屠杀）密切相关，我不知道好战必亡，战争劳民伤财这些其实并不完全正确，甚至完全不正确的观念是怎么进入国人头脑的，但这个真心不重要，重要的是要让他们一直相信下去，让他们永远不知道上面这个秘密....\n　　好吧，话我也只能说到这里了。",
			"added": 1618063824
		},
		{
			"topic_id": 1618817831,
			"title": "鼎盛的一帮蠢驴，也配谈数字货币?",
			"body": "鼎盛的一帮蠢驴，尤其病院的，也配谈数字货币，一张嘴就能把人逗乐了，呵呵呵呵......",
			"added": 1618817783
		},
		{
			"topic_id": 1618818030,
			"title": "重磅！周小川谈比特币：要搞清楚对实体经济的好处是什么！",
			"body": "新浪财经 发布时间: 04-19 00:15\n　　来源：证券时报e公司\n\n　　4月18日中午，以比特币为代表的虚拟货币突然闪崩，一时迅速成为焦点话题。到了晚上，博鳌亚洲论坛上，博鳌亚洲论坛副理事长、中国人民银行前行长周小川以及央行副行长李波均谈到了比特币。\n\n　　周小川谈比特币：要搞清楚对实体经济的好处是什么\n　　4月18日晚间，博鳌亚洲论坛副理事长、中国人民银行前行长周小川表示，中国做数字人民币并不是为了跨境，而是为了借助科技发展，特别是移动互联网普及后，可以更方便地为大众提供支付。“中国有一个14亿人的非常大的零售市场，大家希望有更方便、更有效，成本更低的支付体系。央行在最开始的时候，没想过是不是需要做批发系统，或者是人民币国际化，而是从零售系统开始。”\n　　周小川指出，要尊重各国央行的货币主权，利用数字技术照样可以大幅度提高方便性，而不是采取某一个货币“一统天下”的做法。\n　　周小川谈到比特币时表示，不管数字货币还是数字资产，都要为实体服务。“我们经历过2008年的全球金融危机，发现金融脱离了实体，比如影子银行、衍生品这些纯粹变成了金融机构之间的投机交易，和实体没有联系了，就容易出问题，以至当是一些国际大行的领导、交易员们看不懂，很难做好内部控制。”\n　　周小川表示，要区分数字货币和数字资产，对于比特币这类数字资产，并非现在要下结论，但是”要提醒，要小心“，在中国，金融创新的东西都要说清楚它对实体经济的好处”。\n\n　　央行副行长李波：正研究对比特币、稳定币的监管规则\n　　央行副行长李波4月18日在博鳌亚洲论坛2021年年会数字支付与数字货币分论坛上指出，比特币和稳定币是加密资产。加密资产是投资的选项，它本身不是货币，而是另类投资品。加密资产将来可能发挥的主要作用是作为一种投资工具或是替代性投资。\n　　李波说，很多国家包括中国也正在研究，对这样的一种投资工具，应该匹配怎样的监管环境。李波认为，要确保对这类资产的投机不会造成严重的金融风险。在研究明白需要怎样的监管规则之前，会继续保持现在的举措和做法。\n　　李波认为，将来任何稳定币如果希望成为一个得到广泛使用的支付工具，必须要接受严格监管，就像银行或准银行金融机构一样受到严格监管。\n　　李波还表示，如果稳定币等加密资产能够成为广泛使用的支付解决方案的话，就需要一个更加强有力的监管规则，也就是说，要比比特币现在所接受的监管规则更加严格。\n　　此外，谈及人民币国际化的议题，李波指出，“我们已经多次表示，这是一个自然而然的进程，我们的目的不是取代美元，或者取代其他国际货币，而是让市场作出选择，实现进一步的国际贸易和投资的便利化。”\n　　李波透露，目前人民银行正在考虑扩大数字人民币的试点范围，在更多场景、更多城市进行试点，例如在未来的北京冬奥会试点场景中，数字人民币不仅会对境内用户开放，也会面向国际用户。谈及数字人民币试点进展，李波透露，数字人民币试点很成功，但数字人民币的正式推出尚无时间表。",
			"added": 1618817981
		},
		{
			"topic_id": 1619974743,
			"title": "辛弃疾《美芹十论》",
			"body": "　　辛弃疾（1140－1207）21岁参加抗金义军，不久归南宋，历任湖北、江西、湖南、福建、浙东安抚使等职，一生力主抗金。曾上《美芹十论》与《九议》，条陈战守之。\n　　《美芹十论》中的“芹”指芹菜。《列子· 扬朱》篇载：有人向同乡富豪赞美芹菜好吃，结果富豪吃了反倒嘴肿闹肚子。后人以“献芹”称所献之物菲薄，以示诚意。  说起“美芹”，人们还会想到“黍离”。黍即小米。据史书记载，周室东迁后，周朝志士回到故都，见昔日宗庙夷为田地，黍苗丛生，便悲国家之颠覆，故《诗经》有《黍离》篇。\n \n　　《美芹十论》\n　　总序\n　　臣闻事未至而预图，则处之常有于；事既至而后计，则应之常不足。虏人凭陵中夏，臣子思酬国耻，普天率土，此心未尝一日忘。臣之家世，受廛济南，代膺阃寄荷国厚恩。大父臣赞，以族众拙于脱身，被污虏官，留京师，历宿毫，涉沂海，非其志也。每退食，辄引臣辈登高望远，指画山河，思投衅而起，以纾君父所不共戴天之愤。常令臣两随计利抵燕山，谛观形势，谋未及遂，大父臣赞下世。粤辛巳岁，逆亮南寇，中原之民屯聚蜂起，臣常鸠众二千，逮耿京，为掌书记，与图恢夏，共籍兵二十五万，纳款于朝。不幸变生肘腋，事乃大谬。负抱愚忠，填郁肠肺。官闲心定，窃伏思念：今日之事，朝廷一于持重以为成谋，虏人利于尝试以为得计，故和战之权常出于敌，而我特从而应之。是以燕山之和未几而京城之围急，城下之盟方成而两宫之狩远。秦桧之和反以滋逆亮之狂。彼利则战，倦则和，诡谲狙诈，我实何有。惟是张浚符离之师粗有生气，虽胜不虑败，事非十全，然计其所丧，方诸既和之后，投闲蹂躏，由未若是之酷。而不识兵者，徒见胜不可保之为害，而不悟夫和而不可恃为膏肓之大病，亟遂齚舌以为深戒。臣窃谓恢复自有定谋，非符离小胜负之可惩，而朝廷公卿过虑、不言兵之可惜也。古人言不以小挫而沮吾大计，正以此耳。\n　　恭惟皇帝陛下。聪明神武，灼见事机，虽光武明谋，宪宗果断，所难比拟。一介丑虏尚劳宵旰，此正天下之士献谋效命之秋。臣虽至陋，何能有知，徒以忠愤所激，不能自已。以为今日虏人实有弊之可乘，而朝廷上策惟预备乃为无患。故罄竭精恳，不自忖量，撰成御戎十论，名曰美芹。其三言虏人之弊，其七言朝廷之所当行。先审其势，次察其情，复观其衅，则敌人之虚实吾既详之矣；然后以其七说次第而用之，虏故在吾目中。惟陛下留乙夜之神，臣先物之机，志在必行，无惑群议，庶乎“雪耻酬百王，除凶报千古”之烈无逊于唐太宗。典冠举衣以复韩侯，虽越职之罪难逃；野人美芹而献于君，亦爱主之诚可取。惟陛下赦其狂僭而怜其愚忠，斧质余生实不胜万幸万幸之至。\n\n审势 第一\n　　用兵之道，形与势二。不知而一之，则沮于形、昡于势，而胜不可图，且坐受毙矣。何谓形？小大是也。何谓势？虚实是也。土地之广，财赋之多，士马之众，此形也，非势也。形可举以示威，不可用以必胜。譬如转嵌岩于千仞之山，轰然其声，巍然其形，非不大可畏也；然而堑留木柜，未容于直，遂有能迂回而避御之，至力杀形禁，则人得跨而逾之矣。若夫势则不然，有器必可用，有用必可济。譬如注矢石于高墉之上，操纵自我，不系于人，有轶而过者，抨击中射惟意所向，此实之可虑也。自今论之：虏人虽有嵌岩可畏之形，而无矢石必可用之势，其举以示吾者，特以威而疑我也；未欲用以求胜者，固知其未必能也。彼欲致疑，吾且信之以为可疑；彼未必能，吾且意其或能；是亦未详夫形、势之辨耳。臣请得而条陈之：虏人之地，东薄于海，西控于夏，南抵于淮，北极于蒙，地非不广也；虏人之财，签兵于民而无养兵之费，靳恩于郊而无泛恩之赏，又辅之以岁币之相仍，横敛之不恤，则财非不多也；沙漠之地，马所生焉；射御长技，人皆习焉，则其兵又可谓之众矣。以此之形，时出而震我，亦在所可虑，而臣独以为不足恤者，盖虏人之地虽名为广，其实易攻，惟其无事，兵劫形制，若可纠合，一有惊扰，则忿怒纷争，割据蜂起。辛巳之变，萧鹧巴反于辽，开赵反于密，魏胜反于海，王友直反于魏，耿京反于齐、鲁，亲而葛王反于燕，其余纷纷所在而是，此则已然之明验，是一不足虑也。虏人之财虽名为多，其实难恃，得吾岁币惟金与帛，可以备赏而不可以养士；中原廪窖，可以养士，而不能保其无失。盖虏政庞而官吏横，常赋供亿民粗可支，意外而有需，公实取一而吏七八之，民不堪而叛；叛则财不可得而反丧其资，是二不足虑也。若其为兵，名之曰多，又实难调而易溃。且如中原所签，谓之大汉军者，皆其父祖残于蹂践之余，田宅罄于捶剥之酷，怨忿所积，其心不一；而沙漠所签者越在万里之外，虽其数可以百万计，而道里辽绝，资粮器甲一切取办于民，赋输调发非一岁而不可至。始逆亮南寇之时，皆是诛胁酋长、破灭资产，人乃肯从，未几中道窜归者已不容制，则又三不足虑也。又况虏廷今日用事之人，杂以契丹、中原、江南之士，上下猜防。议论龃龉，非如前日粘军、兀术辈之叶。且骨肉间僭杀成风，如闻伪许王以庶长出守于汴，私收民心，而嫡少尝暴之于其父，此岂能终以无事者哉。我有三不足虑，彼有三无能为，而重之以有腹心之疾，是殆自保之不暇，何以谋人？臣亦闻古之善觇人国者，如良医之切脉，知其受病之处而逆其必殒之期，初不为肥瘠而易其智。官渡之师，袁绍未遽弱也，曹操见之以为终且自毙者，以嫡庶不定而知之也。咸阳之都，会稽之游，秦尚自强也，高祖见之以为当如是矣，项籍见之以为可取而代之者，以民怨已深而知之。盖国之亡，未有如民怨、嫡庶不定之酷，虏今并有之，欲不亡何待！臣故曰：“形与势异”。为陛下实深察之。\n\n　　察情 第二\n　　两敌相持，无以得其情则疑，疑故易骇，骇而应之必不能详；有以得其情则定，定故不可惑，不可惑而听彼之自扰，则权常在我而敌实受其弊矣。古之善用兵者，非能务为必胜，而能谋为不可胜。盖不可胜者乃所以徐图必胜之功也。我欲胜彼，彼亦志於胜，谁肯处其败？胜败之情战於中，而胜败之机未有所决。彼或以兵来，吾敢谓其非张虚声以耀我乎？彼或以兵遁，吾敢谓其非匿形以诱我乎？是皆未敢也。然则如之何？曰：“权然后知轻重，度而后知长短”，定故也。“他人有心，与忖度之”，审故也。能定而审，敌情虽万里之远可定察矣。今吾藏战於守，未战而长为必战之待；寓胜於战，未胜而常有必胜之理。彼诚虚声以耀我，我以静应而不轻动；彼诚匿形以诱我，我有素备而不可乘；胜败既不能为吾乱，则故神闲而气定矣。然后徐以吾之心度彼之情，吾犹是彼亦犹是，南北虽有异虑，休戚岂有异趣哉！且彼诚欲战耶，则必不肯张皇以速我之备。且如逆亮始谋南寇之时，刘麟、蔡松年一探其意而导之，则麟逐而松年鸩，恶其露机也。今诚必战，岂欲人遂知之乎！彼诚不敢必战耶，贪残无义，忿不顾败，彼何所恤？以母之亲、兄之长，一忤其意，一利其位，亮犹弑之，何有於我？况今沿海造舰，沿淮治具，包藏祸心，有隙皆可投，敢谓之终遂不战乎？大抵今彼虽无必敢战之心，而吾亦不可不防其欲尝试之举。彼於高丽、西夏，气足以吞之，故於其使之至也，坦然待之而无他；惟吾使命之去，则多方腆鲜，曲意防备。如人见牛羊未尝作色，而遇虎豹则厉声奋臂以加之，此又足以见其深有忌於我也。彼知有忌，我独无忌哉！我之所忌不在於虏欲必战，而在於虏幸胜以逾淮，而遂守淮以困我，则吾受其疾矣。朝廷心定而虑审，何情不可得，何功不可成。不求敌情之知，而观彼虚声诡势以为进退者，非特在困吾力，且失夫致胜之机为可惜。臣故曰：“知敌之情而为之处者，绰绰乎其有余矣。”\n\n观衅 第三\n　　自古天下离合之势常系乎民心，民心叛服之由实基於喜怒。喜怒之方形，视之若未有休戚；喜怒之既积,离合始决而不可制矣。何则？喜怒之情有血气者皆有之：饱而愉，暖而适，遽使之饥寒则怨；仰而事，俯而育，遽使之捐弃则痛；冤而求伸，愤而求泄，至於无所控告则怒；怨深痛巨而怒盈，服则合，叛则离。秦汉之际，离合之变，於此可以观矣。秦人之法惨刻凝密，而汉则破觚为圜，与民休息，天下不得不喜汉而怒秦。怒之方形，秦自若也；怒之既积，则喜而有所属，秦始不得自保，遂离而合於汉矣。\n　　方今中原之民，其心果何如哉？二百年为朝廷赤子，耕而食，蚕而衣，富者安，贫者济，赋轻役寡，求得而欲遂，一染腥羶，彼视吾民如晚妾之御嫡子，爱憎自殊，不复顾惜。方僭割之时，彼守未固，此讻未定，犹免强姑息以示恩，时肆诛戮以贾威；既久稍玩，真情遂出，分布州县，半是胡奴，分朋植党，仇灭中华。民有不平，讼之於官，则胡人胜而华民则饮气以茹屈；田畴相邻，胡人则强而夺之；孽畜相杂，胡人则盗而有之；民之至爱者子孙，签军之令下，则贫富不问而丁壮必行；民之所惜者财力，营筑馈饷之役兴则空室以往而休息无期；有常产者困寠，无置锥者冻馁。民初未敢遽叛者，犹徇於苟且之安，而[言术]於积威之末。辛巳之岁相挺以兴，矫首南望、思恋旧主者，怨已深、痛已巨，而怒已盈也。逆亮自知形禁势格，巢穴迥遥，恐狂谋无成窜身无所，故疾趣淮上，侥幸一胜，以谋溃中原之心而求归也。此机不一再，而朝廷虑不及此，中原义兵寻亦溃散。吁！甚可追惜也。\n　　今而观之，中原之民业尝叛虏，虏人必不能释然於其心，而无民意岂能自安而无疑乎！疑则臣患深，操心危，是以易动而轻叛。朝廷未有意於恢复则已；诚有意焉，莫若於其无事之时，张大声势以耸之，使知朝廷偃然有可恃之资；存抚新附以诱之，使知朝廷有不忘中原之心。如是，则一旦缓急。彼将转相告谕，翕然而起，争为吾之应矣。\n　　又况今日中原之民，非昔日中原之民。曩者民习於治而不知兵，不意之祸如蜂虿作於杯袖，智者不暇谋，勇者不及怒。自乱离以来，心安於斩伐而力闲於攻守，虏人虽暴，有王师为之援，民心坚矣。冯妇虽攮臂，其为士笑之。孟子曰：“为汤武驱民者，桀与纣也。”臣亦谓今之中原离合之衅已开，虏人不动则已，诚动焉，是特为陛下驱民而已。惟静以待之，彼不亡何待！\n\n　　自治 第四\n　　臣闻今之论天下者皆曰：“南北有定势，吴楚之脆弱不足以争衡於中原。”臣之说曰：“古今有常理，夷狄之腥秽不可以久安於华夏。”\n　　夫所谓南北定势者，粤自汉鼎之亡，天下离而为南北，吴不能以取魏，而晋足以并吴；晋不能以取中原，而陈亦终於毙於隋；与夫艺祖皇帝之取南唐、取吴越，天下之士遂以为东南地薄兵脆，将非命世之雄，其势固至於此。而蔡谟亦谓：“度今诸人，必不能辨此。吾见韩庐东郭踆俱毙而已。”\n臣亦谓吴不能以取魏者，盖孙氏之割据，曹氏之猜雄，其德本无以相过，而西蜀之地又分於刘备，虽愿以兵窥魏，势不可得也。晋之不能取中原者，一时诸戎皆有豪杰之风，晋之强臣方内自专制，拥兵上流，动辄问鼎，自治如此，何暇谋人？宋、齐、梁、陈之间其君臣又皆以一战之胜蔑其君而夺之位，其心盖侥幸於人之不我攻，而所以攻人者皆其自固也。至於南唐吴越之时，适当圣人之兴，理固应耳，无足怪者。由此观之，所遭者然，非定势也。\n　　且方今南北之势，较之彼时亦大异矣。地方万里而劫於夷狄之一姓，彼其国大而上下交征，政庞而华夷相怨，平居无事，亦规规然模仿古圣贤太平之事以诳乱其耳目，事以其国可以言静而不可以言动，其民可与共安而不可与共危，非如晋末诸戎四分五裂，若周秦之战国，唐季之藩镇，皆家自为国，国自为敌，而贪残吞噬、剽悍劲勇之习纯用而不杂也。且六朝之君，其祖宗德泽涵养浸渍之难忘，而中原民心眷恋依依而不去者，又非得为今日比。臣故曰：“较之彼时，南北之势大异矣。”\n　　当秦之时，关东强国末楚若也，而秦楚相遇，动以数十万之众见屠於秦，君为秦虏而地为秦虚。自当时言之，是南北勇怯不敌之明验，而项梁乃能以吴楚子弟驱而之赵，就钜鹿，破章邯，诸侯之军十余壁者皆莫敢动。观楚之战士无不一当十，诸侯之兵皆人人惴恐。卒以阬秦军，入函谷，焚咸阳，杀子婴，是又可以南北勇怯论哉？\n　　方怀王入秦时，楚人之言曰：“楚虽三户，亡秦必楚。”夫岂彼能逆知其势之必至於此耶？盖天道好还，亦以其理而推之耳。固臣直取古今常理而论之。夫所谓古今常理者：逆顺之相形，盛衰之相寻，如符契之必同，寒暑之必至。今夷狄所以取之者至逆也，然其所居者亦盛矣。以顺居盛，犹有衰焉；以逆居盛，固为衰乎？臣之所谓理者此也。不然，裔夷之长而据有中夏，子孙有泰山万世之安，古今岂有是事哉！今之议者皆痛惩往者之事，而劫於积威之後，不推项籍之亡秦，而威以蔡谟之论晋者以藉口，是犹怀千金之璧，不能斡营低昂，而摇尾於贩夫；惩蝮蛇之毒，不能祥核真伪，而褫魄於雕弓。亦已过矣。故臣愿陛下姑以光复旧物而自期，不以六朝之势而自卑，精心强力，日语二三大臣讲求古今南北之势，知其不侔而不为之惑，则臣固当为陛下言自治之策。\n　　今之所以自治者不胜其多也：官吏之盛否，民力之优困，财用之半耗，士卒之强弱，器械之良窳，边备之废置，此数者皆有司之事，陛下亦次第而行之，臣不能悉举也。顾今有大者二，陛下知之而未果行、大臣难之而不敢发者，一曰：绝岁币，二曰都金陵。臣闻今之所以待虏，以缗计者二百余万，以天下之大而为生灵社稷计，曾何二百余万之足云，臣不为二百余万缗惜也。钱塘金陵俱在大江之南，而其形势相去亦无几矣，岂以为是数百里之远而遽有强弱之辨哉！臣不为数百里计也。然而绝岁币则财用未可以遽富，都金陵则中原未可以遽复，是三尺童子之所知，臣之区区以是为言者，盖古之英雄拨乱之君，必先内有以作三军之气，外有以破敌人之心，故曰：“未战，养其气。”又曰：“先人有夺人之心”。今则不然：待敌则恃欢好於金帛之间，立国则借形势於山湖之险，望实俱丧，莫此为甚。使吾内之三军习知其上之人畏怯退避之如此，以为夷狄必不可敌，战守必不可恃，虽有刚心勇气亦销铄委靡而不振，臣不知缓急将谁使之战哉！借使战，其能必胜乎？外之中原民心以为朝廷置我於度外，谓吾无事则知自备而已，有事则将自救之不暇，向之袒臂疾呼而促逆亮之毙、为吾响应者，它日必无若是之捷也。如是则敌人将安意肆志而为吾患。今绝岁币、都金陵，其形必至於战。天下有战形矣，然後三军有所怒而思奋，中原有所恃而思乱，陛下间取其二百余万缗者以资吾养兵赏劳之费，岂不为朝廷之利乎！然此二者在今日未可遽行。臣观虏人之情，玩吾之重战，而所求未能充其欲，不过一二年必以战而要我，苟因其要我而遂绝之，则彼亦将自沮，而权固在我矣。\n　　议者必曰：“朝廷全盛时，西、北二虏亦不免於赂。今我有天下之半，而虏倍西、北之势，虽欲不赂，得乎？”臣应之曰：“是赵之所以待秦也。”昔者秦攻邯郸而去，赵将割六县而与之和，虞卿曰：“秦之攻赵也，倦而归乎？抑其力尚能进，且爱我而不攻乎？”王曰：“秦之攻我也，不遗余力矣。必以倦而归矣。”虞卿曰：“秦以其力，攻其力所不能取，倦而归；王又以其力之所不能攻以资之，是助秦自攻也。”臣以为虞卿之所以谋赵者，是今日之势也。且今日之势，议者固以东晋自卑矣。求之於晋，彼亦何尝退金陵、输岁币乎？\n　　臣窃观陛下圣文神武同符祖宗，必将凌跨汉唐、鞭笞异类，然後为称，岂能郁郁久居此者乎？臣愿陛下酌古以御今，无惑於纷纭之论，则恢复之功可必其有成。\n　　古人云：“谋及卿士，谋及庶人。”又曰：“作屋道边，三年不成。”盖谋贵众、断贵独，惟陛下深察之。\n\n　　守淮 第五\n　　臣闻用兵之道，无所不备则有所必分，知所必守则不必皆备。何则？精兵骁骑，十万之屯，山峙雷动，其势自雄，以此为备则其谁敢乘？离屯为十，屯不过万，力寡气沮，以此为备则备不足恃。此聚屯分屯之利害也。臣尝观两淮之战，皆以备多而力寡，兵慑而气沮，奔走於不必守之地，而撄虏人远斗之锋，故十战而九败。其所以得画江而守者，幸也。且今虏人之情，臣固以论之矣，要不过以戍兵而入寇，幸成功而无内祸；使之逾淮，将有民而扰之，有城而守之，则始足以为吾患。夫守江而丧淮，吴、陈、南唐之事可见也。且我入彼出，我出彼入，况日持久，何事不生？曩者兀术之将曰韩常，刘豫之相曰冯长宁者，皆尝以是导之，讵知其他日之计终不出於此乎？故臣以为守淮之道，无惧其必来，当使之兵交而亟去；无幸其必去，当使之他日必不敢犯也。为是策者，在於彼能入吾之地，而不能得吾之战；彼能攻吾之城，吾能出彼之地。然而非备寡力专则不能也。\n　　且环淮为郡凡几？为郡之屯又几？退淮而江为重镇，曰鄂渚、曰金陵、曰京口，以至於行都扈跸之兵，其将皆有定营，其营皆有定数，此不可省也。环淮必欲皆备，则是以有限之兵而用无所不备之策。兵分势弱，必不可以折其冲。以臣策之，不若聚兵为屯，以守为战，庶乎虏来不足以为吾忧，而我进乃可以为彼患也。\n　　聚兵之说如何？虏人之来，自淮而东必道楚以趣扬；自淮而悉必道濠以趣真，与道寿以趣和；自荆襄而来，必道襄阳以趣荆。今吾择精骑十万，分屯於山阳、濠梁、襄阳三处，而於扬或和置一大府以督之。虏攻山阳，则坚壁勿战，而虚盱眙高邮以饵之，使濠梁分其半与督府之兵横击之，或绝饷道，或要归途。虏并力於山阳，则襄阳之师出唐、邓以扰之。虏攻濠梁，则坚壁勿战，而虚庐寿以饵之，使山阳分其半与督府之兵亦横击之。虏并力於濠梁，而襄阳之师亦然。虏攻襄阳，则坚壁勿战，而虚郢复以饵之，虏无所获，亦将聚淮北之兵以并力於此，我则以濠梁之兵制其归，而山阳之兵自沐阳以扰沂海。此政所谓：不恃敌之不敢攻，而恃吾能攻彼之所必救也。\n　　臣窃谓解杂乱纷纠者不控拳，救斗者不搏戟，批亢擣虚，形格势禁，则自为解矣。昔人用兵多出於此，故魏赵相攻，齐师救赵，田忌引兵疾走大梁，则魏兵释赵而自救，齐师因大破之於桂陵。後唐庄宗与梁相持於杨刘德胜之间，盖尝蹙而不胜，其後用郭崇韬之策，七日入汴而梁亡。兵家形势，从古已然。议者必曰：“我如擣虚以进，彼亦将调兵以拒进；遇其实未见其虚。”是大不然。彼沿边为守，其兵不过数万，既已屯於三城之冲，其馀不容复多。兵少而力不足，未能当我全师者，又非其所虑也。又况彼纵得淮，而民不服，且有江为之阻，则犹未足以为利。我得中原，而箪壶迎降，民心自固，且将不为吾守乎？如此则在我者甚坚，而在彼者甚瑕。全吾所甚坚，攻彼所甚瑕，此臣所谓兵交而必亟去，兵去而不敢复犯者此也。呜呼！安得斯人而与之论天下之哉！\n\n　　屯田 第六\n　　赵充国论备边之计曰：“湟中积榖三百万斛则羌人不敢动。”李广武为成安君谋曰：“要其辎重，十日不至，则二将之头可致者。”此言用兵制胜以粮为先，转饷给军以通为利也。必欲使粮足而饷无间绝之忧，惟屯田为善。而屯田盖亦难行：国家经画，於今几年，而曾未睹夫实效者，所以驱而使之耕者非其人，所以为之任其责者非其吏，故利未十百而害已千万矣。名曰屯田，其实重费以敛怨也。何以言之？市井无赖小人，为其懒而不事事，而迫於饥寒，故甘捐躯於军伍，以就衣食而苟闲纵，一旦警急，擐甲操戈以当矢石，其心固偃然自分曰：“向者吾无事而幸饱暖於官，今焉官有事而责死力於我。”且战胜犹有累资补秩之望，故安之而不辞；今遽而使之屯田，是则无事而不免耕耘之苦，有事而又履夫攻守之危，彼必曰：“吾能耕以食，岂不能从富民租佃以为生，而轻失身於黥戮？上驱我於万死，岂不能捐榖帛以养我，而重役我以辛勤？」不平之气无所发泄，再畎亩则邀夺民田、胁掠酒肉，以肆无稽，践行阵则呼愤扼腕、疾视长上，而不可为用。且曰：「吾自耕自食，官何用我焉。”是诚未睹夫享成之利也。鲁莽灭裂，徒费粮种，只见有害，未闻获利，此未为策之善。\n　　如臣之说则曰：向者之兵怠惰而不尽力，向者之吏苟且而应故事。不如籍归正军民厘为保伍，则归正不厘务官擢为长贰，使之专董其事。且彼自虏中被签而来，耒耨之事盖所素习。且其生同乡井，其情相得，上令下从，不至生事。惟官为之计其闲田顷亩之数、与夫归正军民之目，土人以占之田不更动摇，以重惊扰。归正之人家给百亩而分为二等；为之兵者，田之所以尽以予之；危之民者，十分税一则以为凶荒赈济之储。室庐、器具、粮种之法一切遵旧，使得植桑麻、蓄鸡豚，以为岁时伏腊婚嫁之资。彼必忘其流徙，便於生养。无事则长贰为劝农之官，有事则长贰为主兵之将，许其理为资考，久於其任，使得悉心於教劝。而委守臣监司核其劳绩，奏与迁秩而不限举主。人熟不更相劝勉以赴功名之会哉。且今归正军民散在江淮，而此方之人例以异壤视之。不幸而主将亦以其归正，则求自释於庙堂，又痛事行迹，愈不加恤。间有挟不平，出怨语，重典已絷其足矣。所谓小名目者仰俸给为话，胥吏泪抑，何尝以时得？呜呼！此诚可悯也，诚非朝廷所以怀诱中原忠义之术也。\n　　闻之曰：“因其不足而利之，利未四、五而恩逾九、十。”此正屯田非特为国家便，而且亦为归正军民之福。议者必曰：“归正之人常怀异心，群而聚之，虑复生变。”是大不然也。且和亲之後沿江归正军民，官吏失所以抚摩之惠，相扳北归者莫计，当时边吏亦皆听之而莫为制，此岂独归正军人之罪？今之留者既少安矣，更为屯田以处之，则人有常产而上无重敛，彼何苦叛去以甘虏人横暴之诛求哉！若又曰：“恐其窃发”，且人惟不自聊赖乃攮夺以苟生，诚丰沃矣！何苦如是？饥者易为食，必不然也。诚使果耳，疏而远之於江外，不犹愈於聚乎内而重惊扰乎？且天下之事，逆虑其害而不敢求其利，亦不可言智矣。\n　　盖今所谓御前诸军者，待之素厚而仰之素优，故骄。骄则不可复使，此甚易晓也。若夫州郡之卒异於是。彼非天子爪牙之故，可以劳之而不怨，而其大半出於农桑失业之徒，故狎於野而不怨。往年尝猎其丁壮劲勇者为一军矣，臣以为可辈徒此军，视归正军民之数倍而发之，使阡陌相连，庐舍相望，并耕乎两淮之间。彼其名素贱，必不敢倨视归正军民而媒怨；而归正军民视之，犹江南之兵也，亦必有所忌而不敢逞。势足以禁归正军民之变，力足以禁屯田之利，计有出於此者乎？\n　　昔商之顽民相率为乱，周公不诛而迁之洛邑，曰：”商之臣工，乃湎於酒，勿庸杀之，姑惟教之。“其後康王命毕公，又曰：“不臧厥臧，民罔攸劝。”始则迁其顽而教之，终则择其善而用之。圣人治天下未尝绝物固如此。今归正军人聚於两淮而屯田以居之，核其劳绩而禄秩以诱之，内以节冗食之费，外以省转饷之劳，以销桀骜之变，此正周人待商民之法，秦使人自为战之术，而井田兵农之遗制也。况皆吾旧赤子，非如商民在周之有异念，术而使之，天下岂有不济之事哉！\n\n　　致勇 第七\n　　臣闻行阵无死命之士则将虽勇而战不能必胜，边陲无死事之将则相虽贤而功不能必成。将骄卒惰，无事则已，有事而其弊犹耳，则望贼先遁，临敌遂奔，几何而不败国家事。人君责成於宰相，宰相身任乎天下，可不有以深探其情而逆为之处乎！盖人莫不重死，惟有以致其勇，则惰者奋、骄者耸，而死有所不敢避。呜呼！此正鼓舞天下之至术也。致之如何？曰：“将帅之情与士卒之情异，而所以致之之术亦不可得而同。”和则？致将帅之勇在於均任而投其所忌，贵爵而激其所慕；致士卒之勇，在於寡使而纾其不平，素赏而恤其已亡。臣请得而备陈之：今之天下，其弊在於儒臣不知兵而武臣有以要其上，故阃外之事朝廷所知者胜与负而已，所谓当进而退、可攻而守者，则朝廷有不及知也。彼其意盖曰：“平时清要，儒臣任之；一旦扰攘，而使我履矢石！吾且幸富贵矣。岂不能逡巡自爱而留贼以固位乎！”向者淮上之师有迁延而避虏者，是其事也。臣今欲乞朝廷於文臣之中择其廉重通敏者，每军置参谋一员，使之得以陪计议、观形势而不相统摄。非如唐所谓监军之比。彼为将者心有所忌，而文臣亦因之识行阵、谙战守，缓急均可以备边城之寄；而将帅临敌，有可进而攻之之便，彼知缙绅之士亦识兵家利害，必不敢依违养贼以自封而遗国家之患。此之谓均任而投其所忌。\n　　凡人之情，未得志则冒死以求富贵，已得志则保富贵而重其生。古人论御将者以才之大小为辨，谓御大才者如养骐骥，御小才者如养鹰犬。然今之将帅岂皆其才大者，要之饱则飞去亦有如鹰者焉！向者虹县海道之师，有得一邑、破数舰而遽以节钺，使相与之者，是其事也。臣欲乞朝廷靳重爵命，齐量其功，等第而予之。非谓无予之谓，徐以予之，且欲使之常衅衅然，有歆慕未足之意以要其後效。而戒谕文吏，非有节制相临者必以资级为礼，予左选人均，无使如正使遥郡者间有趋伏堂下之辱，如唐以金紫而执役之类。彼被介胄者知一爵一命之可重，而朝廷无左右选贵贱之别，则亦矜持奋励、尽心於朝廷而希尊容之宠。此之谓贵爵而激其所慕。\n　　营幕之间饱暖有不充，而主将歌舞无休时，锋镝之下肝脑不敢保，而主将雍容於帐中，此亦危且勩矣。而平时又不予之休息以养其力，至使於舁土运甓以营私室而肆鞭鞑，彼之心怀愤挟怨，惟恐天下之无事、以求所谓快意肆志者而邀其上，谁肯挺身效命以求胜敌哉！兵法曰：「视卒如爱子」，故古之贤将有与士卒最下者同衣食而分劳苦。臣今欲乞朝廷明敕将帅，自教阅外，非修营治栅、名公家事者不得私有役使，以收士卒之心。此之谓寡使而纾其不平。\n　　人莫不恶死，亦莫不有父母妻拿之爱，冒万死、幸一生，所谓奇功斩获者有一资半级之望，朝廷较其毫厘而裁抑之，赏定而付之於军，则胥吏轧之、主将邀之，不得利不与。敌去师捷，主将享大富贵，而士卒有一命又复沮格如此，不幸而死，妻离子散，香火萧然，万事瓦解；未死者见之，谁不生心？兵法曰：「军赏不逾时」，而古之贤将盖有为士卒裹创恤孤者。臣今欲乞朝廷遇有赏命，特与差官携至军中，呼名给付；而死事之家，申敕主将曲加抚劳，以结士卒之欢。此之谓速赏而恤其已亡。如此则骄者化而为锐，惰者化而为力。有不守矣，守之而无不固；有不攻矣，攻之而无不克。\n　　凡兹数事，非有难行重费，朝廷何惜而不举、已收将卒他日之用哉！臣窃观陛下向尝训百官以宠武臣，隆恩数以优战伐，是诚有意於激励将卒矣，然其间尚有行之而未及详，已行而旋复驰之事。欲望陛下察臣所以得於行伍之说如此，而明付之宰相，使之审处而力行之，庶几有以得上下之欢心，而急难不至於误国，此实天下之至计也。\n\n　　防微 第八\n　　古之为国者，其虑敌深，其防患密。故常不吝爵赏以笼络天下智勇辩力之士，而不欲一夫有忧愁怨怼亡聊不平之心以败吾事。盖人之有智勇辩力者，士皆天民之秀杰者，类不肯自己，苛大而不得见用於世，小而又饥寒於其身，则其求逞之志果於毁名败节，凡可以纾忿充欲者无所不至矣。是以敌国相持，胜负未决；一夫不平，输情於敌，则吾之所忌彼知而投之，吾之所长彼习而用之；投吾所忌，用吾所长，是殆益敌资而遗敌胜耳，不可不察。传曰：“谨备於其外，患生於其内。”正圣人所以深致意而庸人以为不足虑也。\n　　昔者，楚公子巫臣尝教吴乘车射御，而吴得以逞。汉中行说尝教单于无爱汉物，而汉有匈奴之忧。史传所载，此类甚多。臣之为今日虑者，非以匹夫去就可以为朝廷重轻，盖以为泄吾之机足以增虏人之颉颃耳。何则？科举不足以尽笼天下之士，而爵赏亦不足以尽縻归附之人，与夫逋寇穷民之所归、茹冤抱恨之无所泄者，天下亦不能尽无，窃计其中亦有杰然自异而不徇小节者矣，彼将甘心俯首、守死於吾土地乎？抑亦坏垣越栅而求释於他域乎？是未可知也。臣之为是说者，非欲以耸陛下之听而行己之言，盖亦有见焉耳。请试言其大者：逆亮之南寇也，海道舟楫则平江之匠实为之；淮南惟秋之防，而盛夏入寇，则无锡之士实惎之；克敌弓努虏兵所不支，今已为之；殿司之兵比他卒为骄，今已知之。此数者岂小事哉！如闻皆其非归之人、叛军之长教之使然。且归正军民，或激於忠义，或迫於虐政，故相扳来归，其心诚有所慕也，前此陛下尝许以不遣矣。自去年以来，虏人间以文牒请索，朝廷亦时有曲从，其间有知诗书识义分者，如解元振辈，上章请留，陛下既已旌赏之矣。若俗所谓泗州王等辈既行之後，得之道理，皆言阴通伪地，教其亲戚诉诸虏庭移牒来请，此必其心有所不乐於朝廷者。若此槽虽[兄辱][冗辱]无能，累千百万举发以归之固不足恤，然人之度量相越、智愚不同，或其中亦有所谓杰然自异者。患生所忽，渐不可长。臣愿陛下广含弘之量，开言事之路，许之陈说利害，官其可采，以收拾江南之士；明昭有司，时散俸廪，以优恤归明归正之人。外而敕州县吏，使之蠲除科敛，平亭狱讼，以抒其逃死蓄愤无所伸诉之心。其归正军民，或有再索而犹言愿行者，此必阴通伪地，情不可测。朝廷既无负於此辈，而犹反复若是，陛下赫然诛其一、二，亦可以绝其奸望。不然，则纵之而不加制，玩之而不加恤，恐他日万一有如先朝张源、吴昊之西奔，近日施宜生之北走，或能驯致边陲意外之扰，不可不加意焉。\n　　臣闻之：鲁公甫文伯死，有妇人自杀於房者二人，其母闻之不哭，曰：“孔子贤人也。逐於鲁而是人不随，今死而妇人为自杀，是必於其长者薄、於其妇人厚。”议者曰：“从母之言则是为贤母，从妻之言则不免为妒妻。”今臣之论归正归明军民，诚恐不悦臣之说者以臣为妒妻也。惟陛下深察之。\n\n　　久任 第九\n　　臣闻天下无难能不可为之事，而有能为必可成之人。人诚能也，任之不专则不可以有成。故孟子曰：“五谷种之美者也，苟为不熟，不如稊稗。”何则？事有操纵自我，而谋之已审，则一举而可以遂成；事有服叛在人，而谋之虽审，亦必持久而後可就。盖自古夷狄为中国患，彼皆有争胜之心，圣人方调兵以正天诛，任宰相以责成功，非如政刑礼乐发之自己，收之亦自己之易也。朝而用兵，夕而遂胜，公卿大夫交口归之，曰：“此宰相之贤也。”明日而临敌，後日而闻不利，则群起而媒孽之，曰：“宰相不足与折冲也。”乍贤乍佞，其说不一，於是人君亦不能自信，欲求之立事，难矣哉！\n　　臣读史，尝窃深加越句践、汉高祖之能任人，而种、蠡、良、平之能处事：骤而胜，遽而败，皆不足以动其心，而信之专，期之成，皆如其所料也。观夫公稽之栖，五年而吴伐齐，虚可乘也，种、蠡如不闻；又四年，吴伐齐，虚可乘也，种、蠡反发兵助之；又二年，吴伐齐不胜，而种、蠡始袭破之，可以取之，种、蠡不取；又九年而始一举灭之。盖历二十又三年，而句践未尝以为迟而夺其权。丰沛之兴，秦二年，汉败於薛；汉元年，高帝厄於鸿门；又二年衅於彭城；又三年，困於荥阳；又五年不利於夏南。良、平何尝一日不从之计议，然未免於龃龉者，盖历五年而始蹶项立刘，高帝亦未尝以为疏而夺其权。诚以一胜一败兵家常势，惩败狃胜，非策之上。故古之人君，其信任大臣也，不间於谗说；其图回大功也，不恤於小节；所以能责难能不可为之事於能为必可成之人而收其效也。虏人为朝廷患，如病疽焉。病根不去，终不可以为身安。然其决之也，必加炷刃，则痛亟而无後悔；而其销之也，止於傅饵，则痛迟而终为大患。病而用医，不一其言，至炷刃方施而传饵移之，傅饵未几而炷刃夺之；病不已而乃咎医。吁！亦自惑也。且御戎有二道，惟和与战。和固非常策，然太上皇帝用秦桧一十九年而无异论者，太上皇帝信之之笃而秦桧守之之坚也。今日之事，以和为可以安，而臣不敢必其盟之可保；以为战为不可讲，而臣亦不敢必其兵之可休。惟陛下推至诚，疏谗慝，以天下之事尽付之宰相，使得优游无疑以悉力於图回，则可和与战之机宰相其任之矣。\n　　唐人视相府如传舍，其所成者果何事？淮蔡之功，裴度用而李师道遣刺客以缓师，高霞寓败而钱微萧俛以为言，宪宗信之深、任之笃，令狐楚之罢为中舍，李逢吉之出为节度，皆以沮谋而见疏。故君以断、臣以忠，而能成中兴之功。而顷者张浚虽未有大捷，亦未至大败，符离一挫，召还揆路，遂以罪去，恐非越句践、汉高帝、唐宪宗所以任宰相之道。非特此也，内而户部出纳之源，外而全曹总司之计，与夫边郡守臣、屯戍守将，皆非朝夕可以责其成功者。臣愿陛下要成功於宰相，而使宰相责成功於计臣、守将，俾其各得专於职治，而以禄秩旌其劳绩，不必轻移遽迁，则人无苟且之心，乐於奋激以自见其才。一网既举，众目自张，天下之事犹有不办者，臣不敢信其然也。\n\n　　详战 第十\n　　臣闻鸱枭不鸣，要非祥禽；豺狼不噬，要非仁兽。此虏人吴未动而臣固将以论战。何则？我无尔诈，尔无我虞。然後两国可恃以定盟，而生灵可恃以弭兵。今彼尝有诈我之情，而我亦有虞彼之备，一诈一虞，谓天下不至於战者，惑也。明知天下之必战，则出兵以攻人与坐而待人之攻也，孰为利？战人之地与退而自战其地者，孰为得？均之不免於战，莫若先出兵以战人之地，此固天下之至权、兵家之上策而微臣之所以敢妄论也。\n　　详战之说奈何？详其所战之地也。兵法有九地，皆因地而为之势。不详其地、不知其势者谓之“浪战”。故地有险易、有轻重。先其易者，险有所不攻；破其重者，轻有所不取。今日中原之地，其形易、其势重者，果安在哉？曰：山东是也。不得山东则河北不可取，不得河北则中原不可复。此定势，非臆说也。古人谓用兵如常山之蛇，击其首则尾应，击其尾则首应，击其身则首尾俱应。臣窃笑之，夫击其尾则首应、击其身则首尾俱应，固也；若击其首则死矣，尾虽应，其庸有济乎？方今山东者，虏人之首，而京洛关陜则其身其尾也。由泰山而北，不千二百里而至燕，燕者虏人之巢穴也。自河失故道，河朔无浊流之阻，所谓千二百里者从枕席上过师也。山东之民劲勇而喜乱，虏人有事常先穷山东之民，天下有变而山东亦常首天下之祸。至其所谓备边之兵，较之他处，山东号为简略。且其地於燕为近，而其民素喜乱，彼方穷其民、简其备，岂真识天下之势也哉。今夫二人相搏，痛其心则手足无强力；两阵相持，噪其营则士卒无斗心。固臣以为兵出沐阳〔海州属县〕则山东指日可下，山东已下则河朔必望风而震，河朔已震则燕山者臣将使之塞南门而守。请试言其说：虏人列屯置戍，自淮阳以西，至於汧陇〔海州防御去处，故此不论〕，杂女真、渤海、契丹之兵不满十万。关中、洛阳、京师三处，彼以为形势最重之地。防之为甚深，备之不甚密，可因其为重，大为之名以信之。扬兵於川蜀，则曰：“关陇秦汉故都，百二之险。吾不可以不争。”扬兵於襄阳，则曰：“洛阳吾祖宗陵寝之旧，废祀久矣，吾不可以不取。”扬兵於淮西，则曰：“京师吾宗庙社稷基本於此，吾不可以不复。”多为旌旗金鼓之形，佯为志在必取之势，已震关中，又骇洛阳；以骇洛阳，又声京师。彼见吾形、忌吾势，必以十万之兵而聚三地，且沿边郡县亦必皆守而後可，是谓无所不备则无所不寡。如此则燕山之卫兵、山东之户民（女真山东之屯田者不满三万，此兵不俱可用。）、中原之签军，精甲锐兵必举以至，吾乃以形耸之使不得遽去，以势留之使不得遂休，则山东之地固虚邑也。山东虽虚，切计青、密、沂、海之兵犹有数千，我以沿海战舰驰突於登莱沂密淄淮之境，彼数千兵者尽分於屯守矣。山东诚虚，盗贼必起，吾诱群盗之兵使之溃裂皿出；而陛下徐择一骁将，以兵五万，步骑相半，鼓形而前，不三日而至兖郓之郊，臣不知山东诸郡将谁为王师敌哉！山东已定，则休士秣马，号召忠义，教以战守，然後传檄河朔诸郡，徐以兵蹑其後，此乃韩信所以破赵而举燕也。天下之人知王师恢复之意坚，虏人破灭之形著，则契丹诸国如窝斡、鹧巴之事必有相轧而起者。此臣所以使燕山塞南门而守也。彼虏人三路备边之兵将北归以自卫耶？吾已制其归路，彼又虞淮西、襄阳、川蜀之兵，未可释而去也。抑为战与守耶？腹心已溃，人自解体，吾又半途出其背而夹击之。当此之时，陛下筑城而降其兵亦可；驱而之北，反用其锋亦可；纵之使归，不虞，而後击之亦可。臣知天下不足定也。\n　　然海道与三路之兵，将不必皆勇，士不必皆锐。盖臣将以海道三路之兵为正，而以山东为奇；奇者以强，正者以弱；弱者牵制之师，而强者必取之兵也。古之用兵者，唐太宗其知此矣，尝曰：「吾观行阵形势，每战必使弱常遇强、强常遇弱。敌遇吾弱，追奔不过数十百步；吾击敌弱，常突出自背反攻之，以是必胜。」然此特太宗用之於一阵间耳。臣以为天下之势，避实击虚，不过如是。苟曰不然，以将驱坚悉锐由三路以进，寸攮尺取为恢复之谋，则吾兵为虏弱久矣，骤而用之未尝不败。近日符离之战是也。假设陛下一举而取京洛，再举而复关陜，彼将南绝大河下燕蓟之甲，东於泗水漕山东之粟，陛下之将帅谁与守此？曩者三京之役是也。借能守之，则河北犹未病；河北未病，则雌雄犹未决也。以是策之，陛下其知之矣\n　　昔韩信请於高祖，愿以三万人北举燕赵，东击齐，南绝楚之粮道，而西会於荥阳。耿弇言於光武，欲先定渔阳，取涿郡，还收富平，而东下齐。皆越人之都而谋人之国，二子不以为难能，而高祖光武不以为可疑，卒藉之以取天下者，见之明而策之熟也。由今观之，使高祖光武不信其言，则二子未免为狂。何者？落落而难合也。如臣之论，焉知不有谓臣为狂者乎！虽然，臣又有一说焉。为陛下终言之：臣前所谓兵出山东则山东之民必叛虏以为我应，是不战而可定也。议者必曰：“辛巳之岁，山东之变已大矣，然终无一人为朝廷守尺寸土以基中兴者，何也？”臣之说曰：“北方郡县，可使为兵者皆锄犁之民，可使以用此兵而成事者，非军府之黥卒则县邑之弓兵也。”何则？锄犁之民，寡谋而易聚，惧败而轻敌，使之坚战而持久则败矣。若夫黥卒之与弓兵，彼皆居行伍，走官府，皆知指呼号令之不可犯，而为之长者更战守，其部曲亦稔熟於其赏罚进退之权。建炎之初，如孔彦舟、李成辈，杀长吏，驱良民，胶固而不散者皆此辈也。然辛巳之岁何以不变？曰：“东北之俗尚气而耻下人。当是时，耿京王友直辈奋臂陇亩，已先之而起，彼不肯俯首听命以为农夫下，故宁撄城而守，以须王师而自为功也。”臣常揣量此曹间有豪杰可与立事者，然虏人薄之而不以战，自非土木之兴筑、官吏之呵卫，皆不复用。彼其思一旦之变以逞夫平昔悒快勇悍之气，抑甚於锄犁之民。然而计深虑远，非见王师则未肯轻发。陛下诚以兵入其境，彼将开门迎降，惟恐後耳。得民而可以使之将，得城而可以使之守，非於此焉择之，未见其可也。故臣於详战之未而备论之。",
			"added": 1619974693
		},
		{
			"topic_id": 1621324858,
			"title": "现在零网被封得越来越厉害了....",
			"body": "好像是有什么事情发生了一样，或者是要发生什么事情....",
			"added": 1621324807
		},
		{
			"topic_id": 1621325172,
			"title": "中科院：主动探索将BTC等私有货币纳入国家外汇储备",
			"body": "来源：链动精灵　　\n\n　　2021年5月13日，中国科学院战略咨询研究院研究人员在腾讯旗下微信公号“腾讯研究院”上发表文章，对数字货币最新格局进行跟踪分析，重点研判存在的主要风险及对我国影响，提出初步应对建议。\n\n　　作者将数字货币分为法定数字货币（又称“主权数字货币”）、私有数字货币（又称“加密资产”）、以及兼具主权和非主权特征的稳定数字货币（锚定主权货币或有价资产的“稳定币”）三类。然后分别探讨了私有数字货币、稳定币和法定数字货币的潜在风险。\n\n　　在谈及私有数字货币潜在风险时，文章建议应密切跟踪最新进展情况，做好风险研判预判，提前储备风险应对技术和方案，并主动探索将比特币等私有货币纳入我国外汇资产储备。同时，加强对稳定币新理念、新架构的创新探索与风险评估，主动对接监管，做好合规发展。\n\n　　作者表示，面对货币主权、金融稳定、监管合规、技术安全、隐私保护、跨境洗钱等诸多挑战，非主权数字货币能否“行稳致远”仍是未知。目前，为防范币价暴涨暴跌带来的冲击，确保我国金融体系的整体安全，防风险求稳定仍是当务之急。\n\n　　因此，建议我国坚持按照“稳中求进”和“集中力量办好自己的事情”的工作基调，大力推动我国主权数字货币研发应用，并同步做好以下风险应对：\n\n　　一是针对私有数字货币潜在的风险。考虑到其应用前景和态势尚未明朗，建议密切跟踪最新进展情况，做好风险研判预判，提前储备风险应对技术和方案，并主动探索将比特币等私有数字货币纳入我国外汇资产储备。\n\n　　二是针对稳定币潜在的风险。目前主要发达国家和国际组织都在逐步收紧监管，建议我国密切跟踪国外监管态度变化，加强对稳定币新理念、新架构的创新探索和风险评估，同时主动对接监管，做好合规发展。\n\n　　三是针对主权数字货币测试应用。建议借鉴互联网金融风险防范的有益经验，相关监管部门密切合作做好相关风险防控，为打击借数字人民币和区块链进行的违法行为提供技术支持，确保金融和货币系统稳定。\n\n　　四是针对跨境具体违规行为，建议按照国务院反洗钱、反恐怖融资、反逃税监管体制机制，强化线索移送和案件协查，形成打击犯罪合力。建议在我国2030年“碳达峰”、2060年“碳中和”路线图中纳入数字货币和区块链风险应对预案，确保相关目标顺利实现。\n\n　　五是针对非清洁能源“挖矿”引发的风险挑战，建议在我国2030年碳达峰、2060年碳中和路线图中纳入数字货币和区块链风险应对预案，确保相关目标顺利实现。",
			"added": 1621325120
		},
		{
			"topic_id": 1621672453,
			"title": "国务院金融委：打击比特币挖矿和交易行为",
			"body": "5月21日，国务院金融稳定发展委员会（以下简称金融委）召开第五十一次会议，研究部署下一阶段金融领域重点工作。会议由中共中央政治局委员、国务院副总理、金融委主任刘鹤主持，金融委成员单位有关负责同志参加会议。\n\n　　会议指出，金融系统坚决贯彻党中央、国务院决策部署，加大对实体经济的支持力度，稳健的货币政策灵活适度，信贷政策精准适应市场主体需要，流动性保持合理充裕，金融服务水平提高，金融支持疫情防控和经济社会发展取得明显实效。\n\n　　会议要求，金融系统要坚持大局意识，坚持稳字当头，科学精准实施宏观调控，把握好度，不搞急转弯。要综合运用多种货币政策工具保持流动性合理充裕，有效防范和化解金融风险，促进经济金融良性循环。\n\n　　一是进一步服务好实体经济。稳健的货币政策要灵活精准、合理适度，继续实施直达实体经济的政策工具，增强微观主体活力，稳企业保就业，大力支持普惠小微、乡村振兴、制造业、科技创新和绿色转型发展。\n\n　　二是坚决防控金融风险。坚持底线思维，加强金融风险全方位扫描预警，推动中小金融机构改革化险，着力降低信用风险，强化平台企业金融活动监管，打击比特币挖矿和交易行为，坚决防范个体风险向社会领域传递。要维护股、债、汇市场平稳运行，严厉打击证券违法行为，严惩金融违法犯罪活动。要严密防范外部风险冲击，有效应对输入性通胀，加强预期管理，强化市场监管，做好应对预案和政策储备。\n\n　　三是继续深化改革开放。进一步推动利率汇率市场化改革，保持人民币汇率在合理均衡水平上的基本稳定。加快资本市场改革，推动债券市场高质量发展。深化金融机构改革，回归本源，坚守定位，遵循绿色理念开展投融资行为。继续扩大高水平金融开放。\n\n　　虚拟货币再度狂跌，1小时爆仓17亿\n\n　　上述消息公布后，OKEx行情显示，虚拟货币市场全线崩溃，比特币价格直线跳水，10分钟跌逾3000美元，一度击穿34000美元，较上月历史最高点64900美元，缩水超47%。截至发稿前，比特币价格止跌反弹，目前在37000美元附近震荡.....",
			"added": 1621672400
		},
		{
			"topic_id": 1622004945,
			"title": "鼎盛病院的蠢猪也配谈比特币？呵呵呵呵，世道真变了.....",
			"body": "　　有意思的是连鼎盛病院的蠢猪都开始帮着说话了，这大概就是所谓的潮流趋势吧。\n帮着说话当然不意味着其他的事情，尤其不代表某些人开始思考了，明白了，而仅仅只意味着比特币开始跟某些人的利益相关，或者说有某些人开始从比特币，或者从与比特币相关的事情中开始获利，于是开始帮着说话了。\n　　嗯，我确信未来类似这样的人，这样的事肯定只会越来越多。所以，真诚地希望有关部门一定要尽快痛下杀手，因为再不下，将来就肯定下不了了，未来只会有越来越多的人拽你们的袖子，呵呵......",
			"added": 1622004891
		},
		{
			"topic_id": 1625670101,
			"title": "中国人民银行发布关于防范虚拟货币交易活动风险提示",
			"body": "中新网7月6日电 据“中国人民银行营业管理部”微信公众号消息，北京市地方金融监督管理局、人民银行营业管理部6日联合发布《关于防范虚拟货币交易活动的风险提示》称，郑重警告辖内相关机构，不得为虚拟货币相关业务活动提供经营场所、商业展示、营销宣传、付费导流等服务。辖内金融机构、支付机构不得直接或间接为客户提供虚拟货币相关服务。\n\n据介绍，为贯彻落实党中央、国务院关于打击虚拟货币交易的决策部署，防控虚拟货币交易炒作风险，保护人民群众财产安全，近期，北京市地方金融监督管理局联合中国人民银行营业管理部、怀柔区政府相关部门，对涉嫌为虚拟货币交易提供软件服务的北京取道文化发展有限公司予以清理整顿，责令该公司注销，官方网站已停用。\n\n同时，提醒广大消费者，应增强风险意识，树立正确的投资理念。不参与虚拟货币交易炒作活动，不盲目跟风虚拟货币相关投机行为，谨防个人财产及权益受损。要珍惜个人银行账户，不用于虚拟货币账户充值和提现、购买和销售相关交易充值码以及划转相关交易资金等活动，防止违法使用和个人信息泄露。及时举报虚拟。",
			"added": 1625670046
		},
		{
			"topic_id": 1626686044,
			"title": "我们来看看接下来还会有些什么政策....",
			"body": "我似乎明确地嗅到一些阴谋的味道，当然我什么都不知道，什么都不会说，不过我确实是一个最资深的阴谋论者....",
			"added": 1626685988
		},
		{
			"topic_id": 1627975446,
			"title": "关于吴亦凡的事情",
			"body": "中国目前的社会本质上仍然是一个半封建，半官僚，半殖民地社会，半封建半官僚还是好理解的，半殖民地应该更好理解，无论机构还是个人，无论哪种信仰哪种肤色，都可享受的各种超国民待遇，包括吴亦凡，如果不是这次太离谱，其实是可以轻轻松松捞钱享受的，即使这次出事，之前也过了很多年幸福生活，赚的钱，享受的生活比得上一万个屌丝的全部人生。\n所以每一个普通人，每一个P民，只要你是生在中国，中国国籍，那无论如何你一定要有自己的明确的人生态度。虽然佛系，躺平也算是一种人生态度，而且在我看来比绝大多数所谓的积极向上的人生态度更有意义，但总体而言，仍然是无力和苍白的...\n而且这里对普通人和p民的定义，很值得各位看官琢磨一番，不要以为你钱多就不是普通人，更不要以为自己在所谓体制内就不是普通人，别傻了.......",
			"added": 1627975389
		},
		{
			"topic_id": 1629644367,
			"title": "鼎盛上的那个总舵主，本来就是个傻逼，这次通过张网红的事如果有人还看不清那就真的是傻逼的二次方了...",
			"body": "他当初给卫健委写的那些东西，从其在论坛贴出来炫耀的部分看，其实也无非就是才网上抄了其他网友的一些有分量的帖子而已，比如超大上铁骑突出的帖子，尤其是去年初疫情突发时，铁骑关于处理大型突发性公共卫生危机处理的帖子，当然我相信他肯定不会忘记把他的一些如果单独提出决不会有人理财的“私货”趁机夹带进去。\n据说卫健委还将这当成宝了，呵呵，也不知道是纯瞎吹还是半真半假，卫健委当然然也谈不上高明，疫情最初的连续几次诊疗方案都有种种问题，但后面也不断在改进，应该还不至于把这种货色当宝吧。\n至于这次张网红的事情，我根本懒得说，有些人要当傻逼的二次方，那是他们的自由，傻并快乐着确实本来就是一种生活方，我尊重所有人自主选择的生活方式...\n另外，从这些年鼎盛上某些人的种种表现看，很显然他们之所以在那里泡着其实就是希望有更多人变成傻逼的二次方，这，当然也是一种生活方式....",
			"added": 1629644309
		},
		{
			"topic_id": 1632322744,
			"title": "中国打破连续4个月抛售美债状态,470吨黄金运抵中国",
			"body": "据世界黄金协会公布的《全球黄金需求报告》显示，中国7月份黄金进口总量为55吨，6月份的黄金净进口量为68吨，使得4至7月的总进口量达到302吨，比去年同比增加达200吨。而Zerohedge在9月15日跟进报道称，瑞士对中国的黄金出口也在4至8月飙升至2019年以来的最高，其中最新的一批在6至8月份约有175吨从欧美市场运至中国。当这些数据累积到一起，我们发现，自2021年以来，至少大约470吨黄金已运抵中国。\n\n　　值得一提的是，该美媒稍早前还报道称，自从没有向国际货币基金组织或世界黄金协会报告一些收购数据以来，大批黄金或已运至中国市场。",
			"added": 1632322685
		},
		{
			"topic_id": 1633242894,
			"title": "我越来越感觉这事蹊跷............",
			"body": "意大利一市长拒打疫苗不能进办公楼 户外搭棚办公\n\n环球网资讯\n2021-09-27 15:27\n中新网9月27日电 据欧联网援引欧联通讯社报道，近日，意大利威尼托大区特雷维索省圣卢恰迪皮亚韦小镇市长宣布，坚决拒绝施打新冠疫苗，不使用绿色通行证，他将在自己的市长办公室大楼外搭建棚屋进行办公，并接待市民来访。\n\n据报道，圣卢恰迪皮亚韦小镇市长苏姆斯基除了担任市长外，还是一名家庭医生，为当地1500名居民提供服务。\n\n苏姆斯基市长公开强调，自己没有接种新冠疫苗。他表示，自己并不是反疫苗者，但自己不打算服从这一荒谬的疫苗接种规则。为此，他多次与通知他接种疫苗的卫生机构和医生发生冲突，最后索性自己给自己出具一份医疗证明，以证明自己因健康原因不宜接种疫苗，达到疫苗豁免目的。\n\n苏姆斯基解释说，自己也不会走上街头大喊不要接种疫苗，但对走上街头反疫苗者抱有极大的宽容。他认为反疫苗者应该有言论自由，而不能被视为犯罪。对于一些不愿意接种疫苗的人，苏姆斯基更是无私地提供帮助。几天前，苏姆斯基曾给一名当地教师出具了一份疫苗豁免证明，以证明这名教师因身体原因无法接种疫苗。\n\n然而，当这名教师向学校出示苏姆斯基签署的疫苗豁免证明时，引起了校方的怀疑，校方向当地卫生部门求证了该证明的真实性，结果是该证书无效。因为这名教师并非苏姆斯基医生的病人，因此苏姆斯基无权为这名教师开具疫苗豁免证书，为此当地卫生部门决定对所有疫苗豁免证明进行复核。\n\n意大利政府决定从10月15日开始，要求所有公共和私营场所的工作人员，进入工作场所必须使用绿色通行证。为此，苏姆斯基市长决定，再次对抗绿色通行证规则。他表示，自己将不再进入市长办公室进行办公，从9月27日开始，将在市政厅门口搭一个简易凉棚为市民提供服务，自己做一名凉棚市长。(黄鑫)",
			"added": 1633242834
		}
	],
	"topic_vote": {
		"1610367113_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1612085833_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1612456316_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1611754914_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1612756376_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1613311203_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1616138585_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1617985862_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1617985305_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1622004945_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1625670101_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1622469835_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1626686044_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"1629822978_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"1625850007_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1
	},
	"next_comment_id": 94,
	"comment": {
		"1609428015_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 1,
				"body": "飞得更高",
				"added": 1609428041
			},
			{
				"comment_id": 2,
				"body": "> [franksky](#comment_1_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): 飞得更高\n\n论坛测试..",
				"added": 1609520488
			},
			{
				"comment_id": 3,
				"body": "> [franksky](#comment_2_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): 论坛测试..\n\n继续测试.....",
				"added": 1609589750
			},
			{
				"comment_id": 5,
				"body": "> [franksky](#comment_1_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): 飞得更高\n\n更高....",
				"added": 1610358027
			}
		],
		"1609913282_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 4,
				"body": "留着这个做靶子，让网友们来批判吧....",
				"added": 1609915397
			}
		],
		"1610360172_15gQXb6GM4HHVVwqdKr7ZdKB3NK8E8hb4g": [
			{
				"comment_id": 6,
				"body": "欢迎......",
				"added": 1610360390
			}
		],
		"1610367113_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 7,
				"body": "欢迎.....",
				"added": 1610376167
			},
			{
				"comment_id": 38,
				"body": "> [liubin0867](#comment_1_14D72Zz5EhGScdaomBP2fR6bfdk4Bc8v9u): 报道\n\n呵呵，欢迎欢迎....",
				"added": 1612504256
			}
		],
		"1610376321_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 8,
				"body": "都有军方背景，这反倒让人感觉怪怪的....",
				"added": 1610377288
			},
			{
				"comment_id": 9,
				"body": "都有军方背景，这反倒让人感觉怪怪的....",
				"added": 1610377316
			},
			{
				"comment_id": 10,
				"body": "转一个发哥爱币的评价\n\nZEN，大零币ZEC的小孙子。\n\nZEN，由大零币Zcash的分叉币Zclassic分叉而来，是ZEC的小孙子。个人认为，ZEN太一般了，没有自已的特色技术。\n\n1.ZEC家族小辈。ZEC拥有匿名币中最牛的技术零知识的证明，进而出现许多应用、改进零知识证明的项目，如科莫多币KMD搡合了ZEC零知识证明和BTC的安全性，创新度不错；XZC改造了零知识的证明，形成的零币协议匿名性更好；超零币SERO应用零知识证明的同时，引入图灵完备的智能合约，是匿名币中唯一使用智能合约的；ARPA应用零知识证明时，引入隐私计算；ZEL更牛，类似于BTC+ZEC+ETH”，比特币的安全有了，ETH的智能合约也有了，币圈牛人赵长鹏也高度点赞。ZEN一味的分叉再分叉，没有特色。\n\n2.没有过硬的技术创新。ZEN作为ZEC的孙子（分叉路线：Zcash-Zclassic-Zencash），没有叫得响的技术创新，主要是在矿工利益、融资模式等鸡毛蒜皮的小事上有些改进，无法与匿名币三大天王XMR、DASH、ZEC相比。",
				"added": 1610378367
			},
			{
				"comment_id": 11,
				"body": "再顶一下..",
				"added": 1610379654
			},
			{
				"comment_id": 12,
				"body": "欢迎大家发进一步的技术细节资料..",
				"added": 1610380088
			}
		],
		"1610380247_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 13,
				"body": "顶一下...",
				"added": 1610381010
			},
			{
				"comment_id": 15,
				"body": "再顶一下..",
				"added": 1610440379
			}
		],
		"1610427293_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 14,
				"body": "顶一下..",
				"added": 1610427824
			},
			{
				"comment_id": 28,
				"body": "> [nekox](#comment_1_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF): 不管怎么样，拜登是合法总统\n\n选票都没有统计完，结果自然不确定，这种情况下迫不及待认定拜登是合法总统，显然是不合适的，我不想说是谄媚，但至少透露出了两点重要信息：\n1、特朗普的做法真的让中国某些高层很难受，很痛苦，而这无疑表明特朗普，乃至整个美国政府和智囊的政策大方向是正确的。\n2、统计结果都没有确定就先祝贺拜登当选，而且还有种种其他表示，这在整个中国外交史上应该是没有先例的，说明中方迫切希望通过拜登出台缓和政策，而且这种意图急迫，以至于几乎到了迫不及待的程度，通常这种意图一旦被对方掌握，也就不可能达成了。（这真的没有谄媚吗？）\n实际上从后续的进程来看，米帝内部围绕此次大选已经出现了明显的分裂，而且严重对立，甚至出现了明确的政变情况，以及暴乱，通常任何国家出现这种情况，都意味着他国可以从中获利甚至从对立的两方同时获利，而中方由于之前的提前祝贺，以至于无法在这过程中非但不能获利，甚至都不敢轻易说话。因为既不敢再得罪特朗普，怕其无所顾忌狗急跳墙，又怕惹恼拜登以至于提前祝贺等的一切都变成沉没成本。以至于如此大好机会，完全无所作为，连风凉话都不敢说一句....\n那么，这么一次没有先例的外交行为，选票都没统计完就提前祝贺，甚至比米帝国内都着急，而这么上赶着，最后拜登给了好脸色吗？热脸是否贴了冷屁股，各位心里明白。\n另外，我个人觉得更可能的是外交部不应该这么差劲，唯一的可能是蓬佩奥启动了其暗藏在外交部的卧底，主导了此次没行动，蓬佩奥是CIA的前局长，为此他还专门拿台湾问题做了掩护，搞得好像是他捅了台湾问题，于是外交部作为回应和反击，于是祝贺了拜登，实际这种掩护何其蹩脚...",
				"added": 1611910658
			},
			{
				"comment_id": 29,
				"body": "写得懒得再这破事上再动脑筋，> [franksky](#comment_28_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): 选票都没有统计完，结果自然不确定，这种情况下迫不及待认定拜登是合法总统，显然是不合适的，我不想说是谄媚，但至少透露出了两点重要信息：1、特朗普的做法真的让中国某些高层很难受，很痛苦，而这无疑表明对美方而言，特朗普，乃至整个美国政府和智囊的政策大方向是正确的。2、统计结果都没有确定就先祝贺拜登当选，而且还有种种其他表示，这在整个中国外交史上应该是没有先例的，说明中方迫切希望通过拜登出台缓和政策，而且这种意图急迫到了迫不及待的程度，通常这种意图一旦被对方掌握，也就不可能达成了，更何况如此急迫。（这真的没有谄媚吗？）\n实际上从后续的进程来看，米帝内部围绕此次大选已经出现了明显的分裂和严重对立，甚至出现了明确的政变，以及暴乱的情况，通常任何国家出现这种态势，都意味着他国可以从中获利甚至从对立的两方同时获利，而中方由于之前的提前祝贺，以至于在这过程中非但不能获利，甚至都不敢轻易说话。因为既不敢再得罪特朗普，怕其无所顾忌狗急跳墙，又怕惹恼拜登以至于提前祝贺等的一切都变成沉没成本。以至于如此大好机会，完全无所作为，连风凉话都不敢说一句....那么，这么一次没有先例的外交行为，选票都没统计完就提前祝贺，甚至比米帝国内都着急，而这么上赶着，最后拜登给了好脸色吗？热脸是否贴了冷屁股，各位心里明白。另外，我个人觉得更可能的是外交部不应该这么差劲，唯一的可能是蓬佩奥启动了其暗藏在外交部的卧底，主导了此次没行动，蓬佩奥是CIA的前局长，为此他还专门拿台湾问题做了掩护，搞得好像是他捅了台湾问题，于是外交部作为回应和反击，于是祝贺了拜登，实际这种掩护何其蹩脚...\n\n写得匆忙，大家凑合看吧，我也不打算再为这些破事花时间了...",
				"added": 1611912985
			}
		],
		"1610686589_1JagayLcgq3wK9fJ24Z3RMFepXb92fS9G7": [
			{
				"comment_id": 16,
				"body": "呵呵，楼主好像心态有些急啊....",
				"added": 1610689610
			},
			{
				"comment_id": 18,
				"body": "嗯，如楼上所言为什么现在已经出现许多非常优秀的数字货币，其中不乏远比比特币技术更好，性能更优的，但即使如此，这些新币也无法对比特币进行挑战，这中间的道理确实值得认真思考...",
				"added": 1610776326
			}
		],
		"1610712728_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 17,
				"body": "乱世必定要强有力的政治人物才能处理好，所谓强有力一方面指对制造混乱的势力进行强力镇压，另一方面必须要有强有力的政治、行政手段来进行治理和管控，而这种强有力的，具备强力军事、政治、行政手段的强力人物，在我印象中西方上一次出现是第三帝国时刻......",
				"added": 1610776066
			},
			{
				"comment_id": 33,
				"body": "股市的盘外招引发了不少事情，对抗一旦加剧，就可能引发混乱，然后军队或许就能顺利入场了，华尔街犹太富豪务必要考虑到这一点，自己的死穴不是P民，而是裹挟了民意的武装暴力集团...",
				"added": 1611982213
			}
		],
		"1610872035_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 19,
				"body": "“当马可波罗将从中国（元朝）带回的纸币交给欧洲的高官，并声明在中国这种小纸片每张等于10个金币时，后者对其无不嗤之以鼻...”\n\n这与我们很多人时至今天仍大谈比特币看不见摸不着完全是骗局的说法何其相似...",
				"added": 1610874442
			}
		],
		"1609918564_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 20,
				"body": "再顶一下...",
				"added": 1610959881
			},
			{
				"comment_id": 31,
				"body": "希望大家多多宣传这个...",
				"added": 1611913259
			}
		],
		"1611125162_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 21,
				"body": "顶一下....",
				"added": 1611209292
			},
			{
				"comment_id": 22,
				"body": "顶一下....",
				"added": 1611209301
			}
		],
		"1611387493_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 23,
				"body": "我以为从这个专利的摘要内容看，出字节跳动显然有心进入数字货币领域，但却对什么是数字货币完全一无所知...",
				"added": 1611391140
			},
			{
				"comment_id": 24,
				"body": "于此同时，其对如何卡位，如何抱住有关部门的大腿，已经有了相当深入的研究....",
				"added": 1611391309
			}
		],
		"1611397307_1KDd8Avax31GXJCYRvteu4NxWdnGCsvP1M": [
			{
				"comment_id": 25,
				"body": "你的站点还是有问题，系统提示如下：\nTRACKERS ANNOUNCING: 1, ERROR: 3, DONE: 11\nCONTENT.JSON 下载失败",
				"added": 1611407754
			}
		],
		"1611580236_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 26,
				"body": "各方都在观望，所以，现在也是类似Tether等非官方机构可以生长的窗口期.....",
				"added": 1611633392
			},
			{
				"comment_id": 27,
				"body": "估计还要不少时间。",
				"added": 1611749158
			}
		],
		"1611912258_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 30,
				"body": "一切都只是刚刚开始....",
				"added": 1611913064
			},
			{
				"comment_id": 32,
				"body": "最新的消息是，连论坛都被封了，P民最重要的就是召集，聚集，所以插头要早拔，电门要早关。现在米帝一个盘外招就能把散户打回原形。今后散户再想召集起来估计就难了，只要资本堵上这个漏洞，散户想聚集起来也没有了传播召集的能力。",
				"added": 1611981801
			},
			{
				"comment_id": 34,
				"body": "美国证券交易委员会（SEC）29日就最近的股市狂潮发表评论，表示正在审查潜在的不当行为，并将审查经纪人停止某些股票交易的决定。\n如果是在中国，估计就直接把某些P民逮捕了吧，妖言惑众，扰乱金融市场，坐个3年劳不算长，相关做多交易直接作废，做多资金直接没收嘛，自然是依法处理，呵呵，根本到不了拔插头这一步。",
				"added": 1611983592
			}
		],
		"1612085833_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 35,
				"body": "同时，现在已经暴出，某些疫苗效果并不好，各国纷纷出现新的变异，某些变异不仅感染能力和致死率都有提高，而且南非等地出现了能逃避免疫抗体的变异，在这种情况下，在可预见的未来，全球从整体层面恢复正常工农业生产和物流秩序的可能性在全面降低。\n　　各国为对抗上诉情况，必定大发货币，某些强势货币甚至会做得更狠，以期从全球范围内抢购重要抗疫和战略物资，在这种情况下，全球金融经济和货币贸易将发生深刻变化，许多传统强势货币的价值将会降低，战略物资重要工业品的价格可能出现大的波动，优质资产的价格将飙升，寻求新的公认的全球货币的需求将会进一步出现....",
				"added": 1612086616
			},
			{
				"comment_id": 36,
				"body": "和平收古董，乱世藏黄金，而实体黄金和数字黄金相比，哪个更好藏，哪个不怕偷不怕抢，哪个不用担心真假，不用担心成色，哪个携带更轻松，哪个可以轻松过海关等等等等，都是不言而喻的...",
				"added": 1612092510
			}
		],
		"1612456316_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 37,
				"body": "看来如我之前所说，有人对军队越来越不放心了，严格说来，这大方向肯定是对的，必须肃反。\n　　没有肃反，苏联抗不过元首的闪电战，没有肃反，毛主席也扛不过蒋介石2万5千里的围追堵截，没有清党肃反，蒋中正先生不可能真正掌握大权，更不可能把中央苏区和上海地下党彻底荡平，并扛住日寇的几板斧，肃反才是保持生命力的根本。\n　　没有经历过肃反的上海地下党彻底覆灭，没有经历过肃反的东北抗联同样基本覆灭，苏联在二战后再也不搞肃反，因此完蛋只是时间问题，国民党搞过一次后同样也再不搞肃反，结果大好江山和800万军队，二战后数年便荡然无存。某大国也很多年不搞肃反了，情况如何我不知道，相信肯定有人知道。\n　　不过米帝的这种肃反是否会有效？答案是不可能有效，肃反的效果取决于手段是否足够残酷，米帝在目前情况下应该是做不到位的，所以无法真正解决问题的，拉仇恨的效果估计会不错，所以还是尽早做最坏的打算比较好....",
				"added": 1612457189
			}
		],
		"1612257384_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 39,
				"body": "所以要点应该还是比特币吧，英国已经快乱了，如果美国再乱，无法庇护犹太，全球仇恨犹太，觊觎犹太财富的可不是一般的多，估计无论逃到哪里都将被宰割，现在犹太的财富可比上世纪元首那会儿多了不知道多少万倍，怎么办？？\n放瑞士银行当然不靠谱，存任何银行都不靠谱，把财富变成不好搬，不好藏，价值还可能持续下跌的黄金更是愚不可及，没有什么比比特币更好了，而且未来还有很大的增值空间.....",
				"added": 1612519526
			}
		],
		"1611754914_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 40,
				"body": "再次出现无法发布的情况，希望能有更多人，收藏关注并做种....",
				"added": 1612676361
			}
		],
		"1611120613_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 41,
				"body": "希望大家多关注，多收藏（首页左侧菜单的隐月社区那一栏的三点菜单里点收藏），如有长时间在线的主机愿意做种子最好不过，多谢了...",
				"added": 1612706499
			},
			{
				"comment_id": 43,
				"body": "> [liubin0867](#comment_3_14D72Zz5EhGScdaomBP2fR6bfdk4Bc8v9u): 我这几天一直在线的  单位电脑  我会一直挂着\n\n多谢！多谢！",
				"added": 1612757181
			}
		],
		"1612678756_14D72Zz5EhGScdaomBP2fR6bfdk4Bc8v9u": [
			{
				"comment_id": 42,
				"body": "大的趋势肯定是涨，不过涨到什么程度，不好说。同时短期的震荡也会有，所以不要碰杠杆，不要碰期货...",
				"added": 1612757046
			},
			{
				"comment_id": 59,
				"body": "> [xyz2000](#comment_1_1QHrCLPFrPevjYFptDpB36LtrATxqo8zqR): 1、以这个速度，这次不会到年底才冲顶吧，应该提前了。2、黄金的市值算，比特币要40万美元吧，对于这波牛市来说似乎太高了。\n\n全世界各国，各大机构的财富，相当一部分都保存在黄金里，只有把黄金拉爆，通过数字货币将存储其中的价值尽可能收割，米帝才能度过此次难关。也只有这种级别的对全球核心财富的彻底大收割才有可能让米帝度过这一波大危机（新冠+种族+党争+....），其他途径都只是等死...\n与此同时，数字货币也只有将黄金拉爆，才有可能真正站住脚，由此美元才有可以依止的抓手，美元有抓手才有可能在这一波危机中立住，米帝未来才有东山再起的本钱。\n现在这种滥发钱，什么都靠美元来救，无论美股、民生、疫情，全部都勒在美元身上的做法是饮鸩止渴，杀鸡取卵，走不通的...",
				"added": 1614427498
			}
		],
		"1612756376_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 44,
				"body": "墨西哥第三大富豪Ricardo Salinas Pliego刚刚将自己的Twitter简介改为比特币。此前消息，马斯克、Reddit联合创始人纷纷将推特简介改为Bitcoin。Ricardo Salinas Pliego曾表示比特币是他“有史以来最好的投资”。虽然比特币最初是作为一种“支付工具”引起Salinas的注意，但他后来意识到，真正让比特币有价值的是它的存储价值。根据《福布斯》杂志，Salinas位列全球富豪榜第106位，净资产132亿美元。",
				"added": 1612762792
			},
			{
				"comment_id": 46,
				"body": "2月9日，美国迈阿密市长Francis Suarez在推特上透露，其正在为本周四的会议制定一项决议，以将比特币纳入迈阿密市的资产负债表。",
				"added": 1612846766
			}
		],
		"1612708718_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 45,
				"body": "今日再次在推特发布狗狗币“教学视频”，直接带货了？\n如果我所料不错，所有有头有脸的人物，未来最终都要下海，要么喊单要么直播带货，只看是为哪个币....",
				"added": 1612763442
			}
		],
		"1612792394_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 47,
				"body": "来源：金融界网\n\n　　金融界网2月9日消息，埃隆马斯克Elon Musk旗下的特斯拉今日刚刚宣布买入15亿美元比特币，RBC Capital Markets认为苹果可能是下一家购买加密货币的公司。\n\n　　RBC Capital Markets分析师Mitch Steves周一在致客户的一份报告中表示，如果苹果公司决定进入加密交易业务（价值数十亿美元的行业），该公司有望立即获得市场份额，扰乱该行业（同时使美国在未来10-20年成为加密领域的领导者）。这家华尔街机构表示，这一业务有望给这家科技巨头每年带来超过400亿美元的潜在收入。RBC Capital Markets将苹果公司评级为跑赢大市，12个月的目标股价为每股171美元，较该股当前股价高约13％ 。\n\n　　特斯拉向美国证券交易委员会（ SEC ）提交的一份文件显示，该公司购买了价值15亿美元的比特币。特斯拉股价周一早盘上涨逾2％ 。特斯拉在提交的文件中表示，它购买比特币是为了更灵活地进一步实现资金多样化，最大限度地提高现金回报率。此外，特斯拉还表示，该公司旗下产品将开始接受比特币支付，但须遵守适用法律，而且最开始也将会有诸多限制。RBC表示，如果苹果为其资产负债表购买价值10亿美元的比特币（约为其4天现金流），将为“苹果交易所”吸引更多用户。Steves说，此外，如果苹果收购了比特币资产，比特币的价格会走向何方？在他看来，很可能会上升。在特斯拉购买比特币的消息公布后，比特币价格上涨超过11％ ，超过43000美元。\n\n　　RBC指出，支付公司Square每季度在大约3000万活跃安装用户基础上产生约16亿美元的比特币相关收入。考虑到苹果的安装基数为15亿，估计约有2亿用户将使用这一数字资产进行交易，这一机会规模是Square的6.66倍。Steves说，苹果的基本面仍然安全，其现金流业务涉及iPhone 、外围设备、电脑和服务。不过，该公司在投资新一代芯片的同时，只需点击几下鼠标就可以解锁一个数十亿美元的机会。\n\n　　苹果没有表示将收购加密公司，这对该公司来说将是一个不寻常的举动。在首席执行官蒂姆库克的领导下，苹果对巨额现金储备持保守态度。",
				"added": 1612847376
			},
			{
				"comment_id": 48,
				"body": "由于建行某债券发行部门已经垂范在先，因此国内各领域的大佬们估计都会装作什么都没发生，他们也什么都没看见，而海外的各种剧则注定层出不穷，高潮迭起。\n不过我想，把脑袋埋在沙子里装鸵鸟总归不是办法，而越晚把头抬起来，似乎越尴尬，因为越早表态，才越智慧，越知识，赚得也越多，所以到底该怎么做，确实是个问题.....",
				"added": 1612847774
			},
			{
				"comment_id": 49,
				"body": "摩根大通报告表示，可别指望其他大公司跟风效仿，也像特斯拉一样把比特币加入资产负债表。主流企业财务部门效仿特斯拉这个想法的主要问题在于比特币的波动率。若在组合配置中加入1%的比特币，“将导致整体投资组合波动大幅增加”，并表示由于比特币80%的年化波动率，在这种配置下投资组合的波动率要上升到8%。\n--------\n\n希望摩根是对的，我也希望大公司先别进场，他们越晚进场才越好。\n特斯拉进场还是太早了，如果等到8-10万刀在进场我感觉会比现在更好，苹果、谷歌、亚马逊之类至少要20万刀以后，在此之前进场对我而言都是坏消息...\n\n老牌投行也商行最起码也要等下一波。",
				"added": 1612931563
			}
		],
		"1612935801_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 50,
				"body": "我个人非常希望摩根是对的，希望各大公司千万先别跟进，我以为他们越晚进场才越好。\n即使是特斯拉，我以为进场还是太早了，如果等到8-10万刀在进场我感觉会比现在更为良好，苹果、谷歌、亚马逊之类至少要20万刀以后，在此之前进场对我而言都是坏消息...\n　　老牌投行和商行最起码也要等下一波，至于各国央行，最好是等所有人，全球60亿人都进场之后，在一个个慢慢宣布认可比特币。",
				"added": 1612936007
			},
			{
				"comment_id": 51,
				"body": "摩根大通联席总裁平托( Daniel Pinto)对媒体表示，客户对比特币的需求目前还不大，但肯定这种情况在某个时候会改变。他称：“如果随着时间的推移，一种新的资产类别发展起来，且将被不同的资产管理公司和投资者使用，我们将不得不参与进来。但目前还没有需求，相信在某个时候会有的。”",
				"added": 1613140535
			}
		],
		"1613196669_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 52,
				"body": "不知道消息是否属实，大家先姑且一看吧....",
				"added": 1613196811
			}
		],
		"1613311203_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 53,
				"body": "欢迎通过比特币支持，请发送到：1Dm27dNHpWAcXa7YhmjFXjGTPRrp1iv4ao  谢谢。",
				"added": 1613366152
			},
			{
				"comment_id": 63,
				"body": "看起来是朝着这条路开始动了....",
				"added": 1615645541
			}
		],
		"1613398063_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 54,
				"body": "这个事暂不做评论...",
				"added": 1613453513
			}
		],
		"1613031652_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 55,
				"body": "对我而言，这些大公司越晚进场才越好，至少也要20万刀之后进场，现在进场，甚至这一波行情进场都是坏消息....",
				"added": 1613722589
			},
			{
				"comment_id": 56,
				"body": "2月19日消息，据国外媒体报道，微软联合创始人比尔盖茨（Bill Gates）也是一位在比特币问题上置身事外的知名科技界人士。在接受采访时他表示，自己对比特币持中立态度。\n\n他表示，既没有投资比特币，也不想对比特币的价格走势做出预测。不持有比特币，也没有做空比特币。“比特币的涨跌可能只是基于狂热或各界对其的看法。我无法预测它将如何发展。”\n\n然而，这位微软联合创始人似乎暗示，许多人在发展中国家之外使用数字货币进行“避税或非法活动”。在2018年，盖茨也曾批评过加密货币交易的匿名性，并将其与购买非法药物的人联系起来。\n\n虽然盖茨已不是微软董事，但在加密货币问题上，他与微软公司立场相似。微软总裁布拉德史密斯（Brad Smith）暗示过，该公司暂时没有投资比特币的计划。",
				"added": 1613723309
			}
		],
		"1613829732_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 57,
				"body": "IMF：央行须变得更像苹果以保证央行数字货币处在技术前沿\n\n澎湃新闻记者 蒋梦莹\n\n\n疫情之下，全球数字货币的研发突飞猛进。据国际清算银行（BIS）最新统计，目前数字货币推进至实证阶段的央行占比已超过60%，同比增长20%；中国也已在多地进行数字人民币的试点；与此同时，比特币总市值突破万亿美元大关。\n\n2月19日，国际货币基金组织（IMF）发布了题为《数字时代公共货币和私人货币可共存》（Public and Private Money Can Coexist in the Digital Age）的文章。该文章的作者是IMF金融顾问兼货币与资本市场部主任Tobias Adrian和IMF货币与资本市场部的副处长Tommaso Mancini-Griffoli。\n\n文章称，纵观历史，私人发行的货币和公共发行的货币一直是共存的。当今世界也以双重货币体系为特征，在中央银行发行公共货币的基础上，各种类型的银行、电信公司或专门的支付服务提供商也发行私人货币。一方面私人部门提供创新和多元化，另一方面公共部门确保稳定性和效率，其中一方面增强的同时，另一方面往往减弱，由各国尤其是各国央行处理其中的权衡取舍关系。\n\n文章提出，央行不应仅做出二选一的抉择：要么发行央行数字货币，要么鼓励私人部门提供自己的数字货币。这两者可以共存和互补，例如，可以通过央行在设计上做出某些选择以及调整其监管框架来实现。\n\n文章坦言，央行必须变得更像苹果或微软公司一样，以保证央行数字货币处在技术前沿，成为用户钱包中主要和首选的数字货币形式。\n\n文章认为，与私人部门建立合作关系依然可能，央行无需孤军奋战。\n\n首先，央行数字货币的设计可以鼓励私人部门在其基础上开展创新，就像应用程序设计人员给手机及其操作系统开发出有吸引力的功能。通过访问一组开放的指令（“应用程序编程接口”）可以扩展央行数字货币的可用性，而非仅仅提供普通的电子钱包服务。\n\n第二，一些央行可以允许其他形式的数字货币同时存在（类似于平行操作系统），同时利用央行数字货币的结算功能和稳定性，这将为更快的创新和产品选择打开大门。这种形式的数字货币（过去称为合成货币）完全可以与央行数字货币共存。\n\n值得一提的是，国际清算银行行长卡斯滕斯（Agustín Carstens）在最近的讲话中亦强调，央行数字货币（CBDC）可以也必须被设计成公私合作关系来维护双层金融体系，不应只考虑中央银行直接提供零售服务的模式，不能排除私营部门可发挥重要作用。\n\n中国人民银行前行长周小川曾在公开演讲中指出，数字人民币（DC/EP）是一个双层的研发与试点项目计划。在DC/EP这个双层系统里，人民银行在第一层，第二层有商业银行、电信营运商，还有互联网支付平台，他们之间可以合作或联合，这取决于他们对支付产品和技术框架的了解。\n\n附：数字时代公共货币和私人货币可共存\n\n我们重视创新和多元化——包括在货币领域。一天中，我们既可以通过刷卡、手机、上网等各种方式来支付，也可以用钞票和硬币支付——尽管在许多国家，现金的使用越来越少。\n\n当今世界以双重货币体系为特征，在中央银行发行公共货币的基础上，各种类型的银行、电信公司或专门的支付服务提供商也发行私人货币。这一体系虽然并不完美，但也有着显著的优势，包括主要由私人部门提供的创新和产品多元化，以及由公共部门确保的稳定性和效率。\n\n一方面是创新和多元化，另一方面是稳定性和效率，这两方面的目标是相互关联的。其中一方面增强的同时，另一方面往往减弱。这是各国尤其是各国央行必须处理的权衡取舍关系。央行应在多大程度上依赖私人部门，在多大程度上依靠自身的创新？这在很大程度上取决于偏好、现有技术和监管效率。\n\n所以，当一项新技术出现时，我们很自然地会问，当今的双重货币体系将如何演变。如果数字现金（称为央行数字货币）真的出现，它是否会取代私人机构发行的货币，还是会让私人货币繁荣发展？第一种情况总是可能的——通过实施更严格的监管。我们认为，如果将当前双重货币体系的逻辑扩展开来，第二种情况仍是可能的。重要的是，央行不应只能在以下二者中选择其一：要么发行央行数字货币，要么鼓励私人部门提供自己的数字货币。这两者可以共存和互补，例如，可以通过央行在设计上做出某些选择以及调整其监管框架来实现。\n\n公共货币与私人货币共存\n\n纵观历史，私人发行的货币和公共发行的货币一直是共存的，这可能令人困惑。私人货币创新性更强、更加方便、对用户更友好、适应性更强，它们为什么没有完全占据支配地位呢？\n\n答案在于一种基本的共生关系：私人货币可以被兑换成完全安全且流动性好的公共货币，无论是钞票和硬币，还是部分银行持有的央行储备。\n\n能够按固定面值兑换成央行货币的私人货币就成为一种稳定的价值储存手段。银行账户中的10美元可以换成一张10美元的钞票，作为法定货币偿付债务。这个例子看似简单，但背后隐藏着复杂的支撑基础：完善的监管，政府的支持（如存款保险和最后贷款人职能），以及央行储备的部分或全部支持。\n\n此外，私人发行的货币只有在能够兑换成央行货币的情况下，才成为一种高效的支付手段。安妮在银行A的10美元能够转到鲍勃在银行B的账户，因为这笔钱在这一过程之中兑换成了央行货币——一种两家银行都信任、持有且能够交换的资产。结果是，这种私人发行的货币变得具有互操作性。因此也产生了竞争，因为安妮和鲍勃可以把钱存在不同的银行，而且还可以互相支付；同时，在货币的实际形式方面，也带来了创新，实现了多元化。\n\n简言之，对于私人机构发行的货币，无论是银行账户还是其他形式，能够兑换成央行货币这一性质对于其稳定、互操作性、创新和多元化都非常重要。\n\n一个仅有私人货币的体系风险太高。而一个仅有央行货币的体系则可能错过重要的创新机会。这两种形式的货币相互促进，从而形成了当前的双重货币体系——这种平衡关系发挥了有益的作用。\n\n数字时代的央行货币将面临挑战\n\n今后，当我们步入数字时代之际，这一体系会怎样演变？央行发行的数字货币会不会有如此大的吸引力，以至于抑制私人货币的发展？或者说在央行货币存在的同时，私人部门还能否继续创新？这在很大程度上取决于各国中央银行持续推进重大创新的能力和意愿。紧跟技术革新、用户需求的快速变化以及私人部门创新的步伐并非易事。\n\n央行数字货币类似于智能手机及其操作系统。在基本层面上，它们是一种结算技术，实现货币的储存和转移，在很大程度上类似于手机处理器、内存和相机之间的信息转移。在另一个层面上，它们是货币的一种形式，具有特定的功能和外观，很像一个操作系统。\n\n因此，央行必须变得更像苹果或微软公司一样，以保证央行数字货币处在技术前沿，成为用户钱包中主要和首选的数字货币形式。\n\n比起更新纸钞上的防伪特征，数字时代的创新要复杂、迅速得多。例如，央行数字货币最初可能通过一个中央数据库管理，但随着技术趋于成熟，可能转向分布式账本（在一个网络内自动保存和更新的同步登记账户），并且在取得重大技术进步之后，一个账本可能很快被另一个账本取代。手机和操作系统至少每年也有重大更新。\n\n此外，在数字时代，用户需求和预期很可能变化更快、更难以预测。信息和资产可能转到分布式账本，要求同一网络上的资金实现货币化。货币可能以全新的方式转移，包括通过嵌入日常产品的芯片自动转移。这些需求可能要求货币具有新的特征，因此需要频繁地重新设计架构，也需要实现多元化。今天甚至明天的货币都很难满足后天的需要。\n\n压力也将来自供给一方。私人部门将继续创新。新的电子币和稳定币方案将会出现。随着对这些产品的需求不断增加，监管机构将努力控制风险。一个问题将不可避免地出现：这些形式的货币将如何与央行发行的数字货币相互作用？它们是否会单独存在，或者其中一些会整合到双重货币体系，在该体系中，私人货币和央行货币相互促进？\n\n与私人部门建立合作关系依然可能\n\n跟上技术变革、用户需求和私人部门竞争的步伐对各国央行来说具有挑战性。然而，央行无需孤军奋战。\n\n首先，央行数字货币的设计可以鼓励私人部门在其基础上开展创新，就像应用程序设计人员给手机及其操作系统开发出有吸引力的功能。通过访问一组开放的指令（“应用程序编程接口”），一个充满活力的开发者社群可以扩展央行数字货币的可用性，而不仅仅是提供普通的电子钱包服务。例如，他们可以使自动支付变得更加容易，货物即收即付；或者，可以建立一个查找功能，这样仅根据朋友的电话号码就可以把一笔钱转给她。关键是审查这些附加服务，保证其充分安全。\n\n第二，一些央行甚至可以允许其他形式的数字货币同时存在（很类似于平行操作系统），同时利用央行数字货币的结算功能和稳定性。这将为更快的创新和产品选择打开大门。例如，一种数字货币可以在结算速度上做一些妥协，让用户对支付自动化有更大的控制权。\n\n这种新形式的数字货币会是一种稳定的价值储存手段吗？是的，如果它能以固定面值兑换成央行货币（数字或非数字货币）的话。在得到央行货币充分支持的情况下，这将是可能的。\n\n这种形式的数字货币会是一种高效的支付手段吗？回答也是肯定的，因为在任何一个数字货币网络中，结算都是即时的，就像在同一家银行不同账户之间的结算。并且，这些网络具有互操作性，只要安妮的数字货币提供商向鲍勃的数字货币提供商进行的支付是通过央行数字货币的相应转移来结算的，正如当前双重体系的情况。\n\n这种形式的数字货币（过去称为合成货币）完全可以与央行数字货币共存。这需要一个发照安排和一套监管规定以实现公共政策目标，包括运营韧性、消费者保护、市场行为和竞争性、数据隐私，甚至还包括审慎稳定要求。与此同时，可以通过数字身份和辅助数据政策来确保金融诚信。与央行合作要求充分遵守监管规定。\n\n经久不衰的体系\n\n各国在推行央行数字货币时，应考虑如何利用私人部门。当前的双重货币体系可以扩展到数字时代。央行货币加上有效的监管，将继续对确保支付系统的稳定性和效率发挥关键作用。私人发行的货币可以通过创新和多元化巩固这一基础——也许比当前发挥的作用更大。私人部门和公共部门将各自在多大程度上参与货币发行？在种种可能的选项中，各国央行将作出不同选择，而这将最终取决于它们的偏好、技术和监管效率。",
				"added": 1613829839
			},
			{
				"comment_id": 58,
				"body": "上面这两条消息对照看，很值得某些人仔细琢磨....",
				"added": 1613829897
			}
		],
		"1614668960_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 60,
				"body": "我也是这些天放下其他事情，潜心琢磨了一下，算是彻底搞明白这个DeFi是在玩儿什么，怎么玩儿的，很可惜错过了不少机会，但基本上这个东西还是在我之前构想的框架内，是这个框架内的一个小部分，只是确实进展迅速，大大超过了我之前的预想....",
				"added": 1614674780
			}
		],
		"1614831363_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 61,
				"body": "所有这些人，这些机构都赚大了，最早用一份披萨交易了１万个比特币的我就不说了...",
				"added": 1614831564
			}
		],
		"1614782083_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 62,
				"body": "很多人很多机构都已经看清了形势，但另外一些人则似乎以为装鸵鸟可以多过去....",
				"added": 1615387916
			}
		],
		"1616039832_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 64,
				"body": "　　据彭博社、CNBC等17日报道，摩根士丹利成为美国第一家为客户提供比特币投资渠道的大型银行，可以让有钱的客户通过三档基金来持有比特币。\n\n　　知情人士称，该银行在一份内部备忘录中告诉财务顾问，该行将为财富管理客户提供三种与比特币相关的基金的投资渠道。摩根士丹利拒绝对此报道发表评论。\n\n　　据悉，这三款基金中有两款由知名前避险基金经理人Mike Novogratz创办的加密货币公司Galaxy Digital运营，另一款则是由资产管理公司FS Investment与比特币公司NYDIG共同管理。\n\n　　摩根士丹利是美国六大银行中首家向客户提供比特币投资渠道的银行。知情人士说，之所以推出这一服务，是应客户们的强烈要求。不过，对于向哪些客户提供这项服务，该银行有严格的要求，客户必须拥有“积极的风险承受能力”，并且在该银行至少有200万美元的资产，才能享受这一服务。据悉，这一业务可能在下个月开始提供。\n\n　　近段时间以来，比特币涨势惊人。3月13日，比特币创下61742美元的新高。\n\n　　上游新闻 毛丹 编译",
				"added": 1616039907
			}
		],
		"1616138585_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 65,
				"body": "话说得很含糊，显然是不敢明确表态，但又必须在数字货币鄙视链上占据一个较高的位置，所以不得不如此，本人对此表示非常理解。",
				"added": 1616161893
			}
		],
		"1616162180_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 66,
				"body": "记住这两家吧，在数字货币鄙视链上，这两家的位置已经确定了。\n不过这一波至少诺奖获得者没有再站出来现歪的，15年前后学术圈出来现歪的很多，其中不乏诺奖获得者，其观点现在应该还能搜到，另外长沙土话“现歪”大家可以品味一下....",
				"added": 1616162444
			}
		],
		"1616318443_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 67,
				"body": "据说中国有个卫星出事了，未知真假，各位且听且证实...\n不过这也非常好理解，在如此高级别的会谈中，被如此“吊打”，如果没有什么反应，和动作，那接下来对方的外交风格就要彻底改变了，而且注定上上下下所有人，在所有事情上的态度都会有改变，而且全球的所有其他人都会看在眼里明白在心里，特别是鹅毛、伊朗乃至朝鲜等历来喜欢以强硬姿态处理各种事物的传统对手..",
				"added": 1616473343
			},
			{
				"comment_id": 69,
				"body": "下面我们看看接下来会发生什么....",
				"added": 1616477230
			}
		],
		"1616474080_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 68,
				"body": "　　老实说我很怀疑这番话是否真的是鲍威尔说的，因为有实在太明显的基本逻辑和常识错误：“加密资产更像黄金而不是美元，更多是用于投机”，这是在说黄金的作用其实是投机？是否是媒体听错了，或者翻译翻错了，因为确实很难想象这真的是美联储主席的发言。\n　　另外特别要强调的是，美元的出路在比特币，一方面可以靠比特币彻底拉爆黄金收割全世界，一方面拉爆黄金后，可以将比特币作为美元的新的基石，重新稳住美元，这应该是米帝缓解和摆脱目前困境的唯一出路，否则民生、抗疫、美股等等所有事情都挂在美元身上，走不远的。但鲍主席的这个发言，实际上是将数字货币说成了投机，虽然此番说辞不可能对数字货币的发展构成任何中长期的影响，短期的影响也非常微小（过去十年数字货币的反对者中比他更威猛，比他下手更狠毒的多了去了，但所有这些人，所有动作和语言都不曾丝毫改变数字货币的发展轨迹）。但如此一来美元的最后出路确实又变得模糊了....\n　　打算困守美元，靠所谓的数字美元硬抗？呵呵，千万别打错了算盘，请允许我善意地提醒一下某些幕后的机构，比如某某会，某某会等等，不要忘记历史上历次被洗劫的惨痛，不要抱任何不切实际的的幻想，早做准备......",
				"added": 1616474767
			}
		],
		"1616475728_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 70,
				"body": "　　注意到某些洋品牌开始抱团藉由所谓人权问题，对新疆棉花以及使用该棉花的品牌和厂商搞品牌孤立和品牌歧视，这不过就是种族歧视的翻版和商业蔓延，其背后无非是狭隘私利保护和歧视，非常非常low的东西，注定是要失败的。\n　　在这里我再善意地提醒一下吧，西方百多年来在军事、文化、政治、金融等等层面的累积优势，最重要就的表现就在于存在大量延续多年，涉及所有领域的各种高端洋品牌。近年来中国虽然发展迅速但也仅仅只是在其中某些领域有所冒尖，倒不是国内的产品质量，设计制造能力，市场能力方面有大缺陷（当然个别尖端领域确实有较大差距），而是百多年来西方在军事、文化、政治、金融等诸多层面的优势不断积累延续而产生的覆盖所有领域的心理影响力无法被快速打破。\n　　而现在，以所谓人权（新冠疫情里西方人权已经崩了）、新疆棉花等来搞事，最终的结果注定是，上述这些原本需要长期努力才能打破的西方心理影响力，很可能在短期内被迅速摧毁，国内市场很可能会快速抛弃某些洋品牌，而民族品牌如果不是蠢猪，肯定会迅速填补，如此以来西方百多年来在各个商业领域的积累优势，很可能会迅速开始全面崩塌（赶快踩刹车或许还来得及）....\n　　所以进入困局泥潭，一定要注意正确的脱困方式，胡乱挣扎，或者朝某个特定方向一厢情愿地挣扎，注定只会越陷越深，并丧失本已经极为有限的时间和空间.....",
				"added": 1616645995
			},
			{
				"comment_id": 71,
				"body": "我听说可口可乐和、阿迪达斯、耐克也都要抱团加入，真是可喜可贺....",
				"added": 1616650828
			}
		],
		"1616650623_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 72,
				"body": "注意到某些洋品牌开始抱团藉由所谓人权问题，对新疆棉花以及使用该棉花的品牌和厂商搞品牌孤立和品牌歧视，这不过就是种族歧视的翻版和商业蔓延，其背后无非是狭隘私利保护和歧视，非常非常low的东西，注定是要失败的。\n　　在这里我再善意地提醒一下吧，西方百多年来在军事、文化、政治、金融等等层面的累积优势，最重要就的表现就在于存在大量延续多年，涉及所有领域的各种高端洋品牌。近年来中国虽然发展迅速但也仅仅只是在其中某些领域有所冒尖，倒不是国内的产品质量，设计制造能力，市场能力方面有大缺陷（当然个别尖端领域确实有较大差距），而是百多年来西方在军事、文化、政治、金融等诸多层面的优势不断积累延续而产生的覆盖所有领域的心理影响力无法被快速打破。\n　　而现在，以所谓人权（新冠疫情里西方人权已经崩了，不要天真地以为靠疫苗就能今年迅速走出疫情，哪有那么容易。）、新疆棉花等来搞事，最终的结果注定是，上述这些原本需要长期努力才能打破的西方心理影响力，很可能在短期内被迅速摧毁，国内市场很可能会快速抛弃某些洋品牌，而民族品牌如果不是蠢猪，肯定会迅速填补，如此以来西方百多年来在各个商业领域的积累优势，很可能会迅速开始全面崩塌（赶快踩刹车或许还来得及）....\n　　所以进入困局泥潭，一定要注意正确的脱困方式，胡乱挣扎，或者朝某个特定方向一厢情愿地挣扎，注定只会越陷越深，并丧失本已经极为有限的时间和空间.....",
				"added": 1616685514
			}
		],
		"1616686473_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 73,
				"body": "　　过去十年，任何接受比特币支付的个人和机构都赚大了，其中的要点在于，如果在当时将其立刻兑换成法币，那就立刻没钱可赚了。\n　　马斯克的聪明之处在于，他明确了不会将比特币兑换成法币....",
				"added": 1616686717
			}
		],
		"1617105823_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 74,
				"body": "另：汽车制造商通用汽车（General Motors）正在考虑使用比特币作为其服务的付款方式。在2020年第四季度财报会议上，其首席执行官Mary Barra建议该公司考虑以比特币付款的购买方式。",
				"added": 1617105882
			}
		],
		"1617545178_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 75,
				"body": "单纯就泡沫而言，问题确实不大，不过需要结合其他情况一起看，而且时间窗口确实在缩小....",
				"added": 1617545325
			}
		],
		"1617985305_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 76,
				"body": "这东西跟电商一样，新人尤其是普通人只要用过一次，就立刻会感受到它到不同，从此便不会再罢手。尤其如果赶上牛市一路上涨，那就更无法摆脱....\n个别大佬们因为有很多投资渠道，而且对技术无兴趣，甚至本身与黄金或者某种对立的传统资产等有深切的利益，倒是有因此对数字货币感觉平淡甚至反感，但这种是极少数，而且最终还是会改变。",
				"added": 1617985597
			}
		],
		"1618063871_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 77,
				"body": "　　一旦开启战争副本，中国的内部矛盾就有了向外部解决的途径，而且是极快速，极轻松地解决，如此一来中国毫无疑义地将成为有史以来最伟大，最强悍，最广袤的资本主义国家，但也仅此而已了，无论多伟大，多强悍，多广袤未来注定逃不过周期律，逃不过成住坏空，逃不过王朝的兴衰更替。烈火烹油，鲜花着锦之后最终都还是要归于白茫茫一片大地真干净......\n\n　　所以，上面这条路，虽然极其好走，但并不是一条好路，内部种种问题和矛盾的解决方式，还是要通过内部来解决，如果真能有探索出一条凤凰涅槃的解决之路，那才是整个人类迈向自由之路的起点.....",
				"added": 1618118008
			},
			{
				"comment_id": 80,
				"body": "很多时候，我们都只能眼睁睁看着事情朝我们最不愿意的方向发展，毫无办法......",
				"added": 1620218129
			}
		],
		"1618818030_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 78,
				"body": "周小川谈到比特币时表示，不管数字货币还是数字资产，都要为实体服务。“我们经历过2008年的全球金融危机，发现金融脱离了实体，比如影子银行、衍生品这些纯粹变成了金融机构之间的投机交易，和实体没有联系了，就容易出问题，以至当是一些国际大行的领导、交易员们看不懂，很难做好内部控制。”\n\n－－－－－－－－－－－－－－－－－－－－－－－－－－\n　　这些观点我以为非常重要而且正确。",
				"added": 1618818477
			}
		],
		"1619974743_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 79,
				"body": "官渡之师，袁绍未遽弱也，曹操见之以为终且自毙者，以嫡庶不定而知之也。咸阳之都，会稽之游，秦尚自强也，高祖见之以为当如是矣，项籍见之以为可取而代之者，以民怨已深而知之。盖国之亡，未有如民怨、嫡庶不定之酷，虏今并有之，欲不亡何待......\n\n　　犹记乾道壬辰（1172年），辛幼安告君相：“仇虏六十年必亡，虏亡而中国之忧方大。”绍定验矣，惜乎斯人之不用于乱世也！",
				"added": 1619975110
			}
		],
		"1621672453_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 81,
				"body": "让我们看看还能有些什么....",
				"added": 1621786024
			}
		],
		"1625850007_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 82,
				"body": "呵呵，所以，接下来的问题就是：还有哪家金融机构打算跟进打击数字货币交易？",
				"added": 1625892990
			},
			{
				"comment_id": 83,
				"body": "　　我估计支付宝即使被约谈，即使有马云的事情，也是极其不愿意发那个公告的，据我所知，以往对数字货币交易最友好的就是支付宝。\n　　所以被约谈之后支付宝一直再拖，直到最后看农行都发了，觉得逃不过于是才发公告。接下来支付宝平台上的资金和活跃用户肯定都要损失不少，而且基本上都是去微信，而其他机构根本没搭理这茬似乎也没啥事，我估计他心里一定有很多很多匹羊驼在跑......",
				"added": 1625894148
			},
			{
				"comment_id": 84,
				"body": "顶一下！！！！",
				"added": 1627741822
			},
			{
				"comment_id": 85,
				"body": "> [winder](#comment_66_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv): 基本可以明确的是，接下来相当一段时间肯定不会有针对币圈的打击政策了，那么币价是否会因此大涨呢？请大家尽快进群，请尽快进群！\n\n--------",
				"added": 1627741901
			},
			{
				"comment_id": 89,
				"body": "果然，央行最近发出的那个对比特币的打击已经结束，一切进入常态化监督的文件，很显然表明有些人已经明白事情的真实状态，打算彻底躺平了。所以本社区七月就明确指出的“接下来相当一段时间肯定不会有针对币圈的打击政策”的判断，再一次被彻底印证....",
				"added": 1630927860
			}
		],
		"1627975446_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 86,
				"body": "如果我所料不错的话，最后一定是避重就轻，放大抓小，大事化小，小事化了，化不了的意思一下，同时特别重要的是一定要坚决斩断向其他人蔓延的可能性，否则欣欣向荣，海清河晏的大好局面如何维系，呵呵呵呵.....",
				"added": 1628153186
			},
			{
				"comment_id": 87,
				"body": "前几天突然看到张春桥在狱中给子女的信，突然发现，我对时局的看法，特别是对当前社会本质的看法与他非常接近，比如他也完全不同意那些人上台后，中国会走资本主义道路，会出现资本主义，他的原话是中国不过是回到半封建半殖民地社会，而决不会有资本主义。因为资本主义社会是要对外进行掠夺，甚至进行屠杀和殖民，而某些人根本没这个本事，不过是对国内作威作福，趴在社会身上敲骨吸髓.....\n观点能和他一致这让我非常自豪，不过他没有提到半官僚，应该说半官僚这一特点，是在最近这几十年才逐步出现的，我相信未来这一点还会越来越突出，尤其是在一些重要的，敏感的，用层层专业外衣包裹的专业领域和部门....",
				"added": 1629645485
			}
		],
		"1629822978_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": [
			{
				"comment_id": 88,
				"body": "嗯，疫苗，检测试剂，消毒液，防护服、口罩、呼吸机之类，在充分满足国内需求的情况下，原则是确实可以无限制出口，但对于那些对包括华为产品在内的中国商品进行无理刁难和泛政治化处理的国家显然不在此列。\n同时，对另外一些友好国家，特别是长期友好国家，必要时可以考虑免费提供一部分上述抗疫物资....",
				"added": 1629894756
			}
		],
		"1632322744_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 90,
				"body": "　　由于米帝方面没有按照本社区建议的方法进行操作，尤其是5-6月份，没有对币价一撸到底，顺势进入熊市，现在已基本丧失通过屠杀黄金，对全球进行彻底掠夺，从而摆脱困局的最佳解法。非常可惜，尤其麻烦的是，由于米帝方面贻误战机，因此非但无法对黄金及其相关资产进行屠灭，现在恐怕已经找不到可让米帝摆脱困境的办法，殊为可惜。\n　　尤其麻烦的是，中国高层此前曾出过一份正式的通告，声明对比特币交易和挖坑的打击已经结束，从此进入例行监管，这显然说明国务院金融发展委员会已经认输，之前关于打击比特币交易的决议，因为被金融机构广泛抵制，现已正式泡汤，而国家高层对此种情形，已经全面接受，不会再强求各大金融机构落实上述决议。因此有些事情，可能即将或者正在进入一个全新的阶段，这对西方而言，可能是最坏的消息了......\n　　\n",
				"added": 1632323345
			},
			{
				"comment_id": 92,
				"body": "呵呵，这是在叫板啊，不过我确实注意到这次924通知，再没有给金融机构安排什么任务，转而开始对交易所甚至在交易所工作的普通人，甚至为数字货币项目提供广告等服务的企业，乃至这些企业的从业人员追究责任，呵呵呵呵...\n　　而且，要追究这么多公司，这么多普通人，显然这政策还必须落地，必须得到各地方政府的明确响应，否则是基本是无法落实到位的，所以，让这消息先飞一会儿....",
				"added": 1633244787
			}
		],
		"1633242894_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 91,
				"body": "　　无论欧美都有大批人坚决反对疫苗，一开始我只是觉得欧美教育崩坏，民众普遍智商下滑，甚至缺乏基本常识。但现在看来，可能事情并没有这么简单，我开始有这种怀疑，西方疫苗这个事情，很可能在多年前，甚至近百年前，就已经是种种阴谋的载体，并且愈演愈烈，或许真的有不少以疫苗之名注射入普通人体内的，并不只是疫苗，甚至可能根本不是疫苗而完全是另外的东西，当然我说的是西方的疫苗。\n\n　　而且上述情况在西方某些人内部早已经是公开的秘密，因此才有如此多的人，包括相当一部分接受过良好教育的人，因此不管不顾地拒绝疫苗，我猜想这些人反对的或许不只是新冠疫苗，甚至可能是所有一切疫苗，因为他们真的知道了一些关于疫苗的，我们一直都不知道，甚至都不曾想象到的情况。",
				"added": 1633243551
			}
		],
		"1629644367_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": [
			{
				"comment_id": 93,
				"body": "看来这个世界上，傻逼的三次方都不少，好吧，我错了....",
				"added": 1635082801
			}
		]
	},
	"comment_vote": {
		"22_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"27_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"38_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"17_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv": 1,
		"43_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"83_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1,
		"86_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b": 1
	}
}