{
	"next_topic_id": 47,
	"topic": [
		{
			"topic_id": 1,
			"title": "草榴：郭沫若：一座中国大陆无耻文人的“丰碑”",
			"body": "郭确实很无耻，而且学术上也不咋地，愚弄大众\nhttps://t66y.com/htm_data/7/1706/2482976.html",
			"added": 1498576938,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "Tor匿名通信流量识别（监控）方法",
			"body": "还是很厉害的，对tor的使用建议搭配VPN代理用MEEK路由来访问\nhttp://www.docin.com/p-607253374.html",
			"added": 1498830400,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "报道真实的新闻：http://www.bestgore.com/",
			"body": "Best Gore是一個現實的新聞網站，報導了真正有意義的事件。Best Gore最高的基礎是，言論自由，新聞自由和公眾權利得到知情的基本原則是實現透明度和問責制原則的基本和必要條件，這些原則反過來又是必不可少的促進和保護民主社會中的所有人權。\n\n言論自由是最重要的人權，因為它是所有其他權利獲得權力的權利。保護這一基本人權的重要性得到了國家和國際條約的承認，包括“美國憲法第一修正案”，“聯合國世界人權宣言”第19條，“美國人權與責任宣言”第4條，以及“加拿大權利和自由憲章”第2（b）節。\n\n國際法認為，言論自由在所有論壇都得到保護，包括在線，即基於www。\n\n2012年7月5日，聯合國人權理事會通過了關於互聯網上促進，保護和享有人權的具有里程碑意義的決議。這一決議得到了82個國家的支持。\n\n歷史表明，審查制度主要用於遏制自由和進步的人，只是為了阻止真相或想法的出現。這是不能容忍的。\n\n因為某些人對他自己認為的褻瀆，淫穢或道德腐敗內容的審查，所造成的對言論自由傷害將是毀滅性的，應該是所有人最關心的。\n\n對於審查制度和侵犯人權行為的支持者需要暴露在他們所在的暴君身上，並據此處理。這是Best Gore最好的步驟，因為該網站在揭露主流媒體被宣佈為官方真相的謊言中發揮了關鍵作用，暴露了無數的警察暴行案件，政府批准恐怖主義，戰爭牟利，恐怖主義等使人民陷入压迫的和其他恶心的活動。",
			"added": 1499269075,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "湖南道县大屠杀幸存者自述。",
			"body": "湖南道县大屠杀幸存者自述。\n\n\n转载文章 http://t66y.com/htm_data/7/1708/2589171.html\n\n题记：1967年8月13日到10月17日，湖南省道县经历了66天的大屠杀，被杀死4519人，被杀绝的117户。文革中的道县大屠杀通过各种媒介，已广为人知。\n\n\n\n周群口述 陈秉安整理\n\n我的父母弟妹\n\n我叫周群，今年79岁。祖父是道县兴桥人，是普通农民，有十几亩田，省吃俭用送我父亲上学。父亲周谟，抗日时期报名参加国民党青年军，上前线抗日。抗战胜利后，在南京国民政府交通宪兵科当科长。\n\n我1936年出生在江苏镇江。1949年，我已经13岁，这时，到处传说解放军要打过江来了，远方“隆隆”的炮声都听得见了。有一天，父亲突然神色慌张地从南京赶了回来，对我和母亲说：“共产党的军队要渡江了，政府乱作一团，我们得赶快跑。”母亲说：“往哪儿跑啊？”父亲说：“还能去哪里呢？去台湾的船票就是10根金条也换不上一张。只有回老家道县。”这样，我们一家辗转奔波，回到了老家湖南省道县，在县城租了一间小房住下。\n\n解放军过了长江后，战火很快到了湖南。不久就听说湖南省省长程潜和平起义了，接着，湘南行署主任欧冠也准备和平起义。他与父亲在南京有一面之交，为了拉更多的“和平力量”，把我父亲也叫去了零陵“共商”。1949年11月5日，欧冠通电起义，这样，我的父亲便作为“起义人员”，受到礼遇。11月15日，解放军进入道县县城，父亲还摇着彩旗欢迎解放军入城，道县人民政府举行“共商道县和平建设”会议，把我父亲请去参加。\n\n谁知事情说变就变。有一天，父亲接到县政府的通知，要他去衡山集训。我们都很紧张，他都起义啦，怎么还要找他呢？不久父亲就从衡山来信，说每个从旧社会过来的人都要坦白交代自己对共产党做过的错事。他在信中说：“我要努力改造自己，跟上时代的步伐。”\n\n1952年5月2日，我正在道县的省立七师读书，早上学校突然通知，全体学生去参加全县的“宣判大会”。猛然，我看见父亲被五花大绑跪在台上。不久就听见审判员宣判了他和另外5个人死刑！\n\n父亲被押着从台上推下来，台下的人群立刻像潮水一样，分开两道，高喊口号：“镇压反革命！”父亲的眼光还在人群中扫着：显然，他是在找亲人。可是我让人群隔得那么远，可怜的父亲怎能看见我呢？不久，就听见远远传来的枪声。\n\n父亲死了之后，母亲手不能提，肩不能扛，4个弟妹，加我5张口吃饭，怎么养活？父亲是被枪毙的，按公安条例，母亲和我们姐弟都成了“杀关管亲属”，亲戚都怕惹祸上身，看见我们都绕着道走。晚上，弟妹们睡了，我看到母亲站在窗前发愣，窗下就是潇水河，我真害怕她轻生。母亲满脸泪水，摇头说：“我不会的，我一看到床上躺着的你们，就不会死了，没有我，你们怎么活？”不久，又传来消息，说我上中学的大弟弟周元正搞“反革命组织”被抓了。弟弟与同班“出身不好”的子弟成立了一个篮球队，他们常用纸条通知在哪里练球，在哪里比赛，而且总是用文言文，他们穿的背心上印有一个蓝色的队徽。就说那是国民党党徽，他们串联纸条上写的是“暗语”。大弟弟周元正就这样被无辜判了20年刑，一直到70年代才出来。一个十几岁的翩翩少年被改造成了唯唯诺诺，见谁都害怕的小老头。\n\n第一次婚姻\n\n这时我中师毕业，总算能挣钱，帮助母亲减轻一点负担了。我找到县教育科，请求安排工作。那时候农村缺教师，教育科开恩，答应安排。但是要求我去最艰苦的洪塘营。那是离县城几十公里的瑶族山区，学校几乎与世隔绝。让一个17岁的女孩子进到深山教书，同发配边疆差不多。我能有什么选择呢？我这样的人，能给一份工作就算是不错了。\n\n在偏僻的瑶山中，我碰上了第一个丈夫蒋汉镇。他高大、英俊，很有文体才华。在道县一中，打球、演戏都很出名，我在舞台见过他，很有好感。蒋汉镇出身地主家庭。父亲是在淮海战死的。本来，他已被选拔到部队文工团了，因为家庭问题被打下来，也分配到偏僻的瑶山中教书。\n\n塘营小学老师不多，有些在当地有家。一到放学后，学校里就剩下了我们两个。在与世隔绝的大山中，“同是天涯沦落人”，有一种特别的亲近感，我们很快就恋爱了。\n\n我对谈恋爱有种隐隐的负罪感，父亲才死，弟妹又小，我怎么能贪图享乐呢？蒋汉镇就开导我，人总不能一辈子生活在阴影里，应该抬起头来生活。我们都年轻，党指引的未来是光明的。1959年，我与蒋汉镇结婚。1960年，生下了第一个孩子。当时流行小说《林海雪原》，我们便给第一个男孩取名林海。1962年，又生下了一个女孩，叫雪原。1964年，生下第三个孩子，是男孩，取名林松。为什么取名林松？我知道苏联莫斯科大学的门前，有两排高大挺拔的雪松。我一生最美好的理想，就是去一次共产主义的故乡，如果我去不了，愿我的儿子能去莫斯科上大学！\n\n那一段时间，家庭生活和睦、幸福。社会上的政治斗争还没搞到我们年轻的一代人身上来。我和汉镇还经常在学区大会上讲公开课，每年都被评为“优秀人民教师”，发一支钢笔、领一张奖状什么的，心里很满足，对党对毛主席很热爱。1965年全国搞“四清”，情况就变了。\n\n本来，我们以为解放的时候都不到18岁，不是地主分子，即使父辈有问题，也不是我们的罪，没想到运动会搞我们。1965年下半年，洪塘营学区100多名教师被召到区里集中学习文件，搞“自我革命”，就是向党交心。每个人回顾检查自己，把“辜负了党”的事情说出来，“与昨天一刀两断”。为了让教师们大胆交代问题，党支部书记宣布：“不扣帽子，不抓辫子，不打棍子！”后来才知道，这些都是骗我们的。\n\n那时汉镇在学校管了一点伙食账，除了交代自己对学生不够耐心外，还把账本交给领导，交代了“私自炒菜用油”的问题。我则把读师范时的一本日记本交给了领导。没想到，交心的第三天，学区的墙上就贴满了大字报：“地主分子蒋汉镇还在吸血”，“奇文共欣赏：地主阶级的孝子贤孙周群反动日记摘抄”。很快，全学区掀起了一场批判我们夫妻的风暴。汉镇记的“油盐柴米”账，被说成是“变天账”，我用铅笔抄写毛主席语录，被说成“对伟大领袖不恭”。我日记本上抄的名诗、名句，被说成要搞“资产阶级复辟”，“盼望帝修反回来”。我们两口子被押到台上，向毛主席“低头认罪”，一遍又一遍地交代“反动思想”。在我俩被清退出学校时，我曾问蒋汉镇：“我们这些人不合适，清退便算了。干吗还要开那么多会，批判、斗争、污辱我们呢？”汉镇一句话让我茅塞顿开：“光把我们清退怎么够呢？要批判我们，教育其他人啊！”\n\n1965年12月，我们两口子被学区清退回蒋汉镇的老家，瑶山深处一个偏僻的小村庄——小路窝村。我还记得那是个凄冷的早晨，蒋汉镇挑着一担行李，我一手挽着装杂物的篮子，一手牵着雪原。林海背着林松，当我们一家人走出校门时，没有一个人来送。\n\n回到老家，蒋汉镇家原来的房子已经倒塌了，我们借别人的一间房子住。那房子是堆稻草的，从瓦缝里都能看见光，一下雨，到处都漏。我们就拿稻草把房顶漏的地方堵了，把稻草杂物清理了一番，勉强住了下来。村里增加了人口，就少分口粮，当然不欢迎我们，时时要看人的脸色。好在按规定，还能吃一年的国家粮，发了一点安家费。所以一开始生活还过得下去。\n\n转眼到了1967年“双抢”大忙季节。我们一家人都投入到插田割禾之中。为了表现好，让妻子儿女少受歧视，细皮嫩肉的汉镇打着赤膊，在火热的日头下踩打谷机。我也挽起裤子，下田学割禾；3个孩子，5岁的雪原，到田里拾谷穗；7岁的林海看了队里的几头牛，再牵上小弟弟林松。我们就像牛，低着头，俯首贴耳，听凭改造。汉镇总是安慰我：“我们是运动中出来的，照共产党的政策，运动结束后，就会纠偏，那时，我们就能回去了。\n\n可是我们没等到这一天。一场轰轰烈烈的文化大革命到来了，我们不但没能回去，一家5口，只留下我一个！\n\n\n\n1967年8月，道县农村刮起一股杀人风。我们附近的蚣坝河里丢满了尸首，河水一片血红。田埂上，路边上，到处可以看到尸体。1967年8月26日，已经是半夜了，我和3个孩子被叫起来，押到队里的禾场上去。蒋汉镇已先被捆绑在那里了。禾场上火把通明，几十个民兵拿着马刀、鸟铳，押着村里的地富及其子女朝山上走。小妹子牵着我的裤脚，林海背着林松。林松趴在哥哥背上，好懂事啊，也不哭，就这样高一脚，低一脚地被押到一个天坑（溶洞）边。这时，治保主任唐兴浩跳到了石头上喊话：“现在，我代表大队贫下中农最高人民法院，宣布你们的死刑！”就看到有人拿着一张纸，读名字。叫一个，民兵就从人群中拖一个人出来。挥起一刀，朝脑壳砍去。或者拿铁棍朝脑袋打一棍子，只听惨叫一声，血就喷出来了，再一脚，踹到天坑里面去。\n\n蒋汉镇被第三个点名，头上被打了一棍，丢下洞去。我是第八个！可怜我那3个孩子，撕肝裂肺地叫“妈妈”，我哄他们：“乖，你们别动，妈妈过一会儿就回来。”我那时还心存一丝幻想，想着他们杀大人，孩子是来陪看的，不会杀孩子。所以我不能反抗，做什么都配合他们。\n\n我走到天坑边，只觉得脑后一阵冷风，一根硬硬的东西打在我的头顶上，没有痛，一阵天旋地转，就什么也不知道了。\n\n我被救出来以后，有人告诉我，打我的东西是开山打炮眼用的钢钎。\n\n后来听人说，我被丢进去之后，他们又来抓我的3个孩子，可怜3个无辜的孩子，吓得像被追的小鸡，满坪跑。孩子当然跑不过大人，3个孩子都被丢进了天坑。这真是个“吃人”的天坑啊，光这次就扔下了25个人！\n\n老天有眼，一开始，我们全家5人丢下去后，都没死，在黑洞洞的天坑里又相见了。我碰碰旁边，冷冰冰的，都是一具具的尸体。奇怪啊，平时，我晚上听见猫头鹰叫都怕，这时候，同冷冰冰的尸体睡在一起，也不知道怕。\n\n几天中，没有吃的，尤其是没有水喝，汉镇先昏迷过去了，我们就这样一步步等待着死亡来临。\n\n不知道过了多久，可怕的死前症候出现了。第一个是林松，他拼命叫着：“妈妈，我要喝水，我要喝水！”没有水，就用小拳头打我，抓我的头发。我对他说：“睡吧，孩子，睡着了就好了。”\n\n这时候，汉镇突然站起来，口里念：“高粱，高粱，好多高粱……”他已经疯了。他在尸体上走来走去，跌跌撞撞，突然“扑通”倒下，再没有声音了。\n\n林松也不动了，我摸摸他的鼻孔，已经没有了气，奇怪，我竟然啥悲伤都没有。也许是我觉得，我很快也要死的。\n\n这时，我听见林海在嘟哝：“妈妈，我为什么还不死啊，我想早点死。”我的五脏六腑都碎了！可怜的孩子，才7岁啊！又过了一会，他也真的就再没声音了。\n\n小妹子死得慢些，她也要水喝，我就在洞里四处乱摸，摸到一个小水凼，就用嘴含着水去喂她。谁知她喝了水，头一歪，倒在她爸爸身边，也没气了。\n\n我知道，马上要轮到我了。我很平静，我把丈夫、两个儿子和女儿都拉过来，4个亲人并排躺下，静静地等死，等待黄泉路上，我们一家人同行。没想到，头顶的洞口有人叫我的名字！原来，47军下来制止杀人了，我被人从天坑中救了上去！\n\n救上我后，他们问，周老师，你去哪里？一句话让我眼泪哗哗地流。丈夫死了，3个孩子死了，家没了。我孤孤单单一个人，能去哪里啊？\n\n第二次婚姻\n\n想来想去，想起蚣坝墟上，有我的一个伯母，我叹了一口气，只能去投奔她了。没想到，在伯母家里，开始了我的第二次婚姻：与大队支书李自贵建立家庭。\n\n很多人问我，得救后为什么要嫁大队支书？是不是让贫下中农来保我的命？我说，又是，又不是。\n\n李自贵是蚣坝公社冲子口村人，解放前，他家很穷。母亲在病中瞎了眼睛，怕拖累儿子，上吊死了。李自贵10岁就带着两个弟弟讨饭。共产党来了，他家才翻了身，分了地主的田，又分了房子。朝鲜战争爆发，李自贵参加了中国人民志愿军。在朝鲜战场上，他杀敌立功，多次被评为优秀共产党员。从朝鲜回国后，先到零陵的一个矿山工作。但他当惯了农民，向领导打报告，要求回乡务农。1962年，李自贵回到了老家蚣坝公社冲子口村，不久被选为大队党支部书记。\n\n文化大革命中道县到处杀人。上面指示说蚣坝大队要杀多少“地富反坏”。李自贵是个非常忠诚的共产党员，在部队才认识几个字。党的路线出了什么错，他是不会去想的，只知道要听党的话。我后来听他说，接到杀人的指示，他也很矛盾，一直不忍下手。但是上面的命令一个接一个压下来，要是不杀人，你就是站在“地富反坏”一边，自己都有危险。后来，他也参加了杀人。我在道县处遗小组的材料中看到了这样的记录：“1967年8月25日，蚣坝大队支书李自贵、大队长周时、贫协主席蒋绍黄、治保主任朱贤儒、民兵营长蒋学金、大队‘红联’头头蒋启念等人，以大队‘贫下中农最高人民法院’的名义召开宣判大会，当即宣布了涂宏光等22人的死刑，并立即拖到圩场边上的两口废红薯窖边执行。”\n\n但是，天有不测风云，就在蚣坝刮杀人风的时候，李自贵家中突然出事，他的老婆上吊了！原因是他老婆的父亲在国民党部队中当过兵。她在与邻居吵架时，人家骂她父亲是“国民党兵痞”，说她老公李自贵不配当大队支书。这在当时是个很大的罪名了，他的老婆一气之下，上吊自杀了。留下了一个两岁的男孩叫李玉新。谁的“阶级”就那么纯洁？这件事对李自贵教育很大。\n\n当时李自贵无法带孩子，就把孩子放在蚣坝墟上交给我伯母带。也是这个原因，我到伯母家里不久，就认识了李自贵。李自贵看到我抱着他的孩子，心有愧疚。他想同我结婚，请我的伯母做媒。一听伯母这样说，我坚决不同意。我原来的丈夫、孩子的尸骨都还在溶洞里呢，我怎能嫁给他？伯母说，外面还在杀人，嫁个贫下中农，你的成分就改了，有他保护，你死活可以留下条性命。我的弟弟也这样劝我。\n\n最后让我下决心跟了李自贵的原因是他的孩子：两岁的玉新。当时我刚失去了3个心头肉，就像一头失了崽的母狼差不多快疯了，玉新就是我的精神寄托。抱着玉新就像抱着我的林松，没有玉新我只有死。所以当他们说，如果我同意就要抱走玉新时，我心软了。\n\n\n\n这样，我同意跟李自贵去了冲子口村。从此，我由一个教师，变成了一个地地道道的农妇。每天，我上山放牛，用一块蓝布把玉新捆在背上。有一次，我经过小学校，听见一位女老师讲课，说苏联有3个革命导师：列宁、斯大林、阿尔巴尼亚。我在窗外干着急，但是看看自己这个样子，一个衣衫褴褛的放牛农妇，想想自己的身份，哪有我说话的余地？\n\n有两件农活我最难忘，一件是挑牛栏粪，赤脚站到又臭又潮湿的牛粪尿里。有时，还要用手去捧牛粪。一开始我怎么也做不下，我一辈子都爱干净，脚一踩到软软潮潮的牛粪上就恶心。但是，有什么办法呢，时间长了，就如同踩在潮湿的棉絮上一样。\n\n还有一件难事是砍柴。大炼钢铁，把山上的柴都砍光了，我要跑到很远的山上去砍柴。我带着孩子，怎么办呢？我就在地上摊开一块蓝布，把玉新放在蓝布里坐着。有一次，柴担到半路，“噗——”藤绳断了，柴散了一地。这时天又黑了，肚子又空了，力气也没了，我哭，孩子也哭。远远地听到“周群，周群”的喊声，原来是李自贵来接我们母子了，那是多么难忘的回忆啊！相依为命的生活，慢慢化解了我们之间的冤结。劳动中，困苦中，相互照应，我们有了更多的共同点。\n\n这时，外面有了风言风语，说：“冲子口村出奇事了，共产党员讨了个地主婆。”“大队支书中了美人计了！”有一次支部会议批评他“阶级立场出了问题”。为了我，他受了处分。他没有怨我，依然爱我。这一点使我很感动。我决心好好撑起这个穷苦的家！\n\n几年后，我们添了一个男孩一个女孩。男孩取名玉东，女孩取名来媛。穷屋里一下有了3个孩子，那是3张嗷嗷待哺的口啊，我们家更穷了，但穷人却有穷人的快乐。孩子虽并非我一人所生，但手心手背都是肉。大女儿来媛要出嫁了，没有钱做嫁妆，怎么办？以前李自贵还可以到瑶山去砍竹子，卖几个做衣服的钱。但那时正批“资本主义尾巴”，谁都不敢搞副业。嫁女的钱从哪里来呢？是我结扎了自己，拿回了20块钱，把女儿嫁出去的。那时，计划生育结扎男人补助10元。结扎女方能补到20元。我就代替李自贵结扎了自己。来媛出嫁离门的时候，紧紧地抱着我不肯走，哭成了个泪人儿。\n\n1980年，道县大屠杀事件平反，一些杀人的凶手受到了法律的惩办，李自贵也不当大队支书了。我又回到了蚣坝的教师队伍。县里群众还强烈要求，让我这个九死一生的人当政协委员。我同李自贵的位置，正好倒了过来。\n\n20世纪80年代中期，教育局要把我调到县里去。临走时，我发现自贵很不安，他有顾虑，怕我一去不回。那段时间，很多在文化大革命中嫁人的都离婚了。我们蚣坝一个从广西来的女医生，平反后，抛弃了老公孩子，又回了桂林。我对自贵说：“你放心，我们是从那个苦难的岁月中走过来的。你对我好，我记得的。不管我以后做什么，都不会抛弃你。”\n\n不久，我们把家搬到了道县县城，我教书，自贵在家做点家务。这时，玉新已经成家，玉东学了机电，来媛进了纺织厂，不久又添了孙子和外孙女，一家人的生活和睦、幸福。2000年以后，我发现，老头子的身体慢慢不行了。他老是咳嗽，痰中带着血丝，有时咳得整夜都不能入睡。2008年冬天，他病倒了。我还记得，那是一个雪天的黄昏，屋里生着火，他可能感到自己快不行了，向我招手，又用手敲敲床，让我坐下。我说：“你要说什么，我都清楚，不说了，不说了。”他眼里都快流泪了，断断续续地说：“我这辈子，对不起很多人，也对不起你！”李自贵一生很坚强，从不流泪，这回，他流泪了，泪水分成两道，顺着他的面颊往下流。我也忍不住，抱着他哭。他在床上又躺了3天，无声地走了。我和儿女把他葬在家乡冲子口背后的山上。伏在坟上，我哭了一场。\n\n2011年，我在记者的陪同下，再次来到了枫木山，找到了我第一个丈夫和3个孩子死去的天坑。洞口已被人用大石块盖上，旁边建了一座“枫木山小学”。\n\n44年了，这里灌木丛生，难以辨认。但44年前，一家人“阴间相会”的情景犹在眼前。我不由自主地喊了一声：“小妹子、林松，妈妈来看你们了！”\n后来，我在天坑口上为他们立了一块碑，碑上写着“蒋汉镇老大人及子女林海、林松、雪原之墓”。落款是“贤妻、慈母周群立”。\n\n\n\n附录：\n揭秘|文革湖南道县大屠杀\n来源2014年第1期炎黄春秋杂志\n\n1967年8月13日到10月17日，湖南省道县经历了66天的大屠杀，被杀死4519人，被杀绝的117户，道县大屠杀通过各种媒介，已广为人知。\n\n当时道县周边地区也大开杀戒，知道的人不多，现作简单介绍。\n\n宁远县\n\n1967年8月18日开始杀人。梅岗公社小欧家大队与道县杨家公社郑家大队一山之隔。郑家大队杀人后，一些四类分子（子女）跑到宁远这边山上躲藏。小欧家大队的一个社员上山打柴，听到冲里有人说话，走过去一看，没有人，却看到地上有人坐过的痕迹，还有几颗“喇叭筒”的烟蒂子，赶快回去向大队支部报告了，很快流言四起：“道县黑杀团在我们县里开会了，要‘先杀党、后杀干，贫下中农一扫光，中农杀一半。’”“道县的四类分子和我们这边的四类分子串联，准备‘八月大组织，九月大暴动，十月大屠杀’。”8月18日（农历七月十三），小欧家大队一个在外面做手艺的外流人员（非四类分子）回家过节，带了两个身份不明的陌生人，引起人们的高度警惕。大队党支部和群众组织“红联”召开联席会议，决定对该外流人员和地主分子欧涛玉等四人采取革命行动。当晚便将4人杀害。自此，杀人风从道县刮到了宁远。接着，麦地公社路田大队，以公社贫协主席、文革主任为首，把38名地富分子及子女像柳条儿串鱼一样捆在一起，推下废红薯窖，放火熏死后，盖土掩埋。晓睦塘公社党委书记李远生当时在晓睦塘大队蹲点，听到杀人风声后，立即召集大队干部开会研究杀人问题，大队干部问他怎么搞，他笑而不答，从地上捡起一根稻草，以掌代刀，做了个砍的姿势。但下面有人还没有理解深透，又问了一句：“李书记，你是说……？”大队会计有点文化脑子活接了一句：“死蠢，这都不懂，李书记是讲斩草除根。”李远生高兴地在他肩头拍了一巴掌：“聪明！”当即分工，全大队按照自然村分为两片，",
			"added": 1503216786,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "自上而下，中国互联网管控新模式",
			"body": "转自：https://cn.nytimes.com/china/20171017/china-internet-cyber-control/\n\n中国呼伦贝尔——在美国，一些世界上最强大的科技公司正面临越来越大的压力，要采取更多措施来打击虚假信息、阻止外国渗透。\n\n但是在中国，有赵金旭（音）这样的检查员。\n\n    查看大图\n    在上月举办的中国互联网安全大会上，一块电子屏展示了中国所遭受网络攻击。\n\n    Mark Schiefelbein/Associated Press\n\n    在上月举办的中国互联网安全大会上，一块电子屏展示了中国所遭受网络攻击。\n    查看大图\n    本周一，北京的一张宣传海报，上面有习近平的的肖像以及“中国梦，人民的梦”字样。\n\n    Greg Baker/Agence France-Presse — Getty Images\n\n    本周一，北京的一张宣传海报，上面有习近平的的肖像以及“中国梦，人民的梦”字样。\n    查看大图\n    9月，网络安全管理部门对中国三大互联网公司腾讯、阿里巴巴和百度处以高限罚款，理由是其社交媒体平台未能阻止谣言、暴力和色情内容。\n\n    Reuters\n\n    9月，网络安全管理部门对中国三大互联网公司腾讯、阿里巴巴和百度处以高限罚款，理由是其社交媒体平台未能阻止谣言、暴力和色情内容。\n\n相关文章\n\n    中国政府参股网络媒体加强管控\n    中国互联网上68件不可言说之事\n    阿里巴巴估值逼近美国科技巨头\n    Facebook“气球”试探性进入中国\n    \b现在轮到硅谷“山寨”中国企业了\n\n27岁的赵金旭来自中国内蒙古草原上一个多风的小镇，他扫视网络，查找暴力、假新闻和色情内容。他是中国最大的社交媒体平台之一微博上的“检查员”。上个月微博宣布，将聘请人员来协助执行中国对网络内容的严格限制。\n\n多年来，美国等国认为这种严厉的审查制度是政治脆弱性的标志，也是中国经济发展的障碍。但随着西方国家开始讨论可能推出的互联网限制，头疼于假新闻、黑客和外国干涉，中国有一些人觉得，这是对该国的互联网构想的一次有力肯定。\n\n“这样的事情肯定不会在这里发生，”赵金旭谈到俄罗斯去年干预美国总统大选的争论时说。\n\n除了共产党的忠诚拥护者，很少有人会认为中国的互联网控制模式是民主社会的典范。中国在网络上压制异见，还把很多践行异见的人士关进监狱。中国屏蔽外界的新闻和信息，包括《纽约时报》网站；还在封锁Facebook和Twitter等全球服务的同时，对本土科技公司进行扶植。\n\n与此同时，中国已经预见到了很多问题，如今从美国到德国再到印度尼西亚，很多国家都在受这些问题的困扰。俄罗斯人把互联网变成政治武器，中国则把它当作一面盾牌。\n\n实际上，中国在科技领域充满活力。它具有蓬勃发展的科技文化。中国互联网公司可以与Facebook和亚马逊同台较量。对其它国家来说，中国可能会提出一个很有吸引力的自上而下的模式，表明科技可以在政府的管控下蓬勃发展。\n\n“没有安全，效率再高也没有用。”北京中国政法大学传播法研究中心副主任朱巍说。他是政府在互联网法律方面的顾问。\n\n中国并没有满足于现有成绩。\n\n一个重要的政党大会本周三将在北京召开；就在前几周，该国的互联网监管机构国家网信办发布了一批新的规定。\n\n其中一个规定已经在上周生效，按照这个规定，在线论坛或聊天群的群主需要对用户的评论负责。\n\n另一个规定是禁止用户匿名，这对机器人和虚假帐户是个打击。Facebook和Twitter上就有这种帐号，它们向美国选民散播了一些虚假内容。\n\n“我们党过不了互联网这一关，就过不了长期执政这一关，”网信办一个部门上个月在一份党的重要期刊中写道。\n\n这篇文章与习近平主席对互联网力量的早期认识是一致的。习近平创建了网信办，并赋予它权力，它把之前很多管理网络内容的重叠机构集中到一起。\n\n网信办现在被视为与国防部同等重要的机构。自去年起，54岁的徐麟开始主持网信办工作，这位技术官僚之前是宣传官员。习近平在上海期间共事过的一些要员节节高升，徐麟是其中之一。\n\n国际战略研究中心(Center for Strategic and International Studies)的高级研究员萨姆·萨克斯(Samm Sacks)说，习近平承诺让中国成为与美国齐肩的网络超级大国，而网络空间管理是这项承诺的核心内容。\n\n“人们认识到，技术进步的速度超过了政府控制它的能力，”萨克斯说。只举一个例子，俄罗斯对Facebook的干预“解释了他们究竟在这里做什么”。\n\n中国本土的互联网公司是这种自上而下措施的关键。科技公司需要将内容存档60天，并将一切违禁内容报告给警方。政府正在收购一些科技公司的少量股权，以换取董事会的席位，直接参与新的互联网巨头的管理。\n\n如果未能让用户规规矩矩，科技公司还会受到重罚。9月，网络安全管理部门对中国三大互联网公司腾讯控股、阿里巴巴集团和百度处以罚款，因其完全或部分拥有的社交媒体平台未能阻止谣言、暴力和色情内容的传播。（如果未能阻止违禁内容的传播，公司一次最高可被罚款50万元人民币，并吊销营业执照。）\n\n人权观察者担心，这场打击可能会对本就严格受限的政治言论产生寒蝉效应。比如上月，警方突击搜查了大学教授刘鹏飞的家。他曾在腾讯旗下的全世界最流行即时通讯软件之一微信上创建了一个时事群。\n\n作为接受严格管控的交换，中国互联网公司得到的是增长的机会，而外国竞争对手则被拒之于国门外。它们现在已经有了自己的技术成功。腾讯的微信改变了中国的社会生活：人们用它聊天、付款、转账、叫车和寻找恋人。\n\n中国现在正在启动一个野心勃勃的项目，意在主导人工智能等领域。一些人认为，中国可能具备一个优势。中国有逾七亿网络用户，却没有一个强大的法律框架来应对数据泄密问题。这降低了公司利用用户数据的难度，而用户数据正是发展人工智能技术的核心。\n\n但中国这个优势也可能是一把双刃剑。中国的互联网公司难以向国外扩张，专家称这在一定程度上源于它们对政府的依赖。\n\n“在很大程度上，竞争优势是它们与中国政府的政治关系，而这是没法把带到国外去的，”香港中文大学助理教授徐洛文(Lokman Tsui)说。\n\n此外，在这里并非所有新规定都受欢迎。要求社交媒体平台的用户向公司提供真实身份（尽管依然可以使用网名）的规定，一些公司和网络用户却一直不愿意切实执行。微博招募1000名监督员举报网上的违法内容的公告，在自己的网站上遭到嘲讽。违法内容的定义可能非常宽泛。\n\n“线上线下，老大哥都在看着你，”网名为“mingxinjianxing”的用户写道。\n\n但说到俄罗斯的干预引发的争议，这里鲜有讨论。在少数几个在微博上讨论此事的人中，一些人对美国不审查社交媒体平台上分享的信息表示惊讶。\n\n微博上的年轻志愿者赵金旭，就是支持政府管控者的典型。\n\n在一家叫“欧罗巴”(Europa)的餐厅里，赵金旭说中国的制度与其说是“老大哥”，还不如说是一个弟弟，保护着像他姐的孩子那样的儿童远离有害的东西。他拒绝透露有关自己的工作地点和内容的细节。\n\n“即使互联网是虚拟的，它依然是社会的一部分，”他接着说。“所以在任何地方，我都觉得谁都不应该发布色情、非法或暴力的帖子。”\n\n肩负着这样一个新角色的他，要在微博上寻找艳俗和违法内容。他解释说，一些帖子几乎不加掩饰地索要色情内容或招妓，有一次他就把一条信息报告给了警方，因为那条消息使用了据他说是指卖淫的隐晦说法。\n\n举报后，跟进的是警方。他兴奋地拿出手机，展示自己3000多个微博粉丝中的最新成员：北京警方监督互联网的部门。\n\n“正常情况下，如果不干坏事，就不会被警察关注的，”他说。“我觉得对一个上网多年的人来说，这真的很特别。”",
			"added": 1508297895,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "未被屏蔽的神奇网站",
			"body": "7chan.org、4chan.org、reddit.com 这些网站本身是匿名发帖，且开放自由，除非发实在让人恶心的东西才会被删，里面中文板块人还很少，其他各种话题板块十分丰富，堪比百度贴吧！如此神奇的网站未被墙也是奇葩了！",
			"added": 1511072247,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "刚发现zeronet官网被屏蔽了，几个月前还可正常访问的",
			"body": "还有开放自由网络Beaker browser ,Akasha 等开放自由网络未被当局发现",
			"added": 1513577191,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 8,
			"title": "英国解密六四文件 解放军27军清场 死亡人数上万",
			"body": "据香港01星期三（12月20日）报道，英国国家档案馆上个月解密一批1989年外交机密档案，内容涉及中国六四天安门事件；消息来自当时的中国国务院高层，清场任务由解放军27军执行，过程中有学生、平民和军人中枪，死亡人数上万。\n\n报道说，英国解密的这批文件，内容记录了英国驻北京大使馆、港英政府与英国情报人员对六四前后的中国局势评估以及军事部署。而有关六四天安门事件的消息，来自一位中国国务院的成员。由于当时中国国务院成员包括总理、副总理、国务委员等14人，基于所透露的消息内容十分敏感，这位国务院高层人士的名字，在档案上仍被“涂黑”，身份至今成谜。这位高层人士称，执行清场的是解放军27军，指挥官是时任中国国家主席、中央军委副主席杨尚昆的侄子、杨白冰的儿子。士兵们进京时被告知是进行训练，在清场前10天不准看新闻。文件还披露开枪现场细节称，装甲车一次又一次碾压尸体，再用推土机收集；有1000人获准从正义路离开，但被埋伏在路旁的军人用机关枪扫射；装甲车追上掉队的沈阳军区士兵，并碾过他们等。文件还指出，中国国务院估计平民死亡人数，至少1万人。另外，时任英国驻华大使唐纳德于6月22日拍发的电报称，死亡人数约2700至3400人，且尸体除了停满医院，更堆积在地下人行道内。\n\n报道还说，天安门死亡人数存在多个版本，中国红十字会估计约有2600至3000人。美国白宫解密文件则援引中方戒严部队线民引述的中方内部文件称，天安门及长安街共8726人被杀，天安门以外的北京城共1728人被杀，总死亡人数10454人，与英国引述中国国务院高层人士所述数字相仿。\n\nps:民间知晓此事的人也提到过当年采取的推土机的“清理方式”",
			"added": 1513827138,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 9,
			"title": "文贵春节爆料亮点——江家继承人江志成（1988年生）坐拥五千亿美元财富，韩正名下查明资产约30亿",
			"body": "江家继承人江志成（1988年生）坐拥五千亿美元财富，韩正名下查明资产约30亿，有私生子一名，调查者已纷纷入狱。王岐山坐拥万亿RMB财富，新查出位于美国的八套豪宅，私生子贯军已被DNA检测证实父子关系。\n更多爆料 www.guo.media\n",
			"added": 1519217091,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "关注郭文贵爆料革命，2020灭掉强奸民众的CCP",
			"body": "郭文贵自媒体：www.guo.media\nYouTube：搜索用户 wenguiguo",
			"added": 1546675174,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 11,
			"title": "What TCP/IP Fingerprint do you have?",
			"body": "Just want to know whether mine is different than yours, here's my fingerprint (on both Windows and Linux using Tor Browser):\n检测tcp/ip,浏览器指纹\nLinux 3.11 and newer | Language: Unknown | Link: Ethernet or modem | MTU: 1500 | Distance 14 Hops\n\nYou can check yours at BrowserLeaks https://browserleaks.com/ip",
			"added": 1547176420,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 12,
			"title": "ZeroNet's constant blockade by the Chinese government.",
			"body": "ZeroNet's constant blockade by the Chinese government.\n\nAll the ZeroNet's trackers can't be connected in china now.\n\nAlthough Chinese users can use the “Use Tor meek bridges for tracker connections” button to connect to the trackers, the efficiency is very low.\n\nThis has made it very difficult for Chinese users to use ZeroNet.\n\nI really like ZeroNet.\n\nSo sad.",
			"added": 1547178199,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 13,
			"title": "网管办《网评员内部资料(严禁外泄)》",
			"body": "网络舆论战争关系到中华人民共和国国家政权的生死存亡。为了祖国母亲的繁荣富强，为了中华民族的复兴，每一个网络评论员必须时刻准备着用自己的智慧和艰苦劳动保卫共和国网络防线。 基本工作方法∶ 1、在工作时间内必须每小时至少查看一次工作邮箱，时刻注意领会上级指示的最新精神。 2、网络评论员根据上级指示进行合作，根据工作需要，将由跨地区、跨专业的网络评论员组成工作小组，执行特定的任务。在有必要增加人员时，上级将从其他小组抽调人员加以充实。 3、基本工作方法：日常工作按照网站分小组，每个重要网站的有关论坛由一个小组负责。日常工作是按照总体方针，维护正确的网络舆论导向。遇到突发事件，则按照上级部门的专门工作组的指令行事，暂时停止日常工作，把有关人员资源投入到突发事件的舆论导向工作。 4、网络评论员要善于隐瞒自己的真实身份，必需有多个不同的网名，而且不同的网名要发表不同风格的文章。必要的时候，可以由不同小组成员制造网友辩论的假象，然后由第三方推出强有力的证据， 把公众舆论引导到第三方。 5、某些网络谣言出来的时候，必须尽快搜索到谣言的首发地点和首发人，然后勒令网站管理员删除原贴，网络评论员则拷贝内容，以不同的IP地址发表自己就是事发所在地的当地人的申明，然后由版主或以其他网友身份指出：他的IP地址不在事发所在地，该消息纯属谣传。 6、必要时可以制造更加耸人听闻的假新闻，吸引网民视线，然后很快澄清该消息纯属谣言。 7、某些论坛人气不错，网友信用度比较高，这时首先要做的是制造一种混乱，通过似是而非的文章进行干涉，跟贴作非理性的故意曲解、制造误会和争辩，转移网民注意力。 8、海外网站较难控制，当不能主导论坛舆论的时候，可以采用大量短贴、无实质内容贴、非理性贴进行刷屏，令版面充斥无意义的混乱，使读者失去兴趣，这样达到避免反动思想流通传播的目的。 9、不断学习，提高文字水平，学会使用不同的文笔风格写作，善于模仿他人文笔，这是网络评论员的基本功。 10、学会与网友交流的技巧，与网友私下打成一片，获取网友的信任，尤其是那些文章有影响力的网友。如果有可能，争取一些重要论坛的版主位置。 11、培养高超的判断力，能够在诸多贴子中迅速找到真正有影响力的帖子和写手，作为重点工作对象。 12、注意培养政策法规意识，不可误解当前的工作精神。注意吃透上级指示的近期发贴类型实例，融会贯通，举一反三。 13、灵活性与原则性相结合。一定要制造真假难辨的形象，成为一个不容易被鉴别身份的人。不仅要熟悉我们的观点，更要熟悉对方的思路，知己知彼。 14、网络评论员要时刻牢记自己的光荣任务，不被困难和误解阻挡，不在乎表面上的面子，做到任何情况下不会真正被对方激怒，永远保持理性、冷静的心理。 15、网络评论员要立场坚定，头脑清醒，在各种富有迷惑力的思潮面前保持清醒的头脑，珍惜自己的政治前途。 16、网络评论员实行小组监督和纠察监督相结合的原则。其工作成绩由上级有关部门评定。\n\n中国共产党网络评论员舆论引导工作技巧:\n第一，兵来将挡水来土掩。示例:A：这鸡蛋真难吃。 B：隔壁家的鸡蛋更难吃，你咋不说呢？ A：这鸡蛋真难吃。 B：请拿出建设性的意见来，有本事你下个好吃的。 A：这鸡蛋真难吃。 B：下蛋的是一只勤劳勇敢善良正直的鸡，你还有没有良心？！ A：这鸡蛋真难吃。 B：比以前已经进步很多了。 A：这鸡蛋真难吃。 B：你这么说是什么居心什么目的？ A：这鸡蛋真难吃。 B：隔壁的鸡给了你多少钱让你在这里满嘴乱喷? A：这鸡蛋真难吃。 B：再难吃也是自己家的鸡下的蛋，凭这个就不能说难吃。 A：这鸡蛋真难吃。 B：隔壁家的鸡蛋是伪蛋。 A：这鸡蛋真难吃。 B：没有毛场长，你连这鸡蛋都吃不上 A：这鸡蛋真难吃。 B：要对咱们家的鸡有耐心，它一定会下出更好吃的蛋。 A：这鸡蛋真难吃。 B：隔壁家也吃过这样的鸡蛋，现在是初级阶段。 A：这鸡蛋真难吃。 B：很多家都是因为吃了隔壁的鸡蛋而导致家庭成员冲突、生活水平下降而最终解体的。 A：这鸡蛋真难吃。 B：其实，隔壁家的鸡蛋也一样，天下乌鸦一般黑，世上根本没有好吃的鸡蛋 A：这鸡蛋真难吃。 B：我怀疑你是轮子。 A：这鸡蛋真难吃 B：鸡蛋好不好吃，全体蛋鸡最有发言权 A：这鸡蛋真难吃 B：你丫是脑残",
			"added": 1547271510,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 14,
			"title": "2019年8月4號 即將對香港戒嚴的緊急通告",
			"body": "https://www.youtube.com/watch?v=OjrOGbsFPlE  /\n\nAn emergency declaration of martial law in Hong Kong is expected on August 4th\n\n一．共產黨：將在8月4號宣佈根據解放軍駐港法．國家安全法．由香港政府申請·駐港部隊對香港戒嚴。\n\n    The communist party: will announce on August 4th that based upon the PLA Garrison Law and National security laws, the Hong Kong government has requested martial law be enforced by the PLA army stationed in Hong Kong.\n\n二．戒嚴條例將規定．對香港．社會治安．人員進出由戒嚴指揮部統一指揮。\n\n    The safety of Hong Kong, public order. and the entry and exit of personnel shall all be under the unified direction of the martial law command.\n\n三．戒嚴指揮部將對香港的人員進出大規模限制，基本上是只許出不許進，並將定向清理美國和歐洲國家在香港的駐港機構及持有美英護照的外籍人士。\n\n    The martial law command will impose massive restrictions on the movement of people in and out of Hong Kong, essentially barring them from entering but allowing them to leave the territory freely. They will also clean up U.S. and European institutions based in Hong Kong and foreigners with U.S. and British passports.\n\n四．駐港部隊實施戒嚴的同時，香港警察將對6月九日以來的和平抗議的人士進行大抓捕……\n\n    The Hong Kong police will make many arrests associated with the peaceful protests which have occurred since June 9, as troops stationed in HongKong impose martial law.",
			"added": 1564748906,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 15,
			"title": "数字世界：消除数字足迹",
			"body": "不慎数字足迹,，ccp将了解他们所做的一切，包括他们在街头的活动。Tor，I2P，Freenet和ZeroNet。这些是为此目的而设计的暗网。查找它们，安装它们，使用它们。对于活动家，我不得不在暗网模式下推荐使用bridges和Freenet的Tor，ZeroNet也可以在Tor之上运行，I2P也可能是可行的，虽然不难说你正在连接它。不要使用Google，不要使用微信来组织抗议活动。加密您的通信。 Privacytools.io拥有出色的资源。加密一切毫无例外。如果你清理你的数字生活，请帮助另外5名活动家清理他们，并让这5个人帮助5个人。把香港变成一个数字堡垒，一个四面都有被暴政包围的自由堡垒。如果您担心自己的隐私，请在上街时掩盖。遮住耳朵，耳朵和指纹一样独特。匿名出现比坐在家里更好。",
			"added": 1565449441,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 16,
			"title": "动动手指到白宫请愿，将共匪定义为恐怖组织！",
			"body": "共匪作恶多端有目共睹，大家联合起来，墙倒众人推！\n请愿地址：\nhttps://petitions.whitehouse.gov/petition/call-official-recognition-chinese-communist-party-terrorist-organization\n发送成功后会收到确认邮件，请再次确认，白色恐怖下切记不要用国内邮箱作死！",
			"added": 1566704849,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 17,
			"title": "大家在尽量保证自己安全的前提下多多传播香港的真相吧",
			"body": "为港人，为自己，团结一致即是为民族的前程，人类的安宁而战！人一生参与几件改变历史的大事既是骄傲的谈资也是无愧于心，没有白活！\n真相来源，全球各大媒体报道，香港苹果新闻，大纪元，郭文贵爆料。真相经得起时间的检验和逻辑的推敲，假大空都是口炮，前后矛盾！",
			"added": 1567779775,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 18,
			"title": "转：编程随想——香港“反送中”政治抗议活动大事记（8月初至9月初）",
			"body": "看看黑警察是如何鱼肉百姓的\nhttps://program-think.blogspot.com/2019/09/weekly-share-137.html",
			"added": 1568168956,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 19,
			"title": "香港人的抗争经验",
			"body": "文明、自由、正义的力量终将战胜邪恶的专制极权\n來源：\nhttps://twitter.com/newanan1/status/1174623178381045761?s=21\n(仅供参考)\n香港人的抗争，让我看到了这些：\n\n1 英语非常重要，是他们赢得文明世界支持的重要因素\n\n2 他们懂得”圣经”，用”大卫战胜歌利亚”的圣经故事来比喻他们的抗争，很多英文媒体都这样引用了，这个故事很多中国人（甚至在海外的）都不知道，因为从小没有阅读过”圣经”。\n\n3 他们模仿”波羅的海之路”组成人链，和平而有力地向文明世界表达自己的诉求，说明他们对文明世界争取自由的历史非常熟悉。\n\n4 他们去美国国会作证，去德国，日本等演讲，坦然用英文面对各种提问，甚至是故意来找茬砸场子的提问，他们都镇定自若，有理有据，没有CNMB，QP这种脏话，也没有法拉利跑车车队，但是却赢得了文明世界的尊重和支持。\n\n5 他们不怕死，不懦弱，不厚黑，不争权夺利，不畏首畏尾，不患得患失，不坐等别人牺牲来换取自己的自由，而是每个人都去尽自己的努力。他们不追求饲料，而是追求子孙后代的自由和幸福，这点追求饲料的人无论如何都理解不了，因为认知层次太低，分分钟盯着饲料，世代为奴也心甘情愿。\n\n6 他们创造了香港版Lennon wall 墙，说明他们对文明社会争取自由的历史十分熟悉。\n“連儂牆最初是指位於捷克斯洛伐克布拉格的牆，填滿了約翰·連儂風格的塗鴉和披頭四的歌曲歌詞作品。1988年，這面牆成為了刺激古斯塔夫·胡萨克共產主義政權的表達方式。”\n而中国学生很少知道连侬墙的来源，只知道去撕毁破坏覆盖别人的自由表达，而不是立起自己的连侬墙也来表达自己的意见和观点。\n中国学生还不懂得尊重别人的自由表达的权利，他们觉得破坏别人的自由表达是他们的权力，其实是他们的无知和野蛮粗鲁。\n\n7 香港学生是全世界最干净整洁，最礼貌优雅，最文明纯真的抗争者。 他们抗争后，会去清理垃圾； 抗争时，会自动给救护车让路； 手拉手时，会用特殊消毒液清洁手以免传染病菌； 手拉手时，少男与少女不好意思，用笔，用雨伞作为中介 很多老外的评价都是：太可爱，太纯真了。\n反观中国这边的，抗议完，小红旗就扔地上，满地都是，满垃圾桶都是。 大声喊着空洞的口号（没有国哪有家）脏话（CNMB，QB）用手指不停地指对方，特别粗鲁特别下流！ 没有选票的奴隶奴才，是没有国家的，中国战狼红卫兵二代认知层次太低，永远不明白自己的奴才身份，世代为奴美滋滋！\n\n8 这些香港孩子们，手拉手和平表达自己的诉求时，穿的英式校服，民国校服，简直美极了，帅极了！ 反观中国学生的松松垮垮的运动套装校服，简直就是土得掉渣，质量一看就是校长们贪污了校服费用做出来的渣渣！\n\n9 香港学生的抗争，目标非常明确，五大诉求，缺一不可，没有假大空的口号，没有故弄玄虚装神弄鬼的神秘，与直来直去的，逻辑思维严密，尊重常识和事实的西方思维非常吻合。 而且骨头够硬，一直坚持抗争，不向红色恐怖低头！\n\n10 香港学生与大多数中国人（学生或者非学生）认知层次完全不同。\n香港学生就像欧美人一样，对于大数据高科技非常警惕，对于私人信息非常注重保密，他们直接去把智慧灯柱推倒！\n而大多数中国人是把大数据作为一种让他们骄傲自豪的高科技来膜拜的，完全不在乎隐私被侵犯，是认知层次低端的体现。\n\n11 香港学生的抗争，没有什么”皇帝是好的，只是下面的某个奸臣坏”之类的中国文化的千年愚昧，他们不求什么包青天，而追求的是文明世界的民主自由，选票，不是猥琐油腻，表衷心的奴才维权！",
			"added": 1568972993,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 20,
			"title": "10月1日下午，香港黑警察开枪射杀示威群众！",
			"body": "10月1日中国共产党粉饰太平、伪装强大的国庆阅兵的当天，在香港！黑警们已经开始了屠杀，六次不同地点的对港反送中青年开枪，并且造成伤亡！香港特别行政区政府死了！从对香港市民开枪的那一瞬间特别行政区政府已经失去其合法性，这都是共产党他们的计划，伪香港政府按部就班的执行，残酷的执行！血腥的执行！ 国庆70年参加阅兵的人们！雄赳赳的士兵们！欢天喜地的孩子们！载歌载舞的女士们！你们可知道！我们翻看下共产党的历史，70年合计：25550天，共产党哪天没有杀人？\n49年到76年中国大陆非正常死亡4000多万人！！！！简单计算下4000万（人）除以25550（天）每天杀害1568人！！！！！！现在共产党杀到了东方之珠的香港，准备把香港变成地狱、变成死港！拿下香港他们还要继续…..不会停的！会到台湾、到欧洲、到美洲一直到全世界，共产党这个蔓延迅速的恶性肿瘤，是世界万恶之根！团结起来吧！\n10月2日凌晨24:00左右！在共产党的70年伪国庆结束的同时，港特别行政区警务处处长卢伟聪答新闻记者问，并对当日不同地点黑警六次对香港同胞开真枪事件表示支持，郭文贵先生解读为这就是对香港同胞的“屠杀令”！\n在中国北京白天是共产党给中国人民虚构的一个国富民强的天堂局面，到了晚上的香港共产党就为香港同胞开启了地狱之门，共产党之邪恶举世无双，谎言与恐吓同时、欺骗与屠杀并用！香港同胞务必保护好自己，10月是香港同胞最黑暗时期的开始…中共不灭、天道亡矣、中共不死、人道不存、中共不亡、地道亏缺\n纳粹当年的宣传部长，戈培尔，现在的王沪宁说了一句话，当我们把谎言说一千遍，一万遍的时候，就将变成真理。所以我们要把全德国所有的宣传机器都变成我们的工具，和我们的武器。当时希特勒有一句话，不管我们坦克有多强大（因为当时西门子和奔驰宝马集团，给他创造了世界上最大的坦克，杀伤力无比，相当于今天的核武器），不管我们有什么样的坦克，都不如我们讲一段视频，都不如我们拍一个好电影，都不如让所有的这些孩子们，让他们100%臣服于我们！\n详见：搞阅兵的独裁政党，后来都怎么样了 https://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_1c2285d120b82d473efc4f710ac4d316.pdf\n\n宣传的作用远大于武器的作用！荣耀定会照耀香港台湾和中华大地！ 重温鲁迅的《纪念刘和珍君》：\n视频证据 \nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_8ac05a5b88dd7c43edb678220230567f.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_f9af921f62ec4787271e82af3efec79c.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_63d64ecbc71b0682312a54e018f8a643.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_021b78d52c383abe37e27c0c85ba58d3.mp4\nhttps://d57iplyuvntm7.cloudfront.net/uploads/videos/2019/10/guomedia_b5c7945e73ee647582d9559fd185af6c.mp4\n时间：10月1号下午4点40分, 4点51分，5点21分, 5点43分 地点：香港荃湾 \n黑警四次真枪(38mm口径)近距离射杀示威者，一名未成年示威者头部中弹，已无生命体征，其余多为心口中弹。 真枪！大开杀戒！手枪型号：史密斯韦森M10HB型，弹头 3.8 Special +P弹\n                                                                                      一切镇压学生的人都没有好下场！——腊肉毛\n",
			"added": 1569932958,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 21,
			"title": "1.网络文革已来 2.大搞阅兵定会导致政党解体的原因",
			"body": "国内网络环境与文革社会环境比较：\n天朝网络环境接近或已达到文革时社会环境的水平，比如高唱赞歌，歌唱祖国vs歌唱毛主席；\n恶意举报，反对不和谐声音；\n到处宣传伟光正vs到处贴大字报；\n崇拜祖国崇拜红旗vs崇拜毛主席;\n……\n原因：从消费苦难到引出救世之神共产党，再到爱国、爱党、维护神的地位才能保证生活安稳不至于再入苦难，爱国光荣！由人类对神的崇拜敬仰被土共改为对伟人、母亲、祖国的敬仰，将政党和国家混为一谈，进而和母亲绑在一起，将土共奉为守护神奉为母亲，进行奴化宣传。这样一整套心理引导，使得人们对恶党产生崇拜和维护！\n\n历史上盛大阅兵，多次阅兵导致执政党衰亡的原因：\n大清朝晚期国力衰微，慈禧大搞大寿加速清王朝解体，\n希特勒大搞阅兵，柏林大兴土木，军队大搞研发，结果一样被灭，\n……\n当今贸易战，全国经济衰微下搞盛大阅兵和慈禧大寿没什么区别，只会加速政党解体！\n原因：统治者在高台上看着下面所谓群众一片歌舞升平，高唱赞歌，必然会内心膨胀，狂妄自大，进而做出疯狂的决策，比如将暴力镇压香港市民，跟美国死磕贸易战，甚至出兵台湾这样的想法或计划加紧付诸实践，这些计划和盛大阅兵在一起无疑加重百姓负担，使得经济雪上加霜，加速土共土崩瓦解！\n阅兵是外在表现和标志，根本原因还在于统治者狂妄自大，鱼肉百姓\n \n题外话：键盘侠一词是人民日报首创的，自己天天搞宣传是就是伟大光荣正确的，别人搞宣传就被定义为键盘侠！别忘了鲁迅的笔杆就是枪，纳粹宣传部长说的宣传强于武器的言论！",
			"added": 1570246967,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 22,
			"title": "Tor更新至9.0后无法连接ZeroNet解决办法",
			"body": "地址栏输入about:config 找到network.proxy.no_proxies_on ，填入127.0.0.1, localhost",
			"added": 1571980361,
			"parent_topic_uri": "8_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 23,
			"title": "共产党占中七十年",
			"body": "2019.11.10\n\n作者：【文见岐】\n\n中共建政之前，民国有三位先知先觉者对中共洞若观火，他们是汪精卫、蒋介石和胡适：\n\n1923年8月，蒋介石赴苏考察三个月以后在日记里写道：“毁灭本国伦理与历史”，“手段最毒，情义与道德扫地无余”，“唯物主义将使中国降入禽兽之域”。退守台湾时更留下惊人一语：“中国民众不受到十八层地狱的痛苦，不会觉醒的。”蒋介石败退台湾后，谈到知识分子被蛊惑，农民被煽动时，总是说：“他们不下十八层地狱不会觉醒，迟早会看到报应。”\n\n汪精卫说：“我和共产党头目们打了好几十年交道了，共产党这个葫芦里所卖的药是何其剧毒，我是很精楚的，无论如何共产党这个贼船，我是不能再上了。何况我之所以脱离重庆走曲线救国的道路，就是为了消灭赤祸，共产党无论走到哪里，就把饥荒、内战、烧杀、愚昧、落后带到哪里。”\n\n胡适离开大陆后說：“大陆从此必成为一个流氓社会，人心糜烂，道德信仰无存，奢淫虛假并存，成王败寇的流氓法则必貫穿始终，斗与抢成为主旋律，权力与金钱成为行尸走肉的唯一追求，民族全体堕落，历史再无荣光！ ”\n\n自从了解历史真相和认清现实，我总觉得“解放”二字确实是对中国人的一种侮辱。七十年来我们到底被解放了什么？土地权利，没了；文化道德，丢了；环境资源，毁了；个人财产，抢了，而且转移走了，甚至连民众的生命权与生存权每天都在经受着严重的威胁，这就是共产党“解放”中国的真正意义！\n\n70年前,美国上了毛骗子的当,不再支援蒋介石,从而让共产党灭了国民党,中国死了近亿人；20年前,美国又上了江骗子的当,让共产党加入世贸组织。中国人民不仅没富起来,还让中共不断壮大,成为全世界最大的恐怖组织，中国人民从此陷入物水深火热之中万劫不复！而今面对香港、台湾，美国若再次失策美将万劫不复，全世界都遭殃！\n\n英国哲学家洛克 (John Locke) 在《政府论》中说：“权力不能私有，财产不能公有，否则人类就进入灾难之门”。中共的70年，就是财富完全公有化的70年，权力完全私有化的70年。中国的现实就是，一个人领着6个人，带着200多人，招募8000万人，控制十三亿人，只为确保（五百个红色家族）五千多人的利益。中共统治的70年，人民早已经被猪狗化了。这是它们的四化之一，官员贵族化，军队家丁化，国家监狱化与民众猪狗化才是真四化。\n\n孙立平教授说:”你看到现在岁月静好的一群人，在全世界旅游，购买奢侈品的的游客占14亿人的比例不过是几千万人，他们是退休的官员，大国企的员工，有编制事业单位的人员，和少数发了财的民企老板和高管及其家属，在当今的世界上，没有哪一个发达或者不发达国家，有如此不公平的福利分配制度。现在的问题是盛宴的末尾，酒没了。“\n\n某官员酒后吐真言：再过20年，中国还有什么？算一笔向简单的帐，目前中国5%的人掌握了中国95%财富，而这5%的人已经移民或者正在办理移民，这意味着，20年后这95%的财富不再是中国人所有，那是，中国还有什么？数亿老人+一片被污染的山川河流+地底下没有资源的土地..\n\n现在我们来看看改革开放的巨大成就：\n\n1. 房价涨2083倍；\n\n2. 大米上涨26.66倍；\n\n3.  培养一名大学生：1978年从小学到大学学费140元，现在从小学到大学150,000元，上涨1071倍；\n\n4.  房租：1978年100平平均月租1.2元，现在100平平均月租2500元，上涨2,083倍。\n\n5.福利不变，讨薪违法，上访有罪。\n\n郎咸平统计，中国最低年收入不到世界平均水准的15%，全球排名159位，最低工资占国内生产总值GDP的比例同样为159位，甚至低于32个非洲国家。\n\n张维迎说:“过去10年,中国的社会理念发生了巨大倒退，从市场导向倒退到政府导向;从“民进国退”倒退到“国进民退”;从“发展是硬道理”倒退到“和谐社会”,更加关心财富的分配而不是财富的创造;从“建立法治国家”倒退到“稳定压倒一切。”\n\n20年前，当无数的专家对中国奇迹‘后发优势’深信不疑时，只有杨小凯清晰而坚定地指出：如果不改革制度，技术带来的增长只会助长政府的机会主义，导致官企膨胀，吏治腐败，最后让国家坠入深渊。\n\n张维迎教授说：过去30多年，中国经济取得了举世瞩目的成就。这一成就是建立在西方世界过去300年发明创造所积累的技术的基础上，支撑中国经济高速增长的每一项重要技术和产品，都是别人发明的，不是我们自己发明的。我们只是套利者，不是创新者，我们只是在别人建造的大厦上搭建了一个小阁楼，我们没有狂妄自大的理由！\n\n清华大学孙立平教授说:“中国经济这40年是取得了巨大的发展，这是不可否认的，但是他不认为是奇迹，而是政府变卖的千年以来的土地。土地的价值本来就在那里，只不过是今天把它变现透支的未来百年的生态环境，现在和今后100年都要为过去的透支的环境来买单，而且这个单越来越贵，并不产生价值。“孙教授接着说:”逃避了应该给农几亿民工应有的社保和各项基本福利的责任，让那些为中国建设付出一生岁月的几亿农民工老无所养，病无所医，孩子在城里没有受教育的机会。“\n\n有人总结积红旗下生长六十余年之经验:“凡搞到民不聊生，民声鼎沸之时，政策就右转，困难时期之后如此，文化革命之后亦如此。但一旦形势好转，刚有国泰民安之像，政策就会左转，不搞到“国民经济临近崩溃边缘”就不转向。难道就没有摆脱这恶梦般循环的办法吗？资本主义的经济危机是客观规律，难道中国社会的政治经济危机也是一种规律？”\n\n程晓农教授说了一段很深刻、很到位的话：“很少有人谈改革开放前30年的成就和后30年的成就是什么关系。要稍微想一想就会发现，这里面存在一个很大的悖论。改革的对象是什么呢？改革改的不是60年前国民党时代的体制，改革改的正好是革命的成果，改的就是30年革命的计划经济、人民公社、公有制。换句话讲，改革其实就是对革命和社会主义建设的全盘否定。再进一步看，60年走下来的结果是中国在经济体制重新回到了原点，回到了1949年以前。今天中国讲改革开放取得巨大的成就，中国初步建立了市场经济体制。可是，我们可以问一个问题，1949年以前中国什么体制？那时候中国就是市场经济体制。那时候也对外开放，所有的人想出国就出国，没有控制的，很自由。那么，为什么中国要用革命去把市场经济体制消灭了，花了30年时间，然后再花30年再把它重新建立起来？”\n\n50年代，政府将私有土地和私有财产全面国有化，作为交易，承诺老百姓你的工作、医疗、养老、子女教育政府全包了。而改革开放30年后，百姓的工作、住房、医疗、养老、教育，政府全不管了推回给老百姓。可当年的私有土地和私有财产，并没有还给老百姓……\n\n但我觉得前30年是最好的时代：那一段光阴是最好的，刘得到了报应，林得到了报应，彭得到了报应……老舍跳了湖，傅雷上了吊……山东推鸡公车的百万大军饿死了大半……你看苍天放过谁？后30年，时代没落，畜牲们想通了，伙起搞钱搞女人……这几年渐渐又回文革，我就知道，报应要来了。\n\n前30年，人人都有罪：知识有罪、富裕有罪、见识有罪、才能有罪；所有的看、说、听、想都可能有罪。后30年，处处都有毒：吃的有毒、喝的有毒、呼吸的也有毒，主要是人心第一毒。前30年，劳动者特穷；后30年，劳动者不但穷，还要供养一群不劳而获的仆人。\n\n文革会伤害中国两次:一次是文革本身一次是从文革成长起来的那批人。现在社会上“文革二代“也出现了。当年文革一代在街上拦路剪人家裤管，说是资产阶级生活方式。打砸别人家里的红木家具，说是封资修毒害。现在的“文革二代“，在肯德基门口，骂人家吃肯德基的卖国。搜索别人纹身，随便扣上黑社会帽子。打砸别人商店门口的圣诞装饰，说是西方文化侵略。\n\n“改革开放”40年来夹缝中，中国人有过两次难得的觉醒。一次是八十年代，因为公权力有限度地收缩，不再肆意干涉私人生活，中国人开始从权力边缘醒来，只用了短短十余年的时间，中国的思想、文化和艺术就达到了空前的繁荣。再就是互联网时代，特别是有了微博和微信之后，短短几年间，中国社会又有了巨大的改变，无论话题深度、广度，还是参与人数，都远远超过了八十年代。此为第二次觉醒。让我们看看，这两次觉醒，能为中国带来什么变化吧！\n\n以上內容仅代表作者个人观点",
			"added": 1573356638,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 24,
			"title": "新一轮的斗地主，批评与自我批评的相互斗争，台湾或中东的战事已在准备中",
			"body": "新一轮斗地主，利用老百姓仇富心理、扣上诸如非法经营，涉黑、偷逃税款，虚开增值税发票，消防失火等罪名开启斗地主的大幕！和近些年的所谓反腐一样。\n利用批评与自我批评让党员，老百姓相互斗争，利用自我批评进行钓鱼。公检法内部因孟建柱斗争已来。\n利用台湾或中东战争对军队进行进一步的清洗，达到绝对控制军队的目的。\n利用所谓自研区块链货币取代美元，控制全球金融，甚至控制暗网比特币。\n信息部队发威香港，依四中全会决议大抓捕，万人以上。\n公检法进入备战状态，以黑治国以警治国。\n国内信息战已全面开始，清网，抓捕！赵乐志下达死命令，国内网友注意安全，隐藏沉默，等待胜利！网络战他们赢不了，信息时代的他们很愚蠢。",
			"added": 1573874489,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 25,
			"title": "掌握路由组网 cisco , winserver, linux 便于断网时能重新组网",
			"body": "如题，伊朗断网是个警示",
			"added": 1574347797,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 27,
			"title": "Yggdrasil  基于 IPv6 的点对点加密网络 ",
			"body": "1PffaPsQp81gec3GbLDTzH3cY57WuRfC36\n\nYggdrasil is an early-stage implementation of a fully end-to-end encrypted IPv6 network. It is lightweight, self-arranging, supported on multiple platforms and allows pretty much any IPv6-capable application to communicate securely with other Yggdrasil nodes. Yggdrasil does not require you to have IPv6 Internet connectivity - it also works over IPv4.\n\n Yggdrasil anonymous\nIt is not a goal of the Yggdrasil project to provide anonymity. Your direct peers may be able to determine your location if, for example, you are peering over the Internet.",
			"added": 1575884215,
			"parent_topic_uri": "81_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ"
		},
		{
			"topic_id": 28,
			"title": "文贵庄严声明,最近在网络上疯传的文贵需要比特币捐款的信息是由加拿大和美国几个惯犯诈骗者干的",
			"body": "12月9号：尊敬的战友们好！文贵庄严声明.刚刚在网络上疯传的文贵需要比特币捐款的信息是由加拿大和美国几个惯犯诈骗者干的……有共产党的平爆小组在背后操作…这是诈骗行为.请大家不要上当.应将上传信息马上删掉！文贵再次庄重承诺.文贵永远不会向战友们伸 手要捐款！或任何的商业利益！爆料革命就什么业务运动不会有任何利益目的！一切都是刚刚开始",
			"added": 1575981473,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 29,
			"title": "提防中共债务转移收割韭菜",
			"body": "来源: www.guo.media\n2019-12-05 17:16\n\n根据路透社12月5日报道，“国四大资产管理公司–信达资产总裁助理向党周四表示，今年以来不良资产包供给总体平稳，但结构上出现变化，体现在国有大行占比呈现下降趋势，区域性的城商行、农商行则出现上升，同时非银行金融机构不良资产供给亦持续增多。”\n\n反常的不良资产逆流\n\n今年中共国经济持续走低，到处都是金融暴雷，P2P跑路暴雷那些已经不算新闻。产业巨头连续出现债券到期违约现象更致命。例如前天才爆出高科技龙头北大方正20亿债券到期违约不能支付本息的新闻，另一只高科技龙头清华紫光的债券也被低价抛售。而今连这些中共国的老牌科技龙头（在中共国的地位这两家公司相当于美国的微软、苹果）都出现债务违约，连借钱还本付息都做不到，只能赖账，可见现在经济多么差，债务多么严重。\n\n银行以放贷和购买债券赚取利息差价为主要的盈利方式，像北大方正这些巨头，无论是政策扶持还是银行的资金管理需要，都是国有大行的大客户，放贷肯定少不了。企业债务肯定牵涉银行，为什么在企业连续债务暴雷的情况下，国有大行反而出现不良资产下降的逆流？ 难道他们有什么神仙手段，起死回生？真这么厉害，为什么国有四大银行前几天高层才大换血？\n\n物以反常为妖，作为平常人我第一反应就是报表作假。这个对中共国所有的企业真是再平常不过的事情。在中共国除了造假是真的，还有什么是真的？\n\n毒水倒灌，水毒人更毒\n\n但当我再看下去“区域性的城商行、农商行则出现上升。”细细品味这句，才真正让我倒吸一口凉气。把债务比喻成毒水，这样读者可能容易理解一点。毒水（债务）排出了那么多，大池塘里面的毒水少了，而小池塘的毒水在涨，这只能证明大池塘把毒水排到小池塘里。\n\n读者看到这里可能有点转不过弯，以前都是地方银行出现问题，上面给兜底。现在怎么反过来，把债务转移到地方银行？以前是中央和四大行还能撑住，可以慢慢吸收消化小池塘排出来的毒水，现在他们都撑不住，不再保地方银行。这只是第一步，不管。\n\n第二步，就是倒灌毒水，弃卒保帅割韭菜。例如，某城商行有资产1000亿，债务却达到2000亿，资不抵债，要完蛋。既然都要完蛋了，它负债2千亿完蛋，跟负债5千亿完蛋有什么区别？在它完蛋前，把国有大银行的债务转给它，让它尽量再多吸收点资金，送回给要给的人和部门，然后让其死亡，国有大银行的债务清理完毕。而储户呢？债权人呢？根据国家法律，银行倒闭，无论存多少百万千万亿，储户最多能拿回50万元。\n\n墙内韭菜注定悲剧\n\n或许有墙内的聪明人到这里会想：我如果在城商行倒闭前多借钱，岂不是不用还了？例如，我多借钱买几套房，银行倒闭我就不用还按揭，岂不是拿个首期就白得几套房子？我只能说如果你这么想，就实在太天真了。银行清算，资产管理公司主持，把优质资产先放进自己腰包，像阁下这种债务就属于优质资产，你欠的按揭必须每月归还，只是现在向你收账的换了公司而已。\n\n当然，如果墙内的你属于月光族，这股毒水没淹到你。但如果你是一个企业主，商人，有产一族，跟这些地方银行有很多资金来往的话，那就很惨。举个例子，某人开个厂子做老板，生意十分稳定不会受经济环境影响，投资了几套房子（什么学区房以后孩子结婚用房退休养老房全部买好），每个月的收入足够还按揭款吃喝玩乐有余。平时资金往来也放在这个地方银行，有好几百万作为公司经营的流动资金，生活美满岁月静好。\n\n晴天一声雷，这家银行倒闭了。几百万的存款等几个月清算完毕后也只能拿回50万，但欠着的按揭还是要每月定期归还，最惨的是，资金往来也被冻结，收到的货款拿不到，但根据合同货还是要给客户出货。员工工资、经营开销、备货全部都要钱，现在除了债务，钱还有吗？资产还有吗？一个好好的企业家，从富翁变成负翁，只是一瞬间的事。\n\n我举的例子并不是真的，但地方银行用比较高的利息吸纳资金，然后倒闭，千亿万亿存款资金化为乌有确确实实存在。其中多少个企业家、富裕家庭受害？多少人多少家庭，能经得起这种冲击？\n\n岁月静好的路上，到处都是大坑。\n\n以上内容仅代表作者个人观点\n\n作者：眼镜小哥（文鹰）",
			"added": 1576073322,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 30,
			"title": "为中共效力是什么下场",
			"body": "這裡有為中共效命的知名科學家，有對中共衷心耿耿的家臣，有顯赫的軍方人士，也有體制內的高官。但無論他們過往有多少汗馬功勞，一旦被懷疑對中共不利，就毫不猶豫地被消失。中共邪惡如此，罪惡累累。中共不滅，天理不容！\n详见 https://spark.adobe.com/page/umQ3HztSf6TyI/\n\n企業家本是社會精英，然而在中共國，他們卻只充作提款機和遮羞布，他們看似風光無限，實則危若累卵，他們看似掌控一切，實則身在地獄。中共為刀俎，他們為魚肉，予取予奪，毫無顧忌。今天大批企業紛紛倒閉，黑雲壓城城欲摧 ，冬去春來，否極泰來 ，是否新中國曙光在現\n详见 https://spark.adobe.com/page/FRJn9Lsy5ThZ8/",
			"added": 1576242643,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 31,
			"title": "《网络信息内容生态治理规定》",
			"body": "全文 http://zw.china.com.cn/2019-12/20/content_75533761.html\n鼓励网络重点板块积极呈现习思想、党方针，通过抢占网络热门页面、热门搜索、榜单弹窗来最大限度最大力度地来给中国民众洗脑，形成天天必有习思想、夜夜须有党方针的全方位体系，通过知识平台、游戏平台、动漫平台打造网络版“八股文”。如果中共体制不灭，之后我们青年一代网络生活的每一部分都将会充斥着这些中共邪恶的思想。而且中共还针对“专门以未成年人为服务对象”的网络生态，中共不但要侵蚀我们，还要侵蚀我们下一代的思想。\n\n中共的抖音已经占领全球视频平台高地，为各国推送中共的“社会主义核心价值观”，抖音还曾封掉讲述新疆真相用户的外国账号，将言论审查带到世界各地。中共的大外宣通过蓝金黄各大自媒体、报社，通过中共自己的《规定》中的“虚假注册账号”、“操纵用户账号”以及层出不穷的五毛粉红抢占推特、油管的各大自媒体高地，带偏风向，“破坏网络生态”，给世界各国洗脑，掌控各国舆论风向。不仅如此，中共还将网络言论审查带到推特，在2019年5月31日对爆料革命战友推特进行大封杀。中共的华为、中兴如若不是美国的出手拦阻恐怕也已经占领各国基站、硬件高地，而这又是网络生态的基础，这些间谍设备自带的审查和监控舆论的功能将让世界陷入中共的“文字狱”。\n一切都表明中共正在将其在中国境内运转良好的网络“八股文”“文字狱”推广到全世界，如果世界各国不警醒，世界将陷入中共的“奥斯维辛”网络空间。王岐山掌控的在暗网的暗势力，中共想要推行的区块链技术，都不得不是世界各国面对的一大恶魔。如果中共体制不灭，如果中共侵略世界网络生态成功，中共的《规定》实实在在的成为世界各国的“规定”，而盗国贼也将利用《规定》操控世界网络生态，达到奴役世界人民的目的，世界人民也将陷入中共网络的“奥斯维辛”。",
			"added": 1576986825,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 32,
			"title": "天网的诞生",
			"body": "发布：GM30  https://gnews.org/zh-hans/61420/\n\n1998年由江泽民之子－江绵恒所启动的一套网络安全软件，于2003年9月开启，2005年底完成，2006年11月16日,一期工程在北京正式通过国家验收。其对公众介绍是：为中华人民共和国公安部设计，处理中国公安管理的业务，涉外饭店管理，出入境管理，治安管理等的工程”，美其名曰：金盾工程。\n\n金盾工程是CCP而实施的“金字工程”（又称十二金工程）之一。其他金字工程还有金桥（公用经济信息）、金关（对外贸易）、金卡（电子货币）、金财（财政管理）、金农（农业信息）、金税（税收）、金水（水利信息）、金质（质量监督）等。\n\n其目的是封锁和监视网络各个环节（电信与网络服务提供商）、行政、公安、国安、宣传等很多部门，其开发的原因是网路突破封锁的手段越来越先进，CCP堪称全世界独一无二的防火墙已经落后，因此中共投入巨额资金开始建立一个庞大的网络监视与封锁系统。\n\n.........................\n\n如何防范天网系统\n\n手机定位追踪\n\nGPS、WIFI定位技术对手机用户进行定位和追踪已经十分普遍，即使是将手机关机，也仍然被定位。事实上，手机仅单纯关机与没有关机，在定位追踪时，两者并没有什么不同。要想真正的摆脱定位、追踪，除了关机，还要把电池取出来，才能达到预期的效果。\n\n通话或发短信避免频繁提到所谓“敏感”词\n\n天网使用到了“语音识别技术”，可以对通话中的特定词汇进行过滤、筛选，从而锁定特定通话对象。以文字形式的发短信行为更不必说，监控的技术不但更加简单，效果还比语音更上一层楼。因此打电话和发短信应避免提到所谓“敏感词”，以免被列入监控或抓捕的行列。\n\n尽量避免使用国内软件\n\n在中国大陆境内，各类国内软件多多少少都留有后门、病毒。\n\n使用境外知名邮箱\n\n国内邮箱，如163邮箱、QQ邮箱、新浪邮箱，甚至yahoo.cn的邮箱，均无任何安全性可言。\n\n电脑文件尽量不要使用“敏感”文件名或保存“敏感”文件\n\n“腾讯QQ”和“奇虎360”软件也常常未经授权肆意扫描用户电脑内的所有文件并自动上传到其服务器，已是众所周知的事实。\n\n尽量选用谷歌浏览器、火狐浏览器\n\n访问境外网站，也须确保网站的可靠性\n\n随着CCP花费巨额百姓财富大搞所谓“大外宣”计划、争夺所谓“话语权”，包括一些境外网站在内的部分境外资讯来源，已经发生了改变。他们有的由中资入股、控股，甚至全额收购，成为为共产党卖命的贩夫走卒，不单资讯内容大陆化，其网站也被纳入“金盾工程”，常常潜藏针对异议、维权等群体的木马、病毒陷阱。因此尽量避免上那些不可信的网站（如明镜网）。\n\n身份证的安全使用\n\n第二代身份证使用了RFID射频识别技术，内含晶片，具有远距离自动感应功能，而身份证在制作或更新时晶片内已经被公安植入公民的各种私人信息，如姓名、身份证号、照片等等，因此，如果您属于“敏感人士”或已被公安盯上，就得小心了。\n\n加密数据、清除痕迹、不留证据\n\n尽量不在“正规”网吧上网\n\n不在QQ群等国内聊天工具上谈论敏感话题\n\n",
			"added": 1577718361,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 33,
			"title": "小巴猪：中共强大的原因之一——统一思想、统一行动",
			"body": "By GM06 - 2020-01-04 17:58\n作者：小巴猪\nhttps://gnews.org/zh-hans/73350/\n\n中共这个组织，非常邪恶，但是也非常聪明，他们知道中国人的弱点，也知道怎么对付中国人。\n\n简单来说中国人就是团结不起来，于是中共反其道而行，他自己不管内部怎么斗争，内部永远是统一思想、统一行动，对外则恰恰相反，分化瓦解。\n\n比如抗日战争时期，蒋介石抗日，他在后面打蒋介石，蒋介石去消灭它，他就指责蒋介石不抗日，用所谓民族大义来分化国民党，后来弄出一个西安事变。\n\n西安事变就是国民党党内分裂，就是共产党操纵的，他们不是拿枪逼着张学良搞分裂，他们是用花言巧语，用正义，用民族国家，用爱国救国这些东西去分化，他们是让张学良觉得自己是对的，蒋介石打击共产党是做错了，下定决心救国救党才发动的西安事变，这就是共产党分化对方的手段，百试不爽。\n\n后面发生的事大家也都知道了，蒋介石迫不得已掉转枪口，和日本人打了个两败俱伤，但是共产党趁着国民党跟日本人打仗的机会，自己迅速做大，抗战之前共产党都快让国民党打没了，抗战之后共产党军队发展到一百多万人，你见过抗日越抗人越多的吗？共产党打仗不死人吗？\n\n因为共产党始终坚持“‘一分抗日，二分敷衍，七分发展，十分宣传’，任何人，任何组织都不得违背这个总体方针。”\n\n共产党是统一思想统一行动，就是不抗日一心一意发展自己，最发达的就是那张嘴。\n\n毛泽东在延安的时候天天喊着学习美国，搞民主如何如何，你看看那个时候共产党的党报都是怎么写的，天天就是宣扬民主思想，宣扬美国，和美国友好，学习美国学习西方的先进体制。他们的目的就是搞分化，因为当时蒋介石要集中力量对付日本人，于是共产党就用民主来分化国民党，分化中国人，结果很成功，共产党就用一张嘴，就把国民党分成两派，国内很多知识分子很多年轻人也都把延安当成革命圣地，他们都是被骗了，所以下场也都很惨。\n\n咱们现在也一样，爆料革命必须统一思想，统一行动，抵制住共产党的任何分化。\n\n最简单的，你跟他谈灭共，他跟你谈民主，你跟他谈灭共，他跟你谈历史，你跟他谈灭共，他跟你谈独裁，你跟他谈灭共，他说你有缺点，你跟他谈灭共，他说你组织能力差，你跟他谈灭共，他跟你谈人道，此类种种，乌七八糟，数之不尽，灭之不绝。\n\n最近发生了很多事情，现在广大战友正在被分化当中，很多人上当受骗，这是共产党的胜利。\n\n咱们现在所有人，应该就坚定一条，“支持爆料革命，传播真相，坚定灭共”，没有任何其他东西，什么民主、自由、联邦，学美国还是学英国？儒家好还是道家好？一切一切，都等共产党灭了之后再说，现在一概不提。你只要提就输了，共产党要的就是这个，要的就是你内部分化，内部分化首先是思想分化，共产党玩这一套已经炉火纯青了，让你不知不觉就被他玩弄于鼓掌之中。\n\n最后重复一遍重点：支持爆料革命，传播真相，坚定灭共，其他一概不提。",
			"added": 1578201874,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 34,
			"title": "北京防空级别升至最高，领导所到之处断网，极端条件下如何保证网络通信",
			"body": "苏莱曼尼被斩首北京防空级别升至最高，三环内禁无线电发报机，领导所到之处大功率信号干扰断网等等。\n有条件的朋友可以在保证安全的前提下测试大功率干扰下的网络通信，以便在极端条件下能正常通信。",
			"added": 1578289000,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 35,
			"title": "香港警察“一哥”邓炳强血腥镇压同胞录",
			"body": "https://gnews.org/zh-hans/80006/\n作者：品行\n\n依照《中华人民共和国香港特别行政区基本法》的有关规定，根据香港特别行政区行政长官林郑月娥的提名和建议，国务院2019年11月19日决定：任命邓炳强为警务处处长，免去卢伟聪的警务处处长职务。这是中共给邓炳强任命通知全文。\n\n这一天邓炳强鹰派“二档头”坐正了“一档头”。 至于同样沾满香港同胞鲜血的卢伟聪被中共用完即弃，并且成为香港至开埠后有警察开始175年以来，第一位没有任何欢送仪式而悄然下台的退休“大档头”。\n\n民主党的立法会保安事务委员会副主席涂谨申讲：“在卢的统领下警察成为香港的“土皇帝”“每当看见不顺眼的人就打”。\n\n民主派认为现年58岁的卢伟聪是香港有警队以来，到他离去是最差的一位“警察一哥”。也有人士认为卢伟聪所犯下罪恶也不会随他的离去而抹掉，恶果导致他的下半生可能还会更加凄惨。\n\n从去年6月至今去年12月9号香港警队在邓炳强的指挥下，逮捕了超过6.022人，四成是学生，年纪最轻的只有11岁，最大的83岁，失踪人数不断攀升。警察发射16000枚催泪弹，各种弹类40000枚之多，还没有加上新年之内的。1784宗警察投诉，未见警察被控。\n\n在邓炳强的压阵下，将香港变成一个“警察国家” 离奇坠楼、浮尸的悲剧也不断出现，并且疑点重重：很多坠楼不见血迹。\n\n被浮尸的尸体全身赤裸，没有长时间浸泡后肿胀现象，却有被殴打的迹象；有的身穿黑衣，戴口罩。种种迹象让港人怀疑这些人是“被跳楼”、“被跳海”，其中以15岁跳水女选手陈彦霖被发现全裸浮尸海面最具代表性。警察打死人的消息时有传出。而这张成绩表显然也是他获得北京肯定而顺利接替卢伟聪的原因。但这一切都是他残害镇压香港同胞的罪恶证据。\n\n11月19日起做了一个哥 “一档头”邓炳强正式统领3.1万个警察。邓炳强接受访问时，否认警察使用过分武力，又不满市民对示威者的暴力“视而不见”。\n\n从6月9号开始（返送中）就委任他担纲镇压示威活动的警方行动，行动别“Tiderider”。在这个行动下，警队前线人员的行为越形亢奋甚至不受控制，但他们不但没有因为西方国家以及人权组织日渐严厉的批评而有所收敛。反而给警员下班分配武器如伸缩警棍和胡椒喷末，成为全天候的镇压工具。\n\n查看邓炳强的历吏，1987年于香港中文大学社工系毕业，在同年6月16日加入警队，他圆滑和醒目使他获警方高层安排到多个不同学院受训，包括中国人民公安大学、中国浦东干部学院以及中共中央党校（也称国家行政学院）他早以是喝了党奶的狼崽子了。\n\n2012年，邓炳强晋升总警司及调任元朗警区指挥官。当时很有名的一宗案是发生在2013年7月的“白粉当盐案”涉黑丑闻。而邓炳强同何君尧属结拜兄弟。邓炳强被质疑与黑势力有关联，在他担任元朗警区指挥官期间，被质疑多次包庇和纵容新界乡黑势力。\n\n任内因元朗警区几宗警察丑闻，包括将海洛因当作是当盐来处理，需让警察公共关系科为邓炳强解释。\n而他甚至亲自致电游说各大媒体的采访主任，要求传媒“笔下留情”，为丑闻降温，被当时很大媒体报道。干预新闻自由。\n\n2013年离任元朗警区指挥官时，获乡黑背景人士在小桃园酒家设江湖饭宴欢送，\n\n2014年出任港岛总区副指挥官，处理雨伞运动、那是很多香港人第一次知道了催泪弹的味道。\n\n2015年5月晋升警务处助理处长及出任港岛总区指挥官。\n\n2016年1月出任人事部主管，\n\n2017年1月晋升警务处警务高级助理处长兼任行动的处处长，职位负责中共高官访港时的保安工作，\n\n2018年11月16日，邓炳强获香港特区政府委任为警务处副处长（行动），接替退休的刘业成。\n\n2019年9月21日，有媒体发表〈放下屠刀，回头是岸〉一些旧时同学及中大学生致警务处副处长邓炳强公开信，公开谴责校友邓炳强在近月警方强力镇压冲突中的角色。\n\n2019年7月21日，身为警务处副处长（行动）的邓炳强，被指要求警察当晚故意不作为，默许乡黑势力袭击大量平民。\n\n元朗区议员担心警黑之间的关系逐渐成为一种默契，元朗治安持续恶化，“97年前你唔会见到警察同埋黑社会同场，但97之后就变咗，你会见到佢哋同场握手、拍膊头慢慢成为一种文化\n\n有匿名人士获取一段被指是邓炳强与一众警员对话的内部录音，录音内邓炳强批评传媒经常针对警察，成日提警察曾侮骂记者说“记你老母”及袭击记者。\n\n叫警察“醒少少唔好俾人影”，又说要“给市民知道对方的白色恐怖，给社会大众知道对方（示威者）有多污糟邋遢”，并寄语前线警员“你们后面还有人顶住，上立法会解释就交给我。”此番言论惹起公众哗然，而警方未有否定有关录音内容。\n\n前几天香港朋友发来一则信息，香港连登论坛出现一封署名“一群热爱香港的警务人员上”的匿名公开信，透露香港警务处副处长邓炳强与元朗黑帮勾结，渗透警队，策划721白衣人袭击事件。恶性暴力袭击幕后黑手就是警察“一档头。”的杰作。\n\n回顾香港721游行元朗袭击人事件，有疑似黑道人士身穿白衣聚集，并在西铁元朗站持械追打民众。当时还有一位孕妇被打到在地。\n\n早在7月20日晚已有香港警察私下通知其住在元朗的亲友7月21日（不能穿黑衣 …）也有脸书网友信息称 香港政府连同警察及黑社会血洗元朗区。 … 有警员个人fb账户曾预告白衣人准备大量木鞭条打人。警察珊珊来迟也能证明。\n\n721元朗黑社会袭击香港同胞。再一就是去年8月31日，多名香港防暴警员及特别战术小队（速龙小队）成员冲入太子站往中环的月台及列车，以警棍击打车厢内示威者、市民，以极近距离施放胡椒喷雾。\n\n袭击事件后车厢及月台一片狼藉，多人头破血流。伤者中包括部分小孩及坐轮椅的伤残人士。在车厢中一对被打的男女乘客跌坐地上，仍然被警员近距离喷射胡椒喷雾，有一位男子在带着恐惧嚎啕大哭的样子让人挥之不去。\n\n831太子站恶性事件\n港警在831后封闭太子站2天的不寻常举动，说法得不到市民的相信，有示威者在站内被港警打死继而（毁尸灭迹），直接送入殓房不经医院的传言甚嚣尘上，愈来愈多的民众要求港铁公开太子站内的监控录像以获取事实真相。\n\n在场的救护指挥官曾指车站内有10人受伤，与港警及医管局随后给予媒体有7人受伤送院的人数不符，即有3名伤者不知去向。\n\n他的铁腕手段也可从他亲自压阵处理理工大学“围城”战术而可见端倪\n\n在很多西方国家包括美国德国等国家，因为香港警队使用过分暴力，停止向香港出售群众控制的装备和仪器。\n\n根据有关传媒透露，香港警察目前使用的催泪弹等装备，是我们伟大的挺警最强力的祖国源源不绝支援的。每枚国产催泪弹的售价，是港币500元。尽管他是过期的。\n\n也可以从警察围攻中文大学、理工大学校园，一个晚上就用了香港从（反送中）来共使用催泪弹的三分之一。\n\n中共指示“止暴制乱、恢复秩序”后，香港警方立即升高了武力镇压的强度，并且改变镇压战略，转而对香港各个大学实施“围城攻击”，先是进攻香港中文大学，随后对香港理工大学展开围城。围攻香港理工大学超20小时的发射实弹。\n\n进攻香港中文大学(邓炳强上任后用各种弹类回馈中大)\n11月12日的中大对峙，警方在该次行动中共使用4693发弹药，当中包括2330发催泪弹和1770发橡胶子弹。\n\n在此过程中，警方还出动各式各样的高杀伤力武器，诸如声波炮、水炮车、震撼弹，甚至还有AR-15步枪等，校园已变成了“战场”。此外，警方这次的大学围城行动非常强悍，不但对校园团团包围，还不留活路让学生撤出，扬言学生只能“投降被捕”，或者“被镇压逮捕”。光是理工大学里，被警方逮捕或登记的人数就有1,100人。\n\n警方单日发射弹药数量最多的行动，在11月18日围堵理大时用了7647发弹药，包括3293发催泪弹、3188发橡胶子弹、667枚布袋弹和499枚海绵弹；若把之前一天开始围攻理大时使用的3325发弹药计算在内，警方单是针对理大便用了一万多枚各类弹药，占所用弹药总数的三分之一。另外，警方在理大事件中发射4发实弹。\n\n发射第三的是10月1日国庆日的示威活动，警方共使用3344发弹药，当中6发是实弹，是发射最多实弹的一天。\n\n香港理工大学千名抗议者遭港警围堵和暴力抓捕。18日，外界看到大批来自于理大抗议学生被捕后，被警方押送上火车，目前没有人知道他们被送往哪里。是否还有人生还无人知晓。列车押送抗议者离开 港广列车停运两日。\n\n而且不可思议的是就在国庆日前夕，警方放宽了使用武力的门坎。\n\n面对警方使用如此大数量的弹药，有不愿透露姓名的监警会成员向媒体形容，香港警方（真的疯了），整个用弹过程的情况就像是（军事行动）\n\n而在记者会上被问及时，行动部高级警司汪威逊表示，不回应有关（军事行动）的评论，尊重对方的感受和表达自由\n\n警方回应时称，催泪弹是不伤害大量示威者时可选择的最低武力。\n\n曾参与过“伊斯兰国”（IS）前线采访工作的德国战地记者Enno Lenze亦说，“港警比ISIS更可怕”。\n\n听命于中共\n美国通过以制裁违反人权的官员为主的《香港人权与民主法案》后，美国共和党海外事务组织副主席俞怀松列出了建议首批被制裁的“香港六人帮”名单，首批将会被制裁的六人为林郑月娥、郑若骅、李家超、卢伟聪、叶刘淑仪邓炳强、可喜的是这个党妈培养的狼子邓炳强亦在其中。\n\n香港回归祖国。与此同时，香港警察部队换上了新的警徽。“皇家香港警察”的称谓成为了过眼云烟。同这云烟一起飘散不单是（皇家）二字，香港警队—世界之三、亚洲之次（马来西亚警队亚洲历史）已成往日佳话\n\n如今撑警的是黑势力，过去只有蒙面的强盗，而如今香港只有蒙面的黑警。\n\n新年伊始香港被“红”的警察“一档头。”\n\n在元旦当天给香港同胞就用施展了他的流氓行为，出尔反尔，欺骗同胞，在大游行中，拦腰截断，各种弹类其上，致使很多人被抓捕。而操纵香港局势的中联办也进驻一条西北“狼”中央驻港联络办主任骆惠宁走马上任了。\n\n香港这个东方之珠，接下来的就像郭文贵先生讲的那样。去年的11月、12月重大事件发生，证实爆料革命给香港同胞的很多正面善意的提醒。未来的几个月又将面临着更多的残酷和考验。\n\n（文章内容仅代表作者观点）",
			"added": 1579150961,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 36,
			"title": "CCP宁可花钱解决你，也不解决你上访的问题！",
			"body": "https://gnews.org/zh-hans/78726/\nBy GM30 -\n2020-01-11 21:46\n作者：BO LU\n\n这篇文字，写给那些正在上访和即将上访的同胞们。\n\n上访，绝对是一个十分具有中国特色的现象！这一现象在中国自古有之，本该是一件悲惨的事情，但却被最擅长以苦为乐的中国人视为超越正常法律途径的“捷径”，并被赋予了种种美好的幻想：不管你有什么冤屈，只要拦轿喊冤，遇到的又是清官最好是八府巡按，那就能沉冤昭雪，严惩恶人！可叹！上千年过去了，已经公元2020年，中国社会中百姓上访的现象，不但没有消失，反而愈演愈烈！2014年，CCP中共中央办公厅宣布各级信访局不再接受越级上访，这等于基本从行政管理上宣布了上访的无效，也就给了地方维稳部门巨大的压力和相应的“权力“，从此上访和截访带来的官民冲突更加突出和严重。\n\n那什么情况下会造成民众上访呢？ 通俗易懂的说来，原因有：\n1，八字衙门朝南开，有理没钱莫进来。\n2，官官相护，天下乌鸦一般黑。\n3，光棍斗不过势力。\n4，相信不断的越级上访，总能遇见清官！实在不行就走到头，告御状！\n\n当然，一切民怨的起因根源，是畸形发展的社会现实，视百姓为奴隶、韭菜的官场潜规则，号称法治实为人治的行政和司法制度，CCP70年来以警治国、以黑治国、以贪治国、上行下效的恶果！\n\n因此，上访总的来说绝大多数情况下是个体或群体针对公务员及其所在政府部门或者其代理人的，比如说城乡开发拆迁、农村宅基地纠纷、企业改制维权、司法诉讼不公、老兵群体维权、p2p集体上访等等，所以上访就是民众百姓对于政府施政不公或不作为的一种民怨的直接反映！\n\n好！我们来看看中国的维稳机构及其大概的工作、支出情况。\n\n维稳机构的终端，大致有各地维稳办、综合治理办和应急办等，与此同时，本该是负责地方治安的公安部门，事实上也成为维稳的主力之一，因为他们针对的不再是普通意义上的“犯罪分子” 了，当然了，还有庞大的熊猫（国保）队伍。2019年人大政府工作报告中的全国公共项目支出是约23万亿。其中国防预（军费）算约1.18万亿，而公共安全预算（也就是维稳经费）官方数据是只有1797亿元。实际上呢？据”21世纪经济报道”发布的数据，公共安全（维稳经费）占全国全年公共预算总额的5.9%，也就是约1.39万亿，这一数字甚至高于当年国防开支！虽然也许其中包含很多不能直接算作“维稳项目”的开支，但维稳预算之高，仍可见一斑！\n\n维稳开支除了应对上访人员和群体之外，还用于公安和国保单位全面监控异见（煽颠）人士、维权律师、工运领袖、宗教人士等，以及每年用于人工智能监督监察系统技术设备的研发、购置，社会信用体系对上述人员信息采集、纳入和更新，还有一个很重要的部分，就是覆盖全国城乡、企事业单位及大专院校的“治安志愿者”队伍建设维护，比如仅在北京就有近百万的在册安全员，俗称“朝阳群众”，这一群体人员除了领取日常费用外，对于其中提供重要线索、揭发爆料的人员还给予丰厚的奖金奖励。\n\n而维稳方式大致又是怎样的呢？对于越级上访维权等需要维稳的人员，除了常规的监视居住（有条件的会在家门口安装摄像头）、拦截（包括限制购买车船机票）外，还有一个通用的维稳方式，就是将其以各种名义限制人身自由或者干脆关押（比如称其患有精神疾病）。由此而来，全国各地（特别是北京）的黑监狱层出不穷，通常由各地维稳机关设立，有的已经基本属于隐藏式的洗脑基地或者“迷你”集中营了，控制看押人员人身自由的同时还对其进行思想改造，有的甚至使用高科技装置设备对其进行脑控 。。。。。。\n\n下面我们再来举两个与民生有关的数据（数据来自网络，仅供参考)。\n资料显示，中国国民如果实施全民分级免费医疗，大致的预算数字在每年6000-7000亿元。（所谓分级医疗制度，就是什么病去什么级别医院，诊断由医生决定，避免过度医疗的重复和浪费，比如说感冒就只能去社区一级医院，大病才能去三甲。）\n如果给国民购买覆盖城乡一体化的无差别医疗保险，大概需要2000-3000亿元每年。\n结合2019年的全国国防（军费）开支1.18万亿，你大概就能感受到公共安全（维稳）开支1.39万亿是什么概念了。\n\n那问题就来了！\n这么巨额的经费拿来维稳，干嘛不直接把这些钱用于教育、医疗、养老等改善民生，解决民间民怨暴露出的诸多问题呢？！如果这样，可以想见会减少多少矛盾和痛苦，又能避免多少悲剧？！任何事情都是一环扣一环的蝴蝶效应，一个局部的溃烂，会导致全身的恶疾，社会也是一样。上访现象的本质不是谁拆迁少了几块钱、谁被村委会强征了几亩地，谁被p2p骗走了全家血本，谁又被医院的套路弄得家破人亡。。。。上访的本质就是社会的不公！体制的不公！法治的沦丧！政府的不作为！而共产党政府不仅不设法解决民生民怨问题，而是用百姓血汗而来的国库预算，豢养驱使鹰犬，对于“不听话的刁民”进行维稳迫害，监控、威胁、拦截、抓捕、关押、虐待摧残！无所不用其极！为什么？难道是他们不明白这浅显的道理吗？当然不是。\n\n原因很简单 ：\nCCP不想、不能、也做不到解决民生、民怨的问题。\n他们能够做到的，就只是解决提出问题的人！\n因为他们是共产党，CCP，他们是国家机器的掌控者，他们是主人！\n这权力的傲慢，来自他们70年来把国民百姓视为奴隶和韭菜，甚至猪狗不如！\n他们当然不会把卖猪肉得来的钱去给猪看病修猪舍，哪只猪敢鸣叫，就宰了谁！\n\n谈及上访，身边总有人说，上访的人很多就是刁民，别人拆迁都能接受赔偿，他为啥想多要？\n— 知不知道这世上有种东西有钱你买不来？自由！俗称 “我愿意”！人家不干就可以强拆还不让诉苦说理？！就可以对人非法关押虐打？\n还有人说，那些p2p被骗的人就是贪财，别人怎么没上当？就是活该！\n— p2p项目不管是民间还是官方发起的，哪个不是政府被背书的？哪个项目不是跟国有或商业银行合作勾兑的？！钱到手你们两家一分，人跑路，人家不找你政府找谁？！\n可以想见，上访者的人间悲剧一桩桩一件件，怎么说的完，说的清？！\n不管怎样，肯定有人会问：你说这么多，有啥用？！既然人家就是不解决问题，就是想解决我们，你说能怎么办？！不管你听不听，信不信，我还真有良言相告。\n\n首先，停止上访！\n保护好自己的身心，暂时人身不再有危险，心灵不再受煎熬。你受到的不公、损失和苦难都先记在心里，手上留好证据。不再上访，你就不会成为维稳对象，避免受到双重打击！更不要铤而走险，贸然与CCP政府直接对抗或者试图玉石俱焚。\n“那要等多久？你说的轻巧，受害的又不是你！”\n我告诉你，用不了多久！\n\n接下来你要试著做第二件事：关注我们爆料革命，关注郭文贵先生，关注他的言行！\n在你力所能及的条件下，寻找他的视频或文字。如果你对我说的一无所知，我给你一个链接，从头开始补课：\n“ 郭文贵爆料革命 · 启蒙开智入门指南”\nhttps://github.com/ourhimalayas/txt/issues/1\n\n这里面几乎有关于郭先生、关于爆料革命你想要、需要知道的一切信息。\n\n如果你看了之后感同身受、豁然开朗，找到了同病相怜的人，\n我告诉你，你的感觉是对的！不管身在海外还是墙内，我们这些爆料革命的战友，其实跟你一样，也都是“上访”的人！\n只不过因为不同的原因，以各自的方式在 “上访”，\n但不同的是，我们有爆料革命，有郭文贵先生，我们不是在向CCP非法伪政府上访，我们是在全世界平台上（网络），揭露CCP及其盗国贼集团邪恶贪婪的真相，揭露他们几大家族绑架中国14亿人民的真相，揭露他们试图与普世价值为敌、称霸世界的真相，揭露他们镇压香港人、关押虐待维族人的真相，同时向公平正义、向上天讨一个公道，从2017年至今，近三年了！而上天即将要给我们所有中国人一个公道，也要给全世界一个应许：灭掉CCP！\n\n而这个应许之日就是：2020年6月4日！\n\n— 我不能告诉你这一天具体会发生什么，我能告诉你的是从此之后，我们14亿中国人将彻底赶走共产党，人民会砸烂猪圈，重新站起来，拿回属于自己的权力，并用手中的选票，建立一个听命于、服务于自己的政府，这个政府会在普世价值之下，秉承依法治国的宗旨，建设一个正道中国！在这一过程中，当然事无巨细的将包括接受你的“上访”，真正解决你的问题，在法律之下，还你一个正义和公道！而你和你的子子孙孙，都永远不需要再上访了！\n\n如果看到这里，你依然选择相信我说的话，那你也许会问：\n“ 我只是一介草根，身在高墙内，我又能做些什么呢？！”\n你什么都不用做，只需要在郭文贵先生振臂发出呐喊的那一天，\n与千万、亿万跟你一样的中国人一起站出来响应他，站起来走上街头，散步欢呼，迎接、庆祝我们的胜利！\n— 因为，一切在3年前早已开始，2020，这一次，“该我们赢了！”\n\n（文章内容仅代表作者观点）",
			"added": 1579151123,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 37,
			"title": "华人的孤岛现象：烙印",
			"body": "https://gnews.org/zh-hans/79006/\n\nBy GM09 -\n2020-01-12 21:29\n\n作者：普通話\n\n最近，文贵先生经常在报平安视频中提到一个词“文革2.0”，当前中共对中国人的洗脑以及对文化和传播的控制比拟文革。国人的不幸，令我想起了当年我爷爷的故事。\n\n我爷爷是中国解放后第一批大学生，专业是历史，因为当时大学生数量极少，所以毕业后被派到一家地方报社工作。有知识，文笔好，爷爷很快得到了领导的重用，过了几年被大力提拔，坐到了报社的总编辑，而且得到了干部的称号。但是他争强好胜，加上是解放后第一批大学生，他自认清高，所以和同事以及领导的关系总是不好，导致最后上得罪领导，下得罪同事。\n\n1966文革在中国全面展开，全国上下开始了前所未有的批斗。爷爷工作的报社处于一个较小的城市，所以批斗的浪潮并没有马上席卷到当地。但是好景不长，红色恐怖最后还是来到了爷爷的报社。\n\n作为报社中唯一的知识份子，而且过去和领导关系不好，爷爷很快成了被批斗的对象。最开始，爷爷在报社中被降级，从总编辑到附编辑，从附编辑到排版室，最后从排版室打压到前线跑腿记者，从此离开公司领导层。\n\n可惜又好景不长，最终在1968文革巅峰，爷爷失去了记者职位，被送进了”监狱”。那天晚上，他没有回家。\n\n奶奶那天等了爷爷一晚上，菜已经冰凉，爸爸和叔叔已经熟睡，但依然不见爷爷的身影。第二天依然没有爷爷的消息，爸爸问爷爷去哪儿了？奶奶只能撒谎，说爷爷出差，到了别的城市可能过一段时间才回来。\n\n奶奶忐忑不安，当天把爸爸和叔叔送到邻居家看管后，飞速奔向爷爷的报社。到了报社，奶奶询问爷爷的去向，得知爷爷已被批斗，前天就已经进到当地的“监狱”了。当时，奶奶一下就跪在了地上，开始大哭，这辈子从来没有感到如此无奈，如此无助。看到这个情形，报社的员工写下了“监狱”的地址。奶奶紧握小纸条，走了15公里，来到了爷爷被关押的地方。\n\n走到监狱时，奶奶已经筋疲力尽，憔悴，她走到一个红卫兵的面前，喘着气，说出了爷爷的名字，希望见见他。红卫兵带着奶奶走到爷爷的窂前，牢房十分简陋，没有床，人就睡在地上，更没有任何地方让人小号和大号。爷爷看到奶奶，顿时冲过来，从牢门的缝隙中，抓住奶奶的双手，说了一句：“老张啊！”，眼泪开始哗哗直流，奶奶看到穿着犯人制服的爷爷和他的无助，两人一起痛哭了起来。\n\n红卫兵看到这情形，抓着奶奶的右胳膊，就想把她拉走，奶奶紧握爷爷的双手，没有丝毫放开的意思，这时红卫兵一巴掌打在奶奶的脸上，心身疲惫的奶奶差点晕过去。在被红卫兵拖走的时候，奶奶大声的喊：“老李！你一定要坚持住啊！我老张和孩子一定等你！你一定要回家啊！！”奶奶被拖到监狱大门前，她问爷爷什么时候可以被释放，红卫兵就回她三个字：“跟我滚！”话音刚落就把大门关上了。\n\n当时天色已晚，想到家里还有两个等着吃饭的孩子，奶奶无可奈何还是回家了。\n\n接下来的几年，是我们家最苦的日子，爷爷被批斗后，家里只剩下奶奶一份工资，生活变得非常困难，省吃俭用，奶奶很多时候一天只吃一餐饭。把能省下来的饭菜尽量都给爸爸和叔叔，但是爸爸刚上小学，叔叔属于幼儿园时期，由邻居家看管。小孩发育快，靠奶奶的一份工作，粮票大减，所以爸爸和叔叔经常挨饿。当时爸爸总在问，爷爷为什么不回家啊，他是不是不要我们了？奶奶含着泪告诉我爸，爷爷会离开我们一段时间，但是他一定会回来的。\n\n由于是小地方批斗，而且爷爷不是高级干部，所以奶奶每过几个月还可以去监狱里面看看爷爷，这狱中探亲是我爷爷在狱中的唯一精神支柱。爷爷每一次都会跟奶奶倾述自己在狱中的经历，被打，被骂，被凌辱，吃着连狗都不会吃的食物。而且小便红卫兵看着，甚至连大便红卫兵也在旁边看着。爷爷有一次问红卫兵，：“为什么我大号，你也要看着我？”红卫兵说：“我不看着你，你想逃跑怎么办啊？你想自杀怎么办啊？你们这些知识份子，就是我们中国的败类！就应该被清除！我们不来整你，谁来整你啊？！”\n\n有几次，爷爷跟奶奶说，受了这么长一段时间的虐待，他快支持不住了，说前段时间已经有3个人在狱中自杀了，爷爷说他深爱奶奶，爸爸和叔叔，但是他不知道自己还能撑多久。当时奶奶握着爷爷的手说：“我们都还等着你，李一和李二现在都长大好多，他们还挂念着你，他们天天盼望着你回家，老李，我们一家人会团聚的，一定不要放弃啊！我们等你！”\n\n1976年，毛泽东去世，邓小平在中央权力快速提升，1976年底，文革基本结束，1977年邓小平停止一切政治斗争，文革彻底结束。 \n\n1977年大年三十，爷爷出狱，那天晚上他走了15公里的路，回到当时的大院。那时天已黑，而且爷爷不知道我们家是不是还住同一个地方，毕竟奶奶上次狱中探亲已经是好几个月前的事情了。爷爷走到大院里，看了看当时他们住的平房，想确认奶奶，爸爸和叔叔是不是还在。当时，奶奶在厨房准备年三十晚餐。她抬头一看，隐隐约约看到窗外好像站着一个人，奶奶赶紧冲到家门口，站在大院里的那个人，骨瘦如柴，像一个刚从纳粹集中营里面出来的犹太人，奶奶喊了一声： “老李！是你吗？” 爷爷豆大的泪珠流了下来，：“老张！”他边喊，边向奶奶跑去。奶奶扔掉手中的锅铲，张开双臂，奔向爷爷，她两紧紧的抱在了一起。爸爸和叔叔听到大院里面的动静，从家里跑了出来，看到奶奶和爷爷抱在一起，我爸高兴的喊：“爸爸，爸爸你回来了！我们好想你啊！”此时此刻，这一家四口终于团聚在了一起。\n\n那天大年三十，这一家人在7年后又一起坐在了同一个餐桌上。此刻，饭菜已经凉了，桌上一盘清炒土豆，一盘番茄炒鸡蛋，加一碟腊肉，最后一盘菜是奶奶最拿手的米酒。爷爷吃了几口凉透的菜，喝了几口米酒，他放下碗流着泪说：“这是我这辈子吃过最好吃的饭。“\n\n那天晚上，咱们家都没有睡觉，后来，爷爷把爸爸和叔叔叫道自己的床上，这一家人一起坐在被窝里，爷爷笑着，哭着，开始跟爸爸和叔叔讲故事，从童话故事，到希腊神话，到自己小时候的经历，等到爷爷反应过来的时候，爸爸和叔叔已经睡着了。看着熟睡的孩子，坐在自己旁边的妻子，爷爷说：“谢谢老天，我回来了！“\n\n文革结束后，爷爷重新回到了以前的报社，这么多年过去了，以前的老领导都已经不在了，但是文革10年，中国大量人才无辜被整，导致文革后人才奇缺，所以爷爷很快又被报社重用，重新被提拔，这次是一直提拔到了副社长，干部等级更高了。\n\n有了优厚的待遇，让人羡慕额官位，爷爷很快又回到了从前的他。他又从新入党，拿起了“参考消息“，买了崭新的收音机，听着中央人民广播电台的新闻，每天研究“人民日报“上的国家大事儿，让人感觉他两年前的经历就是一场梦。后来，一家人从之前的小城市，移居到了中国某个大型省会城市，而且在省级报社做上了总编辑。房子更大了，待遇更好了，爷爷家在80年代初是中国第一批购买彩电的家庭，有了彩电之后，爷爷每天晚上7点必会坐在电视机前看”新闻联播“。\n\n在我出生不久后，我的爸妈离开了爷爷所在的城市，到中国南方发展，我们家不是太传统，所以不是每一个春节都会去。那时，中国早已对外开放，大量外国品牌进入中国，海外电影，电视，音乐，书籍等都以习以为常。记得有一次跟爷爷在年三十长途通话，爷爷告诫我，“现在有这么多的外国文化入侵中国，你一定要小心啊，不要被这些西方文化带坏了！少看海外书籍！”\n\n之后有一次和爷爷通话，那时法轮功自焚事件刚在天安门发生，爷爷在电话中极其愤怒：“你看到这些法轮功混账东西干了什么吗？不但让人迷信，尽然让人自焚！简直是恶毒至极，这些法轮功的人，抓到了就应该枪毙！而且要让他们的后代永不能翻身！“ 现在看来，爷爷当时已经完全忘记了自己当年在文革的经历，他说话的语气，就像当年他在厕所里看着他大号的红卫兵。\n\n如今，文革距离我们已经40多年了，那时没有现在意义上的盗国贼，没有人家财万贯，没有高层干部在海外购买亿万豪宅，就连毛泽东每天最大的享受也就是一盘红烧肉。但是文革从另一个角度让我们认识到独裁者对权力的绝对渴望，CCP发动文革，让群众和党内人员互斗，最终达到的是CCP最顶层的绝对集权。\n\n当时的与人斗，与地斗，与天斗跟今天的扫黑除恶，反腐，反美，医患矛盾，等等等并没有本质上的差别。现在不单单把14亿人的生命和财产做筹码，甚至把香港，台湾，南中国海，和世界都变成了党内政治斗争的筹码。\n\n要除掉思想上的烙印是一个挑战，有时候，我自己洗澡时，都会不经意的唱或者哼一些红歌，如“我们是共产主义的接班人“，”没有共产党就没有新中国“，”黄河大合唱“等。有时候把我自己都吓住了，我们家移民都已经15年了，我从初中开始就是全西方式教育，但是有些烙印就是这么的深。\n\n郭先生有一次提到了华人的孤岛现象，思想的洗脑以及对国内家人的控制威胁双管齐下，让被共产党统治的华人戴着奴隶和愚昧的烙印而不自知！但今天我们有了爆料革命，通过传递真相，中国人不会傻到被中共再骗一把。",
			"added": 1579151206,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 38,
			"title": "粮食问题紧迫当头 中共庚子年又“撒粮”",
			"body": "https://gnews.org/zh-hans/81557/\nBy GM06 - 2020-01-15 14:43\n\n作者： （立武）\n\n",
			"added": 1579328865,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 39,
			"title": "2020中国贸易协议——《庚子协议》，不能让中国人知道的秘密",
			"body": "完整版 https://www.youtube.com/watch?v=NJpvvuSkl5s\n精简版 https://www.youtube.com/watch?v=ZQllvPeEO00\n郭文贵后续解析 https://www.youtube.com/watch?v=3LC-TODKe04",
			"added": 1579329035,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 40,
			"title": "起底科大讯飞：声纹识别 天网 雪亮工程",
			"body": "https://gnews.org/zh-hans/83509/\n档案下载：\nhttps://s3-ap-northeast-1.amazonaws.com/news.guo.offload.media/wp-content/uploads/2020/01/18215514/%E8%AE%AF%E9%A3%9E.docx",
			"added": 1579428647,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 41,
			"title": "新型SARS，中共在试验，春运到了，想测试病毒传染的能力。武汉SARS病毒和舟山蝙蝠病毒的关联性",
			"body": "https://www.youtube.com/watch?v=CLTjg03CPEs\n\n00:00:13 路德: 为什么财新胡舒立要一再否认武汉SARS病毒和舟山蝙蝠病毒的关联性？为什么说是CCP定点投放？为什么说该病毒已经进化具备人传人大爆发？为什么CCP要不断隐瞒确诊案例？今天what's up出问题，战友怕被黑，个人信息已保存。\n\n00:02:44 安红: 新闻梳理。律所通知拥有贝拉美奶粉股票的股民，此公司2014年被中资机构并购，做手脚导致股票暴跌，最终股东能拿到5%；中资公司在澳洲昆士兰投资，过度开采资源，几乎抽干当地水库；香港8个月面目全非，血流成河。\n\n00:05:13 艾丽: 新闻梳理。契诃夫“阳光还没有落在你身上，你就开始微笑了”，面对灭CCP后的未来；分享第一阶段协议内容和看法；委内瑞拉向中国移动贷款500亿元。\n\n00:06:16 路德: 香港袁国勇教授点破：武汉sars和舟山蝙蝠病毒的关系，“武汉肺炎8成似SARS”，后被财新“辟谣”；CCP军方发现舟山蝙蝠病毒，并分离和保存了这个病毒，此病毒与众不同：其ORF8片段和别的已知病毒差异特别大（和已知最“近亲”的病毒序列，相似度达60%）。但是与武汉病毒对比，竟然有高达94.21%相似！2003年SARS病毒被证实来自2013年发现的云南蝙蝠病毒，其中一个证据就是RdRP基因（作用是适应宿主身体的基因）达到87-92%的相似度。具备传播给人类的可能性，CCP具备这一技术；病毒不断进化，病毒活下来的比例越来越高，大爆发可能性极大，CCP隐瞒病例，故意不确诊。BBC爆出后，武汉很快又确诊多例。爆料，希望世界卫生组织一定要给CCP施压。CCP在试验，春运到了，想测试病毒传染的能力。\n\n00:20:29 路德: 华南海鲜市场最早发现，最好投放的场所，因为冰水里保存时间最长，想把病毒来源推给某种野生动物；\n\n00:21:59 安红: 逻辑链清晰专业，令人毛骨悚然；财新最早报道王健“脚疼死”，CCP辟谣洗地的都要反着看；ccp比日军731细菌研究所更邪恶；路德不是专业人士，但经过审慎调查研究；海鲜市场的冰可以反复使用，容易传播病毒，与猪瘟不同，华南海鲜市场可以向全国运输；如此高相似度，很可能就是来自舟山蝙蝠；CCP会否借此“留岛不留人”，威胁全世界。\n\n00:26:39 艾丽: 手段非常残忍。1，逻辑关系清除，本来在蝙蝠之间传染，现在可以在人和人之间传染，说明一定经过人为改造；2，在美国报备，报备方还是CCP军方，所以财新一定要跳出来“辟谣”，此地无银；3，CCP用最尖端科技维护最邪恶的统治，创造危机进行自保。4，CCP信息封锁太紧密，试图制造人道危机，准备了人肉“炸弹”摩托艇在台湾海峡不惜人命当炮灰，佩服博士的勇气，关注事件、施压！\n\n00:30:14 路德: 2019年12月1日，给世界卫生组织提交了病毒序列，是错误的。1月14号的时候，悄悄更改，被战友发现，是舟山蝙蝠。立刻联系路德节目，揭露！学术角度来看，大规模爆发的可能性很大，因为发展的速度越来越快。武汉有1723个潜在病例，扩散速度恐怖！早确诊、早隔离、早公布！\n\n00:35:40 路德: 从政治角度为什么要这么做？夺权、邀功。XI负责军方，王73声称可以消灭病毒，南京军区病毒为何弄到武汉杀人（XI控制武汉），而不在王控制的海南？\n\n00:36:30 安红: 1，猜测借刀杀人或两面三刀。2，CCP速来拿人不当人，江西红区大杀戮，一年杀戮50万人；早期AB团，残酷对待党内人，粟裕长春围城，死了57万人，日本作家远藤誉是亲历者，著《卡子》揭露真相。3，投放病毒是反人类罪，只要证据确凿，就能按照国际法进行制裁，希望无人机出动。4，希望受到关注，世界卫生组织能够关注，立刻研究疫苗；\n\n00:40:39 路德: 最初版本是假的，在世界卫生组织压力下，1月12日故意再次交错，袁国勇站出来说与舟山蝙蝠相似；CCP偷偷在14日更改，发现就是舟山蝙蝠；袁国勇故意说假的，灯下黑，为了排除舟山蝙蝠。“舟山蝙蝠”是敏感词，教授、专家圈子内决口不能提。\n\n00:43:44 艾丽: 2019年的病毒事件不少，猪瘟、内蒙-北京鼠疫，细菌存活温度；武汉是南北大交通中心点，客流量巨大，若空气和水传染，则无孔不入，比北京发生sars更可怕；为何就从武汉定向传播到香港，CCP对生化武器的研制很深，指哪打哪。\n\n00:47:31 路德: 战友不仅是病毒专家，也是医学专家，联系到了武汉医院的一线医生。医生回复：一切以国家为准。医生吓死了，报了疑似病例，国家不给回复，和普通病例放在一起，（为何确诊太少？因为国家不给确诊）微博树先生，父亲得病，他也写了微博，但目前树先生已死。\n\n00:50:05 安红: 1，武汉有革命传统；2，武汉大学生，曾有22个人莫名人间蒸发，消失者无不身体健康，父母寻亲被迅速维稳，被摘器官或被试验；3，推上有视频流传，香港年轻人被北上运送，可能被运到武汉被活摘，或试验。\n\n00:53:09 路德: 集权国家，岁月无法静好，CCP统治，暗箱操作，病毒没人能幸免；病毒有并发症。中国人烧香拜佛，砸到自己就认倒霉，非常可悲。\n\n00:55:22 艾丽: 党的邪恶，何为党组织？吴花燕为例，“国家”是个伪命题，被洗脑。天津泰达医院，心脏移植科27个沙特阿拉伯人等待移植，杀害新疆人，因为需要“清真肝脏”，按需杀人。法论功被杀，是真的。中美贸易协议，西方在信用的基础上将程序，但信用与法律在CCP眼中是废纸，党彻底破坏了信！呼唤专业人士找回良知。\n\n00:59:46 路德: 财新胡舒立又率先跳出来辟谣，若没有文贵先生爆料，还误以为是“好感传播”；胡舒立与王73站在一起，全世界转发财新“辟谣”，可见武汉sars并不仅仅是公共卫生事件，已经上升为政治事件。\n\n01:01:13 安红: 财新发声，恰好可以顺藤摸瓜；CCP不怕沿海城市死掉9个亿，谁被死掉？支持小郑州。\n\n01:03:36 路德: 为何是政治问题？如果没有爆料革命，信息不对称，投放病毒很容易掩盖过去。谋略太毒：先说是舟山病毒，一看对不上，成功辟谣。热度降低后，悄悄修改。很容易借此事件，隐藏政治目的。王73布局多年的病毒专家，用“绵绵发力”搞定，关键时刻跳出来。战友中的有志之士，病毒专家揭露真相。类比鸡腿潘等大外宣，“绵绵发力”，等到意识到的时候已经晚了。\n01:09:03 安红: 分享自己被“绵绵发力”的案例。经历了磨练和锻炼，慢慢才能看出来；从东京爆协，到鸡腿潘，鸡腿潘曾在节目中，对捐款法治基金阴阳怪气；在爆料过程中不断学习，永远放过每一个战友，不放过任何蛛丝马迹；\n\n01:13:53 路德: 舟山病毒这么大的事情都能玩诡计，谋略绕了几个圈，可以找各种借口推卸责任，包括砸锅伪类，这是CCP的伪装性。黄河便、夏夜狼不敢提名字，很恶心，出阴招，又没种！\n\n01:15:48 艾丽: 2017年文贵爆料被中断，提醒西方，人类文明黑暗时代已经到来，当时很震惊；跟随爆料革命两年多，逐渐明白，黑暗吞噬光明正在进行中，大家都要站出来照亮黑暗；希望中南坑里看到非典背后的政治斗争；中美贸易协议明天讲；支持法治基金。\n\n01:18:03 路德: 注意防范，注意个人卫生，给CCP施压公开病例，不能藏着掖着，要抓紧确诊。酝酿大危机，究竟谁想出大事？是否有一派想借机夺权，路德尽可能爆出真相，受自己知识能力限制，但绝不会像财新编新闻；以共灭共。要阳光下的缺陷，不要阴暗下的完美。\n\n请关注",
			"added": 1579528179,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 42,
			"title": "武汉肺炎新型冠状病毒来源于中共军方技术改造的舟山蝙蝠病毒证据",
			"body": "https://www.youtube.com/watch?v=gTHThGt_GCo\n\n00:04:20 路德: 1，武汉肺炎新型冠状病毒来源于中共军方技术改造的舟山蝙蝠病毒证据：冠状病毒有四种重要蛋白质，海外专家今天对比小包膜蛋白（envelope Protein，简称E蛋白），发现武汉新病毒vs舟山蝙蝠病毒具有100%相似度！作为一种变异度高，跨物种传播的病毒，出现这种100%相似近乎不可能的情况下居然出现了！2，用另一个工具验证，比对与武汉病毒全基因组最相似（88-89%）的两个舟山蝙蝠病毒，结果居然是一个舟山病毒和武汉病毒的相似度大过与另一个舟山蝙蝠病毒的相似度。\n\n00:07:38 路德: 3，HK研究蝙蝠的专家Gary博士指出的。舟山蝙蝠基本不会直接传染人。说明需要（人工或自然的）病毒变异。但是自然变异几乎不可能保留一样的E蛋白！\n\n00:08:59 安红: 举例佐证路德逻辑。1，世界上有70亿人，但双胞胎都没有一样的指纹。亲子鉴定，配比都不是100%完美复制。此病毒100%相似，确定是人为复制。2，CCP培养多利羊，CCP专家做胚胎试验，做基因改造，从胚胎阶段试验，可能造成恐怖变异。3，CCP邪恶把所有人都逼成专家。4，猜测会否一开始只想定向杀香港同胞，但人传人变异可能超出控制。担心疫苗效果。5，有良知的人告诉了路德。爆料后，忽如一夜病毒来。\n\n00:13:56 路德: 1，玩火玩大了，此前可控可治，但变异太快，35个毒种，已经不可控了。2，以前只能会促发并发症，致人死亡。没想到变异太快了，有30多岁的死亡病例。\n\n00:16:05 艾丽: 1，病毒单分子链，不像双分子链相对稳定，变异太快，35个毒种。2，猜测CCP可能一开始只想消灭老弱者，现在已经不可控。3，回忆2003年非典，全球8000多人感染，其他国家医生迅速上报，CCP恶意不通报不透明。\n\n00:20:19 路德: 武汉前线透露，已不可控；目前排队确诊的都是12月发病的，1月发病的还没轮到确诊；财新“砖家”跳出来“辟谣”；\n\n00:22:09 安红: 1，财新“砖家”洗地。2，蒋彦永曾在SARS事件中率先向外界披露中国大陆的严重疫情；3，不要乱走，可能要干坏事儿。4，以科技方法跨越了动物到人的传播，会否再回传给动物，传导全世界？5，穷追猛打，警觉起来，责问政府。\n\n00:25:35 路德: 1，财新为何一直否认和舟山蝙蝠有关，因为军方研制的。2，询问是否人体实验？不敢想。3，64格棋盘,。4，CCP有教授用人做克隆，CCP什么事都做得出来！5，凭什么说可控？超乎CCP估计，已经控制不住了。\n\n00:30:14 艾丽: 1，E蛋白百分之百相似，家里养舟山蝙蝠都不一定得病，不经过人为改造，不可能在人和人之间传播。2，从鼠疫到非典，是否连环在动物身上找病毒。3，南京军区有大量科研基地，传播到一定程度后才发放疫苗？难道想要采集更多样本？\n\n00:33:25 路德: 1，18日协和医院内部培训资料，以常规肺炎做培训，“持续人传人概率低”，“可控可防可治”，欺瞒医生。2，国际上非常紧张，6星期时间确诊200多例，肯定还有很多瞒报的。\n\n00:37:38 安红: 人类23对染色体；胡平长篇报告文学《中国的眸子》，介绍活摘器官，非常残忍；武汉有航班直接飞美国，一旦失控，后果不堪设想。\n\n00:40:31 路德: 1，CCP对“人传人”宣传口径，咬文嚼字掩盖真相；2，舟山蝙蝠病毒是经过军方备案的。3，法国微生物专家质疑。CCP想将之引到野生动物上，但华南海鲜市场只有鱼，路德节目昨日就猜测是来自冰或水中。4，CCP诡辩术。5，认为CCP搞实验，不通过动物，直接通过水，试验成功。\n\n00:46:52 艾丽: 1，以“强拆——上访——找事儿”强盗逻辑管理国家，CCP向来以果为因。2，CCP想把病毒来源，引导为不可知，若通过水和空气接触，是非常快的。\n\n00:49:28 路德: 华南海鲜市场一出事儿，CCP就立刻锁定、消毒，毁灭证据源头，并禁止海外专家进入。暗藏很大阴谋。CCP认为可控，可能未来还想做生化武器，但没想到已经完全失控。\n00:52:22 安红: 1，卢沟桥事变真相。2，消毒一次，为何继续消毒，毁灭证据。3，微信群里传，美帝放毒。4，CCP的毒食品。澳洲宠物食品都标明，没有任何中国来的食材。韩国国际进口食品展，中国食品企业空无一人。新西兰、韩国等国家，最好的视频都留在国内，全国人民重金属全部超标。\n\n00:57:15 路德: 华南海鲜市场二次消毒，微信宣传美国病毒武器，幸好路德节目提前揭底“舟山蝙蝠”，反噬CCP。单纯的科学家会百分百相信ccp，这位专家战友通过爆料革命开智，发现了蛛丝马迹。CCP想往两个方向引导：1,美国。2，自然来源。钟南山接受采访，用来稳定局势，带风向“有限的人传人”、“来自野生动物”替CCP投毒转移视线。\n\n01:02:53 艾丽: 1，微信圈一半声音推给美国；2，2003年非典，北京市长孟学农被王岐山“救火队长”取代。3，南京军区换肾专家，84岁黎磊石跳楼自杀，死亡原因不明。\n",
			"added": 1579532653,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 43,
			"title": "钢铁侠对话穆桂英——红三代聊武汉非典的起因的走向",
			"body": "https://www.youtube.com/watch?v=YHTvTfA59So",
			"added": 1579854165,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 44,
			"title": "中共BGY挖掘整理",
			"body": "https://s3-ap-northeast-1.amazonaws.com/news.guo.offload.media/wp-content/uploads/2020/01/24030743/中共在加州潜伏的一只大屎壳郎%EF%BC%81.docx\n\n东方集团张宏伟\nhttps://s3-ap-northeast-1.amazonaws.com/news.guo.offload.media/wp-content/uploads/2020/01/25215807/%E4%B8%9C%E6%96%B9%E9%9B%86%E5%9B%A2%E5%BC%A0%E5%AE%8F%E4%BC%9F.docx\n\n武汉p4 lab，郭德银\nhttps://gnews.org/zh-hans/111116/ ",
			"added": 1580010717,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 45,
			"title": "利用信息隐藏技术对抗网络审查",
			"body": "压缩，加密，hash校验于一体，通过将敏感文件压缩加密后嵌入正常文件中传递给对方，对方使用同样的软件提取解密。类似于隐写术 Wiki: Steganography , 先压缩加密，后隐藏在普通文件中\n\nSteghide is a steganography program that is able to hide data in various kinds of image- and audio-files. The color- respectivly sample-frequencies are not changed thus making the embedding resistant against first-order statistical tests. \ncompression of embedded data\nencryption of embedded data\nembedding of a checksum to verify the integrity of the extraced data\nsupport for JPEG, BMP, WAV and AU files\nhttps://sourceforge.net/projects/steghide/files/steghide/0.5.1/steghide-0.5.1-win32.zip\n\n类似工具还有Quickstego  mp3stego audiostego 等，欢迎挖掘寻找。武汉等城市彻底断网使用briar(bluetooth connect)   firechat\n\n参考 编程随想方法3 https://program-think.blogspot.com/2011/06/use-image-hide-information.html\n 利用不同的隐写软件将加密文件溶入正常文件中，而不是简单的拼接在图片后.\n\n",
			"added": 1580221252,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 46,
			"title": "共产党残忍的蓄意！武汉肺炎 上篇",
			"body": "https://gnews.org/zh-hans/94893/\n我昨天晚上在抖音上看到好多人围堵武汉人的视频，感觉到武汉人的受到了不小的屈辱！我还是想说：他们不是罪魁祸首，他们是直面者，更是受害者！真正让他们受到这种屈辱的是邪恶的共产党，今天我们就聊聊关于武汉肺炎，共产党所有残忍的蓄意！\n\n蓄意的投放\n\n湖北是李友的地盘，也是孙立军和孟建柱控制的，北大方正控制着湖北最大的病毒研究中心武汉P4实验室，而且就在疫情爆发前，王岐山在换了新疆人的肾脏后还秘密坐火车去了武汉，时间和病毒爆发时间很吻合！这个时候胡舒立还出来辩解引导， 共产党把高危传染性病毒研究所，放在九省通衢，人流不断的武汉，这如果不是蓄意的投发，这尼玛就是智障了！就在刚刚我还看了穆桂英的爆料，更加证实了武汉肺炎病毒中南坑是直接责任人，共产党投毒是准确的，10月份就已经投毒了，只不过没有扩散开，中南坑里早就知道这件事！\n疫情初期有8个英雄敢于说出真相却被黑警以造谣罪名定罪抓捕封口，共产党解决问题的方式永远是不解决问题，解决提出问题的人，谁提问，抓谁，谁质疑，送谁去坐牢，共产党这种流氓真是TMD王八蛋，随后新闻联播虚假的宣传可防可控可治，病情稳定，不信谣不传谣，别带节奏，专家声称未发现人传人，到钟南山出现说，病毒可以人传人，最后直接封城！媒体还爆料说武汉肺炎和当年的非典有90%的相似性，但是今天穆桂英爆料说只有60%的相似性，实际上它就是全新的病毒，所有蛋白都是人工合成的，官方还说不要担心，高温可以杀死这个病毒，完全不对，穆桂英爆料，武汉那边已经做过实验，在56°的温度下，其他病毒都会死亡，武汉肺炎病毒例外，可以在空气中存活半小时之久，这个病毒前所未有！一直以 可能，疑似，很多不确定的词汇，指向水产市场和野生动物，锁定目标说是蝙蝠，同时官方声称 要打击病毒来源，口口声声说疑似病毒，你们真的找到目标了吗？从始至终你们的做法就是在蓄意隐瞒！\n\n蓄意的辟谣\n\n网民，朋友圈，微博等一切一线传出来的救助视频，医院里面走廊死去已久的尸体没人处理，官方辟谣说不是尸体，你们是眼瞎了吗？这完全延续了非典时期当局辟谣的手段，捂盖子，删帖子，官方辟谣，无论是什么内容，只要是不利于官方的都说是造谣，但是从来不会告诉你造谣内容，哪里造谣了？事实是什么？这是真拿老百姓当傻瓜啊！这也太不符合逻辑了！\n穆桂英爆料说10月份中国解放军P4实验室已经开始多次投毒计划了，但是并没有传播开，种种迹象表明10月份之前就已经知道病毒具有传染性，但是一直在瞒报，拖延，甚至还抓捕了披露真相的老百姓，错过了隔离病患的最佳时期，还故意给老百姓造出歌舞升平的假象，明知道春节人口回乡流比较大，也没有发布公告让老百姓做好准备，这就是让病毒蓄意的传播，没想过要控制！",
			"added": 1580291817,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"32_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"5_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr": 1
	},
	"next_comment_id": 85,
	"comment": {
		"2_1FRsFWqkx5TVyRqy9Xr3XoshYDDZHXSQvz": [
			{
				"comment_id": 1,
				"body": "The door to the new world! https://thehiddenwiki.org/",
				"added": 1498317906
			}
		],
		"2_1F1hDNq8nHuaT7tymaYVER8tPT9ybZJngw": [
			{
				"comment_id": 2,
				"body": "之前有，现在很难找到了",
				"added": 1498318546
			}
		],
		"1_17BWZrVqbBfio1CrdRftMNhxWa4ybHfY3U": [
			{
				"comment_id": 3,
				"body": "不要用国产软件，包括输入法，开启tor always和VPN",
				"added": 1499267229
			}
		],
		"7_1NmwA9EFPu94QaN7yMYpzu2iSg1dGAYV6n": [
			{
				"comment_id": 4,
				"body": "做出来天朝的审核也过不了",
				"added": 1499267464
			}
		],
		"1_1MRJa4HNPExsCDYz9siG421uu8QnwRkLwR": [
			{
				"comment_id": 5,
				"body": "utorrent、 bittorrent",
				"added": 1499267860
			}
		],
		"1_1DPi5BZe8k9zuCZwkuheFBcaj8j2tZNks4": [
			{
				"comment_id": 6,
				"body": "> [vincentcheung](#comment_9_12e4EcUWaMHVa31rkuzWWxstByasqAp7RV): 应该收集五毛的资料\n五毛资料10G邮件：\nBXN7SWYXHHV5QFW47YAZJ5N5KYDYDPGOC\n编程随想的博客有其他部分",
				"added": 1499492322
			}
		],
		"1_1GoS2ssCChCqHnt5AFnTBSgsv8bkoPUYqe": [
			{
				"comment_id": 7,
				"body": "现金！",
				"added": 1499697775
			}
		],
		"1_1Dvv72mjPtx2qf1rFzfj5wkZ6RjCdwPgVY": [
			{
				"comment_id": 8,
				"body": "silkroad3",
				"added": 1500785044
			}
		],
		"375_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 9,
				"body": "可以解绑",
				"added": 1501049149
			},
			{
				"comment_id": 10,
				"body": "可以解绑",
				"added": 1501049180
			}
		],
		"393_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 11,
				"body": "李朋家族、蛤家族等等，资产过去曝有几千亿，现在说有几十万亿。毕竟他们掌控者国家的水、电、油、气、烟草、食盐、军工、交通运输等等暴利资源！感兴趣可查查“巴拿马文件”",
				"added": 1501049456
			}
		],
		"392_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 12,
				"body": "运兵，赚钱、暴利垄断",
				"added": 1501049605
			}
		],
		"2_1CyDAKDD4C3x14NQMmh5MxfKJZ5xxLF24g": [
			{
				"comment_id": 13,
				"body": "实时更新，安装resilio SYNC即可使用：B4F5YOHLAEWHNBQA5SSHDXHVYOZ3NXQGB",
				"added": 1501049986
			}
		],
		"371_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 16,
				"body": "因为天朝是朝鲜升级版，并没有比朝鲜民主到哪，如果打朝鲜，会顾忌中国，如果天朝帮打，等于打自己脸，维稳高于一切",
				"added": 1501050368
			}
		],
		"3_1FvnsJWRafUBWfdGpLm9DbtMQwFTaGjQBD": [
			{
				"comment_id": 17,
				"body": "极左极右思想都是可怕的……",
				"added": 1501050503
			}
		],
		"396_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 18,
				"body": "有替音电话",
				"added": 1501052130
			}
		],
		"300_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 19,
				"body": "手机防窃听只能拔电池，或者放电磁屏蔽笼里",
				"added": 1501052503
			}
		],
		"2_1LU4wMtGd5tyX2ABea5zoRZNsdxZFRtoMZ": [
			{
				"comment_id": 20,
				"body": "文贵越来越向网红靠拢了",
				"added": 1501253739
			}
		],
		"43_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 21,
				"body": "假设不成立",
				"added": 1502427451
			}
		],
		"2_1CV1zQjkdRKBd9NNXBpVELvzXDp7puzUmX": [
			{
				"comment_id": 22,
				"body": "不下载，常升级，保平安",
				"added": 1502427536
			}
		],
		"303_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 23,
				"body": "预言成为i现实！比特大跌",
				"added": 1506327530
			}
		],
		"1_18YKTMTiRTydsbWc7BxjjCAnyJawCCqQPz": [
			{
				"comment_id": 24,
				"body": "现在事业单位的小官员都担心政治风险，随时准备移民",
				"added": 1508328378
			},
			{
				"comment_id": 25,
				"body": "现在事业单位的小官员都担心政治风险，随时准备移民",
				"added": 1508328488
			}
		],
		"1_1Ceg5F9KEWkCyTu3r1QBSuiU8C1PYsd8PJ": [
			{
				"comment_id": 26,
				"body": "电脑不要装任何国产软件，尤其是联网、弹窗的",
				"added": 1510463950
			}
		],
		"1_1vjjRJpiNosn98M8cc1R6FnhgwY2bAekr": [
			{
				"comment_id": 27,
				"body": "从不用360，后台窃取个人数据不说，容易查水表",
				"added": 1510464134
			}
		],
		"10_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": [
			{
				"comment_id": 28,
				"body": "大傻：中国梦；厂公：王书记；战神：文贵；古时蒙古人把吃人肉称为吃两脚羊",
				"added": 1510466285
			}
		],
		"1_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb": [
			{
				"comment_id": 29,
				"body": "中国热点最活跃",
				"added": 1510582535
			}
		],
		"1_1KvJqygUJMhLQX2uLYnHYkiwpc6rFvPqsw": [
			{
				"comment_id": 30,
				"body": "用比特彗星 国外原版",
				"added": 1511069627
			}
		],
		"1_1FvNyzBipKed6VtnaSBhvq2J5pLnzVXd38": [
			{
				"comment_id": 31,
				"body": "媲美欣，让人看后很不是滋味……",
				"added": 1511146377
			}
		],
		"2_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb": [
			{
				"comment_id": 32,
				"body": "stream上，朝鲜也有一个点",
				"added": 1511148818
			}
		],
		"13_1FJCJm9PPaL2Lcfv64fSCuXXBHQcE4JdGY": [
			{
				"comment_id": 33,
				"body": "来这不带TOR，小心被抓",
				"added": 1511513965
			}
		],
		"1_1Pui227kvaiRJ1FdeAJZTQUDb4nNx9n8gd": [
			{
				"comment_id": 34,
				"body": "1024 t66y.com的技术区见过",
				"added": 1511782189
			}
		],
		"12_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL": [
			{
				"comment_id": 35,
				"body": "上海盗湾传BT吧",
				"added": 1511782778
			}
		],
		"1_188Uit7FJJgyMWE3yh6934fKSucopDHgDz": [
			{
				"comment_id": 36,
				"body": "正解",
				"added": 1512388433
			}
		],
		"2_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 37,
				"body": "文贵提到这是盗国贼的阴谋，激起民愤，影响政局妄图篡位",
				"added": 1512463643
			},
			{
				"comment_id": 38,
				"body": "文贵提到这是盗国贼的阴谋，激起民愤，影响政局妄图篡位",
				"added": 1512463753
			}
		],
		"1_16LevgM81YcLYVYebEkoLKhAbgmeezzqjb": [
			{
				"comment_id": 39,
				"body": "ipv6无需担心，他们没那本事",
				"added": 1513074719
			}
		],
		"1_1GYCHJSLNgsAQiaLSmmoBrtGRErg7PJrEE": [
			{
				"comment_id": 40,
				"body": "说东厂王总管的秘书，哥们分别进入银监会、中国人民银行、中国银行、工商银行、建设银行、新华保险等金融机构担任一把手，全面掌控钱袋子，方便洗钱，且担心会在2018年超发货币引起货币贬值、股市大涨在大跌、楼市大跌等一系列灾难，目前郭正和中央努力取得联系，将更多惊天爆料交给中央，如若失败，提前在网络爆料！另外，总管为自己私利将反导系统卖给中东，间接干涉了中东局势，恐引起极端组织报复。",
				"added": 1514903884
			},
			{
				"comment_id": 41,
				"body": "说东厂王总管的秘书，哥们分别进入银监会、中国人民银行、中国银行、工商银行、建设银行、新华保险等金融机构担任一把手，全面掌控钱袋子，方便洗钱，且担心会在2018年超发货币引起货币贬值、股市大涨在大跌、楼市大跌等一系列灾难，目前郭正和中央努力取得联系，将更多惊天爆料交给中央，如若失败，提前在网络爆料！另外，总管为自己私利将反导系统卖给中东，间接干涉了中东局势，恐引起极端组织报复。",
				"added": 1514903940
			},
			{
				"comment_id": 42,
				"body": "说东厂王总管的秘书，哥们分别进入银监会、中国人民银行、中国银行、工商银行、建设银行、新华保险等金融机构担任一把手，全面掌控钱袋子，方便洗钱，且担心会在2018年超发货币引起货币贬值、股市大涨在大跌、楼市大跌等一系列灾难，目前郭正和中央努力取得联系，将更多惊天爆料交给中央，如若失败，提前在网络爆料！另外，总管为自己私利将反导系统卖给中东，间接干涉了中东局势，恐引起极端组织报复。",
				"added": 1514903992
			},
			{
				"comment_id": 43,
				"body": "说东厂王总管的秘书，哥们分别进入银监会、中国人民银行、中国银行、工商银行、建设银行、新华保险等金融机构担任一把手，全面掌控钱袋子，方便洗钱，且担心会在2018年超发货币引起货币贬值、股市大涨在大跌、楼市大跌等一系列灾难，目前郭正和中央努力取得联系，将更多惊天爆料交给中央，如若失败，提前在网络爆料！另外，总管为自己私利将反导系统卖给中东，间接干涉了中东局势，恐引起极端组织报复。",
				"added": 1514904449
			}
		],
		"1_1Q7Ebizvdsta5fdhrojC6eyUzRKrPKY5Cb": [
			{
				"comment_id": 44,
				"body": "背后真正老板是孟建柱家族，孟亮为实际控股人",
				"added": 1516510963
			}
		],
		"4_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF": [
			{
				"comment_id": 45,
				"body": "文贵说东厂王总管的秘书，哥们分别进入银监会、中国人民银行、中国银行、工商银行、建设银行、新华保险等金融机构担任一把手，全面掌控钱袋子，方便洗钱，且担心会在2018年超发货币引起货币贬值、股市大涨（果然2018年一月大涨）再大跌、楼市大跌等一系列灾难，目前郭正和中央努力取得联系，将更多惊天爆料交给中央，如若失败，提前在网络爆料！另外，总管为自己私利将反导系统卖给中东，间接干涉了中东局势，恐引起极端组织报复。",
				"added": 1517841188
			}
		],
		"2_1PBMVMMVVtSK6FmMbfz4fhEw5fv6eZs5Dn": [
			{
				"comment_id": 46,
				"body": "beaker browser，IPFS",
				"added": 1517841424
			}
		],
		"6_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 47,
				"body": "好像十年前就已有了",
				"added": 1519894701
			}
		],
		"62_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 48,
				"body": "alibaba，支付宝，微信红包全面监控人们的钱袋子",
				"added": 1519894872
			}
		],
		"5_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 49,
				"body": "ok",
				"added": 1519895082
			}
		],
		"3_18tQgVR1eb2Y1LSXmzZSMp7K8z8dTGpcAo": [
			{
				"comment_id": 50,
				"body": "狗比人金贵的时代，人都成了贱民，不仅被城管、交警、领导欺负还要被畜生欺负",
				"added": 1519895237
			}
		],
		"100_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 51,
				"body": "枪杆子里出政权！六四就是太软弱，缴来的枪居然还上交给公安，所以当军队碾压时，屁民成了炮灰",
				"added": 1519895395
			}
		],
		"2_19wMFS5AMRnmgwybFryDJ6MwnWji1S1HKv": [
			{
				"comment_id": 52,
				"body": "十九大期间正常工作的有TOR，I2P，DHT可以被干扰甚至屏蔽",
				"added": 1519896981
			}
		],
		"41_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 53,
				"body": "360，搜狗拼音，百度腾讯阿里巴巴等国产软件开个后门监控是分分钟的事，大量VPN被封有他们的功劳",
				"added": 1519897130
			}
		],
		"1_1CV1zQjkdRKBd9NNXBpVELvzXDp7puzUmX": [
			{
				"comment_id": 54,
				"body": "参考美剧 MR,ROBOT",
				"added": 1520157783
			}
		],
		"1_1DvQJKRFe1BYN3gyctA3BkjuxUQN8bRCof": [
			{
				"comment_id": 55,
				"body": "经常更新下，方便做种",
				"added": 1547177118
			}
		],
		"13_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 56,
				"body": "虚假的政治前途，看看被下马的官员惨象，无论如何位高权重只要不是赵家人，都是人家的一次性棋子，用完即弃，必要时灭口，看看海航王健怎么死的，千人计划（策反说服学者回国效力）创始人张首晟怎么死的，国际刑警副主席孟宏伟及家人如何消失的，……为恶魔卖力没有好结果，只会那你当圈养的野狗，咬完别人后丢掉、杀掉……",
				"added": 1547271964
			},
			{
				"comment_id": 57,
				"body": "指导思想是g党历史传统，渗透策反组成统一战线，简称统战。（统战部是举足轻重的间谍机构）",
				"added": 1547272102
			},
			{
				"comment_id": 61,
				"body": "> [85958699](#comment_4_1PBJFjLdKfAHEpPgJH4nVEUBJfcS3SUbjL): 虽然不排除是真的不过看起来好幼稚像是网上搜集拼凑出来的段子....\n\n结合实际的话，可信度还是不错的，微博上的五毛不都是这些手段吗油管路德访谈有维稳指导文件，可信度也不错",
				"added": 1549873169
			}
		],
		"93_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 58,
				"body": "> [yonq](#comment_1_1Bp8e2cK1oCvACa57W7zDQ6ndh8jRnL9Af): 打开支付宝首页搜索“541511458” 立即领红包\n查水表",
				"added": 1547354656
			}
		],
		"3_1CdwZ24MZhBc2XNT2vAjk2MQjJuEnybP5W": [
			{
				"comment_id": 59,
				"body": "看文贵爆料，习王必有一战",
				"added": 1549181626
			}
		],
		"323_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 60,
				"body": "把私家车全开出来停马路上比人肉站街好多了",
				"added": 1549181753
			}
		],
		"5_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 62,
				"body": "干得漂亮！",
				"added": 1558758558
			}
		],
		"18_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 64,
				"body": "一样的文化，一样经过新文化运动的开智，CCP的封建殖民统治使得大陆退回到封建社会，很多人开始质疑西方民主与自由，不得不说是悲哀！\n民主有其弊端，但比殖民统治好得多，香港回归前得英国政府对香港都是民主制，回国后，民主自由渐失，港人不得不为自由而战！所谓生命诚可贵，爱情价更高，若为自由故，二者皆可抛！百年前的革命者早已道出了自由的珍贵！\n韩国的民主制度使得朴槿惠因一点点丑闻而入狱，这在中国大陆是不可想象的！",
				"added": 1560857539
			}
		],
		"1_19CAUZrhQtkzsCEUzWY8tK5RT3EnGheA6k": [
			{
				"comment_id": 65,
				"body": "tor",
				"added": 1561524704
			}
		],
		"2_1AnJevUyYnVpFYAxVYZ83BZhhJHr76GvxV": [
			{
				"comment_id": 66,
				"body": "不要用它，可能的钓鱼软件",
				"added": 1562234315
			}
		],
		"1_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": [
			{
				"comment_id": 80,
				"body": "关乎中国人是走向自由民主还是成为现代封建奴隶",
				"added": 1573876891
			},
			{
				"comment_id": 82,
				"body": "外交部说《中英联合公报》已成历史，不再具有效力，违背了50年不变的承诺！\n回归后从没实现过真正的“双普选”。",
				"added": 1579151426
			}
		],
		"14_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 68,
				"body": "這條消息的透漏者和他的家人已被抓！是軍隊的大校，他此前已做好隨時犧牲的準備，但大概未想到會連累家人，封建連作制度再次出現！\n8月12號，土共再次暴力清場，即便是在家的老人孩子也有被打被抓，内地香港的噩警一起抓捕，香港一女孩眼睛被橡皮彈擊中失明！\n………………\n",
				"added": 1565601421
			},
			{
				"comment_id": 72,
				"body": "箭在弦上不得不发！\n28号伴随着装甲车驶入的驻港部队只进不出的换防。\n8月31号CCP再次对香港市民大抓捕，国内官方报道已抓捕上千人，实际5000多人，一系列的抓捕正是戒严令第四条的实施。\n9月5号，香港警察暴增5倍。\n所有事件表明香港事实上早已实施戒严！",
				"added": 1567584608
			}
		],
		"16_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 69,
				"body": "郭文贵爆料：中南海内部消息，中共家族想出兵台湾甚至不惧挑起第三次世界大战，他们要行动了！\n定义为恐怖组织目标达成！这不是目的，但能让大家看到CCP如何搞信息战，篡改数据等等。由此借助国际力量一同反共，仅靠民众抗议力量微薄，历史经验表明非暴力革命成功率最高，争取各方力量才能成事，无论苏维埃支持的CCP还是美国加入的抗日，想要自由民主的生活，想要吃得起安全的红烧肉必须通过非暴力革命灭共！\n暴力革命成功率可参考编程随想的博客。\n对于极端邪恶的匪类要坚决的干掉，对于被洗脑的人要给与时间和资源（包括但不限于知识，历史，信息等）让其醒悟，五毛粉红和当年的红卫兵没什么区别，但对其要仁慈为主以德服人，不能像极端分子那样用极端手段对付被洗脑的人，否则只会社会大乱！\n仁慈和正义是光明而强大的力量！",
				"added": 1567584234
			}
		],
		"5_1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS": [
			{
				"comment_id": 73,
				"body": "> [qier](#comment_48_1AnJevUyYnVpFYAxVYZ83BZhhJHr76GvxV): 为什么要求美国？\n\n中共起家到做大靠的是苏联的支持",
				"added": 1569214060
			},
			{
				"comment_id": 74,
				"body": "地址在这里 https://petitions.whitehouse.gov/petition/sanction-hong-kong-police",
				"added": 1569214288
			}
		],
		"17_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 75,
				"body": "9月23，郭媒体国庆70周年之际直播摘要，阅兵是如何劳民伤财巧取豪夺百姓财富大秀肌肉的：\n22:05 郭媒体在西方传播香港真相，并引起西方重视。对付中共从对付西方被蓝金黄的媒体开始\n22:50－10年前参与国庆阅兵的座上宾已成为阶下囚。习王政权与10年前胡温政权相比更不稳定。\n24:00—中共一边准备阅兵，一边抢劫私人企业财富。掠夺大量民间财力进行军演，粉饰太平盛世，向世界秀肌肉。\n29:40—历次阅兵大庆人民付出很大的代价，只培养出几个家族的利益\n39:25—铲除共产党必须先把其几个蛇头铲掉。\n43:06—共产党就用商鞅五条让老百姓贫穷、饥饿、疲劳的情况下只可以求生存而不顾其他。如果给中国的老百姓法治和自由，就可以凸显出他们的勤劳、坚毅、有决心、有追求，香港就是一个很好的例子。\n48:28—国安委2019年的三大战役：财富归党、拿下香港台湾、人民币国际化，对外派兵突破第二岛链。\n54:56—阅兵的目的：掩盖金融危机；掠夺企业和老百姓的财富用于国防军事和支持伊朗政府继续做石油的业务；展示力量、震慑百姓，把独裁力量散播出去；企图做世界盟主\n1:42:44－ 班农告诫中国的企业家不能相信中共。代表中共作为海外投资是自己的灭亡之路。",
				"added": 1569296948
			},
			{
				"comment_id": 76,
				"body": "2019年9月28日郭文贵先生直播 https://www.youtube.com/watch?v=wzSnqs2wCUo\n摘要：\n这次直播内容重要，请战友们尤其是香港战友广泛传播。\n19：20--港人命运和70年大庆联系在一起，10月1号国庆前后发生的事决定香港生死。再加上美国两党之争，这三件事是下周大事发生的根本促成因素。\n\n22：15--遭到弹劾前，川普因忌惮股市从未就香港事件表态，即使对国会发起的香港民主和人权法案，也是扭捏作态。70年大庆放大了对美国国内政界的影响，让香港成为政治斗争的核心。\n\n27：01—美国政界所有中间派都站在香港这一边。美国此时两党之争，希拉里也浮出水面，成败便是谁对中共最狠。\n\n31：00--下周起，所有美国政要抢着制裁中共，会刺激川普总统对中共会做出更快更狠的制裁以帮助香港。\n\n34：39--美国人现已经意识到美国所有的问题都来自中共，并认识和要求习王两个人既有绝对权利，就要承担绝对的责任。\n\n36：00--美国对中共的制裁连一美元都不会放过，美国或将成立中国人民财富安全委员会。\n\n37：38--所有战友从下个星期开始全力以赴传播香港真相和爆料的中英文资料。\n\n42:37--中共的强大在于权力集中，弱也弱在权力的集中。现代化战争的重点在于天意和民心。\n\n43:40--纠正前一个视频爆料中朱镕基讲话：中共存在是侥幸，执政前40年靠骗，WTO后的30年才为国人做了点事，现在刚吃饱饭就开始作死。中共高层、中南海和军队现已失控。\n\n45:37--香港人民，美国高级政府官员以和我们爆料革命，将一起终结中共政权。\n\n47:19—下周一起，郭媒体进入备战状态，每天24小时直播，持续一周。\n\n48:04--我们爆料革命绝不参与美国的内部政治，现在谁对香港人民、对灭共有利，谁就是我们的朋友。\n\n53:42--香港的朋友们，牺牲不是我们追求的目标，我们要比共产党的盗国贼活得更好。\n\n55:30--希望大家把这个视频在香港和大陆广泛传播，接下来一星期是改变人类、灭共的最关键时刻。\n\n56:42--香港如果没有一个强大的大陆，赢了也不会好。文贵今天和美国朋友谈的就是如何把共产党转变为中国的合法政权的一部分，相信中国人民会选出一个绝对适合中国的政权。【GM56】",
				"added": 1569726634
			},
			{
				"comment_id": 77,
				"body": "真相经得起时间的检验和逻辑的推敲,不管信不信，共党解体的结局已经无法挽回",
				"added": 1570872044
			}
		],
		"20_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 78,
				"body": "香港的事情贵在真实，以真灭假，虽然市民对警察，对立法会有冲突，但也要真实反映出来，全面真实的记录，何况绝大多数都是土共在哪那里贼喊抓贼制造混乱。还有被抓被自杀的学生，新疆、深圳在建的集中营等等，共匪的作死加速着ccp的灭亡。",
				"added": 1570874670
			}
		],
		"5_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb": [
			{
				"comment_id": 79,
				"body": "国产软件不要用",
				"added": 1573873697
			}
		],
		"1_17TXu9AFtvuipkoTjUHajUBhcdtQaAjr8V": [
			{
				"comment_id": 81,
				"body": "Lokinet \"不必重复造轮子\"",
				"added": 1576987010
			}
		],
		"42_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 83,
				"body": "武汉SARS正式被列为甲类管控；最新论文揭露武汉新型病毒的进化通路！\nhttps://www.youtube.com/watch?v=XHi_HRIs4pY\n《中国科学杂志社》发布文章，武汉肺炎跟SARS的关系是亲兄弟，令人惊讶地“完美的”维持了SARS的S-蛋白 。3，武汉P4实验室，被视作国之大器。全世界各国都在寻找新的病毒，相当于找到了新的武器。4，蝙蝠存活了5000万年，活的病毒库，但都没有传播到人身上。5，从蝙蝠身上提取病毒后，进行试验只会有两个方向，大面积致死，或者不可控。6，与蝙蝠的关系，武汉肺炎“自然宿主”是蝙蝠，从“未知媒介”传染到人。7，此论文为何能说明是CCP研发的病毒？中国科学杂志社评分不高（3.8分），不是世界级顶尖杂志，文章中隐藏了很多机密不敢说，如果发在国际顶尖期刊，会被刨根问底，可能露馅。谁先抢占发表高地“抢沙发”，未来会拿到更多科研经费，所以作者急不可耐，用反向揭露的方式，反而曝光了自己就是研发者的真相。\n\n00:28:38 安红: 1，常识：科技论文不是那么容易写成的，需要反复论证和试验，这么快论文就出炉了，说明早就写好了。2，所有人都有权利质疑这篇论文的数据，数据如何得来？是否会用人试验。3，P4实验室连埃博拉病毒都能做，极大可能是人为做的。4，端细胞分裂50次，再也不会复制，上帝之手关掉开关。301医院研究如何让中央领导活到120岁，CCP民脂民膏只为特权阶层服务。5，解药是否还有效果？疫苗价格是否会暴涨到老百姓买不起的天价。质疑墙内媒体公信力。\n\n00:35:58 路德: 这样一篇专业论文，可否这么快写出？为什么要写这篇论文？\n\n00:36:13 墨博士: 1，稿件1月16日投入杂志，20号编辑同意发表，21日刊发，速度很快。2，确诊冠状病毒在1月8日-1月11日之间，作者从研究到出论文用了8天时间，这次速度超乎寻常地快。3, 在 8天时间里完成病毒分析，如果是真的，就太高效。4，定向委托的项目，军方（军事研究员）指导下。5，这么前沿的结果为什么发在这种低影响力的杂志上？通常情况下，编辑收到稿子会发给相应领域的审稿人，甚至用一到两周时间决定谁审稿。如果拿到顶级期刊，最牛的审稿人去评估论文，会质疑里面的所有数据、方法、细节，作者都要披露给审稿人，可能造成信息外泄。6，认为这是一个好消息，愿意披露这个信息，说明愿意给后续的疫苗出炉，或解决方案打基础。这才是最重要的。",
				"added": 1579686352
			}
		],
		"43_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 84,
				"body": "法治基金的巨大影响力显现了；中共为什么把锅推到P4实验室泄露？P4实验室泄漏有可能吗？很多人都在感谢通知他们提前储备粮食物资！\nhttps://www.youtube.com/watch?v=jNC9b-8xHHg\n\n英国科学家，在CCP官方公布数据的基础上，模拟数据，未来十天感染25万人，死亡1万人以上，一家之言，提前预防。3，川普发推，美国感谢中国在透明度上的努力。4，新华网发布31个省级行政区GDP数据发布，和中央数据对不上。\n00:13:32 路德: 法治基金、法治社会年会结束，比尔·格茨新闻报道：致命病毒可能在武汉一个实验室传播，与中国的秘密生物武器有关。比尔·格茨代表军方，爆料革命的情报来源都被验证了。CCP又带节奏，在爆料革命的一再证据打脸下，想要推给实验室泄露。病毒的变异只有两种渠道，1，自然变异。2，人工干预。若是自然变异，病毒精确换掉4个蛋白至少要经历1万变才能实现。那就只有一种可能，人工干预。继续甩锅给美国。逻辑链就是证据链。P4实验室状态：1，武警把守。全面消毒。2，就算没泄露，只要断电，第一时间防化部队进入。 3，零下80度存放，拿到20公里以外的华南海鲜市场的过程，肯定经过层层审批。4，这种病毒相当于核武器，不可能随随便便带出来。5，分离一个病毒就非常困难，要投入大量资金。6，每一支都会做好编号，少一支相当于少了一支核武器。\n\n00:26:27 bo博士: 1，在蝙蝠身上自然变异精确换掉四个蛋白，几率极低。变异到恰好替换到四个蛋白，又同时被人类感染，概率更微乎其微。2，动物病毒突然变成了“动物传人”传给了人后，人身上再变出“人传人”，相当于中了两个六合彩。3，病毒实验室的情况。0.8个大气压，一旦出问题，空气从外往里流，空气不会往外流。温度控制极其严格。实验是碰运气，成功率极低。入门级微生物学实验室已经如此严格消毒，更何况P4实验室。4，泄露可能性微乎其微。\n\n00:34:13 老江: 1，CCP究竟要掩盖什么？第一个就诊者，即0号传染源，CCP有这么多监控系统，为何找不到0号传染源，到底要掩盖什么真相？2，自杀式封城，迫不得已。3，向公众保证，尽可能呈现真相。\n\n00:38:17 路德: 1，bo博士介绍，即便是给老鼠做活体实验，1000次能成功1次已经很不错了。2，不可能是美国人，携带环境苛刻。3，就在P4实验室附近爆发。网友问：CCP会不会这么傻，就在病毒实验室旁边投放？P4实验室认为可控，测试一下，可能传三代就死了。但人和老鼠毕竟不一样，接下来就是天谴。\n\n00:43:48 bo博士: 这个说法可信。如果只传播三代就死亡，个体死亡后，这个病毒就消亡了。但人体的变异里，只要有一个人的毒株碰巧可以大规模人传人，变异毒株就扩散了。\n\n00:45:38 路德: 纠正一下。本来就可以人传人，提到的变异是指杀伤力更强的变异。\n\n00:45:56 bo博士: 1，普通病毒：病毒自己不更新的话，碱基配对会出错，繁殖两到三代就会自然死亡。2，如果繁殖出的病毒可以大规模的复制，且复制不影响自体生存，即稳定地人传人病毒（这是实验室里没能力做出来，在人传人过程中产生的），这就开始大规模的传播了，所以就像中了六合彩，实验室里都做不出来。3，为何新闻前面一直说“可控、不会人传人”，因为他们认为可控，这是灾难的开始。\n\n00:47:57 老江: 相信路德和老江的论断。\n\n00:48:16 bo博士: 1，感冒为何传播？也通过飞沫传播。感冒病毒20%左右也是冠状病毒。2，病毒数量增多，能形成种群，才能形成对人的伤害。这是为什么不要去人多的地方，空气凝胶的概率比较大。\n\n00:51:00 路德: 130军队医务人员进入，不要想着去救人，是去收集病毒和撑过来的人的抗体标本的。CCP作恶都打着为人民服务的名义。\n\n00:51:29 bo博士: 130人杯水车薪，武汉感染人超过10万。现在需要调集大量人员，至少1300人。\n\n00:52:29 路德: 在老鼠身上搜集的都很珍贵。从老百姓身上搜集抗体，肯定不是看病的。\n\n00:53:42 bo博士: 1，播种后收割。说白了，就是生物武器，没什么神秘的。2，从已经在传播的病人身体上采集，就是稳定的人传人病毒。3，谈疫苗的免疫机理，感冒疫苗用鸡蛋做培养基，已治愈者身上的抗体血清是直接的解药。\n\n00:57:07 路德: 1，E蛋白，S-蛋白，到底剪掉哪一个，实验室研究很难。这次军队进入收割活人实验结果，收割宝藏。2，为何春晚歌舞升平，他们在庆祝，喜获生物武器。\n\n00:58:47 老江: 1，今年好在哪里？与内地医院联系，医生可自主拒绝收诊，中央统一治疗策略，没有特效药。如果赶回家，就自生自灭。2，传出可以免费治疗，如果没有冠状病毒，去医院可能感染，如果有了的，去医院也可能拒诊。\n\n01:00:50 路德: 很多人感谢爆料革命，很多人屯粮了，储备物资。爆料革命保命保财。\n\n01:01:24 老江: 1，跟家人建议屯粮，遭家人怼。提供真相，但没有能力给别人做决定。劝自己，保持大爱，要冷静。2，伪类利用瑕疵来攻击路德，每个人都有判断能力，有人愿意相信CCP，我们没有义务劝你。睿智者，会生存下来。3，精神病毒比冠状病毒更厉害，会害死更多人。\n\n01:06:58 路德: 1，保命保财，相信爆料革命。机关枪突突突鸡腿潘、朱万利、黄河便。2，粮食吃旧换新。至少9月份，天气热了，才安全。3，病毒繁殖越多，越适者生存。品种越来越多，温度杀灭都可能改变。三万对碱基，110万活人感染，病毒生存概率就很大。\n\n01:12:12 bo博士: 1，病毒学与概率学的密切联系。患者的基数越大，成为超级病毒的几率越高。2，若没有重病，比较年轻强壮，单纯乏力咳嗽等，推荐居家隔离治疗，医院比较关注确诊重症病人。3，若怀疑自己染病，睡觉都要戴口罩，避免传给家人。注意休息，加强营养、多饮水。4，有一定一直抑制作用：盐酸阿比朵尔每天三次，每次两片，配合莫西沙星。若身体素质不错，可能扛过去。若药物治疗无效，高烧不退，脏器开始衰退，一定要去医院就诊。保持乐观态度，并非不可治疗的绝症。",
				"added": 1579924998
			}
		]
	},
	"comment_vote": {
		"11_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"206_139DmfQr5fT7Xkcn71DpXBaXhA4X9u873q": 1,
		"47_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW": 1,
		"116_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"7_1ALwbRLVTnHkqz8mCtWrHV1AsZLFkRhJj2": 1,
		"1_18K5EwLPXRdyyZ7eSkxHkWLUt9Qmbr35Fx": 1,
		"242_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1
	}
}