{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"3_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": [
			{
				"comment_id": 1,
				"body": "Placing something terrible on a server or peer is as simple as including a data URI in a comment.  There is no way to upload an image to this forum but here is a red dot, courtesy of Wikipedia: \n\ndata:image/png;base64,iVBORw0KGgoAAA\nANSUhEUgAAAAUAAAAFCAYAAACNbyblAAAAHElEQVQI12P4\n//8/w38GIAXDIBKE0DHxgljNBAAO9TXL0Y4OHwAAAABJRU\n5ErkJggg==\n\nIt is easy to recognize and block data URIs, etc.   However, it is impossible to prevent this kind of attack.  Indeed, one could probably devise a method for encoding binary data as sequences of grammatically correct English sentences concerning a topic in the news!",
				"added": 1504033754
			}
		],
		"8_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": [
			{
				"comment_id": 2,
				"body": "A fantastic idea!  We need an open source implementation.  For ZeroNet, a plugin might be more efficient than shipping sites with a JS miner.  The site could provide mining pool details and then the plugin would mine XMR to the selected pool in the background.  From the user's perspective, perhaps there could be a confirmation asking for permission to mine in exchange for showing the site.",
				"added": 1505682300
			},
			{
				"comment_id": 3,
				"body": "Users can choose how many tabs to leave open.  Site maintainers can decide whether to require mining to view content.  (Sophisticated users may well be able to get around the requirement anyway.)  Furthermore, site maintainers can tune the parameters to find out what the market price (in hashes/s) of their content actually is.",
				"added": 1505752564
			}
		],
		"1532820348_1BBLpFiExm8RJzxZmmw7GYoP2jd8exQnGe": [
			{
				"comment_id": 4,
				"body": "For one thing, ZeroNet sites are replicated by (potentially) many peers in the network, while Tor Hidden Services are served by a single service provider.  This makes it difficult to take specific ZeroNet sites offline without blocking all of ZeroNet.",
				"added": 1532871687
			}
		],
		"1558666037_1BGbyM8MfxFyJ8xwDkApNMexZTGAkzKmBQ": [
			{
				"comment_id": 5,
				"body": "Have you played around with OpenBazaar?",
				"added": 1559706022
			}
		],
		"1561221618_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "[guix][1] (and specifically [bootstrappable builds][2]) seems like a step in the right direction.  The idea is to have a system in which a given binary can be built from source (including the compiler toolchain, etc.) modulo a few tiny and easy analyze binary seeds.\n\n[1]: https://www.gnu.org/software/guix/\n[2]: https://bootstrappable.org/projects/mes.html",
				"added": 1561254370
			}
		]
	},
	"comment_vote": {
		"9_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1
	}
}