{
	"next_comment_id": 14,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [erkan](#comment_1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Just bring your school buddies, teachers, principal, ... also to here ;-)\n\nI've already brought 2 of my class mates. Well actually me and one on my class mates started exploring this at the same time. :D",
			"post_id": 4,
			"date_added": 1459001390
		},
		{
			"comment_id": 2,
			"body": "> [erkan](#comment_3_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): hey, that's nice. What did you like best, and what was the worst experience so far?\n\nMostly many haven't just been intersted and some doesn't want to go thround the strougle to install all the components to make zeronet work. Most people in our class are gamers and not too much tech savy although we are IT class :)",
			"post_id": 4,
			"date_added": 1459600207
		},
		{
			"comment_id": 3,
			"body": "> [rainlime](#comment_2_1EFRUQjydLVFKNFBiF2LW5rpQeqEr8EA6M): NeroNet Source code  -> ZeroNet Source code ?\n\nOh my bad. I'll fix it :)",
			"post_id": 4,
			"date_added": 1476909960
		},
		{
			"comment_id": 4,
			"body": "> [sleepingduck](#comment_1_157enBmf7jTetbrx8uzEKKJb6j857APGN8): <script>alert('hello');</script>\n\nI guess that didn't work.",
			"post_id": 11,
			"date_added": 1477545528
		},
		{
			"comment_id": 5,
			"body": "> [liteningstrikes1](#comment_1_1DDkP7BAr5BmvW4FgdnDFMHgjfzxvP1pEb): Banks will likely be the ones to issue them.\n\nYeah that may be true. :DD",
			"post_id": 14,
			"date_added": 1489043570
		},
		{
			"comment_id": 6,
			"body": "> [twentyfourzero](#comment_1_1DLHbq2nvwpgU4xT3ajhABAW1Lfn3zTZhe): I only ever go with the rock bottom bundles but they never even deliver on those speed. I found that setting the router's DNS to default helped a bit but the quality of video will still sometimes bad. I think it's more a problem about internet infrastructure being shoddy.\n\nWhen I reset the modem is doesn't make it any better. My cable modem only works properly with the default settings. Even when I go change my DNS settings after few days I need to reset the modem again. Now I've been able to have a quite stable internet connection with the default settings for a moment excluding today when I had no internet connection.",
			"post_id": 16,
			"date_added": 1497352834
		},
		{
			"comment_id": 7,
			"body": "> [flappyearz](#comment_1_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): If i have a problem I tell them, and they say they'll look into it. Okay. Asking about it the next day. Then the next. Then every day if required. (But I live in a country where the provider tells in the ToS what service they provide and they have to pay back if they fail to do it. True that average users are ignorant enough not to know about it.)\n\nYeah I should start asking more when there's a problem on my connection to the internet until they fix their problem.",
			"post_id": 16,
			"date_added": 1497356924
		},
		{
			"comment_id": 8,
			"body": "> [flappyearz](#comment_5_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): it's full of bloatware shit, though. plenty of data leaking everywhere. and they reorganised the fucking android setup menu, beargh.\n\nYup. It's quite bad. Sometimes my phone freezes because Samsung's software fucks up. I'm looking for installing Lineage os in the future when the camera software on the rom is better.",
			"post_id": 10,
			"date_added": 1497357145
		},
		{
			"comment_id": 9,
			"body": "> [emilie](#comment_1_1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT): Hi! If you have a raspberry pi, you can execute a script that counts all the details of your internet connection. Someone wrote a script (I don't remember where it is) because he had problems with his ISP, same as yours!I hope you'll find a solution ;)\n\nThat's a good idea. I'll take a look in to that if I find the script. :)",
			"post_id": 16,
			"date_added": 1502791943
		},
		{
			"comment_id": 10,
			"body": "> [gluek](#comment_1_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): Yeah, but upgrade generic SSD (300-500 MB/sec) to macbook's SSD (1800-2000 MB/sec) also very noticeable.\n\nYup. And it feels like the SSD:s buffer is larger than the old one has.",
			"post_id": 19,
			"date_added": 1555176795
		},
		{
			"comment_id": 11,
			"body": "> [quantumworld](#comment_1_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I guess it is nice to give apple a good 300% prophet on there pc hardware with just two proprietary chips running a candy covered bsd system. If you did your homework you could have saved allot of money and gotten better hardware minus the genous apple support that always points to hardware upgrades. Usually the first year is fine with apple products after that they will just screw you to buy another new product.\n\nI've worked with even pricier computers in the past that has windows or linux but something has not worked properly or I had to trouble shoot something. This is what I don't want to do with my main computer. I could've put the money to build a computer my self but wanted to try what the apple tax feels like. ",
			"post_id": 19,
			"date_added": 1555177111
		},
		{
			"comment_id": 12,
			"body": "> [duende](#comment_1_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): You are a waste of space. Kill yourself.\n\nWow. You spent your time to write that. ",
			"post_id": 19,
			"date_added": 1556806287
		},
		{
			"comment_id": 13,
			"body": "I've also provided: Windows, Mac and Linux software separately:\nWindows: http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1MCsyW6W243LY69ZYm99XbV3M8Gbbrp5hF/fah-installer_7.5.1_x86.exe.zip\nMac: http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1MCsyW6W243LY69ZYm99XbV3M8Gbbrp5hF/fah-installer_7.5.1_x86_64.mpkg.zip\nLinux: http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1MCsyW6W243LY69ZYm99XbV3M8Gbbrp5hF/FoldinAtHomeLinux.zip",
			"post_id": 20,
			"date_added": 1584796561
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}