{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Great! THX for sharing. What's the post size limit of Red/Blue hub? and space limit?",
			"post_id": 25,
			"date_added": 1470991736
		},
		{
			"comment_id": 2,
			"body": "> [kaffie](#comment_19_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Red/Blue are capped at 50kb by default.\n\nthat would be quite small space, people would complain it.\njust like zerotalk or zeromail, people are encouraged to make clones, keeping the sites small. so nofish will make migrating hub easily in the future IMO. any way, your tutorial is a good way to make people understand how zeronet works. ",
			"post_id": 25,
			"date_added": 1470998417
		},
		{
			"comment_id": 3,
			"body": "> [weakish](#comment_1_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): I am thinking about rebuilding comments.\n\ncould you make a script? py is preferred.",
			"post_id": 25,
			"date_added": 1471242046
		},
		{
			"comment_id": 4,
			"body": "> [kaffie](#comment_21_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): AFAIK you can't sign other \n\nif in your hub you are the only one user, then migrating all the user's content is OK. Otherwise, if someone join in, comments to other users' posts may be under wrong post ID. So, it's better to migrate things only related to you.\nif you migrate to other hubs ( not yours), it's more complicated because you have to deal with other users' existing comments ID, even if the hub owner is kindly enough to help you to sign other users' files.",
			"post_id": 25,
			"date_added": 1471242797
		},
		{
			"comment_id": 5,
			"body": "girl, I conform there is still sth wrong with your ZeroMe profile in your hub.\nnot only in my new client, but also in latest proxy, all your new posts are rejected. pls check:\nhttps://bit.no.com:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/\nI did comment that ( probably u did not see it )  in the console it says Site:12h51u..WWtv Verify sign error: KeyError: 'cert_auth_type' in ContentManager.py line 722 > ContentManager.py line 589 . New client (Rev1425) under LInux MInt.\nBut I can see your new comments in other hubs.",
			"post_id": 29,
			"date_added": 1472397879
		},
		{
			"comment_id": 6,
			"body": "yep, video streaming will be the killer feature if ZeroNet has.",
			"post_id": 31,
			"date_added": 1481876229
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}