{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1MqR1sMUWigF66aVj1PBkW96AfzLjnXDhf": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1Hk3VC1SpvpXdhSYFPsQRowJC1mDnWESoX": [
			{
				"comment_id": 1,
				"body": "does anybody know the location? hahahahahahahhaa",
				"added": 1467393480
			},
			{
				"comment_id": 2,
				"body": "does anybody know the location? hahahahahahahhaa",
				"added": 1467393501
			}
		],
		"3_1FtUiy2KtVRiLTjs2QrvDJUSx2wMzeeavX": [
			{
				"comment_id": 3,
				"body": "what to bring with you\n\nvehicles:\n\nevery vehicle coming to the festival should have a fire extinguisher, a 5 gallon bucket of water, and a shovel. this is for fire safety and it's a very good idea. some other good items would be fix-a-flat, a spare tire, a jack, and jumper cables.\n\nfood and water\n\na good approach is to assume you'll be taking care of yourself regardless of other people's camps or kitchens. if you plan on eating food at other people's camps, it would be mighty nice if you would think of bringing a bunch of food to contribute - if everybody did this a little, we'd be pretty set. every person needs a gallon of water a day. it's also a good idea to bring re-fillable water containers (larger, smaller, etc), buckets (for dishes, etc) and your own dish and silverware.\n\nother things you might want to bring:\n\nclothing for hot, cold, wet, dry weather\ncostumes\nsun visor/hat\nsunscreen\nsunglasses\ntowel\n\nsleeping gear\nflashlight\ntent\nrain tarp\n\ntoilet paper, lyme & natural disinfectant\nshovel or pickaxe\nduct tape\nrope or twine\nbug spray\nfirst aid\nif you have bug or plant allergies, BRING YOUR OWN MEDS\n\nfm radios\nwalkie-talkies\ncondoms\nmusical instruments\nadapters & cords for musical/electronic equipment\nart supplies\nclothing/material to be stenciled\nstuff for bartering\nextra batteries\nknife or multi-tools\nbike pumps\n\nother supplies needed at the site:\nif you have room in your vehicles and access to resources, please help.\n\ncarpet\nthis is for people to sit on. you can usually find carpet in dumpsters pretty easily, just look up a carpet store in the phone book.\n\ntables, or table top surfaces(plywood)\nthe more tables or stable surfaces the better. bring em down!\n\nlights, (x-mas, rope, solar-powered lawn lights, lamps)\nif we got enough xmas lights & extension chords, we could light all the pathways of the festival. this would be especially great for the paths to the shitters!\n\nfurniture (couches, chairs)\ninflatable & foldup furniture is great. whatever you can fit in your vehicle. but remember, whatever you bring with you, be prepared to haul away. leave no trace.\n\npicks, shovels, hoes, rakes\nfor digging shitters, compost pits and sometimes firefighting.\n\nsmall plastic containers for food serving bowls\ncans for ash trays\nempty 5 gallon buckets\ngarbage bags\nshade structures\ntarps, parachutes\ntea tree oil\ngasket sealer\nhealthy, delicious food\nice, fruit, water",
				"added": 1467650946
			},
			{
				"comment_id": 4,
				"body": "frequently asked questions about the Autonomous Mutant Festival\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nwhen is it?\n\nin 2016, the 20th annual AMF will start monday, july 11th and continue through wednesday, july 20th. full moon is tuesday, july 19th. many people can only attend for a few days, but the main events/activities usually occur during the weekend.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nwhere is it?\n\nthe site will be a location in a beautiful area south of canda in Cascadia on the western edge of the North American continent.\nprevious festival locations have been in southern washington, oregon and california.\n\nthe selected location will be announced a few days prior to the start of the festival. the selection process occurs in late May and June.\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nwhere are the toilets? will there be porta potties?\n\nOne of the primary objectives of the AMF is to encourage individual and group autonomy, as well as more awareness of our impact on the world. at the core of this, is the issue of human beings and the shit that they produce. porta potties would be a major expense which would reduce the ability to have a free festival. they are also wasteful (they use lots of water and chemicals) and are unnecessary in an area that can withstand the impact of a week long festival, as long as people are practicing concious shitting skills. learning how to shit in the woods will teach you a lot about how we can have a much more positive relationship to the other living things around us. \n\nThe below excerpt is taken from the Mini Rainbow Handbook found on www.welcomehome.org: \n\nLatrines \n\nIf you gotta go, go to a latrine. Never take a dump on top of the ground and walk off and leave it. The first fly who sees it will go tell all the others in the nearest kitchen. \n\nDeep narrow trenches at least 3 feet deep are best. Keep the excavated soil in a neat pile for fill-in later. Cut out sod, and preserve it for replacement over the filled hole. \n\nLime - or ashes from a wood fire - is kept in a can nearby, and is sprinkled on top of your leavings, to reduce odor . Dirt is then shoveled back in on top gradually, to keep your waste covered completely. The pit is filled in all the way when the contents come up to within 18 inches of the surrounding ground level, and a new pit is dug nearby. \n\nHand washing facilities with chlorinated water are provided nearby. Large coffee cans or other rainproof covers are provided for toilet paper. Signs are placed on the trails nearest by, and colored tape marks the path to a latrine. \n\nImproper latrines are a potential link between us and a very sick camp. If you dig a shitter, cover it up in a fly-tight manner, using plywood, boards, or logs covered with soil - to fill the air (fly) holes between the cover and the earth. The covers are washed daily. \n\nLatrines are at least 100 feet from open water, and never uphill from a spring. \n\nDon't make the fly connection: \n\nshit —> flies —> food —> YOU\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nfood? water?\n\nbring enough supplies for yourself and everyone you come with. except for biodegradeable material placed in latrines, take everything out that you bring with you. \n\nsometimes groups of people come and provide free food and water, but there is no guarantee of this. (if you want to help with this, please use the mailing list and online message board to coordinate before you arrive.)\n----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nis it legal?\n\nthe AMF is a completely free, non-commercial festival... therefore we require no permit to gather on public land. There are certain regulations limiting groups to 200 people and 50 vehicles, but we consider the AMF to be a decentralized collection of independent camps... festival goers should be ultra- concious of speed limits and road signs entering and exiting the site, as local cops are sometimes anxious to write expensive tickets. Also keep in mind that the AMF, although a temporary liberated zone, is still subject to laws regarding illegal substances...\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\ncan i bring my sound system? can i dj? can my band play?\n\nthe AMF is an open invitation to all sound systems, dj's, musicians, and performers .... the more the merrier!!! there isn't any central organization of happenings within the AMF ... sound systems that want to set up in a choice spot should arrive as early as possible. dj's and bands should check the mutant message board to find contacts for sound systems that are open to collaborations.\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nwho are you?\n\npay no attention to the mutant behind the curtain....",
				"added": 1467651510
			}
		]
	},
	"comment_vote": {}
}