{
    "article": [
        {
            "title": "Biphasic and polyphasic sleep",
            "text": "'''Biphasic sleep''' (or '''diphasic''', '''bimodal''' or '''bifurcated sleep''') is the practice of [[sleep]]ing during two periods over 24 hours, while '''polyphasic sleep''' refers to sleeping multiple times – usually more than two.<ref>{{cite book |last1=Morin |first1=Charles M. |last2=Espie |first2=Colin A. |title=The Oxford Handbook of Sleep and Sleep Disorders |url=https://books.google.com/books?id=f6p2KGTXSNYC&pg=PA224 |year=2012 |publisher=Oxford University Press, USA |isbn=978-0-19-537620-3 |page=224}}</ref> Each of these is in contrast to '''monophasic sleep''', which is one period of sleep over 24 hours. '''''Segmented sleep''''' and '''''divided sleep''''' may refer to polyphasic or biphasic sleep, but may also refer to '''interrupted sleep''', where the sleep has one or several shorter periods of wakefulness. A common form of biphasic or polyphasic sleep includes a [[nap]], which is a short period of sleep, typically taken between the hours of 9&nbsp;am and 9&nbsp;pm as an adjunct to the usual nocturnal sleep period.\n\nThe term ''polyphasic sleep'' was first used in the early 20th century by psychologist J. S. Szymanski, who observed daily fluctuations in activity patterns (see [[Why We Nap: Evolution, Chronobiology, and Functions of Polyphasic and Ultrashort Sleep|Stampi 1992]]). It does not imply any particular sleep schedule. The [[circadian rhythm]] disorder known as [[irregular sleep-wake syndrome]] is an example of polyphasic sleep in humans. Polyphasic sleep is common in many animals, and is believed to be the ancestral sleep state for mammals, although [[simian]]s are monophasic.<ref>{{Cite journal |last1=Capellini |first1=I. |last2=Nunn |first2=C. L. |last3=McNamara |first3=P. |last4=Preston |first4=B. T. |last5=Barton |first5=R. A. |title=Energetic constraints, not predation, influence the evolution of sleep patterning in mammals |doi=10.1111/j.1365-2435.2008.01449.x |journal=Functional Ecology |volume=22 |issue=5 |pages=847–853 |date=1 October 2008 |pmid=20428321 |pmc=2860325}}</ref>\n\nThe term ''polyphasic sleep'' is also used by an online community that experiments with alternative sleeping schedules to achieve more time awake each day. However, researchers such as [[Piotr Woźniak (researcher)|Piotr Woźniak]] warn that such forms of [[sleep deprivation]] are not healthy.<ref>{{cite web |last1=Woźniak |first1=Piotr |authorlink1=Piotr Woźniak (researcher) |title=Polyphasic Sleep: 5 Years Later! |url=http://www.supermemo.com/articles/polyphasic2010.htm |website=SuperMemo |date=April 2010}}</ref> While many claim that polyphasic sleep was widely used by some [[polymaths]] and prominent people such as [[Leonardo da Vinci]], [[Napoleon]], and [[Nikola Tesla]], there are few reliable sources supporting that view.<ref>{{cite web |last1=Woźniak |first1=Piotr |authorlink1=Piotr Woźniak (researcher) |title=Polyphasic Sleep: Facts and Myths - Leonardo da Vinci |url=http://www.supermemo.com/articles/polyphasic.htm |website=SuperMemo |date=April 2010}}</ref>\n\n==Polyphasic sleep of normal total duration==\nAn example of polyphasic sleep is found in patients with [[irregular sleep-wake syndrome]], a [[circadian rhythm sleep disorder]] which usually is caused by neurological retardation, head injury or [[dementia]].<ref>{{cite journal |pmc=2768129 |title=Circadian Rhythm Sleep Disorder: Irregular Sleep Wake Rhythm Type |last=Zee |first=Phyllis C. |author2=Michael V. Vitiello |date=June 2009 |publisher=NIH Public Access |doi=10.1016/j.jsmc.2009.01.009 |pmid=20160950 |volume=4 |issue=2 |journal=Sleep Med Clin |pages=213–218}}</ref> Much more common examples are the sleep of human infants and of many animals. Elderly humans often have disturbed sleep, including polyphasic sleep.<ref>{{cite journal |last=Mori |first=A. |date=January 1990 |title=Sleep disturbance in the elderly |format=Abstract in English |journal=Nippon Ronen Igakkai Zasshi |location=Japan |volume=27 |issue=1 |pages=12–7 |doi=10.3143/geriatrics.27.12 |pmid=2191161}}<!-- |doi=10.3143/geriatrics.27.12 -- appears to be erroneous --></ref>\n\nIn their 2006 paper \"The Nature of Spontaneous Sleep Across Adulthood\",<ref>{{Cite journal |last1=Campbell |first1=Scott S. |last2=Murphy |first2=Patricia J. |doi=10.1111/j.1365-2869.2007.00567.x |title=The nature of spontaneous sleep across adulthood |journal=Journal of Sleep Research |volume=16 |issue=1 |pages=24–32 |date=March 2007 |pmid=17309760}}</ref> Campbell and Murphy studied sleep timing and quality in young, middle-aged, and older adults. They found that, in [[Free-running sleep|free-running]] conditions, the average duration of major nighttime sleep was significantly longer in young adults than in the other groups. The paper states further:\n{{quote|Whether such patterns are simply a response to the relatively static experimental conditions, or whether they more accurately reflect the natural organization of the human sleep/wake system, compared with that which is exhibited in daily life, is open to debate. However, the comparative literature strongly suggests that shorter, polyphasically-placed sleep is the rule, rather than the exception, across the entire animal kingdom (Campbell and Tobler, 1984; Tobler, 1989). There is little reason to believe that the human sleep/wake system would evolve in a fundamentally different manner. That people often do not exhibit such sleep organization in daily life merely suggests that humans have the capacity (often with the aid of stimulants such as caffeine or increased physical activity) to overcome the propensity for sleep when it is desirable, or is required, to do so.}}\n\n==In extreme situations==\nIn crises and other extreme conditions, people may not be able to achieve the recommended eight hours of sleep per day. Systematic napping may be considered necessary in such situations.\n\n[[Claudio Stampi]], as a result of his interest in long-distance solo boat racing, has studied the systematic timing of short naps as a means of ensuring optimal performance in situations where extreme sleep deprivation is inevitable, but he does not advocate ultrashort napping as a lifestyle.<ref>{{cite web |last=Wanjek |first=Christopher |date=18 December 2007 |title=Can You Cheat Sleep? Only in Your Dreams |work=LiveScience |url=http://www.livescience.com/7449-cheat-sleep-dreams.html}}</ref> ''[[Scientific American Frontiers]]'' ([[Public Broadcasting Service|PBS]]) has reported on Stampi's 49-day experiment where a young man napped for a total of three hours per day. It purportedly shows that all stages of sleep were included.<ref>{{cite web |url=https://www.pbs.org/saf/transcripts/transcript105.htm#5 |title=Catching catnaps (transcript) |accessdate=2008-02-19 |last=Alda |first=Alan (Show 105) |date=1991-02-27 |publisher=PBS |quote=[http://vvi.onstreammedia.com/cgi-bin/visearch?squery=+ClipID:5++VideoAsset:pbssaf105&query=sleep&user=pbs-saf video]}}</ref> Stampi has written about his research in his book ''[[Why We Nap: Evolution, Chronobiology, and Functions of Polyphasic and Ultrashort Sleep]]'' (1992).<ref>{{cite book|editor-last=Stampi|editor-first=Claudio |title=Why We Nap: Evolution, Chronobiology, and Functions of Polyphasic and Ultrashort Sleep |url=https://books.google.com/books?id=WI2-BwAAQBAJ&pg=PP1 |year=2013 |publisher=Springer Science & Business Media |isbn=978-1-4757-2210-9 |doi=10.1007/978-1-4757-2210-9}}{{page needed|date=July 2016}}</ref> In 1989 he published results of a field study in the journal ''Work & Stress'', concluding that \"polyphasic sleep strategies improve prolonged sustained performance\" under continuous work situations.<ref>{{cite web |title=Polyphasic sleep strategies improve prolonged sustained performance: A field study on 99 sailors |url=http://www.tandfonline.com/doi/abs/10.1080/02678378908256879 |doi=10.1080/02678378908256879 |last=Stampi |first=Claudio |date=January 1989 |volume=3 |issue=1 |publisher=Work & Stress: An International Journal of Work, Health & Organisations}}</ref>\n\n===U.S. military===\nThe [[United States armed forces|U.S. military]] has studied fatigue countermeasures. An Air Force report states:\n{{quote|Each individual nap should be long enough to provide at least 45 continuous minutes of sleep, although longer naps (2 hours) are better. In general, the shorter each individual nap is, the more frequent the naps should be (the objective remains to acquire a daily total of 8 hours of sleep).<ref>{{Cite journal |last=Caldwell |first=John A., PhD |date=February 2003 |title=An Overview of the Utility of Stimulants as a Fatigue Countermeasure for Aviators |publisher=United States Air Force Research Laboratory |location=Brooks AFB, Texas |format=PDF |page=15 |url=http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ada413128}}</ref>}}\n\n===Canadian Marine pilots===\nSimilarly, the Canadian Marine pilots in their trainer's handbook report that:\n{{quote|Under extreme circumstances where sleep cannot be achieved continuously, research on napping shows that 10- to 20-minute naps at regular intervals during the day can help relieve some of the sleep deprivation and thus maintain ... performance for several days. However, researchers caution that levels of performance achieved using ultrashort sleep (short naps) to temporarily replace normal sleep are always well below that achieved when fully rested.<ref>{{Cite journal |last=Rhodes |first=Wayne, PhD, CPE |last2=Gil |first2=Valérie, PhD |date=17 January 2007 |title=Fatigue Management Guide for Canadian Marine Pilots – A Trainer's Handbook (TP 13960E) |publisher=Transport Canada, Transportation Development Centre |url=http://www.tc.gc.ca/eng/innovation/tdc-publication-tp13960e-13960e-602.htm |at=Minimum Sleep Requirement |deadurl=yes |archiveurl=https://web.archive.org/web/20131228064318/http://www.tc.gc.ca/eng/innovation/tdc-publication-tp13960e-13960e-602.htm |archivedate=28 December 2013 |df=}}</ref>}}\n\n===NASA===\n[[NASA]], in cooperation with the [[National Space Biomedical Research Institute]], has funded research on napping. Despite NASA recommendations that [[astronaut]]s sleep eight hours a day when in space, they usually have trouble sleeping eight hours at a stretch, so the agency needs to know about the optimal length, timing and effect of naps. Professor [[David F. Dinges|David Dinges]] of the [[University of Pennsylvania School of Medicine]] led research in a laboratory setting on sleep schedules which combined various amounts of \"anchor sleep\", ranging from about four to eight hours in length, with no nap or daily naps of up to 2.5 hours. Longer naps were found to be better, with some cognitive functions benefiting more from napping than others. Vigilance and basic alertness benefited the least while [[working memory]] benefited greatly. Naps in the individual subjects' biological daytime worked well, but naps in their nighttime were followed by much greater [[sleep inertia]] lasting up to an hour.<ref>{{cite web |url=https://science.nasa.gov/science-news/science-at-nasa/2005/03jun_naps/ |title=NASA-supported sleep researchers are learning new and surprising things about naps |work=NASA Science: Science News |date=3 June 2005 |publisher=[[NASA]]}}</ref>\n\n===Italian Air Force===\nThe [[Italian Air Force]] (Aeronautica Militare Italiana) also conducted experiments for their pilots. In schedules involving night shifts and fragmentation of duty periods through the entire day, a sort of polyphasic sleeping schedule was studied. Subjects were to perform two hours of activity followed by four hours of rest (sleep allowed), this was repeated four times throughout the 24-hour day. Subjects adopted a schedule of sleeping only during the final three rest periods in linearly increasing duration.  The AMI published findings that \"total sleep time was substantially reduced as compared to the usual 7–8 hour monophasic nocturnal sleep\" while \"maintaining good levels of vigilance as shown by the virtual absence of [[Electroencephalography|EEG]] microsleeps.\" EEG [[microsleep]]s are measurable and usually unnoticeable bursts of sleep in the brain while a subject appears to be awake. Nocturnal sleepers who sleep poorly may be heavily bombarded with microsleeps during waking hours, limiting focus and attention.<ref>{{Cite journal |last1=Porcu |first1=S. |last2=Casagrande |first2=M. |last3=Ferrara |first3=M. |last4=Bellatreccia |first4=A. |title=Sleep and Alertness During Alternating Monophasic and Polyphasic Rest-Activity Cycles |doi=10.3109/00207459809000648 |journal=International Journal of Neuroscience |volume=95 |issue=1–2 |pages=43–50 |date=July 1998 |pmid=9845015}}</ref>\n\n==Biphasic sleep==\n{{Further information|Siesta}}\nAn example of a biphasic sleep pattern is the practice of [[siesta]], which is a [[nap]] taken in the early afternoon, often after the midday [[meal]]. Such a period of sleep is a common tradition in some countries, particularly those where the weather is warm. The siesta is historically common throughout the [[Mediterranean Basin|Mediterranean]] and [[Southern Europe]]. It is the traditional daytime sleep of [[Spain]] and, through Spanish influence, [[China]], the [[Philippines]], and many [[Hispanic America]]n countries. The Siesta in Latin American countries traditionally follows the after meal nooner.\n\n==Interrupted sleep==\n'''Interrupted sleep''' is a primarily biphasic sleep pattern where two periods of nighttime sleep are punctuated by a period of wakefulness. Along with a nap in the day, it has been argued that this is the natural pattern of human sleep in long winter nights.<ref name=\"pmid10607034\">{{cite journal |last=Wehr |first=T. A. |title=In short photoperiods, human sleep is biphasic |journal=Journal of Sleep Research |volume=1 |issue=2 |pages=103–107 |date=June 1992 |pmid=10607034 |doi=10.1111/j.1365-2869.1992.tb00019.x}}</ref><ref name=\"bbc2012\">{{cite news |first=Stephanie |last=Hegarty |title=The myth of the eight-hour sleep |work=[[BBC News]] |date=22 February 2012 |url=http://www.bbc.co.uk/news/magazine-16964783}}</ref> A case has been made that maintaining such a sleep pattern may be important in regulating stress.<ref name=\"bbc2012\" />\n\n===Historical norm ===\nHistorian [[A. Roger Ekirch]]<ref name=\"Ekirch2001\">{{Cite journal |last=Ekirch |first=A. Roger |year=2001 |title=Sleep We Have Lost: Pre-industrial Slumber in the British Isles |journal=American Historical Review |volume=106 |issue=2 |pages=343–386 |publisher=Oxford University Press on behalf of the American Historical Association |jstor=2651611 |doi=10.2307/2651611 |pmid=18680884 |url=http://ahr.oxfordjournals.org/content/106/2/343.full.pdf+html}}</ref><ref name=\"Ekirch2005\">{{cite book |last=Ekirch |first=A. Roger |title=At Day's Close: Night in Times Past |url=https://books.google.com/books?id=RaDL9YdbA4UC&pg=PP1 |year=2005 |publisher=W. W. Norton |isbn=978-0-393-34458-5}}{{page needed|date=July 2016}}</ref> has argued that before the [[Industrial Revolution]], interrupted sleep was dominant in [[Western culture|Western civilization]]. He draws evidence from documents from the ancient, medieval, and modern world.<ref name=\"bbc2012\" /> Other historians, such as Craig Koslofsky,<ref>{{Cite book |last1=Koslofsky |first1=C. M. |doi=10.1017/CBO9780511977695.001 |title=Evening's Empire: A History of the Night in Early Modern Europe |chapter=An early modern revolution |pages=1 |year=2011 |isbn=9780511977695 |pmid= |pmc=}}</ref> have endorsed Ekirch's analysis.\n\nAccording to Ekirch's argument, adults typically slept in two distinct phases, bridged by an intervening period of wakefulness of approximately one hour.<ref name=\"Ekirch2005\"/> This time was used to pray and reflect,<ref>Frances Quarles (London 1644), ''Enchirdion'' ch. 54</ref> and to interpret [[dream]]s, which were more vivid at that hour than upon waking in the morning. This was also a favorite time for scholars and poets to write uninterrupted, whereas still others visited neighbors, engaged in sexual activity, or committed petty crime.<ref name=\"Ekirch2005\"/>{{rp|311–323}}\n\nThe human [[circadian rhythm]] regulates the human sleep-wake cycle of wakefulness during the day and sleep at night. Ekirch suggests that it is due to the modern use of [[electric lighting]] that most modern humans do not practice interrupted sleep, which is a concern for some writers.<ref>{{cite AV media |first=Jessa |last=Gamble |authorlink=Jessa Gamble |year=2010 |title=Our natural sleep cycle |trans-title= |medium=video |url=http://www.ted.com/talks/jessa_gamble_how_to_sleep.html |accessdate=2014-04-27 |time= |location=TEDGlobal 2010, Oxford, England |publisher=TED Conferences, LLC |id= |isbn= |oclc= |quote=In today's world, balancing school, work, kids and more, most of us can only hope for the recommended eight hours of sleep. Examining the science behind our body's internal clock, Jessa Gamble reveals the surprising and substantial program of rest we should be observing. |ref=}}</ref> Superimposed on this basic rhythm is a secondary one of light sleep in the early afternoon.\n\nThe brain exhibits high levels of the [[pituitary]] [[hormone]] [[prolactin]] during the period of nighttime wakefulness, which may contribute to the feeling of peace that many people associate with it.<ref name=\"Randall2012\">{{cite book |first=David K. |last=Randall |title=Dreamland: Adventures in the Strange Science of Sleep |url=https://books.google.com/books?id=4vgQqcSY3hwC&pg=PT18 |date=2012 |publisher=W. W. Norton |isbn=978-0-393-08393-4 |pages=17–18 |chapter=2. Light My Fire}}</ref>\n\nThe modern assumption that consolidated sleep with no awakenings is the normal and correct way for human adults to sleep, may lead people to consult their doctors fearing they have maintenance [[insomnia]] or other [[sleep disorder]]s.<ref name=\"bbc2012\" /> If Ekirch's hypothesis is correct, their concerns might best be addressed by reassurance that their sleep conforms to historically natural sleep patterns.<ref>{{cite web |last=Brown |first=Walter A., MD |date=26 May 2006 |title=Acknowledging Preindustrial Patterns of Sleep May Revolutionize Approach to Sleep Dysfunction |work=Psychiatric Times |url=http://www.psychiatrictimes.com/sleep-disorders/acknowledging-preindustrial-patterns-sleep-may-revolutionize-approach-sleep-dysfunction |quote=The discoveries of Ekirch and Wehr raise the possibility that interrupted sleep is \"normal\" and, as such, these revelations hold significant implications for both understanding sleep and the treatment of insomnia.}}</ref>\n\nEkirch has found that the two periods of night sleep were called \"first sleep\" (occasionally \"dead sleep\") and \"second sleep\" (or \"morning sleep\") in medieval [[England]]. He found that first and second sleep were also the terms in the [[Romance languages]], as well as in the language of the [[Tiv people|Tiv]] of [[Nigeria]]. In French, the common term was ''premier sommeil'' or ''premier somme''; in Italian, ''primo sonno''; in Latin, ''primo somno'' or ''concubia nocte''.<ref name=\"Ekirch2005\"/>{{rp|301–302}} He found no common word in English for the period of wakefulness between, apart from paraphrases such as ''first waking'' or ''when one wakes from his first sleep'' and the generic ''watch'' in its old meaning of being awake. In [[old French]] an equivalent generic term is ''[[wikt:dorveille|dorveille]]'', a [[portmanteau]] of the French words ''dormir'' (to sleep) and ''veiller'' (to be awake).\n\nBecause members of modern industrialised societies, with later evening hours facilitated by electric lighting, mostly do not practice interrupted sleep, Ekirch suggests that they may have misinterpreted and mistranslated references to it in literature. Common modern interpretations of the term ''first sleep'' are \"beauty sleep\" and \"early slumber\". A reference to first sleep in the ''[[Odyssey]]'' was translated as \"first sleep\" in the seventeenth century, but, if Ekirch's hypothesis is correct, was universally mistranslated in the twentieth.<ref name=\"Ekirch2005\"/>{{rp|303}}\n\nIn his 1992 study \"In short photoperiods, human sleep is biphasic\", [[Thomas Wehr]] had eight healthy men confined to a room for fourteen hours of darkness daily for a month. At first the participants slept for about eleven hours, presumably making up for their [[sleep debt]]. After this the subjects began to sleep much as people in pre-industrial times had. They would sleep for about four hours, wake up for two to three hours, then go back to bed for another four hours. They also took about two hours to fall asleep.<ref name=\"pmid10607034\"/>\n\n==Scheduled napping to achieve more time awake==\n\n===Buckminster Fuller===\nIn order to gain more time awake in the day, [[Buckminster Fuller]] reportedly advocated a regimen consisting of 30-minute naps every six hours. The short article about Fuller's nap schedule in ''[[Time (magazine)|Time]]'' in 1943, which also refers to such a schedule as \"intermittent sleeping\", says that he maintained it for two years, and further notes \"he had to quit because his schedule conflicted with that of his business associates, who insisted on sleeping like other men.\"<ref>{{cite magazine |date=11 October 1943 |title=Science: Dymaxion Sleep |magazine=Time Magazine |url=http://content.time.com/time/magazine/article/0,9171,774680,00.html |archiveurl=https://web.archive.org/web/20131008220104/http://content.time.com/time/magazine/article/0%2C9171%2C774680%2C00.html |archivedate=2013-10-08 |deadurl=no |subscription=yes |df=}}</ref>\n\nHowever, it is not clear when Fuller practised any such sleep pattern and whether it was really as strictly periodic as claimed in that article; it has also been said that he ended this experiment because of his wife's objections.{{citation needed|date=August 2015}}\n\n===Criticism===\n[[Piotr Woźniak (researcher)|Piotr Woźniak]] considers the theory behind severe reduction of total sleep time by way of short naps unsound, arguing that there is no brain control mechanism that would make it possible to adapt to the \"multiple naps\" system. Woźniak says that the body will always tend to consolidate sleep into at least one solid block, and he expresses concern that the ways in which the polyphasic sleepers' attempt to limit total sleep time, restrict time spent in the various stages of the sleep cycle, and disrupt their circadian rhythms, will eventually cause them to suffer the same negative effects as those with other forms of [[sleep deprivation]] and [[circadian rhythm sleep disorder]].<ref name=\"supermemo\">{{Cite web |last=Wozniak |first=Piotr |date=January 2005 |title=Polyphasic Sleep: Facts and Myths |url=http://www.supermemo.com/articles/polyphasic.htm |work=Super Memory |accessdate=2008-01-01 |quote=This article compares polyphasic sleep to regular monophasic sleep, biphasic sleep, as well as to the concept of free-running sleep}}</ref> Woźniak further claims to have scanned the blogs of polyphasic sleepers and found that they have to choose an \"engaging activity\" again and again just to stay awake and that polyphasic sleep does not improve one's learning ability or creativity.{{citation needed|date=May 2017}}\n\n==See also==\n* [[REM rebound]]\n\n==References==\n{{Reflist|30em}}\n\n==Further reading==\n* Everett, Daniel L. (2008) ''Don't Sleep, there are Snakes'', [[Pantheon Books]] {{ISBN|978-0-375-42502-8}}\n* Koslofsky, Craig (2011) ''Evening's Empire: A History of the Night in Early Modern Europe''.\n* Verdon, Jean, ''Night in the Middle Ages'', trans. George Holoch (2002). {{ISBN|0-268-03656-X}}.\n* {{Cite book |chapter=The Watch |title=The Head Trip: Adventures on the Wheel of Consciousness |year=2007 |isbn=978-0-679-31408-0 |first=Jeff |last=Warren |publisher=Random House Canada |location=Toronto}}\n\n==External links==\n* [http://www.outsideonline.com/fitness/endurance-training/Miles-to-Go-Before-I-Sleep.html Miles to Go Before I Sleep] at Outside.com, April 2005.\n\n{{SleepSeries2}}\n\n{{DEFAULTSORT:Polyphasic Sleep}}\n[[Category:Sleep]]\n[[Category:Circadian rhythm]]",
            "slug": "biphasic-and-polyphasic-sleep",
            "date_updated": 1519574168915,
            "imported": "https://en.wikipedia.org/wiki/Biphasic_and_polyphasic_sleep"
        }
    ]
}