{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1619297900,
			"title": "Has the west become the culture of lies?",
			"body": ":)",
			"added": 1619297899
		},
		{
			"topic_id": 1619342119,
			"title": "If I could (legally, aka militarily) kill everyone at the BBC, I would, without any hesitation...",
			"body": "they are with the french propaganda among those I hate the most in the world, even more than the french, since their active participations in deeds of jimmy saville and following cover ups. \n\nthe personals of the bbc since this time, are among those I hate the most. Among those I see as the worst enemies of mankind on earth, and I sincerly wish to one day be able to wipe this threat of the map.\n\nI don't see that as brutal or crual, but just a question of well being. I know, now, that I should boycott them too...\n\nif only I could understand and read the chinese official language of the officials... what a waste of time, those occupiers of the western and specially anglo world are, how pathetic in their inability to understand and accept that their neo colonial post feodalist wannabe aristocratic world totalitarian project is doomed since the start.",
			"added": 1619342117
		}
	],
	"topic_vote": {},
	"next_comment_id": 59,
	"comment": {
		"1619276832_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": [
			{
				"comment_id": 1,
				"body": "can you eat hippos? I mean how does it tastes? tender meat? I guess it's bathed... I am seen some in the free state of columbia...",
				"added": 1619284940
			},
			{
				"comment_id": 6,
				"body": "> [bats](#comment_106_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): The software still works but it's unmaintained and in decline. The userbase you knew have jumped ship. There used to be many nazis here - they have been replaced with what appears to be chinese gibberish bots. Good luck.\n\nwhere have they jumped? tinder? facefuck or instalie? there is nothing much going on in uncensorable open source software...",
				"added": 1619293039
			},
			{
				"comment_id": 7,
				"body": "> [bats](#comment_106_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp):  chinese gibberish bots.\n\nchina > usa... good luck !",
				"added": 1619293114
			},
			{
				"comment_id": 8,
				"body": "and it's not bad ! just live with it, thrive, succeed explore, enjoy, live love and die ! you are a young nation... very very young...",
				"added": 1619293197
			},
			{
				"comment_id": 9,
				"body": "it's just the first american republic... I mean... and the past? the 13 colonies voided? the indian tribes and their exchanges with the world, memory holed? the crossing of the bearing straight, forgotten?",
				"added": 1619293251
			},
			{
				"comment_id": 10,
				"body": "that's the mark of a nation in it's infancy... at least in eretz when we dig, we know that we will find jews under those rocks... more than you believe...",
				"added": 1619293284
			},
			{
				"comment_id": 11,
				"body": "(they hide well). few get humor anyway... at least it makes me laugh",
				"added": 1619293323
			},
			{
				"comment_id": 12,
				"body": "weibo? wechat? nothing else going? maybe VK?",
				"added": 1619293375
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 2,
				"body": "ahhh I get it... so alex jones was corrupted by roger stone :) ahahahha... so weak. that explain congress gaetz support that was particularly shocking recently... loser.",
				"added": 1619284987
			},
			{
				"comment_id": 58,
				"body": "Remember the Water Marked Ballots by Dr. Steve Pieczenik? AJ = coward, subamerican. At least he doesn't grift...",
				"added": 1619433978
			}
		],
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 3,
				"body": "never forget, you are raised and born from myanmar ! don't let those foreigners interfer in your own domestic affairs. it's your land, only if you can defend it ! and often the best defense, is offensive covert warfare against targeted officials and their supporters in foreign land ! peace through strength and unity while not letting the corrupt and those they have brainwashed take over !!! stay strong ! and fighter harder !",
				"added": 1619285101
			},
			{
				"comment_id": 22,
				"body": "but like everyone... who wouldn't agree that peace, harmony propserity etc are better? the problem, and I hope they understand, 1 when attacked, defense by offense. 2 the foreigners seek to take control of myanmar 3 asean is a step toward Asian european union to then consolidate in to one world gov... (happilly there is china, so at worst it will be CWO).\n\nbut I say that I have no idea what is really going on the ground, I mean where stability has been restored and were the foreign activated and supported domestic enemies are...\n\ngl",
				"added": 1619333101
			},
			{
				"comment_id": 32,
				"body": "the assassination of an san suki will take total 2hours of air time on cnn... they will whine a little, stir anger, and move on... aka way way less that floyd death...",
				"added": 1619338729
			}
		],
		"1618903442_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 4,
				"body": "the usa is the only one of the failed western state to have caused it's own downfall, by trying to impose this UNO global world order, on itself and others. And maybe one of the few which has a chance to be able to revert to sanity, once this project is trashed... only if trashed, otherwise, it will be the end of the usa...\n\nregarding your current problem dear american cops... as you know, our issue is just plants of the creation, but I see your problem... as always there is a way to solve it... you may not like it... but it works...\n\nCOVERT COPS DEATH SQUADS against corrupted by sorros / bloomberg / pedotrump / pedorhinos / demoNcrats and others vermin AG... hehehehe... drive by... spray. ahhh poor state ag, dead. and it's cleared... or america will fall more that it is already...\n\nthere is no political solution to treason ! none...  look at yeltsin, yeah, the first president of the Russian Federation, he had to use TANKS to shell the SUPREME SOVIET to force him to leave... TANK SHELLS IN MOSKOW !!!! that's the kind of shit you deal with, and I mean the supreme soviet and his gang, where still yuge soviet patriots... we just had transitionned to a new system... culminating in the election of the TSAR !",
				"added": 1619285385
			},
			{
				"comment_id": 5,
				"body": "and you need something new about the \"blue line\"... brain storm ! by the way, and you know it, ending the drug war would solve most of your current problems... peace, harmony, prosperity etc could return, but this debate lead to the fall of the last chinese imperial dynasty... hehehhe... serious business... (I mean survival lvl)... this war on drug is unjust, unfair, unamerican... not why we came accross oceans... to be regulated like farm animals, don't eat that, eat that... what the fuck !",
				"added": 1619285625
			},
			{
				"comment_id": 45,
				"body": "so if I got it, to enter the spy game against SU, the usa hired the mi6 as teachers... maybe the teacher took over of the naive and gullible islanders and turn it, or at least helped, turn it in it's current state of decay?",
				"added": 1619343602
			},
			{
				"comment_id": 50,
				"body": "Ahhh ahahahahah... it's so comical... so it's american public workers who regime changed trump? not treated fair enough? not enuff? moar? ahahhahah... all is clear... ayayay... you are in trouble, I understand why the will to take the guns... ahahahah.... moar moar moar? helipads too? aahhahah...\n\nyou think it's this article that make me laugh?\n\nWhy Illinois Is In Trouble: 122,258 Public Employees Earned $100,000+ Costing Taxpayers $15.8 Billion\nhttps://www.zerohedge.com/markets/why-illinois-trouble-122258-public-employees-earned-100000-costing-taxpayers-158-billion\n\nno, it's when $ reserve status will be gone, where will all those $ come back? hehehehehehe... you tax cattles will have to hyper productive ! good luck, so you are really feodal rulers ! ahhahaha.\n\nonce upon a time there was a movement called the tea party... ohhh I understand that too why you HATE them...\n\nbut bad news for you muppets, financial / market supremacism doesn't give a shit about you...\n\nso zimbamerica? ameribabwe? gimm banana? moar? ahaha.\n\nthis one world order gov is really your way to try to feodalize the world to enslave the world in the same way you did the american people... good luck and have fun trying (and don't forget the body bags, you will need a lot).",
				"added": 1619376640
			},
			{
				"comment_id": 51,
				"body": "taxcattles, muhhh muhhh... stfu beast and pay... muhhh ahahhahaha,... and you raped their kids on top of that... bravo ! as bad or even worst than france... it's not a compliment, for both :D.",
				"added": 1619376711
			},
			{
				"comment_id": 52,
				"body": "and what's so nasty in this little game? is that right now you laugh, you rack 1/2 mil at the fbi... when you will retire the guy at your post, will have to rack at least 5 or maybe 50mil to have the same living standard as you... and you? I hope you will be smart :) (not in fact, I wish you hell, but the real, the one, where made for your kind, the one where forgotten for eternity you will be disspear).",
				"added": 1619376834
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 13,
				"body": "so let's completly ignore this co2 / plant food crap, and right now it's always nice to be able to play the front with the core, and the expands, all at the same time... and my point? the great rivers of russia? co2 who cares... long lasting driping pollution, bad. \n\nAnd it asks if it isn't maybe time to release the map of the archipeplagos of death, I mean the place secret or not, that I don't know, nor few do, where, SU had a profound mark... I mean how many nuke tests did SU do inside russia?",
				"added": 1619298356
			},
			{
				"comment_id": 14,
				"body": "that's one of the thing I don't understand the least, the test nuke of SU on russian soil... I mean not only once, not only at one spot, but the dispersion... why? who? still alive?",
				"added": 1619298486
			},
			{
				"comment_id": 15,
				"body": "I would call this chapter, the dark files of SU, where even just the first pages, can still now frightened even the hardest conquerors worldwide... the shoulders of giant, who went to places where life dies...",
				"added": 1619298570
			},
			{
				"comment_id": 16,
				"body": "What I think is that the worst pages of this files, aren't even ecological disasters, they are biological dead ends... who knows...but smile, we are still alive, because I am sure some cried over those pages, those who understood what failed, or maybe even not what failed, but the results...",
				"added": 1619298851
			},
			{
				"comment_id": 17,
				"body": "and a question, russia had nothing to do with the adenovirus / zika spread in brazil a few years ago ? I mean clandestine research went bad? I don't think so, but someone was... and me like a troglodites, I believed that those adenovirus were plant sourced... I don't know why I ... yeah... what can I do, in a culture of lies...",
				"added": 1619298987
			},
			{
				"comment_id": 18,
				"body": "> [anonysan](#comment_33_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): imagine thinking societies that rely on centralized state/oligarch control give a fuck about any of those things. The entire purpose of marxism or even the neo-feudal state capitalism of countries like China is to eliminate the needs of the individual and having a benevolent state take care of the collective's needs for them\n\nI find your opinion on China so wrong, that I don't even think it's worth answering. I hope you will be able one day to discover more about the vast diversities of the current people living in china and their civilization state :).\n\nback to the Topic, the Leaders of the Russian Federation : did you saw? the brits propaganda has started again to raise the conflict, accounting that the corpse of the king isn't even cold... shall the combat operations against london through eire start again? or maybe a more bio/chem/nuclear covert warfare against the city of london or a targeted killing of the children of the bbc? I support all those options, let's just like irish, leave the her majesty the kween outside of our warfare, but I hope that she understand that the cousin of the kween victoria is dead and that we have a new TSAR, and that it would be sad, that one she is powerless, but not tragic, or tries to appears but reveals herself to involved with those seeking chaos.\n\nI don't think those eaton/oxford/ruler of the city of london, understand the profound hate I have toward them and that not because of their beings (lucky them) but their goals and actions toward Russia.\n\nI believe they have to be HIT hard, at least once... the type of HIT so hard, that they can't ever recover from it.\n\nweakness is a sin, winning by unleashing extreme violence on the enemies only natural against beasts.\n\nthis constitutional monarchy is a failure, should return to absolute monarchy with rights for the peons, aka removing this administrative intermediary class hiding behing elected officials to foment and conspire against the world, and specially right now russia.\n\nand to the guy on the rt show, ashran ganny, they hate us, that's why, and we kill those who seek to conquer us first. it's not about morals, ethics, dignity, just destroy them and the fastest way is their children. who was this guy interviewed with glass, playing old cia? kill all his grand children, inflict pain and yuge cost against this class.\n\nthey will one day understand not only to respect russia but to fear it, by the blood and death of their own children.",
				"added": 1619332291
			},
			{
				"comment_id": 19,
				"body": "that's what's funny, I wish peace with the ukrainians and co, however, I am for total unleashing against england civilian (none royal) leaders... and by civilians I mean anything, cats, dogs, rats, all living.",
				"added": 1619332506
			},
			{
				"comment_id": 20,
				"body": "and what I think, is that a hit so clear on london, so massive, would maybe remind the world, to not ever mess with russia... sometimes, like in all places, killing one weaklet, brutally, violently, exterminately, may help remind many others to behave properly... you know sometimes, they get carried by their own narrative, the yorkshire, pumped believing to be able to fight and win against the german shepard...\n\nnow we have a trapped cornered yorkshire, facing a bear... let's reminds all dogs where they belong...",
				"added": 1619332704
			},
			{
				"comment_id": 21,
				"body": "I think they believe we bluff... that we are weak, that we won't dare... they shall never believe that we are weak, that's the dangerous part, specially if we were :)...",
				"added": 1619332792
			},
			{
				"comment_id": 23,
				"body": "Q: how tapped are the north sea co2 fields? I guess that the BP team is in alliance with kodorovski/browder and that they wrap the whole in revenge to the murder of the hereditary piece of shit that the bolshevicks wiped. \n\nI am surprised that kodorovski wife and children don't understand the opportunity and chance that was given to a man who had contributed maybe more than all in the plunder, rape and ruins post SU.\n\nI would like this man to understand that, at least to me, he has overstepped the boundaries of generousness\n\nand finally, I hope that the ukrainians understand that I had no problem wiping 100% of those controlled by an occupation gov armed forces, it was just that I was reluctant to annihilate the entire population of ukraine, aka sparing the civilians and others baboochkas... don't ever think it was weakness.\n\nback to this england... a price must be paid, they overtly support the return to the ruinous and devastating years preceeding the arrivals of the putins... :). they have to pay, hard and heavy.\n\nI think finally that they still haven't understood that their moment under the sun is gone, that most of the uk non globalized / tax looting / always bailed out is terrorised, in white flee and understand that it isn't the uk they knew... \n\nbtw if the paki of london could please give a map of high paki density of london, so that they are isolated from the conflicts, thanks you very much indeed in advance.\n\nshame on the uk, who rather than do a peaceful post eu future, decided to try to chart the world... it's not victoria's time anymore... and they seem to need a violent reminder.",
				"added": 1619336913
			},
			{
				"comment_id": 24,
				"body": "as always budget :\n\n1millions first strike\nall, next.\n\nyes, brit lives.",
				"added": 1619336938
			},
			{
				"comment_id": 25,
				"body": "and another question: why is so often russians forces having to counter srike to win? wouldn't it be fun once, to try the preemptive warfare framework? I firmly believe that english deserve it.",
				"added": 1619337268
			},
			{
				"comment_id": 26,
				"body": "in short I prefer to be seen as the bad boy, standing, as the ruined and ashed defeated other side. the more time will pass, will anyway remain 2 options : win or loss. the rest will be so reduced... so this another victory, when?",
				"added": 1619337416
			},
			{
				"comment_id": 27,
				"body": "my guess is that the north sea, isn't really tapped out, even if due to it's planetary position relative to the equators, it's small, but just that it is becoming less profitable, specially compared to russian fields... as such the brits have launched what they do best, conspiring, however, this time, I sincerly believe, that from a russian perspective, the time has come to kill this yorkshire, once and for good.",
				"added": 1619337584
			},
			{
				"comment_id": 28,
				"body": "russia ain't france.",
				"added": 1619337592
			},
			{
				"comment_id": 29,
				"body": "or at least hurt it so badly that at least for 1 century they will stop all hostilities against russia.",
				"added": 1619337670
			},
			{
				"comment_id": 30,
				"body": "or they down size the mi6 / foreign office / city of london ambition, now, or the hits have to keep coming, until their is only ruins and ashes over all of england... that's my opinion. I feed up with them. and I believe they understand nothing (see wall of adrian).",
				"added": 1619337747
			},
			{
				"comment_id": 31,
				"body": "I guess that the north sea fields have reached EROEI... (for noobs it cost equally in energy to what is extracted)? who knows... I am not in those :)",
				"added": 1619338023
			},
			{
				"comment_id": 34,
				"body": "\"Russia is attacked here and there for no reason.\" \n\nwrong\n\nthey want :\n\nthe energy fields / natural ressources of russian including sex slaves.\nthey want to depopulate the earth (500m) russia stand in the way.\nthey want to erase the idea of christianities, including the orthodox one, russia stand in the way.\nthey want to abolish independent and sovereign state, russia stand in the way.\nthey want worldwide hopelessness to create the psychological condition for submissivness, russia provides hope for the serfs.\nthey want to revert russia to end years of yeltsin.\n\nin short they hate everything russia stand for, everything.\n\nnot forgetting the white genocide population replacement of the west and the hope and dream that russia represent... add clean food...\n\nI mean, they have all their reasons. for them they are rational and logical. Russia stand in the way of their feodal, colonial, aristocratic, hereditary, population reductionist, child rapists ambitions.\n\nI couldn't be clearer, add the currently reasonnable tax rate and the military power of the russian armed forces and the intelligence of the russian security services.\n\nthey hate you, they hate us...\n\nand their hate is even bigger toward TSHYNAH !",
				"added": 1619339625
			},
			{
				"comment_id": 35,
				"body": "only they fear us... because they know.",
				"added": 1619339639
			},
			{
				"comment_id": 36,
				"body": "They know that we will, without any hesitation, following the most modern combat matrix the world has ever seen, do :  swift and harsh.\n\n“we really don’t want to burn any bridges. But if someone perceives our good intentions as indifference or weakness and intends to burn those bridges completely or even blow them up, he should know that Russia’s response will be asymmetric, \"\n\nwith what's below... remember this is nice and reasonnable toward civilians, aka the poor fucks from leads to manchester, but their ruling class, has the ambition below... \n\nthe problem is that the poor fucks are too dumb, uneducated, have no access to information and can as such only particiapte in the empire of soccer, such is the real desperation in the west.",
				"added": 1619339836
			},
			{
				"comment_id": 37,
				"body": "“the fundamental interests of our security will regret what has been done, as they have regretted nothing for a very long time.”\n\nthis time has come, to my opinion.",
				"added": 1619339908
			},
			{
				"comment_id": 38,
				"body": "\"But I hope that no one will think about crossing Russia’s so-called red lines. And where they run, we determine ourselves in each specific case.\"\n\nChina has achieved that, they believe russia is weak, reminding them terminally is necessary, not for them, they are useless worthless and gone, but the nuland front... to show them what is to come, aka 911 will be not even a bump. they better understand fast, I am not sure that those after putin will be so patient.",
				"added": 1619340036
			},
			{
				"comment_id": 39,
				"body": "\" humanitarian imperialists\" using so called humanitarian r2p to advance their colonial pedophiliac archaic systems.",
				"added": 1619340091
			},
			{
				"comment_id": 40,
				"body": "in the book of the jungle, the whole kingdom knows that when dragon moves, he may even be the \"pheonix-dragon\"... none will ever defeat the tao.",
				"added": 1619340222
			},
			{
				"comment_id": 56,
				"body": "Am I wrong to believe that Mikhail Khodorkovsky is one of the most negative man in the young history of the Russian Federation?",
				"added": 1619414777
			}
		],
		"1619297900_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": [
			{
				"comment_id": 33,
				"body": "> [houtje](#comment_68_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): have you only now figured this out? kek\n\nyes. it is more shameful to not admit it, try to lie to myself? Is it pedogate immunities? the election theft? the constant bail outs of feodal aristocratic class? the hollowing out? the support for the nwo against the will of the people? I don't know... but yes, beyond coerced vaccination, this abyssal management of the flue (vit c, d, zinc, moderate sport, healthy nutrition, sleep, positive living etc), I have lost hope in the political class, and see them as grifters and cronies... whose children are on the line this time.\n\n\n> [oscarwilde](#comment_6_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG): Total war never stops.\n\nit always stops, you convert everything to the war machine, all ressources, from human to natural, then facing the same on the other side, both move, avoiding and waiting for the right moment and setup to pierce, at this stage, one dies, and it ends, with only a war machine standing, all having been converted to the war effort, and time to recycle the whole while renaturalizing earth or as far as the battlespace reached.\n\n> [bigbadbob](#comment_1262_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Hasn't it always been a culture of lies?  Along with every other culture?\n\nI don't know, having only experienced the western way.\n\n> [comesin3z](#comment_5_175vrhm51gDo1nwuJvMJMFGM39rcr5RDst): cringe post\n\ntrue\n\n> [weed420](#comment_2_17UB3tahbjdq9AJ4x42XCq1K8Bta2iy54h): In every culture can imagine a enemy in a great conspiration, what is the motivation for this question?\n\nwhen plants of the creation become illegal, already all concept of democracy died.",
				"added": 1619339029
			}
		],
		"1619342119_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": [
			{
				"comment_id": 41,
				"body": "nice protests yesteday in london btw, how is assange doing?",
				"added": 1619342156
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 42,
				"body": "just don't forget my total war against nuland and other kodorovski/browder zelinsky, or the pedos like weinstein, polanski or the epstein gang, has nothing to do with jews and the holly land:). I am just curious how interwinded some are in tel aviv with those projects?  it could for some to be cognitive dissonance, but my real belief is that those mentionned above are in reality puppets used by those behind them... it sad for them that I really do believe in a people who for 2000 years fought to get back to their promised land, and as such those temporal interferences won't distrub me in hoping to one day see the coast of israel and wander among the hills where once upon a time... Rome ruled :).",
				"added": 1619342371
			},
			{
				"comment_id": 43,
				"body": "there is one aspect of the battlefield performance that displease me... I hope it will be resolved if (or when) there is a next operation...\n\nit's the lane of gaza... if I understood well the goal was to create ways inside gaza using destruction. My problem is that it created blocks of concrete rather than fine dust.\n\nI hope it is resolved by now, seeing mossul, I think it's the case.\n\nregards.",
				"added": 1619343198
			},
			{
				"comment_id": 48,
				"body": "personally I think that gaza should be rattached to egypt... with of course a one time big fee to help egypt restructure this demographic trap... I think it would be better for everyone, with even included a development of the whole sinai area... \n\nconcerning the potential scenario of the regime change in progress, I wouldn't exclude it to be organized by a western pmc... maybe the one who regime changed pedotrump? in all events, in this possibilities, I wouldn't strike first the financiers of such an attack on israel, but rather wipe to the last, wife, children and personals of this pmc, so that all pmces worldwide, understand that a covert war against israel will be reciprocal and even worst in nature... the shoaland...",
				"added": 1619345765
			},
			{
				"comment_id": 49,
				"body": "I don't think I am mean, or ill intentionned, I just understand the cost and realities of defeat.",
				"added": 1619345846
			},
			{
				"comment_id": 53,
				"body": "question, inflation in the great shekel nation? addin a 0 everyday? noo... but yeah who knows... a loaf of bread... same quality... an olive... you have cows or maybe a sheep... there should be a sheep... you know the famous sheep to eat... I am curious of the great shekel pricing evolution...",
				"added": 1619377016
			},
			{
				"comment_id": 54,
				"body": "second question: do you have open borders type in eretz? hahahah.",
				"added": 1619377065
			},
			{
				"comment_id": 55,
				"body": "I mean your leftists they are in the full no meat, bike to the no borders area? I am curious? I mean... how do they cope to be excluded from the global citizenry movement? I have hard difficulty to believe that some who were forced drafted for the common defense purpose believe in biking to gaza to bring peace offering flowers for lunch? but you know... the spread of the disease is so fast and furious... that I almost bet that it reached even the great shekel nation...\n\nit must be crazy in the mind of those people... seeing a merkava... an abms... what do they think? gretha can't compute. I get it... but them, they dream of the no border / global shit show co2 while seeing the arrows war? hard cognitive dissonance... \n\nfrankly, culturally, I see them as canibals, in the sense of how foreign they are to me... \n\nanyway... I make me smile, that's all that counts :).",
				"added": 1619377294
			}
		],
		"1618547913_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 44,
				"body": "to boycott the uk public media ( AMITT operators), or not, that's the question...",
				"added": 1619343331
			}
		],
		"1618959746_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 46,
				"body": "> [houtje](#comment_67_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): Johnny Mnemonic [...]\n\nI know... you liked it? It makes such a long time I watched it... then I would advise a game of syndicate wars\n https://en.wikipedia.org/wiki/Syndicate_Wars\n\n\"Syndicate Wars follows on from to the events in Syndicate, taking place 95 years later (in the year 2191). At the game's opening, the player-controlled syndicate (called EuroCorp) is at the peak of its power (achieved during the previous game), a megacorporation controlling the world through a combination of military and economic power, and technological mind control, using the CHIP implant technology they developed.[3] Corporate decisions are facilitated through a number of AI entities connected through a global communications network.\n\nAs the game opens, this totalitarian status quo is threatened by the emergence of a virus named \"Harbinger\" in the global communications system, damaging mind-control CHIP implants and leaving citizens vulnerable to co-option. Some of the newly liberated persons, dubbed \"unguided citizens\", choose to engage in an armed insurrection. The Unguided appear in early missions as random antagonistic elements, but over time form a well-organized militia.[4][5]\n\nViral damage to the global network causes disruption to Syndicate coordinations, with individual stations isolating themselves to avoid receiving rogue communication. The London station, as the headquarters of the EuroCorp syndicate, attempts to regain authority via direct intervention by the game's signature quartets of heavily armed agents.\n\nThe virus was released by the Church of the New Epoch, a religious group led by a group called \"The Nine\" and following a religious text known as \"The Book of Cataclysm\". The Church are seeking to undermine the world rule by corporations in favor of subjecting its parishioners to its own variety of mind control. \"Harbinger\" was their first step in demolishing the existing world order. The Nine began as the Otherworld Research Group (ORG), a group of top scientists who were researching alien technology found at an archeological dig site near Reykjavik. The ORG went into hiding to continue their research on \"The Codex\", an encrypted set of alien technological information, subsequently forming the Church.[6]\n\nThe bulk of the game concerns the development of armed conflict between EuroCorp and the Church. As insurrections take hold, the player is also obliged to conduct missions to control rogue elements within the syndicate itself, as various sub-corporations change allegiances or make bids for independence.\n\nThe game's story culminates in a battle for control of the moon (accessible via a transport system called the \"orbital elevator\"), with The Nine intending to convert ionosphere calibration equipment located there into a weapon (known as the \"ion gate\") and destroy all life on Earth; however, The Nine are eliminated, and the weapon deployment does not succeed.\n\nThe ironic parallels between the objectives of Church of the New Epoch and the original EuroCorp syndicate itself are abundantly clear throughout the game, further reinforced by the fact that the game can be played from the point of view of the Church itself to similar ends. It is revealed early in the game, when played on the Church's side, that the \"disciple\" in control of Church agents is a former EuroCorp agent who has been converted. \"",
				"added": 1619343944
			}
		],
		"1619252102_16dVbybDseQBQnxdJDuQhCzYAij8iR8YEc": [
			{
				"comment_id": 47,
				"body": "cow milk? otherwise thanks for the great post ! I will return :).",
				"added": 1619344116
			}
		],
		"1619250997_1JMgYVF1m2q5WmTzMt38fheBfogLL3Uwq8": [
			{
				"comment_id": 57,
				"body": "> [styromaniac](#comment_3072_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): So where do I get a grounding ring or something like that?\n\nyou need a cable to your ring...",
				"added": 1619433871
			}
		]
	},
	"comment_vote": {}
}