{
	"comment": {
		"1515988118_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": [
			{
				"body": "So brave! I just hope that with sites like this on 0net that we can somehow help these people realize they are being lied to!! Maybe one day they will all get a grip and revolt! The us military has already sworn an oth to help along with south korea if the people ever started a revolution to move in an provide military support... If you read this and know any korean people have them send this vidoe over the boarder!!",
				"date_added": 1565135392
			}
		],
		"1524905710_1DMbBh3c4jvrGNycqXj6X2vsDuoSkvynKe": [
			{
				"body": "Land of the free home of the brave. The right to persue happiness. The freedom of speach. The right to bare arms. Seperation of church and state. Are just some of the things the US government is activally trying to take aways from us. These are things they are doing in the open for all to see but no one is doing anything about it. To scare, so we hide and become keyboard warriors. There are some of use that spend ever single minute of our lives online. Soon and i really do think this, we will have a truly free internet where we can be whoever we want to be do whatever we want to do. I have been a self imprisioned person for the last 9 YEARS of my life. Simply because my sexual attractivness is not socially accepted. Imagin if you had to watch a movie where two people were in love and you knew they would NEVER be you. That you would NEVER know that feeling. That you have to lie to family and make them think one thing just cuz its impossible to tell them the truth. This is why i love the deep web and anyonyminit its because its the only way i can truly be free. All this persecution towards people like me and its not even our fault that a part of our brains stopped growing like everyone elses did. Either way im going to continue to do what i do on the deep web and if any law comes for me then i will take them as a direct threat to the rights i stated at the very begging and DEFENT MYSELF TO THE DEATH again not my fault i was born this way... i dont get to chose like a gay guy does...",
				"date_added": 1565393342
			},
			{
				"body": "to bad the video dont play all the way through... bummer thing of IPFS id guess",
				"date_added": 1565393566
			},
			{
				"body": "Wow im so glad i tried this video again to get it to play @28:12 just before she said that the encrypted internet options are life savers to many.. i have to agreee... 😢 this is the only place i can go. I cant talk to ANYONE about what i am hiding simply becuase the world REFUSES to look at it for what it is... perfectly natural. Instead they discriminate, persecute, hate, and refuse to look at things from our point of view. 😭",
				"date_added": 1565396507
			}
		],
		"1547866508_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": [
			{
				"body": "people really need to let thier zeronet run in the background ... it takes up next to nothing of bandwidth",
				"date_added": 1565393948
			}
		]
	}
}