{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Предупреждение \"Time out of sync\"",
			"body": "Привет зеронетовцам =)\nОбновил клиента до последней версии, и при старте получил предупреждение в статусной строке ZeroHello: “Time out of sync: -3586 секунд” (подключаюсь из рабочей сети, — часы установлены на другое поясное время для нормальной работы спец. ПО).\nВопрос: насколько критична такая рассинхронизация для работы сети? TOR работает, и зайты грузятся, хоть и не всегда сразу. В предупреждении пишет, что другие пользователи могут не увидеть мои посты, а также могут возникнуть «другие проблемы». Кто-нибудь сталкивался? Какие могут быть проблемы?",
			"added": 1537531100
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "> [ztmscr](#comment_1_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): Он мне так понравился, что сижу тут почти целыми днями иногда)\nЗначит контент есть?) Я ещё пока только ознакамливаюсь, но первые впечатления приятные, особенно по сравнению с фринетом. Осталось понять, что я здесь делаю)",
				"added": 1536676675
			},
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_415_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n> Я, кстати, начинал, потом забросил, недавно снова начал понемногу описывать ресурсы ZN у себя на Wiki. Конечно, есть ZeroSites или 0list, но тут как бы отобраны места, где тусуюсь я :)\nЗа линк спасибо, буду осваиваться)\n*ЗЫ:* ЛОРу привет =)",
				"added": 1536739690
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 2,
				"body": "На работе Devuan в виртуалке для несовместимых с Windows задач. Дома на компе Mint и Devuan на нотнике.",
				"added": 1536739052
			}
		],
		"1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 4,
				"body": "Технически-то это возможно, только в чём смысл? Анонимно двигать игровых персонажей можно и в обычной сети)",
				"added": 1536848515
			},
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_419_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Так можно про всё сказать. И на форуме можно в обычной сети общаться, и блоги вести в ней же :)\nНе очень корректное сравнение. Для форумов и блогов децентрализация сети даёт как минимум два больших плюса: достаточную степень анонимности, и сохранность и доступность информации за счёт пиров.\nНо для ММО игр ни то, ни другое, важности не имеет, а что реально важно — высокая скорость обмена мелкими сигнальными пакетами, что в пиринговой сети довольно слабое место. \n\n> [dude](#comment_62_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): http://127.0.0.1:43110/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg/http://127.0.0.1:43110/1D6f2CvDRhPeEeBAcmqGt3X9z2CkLpmv2V/\nЗашёл по первой ссылке, залогинилось, но никуда не пустило из-за нехватки пиров… Потом пустило, но не с кем играть =)\nПо второй ссылке ничего не понял — точки отрисовываются только после обновления страницы.\nЭто у меня одного такая беда с сетью?..",
				"added": 1536905675
			},
			{
				"comment_id": 6,
				"body": "> [mistalero](#comment_4_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Сохранность информации ещё как имеет. Плюс перечисленное в предыдущем посте. Так же уверенность в том, что игру не смогут закрыть.\nНе спорю, но это не приоритет перед обеспечением самого процесса игры. В случае ММО ты вряд ли захочешь продолжать игру, если в ней будут лаги )\nЯ вот тут, кстати, подумал про MUD — тут скорость обмена не так важна, задержка в 2--3 секунды на процесс не повлияет. И вот какая у меня идея – а если в децентрализованной сети сделать децентрализованную игру?.. Например: есть движок игры с её правилами, он подписан автором и раздаётся в неизменном виде. А всё остальное генерируется непосредственно на нодах игроков — у каждого игрока генерируется своя локация и свой рандомный набор игровых предметов. К примеру, я подключаюсь к игре, создаётся локация, которая цепляется к карте игрового мира, мне в файл карты приходит инфа, что к северу от меня локация такого-то игрока, к западу — такого-то, и т.д., но пока я к ним не зайду, файл с их локацией ко мне не грузится. Если неделю протупишь, то и мир вокруг тебя может измениться — когда-то к северу была деревня с орками, а тут раз, — и киберпанковский мегаполис…\nА есть в сети кто шарит в разработке игр?",
				"added": 1536937600
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_421_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Есть огромный класс походовых игр, от почти реалтаймовых, типа Civilization или UFO до сеансовых, типа VGA Planet (или шахмат по переписке :D). Вот это — непочатый край для программирования в ZN.\nКогда у меня был поинт в ФИДО, устраивали чемпионат по шахматам, публикуя ходы в эхе, и устраивая срачи на тему \"тут стояла моя ладья\"). А вообще, есть смысл, как сказал ТС, портировать что-нибудь браузерное… Например, кто помнит «Бойцовский клуб»?",
				"added": 1537184957
			}
		],
		"1_1JN4Ck6cLfg81fNjkhDJMkkmKGwk3Dpih4": [
			{
				"comment_id": 8,
				"body": "Во фринете. Там этого этого и другого дерьма навалом, только там сеть тухлая какая-то, может оно и к лучшему.",
				"added": 1537192988
			}
		],
		"1_1GewTebNkbfbLPvb4ZJKSmRbuEqcRqJJZ4": [
			{
				"comment_id": 9,
				"body": "Как я понял, -- можно, у меня сейчас TOR и NAT, и вроде раздаётся, пишет что 11 пиров. Ты в ZeroSites его публиковал?",
				"added": 1537354863
			}
		],
		"7_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 10,
				"body": "> [darktrader03](#comment_6_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): Но ведь в таком случае как проводить модерацию контента? Я имею ввиду мьютить пользователей.\n\nНу ты либо трусы надень, либо крестик сними =)\nСначала про полную анонимность, а теперь про модерацию контента. Как «золотая середина» — публиковать все посты под ID автора зайта, и пусть он трёт выборочно неугодные посты; но не уверен насколько это реализуемо в технологии зеронета.",
				"added": 1540895779
			}
		],
		"1_16xnUKegknnxfYJn3Lrj9pq62DHenkVDmQ": [
			{
				"comment_id": 11,
				"body": "Присоединюсь к вопросу. А если никто не знает, то давайте сделаем =)\nЕсть же ZeroMail, ZeroMe, ZeroUp… Почему мы бы не сделать ZeroTrack, — пиринговый трекер для пиринговой сети? Для начала, можно даже на клоне этого форума. А если попрёт, то добавить каталогизатор и что там ещё полагается. Я не спец пока в этих вопросах, но если кто возьмётся, с радостью готов помочь )",
				"added": 1542198138
			}
		]
	},
	"comment_vote": {
		"415_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"5_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"421_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1
	}
}