{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1546405790,
			"title": "Watch Full Episodes of Anime Right On ZeroNet",
			"body": "Do to Zeronet having pretty good large file support now we don't need to split up the files and load it programmically anymore. Astarotte No Omocha! has been uploaded as a test. Give it a try!\nhttp://127.0.0.1:43110/1Yc1VyAhxsh1LEw7xes9hFQMdfWLKuE6S/?Latest",
			"added": 1546405789
		},
		{
			"topic_id": 1550686723,
			"title": "Free .Bit Domains!",
			"body": "Loligod is feeling generous. Feel free to request a .bit domain name to be directed to one of your Zsites. \n\nPost your request in this format:\n\nI believe in the Loilgod. Please give me an address!\n[address ending in .bit]\n[zsite hash]\n[*optional* Namecoin address to send site to]",
			"added": 1550686721
		}
	],
	"topic_vote": {
		"1546405790_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1546405790_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 1,
				"body": "The videos are compressed (most are under 250mb for a full 1080p episode). If you have 5mbps internet with a good connection to the world it should load and buffer in real time for easy streaming. I've also hooked it up with one of my servers so it should be up for a good while to get seeders.",
				"added": 1546406470
			},
			{
				"comment_id": 2,
				"body": "[styromaniac](#comment_367_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):If you do have some time (though this would be NSFW) I've been wondering if the new configuration for the gallery has been pushing successfully. On your end would you be able to tell me how many galleries are shown? There is a count right under the galleries link.\n\nhttp://127.0.0.1:43110/1Dy2bs4GygFrBPxvZAvysuYQG7P8g3qSYj/\n",
				"added": 1546406696
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_368_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Please hyperlink like so:\n\nAh ok. It should auto hyperlink though. But [here you go](/1Dy2bs4GygFrBPxvZAvysuYQG7P8g3qSYj/)",
				"added": 1546407119
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_369_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's not changing the IP address of choice, so for 43110 users, it doesn't work without doing the relative linking.\n\nAh ops. Forgot I changed it.",
				"added": 1546407293
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_370_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I won't be clicking the gallery link, BTW. Wait for Nekololi, Pexo or Astringent to come along.\n\nHey that is no issue. I completely understand. Hope I don't end up on one of your blocklists. lol :D",
				"added": 1546408979
			},
			{
				"comment_id": 6,
				"body": "> [pexo](#comment_42_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): It shows 27 galleries. Are you getting some errors on your end?\n\nNo errors but it seems it isn't propagating correctly. There are 37 galleries that should show. This is what it should look like on your end: https://0net.io/1Dy2bs4GygFrBPxvZAvysuYQG7P8g3qSYj/\n\nSeems some peers are not updating to the latest edition for some apparent reason. I don't understand it.",
				"added": 1546449639
			}
		],
		"1547719179_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 7,
				"body": "[Here you go man](/big.kopykate.bit/?Video=1547740624_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp).",
				"added": 1547740719
			}
		],
		"1550438593_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 8,
				"body": "I say just backup the whole folder. It doesn't transfer the images over to the new hub so you will need to cut and paste them into the newly created sub folder. It's also good to have a backup anyway because different hubs have different maxsize policies.",
				"added": 1550529551
			},
			{
				"comment_id": 9,
				"body": "> [klu9](#comment_60_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @loligod: Thanks for the tips.Just to be clear re terms like \"the whole folder\": if my hub's ID is 1AbRRDveQD5EFtmXxBqQfS1guUWXxytMJZ and my public ID is 131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs , does that mean I back up:C:\\Users\\klu9\\ZeroNet-win-dist\\data\\1AbRRDveQD5EFtmXxBqQfS1guUWXxytMJZ\\data\\users\\131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs [...]\n\nYep that's pretty much it.",
				"added": 1550600861
			},
			{
				"comment_id": 10,
				"body": "> [klu9](#comment_61_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @loligod: Thanks.I think I've migrated. Can you see my latest post on ZeroMe?\n\nNope. I can not. That profile has no content on it.",
				"added": 1550682638
			}
		],
		"1550686723_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 11,
				"body": "> [lavaphox](#comment_3_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): ehanime\n\nDone. It will take a bit of time to confirm.",
				"added": 1550687075
			},
			{
				"comment_id": 12,
				"body": "12 blocks for it to be active (about 2 hours). You got a bit of time to get it all nice and ready for the world to see on [ehanime.bit](/ehanime.bit)",
				"added": 1550687531
			},
			{
				"comment_id": 13,
				"body": "> [lavaphox](#comment_4_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): oh thanks ^^, that motivates even more to spend time on my first zite\n\nAlso WTF I love your site.",
				"added": 1550687829
			},
			{
				"comment_id": 14,
				"body": "> [ssdifnskdjfnsdjk](#comment_685_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Note that .bit domains are risky, single p0int of failurei assume loligod will not renew the domains and after several months they will need a renewal or else it will mean dead links on zeronet.\n\nI'll renew them if I can but if you truly want it please get a NameCoin address and I'll transfer it over. :D",
				"added": 1550688848
			},
			{
				"comment_id": 15,
				"body": "> [7heaven](#comment_7_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): psywiki.bit [...]\n\nRegistered. Got to wait a bit of time for it to confirm though. :D",
				"added": 1550689000
			},
			{
				"comment_id": 16,
				"body": "> [nekololi](#comment_339_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): there are certainly caveats to .bit domains. i'm not sure how they work, but i assume .bit domain recipients can renew the domains for themselves somehow.\n\nNameCoin .bit addresses can only be renewed by the domain owner using the original domain registers NameCoin address within the expire period. After it expires however they can purchase it with their own NameCoin address and control the renewals. This is because the renewal is a transaction send which needs to be signed.",
				"added": 1550689261
			},
			{
				"comment_id": 17,
				"body": "> [lavaphox](#comment_5_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): yey, cause theres loli ? :) nekopara is super cute ^^\n\nNot only that but because it's exactly what I need. I have been just adding things into [loliup](/loliup.bit) but I always thought it was too chunky.",
				"added": 1550689321
			},
			{
				"comment_id": 18,
				"body": "> [toyata](#comment_36_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): 1E8Z8sk3cGeWdQumBaYEh6LraqC2BRnutV\n\nThat name isn't available to be take because someone else already owns it. https://namecha.in/name/d/ifs",
				"added": 1550696860
			},
			{
				"comment_id": 19,
				"body": "NameCoin is taking a very slow trip. It's been about 2 and a half hours but only about 10 blocks out of the 12 are done. It will be active soon.",
				"added": 1550697513
			},
			{
				"comment_id": 20,
				"body": "And they are registered. Just took... four hours. lol",
				"added": 1550703739
			},
			{
				"comment_id": 21,
				"body": "> [lavaphox](#comment_7_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): @loligod how ya like new design on http://127.0.0.1:43110/ehanime.bit\n\nIt looks ok but I can't seem to see the other ones you have uploaded and there is no side bar to see the anime in the list.",
				"added": 1550953069
			},
			{
				"comment_id": 22,
				"body": "> [lavaphox](#comment_7_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): @loligod how ya like new design on http://127.0.0.1:43110/ehanime.bit\n\nSpoke too soon. After I re downloaded the site I saw it better! :D Looking great!",
				"added": 1550954604
			}
		],
		"1552022585_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 23,
				"body": "> [nekololi](#comment_350_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i don't use ipfs myself, but here are a couple old sites (files and videos might not be seeded through ipfs anymore...):StarGate - IPFS Share and ViewLoligod's IPFS Video TestIPFS Videos by loligod\n\nAll my IPFS sites are no longer seeded. With zeronet's bigfile support it's now easier and faster to have it loaded within Zeronet itself instead of using ipfs. You can see big file examples at [loliup](/loliup.bit). It's just better not to require IPFS anymore.",
				"added": 1553187868
			}
		],
		"1560548981_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 24,
				"body": "> [styromaniac@kxoid.bit](#comment_79_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Honestly, that's what I call a cool story bro. Such a riveting tale, I honestly copy and pasted it to word, saved on my hard drive, backed it up on a jump drive, drove to the bank, put the jump drive in the safe deposit box, and will leave it there until my kids turn about 12 (when they can actually state their age, and ask what it is I'm showing them), when I will pick it up, put it in an old USB drive reader and relay this cool story to them and tell them, \"kids, this is what a cool story should look and sound like...not like the stories your generation tells.\n\nThe funny thing about styromaniac's response is I believe it's copy and pasted from a bottler text which could be kept in a way it describes. So in fact his response, by it's own description of keeping a riveting tale, would be fact be a riveting tale to keep. While yours, OP, is in fact SHIT. Big shit too. Like shit from an elephant.",
				"added": 1560555671
			}
		]
	},
	"comment_vote": {
		"369_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"42_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"43_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"79_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	}
}