{
	"title": "Bitcoin's Satoshi Nakamoto is a Time Traveler Archive",
	"description": "satoshinakamotoisatimetraveler.com",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1509613332,
	"post": [
		{
			"post_id": 12,
			"title": "Profitable Detours For Time Travelers: Why Did Satoshi Nakamoto Really Resurface in 2014?",
			"date_published": 1509611887.907,
			"body": "From: satoshinakamotoisatimetraveler.com\n\n<div>\n\"It might make sense just to get some [bitcoins] in case it catches on. If\nenough people think the same way, that becomes a self fulfilling\nprophecy. Once it gets bootstrapped, there are so many\napplications if you could effortlessly pay a few cents to a\nwebsite as easily as dropping coins in a vending machine.\"</div>\n\n<div>- Satoshi Nakamoto post on January 17, 2009</div>\n\n<div>\n\n<div>The post \"Rich List\" basically inferred that the bitcoin address with the most bitcoins near the beginning of bitcoin mining in 2009 might be a time traveler looking for profit. However, it is known that Satoshi Nakamoto used a lot of bitcoin addresses which spreads out his total holdings of bitcoin. According to businessinsider.com Satoshi Nakamoto's bitcoins were worth a total of around $700 million in June 2016 and Wikipedia puts the value at $4 billion in September 2017\\. Both these values are based on bitcoin developer Sergio Lerner's estimation that Satoshi Nakamoto owned a total of around 1 million bitcoins. The one bitcoin address that is unquestionably Satoshi Nakamoto canon is the genesis block address 1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa.</div>\n\n<div>\nBut is $700 million or $4 billion enough? Yes, bitcoin will probably be worth more as the years go by. Maybe $100 thousand per bitcoin. But before Satoshi Nakamoto used his time machine to return to the future he might have made at least one detour to the year 2014, if not a few other stops along the way.</div>\n\n<div>\nSatoshi Nakamoto made a post on his P2P Foundation account page in 2014 which states, \"I am not Dorian Nakamoto.\" Simple enough. This was in response to a Newsweek article which identified a California resident named Dorian Nakamoto as Satoshi Nakamoto. Somehow during a two-month supposed investigation it never once occurred to a reporter named Leah McGrath Goodman that maybe some other people on the reporter's same mental level looked for anybody named Nakamoto in an area near the first bitcoin transaction recipient (Hal Finney) and pestered Dorian Nakamoto with questions between 2009-2014\\. Maybe the Manzanar War Relocation Center wasn't a big enough clue for the Newsweek reporter that California has and historically has had its fair share of Japanese-Americans so statistically one should expect at least one Nakamoto in that area. I don't know what caused Newsweek to publish that article other than maybe every self-respecting high school newspaper rejected it.</div>\n\n<div>\nAnyway, I could be like that Leah McGrath Goodman reporter; look at the post and just end right here stating that Satoshi Nakamoto only resurfaced in 2014 to clear the air with five simple words.</div>\n\n<div>\nBut I won't. I think there was an alternative reason. A reason as simple as the words I am not Dorian Nakamoto. I can express the reason in one word: Clamcoin.</div>\n\n<div>\nLet's look at the timeline: On March 07, 2014 Satoshi Nakamoto posts on his P2P account after not doing so since February 11, 2009\\. On May 12, 2014 a snapshot was taken of the bitcoin blockchain and all addresses bearing a non-dust amount at the point in time of block 300377 were given 4.60545574 CLAMs for free. Back in 2009 on day one of the bitcoin blockchain there were 144 blocks with the majority of them presumably mined by Satoshi Nakamoto. Each block generating 50 BTC and Satoshi Nakamoto using numerous addresses; within at least two or three days after bitcoin mining's birth Satoshi Nakamoto had the equivalent of what would become at least a thousand CLAMs in 2014.</div>\n\n<div>\nBut what good are CLAMs to Satoshi Nakamoto? Only one thing: Convert those CLAMs into more bitcoins on an exchange. No, wait. That could be tracked. Well, if Satoshi Nakamoto made one more stop in 2015 Satoshi Nakamoto could anonymously exchange the clamcoin for bitcoin using shapeshift.io. Then Satoshi Nakamoto would vanish into time.\n</div>\n\n<div>\nSo why not stop in 2017 to post \"I am not Craig Steven Wright\" while collecting bitcoin cash to convert to bitcoin on shapeshift.io? Because Satoshi Nakamoto can get the bitcoin cash from his bitcoin addresses at any time. Maybe this infers that clamcoin doesn't exist in Satoshi Nakamoto's time. Maybe clamcoin was at its all time high price when it was introduced. Maybe it's because a Venn diagram would show that a lot of the people who believe Craig Wright are also card-carrying members of the Flat Earth Society so no post is necessary. Maybe it is as simple as looking around oneself to figure out why Satoshi Nakamoto isn't making a stop in 2017.\n</div>\n\n</div>"
		},
		{
			"post_id": 11,
			"title": "Satoshi Nakamoto's Escape From Planet Hawthorne",
			"date_published": 1509611077.645,
			"body": "<div>From: satoshinakamotoisatimetraveler.com</div>\n\n<div>\n\n<div>\"If you send by IP, the recipient sees you because you connect to their IP. You could use TOR to mask that.\"</div>\n\n<div>- Satoshi Nakamoto post February 06, 2010</div>\n\n<div>\n\n<div>2011 and 2014 are important times in the \"Satoshi Nakamoto is a time traveler\" hypothesis. The next post deals with the 2014 aspect. In 2011 Satoshi Nakamoto \"retired\" from the bitcoin project but \"returned\" for a short time in 2014 only to disappear again.</div>\n\nMy working idea currently on why Satoshi Nakamoto disappeared in 2011 deals with what is known as the \"Hawthorne effect\" in psychology. Basically, when individuals are aware they are being observed they modify their behavior.\n\nIf Satoshi Nakamoto is from the future then he would have known about Edward Snowden and NSA spying back in 2009 when he introduced bitcoin. Being from the future Satoshi Nakamoto would have had access to documents declassified in the late 21st century or simply watched documentaries to know how the NSA spied on the entire planet and what future technologies would have evaded the global dragnet.\n\n<div>\nHowever, time is not always on the side of a time traveler. By 2011 bitcoin was really beginning to become mainstream. Even with the benefit of having gathered information on how the NSA spies from future resources people on the internet would start to gather more and more clues to Satoshi Nakamoto's identity. As a libertarian Satoshi Nakamoto values his privacy and as a time traveler Satoshi Nakamoto knew too much about the future to risk being caught.\n</div>\n\n<div>\nThink of it this way. In 2017 it is perfectly legal in America to go to Wikipedia and read about Operation Menu. However, after that if you go back in time to watch the Apollo 11 moon landing you suddenly become a threat to national security simply talking about Operation Menu to the american citizens of 1969\\. Knowledge is power; anachronistic knowledge about things yet to be is Promethean.\n</div>\n\n</div>\n\n</div>"
		},
		{
			"post_id": 10,
			"title": "Rich List",
			"date_published": 1509609689.116,
			"body": "From: satoshinakamotoisatimetraveler.com\n\n“If time travel is possible, where are the tourists from the future?”\n― Stephen Hawking, A Brief History of Time\n\nIf a time traveler is getting rich off bitcoin then any computer synced up to the blockchain has evidence of time travel. The trick is knowing where to look on the blockchain for the \"smoking gun\".\n\nThe first natural place to look would be bitcoin's \"Rich List\". Since the blockchain is public it is possible to know how much each address has. A time traveler wanting to profit would go to the beginning (around 2009) and mine a bunch of bitcoins when it was relatively easy for solo miners. Once the time traveler was satisfied by the number of coins mined to the wallet's public address the time traveler could return to the future with the private key. The mined bitcoins would be safely preserved in the blockchain between past and future.\n\nThat's a nice thought but one rather large amount in one address would make it too obvious to primitives in the early 21st century like the nerd running satoshinakamotoisatimetraveler.com."
		},
		{
			"post_id": 5,
			"title": "Hello Future!",
			"date_published": 1509607414.096,
			"body": "> <div>From : satoshinakamotoisatimetraveler.com\n> </div>\n\n<div>“I've been working on a new electronic cash system that's fully peer-to-peer, with no trusted third party.”\n― Satoshi Nakamoto\n</div>\n\nAre you aware of the idea that has been tossed around the internet for several years now that maybe someone from the future came back in time and introduced bitcoin? Well, that idea now has an official site. Welcome to satoshinakamotoisatimetraveler.com!\n\nThis site keeps an open-minded view that it is possible someone used time travel to go back in time to \"invent\" the cryptocurrency we now know as \"bitcoin\".\n\nIf the idea is true then we of the early 21st century say \"thank you\" to the one known only as Satoshi Nakamoto; whoever, wherever and _whenever_ you are."
		},
		{
			"post_id": 4,
			"title": "Assumptions of the Satoshi Nakamoto Time Traveler Hypothesis",
			"date_published": 1508158420.162,
			"body": "> From: satoshinakamotoisatimetraveler.com\n\nFor the “Satoshi Nakamoto is a Time Traveler” hypothesis several assumptions are made. Future posts to satoshinakamotoisatimetraveler.com will help give details supporting why each assumption is made.\n\n1.  Satoshi Nakamoto is a time traveler.\n2.  Satoshi Nakamoto is a single individual and not several people working together.\n3.  The 2014 P2P Foundation posting on Satoshi Nakamoto's account was posted by Satoshi Nakamoto and was truthful that Dorian Satoshi is not Satoshi Nakamoto.\n4.  A time traveler Satoshi Nakamoto can return back to the future.\n5.  A time traveler Satoshi Nakamoto might have originated from a future point in an alternate timeline.\n6.  A time traveler Satoshi Nakamoto is from at least 100 years in the future.\n7.  If Satoshi Nakamoto is a non-time traveler then Satoshi Nakamoto is more likely than not of the male gender. If Satoshi Nakamoto is from the future the odds that Satoshi Nakamoto is female increases."
		},
		{
			"post_id": 3,
			"title": "What Does \"Satoshi Nakamoto is a Time Traveler\" Mean?",
			"date_published": 1508157718.436,
			"body": "> From: satoshinakamotoisatimetraveler.com\n\n\"Satoshi Nakamoto is a Time Traveler\" can be either or both of two ideas. Primarily, it is the literal hypothesis that the creator of bitcoin is a time traveler. Secondarily, it is a worldview. The idea that bitcoin and more generally the blockchain concept behind bitcoin is a technology that has slipped from the future into 2009\\. It is a narrative that helps describe how bitcoin came into being.\n\n**Q: Could anybody seriously 100% believe that bitcoin was created by a time traveler?**\n\n**A: Technically, yes.** There are some who believe a cypherpunk/computer scientist named Hal Finney created bitcoin; though Finney denied being bitcoin's inventor. Hal Finney died in 2014 and was cryopreserved. If Finney is ever unfrozen and brought back to life then that would count as having traveled to the future, albeit a one way trip.\n\nMore likely than not Finney was at best the first person to receive a bitcoin transaction from Satoshi Nakamoto."
		},
		{
			"post_id": 2,
			"title": "Who is Satoshi Nakamoto?",
			"date_published": 1508157177.557,
			"body": "> From: satoshinakamotoisatimetraveler.com\n\nSatoshi Nakamoto is a time traveler, of course.\n\nMore precisely Satoshi Nakamoto is the creator of the cryptocurrency known as bitcoin. Satoshi Nakamoto was an on-line member of select forums and mailing lists who interacted with others on the internet using the pseudonym Satoshi Nakamoto. With rare exceptions those are the only verifiable facts everyone can agree upon. It also goes without saying that Satoshi Nakamoto is a brilliant programmer. Unless of course Satoshi Nakamoto only brought the code for bitcoin from the future in which case the \"bootstrap paradox\" of time travel comes into play. However, the forum postings by Satoshi Nakamoto tends to indicate that bitcoin was Satoshi Nakamoto's brainchild.\n\nAnyway, satoshinakamotoisatimetraveler.com assumes Satoshi Nakamoto is a time traveler. This site deals more with the _when_ and _why_ of Satoshi Nakamoto. We'll let others chase the _who_ part like a cat trying to catch the dot from a laser pointer. The smart dog knows that given enough time sooner or later the dot and dog will intersect at the same point in space and time."
		}
	]
}