{
    "title": "Poster",
    "description": "A simple blog for zeronet",
    "next_post_id": 12,
    "modified": 1432515194,
    "post": [
        {
            "post_id": 1,
            "date_published": 1433033779604,
            "body": "Your first post."
        },
        {
            "post_id": 2,
            "date_published": 1530969783659,
            "body": "<h1 class=\"title\">Abtreibung ist kein Mord</h1><br><br>Mit 29 wurde ich schwanger. Ich war in einer stabilen Beziehung und es hätte grundsätzlich nichts gegen ein Kind gesprochen. <br><br>Ich wollte keines, ich fühlte mich nicht dazu in der Lage eines zu bekommen. Also entschied ich mich dagegen, hab einen Termin in der Frauenklinik gemacht und hatte einen Schwangerschaftsabbruch. <br><br>Ich habe diese Entscheidung nie bereut. Auch heute weiß ich, dass ich einfach keine Kinder will. Und selbst wenn ich irgendwann welche will, werde ich nicht bereuen, dass ich es damals nicht bekommen habe.<br><br>Was mich stört ist, dass man im 21. Jahrhundert immer noch nicht offen darüber reden kann. Ich habs immer wieder versucht, aber außer mit meiner Mutter und meiner besten Freundin, kann ich nicht darüber reden. <br><br>Man wird sofort verurteilt, erst versuchen die Leute noch einen für sie guten Grund bei mir zu finden, warum ich es nicht bekommen wollte, dass ich es einfach nicht wollte, reicht als Grund nicht und noch schlimmer wird es für die Leute wenn sie hören, dass ich nicht verhütet habe, weil ich erst noch dachte, ich würde eins wollen und mir das Gegenteil erst klar wurde, als es ernst wurde.<br><br>Beim Thema Abtreibung sind die Leute immer besonders moralisch obwohl ethisch gesehen nichts dagegen spricht. Die Welt ist überbevölkert, der Embryo hat noch keine Nervenbahnen durch die er Schmerz empfinden könnte und somit ist eine Abtreibung aus ethischer Sicht sogar humaner als die Freigabe zur Adoption.<br><br>Hätte ich zu spät gemerkt, dass ich schwanger bin und es austragen müssen, hätte ich es ggf. zur Adoption freigegeben, aber dann ist das bereits ein Mensch der fühlen kann und dann bin ich verantwortlich für alles zukünftige Leid dieses Menschen. <br><br>Wer sagt, dass das Kind in eine gute Familie kommt. <br><br>Über das Schicksal ungewollter Kinder spricht nie einer, nur über Moral und Mord, wenn es um Abtreibung geht. <br><br>Dabei wird niemanden weh getan.  Es wird ein Leben beendet, bevor es beginnt, bevor es ein Bewusstsein hat. <br><br>Ich finde daran ist nichts verwerflich."
        },
        {
            "post_id": 3,
            "date_published": 1531035578900,
            "body": "<h1 class=\"title\">Müssen wir wieder die BHs verbrennen</h1><br>Veröffentlicht am 5. Mai 2018<br>Mein Dank an dieser Stelle geht an die Facebook Userin Joey H. die mich zu diesem Beitrag inspiriert hat.<br><br>Ich habe durch Zufall (eine gesponserte Anzeige bei Facebook) diesen Artikel gelesen : https://www.woman.at/a/schuelerin-tragen-bh-brueste<br><br>Meine Erwartung beim Lesen der Kommentare war, dass jeder sofort einsieht wie lächerlich und diskriminierend die Forderung an die Schülerin war einen BH zu tragen.<br><br>Doch ich wurde negativ überrascht, tatsächlich entbrannte eine Diskussion über sittsame Kleidung und warum man die Nippel verstecken müsste.<br><br>Hallo?! Gehts noch?<br><br>Wann ist denn das passiert?<br><br>Ganz sicher lasse ich mir keine BHs vorschreiben. Und welche Auswirkungen der Vorfall auf ein Mädchen mitten in der Pubertät hat, darüber möchte ich gar nicht nachdenken.<br><br>Frauen haben es wirklich nicht leicht und heute wird es wieder schwieriger. Auf unserem Weg zur Gleichstellung werden unsere Geschlechtsmerkmale auch gleich weg gegendert.<br><br>Ich bin eine Frau und stolz auf meinen Körper. Und meine Nippel sind einfach nur Brustwarzen. Ich wurde damit geboren. Und sollte ich mal ein Kind bekommen (wird eh nicht passieren aber passt gerade), dann werde ich mein Kind damit ernähren. Das hat nichts mit Sex zu tun. Und um auch für die Männer eine Kerbe zu schlagen, das haben Penisse auch nicht. Sie dienen 99% der Zeit nur dem Ausscheiden von Urin und 1% der Zeit dem Sex. Es wäre meiner Meinung nach auch völlig okay wenn man als Mann Kleidung trägt durch die man die Konturen seines Penis sehen kann. Wenn er sich damit wohlfühlt warum sollte ich mich dann unwohl oder sexuell belästigt oder im Gegenteil sogar erregt fühlen. Aber bleiben wir trotzdem bei den Frauen und bei der Politik und bei den Rechten und den Ausländern. Das mag seltsam klingen aber die Brücke kann man schlagen.<br><br>Der Fall stammt aus den USA. Den USA mit einem rassistischen Präsidenten der alle Moslems loswerden will. Moslems denen man vorhält ihre Frauen gegen ihren Willen zu verhüllen und nicht zu respektieren. Und in dem selben Land von den selben Leuten werden Mädchen gezwungen einen BH zu tragen?! WTF!<br><br>Nein ich will das nicht. Und ich will nicht gezwungen werden. Nichts anderes ist es doch. Du trägst keinen BH zur Schule und wirst verwiesen. Du trägst keinen BH im Büro und verlierst deinen Job.<br><br>Und ich erinnere mich sogar noch wie unwohl ich mich fühlte als ich aus Versehen keinen BH in der Arbeit anhatte (hatte ihn bei meinem Freund vergessen kommt vor). Aber warum eigentlich. Keiner hats gemerkt und wenn dann hat es keinen interessiert.<br><br>Heute habe ich zwar noch 2 BHs im Schrank aber tragen werd ich sie wohl nie, denn nach wenigen Stunden hat man Schmerzen. Also trag ich nur noch Sporttops die sind bequem aber ja man sieht die Nippel am T-Shirt oder an der Bluse. Und was ist passiert? Nichts. Interessiert keinen, kein normaler Mann schaut da so genau hin. Männer sind nämlich nicht so triebgesteuert wie es gerne dargestellt wird. In der gemischten Sauna wurde ich auch noch nie angestarrt geschweige denn belästigt. Die Menschen die da hingehen haben eben den Weg zurück zur Natürlichkeit gefunden, etwas was uns die Gesellschaft gerne austreiben und mit übertriebenem Schamgefühl ersetzen will.<br><br>Und da frage ich mich schon. Wenn die rechte Seite der Bevölkerung so viel Angst vor den konservativen Moslems hat, dass man ein allgemeines Vermummungsverbot begrüßt, warum will sie uns dann ein Kleidungsstück aufzwingen? Unter meiner Jeans sieht man auch nicht ob ich einen Slip trage, aber wehe einer erfährt, dass man es nicht tut, dann ist man eine Schlampe obwohl es gar nichts zu sehen gab.<br><br>Wie wäre es mit mehr Freiheit? Es ist Sommer (naja eigentlich Frühling aber seht euch das Wetter an) und ich trage kurze Hosen und luftige Shirts. Und wenn euch das stört, dann schaut bitte einfach weg. Sonst melde ich vielleicht wirklich bald eine Demo an und wir treffen uns zum verbrennen der BHs. Ich bringe dann meine 2 mit."
        },
        {
            "post_id": 4,
            "date_published": 1531075744500,
            "body": "<h1 class=\"title\">Rechte Blickwinkel</h1><br><br>Ich hab mir heute den Film \"Er ist wieder da\" angesehen. <br>Erstmal sei gesagt, toller Film, haben viel gelacht und trotzdem hat er extrem zum Nachdenken angeregt. <br><br>Danach dann Nachrichten geschaut und von den Ausschreitungen in Ottakring nach dem Kroatienspiel gehört.<br><br>Es gibt offensichtlich viele Rechte, aber eigentlich (so scheint es medial) nur eine linke Strömung. <br><br>Der österreichische Rechte in Österreich ist meistens gegen alle Ausländer, egal ob frisch eingewandert, Migrant oder Flüchtling oder bereits 2. bis 3. Generation.<br><br>Wenn man was negatives hört, dann sollen die alle raus. <br><br>Nun haben wir in Österreich bzw. besonders in Wien verschiedene Migrantenviertel, die ihre eigenen rechten Gesinnungen mitbringen. <br><br>Da sind genauso Nazis dabei, nur das deren Nazis sich mit unseren Nazis nicht verstehen.  (Gut so, wäre schlimm wenn sich die auch noch zusammen tun).<br><br>Die rechten Migranten in Wien sind sogar nicht schlimmer als unsere eigenen, weil sie gegen ihre eigenen Leute sind. Gerade beim zersplitterten Jugoslawien gibt es so viele kleinere Gruppen, die sich gegenseitig bekämpfen, dass einem Angst und Bange werden kann.<br><br>Und diese Kämpfe werden eben auch bei uns ausgetragen. <br><br>Die aktuelle politische Entwicklung deutet darauf hin, dass es bei uns auch bald soweit sein wird, dass Österreicher von Österreichern verfolgt werden. <br><br>Bereits jetzt bedroht man sich gegenseitig im Internet. Rechts gegen eigentlich alles was nicht rechts und Österreicher ist, Links gegen rechte Österreicher aber für Zuwanderung obwohl da auch wieder rechtes Gedankengut importiert wird. <br><br>Eine Mitte finden sie nicht. Und die Politik? Die will keine Mitte finden. Die sichern ihre Wahlen mit dem Streit im Volk.<br><br>Können wir uns nicht alle mal statt auf In oder Ausländer, Muslim oder Christ, männlich oder weiblich auf gut und böse einigen.<br><br>Schlechte Menschen müssen weg, gute Menschen sollen kommen und bleiben. <br><br>Aber um das umzusetzen ist die Politik gefragt. Aber soweit wird es nicht kommen. Man macht lieber Polemik. Man verspricht der rechten Anhängerschaft alle auszusperren. Und beruhigt die Linken damit gleichzeitig, weil diese wissen, dass es nicht umsetzbar ist und es weiterhin Zuwanderer geben wird um die sie sich kümmern können.<br><br>Ich sitze dazwischen, habe Mitleid mit den unbeteiligten Opfern, den Kindern. Die entweder im Bürgerkriegsland oder in wirtschaftlich gebeutelten Ländern unter ärmsten Verhältnissen leben oder auf der Flucht sterben, die hat keiner gefragt. Sie wurden am falschen Fleck dieser Erde geboren und sind die Leidtragenden."
        },
        {
            "post_id": 5,
            "date_published": 1531330154500,
            "body": "<h1 class=\"title\">Schlechtes Argument</h1><br><br>Wenn man pro Abschiebung ist und als Beispiel für die kriminellen Asylanten einen harmlosen Grasdealer bringt.<br><br>Lol<br><a href=\"uploads/Twitter.png\" target=\"Twitter.png\"><img src=\"uploads/Twitter.png\"></a>"
        },
        {
            "post_id": 6,
            "date_published": 1531401089700,
            "body": "<h1 class=\"title\">Was ich im ZeroNet nicht sehen will</h1><br>Verschwörungstheoretiker die den Juden an allem die Schuld geben und nichtmal wissen warum.<br><br>Pädophile die ihre Lieblingsseiten teilen.<br><br>Das ist der Nachteil an dezentralem Internet. <br><br>Ethik fehlt manchmal einfach. "
        },
        {
            "post_id": 7,
            "date_published": 1531569268500,
            "body": "<h1 class=\"title\">Wieso können wir nicht einfach normal sein?</h1><br><br>Vielleicht bin ich einfach anders, als die meisten Menschen oder aber ich bin normal und die abnormalen schreien einfach lauter im Internet und Co. <br><br>Ich kann einfach nicht verstehen warum man immer wieder Menschen über einen Kamm scheren muss.<br><br>Warum kann man nicht einfach einsehen, dass nicht alle  Asylanten böse sind sondern Individuen, die man genauso einzeln betrachten muss wie die Menschen um uns herum. <br><br>Ich hab da vorhin auf Twitter ein Beispiel gesehen.<br><br>Rechts: \" wir müssen alle Juden und Ausländer töten.\" <br>Links: \" Nein\"<br><br>Journalist:\" okay nun kennen wir die Standpunkte, lasst uns einen Kompromiss finden.\"<br><br>Anstatt sich über die eigentliche Aussage dieses Beispiels Gedanken zu machen, beschweren sich die einen, dass die Rechten schlecht weg kommen, die anderen, dass die Linken immer als moralische Instanz da stehen und die 3. darüber dass es Journalisten schlecht darstellt. <br><br>Aber was steckt wirklich hinter diesem \"Gleichnis\"? Es geht doch in Wirklichkeit darum, dass hier keine Standpunkte dargelegt werden und daher auch kein Kompromiss gefunden werden kann, sondern darum, dass es an Gewissen Punkten einer Diskussion keinen Kompromiss mehr gibt, sondern nur noch ein richtig oder falsch. <br><br>Es wäre falsch alle Ausländer oder Juden zu töten. <br>Das Gleichnis ist eine Anspielung zur aktuellen Diskussion um die Seenotrettung von Flüchtlingen. <br><br>Es ist falsch Menschen bewusst ertrinken zu lassen. Es war auch falsch von diesen Menschen dieses Risiko einzugehen, trotzdem ist es ethisch nicht vertretbar keine Hilfe zu leisten. <br><br>Selbst wenn jemand am Dach steht und springen will, sind wir moralisch verpflichtet es zu verhindern. <br><br>Menschen aus den verschiedensten Teilen Afrikas sind bereit ihr Leben zu riskieren, weil ihr Leben in den eigenen Augen in der Heimat keinen Wert mehr hat, vielleicht sogar weil man in der Heimat nicht mehr überleben kann, sei es nun aus kriegerischen oder wirtschaftlichen Gründen. <br><br>Wirtschaftliche Gründe heißt nicht, man kommt für einen besseren Job nach Europa, man kommt weil man nicht verhungern will.<br><br>Aber der Europäer kann sich das nicht vorstellen, denn in Europa geht es uns selbst unter den denkbar schlechtesten Umständen noch gut genug um nicht zu verhungern.<br><br>Menschen sind auch in Europa obdachlos, aber es gib jede Menge karitative Einrichtungen, die sich um Obdachlose kümmern.<br><br>Dass man nicht jedem Menschen ein Bett und ein Dach über dem Kopf bieten kann, heißt noch nicht, dass man sich nicht kümmert.<br><br>Aber es gibt leider Länder, da verhungern Menschen tatsächlich und es sind keine Einzelfälle, es sind Massen, denen es so ergeht. Daher ist es absolut nachvollziehbar, dass man die Sicherheit eines Sozialstaates wie Deutschland oder Österreich ansteuert. Weil man weiß, dass man hier überleben kann.<br><br>Ich bin aufgewachsen in einer finanziellen Situation, die man als prekär ansehen kann. Aber ich musste nie hungern.  Die Miete wurde bezahlt und Essen kam vom Discounter genauso wie Kleidung. <br><br>Man sah uns die Armut daher zwar an, aber wir mussten nie darunter leiden. <br>Es war halt schwer aber nicht unmöglich. <br>Und selbst wenn alle Stricke gerissen wären, hätte es Quartiere für Familien gegeben, die obdachlos sind (meine Tante lebte mit ihren Kindern in einem solchen Quartier für eine Weile). <br><br>Die größte Angst meiner Mutter, war also in so ein Quartier ziehen zu müssen oder gar, dass ihre Kinder entzogen um vom Staat großgezogen werden. <br><br>Aber wir wären selbst dann versorgt gewesen. Es hätte uns nie so schlecht gehen können, wie den Menschen, die sich auf ein Schlauchboot setzen und hoffen, dass man sie aus dem Meer rettet obwohl schon zigtausende bei diesem Versuch umgekommen sind. <br><br>Und man sollte sich fragen, haben wir wirklich das Recht, denen die helfen wollen, die Rettung dieser Menschen zu verbieten, nur wenn wir lieber auf Paragraphen rumreiten und aus ein paar schwarzen Schafen eine Herde Wölfe herbeidichten. <br><br>Es gibt viele gute Menschen unter den Flüchtenden, die es nicht verdient haben, wegen ein paar Paragraphen zu ertrinken. <br><br>Bitte lasst sie nicht wegen der paar schwarzen Schafe kollektiv leiden. Sonst sind wir wirklich nicht besser als unsere Vorfahren, die zugesehen haben wie Millionen getötet wurden anstatt sich vereint gegen einen falschen Führer zu stellen. "
        },
        {
            "post_id": 8,
            "date_published": 1531654415118,
            "body": "<h1 class=\"title\">Was bin ich?</h1><br><br>Ich muss sagen ich habe nie bezweifelt eine Frau zu sein. Ich bin da biologisch eindeutig ausgestattet und auch meine DNA sagt weiblich.<br><br>Für mich wäre es damit eigentlich erledigt. Nun gibt es natürlich auch biologische Ausnahmen neben männlich und weiblich und das muss definitiv berücksichtigt werden. <br><br>Vor allem die chirugische Korrektur eines Geschlechts beim Kleinkind halte ich für schwierig. Man kann nicht wissen wie sich die Persönlichkeit des Kindes entwickelt und ob es sich mit dem gewählten Geschlecht identifizieren kann. <br><br>Auch aufgrund des Wachstums ist es oft mit einer Operation nicht getan.<br>Im Zweifel fände ich es also besser, das Kind Kind sein zu lassen und diese Entscheidung erst zu treffen, wenn der Körper ausgewachsen ist. <br><br>Nun gibt es aber auch jede Menge anderer Geschlechtsidentitäten, die vom biologischen Geschlecht unabhängig sind. <br>Das sind meiner Meinung nach Probleme, die die Gesellschaft selbst erschaffen hat.<br><br>Meine Persönlichkeit und mein Verhalten während meiner Kindheit und Jugend wurden gesellschaftlich immer dem männlichen Geschlecht nachgesagt.<br><br>Die Gesellschaft war der Meinung, ich würde mich nicht mädchen- oder fraugerecht verhalten. <br><br>Aber wer entscheidet das. Ich hab kein Problem mit meinen körperlichen Geschlechtsmerkmalen. Ich habe nur ein Problem mit Menschen, die mich entweder nicht ernst nehmen, weil ich eine Frau bin. <br><br>Oder mich aufgrund meines maskulinen (wer entscheidet was maskulin ist) Auftretens als Lesbe abstempeln (was nicht schlimm wäre, würde es stimmen). <br><br>Ich habe ein Problem damit, dass man nach wie vor Menschen in Rollenbilder steckt, die zu ihrem biologischen Geschlecht passen. <br><br>Ich bin auch eine Frau, wenn ich mich nicht schminke, lieber Hosen trage und lieber handwerklich arbeite. <br><br>Ich bin deshalb kein transgender oder ähnliches. Ich bin einfach ich, ein weibliches Individuum, dass in keine Schublade passt. <br><br>Würden wir das Schubladendenken punkto Geschlechter endlich mal aufgeben, dann würden viel weniger Menschen ihre geschlechtliche Identität suchen nur weil sie nicht in die Form passen, die die Gesellschaft für sie vorsieht. <br><br>Das ist wie mit den Zuordnung zu homosexuell, bisexuell oder heterosexuell. <br><br>Ich bezeichne mich dann immer gerne als pansexuell um die Leute zu irritieren. <br><br>Einfach weil ich meine Sexualpartner nicht nach dem Geschlecht oder dem Aussehen wähle sondern nach dem Gefühl.<br><br>Aber für aussenstehende werde ich wohl in die Schublade heterosexuell gesteckt, weil ich nur mit einem Mann bisher zusammen war und bin und vermutlich niemals in die Situation komme, soviele Partner gehabt zu haben, dass man keine besondere Vorliebe ausmachen kann. <br><br>Das ich meinen Mann liebe und treu bin, heißt aber nicht automatisch, dass mich nur Männer seines Typs interessieren. <br><br>Wir müssen aufhören für alles eine Kategorie festlegen zu wollen und einfach nur sein wer wir sind und lieben wen wir lieben."
        },
        {
            "post_id": 9,
            "date_published": 1531760429876,
            "body": "<h1 class=\"title\">Und plötzlich bist du da</h1><br><br>Ich habe zwar noch niemanden hier im ZeroNet kennengelernt, aber das wäre wohl auch nicht Sinn und Zweck eines anonymen dezentralen Netzwerks. <br><br>Aber ich habe eine neue Freiheit entdeckt. Die Freiheit über alles zu schreiben, was mich bewegt. Keine Angst vor den Reaktionen zu haben.<br><br>Ich bin ja schon froh, wenn ich mich mal selbstständig gemacht habe, dann muss ich mich auch außerhalb des ZeroNets nicht mehr fragen, ob ich etwas so schreiben soll oder nicht. <br><br>Bis dahin genieße ich meine neu entdeckte Freiheit."
        },
        {
            "post_id": 10,
            "date_published": 1531857633366,
            "body": "Per Definition ist man CIS Gender wenn man sich mit seinem biologischen Geschlecht identifiziert und transgender wenn man zum gegenteiligen Geschlecht tendiert. <br><br>Was ist man wenn man selbst kein Problem mit seinem Geschlecht hat, aber andere finden, dass man sich nicht verhält wie es sich für eine Frau gehört?<br><br>Oh Moment ich weiß es. Ich bin einfach nur ich und nicht dazu da irgendwelche Klischees zu bedienen."
        },
        {
            "post_id": 11,
            "date_published": 1531940000832,
            "body": "Mit jedem alten Social Media Account den ich lösche frage ich mich ob ich irgendwas verloren habe. Und kann die Frage immer mit nein beantworten.<br><br>Am Ende muss auch Facebook dran glauben, auch wenn sich alle konstant gegen Alternative Kommunikationsmittel wehren. <br><br>Schreib ich halt SMS :-)"
        }
    ]
}