{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1580029310,
			"title": "Jeden z najwiekszych przekretow..",
			"body": "Jest to przekret systemu gdzie jego poczatek ma miejsce od narodzin.. \nJest to nie moj opis ale za zgoda moge go tutaj umiescic\nPozdrawiam\n\nKiedy rodzi się maluch, ma obowiązek pod groźbą kary (ale to jest nieprawda) otrzymać akt urodzenia. Rodzic idzie do urzędu, podaje dane i zostaje stworzony ów akt.\nCo dalej? Otóż jednym z powodów jest stworzenie tzw. LEGAL PERSON, czyli korporacyjnej osoby o takim samym imieniu jak maluch, pisanej DUŻYMI LITERAMI. Owa osoba prawna/korporacja zostaje stworzona przez rodziców, bo maluch nie osiągnął jeszcze pełnoletności – to jest tzw. Contract Ability Age, bo dziecko nie może samo wchodzić w stosunki biznesowe do 18 roku życia (z tym jest różnie w innych AKT URODZENIA: to jest moment, kiedy zostaje stworzony pionek do gry, dosłownie, nic poza tym. Te wszystkie brednie, gdzie twierdzą, że oddajemy dzieci, samochody itd. dla rządu poprzez akt rejestracji to nieprawda.\nWg słowników prawnych (Black`s Law Dictionary) akt rejestracji nie transferuje tzw. equity czyli wartości.\nW momencie rejestracji dzieją się 2 rzeczy (w telegraficznym skrócie):\n⦁\tZostaje stworzony tzw. TRUST – tytuł własności do np. samochodu zostaje rozdzielony, pomiędzy właściciela wartości ( EQUITY TITLE) czyli tego, kto zapłacił za samochód (cała jego wartość należy do niego, nikogo innego) i drugi akt własności, który zostaje wysłany do urzędu.\n⦁\tZostaje stworzony tzw. permanentny rekord w księgach, w razie jakby jakiś inny człowiek zechciał Ci zabrać ten samochód, w sposób bezprawny – masz prosta drogę do odzyskania go poprzez system sądowy.\nJeśli chodzi o rzeczy materialne nie oddajemy niczego. Z dziećmi jest trochę inaczej.\nkrajach).\nTa osoba prawna/korporacja, jak każdy taki byt, ma swoje panuje tam, gdzie się urodziła, jaka jest ekonomia i tysiące innych wskaźnikówprognozy, zależne od tego gdzie ma siedzibę, jaki ustrój . Na podstawie tego wszystkiego zostaje stworzona prognoza, ile majątku owa korporacja wprowadzi do korporacji-matki (każdy rząd to zarejestrowana korporacja, a wszystkie łączą się w CORPORATION OF LONDON.\nTaka osoba prawna/korporacja zostaje oszacowana przykładowo na powiedzmy 15 milionow $. Trzeba wziąć jeszcze jeden aspekt pod uwagę przy szacowaniu zdolności tworzenia prywatnego kredytu na podstawie owej korporacji – ile jest majątku w firmie zwanej RZECZPOSPOLITA POLSKA, bo to również jest korporacja.\nZałóżmy, ze RP jest warta na dzisiaj 500 bilionów $ i jest w niej 50 milionów tzw. subsidiaries, czyli podległych korporacji (obywateli / personelu).\nNasz maluch jest właścicielem 1/50-milionowej części owego majątku – mówię poważnie!\nNa podstawie prognozy dochodu naszego malucha/osoby prawnej/korporacji i majątku korporacji-matki RP zostaje stworzony tzw. BOND o konkretnej wartości. Kiedy to się stanie ten bond  ląduje na Wall Street i zaczyna się zabawa w iluzję pieniądza, ale o tym później.\nHistoria aktu urodzenia sięga wielu lat wstecz. Zasady takie jak 7 lat zaginięcia na morzu, po czym cały majątek zostaje odebrany brzmią śmiesznie, ale są wciąż w użyciu. Kiedy ogłaszasz bankructwo w USA to się to nazywa Chapter 11 – twoja osoba prawna/korporacja zostaje tymczasowo „uśmiercona” na 7 lat. Nikt Ci nie da kredytu w tym okresie!\nAkt urodzenia to również bond ubezpieczeniowy, na gwarancie którego niemal wszystkie wypadki, rachunki szpitalne i komunalne, wszelakie szkody wyrządzone NIEUMYŚLNIE mają swoje zadośćuczynienie! Nie potrzebujemy żadnych ubezpieczeń na samochody itp., to wszystko jest szwindel!\nOSOBA PRAWNA/LEGAL PERSON stworzona przy akcie urodzenia to nie jest żaden szatański pomysł ani ukradziona dusza, ale każdy może to interpretować na własny sposób, zależnie od stanu świadomości i wiedzy.\nLEGAL PERSON to jest pionek do gry, a PROPERTY to własność osoby animującej ją. Żyjący (prawdziwy) Jasio Kowalski ma swojego JASIA KOWALSKIEGO, który jest jego własnością, tak jak jego rower, dom czy wrotki, nic więcej.\nProblem w tym, że nie mamy pojęcia jak tego używać, to jest jak nabity pistolet w rękach dziecka i dlatego nas dymają aż nam zęby trzeszczą.\nKiedyś w szkołach obowiązkowa była nauka logicznego myślenia czyli TRIVIUM, a teraz uczą jedynie wkuwać i klepać regułki, zamieniając ludzi w stado baranów.\nRozbierzmy temat na logikę:\nJAŚ KOWALSKI to własność Jasia Kowalskiego. Oto dlaczego:\n⦁\tOwa korporacja została stworzona poprzez podpis/energię rodziców Jasia Kowalskiego. Bez udziału jego rodziców, działających w JEGO IMIENIU, ta osoba prawna nie powstałaby wcale. Oto pierwszy dowód na logikę, że JAŚ KOWALSKI należy do Jasia.\n⦁\tOwa korporacja istnieje TYLKO tak długo jak długo żyje Jaś. W momencie jego zniknięcia JAŚ KOWALSKI przestaje istnieć z automatu. Akt zgonu oficjalnie rozwiązuje ten byt korporacyjny – czyli drugi dowód, że JAŚ należy do Jasia.\n⦁\tOwa korporacja nie jest w stanie zrobić nic sama, nie wstanie żeby iść do pracy, nie podpisze umowy o pracę, nie odda podatków i nie kupi domu. Do wszystkiego jest potrzebny żywy Jaś, a jego podpis jest na wagę złota. Bez niego korporacja to martwy twór, nic więcej – oto 3 dowód.\nJest ich wiele, ale te najbardziej oddają postać rzeczy.\nTo jest początek historii. Niestety, bez zrozumienia skąd się biorą pieniądze, nikt nie uwolni się od jarzma lichwy.\nDlaczego jest takie ważne żeby zrozumieć tę całą iluzję – bo na tej podstawie są stwarzane pieniądze. Pieniądze z powietrza, o czym już teraz niemal każdy wie, tylko nie wie jak to ugryźć.\nTego jest naprawdę ogrom, więc ograniczę się wyłącznie do istotnych elementów, bo myślę, że od tego zależy poziom finansów, a tym samym życia.\nPiotras",
			"added": 1580029309
		},
		{
			"topic_id": 1580152532,
			"title": "Jeden z najwiekszych przekretow.. czesc II",
			"body": "Przekręt wszechczasów część II\n\nDlaczego jest takie ważne, żeby zrozumieć tę całą iluzję – bo na tej podstawie są stwarzane pieniądze, pieniądze z powietrza, o czym już teraz niemal każdy wie, tylko nie wie jak to ugryźć.\nTego jest naprawdę ogrom, więc ograniczę się wyłącznie do istotnych elementów, bo myślę że od tego zależy poziom finansów, a tym samym życia.\nJak robiłem akt urodzenia mojej córci miałem śmieszną historię tu, w urzędzie. Podpisując akt, pod nazwiskiem – ja i moja dziewczyna – podaliśmy status naszej osoby jako tzw. GRANTOR, czyli ktoś kto bardzo wyraźnie określa swoją rolę w tym procesie. Grantor, ponieważ moja córcia urodziła się tu – w UK i jest właścicielem części majątku tejże ziemi i jak kiedyś będę działał z jej bondem – ten akt urodzenia nie zostawia NIC do interpretacji. To ja składam na ręce rządu majątek mojej córki.\nZauważ, że każdy adwokat bądź inny szubrawca systemowy zawsze określa swój status – LLP JAŚ KOWALSKI, Mecenas JAŚ KOWALSKI, Doktor JAŚ KOWALSKI itd. To nie tylko po to, żeby się pochwalić, wierz mi*).\nMijają lata, maluch Jaś rośnie i nie ma żadnych kłopotów, osiąga pełnoletność i od tej pory jest w stanie zarabiać na siebie, podpisywać umowy i… brać kredyty z banków – tu się robi ciekawie.\nJaś idzie do banku, bo potrzebuje gotówki na rozkręcenie biznesu, powiedzmy 100 tys. złotych. Bankier szybko sprawdza Jasia, czy nie wisi gdzieś kasy, i chętnie przynosi UMOWE o pożyczkę.\nJaś czyta (pomijam, że połowy nie rozumie z tzw. legalese) i chętnie podpisuje umowę, idzie do domu i czeka aż fundusze znajdą się na jego koncie.\nCo się dzieje dalej wewnątrz systemu:\nÓw bankier idzie do innego pokoju, jego zwierzchnik podpisuje ową umowę niczym czek – dosłownie. To nazywa się endorsement, i owa umowa magicznie zamienia się w czek.\nWg. BILLS OF EXCHANGE owa umowa to tzw. NEGOTIABLE INSTRUMENT, czyli nic innego jak PROMISSORY NOTE, czyli obietnica zapłaty – dokładnie ta sama forma pieniędzy, jakie nosimy w portfelu – dosłownie.\nOwa umowa zamieniła się w czek, czek zostaje wpłacony na tzw. DEMAND ACCOUNT, później zamienia się w  elektroniczne cyferki i Jasiu ma siano, JASIU ma dług – tylko na niby.\nCo się dzieje dalej.\nOwa umowa, podstemplowana, zamieniona na czek, a potem na cyferki idzie dalej, to nie koniec. Bank zbiera takie umowy w tzw. SPV ( Special Purpose Vehicle) i sprzedaje na Wall Street a potem dzieją się już inne rzeczy – nieważne dla Jasia.\nDlaczego to piszę? Bo tu jest właśnie wolność. Dosłownie.\nJaś za pomocą JASIA podpisał umowę, ta umowa należy do jej stwórcy – nikogo innego! Co więcej, Jaś otrzymał dostęp do tzw. PRYWATNEGO KREDYTU.\nBANK NIE DAŁ Jasiowi ani nawet JASIOWI – ŻADNYCH PIENIĘDZY!!!!!!\nPrawo bankowe zabrania pożyczania pieniędzy depozytorów, wszystkie pseudo pożyczki (może poza małymi i firmami tzw. EQUITY LENDER gdzie ludzie operują gotówką) są stwarzane na tej podstawie.\nZanim zacznę tłumaczyć, jak to wykorzystać i uwolnić się od jarzma lichwy – zrób sama, albo ktoś kogo znasz, taki mały eksperyment:\nJeżeli masz pożyczkę na samochód, dom, bądź kartę kredytową, bądź inną, większą „pożyczkę”, idź do banku i umów się na spotkanie. Powiedz, że chciałabyś zobaczyć swoją umowę o kredyt. Ta pierwsza, ta gdzie widnieje Twój własnoręczny podpis. Nie kopię, nie scan, fax i inne wydruki – ten kawałek papieru, który osobiście podpisałaś.\nJeżeli nawet Ci go pokażą, do rąk własnych, odwróć go i zobacz, czy nie jest podbity i zadatowany – zupełnie jak czek.\nZobaczysz cos bardzo ciekawego.",
			"added": 1580152530
		},
		{
			"topic_id": 1580292777,
			"title": "Jeden z najwiekszych przekretow..czesc III",
			"body": "Przekręt wszechczasów część III\n\nNie będę się zagłębiał za mocno, żeby nie narobić bałaganu dla kogoś, kto nigdy nie miał styczności z tym tematem. Proponuję kilka ćwiczeń umysłowych, dla zrozumienia większego obrazka.\nCzy nikomu nie wydaje się dziwne, że od 2008 roku niemal cały świat brnie w jakieś dziwne długi? Wszędzie są cięcia, oszczędności, ludzie tracą pracę, etaty znikają, wszystko idzie dosłownie w czarną dupę, a lichwa rośnie w siłę? Jest coraz więcej chętnych do udzielania „pożyczek”, banki i bankierzy z roku na rok stają się coraz bogatsi, nawet dziecko dzisiaj widzi że coś tu śmierdzi, i to wielkim bąkiem, że tak powiem. A tak na marginesie, nikt nie mówi o tym, komu ten cały świat wisi taką ilość pieniędzy i jakim cudem, prawda?\nCzy nikomu nie wydaje się dziwna chęć pożyczania pieniędzy przez instytucje finansowe w czasach, kiedy ludzie mają coraz mniej, kiedy oboje rodzice musza zasuwać, a w domu coraz mniej? Firmy pożyczkowe rosną jak grzyby po deszczu, jeszcze do niedawna można było otrzymać sporą „pożyczkę” dosłownie na gębę. Ludziom w USA rozdawano pożyczki na domy, wiedząc doskonale, że nie będą mieli szans ich spłacać. Dom za pól miliona ogrodnikowi zarabiającemu  minimalną place.\nNikomu nie wydaje się dziwny fakt, że przy tak ogromnym odsetku niespłaconych zadłużeń banki i lichwa rosną w zastraszającym tempie? Przecież jakby banki traciły te wszystkie miliony, a te wszystkie miliony były pożyczane z pieniędzy depozytorów – to nie tylko banki by splajtowały, ale również depozytorzy (nie poruszam systemu fractional reserve banking na razie).\nTe i masę innych pytań można zadawać ludziom na stołkach, tylko system jest bardzo sprytnie zbudowany. Na tzw. linii frontu siedzi cala masa głąbów, głąbów z dyplomami. Tzw. papugi – nie potrafią samodzielnie myśleć, i guzik wiedzą. Więc odbijasz się jak piłka od ściany przez pewien czas, i tylko najwytrwalsi dojdą tam, gdzie trzeba.\nWracamy do tematu tworzenia pieniędzy, bo tu jest nasza szansa żeby powalić tego giganta na glinianych nogach.\nJak już wcześniej pisałem, wasza umowa o „pożyczkę” jest zamieniana na czek, i depozytowana na tzw. DEMAND ACCOUNT i nagle powstały fundusze. Zgodnie z prawem finansowym, osoba kreująca tzw. promissory note (nasza umowa własnoręcznie podpisana) jest jej właścicielem. Do zakończenia trwania owego kontraktu, umowa powinna być przechowywana w banku, a po zakończeniu spłat owej „pożyczki” powinna zostać oddana jej twórcy. Tak się jednak nie dzieje i tu jest sposób żeby zamieszać w kotle lichwy.\nSą ludzie, niektórych znam osobiście, którzy w ten sposób najpierw „zamrozili” swoje „pożyczki” po czym mieli je zupełnie odpisane (set off, nie wiem jak to po polsku).\nPierwszy etap jaki otwiera puszkę Pandory, to żądanie inspekcji pierwszej umowy, tej własnoręcznie podpisanej przez „kredytobiorcę”. Tu, właściwie wszyscy starający się o ten zabieg dostali odpowiedź odmowną, odprawiono ich z kwitkiem. Niektórym nawet bank odpisał, że gdzieś ją zgubili!\nTym, którym pokazano, umowa była podbita i podpisana przez przedstawiciela banku –czyli ten dokument został ENDORSED, wpłacony na konto.\nPrzy jakiejkolwiek próbie zadawania niewygodnych pytań, bank albo olewa sprawę, albo zaczyna straszyć, albo udaje głupka – poważnie.\nZanim jednak ktoś zdecyduje się na grzebanie w tym kotle musi pamiętać jedno – zanim dotrze do miejsca, gdzie po szeregu korespondencji udowodni tę całą umowę jako przekręt – musi regularnie spłacać swoje „zobowiązania”. Zbyt wczesne zaniechanie spłat spowoduje, że dotarcie do końca procesu będzie bardzo utrudnione, bo sąd wydaje wyrok TYLKO na podstawie komercyjnego zobowiązania, na co jest dowód-umowa, a cały proces udowodnienia fałszu jeszcze nie został zakończony.\nPo otrzymaniu negatywnej odpowiedzi dotyczącej inspekcji umowy, trzeba listownie zadać szereg pytań, niektóre muszą być pod tzw. pełną odpowiedzialnością komercyjna. Jedno z takich pytań skierowanych do wyższego managementu banku brzmi:\n„Czy fundusze na moją pożyczkę były w depozycie banku przed podpisaniem umowy?\nCzy w razie niespłacenia owej pożyczki bank straci ową sumę?”\nNa te pytania nigdy nie otrzymacie odpowiedzi, przynajmniej takiej, która mówi jasno tak, lub nie, i co więcej NIKT z personelu (może jakiś frontowy Wacek na kasie) się pod tym nie podpisze.\nDo tego procesu jeszcze wrócimy, ale jednego chcę uniknąć – nie chcę, żeby ktokolwiek próbował robić coś na pół gwizdka, bez zrozumienia jak to wszystko działa, i ja osobiście nie udzielam żadnych rad prawnych. Dzielę się informacjami jakie zdobyłem i swoimi osobistymi doświadczeniami (o tym później). Nic poza tym, każde działania, jakie ktokolwiek podejmie są wyłącznie na jego własną odpowiedzialność. Zrozumiałe jest, że jak tylko zacznie się niewygodna sytuacja dla lichwiarza, będzie walka na ostro, więc proszę pamiętać o tym, co powiedziałem.\nNie chcę również, aby te informacje służyły wyłącznie rozwaleniu lichwy, to są wrota do wolności moim zdaniem, musimy zrozumieć naturę naszego niewolnictwa, skąd się wzięło i jak z tym skończyć. I sama umiejętność odwalania bankowych pasożytów nie da wam wolności. Musimy zrozumieć, dlaczego ktoś nami rządzi, dlaczego mamy „obowiązki” płacenia podatków, za które nie mamy ŻADNYCH benefitów i całą masę innych problemów.\nNa zakończenie tego pisma, kilka pytań, które mogą być jak drzazga w pupie, i większość ludzi nie ma najmniejszej ochoty o tym rozmawiać:\nDlaczego Polska to Republika, a ustrój miłościwie panujący na tym kawałku piachu to demokracja, a właściwie korporacyjna demokracja (połączenie korporacyjnego świata i świata polityki w jednym kraju – to definicja faszyzmu)? DEMOKRACJA I REPUBLIKA to dwa zupełnie PRZECIWSTAWNE ustroje! Demokracja to tzw. PB RULE, czyli siła większości, a prawa jednostki są nieważne, natomiast w republice prawa jednostki są najwyższym dobrem. Nie jest to dziwne?\nW jakim celu rząd Republic of Poland został zarejestrowany jako korporacja? Nawet urząd królowej angielskiej to zarejestrowana korporacja… po co?\nDlaczego ludzie posiadający majątek w postaci prawa do ziemi i jej zasobów (akt urodzenia miedzy innymi jest dowodem na to) nie mogą z tego korzystać? A może prościej – dlaczego nasz Jaś, urodzony na polskiej ziemi, nie ma prawa do korzystania z jej zasobów? Albo do tego żeby sobie postawić dom, za to musi kupować ten kawałek ziemi od innego człowieka – kogoś również urodzonego na tej samej ziemi? Nie mam na myśli prywatnych właścicieli – mam na myśli te fikcyjne twory/korporacje, takie jak rząd, gmina i ten cały szajs? Jakim prawem jeden Polak przywłaszcza swojej korporacji ziemię, a potem sprzedaje ją innym rodakom? Czy on ją kupił od Boga?\nOd dziecka tłuką nam do łba, jaka to demokracja jest wspaniała i sprawiedliwa. Mam pytanie – ćwiczymy ten debilny system od wielu, wielu lat – czy jest ktoś przy zdrowych zmysłach, kto zaprzeczy, że nasz kraj (cały, „demokratyczny” świat – zobacz Grecję, kolebkę demokracji) idzie dosłownie, dosłownie w czarną dupę? Definicja szaleństwa wg Einsteina: ROBIĆ W KÓŁKO TO SAMO OCZEKUJĄC INNEGO REZULTATU – brzmi znajomo?\nW świetle prawa naturalnego (nie ustawowych bredni) każdy człowiek jest sobie równy, nikt nie ma prawa dyktować zachowania drugiemu człowiekowi (sytuacja zmienia się, gdy zachodzi krzywda). Więc jakim cudem wszyscy ludzie zostali dosłownie zredukowani do sługusów? Ludzie,  my jako naród, nie mamy nic do powiedzenia, zupełnie! Nikogo to nie dziwi? A może, dobrowolnie, zapisaliśmy się do korporacyjnej RP, nasz status z rdzennego mieszkańca został zredukowany do pracownika korporacji, dostaliśmy numer ID (pesel), całą masę przywilejów, szef nam powie ile możemy zarabiać (minimalna płaca), ile mamy wolnego, ile lat będziemy pracować, a na koniec, gdzieś koło 70-tki dostaniemy jakieś ochłapy (emeryturę). Proszę pamiętać że jesteśmy właścicielami części bogactwa tego kraju tylko… TYLKO nie w roli pracownika RP, a  w roli rdzennego mieszkańca ziemi zwanej Polska.\nJest wiele pytań i tematów, o których ludzie nie chcą rozmawiać, wiem nawet dlaczego. Zabawny jest fakt, że najmniej do powiedzenia, albo zupełne bzdety, płodzą ludzie tzw. wykształceni, ci z nosem pod chmury i kilkoma dyplomami. Oni niestety są najbardziej pokrzywdzeni przez system, w ich mózgownicach zdolność logicznego myślenia została niemal całkowicie wytrzebiona.\nLudzie nie chcą rozmawiać o takich rzeczach, bo bardzo szybko dochodzą do wniosku, że to my, tak, my wszyscy jesteśmy winni tego burdelu. Nasza ignorancja jest przeogromna, nawet nie ignorancja (bo to wg definicji jest brak informacji na jakiś temat), ale nasze olewactwo. W dzisiejszych czasach mamy dostęp do informacji bardziej niż kiedykolwiek w historii człowieka, jednak przeciętny człowiek spędza kilka godzin dziennie oglądając intelektualną sraczkę w TV.\nTrochę się zagalopowałem, wracam do tematu aktu urodzenia i pieniędzy w następnej części.",
			"added": 1580292774
		},
		{
			"topic_id": 1580479193,
			"title": "Jeden z najwiekszych przekretow..czesc IV",
			"body": "Wracając do aktu urodzenia, postaram się trzymać tematu. Przykłady jakie podaję są po części zaczerpnięte z mojego życia za granicą, kilku krajach, jednak wszystkich należących do bloku IMF, więc wszędzie system jest niemal identyczny.\nNa podstawie aktu urodzenia są stwarzane inne dokumenty dla naszego Jasia. Jaś dostanie dowód osobisty, paszport, może kiedyś prawko, kartę ubezpieczeniową itd. Zabawny jest fakt, przykład z USA, że na akcie urodzenia jest napisane jak byk – DO NOT USE IT AS IDENTIFICATION, czyli nie używać jako dowód identyfikacji, a jednak w urzędzie proszą o ten papier – to też nie przypadek.\nJaś otwiera konto w banku, gdzie podaje swój Pesel, proszę pamiętać, że ten numer jest nadany przez korporację RP, więc nie należy wyłącznie do Jasia, Jaś jest tylko jego użytkownikiem, nie właścicielem. Konto bankowe, założone przy udziale numeru pesel, nie jest wyłącznie własnością Jasia. Jak myślicie, dlaczego komornik z urzędu może sobie tak po prostu zająć wasze pieniądze? Pieniądze zdeponowane są w prywatnej instytucji (tego nie muszę tłumaczyć?) Jeżeli Jaś jest pracownikiem RP, a jego konto NIE JEST prywatne, to RP ma prawo nie tylko tam zaglądać, ale i zabrać co jej się podoba. Pomijam fakt, że przy zakładaniu konta dajecie tzw. power of attorney instytucji bankowej do robienia z waszą kasą co im się tylko podoba – jak myślicie, jakim cudem oskubali ludzi na Cyprze z depozytów, tzw. HAIR CUT, czyli zwędzili ileś procent z prywatnych kont – i NIKT nie poszedł siedzieć – zabawne prawda?\nJest sposób, żeby założyć konto w banku bez udziału numeru pesel (bądź innego korporacyjnego numeru). Nazywa się to NON INTEREST BEARING ACCOUNT, ale jest to bardzo trudne. Sam jeszcze tego nie zrobiłem, więc złożę raport jak mi poszło w przyszłym czasie.\nNasz Jaś idzie do pracy. W momencie podpisania umowy o pracę pokazuje swój dowód, dowód na to, że pracę podejmie za pośrednictwem JASIA, czyli swojego korporacyjnego bytu, a co za tym idzie, ma obowiązek dostosować się do zasad korporacji RP i grzecznie robić co mu się nakazuje. Jaś będzie zarabiać kasę, część tych pieniędzy zostanie mu odebrana w postaci podatków (sam dobrowolnie się na to zgodził), reszta zostanie wpłacona na konto bankowe, gdzie widnieje JAŚ (proszę wyjąć swoją kartę bankomatową i zobaczyć, co jest na niej napisane dużymi literami: JAŚ KOWALSKI, i nie dlatego że ludzie mają wadę wzroku – zapewniam was).\nTu muszę powiedzieć, że system powoli robi się zupełnie zuchwały, wiedzą że pospólstwo jest kompletnie ogłupione, więc coraz częściej pisanie dużymi literami jest zastępowane bądź kombinacją dużych i małych, a czasami – zupełnie na barana, małymi. Wiedzą, że my nic nie kumamy, więc się nawet nie przejmują. Ale zasady się nie zmieniają, nigdy, więc jak się nauczymy o co chodzi, to czy duża, czy mała litera, nie zrobi żadnej różnicy.\nMijają lata, Jaś zakłada rodzinę, chciałby kupić dom, więc idzie do swojego banku i postanawia wziąć kredyt na ten dom. Ten proces dostępu do prywatnego kredytu opisałem już wcześniej. Jest zupełnie podobnie jak w przypadku „pożyczki” gotówkowej, na samochód itp., jednak z małą różnicą.\nOtóż tzw. MORTGAGE czyli, „pożyczki” na nieruchomości to największy rynek i chleb powszedni lichwy, więc jest kilka małych różnic.\nPodaję na przykładzie USA i UK, bo w RP nie mam doświadczenia, ale jestem przekonany, że proces jest niemal identyczny, bo zasada działania jest ta sama.\nJaś podpisuje umowę o kredyt (za pomocą JASIA oczywiście), na sumę wcześniej ustaloną, bankier zwija umowę i całą masę innych papierów, Jaś idzie do domu i czeka na sfinalizowanie umowy, ale będzie musiał pojawić się JESZCZE RAZ i podpisać resztę dokumentów – proszę zapamiętać ten moment, bardzo ważne.\nBankier robi swoje, sprawdza, pręży się tu i tam i woła Jasia, żeby zakończyć proces „kredytu”, żeby Jaś mógł w końcu zamieszkać w swoim M. I co dalej, a właściwie, co się stało, jak wyglądał ten proces i jaką rolę w nim pełnił Jaś i jego osoba prawna JAŚ?\nJaś na pierwszym spotkaniu pojawił się w roli, jaka ma ogromną władzę, władzę stwarzania pieniędzy. Pamiętajmy, że CAŁE FUNDUSZE na ten pseudo-kredyt powstały przy pomocy kawałka papieru (umowa), kilku podpisów po obu stronach i obietnicy spłacenia należności. Te wszystkie elementy to składniowe tzw. PROMISSORY NOTE, czyli pieniędzy (poza datą, bo to jest następny szwindel).\nPamiętamy, że owa umowa zostaje zamieniona w czek i zdeponowana na nowiutkim koncie pod imieniem JAŚ KOWALSKI, czego właścicielem jest kto? No właśnie, nikt inny jak Jaś Kowalski! To są jego fundusze, wiem że ciężko to ogarnąć, to brzmi jak stek bzdur, ale zapewniam was, że tak jest.\nJaś pojawiając się na drugim spotkaniu, żeby sfinalizować „kredyt”, nakłada już inną czapkę, dalej posługuje się swoim korporacyjnym bytem JAŚ KOWALSKI, jednak tym razem podpisuje resztę dokumentów w roli – KREDYTOBIORCY, to jest zupełnie nowy kontrakt, który zobowiązuje Jasia do spłacania owego, wyimaginowanego kredytu.\nŻeby pokazać to na przykładzie łatwiejszym do zrozumienia. Bywa nie raz, że człowiek pełni różne funkcje, ktoś kto jest ministrem transportu, ma swoją prywatną firmę naprawiającą drogi. Bywa, że przetarg na prace nad publicznymi drogami „wygrywa” firma owego ministra, bądź pod innym szyldem, ale wciąż jego. Czy to jest konflikt interesów? Czy ten minister dał sam sobie tę pracę po znajomości? Na pierwszy rzut oka oczywiście, w świecie biznesu niestety nie. Jak robił przetarg na pracę miał na głowie czapkę ministra, przyznając pracę swojej firmie, odbierając, podpisując umowę na tę pracę zrobił to nosząc inną czapkę – prezesa firmy budowlanej, naprawiającej drogi. To jest nie w porządku, ale tak niestety działa commerce, biznes. Równie ważne co się mówi jest to, KTO to mówi. W świecie biznesu ten epizod to nie konflikt interesów.\nDlaczego podaję taki przykład – my również nosimy czapki, wcielamy się na co dzień w inne role, piastujemy stanowiska, które niosą ze sobą przywileje, ale również masę zobowiązań.\nNasza rola jako pracownika RP jest z góry założona: 24 na dobę, a my, grzecznie jak stado baranków udowadniamy to na każdym kroku. Ile razy legitymujemy się rządowym/korporacyjnym ID zwanym dowodem osobistym? Ile razy dziennie używamy karty płatniczej JAŚ KOWALSKI i pobieramy kasę z konta owego pracownika? Robimy te wszystkie rzeczy wiele razy dziennie nie mając zielonego pojęcia co się z tym wiąże.\nWracamy do aktu urodzenia i pieniędzy. Ludzie (i ja sam do niedawna) miałem mocne przekonanie, że to banki nas wszystkich wykańczają i nie ma na to rady. Otóż nie tak do końca. Pamiętajmy, że my jako żywe istoty mamy mnóstwo ról jakie gramy. Jedną z nich jest nasza suwerenna rola, kogoś kto się urodził na polskiej ziemi i ma prawo do jej zasobów i bogactwa, pamiętacie? Tylko jest mały problem – ten człowiek, a właściwie jego rodzice, po podpisaniu aktu urodzenia zabrali się w siną dal i nigdy się nie pojawili. W zamian nadali swojemu Jasiowi rolę pracownika/własności korporacji RP i ten biedny Jasio do końca swoich dni będzie piastował tę posadę, zredukowany do numeru pesel, jako nic nie znaczący śmieć i chyba co do tego nikt nie ma żadnych złudzeń.\nCo się stało z majątkiem Jasia? Jaś nigdy się nie pojawił, żeby z niego skorzystać. Proszę pamiętać, że to nie są tak do końca pieniądze, które możemy po prostu wyjąć z systemu. Niektórzy to zrobili, ale dostali tę opcję, żeby zamknęli japę i nie budzili reszty lemingów. Te fundusze są do użycia „wewnątrz” systemu, na potrzeby niezbędne do utrzymania Jasia przy życiu, dobrym i zdrowym życiu, na rachunki leczenia, na rachunki za wodę i prąd, pamiętajmy, że te dobra są w większości generowane z naszych zasobów ziemi, więc należą się WSZYSTKIM, za darmo, jedyną opłatą jaką może pobierać administrator są fundusze potrzebne na budowę i naprawy systemu dostawy, nic więcej.\nTe fundusze mają na celu udostępnić ziemię pod budowę domu dla Jasia (jak myślicie, skąd Kadafi brał tyle siana, żeby ludziom dać bezzwrotne dofinansowanie na mieszkanie, samochód, służbę zdrowia? Z ropy? OK, a ropa czyja? Jego, czy ludzi na owej ziemi? No właśnie, teraz gryzie ziemię, bo to nie podobało się naszym demokratorom jak Obierak Banana i spółka.\nWięc tak naprawdę mamy wszystko, czego nam potrzeba, ile prostsze byłoby życie, gdybyśmy mieli dom, nie płacili podatków dochodowych, mieli służbę zdrowia z prawdziwego zdarzenia i piękną emeryturę (nie, nie musimy płacić ZUS ani innych składek, to wszystko jest rozkradzione niestety).\nBank to jest tylko coś na obraz lustra, tak to prawda, że chłopacy się rozkręcili i zaczęli nadużywać swoich możliwości i okradają ludzi, ale jak sprowadzimy ich do oryginalnej roli nie mają żadnej władzy. Są tu tylko po to, żeby konwertować formy pieniedzy (umowa/promissory note-cyfry na ekranie-fundusz na koncie) i pośredniczyć za niewielką opłatą pomiędzy rolami, jakie pełnimy na co dzień. Nic innego!\nBank trzyma kontrolę nad tym, żeby ludzie nie powariowali i nie zaczęli tworzyć trylionów, jak poznają prawdę. Chyba nie muszę nikogo przekonywać, że taka samowolka byłaby katastrofą dla ekonomii. Jutro każdy miałby bilion $$$ i bułka kosztowałaby 60 bilionów $$$. Ludzie w większości nie są jeszcze gotowi, żeby pilnować tych spraw, chciwość i lenistwo razem z głupotą niestety pogrzebałaby całą rasę ludzką, jeżeli bank wyjawiłby jak tworzyć pieniądze.",
			"added": 1580479189
		},
		{
			"topic_id": 1580723330,
			"title": "Jeden z najwiekszych przekretow..czesc V",
			"body": "Ludzie sprawnie działający w systemie bardzo dokładnie określają swój status. Nie mam na myśli statusu materialnego, bądź nadmuchanego ego, żeby pokazać komuś, że ma doktorat, bądź jest prawnikiem. Prawda, że ogół nie rozumie o co chodzi i robi to z automatu, są jednak ludzie, którzy doskonale wiedzą co robią i po co.\nJak już pisałem wcześniej – wewnątrz systemu, bardzo ważna jest rola tzw. CAPACITY, czyli urząd, jaki piastuje dany człowiek. Jak Obomba Assclown zwraca się do ludzi, każdy kto wymienia jego osobę mówi wyraźnie PRESIDENT OF UNITED STATES Barack Obomba ;), jak dostajemy list od kancelarii, jest wyraźnie napisane LTD, mecenas, sędzia, ktokolwiek do nas się zwraca, nawet najmniejsza gnida sądowa tutaj, czyli Magistrate, ZAWSZE podaje tytuł przed nazwiskiem – dlaczego?\nOtóż działa to na kilka sposobów:\nWyraźnie zwraca uwagę na fakt KTO do nas pisze. Człowiek Barack Obomba może mi co najwyżej podskoczyć, ale kiedy ja nosze czapkę pracownika USA, to PREZYDENT Barack Obomba może wsadzić mnie do pudła na resztę życia bez przywileju procesu i bez postawienia zarzutów, na podstawie jakiejś bzdurnej ustawy o terroryzmie, nawet jak nie zrobiłem zupełnie nic, gwałcąc moje wszystkie prawa ludzkie – tylko dlatego, że nie mam żadnych praw ludzkich/naturalnych kiedy piastuję rolę pracownika USA.\nStawia wyraźną barierę pomiędzy oficjalnym stanowiskiem, a prywatnym statusem nadawcy. Co to znaczy – jeżeli dostajemy korespondencję od adwokata, to pisze do nas ADWOKAT (dajmy na to ANDRZEJ NOWAK), nie Andrzej Nowak, lat 38, ojciec 2 dzieci – to bardzo ważne. Pan Andrzej w swojej oficjalnej roli jako MECENAS A. NOWAK ma nie tylko swój biznes, ale również ma swoją polisę ubezpieczeniową na ten biznes i rolę, jaką pełni. Jest ubezpieczony w roli MECENASA na wypadek jakby zrobił jakąś krzywdę komuś w czasie swojej pracy (takich sk…..synow jest w Polsce tysiące, niestety). Więc tu jest ściana bezpieczeństwa dla pana Andrzeja. Jeżeli zrobi on komuś krzywdę, i zostanie to udowodnione – pan A. nie będzie bulić ze swojej kasy (a już na pewno nie całą sumę), pan MECENAS A. NOWAK, za pośrednictwem ubezpieczyciela, pokryje koszty…. Ojciec dostaje pismo od lekarza pani doktor ANNY SOBOTA, że na badanie trzeba czekać aż 7 miesięcy – ojciec umiera po 3. Czy pani Anna Sobota będzie miała kłopoty? Nie, DOKTOR ANNA SOBOTA robi dokładnie to, co korporacja NFZ pod opieką RP jej nakazała, a w swojej oficjalnej roli ma również ubezpieczyciela, na wypadek gdyby córka owego ojca chciała kogoś zaskarżyć, majątek pani Anny Sobota w prywatnej roli będzie nietknięty, bądź bardzo nieznacznie.To się tyczy niemal wszystkich ról/posad/capacities jakich używamy na co dzień. Dlaczego policjant wali pałką nastolatka i nie idzie siedzieć za zabójstwo?? Bo stróż prawa korporacyjnego ma ubezpieczyciela, który za to zapłaci. Albo i nie, bo dziś ludzie nie znają swoich praw. Ten sam policjant po pracy zabije 14 latka – w swojej prywatnej roli – idzie siedzieć na parę lat (zazwyczaj dużo krócej, bo koledzy z systemu – sędziowie – dbają o swoje pieski – policję)\nTytuł określa również przynależność do organizacji, adwokat jest członkiem BAR ASSOCIATION, czyli LAW SOCIETY, każda adwokacka gnida (mówię to celowo, bo wiem kim są i jaką rolę pełnią w systemie), która zdała egzamin BAR jest członkiem tego bractwa i cieszy się niemal nieograniczoną wolnością do popełniania błędów, błędów, które kosztują majątki, a nierzadko życie ludzkie.\nNa tym to polega. Każdy, kto robi to świadomie, używa swojego tytułu po to, żeby oddzielić siebie (człowieka) od roli, jaką pełni w systemie, a co za tym idzie ograniczyć odpowiedzialność, jaką ponosi podczas pełnienia roli.\nMy zakładamy wiele czapek codziennie, mamy również rolę wewnątrz naszej osoby prawnej rolę, która daje nam bardzo dużą władzę nad tym korporacyjnym bytem, ale o tym w innej części.",
			"added": 1580723325
		},
		{
			"topic_id": 1581418535,
			"title": "Jeden z najwiekszych przekretow..czesc VI",
			"body": "Ten cały system stwarzania pieniędzy z niczego, a potem mnożenia ich niemal dziesięciokrotnie, to dzisiaj podstawa tzw. biznesu wewnątrz systemu. Praktyki monetaryzacji obietnic spłaty (promissory note) sięgają setek lat wstecz. Kiedyś bardzo ryzykowne było przewożenie złota i innych kosztowności statkami, narażonymi na ataki piratów (którzy pracowali dla korony – serio), więc tzw. merchants, czyli ówcześni biznesmeni wymyślili, że kawałek papieru, podpisany przez obie strony interesu, będzie miał równowartość pieniężną.\nKtoś chciał zapłacić za owies pół tony złota, wystawiał papier, statek wiózł papier, a później ten kto to otrzymał mógł spieniężyć ten dokument, bądź wymienić go na inny towar bądź usługi. W razie napadu na statek, papier nie mógł być spieniężony przez pirata, dla niego to był tylko kawałek papieru (bill of exchange 1882 act).\nTen pomysł, sam w sobie, nie jest wcale zły, tylko jak wszystko inne w naszym życiu został dosłownie porwany przez cwaniaków, zupełnie jak koncept rządu/państwa, religii i inne programy uprawiane dziś przez miliony nieświadomych istnień.\nProblem polega na tym, że z roku na rok jesteśmy coraz głupsi niestety – ja jak najbardziej zaliczam się do tego grona. Rok po roku nasza zdolność do myślenia ulatuje niczym ptaki do ciepłych krajów, dzięki telewizji, natłokowi mediów, i tej całej rozrywkowej rąbanki dla półdebili, jaką karmimy nie tylko siebie, ale i nasze dzieci.\nProces odwalania lichwy będzie kontynuowany, jeżeli Maria pozwoli poświęcić temu tematowi kawałek miejsca na blogu. [Jasne, że pozwalam, lichwa to podstawa tego przekrętu, więc trzeba wiedzieć jak nas robią w bambuko, MS]. Nie damy rady streścić wielu lat opresji w kilku krótkich artykułach, poza tym – jak już pisałem wcześniej – ktoś, kto nie ma podstaw wiedzy na temat systemu, może zrobić sobie krzywdę skacząc do wielkiego psa z małym patyczkiem.\nJa bardzo chętnie oddam wszystko, co wiem na ten temat, podam też moje własne sukcesy w tym temacie i dokładny opis, jak to zrobiłem. Ale to musi być zrobione od podstaw, proszę mi wierzyć – banki nie poddają się szybko i łatwo. Pamiętajmy, że mimo tego, że sądy są nasze – ludzie w tych sądach są w dużej mierze opłacani przez system finansowy – lichwę, żeby upewnić się, że będą istnieć długie lata.\nOstatni sędzia jaki w historii publicznie przyznał rację właścicielowi niespłaconego domu i pogonił bank został znaleziony w rzece, na krótko przed emeryturą. Ale to było dosyć dawno, dzisiaj ludzi częściej się kupuje niż zabija. Przychodzi moment kiedy zaczynają być niewygodni, i dostają tyle kasy ile chcą, żeby siedzieć cicho. Lichwa i tak stwarza pieniądze z powietrza, więc dla nich suma nie  gra roli.\nWracając do aktu urodzenia, posłużę się przykładami z życia innych ludzi, daleko bardziej doświadczonych ode mnie w tym temacie. Jednym z nich jest Dean Clifford, którego ja darzę ogromnym szacunkiem. Chłopaka wsadzają do pudła co jakiś czas, do izolatki, żeby nie uczył osadzonych, jak wyjść z paki, ale on nie tylko mówi, on żyje tak, jak uczy.\nKto z Was wierzy, że potrzebuje prawa jazdy, żeby jechać samochodem?\nPewnie wszyscy, ok, zapytam inaczej:\nKto z Was myśli, że potrzebuje pozwolenia drugiego człowieka, żeby przemieścić się z jednego miejsca na drugie – w sposób, jaki mu się podoba, zakładając, że w czasie tej akcji nie robi nikomu krzywdy??\nMyślę, że ręce pospadały tym razem. Czy naprawdę myślicie, że ktoś musi nam dać zgodę, żeby przejść, przeskoczyć, bądź przejechać z A  do B???  A jakim prawem?\nW którym momencie naszego życia straciliśmy zdolność decydowania o samych sobie??? Zostało nam to odebrane silą? Czy dobrowolnie oddaliśmy to prawo?\nKto z Was myśli, że Bronisław Komorowski i jego świta (wiem, to już przeszłość, ale to tylko przykład) ma większe prawo do kawałka ziemi na tym globie, zwanym Polską niż ja, czy ty??? Nikt? To dlaczego idziesz kupować ziemię od instytucji/korporacji tych ludzi, żeby postawić sobie dom dla swojej rodziny? Wszyscy urodziliśmy się na tym samym kawałku piachu, prawda?\nZmierzam do tego, żeby ludzie zaczęli zadawać sobie pytania, pytania logiczne, które zmuszą ich do myślenia na tyle, żeby zrozumieć dynamikę, jaka istnieje między rolami, jakie pełnią ludzie. Skoro policjant to PUBLIC SERVANT (służba publiczna), a ja jestem częścią PUBLIC, to chyba się samo przez się rozumie, kto ma wyższą jurysdykcję na tym obrazku, prawda? Więc jakim prawem mój sługa drze japę na mnie na ulicy, obraża mnie, wali mnie pałą w łeb, kiedy mu się podoba? Nikomu nie wydaje się to dziwne? Czy jest dopuszczalne, żeby sprzątaczka (to tylko przykład, nie obrażam sprzątaczek broń Boże) darła japę na prezesa, a ten posłusznie spuszczał głowę i przepraszał? No chyba raczej nie, a to widzimy na co dzień, wszędzie, i nikt się nie dziwi…\nJak to się ma do aktu urodzenia, żeby zostać w temacie? Jeżeli jesteśmy współwłaścicielami ogromnego bogactwa ziemi, zwanej Polska i mamy na to dowód – akt urodzenia, to ten majątek został złożony pod opiekę rządu, na czas nieokreślony. Zupełnie tak, jak ktoś zakłada tzw. TRUST (powiernictwo) i wyznacza TRUSTEE (powiernika), żeby zarządzał majątkiem najlepiej jak potrafi, zgodnie z założeniami właściciela.\nProblem w tym, że my nie daliśmy żadnych wytycznych przy składaniu naszego majątku. To nie koniec. Nasi rodzice utracili swoje prawa do naszego majątku, działając w naszym imieniu, w momencie osiągnięcia przez nas pełnoletności. W momencie 18 urodzin (w Polsce przynajmniej), my – ich dzieci – powinniśmy skontaktować się z rządem i otwarcie wyrazić naszą wolę, na przejęcie praw do majątku jaki nam się należy, jako tzw. birth right (prawa wynikające z urodzenia), który nasi rodzice w naszym imieniu złożyli na ręce rządu.\nBrzmi to zawile, więc napiszę bardziej prosto.\nJaś tuż przed 18 urodzinami powinien napisać list polecony do odpowiednich urzędników, że za chwilę jego osoba prawna nabierze praw do podejmowania kontraktów, więc pełnomocnictwo rodziców przestanie istnieć. W związku z tym – od teraz – to on sam będzie rozpoznawany przez system jako właściciel 1/50 milionowej wartości Polski (podałem wcześniej ten hipotetyczny przykład). Nic nie musi być robione, jeżeli nie chce tego Jaś, ale musi otrzymać odpowiedź, że ta informacja została przyjęta do wiadomości urzędów, i tyle. Nikt nigdy z nas tego nie zrobił! Pamiętacie historię zaginięcia na morzu przez 7 lat, po czym cały majątek po prostu przepada? Tutaj też ta metoda pewnie jest stosowana, na co nie mam dowodów, ale tak mi się wydaje. Nieważne zresztą, fakt jest taki, że ów majątek po prostu zniknął z radaru Jasia.\n\ndodatek:\n\nPolicjant, lekarz, a przede wszystkim RZĄD I SEJM są opłacani z naszych podatków, są na naszej jałmużnie, więc są służbą publiczną i dlatego to my jesteśmy szefami tych pań i panów, a oni mają nam służyć. Oni mają robić to, co my im każemy, a nie odwrotnie! Tak, rząd jest na Twojej jałmużnie, i to ty jesteś szefem tego zakichanego rządu,czas to sobie wreszcie uświadomić!\nJeśli lekarz drze na Was mordę i straszy sanepidem, grzywną i wojewodą, bo nie zaszczepiliście dziecka nagrywacie zajście (to jest legalne i nikt nie ma prawa wam tego zakazywać!!!) i natychmiast wzywacie policję, ponieważ macie  podejrzenia, że lekarz chce zabić wasze dziecko, wstrzykując mu jakieś świństwo wbrew waszemu jasno wyrażonemu sprzeciwowi. Wasza wola musi być święta dla waszego sługi! Nie dość, że robi zamach na wasze dziecko, to jeszcze dopuścił się napaści słownej i terroru w stosunku do was, rodziców, którzy jesteście prawnymi opiekunami dziecka i decydujecie o wszystkim, co go dotyczy! To jest terror i to jest bezprawie! Takiego lekarza natychmiast zwalniacie z funkcji waszego pediatry / lekarza rodzinnego i piszecie na niego skargę lub nawet doniesienie do prokuratury. Czas najwyższy, żeby totalnie rozbestwiona służba w tym domu, jakim jest Polska została przywołana do porządku. Jeśli służący chce rządzić w twoim domu i wydawać ci rozkazy będziesz to tolerować? Będziesz się płaszczyć i trząść ze strachu? Czy raczej wywalisz drania z pracy i zatrudnisz kogoś bardziej kulturalnego i autentycznie dbającego o twoje dobro?\nDlaczego się boisz policji? Bo gliniarz ma pałę? Może i ma, ale to ty masz władzę!\nDlaczego się boisz lekarza? Popatrz, jaki wykrzywiony jest twój obraz świata: czy psychopatyczny łowca skór, który za garść srebrników od zakładu pogrzebowego lub kartelu farmaceutycznego chce uśmiercić ciebie i twoją rodzinę nie powinien panicznie bać się ciebie? Tymczasem nie tylko się ciebie nie boi, ale doprowadził do tego, że to ty boisz się jego!\nCzas się obudzić!",
			"added": 1581418529
		},
		{
			"topic_id": 1581418593,
			"title": "Jeden z najwiekszych przekretow..czesc VII",
			"body": "Temat aktu urodzenia jest bardzo głęboki, jest też ogrom teorii na ten temat, które różnią się diametralnie od siebie. Nie twierdzę, że moje zrozumienie tematu jest wyrocznią, mogę tylko powiedzieć, że przy informacji, jaką posiadam, mojej zdolności myślenia i doświadczenia w tym temacie to zrozumienie – dla mnie – trzyma się kupy.\nZanim zakończę ten temat, chciałbym przytoczyć przykład z życia kogoś, kogo znam, człowieka bardzo doświadczonego w tym temacie, który zna swoją rolę, i rolę aktu urodzenia w systemie.\nDean, człowiek któremu dużo zawdzięczam, postanowił przekroczyć granicę między Kanadą i USA wyłącznie na podstawie aktu urodzenia. Pomijam fakt, że jeździ samochodem bez ubezpieczenia, bez prawa jazdy i bez rządowej rejestracji (ma swoją, wyłącznie dla identyfikacji).\nPo spotkaniu służb celnych na granicy USA (proszę pamiętać, jak bardzo szurnięci są ci ludzie TSA) został zaproszony na rozmowę, gdzie bardzo grzesznie powiedziano mu, że w tym czasie nie ma wjazdu do USA. Nie został aresztowany za brak prawka, ubezpieczenia, rejestracji.\nCi ludzie (trochę wyżej na stołku) dobrze wiedzą, że akt urodzenia nie tylko wystarczy, żeby podróżować (mimo tego, że nie może być używany jako identyfikator osoby), ale przede wszystkim jest to dowód na to, że dana osoba ma majątek, w razie gdyby spowodowała jakieś szkody.\nTo jest, jak już wcześniej pisałem tzw. BOND, na bazie którego niemal wszystkie szkody (nieumyślne) zostaną zrekompensowane poszkodowanemu.\nCo więcej, jak już pisałem, jest wiele USA, (pewnie nawet i RP), więc Dean zapytał „do którego USA nie mam wjazdu? Do Konstytucyjnej Republiki USA, czy korporacyjnego USA?”\nOdpowiedz strażnika była bardzo prosta: „Proszę pana, nie możemy na ten temat rozmawiać”.\nJa sam kiedyś napisałem do jakiegoś urzędu, nie pamiętam dokładnie już gdzie, z zapytaniem, gdzie mogę znaleźć numer rejestracyjny korporacji Rzeczpospolita Polska. I czy to prawda, że rząd to zarejestrowana korporacja. Ich odpowiedz była również bardzo prosta: „Nie możemy Panu pomóc”.\nJa odpisałem, że dziękuję za potwierdzenie, dziękuję, że nie zaprzeczają, że RP to korporacja i że znajdę sobie sam.\nCzy sam akt urodzenia, jako papier mający wartość monetarną jest wymieniany, kupowany, sprzedawany na Wall Street bądź w innym miejscu – tego nie wiem, ale całkiem możliwe. Posiada numery, podpisy, daty, więc być może, zgodnie z systemem tworzenia pieniędzy, to jest jakiś papier wartościowy i generuje majątek w czasie swojego istnienia. Nie ma to aż takiego znaczenia dla mnie. Na dzień dzisiejszy, jestem za cienki w uszach żeby zrobić z tej opcji użytek i po prostu zażądać dywidendy z tytułu inwestycji i własności. Może kiedyś się tego nauczę, może nie. Dzisiaj myślę, że ten papier ma jedną, bardzo ważną rolę, a właściwie 2.\nJedna to dowód na to, że się urodziłem w danym miejscu i mam prawo do zasobów tejże ziemi, tak jak cała reszta rdzennych mieszkańców i żadna gnida rządowa temu nie zaprzeczy.\nDruga to dowód na to, że mój pionek do gry commerce/światowego biznesu istnieje i to Ja jestem jego panem, nie urząd, nie bank, nie sam papież tylko Ja. Ja go mogę uśmiercić, zbankrutować, bądź używać umiejętnie przez całe moje życie, tak aby przynosił mi korzyść.\nCala reszta jest jeszcze dla mnie do nauczenia.",
			"added": 1581418586
		},
		{
			"topic_id": 1581947196,
			"title": "Jeden z najwiekszych przekretow..czesc VIII",
			"body": "To co się dzisiaj dzieje na świecie w temacie dzieci odbieranych siłą rodzicom zakrawa na szaleństwo. Moim skromnym zdaniem, to jest atak, próba rozbicia ostatniej komórki przyjaznych sobie ludzi – mam na myśli rodzinę.\nPowiem kilka słów na ten temat, rzeczy które u mnie wywołały niemały szok, a wręcz nudności.\nWszyscy chyba „wiedzą” czym jest dzisiaj ślub, kościelny, cywilny, tak przynajmniej nam się wydaje. Sam do niedawna myślałem, że ślub to unia dwojga ludzi, kochających się ludzi, raz przed Bogiem, a raz w świetle prawa, z kochanym urzędnikiem w roli głównej. I tyle, mamy 2 obrączki i kawałek papieru – tu się rola osób trzecich kończy. Niezupełnie… a właściwie wręcz przeciwnie.\nNie będę zagłębiał się w ślub kościelny, jestem anty religijny do takiego stopnia, że lecząc się z tego programu postanowiłem zresetować dosłownie wszystko, co się wiąże z kościołem (nie Bogiem, i nie duchowością). Jeżeli napomknę o kościele, to tyko dlatego, że ma to związek prawny, nic poza tym.\nSkupie się na stronie prawnej/urzędowej bo ta ma ogromne znaczenie dla naszego życia, i życia naszych dzieci.\nJaś (będę piłował tego Jasia jeszcze trochę) i Małgosia postanowili się pobrać, idą więc gdzie trzeba, do urzędu i wyrażają swoją zgodę na to, żeby „zalegalizować” związek. Ja sam nie jestem żonaty, więc mogę jakieś szczegóły pominąć, ale schemat jest ten sam wszędzie, w każdym niemal kraju IMF, o ile mi wiadomo.\nOboje pojawiają się przed urzędnikiem i podpisują papier, świadkowie również, i urzędnik odgrywa swoją rolę. Od dzisiaj oficjalnie Jaś i Małgosia są małżeństwem.\nPozwólcie, że podam kilka faktów, wynikających z tejże unii, unii nie tylko Jasia i Małgosi, ale… i tu uwaga: URZĘDU, tak, dobrze czytacie, to jest unia trzech, nie dwóch osób.\nA jakie ma to znaczenie i czym jest ślub cywilny? Już mówię.\nMałżeństwo, to nic innego (w świetle prawa/biznesu) jak kontrakt, umowa pomiędzy stronami zainteresowanymi (trzema, a nie dwoma), nic poza tym. Jak każdy kontrakt niesie ze sobą wszystkie prawa, warunki, zobowiązania i przywileje dla osób zainteresowanych.  Co to znaczy?\nOtóż w tej unii trojga (JAŚ, MAŁGOSIA, URZĄD – i tu celowo pisze dużymi literami, bo w tej umowie, również posługujemy się JASIEM, czyli korporacyjnym bytem/dowód osobisty). Nie wszystkie strony mają tyle samo do powiedzenia, jedna z tych stron jest tzw. ADMINISTRATOREM unii – kto – no właśnie – URZAD.\nTo urząd pełni rolę najważniejszej osoby w tej umowie, to jest byt, który będzie dyktował warunki trwania umowy aż do jej rozwiązania, a nawet podczas jej rozwiązywania (rozwód), ten byt będzie decydować, gdzie pójdą dzieci, jak zostanie podzielony majątek itp. Dziwne? To czytajcie dalej.\nTa umowa, w świetle prawa, tradycji i trochę ezoteryki (pamiętajmy, że kościelni to nie jest jawne ugrupowanie) ma największą moc. Na zachodzie, dostajemy tzw. MARRIAGE LICENCE, po podpisaniu ślubu cywilnego… licencję na małżeństwo.\nZapraszanie urzędu do naszego rodzinnego gniazda, łączy się niestety z konsekwencjami dużego kalibru. Sam fakt, że sędzia będzie decydował o rozwiązaniu umowy, nawet wbrew małżonkom, nie jest jeszcze najgorszy…\nSą jeszcze dzieci i czasem te dzieci zostają odebrane rodzicom na podstawie totalnie bzdurnych argumentów – widzimy to coraz częściej dookoła.\nTeraz do sedna sprawy.\nDlaczego urzędnikom wydaje się, że mają prawo przyjść do kogoś do domu, bez zaproszenia, i rozpocząć proces, który kończy się odebraniem rodzicom dzieci? Nie mówię tu o patologiach, narkotykach i przemocy, gdzie takie rzeczy jak odebranie dzieci robi się dla ich ratowania. Mówię o masie przypadków, gdzie dzieci są odbierane, bo rodzina jest za biedna – rozumiecie? Rodzina jest za biedna, więc urząd zabiera dzieci rodzinie, daje je obcym ludziom na wychowanie i PŁACI tym ludziom niemałe pieniądze na utrzymanie tychże zabranych dzieci. Nasuwa się oczywiste pytanie – dlaczego zamiast odbierać dzieci i płacić rodzinie zastępczej za wychowanie, rząd nie przeznaczy tych pieniędzy dla oryginalnej rodziny, żeby ta nie była już taka biedna i mogła spokojnie wychowywać swoje pociechy? Tak dyktuje logika i zwykła ludzka przyzwoitość, ale niestety tak nie jest.\nJa skupię się najpierw na tym dlaczego, potem jak sobie z tym radzić.\nOtóż urząd, będąc administratorem unii JASIA I MAŁGOSI ma prawo robić z tą unią co zechce tak naprawdę, dosłownie. My sami oddaliśmy im tę moc, może nawet pełnomocnictwo prawne wobec tego maleństwa, więc robią co chcą.\nDzieci z takowego związku, w świetle prawa to tzw. WARD OF THE STATE, co w wolnym tłumaczeniu znaczy „własność stanu/korporacji RP”, ciekawe prawda?\nMy sami idziemy do tych ludzi, legitymujemy się dowodem osobistym, będącym potwierdzeniem naszej przynależności do korporacji RP, podpisujemy dokument, w którym dobrowolnie oddajemy stery naszego związku obcym ludziom, a potem płaczemy, że ci ludzie robią to, o co ich prosimy – czyli administrują tym związkiem, jego majątkiem i jego dziećmi tak, jak im się wydaje, że powinno być.\nCo dalej z dziećmi?\nNasze pociechy urodzone w jurysdykcji korporacji RP są obiektem wszystkich zasad obowiązujących w tejże korporacji. Jedną z wielu jest obowiązkowe szczepienie i całe to gówno farmakologiczne, jakie serwują władcy swoim poddanym. Rodzic w roli korporacyjnego pachołka nie ma nic do gadania, (ludzie mają już sukcesy na tym polu, ale o tym później). Opieka społeczna nie pyta, czy może przyjść, oni twierdzą, że mają prawo przychodzić, czy nam się podoba czy nie. Jak się IM coś nie spodoba, to zaczyna się młyn papierów i dzieci nagle znikają ze szczęśliwego domu, a rodzice chodzą od sądu do sądu zapłakani, żeby odebrać swoje własne dzieci – tak to wygląda.\nDrodzy czytelnicy, pozwólcie, że zadam kilka pytań, jak zwykle, żeby trochę pomęczyć szare komórki.\nDlaczego myślicie, że potrzebujecie swoją miłość legalizować? Czy mało macie doświadczenia z instytucją państwową, żeby wyciągnąć jeden prosty wniosek: trzymać się jak najdalej od tego szamba i tych porąbanych ludzi????\nNie wydaje wam się logiczne, że zapraszanie osoby trzeciej do waszego związku może wiązać się z konsekwencjami prawnymi? Biorąc pod uwagę punkt # 1, te konsekwencje mogą być, delikatnie mówiąc, bolesne?\nMając odrobinę życiowego doświadczenia, i widząc co się dzieje w temacie rozwodów, odbierania dzieci na widzimisię urzędasów, nie wystarczy to, żeby odmówić jakichkolwiek interesów z tymi ludźmi?\nCo dalej z dzieciakami i jak je odzyskać? Tu zastrzegam znów – nie udzielam rad prawnych, dzielę się tylko informacjami, jakie zdobyłem przez ostatnich kilka lat. Każdą próbę wykorzystania owych informacji podejmujecie na własną odpowiedzialność.\nSprawa zaczęta przez opiekę społeczną (nawet nazwa jest super – rząd wszystko robi o 180 stopni na odwrót) kończy się odebraniem dzieci, zazwyczaj przy zamkniętych drzwiach*) (tak jest w UK), przy procesie przypominającym jakąś farsę. Rodzice idą do domu i zaczyna się niekończąca się gonitwa od urzędu do urzędu, okraszona stosem niezrozumiałych papierów.\nSąd robi dokładnie to, co należy do jego kompetencji, niestety. Ten cały system jest chory, a sądownictwo i ramię wykonawcze (pieski policyjne itp.) nie mają na tyle klepek we łbie, żeby zapytać, czy to, co się dzieje jest sprawiedliwe.\nSąd wydaje wyrok i idzie do domu, pamiętacie jak pisałem o tytułach/rolach/urzędach piastujących je ludzi? Pani sędzina Janina B. w swojej oficjalnej roli jest niestety niemal nietykalna, a jej decyzja będzie odbijać się jak piłka od ścian systemu, nie trafiając do bramki.\nTylko pamiętajmy jedną bardzo ważną rzecz: SĘDZIA, URZĄD, KOMORNIK, BANKIER, LEKARZ, OPIEKA SPOŁECZNA itd. itp. to tylko martwe, nie żyjące i nie oddychające koncepty naszej cywilizacji. Żeby ów status mógł komuś zabrać dziecko, musi być animowany przez żyjącą osobę z krwi i kości, rozumiecie?\nSędzia sądu jest bardzo trudny do ugryzienia (metaforycznie, hehe), ale pani Janina B w swojej prywatnej osobie już nie. Więc składając 2+2 dochodzimy do wniosku – będziemy sądzić panią Janinę B. jako OSOBĘ, a nie sędziego, za zamach na dobro rodziny, traumę dziecka odebranego rodzicom, kłopoty finansowe, jakie się z tym wiążą, stan psychiczny wszystkich członków rodziny, kłopoty w pracy poprzez stan emocjonalny i konieczność pojawiania się w sądzie zamiast w pracy – mam wymieniać dalej?\nWiem, że to większości wydaje się herezją, ale wierzcie mi, tak nie jest. Znam przypadki, kiedy sędziowie uciekali z sali rozpraw, kiedy chowali się miesiącami przed tzw. process server – czyli kimś, kto dostarcza pismo polecone i ma na to dowód. Kiedy tracili posady i posiadłości  (pamiętacie proces aresztowania tytułu własności – commercial lien?) i wiele, wiele innych.\nI ten sposób dotyczy WSZYSTKICH ludzi na tej planecie! Kiedy ostatnio ktoś z was pracował i nie dostał wypłaty, bo firma splajtowała? Firma padła, ale człowiek animujący tę firmę żyje sobie nadal i w jego prywatnym statusie nie cieszy się ochroną skorumpowanego prawa – idziemy z żądaniem zapłaty do niego – cały proces administracyjny, jaki jest potrzebny wytłumaczę w osobnych artykułach.\nJest taki pan, nazywa się Karl Lentz, proszę zaznajomić się z nim na YouTube. On między innymi odbiera dzieci z powrotem od urzędasów. Linia jego argumentu jest niemal banalnie prosta: „Kto z LUDZI siedzących na tej sali twierdzi, że ma prawo do mojego dziecka???”\nZauważcie jedną rzecz: nie pyta jaki oficer, sługa / pracownik opieki, adwokat czy sędzia, on pyta „jaki mężczyzna bądź kobieta rości sobie prawa do mojego dziecka i na jakiej podstawie?” Rozumiecie różnicę między statusem prawnym a statusem prywatnym każdej osoby?\nSędzina JANINA B. rości sobie prawa na podstawie danego jej mandatu (nie wiem jak to nazywa się po polsku) do tego, aby na podstawie materiału przedstawionego przez innych członków korporacji RP podjąć decyzję i zabrać dziecko.\nPani Janina B., lat 45, mieszkanka Szczecina, matka 2 dzieci itd. NIE MA NAJMNIEJSZEGO PRAWA ruszyć palcem naszego malucha, a jak ruszy idzie do pudła, jak każdy przestępca!!!\nNie wiem czy ten koncept jest łatwy do zrozumienia. Jest tak, jak mówił Szekspir- świat to scena, życie to teatr, a my gramy wciąż jakieś role. Tylko dla 99 % społeczeństwa te role nigdy się nie kończą, niestety.",
			"added": 1581947188
		},
		{
			"topic_id": 1581947298,
			"title": "Jeden z najwiekszych przekretow..czesc IX",
			"body": "Na zakończenie tematu ślubu cywilnego i jego konsekwencji prawnych. Wyjaśnię, jak ja radziłbym postąpić, gdyby ktoś decydował się na zawarcie związku.\nUmowa miedzy przyszłymi małżonkami jest święta. Tak długo, jak nie zapraszacie urzędu do swojego związku, wszystko co uzgodniliście między sobą jest nie do podważenia.\nTutaj muszę zaznaczyć bardzo smutną rzecz: Polska to niestety Orwell na sterydach. W żadnym z krajów, gdzie mieszkałem, nie ma takiego przekrętu, że kościół z automatu wrzuca małżonków do korporacji RP, nigdzie takie rzeczy nie mają miejsca (nigdzie, gdzie ja byłem, bądź o czym czytałem) tylko w RP. U nas rząd jest na tyle bezczelny, że ma prawo kompletnie w dupie – dosłownie mówiąc.\nPrzynależność do jakiejkolwiek organizacji (korporacja RP) MUSI być dobrowolna, w Polsce jest jednak inaczej.\nCo dalej z tym ślubem… gdybym ja był katolikiem i chciał wziąć ślub kościelny, umówiłbym się z księdzem i przedstawił pismo, że odmawiam zgłaszania mojego związku do urzędu stanu cywilnego. Nie życzę sobie udziału żadnych urzędów w moim związku, zaniósłbym ten papier do notariusza, żeby przetransferować swoją wolę z jurysdykcji prywatnej do publicznej. Jeżeli notariusz odmowi – wystarczy zebrać podpisy 3 osób nigdy nie karanych (tzw. 3 men of good standing as a witness to my will), żeby dokument nabrał mocy urzędowej, i tyle.\nJeszcze jedna rzecz, ponieważ związek takowy pozostaje w jurysdykcji prywatnej i urząd nie ma nic do powiedzenia, nie byłoby błędem zrobić swoją własną umowę. I nie mam tu na myśli wyłącznie majątków obojga małżonków, mam na myśli szereg praw, jakie będą przestrzegane przez oboje w razie rozpadu małżeństwa.\nTaka umowa jest święta – pod warunkiem, że nie opiera się na oszustwie jednej ze stron, bo i takie przypadki bywają, że zakochana panna młoda zgadza się na wszystko, łącznie z oddaniem nerki itp. Umowa oparta na oszustwie bądź nieuczciwej intencji jest NIEWAŻNA, to nazywa się void ab initio – czyli nieważna od samego początku. Wszystko w tej umowie jest nieważne (proszę poczytać na ten temat, to się może przydać w wielu lichwiarskich umowach w PL).\nW taki sposób można się zabezpieczyć przed udziałem urzędu. Taki związek nie jest obiektem ustaw rządzących związkami małżeńskimi. Oczywiście to wygląda pięknie na papierze, i jest w świetle prawa prawdziwe, jednak jak ze wszystkim – nie obejdzie się bez walki z urzędami. Ale zapewniam was, że można dojść tam, gdzie trzeba, i w czasie procesu uwalić paru cwaniaków w togach, którym wydaje się, że są bogami.\nTo, że jakiś rządowy jełop nabazgra coś na kawałku papieru i nazwie to USTAWĄ (o tym też będziemy pisać), to nic nie znaczy. To, że po kilku latach spędzonych razem związek jest uznany, tak czy siak, bo tak mówi ustawa – to bzdura kompletna. Wystarczy udowodnić, że nie było świadomej unii w obecności urzędnika, żeby obalić ten szajs (to chyba nie jest trudne).\nDzieci ze związku, gdzie urząd jest OUT, mają większe szanse pozostania z rodzicami, jest dużo trudniej odebrać je na podstawie bzdurnych zarzutów, w takim przypadku opieka społeczna i sąd będą miały ogromny problem zabierając dzieci z domu, gdzie nic im nie grozi.\nJeszcze jedno na zakończenie, to już chyba wszyscy wiedzą, że dla zabezpieczenia majątkowego, ślub cywilny powinien pozostać w sferze bajek. Intercyza może i działa, jak bardzo – nie wiem, nie czytałem o tym. Ale powiem jedno – tak długo, jak każda osoba prawna w tym związku jest zupełnie osobną komórką gospodarczą, tak długo długie łapy urzędu będą trzymane z daleka. Proszę pamiętać, że podczas ślubu cywilnego, 2 osoby prawne wchodzą w unię, tworząc nową komórkę, którą administruje urząd – to ma kolosalne znaczenie w świetle prawa.\nMam nadzieję, że ten artykuł nie rzucił zbyt wiele negatywnego światła na samą ideę związków. Nie taka jest moja intencja, jedyne co chcę pokazać, to jak głęboko jesteśmy oszukiwani, we wszystkich aspektach życia, od urodzenia, do śmierci i wszystko pomiędzy. A ludzie, którzy to robią, są na tyle nieświadomi, że będą walczyć, żeby bronić tego systemu opresji. Ludzie w urzędach są niestety niezdolni do myślenia, wielokrotnie zderzałem się z cyborgami za biurkiem, dopiero gdy zacząłem pociągać ich do odpowiedzialności, wszystko się zmieniło, ale o tym w następnym artykule.\n—\nKilka słów wyjaśnienia w kwestii „automatycznej” urzędowej legalizacji nieformalnego związku i dlaczego to jest złe dla małżonków:\nSystem i korporacja RP symulują prawo naturalne. Są kraje, gdzie system, nie mając żadnej władzy nad nieformalnymi związkami, wprowadza „prawo”, które jakoby klasyfikuje (przykładowo) dwuletni związek nieformalny jako równy w świetle „prawa” małżeństwu, tylko co to oznacza? To znaczy, że para, nie rozwiewając takich przypuszczeń, dobrowolnie zgadza się być administrowana przez system sądowy, niejako dobrowolnie oddając władzę nad swoją unią i zapraszając (nieświadomie) 3 osobę – urząd i całą ferajnę cwaniaków. Kobieta bądź mężczyzna ma prawo korzystać z ustaw, jakie regulują instytucję małżeństwa w świecie korporacyjnym. W ten sposób próbują obejść prawo naturalne, dając pseudo-benefit w postaci „ochrony prawnej”, ale zapominając powiadomić, że para traci możliwość decydowania o swoim losie, a co gorsza, o losie swoich dzieci.\nJak to obejść? Bardzo prosto – na chłopski rozum i przy pomocy paru listów.\nJeśli nie ma oficjalnego związku, gdzie urząd jest administratorem, a cała ich jurysdykcja jest domniemana na zasadzie „nikt nic nie mówi, więc działamy dalej” wystarczy wystosować pismo polecone do odpowiedniego organu, który śmie twierdzić, że związek będzie regulowany ustawowo i zapytać o PROOF OF CLAIM, czyli dowód na to, że istnieje dokument, podpisany przez oboje: parę i urzędnika, gdzie para DOBROWOLNIE oddaje swój związek pod opiekę rządu. Nic takiego oczywiście nie istnieje! A potem należy pociągnąć urzędasa do odpowiedzialności.\nKtokolwiek robi tzw. CLAIM, czyli rości sobie prawo do czasu, pieniędzy, wolności itp. drugiej osoby – według prawa – ma obowiązek udowodnić swoje stanowisko – to jest podstawowa maksyma prawna.\nBURDEN PROOF LIES ON THE ACCUSER, w tłumaczeniu: „ten kto oskarża ma obowiązek udowodnić”.\nPrawnicy nie są uczeni prawa, oni są uczeni procedur, ustaw, i całej masy bzdetów, ale na pewno są nieliczni, wysoko, którzy kumają o co chodzi, i to jest wielka przysługa systemu dla nas. Ich głupota i niewiedza może być wykorzystana przez kogoś, kto potrafi myśleć i trochę poczytał.\nPrzekręt wszechczasów część IX\nPosted on 19/08/2015 by astromaria \nNa zakończenie tematu ślubu cywilnego i jego konsekwencji prawnych. Wyjaśnię, jak ja radziłbym postąpić, gdyby ktoś decydował się na zawarcie związku.\nUmowa miedzy przyszłymi małżonkami jest święta. Tak długo, jak nie zapraszacie urzędu do swojego związku, wszystko co uzgodniliście między sobą jest nie do podważenia.\nTutaj muszę zaznaczyć bardzo smutną rzecz: Polska to niestety Orwell na sterydach. W żadnym z krajów, gdzie mieszkałem, nie ma takiego przekrętu, że kościół z automatu wrzuca małżonków do korporacji RP, nigdzie takie rzeczy nie mają miejsca (nigdzie, gdzie ja byłem, bądź o czym czytałem) tylko w RP. U nas rząd jest na tyle bezczelny, że ma prawo kompletnie w dupie – dosłownie mówiąc.\nPrzynależność do jakiejkolwiek organizacji (korporacja RP) MUSI być dobrowolna, w Polsce jest jednak inaczej.\nCo dalej z tym ślubem… gdybym ja był katolikiem i chciał wziąć ślub kościelny, umówiłbym się z księdzem i przedstawił pismo, że odmawiam zgłaszania mojego związku do urzędu stanu cywilnego. Nie życzę sobie udziału żadnych urzędów w moim związku, zaniósłbym ten papier do notariusza, żeby przetransferować swoją wolę z jurysdykcji prywatnej do publicznej. Jeżeli notariusz odmowi – wystarczy zebrać podpisy 3 osób nigdy nie karanych (tzw. 3 men of good standing as a witness to my will), żeby dokument nabrał mocy urzędowej, i tyle.\nJeszcze jedna rzecz, ponieważ związek takowy pozostaje w jurysdykcji prywatnej i urząd nie ma nic do powiedzenia, nie byłoby błędem zrobić swoją własną umowę. I nie mam tu na myśli wyłącznie majątków obojga małżonków, mam na myśli szereg praw, jakie będą przestrzegane przez oboje w razie rozpadu małżeństwa.\nTaka umowa jest święta – pod warunkiem, że nie opiera się na oszustwie jednej ze stron, bo i takie przypadki bywają, że zakochana panna młoda zgadza się na wszystko, łącznie z oddaniem nerki itp. Umowa oparta na oszustwie bądź nieuczciwej intencji jest NIEWAŻNA, to nazywa się void ab initio – czyli nieważna od samego początku. Wszystko w tej umowie jest nieważne (proszę poczytać na ten temat, to się może przydać w wielu lichwiarskich umowach w PL).\nW taki sposób można się zabezpieczyć przed udziałem urzędu. Taki związek nie jest obiektem ustaw rządzących związkami małżeńskimi. Oczywiście to wygląda pięknie na papierze, i jest w świetle prawa prawdziwe, jednak jak ze wszystkim – nie obejdzie się bez walki z urzędami. Ale zapewniam was, że można dojść tam, gdzie trzeba, i w czasie procesu uwalić paru cwaniaków w togach, którym wydaje się, że są bogami.\nTo, że jakiś rządowy jełop nabazgra coś na kawałku papieru i nazwie to USTAWĄ (o tym też będziemy pisać), to nic nie znaczy. To, że po kilku latach spędzonych razem związek jest uznany, tak czy siak, bo tak mówi ustawa – to bzdura kompletna. Wystarczy udowodnić, że nie było świadomej unii w obecności urzędnika, żeby obalić ten szajs (to chyba nie jest trudne).\nDzieci ze związku, gdzie urząd jest OUT, mają większe szanse pozostania z rodzicami, jest dużo trudniej odebrać je na podstawie bzdurnych zarzutów, w takim przypadku opieka społeczna i sąd będą miały ogromny problem zabierając dzieci z domu, gdzie nic im nie grozi.\nJeszcze jedno na zakończenie, to już chyba wszyscy wiedzą, że dla zabezpieczenia majątkowego, ślub cywilny powinien pozostać w sferze bajek. Intercyza może i działa, jak bardzo – nie wiem, nie czytałem o tym. Ale powiem jedno – tak długo, jak każda osoba prawna w tym związku jest zupełnie osobną komórką gospodarczą, tak długo długie łapy urzędu będą trzymane z daleka. Proszę pamiętać, że podczas ślubu cywilnego, 2 osoby prawne wchodzą w unię, tworząc nową komórkę, którą administruje urząd – to ma kolosalne znaczenie w świetle prawa.\nMam nadzieję, że ten artykuł nie rzucił zbyt wiele negatywnego światła na samą ideę związków. Nie taka jest moja intencja, jedyne co chcę pokazać, to jak głęboko jesteśmy oszukiwani, we wszystkich aspektach życia, od urodzenia, do śmierci i wszystko pomiędzy. A ludzie, którzy to robią, są na tyle nieświadomi, że będą walczyć, żeby bronić tego systemu opresji. Ludzie w urzędach są niestety niezdolni do myślenia, wielokrotnie zderzałem się z cyborgami za biurkiem, dopiero gdy zacząłem pociągać ich do odpowiedzialności, wszystko się zmieniło, ale o tym w następnym artykule.\n—\nKilka słów wyjaśnienia w kwestii „automatycznej” urzędowej legalizacji nieformalnego związku i dlaczego to jest złe dla małżonków:\nSystem i korporacja RP symulują prawo naturalne. Są kraje, gdzie system, nie mając żadnej władzy nad nieformalnymi związkami, wprowadza „prawo”, które jakoby klasyfikuje (przykładowo) dwuletni związek nieformalny jako równy w świetle „prawa” małżeństwu, tylko co to oznacza? To znaczy, że para, nie rozwiewając takich przypuszczeń, dobrowolnie zgadza się być administrowana przez system sądowy, niejako dobrowolnie oddając władzę nad swoją unią i zapraszając (nieświadomie) 3 osobę – urząd i całą ferajnę cwaniaków. Kobieta bądź mężczyzna ma prawo korzystać z ustaw, jakie regulują instytucję małżeństwa w świecie korporacyjnym. W ten sposób próbują obejść prawo naturalne, dając pseudo-benefit w postaci „ochrony prawnej”, ale zapominając powiadomić, że para traci możliwość decydowania o swoim losie, a co gorsza, o losie swoich dzieci.\nJak to obejść? Bardzo prosto – na chłopski rozum i przy pomocy paru listów.\nJeśli nie ma oficjalnego związku, gdzie urząd jest administratorem, a cała ich jurysdykcja jest domniemana na zasadzie „nikt nic nie mówi, więc działamy dalej” wystarczy wystosować pismo polecone do odpowiedniego organu, który śmie twierdzić, że związek będzie regulowany ustawowo i zapytać o PROOF OF CLAIM, czyli dowód na to, że istnieje dokument, podpisany przez oboje: parę i urzędnika, gdzie para DOBROWOLNIE oddaje swój związek pod opiekę rządu. Nic takiego oczywiście nie istnieje! A potem należy pociągnąć urzędasa do odpowiedzialności.\nKtokolwiek robi tzw. CLAIM, czyli rości sobie prawo do czasu, pieniędzy, wolności itp. drugiej osoby – według prawa – ma obowiązek udowodnić swoje stanowisko – to jest podstawowa maksyma prawna.\nBURDEN PROOF LIES ON THE ACCUSER, w tłumaczeniu: „ten kto oskarża ma obowiązek udowodnić”.\nPrawnicy nie są uczeni prawa, oni są uczeni procedur, ustaw, i całej masy bzdetów, ale na pewno są nieliczni, wysoko, którzy kumają o co chodzi, i to jest wielka przysługa systemu dla nas. Ich głupota i niewiedza może być wykorzystana przez kogoś, kto potrafi myśleć i trochę poczytał.",
			"added": 1581947289
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1577790114_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "Sprawdzalem u siebie bez vpn jak i z vpn na roznych lokalizacjach. Nie smigalo wogole choc sam dodany material byl dostepny. Jest obecnie kilka zdecentralizowanych platform ktore mozna wykorzystywac jesli zeronet nie sprawdzi sie na 100 procent. Inna opcja jest napisanie od nowa czegos na wzor z udoskonaleniami dla nas.. \n\nWszystkiego najlepszego w nowym nadchodzacym roku :)",
				"added": 1577810824
			},
			{
				"comment_id": 2,
				"body": "Dosiego wszystkim :) \n\nA wracajac do testowego filmu to widze 3mb z prawie 32mb i poczatek moglem odtworzyc juz dzisiaj..",
				"added": 1577882078
			},
			{
				"comment_id": 3,
				"body": "uzupelnienie: moglem na spokojnie zobaczyc caly filmik plynnie. Czyli wychodzi na to ze musi byc stala grupa osob ktore beda w stanie seedowac , dodawac itd czyli tworzyc energicznie polski zeronet",
				"added": 1577901096
			}
		],
		"1578411043_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 4,
				"body": "Dziekowac za kolejna dawke informacji, mnie wychodzi podobnie .. Pozdrawiam",
				"added": 1578428950
			}
		],
		"1580479193_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": [
			{
				"comment_id": 5,
				"body": "@driud     Widzisz dokladnie tak, jakis procent  przeczyta ta calosc ale niestety bardzo maly odsetek zrozumie o co chodzi.. inni machna reka jesli panstwo sztucznie ich karmi czyli wszystkie dofinansowania za glosy... Gora doskonale wie jak dziala system i nigdy przenigdy tego nie ujawnia ani nie zaczna nauczac, nie wspomne o ogarnieciu swoich finansow, prawdziwej zakazanej historii itd.. mozna by jeszcze troche tego wymienic..\n\n@adam123 - takie teksty powinny trafiac do jak najwiekszej ilosci osob.. na dzien dzisiejszy to jest beton.. Pozdrawiam :)",
				"added": 1580723126
			}
		],
		"1580029310_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": [
			{
				"comment_id": 6,
				"body": "@nomads95 a cos wiecej mozna gwoli wyjasnien gdzie co i jak?",
				"added": 1581775933
			}
		],
		"1581694747_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 7,
				"body": "jak to mowia to co dajesz to dostajesz",
				"added": 1581776252
			}
		],
		"1581827701_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 8,
				"body": "Temat ogarniety :)",
				"added": 1581947324
			}
		],
		"1583077865_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F": [
			{
				"comment_id": 9,
				"body": "super dziekowac, ogolnie cala twoja robota swietna :)",
				"added": 1583595674
			}
		]
	},
	"comment_vote": {}
}