{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1622700855,
			"title": "How to decolonize the world from american colonial occupation?",
			"body": "It's really the question of the century. How to bring back the american regime to it's continent? In short it's about the Liberation of the Earth land ! \n\nOne thing I strongly believe in, is battlefield inversion. It concretly means that it's not efficient to fight and kill peripherical american occupational colonial forces. It's way more conducive to liberation to inflict degradation to their core. \n\nThe more their core weakens, the less sustainable their occupations will be, the less inclined their occupational colonial forces to fight for their dominance.\n\nIt's a liberation war in all domains, finance, technology, food, politics, taxation, armies... everything should be deamericanzied including near earth orbit, but most importantly culturally.\n\nIt's very easy to destroy the image of the usa, from the glitzing towers or superbe beach, just show the back alleys next doors... there you will see the real wastelands... it simply means to remove the lies and illusion of the \"bold and beautiful\" to plunge in the squalors of skid rows of america...\n\nfrom key west to jeffrey esptein rape resorts.\n\nof course from an economical perspective, a total boycott of all american controlled products is imperative, a boycott backed by ip theft, copy/paste and harvesting all that's needed.\n\nThere is no mercy, no respect, no tolerance, no pity nor mercy to have with colonial occupation feodal forces.\n\nFinally of course the shadow war must take hold, again executing the guards of their colonial outposts (embassies, consulates, cia hives) are useless... targeted killing of specific officers is way more producive.\nFinally I think they have never been weaker. Specially if just two entites join this war : china , EU...\n\nhowever it's not about building a post american global world order, rather to regain freedom, liberty, independence and sovereignty, aka to remove the global hegemon seeking our enslavement, demographic control, intellectual submission and cultural surrender.\n\nWhat do you think the Kremlin waiting for?\n\nOf course furthering the drive for liberty toward first the middle east to then extend it to africa.\n\nSo that finally the liberation of south america can proceed in good conditions, until the americans are back where they belong.\n\nfrom Jeffrey epstein to the election steal, from exporting their inflation with their usd reverse status, all this must end.\n\nand I believe there is no way to reform america. it's way too gone. \n\nthe goal is to be able to manage and withstand the fall of the empire, and protect the earth land from the desperations acts that the american establishement ruler and extractors of this colonial occupation feodal project seek toward the earth land.",
			"added": 1622700854
		},
		{
			"topic_id": 1622704505,
			"title": "How to counter strike american sanctions following taxing silicon valley?",
			"body": "it's a three layer operations : 1) open source free software paid by those taxes, webbrowsers (open sources, ads destroying, tracking annihilating) and hardware 2) a psywarfare campaign against all american interests, from the toxic fast food, to anything they could value... everything. afterall the treasonous media could wage the covid plandemic, they can as easily destroy the pereception of the usa. 3) understanding that liberty, isn't an american value, and it means defeating the control freaks that the americans occupational forces love to support in the eu, knowing full well the drawning effect of liberty. and that's for me the hardest part in the old continent... \n\nAs such again the goal, isn't to find an understanding with a people who rapes kids, who seek demographic control, financial supremacy and military hegemony, absolutely not, but to win by getting to a positive asymetric position.\n\nthen start to limit american investment in the eu... again hurt them where it counts.",
			"added": 1622704503
		},
		{
			"topic_id": 1622735239,
			"title": "Don Lemon \"we shouldn't let the minority rule the majority\"",
			"body": "Dear don lemon,\n\nIf there was a single hope toward the restoration of a credible republic in the former us of a, you would be  among those I would capture to understand precisely how the coup, the election steal and the preparatory strikes on the american people was executed.\n\nI understand thusfar that the group you represent used critical race theory, blm or more exactly the consequences of the drug war, constant physical intimidations against red capers, burning summer operations and the release of a bioweapon vector to remove pedotrump from power.\n\nAs we are clear on what you contributed to achieve in the usa, here is my little message to you and your bosses, and that included obama...\n\nyou put the lives of your children on the line, if you dare to advance toward us. we saw the american people children rape, the people fall, weak, coward, submissive and docile.\n\nin short words : it will be a front line issue.\n\nDon't tread on us.\n\nps who knows whose this us stand for, certainly PRC, most probably the Russian Federation, and maybe one day who knows even the EU...\n\nI see you as an enemy, and can't wait to defeat those standing between you and us (dod, fbi, cia, nsa, mercs, what ever) to finally execute you.\n\nRest assured, it will be LEGAL.\n\nvictory belongs to me.",
			"added": 1622735236
		},
		{
			"topic_id": 1622736697,
			"title": "the most pathetic, pityfull rant I have seen in years... harrison ford of infowars",
			"body": "\"we are the american people, we are strong, we won't let our selves be run over\" little shaky fists...\n\ndude, go back to your home...\n\ntalibans only said:\n\nthey have watches, we have time...\n\nunderstand?\n\nso go away with your myth, your self belief, your narrative, you are just a serfs, who is too big cognitive dissonance, to accept that you like, just to pretend to be free... a poser...\n\nyou aren't born free, you become it... \n\nmaybe you will grow up, but first, you have to admit your failing, and that this people myth is just a lie...\n\ngo back to work, little tax cattle...",
			"added": 1622736693
		},
		{
			"topic_id": 1622791137,
			"title": "I am not receptive to the CO2 (plant food) narrative, however I am a big fan of energy independence....",
			"body": "co2 is cool... plants love it... feed on it, and release o2... \n\nhowever energy dependence is weakness, treason, stupid etc...\n\nit's funny how one narrative is submission, surrender, unoism wrapped in marxism...\n\nthe other is progress, power, energy, do it, can do, and more, as liberating and freeing ! for Moar !\n\none leads to the uno agenda 2020 of harming the advanved economies to make them surrender to the population waves of the third world, \"harmonization, syncronization, reducing inequalities intra state)\n\nwhile the others is progress, technological gap, leaving behing in the dust etc... like those who had the wheel vs the savages... still there trying to move a log, by raising it up.... (loL).",
			"added": 1622791132
		},
		{
			"topic_id": 1622800027,
			"title": "Opposing the Global Tax of the failed states is the duty of all state offficials of not ruined states...",
			"body": "what is this uno crap, where failed and ruined states like france and usa, hide behind?\n\nyou have spent too much, on too much unproductive crap.\n\nyou have failed.\n\nyou have to restructure.\n\nyou can't export your failed statism, your state arrogance, your corruption to the rest of the world...\n\nIreland is interesting... but it's not the problem.\n\nthe problems are those silicon valley bastard who always find ways to fuck everyone... and as such the idea to tax them is just that it's first of all PUNITIVE ! for the regime change of the democratic will of the american people who elected again pedotrump... (jail him for that, not for some shit, aka being pro america) \n\nI don't get it...\n\nI am curious to see who will stand against this global world worder...\n\nI won't be surprise that the shia will try to subvert it knowing they stand no chance agains the Sunnah...\n\nwho else?\n\nare we going to destroy the SEDZ (special economic developpment zone of PRC) for again this one world gov take over attemt?\n\nthe end point : nancy pelosi assets must be repossessed, including her ice cream collection... that's it (and jail and kill the pedos, where ever it leads, the gmo toxic food, the emf fry thy cells nazis, the silicon valley corralers..., I mean the list goes)...\n\nwhat is this attitude of wanting to rule the world in one way...\n\nisn't this plandemic enough?\n\n\nyou really are so dumb and corrupt to not see the problem of a one world gov? you are so ignorant of history and so illeterate in finance : not all your fucking eggs in one basket you monkey...\n\n\nI don't want third world shitsters to tell me how to live, what to consume, what to say, and worst to have to dispose of anything I could ever own, as their global gov \"divine\" right...\n\nwhat is this fuckery!",
			"added": 1622800021
		},
		{
			"topic_id": 1622800126,
			"title": "Denmark block Bitchute !!!",
			"body": "what the fuckery ! it's unbelievable, how cleary the authoritarian can only be saved by death... go away with your censorship, go away with your control freakism, you belong in mental institutions, you are a threat to world peace, harmony, stability and understanding...",
			"added": 1622800119
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1622700855_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 1,
				"body": "I think it's a good step to tax massively all american digital companies, from facebook, to google, to everything... however it's just a step necessary to weaken them, by inflicting to them yuge legal cost (rest assure the greed and betrayal of american lawyers is unsurpassed in the known history of the world) to then be able to really start the web 2.0 revolution.\n\nAgain recloning a european corral digital model is doomed for failure. fundamentally it's about being able to understand the extractive, colonial, feodal, corraling mindset of the americans, not to reproduce it, but to provide the tools for liberation. \n\nonce you understand the meaning of open source, there is nothing you can do against it. I would go as far as use taxes taken back from the american enslavers and destroyers to use them to finance some open source projects... \n\nyou seek to end poverty? by corraling people into american extractive electronic system? or by providing superior open source tools permitting to leave them in the dust? if the aliens start to drop their latest small arm system on earth, who will still want an ar-15?\n\nthat's the whole point... the end goal is to achieve full on domination against the rulers of D.C. to be able to look them as voracious deviant wicked and more importantly weak thermites, whose existence hang by OUR DECISIONS.\n\nI want to submit america, not to use it, but so they can't ever dominate us again.",
				"added": 1622701329
			}
		],
		"1622654492_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE": [
			{
				"comment_id": 2,
				"body": "> [robione](#comment_652_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): NASA - Not A Space Agency (mostly theatre)\n\nhaving listen to those guys, they are ready at the first financial incentive to betray usa... I don't think the draft will necessitate extraction teams, just bigger financing for their projects... and they will beg to join.",
				"added": 1622701434
			}
		],
		"1622704505_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 3,
				"body": "they are after all just a small island isolated by two oceans...",
				"added": 1622704615
			}
		],
		"1622735239_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 4,
				"body": "ps I love war, I find psywarfare gay.",
				"added": 1622735259
			},
			{
				"comment_id": 11,
				"body": "only .onion, clearnet is gay.",
				"added": 1622790936
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 5,
				"body": "> [ostov](#comment_2_1JMFHri3FtAMY2CFhiL9yH62igSh4Nzq3s): Russians hate Putin. It's fact.\n\nlow iq russians, maybe.",
				"added": 1622735366
			},
			{
				"comment_id": 6,
				"body": "WooooW... the low IQism i n the russian financial and telecom sector is mind blowing ! what did I saw? two happy fat trying to lure bear... I am sorry... but the VTB guy and MTS guy, ousted !\n\nwho the fuck are those people trying to trick? \n\nthere is only gazprom, mig, sukhoi and bestmarket.tv who rocks...\n\nwhy are those fuckers some kind of authoritarian with happy faces?\n\nsewering\n\nto teach them how fast the markets move\n\nI fucking not happy with what I saw...\n\nmore that their authoritiarian and or health dangerous ideas, it's the attitude...\n\nstate leech, state privileged, uncompetitive...\n\nsorry...\n\nat least they have no chance to make the cut to the Kremlin Throne :)\n\nfor example regarding VTB... try to open an account with them... and what do they say? we want millions... go fuck yourself even if I had them...\n\nlearn to build trust with micro amount... heard of microES? microBTC? micro what ever?\n\nso the little algo can learn to pown the beasts... \n\nit's libertarian vs authoritarian... and in this time, they hide with smily face...\n\nsorry... but negative rating.\n\nand the sucker who want to beam through me high intensity pulsated emf energies... 5G... go away, destroy your cells yourself.\n\nagain, I can go to america, with almost nothing or HK, say hello, two pieces of papers and rules... \n\nrussia = bad (not putin, not the state, but those corporate \"leader\"...) what the fuck are the board doing...\n\nin comparison even diamon appears to be a genius (and he is at the bottom of the pack :D).\n\nwithout the kremlin support does guys don't stand a chance.",
				"added": 1622790001
			},
			{
				"comment_id": 12,
				"body": "say what ever you want, but Kodorovsky was among those men who could have reached the throne... he just missed the KGB training... sadly :).",
				"added": 1622791462
			},
			{
				"comment_id": 14,
				"body": "seriously the problems with VTB :\n\n1) it's the MARKET who decides what it wants, not fucking you, you are nothing, an intermediary waiting to be disintermediated.... understood? or you can be a facilitator of what people want, like serious financial markets, like chirak, hk or even luxury switzerland... \n\n2) secondly the CLIENT IS KING... and it comes to first, who cares if it's 0.01 cent of a ruble the guy want to start to save/invest... you are nothing to decide, to say no, to oppose, to try to pose as I don't know what. who knows, if 1 trillions doesn't goes after it... but if already you can't return this 0.01 cent, it poses serious question to even send a second one cent.\n\nahhh but mr is a globalist... a wannabe globalist even worst... you don't get it... \n\nwe don't want a jpmorgan clone, a stupid organization lame compared to the original, unable to execute worldwide, pretending and posing, while having read the books written by them... something original, new... not a second hand copy...\n\nexample the guys in chirak, brutal and glacial as they may be, it works... they listen, just don't have time for bullshit... move on, go... \n\nexample the guys in hk, they learned from the best, cloned and improved ! beating them (trying) at their own game...\n\nexample the swiss, they may be luxury in execution, you can do 1000x time in both first, but your cows will be there... healthy and well treated... again with 2 papers I could open an account with even no money, with no fees...\n\nnow russia\n\nthe guys believe to be some kind russian top model... so they want your passport audited by their embassies, millions of dollars to just think about opening an account, and speak english as vultures would do... aka non existent... and worst of all, they pretend to be smart, because they read and rehashed a mankew edition 9... pathetic fuckers...\n\nwithout the kremlin, those peons wouldn't stand a second... \n\nand the question why this mindset? why this weakness? why this competitiveness? and beyond all this arrogance?\n\ngazprom and all the other extractors can finance themselves... btw.\n\ndennic3 out !",
				"added": 1622800847
			},
			{
				"comment_id": 16,
				"body": "ps if it's possible to disintermediate your biz it's means it's now a weight on the economy, that you are a leech, and will be removed... you can erect little legal walls, in state cronyism operations, you just make and prove your whole market to be rigged... \n\nremind me of why russia was so archaic and backward before the bolshevicks... ahhh... I guess we start to find a problem... \n\nwas it so hard to introduce potatoes? or I guess the peasants, those despicalble little russians who don't eat caviars at will, they they had the clairvoyance to understand the power of the potato... I guess some even tried to forbid potato introduction ala vtb, to protect their little corral?\n\nlame... \n\ndisappointing and dissappointed.",
				"added": 1622801543
			}
		],
		"1622537604_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk": [
			{
				"comment_id": 7,
				"body": "> [randname666](#comment_70_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): Believe or not, education itself is a very ineffective thing. Public education system is not there for transmitting knowledge, but more just as a society stablizer.Those who aren't suitable for receiving education shouldn't receive education in the first place, since it's both a torture for themselves, and a waste of educational resources for society and country.\n\nI personally, don't understand how I could seat for so long... at least in high school it was possible to pose questions all the time, if wanted, with follow up questions, until the verdicts was clear, maybe... who knows, at least the topic of exam was clear... the further I went the more submissive it became... the less interogatory, the more it was it's the dogma, surrender... \n\none thing I would add, is that at least once side of each classroom should have windows... I saw a lot of clip of american school being 4 walled, and fluo light... I mean raw torture... even in gitmo they had better conditions...\n\nthen the problem with low iq teacher, I was lucky with high school included, to have individuals really open to discusion... and the coolest thing was when a low iq had technical question on what ever, it was possible for him/her to receive the time necessary to fill his/her understanding gap, while those not involved could simply talk, with moderate sound making, about anything... making the whole experience way more positive...\n\nthen what I don't really get is the concept of 500 persons in an auditorium, to have to shut up, no question (I mean at 500+ I understand it's not possible) so the \"lecturer\" aka bot, can just speak and speak and speak, aka spew is bullshit unhindered for generations... as himself was a trainee of a previous speaker...\n\nanyway...",
				"added": 1622790363
			}
		],
		"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 8,
				"body": "> [randname666](#comment_71_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): You cannot defeat any ideology, conception of history or philosophy -- because they are basically theology after all, which means unrepeatable and unfalsifiable. There is only believe in or not -- and the result of not believeing in could  result in something similar to being roasted alive on a crucifix. [...]\n\nsadly you are right... however there must be a way other than throwing them in the oceans from large aircraft... \n\nthey are theology, like unoism... \n\nwhat I mean is that both group marxism and unoism are the real terrorists !\n\nat least with islamist of all stripes, it's very clear, here is the book... \n\nyour side , my side. at least it's workable.\n\nthe problem with the unoism or marxism is that they seek by all means to take over my side.\n\nthey can go fuck themselves...\n\nand what I hate even more is the young marxists who have revelation and now seek liberty...\n\nI mean, you failed, stay behind.\n\nand worst you throw them 2 shekels, and like bernie sanders they will defend their propriety even with the 2ndA...\n\nbut you are right, ignore, ignore, ignore... but not too much... so they don't spread, infect...\n\nokay. let's reformulate :\n\nhow to prevent marxist / unoism infection?\n\nafterall it's a disease... theological diseases.",
				"added": 1622790636
			}
		],
		"1622777764_1NV2bkBW46zh6RrNVHCu7YpGhFPBfqxLrJ": [
			{
				"comment_id": 9,
				"body": "emeraldcoin?",
				"added": 1622790715
			}
		],
		"1622777378_1NV2bkBW46zh6RrNVHCu7YpGhFPBfqxLrJ": [
			{
				"comment_id": 10,
				"body": "vistors of rome can keep their clothes, costumes, and customs (those not interfering with the roman laws, aka don't cook a roman in the forum in your cauldron), however if you wanna live rome, forget everything you knew and believed to be true.\n\notherwise, you will be a savages, or barbarians and reduced to slavery, jailed, murdered, and even used for entertainment purpose, classified as a subversive invader... in short bad idea, leave and return to your homeland.\n\nand I don't give a shit if your homeland is a shithole, rome was nothing too, once upon a time...",
				"added": 1622790905
			}
		],
		"1622800126_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 13,
				"body": "lol not even peers for \"dansk\"... lol... what a failed submissive failed state made of little authoritarian, state terrorists, wanting to control everything about anything... pathetic.\n\ntime to inverse this windmill producer to some more intelligent and free place... ireland?",
				"added": 1622800195
			}
		],
		"1622800027_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 15,
				"body": "I can't wait for the tax collector to come to afghanistan, to assert their sovereignty over the taliban coffers... ahahahah... you will be shredded.",
				"added": 1622801337
			}
		]
	},
	"comment_vote": {}
}