{
	"message": [
		{
			"body": "Bonjour à tous. Oui, il est très bien. Il permet d'éviter la censure. De quoi souhaitez-vous parler?",
			"date_added": 1621674886700
		},
		{
			"body": "C'est souvent très calme.",
			"date_added": 1621675198400
		},
		{
			"body": "Serais-tu d'accord de m'aider à améliorer gratuitement mon ortographe? Je fais souvent des fautes.",
			"date_added": 1621675272900
		},
		{
			"body": "Oups, un h m'a échappé précédemment. ",
			"date_added": 1621675449800
		},
		{
			"body": "Souhaiterais-tu peut-être précisé \"d'un peu de tout.. Tout ce qui est mal vu sur le web classique\". Je ne comprends pas bien ta compréhension de \"mal\".",
			"date_added": 1621675698800
		},
		{
			"body": "_préciser",
			"date_added": 1621675721800
		},
		{
			"body": "MDR @vivelaweed, j'espère que vous vous rendez compte de la gravité de l'infracton pénale que vous venez de commettre sur ce chat decentralisé et incensurable? Personnellement, je pense que la mariejuana rend moins con... ",
			"date_added": 1621962513500
		},
		{
			"body": "@latraitresse Je suis navré d'avouer que maintenant que j'y pense cela me choque d'envoyer des droguées en prison pour l'utilisation d'une plante de la création.Cela démontre à quel point les gens (de toutes les nationalités @vivelaweed) sont cons, faibles, fragiles et influençables @raspberryman.  Déjà entendu parler d'Ivermectin? Combien de mort avec l'hydrocholoroxine? chuttt... Madame Buzin a certainement encore besoin d'argent... beaucoup d'argent, quelques piècettes ne suffiront certainement pas à combler son avidité.",
			"date_added": 1622363673400
		},
		{
			"body": "L'UE va tellement devenir une dicature... c'est garantie, même pas de constitution, que de fausses valeures dites humanitaires (leurs droits de l'homme) avec que des exceptions... genre tu peux pas faire une \"quenelle\" ou faire pousser des plantes, et le plus drôle ca se prétend libre quand tout ce que ça veut ce petit du monde c'est du fric pour enculer leur pigeonnes et nourrirs leur marmots sur le dos des honnêtes gens. Vivement la gande purge, ou tous ces EUnazis vous finir executer comme des animaux qu'ils sont en réalité...",
			"date_added": 1622394917700
		},
		{
			"body": "question pour les mongos? les antimondialistes, ils savaient pour la dictuature planétaire? ou c't juste \"le grand capital\"?",
			"date_added": 1622395092600
		},
		{
			"body": "@raspberryman ils sont censurés parce que la police ne fait pas son travail... 101. ils preferent faire chier a des pauvres fumeurs de shit que d'enquêter sur les puissnats, comme agnes buzin et sa bande... de toute manière la police francaise c'est fini. mort. y a deux choix : ou la police europenne (marche pour la dictature mondiale, fusion des polices continentales) ou la police islamic. au choix, la 2eme. au moins eux ils ont des lois...",
			"date_added": 1622395563600
		},
		{
			"body": "@raspberryman mais t'inquiêtes, dans les 2 cas, tant que tu fermes ta geules et obiés aveuglement aux ordres, t'auras ton salaire, ta pute et ta pension. mais fermes ta geule. okay? okay cool... a+",
			"date_added": 1622395664900
		},
		{
			"body": "je dis dans les 2 cas police euro ou police globale... l'autre, c'est un autre monde... personne ne sait :).",
			"date_added": 1622395699400
		},
		{
			"body": "après le sable, l'ireland... invasion /on.",
			"date_added": 1622651105200
		},
		{
			"body": "shoot to kill... invasion, take down, la totale... montrez nous... ils devraient pas durer longtemps ces hipsters... real munitions et des croissants pour le petit dejeuner... fau qu'ils payent, eux , les fils de putes de la silicon valley, faut les detruire.",
			"date_added": 1622651167800
		}
	]
}