{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Preparação para o ENEM(Exame Nacional do Ensino Médio)",
			"body": "O Exame Nacional do Ensino Médio é uma prova realizada pelo Ministério da Educação do Brasil, criada em 1998. Ela é utilizada para avaliar a qualidade do ensino médio no país.",
			"added": 1549816594
		}
	],
	"topic_vote": {
		"1_17fZnf1CuRuyJM3UbVDs2ogwoPUYnDRwGj": 1
	},
	"next_comment_id": 22,
	"comment": {
		"3_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": [
			{
				"comment_id": 1,
				"body": "Avalia-se a inteligência de um indivíduo pela quantidade de incertezas que ele é capaz de suportar.\n\n- Immanuel Kant",
				"added": 1549810440
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 2,
				"body": "#História Eclesiástica\n\nA História Eclesiástica de Eusébio de Cesareia foi uma obra pioneira do por tratar de um relato cronológico do desenvolvimento do cristianismo primitivo entre o primeiro e o quarto século. Ela foi escrita em grego koiné e sobreviveu também em manuscritos em latim, siríaco e armênio.\n\n- https://web.archive.org/web/20181228034118/http://www.nazarenopaulista.com.br/estudos/Historia_Eclesiastica_Eusebio_de_Cesareia.pdf",
				"added": 1549810512
			},
			{
				"comment_id": 3,
				"body": "#Hipátia\n\nHipácia, também conhecida como Hipátia, nasceu na cidade de Alexandria, então o caldeirão cultural da região que hoje corresponde ao Egito, em cerca de 355 d.C. Ela era filha de Theon, famoso filósofo, astrônomo e mestre de matemática no Museu desta cidade; graças a sua influência ela se destacaria no cenário intelectual posterior.\n\nAdepta da corrente neoplatônica, Hipátia cresceu em um contexto repleto de vida cultural e filosófica; ela mantinha estreitos vínculos com a figura paterna, fonte de seu saber e de sua incessante procura de soluções para os eventos ignorados. A filósofa, mulher guerreira, pioneira na arte de desbravar os árduos caminhos da Matemática, cultivava não somente um cérebro privilegiado, mas também o corpo saudável. Visava, assim, implantar em sua própria existência esta antiga aspiração helênica.\n\nHipátia se tornou a maior pesquisadora da Alexandria nos campos da matemática e da filosofia, legando ao futuro grandes descobertas nestas disciplinas, bem como na física e na astronomia. Ela se devotou igualmente à prática da poética e ao exercício das artes, sobressaindo-se na Retórica.\n\nEsta mente brilhante cursou a Academia de Alexandria e, com o tempo e o domínio das mais distintas áreas, transcendeu as próprias conquistas paternas, mas deve muito ao pai, que sempre a estimulou a vencer qualquer obstáculo que tentasse impedir seu acesso ao saber, mesmo que se tratasse de qualquer princípio de fé ou de credo.\n\nNa adolescência ela foi para a cidade de Atenas, atual capital da Grécia, com o objetivo de concluir seus estudos na Academia Neoplatônica. Aí Hipátia logo ficou em relevo, por suas tentativas de unir a matemática do algebrista Diofanto ao neoplatonismo de Plotino. Melhor dizendo, ela empreendeu a adequação da razão matemática à ideia da mônada das mônadas, cultivada pelos adeptos do neoplatonismo.\n\nDe volta para sua terra natal, foi lecionar na Academia que havia cursado, conquistando justamente a cadeira anteriormente ocupada por Plotino. Ao completar 30 anos, Hipátia já atingira o posto de diretora desta escola. Ao longo deste tempo ela criou várias obras e se popularizou por resolver intrincadas questões da matemática.\n\nNeste quesito a pesquisadora sempre atendia cientistas perdidos na resolução de seus problemas, e poucas vezes os deixava sem respostas. Esta busca se transformou em ideia fixa para Hipátia, que nunca contraiu matrimônio, pois já se considerava unida à procura da verdade.\n\nInfelizmente essa trajetória brilhante teve um desfecho sinistro, que parece ter se configurado a partir de 412, com a ascensão do patriarca Cirilo ao poder. Ele era um cristão fanático, árduo defensor da Igreja e acirrado adversário dos que ele considerava serem hereges.\n\nNeste contexto, os ideais científicos de Hipátia a convertiam em alvo fácil para Cirilo, principalmente sua crença neoplatônica, sua religiosidade vista como pagã, seus pontos de vista sobre o Cosmos. O fato é que ele contribuiu para que o povo de Alexandria acreditasse que ela estava por trás da recusa do Prefeito da cidade, seu amigo, em reatar os laços com o patriarca; ou, segundo outras versões, por sua amizade com esta autoridade, ela teria atuado como bode expiatório, uma vez que Orestes seria responsável pela morte recente de um monge.\n\nComo resultado destes boatos, Hipácia foi violentamente atingida por um grupo de desvairados cristãos repletos de ódio. Eles a levaram para o interior de uma Igreja e lá extraíram sua pele com conchas, cortaram-na em pedaços e os queimaram, em 415 d.C. Vítima de uma vingança ou de um surto de intolerância, Hipátia seria imortalizada pela posteridade.\n\n#Fontes:\n- http://pt.wikipedia.org/wiki/Hipátia\n- http://www.librarising.com/spirituality/hypatia.html\n- http://sexoforte.net/mulher/index.php?option=com_content&view=article&id=219:hipacia-de-alexandria-o-direito-de-pensar&catid=79:grandes-mulheres&Itemid=113",
				"added": 1549810567
			},
			{
				"comment_id": 4,
				"body": "#Mulher semilendária, Hipátia foi a primeira matemática\n\nÉ celebrada como a primeira matemática da História. Mulher de forte personalidade que, numa sociedade masculinizada, reuniu à sua volta um círculo brilhante de discípulos que a admiravam. Quem foi Hipátia de Alexandria?\n\nAs fontes históricas são escassas. Pior, sua vida e as trágicas circunstâncias de sua morte fizeram dela ícone de causas diversas, até contraditórias, nas quais ela, provavelmente, não se reconheceria. A lenda ocultou os fatos.\n\nPara os filósofos pagãos da fase final do império romano, representou a resistência ao cristianismo. Na Idade Média, foi convertida em símbolo do cristianismo: aspectos de sua vida foram incorporados à lenda de Santa Catarina de Alexandria (que dá nome ao estado brasileiro). Para os pensadores do Iluminismo, simbolizou a oposição ao cristianismo. No século 20, foi reinventada como precursora do feminismo.\n\nHipátia foi assassinada em 415, mas o ano do seu nascimento não é conhecido: estima-se que tenha sido por volta de 355. Era filha de Téon de Alexandria, matemático e astrônomo de renome e diretor do Mouseion, prestigiosa escola de elite onde era ensinada a filosofia neoplatônica.\n\nBoa parte do pouco que sabemos sobre Hipátia chegou pelos escritos de seus discípulos. Ela atraía admiração generalizada, tanto pelos ensinamentos quanto pela autoridade moral, inclusive a frugalidade de sua vida e vestimenta, e a virgindade que teria mantido durante toda a vida.\n\nNão há evidências de que alguma vez tenha deixado Alexandria. Não era um ambiente democrático: em consonância com o pensamento de Platão, professores e alunos do Mouseion evitavam contato com as massas, que consideravam incapazes de compreender o conhecimento elevado.\n\nAcredita-se que parte do “Almagesto” do astrônomo Ptolomeu que chegou até nós é de autoria de Hipátia. Ela também escreveu comentários à “Aritmética” de Diofanto e aos trabalhos de Apolônio de Perga sobre seções cônicas, que se perderam.\n\nA vida e obra de Hipátia foram ofuscadas por sua trágica morte. Logo após ascender ao bispado de Alexandria, o futuro São Cirilo perseguiu os que não seguiam o cristianismo ortodoxo. Quando se voltou contra os judeus, estes contaram com a proteção do prefeito (governador militar) Orestes, talvez porque ele se ressentisse do poder crescente do bispo.\n\nNo conflito entre os dois, Orestes foi apoiado por personalidades influentes de Alexandria, com destaque para Hipátia. Acusada de ser obstáculo à reconciliação, denegrida por propaganda entre as massas populares (por quem nunca se interessara), em março de 415 ela foi atacada na rua por partidários de Cirilo. Os relatos de seu assassinato às mãos da multidão variam, mas todos são muito violentos.\n\nApesar de embaraçoso para a Igreja, o episódio não impediu a canonização do bispo.\n\n- Fonte: https://folha.com/jez32ay9",
				"added": 1549810731
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 5,
				"body": "#PAPMEM - Janeiro de 2019 - Noções de Estatística\n- https://youtu.be/wmrVbJq0Tus\n- Exercícios: https://anonfiles.com/saqd15tfb3/Exerc_cios_-_Estat_stica_zip (SHA1: e15536ad524266bb9efbffcf09e6ae55f5ca37f6)",
				"added": 1549812277
			},
			{
				"comment_id": 6,
				"body": "#Revisão de matemática básica\n- https://www.youtube.com/playlist?list=PLjNDdMKtfqVl3vkUj7EVu5TmTZj7Opux7",
				"added": 1549813922
			}
		],
		"1_17fZnf1CuRuyJM3UbVDs2ogwoPUYnDRwGj": [
			{
				"comment_id": 7,
				"body": "#Curso de História para o ENEM\n- https://www.youtube.com/playlist?list=PLMra4G0-Z7pMYLE-D-ptnHt1IW_Y1hn8H",
				"added": 1549816636
			},
			{
				"comment_id": 8,
				"body": "#Matemática do ENEM\n- https://www.youtube.com/playlist?list=PL83s8LGM84J7BleOijgmomYatONEeAawi\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdgCfgrnyT2jmFXGupiDL8aO",
				"added": 1549816881
			},
			{
				"comment_id": 9,
				"body": "#ENEM | Biologia\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdgu7TOyarRBU42MXOrUJnOS",
				"added": 1549816951
			},
			{
				"comment_id": 10,
				"body": "#ENEM | Química\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdj_YFEHTaBDccdSCC1LVNH0\n- https://www.youtube.com/playlist?list=PLF2J-8QoLzYGj08pCRhjb_1hTl8R1LJjJ",
				"added": 1549817057
			},
			{
				"comment_id": 11,
				"body": "#ENEM | Física\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdiG6QR-LpXXbUYzPz5rOhF2",
				"added": 1549817119
			},
			{
				"comment_id": 12,
				"body": "#CURSO DE REDAÇÃO\n- https://www.youtube.com/playlist?list=PLhFNxzLJLH3sUihLp7SpjYyf150XcbBpS",
				"added": 1549817193
			},
			{
				"comment_id": 13,
				"body": "#ENEM | Literatura\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdhWCEOQKTf8tEM568D_-PHt",
				"added": 1549817248
			},
			{
				"comment_id": 14,
				"body": "#ENEM | Português\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdiy2Xhd1Tn4_q974HxDUzox",
				"added": 1549817349
			},
			{
				"comment_id": 15,
				"body": "#Filosofia para o ENEM\n- https://www.youtube.com/playlist?list=PLMra4G0-Z7pOBZjKCxen5cRa6iUMAdYKh",
				"added": 1549817399
			},
			{
				"comment_id": 16,
				"body": "#ENEM | Sociologia\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdhgZGd24rHqVGVI04ips2-C",
				"added": 1549817433
			},
			{
				"comment_id": 17,
				"body": "#ENEM | Geografia\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdhJ59r8q7B7OYpSJpLi7c6c",
				"added": 1549817532
			},
			{
				"comment_id": 18,
				"body": "#ENEM | Espanhol\n- https://www.youtube.com/playlist?list=PL8vXuI6zmpdgygmHqu3IYXcMBQTJhmLJc",
				"added": 1549817656
			},
			{
				"comment_id": 19,
				"body": "#Inglês no ENEM: Como Estudar?\nO professor Daniel Sanches dá uma super dica para quem escolheu Inglês como Língua Estrangeira no ENEM. Assista e descubra diferentes formas de estudar a disciplina.\n- https://youtu.be/fBlNWGpB_Pk",
				"added": 1549817825
			},
			{
				"comment_id": 20,
				"body": "#Curso Enem Gratuito\n\n- https://www.youtube.com/channel/UC_53VGoH_0XLFmYVpGMvhvg",
				"added": 1549818374
			},
			{
				"comment_id": 21,
				"body": "#Projeto Medicina\nO Projeto Medicina é um site dedicado aos estudantes que se preparam especificamente para os vestibulares de Medicina no Brasil.\n- https://projetomedicina.com.br/",
				"added": 1549818409
			}
		]
	},
	"comment_vote": {}
}