{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1519815258,
			"title": "CD Talk - A forum for CD",
			"body": "http://127.0.0.1:43110/1CD4uCgXYwfMU7bVPd5VQLzoZDoeLXpogc\n\nThis forum is for people with interest on CD to make friends and meet up.\n\n偽娘愛好者的零網 (Chinese meaning of the above sentense)",
			"added": 1519815257
		},
		{
			"topic_id": 1520816454,
			"title": "Where can I find the private/sign key of a cloned site?",
			"body": "I forked Zero Talk from the WebUI, at the begining, I can sign and publish without being asking for the key.\nWhen I try to do it at another device, of course I am asked to provide the key. But where can I find the key?\nI tried to look in the content.json from the original device, tried different string I can find there but no luck.",
			"added": 1520816452
		},
		{
			"topic_id": 1521297761,
			"title": "[closed] How to correctly change the site address?",
			"body": "I got a pair of public/private key of the site using vanitygen.\nThen I copied the old site's folder to the newly generated site's address (folder).\nAfter that, I did find-and-replace on all the files in the new site to replace the old address to the new one.\nThen I sign and publish the new site using the command `zeronet siteSign <address> <privatekey>`.\nFrom the comand line output, it seems to be successful.\n\nHowever, when I access the site using other device, it failed to load the new site even when it say it found one peer.\n`content.json download failed`\n\nCurrently, I can only access the new site from the device that did the 'rename' process.",
			"added": 1521297758
		},
		{
			"topic_id": 1522343117,
			"title": "How to get more people on Zeronet ?",
			"body": "Zeronet is functionally close to perfect for me.\nHowever, for social purposes, like chatting, matching (dating, job, coworking), it hasn't reached critical mass.\n\nWhat can we do to speedup the spreading of zeronet ?",
			"added": 1522343113
		},
		{
			"topic_id": 1525815821,
			"title": "ZeroUp limitation and suggestion",
			"body": "Currently [ZeroUp](127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/) only allows files larger than 10 MB.\nAnd it only support little file type, e.g. some of the video format, image format and zip.\n\nSuggestion:\n. allow smaller file (e.g. video, I had an video of 9.8 MB, I end up appending dummy data to the end of the mp4 file...)\n. allow more (or all) file type (e.g. PDF, wrapping it in a zip is a unhandy hack and will force user to download it rather than access from the browser directly)",
			"added": 1525815816
		},
		{
			"topic_id": 1527813349,
			"title": "Failed to publish [Need Help]",
			"body": "In the past, I could create a new site and publish it to some peers.\n\nIn the current setting, I can no longer do that.\n```\nYour network connection is restricted. Please, open 33112 port\non your router to make your site accessible for everyone.\n```\nI am using mobile phone data shared from the phone to the laptop.\nAlso tried to use tor on the laptop, the tor browser works but failed to let zeronet connect via tor.\n\nAnyone tried to publish a site on laptop via using mobile data shared from Android Phone hotspot?",
			"added": 1527813343
		},
		{
			"topic_id": 1569577856,
			"title": "Losting links to other zerome hubs",
			"body": "I just reset my zeronet setting, only users.json is restored.\n(Actually I only deleted sites.json)\nNow I cannot find the post of other users, even mine we made on other hubs, since the default zerome only links to the moon hub\n\nI know this issue has been discussed for long, but it's still not solved.\nA workaround is to have \"a list of other hubs\" on the zerome zite (I know this is a centralized approach).\nA slightly better workaround is to have \"some lists of other hubs\" on zerotalk, so I can search for them from the zeronet home page.\nA better fix as mentioned on the github is to prompt the user to add corresponding hub when I click on a link to \"user from other hub\" from a post (from the default hub / moon hub)",
			"added": 1569577848
		},
		{
			"topic_id": 1601116187,
			"title": "Which zite do you prefer for video sharing?",
			"body": "Big Kopy Kate?\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/\n\nKopy Kate Big?\nhttp://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/\n\nYoutube ?\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/\n\nOther?",
			"added": 1601116178
		}
	],
	"topic_vote": {
		"1516596886_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": 1,
		"1518794232_1EauY5Qr9U4YF4JCq8VDnfh6guT75sh4S6": 1,
		"1522753244_15KMTQ3uN5DvjfLfKgxZR4nbxKA1mYbz3w": 1,
		"1527378824_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": 1,
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1570177598_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": 1,
		"1573036387_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1,
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1579592713_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 53,
	"comment": {
		"1518611395_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "I support using web mining, in the non-p2p world, the publisher are paying a lot, for server cost, DNS fee, and most importantly, hiring for content creation.\nEven when we are in the world of NDN (named data network), the service provider still need to provide resources of computing and networking.\n\nI appreciate coinhive's recent strategy of suggesting the site owner to gain explicit approval from the browser user before doing mining.\n\nOn the other hand, coinhive is taking 30% of the mining profit, which is very high comparing the ordinary mining pool.\n\nTo ad block users, blocking coinhive will not really helps, the site can host their own pool, in this case you cannot distinct 'mine request' from 'content request'. It just add extra work to both parties.\n\nLet's face the face that some people are serving over the network for other's goodness, others are serving in exchange for their own goodness. Similar to the case that some software are open sourced, some are proprietary. Blocking ads is kind-of against the terms of usages for the sites.",
				"added": 1518784982
			}
		],
		"1518716348_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ": [
			{
				"comment_id": 2,
				"body": "I am currently under a no-freedom network, could anyone post the linked resources over zeronet or ipfs?",
				"added": 1518785374
			}
		],
		"1516596886_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 3,
				"body": "For the purpose of \"to be resistent against censoring or blockage by governments\". There is already clone of Wikipedia on IPFS, which is a decentralized network.\n\nThere is an youtube video mensioning the case of Turkey banning wiki but people can now access it over IPFS. Sorry for not including the video link, I cannot access Google Youtube right now.\n\nThe way IPFS works (of caching) is per file basis. I would suggest to use zeronet to do the indexing and searching, and keep the content on IPFS so we can access wide range of wiki information with relative less work.\n\nAs others here has mentioned, the permission stuff matter, otherwise bad guy can remove the link to the resources. (The file is still on IPFS, but without the link (or hash) it is funtionally removed.)",
				"added": 1518837455
			},
			{
				"comment_id": 4,
				"body": "I am new to the term 'clearnet', does it means the traditional TCP/IP server-client websites?",
				"added": 1518837501
			},
			{
				"comment_id": 8,
				"body": "Also, beside IPFS, there are many web archive service running right now that keep (almost) all version of the websites.\n\nFor example:\nweb.archive.org\narchive.is\n\nUnfortunately those are blocked by my current ISP.\n\nI wonder how do these service substain.",
				"added": 1518875584
			},
			{
				"comment_id": 9,
				"body": "> [helium](#comment_239_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): The reason, why the founder of The Internet Archive lobbied for a ZeroNet like systemhttps://archive.org/details/bresterkahlenetgainis that The Internet Archive has been struggling with censorship that uses copyright law as an excuse for the censorship. Often times the copyright law based censorship hits artistic works that are not even considered political. [...]\n\nWill the archive service providers be sued due to copyright law?",
				"added": 1518952303
			}
		],
		"1518794232_1EauY5Qr9U4YF4JCq8VDnfh6guT75sh4S6": [
			{
				"comment_id": 5,
				"body": "It seems freenet has longer history than zeronet.\nIs zeronet kind-of / part-of freenet?",
				"added": 1518837530
			}
		],
		"1517996302_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": [
			{
				"comment_id": 6,
				"body": "It seems the zeronet official website (zeronet.io) is blocked in Mainland China.\nBut not all the bootstrap nodes are blocked, (I can use zeronet in mainland without using VPN)",
				"added": 1518843045
			},
			{
				"comment_id": 7,
				"body": "> [helium](#comment_228_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): You may download a ~1.3GiB file with many relevant sources and binaries fromhttp://127.0.0.1:43110/15qHfGtzeqZb2PJiwhtYyV3sARx8zzddMG/It would be nice, if someone would host it/seed it in China.\n\nWhat is that? The source code of zeronet from github is not so large.",
				"added": 1518875188
			}
		],
		"1518810035_1KsYqZdjTHdFjmQMiGCWaCA5tN7jsAXsL3": [
			{
				"comment_id": 10,
				"body": "> [zerobunker](#comment_146_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar): coinhive with ability that allow user to choose how much CPU power we want to give.\n\nCoinhive is a good technological demonstration, however I'm looking forward to open sourced package to allow the publisher to self host the pool so as to slightly increase the no-so-much revenue. \ncoinhive is good for prototyping, but in production, you may feel 30% agency fee high.",
				"added": 1518952617
			}
		],
		"1519718894_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 11,
				"body": "> [sylvaine]: Rather, our hunter-gatherer brains are simply incompatible with the 9-5 corporate rat race. Frankly, there's nothing mind-blowing or spectacular about our lives. We should have had flying cars and affordable space tourism by now. Maybe that's another reason we don't seem to have great inventors anymore - they're all too busy working at jobs they hate.\n\nWhat can we do for it?",
				"added": 1519758116
			}
		],
		"1520816454_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 12,
				"body": "I know I can get the key when I create the site from command line using `zeronet siteCreate`.\nIn this case, shall I just create a new one and copy everything into the new site?",
				"added": 1520816497
			},
			{
				"comment_id": 13,
				"body": "> [nofish](#comment_1138_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): You can find it in your data/users.json file. Look for your site's address then there will be a privatekey entry.\nThanks for the quick reply!.\n\nis it the `auth_privatekey`, it says:\n```\nContent signing failed\nPrivate key invalid! Valid signers: [u'19G***'], Private key address: 17S***\n```",
				"added": 1520816953
			},
			{
				"comment_id": 14,
				"body": "I found it, many thanks",
				"added": 1520817521
			}
		],
		"1519815258_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 15,
				"body": "updated the address from http://127.0.0.1:43110/19G2FpDcdvtUp6cAbie4dT2fTXMWmvVvqd to http://127.0.0.1:43110/1CD4uCgXYwfMU7bVPd5VQLzoZDoeLXpogc for easier 'cd' into the folder",
				"added": 1521290615
			},
			{
				"comment_id": 16,
				"body": "> [awkking](#comment_14_1KrAEe7JPJdEKNLEtxTa7mai712Vee49x5): what is CD?\n\nCD is the abbs. of cross dressing, for example, male dressing in 'female style'",
				"added": 1521296621
			},
			{
				"comment_id": 38,
				"body": "I wish this kind of matching/dating site can get more popularity",
				"added": 1539681874
			}
		],
		"1521308711_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT": [
			{
				"comment_id": 17,
				"body": "it will be treated as invalid in default setting (tried), \nusing multi-user plugin should allow so (not tried)",
				"added": 1521313931
			}
		],
		"1521297761_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 18,
				"body": "(P.S. It's forked from zerotalk.)\nI did the 'site migration' again, now it can download the content.json on other devices.\nHowever, it shows a blank new forum on both my mobile phone and another machine in virtualbox.\nThey are under the same local network without special firewall config.\n\nCurrently, I can only see the real content from the desktop (same as when I created this thread).",
				"added": 1521320547
			},
			{
				"comment_id": 19,
				"body": "By the way, when I click 'publish', it shows published to two peers.\nI think maybe it's not publishing the complete story of the site :/\nneed to work on something with the content.json?",
				"added": 1521320664
			},
			{
				"comment_id": 20,
				"body": "I tried to delete the site on mobile phone, even reset the zeronet app.\nIt can download the 'empty new forum' but not the posts I created.\n\nWhat can I do to ensure the desktop really publish the complete site?",
				"added": 1521320966
			},
			{
				"comment_id": 21,
				"body": "I reset the mobile app again, and created a new post (without seeing the old post) from the vm.\nNow I can see the old post from the mobile phone. (but cannot see the new post created from the vm).\n\nI tried to reset the vm but still cannot get peers (neither the desktop nor the mobile phone) (but when publishing from desktop, it say published to two peers)",
				"added": 1521322562
			},
			{
				"comment_id": 22,
				"body": "seems what I need now is to get more peers",
				"added": 1521322952
			},
			{
				"comment_id": 23,
				"body": "I changed the VM network setting from NAT to bridge, then it works.\nThanks for all your support. It turns out changing the site address is less difficulty than I think, side tracked by other issues in the mean time.",
				"added": 1521323501
			}
		],
		"1521629532_19GRAaLSeEgXthxYKSpGAe3BjZc2LXNWZJ": [
			{
				"comment_id": 24,
				"body": "I think the team is thinking in similar way as FOSS, free open sourced software, and extend that to data level.\nI.e. internet (content) services may be free for anyone to access.",
				"added": 1521735005
			},
			{
				"comment_id": 25,
				"body": "on everysite, you can donate to the bitcoin address by the way",
				"added": 1521735081
			}
		],
		"1522343117_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 26,
				"body": "> [0hd](#comment_4_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ): Create tutorials, content, commit code, seed.\n\nCreating tutorial only helps those who are interested on zeronet, what helps more is to reach people that has never heard about zeronet IMHO",
				"added": 1522513246
			}
		],
		"1522756617_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 27,
				"body": "> [fengyun666](#comment_3_1CSS5r7VbP5m8XURbHCDru8rKtG6CzHXf7): zeronet下载后直接就可以运行的，搞个docker，反而麻烦。\nsome people may have difficulty setting up python",
				"added": 1522773116
			}
		],
		"1522702726_1CdD6UNaXmQLtyQJoi4o2gFwnHMmrMRHgy": [
			{
				"comment_id": 28,
				"body": "I encourage you to put them on zeronet for p2p net's goodness",
				"added": 1522773203
			}
		],
		"1522586677_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 29,
				"body": "> [nullbock](#comment_6_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6): undeletability\n\nI think zeronet is not for \"undeletability\" but for alternative of \"censorship\".\nThe site owner can delete content and propagate the \"delete update\" to the peers.\nOnly when one fork the site before the deletion or revert the deletion after fork.",
				"added": 1522773599
			}
		],
		"1522946822_1CT7RxDQNPEE8X78bDkUPhuaaUUixTmDhC": [
			{
				"comment_id": 30,
				"body": "do you mean to develop hybrid app on top of zeronet, instead of having pure webapp on it ?\n\nin such case, you may find it difficult due to the iframe sandboxing (not sure, just brief estimate)",
				"added": 1522971059
			}
		],
		"1525696516_12TZwQoQXbFfSHgL8DqRg6izd8uHd7wN5w": [
			{
				"comment_id": 31,
				"body": "> [sylviecloud](#comment_3_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac): www.zerocat.eu\n\nhow to add a zite to the whitelist of www.zerocat.eu?",
				"added": 1525813253
			}
		],
		"1527314896_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 32,
				"body": "it would be better if you upload the video to zeronet before sharing",
				"added": 1527703216
			},
			{
				"comment_id": 33,
				"body": "i'm using mobile hotspot right not, failed to publish zeronet site;\nuploaded to IPFS for now:\nhttp://127.0.0.1:8080/ipfs/QmZrmcZZrAGSkEPNkchMbAgYGLD76AMB4ypzHZGQEYetEg/Quantum%20Computers%20and%20Parallel%20Universes",
				"added": 1527710816
			}
		],
		"1519162899_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": [],
		"1527777677_17SkTWL47x3pVwkLLe6rrqGdEnpBvGrwSW": [
			{
				"comment_id": 35,
				"body": "what is the purpose?\nto get rid of the porn?",
				"added": 1527813135
			}
		],
		"1527813349_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 36,
				"body": "I don't understand why I can publish to ZeroTalk but not for the new site.",
				"added": 1527813378
			}
		],
		"1538054944_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 37,
				"body": "I need even more space\nInclude optional files too large 1801679581B > 1000000000B\n\n(see if it works (NSFW) http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs/Siren.2011.WEB-DL.1080p.H264.AAC-CHDWEB.mp4\non http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/)",
				"added": 1538603390
			}
		],
		"1540305940_1DBeqsikmExERCXXH8gRhV36zUyBq6CiTJ": [
			{
				"comment_id": 39,
				"body": "Why don't you put the files on zeronet directly?\nSo that people can access it even when mega.nz is blocked or stop operation.\nAlso, people will be able to preview the image before deciding to further explore other files.",
				"added": 1540396658
			}
		],
		"1560684873_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": [
			{
				"comment_id": 40,
				"body": "> [brunomoutier](#comment_2_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep): If you want to make a website, with legitimate content so no worries about privacy, with clearnet access (proxy with SSL) and ability to share editing rights with other members, would you use Zeronet or Beaker Browser?\n\nYes, of course. I suppose most of the people here are not coming here only for illegal purpose.",
				"added": 1560882883
			}
		],
		"1569577856_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 41,
				"body": "> [gitcenter](#comment_1102_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Are you talking about the case when you click a link to someone's post or click a username? If the first, it's already implemented. If the latter, I'm afraid that's impossible because usernames are not unique so it's impossible to find the correct hub.\n\nI'm talking about the second case, that is I forgot which hub I was on with some friends, even if I recall the hub name, I cannot recall the hub hash.\nI could ask them from zeromail, but wish there is a way to make zerome self containing. At least the entry point, zerome, can link to some other hubs.\n\nOr someone could post a list of the hubs on zerotalk, so it can be searchable if cause other also need the links.",
				"added": 1569680530
			}
		],
		"1570177598_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 42,
				"body": "like that, thanks for sharing",
				"added": 1570182593
			}
		],
		"1548671064_1PpoRxgiiEd3xCZ4MDUxx3m87JbAPDCaHK": [
			{
				"comment_id": 43,
				"body": "I encountered this case elsewhere. Below solution works for me:\n1. stop the zeronet program\n2. delete the entire folder of the zite\n3. run zeronet again\n4. go to the zite, wait for it to sync back\n5. submit the comment again",
				"added": 1577217630
			}
		],
		"1584337202_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 44,
				"body": "I'm not sure why is your zeronet client using /var/lib/zeronet.\nI cloned the zeronet from git into a folder under my home directory, then run the zeronet.py in the root of the repo, it save the sites in the repo directly.\n\nAlso, you can specify the port number when running the zeronet:\n```\n./zeronet.py --ui_port 12345\n```",
				"added": 1585281265
			},
			{
				"comment_id": 51,
				"body": "> [scpketerz](#comment_17_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J): I'm using package from AUR, that's why.\n\nMaybe one solution is to \"install zeronet with git\" instead of using AUR.\nAUR is used to install system packages. It's seldom (if even) used to install packages in user-space.",
				"added": 1605934865
			}
		],
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 45,
				"body": "It seems the source code is available\nhttps://github.com/canewsin/ZeroNet/releases\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71",
				"added": 1585282103
			},
			{
				"comment_id": 46,
				"body": "I think any zeronet apps doesn't need to worry about search rank, because there aren't much zeronet apps at all",
				"added": 1585282189
			}
		],
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 47,
				"body": "it doesn't work when I have https everywhere activated\nthe zeronet client on my pc doesn't support https by default",
				"added": 1585282751
			}
		],
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [],
		"1589536277_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 49,
				"body": "> [kleio](#comment_51_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY): adult\n\nThis site is awesome seeding all optional files :)\n\nWish there are more ways to show appreciation, e.g. giving likes",
				"added": 1601112962
			}
		],
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 50,
				"body": "> [bytebit](#comment_1_1CtmW1WAMxFohHS3ovNPG4QeLADhdF4xkB): And It's seems that showcase should be the homepage [...]\n\nThere is an option to change the default page of zeronet, no forking is needed for this particular feature",
				"added": 1603641677
			}
		],
		"1619497869_1KizAYXUiTwgJNNWhTNpnHagNbzop9dXFr": [
			{
				"comment_id": 52,
				"body": "You can take some beautiful photos, post on Twitter and Instagram, then let your fans donate to you.",
				"added": 1620446866
			}
		]
	},
	"comment_vote": {
		"1148_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"2_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"201_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"6_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ": 1,
		"7_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6": 1,
		"39_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p": 1,
		"115_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"610_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"57_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": 1,
		"2_17uEjJm6477fBX1thzLmUEBpG59fz6ZN3R": 1,
		"23_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": 1,
		"1943_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"51_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": 1,
		"46_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"1088_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"761_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"3073_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}