{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1516741810_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 1,
				"body": "I am now slowly and with low priority working primarily in the direction of importing / exporting data from ZeroTalk. Did in the past broadcast external data (RSS, blog posts) in ZeroBlog. But stopped because of the fact that very large volumes are obtained, it is necessary to think over the ideology of cleaning unnecessary data, etc.\n\nI also exported from ZeroBlogs to a regular Internet blog: http://www.zites.cf\n\nNow I think about how it would be better to make the exchange of information between Internet forums and ZeroTalk.\n\nFrom what I think is useful, but with what I can not handle yet - you need to make it possible to display pictures in ZeroTalk. This, really very necessary. I thought I'd at least make pictures from Markdown through external sources via `![]()`, But I still have not done it. Ideally, of course, you need to be able to load pictures in ZeroTalk as well, as it is done in ZeroBlog.\n\nI think a very useful tool would be ZeroWiki with comments. This would allow creating the discussed resources for films, books, music.",
				"added": 1516748650
			}
		],
		"1516747933_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 2,
				"body": "I would like to see such a mechanism in ZeroBlog. Now a large full-sized photo is reduced to 200 kB and is published in this form. But sometimes I need to have a link to a big photo. Now it requires manual work with the photo uploading manually. It would be nice if when upload a photo in ZeroBlog, a large photo would be added to the blog as an optional file. And the preview remained automatically reduced, as it is now.",
				"added": 1517967313
			}
		],
		"1516750041_1EmrB8xSDYobVFSc3Kad1vx1EPaPR2myCW": [
			{
				"comment_id": 3,
				"body": "Necessarily need images. Or pictures in ZeroWiki, or teamwork with ZeroBlog. A tool is very necessary that would allow collectively and decentralized to write articles with illustrations.",
				"added": 1520449569
			}
		],
		"1520673721_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 4,
				"body": "1. There are no successful implementations of ZeroTalk with image upload.\n\n2. There are versions of ZeroTalk that allow images to be shown using Markdown (it is assumed that a user who paranoidly cares about his safety knows what to do), but you will need to upload images to a third-party resource. For example, in IPFS or in your ZeroNet-blog (with a request to download this blog).\n\nhttp://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1516525820_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Why+this+forum+is+needed\n\nhttp://127.0.0.1:43110/1diyHbGrjKR65DLVpaLoMYsiwqiQYskKD/?Topic:1530176328_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Anyone+built+solar+system+that+is+really+worth+money+and+the+work#comment_2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
				"added": 1538830204
			}
		]
	},
	"comment_vote": {}
}