{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 1,
				"body": "Good write-up \n\nYou forgot ZeroID and ZeroName. I think we should get rid of namecoin addresses because it is very inaccessible for users and no longer secure because it is little used (easily susceptible to a 51% attack), and the .bit names can be edited by @nofish.\n\nAnd ZeroID can be get rid of by using PoW, even though @nofish has said he dislikes  PoW for spam prevention he did implement a PoW certificate authority (why?), please give sites the option at least to use user registration through PoW, the way certificate authorities work is just shit, there's no revocation and it only leads to more centralization.\n\nNow sites like Millchan, ZeroVoat, CryptoID have to give a private key to its users so they can generate a certificate for themselves, this is just silly.",
				"added": 1562003270
			},
			{
				"comment_id": 2,
				"body": "I'm not sure if having multiple people will fix the problem, it could also result in easier compromise because if one of them is corrupt he can still create a lot of trouble. And then there's the problem of how to conduct the vote and who is considered a real person.\n\nI think we should look at fixing this problem in the code as much as possible, stop relying on centralized zites like ZeroName, ZeroID (or other cert authorities), ZeroHello (could be added to the code-base), etc.",
				"added": 1562004094
			},
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_489_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This might of course help site problems. But not the network problems -- we still have to centralize the development within a group of people. This topic is about enlarging that group of people. [...]\n\nYes, true.",
				"added": 1562004300
			},
			{
				"comment_id": 5,
				"body": "> Give private keys from ZeroHello, ZeroUpdate, ZeroMe, ZeroTalk and probably a few other sites to the most reliable users.\n\nMissed that one, not a good idea no.",
				"added": 1562007895
			},
			{
				"comment_id": 6,
				"body": "> [gitcenter](#comment_495_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): However, we've found a solution. We would use the exploit itself to change the source code to fix the nodes (yup, it was The \"Vacation\" RCE vulnerability).\n\nI've never bothered to read on that bug but that's amazing.",
				"added": 1562009520
			},
			{
				"comment_id": 7,
				"body": "Some solutions:\n\n- Do not auto-update, always ask before updating and make it easy to review code changes\n- Do not auto-update the ZeroHello homepage either\n- Remove or freeze ZeroName (nofish has full control over it, and Namecoin is dead)\n- Add PoW-based user registration as an alternative to giving out a certificate authority's private key as used on Millchan, ZeroVoat\n- Create a ZeroNet-compatible client, possibly written in another language, to diversify the network stack\n- Move away from GitHub",
				"added": 1562009858
			},
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_502_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This means that we have to transfer the domains somehow\n\nRemoving might be too radical, freezing ZeroName might be a better solution.",
				"added": 1562010281
			},
			{
				"comment_id": 9,
				"body": ">[mg0](#comment_65_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): who should I poke to get my zerotalk limit raised\n\nAccoring to @nofish this happens automatically.",
				"added": 1562010333
			}
		],
		"1561994830_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 4,
				"body": "Welcome to social media! Seriously, what do you mean by social media, IRC? E-mail? Text messaging? Forums? Platforms that allow you to talk to other people?\n\nI personally see little issue with ~~social media~~ platforms that allow you to talk to other people but more with the highly centralized, controlled and censored platforms like Twitter, Facebook and the like",
				"added": 1562004410
			}
		],
		"1561824300_1CNe5dawwwFVVvafLRWL184gQSySUu38Bt": [
			{
				"comment_id": 13,
				"body": "> [filips](#comment_38_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I created ZeroFrame WebSocket API for JavaScript.I'm currently also creating clients for other languages (Python and PHP). [...]\n\nThat's a good approach actually. Thanks.",
				"added": 1562010986
			}
		]
	},
	"comment_vote": {
		"61_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}