{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1565457554,
			"title": "Everyone new here, please help seed \"Doge\" to 100 peers",
			"body": "Help seed here:\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=1DobcNU81BZrQViu9L6uUu7qcC4Afd9r962",
			"added": 1565457553
		},
		{
			"topic_id": 1612901550,
			"title": "is this working?",
			"body": "I am testing",
			"added": 1612901548
		},
		{
			"topic_id": 1612901583,
			"title": "nothing",
			"body": "lwvo;whfohfm slvbvodbvdovkvbvkvn v nvbvvb  bk k kjbvx b",
			"added": 1612901580
		}
	],
	"topic_vote": {
		"1614298638_1M77v8LSvJyW7ThTD1Z46CVBYfi8y1SpaW": 1,
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1613921922_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 49,
	"comment": {
		"1553905331_1KinYupoFogGajrGGqNr6MmoR6fVJJnwqE": [
			{
				"comment_id": 1,
				"body": "> [styromaniac](#comment_678_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I know EXACTLY what you mean by that and I've been afraid to go into detail over it.\n\nunified big files would be big help.",
				"added": 1553979184
			}
		],
		"1557305635_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 2,
				"body": "> [kaffie](#comment_840_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): ZeroExchange Client: http://127.0.0.1:43110/1KisLUy1ugHMFBhumhm7MkXAhvHJHXETbu/ [...]\n\nAre there sites not cloneable with full content, like this ZeroTalk? How can we clone or save any zite with all data up to this point and restore it under a different adress if needed?",
				"added": 1557505735
			}
		],
		"1557278450_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 3,
				"body": "You could try IFS:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/",
				"added": 1557575363
			}
		],
		"1560623238_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA": [
			{
				"comment_id": 4,
				"body": "Hopefully this deduplication feature comes after python3 version is officially released.",
				"added": 1560635182
			}
		],
		"1561847632_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "Why you tell others what to do?\nEven if \"useless\", if a person enjoys doing it or has meaning for them and them only, its fine. Otherwise, nothing is useful if its not feeling useful for that person doing it, be it a historian doing research, a religious person spending time doing what he believes in, a nurse caring for people, a farmer growing organic food, whatever...",
				"added": 1561886027
			}
		],
		"1561514363_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "h3bhkj5gqz4n3pjm: the biggest kiddo in town now found his way to ZN. You just came here from the clearnet, because nobody would want to listen to your boring variation of crap made up from the same mountain of info/disinfo thats out there for everyone. Imo if you really were above and beyond the implications of what you state you believe, you wouldnt even bother writing it down in the manipulating and ego-compensating (for a kiddo) way you do, so that clearly shows you know that you know nothing reliably and also cant cope with any of your perceived knowledge, hence you bother other people disguised as to \"enlighten them\"  or \"make them aware\" and give out do's and donts that are useless by themselves.\nThis is ZN though, so GL continuing that as long as you enjoy it, then its at least something useful for you :D",
				"added": 1561888203
			}
		],
		"1562405706_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 7,
				"body": "Why additional IPFS and two systems running, if Big Files are working within ZN and have privacy protection over TOR, that IPFS does not?\nIf Big Files would be made more global within ZN, it would be even better overall solution than IPFS.\nIFS:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er",
				"added": 1562478970
			}
		],
		"1561669750_1QH31dTs9gcggfUp7PvFkW7kPohheUHARS": [
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_366_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): fucking homosexuals generation. duende is 'not there':'but go kill yourself'. lol.\n\nEveryone knows you are duende (nofish told us).",
				"added": 1562912807
			}
		],
		"1565420698_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 9,
				"body": "Anyone could easily change resokutiin or change a few pixels and create new hashes?",
				"added": 1565428401
			}
		],
		"1565593853_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 10,
				"body": "Gnome, Chrome, Android = while opensource can not be trusted (also forked versions like Chromium, AOSP or Cinnamon). \nRedhat (now IBM) is like Google or Microsoft: US companies spying mandatory by the government, so best avoid their product or forks",
				"added": 1565597275
			},
			{
				"comment_id": 11,
				"body": "> [fukumen](#comment_3_16VbvKimRxHU477UFz6LYuUNX7hQVUQZBv): Cinnamon master race.\n\nWhy use clumsy extensions on top of a compromised base?",
				"added": 1565614373
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 12,
				"body": "> [fodase](#comment_31_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): Zeronet is a honeypot, just like TOR.\n\nIf ZN and TOR are, so is everything else.",
				"added": 1565948014
			}
		],
		"1566230571_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 13,
				"body": "Thanks for amazing tool!",
				"added": 1566388392
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 14,
				"body": "Ckklhg",
				"added": 1575373005
			},
			{
				"comment_id": 21,
				"body": ":-)",
				"added": 1581519146
			},
			{
				"comment_id": 35,
				"body": "sup",
				"added": 1602864315
			},
			{
				"comment_id": 36,
				"body": "qwerty",
				"added": 1603132435
			},
			{
				"comment_id": 40,
				"body": "g",
				"added": 1604934557
			},
			{
				"comment_id": 45,
				"body": "> [croatame](#comment_1_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS): Testies 123",
				"added": 1614368515
			},
			{
				"comment_id": 46,
				"body": "ดขัจ",
				"added": 1614370997
			},
			{
				"comment_id": 47,
				"body": "ดัเ",
				"added": 1614371023
			}
		],
		"1580594957_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5": [
			{
				"comment_id": 15,
				"body": "Kdenlive wipes the floor with pitivi, but to each it's own.",
				"added": 1580629242
			}
		],
		"1580335642_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 16,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1811_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): life has no meaningget over it.\n\nThen please stop posting, since your sad utterings also have no meaning, what are you going to achieve...",
				"added": 1580629437
			}
		],
		"1581083700_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 17,
				"body": "To seed only selected channels, each channel would have to be its own hub i guess. Thats not really scalable and therefore not the case.",
				"added": 1581259344
			},
			{
				"comment_id": 18,
				"body": "But you can control exactly which files you seed under ZN startpage - Files tab.",
				"added": 1581259419
			},
			{
				"comment_id": 20,
				"body": "> [rannulfr](#comment_40_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Click the three stripes on the left on IFS.Select IFS Cluster 1Toggle \"help distribute files\" on the top right\n\nThat helps distribute all files from a cluster though, not a single channel. Not sure if only seed a single channel with current optional files and hubs system of ZN is possible.",
				"added": 1581405231
			}
		],
		"1580612515_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 19,
				"body": "> [kanade](#comment_65_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): pick one\n\nHaha :)",
				"added": 1581405017
			}
		],
		"1582060549_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 22,
				"body": "> [alfr](#comment_3_1LrW8M76omSeDjzbscCJUPndJuoYgQd626): yes of course. it works just like a torrent. videos that you open up start seeding automatically. if you go into the data folder for IFS you can delete them again.  [...]\n\nYou can also use the trashcan icon to remove it via frontend and prevent redownloading without explicit confirmation.",
				"added": 1582238628
			}
		],
		"1582442446_1JmxhPt4FDP7rTmmaxoKdwTSDhwg5YSatG": [
			{
				"comment_id": 23,
				"body": "> [linuxsourced](#comment_5_1JmxhPt4FDP7rTmmaxoKdwTSDhwg5YSatG): Can you at least answer my question if there is  a way to stop zeronet from downloading sites to be used offline.\n\nFor ZN to grow with the central idea that whatever you visit gets redistributed, it imo needs an adblock-like system, where everyone can turn on/off what content type *you* like to be filtered out on *your* harddrive. For this to work, it needs to be built-in into ZNs core, but at the same time without centralized control like current zeroid, which is IP based from clearnet.\n\nThe key question then is:\nHow can it be prevented, if a user spams any file based zite which accepts contributions with a flood of (generated) files added to the system? Lets say a music zite or video zite or general zite be spammed with 100k files, all with different generated hash and lets say 1MB to 1 GB per file size?\n\nWho can watch through this and remove all those fake, valueless files so they dont clog up any popular zite?",
				"added": 1582504397
			}
		],
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 24,
				"body": "Why would you not release the code immediately? ZN is fully opensource, are you sure you dont breach the original license?",
				"added": 1583663635
			}
		],
		"1584271096_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 25,
				"body": "> [gitcenter](#comment_1304_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I'm wondering if anyone is working on a better video service?\n\nTo make a better service for videos or basically anything in ZN, we would need a global hashbased optional file system. A common filebase for data sharing, filehandling, filtering and deduplication is far more importand and missing at this point than current approach of a centralized, IP based user control system, which is controlled by a clearnet service one man show, which goes against anything ZN tries to solve in the first place.",
				"added": 1584390273
			}
		],
		"1585399613_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 26,
				"body": "Very simple:\nTracking, blocking, censoring PEOPLE/ACCOUNTS is wrong and harmful. That only works on the clearnet, and needs registered and ip-based accounts, like cenzralized zeroid. That is wrong for ZN or any other decentralized network.\n\nThe correct approach is CONTENT based blocking, so any content is uniquly identified by hashsum, the centralized lists CAN be done like adbllockers, but no one is forced to use any or which ones.\n\nThe latter tracks data and offers choice, the former breaks ZN promise and tracks people by IP,  just like normal clearnet and makes ZN worthless.\n\nI still wait for nofish to implement hashbased data optional files, that allow ZN-Wide identification and sorting of content/data, not people. Thats the only way to move forward and solve issue of every user decides by himself, what he/she wants or not.",
				"added": 1585495612
			}
		],
		"1585691367_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 27,
				"body": "Is it indexing ifs content?",
				"added": 1585902494
			}
		],
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": [
			{
				"comment_id": 28,
				"body": "Does \"TOR always\" help with the trackers?",
				"added": 1586602473
			},
			{
				"comment_id": 29,
				"body": "Agreeing on the critical points of ZN: Especially zeroid and duplication data. Both are related/dependent on each other: Since there is no unique identifiable DATA/ FILE sharing across ZN zites via hash / like ifps, zeroid is needed to keep spam/flooding under control via unique identifiable USER IDs. The reverse would be needed to have a breakthrough and solve both issues with one stone.\n\nBtw. whats zerowiki based on?",
				"added": 1586627065
			},
			{
				"comment_id": 30,
				"body": "So what else would need to be developed into ZN base other than true decentralized id system and data deduplication/sharing?",
				"added": 1586791902
			},
			{
				"comment_id": 31,
				"body": "> [anonymouslogin](#comment_196_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): even Tor has a list of initial contact nodes / gateways.\n\nAre those anonymized though or is your ISP assigned IP leaked/recorded on initial connect even when using TOR always?",
				"added": 1586869110
			}
		],
		"1589783095_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 32,
				"body": "We need the universal file system in ZN. Otherwise it will be pointless having stuff scattered around small zites and endlessly trying to find what you search for. Without a universal file system, ZN and merger zites are doomed to fail as they never get past a certain point of scaling and keeping abuse in check.",
				"added": 1589918516
			},
			{
				"comment_id": 33,
				"body": "> [xerog](#comment_43_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv): All eggs in one basket?\n\nNo, all eggs shareable/manageable/filterable per users preference on any/all zites.",
				"added": 1589983982
			}
		],
		"1591525925_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 34,
				"body": "> [frankwalter](#comment_1_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Adventure time and rick and morty. But please, don't do seeding with tor, it is against tor etiquette since the traffic is donated by volunteers and tor isn't for high bandwidth applications. You risk to saturate the network, seriously.\n\nThats not true and is even actively debunked by tor developers themselves on most conferences since a few years now. Also when two users use tor, it is only bridged, so no exit node is stressed at all.",
				"added": 1591881882
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 37,
				"body": "ZN is basically dead as is, with one person making all the shots, or rather seems to have given up to do anything substantial needed (no, in its current form ZN will NEVER EVER have a breakthrough with the masses, no matter how bad or drastic the clearnet sucks).",
				"added": 1603917339
			},
			{
				"comment_id": 38,
				"body": "> [zeroseed2](#comment_18_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): At first in my opinion we should create different forks of zerohello with more zites.\n\nVery good point!\nSince when did the inventor of the internet ALSO bothered with inventing facebook, spotify, youtube, etc. too?? Only because nofish has control over the main entry page, he shouldnt imo concentrate on promoting only his sites, this will (or is already) failing in the same way as AOL did...",
				"added": 1603917572
			},
			{
				"comment_id": 39,
				"body": "Biggest thing that would make everyone switch or adopt open-ZN is a global opt-in blocklist for files. Therefore we need a global or universal filesystem, where a global filter (like adblocks lists) can be chosen to be applied and contributed to by any zn users.\n\nRight now every zite needs to implement this on their own, it doesnt take care of missing files or redundant ones by using hashsums to organize optional files, etc. So a zite is still built by local code/files, but any user contributed content with optiinal files and hubs is organized in a global fashion via hashsums. Nofish never delivered this, andcitvis one of the absolute critical missing pieces for the 3 main reasons stated above (fixing redundancies, helping to provide missing files, allowing a global implemented, easy-to-use opt-in filterlist).\n\nThat added, I think people would feel a truly sense of ease help spreading new sites, curate content, having a sense that nothing ever gets lost in a non-repareable way as itvis now.",
				"added": 1603918133
			}
		],
		"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 41,
				"body": "> [bimmyql](#comment_41_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): If it's possible to make cryptocurrencies that are resistant to manipulation, it should be possible to make an internet that works the same way, right? I'm really hoping this is one of the cases where there's a technological solution to a social problem.\n\nExactly this!\nThis is the holy grail and number one base requirement for a new internet.\n\nGlobal Fileshare with universal adblock-like filter-lists is whats needed to protect major abuse. With a global filesystem shared by any zite, manipulation resistant file tagging would be built-in.\n\nZN has all the basics, though Nofish never followed up on this one and hence current ZN is way to easy to be manipulated or destroyed with bad content and hence lacks any real usage or mass adotption in its current state.",
				"added": 1610410367
			},
			{
				"comment_id": 42,
				"body": "> [edgelordofdecent](#comment_764_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): @bimmyql you can block content from certain ids. You do the moderation yourself.\n\nThis is good, but only half step.\n\nImagine you work together and share a global filterlist, like adblock list:\nYou can then use same technology with multiple groups/factions, each having their own content/bubble IF they seek so themselves (not done by bots or algorythms), and without restricting or banning the other.\n\nAny opinion or content can co-exist on same technology. \n\npeople in their group/trust need only worry about their content and can mix and match whatever filtercombo they like (like no porn, no pepe, no \"madonna\" or other shit music, etc.) Neutral filterlists like \"adfree\" could be deployed by anyone, regardless of of other preferences.\n\nRisks can then be mitigated and sharing of content happens only for what people really want/allow on their own harddrives.\n\nThis requires a global shared big file system, where filter-category is identified by unique hashsum for each file. That prevents blockage of e.g. marked spam-files zn-wide, just like adblocker on clearnet. \n\nSecond benefit would be sharing of files zite-independent, so one can use any interface or zite for uploading and viewing, but neednt reupload if missing file is no longer available on first zite. E.g. a file uploaded and identified on one zite can be used to also seed from another zite, that reduces risk of 'empty/deprecated\" 404 files greatly, plus avoids redundancy, also making storage effecient.\n\nImagine Zeronet becoming a true internet 2.0 with p2p and security measures built in and allowing any content be added, categorized and potentially \"endlessly\" stored without vanishing, censoring or manipulating.\n\nExchange of opinions for any content via comments, discussion, etc. can then happen without banning, but user controlled filter system.\n\nTldr; greatly functional P2p already there, easy scalable robustness/manipulation-resistance/protection only halfway.",
				"added": 1610668058
			},
			{
				"comment_id": 43,
				"body": "> [unsnapgreedless](#comment_11_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh): This is censorship.\n\nCensorship is if someone else decides for you. Freedom is if you decide for yourself. So it is more freedom if I can decide to NOT view something for myself. Imagine the opposite is Alex forced open eyes in Clockwork orange.",
				"added": 1610668220
			}
		],
		"1611635380_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq": [
			{
				"comment_id": 44,
				"body": "> [styromaniac](#comment_2929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Check out Twitter's Project Bluesky.\nAs if to trust anything that comes out of that shithole of a company...",
				"added": 1611681740
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 48,
				"body": "Test123",
				"added": 1618216931
			}
		]
	},
	"comment_vote": {
		"35_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": 1,
		"1_1fscGxiRA9y7RMLm4urTjvJZeWbC8APDM": 1,
		"1_12kCwz9JBe9K9ZifNNboAvJTS9C6KBtC4c": 1
	}
}