{"cert_user_id": "gukandrew@github", "next_topic_id": 2, "topic": [{"topic_id": 1604068055, "title": "Add Dockerfile based on Ubuntu 20.04", "body": "The official Dockerfile on alpine:3.11 doesn't work on Raspberypi OS (RPI4), this works fine", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1602770716, "modified": 1603806197, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652", "source_type": "github"}], "next_comment_id": 16, "comment": {"1604068055_mirrored_gukandrew_github": [{"comment_id": 1, "body": "I'm not sure about that changes, as I took the [original Dockerfile](https://github.com/HelloZeroNet/ZeroNet/blob/py3/Dockerfile) as base. So that's why I have port and other things hardcoded as well as in original.\r\nAnd you could use tor or not so you can set ENABLE_TOR env var.\r\n\r\nOf course I can put your suggestions, but I think you can commit that directly (I have checked checkbox \"Allow edits by maintainers\").", "added": 1602776761, "modified": 1602776761, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-709521545", "source_type": "github"}, {"comment_id": 2, "body": "@JabbaDesilijicTiure @imachug  Btw why official docker image/dockerfile https://hub.docker.com/r/nofish/zeronet/dockerfile has same issues? ", "added": 1602777004, "modified": 1602777123, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-709523922", "source_type": "github"}, {"comment_id": 3, "body": "@JabbaDesilijicTiure @imachug Wow I caught attention to more serious thing than I thought.\r\nI'm not familiar with situation in Hungary, but if that is true it's terrible.\r\nBut in same time @HelloZeroNet is living in that country so maybe he is not talking about issues in Hungary because of concerns about close people life. IDK", "added": 1602859653, "modified": 1602859653, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710302754", "source_type": "github"}, {"comment_id": 4, "body": "I don't know a lot about China, but heard about Xinjiang re-education camps and The Great Firewall of China, that is also shows China not in good light (I do not justify the Hungary). Anyway the topic will not be fulfilled without mention that Russian Federation also is nazi country, that occupied Ukrainian Crimea and Eastern Donbas and asked support their actions for Hungary government at same time. So It would be hypocrisy to be silent about that from my side when topic goes about despotism. So what your thoughts about that fact?\r\n\r\n@imachug @JabbaDesilijicTiure anyway I have fixed Dockerfile a bit, updated Ubuntu version and using virtualenv now. ", "added": 1602864491, "modified": 1602864491, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710446326", "source_type": "github"}, {"comment_id": 5, "body": "> Russia? Without Russia we already dead body, we will be all either dead or live in brutal fascism. I see Russia as a savior, they did save Europe from the nazis one time and I strongly believe soon they actually go to war with NATO fascists in EU and save Europe again from fascists.\r\n\r\nHa ha ha, they were nothing without Ukraine in WW2 as well as without USA's Lend-Lease.\r\n\r\n> Crimea was legally annexed and I support that move. I don't like double standards, the Americans annexed entire countries in Afghanistan, Iraq, and they \"protecting oil\" now in Syria, Americans also \"annexed\" Guantanamo Bay which is a true concentration camp. The real evil in this world is not China, Russia or Iran, the real evil and world's biggest terrorist which killing thousands of people with drones is the United States of America. I believe we are close to 3th world war and if that times come I volunteer to oust the Americans from Europe.\r\n\r\nDid you heard about Budapest Memorandum and the freezing of borders after World War II? They don't have any legal rights to occupy any territory of Ukraine. I hope the war between China and Russia will happen soon, and you'll feel the things that we in Ukraine feel now protecting our territory against russians nazis. I see real face of supporting terrorism from your side like Russian Federation actions related their neighbors. So after that I can't believe your justification of china camps and russian occupants.\r\nAnd yes, I don't care about other countries after Russia invaded Ukraine why I should though?\r\n\r\nWe will be on opposite sides.", "added": 1602923121, "modified": 1602923121, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710840213", "source_type": "github"}, {"comment_id": 6, "body": "Nope, I really disappointed with your position. You're doing the same thing you claim @HelloZeroNet does. But in your case that clearly visible things, unlike situation with Tamas Kocsis.", "added": 1602923952, "modified": 1602923952, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710851938", "source_type": "github"}, {"comment_id": 7, "body": "lol, turn off russia24 on your tv. Any proofs? Except russian occupation of my country?", "added": 1602924735, "modified": 1602924735, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710860802", "source_type": "github"}, {"comment_id": 8, "body": "> Your country run by a clown didn't you noticed?\r\n\r\nWhy you care who run our country? Fuck off.\r\n\r\n> Neo-nazis waving EU flags and the whole government is working to get into the NATO\r\n\r\nWhy you care where other country goes? You have your China. So fuck off.\r\n\r\n> Russia should wipe out Ukraine from the map\r\n\r\nFuck off, you're really terrorist.\r\nAnd no, I speak Ukrainian. As well as another part of country. But why you care what language another country use?\r\n\r\n> Actually crimeans voted to be part of Russia\r\n\r\nIt's fake claim, and fake referendum under the russian guns.\r\n\r\n> Fascist eurocentric russophobic maniacs should be gunned down and if this continues that way your country will be ground zeronet.\r\n\r\nIt's not you who can decide that, and not another countries even. So fuck off again.", "added": 1602925898, "modified": 1602925910, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710872793", "source_type": "github"}, {"comment_id": 9, "body": "Fuck off again. And put FSB into your ass before that. NaziJabbaDesilijicTiure.", "added": 1602926113, "modified": 1602926113, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710874712", "source_type": "github"}, {"comment_id": 10, "body": "I'm very scary. OMG.\r\n@HelloZeroNet I cannot understand why this freak with nazi and terrorist views contribute this project.", "added": 1602926233, "modified": 1602926233, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710876765", "source_type": "github"}, {"comment_id": 11, "body": "![image](https://user-images.githubusercontent.com/36536011/96336997-370d0c80-108c-11eb-9221-ea7049b4e57b.png)\r\n", "added": 1602926399, "modified": 1602926399, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710880129", "source_type": "github"}, {"comment_id": 12, "body": "@imachug thank you! I was almost going to close that PR because of that. That's very destructive behavior really will not provide good feedback for the project.", "added": 1602926826, "modified": 1602926826, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710888452", "source_type": "github"}, {"comment_id": 13, "body": "@imachug sorry, one more thing. Question regarding virtualenv. Do we need that layer? As for me that would be overcomplicating, as we use our container only for ZN and could run as non root user even without virtualenv.", "added": 1602927525, "modified": 1602927525, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710901930", "source_type": "github"}, {"comment_id": 14, "body": "@imachug @HelloZeroNet dropped virtualenv. Now it should build faster.", "added": 1602928822, "modified": 1602928822, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-710926827", "source_type": "github"}, {"comment_id": 15, "body": "![Screenshot_2020-10-20 Add Dockerfile based on Ubuntu 20 04 by gukandrew · Pull Request #2652 · HelloZeroNet ZeroNet](https://user-images.githubusercontent.com/36536011/96570849-85f8b300-12d3-11eb-8218-e81f33b45466.jpg)\r\n\r\n@JabbaDesilijicTiure you cannot erase your position as easy as you think.", "added": 1603176994, "modified": 1603176994, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2652#issuecomment-712736910", "source_type": "github"}]}}