{
	"next_comment_id": 22,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [shevek](#comment_2_1FKv8ekYrPvVxZASX4Rk6EYQYpASnHaiXn): Joer, qué digo, si hasta tengo un blog que me creé de la nada, sin instalar un solo programa en ningún sitio:  1DjxL7mt1yeK8Mt9dxcZ5UB52MvQMB97Pw\n\nGracias por tus comentarios. Yo también he pensado en montar algo así en uno de esos aparatitos, si compro uno lo haré. Por cierto, ¿creaste el blog desde bit.no.com u otro Zero Proxy o cómo?",
			"post_id": 3,
			"date_added": 1450331252
		},
		{
			"comment_id": 2,
			"body": "> [rcastano](#comment_2_1254yKPQxGEL7qEkTgig8dGZAhbW6TyQ4f): Excelente post. Tuve un problemita en Trisquel-GNU/Linux a la hora de obtener pip pero lo pude solucionar con el siguiente comando:\n> sudo apt-get install python-pip python-dev build-essential\n> Puede que esten sobrando paquetes pero el comando me funcionó tal cual. Un saludo y me gusta tu blog.\n\nMuchas gracias por comentar, en verdad me alegra que te guste el blog.",
			"post_id": 3,
			"date_added": 1450849383
		},
		{
			"comment_id": 3,
			"body": "> [rcastano](#comment_1_1254yKPQxGEL7qEkTgig8dGZAhbW6TyQ4f): Que buena iniciativa, quisiera saber que usaste para manejar el sistema de posts y el sistema de likes, funciona muy bien!\n\nEs un clon de ZeroBlog, el sistema de comentarios y likes viene incluido.",
			"post_id": 1,
			"date_added": 1450849581
		},
		{
			"comment_id": 4,
			"body": "> [nosferatus](#comment_1_1GUgC6A1qY4EV9PgTrYNeFrEth9bw3xRLp): Excelente info y felicitaciones por tu blog y mas en una red descentralizada como esta (aunque no entienda del todo como funciona :D)\n\nMuchas gracias amigo, me alegra que te haya gustado la publicación, pronto pondré más sobre Vim entre otras cosas.",
			"post_id": 7,
			"date_added": 1451792156
		},
		{
			"comment_id": 5,
			"body": "> [xikufrancesc](#comment_1_1NXas4VQNUb9Vgd6zW7E1xGPUCfcxSXBF5): Aprendiendo como nunca, los trucos las formas y las maneras de hacer las cosas en informática es casi todo un reto. No solo de una sino de cientas formas de domesticar el Vim.\n\nAsí es jefe, Vim es demasiado poderoso y extenso, siempre hay algo que aprender.",
			"post_id": 7,
			"date_added": 1451792302
		},
		{
			"comment_id": 6,
			"body": "> [anarres](#comment_1_12dgeYtbTLvzWTeHin4YVVVY3ZgHdL1yZB): Hola,\n> Soy Shevek. He tenido que habilitar otra identidad en ZeroID porque finalmente he instalado ZeroNet y no puedo reutilizar la identidad antigua.\n> Quería decirte que sí me interesan las opciones de personalización que has encontrado.\n> Saludos.\n\nClaro, si *siembras* (seeding) mi blog supongo que podrás copiarlas tú mismo de su respectivo directorio dentro de /ruta/a/tu/zeronet/data/, los archivos son index.html y js/all.js\nO si lo prefieres te los puedo enviar por email u otro medio que propongas.",
			"post_id": 6,
			"date_added": 1452064757
		},
		{
			"comment_id": 7,
			"body": "> [shevek](#comment_4_1FKv8ekYrPvVxZASX4Rk6EYQYpASnHaiXn): Yo uso Vim esporádicamente. Quizá fue el primer editor de texto en CL que usé hace más de 20 años en un sistema AIX. Enseguida aprendí el truco de \"i\" para escribir y \"esc\" para volver al modo comando.\n> Pero odio este tipo de editores (como emacs) con una curva de aprendizaje tan brusca... y tan inútil: centenares de combinaciones de teclas que hay que memorizar y que sólo se usan en un editor determinado. Odio aprender cómo se copia-corta-pega texto en cada editor que uso. Si un editor usa Ctrl-C para copiar y Ctrl-V para pegar (lo más universal) entonces tiene una posibilidad de que lo considere para usarlo.\n\nLo entiendo, pero hay bastante software que usa combinaciones similares a Vim. Mi máquina personal corre un entorno donde casi todo se comporta parecido a Vim. Aunque claro, lo más importante es usar algo con lo que uno se sienta cómodo.",
			"post_id": 7,
			"date_added": 1452065044
		},
		{
			"comment_id": 8,
			"body": "> [klauszimmermann](#comment_3_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT): Good choice, vim is an excellent text editor. I don't want to fuel editor-wars here, of course, but it works for me so well that I can't really see myself using anything else anymore these days.\n> Small and portable, I carry it pretty much everywhere to avoid having to use some other editor. What other application could embrace the hacker's spirit so well as vim?\n\nI agree. I love its simplicity (it adheres very well to the UNIX philosophy and its modal editing. And I understand you, I can't live without Vim, it is the perfect editor for me.",
			"post_id": 7,
			"date_added": 1454562951
		},
		{
			"comment_id": 9,
			"body": "> [klauszimmermann](#comment_5_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT): Ah, so that's how it works! Thanks for the simple explanation.\n> It sucks for me that Debian Jessie still has Tor version 0.2.5 in its repos, so I guess it will take me a while until I actually get to use it :(\n\nYes, I know, I had to *force* the update of Tor package because is *masked* in the repos of my distro (funtoo).",
			"post_id": 10,
			"date_added": 1455086596
		},
		{
			"comment_id": 10,
			"body": "> [nippletwister](#comment_1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): I don't understand anything here, but it looks good). For some reason mousewheel  scroll doesn't work.\n\nThank you. The mousewheel didn't work because the changes I made in CSS and I had not noticed, but now is working properly.",
			"post_id": 9,
			"date_added": 1455086941
		},
		{
			"comment_id": 11,
			"body": "> [shevek](#comment_5_1FKv8ekYrPvVxZASX4Rk6EYQYpASnHaiXn): En las últimas versiones de ZeroNet no consigo activar la conexión de ZeroNet a través de Tor en la Raspberry Pi\n> He instalado un repo que me permite actualizar Tor a la versión que usa ZeroNet, pero nada. Me sigue dando error de conexión :-(\n\n¿Tienes activado el CobtrolPort en tu torrc?",
			"post_id": 10,
			"date_added": 1455582757
		},
		{
			"comment_id": 12,
			"body": "> [vveraxx](#comment_1_18FhdUHnAmpoL4kuTCTvDyowHAsTUJCy6R): Sería muy bueno si ha creado un post sobre cómo crear un sitio web aquí, pero un tutorial bastante fácil de entender incluso con fotos y todo!\n\nSi te refieres a un blog como éste es bastante fácil, basta con clonar el sitio. En el blog de ZeroNet hay una guía de como hacerlo ilustrada, aunque en inglés: http://127.0.0.1/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this (el método funciona para otros sitios de ZeroNet, como ZeroTalk)\n\nSi te refieres a un sitio más genérico en el mismo blog hay dos buenas guías, pero esto puede ser un poco más complicado dependiendo de lo que quieras hacer: http://127.0.0.1/Blog.ZeroNetwork.bit/?Post:43:ZeroNet+site+development+tutorial+1 http://127.0.0.1/Blog.ZeroNetwork.bit/?Post:43:ZeroNet+site+development+tutorial+2",
			"post_id": 1,
			"date_added": 1456724352
		},
		{
			"comment_id": 13,
			"body": "> [myanusisbleeding](#comment_1_1JLcdG3H6JQERRYrQfPixP74hMGf5Rhmvk): Se agradece el aporte, otra forma para cifrar imágenes.\n\nMe alegra que la publicación haya sido de tu agrado. Gracias por comentar y a seguir cifrando :)",
			"post_id": 11,
			"date_added": 1456982143
		},
		{
			"comment_id": 14,
			"body": "> [wikel](#comment_1_1LibBUnkdkrprABTQh2EVfpYqtprTmJaMz): Como creast tu blog, amigo. ?\n\nSimplemente clona ZeroBlog, viene incluido con tu instalación de ZeroNet. Es sencillo, sólo busca ZeroBlog en la página de inicio de ZeroNet, haz clic en la esquina derecha y selecciona \"Clone\" en el menú que se despliega.",
			"post_id": 12,
			"date_added": 1457074140
		},
		{
			"comment_id": 15,
			"body": "> [mama21mama](#comment_1_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt): Una vez sembrado el blog quedara en la red zeronet aunque el primer dueño este offline?\n\nAsí es, con que haya una sola persona sembrando el blog, aunque no sea su dueño, el blog sigue en línea.",
			"post_id": 1,
			"date_added": 1457129459
		},
		{
			"comment_id": 16,
			"body": "> [cer](#comment_3_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Posiblemente podrias explicarnos o (si ya lo has hecho) indicarme donde puedo encontrar un tutorial para \"registrar correctamente un dominio en namecoin y poder usarlo en zeronet\"...\n> Yo ya he registrado un dominio, pero no consigo usarlo como reemplazo de la direccion seudo-bitcoin de zeronet de mi Blog.\n> http://127.0.0.1:43110/15vXv74dDjPLUtCnA6m7vwcucRNtJfcEgp\n\nTe he respondido en el foro: http://127.0.0.1:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL/?Topic:2_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92/Configurar+un+dominio+bit",
			"post_id": 1,
			"date_added": 1457413880
		},
		{
			"comment_id": 17,
			"body": "> [cer](#comment_2_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Y como se puede configurar un puerto diferente al por defecto que trae Tor?\n\n```\n  --tor_controller ip:port\n                        Tor controller address (default: 127.0.0.1:9051)\n  --tor_proxy ip:port   Tor proxy address (default: 127.0.0.1:9050)\n```\n\nPasando esos parametros al iniciar ZeroNet.",
			"post_id": 10,
			"date_added": 1457415430
		},
		{
			"comment_id": 18,
			"body": "> [klauszimmermann](#comment_6_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT): Awesome! I should try doing this with my home server too. I've gotten pretty lazy with self-hosting ever since I got done with XMPP, so this could be an interesting exercise to get back on my feet.\n> BTW I see everyone in the internet indicating Nginx for web servers today. Is it really that lightweight? I've been using lighttpd so far, but would try it out if it was better.\n> Thank you for an awesome post, man!\n\nThank you. You definitely should try nginx, I think is not such lightweight as lighttpd but is pretty lightweight and is easy to configure. I'm using it on 3 different servers running differents services and it works without any problems.",
			"post_id": 12,
			"date_added": 1458280149
		},
		{
			"comment_id": 19,
			"body": "> [akhoris](#comment_1_1E6isVsVpnvHvjtqYQ6bWPU7SzQxV1vye5): Tor-Browser-Bundle viene con mala version internaentonces uso este :python zeronet.py --tor disable --proxy 127.0.0.1:9150 --disable_udpLuego utiliza Tor a través el proxy\n\nSi, esa es la *forma antigua* de hacerlo, funciona pero no te da el soporte completo de Tor. Lamentablemente muchas distros aún no actualizan a la versión que requiere ZeroNet para dar soporte completo.",
			"post_id": 10,
			"date_added": 1458280369
		},
		{
			"comment_id": 20,
			"body": "> [llildur](#comment_1_1KxaDqUpfiZTbPoK2TTVxHNwM34DjKEyPz): Hola amigo muy interesante tu blog, soy nuevo en esto de zeronet y me gustaria tener una pagina aquí solo que no se nada de nada, podrias indicarme por donde comenzar? debo saber programar? se un poco de html y c pero nada mas nunca he tenido linux ni ubuntu y desconosco casi por completo los comandos en esos sistemas, agradecería tu ayuda saludos.\n\nEn un comentario un poco más abajo dejé algunas guías de como hacerlo. No es necesario saber programación si clonas un sitio existente.",
			"post_id": 1,
			"date_added": 1459977458
		},
		{
			"comment_id": 21,
			"body": "> [bm2cxjr3mqprbmr](#comment_1_1D4XY5cgPBcQLxoYbKPV2Yi5MQahjLSqLV): buenas raito,usas el jabber? se si me puedes dar tu ID?donde posso obtener um dominio .bit para usarlo em Zeronet?si eu voy hacer una identidad ZeroID como posso hacer para no a perder em caso de reinstalación del sistema?gracias\n\nMi JID está en la barra lateral, raito@pandilla4gatos.tk puedes agregarme.\nPara el dominio necesitas descargar el cliente de Namecoin y conseguir algunas de esas criptomonedas.\nTu identidad se guarda en el archivo data/users.json, respaldando eso o todo el directorio de ZeroNet aseguras poder usar tu identidad en otro sistema.",
			"post_id": 6,
			"date_added": 1463062999
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"8": 1
	}
}