{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "CORONAVÍRUS e CAPITALISMO: o que tem a ver?",
			"body": "#Vídeo: https://siasky.net/AAA7AUCjwX69JRkQ_HGFo6M33h7ka7ef5tD857VUFPvJHg\n\nO texto foi publicado na penúltima edição do jornal Opinião Socialista.\nLeia aqui: https://ipfs.infura.io/ipfs/QmcDXtG53Ey3hxu6uCx9ksVzRk3Dc84462cLGspcjjrhSC\n\nPARTE FINAL DO TEXTO: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1EmrgaFkbFwkrCo5zrm2EquYigiwtpC4uU_2",
			"added": 1599361888
		},
		{
			"topic_id": 2,
			"title": "OS IMPACTOS DA INDÚSTRIA DITA 4.0 NAS RELAÇÕES DE TRABALHO: UM ESTUDO DE CASO DA EDUCAÇÃO SUPERIOR",
			"body": "https://siasky.net/AABGkZB7nx3wnO5N1_8i1I37H3wewB6rBTjeXmEZdn6r0Q",
			"added": 1599370430
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#PÃO PAZ e TERRA\n- https://siasky.net/AADVL3snXZx72NdZZu6HpzpGeN6e9dAwe5ZQE31O-j5wmg\n\nUm documentário sobre os 100 anos da Revolução Russa, que faz um paralelo com os dias atuais, sob a visão de líderes e trabalhadores de todo o mundo.",
				"added": 1599348095
			},
			{
				"comment_id": 3,
				"body": "#O partido de Lênin (bolchevique) era monolítico?\n- https://siasky.net/AABoSeRSxzIGK6qPYXyIfNWS4-lFYZqQw9Rz8XXCSZIscg\n\n\"Nesse vídeo desconstruímos a tese de que o Partido Bolchevique, no período de Lênin (1903-24) era monolítico e autoritário, sendo, por esse motivo, o embrião do regime stalinista futuro da URSS. A referida tese somente consegue ser validada, como procuramos demonstrar, abstraindo da história mesma do partido bolchevique no período de Lênin e tomando apenas algumas passagens isoladas da obra [Que Fazer?](https://ipfs.infura.io/ipfs/QmTCuKeyDwX5CRpXcBeMuirHbACvr7Lb6fnRg5LvS56wCx) de Lênin.\"\n\n#Referências: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1EmrgaFkbFwkrCo5zrm2EquYigiwtpC4uU_0",
				"added": 1599357161
			},
			{
				"comment_id": 4,
				"body": "#STÁLIN: uma análise (des)equilibrada\n- https://siasky.net/AABMY315K_23z5qmdNP7FjN519KMIzmnP2Wsl2zRkU4A6w\n\n\"Nesse vídeo analisamos o papel histórico de Josef Stalin. Em particular na Revolução Russa de 1917, enquanto secretário geral do Partido Comunista, na coletivização forçada na Ucrânia, na Segunda Guerra Mundial e outros casos mais.\"\n\n#Referências: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1EmrgaFkbFwkrCo5zrm2EquYigiwtpC4uU_1",
				"added": 1599358267
			},
			{
				"comment_id": 5,
				"body": "#CORONAVÍRUS e CAPITALISMO: o que tem a ver?\nhttp://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1EmrgaFkbFwkrCo5zrm2EquYigiwtpC4uU/CORONAV+RUS+e+CAPITALISMO+o+que+tem+a+ver",
				"added": 1599362020
			},
			{
				"comment_id": 6,
				"body": "#Ideias Radicais: Teoria da Mais-Valia é furada? REAGINDO\n- https://siasky.net/AAAzmQt6Hu0H3ESMtnribeH9LPqH2fP8l_mdmy9iTfXs4g\n\nREAGIMOS E COMENTAMOS ao vídeo: Por que a teoria da Mais-Valia é FURADA do canal [Ideias Radicais](https://www.youtube.com/channel/UC-NwgkrLPYmzM-xoLr2GX-Q). Se encontra no seguinte link: https://siasky.net/AACM95SIym2xRgtNn6bBLlnAZ8jNTRuAVQg7p1EQjGMhTg\n\nComo veremos, o autor do vídeo (Rafael) não leu nem sequer a obra que cita como fonte de [Eugen von Böhm-Bawerk](https://en.wikipedia.org/wiki/Eugen_von_B%C3%B6hm-Bawerk).",
				"added": 1599363226
			},
			{
				"comment_id": 7,
				"body": "#MARX defende a intervenção do ESTADO no mercado?\n- https://siasky.net/AAD52B7HcGAAq1vKukpSYlgXMlxGaIRCxUo6fKvJtXuRxQ\n\nNesse episódio desconstruímos a tese de que o socialismo marxista defende a intervenção do Estado na economia. Ou mais precisamente, a ideia amplamente difundida nos dias de hoje de que o socialismo seria o controle paulatino e gradual do Estado sobre o conjunto da economia de mercado. Daí as teses malucas de países como Suécia e Noruega (ou Brasil e Venezuela) seriam socialistas, bem como a ideia de que a primeira fase do socialismo, para Marx, estaria em vigor uma economia de mercado \"capitalismo cru\".\n\nNesse vídeo mostramos que tanto a tese liberal do equilíbrio necessário entre oferta e demanda no mercado ([Lei de Say](https://everipedia.org/wiki/lang_en/Say%2527s_law)) quanto a tese de [Thomas Malthus](https://everipedia.org/wiki/lang_en/Thomas_Robert_Malthus) (e [Keynes](https://everipedia.org/wiki/lang_en/John_Maynard_Keynes)) da superprodução (desequilíbrio entre oferta e demanda) são alvo da crítica aguda de Marx.\n\nA crítica aos sistemas liberais e intervencionistas estatais estão presentes em TODOS os manuscritos sobre crítica da economia política, bem como em textos diretamente políticos. Citado nesse Vídeo:\nMARX, K. Crítica ao Programa de Gotha, Boitempo Editorial, 2012. pag.40\n\nLivros em que Marx refuta o sistema protecionista (desenvolvimentista) de Friedrich List:\nMARX, K. Crítica da Economia Nacional (Textos inéditos – 1845). Lisboa: Ulmeiro, 1976.\nMARX, K. Crítica do nacionalismo econômico. 1ª ed. Lisboa: Antígona, 2009.",
				"added": 1599364985
			},
			{
				"comment_id": 8,
				"body": "#Ameaça Comunista?\n- https://siasky.net/AAALTbb-lfWQJbZKASD6olNfz0zQwiT2jlscHum-SXrpzA\n\n\"Republicamos no canal [Orientação Marxista](https://www.youtube.com/channel/UCRLEkZpNRoZQBG8kUTBD8vQ) entrevista concedida ao programa Opinião, organizado pelo [Partido Socialista dos Trabalhadores Unificados (PSTU)](https://www.pstu.org.br/), sobre o discurso da ameaça comunista no Brasil, o domínio de um suposto marxismo cultural etc...\"",
				"added": 1599366858
			},
			{
				"comment_id": 9,
				"body": "#Motoristas do Uber e Youtubers são trabalhadores assalariados\n- https://siasky.net/AABWW2pyRH3E7SEOay4n9WzPrkluV7JAD56-YsDnF8PQ7Q\n\n\"Nesse vídeo mostramos que os trabalhadores do Uber (motoristas de aplicativos no geral) e os Youtubers (e trabalhadores associados à plataformas digitais no geral) são trabalhadores assalariados. Em particular, uma categoria específica que Marx denominou Trabalho por Peça.\"\n\n#As características do salário por peça são as seguintes:\n\n1. a qualidade do trabalho é aqui controlada mediante o próprio produto, que tem de possuir qualidade média.\n\n2. o salário por peça proporciona ao capitalista uma medida inteiramente determinada para a intensidade do trabalho. Ou seja, é pago diretamente em função da produtividade.\n\n3. O indivíduo tem a aparência de ser um livre empreendedor, quando na verdade está umbilicalmente ligado a uma empresa determinada.\n\n4. Nesse caso, é deslocado para os trabalhadores os custos com os meios de produção e possíveis prejuízos dele oriundo. A propriedade dos meios de produção, nesse caso, é também mera aparência, já que o produto possuído pelo trabalhador apenas exerce o papel de meio de produção quando está integrado a empresa que o emprega.",
				"added": 1599368287
			},
			{
				"comment_id": 10,
				"body": "#OS IMPACTOS DA INDÚSTRIA DITA 4.0 NAS RELAÇÕES DE TRABALHO: UM ESTUDO DE CASO DA EDUCAÇÃO SUPERIOR\n- https://siasky.net/AABGkZB7nx3wnO5N1_8i1I37H3wewB6rBTjeXmEZdn6r0Q\n\nPalestrante: Gustavo Machado\nCoordenação: José Ângelo Garíglio\nPromovido pelo Grupo de Pesquisa Universitátis/FAE/UFMG",
				"added": 1599370533
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#PÃO PAZ e TERRA\n- https://siasky.net/AADVL3snXZx72NdZZu6HpzpGeN6e9dAwe5ZQE31O-j5wmg\n\nUm documentário sobre os 100 anos da Revolução Russa, que faz um paralelo com os dias atuais, sob a visão de líderes e trabalhadores de todo o mundo.",
				"added": 1599348127
			}
		]
	},
	"comment_vote": {}
}