{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "Перевод zerotalk на армянский",
			"body": "Здраствуйте ребята. У меня есть желание создать армянский форум. Как мне это сделать?",
			"added": 1536727162
		},
		{
			"topic_id": 2,
			"title": "В принципе возможно ли закрыть всю сеть?",
			"body": "Клонирование зайтов это не нарушение авторских прав. Потому что у ZeroNet-а лицензия GNU GPL v2. А что если кто-то скопирует facebook. И зальёт в ZeroNet. Смогут ли накрыть весь ZeroNet типа мы не можем с вами бороться, поэтому закрываем вcю сеть.",
			"added": 1536989568
		},
		{
			"topic_id": 3,
			"title": "Приватный ключ",
			"body": "А где находится приватный ключ клонированного сайта?",
			"added": 1537016602
		},
		{
			"topic_id": 4,
			"title": "2 вопроса",
			"body": "На моих вопросов можно книгу сделать :D ZeroNet для чайника. Теперь мне интересует как создать zeronet сайт в терминале. В файлах нашёл документ README-ru.md, где написано сделать это\n```bash\n$ zeronet.py siteCreate\nТак вот этот код ни фига не помогает. Вошёл в ютуб что-то другое получилось только на виндовсе.\nНа убунту этот код не работает. На код вообще никак не реагирует. Порт закрыт, никак не смог открыть даже программы из интернета скачивал, чтобы открыть порт не помогает. wi fi роутер tenda n301",
			"added": 1537021992
		},
		{
			"topic_id": 5,
			"title": "Random Agent Spoofer достойная альтернатива",
			"body": "Ребята есть ли достойная альтернатива Random Agent Spoofer? У меня на Firefox Quantom не поддерживается.",
			"added": 1537303437
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 1,
				"body": "Ubuntu",
				"added": 1536727315
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 2,
				"body": "+1",
				"added": 1536727427
			}
		],
		"1_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_417_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Интересный вопрос. Сам-то перевод сделать легко, а вот как добавить нужный язык в меню на ZeroHello, я не нашёл. В исходниках ZeroNet ничего такого не нахожу.\n> Нужно спрашивать @nofish (ZeroMe, блог).\n\nСпасибо",
				"added": 1536746782
			}
		],
		"2_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 4,
				"body": "Обидно.",
				"added": 1537005066
			},
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_422_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Теоретически — запросто, какие-то уже «закрывали», типа LimeWire. В смысле, сеть запретить, понятно, не могут, но бьют по разработчикам клиентов.\n> Но тут у ZN есть бонус — разработка может прямо в ней идти, тот же GitCenter. Но уязвимая точка — www.zeronet.io\n\nВ принципе я думаю если зайт противазаконный разработчик сможет приватный ключ в каком-то другом зайте опубликовать другим разрабам. В случае меня посадят сайтом руководствуйтесь вы. Думаю единственный случай закрыть зеронет. Закрыть доступ к интернету.",
				"added": 1537008454
			},
			{
				"comment_id": 6,
				"body": "У меня сразу 2 вопроса.\nПервый вопрос.\nПредположим уломить разраба неполучилось. Если разраб промолчит о наличии этого сайта с приватным ключом. И о наличии других разрабов? Каким образом они найдут вот этот сайт http://127.0.0.1:43110/Q5oJ4bW5HW6bk8ypH5nR3RvZeSC6CVM2W\nВторой.\nПредположим разраба уломили. Удалил он весь сайт. Но пользователи остались же. Да сайт пропал у разраба. Но вот у пользователей оно должно быть остаться? Или я что-то не так понял смысл децентрализованности.",
				"added": 1537012041
			},
			{
				"comment_id": 7,
				"body": "Интересный подход у zeronet -а. Спасибо.",
				"added": 1537013258
			}
		],
		"1_1oyaErvT1Ww6RVeJvRkp5LgenBpdfws99": [
			{
				"comment_id": 8,
				"body": "О зеронете я узнал от youtube блогера. Жаль у него всего 20 тысяч подписчиков. Если у нас получится завоевать внимание блогеров развлекательного контента. То количество участников будет умножаться ежедневно.",
				"added": 1537023157
			}
		],
		"4_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 9,
				"body": "> [jamesjames](#comment_3_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp): как тебе идея reflevmas про «ZeroNet Handbook»? Составишь? :)\n\nОтличная идея. Я прям чайником себя чуствую в ZeroNet е. Вроде распаковал и запустил, а оказывается здесь есть подводные камни. То порт не открывается, то zeronet:zeronet (644). Сразы скажу нифига не понимаю что это. То ошибки не выдаёт не понимаешь что за фигня. И так далее.",
				"added": 1537058199
			},
			{
				"comment_id": 10,
				"body": "> [nicolaith](#comment_11_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): эмм.. кажется надо очень постараться. чтобы не суметь попасть в zeronetну и на это случай есть гугл и https://zeronet.readthedocs.io/en/latest/да и возиться с пдф-кой имхо труднее (значит и ленивее). чем сделать запись в вике\n\nВ зеронет я уже попал, мне интересно как создать сайт в терминале убунту. Почему именно там? Потому что когда я на винде создаю зайт, то в браузере создавая зайт приватный ключ не приходит, а вот в zeronetcmd приходит. Так вот я подумал, что убунту таже система.",
				"added": 1537110117
			},
			{
				"comment_id": 12,
				"body": "> [nicolaith](#comment_12_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): про создание зайта не подскажу - с нуля создавать не пробовала про открытие порта - на роутере upnp включён? http://www.tendacn.com/en/faq/2210.html\n\nВключён. Отключить?",
				"added": 1537153643
			},
			{
				"comment_id": 13,
				"body": "Проблема была в отсутствии модуля msgpack. Сайт через терминал создан. Теперь вопрос открытия порта больше не интересует спасибо всем желающим помочь.",
				"added": 1537167514
			}
		],
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 11,
				"body": "Что вы думаете о бессрочке https://www.youtube.com/watch?v=wthRqvwjonk ?\nСможете ли вы что-то поменять?",
				"added": 1537110211
			},
			{
				"comment_id": 14,
				"body": "> [balancer73](#comment_428_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): До первых морозов :D\n> И, если мы в ZN, то можно видео заливать в KopyKate или клоны :)\n\nВиноват :D",
				"added": 1537287027
			}
		],
		"1_1G4ABh5yucpdkSnJNrWSttAYMHRsmFGMqV": [
			{
				"comment_id": 15,
				"body": "Думаю из-за таких сайтов потом нас будут заявлять правонарушителями.",
				"added": 1537287503
			}
		],
		"1_1GewTebNkbfbLPvb4ZJKSmRbuEqcRqJJZ4": [
			{
				"comment_id": 16,
				"body": "> [balancer73](#comment_431_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Можно. Но лучше будет его утянуть каким-нибудь открытым прокси, чтобы первоначально стал другим доступен сразу.\n\nА вот каким способом. Кажется мой провайдер не хочет, чтобы я открывал порт. Ни что не помогает.",
				"added": 1537363746
			}
		],
		"5_1FqhDHg7XD7jCemGBNYVSPEWLERCjgmAJo": [
			{
				"comment_id": 17,
				"body": "> [00xd814](#comment_1_1D5vMmjDtz2a834N1DMK3h4Eces2gPzCPp): https://addons.mozilla.org/ru/firefox/addon/random_user_agent/\n\nСпасибо",
				"added": 1537413138
			}
		]
	},
	"comment_vote": {
		"417_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"424_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"3_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp": 1,
		"11_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh": 1
	}
}