{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1513765900,
			"title": "What do you think about golang?",
			"body": "As I'm currently playing a little bit around with the golang programming language I was wondering what you think about it. \n\nGreetz radicallizard.",
			"added": 1513765896
		},
		{
			"topic_id": 1520096404,
			"title": "A wasted life is worse than death?",
			"body": "I'm lost. I have no idea which parh i should take in my life. Should i go to college and study computer science, like my family wants me to do. Or should i study social work. Or should i say \"fuck college\" and get a crappy IT job. I don't know, I think I'm not made for modern life. \n\nI have low self-esteem since the day of my parents divorce. That's because my parents once had heavy fight that I somehow started, and after the fight  my dad said \"look what you have done\". I guess deep down I still think that the whole break up is my fault. Sadly, i have big trust issues and therefore it's pretty hard for me to find someone i can trust. The relationships I had in the past never worked out because of my trust problems. If this where not enough I also have Neurodermatis (it'fucking sucks) and insomnia. Yeah, I'm a complicated person. \n\nOn some days i just want to leave all this mess . Learn bass, write lyrics, find other people, create fucked up music with them and tour through europe with them. Maybe I'm a vagabond. \n\nTimes runnin' out. I have reached my 20s in a few months. I still want to live so many moments. Fullfil my dreams, cause I always think \"a wasted life is worse than death\".  \n \nhttps://www.youtube.com/watch?v=6BKRn5F_nPs",
			"added": 1520096399
		}
	],
	"topic_vote": {
		"1_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1,
		"2_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1,
		"61_1FaP38aQeQwStzruHJ75NLCFc9m48itKdP": 1,
		"1511280941_1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib": 1,
		"1510753547_19t3AncxBxySDwgUBD6MGDRTeMdA2GJTSf": 1,
		"1512404535_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1,
		"1512677933_1L2fmHSaFKB4vFN1GX3KQyZQfaB9CDUF3b": 1,
		"1514631579_13fVMZu2wTNAykEvkYHYfGmTBMSFxz9gFG": 1,
		"1519138520_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1,
		"1520096404_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1,
		"1523817966_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": [
			{
				"comment_id": 1,
				"body": "> [planespherev3](#comment_213_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Too bad so many anarchists here still believe in representative democracy.  [...]\n\nSad but true. People have to wake up.",
				"added": 1498153631
			},
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_69_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Yes, being on ZN is kind of an anarchist act in itself. ;^)\n\nThat's exactly what I thought while reading about ZN. I hope some sites appear soon, otherwise, I will take it in my own hand and create something.",
				"added": 1498154529
			},
			{
				"comment_id": 3,
				"body": "> [tested](#comment_2_18ts75nBNcXqWm6edB8pzn6Hr34JVUCrfx): I'm interested in the concept on anarchy, its appealing and I hope someday, even after my death, humanity mentality would have evolved enough to try it somewhere (can we say that we're already trying some crypto/cyber-anarchy in some places like ZN ?)Creating a website on ZN is relativly easy, and I'm sure if you start an anarchist community it would atract some intersting people, as many of us have probably anarchist philosophies to be curious enough to try ZN. Even a clone of zero talk would be enough to start I guess.\n\nThanks for your encouraging comment. I will definitely try to create something here on ZN.",
				"added": 1498333459
			}
		],
		"10_1DLHbq2nvwpgU4xT3ajhABAW1Lfn3zTZhe": [
			{
				"comment_id": 5,
				"body": "You can also watch people programming live on twitch: https://www.twitch.tv/communities/programming",
				"added": 1498838441
			}
		],
		"1512404535_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": [
			{
				"comment_id": 6,
				"body": "If you want to read \"The Conquest of Bread\" here you go: https://theanarchistlibrary.org/library/petr-kropotkin-the-conquest-of-bread",
				"added": 1512404617
			}
		],
		"1519466824_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X": [
			{
				"comment_id": 7,
				"body": "Just write the riseup guys an email and explain them why you want to use their service. I'm sure you will get an invite ;)",
				"added": 1519489653
			}
		],
		"1520096404_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": [
			{
				"comment_id": 8,
				"body": "> [impernold](#comment_1_1Ec1p56vYhfeoakKfnEjEirKBWWYv5rYpk): This is a real big thing to talk about. But to solve your question of your career, or your future life, we should go slowly. First, just sit back, take deep breaths and calmly think about what is your interest, what is your dream (or dreams), where do you want to see yourself in 4 years or 5 years or even 10 years. Think about them, those questions, try to find an answer for each and tell me.A wasted life is worse than death, but no one's life is wasted unless that one believe so.\n\nMy interests are coding, it-security, politics, art, music, writing and philosophy. \n\nDreams: being independent, find someone i can trust 100%, being in a band and make a record, write a book, create art for an art exhibition, help developing open-source software, make lots of roadtrips, find ways to make the world a better place (at least for some people) and finally cure my neurodermatitis. \n\nHow i see myself in 5 years? I would probably be at university or have a IT job. Hopefully a girlfriend. Having lots of fun with my friends. Playing concerts and create music with a band. Some nice roadtrips or a big journey. \n\nHow i see myself in 10 years? Having a job with a decent work/life blance. Again having lots of fun with my friends. Write and finnish a book. Host an art ehibition.  If i have still the same girlfriend i would probably merry her, if not (time changes) it' also allright. At least i would like to find someone else i can trust.",
				"added": 1520170028
			},
			{
				"comment_id": 9,
				"body": "Thank's for all your comments! You're all proof that their is still some humanity left on earth. <3",
				"added": 1520170118
			}
		],
		"1526051818_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 10,
				"body": "Pedos, leave them kids alone!",
				"added": 1526052655
			}
		]
	},
	"comment_vote": {
		"69_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"213_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"366_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"20_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"2_18ts75nBNcXqWm6edB8pzn6Hr34JVUCrfx": 1,
		"3_1Q6Mxp6VGNuf47vbdAwR7NEZj8E5HQAq6m": 1,
		"3_1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT": 1,
		"22_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"143_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"1_14uGoHUjHsog6Zq2VrbQjqXrzvHLNrM7tu": 1,
		"39_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"2_1QBLGLcgKfcpfLmiDYuDzUKVXFfmTAew55": 1,
		"1_1CY2uyYrh8VLvR3CTyTXY3LTqrKGSNqJW4": 1,
		"1_1QBLGLcgKfcpfLmiDYuDzUKVXFfmTAew55": 1,
		"1_1DMbBh3c4jvrGNycqXj6X2vsDuoSkvynKe": 1,
		"6_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy": 1,
		"57_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1_1Ec1p56vYhfeoakKfnEjEirKBWWYv5rYpk": 1,
		"1_18mG9fYpwGmkt6CqCijJPaAV5JSnoQH5YK": 1,
		"7_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1,
		"10_16KZw5gzYyBdfuW9HSUZiGHmayCEXunYZU": 1,
		"14_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck": 1,
		"47_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": 1
	}
}