{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1627470896,
			"title": "طرح مجلس چه تبعاتی برای کاربران خواهد داشت؟",
			"body": "نیما اکبر‌پور، کلیک بی‌بی‌سی\n\nبرای درک بهتر \"طرح صیانت\" شاید لازم باشد که چند گام به عقب برویم تا دید واضح‌تری از نگاه جمهوری اسلامی به فرم ایده‌آل اینترنت به عنوان یک پیدا کنیم.\n\nفرم ایده‌آل مورد نظر حکومت، ایجاد شبکه‌ای در داخل کشور است که در آن کاربران بتوانند با هم مرتبط باشند اما همه محتوای رد و بدل شده در بستر آن، مانیتور شود. کاربران در این شبکه که به غلط \"اینترنت ملی\" نام‌گذاری شده، می‌توانند خدمات موسوم به دولت الکترونیکی را دریافت کنند اما از نظر تولید و مصرف محتوا رصد خواهند شد. اما مساله اساسی دسترسی این شبکه به اینترنت جهانی است.\n\nهر آن چه که از خارج از مرزها به داخل چنین شبکه‌ای وارد می‌شود باید \"پالایش\" شود. افزون بر این سطوح دسترسی متفاوتی بر حسب شغل کاربر تعریف می‌شود تا مجوز دست‌یابی هر کاربر به اینترنت، نسبت به کاربران دیگر متفاوت باشد. برای مثال یک خبرنگار یا دانشجوی پزشکی نسبت به یک معلم یا کارگر یا مهندس عمران، دسترسی متفاوتی به اینترنت بین‌المللی خواهد داشت.\n\nبا این تفاصیل \"طرح صیانت\" گامی بزرگ برای رسیدن به محدودیت‌های دلخواه حکومت ایران است. چیزی که این روزها اعتراضات به آن را پرشمار کرده، بخش مربوط به سرویس‌های خارجی نظیر شبکه اجتماعی اینستاگرام و پیام‌رسان‌هایی چون واتساپ است.\n\nاین طرح از شرکت‌های خارجی می‌خواهد که در ظرف مدتی معین مجوزهای لازم را برای فعالیت در ایران اخذ کنند، در غیر این صورت مسدود خواهند شد. در عین حال حمایت از ساخت سرویس‌های مشابه و بومی را در دستور خود دارد.\n\nافزون بر این، مجازات‌هایی در این طرح تعبیه شده که برای مثال کارکنان مسئول در دستگاه‌های اجرایی کشور را در صورت استفاده از سرویس‌های خارجی \"بدون مجوز\" به انفصال از خدمت محکوم می‌کند.\n\nاکثریت مخالفان این طرح ساخت سرویس‌های بومی با کیفیت مشابه را غیرممکن می‌دانند و این طرح را باعث نابودی کسب‌وکارهای اینترنتی و تحدید بیشتر آزادی بیان و حریم شخصی کاربران می‌شمارند.",
			"added": 1627470895
		}
	],
	"topic_vote": {
		"1627470896_1LoxXNq8U8JWonnnJPt157fQpm3q9cDk6Y": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}