{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_1H1q2382na7evjuCrQyfwmvDVVDwFHhdqe": [
			{
				"comment_id": 1,
				"body": "杨佩昌：欧美企业如何巧妙实现创新?\n\n杨佩昌 未分类\t浏览次数 (403) 2016-05-04 \n  \n\n20131202111902-675735066　 \n\n　　在国家提出“大众创业、万众创新”战略的背景下，创新已成为当下最热门的词汇之一。尽管政府、企业鼓励创新，但要真正实现创新却不是一件容易的事情。 \n\n\n\n　　的确，创新没有那么简单，也许需要消耗大量的时间和精力。可怕的是，即使投入时间和精力，也不见得收获创新的成果。那么，是否有一种途径，在不经意间就巧妙实现创新了呢? \n\n　　让我们来体会欧美企业、商业人士的一些创新思维和创新做法。 \n\n　　相信很多人都使用过及时贴。人们可以随时把感兴趣的语句或瞬间闪现的思想火花写在上面，然后撕下来粘在书上、墙上或其它地方，用起来很方便。 \n\n　　关于及时贴的发明，有一个很有戏剧性的故事。美国3M公司原计划研制一种强力粘贴剂，于是组织技术部门来做研究，主要的研制者是一位名叫希尔弗的工程师。工程技术人员经过了一年半的时间研究，终于研制成功了。公司领导很高兴，决定组织一个新产品展示会来介绍新研制成功的强力胶水。研发部的技术人员把胶水涂在钩子上用来挂物品。过了一会儿，一个钩子掉了下来，工程师很不好意思;过了一会儿又掉下来一个，工程师心情很难受;没过多久，钩子纷纷脱落，工程师都快哭了，因为当天来了很多重要的客户。工程师无法接受产品失败的现实，一方面公司花费的巨资打了水漂，另一方面客户们在怀疑公司的研发能力，这位工程师内心崩溃了。 \n\n　　而公司另外一位名为阿特·弗雷的工程师就是一个具有创新思维的人。他是教会唱诗班成员，礼拜天参加唱诗班活动时，习惯在歌本里夹上一些纸片以方便记认。但纸片经常滑落，不得不经常弯腰捡起来。这不仅麻烦，而且还要重新找到当初夹的地方。于是他想，要是有一种用时能牢牢地粘在书上，不用时能轻易揭开的“书签”就好了。 \n\n　　这时，他想到了希尔弗研制“失败”的粘合剂，于是“即时贴”诞生了。即时贴不仅可以夹在书里，还有其他更多的用途，比如，当人们随手在一张小纸片上写东西时，一般找不到地方放，只好乱放在桌子上或抽屉里，如果能贴在墙上就好了，于是这种胶水发挥了它的用处。 \n\n　　这其实是一项很伟大的发明，1980年，3M公司正式将这一革命性的产品命名为“post it”， 投入市场，时至今日，它已风行全球，且被评为20世纪改变人类生活方式的十大发明之一。因为这个发明，3M公司赚了大笔的利润，成了一家世界知名的公司。 \n\n　　这就是创新。当时这种粘贴力不强的胶水毫无用处，但是别的技术人员将胶水用在小纸片上的时候，胶水立即产生了作用，这是一种有趣而富有创造力的思维。 \n\n　　创新思维来自情景重构，所谓的情景重构就是一种关联性的重新构建，即把原来的一个意思与不同的人物、场景、时间、地点等联系在一起，从而得到另外一层意义。情景重构也因此被称为上下文重构。情景要素涉及到具体的人、物、事件或时间、地点等，比如一个人打电话约你吃饭，那么打电话的上下文或情景因素就包含时间、地点、什么人参加等。 \n\n　　情景重构是一项具有重要意义的思维创新训练，也是企业教练的基本技能之一，它是改变行为的有效工具。在专业的企业教练看来，情景重构是一种高超的语言艺术和充满魅力的思维模式，因此，本文不将情景重构视为一门技术，而称之为艺术。 \n\n　　情景重构艺术不仅用于技术创新，而且也可以用于商业思维创新。1974年，美国政府为了清理给自由女神像翻新扔下的废料，向社会广泛招标。但几个月过去了，仍无人问津。 \n\n　　远在法国旅行的一位犹太商人听到消息后，立即飞往纽约。看过自由女神像下堆积如山的废旧铜块、螺丝和木料后，他没有提任何条件，当即签下合同。这位犹太商人的举动令纽约商人纷纷嘲笑。因为在纽约，当地政府对垃圾处理有十分苛刻的规定，并且弄不好还会受到当地众多环保组织的法律起诉。 \n\n　　然而，就在大家等着看他“吃不了兜着走”的笑话时，犹太商人开始了清理工程。他组织工人将废料进行分类，然后把废铜熔化之后铸成小自由女神像，并用水泥块和废木料做底座;把废铅、废铝加工成纽约广场图案的钥匙型饰物;最后，他甚至还把从自由女神像身上扫下的灰尘都包了起来出售给花店。 \n\n　　结果不到3个月的时间，犹太商人把那些“100%自由女神像纪念品”销往纽约之外，有的甚至畅销世界各地，让一堆废料变成了350万美元的现金。 \n\n　　在他人看来一无用处的垃圾，在犹太商人手里成了宝贝。如果把这堆废铜放在垃圾桶里它就是垃圾，如果把它放到工厂里重新加工它就成为珍贵的礼物。同样是废铜，它在不同的场景就有不同的意义，这就是情景重构法。 \n\n　　美国“911”事件后的废物处理也如出一辙。世贸大厦倒塌后，一些废料不是被简单运走，而是被加工成各种小礼品，卖给前来参观废墟的游客，负责此项工作的公司也因此赚了很多钱。 \n\n　　远在大洋彼岸的德国也有这样一个商业创新的极佳范例。1989年柏林墙倒塌后，政府打算把所有的墙砖清走，运到一个遥远的地方填埋。但是，要找到这样一个巨大的填埋场并不是件容易的事情。这时，一家公司主动提出帮助处理垃圾，政府正是求之不得，于是很快签订合同。 \n\n　　这家公司把墙砖进行分类，然后打磨成各种形状，装进精美的盒子里卖给德国的各种礼品商店，同时在柏林墙原址周围销售。没想到该礼品广受欢迎，但凡到柏林墙参观的游客都会购买这个礼物，要么自己保存，要么送给亲友，要知道，这可是大名鼎鼎的柏林墙原物，具有特别的纪念意义和历史价值。 \n\n　　无论是“911”的废料还是柏林墙的砖头，在政府眼里均是一堆废物，而在具有创新思维的商人眼里则是宝贝。上述商人的成功之处是把这些废物与特定的情景联系起来，而这些情景就是特定的事件或特定的历史背景。“废物”一旦与某种情景相连接，也就变成了高价值的商品甚至是艺术品。 \n\n　　其实中国也有不少因拆迁而毁掉的珍贵文物、古迹，可是有多少人和美国、德国商人一样，把这些废品重新利用起来，变成礼品、艺术品呢?因此，创新不见得一定要绞尽脑汁，只需要学会情景重构的思维方法。 \n\n　　情景重构的意义不可低估，它甚至可以引发一场技术创新的革命。一位住在德国杜塞尔多夫、名叫索丽思(Lena Solis)的年轻人发明了下一代的洗衣机，而这种洗衣机只有肥皂盒大小，而且重量才300克，随身携带非常方便。 \n\n　　索丽思之所以发明这种“洗衣机”，据她自己说，由于出差频繁，需要经常洗衣，而送去洗衣店不仅价格昂贵，且需要等候很长时间，于是她想到了超声波，利用超声波的震动原理来清洗衣物。 \n\n　　这种新型的“洗衣机”与传统的洗衣机相比，不仅轻巧可以随身携带，而且不伤衣服，特别是衬衣、毛衣、丝巾等怕磨损物品和贵重衣物。更多的好处在于，洗涤效果超好，且时间很短，每次不超过30分钟。尤其让客户喜爱的是，该洗衣机只有一个开关，不需要选择复杂的参数。产品一经推出，立即受到全世界的追捧，订单从全球各地蜂拥而至，产品供不应求。 \n\n　　索丽思之所以取得成功，是因为她具有“情景重构”的思维能力，即，将医疗情景中的超声波转移到生活情景中的洗衣。这种情景重构不是简单的物理嫁接，往往会产生神奇的“化学”作用，造成了颠覆性的产品创新。 \n\n　　创新可以说无处不在，只要学会情景重构，创新其实并不是那么困难。如果企业领导者掌握了情景重构能力，企业创新就有可能更上一层楼，自然而然会创造更多的财富。对于企业管理者、技术人员和普通员工而言，情景重构不但可以改变惯有的思维模式，培养创新意识，而且也可以用于自我修练和自我管理。如果你有某种自己不喜欢的行为，比如情绪冲动而顶撞上司、工作提不起兴趣、害怕与客户沟通等，那么“情景重构”就是一个绝佳的改变工具。 \n\n　　《企业管理》杂志专稿",
				"added": 1462375737
			}
		]
	},
	"comment_vote": {}
}