{
	"next_topic_id": 24,
	"topic": [
		{
			"topic_id": 1,
			"title": "xiaolan.me进不去，是不是被墙了",
			"body": "",
			"added": 1484477433,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "-=闲聊畅谈板块=-",
			"body": "",
			"added": 1484477468,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "新增彻底屏蔽刷屏的人的方法。ZeroNet的新版0.5.1已经推送，界面有中文翻译了！原生支持ZeroMe发图，升级方法见内文。【论坛公告】社交功能ZeroMe已经发布！本论坛域名启用http://127.0.0.1:43110/GFWtalk.bit本站明网地址GFWtalk.bit.no.com大家注意，由于版块调整，进版块后重新点关注，你才能信息流收到版块的新帖",
			"body": "",
			"added": 1484477566,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "常见问题FAQ（辛苦整理，请大伙不要姑父我的努力，尽量浏览一遍目录再提问）6/1 Update 增加Freenet的问题，增加在VPS上搭建ZeroNet（.com绑定.bit），并实现远程访问（如手机访问）",
			"body": "",
			"added": 1484477598,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "新人都来看置顶帖，请不要重复提问（11/10 Update 增加ZeroMe原生的发图功能介绍、补充移机恢复帐号的方法、设置启动参数的另一种方法（各操作系统通用）、注册ID方法，增加FAQ链接）",
			"body": "",
			"added": 1484477633,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "Google Terms of Service  Last modified: April 14, 2014 (view archived versions)  Welcome to Google!  Thanks for using our products and services (“Services”). The Services are provided by Google Inc. (“Google”), located at 1600 Amphitheatre Parkway, Mountain View, CA 94043, United States.  By using our Services, you are agreeing to these terms. Please read them carefully.  Our Services are very diverse, so sometimes additional terms or product requirements (including age requirements) may apply. Additional terms will be available with the relevant Services, and those additional terms become part of your agreement with us if you use those Services.  Using our Services  You must follow any policies made available to you within the Services.  Don’t misuse our Services. For example, don’t interfere with our Services or try to access them using a method other than the interface and the instructions that we provide. You may use our Services only as permitted by law, including applicable export and re-export control laws and regulations. We may suspend or stop providing our Services to you if you do not comply with our terms or policies or if we are investigating suspected misconduct.  Using our Services does not give you ownership of any intellectual property rights in our Services or the content you access. You may not use content from our Services unless you obtain permission from its owner or are otherwise permitted by law. These terms do not grant you the right to use any branding or logos used in our Services. Don’t remove, obscure, or alter any legal notices displayed in or along with our Services.  Our Services display some content that is not Google’s. This content is the sole responsibility of the entity that makes it available. We may review content to determine whether it is illegal or violates our policies, and we may remove or refuse to display content that we reasonably believe violates our policies or the law. But that does not necessarily mean that we review content, so please don’t assume that we do.  In connection with your use of the Services, we may send you service announcements, administrative messages, and other information. You may opt out of some of those communications.  Some of our Services are available on mobile devices. Do not use such Services in a way that distracts you and prevents you from obeying traffic or safety laws.  Your Google Account  You may need a Google Account in order to use some of our Services. You may create your own Google Account, or your Google Account may be assigned to you by an administrator, such as your employer or educational institution. If you are using a Google Account assigned to you by an administrator, different or additional terms may apply and your administrator may be able to access or disable your account.  To protect your Google Account, keep your password confidential. You are responsible for the activity that happens on or through your Google Account. Try not to reuse your Google Account password on third-party applications. If you learn of any unauthorized use of your password or Google Account, follow these instructions.  Privacy and Copyright Protection  Google’s privacy policies explain how we treat your personal data and protect your privacy when you use our Services. By using our Services, you agree that Google can use such data in accordance with our privacy policies.  We respond to notices of alleged copyright infringement and terminate accounts of repeat infringers according to the process set out in the U.S. Digital Millennium Copyright Act.  We provide information to help copyright holders manage their intellectual property online. If you think somebody is violating your copyrights and want to notify us, you can find information about submitting notices and Google’s policy about responding to notices in our Help Center.  Your Content in our Services  Some of our Services allow you to upload, submit, store, send or receive content. You retain ownership of any intellectual property rights that you hold in that content. In short, what belongs to you stays yours.  When you upload, submit, store, send or receive content to or through our Services, you give Google (and those we work with) a worldwide license to use, host, store, reproduce, modify, create derivative works (such as those resulting from translations, adaptations or other changes we make so that your content works better with our Services), communicate, publish, publicly perform, publicly display and distribute such content. The rights you grant in this license are for the limited purpose of operating, promoting, and improving our Services, and to develop new ones. This license continues even if you stop using our Services (for example, for a business listing you have added to Google Maps). Some Services may offer you ways to access and remove content that has been provided to that Service. Also, in some of our Services, there are terms or settings that narrow the scope of our use of the content submitted in those Services. Make sure you have the necessary rights to grant us this license for any content that you submit to our Services.  Our automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection. This analysis occurs as the content is sent, received, and when it is stored.  If you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our Services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account. For example, you can choose your settings so your name and photo do not appear in an ad.  You can find more information about how Google uses and stores content in the privacy policy or additional terms for particular Services. If you submit feedback or suggestions about our Services, we may use your feedback or suggestions without obligation to you.  About Software in our Services  When a Service requires or includes downloadable software, this software may update automatically on your device once a new version or feature is available. Some Services may let you adjust your automatic update settings.  Google gives you a personal, worldwide, royalty-free, non-assignable and non-exclusive license to use the software provided to you by Google as part of the Services. This license is for the sole purpose of enabling you to use and enjoy the benefit of the Services as provided by Google, in the manner permitted by these terms. You may not copy, modify, distribute, sell, or lease any part of our Services or included software, nor may you reverse engineer or attempt to extract the source code of that software, unless laws prohibit those restrictions or you have our written permission.  Open source software is important to us. Some software used in our Services may be offered under an open source license that we will make available to you. There may be provisions in the open source license that expressly override some of these terms.  Modifying and Terminating our Services  We are constantly changing and improving our Services. We may add or remove functionalities or features, and we may suspend or stop a Service altogether.  You can stop using our Services at any time, although we’ll be sorry to see you go. Google may also stop providing Services to you, or add or create new limits to our Services at any time.  We believe that you own your data and preserving your access to such data is important. If we discontinue a Service, where reasonably possible, we will give you reasonable advance notice and a chance to get information out of that Service.  Our Warranties and Disclaimers  We provide our Services using a commercially reasonable level of skill and care and we hope that you will enjoy using them. But there are certain things that we don’t promise about our Services.  OTHER THAN AS EXPRESSLY SET OUT IN THESE TERMS OR ADDITIONAL TERMS, NEITHER GOOGLE NOR ITS SUPPLIERS OR DISTRIBUTORS MAKE ANY SPECIFIC PROMISES ABOUT THE SERVICES. FOR EXAMPLE, WE DON’T MAKE ANY COMMITMENTS ABOUT THE CONTENT WITHIN THE SERVICES, THE SPECIFIC FUNCTIONS OF THE SERVICES, OR THEIR RELIABILITY, AVAILABILITY, OR ABILITY TO MEET YOUR NEEDS. WE PROVIDE THE SERVICES “AS IS”.  SOME JURISDICTIONS PROVIDE FOR CERTAIN WARRANTIES, LIKE THE IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. TO THE EXTENT PERMITTED BY LAW, WE EXCLUDE ALL WARRANTIES.  Liability for our Services  WHEN PERMITTED BY LAW, GOOGLE, AND GOOGLE’S SUPPLIERS AND DISTRIBUTORS, WILL NOT BE RESPONSIBLE FOR LOST PROFITS, REVENUES, OR DATA, FINANCIAL LOSSES OR INDIRECT, SPECIAL, CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES.  TO THE EXTENT PERMITTED BY LAW, THE TOTAL LIABILITY OF GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, FOR ANY CLAIMS UNDER THESE TERMS, INCLUDING FOR ANY IMPLIED WARRANTIES, IS LIMITED TO THE AMOUNT YOU PAID US TO USE THE SERVICES (OR, IF WE CHOOSE, TO SUPPLYING YOU THE SERVICES AGAIN).  IN ALL CASES, GOOGLE, AND ITS SUPPLIERS AND DISTRIBUTORS, WILL NOT BE LIABLE FOR ANY LOSS OR DAMAGE THAT IS NOT REASONABLY FORESEEABLE.  Business uses of our Services  If you are using our Services on behalf of a business, that business accepts these terms. It will hold harmless and indemnify Google and its affiliates, officers, agents, and employees from any claim, suit or action arising from or related to the use of the Services or violation of these terms, including any liability or expense arising from claims, losses, damages, suits, judgments, litigation costs and attorneys’ fees.  About these Terms  We may modify these terms or any additional terms that apply to a Service to, for example, reflect changes to the law or changes to our Services. You should look at the terms regularly. We’ll post notice of modifications to these terms on this page. We’ll post notice of modified additional terms in the applicable Service. Changes will not apply retroactively and will become effective no sooner than fourteen days after they are posted. However, changes addressing new functions for a Service or changes made for legal reasons will be effective immediately. If you do not agree to the modified terms for a Service, you should discontinue your use of that Service.  If there is a conflict between these terms and the additional terms, the additional terms will control for that conflict.  These terms control the relationship between Google and you. They do not create any third party beneficiary rights.  If you do not comply with these terms, and we don’t take action right away, this doesn’t mean that we are giving up any rights that we may have (such as taking action in the future).  If it turns out that a particular term is not enforceable, this will not affect any other terms.  The laws of California, U.S.A., excluding California’s conflict of laws rules, will apply to any disputes arising out of or relating to these terms or the Services. All claims arising out of or relating to these terms or the Services will be litigated exclusively in the federal or state courts of Santa Clara County, California, USA, and you and Google consent to personal jurisdiction in those courts.  For information about how to contact Google, please visit our contact page.",
			"body": "",
			"added": 1484477727,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "比特币真的已经死了么？",
			"body": "",
			"added": 1484477771,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 8,
			"title": "国内视频站点广告时间为何那么长？",
			"body": "",
			"added": 1484477785,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 9,
			"title": "希捷苏州工厂宣布关闭，这是怎么了？",
			"body": "",
			"added": 1484477798,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "Technologies and Principles",
			"body": "",
			"added": 1484477912,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 11,
			"title": "At Google, we pursue ideas and products that often push the limits of existing technology. As a company that acts responsibly, we work hard to make sure any innovation is balanced with the appropriate level of privacy and security for our users. Our Privacy Principles help guide decisions we make at every level of our company, so we can help protect and empower our users while we fulfill our ongoing mission to organize the world’s information.",
			"body": "",
			"added": 1484477950,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 12,
			"title": "“Focus on providing the best user experience” is the first tenet of Google’s philosophy. When users share information with us, it allows us to build services and products that are valuable to them. We believe that focusing on the user fosters both the products and privacy-enhancing features that have fueled innovation and built a loyal audience of users online.  We learn from the typos and spelling mistakes we all make when searching to help give you quicker and more accurate search results. So if you type [grizzly pears] we can guess you probably meant [grizzly bears].",
			"body": "",
			"added": 1484477973,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 13,
			"title": "Our ambition is to be at the leading edge of technology, including the development of tools that help users manage their personal information in a simple, accessible manner without detracting from a valuable user experience. We comply with privacy laws, and additionally work internally and with regulators and industry partners to develop and implement strong privacy standards.  We designed Google+ with circles to make it easy to share different things with different people. So you can put your friends in one circle, your family in another and your boss in a circle all by himself – just like real life.",
			"body": "",
			"added": 1484477996,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 14,
			"title": "We strive to show users the information used to customize our services. Where appropriate, we aim to be transparent about the information we have about individual users and how we use that information to deliver our services.  Google Dashboard helps answer the question, “What does Google know about me?” It shows you the information stored in your Google Account, like your last Blogger blog or your uploaded photos, and enables you to change your privacy settings for many Google products from one central location.",
			"body": "",
			"added": 1484478013,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 15,
			"title": "People have different privacy concerns and needs. To best serve the full range of our users, Google strives to offer them meaningful and fine-grained choices over the use of their personal information. We believe personal information should not be held hostage and we are committed to building products that let users export their personal information to other services. We don’t sell users’ personal information.  With our privacy tools you can encrypt the search traffic between your computer and Google, browse the internet in private, delete your search history, move your data out of Google products easily with our Data Liberation effort, and much more.",
			"body": "",
			"added": 1484478028,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 16,
			"title": "We recognize our responsibility to protect the data that users entrust to us. We take security issues seriously and work together with a large community of users, developers and external security experts to make the Internet safer and more secure.  We design security and resilience into our products from the ground up. Our automated scanners use data to protect millions of users each day from malware, phishing scams, fraud, and spam.",
			"body": "",
			"added": 1484478054,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 17,
			"title": "A cookie is a small piece of text sent to your browser by a website you visit. It helps the website to remember information about your visit, like your preferred language and other settings. That can make your next visit easier and the site more useful to you. Cookies play an important role. Without them, using the web would be a much more frustrating experience.",
			"body": "",
			"added": 1484478084,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 18,
			"title": "We use cookies for many purposes. We use them, for example, to remember your safe search preferences, to make the ads you see more relevant to you, to count how many visitors we receive to a page, to help you sign up for our services and to protect your data.  You can see a list of the types of cookies used by Google and also find out how Google and our partners use cookies in advertising. Our privacy policy explains how we protect your privacy in our use of cookies and other information.",
			"body": "",
			"added": 1484478110,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 19,
			"title": "Welcome! The articles in this guide will give you more information about how Google's products work and how you can manage your privacy. To learn more about what you can do to protect yourself and your family online, visit our Safety Center. Search  Delete searches and browsing activity Your location in Search Remove information from Google YouTube  View and manage YouTube watch history View and manage YouTube search history View and manage video privacy settings Control YouTube ads based on my interests Collection and use of information on YouTube Kids YouTube account settings YouTube video settings Delete your YouTube channel Google Maps  See your personal places in Maps See your location on Maps Find your reservations, flight info and more in Maps View or delete your Google Maps history Manage or delete location history Improve your location accuracy See and manage your timeline Add, delete, or share photos of places Android Nexus Devices  Manage location for your device Manage security settings Manage settings for Google apps and services on any device that has Google Play installed Manage your location history Manage location settings for apps Back up or restore data on your device Google Play  Add an account on your device Manage your shared Play activity Read books on Google Play Nearby player permissions Sharing data with news and magazine publishers Sharing your game activity Google Drive  Sharing basics Access your files offline Privacy and policies Manage your maps in Google Drive Google Docs (including Docs, Sheets, Slides, Forms, and Drawings)  Sharing basics Publish a document, spreadsheet, presentation, or drawing Book Search  Make bookshelves public or private Choose to link your Google Profile to Google Books What Google keeps track of as you use Google Books Google Payments  About Google Payments Verify your identity Disable, close, or reopen your Google Payments account Set your payment method with a site or app Google Groups  Control group permissions Edit group permissions Configure member identity settings Delete a post you authored Delete, reset or disable a group",
			"body": "",
			"added": 1484478138,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 20,
			"title": "Learn more about privacy and security  We’re committed to protecting your privacy, improving your security, and building easy-to-use tools to give you choice and control.  We're committed to your privacy and security  When you use our services, you trust us with your information. Learn more about how we keep your personal information private and safe — and put you in control.  Google Safety Center  Keeping the web safe for everyone is a shared responsibility. Learn what you can do to protect yourself and your family online.  Incognito Mode  Learn how to browse incognito in Google Chrome, so pages you open and files you download aren’t recorded in Chrome’s browsing or download history. Find out how to access incognito mode.",
			"body": "",
			"added": 1484478173,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 21,
			"title": "My Account  Control, protect, and secure your account, all in one place. My Account gives you quick access to settings and tools that let you safeguard your data and protect your privacy.  Google Product Privacy Guide  As you use Gmail, Search, YouTube, and other products from Google, you have the power to control and protect your personal information and usage history. The Google Product Privacy Guide can help you find information about how to manage some of the privacy features built into Google's products.",
			"body": "",
			"added": 1484478188,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 22,
			"title": "Welcome to the Google Privacy Policy  When you use Google services, you trust us with your information. This Privacy Policy is meant to help you understand what data we collect, why we collect it, and what we do with it. This is important; we hope you will take time to read it carefully. And remember, you can find controls to manage your information and protect your privacy and security at My Account.",
			"body": "",
			"added": 1484478211,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 23,
			"title": "Privacy Policy  Hide examples Last modified: August 29, 2016 (view archived versions) Download PDF version There are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.  Our Privacy Policy explains:  What information we collect and why we collect it. How we use that information. The choices we offer, including how to access and update information. We’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.  Back to top Information we collect  We collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.  We collect information in the following ways:  Information you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.  Information we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:  Device information  We collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.  Log information  When you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:  details of how you used our service, such as your search queries. telephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls. Internet protocol address. device event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL. cookies that may uniquely identify your browser or your Google Account. Location information  When you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.  Unique application numbers  Certain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.  Local storage  We may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.  Cookies and similar technologies  We and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.  Information we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.  Back to top How we use information we collect  We use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.  We may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.  If you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.  When you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.  We use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.  Our automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.  We may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.  We will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.  Google processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.  Back to top Transparency and choice  People have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:  Review and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account. Review and control certain types of information tied to your Google Account by using Google Dashboard. View and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services. Adjust how the Profile associated with your Google Account appears to others. Control who you share information with through your Google Account. Take information associated with your Google Account out of many of our services. Choose whether your Profile name and Profile photo appear in shared endorsements that appear in ads. You may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.  Back to top Information you share  Many of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.  Back to top Accessing and updating your personal information  Whenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.  We may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).  Where we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.  Back to top Information we share  We do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:  With your consent  We will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.  With domain administrators  If your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:  view statistics regarding your account, like statistics regarding applications you install. change your account password. suspend or terminate your account access. access or retain information stored as part of your account. receive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request. restrict your ability to delete or edit information or privacy settings. Please refer to your domain administrator’s privacy policy for more information.  For external processing  We provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.  For legal reasons  We will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:  meet any applicable law, regulation, legal process or enforceable governmental request. enforce applicable Terms of Service, including investigation of potential violations. detect, prevent, or otherwise address fraud, security or technical issues. protect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law. We may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.  If Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.  Back to top Information security  We work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:  We encrypt many of our services using SSL. We offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome. We review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems. We restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations. Back to top When this Privacy Policy applies  Our Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.  Our Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.  Back to top Compliance and cooperation with regulatory authorities  We regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.  Back to top Changes  Our Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.  Back to top Specific product practices  The following notices explain specific privacy practices with respect to certain Google products and services that you may use:  Chrome and Chrome OS Play Books Payments Fiber Project Fi Google Apps for Education For more information about some of our most popular services, you can visit the Google Product Privacy Guide.  Back to top Other useful privacy and security related materials  Further useful privacy and security related materials can be found through Google’s policies and principles pages, including:  Information about our technologies and principles, which includes, among other things, more information on how Google uses cookies. technologies we use for advertising. how we recognize patterns like faces. A page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products. The Privacy Checkup tool, which makes it easy to review your key privacy settings. Google’s safety center, which provides information on how to stay safe and secure online. We keep your personal information private and safe — and put you in control.  Learn more about our commitments to your privacy and security.",
			"body": "",
			"added": 1484478233,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"37_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 1,
				"body": "Privacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478295
			}
		],
		"23_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 2,
				"body": "Privacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478325
			},
			{
				"comment_id": 3,
				"body": "FAQ\n\nHow does Google protect my privacy and keep my information secure?\n\nWe know security and privacy are important to you – and they are important to us, too. We make it a priority to provide strong security and give you confidence that your information is safe and accessible when you need it.\n\nWe’re constantly working to ensure strong security, protect your privacy, and make Google even more effective and efficient for you. We spend hundreds of millions of dollars every year on security, and employ world-renowned experts in data security to keep your information safe. We also built easy-to-use privacy and security tools like Google Dashboard, 2-step verification and Ads Settings. So when it comes to the information you share with Google, you’re in control.\n\nYou can learn more about safety and security online, including how to protect yourself and your family online, at the Google Safety Center.\n\nLearn more about how we keep your personal information private and safe — and put you in control.\n\nHow can I remove information about myself from Google's search results?\n\nGoogle search results are a reflection of the content publicly available on the web. Search engines can’t remove content directly from websites, so removing search results from Google wouldn’t remove the content from the web. If you want to remove something from the web, you should contact the webmaster of the site the content is posted on and ask him or her to make a change. Once the content has been removed and Google has noted the update, the information will no longer appear in Google’s search results. If you have an urgent removal request, you can also visit our help page for more information.\n\nAre my search queries sent to websites when I click on Google Search results?\n\nIn some cases, yes. When you click on a search result in Google Search, your web browser also may send the Internet address, or URL, of the search results page to the destination webpage as the HTTP Referrer. The URL of the search results page may sometimes contain the search query you entered. If you are using SSL Search (Google’s encrypted search functionality), under most circumstances, your search terms will not be sent as part of the URL in the HTTP Referrer. There are some exceptions to this behavior, such as if you are using some less popular browsers. More information on SSL Search can be found here. Search queries or information contained in the HTTP Referrer may be available via Google Analytics or an application programming interface (API). In addition, advertisers may receive information relating to the exact keywords that triggered an ad click.",
				"added": 1484478379
			},
			{
				"comment_id": 10,
				"body": "Welcome to the Google Privacy Policy\n\nWhen you use Google services, you trust us with your information. This Privacy Policy is meant to help you understand what data we collect, why we collect it, and what we do with it. This is important; we hope you will take time to read it carefully. And remember, you can find controls to manage your information and protect your privacy and security at My Account.\n\nPrivacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478558
			}
		],
		"1_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 4,
				"body": "FAQ\n\nHow does Google protect my privacy and keep my information secure?\n\nWe know security and privacy are important to you – and they are important to us, too. We make it a priority to provide strong security and give you confidence that your information is safe and accessible when you need it.\n\nWe’re constantly working to ensure strong security, protect your privacy, and make Google even more effective and efficient for you. We spend hundreds of millions of dollars every year on security, and employ world-renowned experts in data security to keep your information safe. We also built easy-to-use privacy and security tools like Google Dashboard, 2-step verification and Ads Settings. So when it comes to the information you share with Google, you’re in control.\n\nYou can learn more about safety and security online, including how to protect yourself and your family online, at the Google Safety Center.\n\nLearn more about how we keep your personal information private and safe — and put you in control.\n\nHow can I remove information about myself from Google's search results?\n\nGoogle search results are a reflection of the content publicly available on the web. Search engines can’t remove content directly from websites, so removing search results from Google wouldn’t remove the content from the web. If you want to remove something from the web, you should contact the webmaster of the site the content is posted on and ask him or her to make a change. Once the content has been removed and Google has noted the update, the information will no longer appear in Google’s search results. If you have an urgent removal request, you can also visit our help page for more information.\n\nAre my search queries sent to websites when I click on Google Search results?\n\nIn some cases, yes. When you click on a search result in Google Search, your web browser also may send the Internet address, or URL, of the search results page to the destination webpage as the HTTP Referrer. The URL of the search results page may sometimes contain the search query you entered. If you are using SSL Search (Google’s encrypted search functionality), under most circumstances, your search terms will not be sent as part of the URL in the HTTP Referrer. There are some exceptions to this behavior, such as if you are using some less popular browsers. More information on SSL Search can be found here. Search queries or information contained in the HTTP Referrer may be available via Google Analytics or an application programming interface (API). In addition, advertisers may receive information relating to the exact keywords that triggered an ad click.",
				"added": 1484478401
			},
			{
				"comment_id": 5,
				"body": "Welcome to the Google Privacy Policy\n\nWhen you use Google services, you trust us with your information. This Privacy Policy is meant to help you understand what data we collect, why we collect it, and what we do with it. This is important; we hope you will take time to read it carefully. And remember, you can find controls to manage your information and protect your privacy and security at My Account.\n\nPrivacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478420
			}
		],
		"9_1Q9M3bkpKgZzKn2BR3z3e2SUeha6zahzm4": [
			{
				"comment_id": 6,
				"body": "Welcome to the Google Privacy Policy\n\nWhen you use Google services, you trust us with your information. This Privacy Policy is meant to help you understand what data we collect, why we collect it, and what we do with it. This is important; we hope you will take time to read it carefully. And remember, you can find controls to manage your information and protect your privacy and security at My Account.\n\nPrivacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478479
			}
		],
		"1_12nosggn5KYWFu3SmxcJUzdi98WGPrKaki": [
			{
				"comment_id": 7,
				"body": "Welcome to the Google Privacy Policy\n\nWhen you use Google services, you trust us with your information. This Privacy Policy is meant to help you understand what data we collect, why we collect it, and what we do with it. This is important; we hope you will take time to read it carefully. And remember, you can find controls to manage your information and protect your privacy and security at My Account.\n\nPrivacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478505
			}
		],
		"1_1H8Wn2KpUpjZw2Tv7PrYTo5Nqt8fo9E1JE": [
			{
				"comment_id": 8,
				"body": "Welcome to the Google Privacy Policy\n\nWhen you use Google services, you trust us with your information. This Privacy Policy is meant to help you understand what data we collect, why we collect it, and what we do with it. This is important; we hope you will take time to read it carefully. And remember, you can find controls to manage your information and protect your privacy and security at My Account.\n\nPrivacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478530
			},
			{
				"comment_id": 9,
				"body": "Welcome to the Google Privacy Policy\n\nWhen you use Google services, you trust us with your information. This Privacy Policy is meant to help you understand what data we collect, why we collect it, and what we do with it. This is important; we hope you will take time to read it carefully. And remember, you can find controls to manage your information and protect your privacy and security at My Account.\n\nPrivacy Policy\n\nHide examples\nLast modified: August 29, 2016 (view archived versions)\nDownload PDF version\nThere are many different ways you can use our services – to search for and share information, to communicate with other people or to create new content. When you share information with us, for example by creating a Google Account, we can make those services even better – to show you more relevant search results and ads, to help you connect with people or to make sharing with others quicker and easier. As you use our services, we want you to be clear how we’re using information and the ways in which you can protect your privacy.\n\nOur Privacy Policy explains:\n\nWhat information we collect and why we collect it.\nHow we use that information.\nThe choices we offer, including how to access and update information.\nWe’ve tried to keep it as simple as possible, but if you’re not familiar with terms like cookies, IP addresses, pixel tags and browsers, then read about these key terms first. Your privacy matters to Google so whether you are new to Google or a long-time user, please do take the time to get to know our practices – and if you have any questions contact us.\n\nBack to top\nInformation we collect\n\nWe collect information to provide better services to all of our users – from figuring out basic stuff like which language you speak, to more complex things like which ads you’ll find most useful, the people who matter most to you online, or which YouTube videos you might like.\n\nWe collect information in the following ways:\n\nInformation you give us. For example, many of our services require you to sign up for a Google Account. When you do, we’ll ask for personal information, like your name, email address, telephone number or credit card to store with your account. If you want to take full advantage of the sharing features we offer, we might also ask you to create a publicly visible Google Profile, which may include your name and photo.\n\nInformation we get from your use of our services. We collect information about the services that you use and how you use them, like when you watch a video on YouTube, visit a website that uses our advertising services, or view and interact with our ads and content. This information includes:\n\nDevice information\n\nWe collect device-specific information (such as your hardware model, operating system version, unique device identifiers, and mobile network information including phone number). Google may associate your device identifiers or phone number with your Google Account.\n\nLog information\n\nWhen you use our services or view content provided by Google, we automatically collect and store certain information in server logs. This includes:\n\ndetails of how you used our service, such as your search queries.\ntelephony log information like your phone number, calling-party number, forwarding numbers, time and date of calls, duration of calls, SMS routing information and types of calls.\nInternet protocol address.\ndevice event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL.\ncookies that may uniquely identify your browser or your Google Account.\nLocation information\n\nWhen you use Google services, we may collect and process information about your actual location. We use various technologies to determine location, including IP address, GPS, and other sensors that may, for example, provide Google with information on nearby devices, Wi-Fi access points and cell towers.\n\nUnique application numbers\n\nCertain services include a unique application number. This number and information about your installation (for example, the operating system type and application version number) may be sent to Google when you install or uninstall that service or when that service periodically contacts our servers, such as for automatic updates.\n\nLocal storage\n\nWe may collect and store information (including personal information) locally on your device using mechanisms such as browser web storage (including HTML 5) and application data caches.\n\nCookies and similar technologies\n\nWe and our partners use various technologies to collect and store information when you visit a Google service, and this may include using cookies or similar technologies to identify your browser or device. We also use these technologies to collect and store information when you interact with services we offer to our partners, such as advertising services or Google features that may appear on other sites. Our Google Analytics product helps businesses and site owners analyze the traffic to their websites and apps. When used in conjunction with our advertising services, such as those using the DoubleClick cookie, Google Analytics information is linked, by the Google Analytics customer or by Google, using Google technology, with information about visits to multiple sites.\n\nInformation we collect when you are signed in to Google, in addition to information we obtain about you from partners, may be associated with your Google Account. When information is associated with your Google Account, we treat it as personal information. For more information about how you can access, manage or delete information that is associated with your Google Account, visit the Transparency and choice section of this policy.\n\nBack to top\nHow we use information we collect\n\nWe use the information we collect from all of our services to provide, maintain, protect and improve them, to develop new ones, and to protect Google and our users. We also use this information to offer you tailored content – like giving you more relevant search results and ads.\n\nWe may use the name you provide for your Google Profile across all of the services we offer that require a Google Account. In addition, we may replace past names associated with your Google Account so that you are represented consistently across all our services. If other users already have your email, or other information that identifies you, we may show them your publicly visible Google Profile information, such as your name and photo.\n\nIf you have a Google Account, we may display your Profile name, Profile photo, and actions you take on Google or on third-party applications connected to your Google Account (such as +1’s, reviews you write and comments you post) in our services, including displaying in ads and other commercial contexts. We will respect the choices you make to limit sharing or visibility settings in your Google Account.\n\nWhen you contact Google, we keep a record of your communication to help solve any issues you might be facing. We may use your email address to inform you about our services, such as letting you know about upcoming changes or improvements.\n\nWe use information collected from cookies and other technologies, like pixel tags, to improve your user experience and the overall quality of our services. One of the products we use to do this on our own services is Google Analytics. For example, by saving your language preferences, we’ll be able to have our services appear in the language you prefer. When showing you tailored ads, we will not associate an identifier from cookies or similar technologies with sensitive categories, such as those based on race, religion, sexual orientation or health.\n\nOur automated systems analyze your content (including emails) to provide you personally relevant product features, such as customized search results, tailored advertising, and spam and malware detection.\n\nWe may combine personal information from one service with information, including personal information, from other Google services – for example to make it easier to share things with people you know. Depending on your account settings, your activity on other sites and apps may be associated with your personal information in order to improve Google’s services and the ads delivered by Google.\n\nWe will ask for your consent before using information for a purpose other than those that are set out in this Privacy Policy.\n\nGoogle processes personal information on our servers in many countries around the world. We may process your personal information on a server located outside the country where you live.\n\nBack to top\nTransparency and choice\n\nPeople have different privacy concerns. Our goal is to be clear about what information we collect, so that you can make meaningful choices about how it is used. For example, you can:\n\nReview and update your Google activity controls to decide what types of data, such as videos you’ve watched on YouTube or past searches, you would like saved with your account when you use Google services. You can also visit these controls to manage whether certain activity is stored in a cookie or similar technology on your device when you use our services while signed-out of your account.\nReview and control certain types of information tied to your Google Account by using Google Dashboard.\nView and edit your preferences about the Google ads shown to you on Google and across the web, such as which categories might interest you, using Ads Settings. You can also visit that page to opt out of certain Google advertising services.\nAdjust how the Profile associated with your Google Account appears to others.\nControl who you share information with through your Google Account.\nTake information associated with your Google Account out of many of our services.\nChoose whether your Profile name and Profile photo appear in shared endorsements that appear in ads.\nYou may also set your browser to block all cookies, including cookies associated with our services, or to indicate when a cookie is being set by us. However, it’s important to remember that many of our services may not function properly if your cookies are disabled. For example, we may not remember your language preferences.\n\nBack to top\nInformation you share\n\nMany of our services let you share information with others. Remember that when you share information publicly, it may be indexable by search engines, including Google. Our services provide you with different options on sharing and removing your content.\n\nBack to top\nAccessing and updating your personal information\n\nWhenever you use our services, we aim to provide you with access to your personal information. If that information is wrong, we strive to give you ways to update it quickly or to delete it – unless we have to keep that information for legitimate business or legal purposes. When updating your personal information, we may ask you to verify your identity before we can act on your request.\n\nWe may reject requests that are unreasonably repetitive, require disproportionate technical effort (for example, developing a new system or fundamentally changing an existing practice), risk the privacy of others, or would be extremely impractical (for instance, requests concerning information residing on backup systems).\n\nWhere we can provide information access and correction, we will do so for free, except where it would require a disproportionate effort. We aim to maintain our services in a manner that protects information from accidental or malicious destruction. Because of this, after you delete information from our services, we may not immediately delete residual copies from our active servers and may not remove information from our backup systems.\n\nBack to top\nInformation we share\n\nWe do not share personal information with companies, organizations and individuals outside of Google unless one of the following circumstances applies:\n\nWith your consent\n\nWe will share personal information with companies, organizations or individuals outside of Google when we have your consent to do so. We require opt-in consent for the sharing of any sensitive personal information.\n\nWith domain administrators\n\nIf your Google Account is managed for you by a domain administrator (for example, for Google Apps users) then your domain administrator and resellers who provide user support to your organization will have access to your Google Account information (including your email and other data). Your domain administrator may be able to:\n\nview statistics regarding your account, like statistics regarding applications you install.\nchange your account password.\nsuspend or terminate your account access.\naccess or retain information stored as part of your account.\nreceive your account information in order to satisfy applicable law, regulation, legal process or enforceable governmental request.\nrestrict your ability to delete or edit information or privacy settings.\nPlease refer to your domain administrator’s privacy policy for more information.\n\nFor external processing\n\nWe provide personal information to our affiliates or other trusted businesses or persons to process it for us, based on our instructions and in compliance with our Privacy Policy and any other appropriate confidentiality and security measures.\n\nFor legal reasons\n\nWe will share personal information with companies, organizations or individuals outside of Google if we have a good-faith belief that access, use, preservation or disclosure of the information is reasonably necessary to:\n\nmeet any applicable law, regulation, legal process or enforceable governmental request.\nenforce applicable Terms of Service, including investigation of potential violations.\ndetect, prevent, or otherwise address fraud, security or technical issues.\nprotect against harm to the rights, property or safety of Google, our users or the public as required or permitted by law.\nWe may share non-personally identifiable information publicly and with our partners – like publishers, advertisers or connected sites. For example, we may share information publicly to show trends about the general use of our services.\n\nIf Google is involved in a merger, acquisition or asset sale, we will continue to ensure the confidentiality of any personal information and give affected users notice before personal information is transferred or becomes subject to a different privacy policy.\n\nBack to top\nInformation security\n\nWe work hard to protect Google and our users from unauthorized access to or unauthorized alteration, disclosure or destruction of information we hold. In particular:\n\nWe encrypt many of our services using SSL.\nWe offer you two step verification when you access your Google Account, and a Safe Browsing feature in Google Chrome.\nWe review our information collection, storage and processing practices, including physical security measures, to guard against unauthorized access to systems.\nWe restrict access to personal information to Google employees, contractors and agents who need to know that information in order to process it for us, and who are subject to strict contractual confidentiality obligations and may be disciplined or terminated if they fail to meet these obligations.\nBack to top\nWhen this Privacy Policy applies\n\nOur Privacy Policy applies to all of the services offered by Google Inc. and its affiliates, including YouTube, services Google provides on Android devices, and services offered on other sites (such as our advertising services), but excludes services that have separate privacy policies that do not incorporate this Privacy Policy.\n\nOur Privacy Policy does not apply to services offered by other companies or individuals, including products or sites that may be displayed to you in search results, sites that may include Google services, or other sites linked from our services. Our Privacy Policy does not cover the information practices of other companies and organizations who advertise our services, and who may use cookies, pixel tags and other technologies to serve and offer relevant ads.\n\nBack to top\nCompliance and cooperation with regulatory authorities\n\nWe regularly review our compliance with our Privacy Policy. We also adhere to several self regulatory frameworks, including the EU-US Privacy Shield Framework. When we receive formal written complaints, we will contact the person who made the complaint to follow up. We work with the appropriate regulatory authorities, including local data protection authorities, to resolve any complaints regarding the transfer of personal data that we cannot resolve with our users directly.\n\nBack to top\nChanges\n\nOur Privacy Policy may change from time to time. We will not reduce your rights under this Privacy Policy without your explicit consent. We will post any privacy policy changes on this page and, if the changes are significant, we will provide a more prominent notice (including, for certain services, email notification of privacy policy changes). We will also keep prior versions of this Privacy Policy in an archive for your review.\n\nBack to top\nSpecific product practices\n\nThe following notices explain specific privacy practices with respect to certain Google products and services that you may use:\n\nChrome and Chrome OS\nPlay Books\nPayments\nFiber\nProject Fi\nGoogle Apps for Education\nFor more information about some of our most popular services, you can visit the Google Product Privacy Guide.\n\nBack to top\nOther useful privacy and security related materials\n\nFurther useful privacy and security related materials can be found through Google’s policies and principles pages, including:\n\nInformation about our technologies and principles, which includes, among other things, more information on\nhow Google uses cookies.\ntechnologies we use for advertising.\nhow we recognize patterns like faces.\nA page that explains what data is shared with Google when you visit websites that use our advertising, analytics and social products.\nThe Privacy Checkup tool, which makes it easy to review your key privacy settings.\nGoogle’s safety center, which provides information on how to stay safe and secure online.\nWe keep your personal information private and safe — and put you in control.\n\nLearn more about our commitments to your privacy and security.",
				"added": 1484478543
			}
		]
	},
	"comment_vote": {}
}