{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "If anyone interested to know what the \"--multiuser_local\" parameter mean/why is important, [here](/Talk.ZeroNetwork.bit/?Topic:1521308711_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT#comment_1141_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj) it is explained.\n\nAnd here is similar tutorial for the completness: [Using the Multiuser plugin](/eventi.bit/?Post:3:Using+the+Multiuser+plugin)",
			"post_id": 11,
			"date_added": 1525884391
		},
		{
			"comment_id": 2,
			"body": "thank you for a nice tutorial, mostly i find things using [ZeroHello](/) search or create new topic on [Zerotalk](/Talk.ZeroNetwork.bit/).",
			"post_id": 11,
			"date_added": 1525893504
		},
		{
			"comment_id": 3,
			"body": "Hi, some people post large data on sites like ZeroUp or their own blogs and link their articles/data from ZeroTalk (create new ZeroTalk topic to attract attention).\nSome times i created ZeroTalk topic just to mention link and a few keywords so people can find the post via ZeroHello search functionality.",
			"post_id": 13,
			"date_added": 1529358731
		},
		{
			"comment_id": 4,
			"body": "> [thunder33345](#comment_6_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): so you recommend i should post onto zerotalk too?\n\nI would find related topics on ZeroTalk using ZeroHello search feature \"Search in connected sites\" (example query: bandwidth speed site:zerotalk) and if not found, maybe compose new ZeroTalk topic where i shortly sumarize my thoughts and link to full articles discussions on UnlimitTalk or here.\n\nBTW: if you are reaching your limit on ZeroTalk, you will see contact e-mail of the nofish who can raise your limit. He did once for me and once without me asking.",
			"post_id": 13,
			"date_added": 1529403475
		},
		{
			"comment_id": 5,
			"body": "@thunder33345 thx for the feedback. Hopefuly your articles will now be easier to be found.\n",
			"post_id": 13,
			"date_added": 1530095405
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"13": 1
	}
}