{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Protocolos IPFS e IPNS como meio para o controle de botnet: prova de conceito",
			"body": "#Para tornar a internet mais segura, um passo fundamental é combater o uso de uma rede de computadores infectados e remotamente controlados (Botnet) por um usuário malicioso (Botmaster), que pode usá-la para, dentre outros fins, ataques DDoS. Para combater esse problema, um desafio é a evolução dos serviços de comando e controle (C C) usados pelo Botmaster para gerenciar a sua Botnet, cada vez mais sofisticados e difíceis de se detectar. Uma evolução natural no C C seria o uso de novos protocolos de computação distribuída. Este artigo apresenta uma prova de conceito de C C com dois desses protocolos, IPFS e IPNS, que possibilitariam ao Botmaster obter uma comunicação mais segura e anõnima.\n\n- https://web.archive.org/web/20180903172559/http://portaldeconteudo.sbc.org.br/index.php/wscdc/article/download/2400/2364/",
			"added": 1538921013
		},
		{
			"topic_id": 2,
			"title": "Criando site na ZeroNet",
			"body": "#Criando site na ZeroNet\n- https://web.archive.org/web/20180428162039/https://linuxroot1.github.io/Criando-Site-Na-ZeroNet/\n- https://zeronet.readthedocs.io/en/latest/using_zeronet/create_new_site/",
			"added": 1538921423
		},
		{
			"topic_id": 3,
			"title": "Filosofia",
			"body": "#Filosofia é o estudo de problemas fundamentais relacionados à existência, ao conhecimento, à verdade, aos valores morais e estéticos, à mente e à linguagem. Ao abordar esses problemas, a filosofia se distingue da mitologia e da religião por sua ênfase em argumentos racionais; por outro lado, diferencia-se das pesquisas científicas por geralmente não recorrer a procedimentos empíricos em suas investigações.",
			"added": 1538926257
		}
	],
	"topic_vote": {
		"1_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1iUaT64b3wALv84KikRXn3yuvU262BUBG": 1,
		"1_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"1_1NgmdP99tdxYEKJsCmZiu9sLxiVKPrAKD1": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"1_1GGJYF2LseYo5GAiw6BisisHkUjC1DkAxa": 1,
		"2_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1
	},
	"next_comment_id": 16,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#A Morte Do Superman\nUm monstro gigantesco batizado de Doomsday surge do mundo subterrâneo para começar uma destruição em massa na cidade de Metropolis. A Liga da Justiça precisa intervir imediatamente, mas parece que só os poderes do Superman são compatíveis com o do terrível monstro. Em uma luta mortal, o destino do super-herói torna-se incerto. \n\n- http://thevid.net/v/naid6icgc3nc/\n- https://web.archive.org/web/20181007131423if_/https://image.tmdb.org/t/p/original/fsUF7k9oH9HNJx5LfSg5HNhxb2m.jpg",
				"added": 1538920862
			},
			{
				"comment_id": 5,
				"body": "#Uma Linda Mulher Dublado Online\nO filme conta a história de uma atraente prostituta chamada Vivian Ward (Julia Roberts) que conhece por acaso o milionário Edward Lewis (Richard Gere), que a contrata por uma semana e que acaba apaixonando-se por ela. No período em que a garota é contratada pelo milionário, ela se transforma em uma mulher elegante, para acompanhá-lo em compromissos sociais. No entanto, os dois começam a se envolver mais profundamente, nascendo uma grande e divertida amizade, além de um carinho imenso, e assim, a relação cliente/garota de programa modifica-se para um relacionamento envolvendo sentimento entre homem e mulher e os dois acabam se apaixonando verdadeiramente e terão que enfrentar tudo e todos para poderem viver esse grande amor, que é cercado de muitos preconceitos da sociedade, pelo fato dela ser uma simples prostituta do subúrbio e ele, um homem conceituado perante as pessoas.\n\n- http://thevid.net/v/0nmiajorlo0g6h5mlsg/",
				"added": 1538925537
			},
			{
				"comment_id": 6,
				"body": "#O Sorriso de Mona Lisa Dublado Online\nRecria a atmosfera e os costumes do início da década de 1950. Conta a história de Katherine Watson, uma professora de história da arte que, educada na liberal Universidade de Berkeley, na Califórnia, enfrenta uma escola feminina, tradicionalista – Wellesley College, onde as melhores e mais brilhantes jovens mulheres dos Estados Unidos recebem uma dispendiosa educação para se transformarem em cultas esposas e responsáveis mães. No filme, a professora irá tentar abrir a mente de suas alunas para um pensamento liberal, enfrentando a administração da escola e as próprias garotas. O maior desafio para essa professora será fazer com que suas alunas assumam sua identidade cultural como ser social e histórico. Esse filme nos traz a visão mais ampla de novos conhecimentos.\n\n- http://thevid.net/v/cu74e5f4xxxup0q8243/",
				"added": 1538925600
			}
		],
		"1_1NgmdP99tdxYEKJsCmZiu9sLxiVKPrAKD1": [
			{
				"comment_id": 2,
				"body": "Sensacional",
				"added": 1538921177
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 3,
				"body": "#Um modelo de éter do universo\n- https://web.archive.org/web/20181007151117/http://www.epola.co.uk/rothwarf/aethermodel.pdf",
				"added": 1538925191
			}
		],
		"2_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": [
			{
				"comment_id": 4,
				"body": "#O que é a Navalha de Occam?\nÉ um princípio científico e filosófico que propõe que, entre hipóteses formuladas sobre as mesmas evidências, é mais racional acreditar na mais simples. Ou seja: diante de várias explicações para um problema, a mais simples tende a ser a mais correta. O filósofo inglês William de Occam (1285-1347) não foi o primeiro a pregar isso: Aristóteles já fazia o mesmo no século 4 a.C. Mas foi o nome de Occam que “colou”, por causa do frequente uso que ele fazia do argumento em debates filosóficos. Já o termo “navalha” ou “lâmina” é uma metáfora que surgiu muito depois dele: sugere que, com o uso da parcimônia, a hipótese mais complicada é “cortada”.\n\n#Visão afiada\n\n- Vamos aplicar o conceito a uma situação em que testemunhas olham para cima e veem um objeto voador não identificado\n\n#“É um avião?”\n\nConforme o objeto se aproxima, a hipótese ganha características diferentes: aviões voam alto, são grandes e se movem em alta velocidade (três características envolvidas na avaliação)\n\n#“É um pássaro?”\n\nA primeira hipótese que um dos presentes exclama leva em consideração apenas duas características compatíveis com o contexto: pássaros podem voar alto e em várias direções\n\n#“Não, é o superman!”\n\nQuando novas evidências se apresentam, o veredito muda. Neste exemplo, uma vez que o objeto aparece à vista e se vê que é o Superman, uma terceira hipótese, com até mais características (roupa azul, capa vermelha, etc.), acaba sendo a correta\n\n\n#Parece, mas não é\n\n- A explicação mais simples nem sempre é a mais correta\n\nA Navalha de Occam é um princípio metodológico, e não uma lei que diz o que é verdade e o que não é. Ou seja, ela não sugere que as explicações mais simples são sempre as verdadeiras e que as mais complexas devem ser refutadas em qualquer situação.\n\n#FONTES Stanford Encyclopedia of Philosophy e livro The A to Z of Medieval Philosophy and Theology, de Stephen F. Brown e Juan Carlos Flores",
				"added": 1538925439
			},
			{
				"comment_id": 7,
				"body": "#Universais\n\nEm metafísica, o termo “universais” aplica-se a dois tipos de coisas: propriedades (como a vermelhidão ou a redondez), e relações (como as relações de parentesco, ou relações espaciais e temporais). Os universais devem ser entendidos em contraste com os particulares. Poucos universais, ou nenhuns, são verdadeiramente “universais” no sentido de serem partilhados por todos os indivíduos — um universal é caracteristicamente algo que alguns indivíduos podem ter em comum, e outros não.\n\nOs universais foram concebidos como coisas que nos permitem captar intelectualmente uma ordem permanente, subjacente ao fluxo inconstante da experiência. Alguns dos deuses das antigas mitologias correspondem aproximadamente a importantes universais subjacentes — relações sociais, por exemplo, como quando se diz que Hera é a deusa do Matrimónio e se diz que Ares (ou Marte) é o deus da guerra. Muitas tradições do oriente e do ocidente têm lidado com o problema subjacente que gera as teorias de universais; não obstante, o termo “universais” está intimamente ligado à tradição ocidental, e o programa foi na sua maior parte definido pela obra de Platão e Aristóteles.\n\nO termo vulgarmente usado em referência a Platão não é “universais” mas “Formas” (ou “Ideias”, empregue no sentido de ideais e não de pensamentos), remetendo o termo “universais” mais a Aristóteles que a Platão. Outros termos cognatos com universais incluem não só propriedades, atributos, características, essências e acidentes (no sentido de qualidades que uma coisa tem não por necessidade mas por acidente), espécies e géneros, e categorias naturais.\n\nVários argumentos têm sido avançados para estabelecer a existência de universais, o mais memorável dos quais é o argumento do “um em muitos”. Existem também vários argumentos contra a existência de universais. Há, por exemplo, vários argumentos regressivos derivados do chamado “argumento do terceiro homem” de Aristóteles contra Platão. Outra família de argumentos explora o que é conhecido como Navalha de Ockham: argumenta-se que podemos dizer tudo o que precisamos de dizer, e explicar tudo o que precisamos de explicar, sem recorrer a universais; e se podemos, e se somos racionais, então devemos fazê-lo. Quem acredita na existência de universais chama-se realista, quem não acredita chama-se nominalista.\n\n- https://web.archive.org/web/20181007152043/https://criticanarede.com/met_universais.html",
				"added": 1538925735
			},
			{
				"comment_id": 8,
				"body": "#Problema dos universais\nPor problema dos universais os historiadores da filosofia entendem ser a questão de saber se os universais são coisas ou meramente palavras. Esta questão divide os filósofos em realistas, como Platão, em que as espécies, como a espécie humana, são em certo sentido coisas, e em nominalistas, em que \"espécie\" não passa de uma palavra.\n\n- https://plato.stanford.edu/entries/universals-medieval/",
				"added": 1538926020
			},
			{
				"comment_id": 12,
				"body": "#AS DIFERENÇAS ENTRE METAFÍSICA e FÍSICA:\n\nA palavra “metafísica” é originária do termo grego “metàphysis“, sendo que “meta” pode ser traduzida como “além” ou “depois” e “physis” como “física” ou “natureza”. Sendo assim, pode-se entendê-la como “além da física” ou “depois da física”. Esse termo foi cunhado por Andrônico de Rodes (século I), que foi organizador das obras de Artistóteles, estabelecendo uma divisão de seus escritos, na qual separou os que englobavam questões sobre a física e os que abordavam outros tipos de investigações, sendo que esta última abordagem foi denominada por Aristóteles como “filosofia primeira” e por Rodes, como Metafísica.\n\n   Tendo esclarecido a origem da palavra, exploremos agora em que consiste a “filosofia primeira”. Certa vez, Voltaire escreveu que “por metafísica, se entende aquilo que não é matéria“. Assim sendo, ela pode ser definida como uma tentativa de encontrar respostas para aquilo que está além dos fenômenos materiais, além do visível, e consiste numa  busca pela essência das substâncias, consistindo numa reflexão que se empenha em compreender a realidade fundamental do mundo, isto é, desvendar aquilo que faz com que as coisas sejam tal como são, e quais seriam os possíveis princípios existentes por trás dos fenômenos da natureza. \n\n  Agora, exploremos as bases e significado da Física para que seja possível melhor compreender as diferenças existentes entre os dois campos. Partamos então, codinome fizemos anteriormente, da origem própria palavra “física”. Este termo tem origem grega (physis) e significa “natureza”. Assim, a Física pode ser compreendia como um estudo dos fenômenos naturais do mundo material, e isso significa que ela pretende descrever tais fenômenos e entendê-los, criando leis universais que se apliquem a eles. Além destes aspectos citados, tenha-se em mente que a Metafísica preocupa-se em entender e refletir sobre o todo, enquanto a Física, tal como as outras Ciências, ocupa-se apenas de uma parte específica da natureza. Note-se que dentro da própria área da Física existem ramificações e especializações em partes diferentes, como, por exemplo, a Astrofísica e a Biofísica. Arthur Schopenhauer (1788-1860) certa vez escreveu uma frase que sintetiza bem o que foi exposto neste texto: “Onde termina a Física, começa a Metafísica”.",
				"added": 1538926935
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 9,
				"body": "#5 FILÓSOFOS QUE ACREDITAVAM EM DEUS\n- https://web.archive.org/web/20181007153122/http://www.acervofilosofico.com/5-filosofos-que-acreditavam-em-deus/",
				"added": 1538926348
			},
			{
				"comment_id": 10,
				"body": "#OS CONCEITOS DE TEMPO E ESPAÇO NA FILOSOFIA DE KANT:\n- https://web.archive.org/web/20181007153321/http://www.acervofilosofico.com/os-conceitos-de-tempo-e-espaco-na-filosofia-de-kant/",
				"added": 1538926467
			},
			{
				"comment_id": 11,
				"body": "#INVESTIGAÇÃO SOBRE A EXISTÊNCIA DE DEUS NO TRATADO DE METAFÍSICA DE VOLTAIRE:\n- https://web.archive.org/web/20181007153654/http://www.acervofilosofico.com/tratado-de-metafisica-e-filosofia-de-voltaire/",
				"added": 1538926800
			},
			{
				"comment_id": 13,
				"body": "#A FALSEABILIDADE NA FILOSOFIA DE KARL POPPER:\n\nKarl Popper (1902-1994) foi um dos pensadores mais brilhantes do século XX. Destacou-se especialmente na área da Filosofia da Ciência e um dos principais temas de sua filosofia, e que lhe rendeu notável reconhecimento é a questão da falseabilidade, que será explorada neste texto.  \n\nA Ciência é construída através da observação e da experiência, pelas quais constatam-se fatos isolados que permitem a determinação de certos critérios universais. Esse processo é chamado de indução e é justamente nesse ponto que se enquadra o conceito de falseabilidade desenvolvido por Popper, que pode ser compreendido como a capacidade de se refutar uma teoria científica, mostrando que ela é falsa. \n\n  Popper ofereceu o seguinte  exemplo para demonstrar a questão da falseabilidade: observo inúmeros cisnes brancos e, então, por repetição, ou seja, após ver vários espécimes de tal cor, por indução, raciocino que “se um cisne é branco, todos os outros também são”. Entretanto, suponhamos que, certo dia, me deparo que um cisne negro e, eis que então, surge-me um problema, uma vez que perceberei que nem todas as aves desse tipo são caracterizadas pela cor branca. Se tal ave surgir, isto é, um cisne negro, então, a afirmação anterior (de que todos os cisnes são brancos), que  é baseada na observação e na experiência, consequentemente é considerada falsa e, portanto, não pode ser científica.\n\n  Em outras palavras, o problema que acontece nesse exemplo dos cisnes e que mostra como a Ciência é arquitetada, é que a observação repetida de um fato, não prova, necessariamente, que essa circunstância se repetirá e que esse fato deva ser universal, isto é, ter valor absoluto – ou seja, observar e encontrar 100, 200, 500 ou 1000 cisnes brancos, não me permite afirmar que “todos os cisnes são brancos”. Não há consistências ou garantias em afirmar que o futuro será necessariamente como foi o passado e que os mesmos eventos irão sempre se repetir de igual maneira. \n\n  Repare que o empirismo é essencial para a construção de uma teoria científica, mas ocorre que, levando em consideração a questão da falseabilidade, o conhecimento formulado pela experiência possui certa inconsistência, não gera certezas, e a possibilidade de refuta-lo mostra que através dele não é possível elaborar tantas proposições universais conforme muitas vezes fez (e faz) a Ciência. Digamos que não haveria lógica nos argumentos indutivos que compõe as teorias científicas. \n\n  A falseabilidade, portanto, consiste na tentativa de demonstrar, através da própria observação, que uma teoria científica é falsa. Ora, seguindo esse raciocínio, percebemos que um dos aspectos que podem tornar uma teoria científica verdadeira é justamente o fato de que ela pode ser refutada e que enquanto ela o puder ser, não será válida. Dessa forma, falsificar uma teoria é fundamental para o progresso da própria Ciência. Por outro lado, quanto mais difícil é falsear uma teoria, mais consistente, confiável e segura ela demonstra ser.",
				"added": 1538927082
			},
			{
				"comment_id": 14,
				"body": "#SERÁ QUE SOMOS LIVRES?\n- https://web.archive.org/web/20181007154752/http://www.acervofilosofico.com/sera-que-somos-livres/",
				"added": 1538927338
			},
			{
				"comment_id": 15,
				"body": "#REALISMO X IDEALISMO:\nNa área da Gnosiologia, que investiga a essência do conhecimento, há pelo menos duas teorias básicas que são pontos de partida fundamentais para a compressão do assunto e das demais teorias relacionadas. Elas são: Realismo e Idealismo, duas correntes antagônicas. As duas teorias divergem sobre qual é o fator determinante para o conhecimento: sujeito ou o objeto. Buscam encontrar na relação entre ambos, o conhecimento e a possibilidade de objetos existirem na ausência do sujeito.\n\n O termo Realismo no sentido epistemológico considera que o objeto determina o conhecimento e que as coisas seriam reais e o sujeito as conhece tal como são, pois a realidade é tal como é, independente, portanto, do sujeito que a observa. As várias vertentes de Realismo divergem entre si sobre a participação e a percepção do sujeito e suas possíveis variações, mas ainda assim sempre atribuindo a realidade e o conhecimento ao objeto. Quaisquer ideias ou sensações que possam divergir entre sujeitos distintos têm necessariamente seu início em algo provindo da realidade. Alguns principais autores que abordam e sustem essa teoria, são Thomas Reid, Adam Ferguson e Dugald Stewart.\n\n   O Idealismo, por sua vez, é um termo usado para mais de uma corrente filosófica. No contexto deste texto, em específico, refere-se exclusivamente ao Idealismo Epistemológico, teoria oposta ao Realismo, e que considera que o fator determinante para o conhecimento é o sujeito. Segundo o Idealismo não há realidade fora da consciência, a realidade é uma cópia imperfeita, uma representação, e as coisas não existem por si mesmas, não há preexistência de objetos, e a realidade é formada a partir do sujeito durante a interação que este formula com objetos, sendo que estes existem somente na consciência do sujeito.\n\n   No Idealismo as coisas existem enquanto podemos pensá-las ou percebê-las e a realidade não é a coisa em si, mas a imagem da coisa formada na consciência do sujeito e, neste âmbito, só é possível conhecer o que se converte em pensamento ou já é abstrato, como uma ideia. As vertentes do Idealismo divergem sobre a realidade partir de uma consciência individual ou objetiva (científica) e também se o processo de conhecimento é psicológico ou lógico. Alguns dos principais autores dessa teoria são Platão, Berkeley e Hegel.",
				"added": 1538927405
			}
		]
	},
	"comment_vote": {
		"4_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"6_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"7_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"8_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"10_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"9_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"14_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"15_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"1_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1
	}
}