{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1587058576,
			"title": "ZeroNet DevTalk",
			"body": "Check out http://127.0.0.1:43110/17xKC3hfQkuGqqRGCwGqUATXXmodAfdPPG/ for ZeroNet developmental talk.\n\nPost any questions that you may have or interesting ideas. Hope to see you there and thank you in advance.",
			"added": 1587058575
		}
	],
	"topic_vote": {
		"1587058576_19XvDasRMiaZ1KijQUHjJ7nEEJMWuSVxHW": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1587058576_19XvDasRMiaZ1KijQUHjJ7nEEJMWuSVxHW": [
			{
				"comment_id": 1,
				"body": "How do I make it work for everyone, it works on my end... I just copied and pasted the ZeroTalk template.",
				"added": 1587060748
			},
			{
				"comment_id": 2,
				"body": "@filips\n\nThanks for the input. Do you know how to sticky a topic at the top in these forums? I don't mean ZeroTalk because I know that I'd need to be an admin of ZeroTalk to do so but in my own ZeroTalk clone? Thanks.",
				"added": 1587062746
			},
			{
				"comment_id": 3,
				"body": "@filips\n\nSo which part of the url do I copy and paste into the topic sticky uri? It looks like this no longer works and when you look at ZeroTalk these two topics are no longer stickied at the top?\n\nEdit: Okay, I found it and it works. Thank you.",
				"added": 1587068899
			},
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_1365_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Just noting that there are already quite a few dev talks, e.g.: [...]\n\nNone of these are truly active or very informational in regards to the basics or even more complicated aspects of ZeroNet.",
				"added": 1587069832
			},
			{
				"comment_id": 5,
				"body": "> [filips](#comment_442_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You need to edit content.json of site and configure settings. For example, this is how it is done for ZeroTalk: [...]\n\nHow do you [code][/code] stuff like you did with the settings string from the content.json file? Thank you in advance.\n\nPS. Is there also one for bold? Like [b][/b] ??",
				"added": 1587069969
			},
			{
				"comment_id": 6,
				"body": "> [filips](#comment_443_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): ZeroTalk is using Markdown. You can read this for details about syntax. [...]\n\nThanks that was very helpful. Just to check is the link in the opening post working?",
				"added": 1587114490
			},
			{
				"comment_id": 7,
				"body": "To the top!",
				"added": 1587167695
			}
		]
	},
	"comment_vote": {
		"441_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"442_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"443_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1
	}
}