{
	"title": "无限进化体的博客",
	"description": "可按时间索引",
	"links": "[我的谷歌博客](https://wditsh.blogspot.com)\n\n[我的zerome](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF/chengxing@zeroid.bit)",
	"next_post_id": 40,
	"demo": false,
	"modified": 1534431616,
	"post": [
		{
			"post_id": 39,
			"title": "最坏的不是坏事的发 生，而是坏事发生时，由于政治原因控制了相关事件信息的传播给了坏人错误的信号。",
			"date_published": 1534431216.581,
			"body": "看到下面这贴子，链接如 下，加上我的感想。\nhttp://127.0.0.1:43110/tgzy.bit/?Post:271\n视频中的持菜刀砍杀人事件是今天上午发生的。五楼跟六楼-就因为漏水，这个男人上楼评理，这女人挺厉害，一直骂这个男的，这男的失去理智，这女的48岁，这男的20多岁…… 光天化日之下砍人，周围静悄悄。这个社会无可救药。视频地址：https://youtu.be/TOHIAdoiGCo\n\n1 Comment:\nchengxing@zeroid.bit ━ new comment\n\nSubmit comment USED: 2.7K/100KUSED: 2.7K/100K\nchengxing ━ Just now  Reply\n视频就不看了，我想说，这视频应该让墙内人多看下，特别是好些无理还狠狠的，就如这老女人以为男人就得让着，是软蛋，不能动手了。正是国内一面倒的给女同志打气，现在男的要爆发几个正常。总给人政治正确，作恶好，当坏人好，都不动手，讲理无效的印像，好像周围人一看到打人就会来劝样的。也不想下她有多得人心。"
		},
		{
			"post_id": 38,
			"title": "为零网创造优势内容计划",
			"date_published": 1534429990.884,
			"body": "\n发起个活动把国内因审查产生的好作品改爽点。\n一百个人中有一个人改了一本完本小说，那这小说绝对比原作好看。不停的改。\n改后来个简略的更新日志。\n便于选择。\n网络小说，建个好作品一起大家修改分享个人版本的论坛。把国内那些网站审查中为了政治正确的脑残小说改爽点。\n网络小说影响力超大的，反洗脑效果太好了，也成本小，易实行。我绝对出来改，有人先弄个论坛着。"
		},
		{
			"post_id": 37,
			"title": "蠢货王尼玛其人，敢说大实话的人",
			"date_published": 1524196737.205,
			"body": "转自[零网地址有图片](http://127.0.0.1:43110/lastone.bit/?Post:11)\n蠢货王尼玛其人\n于 Nov 26, 2017 · 3 min read \n作者：摇滚客\n\n首发媒体：虎嗅网\n\n被删时间：当天\n\n距离[《暴走大事件》](https://chinadigitaltimes.net/chinese/tag/%e6%9a%b4%e8%b5%b0%e5%a4%a7%e4%ba%8b%e4%bb%b6/)\n全网下架过去整整十天了。\n\n10天，240个小时，恍若隔世。\n\n一个叫王尼玛的大头死变态，摘下了头套，活像一个“蠢货”。\n\n作为一个知名脱口秀主持人，作为一个一千六百万粉丝的微博大V，竟然想不开去干愤青的事。\n\n一面势单力薄地挑战不可能战胜的巨兽，一面发了疯似的煽动年轻人和他一起反抗，你说他蠢不蠢？\n\n___.jpg (496x286)\n\n豫章书院说没有学生自杀那就没人自杀，人家这么正规一学校能骗你吗？\n\n人家家长为了孩子好，跑去声援学校，你非骂人家“帮凶”，不封你封谁呢？\n\n人人都说皇帝的新衣五光十色，好看得不得了，你非毁谤人家没穿衣服。幼稚！可笑！\n\n活该节目被下架整改，回归遥遥无期，你骂学校、骂家长就算了，还固执地叫人家孩子动脑子，学会反抗。\n\n喋喋不休，活像居委会大妈，人家又不是你儿子，你干嘛这么关心，一副恨铁不成钢的样子。\n\n这不，这档烂摊子没解决，他又不怕死地跳出来，就红黄蓝幼儿园的事发声。\n\n___2.jpg (690x1256)\n\n你自己说说你是不是蠢货？\n\n（一）\n\n80、90年代，曾经是文艺作品喷薄而出的春天。\n\n那个年代的电影、电视剧创作没有这么多条条框框，更加注重个性。\n\n特别是拍给孩子看的儿童剧、动画片多颜色荒诞，配乐诡异、剧情邪典，有着严重的反乌托邦色彩。\n\n《魔方大厦》、《镜花缘》、《红气球》、《十二生肖》、《眉间尺》、《黑猫警长》，甚至是《葫芦娃》…\n\n随便挑出一部，都能让看过的观众，记起一两个童年阴影的片段，至今记忆犹新。\n\n很少人知道，这些苦涩的镜头，包含着那代艺术创作前辈们的良苦用心。\n\n___3.jpg (545x352)\n\n早年看黑猫警长，觉得动画片惩恶扬善，看犯罪份子被击毙有一种儿时才有的快感。\n\n但——\n\n随着年龄渐涨，再看这部片子就发现了异端。\n\n黑猫警长的世界实际一个法律一点都不健全的社会啊！\n\n警察局要靠秘密监视、窃听才能控制整个森林的稳定，时时消灭异己，才能保证和谐。\n\n他们是怎么面对伏法的罪犯的？\n\n白鸽警员将罪犯的眼睛遮住，五花大绑，用皮带打得皮开肉绽，一旁的警长却无动于衷，眼神冰冷。\n\n相信很多人还记得螳螂夫妇那集，对杀死蝗虫群的镜头，不断地进行特写：\n\n螳螂夫妇挥刀斩杀了大批飞来的蝗虫，有的被腰斩、有的被肢解，还有的直接断了头。\n\n____.jpg (320x204)\n\n接着警长到达现场，一把火烧死了这些蝗虫，并且大笑着说：\n\n“哈哈哈，这是最好的肥料啦！”\n\n满地尸体、残肢乱飞的场面，很容易造成小观众的不适。\n\n至于导演为什么这么拍，有人说，极有可能是创作人员在宣泄对83年严打的恐惧：\n\n那个时代，组织家庭舞会会因为邻居的举报坐牢，偷窃少量财物会被判死刑。\n\n当年有个叫当红的歌手叫做迟志强，就因为跳舞的舞伴坐在腿上，坐了四年牢，理由是聚众淫乱。\n\n和他一起参加舞会的年轻人，无一幸免，一个小伙因为偷看女厕，判了死刑，缓期两年。\n\n___4.jpg (600x351)\n\n很多现代的年轻人对次并不了解，只有那些触目惊醒的往事还在述说那段讳莫如深的历史：\n\n四川一个小伙和朋友打赌，亲了路边一陌生女孩，结果直接被枪毙，一命呜呼；\n\n某青年因为喝多了在路边小解，被抓了现行，二话不说扭送新疆劳改；\n\n还有一个男青年，看见街上的洋妞长得丰满，一时冲动摸了一把，也被处以枪决；\n\n…\n\n拍完第五集《黑猫警长》就被紧急叫停了，至于原因导演有这样一段描述：\n\n那天我被叫去人事处，他们递给我一张退休证，说我年龄到了，该退了。醒过神来后，我一句话没说，拿了退休证转身就走。\n\n现在你还觉得《黑猫警长》仅仅是一部惩恶扬善的动画片吗？\n\n如果是的话你可以自己观察黑猫警长的武器——鲁格枪，纳粹盖世太保的标配，集权、恐怖的代名词。\n\n___5.jpg (640x381)\n\n第五集请看下集几个大字之后，便再也没有了消息…\n\n（二）\n\n其实，给更多人留下童年阴影的片子是《魔方大厦》。\n\n如果让滚君用两个字来形容这个片子，只有两个字——\n\n癫狂。\n\n死人脸、怪诞的场景、诡异的剧情，不管是导演还是原作，都在尽力用隐晦的语言向我们表达些什么。\n\n第二集，来克被一群小将们选为市长，上台后他将家长被关进了罐头，并贴上大字报，无情批判。\n\n孩子们从此无拘无束，尽情玩耍打砸抢烧、让民生社会陷入了一片黑暗之中，但越是这样，市民们就约支持来克。\n\n也许，创作者就是希望用这种方式，告诉那代孩子，无论什么时候都不要丧失理智，千万不要重蹈历史的覆辙。\n\n___6.jpg (499x284)\n\n长相怪异、尸白吊眼的干部\n\n___7.jpg (552x360)\n\n无法无天打砸抢烧的小将\n\n___8.jpg (550x363)\n\n还有消失在历史深处的大字报\n\n还有，在个国家，人民不允许出现负面情绪，必须活在正能量中。\n\n那些脸上笑嘻嘻，心理mmp的人，都会被集中起来，用特殊设备抽干净你的情绪。\n\n从此，你就变成一个不哭不闹的乖孩子了。\n\n除了一个叫怪里怪气的人，他不服为什么别人说好，他就要说好，为什么别人笑，他就要笑——\n\n他是一个独立的人啊！\n\n于是他想尽各种方法和这个世界作对，只不过，这一切都是徒劳，他最终战胜了自己，他爱老大哥。\n\n___9.jpg (474x294)\n\n在魔方大厦里，作者笑话失去个性的人终生都无法摆脱“禁锢的头脑，可笑的规矩”，还直言“不能说真话不如当哑巴！”\n\n他还对“卫生部门的门外汉领导，非要插手文艺作品的审核”，进行了无情嘲弄，嬉笑怒骂快意恩仇。\n\n诸如此类的情节还很多，这也就是为什么这部片子在播了十集之后，就遭到腰斩。\n\n剩下的十六集遥遥无期，来克也被永远地关在了那座魔方里，出不来了。\n\n有的时候，我们心疼来克再不能回家，可是看看我们，岂不是跟他一样，也迷失在一个现实版的“魔方大厦”里了。\n\n___10-1.jpg (546x362)\n\n在魔方大厦里，作者笑话失去个性的人终生都无法摆脱“禁锢的头脑，可笑的规矩”，还直言“不能说真话不如当哑巴！”\n\n他还对“卫生部门的门外汉领导，非要插手文艺作品的审核”，进行了无情嘲弄，嬉笑怒骂快意恩仇。\n\n诸如此类的情节还很多，这也就是为什么这部片子在播了十集之后，就遭到腰斩。\n\n剩下的十六集遥遥无期，来克也被永远地关在了那座魔方里，出不来了。\n\n有的时候，我们心疼来克再不能回家，可是看看我们，岂不是跟他一样，也迷失在一个现实版的“魔方大厦”里了。\n\n（三）\n\n岂止是动画片，80、90后接触到的电视剧、电影，很多都被那个时代的艺术工作者赋予了隐喻。\n\n比如那部号称情景喜剧的鼻祖《我爱我家》，第一集就用春秋笔法映射了反复无常的政治运动。\n\n___11-1.jpg (638x417)\n\n还有那部《疯狂的兔子》，将人群在失去判断力之后的癫狂，庸众的可怕表现得淋漓尽致。\n\n唯有一直清醒，坚定自我的人，才能走到最后…\n\n___12-1.jpg (519x360)\n\n公众号X博士说：那个年代的所有大师，都在暗暗教你如何成为一个独立而不屈的人。\n\n创作者想尽各种办法把将经历过的痛苦、留下的伤疤通过另一种方式，传递给下一代。\n\n即使他们明明知道这样的表达会造成下一代的反感，给他们留下童年阴影。\n\n但，他们心里清楚，这就像打防疫针，了解了社会的真相，才能更勇敢地走下去——\n\n动动脑子，你们得学会反抗，反抗啊，少年…\n\n___13-1.jpg (466x298)\n\n（四）\n\n生于1990年的王尼玛就是在这种环境下成长起来的。\n\n不管他的教育经历是怎样的，曾经那些前辈们创作出来的东西，都在他的脑中起到了潜移默化的作用。\n\n也许很多80、90后，比起00后，有一股子劲儿，大概就是这个原因吧。\n\n我们的童年里没有低幼的喜羊羊、熊出没，而是在阴影下生存，在不屈中呐喊的技巧啊！\n\n后来王尼玛长大了，办了自己的脱口秀。\n\n虽然他可能还没意识到，但他确实在重复着曾经那些前辈们做过的事。\n\n他一直在用不同的观点鞭笞社会给年轻人的偏见和不公啊！\n\n他带上头条，想让这些尖锐的观点不那么敏感，但他还是刺痛了一些人。\n\n___14-1.jpg (75x900)\n\n他说，即使是跪着，前方的路，我们也会一起走完。\n\n___15-1.jpg (592x1027)\n\n所以，在节目的最后他说了这样一件事：\n\n一个读者想考研，但父母逼他考公务员，他现在很苦难不知道怎么办。\n\n王尼玛没有开玩笑，而是忧心忡忡的说，语气里充满了恨铁不成钢的感觉：\n\n“你要考研，谁拦得住，自己打工赚钱，自己考研。养了五年的宠物，不想送人谁拦得住，自己租房自己养它，谁拦得住？”\n\n因为充满热血的人，至死都是少年！\n\n___16-1.jpg (239x900)\n\n“动动脑子，动动脑子，少年，要反抗，反抗嘛。动动脑子嘛，动动脑子，反抗，动动脑子！”\n\n这和二十年前那些前辈们所说的，有什么不同呢？\n\n只不过那些前辈，用更聪明、更隐晦的方式。而王尼玛，就这样傻傻地送了人头。\n\n___17-1.jpg (496x279)\n\n除了暴走大事件，几乎所有同类节目都面临着寒冬期。\n\n凤凰卫视官方发布消息，节目走过了19个年头后迎来停播。\n\n关于节目为何停播的消息众说纷纭，当在微博上搜索关键字时，只有明晃晃的一排字：\n\n“根据相关法律法规和政策，搜索结果未予显示。”\n\n____.png (615x227)\n\n但其实这几乎是一个必然。有网友发现，一切早有预兆。\n\n根据镜像娱乐调查显示：“在《锵锵》之前，“老梁”系列、《鲁豫有约》、《超级访问》、《壹周立波秀》、《今晚80后脱口秀》、《金星秀》等都没能逃过停播的命运。”\n\n语言类、谈话类节目一一阵亡，有的销声匿迹，有的则转战网络。\n\n但是网络环境又真的有想象中的那么好吗？\n\n___18-1.jpg (640x201)\n\n6月份，“新浪微博”、“ACFUN”、“凤凰网”的视听节目服务被关，一时之间地动山摇。\n\n为了生存下来，“新浪微博”严禁上传长视频，A站濒临崩溃、B站要求实名。无数网络节目都改名的改名、下架的下架。\n\n诚如网友所说：该来的总会来的，一切不和谐的综艺都会被毙掉，不分电视、网络，没有意外！\n\n___19.jpg (580x554)\n\n终于，今天，王尼玛也闭上了嘴。\n\n想到之前有人用这么两句话来形容李银河：\n\n多么愚蠢，非要闹到不能张嘴，非要闹到自己出点事。这对许多中国人来说，难道不是愚蠢的吗？\n\n然而，吾辈永远要记得，他捍卫的不是他一个人的自由，而是千千万万你我他的自由。所做的就是在为了你们呐喊啊！\n\n有人说王尼玛愤青、有人说他自寻死路，但是他所做的，不都是在告诉年轻人，你们要思考，你们学会反抗啊！\n\n就算举身赴死，也要义不容辞！\n\n永远，永远也不要因为习惯了黑暗，就去为黑暗辩护。\n\n永远要记得，为众人抱薪者，不可使其冻毙于风雪！\n\n暴走大事件没了，王尼玛还是坚持在微博上表明自己对红黄蓝事件的态度，他是蠢，还蠢的那么可爱。\n\n套用一句老话来说：\n\n尽管我们脑子里的反叛改变不了这个世界，但它却是我们真正拥有的东西，是我们最后一寸领土。\n\n在那一寸领土里，我们是自由的！\n\n___20.jpg (593x404)\n\n0 Comments:\n请先登录 ━ 发表评论\n登录为...\n提交评论\n20001 ━ 于 Mar 02, 2018  回复\n开始还不太了解，现在知道了。现在只能到youtube上看看了，老梁也怕了\n\nborber ━ 于 Jan 28, 2018  回复\n2018 看到这个新闻 还是不由感慨 黑暗 流出浓浓黑色汁水的黑暗啊\n\n"
		},
		{
			"post_id": 36,
			"title": "政府全面管控下 一个人的哭笑也要符合标准",
			"date_published": 1524196434.385,
			"body": "政府全面管控下 一个人的哭笑也要符合标准\n(http://www.botanwang.com/articles/201804/政府全面管控下%7C一个人的哭笑也要符合标准.html)\n2018-04-19 22:08\n来源: \n上报\n作者: 末夏\n\n中国对防火墙内互联网的持续整治运动迎来了新的领域，搞笑、视频类娱乐领地从此也被官方收编，烙印上的“伟光正”意识形态，让中国人从时事政治到自我娱乐全方位完全失守。\n\n最近中国互联网上流传甚光这样一句话：他们取缔google的时候，我没有说话，因为我不是google的用户。然后他们又对Facebook和维基百科下手，我也没有说话，因为我不适用它们。现在他们封禁抖音内涵，我环顾四周，再也没有人能为我说话了。\n\n这句话很明显是改编自马丁·尼莫拉神父的经典名言：\n\n当纳粹来抓共产主义者的时候，我保持沉默；我不是共产主义者。当他们囚禁社会民主主义者的时候，我保持沉默；我不是社会民主主义者。当他们来抓工会会员的时候，我没有抗议；我不是工会会员。当他们来抓犹太人的时候，我保持沉默；我不是犹太人。当他们来抓我的时候，已经没有人能替我说话了。\n\n有着两亿人用户的搞笑娱乐社区内涵段子被中国广播电视总局永久关停。同一时间，中国广播电视总局还宣布约谈整治中国用户颇多的两个短视频运营，快手和抖音。内涵段子创始人今日头条CEO张一鸣发表的公开信称：“产品走错了路，出现了与社会主义核心价值观不符的内容，没有贯彻好舆论导向，接受处罚，所有责任在我。”\n\n在此之后，快手、今日头条等都宣布招聘数千人来审核内容。早就被局限于党控制之下的中国互联网，这一波的娱乐、搞笑与早些年的时政报导、社交媒体微博整顿一样，彻底失去自娱自乐的空间。\n\n遭殃的独角兽企业\n\n这些企业没有被整顿前，普遍代表着中国最具潜力的新经济模式，它们的资本市场动辄被估值数十、上百亿美元，它们被认为是中国抢滩世界互联网的佼佼者，它们被称为“独角兽”优质股，它们被认为是中国的未来与经济转型的前沿。\n\n但从另一个角度来说，对外实行防火墙封闭战略，对内关门打狗严格控制局域网内的每一寸领土，所有中国企业的属性必须要符合社会主义核心价值观的审美要求，这是中国式国家主义互联网的现状。从早些年的媒体时政报导，到微博微信等社交化平台，再到娱乐搞笑类即使你要笑也要符合管控标准，中国互联网早已经是死水一潭。\n\n媒体的失声，社交平台的失声，娱乐搞笑的失声，到最后所有的失声并不出人意料。人们一方面对社会现状与政治前景麻木不仁，或由于担心风险，而闭不做声，另一方面沉醉于新科技所带来的新商业模式中国式互联网繁荣，高估值的独角兽企业，中国互联网似乎要马上引领世界，甚至人们对川普发起的贸易战也觉得，这是为了遏制中国发展，对，这个计划叫“中国制造2025”。\n\n自以为不去谈论社会正义就能打开商业宝藏，自以为不去谈论敏感话题就以为能自娱自乐，自以为一个良性的国家管控不会去随便干涉你想笑想哭的自由。所有这些臆想最终都被碾压粉碎。\n\n借用陈独秀那句话：没有反对派的自由，所有一切（议会或苏维埃）都同样一文不值。搞笑类被官方认为是“低端粗俗”，网路上有人说人民应该有低俗的权利。其实，这种说法本身就是荒唐的。\n\n因为在一个没有反对派自由的国度，人们几乎不存在任何权利。当然，你可以反驳说，中国人还具备吃饭权，睡觉权，赚钱权，但说白了，这更多是类似于一只猪的权利，它与真正意义上的人的权利无关。\n\n比《1984》更荒唐\n\n说到底，商业浪潮的风起云涌与科技创新的无限美好，本质上并没有给中国带来一丝空间，反倒让这个时代所有人更加逼仄。这里发生的一切也远比欧威尔的《1984》更荒唐。\n\n诡异的是，中国人似乎逐渐有着超强的能力可以适应这样一种全方位管控模式，就跟当年的谷歌没了，人们会习惯百度一样，即便百度太坏会杀人，好像这些年这里发生的一切，最终都似乎可以用经济上的腾飞来替代来接受。\n\n时事政治不能谈，中国人可以娱乐搞笑，娱乐搞笑守规矩后，中国人可能仍有一千种、一万种活法来继续自娱自乐，乃至于一波又一波被管控被耗尽。\n\n然而，对于一些投资者而言，即使能看到中国存在的庞大消费市场，但一纸禁令，瞬间就可以使其估值成为泡汤。据了解，内涵段子被关停后，今日头条的估值一下子从五、六百亿美元估值跌落至一百亿美元。投资人即使拥有商业上的奇才眼光，也无法与禁令政策有任何谈判，而这恰恰是最大的风险。\n\n当中国商人群体还在拼命为改革开放叫好，雄心勃勃企图大赚明天时，当更多中国人开始不关注涉及权利与自由的关系，而玩个短视频、自我开心时，当所有人都认为社会的发展都在持续向前推进时，被阉割被管控的所有人，其实早都没有未来了，有的只是措手不及的毁灭与听话。\n\n关键词: 言论自由\n栏目: \n新颖视角\n首页重点发表: \n新鲜看点\n"
		},
		{
			"post_id": 35,
			"title": "\n明知道问题是来自于共产和共产党中的贪腐，可很多人想到解决方法还是政府和共产。",
			"date_published": 1522981602.405,
			"body": "\n\n明知道问题是来自于共产和共产党中的贪腐，可很多人想到解决方法还是政府和共产。\n\n现在不适用，因为共党没这个心，并且这种行为有共产的意味，人口从来不是事，国家环境好多的是人想移民来。逻辑错误，不愿生是因为税重，生活成本，教育，住房等太贵了，行政垄断太多，问题就在于党没做好，你现在说正确的做法是让政府来做，问题就是他做不好。\n现阶段道德素质没那高，中国一向是讲究血缘，让政府来解决只能是合理提供基础教育，如果标准太高就是共产和吃大锅饭，去查 下升米恩斗米仇的新闻，明星捐钱供大学生，被骂。\n\n真正能力是来自于网络上自学和社会实践。\n[下面引用的来源](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:190_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC)\n\n>国人纳粹思想系列之一：穷人养不起孩子就不该生\n【本人将不定期发表国人错误观念系列，以让被共党洗脑了的人能够对照自省】国人纳粹思想系列之一：穷人养不起孩子就不该生——你应该感谢现在还有人愿意多生孩子，他们是在为社会贡献延续的种子及为你们的养老贡献劳动力。正确的方法是由全体社会来负担下一代的养育，如孩子补助金发到18岁，如果继续上学则发到25岁；全免费教育；无钱缴保险的由政府代缴等。‬\n mrc 发表了 14 小时之前\n"
		},
		{
			"post_id": 34,
			"title": "人口是人力资源，排斥不应是中国人民，人口才是共党的力量源泉。",
			"date_published": 1522827095.623,
			"body": "\n\n一，人口是人力资源，排斥不应是中国人民，人口才是共党的力量源泉。\n\n世界从不缺土地，资源，愿意做事的人才是最缺的。把中国最有用的一千万给予移民资格，这招比什么都有效。\n\n\n\n最近总是看到网上排华人中的非法移民，而香港和台湾有些年轻人有些在叫好。\n\n[外链，非法移民掃蕩風聲鶴唳-華人求職驟減9成](https://www.worldjournal.com/5498868/article-%E9%9D%9E%E6%B3%95%E7%A7%BB%E6%B0%91%E6%8E%83%E8%95%A9%E9%A2%A8%E8%81%B2%E9%B6%B4%E5%94%B3-%E8%8F%AF%E4%BA%BA%E6%B1%82%E8%81%B7%E9%A9%9F%E6%B8%9B9%E6%88%90-%E8%B3%87%E6%96%B9%E9%9B%87%E4%B8%8D/?ismobile=true)\n\n[外链，香港青年叫好，我与其辩论](\nhttps://plus.google.com/+VanessaPoonBlog/posts/bcEBARkaJYL)\n\n\n这处新闻来源是台湾有泛蓝，亲中政治倾向的\n\n世界日报。早已被中共渗透收买控制。现在尽然连香港热心民主的青年也中招了。\n\n\n\n这个新闻来源是世界日报，是由台湾泛蓝背景，亲中办的。也无其它来源，报道内容明显偏向，失去中立客观。\n\nhttps://zh.m.wikipedia.org/zh/北美世界日報\n\n其中在政治立场写着泛蓝，亲中，标注2链接如下\n\nhttp://www.southnews.com.tw/newspaper/00/0287.htm\n\n已经被中共收买控制了，上面有写。现在他们的反应，就是共党想看到的。\n\n，，，，，，\n\n下面是与香港青年的辩论，不知道是不是专业五毛伪装。\n\n 有些偷渡的华人好不容易已经出去了，那怕是色情行业也不害人，何况那只是少数，不害人，自立更生，又不抢劫，偷东西.华人怎么也比黑人和中东移民给当地社会贡献大些，破坏少些。\n\n他们要排华只是因为华人太多了，所以防备心重，而华人也难团结，可能和中共外宣让他们成了夹在中间的人。\n\n但问题是要解决的，如果让他们回国了。共党的势力就更大了，给他们提供了更多的人力，而没有出路，会让很多人一条路走到黑。\n\n真要赶也是对那些大外宣势力的。\n\n那些贪了钱跑美国的共党，罚钱，赶回中国。否则赶普通民众只是给中共添势力，给邪恶共党份子提供作恶后的大后方。\n\n香港人现在受了几年中共的苦就恨中国人不造反，让香港受苦了，恨上中国人民，甚至华人。\n\n可你们想下，你们这才十几年，他们那么久，经历多次文革级别的运动，整死那多人。洗脑那多年，换你们也一样。现在不是反的好时机。还是多发展力量吧，靠骂人民可不是方法。\n\n只会让中共借机制造对立，让双方互相制约。如果中国人民偷渡走了一半到全球其它地区，共党就完了，而世界只会更好。\n\n，，，，\n\n香港青年 Gober Almo :\n\n「如果让他们回国了。共党的势力就更大了，给他们提供了更多的人力，而没有出路，会让很多人一条路走到黑。] ............... \n\n\n\n你真會開玩笑，這些人當中不少是一天到晚嘴巴說愛國，有事沒事替中國領事館站台叫囂，這些人本來就是中共的滲透棋子，這些人值得獲美國居留權？ 你真以為美國人是白痴？\n\n\n\n最好是順帶一起把支共官員的二奶子女，不管tmd全部踢走，讓他們好好享用自己父輩一手建設的偉大祖國偉大成就。\n\n+陈星 美國遣返的重點是「非法移民」，而不是「難民」，而且你又怎知道美國不會甄別呢？\n\n\n\n德國難民的生產力高低現在說恐怕言之尚早。而縱觀美國情況，說中東人的生產力比中國人低，恐怕是你自己一廂情願吧。\n\n\n\n開槍殺人是暴力，給小孩洗腦灌輸假歷史教育，灌輸錯誤價值觀，是為害更大的暴力。開槍殺人是幾十人，洗腦教育是一輩子人，這方面黑人能和中共国人比？\n\n\n\n不過有一點可以肯定，沒聽過有中東人非洲人在美國在德國 跳進噴水池洗澡，更沒聽過 他們到處便溺。假使有吧，也沒聽過非洲人中東人說到處便溺是他們的文化，要美國社會包容。\n\n，，，，，，\n\n+ Gober Almo 中共大外宣出了那多钱和人力，自然收买到了些人去言语腐败，这钱收买美国人都有一定效果。\n\n针对这种情况应该把参加渗透和为中共站台的遣返，可是没有参加的不应该牵连。\n\n中共主要靠的就是绑架民意和鼓励言语腐败。如果这么容易就中招了，那太不应该了。\n\n德国默克尔为中东难民建房，给钱，还让有多妻，这些难民生产力比华人强?黑人非法移民也是多暴力，吸毒，生产上能和华人非法移民比?\n\n\n\n+Gober Almo 我没说美国不会 甄别，而上面那报道中和你的言论都是一味赶人，完全没有要甄别的意思，所以我提了下。\n\n中东的平均生产力你也不是很清楚吧，但他们是穆斯林， 宗教有多少浪费时间和效率的事情你心里应该想的到。 我也看过一些相关的新闻所以才会这么说的。\n\n你说的随处小便这些都是年纪大的 国内游客，中国大妈带小孩子，或大龄妇女。 素质是由环境所决定的在国内这种情况并不会罚所以会出现这种情况，但是在国外会重罚的。如果他们 真的是非法移民的话，时间长一点他们会改变的。\n\n 说白了在国内没有人拿着这些事情去罚他们，所以让他们养成了这种素质，但是到了国外只要重罚，自然会改变这种现状，我还是那一个意思就是不能因为一小部分人就把所有人全部都牵连了。 决定一个人行为的是他的预期，在他国内养成的预期里面这种事情基本不会有损失，所以他会这样做。如果他是以非法移民去的话， 在管理非法移民遣返的法律中有写这些行为会被遣返他们肯定不会去做这些事如果真做了，遣返他们我不反对。但那些没有做的你不能因此就去把他们给前牵连了。\n\n\n\n+Gober Almo 我只是反对扩大打击面，牵连到没有做过的人身上，\n\n别忘了，你也是华人。不管你怎么理解和反对，在美国人眼中只知道你是黄皮肤，法令一出，受影响的也包括你。这条没有包含对香港人，以后也有。\n\n\n\n这个新闻来源是世界日报，是由台湾泛蓝背景，亲中办的。也无其它来源，报道内容明显偏向，失去中立客观。\n\n(https://zh.m.wikipedia.org/zh/北美世界日報)\n\n其中在政治立场写着泛蓝，亲中，标注2链接如下\n\n(http://www.southnews.com.tw/newspaper/00/0287.htm)\n\n已经被中共收买控制了。\n\n上面有写。你现在的反应，就是共党想看到的。\n\n"
		},
		{
			"post_id": 33,
			"title": "Zeronet增加tracker，解决节点少的方法。",
			"date_published": 1522720902.782,
			"body": "现在也并不是很确定此方法是否有效，毕竟我只是个人，不能重复测试。\n下面方法使用前我是已经连开了一晚上程序了，可能是因为时间长了，所以节点掉的很少了，使用下面方法后重启马上几乎全是五十节点以上，但随时间下降了些，但比之前还是要好很多，一天后，我现在现看节点数，发现大多数网站还是在正常水平节点数，50个网站中只有五个是一节点，10个在20到50节点，七成是50节点以上。\n\n\n\n这是写给需要的人的，程序员肯定不 用看了。\n2018年4月3日早上10:00\n我用的Android版，刚根据该方法增加了tracker。重启后马上之前只有一节点的很多网站马上成了40以上节点， 现在所有已连接节点数恢复正常，使用正常。\n我想把这方法写细点推广出去。\n\n我是在Android手机上成功的。\n以下这个方法中的路经是Android，linux平台的，win不清楚。\n增加tracker，下载trackers的列表https://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_all.txt, 在zeronet.conf中加入一行 trackers_file=./trackers_all.txt\n\n\nzeronet.conf文件位置随所用系统平台的不同而有少许不同，需了解不同平台的路经写法区别。\n\n放在那里都可以(建议放在zeronet.conf同一目录，因为上面写的那路经\ntrackers_file=./trackers_all.txt  \n中的./就是指的当前目录的意思。\n), 指定路径就可以。目前里面的tracker，部分已经被封，部分还没有。\n\n\n下面这链接是另外一个回答这个问题的。\n(http://127.0.0.1:43110/zihu.bit/?Topic:1522655036_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh)\n\n\n这个可能是Windows系统下的目录，网上从其它人处复制来的评论。\ntrackers_all.txt 应该放在cor文件夹下面，zeronet.conf在zeronet_win_dist文件夹下面\n\n\n\n\n我是从下面链接处看到的该方法，他们懂的多些，有情况可以问问。\n(http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh/1522583672)\n"
		},
		{
			"post_id": 32,
			"title": "被回避的复仇文化",
			"date_published": 1522130401.698,
			"body": "改自\n\nhttps://m.sohu.com/a/224192007_488303/?pvid=000115_3w_a\n\n\n\n\n前些天张扣扣替母复仇杀人一案，引发议论纷纷，涉及的议题也相当多。我们可以从中看到公权力的缺位、也可以看到人们对法律权威性的不信任、看到传统文化对孝和复仇的肯定和赞颂等等。\n具体案情如何我们不去深究，只是最近看书恰好看到北大法学院教授苏力再版新书《法律与文学》以《赵氏孤儿》的复仇故事来讲述复仇的正当性，改变了我对张扣扣案的观点和立场。\n\n从生物进化的角度，复仇有利于人类的自我保存，因为复仇的“实际作用都是要打击侵犯者，给对方施加某种痛苦，使对方不敢继续或不再侵犯，从而保存了自己。”，这样的人才能生存下来繁衍更多的后代。\n在弱肉强食的丛林社会，如果没有复仇能力对他人形成威慑，自己迟早要成为弱肉强食的对象。\n而且复仇最典型的特点就是滞后性，如张扣扣般的“君子报仇，十年不晚”，正因为有滞后性，所以有了理智的参与，有了细密的算计和安排，使得强者也惧怕弱者的复仇。\n经济学博弈论：一报还一报的最优策略\n在博弈论研究的重复博弈中，最优策略是“一报还一报策略”，这个策略不仅有效的制止被人欺负，还能促进合作的达成，甚至最后促进了人类文明的诞生。\n在进化论中，人类有亲缘利他行为，在复仇中就是亲人有为亲人复仇的义务，所以张扣扣“子报目仇”显得天经地义，本来，如此发展下去，随着亲人参与规模的扩大，势必演化成家族世仇的仇恨循环，\n但是，根据社会学研究，随着复仇规模的扩大，复仇双方很容易找到同一批人群，他们往往成为调停者。\n此外，人数多了不利于合作，各自打着自己的小算盘，而且组织成本极高，很多人都会出现责任懈怠和搭便车行为。\n复仇成为一种意识形态\n如果只从生物进化的角度来看，随着复仇的时间延长，仇恨很容易被淡忘，所以光靠生物学动力，复仇很难解决被淡忘的问题，于是文化动力成为主要动力，就是社会文化支持复仇的正义性，哪怕造成了过度复仇的后果，所以张扣扣赢得了如此多人的支持。不复仇，反而被认为不忠不孝。\n复仇在文化的推动下被制度化，成为人们普遍的义务，甚至民间出现一种种赞美和鼓励复仇的社会意识形态。\n复仇制度的衰落：中央集权的兴起\n复仇的制度化在秦汉之后开始衰落，原因在中央集权的兴起，公权力代替私人的复仇以避免的复仇的扩大化，维持统治的稳定。\n但是，中国古代因为统治技术的局限，法律很难深入基层组织和偏远地区，在这些地方，复仇仍然是维护社会正义的一种自我方式。\n现代社会，虽然统治技术“一插到底”，但是，因为出现贪官污吏，或者有人把持公权力一手遮天，或者法律不作为，都可能导致复仇行为的出现，甚至赢得舆论的支持。\n有人说中国法律和美国法律的区别:中国法律.txt;美国法律.exe.。如何转化格式，我想，这是解决复仇行为的关键所在。"
		},
		{
			"post_id": 31,
			"title": "你经历的哪些事情让你怀疑这个世界是假的/有bug的？",
			"date_published": 1522041856.564,
			"body": "\n特别是读高中前有时刚发生的事，却发现这段刚经历的事早有印象，好似是梦中的记忆突然想起，又不像是梦中又不像是过去真的发生。后来了解到平行时空时，也想过是不是另外平行时空的自己的记忆投射在这个时空的我身上。\n当接触过缸中之脑，黑客帝国中之后，随着思维能力的提升，很多事看的更透，更清楚。\n但又给人一种怀疑这个世界真假的体验，因为预测越来越准，越担心什么要发生，就真发生了，时间大致都准确。\n这可以解释为是早有预料，判断预测能力提升，可还是保留了一份怀疑世界的真假，因为随着眼界，知识，逻辑，思维能力的提升，越发现这世界的离奇，心一想，世界好像就有了相应变化，\n不确定是判断更准还是量子现象，世界是高级文明编的一个虚拟时空，我们是虚拟生命，心想就会有相应程序产生变化?\n越了解这世界越发现假的现像。\n如宇宙分形学，简直就是个程序生成的世界样。\n还有量子效应。\n斐波纳契数列，现象。\n黄金比例。\n这些现象怎么解释?\n"
		},
		{
			"post_id": 30,
			"title": "网文，影视审查导致的脑残垃圾剧情",
			"date_published": 1521781428.3,
			"body": "白莲花，玛利苏，大女主，虐女主更虐男主，意淫，脑残，，，精神娱乐\n空间越来越小了。\n各种政治需要不让写，优质作者写不痛快，读者看不爽，最后这种情况下，只有高中生，大学生，女生，网文工作室写。所以质量超级差，越来越差。和十年前动漫一样无脑。\n\n\n，，，，\n评(烈火如歌)\n，\n我刚看到24集。没得选，拍的不如看的快。\n是不好看。知乎毕竟不是影评主场。宣传方看豆辩上面是主场，有大量说真话有坚守的影视爱好者。\n结果想要好好评的人就鼓动到知乎开新的宣传地盘。\n评论一个电视剧，大家数下有多少是匿名回答。他们在怕什么?\n1，剧情人物设计的剧情太脑残了。\n女一基本上一直在伤情，哭，沉默，\n女一的父亲明知道战枫怀疑自己杀了他爹。\n战枫要解释，他不说，只说对方不信。\n对方说了为何不信，都动刀了，要解释，他还不说，结果被杀了。多脑残呀。\n女主更脑残，明明知道战枫极可能就是杀他爹的凶手，还把所有权利授权给了战枫。\n结果战枫马上就把山庄的核心力量情报部青龙堂给控制了。\n除了让男人舍命救，让支持她的人身受危机，她会什么?无能力要是有精神坚强也罢了，如乐观，坚韧，勇于面对，，，，可这些全没。\n男一，二上来就爱爱爱不停。我实在找不到有哪点值得爱，可能就是对普通现代男人来说是个明星，女主打扮下笑一下还能过日子，值了\n。\n可这是电视剧仙侠玄幻呀，男主可是修真派掌门，皇上最宠爱的皇子呀。\n2，女一的衣着装扮丑。\n本来演员是美。\n可此剧中只有一二套。\n那衣服让人想到红色桌布。\n很少笑，基本是阴着脸，谁爱看哭丧脸呀。\n眼袋好大。像天天哭肿了眼样，或两天没睡觉。二十集全这样。\n所以豆辨中才有人想不通，为何在其它电视演女二号，女四号都美的很，这部里女一反丑了。\n这一点，其它答案说的更清楚\n同样是红衣Look，《烈火如歌》中的热巴为什么一言难尽（分享自知乎网）https://zhuanlan.zhihu.com/p/34509476?utm_source=jp.sblo.pandora.jota&utm_medium=social\n3，再说男一，\n男一弄的像太监一样娘娘腔.\n这是当男观众都死了吗?不要直男观众了?\n二十一集了，还是不知道为何男主为何会爱上女一。男一几十年前就在等她样。\n第一集中直接上来就是男一被女一害的，从仙入魔，最后为了救女一又要回师门求救。\n这是真不用管我们男观众的感受吗?\n凭什么把男人拍的这贱。\n连个解释都没。\n上来就无怨无悔，定死了。\n现在国产剧基本上要虐死男一，男二，男三，\n四十集要准备冒生命危险为女主舍命十条。\n这种脱离现实，一个劲虐男人的电视，哪个男人在点赞?\n4，还在那种大女主，比有多少男人爱，征服男人以征服天下的套路。没有真正的独立精神，怎么可能好看。\n连孙俪都hold不住，国产「大女主」为什么让人烦？（分享自知乎网）https://zhuanlan.zhihu.com/p/30284779?utm_source=jp.sblo.pandora.jota&utm_medium=social\n5，有评论说原著本就是男一娘娘腔。\n原著没看，不过我此处回答的只是该剧的评价。\n这一点不好看不会因原著是这样就说好看。\n另外现在的电视剧是改编的，导演等是完全可以改掉的，甚至不要选这剧。\n只能说，现在白莲花，玛丽苏几乎全是。\n他们也故意要这样的剧本。这样的效果。\n唉。\n男观众的感受为什么要被牺牲?\n6，评论说我执念重。\n以前大男主yy作品也没去虐女主呀，而现在，从白莲花到玛丽苏再到大女主，虐男主越来越严重了。网络小说也一百八十度大转弯开始大女主，玛丽苏。你当这只是偶然?只是因为女观众多?现在更像是想虐男主来精神调教男观众和虐男人的精神让男人没有精神世界，只能工作和ppp。用情欲来刺激消费，gdp。让男人习惯这种生活。\n制造男人的弱点。控制男人。用这主大女主影视剧来让女人眼光更高，男女的把钱用在整容，美容，衣着，物质，骑马找马。给女性更大话语权。\n男的理性不易说服，女友，老婆被鼓动了，也是一样得逞。最后得益者是，，，\n最后的结果是商业兴盛，社会稳定，男人勤奋，女性地位提升。国家强大。\n如果没人提出这个战略，那我来提。\n快把我的回答顶上去，让更多人看到。这一天早早来到 : )"
		},
		{
			"post_id": 29,
			"title": "隐私保护反让中国成了黑暗丛林，降低作恶成本。难信任。",
			"date_published": 1521512762.577,
			"body": "导致了以下两大恶事之源。\n1，信任危机\n2，降低了作恶成本。\n\n甲:难道你不知道吗？中国这个特务国家已经引起国外高度警惕了 这来自于强国人的不要脸，拿着党的好处去外国拿绿卡还要卖情报、所以有人愿意收你才怪\n\n是的，中国人和别国人的特务还真不同。别国人是报名特工学校或者受雇商业调查公司，才去做特务探情报。我翻墙之后才知道，华人在海外是没钱了便找领导主动做特务。前几天还在 t 站发现一高三做五毛的中学生就因为零花钱不够便去做一个月发 268 元的发帖员。真 tm 恐怖！\n\nhttps://twitter.com/Robertlaw198311/status/975672953718394880\n\n评论\n\n添加你的评论\nChengxing3 分钟前回复\n中国没有对坏事查询的系统，甚至披露都不让具体，打着保护隐私的名义，其实，恶人什么隐私都买的到。\n这就是为何不要脸的人那多的原因。\n因为这种隐私保护反成了保护不要脸的。"
		},
		{
			"post_id": 28,
			"title": "赶情送礼现像有多可怕及原因",
			"date_published": 1521166806.024,
			"body": "今天看了文章\n[怎样对付桃谷六仙](\nhttp://www.botanwang.com/articles/201803/%E6%80%8E%E6%A0%B7%E5%AF%B9%E4%BB%98%E6%A1%83%E8%B0%B7%E5%85%AD%E4%BB%99.html)\n于是有了以下内容\n，，，，\n[央视：联络感情变“劫财” “随份子”竟成“红色炸弹”\n央视网新闻\n2018-02-28 ](https://xw.qq.com/cmsid/20180228A0PG6R00)\n\n[又到年底，“红色炸弹”轰炸，一夜之间，身边好像全都嫁光了……黄圃特搜\n2017-11-30](https://m.sohu.com/a/207898693_245457/?pvid=000115_3w_a)\n\n年轻的还好解决这事，父母碰上这事就完了。\n\n\n\n[农村赶情送礼有多重, 年迈父母囤满箱白糖, 儿子看后哭了。简书\n2017.02.09 18:03](https://www.jianshu.com/p/523c1e7901d6)\n现实中特多中国大妈就是这样，死要面子活受罪。\n出门就组团。有事就一起上，一个人不要脸，不讲理好对付，一群就不容易了。最可怕的是倚老卖老，特别是拉上你爸妈。\n本来我家没事的。可要是我说我爸妈以各种名目实质大把送钱他们的时候。他们就不满了，有机会就要爆发。我也只是讲道理式的说下而以，也没去强质执行。钱是他们的，我想管也管不了。我只是分析下给他们听。\n父母也听进去了，想来是减少了这方面开支。可那些人就对我有气了。\n\n赶情送礼，麻将本是正常，可完全没帐，打大打小，送多  了送少完全不知道。只知道总帐年年少了大量。早已远超过正常的情况了。而父母辈互相鼓动，子女血肉沫子都是父母的。\n打了也不能还手。子女只能顺着。有不听的，他们一起上门教训。\n\n女的打就是抓头发，扯衣服先进入缠斗 以避免反应慢，速度慢的弱点，带头的人反在后面，先让我爸或妈冲在前面当盾牌，缠上我。让我不能躲闪，影响灵活，攻击也不便了。后面的再来打。先打的轻，看对方是第一次动手，是老人就也是轻手。\n可对方锁住你锁较死了，就下重手。\n这时我想下重手没机会。我爸妈还在前面当盾牌。\n当我费力脱出封锁。\n体力也去了小半了。我先跑回房反锁，准备恢复下体力再干。\n结果他们报警了。\n这下我还不了手了。\n警察都是屁事不管的。一定程度反是在帮老人。老人不管，其它人管呀。\n老人再不对，一句老人不能关就完了。\n\n\n\n拉上我爸妈，她们动手先无理打我了，我爸妈不想脱离群体也就一服很气样子上来打。先不重手，我就主防和轻手，然后他们就三个人围上来玩相扑。坐在你身上。等你不好还手了。他们再下重手重脚。父母都是容易鼓动的。好在还手了，也说了下次会下狠手比谁骨头硬，反应快，应该镇住他们了。\n我爸也这样被鼓动过。死要面子活受罪。想是在文革环境中受的影响。\n\n\n他们这事只敢做一次，如果你还手并表现下次会下重手。\n\n他们不信道理，先占便宜，遇阻力，先批斗大会，再打。\n如果你软弱，那说明他们的招有用。下次接着用。\n"
		},
		{
			"post_id": 27,
			"title": "老人摔倒到底是扶还是不扶？ - 知乎上的答案好逗",
			"date_published": 1521124968.138,
			"body": "\n老人摔倒到底是扶还是不扶？ - 知乎\nhttps://www.zhihu.com/question/35517162\n好逗呀，短乎上的答案原来两年前就这逗了。\n网页阅读可切换到桌面版网页这样可看到全部。\n其它答案也逗。\n，，，，，\n谢邀 \n\n我现在觉得除非和老头同归于尽，不然没有别的方法能扶了。\n\n呼吁政府成立专门搀扶老人的特种部门，这样看见老人了我们可以拨打热线电话。\n\n由专业人士组成的特扶大队出马，将老人扶起。\n\n扶不起的，就地爆破。\n\n1\n一旦老人躺下，就是你们登场的时候——特扶大队守则第一条。\n\n\n火烧云悬在天上，化作一条燃烧的海岸线。\n\n\n整条中山北路空无一人，只有落叶在秋风里无规律地打旋。\n\n\n警示灯是明黄色，它一圈一圈的旋转，虎斑色的栅栏，被宪兵有条不紊地垒在街道两端。\n\n\n下午3时，老人被发现跌倒在路中央，引起短暂的混乱，特扶大队的人做出快速反应，用直升机垂\n\n直嵌入，疏散人群，避免了大规模踩踏。\n\n\n五分钟后，重型吊机就位，将中山北路两头封死，成为一条死街。\n\n\n唯有中央一点，躺着一位老人，如同台风之眼。\n\n\n阿霜的手轻拂过粗粝的水泥地面，俯下身来，吻了他来时的去路，像是一场无声的祈祷。\n\n\n每一次任务，都有可能倾家荡产。\n\n\n因为老头讹人，向来片甲不留。\n\n\n“D组就位，请指示。”\n\n\n“目标距离50米，暂无反应，请小心。”\n\n\n通讯公用频道里，是女人的声音，那是小孟，她有两道柳叶眉。\n\n\n起风了​，吹得老人的的老头衫呼呼作响。\n\n\n阿霜不喜欢北京的秋风，过于干燥了，让人嗅了嗅鼻子，就好像被吸干了水分，他舔了舔嘴唇，戴好战术头盔。\n\n\n“阿霜，别逞能。”\n\n\n小孟大抵最后还是没忍住，在通讯频道里说了一句，引起战友们的喧哗。\n\n\n“哎呦表白了。”\n\n\n“你们恶不恶心啊，能不能用私人频道啊！”\n\n\n“都他妈闭嘴，出发！”\n\n\n最后那一嗓子是田宇吼的，他与阿霜提上设备箱，从新华书店门口迂回，跨过虎斑色的栅栏，将无脑的警示灯抛在脑后。\n\n\n距离50米，老人躺在地上，胸脯舒缓的起伏，像一条濒死的比目鱼。\n\n\n下午3时30分，特扶作战开始。\n\n\n2\n\n踩上地雷也别踩上老头，前者让你失去一条腿，后者让你只剩一条腿。——美国越战老兵\n\n\n“老人家，你还好吗？”\n\n\n田宇屏住呼吸，轻声询问，此刻他与阿霜距离老人半径不足5米，一旦老人开始讹诈，两个人都跑\n\n不了。\n\n\n“大爷，我扶你起来？”\n\n\n面对田宇的问询，老人没有反应，平躺在地，像是死了。\n\n\n二人对视一眼，阿霜打开通讯频道。\n\n\n“目标一切稳定，估计昏了，应该讹不起来，现在开始特扶作战。”\n\n\n所谓特扶作战，就是旨在老人开始讹诈之前，找专业人员将老人搀扶起来，防止他们对任何靠近的平民造成不必要的经济打击。\n\n\n去年因为搀扶老人，累计造成不必要的经济损失200亿美元，国家扶老办出台了专项整治躺地老人行动，但收效甚微，这才不得已如此。\n\n\n据说首先发现躺地老头威力的，是越战中的北越人民军，在胡志明小道一代布置了大量老人，美军行军途中，看见老人，上前搀扶。\n\n\n结果被讹的连妈都不认识。\n\n\n本来打仗还能挣钱的，这回全他妈赔了。\n\n\n眼前的老人，仍处于昏死状态，他额头有血，想必是跌倒摔伤，手臂弯曲，看来有轻微骨折，但安\n\n详的老人不一定就安全，一旦老人苏醒，就会对离他最近的生物体进行讹诈。\n\n\n“田宇，开始吧。”\n\n\n田宇点点头，从设备箱中起出一套机械手臂。\n\n\n绛红的钢筋错落有致，如同古代兽类一般的造型，隐隐若现中，喷发出灰白的蒸汽。\n\n\n麒麟臂。\n\n\n专为扶老携幼而生。\n\n\n3\n\n我讹人从来不看对方有钱没钱，反正最后都是我的钱。——普通的躺地老头\n\n\n麒麟臂的优点在于内嵌了两台空气压缩机，可以托举超过体重三倍的物体。\n\n\n轻松扶起老人。\n\n\n“阿霜，你小心。”\n\n\n阿霜套上机械臂，齿轮搅动，电源蓄满。\n\n\n“D组，现在开始作业。”\n\n\n“好的，期待你们凯旋。”通讯频道里传来首长的声音。\n\n\n机械手徐徐发动，攥住老人的胳膊，维持在一个平稳的力量水平。\n\n\n“倒数3,2,1——扶！”\n\n\n像是拔地而起，又如同千钧之力。\n\n\n阿霜咬牙一提，老人被扶了起来。\n\n\n处于昏迷（未激活）状态的老人，双目紧闭，呼吸平稳。\n\n\n“田宇，支架！”\n\n\n田宇展开便携式支架，小心放好，它完全符合人体工学原理，可以从老人的肛门处顶入，与老人的\n\n双腿形成三角形支点，保证老人呈现出站立姿势。\n\n\n被称为阿基米德之顶。\n\n\n“给我一个支点，我可以撬起假摔的老人。”——阿基米德。\n\n\n只要老人站起来，作战就算成功结束。\n\n\n一个站着的老人，谁也讹不了。\n\n\n“阿霜，挺顺利啊。”\n\n\n“别立FLAG。”\n\n\n话音刚落，一阵秋风呼啸而来，狂风肆虐，老人原本紧闭的双眸，微微抖动，眼看就要分开。\n\n\n是大自然的力量，唤醒了老人。\n\n\n还有那夕阳红般的呐喊。\n\n\n“谁撞我的？！”\n\n\n4\n\n放手！你这个该死的老头！我叫你放手！——受害者笔录（不许可）。\n\n\n\n“我操！我操！老人醒了！”\n\n\n通讯频道里纷乱嘈杂，作战部瞬间进入二级戒备。\n\n\n浓重的呼吸声成为阿霜耳边唯一的声音。\n\n\n这一刻，田宇和阿霜，谁也不敢说话。\n\n\n老人手紧紧攥住了阿霜的机械臂，而田宇的阿基米德之顶还握在手里，距离老人的菊花不到2公分。\n\n\n然而还是迟了，这该死的风。\n\n\n老人盯着阿霜，那是一双年老浑浊的双眼，看得阿霜浑身一悚。\n\n\n“是你撞我的，我看见的。”\n\n\n旋即，声嘶力竭的大喊起来。\n\n\n“是这个人撞我的！是他！你给我付医药费！我要瘫痪了！”\n\n\n阿霜浑身冰凉。\n\n\n没想到，还是被讹上了，阿霜知道，自己攒着买房的钱，恐怕是没了，这世上的老头最可怕，就可\n\n怕在瞬间摧毁你的人生。\n\n\n你扶起的，不是老头，而是燃烧的死神。\n\n\n二战期间，美国人原本考虑空投一位老头，只要他落入日本本土，方圆十公里以内的人，都会被他讹的半死不活。\n\n\n这位老人就是后来闻名世界的炸鸡鬼，山德士上校。\n\n\n老人巨大的握力，直接捏碎了机械臂，指甲牢牢嵌进阿霜的肉里。\n\n\n老人之握，无人可以挣脱。\n\n\n“田宇，替我跟你妈问好。”\n\n\n巨大的变故，让田宇丧失了理智，他无法眼睁睁地看着自己的战友被讹成傻逼。\n\n\n于是他顾不得许多，做出了违反操作守则的事情——\n\n\n“你哪只眼看见我们撞你了！”\n\n\n没错，就是与老人争辩。\n\n\n\n5\n\n与老人争辩，老人便唤出他的血亲，罪人便万劫不复——圣经​ 老人约\n\n\n\n老人冷笑，他等的就是这一刻。\n\n\n“田宇！总部命令你闭嘴！”通讯频道里，首长怒吼。\n\n\n“可...可阿霜就要被讹上了！”\n\n\n“不好了！我们感应到，有不明物体在逼近！”\n\n\n死一般的寂静。\n\n\n喧嚣之中，尘烟之内，不知从何处，窜出来十三个老头亲戚，他们动如雷霆​，疾如猛虎。\n\n\n该死，该来的还是来了。\n\n\n“你撞了我爸！”\n\n\n“不是你撞的你扶他干嘛！”\n\n\n“爸啊！他们把你撞惨了啊！”\n\n\n田宇目瞪口呆。\n\n\n“对...对不起...阿霜，我冲动了。”\n\n\n眼见阿霜被一群七大姨八大姑牢牢围住，在人与人的缝隙中，阿霜淡然笑笑，并没有责怪田宇。\n\n\n“小孟，你在吗？”\n\n\n这是阿霜最后一个决定，他打开了通讯频道。\n\n\n“我估计，咱结婚的钱，应该是没了。”\n\n\n“没了就没了吧，没钱我一样嫁你。”\n\n\n“这回出完任务，我就是穷光蛋了哦。”\n\n\n阿霜惨然的笑笑，他这么多年的，扶了不下二百个老人，这其中，有遁地王赵大宝，死赖皮刘建国，活诈尸马军，这些高级老头，都被不留痕迹的扶了起来，没想到如今区区一个中山北路老人，成了他的终结。\n\n\n“小孟，你妈说，没房就没法儿娶你，我答应过你妈的。”\n\n\n“阿霜，没事的！我跟你私奔！”\n\n\n“可我说过，要堂堂正正的娶你。”\n\n\n通讯频道里，小孟泣不成声，其余所有人皆静默如海，无人能打扰这最后的道别。\n\n\n“阿霜，你想干什么！组织命令你原地待命！”\n\n\n“你他妈的，不就是穷吗！结婚战友们给你出钱！”\n\n\n阿霜再一次掐掉了通讯频道。\n\n\n你们懂个鸡巴，人穷志短啊。\n\n\n在那个下午，阿霜摘掉了战术头盔，秋风升起，卷了他不长的头发，干涩如霜，他眯着眼，努力的望向天空，想起了小孟。\n\n\n阿霜叹了口气。\n\n\n“大爷，是我撞的，怎么地吧。”\n\n\n连同老人外加十三个亲戚，全部愣住。\n\n\n“他承认了！”\n\n\n“啊哈哈哈！我爸的伙食费医疗费精神损失费！你要全出！”\n\n\n“我爸残了我弟弟妹妹儿子女儿的赡养费，你也要全出！”\n\n\n“爸！好！威武！有希望了！”\n\n\n众人欢呼之中，阿霜从武装带里摸出了战术手雷。\n\n\n“我死还不行吗。”\n\n\n\n6\n\n我扶过的老大娘成千上万，因为我不怕死。——最后一个铁扶屠 雷峰\n\n\n\n经过千分之一秒的考虑，老人做出了这辈子最明智的选择。\n\n\n“大哥！你别冲动！”\n\n\n“大爷，你喊我大哥，不合适。”\n\n\n“哎呀！年轻人，你先把手榴弹放下嘛！”\n\n\n“大爷，我撞了你，我钱都赔你，那我也不活了，咱俩一块儿死吧。”\n\n\n“你这个年轻人，怎么这么冲动呢！”\n\n\n众人陷入了紧张的对峙。\n\n\n在一旁的田宇感觉到一股不可思议的力量。\n\n\n“好像哪里不对。”\n\n\n老人的儿子盯着手榴弹，又盯着阿霜，进行着激烈的思想斗争。\n\n\n终于，他做出了一个艰难的决定。\n\n\n“爸，留着身子骨，不怕没人讹呀。”\n\n\n老人一愣：你啥意思？\n\n\n“爸，你再想想，是人家撞的吗？”\n\n\n“哎呦，我再想想，好像又不是了。”\n\n\n阿霜摇摇头。\n\n\n“别害别人了，就是我撞的，我死给你看。”\n\n\n说罢就要拉响战术手雷，这玩意只要炸起，这一片十几个人谁也躲不过弹片。\n\n\n老人猛然松手。\n\n\n“年轻人，不是你撞的，你若安好，咱俩都好。”\n\n\n“真不是你撞的，我们跟你闹着玩呢。”\n\n\n“小朋友，我爸跌倒是为了锻炼身体，是吧，爸？”\n\n\n老人一个后空翻转体三百七十五度躺在地上。\n\n\n“你看！年轻人，我自己跌倒的，我好的很，你快把手榴弹收起来。”\n\n\n阿霜目瞪口呆。\n\n\n“再见啊！再见！”\n\n\n老人在亲戚的簇拥下，生龙活虎的离开了现场，从特扶作战到老人离开，总计20分钟，其中19分钟，处于紧张的对峙之中，直到阿霜准备自爆。\n\n\n阿霜茫然的捡起战术头盔，将手雷塞回武装带。\n\n\n留在原地的田宇与他面面相觑。\n\n\n通讯频道里炸锅了。\n\n“\n\n阿霜！你快来趟通讯部！小孟以为你要死，自己关房里不肯出来，我们怕她想不开！”\n\n\n阿霜一懵，瞅了眼田宇。\n\n\n“去啊，你他妈看我干吗，全队等着你喜酒呢！”\n\n\n阿霜拔腿就跑。\n\n\n抬头看，火烧云四散而去，天空碧蓝如洗。\n\n\n田宇欣慰的笑了，接通了装备部的通讯频道。\n\n\n“喂，是装备部吗，那个什么麒麟臂去他妈的吧，下次统一给配个手雷，集束的那种。”\n\n\n\n扶不起来，就弄死他。——汉昭烈帝嘱丞相孔明。\n\n\n\n完\n\n编辑于 2015-10-24\n著作权归作者所有"
		},
		{
			"post_id": 26,
			"title": "论民主的宣传计划",
			"date_published": 1521114655.779,
			"body": "\n\nhttp://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/?Post:25:随笔1\nhttp://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/?Post:2\n[最后一次总结](\nhttp://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/?Post:27)\n，，，，\n看上文及评论有感。\n\n我只是在作情景模拟，沙盘推演，理论论证。\n答辩。\n我还是在看，在深思，探讨的。\n大多人看了有疑惑就完了。不会问。\n在这种情况下只能先以读者身份尽量换位思考提出疑惑，并解答。起码要回十个问题才像个样子。否则要说能有影响不可能。\n我说的重点并非是我没细看深思，而是指的。\n你面对人们的疑惑要像禅宗样。\n明心见性，说的话直指人心。\n起码面对疑惑能针对性的回复，而不是一句长文中有，你没细看，这久你还没懂。如果你连十个疑问都回答不清楚，你说有多少人会信?\n人时间精力有限，不可能全回复清楚，但十个问题是必须的。\n否则可能是闭门造车，单方面的空想。\n\n现在问你一个问题，你回复了十句，可十句全不成立，还是空洞的。看似回答了，其实没有。我这么说自然会说清楚的。慢慢写。我现在基本手机打字，没电脑五笔快。只能有闲心了写点。\n1，你说是匿名的，可是法轮功十五年来在国内也是基本匿名的，这不是计划可行的理由。\n2，计划先期只是标识，中期是代表人物事件宣传。中期这个宣传一直墙内墙外都有，都不缺。而前期标识如果人数不够是看不到什么标识的，见到的人不清楚什么意思也不会产生什么影响。\n3，你说计划可行是因为参于人多，目地单纯，公正，道德还是有只是没好方法，，，，。\n可目前你提供的计划，理论上参于人都不见得比法轮功人更多。以上所有根本不是可行的理由。\n这些因素一直有，可没成过。甚至没有逻辑关系。\n例如目的单纯和成功与否无关。\n水至清无鱼，人至察无徒。\n和道德都没逻辑关系。\n现实往往发生道德鼓励不道德。\n有道德的一直有，可除了一再现实让人不敢太道德。不敢被称为好人。\n你说是直接帮助，是好的方法所以会得到支持，让人相信。\n可是从未见过你说过是什么好方法，也不知道你要帮那些人，那些事。\n一直有好人好事，可你看有效吗?甚至越帮越恶化。\n非洲越帮越穷。\n升米恩，斗米仇。\n恩将仇报。\n你的方法，你要宣扬的事怎么避免这些?你从来没讲过。所以我一直说你讲的只有骨干 没有血肉。\n根本就没看到一点计划的可行性，而以前的那些同类方法也是益处和害处差不多甚至坏处更多。\n你连这个都讲不清，又怎么让人去相信你的方案。\n中国从来不缺懂的，难得糊涂，你不可能叫醒一个装睡的人。\n讲的再好。再有理。面对无理，暴力怎么办?不是只有你共才暴力，无赖的。中国普通人从来不缺无赖。你说相互帮忙，碰上家事，老人无理打人你怎么帮?打老人?老人哄抢东西怎么办?等你组织人赶过 去，早散了。你知道谁抢了，你去要回来?\n古来就有秀才造反，三年不成。怎么避免?\n\n"
		},
		{
			"post_id": 25,
			"title": "常用的零网好文章",
			"date_published": 1521100996.304,
			"body": "[用Markdown 优雅的在 ZeroNet 上写文章](http://127.0.0.1:43110/1FRFyuWmfNKJHYFEMikmXmA7ToMiXTRZ6o/?Post:2:%E7%94%A8Markdown+%E4%BC%98%E9%9B%85%E7%9A%84%E5%9C%A8+ZeroNet+%E4%B8%8A%E5%86%99%E6%96%87%E7%AB%A0)"
		},
		{
			"post_id": 24,
			"title": "中国的论理，道德，情爱，欲望，信任，人性被利用的好惨",
			"date_published": 1521087078.941,
			"body": "中国的论理，道德，情爱，欲望，信任，人性被利用的好惨\n成了拉拢老人，妇女，套牢，绑架，分化，洗脑民主力量的手段。\n这篇并未写完，但意思大家看的懂。关于细节可参考本博客其它文章。\n重复的话真的好不愿意再写。过段时间再整理，先这样了。\n，，，，，，，\n口号说是保护弱势群体，中华美德，尊老，男女平等。\n可实际中已经成了道德绑架。以弱去强。分化绑架。\n立法偏帮。\n现在网上民众利益那些是难争取的，如税，言论审查，，说再多一时也难有效。直接就面对中共?先找容易的。像我的博客中写的多是老人，妇女多被你共拉拢了。也容易洗脑，配合。特权多，绑架着有担当些的人的思想行为。\n这是论理上的绑架。道德上的绑架。如果破解不了。根本不可能有希望。钱，权，影响力，大的变态。\n他们平时在新闻上丢脸，被骂。可是那是其它人受了他们的苦和气，在网上爆发下。真见面了，只得供着，怕的要命。\n这又有什么用。他们本来就不要脸。并且平时少看那些新闻。\n他们的影响力多在老家。用赶情，金钱，几十年积下来的同盟。以前我以为外出打工或是一条路。\n可现在你共又在赶人。那些年轻人还是多要回家乡。一切归零。在外面文明，回去了也变一样了。开始站队，帮亲不帮理。心里不愿意也敢怒不敢言。\n相关文章推荐\n[博客目录](http://127.0.0.1:43110/1MZJ9DkXuoTdjiMfT9mzXDNdERFNJy7pdy/?Toc=dateDesc)\n [中国社会一直存在两个中国，一个是属于文明进步开放的中国，一个是愚昧狂暴的中国，而我们一直追求的文明和开放，恐怕没有那么强大的力量。](http://127.0.0.1:43110/1MZJ9DkXuoTdjiMfT9mzXDNdERFNJy7pdy/?Post:12)\n[ 你共的手段是用恐懼，信息來讓人因種族，民族，階級，文化程度，貧富，地區這些差別來製造溝通不便，分化，對立，相互制約。](http://127.0.0.1:43110/1MZJ9DkXuoTdjiMfT9mzXDNdERFNJy7pdy/?Post:8)"
		},
		{
			"post_id": 23,
			"title": "零网只是技术，不好的发展方向需要警惕",
			"date_published": 1521003672.038,
			"body": "\n\n\n\n1，零网有人用多个身份有时弄的好像是所有人态度一致。\n下面内容会反应的很明显。特别 是用来嘲讽时。\nFaith, Yas,Holyins全是他，可能还有更多。\n2，很多网站是开放源码的，支持克隆，也意味着有些没有特色甚至越弄越垃圾的网站存在。\n按理说不用就行了。可是现在零网人本就不多，有人还用多个身份发大量消息，用他自己第三方的网站链接。很多人没注意被裹挟进去，不知觉间又用了他的第三方网站及推文链接，又帮他裹挟了更多人。\n\n3，有些人可能是有民主的目标，可是思维被大环境同化多年，不自觉的使用的是五毛的手段。\n4，几乎每条消息都要带上第三方链接，利用人想看更全消息，好奇的心理。和对隐私，安全的一时大意来病毒式推广网站，言论。\n如果那个第三方网站有特色也算丰富了网络，可是只是为了给自己相关宗教网站做广告，其它都一样，还影响了版面美观。呵呵。\n最担心的是isis伊斯兰教也是利用互联网获得支持和宣传的。\n现在他只是以毒病方式裹挟着全网用他的网站，(360的发展方式)其中包含大量宗教内容，那一天圈到大量容易接受宗教的人士了。他再加上宣扬伊斯兰宗教的那就可怕了。帮了恐怖分子扩张势力。\n下面是备份的内容，可以看出这个迹象。\n，，，，，，，，，，，，，\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF/1521002926\n这是其中最新一个链接。\n\n\n\nChengxing7 分钟前回复\n@Yas: 别给我发18开头的这网站了。我已经删了，不会再授权让你这网站读写权限了。你到现在还在使用360病毒式发展方式。连和你说话都要时时小心一不注意点进你链接，被要求授权。你这种方式真让人恶心。我真不想骂人和说脏话，可只有用这个词才能表达这个事实。我可真没说错。真看不出你这网站有什么值得被需要的。\n你几乎每条消息都要带上你的第三方链接，利用人想看更全消息，好奇的心理。和对隐私，安全的一时大意来病毒式推广你的网站，言论。\n\nYas16 分钟前回复\n@Chengxing: 各取所需，http://127.0.0.1:43110/18CN1o7fquqniiEsbvT5NU8XuWQdMgLW5b/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz/faith@zeroid.bit\n\nChengxing2 小时前回复\n@Yas: 应该是用http://127.0.0.1:43110/Me.ZeroNetwork.bit/\n\n开头的链接，可你发的总是那个你自己的http://127.0.0.1:43110/18CN1o7fquqniiEsbvT5NU8XuWQdMgLW5b/\n结果点进去就到你那网站了，那个版面不好看呀。也没新功能，只是加了你的其它几个网站链接。根本没必要。\n\nChengxing12 分钟前⋮\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz/1521002470\n又在用你那个第三方zerome的链接， 这样下去，几乎全零网人都要间接被强迫用你那个网站了。昨天你还在说链接一样，让我盯着。这块就又这样了。\n\n评论\nChengxing10 分钟前回复\n@Faith: 我只是在提醒大家你这人的言行不一。以及整个你所有表现出来的低级。骂，间接绑架信息，嘲讽，宣扬宗教还说什么理性分析。好笑。你利用一切机会宣传。从不正面辩论。你的手段全是五毛的。我实难相信你能有好作为。\n\nFaith12 分钟前回复\n你随意。你怕可以不上零网。你属于心智扭曲。参与讨论和全文阅读请：http://127.0.0.1:43110/18CN1o7fquqniiEsbvT5NU8XuWQdMgLW5b/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/18wEUYeC38ejRYwFddvbUZLtY6B5Cxb8AG/1520928095\n\nChengxing23 小时前⋮\n以下是关于这个推文的信息。\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF/1520917215\n@Yas: 一，我就是反宗教，因为宗教恶果太多了，就是一个唯心，太过模糊的体系，容易藏污。被坏人利用，现在太多相关坏新闻了。http://127.0.0.1:43110/1MZJ9DkXuoTdjiMfT9mzXDNdERFNJy7pdy/?Post:18\n二，我只是不懂所以请大家讨论下。并且确实还存在我说的另外的几个坏处。\n三，自由选择也要先知道选择的是什么和后果。\n大部分人，特别是以后来的非程序员用户会越来越多。网上又没相 关消息，我只好在网上讨论下。也方便更多人清楚怎么回事。这不算黑。\n四，关于选择不用，呵呵，就像微信一样，用的人多了，想不用都难，现在推文中使用第三方网站的链接越来越多了。以后会更多，不用那个第三方网站，根本不知道其它人说的是什么事。\n如果那个第三方网站有特色也算丰富了网络，可是只是为了给自己相关网站做广告，其它都一样，还影响了版面美观。呵呵。\n五，你不正面讨论全是在回避，加借机宣传你的网站，唉。你真懂宣传。你最想宣传的是宗教?\n\n评论\nFaith21 小时前回复\n@Chengxing: 看我的博客，会知道我大部分经历和人生历程。不过我准备把最后终了的文字，在大多数文字转过来后再转。不轻浮浮躁，也是一种美德。\n\nChengxing21 小时前回复\n@Faith: 我是关于零网懂的没程序员多，但也不至于少到你说的那样少。并且我本身就说的是猜测，并非程序员，请大家讨论。可你非说我不懂装懂。\n你那博客我早看了，没什么特别的。\n没你说的那么理性分析，宗教你开口闭口理性分析显得太假了。宗教本身就是极多不理性的，在现代社会的今天选择宗教本就不是一个理性分析的人会作的选择。\n\nFaith22 小时前回复\n@Chengxing: 我是多个设备在使用，回复按照随机随手使用。你不是五毛不必闹心别人说五毛。你不懂就是不懂，何必一定怕说自己不懂？我前面说的你不懂零网这技术，明白人也能看出来，这个不需要辩论的。 我正整理我的文字文章，关于伊斯兰犹太教基督宗教以及欧美文明，这是其中一篇。有空可以用到阅读思考理性分析上。五毛真的很多特征，但零网的五毛是义务劳动。http://127.0.0.1:43110/1CXMbPCKogSUuJnX7qi75PNFAV7KufYybj/?Post:188\n\nChengxing22 小时前回复\n@Faith: 这几个帐号和都是你那几个网站相关的，你在切换帐号来说我吗?你没有正面回复，只是在说五毛，你不懂之类的。其实我并没有表现的你说的这样。你现在的行为更像五毛，转移话题，不正面回复，以态度来表现对方的错而不用正面回复，和说服，讲理。用嘲讽的词，语句来攻击向你提意见和讲道理的。\n你说链接是同一个，我多次体验到那固定链接不同了。要阅读那链接就必须下载你那个网站的数据，那怕源头一样的数据。可这也确实是一种裹挟。\n间接逼的人非要用你那个第三方zerome.\n\nFaith22 小时前回复\n你可以再看一下这篇帖子的内容，这个站点就是接管了管理权的，可以删除不喜欢的用户。但HolyINS的推特链接，是指向同一个网站，只多了几个链接。你不懂技术问问也没啥，风云跟着瞎吆喝，有点忍俊不禁啊。 ：）http://127.0.0.1:43110/1CKQJtRnW1je6WyBr2R2LGksjHma9pfnPZ/?Topic:1520819754_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz/ZeroNet\n\nFaith22 小时前回复\n@Chengxing: 你这个1，不存在多少坏处。你大概不明白p2p，零网技术的基本原理。每个人的电脑都是服务器，只在乎开机多长时间。数据库一个，网站就等于一个。如果不是同一个数据库，是无法进行同时交互的。网站是主站的，只是增加了几个方便使用便利的链接。你以后对零网熟悉了就明白了。现在不需要小题大做。为了方便大家。零网上盲目攻击别人，不礼貌也许还是小事，但一定不是好事。零网就像无限的幽暗宇宙时空，可以把人隔离起来，无论什么五毛只要在这里吵吵，那么就会有量子纠缠一样的作用，而且是同时的量子对抗。类似有1的时候一定同步出现-1.\n\nChengxing22 小时前回复\n@Holyins: 1，关健是那个推文的固定链接，原网站和你建的第三方的是不同的链接，这导致用的人不知不觉间裹挟其他人使用第三方网站。\n2，你研究宗教的好处，研究了坏处吗，是否坏处更多?好处是否有其它方法替代?根本用不着宗教。\n如信仰可以用信念和普世价值观代替。\n老旧的事物时间长了，难免让坏的事物渗透进去。\n直接用一更新的体系取其精华，去其糟粕会更好。\n3，你确实在积极做着好事，但是，我不能因为你的贡献就对存在的坏处沉默。何况，你产生的益处，其实是和其它人的重复，并掺加了其它，信息缺分类整理。例如新闻，政治和宗教宣传文章放一个博客。如果订阅就全看到。\n给人一种360很有用，但裹挟的体验。我只是希望提下建议。难得愿意出力的。可是现在的体验分类的话会好十倍，现在有等于无。因为选择成本。机会成本。\n如果把你发的消息分成新闻，宗教，原发博文三个订阅，我相信体验会好十倍，而不是现在这样快成信息垃圾了。\n\nHolyins22 小时前回复\n欢迎到这里来添加站点数据，搜索引擎功能很棒，目前没有其他站点能做到。这程序是零网开发核心成员开发的。下面这个我为了管理方便，有最高管理权限。他没提供克隆，我未经同意提供了可以克隆。但大多数人没必要克隆，除非自己私用或一种群体私用。http://127.0.0.1:43110/1Bc3UjaDEQ7DVdDR4Uy7DRAPmUcY3pHQm9\n\nHolyins22 小时前回复\n如果zerome的数据库不是同一个，就无法在我克隆推出的站点进行交互。我现在就在我开的站点上交互。你如果乐意或感到快乐，可以每天盯着删除链接。\nhttp://127.0.0.1:43110/18CN1o7fquqniiEsbvT5NU8XuWQdMgLW5b/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF/chengxing@zeroid.bit\n\nHolyins22 小时前回复\n欢迎你浏览我的博客，使用搜索功能即可。但我正在转移文章过程中，还没有结束。我多年研究宗教信仰对人类文明以及法制民主宪政的关系。你用关键词查询可以了解。我年纪大了身体不好了，已经没精力有一句没一句辩论。你厌恶可以直接从你的首页删除我的站点 。在零网玩无知当萌，不好。http://127.0.0.1:43110/1CXMbPCKogSUuJnX7qi75PNFAV7KufYybj/\n\nChengxing1 天前⋮\n有人把zerome这个站点克隆，(该站是http://127.0.0.1:43110/18CN1o7fquqniiEsbvT5NU8XuWQdMgLW5b/)\n并加上自己的网站链接，而网站数据也是直接要求用户授权读取和写入zerome。刚开始报着尝试的心不知道这是什么功能所以我用了，过了一个月，我确信这种行为有害无益。一，反而会造成用户本来只需同步一个网站，现在想同的数据要同步两次?二，推文的固定链接改变了，不是同一个，时间长了，几乎所有用户会同步两个网站。有了读写权限，我也不知道会否可以替我们写和删。这方面网上也没怎么写，只有一个英文授权询问。希望大家一起讨论下。\n三，由于加上了网站主人的其它网站链接，所以新网站上版面非常不好看，可自行感受。\n四，就算以上三个问题都不存在，这种重复造轮子的行为，不是程度员很反感的吗?\n对于热爱信息自由的用户来说，也最反感分离，分化，隔离趋势的行为。\n现在民主力量就是一盘散沙。这是最后的一块希望地。现在就开始把zerome这么干了，起码这个现象更接近分化，不管网站主目地为何，可看到的人，会感受到分化，分化网站当然有好的面，毕竟去中心化是好事，但只为了加几个链接就这样做我怎么想都认为不好。\n\n评论\nHolyins22 小时前回复\n@Chengxing: 这话题也许不需要继续了，有问题当然可以随时提出来。只是不要用反宗教反信仰，来戴上自己的有色眼镜。零网上胡扯几乎是浪费时间，因为网络技术不一样。Holyins · holyins@zeroid.bit ― 刚才回复\n如果zerome的数据库不是同一个，就无法在我克隆推出的站点进行交互。我现在就在我开的站点上交互。你如果乐意或感到快乐，可以每天盯着删除链接。\nhttp://127.0.0.1:43110/18CN1o7fquqniiEsbvT5NU8XuWQdMgLW5b/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF/chengxing@zeroid.bit\nHolyins · holyins@zeroid.bit ― 2 分钟前回复\n欢迎你浏览我的博客，使用搜索功能即可。但我正在转移文章过程中，还没有结束。我多年研究宗教信仰对人类文明以及法制民主宪政的关系。你用关键词查询可以了解。我年纪大了身体不好了，已经没精力有一句没一句辩论。你厌恶可以直接从你的首页删除我的站点 。在零网玩无知当萌，不好。http://127.0.0.1:43110/1CXMbPCKogSUuJnX7qi75PNFAV7KufYybj/\n\nYas24 小时前回复\n@Chengxing: 用我的这种链接，可以方便使用。你喜欢也可以随便做，没人管得着。砍柴栽树生孩子，不必担心自己的不行，别人的不好。零网最大黑人的技术大概就是下载大资料或软件。但是否有黑js,我目前没遇到。\n\nChengxing24 小时前回复\n@Yas: 一，我就是反宗教，因为宗教恶果太多了，就是一个唯心，太过模糊的体系，容易藏污。被坏人利用，现在太多相关坏新闻了。http://127.0.0.1:43110/1MZJ9DkXuoTdjiMfT9mzXDNdERFNJy7pdy/?Post:18\n二，我只是不懂所以请大家讨论下。并且确实还存在我说的另外的几个坏处。\n三，自由选择也要先知道选择的是什么和后果。\n大部分人，特别是以后来的非程序员用户会越来越多。网上又没相 关消息，我只好在网上讨论下。也方便更多人清楚怎么回事。这不算黑。\n\nKehao9524 小时前回复\n同意@Yas 三种担忧其实都大可不必，数据方面应该同步的是同一份数据库，虽然不知道zeroNet复用性好不好，但是应该没有安全问题。实在不喜欢直接右上角0拉开然后删除这个site就行了。\n\nYas24 小时前回复\n下面这个我为了管理方便，有最高管理权限。不懂可以问，别乱猜到不靠谱甚至诬陷造谣，不是都厌恶造谣吗？http://127.0.0.1:43110/1Bc3UjaDEQ7DVdDR4Uy7DRAPmUcY3pHQm9\n\nYas24 小时前回复\n@Fengyun666: 零网网站全部开源也没有任何加密，你可以对比检查，不能装酷。\n\nYas24 小时前回复\n是不是反信仰，反有神论，就得连网站也污蔑一下？呵呵。\n\nYas24 小时前回复\n@Fengyun666: 这就是官方代码，增加了几个网站链接。我一个不懂编程的人做的，被各位高手阴谋化，就搞笑了。\n\nYas24 小时前回复\n链接的数据库是一样的，这种皮肤不一样，内核进程都一样，无安全问题。我开的。不同hub用户或不同网站的zerome内核，道理都一样。加上链接方便个人或部分人使用。你可以不用。\n\nFengyun66624 小时前回复\n@Chengxing: 简单地说，克隆的这个版本的 zerome 的代码不是官方的。如果授权这个第三方 zerome 可以读写你的硬盘，那么理论上，你的信息是有可能泄露出去的，除非你检查过这些代码没有问题了。\n\nBiliiBilii24 小时前回复\n@Chengxing: 同一个人（zerome数据），换了不同的衣服（皮肤）而已。 但安全性方面我不懂。\n\nChengxing24 小时前回复\n@BiliiBilii: 不懂，我不是程序员。能说清楚点吗?\n\nBiliiBilii24 小时前回复\n不是乌龟壳吗？"
		},
		{
			"post_id": 22,
			"title": "关于我，我的简介及其它平台链接",
			"date_published": 1519883668,
			"body": "关于我，我的简介及其它平台链接\n\n\n\n\n阅读本博客如果是手机阅读切换到桌面版排版会更好，建议尝试。\n\n一，我的联系方式及网站\n\ngoogle博客（我的新启用的文章首发地）：https://wditsh.blogspot.com/\n\ngoogle+暂时内容最多，但阅读不能按文章列表查找，所以推荐先看g+,再看博客。博长期没更新，18年三月起开始列为我的首发地，以方便整理和阅读。\n\n去中心化分布式我的零网博客地址\n\nhttp://127.0.0.1:43110/1MZJ9DkXuoTdjiMfT9mzXDNdERFNJy7pdy/\n\n通知及时度 100:google+:https://plus.google.com/100794842776918395700/posts/Jii3ufc5VaM\n\n\n\n通知及时度数50:推特：https://twitter.com/evolutionboy1\n\n\n\n\n\n\n\n二，公开这么多的原因。\n\n个性宣言\n\n人的所有問題都源於自己欺騙自己，我決不騙自己\n\n介绍\n\n隨心所欲而不逾矩. 最应该被恐惧的往往是恐惧本身.\n\n二十多 年，越发现，身正的人，有准备的逐步公开些信息，更好。否则早晚会碰上更多下面这种人，利用信息不对\n\n称，玩消耗战，他们的价值就是靠毁灭别人创造 的价值来获得的。在他们传统过时的思想里，因为毁灭远比创造容易，所以通过毁灭别人创造的价值来争权夺利是最轻松的。大多数人大多数时间，支配行为的不是显意识是潜意识，好像想了，好像没想，不明显的意念，这就是潜意识，\n\n成本，收益，风险， 潜意识中只这几个简单法则，没什么仁义道德，\n\n然后自然的就去做着，损人利已甚至损人害已的事，\n\n我公开信息就是为了减少与这种潜意识里把我当好惹的，以为惹我成本低，收益高，风险小的人的冲突。\n\n对于一般人，公开信息反而是 最优选择，人心里都会有匿名能说话更自由的想法，但说过激 了反而没什么效果，并且也没几个人真会放开说，最后反而连能说的都没说。匿的好处没，坏处到全占了。说少了，别人还当你软弱，老实，更可欺。不要脸，愿意 试试你底线的人总多的是，干脆公开些信息，岂不简单。\n\n很多人把公开了对自己有害，但芙容姐姐等那些巨不要脸的，公开信息还整容发达，成了励志事迹了。这是互联网时代。\n\n"
		},
		{
			"post_id": 21,
			"title": "探讨中国乱像形成的文化漏洞，及怎样修复",
			"date_published": 1520737036.593,
			"body": "刚看文章有人说中国是因为基因才有这乱像.\n\n(基因这文章http://xqttx.blogspot.jp/2018/03/blog-post_8.html?m=1)\n用基因这个词不好，首先全球各国现在还有人表现的热爱中共。\n甚至宗教都妥协了七名主教。\n苹果进入中国也得交出用户隐私。\n难道说全球人有这基因?文化基因也不对。\n文化中缺少应对对方通过不正当竞时的反抗方法。\n所以越是没底线越活的好。\n这种情况下，极左，共产，\n专制，成必然。\n卑鄙是卑鄙者的通行证，高尚是高尚者的墓志铭。\n杀人放火金腰带，修桥铺路无尸骨。\n古今中外都是有这种情况，区别在于机率。\n虽然很多人知道怎么应对，可是简单表述清楚，并推广，达成共识还远未达到。\n在大陆能解决这种现像的思想，\n也是潜规则中属不政治正确，全网要删的，极可能这样。\n希望大家一起探讨这些，并宣传。否则永远多数人不愿当好人，君子。\n大陆人是很不喜欢别人说自己是好人，君子的。\n好人卡，君子固穷矣。\n要么就多是伪君子。被人说是傻，书呆子。\n君子可以欺之以方。\n我之前写过相关文章，[中国一切问题的根本，专制势力留下的文化思想漏洞](http://127.0.0.1:43110/1MZJ9DkXuoTdjiMfT9mzXDNdERFNJy7pdy/?Post:6:%E4%B8%AD%E5%9B%BD%E4%B8%80%E5%88%87%E9%97%AE%E9%A2%98%E7%9A%84%E6%A0%B9%E6%9C%AC%EF%BC%8C%E4%B8%93%E5%88%B6%E5%8A%BF%E5%8A%9B%E7%95%99%E4%B8%8B%E7%9A%84%E6%96%87%E5%8C%96%E6%80%9D%E6%83%B3%E6%BC%8F%E6%B4%9E)\n关于这方面很少信息，甚至很多人不清楚还反对。"
		},
		{
			"post_id": 20,
			"title": "中国老人政治太严重了",
			"date_published": 1520678958.207,
			"body": "\n中国老人政治太严重了。\n,,,\n前言\n\n 在威斯敏斯特教堂旁边，矗立着一块墓碑，上面刻着一段非常著名的话：\n　　“当我年轻的时候，我梦想改变这个世界；当我成熟以后，我发现我不能够改变这个世界，我将目光缩短了些，决定只改变我的国家；当我进入暮年以后，我发现我不能够改变我们的国家，我的最后愿望仅仅是改变一下我的家庭，但是，这也不可能。当我现在躺在床上，行将就木时，我突然意识到：如果一开始我仅仅去改变我自己，然后，我可能改变我的家庭；在家人的帮助和鼓励下，我可能为国家做一些事情；然后，谁知道呢?我甚至可能改变这个世界。”\n　　《心灵鸡汤》说提到威斯敏斯特教堂有这样一块墓碑，但是其实并不存在这样的墓碑。\n        无意中在百度百科中发现，这样的一个事实。可是，有什么关系呢，就是这段话曾经给我力量坚持去做一些事情。到底是谁编的，这无比美好的谎言呀。\n相关链接\nhttps://m.douban.com/note/111893452/\n正文\n，，，\n其它国家有老人，但在文革，马列，独生子女，网络审查，这些因素下，中国老人政治才是中国最大问题。\n人大从不投反对票的老太婆，历上最长连任。\n终身制，常委，七上八下。都是老人政治。\n很多人把中国问题归结为你共洗脑，骗，暴力恐惧。但十三岁小孩子都会这些招。\n为何只有中国这大效?\n文革，运动，毛，苏联的毒太重了是先期原因。\n可文革过了四十年怎么还恶化了?\n就是因为之前的恶果基本保留，而年轻一代\n却因为信息管制，对文革，对过去使人心恶化的恶果严重缺乏了解，重视。等经历太多后明悟已是身心俱疲，套牢了，没劲了。\n光洗脑一代不够，互联网下第二，三代也不好洗脑。\n存在的这些遗毒自发默契的结盟，争权夺利，掌握局部范围舆论权。威逼，空头支票。建立权威使年轻一代怕了，基本上事事顺着。只有这种情况才好长期洗脑，不愿意到认命。\n不用老人洗脑，以赶情送礼，一直在当地建立的老人中年妇女默契。人脉网一压下面就只敢顺着他们了。以老一代被洗脑几十年的思想为准。\n房价一涨，老人发，离婚越多女的越发，只要变坏就有钱，年轻男的想变坏来钱没他们方便。\n他们太多不正当特权了。\n碰瓷，打人，作小恶也不关的特权给了老人。\n大权在老人身上的多，老人，四十岁以上的妇女占一半人口，几乎无人敢惹，警察敢对付年青人都不敢对付他们。多少丑新闻，那多老人，妇女参加，笑的很开心，一点都不怕，上新闻也没事。\n很多人翻墙出来了，敢骂习，也不敢说他们。\n家和人是好比身体的细胞，周边的细胞染上癌症，艾滋病毒，不敢管，不管说，敢骂习，骂中共。\n不是所有人老人，妇女这样，但这种 现像才是专制的基础，年轻人都成了房奴，老婆奴，孩奴，，，什么事都成了他们的责任，还没权处理家事。年轻人只知道跑到外地发展，结果家乡问题越来越重。最后大城市把他们当低端人口赶回乡，当牛作马，除了科技进步带来的点好处(还包含很多因互联网得到的侵犯外国知识产权的好处)，基本没让社会进步过。\n我面对过这些问题，亲身感受，我的问题解决了。\n可这种现象太普遍了，中国最大系统性问题之一。\n能翻墙出来看的到这信息的人，大多能处理好这些，环境也好些，可能感受不深。\n但细想下会确认真实性的，不要急着喷我，我不是为自己，如果是也是希望大环境好些，这样对我更好。\n欢迎理性讨论。\n可以看下我发的其它信息，会更了解我的意思。\n，，， \n 在威斯敏斯特教堂旁边，矗立着一块墓碑，上面刻着一段非常著名的话：\n　　“当我年轻的时候，我梦想改变这个世界；当我成熟以后，我发现我不能够改变这个世界，我将目光缩短了些，决定只改变我的国家；当我进入暮年以后，我发现我不能够改变我们的国家，我的最后愿望仅仅是改变一下我的家庭，但是，这也不可能。当我现在躺在床上，行将就木时，我突然意识到：如果一开始我仅仅去改变我自己，然后，我可能改变我的家庭；在家人的帮助和鼓励下，我可能为国家做一些事情；然后，谁知道呢?我甚至可能改变这个世界。”\n　　《心灵鸡汤》说提到威斯敏斯特教堂有这样一块墓碑，但是其实并不存在这样的墓碑。\n        无意中在百度百科中发现，这样的一个事实。可是，有什么关系呢，就是这段话曾经给我力量坚持去做一些事情。到底是谁编的，这无比美好的谎言呀。"
		},
		{
			"post_id": 18,
			"title": "现代社会下宗教更容易带来问题，特别是中国",
			"date_published": 1520560548.796,
			"body": "  > 古罗马哲学家塞尼加：“宗教被普通人认为是真实的，被聪明人认为是虚假的，被统治者认为是有用的。” \n\n好人自杀是因为文化被政权处理过，把好人教成了老好人，只会逆来顺受，和稀泥，所以越活越穷困，对环境绝望，压力大。从文化，宗教中寻不到理论出路。本来有的，但太不起眼了，这方面总有股力量不让宣传样。加上忙的没时间思考，寻求解决方法，最后绝望，崩溃。\n\n宗教只会让自杀死的人更多。因为宗教基本上都是只求神来解决，期望提升个人道德，反被教条，道德束缚，更穷困，宗教思想脱离现实。\n这是一个反对伊斯兰教的网站，里面有很多宗教不好的一面。\n，，， ，\nKill ISIS消灭伊斯兰邪教\nhttp://127.0.0.1:43110/1yu7Nm2w4aetrKzr77nCisHtuLCKsmijE/\n\n ,,,,,,,\n关健是面对对方不道德，以达到竟争优势时，宗教在这方面指引不了。最后达到的效果就是让局面更混乱，让思想更混乱。\n因为宗教本就是一个混乱的体系，信神，唯心，\n不科学的体系会带来更多混乱。而混乱是一切灾难和困难的源头。宗教的好处可以单独用其它方式代替，这样更好，免得把坏处带来了。\n\n好比爱往往让人作恶，每一个作恶的人，都是出于一份爱。因为爱这个体系本就是混乱，\n爱是一切维心。本就不是讲理的。\n\n世上有很多体系，有的体系就是不想讲道理，道德的人更愿意用的，\n\n有讲理讲人权的理论不用，非要去选择宗教，爱来解释，信仰，最后往往低效率。讲不到一起。\n宗教主教关怀好处几乎没有，首先，主教才几个，另外需要多少物力人力，有这物力人力能做的好事比这点好处好多了，\n且凭什么宗教来了，就有人出这物力，人力，\n愿意的也不是因宗教。现在很多宗教像做生意，先资本投入圈人，再靠习惯上的相信来赚钱，最近不是有个大新闻，宗教和中共合作了。七名中共成员成了主教。\n，，，，\n有的人，你跟他讲道理，他跟你耍流氓；你跟他耍流氓，他跟你讲法制；你跟他讲法制，他跟你讲政治；你跟他讲政治，他跟你讲国情；你跟他讲国情，他跟你讲接轨；你跟他讲接轨，他跟你讲文化；你跟他讲文化，他跟你讲老子；你跟他讲老子，他跟你装孙子！你跟他装孙子，他跟你讲道理”。\n\n我要加上，你和他讲道理，他和你讲道德，你和他讲道德，他和你讲爱，你和他讲爱，他和你讲宗教。\n我可不想中国出现讲更多的宗教。\n不想更混乱了，坏处远大于好处。好处也有替代方法。\n"
		},
		{
			"post_id": 17,
			"title": "中国式繁荣牺牲了太多,很难说成功与值得",
			"date_published": 1520477433.049,
			"body": "表现在外的盛世，在政策重要执行的位置如gdp，内需，投资繁荣。单一的外在价值观，赚钱。人的思想都绑在一起了。\n用人性危机，信任危机，自由意志的退步，虚假的统计换来的gdp繁荣，用女的来推动政策执行，刺激内需，提升消费。"
		},
		{
			"post_id": 16,
			"title": "關於中共使用女人，老人和金融維穩的隱性政策猜想",
			"date_published": 1520408508.094,
			"body": "關於中共使用女人，老人和金融維穩的隱性政策猜想。\n我是生長在大陸小城市的人，只是為了更多人看懂用了繁體字，不知道港台看簡體吃力嗎？\n,,,,,,,,,\n中國大媽是政治家，戰略家，經濟家\n年輕女性是經濟家，男的是哲學家，經過多年的調教終於開始看透那些不願正視的陰暗\n。\n電視小說都受監管，現在連小說監管的都那噁心,,,,\n可電視為什麼現在這跪添女觀眾，男觀眾錢給的少？評論的少？要說這裡沒政策支持真難讓人信。\n我一直想不明白，除非有隱性政策力量加入\n，就像少數民族有特權樣，拉一派，拉的就是女性，否則八千萬黨員肯定不夠，拉一半女的才是，女人能頂半邊天的口號就是那樣來的，紅衛兵，江青，葉群的夫人政治都有跡可循。跳廣場舞的只有中國大媽，沒男的跳，她們相信集體多過親人。\n房地產剛需靠丈母娘結婚的剛需，\n男的當了車奴房奴，養四個老人，甚至兩個家族都要照顧。累死累活有什麼好，\n現在女的腦殘的男的老實點就動不動讓男的淨身出戶。難道是因為電視劇裡離婚男的基本淨身出戶嗎？\n不可能有完全的證據，但附合現實。\n我最怕的就是這個。男人對另一半的稱呼，在大陸常用領導來稱呼。\n女性也是最懂上面意思，最配合的，也認為現在地位的超高提升，明顯在這方面有這個潛在明面支持。\n实际上中国大妈都是编外党员。\n電視瑪麗蘇，白蓮花越來越嚴重了，不懂的百度搜。其實和綠茶婊，心機婊沒區別，電視成了給男人洗腦成女人奴的工具了。\n以最新電視劇（飄香劍雨）為例，相比古龍原著的真實黑暗面，這電視改的太和諧了，原著女主若壁身為妻子自願被天爭教主勾搭成姦，現在十二集中男主角願為妻斷手，真斷了，而爭天教教主變成了主角妻子若壁，現在影視全盯上女人對家中錢的主導地位了，各種無腦跪添女觀眾。男主個個成了愛奴，不為女的無腦死當不了男主，好評多為女觀眾。\n共黨和女人，小人，常用的是（道德經）裡的（弱者道之用，反者道之動）\n反智，反以前的規則，來獲得自身利益。\n貪官上位，就會讓能力差的上位，因為能力差的明白，如果上面的這貪官\n倒了，自己憑能力坐不穩，他們是最好的勾結對像。\n大陸49年以來一直這樣。\n攻擊知識份子，斗地主，有錢的，資本家，發動的都是紅衛兵，孩子，老人。現在的政策明裡暗裡偏向女的和老人太多了，多到極端不合理。\n房價高得益的是有房或地的老人，婚姻法得益的是女性，結婚男人付出太多，女的憑白得一半還不知足，離婚政策也偏向女的。\n中國出現了誰弱誰有理，誰窮該幫誰的邏輯。\n年青男的在這壓力下都越來越偏中性，同性戀和獨身主義，不婚主義，混日子，他們看不到多少希望，也因此沒什麼動力。"
		},
		{
			"post_id": 15,
			"title": "中國的問題的最大外因是蘇聯和俄羅斯的地緣政治，英國挨著蘇聯也會是一樣的下場，別一個勁兒的罵全體中國人",
			"date_published": 1520406097.666,
			"body": "\n1，主因是地缘政治。\n不管哪個國家挨著蘇聯都好不到那去，別把一切怪在中國人身上，如果中國離蘇聯遠，中共上不了台。如果英國挨著蘇聯，英國現在也是社會主義國家，也專制。\n當初德國被兩大陣營分成了東德西德，隔離牆就是那時出現的，可德國邊上是歐洲各資本主義國家，所以後來又拉進了资本主義民主陣營，可中國除了和蘇聯近其它位置全是海，這中兩大陣營由於地緣上造成的力量傳導效率所達成的平衡，到今天土爾其想入歐都難也是這原因。\n社會主義國家以前更多，可現在剩下的基本都靠的很近，\n俄羅斯邊上是中國，中國邊上是朝鮮，朝鮮和韓國唉這本身以前就是一個國家分成的兩半兒，香港情況的惡化大家也都看得很清楚了，這都是地緣政治導致的兩大陣營的主導者意識形態對立和傳播成本導致的。\n如果中國發生推翻中共的運動，俄羅斯都會暗中出面阻止，你信不信俄羅斯是不會允許這麼大的一個鄰國竟然是資本主國家。\n這一切的原因是因為蘇聯和俄羅斯需要國土上的戰略縱深，這也是為什麼蘇聯一定要讓蒙古獨立的原因，即使是同為社會主義國家俄羅斯和蘇聯也要放著中國而之所以有了一個蒙古還要中國也是社會主義國家那是因為現在的導彈射程太遠蒙古還不夠。如果中國人少一點面積小一點俄羅斯可能就沒有這麼大的顧慮，臥踏之側豈容他人酣睡。\n2，人口，国土，民族单一导致的排外和巨大体量带来的惯性。\n如果中國不是人這多，地也相對多，不會這大問題，如果分成三份，我假設，那不和蘇聯挨著的兩份定會發展好的多。\n還不​​是因為蘇聯當時和美國是兩個巨無霸而蘇聯，現在的俄羅斯就挨著中國。\n我一直強調原因之一是人多，並不是說缺少資源，而是指的是人越多就相當於一個物體的質量越大，它的慣性就越大，他就越容易處於之前他所處於的狀態，保持之前的軌跡不容易改變。當一個國家的人多資源多的時候這個時候如果他已經是民主的，已經是好的，他就會容易變得更好，當她這個時候已經處於專制獨裁壞的時候，它就會更不容易好，我記得好像有這麼一個效應叫做馬太效應，就是窮得越窮，富的越富，好的越好壞的越壞。\n有人說中國人不多，並以印度為例。可印度是種姓制，革命的動力都不足，貧富差距也極大，部落制，是多部落合起來才有那多，所以極權度不高，可中國有全球四分之一的人。\n3，毒文化，国民性相比其它原因影响不大，这些本身是前两个因素导致的果。\n有人非要說是中國人才是問題本身，那也要說清是中國人的制度，文化，還是習俗問題？說香港，新加坡是因為英國，那台灣了是因為美國？如果這樣，那大陸如不是蘇聯，人多，現在為什麼不是多個像台灣樣的，起碼不是基因問題。\n別把文化成分看得太重了馬克思文化是外來的，才那麼點時間就造成這麼巨大的影響，並且通過打擊之前的文化文化是可以短時間內輕易改變的相比於地緣政治導致的強大外部力量文化那點力量不算什麼。\n現實不光是簡單的因果，線性關係，往往因也是果，果也是因，中國人的國民性是差，可是國民性也是其它那些因產生的果，假如是國民性差的原因，可如不是那多巧合共也早下台了。\n有多少小國家被英國殖民了，簡單鬧一下就獨立了，他們的國民性垃圾的很，可也過的遠比這好。希臘危機都全國的狗都免費醫療了。我可沒看出他們國民性高到那。要知道他們可沒有共黨。\n哪國人沒有劣根性？就算逆向淘汰幾千年，可如果中國不是人這多，不是因為地緣政治，共黨不會上台，上了也會下去。這是事實，每個國家的人民的國民性不是天生好的，如果不是上面兩個條件，早平均水平起來了。台灣也有過蔣的專制期，可因為地緣政治好，加上小，所以好起來了，朝鮮和韓國在這一點上很明顯，香港正是因為和大陸近，否則不會這樣。\n光毒文化也造不成今天這大的問題，蘇聯地緣政治的影響是外部最大原因，內因最大是人多。你別說的全中國都傻子，也別以為現在毒文化有多大影響，現在毒文化的影響主要在表像了，毒文化過去是因，現在毒文化是果了，並且只是中共的惡果被解讀是毒文化原因，照你的說法朝鮮沒有毒文化怎麼更加獨。\n內因還是我說的那兩個加中共已經上台了。\n4，形成现在这大问题的必要条件最少7个，不要简单归结为中国人垃圾不是人，国民性差，然后对全体中国人无差别人身攻击。\n我不是說一切原因只有人多，而是說原因最少有7個同時存在，才會發展成這難難解決的惡果，其中最關健的原因是地緣政治，\n共能上台的必要条件有\n4.1，几千年的愚民劳民政策，4.2，苏联斯大林，社会主义兴起的国际时机与地缘太近导致的地缘政治，离西方社会也远的很4.3世界大战，日本的侵略，4.4，毛利用一切，4.5，国民党儒家的愚腐。这些条件少一个都不会让共党上台。4.6，中国人太多了，所以易出现一粒老鼠屎，搞坏一锅。\n并且因人多导致的坏而不倒。\n5，面临的危机，出路，希望所在，发展趋势。\n高科技被应用到专制方面了，面对言论的审查，网络的审查，\n立法管制公司，网络，金融，打压加密货币，区块链，去中心化。\n未来发展方向正是这些，因为这才是他们最怕的"
		},
		{
			"post_id": 14,
			"title": "骂中国人没有用，有用的是区块链，去中心化，帮助肉身，网络，金融翻墙。要骂也骂些你们不知道的，关于老人和女人的人性危机，杀熟。",
			"date_published": 1520304587.466,
			"body": "很多人天天骂全体中国人，那怕百分之九十五该骂，也不能骂了百分百呀，简单一个标签中国人就全骂了，这百分之五人现在也是极不易 的情况下的成果。\n并且二八法则，这些人的影响力如果没有共党干涉绝对会高于其它部分。\n共党也要团结一切可以团结的，那怕其它全错了，只要这一点做到极致也成了。那些无脑骂全部的人好意思吗。\n其它人也有难处的，别骂的像真的都是傻子，可能吗?让你们生在大陆你们不定表现更好。\n因为没素质，生活情况差的，没文化的人更多，他们冒不起险，一个年轻男性要承担妻，子，四个老人及两个家族，房，医，教育，，有些事是功在千秋，罪在当代。他们冒不了险。极易分化，借力打力，加上权贵控制的金融，通信，武器，司法等，所以明显完败。唉，平庸之恶，道德，情感，金钱等全绑在一起了。如果一年轻男性要参加个游行，全家都会反对，要是受了一点损失，妻离子散，被五，六十岁的父母送进精神病院调教一点不奇怪。文化大革命，计划生育造成的现在的大陆人口结构及素质，以及媒体，小说，网络审核导致的思想垃圾，港台的可能理解不到位。除非年轻人不被现在的那些对孝，爱，责任，风险束缚，有了新的定义，否则就没希望。活在共产社会就这样，全都绑在一起\n，智商，智慧，勇气，财富，希望，幸福都有极强的被平均压力\n共能上台的必要条件有1，几千年的愚民劳民政策，2，苏联斯大林，社会主义兴起的国际时机，3世界大战，日本的侵略，4，毛利用一切，5，国民党儒家的愚腐。这些条件少一个都不会让共党上台。6，中国人太多了，所以易出现一粒老鼠屎，搞坏一锅。\n并且因人多导致的坏而不倒。\n但全怪在中国人身上也确实不公。太多巧合了，到现在继承苏联的俄罗斯 也好不了多少。。唉。在这里可以清楚的看到如果没有苏联的地缘政治\n今天应该平均水平发展成台湾。\n我只对自己负责，别人做错了，我羞耻个什么。生在这又不是我能选的。"
		},
		{
			"post_id": 13,
			"title": "家是国这身体的细胞，如不能解决 艾滋病病毒，癌细胞 ，身体又怎么可能好了。没要对长辈不好。但只有正视历史才能更好的提高效率。",
			"date_published": 1520223485.185,
			"body": "，，，，，，，，，，\n文革作为一场官民共同承认的浩劫， 却变成受害者和加害者共同守护的禁区。官方不准公开谈论，受害者不堪回首，加害者不愿忏悔，后来者不甚了了。绝大多数文革史料要么被封锁在黑箱中，要么腐烂在参与者的记忆中，老一代三缄其口，新一辈不求甚解…在这种状况下，要中国人忏悔真难，要为政者忏悔更难！\nhttps://t.co/bKdw8dUixx\n，，，，，，，\n无限进化体:确实这样，从未现实有老人主动和我提到过文革，网络上见的都是文章式，而不是即时通讯有老人提。\n现实中老人第一句是\"你/他怎么会知道文革的?\"，多听一次，经历越多，越正视了一点， 网上传的广的那句\"不是老人变坏了，是坏人变老了。\"是有根据的。老人经历了十年文革，及其它运动，卑鄙才能有点安全感的年代。文化，信仰，道德被运动毁掉了，现存的，大多数只是在随周围环境摆动而以。基本都没有信念，文化，道德。老实是因为没能力，老了。包括我的父母也是这样。后辈也感受的到，出于独生子女政策及房价飞涨，老人的退休金，几十年的人脉，以孝来稳定统制的传统。后辈也潜意识里怕老人，一言一行受影响非常明显，却不会承认，习贯了，不愿正视。\n但不愿正视，或因不深入思考，就难以预料很多事，无用功，后辈如不能从这种孝顺统制法里超脱出来，看不到希望。大陆是家国一体，家国同构的。所有国家手段及政策都在家里看的到类似现像。家是国这身体的细胞，如不能解决 艾滋病病毒，癌细胞 ，身体又怎么可能好了。没要对长辈不好。但只有正视历史才能更好的提高效率。\n"
		},
		{
			"post_id": 12,
			"title": "中国社会一直存在两个中国，一个是属于文明进步开放的中国，一个是愚昧狂暴的中国，而我们一直追求的文明和开放，恐怕没有那么强大的力量。",
			"date_published": 1520217127.526,
			"body": "\n【霍老爷：春晚背后，一个日益割裂的中国社会】\n\n每年春晚都是无力吐槽的，节目的质量还在其次，最难忍受的是其中的三观。\n\n在春晚的舞台上，历来都是各种奇葩观点的大展示，歧视残疾人、嘲笑长相、嘲讽身材、随意突破交往界限、不尊重人权，这些在很多年轻人看来是不可思议的禁忌，今年在春晚上又多了一个种族歧视。\n\n不得不说的是，央视春晚已经是三观比较正确的一个舞台，山东卫视春晚直接祭出了“老婆比保姆便宜”的生意经。\n\n这种情况并不鲜见，去年春晚更是离谱，直接让小品演员传达出”女人必须生孩子，不生儿子不能要”这样的价值观，让舆论一片哗然，而在春晚上，奇葩的声音和举措一向不乏其人、其行，记得杨丽萍的侄女小彩旗吗？在这个据说是各族人民齐欢庆，全球华人共联欢的舞台，让这个小女孩转圈转了四个多小时，而当年的东北小品王，小品的主要笑点就是残疾人。\n\n我相信，没有一个文艺工作者和审查者试图通过这个舞台激怒大众，但是，一旦春晚进入公共视野，就总是出现这种奇葩。\n\n为什么？就是因为，在中国，这些极端、保守、封建的奇葩才是中国社会的主流，而我们所习惯的尊重、开明才是瑟缩在北上广深的少数派。\n\n02\n\n北 上 广\n\n尽管你在朋友圈中看到的都是满世界乱飞的朋友、独立自信的女性、阳光健康的小伙，但是，一到春节，一切都会被打回原形，春晚中的中国或许是更真实的中国。\n\n春节不光是过年回家，不光是来自京沪深的一到过年“Jame、Dave、Mary都变成了铁蛋、狗剩、翠花”这么简单，春晚舞台上的那些你无法接受的言论，也有远比你信奉自由、开放、尊重有更深厚的土壤。\n\n在中国，北上广才是异类，三线及以下城市和农村的价值观才是主流，而春晚其实正是在迎合这样的人群。\n\n你觉得春晚小品没有界限感，你在农村的老家里正被七大姑八大姨盘问收入、婚姻；\n\n你觉得春晚小品不尊重人权，你的屋子可以被任何人参观，甚至大年初一到一个你多年不见的长辈家拜年还要行跪拜之礼；\n\n你觉得春晚愚昧，你刷刷微博和朋友圈，你的朋友们正在转发一张图片，并告诉你，转发就可以保证父母平安；\n\n你觉得春晚小品喜欢歧视，你在同学会上正听着当年的班长不动声色地透露自己有钱，几个土豪同学正在攀比；\n\n你觉得春晚充斥空洞的说教和无聊的宣传，你的父母、你的长辈、你的上司，甚至随便一个路人，正试图纠正你的观点。\n\n春晚里的中国，才是中国社会最真实的样子，而大城市营造的价值观错觉只不过是这个庞大国家的一点小小的不同声音。\n\n中国是一个有着深远的农村社会历史的国家，我们这个国家的世界观、价值观，实际上是被农村塑造的，而不是城市。\n\n当年的毛泽东研究中国社会后就天才地判断出：农村才是中国社会的主流，从而提出“农村包围城市”的天才战略，2016年，中国的城市化率已经达到57.4%，从数字上看，城市人口已经占了上风，但是文化和精神层面，要远远滞后于城市化进程。\n\n一个人的三观，不是像他的收入和户籍一样，户口本加个字，就从农业人口变成了非农业人口，收入高一些，就可以在城市立足，人的观念的转变要慢得多，更多的人只是在延续自己出身的社会形态的观念和处事原则。\n\n而这些人，最擅长的，就是歧视女性、歧视穷人、歧视残疾、不尊重人权，不尊重隐私，而春节不过是这种观点的集中释放，他们创造的中国，其实一直如此。\n\n03\n\n网 络 即 现 实\n\n我有个朋友，是一个网红，她每年都讨厌回家过年，以前可以理解，回家半个月，基本等于断网半月，除了电视剩下的娱乐就是打牌打麻将，但是现在，家里照样有Wi-Fi，她还是不愿意回家。\n\n为啥呢？因为她同样要面对同乡的亲戚同学的三观轰炸，在北上广普遍都能接受的概念，在老家却是大逆不道。老家人的观念、审美、开明程度，都被甩开了几条街。\n\n我说这有什么忍受不了的，你平时不上微博、不上知乎、不逛微信群吗？但凡一个开放的网络平台，你都会碰到这样的人啊！她说，那不一样，那不是现实。\n\n我告诉她，那就是现实，那是远比你在真实社会中看到的现实远远真实的现实。在人的现实生活中，人们尚且还要带上面具，伪装一下自己，但在几乎不受到惩罚的网络，人们释放出了更真实的自我。\n\n而随着网络从PC端向智能手机端的转换，中国网民的主流已经悄然发生变化，在互联网进入中国之初，能够上网并有时间在中文社区灌水的网民普遍是受过教育，有一定文化的人群，而在今天，任何一个人拿起智能手机，就可以上网。\n\n也就是说，曾经中国的网络是一个乌托邦，但在今天，这种乌托邦属性再也不存在了。\n\n网络即现实，网络就是真实的中国。甚至说，网络是比现实更真实的中国，它比现实更能体现中国人的整体素质。\n\n而无论是网络巨头还是上层，中国社会的精英们，都选择纵容和谄媚，他们很清楚地知道，谁能赢得这些网民，谁就能赢得中国的未来，于是，中国网络的趣味日趋屌丝化、噪音化、水化，这就是中国网络不可逆转的现实。\n\n04\n\n主 流\n\n既然网络已经是现在最大的真实，那么网络不可避免地影响到现实。我们已经看到，“唐山教科书式老赖”、“江歌案”、“红黄蓝幼儿园”，网络已经开始最大程度地影响甚至改变现实，无论向好还是向坏，谁已经无法忽视这股力量。\n\n而大年初一的第一场网络事件，让我们看到了网络时代中国社会的割裂，一个叫热依扎因为在微博评论中说自己不过春节，因为她是少数民族（哈萨克族），立刻引来网友的围追堵截。\n\n这正是中国社会割裂的一个极端体现，从反极端，最终变成了极端反，没有人在乎真实，没有人在乎宽容，没有人在乎理性，它向我们展示了中国社会中暴戾、疯狂的一面，而一旦这种狂戾发展下去，反馈到现实中，又将是怎样的局面呢？\n\n中国社会一直存在两个中国，一个是属于文明进步开放的中国，一个是愚昧狂暴的中国，而我们一直追求的文明和开放，恐怕没有那么强大的力量。\n\n05\n\n保 守\n\n而中国社会向何处去，就取决于我们。前不久跟另一个作者谈起网络社会的问题，他是一个坚定的民族主义者，他说，我不能理解，怎么会有人反对我们的民族主义？\n\n我告诉他，不是说中国搞民族主义就不行，而是中国的民族主义的力量根源，就来自于底层最保守最野蛮最愚昧的那股力量，而那种力量一旦释放出来，是任何试图控制它的人都无法控制的。\n\n到时候，最民族主义的声音一定是最极端，最暴戾的声音，你喜欢民族主义只是叶公好龙罢了，你连春晚都忍受不了，怎么喜欢？\n\n我们在网络上争辩，讨论都是可以谈的，而一旦释放出那股力量，你只有被他们改变，不能谈判。"
		},
		{
			"post_id": 11,
			"title": "推荐泡泡网，一个极好的为民主力量提供民主思维技巧，及网络技术支持的网站，见内容链接",
			"date_published": 1520182084,
			"body": "https://pao-pao.net/articles\n\n主页所有文章翻墙工具箱\n\n这个时代真正的力量究竟是什么？已经有人找到了——为自由而战（五）\n\n威权政府深知如何通过阴谋论来强化自我，而人民的反抗程度，与对阴谋的了解程度成正比。信息能解放全人类，计算机科学已经帮助世人揭开了政治关系的面纱\n\n更多\n\n结束毫无意义的口水和拉锯战，这里是你应该知道的事——为自由而战（四）\n\n未来的世界里，力量不再属于枪杆子，而是来自于交流通讯，人不再需要通过一小群精英的认可来认识自己，而是在融入社交网络、充分挖掘巨大的政治潜能的过程中，认识自己。数字时代来了，新的游戏已经不再是石油管道的战争，而是信息管道的战争：控制海底和陆上的光纤电缆路径的战争。新的全球财富是控制连接整个大陆和各种文明的巨大数据流，连接数十亿人和组织的通信……\n\n更多\n\n全球新闻业都在倒退，民主正面临危机——怎么办？\n\n民主意味着人民可以监督权力、有清新的判断力和公民意识，这只有在人民清楚地知道政权干了什么时，它才是可能的。人民从哪里获得政权试图隐藏起来的信息？——媒体。媒体堕落必然导致民主的堕落，如果权力能控制媒体，再多的选票都是虚妄。办法是有的，需要每一位信息消费者共同努力，这里告诉你方法：\n\n更多\n\n为什么说当心不要被恶意愚蠢拉低智商？\n\n在中文舆论中，多年来一些态度很令人不安，“民运”被当作了贬义词，它表达了人们对整个异议群体之能力的质疑，原本应该是冲锋在前的“民主斗士”被讽为了“民逗”，我不想做动机分析，但一个明显的问题不容忽视，那就是，这一群体中大部分人技术能力的缺乏、焦虑的弥漫、以及被恶意愚蠢拉低的认知\n\n更多\n\nQ&A：为什么经历文革十年的那代人至今“执迷不悟”？\n\n在中国，如果没有抵制暴政的大规模社会运动，就不会有对遭受政治骚扰和迫害的PTSD患者的有效协助，如果没有对文革运动的深刻反省，文革经历者就很难接受到合理的协助，如果没有冲击父权制家长制传统的社会运动，对家暴和童年迫害受创者的抚慰不过是隔靴搔痒\n\n更多\n\n创建属于我们自己的国土；推荐非暴力直接行动的终极形式——为自由而战（三）\n\n未来世界最积极的方向就是自我认知、多样性和自决的网络，受过高等教育的全球人口是自由交流的产物，同时也刺激了新文化的成长，以及个人思想最大程度的多样化，同时能促进快速的联合，以及超越地理限制的价值交换，就像阿拉伯之春和泛阿拉伯运动中所展现的那样，那些运动就是通过互联网才成为可能的。而当下的趋势却是，这个世界正在滑向一种狭隘的、同质化的后现代极权主义体系，所有人的自由都在受到威胁。这种新型的跨国反乌托邦发展趋势尚未被大多数人所了解，它被隐藏在所谓机密、复杂性和更小的尺度里，互联网被当权者变成了前所未有的极权主义推进器，它已经开始威胁人类文明。\n\n是时候奋起而战了。\n\n更多\n\n大部分审查并非如你平日的吐槽对象那般显而易见——为自由而战（二）\n\n全球打击假新闻的努力看起来声嘶力竭，就算能圆满成功，也不过是皮毛之举，审查存在的地方就没有真相。而绝大多数审查是不被承认的，因为它们发生在暗处，也因此不存在对某个特定主张进行审查的指示。相反，是记者自己认识到了他们被期望如何去做，因为他们了解取悦和巴结某些人的利益所在……\n\n更多\n\n为自由而战（一）卧室里的坦克——被军事化的互联网人，以及可以怎么办\n\n过去，为斯塔西服务的人还能拿到金钱报酬，而如今，所有人在 Facebook 上刷活跃度，而这些人能获得的报酬只是虚无缥缈的所谓社会资本。自我保护意识薄弱的中国人更惨，他们为了获得更多的人脉资源拼命地全裸行军，把自己内心的独白、私人信息都放在共产党举目可见的范围内，他们认为不翻墙的时候 VPN 就是多余的，他们嫌弃加密通信里“没有红包”可抢，他们觉得自己“循规蹈矩”就能避祸免灾，一个“18岁”梗就能让大批的他们主动为监视数据库添砖加瓦……\n\n更多\n\n当权者为什么害怕比特币——中国投资者对比特币的认识过于狭隘\n\n基本建构实质上定义了政治局面。如果你有一个集中化的建构，即使由全球公认的好人来管理它，它照样会吸引混蛋，而那些混蛋会利用他们的权力去做那些设计者原本没想去做的事。更重要的是，你要知道这关系到金钱。在金钱面前，究竟能有几个“好人”？\n\n更多\n\n不知不觉中，你已经变成了别人——社交媒体如何改写了你的记忆\n\n社交媒体增强了人们寻求独立证据来证实自己记忆的能力，但显然，也很容易修改、歪曲你的记忆。每个人都会回想刚刚发生的事，会把最应该做的事记录下来，会过滤掉不喜欢的信息，高浸入性的数字媒体让你充分享受着宣泄的愉悦、与赞同者连接的兴奋，但是否应该停下来想想，为什么有些人会把沉浸你我的信息化时代，称之为“宣传盛世”？他们有可能就是最容易控制我们的人\n\n更多\n\n逃离中国\n\n“如果你离开自己的家，创造一个新的家庭，你不会把旧的扔掉，你尝试开始一种新的生活，一种不同的生活，在各个方面都要比曾经的生活更强。这是一种暗暗的比较，在此过程中，你的旧记忆会变得更加深刻” —— 一位德国人曾经这样说。\n\n更多\n\n“我是中国人，却为什么经常听不懂中国话？” 中文表达中存在的问题\n\n很多人发现与中国人沟通非常困难，不论你的中文水平有多高，也很难理解对方的真实意思。究竟是为什么呢？\n\n更多\n\n从“油腻中年”的讽刺说起——中国人对不平等问题有着特殊的反馈方式\n\n近日刷屏的“油腻”段子十分无聊，但其背后却隐藏着一个很大的社会问题……\n\n更多\n\n你知道为什么在网上写长文很吃亏吗？\n\n来做一个小测试，我能猜到你的内心。信不信？\n\n更多\n\n1/32 ›\n\n您可以通过GreatFire翻墙中心对比各个工具的平均速度，稳定性，甚至是查看您的所在地其他用户的连接情况。\n\nweibo twitter facebook feed\n\n下载泡泡安卓APP（点击/扫描）\n\nhttps://tr.im/hN4K9\n\nLink 2\n\n翻墙工具\n\nShadowVPN\n\nGranGorz\n\nYour Freedom\n\n倩影VPN网络加速器\n\nXX-Net\n\n搜索表单 搜索\n\n搜索\n\n镜像站点 （免翻墙）\n\n泡泡镜像#1 泡泡镜像#2\n\n热门文章\n\n监听你的不仅是手机\n\nGreatFire“解封”BBC中文网\n\n全球新闻业都在倒退，民主正面临危机——怎么办？\n\n特别专栏\n\n占中 台湾 审查 微博 新闻自由 社交媒体 网络安全 网络审查 网络监控 翻墙 隐私 香港\n\n更多\n\n联系\n\n提供新闻线索或者希望成为作者？\n\n请联系我们：\n\n电子邮件：info@pao-pao.net\n\nTwitter：@paopaonet\n\nFacebook：Paopaonetizen\n\nWeibo: Paopaonetizen\n\nQiwen\n\n© Pao-pao 2015\n\n泡泡镜像#1 泡泡镜像#2"
		},
		{
			"post_id": 10,
			"title": "怎样不被女极权主义侵害",
			"date_published": 1520181896,
			"body": "宣传让男性关注现在的女权乱象及对自身危害\n。\n婚姻法太偏向女性了，现在社会现实中太多偏向女人，反而让男的受到不公平对待。\n反向歧视男性 。很多工作男性不比女的差但只收女的。男人要承担远比女人多的多的所谓责任，而权益极少，到了女的手中。太多了。\n女的特会闹，在这个按闹分配，讲究经济，心理博弈，政治影响力的社会，男性在这方面像被洗脑了一样大多在回避。\n男的赚钱，女的花，还天天电视剧里做梦，我爱男保姆，几个极品男人抢个白莲花死去活来。男的看个电视小说都全是女权洗脑，玛丽苏类。现在男的成了房奴，车奴，养老四个，两大家子，孩子教育投入，医，，，各种问题基本男的在解决。可好多权益女的比男的大太多了。\n甚至政策偏向她们。想想王宝强。\n其它答案我看了下。说要用公众号上宠到女的28成垃圾的。我想说。\n28以后能增值是她们本事，28之前要是按你的方法，女的爽了，男的也要花远超正常的代价，28以后也会被垃圾女套住很多。\n现在情况是女的变坏就有钱，而男人不行。\n男性面对这种情况越来越多成了伪娘，同性恋，基友，妻管严，老婆奴，很多还生了独生女。之前的独生政策使得没有选择，女性的位出于女性能顶半边天需要，提高的极不合理，出现了组团去买个越南媳妇，乌克南美女的新闻，农村花十多万买个越南媳妇，还经常跑了，说明了男人有多难，网上男教授写长博和老婆撕逼。女明星和老公离婚撕逼，去查下吧。男人们醒醒吧。网络的兴起，连网上人是男是女都难分，知乎男权，女权信息量完全惨败，都被女权洗脑进男权标签了。\n"
		},
		{
			"post_id": 9,
			"title": "爱为何这矛盾，为什么道佛反爱。电视里爱是一切。 ",
			"date_published": 1520181827,
			"body": "\n爱为何这矛盾，为什么道佛反爱。电视里爱是一切。 \n\n此主题才开头，但相关的内容在本博客其它文章可见。\n道家讲究太上望情。\n佛家视爱为执念，若离于爱者，无忧亦无怖。\n儒家讲谦爱，其实就是都爱了，等于偏爱，还是求的不被感情用事。\n君子可以欺之以方，欺负老实。坏人招人爱，混的好。现实就这样。内省，自制力，讲公平的人极少。现在流行的是套现，有权不用过期作 废。应对方法就是要选择和警告对方，三黄牌一红牌，否则最多在分手时来句你是个好人，但不适合这个社会。人与人大多在心理 博弈。真以为全是因为爱?\n现在爱成了洗脑工具，遮羞布。\n"
		},
		{
			"post_id": 8,
			"title": "你共的手段是用恐懼，信息來讓人因種族，民族，階級，文化程度，貧富，地區這些差別來製造溝通不便，分化，對立，相互制約。 ",
			"date_published": 1520181620,
			"body": "\n\n\n你共的手段是用恐懼，信息來讓人因種族，民族，階級，文化程度，貧富，地區這些差別來製造溝通不便，分化，對立，相互制約。\n反抗的力量增大了，他們只需要調整分化政策，一紙文件一改，通過新的利益分配預期來分化，相互制約就夠了。\n到時加大名義上照顧老人，婦女，兒童，少數民族等所謂弱勢群體 的養老政策，婚姻法，冶安管理條例等。\n以換取他們支持中共。\n紅衛兵時期推出的婦女能頂半邊天，打土豪分田地，紅衛兵中的革命小將，之後文革過去了，可偏向政策一直沒改，在他們預期中很多人還想靠中共來保住這份不正當權益。\n了解大陸的都知道，絕大多數婦女，老人都是其中最沉默，最擁護你黨的。\n獨生子女政策和女人能頂半邊天，各種照顧婦女的政策下，她們現在是這樣的， 以後要是加大政策偏向了?老人也是這樣。\n我有過類似的其它文章。可以一起看下。對大陸實際現實接觸少的人看了這些可能還是難以相信會有此種手段在現在。但這才是你共最大的基礎。\n目前民運圈 極缺乏相關深入了解，充滿著一種只要罵共黨罵中國人就能罵出這些人的良心，勇敢，甘願犧牲，靈魂覺醒，從而有了希望。罵的什麼也不是，罵出不穩，恐慌，沒勁了，罵的經濟跨台，政局動亂就有了希望。\n卻連相應的應對策略都沒一個。甚至中共的手段也不深入了解，只概括為騙，恐懼，洗腦，言論審查。\n唉，以下是我剛在一篇 香港圈裡的回復一個只會無腦罵的人的話。\nLau Yuk Far 此篇表達的是中共前高層元老鄧小平也堅持的退休制。\n表達權力徹底失衡，連共黨自身都要被害。\n是可以用來說明這種倒退有多麼嚴重。\n甚至可以因這種倒退爭取更多力量。\n結果你連這個也罵了。\n說沒倒退，一直是假的，那共黨通過終身製就更容易了。\n這罵的都起到了雙重否定，成了肯定共黨終身製的正確性。\n這和奔馳廣告被罵事件何其相似，因不認同身份而連對的話也給否定。\n那你準備靠罵人洩憤還是罵人把共黨罵死?如果理論上能，我支持。別讓 憤怒沖昏頭腦，中共還要策反國民黨，還要蘇聯，國際，農民支持，千萬百計欺騙利用。利用到了更強的力量就成功了。\n可你們這些只知道罵的，已經罵走了很多能爭取的力量。這些力量只是在等好的時機，換你們來一樣。甚至更差。溫室中的花朵中怎麼這多只會罵人，連局勢都看不清，對方採用的方法不去了解，連個可行方案都拿不出。別一句騙就完了，即使是騙，也是包含了，地緣政治，以身份 ，種族來分化民眾的，製造 溝通困難，誤解，鼓動憤怒，對立來讓民眾團結不起來。彼此對立制約。你們更像是紅衛兵，無腦罵，罵的爽，批鬥，口上說是為了你們的口號，其實只是在表達站隊，立場。為了順應周圍的言論環境，以便讓自己被周圍人認同，從而保住自己的人脈，權與利。罵了別人傻好像自己就不傻了，罵了別人專制，好像自己就民主了，罵著欺騙就宣示著自己誠實沒騙過人。\n而這段時間從香港G+圈看到的都是這種不成熟的對立，不願溝通，溝通困難，還在為了用簡體字而罵人。香港這樣的佔多少?比例多那就希望都 沒了。台灣也有一定的這種只會罵的，我不清楚是不是專業五毛。但能判斷出相當多就是只會無腦罵的。\n現在專業五毛就有專們把人往這種對立方向引的，多少人中計了。\n很多人實際上行為言論達到的效果成了不拿錢的專業特種自乾五，卻還不自知。\n"
		},
		{
			"post_id": 7,
			"title": "言论审查和信息不对称下的乱像及应对",
			"date_published": 1520181539,
			"body": "外交部华春莹露面了。\n\n你共长期是神秘，未知，信息不对称下的攻心为上 。\n\n传未经证实的消息很有用。\n\n破解的方法只能是把未经证实的消息传广了，让他们来证明。\n\n最新消息她3.1露面了。。\n\nhttp://www.ntdtv.com/xtr/gb/2018/03/01/a1365623.html\n\n，，，，\n\n李爱莹:现在的人是怎么了，都跟郭文贵学会造谣有理，不要脸至上了。人家都已经在外交部的发言记者会上露面了，难道这还不是对谣言最有力的反击？还在那不要脸的自说自话，撸主目的可想而知\n\n+null 1，首先，各处都是说的未经证实的消息。这不能算造谣。更接近一种对她代表全国人民，国家说假话的不满的情绪发泄。\n\n2，就算是造谣也是\"君子冶人，以其人之道还冶其人之身\"\n\n未经证实的话说了如果就算造谣，那华春莹代表全国人民说着未经证实的话，她可没说她说的话未经证实，她造谣就可以?\n\n3，你公开信息一看，发的消息清一色专业五毛，你这网名谐音叫 \"你爱莹\"，真巧。\n\n4，你说她出面是对未经证实的反击。\n\n那她代表全国造遥那多，她还要反击猜测?我们连猜测都不行，她们想怎么造谣都可以，就因为她的官职，她就可以睁眼说瞎话，合法造谣?\n\n5，面对一帮利用信息不对称，自己说假话，还要代表全国说假话，还言论审核的人。不先把猜测传开，怎么让对方给出真实消息?\n\n名言 \"政治就是妥协的技术\"。\n\n你共是活的，股市，楼市，生孩子都可依法操控。测不准是正常的，体制内人事就更是相互妥协下就变了。\n\n，，，，\n\nflyer flyman +陈星 首先，狼来了这种事情，千万不要多做，本来是比较相信墙外的朋友，但这种事情做多了，自然就会产生怀疑。怀疑的不是别的，是朋友自身的判断能力。如果被认为自身没有判断能力，人云亦云，那朋友再发出来的信息，公信力自然就会减弱。其实这对您本身来说不是什么好事。\n\nflyer flyman 我不是首发是转发，并加了自己的分析过程，源消息链接出处，并没有肯定。我看出大家就是来发泄下的。好处坏处总是同时存在。\n如果没有好处就不说任何未经证实的话，注明猜测也不行，那又有什么事是绝对被证实的。科学也是从猜想开始，理论也大多数不是证实的。而物理定律也有被推翻的时候。适用范围。\n如果看消息的人连注明了未经证实的消息都要怪成造谣，那任何人在他心中都是骗子。情绪一爆发，谁都是骗子，不会相信的。\n如果人人都不敢发表注明了未经证实的言语，那翻墙出来也看不到什么，因为他们也保证不了所有消息确认无误，而看的人也不敢发表意见了。那和在墙里有什么区别，何必翻墙。\n言论审查的最大效果来源于对未知的恐惧，自我审查，面对信息不对称下的心理博弈，只有把未经证明的事注明来源并附上自己的分析转发，以发挥群体智慧，才是最佳应对策略。\n，，，，，，，，，\n\nhttps://mobile.twitter.com/freedom9134564/status/967444687530242049\n\n据谷歌搜索显示18年2月5号后新闻发言人换了，她没再出现过，最近几天推特(转推九百了)和youtube,上出现她被抓的消息，目前甚至没有有力点的反面言论，判断被抓的可能较大。"
		},
		{
			"post_id": 6,
			"title": "中国一切问题的根本，专制势力留下的文化思想漏洞",
			"date_published": 1524034781,
			"body": "\n[原文谷歌博客地址](http://wditsh.blogspot.com/2018/03/blog-post_4.html)\n\n\n\n一，作恶的成本太低，风险小甚至无，好处不小。这种现像由来已久，国内外都有，但国内严重的多，不是一个级别。\n\n\n\n卑鄙是卑鄙者的通行证，高尚是高尚者的墓志铭。\n\n杀人放火金腰带，修桥铺路无尸骨。\n\n古今中外都是有这种情况，区别在于机率。\n\n虽然很多人知道怎么应对，可是简单表述清楚，并推广，达成共识还远未达到。\n\n在大陆能解决这种现像的思想，\n\n也是潜规则中属不政治正确，全网要删的，极可能这样。\n\n希望大家一起探讨这些，并宣传。否则永远多数人不愿当好人，君子。\n\n大陆人是很不喜欢别人说自己是好人，君子的。\n\n好人卡，君子固穷矣。\n\n要么就多是伪君子。\n\n真君子行为反被人说是傻，书呆子。\n\n君子可以欺之以方。\n\n\n\n下面具体说形成原因及相关常见现象。\n\n1，文化，影视，小说中太放纵坏人了。\n\n影视，小说中好人活的艰验证困苦，流血又流泪，最后死了的多，好人血海深仇下战胜了邪恶的坏人，但原谅或只是轻罚了坏人。\n\n现实中就好人就更惨了。\n\n相关文章谢逊为什么不杀成昆？\n\n2，谁穷谁有理，谁弱就帮谁。政策法律上都偏向所谓的弱势群体，老，女，未成年，对其作恶太多不管。\n\n\n\n\n\n\n\n以传销为例。\n\n201804/老年人的发财梦\n\n 他们不是看不清，周围多的是人和他们说这是传销，劝他们不要做，关健是他们不在乎。\n\n只信自己。又愿意损人利已，只要成本少，风险小，收益有，他们就干。\n\n文革等运动过来的人，子女污告父母，夫妻互相污告，都正常。\n\n别说老人这样，\n\n很多传销团体中，，年轻人，有钱人也干这事。\n\n他们认为自己跑的快，害不到自己，损人利已他们不在乎。年龄越大，能力越低，阅读量越低，负担越重这机率越高。\n\n\n\n\n\n二，当一方以不讲规则达到十倍优势欺负另一方，另一方还在一昧的讲规则。\n\n\n\n\n\n当对方使用对规则的不遵守来达到竟争规则上面的优势时，这种优势常是倍数式的，难以用能力来补充。\n\n这种情况下对方如果不讲理，攻击，赖皮，流氓， 你总不能还只一个劲讲道理吧。\n\n可根据情况需要，比对方少量不讲规则，以让对方知道这样没用，还是讲道理的好 。\n\n中国儒家孔子学说，专制政权不喜欢的部分会不宣传，曲解。\n\n孔子可不是死守规则，不讲效果的。\n\n我的意思是对方采用更多不公平规则产生的优势时，这个时候如果还是死守规则，那么对方就会利用此不正当优势来打击对手。如果还不够就更不讲规则，直到成功。\n\n这是以道德来鼓励不道德。\n\n君子可以欺之以方。\n\n\n\n\n\n复仇文化都没了，人没了血性，最简单的\n\n博弈策略，对等报复的精神都没。\n\n\n\n\n\n\n\n三，民众太缺对政治力量和手段的了解，和回避政治，一想到政治就是丑恶，所以只知道去避免想政治，可政治是大格局，不是非要丛政才能用政治力量，就像三十六计可用于政治，经济，泡妞，政治应用面更大。战争都只是政治的延继。\n\n\n\n管别人家的事就是关心你家，别人来管他家的事，他就说这是家事不要管。\n\n在国际政治上也是如此，最后无赖立于不败之地。\n\n四，忽视经济学思维。\n\n几千年前就是士农工商，商排最下等。\n\n到现在懂理财的都极少，大量被骗的。\n\n\n\n五，法律制度极缺自下而上的制衡，\n\n大陆是大陆法系，不是按原则与精神来判案而是条例，法无禁止及可为，又有概然率的问题。\n\n就是大概率是这样就可以判了，如老人假装被车撞，目的是为了要钱。这种事经常上新闻，寒天下人心，无人敢扶老人了。\n\n\n\n六，无赖 控制引导舆论，对不利他们的言论就过度强调证据，对付他人就不需要那多证据了。\n\n\n\n\n\n另一方在信息不对称的情况下，追寻真相的成本太大了，近乎不可能。\n\n但几率是有用的，我也说了根据来据，另外他的行为实事上效果一样。心里在想什么证明不了，但效果长期一样 就可以提醒他的行为实际上已经是了，如不是改，如还不改，那和是没区别了。\n\n\n\n\n\n七，不重视发展或缺少科学精神，素养。\n\n逻辑推理，心理健康。\n\n1，关于逻辑与科学精神。\n\n阴阳，五行是什么鬼?只是个分类而以，便于人发散思维，可没有逻辑只是狗头不对马嘴。\n\n太强调证据，反成了推脱的借口。\n\n科学也是先有猜想，再有理论，实验数据支持，论证。即使定理也被后来证实有适用范围。一切有机率的，讲成本和收益，风险。\n\n值就够了。可现在，不想讲理时死要证据，\n\n对自己有利时，什么理都不想，回避。\n\n你和他讲科学，他和你谈道德，你谈道德占优了，他谈法律，当你又占优了，他又谈感情，人性，你又占优了，他就讲兽性。\n\n一个经典的笑话就是男女诱惑时，不是人与\n\n畜生不如。\n\n2，关于精神与心理健康\n\n\n\n\n\n长期在看似有选择其实没有选择的环境中，信息真假难辨，原则只有一个，欺软怕硬，强的说什么都顺着。骗子团体人多势众有组织，自己亲人只几个，受害者是零散的，给了收益预期和现实看的到的提成。\n\n他们当然干，他们懂他们是老人是弱势群体罚不责众，越卑劣越有竞争优势，活的越好，子女有钱是子女的事，只信自己，多骗点钱才是正理，这社会笑贫不笑娼。\n\n日本老人都有故意偷东西进监狱养老的，中国更是不关，不罚，他们时间不值钱，零成本，有业绩提成，无风险，当然干。\n\n这些思想成了几十年来的本能，一直是对的。\n\n长期在这种环境中人的思维能力下降，固化，因为过去一再表明，真假不重要，聪明没用。\n\n在这种环境下，脑袋顽固的很。老人这现像最严重，年纪越大越这样。\n\n长期在不想懂，懂了心理良心受不了，所以不想懂，懂了装不懂，装傻，最后装傻成了本能的生存技能，最后思维固化，装傻成了真傻了。\n\n并且现在中国法律和社会环境鼓励老人作恶。\n\n他们又怎么会愿意轻易醒来。\n\n这些传销的最上层组织者运用的手段已经成了模板。\n\n里面自带洗脑，制造心理漏洞，利用人的不安全感，人与人的代沟，让他们和亲人断开，不信任，用前景来制造心魔，心理漏洞。\n\n借此制造精神上易控制的类似于病态的人。\n\n香港有个电视剧叫(天才在左，疯子在右)\n\n里面讲的就是关于精神病的故事。\n\n男主角本不是精神病，可是由于太爱自己的老婆。\n\n被一个会催眠术，懂精神病原理的病人，\n\n利用男主角对爱人的执念，运用心理学和催眠，给变成了真的精神病。\n\n\n\n现实也有这现像，都用不着那麻烦。\n\n毕竟心理漏洞大的人已经很多了。\n\n\n\n\n\n如果中国大部分人能做好这些，已经是发达国家了。\n\n\n\n刚看文章有人说中国是因为基因才有这乱像。\n\n(基因这文章http://xqttx.blogspot.jp/2018/03/blog-post_8.html?m=1)\n\n\n\n用基因这个词不好，首先全球各国现在还有人表现的热爱中共。\n\n甚至宗教都妥协了七名主教。\n\n苹果进入中国也得交出用户隐私。\n\n难道说全球人有这基因?文化基因也不对。\n\n\n\n文化中缺少应对对方通过不正当竞时的反抗方法。\n\n所以越是没底线越活的好。\n\n这种情况下，极左，共产，专制，成必然。\n\n\n"
		},
		{
			"post_id": 5,
			"title": "安全手册",
			"date_published": 1520144812.571,
			"body": "1、电脑去除常驻后台的国产软件，肯定是脱离不了国产软件的，所以管好后台服务进程，我建议还是都去用sandboxie或者虚拟机运行国产软件。国产输入法一定不能用，国产软件内一定不要输入任何敏感信息。肯定是指望不了全切换到Linux的，注意Windows安全就好了。\n\n* * *\n\n2、开机时间之内常驻一个BT软件（开源的，不要用迅雷等任何国产软件做种），也可以用emule，选择一个英文资源（不是有字幕的，纯原版资源）做种，这个资源要选个近期热门的，所以这个资源最好一周换一次，或者半个月换一次，不然不会产生外网连接。换了新的种子可以删除之前的文件，不会占什么硬盘资源。\n\n3、开机时间内保持I2P开启，我让大家开启BT跟I2P是为了让数量变大，混淆他们。\n\n4、敏感内容不要存在国内网盘，云存储之中，任何带上传功能的软件都相当于把你的信息进行存储。\n\n5、手机比电脑更难控制，所以不要用手机输入任何东西，高手的话应该也不需要我教（移动设备都别操作敏感信息）。\n\n6、进行线下宣传的，任何设备都要开启飞行模式，关闭一切连接功能（蓝牙、WIFI、GPS、或者什么北斗定位），以防万一，可以选择直接关闭手机，不要到你所宣传的目的地才关闭，在到那里之前的10分钟甚至更长就要关闭。\n\n7、注册信息不要跟境内用的网络账户有任何关联（用户名、手机号、生日、QQ号、昵称、邮箱都别用），会显示的内容随便按几个字母最好。"
		},
		{
			"post_id": 4,
			"title": "2",
			"date_published": 1520144665.962,
			"body": "2"
		},
		{
			"post_id": 3,
			"title": "女人成了推动政策执行的手段，以女来绑架男人的意愿，智商，为此给了女性不正当的权利。",
			"date_published": 1520144603.359,
			"body": "女人成了推动政策执行的手段，以女来绑架男人的意愿，智商，为此给了女性不正当的权利。\n\n\n\n甲:\n\n在大男子主義思想嚴重者的眼中確實基本如此啦。\n\n你都沒搞清楚什麼是真正的大男子主義。那些大男子主義者，以為自己的專制可以讓自己賺了多大的便宜，卻沒發現其實自己是得不償失。\n\n\n\n我: 不是不懂，而是相比男人吃的亏，女人的乱相，大男子主义不算什么。我没劲在意这小节。大男子主义有他存在合理的条件范围，可是 现在条件环境变了太多了，共党政策的以女套男，用女的来推动自己的政策。大男子主义在以前，可没什么婚姻法，没离婚分一半。女人当时话语权小，现在全变了。查下王宝强的婚姻，你就知道大陆婚姻法现在成恶法了。\n\n\n\n+陈新 你在意吃的虧但不在意造成吃虧的原因（之一)？呵呵\n\n\n\n+陈新 夫妻共同財產有什麼問題呢？對男女雙方都是一樣效果的，有問題嗎？你看看那些發達國家的婚姻法吧。\n\n\n\n+Xingo Luo Xingo Luo 当然更在意原因，我也说了，这是共党用女人推动政策执行的手段，以女来绑架男人的意愿，智商，为此给了女性不正当的权利。国外女性的自强，独力精神，文化程度，工作能力远强于大陆女，这些都差这多，平分就不合理了，国外政党不用女的来绑架男人的意愿，国内会，国内，理财，房，车，教育，医，养老，人情，复杂的很，女人非要全管了，又管不好，男人只能认倒霉。收拾女人的烂摊子。\n\n婚姻法不是只有分一半这一点，还要看其它部分，和执法情况，中国这些极差。你用的繁体字可能不了解情况，你去查下中国明星相关的离婚新闻就懂些了，如王宝强。\n\n\n\n+陈新 那麼，你是想表達天朝的女人多麼爛天朝的男人多麼蠢嗎？如果是這樣，那幹嘛不怪自己蠢？都混成明星了還這麼蠢，不活該嘛。\n\n\n\n\n\n+Xingo Luo 问题在于政策变的太快，人们难以预料会是这种恶果，\n\n历史上，当资本家好，结果政策变了，\n\n知识份子批斗了，现在以为养儿防老，房在家在。民众的观念易被利用。\n\n三从四德，新版和旧版变化太大了。\n\n新旧三从四德\n\n\n\n2008-03-06 19:07阅读：28\n\n\n\n旧三从四德\n\n\n\n三从：未嫁从父 既嫁从夫 夫死从子\n\n\n\n四德：\n\n德：第一要紧的是品德，能正身立本\n\n容：相貌，出入要端庄稳重持礼，不要轻浮随便\n\n言：与人交谈要会随意附义，能理解别人所言，并知道自己\n\n该与不该言的语句\n\n工：治家之道，包括相夫教子，尊老爱幼，勤俭节约等生活\n\n方面的细节\n\n新三从四德\n\n三从：＊老婆出门要随从 ＊老婆命令要服从 ＊老婆错了要盲从 四德：＊老婆化妆要等得 ＊老婆生日要记得 ＊老婆花钱要舍得 ＊老婆打骂要忍得\n\n\n\n\n\n共党长期信息管制，给了老人和女人远超正当的网络和现实话语权，\n\n政策偏向女人和老人，老女人就 劝女儿要房，有车，有存款才结婚，老人又认为生的多，就有更多人交养老金，共党甚至也会立法要儿女孝顺，而一夫一妻制，加上结婚离婚都是偏向女的，很多女的动不动叫着要男的净身出户，电视里都这样，我妈就这样。这种情况下，女性大多都传染成这样了，最多结婚前表现好，男人没得选，都差不多。\n\n新闻，媒体控的严，我的中学政治课本里有写，要用好的 宣传来引导鼓励人，所以中国的媒体基本上都是报喜不报忧， 只说好的 大家得不到别人惨痛的经历教训，没有参考。\n\n 等真结了婚就已经掉进了陷阱。\n\n两大家子人的名义绑架很难 脱离开。\n\n还有孩子的感情在绑着。\n\n还有财产在里面绑着。\n\n关健是没得选，还有好多剩女非要找条件非常好的。\n\n男性还偏多一点， 没得选。\n\n  现在已经出来新闻说以后可能共党逼着生孩子，结婚。\n\n当政策和法律易鼓励人性的恶时，就易产生人性危机，信任危机，损人利已。这种大环境下，选择空间很小，聪明智慧只能少吃点亏，大多数吃大亏。\n\n關於中共使用女人和金融維穩的隱性政策猜想\n\n我是生長在大陸小城市的人，只是為了更多人看懂用了繁體字，不知道港台看簡體吃力嗎？\n\n\n\n+陈新 你的話簡單來說還是表達天朝的男人們是多麼蠢嘛。法律主要是由男人們制定的，但是卻用法律來挖個坑讓自己跳，結果還是活該嘛。🤣\n\n\n\n+Xingo Luo 法律是男人定的，但是却是共党定，那怕村官，也有新闻在村里睡别人妻子，登记结婚多个老婆和孩子的，他们不受法律限制，中国是党指导法。党领导一切，难受监管。不损自身利益，还方便党的政策执行，维稳，保住自己的权益当然会干。\n\n,,,,,,,,,\n\n中國大媽是政治家，戰略家，經濟家\n\n年輕女性是經濟家，男的是哲學家，經過多年的調教終於開始看透那些不願正視的陰暗\n\n。\n\n電視小說都受監管，現在連小說監管的都那噁心,,,,\n\n可電視為什麼現在這跪添女觀眾，男觀眾錢給的少？評論的少？要說這裡沒政策支持真難讓人信。\n\n我一直想不明白，除非有隱性政策力量加入\n\n，就像少數民族有特權樣，拉一派，拉的就是女性，否則八千萬黨員肯定不夠，拉一半女的才是，女人能頂半邊天的口號就是那樣來的，紅衛兵，江青，葉群的夫人政治都有跡可循。跳廣場舞的只有中國大媽，沒男的跳，她們相信集體多過親人。\n\n房地產剛需靠丈母娘結婚的剛需，\n\n男的當了車奴房奴，養四個老人，甚至兩個家族都要照顧。累死累活有什麼好，\n\n現在女的腦殘的男的老實點就動不動讓男的淨身出戶。難道是因為電視劇裡離婚男的基本淨身出戶嗎？\n\n\n\n不可能有完全的證據，但附合現實。\n\n我最怕的就是這個。男人對另一半的稱呼，在大陸常用領導來稱呼。\n\n女性也是最懂上面意思，最配合的，也認為現在地位的超高提升，明顯在這方面有這個潛在明面支持。\n\n\n\n实际上中国大妈都是编外党员。\n\n大男子主义是女人明着不喜，暗中愿意的。中国表现的多假的，只看谁傻被谁管，女人希望找有能力的男人依靠，可是更希望自己能掌控的男人。分化很重，各环境心性不同，造成有的男的专制，有的女的专制。如果女的娘家近，男的心眼少，老实就被妻管严的死去活来，麻木死。\n\n几千年前的(罗织经)第一句就是(阅人卷第一章  人之情多娇，世之俗多伪，岂可信呼!)\n\n现在中国女的整体上多半已经掌握了家里的经济，外交，行政大权，全世界都感受到了，中国大妈买黄金vs华尔街上新闻了，女人钱好赚，中国大妈进场投资是马上要大跌的信号。年轻女的钱不够花，德，才无，丑还牛气冲天的调教男人给钱。这是常态。车奴，房奴女人造的。女人是共党推动金融统制，金融维稳，政策的最大助推者，男人是傻才听话的?因为调教，政策有助女人争网络和现实话语权。用女人套男人，绑架男人的民意。从而使共党的计划顺利。这种手段从文化大革命，江青时到现在一直有。\n\n\n\n電視瑪麗蘇，白蓮花越來越嚴重了，不懂的百度搜。其實和綠茶婊，心機婊沒區別，電視成了給男人洗腦成女人奴的工具了。\n\n以最新電視劇（飄香劍雨）為例，相比古龍原著的真實黑暗面，這電視改的太和諧了，原著女主若壁身為妻子自願被天爭教主勾搭成姦，現在十二集中男主角願為妻斷手，真斷了，而爭天教教主變成了主角妻子若壁，現在影視全盯上女人對家中錢的主導地位了，各種無腦跪添女觀眾。男主個個成了愛奴，不為女的無腦死當不了男主，好評多為女觀眾。\n\n共黨和女人，小人，常用的是（道德經）裡的（弱者道之用，反者道之動）\n\n反智，反以前的規則，來獲得自身利益。\n\n貪官上位，就會讓能力差的上位，因為能力差的明白，如果上面的這貪官\n\n倒了，自己憑能力坐不穩，他們是最好的勾結對像。\n\n大陸49年以來一直這樣。\n\n攻擊知識份子，斗地主，有錢的，資本家，發動的都是紅衛兵，孩子，老人。現在的政策明裡暗裡偏向女的和老人太多了，多到極端不合理。\n\n房價高得益的是有房或地的老人，婚姻法得益的是女性，結婚男人付出太多，女的憑白得一半還不知足，離婚政策也偏向女的。\n\n中國出現了誰弱誰有理，誰窮該幫誰的邏輯。\n\n\n\n年青男的在這壓力下都越來越偏中性，同性戀和獨身主義，不婚主義，混日子，他們看不到多少希望，也因此沒什麼動力。\n\n\n\n"
		},
		{
			"post_id": 2,
			"title": "1",
			"date_published": 1520134998,
			"body": "1"
		}
	],
	"tag": [
		{
			"value": "真是的",
			"post_id": 21
		},
		{
			"value": "论理难题",
			"post_id": 16
		},
		{
			"value": "K",
			"post_id": 23
		},
		{
			"value": "论理漏洞",
			"post_id": 20
		},
		{
			"value": "信仰与信念漏洞",
			"post_id": 18
		},
		{
			"value": "政治漏洞",
			"post_id": 15
		},
		{
			"value": "舆论漏洞",
			"post_id": 17
		},
		{
			"value": "舆论漏洞",
			"post_id": 14
		},
		{
			"value": "论理漏洞",
			"post_id": 13
		},
		{
			"value": "论理漏洞",
			"post_id": 12
		},
		{
			"value": "好资源",
			"post_id": 11
		},
		{
			"value": "情爱漏洞",
			"post_id": 10
		},
		{
			"value": "情爱漏洞",
			"post_id": 9
		},
		{
			"value": "政治漏洞",
			"post_id": 8
		},
		{
			"value": "政治漏洞",
			"post_id": 7
		},
		{
			"value": "文化漏洞",
			"post_id": 6
		},
		{
			"value": "时事",
			"post_id": 36
		}
	]
}