{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "> [balancer73](#comment_24_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n> Никто не будет пилить сторонних провайдеров и использовать их у себя, пока их нельзя использовать в ключевых приложениях — ZeroTalk/ZeroMe.\nЧтобы использовать другой провайдер, его публичный ключ нужно внести в content.json, а .bit адрес в какой-то JS файл (ctrl+F \"zeroid.bit\" replace \"myauth.bit\"). Код \"ключевых приложений\" к этому вообще мало отношения имеет, это все к ядру. И вообще, вы читали как это работает? По ссылкам, что я давал раньше? Если бы читали, то по-моему таких заблуждений не возникало бы. Или вы про сами ресурсы? zerotalk.bit? Ох, ну тогда можно задаться вопросом, почему нельзя войти в ВК аккаунтом твиттера. У этих ресурсов один владелец вместе с zeroid.bit, так что он переиспользует собственную авторизацию, как ему удобно. Ваше право на своих сайтах делать как хотите.\n// Тот же vlad20012, забывший взять с собой ключик",
				"added": 1481018715
			},
			{
				"comment_id": 2,
				"body": "> [balancer73](#comment_24_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Не даёт авторизация никакого контроля. Ник от zerobit.id получается без всяких ограничений. Соответственно, любой юзер может получить сколько угодно ников и залить любые данные.\nАвторизация дает контроль \"теоретически\", как архитектурное решение. Вы можете запилить своего провейдера и сертификаты хоть по паспорту выдавать. Для входа на собственные сайты, естественно.",
				"added": 1481018985
			},
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_24_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ник от zerobit.id получается без всяких ограничений.\nКстати, любопытно конечно, но не совсем \"без всяких ограничений\". Как минимум это деанон - нужно отправить обычный HTTP запрос к ним на сервер, чтобы zeroid выдал сертификат. А если юзать bitmessage, то сертификат выдается с немного другим флагом, и на всех сайтах таким аккаунтам по дефолту выдается 15 Кб пространства вместо 30 =) Опять же, не стоит воспринимать это слишком серьезно, это просто демонстрация, как бы это в принципе могло работать. И флаг всем в руки сделать что-то лучше. У меня, например, были немалые успехи с созданием своего провайдера. К сожалению, я слишком конченый лентяй, чтобы его закончить. Но я ставил целью наоборот сделать все анально централизованным и завязать авторизацию на существующие соцсети (внешние, твиттер там, фейсбук).",
				"added": 1481020793
			}
		],
		"1_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": [
			{
				"comment_id": 3,
				"body": "Мне почему-то тоже такая идея приходила в голову. Видимо и правда актуально. Надо плагинчик забацать",
				"added": 1481019425
			},
			{
				"comment_id": 5,
				"body": "Только как без фрейма-то. Сайт не может работать без фрейма. Боковые панели повыпиливать можно, но не фрейм.",
				"added": 1481025125
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_26_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Статический сайт («R/O») может быть каким угодно. Хоть один index.html с «Hello world!»\n\nНо там... ZeroFrame API не только для постинга сообщений используется, но и для забора данных (запросы в БД, к примеру). Без фрейма только статичный index.html и будет работать. ZeroTalk не поднимется. Так что да ну на.",
				"added": 1481025542
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_27_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Для R/O-шлюза, о котором идёт речь, этого хватит. Смотрим за «честным» ZeroTalk/ZeroBlog и по его обновлению генерируем статическую версию сайта для раздачи через \nПрогонять JS на сервере, генерить статику? Слишком сложно.",
				"added": 1481026492
			}
		]
	},
	"comment_vote": {}
}