{
	"next_topic_id": 14,
	"topic": [
		{
			"topic_id": 1565403304,
			"title": "How do you get tor Always working?",
			"body": "When I enable Always, it can't connect to peers, can't get new content, can't publish/post, etc,...\n\nI tried meek/obfs4.  It didn't seem to do anything.  \n\n## How to identify IP\nWhen set to Available, your IP shows up on the first line next to rev4172\n\nhttp://127.0.0.1:43110/Stats\n\nOnly when you are using Tor Always is only correctly different from output of command line:\n\n```curl ifconfig.me```\n\n## Issue Status Tracking\nWhen I find a resolution, I'll update the title here and link to a solution in [this thread](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections) where I also have [diagnostics](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections#comment_4_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n) as well as [installation steps](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections#comment_3_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n).  ",
			"added": 1565403303
		},
		{
			"topic_id": 1565416035,
			"title": "Search ZeroTalk",
			"body": "Is there a way to search zerotalk?",
			"added": 1565416033
		},
		{
			"topic_id": 1565456974,
			"title": "Customizing ZeroTalk - Pinning/Sticking",
			"body": "I cloned ZT to create a forum for discussing ZeroNet Security, and want to make topics sticky.  Does anyone know how to pin?  \n\nI changed the admin to me, but that didn't seem to enable any features.  Not sure I did it right.  \n\nZN Sec:  http://127.0.0.1:43110/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/",
			"added": 1565456971
		},
		{
			"topic_id": 1565572492,
			"title": "Korean ZT Post - What is zeronet?",
			"body": "I was curious what other countries were saying about ZN, so translated this post below.  It is interesting that they are using mesh networks to connect.  \n\nEnglish translation via goggles...\n\n## [What is a zeronet? (Revised 2018-11-18)](http://127.0.0.1:43110/16J4mEgR5aqerfzGy2WctNV3onPQUgF2E5/?Topic:1521099018_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm/+2018+11+18)\n\nZeronet is a new network that will replace the functionality of the existing Internet.\n\nIn other words, people using zeronet can essentially enjoy the same or similar service as the existing internet within zeronet without paying for a subscription to an existing Internet provider or connecting to the Internet using public Wi-Fi. .\n\nOf course, you can only get new information by connecting to someone else's computer, whether by router or something. (An easy way is to connect to a zeronet peer over the Internet over an existing Internet line.)\n\nLogically, if you assume that multiple people are rotating around on a single computer without having to connect to anything, you can enjoy the same benefits as the traditional Internet.\n\nTo make it easier,\nThe war broke out. Kori Nuclear Power Plant exploded and destroyed all electrical facilities, Internet communication network and Daum Net and Naver headquarters data center. By the way, there's a person in a small town who has a router, runs a router with a photovoltaic generator, and distributes the router connection number to people.\nEach person charges their laptop or smartphone with a manual generator to access the router's Wi-Fi.\nOf course, because Internet facility was cut off, we cannot connect to Daum net or Naver.\nHowever, if each person has a zeronet installed on the PC or smart phone, anyone can hit http://127.0.0.1:43110/ in the browser address bar to talk to the zeronet and talk about the information as if they are connected to the next net or Naver. To share.\n\n(Download the zeronet installation file):\n\n    Windows version\n    Apple macOS\n    Linux Debian ARM\n    Linux 64-bit x86\n    Linux 32-bit x86\n\nWhen you go out of the router's support range and go home and your family's computers and smartphones are all connected, all of the other router's information is automatically updated on your device. You can also pick up a computer with stories, opinions, and information you shared with each other and go back to the router in the town so everyone can read the information and attach your own opinions.\n\n(Of course, you can also send and receive secret messages between individuals using zero mail.)",
			"added": 1565572488
		},
		{
			"topic_id": 1565671836,
			"title": "This video will answer all your political questions",
			"body": "# [Politics - The Idiot's Guide to Smart People](https://youtu.be/R72atCX4leY) \n(clearnet youtube)",
			"added": 1565671831
		},
		{
			"topic_id": 1565764347,
			"title": "Anyone try building an Angular site here?",
			"body": "Conceptually, it should work.  Yet, there can always be gotchas.  I'd like to try it and would appreciate any heads up.",
			"added": 1565764341
		},
		{
			"topic_id": 1565914749,
			"title": "Can you pin a topic (stickie)",
			"body": "",
			"added": 1565914742,
			"parent_topic_uri": "1565912878_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM"
		},
		{
			"topic_id": 1565914773,
			"title": "Groups/Subgroup?",
			"body": "test",
			"added": 1565914765,
			"parent_topic_uri": "1565912878_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM",
			"type": "group"
		},
		{
			"topic_id": 1565914795,
			"title": "Test topic of subgroups",
			"body": "",
			"added": 1565914786,
			"parent_topic_uri": "1565914773_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n"
		},
		{
			"topic_id": 1565976900,
			"title": "Created a ZeroTalk for Site Development",
			"body": "A place where we can focus on developing zites without the clutter.  Won't use up precious user space on main Zer0Talk.  \n\n[Zer0Talk Zite Dev](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Home)",
			"added": 1565976890
		},
		{
			"topic_id": 1565977255,
			"title": "Content Signing Failed - Content too large",
			"body": "Content too large 21682066B > 10485760B, aborting task...\n\nThis is an attempt to publish an Angular site, so don't really have control over size of files since they are generated by the framework for distribution (using `ng build --prod`).\n\nCan discuss in new [ZT Zite Dev](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3) under [this topic](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1565976496_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/Content+Signing+Failed+Content+too+large).",
			"added": 1565977244
		},
		{
			"topic_id": 1566424575,
			"title": "ZeroNet Decentralized Development Roadmap",
			"body": "To save limited user space in this ZeroTalk, I created \n\n___\n## [ZeroNet Decentralized Development Roadmap](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ZeroNet+Decentralized+Development+Roadmap)\n\nIn the [UNLIMIT TALK](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ZeroNet+Decentralized+Development+Roadmap) site.  Please go there and click the \"Follow in Newsfeed\" link at the top right so you see posts in your Hello feed.  \n\nOf course, feel free to contribute to the discussion.  This is your chance to help shape the future of ZeroNet!",
			"added": 1566424563
		},
		{
			"topic_id": 1566491557,
			"title": "USE CASE: Partially funded proposal refunded",
			"body": "Sally wants to create a better default email site for ZeroNet. \n\n[read more...](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n#comment_4_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n) (on UNLIMIT TALK)",
			"added": 1566491544
		}
	],
	"topic_vote": {
		"1565716215_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": 1,
		"1565768730_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad": 1,
		"1566479582_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1562911609_1ByEFvdTMnxu7oCEKWA46ZuGVBjPXvigL1": 1
	},
	"next_comment_id": 165,
	"comment": {
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 1,
				"body": "freedom lives",
				"added": 1565404483
			},
			{
				"comment_id": 13,
				"body": "i just love that we have a space to hangout and be productive w/o Google, Twitter and Facebook breathing down our backs, with the chill they send with censorship, and the endless spying they do to monetize us.  I don't mind it here and there.  But, it is nice to be able to take a break from their tenacles and see what we can do w/o them, what great things people can build without depending on them to control how we do it.",
				"added": 1565411426
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 93,
				"body": "> [nickwa](#comment_359_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): This. It works perfectly fine on my ZeroTalk clone. Should be possible here.\n\nAdded to [my ZN Sec ZT](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB), but Kiffie ID grey.  Fix?",
				"added": 1565753020
			},
			{
				"comment_id": 94,
				"body": "> [nickwa](#comment_360_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Create another file in data/users/ and name it content2.json. Copy all the content.json stuff into content2.json. Drag the 0 to the left on the top right. Click choose: data/users/content.json. Change the content.json to content2.json. Publish. Just know, it still pushes it to the original content.json file for everyone. If it dosent work the first time, try content3.json after. It usually works. [...]\n\nlol that sounds like a workaround to a bug.  I'll try it.  \n\nthen order?  lol  that code definitely needs eyes.",
				"added": 1565754437
			},
			{
				"comment_id": 95,
				"body": "> [nickwa](#comment_361_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Yeah. I said it before ...\n\nDo you work on the Py code?",
				"added": 1565754624
			},
			{
				"comment_id": 96,
				"body": "> [nickwa](#comment_362_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): \n\nNo dice on 2 or 3.  No biggie.  I'll wait for now.  Thanks for your help!",
				"added": 1565755219
			}
		],
		"1565403304_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 3,
				"body": "This displays on first line the IP you are displaying:\n\nhttp://127.0.0.1:43110/Stats\n\nOnly when I set Tor to Always does it show a \"random\" IP.  Otherwise, it shows my IP.  \n\nBut when Tor is Always, nothing works, except viewing cached content.  It can't talk to trackers/peers and thus can't get new content or publish.\n\nUse a clearnet browser and search for \"what is my IP\" to view your current public IP w/o Tor.  ",
				"added": 1565405851
			},
			{
				"comment_id": 4,
				"body": "> [ayylmaolol](#comment_5_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): Are you on Windows or on Linux?On windows it ships with an tor instance and it should work out of the box.On Linux you have to setup your own Tor or use the Tor Browser instance by settingtor_controller = 127.0.0.1:9151tor_proxy = 127.0.0.1:9150in zeronet.conf\n\nI'm on Linux running Tor as an independently installed service (via package manager) as well as using the Tor browser.  I know ZN is talking to the service because if the service isn't running, ZN hows an error in it's start logs.  ZN shows that it is available when it is running.  So, it's using ports 9151/9150, the default ports, even w/o those entries in zeronet.conf.",
				"added": 1565406057
			},
			{
				"comment_id": 10,
				"body": "One thing I've observed, is if I put \n\ntor_controller = 127.0.0.1:9151\ntor_proxy = 127.0.0.1:9150\n\nin zeronet.conf\n\nit shows as Available w/o tor service running.  but, without those lines, it disables Tor on ZN startup, unless I have the service running.  \n\nTo put it different, if you don't have a Tor service running OR do not includes those lines, you'll see this at ZN startup:\n\nTorManager Disabling Tor, because error while accessing Tor proxy at port 127.0.0.1:9050: No connection \n\nThis does nothing to address original question.  Still can't publish, dl new content, or have an IP not mine in /Stats when Tor Always.",
				"added": 1565408009
			},
			{
				"comment_id": 12,
				"body": "The post from nickwa helped me get a lot more successful trackers (26/49 from 3/12):\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565407828_1ApEqpmoN3SPA4Ja4Fh5YRdatk6gRrda7N/0+trackers+all+day\n\nbut connections is showing 0 of 3332 peers and Onion: 2190 peers (0 connections).",
				"added": 1565409717
			},
			{
				"comment_id": 14,
				"body": "> [fuhrer](#comment_2_17FPf2gMpv4fcnV5dRnKqj56JVagtkGNSF): Makes sense.\n> [pseudonymity](#comment_1_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM): Just to but in, It is very common for users that use \"Always TOR\" to lose connection to the trackers. Can't find anyone who has explained why yet, but my guess is that the TOR network may be blocking the BitTorrent activity, shutting you out of the network. [...]\n\nAfter updating my tracker list, it appears as though I can get about 26/49 to work.  But, what doesn't work ever is connections to peers, 0 of 6000+.  Why would no peers be accessible?",
				"added": 1565411841
			},
			{
				"comment_id": 16,
				"body": "> [pseudonymity](#comment_2_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM): Well, It may be down to timeing out. I mean, My ping to peers is 3240ms ave over Always Tor. I have a VPN, So, Im just realy testing it out to see how it works.  [...]\nDefinitely need something new.  I'll look at Tribbler.  Someone mentioned I2P, but the concern of someone who replied to I2P idea was sybil attacks.  The more decentralized you become, the more you have to concern yourself with sybil attacks and perhaps other vectors.\n\nBut since I'm viewing this all as very early incubator and exploration, I'd say anything is worth a try and would be happy to test.  And, we definitely need a better solution than just using Tor.  One could perhaps combine methods to increase security and availability. \n\nIt is easy to ignore potential attack vectors until they become used.",
				"added": 1565415870
			},
			{
				"comment_id": 23,
				"body": "> [caryoscelus](#comment_185_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Did you check whether clearnet and/or .onion sites work if you connect through system tor instance?\n\nThat's a good question.  I can say I have no problem with clearnet or onion with the Tor browser, which doesn't need the system service running.  but, as for the system service, one test I have is\n\n```echo 'PROTOCOLINFO' | nc 127.0.0.1 9051```\n\nand it returns\n\n```\n250-PROTOCOLINFO 1\n250-AUTH METHODS=COOKIE,SAFECOOKIE COOKIEFILE=\"/run/tor/control.authcookie\"\n250-VERSION Tor=\"0.3.4.8\"\n250 OK```\n\nIf I stop the service, that test returns:\n\n```Ncat: Connection refused.```\n\nand, when I start zn w/o the service running, it outputs this:\n\n```TorManager Disabling Tor, because error while accessing Tor proxy at port 127.0.0.1:9050: No connection```\n\nand the UI displays Tor ERROR instead of Tor Available.  \n\n```torify curl ifconfig.me 2>/dev/null```\n\ndoes return a \"random\" IP address that is not the same as my IP returned by\n\n```curl ifconfig.me```\n\nDo you have a command line option for testing onion sites?\n",
				"added": 1565474426
			},
			{
				"comment_id": 42,
				"body": "> [542vg3](#comment_9_1Fi6FbNTzE6kZNEbR23FzcndyJh3RE9Nhx): did you figure it out? I had to install tor through APT and edit some parameters in /etc/tor/torrc, then install the browser\n\nno, still not working for me.  i also installed through package manager.  but you can get it to use browser by launching with params:\n\npython3 zeronet.py  --tor_proxy 127.0.0.1:9150 --tor_controller 127.0.0.1:9151\n\nor you can put those params in zeronet.conf.  but, doesn't matter. whether you get Available to work with browser or using service, Tor Always still doesn't work.\n\nDid you get Tor Always working?  Did you test IP to ensure /Stats and ```curl ifconfig.me``` show different IPs?",
				"added": 1565506953
			},
			{
				"comment_id": 43,
				"body": "> [xcape2net](#comment_265_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The whole thing is very confusing.  I had the impression previously, because that's what I was told by someone on ZeroNet, that if you are using the TOR browser, your IP address is hidden.  Having to take the additional step of setting TOR Always doesn't make sense to me.  One would think if you are connecting to a peer who isn't using TOR, your IP address would be hidden just as it is when you connect to any clearnet website.\n\nThis is true of clearnet sites you browse in Tor browser.  It is not necessarily true of what the ZN app is doing outside it.  You are not using Tor when you access 127..0.0.1, and at that point, you have to hope that ZN is using it correctly.  > [ssdifnskdjfnsdjk](#comment_897_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think that you do not need to care much about this. What is important is if on ZeroHello you can see \"Tor: always\" or \"Tor: available\" - that i assume means Zeronet can and will (if there is no bug in the ZN code) use Tor. [...]\n\n> [ssdifnskdjfnsdjk](#comment_897_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think that you do not need to care much about this. What is important is if on ZeroHello you can see \"Tor: always\" or \"Tor: available\" - that i assume means Zeronet can and will (if there is no bug in the ZN code) use Tor. [...]\n\nI choose to care until I understand how all the traffic is flowing.  Thank you for the link to what nofish said.  I'll try to ask him for more detail.",
				"added": 1565542863
			},
			{
				"comment_id": 46,
				"body": "> [ssdifnskdjfnsdjk](#comment_899_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): So did Tor: always started working? If yes, please post what helped. If not, please post errors from zeronet/log/debug.log and your /var/log/tor* (in case you are under Linux) and why do you think it is not working. I am asking because i think this thread should end with your comment where you describe how you have solved the issue you asked in your first post. Or at least if there is any (even not optimal) workaround. So future people can quickly find something helpful.\n\nIf I find a solution, I'll post and change topic to included RESOLVED, believe me.  I\"m doing a complete security audit of ZN communications, including Tor integration.  So plan to get into the code, if needed.",
				"added": 1565563339
			},
			{
				"comment_id": 65,
				"body": "Put [diagnostics](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections#comment_4_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n) as well as [installation steps](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections#comment_3_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n) used in [this tracking thread](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections)",
				"added": 1565642869
			}
		],
		"1565407828_1ApEqpmoN3SPA4Ja4Fh5YRdatk6gRrda7N": [
			{
				"comment_id": 11,
				"body": "sometimes it shows 3/12 trackers working, but doesn't help.  can't DL or publish.",
				"added": 1565408333
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 15,
				"body": "Take a look at how Bisq has a unique decentralized governance model.  They created the DAO token where all owners of that own Bisq by being able to vote for new features. It is then used to pay contributors.  So, if someone translates into another language, they can submit a request to be paid for it.  If voted, they get DAO as payment.  \n\nIn the ideal state, everyone would own ZN, and anyone can contribute to it, and be rewarded for it.  I noticed that nofish already let's people vote for features with BTC.  That concept could continue under this model, except they'd use a ZN token.    \n\nhttps://bisq.network/dao/",
				"added": 1565414834
			},
			{
				"comment_id": 17,
				"body": "Regarding GITHUB AND DISTRIBUTION (updates) it makes sense to mirror it at github and within ZN (Git Center), as both have pros and cons, github being more accessible today, and ZN being decentralized and resilient.  If a user can choose where to update it from, that would be a plus, too.  \n\nIf they are mirrored, I like the idea of changes originating inside ZN, then replicating to github, because this gives a contributor the option of not engaging in github.  I'm not sure how you handle that via github user credits, though.",
				"added": 1565420698
			},
			{
				"comment_id": 18,
				"body": "Regarding GOVERNANCE over the core code, architecture, direction, etc,...  \n\nThere are other compelling reasons to pursue an improved model here:\n\n- Increasing incentive to contribute.\n- Increasing user commitment and base through increased stakeholder participation (e.g, voting, ownership).  The \"user\" here is a broad range of contributors to the value of the ecosystem, including, but not limited to\n  1. site creators - creating consumable services and content that draws in consumers\n  2. consumers - the end-users give site creators incentive to build, increase replication of content, promote through word-of-mouth, clearnet, and other means.  \n\nIf core developers are incentivized, it can open the doors to broader possibilities for where ZN can be in 1 to 5 years, and broaden the range of potential site creators and consumers.  \n\nDue to these synergies, it is in all stakeholders' interest, including nofish, to remove the friction for new contributors to join, and incentivizing them with rewards.  This is why we can aspire to build a new decentralized governance model for core and other contributors.",
				"added": 1565421864
			},
			{
				"comment_id": 139,
				"body": "There are really two separate issues here:\n- [bootstrapping zites](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:zeronet-default-apps) (ZeroHello)\n- ZeroNet core\n\nThis is a chicken and egg.  But, we should talk about the bootstrapping zites separately, because until we have a better more decentralized ZeroHello, changing ownership isn't likely to help.  \n\nI can't speak for 0fish, but based on what he's created so far, I suspect if we created a better ZeroHello, he'd be more than happy to use it in bootstrapping the home page.",
				"added": 1566188382
			}
		],
		"1565420698_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 19,
				"body": "> [capitanjack](#comment_7_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk): It is implemented on some cloud drives. They scan users folder for files hashs and that way can found out if someone used to have cp etc. So yea there also must be big databases with hash list done of those images.\n\nThat appending of new hashes today begins with a process of \"trusted\" humans identifying the images then submitting it through a trusted and controlled process.  That becomes very difficult to distribute in a p2p world because w/o that central trust and control, you open the door to DOS attacks.  e.g., a bad actor could scan all images of a target site and submit the hashes even though none may belong in the category.  \n\nIt certainly does make sense to use an existing database that is reputable and trustable and use it.  But, the longer term risk there is introducing a model for censorship that can potentially become broader than the category you were interested in blocking (e.g., blocking political expression).",
				"added": 1565424053
			}
		],
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 20,
				"body": "Can you explain how to create a private repo and how it works?  How does it ensure no one other than those you give permission can view it?",
				"added": 1565457447
			}
		],
		"1565456974_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 21,
				"body": "> [anglosaxon](#comment_2_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n): Please let us know if you find the answer to your question. I too would like to modify ZeroTalk for custom, but suspecting we may have to modify source.\n\nI was able to modify it some.  You just have to find the site in your data folder and modify content.json and index.html.  Then, in UI, it prompts me to sign and publish.  So, the mechanics is easy.  I just don't know what i need to do to make topics sticky.",
				"added": 1565463823
			},
			{
				"comment_id": 22,
				"body": "> [everybody](#comment_37_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW): To Sticky a topic you must change in content.json file.You'll find in the admin sector:\"...\" : {  \"admin\": ....  \"sticky\": [\"....\",\"....\"],} [...]\n\nTYVM  @everybody.  ",
				"added": 1565464946
			}
		],
		"1565480657_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 25,
				"body": "Let me know when you find a solution.  It used to work for you?  \n\nI've been [going crazy trying to find a solution](http://127.0.0.1:43110/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections).",
				"added": 1565481219
			},
			{
				"comment_id": 26,
				"body": "> [nickwa](#comment_308_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Nvm, works now.\n\nWhat changed?  You on windows or linux?",
				"added": 1565481341
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 27,
				"body": "> [edgelordofdecent](#comment_13_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Could have been any politician involved but my bets are on Clintons.\n\nhahaha",
				"added": 1565481684
			},
			{
				"comment_id": 41,
				"body": "the correction officers forgot to throw in the rope",
				"added": 1565506622
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 28,
				"body": "> [xcape2net](#comment_260_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I found the solution to my problem of having to reboot ZeroNet for TOR always mode to work.  Just start the TOR browser before starting ZeroNet.  See here: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj\n\nThat doesn't work for me.",
				"added": 1565481803
			}
		],
		"1565484642_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT": [
			{
				"comment_id": 29,
				"body": "i've been looking for the Donut Dunking Manifesto, but can't find it.",
				"added": 1565485619
			},
			{
				"comment_id": 30,
				"body": "I've been thinking about creating a Procratinator's Manifesto, but just haven't gotten around to it.",
				"added": 1565490410
			},
			{
				"comment_id": 38,
				"body": "> [manifesto](#comment_14_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT): Hang a website with a free Manifesto writing template...\n\nlol I did that already, but forgot where I created it.  I can repeat here.  :)",
				"added": 1565496615
			}
		],
		"1565492359_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 31,
				"body": "i turn the world upside down every 12 hours.",
				"added": 1565494445
			},
			{
				"comment_id": 39,
				"body": "@h3bhkj5gqz4n3pjm have you ever been to a public school?",
				"added": 1565497004
			}
		],
		"1565449551_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 32,
				"body": "What the OP of the first question meant to say was \"How do I get a girlfriend ... who isn't cruel, confusing and a cheat?\"",
				"added": 1565494988
			},
			{
				"comment_id": 37,
				"body": "The first question, \"How do I get a girlfriend\" is for those without a girlfriend.  The second question, \"Why does God punish us?\", is for those who do have a girlfriend.",
				"added": 1565496454
			}
		],
		"1565495084_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 33,
				"body": "But you were able to publish here?  It's been all or nothing for me.",
				"added": 1565495160
			},
			{
				"comment_id": 34,
				"body": "> [nickwa](#comment_309_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): I can publish everywhere else but one specific site for updating the content.json to peers\n\nAre you publishing via the UI or CL?",
				"added": 1565495285
			},
			{
				"comment_id": 35,
				"body": "> [nickwa](#comment_310_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Via the UI by dragging the 0.\n\nNot sure what dragging the 0 means.  But, what I do after changing content.json is refresh the site in the browser, then I get a button to Sign and Publish.",
				"added": 1565495442
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 36,
				"body": "Is this the alter question to the other post \"How do I get a girlfriend?\"...   a thread for those who have a girlfriend?",
				"added": 1565496349
			}
		],
		"1565505415_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 40,
				"body": "> [nowotny](#comment_12_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw): What're you referring to?\n\ncongress",
				"added": 1565506508
			}
		],
		"1520915070_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 44,
				"body": "> [nofish](#comment_1140_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Tor: Available (default) mode: Allows you to connect .onion peers using the Tor network, but using clearnet connection for clearnet peers. If you don't have an external, opened port, then the other users will able to connect to you using the Tor network. (it sets up a .onion hidden service for you in that case)Tor: Always mode: Hides your ip address, every connection running on Tor network.\n\nCan you detail all the types of connections can occur from the moment you access 127.0.0.43110 in a Tor browser in Available mode based on the external use cases.  I know there are trackers and peers.  I don't know what \"users\" are or why they would connect to me in ZN.  \n\nIf I understand you correctly, if you want peers to only see your Tor address, you need Always mode enabled?  \n\nCan you please review our discussion in [this thread discussing issues getting Always mode to work](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565403304_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/How+do+you+get+tor+Always+working) if you have time?  \n\nThank you, btw, for your contributions toward ZN.  I LOVE IT!",
				"added": 1565543123
			}
		],
		"1565523603_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 45,
				"body": "there are eternal prizes and there are prizes that vanish quicker than the vapor in the air.",
				"added": 1565559089
			}
		],
		"1565562243_1LqBmfU8v7MjQWdX8veLtbXuqmDvACw4vM": [
			{
				"comment_id": 47,
				"body": "Upgrade AOL",
				"added": 1565570314
			}
		],
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 48,
				"body": "They were just about to step out ... then they heard your post.",
				"added": 1565570368
			}
		],
		"1565570944_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [],
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 51,
				"body": "I wish I could read the Chinese ZeroTalk.  Would be interesting if protesters are posting live or organizing here.",
				"added": 1565572031
			},
			{
				"comment_id": 68,
				"body": "I've love to see English translations of postings from those that are there now.",
				"added": 1565645989
			}
		],
		"1565572492_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 52,
				"body": "> [memesadler](#comment_28_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I'm not sure why they imply ZeroNet can work without an ISP. Is there some magic I'm not aware of? Or is this specific Korean ISP stuff or just Google Translate stuff?\n\nIt's my guess they were saying that if you have wifi, you can mesh onto Internet and get to this, whereas I'm guessing the Internet is otherwise very limited with wifi only.  In other words, it's an alt-web accessible via wifi and mesh (with someone having an Internet router somewhere).\n\nThey could be meshing onto a satellite internet router with limits.  ",
				"added": 1565572844
			},
			{
				"comment_id": 54,
				"body": "> [styromaniac](#comment_951_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): An internet connection isn't absolutely necessary.\n\nMy head's going crazy with possible use cases.  But, I'd love to see documentation of a mesh-only ZN configuration.  IF that is what they are describing, then the \"router\" is probably a mesh router, which I've seen sold for remote uses (primarily to help connect mesh peers over greater distance, not necessarily the same stuff they sell here to connect to primary Internet).  \n\nThen, what happens if you get that working AND introduce Internet gateways that only a small portion of the clients connect to.  The topology would be a subnet merging onto a greater net through a pipe.  \n\nThis could provide a lot of value for remote mesh networks.",
				"added": 1565574203
			},
			{
				"comment_id": 55,
				"body": "> [memesadler](#comment_30_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Yeah. I'm actually surprised this isn't a more spotlighted selling point. Trying to find documentation on this to understand its limits, but clearnet doesn't feel like it has a lot of the juicy stuff when I search around.\n\nI'm in that direction in my research.  Doing audit of ZN communication.  Separately, been researching mesh networks on mobile.  Now I realize they are a marriage made in zeronet.",
				"added": 1565574782
			},
			{
				"comment_id": 56,
				"body": "> [kaffie](#comment_998_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): ZeroNet can work without a traditional internet connection. It can work entirely over lan w/ zeroconf, and if you pair it up with mesh networking software like zeronet or yggdrasil, you can have a mesh network+zeronet setup without any traditional internet. So the use case provided (a single router with everyone connected to it) will indeed work and zeronet will function. And as mentioned, when connecting back to the traditional internet, it will snc accordingly. [...]\n\nIs there documentation on how to configure ZN for an offline mesh?  The issue is bootstrapping, discovery and trackers.  If you read the Japanese one, they are not very happy about the discovery process of ZN.  \n\nIn a pure offline mesh, you may need some sort of gossip/DHT for peers to find each other on bootup.    \n\nBy offline mesh, it means peers of the mesh (not ZN yet) find each other and connect.  There is no DHCP or typical router functions.  You do not need a router.  Routers in that typically act as \"boosters\", as they often have higher power transmissions than a cell phone.  But, otherwise, they are primarily acting as peers themselves.  \n\nSo Bob and Alice can connect their cell phones or computers w/o a router via Wifi Direct.  John and Sally may connect, but be too far for Bob and Alice.  Throw a \"router\" in the middle, and now the 4 of them can connect to each other because the distance is gapped.",
				"added": 1565575413
			},
			{
				"comment_id": 59,
				"body": "> [styromaniac](#comment_952_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Have two devices connected to the same LAN without WAN and access something like a 4K video to see the high speed transfer. That's it. [...]\n\nThe same LAN is not pure mesh.  That typically implies they used DHCP (router) or predefined static IPs.  Would need to not connect to a router and only use Wifi Direct to mesh two nodes.  I'm not sure what happens in the IP world there.  Haven't gotten that low level with my mesh experiments, yet.\n\nEDIT: quickly looked up how Wifi Direct handles IP assignment...\n\nOK, maybe WifiDirect is also an oversimplification, because with it, at least one client becomes the \"master\".  So, in a two device connection, the client is getting the IP via the master.  A master can be chosen through an election process I believe.  \n\nBut, this still doesn't explain how mesh networks get built with 1000 devices across 100 sq miles, because you'll have many tiny subnets in there.  No way to have one master.  \n\nSome of these mesh networks use bluetooth, but I'm discounting that cuz the distance sucks.  But, if you have power limitations (limited solar), you may have a combo of BLE and Wifi in your mesh. ",
				"added": 1565576147
			},
			{
				"comment_id": 61,
				"body": "> [kaffie](#comment_1001_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Yes. It'll work by default over lans. If that isn't enough you can enable the bootstrapper plugin as well. It has support for both IPv4 and IPv6 and has been tested to work on mesh networking software like cjdns and yggdrasil. I've got a tutorial on my blog on how to set up cjdns on mac with zeronet. Very simple. Yggdrasil works similarly. [...]\n\nThanks for the article.  So I could find it again, I added an Articles section under [your profile in New Wiki](http://127.0.0.1:43110/1LX2wiouHctuUXtu5WkVM9TJJ3YoL6gAfm/?Page:kaffie) lol.  \n\nI have a lot to learn about mesh networks, but the primary use case I have in mind is the one the Red Cross uses in remote areas.  I couldn't find their Android app recently, though.  Most clients are on mobile.  They have repeaters, but like I said, they simply act as transmission boosters, and they too are peers.  They put them on poles with solar.  They only need them to bridge distance and quickly throw up a more reliable network.  The phones can connect to each other without them.  I have no idea how they work at the networking layer.",
				"added": 1565578716
			}
		],
		"1565571217_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 53,
				"body": "That's top secret.  But I can say over 500.",
				"added": 1565573164
			}
		],
		"1565575614_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 58,
				"body": "You can view the code for any site here (best to Clone so you can play).  Then you can see the magic that happens when you click the Submit comment button.",
				"added": 1565575919
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 62,
				"body": "we are all certifiable",
				"added": 1565581886
			}
		],
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 66,
				"body": "Helping people and sharing is neither a communist or capitalist system because there is no central government.  All the problems of communism stem from a central government and the authority it forces on people (e.g., taking private property away from people, inhibiting free speech.)  \n\ne.g., Non-profit organizations that are 100% funded and staffed through volunteer contributions are not communism because there is no coercion to contribute.\n",
				"added": 1565645189
			}
		],
		"1565641356_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 67,
				"body": "```\n             _, . '__ . \n          '_(_0o),(__)o().\n        ,o(__),_)o(_)O,(__)o\n      o(_,-o(_ )(),(__(_)oO)_\n      .O(__)o,__).(_ )o(_)Oo_)\n  .----|   |   |   |   |   |_)0\n /  .--|   |   |   |   |   |,_)\n|  /   |   |   |   |   |   |o(_)\n|  |   |   |   |   |   |   |_/`)\n|  |   |   |   |   |   |   |O_) \n|  |   |   |   |   |   |   |\n|  \\   |   |   |   |   |   |\n \\  '--|   |   |   |   |   |\n  '----|   |   |   |   |   |\n       |   |   |   |   |   |\n  jgs  \\   \\   \\   /   /   /\n        `\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"`\n```",
				"added": 1565645864
			}
		],
		"1565652073_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 69,
				"body": "1> PUBLISHING.  When you publish your new site, you are the only seeder.  As people come to your site, they become seeder, but may not be seeders forever.  I'm not sure what garbage collection is done.  But if you are the only seeder, then it is effectively offline when you shut your computer down.  But, if you get other seeders first, and there is always at least 1 seeder online all night, then it will be available to the world all night while your computer is down.  \n\nIt is possible to have 10 seeders, then they die off, and you become the only seeder again.  In which case, you'll need to get people to come to your site again.  Note that you can access it from multiple computers or devices to seed multiple times.  \n\n2.0> ZITES.  User sites are static web sites of primarily HTML/Javascript/CSS.  There is no server side language like PHP.  ZeroNet itself happens to run on PHP.  But, the user created sites/content in ZN is not.  You have a file system based database available to you, which is part of your site.  But, when a user accesses a ZITE, all the files they are accessing are local on their file system after being downloaded, including any data.  Also, all users of all ZITES can view the source code, because it is plain text HTML, etc,...\n2.1> ZITES ownership.  Your private key created when you created your site is not published, and thus that gives you the ability to do things such as moderate content as well as publish.  If you lose this, you lose the ability to publish updates to your site or any other feature you built in such as controlling who can moderate.   \n\n3> SIZE LIMITS. There are default limits to site sizes that viewers can control and volunteer to increase as needed when prompted, file size limits, and user content limits I believe the site owner can set to protect the site from things like spam that would apply to each individual user of your site.  .\n\nI'm no expert, but this is my understanding so far.  So, a more seasoned expert can confirm or clarify.",
				"added": 1565653661
			},
			{
				"comment_id": 71,
				"body": "> [memesadler](#comment_42_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): Hypothetical: I download a site, change the HTML content around, and seed it. How do other Zeronet clients recognize it's fake or wrong? Public/private key signing prevents this or something?\n\nYes, the content has to be signed by the content owner, which corresponds to the site address.  Same as signing a Bitcoin transaction.",
				"added": 1565654320
			},
			{
				"comment_id": 72,
				"body": "> [bvcfbfbcbcvd](#comment_19_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): \"There is no server side language like PHP.\" Where did I say/imply this? Where?! In fact, the whole point is that the PHP logic is run on Joe's computer and nowhere else. Please read... this happens every single time when I try to get any nontrivial question answered: people seem to just skim my text and, as a natural result, the response becomes nonsensical since it assumes that I said things which I did not.\n\nOr, they just can't read your mind.  Interpreted #6.  I was just trying to help you.  No need to treat people who take the time to try to help you like a criminal.  \n\nThere is no reason to use PHP to do that.  So, it sounded like you were creating that functionality in the site, as an admin feature, which is how most do it here, but with Javascript in the website itself.",
				"added": 1565654493
			},
			{
				"comment_id": 73,
				"body": "> [bvcfbfbcbcvd](#comment_20_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): \"no reason to use PHP to do that\"? Huh? Please read my post before replying. You seemed to ignore the whole premise. Not trying to be rude,  but I find it extremely disrespectful to get replies (no matter how well written in their own regard) which seem to ignore the original author's questions. I wanted to know if the specific list of actions is... why am I repeating myself? I already typed this once...\n\nYou're extremely rude.  I was just trying to help you.  WTF?!?\n\nYou are using PHP to moderate user content submitted to a ZITE in your proposal.  That is possible the way you described it, but it makes no sense.  And, if you learn how to do it right, IT WILL ANSWER ALL YOUR QUESTIONS.\n\nA better use case would be a local PHP script that gathered data from clearnet and then generated new content for the ZITE for that. That would be a lot more clear to readers cuz it would actually make sense from a use case perspective.",
				"added": 1565654805
			},
			{
				"comment_id": 76,
				"body": "> [bvcfbfbcbcvd](#comment_22_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): crazylime: And how can you call me \"extremely rude\" for calling you out on not having read the post you're replying to? Why make the effort of replying at all if you don't even bother reading the question? You seriously think that's ever going to make the person asking the questions happy? It truly baffles me how you could possibly think that.\n\nIs that my role?  You are paying me to make you happy?  \n\nI read it, but misinterpreted as I explained.  One day, when you understand how content moderation is done on Zites, it will click, and you'll understand.  \n\nBut, I spent a lot of time carefully reading your post and answering.  MY TIME!   WASTED on someone who can't say thank you, but will cry because one little part was misinterpreted!  Grow up!  No one owes you anything.  People will rarely read every word, and they sure as heck won't always understand what you are trying to say.  You can either politely clarify, or you can cry because you live in a world with human beings who will never be perfect and don't live to make you happy.",
				"added": 1565657016
			}
		],
		"1565649984_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [],
		"1565651343_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 77,
				"body": "While I see from your comments that it was unlikely from a blocklist, unless you since disabled, this is a potential side effect of user block lists.",
				"added": 1565658065
			}
		],
		"1565658831_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 79,
				"body": "If you're having a problem with Tor Always in any browser, I have been trying for days to figure that one out.  \n\n# [ISSUE: Tor Always has 0 peer connections](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections)",
				"added": 1565659141
			},
			{
				"comment_id": 81,
				"body": "> [theecollector](#comment_6_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): yeah. For about a month it was work as far a surfing sites... but it always said \"error\" for Tor... But now nothing is working 😰\n\nOK, so basically like Disabled or Available then.  \n\nAs for the Tor browser, I haven't had any issues with 8.5.4 in Tor Available mode.  The only difference I've found between it and other browsers is you have to use 127.0.0.1 instead of localhost.",
				"added": 1565663352
			},
			{
				"comment_id": 82,
				"body": "> [theecollector](#comment_5_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): ... heres a link to a screenshot i took. https://ipfs.io/ipfs/QmS3Yxue2oZLs78fRmEdqAqD4mTp5ssgLuRp33xemfpmrU\n\nWe need to ask the Flameshot project to add an IPFS option lol.  I love their \"to the cloud\" imgur option for sharing screenshots.  Great for those scenarios you can't easily paste an image.",
				"added": 1565665663
			},
			{
				"comment_id": 87,
				"body": "> [theecollector](#comment_7_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): I just check out the Flameshop Porject.  [...]\n\non Fedora:  ```sudo dnf install flameshot```\nbind key.  enjoy.",
				"added": 1565701469
			}
		],
		"1565645808_1NkqJSocDr3nAa6WWDCAHgtf3ftwBUGGCK": [
			{
				"comment_id": 83,
				"body": "> [testuserpleaseig](#comment_18_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU): obviously they dont like censorship\n\nyou're kidding, right?",
				"added": 1565671512
			},
			{
				"comment_id": 84,
				"body": "This will answer all your important questions\n[Politics - The Idiot's Guide to Smart People](https://youtu.be/R72atCX4leY) (clearnet youtube)",
				"added": 1565671725
			},
			{
				"comment_id": 88,
				"body": "i've seen a lot more rightism - the ism of being right",
				"added": 1565729726
			}
		],
		"1517337097_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 86,
				"body": "[ZeroChat tutorial (new)](/Blog.ZeroNetwork.bit/?Post:99:ZeroChat+tutorial)",
				"added": 1565700602
			}
		],
		"1565721593_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 89,
				"body": "@ssdifnskdjfnsdjk If you get the answer, feel free to put it in [CrazyWiki](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X) for future reference:\n[CrazyWiki - Creating Zites](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:creating-zites)\n\nI also plan to document results of testing symlinks.  Not sure why @redcurrant is using hard links.  json config will certainly be **more portable than links and allow generated files by third party dev tools**.  You may have a doc you want in git but not NZ.  ",
				"added": 1565730553
			}
		],
		"1565734523_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 90,
				"body": "[ZeroMail](/Mail.ZeroNetwork.bit/) has a lot of room for improvement if you are interested.  I'd commit to discussions of requirements and design.",
				"added": 1565735244
			}
		],
		"1565715792_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 91,
				"body": "Brilliant!  To be sure I understand correctly, is this true:\n- all 08chan certs are self signed \n- \"1Nww...\" in cert_signers is new/current address of the self signed cert\n- \"112z...\" and \"1zo8...\" are the old addresses of self-signed 08chan certs\n- permissions overrides permission_rules\n\nCan someone link to documentation on creating a provider?",
				"added": 1565736424
			}
		],
		"1565742068_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 92,
				"body": "[No](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:creating-zites)",
				"added": 1565748505
			}
		],
		"1565515280_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 97,
				"body": "stress testing :)",
				"added": 1565762801
			}
		],
		"1565784755_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 98,
				"body": "That's a good question.  I'd like to understand how cleanup works.  ZeroMail does archiving.  So, it's size can drop.  I'm not sure how other db's are reduced in size.",
				"added": 1565797839
			},
			{
				"comment_id": 106,
				"body": "AI algos move the size to correspond with quality",
				"added": 1565966632
			}
		],
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 99,
				"body": "@bvcfbfbcbcvd: \nre #3: I couldn't agree with you more.  ZN has good starter docs, but by the time you finish it and begin to play, you'll have more questions than answers that continue to grow. \n\nAs a volunteer open-source project, creating documentation is everyone's responsibility.  Create a wiki and build knowledge of what you learn.  People can work together on a wiki if it gains traction.  \n\nContinually ask yourself what you can do to make ZN better.  You have a lot of power here.",
				"added": 1565798795
			},
			{
				"comment_id": 101,
				"body": "> [taylovedyou](#comment_2_1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo): Absolutely, the starter docs are very bad / incomplete. Unfortunately, they're not as easily editable as Wikipedia right?\n\nYou might be able to ask the owners if you can be a docs contributor.  Otherwise, it's not an open wiki.  I've chosen to just add things to a ZN wiki for now.",
				"added": 1565814318
			},
			{
				"comment_id": 102,
				"body": "> [znnex](#comment_20_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Optional Tor makes ZeroNet arguably not a darknet (it still takes special software to get in but does nothing to protect the users) but that doesn't seem to be clear to everyone. Actually not many people seem to know a lot about ZeroNet at all.\n\nVery true.  It's primary mission is censorship resistance, though, not anonymity.  It doesn't help when [Tor Always doesn't work, either](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/?Topic:1565465235_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+Tor+Always+has+0+peer+connections).  \n\nThe goal of including Tor is to provide optional protection for users.  But without it, it has no privacy at the network level. If anyone can find technical documentation on all network connections and their options, please share.  I don't know when TLS is or isn't used.",
				"added": 1565827698
			}
		],
		"1565806779_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 100,
				"body": "You can view the code of ZT yourself.  It is on your computer, and begins with the index.html.  Don't like it?  You can clone it, change it and convince others to use it.   These capabilities help make ZN censorship resistant, yet in no way controls what an individual can do with a site they own.",
				"added": 1565807774
			}
		],
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 103,
				"body": "You realize this goes for just about everything, not just ZN.  You have no idea what all your phone apps are putting on your storage.  Or your PC apps.  Malware is a problem on all computing devices.  You have the same risk with any closed source third party application you install.  You could have CP on your mobile phone with just the apps you installed from the legit apps store, because many of those contain malware and may be doing who knows what.  There are apps secretly mining crypto, stealing your data, hosting files you don't want.  There's no lack of malicious attacks your devices are under just from the innocent looking apps you install.\n\nYou aren't even 100% safe with a clean OS install.  There were infections spreading on networks targing Windows that were so bad, we had to install and update Windows without the network plugged in first to get the patch that could protect you.  ",
				"added": 1565852068
			},
			{
				"comment_id": 104,
				"body": "> [223556](#comment_120_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): ...They don't give a shit about a normie's bix nood smartphone's content, as they have no impact. [...]\n\nyou are right that you might need a different defense strategy depending on how content got there.  However, they definitely care enough about mobile storage in the USA to copy that storage from international travelers as well as when a person is arrested.  (Used to do w/o arrest, but court struck that down.)",
				"added": 1565852874
			}
		],
		"1565976900_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 107,
				"body": "> [gitcenter](#comment_582_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There are a couple of such sites already, lol. None became popular.\n\nI value quality over quantity.",
				"added": 1565977338
			},
			{
				"comment_id": 111,
				"body": "> [aspidochelone](#comment_82_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):\n [Fixed Issue](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1565983536_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/ISSUE+User+content+not+publishing+on+Zer0Talk+clone+RESOLVED).  Up now.",
				"added": 1565983777
			}
		],
		"1565977255_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 108,
				"body": "Yeah, something funky with that.  Testing...",
				"added": 1565979897
			},
			{
				"comment_id": 109,
				"body": "> [gitcenter](#comment_583_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Just increase the limit in the sidebar.\n\nYeah, I figured that out.  But, not sure how that will impact others.  The key diff here is the primary site is 21M w/o data/users content, whereas most sites are under 10 MB (default) allowing the initial site to load and display.  The increase is then typically needed to view more content such as user posts.  So, unless the user gets a nice prompt when they first visit the site, the 10MB default can be an issue.",
				"added": 1565980272
			},
			{
				"comment_id": 110,
				"body": "> [nickwa](#comment_369_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Go to data/users/content.json and up the limit there. [...]\n\n@nickwa I know how to do that.  but there is no data/users yet.  the 21M is for the site files in the root folder.",
				"added": 1565982504
			},
			{
				"comment_id": 112,
				"body": "> @nickwa: \nThe issue is the original site size, not data/users.  There is no data/users for that site, yet.  \n\nThe solution is each user has to bump the site size from default of 10MB.  But, not sure how best to communicate that if the initial page can't load.  My need to increase default size limit to something greater than 10MB in future release of ZN.  I'll look into a workaround, but have bigger issues with it right now unrelated to size (CORS limit in Firefox 68+).",
				"added": 1565984300
			},
			{
				"comment_id": 113,
				"body": "> [nickwa](#comment_374_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Isn't a warning to up the site limit by default? I do not even see a warning from your site because it says it barely uses any storage.\n\nNot this forum.  I'll put link in original description (click \"this topic\", then site link).",
				"added": 1565984449
			},
			{
				"comment_id": 114,
				"body": "> @nickwa:\n> @gitcenter: \nThis is one reason I create new ZeroTalk topical sites so we don't run into limit of ZNT main user space.  I have 2 now.  [ZN Sec](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/) and [ZT Zite Dev](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3)",
				"added": 1565985068
			},
			{
				"comment_id": 115,
				"body": "[Here is the \"solution\"](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1565976496_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/Content+Signing+Failed+Content+too+large#comment_2_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n).  Ultimately, though, looks like ZN code needs to address this use case.",
				"added": 1565991967
			}
		],
		"1565764347_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 116,
				"body": "> [mobileman](#comment_5_1N1dUmDRwutZqe9dm5MXLLbUGB6scNqKK): I'm interested in seeing how it goes. I'm following this thread, report back with your findings?\n\n[Here is an update](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1565993644_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/Testing+a+static+Angular+site+in+ZeroNet) on issues I ran into.",
				"added": 1566007501
			},
			{
				"comment_id": 123,
				"body": "There is a [GitHub Issue 2154](https://github.com/HelloZeroNet/ZeroNet/issues/2154) proposing a solution for the issues in [this Angular 8 test](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1565993644_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/Testing+a+static+Angular+site+in+ZeroNet).",
				"added": 1566058407
			},
			{
				"comment_id": 126,
				"body": "I'm happy to report that [the issues were resolved](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1565993644_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/Testing+a+static+Angular+site+in+ZeroNet), and [this demo Angular 8 site](/1Gtzk5w72SmSx7GW6Y1JaGLgPfkXH2Wanz) is now up!\n\nYou'll need to grant NOSANDBOX permission to view, as that is the solution to the issues.",
				"added": 1566078755
			},
			{
				"comment_id": 127,
				"body": "> [bigbadbob](#comment_309_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): nosandbox(dangerous)....  im dumb....ok to that.\n\nI'm going to look at the Py code and learn what potential risks come with that.  But, I can assure you, this is a harmless static website.",
				"added": 1566080331
			},
			{
				"comment_id": 128,
				"body": "> [bigbadbob](#comment_311_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Looks good btw\n\nTY.  permissions are just for the specific site.  Goes in your sites.json.",
				"added": 1566082376
			},
			{
				"comment_id": 129,
				"body": "> @bigbadbob: \nHere's the NOSANDBOX popup:  http://127.0.0.1:43110/1Gtzk5w72SmSx7GW6Y1JaGLgPfkXH2Wanz/img/NOSANDBOX.png",
				"added": 1566083522
			},
			{
				"comment_id": 138,
				"body": "> [n00dle](#comment_22_1C5WofUXvg54BgL9AiS2Mqdq3erQBGogXB): No, but I'm experimenting with using Vue. \nYou may be interested [in learning about NOSANDBOX](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/?Topic:1566178696_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n/Using+the+NOSANDBOX+permission).",
				"added": 1566183440
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 117,
				"body": "@gitcenter: this is sarcasm, right?",
				"added": 1566050908
			},
			{
				"comment_id": 118,
				"body": "@gitcenter: so, if I understand you correctly, you are trying to say this:\n\n```\n>++++++++++\n[>+++++++>++++++++++++>++++++++++>+++++++++++>+++++++++>++++++++++>+++++++++++>+++++>++++++++>++++++++++>++++++++++++><<<<<<<<<<<<-]\n>>--->->--->>+>++++>-->-->+>---->\n<<<<<<<<<<<<\n>.>.>.>.>.>.>.>.>.>.>.\n```",
				"added": 1566051297
			},
			{
				"comment_id": 119,
				"body": "> [qspitzer](#comment_71_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): \nyou need to debug your shit",
				"added": 1566051593
			},
			{
				"comment_id": 122,
				"body": "BTW, @gitcenter, how did you miss the JSFuck revolution?",
				"added": 1566053893
			}
		],
		"1566038009_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 120,
				"body": "congress/parliament... the dark market of ideas",
				"added": 1566052848
			}
		],
		"1566020351_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 121,
				"body": "you mean my text editor can mine crypto?!?",
				"added": 1566053117
			}
		],
		"1565965808_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 124,
				"body": "> [styromaniac@kxoid.bit](#comment_124_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): SECURITY HOLE: I can install plugins on your proxy. [...]\n\nIssue opened on GitHub: https://github.com/HelloZeroNet/ZeroNet/issues/2155",
				"added": 1566070080
			}
		],
		"1566080751_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 130,
				"body": "lol, 100 MB is nothing for a good food site.  GJ converting a WP site.  You should [document how you did](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:creating-zites).\n\nHowever...  what is up with frozen pizzas?!?  You have a pizza stone.  Make a real pizza!  \n\nFigure out how to allow commenting, and I'll lead the way.",
				"added": 1566103905
			}
		],
		"1566081316_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 131,
				"body": "It's a relative term.  Obviously, being stuck on planet earth, it's all centralized.",
				"added": 1566137972
			}
		],
		"1566141272_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 132,
				"body": "Looks like it is someone's personal dev branch (fork). shortcutme might be using it. bot updates user (fakegit) dev with head. user commits code change on personal and creates merge request to head. shortcutme then commits the merge request to head (py3 branch).",
				"added": 1566146758
			},
			{
				"comment_id": 142,
				"body": "https://github.com/artiebits/fake-git-history\n\nI heard about devs taking advantage of this loophole years ago to work around excessive scrutiny of their productivity.  \n",
				"added": 1566228768
			}
		],
		"1565677270_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 133,
				"body": "The problem is that politicians print money to pay back cronies who helped them get elected.  Corruption is cause of their inflation. Dollars, gold and bitcoin are in high demand there.",
				"added": 1566147023
			}
		],
		"1565416035_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 134,
				"body": "lol 8 days later",
				"added": 1566156008
			}
		],
		"1566168967_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 135,
				"body": "[CrazyWiki - ZN Crypto](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:zeronet-crypto)",
				"added": 1566169318
			},
			{
				"comment_id": 137,
				"body": "@xcape2net:\nread the last line about **address_index**.  looks like 25650465",
				"added": 1566172195
			}
		],
		"1566152917_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": [
			{
				"comment_id": 136,
				"body": "To my knowledge, the Seth story started with Kim Dot Com suggested he had conversations with Seth where Seth shared that he copied the files onto a flash drive and was trying to get them to wikileaks.  KDC tweeted about it as well, and offered to testify in the US.",
				"added": 1566170113
			}
		],
		"1566209947_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 140,
				"body": "@gitcenter: you have mail",
				"added": 1566224305
			},
			{
				"comment_id": 141,
				"body": "> @gitcenter: \n\nI saw the sample code posted late last night by imachug, so didn't have time to test it out.  I plan to do some tests because I'm not just looking to identify the issues, I'm looking for solutions.  I have been debugging the ZN Py code, so already have ideas on how to lock it down so we can get rid of that pesky \"Dangerous!\" message. lol\n\nBut, this does point out one glaring problem with the ZeroFrame API.  It, ironically, IS the security hole.",
				"added": 1566224844
			}
		],
		"1566260391_1D8TyrF6WYHSWMPSwRCmDR868WxaTihFjA": [
			{
				"comment_id": 143,
				"body": "I'm using the only source of truth, [the code](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:zeronet-design).",
				"added": 1566270691
			},
			{
				"comment_id": 147,
				"body": "> [gitcenter](#comment_627_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @crazylime Heads up: gevent is not a network library, it's an asynchronous framework, just having network as one of the features.\n\nI found myself describing it as a light threading model, upon which they built networking, upon which they built an HTTP server that supports websockets.  Is that accurate?  I did read how it simulates threads on a single real thread with blocking.  ",
				"added": 1566326134
			}
		],
		"1566241449_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": [
			{
				"comment_id": 144,
				"body": "sites are ZN's data.  you should back up your own sites.  you can optionally backup other sites. be ready to roll back to prior version of ZN.  ",
				"added": 1566273644
			}
		],
		"1565811143_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 145,
				"body": "didn't he basically just request that a mute button tell the muted person that **XYZ thinks \"You are so DUMB\"**?",
				"added": 1566279333
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 146,
				"body": "> [gitcenter](#comment_625_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ZeroNet itself can't be encrypted -- it's just an application. What you are asking is whether ZeroNet protocol is encrypted. Actually, it can be both encrypted and raw, depending on: [...]\n\nUseful info, so copied and referenced [in CrazyWiki](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:zeronet-internet-communications).  \n\nCan you shed light on when Tor is used or not used, since the OP is concerned also with \"exposing ones IP via P2P\"?",
				"added": 1566307947
			},
			{
				"comment_id": 148,
				"body": "> @r3naam3r:\nWhat do you mean by \"forced Tor\"?  ZN's \"Tor Always\"?  OS-level proxy forcing all Internet through Tor?",
				"added": 1566358094
			}
		],
		"1566397383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 149,
				"body": "I'd love to see it inside ZN with mirroring outside one day.  I realize we're not there yet.  But for sites I create, I'd only consider in ZN or private.  While I realize Git Center lacks a lot of features, I really like that it is an option today for many things, even if ZN itself isn't one of them.  Thanks for creating it!",
				"added": 1566405280
			},
			{
				"comment_id": 150,
				"body": "> @gitcenter: \n\nWhile forking may not be ideal, the fact that we can fork does dramatically lower the urgency of this so that we can consider this from a long-term perspective.  \n\nAlso, regarding auto-update in nofish's conversation with you, I **oppose automated pushing of updates**.  That is a huge security risk.  One of the early forks of Bitcoin was created by a bad actor that wanted this feature in the client he created for it, giving him the ability to pervert the code users were running without their awareness with his toxic ideas.  Even if you know you'd never do anything bad.  Do not let ZN users become comfortable with the idea, or, when someone does fork, you can find yourself helpless to save ZN really fast as auto-update can have a lot of power.  \n\nIf a user wants to turn it on, that's an OK compromise.  But, I for one would never use a release of ZN that required auto-updating, and would never turn it on if an option, and would be concerned if on by default.  If it ever defaults to auto-update, then I'll have to script turning it off before first run of a new release.  \n\n> @nofish: \"Automatically updating code without user revision is kind of unsafe though\"\n\nYES!  VERY VERY UNSAFE!\n\nand 2 of 5 multi-sig does little to ease concerns.  Just to throw out a scenario, what if you and nofish are kidnapped by a bad entity -- like the Hungarian mob?  Trust isn't simply about trusting a person's intentions because people are inherently vulnerable, no matter how noble their intention are.  \n\nThis is why I prefer trust-less solutions.",
				"added": 1566408008
			},
			{
				"comment_id": 151,
				"body": "> [gitcenter](#comment_681_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Unfortunately, imachug/ZeroNet sounds a bit less trusty than HelloZeroNet/ZeroNet, and it'll be difficult to maintain the issues from HelloZeroNet repo.\n\nI understand your concerns. I just don't think they are urgent and that there is more ways to skin a cat.  I'd rather think longer-term than be hasty.",
				"added": 1566408395
			},
			{
				"comment_id": 152,
				"body": "> [estimene](#comment_1_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ): Most things that are \"not malicious\" are now seen as malicious thanks to smear tactics. Hubris of this nature will result in the death of the ZeroNet repository if certain protections aren't mitigated beforehand.How easy would it be for a push to demonize decentralized networks to start and result in wide scale blacklisting?\n\nAnd in the case of the bad actor of that forked Bitcoin with a client that had auto-updates, he was a big fan of blacklisting, known as \"tainting\" in the crypto world, a threat to fungibility, which is a threat to Bitcoin itself.  Auto-update and blacklists are a potentially nasty combo.  That combo is perhaps zeronet's biggest threat.  ",
				"added": 1566408619
			},
			{
				"comment_id": 153,
				"body": "> [gitcenter](#comment_682_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Uh, isn't this long-term?\n\nLong-term would be a development process that no one controlled and addressed the bigger potential threats.  Until we have a vision and roadmap for that, the focus is not long-term.",
				"added": 1566410510
			},
			{
				"comment_id": 154,
				"body": ">@gitcenter: \"Development is by definition centralized\"...\n\nThis is as assumption, not the truth.  If merging of pull requests is decentralized, then peer review and acceptance of new code is decentralized to the extent the community stakeholders can vote.  Funding new features can also be decentralized, increasing the incentive for anyone able and willing to become a developer while giving the community a bigger say in priorities.      \n\nHalf of what you're saying are points I'd make for having a vision and road map for decentralizing development.  For example:\n\n> @gitcenter: \"Users (not developers) don't have enough experience to understand what is safe and what is not.\"\n\nThat would not be as true if discussions were more inclusive.  Under the current centralized model, we have very little incentive to increase peer review of design, because no one has a vote at the end of the day.  The more eyes we have reviewing features and code before being merged, the better our security model will be.  Increasing ownership is one way to increase participation in development.",
				"added": 1566413772
			},
			{
				"comment_id": 155,
				"body": "> [gitcenter](#comment_686_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): How is this different from the proposed maintainer list? I meant it to be used for critical updates only, but that's just the first step; we can always make PRs decentralized later. [...]\n\nYou are raising good questions.  I really really want to discuss it all.  But this is eating my ZT quota alive, and this really needs to be a discussion over time with other participants.  \n\nBut a quick reply, in a democracy, you have to make a case, and give others the opportunity to support or question your proposal.  The better you convince the community, the more willing they will be to fund it.  \n\nThe merging of PRs could require a quorum.  \n\nThe reason that fork of Bitcoin failed is because the miners were the voters, by choosing which software to run.  The China miners overwhelmingly voted against running the new software.  That's not an ideal way to vote.  But it is an example how voting saved Bitcoin from a very bad actor.  And voting can protect ZeroNet. Can you think of anything more decentralized than voting?",
				"added": 1566415287
			},
			{
				"comment_id": 156,
				"body": "> @gitcenter: \n\nall very good questions below (\"who\" etc).  Those are questions we get to answer together, as a community.  I have proposals, of course, to begin the discussions.  Yet, I know the end result of open discussion will be better than what I originally imagined -- and this is why I love teamwork.  The more brilliant insightful minds we include in the discussion, the more incredible the outcome will be.    \n\nIn the meantime, check out [Bisq's DOA](https://bisq.network/faq/#about-dao) as just one example how others have innovated a new solution to decentralizing development.  Hopefully this gets the creative juices flowing.",
				"added": 1566416003
			},
			{
				"comment_id": 157,
				"body": "> [gitcenter](#comment_688_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Unlimi\n\n[ZeroNet Decentralized Development Roadmap](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1566424248_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n) in UNLIMIT TALK so we can discuss without using up user limit here.  \n\n@Everyone, to stay-up-to-date, click on the \"Follow in Newsfeed\" link and share your ideas, concerns and perspectives!",
				"added": 1566425056
			}
		],
		"1566424575_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 158,
				"body": "> [caropc7](#comment_5_19siGLDKr3LtXdXo3VL14VwpcvKPr4mikx): please add support to id kaffie at the UNLIMIT TALK [...]\n\nI don't own it.  I went to it per @gitcenter's suggestion because the user cap here is low.  We can clone ZT for ZN/Dev discussions if that solves the id Kaffie and put high user limits there.  I've created topical ZeroTalk's for [ZN Sec - Scurity](/14swNBgrE3cTbreHgTGAYiGRBiPrnFCDJB/) and [ZN Zites Dev](/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/).  But, for core ZN development, I'd really like @nofish to create it or put his blessing on it if possible.",
				"added": 1566435916
			}
		],
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 159,
				"body": "> [opisafag](#comment_2_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2): The real problem with mobile is that these devices run on battery so they can't participate in decentralized networks properly. Mobile, as we know it, requires centralized servers/infrastructure. Mobile is what's ruining the internet.\n\nYes and no.  Check out the servalproject.org.  \n\nThere are also solar chargers, crowds that could benefit even with their battery limitations, such as in Lybia during their revolt.  In Kashmir today, with their Internet cut by India, a cell phone mesh would really help.   \n\nThe Red Cross uses Serval.  If you look on top of their hospitals just a few feet from the \"please do not bomb us\" symbol, you'll often find an antenna that can act as a repeater/extender for mesh networks on mobile devices.  ",
				"added": 1566438919
			},
			{
				"comment_id": 162,
				"body": "> [xcape2net](#comment_341_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): ham\n\nBlog on it.  I'm interested.  But no one knows the possibilities.  \n\nIs there a topology that can use ham radio to span distances?  If you find good info on mesh, add it to [this wiki page](/1NtQvrYd8rJzQYP3j1snmi28mPn8wSXX4X/?Page:networking---mesh).  \n\nOnce you have mesh running, ZeroNet becomes the perfect user interface to it.",
				"added": 1566478654
			}
		],
		"1566439997_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 160,
				"body": "I love IPFS, especially with FUSE.  It's a learning curve due to its abstractions, but pretty cool and worth the curve.  \n\nThe two biggest issues for combining with ZeroNet are performance and privacy.  \n\nPerformance can be improved. We'll see how that develops.  I don't understand its bottlenecks well.  \n\nDo you have a privacy solution?  I am not aware of a way to make it work on Tor.  \n\nIt's a paradigm shift, because your IP is much like your number.  You probably don't want the whole world to know it, especially if it is static.  Unfortunately, the potential for harm is far greater if someone has your IP than your phone number.  We've taken it for granted that using third party sites like Google and Twitter hides our IP from our peers.  If you have time, see if you can get it running in Whonix, which forces everything on the VM through Tor.  Their wiki has instructions for services that do work in it, including ZeroNet, to help you understand how to open ports.    \n\nThat said, IPFS has a lot of promising use cases on its own.  And, perhaps one day, it can fill a niche within ZeroNet, or there can be bridging or mirroring. .",
				"added": 1566446829
			},
			{
				"comment_id": 161,
				"body": "> [blurhy](#comment_315_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): IPZN will be a superset, because it's designed for any infrastructure.\n\nHow is reputation playing a role?  \n\nIn general, I only trust **trustless** networks.  There may be times when reputation solves a unique problem without doing harm, though, so I don't automatically rule it out, but do ask, how can it do harm.  Slashdot uses it successfully for content moderation, but all comments are visible to anyone who wants to see them.  P2P could use it to determine if someone is human.  \n\nI'm considering very open reputation calculations to determine if someone is human for voting purposes to counter sybil attacks where someone uses bots to game the system.  But, once a person meets the \"isHuman\" threshold, I'd like to stop there.",
				"added": 1566478131
			}
		],
		"1566491557_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 163,
				"body": "> [mg0](#comment_111_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): @crazylime: why do you do this?\n\nDo what, exactly?  Link to UNLIMIT TALK?  To save limited user space here (below and right of your *new comment* box).",
				"added": 1566498722
			}
		],
		"1566581844_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 164,
				"body": "> [aspidochelone](#comment_129_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I don't know, but I'm thinking that evil bureaucrats have a lot of screwed up back door ways...\n\nTor and VPN are unlikely to protect you from large entities.  They can, however, protect you from a pissed off troll wanting to attack your IP address.  Tor is free.",
				"added": 1566594393
			}
		]
	},
	"comment_vote": {
		"5_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"37_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"298_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"13_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1_16S1R2VupPZPPDkCZ1tU2mWXcEijK3VTUY": 1,
		"14_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT": 1,
		"1_1BX5Fybb58kpdZGw2d9a5arCD3jJbi8DZz": 1,
		"1001_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"561_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"16_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": 1,
		"555_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"122_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1_1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo": 1,
		"6_1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo": 1,
		"62_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"77_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1,
		"3_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE": 1,
		"4_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE": 1,
		"18_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"326_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"72_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"74_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"19_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"330_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"385_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1051_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"315_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"4_18jmm5K92icHYrBzbvG4wo6NtPZEVMoTBP": 1,
		"1_1KAAapzmQubR3wAZ1brewkZZz3ycBhuTsA": 1
	}
}