{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Rede Cerebral: Três jogadores unem seus cérebros para jogar Tetris",
			"body": "A comunicação telepática pode estar um passo mais próxima da realidade graças a uma nova demonstração de uma rede cérebro a cérebro.\n\nLinxing Jiang e colegas da Universidade de Washington criaram um experimento que permitiu que três pessoas trabalhassem juntas para resolver um problema comum usando apenas suas mentes.\n\nNessa \"rede cerebral\", ou BrainNet, três pessoas brincaram de um jogo tipo Tetris usando interfaces cérebro-a-cérebro.\n\nEsta é a primeira demonstração de duas coisas: uma rede cérebro-a-cérebro de mais de duas pessoas, e uma pessoa sendo capaz de receber e enviar informações a outras pessoas usando apenas o cérebro.\n\n- https://sci-hub.tw/10.1038/s41598-019-41895-7\n- https://ipfs.infura.io/ipfs/QmQTQNy7TGvsyvzdpN1FEbV5AR2mbVZrdRAKAEs7Aq81PV",
			"added": 1577526257
		},
		{
			"topic_id": 2,
			"title": "Nova versão do OnionShare torna mais fácil para qualquer pessoa publicar sites anônimos e sem censura",
			"body": "O Tor Project — instituto responsável pelo navegador Tor Browser — acaba de lançar a versão 2.2 do OnionShare, software originalmente feito para compartilhar arquivos de forma sigilosa usando a rede Tor. Com a atualização, a ferramenta acaba de ganhar um recurso interessantíssimo: ela agora permite que você publique, gratuitamente, um site estático inteiro na rede Onion.\n\nO uso do programa é bem simples: basta abri-lo, acessar a guia “Publish Website”, carregar os arquivos que compõem o site em questão e clicar em “Start sharing”. Ele vai gerar um servidor web para hospedar os documentos e lhe informar um domínio com a extensão .onion; a partir daí, qualquer internauta poderá usar o Tor Browser para acessar o conteúdo em questão normalmente.\n\nA ideia por trás do projeto é facilitar a vida de quem deseja publicar um site que seja impossível — ok, é mais realista dizer “difícil” — de ser censurado, visto que derrubar uma página na rede Onion é uma tarefa bem mais complexa do que na surface web. É desnecessário dizer que ninguém terá acesso ao seu endereço IP ou quaisquer informações suas que possam ser usadas para identificá-lo.\n\nObviamente, nem tudo são flores e é interessante observar que, ao publicar um site com o OnionShare, a sua própria máquina se torna o servidor web. Sendo assim, caso você desligue seu computador (ou simplesmente ative o modo stand-by), o site se tornará inacessível até que ele seja ligado novamente. Isto posto, o mais recomendado é utilizar um PC secundário (pode ser aquele laptop antigaço que você tem guardado) para tal finalidade.\n\n[Você pode baixar a versão 2.2 do OnionShare através de seu site oficial.](https://onionshare.org/)\n- Site OnionShare na Onion: http://lldan5gahapx5k7iafb3s4ikijc4ni7gx5iywdflkba5y2ezyg6sjgyd.onion/\n\n#Fonte: https://thehack.com.br/publicar-um-site-na-rede-onion-ficou-mamao-com-acucar-gracas-a-esta-nova-ferramenta/",
			"added": 1577528944
		},
		{
			"topic_id": 3,
			"title": "Crie seu PRÓPRIO \"DROPBOX\" com o NEXTCLOUD - Ubuntu Server",
			"body": "Neste vídeo você aprenderá a criar um servidor Nextcloud com o Ubuntu Server usando pacotes Snap. Com o Nextcloud você pode ter o seu próprio serviço de armazenamento em nuvem e manter os seus arquivos importântes em um servidor que você controle completamente.\n\n- https://invidio.us/sqVEL8PVJmg\n\n- https://ipfs.infura.io/ipfs/QmTTkxipjALsW8oNjiZhjFTv37Hkq3UYLcbj3EXQHGAgU1",
			"added": 1577529282
		},
		{
			"topic_id": 4,
			"title": "Sim, eu apoio a Coreia do Norte! Notas sobre anticolonialismo, imperialismo e hegemonia",
			"body": "https://gateway.pinata.cloud/ipfs/Qmeehpw7F6UwBDkXPkNEr5PrwH7EqeF6L6kqL1ykZFWBEq\n\n\"Não tenho medo de ser chamado de dogmático, stalinista, fanático ou qualquer coisa do tipo por manifestar meu apoio a um povo que deseja ser livre. Meu maior medo, quando o assunto é a Coreia Popular, é ver esse povo terminar como o líbio ou o palestino.\"",
			"added": 1577530413
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Um algoritmo clássico de inspiração quântica para sistemas de recomendação\n\nEm julho de 2018, [Ewin Tang](https://en.wikipedia.org/wiki/Ewin_Tang), estudante de computação e matemática de 18 anos da Universidade do Texas, causou furor no mundo da computação internacional por ter desenvolvido um algoritmo clássico de computador que pode resolver um problema quase tão rápido quanto um [computador quântico](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Quantum_computing.html).\n\nO problema a ser solucionado envolvia um mecanismo de recomendação que sugere produtos aos usuários com base em dados sobre suas preferências.\n\n- https://sci-hub.tw/10.1145/3313276.3316310\n- https://ipfs.infura.io/ipfs/QmbE4zAGFmMbCR1WvrVdtTYFpdVJP5vwsZYrJVDkNmYcpc",
				"added": 1577526651
			},
			{
				"comment_id": 2,
				"body": "#Função de mão única\nEm Ciência da Computação, uma função de mão única ou função de sentido único é uma função que é fácil de calcular para qualquer entrada, mas difícil de inverter dada a imagem de uma entrada aleatória. Aqui \"fácil\" e \"difícil\" são entendidos em termos da teoria da complexidade computacional, especificamente a teoria dos problemas de tempo polinomial. Não sendo um-para-um não é considerado suficiente para um função ser chamada de mão única.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/One-way_function.html\n\n#Função de mão única universal\nExiste uma determinada função que foi demonstrada que é de mão única se e somente se funções de mão única existirem. Como esta função foi a primeira função de mão única combinatorial completa a ser demonstrada, ela é conhecida como a \"função de mão única universal\". O problema de determinar a existência de funções de mão única é assim reduzido ao problema de provar que esta função específica é de mão única.\n- https://arxiv.org/abs/cs/0012023\n- https://ipfs.infura.io/ipfs/QmRKFea9wMkMAUHHPZpFeNvMPPgrpRueV3r18HsJTkJx8X",
				"added": 1577526878
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 3,
				"body": "#Sim, eu apoio a Coreia do Norte! Notas sobre anticolonialismo, imperialismo e hegemonia\n\n- https://gateway.pinata.cloud/ipfs/Qmeehpw7F6UwBDkXPkNEr5PrwH7EqeF6L6kqL1ykZFWBEq",
				"added": 1577527462
			}
		],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 4,
				"body": "#Como fazer um [rádio de galena](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Crystal_radio.html)\n\nO rádio de galena é um dos receptores mais simples de modulação AM que se pode construir. Ele utiliza as propriedades semicondutoras do mineral galena, um dos primeiros semicondutores utilizados, ou seja, antes do germânio e silício.\n\n- https://invidio.us/Ax5u_jCwCro\n\n- https://ipfs.infura.io/ipfs/QmNSjPaGstC5wCz96iprt4oBUmHTUq5tguJAC1gFBJZkNL\n\n#Lista de componentes usados:\n\n- 1 capacitor cerâmico de 1nF (102), entre o anodo do diodo e o terra. Este capacitor pode variar;\n- 1 diodo Schottky 1N5817 (pode usar um de corrente menor);\n- 1 capacitor cerâmico de 100pF entre o catodo do diodo e o terra (também pode variar);\n- 1 fone de ouvido ou similar de alta impedância. Eu usei o S-30V-LP da microelectron/sonalarme, não custa barato, porém funcionou bem com fone de ouvido convencional de hoje (de baixa impedância);\n- Uns 30 metros de fio de cobres esmaltado AWG 24 (pode ser um pouco mais grosso).",
				"added": 1577530326
			}
		]
	},
	"comment_vote": {}
}