{
	"comments": [
		{
			"comment_id": 1514301797564,
			"reference_type": "q",
			"reference_id": 1514183561872,
			"reference_auth_address": "1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT",
			"body": "It 'reclones' your site. It copies all of the files from the original site, so that you can 'upgrade' your version of the site. So say you have a blog copied from zeroblog. ZeroBlog updates and has new features. However, you cloned your site before that and don't have the features! So what you can do is hit \"upgrade code\" and it'll take all the new versions of the documents, and replace the ones you have with them, effectively giving you the new version.\n\nHowever, if you had manually made changes to some of these files, those changes will be overwritten.",
			"date_added": 1514301797564
		},
		{
			"comment_id": 1514446989291,
			"reference_type": "q",
			"reference_id": 1514183561872,
			"reference_auth_address": "1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT",
			"body": "From my understanding, the content itself (what is written, the history, etc.) won't be lost, provided that the original site has the \"data-default\" folder (basically: that it didn't copy all of the data when you first cloned it). The changes to the site itself, say the translation of the edit/home/etc. buttons *will* be reverted.\n\nIf you have a repository on github, and then merge in the new changes as you normally would with say a pull request, then yeah, obviously you'd manage the merge how you'd normally do it through git, and then update your site normally. I'd recommend backing up your site files and especially the data folder to make sure that it's not lost when you hit 'upgrade'.",
			"date_added": 1514446989291
		}
	],
	"answers": [
		{
			"answer_id": 1514446802303,
			"question_id": 1514183561872,
			"question_auth_address": "1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT",
			"body": "It 'reclones' your site. It copies all of the files from the original site, so that you can 'upgrade' your version of the site. So say you have a blog copied from zeroblog. ZeroBlog updates and has new features. However, you cloned your site before that and don't have the features! So what you can do is hit \"upgrade code\" and it'll take all the new versions of the documents, and replace the ones you have with them, effectively giving you the new version.\n\nHowever, if you had manually made changes to some of these files, those changes will be overwritten.\n\n- Noticed I did a dumb and posted this in the wrong section so here's it in the proper answer spot.",
			"date_added": 1514446802303
		}
	]
}