{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Nouveau langage de programmation",
			"body": "Nouveau langage de programmation pour ceux qui voudraient se lancer dans la création de jeux ou logiciels sur pc:\nhttps://scriptdev.net/\nAucune connaissance n'est requise, c'est un bon moyen de découvrir la programmation (plus simple que le JavaScript).\nEt la documentation est en français ;)",
			"added": 1505007651
		},
		{
			"topic_id": 2,
			"title": "Question sur le développement de site Zeronet",
			"body": "On peut faire des tchats et des forums Zeronet, mais est ce qu'on peut y ajouter une fonctionnalité de suppression de messages? Je sais pas si c'est possible avec ce système de blockchain.\nPar \"suppression\", je n'entends pas \"modification\" comme on peut le faire sur un wiki. Mais une vraie suppression, comme on supprime un email.",
			"added": 1505070746
		},
		{
			"topic_id": 3,
			"title": "Zoogle Zearch",
			"body": "Bonzour, ze viens vous prézenter un zite que ze viens de créer sur Zeronet.\nOk j'arrête x)\nVoici le lien:\nhttp://127.0.0.1:43110/13EYKqmPpwzBU4iaQq9Y4vfVMgj8dHeLkc/\nC'est un petit moteur de recherches pour Zeronet, je l'ai nommé \"Zoogle Zearch\".\nJe vais prochainement coder des bots d'indexage automatique, et un moyen d'indexer manuellement des sites.\nPour l'instant on a un truc déjà fonctionnel, mais pas encore à son apogée.\nJe suis ouvert à toute suggestions.",
			"added": 1505240171
		},
		{
			"topic_id": 4,
			"title": "Mes Chaines Youtube & KopyKate sur Zeronet",
			"body": "Ma Chaine Youtube sur Zeronet:\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?Channel=defalt@zeroid.bit\nMa chaine KopyKate: http://127.0.0.1:43110/big.kopykate.bit/?Channel=defalt@zeroid.bit",
			"added": 1512483380
		},
		{
			"topic_id": 5,
			"title": "Je cherche un film VF svp",
			"body": "Salut,\n\nJe suis allé voir \"Ready Player One\" au ciné, et j'aimerais le revoir en VF et en bonne qualité.\nIl est introuvable sur internet (torrent, direct-download, streaming).\n\nSi vous l'avez, vous pouvez me l'envoyer ? Merci\n(Je cherche aussi le film \"Valérian et la Cité des mille planètes\")",
			"added": 1524594079
		},
		{
			"topic_id": 6,
			"title": "CONCOURS, LIARDS ET ACNÉ : QUAND LE HASARD RÈGLE VOS COMPTES",
			"body": "https://www.klakinoumi.com/2018/04/24/concours-spotify-premium-generateur-comptes-voles/",
			"added": 1524771151
		},
		{
			"topic_id": 7,
			"title": "Zoogle Zearch",
			"body": "http://127.0.0.1:43110/13EYKqmPpwzBU4iaQq9Y4vfVMgj8dHeLkc/",
			"added": 1621153461
		}
	],
	"topic_vote": {
		"5_1u6V1rj2KzNCnVs6MooZRoJDZ6fPgGuwg": 1
	},
	"next_comment_id": 10,
	"comment": {
		"2_1u6V1rj2KzNCnVs6MooZRoJDZ6fPgGuwg": [
			{
				"comment_id": 1,
				"body": "Je suis sur Zeronet depuis 2 jours, pas la peine de me frapper xD\nEn tout cas, merci pour ces précisions. \"Suppression d'un fichier\" implique que la suppression concerne un ensemble d'éléments (comme lorsqu'on supprime une base de données). J'imagine que certaines informations peuvent être contenues dans des fichiers uniques pour pouvoir être supprimés indépendamment du reste. Aurais-tu des tutoriels ou des pistes pour m'aiguiller dans cette direction?",
				"added": 1505161653
			}
		],
		"1_1u6V1rj2KzNCnVs6MooZRoJDZ6fPgGuwg": [
			{
				"comment_id": 2,
				"body": "La version du logiciel présente actuellement sur le site est en effet que pour Windows. Je travaille depuis plusieurs mois sur une refonte en C++ (et ça s'annonce très bien), l'un des objectifs de cette refonte étant de rendre le logiciel multiplateformes. Donc il sera disponible prochainement sur Linux et Mac :)",
				"added": 1505162043
			}
		],
		"1_1FzppM7Wv3LTgRLqApEBaSkr51QDJki8nJ": [
			{
				"comment_id": 3,
				"body": "ça bloque sur:\n   CONNECTION...\nPAIRS TROUVÉS: 2",
				"added": 1505323113
			}
		],
		"5_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 4,
				"body": "J'y ai téléchargé plusieurs fichiers, sans avoir besoin de me connecter (donc sans ratio), et pour l'instant ça s'est très bien passé. Le site me semble fiable.\nMais pensez quand même à avoir un VPN pour télécharger les torrents, juste au cas où.",
				"added": 1505348660
			},
			{
				"comment_id": 8,
				"body": "Lien down",
				"added": 1524760790
			}
		],
		"4_1u6V1rj2KzNCnVs6MooZRoJDZ6fPgGuwg": [],
		"5_1u6V1rj2KzNCnVs6MooZRoJDZ6fPgGuwg": [
			{
				"comment_id": 6,
				"body": "> [wanditoast](#comment_2_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ): http://streamingvf.website/2017/11/ready-player-one-2018-film-streaming-complet-vf/\n\nFaux player vidéo et ça demande la carte bancaire. Ca a l'air d'être un site d'arnaque",
				"added": 1524618283
			},
			{
				"comment_id": 7,
				"body": "Pas de soucis\nJ'en ai trouvé un seul qui n'est pas un fake, c'est sur le site zonetelechargement (qui est souvent fiable), mais le film est en qualité TS (plus que minable), donc c'est pas la peine :/\nDes résultats Google ont été supprimés pour droit d'auteur. J'imagine que ces liens étaient surement fiables. Mais je sais pas trop comment les trouver (s'ils existent encore)",
				"added": 1524621304
			}
		],
		"1_17SkTWL47x3pVwkLLe6rrqGdEnpBvGrwSW": [
			{
				"comment_id": 9,
				"body": "Salut,\nQu'est ce que cette version de Kopykate propose de différent par rapport à l'original ? Pourquoi ne pas avoir simplement créé une chaine sur Kopykate ?",
				"added": 1528054225
			}
		]
	},
	"comment_vote": {
		"7_12CVtpPeZw9ch65n1msemh2dktGPHodc2M": 1,
		"1_1MA6JQXUYZUsHrkS5ctuiswwFJMb4xKvXh": 1,
		"2_1MA6JQXUYZUsHrkS5ctuiswwFJMb4xKvXh": 1,
		"4_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ": 1
	}
}