{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1565213051,
			"title": "\"OH NO, IT'S THE DARK WEB!\"",
			"body": "> Mainstream news outlets calling the *chans cesspools of hatred\n> Mainstream platforms banning posters of offensive content who just move on to the next platform until they are no longer being banned.\n\nThis is like sweeping all the dirt under the rug and then getting upset that it's dirty under the rug.\n\nCHANGE MY MIND",
			"added": 1565213050
		},
		{
			"topic_id": 1565218244,
			"title": "[Solved] Anyone having difficulty posting images in their ZeroBlog?",
			"body": "TL;DR\nOH -- It worked for a *SMALL* image! There's some sort of internal size limit. OK.\n\nDISREGARD\n\n~~I followed the instructions (go to the ZeroHello page, click the 3 dots on ZeroBlog and Clone it), and it did create my blog.~~\n\n~~I can add and edit text.~~\n\n~~When I add images, it brings up the file browser, but when I upload a .PNG, the image appears briefly before vanishing immediately afterwards.~~",
			"added": 1565218242
		},
		{
			"topic_id": 1575752736,
			"title": "Gab bans porn",
			"body": "Andrew Torba claims that \"porn is not free speech\".\n\nThe woke crowd makes up their own definition of what is \"hate speech\" to suit their own agenda.\nTorba makes up his own definition of \"free speech\" to suit his own agenda.\n\nI'll tell you what free speech is: It's UNMODERATED SPEECH.\n\nI remember the days when the internet was wild and free and moderation was practically non-existent. ZeroNet reminds me of that.\n\nYou either own your platforms, or your platforms will pwn you.",
			"added": 1575752733
		}
	],
	"topic_vote": {
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"1565288635_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565314153_1Cx3BTrQckf6v9Hm9KSAJxztGxqoTwAT4m": 1,
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"1569840447_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1575708225_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1575704355_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1575661928_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575385168_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1576120994_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": 1,
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1610172107_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG": 1,
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1
	},
	"next_comment_id": 57,
	"comment": {
		"1565213051_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 1,
				"body": "Also, if Normal, Ordinary Responsible People (norps) hate the idea that there are dark corners of the internet, they should just participate in said dark corners to brighten them up.",
				"added": 1565213185
			},
			{
				"comment_id": 2,
				"body": "> [nickwa](#comment_237_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): They actually believe that deplatforming works. They think it reduces the reach of these groups. All censorship does is create more push back. The Streisand effect.\n\nIt's like tightening the lid on a pressure cooker to stop the steam from escaping.",
				"added": 1565213302
			},
			{
				"comment_id": 3,
				"body": "I honestly just installed Zeronet less than an hour ago and this is so nice. To be able to post without the fear of a leash around my neck, and to feel like my posts aren't being algorithmically promoted and demoted. It's like the good old days when we got on the internet with an AOL diskette and a shrill screaming modem. The days of a level playing field.",
				"added": 1565213445
			},
			{
				"comment_id": 4,
				"body": "> [datswaycist](#comment_1_1BFTaWPZXtujiULmZsh5cufN9mj9yXaAXA): Every time a shooting happens, they literally blame the victims.  The MSM are the cesspools of hatred.  F them all right in the goat ass.  This is about control.\n\nI think the best thing we can *actively* do something about the MSM is to talk to every norp friend and family member and get them to see reason. It's difficult and stressful, (I've done it and it took me a year to bring mom around) but it sure beats having to join or be drafted into an army.",
				"added": 1565213727
			},
			{
				"comment_id": 5,
				"body": "> [datswaycist](#comment_1_1BFTaWPZXtujiULmZsh5cufN9mj9yXaAXA): Every time a shooting happens, they literally blame the victims.  The MSM are the cesspools of hatred.  F them all right in the goat ass.  This is about control.\n\nYou have to \"unspin\" everyone you know. Let them know that the MSM is *not there for their benefit*. That the MSM is there to deliver them to ads, and not to deliver impartial, factual journalism. It doesn't have to be about political leanings or \"sides\". Expose the filthy smear merchants for what they are. This is something you're doing for the people you care about, like telling them that it's not a good idea to Western Union money to Mr. Ukele Mbembe who is a prince trying to get a gorillion dollars out of his country.",
				"added": 1565213969
			},
			{
				"comment_id": 6,
				"body": "> [12345679](#comment_3_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): \n\n> Just make your own platforms\n> zeronet\n> Wacism",
				"added": 1565214013
			}
		],
		"1565214030_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 7,
				"body": "\"no wait, all we have to do is have some algorithms that will automatically promote and demote posts that are tuned to users' tastes and...\"",
				"added": 1565214175
			},
			{
				"comment_id": 8,
				"body": "> [watteau](#comment_9_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): There's hardly anybody here.\n\nContent published to 5/5 peers.",
				"added": 1565215719
			},
			{
				"comment_id": 11,
				"body": "> [xcape2net](#comment_171_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Three months ago, there were 3 to 5 posts per day, and they weren't about being fat or favorite sandwiches.  People talked about interesting and significant things.  The average IQ on ZeroTalk has fallen by 20 points since then.\n\nThat's because you're seeing the regression to the mean.",
				"added": 1565216364
			},
			{
				"comment_id": 14,
				"body": "Well, some sort of sub-category system rather than a single discourse channel would be nice.",
				"added": 1565218574
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 9,
				"body": "> [nickwa](#comment_239_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Want to know why? Try telling people to move off of Chrome, Facebook or any other service. I dare you. They don't, won't, and say \"its fine\". People only move when shit hits the fan.\n\nI got banned from Twitter a year ago. I left Tumblr when they implemented their anti-female-presenting-nipple policies. I just stopped participating in social media altogether. Then I heard about zeronet and was like: \"oh wow, it's like the internet back in the good old days, it's the wild west and there's no centralized platforms yet, no fucking algorithms, it's internet New Game+\"\n\nSo yeah, I only learned about zeronet after it was mentioned during the whole brouhaha but had I learned about it sooner, I would have migrated here sooner.",
				"added": 1565216102
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 10,
				"body": "It's simple. Shit happens. It's part of life. Don't blame God for your lack of preparation for dealing with life.",
				"added": 1565216281
			}
		],
		"1565203721_1MprJ7cBPUTpDquydwCvZGQAbGos8371aa": [
			{
				"comment_id": 12,
				"body": "Oh no, 3D gun parts reeeeeee!!!!!!",
				"added": 1565216995
			},
			{
				"comment_id": 13,
				"body": "> [nickwa](#comment_242_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Its already on ZeroUp.\n\nSomebody call James Randi, I'm gonna git me $2,000,000!!!!",
				"added": 1565217120
			}
		],
		"1565218244_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 15,
				"body": "> [kaffie](#comment_877_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Sites by default are limited to 10 mb and have to ask the user permission to be larger. Users can set their size limit to be higher/lower. [...]\n\nThanks for the heads up. Now I just have to figure out how to tag an image as 'optional' in ZeroBlog. I'd Google it, but uh, y'know...",
				"added": 1565237406
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 16,
				"body": "\"Hate speech\" is any speech that is critical of people who use the term (or their protected groups).",
				"added": 1565259316
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 17,
				"body": "> [steelmemes](#comment_23_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): \"do you think that it will also get non-8chan users to join as well?\" [...]\n\nI'm a non 8chan user. I'm actually just a disenfranchised user who had over 1k followers on Twitter who was banned from the platform, had been a longtime tumblr poster of drawing tutorials and art before their TOS shitfest, and have been steadily watching the decline of YouTube (I have a channel with over 29k followers) and Twitch. I'm a content creator who is just sick of what is going on with the platforms and I'm yearning for the old wild west days of the internet when it came on AOL floppy diskettes.",
				"added": 1565312262
			},
			{
				"comment_id": 18,
				"body": "> [steelmemes](#comment_23_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg): \"do you think that it will also get non-8chan users to join as well?\" [...]\n\nI'm so tired of the algorithms which have been put in place to manipulate all the social media feeds on the clearnet, skewed search results, and all the tracking and selling of information as well as TOS tomfoolery, deplatforming over offsite behaviour, and now I'm here. There's a lot fewer people here, sure, but I'm just happy to be a content creator on a level playing field and in a place that is free from centralized manipulation.",
				"added": 1565312450
			},
			{
				"comment_id": 19,
				"body": "\"Vilify that which you cannot control.\"",
				"added": 1565312491
			}
		],
		"1565288635_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 20,
				"body": "\"The hacker known as Anonymous...\" [Exploding van intensifies]",
				"added": 1565312627
			},
			{
				"comment_id": 21,
				"body": "> [nickwa](#comment_263_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): These last few days have been so funny with these journalists.\n\nJournalists? More like URINALISTS, amirite?\n\nEven my mom knows they're just a bunch of filthy smear merchants. Keep your loved ones in the loop, people. If there's a fire in the house, rouse them from their slumber. If swindlers are at the door, drive them away. Take care of your own. Have hard conversations with them and show them the truth.",
				"added": 1565312860
			},
			{
				"comment_id": 22,
				"body": "> [nickwa](#comment_269_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Do I see a thequartering fan? Might be mistaken, but I think he adopted the term(Not sure).\n\nGuilty as charged",
				"added": 1565315301
			}
		],
		"1565316580_1M22W5y2dJC9sETmnr7rsvMZptXMBrfXv8": [
			{
				"comment_id": 23,
				"body": "You can buy it direct from the developer!\n\nhttps://www.ableton.com/en/shop/live/",
				"added": 1565316660
			},
			{
				"comment_id": 24,
				"body": "> [zeronacho](#comment_2_1M22W5y2dJC9sETmnr7rsvMZptXMBrfXv8): fuck the police\n\nOhhhh is it that FTP protocol I hear all the cool kids are using these days?\n\nOr, you could try LMMS, which is free and open-source!\n\nhttps://lmms.io/",
				"added": 1565317339
			}
		],
		"1565305639_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 25,
				"body": "I've seen things you people wouldn't believe\nFlame wars off the shoulder of ZeroTalk\nI watched C-words hurled over Twitter in the dark corners of the internet during GamerGate\nAll those moments will be lost in time, like tears in rain.\nTime to die.",
				"added": 1565317713
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 26,
				"body": "> [polanon](#comment_1_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE): Oh no, they got our network digits, well this is it guys, see you all in the gas chambers.\n\nThey've been trying to gaslight us to death since the beginning of their existence.",
				"added": 1565430324
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 27,
				"body": "> YOU HAD ONE JOB\n\nOfficers placed in charge of a man on suicide watch should be held liable if the man succeeds in committing suicide. They should all lose their jobs, along with the people who placed them in charge.\n\nThey should also be monitored for receiving payouts for the rest of their natural lives and not allowed to leave the country.",
				"added": 1565479648
			},
			{
				"comment_id": 28,
				"body": "> [almostsoul](#comment_4_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): ...and the \"security camera malfunctioning\" thing is so on the nose, \n\n\"Security camera malfunctioning\" HA! How convenient. Was anyone even WATCHING the damned thing?",
				"added": 1565480059
			},
			{
				"comment_id": 34,
				"body": "> [kaffie](#comment_982_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The security camera coincidentally malfunctioned, and he coincidentally had a heart attack when he hung himself. Because that happens all the time for people who were about to expose a bunch of stuff about the political elite, right?\n\nI'm surprised he didn't shoot himself twice in the back of the head, fall down a set of stairs, poison himself, throw himself into icy water, intravenously consume large quantities of cyanide, fall from a tremendous height and allow himself to be mauled by an extremely rare and endangered (and possibly extinct) wild animal all within his own cell.",
				"added": 1565490836
			},
			{
				"comment_id": 35,
				"body": "> [port220irq5dma1](#comment_34_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz): I'm surprised he didn't shoot himself twice in the back of the head, fall down a set of stairs, poison himself, throw himself into icy water, intravenously consume large quantities of cyanide, fall from a tremendous height and allow himself to be mauled by an extremely rare and endangered (and possibly extinct) wild animal all within his own cell.\n\nIt probably won't be long before all of his guards are also found dead, having suffocated to death after being crushed by enormous quantities of money from an unknown donor.",
				"added": 1565491009
			},
			{
				"comment_id": 36,
				"body": "BTW, case closed! Nothing to see here! Not to worry! The FBI* has launched an investigation involving large quantities of incendiary compounds to be used in the \"preservation\" of his estate and all evidence.\n\n*FBI = Federal Bureau of Incineration",
				"added": 1565491086
			},
			{
				"comment_id": 37,
				"body": "> [watteau](#comment_37_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): I think it's sad really, he didn't deserve to die.\n\nYes, it's quite a shame. The opportunity for perpetual anal torture and mutilation by his victims has been forever lost.",
				"added": 1565556107
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 29,
				"body": "> [bigbadbob](#comment_153_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): There is a possibility he did suicide and was giving the option.   I have no doubts his life was fact beyond repair.\n\nHe was a billionaire. There's nothing a few billion can't fix except a hung neck.",
				"added": 1565480121
			},
			{
				"comment_id": 30,
				"body": "> [hdidnothingwrong](#comment_9_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe): He didn't kill himself.  He is receiving plastic surgery and relocating to a country in the middle east.\n\nThey better make his dick unrecognizable while they're at it.",
				"added": 1565480254
			},
			{
				"comment_id": 31,
				"body": "> [bigbadbob](#comment_158_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): the possibilities are endless and truth is stranger than fiction.   When we are presented with a narrative...  The news is no different than an entertaining tv series full of plot twists and cliff hangers.   I bet i could made a news station that no one would ever want to watch...  but that doesnt sell much viagra\n\nThe moment *any* organization (in this case, any news outlet) is funded by many millions or billions of dollars it is impossible for it to remain impartial and/or apolitical. All that money represents a concentration of human interest that aims to skew the output of the organization towards its interests.\n\nErgo:\n\nTrust = integrity / (money + personal interests)",
				"added": 1565481063
			},
			{
				"comment_id": 32,
				"body": "Unlike Epstein's neck, there's no limit to how far the MSM will stretch the truth.",
				"added": 1565481631
			}
		],
		"1565463702_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 33,
				"body": "You have to mine the dolphins out of rock with a diamond pickaxe from deep underground.",
				"added": 1565483990
			}
		],
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 38,
				"body": "They need a story really badly because the rent is due, their viewership is dropping and the axe is looming. Won't be long before they're making their own fake accounts so they can get some screenshots of themselves threatening themselves (If they haven't already).\n\nYou can't eat that blue checkmark, and in the end, the blue checkmark just eats you.",
				"added": 1565564477
			},
			{
				"comment_id": 39,
				"body": "> [hggggfff](#comment_1_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y): kelly would be a good fuck\n\nnever stick yer dick in crazy",
				"added": 1565564922
			},
			{
				"comment_id": 40,
				"body": "> [bigbadbob](#comment_196_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Journalist looses shit and suicide bombs themselves... no injuries.\n\nPolice raid Clinton residence and somehow commit suicide during the operation.",
				"added": 1565565086
			},
			{
				"comment_id": 41,
				"body": "> [bigbadbob](#comment_199_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): guess i shouldn't laugh...\n\nI'm sure the Clintons are",
				"added": 1565565651
			}
		],
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 42,
				"body": "Then why wait? You can experience the fall of capitalism all on your very own! Just go out and give everyone poorer than you all of your belongings and move to a third-world country with a communist or socialist regime! Enjoy your new-found equality!",
				"added": 1565605852
			}
		],
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 43,
				"body": "4chan seems  up to me",
				"added": 1565605911
			}
		],
		"1565601152_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 44,
				"body": "I thought you guys were vegans. Sucking dick doesn't count.",
				"added": 1565606024
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 45,
				"body": "Gosh thorburn you need to calm down. You sound like someone with a lot of pent-up sexual frustrations.",
				"added": 1575765186
			},
			{
				"comment_id": 46,
				"body": "@anshorei - yeah, Gab is definitely pulling a tumblr.\n\nI wish that parents would just, I dunno, start parenting and not give their kids internet-connected tablets instead.",
				"added": 1575765320
			},
			{
				"comment_id": 50,
				"body": "> [thorburn](#comment_16_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): There is freedom of speech and freedom of expression, one tends to be associated with oral and written text, while the other tends to relate to visual arts and imagery. Why should a free speech platform be required to publish visually explicit material? There are plenty of platforms dedicated to providing porn junkies with material to waste their lives wanking over!  It's really not a difficult concept to grasp.\n\nThen what happens when it's a political cartoon? What happens if the political cartoon is visually explicit and depicts sexual acts that someone like Jeffrey Epstein totally didn't kill himself?",
				"added": 1575837964
			},
			{
				"comment_id": 52,
				"body": "> [caropc1v3](#comment_4_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T): THERE IS NO HALF FREEDOM. [...]\n\nExactly. I don't want anyone having the power to decide what posts I'm allowed to read or not, because as soon as someone HAS that power, they can never seem to keep their grubby fucking fingers off the kill-switch.\n\nIt's not about \"who gets to wield the Thanos power-glove\" or \"how much power the Thanos power-glove should have\", it's: THE THANOS POWER GLOVE SHOULD NEVER HAVE BEEN BUILT IN THE FIRST PLACE.\n\nPeople who build Internet Thanos Power Gloves are without a doubt, people who have an unhealthy obsession with what goes on in the bathrooms, bedrooms, and minds of private citizens, and every now and then I get to see these moralizing busybodies exposed as the greatest hypocrites and offenders of the crimes they rail against.",
				"added": 1575838944
			}
		],
		"1575704355_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 47,
				"body": "@quantumkitty - The internet tends to expose us to the very best and the very worst of what's out there because what's in the middle just doesn't generate clicks. It gives a very distorted sense of the world - every content creator out there is going to present to you their view of the world, hyper-concentrated for your rapid consumption.\n\nYou've got to have your own goals because working towards your own ends is the only way you're going to get any sense of agency in this world - you have to shape the world that is *local* to you, and not get trapped in the despair of events occurring far away that you're powerless to change.\n\nHave a purpose in life. Steer your life. Change it for the better. People who have no self-agency are in no position to be meddling in the affairs of the world anyways. Don't obsess over things you have no control over - just prepare for them.",
				"added": 1575789854
			},
			{
				"comment_id": 48,
				"body": "> [styromaniac](#comment_1411_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): TheQuartering found a urinalist admitting that he writes articles turning everything into a fake sexist controversy just for the clicks. So the absurd levels of stupidity are more isolated than we thought, plus we know that Anita Sarkeesian and career victims are scammers seeking attention and clout.\n\nYeah, I saw that video - they were literally gloating about how their article had generated clicks and they were getting paid for it, and that was all that mattered.\n\nOh right, and another journalist shoved a Nintendo Switch joycon in their butt and wrote about an article about it.\n\nI'm not even kidding!",
				"added": 1575790025
			},
			{
				"comment_id": 51,
				"body": "> [fke13](#comment_23_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Where's the porn video link to that? I'd love to see a chick riding a game console joystick! At some point the gaming consoles are so archaic technology that \"riding joysticks\" is about the main way to rank them, specially if the joysticks have a vibrating haptic feedback, like the real ones at planes sometimes have.  [...]\n\nIt wasn't a chick, it was Jed Whitaker, who I imagine identifies as a numale.\nHere's a link to an archive of his article in case you don't want to give adclick revenue to the filthy smear merchants:\n\nhttps://archive.is/UkYF0\n\n(original article)\nhttps://motherboard.vice.com/en_us/article/nintendo-switchs-joy-con-sync-issue-is-even-worse-if-you-put-it-in-your-butt",
				"added": 1575838393
			}
		],
		"1575755429_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": [
			{
				"comment_id": 49,
				"body": "> [fractalzoomer](#comment_33_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj): Check out this site. It redirects users to a working zeronet proxy, a server that allows users to view zeronet over a normal internet connection.\n\nThat's too cool! I'll have to bookmark that.",
				"added": 1575790093
			}
		],
		"1576120994_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 53,
				"body": "President's Choice \"The Decadent\", which, in its original form, was a vanilla ice cream with enormous ripples of solid dark chocolate.\n\nSoon afterwards, it was later downgraded to much sparser rods of dark chocolate, and I have not seen it in existence in any form in over a decade.",
				"added": 1576176162
			}
		],
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 54,
				"body": "> [opisafag](#comment_32_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2): I blame mobile for lowering the intellectual barrier of entry so much that even the dumbest people can go on the internet. The floodgates are open. The internet is overrun by idiots using gimped devices.\n\n...and the dumbest people give mobile devices to their children...",
				"added": 1576449669
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 55,
				"body": "I'm opting for DOOR #4: The threat of the coof is real but vastly misrepresented.\n\nHere's the analogy:\n\nThe situation: An armed man is firing at everyone he can find with a suppressed handgun at a shopping mall. His aim isn't the best so he's only hitting people who can't effectively evade such as the elderly or morbidly obese, etc.\n\nHow it has been presented: THERE'S A CRAZY LOON WHO IS KILLING EVERYONE WITH A MINIGUN HIDE YOUR KIDS HIDE YOUR WIFE CAUSE THEY BE SHOOTING ERRYONE OUT HERE AND IN HERE NOBODY IS SAFE REPEAL 2A GIVE US ALL THE POWER BECAUSE WE HAVE TO STOP THE LOON AND IT'S ALL TRUMP'S FAULT AND CHINA WILL SAVE US\n\nThis is not to say that the coof isn't dangerous because it *is*, but you can overexaggerate it and mis-inform or simply not inform people and just throw them breadcrumbs so that their imaginations confuggle it into a million different configurations while you ride the tidal wave of panic to the throne of power.",
				"added": 1610211531
			}
		],
		"1620774403_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": [
			{
				"comment_id": 56,
				"body": "Why the hell weren't they using something like Deep Freeze?",
				"added": 1620978157
			}
		]
	},
	"comment_vote": {
		"6_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"237_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1_1BFTaWPZXtujiULmZsh5cufN9mj9yXaAXA": 1,
		"3_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"113_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"9_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": 1,
		"2_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"1_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_13v75z66xMg9xXt6aJ25gahjDpCNgUooNL": 1,
		"877_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_17eNACixJyYwm14SuyN39diSNqQiXqqrsb": 1,
		"8_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"7_1LFedFTgmtHTfqqMRd4euD7BrVQBzatZUi": 1,
		"19_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"269_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"176_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_1PLaPnEwcMKPkfSJxta8vHr7kXjN7GR82V": 1,
		"2_13zJujgTGXKmoUHGGFazek97zrRwfXtv5g": 1,
		"8_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"17_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"666_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"665_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"30_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"4_1M22W5y2dJC9sETmnr7rsvMZptXMBrfXv8": 1,
		"14_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"1_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE": 1,
		"972_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"927_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"158_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"15_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"5_13oVVVvkDc7ekDw3xkrYVQPiTqLurrrgqN": 1,
		"4_18MDUdh92VJsG3QSLp26TJtvgbJ4KVL3UW": 1,
		"1404_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"450_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1405_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"319_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1406_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"320_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"451_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"321_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1407_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"35_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1408_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"66_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"1259_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"2_166uTRSiJyj6QXVFKqaohJQyZ2aFNuGESS": 1,
		"192_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"1411_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"33_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"24_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"4_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": 1,
		"33_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"462_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"275_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"111_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"4_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"1286_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"53_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1296_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"16_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"3_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"2_14EvrR9QiEpqhQyZDFiftdgAXzNQ1x8XH1": 1,
		"515_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"2_12EuykQ2UeLGq9DNGHWHzEDjJxhmSJpvkG": 1,
		"2851_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": 1,
		"4_18Ag7V81FS6MBiGvgzT3uxRoFJaEoFc9tr": 1,
		"17_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1
	}
}