{
	"title": "La mine",
	"description": "Tout en français",
	"links": "-[La ZeroToile Francophone](http://127.0.0.1:43110/1MNb8vJAyyYEhmn5Lo962DttpGE7NYp4Yp/?Post:7:La+Zer0Toile+Francophone)",
	"next_post_id": 21,
	"demo": false,
	"modified": 1611269471,
	"post": [
		{
			"post_id": 20,
			"title": "Lumière sur ... Keepass",
			"date_published": 1553461457.316,
			"body": "Aujourd'hui je vais vous présenter un outil qui me permet de gérer mes mots de passe au quotidien. Je n'arrivais plus à les retenir. Parfois, sur les sites que je consulte rarement, il m'est arrivé de perdre également mon identifiant.\n\nLes normes de sécurité préconisent en effet de choisir un mot de passe différent pour chaque site web. Ce mot de passe doit comporter suffisamment de caractères et dans l'idéal ne doit pas avoir de signification particulière pour résister aux [attaques par dictionnaire](https://fr.wikipedia.org/wiki/Attaque_par_dictionnaire). Enfin pour bien faire il faut également renouveler tous ces mots de passes régulièrement. C'est pour cela qu'il m'a parut plus sage de les noter. \n\n##Un mot de passe pour les retenir tous\nA la feuille de papier j'ai préféré le conteneur virtuel [chiffré](https://chiffrer.info/)  stocké sur une clé USB que je porte autours du cou 24/7 . Bon je l'enlève pour dormir ne soyons pas parano non plus ;-) . Le côté \"stockage hors-ligne\" est également un plus. Tout matériel connecté à internet doit être considéré comme potentiellement infecté. Par conséquent moins le fichier est accessible longtemps sur de telles machines et plus on réduit l'exposition de ses mots de passe. La meilleur protection contre le décryptage des mots de passe étant de rendre impossible l'accès au contenu chiffré .\n\n C'est là que [keepass](https://keepass.info/) intervient.\n ![capture d'écran keepass](img/articles/keepass.jpg)\nCet outil est open source, et j'y tiens beaucoup car c'est la garantie que si porte-dérobée il y a, l'éditeur ne pourra pas la cacher longtemps. Il est disponible sur Windows et sur Linux. Grâce à keepass il n'est plus nécessaire de ne retenir qu'un seul [mot de passe fiable](https://www.ssi.gouv.fr/guide/mot-de-passe/), les autres sont sauvegardés avec les identifiants par keepass.\n\nLe point fort de ce programme est qu'il permet de préserver une expérience d'utilisation aussi fluide que possible grâce au raccourci \"ctrl+V\" permettant de lancer la saisie automatique du mot de passe. Comme vous pouvez le constater sur la capture d'écran, keepass vous aide à gérer vos mots de passe. Il est capable d'en générer aléatoirement, évalue leur résistance à une attaque par force brute et permet de définir une date d'expiration du mot de passe. L'exécutable est portable ce qui évite d'avoir à tout réinstaller à chaque fois que l'on change de PC. \n\nVoilà vous n'avez plus aucune raison d'utiliser [\"123456\"](https://fr.wikipedia.org/wiki/Liste_des_mots_de_passe_les_plus_courants) ;-) ."
		},
		{
			"post_id": 19,
			"title": "Lumière sur ... syncthing",
			"date_published": 1512510503.061,
			"body": "Syncthing est l'outil que j'utilise depuis maintenant presque un an comme solution de stockage en ligne. Syncthing permet de dupliquer un dossier sur plusieurs ordinateurs et de synchroniser ceux-ci: les modifications faites à ce dossier sur un ordinateur seront répercutées sur les autres . Le tout est chiffré mais la configuration est très simple pour l'utilisateur."
		},
		{
			"post_id": 18,
			"title": "Imprimer sous Windows sur une imprimante partagée par un poste Linux",
			"date_published": 1480533557.985,
			"body": "Aujourd'hui je vais présenter plus une astuce qu'une véritable information. ça peut quand même servir.\n\nMettons que vous ayez un ordinateur. Si si c'est sans doute avec ça que vous lisez ces lignes. En utilisateur averti, vous avez installé Linux dessus car c'est le bien tout ça tout ça... L'imprimante fonctionne (si si...) : tout va bien dans le meilleur des mondes. Seulement voilà : vous (ou votre frère ou tante ... ) possédez également un ordinateur sous Windows pour une raison quelconque et vous souhaiteriez pouvoir imprimer depuis Windows sur l'imprimante partagée en réseau par votre fière distribution Linux.\n\nInternet regorge de tutoriels pour effectuer la manipulation du côté Linux (samba et autres joyeusetés) . Cependant la configuration du côté de Windows n'est pas très explicite. Sachez-le : le pilote à sélectionner sous Windows est \"MS Publisher Color Printer\" et non pas le pilote de votre imprimante! Il se situe dans \"generic\" (ou \"générique\" ou \"Microsoft\"). Et oh miracle, Windows et Linux s'entendent à merveille (si si ..). "
		},
		{
			"post_id": 17,
			"title": "Du python dans du shell",
			"date_published": 1468266620,
			"body": "Ou plus exactement comment exécuter une fonction python depuis un script Shell. Les script shell sont très pratiques dans la vie des linuxiens . Cependant même s'il est puissant, il peut sembler parfois limité ; par exemple il est impossible de faire de l'orienté objet en avec sh ou bash . \n\nOr justement, Python est un langage de script plus souple que le shell, et il arrive que des traitements nécessitant beaucoup de lignes de code en shell soient réalisés en quelques lignes en Python (le contraire est aussi vrai) : il serait donc intéressant de pouvoir étendre les possibilités de notre cher shell à coups de script Python . Le meilleur des deux mondes en quelques sortes.... \n##Le code source\nLe code shell suivant permet d'appeler une fonction Python d'un module avec des paramètres et de récupérer le résultat sous forme de chaîne de caractères. \n>\\#!/bin/sh\n>function call_python() {\n>python << ENDOF\n>import $1 as bibliothèque\n>bibliothèque.$2(\"$3\")\n>ENDOF\n>} \n\nElle s'utilise ainsi : \"call_python nomBibliothèqe nomFonction Paramètre\". Notez qu'il ne faut pas ajouter d'indentation sous peine de ne pas pouvoir exécuter la fonction. Notez également qu'avec un troisième paramètre bien conçu on peut passer plus d'un argument à la fonction Python . \n##Comment ça marche?\nLa première ligne déclare l'interpréteur à utiliser, la seconde et la dernière délimitent la définition de la fonction (jusque là c'est facile ^^ ) . La troisième ligne appel l'interpréteur python en lui passant un fichier créé à la volé (par les chevrons \"<<\")  dont le contenu est délimité par ENDOF (le fait de mettre ce mot juste après les chevrons fait qu'il est considéré comme délimiteur, mais cela fonctionnerais avec toute autre chaîne de caractères...). Le contenu du pseudo fichier passé à l'interpréteur est du code python qui va appeler la fonction de votre choix.\n\nSi vous doutez de l'utilité de cette astuce, n'hésitez pas à le mettre en commentaire, je donnerais un exemple."
		},
		{
			"post_id": 16,
			"title": "Recharger son téléphone à l'hydrogène",
			"date_published": 1466186402.388,
			"body": "Les téléphones portables sont vraiment formidables, au point de devenir de véritables petits ordinateurs personnels. Et plus la technologie avance, plus leur puissance de calcul augmente. Cependant l'autonomie de nos portables ne peut pas en dire autant : il faut dire qu'entre le wi-fi, le Bluetooth, le NFC, et les écrans rétro-éclairés de plus en plus grands, ils ont là de quoi consommer en un instant nos batteries. Et cela malgré une efficacité énergétique des processeurs de plus en plus grande. Ne se laissant pas démonter pour si peu, les fabricants ont d'ailleurs mis sur le marché des batteries portables disposant d'un port USB permettant de recharger 2 à 5 fois nos téléphones en l'absence de prise de courant.\n\nTout cela est très bien mais une batterie ça se décharge en permanence, même au repos (débranchée) . C'est là qu'intervient la pile à hydrogène, prenant en entrée de l'oxygène et de l'hydrogène et produisant du courant et de la vapeur d'eau. Plus de problème de fonte de l'énergie, l'hydrogène reste dans la bouteille quand on ne s'en sert pas. (Bon en fait par un phénomène dit de \"diffusion\", les gaz \"traversent\" les bouteilles mais c'est beaucoup plus lent que la décharge à vide d'une batterie conventionnelle). En particulier l'entreprise horizonfuel propose ses hydrostick permettant de stocker suffisamment d'hydrogène pour restituer 14Wh soit de quoi recharger 4 téléphones portables .\n![hydrostick](img/articles/hydrostick.png)\nCette mini bouteille de gaz utilise le principe de diffusion pour augmenter la capacité de stockage à faible pression. L'énergie électrique est produite à partir de cette cartouche par une pile à combustible où l'on branche d'un côté l'hydrostick et de l'autre son smartphone préféré.\n![Minipack](img/articles/minipack.png)\nLà où c'est très intéressant, c'est que contrairement à d'autres initiatives, ici les cartouches sont réutilisables: il suffit de les remplir de dihydrogène. Et qui plus est le Hydrofuel propose une station de remplissage des hydrostick utilisant une prise de courant et de l'eau déminéralisée! Voilà une initiative des plus écolo-compatible.\n\nHélàs tout n'est pas rose, ce qui est moins bien c'est vous vous en doutez sans doute, le prix : comptez dans les 200€ la pile à hydrogène et deux hydrostick ; la station de recharge coûte quand à elle dans les 500€... "
		},
		{
			"post_id": 14,
			"title": "Quid de la liberté de la presse?",
			"date_published": 1465927668,
			"body": ">_Le principe de la liberté de la presse n’est pas moins essentiel, n’est pas moins sacré que le principe du suffrage universel. Ce sont les deux côtés du même fait. Ces deux principes s’appellent et se complètent réciproquement. La liberté de la presse à côté du suffrage universel, c’est la pensée de tous éclairant le gouvernement de tous. Attenter à l’une, c’est attenter à l’autre » _ **Victor HUGO** .\n\n###Le médias alternatifs\nVous n'êtes pas sans savoir que les médias officiels sont possédés par quelques multi-milliardaires qui usent et abusent de leurs avoirs pour modeler l'opinion politique selon leurs intérêts égoïstes. Fort heureusement il existe de plus en plus de médias indépendants. Ces médias, ne disposant pas des subventions publiques, sont le plus souvent consultables sur internet. On peut citer [Boulevard Voltaire](http://www.bvoltaire.fr/) , [Agence Info Libre](http://www.agenceinfolibre.fr/), [agoravox](http://www.agoravox.fr/), [tvLibertés](http://www.tvlibertes.com/) , [les moutons enragés](http://lesmoutonsenrages.fr/), [reinformation.tv](http://reinformation.tv/), [arretSurImage](http://www.arretsurimages.net/index.php) . La pluspart de ces médias alternatifs vivent des dons des visiteurs ou de manière collaborative (les visiteurs peuvent proposer des articles). N'hésitez pas à proposer en commentaire des sites que j'aurais omi (honte sur moi, je les ajouterais ^^).\n###La vérité n'est jamais toute entière du même côté\nMême les médias qu l'on appelle désormais la \"réinfosphère\" font parfois des erreurs et il convient de vérifier les sources et de multiplier les points de vue pour vous faire un avis objectif de la situation. Ou plus exactement un avis moins catastrophiquement subjectif que ce qu'il serait en vous contentant d'un seul point de vue. D'un autre côté les médias officiels ne se privent pas de modifier les faits (ne serait-ce qu'en passant sous silence une partie de l'information), pour que cela réponde aux intérêts de leur propriétaires... Je me méfie particulièrement des soi-disant \"experts\" présentés comme étant \"objectifs\" ou \"neutre\", qu'on trouve dans tous les journaux officiels et qui sont bien souvent affiliés à tel ou tel parti politique, ou même parfois de tel ou tel groupe de pression (!),somme toute loin de toute neutralité...\n###Zéro0net, nouveau vecteur de la réinformation?\nAvec une architecture auto-adaptative face à la charge (plus les personnes consultent un Zér0site, plus celui-ci est disponible), le Zér0net n'est-il pas une solution pour faciliter le travail des réinformateurs de tous bords? En partie : libérés des contraintes liés à la mise à disposition de l'information, ils peuvent se concentrer sur le fond. Cependant dès lors ils seront tributaires de l'existance de proxy web->Zér0net ou du bon vouloir des internautes de devenir des Zér0nautes. Fort heureusement il existe d'ors et déjà trois proxy gratuits et on ne peut qu'espérer que la communauté des Zér0nautes s'agrandissent."
		},
		{
			"post_id": 13,
			"title": "Comment utiliser un scanner en réseau avec linux",
			"date_published": 1461775707.215,
			"body": "Aujourd'hui je vais vous expliquer comment utiliser un scanner distant avec linux. S'il est aisé de partager une imprimante en réseau, le partage du scanner n'est  prévu ni par les systèmes d'exploitation ni par les pilotes... L'argument avancé étant que partager un scanner dans une autre pièce a peu d'utilité. A mon avis cela permet de partager un scanner entre deux ordinateurs dans une même pièce sans avoir à débrancher les câbles. Heureusement, linux est un système laissant libre cour à l'imagination débordante des bidouilleurs: on peut numériser à distance à l'aide de \"ssh\" et de \"scanimage\" . Pour ceux qui n'apprécient pas trop taper des lignes au pif dans la console, il existe un script qui automatise tout ça .\nVous trouverez le fichier .sh et le fichier de configuration [ici](torrents/numerisation.zip) . ( Et pour les plus débrouillards d'entre-vous, le code source est modifiable et vos améliorations sont les bienvenues ^^  )\n\nComment cela fonctionne-t-il? Le script initialise une connexion ssh sur l'ordinateur connecté au scanner, et exécute à distance l'outil de numérisation en ligne de commande \"scanimage\" dont le flux de sortie est redirigé dans un fichier local. Veillez à modifier le fichier de configuration avec votre propre configuration."
		},
		{
			"post_id": 12,
			"title": "Comment imprimer un livret",
			"date_published": 1459594501.983,
			"body": "Ajourd'hui, dans ce billet hebdomadaire nous n'allons pas parler de système d'exploitation révolutionnaire, mais plutôt d'impression. Les imprimantes de nos jours sont de plus en plus perfectionnées: 3 en un, 4 en 1, 3D,... Et pourtant il y a quelquechose qui reste difficile à faire correctement en 2016: l'impression de livrets. Cette fonction est intégrée dans certains pilotes d'imprimante ou certains logiciels (Acrobat Reader par exemple) mais il suffit que vous ayez du matériel doté de fonctions un peu exotiques (l'impression recto-verso par exemple) ou que vous utilisiez les pilotes libre sous linux [comment ça je n'ai \"qu'à passer sous windows\"? ;-) ] et patatra adieux l'impression en livret. Et bien, plus maintenant ! [Livret](http://www.biotechno.fr/Livret-v0-2.html) est un logiciel open-source fonctionnant sous Windows, Mac OS et Linux permettant de générer le fichier pdf qui va bien à partir de votre fichier pdf d'origine. La force de ce logiciel réside dans les options disponibles: il peut générer le pdf adapté à votre imprimante spécifiquement. Vous avez une imprimante de base? Il vous génère deux fichiers (un recto et un verso) pour que vous n'ayez à lancer que deux impressions. Vous avez une imprimante recto-verso? Il gère l'orientation comme il faut... Peu importe la méthode d'impression, après deux/trois essais vous trouverez le réglage qui convient à votre imprimante. A titre indicatif, il m'a fallu deux essais mais ceux qui n'ont pas envie de lire le manuel (ou qui n'ont pas de chance) pourront tenter le grand schlem des 5 tentatives. \n![capture d'écran](img/articles/livret.png)\nEn plus il est facile à utiliser et tout en français ! Pour le moment on peut uniquement s'en servir avec l'interface graphique mais le développeur travaille sur une version en ligne de commande pour ceux qui aiment le bash =) .\n\nVous pourrez trouver des informations complémentaires sur [framasoft](https://framasoft.org/article4854.html)."
		},
		{
			"post_id": 11,
			"title": "lumière sur... easy2boot",
			"date_published": 1458976193.572,
			"body": "Jusqu'à présent, pour installer plusieurs systèmes il vous fallait plusieurs clés usb ou plusieurs DVD. Mais bon ce n'est pas très pratique... Avec easy2boot (logiciel windows) vous pouvez mettre plusieurs images iso sur une même clé et choisir au démarrage le fichier à démarrer. Gparted? Deepin? Solus? Vous gardez tout ça sur une seule clé USB ! C'est compatible avec toute image bootable ! En fait le logiciel installe un grub configuré comme il faut sur la clé , ce qui permet d'obtenir un menu de démarrage. \n\nLà où c'est très pratique, c'est qu'une fois installé, vous pouvez ajouter ou supprimer des images par simple copie. Il y a enfin plusieurs outils fournis avec le logiciel qui permettent de personnaliser le menu de démarrage (fond d'écran, disposition du menu, etc..).\nVous pouvez télécharger ça sur le [site officiel](http://www.easy2boot.com/)"
		},
		{
			"post_id": 10,
			"title": "Lumière sur... Deepin",
			"date_published": 1458414153.265,
			"body": "Toujours sur le thème des systèmes d'exploitation facile d'accès, parlons d'un système qui m'a été recommandé par un Zér0naute : [Deepin](https://www.deepin.org/download.html). Il s'agit d'une distribution dont le développement est assuré par une entreprise chinoise, basée sur Debian avec un environnement graphique maison : Deepin DE . \n##Pomme\nParlons du bureau: l'inspiration Macintosh, pressentie à l'installation (vous verrez ^^), saute aux yeux une fois arrivé sur le bureau. On retrouve notamment le dock et les coins actifs du fameux ordinateur à la pomme. Sobre et élégante, l'interface Deepin DE a tout pour plaire : elle est légère et réactive même dans virtualbox, les options de configuration sont claires et regroupées dans un panneau latéral (disponible en faisant un clic-droit sur le bureau et en choisissant \"personnaliser\" ).  Il y a même la gestion de plusieurs bureaux si chère à bon nombre de linuxiens (même si je n'ai toujours pas compris à quoi ça servait '^^ ).\n![pomme](img/articles/deepin1.jpg)\n\nAu niveau logiciel, la base Debian aidant, on a potentiellement une bibliothèque de logiciels assez conséquente. Et effectivement la \"logithèque Deepin\" n'a rien à envier aux autres, ça foisonne littéralement. Parmi les logiciels fournis dans le cd de base, on notera Steam (amis joueurs, bienvenue),  WPS office (une sorte de clone chinois de Microsoft Office avec les rubans et tout) , et chrome . Rassurez-vous vous pourrez installer LibreOffice et Firefox depuis la logithèque. Une seule fonction m'a fait défaut: celle permettant de rechercher par nom un programme installé dans le lanceur d’application, cela oblige à faire défiler tous les logiciels pour trouver celui  que l'on cherche.  \n![lanceur](img/articles/deepin2.png)\nLà encore voici une distribution qui se centre sur les besoins du néophyte, et c'est bien ! nous en reparlerons dans un autre billet =) .\n\nSi vous souhaitez le télécharger, je vous recommande de passer par [sourceforge](https://sourceforge.net/projects/deepin/) car leur site est vraiment trop lent."
		},
		{
			"post_id": 9,
			"title": "Pomme",
			"date_published": 1457904384.139,
			"body": "Les pommes sont bonnes"
		},
		{
			"post_id": 7,
			"title": "La Zer0Toile Francophone",
			"date_published": 1611235535,
			"body": "Retrouvez dans ce billet le meilleur de la Zer0Toile Francophone. (sera mis à jour régulièrement) .\n###Les sites sélectionnés\nRetrouvez ici les sites sélectionnés par votre serviteur. De bonne qualité, actifs et bien entendu \"tout en français\" (c'est la devise du blog!). Ces Zer0sites ont été vérifiés le 24 mars 2019.\n <table> <tr> <td>[Le site de JP](http://127.0.0.1:43110/13yp8wuPuYG7rqQXFAL66QjCj8AmhQAfFi/)</td> <td>Site d'un explorateur  de Zér0net.</td> </tr><tr> <td>[ZeroTalk FR](http://127.0.0.1:43110/1Vp5LH4wegCaqeB72yMw2jgNdVm4aR7ET)</td> <td>Le premier forum du Zer0Net en Français!</td> </tr><tr><td>[ZeroChat FR](http://127.0.0.1:43110/fr.0rc.bit/)</td><td>Un salon de discussion 100% français</td></tr><tr><td>[ZeroWikiFR](http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/)</td><td>Un Wiki en Français</td></tr><tr><td>[Zer0net Doc'](http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/fr/)</td><td>La documentation de.. Zér0net.</td></tr><tr><td>[FRChan](http://127.0.0.1:43110/1EcQmE1jrVevv2qJQWjbQNxd4uBHnjnYtQ)</td><td>Collection d'images. Interface en français.</td></tr>\n<tr><td>[ZeroLinuxFr](http://127.0.0.1:43110/1LiNUxfrpUxh2NFq2Lpe9NJm9e9FN2Nt8X/?Home)</td><td> Un faux-miroir-collaboratif-non-officiel de LinuxFr.org.</td></tr>\n</table> \n\n###La FrancoSphère\nToujours tout en français, plein de potentiel. Ces Zer0sites ont été vérifiés le 24 mars 2019. \n <table>\n<tr><td>[OpenUser](http://127.0.0.1:43110/16g8mFUtLsQBM6bPMJ6xEEQWLWAufnzEXA/?Home)</td><td>Un blog sur la technologie</td></tr>\n<tr><td>[AstucesBlog](http://127.0.0.1:43110/1Jk4S2xDVTyZiZmJ71PyDKNiVAyp8gLmRf/?Home)</td><td>Malgrès un titre à consonance anglophone, voici un site proposant des astuces d'informaticien tout en français</td></tr>\n<tr> <td>[ShinraIsAZero](http://127.0.0.1:43110/1BzRecLuaj3SuKDFQ1RXPpaNyUXbVjV89X)</td> <td>Quelques mots en français un peu seuls dans cette marée anglophone </td> </tr>\n<tr> <td>[JP Blog](http://127.0.0.1:43110/1NE4mtFzSyaNb5vEz7zvBUkgjuT8jK8utP/)</td> <td>Blogue \"à propos de tout un peu\" </td> </tr><tr> <td>[Sens3 Blog](http://127.0.0.1:43110/165iakGpfKumVnswq45yUsRh2DD6UjDfMQ/)</td> <td>Blogue traitant de la sécurité des systèmes informatiques. </td> </tr>\n<tr><td>[Anti PV](http://127.0.0.1:43110/15BFj7GM3pRuu7jXztKGx3Y5FsAHhRHmpV/)</td><td>Des arguments pour contester des PVs..</td></tr>\n<tr><td>[Gilets Jaunes FR](http://127.0.0.1:43110/13ikb4nq261Bzkaxc9M7modC8CDwnvmuv1/?Home/)</td><td>Les gilets jaunes en force sur le Zer0net</td></tr>\n<tr><td>[LululatortuE Blog](http://127.0.0.1:43110/1Dq1eABWHbfyFbzhEJH9JDeTbzp4ptc9u)</td><td> Un blogue traitant du climat et des réseaux décentralisés.</td></tr>\n</table>\n\n###D'autres sites également accessibles aux francophones\nPas tout en français mais promis vous ne serez pas perdus.\n<table> <tr><td>[Bible4u](http://127.0.0.1:43110/1BiBLE4U2fLzhr5i2nt1Uxz57CzWktdTSv/index.html)</td><td>La bible sur le darkweb ! Traduite en plusieurs langues dont le français.</td></tr>\n <tr><td>[GiteCenter](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/)</td><td>Un dépôt GIT sur le Zér0net !</td></tr>\n</table>"
		},
		{
			"post_id": 5,
			"title": "Torrents",
			"date_published": 1457690551.776,
			"body": "Vide"
		},
		{
			"post_id": 3,
			"title": "Lumière sur... Solus",
			"date_published": 1457683897.632,
			"body": "[Solus](https://solus-project.com/) est une distribution Linux bien particulière: ses créateurs souhaitent la rendre la plus facile d'accès . Et c'est réussi, elle intègre haut la main la catégorie des distributions que l'on peut sans crainte mettre en les mains de madame Michu.\n\nPour cela ils misent sur une expérience d'utilisation unique : comprenez que seuls les paquets testés, contrôlés et approuvés y sont ajoutés. Dans Solus vous ne trouverez pas quinze versions d'une même bibliothèque pour satisfaire telle ou telle incompatibilité . Tout ce qui est fourni est testé pour être compatible avec les autres éléments du système. \n\n![solus](img/solus.png)\n\nIls le clament haut et fort sur leur site: l'interface est conçue pour l'utilisateur d'aujourd'hui et se concentre sur la simplicité et l'élégance. L'objectif est tenu et \nl'interface graphique \"Budgie\" est épurée, personnalisable juste ce qu'il faut et semblera très familière à nos chers utilisateurs de Windows . Je dirais même plus elle semble après un premier essai rapide plus facile d'accès qu'un Windows moderne.\n\n\nDe même, toujours dans l'optique de faciliter la vie des utilisateurs, l'installation de pilotes propriétaires est prévue dans les outils de configuration . Les créateurs du projet se justifient en annonçant vouloir avant toute chose convaincre les gens d'utiliser un système Linux et non lutter sans discernement contre le logiciel propriétaire . Notons que l'utilisateur a le choix et que si comme chez moi le pilote propriétaire fait freezer en beauté l'écran, il peut sélectionner un pilote alternatif libre.\n\nTout cela ne vient pas sans contre-partie: les créateurs de la distribution annoncent clairement que Solus n'est pas conçue pour fonctionner en tant que serveur et déconseillent cet usage."
		},
		{
			"post_id": 2,
			"title": "Pommes",
			"date_published": 1456905112,
			"body": "Les pommes sont vraiment bonnes à manger."
		},
		{
			"post_id": 1,
			"title": "Bonjour",
			"date_published": 1433033779.604,
			"body": "Bienvenue à la mine.\nBlog en français en cours de construction."
		}
	]
}