{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1589689650,
			"title": "Daily Conversation Thread",
			"body": "A Thread for talking about mundane stuff and how your day was.",
			"added": 1589689649
		},
		{
			"topic_id": 1589945996,
			"title": "Zeronet propaganda",
			"body": "Doing some sort of propaganda/shilling for Zeronet would help adoption.\nAny ideas for spreading It?",
			"added": 1589945994
		}
	],
	"topic_vote": {
		"1590192659_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1
	},
	"next_comment_id": 82,
	"comment": {
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": [
			{
				"comment_id": 1,
				"body": "> [zaron](#comment_91_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Not be a sex addict?? You must not know too many Catholics\n\nAs in?",
				"added": 1589518906
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_2152_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): He's talking about the pedo popes.\n\nI don't think there ever was a pedo pope. Although I wouldn't doubt Francis could be the first.\nAs for the rest of the clergy, there are. But it's not as much as people think It is.\nMore likely to have a pedo teacher.\nClergy is to be chaste. Practicing Believers are usually either chaste, struggle for being chaste, or are married.\nClergy who commit such sin while using God's name are using his name in vain.",
				"added": 1589562509
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2153_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yeah, I think it was Francis visiting satanic ritual events. You'll see him in the Pizzagate Documentary on KopyKate.\n\nPope Francis says heresy after heresy. I hope the bishops get him to leave.\nWith all respect.",
				"added": 1589568436
			}
		],
		"1589536277_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 4,
				"body": "Oh wow, degeneracy in video! Exactly what we needed. After all, this is something rare that you can't find anywhere.",
				"added": 1589647704
			},
			{
				"comment_id": 5,
				"body": "> [eroge](#comment_3_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF): This is only the beginning....in future i will post more rare material! :D\n\nI don't even want to think about what that would be.",
				"added": 1589647868
			},
			{
				"comment_id": 6,
				"body": "> [eroge](#comment_4_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF): if you don't like it don't share it. you can also ban me if you want; the difference from clearnet is that here your opinion have no value for who want to follow me. Here you decide, in clearnet you don't decide at all!\n\nI don't remember trying to censor you. You have as much freedom to share porn as I do to say that it's bullshit and you shouldn't.\nAnd it's not just a matter of me not sharing it. Pornography is dangerous in general and nobody should share or see it.\nNot through censorship, but through understanding that pornography and masturbation are much like having cocaine on you all the time.\nIf I know this and keep quiet, shame on me for my omission. I'd be contributing to transforming people into brainlet coomers who do nothing but masturbate all day and can't do anything better with their lives.",
				"added": 1589659645
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_2160_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Rape fetish... [...]\n\nIs it? I didn't get to open it. Disgusting.\nYou don't commit a sin or crime just in act, you do it in your heart. If you look at rape with lust, you have committed rape in your own heart.\n\nBut I say unto you, That whosoever looketh on a woman to lust after her hath committed adultery with her already in his heart.\n\nMatthew 5:28",
				"added": 1589684015
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_2162_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Are you two always on the verge of an inflammatory religious argument? [...]\n\nI'm cool.\nYou don't need the religious argument to notice that fornicators and people who masturbate end up with a bigger risk of becoming addicted coomers who can do nothing else all day.\nMost of the arguments for it are just made up shit to feed the porn industry, which promotes fornication, adultery, addiction, rape and prostitution.",
				"added": 1589685084
			},
			{
				"comment_id": 9,
				"body": "> [blurhy](#comment_495_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): It's you, neet. Masturbation is to relax and relieve your sexual desire\n\nThe body regulates tension on it's own, and sexual tension is a good thing that drives you forward to do better stuff.\nRather, people masturbate and waste the energy they could use on something better.",
				"added": 1589685224
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_2161_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I personally am cutting down on porn consumption, like quitting masturbating. I don't like the abnormality of my own sexual desire anymore than those of others, even though it's 100% legal.\n\nSame. I wish I had never came into contact with this shit. At least I managed to understand how destructive it has been to my body and brain.\nI usually can resist, but I have my times of weakness. I try to pray whenever I feel like doing so, and ask for forgiveness if I fail.\nThe fact that I have so much trouble shows how it's addicting as a drug.",
				"added": 1589685354
			},
			{
				"comment_id": 11,
				"body": "> [blurhy](#comment_496_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Humanity is born to be good at having sex, as evolution theory suggests\n\nMasturbation is negative for reproduction too. It's a waste of seed and it decreases sexual tension (leaving you not to want to reproduce).\nYou might have noticed animals don't really masturbate, other than a few monkey individuals and maybe some others.",
				"added": 1589685547
			},
			{
				"comment_id": 12,
				"body": "> [blurhy](#comment_497_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Yeah, you can try not eating, which is also addicting\n\nWell, it is. I also must hold off from eating, as I frequently eat more than I should (usually from anxiety).\nThese things are not good for you. Most people who do engage in such actions in exaggerations will regret it in some way, such as going overweight.\nIt's called gluttony, eating more than you need and should. The solution is fasting, not eating what you don't need.",
				"added": 1589685691
			},
			{
				"comment_id": 13,
				"body": "> [blurhy](#comment_498_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): It does not waste anything, because new seed is generated everyday whether you have sex or not\n\nYou waste it as you throw it away instead of using it for procreation.\nSexual activity also reduces testosterone production. Doing so without procreating will increase your chances of not having babies and just jerking off in your basement all day, like many coomers do.",
				"added": 1589685832
			},
			{
				"comment_id": 14,
				"body": "> [blurhy](#comment_499_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Be more ambitious and try holding your breath, which is more addicting. You retard are addicted to oxygen.\n\nAddiction is different from necessity.\nYou need food to live, you don't need to be filling yourself up with bad food all day to live (and it will kill you).\nBut yes, breathing slowly is good.",
				"added": 1589685945
			},
			{
				"comment_id": 15,
				"body": "> [blurhy](#comment_500_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Eating is not neccesary, as you said ? Breathing is ?\n\nRead again.",
				"added": 1589686006
			},
			{
				"comment_id": 16,
				"body": "> [blurhy](#comment_501_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): It does not matter, as I don't approve of masturbating too much either, which is REASONABLE\n\nGood. Stay that way, I'd be sad if you got addicted to it. Then the problem is what we consider \"too much\".",
				"added": 1589686246
			},
			{
				"comment_id": 17,
				"body": "> [blurhy](#comment_502_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): You can't\n\nCan't what?",
				"added": 1589686339
			},
			{
				"comment_id": 18,
				"body": "> [blurhy](#comment_503_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Defining how much is reasonable needs to someone\n\nMy general advice would be to, at least, take it to a minimum, when you can't hold it off, and without pornography.\nMy better advice would be not to do it, as it does not cultivates good emotions. Only lust, greed, gluttony, laziness, selfishness and addiction. Either be chaste or get married and be with your wife.",
				"added": 1589686605
			},
			{
				"comment_id": 19,
				"body": "> [blurhy](#comment_504_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): It does produce these effects to YOU. Instead, it makes me feel relaxed and nothing negative\n\nIt's something general. You might not notice it, or you are, gladly, not exaggerating on your act.\nBut don't get into porn. Nothing good can come out of it. Your brain easily gets addicted. You won't be able to stop it easily, and you'll crave for more, and for weirder stuff.\nDon't get me started on perversion. Stuff such as rape fetishes, adultery, pedophilia (which includes lolicon) and others aberrations.",
				"added": 1589687053
			},
			{
				"comment_id": 20,
				"body": "> [blurhy](#comment_506_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Even if is, the reason is you guys propagating it as guility activity\n\nIf you refer to Catholicism, yes. We consider it to be harmful to yourself, a selfish act, and something that displeases God. It is a sin, and the way to deal with any sin is to notice it, repent and ask for forgiveness from  God, who forgives you and washes your sin. Then it's on you to forgive yourself and not sin again.\nWe don't have any shame of our gospel.",
				"added": 1589687519
			},
			{
				"comment_id": 21,
				"body": "> [blurhy](#comment_507_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Porn does not mean to be these crazy things like you assume\n\nWell, any sort of pornography implies adultery. You commit adultery in your heart as you lust after a woman who is not yours.",
				"added": 1589687542
			},
			{
				"comment_id": 22,
				"body": "> [blurhy](#comment_508_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): How can I commit adultery with a hentai character\n\nBeing fictional does not stop your heart from having the same lustful sensations. The same way somebody who lusts after a lolicon character is, indeed, lusting after the image of a Child.",
				"added": 1589687657
			},
			{
				"comment_id": 23,
				"body": "> [blurhy](#comment_510_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Wrong, it is imagination.\n\nYes, you are imagining a Child in a sexual way, and desiring that child in a sexual way. And you'd likely want to be with a child in that sexual way, and do sexual things to that child.\nHow is it not lusting after a child through the image of a child, then?\nIf you are consuming this kind of stuff, I advise you to stop and not go further.",
				"added": 1589688329
			},
			{
				"comment_id": 24,
				"body": "> [blurhy](#comment_512_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Child porn is only a part of hentai. Why don't you argue on a wider sense ?\n\nI already did. Looking at a woman on the streets with lust is a form of adultery, much more it is to watch porn.\nAlso, there are many more forms of perversion in anime stuff. The Japanese seem to have a thing for rape.",
				"added": 1589689002
			},
			{
				"comment_id": 25,
				"body": "> [blurhy](#comment_513_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): You failed. All characters in hentai are fictional\n\nWhat did you quote?\nAlso, it doesn't matter if it's fictional or not. What matters is what is in your heart, what drives you to see pornography, and what keeps you in there.",
				"added": 1589689085
			},
			{
				"comment_id": 26,
				"body": "> [blurhy](#comment_514_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): It is not related\n\nHow so? Most hentai is twisted in some way. Even the most normal of them have some sort of rape reference, such as the way people talk (or moan).",
				"added": 1589689150
			},
			{
				"comment_id": 27,
				"body": "> [blurhy](#comment_516_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Even if you were correct, few of them would commit rape. They relieve the desire by watching hentai.\n\nNot really. All of this just makes the person more and more engulfed in their addiction and perversion, even thinking it might be acceptable to do so (because it's all just fictional).\nMost people who do commit such things usually already used to watch a lot of pornography on the topic.\nMost child rapists do watch (and make) a lot of child porn.",
				"added": 1589689392
			},
			{
				"comment_id": 28,
				"body": "> [blurhy](#comment_515_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): So what. After watching hentai, the woman in your heart can be anyone, which is not 'guility' at all\n\nI don't think I understood what you meant, can you be clearer, please?",
				"added": 1589689458
			},
			{
				"comment_id": 29,
				"body": "> [blurhy](#comment_517_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Most child rapists do watch a lot of child porn. [...]\n\nWhy?",
				"added": 1589689532
			},
			{
				"comment_id": 31,
				"body": "> [blurhy](#comment_518_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Most child rapist watch child porn does not mean that most child porn wathchers are rapist\n\nIt does mean that it's an incentive, as they engulf themselves in that desire.\nAs a saying goes around here, **Quem treina, Joga** (He who practices, plays).",
				"added": 1589689851
			},
			{
				"comment_id": 32,
				"body": "> [eroge](#comment_7_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF): My clips are 100% legal, filmed with celebs and taken from mainstream movies (very often not-porn ones).Maybe are taken from the same movie that you watched with your wife yesterday, anyway almost all my clips are well seeded now; because someone are interested! (but here you almost all are \"against\" my material, hypocrites!)\n\nWatching a normal movie that might contain porn, and watching a porn movie for the sake of lust are different.\nIntention matters.\nI can assure you that I did not click on the link.",
				"added": 1589690010
			},
			{
				"comment_id": 35,
				"body": "> [blurhy](#comment_520_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): So what, this can NOT be a reason why hentai is a cause of rape.As I said, people don't become rapists after watching hentai, and rapists are always rapists\n\nHentai itself is not. The desire that a person has, and that is not fulfilled, but strengthened by pornography, is a great factor.",
				"added": 1589690408
			},
			{
				"comment_id": 36,
				"body": "> [blurhy](#comment_520_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): So what, this can NOT be a reason why hentai is a cause of rape.As I said, people don't become rapists after watching hentai, and rapists are always rapists\n\nThis is wrong. Not everybody who does evil has always been so.\nWe are behavioral beings, we behave to our environment. \nEnvironments that pushes people forward sexual perversion are likely to get them to be sexually perverted. And sexual perversion, plus other factors, lead to violence.\nA person has the power to fight that off, but people are weak and cannot do it easily.\nIt's even worse when others say it's normal, and even good, to be perverted.",
				"added": 1589690536
			},
			{
				"comment_id": 38,
				"body": "> [blurhy](#comment_521_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): You'd better learn about what caused child rapist to be so. I don't have the time to read your bullshit anymore.\n\nDo as you please, brother. Just take care of yourself.",
				"added": 1589691335
			},
			{
				"comment_id": 53,
				"body": "> [subutai](#comment_7_16FFktck2XiA33aQcarrqPA8XzK3coaUBD): Porn is easily accessible on the normal internet. I assume the true value of this ZeroNet is that you can express yourself in an uncensored way  without the worry of things being removed.  [...]\n\nThe issue with these networks are that, usually, people who get banned for posting shit and spamming tend to come to them, and they keep everybody with good things to share out, leaving just weird porn and spam.\nI think this is the only that didn't become a mess. Gotta keep an eye out not to let it become a mess too.\nWhen they wanted to make a reddit alternative, they made voat. It instantly got full of retarded shit, and nobody used it, and it got taken down. At that point, just use some IB.",
				"added": 1590100641
			}
		],
		"1589689650_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 30,
				"body": "How's everything, @blurhy: @styromaniac: @edgelordofdecent: ?\nI don't remember if this is how you quote people.",
				"added": 1589689707
			},
			{
				"comment_id": 33,
				"body": "> [styromaniac](#comment_2166_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Just passing time. [...]\n\n\\>and \\\\\\> for non-green greentext",
				"added": 1589690132
			},
			{
				"comment_id": 34,
				"body": "Wish my computer's power supply hadn't broken. It did a bit before after the quarantine got serious.\nI might try to fix it some other day, for now I'm using the laptop that I used as a NAS.\nShit's serious here. Both the virus infection and death rate, and the extreme measures being taken by the local governments.",
				"added": 1589690238
			},
			{
				"comment_id": 37,
				"body": "We're on number 4 here, 233 thousand cases. Managed to get worse than Spain and Italy.",
				"added": 1589690985
			},
			{
				"comment_id": 39,
				"body": "> [adrenochrome](#comment_7_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): Zeronet should update posting features to be able to add picures or animations.\n\nThere's Geekless' Zerotalk++, but that's still under development. You can just link them, though.",
				"added": 1589705588
			},
			{
				"comment_id": 40,
				"body": "\\>adrenochrome\nJust noticed the name.",
				"added": 1589708048
			}
		],
		"1589714892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 41,
				"body": "Something more important. Are you still alive?",
				"added": 1589750222
			},
			{
				"comment_id": 44,
				"body": "Utopia is dystopia.",
				"added": 1589950633
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 42,
				"body": "I have tried advertising It on local imageboards, but most don't care and say it's paid shilling.",
				"added": 1589950436
			},
			{
				"comment_id": 46,
				"body": "One basic thing is a way to sync and backup users.json with the press of a button. People won't really give a shit about zeronet while losing an account is so easy.",
				"added": 1589995212
			},
			{
				"comment_id": 47,
				"body": "> [cexy](#comment_6_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): @sabutai you are the samurai [...]\n\nThe correct way to quote people is @sabutai: .",
				"added": 1589995238
			},
			{
				"comment_id": 48,
				"body": "> [cexy](#comment_6_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL):  I allow and approve of the following methods: deception* , lying, provocation, exploitation, use of false identity \n\nFor what? For doing propaganda for Zeronet?",
				"added": 1589995309
			},
			{
				"comment_id": 49,
				"body": "I do not aprove of lies and deceiving. We can easily spread this by showing features on the public, and with personal stories about it.\nMaybe we can use @zeroseed: 's [public proxy](https://0net-preview.duckdns.org) as well, so people can test it before installing.\nWhat would really help adoption would be to have a JS implementation that you could run on an extension, just like JS-IPFS (you install an extension, click JS implementation and you have IPFS). I think something like this is already being developed.\nMaking some images on gimp or something showing features would also help.\nI think that the biggest selling point isn't even the no censorship part. Although many will come for this, I think that what will attract people more is how easy it is to create and share a website here.\nAlso, Zeronet should have an easy to toggle public blocklist on the homepage, and ask users about it on their first use. This will help prevent newbies from stumbling upon bad stuff.",
				"added": 1589999367
			},
			{
				"comment_id": 50,
				"body": "The fact that these companies lie to us do not give rights for us to lie to other people who have nothing to do with it.\nIf we use dishonest advertising, we won't be \"getting back at Intel\", we will be participating on the mistreating of end users. Attacking Y because X attacked you is not self defense, self defense is attacking X because X attacked you.",
				"added": 1590011974
			},
			{
				"comment_id": 51,
				"body": "Also, Zeronet is not as glitchy as people say it is. For me, it has been working fine mostly. Been using it daily, got my songs in here, I like it overall.\nI fucked up my ZeroMe yesterday, but it was my own doing. I was messing with the files in the data directory to test something.\nIt just needs some modifications to be better. By far it's what works the best.\nWhat zeronet, just like most free software projects, needs, is to people to actually get to know it exists.\nI don't remember seeing advertisement for any of this stuff anywhere before, have you? At max niche places.",
				"added": 1590012028
			},
			{
				"comment_id": 64,
				"body": "> [z0net](#comment_55_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): There are a ton of disinfo agents on here spreading FUD about the platform. It's not perfect but more than functional for the purpose it was meant to serve. Thank goodness for the mute button.\n\nWould make sense then, as that person is advising us to lie and deceive in order to spread this network, which would only reduce trust.",
				"added": 1590197902
			},
			{
				"comment_id": 78,
				"body": "> [nzogth](#comment_9_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a): Driud expressed it best when he said that Zeronet is a network of redundancy, not one of anonymity. [...]\n\nYeah, people talk about zeronet like it's a tor replacement or some shit.",
				"added": 1594151679
			},
			{
				"comment_id": 79,
				"body": "> [blurhy](#comment_539_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): We don't need propaganda if something is good enough\n\nEven if it's great, if nobody spreads it, nobody will know it exists",
				"added": 1594236654
			},
			{
				"comment_id": 80,
				"body": "> [blurhy](#comment_541_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): @aassddff Do you assume people are dumb ?\n\nHow are you going to know about something if it's completely hidden?\nWhy do you think companies invest millions in marketing? If it wasn't necessary, they wouldn't waste the money.",
				"added": 1594392675
			},
			{
				"comment_id": 81,
				"body": "> [blurhy](#comment_544_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): You are completely hidden, but I'm sure you are RETARDED. [...]\n\nChill down. I feel like you're completely obsessed with religion and can't talk with me about anything else.",
				"added": 1594568022
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 43,
				"body": "There are some things that are not meant to be archived, do no good in being archived, and should not be archived.\nNot every information is good and worth protecting, and I recommend you look for help about this rape obsession of yours.",
				"added": 1589950598
			},
			{
				"comment_id": 45,
				"body": "> [simulacra](#comment_2_16uy6uM8EwaNj2kDRLFSTqQNGauZ9D1qAZ): This is probably the dumbest shit I've read in a while - you can't trust anyone to draw the line on what should be archived and what shouldn't. The minute you do that you get the current state of the web.\n\nOne thing is you deciding not to archive, another thing is to have it censored. I have said that people should notice that there are stuff that should be left to be forgotten.\nOf course there is a line. Morality is a thing. And if a person can't draw the line themselves and see they shouldn't share something, they should study philosophy on morality for a while.\nOr do you think that we should also archive Child Porn as so to preserve information? I wouldn't think highly of a \"Child Porn Archiver\".\nFor instance, imagine that a picture or video of you in an intimate situation would leak. Do you think it would be correct for people to \"archive\" that for securing information?\nIf it was about archiving movie rape scenes, you could archive the whole movie or make a list of the movies which contain rape. Getting the rape scenes, which is what eroge said he was doing, just seems like an excuse to have realistic rape porn with the excuse of preserving information.",
				"added": 1589993885
			},
			{
				"comment_id": 60,
				"body": "> [nekololi](#comment_462_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): where did eroge say such a thing? all i see is him archiving the games in their entirety.\n\nIn another topic.",
				"added": 1590172630
			}
		],
		"1590009749_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 52,
				"body": "Literally just go to your data folder and \"cp -r $siteaddress $destination\".",
				"added": 1590012529
			}
		],
		"1590076293_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 54,
				"body": "The Clearnet is a honeypot.",
				"added": 1590101085
			},
			{
				"comment_id": 58,
				"body": "Easier to say that X is a honeypot with backdoors than to prove that it truly is.\nIt's like people forcing the idea that Tor isn't safe because the US Navy made it. Obvious CIA tactic to get less people to use tor.",
				"added": 1590112068
			}
		],
		"1587791009_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 55,
				"body": "> [cexy](#comment_12_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): I AM CALLING OUT!!! There are two options: [...]\n\nAre you from Iran?",
				"added": 1590101368
			},
			{
				"comment_id": 59,
				"body": "I don't take the word \"fake news\" and \"conspiracy theory\" seriously. Just gotta look how Pizzagate was taken as a conspiracy theory and there are no investigations on this \"fake news story\".",
				"added": 1590113994
			}
		],
		"1590015602_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 56,
				"body": "He doesn't seem to appear much here, or answer mail. I had to figure out how to delete my own posts here myself, as he wasn't answering when I asked for a limit raise.",
				"added": 1590101474
			},
			{
				"comment_id": 57,
				"body": "> [tnytuqsgqnywmecj](#comment_29_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): Zeronet does not seem to be growing!\n\nSeems to have stalled a bit.",
				"added": 1590109278
			},
			{
				"comment_id": 62,
				"body": "> [tnytuqsgqnywmecj](#comment_32_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): Beaker Browser almost seems a better solution!\n\nThe fact that it's tied to a browser is pretty annoying. And I still feel like Zeronet is more solid.",
				"added": 1590188474
			}
		],
		"1590079338_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 61,
				"body": ">very liberal \nI like Iran, but Cringe.",
				"added": 1590172922
			}
		],
		"1590192659_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 63,
				"body": "Based Inquisitor.",
				"added": 1590197438
			},
			{
				"comment_id": 65,
				"body": "> [bigbadbob](#comment_1080_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): We all have a mute button to use at our own discretion.  Do we really need to censor people by adding them to a block list?Free speech is a value we all share so perhaps we should reserve the block lists for illegal content as opposed to people who might have annoying opinions.  Shills and spammers can easily be blocked should they become annoying to the individual.\n\nThere's a difference between censorship and boycott/muting. Also, site owners should surely censor some sorts of stuff. Mainly pedo shit, other perversions and crime; but I'm all in for shutting the CIA glowies down too.\nFreedom means freedom to get what you dislike out of your own house too.\nZeronet's purpose is to have censorship resistant websites, as in, not having some government agency shutting you down, and not getting you dependent on the service of companies that can shut down the service in boycott. \nIt's not about having comments inside people's own websites to be not censored.",
				"added": 1590199123
			},
			{
				"comment_id": 66,
				"body": "By the way, Styro, any way I can turn some of the blocks off in Moab?",
				"added": 1590200140
			},
			{
				"comment_id": 67,
				"body": "> [styromaniac](#comment_2224_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've decided that shilling shouldn't be a reason to be on MOAB. [...]\n\nAnti-CIA Inquisition time?",
				"added": 1590252712
			}
		],
		"1591633616_17kfQsU2wofPg9sM1smPiny9K1yzLc7Pux": [
			{
				"comment_id": 69,
				"body": "So, now we got a spammer to make people think this is a place for invading  the stuff of other people?\n5 or so posts in a row about this\n@styromaniac:",
				"added": 1591637352
			}
		],
		"1591512859_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 70,
				"body": "It will be annexed by Mexico, Patria Grande",
				"added": 1591637484
			}
		],
		"1591403223_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 71,
				"body": "Antifa people are just teenagers and young adults that spend all their day talking about killing fascists and the bourgeoisie, burning banks and so on. \nThey are crave for an opportunity to do these things, for a revolution to happen, the only thing they dream about is la revolución.\nHad a bunch of frens there from my commie times.\nI expect worse things from them.",
				"added": 1591637618
			}
		],
		"1592157079_1LZUsLPdv5RUx1VVGP81RyKwiHTfSxgSL1": [
			{
				"comment_id": 73,
				"body": "> [ltl](#comment_1_1Hwnbt8dDk2r2CB8R4tbGTcM4pY4Tp4VMU): I do not agree with you. For example, many christians and jewish orthodox hate members of other religious groups without even knowing them. Some people hates gays even if they do not know any personally. And there are plenty of other examples when hate comes without loving first.\n\nChristian love bears evil, but it does not tolerate it.\nIt does penance for the sins of others, but it is not broadminded about sin.\nThe cry for tolerance never induces it to quench its hatred of the evil philosophies that have entered into contest with the Truth.\nIt forgives the sinner, and it hates the sin; it is unmerciful to the error in his mind.\nThe sinner it will always take back into the bosom of the Mystical Body;\nbut his lie will never be taken into the treasury of His Wisdom.\nReal love involves real hatred:\nwhoever has lost the power of moral indignation and the urge to drive the buyers and sellers from the temples\nhas also lost a living, fervent love of Truth.\nCharity, then, is not a mild philosophy of \"live and let live\";\nit is not a species of sloppy sentiment.\nCharity is the infusion of the Spirit of God,\nwhich makes us love the beautiful and hate the morally ugly.\n\n-Archbishop Fulton Sheen",
				"added": 1592322475
			}
		],
		"1592236427_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": []
	},
	"comment_vote": {
		"20_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"52_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"53_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1
	}
}