{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1561855919_1ABh5GNgSYM9rgGQfbtVpJhYEzmaCCyRVK": [
			{
				"comment_id": 1,
				"body": "Is that a clearnet torrent? If so, I assume MS is going to be gathering IP addresses. Put it on I2P.",
				"added": 1561867672
			},
			{
				"comment_id": 2,
				"body": "> [moor](#comment_145_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): would be hard to seed, make it available before. [...]\nNo idea what this is supposed to mean.",
				"added": 1561875283
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 3,
				"body": "> [pexo](#comment_112_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC):  ZeroNet gets popular and nazis come flooding in. Since they tend to be more active then everyone else the voting activity(or just brute numbers) will crush all competition when it comes to voting. [...]\n\nThere haven't been any Nazis for over 70 years. There are definitely folks here who wanna gas the kikes, though! \\o\n\nI haven't seen any realistic suggestion (though maybe I just missed it) for preventing a situation where you have multiple identities run by one person voting for candidate identities who may all be run by one person, or a few people. Or people voting for themselves with straw identities. \n\nI don't see the requirement that for a vote to be counted, it must have been made by an account that has made \"good\" comments before Jul. 1, operationalized anywhere. What's a \"good\" comment? That guy with the long username that starts with an h is a prolific poster, and he has received upvotes for his posts and comments, but \"he's\" either a bot or a schizophrenic who can't form a coherent sentence. I think everything he posts is spam. Other posters don't.\n\nBut, then, is this really a vote? It's suggested that people should explain why they're voting for the person(s) for whom they're voting. So is there some weighting? And how will that be done? Votes don't usually require explanations. \n\nI checked the ZeroTalk forums for some of the other languages I speak. I didn't see this posted in any of them. Do only English-speakers get to decide the future of this network and the software? Or will they get some information about it in their own languages and an opportunity to vote when we--rightful rulers of ZeroNet by virtue of our knowledge of Ye Glouryous Englisch Langwidge--have hashed out all of the parameters?\n\nIf I were nofish, I'd scuttle this idea, at least without serious modification, and frankly, I'd be pretty offended if it were proposed in this manner without having been run by me first. But maybe he'll think it's peachy.",
				"added": 1562023102
			}
		],
		"1562414209_1CvZDPgKk2p8Uk1ZfJ3hcZb1DzuNJXndhn": [
			{
				"comment_id": 4,
				"body": "We need to start by eliminating global Jewry.",
				"added": 1562444941
			},
			{
				"comment_id": 5,
				"body": "> [redlibertyreal](#comment_16_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): The fuck is wrong with you? These are the same people who say the holocaust didn't happen, yet they advocate doing it again!\n\nThat's a ridiculous statement. There's nothing contradictory in saying that the holocaust didn't happen, but that it should have. Nonetheless, I said nothing about the hollow cost.\n\nRegardless of the historicity of the holocaust, it remains the case that the kikes need to be genocided or, at least, confined to Israel and cut off from the rest of the world.",
				"added": 1562561704
			}
		],
		"1562661334_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 6,
				"body": "No, I'm not going to seed a document by the kike ACLU designed to help various ignorant shitskins invade my country more effectively.",
				"added": 1562714147
			},
			{
				"comment_id": 7,
				"body": "> [kidcourageous](#comment_37_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): If you can add shit to the zip about how to behave in America and documents about how to treat women properly then I'll happily seed, however.\n\nIf they could behave, their countries wouldn't be shitholes. There's nothing magic about the soil of the U.S. that immediately turns people civilized, and there's nothing cursed about the soil of these shitholes like Guatemala and Honduras. The land there is fine. The mountains are fine. The animals are fine. Guatemala is a shithole because it's full of Guatemalans. Moving hundreds of thousands of them here just makes this a shithole, too.\n\nAssimilation? Get real. Democrat presidential candidates are speaking Spanish in the debates, and calling for giving free health care to illegal immigrants, and Beto O'Rourke is calling for decriminalizing illegal border crossings and tearing down the physical barriers that currently exist on the southern border. Hundreds of thousands of people are crossing the border illegally every month. Those are just the ones who are getting caught or turning themselves in: plenty more are slipping through the cracks. The vast majority of those \"people\" will *never* be integrated into American society, let alone assimilated. (BTW, pro-immigration people consider assimilation to be a bad word now. Immigrants are to be integrated into our multicultural mixing-bowl society, not assimilated, you cultural imperialist!) \n\nIn our lifetimes, Hispanics will become the majority in the U.S., and English will become a minority language. If you have to go to the Social Security office when you're old, I hope you speak Spanish, or that they have an English translator on hand that day.\n\nYes, yes, I'm harping on illegal immigrants. B-but what about the legal immigrants?!?\n\nWe don't need them. Countries can produce their own people. It's called fucking and having babies. Instead of incentivizing that, we incentivize people to flood into our country by promising them free health care and telling them that if they sneak their kids in, we'll give them residence permits when they grow up. Fuck that, and fuck every traitor who is enabling the mudslide of immigration that's going to destroy this country.",
				"added": 1562804037
			},
			{
				"comment_id": 8,
				"body": "> [redlibertyreal](#comment_24_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): Fuck off\n\nA brilliant rejoinder. I'll take that as confirmation that you have absolutely no counterargument. \n\nWhen we cleanse this land, traitors like you will get it worse than the mudskins. You'll be made public examples of, and your women will be turned out as whores. \n\nI'm looking forward to it.",
				"added": 1562905449
			},
			{
				"comment_id": 9,
				"body": "> [redlibertyreal](#comment_25_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw):  When our side wins rest assured we will not \"turn your women out as whores\". [...]\nYou'll let your pet Central Americans do it, though. As happens in Germany. As happens in Sweden. You know how disputes are solved in urban Honduras? Not through the courts, but with guns. You know how disputes are solved in rural Honduras? Not through the courts, but with machetes. To say you're an ignorant fool would be an insult to ignorant fools. You're a child, with no understanding of the world around you.",
				"added": 1562909005
			}
		]
	},
	"comment_vote": {}
}