{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1,
			"title": "Noticias en español",
			"body": "Comenta lo que pasa en el mundo y más allá",
			"added": 1470757837
		},
		{
			"topic_id": 2,
			"title": "Real Madrid Fútbol Club (balompié)",
			"body": "Hilo sobre el mejor club del mundo :)",
			"added": 1470758530
		},
		{
			"topic_id": 3,
			"title": "Solicitudes de torrents",
			"body": "Pide aquí tu peli, programa, ebook, música... tal vez alguien te pueda ayudar",
			"added": 1470760032
		},
		{
			"topic_id": 4,
			"title": "Dirección Ip en ZeroNet",
			"body": "Aquí puedes comprabar tu dirección ip:\n\nhttp://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe/       YourIP\n\nhttp://127.0.0.1:43110/181aQJMXV5fTSMFVVWoLwmVSLSb6UZSp1J/      WHATS_My_IP\n\nZeroNet está enfocado a un P2P libre, díficil de cerrar mientras haya peers, blogs de opinión sin censura, etc, pero los que busquen aquí diferentes mierdas constituyentes de delito penal, sepan que sus Ips pueden ser facilmente registradas. \nSi buscas privacidad usa un fiable vpn. Pero si cometes algún delito y se toman las molestias necesarias tampoco esto será una barrera.",
			"added": 1470833889
		},
		{
			"topic_id": 5,
			"title": "XUL remoto - Problemas en páginas de ZeroNet",
			"body": "\"XUL remoto\n\nEsta página usa una tecnología no admitida que ya no está disponible por defecto en Firefox.\n\n    Contacte con los propietarios del sitio web para informarles de este problema.\"\n\nremote XUL\n\nThis page uses an unsupported technology that is no longer available by default in Firefox.\n\n     Contact the website owners to inform them of this problem.",
			"added": 1470869663
		},
		{
			"topic_id": 6,
			"title": "¿Cómo añadir un dominio? ZeroName",
			"body": "Para registrarse sólo tiene que añadir tecla 'zeronet' a su dominio namecoin.\nLa tecla (key) \"\" significa el dominio principal, cualquier otro que es un subdominio. Ejemplo:\n\n {\n    \"name\": {\n        \"formatted\": \"ZeroNet project\"\n    },\n    \"bitcoin\": {\n        \"address\": \"1QDhxQ6PraUZa21ET5fYUCPgdrwBomnFgX\"\n    },\n    \"zeronet\": {\n        \"\": \"1EU1tbG9oC1A8jz2ouVwGZyQ5asrNsE4Vr\", \n        \"blog\": \"1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8\", \n        \"talk\": \"1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\"\n    },\n    \"ns\": [\n       \"ns1.domaincoin.net\"\n       \"ns2.domaincoin.net\"\n    ]\n }\n\nDespués de los cambios confirmados por la red Namecoin el dominio será añadido automáticamente al registro y cualquier persona puede acceder a su sitio mediante el dominio registrado.\n\nPara hacer la página de enlace (ZeroHello) a su dominio del sitio que hay que añadir una clave de \"dominio\" de archivo content.json de su sitio, por ejemplo:\n\n\n {\n  \"address\": \"1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ\", \n  \"background-color\": \"#F5F5F5\", \n  \"description\": \"Decentralized forum demo\", \n  \"domain\": \"Talk.ZeroNetwork.bit\", \n  \"files\": {\n  ...",
			"added": 1470871439
		},
		{
			"topic_id": 7,
			"title": "Riffle, la plataforma online más segura que Tor",
			"body": "El estudiante del MIT Albert Kwon ha desarrollado, junto a la EPFL (Escuela Politécnica Federal de Lausana), una nueva plataforma llamada Riffle que pretende superar las técnicas de Tor. “Tor tiene como objetivo proporcionar la latencia más baja posible, lo que abre las puertas a ciertos ataques” escribió Kwon. “Riffle tiene como objetivo proporcionar tanta resistencia al análisis del tráfico como sea posible”.\n\nAdemás de proteger los mensajes con varias capas de cifrado (la misma técnica de Tor), Riffle añade dos medidas adicionales diseñadas para ponérselo difícil a los atacantes. Por un lado, los servidores cambian aleatoriamente el orden de transferencia de nodos, de forma que nadie pueda espiar el tráfico entrante y saliente usando los metadatos. Por otro lado, los mensajes se envían a todos los servidores a la vez -no solo a uno- y todos ellos están codificados matemáticamente.\n\nEstas técnicas, conocidas como mixnets y dining-cryptographer respectivamente, se conocen desde hace años, pero hasta ahora no se habían aplicado en un mismo sistema. Kwon y su equipo ha logrado superar todas las limitaciones que bloqueaban el desarrollo de esta tecnología y ha compartido todos los detalles técnicos del proyecto en un documento PDF.\nhttp://people.csail.mit.edu/devadas/pubs/riffle.pdf\n\nCon estos cambios, Riffle no solo es resistente a ataques activos y pasivos, también es muy ligero y no emplea demasiado tiempo en procesar la información. Compartir un archivo con cientos de usuarios podría, desde la teoría, alcanzar los 100 Kb/s, pero con un menor uso del ancho de banda se podrían manejar 100.000 usuarios con menos de 10 segundos de latencia.\n\nPor el momento Riffle no se puede descargar, Kwon ha anunciado su intención de depurar el código durante más tiempo. No hay ningún plan para comercializarlo, ni siquiera para sustituir a Tor. Con todo, el estudiante del Mit cree que ambas redes pueden ser compatibles: “Podrían ser complementarias entre sí, aprovechando la seguridad de Riffle y el gran anonimato de Tor”.",
			"added": 1471042310
		},
		{
			"topic_id": 8,
			"title": "ZeroNet's Meta Proxy",
			"body": "https://zero.acelewis.com/",
			"added": 1471042401
		},
		{
			"topic_id": 9,
			"title": "Problemas al arrancar desde zeronet.cmd - solución",
			"body": "Windows no está reconociendo correctamente el Script. \n\nSolución:\nInstalar CCleaner (gratuito), ir a Registro, Buscar problemas, Reparar seleccionadas (no hace falta hacer copia de seguridad).\nEn  CCleaner, ir a Limpiador, seleccionar Sistema (con todo seleccionado menos los accesos directos), Analizar, Ejecutar el limpiador. \nEste último paso es el que realmente resuelve el problema\n\n----------------------------------------------------------\nOtras cosas a tener en cuenta:\nAsegurarse que tu antivirus o cortafuegos no tiene bloqueados archivos de ZeroNet",
			"added": 1471253925
		}
	],
	"topic_vote": {},
	"next_comment_id": 23,
	"comment": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 1,
				"body": "Saludos desde España a toda Latinoamerica",
				"added": 1470678023
			},
			{
				"comment_id": 5,
				"body": "> [rapapobre](#comment_16_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): bienvenido prexxett\n\nGracias",
				"added": 1470734094
			}
		],
		"1_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc": [
			{
				"comment_id": 2,
				"body": "Muchas gracias",
				"added": 1470685421
			}
		],
		"2_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 6,
				"body": "Muy interesante",
				"added": 1470748919
			}
		],
		"1_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y": [
			{
				"comment_id": 7,
				"body": "> [beoxoeb](#comment_1_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa): Siento auténtico terror por que esta maravillosa iniciativa de red descentralizada se convierta en una red de criminales, espero que se les ocurra algo para pararle los pies a psicópatas como tu, vete con tu mierda a otra parte, depravado\n\ntotalmente de acuerdo",
				"added": 1470757648
			}
		],
		"2_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": [
			{
				"comment_id": 8,
				"body": "Hoy toca partido \"Supercopa de Europa 2016\" 09/08/2016\nReal Madrid vs Sevilla 20:45h (hora de España) en Trondheim (Noruega)\n\nSuerte y esfuerzo ¡A por la Supercopa!",
				"added": 1470758756
			},
			{
				"comment_id": 9,
				"body": "Aquí podeís ver gratis el partido y otros acontecimientos deportivos mediante streaming\nhttp://arenavision.in/",
				"added": 1470759132
			},
			{
				"comment_id": 11,
				"body": "¡Campeones de la Supercopa de Europa 2016!",
				"added": 1470780504
			}
		],
		"1_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b": [
			{
				"comment_id": 10,
				"body": "Así transportan los fardos de hierba en Elorrio (Vizcaya)\n\nhttp://www.eitb.eus/es/noticias/curiosidades/detalle/4289906/asi-transportan-fardos-paja-elorrio/\n\nConfunden a muñeca inflable con un ángel caído del cielo\n\nhttp://insolitonoticias.com/confunden-a-muneca-inflable-con-un-angel-caido-del-cielo/\n\nTiene encerrado un fantasma dentro de su IPhone\n\nhttp://insolitonoticias.com/tiene-encerrado-un-fantasma-dentro-de-su-iphone/\n\nTony Greenhand gana fortunas armando porros personalizados\n\nhttp://www.periodismo.com/2016/08/06/gana-fortunas-armando-porros-personalizados/",
				"added": 1470759768
			}
		],
		"1_1C5bCeLcSBkwbJnmMWiqEUvgGLwbyiCaC2": [
			{
				"comment_id": 12,
				"body": "http://127.0.0.1:43110/ZeroTorrent.bit/?Home\n\nAquí puedes subir y encontrar torrents en cualquier idioma. Creo que es mejor que estar separados.",
				"added": 1470780630
			}
		],
		"8_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 13,
				"body": "La ip \"modificada\" sólo es para páginas de ZeroNet (http://127.0.0.1:43110/...) en las restantes sale tu ip real",
				"added": 1470780846
			}
		],
		"39_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 14,
				"body": "Estaría bien si no pierde rapidez, en caso contrario sería desaconsejable. Si va a ser como I2P no hace falta sustitutos sino mejorar el presente.",
				"added": 1470781029
			}
		],
		"1_1GsrTPLoAfhqn8Ds4DDNjYRzupw5inbm9": [
			{
				"comment_id": 15,
				"body": "http://127.0.0.1:43110/13NS3rSzCTpAYtH997rphfZDaWRypyjwnU",
				"added": 1470781655
			}
		],
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 16,
				"body": "Por comentarios en redes sociales",
				"added": 1470783188
			}
		],
		"7_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 17,
				"body": "Interesante",
				"added": 1470783789
			}
		],
		"1_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 18,
				"body": "Interesante",
				"added": 1470784025
			}
		],
		"2_1GtJqyJRsuZhmxVtw5USgvqGbUmVH7EmBD": [
			{
				"comment_id": 19,
				"body": "Mejorar, evolucionar, aumentar contenidos...sí, pero morir no creo",
				"added": 1470784166
			}
		],
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": [
			{
				"comment_id": 20,
				"body": "Yo he añadido algún enlace pero aunque se supone que es en español veo difícil que algunos no sean en inglés.",
				"added": 1470832325
			},
			{
				"comment_id": 21,
				"body": "¿Qué es eso de ZeroMe? ¿será una nueva versión de Zeronet?\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:10_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb/ZeroMe",
				"added": 1470867876
			},
			{
				"comment_id": 22,
				"body": "Nueva versión 0.4.0 de ZeroNet con el nuevo servicio ZeroMe",
				"added": 1470870003
			}
		]
	},
	"comment_vote": {}
}