{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"3_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 1,
				"body": "Простым пользователям можно не боятся писать страшные коментарии, их никто не посадит всем пофигу, а то что вы придумали с обходом сообщения это все дурь, когда вы заходите вк вашь ip связывается со всеми аккаунтами которые вы когда то писали вк, более того даже если вы меняети ip ваши данные компьютера так же записываются в плодь до разрешения экрана. И если даже ip отличается то рядом будет показывать схожие настройки отправителя, какие данные там прописываются. Начиная от провайдера и заканчивая каким браузером вы пользуетесь.\nТак что если кому то надо вас найдут, но вопрос кому вы нужны, даже если вы популярный человек который хочет что то написать и при этом не спалица, в любом случии публикация от левого аккаунта не даст результатов, потому что мало людей знает кто это.\n\nМожно конечно использовать платную рекламу что бы распространить информацию но тогда все кто распространял информацию будут привлечены к ответственности, их начнут спрашивать кто вам заплатил и т.д\nА их аккаунт могут совсем заблокировать что угрожает ихней карьере в интернете.\nИ подводя итоги, какая информация в России может вызвать резонанс, всем насрать, интернет давно стал помойка и тут дела не решаются уже все знают, если кто то кречит то это просто крики но не действия.\nДела решают те у кого есть деньги или большое количество людей, например глобалисты, кто держит сеть чего либо. А люди, что люди, это рабы которые работают за еду, если вам повышают зарплату монополисты повышают цены на еду увеличивая наценку в 200%",
				"added": 1561465660
			},
			{
				"comment_id": 4,
				"body": "> [geekless](#comment_152_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): По 282-й в основном сажают для галки и красивого отчета, а не ради борьбы с оппозицией или активистами. С активистом свяжешься, так может это боком выйти. Обычного гражданина посадить проще.\n\nПочему боком Давыдовича посадили никто даже не пикнул, это легко делает, вначале водят по судам пока деньги у вас есть потом вы опускаете руки и сидите спокойненько.\nНикто за вас заступаться  не будет, максимум родственники но они разве что то могут сделать.\nВ России правит мафия это все знают, пока вы дорогу не переходите можете хоть воровать, но если перешли у вас проблемы",
				"added": 1561467925
			},
			{
				"comment_id": 6,
				"body": "> [ultraviolet](#comment_59_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Попробуйте посадите работника либеральной газеты:-)\n> Будет ли кто-то заступаться зависит от вашего окружения. Математическое сообщество и студенчество МГУ сумело прератить издевательства над Мифтхаковым. Да он сидит в СИЗО но его не убили не запытали.Год назад остановили запрет МПРА.В этом году в двух регионах медики бастовали, тоже угрожали что экстремистами объявят. В Пензенской области бастовали, там где дело Сети идёт и людей ФСБ пытало.  Знаете кто победил?  Медики.Сейчас ещё ожидается забастовка в Орловской области.\n> Добро пожловать в новую реальность.\n\nда это ужасно, но я рекомендую тогда тем кто что то хочет опубликовать меньше об этом говорить и больше действовать, например не нужно писать об этом или опубликовывать от своего имени.\n1 это ничего не даст, только проблемы\n2 у вас может быть плохая репутация в будущем, особенно если вы куда то захотите попасть, вас проверят кто вы и что вы.\nЗначит что касается эффективной борьбы против власти, так это действия, вначале вы внедряетесь туда куда вам нужно попасть, это можно сделать разным способом, но не думайте что это сойдет с рук, надо заранее учитывать что вас поймают. Дальше все просто как только вы завладение информацией с доказательством, не нужно орать на всю страну, первое что вам нужно подумать какую выгоду вы получите или можете получить. Именно выгода вам поможет протолкать дело дальше а окружения которое присоединяется вы им так же говорите что поделитесь если победите. Именно тогда когда все будут знать что вы это делаете ради денег а не ради каких то аномальных целей типо за народ за демократию или за еще какую то хуйню.\nИменно из-за этого вас не смогут посадить, потому что к вам претензий нету, если че не нравится пусть попытаются купить вас. А сколько это будет стоить и сколько враги народа должны потерять это уже вам решать. Если же вы ведете себя как дурачек без выгоды пытаетесь чет доказать, именно так взрослые и будут думать, какой то дурак, они даже денег вам не дадут думая что вы растрезвоните всем кому попала что вам еще и деньги обещали. Так что не будьте дураком делайте все ради цели и скрывайте ее чем другим в данном случае деньгами. Говорите прямо я все делаю за бабки вопросы есть, вопросов нет.\nА то что вас купить нельзя не ваши проблемы пусть платят больше или им пизда",
				"added": 1561470127
			},
			{
				"comment_id": 7,
				"body": "> [ultraviolet](#comment_61_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Боже, хотя я атеист - сколько же дури в головах у людей!\n> Ну куда ты попасть собираешься?   В участковые мусора?  Ну не возьмут тебя туда и что?\n> Вот мне почти сорок. Чего мне опасться что меня куда то не примут на работу?  Топ-менеджером Газпрома или губернатором мне не быть. Не стать мне и прокурором или судьёй. Как был я корпоративным юристом так и буду.Может в разработчики ПО уйду если скучно станет или лифты буду ремонтировать. Люблю паять.\n> У большинства людей нет блистательных перспектив кем то стать. \n> Даже если в многороде живёшь, в крайнем случае уедешь.\n> Единственный путь реально бороться за свои права - коллективное действие. Внедряться ты никуда не внедришься или станешь шестёркой.\n> Ещё раз добро пожаловать в реальность.\n\nПонятное дело туда хер внедришься но сливать инфу которая ничего не сделает тому же чиновнику просто так задаром что бы кто то чет узнал нет смысла, другое дело если у вас чистые доказательство что он так сделал и вы подаете на него в суд после чего говорите что вы опубликуете свои данные не важно какой будет результат в судье. вот тогда судье жопу прещимет, ведь если человек виновен по закону а власть заставляет судью оправдать человека. этому судье будет жопа. Но сейчас эти утырки пошли дальше, они не дают снимать заседания вынесения в суде, а если ведут суд против крупного уебка, вовсе могут забрать камеру или уничтожить запись.\nКароче хотите правосудия заставте судью испытывать нагрев жопы и его слова должны быть задокументированы как и его имя фамилия и отчество. Вопрос как обойти ментов которые отбирают камеры я тут не помогу.",
				"added": 1561471199
			},
			{
				"comment_id": 8,
				"body": "Главное правила не сливайте важную инфу если не готовы довести дело до конца, особенно как делает навальный тупо сливает инфу а эти люди просто закрывают свои дырки где они лаханулись, но вы не думайте что он просто так эту инфу сливает, просто ему бабки скорее всего уже заплатили за это.",
				"added": 1561471371
			}
		],
		"1_12XPYvUFzmczXdTy4GJxB1WGrnwrdpTCqD": [
			{
				"comment_id": 2,
				"body": "Ты тоже говно",
				"added": 1561465769
			}
		],
		"1_1Ku6DJ6bJHACK1VxwWZusvZ2KsseirHg6n": [
			{
				"comment_id": 3,
				"body": "как подключится готов помочь подержать сеть\nи доступ к форуму дайте почитаю что есть",
				"added": 1561466404
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 5,
				"body": "Есть способ, дождаться когда те кто наверху постареет, отупеет, умрут а дети их совершат ошибку.\nТогда можно их сместить и уничтожить, дальше вам нужно годами изучать управления людьми и передать все своим детям. И это не все вам так же нужно закрепить людей за своими потомками а не за собой, если вы это не сделаете ваши типо друзья, браться, или типо коллеги сместят вашего наследника и поцапаюца или решат все между друг другам. Это будет до тех пор пока не придет другой человек и не сделает все правильно.\nНапример что сделал Путин эта хуета, как только он свалит все его окружения и все что он создавал начнут вести переговоры между собой а не перед новым президентом. В итоге мы имеем много богатых людей которым насрать на людей, и на страну.",
				"added": 1561468876
			}
		]
	},
	"comment_vote": {}
}