{
	"next_topic_id": 4,
	"topics": [
		{
			"topic_id": 1,
			"title": "Image and Video search",
			"body": "The search engine needs a image and video search like google has. That way people can search for images and videos on Zeronet.",
			"added": 1434538445,
			"parent_topic_hash": "2@6"
		},
		{
			"topic_id": 2,
			"title": "prism-break",
			"body": "Maybe some of these projects can be used with zeronet. https://prism-break.org/en/all/",
			"added": 1434567731
		},
		{
			"topic_id": 3,
			"title": "Question about ports",
			"body": "Can two or three decentralized program be ran through the same port. I use Yacy search and wanted to know if I can change it's port to the same port that ZeroNet uses.",
			"added": 1435677274
		}
	],
	"next_message_id": 26,
	"comments": {
		"4@6": [
			{
				"comment_id": 1,
				"body": "1FjxvRMjBw5CUKpY3TCn76tszxHegohFqV",
				"added": 1434470780
			},
			{
				"comment_id": 8,
				"body": "Can you please add mine 1FjxvRMjBw5CUKpY3TCn76tszxHegohFqV Last time it said no peers found. Think I was having trouble with port not being open.",
				"added": 1434732090
			}
		],
		"4@62": [
			{
				"comment_id": 2,
				"body": "You could call it Tweeter, the decentralized version of Twitter",
				"added": 1434539248
			},
			{
				"comment_id": 4,
				"body": "> [p2p](#comment_58_62): we've had twister, a p2p Twitter.what we lack is p2p G+( no limit for words' length and ability to post pictures )\n\nWhat about a social network like Diaspora.",
				"added": 1434564046
			},
			{
				"comment_id": 5,
				"body": "> [nofish](#comment_128_2): Diaspora is more decentralized than facebook, but - far as i know - it's not P2P. Your content is hosted on ruby on rails servers called \"pods\".\n\nThere's MediaGoblin. Could it be added to a social network. http://mediagoblin.org/",
				"added": 1434565964
			},
			{
				"comment_id": 6,
				"body": "> [nofish](#comment_128_2): Diaspora is more decentralized than facebook, but - far as i know - it's not P2P. Your content is hosted on ruby on rails servers called \"pods\".\n\nThere is also https://redmatrix.me/&JS=1 and http://www.zenphoto.org/ They might be able to be used with a social network.",
				"added": 1434566943
			}
		],
		"1@212": [
			{
				"comment_id": 3,
				"body": "> [idealcoder](#comment_7_210): Images/videos are easy to crawl - you could just look in content.json for files with .jpg/.png/.mp4. The problem is going to always be how to decentralize the crawling - either locally you peer every single website, or some remote server generates compressed data files ( e.g. thumbnails of images) which are downloaded. \n> BTW, discovering sites is easy - just look on namecoin blockchain; it's downloading them all that is hard. \n> Then again - google search doesn't run off one single computer anyway ;(.\n\nMaybe these to links could give someone an idea on how to decentralize the crawling. http://www.cc.gatech.edu/~lingliu/papers/2003/apoidea-sigir03.pdf  http://law.di.unimi.it/software.php#bubing",
				"added": 1434562940
			},
			{
				"comment_id": 7,
				"body": "> [idealcoder](#comment_9_210): Very detailed thanks. Only deals with how to split up the indexing job - an important part, but there also needs to be some kind of decentralized search on all the data.\n\nI also found one more link http://www.decentralized-search.com/ Have you seen Yacy ? Yacy might give you some ideas on how to do a decentralized search of all the data. http://www.yacy.net/en/",
				"added": 1434580665
			}
		],
		"3@2": [
			{
				"comment_id": 9,
				"body": "People want their IP's hidden so they use Tor or I2P to help with that, but is there a way to build something into zeronet itself to hide IP's without having to use another program like Tor or I2P",
				"added": 1434732583
			},
			{
				"comment_id": 10,
				"body": "> [nofish](#comment_131_2): It can be possible, but it would not be as secure as other networks. You need 1000s of computers on fast line to have a fast and secure anonymity network. So its much better option to use already existing ones than reinventing the wheel.\n\nOK I see what your saying. I was just curious because sometimes you can't trust third parties with your privacy. Example Google Email",
				"added": 1434772084
			},
			{
				"comment_id": 12,
				"body": "> [nofish](#comment_132_2): I also find it disturbing, but not found any good solution for this problem:Some months ago the Chrome stopped restoring the scroll position of iframes on back button. It's still works on firefox, but not on chrome.\n> Probably as workaround it would be possible to store the current scroll position as cookie and restore when you next navigate to page.\n\nWould be nice if ZeroNet had it's own Decentralized Browser",
				"added": 1434949990
			},
			{
				"comment_id": 13,
				"body": "There needs to be an easy way to add images to ZeroNet blogs. ",
				"added": 1434991964
			},
			{
				"comment_id": 14,
				"body": "> [nofish](#comment_138_2): Yes, it works, but its recommended to put every content within the site's data dir, to keep your images after re-cloning (updating) from the parent ZeroBlog site.It's also planned to add file upload feature to webui until then you can use the ![myimg](data/img/anything.jpg) format.\n\nThanks nofish and idealcoder but that's all gibberish to me, I can't code what so ever. I know nothing about how to use markdown and I don't know anything about this ![myimg](data/img/anything.jpg) I can put the images in the data directory and I'll try to figure out a way to link to them. Most people can't code, it would be nice if something like WYSIWYG Web Builder http://wysiwygwebbuilder.com/ was integrated into ZeroNet, that way people could just drag and drop objects into their ZeroNet sites. ",
				"added": 1435284552
			},
			{
				"comment_id": 16,
				"body": "ZeroNet needs its own decentralized browser. ZeroNet should be decentralized 110% including the browser . Firefox and Chrome aren't decentralized and shouldn't be used. Chrome was created by Google and you can't trust Google so why use Chrome. ZeroNet should only promote and use other decentralized stuff. There's other decentralized browsers, one is Mist by Ethereum https://github.com/ethereum/mist and there's also SyncNet https://github.com/jminardi/syncnet",
				"added": 1435430283
			},
			{
				"comment_id": 17,
				"body": "> [brunoloff](#comment_7_213): Sure, it would be nice to have a decentralized browser. But I believe that ZeroNet can only have impact if it is very easy and transparent to use. If people need to download their own browser, ZeroNet will fail - mark my words.\n> And it is much more important that zeronet succeeds at a vast scale, than it is that it abides by some sort of puritanical coding ideal.\n> It is especially important that zeronet and other non-piracy-related P2P technologies reach the point when there are so many users that blocking P2P protocols would no longer be politically feasible. I believe we are nearing the day when politicians will start considering whether they should pass legislation to block the entire bittorrent protocol; it is important that when that day comes, there is enough legitimate content being distributed via P2P that such a move would be political suicide.\n\nPeople already have to download browsers to use, I had to download Firefox to use it. Couldn't a decentralized browser be integrated into ZeroNet so people wouldn't  have to download it. ",
				"added": 1435433791
			},
			{
				"comment_id": 24,
				"body": "I've noticed a few other people have asked about an easier way to add pictures and video to zeronet. Is it possible to integrate mediagoblin or something like it into zeronet. Mediagoblin can be used for audio, images and video. It would encourage more people to use zeronet. Also it would be nice if people were able to clone it so they could set up their own media site. http://mediagoblin.org/",
				"added": 1436844086
			},
			{
				"comment_id": 25,
				"body": "Thanks no fish, but I don't think zeronet is for me. There's just to much you have to do to get images and video on zeronet. I know you have worked hard on this project but I see it going no where. You need something the 99% will use and most of the 99% can't code and so they won't use zeronet. If people have to keep downloading stuff like webtorrent to add stuff to zeronet they will not use it. I've read so many comments from people on forums about decentralized networks and they hate them because they're to hard to set up and it's to hard to add stuff to the pages people create. You need something like a media uploader built into zeronet like wordpress has. https://codex.wordpress.org/Inserting_Images_into_Posts_and_Pages  ZeroNet is a good idea and I hope you figure out a way to improve it, but I'm going back to using the centralized network with the other 99%. Good luck with your project.",
				"added": 1436891592
			}
		],
		"1319@69": [
			{
				"comment_id": 11,
				"body": "It would be nice if there was a decentralized version of Google on ZeroNet, but the Zeronet version shouldn't censor like Google does. (CensorFree)",
				"added": 1434905902
			}
		],
		"1421@69": [
			{
				"comment_id": 15,
				"body": "But while recent studies indicate that plenty of consumers wish their online activities were more private, even the creators of many of these privacy tools acknowledge that all but the simplest of them are still too complex to win over the majority of the Internet-using public. This is why people don't use decentralized networks, they are just to complex. The wheel does need to be reinvented.",
				"added": 1435337142
			}
		],
		"2@107": [
			{
				"comment_id": 18,
				"body": "I'm a noob to and that's a good question. ",
				"added": 1435546166
			}
		],
		"3@212": [
			{
				"comment_id": 21,
				"body": "> [jfeldis](#comment_1_241): I was able to run zeronet on another port (15422) running like this at command line in Linux\n>   zeronet.py --fileserver_port=15442\n> Seems to find the network OK.  Useful for running multiple instances of zeronet inside the same NAT.\n\nThanks jfeldis, I'm learning about decentralized programs but all of the programs seem to have their own port that needs to be open. I don't want to have three or four ports open. I would like to get ZeroNet, Yacy and Mediagoblin running through the same port.",
				"added": 1435853377
			},
			{
				"comment_id": 22,
				"body": "> [nofish](#comment_144_2): Unfortunately  it's not possible, only 1 application can use the port on same machine.\n\nThanks nofish, I was afraid of that. I was worried about security issues with having a lot of ports open. ",
				"added": 1435903661
			}
		],
		"1@219": [
			{
				"comment_id": 23,
				"body": "I didn't see any gay porn, but you need to keep in mind that some people will use zeronet to create porn sites and that's their choice if they wish to do so. Zeronet needs a way to let people know which sites are porn and that way people can choose if they want to seed them. ZeroNet shouldn't censor. ",
				"added": 1436804787
			}
		]
	},
	"comment_votes": {
		"115@2": 1,
		"3@216": 1,
		"4@216": 1,
		"8@230": 1,
		"3@230": 1,
		"1@241": 1,
		"2@278": 1
	},
	"topic_votes": {
		"1@230": 1,
		"2@107": 1
	}
}