{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1,
			"title": "四川蘸酱将于下周一（2月26）开始在全美所有麦当劳门店供应。麦当劳说，他们一共准备了2000万份蘸酱，并且希望这一次，供应能够持续一定时间。",
			"body": "麦当劳去年短暂供应的四川蘸酱人气爆棚，由于供应数量有限，不少粉丝失望而归，甚至还引起骚乱。现在，这款让美国人疯狂的麦乐鸡蘸酱即将回归。\n\n这款四川蘸酱将于下周一（2月26）开始在全美所有麦当劳门店供应。麦当劳说，他们一共准备了2000万份蘸酱，并且希望这一次，供应能够持续一定时间。\n\n去年10月7日，麦当劳在几个门店限量供应过这款四川蘸酱。没想到蘸酱在当天迅速售罄，甚至还引起了骚乱。\n\n麦当劳的四川蘸酱是1998年为了配合动画电影《花木兰》的宣传而推出的。后来电影下映，这款蘸酱也就不再继续供应。没想到这款蘸酱受到许多美国人的喜爱，让他们魂牵梦绕了20年。\n\n美国人的回忆再次被唤起，大概要归功于去年播出的人气动画片《瑞克和莫蒂》（Rick and Morty）第三季。动画片中的主人公瑞克对麦当劳的四川蘸酱念念不忘，并且点名要吃这个蘸酱。这个回忆杀，想必戳中了许多美国人的心声。有粉丝发起网上情愿活动，要求四川蘸酱回归。\n\n麦当劳也是给动画片主创团队送去了一大瓶这种蘸酱。他们之后决定在限定门店重新推出四川蘸酱，但仅上线一天，于是就出现了连夜排队、甚至不远万里驱车前去一饱口福的人们，以及前面提到的因没得到蘸酱而失望闹事的粉丝们。甚至还有人在eBay上叫卖四川蘸酱，价格一度被炒到一万多美金。\n\n麦当劳专门为这个事件开了个网站，名叫“我们要蘸酱”，对粉丝表示歉意。他们也是在这个网站上公布了四川蘸酱将于下周一再次回归的消息。\n\n对于大多数粉丝来说，麦当劳的四川蘸酱可能不只是一种味道，更是一段无法追忆的岁月，任谁都不能复制。\n\n这一次，对四川蘸酱情有独钟的粉丝们应该能够如愿了吧。",
			"added": 1519351074
		},
		{
			"topic_id": 2,
			"title": "关于刚去世的葛培理牧师的不同观点，引发对司徒雷登以及雷明远神父的思考",
			"body": "作者：金兄的境界\n\n越来越懒得做文章了。不过美国的可能是当代最著名的牧师葛培理牧师享年99岁的去世，是个影响全球的大信息。很多人悼念和惋惜以及担忧美国的未来，但也有人抨击他与邪恶组织有交易，走得太近。这些信息，我都不准备详细了解。今天有人在美国之音的这个信息上，提到了司徒雷登的问题，突然又让我想起雷明远神父也是鼓动青年闹事，组织爱国或抗日运动等。我下面摘录几句这方面的文字内容：\n\n美国之音报道说：\n“美国国会众议院议长瑞安的办公室周四说，著名福音牧师葛培理(Billy Graham)的遗体将被安放在国会圆形大厅让人瞻仰。\n\n瑞安在周三的一份声明中称葛培理“扎根于正直、谦恭和爱中”。\n\n葛培理星期三去世，享年99岁。他经常被视为20世纪最有影响力的传道士。他为20世纪晚期最有权威最著名的人物做过祷告和建议，包括从杜鲁门到奥巴马的每一任美国总统。\n美国福音牧师葛培理和夫人钟路得在她在江苏省淮阴的出生地前留影。（1988年4月19日）\n葛培理家族有着浓厚的中国情结：葛培理牧师的妻子钟路得(Ruth Bell Graham)就出生在江苏淮安市（时称清江浦），她的父亲在清江浦主持教会医院。钟路得在中国生活了17年，因此她称自己为“淮安的女儿”。\n\n1988年，葛培理牧师夫妇访问了中国。2006年，中国教会圣经事工美国巡展得到了葛培理牧师的大力支持，其中第一笔海外捐赠就是来自钟路得，她还与美国前总统卡特一同担任展览筹委会的最高荣誉主席。钟路得在2007年辞世。\n\n葛培理几十年来在全球各地布道，感召了千百万人。他曾于1975年在台湾主办了据信有20万人参加的大型布道会。他在1956年、1975年和1990年三度访问香港并举办大型布道会。”\n\n其中中国教会圣经事工美国展，被很多人诟病，因为是一种非真正教会活动的统战宣传，为当局摆门面。这些话我不参与表述观点，看得比较淡。\n下面是有人在此消息后留言的文字，让我觉得又有深思：\n\n责任\n2018年2月23日 9:07\n是的，他没有卖国，甚至是忠实的爱国者，但由于自己的浅薄，由于对自己的盲目自信，对自己的理念的执着。他没有给中国人，美国人带来福祉，却带来无尽的伤害。而利用完他的中共，也因为他不能完全臣服，而致之其于死地。亲爱的朋友，善良是美德，但不包括敌人，尤其是不包括小人。喂饱了白眼狼，只能等待死亡的降临。希望大家做个明白人。\n\n责任\n2018年2月23日 9:07\n以司徒雷登为例，如果他保持中立，他是令人敬仰的。但他没有，凭借自己对政治的理解，插手中国的政治，直接导致美国对中共的误判，可以说，是司徒雷登一手造就了今天的中共。再说下学生运动，我说过很多遍，如果靠游行，靠煽动，靠喊口号可以解决问题的话，司法造就被取缔了。谁会舍近求远？谁会放着容易追求复杂？谁会自己给自己找不痛快？但司徒雷登只是凭着他单纯的假想，就肯定了学生运动的积极性，作为一个为人师表的长者，这种冲动是致命的。可以说毁掉了他以前做的一切善事。不要说我苛刻。事情就是这样，他废了一生努力积攒的德行，再对学生的不负责中，被消耗的一干二净。学生们那么信任他，结果他却把学生推入了火炕。这是不能原谅的。越是亲密，伤害越深。也许司徒雷登是出于无心，是源于无知。但是事实是无法改变的。中国人本身就愚昧，司徒雷登办教育本身就是消除愚昧，但也正是他，把愚昧的中国人民亲手送给了中共。并且误导了美国很多年，甚至美国面临毁灭而不知。这样的人很难令人尊敬。\n\n责任\n2018年2月23日 8:51\n这种人还是不易过分夸大宣扬。昨天我刚看过司徒雷登的文章，实际上，心里非常不舒服。从总的来说司徒雷登是个好人，甚至是个难得的好人。用圣徒来形容也不为过。但我一项是只讲对错的，再对错之后，才会评价这个人的好坏。换句话说，是事情证明了这个人的好坏，而不是这个人是好坏人，才会做那些事。司徒雷登单从宗教的意义上来说，他是尽职的，也是个好人。但从政治上来说，他就是一个混蛋。他这一点和达赖是一样的，如果虔心宗教，不问政治。他们可能成就伟业。但以宗教的偏颇，来干扰政治走向，而且又及其错误的走向，可以说，他们就是历史的罪人。\n\n不具名\n2018年2月23日 7:47\n美國最著名的福音派基督教佈道家葛培理去世。在過去70多年裡，他對捍衛美國的傳統價值做出了極為獨特的貢獻，但作為宗教家，他離權力太近，晚年也越來越傾向討好各種觀點的人。比較而言，我更喜歡他的兒子佛蘭克林。所謂的寬容可贏得更多掌聲歡呼和諂媚，但我更欣賞堅持理念的人。\n\n可惜\n2018年2月23日 7:46\n葛培理博士确实是个福音的勇士。但是他的一个盲点就是错估了中党国的本质。中共把他和他孩子们都看为可以大大统战利用的“基督教领袖外交家”而已。天真的说了很多赞美逼迫者的赞语。在北京与狼共舞被酷刑多年入狱后软禁的家庭教会领袖们拒绝与他会面。至今他的布道团都不敢为中国受迫害基督徒说话！可惜",
			"added": 1519353485
		},
		{
			"topic_id": 3,
			"title": "今日浙江温州基督信仰与社会经济状况感观：（一批温州学子在欧美攻读神学博士令人期待",
			"body": "王文锋牧师说：\n昨天一家人离开故乡回京，感谢上帝的带领及各位亲朋好友的接待！永远不会忘记你们对我的教诲和养育。因为马上又要闭关，所以分享一下此次故乡之旅感受：\n\n1、社会篇：\n1）、家乡环境变化很大，尤其是环境卫生整治和交通道路治理，可以说是焕然一新；\n2）、行业状态起伏很大，传统产业和网络创业在衔接和张力中面临机遇和挑战并存的动荡局面；温州大部分传统产业本来技术含量底，创新空间有限，所以整个产业在网络和创新时代压力巨大。\n3）、意识形态差别很大，感觉民众在意识形态方面明显分成不同的阵营，民族主义和普世主义的分歧明显。部分人对于普世价值的认识和认同超乎我想象。不过，比较令我惊讶的是另一些部分人对于其他一些国家的评价令我担忧（只是二句话就下结论，少有换位思考）。部分人对中国、美国和韩国的评价让我感到“文化大革命”似乎就要重演，极其震惊。（不经调查，随意性下结论的愤青言论是很可悲的东西，它会煽动仇恨和偏见）\n\n2、教会篇：\n1）、温州基督教的基层力量非常强大，个人感觉到目前温州基督教会的核心力量仍然是平信徒和义工而不是牧者（当然牧者贡献很大），“信徒皆祭司”的理念落实得很到位，教会众多的事工其实都是义工和平信徒自发性地在推动。二十年来，温州主日学、教会音乐、商人团契及校园团契的兴起是教会的最大财富。\n2）、温州基督教的祈祷山庄给我印象深刻，我觉得温州教会的最大力量是属灵传统已深入到基层信众之中。此外一些堂会和神学院已逐步完善和成熟（一批温州学子在欧美攻读神学博士令人期待）。尤其是对历史和文字工作的意识已明显加强。\n3）、堂会的建设贡献很大，因为其一方面把教会的事工项目精致化（样样落实到实处），堂会信徒的生命素质令人刮目相看（印象非常深刻）；另一方面其不知不觉带来了“健康的张力”，因为有时没有张力就没有动力，而没有动力就不会发力。这种张力会促使堂会之间在教义、体制、牧养、宣教、培训、礼节等方面彼此激发从而共同长进。事实上教会历史中最复兴的时刻都是在一种健康的张力中展开的，比如教父时代异端和极端问题辩论中的张力生发了众多的神学著作、宗教改革中的张力带来信徒使命的大释放以及世界宣教的大拓展。不过，一定要在奋发图强和野心勃勃中找到平衡点、在彼此激励和勾心斗角中找到平衡点、在持守正统与革故鼎新中找到平衡点。\n4）、个人对温州基督教会的一些期待是，在高度、广度和深度上继续发力。在高度上要着眼于中国整体教会的意识，要有“中国的温州教会”而不是“温州教会在中国”。同时要在教会和社会、福音和文化之间做更多的对接和桥梁工作（慈善事业）。在广度上要更大激发信徒的积极性，只要信徒被激发投入使命，教会就有希望。深度上，温州教会应该要出更多系统性的东西，比如把某些牧会方法和观念提炼成系统性的牧会理念，比如对各会前辈和老信徒做抢救性的口述历史并集结出版（此次150周年是案例），专门有一批人扎下心写作（出本土的系统神学、历史神学乃至圣经神学的著作），同时在神学院、商人团契、音乐事工和宣教事工上要有更多人才全职投入。",
			"added": 1519372680
		},
		{
			"topic_id": 4,
			"title": "义和团的兴起与失利",
			"body": "这是一篇敌视基督信仰的爱国主义者爱义和团者的作品。推荐基督徒天主教友们阅读了解\n 。\nhttp://www.yhcqw.com/71/10247.html",
			"added": 1519438244
		},
		{
			"topic_id": 5,
			"title": "【投票】张扣扣是英雄还是败类？你支持重判还是轻判？ -",
			"body": "欢迎投票，不删帖\nhttp://xinyangzhongguo.ml/bbs/forum.php?mod=viewthread&tid=1820",
			"added": 1519443227
		},
		{
			"topic_id": 1521933022,
			"title": "这个板块好！读书好！",
			"body": "读书，读好书，读有意义的书。",
			"added": 1521933016,
			"parent_topic_uri": "1521883527_15vxijofrLcqnmh8RSbxTtbW9ZTfzy57TU"
		},
		{
			"topic_id": 1522890576,
			"title": "十九大后首虎 中共人大环保委前副主任委员、中国环境科学研究院前院长孟伟被双开",
			"body": "中共官媒周三通报，中共人大环境与资源保护委员会前副主任委员、中国环境科学研究院前院长孟伟，因〝严重违纪〞被立案审查，成为中共十九大后落马的第一只〝老虎〞。\n\n通报列出孟伟的严重违纪问题有：要求下属报告巡视谈话内容；违规出入私人会所；利用职权帮助他人晋升职务并收受财物；收受礼金等。其中，利用职权和职务影响为他人谋取利益并收受财物，涉嫌受贿犯罪；滥用职权，违规转让股权造成国有资产巨额损失，涉嫌滥用职权犯罪。\n\n2017年11月10日，孟伟被调查，11月14日，被终止中国工程院院士资格。\n\n中国工程院至今已有多名院士落马，除了孟伟，还有中国农业大学教授李宁，以及曾任总后勤部军需物资油料部副部长的周国泰。",
			"added": 1522890569
		},
		{
			"topic_id": 1525310560,
			"title": "现任中共北大党委书记是郝平，1959年9月生，山东青岛人，现任北大校长林建华生于1955年10月，山东潍坊高密市人。",
			"body": "现任中共北大党委书记是郝平，1959年9月生，山东青岛人，北京大学历史系历史专业本科毕业，曾长期任职北大，期间于上世纪90年代初赴美做访问学者及在夏威夷大学历史系读硕士研究生。回国后历任北京大学副校长、北京外国语大学校长、教育部副部长兼中国联合国教科文组织全国委员会主任。2013年11月5日，任联合国教科文组织第37届大会主席。2016年12月，任北京大学党委书记。他是中共第十九届中央候补委员。\n现任北大校长林建华生于1955年10月，山东潍坊高密市人。曾任浙江大学校长。2015年2月15日，任北京大学校长。",
			"added": 1525310552
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"20_15vxijofrLcqnmh8RSbxTtbW9ZTfzy57TU": [
			{
				"comment_id": 1,
				"body": "呵呵。。。太壞了。",
				"added": 1516964974
			}
		],
		"16_1965fNDmmvHB3LFPmAHkb9vqBN484QEM2a": [
			{
				"comment_id": 2,
				"body": "如果不是手動刪除整站文件夾，單單通過zeronet刪除站點，是不能成功的。文件仍舊存在於電腦裡面。為什麼會這樣，很難理解。",
				"added": 1517468476
			}
		],
		"1519980189_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": [
			{
				"comment_id": 3,
				"body": "这架势看，中国人占领（统领统治？）地球还真有可能。",
				"added": 1520036680
			}
		],
		"1521933077_15vxijofrLcqnmh8RSbxTtbW9ZTfzy57TU": [
			{
				"comment_id": 4,
				"body": "好，好！",
				"added": 1521933246
			}
		]
	},
	"comment_vote": {}
}