{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#A ORAÇÃO DO CAÇADOR\n\nNo longa, Lucas (Sam Worthington) é um assassino que é contratado para dar um fim na família de Ella (Odeya Rush). Mas ele acaba desenvolvendo uma ligação com a garota e resolve ajudá-la a rastrear e eliminar a pessoa que é responsável pela ordem dos assassinatos.\n\n- https://www.ok.ru/video/296830831125",
				"added": 1548428805
			},
			{
				"comment_id": 2,
				"body": "#KRONOS: O FIM DA HUMANIDADE?\n\nNo ano de 2020, Elias Van Dorne (John Cusack), o CEO da maior empresa de robótica do mundo, inventa o super computador Kronos, com o objetivo de acabar com a guerra para sempre. Porém, Kronos decide que acabar com a raça humana é a melhor maneira de trazer paz para o mundo. Décadas mais tarde, um grupo de humanos sobreviventes do extermínio procuram um novo mundo em que dizem existir vida humana sem a ameaça dos robôs.\n\n- https://streamango.com/embed/nmpabskrqeteccml/",
				"added": 1548428970
			},
			{
				"comment_id": 3,
				"body": "#ASSASSINOS\nUm veterano assassino profissional (Sylvester Stallone) que é considerado o melhor no ramo pensa em sair do negócio, mas resolve aceitar como último trabalho eliminar uma hacker (Julianne Moore). Ele acaba sendo traído pelo contratante, passando então a ser caçado por um jovem assassino (Antonio Banderas) que planeja matá-lo para ficar no seu lugar. Esta situação obriga-o a se unir à mulher que pretendia matar.\n\n- https://ok.ru/video/381555968672",
				"added": 1548429047
			},
			{
				"comment_id": 4,
				"body": "#MÁQUINAS MORTAIS\nAnos depois da \"Guerra dos Sessenta Minutos\". A Terra está destruída e para sobreviver as cidades se movem em rodas gigantes, conhecidas como Cidades Tração, e lutam com outras para conseguir mais recursos naturais. Quando Londres se envolve em um ataque, Tom (Robert Sheehan) é lançado para fora da cidade junto com uma fora-da-lei e os dois juntos precisam lutar para sobreviver e ainda enfrentar uma ameaça que coloca a vida no planeta em risco.\n\n- https://www.rapidvideo.com/e/FZG5J98JI4",
				"added": 1548429476
			},
			{
				"comment_id": 6,
				"body": "#NINJA\nCasey é um ninja americano que estuda Ninjutsu no Japão. A pedido do Sensei, ele retorna aos Estados Unidos para proteger o legendário Yoroi Bitsu, uma caixa blindada que contém as armas do último Koga Ninja. Ele conta com poderes lendários para garatir a segurança do arsenal e derrotar os assassinos de Yakuza, que estão tentando alcançá-lo.\n\n- https://ok.ru/video/316903852560",
				"added": 1548437749
			},
			{
				"comment_id": 7,
				"body": "#Ninja Assassino\nUma pesquisadora da Europol, Mika Coretti (Naomi Harris), descobre indícios que ligam diversas mortes de pessoas importantes ao pagamento de uma determinada quantia. Certa que está diante de assassinatos por encomenda, ela contraria ordens superiores e acaba envolvida numa trama internacional comandada por um clã de ninjas assassinos liderados pelo Lorde Ozunu (Sho Kogushi), em pé de guerra com um ninja dissidente em busca de vingança.\n\n- https://streamango.com/embed/lkmsrsmmdqdtkfpf/",
				"added": 1548437904
			},
			{
				"comment_id": 8,
				"body": "#A Lenda de Kamui\nNo Japão do século XVII, Kamui é um ninja que deve utilizar as suas habilidades para ferir e matar outras pessoas. Porém, quando começa a crescer nele o desprezo por esse tal código de conduta, ele se torna um fugitivo em busca da verdadeira liberdade. Caçado por traição pelos demais ninjas da ordem, Kamui salva a vida de Hanbei, um pescador que lhe oferece abrigo em sua residência como forma de gratidão. Lá ele descobre o valor da amizade com os moradores e se apaixona por Saiyaka, a filha do pescador. Porém, ao cair em uma armadilha, Hanbei e Saiyaka são assassinados e a raiva e tristeza tomam conta de Kamui, fazendo com que ele parta em busca de vingança.\n\n- https://ok.ru/video/219792935440",
				"added": 1548438565
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "#Supercondutividade a temperatura ambiente\n\nPesquisadores deram um passo importante para alcançar um dos objetivos mais procurados da física: a supercondutividade a temperatura ambiente.\n\nMaddury Somayazulu e colegas da Universidade George Washington, nos EUA, flagraram a supercondutividade à temperatura de meros -13,15º C (260 K).\n\nEm experimentos subsequentes, eles observaram a transição para a supercondutividade ocorrendo em temperaturas ainda mais altas, acima de zero, a 6,85º C (280 K).\n\nA supercondutividade é a ausência de resistência elétrica e é observada em muitos materiais quando eles são resfriados abaixo de uma temperatura crítica, tipicamente muito baixa, por volta de -180º Celsius, o que limita sua aplicação.\n\nComo a resistência elétrica torna um sistema ineficiente, eliminar ao menos parte dessa resistência utilizando supercondutores de temperatura ambiente permitiria a geração, transmissão e uso de eletricidade mais eficientes.\n\n- https://sci-hub.tw/10.1103/PhysRevLett.122.027001",
				"added": 1548436906
			}
		]
	},
	"comment_vote": {}
}