{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Génération de nom de site",
			"body": "Je cherche un moyen de générer un nom de site (de type ZeroNet \"1tTyrf ... e0R\") avec des spécificités.\nEx: ZeroHello -> 1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\n\nJe suis arriver a faire des URL avec 4 lettres définit au début comme Play (1PLAYgDQb ... Xvfp)\nMais a partir de plus il a trop peut de chance avec ma méthode force brut. Pour 4 caractères on a 1 chance sur 1679616 c'est pas difficile en 1h c'est fait, mais 5 caractères c'est 1 chance sur 60466176\ncela devient vraiment long.\n\nAlors si il y a une solution pour hack le système de génération d’URL sur ZeroNet je suis a l'écoute.\nMerci :)",
			"added": 1462722054
		}
	],
	"topic_vote": {
		"1_1B1MshmrKWod7ebWLR6Hiv7zyc4vGuwGnY": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1B1MshmrKWod7ebWLR6Hiv7zyc4vGuwGnY": [
			{
				"comment_id": 1,
				"body": "C'est possible a faire, je vient de clone 1Play en local, un peut de travail dessus pour refaire tout en FR et il manque plus que de quoi le remplir.",
				"added": 1462635307
			},
			{
				"comment_id": 2,
				"body": "> [aber](#comment_1_15W5QMehHHcshCSVweQcP5ez5VDjbP3rRG): décidement ça patauge dans la choucroute ici!!Sur play vous avez aussi toute sorte de sous titres en attendant!!!!!\n\nPlay c'est juste un TPB il y a que des liens magnet et pour les sous-titre c'est sur opensubtitles.org il faut juste trouver les tracker qui va bien.",
				"added": 1462701675
			},
			{
				"comment_id": 5,
				"body": "> [elnormand](#comment_1_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w): Ou sinon, réaliser un site, genre direct Download mais sur ZeroNet\n\nAvec une bonne gestion de WebRTC c'est possible mais la encore il faut que quelqu'un est une version du fichier (le film) c'est la limite du P2P, la disponibilité des informations.",
				"added": 1462732757
			},
			{
				"comment_id": 6,
				"body": "> [elnormand](#comment_2_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w): Le best, serai que chaque famille ai un Raspberry (ou autre chose) tournant 24h/24h.Un disque dur devra être branché dessus et un système dédié qu'au téléchargement.Sa, sa serai super...\n\nDans le monde parfait du P2P oui  xD",
				"added": 1462974032
			}
		],
		"1_173GCzZVznGXgYZXjH5A7Qx32nYsaoVH1b": [
			{
				"comment_id": 3,
				"body": "Tout dépend du site a créé.",
				"added": 1462721168
			},
			{
				"comment_id": 4,
				"body": "> [do3n](#comment_3_173GCzZVznGXgYZXjH5A7Qx32nYsaoVH1b): Un moyen de te contacter ?\n\npar ZeroMail djmemo@zeroid.bit",
				"added": 1462728607
			}
		],
		"1_1CNF4WYCP9372VLNWNR7RaeGZyvXvcSMaU": [
			{
				"comment_id": 7,
				"body": "> [weedcoder](#comment_1_151xfrGz3zugtqCT51AStxjJNTHa6harBb): Le fait que ce soit long et dur est la base du travail de Adam back sur le hashcash. l'algorithme s’appelle la preuve du travail (par ce que c'est dur) proof of work, POW en anglais.Cet algorithme est utilisé pour sécuriser la blockchain bitcoin.Et c'est parce qu'il n'y a pas d'optimisation connue pour générer un tel type d'adresse facilement que les crypto monnaies sont solides.\n> Donc non, pas moyen de faire ça plus vite.Et ta méthode force brute est la seule connue (le minage bitcoin, c'est cette recherche en force brute)\n\nMerci pour cette confirmation. Le seule moyen de donner un nom c'est namecoin.",
				"added": 1463241071
			}
		]
	},
	"comment_vote": {
		"1_151xfrGz3zugtqCT51AStxjJNTHa6harBb": 1
	}
}