{
	"next_topic_id": 21,
	"topic": [
		{
			"topic_id": 1622662817,
			"title": "MOTTO-",
			"body": "Motto\nKiedy przyszli po Żydów, nie protestowałem. Nie byłem przecież Żydem.\nKiedy przyszli po komunistów, nie protestowałem. Nie byłem przecież komunistą.\nKiedy przyszli po socjaldemokratów, nie protestowałem.\nNie byłem przecież socjaldemokratą.\nKiedy przyszli po związkowców, nie protestowałem. Nie byłem przecież związkowcem.\nKiedy przyszli po mnie, nikt nie protestował. Nikogo już nie było.\n.\nMartin Niemöller, 1892-1984\n(niemiecki pastor luterański; wiersz napisany w obozie w Dachau w 1942 r.)",
			"added": 1622662816
		},
		{
			"topic_id": 1623191172,
			"title": "Zatrute Mleko Matek.",
			"body": "„Wieczne chemikalia” \nW mleku amerykańskich matek\nMleko 50 amerykańskich matek zostało przetestowane pod kątem zanieczyszczenia PFAS. „Wieczne chemikalia” wykryto w każdej próbce. Koncentracje były aż 2 000 razy wyższe od dawki uznawanej za bezpieczną przez rzeczników zdrowia publicznego. Wyniki świadczą o tym, że skażenie potencjalnie idealnego pokarmu natury substancjami PFAS prawdopodobnie jest w naszym kraju zjawiskiem powszechnym. – powiedziała Erika Schreder, współautorka badania i dyrektor naukowy organizacji Toxic Free Future. [13 maja 2021 r., Environmental Science and Technology]\nJeśli teraz mamy takie stężenie chemikalii, to co będzie potem? za parę lat, kiedy ilość toksyn wzrasta z roku na rok.",
			"added": 1623191170
		},
		{
			"topic_id": 1623792988,
			"title": "Zabójcy światła dziennego!.",
			"body": "Duchess Notinevidence\n\nKamractwo Rodaków Bydgoszczy (FB)\nCiastko kruszy się!\nI tak ciasteczko zaczyna się kruszyć… Zabójcy światła dziennego!. Maski zaczynają spadać! Chińskie laboratorium biologiczne w Wuhan jest własnością Glaxosmithkline, który (przypadkowo) jest właścicielem firmy “Pfizer!” (tego, który robi szczepionkę przeciwko wirusowi, który został (przypadkowo) uruchomiony w laboratorium biologicznym w Wuhan i które zostało (przypadkowo) ufundowany przez dr Fauci, który (przypadkowo) promuje szczepionkę! „GlaxoSmithKline jest (przypadkowo) zarządzany przez dział finansowy Black Rock, który (przypadkowo) zarządza finansami Open Foundation Company (Fundacja Sorosa), która (przypadkowo) zarządza francuską AXA! Soros (przypadkowo) jest właścicielem niemieckiej firmy Winterthur, która (przypadkowo) zbudowała chińskie laboratorium w Wuhan i został kupiony przez niemiecki Allianz, który (przypadkowo) ma Vanguard jako udziałowca, który: (przypadkowo) jest udziałowcem Black Rock”, który (przypadkowo) kontroluje banki centralne i zarządza około jedną trzecią globalnych transakcji finansowych. „Black Rock” jest także (przypadkowo) głównym udziałowcem MICROSOFT, należącym do Billa Gatesa, który (przypadkowo) jest udziałowcem firmy Pfizer (która – Zapamiętaj? Sprzedaje cudowną szczepionkę) i (przypadkowo) jest teraz najważniejszym sponsorem WHO – Światowej Organizacji Zdrowia! Teraz już rozumiesz, jak martwy nietoperz sprzedawany na mokrym targowisku w Chinach zaraził CAŁĄ PLANETĘ!? \nPs.\nDziękuję i dobranoc, jak ktoś wierzy w to dalej , \nto zderzy się nie długo z przykrą prawdą o sobie.",
			"added": 1623792985
		},
		{
			"topic_id": 1625871045,
			"title": "Testowanie szczepionki mRNA na niemowlętach.",
			"body": "Znów Polin/nie mylić z Polską/\n\n8 placówek w Polsce zgłosiło się do testowania szczepionki mRNA na niemowlętach\n\nPolskie Stowarzyszenie Niezależnych Lekarzy i Naukowców informuje, że 8 placówek w Polsce „zgłosiło do wykonania eksperymentalnych „szczepień” mRNA na sześciomiesięcznych niemowlętach” – czytamy na profilu organizacji.\nStowarzyszenie wysłało szereg pytań do organów rządowych, aby dowiedzieć się coś więcej w kwestii testowania szczepionki przeciw COVID-19 na polskich dzieciach.\nW odpowiedzi na zadane pytania Ministerstwo Zdrowia napisało, że „prowadzone jest badanie kliniczne ze szczepionką Comirnaty z udziałem populacji pediatrycznej”.\nSzczepionka Comirnaty to preparat Pfizera.\n\nIN-VIVO – Bydgoszcz\nCentrum Badan Klinicznych JCI – Kraków\nOśrodek Badan Klinicznych AppleTreeClinics – Łódź\nGRAVITA. Diagnostyka i Leczenie niepłodności – Łódź\nRodzinne Centrum Medyczne Lubmed – Luboń\nNiepubliczny Zakład Lecznictwa Ambulatoryjnego „Michałkowice” – Siemianowice Śląskie\nNasz Lekarz Ośrodek Badań Klinicznych – Toruń\nProvita Poliklinika 0 – Warszawa \n.\nLink poniżej. \nhttps://tarnogorski.info/8-placowek-w-polsce-zglosilo-d/\n.\nPs.\nPozostawiam to zdarzenie, bez komentarza?",
			"added": 1625871041
		},
		{
			"topic_id": 1625955253,
			"title": "PODZIĘKOWANIE.",
			"body": "Witam: \nChciałbym wszystkim podziękować za wpisy, które są zrobione po obejrzeniu Filmu na YouTube PL, \nJest to ważna czynność dla tych co wrzucają tutaj Filmy. Dla nich to jest sygnał, że ich praca nie idzie na marne. Jest to świadectwo oglądalności i przydatności tych materiałów. \nPozdrawiam wszystkich. \nDzięki.",
			"added": 1625955248
		},
		{
			"topic_id": 1626571418,
			"title": "SZCZEPIONKA.",
			"body": "Taka sobie dywagacja na temat szczepionki i jej działania... \n. Miłej lektury.\n.\n. Czy szczepionka likwiduje maski?  NIE \n. Czy szczepionka likwiduje dystans?  NIE \n. Czy szczepionka wyeliminuje testy?  NIE \n. Czy szczepienia likwiduje zakażenia?  NIE \n. Czy \"szczepionka\" jest szczepionką?  NIE       ( to jest eksperymentalny preparat medyczny ) \n. Czy \"szczepionka\" została dopuszczona do powszechnego użycia?  NIE   \n ( została dopuszczona warunkowo na 1 rok i nie jest ważne, że warunków nie spełnia ) \n. Czy \"szczepionka\" uodparnia na zachorowanie na C19?  NIE \n. Czy badano ją na osobach z chorobami towarzyszącymi?  NIE \n. Czy znane są reakcje pomiędzy \"szczepionką\" a innymi lekami?  NIE \n. Czy w pełni zakończono prace nad badaniem tej \"szczepionki\"  NIE  \n ( ich producenci piszą o tym otwarcie w ulotkach ) \n. Czy masz pewność, że nie umrzesz po jej przyjęciu?  NIE \n. Czy masz pewność, że za rok lub dwa lub trzy nie pojawią się efekty uboczne jej przyjęcia?  NIE \n. Czy masz 100% pewności, że ta pseudo \"szczepionka\" nie spowoduje zmian genetycznych w twoim organizmie ?  NIE \n. Czy ktoś, jakakolwiek instytucja, Ministerstwo Zdrowia, Minister Zdrowia, ktokolwiek ponosi odpowiedzialność w przypadku powikłań i zgonów?  NIE \n. Czy jeśli umrzesz po przyjęciu \"szczepionki\" twoi bliscy i podopieczni dostaną odszkodowanie?  NIE \n. Czy wiesz, że Twoi bliscy nie otrzymają ani grosza z Twojej polisy ubezpieczeniowej na życie po Twojej śmierci, bo dobrowolnie poddałeś się eksperymentowi medycznemu i on może bezpośrednio lub pośrednio przyczynić się do Twojej przyszłej śmieci - i to staje się prawną podstawą do odmowy wypłaty polisy?  NIE   \n( więc jeśli się zaszczepiłeś przestań płacić składki albo wykup polisę za mniej póki żyjesz, bo ona i tak nie będzie miała żadnej wartości po Twojej śmierci ale ubezpieczyciel Ci tego nie powie ) \n.\n.  Czy umierają  ludzie po przyjęciu tej \"szczepionki\"? TAK ! \n.\n*TO DLACZEGO, KTOŚ JESZCZE MA WĄTPLIWOŚCI CZY CHCE, JĄ  ( TO \"COŚ\" )  PRZYJĄĆ?\n.  Nie zaszczepię się, ponieważ na nic nie chorowałem od lat.\n.  Nie zaszczepię się, ponieważ studiowałem latami szczepionki.\n.  Nie zaszczepię się, ponieważ jesteśmy okłamywani.\n.  Nie zaszczepię się, by chronić me dzieci.\n.  Nie zaszczepię się, by pokazać, że Covid nie istnieje. \n.  Nie zaszczepię się, ponieważ w ten sposób zdecydowałem się \n.  NIE wspierać dokonanego przez nich zła przeciw ludzkości. \n.  Nie zaszczepię się, by móc podróżować. \n.  Nie zaszczepię się, by móc przekroczyć granicę.\n.  Nie zaszczepię się tylko dlatego, że „każdy się szczepi…”. \n.  Nie zaszczepię się, ponieważ chcę i mogę żyć długo i być z moimi dziećmi i wnukami. \n.  Nie zaszczepię się, ponieważ wtedy będę zdolny pomóc innym. \n.  Nie zaszczepię się, by pokazać innym, że nie ma pandemii. \n.  Nie zaszczepię się, aby wielu poznało prawdę. \n.  Nie zaszczepię się, ponieważ byłem stworzony przez mojego Stwórcę. \n.  Nie zaszczepię się, ponieważ nie chcę zrujnować mój odporny system immunologiczny. \n.  Nie zaszczepię się, ponieważ chcę żyć.\n.  Nie zaszczepię się, ponieważ nie chcę umrzeć. \n.  Nie zaszczepię się, ponieważ nie ufam/nie wierzę nauce. \n.  Nie zaszczepię się, ponieważ nie ufam medycynie. \n.  Nie zaszczepię się, ponieważ jest to [forma] trzeciej wojny światowej. \n. Nie zaszczepię się, ponieważ mamy wolną wolę. \n.  Nie zaszczepię się, ponieważ jestem żyjącą osobą. \n.  Nie zaszczepię się, by być świadectwem zwycięstwa nad tą ciemnością i ze wszystkimi bojownikami mogę  / świętować / celebrować - WOLNOŚĆ - osobistą . \n.\nPozdrawiam.",
			"added": 1626571412
		},
		{
			"topic_id": 1626719398,
			"title": "Mordowanie emerytów.",
			"body": "Rząd brytyjski jest oskarżony o mordowanie emerytów Związek\nLudowy Wielkiej Brytanii (PUB) zamierza wnieść oskarżenie przeciwko własnemu rządowi o masakry emerytów.\nW szczególności zarzuty zostaną postawione byłemu ministrowi zdrowia Mattowi Hancockowi, który od kwietnia 2020 osób jest w podeszłym wieku i narażonych na morfinę, a midazolam przedawkowano w szpitalach. Dane sugerują, że Hancock wraz z szeregiem urzędników państwowych i szefów Narodowej Służby Zdrowia (NHS) prowadził zakrojony na szeroką skalę program, którego ofiarami byli emeryci, którzy rzekomo zmarli z powodu Covid-19.\nW rzeczywistości w domach opieki podawano im chlorowodorek midazolamu, który był śmiertelny z objawami identycznymi jak u osób zakażonych Covid-19.\nWykres pokazuje, jak za każdym razem, gdy pojawiał się wzrost liczby recept na midazolam, w całym kraju następował wzrost liczby zgonów związanych z Covid-19.\nZa każdym razem, gdy spadały przepisy na midazolam, spadała śmiertelność.\nZnana i szanowana prawniczka Claire Wills Harrison, która od połowy 2020 roku zbiera dowody na nadużywanie midazolamu w domach opieki, stoi za zarzutami przeciwko rządowi Wielkiej Brytanii.\nCytat prawnika:\n„Powyższy wykres został opracowany na podstawie danych z badania pacjentów przepisujących midazolam poza szpitalem, od stycznia 2020 r. do marca 2021 r. Ten wykres przedstawia śmiertelność w wieku powyżej 65 lat w podziale na przedziały wiekowe. Istnieją poważne pytania, na które rząd musi odpowiedzieć w związku ze stosowaniem midazolamu w ciągu ostatnich 15 miesięcy. Razem z PUBem poprosimy ich w sądzie. Mamy dość przytłaczających dowodów, aby postawić zarzut masowego morderstwa tych samych ludzi, którzy mieli być chronieni przez politykę zdrowotną rządu Wielkiej Brytanii. Zbudowaliśmy teraz kompleksową bazę dowodową ujawniającą działania wszystkich osób zaangażowanych w łańcuch dostaw midazolamu i morfiny.”\nW ciągu najbliższych dwóch tygodni Związek Ludowy Wielkiej Brytanii planuje postawić zarzuty masowego morderstwa wraz z zarzutami o oszustwo pandemiczne w Sądzie Pokoju.\nPUB jest również w trakcie wnoszenia zarzutów przeciwko wyższym funkcjonariuszom brytyjskiej policji. Związek domaga się, aby policja zbadała przytłaczające dowody ludobójstwa popełnionego przez rząd Wielkiej Brytanii w domach opieki od marca 2020 r.\nDziennikarze Daily Expose dowiedzieli się, co dokładnie zostanie postawione rządowi w sądzie:\nmidazolam to narkotyk, który był używany w Stanach Zjednoczonych podczas egzekucji przez śmiertelny zastrzyk.\nZgodnie z brytyjskim prawem, midazolam można otrzymać tylko w szpitalu, gabinecie lekarskim, który posiada sprzęt potrzebny do monitorowania serca i płuc oraz zapewnienia szybkiej pomocy medycznej w przypadku wystąpienia niepożądanej reakcji.\nMidazolam może powodować poważne problemy z oddychaniem, takie jak spłycenie, spowolnienie lub chwilowe zatrzymanie oddechu, co prowadzi do śmierci.\nNa początku rzekomej pandemii Covid-19 minister Matt Hancock zamówił dwuletnią dostawę midazolamu z Francji, a następnie zamówił kolejną partię.\nNa zamkniętym posiedzeniu komisji parlamentarnej z udziałem ministra Hancocka, profesora Wang Tama i anonimowego posła torysa, dr Luke Evans powiedział, że „łatwą śmierć” można osiągnąć za pomocą trzech składników, w tym midazolamu.\nSekretarz Hancock i rząd zmienili ustawę o aktach zgonu pod przykrywką ustawy o koronawirusie.\nZmieniono prawo kremacyjne w celu usunięcia konieczności wystawiania zaświadczenia lekarskiego.\nZnowelizowana została ustawa o zwrocie kosztów leczenia.\nZnowelizowana została ustawa o odwiedzaniu rodziny i przyjaciół w domach opieki.\nPod koniec 2020 r. Komisja ds. Jakości Opieki ustaliła, że ​​34% pracowników służby zdrowia i opieki społecznej stwierdziło, że byli pod presją, aby nie reanimować osób starszych w domach opieki i nie zgłaszać tego faktu swoim krewnym.\nCo mogę powiedzieć…\nJesteście zwierzętami, panowie z Foggy Albion.\nJesteście kanibalami.\nChciałabym wyrazić nadzieję, że dzielna prawniczka, wraz z Związkiem Ludowym Wielkiej Brytanii, uda się wymierzyć sprawiedliwość w sądzie.\nVladimir Karasev\nŹródło: https://news-front.info/2021/07/17/vladimir-karasyov- ..\n.\nPozdrawiam emerytów, Już jesteście niepotrzebni nikomu. więc do piachu.",
			"added": 1626719391
		},
		{
			"topic_id": 1626904569,
			"title": "SZCZEPIENIA-CHIPY.",
			"body": "Szczepienia-droga do chipizacii?  Plan żydowski\n.\nPozdrawiam wszystkich.\nPierwszym punktem, który należy wziąć i nie zapomnieć, jest nasz kraj okupowany przez Żydów od 1917 roku. Żydzi nie będą myśleć o naszym dobrobycie. Przecież dla nich to nie Żydzi to goj - nie człowiek, zwierzę, które trzeba zabijać, wykorzystywać... a nasz naród w okupacji, w niewoli mają. Nawet jeśli nikt nie zabija, nie oznacza to, że nie jesteśmy w okupacji. Nawet jeśli na pierwszy rzut oka myślisz, że państwo myśli o nas, to znaczy, że są jakieś podstępne, nie znane nam powody i korzyści, ale z haczykiem dla ludzi, albo trzeba uśpić, odwrócić uwagę stada.\n\nDalej, o szczepionce, istnieje powszechna opinia:\n\nTa wakcynacja jest rodzajem bomby genetycznej, która po pewnym czasie zabije osobę. (złoty miliard. Konieczne jest zmniejszenie populacji, oczyszczenie świata z nas dla nich, pozostawienie najbardziej posłusznych w jakości niewolników)\nSterylizuje i głupio ludzie nie będą mogli się rozmnażać. (nie bez powodu przygotowuje się teraz więcej szczepień dla dzieci i kobiet w ciąży-chociaż wszystkie inne szczepienia są zabronione dla kobiet w ciąży. Również opcja redukcji populacji)\nMutacja DNA z jej negatywnymi skutkami, ewentualnie dodatkowo pkt 1, 2.\n\nJak widzę:\nTo, co opisano powyżej, jest bardzo możliwe, że jest to rzeczywistość. Ale nawet jeśli po trzech latach nie umrą o zaszczepieniu, sens jest niezrozumiałym śmieciem, aby wprowadzić Goya do organizmu.\n\nAle dla nich Żydzi, Klany finansowe, właściciele pieniędzy, wszyscy muszą zostać zniewoleni, zakabaleni.\nSzczepionka jako pewnego rodzaju narzędzie, zachęta do zapędzania ludzi do nowych kabalistycznych ustrojów.\nTo sto lat temu. Można było zabijać na otwartej przestrzeni. Palić, rabować, organizować Terror, aby złamać ludzi i podporządkować żydowsko-bolszewicki system zaborczy.\nAle teraz postępują podstępnie, poprzez media tworzą opinię publiczną i manipulują ludźmi poprzez media i prawa. Ale tutaj. Przygotowują dla nas odłączenie Internetu od globalnego, prawo ewakuacyjne, stwarzają problemy z bronią(nowe przepisy, rozkazy), budowane obozy koncentracyjne-gotowe na surowe i otwarte prześladowania, eksterminację nas!\n\nOto szczepionką, która nas cyfryzuje: / nadaje nam kolejny numer /.\nJest to paszport elektroniczny, przekazanie danych biometrycznych, wydanie wszystkich kodów QR jako numeru osobistego. I do tego dojdzie. Co jest głupie bez szczepionki-kod QR nie kupić w sklepie, nie sprzedać, nie pracować, nie uczyć się, nie mieć transportu, nie Licencji na broń, nie przejechać autobusem itp\nUważam, że psychoza dojdzie do tego stopnia, że zaczną łapać ludzi na ulicy i przymusowo szczepić.\n\nPrzypomina coś z Biblii, w którym mówi się, że bez pisania na dłoni lub na głowie nie można kupować ani sprzedawać.\nA może potem powiedzą: certyfikaty kupują, kody qr po szczepieniu nie mogą dostać oficjalnych ludzi. Nawet problemy mogą udowodnić, że dana osoba jest naprawdę sprowokowana, ale mówią, że nie, i nie wydają kodu qr i nie ma certyfikatu w usługach publicznych. Albo, że kody qr tracą, tracą telefony, certyfikaty, bądźmy ludźmi na rękę lub na czole, aby umieścić kody QR.\n\nAle zwykli robotnicy nie mają gdzie brać ochrony i pomocy, nie ma naprawdę partii robotniczych, nie ma związków zawodowych. Tak, a sam naród jest rozdrobniony, rozproszony, każdy myśli o sobie osobiście, a każdy jest słaby w pojedynkę, nie jest w stanie oprzeć się tak przebiegłej pułapce…\n\nNawet jeśli kupisz sobie certyfikat, to tymczasowo uratujesz się, wymyślisz, jak zaszczepić lub zmusić do ostatecznego celu. W końcu szczepienia, certyfikaty, kody qr mogą być etapem pośrednim.\nCelem może być elektroniczny paszport, elektroniczny portfel bez gotówki, dane biometryczne, coś innego... przynajmniej zaczną chipować. I tam już nie uciekniesz, tu udało Ci się oszukać, aby uzyskać certyfikat, a z chipem już nie.\nDelirium czy rzeczywistość? - czas pokaże. Ale dopóki jest czas, lepiej przygotować się na trudne..\n…........................................................\n.Odpowiedź:\n*Tak, Dobrze powiedziane, dobrze napisane. To jest bardzo dobry artykuł. Każdy powinien go przeczytać. Przetłumaczyłem i polecę go na Polskiej stronie. \nPolacy i Rosjanie, to jest jeden naród; Który został podzielony dawno temu. To był pierwszy etap tego Holokaustu. Potem przyszły następne etapy. Dzisiaj już, to nie wiadomo który to jest, z kolei ? To co opisujesz, to wszystko jest prawda. I zmierza w tym kierunku, aby wymordować nas, jak najwięcej. Tak jak wymordowano, Indian w dawnej Ameryce. Mamy do czynienia z przestępcami czystej wody. Oni nie zawahają się tego zrobić? Co najwyżej, mogą opóźnić termin naszej zagłady. Tutaj, co do tego,  nie ma żadnej wątpliwości. To jest tylko kwestia czasu, kiedy to się stanie. Pytanie otwarte? Co można zrobić, aby się przeciw stawić temu zjawisku. Odpowiedź; uświadomić jak największą liczbę ludzi na świecie. Duża ilość uświadomionych i obudzonych ludzi, może się temu przeciwstawić. Przejęte i kontrolowane media internetowe nie pozwalają na normalną dyskusję. Wszech obecna CENZURA- tłumi komunikację między ludzką. Dostęp do internetu jest też blokowany i inwigilowany. A do tego świadomość ludzka jest na bardzo niskim poziomie. To jest właśnie, najtrudniejszy punkt do przeskoczenia. \nJak namówić ludzi do dyskusji*???\n.\nPozdrawiam.",
			"added": 1626904561
		},
		{
			"topic_id": 1627502800,
			"title": "Powinieneś to wiedzieć!",
			"body": "A teraz to co powinieneś wiedzieć!\n1. Wszystkie szczepionki są wytwarzane przy użyciu tej samej nanotechnologii. W Hiszpanii nazywano to nawet „tajnymi nanocząsteczkami”. Te nanocząsteczki stają się magnetyczne, gdy osiągną taką samą temperaturę jak ludzkie ciało. Jeśli pozostaną w środowisku poniżej zera, pozostaną niemagnetyczne. [Dlaczego zamrażają szczepionki?] [patrz: Obserwacja domen magnetycznych w grafenie namagnesowanym poprzez kontrolę temperatury, odkształcenia i pola magnetycznego] \n2. Cząstki te muszą składać się z nanotechnologicznego materiału zwanego grafenem, który reaguje nadprzewodnikowo i wysoce integracyjnie z komórkami neuronowymi w mózgu! [patrz: Łączenie materiałów na bazie grafenu z komórkami nerwowymi] \n3. Unia Europejska zainwestowała miliard euro w projekt „The Graphene Flagship”: jest to wg Wikipedii inicjatywa badań naukowych z budżetem aż 1 miliarda euro. Stanowi nową formę wspólnej, skoordynowanej inicjatywy badawczej na bezprecedensową skalę. Cel? Zadaniem projektu Graphene Flagship jest zgromadzenie naukowców akademickich i przemysłowych w celu przeniesienia grafenu ze sfery laboratoriów akademickich do społeczeństwa europejskiego w ciągu dziesięciu lat, generując w ten sposób wzrost gospodarczy, nowe miejsca pracy i nowe możliwości dla Europejczyków jako inwestorów i pracowników. Plan rozpoczęto w 2013 roku+ 10 lat = 2023. a co to za data? Czy nie czasem koniec eksperymentu medycznego jakim są preparaty na Covid 19 firmy Pfizer? [Patrz: Europa zainwestowała 1 miliard euro w grafen — ale po co?] \n4. Niegenetyczna zdalna stymulacja światłem przez słabe nanocząstki emitujące światło laserowe (GRAFEN!) Może specyficznie wpływać na elektrofizjologię komórkową i aktywność neuronalną komórek nerwowych (komórek mózgowych)! [Patrz: Zdalna niegenetyczna optyczna modulacja aktywności neuronalnej za pomocą rozmytego grafenu] \n5. Cząsteczki grafenu mogą oddziaływać z neuronami w mózgu w trybie zdalnym na różnych częstotliwościach radiowych (5G MOŻE być jednym z nich); mogą mapować mózg i zdalnie wysyłać i odbierać INSTRUKCJE: \n6. Ludzki układ odpornościowy reaguje na tlenek grafenu tak samo jak na inne patogeny (bakterie, wirusy itp.) i w ten sposób może potencjalnie wywołać objawy podobne do COVID-19. \n7. To nigdy nie były „szczepionki” przeciwko wirusowi, ale cały czas był to tajny projekt nanotechnologiczny (BrainSORMS = finansowany przez Pentagon) mające na celu dotarcie do mózgów populacji ludzkiej i ich kontrola. Przy 42.6 GHz nanocząstki o długości 1.2 nm wchodzą w rezonans i mogą zwiększyć aktywność mózgu. (na razie nie wiemy, czy mogą modyfikować DNA przez 5G). Ludzie już przeszli WYKRESY w maskach, Testy PCR (Nanocząsteczki niszczą zmysł węchu), (Chemtrails?), Grypa– i namagnesowane szczepionki Covid. \n8. Symbol GRAFENU składa się z trzech Heksagramów \n9.  GRAPEN może być naturalnie wypłukiwany z organizmu, ponieważ istnieje enzym zwany mieloperoksydazą, który wydaje się rozkładać cząsteczki grafenu. Co zaskakujące, picie alkoholu lub nawet tytoniu może pomóc w zwiększeniu tego enzymu. Dlatego chcą, aby populacja była szczepiona co 6-12 miesięcy i na pusty żołądek. \n10. Interakcja między GRAFENEM u osób zaszczepionych a 5G może skutkować zgonem, jeśli 5G zostanie w pełni aktywowana w lipcu 2021 r. \n11. Wnioski dr. Sherri Tenpenny „Niektórzy ludzie umrą bezpośrednio po szczepieniu. Ale wielu ludzi zacznie okropnie chorować i zapadać na wszelkiego rodzaju choroby autoimmunologiczne”. \n12. Kolejne analiza: BADANIE ELEKTROMAGNETYZMU OSÓB ZASZCZEPIONYCH W LUKSEMBURGU – Europejskie Forum Czujności Szczepień [opracowanie] \n.\nJest to przedruk;\nPozdrawiam.",
			"added": 1627502791
		},
		{
			"topic_id": 1627505214,
			"title": "HUMOR- Pewne małżeństwo nie może mieć dzieci.",
			"body": "\"Pewne amerykańskie małżeństwo, w którym mężczyzna nie mógł niestety mieć dzieci, postanowiło skorzystać z usług tzw. zastępczego ojca. Po dokonaniu wszelkich niezbędnych ustaleń i formalności małżonek wyszedł na golfa, zostawiając żonę w oczekiwaniu na przybycie \"specjalisty\". Przypadek sprawił, że w tym samym dniu w miasteczku zjawił się objazdowy fotograf, specjalizujący się w zdjęciach dzieci. Zadzwonił do drzwi w nadziei na zarobek. - Dzień dobry, madame, ja jestem. - Ależ wiem, oczekiwałam pana - odpowiada kobieta i prowadzi go do środka. - Ooo, doprawdy? - zdziwił się fotograf. - Ja, widzi pani, specjalizuję się w dzieciach. - Wspaniale, właśnie o to chodziło mężowi i mnie. - mówi kobieta i po chwili pyta spłoniona z emocji: - To gdzie zaczniemy? - No cóż - odpowiada fotograf - myślę, że może pani zdać się zupełnie na mnie. Mam duże doświadczenie. Z reguły zaczynam w kąpieli, tak ze dwa – trzy razy, później zwykle ze dwie pozycje na kanapie, w fotelu i z pewnością parę w łóżku. Nieraz doskonałe efekty osiąga się na dywanie w salonie. Naprawdę można się wyluzować. \"Dywan w salonie.\" - Myśli kobieta. - \"Nic dziwnego, że mnie i Harry'emu nic nie wychodziło.\" - Droga pani, nie mogę gwarantować, że każde będzie udane. – kontynuuje fotograf. - Ale jeżeli wypróbuje się kilkanaście pozycji, jeżeli strzelę z sześciu - siedmiu różnych kątów, wówczas jestem pewien, że będzie pani zadowolona z rezultatu. Kobieta z wrażenia zaczęła wachlować się gazetą, a facet nawija dalej: - Musi się pani również liczyć z tym, że w tym zawodzie, podczas roboty, człowiek cały czas jest w ruchu. Kręcę się tu i tam, wchodzę i wychodzę nieraz kilkanaście razy w ciągu minuty, ale proszę mi wierzyć, że rezultaty mojej pracy rzadko zawodzą oczekiwania. Kobieta usiadła przy otwartym oknie, spocona z wrażenia. - Ha! A żeby pani widziała, jak wspaniale wyszły mi pewne bliźniaki! Zwłaszcza biorąc pod uwagę trudności, jakie ich matka robiła mi przy współpracy. - Taka była trudna? - spytała mdlejącym głosem kobieta. - Straszliwie. Żeby uczciwie zrobić robotę, musieliśmy pójść do parku. Ale był cyrk! Ludzie tłoczyli się dookoła ze wszystkich stron, żeby zobaczyć mnie w akcji. Trzy godziny! Proszę sobie tylko wyobrazić: Trzy godziny ciężkiej fizycznej pracy! Matka cały czas się darła i jęczała tak głośno, że z trudem mogłem się skoncentrować. W końcu musiałem się spieszyć, bo zaczynało się robić ciemno. Ale naprawdę się wkurzyłem, kiedy wiewiórki zaczęły mi obgryzać sprzęt. - Sprzęt. - głos kobiety był ledwo słyszalny. - Chce pan powiedzieć, że wiewiórki naprawdę obgryzły panu. khem.. sprzęt..? - Hehehe, a skądże, połamałyby sobie zęby, twardy jest jak hartowana stal. No cóż, jestem gotów, rozstawię tylko statyw i możemy się zabierać do roboty. - Statyw? - No a jakże, muszę na czymś oprzeć tę armatę, za ciężka jest, żeby ją stale nosić. Proszę pani! Proszę pani! Jasna cholera, zemdlała!\"\n.\nMam nadzieję że się spodoba?\nPozdrawiam.",
			"added": 1627505204
		},
		{
			"topic_id": 1627522666,
			"title": "Centralne Biuro Zwalczania Cyberprzestępczości. - Czy tylko???",
			"body": "Mariusz Kamiński ogłosił plany utworzenia Centralnego Biura Zwalczania Cyberprzestępczości\n.\n*Pytanie pomocnicze? czy tylko to będzie przestępczość, czy też może wzięcie za mordę społeczeństwa? Totalna inwigilacja i kontrola każdego Polaka? Ja stawiam na ten ostatni punkt*.\n.\n\n27 lipca odbyła się konferencja prasowa na temat cyberbezpieczeństwa, w której udział wzięli: premier Mateusz Morawiecki, minister spraw wewnętrznych i administracji Mariusz Kamiński oraz pełnomocnik rządu ds. cyberbezpieczeństwa Janusz Cieszyński. Zapis całej konferencji jest już dostępny na YouTubie:\n \nMorawiecki, powołując się na coraz bardziej agresywne działania grup cyberprzestępczych, takich jak chociażby ransomware REvil, zapowiedział utworzenie nowego funduszu cyberbezpieczeństwa, który będzie finansowo wspierał służby cywilne i specjalne w walce z zagrożeniami w cyberprzestrzeni.\nCiekawsze było jednak wystąpienie Mariusza Kamińskiego, który ogłosił plany utworzenia nowej służby – CBZC (Centralne Biuro Zwalczania Cyberprzestępczości). Jej główną rolą będzie zwalczanie (tak, zgadliście) cyberprzestępczości, zaś pod względem funkcjonowania i struktury ma być bliźniaczo podobna do CBŚP (Centralne Biuro Śledcze Policji).\nNowa instytucja ma liczyć ok. 1800 funkcjonariuszy i różnić się od innych służb procedurą naboru oraz pensją pracowników. Zamiast testów sprawnościowych potencjalni kandydaci będą musieli wykazać się wiedzą z zakresu informatyki i cyberbezpieczeństwa. Z kolei wynagrodzenie funkcjonariuszy ma wahać się w granicach od 10 do 15 tysięcy złotych netto, co uczyni CBZC jedną z najlepiej opłacanych służb w Polsce.\nWarto dodać, że funkcjonariusze biura mają mieć uprawnienia pozwalające na tworzenie, pozyskiwanie i używanie narzędzi do przełamywania zabezpieczeń (inaczej – hackingu) w celu ścigania przestępców:\n\nCentralne Biuro Zwalczania Cyberprzestępczości dostanie uprawnienia do tworzenia, pozyskiwania i używania narzędzi do przełamywania zabezpieczeń – do hakowania. Do przyjęcia nie jest potrzebny test sprawności fizycznej ani „badanie psychologiczne” :-)\n https://t.co/mdPVZRTwmk https://t.co/CofGJ14zA4 pic.twitter.com/M1bd1G2MfR\n.\nPozdrawiam tych co myślą inaczej.",
			"added": 1627522655
		},
		{
			"topic_id": 1628313902,
			"title": "Nanolucyferaza. Co to jest?",
			"body": "Nanolucyferaza\n\nAle by łatwiej było zrozumieć o czym tu mówimy i co ja tak właściwie chcę ustalić i sprecyzować, co tu się odpierdziela, trzeba zacząć od początku…\nCzy lucyferaza ma jakikolwiek związek ze szczepieniami na Covid 19? TAK\nNanolucyferaza pokazuje przeciwciała po szczepionce na Covid 19!\n15.10.2020 W artykule: „A nanoluciferase SARS-CoV-2 for rapid neutralization testing and screening of anti-infective drugs for COVID-19” w jednym z najstarszych i najbardziej prestiżowych czasopism naukowych czytamy, iż lucyferaza pomaga w wyszukiwaniu ilości antyciał u osoby zaszczepionej na Covid 19! Słowem, szybko wskazuje czy dana badana osoba ma jeszcze tą odporność, a jeśli tak to na jakim poziomie czy też nie.\nPodsumowując, ta wysoko-przepustowa platforma stanowi niezawodne narzędzie do szybkich testów neutralizacji i przesiewowych badań antywirusowych pod kątem SARS-CoV-2.\nW artykule wskazano przy okazji, że jest to najlepszy i najszybszy z możliwych badań na wykrywanie przeciwciał, zwłaszcza od znanych nam testów RT-PCR. Jest to więc zmodyfikowany genetycznie SARS-CoV-2-Nluc bazujący na wysiłkowym teście neutralizacji- PRNT.\nStworzyliśmy nanolucyferazę SARS-CoV-2 ( SARS-CoV-2-Nluc ) jako platformę do szybkiej serodiagnostyki i wysokowydajnych badań przesiewowych leków. W przypadku użycia do testowania surowic pacjentów z COVID-19 test szybkiej neutralizacji dał wyniki współmierne do konwencjonalnego PRNT. Opracowano również wersję testu infekcji SARS-CoV-2-Nluc do wysokowydajnego badania przesiewowego leków przeciwwirusowych i zwalidowano przy użyciu znanych inhibitorów SARS-CoV-2, takich jak remdesivir i chlorochina.\n. Nluc-NT – to właśnie test neutralizacji za pomocą nanolucyferazy\n5.04.2021 w artykule: „New COVID-19 Antibody Test ‚Glows’ When Antibodies Are Present” znajdujemy więcej faktów na ten temat. Przypomnę: mierzyć poziom przeciwciał po szczepionce COVID-19 za pomocą tylko nakłucia z krwią i dostarcza wyniki w ciągu godzin! Jakie to ma więc zadanie? Zobaczmy:\nDr Igor Stagljar, profesor biochemii i genetyki molekularnej na Uniwersytecie w Toronto i jego laboratorium opracowało test. Stagljar powiedział Verywell,że przy masowych szczepieniach COVID-19 „bardzo ważne będzie śledzenie poziomu odporności, jaką ma dana osoba po zaszczepieniu”. (…). „Mając w rękach tak proste, ale precyzyjne, dokładne i tanie narzędzie, myślę, że będziemy w stanie ocenić odporność tych osób w bardzo wygodny sposób” – mówi Stagljar.\nCzyli test ma za zadanie niejako zweryfikować, czy dana osoba po strzale ma antyciała i na jakim są poziomie. Oczywiście przyświeca temu pozytywny oddźwięk, ale jest więc tester, czy taką szczepionkę faktycznie dostałeś czy też nie.\nJak się nazywa ten test spytacie? Bardzo sympatycznie . . .. SATiN co oznacza test serologiczny oparty na rozszczepionej nanolucyferazie trójdzielnej, wykorzystują w tym celu enzym zwany lucyferazą.\n„Zasadniczo inkubujemy te trzy małe cząsteczki biologii molekularnej z nakłuciem krwi” –  mówi Stagljar. „A jeśli we krwi znajdują się przeciwciała przeciwko SARS-CoV-2, te przeciwciała„ skleją ”trzy części lucyferazy w funkcjonalny cząsteczkę, która zacznie świecić.” Innymi słowy, musisz mieć obecne przeciwciała COVID-19, aby enzym świecił. Kiedy pojawia się poświata, naukowcy mogą zmierzyć ilość emitowanego światła za pomocą instrumentu zwanego luminometrem. Im więcej przeciwciał ma dana osoba, tym jaśniej będzie świecić lucyferaza. \nCzy Bill Gates ma jakikolwiek związek z lucyferazą? TAK\nCzy lucyferaza może być zastosowana jako znacznik w danej partii szczepionki? TAK qwa…. Ale po kolei…\nPlaster z mikroigłami czyli tatuaż z kropkami kwantowymi posiadający rejestr szczepień\n18.12.2019 r. RICE University opublikował artykuł: Quantum-dot tattoos hold vaccination record, [czyli z tłumaczenia „Tatuaże z kropkami kwantowymi posiadają rejestr szczepień„] który powala z nóg. Trzymaj się czegoś jak to czytasz:\nKevin McHugh, adiunkt bioinżynierii w Rice od tego lata, oraz zespół z jego poprzedniej instytucji tj. Massachusetts Institute of Technology donoszą w artykule pt. „Biocompatible near-infrared quantum dots delivered to the skin by microneedle patches record vaccination” o opracowywania znaczników z kropkami kwantowymi, które fluoryzują wraz z informacjami po wstrzyknięciu w ramach szczepienia.\nNa czym polegałby taki tatuaż? [biokompatybilne kropki kwantowe bliskiej podczerwieni czyli NIR QD umieszczone w skórze właściwej]\n\nOtóż jest to plaster o powierzchni centymetra kwadratowego, który będzie nakładany na skórę delikwenta mając na sobie unikatowy wzór składający się z 16 -ście, 1,5-milimetrowych mikro-igieł, które zawierają szczepionkę oraz fluorescencyjne kropki kwantowe. Znaczniki są wbudowane tylko w niektóre z szeregu tych mikro-igieł co umożliwia nadanie konkretnego i unikalnego wzorca (coś jak kod QR) Następnie, kiedy igły rozpuszczą się pod skórą w ciągu około dwóch minut po nałożeniu ( stworzone na bazie cukru ), szczepionka zostanie uwolniona a zamknięte w kapsułkach kropki kwantowe pozostawiają realny wzór znaczników tuż pod skórą, gdzie stają się czymś w rodzaju tatuażu z kodem kreskowym. Zamiast atramentu ta wysoce specyficzna dokumentacja medyczna składa się z miedzianych kropek kwantowych osadzonych w biokompatybilnych kapsułkach w skali mikro-nowej. Ich barwnik [lucyferaza?]  w bliskiej podczerwieni jest niewidoczny, ale ustawiony przez nich wzór może zostać odczytany i zinterpretowany przez dostosowany smartfon. Pozostawiony taki tatuaż ( 4-nanometrowe kropki powinny być czytelne przez co najmniej pięć lat ) można odczytać, aby zidentyfikować podaną szczepionkę.\nOczywiście ponownie, pomysłowi jak zawsze przyświecać ma niby zacny cel, kraje biedne oraz błędy czynnika ludzkiego ale to przecież technologia rodem ze świata Orwella. Nie qwa, chwila…. Przebija go nawet przynajmniej  o głowę! Jprd…..\nJaki jest cel takiego cyfrowego tatuażu? Wg Kevina McHugha mogło by mieć zastosowanie wobec dzieci, ale wyjaśnienie MIT jest bardziej perspektywiczne. Zobaczmy:\nDlatego naszym celem było opracowanie platformy, która jest solidna, niedroga i łatwa w użyciu, aby pokonać podstawowe przeszkody we wdrażaniu w krajach rozwijających się. Postawiliśmy hipotezę, że informacje, takie jak historia szczepień, mogą być niewidocznie zakodowane w skórze poprzez zastosowanie wyraźnego wzoru mikrocząstek fluorescencyjnych w bliskiej podczerwieni ( NIR ) za pomocą plastra z mikro-igłami. Zapewniając wszystkie wymagane informacje o samych pacjentach i dostarczając mikrocząsteczki w tych samych mikro-igłach co szczepionka, platforma ta oferuje kilka kluczowych korzyści w porównaniu z tradycyjną papierową lub elektroniczną dokumentacją medyczną, w tym:\n1. eliminację polegania na powszechnie dostępnej, ale bezpiecznej bazie danych informacji o pacjentach; \n2. brak polegania na dokładnej identyfikacji pacjentów i wprowadzaniu danych przez pracowników służby zdrowia; \n3. zdolność do szybkiego określenia statusu szczepienia; \n4. eliminacja oszustw związanych ze szczepieniami; \n5. zdolność do oceny zasięgu szczepień na poziomie populacji; \n6. minimalny koszt możliwy do wdrożenia w warunkach o niskich zasobach. \nTak więc już w 2019 roku przygotowano plasterek z cyfrowym tatuażem by być pewnym, że osoba nie tylko wzięła dany preparat, czy inne, ale zawierać ma/będzie w sobie całą masę jego innych informacji medycznych. Przynajmniej takie jest założenie tej idei.\n. Lucyferaza. Patrz dodatek: np. „Optymalizacja szczepień śródskórnych poprzez tatuowanie DNA w ludzkiej skórze”\n\nPowyższe zdjęcie przedstawia zabieg tatuowania skóry ludzkiej (A) i typowej ekspresji lucyferazy (B), wizualizowany kamerą światłoczułą, 18 godzin po tatuowaniu. Każdy obszar o powierzchni 50 mm2 został wytatuowany innym ustawieniem tatuażu.\nUniwersytety zaangażowane w badania nad cyfrowym tatuażem medycznym czyli plastrem z mikro-igłami:\nRICE University, który omówiłem \nMIT University, patrz art. „Przechowywanie informacji medycznych pod powierzchnią skóry – Specjalistyczny barwnik, dostarczany wraz ze szczepionką, może umożliwić przechowywanie historii szczepień na pacjencie” z 18.12.2020 r. \nUniversity of Pittsburgh. Tutaj mamy nawet dowód zastosowania plastra z mikroigłami wobec szczepionki na Covid 19 w artykule „Wyścig po szczepionkę przeciwko SARS-CoV-2. Wielkie nadzieje i wielkie znaki zapytania” z 27.04.2020 r. \n\nCzy Bill Gates ma związek z cyfrowym tatuażem? O tak!\nOtóż po pierwsze wspomniany powyżej dr Kevin McHugh, autor plastrów z mikro-igłami na Uniwersytecie Rice dostał pieniądze i motyw właśnie od Gatesów!\n„Fundacja Billa i Melindy Gatesów przyszła do nas i powiedziała: „Hej, mamy prawdziwy problem — wiedząc, kto jest szczepiony” — powiedział McHugh, który został zatrudniony, aby dołączyć do Rice dzięki funduszom z Instytutu Zapobiegania i Badań nad Rakiem w Teksasie . „Powiedzieli:„ Bierzemy udział w kampaniach szczepień, w których ludzie dostają się do Hummers, jeżdżą do wiejskiej wioski, ustawiają namiot i zaczynają szczepić ludzi, ale nie zawsze wiedzą, kto był wcześniej zaszczepiony i jakie szczepionki są nadal potrzebne”.\nRodzice często nie znają historii szczepień swoich dzieci, powiedział McHugh. „Więc naszym pomysłem było umieszczenie nagrania na osobie” – powiedział. „W ten sposób później ludzie mogą skanować obszar, aby zobaczyć, jakie szczepionki zostały podane i podać tylko te, które nadal są potrzebne.\nAle jakoś zapomniał chyba, że główną narracją tego patentu podciągnięto pod kraje rozwijające się, biedę, ułomność ludzką oraz populacyjną sklerozę szczepionkową itp.. Ale ok, wiadomo o co chodzi.\nPo drugie Bill Gates bez ogródek powiedział światu i to jeszcze na początku pandemii, czyli w 2020 r. że cyfrowy certyfikat odpornościowy wsp. covid 19 będzie potrzebny do opanowania pandemii!\n.\nJest to przedruk; Czy potrzeba dodawać jakiś komentarz? Myślę, że nie jest już potrzebny.\nPozdrawiam.",
			"added": 1628313890
		},
		{
			"topic_id": 1628512255,
			"title": "Humor -  List Szczepana.",
			"body": "List Szczepana:\nCześć mam na imię Szczepan. Jest rok 2029 i siedzę w właśnie w izolatce gdzie przebywam z powodu wykrycia u mnie wirusa SARS-Cov-2; izraelski wariant Gimel – najgorszy bo ściśle bezobjawowy. Jest tu trochę zimno, bo izolatki nie są ogrzewane z powodu nowych dyrektyw Unii Europejskie ograniczających emisję CO2, ale jestem dobrej myśli. Lekarz powiedział, że wyjdę z tego, byle bym się doczekał na najnowszą, najskuteczniejszą szczepionkę firmy Zyklon - Biontech ( to taka nowa powstała przez połączenie sił Pfizer, Astra-Zeneca Biontech, Moderna, i innych ).\nZ tymi szczepionkami to trochę dziwna sprawa. Nie jestem foliarzem czy płaskoziemcą, ale czasami mam wrażenie, że coś tu jest nie tak. Nie zrozumcie mnie źle, do 10 dawki czułem się świetnie, ale potem jak gdyby spadała skuteczność leku… Z powodu wariantu Aztec ( bezobjawowy z rejonu Machu Pikchu ) musieli mi odciąć nogę. Po 13 dawce dostałem lekkiego udaru – normalna reakcja poszczepienna wzmacniająca odporność. Jednak po 15 dawce złapałem ten nowo wykryty w Izraelu wariant Gimel zwany także „ścianą płaczu”. Dlaczego szczepionka mnie przed nim nie uchroniła? To właśnie z jego powodu siedzę teraz w izolatce. Czasami mam podejrzenie, że władza coś knuje i sama szczepi się innymi preparatami. Np. minister Niedzielski został niby po raz 15 zaszczepiony na oczach kamer, jednocześnie przez profesorów Horbana, Simona oraz Sutkowskiego (w lewe ramię, prawe ramię i pośladek) na warianty epsilon, pi-500 oraz sigma+  i jest zdrów jak ryba. Tylko anty-szczep widziałby w całej sprawie drugiego dno, nie mniej jednak większość mojej rodziny i znajomych już nie żyje. Czyżby władza wykorzystywała swoją uprzywilejowaną pozycję i brała potajemnie dodatkowe, mocniejsze dawki? Przeżyli wszak tylko politycy… no i te wredne anty-szczepy, które wszystkich wokół zarażają.\nTak więc siedzę sobie w izolatce i rozmyślam. Jedzenie podają znakomite. Szkoda, że nie czuję jego smaku. Aby umilić nam jakoś  życie stworzono nowe testy PCR z końcówką, która podłącza się do nasączonej białkiem kolca kory mózgowej i aktywuje przysadkę, dostarczając bodźców  podobnych jak podczas jedzenia i picia za czasów starej normalności. Prawie nie ma to efektów ubocznych tylko trochę krew cieknie  z nosa i zbiera na wymioty. Ja tam zamawiam sobie testy o smaku buraczków lub ketchupu i jest git.\nKończę kochani bo też i kończy mi się tlen w butli respiratora. Gdzie też podziewa się ta pielęgniarka? Powinna zmienić butlę już dwie godziny temu…\n….........................................................\nwitam w przyszłości.\n*Ironia, szyderstwo to potężna broń. Nieznany mi Autor, któremu gratuluję, użył jej w błyskotliwy sposób.\nGdy widzę bierność, głupotę i bezmyślność otaczających mnie tłumów odczuwam bezsilną wściekłość. Nie zamierzam jednak wyładowywać jej podpalając szprycowanie czy testowanie. Nie zamierzam też obrzucać czegokolwiek (policji, urzędów zdrowia czy ratuszy) kamieniami. To dałoby jedynie pretekst okupantowi do siłowego spacyfikowania ruchu oporu i przedstawiania nas w łże-mediach jako bandytów i terrorystów. \nPublikując szyderstwo „Szczepana” spuszczeniem z siebie niejako nadmiar pary z kotła. Nie jestem w stanie nic zrobić – ale mogę nadal z totalitarnej sitwy szydzić. I choć niczego to nie zmieni, to przynajmniej nadal mogę spojrzeć sobie w lustrze prosto w oczy nie wstydząc się, że milczałem, gdy należało krzyczeć, protestować i walczyć o wolność*.\n.\nPozdrawiam.",
			"added": 1628512242
		},
		{
			"topic_id": 1632379028,
			"title": "Sztuczna inteligencja, która nadzoruje kierowców Amazona.",
			"body": "Amazon instaluje w pojazdach kamery ze sztuczną inteligencją, aby nadzorować kierowców\n.\n.Jak donosi portal Vice, globalny gigant e-commerce – Amazon – wcielając w życie wizję rzeczywistości przedstawionej przez Orwella w książce Rok 1984, postanowił wyposażyć pojazdy dostawcze w kamery ze sztuczną inteligencją firmy Netradyne:\nChoć w teorii technologia ta ma zapewniać „bezpieczeństwo” kierowcom, to w praktyce dane zbierane przez urządzenia są wysyłane do firmy Amazon, a następnie są one wykorzystywane do obliczania „efektywności” pracowników, co przekłada się na premie lub – w przypadku słabych wyników – ewentualne zwolnienia, tudzież potrącenie z pensji.\nPowyższa sytuacja sama w sobie stanowi duże naruszenie podstawowych praw pracownika, natomiast część kierowców zwraca uwagę na jeszcze jeden problem:\nWedług kierowców sztuczna inteligencja nie do końca radzi sobie z ocenianiem decyzji podejmowanych przez nich na drodze. W praktyce oznacza to, że AI potrafi uznać patrzenie w boczne lusterko, ustawianie radia czy zajechanie drogi przez innego kierowcę jako błąd pracownika. Warto dodać, że przy większości wykrytych „błędów” urządzenie wydaje głosem robota różne dźwięki i komunikaty, np.: „Utrzymaj bezpieczną odległość”, co może rozpraszać kierowcę i tym samym doprowadzić do wypadku. \n~ Jakub Bielaszewski\nJakiś komentarz? Ogólny kierunek, to przejąć całkowitą kontrolę nad człowiekiem. Zastąpić jego inteligencję, i pracę fizyczną, inteligentną maszyną; Pytanie; A czym następnie zastąpić  maszynę??? Już teraz mamy fabryki, w których tylko pracują maszyny, nieliczny personel ludzkiego  nadzoru, pilnuje i naprawia sprzęt. Wyobraźmy sobie przez chwilę, Ziemia, a na niej tylko same maszyny, które produkują sprzęt potrzebny maszynom? Czy to nie jest horror? Czy może Orwell był kiepskim  wizjonerem? Jak na ten moment, to wszystko się sprawdza z jego futurystycznych  przepowiedni. Próba zrobienia z ludzi posłusznych, Bio -Robotów, poprzez zmianę, zamianę -  ( mRNA ). \n.\nPozdrawiam.",
			"added": 1632379014
		},
		{
			"topic_id": 1633477933,
			"title": "„Awaria Internetu” – duże problemy z działaniem serwisów Facebooka.",
			"body": "„Awaria Internetu” – duże problemy z działaniem serwisów Facebooka\nW lipcu 2020 roku pisaliśmy o „awarii Internetu”, gdy popularne serwisy, takie jak: Discord, Roblox, Steam, Santander, Orange i wiele innych, nie działały z powodu problemów po stronie dostawcy usług CDN i rozwiązań anty-DdoS  – Cloudflare. Tym razem istną panikę wywołała niemożność dostępu do usług Facebooka – 4 października 2021 roku nie działały m.in.: Facebook, Messenger, WhatsApp czy Instagram:\n. Sporo osób niezaawansowanych technicznie zaczęło za zaistniałą sytuację obwiniać dostawców Internetu, takich jak Orange czy T-Mobile:\n. Przestępcy z kolei próbują wykorzystać trudności dotyczące wyżej wspomnianych mediów społecznościowych, np. powołując się na ( fałszywy ) fakt posiadania danych użytkowników platformy:\n. Najprawdopodobniej przyczyną niedostępności usług Facebooka były problemy z DNS-ami, a konkretniej – ze ścieżkami ( trasami ) BGP:\n. Co ciekawe, elektroniczne identyfikatory umożliwiające pracownikom Facebooka dostęp do budynków i obszarów strategicznych, np. serwerowni, podobno również przestały działać:\n. Z kolei z facebookowego komunikatu wynika, że cała sytuacja była spowodowana „błędem w konfiguracji routerów szkieletowych” (backbone routers):\n. Uczulamy Was także na nowe warianty phishingu – na „reaktywację/odzyskanie” konta:\n. W związku z zaistniałą sytuacją warto zainteresować się alternatywą wobec Messengera czy WhatsAppa. My z czystym sumieniem możemy polecić Signala, czyli darmowy, prosty w obsłudze, szyfrowany komunikator, który – w przeciwieństwie do aplikacji Facebooka – dba o prywatność swoich użytkowników. Na Sekuraku znajdziecie poradnik omawiający instalację, konfigurację i najważniejsze funkcje tego komunikatora.\n~ Jakub Bielaszewski\n* To jest tylko przedruk, co się dzieje na świecie? Te sprawy zawsze dotyczą powiązania z dystrybucją Windowsa. Ciągłe problemy, na skalę światową? Dlaczego tak się dzieje, kto jest temu winien? Czy to jest wada Systemu? Jeśli tak, to z jakiego to powody wynika? Wiele pytań, a odpowiedź jest tylko jedna; \nChcą wszystkich kontrolować, podsłuchiwać, podglądać*.\nPozdrawiam.",
			"added": 1633477918
		},
		{
			"topic_id": 1634380149,
			"title": "Humor.",
			"body": "Facet wchodzi z pistoletem do baru i pyta:\n– Kto pieprzył moją żonę?\nGłos z końca sali:\n– Nie masz tylu nabojów.\n\nW restauracji facet zamawia pączki.\n– Za te pączki, całuję panią w rączki – mówi do kelnerki.\nZamawia ciasteczka. – Za te ciasteczka, całuję panią w usteczka.\nOdzywa się facet z innego stolika:\n– Panie, zamów pan wreszcie zupę!\n\nPrzychodzi dwóch Murzynów i Mulat do restauracji. Kelner zwraca się do Mulata:\n– Co podać najjaśniejszy panie?\n\nKlient rozwiązuje krzyżówkę i pyta innego:\n– Otwór u baby na literę p.\n– Poziomo czy pionowo.\n– Poziomo.\n– To pisz pysk.",
			"added": 1634380133
		},
		{
			"topic_id": 1634380633,
			"title": "Włochy generalny strajk.",
			"body": "WŁOCHY Ogólnopolski strajk generalny WSZYSTKICH SEKTORÓW\nMECHANIKI PRZEMYSŁOWEJ I NIEPRZEMYSŁOWEJ NA CAŁYM TERYTORIUM KRAJU DLA WSZYSTKICH ZMIAN PRACY OD 15 PAŹDZIERNIKA DO 20 PAŹDZIERNIKA 2021 r. za „sprzeciw wobec stosowania Zielonej Przepustki w celu wykonywania pracy”.\nPracownicy portowi powiedzieli, że zablokują port i nie uruchomią go ponownie, dopóki Zielona Przepustka nie zostanie cofnięta dla wszystkich kategorii pracy we Włoszech. Rząd zaoferował im bezpłatne testy, powiedzieli wyraźnie NIE.\nWychodzi na to, że makaroniarze, jako jedyni na świecie, mają jaja...\n.\nPozdrawiam.",
			"added": 1634380616
		},
		{
			"topic_id": 1637232450,
			"title": "Operacja Laska Mojżesza.",
			"body": "**Operacja Laska Mojżesza – hackują izraelskie firmy. Szyfrują, leakują, zostawiają zgliszcza**.\n17 listopada 2021, \n.\nPodsumowanie od Check Pointa tutaj ( sporo smaczków technicznych! ), a chodzi o operację czy grupę hackerską o kryptonimie MosesStaff. Napastnicy mają przede wszystkim motywację polityczną i chcą po prostu wyrządzić jak najwięcej szkód:\nMosesStaff behaves differently. The group openly states that their motivation in attacking Israeli companies is to cause damage by leaking the stolen sensitive data and encrypting the victim’s networks, with no ransom demand.\nIch motto  ( zostawmy oryginalny, angielski przekaz ) brzmi tak:\nFight against the resistance and expose the crimes of the Zionists in the occupied territories.\nJak widać komputery są szyfrowane ( bez prośby o okup ), a dane udostępniane publicznie.\nZ istotnych elementów – ekipa przejmuje firmy dzięki podatnościom w systemach dostępnych z Internetu:\nInitial access to victims’ networks is presumably achieved through exploiting known vulnerabilities in publicly facing infrastructure such as Microsoft Exchange Servers.\nInnymi słowy – pierwszy krok to często webshell (pisaliśmy też o tym temacie tutaj), który z poziomu przeglądarki daje możliwość wykonywania poleceń systemowych na zaatakowanym serwerze.\nMoże i warto zatem w swojej firmie sprawdzić co tak naprawdę udostępniamy do sieci i czy nie można tego dość prosto zhackować.\n~Michał Sajdak\n.\n. Jakiś komentarz? \nCzym wojujesz? To od tego zginiesz...\npozdrawiam.",
			"added": 1637232432
		},
		{
			"topic_id": 1637657368,
			"title": "Posiadacze Tesli nie mogą otworzyć swoich samochodów.",
			"body": "Posiadacze Tesli nie mogą otworzyć swoich samochodów. Globalna awaria. [kapiszon czy znak naszych czasów?]\n\n\nMedia na całym świecie alarmują w takim tonie:\nTesla drivers left unable to start their cars after outage.\nWygląda dość groźnie, prawda? Choć moim zdaniem to chyba najlepszy kandydat na clickbait roku 2021 ( a może nie? ).\nOkazuje się, że rzeczywiście wystąpił globalny problem z appką Tesli, która może służyć również do otwierania samochodów:\nPrzy czym ważna informacja – samochody Tesli można otworzyć na trzy różne sposoby: właśnie wspomniana appka, karta zbliżeniowa i klasyczny kluczyk:\nIn situations where your phone key has a dead battery, or is lost or stolen, use your key card to unlock, drive, and lock Model X.\nDwie ostatnie metody cały czas działały w porządku, choć zapewne wielu z użytkowników bazując na wygodzie jaką oferuje otwieranie telefonem, zapomniało gdzie zostawili bardziej „klasyczne kluczyki”.\nW każdym razie problem jest już rozwiązany ( choć podany powód: „increased verbosity of network traffic” brzmi nieco enigmatycznie ):\n.\nJakiś komentarz? \nŚwiat stanął na głowie, wyprane mózgi nie potrafią samodzielnie myśleć. Zresztą trafiło na bogatych Rezusów. \npozdrawiam.",
			"added": 1637657349
		},
		{
			"topic_id": 1637758437,
			"title": "CZY  JESTEM - IDIOTĄ?",
			"body": "**CZY JESTEM – IDIOTĄ?**\nWitaj!\nZastanawiałeś się ile śladów zostawiasz podczas standardowego przeglądania Internetu? Zakupy, poczta elektroniczna, \"zwykłe\" przeglądanie sieci - takie czynności nie są całkowicie neutralne dla naszej prywatności... Obawiasz się, że dane które można pozyskać o Tobie mogą być użyte do nękania, śledzenia (również Twojej rodziny) czy kradzieży pieniędzy z konta? Jeśli trapią Cię tego typu pytania - to szkolenie jest dla Ciebie! To oryginalny i bardzo praktyczny pomysł na prezent mikołajkowo-świąteczny dla Twoich Bliskich (na życzenie możemy przygotować bilet na szkolenie w postaci atrakcyjnego wizualnie vouchera).\nKiedy? 30. listopada 2021 (13:00 -> 17:00) Uwaga! W cenie jest zapis filmowy całego szkolenia aż na 6 miesięcy - nie martw się więc, jeśli nie możesz uczestniczyć w podanym terminie, obejrzysz go w dogodnym dla Ciebie dniu :-)\nJak? zdalnie\nPo ile?  W dniach 23.11-29.11 (włącznie) obowiązuje promocja BLACK WEEK dająca -75% rabatu od ceny biletu! Kod rabatowy: niewidzialny-black\nRegularna cena biletu standard to 399 PLN netto + VAT. Z kodem rabatowym to zaledwie ~99PLN netto + VAT.\nZapisy: https://sklep.sekurak.pl/event/view?id=78 Wybierz bilet standard oraz użyj kodu rabatowego: niewidzialny-black\nAgenda szkolenia:\n1. Ile Internet wie o nas i o naszych danych?\nSzybki przegląd prostych i skutecznych metod wyszukiwania w sieci dostępnych dla każdego\nPrzykłady zgubnych skutków ujawniania swoich danych w Internecie\n2. Konfiguracja bezpiecznego / anonimowego środowiska pracy\nWybór systemu operacyjnego na komputerze i jego konfiguracja\nKonfiguracja zabezpieczeń smartfona i zasady ochrony danych powiązanych z numerem telefonu\nBezpieczny dostęp do Internetu\nUstawienia i dodatki przeglądarek\n3. Podstawy zachowania anonimowości i bezpiecznej pracy w Internecie\nUstawienia prywatności w serwisach społecznościowych\nUżywanie alertów dotyczących naszych danych\nBezpieczne zakupy w Internecie\nCzy płacenie kryptowalutami jest na pewno anonimowe?\nOznaki świadczące o tym, że ktoś może nas śledzić na komputerze lub telefonie\nBezpieczne przesyłanie informacji drogą mailową\nProfilowanie na podstawie opublikowanych zdjęć, dokumentów oraz innych elementów aktywności w sieci - jak go uniknąć\n4. Usuwanie swoich danych\nPrzykłady realnych sytuacji, w których musimy usunąć nadmiarowo udostępnione przez kogoś dane\nRODO - sposób na usuwanie swoich danych - jak to skutecznie robić?\nSkuteczne usuwanie kont w Internecie - w serwisach społecznościowych i na innych portalach\nCo robić jeśli nie można usunąć danych - zasady wprowadzania szumu informacyjnego\nUsuwanie informacji wrażliwych z plików oraz bezpieczne usuwanie samych plików na komputerze\n5. Dbanie o bezpieczeństwo swoich najbliższych\nJak dbać o bezpieczeństwo całej rodziny w Internecie\nCzy warto dawać zgodę na publikację zdjęć swoich dzieci np. w szkole lub w przedszkolu?\nJak dbać o bezpieczeństwo komunikacji elektronicznej dotyczącej dzieci lub innych członków rodziny\nCzy \"inteligentne\" zabawki stanowią zagrożenie dla naszej prywatności i bezpieczeństwa\nJak rozmawiać z dziećmi o bezpieczeństwie i anonimowości w sieci\n6. Kilka słów o podsłuchach\nZabezpieczanie komputera i telefonu przed podsłuchem (i podglądem też :)\nKlasyczne podsłuchy i nowsze wersje w apkach na telefon\n7. Krótko o bezpieczeństwie poza Internetem\nBezpieczeństwo podczas podróży\nUsuwanie danych z pojazdów i fizycznych dokumentów\nSzczerze polecamy i pozdrawiamy,\nekipa Securitum/sekuraka\n.....................................................\nJakiś komentarz? \"TEN\" Tekst - Brzmi pozytywnie, tylko jest jedno - ALE -??? \nDlaczego, chcą nas przekonać, że można im Wierzyć? Przecież  \"ONI\" wiernie służą temu systemowi. Dowodem jest to , że zawsze omawiają tylko windoze? Jak zwróciłem uwagę, że jest też Linux i inne niezależne media? To mój artykuł został usunięty i zbanowany...\n**CZY  TAK  NA  PEWNO  WYGLĄDA  WOLNOŚĆ**?\n.\npozdrawiam.",
			"added": 1637758417
		}
	],
	"topic_vote": {
		"1622818687_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": 1
	},
	"next_comment_id": 36,
	"comment": {
		"1622418520_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": [
			{
				"comment_id": 1,
				"body": "Był oponent? i już go nie ma. Ludzie szybko zapominają o cichych bohaterach. Oddał swoje życie, za nasze?\nCześć jego pamięci.",
				"added": 1622580164
			}
		],
		"1621854532_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 2,
				"body": "To tylko wycinek, tego co tam się dzieje?",
				"added": 1622580829
			},
			{
				"comment_id": 11,
				"body": "Trzecią światową zacznie malutkie państwo; Tyle mówi stara przepowiednia. Chyba nie jest trudno zlokalizować tego malucha???\npozdrawiam.",
				"added": 1625516305
			}
		],
		"1623191172_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 3,
				"body": "Jeśli jedzą zatrute jedzenie? To go mają. A przy okazji mają uszkodzone połączenia neuronowe w swoim mózgu. \n\"Alzheimer\".",
				"added": 1623399101
			}
		],
		"1623615171_193fCp5MWKjfmbNuSd5thzbfDsCj5whHTQ": [
			{
				"comment_id": 4,
				"body": "Ciekawe? Częściowo się zapoznałem, Już jedno niepokojące zdarzenie, kod źródłowy jest zamknięty? Tak jak w pieprzonym windowsie??? Nie można sprawdzić. A to tylko oznacza służby na trzy litery. Rosjanie coś zrobili? to koniokrady w odwecie też coś wykombinowali. Powiem tak; \"TO mogło by być dobre?\" Ale nie będzie. \npozdrawiam.",
				"added": 1623621927
			},
			{
				"comment_id": 5,
				"body": "Sprawa jest , rozwojowa? Podstawowe pytanie? Dlaczego tak jest źle? Skoro jest tak dobrze. Jest parę pytań natury technicznej? Podobno, Lenin też chciał dobrze? A wyszło Ciulowo? Ta aplikacja jest wyjątkowo starannie zrobiona? więc kosztowała kupę kasy. Pytanie kto jest sponsorem tej aplikacji, jaki to kraj, jaki to człowiek? ZeroNeta stworzył Węgier, potem służby na trzy litery adoptowały jako \"Głos Ameryki. na Chiny\" Ale się nie udało? ZeroNet też jest dobry, a nie może się przyjąć? Jest ograniczony. Przez kogo? i przez Co? \nCiekawostka; Isladia,miała dobrą tajną pocztę, całkiem legalnie. @unseen.is  - Była to bardzo dobra szyfrowana poczta. Przyjechali w garniturach i przejęli tą pocztę. Właściciele poczty musieli zwinąć żagle. Panowie nie pochodzili z Islandii. Pantomina, było i nima. / błąd zamierzony, rymuje się /. \nWracamy do \" Utopi-P2P\", z naszego poziomu nie jesteśmy tego sprawdzić? a inne poziomy są niedostępne. to wygląda podobnie jak księga kościelna napisana przez pejsatych, dla Gojów. Tysiąc lat minęło, i wierzą miliony przymulonych.; Wszystko oparte na Wierze. Tutaj podobna sprawa. Wszystko jest fachowo zrobione, od początku do końca. Sztab ludzi nad tym pracował? Kto ich opłacał? Informatyka jest droga? \nCo do założenia konta? można założyć i sprawdzić? To nie o nas chodzi, my jesteśmy płotki. Tam chcą łowić grube ryby. Na pytanie, kto za tym stoi? spotykamy nawijanie makaronu na uszy. 6-lat pracowali za darmo?  I ja mam w to uwierzyć? A z czego utrzymywali swoje rodziny? Aplikacja jest zapięta na ostatni, / przysłowiowy /, guzik.\nA do tego Krypto-waluta, Cyrkon,??? I jej kopanie na Utopii??? Podobno brak serwerów? Jak to można sprawdzić? Niema żadnych gwarancji, że cała korespondencja nie ląduje w Izraelu. Kto chce niech instaluje, Ja jak będę miał jakiegoś starego lapka, to też zainstaluję i sprawdzę? Pytanie? a kto będzie ze mną prowadził korespondencję??? Musi to zrobić moja znajoma osoba też z pustym lapkiem.  I co możemy sprawdzić? przesłać pocztę do siebie. Założyć stronę? a to już może być trochę niebezpieczne. Warto się zastanowić?\nPozdrawiam.",
				"added": 1623705898
			},
			{
				"comment_id": 6,
				"body": "Wiecie co jest problemem? To to , że 5-osób ma jedno, drugie10-osób ma co innego? I nie mogą się dogadać. wtedy przychodzi Firma jako ten trzeci i robi połączenie tych systemów. I już od tego momentu wszystkich szpieguje dokładnie. A my znowu jesteśmy w czarnej dupie. \nRóżnych komunikatorów jest wiele? Czy są bezpieczne??? Nie, bo wszystkie są kontrolowane. Można stworzyć lokalny komunikator? wśród swoich znajomych. I nikt inny nie pogada z nami. To jest szerszy problem, typu naszej osobowości. Sytuacja jest patowa.\npozdrawiam.",
				"added": 1623734986
			}
		],
		"1623792988_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 7,
				"body": "To tylko malutki wycinek tego co się dzieje? Co próbują z nami zrobić? Czy to zrobią, to już tylko zależy od \"NAS\".\npozdrawiam.",
				"added": 1624290380
			}
		],
		"1623926456_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 8,
				"body": "Wystarczy śledzić przepływ gotówki? I do tego włączyć samodzielne myślenie.",
				"added": 1624726293
			},
			{
				"comment_id": 10,
				"body": "Tą prawdę można już dziś poznać, wystarczy swój umysł otworzyć? Trzeba się nauczyć przytomnie patrzeć. \nW wojsku było takie powiedzenie; Obecny nieprzytomny. \npozdrawiam.",
				"added": 1625516166
			}
		],
		"1624997273_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 9,
				"body": "Wystarczy jedno słowo, aby to określić? \"MAFIA\". Która Rządzi światem. Drukuje pieniądze, którymi opłaca wszystkich.",
				"added": 1625001783
			},
			{
				"comment_id": 12,
				"body": "Masz całkowitą rację; ludzie mają wstręt do napisania paru zdań? Chociaż dobrze, że jeszcze potrafią przeczytać. Pytanie tylko, czy rozumieją co czytają? Nie wspomnę o tych młodych, którzy potrafią tylko Emotikony wysłać ,ESM-esem.",
				"added": 1625929221
			}
		],
		"1626053945_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 13,
				"body": "Jaki komentarz? Rosja sobie dobrze radzi na rynku światowym, i potrafi uprzedzić atak zachodu. Rosjanom się żyje lepiej, złodzieje mają gorzej. A tym co próbują dalej wyprzedawać Rosję, mają do wyboru; latarnia, albo sucha gałąź.\npozdrawiam.",
				"added": 1626115842
			}
		],
		"1626943982_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 14,
				"body": "Warto obejrzeć; Temat dla zaawansowanych.\nPozdrawiam.",
				"added": 1626978159
			}
		],
		"1626571418_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 15,
				"body": "Witam; \n*A będzie przymus dla niechętnych*?\n. Właśnie w zeszłym tygodniu Sejm, większością głosów uchwalił przymusowe szczepienia. Ustawa jest już uchwalona, pozostał tylko podpis naczelnika tego tworu \"Polin\". A że naczelnik jest rodzinnie związany z tym wytworem Fantazji? to nie będzie problemu uzyskać ten podpis; Pytanie tylko jest natury technicznej, kiedy zechcą to wprowadzić??? A to tylko oznacza, przejęcie kontroli nad zaszczypawkowanym ludem. Teraz to będzie taki Cesarz, \"NERON\"- Który będzie decydował kto przeżyje? a kto nie przeżyje. Czarne chmury zebrały się nad biedną Polin i jej podwładnymi. Plan ograniczenia tubylczej ludności do 15-milionów, może zostać w końcu zrealizowany z powodzeniem. Przed nami niedługo są jakieś wybory, być może że to będzie kartą przetargową. Przypomina to WESELE, - Wyspiańskiego?  \"  Miałeś chamie złoty róg\"?\nZnowu zaspaliśmy, znowu zdziwienie maluje się na naszych twarzach?\n.\nPozdrawiam . wszystkich tych z ręką w  / nocniku /.",
				"added": 1627868880
			},
			{
				"comment_id": 26,
				"body": "Ja to odbieram inaczej, jestem świadomie wolnym człowiekiem. Moje umiejętności nie ograniczają się do zamiatania ulicy? Mogę robić wiele innych rzeczy; Zawsze gdzieś pracę znajdę? Pozdrawiam.",
				"added": 1633349730
			}
		],
		"1624223308_1ANTSxbg7dbwM36JUsRuRiZYGVYz3JCrda": [
			{
				"comment_id": 16,
				"body": "Jasna sprawa; że te pisanie, trzeba traktować jako żart? Nie przyszło by mnie do głowy, że może być inaczej.\nPozdrawiam.",
				"added": 1628316763
			}
		],
		"1628313902_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 17,
				"body": "Tym razem; chyba to kto inny zaplanował? Zaczynam mieć takie podejrzenia. Jesteśmy zdalnie sterowani. Jedni lepiej, inni gorzej. Czarni, też chyba są sterowani??? Zachodzi takie podejrzenie. Puzzle, zaczynają się układać w pewien obraz.\npozdrawiam.",
				"added": 1628343543
			}
		],
		"1626719398_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 18,
				"body": "@kovkolev; Witam.\n*wspólna tych wszystkich wątków to totalna apatia*\n. To są działania zamierzone, robi się to za pomocą chemii. Podawanie pewnych składników chemicznych powoduje, stagnację organizmu i jego częściowe upośledzenie. Określane jako rezygnacja, apatia, śpiączka. Z tym, że są rożne rodzaje śpiączki? Poczynając od tej farmakologicznej, po tą taką delikatną. Jest to stan powolnego wyłączania organizmu. Ten proces odbywa się w ciągu dłuższego czasu. I jest trudno zauważalny, aż pacjent się wyłączy całkowicie. Dopiero wtedy rodzina i najbliższe otoczenie zauważa, że kogoś brakuje. W obecnej chwili jest ogólne otępienie całego społeczeństwa. Co przynosi właśnie takie skutki. Przyczyną były chemitralsy. \nPozdrawiam.",
				"added": 1628402266
			}
		],
		"1628512255_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 19,
				"body": "Szczepan, to przykład czarnego Humoru. To mogą tylko zrozumieć, ci nie zaszczepieni. Zaszczepieni? do nich już nic nie dociera.\npozdrawiam.",
				"added": 1629754852
			}
		],
		"1629908509_1XEUKPQw4XsNUf5m58LKvpAh6mqQuSHYT": [
			{
				"comment_id": 20,
				"body": "Potwierdzam; To Trucizna, która mocno szkodzi naszemu organizmowi. Proponuję się obudzić. To jest konieczny krok. Pozdrawiam.",
				"added": 1630687679
			}
		],
		"1629763452_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 21,
				"body": "Przeczytałem, i potwierdzam. Co parę lat, mieli robioną eksmisję, zachodzi pytanie dlaczego to było robione? Ktoś miał ich serdecznie dość; I miał władzę i moc aby to zrealizować.\npozdrawiam.",
				"added": 1630687949
			}
		],
		"1631358855_1AimmuFnBKDmQaYHzZerAJEHwsyBUddhMY": [
			{
				"comment_id": 22,
				"body": "Wypisz wymaluj, sytuacja na dzisiaj; Lepiej tego nie można opisać. Jakie refleksje? Jest to realizowane, punkt po punkcie... Zostało dokładnie tak zaplanowane, i dokładnie jest to tak realizowane. Bardzo trafna obserwacja. Co prawda ten opis, ma już wiele set lat? Ale trzymają się ściśle planu, i \"GO\" realizują.\npozdrawiam.",
				"added": 1631365382
			}
		],
		"1626904569_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 23,
				"body": "Sprawa telefonu? Im szybciej tym lepiej. Zamienić na stary model. Może go nie wyłączą?",
				"added": 1631888262
			}
		],
		"1632379028_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 24,
				"body": "Pośrednik na usługach służb, na trzy litery.",
				"added": 1632574700
			}
		],
		"1632945787_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 25,
				"body": "Ciekawa lista i statystyka; Potrzebny jest kalkulator, który policzy zabitych dla \"FIKSUM IDEI\" . To może być prawdziwa lista, bo pochodzi od \"onych\".",
				"added": 1632946493
			},
			{
				"comment_id": 28,
				"body": "*Skąd na to wszystko pieniądze*?\nWielki Brat drukuje po nocach, pieniądze pochodzą z DRUKARNI. \npozdrawiam.",
				"added": 1633889155
			}
		],
		"1633477933_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 27,
				"body": "Jeśli duża firma robi open source?  To już na dzień dobry to jest mocno podejrzana sprawa. Zazwyczaj niema takiej opcji. Firma musi szpiegować, inaczej nie może być firmą. Tutaj wszystko gra jak w Szwajcarskim zegarku. Po za tym Sekurak, jest dobry, ale jest stronniczy. I trzeba to umieć wychwycić i zrozumieć. Oni dostarczają dużo ciekawych informacji o swoich sponsorach? Trzeba tylko czytać pomiędzy wierszami. Są przydatni jako informator. Pozdrawiam.",
				"added": 1633889003
			}
		],
		"1633983362_1D7WTU4atd2a5vMGCwZL7FkKFy176Ac5Sb": [
			{
				"comment_id": 29,
				"body": "Witam; Ciekawa sprawa, pytanie na ile to cudo jest dobre? Dzisiaj Bios jest już tylko w starych kompach, w nowych jest już montowane- UEFI, i to jest zło, które jest wprowadzane pod przymusem. Do tego stopnia, że już dzisiaj tego nie można wyłączyć. Według mnie Bios nie jest najgorszym wynalazkiem? zachodzi takie podejrzenie, że wymiana, zamiana Biosu, ma na celu wdepnięcie w większe gówno niż jest Bios??? Pytanie retoryczne, jeśli jakaś firma proponuje, jakieś ulepszenie? To dlaczego to robi, i jaki ma w tym cel? Rozejrzyjmy się dookoła co się dzieje na świecie, sztuczna inteligencja przejmuje kontrolę nad wszystkim co jest żywe. Jedno jest pewne, stare wynalazki są dobre, wszystko co nowe, to prowadzi do zguby człowieka i przejecie kontroli nad nim... Dodatkowo zainstalowane ustrojstwa, zazwyczaj prowadza do zwiększonej kontroli człowieka. Pytanie? Czy my tego naprawdę chcemy???\nPozdrawiam.",
				"added": 1634016023
			}
		],
		"1634884167_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 30,
				"body": "Witam; działa. W takim sensie, że się zainstalował bez problemu. potem sprawdzę jak działa? Trzeba to dodać do spisu \"ZeroSites\". Bo tam jest główna informacja o stronach, które są tutaj do użytku. \nPozdrawiam.",
				"added": 1634888079
			}
		],
		"1636109745_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 31,
				"body": "Dobry wierszyk; mnie się podoba...",
				"added": 1636122146
			}
		],
		"1636327067_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 32,
				"body": "Ten problem, chyba został już rozwiązany? Co dla niektórych, a inni dalej smacznie śpią. Jak się obudzą, to będą w szambie po uszy siedzieli.  To tylko brak odpowiedniej Wiedzy...Sprawia nieudolność społeczną. Pytanie; czy można jeszcze coś zrobić? **Tak można ratować pozostałych, którzy jeszcze nie popełnili samobójstwa?**\n.  pozdrawiam.",
				"added": 1636396525
			},
			{
				"comment_id": 34,
				"body": "Z tego co słyszałem? Na granicy mają skanery, które odczytują numer posiadacza tego zastrzyku. Bo to jest celem tego zastrzyku. Tym dokumentem możesz sobie tyłek podetrzeć.\npozdrawiam.",
				"added": 1637153084
			}
		],
		"1636543084_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 33,
				"body": "Trudna sprawa? Popatrz na to z góry. Tak bardzo z wysoka, tak żebyś zobaczył cała granicę. \nOtwórz swoje trzecie oko? To bardzo pomaga w jasnowidzeniu. I nie będziesz musiał nikogo prosić o weryfikację; Samemu wszystko zobaczysz, jak na dłoni.\npozdrawiam.",
				"added": 1636549266
			}
		],
		"1637657368_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 35,
				"body": "Powinieneś napisać tak;\n. nic nie posiadam → POSIADAM WIEDZĘ. i korzystam z niej.\n. nie jestem za nic odpowiedzialny → JESTEM ODPOWIEDZIALNY ZA SIEBIE. i za to co robię.\n. nie myślę → MYŚLĘ SAMODZIELNIE. i korzystam na tym.\n. jestem szczęśliwy, → I TO MOŻE POZOSTAĆ .+ JESTEM  NIEZALEŻNY. i nikomu nie podlegam.\n. JESTEM , ŻYWYM  I  WOLNYM  CZŁOWIEKIEM.\nPozdrawiam.",
				"added": 1637692542
			}
		]
	},
	"comment_vote": {}
}