{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Tokyofacefuck全集",
			"body": "Tokyofacefuck全集\n\nmagnet:?xt=urn:btih:977892B2FB3DE02FDA87110B01A68008FE42FF7A",
			"added": 1517726726,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "1982年，中国的人均产值刚好与非洲的2个穷国坦桑尼亚，赞比亚持平，中国人的生活水平比非洲还低。",
			"body": "1982年，中国的人均产值刚好与非洲的2个穷国坦桑尼亚，赞比亚持平，中国人的生活水平比非洲还低。\n\n其实，自大跃进，人民公社以后，中国人的生活就一直比非洲还差，是全世界最差的，只是我们不知道，与现在一样，我们以为自己是全世界最好的，是全世界最幸福的，是共产主义的接班人。真的好愚蠢。一直差到90年代。但是这并不影响毛泽东慷人民之慨，拿大量的从民众身上搜刮来的钱，送到非洲去推动共产主义运动。在非洲制造动乱，制造饥荒，制造贫穷。\n\n幸好大多数的非洲人还没有愚蠢到中国人的程度。杀地主，分土地，分浮财，这种恶劣行径也不为非洲人的道德所接受。共产主义只在非洲几个特别贫穷的国家制造了一些动乱，大多数的非洲国家并没有被毛贼搞乱。不过也有像津巴布韦这样的非洲富裕国家，原来是非洲的粮仓，中了共产党的邪，变成了非洲的穷国。这也是报应吧。凡是愚蠢到相信共产党，想不劳而获的国家，都遭到了这种报应。\n\n所以，直到90年代初期，非洲人总体的生活还是比中国人好得多。\n\n自90年代以来，中国在西方的技术与资金的扶持下，经济获得了很大的发展。不过，经过这30年的发展，中国人总体的生活水平是否真的已经超过非洲了？我是有存疑的。\n\n1982年时，中国人的生活水平是低于非洲生活水平的平均值的。\n1992年时，中国人的生活水平是不可能高于非洲生活水平的平均值的。因为西方资金与技术还没有大规模进来。\n2002年时，中国人的生活水平应该可以达到非洲人的平均生活水平的。是否真的达到非洲的生活水平不清楚。\n2012年时，中国人的生活水平应该超过非洲的平均生活水平的。\n2017年时，中国人的生活水平应该赶上非洲人的生活水平有10多年了。\n\n但是中国的贫富差异非常大，收入严重不公，腐败遍地都是，大量的资金被盗国集团转移到了国外。中国人要养活世界上最多的公务员，政务员；中国人要养活200多万党卫军；中国人要养活200多万武警，特警，国宝，国安，治安警，户籍警，交通警，协警；中国人还要养活数量庞大的党校，包括党校的教授，员工，设备，资产，以及党校的学生学习期间的工资，待遇，旅游的费用；中国人还要养活数量庞大的城管。\n\n中国人要养活每个国营企业都有的党，政，工，团，四套班子；中国人还要养活数量庞大的各种政府部门；中国人还要以非常高的代价养活中共各种级别的“离休干部”；中国人还要为中共的各种级别待遇支付高昂的成本，这些级别待遇都是不公开的。\n\n由于中共这种反人类，反人性的政治体制在世界上普遍遭到唾弃，中共不得不每年拿出巨额的资金在世界各地收买各种有影响力的人物为其辩护；不得不拿出大量的资金去支持世界上残留的独裁国家，互相支持，对抗文明进步，对抗民主制度；也不得不拿出大量的资金去收买一些贫穷国家，以换取他们的支持。当然中共贪腐集团在这里面也有巨额的回扣。\n\n从这样的局面判断，中国30年发展的财富只是集中在红二代与贪官集团手里。中国人总体的生活水平可能还是比非洲差，只是比90年代初好点而已。\n\n中国有2亿贫困人口，这2亿贫困人口的生活水平是低于非洲的平均生活水平的。\n中国还有几千万上访人口，这些上访人口都被中共弄得家破人亡。这些上访人口及其家人的生活水平也是低于非洲的平均生活水平的。\n这2亿多贫困人口加上几千万的上访人口及家人，占中国总人口的20%以上。也就是说，中国有超过20%的人口的生活水平是明显低于非洲的平均生活水平的。",
			"added": 1517755179,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"6_1FmYoFUbNXqpJ4v42ZGfVRKNaodu25YK8B": [
			{
				"comment_id": 1,
				"body": "@z777 “奠定了将来中美共治天下的格局”\nsb，美国收完朝鲜，收中国。中国是个独裁的国家，中国分裂是必然的\n美国不搞中国。人民都要推翻中国",
				"added": 1492944991
			}
		],
		"4_1FmYoFUbNXqpJ4v42ZGfVRKNaodu25YK8B": [
			{
				"comment_id": 2,
				"body": "你咬我，我咬他。他咬你,~~~~~~~互咬，最后大家互斗。大家一起死。政府的不用发养老金，你我他，大家的买的医保。养老金,白交了,最后搜集大家的财产充公（表面是充公，其实是政府贪污掉}政府爽了，又减少了开支，把大家搞死了，留下了少部分人{赵家人}\n其实重复毛泽东时代的历史\n最后政府赢，赵家人赵家人赢.",
				"added": 1492946068
			}
		],
		"1_1CsBzW7HXzS2qQ5h44s4ox6Wyzuh7pYLau": [
			{
				"comment_id": 3,
				"body": "@cvz\n对于5毛，我只骂，操你祖宗，这里不是百度贴吧，想给政府洗地，来错地方。sb",
				"added": 1492946390
			}
		],
		"2_1FmYoFUbNXqpJ4v42ZGfVRKNaodu25YK8B": [
			{
				"comment_id": 4,
				"body": "good",
				"added": 1492946431
			}
		],
		"4_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF": [
			{
				"comment_id": 5,
				"body": "你智商要充值，看不懂就不看，郭文贵爆料很烧脑的！",
				"added": 1517755346
			}
		]
	},
	"comment_vote": {
		"18_19cRyPGSta8PujvJcmhDfjQewRbm4H88qk": 1
	}
}