{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Hola.\nMuy interesante tu blog, ¡te felicito! Interesante también que hables de este tema en particular.\nUna traducción más precisa de la oración que citaste, es: \"Tus votos están asociados a tu ZeroID, ellos son pseudónimos, pero no anónimos. Con un poco de trabajo alguien puede averiguar lo que tú (tu ZeroID) has votado.\"\nCada usuario en ZeroNet tiene un nombre asignable, si es que quiere participar de la red en forma activa (y no solo pasiva). Eso ocurre en otras redes P2P, y tiene que ser visto como un problema o defecto funcional. \nEl pseudonimato no es algo que en las redes necesariamente ponga en peligro nuestro anonimato. Ello depende mucho de cómo se comporte el usuario, del uso del pseudonimato de acuerdo al contexto y el fin.\nPor ejemplo: es posible crear un e-mail pseudónimo, utilizarlo y permanecer en el anonimato. \nEs posible decir que el pseudonimato puede ser anonimato. Lo que a lo mejor se refiere la oración con \"anonimato\" es a la ausencia de \"nombre registrado\" (en general) o de \"asociación de otros datos con el usuario que vota\".\nEs un asunto interesante, para conversar largo rato, ¿verdad?\nSaludos.",
			"post_id": 42,
			"date_added": 1459771107
		},
		{
			"comment_id": 2,
			"body": "Disculpas, que escribí algo mal.\nEn donde dice: \"Eso ocurre en otras redes P2P, y tiene que ser visto como un problema o defecto funcional.\"\nQuise decir: \"(...) y [NO] tiene que ser visto como un problema o defecto funcional.\"",
			"post_id": 42,
			"date_added": 1459771367
		},
		{
			"comment_id": 3,
			"body": "¡Bien por la entrada que has escrito! \nRetroShare es prometedor, gracias a la cantidad de servicios que ofrece. Tiene, además, una interfaz bastante buena (aunque debe mejorar).\nEl problema con RetroShare es que cierto tipo de servicios, como pueden ser e-mail, foros o blogueo, no tienen mucho sentido si se trata de redes \"amigo-a-amigo\". \nCon el chat individual y grupal (siempre \"amigo-a-amigo\") esos servicios pierden valor. Tales servicios deberían estar pensados al modo de una estructura de acceso público o de mayor alcance, como la que ofrecen en blogueo y foros: ZeroNet y Twister; o en el caso del servicio de e-mail: I2P-Bote, I2P-Bitmessage y Bitmessage.\nEn relación al anonimato del nodo RetroShare, tenemos que considerar dos cosas: ¿(1) quieres anonimato respecto de tus contactos o (2) respecto de tu ISP? Son dos cosas distintas.\nRespecto a tu ISP (y el espionaje masivo), lo tendrías al usar un nodo oculto (con Tor o I2P ). Si quieres tener anonimato respecto a tus contactos, ya es pedir algo estúpido, dado que esta red es \"amigo-a-amigo\", lo cual implica que: \"no agregas a alguien si no confías en él, o si no le conoces\".\nDe acuerdo a la estructura y servicios ofrecidos por RetroShare, intentar utilizarlo para contactar a alguien de forma anónima: es pedirle peras al olmo. No tiene sentido, y para eso existen otros medios. \nEn todo caso, es allí donde RetroShare debería plantearse si abre la posibilidad en su red de que ciertos servicios no requieran de una aprobación o conexión \"amigo-a-amigo\", y esto sin revelación de IP.\nSaludos.",
			"post_id": 38,
			"date_added": 1459775384
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}