{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Agnès Buzyn, la juive qui a réussi à nous vacciner de force...",
			"body": "Je suis particulièrement choqué par la stupidité congénitale de cette femme et de ceux suffisamment naifs pour croire en sa superiorité génétique. Comment pouvons nous être réduit à moins que des animaux car cette femme juive s'abroge le droit de décider pour nous ce que nous faisons avec nos propres corps. \n\nPolanski peut violer qui il veut, elle peut disposer de nos corps et de celui de nos enfants.\n\nComme quoi les fils des Gaules valent moins que des bovins.\n\nEt pire, c'est leurs propres frères, fiers de leurs insignes et tshirt bleus qui impose cette tyrannie médicale, fruit d'une idéologie totalement suprémaciste. Mais bon, des incultes, ignares et dans l'impossibilité de s'éduquer sur ce sujet si sensible, ne peuvent comprendre.\n\nQuand le cri de la liberté se confond avec le déspoir certain de vivre la dictature et la domination d'un autre peuple, cherchant avant tout à favoriser les siens dans un esprit de revanche consummé, un avenir radieux s'offre aux seigneurs de la guerre, qui pour une fois, pourront se battre et gagner au côté de la liberté, celle qu'un peuple étranger, malgré tout les efforts d'acceptation et d'ouverture choisit d'abuser pour réduire les fils des Gaules, à moins que des animaux.\n\nLaissez les faire, et vous n'en serez que plus enragés... vous verrez, dans la souffrance de vos propres enfants, juifs et français... pour avoir suivi le culte d'une traitre, au peuple juif et surtout à la France.\n\nMalheureusement, elle fut protégée, et comme avant, sur tous, cela retombera. Dire qu'il aurait suffit de dire non à l'ingérence que cette femme juive, qui pour soutenir son industrie, décida, encore une fois, de conduire à l'abime le peuple dont elle prétent être issu.\n\nQui peut dire qu'il n'y a pas de traitre en son sein? Certainement, ceux qui ne les combattent pas.\n\nNous nous batterons pour être libre et établir une domination et souverainté totale sur nos corps, vaccinez-vous si vous le souhaitez, mais laissez nous libre, vous êtes vacciné, mais nous savons, que ce n'est pas la question...\n\n",
			"added": 1589617361
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 1,
				"body": "vaccinations obligatoires, plantes illégales, pédophiles libres, impôts de malades, liberté d'expression annéhantie, dettes nationales exponentielles,  droits politiques inéxistants complétés par une législation extravaguante, mais de très belles contrées...\n\n\"11 Dieu dit : « Que la terre produise l’herbe, la plante qui porte sa semence, et que, sur la terre, l’arbre à fruit donne, selon son espèce, le fruit qui porte sa semence. » Et ce fut ainsi.\n\n12 La terre produisit l’herbe, la plante qui porte sa semence, selon son espèce, et l’arbre qui donne, selon son espèce, le fruit qui porte sa semence. Et Dieu vit que cela était bon.\n\n13 Il y eut un soir, il y eut un matin : troisième jour.\"\n\nbonne chance et prenez plaisir... cela ne fait \"que\" commencer pour nous, et pour vous finir.\n\nmerci de votre présence, pour nous montrez ce qui n'est point.",
				"added": 1589617990
			}
		]
	},
	"comment_vote": {}
}