{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1584053180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Iodine is depleted in the soil. Buy a supplement, nascent and a potassium iodide. Avoid bleach/chorine, bromide (found in bromated flour), and fluoride (found in tap water and toothpaste). These are all halides and they all compete for the same receptors, you need iodine to bind for proper hormone production and oxygen absorption. As far as dementia, it's basically a type III diabetes. Could be other toxins causing it, but usually it's just sugar OD. Also, viruses are fake, they are just exosomal secretions everyone makes. 380 trillion viruses/exosomes are in you right now. The people on the news are exploiting the trauma you experienced (learning lies and a child). It's hard to UNlearn things, like G. Washington wasn't the first president, the heart does NOT \"pump\" blood (it's nature of the vesicles that cause the flow), and Pathogenic viruses have never been proven to exist. Everyone is lost because they have been educated, it would serve you better to pour through research papers rather than designating someone to tell you what's in there. If you don't know how to ask proper questions, you will only be filled with the answers your \"owners\" want you to have.",
				"added": 1585829980
			},
			{
				"comment_id": 2,
				"body": "Also, \"garbage in, garbage out\" rang true to me, that's why I commented. In regards to \"viral\" infections, which there isn't, when your body absorbs too much garbage, it has to eventually come out, or form a tumor. Snot/mucus is one of the garbage out phases of a flu/cold. Pissing and shitting is when you're body is ready to purge the daily garbage, a cold is the bodies bacteria working to expel garbage from other places. A \"viral\" infection is when exosomes carry out the garbage, it's like the bodies natural detergent, but it only cleans when it's really garbagey. It's seasonal in nature, as is animal hibernation, but with humans, it's a time to purge the body. It's most likely triggered by certain light exposure periods, combined with temperature, its not caused by being close to someone else purging garbage.",
				"added": 1585830648
			},
			{
				"comment_id": 3,
				"body": "A good question to ask yourself when a bunch of people start dying is what; do you ask about the genetics of the dead, do you ask about the different biology of a sick person compared to a healthy person, or maybe you ask what it is that they ate? When a house is on fire, and you see firemen present, do you say the firemen caused the fire? They are there, and they weren't before, hmmmmmm, I guess they started the fire duuuuuhhhhh. Idiots will believe that. Unfortunately, that's how viruses are \"proven\" to exist, they see them present in people on fire/sick, and assume because there are particles present in sick people they must be causal in nature. Why are people so retarded. Then even more retarded people believe it. Then we all get quarantined because people are fucking oblivious, and take orders very easily.",
				"added": 1585831183
			}
		]
	},
	"comment_vote": {}
}