{
	"title": "braindump",
	"description": "tech blog. comments welcome.\n\nexternal links kept to a minimum.\n\ncontrbutors:\nhomebrew@zeroid.bit",
	"links": "*   [ZeroNet Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1504322094,
	"post": [
		{
			"post_id": 5,
			"title": "ZeroNet - Nomenclature",
			"date_published": 1504272660.012,
			"body": "```\n{\n  'date': \"01/09/2017\",\n  'status': \"DRAFT\",\n  'author': \"homebrew@\"\n}\n```\n\nIn the context of this blog and its associated intellectual property, the following terms are adopted.\n\n*   \"0net\" or \"ZeroNet\"\n\n*   \"0net site\" or \"ZeroNet site\" - \"Zite\", A site or collection or pages on 0net"
		},
		{
			"post_id": 4,
			"title": "git-remote-helpers",
			"date_published": 1504232453.648,
			"body": "```\n{\n  'date': \"01/09/2017\",\n  'status': \"DRAFT\",\n  'author': \"homebrew@\"\n}\n```\n\nAs I started out working through the ways that I could wrangle git into working over ZeroNet, I ran across this \"[Zite](http://127.0.0.1:43110/1xxooZ7s8iDz3u56i5mNQ1XGmwF8Zvnw9/)\" (still not 100% sold on the nomenclature) which came packaged with a shell script designed to help git interact with 0net. While it doesn't appear to be doing anything malicious, it also isn't very easy for humans to parse. To date, I haven't had to deal much with `git-remote-helpers` outside of the normal indirect uses (`git-remote-http`, `git-remote-https`, `git-remote-ftp`, etc.). The installation instructions given on the above-referenced Zite told me to simply add the script to my `$PATH`. As any good citizen of the open-source community, my first mission was to understand what exactly I would be adding. It was time to do some research.\n\nI spent two hours going over each line of the shell script trying to determine how it worked. When I was done, I had a few takeaways and a path forward:\n\n*   The script takes the following commands as arguments in a switch-case statement:\n\n    *   `capabilities`, `list`, `import`, and `export`\n*   The shebang and author lines listed both a Felipe Contreras and a modifier or Peter Cai\n\n    *   A Google search for the former's GitHub turned up a couple of projects relating to bridging git into other Content Versioning Systems (CVSes)\n\n        *   This led me into the official git documentation around how this bridging is accomplished\n*   Finally, I came to the totally personal opinion that this particular shell script would be better served in a language which could more expressively describe its intent\n\n    *   Python, node.js, or Java implementation to follow - self-imposed deadline of 9/9/17\n\nWe know that you have many choices when considering hard drive space and we'd like to thank you for choosing to peer `braindump`. Don't be a stranger. Leave a comment, share this post, or leave a like if you're enjoying what you read."
		},
		{
			"post_id": 3,
			"title": "Git over ZeroNet",
			"date_published": 1503931698.378,
			"body": "```\n{\n  'date': \"01/09/2017\",\n  'status': \"DRAFT\",\n  'author': \"homebrew@\"\n}\n```\n\nSomeone has beaten me to the punch on getting git to work with ZeroNet. Git over ZeroNet Project can be found [here](http://127.0.0.1:43110/1xxooZ7s8iDz3u56i5mNQ1XGmwF8Zvnw9/). There is an opportunity to build a GitLab instance or something like it over the top of this integration. There is also an opportunity to improve the git plugin. I don't know a lot about writing git plug-ins, but I assume they need to be made cross-platform.\n\nDisclaimer: I have reviewed the code for the above git over ZeroNet project, but I don't affirm that it isn't doing something sneaky.\n\n[0git](http://127.0.0.1:43110/12qyhjFvaCdbCwcsRX813aPwagd6FycFiU) also exists as a means to point to ZeroNet git-esque repositories.\n\nThere is a bit of in-progress work [here](http://127.0.0.1:43110/1Nv8Y4Luger3g3Q7rqwtQYJRbhQc6disDM/) as well. This \"GitMirror\" looks the most promising to me right now."
		},
		{
			"post_id": 2,
			"title": "Starting ZeroNet Service Development",
			"date_published": 1503867602.945,
			"body": "```\n{\n  'date': \"01/09/2017\",\n  'status': \"FINAL\",\n  'author': \"homebrew@\"\n}\n```\n\nBased on a [recent conversation](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:2_1M78zG4cdm2osFEpXApCHxh6bu936kgte6/Dropbox+for+ZeroNet) in ZeroTalk, it's come to my attention that we may not have a means use ZeroNet as a medium for distributed storage solutions. A few interesting services, like [IFS](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/), did come out of the conversation, but nothing really scratched my itch. In this same vein, I have also started looking for other basic developer services like Open Source git solutions like GitLab to bring our builds completely off of the non-distributed Internet. I will be spending the next couple of weeks putting together a list of services which either already exist here in ZeroNet and those that I think would benefit the community. Stay tuned."
		}
	]
}