{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1565241348_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw": [
			{
				"comment_id": 1,
				"body": "You probably mean removing users.json from zeronet/data folder\nHowever that way you will lose all of your certs unless u backup them somewhere",
				"added": 1565242391
			},
			{
				"comment_id": 2,
				"body": "> [nowotny](#comment_2_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw): I've removed it and restarted ZeroNet, and it of course made a new users.json file. But on 08chan, for example, old posts I made are still recognized as mine \"(You)\", it shouldn't be doing this, should it?\ntry also removing millchan.db inside of 08chan folder (1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D)",
				"added": 1565243512
			}
		],
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 3,
				"body": "Goodbye for now\nCheck it out in next week or two",
				"added": 1565338515
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 4,
				"body": "Type netstat and start collecting\nBut who cares? They are going to jail us just for speaking? Better they should try fixing their heads first :^) \nThey are crazy more most of those 8ch anons",
				"added": 1565359959
			},
			{
				"comment_id": 5,
				"body": "> [trevorlaneray](#comment_11_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Ehh, I'm not a boomer, but I am pretty new to this.I went ahead and enabled \"Tor: Always\" almost immediately after starting.Am I doing it right? >.<\nIf you are afraid of (((them))), but its not way of doing it. There is fear prison first. \nOnce you get out of it, switch Tor just to enabled and help improving network by normal p2p connections\nYou can always use VPN as bridge so your ISP eventually wont call you.\nI hate those sort of phones :^)",
				"added": 1565360331
			},
			{
				"comment_id": 6,
				"body": "> [theosis](#comment_43_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): If you're ok with slower speeds you can continue running it through Tor to feel more secure. But ultimately, unless you're sharing some kind of illegal content like CP, you have nothing to worry about.\n\nTo be honest on imageboards that might happens very often.",
				"added": 1565361585
			}
		],
		"1565420698_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 7,
				"body": "It is implemented on some cloud drives. They scan users folder for files hashs and that way can found out if someone used to have cp etc. So yea there also must be big databases with hash list done of those images.",
				"added": 1565422235
			},
			{
				"comment_id": 8,
				"body": "> [crazylime](#comment_19_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): That appending of new hashes today begins with a process of \"trusted\" humans identifying the images then submitting it through a trusted and controlled process.  That becomes very difficult to distribute in a p2p world because w/o that central trust and control, you open the door to DOS attacks.  e.g., a bad actor could scan all images of a target site and submit the hashes even though none may belong in the category.   [...]\n\nYea..on here it would feel very much like starting point for some sort of censorship",
				"added": 1565426680
			},
			{
				"comment_id": 9,
				"body": "> [p0rtal](#comment_9_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2): Anyone could easily change resokutiin or change a few pixels and create new hashes?\n\nYou dont even really need to change pixels \nhttps://archive.is/rr5tY",
				"added": 1565429029
			}
		],
		"1565448182_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 10,
				"body": "take a look on users.json inside your zeronet folder",
				"added": 1565448423
			},
			{
				"comment_id": 11,
				"body": "> [r3naam3r](#comment_18_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): OK that's nice but there should be a GUI way to do it too, IMHO\n\nyou might be interested with multiuser plugin then\nto activate it go into your core\\plugins and rename disabled-Multiuser on Multiuser\nthen restart zeronet\nas far as I remember\nthat will purge your ID each time and generate random one\nyou might have some problems though so I suggest reading doc",
				"added": 1565449008
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 12,
				"body": "its high tier risk to be... one of higher tier peoples :^)\nreally stay away from them\nits root of evil",
				"added": 1565449578
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 13,
				"body": "> [kaffie](#comment_991_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I use DuckDuckGo. But \"google it\" is just engrained in my speech. \"duck it\" isn't really as clear and \"search it online\" is a mouthful.\n\n>duck it\nhaha :^)",
				"added": 1565512365
			}
		],
		"1565519074_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 14,
				"body": "I would like send to him some great music albums\nMusic is like letter from god himself",
				"added": 1565519808
			}
		]
	},
	"comment_vote": {
		"18_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"1_1KNcQiX9JErJn8MXidipvWEvXrFdgY6shE": 1,
		"19_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"5_1PVDwMjZ8jDs5sbGH3q92xNNHR8iHCC4ya": 1
	}
}