{
	"message": [
		{
			"body": "La prochaine présidente c'est Angelique Delorme",
			"date_added": 1564570668839
		},
		{
			"body": "Je viens de faire quelques recherche - Elle est \"juste\" passée par HEC, mais entrée à 18 ans (a priori 2 classes sautée et entrée 3/2) - Elle a mis 4 ans à faire l'école, car y inclus un MBA - L'année suivante on ne sait pas ce qu'elle fait (trou dans le CV) - Elle fait ensuite un M2 de droit - Il se passe 2 ans où on ne sait à nouveau pas ce qu'elle fait, probablement des échecs au concours de l'ENA avant d'y entrer finalement - Elle fait l'année d'ENA en 2012  Bref, le gros point noir de son parcours c'est qu'entre sa première année supposée d'étude (2001 en prepa) et sa première expérience professionnelle après l'ENA (2012, niveau master) il s'est passé... 11 ans. 10 ans si on compte l'année de l'ENA comme déjà \"pro\" suite au concours.  Grâce à ça elle entre au conseil d'Etat puis devient en avril Directeur général adjoint du musée du quai Branly. Entre temps elle a eu deux ans d'expérience dite \"Maître de conférence\" en parallèle de son poste au Conseil d'état. L'appellation Maître de conférence est douteuse, car c'est un emploi à temps plein qui comporte de la recherche pour 2/3 environ, et elle n'en a pas. Soit elle a grugé et été payée pour de la recherche inexistante, soit l'intitulé est faux et elle a juste eu seulement un contrat d'enseignement.  C'est une administrative pure avec formation de droit. Elle n'a aucune expérience en entreprise, aucune expérience autre qu'administrative, et une formation et un métier non techniqu",
			"date_added": 1564570680596
		},
		{
			"body": "Si elle devient vraiment présidente alors là c'est fort parce que des gens d'extrême droite le savaient avant moi, avant que le sondage qui dis qu'elle a de plus en plus d'influence paraissent et j'ai encore du mal à les croire, les message concernant Angelique Delorme sont en train d'être effacé d'internet",
			"date_added": 1564570886657
		},
		{
			"body": "https://www.youtube.com/watch?v=3aFFp-V7Faw&feature=youtu.be allez faites vite big.kopykate car cette vidéo sera surement peut-être censuré",
			"date_added": 1564571336116
		},
		{
			"body": "3 filles en tête 2 dans le privée 1 dans le publique",
			"date_added": 1564571532599
		},
		{
			"body": "Vague d'haineux qui se mettent a utiliser zeronet aujourd'hui",
			"date_added": 1565003340812
		}
	]
}