{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "{Chez Toutoune} : Téléchargement de gros fichiers 100% Zeronet ;-)",
			"body": "Bonjour à tous !\n\nJ'ai découvert ZeroNet il y a quelques temps, ce réseau me plaît beaucoup pour de nombreuses raisons qui vous ont certainement amené à le découvrir également. Pour aller plus loin, je me suis décidé à créer un pt'tit site; l'idéal étant qu'il intéresse d'autres personnes que moi-même ! Je me suis donc attaqué au problème de partage des gros fichiers ;-) \n\nForcément, la distribution sera lente au départ (ADSL + TOR), mais devrait rapidement accélérer si le site est diffusé.\n\nAlors voilà, voici ma première réalisation, je souhaite partager avec vous quelques films pour attirer la communauté francophone vers cette belle solution d'Internet enfin libre et décentralisé.\n**\n##http://127.0.0.1:43110/1DnAiazfBu9o2EitCqeYqo5qKJKKsDcBpo\n**\n{Toutoune}\nZeroMail : toutoune@zeroid.bit",
			"added": 1501876107
		}
	],
	"topic_vote": {
		"1_1JGx6kKGTzjRrxDB9PPbJ4AcSPdY7UkQwb": 1
	},
	"next_comment_id": 42,
	"comment": {
		"1_1JGx6kKGTzjRrxDB9PPbJ4AcSPdY7UkQwb": [
			{
				"comment_id": 1,
				"body": "> [padtrique](#comment_11_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): Salut! J'ai testé, l'accès au zérosite fonctionne ;) Seul le lien du film ne fonctionne pas .. Sinon, j'adore l'idée (et le projet) lol\n\nSalut padtrique, normalement, ça \"doit\" fonctionner. Sur le micro-site du film, tu n'as pas de fichiers en cours de téléchargement ? A chaque bloc téléchargé tu dois avoir une infobulle. Sous quel navigateur es-tu ?",
				"added": 1501878089
			},
			{
				"comment_id": 2,
				"body": "> [padtrique](#comment_12_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): J'ai accès au microsite du film. Je suis sous Mac OS Sierra avec Firefox ;) Je n'ai pas les liens des parties du film ni les infobulles .\n\nTu devrais avoir 4 boutons violets \"Télécharger le pack n°1\"... en scrollant vers le bas, sous l'affiche. Vraiment bizarre que tu ne vois pas les boutons, c'est juste de l'affichage ! De mon coté je suis sous Windows et visible sous Firefox, IE, Opera.",
				"added": 1501880251
			},
			{
				"comment_id": 3,
				"body": "> [padtrique](#comment_13_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): Ca ne marche toujours pas. J'ai désactivé Ublock (on ne sait jamais). Cest quoi ton zeromail ? Peut être que j'arriverai à t'envoyer la capture d écran...\n\nCa ne marche pas ou tu ne vois pas du tout les 4 boutons ? Je n'ai pas de ZeroMail, je vais regarder ça. Ca fonctionne avec l'Id ZeroId ? Sinon pas de pb avec AdBlock, il n'y a aucun accès extérieur au site que ce soit dans le HTML ou JavaScript.",
				"added": 1501882838
			},
			{
				"comment_id": 4,
				"body": "> [lola](#comment_2_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): Salut padtrique,\n> Le téléchargement de fichier important est en effet un problème de ZeroNet. Il est aussi possible d'utiliser Webtorrent pour le partage de gros fichiers et ce directement dans le navigateur ou tu peux aussi utiliser un plugin qui utilise libtorrent. Je travaille d'ailleurs sur un de ces plugins (https://github.com/rllola/zeronet-torrent-plugin). Par contre gros problème, ces solutions ne passent par TOR et sont donc aussi sécure que le VPN qu'on utilise.\n>  Pour en revenir à ta solution je me demandais si tu pouvais utiliser des hubs au lieu de créer un nouveau site à chaque fois qu'on veux télécharger un film ?\n> PS: J'aime beaucoup le design de ton site.\n\nSalut lola,\n\nPeux-tu me dire si tu arrives à lancer un téléchargement de ton coté ? J'ai réfléchi, je vais essayer d'améliorer le code JS, j'ai une idée. Je ne connais pas la notion de HUB sur Zeronet, c'est quoi ?.\nEn précision, j'utilise les micro-sites car les fichiers de films sont en optionnels et sont chargés \"à la demande\". Je souhaite que chacun puisse choisir quel \"gros fichier\" il souhaite récupérer et partager avec la communauté facilement. Si tu ne veux pas partager un film par exemple, tu supprime son micro-site et hop !\nMerci pour le design, c'est un template CSS que j'utilise, je l'ai pas fait  \"à la mano\". As-tu le même problème d'affichage que padtrique ?\n{Toutoune}",
				"added": 1501926568
			},
			{
				"comment_id": 5,
				"body": "> [padtrique](#comment_15_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2/padtrique@zeroid.bit\n\nSalut padtrique,\n\nJe viens de voir ta capture, ya un pb, l'affichage du site n'est pas bon sur ton poste, on dirait que le titre déborde complètement sur les boutons alors qu'il devrait être sur l'affiche. Essaie de dézoomer pour voir.",
				"added": 1501926711
			},
			{
				"comment_id": 6,
				"body": "Bonjour à tous,\n\nMerci pour vos retours, je viens de mettre à jour les deux micros sites de téléchargement. Il n'y a plus d'info bulle au téléchargement de chaque bloc. En demande de téléchargement d'un pack ZIP, une info indique si tous les blocs du pack sont disponibles. Si NON, il demande à ZeroNet de les récupérer (vous verrez des fichiers en attente sur ZeroHello) et vous invite à réessayer votre demande plus tard. Pendant ce temps, c'est comme pour un torrent, on laisse ZeroNet bosser. Si OUI, l'assemblage du ZIP démarre, au bout de 30 secondes à 1 minute, votre navigateur devrait vous proposer de l'enregistrer.\n\nN'hésitez pas à me faire vos retours sur l'aboutissement du téléchargement, et au final, la récupération du film. Si plusieurs d'entre vous téléchargent et laisse en partage un micro-site (merci de le faire !), cela devrait être de plus en plus rapide pour les autres. Et on oublie pas l'activation de TOR ;-)\n\nEn rappel, j'ai décidé de créer 1 micro-site par téléchargement afin que chacun contrôle précisément ce qu'il décide d'héberger pour les autres.\n\nA vous lire !\n{Toutoune}",
				"added": 1502106379
			},
			{
				"comment_id": 7,
				"body": "Bonjour à tous,\n\nAprès quelques essais non concluant (au point que les téléchargements devaient être inopérants), je viens de faire une mise à jour. Les films sont désormais hébergés par des hubs ZeroNet, il n'y a plus de décrochage vers les micro-sites mais une page dédiée sur le site principal.\n\n{Toutoune} ",
				"added": 1502398171
			},
			{
				"comment_id": 8,
				"body": "Bonjour,\n\nJe rencontre quelques soucis avec les \"merged sites\", le téléchargement des morceaux ne fonctionne plus correctement; je suis actuellement en vacances mais je regarde ça dès que possible..\n\n{Toutoune}",
				"added": 1503168834
			},
			{
				"comment_id": 9,
				"body": "Nouvelle MAJ, merci de vos retours.\n\n{Toutoune}",
				"added": 1503217865
			},
			{
				"comment_id": 10,
				"body": "Bonjour,\n\nCette fois la mécanique de téléchargement semble OK (sous firefox). Merci de vos retours pour savoir si ça marche chez vous ou pas !\n\nJe vais commencer à ajouter du contenu un peu plus récent que les 3 films.\n\n{Toutoune}",
				"added": 1506117720
			},
			{
				"comment_id": 11,
				"body": "Quelques films ajoutés :\n\n- Les gardiens de la galaxie 2\n- Jour J\n- Alien : Covenant\n\nPirates des caraïbes 5 en approche... ;-)\n\n{Toutoune}",
				"added": 1506238489
			},
			{
				"comment_id": 12,
				"body": "Pirates des caraïbes 5 online ;-)\n\n{Toutoune}",
				"added": 1506282658
			},
			{
				"comment_id": 13,
				"body": "Salut Sorcier,\n\nMerci, je vais moi-même passer sur raspberrypour être online 24/7. Par contre j'ai un 2, on va voir ce que cela donne ! Pour mon site, la prochaine étape est de passer en base de données pour la bibliothèque...\n\n{Toutoune}",
				"added": 1506361964
			},
			{
				"comment_id": 14,
				"body": "> [padtrique](#comment_27_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): Les cartes SD souffrent des multiples écritures dûes au fonctionnement du système.. Un disque dur est bien plus résistant ;)\n\nEt pour la capacité de stockage aussi !",
				"added": 1506444488
			},
			{
				"comment_id": 15,
				"body": "Migration sur Raspberry pi en cours... Dispo 24/7 pour bientôt.\n{Toutoune}",
				"added": 1506848016
			},
			{
				"comment_id": 16,
				"body": "> [sorcier](#comment_5_1Fz6NqfXREtMbJPa3Sciz6d15TZgdNsR6V): Perso, je lance zeroNet dans un screen que je détache par la suite... Je n'ai pas réussit à le lancer en mode \"daemon\", j'ai bien essayé le paramètre --silent, mais ça fait planter le terminal et le clavier.Si tu parviens à le faire démarrer automatiquement et correctement en cas de coupure, je suis preneur!!! Car j'ai bien ajouter la ligne de commande dans /etc/rc.local, mais ZeroNet renvoie systématiquement toutes les sorties à l'écran!!\n\nSalut,\nCa y est, mon serveur Zeronet est installé sur raspberry en 24/7. Pas de pb pour le démarrage au boot (Raspbian lite sans bureau graphique).\n\nEditer le fichier rc.local :\nsudo nano /etc/rc.local\n\nAjouter la ligne suivante avant exit 0 :\n/usr/bin/python /chemin/de/Zeronet/zeronet.py --ui_ip W.X.Y.Z &\n\n{Toutoune}",
				"added": 1507488114
			},
			{
				"comment_id": 17,
				"body": "Bonjour à tous,\n\nAprès une petite période d'inactivité, j'ai revu mon site pour utiliser la nouvelle gestion des \"Big Files\" native de ZeroNet. Les films sont maintenant téléchargeables en un seul morceau. Les \"Merged Sites\" ne sont plus utilisés, ils peuvent être supprimés. Merci de vos tests & retours ! Comme toujours, au début c'est lent puis ça accélère au fur et à mesure des partages (principe Bittorrent).\n\nSite hébergé sur Raspberry 24/7 via Tor.\n\nProchaine étape : Référencer les films dans une base de données.. !\n\n{Toutoune}",
				"added": 1510182374
			},
			{
				"comment_id": 18,
				"body": "Bonjour à tous,\n\nSite réparé et opérationnel ! Une centaine de films disponibles.\n\n{Toutoune}",
				"added": 1518270079
			},
			{
				"comment_id": 19,
				"body": "> [wick3d](#comment_2_1NKFpFhSm6iLsimZafr7AP2ZNirDNfPwan): J'ai un message d'erreur quand je clique sur un film : Server errorErr: UnicodeEncodeError: 'ascii' codec can't encode character u'\\xe8' in position 39: ordinal not in range(128) in UiServer.py line 95 > UiRequest.py line 130 > MutePlugin.py line 138 > UiRequest.py line 272 > UiRequestPlugin.py line 22 > TranslateSitePlugin.py line 25 > FilePackPlugin.py line 67 > UiRequest.py line 489 > BigfilePlugin.py line 689 > Site.py line 766 > BigfilePlugin.py line 526 > BigfilePlugin.py line 360 > subprocess.py line 168 > subprocess.py line 390 > subprocess.py line 640\n\nBonjour, en quelle version de Zeronet es-tu ?\n{Toutoune}",
				"added": 1519459370
			},
			{
				"comment_id": 20,
				"body": "Bonjour à tous,\n\nJ'ai ajouté quelques films, d'autres sont en préparation. J'ai également upgradé ma version de Zeronet. Le site était Offline depuis 1 semaine pour cause d'un souci technique, il est de nouveau UP. J'aimerais vos retours pour savoir si vous arrivez à downloader des fichiers car je me pose des question sur la gestion des BigFiles native de ZeroNet, mes premières expérimentations avec découpage manuel me semblaient plus performantes (mais beaucoup plus complexe à mettre en œuvre).\n\n{Toutoune}",
				"added": 1520665929
			},
			{
				"comment_id": 21,
				"body": "Star Wars 8 - Les derniers Jedi & Jumanji 2 are online !\n{Toutoune}",
				"added": 1520979203
			},
			{
				"comment_id": 22,
				"body": "Epouse-moi si tu peux & Justice League ajoutés !\n{Toutoune}",
				"added": 1521301365
			},
			{
				"comment_id": 23,
				"body": "The Circle, Wonder, Le sens de la fête ajoutés.\n{Toutoune}",
				"added": 1521313925
			},
			{
				"comment_id": 24,
				"body": "> [audrey](#comment_1_1PeJ7NbbWJSFSkAEGC1ZiPugi87CzPEefy): Salut, je viens de découvrir ton zite et j'adore !!! Tu fais un très bon travail pour la liberté sur l'Internet et pour le partage ;) Plus de défenseurs des libertés devraient faire comme toi ;)\n\nMerci !",
				"added": 1521884746
			},
			{
				"comment_id": 25,
				"body": "Ferdinand ajouté !\n{Toutoune}",
				"added": 1521909574
			},
			{
				"comment_id": 26,
				"body": "> [wick3d](#comment_5_1NKFpFhSm6iLsimZafr7AP2ZNirDNfPwan): J'ai la dernière, désolé pour le temps que j'ai pris à répondre.\n\nEt ça te le fait toujours et sur tous les liens ?",
				"added": 1522083637
			},
			{
				"comment_id": 27,
				"body": "> [badger](#comment_1_1AoccM68U6diqKKeswTHRNh2dV1jp8M9Dv): Pour un film ca me dit 15j de DL...sachant que j'éteint mon PC tous les soirs, c'est pas tout de suite que je pourrais utiliser ta page :(\n\nSalut Badger, l'utilisation de TOR diminue en effet la vitesse de téléchargement mais j'ai fait des tests depuis un autre poste, on est en moyenne à 100 Ko/s, il faut donc quelques heures mais pas plus. Essaie de laisser tourner un peu ton poste, le temps que ton relai TOR construise des connexions. De plus, le nombre de sources augmente au fur et à mesure des téléchargements. Autre possibilité : plusieurs téléchargements en simultané depuis mon serveur, ce qui divise la vitesse pour chacun.\n{Toutoune}",
				"added": 1522132637
			},
			{
				"comment_id": 28,
				"body": "Bonjour, ajout du classique Forrest Gump en 720p (comme tous le films).\n{Toutoune}",
				"added": 1522133136
			},
			{
				"comment_id": 29,
				"body": "Hello,\nSanta & Cie online ! Quelques autres également ;-)\n{Toutoune}",
				"added": 1523209371
			},
			{
				"comment_id": 30,
				"body": "Bonjour ! Pierre Lapin & Tad l'explorateur ajoutés\n{Toutoune}",
				"added": 1524258114
			},
			{
				"comment_id": 31,
				"body": "Bonjour à tous,\nJ'ai mis à jour Star Wars 8 qui était de mauvaise qualité et ajouté quelques autres films.\n{Toutoune}",
				"added": 1525445533
			},
			{
				"comment_id": 32,
				"body": "Bonjour,\nMomo ajouté.\n{Toutoune}",
				"added": 1525519087
			},
			{
				"comment_id": 33,
				"body": "Bonjour, ajout de :\n+ L'échappée belle\n+ Garde alternée\n\n{Toutoune}",
				"added": 1525713651
			},
			{
				"comment_id": 34,
				"body": "> [sickbt](#comment_1_17SkTWL47x3pVwkLLe6rrqGdEnpBvGrwSW): Je Suis D'accord Avec Sucette Et Tvax Va Y Poste Les Sur KopyKate Big Official\n\nBonjour, je viens d'aller voir le ZeroSite KopyKate. L'idée n'est pas mauvaise, mais il ya a un problème : les fichiers uploadables ont une taille maxi de 2Go, il y a un bon tiers des gros fichiers que je partage qui dépassent cette limitation.\n{Toutoune}",
				"added": 1526326748
			},
			{
				"comment_id": 35,
				"body": "Bonjour à tous, j'ajoute:\n\n- Garde alternée\n- Downsizing\n- Balck Panther\n\n{Toutoune}",
				"added": 1526326844
			},
			{
				"comment_id": 36,
				"body": "Bonjour à tous ! Pour le WE :\n- Les Tuche 3\n- Le labyrinthe 3 : le remède mortel\n- Red sparrow\n\n{Toutoune}",
				"added": 1526717984
			},
			{
				"comment_id": 37,
				"body": "Bonjour à tous, quelques nouveaux films sot disponibles :\n- La saga Twilight\n- Tomb Raider\n- La chtite famille\n- Avatar\n- Mary et la fleur de la sorcière\n- Chérie j'ai rétréci les gosses\n\n{Toutoune}",
				"added": 1530696236
			},
			{
				"comment_id": 38,
				"body": "> [fyverymuch](#comment_2_17uRwFQYo1RCDno3shrJv8mLcBKHLRrfpT): le serveur galére bien sa race je suis a 200ko permanent sinon je pense que quand t aura une bonne base d utilisateur y aura plus de probléme et sinon c pas possible d ajouter un lecteur ? théoriquement on peux regarder en streaming et en plus continuer a partager donc ca pourait etre vraiment cool\n\nSalut fyverymuch,\nEn effet, si le film n'est que sur mon serveur, on sera limité à mon débit montant et je suis en ADSL.. (et en plus il y a la couche d'anonymisation TOR qui ralentit un peu). Je vais voir pour ajouter des commandes qui permettent d'aider à partager un ou des films.\n\n{Toutoune}",
				"added": 1532553320
			},
			{
				"comment_id": 39,
				"body": "Bonjour à tous,\n\nQuelques nouveaux films en ligne :\n- Taxi 5\n- Les dents, pipi et au lit\n- Avengers infinity war\n\n{Toutoune}",
				"added": 1533931744
			},
			{
				"comment_id": 40,
				"body": "> [yennefer](#comment_1_19frnZt5L58G4GRhwRzULQD7LtD3gyhTM9): Salut, super ton site merci pour le partage !\n\nMerci ! Faut que je trouve du temps pour l'améliorer un peu maintenant..\n{Toutoune}",
				"added": 1537006845
			},
			{
				"comment_id": 41,
				"body": "Bonjour à tous !\n\nQuelques nouveaux films publiés ! Toujours sans pub et en dispo 24/7 depuis mon raspberry écolo ;-). N'oubliez pas que ZeroNet est un réseau en P2P, une fois un gros fichier téléchargé, il est important de le laisser sur votre copie du site pour accélérer les échanges entre chaque pair. Plus votre Zeronet est en ligne, plus le site se distribue rapidement !\n\n- Hotel transylvania 3\n- Les indestructibles 1\n- Solo - A Star Wars story\n- Oceans 8\n- Jurassic World 2\n- Ready Player one\n- Maze runner\n\n{Toutoune}",
				"added": 1539547682
			}
		]
	},
	"comment_vote": {
		"2_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"14_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": 1,
		"1_131ixDeDfLQaVGeEw9ssqnGLGXYKFuDsJw": 1,
		"1_18BWLbvGshgsSvgN2hR2VKpYnF6CXDAcfo": 1,
		"8_1NT39RDDBgVDrQCL6y9NodL7RLJCDbA3Us": 1,
		"3_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"30_1JGx6kKGTzjRrxDB9PPbJ4AcSPdY7UkQwb": 1
	}
}