{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Как работает ZeroID?",
			"body": "Не смог понять, как работает ZeroID. \nПравильно ли я понимаю, что потеря папки установки ведет к потере своего адреса? Можно ли вытащить после регистрации свой сертефикат или сделать вход по логину/паролю?\nМожно ли сидеть с двух компьютеров одновременно под одним логином?",
			"added": 1457355290
		},
		{
			"topic_id": 2,
			"title": "Анекдоты",
			"body": "Думаю, у каждого в копилке есть парочка действительно смешных анекдотов. Попробуем начать общение хоть с чего то не связанного с Zeronet.",
			"added": 1457365292
		},
		{
			"topic_id": 3,
			"title": "Интересные и новые сайты",
			"body": "Давайте добавлять сюда то, что вы нашли в ZeroNet. И не только русское.",
			"added": 1457368523
		},
		{
			"topic_id": 4,
			"title": "Концепт. Раздача установочных пакетов через ZeroNet.",
			"body": "Сейчас у пакетных дистрибутивов есть несколько бед с пакетами не из основного репозитория:\n1. Для Ubuntu это выключение серверов раздающих редкие штуки по PPA. (Я так при переезде на неубитую систему потерял софт для синхронизации с Windows Phone 7, искал его потом несколько дней)\n2. Для CentOS, Scientific Linux, Fedora очень часто приходится искать редкий пакет на специальных сайтах, качать и ставить руками.\n3. Необходимость вводить аж три строчки в консоль, если надо подключить PPA или что то поставить каждому новому члену команды/научной группы. И главное они выглядят абсолютно не мнемонично, надо обязательно искать название или где то его записать.\n4. Отстойнейшее описание пакетов... Серьезно. Я должен пролазить 100500 сайтов что бы найти пакет для мелкой задачи. Например, я несколько часов искал программу Disk Usage Analyzer. Просто потому что я не знал ни существования концепции, ни названия, ни как объяснить google что же я хочу делать. Это просто жесть по сравнению со Steam или другими сервисами распространяющими контента, которые сами предлагаю штуки и удобный поиск по категориям.\n\nКороче идея: сделать плагин, который выдает API для запуска .deb (и других) пакетов, прокаченых через 0net. Человек заходит на сайт, тыкает кнопку, пакет ставится. Проблема не решается в web, так как PPA сервер может прилечь навсегда, если распространитель софта на него забъет.\n\nГЛАВНЫЙ ВОПРОС: Могу ли я доверять скаченному контенту и быть уверенным что он не подменен?\n\nВот похожая штука для винды: https://ninite.com/ Бывает полезно когда тебе дают голую машину и ты не помнишь наизусть всех названий что тебе нужны.\n\nЕсли решить главный вопрос, то можно и для винды запилить. Можно сделать установщик плагинов для самого 0net или даже программы которые распространяются через 0net и позволяют что то сделать в системе, если пользователь им доверяет.",
			"added": 1457556043
		},
		{
			"topic_id": 5,
			"title": "Список OpenSource репозиториев и туториалов",
			"body": "Давайте сделаем список ссылок на демки сайтов и список туториалов.\n\n\nВот список основных, репозиториев ZeroNet: https://github.com/HelloZeroNet\nНовая версия ZeroTalk-Plus: https://github.com/GomZik/ZeroTalk-Plus\n\n\nБазовая документация: http://zeronet.readthedocs.org/en/latest/\nО ZeroFrame:\nhttp://127.0.0.1:43110/1CpGZyfbUBBV5uXUoY653wVoqZFRojbEzd/?Post:3:%D0%9F%D0%BE%D0%BD%D0%B8%D0%BC%D0%B0%D0%B5%D0%BC+ZeroFrame+API\nhttp://127.0.0.1:43110/1CpGZyfbUBBV5uXUoY653wVoqZFRojbEzd/?Post:4:%D0%9A%D0%BE%D0%BF%D0%B0%D0%B5%D0%BC+%D0%B2+%D0%B3%D0%BB%D1%83%D0%B1%D1%8C+ZeroFrame.+%D0%A7%D0%B0%D1%81%D1%82%D1%8C+1.+certSelect.",
			"added": 1457602560
		},
		{
			"topic_id": 6,
			"title": "Русскоязыкные сообщества посвященные ZeroNet в соц- и проф- сетях",
			"body": "",
			"added": 1457772968
		},
		{
			"topic_id": 7,
			"title": "Плагин EasyMetrics",
			"body": "Уже писал что начал пилить плагин, тут: https://github.com/kostaNew/zeronet-easymetrics\nПисать данные не так сложно, сложнее сделать дефолтные графики, которые бы ли бы интересны людям.\n\nПишите сюда, какая бы статистика вам была интересна.",
			"added": 1457940458
		}
	],
	"topic_vote": {
		"2_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1
	},
	"next_comment_id": 153,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Запустил первый раз, не могу понять, а почему ни на одном форуме или сайте нет нормальных разделов?",
				"added": 1457254499
			},
			{
				"comment_id": 5,
				"body": "А что с поддержкой BitMessage? На нее вроде уже как год насобирали? И вообще, есть ли список запланированного?",
				"added": 1457363935
			},
			{
				"comment_id": 7,
				"body": "> [vlad20012](#comment_64_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Вот я и делаю свой еще один zeroID. С авторизацией через соцсети. Кому не надо может не юзать\n\nА можно как-нибудь реализовать вход через соцсети к уже созданным zeroid аккаунтам? Мне было бы это интересно, так как я с самого начала сижу под неанонимным ником, совпадающим с vk.",
				"added": 1457366858
			},
			{
				"comment_id": 8,
				"body": "http://127.0.0.1:43110/zaphods.bit/RM.html - ZeroNet Roadmap. Cписок что есть и чего хочется.\nhttp://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN - shift, обрати внимание, тут в движок ZeroTalk добавили загрузку картинок (как они сами заявляют, я не тестировал).",
				"added": 1457368217
			},
			{
				"comment_id": 11,
				"body": "А я правильно понял, что сейчас сеть реально држится только на 5 пирах? Мне пишет это на всех сайтах и я нигде не видел больше... Или это стандартная процедура, писать в 5 пиров?",
				"added": 1457370025
			},
			{
				"comment_id": 17,
				"body": "https://vk.com/hellozeronet - а эта vk группа умерла или что? Кто нибудь вообще занимается комьюнити за пределами reddit?",
				"added": 1457380429
			},
			{
				"comment_id": 25,
				"body": "> [leinariys](#comment_45_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Парни загрузил самый польшой каталог рутрекера 80 мегобайт и это писац) осталось ещё 400 мегабайт загрузить , надо?Оно кому-то надо?\n\nДумаю что если ты сделаешь OpenSource скрипт, который умеет автоматом качать и выкладывать метоинформацию, при этом делая это правильно, то тебя расцелуют.",
				"added": 1457524467
			},
			{
				"comment_id": 30,
				"body": "Как в блоге сделать плашку \"Читать далее\" и есть ли вообще что-нибудь про оформление текстов?",
				"added": 1457565325
			},
			{
				"comment_id": 32,
				"body": "Сделал свой блог http://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb , узнал несколько интересных вещей:\n1. Словил баг, что у копированного по инструкции сайта почему то приписывается \"domain\" в content.json в итоге сайт в ZeroHello отображается с правильным именем, но ведет на ZeroBlog. Если про этот баг еще неизвестно, я зарепорчу в github.\n2. Раздать можно с закрытым портом из крупной локалки, из дома не заработало. Из сети универа раздать смог на 3 ноды, потом кинул в http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n и раздалось на 12. Есть подозрение что внутреннюю ноду поднял кто то из админов сети, что бы посмотреть.\n3. Русский шрифт просто вырвиглазный. Английские термины в тексте выглядят ужасно. Надо срочно что то с этим делать...",
				"added": 1457591946
			},
			{
				"comment_id": 41,
				"body": "Итак, решил 1 проблему, и еще 2 нашел.\n\n1. Мразота с разной шириной русских и английских букв решается установкой в систему шрифта. Шрифты надо ставить в систему из Google Fonts всем семейством. Для (Ru-)ZeroTalk помогла установка Roboto. (Сижу на Ubuntu)\n\nПроблемы:\n2. В блогах используется Tinos. Я его проставил, что то поменялось, но мразота осталась.\n3. Что то все равно приписывает на моей машине в мой персональный блог в файл content.json строку \"domain\": \"Blog.ZeroNetwork.bit\".\n\nВопрос, куда мне пихать проблему со шрифтами в issue ZeroNet или в issue сайтов? Проблема №3 может быть вызвана тем, что я сам дурак и неправильно сделал сайт? ( http://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb - прикладываю, чтоб кто-нибудь посмотрел локальный контент)",
				"added": 1457604350
			},
			{
				"comment_id": 44,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_15SARKNuSBuSxuKe1xqevx3H3pSEep5TgR/Optional+Files - чеж этого раньше то небыло. Два ответа на все вопросы про опциональные файлы...",
				"added": 1457613969
			},
			{
				"comment_id": 46,
				"body": "> [leinariys](#comment_48_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): А чо такое?позволяют не скачивать весь сайт сразу\n\nТипа да, стандартный пример на GIF именно так и работает, там сайт весит 230+ МБ, а скачивается совсем немного в первый раз. Проблемы была в том что возможность анонсирована, а как воспользоваться непонятно... Даже Екатерина не знала. А теперь понятно, надо реально добавить 1 строку))",
				"added": 1457630196
			},
			{
				"comment_id": 48,
				"body": "Я тут написал сайтик, он демонстрирует опциональные файлы и игру музыки через audiojs. По идее один файл должен грузиться сразу, а один при запуске плеера. Проверить не смогу еще сутки.\nЕсли кому интересно, то можете попробовать запустить сайт сами. Музыка из Public Domain. Лицензия библиотеки MIT ( http://kolber.github.io/audiojs/ ).\n\nhttps://github.com/kostaNew/zeronet-audio-demo\nАдрес сайта: 1B3MjcF3y7UiSMgevjnso5JVNFMz2ci2ME все уже подписано\n\nЕсли заработает, обещаю написать подробный туториал на русском языке, который включит основную документацию и про опциональные файлы на самом базовом уровне...",
				"added": 1457635682
			},
			{
				"comment_id": 49,
				"body": "> [shift](#comment_206_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): NO PEERS FOUND в данный момент, у тебя порт закрыт/nat чтоль?\n\nДа, я свой блог случайно опубликовал, потому что кто то поднял в сети универа ноду с портом и прошло через нее или же порт пробросился (хотя в интерфейсе он писал что закрыт)... А вот из дома я этот сайт никак не могу публикануть и придется ждать сутки, а может и больше...",
				"added": 1457637230
			},
			{
				"comment_id": 50,
				"body": "Порыл немного как публикуется контент. Этот сайт хранит картинке в базе и фигачит их как base64: http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN \nА вот 0chan делает честно, картинки кладутся в пользовательские папки и становятся опциональными.\n\nАудио+Загрузка контента+Опциональные файлы = (ну вы поняли)... Сайт с музыкой из Public Domain))",
				"added": 1457637498
			},
			{
				"comment_id": 51,
				"body": "А кто-нибудь может порекомендовать VPS где бы можно было поднять ZeroNet с открытым портом не дорого?",
				"added": 1457637703
			},
			{
				"comment_id": 53,
				"body": "Плагины тоже довольно легко писать, как оказалось. Там просто навешивание декоратора на любую функцию ядра. Думаю обвеситься на WebSocket и сделать демку с установкой контента из .deb пакетов или выплевыванием собственного лога в сайт.",
				"added": 1457643272
			},
			{
				"comment_id": 54,
				"body": "> [shift](#comment_214_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Вижу ты неплохо в архитектуре проекта разобался, может поможешь разрабу пилить ядро? можно донат организовать тут ну или другую помощь, я со своей стороны VPS дать могу.\n\nНе очень хорошо на самом деле, но разберусь. У меня, к сожалению, времени не так много. У меня есть работа, которую я очень люблю и на которой очень загружен. Пока я планирую написать 3-4 технические демки до лета, сделать по ним статьи и выложить эти статьи сначала в свой блог, а потом перенести их на хабр.",
				"added": 1457670126
			},
			{
				"comment_id": 57,
				"body": "http://127.0.0.1:43110/pedoblocker.bit/?Home - появился блоклист для говна. Надо бы пилить плагин с автозаменой файлов. Если файл в папке, перетирать его. Файл будет сломан и не будет раздаваться. Таким образом морально и юридически вы не участвуете в преступлении. Единственно что мне не нравится, это то что список не разделен. Зоофилия не наказуема в некоторых странах. Так же там нет малвари, которая тут обязательно появится скоро. Однако, такие списки палка о двух концах. Я бы просто сделал список плохих сумм по категориям.\n\nЕще, конечно, есть проблема, если файл сделан не опциональным, то блокироваться будет весь сайт. Нельзя ни в коем случае повторить ошибку веба с блокировками всего целиком.\n\nСписок юзается в этом поисковике: http://127.0.0.1:43110/163ZAwi5BcGBm6UEwdJF1pkcejDMCT1kAj",
				"added": 1457675953
			},
			{
				"comment_id": 58,
				"body": "> [wrewolf](#comment_114_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): О, вы таки пнули в сторону как сделать опциональный файлы, в лоб оно не взлетело и на подписи они все стали необходимыми.\n\nЭто мне адресовано? Плохо понял кто что пнул, но еще раз и на русском. На самом деле решение по опциональным файлам описано прямо в документации по content.js и оно простое до безобразия...\n\nНадо написать шаблон где лежат опциональные файлы, например так: \"optional\": \"audio_optional/.*\",\nПосле подписи все файлы отвечающие шаблону переедут в секцию \"files_optional\".\nМой пример: https://github.com/kostaNew/zeronet-audio-demo\n\nВопроса остается два:\n1. Как делать touch для нужных файлов заранее или как случайно не делать touch из страницы когда они не нужны. От этого например зависит как будет работать тег audio...\n2. Пользовательский контент можно класть абсолютно так же, со слов nofish, но надо сделать демку.\n\nВремени нет, а идей выше крыш.",
				"added": 1457692336
			},
			{
				"comment_id": 60,
				"body": "> [wrewolf](#comment_117_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): demo\n\nОГРОМНОЕ СПАСИБО!!!! Работает именно так как и и ожидал. Второй файл грузится только когда надо.",
				"added": 1457709000
			},
			{
				"comment_id": 61,
				"body": "> [vlad20012](#comment_131_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Rev986: Dont try to download banned user filesНу вы поняли\n\nПосмотрел, будут банненые юзеры. Это очень здорово! На самом деле получается иерархическая система прав. Думаю что можно будет даже делать модераторов сообществ с разными правами, если немного покурить...",
				"added": 1457709385
			},
			{
				"comment_id": 62,
				"body": "> [shift](#comment_224_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Модераторов? они должны каким-то образом модифицировать файл подписывать который может только овнер, или ты предлагаешь инклюдить из их личных папок?\n\n> [vlad20012](#comment_136_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Так это все и раньше было... Просто почему-то никто в интерфейсы добавлять такие функции не торопится. А так можно руками в конфиги вписывать\n\nЛадно, я еще покурю, видимо я чето не понял тогда...",
				"added": 1457709726
			},
			{
				"comment_id": 63,
				"body": "http://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q - спасибо, wrewolf! Своим VPS обзаведусь до ПН. \n\nВопрос который меня волнует. Как мне сделать логику аналогичную touch в Linux. То есть как можно потрогать опциональный контент из js, чтобы его начало качать? Это было бы полезно в дальнейшем если делать плейлисты и если делать мою идею с установкой .deb пакетов.",
				"added": 1457709912
			},
			{
				"comment_id": 67,
				"body": "> [vlad20012](#comment_143_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Хмм, походу я ошибся. Права не наследуются сами собой, и только владелец сайта может подписывать что угодно. Ну, тем не менее, если кто-то может подписать 1 нижестоящий content.json, то значит может вписать туда себя и редактировать еще на уровень ниже.\n\nЭмм... А владелец ресурса может в нижестоящий content.json вписать другого человека....",
				"added": 1457712751
			},
			{
				"comment_id": 68,
				"body": "> [vlad20012](#comment_144_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Да не только в нижестоящий, но и в этот, собственно. Можно разрешить другому человеку свой сайт подписывать\n\nТоесть модерацию по разделам на самом деле раздать то можно? Круто.",
				"added": 1457713066
			},
			{
				"comment_id": 69,
				"body": "http://127.0.0.1:43110/Stats - че это, это встроено, почему я только сейчас увидел?",
				"added": 1457713403
			},
			{
				"comment_id": 70,
				"body": "> [vlad20012](#comment_148_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Плагин. По умолчанию ставится\n\nОк, а кто может рассказать про все плагины, которые входят в стандартную поставку?",
				"added": 1457713744
			},
			{
				"comment_id": 71,
				"body": "> [shift](#comment_231_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Названия достаточно ёмкие https://github.com/HelloZeroNet/ZeroNet/tree/master/plugins\n\nAnnounceZero, disabled-Zeroname-local, disabled-DonationMessage,  disabled-Bootstrapper - для этих нет",
				"added": 1457714145
			},
			{
				"comment_id": 72,
				"body": "В папке каждого пользователя 0chan лежит файл test.txt, внутри него контент: \"fuck this\", это обязательный файл...",
				"added": 1457719781
			},
			{
				"comment_id": 73,
				"body": "У меня не работает стандартный пример из документации. Ошибка: \"Message wrapper_nonce error, please report!\", что делать? Расширения отключены.\n\nИ еще я не могу понять как его заставить автоматически компилировать coffee-script на Ubuntu?",
				"added": 1457731491
			},
			{
				"comment_id": 74,
				"body": "> [vlad20012](#comment_152_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Старый ZeroFrame.coffee взял, возможно с сайта спер какого-то. Скачай из документации актуальный\n\nВзял актуальный: 127.0.0.1:43110/Blog.ZeroNetwork.bit/data/files/ZeroFrame.coffee\nТеперь у меня ошибка с каким то extend в all.js.\n\nВот как я компилирую, ошибка и сам all.js : http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC_0",
				"added": 1457734826
			},
			{
				"comment_id": 76,
				"body": "Смотрите на ZeroNet не как на сайты, а как на приложения для Android, iOS. Тут есть прямые аналогии:\nподпись приложения и публикация в маркете -> siteSign, sitePublish; обновление приложения -> F5 на сайте; получение контента из облака -> опциональные файлы; рутованый доступ -> плагины. Теперь становится очевидно, что ZeroNet предоставляет вам возможности по обновлению приложения, доставки и распространению контента. Причем реализована наиболее сложная логика, которая знимает у разработчиков максимум времени и очень платформозависима.... Очевидным преимуществом для пользователя является БЕСПЛАТНОЕ облако.\nА теперь посмотрите для чего ZeroNet подходит идеально: музыкальный плеер, а-ля vk.com музыка; референс менеджер, типа Mendeley, Zotero; интернет бибилиотеки - типа http://booksee.org/; распространение приложений и пакетов, по аналогии с PPA и кеширующим репозиториями apt-get и yum....\nПочему же это всего этого тут нет? Вспомните как Apple платила разработчикам приложений напрямую и какие отчисления получали первые разрабы под iOS. Сразу поймете проблему - нет разработчиков! А это из-за дерьмовой документации... Стандартные примеры не работают. Я потратил 8 часов на первый пример, но он так и не поддался (хотя я никогда не писал под фронтенд). Для плагинов нет описания вообще (напишу сам, если демку сделаю). Нужно улучшать и писать документацию. Срочно, блин, и русскую и английскую...",
				"added": 1457763369
			},
			{
				"comment_id": 77,
				"body": "> [esteban](#comment_66_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi)\n> Вот есть например зеронет, где прямо сейчас это возможно, но все что тут есть, что в русскоязычном, что в англоязычном сегменте, ограничивается преимущественно разговорами про зеронет сам по себе.\n\nСообщество Linux 10 лет говорило только о себе.... Нужны приложения полезные пользователям, чтобы ситуация изменилась...",
				"added": 1457763501
			},
			{
				"comment_id": 79,
				"body": "> [eugenere](#comment_1_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): заглядывайте ко мне в блог как раз начал изучение ZeroNet API, кое-что для себя начал записывать, интересны любые новые идеи\n\nБлин, все перепроверил всеравно вываливается.\nInternal error: TypeError: 'bool' object does not support item assignment\nUiWebsocket.py line 98 > UiWebsocket.py line 178 > UiWebsocket.py line 438",
				"added": 1457770823
			},
			{
				"comment_id": 82,
				"body": "> [eugenere](#comment_1_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): заглядывайте ко мне в блог как раз начал изучение ZeroNet API, кое-что для себя начал записывать, интересны любые новые идеи\n\nОХРЕНИТЕЛЬНЫЙ, ОХРЕНИТЕЛЬНЫЙ пример. Как раз тот интерфейс, который мне нужен для тестирования плагинов. Я с фронтендом обломался, потому что не смог собрать. Как ты свой пример собираешь? Если опять не получится, возьму твой скрипт.\n\nПо поводу ошибки - эта ошибка в твоем блоге ((",
				"added": 1457771224
			},
			{
				"comment_id": 83,
				"body": "> [eugenere](#comment_2_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): попробуй мойинструкцию здесь взял?попробуй описать по шагам что ты делаешь\n\nПо шагам, я компилирую вот так: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC_0\n\nПохоже что один класс становится определен до другого, тоесть кофескрипт не умеет в зависимости? И как собирать all.js силами siteSign из кофескриптов?",
				"added": 1457771313
			},
			{
				"comment_id": 84,
				"body": "> [eugenere](#comment_5_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): The paste you queried was not found\n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC_0 - видимо это баг сайта.\n\nhttp://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/ - вот тут в самом верху, пока что еще",
				"added": 1457771526
			},
			{
				"comment_id": 85,
				"body": "@eugenere - как в js сделать загрузку файла, что бы передать его в fileWrite?\n\nhttp://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q - тут моя очевидная демка.",
				"added": 1457771691
			},
			{
				"comment_id": 86,
				"body": "@eugenere у меня 2 идеи, над которыми я сейчас работаю:\n1. Зайт на котором можно будет грузить музыку любому и слушать ее. Для первого milestone нужен плеер, опциональные файлы, загрузка контента и работа с базой (первые две части уже есть). Потом поднимаем сервак с надписью \"Это демка. Контент стирается каждые 6 часов, если хотите сохранить музыку, делайте копию сайта\", и ждем пока пользователи сами запилят плееры для своих любимых исполнителей.... \n2. Плагины для расширения функционала: мастер плагин (включение/отключение плагинов из ui), плагин для вызова некоторых команд из консоли. И главная идея, плагин который ставит пакеты превращая ZeroNet в PPA с графическим интерфейсом и распределенным кэшем.",
				"added": 1457772703
			},
			{
				"comment_id": 88,
				"body": "> [eugenere](#comment_8_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): моя попытка разобраться с тем что же происходит внутри ZeroFrame и его наследниках: zn.js с примером использования для разрешения дополнительной аутентификации чепез zeroverse.bit, а не только zeroid.bit\n\nНе понял что ты пытаешься выяснить, но смотри ядро ZeroNet/src/Ui/UiWebsocket.py функция actionCertSelect. Там идет обращение к инстансу класса: ZeroNet/src/User/User.py\n\nМогу порыться в ядре и объяснить как и что работает. А вообще аутентификацией тут занимался кто то прямо серьезно.",
				"added": 1457774236
			},
			{
				"comment_id": 89,
				"body": "> [eugenere](#comment_9_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): а зачем так глубоко копать, ~/UiWebsocket.py нормально отрабатывает на всех адресах кроме твоего, соответственно проблема не на сервере, а в javascript`e, в all.js\n> или в подписях/разрешениях\n\nЭто уже не про мои проблемы с фронтендом",
				"added": 1457774605
			},
			{
				"comment_id": 90,
				"body": "> [eugenere](#comment_10_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): есть какой-то удобный инструмент для анализа python? charm?\n> извини, не понимаю, проблема есть или нету?\n\nЯ на PyСharm работаю.\n\n> [eugenere](#comment_8_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): моя попытка разобраться с тем что же происходит внутри ZeroFrame и его наследниках: zn.js с примером использования для разрешения дополнительной аутентификации чепез zeroverse.bit, а не только zeroid.bit\n\nЯ про этот пост. Логика аутентификации полностью в ядре. Как уже писал GomZik : http://127.0.0.1:43110/blog.gomzik.bit фронтендовый ZeroFrame просто обертка через WebSocket над функциями вида \nactionXXXXXXXX в UiWebsocket.py.",
				"added": 1457774944
			},
			{
				"comment_id": 92,
				"body": "@shift как ты думаешь, есть смысл разделить флудилку на темы? Например техническое обсуждение, философия ZeroNet, прочее? Я уже замучался искать советы, которые мне дали 4 дня назад...",
				"added": 1457776003
			},
			{
				"comment_id": 94,
				"body": "Так как с серьезными вещами все идет очень медленно, а документации и примеров страшно не хватает, то я решил написать про несколько \"открытий\". Надеюсь, это поможет некоторым лучше понять ZeroNet, если они на том же этапе, что и я.\n\nВ этом посте:\n\n -  О шрифтах\n - О публикации зайта\n - Об опциональных файлах\n - Как писать плагины для ZeroNet\n\nhttp://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb/?Post:2",
				"added": 1457799858
			},
			{
				"comment_id": 95,
				"body": "> [vlad20012](#comment_156_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Эмм, а с каких пор введено понятие \"зайт\"?\n\nКогда термины не устоялись, ты можешь переводить как хочешь и смотреть реакцию;)",
				"added": 1457800566
			},
			{
				"comment_id": 96,
				"body": "> [netflow](#comment_6_1NPh8RCmZGPXpchZrLes9dhcSv5sNoPBiK): Вопрос на засыпку... Допустим я сделаю какой-то зайт, используя некий API 0NET. Где гарантия что API не измениться так что зайт перестанет работать?\n\n1. Если ты умрешь или потеряешь ключ, а сайт будет востребован, то его копируют и починят. Код то открыт.\n2. Судя по тому какое тут api оно вряд ли долго будет меняться.\n3. Разработчики не дураки и я уверен что будет обратная совместимость. В content.json есть поле `\"zeronet_version\": \"0.3.6\"`",
				"added": 1457806168
			},
			{
				"comment_id": 101,
				"body": "> [vlad20012](#comment_158_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Я уж не стал им на гитхабе прямо писать, но по-моему вместо решения фундаментальных вопросов (разделение файлов на блоки, к примеру) разработчики занимаются какой-то фигней вроде админок... Запилили бы уже давно админку для ZeroTalk отдельно, не такая уж это и сложная задача\n\nРазрабы Freenet и i2p тоже пилят фундаментальные вопросы... Уже с 2000 года пилят, запилились просто, а народу все нет и нет...",
				"added": 1457821291
			},
			{
				"comment_id": 102,
				"body": "> [shift](#comment_226_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Так ты не хочешь написать документацию? на русском/английском языке, с демками наприме, разрабу будет полезно - он лучше пусть ядро пилит ну и коммюнити тоже в плюсе.\n\nКак это начать делать я не понимаю, мне надо форкнуть документацию и править отдельно. Или предложить реквест с какой то правкой, что бы документация стала прямо там двуязычной?",
				"added": 1457821451
			},
			{
				"comment_id": 103,
				"body": "> [shift](#comment_230_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): На русском документация вполне сгодится в твоём блоге, я планирую на него ссылку в шапку запилить, пока у нас нет полноценного FAQ по разработке. А в последствии - сделать общий FAQ со ссылками на разные блоги нашего уютненького\n\nТы не понял, есть большая разница между моим блогом, где 50% отсебятины и перевода документации по API. Блог я конечно продолжу",
				"added": 1457821586
			},
			{
				"comment_id": 107,
				"body": "@shift ты что то не то сделал с топиком разработки, он растворился",
				"added": 1457822448
			},
			{
				"comment_id": 108,
				"body": "> [shift](#comment_232_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Хотел сделать из него группу - сабфорум по мануалам из тикета, но что-то пошло не так =(\n\nПросто прикрепи его на верх. уже норм будет",
				"added": 1457822520
			},
			{
				"comment_id": 113,
				"body": "> [gomzik](#comment_288_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): До этого момента не видел, может и не давно\n\nС субботы",
				"added": 1457874151
			},
			{
				"comment_id": 128,
				"body": "http://127.0.0.1:43110/1BrgXu4E6jzdtvwec9oEU5Fir7355yeJF3 - появился форум по фантастике",
				"added": 1457949404
			},
			{
				"comment_id": 129,
				"body": "http://127.0.0.1:43110/ZeroBlogs.bit - список блогов, можно связаться с автором списка и добавить свои",
				"added": 1457950416
			},
			{
				"comment_id": 137,
				"body": "http://127.0.0.1:43110/ZeroPolls.bit/?Poll:1-1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC - ну, что site или zite? Сайт или зайт?",
				"added": 1457983623
			},
			{
				"comment_id": 138,
				"body": "> [vlad20012](#comment_181_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Проголосовал за сайт, но я явно в меньшинстве)\n\nПроголосовало 12 человек из 500-600... Хз, хз.\n\nЕще не факт что норма для английского станет русской нормой. Неологизмы в английском поощряются, у нас - нет.",
				"added": 1457989084
			},
			{
				"comment_id": 142,
				"body": "http://127.0.0.1:43110/1AJB5rtjfB9imjDGVk5vtRtZp3zgYizbpG - БЛЖАД, первый сайт с рекламой....",
				"added": 1458052405
			},
			{
				"comment_id": 143,
				"body": "Порылся в starred у HelloZeroNet.\nСписок децентрализованых технологий: https://github.com/redecentralize/alternative-internet\nНовый конфиг для докера: https://github.com/jdoig/rpi_zeronet_docker",
				"added": 1458071014
			},
			{
				"comment_id": 148,
				"body": "http://127.0.0.1:43110/19WuEyeiN9tNqnDCAgNUovbBot6N3WcK2v - git tutorial in ZeroNet",
				"added": 1458206381
			},
			{
				"comment_id": 152,
				"body": "http://127.0.0.1:43110/115XiZRVhKEGFhnPa3pv1oGrK1HXsvc6UM - чето новенькое, но к сожалению, полуработающее.",
				"added": 1458385134
			}
		],
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 2,
				"body": "Нужны разделы как минимум.",
				"added": 1457258073
			},
			{
				"comment_id": 3,
				"body": "> [shift](#comment_155_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Например какие?\n\nВ зеронете функционал как у форумов 20 летней давности. Анонимности тут нету, поэтому единственное зачем мне здесь сидеть - общение. Пока что я тут вижу 100500 спамерских сообщений и утопленные темы без возможности поиска по ним. То есть общаться реально можно только про сам zeronet.\n\nЯ бы сначала сделал так:\n - ZeroNet\n - Другие распределенные технологии (Bitcoin, Ethernium, Torrent, ...)\n - Программирование\n - Новости\n - Юмор\n - Реклама (сюда спихивать весь спам)\n\nЯ уже видел тут посты про риск \"отбитых модераторов\". Но ни один сайт без них не обходится. Даже сайты с фильтрацией на основе рейтинга: reddit, pikabu, oboobs;) Нуждаются в некотором модерировании. Здесь, я полагаю, как минимум нужно отпихивание рекламы.",
				"added": 1457354414
			}
		],
		"6_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 4,
				"body": "В тексте ошибка: \"Java Scrypt\" -> \"Java Script\"",
				"added": 1457361973
			},
			{
				"comment_id": 16,
				"body": "vlad20012 хорошо расписал про zeroID тут: http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC/+ZeroID \n\nМне кажется надо обязательно добавить.",
				"added": 1457376658
			}
		],
		"2_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 6,
				"body": "Городок в западно-американской степи. Салун. За столом сидят два ковбоя, местный и приезжий, и пьют виски. Вдруг по улице кто-то проносится на огромной скорости, паля во все стороны из револьверов. В салуне никто и ухом не ведёт. Приезжий местному:\n— Билл?\n— Да, Гарри?\n— Что это было, Билл?\n— Это был Неуловимый Джо, Гарри.\n— А почему его зовут Неуловимым Джо, Билл?\n— Потому что его никто ещё не поймал, Гарри.\n— А почему его никто ещё не поймал, Билл?\n— Потому что он нафиг никому не нужен, Гарри.",
				"added": 1457365352
			}
		],
		"3_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 9,
				"body": "http://tinyurl.com/zeronetprimer - список контента о 0net, но не в 0net.\nhttp://127.0.0.1:43110/zaphods.bit/RM.html - The unofficial ZeroNet roadmap. Сайтик с интересными ссылками.\nhttp://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h - смешные gif.\nhttp://127.0.0.1:43110/1GamESVFyJfkmbxtcrLR2VX4m4VFmwyeRY - игры со старых автоматов: Space Invaders...",
				"added": 1457368739
			},
			{
				"comment_id": 10,
				"body": "http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz - аналог pastebin",
				"added": 1457369366
			},
			{
				"comment_id": 13,
				"body": "http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n - 0List - список новых сайтов\nhttp://127.0.0.1:43110/newsriver.bit - новостная лента по New York Times и BBC. Не очень интересно, но как экземпляр подойдет...",
				"added": 1457375144
			},
			{
				"comment_id": 18,
				"body": "http://127.0.0.1:43110/1LMG9b3mhvnfAiMpRccSNzvTbq6bYCQWLf - игра, которой сатана мучает людей в Аду теперь и здесь... Flappy Bird",
				"added": 1457420922
			},
			{
				"comment_id": 21,
				"body": "http://127.0.0.1:43110/1NJyPoPpL8At17T6G7A1qHVQdqZDBmXcLT - цитаты с голосовалкой",
				"added": 1457442017
			},
			{
				"comment_id": 28,
				"body": "http://127.0.0.1:43110/1BZEKfJNT6NGUnjWJ5ensJvYt11ZxtV1nE - генератор QR кодов",
				"added": 1457565222
			},
			{
				"comment_id": 29,
				"body": "http://127.0.0.1:43110/1Dt5dBDncyLL4bpi1Q6iSRX25FEF4gE4Ab - список js бибилиотек",
				"added": 1457565262
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 12,
				"body": "Уже больше года не работает bib.tiera.ru. Запускаться они похоже не собираются. Я пользуюсь альтернативой - booksee.org и другими, похожими сайтами, но в них иногда книги пропадают.\n\nБудет здорово, если кто-нибудь запилит библиотеку научно-технической литературы. Книги обычно весят от 300кб до 20мб. Размер как раз хорошо подходит для zeronet.",
				"added": 1457374107
			},
			{
				"comment_id": 14,
				"body": "Учитывая что на весь zeronet один профиль, надо пилить сайт по продаже/покупке ников. Потому что если взлетит, то будет история как с красивыми ICQ номерами...",
				"added": 1457375999
			},
			{
				"comment_id": 22,
				"body": "Можно сделать поисковик по пользователям, что и где они оставляли.\nИ еще можно сделать сайт со статистикой активности сети: на каких сайтах больше постят, как часто появляются новые сайты, итд...",
				"added": 1457464969
			},
			{
				"comment_id": 35,
				"body": "> [netchaser](#comment_5_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): Поисковик нужен по сайтам, чем наверное я скоро и займусь.\n\nУже 4 штуки:\nhttp://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba\nhttp://127.0.0.1:43110/zerosearch.bit\nhttp://127.0.0.1:43110/1f7FYxZWSZ5YG7Nd8sGsHcWEQgvdnVvQF\nhttp://127.0.0.1:43110/163ZAwi5BcGBm6UEwdJF1pkcejDMCT1kAj",
				"added": 1457593660
			},
			{
				"comment_id": 36,
				"body": "Еще идея. Аналог хабра сделать. Сейчас все блоги похожи как один и все на Markdown. Сделать штуку, которая кидает блоги в общий Newsfeed. Регистрация по приглашениям, как на хабре. Что бы не пихать все подряд, сделать поиск по тегам или ключевым словам. Если они есть в посте, то в общий нювсфид, если нет, то контент не для зерохабра.",
				"added": 1457593911
			},
			{
				"comment_id": 38,
				"body": "> [netchaser](#comment_7_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): думаю у поисковика должна быть совершенно другая архитектура, типа распределенный поисковик, то есть каждый сайт должен иметь локальный движок поиска к которому могут делать запросы другие поисковики. Получается что основной поисковик должен агрегировать результаты запросов. Децентрализации вместо распределенности тоже можно добиться перекинув алгоритм агрегирования в локальный поиск.\n\nКто уже пытался тут такое делать, я видел демку с рабочим YaCy. И еще, вот список технологий, если кому-нибудь он будет полезен https://en.wikipedia.org/wiki/Distributed_search_engine",
				"added": 1457597866
			},
			{
				"comment_id": 42,
				"body": "> [netchaser](#comment_9_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): так как скриптовый язык для поискового движка может оказаться не  подходящим по многим причинам, то возникает вопрос можно ли подгружать бинарники?\n\nА asm.js? Так же, я полагаю, что если что то очень важное неспособно работать на смартфонах или даже IoT, Embedded, то технология умрет...",
				"added": 1457612715
			},
			{
				"comment_id": 66,
				"body": "https://trello.com/b/lEdEIxxA/sneer - вот тут похожий на ZeroNet проект. Обратите внимание на App Suggestions, их там море....",
				"added": 1457712478
			},
			{
				"comment_id": 75,
				"body": "Я тут сильно завяз с web частью, но зато понял как нафигачить плагин с новыми командами, прямо на методы WebSocket. Будет еще одна маленькая демка. Предложите идеи. Какую бы информацию хотелось получать напрямую с ядра, или какие команды консоли вызвать из зайтов? Сделаю безопасно.",
				"added": 1457735235
			},
			{
				"comment_id": 141,
				"body": "https://www.hipchat.com/ - надо HipChat пилить. Популярная же тема. Создатели Mendeley похожую штуку недавно начали делать.",
				"added": 1458028678
			}
		],
		"1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 15,
				"body": "> [vlad20012](#comment_82_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Для каждого сайта у каждого юзера генерируется пара ключей, они сохраняются в data/users.json\n\nКакие файлы надо сохранять и переносить между компами, что бы не потерять свою учетку? Только data/users.json или нет? \".pem\" файлы нужны?",
				"added": 1457376556
			}
		],
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": [
			{
				"comment_id": 19,
				"body": "> [qw](#comment_4_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): У меня было такое. Вам нужно подождать синхронизации с сетью или пиров. Когда загрузите 0chan, DankNet и некоторые другие сайты, можете помочь их распространению. Для этого на сайте нужно потянуть влево за нолик справа вверху, и включить параметр «DOWNLOAD AND HELP DISTRIBUTE ALL FILES» (систему не нагружает).\n\nУ меня такой штуки нет, это потому что порт закрыт?",
				"added": 1457422058
			},
			{
				"comment_id": 20,
				"body": "> [qw](#comment_5_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): Возможно, проверьте. Но даже когда у меня был параметр TOR: ALWAYS и, из-за этого PORT: CLOSED, параметр «DOWNLOAD AND HELP DISTRIBUTE ALL FILES» был доступен. Его я встречал на немногих сайтах, как я подумал, на наиболее тяжёлых. Она есть на 0chan'е, DankNet'е, сайтах с GIF'ками.И в блоге Винни Пуха, в записи «Работает!» он писал, что у ZeroNet'а некоторые проблемы с определением открытости/закрытости порта, поэтому может неверно показывать.Ну и какая у Вас версия ZeroNet'а? У меня v0.1.1. Когда пытаюсь обновить, выскакивает ошибка и перезагружается.\n\nДа, вы правы, эта штука есть, но только на тяжелых сайтах. На GIF Time есть и вообще на сайтах где есть необязательный для загрузки контент, порт тут непричем. А 0chan и DunkNet я со своего компа удалил из-за тредов с около-ЦП. \n\nА вот версия у меня v0.3.6 (rev948) и я как то сомневаюсь что у вас может быть v0.1.1, если есть авторизация и Tor;)",
				"added": 1457441701
			},
			{
				"comment_id": 26,
				"body": "> [shift](#comment_196_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Ну почему же, тут можно собрать или желающих сделать коммит с этим изменением или же людей которые будут лобировать\n\nНаверное сначала стоит сделать сайт с демкой и сам плагин, а уже потом лоббировать...",
				"added": 1457553837
			}
		],
		"1_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq": [
			{
				"comment_id": 23,
				"body": "Я не очень представляю как сделать это сейчас здесь и как анонимные сайты сюда будут добавлены. Но как вариант можно прицепить данные к сайту как необязательные для загрузки файлы, а расшифровывать в браузере на стороне клиента в js.",
				"added": 1457524026
			},
			{
				"comment_id": 31,
				"body": "> [boboro](#comment_1_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq): Ну основной посыл такой: лежит, к примеру, тут книга, добавленная в список экстремистских материалов. Так вот она открыто будет лежать на всех компах, кто её читал. А значит любой конфискованный комп сходу подставит владельца. Какая же тут защита от цензуры. И сколько же будет пиров для неё?\n\nНикто не мешает положить ZeroBundle в криптоконтейнер. Ваш браузер тоже подставляет вас, если вы не почистили историю или небыли в приватной вкладке. Файловая система тоже подставляет вас, так как файлы хранятся в ней. Вы являетесь соучастником преступления, раздавая раздачу с пиратским контентом и сами подставляете себя...\n\nНа самом деле все хитрее. Каждое государство по разному регулирует сферу торрентов. Torrent популярен для распространения нелегального контента вовсе не потому что был распределенным, а потому что сложно вести делопроизводство против того кто нелегальный контент выложил или кто держит трекер. Здесь тоже самое, при этом, если есть хотя бы одна нода на острове в тихом океане, то контент будет доступен...\n\nЕсть конечно угроза атаки на абузоустойчивость нод, про которую все говорят на 2ch.hk. Это когда, например, кто то выложит ЦП на популярный сайт и это ЦП разойдется по всем. Для того что бы вас осудить, нужно доказать ваш умысел. А его нет в преступлении, потому что если вы изначально не качали сайт  на которым большими буквами написано ЦП в заголовке или если вы такой сайт сразу же удалили, то умысла у вас нет. Сравните с почтой. Если кто то пошлет наркотики по почте, а почта этого не заметит, то она тоже будет \"хранить с целью распространения\", но она невиновна, потому что у нее нет умысла.\n\nКстати, если у кого то есть знакомые юристы, специализирующиеся на киберперступлениях, спросите у них и выложите ответ, пожалуйста. А вообще, надо подождать первого юридического случая. В США, Европе и у нас. Везде будет по разному. У нас ОЧЕНЬ либеральное законодательство в плане торрентов по сравнению с США, Англией и Германией. Государство в большинстве случаев на стороне пользователя и реально пока наказывает только распространителей.\n\nЯ пока убрал из списка раздач все сайты с картинками на всякий случай. Но не из-за правовых соображений, а из моральных. Когда увижу работающую систему модерации, тогда загружу.",
				"added": 1457589517
			}
		],
		"2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 24,
				"body": "Тут пока нет, а вообще наверное можно сделать. Например, переподписывать какую-нибудь метку через 5 минут. Написать сообщения тоже не сложно, чаты уже есть...",
				"added": 1457524258
			},
			{
				"comment_id": 139,
				"body": "> [zoar](#comment_6_1MxTzBwz6piYDJHHG2TkUZTGqiy2ZUrwNo): Без DHT, кстати, грустно. Я вот пытался на зайт, созданный на одном компе, зайти с другого, стоящего в метре от. Не судьба.\n\nЕсли сайт был не опубликован, то это просто невозможно. Если проброс работает, то трекер должен вас теоретически связать...",
				"added": 1458022844
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 37,
				"body": "used: 28.3k/30k - НУ, ПОЖАЛУЙСТА!",
				"added": 1457593955
			}
		],
		"4_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 34,
				"body": "> [zalex](#comment_17_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): А что, для Fedora и т.д. нет чего-то вроде software.opensuse.org? А благодаря Yast всё вообще в пару кликов ставится.\n\nДля Scientific Linux нет как минимум, в CentOS тоже все плохо, если пытаться на ней работать как пользователь, а не как админ.",
				"added": 1457592263
			}
		],
		"3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 39,
				"body": "Я пока не видел, мне кажется что нет. \n\nУ меня сложилось впечатление что у всех проблемы с пониманием как сделать сайт с необязательным для загрузки контентом. Если поймешь как, то можно навернуть вообще много чего.",
				"added": 1457601371
			},
			{
				"comment_id": 40,
				"body": "> [dude](#comment_14_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): optional files же есть\n\nТолько на практике  сайтов с ними сейчас около 1-3. А полностью загружаемых 40-50... Документации нет.",
				"added": 1457603640
			},
			{
				"comment_id": 43,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_15SARKNuSBuSxuKe1xqevx3H3pSEep5TgR/Optional+Files - оу, только не говорите мне что это есть в документации, а то я чуствую себя идиотом....\n\nХотя мне все еще непонятно, можно ли сделать выгружаемый контент необязательным для скачивания.",
				"added": 1457613291
			},
			{
				"comment_id": 47,
				"body": "У меня получилось на audio.js сделать прослушивание без загрузки. Но я не могу из дома опубликоваться:((\nПопробую поиграться с optional в ближайшие дни. Может быть даже загрузка пользователем получится...",
				"added": 1457632754
			},
			{
				"comment_id": 56,
				"body": "> [boboro](#comment_2_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq): VLC думаю будет по урлу крутить\n\nА что для этого надо в vlc сделать? Может ли он по очереди запускать файлы как то?",
				"added": 1457675096
			},
			{
				"comment_id": 59,
				"body": "> [shift](#comment_216_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): По очереди - плейлист - m3u\n\nА плейлист можно динамически обновлять, как то? Я просто, серьезно, никогда не задавался этим вопросом.",
				"added": 1457692447
			},
			{
				"comment_id": 65,
				"body": "> [jkepeer](#comment_4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs): я хочу залить музыку, а потом скачивать или слушать\n\nhttp://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q - я начал делать постепенно. \nКод тут: https://github.com/kostaNew/zeronet-audio-demo\n\nЕсли хочешь помочь, попробуй вытащить загрузку пользовательских файлов из 0chan и объяснить текстом как работает, или можешь помочь интерфейсом, я объясню что нужно сделать. Лучше интерфейсом, я вообще ноль во фронтенде.",
				"added": 1457710336
			},
			{
				"comment_id": 112,
				"body": "> [adminbrutal](#comment_1_1NUhYYjx4VNjDwV6UWj218tA9v7RCKjonr): Народ, закончились деньги на инете, из сайтов доступные только в сети зеронет.  и то нормально работают только те, где пиров полно. есть ли способ открывать обычные сайты из -под маски зеронета? чтоб провайдер не видел? тор даже не запустился\n\nПрикольно, у меня провайдер тоже не закрывает торренты за неуплату, видимо нет технической возможности.\n\nadminbrutal - первый заложник зеронета.\n\nА возможности нет. Технически это очень сложно сделать. Реализаций я не видел",
				"added": 1457874023
			}
		],
		"1_1Kn7vDfQWK1M5Amu5sFK2EHEBr69Vvm1Ai": [
			{
				"comment_id": 45,
				"body": "Если прямо совсем список, то вот: http://127.0.0.1:43110/zaphods.bit/RM.html",
				"added": 1457627644
			}
		],
		"5_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 52,
				"body": "https://github.com/Nullchan/nullchan - репозиторий nullchan",
				"added": 1457639471
			},
			{
				"comment_id": 80,
				"body": "http://127.0.0.1:43110/1F6u3BdECcupyy7mraLGsko56XUCS38DBr - пример с нотификацией, чтением/записью файлов и работа с базой.\n\nhttp://127.0.0.1:43110/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw - блог этого разработчика.",
				"added": 1457770878
			},
			{
				"comment_id": 81,
				"body": "http://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q - пример с проигрыванием музыки с опциональным и обязательным файлом.\n\nhttp://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb - блог автора. В блоге есть про опциональные файлы и плагины.",
				"added": 1457770910
			}
		],
		"1_1AhmLuxijDXzgywnHv2W3u8T251msd8G3n": [
			{
				"comment_id": 55,
				"body": "> [boboro](#comment_3_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq): не пашет под firefox\n\nУ меня все работает.",
				"added": 1457670162
			}
		],
		"4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 64,
				"body": "> [jkepeer](#comment_3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs): есть такая идея, сделать микро клиент к android,iOS который будет подгружать(прокси) контент с компа на котором установлен зеронет, есть смысл заворачиваться или уже есть?\n\nЕсли можешь, надо однозначно делать. Разрабы как бы намекают на мобильный клиент масштабируемым интерфейсом, но я не видел нигде таких планов",
				"added": 1457709994
			},
			{
				"comment_id": 93,
				"body": "http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:31:A+post+from+the+phone - первая ласточка. musickiller обещал написать гайд на английском в течении некоторого времени.\n\nДелается через вот это: https://play.google.com/store/apps/details?id=com.gnuroot.debian&hl=ru",
				"added": 1457791646
			},
			{
				"comment_id": 115,
				"body": "> [musickiller](#comment_18_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): а это безопасно? оставлять на прокси свой личный ключ....... наверняка в незашифрованном виде...\n\nСовсем не безопасно. Если прокси хакнут, будут пароли прямо из памяти python лить. А учитывая что владельцы прокси даже не озаботились отключением плагинов, они вообще не понимают как ZeroNet работает, неговоря уже о безопасности.\n\nЛучше иметь два аккаунта.",
				"added": 1457885740
			},
			{
				"comment_id": 116,
				"body": "> [shift](#comment_238_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Насколько я помню ключ хранится в localstorage и не покидает клиента\n\nКлюч вводится в окошечке справа, вверху. Этот интерфейс вам возвращает сервер, который может быть заражен. Если зараженный интерфейс не сможет лить пароли через ajax, то он сможет лить их в скомпрометированный код сервера (я это имел ввиду, когда писал ниже). На стороне клиента вы не можете проверить подписи пришедших вам файлов. По сути, вы полностью доверяете прокси. \n\nТакая же щекотливая ситуация сложится, если из-за бага в браузере, js сможет вылезти за фрейм. Все ваши приватные ключи будут течь.\n\nЯ вроде, где то видел код ZeroProxy, но не могу вспомнить где. Если вы кините, то будет здорово. Почему то меня не покидает ощущение, что этот код не в основном репозитории.",
				"added": 1457889468
			}
		],
		"6_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 87,
				"body": "https://vk.com/hellozeronet - это кажется мертво. Будем переделывать?",
				"added": 1457772995
			},
			{
				"comment_id": 91,
				"body": "> [eugenere](#comment_11_1NUPS87CLEtEmee1AGvmY7iSbvpC9JWHxy): может, лучше, сюда его переделать?\n\nА как людей привлекать?\n\n@shift, что ты думаешь?",
				"added": 1457775065
			}
		],
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": [
			{
				"comment_id": 97,
				"body": "> [musickiller](#comment_10_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): мне кажется, что zeroID - норм идея. централизация для идентификации - идея адекватная. если хочешь безопасности и анонимности - не идентифицируйся. или заведи свой собственный клон zeroID, как пример.\n\nПоследнее не поможет, так как в апи зашит вызов, который говорит какие домены сайт принимает для аутентификации.",
				"added": 1457814228
			},
			{
				"comment_id": 99,
				"body": "> [musickiller](#comment_13_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): в любом случае делать очередную битоцепь - нафиг. в зеронете это будет совсем не к месту. я очень рад был когда увидел сколько места он занимает и сколько трафика он ест. А блокоцепь - это гигабайты места и гигабайты трафика. нафиг)))\n> В крайнем случае, всегда есть битмесседж и им подобные с реальной анонимностью)\n\nНа битмессайдж есть таск и сбор денег на него, типа на подключение Bitmessage по XMLRPC в интерфейс ZeroNet. Деньги уже собрали, ждут разработчика;)",
				"added": 1457815128
			},
			{
				"comment_id": 121,
				"body": "> [esteban](#comment_70_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Не, у меня есть мысли про распределенный блокчейн, но это что-то да уровне интуиции. Я сейчас даже не возьмусь даже сформулировать такое. Но можно будет уже на рабочем мессенджере поменять основы.\n\nА может все таки BitMessage в интерфейс впилить? Проще, же.",
				"added": 1457933456
			},
			{
				"comment_id": 127,
				"body": "> [nippletwister](#comment_297_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А ethereum не хотите попробовать? Вроде он сейчас в моде.Был там у них вопрос и по поводу ZeroNet, правда никто пока не ответил: http://ethereum.stackexchange.com/questions/1076/is-it-possible-to-make-zeronet-p2p-websites-as-client-of-ethereum-dapps\n\nА никто и не ответит, потому что нет специалиста, обладающего знанием обеих технологий))",
				"added": 1457943692
			},
			{
				"comment_id": 133,
				"body": "> [esteban](#comment_72_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Но сходу бросилась там ассемблерная вставка в реализации bigint.\n\nПокажи какая вставка, большинство таких вставок стандартизованы, я могу найти под другие штуки тоже.",
				"added": 1457966963
			}
		],
		"1_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz": [
			{
				"comment_id": 98,
				"body": "http://127.0.0.1:43110/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw/?Post:19 - более полный и, наверное, обовляемый список.",
				"added": 1457814308
			},
			{
				"comment_id": 140,
				"body": "Отвалился bit.no.com:43110, все остальные прокси тоже сдохли... \nВарианта 3: кто то напинал, что то упало, кому то надоело раздовать.",
				"added": 1458023045
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 100,
				"body": "Список уже готов темой ниже, если что. http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:5_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC/+OpenSource",
				"added": 1457821069
			},
			{
				"comment_id": 104,
				"body": "> [vlad20012](#comment_163_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Для меня, например, куда важнее вот этот коммитhttps://github.com/HelloZeroNet/ZeroNet/commit/4d7ce1dc1671256c9700029c83485dfab99a9574  который частично фиксит этот issue (только для Chrome) https://github.com/HelloZeroNet/ZeroNet/issues/352\n> А то я, блин, ссылки не могу в новом окне открывать, что за дела\n\nА оно не утечет за пределы фрейма? За пределами фрейма шняги с правами админа, через них можно хорошо потроллить пользователя.",
				"added": 1457822008
			},
			{
				"comment_id": 105,
				"body": "> [gomzik](#comment_283_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А  крутые штуки, это что за штуки? :)\n\n\n1. Зайт на котором можно будет грузить музыку любому и слушать ее. Для первого milestone нужен плеер, опциональные файлы, загрузка контента и работа с базой (первые две части уже есть). Потом поднимаем сервак с надписью \"Это демка. Контент стирается каждые 6 часов, если хотите сохранить музыку, делайте копию сайта\", и ждем пока пользователи сами запилят плееры для своих любимых исполнителей....\n2. Плагины для расширения функционала. Сейчас уже начал пилить запись статистики по времени, от всех остальных идей отказался. Это может строить красивые графики, следить за популярностью сети, проводить эффективные компании по превлечению людей, дать инструмент который причвлечет в сеть исследователей BigData и социологов. И главное что это реально, потому что есть http://127.0.0.1:43110/Stats\n3. Буду все что делаю описывать в бложике.",
				"added": 1457822278
			},
			{
				"comment_id": 109,
				"body": "> [gomzik](#comment_286_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Это ты как делать собрался? :)\n\nТак же как рекомендует New 0List. Башевский скрипт в cron) Он будет переподписывать сайт на пустой.\n\nНо, думаю что я сначала плагин сделаю, это более рилейтед скиллам полученным на моей основной работе.",
				"added": 1457822578
			},
			{
				"comment_id": 110,
				"body": "> [gomzik](#comment_287_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Почему именно башевский то? :) но в целом понятно, да, извне\n\nПотому что все команды есть в стандартном вызове zeronet ))",
				"added": 1457822680
			},
			{
				"comment_id": 111,
				"body": "http://127.0.0.1:43110/blog.musickiller.bit/?Post:40 - @musickiller запилил пост со скринами бенчмарка с Android... Ну что сказать, 90 секунд это просто ужасые показатели. Сумма на машинах с i7 около 5 секунд, на моем ноуте 5 летней давности 12 секунд.\n\nСамое фиговое что ядро ZeroNet написано на гринлетах и как я понял использует только 1 ядро процессора.",
				"added": 1457873892
			},
			{
				"comment_id": 114,
				"body": "http://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb/?Post:3 - мой новый пост о Benchmark, Stats, GcCollect и уязвимости всех прокси в сети к (D)DOS атакам, потому что их владельцы не понимают что плагин Stats надо вырубать.\n\n@vlad20012, спасибо, за замечание. Остальное вроде правильно.",
				"added": 1457884510
			},
			{
				"comment_id": 117,
				"body": "https://github.com/kostaNew/zeronet-easymetrics - уже точно определился, чем я буду заниматься в ближайшее время в рамках ZeroNet. Это плагин, который пишет статистику по ноде каждую минуту. В общем, Stats с логированием. Он может быть полезен для оценки популярности сообществ и оценки суточных колебаний посещаемости. Пока что пишет только количество пиров по сайтам. Нарисую какой-нибудь график уже завтра утром;) Думаю попозже добавлю все остальное. \n\nЖду ваших предложений, какая бы информация была вам интересна в первую очередь? Если не знаете что можно получить, посмотрите http://127.0.0.1:43110/Stats .\n\nЕсли кто то заинтересован в аудиодемке, возмитесь за нее, потому что я к ней вернусь не раньше чем через месяц-другой.",
				"added": 1457898168
			},
			{
				"comment_id": 118,
				"body": "> [shift](#comment_239_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Неплохая идея, данные в БД держать будешь? вижу это как аналог гугл аналитики\n\nДа, типа Google Analytics. В течении 1-3 недель я переведу это на pandas. pandas умеет писать DataFrame куда угодно, хоть в базу хоть в файлы, хоть в html. К сожалению, разработка будет идти очень медленно.",
				"added": 1457900246
			},
			{
				"comment_id": 119,
				"body": "Кстати, забавная магия. У меня есть импорт внутри цикла записи: `from Site import SiteManager`\nЕсли попытаться записать этот импорт в начало файла, то отпадывает логика плагина Zeroname. При этом никаких ошибок не выдает даже в лог))",
				"added": 1457901112
			},
			{
				"comment_id": 120,
				"body": "Нашел вот это issue: https://github.com/HelloZeroNet/ZeroNet/issues/356\n\nЕсли кто хочет, могу рассказать как сделать это в виде плагина и даже с API. Примерно 3-10 часов займет в простейшем варианте, с новым бэкапом каждый раз.",
				"added": 1457903483
			},
			{
				"comment_id": 123,
				"body": "> [shift](#comment_240_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А смысл бэкапа если вдруг обладатель потеряет код сайта его можно же с пиров стянуть\n\nВерсионность.",
				"added": 1457940733
			},
			{
				"comment_id": 134,
				"body": "Взял сервер на DigitalOcean, как вы мне и рекомендовали. Я правильно понял что платить в конце месяца?",
				"added": 1457967047
			},
			{
				"comment_id": 144,
				"body": "Никто так и не ответил по поводу уязвимости проксей к DoS. Просто ппц.",
				"added": 1458072972
			},
			{
				"comment_id": 145,
				"body": "> [vlad20012](#comment_186_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Уверен? https://github.com/HelloZeroNet/ZeroNet/commit/fbfa0f37175b15fac40af5952ac175a58bf44bc9\n\nМне на почту сегодня ответили из bit.no.com, закрыли.",
				"added": 1458124195
			},
			{
				"comment_id": 146,
				"body": "> [cypher](#comment_17_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): А почему не сказали? Может копирасты наехали?\n\nДыру закрыли. Прокси сам работает.\n\nА вот почему остальные прокси лежат, непонятно...",
				"added": 1458158929
			},
			{
				"comment_id": 149,
				"body": "http://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb/?Post:4\nПредставляю вам первую версию плагина для сбора и обработки статистики.",
				"added": 1458221248
			}
		],
		"7_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 122,
				"body": "Вот, первые данные которые я смог получить: https://ipfs.pics/QmVgc83N1w4Pi8ewzYDDxBEMDakRh81MUFh4GBsAMpqZiL\n\nЭто количество пиров у ZeroTalk и его трех национальных клонов.\nНа графике видны обрывы количества пиров. Писалось раз в минуту. Почему такое может быть? Или это стандартный результат для torrent?",
				"added": 1457940611
			},
			{
				"comment_id": 124,
				"body": "> [shift](#comment_242_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А какое тут время анонса на трекер? похоже что по таймауту отваливаются пиры иногда\n\nЭто данные /Stats. Общее количество пиров по сайту, записанное через 1 минуту этой ночью.\n\nПо X время в минутах. ",
				"added": 1457940827
			},
			{
				"comment_id": 125,
				"body": "https://ipfs.pics/QmQpr2NWRzWomc1dnBTDPugD9kCiUbkxhehcT7EMjFWEyG - политика ядра в отношении пиров.",
				"added": 1457941122
			},
			{
				"comment_id": 126,
				"body": "> [shift](#comment_242_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А какое тут время анонса на трекер? похоже что по таймауту отваливаются пиры иногда\n\nПеречитал вопрос, действительно интересно стало...",
				"added": 1457941434
			},
			{
				"comment_id": 130,
				"body": "Переписал запись Stats->Sites на DataFrame, пока что пишу в csv. 5МБ в сутки должно получаться.\n\nНе могу понять что лучше считать ключем в Connections: id, ip:port или peerid. Есть у кого идеи?",
				"added": 1457961719
			},
			{
				"comment_id": 131,
				"body": "> [shift](#comment_247_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): может стоит сразу агрегированные данные писать?\n\nНет, нужно писать сырые всегда. Обработка это отдельный этап. \nПока для \"домохозяйки\" все равно будет слишком сложно. Для тех кто будет пользоваться, я дам скрипты, выдающую основную статистику по скормленной папке.",
				"added": 1457961950
			},
			{
				"comment_id": 132,
				"body": "То что есть на /Stats уже агрегировано. То что лежит в сайтах я пока не хочу по времени писать, очень много будет.\n\nСвязи между данными буду искать на этапе обработки.",
				"added": 1457964904
			},
			{
				"comment_id": 135,
				"body": "> [shift](#comment_255_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Так я и думал что ты хочешь /Stats сохранять и рисовать красивые highcharts графики + данные о переходах и страницах\n\n\nВидимо мы в понимании терминов расходимся... Я поставил запись на VPS. Либо она отвалится, либо у нас через неделю будет недельная статистика",
				"added": 1457967793
			},
			{
				"comment_id": 150,
				"body": "http://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb/?Post:4 - Русское описание первой версии плагина.",
				"added": 1458221285
			},
			{
				"comment_id": 151,
				"body": "А кто-нибудь попробовал поставить и протестировать?",
				"added": 1458236516
			}
		],
		"3_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 147,
				"body": "Про зеркала это нормально, и так было понятно что введут, в США так же. Главное чтоб не как в Германии, наказывать конечного потребителя контента.\n\nПро запрет пропаганды это немного плохо. 100500 видеоуроков по ИБ попадает под это, так же как и профессиональные конференции. Однако, обнадеживает что эта инфа опровергнута Роскомнадзором.",
				"added": 1458159419
			}
		]
	},
	"comment_vote": {
		"12_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"1_1GZZ3VLPQgTXkyud3aoBzXbpcSnpnLGnZT": 1,
		"3_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh": 1,
		"5_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"1_1MxTzBwz6piYDJHHG2TkUZTGqiy2ZUrwNo": 1,
		"3_1FfJqTpKxtW6jzKnHLpUswhWHwwtYTz5YK": 1,
		"8_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"82_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"168_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"56_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"133_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"84_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"81_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"80_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"86_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"253_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"279_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"53_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF": 1,
		"34_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"4_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": 1,
		"61_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"38_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"109_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"1_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1": 1,
		"4_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1": 1,
		"5_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1": 1,
		"262_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"44_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"63_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"289_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"293_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"199_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"276_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"15_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"48_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1,
		"128_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"127_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"5_1NPh8RCmZGPXpchZrLes9dhcSv5sNoPBiK": 1,
		"4_1NPh8RCmZGPXpchZrLes9dhcSv5sNoPBiK": 1,
		"1_13fAhYYNySY6a1P9Dp8KMdP7ANSNfitwMu": 1,
		"138_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"139_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"140_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"141_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"151_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"65_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"66_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"4_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"9_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"157_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"159_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"161_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"285_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"241_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"242_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1L6t5QZahvCGf2DaYQC4R2zk76GgSAFha2": 1,
		"298_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"304_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"308_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1
	}
}