{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 8,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Gravitação quântica\n- https://web.archive.org/web/20180624191512/https://arxiv.org/pdf/hep-th/0310077.pdf\n- https://web.archive.org/web/20180624191454/https://arxiv.org/pdf/gr-qc/0410054.pdf",
				"added": 1529867763
			},
			{
				"comment_id": 2,
				"body": "#Einstein e a Gravitação Quântica. \n- https://web.archive.org/web/20180624180918/http://www.seara.ufc.br/folclore/folclore394.htm",
				"added": 1529867790
			},
			{
				"comment_id": 4,
				"body": "#Conteúdo do Universo\n- https://web.archive.org/web/20180624191944/http://www.ruckert.pro.br/blog/?p=4284",
				"added": 1529868057
			},
			{
				"comment_id": 5,
				"body": "#Matéria e energia\n\n\nUma confusão conceitual que muitas vezes se tem é a de que “energia” seria um constituinte do Universo, inclusive o constituinte básico, do qual a matéria e a radiação, os outros constituintes, seriam feitos. Tal entidade, em verdade, é o que se chama de “campo”. Campo é algo que preenche o espaço, ou melhor, que dá azo ao surgimento de um espaço como aquilo que o contém, com a propriedade caracterizante de possibilitar interações entre suas próprias condensações, que são as partículas formadoras da matéria e da radiação. A curvatura do espaço gerado pelo campo vem a ser a gravitação. Energia é, apenas, um atributo do campo ou de suas condensações (matéria e radiação), da mesma forma que os momentos linear (quantidade de movimento) e angular (spin), a carga elétrica, a paridade, a estranheza, o isospin, o número bariônico, o leptônico, a cor (no sentido da teoria dos quarks) e outros atributos que, inclusive, possuem grandezas definidas para quantificá-los. Não existe “energia”, como algo em si, mas apenas como uma propriedade de alguma coisa. A equação de Einstein, E=mc^2, não correlaciona matéria com energia, mas “massa” com energia. O que ela diz é que a propriedade dos sistemas denominada massa, que mede tanto o seu conteúdo de inércia quanto sua capacidade gravitante, nada mais é do que uma forma da energia possuída pelo campo concentrado que vem a ser aquele sistema. Ao se quantizar o campo pode o fazer em forma de férmions, que são os quarks e léptons, constituintes da matéria, ou em bósons, que são as partículas de radiação, mensageiras das interações, das quais a principal é o fóton, cuja quantidade é um bilhão de vezes mais abundante do que a de partículas de matéria do Universo. Isto significa que a matéria hoje existente é apenas um bilionésimo do total de matéria e antimatéria primordialmente existente.\n\n- Ernesto von Rückert",
				"added": 1529868368
			},
			{
				"comment_id": 6,
				"body": "#Buraco Negro\n\n\nA característica essencial de um buraco negro (para que possa ser chamado de buraco e de negro) é a existência de um “horizonte de eventos” e não de uma singularidade. Haja ou não a singularidade, se um conteúdo de massa e energia estiver condensado em uma região menor do que o “raio de Schwarzschild” (no caso de não haver carga elétrica e nem rotação), então essa coisa será um “buraco negro”, pois não emitirá luz e será um sorvedouro de tudo que se aventurar a cruzar esta barreira (contudo é preciso considerar a “radiaçao de Hawking”, emitida na borda do horizonte de eventos). A própria mecânica Newtoniana prevê a existência de tal tipo de coisa, inclusive fornecendo o valor correto do raio de Schwarzschild. As soluções das equações de Einstein da Relatividade Geral que conduzem ao buraco negro (Schwarzschild, Kerr e Reisner-Nordstron) é que prevêm a existência de uma singularidade. Todavia essas equações não prevalecem nas situações em que a densidade seja muito grande, pois isto derruba os seus pressupostos de continuidade.\n\n- Ernesto von Rückert",
				"added": 1529868548
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 3,
				"body": "#A Geometria de Lobatchevski\n- https://web.archive.org/web/20160629083348/http://www.ruckert.pro.br/texts/lobatchevski.pdf",
				"added": 1529867957
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 7,
				"body": "#Porque vós, irmãos, fostes chamados à liberdade. Não useis então da liberdade para dar ocasião à carne, mas servi-vos uns aos outros pelo amor. \n\n- Gálatas 5:13",
				"added": 1529869034
			}
		]
	},
	"comment_vote": {
		"4_1BDwN3AumvLyb8vBLZuF4HrXyWpwSsJLD4": 1,
		"7_1BDwN3AumvLyb8vBLZuF4HrXyWpwSsJLD4": 1
	}
}