{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1584164125,
			"title": "ZeroID username expiration?",
			"body": "Hey there. Having a little problem - I had to reinstall ZeroNet on my system, had to wipe its data directory, and completely forgot about users.json file.\n\nI wanted to take the same username I had before, but it says it's already taken. There is no point in asking admins (besides, I'm not certain if there are any) to reset it, I think, so I want to know if my previous username will expire over some time?",
			"added": 1584164124
		},
		{
			"topic_id": 1584186519,
			"title": "Multi-user ZeroNet web UI?",
			"body": "Is there any guide on how to set up multi-user 'hello zeronet' web page? I didn't find anything related on Google, is ZeroNet supposed to be running on single-user machines only?",
			"added": 1584186517
		},
		{
			"topic_id": 1584337202,
			"title": "Portable ZeroNet daemon?",
			"body": "Hey there. I'm pretty concerned about other users on my machine able to use ZeroNet web UI and see sites I've been on and sites I'm seeding. \n\nMy machine is running Arch linux, and ZeroNet seems to have its content (sites and so on) at /var/lib/zeronet.\n\nIs it possible to somehow run ZeroNet on another port and make it host sites from my home directory instead? (I want to start it manually when I log into my user account)\n\nP.S. Multi-user plugin doesn't really help.",
			"added": 1584337199
		},
		{
			"topic_id": 1584462344,
			"title": "Little help with creating zite.",
			"body": "Hey there. I followed the guide on zeronet docs site to set a fancy address for my zite, but I'm not sure if I got it right. Can someone give me a proper guide? I just don't get what files do I have to put into <data_folder>/1MyFancyAddress.",
			"added": 1584462340
		},
		{
			"topic_id": 1585985133,
			"title": "Sites failing to update?",
			"body": "Heya. Using ZN for a while, noticed that most of my recently downloaded zites are failing to update (says '1 left' before actually failing).\n\nWhat is the cause?",
			"added": 1585985128
		}
	],
	"topic_vote": {
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1584164125_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 1,
				"body": "> [geekless](#comment_118_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): If you created any sites by cloning existing ones via the ZeroHello UI, you've probably lost  the admin access to them as well. The private keys for those sites are derived from your master seed, in the same way as for your user id.\n\nI haven't created any, but it really does suck to lost my username :/",
				"added": 1584168465
			},
			{
				"comment_id": 2,
				"body": "> [blurhy](#comment_351_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Try hacking zeronet.io (or zeroid.whatever).\n\nIt's not centralized anyway",
				"added": 1584168485
			},
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_120_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): It is.\n\nThen I'd have to get admin's private key. Would be even easier to hack mine then.",
				"added": 1584169754
			},
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_1266_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Let this be a lesson I guess\n\nYeah...",
				"added": 1584186235
			}
		],
		"1584186519_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 5,
				"body": "> [filips](#comment_433_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You need to enable Multiuser plugin.\n\nLast time I did so I got locked out and couldn't disable or enable other plugins.",
				"added": 1584190727
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 6,
				"body": "Sure will.",
				"added": 1584285430
			}
		],
		"1584337202_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 7,
				"body": "> [geekless](#comment_154_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Sure it is, in many different ways. Mine is: [...]\n\nI'm not a really advanced docker user, how do I run this one?",
				"added": 1584338748
			},
			{
				"comment_id": 10,
				"body": "> [geekless](#comment_156_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Well, first you should install docker, add yourself to the docker group and enable&start the docker service in systemd.And second, just run my script with the appropriate port, data directory path and UID specified, as described here: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:16\n\nWhen I run this script with -i option I get \"zeronet.sh: line 1: python: not found\"",
				"added": 1584339944
			},
			{
				"comment_id": 11,
				"body": "> [geekless](#comment_157_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): My bad. Looks like I forgot to commit and push a fix a few months ago. o_O Not fixed.\n\nWhat should I do then?",
				"added": 1584344301
			},
			{
				"comment_id": 12,
				"body": "Thanks.",
				"added": 1584347959
			},
			{
				"comment_id": 13,
				"body": "> [geekless](#comment_158_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Fuck! \"Not fixed\" => \"Now fixed\". I'm typing too fast lol [...]\n\nI'm periodically receiving error messages like 'Your Web UI is open to the whole Internet, check configuration'. Any way to fix that?",
				"added": 1584358495
			},
			{
				"comment_id": 14,
				"body": "> [geekless](#comment_161_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): It's okay. In that case, Docker is your firewall actually. ZeroNet just doesn't know that it works in docker and its ports are unavailable from outside. I don't know how to force ZeroNet not to display that message.\n\nAlright, thanks a lot.",
				"added": 1584376523
			},
			{
				"comment_id": 15,
				"body": "> [xcape2net](#comment_697_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Have you thought about installing ZeroNet on a bootable USB stick?  That way, you can take it with you wherever you go or lock it up somewhere.  You should also be able to run ZeroNet from an encrypted file on your hard drive or USB stick.\n\nYeah that's why I asked for that. @geekless guy has already helped me out.",
				"added": 1584423787
			},
			{
				"comment_id": 17,
				"body": "> [lonelyreader](#comment_44_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs): I'm not sure why is your zeronet client using /var/lib/zeronet. [...]\n\nI'm using package from AUR, that's why.",
				"added": 1585819389
			}
		],
		"1584462344_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_1935_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Make sure you have the following already and don't overwrite content.json with another version if unsure: [...]\n\nI just don't know what to put into content.json",
				"added": 1584465007
			}
		],
		"1585985133_1KeJfumP5mjv7jrFKnFaWLt5uQa1vLe62J": [
			{
				"comment_id": 18,
				"body": "> [sdfsdgasdew](#comment_47_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du): maybe the last 1 left is bad or fake content in the content.json from other bad guy.\n\nSo, I can just ignore those?",
				"added": 1585985833
			}
		],
		"1586788363_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 19,
				"body": "Nope. Trackers point at the other peers in network so you can always maintain connection with them and receive site updates.\n\nIn short - trackers are required for ZeroNet to function, and you need to constantly stay connected with those.",
				"added": 1586789106
			},
			{
				"comment_id": 21,
				"body": "> [1bfqutudhtexlka](#comment_170_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): why it just tell my peers to give me their peer list and vice versa ?(sorry not tech savvy)\n\nYep, that's how BitTorrent (and basically all the other P2P networks) network works.",
				"added": 1586793951
			},
			{
				"comment_id": 22,
				"body": "> [elinor2](#comment_14_14TR5Msgnb1MBKGayKiDB7j3aFdGrFUqdf): if someone ddos or otherwise shut down the trackers, so goes zeronet.\n\nZeroNet is up as long as there is at least one peer to seed content.\n\nThere is still a way to connect to that single peer, even if trackers are down.",
				"added": 1587193383
			}
		],
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": [
			{
				"comment_id": 20,
				"body": "Decentralized because you can always use another tracker.\nIt's not guaranteed to be anonymous like Tor or I2P, get real.",
				"added": 1586789277
			}
		],
		"1535287918_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 23,
				"body": "I've used some from Syncronite: http://127.0.0.1:43110/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o\n\nThis list might also come in handy: https://github.com/ngosang/trackerslist",
				"added": 1594543362
			}
		]
	},
	"comment_vote": {
		"89_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"466_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"467_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}