{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1599951078,
			"title": "Mask and fines: \"Putting others in danger in the name of the convictions of a few\".",
			"body": "Faschist of the wearing of the mask in public by the Prime Minister. Pneumonia with the same number of deaths as in other years. It is the same",
			"added": 1599951077
		},
		{
			"topic_id": 1600026715,
			"title": "Medical assistance in dying - Canada",
			"body": "https://ici.radio-canada.ca/nouvelle/1731538/aide-medicale-mourir-femme-mari\nfree will win\ndeterminism win\nChoice win\nChurch bells ringing in our home",
			"added": 1600026713
		}
	],
	"topic_vote": {},
	"next_comment_id": 31,
	"comment": {
		"1599173288_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "Il n'y a que les vieux barbus qui savent la \"truth\" or [\"Liberty = 0\" / \"Security = 1\"]\nOn n'appelle pas système d' \"exploitation\" pour rien.\nOn n'appelle pas \"racine - /../../\" pour rien\nOn n'appelle pas \"datacenter\" pour rien\nL'Amérique va protéger ses fesses avant les fesses des autres mais ils doit protéger les petites fesses de jeunes femmes nues également(sans discrimner les hommes nues non plus). C'est son business! Contrairement à la chine (⺟)\nMoi je vois la vie d'une façon claire, la vie virtuelle est séquentielle et voici mon exemple pas très inspirant. Si un site un peu barbare sur sa façon de promotioner la porn ajoutait des vidéos de personnes de 10 ans à 30 secondes. Advenant que nous sommes au Japon, la loi dit: je m'en fous puisque tu es un pogo de plus qui devient un touriste qui s'envoit en l'air devant la fenêtre. \n\nSauf que si vous êtes dans le paysage américain, vous obtenez devant la fenêtre 2 ans ferme avec un vidéo qui n'est pas de vous. C'est le syndrome d'internet. TRUE or FALSE dans une séquence vidéo. Et vu que les moniteur sont juste des fréquences(Spectre+ filtre+ lumière). Ça donne un constat que tout se joue derrière les lois du garagiste de l'état où vous vous trouvez à moins que votre navigateur vous mente, votre fournisseur n'est pas away from the keyboard. \n\nC'est le chat et la souris. Je sais très bien qu'un pays pourrait très bien demander à tous les sites pornos d'imposer qu'il envoie\"adresse IP, pays, date d'inscription, email du téléverseur de contenus au moment que le site fait connecté quelqu'un\", c'est un prérequis pour autoriser l'échange de porn sur le droit de télééchanger avec ses visiteur(touristes), mais encore là, les gens vont se tourner sur des site comme Zerobin et à moins que les pays comme les Australiens ou les anglais d'angleterre fasse une loi touchant github qui interdise totalement d'héberger des logiciels p2p décentralisé ou distribué. Ça fait tout tomber. Pouff, plus de porno à jamais. \n\nMerde, on s'amusait bien avec les nanas dans le pays où Alice rencontre les bizounours de France, de la russie, de l'allemagne, des pays-bas, du canada et des états-unis. Il reste encore Tor, la magie du couteau suisse, tu utilise ce truc pour te couper parce que c'est le réseau le plus surveillé à l'heure actuelle(30% de noeud de sortie piraté). Je ne parle même pas des VPN menteurs(je nommerai pas tout ça ici. Donald va se choquer, j'attend encore que mon gouvernement se botte le cul pour que j'décalisse pour de bon de ce cirque de maso-psycho-sociopathe-sadique-protolariat...",
				"added": 1599278928
			},
			{
				"comment_id": 2,
				"body": "Un resolveur transparent qui publie chaque relais ip du système distribué et/ou décentralisé avec chaque domaine hébergé par chaque relais avec cette adresse ferait tomber tout les vidanges d'un coup. Pareil pour i2p, freenet, ipfs et les autres. C'est connu que les moteurs de recherches cherchent toujours à se cacher se qu'il ne veulent, peuvent et doivent pas montrer, dire et dévoiler du net(corrompu).",
				"added": 1599938430
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 3,
				"body": "Google(EVERYWHERE) is a cartel of mass surveillance, Microsoft too(90% desktop), Facebook too(Partners), Amazon \"yes\" with his cameras. Its the silicon watch valley. Google,Facebook,Microsoft kill the competitions. Turn off Facebook, the life will be best. Sorry for my English 2nd grade. Facebook, 1000 billions for cat photos,memes,life's video. Shit, that a mega shit life in society. Super trader! No food for everyone, Photo and video for sharing, Super relation with the windows screen. The apology of windows squatting for society of revenge.\nThe Google Recaptcha is a big shit. Tor is a famous scam shit(List of 250 nodes with the email and name host all onion website with all ip with all datacenter). Who is Charlie(Linux daemon and authorities, that's it!)?\nin a nutshell: resolver\nfor the truth: a app like tor can reveil all onion site can exist with point wath ip adress. Same for zero... It's a fucking bullshit for ever\nBy 1984",
				"added": 1599947181
			},
			{
				"comment_id": 4,
				"body": "Amplify trace log, checkmate. All apps on the net is centralized. For a real decentralized web, router mesh or nothing, its centralized for ever. Google is a spy with OK,GOOGLE you are ON anytime fuck you Google you are a threat. Facebook too Insta... too, all partners too... You control the data, you control a society for the destruction. Make each person, a slave.",
				"added": 1599948333
			}
		],
		"1599951078_1An8FiAnbsUrwMrfo33rsHAzk9xiH8BR8w": [
			{
				"comment_id": 5,
				"body": "https://ici.radio-canada.ca/nouvelle/1733371/amendes-port-masque-droits-protection-specialistes",
				"added": 1599951106
			},
			{
				"comment_id": 6,
				"body": "https://ibb.co/vh9Gqrb\nhttps://ibb.co/cDsxSPy\n2016 ou 2017 is worst in Death. 8000 death of pneumonia in 2017. Hello the mask faschists! The mask in real life is discriminatory. Some people don't have cash for pay a mask. Some people wear a mask some places ou somes days. It's a microbacterian risk for humans.  Mask on internet is a necessity(12-13+)(LOL). Hello guys! Where are the special anti-faschist governement geeks?",
				"added": 1600024919
			}
		],
		"1596775198_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 7,
				"body": "count death only and fuckyou doctor,microbiologist,pharmacist who closed all for your own business. Its the same number everywhere that all fucking years tabarnak\nYou are with the media or social media, you suck.",
				"added": 1600025271
			}
		],
		"1598537511_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": [
			{
				"comment_id": 8,
				"body": "Belle Delphine, vous êtes jolie",
				"added": 1600025513
			}
		],
		"1598711364_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 9,
				"body": "virus is the government takedown media\nTest a person positive who work in health each day, it's a scrap graph of covid positiv number. Count only pneumonia number each years... shut off fuck off!",
				"added": 1600025817
			}
		],
		"1600026715_1An8FiAnbsUrwMrfo33rsHAzk9xiH8BR8w": [
			{
				"comment_id": 10,
				"body": "Medical services are required and mandatory in Canada. To counter the medical faschism and anti-medical exhaustion, the choice of medical assistance in dying will be available to all.\n\nMe and my wife take $750 worth of medication every month. It's shameful medicine. It's hard work. I would offer my place to anyone who would like care since we don't want any more. \n\nThere are three end-of-life choices. Continuation of examinations and surgeries. Comfort care. Medical assistance to die. All different. 1-Persistence and combat 2-Total Assistance 3-Deliberation in the comfort",
				"added": 1600027249
			},
			{
				"comment_id": 11,
				"body": "swiss or netherland",
				"added": 1600030087
			},
			{
				"comment_id": 12,
				"body": "It doesn't matter the weapons, it's the arguments that carry more weight.",
				"added": 1600030149
			},
			{
				"comment_id": 13,
				"body": "Giving medical assistance to dying is not a suicide, it's a negociation againt the care.",
				"added": 1600030282
			},
			{
				"comment_id": 14,
				"body": "That makes 4 requests, all of them refused because of the government delaying its lifting of the pencil with the clerk or the conservative government.",
				"added": 1600030414
			},
			{
				"comment_id": 15,
				"body": "It is to punish the suffering people to fight their lives against their will. It is forcing people to break their rules.",
				"added": 1600030497
			},
			{
				"comment_id": 16,
				"body": "For socialism, an alternative is welcome. The unconditional, individual, universal, non-taxable and non-refundable basic income of up to $50,000 through taxes.",
				"added": 1600031249
			},
			{
				"comment_id": 17,
				"body": "I remember a religious mention of the name Zaché when I was a little boy around 7-8 years old. Government officials for service(BS) to the poor are in fact tax collectors of the poor.",
				"added": 1600031350
			},
			{
				"comment_id": 18,
				"body": "J'aime bien la méditation Bouddhiste, la pensée catholique pour défendre autrui et demander un certain pardon. Désolé, je ne suis pas religieux, je suis agnostique, je défend la croyance universel d'un tout(Je ne spécifie pas tout-puissant).",
				"added": 1600031555
			},
			{
				"comment_id": 19,
				"body": "J'aime le courant \"lachez prise\"\nhttps://www.youtube.com/watch?v=7xxuLd_OutE&list=PLohYzz4btpaQHWR_H_K-COAaU7sLZX_EY",
				"added": 1600031890
			},
			{
				"comment_id": 20,
				"body": "Chaque personne doit travestir sa personne pour se soustraire d'elle-même en un autre lieu(Commerce, médecin). Nous sommes acteurs à 2 niveaux. C'est une cinétique différente à chaque lieu donc tous est menteurs ou acteurs(Il joue un protocole, une ensemble de règles(informations). Quand quelqu'un retourne de son lieu de travail. Il enlève son masque pour revenir à son lieu social-familial. Parfois une personne ne va pas se doubler dans la vie puisqu'elle ne fait partie d'une double-vie mensongière(Ex.: Médecin, Juges, Politiciens, Policiers, Armé).",
				"added": 1600032243
			},
			{
				"comment_id": 21,
				"body": "Let us understand, the Income Security Act is a set of instructions, regulations, anti-entrepreneurship, anti-wedding, anti-raising children, anti-cooperation rules. \nBreaking up couples, isolating them to pay back how they earn, condemning them to live alone or under a bridge.",
				"added": 1600032556
			},
			{
				"comment_id": 22,
				"body": "wedding not religious, just 2 persons together",
				"added": 1600032599
			},
			{
				"comment_id": 23,
				"body": "Income of existence, it's a charm",
				"added": 1600032642
			},
			{
				"comment_id": 24,
				"body": "Une perte d'emploi, un formulaire 8 pages, vous avez un butin d'argent de placer à la banque, vous n'avez pas droit même si vous avez un cancer. Si vous avez un petit amis et que vous n'avez pas de buttin et que votre petit-ami gagne 35000$, vous n'avez pas droit à votre aide de l'état\nA job loss, an 8 page form, you have a loot of money to put in the bank, you are not entitled even if you have cancer. If you have a boyfriend and you have no loot and your boyfriend earns $35,000, you are not entitled to your government assistance.",
				"added": 1600032763
			},
			{
				"comment_id": 25,
				"body": "The form is a cancer, a perceptive tax for poor is a cancer.",
				"added": 1600032792
			},
			{
				"comment_id": 26,
				"body": "désolé pour l'anglais traduis avec deepl. Je ne suis pas pure bilingual. i'm not a pure bilingual(English-French). I have nothing scolarity.",
				"added": 1600032899
			},
			{
				"comment_id": 27,
				"body": "But i read a book of 1800 pages this month.",
				"added": 1600032941
			},
			{
				"comment_id": 28,
				"body": "L'Encyclopédie Médicale - Le Manuel Merck :)--~ haha",
				"added": 1600033008
			},
			{
				"comment_id": 29,
				"body": "jeff, my website http://127.0.0.1:43110/12kgfmKDrBe55HBupm38JMuu78TCyuDcnv/index-image-fr.html Click on the box!",
				"added": 1600033099
			}
		],
		"1600032770_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 30,
				"body": "Windows modify the bandwith, it's confirmed by me.",
				"added": 1600033270
			}
		]
	},
	"comment_vote": {}
}