{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "O problema do mal",
			"body": "O problema do mal é a questão de como reconciliar a existência do mal com um Deus onipotente, onibenevolente e onisciente Um argumento do mal afirma que, porque o mal existe, ou Deus não existe ou não possui todas essas três propriedades. Tentativas de mostrar o contrário têm sido tradicionalmente discutidas sob o título de teodicéia. Além da filosofia da religião, o problema do mal também é importante para o campo da teologia e da ética.\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fevil%2F\n- https://web.archive.org/web/20171218012743/https://criticanarede.com/fil_mal.html\n- https://web.archive.org/web/20171204054531/https://criticanarede.com/fil_quintas.html\n- https://web.archive.org/web/20171109013715/https://criticanarede.com/fil_2sobremal.html\n- https://web.archive.org/web/20161204032212/http://monergismo.com/textos/problema_do_mal/problema_mal_bahnsen.pdf",
			"added": 1552440062
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_15ugkXYAt4RKhwHV85jTK6FcpVS6nqScCV": 1,
		"1_1NwNEQ5bQSQdBRPbYJ9bi9Cryy1Jb9Pg5a": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1
	},
	"next_comment_id": 10,
	"comment": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 1,
				"body": "#Hikaru No Go\nShindou Hikaru, aluno da sexta série, acha um jogo antigo no sótão da casa de seu avô. Vendo manchas de sangue no tabuleiro ele tenta limpá-lo, mas nesse momento um espírito sai de dentro do tabuleiro e une- se a consciência de Hikaru, mas sem subjugá-lo. Fujiwara no Sai, o espírito que vivia no goban (tabuleiro de Go), é o espírito de um excelente jogador de Go que viveu durante a era Heian. Ensinava o imperador na arte do Go, juntamente com um segundo tutor. No entanto, o segundo professor, disse não ser necessário dois mestres para ensinar e então um jogo entre os dois professores foi arranjado, de modo que o perdedor deveria deixar o império. Durante o jogo Sai percebe que seu adversário tentava trapacear, mas este menti dizendo que é Sai quem tenta roubar. Abalado pela trapaça Sai acaba perdendo o jogo e não agüentando a humilhação de ter seu nome manchado ele se suicida, no entanto seu espírito queria continuar jogando Go e acaba possuindo um tabuleiro. Junto com Hikaru, Fujiwara no Sai tenta alcançar o “Kami no itte” (mão de Deus), enquanto ensina Shindou Hikaru a arte do Go\n\n\n- https://www.superanimes.site/anime/hikaru-no-go",
				"added": 1552435347
			},
			{
				"comment_id": 2,
				"body": "#Nanatsu No Taizai\nOs “Sete Pecados Capitais”, um grupo maligno de cavaleiros que conspiraram para derrubar o reino de Britânia, supostamente foram erradicados pelos Cavaleiros Divinos, embora ainda existam rumores de que eles estão vivos. Dez anos depois, os Cavaleiros Divinos realizaram um golpe de estado e assassinaram o rei, se tornando os novos e tiranos governantes do reino. Elizabeth, a única filha do rei, sai em uma jornada para encontrar os “Sete Pecados Capitais”, e recrutá-los para que possam ajudar a tomar o reino de volta.\n\n\n- https://www.superanimes.site/anime/nanatsu-no-taizai",
				"added": 1552435377
			},
			{
				"comment_id": 6,
				"body": "#Nanatsu No Taizai: Imashime No Fukkatsu\nSegunda temporada de Nanatsu no Taizai.\n\n- https://www.superanimes.site/anime/nanatsu-no-taizai-imashime-no-fukkatsu",
				"added": 1552437028
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 3,
				"body": "#O problema das doze pérolas - solução\nHá doze pérolas idênticas em tudo menos no peso. Onze têm o mesmo peso, mas a última, falsa, tem um peso diferente, sendo mais leve ou mais pesada do que as demais. Como identificar a pérola falsa podendo usar apenas três vezes uma balança com dois pratos?\n\n#Solução\n\nColoque quatro pérolas em cada prato. \n\nCaso 1. Suponha que o peso seja o mesmo. Portanto, as oito pérolas medidas\nsão autênticas e a falsa é uma das quatro que não foram pesadas.\n\n1A. Coloque três [das quatro] pérolas que não foram pesadas em um\nprato da balança e três verdadeiras no outro. Se o peso for o mesmo, a\nfalsa é a que não foi pesada nenhuma vez.\n\n1B. Se o peso for diferente, vamos supor que as autênticas sejam mais\npesadas. O mesmo raciocínio pode ser feito se elas forem mais leves.\nSendo as autênticas mais pesadas, a falsa é mais leve e é uma das três\nque foram pesadas.\n\nEscolha duas das três mais leves, deixando uma de fora. Coloque cada\numa em um prato. Se der igual, a falsa é aquela que ficou de fora. Se\nder diferente, a falsa é a mais leve.\n\nCaso 2. Suponha, agora, que na primeira medida os pesos tenham dado\ndiferente. Logo, as quatro pérolas que não foram pesadas são\nautênticas. Vamos pintar de vermelho as quatro pérolas mais pesadas e\nde preto as quatro mais leves. Uma dessas oito pérolas é falsa.\n\n2A. Coloque em um prato da balança três pérolas vermelhas e uma\npreta. No outro prato coloque três pérolas autênticas e a quarta\nvermelha.  Se der igual, a falsa é uma das três pretas restantes. Isso\nsignifica também que a pérola falsa é mais leve.\n\nColoque em cada prato uma das pérolas pretas que não foram pesadas na\nsegunda vez e deixe uma de fora. Se der igual, a pérola falsa é preta\nque ficou de fora. Se der diferente, a pérola falsa é a mais leve.\n\n2B. Vamos supor que na segunda pesagem, as três pérolas vermelhas e a\npreta sejam mais pesadas do que as outras. Logo, a pérola falsa é uma\ndas três vermelhas que foram pesadas juntas e a pérola falsa é mais\npesada do que as autênticas. \n\nColoque em cada prato uma das pérolas vermelhas que foram pesadas\njuntas na segunda vez e deixe uma de fora. Se der igual, a pérola\nfalsa é vermelha que ficou de fora. Se der diferente, a pérola falsa é\na mais pesada.\n\n2C. Vamos supor que na segunda pesagem, as três pérolas vermelhas e a\npreta sejam mais leves do que as outras. Logo a pérola falsa ou é a\nvermelha colocada junto com as autênticas ou a preta misturada às\nvermelhas.  \n\nPese a vermelha com uma autêntica. Se der igual, a falsa é a preta. Se\nder diferente, a falsa é a vermelha.",
				"added": 1552435592
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 4,
				"body": "Jesus sentou-se em frente do lugar onde eram colocadas as contribuições, e observava a multidão colocando o dinheiro nas caixas de ofertas. Muitos ricos lançavam ali grandes quantias.\nEntão, uma viúva pobre chegou-se e colocou duas pequeninas moedas de cobre, de muito pouco valor.\nChamando a si os seus discípulos, Jesus declarou: \"Afirmo-lhes que esta viúva pobre colocou na caixa de ofertas mais do que todos os outros.\n#Todos deram do que lhes sobrava; mas ela, da sua pobreza, deu tudo o que possuía para viver\".\n\n- Marcos 12:41-44",
				"added": 1552435766
			},
			{
				"comment_id": 5,
				"body": "Um dos mestres da lei aproximou-se e os ouviu discutindo. Notando que Jesus lhes dera uma boa resposta, perguntou-lhe: \"De todos os mandamentos, qual é o mais importante? \"\nRespondeu Jesus: \"O mais importante é este: ‘Ouve, ó Israel, o Senhor, o nosso Deus, o Senhor é o único Senhor.\nAme o Senhor, o seu Deus de todo o seu coração, de toda a sua alma, de todo o seu entendimento e de todas as suas forças’.\nO segundo é este: ‘Ame o seu próximo como a si mesmo’. Não existe mandamento maior do que estes\".\n\"Muito bem, mestre\", disse o homem. \"Estás certo ao dizeres que Deus é único e que não existe outro além dele.\nAmá-lo de todo o coração, de todo o entendimento e de todas as forças, e amar ao próximo como a si mesmo é mais importante do que todos os sacrifícios e ofertas\".\nVendo que ele tinha respondido sabiamente, Jesus lhe disse: \"Você não está longe do Reino de Deus\". Daí por diante ninguém mais ousava lhe fazer perguntas.\nEnsinando no templo, Jesus perguntou: \"Como os mestres da lei dizem que o Cristo é filho de Davi?\nO próprio Davi, falando pelo Espírito Santo, disse: ‘O Senhor disse ao meu Senhor: Senta-te à minha direita até que eu ponha os teus inimigos debaixo de teus pés’.\nO próprio Davi o chama ‘Senhor’. Como pode, então, ser ele seu filho? \" E a grande multidão o ouvia com prazer.\nAo ensinar, Jesus dizia: \"Cuidado com os mestres da lei. Eles fazem questão de andar com roupas especiais, de receber saudações nas praças\ne de ocupar os lugares mais importantes nas sinagogas e os lugares de honra nos banquetes.\nEles devoram as casas das viúvas, e, para disfarçar, fazem longas orações. Esses receberão condenação mais severa! \"\n\n- Marcos 12:28-40",
				"added": 1552436445
			},
			{
				"comment_id": 7,
				"body": "Jesus saiu do templo e, enquanto caminhava, seus discípulos aproximaram-se dele para lhe mostrar as construções do templo.\n\"Vocês estão vendo tudo isto? \", perguntou ele. \"Eu lhes garanto que não ficará aqui pedra sobre pedra; serão todas derrubadas\".\nTendo Jesus se assentado no monte das Oliveiras, os discípulos dirigiram-se a ele em particular e disseram: \"Dize-nos, quando acontecerão essas coisas? E qual será o sinal da tua vinda e do fim dos tempos? \"\nJesus respondeu: \"Cuidado, que ninguém os engane.\nPois muitos virão em meu nome, dizendo: ‘Eu sou o Cristo! ’ e enganarão a muitos.\nVocês ouvirão falar de guerras e rumores de guerras, mas não tenham medo. É necessário que tais coisas aconteçam, mas ainda não é o fim.\nNação se levantará contra nação, e reino contra reino. Haverá fomes e terremotos em vários lugares.\nTudo isso será o início das dores.\n\"Então eles os entregarão para serem perseguidos e condenados à morte, e vocês serão odiados por todas as nações por minha causa.\nNaquele tempo muitos ficarão escandalizados, trairão e odiarão uns aos outros,\ne numerosos falsos profetas surgirão e enganarão a muitos.\nDevido ao aumento da maldade, o amor de muitos esfriará,\nmas aquele que perseverar até o fim será salvo.\nE este evangelho do Reino será pregado em todo o mundo como testemunho a todas as nações, e então virá o fim.\n\"Assim, quando vocês virem ‘o sacrilégio terrível’, do qual falou o profeta Daniel, no lugar santo — quem lê, entenda —\nentão, os que estiverem na Judéia fujam para os montes.\nQuem estiver no telhado de sua casa não desça para tirar dela coisa alguma.\nQuem estiver no campo não volte para pegar seu manto.\nComo serão terríveis aqueles dias para as grávidas e para as que estiverem amamentando!\nOrem para que a fuga de vocês não aconteça no inverno nem no sábado.\nPorque haverá então grande tribulação, como nunca houve desde o princípio do mundo até agora, nem jamais haverá.\nSe aqueles dias não fossem abreviados, ninguém sobreviveria; mas, por causa dos eleitos, aqueles dias serão abreviados.\nSe, então, alguém lhes disser: ‘Vejam, aqui está o Cristo! ’ ou: ‘Ali está ele! ’, não acreditem.\nPois aparecerão falsos cristos e falsos profetas que realizarão grandes sinais e maravilhas para, se possível, enganar até os eleitos.\nVejam que eu os avisei antecipadamente.\n\"Assim, se alguém lhes disser: ‘Ele está lá, no deserto! ’, não saiam; ou: ‘Ali está ele, dentro da casa! ’, não acreditem.\nPorque assim como o relâmpago sai do Oriente e se mostra no Ocidente, assim será a vinda do Filho do homem.\nOnde houver um cadáver, aí se ajuntarão os abutres.\n\"Imediatamente após a tribulação daqueles dias ‘o sol escurecerá, e a lua não dará a sua luz; as estrelas cairão do céu, e os poderes celestes serão abalados’.\n\"Então aparecerá no céu o sinal do Filho do homem, e todas as nações da terra se lamentarão e verão o Filho do homem vindo nas nuvens do céu com poder e grande glória.\nE ele enviará os seus anjos com grande som de trombeta, e estes reunirão os seus eleitos dos quatro ventos, de uma a outra extremidade dos céus.\n\"Aprendam a lição da figueira: quando seus ramos se renovam e suas folhas começam a brotar, vocês sabem que o verão está próximo.\nAssim também, quando virem todas estas coisas, saibam que ele está próximo, às portas.\nEu lhes asseguro que não passará esta geração até que todas essas coisas aconteçam.\nO céu e a terra passarão, mas as minhas palavras jamais passarão\".\n\"Quanto ao dia e à hora ninguém sabe, nem os anjos dos céus, nem o Filho, senão somente o Pai.\nComo foi nos dias de Noé, assim também será na vinda do Filho do homem.\nPois nos dias anteriores ao dilúvio, o povo vivia comendo e bebendo, casando-se e dando-se em casamento, até o dia em que Noé entrou na arca;\ne eles nada perceberam, até que veio o dilúvio e os levou a todos. Assim acontecerá na vinda do Filho do homem.\nDois homens estarão no campo: um será levado e o outro deixado.\nDuas mulheres estarão trabalhando num moinho: uma será levada e a outra deixada.\n\"Portanto, vigiem, porque vocês não sabem em que dia virá o seu Senhor.\nMas entendam isto: se o dono da casa soubesse a que hora da noite o ladrão viria, ele ficaria de guarda e não deixaria que a sua casa fosse arrombada.\nAssim, também vocês precisam estar preparados, porque o Filho do homem virá numa hora em que vocês menos esperam.\n\"Quem é, pois, o servo fiel e sensato, a quem seu senhor encarrega dos de sua casa para lhes dar alimento no tempo devido?\nFeliz o servo a quem seu senhor encontrar fazendo assim quando voltar.\nGaranto-lhes que ele o encarregará de todos os seus bens.\nMas suponham que esse servo seja mau e diga a si mesmo: ‘Meu senhor se demora’,\ne então comece a bater em seus conservos e a comer e a beber com os beberrões.\nO senhor daquele servo virá num dia em que ele não o espera e numa hora que não sabe.\nEle o punirá severamente e lhe dará lugar com os hipócritas, onde haverá choro e ranger de dentes\".\n\n- Mateus 24:1-51\n\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n\"O Reino dos céus, pois, será semelhante a dez virgens que pegaram suas candeias e saíram para encontrar-se com o noivo.\nCinco delas eram insensatas, e cinco eram prudentes.\nAs insensatas pegaram suas candeias, mas não levaram óleo consigo.\nAs prudentes, porém, levaram óleo em vasilhas juntamente com suas candeias.\nO noivo demorou a chegar, e todas ficaram com sono e adormeceram.\n\"À meia-noite, ouviu-se um grito: ‘O noivo se aproxima! Saiam para encontrá-lo! ’\n\"Então todas as virgens acordaram e prepararam suas candeias.\nAs insensatas disseram às prudentes: ‘Dêem-nos um pouco do seu óleo, pois as nossas candeias estão se apagando’.\n\"Elas responderam: ‘Não, pois pode ser que não haja o suficiente para nós e para vocês. Vão comprar óleo para vocês’.\n\"E saindo elas para comprar o óleo, chegou o noivo. As virgens que estavam preparadas entraram com ele para o banquete nupcial. E a porta foi fechada.\n\"Mais tarde vieram também as outras e disseram: ‘Senhor! Senhor! Abra a porta para nós! ’\n\"Mas ele respondeu: ‘A verdade é que não as conheço! ’\n\"Portanto, vigiem, porque vocês não sabem o dia nem a hora! \"\n\"E também será como um homem que, ao sair de viagem, chamou seus servos e confiou-lhes os seus bens.\nA um deu cinco talentos, a outro dois, e a outro um; a cada um de acordo com a sua capacidade. Em seguida partiu de viagem.\nO que havia recebido cinco talentos saiu imediatamente, aplicou-os, e ganhou mais cinco.\nTambém o que tinha dois talentos ganhou mais dois.\nMas o que tinha recebido um talento saiu, cavou um buraco no chão e escondeu o dinheiro do seu senhor.\n\"Depois de muito tempo o senhor daqueles servos voltou e acertou contas com eles.\nO que tinha recebido cinco talentos trouxe os outros cinco e disse: ‘O senhor me confiou cinco talentos; veja, eu ganhei mais cinco’.\n\"O senhor respondeu: ‘Muito bem, servo bom e fiel! Você foi fiel no pouco; eu o porei sobre o muito. Venha e participe da alegria do seu senhor! ’\n\"Veio também o que tinha recebido dois talentos e disse: ‘O senhor me confiou dois talentos; veja, eu ganhei mais dois’.\n\"O senhor respondeu: ‘Muito bem, servo bom e fiel! Você foi fiel no pouco; eu o porei sobre o muito. Venha e participe da alegria do seu senhor! ’\n\"Por fim veio o que tinha recebido um talento e disse: ‘Eu sabia que o senhor é um homem severo, que colhe onde não plantou e junta onde não semeou.\nPor isso, tive medo, saí e escondi o seu talento no chão. Veja, aqui está o que lhe pertence’.\n\"O senhor respondeu: ‘Servo mau e negligente! Você sabia que eu colho onde não plantei e junto onde não semeei?\nEntão você devia ter confiado o meu dinheiro aos banqueiros, para que, quando eu voltasse, o recebesse de volta com juros.\n\" ‘Tirem o talento dele e entreguem-no ao que tem dez.\nPois a quem tem, mais será dado, e terá em grande quantidade. Mas a quem não tem, até o que tem lhe será tirado.\nE lancem fora o servo inútil, nas trevas, onde haverá choro e ranger de dentes’ \".\n\"Quando o Filho do homem vier em sua glória, com todos os anjos, assentar-se-á em seu trono na glória celestial.\nTodas as nações serão reunidas diante dele, e ele separará umas das outras como o pastor separa as ovelhas dos bodes.\nE colocará as ovelhas à sua direita e os bodes à sua esquerda.\n\"Então o Rei dirá aos que estiverem à sua direita: ‘Venham, benditos de meu Pai! Recebam como herança o Reino que lhes foi preparado desde a criação do mundo.\nPois eu tive fome, e vocês me deram de comer; tive sede, e vocês me deram de beber; fui estrangeiro, e vocês me acolheram;\nnecessitei de roupas, e vocês me vestiram; estive enfermo, e vocês cuidaram de mim; estive preso, e vocês me visitaram’.\n\"Então os justos lhe responderão: ‘Senhor, quando te vimos com fome e te demos de comer, ou com sede e te demos de beber?\nQuando te vimos como estrangeiro e te acolhemos, ou necessitado de roupas e te vestimos?\nQuando te vimos enfermo ou preso e fomos te visitar? ’\n\"O Rei responderá: ‘Digo-lhes a verdade: o que vocês fizeram a algum dos meus menores irmãos, a mim o fizeram’.\n\"Então ele dirá aos que estiverem à sua esquerda: ‘Malditos, apartem-se de mim para o fogo eterno, preparado para o diabo e os seus anjos.\nPois eu tive fome, e vocês não me deram de comer; tive sede, e nada me deram para beber;\nfui estrangeiro, e vocês não me acolheram; necessitei de roupas, e vocês não me vestiram; estive enfermo e preso, e vocês não me visitaram’.\n\"Eles também responderão: ‘Senhor, quando te vimos com fome ou com sede ou estrangeiro ou necessitado de roupas ou enfermo ou preso, e não te ajudamos? ’\n\"Ele responderá: ‘Digo-lhes a verdade: o que vocês deixaram de fazer a alguns destes mais pequeninos, também a mim deixaram de fazê-lo’.\n\"E estes irão para o castigo eterno, mas os justos para a vida eterna\".\n\n- Mateus 25:1-46",
				"added": 1552437857
			},
			{
				"comment_id": 8,
				"body": "Quando ele estava saindo do templo, um de seus discípulos lhe disse: \"Olha, Mestre! Que pedras enormes! Que construções magníficas! \"\n\"Você está vendo todas estas grandes construções? \", perguntou Jesus. \"Aqui não ficará pedra sobre pedra; serão todas derrubadas\".\nTendo Jesus se assentado no monte das Oliveiras, de frente para o templo, Pedro, Tiago, João e André lhe perguntaram em particular:\n\"Dize-nos, quando acontecerão essas coisas? E qual será o sinal de que tudo isso está prestes a cumprir-se? \"\nJesus lhes disse: \"Cuidado, que ninguém os engane.\nMuitos virão em meu nome, dizendo: ‘Sou eu! ’ e enganarão a muitos.\nQuando ouvirem falar de guerras e rumores de guerras, não tenham medo. É necessário que tais coisas aconteçam, mas ainda não é o fim.\nNação se levantará contra nação, e reino contra reino. Haverá terremotos em vários lugares e também fomes. Essas coisas são o início das dores.\n\"Fiquem atentos, pois vocês serão entregues aos tribunais e serão açoitados nas sinagogas. Por minha causa vocês serão levados à presença de governadores e reis, como testemunho a eles.\nE é necessário que antes o evangelho seja pregado a todas as nações.\nSempre que forem presos e levados a julgamento, não fiquem preocupados com o que vão dizer. Digam tão-somente o que lhes for dado naquela hora, pois não serão vocês que estarão falando, mas o Espírito Santo.\n\"O irmão trairá seu próprio irmão, entregando-o à morte, e o mesmo fará o pai a seu filho. Filhos se rebelarão contra seus pais e os matarão.\nTodos odiarão vocês por minha causa; mas aquele que perseverar até o fim será salvo.\n\"Quando vocês virem ‘o sacrilégio terrível’ no lugar onde não deve estar — quem lê, entenda — então, os que estiverem na Judéia fujam para os montes.\nQuem estiver no telhado de sua casa não desça nem entre em casa para tirar dela coisa alguma.\nQuem estiver no campo não volte para pegar seu manto.\nComo serão terríveis aqueles dias para as grávidas e para as que estiverem amamentando!\nOrem para que essas coisas não aconteçam no inverno.\nPorque aqueles serão dias de tribulação como nunca houve desde que Deus criou o mundo até agora, nem jamais haverá.\nSe o Senhor não tivesse abreviado tais dias, ninguém sobreviveria. Mas, por causa dos eleitos por ele escolhidos, ele os abreviou.\nSe, então, alguém lhes disser: ‘Vejam, aqui está o Cristo! ’ ou: ‘Vejam, ali está ele! ’, não acreditem.\nPois aparecerão falsos cristos e falsos profetas que realizarão sinais e maravilhas para, se possível, enganar os eleitos.\nPor isso, fiquem atentos: avisei-os de tudo antecipadamente.\n\"Mas naqueles dias, após aquela tribulação, ‘o sol escurecerá e a lua não dará a sua luz;\nas estrelas cairão do céu e os poderes celestes serão abalados’.\n\"Então se verá o Filho do homem vindo nas nuvens com grande poder e glória.\nE ele enviará os seus anjos e reunirá os seus eleitos dos quatro ventos, dos confins da terra até os confins do céu.\n\"Aprendam a lição da figueira: quando seus ramos se renovam e suas folhas começam a brotar, vocês sabem que o verão está próximo.\nAssim também, quando virem estas coisas acontecendo, saibam que ele está próximo, às portas.\nEu lhes asseguro que não passará esta geração até que todas essas coisas aconteçam.\nO céu e a terra passarão, mas as minhas palavras jamais passarão\".\n\"Quanto ao dia e à hora ninguém sabe, nem os anjos no céu, nem o Filho, senão somente o Pai.\nFiquem atentos! Vigiem! Vocês não sabem quando virá esse tempo.\nÉ como um homem que sai de viagem. Ele deixa sua casa, encarrega de tarefas cada um dos seus servos e ordena ao porteiro que vigie.\nPortanto, vigiem, porque vocês não sabem quando o dono da casa voltará: se à tarde, à meia-noite, ao cantar do galo ou ao amanhecer.\nSe ele vier de repente, que não os encontre dormindo!\nO que lhes digo, digo a todos: Vigiem! \"\n\n- Marcos 13:1-37",
				"added": 1552437930
			},
			{
				"comment_id": 9,
				"body": "Digo a verdade em Cristo, não minto; minha consciência o confirma no Espírito Santo:\ntenho grande tristeza e constante angústia em meu coração.\nPois eu até desejaria ser amaldiçoado e separado de Cristo por amor de meus irmãos, os de minha raça,\no povo de Israel. Deles é a adoção de filhos; deles é a glória divina, as alianças, a concessão da lei, a adoração no templo e as promessas.\nDeles são os patriarcas, e a partir deles se traça a linhagem humana de Cristo, que é Deus acima de tudo, bendito para sempre! Amém.\nNão pensemos que a palavra de Deus falhou. Pois nem todos os descendentes de Israel são Israel.\nNem por serem descendentes de Abraão passaram todos a ser filhos de Abraão. Pelo contrário: \"Por meio de Isaque a sua descendência será considerada\".\nNoutras palavras, não são os filhos naturais que são filhos de Deus, mas os filhos da promessa é que são considerados descendência de Abraão.\nPois foi assim que a promessa foi feita: \"no tempo devido virei novamente, e Sara terá um filho\".\nE esse não foi o único caso; também os filhos de Rebeca tiveram um mesmo pai, nosso pai Isaque.\nTodavia, antes que os gêmeos nascessem ou fizessem qualquer coisa boa ou má — a fim de que o propósito de Deus conforme a eleição permanecesse,\nnão por obras, mas por aquele que chama — foi dito a ela: \"O mais velho servirá ao mais novo\".\nComo está escrito: \"Amei Jacó, mas rejeitei Esaú\".\nE então, que diremos? Acaso Deus é injusto? De maneira nenhuma!\nPois ele diz a Moisés: \"Terei misericórdia de quem eu quiser ter misericórdia e terei compaixão de quem eu quiser ter compaixão\".\nPortanto, isso não depende do desejo ou do esforço humano, mas da misericórdia de Deus.\nPois a Escritura diz ao faraó: \"Eu o levantei exatamente com este propósito: mostrar em você o meu poder, e para que o meu nome seja proclamado em toda a terra\".\nPortanto, Deus tem misericórdia de quem ele quer, e endurece a quem ele quer.\nMas algum de vocês me dirá: \"Então, por que Deus ainda nos culpa? Pois, quem resiste à sua vontade? \"\nMas quem é você, ó homem, para questionar a Deus? \"Acaso aquilo que é formado pode dizer ao que o formou: ‘Por que me fizeste assim? ’ \"\nO oleiro não tem direito de fazer do mesmo barro um vaso para fins nobres e outro para uso desonroso?\nE se Deus, querendo mostrar a sua ira e tornar conhecido o seu poder, suportou com grande paciência os vasos de sua ira, preparados para destruição?\nQue dizer, se ele fez isto para tornar conhecidas as riquezas de sua glória aos vasos de sua misericórdia, que preparou de antemão para glória,\nou seja, a nós, a quem também chamou, não apenas dentre os judeus, mas também dentre os gentios?\nComo ele diz em Oséias: \"Chamarei ‘meu povo’ a quem não é meu povo; e chamarei ‘minha amada’ a quem não é minha amada\",\ne: \"Acontecerá que, no mesmo lugar em que se lhes declarou: ‘Vocês não são meu povo’, eles serão chamados ‘filhos do Deus vivo’. \"\nIsaías exclama com relação a Israel: \"Embora o número dos israelitas seja como a areia do mar, apenas o remanescente será salvo.\nPois o Senhor executará na terra a sua sentença, rápida e definitivamente\".\nComo anteriormente disse Isaías: \"Se o Senhor dos Exércitos não nos tivesse deixado descendentes, já estaríamos como Sodoma, e semelhantes a Gomorra\".\nQue diremos, então? Os gentios, que não buscavam justiça, a obtiveram, uma justiça que vem da fé;\nmas Israel, que buscava uma lei que trouxesse justiça, não a alcançou.\nPor que não? Porque não a buscava pela fé, mas como se fosse por obras. Eles tropeçaram na \"pedra de tropeço\".\nComo está escrito: \"Eis que ponho em Sião uma pedra de tropeço e uma rocha que faz cair; e aquele que nela confia jamais será envergonhado\".\n\n- Romanos 9:1-33",
				"added": 1552439109
			}
		]
	},
	"comment_vote": {}
}