{
	"pages": [
		{
			"id": "99aa41c0-535f-11e7-82de-255949745a0d",
			"body": "Dogecoin (/ˈdoʊʒkɔɪn/ DOHZH-koyn,[1] code: DOGE, symbol: Ð[2] and D) is a cryptocurrency featuring a likeness of the Shiba Inu dog from the \"Doge\" Internet meme as its logo.[3][4][5][6] Introduced as a \"joke currency\" on 8 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014;[7] as of June 2017, it has a capitalization of US$440 million.\n\nCompared with other cryptocurrencies, Dogecoin has a fast initial coin production schedule: 100 billion coins have been in circulation by mid 2015 with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin has been mined.[8] While there are few mainstream commercial applications, the currency has gained traction as an Internet tipping system, in which social media users grant Dogecoin tips to other users for providing interesting or noteworthy content.[9] Many members of the Dogecoin community, as well as members of other cryptocurrency communities, use the phrase \"To the moon!\" to describe the overall sentiment of the coin's rising value. Thanks to crowdfunding efforts, a gold coin representing the cryptocurrency is scheduled to reach the Moon's surface in 2019.\n\nOverview and history[edit]\n\nA Dogecoin paper wallet\nDogecoin was created by programmer Billy Markus from Portland, Oregon, who hoped to create a fun cryptocurrency that could reach a broader demographic than bitcoin. In addition, he wanted to distance it from the controversial history behind bitcoin, mainly its association with the Silk Road online drug marketplace.[16] At the same time, Jackson Palmer, a member of Adobe Systems' marketing department in Sydney, was encouraged on Twitter by a student at Front Range Community College to make the idea a reality.[17]\n\nAfter receiving several mentions on Twitter, Palmer purchased the domain dogecoin.com and added a splash screen, which featured the coin's logo and scattered Comic Sans text. Markus saw the site linked in an IRC chat room, and started efforts to create the currency after reaching out to Palmer. Markus based Dogecoin on the existing cryptocurrency, Luckycoin,[18] which features a randomized reward that is received for mining a block, although this behavior was later changed to a static block reward in March 2014.[19] In turn, Luckycoin is based on Litecoin,[20] which also uses scrypt technology in its proof-of-work algorithm. The use of scrypt means that miners cannot use SHA-256 bitcoin mining equipment, and that dedicated FPGA and ASIC devices used for mining are complicated to create. Dogecoin was officially launched on December 8, 2013.[21] The Dogecoin network was originally intended to produce 100 billion Dogecoins, but later, it was announced that the Dogecoin network would produce infinite Dogecoins.[22][23][24]\n\nOn December 19, 2013, Dogecoin jumped nearly 300 percent in value in 72 hours, rising from US$0.00026 to $0.00095,[25] with a volume of billions of Dogecoins per day.[26] This growth occurred during a time when bitcoin and many other cryptocurrencies were reeling from China's decision to forbid Chinese banks from investing Chinese Yuan into the bitcoin economy.[20] Three days later, Dogecoin experienced its first major crash by dropping by 80% due to large mining pools seizing opportunity in exploiting the very little computing power required at the time to mine the coin.[27]\n\nOn December 24, 2013, The Reserve Bank of India cautioned users of Dogecoin and other cryptocurrencies on the risks associated with them.[28] On December 25, 2013, the first major theft attempt of Dogecoin occurred when millions of coins were stolen during a hacking attempt on the online wallet platform Dogewallet.[29] The hacker gained access to the platform's filesystem and modified its send/receive page to send any and all coins to a static address.[30][31] This incident spiked Tweets about Dogecoin making it the most mentioned altcoin on Twitter.[32] To help those who lost funds on Dogewallet after its breach, the Dogecoin community started an initiative named \"SaveDogemas\" to help donate coins to those who lost them. Approximately one month later, enough money was donated to cover all of the coins that were lost.[33] By January 2014, the trading volume of Dogecoin briefly surpassed that of bitcoin and all other crypto-currencies combined.[34] As of 25 January 2015, Dogecoin has a market capitalization of USD 13.5 million.[35] April 2015 Jackson Palmer announced he is taking an \"extended leave of absence\" from the cryptocurrency community.[36]\n\nFundraising[edit]\n2014 Winter Olympics[edit]\nThe Dogecoin community and foundation have encouraged fundraising for charities and other notable causes. On January 19, 2014, a fundraiser was established by the Dogecoin community to raise $50,000 for the Jamaican Bobsled Team, which had qualified for, but could not afford to go to, the Sochi Winter Olympics. By the second day, $30,000 worth of Dogecoin was donated,[37] and the Dogecoin to bitcoin exchange rate rose by 50%.[38][39][40][41][42][43] The Dogecoin community also raised funds for a second Sochi athlete Shiva Keshavan.[44]\n\nDoge4Water[edit]\nInspired by the Winter Olympics fundraiser and smaller charity fundraising successes, the Dogecoin Foundation, led by Eric Nakagawa, began collecting donations to build a well in the Tana river basin in Kenya in cooperation with Charity: Water. They set out to raise a total of 40,000,000 ($30,000 at the time) Dogecoin before World Water Day (March 22). The campaign succeeded, collecting donations from more than 4,000 donors, including one anonymous benefactor who donated 14,000,000 Dogecoin (~ $11,000) in what news media dubbed \"the most valuable tweet in history\".[45]\n\nNASCAR[edit]\nOn March 25, 2014, the Dogecoin community successfully raised 67.8 million Dogecoins (around $55,000 at the time) in an effort to sponsor NASCAR driver Josh Wise. Wise ran with a Dogecoin/Reddit-sponsored paint scheme at the Aaron's 499 at Talladega Superspeedway.[46] On May 4, 2014, Wise and his car were featured for nearly a minute, during which the race commentators discussed Dogecoin and the crowdfunding effort, while finishing twentieth and narrowly avoiding multiple wrecks.[47] On May 16, 2014, Wise won a spot at the Sprint All-Star Race through an online fan vote beating household name Danica Patrick, largely due to the efforts of the Dogecoin Reddit community. He finished the race in fifteenth, the last car running.[48][49] The following race in the Coca-Cola 600, Wise debuted a Dogecoin/Reddit.com helmet.[50] Wise later announced he would run the car again at the Toyota/Save Mart 350[51] as a thank-you gift to the community and the GEICO 500. He finished twenty-eighth in the race due in part to a refueling issue; he was in twelfth place after a gas-and-go pit stop, but the gas can did not engage long enough, resulting in a second pit stop that took him towards the back of the pack.[52] The developer of the NASCAR '14 video game announced that they are looking into adding the Dogecoin car as a drivable car in an upcoming DLC.[49][53]\n\nUse and exchanges[edit]\nSeveral online exchanges offer DOGE/BTC [54] and DOGE/LTC [55] trading. Three exchanges, Mengmengbi, Bter and BTC38, offer DOGE/CNY trading.[56][57] On January 8, 2014, AltQuick.co was the first exchange to launch DOGE/USD exchange.[58] On January 30, 2014, Canada-based exchange Vault of Satoshi also announced DOGE/USD and DOGE/CAD trading.[59][60] On February 2014, Hong Kong-based exchange Asia Nexgen announced that they would support the trading of Dogecoins in all major currencies. China-based exchange BTC38 also added their support on the Dogecoin exchange, boosting the market capitalization over 24 hours.[61][62] In the first day of trading, Dogecoin was the second-most traded currency on the platform, after BTC.[63] On September 2014, UK-based exchange Yacuna began offering DOGE/EUR and DOGE/GBP trading.[64]\n\nOn January 31, 2014, trading volume across the major exchanges was valued at $1.05 million USD. The market cap was USD$60 million. Three exchanges accounted for the majority of volume: Bter (60%), Cryptsy (23%), and Vircurex (10%). The most traded currency pairs were DOGE/BTC (50%), DOGE/CNY (44%) and DOGE/LTC (6%).[65]\n\nTrading physical, tangible items in exchange for DOGE takes place on online communities such as Reddit and Twitter, where users frequently share currency-related information.[66][67] On December 23, 2013, Tristan Winters of the online journal Bitcoin Magazine discussed what was needed for Dogecoin to replace bitcoin.[68]\n\nThe first Dogecoin ATM was demoed at Coinfest in Vancouver in February 2014.[69] Two bitcoin ATMs supporting Dogecoins and other altcoins opened in Tijuana, Mexico on March 17, 2014.[70]\n\nDogecoin has also been used to try sell a house,[71] and has been used in the pornography[72] and poker[73] industries.\n\nWeather forecasting mobile app, web application, and website Doge Weather's creators Katia Eirin and Bennett Wong request tips in Dogecoin to maintain their website.[74]\n\nDogetipbot is a cryptocurrency transaction service used on popular sites like Reddit and Twitch.tv.[75] It allows users to send Dogecoins to other users through commands via Reddit comments;[76] support for Twitch.tv and Twitter has been discontinued.[77] The service was launched in 2013 on Reddit.[78] The trademark \"dogetipbot\" was officially registered on August 19, 2014.[79] In November 2014, the developer team behind dogetipbot raised $445,000 in venture capital funding.[80]\n\nTransactions[edit]\n\nThis article needs additional or better citations for verification. Please help improve this article by adding citations to reliable sources. Unsourced material may be challenged and removed. (November 2014) (Learn how and when to remove this template message)\nSee also: Bitcoin network\nLike bitcoin and Litecoin, Dogecoin functions using public-key cryptography, in which a user generates a pair of cryptographic keys: one public and one private. Only the private key can decode information encrypted with the public key; therefore the keys' owner can distribute the public key openly without fear that anyone will be able to use it to gain access to the encrypted information. All Dogecoin addresses are public key hashes. Unlike bitcoin addresses, which are 27 to 33 characters long, Dogecoin addresses are a string of 34 numbers and letters (both upper and lower case), starting with the letter D. A public key is the Dogecoin address to which other users can send Dogecoins. A private key, however, allows full access to the Dogecoin wallet; it must be kept secret and secure. Dogecoin holds the record for most transactions per day for any cryptocurrency, peaking at 2.5 times more transactions than all other cryptocurrencies combined in December 2013.[81]\n\nMining parameters[edit]\nDogecoin's implementation differs from Litecoin by several parameters. Dogecoin's block time is 1 minute as opposed to Litecoin's 2.5 minutes. The difficulty retarget time is once per block and the reward is fixed based on the block schedule listed below. However, when Dogecoin was first introduced, the difficulty retargeting was once every four hours, and the reward was a random number between 0 and a maximum defined by the block schedule. Under the system in which a random number of coins were distributed, rewards were calculated using a Mersenne Twister pseudo-random number generator.[82] While the original implementation of Dogecoin meant for there to be a fixed number of coins per block from block 600,001 onwards only (providing 10,000 coins per block), the algorithms in Dogecoin were changed beginning from the 145,000th block so that a fixed reward was always given (providing 250,000 coins per block until block 200,001).[83]\n\nOn March 12, 2014, version 1.6 of the Dogecoin client was announced. Along with allowing for there to be a fixed reward per block, the new client update also introduced a new difficulty algorithm called DigiShield. The main goal of the new difficulty algorithm, adopted from DigiByte, was to prevent multipools from being able to mine (and thereby profit) off the coin, reducing the price of the coin drastically, along with forcing single-coin miners to deal with the rise in difficulty the pools left in their wake. Thanks to the algorithm's near-instant change in difficulty, any multipool entering the Dogecoin network will immediately leave, as the difficulty of mining will spike upwards severely, causing a drop in profitability and, ultimately, an absence of multipools.[83]\n\nSeveral cases of using employer or university computers to mine Dogecoin have been discovered.[84][85]\n\nBlock schedule[edit]\nBlock numbers\tPer-block reward\tFirst block\tExpected coins produced (approx.)\tExpected total circulation (approx.)\n1–100,000\t0-1,000,000 (random)\tDecember 8, 2013[86]\t50,000,000,000\t50,000,000,000\n100,001–144,999\t0-500,000 (random)\tFebruary 14, 2014[87]\t11,250,000,000\t61,250,000,000\n145,000–200,000\t250,000 (fixed)\tMarch 17, 2014[88]\t13,750,000,000\t75,000,000,000\n200,001–300,000\t125,000 (fixed)\tApril 28, 2014[89]\t12,500,000,000\t87,500,000,000\n300,001–400,000\t62,500 (fixed)\tJuly 15, 2014[90]\t6,250,000,000\t93,750,000,000\n400,001–500,000\t31,250 (fixed)\tOctober 2, 2014[91]\t3,125,000,000\t96,875,000,000\n500,001–600,000\t15,625 (fixed)\tDecember 14, 2014[92]\t1,562,000,000\t98,437,500,000\n600,001+\t10,000 (fixed)\tFebruary 25, 2015[93]\t5,200,000,000 per year\tNo limit\n",
			"date_added": 1497705572316,
			"slug": "dogecoin"
		},
		{
			"id": "323cbf90-535f-11e7-99aa-5324144155c0",
			"body": "The Internet is the global system of interconnected computer networks that use the Internet protocol suite (TCP/IP) to link devices worldwide. It is a network of networks that consists of private, public, academic, business, and government networks of local to global scope, linked by a broad array of electronic, wireless, and optical networking technologies. The Internet carries an extensive range of information resources and services, such as the inter-linked hypertext documents and applications of the World Wide Web (WWW), electronic mail, telephony, and file sharing.\n\nThe origins of the Internet date back to research commissioned by the United States federal government in the 1960s to build robust, fault-tolerant communication via computer networks.[1] The primary precursor network, the ARPANET, initially served as a backbone for interconnection of regional academic and military networks in the 1980s. The funding of the National Science Foundation Network as a new backbone in the 1980s, as well as private funding for other commercial extensions, led to worldwide participation in the development of new networking technologies, and the merger of many networks.[2] The linking of commercial networks and enterprises by the early 1990s marks the beginning of the transition to the modern Internet,[3] and generated a sustained exponential growth as generations of institutional, personal, and mobile computers were connected to the network. Although the Internet was widely used by academia since the 1980s, the commercialization incorporated its services and technologies into virtually every aspect of modern life.\n\nInternet use grew rapidly in the West from the mid-1990s and from the late 1990s in the developing world.[4] In the two decades since then, Internet use has grown 100-times, measured for the period of one year, to over one third of the world population.[5][6] Most traditional communications media, including telephony, radio, television, paper mail and newspapers are being reshaped or redefined by the Internet, giving birth to new services such as email, Internet telephony, Internet television, online music, digital newspapers, and video streaming websites. Newspaper, book, and other print publishing are adapting to website technology, or are reshaped into blogging, web feeds and online news aggregators. The Internet has enabled and accelerated new forms of personal interactions through instant messaging, Internet forums, and social networking. Online shopping has grown exponentially both for major retailers and small businesses and entrepreneurs, as it enables firms to extend their \"brick and mortar\" presence to serve a larger market or even sell goods and services entirely online. Business-to-business and financial services on the Internet affect supply chains across entire industries.\n\nThe Internet has no centralized governance in either technological implementation or policies for access and usage; each constituent network sets its own policies.[7] Only the overreaching definitions of the two principal name spaces in the Internet, the Internet Protocol address (IP address) space and the Domain Name System (DNS), are directed by a maintainer organization, the Internet Corporation for Assigned Names and Numbers (ICANN). The technical underpinning and standardization of the core protocols is an activity of the Internet Engineering Task Force (IETF), a non-profit organization of loosely affiliated international participants that anyone may associate with by contributing technical expertise.[8]\n\nTerminology\n\nThe Internet Messenger by Buky Schwartz, located in Holon, Israel\nSee also: Capitalization of \"Internet\"\nThe term Internet, when used to refer to the specific global system of interconnected Internet Protocol (IP) networks, is a proper noun[9] and may be written with an initial capital letter. In common use and the media, it is often not capitalized, viz. the internet. Some guides specify that the word should be capitalized when used as a noun, but not capitalized when used as an adjective.[10] The Internet is also often referred to as the Net, as a short form of network. Historically, as early as 1849, the word internetted was used uncapitalized as an adjective, meaning interconnected or interwoven.[11] The designers of early computer networks used internet both as a noun and as a verb in shorthand form of internetwork or internetworking, meaning interconnecting computer networks.[12]\n\nThe terms Internet and World Wide Web are often used interchangeably in everyday speech; it is common to speak of \"going on the Internet\" when invoking a web browser to view web pages. However, the World Wide Web or the Web is only one of a large number of Internet services. The Web is a collection of interconnected documents (web pages) and other web resources, linked by hyperlinks and URLs.[13] As another point of comparison, Hypertext Transfer Protocol, or HTTP, is the language used on the Web for information transfer, yet it is just one of many languages or protocols that can be used for communication on the Internet.[14] The term Interweb is a portmanteau of Internet and World Wide Web typically used sarcastically to parody a technically unsavvy user.\n\nHistory\nMain articles: History of the Internet and History of the World Wide Web\nResearch into packet switching started in the early 1960s,[15] and packet switched networks such as the ARPANET, CYCLADES,[16][17] the Merit Network,[18] NPL network,[19] Tymnet, and Telenet, were developed in the late 1960s and 1970s using a variety of protocols.[20] The ARPANET project led to the development of protocols for internetworking, by which multiple separate networks could be joined into a single network of networks.[21] ARPANET development began with two network nodes which were interconnected between the Network Measurement Center at the University of California, Los Angeles (UCLA) Henry Samueli School of Engineering and Applied Science directed by Leonard Kleinrock, and the NLS system at SRI International (SRI) by Douglas Engelbart in Menlo Park, California, on 29 October 1969.[22] The third site was the Culler-Fried Interactive Mathematics Center at the University of California, Santa Barbara, followed by the University of Utah Graphics Department. In an early sign of future growth, fifteen sites were connected to the young ARPANET by the end of 1971.[23][24] These early years were documented in the 1972 film Computer Networks: The Heralds of Resource Sharing.\n\nEarly international collaborations on the ARPANET were rare. European developers were concerned with developing the X.25 networks.[25] Notable exceptions were the Norwegian Seismic Array (NORSAR) in June 1973, followed in 1973 by Sweden with satellite links to the Tanum Earth Station and Peter T. Kirstein's research group in the United Kingdom, initially at the Institute of Computer Science, University of London and later at University College London.[26][27][28] In December 1974, RFC 675 (Specification of Internet Transmission Control Program), by Vinton Cerf, Yogen Dalal, and Carl Sunshine, used the term internet as a shorthand for internetworking and later RFCs repeated this use.[29] Access to the ARPANET was expanded in 1981 when the National Science Foundation (NSF) funded the Computer Science Network (CSNET). In 1982, the Internet Protocol Suite (TCP/IP) was standardized, which permitted worldwide proliferation of interconnected networks.\n\n\nT3 NSFNET Backbone, c. 1992.\nTCP/IP network access expanded again in 1986 when the National Science Foundation Network (NSFNet) provided access to supercomputer sites in the United States for researchers, first at speeds of 56 kbit/s and later at 1.5 Mbit/s and 45 Mbit/s.[30] Commercial Internet service providers (ISPs) emerged in the late 1980s and early 1990s. The ARPANET was decommissioned in 1990. By 1995, the Internet was fully commercialized in the U.S. when the NSFNet was decommissioned, removing the last restrictions on use of the Internet to carry commercial traffic.[31] The Internet rapidly expanded in Europe and Australia in the mid to late 1980s[32][33] and to Asia in the late 1980s and early 1990s.[34] The beginning of dedicated transatlantic communication between the NSFNET and networks in Europe was established with a low-speed satellite relay between Princeton University and Stockholm, Sweden in December 1988.[35] Although other network protocols such as UUCP had global reach well before this time, this marked the beginning of the Internet as an intercontinental network.\n\nPublic commercial use of the Internet began in mid-1989 with the connection of MCI Mail and Compuserve's email capabilities to the 500,000 users of the Internet.[36] Just months later on January 1, 1990, PSInet launched an alternate Internet backbone for commercial use; one of the networks that would grow into the commercial Internet we know today. In March 1990, the first high-speed T1 (1.5 Mbit/s) link between the NSFNET and Europe was installed between Cornell University and CERN, allowing much more robust communications than were capable with satellites.[37] Six months later Tim Berners-Lee would begin writing WorldWideWeb, the first web browser after two years of lobbying CERN management. By Christmas 1990, Berners-Lee had built all the tools necessary for a working Web: the HyperText Transfer Protocol (HTTP) 0.9,[38] the HyperText Markup Language (HTML), the first Web browser (which was also a HTML editor and could access Usenet newsgroups and FTP files), the first HTTP server software (later known as CERN httpd), the first web server,[39] and the first Web pages that described the project itself. In 1991 the Commercial Internet eXchange was founded, allowing PSInet to communicate with the other commercial networks CERFnet and Alternet. Since 1995 the Internet has tremendously impacted culture and commerce, including the rise of near instant communication by email, instant messaging, telephony (Voice over Internet Protocol or VoIP), two-way interactive video calls, and the World Wide Web[40] with its discussion forums, blogs, social networking, and online shopping sites. Increasing amounts of data are transmitted at higher and higher speeds over fiber optic networks operating at 1-Gbit/s, 10-Gbit/s, or more.\n\nWorldwide Internet users\n \t2005\t2010\t2016a\nWorld population[41]\t6.5 billion\t6.9 billion\t7.3 billion\nUsers worldwide\t16%\t30%\t47%\nUsers in the developing world\t8%\t21%\t40%\nUsers in the developed world\t51%\t67%\t81%\na Estimate.\nSource: International Telecommunications Union.[42]\nThe Internet continues to grow, driven by ever greater amounts of online information and knowledge, commerce, entertainment and social networking.[43] During the late 1990s, it was estimated that traffic on the public Internet grew by 100 percent per year, while the mean annual growth in the number of Internet users was thought to be between 20% and 50%.[44] This growth is often attributed to the lack of central administration, which allows organic growth of the network, as well as the non-proprietary nature of the Internet protocols, which encourages vendor interoperability and prevents any one company from exerting too much control over the network.[45] As of 31 March 2011, the estimated total number of Internet users was 2.095 billion (30.2% of world population).[46] It is estimated that in 1993 the Internet carried only 1% of the information flowing through two-way telecommunication, by 2000 this figure had grown to 51%, and by 2007 more than 97% of all telecommunicated information was carried over the Internet.[47]\n\nGovernance\nMain article: Internet governance\n\nICANN headquarters in the Playa Vista neighborhood of Los Angeles, California, United States.\nThe Internet is a global network comprising many voluntarily interconnected autonomous networks. It operates without a central governing body. The technical underpinning and standardization of the core protocols (IPv4 and IPv6) is an activity of the Internet Engineering Task Force (IETF), a non-profit organization of loosely affiliated international participants that anyone may associate with by contributing technical expertise. To maintain interoperability, the principal name spaces of the Internet are administered by the Internet Corporation for Assigned Names and Numbers (ICANN). ICANN is governed by an international board of directors drawn from across the Internet technical, business, academic, and other non-commercial communities. ICANN coordinates the assignment of unique identifiers for use on the Internet, including domain names, Internet Protocol (IP) addresses, application port numbers in the transport protocols, and many other parameters. Globally unified name spaces are essential for maintaining the global reach of the Internet. This role of ICANN distinguishes it as perhaps the only central coordinating body for the global Internet.[48]\n\nRegional Internet Registries (RIRs) allocate IP addresses:\n\nAfrican Network Information Center (AfriNIC) for Africa\nAmerican Registry for Internet Numbers (ARIN) for North America\nAsia-Pacific Network Information Centre (APNIC) for Asia and the Pacific region\nLatin American and Caribbean Internet Addresses Registry (LACNIC) for Latin America and the Caribbean region\nRéseaux IP Européens – Network Coordination Centre (RIPE NCC) for Europe, the Middle East, and Central Asia\nThe National Telecommunications and Information Administration, an agency of the United States Department of Commerce, had final approval over changes to the DNS root zone until the IANA stewardship transition on the 1st of October 2016.[49][50][51][52] The Internet Society (ISOC) was founded in 1992 with a mission to \"assure the open development, evolution and use of the Internet for the benefit of all people throughout the world\".[53] Its members include individuals (anyone may join) as well as corporations, organizations, governments, and universities. Among other activities ISOC provides an administrative home for a number of less formally organized groups that are involved in developing and managing the Internet, including: the Internet Engineering Task Force (IETF), Internet Architecture Board (IAB), Internet Engineering Steering Group (IESG), Internet Research Task Force (IRTF), and Internet Research Steering Group (IRSG). On 16 November 2005, the United Nations-sponsored World Summit on the Information Society in Tunis established the Internet Governance Forum (IGF) to discuss Internet-related issues.\n\nInfrastructure\nSee also: List of countries by number of Internet users and List of countries by Internet connection speeds\n\n2007 map showing submarine fiberoptic telecommunication cables around the world.\nThe communications infrastructure of the Internet consists of its hardware components and a system of software layers that control various aspects of the architecture.\n\nRouting and service tiers\n\nPacket routing across the Internet involves several tiers of Internet service providers.\nInternet service providers establish the worldwide connectivity between individual networks at various levels of scope. End-users who only access the Internet when needed to perform a function or obtain information, represent the bottom of the routing hierarchy. At the top of the routing hierarchy are the tier 1 networks, large telecommunication companies that exchange traffic directly with each other via peering agreements. Tier 2 and lower level networks buy Internet transit from other providers to reach at least some parties on the global Internet, though they may also engage in peering. An ISP may use a single upstream provider for connectivity, or implement multihoming to achieve redundancy and load balancing. Internet exchange points are major traffic exchanges with physical connections to multiple ISPs. Large organizations, such as academic institutions, large enterprises, and governments, may perform the same function as ISPs, engaging in peering and purchasing transit on behalf of their internal networks. Research networks tend to interconnect with large subnetworks such as GEANT, GLORIAD, Internet2, and the UK's national research and education network, JANET. Both the Internet IP routing structure and hypertext links of the World Wide Web are examples of scale-free networks.[54] Computers and routers use routing tables in their operating system to direct IP packets to the next-hop router or destination. Routing tables are maintained by manual configuration or automatically by routing protocols. End-nodes typically use a default route that points toward an ISP providing transit, while ISP routers use the Border Gateway Protocol to establish the most efficient routing across the complex connections of the global Internet.\n\nAccess\nCommon methods of Internet access by users include dial-up with a computer modem via telephone circuits, broadband over coaxial cable, fiber optics or copper wires, Wi-Fi, satellite and cellular telephone technology (3G, 4G). The Internet may often be accessed from computers in libraries and Internet cafes. Internet access points exist in many public places such as airport halls and coffee shops. Various terms are used, such as public Internet kiosk, public access terminal, and Web payphone. Many hotels also have public terminals, though these are usually fee-based. These terminals are widely accessed for various usages, such as ticket booking, bank deposit, or online payment. Wi-Fi provides wireless access to the Internet via local computer networks. Hotspots providing such access include Wi-Fi cafes, where users need to bring their own wireless devices such as a laptop or PDA. These services may be free to all, free to customers only, or fee-based.\n\nGrassroots efforts have led to wireless community networks. Commercial Wi-Fi services covering large city areas are in place in New York, London, Vienna, Toronto, San Francisco, Philadelphia, Chicago and Pittsburgh. The Internet can then be accessed from such places as a park bench.[55] Apart from Wi-Fi, there have been experiments with proprietary mobile wireless networks like Ricochet, various high-speed data services over cellular phone networks, and fixed wireless services. High-end mobile phones such as smartphones in general come with Internet access through the phone network. Web browsers such as Opera are available on these advanced handsets, which can also run a wide variety of other Internet software. More mobile phones have Internet access than PCs, though this is not as widely used.[56] An Internet access provider and protocol matrix differentiates the methods used to get online.\n\nStructure\nMany computer scientists describe the Internet as a \"prime example of a large-scale, highly engineered, yet highly complex system\".[57] The structure was found to be highly robust to random failures,[58] yet, very vulnerable to intentional attacks.[59] The Internet structure and its usage characteristics have been studied extensively and the possibility of developing alternative structures has been investigated.[60]\n\nProtocols\nNetwork Architecture\tService Model\tGuarantee ?\tCongestion Feedback\nBandwidth\tLoss\tOrder\tTiming\nInternet\tbest effort\tnone\tno\tno\tno\tno (inferred via loss)\nATM\tCBR\tconstant rate\tyes\tyes\tyes\tno congestion\nATM\tVBR\tguarantee rate\tyes\tyes\tyes\tno congestion\nATM\tABR\tguarantee minimum\tno\tyes\tno\tyes\nATM\tUBR\tnone\tno\tyes\tno\tno\n\n\nInternet protocol suite\nApplication layer\nBGP DHCP DNS FTP HTTP IMAP LDAP MGCP MQTT NNTP NTP POP ONC/RPC RTP RTSP RIP SIP SMTP SNMP SSH Telnet TLS/SSL XMPP more...\nTransport layer\nTCP UDP DCCP SCTP RSVP more...\nInternet layer\nIP IPv4 IPv6 ICMP ICMPv6 ECN IGMP OSPF IPsec more...\nLink layer\nARP NDP Tunnels L2TP PPP MAC Ethernet DSL ISDN FDDI more...\nv t e\nWhile the hardware components in the Internet infrastructure can often be used to support other software systems, it is the design and the standardization process of the software that characterizes the Internet and provides the foundation for its scalability and success. The responsibility for the architectural design of the Internet software systems has been assumed by the Internet Engineering Task Force (IETF).[61] The IETF conducts standard-setting work groups, open to any individual, about the various aspects of Internet architecture. Resulting contributions and standards are published as Request for Comments (RFC) documents on the IETF web site. The principal methods of networking that enable the Internet are contained in specially designated RFCs that constitute the Internet Standards. Other less rigorous documents are simply informative, experimental, or historical, or document the best current practices (BCP) when implementing Internet technologies.\n\nThe Internet standards describe a framework known as the Internet protocol suite. This is a model architecture that divides methods into a layered system of protocols, originally documented in RFC 1122 and RFC 1123. The layers correspond to the environment or scope in which their services operate. At the top is the application layer, space for the application-specific networking methods used in software applications. For example, a web browser program uses the client-server application model and a specific protocol of interaction between servers and clients, while many file-sharing systems use a peer-to-peer paradigm. Below this top layer, the transport layer connects applications on different hosts with a logical channel through the network with appropriate data exchange methods.\n\nUnderlying these layers are the networking technologies that interconnect networks at their borders and exchange traffic across them. The Internet layer enables computers to identify and locate each other via Internet Protocol (IP) addresses, and routes their traffic via intermediate (transit) networks. Last, at the bottom of the architecture is the link layer, which provides logical connectivity between hosts on the same network link, such as a local area network (LAN) or a dial-up connection. The model, also known as TCP/IP, is designed to be independent of the underlying hardware used for the physical connections, which the model does not concern itself with in any detail. Other models have been developed, such as the OSI model, that attempt to be comprehensive in every aspect of communications. While many similarities exist between the models, they are not compatible in the details of description or implementation. Yet, TCP/IP protocols are usually included in the discussion of OSI networking.\n\n\nAs user data is processed through the protocol stack, each abstraction layer adds encapsulation information at the sending host. Data is transmitted over the wire at the link level between hosts and routers. Encapsulation is removed by the receiving host. Intermediate relays update link encapsulation at each hop, and inspect the IP layer for routing purposes.\nThe most prominent component of the Internet model is the Internet Protocol (IP), which provides addressing systems, including IP addresses, for computers on the network. IP enables internetworking and, in essence, establishes the Internet itself. Internet Protocol Version 4 (IPv4) is the initial version used on the first generation of the Internet and is still in dominant use. It was designed to address up to ~4.3 billion (109) hosts. However, the explosive growth of the Internet has led to IPv4 address exhaustion, which entered its final stage in 2011,[62] when the global address allocation pool was exhausted. A new protocol version, IPv6, was developed in the mid-1990s, which provides vastly larger addressing capabilities and more efficient routing of Internet traffic. IPv6 is currently in growing deployment around the world, since Internet address registries (RIRs) began to urge all resource managers to plan rapid adoption and conversion.[63]\n\nIPv6 is not directly interoperable by design with IPv4. In essence, it establishes a parallel version of the Internet not directly accessible with IPv4 software. Thus, translation facilities must exist for internetworking or nodes must have duplicate networking software for both networks. Essentially all modern computer operating systems support both versions of the Internet Protocol. Network infrastructure, however, has been lagging in this development. Aside from the complex array of physical connections that make up its infrastructure, the Internet is facilitated by bi- or multi-lateral commercial contracts, e.g., peering agreements, and by technical specifications or protocols that describe the exchange of data over the network. Indeed, the Internet is defined by its interconnections and routing policies.\n\nServices\nThe Internet carries many network services, most prominently mobile apps such as social media apps, the World Wide Web, electronic mail, multiplayer online games, Internet telephony, and file sharing services.\n\nWorld Wide Web\n\nThis NeXT Computer was used by Tim Berners-Lee at CERN and became the world's first Web server.\nMany people use the terms Internet and World Wide Web, or just the Web, interchangeably, but the two terms are not synonymous. The World Wide Web is the primary application that billions of people use on the Internet, and it has changed their lives immeasurably.[64][65] However, the Internet provides many other services. The Web is a global set of documents, images and other resources, logically interrelated by hyperlinks and referenced with Uniform Resource Identifiers (URIs). URIs symbolically identify services, servers, and other databases, and the documents and resources that they can provide. Hypertext Transfer Protocol (HTTP) is the main access protocol of the World Wide Web. Web services also use HTTP to allow software systems to communicate in order to share and exchange business logic and data.\n\nWorld Wide Web browser software, such as Microsoft's Internet Explorer/Edge, Mozilla Firefox, Opera, Apple's Safari, and Google Chrome, lets users navigate from one web page to another via hyperlinks embedded in the documents. These documents may also contain any combination of computer data, including graphics, sounds, text, video, multimedia and interactive content that runs while the user is interacting with the page. Client-side software can include animations, games, office applications and scientific demonstrations. Through keyword-driven Internet research using search engines like Yahoo!, Bing and Google, users worldwide have easy, instant access to a vast and diverse amount of online information. Compared to printed media, books, encyclopedias and traditional libraries, the World Wide Web has enabled the decentralization of information on a large scale.\n\nThe Web has also enabled individuals and organizations to publish ideas and information to a potentially large audience online at greatly reduced expense and time delay. Publishing a web page, a blog, or building a website involves little initial cost and many cost-free services are available. However, publishing and maintaining large, professional web sites with attractive, diverse and up-to-date information is still a difficult and expensive proposition. Many individuals and some companies and groups use web logs or blogs, which are largely used as easily updatable online diaries. Some commercial organizations encourage staff to communicate advice in their areas of specialization in the hope that visitors will be impressed by the expert knowledge and free information, and be attracted to the corporation as a result.\n\nOne example of this practice is Microsoft, whose product developers publish their personal blogs in order to pique the public's interest in their work.[original research?] Collections of personal web pages published by large service providers remain popular and have become increasingly sophisticated. Whereas operations such as Angelfire and GeoCities have existed since the early days of the Web, newer offerings from, for example, Facebook and Twitter currently have large followings. These operations often brand themselves as social network services rather than simply as web page hosts.[citation needed]\n\nAdvertising on popular web pages can be lucrative, and e-commerce which is the sale of products and services directly via the Web, continues to grow. Online advertising is a form of marketing and advertising which uses the Internet to deliver promotional marketing messages to consumers. It includes email marketing, search engine marketing (SEM), social media marketing, many types of display advertising (including web banner advertising), and mobile advertising. In 2011, Internet advertising revenues in the United States surpassed those of cable television and nearly exceeded those of broadcast television.[66]:19 Many common online advertising practices are controversial and increasingly subject to regulation.\n\nWhen the Web developed in the 1990s, a typical web page was stored in completed form on a web server, formatted in HTML, complete for transmission to a web browser in response to a request. Over time, the process of creating and serving web pages has become dynamic, creating a flexible design, layout, and content. Websites are often created using content management software with, initially, very little content. Contributors to these systems, who may be paid staff, members of an organization or the public, fill underlying databases with content using editing pages designed for that purpose while casual visitors view and read this content in HTML form. There may or may not be editorial, approval and security systems built into the process of taking newly entered content and making it available to the target visitors.\n\nCommunication\nEmail is an important communications service available on the Internet. The concept of sending electronic text messages between parties in a way analogous to mailing letters or memos predates the creation of the Internet. Pictures, documents, and other files are sent as email attachments. Emails can be cc-ed to multiple email addresses.\n\nInternet telephony is another common communications service made possible by the creation of the Internet. VoIP stands for Voice-over-Internet Protocol, referring to the protocol that underlies all Internet communication. The idea began in the early 1990s with walkie-talkie-like voice applications for personal computers. In recent years many VoIP systems have become as easy to use and as convenient as a normal telephone. The benefit is that, as the Internet carries the voice traffic, VoIP can be free or cost much less than a traditional telephone call, especially over long distances and especially for those with always-on Internet connections such as cable or ADSL. VoIP is maturing into a competitive alternative to traditional telephone service. Interoperability between different providers has improved and the ability to call or receive a call from a traditional telephone is available. Simple, inexpensive VoIP network adapters are available that eliminate the need for a personal computer.\n\nVoice quality can still vary from call to call, but is often equal to and can even exceed that of traditional calls. Remaining problems for VoIP include emergency telephone number dialing and reliability. Currently, a few VoIP providers provide an emergency service, but it is not universally available. Older traditional phones with no \"extra features\" may be line-powered only and operate during a power failure; VoIP can never do so without a backup power source for the phone equipment and the Internet access devices. VoIP has also become increasingly popular for gaming applications, as a form of communication between players. Popular VoIP clients for gaming include Ventrilo and Teamspeak. Modern video game consoles also offer VoIP chat features.\n\nData transfer\nFile sharing is an example of transferring large amounts of data across the Internet. A computer file can be emailed to customers, colleagues and friends as an attachment. It can be uploaded to a website or File Transfer Protocol (FTP) server for easy download by others. It can be put into a \"shared location\" or onto a file server for instant use by colleagues. The load of bulk downloads to many users can be eased by the use of \"mirror\" servers or peer-to-peer networks. In any of these cases, access to the file may be controlled by user authentication, the transit of the file over the Internet may be obscured by encryption, and money may change hands for access to the file. The price can be paid by the remote charging of funds from, for example, a credit card whose details are also passed – usually fully encrypted – across the Internet. The origin and authenticity of the file received may be checked by digital signatures or by MD5 or other message digests. These simple features of the Internet, over a worldwide basis, are changing the production, sale, and distribution of anything that can be reduced to a computer file for transmission. This includes all manner of print publications, software products, news, music, film, video, photography, graphics and the other arts. This in turn has caused seismic shifts in each of the existing industries that previously controlled the production and distribution of these products.\n\nStreaming media is the real-time delivery of digital media for the immediate consumption or enjoyment by end users. Many radio and television broadcasters provide Internet feeds of their live audio and video productions. They may also allow time-shift viewing or listening such as Preview, Classic Clips and Listen Again features. These providers have been joined by a range of pure Internet \"broadcasters\" who never had on-air licenses. This means that an Internet-connected device, such as a computer or something more specific, can be used to access on-line media in much the same way as was previously possible only with a television or radio receiver. The range of available types of content is much wider, from specialized technical webcasts to on-demand popular multimedia services. Podcasting is a variation on this theme, where – usually audio – material is downloaded and played back on a computer or shifted to a portable media player to be listened to on the move. These techniques using simple equipment allow anybody, with little censorship or licensing control, to broadcast audio-visual material worldwide.\n\nDigital media streaming increases the demand for network bandwidth. For example, standard image quality needs 1 Mbit/s link speed for SD 480p, HD 720p quality requires 2.5 Mbit/s, and the top-of-the-line HDX quality needs 4.5 Mbit/s for 1080p.[67]\n\nWebcams are a low-cost extension of this phenomenon. While some webcams can give full-frame-rate video, the picture either is usually small or updates slowly. Internet users can watch animals around an African waterhole, ships in the Panama Canal, traffic at a local roundabout or monitor their own premises, live and in real time. Video chat rooms and video conferencing are also popular with many uses being found for personal webcams, with and without two-way sound. YouTube was founded on 15 February 2005 and is now the leading website for free streaming video with a vast number of users. It uses a flash-based web player to stream and show video files. Registered users may upload an unlimited amount of video and build their own personal profile. YouTube claims that its users watch hundreds of millions, and upload hundreds of thousands of videos daily. Currently, YouTube also uses an HTML5 player.[68]\n\nSocial impact\nThe Internet has enabled new forms of social interaction, activities, and social associations. This phenomenon has given rise to the scholarly study of the sociology of the Internet.\n\nUsers\nSee also: Global Internet usage and English on the Internet\n\nInternet users per 100 inhabitants\nSource: International Telecommunications Union.[69][70]\n\nInternet users by language[71]\n\nWebsite content languages[72]\nInternet usage has seen tremendous growth. From 2000 to 2009, the number of Internet users globally rose from 394 million to 1.858 billion.[73] By 2010, 22 percent of the world's population had access to computers with 1 billion Google searches every day, 300 million Internet users reading blogs, and 2 billion videos viewed daily on YouTube.[74] In 2014 the world's Internet users surpassed 3 billion or 43.6 percent of world population, but two-thirds of the users came from richest countries, with 78.0 percent of Europe countries population using the Internet, followed by 57.4 percent of the Americas.[75]\n\nThe prevalent language for communication on the Internet has been English. This may be a result of the origin of the Internet, as well as the language's role as a lingua franca. Early computer systems were limited to the characters in the American Standard Code for Information Interchange (ASCII), a subset of the Latin alphabet.\n\nAfter English (27%), the most requested languages on the World Wide Web are Chinese (25%), Spanish (8%), Japanese (5%), Portuguese and German (4% each), Arabic, French and Russian (3% each), and Korean (2%).[71] By region, 42% of the world's Internet users are based in Asia, 24% in Europe, 14% in North America, 10% in Latin America and the Caribbean taken together, 6% in Africa, 3% in the Middle East and 1% in Australia/Oceania.[76] The Internet's technologies have developed enough in recent years, especially in the use of Unicode, that good facilities are available for development and communication in the world's widely used languages. However, some glitches such as mojibake (incorrect display of some languages' characters) still remain.\n\nIn an American study in 2005, the percentage of men using the Internet was very slightly ahead of the percentage of women, although this difference reversed in those under 30. Men logged on more often, spent more time online, and were more likely to be broadband users, whereas women tended to make more use of opportunities to communicate (such as email). Men were more likely to use the Internet to pay bills, participate in auctions, and for recreation such as downloading music and videos. Men and women were equally likely to use the Internet for shopping and banking.[77] More recent studies indicate that in 2008, women significantly outnumbered men on most social networking sites, such as Facebook and Myspace, although the ratios varied with age.[78] In addition, women watched more streaming content, whereas men downloaded more.[79] In terms of blogs, men were more likely to blog in the first place; among those who blog, men were more likely to have a professional blog, whereas women were more likely to have a personal blog.[80]\n\nAccording to forecasts by Euromonitor International, 44% of the world's population will be users of the Internet by 2020.[81] Splitting by country, in 2012 Iceland, Norway, Sweden, the Netherlands, and Denmark had the highest Internet penetration by the number of users, with 93% or more of the population with access.[82]\n\nSeveral neologisms exist that refer to Internet users: Netizen (as in as in \"citizen of the net\")[83] refers to those actively involved in improving online communities, the Internet in general or surrounding political affairs and rights such as free speech,[84][85] Internaut refers to operators or technically highly capable users of the Internet,[86][87] digital citizen refers to a person using the Internet in order to engage in society, politics, and government participation.[88]\n\nUsage\nThe Internet allows greater flexibility in working hours and location, especially with the spread of unmetered high-speed connections. The Internet can be accessed almost anywhere by numerous means, including through mobile Internet devices. Mobile phones, datacards, handheld game consoles and cellular routers allow users to connect to the Internet wirelessly. Within the limitations imposed by small screens and other limited facilities of such pocket-sized devices, the services of the Internet, including email and the web, may be available. Service providers may restrict the services offered and mobile data charges may be significantly higher than other access methods.\n\nEducational material at all levels from pre-school to post-doctoral is available from websites. Examples range from CBeebies, through school and high-school revision guides and virtual universities, to access to top-end scholarly literature through the likes of Google Scholar. For distance education, help with homework and other assignments, self-guided learning, whiling away spare time, or just looking up more detail on an interesting fact, it has never been easier for people to access educational information at any level from anywhere. The Internet in general and the World Wide Web in particular are important enablers of both formal and informal education. Further, the Internet allows universities, in particular, researchers from the social and behavioral sciences, to conduct research remotely via virtual laboratories, with profound changes in reach and generalizability of findings as well as in communication between scientists and in the publication of results.[89]\n\nThe low cost and nearly instantaneous sharing of ideas, knowledge, and skills have made collaborative work dramatically easier, with the help of collaborative software. Not only can a group cheaply communicate and share ideas but the wide reach of the Internet allows such groups more easily to form. An example of this is the free software movement, which has produced, among other things, Linux, Mozilla Firefox, and OpenOffice.org (later forked into LibreOffice). Internet chat, whether using an IRC chat room, an instant messaging system, or a social networking website, allows colleagues to stay in touch in a very convenient way while working at their computers during the day. Messages can be exchanged even more quickly and conveniently than via email. These systems may allow files to be exchanged, drawings and images to be shared, or voice and video contact between team members.\n\nContent management systems allow collaborating teams to work on shared sets of documents simultaneously without accidentally destroying each other's work. Business and project teams can share calendars as well as documents and other information. Such collaboration occurs in a wide variety of areas including scientific research, software development, conference planning, political activism and creative writing. Social and political collaboration is also becoming more widespread as both Internet access and computer literacy spread.\n\nThe Internet allows computer users to remotely access other computers and information stores easily from any access point. Access may be with computer security, i.e. authentication and encryption technologies, depending on the requirements. This is encouraging new ways of working from home, collaboration and information sharing in many industries. An accountant sitting at home can audit the books of a company based in another country, on a server situated in a third country that is remotely maintained by IT specialists in a fourth. These accounts could have been created by home-working bookkeepers, in other remote locations, based on information emailed to them from offices all over the world. Some of these things were possible before the widespread use of the Internet, but the cost of private leased lines would have made many of them infeasible in practice. An office worker away from their desk, perhaps on the other side of the world on a business trip or a holiday, can access their emails, access their data using cloud computing, or open a remote desktop session into their office PC using a secure virtual private network (VPN) connection on the Internet. This can give the worker complete access to all of their normal files and data, including email and other applications, while away from the office. It has been referred to among system administrators as the Virtual Private Nightmare,[90] because it extends the secure perimeter of a corporate network into remote locations and its employees' homes.\n\nSocial networking and entertainment\nSee also: Social networking service § Social impact\nMany people use the World Wide Web to access news, weather and sports reports, to plan and book vacations and to pursue their personal interests. People use chat, messaging and email to make and stay in touch with friends worldwide, sometimes in the same way as some previously had pen pals. Social networking websites such as Facebook, Twitter, and Myspace have created new ways to socialize and interact. Users of these sites are able to add a wide variety of information to pages, to pursue common interests, and to connect with others. It is also possible to find existing acquaintances, to allow communication among existing groups of people. Sites like LinkedIn foster commercial and business connections. YouTube and Flickr specialize in users' videos and photographs. While social networking sites were initially for individuals only, today they are widely used by businesses and other organizations to promote their brands, to market to their customers and to encourage posts to \"go viral\". \"Black hat\" social media techniques are also employed by some organizations, such as spam accounts and astroturfing.\n\nA risk for both individuals and organizations writing posts (especially public posts) on social networking websites, is that especially foolish or controversial posts occasionally lead to an unexpected and possibly large-scale backlash on social media from other Internet users. This is also a risk in relation to controversial offline behavior, if it is widely made known. The nature of this backlash can range widely from counter-arguments and public mockery, through insults and hate speech, to, in extreme cases, rape and death threats. The online disinhibition effect describes the tendency of many individuals to behave more stridently or offensively online than they would in person. A significant number of feminist women have been the target of various forms of harassment in response to posts they have made on social media, and Twitter in particular has been criticised in the past for not doing enough to aid victims of online abuse.[91]\n\nFor organizations, such a backlash can cause overall brand damage, especially if reported by the media. However, this is not always the case, as any brand damage in the eyes of people with an opposing opinion to that presented by the organization could sometimes be outweighed by strengthening the brand in the eyes of others. Furthermore, if an organization or individual gives in to demands that others perceive as wrong-headed, that can then provoke a counter-backlash.\n\nSome websites, such as Reddit, have rules forbidding the posting of personal information of individuals (also known as doxxing), due to concerns about such postings leading to mobs of large numbers of Internet users directing harassment at the specific individuals thereby identified. In particular, the Reddit rule forbidding the posting of personal information is widely understood to imply that all identifying photos and names must be censored in Facebook screenshots posted to Reddit. However, the interpretation of this rule in relation to public Twitter posts is less clear, and in any case, like-minded people online have many other ways they can use to direct each other's attention to public social media posts they disagree with.\n\nChildren also face dangers online such as cyberbullying and approaches by sexual predators, who sometimes pose as children themselves. Children may also encounter material which they may find upsetting, or material which their parents consider to be not age-appropriate. Due to naivety, they may also post personal information about themselves online, which could put them or their families at risk unless warned not to do so. Many parents choose to enable Internet filtering, and/or supervise their children's online activities, in an attempt to protect their children from inappropriate material on the Internet. The most popular social networking websites, such as Facebook and Twitter, commonly forbid users under the age of 13. However, these policies are typically trivial to circumvent by registering an account with a false birth date, and a significant number of children aged under 13 join such sites anyway. Social networking sites for younger children, which claim to provide better levels of protection for children, also exist.[92]\n\nThe Internet has been a major outlet for leisure activity since its inception, with entertaining social experiments such as MUDs and MOOs being conducted on university servers, and humor-related Usenet groups receiving much traffic.[citation needed] Many Internet forums have sections devoted to games and funny videos.[citation needed] The Internet pornography and online gambling industries have taken advantage of the World Wide Web, and often provide a significant source of advertising revenue for other websites.[93] Although many governments have attempted to restrict both industries' use of the Internet, in general, this has failed to stop their widespread popularity.[94]\n\nAnother area of leisure activity on the Internet is multiplayer gaming.[95] This form of recreation creates communities, where people of all ages and origins enjoy the fast-paced world of multiplayer games. These range from MMORPG to first-person shooters, from role-playing video games to online gambling. While online gaming has been around since the 1970s, modern modes of online gaming began with subscription services such as GameSpy and MPlayer.[96] Non-subscribers were limited to certain types of game play or certain games. Many people use the Internet to access and download music, movies and other works for their enjoyment and relaxation. Free and fee-based services exist for all of these activities, using centralized servers and distributed peer-to-peer technologies. Some of these sources exercise more care with respect to the original artists' copyrights than others.\n\nInternet usage has been correlated to users' loneliness.[97] Lonely people tend to use the Internet as an outlet for their feelings and to share their stories with others, such as in the \"I am lonely will anyone speak to me\" thread.\n\nCybersectarianism is a new organizational form which involves: \"highly dispersed small groups of practitioners that may remain largely anonymous within the larger social context and operate in relative secrecy, while still linked remotely to a larger network of believers who share a set of practices and texts, and often a common devotion to a particular leader. Overseas supporters provide funding and support; domestic practitioners distribute tracts, participate in acts of resistance, and share information on the internal situation with outsiders. Collectively, members and practitioners of such sects construct viable virtual communities of faith, exchanging personal testimonies and engaging in the collective study via email, on-line chat rooms, and web-based message boards.\"[98] In particular, the British government has raised concerns about the prospect of young British Muslims being indoctrinated into Islamic extremism by material on the Internet, being persuaded to join terrorist groups such as the so-called \"Islamic State\", and then potentially committing acts of terrorism on returning to Britain after fighting in Syria or Iraq.\n\nCyberslacking can become a drain on corporate resources; the average UK employee spent 57 minutes a day surfing the Web while at work, according to a 2003 study by Peninsula Business Services.[99] Internet addiction disorder is excessive computer use that interferes with daily life. Nicholas G. Carr believes that Internet use has other effects on individuals, for instance improving skills of scan-reading and interfering with the deep thinking that leads to true creativity.[100]\n\nElectronic business\nElectronic business (e-business) encompasses business processes spanning the entire value chain: purchasing, supply chain management, marketing, sales, customer service, and business relationship. E-commerce seeks to add revenue streams using the Internet to build and enhance relationships with clients and partners. According to International Data Corporation, the size of worldwide e-commerce, when global business-to-business and -consumer transactions are combined, equate to $16 trillion for 2013. A report by Oxford Economics adds those two together to estimate the total size of the digital economy at $20.4 trillion, equivalent to roughly 13.8% of global sales.[101]\n\nWhile much has been written of the economic advantages of Internet-enabled commerce, there is also evidence that some aspects of the Internet such as maps and location-aware services may serve to reinforce economic inequality and the digital divide.[102] Electronic commerce may be responsible for consolidation and the decline of mom-and-pop, brick and mortar businesses resulting in increases in income inequality.[103][104][105]\n\nAuthor Andrew Keen, a long-time critic of the social transformations caused by the Internet, has recently focused on the economic effects of consolidation from Internet businesses. Keen cites a 2013 Institute for Local Self-Reliance report saying brick-and-mortar retailers employ 47 people for every $10 million in sales while Amazon employs only 14. Similarly, the 700-employee room rental start-up Airbnb was valued at $10 billion in 2014, about half as much as Hilton Hotels, which employs 152,000 people. And car-sharing Internet startup Uber employs 1,000 full-time employees and is valued at $18.2 billion, about the same valuation as Avis and Hertz combined, which together employ almost 60,000 people.[106]\n\nTelecommuting\nTelecommuting is the performance within a traditional worker and employer relationship when it is facilitated by tools such as groupware, virtual private networks, conference calling, videoconferencing, and voice over IP (VOIP) so that work may be performed from any location, most conveniently the worker's home. It can be efficient and useful for companies as it allows workers to communicate over long distances, saving significant amounts of travel time and cost. As broadband Internet connections become commonplace, more workers have adequate bandwidth at home to use these tools to link their home to their corporate intranet and internal communication networks.\n\nCrowdsourcing\nThe Internet provides a particularly good venue for crowdsourcing, because individuals tend to be more open in web-based projects where they are not being physically judged or scrutinized and thus can feel more comfortable sharing.[citation needed]\n\nCollaborative publishing\nWikis have also been used in the academic community for sharing and dissemination of information across institutional and international boundaries.[107] In those settings, they have been found useful for collaboration on grant writing, strategic planning, departmental documentation, and committee work.[108] The United States Patent and Trademark Office uses a wiki to allow the public to collaborate on finding prior art relevant to examination of pending patent applications. Queens, New York has used a wiki to allow citizens to collaborate on the design and planning of a local park.[109] The English Wikipedia has the largest user base among wikis on the World Wide Web[110] and ranks in the top 10 among all Web sites in terms of traffic.[111]\n\nPolitics and political revolutions\nSee also: Internet censorship, Culture of fear, and Mass surveillance\n\nBanner in Bangkok during the 2014 Thai coup d'état, informing the Thai public that 'like' or 'share' activities on social media could result in imprisonment (observed June 30, 2014).\nThe Internet has achieved new relevance as a political tool. The presidential campaign of Howard Dean in 2004 in the United States was notable for its success in soliciting donation via the Internet. Many political groups use the Internet to achieve a new method of organizing for carrying out their mission, having given rise to Internet activism, most notably practiced by rebels in the Arab Spring.[112][113] The New York Times suggested that social media websites, such as Facebook and Twitter, helped people organize the political revolutions in Egypt, by helping activists organize protests, communicate grievances, and disseminate information.[114]\n\nThe potential of the Internet as a civic tool of communicative power was explored by Simon R. B. Berdal in his 2004 thesis:\n\nAs the globally evolving Internet provides ever new access points to virtual discourse forums, it also promotes new civic relations and associations within which communicative power may flow and accumulate. Thus, traditionally … national-embedded peripheries get entangled into greater, international peripheries, with stronger combined powers... The Internet, as a consequence, changes the topology of the \"centre-periphery\" model, by stimulating conventional peripheries to interlink into \"super-periphery\" structures, which enclose and \"besiege\" several centres at once.[115]\n\nBerdal, therefore, extends the Habermasian notion of the public sphere to the Internet, and underlines the inherent global and civic nature that interwoven Internet technologies provide. To limit the growing civic potential of the Internet, Berdal also notes how \"self-protective measures\" are put in place by those threatened by it:\n\nIf we consider China’s attempts to filter \"unsuitable material\" from the Internet, most of us would agree that this resembles a self-protective measure by the system against the growing civic potentials of the Internet. Nevertheless, both types represent limitations to \"peripheral capacities\". Thus, the Chinese government tries to prevent communicative power to build up and unleash (as the 1989 Tiananmen Square uprising suggests, the government may find it wise to install \"upstream measures\"). Even though limited, the Internet is proving to be an empowering tool also to the Chinese periphery: Analysts believe that Internet petitions have influenced policy implementation in favour of the public’s online-articulated will …[115]\n\nIncidents of politically motivated Internet censorship have now been recorded in many countries, including western democracies.\n\nPhilanthropy\nThe spread of low-cost Internet access in developing countries has opened up new possibilities for peer-to-peer charities, which allow individuals to contribute small amounts to charitable projects for other individuals. Websites, such as DonorsChoose and GlobalGiving, allow small-scale donors to direct funds to individual projects of their choice. A popular twist on Internet-based philanthropy is the use of peer-to-peer lending for charitable purposes. Kiva pioneered this concept in 2005, offering the first web-based service to publish individual loan profiles for funding. Kiva raises funds for local intermediary microfinance organizations which post stories and updates on behalf of the borrowers. Lenders can contribute as little as $25 to loans of their choice, and receive their money back as borrowers repay. Kiva falls short of being a pure peer-to-peer charity, in that loans are disbursed before being funded by lenders and borrowers do not communicate with lenders themselves.[116][117]\n\nHowever, the recent spread of low-cost Internet access in developing countries has made genuine international person-to-person philanthropy increasingly feasible. In 2009, the US-based nonprofit Zidisha tapped into this trend to offer the first person-to-person microfinance platform to link lenders and borrowers across international borders without intermediaries. Members can fund loans for as little as a dollar, which the borrowers then use to develop business activities that improve their families' incomes while repaying loans to the members with interest. Borrowers access the Internet via public cybercafes, donated laptops in village schools, and even smart phones, then create their own profile pages through which they share photos and information about themselves and their businesses. As they repay their loans, borrowers continue to share updates and dialogue with lenders via their profile pages. This direct web-based connection allows members themselves to take on many of the communication and recording tasks traditionally performed by local organizations, bypassing geographic barriers and dramatically reducing the cost of microfinance services to the entrepreneurs.[118]\n\nSecurity\nMain article: Internet security\nInternet resources, hardware, and software components are the target of criminal or malicious attempts to gain unauthorized control to cause interruptions, commit fraud, engage in blackmail or access private information.\n\nMalware\nMain article: Malware\nMalicious software used and spread on the Internet includes computer viruses which copy with the help of humans, computer worms which copy themselves automatically, software for denial of service attacks, ransomware, botnets, and spyware that reports on the activity and typing of users. Usually, these activities constitute cybercrime. Defense theorists have also speculated about the possibilities of cyber warfare using similar methods on a large scale.[citation needed]\n\nSurveillance\nMain article: Computer and network surveillance\nSee also: Signals intelligence and Mass surveillance\nThe vast majority of computer surveillance involves the monitoring of data and traffic on the Internet.[119] In the United States for example, under the Communications Assistance For Law Enforcement Act, all phone calls and broadband Internet traffic (emails, web traffic, instant messaging, etc.) are required to be available for unimpeded real-time monitoring by Federal law enforcement agencies.[120][121][122] Packet capture is the monitoring of data traffic on a computer network. Computers communicate over the Internet by breaking up messages (emails, images, videos, web pages, files, etc.) into small chunks called \"packets\", which are routed through a network of computers, until they reach their destination, where they are assembled back into a complete \"message\" again. Packet Capture Appliance intercepts these packets as they are traveling through the network, in order to examine their contents using other programs. A packet capture is an information gathering tool, but not an analysis tool. That is it gathers \"messages\" but it does not analyze them and figure out what they mean. Other programs are needed to perform traffic analysis and sift through intercepted data looking for important/useful information. Under the Communications Assistance For Law Enforcement Act all U.S. telecommunications providers are required to install packet sniffing technology to allow Federal law enforcement and intelligence agencies to intercept all of their customers' broadband Internet and voice over Internet protocol (VoIP) traffic.[123]\n\nThe large amount of data gathered from packet capturing requires surveillance software that filters and reports relevant information, such as the use of certain words or phrases, the access of certain types of web sites, or communicating via email or chat with certain parties.[124] Agencies, such as the Information Awareness Office, NSA, GCHQ and the FBI, spend billions of dollars per year to develop, purchase, implement, and operate systems for interception and analysis of data.[125] Similar systems are operated by Iranian secret police to identify and suppress dissidents. The required hardware and software was allegedly installed by German Siemens AG and Finnish Nokia.[126]\n\nCensorship\n\nInternet censorship and surveillance by country[127][128][129][130]\n  Pervasive\n  Substantial\n  Selective\n  Changing situation\n  Little or none\n  Not classified or no data\nMain articles: Internet censorship and Internet freedom\nSee also: Culture of fear\nSome governments, such as those of Burma, Iran, North Korea, the Mainland China, Saudi Arabia and the United Arab Emirates restrict access to content on the Internet within their territories, especially to political and religious content, with domain name and keyword filters.[131]\n\nIn Norway, Denmark, Finland, and Sweden, major Internet service providers have voluntarily agreed to restrict access to sites listed by authorities. While this list of forbidden resources is supposed to contain only known child pornography sites, the content of the list is secret.[132] Many countries, including the United States, have enacted laws against the possession or distribution of certain material, such as child pornography, via the Internet, but do not mandate filter software. Many free or commercially available software programs, called content-control software are available to users to block offensive websites on individual computers or networks, in order to limit access by children to pornographic material or depiction of violence.\n\nPerformance\n[icon]\tThis section needs expansion. You can help by adding to it. (July 2014)\nAs the Internet is a heterogeneous network, the physical characteristics, including for example the data transfer rates of connections, vary widely. It exhibits emergent phenomena that depend on its large-scale organization.[citation needed]\n\nOutages\nAn Internet blackout or outage can be caused by local signalling interruptions. Disruptions of submarine communications cables may cause blackouts or slowdowns to large areas, such as in the 2008 submarine cable disruption. Less-developed countries are more vulnerable due to a small number of high-capacity links. Land cables are also vulnerable, as in 2011 when a woman digging for scrap metal severed most connectivity for the nation of Armenia.[133] Internet blackouts affecting almost entire countries can be achieved by governments as a form of Internet censorship, as in the blockage of the Internet in Egypt, whereby approximately 93%[134] of networks were without access in 2011 in an attempt to stop mobilization for anti-government protests.[135]\n\nEnergy use\nIn 2011, researchers estimated the energy used by the Internet to be between 170 and 307 GW, less than two percent of the energy used by humanity. This estimate included the energy needed to build, operate, and periodically replace the estimated 750 million laptops, a billion smart phones and 100 million servers worldwide as well as the energy that routers, cell towers, optical switches, Wi-Fi transmitters and cloud storage devices use when transmitting Internet traffic.[136][137]",
			"date_added": 1497705398793,
			"slug": "internet"
		},
		{
			"id": "13f2d790-535f-11e7-bb5a-4d48d9ff1cce",
			"body": "A torrent is a fast flowing stream.\n\n",
			"date_added": 1497705347977,
			"slug": "torrent"
		},
		{
			"id": "f66cdbd0-535e-11e7-a3a7-f37926fc5994",
			"body": "Mozilla Firefox (or simply Firefox) is a free and open-source[19] web browser developed by the Mozilla Foundation and its subsidiary the Mozilla Corporation. Firefox is available for Windows, macOS and Linux operating systems, with its Firefox for Android available for Android (formerly Firefox for mobile, it also ran on the discontinued Firefox OS), and uses the Gecko layout engine to render web pages, which implements current and anticipated web standards.[20] An additional version, Firefox for iOS, was released in late 2015, but this version does not use Gecko due to Apple's restrictions limiting third-party web browsers to the WebKit-based layout engine built into iOS.\n\nFirefox was created in 2002 under the name \"Phoenix\" by Mozilla community members who desired a standalone browser, rather than the Mozilla Application Suite bundle. Even during its beta phase, Firefox proved to be popular with its testers and was praised for its speed, security, and add-ons compared to Microsoft's then-dominant Internet Explorer 6. Firefox was released in November 2004,[21] and was highly successful with 60 million downloads within nine months, which was the first time that Internet Explorer's dominance was challenged.[22] Firefox is considered the spiritual successor of Netscape Navigator, as the Mozilla community was created by Netscape in 1998 before their acquisition by AOL.[23]\n\nFirefox usage grew to a peak of 32% at the end of 2009,[24] temporarily making version 3.5 the world's most popular browser.[25][26] Usage then declined in competition with Google Chrome.[24] As of January 2016, Firefox has between 9% and 16% of worldwide usage as a \"desktop\" browser, making it the second most popular web browser.[27][28][29][30] Firefox is still the most popular desktop browser in Cuba (even most popular overall), Eritrea, and Germany, with 85.93%,[31] 79.39%,[32][33] and 37.01%[34] of the market share, respectively. It is also the most popular desktop browser in many other African countries.[35] According to Mozilla, as of December 2014 there were half a billion Firefox users around the world.[36]\n\nHistory[edit]\nMain article: History of Firefox\nThe Firefox project began as an experimental branch of the Mozilla project by Dave Hyatt, Joe Hewitt, and Blake Ross. They believed the commercial requirements of Netscape's sponsorship and developer-driven feature creep compromised the utility of the Mozilla browser.[37] To combat what they saw as the Mozilla Suite's software bloat, they created a stand-alone browser, with which they intended to replace the Mozilla Suite.[38] On April 3, 2003, the Mozilla Organization announced that they planned to change their focus from the Mozilla Suite to Firefox and Thunderbird.[39] The community-driven SeaMonkey was formed and eventually replaced the Mozilla Application Suite in 2005.\n\n\nPhoenix 0.1 screenshot on Windows XP\nThe Firefox project has undergone several name changes. It was originally titled Phoenix, which carried the implication of the mythical firebird that rose triumphantly from the ashes of its dead predecessor, in this case from the \"ashes\" of Netscape Navigator after it had been killed off by Microsoft Internet Explorer in the \"First browser war\". Phoenix was renamed due to trademark issues with Phoenix Technologies; the replacement name, Firebird, provoked an intense response from the Firebird database software project.[40][41] In response, the Mozilla Foundation stated that the browser would always bear the name Mozilla Firebird to avoid confusion. After further pressure, on February 9, 2004, Mozilla Firebird became Mozilla Firefox.[42] The name Firefox was said to be derived from a nickname of the red panda,[43][44] which became the mascot for the newly named project. For the abbreviation of Firefox, Mozilla prefers Fx or fx, though it is often abbreviated as FF.[45]\n\nThe Firefox project went through many versions before the version 1.0 was released on November 9, 2004.\n\nFeatures[edit]\nMain article: Features of Firefox\nFeatures include tabbed browsing, spell checking, incremental find, live bookmarking, Smart Bookmarks, a download manager, private browsing, location-aware browsing (also known as \"geolocation\") based on a Google service,[46] and an integrated search system that uses Yahoo! Search, which is a front end of Microsoft search engine Bing, by default in most localizations.[47] Additionally, Firefox provides an environment for web developers in which they can use built-in tools, such as the Error Console or the DOM Inspector, or extensions, such as Firebug and more recently there has been an integration feature with Pocket. Firefox Hello was an implementation of WebRTC, added in October 2014, which allows users of Firefox and other compatible systems to have a video call, with the extra feature of screen and file sharing by sending a link to each other. Firefox Hello is scheduled to be removed in September 2016.[48]\n\nFunctions can be added through add-ons created by third-party developers. Add-ons are primarily implemented by means of the XUL and XPCOM APIs, which allow them to directly access and manipulate much of the browser's internal functionality. On August 21, 2015, Firefox developers announced that due to planned changes to Firefox's internal operations, including the planned implementation of a new multi-process architecture codenamed \"Electrolysis\" (\"E10s\", introduced to some users in version 48), Firefox adopted a new extension architecture known as WebExtensions, available to desktop version and Firefox for Android (considered stable in version 48). WebExtensions uses HTML and JavaScript APIs and is designed to be similar to the Google Chrome[49] and Microsoft Edge extension systems, and run within a multi-process environment, but does not enable the same level of access to the browser. Solutions will be available to allow older add-ons to operate within the new architecture, but by 2017, XPCOM and XUL add-ons will no longer be supported.[50]\n\nFirefox can have themes added to it, so users can experience Firefox in a more personal way. There are websites where users can create and download personalized themes, with their choice of colors and images. This can make the experience of using Firefox more fun compared to other web browsers that do not offer custom-built themes. However, Mozilla has announced its intention to discontinue Firefox themes.[51] The Firefox add-on website also gives users the ability to add other applications such as games, ad-blockers, screenshot apps, and many other useful apps.[50][52]\n\nStandards[edit]\n\nThe result of the Acid3 test on Firefox 17\nFirefox implements many web standards, including HTML4 (almost full HTML5), XML, XHTML, MathML, SVG 2 (partial),[53][54] CSS (with extensions),[55] ECMAScript (JavaScript), DOM, XSLT, XPath, and APNG (Animated PNG) images with alpha transparency.[56] Firefox also implements standards proposals created by the WHATWG such as client-side storage,[57][58] and canvas element.[59] These standards are implemented through the Gecko layout engine, and Spidermonkey JavaScript engine.\n\nFirefox has passed the Acid2 standards-compliance test since version 3.0.[60] Mozilla had originally stated that they did not intend for Firefox to pass the Acid3 test fully because they believed that the SVG fonts part of the test had become outdated and irrelevant, due to WOFF being agreed upon as a standard by all major browser makers.[61] Because the SVG font tests were removed from the Acid3 test in September 2011, Firefox 4 and greater scored 100/100.[62][63]\n\nFirefox also implements[64] a proprietary protocol[65] from Google called \"Safe Browsing\", used to exchange data related with phishing and malware protection.\n\nSince version 38 on Windows Vista and newer, Firefox supports the playback of video content protected by HTML5 Encrypted Media Extensions (EME). For security and privacy reasons[which?], EME is implemented within a wrapper of open source code that allows execution of a proprietary DRM module by Adobe Systems – Adobe Primetime Content Decryption Module (CDM). CDM runs within a \"sandbox\" environment to limit its access to the system, and provide it a randomized device ID to prevent services from uniquely identifying the device for tracking purposes. The DRM module, once it has been downloaded, is enabled and disabled in the same manner as other plug-ins. Since version 47,[66] \"Google's Widevine CDM on Windows and Mac OS X so streaming services like Amazon Video can switch from Silverlight to encrypted HTML5 video\" is also supported.\n\nFirefox downloads and enables the Adobe Primetime and Google Widevine CDMs by default to give users a smooth experience on sites that require DRM. Each CDM runs in a separate container called a sandbox and you will be notified when a CDM is in use. You can also disable each CDM and opt out of future updates\n\n— Watch DRM content on Firefox[67]\nand that it is \"an important step on Mozilla's roadmap to remove NPAPI plugin support. \"[68] Upon the introduction of EME support, builds of Firefox on Windows were also introduced that exclude support for EME.[69][70]\n\nSecurity[edit]\nSee also: Browser security\nFirefox allowed for a sandbox security model to manage privileges accorded to JavaScript code, but that feature has since been deprecated.[71] It limits scripts from accessing data from other websites based on the same-origin policy.[72] It also provides support for smart cards to web applications, for authentication purposes.[73] It uses SSL/TLS to protect communications with web servers using strong cryptography when using the HTTPS protocol.[74] The freely available HTTPS Everywhere add-on enforces HTTPS, even if a regular HTTP URL is entered. Firefox now supports HTTP/2.[75]\n\nThe Mozilla Foundation offers a \"bug bounty\" (US$3,000 to US$7,500 cash reward) to researchers who discover severe security holes in Firefox.[76] Official guidelines for handling security vulnerabilities discourage early disclosure of vulnerabilities so as not to give potential attackers an advantage in creating exploits.[77]\n\nBecause Firefox generally has fewer publicly known security vulnerabilities than Internet Explorer (see Comparison of web browsers), improved security is often cited as a reason to switch from Internet Explorer to Firefox.[78][79][80][81] The Washington Post reported that exploit code for known critical security vulnerabilities in Internet Explorer was available for 284 days in 2006. In comparison, exploit code for known, critical security vulnerabilities in Firefox was available for nine days before Mozilla issued a patch to remedy the problem.[82]\n\nA 2006 Symantec study showed that, although Firefox had surpassed other browsers in the number of vendor-confirmed vulnerabilities that year through September, these vulnerabilities were patched far more quickly than those found in other browsers – Firefox's vulnerabilities were fixed on average one day after the exploit code was made available, as compared to nine days for Internet Explorer.[83] Symantec later clarified their statement, saying that Firefox still had fewer security vulnerabilities than Internet Explorer, as counted by security researchers.[84]\n\nIn 2010 a study of the National Institute of Standards and Technology (NIST), based on data compiled from the National Vulnerability Database (NVD), Firefox was listed as the fifth most vulnerable desktop software, with Internet Explorer as the eighth, and Google Chrome as the first.[85]\n\nInfoWorld has cited security experts saying that, as Firefox becomes more popular, more vulnerabilities will be found,[86] a claim that Mitchell Baker, president of the Mozilla Foundation, has denied. \"There is this idea that market share alone will make you have more vulnerabilities. It is not relational at all,\" she said.[87]\n\nIn October 2009, Microsoft's security engineers acknowledged that Firefox was vulnerable to a security issue found in the 'Windows Presentation Foundation' browser plug-in since February of that year. A .NET Framework 3.5 SP1 Windows Update had silently installed the vulnerable plug-in into Firefox.[88] This vulnerability has since been patched by Microsoft.[89]\n\nAs of February 11, 2011, Firefox 3.6 had no known unpatched security vulnerabilities according to Secunia.[90] Internet Explorer 8 had five unpatched security vulnerabilities, the worst being rated \"Less Critical\" by Secunia.[91] Mozilla claims that all patched vulnerabilities of Mozilla products are publicly listed.[92]\n\nOn January 28, 2013, Mozilla was recognized as the most trusted internet company for privacy in 2012.[93] This study was performed by the Ponemon Institute and was a result of a survey from more than 100,000 consumers in the United States.\n\nIn February 2013, plans were announced for Firefox 22 to disable third-party cookies by default. However, the introduction of the feature was then delayed so Mozilla developers could \"collect and analyze data on the effect of blocking some third-party cookies.\" Mozilla also collaborated with Stanford University's \"Cookie Clearinghouse\" project to develop a blacklist and whitelist of sites that will be used in the filter.[94][95]\n\nVersion 23, released in August 2013, followed the lead of its competitors by blocking iframe, stylesheet, and script resources served from non-HTTPS servers embedded on HTTPS pages by default. Additionally, JavaScript could also no longer be disabled through Firefox's preferences, and JavaScript was automatically re-enabled for users who upgraded to 23 or higher with it disabled. The change was made due to its use across the majority of websites, the potential repercussions on non-experienced users who are unaware of its impact, along with the availability of extensions such as NoScript, which can disable JavaScript in a more controlled fashion. The following release added the ability to disable JavaScript through the developer tools for testing purposes.[96][97][98]\n\nIn January 2015, TorrentFreak reported that using Firefox when connected to the internet using a VPN can be a serious security issue due to the browser's support for WebRTC.[99]\n\nBeginning with Firefox 44 (2016), all extensions must be signed by Mozilla to be used in release and beta versions of Firefox. Firefox 43 blocked unsigned extensions, but allowed enforcement of extension signing to be disabled. All extensions must be submitted to Mozilla Add-ons and be subject to code analysis in order to be signed, although extensions do not have to be listed on the service in order to be signed.[100][101]\n\nIn Firefox versions prior to 7.0, an information bar appears on the browser's first start asking users whether they would like to send performance statistics, or \"telemetry\", to Mozilla. It is enabled by default in development versions of Firefox, but not in release versions.[102] According to Mozilla's privacy policy,[103] these statistics are stored only in aggregate format, and the only personally identifiable information transmitted is the user's IP address.\n\nAs of 2016, Firefox is the last widely used browser not to use a browser sandbox to isolate Web content in each tab from each other and from the rest of the system.[104] Version 50 includes a limited sandbox that isolates the content rendering process (separated thanks to the Electrolysis project), which will be progressively enhanced to improve security.[104]\n\nLocalizations[edit]\nMain article: Mozilla localizations\nFirefox is a widely localized web browser. The first official release in November 2004 was available in 24 different languages and for 28 locales, including British English, American English, European Spanish, Argentine Spanish, and Chinese in Traditional Chinese characters and Simplified Chinese characters.[105] As of June 2017, currently supported versions 54.0 and 52.2.0esr are available in 89 locales (79 languages).[16]\n\nPlatform availability[edit]\n\nIt has been suggested that this section be merged into Firefox#Version history. (Discuss) Proposed since June 2017.\nThe desktop version of Firefox is available and supported for Windows, macOS and Linux, while Firefox for Android is available for Android (formerly Firefox for mobile, it also ran on Firefox OS). In September 2013, the Windows 8 Touch interface, optimized for touchscreen use, was introduced on the \"Aurora\" release channel; however, the project has since been cancelled as of March 2014, with Mozilla citing a lack of user adoption of the beta versions.[106][107][108]\n\nOS support history[edit]\nview talk edit\nOperating system\tLatest stable version\tSupport status\nWindows\t7 and later, Server 2008 R2 and later\t54.0 (IA-32), 54.0 (x64), 52.2.0esr (IA-32) and 52.2.0esr (x64)[109]\t2009–\nXP SP2, Server 2003 SP1 and Vista\t52.2.0esr (IA-32); and 52.0.2 (IA-32) was supported[110][111]\t2004–2018\n2000, XP (RTM, SP1) and Server 2003 RTM\t10.0.12esr[112] and 12.0\t2004–2013\nNT 4, 98, 98 SE and ME\t2.0.0.20\t2004–2008\n95\t1.5.0.12\t2004–2007\nmacOS\t10.9–10.12\t54.0 and 52.2.0esr[109]\t2013–\n10.6–10.8\t45.9.0esr and 47.0.1[113][114]\t2009–2017\n10.5 (Intel)\t10.0.12esr and 16.0.2[115]\t2007–2013\n10.4–10.5 (PPC)\t3.6.28[116][117]\t2005–2012\n10.2–10.3\t2.0.0.20\t2004–2008\n10.0–10.1\t1.0.8\t2004–2006\nLinux\tDesktop\t54.0 (i686), 54.0 (x86_64),[109] 52.2.0esr (i686) and 52.2.0esr (x86_64)\t2004–\nAndroid 4.0 and newer\t54.0[118]\t2011–\nAndroid 3.0\t45.0.2[118]\t2011–2016\nAndroid 2.3\t47.0[118][119]\t2011–2016\nAndroid 2.2\t31.0[120] and 31.3.0esr\t2011–2014\nAndroid 2.1\t19.0.2\t2011–2013\nAndroid 2.0\t6.0.2\t2011\nMaemo\t7.0\t2010–2011\nMeeGo\t15.0\t2011–2014\nFirefox OS 2.2\t35/36/37\t2015\nFirefox OS 2.0\t31/32.0\t2013–2015\nLegend:Old versionOlder version, still supportedLatest version\nNotes\nFirefox for iOS is not listed in this table as its version numbers would be misleading (it uses version numbers that do not correspond to any of the other Firefox versions, as those share a core component, the Gecko rendering engine and track its version numbers while the version for the iOS operating system uses the operating system's rendering engine (WebKit), rather than Mozilla's (Gecko).\nIn March 2014, the Windows Store app version of Firefox was cancelled, although there is a beta release.[121]\nIn September 2016, the development of Firefox OS was stopped.\nSystem requirements[edit]\nFirefox source code may be compiled for various operating systems; however, officially distributed binaries are provided for the following:\n\nRequired hardware and software[109]\nRequirement\tWindows\tLinux desktop\tmacOS\tAndroid[122]\tiOS\nCPU\tPentium 4 or newer with SSE2\tAny Intel CPU\tARM[123]\n(ARMv6 was also supported[124])\tARM\nMemory (RAM)\t512 MB\t384 MB\t ?\nHard disk drive free space\t200 MB\t50 MB\t ?\nOperating system\t7 or later\nServer 2008 R2 or later[125]\nXP, Server 2003 and Vista only supported on Firefox 52 ESR[126]\n\nMinimum\nGTK+ 3.4 or newer[127]\nGLib 2.22 or newer\nPango 1.14 or newer\nlibstdc++ 4.6.1 or newer\nX.Org 1.0 or newer\nRecommended\nNetworkManager 0.7 or newer\nDBus 1.0 or newer\nGNOME 2.16 or newer\nPulseAudio\nX.Org 1.7 or newer\nOS X 10.9 or newer\t4.0 or newer[122]\t9.0 or later\nFirefox for mobile[edit]\nMain articles: Firefox for Android and Firefox for iOS\nFirefox for Android, code-named Fennec, is a web browser for smaller non-PC devices, mobile phones, and PDAs. It was originally first released for the Nokia Maemo operating system, specifically the Nokia N900, on January 28, 2010.[128] On March 29, 2011, besides Maemo, Version 4 was added for Android.[129] With the release of mobile version, the browser's version number was bumped from 2 to 4, synchronizing it with all future desktop releases of Firefox because the rendering engines used in both browsers are the same.[130] Version 7 was the last release for Maemo on the N900.[131]\n\nThe user interface is completely redesigned and optimized for small screens, the controls are hidden away so that only the web content is shown on screen, and it uses touchscreen interaction methods. It includes the Awesomebar, tabbed browsing, Add-on support, password manager, location-aware browsing, and the ability to synchronize with the user's computer Firefox browser using Firefox Sync.[132]\n\nIn April 2013, then-Mozilla-CEO Gary Kovacs said that Firefox would not come to iOS as long as Apple required the use of the WebKit layout engine to do so. One reason given by Mozilla was that prior to iOS 8, Apple had supplied third-party browsers with an inferior version of their JavaScript engine which hobbled their performance, making it impossible to match Safari's JavaScript performance on the iOS platform.[133] Apple later opened their \"Nitro\" JavaScript engine to third-party browsers.[134] In 2015, Mozilla announced it was moving forward with Firefox for iOS, with a preview release made available in New Zealand in September of that year.[135][136][137] In November 2016, Firefox released a new iOS app titled Firefox Focus, a private web browser.[138]\n\nUnofficial ports[edit]\nFirefox has also been ported to FreeBSD,[139] NetBSD,[140] OpenBSD,[141] OpenIndiana,[142] OS/2[143] and SkyOS, and an unofficial rebranded version called Timberwolf has been available for AmigaOS 4. An unofficial continuation of the macOS PowerPC release continues as TenFourFox.\n\nFirefox is also ported to Solaris and OpenSolaris by Oracle Solaris Desktop Beijing Team,[144][145] unofficial port of Firefox 3.6.x to IBM AIX[146][147] and unofficial port of v1.7.x to UnixWare.[148]\n\nFirefox 3.5.9 is the last version to work on HP-UX 11i, as packaged by Hewlett-Packard.[149]\n\nGallery[edit]\n\nFirefox 31 running on Arch Linux\n \n\nFirefox 30 on OS X Mavericks\n \n\nFirefox 42.0 on OS X El Capitan\n \n\nFirefox for Android 39 on Android\n \n\nFirefox on Firefox OS\nVersion history[edit]\nMain article: Firefox version history\nBesides official releases, Mozilla provides development builds of Firefox in distribution channels named, in order of most to least stable, \"Beta\", \"Developer Edition\" (former \"Aurora\", renamed on November 10, 2014[150][151]), and \"Nightly\". As of June 13, 2017, Firefox 55 is in the \"Beta\" and \"Developer Edition\" channel, and Firefox 56 is in the \"Nightly\" channel.[152] Starting from Firefox 54, \"Developer Edition\" will be based on the \"Beta\" build.[153]\n\nExtended Support Release[edit]\nSee also: History of Firefox § Extended Support Release, and Long-term support\nFirefox Extended Support Release, abbreviated to ESR, is a version of Firefox for organizations and other groups that need extended support for mass deployments. Each ESR release, based on the regular version released at the same time, is supported for approximately one year.[154] Unlike the regular (\"rapid\") releases, ESRs are not updated with new features and performance enhancements every six weeks, but rather are updated with only high-risk-reduction or high-impact security fixes or major stability fixes with point releases, until the end of the ESR cycle.[155]\n\nLicensing[edit]\nFirefox source code is free software, with most of it being released under the Mozilla Public License (MPL) version 2.0.[18] This license permits anyone to view, modify, or redistribute the source code. As a result, several publicly released applications have been built from it, such as Netscape, Flock, Miro, GNU IceCat, Iceweasel, Songbird, Pale Moon, and Comodo IceDragon.\n\nIn the past, Firefox was licensed solely under the MPL, then version 1.1,[156] which the Free Software Foundation criticized for being weak copyleft, as the license permitted, in limited ways, proprietary derivative works. Additionally, code only licensed under MPL 1.1 could not legally be linked with code under the GPL.[157][158] To address these concerns, Mozilla re-licensed most of Firefox under the tri-license scheme of MPL 1.1, GPL 2.0, or LGPL 2.1. Since the re-licensing, developers were free to choose the license under which they received most of the code, to suit their intended use: GPL or LGPL linking and derivative works when one of those licenses is chosen, or MPL use (including the possibility of proprietary derivative works) if they chose the MPL.[156] However, on January 3, 2012, Mozilla released the GPL-compatible MPL 2.0,[159] and with the release of Firefox 13 on June 5, 2012, Mozilla used it to replace the tri-licensing scheme.[160]\n\nThe crash reporting service was initially closed-source, but switched with version 3 from a program called Talkback to the open-source Breakpad (and Socorro server).\n\nTrademark and logo[edit]\nSee also: Mozilla Corporation software rebranded by the Debian project\nThe name \"Mozilla Firefox\" is a registered trademark; along with the official Firefox logo, it may only be used under certain terms and conditions. Anyone may redistribute the official binaries in unmodified form and use the Firefox name and branding for such distribution, but restrictions are placed on distributions which modify the underlying source code.[161] The name \"Firefox\" derives from a nickname of the red panda.[43]\n\nMozilla has placed the Firefox logo files under open-source licenses,[162][163] but its trademark guidelines do not allow displaying altered[164] or similar logos[165] in contexts where trademark law applies.\n\n\nLogo used for Iceweasel (now discontinued)\nThere has been some controversy over the Mozilla Foundation's intentions in stopping certain open source distributions from using the \"Firefox\" trademark.[19] Open source browsers \"enable greater choice and innovation in the market rather than aiming for mass-market domination.\"[166] Mozilla Foundation Chairperson Mitchell Baker explained in an interview in 2007 that distributions could freely use the Firefox trademark if they did not modify source-code, and that the Mozilla Foundation's only concern was with users getting a consistent experience when they used \"Firefox\".[167]\n\nTo allow distributions of the code without using the official branding, the Firefox build system contains a \"branding switch\". This switch, often used for alphas (\"Auroras\") of future Firefox versions, allows the code to be compiled without the official logo and name, and can allow a derivative work unencumbered by restrictions on the Firefox trademark to be produced. In the unbranded build the trademarked logo and name are replaced with a freely distributable generic globe logo and the name of the release series from which the modified version was derived.\n\nDistributing modified versions of Firefox under the \"Firefox\" name required explicit approval from Mozilla for the changes made to the underlying code, and required the use of all of the official branding. For example, it was not permissible to use the name \"Firefox\" without also using the official logo. When the Debian project decided to stop using the official Firefox logo in 2006 (because Mozilla's copyright restrictions at the time were incompatible with Debian's guidelines), they were told by a representative of the Mozilla Foundation that this was not acceptable, and were asked either to comply with the published trademark guidelines or cease using the \"Firefox\" name in their distribution.[168] Ultimately, Debian switched to branding their modified version of Firefox \"Iceweasel\" (but in 2016 switched back to Firefox), along with other Mozilla software. GNU IceCat is another derived version of Firefox distributed by the GNU Project, which maintains its own separate branding.[169]\n\nBranding and visual identity[edit]\nEarly Firebird and Phoenix releases of Firefox were considered to have reasonable visual designs, but fell short when compared to many other professional software packages. In October 2003, professional interface designer Steven Garrity wrote an article covering everything he considered to be wrong with Mozilla's visual identity.[170]\n\nShortly afterwards, the Mozilla Foundation invited Garrity to head up the new visual identity team. The release of Firefox 0.8 in February 2004 saw the introduction of the new branding efforts. Included were new icon designs by silverorange, a group of web developers with a long-standing relationship with Mozilla. The final renderings are by Jon Hicks, who had worked on Camino.[171][172] The logo was later revised and updated, fixing several flaws found when it was enlarged.[173] The animal shown in the logo is a stylized fox, although \"firefox\" is usually a common name for the red panda. The panda, according to Hicks, \"didn't really conjure up the right imagery\" and wasn't widely known.[172]\n\nThe Firefox icon is a trademark used to designate the official Mozilla build of the Firefox software and builds of official distribution partners.[174] For this reason software distributors who distribute modified versions of Firefox do not use the icon.\n\nLogo history\n\nLogo used for Firefox 1.0 – 3.0 from November 9, 2004 to June 29, 2009\n \n\nLogo used for Firefox 3.5 – 22.0 from June 30, 2009 to August 5, 2013\n \n\nLogo used for Firefox 23 and after since August 6, 2013[175]\nOther logos, used for specific versions\n\nLogo of \"Phoenix\" and \"Firebird\" before being renamed as Firefox\n \n\nThe 2011 Aurora logo, used to represent an alpha release\n \n\nThe 2011 Nightly logo, used to represent nightly builds of pre-alpha versions\n \n\nThe 2013 Aurora logo\n \n\nThe 2013 Nightly logo\n \n\nFirefox Developer Edition logo\n \n\nMinefield logo (former name for \"nightly\" Firefox)\n \n\nBlue globe artwork, distributed with the source code, and is explicitly not protected as a trademark[176]\nPromotion[edit]\n\nFirefox mascot at the FISL 16 (2015)\nFirefox was adopted rapidly, with 100 million downloads in its first year of availability.[177] This was followed by a series of aggressive marketing campaigns starting in 2004 with a series of events Blake Ross and Asa Dotzler called \"marketing weeks\".[178]\n\nFirefox continued to heavily market itself by releasing a marketing portal dubbed \"Spread Firefox\" (SFX) on September 12, 2004,[179] It debuted along with the Firefox Preview Release, creating a centralized space for the discussion of various marketing techniques. The release of their manifesto stated that “the Mozilla project is a global community of people who believe that openness, innovation and opportunity are key to the continued health of the Internet.”[166] A two-page ad in the edition of December 16 of the New York Times, placed by Mozilla Foundation in coordination with Spread Firefox, featured the names of the thousands of people worldwide who contributed to the Mozilla Foundation's fundraising campaign to support the launch of the Firefox 1.0 web browser.[180] SFX portal enhanced the \"Get Firefox\" button program, giving users \"referrer points\" as an incentive. The site lists the top 250 referrers. From time to time, the SFX team or SFX members launch marketing events organized at the Spread Firefox website. As a part of the Spread Firefox campaign, there was an attempt to break the world download record with the release of Firefox 3.[181] This resulted in an official certified Guinness world record, with over eight million downloads.[182] In February 2011, Mozilla announced that it would be retiring Spread Firefox (SFX). Three months later, in May 2011, Mozilla officially closed Spread Firefox. Mozilla wrote that \"there are currently plans to create a new iteration of this website [Spread Firefox] at a later date.\"[183]\n\nIn celebration of the third anniversary of the founding of the Mozilla Foundation, the \"World Firefox Day\" campaign was established on July 15, 2006,[184][185] and ran until September 15, 2006.[186] Participants registered themselves and a friend on the website for nomination to have their names displayed on the Firefox Friends Wall, a digital wall that will be displayed at the headquarters of the Mozilla Foundation.\n\nThe Firefox community has also engaged in the promotion of their web browser. In 2006, some of Firefox's contributors from Oregon State University made a crop circle of the Firefox logo in an oat field near Amity, Oregon, near the intersection of Lafayette Highway and Walnut Hill Road.[187] After Firefox reached 500 million downloads on February 21, 2008, the Firefox community celebrated by visiting Freerice to earn 500 million grains of rice.[188]\n\nOther initiatives include Live Chat, a service Mozilla launched in 2007 that allowed users to seek technical support from volunteers.[189] The service was later retired.[190]\n\nPerformance[edit]\nIn December 2005, Internet Week ran an article in which many readers reported high memory usage in Firefox 1.5.[191] Mozilla developers said that the higher memory use of Firefox 1.5 was at least partially due to the new fast backwards-and-forwards (FastBack) feature.[192] Other known causes of memory problems were malfunctioning extensions such as Google Toolbar and some older versions of AdBlock,[193] or plug-ins, such as older versions of Adobe Acrobat Reader.[194] When PC Magazine in 2006 compared memory usage of Firefox 2, Opera 9, and Internet Explorer 7, they found that Firefox used approximately as much memory as each of the other two browsers.[195]\n\nSoftpedia noted that Firefox 1.5 took longer to start up than other browsers,[196] which was confirmed by further speed tests.[197]\n\nIE 6 launched more swiftly than Firefox 1.5 on Windows XP since many of its components were built into the OS and loaded during system startup. As a workaround for the issue, a preloader application was created that loaded components of Firefox on startup, similar to Internet Explorer.[198] A Windows Vista feature called SuperFetch performs a similar task of preloading Firefox if it is used often enough.\n\nTests performed by PC World and Zimbra in 2006 indicated that Firefox 2 used less memory than Internet Explorer 7.[199][200] Firefox 3 used less memory than Internet Explorer 7, Opera 9.50 Beta, Safari 3.1 Beta, and Firefox 2 in tests performed by Mozilla, CyberNet, and The Browser World.[201][202][203] In mid-2009, Betanews benchmarked Firefox 3.5 and declared that it performed \"nearly ten times better on XP than Microsoft Internet Explorer 7\".[204]\n\nIn January 2010, Lifehacker compared the performance of Firefox 3.5, Firefox 3.6, Google Chrome 4 (stable and Dev versions), Safari 4, and Opera (10.1 stable and 10.5 pre-alpha versions). Lifehacker timed how long browsers took to start and reach a page (both right after boot-up and after running at least once already), timed how long browsers took to load nine tabs at once, tested JavaScript speeds using Mozilla's Dromaeo online suite (which implements Apple's SunSpider and Google's V8 tests) and measured memory usage using Windows 7's process manager. They concluded that Firefox 3.5 and 3.6 were the fifth and sixth fastest browsers respectively on startup, 3.5 was third and 3.6 was sixth fastest to load nine tabs at once, 3.5 was sixth and 3.6 was fifth fastest on the JavaScript tests. They also concluded that Firefox 3.6 was the most efficient with memory usage followed by Firefox 3.5.[205]\n\nIn February 2012, Tom's Hardware performance tested Chrome 17, Firefox 10, Internet Explorer 9, Opera 11.61, and Safari 5.1.2 on Windows 7. Tom's Hardware summarized their tests into four categories: Performance, Efficiency, Reliability, and Conformance. In the performance category they tested HTML5, Java, JavaScript, DOM, CSS 3, Flash, Silverlight, and WebGL (WebGL 2 is current as of version 51; and Java and Silverlight stop working as of version 52) – they also tested start up time and page load time. The performance tests showed that Firefox was either \"acceptable\" or \"strong\" in most categories, winning three categories (HTML5, HTML5 hardware acceleration, and Java) only finishing \"weak\" in CSS performance. In the efficiency tests, Tom's Hardware tested memory usage and management. In this category, it determined that Firefox was only \"acceptable\" at performing light memory usage, while it was \"strong\" at performing heavy memory usage. In the reliability category, Firefox performed a \"strong\" amount of proper page loads. In the final category, conformance, it was determined that Firefox had \"strong\" conformance for JavaScript and HTML5. In conclusion, Tom's Hardware determined that Firefox was the best browser for Windows 7 OS, but that it only narrowly beat Google Chrome.[206]\n\nIn June 2013, Tom's Hardware again performance tested Firefox 22, Chrome 27, Opera 12, and Internet Explorer 10. They found that Firefox slightly edged out the other browsers in their \"performance\" index, which examined wait times, JavaScript execution speed, HTML5/CSS3 rendering, and hardware acceleration performance. Firefox also scored the highest on the \"non-performance\" index, which measured memory efficiency, reliability, security, and standards conformance, finishing substantially ahead of Chrome, the runner-up. Tom's Hardware concluded by declaring Firefox the \"sound\" winner of the performance benchmarks.[207]\n\nIn January 2014, a benchmark testing the memory usage of Firefox 29, Google Chrome 34, and Internet Explorer 11 indicated that Firefox used the least memory when a substantial number of tabs were open.[208]\n\nIn benchmark testing in early 2015 on a \"high-end\" Windows machine, comparing Microsoft Edge, Internet Explorer, Firefox, Chrome, and Opera, Firefox achieved the highest score on three of the seven tests. Four different Javascript performance tests gave conflicting results. Firefox bested the others on the Peacekeeper benchmark, but was behind the Microsoft products when tested with SunSpider. Measured with Mozilla's Kraken, it came second place to Chrome, while on Google's Octane challenge it took third behind Chrome and Opera. Firefox took the lead with WebXPRT, which runs several typical HTML5 and Javascript tasks. Firefox, Chrome, and Opera all achieved the highest possible score on the Oort Online test, measuring WebGL rendering speed (WebGL 2 is now current). In terms of HTML5 compatibility testing, Firefox was ranked in the middle of the group.[209]\n\nA similar set of benchmark tests in 2016 showed Firefox's Javascript performance on Kraken and the newer Jetstream tests trailing slightly behind all other tested browsers except Internet Explorer, which performed relatively poorly. On Octane, Firefox came ahead of IE and Safari, but again slightly behind the rest, including Vivaldi and Microsoft Edge. Edge took overall first place on the Jetstream and Octane benchmarks.[210]\n\nMarket adoption[edit]\nSee also: Usage share of web browsers\n\nUsage share of web browsers according to StatCounter, showing the rise and fall of Firefox\nDownloads have continued at an increasing rate since Firefox 1.0 was released in November 2004, and as of July 31, 2009 Firefox had already been downloaded over one billion times.[211] This number does not include downloads using software updates or those from third-party websites.[212] They do not represent a user count, as one download may be installed on many machines, one person may download the software multiple times, or the software may be obtained from a third party. According to Mozilla, Firefox has more than 450 million users as of October 2012.[36][213]\n\nIn July 2010, IBM asked all employees (about 400,000) to use Firefox as their default browser.[214]\n\nFirefox was the second-most used web browser until December 2011, when Google Chrome surpassed it.[215]\n\nAs of February 2016, Firefox was the second most widely used \"desktop browser\" (and that position makes it the third most popular with approximately 10% of worldwide usage share of web browsers across all platforms[216]).",
			"date_added": 1497705298445,
			"slug": "firefox"
		},
		{
			"id": "d1936ae0-535e-11e7-9ad9-79f5d85d738a",
			"body": "Brazil (Listeni/brəˈzɪl/; Portuguese: Brasil [bɾaˈziw][11]), officially the Federative Republic of Brazil (Portuguese: República Federativa do Brasil, About this sound listen (help·info)[12]), is the largest country in both South America and Latin America, besides being the largest of the Americas by continental area. As the world's fifth-largest country by both area and population, it is the largest country to have Portuguese as an official language and the only one in the Americas.[13][14] Bounded by the Atlantic Ocean on the east, Brazil has a coastline of 7,491 kilometers (4,655 mi)[15] It borders all other South American countries except Ecuador and Chile and covers 47.3% of the continent's land area.[16] Its Amazon River basin includes a vast tropical forest, home to diverse wildlife, a variety of ecological systems, and extensive natural resources spanning numerous protected habitats.[15] This unique environmental heritage makes Brazil one of 17 megadiverse countries, and is the subject of significant global interest and debate regarding deforestation and environmental protection.\n\nBrazil was inhabited by numerous tribal nations prior to the landing in 1500 of explorer Pedro Álvares Cabral, who claimed the area for the Portuguese Empire. Brazil remained a Portuguese colony until 1808, when the capital of the empire was transferred from Lisbon to Rio de Janeiro. In 1815, the colony was elevated to the rank of kingdom upon the formation of the United Kingdom of Portugal, Brazil and the Algarves. Independence was achieved in 1822 with the creation of the Empire of Brazil, a unitary state governed under a constitutional monarchy and a parliamentary system. The ratification of the first constitution in 1824 led to the formation of a bicameral legislature, now called the National Congress. The country became a presidential republic in 1889 following a military coup d'état. An authoritarian military junta came to power in 1964 and ruled until 1985, after which civilian governance resumed. Brazil's current constitution, formulated in 1988, defines it as a democratic federal republic.[17] The federation is composed of the union of the Federal District, the 26 states, and the 5,570 municipalities.\n\nBrazil's economy is the world's ninth-largest by nominal GDP and eighth-largest by GDP (PPP) as of 2016.[18][19] A member of the BRICS group, Brazil until 2010 had one of the world's fastest growing major economies, with its economic reforms giving the country new international recognition and influence.[20] Brazil's national development bank plays an important role for the country's economic growth.[21] Brazil is a founding member of the United Nations, the G20, BRICS, Unasul, Mercosul, Organization of American States, Organization of Ibero-American States, and the CPLP. Brazil is a regional power in Latin America and a middle power in international affairs,[22] with some analysts identifying it as an emerging global power.[23] One of the world's major breadbaskets, Brazil has been the largest producer of coffee for the last 150 years.[24]\n\n\nEtymology\nMain article: Name of Brazil\nIt is likely that the word \"Brazil\" comes from the Portuguese word for brazilwood, a tree that once grew plentifully along the Brazilian coast.[25] In Portuguese, brazilwood is called pau-brasil, with the word brasil commonly given the etymology \"red like an ember\", formed from Latin brasa (\"ember\") and the suffix -il (from -iculum or -ilium).[26] As brazilwood produces a deep red dye, it was highly valued by the European cloth industry and was the earliest commercially exploited product from Brazil.[27] Throughout the 16th century, massive amounts of brazilwood were harvested by indigenous peoples (mostly Tupi) along the Brazilian coast, who sold the timber to European traders (mostly Portuguese, but also French) in return for assorted European consumer goods.[28]\n\nThe official Portuguese name of the land, in original Portuguese records, was the \"Land of the Holy Cross\" (Terra da Santa Cruz),[29] but European sailors and merchants commonly called it simply the \"Land of Brazil\" (Terra do Brasil) on account of the brazilwood trade.[30] The popular appellation eclipsed and eventually supplanted the official Portuguese name. Early sailors sometimes also called it the \"Land of Parrots\" (Terra di Papaga).[31]\n\nIn the Guarani language, an official language of Paraguay, Brazil is called \"Pindorama\". This was the name the indigenous population gave to the region, meaning \"land of the palm trees\".[32]\n\nHistory\nMain articles: History of Brazil and Timeline of Brazilian history\nPre-Cabraline era\nMain article: History of Brazil § Precolonial history\n\nMegaliths in the Solstice Archaeological Park, in Amapá, erected between 500 and 2000 years ago, probably to carry out astronomical observations.\nThe earliest human remains found in the Americas, Luzia Woman, were found in the area of Pedro Leopoldo, Minas Gerais and provide evidence of human habitation going back at least 11,000 years.[33][34] The earliest pottery ever found in the Western Hemisphere was excavated in the Amazon basin of Brazil and radiocarbon dated to 8,000 years ago (6000 BC). The pottery was found near Santarém and provides evidence that the tropical forest region supported a complex prehistoric culture.[35]\n\nAround the time of the Portuguese arrival, the territory of current day Brazil had an estimated indigenous population of 7 million people,[36] mostly semi-nomadic who subsisted on hunting, fishing, gathering, and migrant agriculture. The indigenous population of Brazil comprised several large indigenous ethnic groups (e.g. the Tupis, Guaranis, Gês and Arawaks). The Tupí people were subdivided into the Tupiniquins and Tupinambás, and there were also many subdivisions of the other groups.[37]\n\nBefore the arrival of the Europeans, the boundaries between these groups and their subgroups were marked by wars that arose from differences in culture, language and moral beliefs.[38] These wars also involved large-scale military actions on land and water, with cannibalistic rituals on prisoners of war.[39][40] While heredity had some weight, leadership status was more subdued over time, than allocated in succession ceremonies and conventions.[38] Slavery among the Indians had a different meaning than it had for Europeans, since it originated from a diverse socio-economic organization, in which asymmetries were translated into kinship relations.[41]\n\nPortuguese colonization\nMain article: Colonial Brazil\n\nRepresentation of the landing of Pedro Álvares Cabral in Porto Seguro, 1500.\nThe land now called Brazil was claimed for the Portuguese Empire on 22 April 1500, with the arrival of the Portuguese fleet commanded by Pedro Álvares Cabral.[42] The Portuguese encountered indigenous peoples divided into several tribes, most of whom spoke languages of the Tupi–Guarani family, and fought among themselves.[43] Though the first settlement was founded in 1532, colonization was effectively begun in 1534, when King Dom João III of Portugal divided the territory into the fifteen private and autonomous Captaincy Colonies of Brazil.[44][45]\n\nHowever, the decentralized and unorganized tendencies of the captaincy colonies proved problematic, and in 1549 the Portuguese king restructured them into the Governorate General of Brazil, a single and centralized Portuguese colony in South America.[45][46] In the first two centuries of colonization, Indigenous and European groups lived in constant war, establishing opportunistic alliances in order to gain advantages against each other.[47][48][49][50] By the mid-16th century, cane sugar had become Brazil's most important exportation product,[43][51] and slaves purchased in Sub-Saharan Africa, in the slave market of Western Africa[52] (not only those from Portuguese allies of their colonies in Angola and Mozambique), had become its largest import,[53][54] to cope with plantations of sugarcane, due to increasing international demand for Brazilian sugar.[55][56]\n\n\nPainting showing the arrest of Tiradentes; he was sentenced to death for his involvement in the best known movement for independence in Colonial Brazil.\nBy the end of the 17th century, sugarcane exports began to decline,[57] and the discovery of gold by bandeirantes in the 1690s would become the new backbone of the colony's economy, fostering a Brazilian Gold Rush[58] which attracted thousands of new settlers to Brazil from Portugal and all Portuguese colonies around the world.[59] This increased level of immigration in turn caused some conflicts between newcomers and old settlers.[60]\n\nPortuguese expeditions known as Bandeiras gradually advanced the Portugal colonial original frontiers in South America to approximately the current Brazilian borders.[61][62] In this era other European powers tried to colonize parts of Brazil, in incursions that the Portuguese had to fight, notably the French in Rio during the 1560s, in Maranhão during the 1610s, and the Dutch in Bahia and Pernambuco, during the Dutch–Portuguese War, after the end of Iberian Union.[63]\n\nThe Portuguese colonial administration in Brazil had two objectives that would ensure colonial order and the monopoly of Portugal's wealthiest and largest colony: to keep under control and eradicate all forms of slave rebellion and resistance, such as the Quilombo of Palmares,[64] and to repress all movements for autonomy or independence, such as the Minas Conspiracy.[65]\n\nUnited Kingdom with Portugal\nMain article: United Kingdom of Portugal, Brazil and the Algarves\n\nThe Acclamation of King João VI of the United Kingdom of Portugal, Brazil and the Algarves in Rio de Janeiro, 6 February 1818\nIn late 1807, Spanish and Napoleonic forces threatened the security of continental Portugal, causing Prince Regent João, in the name of Queen Maria I, to move the royal court from Lisbon to Brazil.[66] There they established some of Brazil's first financial institutions, such as its local stock exchanges,[67] and its National Bank, additionally ending the Portuguese monopoly on Brazilian trade and opening Brazil to other nations. In 1809, in retaliation for being forced into exile, the Prince Regent ordered the Portuguese conquest of French Guiana.[68]\n\nWith the end of the Peninsular War in 1814, the courts of Europe demanded that Queen Maria I and Prince Regent João return to Portugal, deeming it unfit for the head of an ancient European monarchy to reside in a colony. In 1815, in order to justify continuing to live in Brazil, where the royal court had thrived for the past six years, the Crown established the United Kingdom of Portugal, Brazil, and the Algarves, thus creating a pluricontinental transatlantic monarchic state.[69] However, such a ploy didn't last long, since the leadership in Portugal resentful with the new status of its larger colony, continued to require the return of court to Lisbon (as postulated by the Liberal Revolution of 1820), as well as groups of Brazilians, impatient for practical and real changes still demanded independence and a republic, as showed by the 1817 Pernambucan Revolt.[69] In 1821, as a demand of revolutionaries who had taken the city of Porto,[70] D. João VI was unable to hold out any longer, and departed for Lisbon. There he swore oath to the new constitution, leaving his son, Prince Pedro de Alcântara, as Regent of the Kingdom of Brazil.[71]\n\nIndependent Empire\nMain articles: Independence of Brazil and Empire of Brazil\n\nDeclaration of the Brazilian independence by Prince Pedro (later Emperor Pedro I) on 7 September 1822.\nTensions between Portuguese and Brazilians increased, and the Portuguese Cortes, guided by the new political regime imposed by the 1820 Liberal Revolution, tried to re-establish Brazil as a colony.[72] The Brazilians refused to yield, and Prince Pedro decided to stand with them, declaring the country's independence from Portugal on 7 September 1822.[73] A month later, Prince Pedro was declared the first Emperor of Brazil, with the regnal title of Dom Pedro I, resulting in the foundation of the Empire of Brazil.[74]\n\nThe Brazilian War of Independence, which had already begun along this process, spread through northern, northeastern regions and in Cisplatina province.[75] With the last Portuguese soldiers surrendering on 8 March 1824,[76] Portugal officially recognized Brazil on 29 August 1825.[77]\nOn 7 April 1831, worn down by years of administrative turmoil and political dissensions with both liberal and conservative sides of politics, including an attempt of republican secession,[78] as well as unreconciled with the way that absolutists in Portugal had given to the succession of King John VI, Pedro I went to Portugal to reclaim his daughter's crown, abdicating the Brazilian throne in favor of his five-year-old son and heir (who thus became the Empire's second monarch, with the regnal title of Dom Pedro II).[79]\n\n\nPedro II, Emperor of Brazil between 1831 and 1889.\nAs the new Emperor could not exert his constitutional powers until he became of age, a regency was set up by the National Assembly.[80] In the absence of a charismatic figure who could represent a moderate face of power, during this period a series of localized rebellions took place, as the Cabanagem, the Malê Revolt, the Balaiada, the Sabinada, and the Ragamuffin War, which emerged from the dissatisfaction of the provinces with the central power, coupled with old and latent social tensions peculiar of a vast, slaveholding and newly independent nation state.[81] This period of internal political and social upheaval, which included the Praieira revolt, was overcome only at the end of the 1840s, years after the end of the regency, which occurred with the premature coronation of Pedro II in 1841.[82]\n\nDuring the last phase of the monarchy, internal political debate was centered on the issue of slavery. The Atlantic slave trade was abandoned in 1850,[83] as a result of the British Aberdeen Act, but only in May 1888 after a long process of internal mobilization and debate for an ethical and legal dismantling of slavery in the country, was the institution formally abolished.[84]\n\nThe foreign affairs in the monarchy were basically related issues with the countries of the Southern Cone with which Brazil has borders. Long after the Cisplatine War that resulted in independence for Uruguay,[85] Brazil won three international wars during the 58-year reign of Pedro II. These were the Platine War, the Uruguayan War and the devastating Paraguayan War, the largest war effort in Brazilian history.[86][87]\n\nOn 15 November 1889, worn out by years of economic stagnation, in attrition with the majority of Army officers, as well as with rural and financial elites (for different reasons), the monarchy was overthrown by a military coup.[88]\n\nEarly republic\nMain articles: First Brazilian Republic, Estado Novo (Brazil), and Second Brazilian Republic\n\nProclamation of the Republic, 1893, oil on canvas by Benedito Calixto (1853–1927).\nThe \"early republican government was little more than a military dictatorship, with army dominating affairs both at Rio de Janeiro and in the states. Freedom of the press disappeared and elections were controlled by those in power\".[89] In 1894, following the unfoldings of two severe crises, an economic along with a military one, the republican civilians rose to power.[90][91][92]\n\nIf in relation to its foreign policy, the country in this first republican period maintained a relative balance characterized by a success in resolving border disputes with neighboring countries,[93] only broken by the Acre War (1899–1902) and its involvement in World War I (1914–1918),[94][95][96] followed by a failed attempt to exert a prominent role in the League of Nations;[97] Internally, from the crisis of Encilhamento[98][99][100] and the Armada Revolts,[101] a prolonged cycle of financial, political and social instability began Until the 1920s, keeping the country besieged by various rebellions, both civilian [102][103][104] and military.[105][106][107]\n\nLittle by little, a cycle of general instability sparked by these crises undermined the regime to such an extent, that in the wake of the murder of his running mate, the defeated opposition presidential candidate Getúlio Vargas supported by most of the military, successfully led the October 1930's Coup.[108][109] Vargas and the military were supposed to assume power temporarily, but instead closed the Congress, extinguished the Constitution, ruled with emergency powers and replaced the states' governors with their own supporters.[110][111]\n\n\nIn half of the first 100 years of republic, the Army exercised power directly or through figures like Getúlio Vargas (center).\n\nSoldiers of the Brazilian Expeditionary Force greet Italian civilians in the city of Massarosa, September 1944.\n\nConstruction of Brasília, the new capital, in 1959.\n\nTanks in front of the National Congress patrol the Esplanada dos Ministérios, in Brasilia, after the coup d'état of 1964, which established a period of 21 years of military dictatorship.\n\nUlysses Guimarães holding the Constitution of 1988 in his hands.\nIn the 1930s, three failed attempts to remove Vargas and his supporters from power occurred. The first was the Constitutionalist Revolt in 1932 led by the Paulista oligarchy, the second was a Communist uprising in November 1935, and the last one a Putsch attempt by the local fascists in May 1938.[112][113][114] The 1935 uprising created a security crisis in which the Congress transferred more power to the executive. The 1937 coup d'état resulted in the cancellation of the 1938 election, installed Vargas as a dictator, and began the Estado Novo era, noted for government brutality and censorship of the press.[115]\n\nThe foreign policy during Vargas years was marked by the antecedents and occurrence of World War II, having Brazil remained neutral until August 1942, when the country entered on the allied side,[116][117] after suffering retaliations undertaken by Nazi Germany and Fascist Italy, in the context of the strategic dispute over the South Atlantic.[118] In addition to its participation in the battle of the Atlantic, Brazil also sent a expeditionary force to fight in the Italian campaign.[119]\n\nWith the allied victory in 1945 and the end of the Nazi-fascist regimes in Europe, Vargas's position became unsustainable and he was swiftly overthrown in another military coup, with Democracy being \"reinstated\" by the same army that had discontinued it 15 years earlier.[120] Vargas committed suicide in August 1954 amid a political crisis, after having returned to power by election in 1950.[121][122]\n\nContemporary era\nMain articles: Brazilian military government and History of Brazil since 1985\nSeveral brief interim governments succeeded after Vargas's suicide.[123] Juscelino Kubitschek became president in 1956 and assumed a conciliatory posture towards the political opposition that allowed him to govern without major crises.[124] The economy and industrial sector grew remarkably,[125] but his greatest achievement was the construction of the new capital city of Brasília, inaugurated in 1960.[126] His successor was Jânio Quadros, who resigned in 1961 less than a year after taking office.[127] His vice-president, João Goulart, assumed the presidency, but aroused strong political opposition[128] and was deposed in April 1964 by a coup that resulted in a military regime.[129]\n\nThe new regime was intended to be transitory[130] but it gradually closed in on itself and became a full dictatorship with the promulgation of the Fifth Institutional Act in 1968.[131] The oppression was not limited to only those who resorted to guerrilla tactics to fight the regime, but also reached institutional opponents, artists, journalists and other members of civil society,[132][133] inside and outside the country (through the infamous \"Operation Condor\").[134][135] Despite its brutality, like other totalitarian regimes in history, due to an economic boom, known as an \"economic miracle\", the regime reached its highest level of popularity in the early 1970s.[136]\n\nSlowly however, the wear and tear of years of dictatorial power that had not slowed the repression, even after the defeat of the leftist guerrillas,[137] plus the inability to deal with the economic crises of the period and popular pressure, made an opening policy inevitable, which from the regime side was led by Generals Geisel and Golbery.[138] With the enactment of the Amnesty Law in 1979, Brazil began its slow return to democracy, which would be completed during the 1980s.[82]\n\nCivilians returned to power in 1985 when José Sarney assumed the presidency, becoming unpopular during his tenure due to his failure in controlling the economic crisis and hyperinflation inherited from the military regime.[139] Sarney's unsuccessful government allowed the election in 1989 of the almost unknown Fernando Collor, who was subsequently impeached by the National Congress in 1992.[140]\n\nCollor was succeeded by his Vice-President Itamar Franco, who appointed Fernando Henrique Cardoso as Minister of Finance. In 1994, Cardoso produced a highly successful Plano Real,[141] that, after decades of failed economic plans made by previous governments attempting to curb hyperinflation, finally granted stability to the Brazilian economy,[142][143] leading Cardoso to be elected that year, and again in 1998.[144]\n\nThe peaceful transition of power from Fernando Henrique to his main opposition leader, Luiz Inácio Lula da Silva (elected in 2002 and re-elected in 2006), was seen as a proof that Brazil had finally succeeded in achieving a long-sought political stability.[145][146] However, sparked by indignation and frustrations accumulated over decades (against corruption, police brutality, inefficiencies of political establishment and public service), numerous peaceful protests erupted in Brazil from the middle of first term of Dilma Rousseff (who succeeded Lula in 2010).[147][148] Enhanced by a political and economic crises with evidences of involvement of politicians from all main political parties in several bribery and tax evasion schemes,[149][150] with large street protests for and against her,[151] Rousseff was impeached by the Brazilian Congress in 2016.[6][152]\n\nGeography\nMain article: Geography of Brazil\n\nTopographic map of Brazil.\nBrazil occupies a large area along the eastern coast of South America and includes much of the continent's interior,[153] sharing land borders with Uruguay to the south; Argentina and Paraguay to the southwest; Bolivia and Peru to the west; Colombia to the northwest; and Venezuela, Guyana, Suriname and France (French overseas region of French Guiana) to the north. It shares a border with every South American country except Ecuador and Chile. It also encompasses a number of oceanic archipelagos, such as Fernando de Noronha, Rocas Atoll, Saint Peter and Paul Rocks, and Trindade and Martim Vaz.[15] Its size, relief, climate, and natural resources make Brazil geographically diverse.[153] Including its Atlantic islands, Brazil lies between latitudes 6°N and 34°S, and longitudes 28° and 74°W.\n\nBrazil is the fifth largest country in the world, and third largest in the Americas, with a total area of 8,515,767.049 km2 (3,287,956 sq mi),[154] including 55,455 km2 (21,411 sq mi) of water.[15] It spans four time zones; from UTC−5 comprising the state of Acre and the westernmost portion of Amazonas, to UTC−4 in the western states, to UTC−3 in the eastern states (the national time) and UTC−2 in the Atlantic islands.[155]\n\nBrazil is the only country in the world that has the equator and the Tropic of Capricorn running through it. It is also the only country to have contiguous territory both inside and outside the tropics. Brazilian topography is also diverse and includes hills, mountains, plains, highlands, and scrublands. Much of the terrain lies between 200 metres (660 ft) and 800 metres (2,600 ft) in elevation.[156] The main upland area occupies most of the southern half of the country.[156] The northwestern parts of the plateau consist of broad, rolling terrain broken by low, rounded hills.[156]\n\nThe southeastern section is more rugged, with a complex mass of ridges and mountain ranges reaching elevations of up to 1,200 metres (3,900 ft).[156] These ranges include the Mantiqueira and Espinhaço mountains and the Serra do Mar.[156] In the north, the Guiana Highlands form a major drainage divide, separating rivers that flow south into the Amazon Basin from rivers that empty into the Orinoco River system, in Venezuela, to the north. The highest point in Brazil is the Pico da Neblina at 2,994 metres (9,823 ft), and the lowest is the Atlantic Ocean.[15]\n\nBrazil has a dense and complex system of rivers, one of the world's most extensive, with eight major drainage basins, all of which drain into the Atlantic.[157] Major rivers include the Amazon (the world's second-longest river and the largest in terms of volume of water), the Paraná and its major tributary the Iguaçu (which includes the Iguazu Falls), the Negro, São Francisco, Xingu, Madeira and Tapajós rivers.[157]\n\nGeography of Brazil\n\nTrindade and Martin Vaz is a volcanic archipelago off the coast of the Brazil.\n \n\nSerra dos Órgãos, part of the Serra do Mar\n \n\nChapada Diamantina, in the Chapada Diamantina National Park, Bahia.\n \n\nPico da Neblina, Amazonas, the highest mountain in Brazil.\n \n\nCavern in Bonito, Mato Grosso do Sul.\nClimate\nMain article: Climate of Brazil\n\nBrazil map of Köppen climate classification.\nThe climate of Brazil comprises a wide range of weather conditions across a large area and varied topography, but most of the country is tropical.[15] According to the Köppen system, Brazil hosts five major climatic subtypes: equatorial, tropical, semiarid, highland tropical, temperate, and subtropical. The different climatic conditions produce environments ranging from equatorial rainforests in the north and semiarid deserts in the northeast, to temperate coniferous forests in the south and tropical savannas in central Brazil.[158] Many regions have starkly different microclimates.[159][160]\n\nAn equatorial climate characterizes much of northern Brazil. There is no real dry season, but there are some variations in the period of the year when most rain falls.[158] Temperatures average 25 °C (77 °F),[160] with more significant temperature variation between night and day than between seasons.[159]\n\nOver central Brazil rainfall is more seasonal, characteristic of a savanna climate.[159] This region is as extensive as the Amazon basin but has a very different climate as it lies farther south at a higher altitude.[158] In the interior northeast, seasonal rainfall is even more extreme. The semiarid climatic region generally receives less than 800 millimetres (31.5 in) of rain,[161] most of which generally falls in a period of three to five months of the year[162] and occasionally less than this, creating long periods of drought.[159] Brazil's 1877–78 Grande Seca (Great Drought), the worst in Brazil's history,[163] caused approximately half a million deaths.[164] A similarly devastating drought occurred in 1915.[165]\n\nSouth of Bahia, near the coasts, and more southerly most of the state of São Paulo, the distribution of rainfall changes, with rain falling throughout the year.[158] The south enjoys subtropical conditions, with cool winters and average annual temperatures not exceeding 18 °C (64.4 °F);[160] winter frosts and snowfall are not rare in the highest areas.[158][159]\n\nClimate of Brazil\n\nSnow in São Joaquim, Santa Catarina.\n \n\nTropical climate in Arraial do Cabo, Rio de Janeiro.\n \n\nEquatorial climate in Meeting of Waters, Amazonas.\n \n\nSemi-arid climate in the Serra da Capivara National Park, Piauí.\n \n\nTropical savanna climate in Cerrado, Pirineus State Park, Pirenópolis, Goiás.\nBiodiversity and environment\nMain articles: Wildlife of Brazil, Deforestation in Brazil, and Conservation in Brazil\nBrazil's large territory comprises different ecosystems, such as the Amazon rainforest, recognized as having the greatest biological diversity in the world,[166] with the Atlantic Forest and the Cerrado, sustaining the greatest biodiversity.[167] In the south, the Araucaria pine forest grows under temperate conditions.[167] The rich wildlife of Brazil reflects the variety of natural habitats. Scientists estimate that the total number of plant and animal species in Brazil could approach four million, mostly invertebrates.[167]\n\n\nThe Amazon rainforest, the richest and most biodiverse rainforest in the world.\nLarger mammals include carnivores pumas, jaguars, ocelots, rare bush dogs, and foxes, and herbivores peccaries, tapirs, anteaters, sloths, opossums, and armadillos. Deer are plentiful in the south, and many species of New World monkeys are found in the northern rain forests.[167][168] Concern for the environment has grown in response to global interest in environmental issues.[169] Brazil's Amazon Basin is home to an extremely diverse array of fish species, including the red-bellied piranha. Despite its reputation as a ferocious freshwater fish, the red-bellied piranha is actually a generally timid scavenger. Biodiversity can contribute to agriculture, livestock, forestry and fisheries extraction. However, almost all economically exploited species of plants, such as soybeans and coffee, or animals, such as chickens, are imported from other countries, and the economic use of native species still crawls. In the Brazilian GDP, the forest sector represents just over 1% and fishing 0.4%.\n\nThe natural heritage of Brazil is severely threatened by cattle ranching and agriculture, logging, mining, resettlement, oil and gas extraction, over-fishing, wildlife trade, dams and infrastructure, water pollution, climate change, fire, and invasive species.[166] In many areas of the country, the natural environment is threatened by development.[170] Construction of highways has opened up previously remote areas for agriculture and settlement; dams have flooded valleys and inundated wildlife habitats; and mines have scarred and polluted the landscape.[169][171] At least 70 dams are said to be planned for the Amazon region, including the controversial Belo Monte hydroelectric dam.[172]\n\nBiodiversity of Brazil\n\nBlue poison dart frog, found in the forests of the far northern Brazil.\n \n\nToco toucan, a Brazilian symbol, a country with one of the largest variety of birds in the world.\n \n\nFemale pantanal jaguar in Piquirí River, Pantanal.\n \n\nGolden lion tamarin, an endemic animal of Brazil, in the Poço das Antas Biological Reserve.\n \n\nLear's macaw, endemic to Raso da Catarina, Bahia.\nGovernment and politics\nMain articles: Politics of Brazil, Federal government of Brazil, and Elections in Brazil\n\nPalácio do Planalto (\"Plateau Palace\"), the official workplace of the President of Brazil.\nThe form of government is that of a democratic federative republic, with a presidential system.[17] The president is both head of state and head of government of the Union and is elected for a four-year term,[17] with the possibility of re-election for a second successive term. The current president is Michel Temer, who replaced Dilma Rousseff after her impeachment.[173] The President appoints the Ministers of State, who assist in government.[17] Legislative houses in each political entity are the main source of law in Brazil. The National Congress is the Federation's bicameral legislature, consisting of the Chamber of Deputies and the Federal Senate. Judiciary authorities exercise jurisdictional duties almost exclusively. Brazil is a democracy, according to the Democracy Index 2010.[174]\n\nThe Brazilian Federation is the \"indissoluble union\" of the States, the Municipalities and the Federal District.[17] The Union, the states and the Federal District, and the municipalities, are the \"spheres of government\". The federation is set on five fundamental principles:[17] sovereignty, citizenship, dignity of human beings, the social values of labour and freedom of enterprise, and political pluralism. The classic tripartite branches of government (executive, legislative and judicial under a checks and balances system) are formally established by the Constitution.[17] The executive and legislative are organized independently in all three spheres of government, while the judiciary is organized only at the federal and state/Federal District spheres.\n\n\nNational Congress of Brazil, seat of the legislative branch.\nAll members of the executive and legislative branches are directly elected.[175][176][177] Judges and other judicial officials are appointed after passing entry exams.[175] For most of its democratic history, Brazil has had a multi-party system, proportional representation. Voting is compulsory for the literate between 18 and 70 years old and optional for illiterates and those between 16 and 18 or beyond 70.[17]\n\nTogether with several smaller parties, four political parties stand out: Workers' Party (PT), Brazilian Social Democracy Party (PSDB), Brazilian Democratic Movement Party (PMDB) and Democrats (DEM). Fifteen political parties are represented in Congress. It is common for politicians to switch parties, and thus the proportion of congressional seats held by particular parties changes regularly.[178] Almost all governmental and administrative functions are exercised by authorities and agencies affiliated to the Executive.\n\nLaw\nMain articles: Law of Brazil, Law enforcement in Brazil, and Crime in Brazil\nBrazilian law is based on Roman-Germanic[not in citation given] traditions[179] and civil law concepts prevail over common law practice. Most of Brazilian law is codified, although non-codified statutes also represent a substantial part, playing a complementary role. Court decisions set out interpretive guidelines; however, they are seldom binding on other specific cases. Doctrinal works and the works of academic jurists have strong influence in law creation and in law cases.\n\n\nSupreme Federal Court of Brazil serves primarily as the Constitutional Court of the country.\nThe legal system is based on the Federal Constitution, which was promulgated on 5 October 1988, and is the fundamental law of Brazil. All other legislation and court decisions must conform to its rules.[180] As of April 2007, there have been 53 amendments. States have their own constitutions, which must not contradict the Federal Constitution.[181] Municipalities and the Federal District have \"organic laws\" (leis orgânicas), which act in a similar way to constitutions.[182] Legislative entities are the main source of statutes, although in certain matters judiciary and executive bodies may enact legal norms.[17] Jurisdiction is administered by the judiciary entities, although in rare situations the Federal Constitution allows the Federal Senate to pass on legal judgments.[17] There are also specialized military, labor, and electoral courts.[17] The highest court is the Supreme Federal Court.\n\nThis system has been criticized over the last few decades for the slow pace of decision-making. Lawsuits on appeal may take several years to resolve, and in some cases more than a decade elapses before definitive rulings.[183] Nevertheless, the Supreme Federal Tribunal was the first court in the world to transmit its sessions on television, and also via YouTube.[184][185] More recently, in December 2009, the Supreme Court adopted Twitter to display items on the day planner of the ministers, to inform the daily actions of the Court and the most important decisions made by them.[186]\n\nMilitary\nMain article: Brazilian Armed Forces\n\nBrazilian Army participating in a UN peacekeeping mission in Haiti.\nThe armed forces of Brazil are the second largest in Latin America by active personnel and the largest in terms of military equipment.[187] It consists of the Brazilian Army (including the Army Aviation Command), the Brazilian Navy (including the Marine Corps and Naval Aviation), and the Brazilian Air Force. Brazil's conscription policy gives it one of the world's largest military forces, estimated at more than 1.6 million reservist annually.[188]\n\nNumbering close to 236,000 active personnel,[189] the Brazilian Army has the largest number of armored vehicles in South America, including armored transports and tanks[190] It is also unique in Latin America for its large, elite forces specializing in unconventional missions, the Brazilian Special Operations Command,[191][192][193] and the versatile Strategic Rapid Action Force, made up of highly mobilized and prepared (Special Operations Brigade, Infantry Brigade Parachutist,[194][195] 1st Jungle Infantry Battalion (Airmobile)[196] and 12th Brigade Light Infantry (Airmobile)[197] able to act anywhere in the country, on short notice, to counter external aggression.[198] The states' Military Police and the Military Firefighters Corps are described as an ancillary forces of the Army by the constitution, but are under the control of each state's governor.[17]\n\n\nVarious aircraft participate in the CRUZEX exercise on 11 November 2010, at Natal Air Force Base\nThe Navy once operated some of the most powerful warships in the world with the two Minas Geraes-class dreadnoughts, which sparked a South American dreadnought race between Argentina, Brazil, and Chile.[199] Today, it is a green water force and has a group of specialized elite in retaking ships and naval facilities, GRUMEC, unit specially trained to protect Brazilian oil platforms along its coast.[200] It's the only navy in Latin America that operates an aircraft carrier, NAe São Paulo,[201] and one of the ten navies of the world to operate this type of ship.[190]\n\nThe Air Force, it is the largest in Latin America has about 700 manned aircraft in service and effective about 67,000 personnel.[202]\n\nBrazil has not been invaded since 1865 during the Paraguayan War.[203] Additionally, Brazil has no contested territorial disputes with any of its neighbours[204] and neither does it have rivalries, like Chile and Bolivia have with each other.[205][206] The Brazilian military has also three times intervened militarily to overthrow the Brazilian government.[207] It has built a tradition of participating in UN peacekeeping missions such as in Haiti and East Timor.[208]\n\nBrazilian Armed Forces\nTank.\nBrazilian Army\nAstros 2020\tShip.\nBrazilian Navy\nCv Barroso (V34)\tA-4AR Fightinghawk\nBrazilian Air Force\nAMX International\nForeign policy\nMain article: Foreign relations of Brazil\n\nItamaraty Palace, the seat of Ministry of Foreign Affairs.\nBrazil's international relations are based on Article 4 of the Federal Constitution, which establishes non-intervention, self-determination, international cooperation and the peaceful settlement of conflicts as the guiding principles of Brazil's relationship with other countries and multilateral organizations.[209]\n\nAccording to the Constitution, the President has ultimate authority over foreign policy, while the Congress is tasked with reviewing and considering all diplomatic nominations and international treaties, as well as legislation relating to Brazilian foreign policy.[210]\n\nBrazil's foreign policy is a by-product of the country's unique position as a regional power in Latin America, a leader among developing countries, and an emerging world power.[211] Brazilian foreign policy has generally been based on the principles of multilateralism, peaceful dispute settlement, and non-intervention in the affairs of other countries.[212]\n\nAn increasingly well-developed tool of Brazil's foreign policy is providing aid as a donor to other developing countries.[213] Brazil does not just use its growing economic strength to provide financial aid, but it also provides high levels of expertise and most importantly of all, a quiet non-confrontational diplomacy to improve governance levels.[213] Total aid is estimated to be around $1 billion per year that includes:[213]\n\n\nDiplomatic missions of Brazil\ntechnical cooperation of around $480 million ($30 million in 2010 provided directly by the Brazilian Cooperation Agency (ABC))\nan estimated $450 million for in-kind expertise provided by Brazilian institutions specialising in technical cooperation\nIn addition, Brazil manages a peacekeeping mission in Haiti ($350 million) and makes in-kind contributions to the World Food Programme ($300 million).[213] This is in addition to humanitarian assistance and contributions to multilateral development agencies. The scale of this aid places it on par with China and India.[213] The Brazilian South-South aid has been described as a \"global model in waiting.\"[214]\n\nLaw enforcement and crime\nMain articles: Law enforcement in Brazil and Crime in Brazil\n\nHelicopter of the Federal Police Department.\nIn Brazil, the Constitution establishes five different police agencies for law enforcement: Federal Police Department, Federal Highway Police, Federal Railroad Police, Military Police and Civil Police. Of these, the first three are affiliated with federal authorities and the last two are subordinate to state governments. All police forces are the responsibility of the executive branch of any of the federal or state powers.[17] The National Public Security Force also can act in public disorder situations arising anywhere in the country.[215]\n\nThe country still has above-average levels of violent crime and particularly high levels of gun violence and homicide. In 2012, the World Health Organization (WHO) estimated the number of 32 deaths per 100,000 inhabitants, one of the highest rates of intentional homicide of the world.[216] The number considered tolerable by the WHO is about 10 homicides per 100,000 inhabitants.[217] However, there are differences between the crime rates in the Brazilian states. While in São Paulo the homicide rate registered in 2013 was 10.8 deaths per 100,000 inhabitants, in Alagoas it was 64.7 homicides per 100,000 inhabitants.[218]\n\nBrazil also has high levels of incarceration and the third largest prison population in the world (behind only China and the United States), with an estimated total of approximately 700,000 prisoners around the country (June 2014), an increase of about 300% compared to the index registered in 1992.[219] The high number of prisoners eventually overloaded the Brazilian prison system, leading to a shortfall of about two hundred thousand accommodations.[220]\n\nAdministrative divisions\nAtlantic\nOcean Pacific\nOcean North Region Northeast Region Central-West Region Southeast Region South Region Acre Amazonas Pará Roraima Amapá Rondônia Tocantins Maranhão Bahia Piauí Ceará Rio Grande\ndo Norte Paraíba Pernambuco Alagoas Sergipe Mato Grosso Mato Grosso\ndo Sul Federal\nDistrict Goiás Minas Gerais São Paulo Rio de Janeiro Espírito Santo Paraná Santa Catarina Rio Grande\ndo Sul Argentina Bolivia Chile Colombia French Guiana Guyana Paraguay Peru Suriname Uruguay Venezuela\nStates of Brazil and Regions of Brazil\nMain articles: States of Brazil and Municipalities of Brazil\nSee also: Regions of Brazil\nBrazil is a federation composed of 26 States, one Federal district (which contains the capital city, Brasília) and Municipalities.[17] States have autonomous administrations, collect their own taxes and receive a share of taxes collected by the Federal government. They have a governor and a unicameral legislative body elected directly by their voters. They also have independent Courts of Law for common justice. Despite this, states have much less autonomy to create their own laws than in the United States. For example, criminal and civil laws can be voted by only the federal bicameral Congress and are uniform throughout the country.[17]\n\nThe states and the federal district may be grouped into regions: Northern, Northeast, Central-West, Southeast and Southern. The Brazilian regions are merely geographical, not political or administrative divisions, and they do not have any specific form of government. Although defined by law, Brazilian regions are useful mainly for statistical purposes, and also to define the distribution of federal funds in development projects.\n\nMunicipalities, as the states, have autonomous administrations, collect their own taxes and receive a share of taxes collected by the Union and state government.[17] Each has a mayor and an elected legislative body, but no separate Court of Law. Indeed, a Court of Law organized by the state can encompass many municipalities in a single justice administrative division called comarca (county).\n\nEconomy\nMain article: Economy of Brazil\nSee also: Brazilian real\n\nQuotes panel of BM&F Bovespa, in São Paulo, the country's stock exchange.\n\nA KC-390 military transport aircraft, developed by Brazilian company Embraer, the third largest producer of civil aircraft, after Airbus and Boeing.[221]\nBrazil is the largest national economy in Latin America, the world's eight largest economy and the seventh largest in purchasing power parity (PPP) according to the 2017 estimates. Brazil has a mixed economy with abundant natural resources. After rapid growth in preceding decades, the country entered an ongoing recession in 2014 amid a political corruption scandal and nationwide protests.\n\nIts GDP (PPP) per capita was $15,048 in 2016[222] putting Brazil in the 77th position according to IMF data. Active in agricultural, mining, manufacturing and service sectors Brazil has a labor force of over a 107 million (ranking 6th worldwide) and unemployment of 6.2% (ranking 64th worldwide).[223] The country has been expanding its presence in international financial and commodities markets, and is one of a group of four emerging economies called the BRIC countries.[224] Brazil has been the world's largest producer of coffee for the last 150 years.[24]\n\n\nCombine harvester in a rice plantation in Santa Catarina. Brazil is the third largest exporter of agricultural products in the world.[225]\n\nCentral Bank of Brazil, in Brasília\nBrazil has become the fourth largest car market in the world.[226] Major export products include aircraft, electrical equipment, automobiles, ethanol, textiles, footwear, iron ore, steel, coffee, orange juice, soybeans and corned beef.[227] In total, Brazil ranks 23rd worldwide in value of exports.\n\nBrazil pegged its currency, the real, to the U.S. dollar in 1994. However, after the East Asian financial crisis, the Russian default in 1998[228] and the series of adverse financial events that followed it, the Central Bank of Brazil temporarily changed its monetary policy to a managed-float[229] scheme while undergoing a currency crisis, until definitively changing the exchange regime to free-float in January 1999.[230]\n\nBrazil received an International Monetary Fund rescue package in mid-2002 of $30.4 billion,[231] then a record sum. Brazil's central bank paid back the IMF loan in 2005, although it was not due to be repaid until 2006.[232] One of the issues the Central Bank of Brazil recently dealt with was an excess of speculative short-term capital inflows to the country, which may have contributed to a fall in the value of the U.S. dollar against the real during that period.[233] Nonetheless, foreign direct investment (FDI), related to long-term, less speculative investment in production, is estimated to be $193.8 billion for 2007.[234] Inflation monitoring and control currently plays a major part in the Central bank's role of setting out short-term interest rates as a monetary policy measure.[235]\n\nBetween 1993 and 2010, 7012 mergers & acquisitions with a total known value of $707 billion with the involvement of Brazilian firms have been announced.[236] The year 2010 was a new record in terms of value with 115 billion USD of transactions. The largest transaction with involvement of Brazilian companies has been: Cia. Vale do Rio Doce acquired Inco in a tender offer valued at US$18.9 billion.\n\nCorruption costs Brazil almost $41 billion a year alone, with 69.9% of the country's firms identifying the issue as a major constraint in successfully penetrating the global market.[237] Local government corruption is so prevalent that voters perceive it as a problem only if it surpasses certain levels, and only if a local media e.g. a radio station is present to divulge the findings of corruption charges.[238] Initiatives, like this exposure, strengthen awareness which is indicated by the Transparency International's Corruption Perceptions Index; ranking Brazil 69th out of 178 countries in 2012.[239] The purchasing power in Brazil is eroded by the so-called Brazil cost.[240]\n\nComponents and energy\nMain articles: Agriculture in Brazil, Mining in Brazil, Industry in Brazil, and Energy policy of Brazil\n\nP-51, an oil platform of Petrobras.\nBrazil's diversified economy includes agriculture, industry, and a wide range of services.[241] Agriculture and allied sectors like forestry, logging and fishing accounted for 5.1% of the gross domestic product in 2007.[242] Brazil is one of the largest producer of oranges, coffee, sugar cane, cassava and sisal, soybeans and papayas.[243]\n\nThe industry – from automobiles, steel and petrochemicals to computers, aircraft and consumer durables – accounted for 30.8% of the gross domestic product.[242] Industry is highly concentrated in metropolitan São Paulo, Rio de Janeiro, Campinas, Porto Alegre, and Belo Horizonte.[244]\n\nBrazil is the world's tenth largest energy consumer with much of its energy coming from renewable sources, particularly hydroelectricity and ethanol; the Itaipu Dam is the world's largest hydroelectric plant by energy generation.[245] The first car with an ethanol engine was produced in 1978 and the first airplane engine running on ethanol in 2005.[246] Recent oil discoveries in the Pre-salt layer have opened the door for a large increase in oil production.[247] The governmental agencies responsible for the energy policy are the Ministry of Mines and Energy, the National Council for Energy Policy, the National Agency of Petroleum, Natural Gas and Biofuels, and the National Agency of Electricity.[248]\n\n\nThe Itaipu Dam on the Paraná River, located on the border between Brazil and Paraguay, is the second largest of the world (the first is the Three Gorges Dam, in China). Approximately 75% of the Brazilian energy matrix, one of the cleanest in the world, comes from hydropower.\nTourism\nMain article: Tourism in Brazil\n\nFernando de Noronha Archipelago, Pernambuco.\n\nIguazu Falls, Paraná, in Brazil-Argentina border.\nTourism in Brazil is a growing sector and key to the economy of several regions of the country. The country had 5 million visitors in 2010, ranking in terms of international tourist arrivals as the second destination in South America, and third in Latin America after Mexico and Argentina. Revenues from international tourists reached US$6 billion in 2010, showing a recovery from the 2008–2009 economic crisis.[249] Historical records of 5.4 million visitors and US$6.8 billion in receipts were reached in 2011.[250][251]\n\nNatural areas are its most popular tourism product, a combination of ecotourism with leisure and recreation, mainly sun and beach, and adventure travel, as well as cultural tourism. Among the most popular destinations are the Amazon Rainforest, beaches and dunes in the Northeast Region, the Pantanal in the Center-West Region, beaches at Rio de Janeiro and Santa Catarina, cultural tourism in Minas Gerais and business trips to São Paulo city.[252]\n\nIn terms of the 2015 Travel and Tourism Competitiveness Index (TTCI), which is a measurement of the factors that make it attractive to develop business in the travel and tourism industry of individual countries, Brazil ranked in the 28st place at the world's level, third in the Americas, after Canada and United States.[253][254]\n\nBrazil's main competitive advantages are its natural resources, which ranked 1st on this criteria out of all countries considered, and ranked 23rd for its cultural resources, due to its many World Heritage sites. The TTCI report notes Brazil's main weaknesses: its ground transport infrastructure remains underdeveloped (ranked 116th), with the quality of roads ranking in 105th place; and the country continues to suffer from a lack of price competitiveness (ranked 114th), due in part to high ticket taxes and airport charges, as well as high prices and high taxation. Safety and security have improved significantly: 75th in 2011, up from 128th in 2008.[254]\n\nAccording to the World Tourism Organization (WTO), international travel to Brazil accelerated in 2000, particularly during 2004 and 2005. However, in 2006 a slow-down took place, and international arrivals had almost no growth in 2007–08.[255][256][257]\n\n\nBonito, Mato Grosso do Sul. The rivers in the region are known for their crystal clear waters.\n\nThe city of Rio de Janeiro is featured in tourism in Brazil.\nIn spite of this trend, revenues from international tourism continued to rise, from USD 4 billion in 2005 to 5 billion in 2007, despite 330 000 fewer arrivals. This favorable trend is the result of the strong devaluation of the US dollar against the Brazilian Real, which began in 2004, but which makes Brazil a more expensive international destination.[258] This trend changed in 2009, when both visitors and revenues fell as a result of the Great Recession of 2008–09.[259] By 2010, the industry had recovered, and arrivals grew above 2006 levels to 5.2 million international visitors, and receipts from these visitors reached USD 6 billion.[249] In 2011 the historical record was reached with 5.4 million visitors and US$6.8 billion in receipts.[250][251]\n\nDespite continuing record-breaking international tourism revenues, the number of Brazilian tourists travelling overseas has been growing steadily since 2003, resulting in a net negative foreign exchange balance, as more money is spent abroad by Brazilians than comes in as receipts from international tourists visiting Brazil. Tourism expenditures abroad grew from USD 5.8 billion in 2006, to USD 8.2 billion in 2007, a 42% increase, representing a net deficit of USD 3.3 billion in 2007, as compared to USD 1.5 billion in 2006, a 125% increase from the previous year.[260] This trend is caused by Brazilians taking advantage of the stronger Real to travel and making relatively cheaper expenditures abroad.[260] Brazilians traveling overseas in 2006 represented 4% of the country's population.[261]\n\nIn 2005, tourism contributed with 3.2% of the country's revenues from exports of goods and services, and represented 7% of direct and indirect employment in the Brazilian economy.[262] In 2006 direct employment in the sector reached 1.9 million people.[263] Domestic tourism is a fundamental market segment for the industry, as 51 million people traveled throughout the country in 2005,[264] and direct revenues from Brazilian tourists reached USD 22 billion,[265] 5.6 times more receipts than international tourists in 2005.\n\nIn 2005, Rio de Janeiro, Foz do Iguaçu, São Paulo, Florianópolis and Salvador were the most visited cities by international tourists for leisure trips. The most popular destinations for business trips were São Paulo, Rio de Janeiro and Porto Alegre.[266] In 2006 Rio de Janeiro and Fortaleza were the most popular destinations for business trips.\n\nInfrastructure\nScience and technology\nMain article: Brazilian science and technology\n\nNational Synchrotron Light Laboratory in Campinas, state of São Paulo, the only particle accelerator in Latin America.\n\nVLS-1 at the Alcântara Launch Center of Brazilian Space Agency.\nTechnological research in Brazil is largely carried out in public universities and research institutes, with the majority of funding for basic research coming from various government agencies.[267] Brazil's most esteemed technological hubs are the Oswaldo Cruz Institute, the Butantan Institute, the Air Force's Aerospace Technical Center, the Brazilian Agricultural Research Corporation and the INPE.[268][269] The Brazilian Space Agency has the most advanced space program in Latin America, with significant resources to launch vehicles, and manufacture of satellite.[270] Owner of relative technological sophistication, the country develops submarines, aircraft, as well as being involved in space research, having a Vehicle Launch Center Light and being the only country in the Southern Hemisphere the integrate team building International Space Station (ISS).[271]\n\nThe country is also a pioneer in the search for oil in deep water, from where extracts 73% of its reserves. Uranium is enriched at the Resende Nuclear Fuel Factory, mostly for research purposes (as Brazil obtains 88% from its electricity from hydroelectricity[272]) and the country's first nuclear submarine will be delivered in 2015 (by France).[273] Brazil is one of the three countries in Latin America[274] with an operational Synchrotron Laboratory, a research facility on physics, chemistry, material science and life sciences. And Brazil is the only Latin American country to have a semiconductor company with its own fabrication plant, the CEITEC.[275] According to the Global Information Technology Report 2009-2010 of the World Economic Forum, Brazil is the 61 world's largest developer of information technology.[276]\n\nBrazil also has a large number of outstanding scientific personalities. Among the most renowned Brazilian inventors are priests Bartolomeu de Gusmão, Landell de Moura and Francisco João de Azevedo, besides Alberto Santos-Dumont,[277] Evaristo Conrado Engelberg,[278] Manuel Dias de Abreu,[279] Andreas Pavel[280] e Nélio José Nicolai.[281] Brazilian science is represented by the likes of César Lattes (Brazilian physicist Pathfinder of Pi Meson),[282] Mário Schenberg (considered the greatest theoretical physicist of Brazil),[283] José Leite Lopes (only Brazilian physicist holder of UNESCO Science Prize),[284] Artur Ávila (the first Latin American winner of Fields Medal)[285] and Fritz Müller (pioneer in factual support the theory of evolution by Charles Darwin).[286]\n\nTransport\n\nTerminal 3 of the São Paulo–Guarulhos International Airport, the busiest airport in the country.\n\nBR-116 in Fortaleza, Ceará, the longest highway in the country, with 4,385 km (2,725 mi) of extension.[287]\n\nAerial view of Port of Santos, São Paulo, the busiest port in Latin America[288].\nMain article: Transport in Brazil\nBrazilian roads are the primary carriers of freight and passenger traffic. The road system totaled 1.98 million km (1.23 million mi) in 2002. The total of paved roads increased from 35,496 km (22,056 mi) (22,056 mi) in 1967 to 184,140 km (114,419 mi) (114,425 mi) in 2002.[289]\n\nThe first investments in road infrastructure have given up in the 1920s, the government of Washington Luis, being pursued in the governments of Getúlio Vargas and Eurico Gaspar Dutra.[290] President Juscelino Kubitschek (1956–61), who designed and built the capital Brasília, was another supporter of highways. Kubitschek was responsible for the installation of major car manufacturers in the country (Volkswagen, Ford and General Motors arrived in Brazil during his rule) and one of the points used to attract them was, of course, support for the construction of highways. With the implementation of Fiat in 1976 ending an automobile market closed loop, from the end of the 1990s the country has received large foreign direct investments installing in its territory other major car manufacturers and utilities, such as Iveco, Renault, Peugeot, Citroen, Honda, Mitsubishi, Mercedes-Benz, BMW, Hyundai, Toyota among others.[291] Brazil is the seventh most important country in the auto industry.[292]\n\nBrazil's railway system has been declining since 1945, when emphasis shifted to highway construction. The total length of railway track was 30,875 km (19,185 mi) in 2002, as compared with 31,848 km (19,789 mi) in 1970. Most of the railway system belonged to the Federal Railroad Corporation RFFSA, which was privatized in 2007.[293] The São Paulo Metro was the first underground transit system in Brazil. The other metro systems are in Rio de Janeiro, Porto Alegre, Recife, Belo Horizonte, Brasília, Teresina and Fortaleza.\n\nThe country has an extensive rail network of 28,538 kilometres (17,733 miles) in length, the tenth largest network in the world.[294] Currently, the Brazilian government, unlike the past, seeks to encourage this mode of transport; an example of this incentive is the project of the Rio–São Paulo high-speed rail, that will connect the two main cities of the country to carry passengers.\n\nThere are about 2,500 airports in Brazil, including landing fields: the second largest number in the world, after the United States.[295] São Paulo-Guarulhos International Airport, near São Paulo, is the largest and busiest airport with nearly 20 million passengers annually, while handling the vast majority of commercial traffic for the country.[296]\n\nFor freight transport waterways are of importance, e.g. the industrial zones of Manaus can be reached only by means of the Solimões- Amazonas waterway (3,250 kilometres (2,020 miles) with 6 metres (20 feet) minimum depth). The country also has 50,000 kilometres (31,000 miles) of waterways.[294]\n\nCoastal shipping links widely separated parts of the country. Bolivia and Paraguay have been given free ports at Santos. Of the 36 deep-water ports, Santos, Itajaí, Rio Grande, Paranaguá, Rio de Janeiro, Sepetiba, Vitória, Suape, Manaus and São Francisco do Sul are the most important.[297] Bulk carriers have to wait up to 18 days before being serviced, container ships 36,3 hours on average.[298]\n\nWater supply and sanitation\nMain article: Water supply and sanitation in Brazil\n\nWater treatment plant in Coronel Fabriciano, Minas Gerais.\nAmong the achievements in the water supply and sanitation sector is an increase in access to water piped on premises from 79% to 92% between 1990 and 2010; an increase in access to Improved sanitation from 68% to 79% in the same period;[299] a functioning national system to finance water and sanitation infrastructure; a high level of cost recovery compared to most other developing countries; as well as a number of notable technical and financial innovations such as Condominial sewerage and an output-based subsidy for treated wastewater called PRODES.\n\nAmong the challenges is the still high number of poor Brazilians living in urban slums (Favela) and in rural areas without access to piped water or sanitation; water scarcity in the Northeast of Brazil; water pollution, especially in the South-East of the country; the low share of collected wastewater that is being treated (35% in 2000); and long-standing tensions between the federal, state and municipal governments about their respective roles in the sector.\n\nHealth\nMain article: Health in Brazil\n\nThe Albert Einstein Hospital in São Paulo is one of the most well-known health units in Brazil.\nThe Brazilian public health system, the National Health System (SUS), is managed and provided by all levels of government.[300] The public health services are universal and available to all citizens of the country for free. Nevertheless, millions of affluent Brazilians have private health care coverage.[301]\n\nAccording to the Brazilian Government, the most serious health problems are:[302]\n\nChildhood mortality: about 2.51% of childhood mortality, reaching 3.77% in the northeast region.\nMotherhood mortality: about 73.1 deaths per 100,000 born children in 2002.\nMortality by non-transmissible illness: 151.7 deaths per 100,000 inhabitants caused by heart and circulatory diseases, along with 72.7 deaths per 100,000 inhabitants caused by cancer.\nMortality caused by external causes (transportation, violence and suicide): 71.7 deaths per 100,000 inhabitants (14.9% of all deaths in the country), reaching 82.3 deaths in the southeast region.\nIn 2002, Brazil accounted for 40% of malaria cases in the Americas.[303] Nearly 99% are concentrated in the Legal Amazon Region, which is home to not more than 12% of the population.[303]\n\nEducation\nMain article: Education in Brazil\n\nClassroom in the main campus of the University of Campinas, São Paulo\nThe Federal Constitution and the Law of Guidelines and Bases of National Education determine that the Federal Government, States, Federal District and municipalities must manage and organize their respective education systems. Each of these public educational systems is responsible for its own maintenance, which manages funds as well as the mechanisms and funding sources. The constitution reserves 25% of the state budget and 18% of federal taxes and municipal taxes for education.[304]\n\nAccording to the IBGE, in 2011, the literacy rate of the population was 90.4%, meaning that 13 million (9.6% of population) people are still illiterate in the country; functional illiteracy has reached 21.6% of the population.[305] Illiteracy is highest in the Northeast, where 19.9% of the population is illiterate.[306]\n\nHigher education starts with undergraduate or sequential courses, which may offer different options of specialization in academic or professional careers. Depending on the choice, students can improve their educational background with courses of post-graduate studies or broad sense. To attend a higher education institution is required, by Law of Guidelines and Bases of Education, completing all levels of education suited to the needs of all students of teaching kindergarten, elementary and medium, provided the student does not hold any disability, whether physical, mental, visual or hearing. Of the top 10 universities in Latin America, eight are Brazilian, according QS World University Rankings.[307]\n\nMedia and communication\nMain article: Telecommunications in Brazil\nSee also: Media ownership in Brazil\n\nFormer President Dilma Rousseff at Jornal Nacional news program. Rede Globo is the second largest commercial television network of the world.[308]\nThe Brazilian press has its beginnings in 1808 with the arrival of the Portuguese royal family to Brazil, hitherto forbidden any activity of the press – was the publication of newspapers or books. The Brazilian press was officially born in Rio de Janeiro on 13 May 1808, with the creation of the Royal Printing, National Press by the Prince Regent Dom João.[309]\n\nThe Gazeta do Rio de Janeiro, the first newspaper published in the country, began to circulate on 10 September 1808.[310] The largest newspapers nowadays are Folha de S.Paulo (from the state of São Paulo), Super Notícia (Minas Gerais 296.799), O Globo (RJ 277.876) and O Estado de S. Paulo (SP 235.217).[311]\n\nRadio broadcasting began on 7 September 1922, with a speech by then President Pessoa, and was formalized on 20 April 1923 with the creation of \"Radio Society of Rio de Janeiro.\"[312]\n\nTelevision in Brazil began officially on 18 September 1950, with the founding of TV Tupi by Assis Chateaubriand.[313] Since then television has grown in the country, creating large public networks such as Globo, SBT, Record and Bandeirantes. Today it is the most important factor in popular culture of Brazilian society, indicated by research showing that as much as 67%[314][315] of the general population follow the same daily soap opera broadcast. Digital Television, using the SBTVD standard (based on the Japanese standard ISDB-T), was adopted 29 June 2006 and launched on 2 November 2007.[316] In May 2010, Brazil launched TV Brasil Internacional, an international television station, initially broadcasting to 49 countries.[317]\n\nDemographics\nMain articles: Demographics of Brazil and Brazilian people\nSee also: Immigration to Brazil and List of Brazilian states by population density\n\nPopulation density of Brazilian municipalities.\nThe population of Brazil, as recorded by the 2008 PNAD, was approximately 190 million[318] (22.31 inhabitants per square kilometre or 57.8/sq mi), with a ratio of men to women of 0.95:1[319] and 83.75% of the population defined as urban.[320] The population is heavily concentrated in the Southeastern (79.8 million inhabitants) and Northeastern (53.5 million inhabitants) regions, while the two most extensive regions, the Center-West and the North, which together make up 64.12% of the Brazilian territory, have a total of only 29.1 million inhabitants.\n\nThe first census in Brazil was carried out in 1872 and recorded a population of 9,930,478.[321] From 1880 to 1930, 4 million Europeans arrived.[322] Brazil's population increased significantly between 1940 and 1970, because of a decline in the mortality rate, even though the birth rate underwent a slight decline. In the 1940s the annual population growth rate was 2.4%, rising to 3.0% in the 1950s and remaining at 2.9% in the 1960s, as life expectancy rose from 44 to 54 years[323] and to 72.6 years in 2007.[324] It has been steadily falling since the 1960s, from 3.04% per year between 1950 and 1960 to 1.05% in 2008 and is expected to fall to a negative value of –0.29% by 2050[325] thus completing the demographic transition.[326]\n\nIn 2008, the illiteracy rate was 11.48%[327] and among the youth (ages 15–19) 1.74%. It was highest (20.30%) in the Northeast, which had a large proportion of rural poor.[328] Illiteracy was high (24.18%) among the rural population and lower (9.05%) among the urban population.[329]\n\nRace and ethnicity\nMain article: Race and ethnicity in Brazil\n\nMuseum of Immigration of the State of São Paulo in the neighborhood of Mooca, in São Paulo city.\nAccording to the National Research by Household Sample (PNAD) of 2008, 48.43% of the population (about 92 million) described themselves as White; 43.80% (about 83 million) as Pardo (brown), 6.84% (about 13 million) as Black; 0.58% (about 1.1 million) as Asian; and 0.28% (about 536 thousand) as Amerindian (officially called indígena, Indigenous), while 0.07% (about 130 thousand) did not declare their race.[330]\n\nIn 2007, the National Indian Foundation estimated that Brazil has 67 different uncontacted tribes, up from their estimate of 40 in 2005. Brazil is believed to have the largest number of uncontacted peoples in the world.[331]\n\nSince the arrival of the Portuguese in 1500, considerable miscegenation between Amerindians, Europeans, and Africans has taken place in all regions of the country (with European ancestry being dominant nationwide according to the vast majority of all autosomal studies undertaken covering the entire population, accounting for between 65% to 77%).[332][333][334][335]\n\nCircle frame.svg\nRace and ethnicity in Brazil[336][337][338]\n\n  White (47.7%)\n  Pardo (Multiracial) (43.1%)\n  Black (7.6%)\n  Asian (1.1%)\n  Natives (0.4%)\nBrazilian society is more markedly divided by social class lines, although a high income disparity is found between race groups, so racism and classism can be conflated. Socially significant closeness to one racial group is taken in account more in the basis of appearance (phenotypes) rather than ancestry, to the extent that full siblings can pertain to different \"racial\" groups.[339] Socioeconomic factors are also significant, because a minority of pardos are likely to start declaring themselves White or Black if socially upward.[340] Skin color and facial features do not line quite well with ancestry (usually, Afro-Brazilians are evenly mixed and European ancestry is dominant in Whites and pardos with a significant non-European contribution, but the individual variation is great).[335][341][342][343]\n\nThe brown population (officially called pardo in Portuguese, also colloquially moreno)[344][345] is a broad category that includes caboclos (assimilated Amerindians in general, and descendants of Whites and Natives), mulatos (descendants of primarily Whites and Afro-Brazilians) and cafuzos (descendants of Afro-Brazilians and Natives).[344][345][346][347][348] People of considerable Amerindian ancestry form the majority of the population in the Northern, Northeastern and Center-Western regions.[349]\n\nHigher percents of Blacks, mulattoes and tri-racials can be found in the eastern coast of the Northeastern region from Bahia to Paraíba[348][350] and also in northern Maranhão,[351][352] southern Minas Gerais[353] and in eastern Rio de Janeiro.[348][353] From the 19th century, Brazil opened its borders to immigration. About five million people from over 60 countries migrated to Brazil between 1808 and 1972, most of them of Portuguese, Italian, Spanish, German, Ukrainian, Polish, Jewish, Russian, Chinese, Japanese, and Arab origin.[354][355]\n\nReligion\nMain article: Religion in Brazil\nFurther information: Roman Catholicism in Brazil and Protestantism in Brazil\nReligion in Brazil (2010 Census)\nReligion\t\t\tPercent\t\nRoman Catholicism\t\n  \n64.6%\nProtestantism\t\n  \n22.2%\nNo religion\t\n  \n8.0%\nSpiritism\t\n  \n2.0%\nOthers\t\n  \n3.2%\nReligion in Brazil formed from the meeting of the Catholic Church with the religious traditions of enslaved African peoples and indigenous peoples.[356] This confluence of faiths during the Portuguese colonization of Brazil led to the development of a diverse array of syncretistic practices within the overarching umbrella of Brazilian Catholic Church, characterized by traditional Portuguese festivities,[357] and in some instances, Allan Kardec's Spiritism (a religion which incorporates elements of spiritualism and Christianity). Religious pluralism increased during the 20th century,[358] and the Protestant community has grown to include over 22% of the population.[359] The most common Protestant denominations are Pentecostal and Evangelical ones. Other Protestant branches with a notable presence in the country include the Baptists, Seventh-day Adventists, Lutherans and the Reformed tradition.[360]\n\n\nThe Christ the Redeemer statue in Rio de Janeiro is one of the most famous religious statues worldwide[362][363]\n\nBasilica of the National Shrine of Our Lady of Aparecida in Aparecida do Norte, São Paulo, is the second largest Catholic church in the world[361]\nRoman Catholicism is the country's predominant faith. Brazil has the world's largest Catholic population.[364] According to the 2000 Demographic Census (the PNAD survey does not inquire about religion), 73.57% of the population followed Roman Catholicism; 15.41% Protestantism; 1.33% Kardecist spiritism; 1.22% other Christian denominations; 0.31% Afro-Brazilian religions; 0.13% Buddhism; 0.05% Judaism; 0.02% Islam; 0.01% Amerindian religions; 0.59% other religions, undeclared or undetermined; while 7.35% have no religion.[365]\n\nHowever, in the last ten years Protestantism, particularly Pentecostalism and Evangelicalism, has spread in Brazil, while the proportion of Catholics has dropped significantly.[366] After Protestantism, individuals professing no religion are also a significant group, exceeding 7% of the population as of the 2000 census. The cities of Boa Vista, Salvador, and Porto Velho have the greatest proportion of Irreligious residents in Brazil. Teresina, Fortaleza, and Florianópolis were the most Roman Catholic in the country.[367] Greater Rio de Janeiro, not including the city proper, is the most irreligious and least Roman Catholic Brazilian periphery, while Greater Porto Alegre and Greater Fortaleza are on the opposite sides of the lists, respectively.[367]\n\nUrbanization\nMain articles: List of largest cities in Brazil and Municipalities of Brazil\nAccording to IBGE (Brazilian Institute of Geography and Statistics) urban areas already concentrate 84.35% of the population, while the Southeast region remains the most populated one, with over 80 million inhabitants.[368] The largest urban agglomerations in Brazil are São Paulo, Rio de Janeiro, and Belo Horizonte – all in the Southeastern Region – with 21.1, 12.3, and 5.1 million inhabitants respectively.[369][370][371] The majority of state capitals are the largest cities in their states, except for Vitória, the capital of Espírito Santo, and Florianópolis, the capital of Santa Catarina.[372]\n\n  v t e\nLargest urban agglomerations in Brazil\n2016 Brazilian Institute of Geography and Statistics estimates[369][373][374]\nRank\tName\tState\tPop.\tRank\tName\tState\tPop.\t\nSão Paulo\nSão Paulo\nRio de Janeiro\nRio de Janeiro\t1\tSão Paulo\tSão Paulo\t21,166,641\t11\tBelém\tPará\t2,142,147\tBelo Horizonte\nBelo Horizonte\nRecife\nRecife\n2\tRio de Janeiro\tRio de Janeiro\t12,340,927\t12\tManaus\tAmazonas\t2,094,391\n3\tBelo Horizonte\tMinas Gerais\t5,107,020\t13\tCampinas\tSão Paulo\t2,082,372\n4\tRecife\tPernambuco\t3,995,949\t14\tVitória\tEspírito Santo\t1,813,977\n5\tBrasília\tFederal District\t3,908,762\t15\tBaixada Santista\tSão Paulo\t1,689,184\n6\tPorto Alegre\tRio Grande do Sul\t3,879,783\t16\tSão José dos Campos\tSão Paulo\t1,558,233\n7\tSalvador\tBahia\t3,835,024\t17\tSão Luís\tMaranhão\t1,409,162\n8\tFortaleza\tCeará\t3,567,037\t18\tNatal\tRio Grande do Norte\t1,333,153\n9\tCuritiba\tParaná\t3,354,869\t19\tMaceió\tAlagoas\t1,222,962\n10\tGoiânia\tGoiás\t2,313,886\t20\tJoão Pessoa\tParaíba\t1,155,808\nLanguage\nMain articles: Languages of Brazil, Portuguese language, Brazilian Portuguese, and List of endangered languages in Brazil\n\nMuseum of the Portuguese Language in São Paulo city, São Paulo.\n\nOca of the Kamayurá people, Xingu Indigenous Park, Mato Grosso\nThe official language of Brazil is Portuguese[375] (Article 13 of the Constitution of the Federal Republic of Brazil), which almost all of the population speaks and is virtually the only language used in newspapers, radio, television, and for business and administrative purposes. The most famous exception to this is a strong sign language law that was passed by the National Congress of Brazil. Legally recognized in 2002,[376] the law was regulated in 2005.[377] The law mandates the use of the Brazilian Sign Language, more commonly known by its Portuguese acronym LIBRAS, in education and government services. The language must be taught as a part of the education and speech and language pathology curricula. LIBRAS teachers, instructors and translators are recognized professionals. Schools and health services must provide access (\"inclusion\") to deaf people.[378]\n\nBrazilian Portuguese has had its own development, mostly similar to 16th-century Central and Southern dialects of European Portuguese[379] (despite a very substantial number of Portuguese colonial settlers, and more recent immigrants, coming from Northern regions, and in minor degree Portuguese Macaronesia), with a few influences from the Amerindian and African languages, especially West African and Bantu restricted to the vocabulary only.[380] As a result,[citation needed] the language is somewhat different, mostly in phonology, from the language of Portugal and other Portuguese-speaking countries (the dialects of the other countries, partly because of the more recent end of Portuguese colonialism in these regions, have a closer connection to contemporary European Portuguese). These differences are comparable to those between American and British English.[380]\n\nBrazil is the only Portuguese-speaking nation in the Americas, making the language an important part of Brazilian national identity and giving it a national culture distinct from those of its Spanish-speaking neighbors.[381]\n\n\nPomerode, Santa Catarina, is one of the municipalities with a cooficial language. In this region, Hunsrückisch and Pomeranian, German dialects, are two of the minor languages (see Brazilian German).\nIn 1990, the Community of Portuguese Language Countries (CPLP), which included representatives from all countries with Portuguese as the official language, reached an agreement on the reform of the Portuguese orthography to unify the two standards then in use by Brazil on one side and the remaining lusophone countries on the other. This spelling reform went into effect in Brazil on 1 January 2009. In Portugal, the reform was signed into law by the President on 21 July 2008 allowing for a 6-year adaptation period, during which both orthographies will co-exist. The remaining CPLP countries are free to establish their own transition timetables.[382]\n\nMinority languages are spoken throughout the nation. One hundred and eighty Amerindian languages are spoken in remote areas and a significant number of other languages are spoken by immigrants and their descendants.[380] In the municipality of São Gabriel da Cachoeira, Nheengatu (a currently endangered South American creole language – or an 'anti-creole', according to some linguists – with mostly Indigenous Brazilian languages lexicon and Portuguese-based grammar that, together with its southern relative língua geral paulista, once was a major lingua franca in Brazil[citation needed], being replaced by Portuguese only after governmental prohibition led by major political changes)[excessive detail?], Baniwa and Tucano languages had been granted co-official status with Portuguese.[383]\n\nThere are significant communities of German (mostly the Brazilian Hunsrückisch, a High German language dialect) and Italian (mostly the Talian, a Venetian dialect) origins in the Southern and Southeastern regions, whose ancestors' native languages were carried along to Brazil, and which, still alive there, are influenced by the Portuguese language.[384][385] Talian is officially a historic patrimony of Rio Grande do Sul,[386] and two German dialects possess co-official status in a few municipalities.[387]\n\nLearning at least one second language (generally English or Spanish) is mandatory for all the 12 grades of the mandatory education system (primary and secondary education, there called ensino fundamental and ensino médio respectively). Brazil is the first country in South America to offer Esperanto to secondary students.[388]\n\nCulture\n\nInterior of the São Francisco Church and Convent in Salvador, Bahia, one of the richest expressions of Brazilian baroque.\nMain article: Culture of Brazil\nThe core culture of Brazil is derived from Portuguese culture, because of its strong colonial ties with the Portuguese empire.[389] Among other influences, the Portuguese introduced the Portuguese language, Roman Catholicism and colonial architectural styles. The culture was, however, also strongly influenced by African, indigenous and non-Portuguese European cultures and traditions.[390]\n\nSome aspects of Brazilian culture were influenced by the contributions of Italian, German and other European as well Japanese, Jewish and Arab immigrants who arrived in large numbers in the South and Southeast of Brazil.[391] The indigenous Amerindians influenced Brazil's language and cuisine; and the Africans influenced language, cuisine, music, dance and religion.[392]\n\nBrazilian art has developed since the 16th century into different styles that range from Baroque (the dominant style in Brazil until the early 19th century)[393][394] to Romanticism, Modernism, Expressionism, Cubism, Surrealism and Abstractionism. Brazilian cinema dates back to the birth of the medium in the late 19th century and has gained a new level of international acclaim since the 1960s.[395]\n\nArchiteture\nMain article: Architecture of Brazil\n\nThe Museum of the Inconfidência in Minas Gerais, an example of Portuguese colonial architecture.\nThe architecture of Brazil is influenced by Europe, especially Portugal. It has a history that goes back 500 years to the time when Pedro Cabral discovered Brazil in 1500. Portuguese colonial architecture was the first wave of architecture to go to Brazil.[396] It is the basis for all Brazilian architecture of later centuries.[397] In the 19th century during the time of the Empire of Brazil, Brazil followed European trends and adopted Neoclassical and Gothic Revival architecture. Then in the 20th century especially in Brasilia, Brazil experimented with Modernist architecture.\n\nThe colonial architecture of Brazil dates to the early 16th century when Brazil was first explored, conquered and settled by the Portuguese. The Portuguese built architecture familiar to them in Europe in their aim to colonise Brazil. They built Portuguese colonial architecture which included Churches, civic architecture including houses and forts in Brazilian cities and the countryside. During 19th Century Brazilian architecture saw the introduction of more European styles to Brazil such as Neoclassical and Gothic Revival architecture. This was usually mixed with Brazilian influences from their own heritage which produced a unique form of Brazilian architecture. In the 1950s the modernist architecture was introduced when Brasilia was built as new federal capital in the interior of Brazil to help develop the interior. The architect Oscar Niemeyer idealized and built Government buildings, Churches and civic buildings was constructed in the modernist style.[398][399]\n\nMusic\nMain article: Music of Brazil\n\nHeitor Villa-Lobos, one of the great Latin composers\nThe music of Brazil was formed mainly from the fusion of European and African elements.[400] Until the nineteenth century, Portugal was the gateway to most of the influences that built Brazilian music, although many of these elements were not of Portuguese origin, but generally European. The first was José Maurício Nunes Garcia, author of sacred pieces with influence of Viennese classicism.[401] The major contribution of the African element was the rhythmic diversity and some dances and instruments that had a bigger role in the development of popular music and folk, flourishing especially in the twentieth century.[400]\n\nPopular music since the late eighteenth century began to show signs of forming a characteristically Brazilian sound, with samba considered the most typical and on the UNESCO cultural heritage list.[402] Maracatu and Afoxê are two Afro-Brazilian music traditions that have been popularized by their appearance in the annual Brazilian Carnivals.[403] The sport of capoeira is usually played with its own music referred to as capoeira music, which is usually considered to be a call-and-response type of folk music.[404]\n\nChoro is a very popular music instrumental style. Its origins are in 19th-century Rio de Janeiro. In spite of the name, the style often has a fast and happy rhythm, characterized by virtuosity, improvisation, subtle modulations and full of syncopation and counterpoint.[405] Bossa nova is also a well-known style of Brazilian music developed and popularized in the 1950s and 1960s.[406] The phrase \"bossa nova\" means literally \"new trend\".[407] A lyrical fusion of samba and jazz, bossa nova acquired a large following starting in the 1960s.[408]\n\n\nThe Rio Carnival, a type of samba parade.\nLiterature\n\nMachado de Assis, poet and novelist, founder of the Brazilian Academy of Letters.\nMain article: Brazilian literature\nBrazilian literature dates back to the 16th century, to the writings of the first Portuguese explorers in Brazil, such as Pêro Vaz de Caminha, filled with descriptions of fauna, flora and commentary about the indigenous population that fascinated European readers.[409]\n\nBrazil produced significant works in Romanticism – novelists like Joaquim Manuel de Macedo and José de Alencar wrote novels about love and pain. Alencar, in his long career, also treated indigenous people as heroes in the Indigenist novels O Guarani, Iracema and Ubirajara.[410] Machado de Assis, one of his contemporaries, wrote in virtually all genres and continues to gain international prestige from critics worldwide.[411][412][413]\n\nThe Brazilian Modernism, evidenced by the Week of Modern Art in 1922, was concerned with a nationalist avant-garde literature,[414] while Post-Modernism brought a generation of distinct poets like João Cabral de Melo Neto, Carlos Drummond de Andrade, Vinicius de Moraes, Cora Coralina, Graciliano Ramos, Cecília Meireles, and internationally known writers dealing with universal and regional subjects like Jorge Amado, João Guimarães Rosa, Clarice Lispector and Manuel Bandeira.[415][416][417]\n\nCuisine\nMain article: Brazilian cuisine\nSee also: List of Brazilian dishes\n\nBrigadeiro is a national candy and one most and is recognized as one of the main dishes of the Brazilian cuisine.\n\nFeijoada is a typical Brazilian dish\nBrazilian cuisine varies greatly by region, reflecting the country's varying mix of indigenous and immigrant populations. This has created a national cuisine marked by the preservation of regional differences.[418] Examples are Feijoada, considered the country's national dish;[419] and regional foods such as vatapá, moqueca, polenta and acarajé.[420]\n\nThe national beverage is coffee and cachaça is Brazil's native liquor. Cachaça is distilled from sugar cane and is the main ingredient in the national cocktail, Caipirinha.[421]\n\nA typical meal consists mostly of rice and beans with beef, salad, french fries and a fried egg.[422] Often, it's mixed with cassava flour (farofa). Fried potatoes, fried cassava, fried banana, fried meat and fried cheese are very often eaten in lunch and served in most typical restaurants.[423] Popular snacks are pastel (a fired pastry); coxinha (a variation of chicken croquete); pão de queijo (cheese bread and cassava flour / tapioca); pamonha (corn and milk paste); esfirra (A variation of Lebanese pastry); kibbeh (from Arabic cuisine); empanada (pastry) and empada, little salt pies filled with shrimps or heart of palm.\n\nBrazil has a variety of candies such as brigadeiros (chocolate fudge balls), cocada (a coconut sweet), beijinhos (coconut truffles and clove) and romeu e julieta (cheese with a guava jam known as goiabada). Peanuts are used to make paçoca, rapadura and pé-de-moleque. Local common fruits like açaí, cupuaçu, mango, papaya, cocoa, cashew, guava, orange, lime, passionfruit, pineapple, and hog plum are turned in juices and used to make chocolates, popsicles and ice cream.[424]\n\nCinema\n\nGramado Film Festival\n\nFernando Meirelles\nMain article: Cinema of Brazil\nThe Brazilian film industry began in the late 19th century, during the early days of the Belle Époque. While there were national film productions during the early 20th century, American films such as Rio the Magnificent were made in Rio de Janeiro to promote tourism in the city.[425] The films Limite (1931) and Ganga Bruta (1933), the latter being produced by Adhemar Gonzaga through the prolific studio Cinédia, were poorly received at release and failed at the box office, but are acclaimed nowadays and placed among the finest Brazilian films of all time.[426] The 1941 unfinished film It's All True was divided in four segments, two of which were filmed in Brazil and directed by Orson Welles; it was originally produced as part of the United States' Good Neighbor Policy during Getúlio Vargas' Estado Novo government.\n\nDuring the 1960s the Cinema Novo movement rose to prominence with directors such as Glauber Rocha, Nelson Pereira dos Santos, Paulo Cesar Saraceni and Arnaldo Jabor. Rocha's films Deus e o Diabo na Terra do Sol (1964) and Terra em Transe (1967) are considered to be some of the greatest and most influential in Brazilian film history.[427]\n\nDuring the 1990s Brazil saw a surge of critical and commercial success with films such as O Quatrilho (Fábio Barreto, 1995), O Que É Isso, Companheiro? (Bruno Barreto, 1997) and Central do Brasil (Walter Salles, 1998), all of which were nominated for the Academy Award for Best Foreign Language Film, the latter receiving a Best Actress nomination for Fernanda Montenegro. The 2002 crime film City of God, directed by Fernando Meirelles, was critically acclaimed, scoring 90% on Rotten Tomatoes,[428] being placed in Roger Ebert's Best Films of the Decade list[429] and receiving four Academy Award nominations in 2004, including Best Director. Notable film festivals in Brazil include the São Paulo and Rio de Janeiro International Film Festivals and the Gramado Festival.\n\nTheatre\n\nSão Paulo Municipal Theater\n\nRio de Janeiro Municipal Theater\nThe theatre in Brazil has its origins in the period of Jesuit expansion when theater was used for the dissemination of Catholic doctrine in the 16th century. in the 17th and 18th centuries the first dramatists who appeared on the scene of European derivation was for court or private performances.[430] During the 19th century, dramatic theater gained importance and thickness, whose first representative was Luis Carlos Martins Pena (1813–1848), capable of describing contemporary reality. Always in this period the comedy of costume and comic production was imposed. Significant, also in the nineteenth century, was also the playwright Antônio Gonçalves Dias.[431] There were also numerous operas and orchestras. The Brazilian conductor Antônio Carlos Gomes became internationally known with operas like Il Guarany. At the end of century 19th century orchestrated dramaturgias became very popular and were accompanied of songs of famous artists like the conductress Chiquinha Gonzaga.[432]\n\nAlready in the early 20th century there was the presence of theaters, enterpreneurs and actor companies, but paradoxically the quality of the products staggered, and only in 1940 the Brazilian theater received a boost of renewal thanks to the action of Paschoal Carlos Magno and his student's theater, the comedians group and the Italian actors Adolfo Celi, Ruggero Jacobbi and Aldo Calvo, founders of the Teatro Brasileiro de Comedia. From the 1960s it was attended by a theater dedicated to social and religious issues and to the flourishing of schools of dramatic art. The most prominent authors at this stage were Jorge Andrade and Ariano Suassuna.[431]\n\nVisual arts\nMain article: Painting in Brazil\n\nAbaporu by Tarsila do Amaral. Oil on canvas, 1928\nBrazilian painting emerged in the late 16th century,[433] influenced by Baroque, Rococo, Neoclassicism, Romanticism, Realism, Modernism, Expressionism, Surrealism, Cubism and Abstracionism making it a major art style called Brazilian academic art.[434][435] The Missão Artística Francesa (French Artistic Mission) arrived in Brazil in 1816 proposing the creation of an art academy modeled after the respected Académie des Beaux-Arts, with graduation courses both for artists and craftsmen for activities such as modeling, decorating, carpentry and others and bringing artists like Jean-Baptiste Debret.[435] Upon the creation of the Imperial Academy of Fine Arts, new artistic movements spread across te country during the 19th century and later the event called Week of Modern Art broke definitely with academic tradition in 1922 and started a nationalist trend which was influenced by modernist arts. Among the best-known Brazilian painters are Ricardo do Pilar and Manuel da Costa Ataíde (baroque and rococo), Victor Meirelles, Pedro Américo and Almeida Junior (romanticism and realism), Anita Malfatti, Ismael Nery, Lasar Segall, Emiliano di Cavalcanti, Vicente do Rego Monteiro, and Tarsila do Amaral (expressionism, surrealism and cubism), Aldo Bonadei, José Pancetti and Cândido Portinari (modernism).[436]\n\nSports\n\nStamp for the victory of the Brazilian team at the 1970 FIFA World Cup\n\nSenna, one of the biggest names in F1's history.\nMain article: Sport in Brazil\nThe most popular sport in Brazil is football.[437] The Brazilian men's national team is ranked among the best in the world according to the FIFA World Rankings, and has won the World Cup tournament a record five times.[438][439]\n\nVolleyball, basketball, auto racing, and martial arts also attract large audiences. The Brazil men's national volleyball team, for example, currently holds the titles of the World League, World Grand Champions Cup, World Championship and the World Cup.\n\nSome sport variations have their origins in Brazil: beach football,[440] futsal (indoor football)[441] and footvolley emerged in Brazil as variations of football. In martial arts, Brazilians developed Capoeira,[442] Vale tudo,[443] and Brazilian Jiu-Jitsu.[444]\n\nIn auto racing, three Brazilian drivers have won the Formula One world championship eight times.[445][446][447]\n\nBrazil has hosted several high-profile international sporting events, like the 1950 FIFA World Cup[448] and recently has hosted the 2014 FIFA World Cup.[449] The São Paulo circuit, Autódromo José Carlos Pace, hosts the annual Grand Prix of Brazil.[450]\n\nSão Paulo organized the IV Pan American Games in 1963, and Rio de Janeiro hosted the XV Pan American Games in 2007.[451] On 2 October 2009, Rio de Janeiro was selected to host the 2016 Olympic Games and 2016 Paralympic Games, making it the first South American city to host the games[452] and second in Latin America, after Mexico City. Furthermore, the country hosted the FIBA Basketball World Cups in 1954 and 1963. At the 1963 event, the Brazil national basketball team won one of its two world championship titles.[453]\n\nNational holidays\nDate\tLocal name\tName\tObservation\n1 January\tConfraternização Mundial\tNew Year's Day\tBeginning of the calendar year\n21 April\tTiradentes\tTiradentes\tIn honor of the martyr of the Minas Conspiracy\n1 May\tDia do Trabalhador\tLabor Day\tTribute to all workers\n7 September\tIndependência\tIndependence of Brazil\tProclamation of Independence against Portugal\n12 October\tNossa Senhora Aparecida\tOur Lady of Aparecida\tPatroness of Brazil\n2 November\tFinados\tAll Souls' Day\tDay of remembrance for the dead\n15 November\tProclamação da República\tProclamation of the Republic\tTransformation of Empire into Republic\n25 December\tNatal\tChristmas\tTraditional Christmas celebration\n",
			"date_added": 1497705236622,
			"slug": "brazil"
		},
		{
			"id": "929f15a0-535e-11e7-82fe-77cedb5e47e2",
			"body": "Bitcoin Core is a reference client of bitcoin. Initially, the software was published by Satoshi Nakamoto under the name Bitcoin, then Bitcoin-Qt and later renamed to Bitcoin Core.[1][not in citation given] It is also known as the Satoshi client. It is a full client used by bitcoin nodes that create the bitcoin network. Through the changes to Bitcoin Core, its developers make changes to the underlying bitcoin protocol. As of 2016, Bitcoin Core repositories are maintained by Wladimir J. van der Laan.\n\nThe MIT Digital Currency Initiative funds some of development of Bitcoin Core. The project also maintains the cryptography library libsecp256k1.\n\nFeatures\nIt includes a transaction verification engine and connects to the bitcoin network as a full node. Moreover, a wallet, which can be used to transfer funds, is included by default. The wallet allows for the sending and receiving of bitcoins. It does not facilitate the buying or selling of bitcoin. It allows users to generate QR codes to receive payment.\n\nThe software validates the entire blockchain, which includes all bitcoin transactions ever. This distributed ledger which has reached more than 110 gigabytes in size must be downloaded or synchronised before full participation of the client may occur. A command line-based daemon with a JSON-RPC interface, bitcoind, is bundled with Bitcoin Core. It provides access to testnet, a global testing environment that imitates the bitcoin main network or Mainnet. It uses an alternative blockchain where real bitcoin are not used and the blockchain cannot be adversely affected. Regtest or Regression Test Mode creates a private blockchain which is used as a local testing environment. bitcoin-cli is the third program included. It allows users to send RPC commands to bitcoind.\n\nCheckpoints have been hard coded into the client. These maintain data integrity by keeping a part of the block chain data in the source code where it is able to be compared to the blockchain when its downloading is complete.[9] A one megabyte block size limit was added in 2010 by Satoshi Nakamoto as a temporary anti-spam measure. This limited the maximum network capacity to about three transactions per second. Since then, some minor changes to the software have improved network capacity incrementally. A network alert system was included by Satoshi Nakamoto as a way of informing users of important news regarding bitcoin. In November 2016 it was retired. It had become obsolete as news on bitcoin is now widely disseminated. Miners are able to signal their decision on the incorporation of new features by voting.\n\nA powerful scripting language is used to define transactions. This Forth-like language is part of one of three distinct application programming interfaces. It can enable various transaction parameters. The script uses reverse Polish notation for validation. ScriptPubKey is used to \"lock\" transactions based on a set of future conditions. scriptSig is used to meet these conditions or \"unlock\" a transaction. Operations on the data are performed by various OP_Codes. Two stacks are used - main and alt. Looping is forbidden.\n\nDevelopment[edit]\nThe original creator of the bitcoin client has described their approach to the software's authorship as it being written first to prove to themselves that the concept of purely peer-to-peer electronic cash was valid and that a paper with solutions could be written. While the majority of peers on the network may use Bitcoin Core, the developers' influence on bitcoin is limited by the choice of which implementation people voluntarily decide to use. The lead developer is Wladimir J. van der Laan, who took over the role on 8 April 2014. Gavin Andresen was the former lead maintainer for the software client. Andresen left the role of lead developer for bitcoin to work on the strategic development of its technology.[15] He left because he didn't want to get involved with trivial decision-making.\n\nThe code was originally stored at Sourceforge before being available on GitHub. Because there is no formal structure, development is based around Bitcoin Improvement Proposals or BIPs, which are similar to Request for Comments. Public mailing lists are used to vet initial expressions of ideas. If enough support is displayed a BIP document is written. This is the standard for sharing ideas and gaining community feedback on improving bitcoin and was initiated by Amir Taaki in 2011.\n\nThe roadmap for the client includes data link layer solutions for scalability. Core developers view bitcoin as a settlement layer. Bitcoin Core is one of several full node client implementations that are actively deployed. Alternatives include Bitcoin XT, Bitcoin Classic and Bitcoin Unlimited. All are derived from Bitcoin Core and contain implementation of hard fork proposals. These software forks allow bitcoin miners to demonstrate their vote on the direction of bitcoin's development.\n\nExternal video\n Visualization of code changes during 2015\nCore developers prefer to gradually, not rapidly enlarge bitcoin's transaction handling capabilities. Core developers believe in the premise that barriers to running a full node should be kept low as possible so that the blockchain layer at the very lowest level remains highly decentralized.[18] Core has reputation for tending for being risk averse. This is demonstrated by the reluctance of Core developers to increase the network’s ability to process transactions.\n\nVersion history\nBitcoin 0.1 was released on 9 January 2009 by Satoshi Nakamoto with only Windows supported.[20] This was followed by some minor bug fixing versions. On 16 December 2009 Bitcoin 0.2 was released. It included a Linux version for the first time and made use of multi-core processors for mining. In version 0.3.2 Nakamoto included checkpoints as a safeguard. After the release of version 0.3.9 Satoshi Nakamoto left the project[20] and shortly after stopped communicating on online forums. By this time development of the software was being undertaken by a wide group of independent developers which is referred to as a community, many of whom had various ideas on how to improve bitcoin.[20]\n\nBetween 2011 and 2013 new versions of the software were released at Bitcoin.org. Developers wanted to differentiate themselves as creators of software rather than advocates for bitcoin and so now maintain bitcoincore.org for just the software.\n\nBitcoin-Qt version 0.5.0 was released on 1 November 2011. It introduced a front end that uses the Qt user interface toolkit. The software previously used Berkeley DB for database management. Developers switched to LevelDB in release 0.8 in order to reduce blockchain synchronization time. The update to this release resulted in a minor blockchain fork on the 11 March 2013. The fork was resolved shortly afterwards. Seeding nodes through IRC was discontinued in version 0.8.2. In this release transaction fees, also known as relay fees, were reduced from 50,000 satoshis to 10,000 satoshis. From version 0.9.0 the software was renamed to Bitcoin Core. Transaction fees were reduced again by a factor of ten as a means to encourage microtransactions. Although Bitcoin Core does not use OpenSSL for the operation of the network, the software did use OpenSSL for remote procedure calls. Version 0.9.1 was released to remove the network's vulnerability to the Heartbleed bug.\n\nRelease 0.10 was made public on 16 February 2015. It introduced a consensus library which gave programmers easy access to the rules governing consensus on the network. The developers have stated that for consensus on soft forks a super-majority of 95% of hash power is required for agreement. In version 0.11.2 developers added a new feature which allowed transactions to be made unspendable until a specific time in the future.[28] Bitcoin Core 0.12.1 was released on April 15, 2016 and enabled multiple soft forks to occur concurrently. Around 100 contributors worked on Bitcoin Core 0.13.0 which was released on 23 August 2016. It introduced more than ten significant changes.\n\nIn July 2016, the CheckSequenceVerify soft fork activated.\n\nIn October 2016, Bitcoin Core’s 0.13.1 release featured a soft fork that included a scaling improvement aiming to optimize the bitcoin blocksize. 35 developers were engaged to deploy the patch which was originally finalised in April. This release featured Segregated Witness (SegWit) which aimed to place downward pressure on transaction fees as well as increase the maximum transaction capacity of the network.[34] Estimates place the total block size using SegWit at about 1.7 mb. The 0.13.1 release endured extensive testing and research leading to some delays in its release date. Segwit aims to prevent various forms of transaction malleability. Segwit cannot be activated until ~95% of miners using Bitcoin Core concurrently agree to its use.",
			"date_added": 1497705131002,
			"slug": "bitcoin-core"
		}
	]
}