{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1541269115_1PKq2Vg46orbwHD1pW1hVeArcDskWJH3BM": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1540892566_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 1,
				"body": "Hiya, Sure thing, I will take a look at your site, and seed it for you\n\nCheers\nTimmo",
				"added": 1541257087
			}
		],
		"1541269115_1PKq2Vg46orbwHD1pW1hVeArcDskWJH3BM": [
			{
				"comment_id": 2,
				"body": "Sounds like a great idea",
				"added": 1541278927
			},
			{
				"comment_id": 3,
				"body": "Hope you don't mind but I grabbed that Video from YT and re-posted it to KopyKat.\n\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1541280252_1QCMg6ZqmUAFd1MGyc2g2j6NDep2GANfAC\n\nI think the idea is excellent, and what better place to do than ZeroNet. Why don't you just go ahead an do it. Perhaps start by cloning ZeroWiki, and creating  ZeroCircuits Wiki, Setup some videos on KopyKat and link your channel to the Wiki. Make some post onto ZeroMe and see if you can get some traction in the community.\n\nYou can count me in for sure.\n\nBest Wishes and Good Luck",
				"added": 1541280781
			},
			{
				"comment_id": 4,
				"body": "@invalidaccess - That's the great thing about ZeroNet, you don't need to do ANY web stuff its all done for you.\nAll you need to do is this :-\n\nGo to ZeroNet Home page, the menu of sites on the left notice that each entry has a tiny little menu on the very right ( 3 vertical dots ) Click on this, and you see various controls. For most site entries there is a 'Clone' function.\nThere is one for ZeroWiki. Use this to create a clone of the ZeroWiki and call it Zero Circuits. Job Done! it really is that simple.",
				"added": 1541329371
			}
		],
		"1541360464_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ": [
			{
				"comment_id": 5,
				"body": "So.. I just took a look at FreeNet and I see that it's using Java RE. I don't think that's a good solution. However their website is nice a clear, and their marketing and promotion is in reasonable shape.\n\nIn regard to mapping localhost, or 127.0.0.1 this could be done by patching an entry to the hosts file on Linux, and MacOSX. I think it can also be done on Windows, but I'm not sure how to do that. \n\nThe potential for ZeroNet is great right now, especially with all the Censoring of Twitter, FB, etc... What's required is lots, and lots of promotion, marketing, press releases.\n\nIt's all about making as much noise as possible, and promoting ZeroNet everywhere we can on the Clearnet",
				"added": 1541448674
			}
		],
		"1546024584_1JFAYb8MxcPAMjUbMopSKA1gVKSWs6d2HZ": [
			{
				"comment_id": 6,
				"body": "Hi there @brutusthebritish good to see others are feeling the same as me. The thing to note is that it is your machine that invokes the connection to network, which makes it much harder to block with a firewall. Once you factor in Tor networks and VPN's then the governments have Zero chance of shutting this down.",
				"added": 1560240357
			}
		]
	},
	"comment_vote": {
		"286_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}