{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1560227102,
			"title": "War with Iran",
			"body": "It looks like the handlers of the American government are pushing their most loyal servant closer and closer to war with Iran. Do you think it will actually happen? I like to read Abdel Bari Atwan's analysis of the situation: https://bariatwan.com/english/deception-or-confusion/ as a good quick overview.",
			"added": 1560227101
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1559682182_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 1,
				"body": "> [bananon](#comment_18_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW): Reply\nI think this green new deal bullshit is horribly overblown by both sides of the debate. AOC is just a careerist who loves to be in the spotlight. If you read her actual proposal (https://www.congress.gov/116/bills/hres109/BILLS-116hres109ih.pdf) you'll find it isn't anything more than empty posturing. It should neither enrage those foolish enough to believe climate change is not a threat nor be a source of assurance those who believe it is.",
				"added": 1560227325
			}
		],
		"1560227102_1D7aG9GPhaCuEEiGRQpUZGZkMQVEGRga9H": [
			{
				"comment_id": 2,
				"body": "I don't believe that profit is a serious motivator for the Americans. It seems to me they really exist solely to die for Israel. I'm sure Iran would have gladly played nice in the interantional economy if America had kept up it's end of the nuclear deal. This would have allowed america to accomplish it's strategic interest, stable oil output, with lower troop commitment and simultaneously freed up soldiers to use to threaten China. I don't advocate for aggression either but that seems to me to be something that is legitimately in the interest of the US. War with Iran seems to only be in the interest of Israel.\n> [jaka](#comment_1_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD): Excuse in this post-truth era is just f*rt, you can't believe everything gov said.IMHO if there's any people involved in this war, it's only Saudi & Iran. These 2 big boy are always against each others (sunni-shia | oil monopoly, etc), US are only interested in profit (if any, let the war spread far to control vital pipeline) and mitigate collateral damage to their dollars (oil price too high, collapse will be faster). Some of my patron, geopolitics savy said, US actually no need to involve deeply in this fight. Let those two fight by themself, it's never involving USA to begin with. It only happens that \"Jared Al Arabia\" trumps son-in-law known tightly connected to Saudi via Israel connection. Arab Saudi is only a shishkebab they're too lazy and only count on their pocket money in contrast with Persian Iran which is hardwork-oriented, because many sanctions given to them by US. [...]",
				"added": 1560550500
			}
		]
	},
	"comment_vote": {}
}