{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1607730992,
			"title": "How do we stop the corona hoax?",
			"body": "For me it is absolute clear that corona is a hoax. Let me tell you what I mean by that:\n1. Corona is a real Virus\n2. Corona is new\n3. Every year there are new influenza viruses and other viruses\n4. Media and politics claim that this new virus is more dangerous than the average flu\n5. That might be true or not\n6. Overall corona is not significantly more deadly or harmful than the flu\n7. The society has decided (or it was decided by the authorities) that it actually is more dangerous than the flu\n8. We would have more deaths without any measures they say\n9. That might be true or not\n10. Even if we have more deaths without any measures, is it worth the damages of the measures?\n\nHow we handle this crisis - it is a crisis ,  because they made one out of it -  is not a medical question.\nIt is a political question. But the politicians treat it as if it was in fact a medical one, while they just define it as one and say, look we're helpless poor politicians we have no control about it.And politicians MUST always have control over everything, right?  Look, we say we want that the number of the infections and deaths is like [insert random number] but look the virus is out of control. Why can this virus not do as we command ? Look, we do everything in our might. Yes we want that you can have your normal lives back , we want that you can do all the things you could do in the last years, but look while the virus does not what WE THE POLITICIANS WANT we can do nothing about it. SORRY FOLKS\n\nAnd the majority of the people go along with this bullshit. They can not imagine that their rulers make a problem and then offer the solution just to get more power. They believe that the authorities are here to protect the people and do everything in their own best.\n\nI for-one do not believe the politicians. I do not believe the media. Because they lied. But not once or twice, they lie constant every day and not just small little lies but also very serious ones. And they never ever apologize for doing so. Even if, I would say that they don't mean it. The reason is that the next day they start lying all over again as nothing happened. Therefore I would call their behavior systematic lying.\n\nThis is not even a conspiracy theory - it is fact. \nEverything I just said can be considered as fact. Maybe not each small detail, but overall I would say that every person who is capable of understanding what I just said should agree with me. Do you agree with me?\n\nIf not, there is no way to stop them to use the corona hoax to establish the new normal. Therefore if you want it or not you have to welcome the new normal. And the new normal will mean that you can not have your life back. It will mean that you can not plan your life, because your future will totally lie in the hands of the authorities. And it seems to me that they want you to suffer.  \n\nFor me it is clear, that the only way to get out of this mess is to convince the majority of the people that their rulers are evil and have to be erased from this earth. If this message would reach the people and they start believing it there is hope. Because from that point all brave men will be able to organize to do the purge which is necessary. Until this point is reached even the bravest man will not move a finger to help unless he is total insane.\n\nTHERE CAN NOT BE VICTORY IF THE PEOPLE DON'T WANT IT\nTHERE CAN NOT BE VICTORY IF THE PEOPLE SEE IT IS AS TERROR WHILE IT IS JUST AN ATTEMPT TO SET THEM FREE FROM ENSLAVEMENT\n\nPEOPLE NEED TO BE CONVINCED FIRST\n**********************\nEDIT: please vote on http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT/+POLL+Who+thinks+that+corona+is+a+scam",
			"added": 1607730991
		},
		{
			"topic_id": 1607868478,
			"title": "[POLL] Who thinks that corona is a scam?",
			"body": "Please use my comments to vote.\nFor discussion use this thread:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT/How+do+we+stop+the+corona+hoax\n\nEDIT:\nPlease use the vote function. It makes it easier to see the result. Just click on the numbers next to my comments. You can also add a different option, if these three are not satisfying to you. If this get spammed, people will just have to scroll down to the bottom to see the results.\n\nOr jump straight to the last three comments:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT/+POLL+Who+thinks+that+corona+is+a+scam#comment_7_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT",
			"added": 1607868476
		},
		{
			"topic_id": 1608376973,
			"title": "Corona virus is treatet correct by most gouvernments",
			"body": "Why do you guys think, that the most governments have done the right thing to treat the corona virus?\nWhat do you think would have happened if governments would have done nothing?\nDo you agree that we can not have freedom because of a mild flu?\nDo you agree that people can not go on with their normal lives because a mild flu?\n\nDebunk Belarus - they did nothing - did people die? \n\nSure people die everyday and there is nothing you can do about it.\nYou will die one day.\n\nLIVE A FREE LIFE - ACCEPT DEATH\n\nACCEPT DEATH \n\nTHERE IS NO REASON TO LIVE ON THIS EARTH WHEN YOU ALL JUST HIDE IN FEAR OF THE DEADLY MILD FLU\n\nYOU HAVE TO GO OUT\nYOU HAVE TO MEET FRIENDS\nYOU HAVE TO PARTY\nYOU HAVE TO LET YOUR CHILDREN HAVE FUN\nYOU HAVE TO LET YOUR CHILDREN DO SPORT TOGETHER\n\nYOU HAVE TO GIVE YOUR CHILDREN A FUTURE\n\nOLD PEOPLE AND THE ILL HAVE TO LEAVE THIS EARTH WHEN THEY ARE TOO WEAK FOR THIS PLACE\n\nEARTH IS FOR THE STRONG ONLY\n\nSHUT UP YOU FUCKING BOOMERS AND DIE FASTER \nSHUT UP YOU AUTHORITY OBEYING ZOOMERS AND UNPLUG YOU FROM THE BEAST \n\nTOGETHER WE ARE STRONG AND HAPPY FOR A WHILE - THEN WE DIE\nALONE WE ARE WEAK AND SAD - THEN WE DIE",
			"added": 1608376970
		},
		{
			"topic_id": 1608588854,
			"title": "[Theory] Vaccine will kill many people - experts will say it is due the new strain of covid",
			"body": "To cover the deaths and people getting ill from vaccines the authorities need a proper explanation. People must not believe that the governments have allowed to poison people, so they must present them a plausible reason.\n\nIs it not suspicious that the \"new strain\" occurs in UK, where they just have started with the vaccination?\n\nHOW CONVENIENT",
			"added": 1608588850
		},
		{
			"topic_id": 1608593713,
			"title": "\"Protecting\" the eldery from covid is dehumanizing torture",
			"body": "We will all die alone.\nBut holding the hand of a loved one can help you to die not in fear.\n\nLetting people die alone and in fear while there is no reason for it is absolute cruel and inhumane.\nEven forcing people to wear masks or hugging through some kind of plastic foil is taking away their dignity.\n\nEvery person working in the media or for the government or in the \"health\"-industry should be ashamed of them self. But more these people are stupid, because they think that they once they die will not have to die in the same conditions.  What they let happen to others will happen to them. (hopefully)\n\nWhy can't they give people who are too weak to breath give strong opioids and let them die without pain and in peace? Why has to be everything so over complicated?  \n\nThis society is so stupid. They have all the technology , but not using it correctly because of some wicked moral or because no one could make a big profit out of it.",
			"added": 1608593708
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 1,
				"body": "Ten people and you get ten opinions. Thank you for your replies.\nFrom the replies here:\n-80% are convinced that corona is a hoax or at least have strong doubts about it\n-20% believe that corona is what \"they\" told us\n\nOf course this poll is in no way representative, because of two reasons:\n1.It is just 10 people\n2.These ten people are not the average Joe or Joane, because the average Joe does not engage in the dark web and vise versa \n(3. We don't know if these people are really ten people or less people with multiple accounts)\n\nIf we could get 80% approval in the real world for the statement:\n\"CORONA IS A SCAM AND EVERY PERSON WHO IS OR WAS INVOLVED IN THIS SCAM NEEDS TO BE PUNISHED BECAUSE OF THE SUFFERING THIS SCAM HAS CAUSED AND WILL CAUSE IN THE FUTURE\"\n\nIt would be a huge step to a world I personally want to live in. The rulers of the future must be aware. They must fear the people at every step they take. Otherwise they will betray them again if they get the chance and they will always get the chance of doing so.\n\nWhat is the public thinking in the real world right now?\n\nI think it is quite the opposite of this poll. 20% have doubts and 80% are sure that there is a deadly virus which legitimates the measures. (Maybe not all of the measures, but generally they think it is necessary)\n\nIt is maybe just 5-15% who are absolute sure that this is 100% bullshit. But even if it is this much, these people have no voice or their voice is suppressed. These people are at least very demoralized. Think of all doctors or scientists who think according to what they have learned in their whole life through education or personal experience that this is all so wrong. They have fear. Fear to lose their job or their reputation.\n\nThis only is all possible because of the heavy censorship of \"wrong\" opinions. It goes with bans, slurs, silencing or open threats.\n\nSo what tools do we have right now? What do our masters not have under their control yet?\n-They can not control or shut down this place (at least at the moment)\n-They can not control what you talk to your friends or other people in real life\n-You still can mail or call people and talk to them without censorship\n\nBut there are even more ways to communicate and show others that there is a different opinion about this topic out there in the world. That what is going on right now is not obvious.",
				"added": 1607804371
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 5,
				"body": "No, it is all real.",
				"added": 1607868640
			},
			{
				"comment_id": 6,
				"body": "Yes, it is a scam.",
				"added": 1607868652
			},
			{
				"comment_id": 7,
				"body": "I don't know.",
				"added": 1607868734
			},
			{
				"comment_id": 8,
				"body": "> [joaobatista](#comment_2_1AA4ZtRw9xHpakGL1dRbBKZmZCP4jyqJPY): Yes, it is a scam.\n\nPlease use the vote function. It makes it easier to see the result. Just click on the numbers next to my comments. You can also add a different option, if these three are not satisfying to you. If this get spammed, people will just have to scroll down to the bottom to see the results.",
				"added": 1607892227
			},
			{
				"comment_id": 9,
				"body": "> [quantumkitty](#comment_495_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I mean, the mainstream media isn't right about everything. That doesn't mean they're wrong about everything. [...]\n\nI personally have never said that the media is lying about everything. It should be clear that not everything what the media is reporting is wrong. In fact I would even say that the most things they say are actually true and you can prove that. The term \"The media is lying\" or \"fake news\" is not what it actually means, because things are a little bit more complicated than that. To express what the media is doing in one short slogan or term can not be done accurately. But when people demonstrating on the streets they have just space for short slogans and can not write an essay to express their complains, because no one would read or even understand what they are saying because they have just a fraction of a second to show off on a tv screen.\n\nThe thing with the media (IMHO) is this:\n\nThe media shows you an event which actually took place. But they don't show you the parts of the event which doesn't fit in their narrative or the frame they have set up for you. Additionally to this they also tell you some sweet little lies which you can't really debunk. But this frame ( so the part which are presented to you apart from that what they don't what you to see) plus this small lies or quotes taken out of context give you a certain impression of the event. The next thing they do is to show you some experts who draw conclusions on this event. They also show you experts who say things they don't like you to hear. \n\nBut the media has the control of the stage. They can change the light or the setting and add this or remove that and then these other experts look a little shabby or incompetent.\n\nAnd then you have it: You think you have seen the event with your own eyes. You think you have heard all relevant happenings and voices and they showed you everything. Now you have an opinion about this event. In fact you have the opinion they wanted you to have all from the beginning. They guided you through this event and you would be insane to think otherwise, because everything seemed so logical and suitable. Of course you could still have an other impression but because they now how the most people think they bring the majority or at least a large enough group on their side.\n\nThis is (imho) they way it works. This must not be a bad thing at every moment. But if you have a slightly feeling that the people who are in charge are insane maniacs who have no interest in a peaceful and joyful living and want to enact a crazy agenda or plan (I think they do this right now), than this is a really bad thing.\n\nWhy do I think that the people in charge are like what I have described above?\nBecause of all given facts to me corona is a hoax. Therefore and because of the misery and pain this hoax has caused they can not have good intentions.",
				"added": 1607986329
			}
		],
		"1608376973_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 10,
				"body": "> [doasfjk](#comment_1_1NqJGESdAyaaJdAq5ASsUdULqN3N1FpBev): Many of the governments received massive loans from globalist institutions like WHO and IMF to lockdown their countries and deceive the people with censorship and propaganda. If these countries refuse to cooperate they get sanctions or political destablization like what happened in Belarus. Despite all that regular people are trying to live free... but then the compromised government sends out the covid police and treat them inhumanely to force them back in. Unfortunately we are dealing with real tyranny and this way of life is being imposed regardless of what anyone thinks.\n\nI don't think it is \"regardless of what anyone thinks\". Look at all the normie discussion boards of newspapers and etc.. The most people there if they question the lockdowns and measures at all they just argue about details. The don't say this is all nonsense. They say the government should have done this or doing that.\n\nI think that this is the key problem:\n90% (or at least a very large percentage of the population totally agrees on this BS)\n\nYou may think that even if we could reverse this, so that the most people would believe that the governments do harm and betray them on a massive scale it would be useless.\n\nBUT:\nIt is not useless. You can not rule when all the small little politicians and power seeking people who want to be at the top see that  the population is against the government. They will no matter what they want or believe try to overthrow the government to become the government them self or at least raise their power.\n\nBut this will only happen if they know that they have the population on their side, because they are weak. They are afraid of some random guy who threatens to kill them. They know the cannot walk free because some one might stab them from behind. The also want the prestige from the population. The want glory.\n\nAnd normal people will kill local politicians and authorities once they have the feeling , that what they're doing is right and baked up by the population. \n\nAnd there is the police and the army. Maybe they will start a coup. But they will not if they fear the population. And they fear them not because of the population itself, but because of other sovereign countries who want to interfere in a weakened country.\n\nLook at turkey. The military tried a coup, but they could not do it, because they had not the balls to shoot their own citizen. They had no support at all from the population. Maybe a small group of outsiders was on their side. But this is not enough. And that is exactly the situation we have now.\n\nThe population believes the bullshit.\nSome people know that what the government is doing is pure insanity and tyranny.\n\nReverse it and you can overthrow it. It will happen. It will release a dynamic you can not stop once it breaks loose.",
				"added": 1608465966
			}
		]
	},
	"comment_vote": {
		"6_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"43_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1
	}
}