{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1621568781,
			"title": "Four new trackers opened",
			"body": "From now zeronet and file sharing zites should work properly and find Peers easily. Anyway we should seed all files that went deadshare in zites Like galactichan. Please seed! 😊\n\nAlso we should be ready to open new trackers when actual Ines Will be not sufficient to cover the entire network",
			"added": 1621568780
		},
		{
			"topic_id": 1622480057,
			"title": "Zeroseed Pack. A new mod of ZeroNet!",
			"body": "With this mod i wanted to create something asked from the community for a long time. New updated zerohello with many community-created interesting zites, zeronet updated to the newest version, many fast trackers added by default (mine and syncronite). Give it a try!\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/?:users/1HvNGwHKqhj3ZMEM53tz6jbdqe4LRpanEu:zn:d45dd8ff-0166-4c97-a416-5c00e12fe6f5:50",
			"added": 1622480055
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 1,
				"body": "Lets trolling begin! :D",
				"added": 1621522041
			},
			{
				"comment_id": 3,
				"body": "> [zeroplissken](#comment_2_1K1Y6kTYm7QXpmvbZiCAdzB5w7jCwBkird): I'm pretty pro vaccine but anytime anyone wants to say things like \"deny science\" or \"believe in science\" it makes me want to beat them over the head with a bat. That kind of terminology is half the problem surrounding the scientific and medical fields today and stems from a gross misunderstanding of both fields and the philosophy underlying them.\n\nThe mail error of the moderna società Is thinking that science Is a religion. Science Is based on proofs at contrary of religion that Is based on Beliefs",
				"added": 1621534845
			}
		],
		"1621394876_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 2,
				"body": "i'm sure that zeronet userbase is growing fast due to how clearnet is becoming, but we need a less buggy sync code and more trackers. today i opened a new tracker by using the VPS that OVH give to me after the fire at Strasbourg, but Galactichan node finding is very slow and less shared files often go dead share! (also my dedicated server seedbox is hard to find...) we should fix sync problems and also port the TOR code to the new version of hidden service if we want zeronet to survive and be useful. Geekless some time ago started a fork of this project. anyone know how this is going?",
				"added": 1621522342
			}
		],
		"1621568781_1PSeiYvqdseW3aoqEV5gddDRr7gCHSJPHB": [
			{
				"comment_id": 4,
				"body": "I have a question. To make my trackers working with tor network Is sufficient to enabled the tracker plugin and use zeronet with tor Active? Or i must do additional configurazione?",
				"added": 1621750823
			},
			{
				"comment_id": 5,
				"body": "Please could you tell me if these trackers is working for you?\n\nzero://51.38.34.170\nzero://51.254.123.155\nzero://139.99.194.162\nzero://51.79.50.180\nzero://51.79.160.138\nzero://95.110.227.231",
				"added": 1621752879
			},
			{
				"comment_id": 6,
				"body": "New trackers created! Please spread these!\n\nzero://145.239.95.38\nzero://51.195.216.53\nzero://51.68.174.48",
				"added": 1621972469
			}
		],
		"1622651065_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE": [
			{
				"comment_id": 7,
				"body": "stay calm... if you really want something bad think first! (if you arent a troll) you're only doing the dirt work for who want fear in world! someone want the fear to dominate...don't become their puppet!",
				"added": 1622653520
			}
		]
	},
	"comment_vote": {}
}