{
	"posts": [
		{
			"id": "2e71e2fc-f2eb-4ff8-a822-b50172b9927a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b45720e1-3884-4328-a831-0cdc2ce039dd",
			"body": ">>b45720e1-3884-4328-a831-0cdc2ce039dd\nThe problem isn't just marxists, it's anarchists of all stripes.\n\nThe state is fundamentally necessary. If you think market forces and some kind of utopian  metaphysical bond is enough to hold ideologically totalitarian regimes from steamrolling society, you're wrong.\n\nCommunists and ancaps have the same critical flaw - an overestimation of the average human's willingness to stand up and fight for what the system declares \"right\" (and even the notion that this will be agreed upon) coupled with an underestimation of nefarious outside forces motivated by goals outside the scope of the system.\n\nIf you need one good example: Islam. Islam, politically, is necessarily totalitarian, and it's got a fucking shitload of adherents. These people are not motivated by profit, they just want your compliance. They're not the only group either. It's not realistic to expect these forces to be held by a mutual interest in your personal goals because personal goals will vary greatly.",
			"time": 1566697928557,
			"files": "[]"
		},
		{
			"id": "419a20e4-dac5-4d36-b266-1a3887de5b3b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b45720e1-3884-4328-a831-0cdc2ce039dd",
			"body": ">>43fd9f67-85b4-4e6e-8a0a-0b4a068dd915\nThat's an overestimation of people's ability, in general, to plan ahead. It's utopian. Also, again, there's more than just Muslims who desire control over others. There's fundamentally nothing stopping that same mercenary group you'd pay to deal with your problems from turning around and enslaving you and your neighbors.\n\nYou seem to expect everyone to be on the same page when it comes to this, and that's just not realistic.\n\nIt really doesn't matter who's the majority when you extrapolate over time and take migration into account. All it takes is large enough pockets to overwhelm local groups. You can wipe out one cell of totalitarians, but the next group that tries might be more than your local mercs are able to handle, and they get wiped out. What then? You could pay outside mercs to come and deal with the problem, but what if there's not time or money? You're fucked.\n\nAnarchy is always transient because of this. It's a temporary state. Over a long enough timescale it will always end up with people being controlled by other people. Power and slavery are another way to get resources independent from economic forces.\n\nThese protogovernments you mention are exactly what I was referring to. Muslims are just one of these groups that would seek to control.\n\nUltimately, my point is anarchy will always devolve into warring tribes which battle for control and ultimately land in some sort of totalitarian rule. It's the nature of humans.",
			"time": 1566725830343,
			"files": "[]"
		},
		{
			"id": "f3419434-0eb7-4416-9d86-54997830109a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"body": "The middle east sucks, but having Jews instead of Muslims makes it suck less. This simple fact is why I support Israel.\n\nJews are at least semi modern people who bathe normally and do science. Muslims are fucking beasts.\n\nI think the US should fund Israel much less, but I still want the Jews to wipe out Palestine and take over the region entirely. Why don't you, /pol/?",
			"time": 1566726285749,
			"files": "[{\"name\":\"israelpalestine.jpeg\",\"thumb\":\"07ad5f51a381e05b61065f040cedcdc806f92f17-thumb.jpg\",\"size\":52050,\"type\":\"image/jpeg\",\"original\":\"07ad5f51a381e05b61065f040cedcdc806f92f17.jpg\",\"directory\":\"15nXznJBXSY5oEEjKzLD6FJJNtQHTffWbc\"}]"
		},
		{
			"id": "8294dcd3-6edc-47e2-a00c-d2f129dfe28f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>5a9987f0-180c-433f-806f-dbffcf3c54a5\nNo, I do not.\n\nAs a kid I remember never buying into Santa, but I understood the concept and the purpose behind the lie. I thought the same about God, but I was shocked to learn when I grew up that people actually took that shit seriously.\n\nI always just interpreted it as a fable to encourage good behavior, same as Santa. It took me until age 10 before I realized that people weren't just patronizing me as a child when they said they believed in God.\n\nTo me, a god isn't required, so there's no reason to suppose its existence. The notion of ghosts, spirits, goblins, and wizards is all ridiculous to me. There is no supernatural, and I've seen nothing to suggest otherwise. What does exist in this world is coincidence and circumstances with insufficient data to explain certain things. There's plenty of things that aren't knowable due to lack of information, and that's fine. I get that this bothers people, but, fuck, you really shouldn't leap to magic. It's just stupid.",
			"time": 1566742922927,
			"files": "[]"
		},
		{
			"id": "b0d5bb41-c7d5-47dc-a105-687c36a62e58",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "bef93890-dd69-47b9-8208-00937dd1b843",
			"body": ">>0f7209ca-afe7-4f53-a453-539d75e93c2c\n>>ee341502-a8cf-4f6a-be87-802636776982\nMost people on here aren't doing anything illegal to begin with, so perfect anonymity is't critical.\n\nWith regard to CP, blacklist it and it gets deleted and won't be seeded. Inadvertently downloading CP is an issue on clearnet chans too. I've yet to run across CP on 08, while I've seen a ton on 4chan, which most people aren't even running through a VPN or Tor anyway.\n\nAs a whole, the concerns about 08 are pretty ridiculous when you take into account what the average use case is.",
			"time": 1566745957697,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}