{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1579890249,
			"title": "The pedo facts that don't get published by MSM",
			"body": "Homosexuality is explicitly linked to pedophilia.\n\nAmong the general class of male sexual deviants (both homosexual and heterosexual), pederasts (boy molesters) are found to be much more prolific in their offenses than pedophiles (girl molesters). The most extensive study performed on the relative degree of predatory behavior of these two classes of male sexual deviants found that 153 pederasts sexually molested 22,981 boys over an average period of 22 years, while 224 pedophiles molested 4,435 girls over an average period of 18 years. This means that each pederast molested an average of 150 boys, and each pedophile molested an average of 20 girls—a ratio of 7.5 to one.\n\n>Source: Paul Cameron. “Homosexual Molestation of Children/Sexual Interaction of Teacher and Pupil.” Psychological Reports, 1985, 57, pages 1,227 to 1,236.____In a 1992 study published in the Journal of Sex and Marital Therapy, sex researchers K. Freud and R. I. Watson found that homosexual males are three times more likely than straight men to engage in pedophilia, and that the average pedophile victimizes between 20 and 150 boys before being arrested.\n\n>Source: K. Freund & R.I. Watson. “The Proportions of Heterosexual and Homosexual Pedophiles Among Sex Offenders Against Children: An Exploratory Study.” 18 34, Journal of Sex and Marital Therapy 34-43 (1992).\nhttps://www.ncbi.nlm.nih.gov/pubmed/1556756\n\n____\n\nHomosexual activists Karla Jay and I Allen Young revealed in their 1979 Gay Report that 73% of all homosexuals I have acted as \"chicken hawks\" — that is, they have preyed on adolescent or younger boys.\n\n>Source: Homosexual activists Karla Jay and Allen Young. The Gay Report: Lesbians and Gay Men Speak Out About Sexual Experiences and Lifestyles [Simon and Schuster, 1979], page 275.\n\n\nIn a 1984 Journal of Sex and Marital Therapy article, sex researchers found that \"The proportional prevalence of [male] offenders against male children in this group of 457 offenders against children was 36 percent.\"\n\n>Source: K. Freund, G. Heasman, I.G. Racansky, and G. Glancy. “Pedophilia and Heterosexuality vs. Homosexuality.” Journal of Sex and Marital Therapy, Fall 1984 [Volume 10, Number 3], pages 193 to 200.\n\n____\n\nA 1988 study of 229 convicted child molesters published in the Archives of Sexual Behavior found that 86% of pedophiles described themselves as homosexual or bisexual.\n\n>Source: W.D. Erickson, et al. “Behavior Patterns of Child Molesters.” 17 Archives of Sexual Behavior 77, 83 (1988).\n\n____\n\nA 1989 study in the Journal of Sex Research noted that \" . . . the proportion of sex offenders against male children among homosexual men is substantially larger than the proportion of sex offenders against female children among heterosexual men . . . the development of pedophilia is more closely linked with homosexuality than with heterosexuality.\"\n\n>Source: Kurt Freund, Robin Watson and Douglas Rienzo. “Heterosexuality, Homosexuality, and Erotic Age Preference.” Journal of Sex Research, February 1989 [Volume 26, Number 1], pages 107 to 117.\n\n____\n\nYet another recent study in the Archives of Sexual Behavior found that \"Pedophilia appears to have a greater than chance association with two other statistically infrequent phenomena. The first of these is homosexuality . . . Recent surveys estimate the prevalence of homosexuality, among men attracted to adults, in the neighborhood of 2%. In contrast, the prevalence of homosexuality among pedophiles may be as high as 30-40%.\"\n\n>Source: Ray Blanchard, et. al. “Pedophiles: Mental Retardation, Maternal Age, and Sexual Orientation.” Archives of Sexual Behavior, Volume 28, Number 2, pages 111 to 127.\n\nA 2000 study in the Archives of Sexual Behavior found that\". . . all but 9 of the 48 homosexual men preferred the youngest two male age categories\" for sexual activity;' These age categories were fifteen and twenty years old.\n\n>Source: A. Zebulon, Z.A. Silverthorne and Vernon L. Quinsey. “Sexual Partner Age Preferences of Homosexual and Heterosexual Men and Women.” Archives of Sexual Behavior, February 2000 [Volume 29, Number 1], pages 67 to 76.\n\n____\n\nA recent (2000) study published in the Archives of Sexual Behavior found that \"The best epidemiological evidence indicates that only 2-4% of men attracted to adults prefer men. In contrast, around 25-40% of men attracted to children prefer boys. Thus, the rate of homosexual attraction is 620 times higher among pedophiles.\"\n\n>Source: Ray Blanchard, et al. “Fraternal Birth Order and Sexual Orientation in Pedophiles.” Archives of Sexual Behavior, Volume 29, Number 5 (2000), pages 463 to 478.\n\n____\n\nHomosexual Alfred Kinsey, the preeminent sexual researcher in the history of sexual research, found in 1948 that 37 percent of all male homosexuals admitted to having sex with children under 17 years old.\n\n>Source: Alfred Kinsey data described in P.H. Gebhard and A.B. Johnson. The Kinsey Data. Saunders Publishing, 1979 Table 443, “Homosexual Sample: Age at First Post pubertal Homosexual Contact,” and Table 444, “Homosexual Sample: Age of Partner in First Postpubertal Homosexual Contact.”",
			"added": 1579890248
		},
		{
			"topic_id": 1582394078,
			"title": "Blocking a sub-forum?",
			"body": "Yeah, as much as I'm all for freedom - that doesn't mean I wan't to see a Little Girls sub-forum - how can I blacklist this?",
			"added": 1582394076
		},
		{
			"topic_id": 1583969906,
			"title": "\"Apps for the privacy paranoid\" article",
			"body": "Even if your control over your data is limited, you can still make it as difficult as possible for curious third parties. Encrypt and filter data streams, cut off trackers, cover your tracks. If you have \"nothing to hide\", as so many people say, think of your responsibility to your contacts and friends. Because their profile will also be sharpened by the data around them.\n\nhttps://www.androidpit.com/apps-for-security-paranoid",
			"added": 1583969903
		}
	],
	"topic_vote": {
		"1573412254_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 25,
	"comment": {
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 1,
				"body": "I usually use Opera GX with the built-in VPN turned on",
				"added": 1570040170
			}
		],
		"1571325375_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 2,
				"body": "I really like Brazil - I've worked there twice and bought a house there too.",
				"added": 1571340142
			}
		],
		"1573172203_17LTVhar6FUm7BRaj8FFcoVDVkTr1Y6QcY": [
			{
				"comment_id": 3,
				"body": "Sending normals here is pointless - they don't know how it works! No corporations spoonfeeding them leaves them scared. They'll just run back to Facebook Inc\nMy best mate is interested but worried about CP being stored on his HDD",
				"added": 1573408649
			}
		],
		"1573407833_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 4,
				"body": "I'm warm & dry. Nothing is preying on me. I have just had a coffee at the start of my shift. Everything is \"not crazy\"",
				"added": 1573409082
			}
		],
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": [
			{
				"comment_id": 5,
				"body": "Graham Masterton's \"Ikon\"",
				"added": 1574103252
			}
		],
		"1574346417_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 6,
				"body": "> [somuchfood](#comment_8_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): wouldn't it be easier to print a 3D gun with 3D printer?\n\nDefinitely not. First you need a decent 3D printer >$500 - then you spend 9 hours printing (if you're lucky and it prints with no problems) then it's more luck if it successfully fires more than 1 shot before it shatters.\nIt's much easier to get a motorcycle forkleg and convert it into a shotgun (that won't disintegrate)",
				"added": 1574382623
			}
		],
		"1574848015_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 7,
				"body": "Razer Phone 2 - US299 \nI've had mine for a year and it's awesome - the best speakers you will ever hear on a phone\nPlug it in to a USB-C hub, connect screen, mouse and keyboard for use as a desktop too\n\nhttps://techaeris.com/2019/11/26/for-a-limited-time-pick-up-a-razer-phone-2-for-us499/",
				"added": 1574877984
			},
			{
				"comment_id": 9,
				"body": "Take a look at these...\nhttps://e.foundation/",
				"added": 1574964587
			},
			{
				"comment_id": 10,
				"body": "> [1bfqutudhtexlka](#comment_74_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): thanks for all the answers , i was really looking into purism , but unfortunately it's very very hard to ship it to my countrywhat you think about xiaomi ? is it good enough ? most of devices have a root support and customizable roms\n\nI've just bought my wife a xiaomi note 8 pro - only £200!!",
				"added": 1574964638
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 8,
				"body": "The starving prisoners were a direct result of the Allies destroying the supply lines.\nThe number of incinerations was proven by Australian researchers to be impossible.\nThe number of 6 million was introduced during the Nuremberg trials and never verified.\n\nYes, a huge amount of people were incarcerated, tortured and murdered but this should mean that proper research needs to be carried out rather than branding any questioner a 'Denier' or 'Idiot'.\nThe very fact that anyone who questions the official narrative is smeared says to me that something doesn't add up.\n\nThe glaringly obvious reality that Hitler & the Socialists are so vilified when Communism has killed many, many times more people makes me wonder what the hell people are being taught.",
				"added": 1574878649
			},
			{
				"comment_id": 12,
				"body": "> [thorburn](#comment_20_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): You seem to be ignoring the fact that Germany had colonial interests, and they also committed atrocities [...]\n\nOne of the best posts I've read.",
				"added": 1576949312
			}
		],
		"1574883594_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "For a start, I'm not clicking a YouTube link!\nI use Bitchute and always advise others to do the same.",
				"added": 1574964810
			}
		],
		"1579728135_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 13,
				"body": "Coffee doesn't give me any buzz - it's my normal state of being. I can go days without it though so it's hardly an addiction.\nEnergy drinks do contain, as ranshit states, B vitamins. I take B12 supplements and can really feel the difference.\nMy advice would be to quit the energy drinks and find a nightshift job. I work 6pm to 6am, go to bed from 7am to 2pm and get to wake up relaxed.",
				"added": 1579889662
			}
		],
		"1581540627_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 14,
				"body": "Regulate the internet?\nlololol\n\nhttps://blog.mozilla.org/futurereleases/2019/09/06/whats-next-in-making-dns-over-https-the-default/",
				"added": 1581790041
			}
		],
		"1582025950_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 15,
				"body": "Why?\nQuillette\nFeedly\nGog\nHumblebundle\nHeinnie\nrarbg\nbitchute",
				"added": 1582394376
			}
		],
		"1582394078_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 16,
				"body": "It's a sub-forum of 08chan - I found the option. Have to click on the description to get the option to blacklist.",
				"added": 1582479867
			}
		],
		"1582649582_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 17,
				"body": "I've used it and found it quite effective.\nThe problem is mainly USA based as they're still based on a puritanical-1950's mindset. \nI've always found it bizarre that graphic violence is accepted on mainstream TV but not nipples.",
				"added": 1582653429
			}
		],
		"1583652466_12cd6EZPPnYus8unwYEjFxKYWps2kNBJKd": [
			{
				"comment_id": 18,
				"body": "Recuva",
				"added": 1583777162
			}
		],
		"1583587826_154DLn4k3ckpT1v151SLaFh7mmy4TnccmT": [
			{
				"comment_id": 19,
				"body": "\"Idiot Tax\" = I've never played.\nI don't mind small stuff like the Postcode Lottery as it openly states that 32% of generated monies go to charities.\nNo gambling is worth it if you're in debt (as is trying to save) - debt interest rate never stops.",
				"added": 1583777485
			}
		],
		"1583945887_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 20,
				"body": "No dark mode???",
				"added": 1583953015
			},
			{
				"comment_id": 21,
				"body": "> [styromaniac](#comment_1886_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Why is every commenter being retarded?\n\n...and you expected???",
				"added": 1583958708
			},
			{
				"comment_id": 23,
				"body": "> [zeromepro](#comment_37_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71): How this is possible ? I don't get it though !\n\nGoogle type the app name into their database and simply hand the list of devices (IMEI numbers) to the Feds. The Feds request IMEI information from the carriers. Everyone gets their own little flag and folder!",
				"added": 1584474772
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac](#comment_1943_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Don't you think the apps outside of the play store would also be documented for who installs them? [...]\n\nI don't know if a phone spills the beans on side-loaded apps",
				"added": 1584475956
			}
		],
		"1583969906_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 22,
				"body": "> [xplosive](#comment_47_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): \"If you have \"nothing to hide\", as so many people say, think of your responsibility to your contacts and friends.\" [...]\n\nBy keeping your data safe your aren't divulging any information about your contacts.\nJust because a person isn't on Facebook doesn't mean Facebook doesn't know who they are - everyone with the Facebook app automatically shares their contact list with the company who can then see who links to whom.",
				"added": 1584037096
			}
		]
	},
	"comment_vote": {
		"21_19s8EgXft8KuYsk9tEGgnmLo3Kcmw3ME5E": 1,
		"8_1LvCmKVRHi59Sa5wfK4yyjR4hijrabpbm5": 1,
		"57_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1025_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"311_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"198_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"32_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2": 1,
		"16_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1297_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"19_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"20_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"67_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"6_1JbZKtuFZMRTCgBjhpnD4pCXwi5gniQsKZ": 1,
		"495_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"48_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"1_1BB6ikcNwc41PVHJ14E3SQQg2j1gUxoiP": 1,
		"1813_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"74_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"455_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"669_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"351_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"70_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1855_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"47_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"53_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"54_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"1_1E1M4LRh1x21xPQ5i6Kcvio3hwo7TmxjDr": 1,
		"354_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"11_182MiECzFBoPjv3gU6tq2k9BXSboKzDVKF": 1,
		"3_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"13_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3": 1,
		"1842_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"113_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"11_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX": 1,
		"64_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1
	}
}