{
	"title": "Diario de un ZeroPrincipiante",
	"description": "Descubridero ZeroNet como en los 90 la red",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 21,
	"demo": false,
	"modified": 1483298141,
	"post": [
		{
			"post_id": 18,
			"title": "El destino y los caminos, las redes P2P",
			"date_published": 1480459837.331,
			"body": "Sin duda si queremos libertad y soberanía nuestros sistemas de comunicación e información han de ser descentralizados (entre pares), sin censura sistemática posible más la que ejerza cada uno en sus ámbitos privados, también debemos garantizar el derecho al anonimato para las personas o colectivos que así lo necesiten.\n\n---\n\nLa distribución parte a parte tanto del almacenamiento como del flujo de datos optimiza el uso de los recueros y  hace imposible ataques de denegación de servicio. \n\nEsto lo leerán usuarios de ZerNet así que sin duda todos los lectores coincidirán conmigo posiblemente sin matices ya que son conceptos muy simples, los conceptos que nos reúnen aquí.\n\nAhora bien, a partir de aquí: Frente unido de Jedea, Frente de Judea unida y Frente único de Judea,  ¡nuestro peor enemigo es el sistema centralizado!... ¡pero peor los otros frentes! No se si llega a tanto pero somos humanos y ese riesgo corremos.\n\nNo tengo dudas de que los protocolos  y sistemas P2P han de reemplazar a los centralizados, donde comienzan mis dudas es donde también comienzan los desacuerdos en la comunidad de ZeroNet y en otras. ¿ha de vivir un solo sistema tipo ZeroNet?, ¿han de convivir varios de forma paralela y si lo hacen podremos generar puentes o crearemos mundos aislados? ¿es licito y procedente publicar en ZeroNet enlaces P2P (por ejemplo magnets) externos a zeronet. ¿es procedente facilitar acceso a los contenidos p2p a la red centralizada mediante proxys?\n\nLlevo algo más de un mes novatendo en ZeroNet y no he encontrado la manera correcta de compartir archivos de audio y video.\n\n* Ninjabeats requiere WebRTM y solidaridad activa por parte de las partes ya que si no se vuelca el hash en webtorrent al cerrar la ventana se deja de sembrar.\n\n* Otros sistemas propios de ZeroNet están el alfa\n\n* Muchos usuarios alegan razones de seguridad por las cuales no recomiendan incluir magnets. \n\nBásicamente necesitamos un sistema para compartir media que no requiera nada considerado inseguro y que facilite el host mutuo, y no, no me fui de tema, el asunto es ¿como bailamos con este caos de tecnologías, necesidades y retenciones diferentes sin pisranos los pies? "
		},
		{
			"post_id": 17,
			"title": "La mala educación o los curas en vez de enseñar robótica crean robots",
			"date_published": 1479846029.618,
			"body": "Hoy toca un off-topic, no hablaré de “ZeroNet desde y para principiantes” que es de lo que se trata este blog, hoy tampoco he tenido tiempo para el nuevo blog [Pantopía](http://127.0.0.1:43110/1Asy5bxDXSCS1aGDzdELfayZffneXiKjww/) ni para los zitios sobre soberanía alimentaria,  con la excepción de unas pocas horas de día soleado dedicado a tareas hortícolas mi día ha sido un offtopic. \n\nPor no comprometer a nadie que no sea yo, en este caso no daré datos concretos, pero gracias a unos curas que dicen educar y cobran del estado por ello, estoy pasando el día lidiando con una máquina virtual con winbugs 7 funcionado en el pc  portátil de un joven convencido y practicante del software libre  que tiene una distro gnu/linux instalada como único S.O. \n\n¿Como llegamos a esto? Los putos “educadores” obligan al alumnado a utilizar softwares que solo funcionan en winbugs, no solo eso sino que no aportan licencia alguna sino que instrucciones para crakeralos (el mal menor según Stallman, pero una complicación y pérdida de tiempo más además del compromiso legal ridículo. \n\nSi, es para cursar un módulo de robótica. Mi joven amigo no ha aprendido un carajo de tecnologías industriales y robótica en tres años, pero si que cada vez anda más robotizado.\n\nNo queda más que compartir un poema de Oliverio  Girondo.\n\nINVITACIÓN AL VÓMITO\n\nCúbrete el rostro\ny llora.\nVomita.\n¡Sí!\nVomita,\nlargos trozos de vidrio,\namargos alfileres,\nturbios gritos de espanto,\nvocablos carcomidos;\nsobre este purulento desborde de inocencia,\nante esta nauseabunda iniquidad sin cauce,\ny esta castrada y fétida sumisión cultivada\nen flatulentos caldos de terror y ayuno.\n\nCúbrete el rostro\ny llora...\npero no te contengas.\nVomita.\n¡Sí!\nVomita,\nante esta paranoica estupidez macabra,\nsobre este delirante cretinismo estentóreo\ny esta senil orgía de egoísmo prostático:\nlacios coágulos de asco,\nmacerada impotencia,\nrancios jugos de hastío,\ntrozos de amarga espera...\nhoras entrecortadas por relinchos de angustia."
		},
		{
			"post_id": 16,
			"title": "En un sistema descentralizado no existe “la oficialidad” solo los pactos entre pares",
			"date_published": 1479320491.889,
			"body": "El nombre de este blog no es casual ni está desactualizado, soy un novato en ZeroNet. En el poco tiempo que llevo interactuando el el sistema, usuarios incluidos porsupuesto, me han llamado la atención dos actitudes contrapuestas de usuarios: He visto algunos comentarios al respecto de las decisiones que toman “ellos” respecto por ejemplo al control de las Ids o a la página principal, supongo que se refieren a ZeroHello, por defecto la página principal, estos usuarios optan por que “la oficialidad” no tenga control alguno sobre estos detalles. Luego he visto comentarios de usuarios que piden más aplicaciones oficiales, como un directorio de blogs.\n\n---\n\nVeamos, cuando instalamos ZeroNet, conceptualmente lo que estamos instalando es un software que nos permite usar un protocolo para comunicarnos de igual a igual con otras personas que instalen este software en sus dispositivos, por ejemplo: ZeroHello y ZeroId no son aplicaciones de uso obligatorio, son programas accesorios incluidos en la instalación de zeronet por parte de los actuales  (creo que únicos empaquetadores)   para facilitarnos la vida, luego es cierto que por el memento hay pocas opciones y no todo usuario ha de ser un programador o desarrollador, pero no olvidemos que esto recién comienza no hemos llegado siquiera a la versión 1 y para el  muy poco tiempo de desarrollo que lleva la cosa el avance es enorme, créanme, no he visto desarrollo más rápido y colaborativo.\n\nEn síntesis, las dos tipos de opiniones citadas anteriormente si, son contrapuestas en un aspecto, pero en otro coinciden, se pareen mucho en que esperan reacciones de unos dioses que no existen, solo se trata de unos compañeros que hacen una propuesta, es de esperarse que en poco tiempo haya diferentes formas de usar ZeroNet, algunas que puedo imaginarme y otras que no, seguramente contaremos con distintas personas y grupos creando paquetes para instalar ZeroNet con distintas aplicaciones por defecto, solo se trata de tener una actitud activa y constrictiva cada uno según sus posibilidades y paciencia, mucha paciencia cosas que hace 20 o incluso 10 años no existían, no pueden ahora tornarse indispensables. \n"
		},
		{
			"post_id": 15,
			"title": "Tenemos que avanzar en el tema eliminación de contenido, bloqueo de usuarios, moderación en general",
			"date_published": 1478618550,
			"body": "Tenemos que avanzar en el tema eliminación de contenido, bloqueo de usuarios, moderación en general (en cuanto a la red en si, a zeronet) no se puede censurar y no se debe ni siquiera plantear, pero la misma libertad que asiste a cualquier naci hijoputa o a cualquier niñato repelente a publicar sus sandeces y expresar su idiotez la debemos tener otros para mantener nuestro entorno limpio de trolls y atacantes, no hay porqué tolerar en un psot sobre soberanía alimentaria un comentario “los judíos chupan penes de bebés” También debemos poder tener un entorno controlado para los niños. Es intolerable que un gran bloger de esta red deba mantener cerrados los comentarios de su blog http://127.0.0.1:43110/DarkbloG.bit/?Post:134.\n\nPara no perder la costumbre terminamos con un par de preguntas.\n¿que podemos hacer ahora como usuarios?\n¿que hay planeado en el desarrollo de zeronet para manejar estos problemas?\n"
		},
		{
			"post_id": 14,
			"title": "¿Libros electrónicos en Zeronet? ",
			"date_published": 1478547397.542,
			"body": "¿Quien será el valiente que programe una aplicación para publicar y leer epub en ZerNet? El tema de los zitios en que estoy trabajando sobre soberanía alimentaria en ZeroNet me ha hecho ver la necesidad de compartir libros. Ya que no soy programador por el momento barajo dos opciones, supongo que experimentaré con ambas, aunque la primera no es un gran experimento. \n\n---\n\nLo de .epub estaría muy bien por que no estaría nada mal poder subir en este formato y que se pueda leer correctamente, pero hablemos de libros digitales en general. \n\n1) La forma más fácil es generar o localizar un archivo torrent del material que queremos compartir, si el archivo existe ya en torrent es mejor usa ese por que garantiza fuentes, de lo contrario deberás dejar tu máquina funcionado hasta que las haya para garantizar la disponibilidad. Una ventaja de publicar archivos mediante enlaces magnet de torrent es que si bien fuera de zeronet sigue siendo p2p otra es que no tendremos problema con archivos grandes, si, podemos tenerlos en zeronet, una desventaja es que no se pdorán leer desde zeronet, habrá que bajar el torrent y abrirlo.\n\n2) Aquí tengo dudas y agradezco ideas tenemos 2-A que consiste en clonar un 0blog para cada libro y publicar cada capítulo como una entrada y tenemos la posibilidad 2-B que se trata de usar zerowiki para publicar libros, la ventaja es que la wiki es más navegable y una sola persona no tiene por que comerse todo el laburo (curro)\n\nAhora bien, repito ¿algún desarrollador enrollado que nos de una mano? :)"
		},
		{
			"post_id": 13,
			"title": "Enlace de contacto en los Zitios",
			"date_published": 1478463336.498,
			"body": "Soy de los que prefiere ponernos las cosas fáciles entre nosotros, entonces vi que <a href=\"http://127.0.0.1:43110/18nQPR4TCM4tQ8L7fm6dX6SGXLsj7wa8sv/\">ZeroChatES</a> tiene un enlace de contacto que funciona con ZeroMail, nada más fácil que copiar el enlace con el botón derecho y ver como está hecho: http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=juansantiago  cambias mi nombre de usuario que está luego del = por el tuyo y ya.\n\n¿Ya activaste ZeroMail? \n"
		},
		{
			"post_id": 12,
			"title": "Hoy me propuse leer sobre los proxys para ZeroNet, ahora tengo más dudas que antes",
			"date_published": 1478378915.368,
			"body": "<b>No he encontrado mucho donde leer sobre los proxys para ZeroNet y lo que he encontrado me ha traído más preguntas que respuestas, dirían mis maestros de filosofía que si me ha dejado muchas preguntas se trata de un buen texto ya que una buena pegunta vale más que cien respuestas.</b>\n---\nEl texto leído es este previo a una lista de proxys: http://127.0.0.1:43110/14y3fN1A214HYdKe5f6WnQdfT3PdKLSAJo/ básicamente dice que no sabiendo quien los ha montado al usarlos te pueden romper el … \n\nLas preguntas que tengo al respecto son: \n¿Cual es el peligro de usar estos proxys en modo solo lectura? No suena nada agradable someter a los lectores a peligros. \n¿Cuando el proxy te ofrece una id esto quiere decir que se pude interactuar?\n¿los proxis también actúan de semillas?\n¿Es muy complejo instalar un proxy?\n\nOtro tipo de pregunta:\nEs más favorable para el entorno y futuro de ZeroNet ofrecer los proxys a los foráneos como etapa de transición o incentivar el uso de ZeroNet diciendo “para ver he interactuar con esto debes instalar ZeroNet? \n"
		},
		{
			"post_id": 11,
			"title": "Es hora de soberanía alimentaría en Zeronet",
			"date_published": 1478135962,
			"body": "Llegó la hora, ya me siento capaz de llevar un proyecto acabo en ZeroNet, mientras sigo aprendiendo vamos a dar uso real a la cosa.\n\nSon dos los medios con los cuales el imperio del capital pretende controlarnos en un futuro cercano esos planes se llevan a cabo a pasos agigantados si escarbamos un poco vemos el cruce de capitales e intereses entre las multinacionales de la informática y las telecomunicaciones y las agro-químicas,  pretenden ser dueños de nuestra comida y restringirlos las comunicaciones para  que no podamos gritar a los cuatro vientos que queremos soberanía sobre las formas y los medios de producción de alimentos, pretenden convertir la naturaleza en un valor escaso y ser los propietarios del valioso remanente, pretenden tener un botón gordo para acallarlos.\n\nPara censurar este post los malos deberían entrar en muchas casas en muchos países, ya podemos comunicarnos, ahora hablemos sobre soberanía alimentaria.\n\nSoberanía Alimentaria Wiki: http://127.0.0.1:43110/1WXrbTh9HiJoemqBWxfLc1h7zHF1mHjfb/?Page:home\n\nSoberanía Alimentaria foro: http://127.0.0.1:43110/1JPEB48bP2mBnd9knKrBiLkoGZC6r7SjMZ/?Home\n\nVamos allá. "
		},
		{
			"post_id": 10,
			"title": "dispuestos a soportar las envestidas criminalizadoras por parte del sistema imperante",
			"date_published": 1478047316.127,
			"body": "Hoy he dedicado un tiempo a editar  [ZeroWiki Es](http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/), por lo demás solo he sido un usuario pasivo de ZeroNet, no he aprendido nada nuevo, considero de vital importancia impulsar las comunicaciones descentralizadas ya lo sabía, sin duda lo sabía, pero una gran cantidad de visitas legítimas a un post en un sitio web constantemente atacado por spam y splog, me ha tenido ocupado, el sitio se ha estado cayendo constantemente, es un vps, no sale barato y no soporta una portada en meneame.net, solo con mucho conocimiento para administrar un server dedicado y en todo caso mucho presupuesto para servidores se puede mantener una gran cantidad de contenidos y ciertas funcionalidades a disposición de mucha gente en la internet centralizada, p2p soluciona esto, no perdamos más tiempo compañeros... a trabajar y a estar dispuestos a soportar las envestidas criminalizadoras por parte del sistema imperante."
		},
		{
			"post_id": 9,
			"title": "también estamos los curiosos",
			"date_published": 1477873744.105,
			"body": "Llevo tres días tratando de hacer un sitio de ZeroNet que solo sea una página estática y ahora habemus dos. La primera idea fue partir de un 0blog clonado para conservar algunas herramientas que sal vez se me ocurriría usar. Al final,  fue fácil pero resultó que no tiene mucho sentido por que al final eliminé todo, fue fácil que el sitio se vea en local, pero daba errores y otros usuarios no podían verlo, supuse que no era lo del puerto 15441 me me decía el sistema porque el blog clonado pero apenas modificado si podía verse por otros usuarios, entonces siguiendo concejos decidí hacer el sitio desde 0, para esto estamos en ZeroNet :). \n\nHacer el sitio desde 0 también fue fácil <b>con la salvedad de que el comando [code] zeronet.py  siteCreate[/code] que figura en los tutos no me funcionaba, en cambio el comando  [code] python zeronet.py siteCreate[/code] fue el que me funcionó.</b>\n\nEl problema fue que tenía el mismo problema que con el sitio anterior. Entonces me decidí a abrir el puerto 15441 y aquí otra cosa que no figura en los tutos, tal vez por que son tutos que no están hechos para principaintes contando con que por el momento solo gente del mundo informático usa ZeroNet, pero también estamos los curiosos, al grano, <b>no solo se trata de abrir el puerto 15441, también a que dirigir el tráfico a la ip interna.</b> \n\nEl resultado:\n\nSitio 1 http://127.0.0.1:43110/13MTG5zJ1MfErs3wg1Fwgs7pbywxK9xf4A/\n\nSitio 2 http://127.0.0.1:43110/1PUP93A7wK3EnJcnWdBGzUB2chnCTJToQq/\n\nLa verdad es que una vez creado el sitio, solo se trata de desarrollar dentro de la correspondiente carpeta como en la raíz de cualquier hosting... pero con las aplicaciones de ZeroNet a nuestra disposición por ejemplo para añadir un sistema de contacto podemos usar 9mail de la siguiente manera: un enlace a [code] http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=tuusuario [/code]\n\nMañana más."
		},
		{
			"post_id": 8,
			"title": "ya que controlan mi router que trabajen. ",
			"date_published": 1477857255.654,
			"body": "Bueno, llevo tres días para crear una simple página estática en ZeroNet :( ,  ahora me dice que el puerto blablabla, ayer abrí el famoso puerto, pues, el software del router es caca privativa, llamaré al proveedor que que habrán el puerto definitivamente, ya que controlan mi router que trabajen. "
		},
		{
			"post_id": 7,
			"title": "Vamos a jugar con html en las entradas de los 0blogs",
			"date_published": 1477598708.601,
			"body": "Una marquesina.\n<marquee> Vamos a jugar con html en las entradas de los 0blogs</marquee>\n\nUn video del agrónomo que aborrese a los agronomos, el camarada Jairo Restrepo.\n<video src=\"https://b2aeaa58a57a200320db-8b65b95250e902c437b256b5abf3eac7.ssl.cf5.rackcdn.com/media_entries/8288/jairorestrepo.webm\" controls>\n  Tu navegador no implementa el elemento video.\n</video>\n\nUn audio, un poco de música libre de los compañeros de <a href=\"http://www.bensenmedo.piesnegros.org\">BENSENMEDO</a>\n<audio src=\"/home/juan/ZeroNet-master/data/0media/1.indios_bensenmedo.ogg\" controls >Tu navegador no implementa el elemento audio</audio>\n¿algo más?\n\n¿Pueden ver los repoductores de audio y video?\n¿Con que navegador?"
		},
		{
			"post_id": 6,
			"title": "¡HTML en las entradas! ¿por que no me lo dijeron antes? \n",
			"date_published": 1477522034,
			"body": "<strong>La verdad, no veo mucho sentido a dar formato con <a href=\"https://es.wikipedia.org/wiki/Markdown\">markdown</a> si se puede usar <a href=\"https://es.wikipedia.org/wiki/HTML\">html</a>, veremos que html se puede usar y que se valida y que no, pero viendo como se aloja el contenido en ZeroNet y siendo que el html se ejecuta en los navegadores, tal vez no tengamos límite mas que el de nuestro dominio del html o las capacidades del editor que usemos. </strong>\n\nY esto es lo bueno de poder usar html, podemos usar un editor de texto plano o incluso en este caso un procesador de texto para escribir las marcas en html (en este caso podemos usar un procesador de texto porque no es para guardar como html, es para copiar y pegar en nuestras entradas de los blogs de ZeroNet, si fuese para guardar como html, hemos de usar un editor html o uno de texto plano ya que los procesadores de texto acostumbran a agregar códigos paráclitos al guardar en html)\n\n<img src=\"http://piesnegros.org/files/2016/10/html_kompozer_500.jpg\" align=\"left\" width=\"300\" height=\"250\"  />O bien podemos usar un editor tipo <a href=\"https://es.wikipedia.org/wiki/WYSIWYG\">WYSIWYG</a>, los hay online, te recomiendo usar este tipo se servicios online, seamos amigables y compartamos nuestro trabajo con la NSA, la CIA y la KGB, ponte de su lado, solo hacen su trabajo, no seas mala gente y pónselo fácil y tampoco nos olvidemos que este tipo de cosas “gratis” en Internet suelen estar en manos de empresas que venderán los datos, pues ¿quieres quitarle la comida de la boca a los pobres hijos de estos empresarios? ¿no verdad?.\n\nOtra posibilidad es usar el editor de html del <a href=\"https://es.wikipedia.org/wiki/Sistema_de_gesti%C3%B3n_de_contenidos\">CMS</a> que usemos habitualmente, experimentaremos con el editor de <a href=\"https://es.wordpress.org/\">wordpress</a> por ejemplo, solo se trata de crear una entrada con el editor de wordpress ir a la vsita de html copiar y pegar, esa será la manera en que editaré esta entrada y veremos que pasa.\n\nEn resumen, que html en las entradas da posibilidades para todos los gustos y niveles de conocimiento y que yo necesitaba un texto no muy corto para experimentar con html en las entradas de los 0blogs.\n\n<i>Al editar el html con el editor de wordpress he tenido que:  1) insertar a mano el código de las imágenes ya que wordpress usa sus propias marcas para eso, he tenido que quitar el pie de foto por que no se como agregarlo sin css, ya modificaré l css para poder hacerlo. 2) Poner los saltos de párrafo a mano, el editor de wp, no los agrega, wp detecta los saltos.\n\nEl próximo psot lo haremos con html en editor plano y probaremos mas cosas, de hecho, no hay límite, eso creo.</i>\n"
		},
		{
			"post_id": 5,
			"title": "Hoy no y mañana tampoco",
			"date_published": 1477434491.573,
			"body": "Cuando andaba en eso de la mercadotecnia ya no ando en eso ahora tengo conciencia, practicábamos eso de nunca negativo, bajo ese concepto el titulo de este post habría de ser, pasado mañana si, pero ya no soy un mercenario del capital, ahora soy un tipo que valora por sobretodo la sinceridad así que para decir que hoy y mañana toca mucho trabajo de huerta y no avanzaré en al aprendizaje de ZeroNet me mando una parrafada.\n\nBueno, he intentado cambiar el logo de mi blog como dicen las instrucciones (cambiando la imágen avatar.png de la carpeta img) pero ná de ná, se sigue viendo la misma imagen genérica, imagen que no he sido capaz de averiguar donde se aloja y he perdido las instrucciones que me dio Eibriel para hacerlo modificando el archivo index.html, archivo que he logrado encontrar siguiendo la url. (tendré que documentar todo esto, estoy encontrado los detalles que no están en preguntas frecuentes ni en ningún lado, que  tal vez se dan por sabidos pero pueden complicar la vida a los novatos. \n\nEn definitiva, pasado mañana me pondré a editar el archivo idex y de una u otra manera tendré el blog algo más personalizado. \n\nPosdata, ahora veo mi avatar en zeroblog, pero no en mi blog, oh!!"
		},
		{
			"post_id": 4,
			"title": "Todo nuevo bajo el sol",
			"date_published": 1477339723,
			"body": "\n\nHace mucho tiempo que no tenía la sensación de descubrir algo, como cuando a mediados de los 90 me senté por primera vez a unas máquinas conectadas a Internet y descubrí la web y el mail, ese sentimiento de expedición de aventura, aquella vez tardé casi media década en poder interactuar eficazmente con el sistema, lo cierto es que lo que aquella vez me costó 5 años con internet, me está costando unos tres días con zeronet, creo que en una semana estaré preparado para trabajar en proyectos concretos y no solo ser un ZeroAprendiz. Gracias a  [Eibriel](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi/eibriel@zeroid.bit)\ny todos los que me están dando una mano.\n\nAlgunas cosas que quedan pendientes:\n\nModificar logo del blog, no encuentro index :)\n\nHacer resguardo de identidad en zeronet, no se como hacer compia del archivo data/users.jason"
		},
		{
			"post_id": 2,
			"title": "Oh!! he coseguido editar el título",
			"date_published": 1477295599.639,
			"body": "Hey!!! Ya vi como editar el contenido :)"
		}
	]
}