{
	"title": "ohfarm 2h",
	"description": "My Blog.",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 29,
	"demo": false,
	"modified": 1495373302,
	"post": [
		{
			"post_id": 28,
			"title": "New blog post",
			"date_published": 1495373302.303,
			"body": "Blog post body"
		},
		{
			"post_id": 27,
			"title": "security and defence of the house",
			"date_published": 1495370716.543,
			"body": "communication methods\ndefence key points \n- access to all sides from the secured top position, this is the most \nimportant design\n- tall roof\n- large and convenient storage room, in fact this is why we need the whole concealed ground floor dedicated for the storage of food, logs, water\n- underground work, in fact this is why we should select location in high land, so to allow underground work done; if in low ground, underground water will be an issue;\n- from above, some sort of elavated flying machine is needed, for single person is fine.\n\ntools for defence \nresources within the conpound\n- water\n- food \n- logs "
		},
		{
			"post_id": 26,
			"title": "the progression of the villa design",
			"date_published": 1495369596.37,
			"body": "it progresses with time and resource available to us as it evolves. the best design at any given time depends on the resources available to us at the time."
		},
		{
			"post_id": 25,
			"title": "what we have now",
			"date_published": 1495369557.069,
			"body": "with the space now, we can carry out any experiments and ventures unlimited \nlet's rock"
		},
		{
			"post_id": 24,
			"title": "principles of roman architecture",
			"date_published": 1495338620.632,
			"body": "http://www.gutenberg.org/files/20239/20239-h/20239-h.htm"
		},
		{
			"post_id": 23,
			"title": "New blog post",
			"date_published": 1495332081.263,
			"body": "Casino is of Italian origin; the root casa (house) originally meant a small country villa, summerhouse, or social club.[2] During the 19th century, the term casino came to include other public buildings where pleasurable activities took place; such edifices were usually built on the grounds of a larger Italian villa or palazzo, and were used to host civic town functions, including dancing, gambling, music listening, and sports; examples in Italy include Villa Farnese and Villa Giulia, and in the US the Newport Casino in Newport, Rhode Island. In modern-day Italian, the term casino designates a bordello (also called casa chiusa, literally \"closed house\"), while the gambling house is spelled casinò with an accent.[3]\n\nNot all casinos were used for gaming. The Catalina Casino,[4] a famous landmark overlooking Avalon Harbor on Santa Catalina Island, California, has never been used for traditional games of chance, which were already outlawed in California by the time it was built. The Copenhagen Casino was a theatre, known for the mass public meetings often held in its hall during the 1848 Revolution, which made Denmark a constitutional monarchy. Until 1937, it was a well-known Danish theatre.[5] The Hanko Casino in Hanko, Finland—one of that town's most conspicuous landmarks—was never used for gambling. Rather, it was a banquet hall for the Russian nobility which frequented this spa resort in the late 19th century and is now used as a restaurant.[6]\n\nIn military and non-military usage in German and Spanish, a casino or kasino is an officers' mess.[7][8] In Italian—the source-language of the word—a casino is either a brothel, a mess, or a noisy environment, while a gaming house is called a casinò.[2][9]\n\nHistory of gambling houses[edit]\n\nThe precise origin of gambling is unknown. It is generally believed that gambling in some form or another has been seen in almost every society in history. From the Ancient Greeks and Romans to Napoleon's France and Elizabethan England, much of history is filled with stories of entertainment based on games of chance.\n\nThe first known European gambling house, not called a casino although meeting the modern definition, was the Ridotto, established in Venice, Italy in 1638 by the Great Council of Venice to provide controlled gambling during the carnival season. It was closed in 1774 as the city government felt it was impoverishing the local gentry.[10]\n\nIn American history, early gambling establishments were known as saloons. The creation and importance of saloons was greatly influenced by four major cities: New Orleans, St. Louis, Chicago and San Francisco. It was in the saloons that travelers could find people to talk to, drink with, and often gamble with. During the early 20th century in America, gambling became outlawed and banned by state legislation and social reformers of the time. However, in 1931, gambling was legalized throughout the state of Nevada. America's first legalized casinos were set up in those places. In 1976 New Jersey allowed gambling in Atlantic City, now America's second largest gambling city.\n"
		},
		{
			"post_id": 22,
			"title": "a corbel is a structural piece of stone, wood or metal jutting from a wall to carry a superincumbent weight, a type of bracket.[1] A corbel is a solid piece of material in the wall, whereas a console is a piece applied to the structure.",
			"date_published": 1495330077.105,
			"body": "Blog post body"
		},
		{
			"post_id": 21,
			"title": "the rappness of our design",
			"date_published": 1495329790.17,
			"body": "a unique element that ideally leverages what we have in the rappland"
		},
		{
			"post_id": 20,
			"title": "villa",
			"date_published": 1495319131.722,
			"body": "https://en.wikipedia.org/wiki/Villa"
		},
		{
			"post_id": 19,
			"title": "the dwelling site ",
			"date_published": 1495258236.843,
			"body": "vincent knows the land well and we should consult him next time we meet."
		},
		{
			"post_id": 18,
			"title": "the earth and log wall",
			"date_published": 1495257874.995,
			"body": "the log earth is the way to go. how to combine them need experiment."
		},
		{
			"post_id": 17,
			"title": "independent kitchen design",
			"date_published": 1495256901.967,
			"body": "it should be seperated and independent from other house and rooms \n\nit should be absolutely safe and fire proof \n\nit is securely connected always and permanently back to the main quarter "
		},
		{
			"post_id": 16,
			"title": "restroom design ",
			"date_published": 1495256837.002,
			"body": "it should be easily expendable, as ground is graudally consumed and released for farming use\n\n"
		},
		{
			"post_id": 15,
			"title": "scale up to the future development",
			"date_published": 1495256683.057,
			"body": "Blog post body"
		},
		{
			"post_id": 14,
			"title": "roof design",
			"date_published": 1495256264.972,
			"body": "Blog post body"
		},
		{
			"post_id": 13,
			"title": "log preparation",
			"date_published": 1495249525.865,
			"body": "farm and collect logs and make them to unit length\n\nclear a piece of land dedicated for the logs storage\n\nair them and allow them to naturally dry before use"
		},
		{
			"post_id": 12,
			"title": "the door ",
			"date_published": 1495247736.253,
			"body": "log too?\n"
		},
		{
			"post_id": 11,
			"title": "log house building",
			"date_published": 1495244913.51,
			"body": "foundation columns \n\nlog walls\n\nearth mix to fill the walls and finish them from outside \n\nwindows on four four sides \n- 6 windows \n- position of windows should be tall, at least 2 meters from the ground level to be safe, they do not need to be large, in fact, should be relatively small to be safe;\n- the tall window requires the floor should be high inside the house, about 1.5 meters floor\n\nthe door \n\nroof design - should allow people to go to the top of the roof\n\ncooking stove\n\n- in a second small room annexed to the main building\n\nthe first building is one story, with the second building two stories"
		},
		{
			"post_id": 10,
			"title": "New blog post",
			"date_published": 1495241894.067,
			"body": "Our modern lives are drenched in chemicals, some of which can mimic hormones in our body's endocrine system.\n\nObesity, type 2 diabetes, and some cancer rates are on the rise in humans. While sperm count and fertility is on a downward slide in some populations. What if chemical exposure was partly responsible for these trends?\n\n\n\n\n\n\nExploring a family home in search of EDCs\n\n\n\n\n\n\n\n  \n\nHear the latest episode of Science Friction as we search a family home for biochemical tricksters.\n\nOne hypothesis is that a group of chemicals — known as 'endocrine disrupting chemicals' (EDCSs) — could affect human reproduction, puberty, metabolism and other functions controlled by hormones in our endocrine system.\n\nMany suspected EDCs are already in your home — but how much risk do they really pose? At what exposure level do they become unsafe?\n\nUnfortunately the answer is not straightforward, with a range of opinions held by scientists, industry and regulators.\n\nIn terms of scientific evidence, there are good laboratory studies that show some industrial chemicals affect endocrine function in mice and rats, and many examples of endocrine disruption in wildlife from chemicals in the environment.\n\nHowever, it's a lot harder to get conclusive evidence that these chemicals do the same in humans. This is partly because studying the long-term effects of everyday chemicals on humans is difficult.\n\n\"We can't test in humans directly. That would be absolutely unethical, to expose someone to the chemical and go, 'How are you doing today? How about tomorrow?\" said Associate Professor Frederic Leusch, an environmental toxicologist from Griffith University on this week's Science Friction.\n\nWe're also exposed to hundreds of chemicals each day — and these may interact in unforeseen ways.\n\nIs there a safe level of exposure?\n\nProfessor Leusch said we just don't know what level of exposure to EDCs is safe. Although, he said, the body has a strong repair system and is more resilient than we give it credit for.\n\nDr Andrea Gore, an endocrinologist from The University of Texas is of the view that it is less about the level of exposure and more about the timing of the exposure.\n\n\"Classical toxicology has always followed the mantra of the dose makes the poison — a higher dose will be worse than a lower dose; and there is a lower limit of exposure where there would be no effect,\" Dr Gore said.\n\nCurrent safety regulation of chemicals in Australia take this approach.\n\n\n\n\n\n\nWhat are EDCs?\n•Chemicals that mimic human hormones can be naturally occurring (such as those found in soy) or synthesised\n•It is difficult to know what chemicals are in what products due to limitations in labelling\n• Examples of industrial chemicals with the potential to mimic hormones include: synthetic hormones (in birth control products or HRT); Bisphenol A; phthalates; parabens; triclosan; resorcinol; perfluorinated compounds (PFCs); some flame retardants; heavy metals such as lead and mercury; some pesticides and herbicides (including DDT, endosulfan, synthetic pyrethroids and chlorpyrifos); and more (see resources below).\n•The evidence linking these chemicals to human health problems is controversial and hotly debated\n\nIn a statement to Science Friction, the federal Department of Health said chemicals introduced into Australia are regulated through the National Industrial Chemicals Notification Scheme (NICNAS). \n\nIt said risk assessments of chemicals, including some phthalates and brominated flame retardants, are published on the NICNAS website.\n\n\"For each of these chemicals, the effects are dose-responsive. These well-characterised examples with a classical dose-response effect allow a safe level of exposure to be identified and risk mitigation measures put in place,\" it said in the statement.\n\nBut scientists like Dr Gore argue that the classical toxicology approach does not allow for the possibility that very low levels of exposure to an EDC could have long-term effects, particularly if the exposure occurred at times when humans are very sensitive to hormones, such as in the womb or at puberty.\n\n\"Endocrinologists … say the timing makes the poison,\" she said.\n\n\"You can take a very low level of a chemical that disrupts a hormone and if you expose it during a developmental time of life when your body might not normally be exposed to a natural hormone at all, the body can respond to that low dose.\" \n\nAgain, this is very hard to test in humans, said Professor Leusch.\n\n\"We're very, very long lived and it's very difficult to link in an exposure when you were five to an effect when you're 20,\" he said. \n\nIn the end there's a range of opinions on whether there's enough evidence to raise a red flag on EDCs.\n\nBut until more is known, it may be a good idea to minimise our exposure to potential EDCs, said Professor Leusch.\n\n\"Until we can figure out what the safe concentration is, where the threshold is, I think we should aim to get exposed to as little as possible,\" he said. \n\nThe following suggestions are some simple ways that may limit your exposure to potential EDCs in the home.\n\nEat fresh food, and wash your fruit and veggies\n\n\n\n\n\nBlueberries in a white bowl being washed with water \nWashing fruit and vegetables is a simple step that can be taken to reduce any potential EDC exposure. (Flickr.com: Jim Belford (CC-BY-NC-2.0)) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBlueberries in a white bowl being washed with water\n\n\n\n\n\n\n\n \nFruit and vegetables can have residue from pesticides which may be EDCs. Simply washing your fruit and vegetables with water can remove most of these residues, Dr Gore said.\n\nShe also suggested eating fresh food over processed food, to reduce the risk of exposure to chemicals during processing.\n\n\"No matter how pristine processed organic spinach might be we don't know what chemicals it came into contact with while being processed — did it come into contact with detergents and packing chemicals? The recommendation is always fresh over processed.\"\n\nTin cans and jar lids are often lined with bisphenols, like BPA. And while many manufacturers are now making BPA-free products, Dr Gore said the chemicals being used to replace BPA may also present a risk.\n\n\"We know that many replacement chemicals are in the same family BPF, BPS are also endocrine disruptors,\" she said.\n\nWatch out for plastic\n\n\n\n\n\nA person puts food in a plastic container into the microwave \nAvoid microwaving plastic containers. (Getty Images: Brett Stevens) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA person puts food in a plastic container into the microwave\n\n\n\n\n\n\n\n \nPlastic can contain bisphenols like BPA and phthalates. To find out what your plastic container is made of, look for a number between one and seven somewhere on the packaging — the numbers 3 (PVC) and 7 (polycarbonate) are the ones to watch out for.\n\nHeating plastic containers — such as microwaving a takeaway container, or leaving a water bottle in a hot car — can cause BPA to leach from the plastic, said Dr Gore.\n\nOther suggestions are to avoid washing plastics with harsh detergents, which can cause the plastic to break down. Or opt for glass, porcelain or stainless steel over plastic containers.\n\nPhthalates can be found in plastic food wrap, vinyl flooring and soft toys. Toys, baby bottles and dummies containing more than 1 per cent of the phthalate DEHP have already been banned in Australia.\n\nWhile some countries like Australia have put some restrictions on the use of phthalates in toys, there is always a question over what is present in imported goods from countries with less regulation.\n\nMinimise exposure through personal care products\n\nCosmetics and personal care products — such as perfumes, nail polish, skin creams, shampoo and conditioner — can contain some types of phthalates and parabens (chemicals used as preservatives). Antibacterial soaps and some brands of toothpaste can contain triclosan.\n\nCheck the ingredient listing for parabens or phthalates, and be wary of artificial fragrances which can contain phthalates. However, it's often difficult to know what chemicals are in personal care products, especially in fragrances — Australian suppliers are not required to list the individual components.\n\nUsing less products is one way to reduce exposure. Or make your own products using common household ingredients, such as bicarb soda and coconut oil.\n\nCheck out your furnishings, clothing, and non-stick products\n\n\n\n\n\nA little girl sits on a couch with her feet up, reading a book \nAlways check if your furnishings come with a flame retardant, and what type (Public domain: Josh Applegate) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA little girl sits on a couch with her feet up, reading a book\n\n\n\n\n\n\n\n \nCommon household objects like your couch, mattress, water-proof clothing and non-stick cookware can contain potential EDCs in the form of flame retardants (such as PBDEs), stain and water resistant coatings (such as PFOAs), or non-stick coatings (PFCs). \n\n\"A lot of our products around the home are covered in these compounds that act as flame retardants should there be a fire,\" said Professor Leusch.\n\nBut, he said, there are ways to try to cut down your exposure to them.\n\n\"If you've got new carpets for example, I strongly recommend aerating the space quite thoroughly before so you don't breathe in that new carpet smell too much.\"\n\nWhen buying new products, try to check what types of flame retardant or stain-resistant chemicals it contains. And with non-stick cooking products, make sure you use them to the manufacturer's specifications (which often include low temperature usage). A further precaution is to throw away products if the non-stick surface is damaged.\n\nKeep your house clean, but with the right products\n\nCleaning products for everything from benchtops to the bathroom tiles can contain potential EDCs, such as 2-butoxyethanol and methoxydiglycol. If they contain artificial fragrance they may also contain phthalates.\n\nThere are many alternative cleaning products, such as baking powder as a general cleaner and deodoriser; lemon juice as a mild bleach; salt mixed with lemon juice or white vinegar to remove stains; or white vinegar as a deodoriser and mild disinfectant.\n\n\n\n\n\n\nScience Friction\n\n\n\n\n\n\n\nScience friction\n\n\n  \n\nFor more, subscribe to the Science Friction podcast. It's science, culture and everything in between.\n\nAnother source of exposure in the home can be from a build-up of potential EDCs, such as flame retardants, in household dust. Regular vacuuming, wiping down surfaces with a damp cloth, ventilating rooms and regularly cleaning air conditioners, heater inlets and vents can help reduce exposure.\n\nGreen chemistry – the road ahead?\n\nIt's estimated that there are close to 100,000 manufactured chemicals in our world, and we have not tested every single one of them, said Dr Leusch.\n\nHe is concerned about us finding out too late when industrial chemicals are toxic, but acknowledges the benefits they offer us.\n\n\"Chemistry and chemical engineering have done wonders for our life. We have to find a middle ground.\"\n\nMeanwhile, environmental health scientists, biologists and endocrinologists have started working with chemists to design chemicals that are don't mess with our endocrine system. \n\n\"If you want to understand and design a safe chemical that doesn't interfere with hormones, you actually need to know what a hormone is and how it acts and how to test it,\" said Dr Gore.\n"
		},
		{
			"post_id": 9,
			"title": "question your home and office",
			"date_published": 1495240141.909,
			"body": "Our modern lives are drenched in chemicals, some of which can mimic hormones in our body's endocrine system.\n\nObesity, type 2 diabetes, and some cancer rates are on the rise in humans. While sperm count and fertility is on a downward slide in some populations. What if chemical exposure was partly responsible for these trends?\n\nthe fact is- nobody is seriously worrying this too much. nobody hesitates to go back to his home. but this must change.\n"
		},
		{
			"post_id": 8,
			"title": "again,what is ohfarm?",
			"date_published": 1495240119.829,
			"body": "farm for your home and office"
		},
		{
			"post_id": 7,
			"title": "trip 8 ",
			"date_published": 1495239348.629,
			"body": "buy a simple small tv?\n\nbuild a log chair - important for studying in the night\n\nfinish landscaping\n- retaining walls \n- fence\n- turf\n- green swale \n- simple log furnishing for the house\n\ncontinue build up the farm\n\nprepare to sell pendragon"
		},
		{
			"post_id": 6,
			"title": "task list for trip 7",
			"date_published": 1484970435.4,
			"body": "banking issues\n\n- open account for professor sun's father\n- add yangba to nab account"
		},
		{
			"post_id": 5,
			"title": "grass and dirt bags",
			"date_published": 1484970081.246,
			"body": "- cut grass\n- mix with earth and fill the bags \n- use these bags for building the dams"
		},
		{
			"post_id": 4,
			"title": "build the house.",
			"date_published": 1484969416.848,
			"body": "materials \n- logs\n- rammed earth\n\nhouse site choice: \n\n- clear lot far from the forest to manage fire risk; "
		},
		{
			"post_id": 3,
			"title": "tasks on the farm one - build dams",
			"date_published": 1484969349.323,
			"body": "three potential dam sites. we started working on the site one. "
		},
		{
			"post_id": 2,
			"title": "mount pearl spring project",
			"date_published": 1477106116.55,
			"body": "- target to develop this tiny farm project into a profitable rentable city farm;\n- with farming; that is the basics;\n- with some simple living facilities, so family can stay there for noon and cook some lunch at least; expect them to go home in the evening; \n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}