{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1557356335_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": 1,
		"1557537700_1KnsqabvZFW3M93ejGdJX3NHdNuSaPsJAv": 1,
		"1563546340_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1557356335_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 1,
				"body": "I never understood why they had a domain accessible from the clearnet. Whether or not they were doing illegal activities along the \"gray area\" of providing the links (just like TPB does), if they run an .onion site only, more than likely they wouldn't have been busted.",
				"added": 1557499679
			},
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_293_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I think the access is motivated by audience size. Unfortunately the deep web has a reputation among the general population for being a collection of illegal activities so many \"upstanding\" citizens won't touch the Tor browser, or other access technology like ZeroNet. The fear of attracting LE is real, and the consequences can be devastating, but to foment change we must be brave, not stupid, but brave.\n\nI agree with you about the changes, but it was better if they published the information to access the site in some other places. Actually, is possible to register a VPS with a domain completely anonymous (look at Njalla + Monero), but then it requires really good OPSEC to maintain that \"anonymity\".",
				"added": 1557594636
			},
			{
				"comment_id": 5,
				"body": "> [quantumworld](#comment_451_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): You have to deal with them in the US as well. They are all scum of the earth in my view. The CIA is the worst of the worst.\n\nIn my humble opinion, worst offender is the NSA.",
				"added": 1557653411
			}
		],
		"1557537700_1KnsqabvZFW3M93ejGdJX3NHdNuSaPsJAv": [
			{
				"comment_id": 3,
				"body": "I would like to add another link for those who are interested: https://www.gnu.org/philosophy/javascript-trap.html",
				"added": 1557594761
			}
		],
		"1557414212_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [
			{
				"comment_id": 4,
				"body": "For those who don't want to be tracked through YouTube Javascript, these are the links for Invidious and the .onion version:\nhttps://invidio.us/watch?v=4Ia81e5KQpE\nhttp://axqzx4s6s54s32yentfqojs3x5i7faxza6xo3ehd4bzzsg2ii4fv2iid.onion/watch?v=4Ia81e5KQpE",
				"added": 1557594936
			}
		],
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": [
			{
				"comment_id": 6,
				"body": "I am still waiting for Wikipedia as an .onion site (even with disabled editing), but that would be a start.",
				"added": 1557654041
			}
		],
		"1559163351_1CZMjjnu2qd6BuoeLC35vc4o7A9LRtQZrJ": [
			{
				"comment_id": 7,
				"body": "I would like to read it but it's on a non https site... Too bad.",
				"added": 1562408560
			}
		],
		"1562978975_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_438_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): because you're part of the problem. [...]\n\nBecause otherwise you wouldn't give a shit about answering",
				"added": 1563398629
			},
			{
				"comment_id": 9,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_451_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you must be 6 or 8 years old to talk that, or you haven't grown up.both are possible.please continue to answer.\n\nFunny, you start a thread about \"The Whining Generations\" and you are the first that is complaining about nothing. Anyway, since I see that you like starting posts to complain about your miserable life inside a society where you think that you are more special than the others (hint: you aren't), I'll let you do it. I was actually thinking if it's worthy to consume my fingers to write this reply to a person like you, yet I did. Have fun with your life my friend, and now, since you will only reply with insults about something (or just whining), I'll say, don't feed the troll, and I will stop wasting your precious time /s.",
				"added": 1563548835
			}
		],
		"1563546340_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": [
			{
				"comment_id": 10,
				"body": "Thank you, this is much appreciated. Too bad that it doesn't support Libreboot though...",
				"added": 1563548972
			}
		],
		"1561216168_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 11,
				"body": "I did in the past, not anymore. Reasons are some projects are closed source/proprietary and ethically I can't run them. Even because it's not possible to prove what they are actually doing.",
				"added": 1563549299
			}
		]
	},
	"comment_vote": {
		"3_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1,
		"96_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}