{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1607215052_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1607592294_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"1607663597_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1608510782_1C6wRvZoviXwxkfoeQemf5LzPfjx9Ri1dm": 1,
		"1608588854_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"1608830774_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1608908993_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1609094366_1TvXYAmKdY6X7AnByKBU22YnyEduwFvSp": 1,
		"1609464689_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610219039_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": 1,
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": 1,
		"1610364210_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"1610438350_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": 1,
		"1610690590_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1610793134_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg": 1,
		"1610999130_1J46C7eJx1gagCBw898jtb8n3RCWp2EXQ1": 1,
		"1611150861_1DaNdDeFckV6pdQCFrtHCMF7ZfJEPhaJQd": 1,
		"1611411500_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"1612011009_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1616953116_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1617620698_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG": 1,
		"1625081391_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1629470255_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU": 1
	},
	"next_comment_id": 41,
	"comment": {
		"1608417688_1HrVG2Jz8897agGqyS3oYyFeaocypxp8Mg": [
			{
				"comment_id": 1,
				"body": "I think it's http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1608494273
			}
		],
		"1608462319_15LtZkasNQ3vHcRjWvTYZgnqLCCWvoPhEh": [
			{
				"comment_id": 2,
				"body": "e",
				"added": 1608533896
			}
		],
		"1608712796_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 3,
				"body": "Aight, just go to RuTracker then and get 1.06 instead without any shady links and waiting: https://rutracker.org/forum/viewtopic.php?t=5981970\nThe link has a magnet icon and here it is: magnet:?xt=urn:btih:A8A519889FE66A6ED19C3EC9AD3726390E66A97A&tr=http%3A%2F%2Fbt.t-ru.org%2Fann%3Fmagnet&dn=Cyberpunk%202077%20%5BL%5D%20%5BRUS%20%2B%20ENG%20%2B%2016%20%2F%20RUS%20%2B%20ENG%5D%20(2020)%20(1.06)%20%5BGOG-Rip%5D\n\nFuck you and your spam/viruses btw.",
				"added": 1608829666
			}
		],
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "based",
				"added": 1610231051
			}
		],
		"1610219039_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": [
			{
				"comment_id": 5,
				"body": "I swear I saw the link here somewhere and now I don't lol. The better supported version is https://play.google.com/store/apps/details?id=in.canews.zeronetmobile (source: https://github.com/canewsin/zeronet_mobile ) It's not perfect but it has Tor bundled and works fine. There's also 'ios' directory on GitHub so there's hope it will be supported one day. For now it's Android only.",
				"added": 1610231347
			}
		],
		"1610231360_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 6,
				"body": "Ban more influencers on Twitter/Instagram/Facebook/any_big_tech_platform. Without enough motivation people won't ever leave their cozy echo chambers.",
				"added": 1610231625
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 7,
				"body": "Debian is good enough, mostly \"just works\". I've been using it for more than a decade.",
				"added": 1610352027
			}
		],
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "Typical \"\"\"she/her\"\"\" faggot lmao. No way in hell a real woman would be able to do anything remotely similar but these mentally and sexually confused assholes usually are.",
				"added": 1610397089
			},
			{
				"comment_id": 9,
				"body": "> [quantumkitty](#comment_528_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Hate to tell you.. but that means' you're Gay.\n\nHow is that? These troons don't even try to pass and they're ugly. Their little \"fight for equality\" only makes it harder for real (biological) women to achieve anything be it sports or IT. Look, we have \"\"\"women\"\"\" in our team, we're fucking diverse! No, you have fags and troons and maybe a woman secretary or a janny.",
				"added": 1610399283
			}
		],
		"1610438350_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": [
			{
				"comment_id": 10,
				"body": "Facts.",
				"added": 1610440804
			}
		],
		"1610690590_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "> [quantumkitty](#comment_546_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): people like to dig up old shit that people post just to Cancel and bully them\n\nWell, good luck cancelling deez nuts then lmao. Everyone here is pseudonymous and if you only use Tor you're pretty safe from this shit. At least some bored faggot won't find you but the FBI and such still can, especially if you set up \"Tor only\" in ZN but still use a regular browser without even a VPN. Zeronet easily leaks so take care. Anyway, don't post truly illegal stuff and be safe.",
				"added": 1610747860
			}
		],
		"1610760100_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": [
			{
				"comment_id": 12,
				"body": "BY EWAN PALMER ON 8/4/18 AT 9:15 AM EDT\n\nSo, any updates 3 years later?",
				"added": 1610807157
			}
		],
		"1610874256_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": [
			{
				"comment_id": 13,
				"body": "Whoa no way! A Chinese browser spies on their users! That's mind blowing fr!",
				"added": 1610875786
			},
			{
				"comment_id": 14,
				"body": "> [iiiiii](#comment_8_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN): QQ is an instant messaging software, has 600000000 users.\n\nEven worse. Every closed source/centralized IM spies on its users, that's how they stay in business. And Tencent is known for their shady practices already.",
				"added": 1610877272
			},
			{
				"comment_id": 16,
				"body": "On desktop, every program has full access to all user's files. I hope it will change one day to something more secure like what Android does. Can't say anything about Windows but on Linux there are plenty of sandboxing options such as containers, chroots, AppArmor/SELinux/TOMOYO and even full VMs. But it's not mainstream yet and mostly used only to reduce the damage if the program is hacked.",
				"added": 1610951991
			}
		],
		"1610876302_14xmVmzUMAx4egBicMbRNkqkrrgRgLFgYg": [],
		"1611499319_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 17,
				"body": "what",
				"added": 1611558373
			},
			{
				"comment_id": 18,
				"body": "Check the logs to see the actual case of the failure. I guess ZN should update your local copy and then push that update to your immediate peers, I doubt any botnet can prevent you from performing any of these actions. Some local issue with your node is more likely.\n\nAnd if you English isn't good you can use a translator, they do a decent job these days.",
				"added": 1611563781
			}
		],
		"1612090755_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 19,
				"body": "Solved how exactly?",
				"added": 1612097882
			},
			{
				"comment_id": 20,
				"body": "That's not a good idea, Python 2 is really deprecated: https://www.python.org/doc/sunset-python-2/\n> We are volunteers who make and take care of the Python programming language. We have decided that January 1, 2020, was the day that we sunset Python 2. That means that we will not improve it anymore after that day, even if someone finds a security problem in it. You should upgrade to Python 3 as soon as you can.",
				"added": 1612103203
			}
		],
		"1612141666_16k8inBJAVx1mvAyEES8eSMKywbGXNFTZ7": [
			{
				"comment_id": 21,
				"body": "no.",
				"added": 1612160327
			}
		],
		"1613332768_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 22,
				"body": "Let's pretend this is legit. What would be the motivation for such generosity?",
				"added": 1613389595
			},
			{
				"comment_id": 23,
				"body": "The OP address is empty and those two addresses in the replies are the same (even though they're supposed to belong to different persons) and aren't even on the blockchain... OP should try way harder to convince people, especially here.",
				"added": 1613732558
			}
		],
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 24,
				"body": "I want to address this statement:\n> The market is still small, and 21 million bitcoins is very few for the population of Earth.\n\nEvery bitcoin consists of 1E8 (100 mil) satoshis so it's actually 2100000000000000 (21E14) indivisible units. Equals to 300000 satoshis per person currently. Even if that isn't enough for practical purposes (if one satoshi becomes much more that $1 for example) nothing stops the developers from allowing to spend a fraction of satoshi. Just like in a normal transaction there would be an additional field that specifies these fractions in the transaction output and the software checks if the balances are correct (as it already does for regular satoshis/bitcoins).\n\nSay, million satocents per 1 satoshi should be enough. It's a pure technicality. In the end all that changes is the way of calculating your balance, you'll have normal satoshis + these \"satocents\" (probably displayed as a fractional part) just like you have dollars and cents today. Instead of predictable inflation like in DOGE/Monero Bitcoin still stays deflationary while not sacrificing the usability.",
				"added": 1613998296
			},
			{
				"comment_id": 25,
				"body": "Yeah, it's a quote from xealits. Also, regarding the distribution skepsis: I don't think it matters much nor that fair distribution can be achieved in principle. There will always be early adopters who believed in something new and 95% of the population would just shrug and move along. Later the early adopters are either rewarded (if the thing takes off) or punished (by losing their investments). No one knows it beforehand, it's a risk that you can take. The Bitcoin whitepaper and all its source code was public from the beginning (if you don't count those first blocks that Satoshi mined himself).\n\nNothing prevented people from joining and getting their share, except their ignorance or lack of knowledge. But how would they learn about it if not through the media? And media wasn't interested because it was just another \"geek toy\". There's no one to blame but yourself if you haven't taken time to read the paper and understand how revolutionary this thing is. Best part is that the whitepaper is written in extremely simple language with close to no math so any IT person should be able to understand the core principles, unlike the modern complex Proof of Stake algorithms. I don't understand how PoS works, I'll be honest. It's a lot of math and probabilities and I'm bad in understanding math even though I'm a programmer, mostly because of crazy notation that's different in every paper and one-letter-variables-in-100-different-fonts. But I understood Bitcoin instantly after reading those few pages. It's brilliant in its simplicity.\n\nThat part above was about the impossibility of fair distribution, tl;dr you can't convince 100% of humanity to adopt your new shiny thing so that it's fair and everyone is rich in 10 years. Not possible. And it doesn't matter because of that.\n\nAnother point is why it doesn't matter. To understand that let's think why this uneven distribution might matter.\n\n- all coins are hoarded, it's impossible for an average Joe to buy some\n- the price can be easily manipulated by the whales\n- it's unfair, some people have a lot of money and I don't!\n\nEven people who hold a lot of BTC currently need to move them to make them valuable. There's no point in sitting on your coins if you can't get anything tangible for them. Sooner or later you will spend them (sell or exchange for goods&services). So there will be no shortage of coins. Miners will also sell them to pay for their new hardware and associated costs. And traders as usual will provide liquidity to scalp a little bit for themselves. Traders are _good_ for you even though it might look like they profit off you (which is also true).\n\nThe price indeed can fluctuate quite a lot, we've seen some ups and downs. But Bitcoin supply is limited so by all means its price will go up in the long run. If it goes down it's just an opportunity for everyone to buy more. Also, many big funds and companies invested in BTC and I personally don't think they will dump it to oblivion just for the sake of it. So buy the dips carefully and it might pay off in a year or two!\n\nThe unfairness point is already deboonked twice, it's your fault you haven't adopted earlier but you can still do it because BTC is divisible and you can buy a small fraction for even $100 or so. Just keep your coins in your own local wallet and not at exchanges. Not your keys — not your coins.",
				"added": 1614025176
			}
		],
		"1614726531_14JFttTvjwR9PitBWPMU8FEqRCwACAeekM": [
			{
				"comment_id": 26,
				"body": "Such a shame ZN is written in Python... a very unfortunate language choice these days (I know it started years ago when it was reasonable). It can't be integrated into anything, can't be compiled or installed on a slower device (like ARM/MIPS/STM controller), it can't utilize more than one core and often consumes 100% of it for a while and everything else gets stuck (not even the sidebar can be loaded) etc. There were attempts to rewrite it in Go but all those projects are long abandoned. IPFS isn't good currently, that I agree with. But ZN isn't progressing much either. It's a good and working tech but the implementation is fundamentally flawed and needs a complete rewrite to work reliably on mobile and low power devices without a huge slow runtime with an ugly GIL in the middle.",
				"added": 1614773610
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 27,
				"body": "Putin is not based in any way possible. He's a head of the mafia that runs the state and Russia is his (and his friends') personal wallet. One might argue that corruption exists everywhere and it's true but no other big country that tries to stay relevant (at least on paper) only cares about stealing as much money as possible while destroying jobs and \"forcibly acquiring\" businesses. The West only knows and hears about Putin banning \"lgbt propaganda\" which is only about informing the minors and it's applied very selectively, usually to suppress his political opponents. \n\nAny successful business is getting appropriated either via buying it by the Putin's friends or taking it away and arresting the CEO (if he doesn't run away to another country like Durov). The only businesses that are relatively safe are branches of international companies, and even that's not a 100% guarantee. But the #1 rule of starting a business in Russia is \"don't start a business in Russia\". Putin is against any innovations and he hates and fears the Internet because he can't control it fully. And if any innovation happens anyway and if it becomes profitable (not before that) the aforementioned scenario happens.\n\nMigrants can enter the country even more easily than the US, there's no visa regime with many neighboring poor countries. In most towns salaries are miserable and Moscow is like a different country completely. Unlike the US all money from the regions goes to Moscow first and then they decide on each region's budget. There are some local laws but they're so insignificant not many people even care. So Russia is a \"Federation\" only on paper. In contrast, the US is a federation of independent states that are vastly different in laws and people.\n\nPutin will never stop accumulating wealth through overpriced contracts and \"secret budgets\" because he knows he will never retire. And he won't let anyone outside his corrupted and rotten \"system\" take his place because as soon as that happens there will be so many investigations and arrests he'd rather off himself immediately. Or he gets Epstein'd by his friends who are also interested in him staying in power. There will be no fair elections, there will be no peaceful transfer of power, it's not possible and no one is interested in it (except the average Joes). He already rewrote some parts of the Constitution to suit his needs and people happily \"voted\" for that (of course, most of that was rigged and never investigated). He also writes laws that allow him stay in power indefinitely, establish new authorities and so on.\n\nWhat's even worse, there are very well known facts of his and his friends crimes, tons of evidence, photos, documents and names and it will never be investigated because all branches of power and most of the media are under his control. I laugh at the concerned US citizens that were panicking because Trump was \"literally Hitler\". Guys, you don't even know how bad it is here. At least you have independent judges, FBI and police and I mean, not directly and manually controlled by the President.\n\nI know it's not all rainbows and butterflies but you don't know shit about living in an authoritarian state. Keep voting for the Dems and establishment and you'll soon figure that out yourself though. Trump was extremely \"anti-Putin\" in everything he did and you thought he was the opposite despite all his actions. I wish we had him as our president instead of this bald fucking crook we have for more than 20 years already.",
				"added": 1615119475
			}
		],
		"1615551849_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX": [
			{
				"comment_id": 28,
				"body": "You have many hardcoded links that point to http://127.0.0.1:43110. Not everyone hosts the node on the same machine, for example I have mine installed on a NAS so your images don't load for me. Best way to link to the same host is to use links in the format of `/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/merged-CDN/15fDN4wasXuyS8krtKvrxEVmWWLz6Qh518/data/users/18ASnnFHznjoSDUR9b8UdBrz2p3RjzoeuG/obscura1615552163679.jpg` so no matter what the host is it should work.",
				"added": 1615556171
			},
			{
				"comment_id": 29,
				"body": "> [5h1n1n9d4rkn355](#comment_8_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): What is an NAS?\n\nNetwork Attached Storage but it's unrelated. It's my another PC so I use its IP instead of 127.0.0.1 and I don't run ZeroNet locally. Also, your images most likely won't work if someone opens your site using a public gateway.",
				"added": 1615562908
			}
		],
		"1616553738_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 30,
				"body": "Looks like a typical scam, no product, only social media and buzzwords. Remember Rossi and his E-Cat reactors? Any news about this breakthrough? This is gonna be the same _at best_.",
				"added": 1616759844
			}
		],
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": [
			{
				"comment_id": 31,
				"body": "Doesn't work in Brave with shields enabled. I searched for \"ubuntu\", it says \"ubuntu returned 681 results 0 results loaded\", nothing else is displayed. Clicking the button \"20 More Results\" doesn't show anything too. The console is full of errors like this:\n\nUpdating IndexedDB\nVM385:199 Uncaught SyntaxError: Unexpected token ','\n    at Function (<anonymous>)\n    at Image._0x3a52d5.<computed> ((index):12)\n_0x3a52d5.<computed> @ (index):12\nload (async)\na @ (index):12\n(anonymous) @ VM384:1\n(anonymous) @ (index):12\nf @ (index):9\n(anonymous) @ (index):9\nemit @ (index):9\nendReadableNT @ (index):9\nItem.run @ (index):9\ndrainQueue @ (index):9\nsetTimeout (async)\nrunTimeout @ (index):9\nprocess.nextTick @ (index):9\nmaybeReadMore @ (index):9\naddChunk @ (index):9\nreadableAddChunk @ (index):9\nReadable.push @ (index):9\n(anonymous) @ (index):9\n(anonymous) @ (index):9\nsetTimeout (async)\nrunTimeout @ (index):9\nprocess.nextTick @ (index):9\nmaybeReadMore @ (index):9\naddChunk @ (index):9\nreadableAddChunk @ (index):9\nReadable.push @ (index):9\n(anonymous) @ (index):9\n(anonymous) @ (index):9\nsetTimeout (async)\nrunTimeout @ (index):9\nprocess.nextTick @ (index):9\nonwrite @ (index):9\nWritableState.onwrite @ (index):9\n_write @ (index):9\ndoWrite @ (index):9\nwriteOrBuffer @ (index):9\nWritable.write @ (index):9\nondata @ (index):9\nemit @ (index):9\naddChunk @ (index):9\nreadableAddChunk @ (index):9\nReadable.push @ (index):9\n_push @ (index):9\n_message @ (index):9\nhave @ (index):9\n(anonymous) @ (index):9\n(anonymous) @ (index):9\nsucceed @ (index):9\nPromise.then (async)\nsha1 @ (index):9\nonChunk @ (index):9\n_callback @ (index):9\n_onPiece @ (index):9\n_onMessage @ (index):9\n_write @ (index):9\ndoWrite @ (index):9\nwriteOrBuffer @ (index):9\nWritable.write @ (index):9\nondata @ (index):9\nemit @ (index):9\naddChunk @ (index):9\nreadableAddChunk @ (index):9\nReadable.push @ (index):9\n_push @ (index):9\n_message @ (index):9\npiece @ (index):9\nrespond @ (index):9\nonResponse @ (index):9\n(anonymous) @ (index):9\n(anonymous) @ (index):9\n(anonymous) @ (index):9\nonceWrapper @ (index):9\nemit @ (index):9\nendReadableNT @ (index):9\nItem.run @ (index):9\ndrainQueue @ (index):9\nsetTimeout (async)\nrunTimeout @ (index):9\nprocess.nextTick @ (index):9\nmaybeReadMore @ (index):9\naddChunk @ (index):9\nreadableAddChunk @ (index):9\nReadable.push @ (index):9\n(anonymous) @ (index):9\nwrite @ (index):9",
				"added": 1617090430
			},
			{
				"comment_id": 38,
				"body": "The decentralized torrent site that goes offline. Uhhhhh",
				"added": 1624950720
			}
		],
		"1618002997_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": [
			{
				"comment_id": 32,
				"body": "> [karhen](#comment_24_1PSE9tMzYJFEAAXYArxwJj56F9x23TqpS2): I guess freenet encrypts even your data ? (unknown is always encrypted) [...]\n\nFreenet works in a different way fundamentally. It stores, sends and receives encrypted blocks and the key to decrypt them isn't stored or transferred anywhere. It's included in the link instead. So you retrieve a block using the hash part of the link and then decrypt it locally using the key part of the URL. This way no one knows what they store and there's no way to find it except via getting the hashes and keys to decrypt those blocks. ZN only uses hashes like torrents and no detached keys, this whole idea isn't applicable by design. You can encrypt your local storage but it's very different: if you give away the key/password to decrypt it it will be obvious which sites you explicitly visited and seeded. Freenet has plausible deniability, ZN doesn't.",
				"added": 1618053801
			}
		],
		"1620567834_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 33,
				"body": "Try Lightning Network. It's truly a game changer, instant transactions with Bitcoins (faster than credit card processing), tor-grade anonymity (no blockchain traces at all), almost non-existent fees (~1-2 sats per transaction which is currently about $0.00055). At the low level it requires some non-obvious setup like acquiring inbound capacity to receive Bitcoins but:\n1) if you only want to spend, that doesn't concern you at all, open a channel and start spending\n2) you can use mobile wallets like Breez or Muun, they handle all that for you (they open a channel _to_ you automatically so you get the capacity transparently), those look pretty decent and minimalistic. Basically, on mobile you don't care about these details at all, you press Send or Receive and that's it. Everything else is done behind the scenes and you're always in control of your money.\n\nI was surprised to find out that LN is actually quite popular and supported by many merchants, there are various apps for both spending and receiving money using it. I heard about it long ago but there was no significant buzz, recently I decided to check it out and it's very alive and kicking! Still, it's in beta so don't lock all your savings there.\n\nPS: LN is not another shitcoin/fork and greedy handrubbers behind it. It works with Bitcoin and Litecoin currently and it needs the actual blockchain to function. But it's used for initial deposit and final settlement only, all actual transactions happen outside in its own network, again, using the native crypto (BTC or LTC) and not some stupid token substitute.",
				"added": 1620693123
			}
		],
		"1620756113_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 34,
				"body": "Impressive. Very based.",
				"added": 1621163848
			}
		],
		"1623521462_1CPMi1adhz1sh7dLTfbppPztkoH6wUUsS8": [
			{
				"comment_id": 35,
				"body": "Imagine paying for registering for a \"\"\"free\"\"\" service only to get spied later on. 1000 IQ move lmao.",
				"added": 1623574779
			}
		],
		"1623652167_1ByyvGdKSdKTywR6F8tmFAk3RsWUHP962E": [
			{
				"comment_id": 36,
				"body": "You should _really_ replace your local IP with 127.0.0.1. No need to expose your internal network addresses to the world (also they don't work for anyone except yourself).",
				"added": 1623674721
			},
			{
				"comment_id": 37,
				"body": "> [croatame](#comment_28_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS): There's no need to include that when making a link. Put the / and the long string of characters and the trailing / within the parenthesis and that link will work for everyone equally. [...]\n\nYes, but it doesn't work like that on every zite. Some automatically replace whatever IP the user posts with just / (so it's relative to the current domain/ip and works for everyone). Some replace it with 127.0.0.1:43110 and it breaks for people hosting the node on a remote machine. Some do nothing. The best way is the first method, of course.",
				"added": 1623684056
			}
		],
		"1629547543_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 39,
				"body": "If this fact aligns with my views it's real, I don't care :gigachad:",
				"added": 1629552041
			}
		],
		"1630047329_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 40,
				"body": "The writing's on the wall, it's clearly a conspiracy as you said. Only dumbfucks wouldn't get it.",
				"added": 1630053440
			}
		]
	},
	"comment_vote": {
		"8_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh": 1,
		"2_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": 1,
		"11_1Jr9UCuUrj9Cohzs7BMyDUJfhDhGxLBu6E": 1,
		"2_1Ef2FUbiD5kqzq5NkSfj1VWHP3JS91zH4k": 1,
		"48_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"3_134n1AjUa7jxhr52QcrkDdUxLZXc459CaD": 1,
		"4_134n1AjUa7jxhr52QcrkDdUxLZXc459CaD": 1,
		"45_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"2774_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2776_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_12TkoeBiJMGSPoetH8DhErZExjPvVE4x8B": 1,
		"182_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"10_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH": 1,
		"2824_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"35_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"60_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"5_1JT342LZCKfgp8r2FYMruVc2jvFXk3gL24": 1,
		"4_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"3_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"2827_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"501_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"752_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"751_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"750_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"753_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"23_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"8_14gVN1xwTD2mmRCRaBZFAK3FnDqFxvpvWH": 1,
		"1_1ApLZcR6jewmFQQmfruTbDtdHc1X1qbMeP": 1,
		"56_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"1_1GANYtYYvAszYKLRSLWBkYEjmdhQrbThNr": 1,
		"2_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"4_1Q1XaWRtj7SGymmyrop2PSmM35kHckmHjf": 1,
		"11_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"2_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp": 1,
		"33_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"13_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"1_135rBgRJsz349UMDrZ8xbfoZSB44ic7Wt2": 1,
		"61_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"1_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"23_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"25_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"12_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY": 1,
		"14_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"56_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"5_1Ec11mGe5joBoboUH2s2idKHp1YVbzaepq": 1,
		"60_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"2902_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY": 1,
		"4_1FjKyr9sfUy852mdxxEC7EtbfEWkUQUDTY": 1,
		"14_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg": 1,
		"64_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"2921_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT": 1,
		"10_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": 1,
		"15_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"218_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"9_1Ec11mGe5joBoboUH2s2idKHp1YVbzaepq": 1,
		"1_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"1_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": 1,
		"22_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL": 1,
		"5_18qRmb5CCTuAwYDYLRGC9cZrnRe4Bt3rjb": 1,
		"1_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"2_1MUXpeXL4m6WZ6JDgCUfSvQerJopfLxCM6": 1,
		"788_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE": 1,
		"67_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"32_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"13_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": 1,
		"9_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": 1,
		"3_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"95_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"2_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": 1,
		"19_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"5_1KBserDE8oownu1aR5REHcC3jf9qNkmQDo": 1,
		"11_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": 1,
		"3014_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"36_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"25_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"117_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"1_15JFnMnQDvpoERDBankFjwVSpiaLSsTTxq": 1,
		"294_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"29_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA": 1,
		"3125_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"95_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"3197_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}