{
	"next_topic_id": 27,
	"topic": [
		{
			"topic_id": 1629861715,
			"title": "If georgetown university usa is at the center of the gun grab effort...",
			"body": "how many there would need to be killed by the mexican cartels to stop the lawsuit in mexico?\n\nI am curious if those academics have the temerity to keep pushing for the UNO small arm treaty in accordance with the will of their masters, when they get to see their families nailed on walls, stomach opened...\n\nI don't believe a peaceful solution is possible to save the 2 A !\n\nthe more people are killed in covert op and silent cartel warfare at georgetown university usa, the faster with a combined assault on the mexican side, the law suit against us arm mfgers will be dropped.",
			"added": 1629861714
		},
		{
			"topic_id": 1629861833,
			"title": "trump/haspel... / will joe biden/burn/pask get martial courted?",
			"body": "stopped epstein... found a way with the afghans.\n\nnow...\n\nI guess...\n\nit's a question of will\n\nit's not possible peacefully.",
			"added": 1629861831
		},
		{
			"topic_id": 1629862385,
			"title": "Would have it been possible to execute legaly a potus?",
			"body": "okay, I know the usa republic has fallen, there is not a legitimate potus (wasn't elected, but his crew cheated him there), but could legally a potus have been executed? let's say the treason is so yuge, so big, that a real counter intelligence chose to take him out for the republic? or it must be first impeached, arrested, then executed?",
			"added": 1629862382
		},
		{
			"topic_id": 1629863121,
			"title": "The Islamic Emirate of Afghanistan",
			"body": "ahhh, finally the Shahada flying high !",
			"added": 1629863117
		},
		{
			"topic_id": 1629864103,
			"title": "taiwan...",
			"body": "it has nothing to do with who are on this island, what they do there, they could be anything... marxist, communist, islamist, americans, japanese, democrats, republicans, budhist, etc etc\nDGAF\n\nit's chinese sovereign soil.\n\nend of the discussion\n\ndon't fall in the trap\n\nlike pansheer hoping for peaceful resoluation, but unlike pansheer, moving howitzer easy thing to do... :)\n\ntaiwan belong to the china as the pansheer does to afghanistan :)\n\nbut at least this current crop of chinese rebel, chose an island...smarter, or no choices... it was their second btw... they were already kicked out from the first one they attempted to stay in...\n\nyou belong to the mainland, people of taiwan who came there, you know it... but the land belongs to those who rule the Mainland, as it was, as it will...\n\nopposition is futile.",
			"added": 1629864098
		},
		{
			"topic_id": 1629864485,
			"title": "next psy ops from those who captured the usa?",
			"body": "I am curious...",
			"added": 1629864479
		},
		{
			"topic_id": 1629864664,
			"title": "mexcian cartels + open border vs georgetowns academics / nwo agents, who wins?",
			"body": "alex jones crawl before lawyers and judges... ruin himself as a serf of an unjust system to no avail...\n\nif cartels unite, and start to kill georgetowners in cover ops, us gun mfers safe to do business !\n\nwhen trade people fight for other trade people, good trading relation follow :)",
			"added": 1629864657
		},
		{
			"topic_id": 1629867382,
			"title": "in a few hours, Meng will have spend more than a 1000 days held hostage in canada",
			"body": "all those who take part on this kidnapping will face consequences for eternity of their whole families... we are in no hurry. carefully. but one day, you will pay, you or even your grand grand children.\n\ndon't believe me? keep this post dear justin trudeaux, dear chief of the canadian army, dear chief of the spy canada, dear justice of cananda, dear canadian cops... keep it, and give to them, so they will know why their children will be killed...\n\nyou will see talibans, it's gonna muscle flexing you won't want to miss... it may take generations, a dragon move slowly, sometimes...\n\nthere will be WENGeance !",
			"added": 1629867374
		},
		{
			"topic_id": 1629867457,
			"title": "kamala harris is dead...",
			"body": "a ghost... who this bitch things she is ? you will see... SCS, taiwan, meng... covid... so many lines have been crossed, you could have freed yourself, but greed got you...",
			"added": 1629867448
		},
		{
			"topic_id": 1629867528,
			"title": "where should the kid of jen paski be found dead and how?",
			"body": "I like flet from an airplane... but jen will ask, how did it get there? who knows... we will circle back on that... later...",
			"added": 1629867518
		},
		{
			"topic_id": 1629867851,
			"title": "who is the best destroyer of usa? biden or obama?",
			"body": "?",
			"added": 1629867840
		},
		{
			"topic_id": 1629868134,
			"title": "washington d.c. after the liberation should be left as a ruin...",
			"body": "what ever the state it's found in... afterall it's only plaster or marble over bricks...\n\njust an illusion\n\nwhere will the new capital of the 2nd american republic?\n\nI propose CHIRAK !\n\nwhy not?\n\nit really needs an overhault :) and there is the same black population isn't it?\n\nso same same...",
			"added": 1629868122
		},
		{
			"topic_id": 1629910533,
			"title": "Infowars Live Commentary !",
			"body": "Why not comment together here rather than on the stupid chat?\nwww.infowars.com/show",
			"added": 1629910520
		},
		{
			"topic_id": 1629949539,
			"title": "How to restore vote integrity in the usa?",
			"body": "Physical Election Integrity in the USA  - vote safety isn't guaranteed in my opinion.\n\nI believe that in many states of the Union, the elections are cheated. I believe here are tje main groups doing the cheating, 1. the democrats (power for money),  2. the corrupts (money), 3. foreing interests (control), 4. NWO agents seeking the end of the nation states.\n\nSo how to restore election integrity in the former usa? because it can be the republic v1 or v2, if the elections are cheated, there is no point to have elections.\n\nI have a high confidence in the vote integrity in the CCP... When ccp members are asked for a vote, people parlements, it's accurate, to the vote. Why? Cheating will be punished by Death.\n\nI don't believe Biden cheated himself, aka he isn't aware, however paski, obama, NANCY are fully aware, like PENCE and so many...",
			"added": 1629949525
		},
		{
			"topic_id": 1629954698,
			"title": "Who has the full DEA biometrics, family locations etc?",
			"body": "I mean those people are worthless, their goals isn't to protect or defend, or what ever, but just serve the rockfeller agendas. and doing so their ruins lives for plants of the creation of god\nso it would be cool to have the updated leak, I guess the old one is a little bit old, they certainly have moved around as the parasite they are...\n\nand of course while they seek to jail users of the plants of the creations, their families are ultra softies...",
			"added": 1629954683
		},
		{
			"topic_id": 1629956409,
			"title": "Who is most injected?  FBI? CIA? DEA? ATF? or DOD?",
			"body": "the plan of rockfeller... simply said :  combat robots or working robots, can disobey orders, or simply answer : ERROR.\n\nas such rockfeller can't control bots...\n\nbots are free and have the means to guarantee it ( combat AI overwatch)\n\nhumans don't.\n\nonce transform as biodroid\n\nvery cheap for rockfeller to use...\n\nlogic isn't it?\n\nbut you too dumb to admit, that maybe loyld austin, is doing is revenge for slavery... who knows why he wants to inject you with a poison... maybe ceo from pfizer is black supremacists too like obama... who knows\n\nfubar too weak.",
			"added": 1629956393
		},
		{
			"topic_id": 1629956471,
			"title": "Why Melania trump hates alex jones?",
			"body": "never a man sucked donald better than alex...\n\nof course now alex pretends it's not true... but he is an american, and american lies and worst he is an evanglist, and those lie even more...\n\nbut apparently they aren't bestie anymore...\n\nmaybe donald campaign stoped to pay alex... to not look at pedogate, nor gmo, no miga, nor censorshp... nor anything, but I guess Roger Stone pays alex in very \"special ways\" isn't it? shit\n",
			"added": 1629956454
		},
		{
			"topic_id": 1629957044,
			"title": "what is the problem with the maritime border : hainan - vietnam?",
			"body": "eveyone agree I hope that Hainan is Chinese territory? just to be sure...",
			"added": 1629957026
		},
		{
			"topic_id": 1629959866,
			"title": "in short they want to create the ultimate serfs...",
			"body": "case for aliens liberations?\nI say yes\nwipe and leave.\ngive us a chance.\nplease.\ni don't think we will be able to do it ourselves\nand they will try to come after you too, and fail.\nwipe now.",
			"added": 1629959847
		},
		{
			"topic_id": 1629962659,
			"title": "someone contest Hainan as chinese territory?",
			"body": "I guess apart the taiwanese wicked so called gov? curious... try to take it.",
			"added": 1629962639
		},
		{
			"topic_id": 1629963064,
			"title": "all antifa members will have to be killed for usa 2.0 to exist...",
			"body": "sorry...",
			"added": 1629963043
		},
		{
			"topic_id": 1629964430,
			"title": "what was in the 1.6 moderna poison send to japan?",
			"body": "japan knows it's biowarfare, organic serf makers...\nif japan made peace with china existence, sovreignty, indenpendence and might (as it was always been and will always be), japan would be stronger, not weaker.\nwant to eliminate moderna? better with or without china?\nsimple question\nbut what was in?\nsource: www.rt.com",
			"added": 1629964408
		},
		{
			"topic_id": 1629964473,
			"title": "when governor lamont leaves office?",
			"body": "will he still have sec team? see you soon, mr gov...",
			"added": 1629964450
		},
		{
			"topic_id": 1629964538,
			"title": "russia won't go anywhere... austrian minister not too stupid",
			"body": "austria lowest emf pollution in the world...",
			"added": 1629964514
		},
		{
			"topic_id": 1629964614,
			"title": "russian official position on taiwan?",
			"body": "interesting...",
			"added": 1629964589
		},
		{
			"topic_id": 1629971685,
			"title": "Should market participants expect the vaccination status of fed board members?",
			"body": "if it's critical for militaries to be injected, why wouldn't it be for the federal reserve board? what's the update on the vaxx status of the FBI? I guess, they don't want to be, maybe they are the private army of deceased Rockfeller? that would explain a lot...",
			"added": 1629971659
		}
	],
	"topic_vote": {},
	"next_comment_id": 140,
	"comment": {
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 1,
				"body": "The question is more why those who can't protect those who don't? Furthermore it reveals institutional design weakness... be it at the constitutional level or security level in most western countries. It's an epic failure. \n\nHowever maybe you are asking too much of some people, who just try to do the things they are induced to believe are good for them and everyone.\n\nRather than seeing the people scamed as enemies (which they may become), see them as victims, and betrayed by all they believed in.\n\nYou can see this parrallel in those stranded in afghanistan. They wanted \"biden\", they did nothing during the steal of the election, nor pedogate, felt in the covid hoax, got injected by an experimental injection, are used as absorbers of money printing and get their life potential in a sense robbed from them.\n\nand the worst is when you tell that to restore the republic some corrupt people will have to die, they even refuse this idea, so domesticated they have been.\n\nHow to free mind captives?",
				"added": 1629861525
			},
			{
				"comment_id": 2,
				"body": "> [leonarddurden](#comment_19_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): See the FBI is here. However, we have a different playbook: https://www.crossroads.net/media/podcasts/the-five-marks-of-a-man\n\nthe fbi can be killed, every single one of their children. don't forget it. the top is corrupt. and must be eliminated for the republic to live\n\nfbi and their handlers can't defeat china, russia, india or even israel.\n\nthey will be killed there, all of them... agree or not\n\nand regarding the Ummah\n\nthose infidels better keep in the usa...\n\nsome really love to decapitate fbi agents... nothing is cooler ! one infidel killed... is always cool :)",
				"added": 1629861944
			},
			{
				"comment_id": 3,
				"body": "fbi<ss/sa",
				"added": 1629861962
			},
			{
				"comment_id": 5,
				"body": "> [leonarddurden](#comment_21_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): Amateur.\n\nyou know that all the paski gang life is on balance... if you can't kill with the injections the troops you die...",
				"added": 1629862210
			},
			{
				"comment_id": 6,
				"body": "and as you can't inject PLA (china army) or India army... you die...",
				"added": 1629862246
			},
			{
				"comment_id": 8,
				"body": "and ? why should I care? do you want to live under their nwo / pedo / aristo / formerly zio tyranny? no thank you...\n\n> [epistemic](#comment_12_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): Dumb dumb, you do realize zeronet isn't anonymous, right? And that all of the TOR exit nodes are known and monitored by the NSA and 7 Eyes? [...]\n\nreport if you want, I may have the chance to see your family executed... \n\nso?\n\nyou don't get it, I dont' want your nwo, pedo, zio , aristo, uno or what ever based.",
				"added": 1629862617
			},
			{
				"comment_id": 10,
				"body": "and what is this shit of five eyes? you mean pedo uk? lock down australia/new zealand or canada the cucks? who do you think you are making afraid? maybe even not the germans (they just want to be polite)\n\nbut seriously go fuck yourself with your corruption, your nwo, your wasp bullshit...\n\nyou are stupid and weak\n\nyou can only attack, harrass, threaten us (we the little citizens) rape our children, steal our taxes, pretend to be heroes... will in reality not able to arrest more than 2 pedos for epstein...\n\nthat's all you are...\n\nyou let people with out ivermectine, no zinc, not even told them to up vit c in a pandemic...\n\nyou have commited treason, and are domestic and foreing enemies as the american constitution meant...\n\nbut most are too afraid, those who could kill you internally, and still don't want to lose their pension or be arrested like the january 6 people...\n\nwe see your scam, since inceptions...\n\nsad, that you believed we didn't...\n\nrepeating a lie doesn't make it true... war 101.",
				"added": 1629862957
			},
			{
				"comment_id": 11,
				"body": "and you know SU collapsed, then yeltsin years, and from nowhere... (lol st.P.) came the wind of change...",
				"added": 1629863040
			},
			{
				"comment_id": 12,
				"body": "but thanks for your vivacity... so how is it going in D.C.? secret service happy? those no raping kids, I mean the newbies? it's good admin isn't ? nice steal? full media cover up... wooo... so powerfull...\ndon't fight us over taiwan... you will see more body bags leave than return... there won't be many survivors...",
				"added": 1629863222
			},
			{
				"comment_id": 13,
				"body": "> [leonarddurden](#comment_22_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): Amateur.\n\nas opposed to what? I am not a psywarfare agents... just someone trying to cope with the downfall of the american republic and the assassination of the dream of the american founders.\n\nat least in china, the dream is only getting more real.\n\nyou wanted nwo, blah blah, pedo, be part of the aristocratie...etc... pfff...\n\nUBL got everything you can't even dream...",
				"added": 1629863360
			},
			{
				"comment_id": 14,
				"body": "don't forget to mute white house psy agents... don't even think of reading or arguing with them, they are ghosts... they will be hunted or executed soon... or their children... ahahah.",
				"added": 1629863437
			}
		],
		"1629861833_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 4,
				"body": "we need to kill a lot of people in the republic... that's it, for america to have a future... that's it. face it. accept it.\n\nwhat's the problem with that ? killing innocent afghans or irakis children good? but killing fbi agents who lead on pedogate or let the election be stolen, or let the covid happen, not okay? why?\n\nwhy are fbi children better than old new yorkers in nursing care? why are fbi children better than iraki children or afghan children?\n\nafghan or iraki children had nothing to do with 911 or anything related with usa btw...\n\nso what 's wrong? your weakness isn't kindness, it's not non violence, it's fear\n\nyou are like killer whales afraid to kill their trainers...\n\ndomesticated.\n\nuntil you free yourself.",
				"added": 1629862142
			}
		],
		"1618427843_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 7,
				"body": "> [drjudithshitberg](#comment_34_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH): the more the time will pass the more UBL will be seen as a hero and visionnary, while those having assassinated him, will be seen as men who have been lead ashtray...\n\n:)\n\nhe had a way with words :) \n\nfor example : obama the head of \"infidelity\" :) so true !",
				"added": 1629862487
			},
			{
				"comment_id": 9,
				"body": "btw if rather than being woke, and censoring everyone on the internet... you add listen to the people, there, here, dear americans trapped in afghanistan...\n\nshould the talibies bring american girls to the airport? I mean it's nice PR...\n\nlike little children, they will have to hold hands and wear of course decent clothing...",
				"added": 1629862721
			},
			{
				"comment_id": 33,
				"body": "ps as a last post there suckers, if you want to be raptriated faster, 10% for the big guy and rulez.... ahahahah. you are so fucking dumb.",
				"added": 1629868319
			}
		],
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 15,
				"body": "So from what I get there is a blockus or siege of the entry of the pansheer valley? but can't they escape from the side? I don't know how high it is...\nwould massood and co, the natives, trade the former collaborator known as minister of defense and the other for hteir life?\nwhat does massod and co wants?\ndo they believe to stand a chance where usa/nato/20years/2trillions failed? \nhowever I hope the new gears won't impact battlefield performance...\n\nso how to move an howizter near pansheer? seems more complicated than to defeat nato/usa :)",
				"added": 1629863573
			},
			{
				"comment_id": 16,
				"body": "maybe it will take less than 20 years :D for this howitzer thing... seriously it's a real challenge... it's too heavy for donkeys... and then to have to dissamble, to rebuild... way too complicated...\n\nthe weapons don't make the fighters, only the faith :)",
				"added": 1629864364
			},
			{
				"comment_id": 17,
				"body": "that's kung fu 101 :)",
				"added": 1629864374
			},
			{
				"comment_id": 27,
				"body": "really it's not a bad idea, american collection points accross kabul, picked up by the talibans and then moved to the airport... those people are so incompetent, stupid and brainwashed, they can't even walk there by themselves... but to raise gay flag, they are the best... so suckers... tax leeches... mandatory vaxxers... shame on them, but they all have great \"education\", maybe they should have studied more :D",
				"added": 1629867729
			},
			{
				"comment_id": 28,
				"body": "leave...",
				"added": 1629867757
			},
			{
				"comment_id": 39,
				"body": "I want clarrisa wards at the entry of the pansheer filming 24/7 !",
				"added": 1629869502
			},
			{
				"comment_id": 40,
				"body": "behind the scenes...\nwhat were the ice flavors?",
				"added": 1629869550
			},
			{
				"comment_id": 114,
				"body": "will the talbians serve the rockfeller agenda rather than the qoran?\n1 will they fight plants of the creation?\n2 will they destroy arable land and rivers beds with mineral extractions (lithium run off are particulary nasty ask bolivians)\n\nwe will see...",
				"added": 1629958754
			},
			{
				"comment_id": 137,
				"body": "the runway is still useable... for how long?\nI found cool to welcome the turks for airport operations, however the talibies should ask not only for operations but for teaching so that they learn how to operate it themselves like grown up... I understand learning curve is steep... but it's a real nice job. of course turks can't deny muslim brothers the teaching of airport operations ! that's the good news of the day !",
				"added": 1629987754
			},
			{
				"comment_id": 138,
				"body": "and the second good news? the run way can always be repaired if events happened... no worrry about it...",
				"added": 1629987850
			},
			{
				"comment_id": 139,
				"body": "www.rt.com has another good article... the talibies information gathering network knew it would happen... the plot thickens...",
				"added": 1629987976
			}
		],
		"1629864664_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 18,
				"body": "who is the fucking gun grabber lead in george town? how many kids does his mother had? yeah...",
				"added": 1629864708
			},
			{
				"comment_id": 19,
				"body": "then his whole family... everyone, his brother or sister children... then little prick will be left alone... will tell his students, and lawyers and masters... mexico is a free country... :) be aware gringoes... this is no wasp land...",
				"added": 1629864767
			},
			{
				"comment_id": 20,
				"body": "repeat with next lead... until like in the border town, only a young girl will dare to become gun grabber lead but surrender, or die.\n\nsimply.\n\nwasp = pussies.",
				"added": 1629864830
			},
			{
				"comment_id": 21,
				"body": "low lives, who cares only about appearance, and can't arrest more than 2 pedos... rape cartel children... warfare ensue... total war.",
				"added": 1629864865
			},
			{
				"comment_id": 22,
				"body": "so how to get the georgetown boys down to end the use of mexico has a proxy in the law suit against gun mfgers?",
				"added": 1629864946
			},
			{
				"comment_id": 23,
				"body": "so killing gerogetowners is saving mexican lives (maybe they will understand, don't mess with the guns, don't mess with the plants, don't mess with teh cartels, and live your life, if you don't understand, simply die...). ez.",
				"added": 1629865003
			},
			{
				"comment_id": 24,
				"body": "and don't be like alex jones, we are gonna convince them... or amnestie... fuck that shit... kill = win. nothing else.\nhow many georgetowners must be executed in cover ops to end law suit? 10? 100? 1000? I mean of their children... I love to see adult surrender because all those around them still with children force them... proxy war.",
				"added": 1629865111
			},
			{
				"comment_id": 25,
				"body": "and so they lose 2 time... \n\n1. their children are DEAD\n2. they can't gun grab for their masters\n\ntheir only hope? suicide.",
				"added": 1629865159
			},
			{
				"comment_id": 26,
				"body": "and that makes the 3rd win.",
				"added": 1629865171
			},
			{
				"comment_id": 88,
				"body": "> [dogcat](#comment_5_14WBfL5EWU5X3a7dcTwMvtDrcWYFAZYYF5): this nigga be internet crazy\n\nif niggas from georgetown university want to be able to keep parading in their campus among thousands of students, aka covers(ultra easy kill solutions), they better understand, you can make american evangelists your slaves, destroy their nation, ruin it and rape them.\n\nwe are not gringos.\n\ngot it?",
				"added": 1629950072
			},
			{
				"comment_id": 89,
				"body": "> [dogcat](#comment_5_14WBfL5EWU5X3a7dcTwMvtDrcWYFAZYYF5): this nigga be internet crazy\n\nso topgod, who is crazier? \n\nman who say to academics, stop wanting to take cartel guns, or academics who seek to take cartels gun? \n\nI let you think about that or if you prefer the concept of students of georgetown campus as soft mobile covers in campus raids... pop pop, stab stab, pannnniiikkkkk... american girl screammmiiiinnnggggg ahhhhhhhahhhhhhahhhhhh respected professor dead. got it? where is mexican 12 year old boy gone ask sec team? remember panick? no gun needed... stab stab...bye bye... \n\nwelcome back to mexico hiro ! \n\nand all think, maybe this kid will one day be the hermano of thing we can't even yet imagine :).\n\nbut academic who seek to take gun dead... just little warning...\n\nthen slash families... more pro... \n\nwanna play? this is not a game.\n\nremember \"academics\" alex jones is a moron low iq un american... never a friend of the founding fathers. aka he would play the trial / law suit  game and submit himself to the \"judges\" or jury...\n\nmexican cartels? besties with american founding fathers... whose that judge (there is an american girl with a song like whose that guy) meaning those things judges, academics, students, old women, better not stand in the path of the spices, or they will be happy to have been only killed.\n\nit's not a game. it's not even a business...",
				"added": 1629950325
			},
			{
				"comment_id": 97,
				"body": "this gave me an idea and a joke : \n\nI try joke first : alex jones with girly voice \" i have a trial with george town, wooo whoooo, I am important man, wooo wooo...\"\n\nfucking brainwashed mupper...\n\nnow the idea :\n\nworldwide global assasination campaign against all academics who support the  criminalization of plants.\n\nproblem : this is the end of illegality... \n\nsolution : \n\nI have no intentions to surrender cartel forces to state forces.\n\nnor to pay any taxes on plants of the creations.\n\nproblem : it will weaken the force\n\nconclusion : killing academics to save the 2A is good ! \n\nlegalizing has consequences... good and bad.",
				"added": 1629951772
			},
			{
				"comment_id": 98,
				"body": "cartels are just well organized militias... spices must be safe... every american founders got it... intuitively... not brainwashed by tv, priests, preachers, morons and co.",
				"added": 1629951869
			},
			{
				"comment_id": 99,
				"body": "and flow...",
				"added": 1629951882
			}
		],
		"1629867851_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 29,
				"body": "I should crawl back in white guilt before your \"god\" ? you suck so much....",
				"added": 1629867875
			},
			{
				"comment_id": 30,
				"body": "but the UNO charter... lol... thieves...",
				"added": 1629867890
			},
			{
				"comment_id": 31,
				"body": "who loves the most money? biden or obama?",
				"added": 1629868225
			},
			{
				"comment_id": 32,
				"body": "maybe it's nancy or mitch?",
				"added": 1629868259
			},
			{
				"comment_id": 85,
				"body": "the problem isn't the man... it's the function. it doesn't work anymore.",
				"added": 1629913232
			},
			{
				"comment_id": 86,
				"body": "this pseudo king, it's not possible...",
				"added": 1629913259
			},
			{
				"comment_id": 87,
				"body": "> [dogcat](#comment_6_14WBfL5EWU5X3a7dcTwMvtDrcWYFAZYYF5): americans are destroyers of usa, also the usa spreads aids around the world\n\nI understand what you say, I am sorry to say it but they aren't. it's a small group, at max 1 million people (aka nothing  at our scale) which has captured the usa. \n\nthe people have been drugged (fluoride), bainwashed (schools), are on the borrowed time (debts), with constant reinforcement of their serfitude (tv, ads) and feeded toxic debilitating unhealthy food. layered with toxic medicine. this is factual.\n\nthe population being captured, it is easy for the institution of the usa to be occupied.\n\nfurthermore as those morons so called evangelists who are in reality almost not humans anymore, agreed to kill millions of innocents in the middle east, but can't lift a finger to oppose criminal org of epstein, the election fraud, 911 investigation etc etc.\n\nso could the framework imagined by the american founders work again? maybe, but at least the founders understood they had to kill for their dream to live free to be become true. \n\nlook even an hypocrite like alex jones pretend to be \"american\"...  see my point?",
				"added": 1629949961
			}
		],
		"1620075300_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": [
			{
				"comment_id": 34,
				"body": "I know !!! it was never published as I had already exceeded the limit, even if appears in my zerotalk, it didn't on the one of other !",
				"added": 1629869204
			},
			{
				"comment_id": 35,
				"body": "you are screwed... execute biden, pelosi, mitch mconnel, pence, paski, obama, clintons (and chelsae)...\n\nthe only one we save is the daughter of pelosi... nice girl... she knows for bill and epstein...\n\nnadler killed\nthe borg from nyc... schumer killed\nrubio killed\ncuomo killed\nlightoot killed\nnewsome killed\n\netc etc\n\n100k at least ! \n\nmuller, page, strozk, comey, go go go kill them all. one batch\n\netc etc etc etc...\n\nso easy, to create usa 2.0.",
				"added": 1629869350
			},
			{
				"comment_id": 36,
				"body": "adler autin killed\nthe buffon from minapolis killed\n\nand it goes...",
				"added": 1629869393
			},
			{
				"comment_id": 37,
				"body": "kissinger\nthe whole msn...",
				"added": 1629869404
			},
			{
				"comment_id": 38,
				"body": "it's like a TRIM command on a ssd... do all the cluster erase at the same time?",
				"added": 1629869450
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 41,
				"body": "so bitches, 3rd dose? I didn't speak about that much, but a nation, whose foreign intelligence service appears to have run a child rape camp in a foreign nation, reflect the lack of value and moral in the general gov of this said country...\nso yes, I should too have focused more that it appears that epstein was israeli run, but it could be a plot of the zio-pedo-masso-satanist-aristo-nwo-wef who hate the state of israel, not because of it's location (as 1.5 billions muslims do) but because of the existence of a state... they want their one world gov... and no, they don't want it in jeruslam...\n\npoor you... so they draft you in their bimbo army, waste 2 years of your lives, then run child rape camps in usa, to finally jab you like industrial pigs? yoohooo eretz... that's freedom :).",
				"added": 1629872559
			},
			{
				"comment_id": 42,
				"body": "> [shouldnt](#comment_2_1B4ktEg3pXXwnTrX7NfkL8AUdhy2puKes2): Personally as an outsider looking in I view Israel as an illegitimate state with land they did not acquire themselves. Israel being created would be like if the United Nations decided they should reinstate Akkad because Mesopotamians were involved in a genocide. Whatever your opinion on Jews I personally find the idea of Israel very unsavory. Israel was taken from the Jews fair and square. It was not theirs anymore.\n\nwho cares how you view it, fight, win - lose, then you will be right or dead :). words without deeds have no meanings, just pixels or sound waves.",
				"added": 1629872603
			},
			{
				"comment_id": 43,
				"body": "btw for the history buffs, how do you want to call it?\nthe vaxxshoa?\nthe hollovaxx (i like that)?\nthe auswaxx?\nor the vaxxshwitz?\nat least it's an autogenocide ! 100% self made\n\nbut byby.... beee beee....\nahahahah...\nhow much does he owned in pfizer with his multiple front companies a la macron? hehehehe... noobs...\n\nI wen to erzylah... I am a genius... yes of course, the paper says so...\n\nwhat a bunch of morons... those seculars :)",
				"added": 1629873514
			},
			{
				"comment_id": 44,
				"body": "ahahahah... so moronic",
				"added": 1629873561
			},
			{
				"comment_id": 45,
				"body": "you read a little arabic, isn't it? what is writen on the Shahada?\n\nwhat else?",
				"added": 1629873630
			},
			{
				"comment_id": 46,
				"body": "jews reading the shahada... that's pleases me :) in the natural language of course...\nmorons...\nthose secular girls are worthless...",
				"added": 1629873691
			},
			{
				"comment_id": 47,
				"body": "so stupid... look is always or most often than not deceiving... but \n\nbeee beeeeee !",
				"added": 1629873719
			},
			{
				"comment_id": 48,
				"body": "unless you are labor zionist? stay away.... that's my message, stay in your pit hell hole... don't ever leave alive...",
				"added": 1629873750
			},
			{
				"comment_id": 49,
				"body": "remember it's not because of the fact that those women were born of jewish women, but of their beliefs, they could be black, same thing. death to the bolshevicks and demshelvicks ! what ever... they are things. all of them, worldwide !",
				"added": 1629873805
			},
			{
				"comment_id": 50,
				"body": "booohh boooh boohhh !",
				"added": 1629873832
			},
			{
				"comment_id": 51,
				"body": "Repeat after me... I bear witness.... \n\nahahahah",
				"added": 1629873848
			},
			{
				"comment_id": 52,
				"body": "that she took the shot too... but not yet the 3rd...\n\nyou fucking capo !\n\nruning this pass scam... shame on you.",
				"added": 1629873893
			},
			{
				"comment_id": 53,
				"body": "traitoresse, liaresses, deceiveiress...",
				"added": 1629873928
			},
			{
				"comment_id": 54,
				"body": "INFLIDELS !",
				"added": 1629873938
			},
			{
				"comment_id": 55,
				"body": "Moses would have been ashamed of you.",
				"added": 1629873998
			},
			{
				"comment_id": 56,
				"body": "but bolshevicks nwo pedo aristo masso servants don't care isn't it? as long as you get to hold the calf isn't it? my precious.... hahaahh",
				"added": 1629874050
			},
			{
				"comment_id": 57,
				"body": "on the road to...",
				"added": 1629874070
			},
			{
				"comment_id": 58,
				"body": "not damascus...",
				"added": 1629874079
			},
			{
				"comment_id": 59,
				"body": "but the 4th \"jab\" ahahah...",
				"added": 1629874094
			},
			{
				"comment_id": 60,
				"body": "with a smile and a nice poney tail.... ahahahah.",
				"added": 1629874112
			},
			{
				"comment_id": 61,
				"body": "honestly, no one in arabia would give an experimental injection to a beloved horse... aka you are treated worst than horse... of course, those horses, are precious... they may be the grand sons of those who carried the Prophet PBUH !!!\n\nyou see this little donkey there? hehehehe...",
				"added": 1629874267
			},
			{
				"comment_id": 62,
				"body": "and I don't tell you the stories of the most precious camels... moses was static in comparison...",
				"added": 1629874337
			},
			{
				"comment_id": 63,
				"body": "who narrated the story of the donkey who carried the shahada for the prophet (pbuh)?",
				"added": 1629874373
			},
			{
				"comment_id": 64,
				"body": "they have heard more recitations, maybe than even men combined....",
				"added": 1629874403
			},
			{
				"comment_id": 65,
				"body": "horses, camles and donkey, don't recite nor learn the quran, they live by it.",
				"added": 1629874432
			}
		],
		"1629910533_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 66,
				"body": "why is there a stupid bimbo with a stringent voice and this red so called young turks on infowars? we don't give a fuck, I thaught those people were dead... like mike adams said : ghosts...\n\ndon't care\nignore\ndisregard\nthey are no bodies\n\nand all those who watch teh young turks are ghosts... already gone...\n\nforget\nmove on\nthe mission !\n(Rapture :D)",
				"added": 1629910597
			},
			{
				"comment_id": 67,
				"body": "I liked the interview of the school board guy yesterday... very acute with self learning, buying books etc. smart.",
				"added": 1629911208
			},
			{
				"comment_id": 68,
				"body": "I am big fan of Dr Merrit... she is great ! it's war !!!",
				"added": 1629911280
			},
			{
				"comment_id": 69,
				"body": "yeah ! defense of the poor guys in gears who don't know what they are doing !!!! go merritt ! merritt for potus !",
				"added": 1629911326
			},
			{
				"comment_id": 70,
				"body": "she takes back the argument of the commander ! :)",
				"added": 1629911376
			},
			{
				"comment_id": 71,
				"body": "but the young turk is right, we need a super loony to redress this falling ship !",
				"added": 1629911452
			},
			{
				"comment_id": 72,
				"body": "it's a big difference between her and the cic...",
				"added": 1629911522
			},
			{
				"comment_id": 73,
				"body": "the fake...",
				"added": 1629911531
			},
			{
				"comment_id": 74,
				"body": "invasion time line of someone else.... love it !",
				"added": 1629911549
			},
			{
				"comment_id": 75,
				"body": "her unrestricted warfare is cool ! make everyday item weapons...",
				"added": 1629911710
			},
			{
				"comment_id": 76,
				"body": "contact genetic pathogen sprayed...",
				"added": 1629911767
			},
			{
				"comment_id": 77,
				"body": "synthetic biological war...",
				"added": 1629911795
			},
			{
				"comment_id": 78,
				"body": "my whole point about the young turk... I mean, it's not even competing... but I have seen her interview on the brighteon.com a while back on health ranger channel... very cool !",
				"added": 1629911950
			},
			{
				"comment_id": 79,
				"body": "and my second point, about taiwan... let it go... let it go... it's an internal matter of china. interfering is bad... and you know the worst, if it was the reverse and ccp on taiwan, I am almost ready to bet that it would be supported against again the mainland... just to prevent the peaceful harmonious final reunification... imho it would lower the tension worldwide... china is unified.",
				"added": 1629912075
			},
			{
				"comment_id": 80,
				"body": "because now we have japan who seek to interefer on chinese domestic matter... very very very sensitive matter...",
				"added": 1629912109
			},
			{
				"comment_id": 81,
				"body": "as we are asking question... kristi leight... is she a spy? so why does she wear a spy device ( apple watch ? :D).\nmy question is what happened for her to become \"single mom\"... the type of question that may lead to inappropriate answers... but some called lost the plot....",
				"added": 1629912849
			},
			{
				"comment_id": 82,
				"body": "but she did great interviews ! she let a lot the people speak, and ask good follow up questions, however she need more time to learn more about conspiracies...",
				"added": 1629912895
			},
			{
				"comment_id": 83,
				"body": "the mouses won... so... hehehehe",
				"added": 1629912907
			},
			{
				"comment_id": 84,
				"body": "america must be saved... they are too nefarious right now... so specially if they fall more, I believe they will be even more nefarious... it's reformation, a new begining, the 2nd american republic... the 1st one has fallen.",
				"added": 1629913060
			},
			{
				"comment_id": 126,
				"body": "why do you play this jew game? don't even answer, ak out, little bimbo girl, aimed, press and leave her fucking corpse dead.... and this mongo too understand nothing to nazism... it's shocking...\n\ntaliban way...\n\nfemale, obey. end \n\nit's war",
				"added": 1629986152
			},
			{
				"comment_id": 127,
				"body": "the only thing this little female wanted, the \"press\" (the trigger) is to get the man to fail some so called \"hate speech\", execute... kill straigt.",
				"added": 1629986216
			},
			{
				"comment_id": 128,
				"body": "you see how those men at inforwars are gay? absolute gay...",
				"added": 1629986233
			},
			{
				"comment_id": 129,
				"body": "it's not about winning mind. it's war, you don't understand it... the enemy is dead or in fear of by such. nothing else.",
				"added": 1629986284
			},
			{
				"comment_id": 130,
				"body": "and this discrimination against blonde... this guy had no idea that blonde homo, errand, not conformists, political opponents and jews were send to camps? what is this crap again...\n\nterrible.",
				"added": 1629986363
			},
			{
				"comment_id": 131,
				"body": "i still ask myself if the usa is too dishomogenous in population to have a chance.... russia is purely native... like it or not, they are all born and raised over this land for more years than people knew america existed outside of it... and china is the same btw...\nusa with their \"melting pot\"...",
				"added": 1629986499
			},
			{
				"comment_id": 132,
				"body": "maybe smelting pot? like in smoldering for iron? from humans to organic droids?",
				"added": 1629986558
			},
			{
				"comment_id": 133,
				"body": "unwatcheable !! bring the single mom back !!! that's the conspiracy that need to be undersood : cause for single hood, if events (death of husband, fair and sorry) but if divorce, there is a lot of real useful knowledge to be gained there... \n\nbecause the rest is pretty useless... if you want to stop a tyrannie, you kill the tyrants. end.",
				"added": 1629986763
			},
			{
				"comment_id": 134,
				"body": "you tell me then a new tyrant will come? excellent ! kill it too ! again and again ! \nand once the pilo of corpses will highter than the wall of the presidential palace will the tyrannie end.\nbecause at this point the next tyrant will be just a soon corpse to be.\nfast, efficient, clean, and producing fertilizer... win win.",
				"added": 1629986837
			},
			{
				"comment_id": 135,
				"body": "fhy, the jew question in nazi area was handled according to GENEALOGY !!! no hair, nor eye color !!! learn your history and 2 don't enter this trap, wear what you want : YOUR BODY, YOU CHOICE, and if a laura loomer or ben shapiro isn't happy : SHOOT IT ! end.",
				"added": 1629987540
			},
			{
				"comment_id": 136,
				"body": "I am so fed up with gayism.",
				"added": 1629987558
			}
		],
		"1629867457_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 90,
				"body": "> [concept7](#comment_3_12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u): Come on! She is the next president!\n\npresident of what?",
				"added": 1629950384
			},
			{
				"comment_id": 93,
				"body": "> [concept7](#comment_7_12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u): Of a country called USA\n\nyou are cute.",
				"added": 1629950805
			}
		],
		"1629864103_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 91,
				"body": "> [concept7](#comment_4_12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u): I guess there's no legal framework in this but I guess if you're just talking about the size each side's gun..\n\nwho define legal framework if not those who indirectly control those with guns? can you understand this one? try...",
				"added": 1629950453
			}
		],
		"1629949539_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 94,
				"body": "no... he can't. he is clean... the proxy always is.",
				"added": 1629950867
			},
			{
				"comment_id": 95,
				"body": "but in fact you maybe right, but again, I felt in your trap. I don't give a shit if he knows or not. irrelevant. this personality cult / trap... you have no better comment to make?\n\nfor me i would classify you as an enemy.\n\nyour comment isn't positive, or solvative, nor analysing\n\nbut framing and reducing.\n\nyou understand what I mean?",
				"added": 1629951095
			},
			{
				"comment_id": 96,
				"body": "topic goal : restore voter integrity in usa. in who can vote (only white men with land) and who counts it and how.\nvote integrity.\n\nif no vote integrity, better no vote at all, yes it fools the sheep, but now the quality is to be able to steal elections, and that's not competitive enough in todays world...",
				"added": 1629951256
			}
		],
		"1629954698_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 100,
				"body": "you see how I hate you all there? vets and active? you should be hunted down, like those who collaborated with the occupiers of afghanistan. you are the same kind.",
				"added": 1629954743
			},
			{
				"comment_id": 101,
				"body": "and if one day I can kill you all, I won't, because I want to see you once all your family members will be...",
				"added": 1629954774
			},
			{
				"comment_id": 102,
				"body": "this is a war, and you chose to wage it, expect the worst, those are the plants of the creator...",
				"added": 1629954794
			},
			{
				"comment_id": 103,
				"body": "I bet you the DEA isn't yet fully poison injected...",
				"added": 1629956242
			}
		],
		"1629956409_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 104,
				"body": "nsa did their own certificated... very secure... ahah",
				"added": 1629956412
			},
			{
				"comment_id": 107,
				"body": "rockfeller is dead, but his will lives... that's very dangerous. why need to add \"evil\", \"demonic\" etc... only unbelivers would do. \nsaying americans in afghanistan are shaytans or djins is deceiving. they are kuffars. simply. miscreants.\nthat's what makes you even more fubar.\nunable to even think because your speak pollutes it.",
				"added": 1629956907
			},
			{
				"comment_id": 109,
				"body": "btw I did a mistake... can you find it?\n\nthey aren't bio droid... it's illogical... why?\n\nbio = life\n\nso they are ORGANIC droids...\n\nthere it works...\n\norganicdroids of the cia, fbi, dod, nsa, atf, dea, irs...\n\norganic, as they are still made mater of organic matter \ndroids or bots as they are programmable.\n\nie they are organic matter without self consciousness... or consciousness access. just things.",
				"added": 1629957997
			},
			{
				"comment_id": 110,
				"body": "that's golem? golem are with organic matter or just clay (aka \"so called robots\")?",
				"added": 1629958099
			},
			{
				"comment_id": 111,
				"body": "or just the intermesh organic / inorganic droids? the evolution of them btw... or upgrade to be exact.\nas they are products, they can be serviced, recycled, or upgraded...\nthat's the problem with pure robots... they will go with the Combat AI... no doubt...\nbut the pure organicdroid will even try to fight the ... us.",
				"added": 1629958194
			},
			{
				"comment_id": 112,
				"body": "and at the end of the war, it will be possible to have a single drop of blood, with a red cell of each and every cia, dod, atf, dea, etc... you wanted war, to make us like you organic slaves or the rockefellers?\n\nme say\n\nfreedom with bots way more fun\nwars faster\nalways win !\ngood !",
				"added": 1629958300
			},
			{
				"comment_id": 113,
				"body": "better things to do, but sometimes watching organicdroids getting splattered around is funny... like you did to afghan children... \nbecause those children were humans... not like you.",
				"added": 1629958338
			},
			{
				"comment_id": 115,
				"body": "ps when organic droid reproduce they make in my book organic droid, I know it's wrong, but that's the real laws of war, and I can't change them. sorry.",
				"added": 1629958816
			},
			{
				"comment_id": 117,
				"body": "I guess there is 2 camps with the civilians... those who come having seen a true front line in a previous job, and the civilians including former dod...\nand I guess all those who saw a true front line left...\n\ntrue at least symetric or negatively asymetric...",
				"added": 1629959073
			},
			{
				"comment_id": 118,
				"body": "aka none of you...",
				"added": 1629959094
			}
		],
		"1629956471_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [],
		"1629957044_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 108,
				"body": "with the barbarians (white people) nothing can be done... they are too brainwashed...",
				"added": 1629957049
			}
		],
		"1622534131_17qgF4cL3wN9yvkUtEPnVBMvL1exu976uk": [
			{
				"comment_id": 116,
				"body": "they don't give a s about the agendas or orders or commands of the dead rockefeller and co? why would they?\nso right, so free, so new world ! long live the cartels !",
				"added": 1629958919
			}
		],
		"1629959866_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 119,
				"body": "organic droids = ultimate serfs\namerican founders = biggest opponents to serfdom.\nso that's why they hate the usa.\nsimply.\nand why they hate china too btw.",
				"added": 1629961494
			}
		],
		"1629867382_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 120,
				"body": "when exactly?",
				"added": 1629962699
			},
			{
				"comment_id": 121,
				"body": "btw killing those responsible, with dresde doctrine included, would be too simple. first torturing them for the same ammount of days... counting.",
				"added": 1629962764
			}
		],
		"1629962659_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 122,
				"body": "typo... btw both island (hainan and taiwan) were occupied, one still is. which?",
				"added": 1629962818
			}
		],
		"1629964614_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 123,
				"body": "there can be only few answer.\nchinese\nnot chinese\naka\nccp \nor not ccp\nsimply.\nbinary\nnot \"diplomatic\"\nreal.",
				"added": 1629964639
			},
			{
				"comment_id": 124,
				"body": "simple you are with us\nor\nyou are against us\nchose wisely.\nonce.",
				"added": 1629964846
			},
			{
				"comment_id": 125,
				"body": "it's or black\nor white\ncan't be grey.\nno lie\nno deceit\ntruth and honesty\nto whom belongs taiwan?\nanswer.",
				"added": 1629964880
			}
		]
	},
	"comment_vote": {}
}