{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 1,
				"body": "> [quirrel](#comment_9_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): По теме. Объявляю дух Романа Каршиева покровителем русскоязычного сегмента сети ЗероНет. Он, как никто иной, вложивший в неё массу сил и часть своей души, заслуживает этой роли.Покойся с миром, Роман. \n\nДобрый день.\nя с Роминой авиабазы. в зеронете я не ориентируюсь - зарегался только с Роминой подачи\nВы позволите процитировать пост в Роминых персоналиях?\nhttp://www.wrk.ru/community/2019/01/t30288_55--balancer.848.html",
				"added": 1548753986
			},
			{
				"comment_id": 2,
				"body": "> [quirrel](#comment_42_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Не стоит. Я никогда не был на Авиабазе и знал Балансера только по ЗероНету.Так что пусть это остаётся частью его Даркнетовской жизни.\n\nясно. жаль. но тут уж ничего не попишешь.\nРома всё пытался затащить нас в этот зеронет, но мы так и не раскачались.\nтеперь, правда, локти кусаем - как сохранить те форумы, что он создал.\nв \"морском\" разделе народ говорит, что это самое большое хранилище специализированной информации в рунете.\nнасколько это правда -хз. я не мореман. Но не верить им повода нет.\nесли вся эта информация как-то сохранится здесь,  то будет здорово. правда боюсь она станет недоступна простым пользователям - ну не зеронетчики мы.",
				"added": 1548825778
			},
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_76_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Форумами сейчас кто-нибудь управляет? Хостинг под контролем?\nчтоб сразу расставить точки над \"ё\" - я не айтишник, мне некоторые слова могут быть непонятны :)\n\nадминистраторы, модераторы, координаторы есть в наличии.\nхостинг? ну, наверное, да - насколько я понимаю это слово.\nпришли Ромины друзья, пока помогают, починяют то, что отваливается\nhttp://www.wrk.ru/support/2019/01/t106553_8--funktsionirovanie-aviabazy-bez-uchastiya-romy.html#p7114825\n\nесть группа в телеграмме, где можно связаться с ребятами, которые сейчас контролируют сервер(?). ещё раз прошу прощения - терминологией не владею :(",
				"added": 1548828022
			},
			{
				"comment_id": 4,
				"body": "> [geekless](#comment_78_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): О, вижу, что там Dimez помогает - это внушает оптимизм.\n\nда, он у нас недавно зарегался - когда Рома в больнице лежал\nhttp://forums.balancer.ru/support/2019/01/t106553_4--funktsionirovanie-aviabazy-bez-uchastiya-romy.html#p7082561\n\nпоэтому пребывает в статусе \"новичка\" :)",
				"added": 1548830518
			}
		]
	},
	"comment_vote": {}
}