{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [zer0surfer](#comment_1_15j9RixaGozV6Dwp3a9iigZNbjtUyz6Rbq): I like timeshift for system snapshots, EDIT: your CSS needs some fixing for comments, they are not readable\n\nThanks for the CSS heads-up, much appreciated, I've been a bit careless with my changes. I reverted back to something standard for now.\n\nI've yet to try timeshift but I'm unsure how well it would work versus xfsdump, for system backup, I've a little less faith for hard links and rsync vs inoded-level backup.",
			"post_id": 2,
			"date_added": 1495327319
		},
		{
			"comment_id": 2,
			"body": "> [qn](#comment_1_18cgercs5UABH6TrGvMWhbqpECZsfiMZm5): Kurzgesagt definitely is one of the best Youtube channels there are.\n\nAgreed, their quality over quantity approach really shines.",
			"post_id": 4,
			"date_added": 1496429097
		},
		{
			"comment_id": 3,
			"body": "> [fickenccp](#comment_1_15E2Ms8RjnhE2h77ng5GAtVbX3vRxf3PwE): I will try to translat this article into chinese.However,most tof the chinese are using windows operation system,it will be great if you worte a ss tutorial on windows op system.\n\nYes, I can do that, I'll take me a bit of time but otherwise no problem.\n\nHowever, Linux is much more trustworthy than Windows for many reasons so switching to it if you are privacy conscious is a good move :)",
			"post_id": 7,
			"date_added": 1497119569
		},
		{
			"comment_id": 4,
			"body": "> [hexkey](#comment_1_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF): How exactly do you pin stuff?\n\nBy editing the \"Date published\" of this post to always be the latest published/updated, it then sticks to the top of the blog, rinse and repeat as you add more articles :)",
			"post_id": 6,
			"date_added": 1497163478
		},
		{
			"comment_id": 5,
			"body": "> [hexkey](#comment_2_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF): Ah. So can I set it to the year 9999?\n\nPerhaps, I've yet to fin a limit actually, a few minutes ahead of the last post is enough of course",
			"post_id": 6,
			"date_added": 1497212224
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}