// Шумовые слова
var chronsearch_stop_words = ["a", "above", "after", "again", "against", "all", "am", "an", "and", "any", "are", "aren't", "as", "at", "be", "because", "been", "before", "being", "below", "between", "both", "but", "by", "can't", "cannot", "could", "couldn't", "did", "didn't", "do", "does", "doesn't", "doing", "don't", "down", "during", "each", "few", "for", "from", "further", "had", "hadn't", "has", "hasn't", "have", "haven't", "having", "he", "he'd", "he'll", "he's", "her", "here", "here's", "hers", "herself", "him", "himself", "his", "how", "how's", "i", "i'd", "i'll", "i'm", "i've", "if", "in", "into", "is", "isn't", "it", "it's", "its", "itself", "let's", "me", "more", "most", "mustn't", "my", "myself", "no", "nor", "not", "of", "off", "on", "once", "only", "or", "other", "ought", "our", "ours", "ourselves", "out", "over", "own", "same", "shan't", "she", "she'd", "she'll", "she's", "should", "shouldn't", "so", "some", "such", "than", "that", "that's", "the", "their", "theirs", "them", "themselves", "then", "there", "there's", "these", "they", "they'd", "they'll", "they're", "they've", "this", "those", "through", "to", "too", "under", "until", "up", "very", "was", "wasn't", "we", "we'd", "we'll", "we're", "we've", "were", "weren't", "what", "what's", "when", "when's", "where", "where's", "which", "while", "who", "who's", "whom", "why", "why's", "with", "won't", "would", "wouldn't", "you", "you'd", "you'll", "you're", "you've", "your", "yours", "yourself", "yourselves", "а", "алло", "б", "бы", "без", "бишь", "будто", "буквально", "близко", "благо", "более", "больше", "бывает", "бывало", "было", "был", "бывает", "была", "были", "было", "будем", "будет", "будете", "будешь", "буду", "будь", "будут", "быть", "в", "во", "вон", "вот", "вы", "вас", "ваш", "ваша", "ваше", "ваши", "вам", "вами", "все", "всё", "всю", "вся", "всех", "всею", "всем", "всеми", "всему", "весь", "всего", "всюду", "везде", "всегда", "вдоль", "вдали", "вне", "внутри", "вниз", "внизу", "вверх", "вокруг", "важно", "важное", "важная", "важные", "важный", "время", "времени", "вдруг", "вместо", "ведь", "вроде", "впрочем", "вряд", "вовсе", "второй", "восемь", "восьмой", "восемнадцать", "восемнадцатый", "г", "год", "года", "году", "где", "гляди", "говорил", "говорит", "до", "да", "дай", "давай", "давайте", "дайте", "давать", "даром", "для", "других", "другой", "другие", "другая", "другое", "даже", "должно", "должны", "дальше", "далеко", "давно", "долго", "действительно", "дел", "день", "довольно", "достаточно", "два", "две", "двух", "девять", "девятый", "десять", "десятый", "двенадцать", "двенадцатый", "девятнадцать", "девятнадцатый", "двадцать", "двадцатый", "е", "ее", "её", "ей", "ею", "ему", "его", "еще", "ещё", "едва", "если", "есть", "ест", "едим", "ето", "единственно", "ж", "же", "жизнь", "за", "зато", "затем", "зачем", "здесь", "значит", "занят", "занята", "занято", "заняты", "и", "или", "из", "их", "им", "ими", "иже", "имя", "иметь", "именно", "иногда", "исключением", "к", "кто", "кем", "как", "какой", "какая", "какое", "куда", "кому", "кого", "когда", "который", "которая", "которой", "которого", "которые", "которых", "каждое", "каждая", "каждые", "каждый", "кажется", "кроме", "кругом", "коли", "конечно", "ли", "лет", "ладно", "лучше", "лишь", "люди", "либо", "м", "мы", "мне", "мои", "мой", "моя", "мое", "моё", "мою", "моею", "моем", "моём", "моей", "мной", "мною", "меня", "мож", "можно", "может", "мог", "могу", "могут", "мочь", "мол", "мор", "между", "меля", "мира", "мимо", "менее", "меньше", "мало", "много", "многочисленное", "многочисленная", "многочисленные", "многочисленный", "миллионов", "не", "ни", "ну", "на", "но", "нет", "нем", "над", "ним", "нами", "ними", "нам", "наш", "наша", "наше", "наши", "нашу", "нас", "нх", "них", "нее", "неё", "ней", "нею", "нему", "него", "никак", "ничего", "нечего", "никогда", "никуда", "неужели", "нельзя", "надо", "нужно", "нибудь", "немного", "ниже", "низко", "назад", "недалеко", "недавно", "нередко", "несколько", "наиболее", "начала", "наверху", "наконец", "непрерывно", "навсегда", "ноль", "о", "об", "от", "он", "она", "они", "оно", "оба", "однако", "опять", "отсюда", "отовсюду", "отчего", "обычно", "особенно", "однажды", "очень", "около", "окончательно", "один", "одна", "одно", "одни", "одной", "одного", "одиннадцать", "одиннадцатый", "по", "под", "пор", "при", "про", "пора", "пока", "потом", "после", "позже", "почему", "потому", "просто", "прямо", "пусть", "пускай", "почти", "перед", "против", "посреди", "просто", "прекрасно", "пожалуйста", "положительно", "процентов", "первый", "пять", "пятый", "пятнадцать", "пятнадцатый", "раз", "разве", "руб", "рано", "раньше", "рядом", "ровно", "решительно", "с", "со", "сие", "сей", "сих", "суть", "сам", "сама", "сами", "само", "самом", "самому", "самой", "самим", "самими", "самих", "саму", "самого", "самое", "себе", "себя", "собой", "собою", "свое", "своё", "свои", "своей", "своего", "своих", "свою", "скорее", "словно", "совершенно", "спасибо", "снова", "совсем", "сначала", "сегодня", "сколько", "слишком", "сейчас", "стал", "сказал", "сказала", "сказать", "семь", "седьмой", "семнадцать", "семнадцатый", "т", "та", "те", "то", "ту", "ты", "тут", "там", "тем", "теми", "той", "том", "тот", "тому", "того", "тех", "тебя", "тобой", "тобою", "так", "тебе", "тоже", "только", "теперь", "тогда", "точь", "твою", "твой", "твоя", "твое", "твоё", "такое", "такой", "такие", "такая", "также", "туда", "тыс", "тысяч", "три", "третий", "тринадцать", "тринадцатый", "у", "уж", "уже", "уметь", "хоть", "хотя", "хорошо", "хочешь", "хотеть", "что", "чего", "чтоб", "чтобы", "чей", "чье", "чьё", "чья", "чем", "чему", "чуть", "чаще", "часто", "человек", "через", "чисто", "четыре", "четвертый", "четвёртый", "четырнадцать", "четырнадцатый", "шесть", "шестой", "шестнадцать", "шестнадцатый", "это", "эта", "эти", "эту", "этом", "этому", "этой", "этого", "этот", "этим", "этими", "этих", "я"];

// Замена слов, введённых с ошибкой
var chronsearch_replace = {'words': [
  {'word': 'javscript', 'replace_with': 'javascript'},
  {'word': 'jqeury', 'replace_with': 'jquery'},
  {'word': 'флэшка', 'replace_with': 'флешка'},
  {'word': 'флэшки', 'replace_with': 'флешки'},
  {'word': 'firfox', 'replace_with': 'firefox'},
  {'word': 'cofescript', 'replace_with': 'coffeescript'},
  {'word': 'coffescript', 'replace_with': 'coffeescript'},
  {'word': 'професор', 'replace_with': 'профессор'},
  {'word': 'книжки', 'replace_with': 'книги'}
]};

// Вес страницы
var chronsearch_weight = {'weight': [
  {'url': 'example.html', 'score': 60},
  {'url': 'example.html', 'score': 60},
  {'url': 'example.html', 'score': 20}
]};

// Стемминг
var chronsearch_stem = {'words': [
  // Сокращения
  {'word': 'e-mail', 'stem': 'email'},
  {'word': 'js', 'stem': 'javascript'},
  {'word': 'zn', 'stem': 'zeronet'},
  {'word': '0net', 'stem': 'zeronet'},
  {'word': 'peer-to-peer', 'stem': 'p2p'},
  // Взаимосвязи
  {'word': 'javascript', 'stem': 'jquery'},
  // Транслит
  {'word': 'zeronet', 'stem': 'зеронет'},
  {'word': 'зеронет', 'stem': 'zeronet'},
  {'word': 'linux', 'stem': 'линукс'},
  {'word': 'линукс', 'stem': 'linux'},
  // Усечение окончаний
  {'word': 'зеронета', 'stem': 'зеронет'},
  {'word': 'зеронете', 'stem': 'зеронет'},
  {'word': 'линукса', 'stem': 'линукс'},
  {'word': 'линуксе', 'stem': 'линукс'}
]};

// Похожие запросы
var chronsearch_related = {'Related': [
  {'search': 'субд', 'related': 'SQL'},
  {'search': 'javascript', 'related': 'CoffeeScript'},
  {'search': 'tipue search', 'related': 'Support', 'include': 1}
]};

// Internal strings
var chronsearch_string_1 = 'No title';
var chronsearch_string_2 = 'Показаны результаты для:';
var chronsearch_string_3 = 'Искать вместо этого:';
var chronsearch_string_4 = '1 результат';
var chronsearch_string_5 = 'найдено';
var chronsearch_string_6 = '<';
var chronsearch_string_7 = '>';
var chronsearch_string_8 = 'Ничего не найдено.';
var chronsearch_string_9 = 'Введённое слово является <i>шумовым</i> и в поисковом запросе не участвует (за исключением поиска по <i>строгому соответствию</i> поисковой фразы).';
var chronsearch_string_10 = 'Похожие запросы';
var chronsearch_string_11 = 'Search should be one character or more.';
var chronsearch_string_12 = 'Запрос должен состоять из';
var chronsearch_string_13 = 'или более символов.';
var chronsearch_string_14 = 'секунд';
var chronsearch_string_15 = '<img src=../img/ful.png style="background:none"> Открыть на вкладке';
var chronsearch_string_16 = '<img src=../img/pas.png width=12 style="background:none"> Перейти на сайт';

// Internals

// Timer for showTime
var startTimer = new Date().getTime();
