{
	"title": "Balancer's Blog (EN)",
	"description": "Broken English Blog",
	"links": "*   [Politics blog](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/)\n*   [USSR-Russia. 1988-2018](/18ZaNRBjjZSxV38omZS5tu3ngNExnRYxxA/)\n*   [Military blog](/14UqHSCXV6mF5UKcqg1cR7eg4uUPCSGZtP/)\n*   [DIY@Balancer](/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/)\n*   [Russian Balancer's Blog](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)\n*   [Balancer@ZeroMe](/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/balancer73@zeroid.bit)\n*   [Infonesy.Talk](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/)\n*   [Infonesy.Wiki](/17yiPtXkxqJY6RDyxfh1ZYYWhdq92tbQpE/)\n*   [Airbase.Talk](/1Jb5ZdmvTzVnHpa2hayjQk3H2kZgNVbmBb)",
	"next_post_id": 88,
	"demo": false,
	"modified": 1541077061,
	"post": [
		{
			"post_id": 87,
			"title": "MK-61. My first programmable calculator.",
			"date_published": 1541074195.771,
			"body": "In the summer of 1988, my neighbors in the village threw out a broken calculator. I fixed it and started experimenting. I remembered how in one of the magazines I read about microcalculators independently did some hours-long calculations. It fascinated me, the fact that some devices can do complex calculations without human intervention. And I immediately tried to do the same with my calculator. Alas, I was disappointed. I had a simple model that did count only four arithmetic operations and operations with percentages. And in the examples in the magazine there were some much more complex devices. I began to figure out what microcalculators are needed for this and plunged into the world of programming. What determined my future fate :D In the fall of the same 1988, I got a job as a school lab technician and on my first salary, exactly 30 years ago, bought myself the first programmable gadget - the MK-61 micro calculator :)\n\n![mk61-5.jpg (970x728)](data/img/post_87_mk61-5.jpg)\n\n15 floating point registers, RPN and command memory for 102 operations. Little? But it was a whole huge world. From mathematical tricks and complex integer calculations to a huge number of games for which I spent hundreds, maybe thousands of hours :)\n\nThe programs looked like this:\n\n---\n\n![fh.jpg (437x484)](data/img/post_87_fh.jpg)\n\nThe gameplay looked something like this:\n\n![kb_3_5.jpg (790x562)](data/img/post_87_kb_3_5.jpg)\n\nMy notebook with the programs at the time looked like this (especially now I converted it into PDF and put it in my ZeroUp): [http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1541076780-PMK.pdf](http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1541076780-PMK.pdf)"
		},
		{
			"post_id": 86,
			"title": "Moscow again",
			"date_published": 1540611926.378,
			"body": "Moscow a few days ago. Photo from the hospital where my daughter is being treated.\n\n![IMG_20181023_150800.jpg (1108x900)](data/img/post_86_IMG_20181023_150800.jpg)"
		},
		{
			"post_id": 85,
			"title": "Photos from a walk in Moscow",
			"date_published": 1539090511.171,
			"body": "Next year I plan with my family to relocate from Moscow to Kaliningrad. Therefore, now I have begun to pay more attention to things to which I have got used to for 28 years of life in Moscow and have not paid attention. I began to photograph more often the streets along which I am going home. In memory :) Sometimes something interesting happens.\n\n![20181001_163509_HDR-EFFECTS.jpg (1200x900)](data/img/post_85_20181001_163509_HDR-EFFECTS.jpg)\n\nLast week I walked from one district of Moscow to another, and on the way I photographed such an Orthodox church. By the way, this is a new building, was built last year. In general, I am against the aggressive expansion of the Orthodox presence, but I cannot fail to note the beauty of some decisions :)"
		},
		{
			"post_id": 84,
			"title": "The village cat of our neighbors this summer",
			"date_published": 1538086988.407,
			"body": "![IMG_3397.JPG (1200x800)](data/img/post_84_IMG_3397.JPG)"
		},
		{
			"post_id": 83,
			"title": "Moscow, Petrovka, 38",
			"date_published": 1531475147.681,
			"body": "![2018-0625-1245-petrovka-38.jpg (1200x900)](data/img/post_83_2018-0625-1245-petrovka-38.jpg)\n\nMoscow, Petrovka, 38\\. One of those Moscow addresses that everyone in the USSR knew from childhood, as in Britain they know Baker Street 221B :) Previously, there was a Moscow criminal search, which very often figured in a detective movie. Now - the same thing, only under a different, more bureaucratic name.\n\nIn general, I am depressed in Russia by the growth of bureaucratization of names, mass bureaucratic style at every step. Even on the bus you go, social advertising - \"this can lead to the creation of an emergency!\". No, just to be \"can cause an accident\". And so it is everywhere."
		},
		{
			"post_id": 82,
			"title": "15 years ago",
			"date_published": 1531329833.586,
			"body": "Just Moscow, the Sokol district that day 15 years ago. July 11, 2003 :)\n\n![2003-0711-1426-img_3352-200k.jpg (1280x960)](data/img/post_82_2003-0711-1426-img_3352-200k.jpg)"
		},
		{
			"post_id": 81,
			"title": "Day of Pioneers",
			"date_published": 1526738236,
			"body": "On this day, May 19, the Day of Pioneers was celebrated in the USSR: D The Pioneer Organization in the USSR is something of the type of American scouts, only it had coverage all over the country and with ideological overtones. I completely forgot this date, if it was not remembered in Telegram - it would not have occurred to me :) Under this case - photos, which are exactly 35 years old (+ month) - April 22, 1983\\. On the photos - the day when I was accepted into the pioneers :)\n\n![PICT0086-200k.JPG  (1280x854)](data/img/post_81_PICT0086-200k.JPG)\n![PICT0088-200k.jpg (1280x1919)](data/img/post_81_PICT0088-200k.jpg)​​​​​​​"
		},
		{
			"post_id": 80,
			"title": "Rain",
			"date_published": 1526403361.752,
			"body": "It rains. Photographed now from the balcony :) Quality bad, so that the drops are not smeared, I had to shoot on ISO3200\\. And in addition - a small crop. But it's still interesting :)\n\n![IMG_2275-200k.JPG  (1280x853)](data/img/post_80_IMG_2275-200k.JPG)"
		},
		{
			"post_id": 79,
			"title": "A little walk",
			"date_published": 1521432974.99,
			"body": "Yesterday I went with my daughter to the Cosmonautics Museum to perform the next stage of the school Olympiad. But there was a HUGE queue at the entrance. I had to give up going to the museum and just climb the snowdrifts :)\n\n![20180318_152151.jpg (1200x900)](data/img/post_79_20180318_152151.jpg)\n\n![20180318_152318.jpg (1200x900)](data/img/post_79_20180318_152318.jpg)"
		},
		{
			"post_id": 78,
			"title": "Russian breakfast",
			"date_published": 1521188322.716,
			"body": "Just Russian breakfast now. Vodka. Caviar :)\n\n![20180316_102134-200k.jpg (1280x960)](data/img/post_78_20180316_102134-200k.jpg)​​​​​​​"
		},
		{
			"post_id": 77,
			"title": "Flowers on March, 8",
			"date_published": 1520700730.982,
			"body": "My wife was returning home from work. At the entrance of the house two drunken guys gave her two huge bouquets of tulips. And in every door handle in the apartments of our house - the flowers are stuck :)\n\nThis, apparently, the people continue to celebrate the women's day, the 8th of March :)\n\n![20180310_193607.jpg (1200x900)](data/img/post_77_20180310_193607.jpg)"
		},
		{
			"post_id": 76,
			"title": "Global warming",
			"date_published": 1519885186.817,
			"body": "Last night I burned myself to the central heating battery. I took an IR thermometer and measured the temperature. 94.0 °C (201.2 °F). The municipal services decided to resist frost, the promised weather forecast. Heating system in my house is old, the degree of heating is not regulated. He called the communal service, they answered that it was normal. We have to open the windows to the street and warm the atmosphere. Russia is a generous soul! :)\n\n![01-5996517-20180228-214640.jpg (640x426)](data/img/post_76_01-5996517-20180228-214640.jpg)"
		},
		{
			"post_id": 75,
			"title": "Dagestan",
			"date_published": 1519021818.03,
			"body": "From old photos. This is May of 2010 year. Dagestan. Mountain village of Kuba. The place where my wife's mother was born and grew up.\n\n![20100515-1140-img_6109.jpg (1200x801)](data/img/post_75_20100515-1140-img_6109.jpg)\n\nIn ancient times, the valleys of Dagestan were too valuable a place to settle them. There are few arable land. Therefore, people settled in the mountains, in places unsuitable for farming. At the same time it helped create additional protection from attacks."
		},
		{
			"post_id": 74,
			"title": "Hot pizza in Moscow",
			"date_published": 1519020009.235,
			"body": "On the motor scooter the inscription: _Delivery of **HOT** pizza._\n\n![20180201_083635.jpg (1200x900)](data/img/post_74_20180201_083635.jpg)​​​​​​​"
		},
		{
			"post_id": 73,
			"title": "Winter in Moscow",
			"date_published": 1517926925.296,
			"body": "My DSLR suddenly fixed itself. Today walked a little along the street :)\n\n![2018-0206-1344-img_1701.jpg (1200x801)](data/img/post_73_2018-0206-1344-img_1701.jpg)\n\n---\n\n![2018-0206-1339-img_1684.jpg (1200x801)](data/img/post_73_2018-0206-1339-img_1684.jpg)\n\n![2018-0206-1333-img_1664.jpg (1200x801)](data/img/post_73_2018-0206-1333-img_1664.jpg)\n\n![2018-0206-1253_56.jpg (1200x850)](data/img/post_73_2018-0206-1253_56.jpg)"
		},
		{
			"post_id": 72,
			"title": "A little drink",
			"date_published": 1517843293.075,
			"body": "I decided to match the Russian image a little and now I mixed vodka with tomato juice. Made several shots Bloody Mary :)\n\n![20180205_175308.jpg (675x900)](data/img/post_72_20180205_175308.jpg)\n\nIn fact, I rarely drink vodka. Last time he drank it a few months ago. I prefer to drink beer. Slightly less often - cognac or wine. Even rarer - rum or whiskey."
		},
		{
			"post_id": 71,
			"title": "Meanwhile in Moscow",
			"date_published": 1517817578.532,
			"body": "Meanwhile, in Moscow, winter continues. Over the past two days, the monthly snowfall rate has fallen. In many places the snow lies knee-high. Communal services work continuously, but do not have time to clean all this snow.\n\n![20180205_101209.jpg (1200x900)](data/img/post_71_20180205_101209.jpg)\n\n---\n\n![20180205_101115.jpg (1200x900)](data/img/post_71_20180205_101115.jpg)\n\n![20180205_100913.jpg (1200x900)](data/img/post_71_20180205_100913.jpg)"
		},
		{
			"post_id": 70,
			"title": "Bird feeder",
			"date_published": 1517816899.529,
			"body": "Somewhere a week ago, as part of a school assignment, my daughter and I made a bird feeder. But in the courtyard is the XXI century. So I decided to hang the feeder not somewhere in the street, but outside. And sent there a Web camera. Put a program that takes pictures when changing the picture. Birds for a long time ignored the trough, but today the first titmouse arrived. Unfortunately, the titmice eat animal food, but we only have a vegetable in the food trough. It will be necessary to expand the menu :)\n\n![motion_2018-02-05_09.36.41_671.jpg (1200x675)](data/img/post_70_motion_2018-02-05_09.36.41_671.jpg)\n\nIt's a pity, the web-camera at me through the glass badly removes, so the quality is bad.\n\n**Update:** In the program, which detects movement in front of the camera, there were a lot of garbage photos. Now I collected from them such a timelapse :)\n\nhttps://www.youtube.com/watch?v=h1NNx3OYKBs"
		},
		{
			"post_id": 69,
			"title": "Just a photo",
			"date_published": 1517786515.825,
			"body": "Just a photo four years ago without any sense :) The temple looks like a toy, but in fact it is a large building, standing much further :)\n\n![20140115-1519-img_7922.jpg (1200x800)](data/img/post_69_20140115-1519-img_7922.jpg)"
		},
		{
			"post_id": 68,
			"title": "Moscow subway",
			"date_published": 1517785130.655,
			"body": "I do not know what modern subway cars look like in the USA. I see them regularly only in the movies, but I do not know how much this corresponds to reality. And in the Moscow metro now there are such interesting trains - they are through. Without separation into individual wagons inside. You can go through the whole train without noticing the change of wagons.\n\n![20180127_222803.jpg (1200x900)](data/img/post_68_20180127_222803.jpg)\n\n* * *\n\nAlthough, if we talk about the subway, then come across and such vintage cars. Interestingly, the car is relatively new, 2010 built. But it's made \"under the old days\" :)\n\n![20101206-2158-img_8733.jpg (1200x900)](data/img/post_68_20101206-2158-img_8733.jpg)\n\n* * *\n\nRecently opened a new metro station, Troparevo. When I see these trees, the association with the Tree of Pain from Hyperion immediately comes to mind and I look forward to the appearance of the Shrike :)\n\n![CAM00197.jpg (1200x900)](data/img/post_68_CAM00197.jpg)"
		},
		{
			"post_id": 67,
			"title": "Record snowfall in Moscow",
			"date_published": 1517745947.247,
			"body": "I drove my daughter to the lessons of algorithmic work at VDNKh. Returned home, rake pictures :)\n\n![20180204_141041.jpg (1200x900)](data/img/post_67_20180204_141041.jpg)\n\n![20180204_134436-001.jpg (1200x900)](data/img/post_67_20180204_134436-001.jpg)\n\n---\n\n![20180204_135235.jpg (1200x900)](data/img/post_67_20180204_135235.jpg)\n\n![20180204_141437.jpg (1200x900)](data/img/post_67_20180204_141437.jpg)\n\nThe snowblower is stuck. The workers dug it out with shovels and pushed it. Even some passers-by approached and advised :D\n\n![20180204_140905.jpg (1200x900)](data/img/post_67_20180204_140905.jpg)"
		},
		{
			"post_id": 66,
			"title": "ZeroNet: Number of posts by year",
			"date_published": 1516908287.322,
			"body": "> **[Is ZeroNet dead from 2016?](/Talk.ZeroNetwork.bit/?Topic:1512623414_1HBy99H2dsCwevdYZp8VVC2SVG69DGVyEd/Is+ZeroNet+dead+from+2016)**\n\nStatistics on the number of posts in blogs that I found and posts which I collect at [http://www.zites.cf](http://www.zites.cf)\n\nIndeed, in 2017 the message was three times less than in 2016.\n\n![2018-01-25_22-24-21.png (160x221)](data/img/post_66_2018-01-25_22-24-21.png)"
		},
		{
			"post_id": 65,
			"title": "Snow make-up",
			"date_published": 1516324691.977,
			"body": "Such a snow make-up appears in the girls in Yakutia, while they go from home to work at a temperature of -53 °F (-47 °C) :)\n\n![uCvHotuGtLQFkdOK.jpg (720x900)](data/img/post_65_uCvHotuGtLQFkdOK.jpg)"
		},
		{
			"post_id": 64,
			"title": "Sledding",
			"date_published": 1516320804.574,
			"body": "We went with kids to sledding :) Although up to the hill in the Alley Cosmonauts (a place for walking nearby) go for 15 minutes, we go out there rarely.\n\n![20180118_173159.jpg (1200x900)](data/img/post_64_20180118_173159.jpg)\n\n![20180118_173844.jpg (1200x900)](data/img/post_64_20180118_173844.jpg)\n\nAnd in Russia, meanwhile, [there are baptismal bathing](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:42:Baptism+of+Jesus+in+Russia)."
		},
		{
			"post_id": 63,
			"title": "Microscope for daughter",
			"date_published": 1514988985.466,
			"body": "There is such a popular anecdote :) — _Do you want your son to be born or a daughter? — Son of course! **I want to buy a radio-controlled helicopter**!_\n\nI bought a daughter on the New Year as a gift on the AliExpress microscope :) As usual, a gift from a series of the above-mentioned _radio-controlled helicopter_ :D My daughter is not very interesting yet, and I recalled my childhood with pleasure: D Moreover, the increase in this microscope provides better than in school in my childhood.\n\nIn the kit there is a set of ready-made preparations, 12 pieces of different vegetation. And I ordered another set of 48 preparations (I have not come yet, a month and a half already on the way). But it's more interesting, of course, to do it myself :)\n\nHere, school classics, peel of onions. An increase of 200 times, but when shooting with a phone through the eyepiece it's difficult to talk about the exact magnification :)\n\n![20180103_134325-_______-______.jpg (900x900)](data/img/post_63_20180103_134325-_______-______.jpg)\n\nHere is a crop with a photo of a slice of a leaf of some flower from the kitchen :D Chloroplasts are clearly visible. I remember that I did not see them at school. The cells themselves are big white spots.\n\n![20180103_134227-___________.jpg (559x554)](data/img/post_63_20180103_134227-___________.jpg)"
		},
		{
			"post_id": 62,
			"title": "New Year's pyrotechnics",
			"date_published": 1514660436.545,
			"body": "It so happened that I did not buy pyrotechnics in stores for my whole life. Except for Bengal lights. In my childhood and students I used pyrotechnics myself, then there was no time, then there was nowhere to buy.\n\nA week ago, in the GIS-directory in the phone I made a query for \"fireworks\" and found a pyrotechnics shop less a mile away from the house.\n\nI went there yesterday. Has bought a bag of all junk :) For 2000 rubles, it's about $35 ;) Firecrackers, crackers, Bengal candles, Roman candles, all sorts of flyers from \"moths\" to rockets of different calibers. Only I did not buy batteries of salutes, they conceptually did not make me happy.\n\nToday, my family tested it in part. According to the test results, Roman candles were the most liked. But I took small, 0.5\", 4 pieces in the set, such\n\n[https://www.youtube.com/watch?v=-CBgauyrCLo](https://www.youtube.com/watch?v=-CBgauyrCLo)\n\n* * *\n\nSo I went today and took four more \"candles\", but already 2x 1.5\" and 2x 1\" :) Another 2000+ rubles :D One and a half inch tubes are such monsters, from the ground to my waist. Especially I was pleased with the instruction - \"to thrust into the earth for 2/3 of the length\". This is for the pipe almost in the hand thick! :D Apparently, the instruction is taken from small candles.\n\nAlthough small candles are also interesting in their own way. I think that big candles explode at high altitude, which is cool, but far. And from the small candles the charge takes off about 10 meters upwards. And after the explosion, the lower part of the cloud of burning fragments turns out to be on the ground - in reality everything around shines and shoots :D"
		},
		{
			"post_id": 61,
			"title": "Moving the political part of the blog",
			"date_published": 1513433445.553,
			"body": "I decided to separate the political component of the blog from everything else. The policy will now be in a separate blog: [Broken English: Politics](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/).\n\nAbout the reasons, wrote in the [first post of the new blog](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:1:Why+is+all+this+necessary+).\n\n![politics_demotivator_by_party9999999-d3fyyzy_1_.jpg (900x602)](data/img/post_61_politics_demotivator_by_party9999999-d3fyyzy_1_.jpg)​​​​​​​"
		},
		{
			"post_id": 60,
			"title": "Russian weapon in StarWars",
			"date_published": 1513427183.911,
			"body": "How many times have seen the Star Wars, but never paid attention to the fact that Princess Leia is armed with the Russian sports pistol of Margolin :) For me, his image is somehow used since childhood, so the eye did not even cling.\n\n![vzvezdnyihvoynahnashlipistoletslepogosov.jpg (700x466)](data/img/post_60_vzvezdnyihvoynahnashlipistoletslepogosov.jpg)\n\n![leiablaster.jpg (550x240)](data/img/post_60_leiablaster.jpg)\n\n[MCM_pistol @ Wikipedia](https://en.wikipedia.org/wiki/MCM_pistol)\n\nI think someone will be interested in the fact that Russian weapons designer Mikhail Margolin was completely blind. He was wounded in the head in 1924 and completely lost his sight. In 1926, already blind, he became an instructor in small arms. He studied the design of the weapon to the touch. Since 1933, he himself began designing small arms.\n\n![1471871219_margolin2.jpg (650x443)](data/img/post_60_1471871219_margolin2.jpg)\n\nIn my opinion, this is the only case in the world when a blind person has mastered the profession of a small arms designer.\n\nUnfortunately, there is no article on this man on the English Wikipedia, only in Russian:\n\n[Марголин, Михаил Владимирович @ Wikipedia](https://ru.wikipedia.org/wiki/Марголин,_Михаил_Владимирович)"
		},
		{
			"post_id": 59,
			"title": "Syria: returning",
			"date_published": 1513099782.849,
			"body": "The sheepdog meets its master, the sapper who returned from Syria.\n\n![photo_2017-12-12_19-50-15.jpg (961x801)](data/img/post_59_photo_2017-12-12_19-50-15.jpg)​​​​​​​Russian sappers did a great job in Syria. And it was exclusively peaceful work."
		},
		{
			"post_id": 58,
			"title": "The whole truth about Russia",
			"date_published": 1513084721.868,
			"body": "Rare photo: The fighting bear is guarded the Russian gas pipeline.\n\n![DPg8pHuXkAE138h.jpg (747x502)](data/img/post_58_DPg8pHuXkAE138h.jpg)​​​​​​​"
		},
		{
			"post_id": 57,
			"title": "About Russian nationality",
			"date_published": 1512541830.319,
			"body": "> **SobieskiSavedEurope**:\n> Konstantin Ciolkowski's father was Polish.\n\nSergey Brin was born in Moscow. Father is a Russian Jew. Mother is Russian. Let's assume that Google is a product of the Russian intellect? :)\n\n...\n\nYour approach, based on the analysis of the origin and surnames will not work. Because there are practically no Russians in this approach :) Like Americans, by the way :D Although there are far more native Americans left than native Russians, because America is engaged in the remelting of nations much less than Russia.\n\nI have previously quoted a historical anecdote:\n\n> Emperor Nicholas I once at a court ball asked the Marquis Astolph de Custine, who fled to Russia from the French Revolution:\n> \n> \"Marquis, do you think there are many Russians in this room?\"\n> \n> \"All but me and foreign ambassadors, Your Majesty!\"\n> \n> — You are wrong. This my approximate is a Pole, that's a German. There are two generals standing there: they are Georgians. This courtier is a Tatar, here is a Finn, and there is a baptized Jew.\n> \n> \"Then where are the Russians?\" Inquired Custine.\n> \n> — But all together they are Russian.\n\nNow, this is reality. Actually, the mother of Nicholas I was a German. The mother of the last Russian Tsar, Nicholas II, was a Dane. Lenin's mother was born in a German-Shevdian-Jewish family (although in Russia). Stalin was a pure Georgian ...\n\nI had a familiar Cuban who came to Russia in 1990, to study at the Chemical Technology Institute (we studied with him in the same group). So, five years have passed of his life in Russia. Sometimes, we sit in the hostel, drink, talk about different things. And he will say - \"Here we are, Russians ...\". We are laughing - \"Juan, but which of you is Russian?\". He in response - \"What, there, at Pushkin grandfather in general was a Negro! And nothing, the great Russian poet! \". And Juan, really, became Russian :)\n\nI have a friend, a purely Slavic appearance. He counted 11 nationalities in his ancestors, including Greek. And not a drop of Slavic :) I myself have a mixture of Russian (\"conditionally Russian\" - as I mentioned above, it is almost impossible to find pure Russians), Uzbek and Bashkir blood. And even a little gypsy :) Another friend who was considered Russian to the devil knows what kind of generation it turns out, grandfather is a Jew. Another friend - that's right half the Jew, half Russian. I, like that, just can not name any of my friends who at least at the level of grandparents would all be \"conditionally Russian\" :)\n\nSo humble yourself. Or you will have to recognize Tsiolkovsky as Russian, or admit that Russians do not exist as a nation :)\n\n...\n\nPersonally, I consider nationality - this is in what cultural environment the child was formed and under the influence of which language his brain was formed as a child."
		},
		{
			"post_id": 56,
			"title": "Latvia Bans Russian Judges From Military Simulation Contest",
			"date_published": 1512285746.988,
			"body": "COPENHAGEN, Denmark — An association of airsoft players in Latvia is expressing outrage after three Russian contest judges were deported before the start of a tournament for teams that use replica weapons and plastic pellets in military simulations.\n\nThe Latvian Airsoft Players Association said the Open Baltic Airsoft Cup 2017 will be rescheduled after the Russians were banned from the one-day competition.\n\nThe association said it communicated \"intensively\" with Latvian authorities ahead of the \"sport event\" that was expected to draw about 300 participants. It says the tournament likely will be moved to another country.\n\nThe Russian judges entered Latvia legally. However, Latvia's Security Police told the Baltic News Service \"an efficient control mechanism\" was needed to prevent \"military tactical trainings in Latvia.\"\n\nLatvia, Estonia and Lithuania are concerned about Moscow's military muscle in the Baltic region.\n\n// https://www.nytimes.com/aponline/2017/12/02/world/europe/ap-eu-latvia-military-simulation.html"
		},
		{
			"post_id": 55,
			"title": "TV in Russia",
			"date_published": 1512032374.432,
			"body": "Meanwhile, the number of Russians watching television for seven years fell by half.\n\nOnly 29% of Russians choose to watch TV programs as entertainment in their spare time, while pensioners spend their leisure time watching TV 56%. In the age group from 18 to 24 years, less than 10%.\n\n![In-America-News-Best-Demotivational-Posters_1_.jpg (500x414)](data/img/post_55_In-America-News-Best-Demotivational-Posters_1_.jpg)"
		},
		{
			"post_id": 54,
			"title": "Trams and cars",
			"date_published": 1511595521.991,
			"body": "A little about trams and cars in Russia :)\n\n<video controls=\"controls\"><source data-cke-saved-src=\"/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/It-do-not-care-if-tram-it-s-iron-G2-uFRSJLW0.mp4\" src=\"/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/It-do-not-care-if-tram-it-s-iron-G2-uFRSJLW0.mp4\" type=\"video/mp4\">\nYour browser does not support the video tag.</video>\n\n«It do not care if It's tram - it's iron»\n\n*   To view this video, you need to connect the [ZeroUp@Balancer zite](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/).\n*   Origin: [https://www.youtube.com/watch?v=G2-uFRSJLW0](https://www.youtube.com/watch?v=G2-uFRSJLW0)"
		},
		{
			"post_id": 53,
			"title": "The perfect sandwich",
			"date_published": 1511461625.399,
			"body": "Two years ago in Nature there was an article, why the most tasty food seems to us, which contains 35% of fats and 50% of carbohydrates. That's why we like the taste of chips, peanut butter, chocolate ...\n\n[Fat/carbohydrate ratio but not energy density determines snack food intake and activates brain reward areas](https://www.nature.com/articles/srep10041)\n\nI weighed a Russian sandwich on the scale with such a combination of fats and carbohydrates. Perhaps this is close to the ideal? :) (a glass of vodka outside the frame - then it would be ideal :D)\n\n![20171122_185430-200k.jpg (0x0)](data/img/post_53_20171122_185430-200k.jpg)\n\nThese are two very traditional Russian products - black bread and \"salo\" :) Unambiguously Russian \"salo\" in English is not translated. It's not bacon, not lard - something similar, but different. Black bread is also poorly known in the West. The closest thing to it is a similar German bread, but it does not exactly resemble it."
		},
		{
			"post_id": 52,
			"title": "Just selfie :)\n",
			"date_published": 1511459706.301,
			"body": "![20171119_154403_02.jpg (0x0)](data/img/post_52_20171119_154403_02.jpg)"
		},
		{
			"post_id": 51,
			"title": "Jakub Rozalski — the storm will pass",
			"date_published": 1511238838.93,
			"body": "There is such an interesting Polish SF&F painter, [Jakub Rozalski](https://www.artstation.com/jakubrozalski). Despite its largely anti-Russian creativity, its pictures in Russia are popular :) And now, every time I look at his pictures, I have an association with China.\n\n![photo_2017-11-21_00-00-47.jpg (0x0)](data/img/post_51_photo_2017-11-21_00-00-47.jpg)\n\nWhen I watch Chinese movies about World War II (for example, [Ip Man](http://www.imdb.com/title/tt1220719/)), I get the impression that the Chinese perceive their enemies as a natural disaster. For example, cruel Japanese came. They create terrible things. Someone proudly resists them on an individual level. But all this protest is powerless. It is impossible to fight with a volcano or a hurricane. You can escape, hide and wait for the storm to go away. Time passes and the Japanese leave. Themselves. Their time is over. All the processes of the war between the USSR and the USA and Japan remain somewhere far behind the scenes - this is not important from the point of view of the Chinese psychology. The storm subsided on its own. You can leave the shelter. Probably, that's why Sun Tzu said \"If you wait by the river long enough, the bodies of your enemies will float by\".\n\nSo, in the paintings of Rozalski I see the same story :) Some absolutely irresistible monsters come from Germany or Russia. But it's enough to wait and they will die themselves.\n\nP.S. It is interesting that Rozalski himself does not live in Poland, but in Hamburg. Probably waiting in a safe place until the next storm is over :)"
		},
		{
			"post_id": 50,
			"title": "Mordor",
			"date_published": 1509774564.679,
			"body": "View of Moscow.\n\n[![DMQdOpkV4AAdOvW-200k.jpg (0x0)](data/img/post_50_DMQdOpkV4AAdOvW-200k.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmZ3UE8FMy2RTnyKAaXohZ1HVtiszAVsF2sqsF7ohxW2Qo/fileDUO4XK.jpg)\n\nIn recent years, many of the Russians have become proud to call themselves residents of Mordor :)\n\nAnd Putin is respectfully called the Darkest :)"
		},
		{
			"post_id": 49,
			"title": "iPhone X in Moscow",
			"date_published": 1509704012.767,
			"body": "Today, the first sales of the iPhone X in Moscow began. But Muscovites have been standing in line for two days already :) This is some kind of madness, in my opinion :)\n\n![796424_main_1_.jpeg (0x0)](data/img/post_49_796424_main_1_.jpeg)\n\n![5f812b18659def6782bd3ebb3861897c_1_.jpg (0x0)](data/img/post_49_5f812b18659def6782bd3ebb3861897c_1_.jpg)\n\n![photo_2017-11-02_15-26-49.jpg (0x0)](data/img/post_49_photo_2017-11-02_15-26-49.jpg)"
		},
		{
			"post_id": 48,
			"title": "Russian internet there are so many harsh insults from Russians against European",
			"date_published": 1508053618.707,
			"body": "**Political Interest:**\n\n> But when I go on the Russian internet there are so many harsh insults from Russians against Europeans. They call us Gayropa or Eurosodom. Instead of wanting to help us they just insult us.\n\nYes, unfortunately, this is also there. I gave an example above about how looking at one Truth different people see the different trues. The average Russian people also sees the situation one-sidedly. Although, I hope, all the same, somewhat wider than the western philistine. In Russia, there is much more direct information available from the West than in the West from Russia.\n\nSuch a complex relationship has a long background, it was not formed in one day.\n\n* * *\n\n*   In the early 1990s, when the USSR collapsed, it was largely due to the fact that people of the USSR turned to freedom and openness of the West. There was a great hope that at last friendship and harmony will come in the world :) I myself believed in it at that time. But the reality turned out to be more cruel. The West did not need independent friends :) As Russia returned to independence, relations became increasingly strained. People lost faith in friendship between states.\n\n*   The United States, felt that they remained in the world at that time the only leading world political force began to pursue a very rude policy. Yes, of course, every state has the right to take care of its interests, but in this case a whole system of political relations was broken, which was built for decades. And no one could control this in any way. After this, russian people lost faith in the justice and honesty of the West.\n\n*   The West actively supported Chechen terrorists. Not just separatists, in 1992 Russia was ready to give Chechnya independence, but support specifically concerned those responsible for the terrorist attacks and murders. It began to shape the image of the West as an enemy.\n\n*   In the 2000s, the West began actively destroying the situation in the Middle East. The wars in Iraq, Libya, Syria. In Russia, most do not feel illusions about the value of the Middle Eastern states. And Russia had no big interests there. Therefore, in itself, this would cause some discontent in Russia, but not great. But the United States and Europe staged such chaos there that he began to threaten not only Russia, but also Europe itself. Here the story could go along different paths, many in Russia began to empathize Europe, even despite past disagreements. Russia knows very well what terrorist acts of Islam are, and the pain of others for the Russian people always means a lot, even if it is the pain of yesterday's enemy. But Europe has led a very strange policy for Russia, in fact encouraging the existing phenomenon. The distribution of refugees, the dictatorship of tolerance and the forcing of military operations in the Middle East ... This repulsed many of those who were ready to worry about Europe.\n\nThe year 2014 was a turning point. You can argue a lot from different points of view about the events in the Crimea and Ukraine and we will not come to a consensus. As I have explained many times, it all boils down to the basic principles of the world view, to the choice of priorities of justice or legality. But we are talking about the points of view of specific people. So, from the point of view of the Russian outlook, Russia did right then. Not just profitable for yourself, namely sacred right. And for the right, just act was a sharp and aggressive response of the whole West. The West imposed sanctions. The West began to conduct active anti-Russian propaganda. The West is trying to strike at all levels, even on those that have always been considered not political in Russia - sports, culture, the Internet ... The West blames Russia, at times, with very ridiculous accusations. From the point of view of the Russian, this all looks like the actual beginning of the war against Russia.\n\nIt is not surprising that such an impact first, finally shaped the image of the West as an enemy-aggressor. And secondly, it rallied the Russians - patriotism sharply increased, Putin's rating as the head of state rose to unprecedented heights ...\n\nAs it seems to me, what is happening in Russia is of little interest to the West. Russia today in the West is used more as an internal political scarecrow. I do not think that in the same USA, many people seriously believe that Russia can threaten them somehow (nuclear weapons do not count, it's another story). Therefore, the Western philistine repeats what he hears in the media, but it is somewhere deep in his heart that he understands that this is information foam.\n\nBut the Russians is in a different situation. The official Kremlin does not blame the West for aggression against Russia. Yes, this has been happening more and more recently. But this information is second nature. But the Russians have free access to Western media. And the Russians see with their own eyes how aggressive the West is today against Russia. They see it directly from the Western media, not from the Russians. And this sets the Russians against the West much, much more than any propaganda of the Kremlin. Which, just, is not interested in breaking off relations with the West.\n\nI could not respond in short, the result was long. And, I'm afraid, after electronic transfer much will be unclear. But it's hard to explain such questions in short form :) Someone will read this unpleasantly, but remember that the points of view are different. And I here described not even my own point of view, but those Russians who accuse and blame the West on the Internet."
		},
		{
			"post_id": 47,
			"title": "Arrests in Roskomnadzor",
			"date_published": 1507886669.747,
			"body": "In the Russian Internet noisy scandal :) In Russia there is the main \"prohibitive\" organization, Roskomnadzor. It actively blocks all sorts of pirate and extremist sites. And along with them for idiocy and illiteracy, absolutely innocuous sites fall under the ban. For this Roskomnadzor in the Russian Internet is literally hated. Yesterday several top managers of Roskomnadzor were arrested on charges of fraud in especially large amounts. For example, they created a fake organization to control radio frequencies, for the maintenance of which received millions of dollars. On this occasion in RuNet more holiday :D\n\nThere are three things you can watch forever: fire, water, and the news about the arrests in the leadership of Roskomnadzor :)"
		},
		{
			"post_id": 46,
			"title": "True vs Truth",
			"date_published": 1507883816.375,
			"body": "The picture is very famous in Russia, but I hardly found it in English. And, yes, I used to write in a parallel topic, in Russian the words truth (истина) and true (правда) differ very much both in pronunciation and in meaning :)\n\n[![](data/img/post_46_filej2YoX4.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmVL5mYresn1kZY2R8WuZ4GZzo8jVXvNTEchvmmB8sbC1B/filej2YoX4.jpg)"
		},
		{
			"post_id": 45,
			"title": "Learn to read Russian in 15 minutes",
			"date_published": 1507883609.771,
			"body": "A long picture on how to learn to read in Russian :) Indeed, although the Russian language is difficult for English speakers, but it is not difficult to read in Russian. Some of the letters are the same as in the Latin alphabet, the part exactly corresponds to Greek letters. Exceptions are few.\n\n[![](data/img/post_45_filegiROUR-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmSnFK7HD4Lm99FXgzv3WJhads4Aoju9hMCd9DguqQWhks/filegiROUR.jpg)\n\nMy name is **Роман** :)"
		},
		{
			"post_id": 44,
			"title": "Do the Russians want war?",
			"date_published": 1507821646.715,
			"body": "Looked now S2E14 of \"Lie to Me\" TV-series. And I noticed one more feature. Lightman's grandfather was a soldier. And this is such an event that his daughter is surprised - \"why did not you tell me about it?\" And, in fact, it is valid so. It is difficult to estimate the number of those who fought in view of the rotation of soldiers. But we can compare the number of deaths in World War II. The United States lost 0.4 million people. Russia lost 27 million killed. Therefore, in Russia the question usually arises the opposite - wonder if the grandfather of people of the Lightmans age did not fight. This also leaves a big imprint on the worldview. Residents of the US do not know from their experience what a massive bombing is. What is the whole settlements burned with all the inhabitants. Today's Americans do not know what it means to fight for the sake of their existence. And in Russia this majority knows first-hand.\n\nBy and large in this respect, only the Germans can understand of the Russians :)"
		},
		{
			"post_id": 43,
			"title": "Modernism in Moscow",
			"date_published": 1507206941.449,
			"body": "And a bit of modernity. Here such an installation I met one of these days on one of the absolutely unremarkable little Moscow streets :)\n\n![20170929_164414_02-200.jpg (0x0)](data/img/post_43_20170929_164414_02-200.jpg)"
		},
		{
			"post_id": 42,
			"title": "15 years ago",
			"date_published": 1507206540.961,
			"body": "The car park in Moscow in 2002\\. In general, at the road junction under my window there were light car accidents on a regular basis. Sometimes twice a week. So there are a lot of photos of this place :) It's interesting that the cars in the majority are still Soviet-made. It will take only 5 years and most cars will become foreign cars. 19 September 2002\n\n![](data:,)![2002-0919-0905-img_1385-200.jpg (0x0)](data/img/post_42_2002-0919-0905-img_1385-200.jpg)"
		},
		{
			"post_id": 41,
			"title": "60 years of space age",
			"date_published": 1507103880.186,
			"body": "I do not know whether this is shown in the Western media. I'm lazy to check :) But here are 360 videos filmed in open space. Made to today's 60th anniversary of the first artificial Earth satellite (\"Sputnik\").\n\n(YouTube, unfortunately, is no longer embedded in ZeroNet via iframe. Therefore, only the link)\n\nhttps://www.youtube.com/watch?v=W9u297hArbI\n\nYes, today is the 60th anniversary of the beginning of the space age :)"
		},
		{
			"post_id": 40,
			"title": "15 years ago",
			"date_published": 1507007181.227,
			"body": "Years past pass. An excursion into the past becomes more and more interesting. The mark of 20 years ago is difficult to take - photographs of that time are few. But 15-year-old photos are already available. Photoarchive 2002 is already extensive, just this year, my first digital Canon A40 bought myself :)\n\nI think it will be interesting to see what happened in Russia 15 years ago? :)\n\nIn the photo - my workplace of 10.09.2002.\n\n[![IMG_1322-1280.JPG](data/img/post_40_IMG_1322-1280.JPG)](https://gw-ipfs.tk/ipfs/QmTp4ZWh2mGUK26Bh4ZKGEf1CRNR4jjHywZBVQSjYQge5L/IMG_1322.JPG)\n\n* * *\n\n*   I do not remember the contents of the system unit, although, probably, it is possible to recall through posts in my forum, its archives are available since December 1998.\n*   Monitor Samsung 3NE\n*   Speakers Genius\n*   The keyboard is some kind of BTC, which is characterized by the fact that it was almost the only completely classical AT keyboard at that time without the left buttons\n*   Modem U.S. Robotics Sportster Courier ... By the way, the manufacturer somehow disappeared from the market. It's a pity the name was kosher, according to Asimov :D\n*   Two PDA cradles, for the Casio PV-S450 and for the Audiovox Maestro. The first was interesting with fantastic autonomy. 160 hours from one pair of AAA battery. Batteries for a few months of work (and active reading) was enough. The second is interesting because it was a revolutionary solution - a full-color color PockerPC for $250\\. But the manufacturer Audiovox in the market and could not resist."
		},
		{
			"post_id": 39,
			"title": "Moscow suburbs colors",
			"date_published": 1507006901.939,
			"body": "This is the Moscow suburbs not long ago. We went with my wife to a store specializing in all sorts of things for celebrations. On the way I liked this combination of colors :)\n\n[![20170916_153634-200.jpg](data/img/post_39_20170916_153634-200.jpg)](https://gw-ipfs.tk/ipfs/QmSupSmTY3ZaPUo6QRSo6Ym3uzCLeDuKqTeJ5voBc7Pwz5/20170916_153634.jpg)"
		},
		{
			"post_id": 38,
			"title": "Cloudy skydive",
			"date_published": 1503468480.197,
			"body": "I several times jumped with a parachute. First, just to test me, then - because it became interesting. The last time it was a very long time, in 2003\\. But that day, for the first time, I took a camera with me to the plane. And I got this picture after the jump, when I was falling with a parachute :) There was a lot of cloudiness. On the ground - gloomy, cloudy weather. And above the clouds the sun was shining. The camera, of course, was very primitive at that time. And the picture lost a lot in quality. But anyway, I'm looking at this photo and remember that day.\n\n[![IMG_4079-200k.JPG](data/img/post_38_IMG_4079-200k.JPG)](https://gw-ipfs.tk/ipfs/Qmb5ehM7KJxwenrEz5NDcsLY1QjCfEVN8tCfogcrgeJpY2/IMG_4079.JPG)"
		},
		{
			"post_id": 37,
			"title": "Look from other side",
			"date_published": 1503377520.698,
			"body": "...\n\nNow I thought that without going into details and not getting involved in a dispute, you can sometimes try to write something similar on the contrary, here about Russia. Not about what is happening in Russia, but about what is causing a response from Russian Internet users.\n\nThe Russian Internet is large, it is used by more than 70% of the population. At more than 60% - every day (two out of every three). Therefore, I can not evaluate the whole Internet, but I can talk about those popular centralized resources where I \"live\".\n\nHere, for example, the list of the hottest topics of this month from my own forum :)\n\n1. **The American missile destroyer John McCain collided with a merchant ship**. Well, here it is clear. The topic is hot, soared recently, interest has not yet cooled down. The main topic of the conversation is why in the American Navy, suddenly, so many such incidents have occurred. This does not correspond to the old idea in Russia about the American fleet.\n\n2. **A large fire in Rostov-on-Don.** This is yesterday's very loud news inside Russia. In the Russian city in the sector of private buildings because of the heat and dryness there was a very large fire. Burned up to 40 houses, hundreds of people were left without a roof over their heads. Many assume that this is the result of arson, arranged by realtors who have long wanted to build new houses in this area. Fortunately, no one died and, most likely, the government compensates for the loss of housing, but people are going through very hard. Mobility in Russia is much lower than in America, people are literally \"merging\" with their homes ...\n\n3. **War with monuments in the United States**. In Russia, people are perplexed and joke a lot. They are perplexed, because they realized on their own history how fraught with attempts to rewrite this story, joke because such actions certainly undermine the internal unity of the United States and reduce its influence in the world arena.\n\n4. **Terrorist act in Barcelona**. Everything is clear. Russia always warmly sympathizes with the victims of terror. Although more and more often the opinion is voiced that Europe itself is to blame for what is happening, both directly, being a participant in the unleashing of wars in the Middle East, and indirectly through the support of migrants.\n\n5. **International Forum \"Army-2017\"**. About what they say I do not know, I did not follow this topic :) Probably, they share photos, videos and discuss military sport achievements.\n\n6. **In Surgut, a freak with a knife of people cut**. This is a variant of \"Chinese\" and \"Israeli\" terrorist acts. In Russia it is new. Fortunately, the terrorist did not have time to kill anyone, was shot by a policeman. At first they thought that the usual psycho, but today it turned out that he had sworn an oath of allegiance to ISIS. It's unpleasant that such a case pours water onto the nationalist mill. Again, slogans are sounded about the separation of the southern (Caucasian) regions of Russia and the fight against national minorities in Russia.\n\n7. **\"Our customs\" on the topic**. Self-criticism about the unpleasant features of wild business (low quality of tourist services, taxis) and whether the state should strictly regulate the quality of service issues or this market should develop freely.\n\n8. **\"Flood\" about the division and decay of countries.** Geopolitics of separatism after the collapse of the USSR.\n\n9. **R&D on VTOL is incorporated in the state program of armaments 2018-2025**. Discussion of the prospects for the revival of VTOLs and whether we need it at all.\n\n10. **The USA against the USA**. The title of the old topic \"*USA vs Russia*\" is being played. Again, discussion of the split in the United States on the subject of monuments to the Confederates.\n\nAlso a lot of discussions (but this is already without the popularity rating of the topics):\n\n- The terrorist act in Turku. News on the attack in Finland. There was no discussion, it was lost against the news of the terrorist attacks in Brussels and Surgut, but many people read this topic.\n\n- Entering Lebanon in the war with ISIS.\n\n- The plot of a new \"Avatar\" by James Cameron. And the world of \"Avatar\" in general.\n\n- Long-running dispute around the F-35.\n\n- USA vs Russia. The topic was mentioned indirectly above. The subject is already 12 years old and it continues to be active :)\n\n- Causes of the collapse of the USSR. It's also a long-standing question, which does not have a single right answer and will therefore be returned to it again and again.\n\n- The dispute about the age of recruitment into the army. When a person is ready to enter the army, and when it's too late.\n\n- Private military companies in Russia. The Wagner Group, its losses in Syria. Do Russia need private military companies?\n\n- Discussion of railway missile systems. Revival of this kind of nuclear forces in Russia in the light of growing tension.\n\n- The possibility of an American strike against North Korea.\n\n- Perspectives of high-tech fighting robots on the battlefield. Achievements in the field of weak AI, etc.\n\n- The war of Syria with ISIS. The question is very hot, but under it is a whole subforum, so each of the topics in itself is not very hot.\n\n- \"Results of Putin\". The eternal and unceasing holywar between Putin's supporters, Putin's opponents and those who believe that he has little to do with anything :)\n\n- Construction of Russia. Another similar topic in which the opposition is trying to achieve some concrete answers, what should be done to ensure that Russia does not become what they are unhappy with. For some reason the discontent can not come up with any practical improvement plan in the country :)\n\n....\n\nWell, I think that's enough for a start. In principle, it is possible to assess what issues now live a certain section of the Internet community in Russia."
		},
		{
			"post_id": 36,
			"title": "Test",
			"date_published": 1503241084.454,
			"body": "Test message for checking the translation to [http://www.zites.cf](http://www.zites.cf)\n\n...\n\nExcellent. The update will now take place once per hour. Later I'll do an update in real time."
		},
		{
			"post_id": 35,
			"title": "Abandoned",
			"date_published": 1500305977.726,
			"body": "The old German dam across the Pissa River near the neighboring village, Priozernoye. The mill in this place was built in 1732\\. When the dam in the modern form appeared I do not know, but it was, of course, before the war (WWII — In Russia, when the war is said, without mentioning a specific name, they always mean the Second World War - in no other war did the country experience such huge losses.). First there was a mill on this dam, when the Soviet Union was there for a while the collective farm hydroelectric power station. Since the 1960s, the dam has been abandoned.\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmXHCHQpRkaw3V5cUbFr4ywtEinWzEKff8jjeZTPjpd4WV/20170716_144554_HDR-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmSzn62ytJPwoRpnPHiPgjoXQcCJwr6yUaFFTsTbTKAndc/20170716_144554_HDR.jpg)\n\nActually, the dam itself.\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmY3E1mjJJGTkCuG7EHZrLYAvLUiERHvr7SMhKBWFhFHbv/20170716_145112_HDR-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmVvYcZBNAmiJseBRvsehqSkijdTMs9RwM8TLDUBzXns38/20170716_145112_HDR.jpg)\n"
		},
		{
			"post_id": 34,
			"title": "The old German road",
			"date_published": 1500287699.331,
			"body": "The old German road. Paving stone. To go on it the real torture, but for many decades without repair it is quite preserved :)\n\nI drove along this road my kid on a three-wheeled bicycle (with a handle for an adult - like a baby stroller turns out). When we reached the end, he groaned with a groan from the bicycle and asked for handles. But I endured until the end :D\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/Qmbi1DPPaG814Bt1t7nXfFLr2AZq36VYskv7UPpqB3eyFp/20170716_150828-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmcVs81eEkPduKZKdVwNjYj8bV7ubquoTZHE5N3SiW2tgZ/20170716_150828.jpg)\n\nIn the Kaliningrad region in general, there are quite a few roads with paving stones. There are even in large cities areas with such roads. For example, in Kaliningrad itself, in Chernyakhovsk ..."
		},
		{
			"post_id": 33,
			"title": "Cemetery",
			"date_published": 1500285059.349,
			"body": "The the war grave (bed of honour? - I do not know how to translate accurately) in the neighboring village (Priozernoe). Here are buried 244 soldiers who died in 1945.\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmP5Ztg1x7p9VoTfr2CkAgBrGA3gCoHaBZqTnzZEb2K6LL/20170716_141646-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmYTHSuMMk28B9FcWH73TzDzxJ58ec75kP739uBQn9Ro4u/20170716_141646.jpg)"
		},
		{
			"post_id": 32,
			"title": "Sky",
			"date_published": 1500227809.537,
			"body": "For some reason I thought that Mikhailovo, where I am now, is a new settlement. However, it turned out, the first mention refers to 1565!\n\nUntil 1615 the village was called Strige. Then, until 1938 - Egeringken (German Eszerningken, Lithuanian Ežerninkai). In 1938, the Germans renamed all the Lithuanian names in German and until 1946 the village was called Neupassau. Well, in 1946 the names of the settlements of Prussia were changed again, already in Russian :)\n\nHere in the photo - Kaliningrad sky above Mikhailovo. Today we went for a walk to the neighboring village, Priozernoe.\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmczCTZW2cysecG39GPLbdNoeYnVTbnhootRcEeaCeGvjw/20170716_134414-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmcofBsFBJwxhoRECBv2yaw4WDjzAGdbJLbG2mkdW6CxaD/20170716_134414.jpg)"
		},
		{
			"post_id": 31,
			"title": "Severe rural humor",
			"date_published": 1500212730.336,
			"body": "Severe rural humor :) In the background is a cemetery. Black garbage can. The slogan on the garbage can is \"The Power of Life in Purity.\"\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmY2hwFsJdjQQPr2nH3DkWbuJxnNLsmUExbnKFxuopsemz/img_0587-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmZEX7Lmc5jHFc5rgJWKKp1tVgZw6hXHJTFiJxZznKEvJN/img_0587.jpg)"
		},
		{
			"post_id": 30,
			"title": "Mushrooms",
			"date_published": 1500211429.722,
			"body": "Some more old photos. Mushrooms in the neighboring forest. Boletus (penny bun, cep, porcino or porcin). Boletus generally like to grow in large groups. It's not all that there were, next to it was up to a dozen mushrooms :)\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/Qmci9C2Kq6CNaavxWcwkTWgemCSjtZXyxeWThdmJYVS42E/IMG_7303-800x800.JPG)]('https://gateway.ipfs.a0z.ru/ipfs/QmPnrE5NjgyB4UhuS8fXvQqe6YNGxWVhzmEs1PKDdmN1Cx/IMG_7303.JPG')"
		},
		{
			"post_id": 29,
			"title": "Oak wallpaper",
			"date_published": 1500190105.929,
			"body": "And here are the old photos. It's an oak tree next to the house. Maybe someone on the desktop wallpaper will come in handy :)\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmbqrHH78kCqMaJQPeXeWUYdAvAaRMN5EbXCACeJEziNAi/20120914-1138-img_8133-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/Qmcy9ZCykP81AwMhdbEMxdQsRsiEjDuVzdtSky6Lx3bYmx/20120914-1138-img_8133.jpg)"
		},
		{
			"post_id": 28,
			"title": "Roadside tree",
			"date_published": 1500188749.49,
			"body": "Just a tree by the road. Unfortunately, this time I did not take a DSLR with me and so I only have to take photos on the smartphone. What deprives the opportunity for high-quality photos :) I'll have to look for something from last year's photos of these places.\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmWWCmH4Axsh5EzAFa8SD6Qyyr4TUhjTwEAFE8tUcB95JE/20170707_172702-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmTFSNRLEfv7eUXBj6qpxZ15JNSAuWcq5BeNcspjz25tjA/20170707_172702.jpg)"
		},
		{
			"post_id": 27,
			"title": "My school",
			"date_published": 1500187710.254,
			"body": "And this is a rural school. I studied there from 1987 to 1990 :)\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmPr4716tX9vQXRCaj6ZSLCCPikv4xz568jEppJJ5NoTj9/20170707_175534-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmWmUgLMwXRNWA2EaBJsG16hcqQVkfRTDcVtAv3qN2TqY3/20170707_175534.jpg)"
		},
		{
			"post_id": 26,
			"title": "Summer in countryside",
			"date_published": 1500185958.744,
			"body": "And again I'm here. My cases in the Kaliningrad region are being delayed. I planned to return to Moscow on July 6, and it was July 16. And not the fact that I will have time to do everything planned before the end of the month :) It's good that my work is remote and I can deal with it from anywhere.\n\nIt's bad that I live in a small village (Countryside? Hamlet?). I do not know the literal analogue of such settlements in America. In American cinema this is not shown :D This is not a familiar American small town, which differs from the big city only in size. And not a farm village where one family lives. It's like a group of several dozen farm villages in one place. So it's bad that there is an uncomfortable and rather expensive mobile Internet traffic. 8 gigabytes of 4G/LTE cost about $10, and I spend 2 gigabytes a day :)\n\nThe village where I live looks like this:\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmSxvH9xwSy8T29ztTV5TAwFQm9JoubjvUeXufhybEMiXJ/20170716_083503-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmTLDvZ9PdmTpSgiD4wKcpcGF8c2SKKW1UVeU34QUbniZt/20170716_083503.jpg)\n\nI just went for milk to neighbors, took a photo on the way, I thought that I had not written anything to this blog for a long time and decided to write this note :)\n"
		},
		{
			"post_id": 25,
			"title": "German ruins",
			"date_published": 1499280122.819,
			"body": "Kaliningrad is noticeably inferior in terms of living standards to Moscow. Salaries here are about half that of Moscow. And the cost of living is less than a half times. However, the city is growing quite actively. Many new houses are being built. However, until now in many places there are such German ruins :)\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmRX48AyG7oH3cN2os1nHvLiowVhMn6MfxCLcP4NnP45NA/20170625_171906-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmVKwmJpUh4M89YNrbNWmU6T8ZffNw8YJHeP6XGmkSsZud/20170625_171906.jpg)"
		},
		{
			"post_id": 24,
			"title": "Königsberg. Sunset.",
			"date_published": 1499280082.536,
			"body": "Kaliningrad is the westernmost city in Russia. The former Königsberg. The former Twangste, Kunnegsgarbs, Knigsberg, Królewiec, Karaliaučius... The city of many names :)\n\nThis is how the Kaliningrad sunset looks.\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmPeY9qmnY5P9hG5MyinWePuCZBTEqUgLw5LJCudvbPLnd/20170625_221651-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmccjtA32M3ig3FSkUJfRXGjRHsWHw2JeEQwnFcTGP2Yxo/20170625_221651.jpg)"
		},
		{
			"post_id": 23,
			"title": "Summer in the countryside",
			"date_published": 1499262965.133,
			"body": "I have not written anything in this topic for a long time. Now I went for a short time with my family to the village in the Kaliningrad region. I work from here remotely. A few photos with brief comments.\n\nThis is an Orthodox church in the district center. Gusev is a small town (28 thousand inhabitants) 20 miles from the border with Poland.\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmdA9MCgFAy59Atcga4w4V6kq5yTvdXaQp341qEQDpofKq/20170627_133402-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmU5XVPwgLzQFB4nctX8DH66rDYadM7sJaMHBWMvtBi1QB/20170627_133402.jpg)\n\n[![](https://gateway.ipfs.a0z.ru/ipfs/QmcX88RM2P8VQKCrihe2KtS6uWPWvjtXHamWPppuo34bSP/20170628_133615-800x800.jpg)](https://gateway.ipfs.a0z.ru/ipfs/QmNyqMxFLjYfUJ6DnqbUUm2qVy5Ef7hMeQ6r1VtpMFwgDR/20170628_133615.jpg)"
		},
		{
			"post_id": 22,
			"title": "Russian provincial motorcycles",
			"date_published": 1495290600.4,
			"body": "Once, almost 10 years ago, in 2007 my wife and I were at a scientific symposium that took place on a motor ship on the Volga River. Among other stops we briefly visited Makarev Monastery. Next to it was a small market where farmers sold fish, honey, mead, etc. And some of the goods were brought there on such a miracle motorcycle :)\n\n[![](http://gateway.ipfs.io/ipfs/QmZhe4bZZc6gWvLuvtrdLbVEg2FfTbCWXwhCnk3hWzTzhy/img_1381-800x.jpg)](http://gateway.ipfs.io/ipfs/QmRwPVUeE49yrYZeP92bpuGwh3jivtz7RC3P1GchMcahxw/img_1381.jpg)"
		},
		{
			"post_id": 21,
			"title": "Here is a fu..ng summer now :)",
			"date_published": 1494574091.4,
			"body": "A week ago it was +26°C (+79°F). But winter returned again. Although the snow was falling heavily for a couple of days, but yesterday was a real surrealism. Cherry tree blossomed. The surrounding area is bathed in its scent. And all this - under the snow! : D This is how I came back yesterday from the office. There's nothing else.\n\n[![](https://gateway.ipfs.io/ipfs/QmTU7NVkFNYcr6jpJRfWzzzcPUCCjNftFaymFQCLJ6aZaa/20170511_210730-800x.jpg)](https://gateway.ipfs.io/ipfs/QmVg7GKaxurMvxRRY1u8AUEsCgFcm9gyu6uocg4FURKsAW/20170511_210730.jpg)\n\nAnd now near the house ... As they say, more - more!\n\n---\n\n[![](https://gateway.ipfs.io/ipfs/QmbNNXozHcroCWoJKTJmkFgAUxJt78D5jR9khpzK5EQish/20170511_213459-800x.jpg)](https://gateway.ipfs.io/ipfs/QmSPVsC9DxVg9iR8AnenZ5gSvPBBrSbCL24YWfZ8Mg1EEH/20170511_213459.jpg)\n\n[![](https://gateway.ipfs.io/ipfs/QmS4R3Cib8MJ2X21t6moPXNE4cNpA1BzzBVeHVL6QjaUcA/20170511_213650-800x.jpg)](https://gateway.ipfs.io/ipfs/QmQqG6cbN5bToo5QP1HZHFpUen3M3ts9ZEAhJ6hcMKCKSW/20170511_213650.jpg)\n\n[![](https://gateway.ipfs.io/ipfs/QmU5aqUqBUcTUtgXfBaLN5pZAPSULaEe6FHtUJFWzrZK63/20170511_214247-800x.jpg)](https://gateway.ipfs.io/ipfs/QmWCJgZAtXdzq2Er46KP7qna2xFkeUvUDQtAn7tcNEM6mc/20170511_214247.jpg)"
		},
		{
			"post_id": 20,
			"title": "Military beauty",
			"date_published": 1492842443.834,
			"body": "I already [wrote earlier in the parallel russian blog](/1GQkPB8mFgxH7GQQbkNPJtvRaZZpVi65u1/?Post:11:%D0%A1%D0%BE%D1%86%D0%B8%D0%B0%D0%BB%D1%8C%D0%BD%D0%B0%D1%8F+%D1%81%D0%BF%D0%B5%D1%86%D0%B8%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F+p2p-%D1%81%D0%B5%D1%82%D0%B5%D0%B9) that they faced rejection of military equipment in the decentralized SSB Patchwork. The person then asks a question - \"Is it really beautiful\"? Well, my answer:\n\nHuman psychology is so arranged that we like it optimized. It does not matter in nature or technology. Therefore, we admire predators, for example, cats or dogs, despite the fact that they are murderers. We like birds, because they are extremely focused on the mission of the flight. And many people like military equipment, especially military aviation. Because this is a case of very strict optimization and calculation. It is beautiful.\n\n![Tu-160](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/data/img/post_42_Tu-160-Polyot-na-dozvukovoy-skorosti-s-ogibaniem-relefa-mestnosti-1280x.jpg)"
		},
		{
			"post_id": 19,
			"title": "Optical Illusion",
			"date_published": 1488940130.229,
			"body": "![](http://www.balancer.ru/sites/com/ga/gawkerassets/img/img/18dn2guzreneagif/original.gif)\n\nLook, without blinking, in the middle of the image for 20 seconds, and then look at someone's face or just a wall."
		},
		{
			"post_id": 18,
			"title": "About machine translation",
			"date_published": 1488907612.772,
			"body": "Google now began using neural networks for automatic translations into Russian. As far as I can judge, comparing the old and new versions of the translation, the phrases are now grammatically more correct. But now a lot of the original text is thrown out. Whole speech turns are lost."
		},
		{
			"post_id": 17,
			"title": "Winter. Winter leaves.",
			"date_published": 1487552268.806,
			"body": "Here some more little bricks of the Russian winter. Bricks. Ice bircks. :D These are ice blocks which janitors have brought down from the rooftop. And so — on all length of the house!\n[![](http://gateway.ipfs.io/ipfs/QmfWSa8GXwXt8TDVXiX8Q4CtMBWs8PNRPUYG7gzW2m8sso/20-0327-20170217_144423-800x.jpg)](http://gateway.ipfs.io/ipfs/Qmc7P62zhvLnX2oCG8Bi4H6mroVFU6MygHewYWGkofCEto/20-0327-20170217_144423.jpg)"
		},
		{
			"post_id": 16,
			"title": "The frost is a trifle :)",
			"date_published": 1483892160.619,
			"body": "In Moscow at -27 °C (-17 °F) there has taken place the bicycle parade :) Photos — here:\n\nhttp://translate.google.com/translate?js=n&sl=auto&tl=en&u=https://russian.rt.com/foto/348485-moskva-zimnii-veloparad-holod\n\n[![](http://gateway.ipfs.io/ipfs/QmUwqEroDtWijnygL9JZMyZrxGKQjC4pFKTybE3GAZGVmk/filemxC9gF-800x800.jpg)](http://gateway.ipfs.io/ipfs/QmRKFGFq9iZN9J6yRDG9NLmarBXV3aVM33e6DDg2vUeXSj/filemxC9gF.jpg)"
		},
		{
			"post_id": 15,
			"title": "Frosty selfie",
			"date_published": 1483865322.858,
			"body": "Our third day the temperature outside is -26 .. -30°C (-15..-22°F). Even for Moscow is cold :) Although there are many cities in Russia, where such a temperature - a common occurrence. But Moscow was used, the temperature rarely falls below -15 .. -20°C (+5 .. -5°F) :)\n\nYesterday I photographed frosty streets a little, but now in Russia New Year's days off come to an end and it is necessary to prepare for work. Therefore thoughtfully to describe photos it won't turn out. And I will put this question away for later :) For now, for a priming, my yesterday's selfie :D\n\n[![](http://gateway.ipfs.io/ipfs/QmebsvBbfEZiZ2dA9gKEx9EkwSZTMMHvvaAnDBFYYTtxYq/2017-0107-1239-03-800x800.jpg)](http://gateway.ipfs.io/ipfs/QmRHEPcDX9eQqfvWc5kgkCux9K7UTKaM1gC1RP4cHxPGZZ/2017-0107-1239-03.jpg)\n\n"
		},
		{
			"post_id": 14,
			"title": "Wise cat",
			"date_published": 1483557387.926,
			"body": "I don't know how in other countries, but in Russia on the Internet very much love cats  And therefore the following photo.\n\n[![](http://gateway.ipfs.io/ipfs/QmTnE5WXdvzRBrHK1WUT167WSknJdbRv6wkYPLKc5QXaWV/img_9348-wise-cat-800x.jpg)](http://gateway.ipfs.io/ipfs/QmfDS15uH5wPG1BryAsYPCzieQgSk99Q1LwaPzmxpoC3yP/img_9348-wise-cat.jpg)\n\nThe shot is taken in the village at my mother. Without any history, simply I saw a neighbour's tomcat and make photo. You look at expression of his muzzle  In Russia there is such fun saying — \"who got to know life, doesn't hurry anywhere\". This wise tomcat exact do it."
		},
		{
			"post_id": 13,
			"title": "Cheerful goat.",
			"date_published": 1483554559.477,
			"body": "[![](http://gateway.ipfs.io/ipfs/QmbM6GuiK6DAGnH4Q7rTqNa2iVghT6Ee14suV9eW7uJDZz/2016-0820-1552-img_8857-goat-800x800.jpg)](http://gateway.ipfs.io/ipfs/QmUsm71pGgwecvWkSa7wDRSRXL3vLmCU2jmM7jfcdUgM3q/2016-0820-1552-img_8857-goat.jpg)\n\nIt too from the village in the summer. Such goats were grazed in front of the mother's house :)\n\n"
		},
		{
			"post_id": 12,
			"title": "Bee at work",
			"date_published": 1483554126.801,
			"body": "A little macro photo. Bee at work :) This I photographed last summer in the village.\n\n[![](http://gateway.ipfs.io/ipfs/QmVxY45J4zriPSM2LpAftgBjwS4DsoGuR8S8gGLDvEnd4Y/2016-0820-1545-img_8829-800x800.jpg)](http://gateway.ipfs.io/ipfs/QmeZLpJ5A5UaaVw1bJ4hTmeSV4dYYSKy4TbgwUiFZYcyJN/2016-0820-1545-img_8829.jpg)\n"
		},
		{
			"post_id": 11,
			"title": "Last summer rooster...",
			"date_published": 1483554088.358,
			"body": "[![](http://gateway.ipfs.io/ipfs/QmQfYdrUnaAJV4ktfV4mKa6e5Q6VmSenn4JsfEk82bYXHf/2016-0820-1604-img_8886-rooster-800x800.jpg)](http://gateway.ipfs.io/ipfs/QmbK4BCrVm8q4fx6DR3hTiK6smqTBhWy5356Mqk9hTtJqe/2016-0820-1604-img_8886-rooster.jpg)\n\nSo another picture last summer. This is a simple rustic rooster. It was in honor of this year of the Rooster on the Chinese calendar :)\n"
		},
		{
			"post_id": 10,
			"title": "Ostankino, Moscow, night",
			"date_published": 1483464142.368,
			"body": "[![](http://gateway.ipfs.io/ipfs/QmSfZ9Dr3LuxGzFm7NwMYGS7LusKYnyv9nTfVJwfkobgWf/2016-1230-1821-20161230_182123-800x800.jpg)](http://gateway.ipfs.io/ipfs/QmRMpn2ahTuiESay2aNbTiTL43ZQbNrUNU2R4RCEntFrBv/2016-1230-1821-20161230_182123.jpg)\n\nBefore the New Year with my family, we went to the rink. Along the way, I took a picture of the [Ostankino tower](https://en.wikipedia.org/wiki/Ostankino_Tower) in the low clouds :)\n\nYou know, it's 1772-foot structure is not buried like anything special, but just standing, unfastened, posed on the platform? This is called \"free-standing structure\".\n"
		},
		{
			"post_id": 9,
			"title": "Russian women...",
			"date_published": 1482447086.583,
			"body": "I will continue a subject of dangerous Russian women :) Women in the uniform.\n\nOn a photo — the private of the air defense radio engineering battalion of the Smolensk region, Anastasia Markina.\n\n[![](http://gateway.ipfs.io/ipfs/QmaMvh4c6q6KZCbGZjCcnjDfbQtC3D5FCYtQsujqZXZRch/fileEGu0q7-800x.jpg)](http://gateway.ipfs.io/ipfs/QmdttE38oFpJxQWDcsMVXaiaykm8reXxpXTZx7CHwFeR5U/fileEGu0q7.jpg)\n"
		},
		{
			"post_id": 8,
			"title": "The Russians did it!",
			"date_published": 1482256512.436,
			"body": "![](http://gateway.ipfs.io/ipfs/QmYxvAufDfBfW7AGBMQHngALRkDtA7C5d7n9713apLMQcg/filedUnP5c.jpg)\n\n![](http://gateway.ipfs.io/ipfs/QmctFbbMBgheGWqDC61VLocJnKfH9c2JkWVzNEksPXZDx1/file31T12e.jpg)\n\n![](http://gateway.ipfs.io/ipfs/QmZvo1RRrj4nneXVtUvRZ8LLn99MMmfHoF8BjuQgtTbiyS/fileXW3ZZ2.jpg)\n\n![](http://gateway.ipfs.io/ipfs/Qmb6uwcsX4FzqFKCfQEE1C3ycAsytKQWq5e3BbC7Ho2XrX/fileyMvLEA.jpg)\n\n![](http://gateway.ipfs.io/ipfs/QmboervQtrjHbTfcwHbkrsmEnf19i24qGb6woj1ApPgMdn/fileB6bFPp.jpg)\n\n![](http://gateway.ipfs.io/ipfs/QmP4yqMzp567BNFn88P7S1jzhg2dYg7TS1axJM8KHdcExz/filewIv1UL.png)\n\n![](http://gateway.ipfs.io/ipfs/QmTLGE56Bt9Qf7Vwon11Z1anEna6ZCjaxdgGsU2ocPnmm4/fileUoBNKo.jpg)"
		},
		{
			"post_id": 7,
			"title": "Beware of the Russian women! :)",
			"date_published": 1482221227.401,
			"body": "Has cast to me by topic about Poklonskaya in one politics forum :)\n\nBe afraid of the Russian women!\n\nWorld champion in practical firing Alyona Karelina\n\n[![](http://gateway.ipfs.io/ipfs/QmdEdxWETqzztz4F2SYZeHxUWY9JsjmtQaAU3p7HVKtz98/filewxoDoy-800x800.jpg)](http://gateway.ipfs.io/ipfs/QmRyE6pAiymiePHiTFj2yxjidta715AbR1jGoB8dvLGpBK/filewxoDoy.jpg)"
		},
		{
			"post_id": 6,
			"title": "And some more winter photos from my archive :)",
			"date_published": 1482037263.391,
			"body": "Russian village. Once I go outside in the morning — and I see such pictures. It not snow, it dropped out hoarfrost (rime). Fantastic look...\n\n[![](http://gateway.ipfs.io/ipfs/QmdHECUgv9YBF7xeh66kM5AVNY6k4xH5RhyuNQCrjt8v5u/IMG_7865-800x.JPG)](http://gateway.ipfs.io/ipfs/QmT5HLxYWbc7jEi2JcBYnUSqL66pb7kCwEb2rHfQALxnaD/IMG_7865.JPG)\n\n[![](http://gateway.ipfs.io/ipfs/QmQi12FHgV5cLknKTEVBpbgtvi2adRVmX5cVSrB22RA81n/IMG_7846-800x.JPG)](http://gateway.ipfs.io/ipfs/QmWecW5BkXrppuAjMvpuncXfWo9g62rgMSnW3NWoE19FjW/IMG_7846.JPG)"
		},
		{
			"post_id": 5,
			"title": "Winter in Russia",
			"date_published": 1482035601.354,
			"body": "I wrote this for one Internet forum, but duplicates there can be someone interesting ...\n\n**Balancer** wrote:\n\n> > Here the photo of winter which at foreigners most often is associated with Russia :) Simply snowfall. Though strong, but habitual. Moscow. Spring (March, 25) of 2013 :)\n> > [![](https://lh4.googleusercontent.com/-jKmpjRmrev0/UVFqQP3FOOI/AAAAAAAANVQ/flQqW82bNVk/s800/20130325-1831-img_0786.jpg)](https://lh4.googleusercontent.com/-jKmpjRmrev0/UVFqQP3FOOI/AAAAAAAANVQ/flQqW82bNVk/s1280/20130325-1831-img_0786.jpg)\n\n**Steady Pie** wrote:\n\n> Holy (*)(*)(*)(*). Never seen a winter like that. Never seen snow.\n\nBy Russian standards, in Moscow, a temperate climate. The temperature rarely drops below -20 °C (-4 °F). And snow in many places, too, is much more :)\n\nFor example, winter in Norilsk (not my photo).\n\n![](http://gateway.ipfs.io/ipfs/QmU4S4fPxhvjdYARzKqw9GWZHWCu7hHGPg8GuuZUv5B17K/filesaIpd3.jpg)\n\n![](http://gateway.ipfs.io/ipfs/QmemXzrKnTN9JbWBrYrjdgtjbEwLrbrG7Ac34crEKDj7P9/filepyaXfm.jpg)\n\nThe thermometer -64 °C (-83 °F).\n\n![](http://gateway.ipfs.io/ipfs/QmZrPGUJgtnoDGDoC3iSciLeYquBR8vGRYX4bKJpoqQWK2/filena5G1Q.jpg)\n\nRussian woman in Norilsk :)\n\n![](http://gateway.ipfs.io/ipfs/QmSs13PF7QioK4nSExXFauuk42dm1bsv2oU4h6NMHXv9Dy/fileMrSgVk.jpeg)\n\n## See also\n\n- [Bathing in the ice hole](/17ogL1aD6546DYwtb6UnMhF4hETaHBj6yD/?Post:33:Bathing+in+the+ice-hole) — **NSFW!**"
		},
		{
			"post_id": 4,
			"title": "Moscow frost",
			"date_published": 1482031985.349,
			"body": "On Friday morning brought the daughter to school and the eye was fixed for such frosty patterns on bus-stop glass.\n\n[![](http://gateway.ipfs.io/ipfs/Qmc1ZpxghcU3SEVa8sWi8vkkqik1MS3LcPmbfUcCBuqhZw/20161216_074110~2-800x.jpg)](http://gateway.ipfs.io/ipfs/QmeomunGJ8XMuBp5CLBh2CyfFW5bBFRHDo2GntJ9CyPSiw/20161216_074110~2.jpg)\n\nTook away the daughter from school in the afternoon and has thought that how many I live in the area, but didn't photograph the Moscow monorail in frosts :) And it was the whole problem. At first trains of a monorail have bought in Switzerland, but there were problems with their use in frosts. It was necessary to do the, Russian trains later. Now, however, in 15 years of operation, rumors about possible closing of a monorail in favor of the tram go.\n\n[![](http://gateway.ipfs.io/ipfs/QmaGfJJL4G5YWc2tofGDfzzppB8Yof7RtK7izjmMuDjoTE/20161216_115507-1920x1080-800x.jpg)](http://gateway.ipfs.io/ipfs/QmbDzU1t6KaUKCUwkFUgp6wLbYVhNgqBEfB2PvXGnZ76kk/20161216_115507-1920x1080.jpg)"
		},
		{
			"post_id": 3,
			"title": "Information war methods",
			"date_published": 1481092960.684,
			"body": "**Matthewthf wrote**\n\n>My one issue with Russia on this matter was the bombing of the Hospitals in Aleppo.\n\nIn Syria, anti-Russian side constantly playing two scenarios of information warfare:\n\n1. ISIS or \"moderate opposition\" carries mortar shelling of civilian targets. The result is shown as the Russian aviation strike. For a special effect, you can throw fragments of Russian bombs collected elsewhere. Example - the shelling of humanitarian convoys.\n\n[![](http://gateway.ipfs.io/ipfs/QmVALn95XAsvx96xCWE7uEWWJTB7YyaYoSd38yyx4jeN6o/file4Qmh7c-800x.jpg)](http://gateway.ipfs.io/ipfs/QmW6czVT4FkPy9EyuyhnXDgdnuT2qKdLqoCrrxbHjzTvHw/file4Qmh7c.jpg)\n\n2. The Russian aviation strikes at the real object. This object is then displayed as a school or hospital. While it may be nowadays conventional military target of terrorists. Example - a school in liberated Aleppo, which has deployed a chemical factory of ISIS.\n\n<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/EOaHW3BcI1c\" frameborder=\"0\" allowfullscreen></iframe>\n\nHowever, there is even more direct deception. As for the result of Russian bombardments issued the old photographs of the destroyed Lebanon, Iraq, etc.\n\n![](https://pbs.twimg.com/media/Cy6wPjiXcAEqjPs.jpg:large)\n\n![](https://pbs.twimg.com/media/Cy6wUtoWgAAC5UU.jpg:large)\n\nYou can also do staged photos or video about the atrocities in Russia or Assad's:\n\n![](http://sites.wrk.ru/sites/su/ip/ipb/uploads/ipbsu/waroffline/post-259-1478529650.jpg)\n\n<iframe width=\"640\" height=\"360\" src=\"https://www.youtube.com/embed/b8bIupYSZeU\" frameborder=\"0\" allowfullscreen></iframe>\n"
		},
		{
			"post_id": 2,
			"title": "Moscow in snow",
			"date_published": 1480351814.068,
			"body": "**Thunderhawk** wrote:\n> -Snow.\n> Im Canadian, a couple others are from Quebec and snowier parts of Canada. There is also an Alaskan on the forum. Your snow pictures are nothing special to us :p\n\nCanada in general is very similar to Russia :) And even say that people on character are very similar (at me the friend has lived in Canada 7 years, has returned to Russia 4 years ago). But the USA (excepting Alaska, of course :)) has the most northern areas to the south of the most southern Russian :)\n\n...\n\nWell and to dilute a discussion with photos :) Moscow today, photographed in the evening on the way to work.\n\n[![](http://gateway.ipfs.io/ipfs/QmTjxSJtHoEpxCqrhPBUAy5hT9m3RcCgyaRpdW1Z5RyrVa/20161128_160335-800x.jpg)](http://gateway.ipfs.io/ipfs/QmQtNffEzZ4r7RpfVtvFbp7uMBTPKhudA9m1GeLCNRCdSU/20161128_160335.jpg)\n\n[![](https://gateway.ipfs.io/ipfs/QmbfDSDZpLUuziQTw5kJQYRbDXRToqncnvJVZsheUkNSuF/20161128_163016-800x.jpg)](http://gateway.ipfs.io/ipfs/QmZ6PaFKnnYUF239LHNe9v87hJh6Ar76vBFtt2fJT8LMPk/20161128_163016.jpg)\n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}