{
	"title": "Gullickson Laboratories",
	"description": "The canonical source of Jason Gullicksonism",
	"links": "*   [Github](https://github.com/jjg)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1486244511,
	"post": [
		{
			"post_id": 5,
			"title": "ZeroPhone",
			"date_published": 1486243425.551,
			"body": "ZeroPhone is a project I started shortly after I discovered ZeroNet.  It's a continuation of a long line of \"phone\" projects I've had that have less to do with telephones per-se and more to do with personal, portable computing devices (which we currently happen to refer to as phones).\n\nOne of the reasons I was excited to find out about ZeroNet is because it has a lot in common with one of my previous 'phone projects, \"BitPhone\".  In a nutshell, it was a phone-like device built on blockchain and DHT tech, using mobile data networks but with no dependency on central service providers, etc.  Additionally, the \"SDK\" was HTML+Javascript very similar to how ZeroNet works.  I set BitPhone aside when, through another project became somewhat frustrated with blockchain-oriented systems (more so the culture than the technology).\n\nAdditionally, I had a really hard time convincing anyone that building such a device with such an architecture was the way to go, and I had a hard time getting anyone else interested in working on it.\n\nSo when I came across ZeroNet, it was a validation of the concept and I immediately started noodling on how I could put it to work to realize something like the BitPhone project, hence ZeroPhone was born.\n\nSo far this has amounted to finding suitable embeddable hardware that is capable of running ZeroNet.  Since I'm still learning about the system I wasn't sure how hefty the hardware requirements would be, so I started at the bottom of the parts bin, which happened to be [Next Thing Co](https://nextthing.co/)'s \"[CHIP](https://nextthing.co/pages/chip)\".  I was pleasantly surprised to find that, with the addition of a little USB flash storage, it ran the ZeroNet \"server\" software without much trouble. \n\nAside from the cost ($9USD), one of the best things about the CHIP is that it's Open Source Hardware, and the company goes to considerable effort to make it easy for designers to incorporate the CHIP in custom designs.  This makes it a lot safer to design the CHIP into a product vs. something like a Raspberry Pi which has more complex licensing and incomplete documentation.\n\nOf course this doesn't address any form of user interface, etc. but I have some unusual ideas for interacting with ZeroPhone than the typical touchscreen interface.  That said, it would be fairly straightforward to connect a LCD touchscreen to the CHIP and turn it into a \"normal\" phone-like device that's \"powered\" by ZeroNet. \n\nToday I designed a simple printable case for the hardware so I'm less likely to damage it while carrying it around.  I'll be evolving the design as I add more components and interfaces to the system.  Design files can be found on [github](https://github.com/jjg/zerophone)."
		},
		{
			"post_id": 4,
			"title": "Mastery",
			"date_published": 1485959462.725,
			"body": "Yesterday I watched [Jiro Dreams of Sushi](https://en.wikipedia.org/wiki/Jiro_Dreams_of_Sushi) and it made me wonder what it must be like to master a skill.\n\nIn the film, Jiro talks about absolute dedication to mastery of one's occupation, doing the same thing every day, but improving.  It's hard for me to imagine what that must be like because my interests are so varied and the scope of the things I like to work on and do for recreation is vast.  Because of this, I've never achieved a level of skill that I would consider close to \"mastery\".\n\nHowever, if you watch the film closely you notice that Jiro's work isn't as narrow as it seems at first.  There is a lot more going on in every interaction with his staff, his customers and his suppliers.  Even though Jiro is a master chef and his sushi is considered the best, it's clear that he's achieved this by cultivating the right conditions around him, and his results are a product of the concentrated effort of everyone involved.\n\nWhen I look at my work in a more holistic way, there are larger themes at work which could be considered my overall vocation, and in that way I have been pursuing mastery at this skill every day.  To put it another way, you cannot be a master at all the skills that make up your work, but perhaps you can master the work itself, even if that work lacks contemporaries to be compared to?"
		},
		{
			"post_id": 3,
			"title": "Back on the air",
			"date_published": 1485880646.45,
			"body": "Once again, I'm starting a new blog on a new platform. I suppose its not really a new *blog* but a continuation of the one I started before blog was a word. In any event, this is the latest generation and I think it's a major improvement over the systems of the past.\n\nThis blog is running on [ZeroNet](https://zeronet.io/). If you're reading it, you probably know what ZeroNet is, but soon I'll make it possible for non-ZeroNet users to access the content as well. \n\nWhy is this necessary? Because one of the projects I'm working on is making easier to get started with ZeroNet. There are many advantages to the ZeroNet system, but some of them are not obvious to everyone and it works a little differently from what we're used to. That's a good thing, because the differences address limitations and vulnerabilities in the \"classic web\".\n\nSo as always I'll use this blog to share project updates, cool things and random thoughts, but I'll also be focused on providing content that will be useful to people getting started with ZeroNet. I'm trying to start this fast because I'm still learning my way around as well, and I want to capture that \"white belt\" experience."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}