{
	"next_comment_id": 35,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/data/users/15o4nvojFiWaXPWHGBk7WmXDS3p8bVD9AS/5fe7c8ee6999aeb9d1b3b524cdc0af8b.jpg\n\nСайт не открывается.",
			"post_id": 5,
			"date_added": 1522714195
		},
		{
			"comment_id": 2,
			"body": "> [balancer73](#comment_1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): http://127.0.0.1:43110/Me.Mkg20001.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1513511944\n\nБлагодарю.\n\nЕсли я правильно понял, с последними фиксами достаточно добавить просто `page.cmd(\"corsPermission\", [\"1MyZeroUpClone\"]);`",
			"post_id": 3,
			"date_added": 1522714296
		},
		{
			"comment_id": 3,
			"body": "> [anotherneko](#comment_2_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Похоже что-то пошло не так. Надо будет разобраться.\n\nВозможно, data/users/content.json не подписан. У меня было что-то похожее, когда подпись не поставил.",
			"post_id": 5,
			"date_added": 1522720259
		},
		{
			"comment_id": 4,
			"body": "> [calmaquesse](#comment_3_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): В Git-center на локальной машине кэшируются все проекты, или только те, которые скачаны?\n\nКоторые скачаны.",
			"post_id": 13,
			"date_added": 1525450332
		},
		{
			"comment_id": 5,
			"body": "> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Но вообще не понял, нафига его придумали :) Ну, разве что как попытка отказаться от фигурных скобок в пользу питоновских отступов. Выглядит отвратительно,\n\n+1\n\nЯзыки с significant whitespace — это какая-то диверсия против человечества.\n\n> Мне показалось, что он впитал в себя недостатки JS, Python и Ruby :D\n\nОт Руби я пока заметил только @-нотацию и постпозитивный if.",
			"post_id": 11,
			"date_added": 1525515223
		},
		{
			"comment_id": 6,
			"body": "> [gitcenter](#comment_1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Вы изобрели BASIC :) Но возможность полезная, согласен.\n\nКогда я на BASIC-ке часто писал, там еще было `GOTO` со всех сторон. :)\nТочно, ведь `end if`-ы потом появились, помню их из макросов на VBA. Имхо, совершенно разумное решение.",
			"post_id": 16,
			"date_added": 1525588472
		},
		{
			"comment_id": 7,
			"body": "> [deepstrelok](#comment_2_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): А плюсы coffee имеет вообще?\n\nНу навскидку, он самостоятельно решает JS-овую проблему `var that = this;`. ",
			"post_id": 15,
			"date_added": 1525590469
		},
		{
			"comment_id": 8,
			"body": "> [deepstrelok](#comment_1_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Можно же использовать emacs с модом для python(или прочих) или иные ide, где вся вложенность видна легко.\n\nВсё-таки мне кажется, в дизайн языка не должно быть заложено, что для правки кода требуется специальный редактор.\n\nХорошо, когда язык позволяет писать лаконично, но плохо, когда он не позволяет писать максимально многословно, с максимальным недоверием к себе. Во многих языках заметно это стремление автора: либо сделать всё лаконично, либо наоборот, сделать всё максимально «по-армейски». Существует ли золотая середина?\n\nНапример, в Питоне автор решил экономить на блоках, в Руби автор решил экономить строчки за счёт многоярусных замыканий: `.select{|foo| блабла}.map {|bar| блаблабла}.inject(хрен){|вам, понять| что тут написано}`\n\nОбе фичи достаточно удобные, но они не универсальные. Но если Руби не принуждает лепить весь код в нечитабельную массу, можно писать и многословнее, то в Питоне лаконичные отступы — одна из ключевых фич языка.\n\nЯ за гибкость в выборе уровня лаконичности самим разработчиком. Условно говоря, чтобы на языке можно было переключаться с питон-стиля на ada-стиль, в зависимости от правил оформления, принятых в проекте. Таких мейнстримных языков нет, к сожалению.\n\n> Все-таки мы люди, а не компиляторы.\n\nПри чтении незнакомого кода мы еще и компиляторы, аналоговые и ненадёжные. :)",
			"post_id": 16,
			"date_added": 1525598024
		},
		{
			"comment_id": 9,
			"body": "> [gitcenter](#comment_2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ZeroNet не знает, существует ли файл, так как он может быть опциональным, не скачаться, content.json может быть старым и т.д.\n\ncontent.json может быть старым, но пока он не обновился, он и есть истина. Понятно, с одной стороны, этот *File update failed* показывает, что «может быть, после обновления файлы найдутся».\n\nВ другой, если где-то остались битые ссылки, пользователь всё время будет видеть этот индикатор сбоя — то есть с точки зрения пользователя «сбоит индикатор сбоя».",
			"post_id": 17,
			"date_added": 1525625195
		},
		{
			"comment_id": 10,
			"body": "> [balancer73](#comment_4_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Поэтому Perl (и во много — Ruby) — write-only языки :) Впрочем, как и Java и JavaScript — с другой. Там перекос в другую сторону.\n\nЛюбопытно, что именно в Ruby даёт write-only эффект, на твой взгляд.\n\nПо моему мнению, таких вещей три:\n\n1. [Perl-like special variables](http://ruby.wikia.com/wiki/Special_variable). Вроде как, в современном коде почти не используются.\n\n2. Злоупотребление последовательностями коллбеков при обработке enumerable данных. Язык прямо таки подталкивает зафигачить последовательности .map{}-ов, .reduce{}-ов и прочих .select{}-ов, типа, мы тут в функциональном стиле пишем чуть ли всю программу. Потом такой код практически невозможно читать. На JS можно писать в том же стиле, но обычно что-то останавливает (то ли здравый смысл , то ли длина ключевых слов `function` и `return`), а на Ruby — нет.\n\n3. Постпозитивные управляющие инструкции. Сначала хочется писать лаконичном стиле всякие `return if` и `next unless`, а потом обнаруживаешь, что для понимания кода приходится читать каждую строку с середины.\n\nЕсли всем этим не злоупотреблять, язык хорошо читабелен.",
			"post_id": 18,
			"date_added": 1525940571
		},
		{
			"comment_id": 11,
			"body": "> [gitcenter](#comment_3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А в JavaScript одна стрелочка => xD\n\n`=>` в кофе тоже есть, семантика разная. `=>` связывает this лексически, а `->` нет.\n\nКогда я активно кодил на JS, коротких лямбд там не было. Зато в то же время я кодил и на Ruby, и вот после Ruby жаваскрипт был реально боль.",
			"post_id": 18,
			"date_added": 1525967849
		},
		{
			"comment_id": 12,
			"body": "> [gitcenter](#comment_4_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Пытался когда-то что-то делать на Ruby, мозг сломал от обилия спецсимволов.\n\nПопробовал сообразить, какие там есть спецсимволы, которых нет в JS. Вспомнил только $ и @ для доступа к глобальным переменным и к членам класса.\n\nНаверное, это были [эти спецсимволы](http://ruby.wikia.com/wiki/Special_variable)? ",
			"post_id": 18,
			"date_added": 1525972257
		},
		{
			"comment_id": 13,
			"body": "> [balancer73](#comment_8_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Вот на чём пишу и что иногда вводит в состояние изумления в плохом смысле слова — это Lua :D Вот тут немного концентрата на русском — http://ndtimofeev.github.io/ru/posts/2014-06-18-about-lua.html\n\nОооо, я мечтаю, что кто-то подымет знамя luajit и сделает таки язык который:\n\n1. Как и luajit, до сих пор рвёт виртуальные машины JS на тестах.\n\n2. Имеет адекватную семантику, а не вот это вот, на чем мы пишем.",
			"post_id": 18,
			"date_added": 1526017155
		},
		{
			"comment_id": 14,
			"body": "> [balancer73](#comment_10_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Форт тут оказался просто незаменим. Ну а потом он много где в том проекте в качестве скриптового использовался, удобным инструментом оказался.\n\nФорт интересный инструмент. Теоретически, можно отдельные специализированные \"языки\", образуемые форт-библиотеками, реализовать как высокопроизводительную VM и получить прозрачный переход от максимальной гибкости настоящего Форта к максимальной скорости отдельного подмножества. Примерно как сделан переход от JS к asm.js - если реализация не умеет оптимизировать это подмножество, она просто исполняет его как есть.\n\nЯ пытался что-то подобное сделать с Io, но не осилил допилить даже прототип. Io требует глубокого анализа семантики программы.на уровне jit-компилятора. ",
			"post_id": 18,
			"date_added": 1526131193
		},
		{
			"comment_id": 15,
			"body": "> [balancer73](#comment_11_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Есть такое замечательное расширение: The Great Suspender\n\nАга, у меня уже стоит расширение **«Tab Suspender»**, правда, падать часто стало почему-то. (наверное, на несколько сотен страниц оно не рассчитано.)\n\nЭто даже с ним память кончается.",
			"post_id": 20,
			"date_added": 1526881217
		},
		{
			"comment_id": 16,
			"body": "> [strelok](#comment_1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Очевидный T430.\n\nХорошая машинка. Рассматриваю такой вариант, купить б.у. Цинкпад с неубитым корпусом, совместимый по платформе с моим Самсунгом и из двух буков собрать один нормальный.",
			"post_id": 21,
			"date_added": 1527138513
		},
		{
			"comment_id": 17,
			"body": "> [dorysan](#comment_1_1MHe9EDywJ7mrA52BikRPmbwQtQs1xNGEW): Нормальная практика для Windows.\n\nДа уж. Не знаю, что теперь делать. Фикса пока не нагуглил.\n\n1. Сделать восстановление до заводской винды, апдейт не накатывать, пользоваться дальше без апдейтов.\n2. Сделать восстановление до заводской винды, апдейт не накатывать, попытаться продать.\n3. Накатить линукс.\n\nБыл бы это мой бук, однозначно третий вариант. Но жена против.",
			"post_id": 23,
			"date_added": 1527232711
		},
		{
			"comment_id": 18,
			"body": "> [deepstrelok](#comment_4_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Я люблю подключаться к vps(и другим локальным серверам) через hidden service с проброшенным ssh. Медленно, но безопасно.\n\nУ меня мелкнула такая мысль, но потом я подумал, что это надо разбираться долго, а tinc настраивать я уже умею, + мне еще работать надо на том хосте, а не маны читать. :)",
			"post_id": 26,
			"date_added": 1528034355
		},
		{
			"comment_id": 19,
			"body": "> [deepstrelok](#comment_4_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): и другим локальным серверам\n\nКстати, у меня в локалке кинут tinc поверх wifi. Но не до конца всё настроено как надо, к сожалению лень пока не даёт ходу паранойе.\n\n",
			"post_id": 26,
			"date_added": 1528034481
		},
		{
			"comment_id": 20,
			"body": "> [anotherneko](#comment_5_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Лечится переключением контроллера в AHCI.\n\nНе помогало, что странно.",
			"post_id": 27,
			"date_added": 1528285550
		},
		{
			"comment_id": 21,
			"body": "> [deepstrelok](#comment_5_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Какой линукс то поставил?\n\nАрч перенёс. Кстати, наткнулся на грабли, что tar->untar делает результат не совсем идентичный исходному. (Или я не все нужные опции указал.) Пакет iputils пришлось переустановить, чтобы ping заработал не от рута.",
			"post_id": 27,
			"date_added": 1528369070
		},
		{
			"comment_id": 22,
			"body": "> [deepstrelok](#comment_6_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): По моему он скрытые файлы может не переносить по умолчанию.\n\n[Флаг, устанавливаемый через setcap](https://git.archlinux.org/svntogit/packages.git/tree/trunk/iputils.install?h=packages/iputils), не скопировался. Хотя я указывал `--xattrs`.\n\nНе уверен, как именно это работает, но при переносе rsync-ом, таких проблем не возникало.",
			"post_id": 27,
			"date_added": 1528378349
		},
		{
			"comment_id": 23,
			"body": "> [balancer73](#comment_12_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Сабж что, анонимен?\n\nНет, потому и аналог торрента.",
			"post_id": 30,
			"date_added": 1535558735
		},
		{
			"comment_id": 24,
			"body": "> [balancer73](#comment_12_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Сабж что, анонимен?\n\nВообще я сегодня наверное плохо мысли выражаю, сижу с температурой. Я тут в сообщении из 4-х предложений на английском сделал 5 опечаток, так что решил, код писать сегодня точно не стоит. :)",
			"post_id": 30,
			"date_added": 1535558882
		},
		{
			"comment_id": 25,
			"body": "> [balancer73](#comment_15_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n\nСамое для меня удивительное, что нельзя получить доступ к устройству, зная пароль от учётной записи Google. В случае потери телефона можно даже удалённо стереть с него все данные, а вот имея в руках телефон, никак не сбросить локальный пароль. Ну у Google всегда своя особенная логика, непонятная простым смертным.\n\nКстати, сам телефон грозится, что после вайпа он потребует для разблокировки пароль от учётной записи Google, но эта функция не реализована. Грабь-френдли модель. ",
			"post_id": 34,
			"date_added": 1539241044
		},
		{
			"comment_id": 26,
			"body": "> [x86128](#comment_10_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): А после установки соединения пролагов нет? Как там mc быстро перерисовывается?\n\nНа тот момент не было, а вот в последнее время замечаю лаги. mc и htop подлагивают.",
			"post_id": 26,
			"date_added": 1539436527
		},
		{
			"comment_id": 27,
			"body": "> [x86128](#comment_8_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): (то есть переносить вредные привычки из классического JS в современный).\n\nЭто надо сесть и переписать кучу кода на современный JS, а мне лень. Там по историческим причинам все на Coffee 1-й версии, даже не 2-й. Ну и потом еще пару движков хочу поковырять, тоже на Coffee.\n\nВ оригинале всё это было лесенкой, потому что весь движок вырос из демки без рефакторинга.\n",
			"post_id": 31,
			"date_added": 1539436723
		},
		{
			"comment_id": 28,
			"body": "> а фряха в EXT умеет лет двадцать.\n\nhttps://www.freebsd.org/releases/12.0R/relnotes.html#kernel-config\n\nНо монтировать основные тома с данными в rw я всё равно не рискну.",
			"post_id": 40,
			"date_added": 1556680689
		},
		{
			"comment_id": 29,
			"body": "> [slevinnikrum](#comment_1_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp): сори,переведи!?\n\nПишут, что стабильная и готовая к использованию. %)",
			"post_id": 43,
			"date_added": 1556771850
		},
		{
			"comment_id": 30,
			"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Если бы это ещё не был кофий..\n\nКуда деваться...",
			"post_id": 45,
			"date_added": 1561431441
		},
		{
			"comment_id": 31,
			"body": "Добавил больше ссылок в пост.",
			"post_id": 9,
			"date_added": 1585806648
		},
		{
			"comment_id": 32,
			"body": "> [gitcenter](#comment_6_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Я вас поздравляю -- вы изобрели git. Там даже абсолютно такая же delta-encoding.\n\nСтатью не читай, сразу отвечай...\n",
			"post_id": 35,
			"date_added": 1603722013
		},
		{
			"comment_id": 33,
			"body": "> [gitcenter](#comment_7_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): По сути -- эта система прекрасно ложится на Git. Если ее реализовывать, то взять за основу его же будет логичным шагом.\n\nВ гит есть постоянная история, а в сабже нет.\nВ гит коммиты всегда имеют родителя, а в сабже нет.\nВ гит в рамках ветки один объект имеет линейную  историю, а в сабже нет.\nИ т.п\n\nОчень разные вещи.",
			"post_id": 35,
			"date_added": 1603774545
		},
		{
			"comment_id": 34,
			"body": "> [gitcenter](#comment_8_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): А это как? У вас каждый коммит ссылается на родителя, a la blockchain. Или вы про то, что старую историю можно удалять?\n\nВ тексте выше всё написано же.\n\n1. Невозможно гарантировать сохранность истории, поэтому нет смысла её сохранять. История приводится лишь для справки \"кто следом за кем писал\".\n2. Пользователь совершенно точно будет удалять старые или неудачные коммиты, чтобы освободить место. Поэтому надо хранить его коммиты максимально сжато, чтобы ему реже приходилось отвлекаться на нехватку места. Хранение дельт решает эту узкую задачу, а не задачу истории.\n3. Дельты в истории (той, которая \"для справки\") вычисляются на лету, а не хранятся. Это другие дельты.",
			"post_id": 35,
			"date_added": 1603793899
		}
	],
	"comment_vote": {},
	"post_vote": {}
}