{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "Naja, ich glaube hier wird ein bisschen zu tief reininterpretiert. Grundsätzlich verstehe ich die Anklage in diesem Artikel, aber es gibt auch \"Jugendwörter des Jahres\", die schon viel deutlicher und offensichtlicher ganz und gar nicht dem Sprachgebrauch der Jugendlichen entspricht. So ähnlich ist es doch auch mit den \"Unworten des Jahres\" oder ähnlichen Sachen. Wen interessiert es, ob da irgendein Wort zum \"Unwort des Jahres\" gekürt wird? (Ist außerdem auch nur 'Unwort' eines Jahres und nicht für immer.)\n\nWenn man sich thematisch Richtung Massenmanipulation bewegen möchte, dann gibt es dafür viel wirkungsvollere Werkzeuge, die *eindeutig* dafür verwendet werden. Während irgendein auf das Jahr begrenzte \"Unwort\" keine wirklich große Wirkung erzielt, denke ich.\nJedoch, wie gesagt, grundsätzlich kann ich die Beschwerde verstehen.",
			"post_id": 12,
			"date_added": 1493256961
		},
		{
			"comment_id": 2,
			"body": "> [pericles](#comment_1_17DMySjxJenr5B12nQnPS3CyvPh3CdYWXf): muss man dafür keine Medaille vergeben oder ein Siegel draufkleben… \n\nIch verstehe das alles auch und stimme zu, aber mal andersherum betrachtet: sollen wir jetzt dagegen stehen und versuchen, es denen zu verbieten? Oder daran arbeiten, dass sie sonst daran verhindert werden, eine schwachsinnige Medaille zu vergeben? Ich meine, ich kann auch nicht einfach zu jedem Raucher auf der Straße laufen und dem die Zigarette von den Lippen schlagen, weil das alle Leute in der Umgebung verpestet und grundsätzlich unmoralisch und ungesund ist.\nWürde ich mir wünschen, es gäbe keine Raucher? Ja. Würde ich Rauchen komplett verbieten, wenn ich das Sagen hätte? Nein. Der \"Durchschnitt\" der Menschen wird immer dumm bleiben. Und wenn irgendwelche \"selbsternannten 'Sprachhüter'\" meinen, sie müssten Pokale für angebliche Unwörter verteilen, dann sollen die es von mir aus machen.\n\nWas ich mit all dem sagen will, ich stimme Dir zu, aber sollte man auch was dagegen unternehmen?\n\nZudem: wenn Du ein bekanntes Buch schreibst, das beschreibt, wie dumm das Wort \"Blaupause\" ist, wer entscheidet dann, ob er es noch benutzt oder nicht? Das machen doch fast alle Menschen hier selbst. Nur weil einer oder wenige Personen Stuss erzählen, muss dem ja nicht jeder folgen. Und wer trotzdem folgt, hat sich selbst dazu entschieden.",
			"post_id": 12,
			"date_added": 1493301351
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"12": 1
	}
}