{"cert_user_id": "libingChina@github", "next_topic_id": 2, "topic": [{"topic_id": 1604067515, "title": "About ZeroNet's future in China", "body": "It is recommended to add information filtering, or content review mechanism (which can't be used for content classification, politics, resources, news, etc.). Now it is almost all political content, which seriously affects the user experience. These contents will make me spontaneously resist these users. This software, while the application of p2p lies in how much the user decides to prosper, I hope the community will prosper.\r\n\r\nThe use of this software is to find some limited resources, but also think about using recommended friends, but found that most of them are political content, I dare not recommend, and even begin to resist\r\n\r\nPlease don't involve politics, otherwise he will be abandoned by politics. This has nothing to do with technology, and technology is not guilty.\r\n\r\nPlease understand by Google Translate\r\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1568766518, "modified": 1568937036, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2201", "source_type": "github"}], "next_comment_id": 4, "comment": {"1604067515_mirrored_libingChina_github": [{"comment_id": 1, "body": "> 不包含政治内容就不会被禁了吗？虽然说我也讨厌轮子，但这不是重点。\r\n\r\n包含政治内容,我看到他们那些标题(暂且不论真假),看着就劝退我,如果不包含我想我用得应该还算开心的,毕竟有一堵墙在,都会偶尔翻墙出来看看,但是当你不想看时就算隔层纸也是隔离.", "added": 1568784850, "modified": 1568784850, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2201#issuecomment-532581497", "source_type": "github"}, {"comment_id": 2, "body": "> As for the issue you're talking about, I don't really get your point. The goal of ZeroNet is to provide a way to communicate without restrictions. ZeroNet isn't a project for developers or sole techy people - it's for everybody. People come to ZeroNet because they want real free speech, and politics is one of the topics that's literally impossible to discuss on clearnet, so no wonder there's more politics here.\r\n\r\n我建议添加严格的网站过滤审核机制,现在一打开网站,进去就好多的政治内容(大部分内容很扯淡),我可以用tor浏览器访问一些不合法的网站,获取一些限制的资源,也可以在ZeroNet进行一样的操作,但是ZeroNet上大部分是政治内容,我很反感这些,我想大多普通用户也反感这些,这个很影响用户之间的推广,劝退我们这些用户.\r\n\r\n上面的建议有点违背了ZeroNet的初衷(自由发言),为此我想了另一条建议,\r\n严格的网站信息分类,用户按照分类有选择接收一些需要的信息,\r\n用户有发言的自由,同样用户应该有收听的自由,(现在提供的拉黑机制不是很适应)我不能一直打开然后拉黑,我没有这个精力去操作,我想也没有用户有这个精力,当垃圾信息过多的时候,我想大部分用户会放弃的.\r\n\r\n我们都希望享受自由,但我们同样不希望淹没在垃圾的海洋.我们中国有句古话\"国有国法，行有行规,无规矩不成方圆\",我只希望ZeroNet能建立自己的规范\r\n\r\n以上建议只是个人一点想法建议,存在很多不足,希望给你带来一些参考.\r\n\r\nI suggest adding a strict website filtering review mechanism. Now when I open the website, I have a lot of political content (most of the content is nonsense). I can use the tor browser to access some illegal websites and get some restricted resources. The same operation is done in ZeroNet, but most of the content on ZeroNet is political content. I am very disgusted with this. I think most ordinary users also dislike these. This affects the promotion between users and dismisses us.\r\n\r\nThe above suggestions are a bit contrary to the original intention of ZeroNet (free speech), for which I thought of another suggestion.\r\nStrict classification of website information, users have the option to receive some required information according to the classification.\r\nThe user has the freedom to speak, and the same user should have the freedom to listen. (The black-black mechanism provided is not very suitable.) I can't open it all the time and pull it black. I don't have the energy to operate. I don't think the user has this energy. When there is too much spam, I think most users will give up.\r\n\r\nWe all want to enjoy freedom, but we also don't want to be submerged in the sea of ​​rubbish. We have an old saying in China that \"a country has its state laws, a family has its family rules, and a trade also needs its own rules.\", I only hope that ZeroNet can establish its own norms.\r\n\r\nThe above suggestions are just a few personal suggestions, there are many shortcomings, I hope to bring you some reference.", "added": 1568848272, "modified": 1568848272, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2201#issuecomment-532935120", "source_type": "github"}, {"comment_id": 3, "body": "> 幼稚。你认为Nofish会接受吗？我以前提过很多建议，有几个采纳的？ 所以说我建立了IPZN项目。 From blurHY\r\n> […](#)\r\n> ________________________________ 发件人: libingChina <notifications@github.com> 发送时间: Thursday, September 19, 2019 10:11:51 AM 收件人: HelloZeroNet/ZeroNet <ZeroNet@noreply.github.com> 抄送: blurHY <blurhy@outlook.com>; Comment <comment@noreply.github.com> 主题: Re: [HelloZeroNet/ZeroNet] About ZeroNet's future in China (#2201) As for the issue you're talking about, I don't really get your point. The goal of ZeroNet is to provide a way to communicate without restrictions. ZeroNet isn't a project for developers or sole techy people - it's for everybody. People come to ZeroNet because they want real free speech, and politics is one of the topics that's literally impossible to discuss on clearnet, so no wonder there's more politics here. 我建议添加严格的网站过滤审核机制,现在一打开网站,进去就好多的政治内容(大部分内容很扯淡),我可以用tor浏览器访问一些不合法的网站,获取一些限制的资源,也可以在ZeroNet进行一样的操作,但是ZeroNet上大部分是政治内容,我很反感这些,我想大多普通用户也反感这些,这个很影响用户之间的推广,劝退我们这些用户. 上面的建议有点违背了ZeroNet的初衷(自由发言),为此我想了另一条建议, 严格的网站信息分类,用户按照分类有选择接收一些需要的信息, 用户有发言的自由,同样用户应该有收听的自由,(现在提供的拉黑机制不是很适应)我不能一直打开然后拉黑,我没有这个精力去操作,我想也没有用户有这个精力,当垃圾信息过多的时候,我想大部分用户会放弃的. 我们都希望享受自由,但我们同样不希望淹没在垃圾的海洋.我们中国有句古话\"国有国法，行有行规,无规矩不成方圆\",我只希望ZeroNet能建立自己的规范 以上建议只是个人一点想法建议,存在很多不足,希望给你带来一些参考. I suggest adding a strict website filtering review mechanism. Now when I open the website, I have a lot of political content (most of the content is nonsense). I can use the tor browser to access some illegal websites and get some restricted resources. The same operation is done in ZeroNet, but most of the content on ZeroNet is political content. I am very disgusted with this. I think most ordinary users also dislike these. This affects the promotion between users and dismisses us. The above suggestions are a bit contrary to the original intention of ZeroNet (free speech), for which I thought of another suggestion. Strict classification of website information, users have the option to receive some required information according to the classification. The user has the freedom to speak, and the same user should have the freedom to listen. (The black-black mechanism provided is not very suitable.) I can't open it all the time and pull it black. I don't have the energy to operate. I don't think the user has this energy. When there is too much spam, I think most users will give up. We all want to enjoy freedom, but we also don't want to be submerged in the sea of ​​rubbish. We have an old saying in China that \"a country has its state laws, a family has its family rules, and a trade also needs its own rules.\", I only hope that ZeroNet can establish its own norms. The above suggestions are just a few personal suggestions, there are many shortcomings, I hope to bring you some reference. — You are receiving this because you commented. Reply to this email directly, view it on GitHub<#2201?email_source=notifications&email_token=AH5CPRGO55MHFIHFB27NIXTQKLNWPA5CNFSM4IXYSU52YY3PNVWWK3TUL52HS4DFVREXG43VMVBW63LNMVXHJKTDN5WW2ZLOORPWSZGOD7B7DUA#issuecomment-532935120>, or mute the thread<https://github.com/notifications/unsubscribe-auth/AH5CPRBRSRPGLRVWPS4ZDB3QKLNWPANCNFSM4IXYSU5Q>.\r\n\r\n意见已经提交了,结果如何和我没有太大关系了,我只是认为这么好的项目不应该就此慢慢凋零.\r\nZeroNet那些杂乱的政治信息都不用政府封锁它,用户都自觉封锁它,诞生这几年了,看看最近的帖子数量,看看ZeroNet上面的博客等,用户数量明显在减少停更,也许和区块链现在的形式有关.看着那些乱七八糟的内容,我都感觉是人家舆论战的一个工具.\r\n还有你说我幼稚,也许吧,有的时候很幼稚很天真.", "added": 1568936994, "modified": 1568936994, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2201#issuecomment-533382912", "source_type": "github"}]}}