{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "VICTIM OF CRIMINALITY / OPFER DER KRIMINALITÄT",
			"body": "[myZeroTalk of DjHawk aka Freak (Petr Koval)](/16Wf7VxQ2WiDLm3dmTZW5Ry9vXk2Etc4hX)",
			"added": 1570147448
		}
	],
	"topic_vote": {
		"1_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN": 1,
		"1_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": 1,
		"1_14sYTGCtraGEdDNSVZfWK1ps8anA23utna": 1,
		"4_1JN7Pe12nq1MF39wZJ59wSDoZH5aVVHJ9e": 1,
		"1_1NkRbczBVD8gsCG5PMsS1b2gN63srsqYvp": 1,
		"1_14tkD6qqifoVQs5aKacz9vQJSME92za5cw": 1,
		"1_1HckiKhQDz2LUKhNReuTxHcRdqWv2e8Lmy": 1,
		"2_19czZMtAoro4WBfRHtjRrSLosuwRnfFt4r": 1,
		"1_1LcbvJ4ttFZooAeuDUE3jZbmk94LDTuNbV": 1,
		"1_1HfBrwChBC8ZkhP6mGtci6vQ6sxCynFXx3": 1,
		"2_1HxZx6cqEEYTS2dHMBYjuhdaLXAvdMRbak": 1,
		"3_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"4_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"1_1GSbbwF4zRQH9ivGe2ecZtSFH5QLDzNuok": 1,
		"5_1MfLjPxECFM9voP1YCbrMaYBToP8Fmo3mN": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": [
			{
				"comment_id": 1,
				"body": "@grandphil im Prinzip ist es auch ganz logisch obwohl von dir ungewollt. Du sollst mit den Blocks lediglich dich als Benutzer beschützen aber nicht auch die anderen Benutzer. Die müssen sich selbst mit der Aktivierung solcher Blocks auch selbst schützen. Sonst wäre es die Zensur im Netz, die niemand will.",
				"added": 1566307521
			},
			{
				"comment_id": 2,
				"body": "Blocklisten sind wichtig! Ich bin zum Beispiel nichts neugierig auf das hier vollgefüllte Porno! Andere dagegen leben nur von dem POrno! Jedem also das seine!",
				"added": 1566311020
			}
		],
		"1_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN": [
			{
				"comment_id": 3,
				"body": "sehr gut",
				"added": 1566311383
			},
			{
				"comment_id": 4,
				"body": "ich betätige mich lediglich hier http://127.0.0.1:43110/1KjwPbyQTYgmLGJZZH25ZGGrCYrH2ULVVv/",
				"added": 1566311500
			}
		],
		"1_1GSbbwF4zRQH9ivGe2ecZtSFH5QLDzNuok": [
			{
				"comment_id": 5,
				"body": "und wieso hast du die URL zum Beispiel hier nicht geschrieben?",
				"added": 1566400778
			}
		],
		"1_1HfBrwChBC8ZkhP6mGtci6vQ6sxCynFXx3": [
			{
				"comment_id": 6,
				"body": "Ich bin der Meinung, dass ZeroNet schon von Anfang ein großes Sicherheitsproblem vieler Benutzer sein wird. Während ich beim Freenet Projekt nur manches entdeckt habe, habe ich hier ein Meer von sicherheitsbedenklichen Sachen entdecken müssen. Prinzipiell betrifft es zwei Kategorien, Sicherheit einer Identität, sei es im privaten / geheimen / für die Öffentlichkeit unbekannten Umfeld und in öffentlichen Umfeld (mit Fragen über möglichen Missbrauch einer Identität) und Gefahr für Transit, wenn es für Knoten Betreiber möglich ist Inhalte anzusehen. die für ihn nicht bestimmt sind (da hätten wir gleich auch das Datenschutz). Damit meinte ich nicht die Tatsache, ob Daten an Knoten eines Transits unverschlüsselt aufbewahrt werden, sondern die Selektierung wer hat welche Rechte was zu sehen. Mit dem bin ich zugleicht an das erste angestoßen, dass es kaum möglich ist eine wirkliche Privatsphäre aufzubauen, wenn am Transit diese Selektierung nicht verwirklicht wird. Auf dem I2P und sogar auf dem Freenet (Projekt) ist das erste genannte ein großes Problem, das zweite ist auf dem Freenet Gott sei Dank nicht der Fall.",
				"added": 1566512814
			},
			{
				"comment_id": 12,
				"body": "> [pischicamillo](#comment_1_16HnGHHCD9bXPwY1TDZC9wrH3mauRJx69c): Zur Sicherheit: Da ich hier neu bin, möchte ich wissen, ob ich jeden Browser benutzen kann, um ZeroNet zu verwenden? Wenn ich Chrome, Explorer oder Firefox verwende, ist das dann sicher?\n\nWenn es dir wirklich um deine Sicherheit geht, dann auf keinen Fall !\nAuch nur Tor Browser allein, ist keine Sicherheit !\nAuch voller Tor VPN (Tor Tunnel) Betrieb mit unfeststellbarem Zusammenhang der privaten (LAN) IP ohne der Möglichkeit festzustellen über welchen ISP, welche geographische Lage usw. ist keine Sicherheit !\n\nDie größte Sicherheitslücke sind das System selbst und der Mensch zugleich.\n\nAls erstes empfehle ich dir lediglich aktuellen Tot Browser und gesammten Datenfluss nach außen auf den eigenen Tor Knoten komplett umzuleiten. Damit weder du, noch das System inkl. beliebige Programme auf dem PC keinen direkten Internet Zugang haben, haben können. Dann kann dich nicht mal Flash verraten, der auch nicht benutzt werden sollte.\n\nAber freue dich auch nicht zu früh.\nWenn du dir igendein Trojaner anfängst, kann der Angreifer zwar nicht direkt zu seinem Trojaner verbinden, aber dein Trojaner zu ihm, über das Tor Netzwerk! Und somit kannst du jederzeit angegriffen und ausspioniert werden!",
				"added": 1567035414
			}
		],
		"2_1HxZx6cqEEYTS2dHMBYjuhdaLXAvdMRbak": [
			{
				"comment_id": 7,
				"body": "> [vhhcgzgzu](#comment_5_14EVtzbEisS8ZdmwahwLjU9xWGLpu1hESE): Könnte man eigentlich eine richtige Foren Software zu zeronet bringen? PhpBB läuft z.b auch mit sqllite .\n\nDie muss man unter den im ZeroNet benutzten Mitteln erst programmieren. PHP usw. sind Server Angelegenheiten die hier nicht verfügbar sind. Die Foren Software müsste an jedem Teilnehmer des Forums laufen und nicht wie übelich zentral auf einem Server.",
				"added": 1566600659
			},
			{
				"comment_id": 8,
				"body": "> [gary2018](#comment_1_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C): hallo!bis jetzt bin ich positiv überrascht und werde es auf alle fälle weiter nutzen auch wenn noch viel arbeit auf die entwickler von zeronet wartet...mal schauen wie sich das ganze noch entwickeln wird.....\n\nIch natürlich auch auch wenn das hier nicht die beste Lösung ist. Vor allem das die Daten für Knoten Betreiber auch dann lesbar sind, wenn sie für ihn gar nicht bestimmt sind. So können leicht auch die Benutzer kriminalisiert werden, die gar nichts mit illegalen Dingen zu tun haben wollen. Nur weil sie ungewollt als Transit von illegalen Daten für andere werden. Und sie das Know How nicht haben, wie sie sich davor schützen müssen.",
				"added": 1566600828
			},
			{
				"comment_id": 9,
				"body": "> [andrehja](#comment_1_13vJNENeKwm9nfFuWnigicfFKwmJ4Uoxgn): Hallo zusammen- bin hier gerade neu eingestiegen um das Internet mit zurückzuerobern. Noch immer benommen von \"Kommunikation in Netzen\" vor langer Zeit, als die fernuni-hagen noch laufen lernte.... und um dem rasanten Lauf mithalten zu können, wenigstens einigermaßen. Habe nun erst talk und sonst noch nicht viel probiert. Mit dem Tor läuft es nicht, obwohl ich die Portfreigabe eingerichtet habe, denke dass es nicht so schlimm ist...grüß euch erstmal!\n\nAlle Dienste laufen mittels Tor Schutz. Unbedingt benutzen!",
				"added": 1566600892
			},
			{
				"comment_id": 10,
				"body": "> [koyuawsmbrtn](#comment_2_1BFh4e3Ln78uq8ccfvz8ADVNv2NWGh7Hgo): Ist eine hübsche Technologie. Ich finde die Idee dahinter interessant, weil es dezentral angeordnet ist, selbst die Authentifizierung. ZeroNet scheint das zu lösen, was das Normie-Net nicht kann. Vielleicht ist es nicht ganz so weit wie Tor oder Dat, aber das sind auch wieder zwei verschiedene Konzepte mit unterschiedlichen Use-Cases. Kann @vhhcgzgzu hier zustimmen, scheint Potential zu haben. Leider noch nicht so viel Content hier :/\n\nnut kleine Bemerkungen\n1) vorsicht auf das User Identity Konzept, bietet absolut keine Sicherheit für die Identität, vor allem in Punkt Geheimhaltung eiener Identität. Will man zum Beispiel eine Gruppe von Menschen machen, die der restlichen Netzwerkumgebung absolut unbekannt sein soll, die typische Privatsphäre die niemanden etwas angeht, sonst wäre es ja keine Privatsphäre, so ist es nicht möglich! Jede Identität ist im Netz bekannt, obwohl man nicht unbedingt weiß, wer sich dahinter versteckt. Aber eine Identität die nur im Rahmen der Privatsphäre unbekannt existieren soll, ist hier nicht möglich.\n2) Verdammt viel Content, man glaubt es kaum, hunderte Terabytes. Und davon ganz schön viele Repliken. Aber das Problem, dass diese Inhalte nicht für nur eine bestimmte Gruppe da sein kann und für viele unsichtbar, unbekannt usw. da es eben notwendig ist, damit sich Informationen von A nach B transportieren, sie durch Transits müssen, die zu einer solchen Privatsphäre nicht angehören. Und das ist eben riesen Problem. Wären sie auf dem Transit wenigstens für andere unsichtbar.\nSchließlich geht es nicht nur um Privatsphäre sondern auch um die ungewollte Teilname an Verteilen von Illegalen Inhalten mit den man selbt nichts zu tun haben will. Wäre alles unsichtbar, dann würde man an der Kriminalität bewusst nicht mehr teilnehmen auch dann nicht wenn Segmente von illegalen Inhalten auf dem eigenem Knoten landen würden. man wüsste es eben nicht und es wäre behördlich auch nicht auffindbar, da eben für alle an dem Ort verschlüsselt und unlesbar gemacht. Und das sind eben die größte Probleme von ZeroNet.",
				"added": 1566601487
			},
			{
				"comment_id": 11,
				"body": "> [vhhcgzgzu](#comment_4_14EVtzbEisS8ZdmwahwLjU9xWGLpu1hESE): Ich hätte gerne einen Blog angelegt in zeronet und diesen über den Web Proxy auf meiner Domain verlinkt. \n> Ist bestimmt lustig  da man keinen eigenen webspace mehr benötigt  und die Besucher trotzdem über den Web Proxy den ich im Netz gefunden habe Zugriff haben.\n\nDas ist aber für dich persönlich sehr gefährlich.\nDu könntest schon eine einzige Möglichkeit schaffen, auf dein Blog zu zulassen und auf andere Orte zu verbieten.\nDas ist nicht das Problem. Aber du müsstest vielen anonymen/unbekannten Besuchern ein gemeinsamen Identitätslogin erlauben, mit dem sie zwar außer auf deinem Blog nichts machen könnten, aber das problem ist mit dem anonymen multiuse einer Identität auf deinem Blog und zugleich im Teil des ZeroNets.\nDas könnte ernste rechtliche Folgen haben.\n\nUm dieses zu verhindern, müsste der Blog an sich selbst anonym sein. Und genau das bringt nur dann was, wenn alle aus einem anonymen Netz wie ZeroNet kommen und nicht aus dem nicht anonymen Internet.",
				"added": 1566601944
			}
		]
	},
	"comment_vote": {
		"1_1EYRb6gKXJwpKXXqpb8JDtdRCAuQvAmnX": 1,
		"6_177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD": 1,
		"1_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1_17HsAnNw1DYuQgTAzjE1jFXdPXEQs9PGuJ": 1,
		"4_1KDRKDBSjdQmoGoQo3fdCHia7mp2Gmc8xt": 1,
		"1_1HmKe5P2j5aBFJzbmKpsiL6ufgXMyibT4a": 1,
		"1_1K8XkWirXhKSqE3t6WfcjbUcuSTCamzqMJ": 1,
		"2_1AZYSfyeKjZbAN9BPYYFf1FCSm9ujLXMcu": 1,
		"2_19czZMtAoro4WBfRHtjRrSLosuwRnfFt4r": 1,
		"1_18dxDGiugpDmk7Uoc4QAKcLQKyysL7ybSy": 1,
		"11_1LFxK1BSHEnkJcXXb4qGszVUxEwqLVSJU8": 1,
		"1_1Hvxi2Ygnr6GageTcaryMZmwwRLTYb1jb": 1,
		"1_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": 1,
		"1_13vJNENeKwm9nfFuWnigicfFKwmJ4Uoxgn": 1,
		"2_1BFh4e3Ln78uq8ccfvz8ADVNv2NWGh7Hgo": 1,
		"2_14EVtzbEisS8ZdmwahwLjU9xWGLpu1hESE": 1,
		"4_14EVtzbEisS8ZdmwahwLjU9xWGLpu1hESE": 1,
		"44_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1_1PeKhMTkX3Ro2VicZ5D6ydhPZrEaLGBCMA": 1,
		"1_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"9_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"2_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"3_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"14_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"4_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"5_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"6_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"25_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"26_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"7_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"8_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"9_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"28_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"1_169nMSAJryyFSqogU3zocsyJtnEEDXxVeW": 1,
		"10_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"11_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"12_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"2_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v": 1,
		"3_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v": 1,
		"13_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"4_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v": 1,
		"32_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"14_1JzfsvkAULTUnUSRuMXxBSmb4rTmRKCQZM": 1,
		"38_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"2_169nMSAJryyFSqogU3zocsyJtnEEDXxVeW": 1,
		"41_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"19_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"20_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"21_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"22_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"23_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"27_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"1_1FeLyRd1rZbnAETx7ZnXsUZ2k5xq3bYQeQ": 1,
		"29_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"30_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"31_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"32_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"33_1PnwiPmBieZDjM6qh9hRKq73uCYcgJct61": 1,
		"1_1MbDT6wKmPFovbPV6q7E5LDN3GeYWiiNNW": 1,
		"1_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v": 1,
		"5_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v": 1,
		"34_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"35_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"36_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"37_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"40_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"42_1EvCspcRRXeQvdRBTx3iXpJLY3Z14k2HV8": 1,
		"7_177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD": 1,
		"1_1GSbbwF4zRQH9ivGe2ecZtSFH5QLDzNuok": 1,
		"8_177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD": 1,
		"7_1LFxK1BSHEnkJcXXb4qGszVUxEwqLVSJU8": 1,
		"5_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi": 1
	}
}