{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1595700658,
			"title": "Skyrim Paid Mods Collection for LE",
			"body": "Now that we come to Zeronet, there is no need to hide away anymore. I have sorted out all the paid mods now I have (early access mods not included) and will be glad to share with you! Well, I think this pack is mainly used as a back-up because most of them can be found on schaken-mods and yiff. And because of the terrible speed of zeronet, I still use the tradional way, but if you are interested in uploading them to zeronet or making a torrent, feel free to use them.\nhttps://mega.nz/folder/8EIVQaSL\n\n\nPW:H7KNb5AER22vTCf2HI6MFA\nAddon: http://www.mediafire.com/file/laydtqd2zx69nmy/Confession.hjfd/file\nhttp://www.mediafire.com/file/opti71el673f7pn/Confession.hnbs2/file\n\nAnd you need annotation to read this~~~\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_18yMVQNnhGWod6jkEccZu7uG5f1tCPJR8W_item_6+type:archive\n\nUpdate 28th July:\nTo someone who keeps trying to report my files: this is just a back-up, what makes you become delusional that if they were taken down that people wouldn't be able to get them for free? Sorry, almost all of them now have been public released, including your mod and in order to punish your foolish behavior I've uploaded your mod to zeronet! Here is the link below:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_18yMVQNnhGWod6jkEccZu7uG5f1tCPJR8W_item_1+type:archive\n\n\n\n",
			"added": 1595700657
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1595607752_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 1,
				"body": "The speed connecting to zeronet is quite terrible from my location.",
				"added": 1595674730
			}
		],
		"1595700658_18yMVQNnhGWod6jkEccZu7uG5f1tCPJR8W": [
			{
				"comment_id": 2,
				"body": "> [halfhand](#comment_3_1J1Gjp2JEBafxiYRKL6Bs6cAY2H6b8WzVm): Hi, what do you do with the addons? The confession.hnbs2 and .hjfd files? What kind of an extension is that? Thanks.\n\nA good question! They are actually kom anim 31.36.16a. You needn't to download the addons if you can download them through zeronet,schaken-mods or yiff. It is just a defensive measure to the guy keeps reporting my files. But if you want to know more about the guilt of komotor, I'm very glad to tell you how to open the files correctly XD.\nFirst, you need to change the extension to normal format like 7z, zip or rar. \nSecond, decrypt the compression files. You need to read the annotation. There are 4 paragraphs altogether and each of them matches a passward of a compression file. They are random picked, so you have to try them one by one.",
				"added": 1596618615
			}
		]
	},
	"comment_vote": {}
}