{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1601047977_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 1,
				"body": "the moustache mouchachos !",
				"added": 1601221910
			}
		],
		"1600774973_1Jxw16HD6aiTyRHnpwE7tupnLn8SCsKaEA": [
			{
				"comment_id": 2,
				"body": "> [driud](#comment_131_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): And it is very good that they will;By giving pure distributions in return. / for a replacement /.Some people know about it? And the others, not necessarily.Everyone can finally choose what they want..\n\ntsl 1.4 ready? exactly a replacement if they can make it better (safer, etc, ie no less).\n\n\n> [insanecriminal](#comment_1_18SFer1zAMegr8LEtnFPWK8MnneWkYtZzr): How likely would you think that this is actually an indicative that they can break TLS <=1.2?\n\nvery high\n\n> [zeronetuser101](#comment_9_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD): TLS 1.2 has some vulnerabilities\n\nwhich one?",
				"added": 1601222021
			}
		],
		"1586632143_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "fucks your dna... and if you add all the 2g 3g 4g all with different providers... it would be nice to nationalize or keep only one networks of the old system like 2g and 3g... no need to have 4 antennas providing the same 2g or 3g network in the same area...\n\n> [anonymouslogin](#comment_212_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm more concerned about 5G and the possible effects on privacy. Remember that technology used to map the building in Batman, the Dark Knight. Yeah....not too far off with 5G. Just imagine a killer drone with facial recognition and any target's location down to a few inches. It's difficult to start a revolution against a government when the government can execute anyone who dissents. Food for thought.\n\nwifi can do that already... very impressive... even follow your heartrate... (and it's not a tinfoil theory).\n\n> [astrav](#comment_54_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Alex Jones knows much more than he says, that's the problem. He is a zionist mossad agent who deceives by saying lots of half truths. He would never support a platform like zeronet either.\n\nvery true... he shills like most us pundits israel, and contrary to them, use all the truth to get trust credits for his shilling... \n\n\n\n> [tajny2z](#comment_26_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): Oncology by most part is a fraud as cancers are natural and effect of imbalance in the body.\n\nyeah, I don't say it's everything, but nutritional deficiencies seem to play a major role too... \n\n> [astrav](#comment_37_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Think about this | | Electrical engineering studies electromagnetic phenomena. It's being ignored by medical staff but  human body is running on BIOPHYSICS | | The length of human arteries is thousands of meters. Human heart is relatively low power pump. Blood circulates easily thanks to opposite electrical charge blood cell vs artery wall that creates repelling force and reduces friction and heavy load on the heart. Biophysics go further still; Humans and trees have bio-energy fields. [...]\n\nyou will note that bill gates and specially hillary clinton were at the core of the EMF legislation, and gmo btw, and when you know their track records, it would be stupid to be doubtful... \n\nwhat is the penalty for an official lying about a health risk? nukes good? gmo excellent? glyphosate & frack fluids safe to drink?\n\nartificial emfs = avoid as much as possible... Austria has (had) the lowest level of emf pollution legislation...",
				"added": 1601222436
			},
			{
				"comment_id": 8,
				"body": "the romans suicided themselves with lead... we are among others on the EMF bandwagon...\n\never seen the movie \"johnny mnemonic\" with keanu reeves? it's an excellent science fiction if you haven't seen it...",
				"added": 1601224213
			},
			{
				"comment_id": 9,
				"body": "you should it's AMAZING ! (at least when I saw it, and frankly it was quite futuristic at the time (1995)).",
				"added": 1601234270
			}
		],
		"1601059958_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 4,
				"body": "that's fucking cool ! specially using infra sound or sound very close to the ambient noise to hide data traffic from the \"security forces\"... love it ! but I guess it will be nervously straining to those close to those sound emitters...",
				"added": 1601222508
			}
		],
		"1601064946_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 5,
				"body": ":) they are funny with all their trackers... one site I visited had 180 of them... just lol.",
				"added": 1601222543
			}
		],
		"1601063471_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 6,
				"body": "> [thenamelessone](#comment_1_1LcaiyidDpqH5h7MfZTGSJiBVLTjBzgGjs): It's proprietary and closed-source as far as I can tell. I'll pass.\n\n+1 to both of you...\n\nf js\nf proprietary\nf closed....",
				"added": 1601222579
			}
		],
		"1601058030_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 7,
				"body": "wikipedia is very dangerous and controlled, but permits a first idea of certain non controversial topics... but how to know what is a controversial topic?",
				"added": 1601222652
			}
		]
	},
	"comment_vote": {}
}