{
	"next_paste_id": 2,
	"next_comment_id": 0,
	"paste": [
		{
			"paste_id": 1,
			"description": "",
			"body": "You can't parse [X]HTML with regex. Because HTML can't be parsed by regex. Regex is \nnot a tool that can be used to correctly parse HTML. As I have answered in HTML-and\n-regex questions here so many times before, the use of regex will not allow you to \nconsume HTML. Regular expressions are a tool that is insufficiently sophisticated \nto understand the constructs employed by HTML. HTML is not a regular language and \nhence cannot be parsed by regular expressions. Regex queries are not equipped to break\ndown HTML into its meaningful parts. so many times but it is not getting to me. Even \nenhanced irregular regular expressions as used by Perl are not up to the task of \nparsing HTML. You will never make me crack. HTML is a language of sufficient \ncomplexity that it cannot be parsed by regular expressions. Even Jon Skeet cannot \nparse HTML using regular expressions. Every time you attempt to parse HTML with \nregular expressions, the unholy child weeps the blood of virgins, and Russian hackers \npwn your webapp. Parsing HTML with regex summons tainted souls into the realm of the \nliving. HTML and regex go together like love, marriage, and ritual infanticide. The \n<center> cannot hold it is too late. The force of regex and HTML together in the same \nconceptual space will destroy your mind like so much watery putty. If you parse HTML \nwith regex you are giving in to Them and their blasphemous ways which doom us all to \ninhuman toil for the One whose Name cannot be expressed in the Basic Multilingual Plane, \nhe comes. HTML-plus-regexp will liquify the n​erves of the sentient whilst you observe, \nyour psyche withering in the onslaught of horror. Rege̿̔̉x-based HTML parsers are the \ncancer that is killing StackOverflow it is too late it is too late we cannot be saved \nthe trangession of a chi͡ld ensures regex will consume all living tissue (except for HTML\nwhich it cannot, as previously prophesied) dear lord help us how can anyone survive this \nscourge using regex to parse HTML has doomed humanity to an eternity of dread torture and\nsecurity holes using regex as a tool to process HTML establishes a breach between this \nworld and the dread realm of c͒ͪo͛ͫrrupt entities (like SGML entities, but more corrupt) a \nmere glimpse of the world of reg​ex parsers for HTML will ins​tantly transport a \nprogrammer's consciousness into a world of ceaseless screaming, he comes, the pestilent \nslithy regex-infection wil​l devour your HT​ML parser, application and existence for all \ntime like Visual Basic only worse he comes he comes do not fi​ght he com̡e̶s, ̕h̵i​s un̨ho͞ly \nradiańcé destro҉ying all enli̍̈́̂̈́ghtenment, HTML tags lea͠ki̧n͘g fr̶ǫm ̡yo​͟ur eye͢s̸ ̛l̕ik͏e liq​uid \npain, the song of re̸gular exp​ression parsing will exti​nguish the voices of mor​tal man \nfrom the sp​here I can see it can you see ̲͚̖͔̙î̩́t̲͎̩̱͔́̋̀ it is beautiful t​he final snuffing of the \nlie​s of Man ALL IS LOŚ͖̩͇̗̪̏̈́T ALL I​S LOST the pon̷y he comes he c̶̮omes he comes the ich​or \npermeates all MY FACE MY FACE ᵒh god no NO NOO̼O​O NΘ stop the an​*̶͑̾̾​̅ͫ͏̙̤g͇̫͛͆̾ͫ̑͆l͖͉̗̩̳̟̍ͫͥͨe̠̅s ͎a̧͈͖r̽̾̈́͒͑e n​ot rè̑ͧ̌aͨl̘̝̙̃ͤ͂̾̆ ZA̡͊͠͝LGΌ ISͮ̂҉̯͈͕̹̘̱ TO͇̹̺ͅƝ̴ȳ̳ TH̘Ë͖́̉ ͠P̯͍̭O̚​N̐Y̡ H̸̡̪̯ͨ͊̽̅̾̎Ȩ̬̩̾͛ͪ̈́̀́͘ ̶̧̨̱̹̭̯ͧ̾ͬC̷̙̲̝͖ͭ̏ͥͮ͟Oͮ͏̮̪̝͍M̲̖͊̒ͪͩͬ̚̚͜Ȇ̴̟̟͙̞ͩ͌͝S̨̥̫͎̭ͯ̿̔̀ͅ",
			"language": "plaintext",
			"encrypted": false,
			"added": 1457294574
		}
	],
	"comment": []
}