{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1L3UBHScbiP33svDmiNfNnFLZzebNECgqC": [
			{
				"comment_id": 1,
				"body": "毛泽东并没有食言。文革当中人民有大鸣大放大字报大辩论的自由，甚至人民可以将国家主席拉去游街。他本人完全是因为革命年代积累的威望太高导致无人敢反对他而已。",
				"added": 1500468570
			},
			{
				"comment_id": 2,
				"body": "> [lawyer](#comment_3_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW): 这位网友是真心的支持毛伟人吗？如果是真心的支持毛伟人，就应该比文革时期的群众更真诚，在把毛伟人歌颂到“万岁不朽”的级别时，要坚持推行以持枪权捍卫“万岁”真理的原则。毛伟人在1949年前不会过度背叛民主宪政的原则，没有制造大饥荒之类的灾难，主要是因为华北地区不少民兵拥有枪支，而黄豆选举只是辅助性的因素。与此同理，把法轮功歌颂到“真善美”的程度，却不敢坚持以持枪权捍卫类似“伟光正”的“真善美”的真理原则，有同样危险的倾向。\n\n中华民国在中国大陆执政38年，人口增长最多最多9千万；作为对比，新中国成立之后，每十年增加1亿。也就是说，如果这38年由共产党来执政，人口大概能增长4亿。然后只增长了9千万，可以说中华民国执政时期中国大陆有3亿人非正常死亡。\n实际上，这38年当中，没有饥荒的只有7年，另外31年都有饥荒。国民党政府也没有能力完全国内的统一，国家处于军阀割据状态；国民党政府更没有能力抵御外侮，外国军队在中国如入无人之境，连首都南京也被屠城。\n1949年，毛泽东领导共产党成立新中国。从那时起，再没有外国军队可以踏入中国一步。59-61年是中国近代最后一次饥荒，然后中国共产党就彻底消灭了从清末开始的持续的饥荒。中国人口在毛泽东时代由5亿急剧增长到9亿，这个事实本身就是人民生活条件大幅改善的证明。毛泽东时代人民的确是可以持枪的，改革后人民手中的枪才被收缴，但那显然不由毛泽东负责了。",
				"added": 1501343416
			}
		],
		"1_1Fv1xGsCxVzHNkCyCMLkJsXaqHSqc5VS45": [
			{
				"comment_id": 3,
				"body": "> [gdd](#comment_12_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA): 64 不需要平反。就像当年的黄花岗起义，同样被清庭定性为反革命暴乱，然而并不需要清廷为其平反一样。\n> 除非中共自己认为 64 应该平反，在中共统治期内为 64 学潮正名。可那是中共自己的事情，不该由非共来呼吁或提醒。\n> 无论中共的态度如何，千百年后的历史书上，8964 都是一群爱国青年发动的爱国主义运动。而中共在历史书上如何表述现在还不得而知，那取决于中共现在或将来的党魁会不会效法蒋总统经国先生主动开放党禁报禁归还言论自由。但是不管怎样，“毛泽东”这三个字都会成为脏话，被用来骂人，而且是所有脏话中对挨骂者侮辱性质最严重的一种，一般情况下，满口“毛泽东”的人被认为是比满口生殖器的人更下流更无耻更没有教养的家伙。\n> 64 不需要平反！\n\n64发生的时候，毛泽东已经过世13年了，甚至毛泽东本人已经被继任者三七开了，继任者的路线也已经与毛泽东有了很大的不同。你还把责任归到他头上？这么糊涂，很难让别人相信你的。",
				"added": 1501343825
			}
		],
		"3_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": [
			{
				"comment_id": 4,
				"body": "键盘革命党",
				"added": 1501343995
			}
		],
		"4_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": [
			{
				"comment_id": 5,
				"body": "你们说的这些，有一丝一毫的证据吗？不怕下拔舌地狱吗？",
				"added": 1505790173
			}
		],
		"8_1MQUEdi3kDb9u2o1gNLywN5Ms9QDQ3sCed": [
			{
				"comment_id": 6,
				"body": "现在美国政府已经拥有飞机大炮卫星核弹作为武器了。如果要坚持给予人民捍卫人权的基本原则，那么应该允许美国人民拥有同样的武器。期待美国人民人手一只核弹的时代早日到来。",
				"added": 1507349394
			}
		],
		"7_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW": [
			{
				"comment_id": 7,
				"body": "“信道的人，不可舍同教而以外教为盟友；谁犯此禁令，谁不得真主的保佑，除非你们对他们有所畏惧而假意应酬。真主使你们防备他自己，真主是最后的归宿”(《古兰经》3:28)。\n“当时，你的主启示众天神：「我是与你们同在的，故你们当使信道者坚定。我要把恐怖投在不信道的人的心中。」故你们当斩他们的首级，断他们的指头。”（《古兰经》8:12）\n让汉族联合穆斯林？把后背给穆斯林，是找死。",
				"added": 1507349767
			}
		]
	},
	"comment_vote": {}
}