{
	"next_quote_id": 20,
	"quote": [
		{
			"quote_id": 1,
			"body": "\"My mother was born in Berlin to a pretty Jewish clan.\"",
			"by": "Stefan Molyneux",
			"work": "",
			"date_added": 1560902821200
		},
		{
			"quote_id": 2,
			"body": "\"Jewish people are still recovering from the holocaust, my grandparents escaped the Nazi's in Denmark & lost everything.\"",
			"by": "Lauren Southern",
			"work": "",
			"date_added": 1560903181400
		},
		{
			"quote_id": 3,
			"body": "\"I'm a 4th generation holocaust survivor.\"",
			"by": "Tara McCarthy ",
			"work": "",
			"date_added": 1560903323700
		},
		{
			"quote_id": 4,
			"body": "\"I've got a little bit of [Jew] in my blood.\"",
			"by": "Mike Cernovich",
			"work": "",
			"date_added": 1560903410100
		},
		{
			"quote_id": 5,
			"body": "\"We fought the Revolution in defense of the rights of man and the Civil War to abolish slavery and have now gone back on both principles.\"",
			"by": "General George S.Patton",
			"work": "",
			"date_added": 1560903592500
		},
		{
			"quote_id": 6,
			"body": "\"There is a very apparent Semitic influence in the press. They are trying to do two things: first, implement communism, and second, see that all businessmen of German ancestry and non-Jewish antecedents are thrown out of their jobs.\"",
			"by": "George S.Patton",
			"work": "",
			"date_added": 1560903784800
		},
		{
			"quote_id": 7,
			"body": "\"It's said that for the first week after [the Soviets] took [Berlin], all woman who ran were shot and those who did not were raped. I could have taken it had I been allowed.\"",
			"by": "George S.Patton",
			"work": "",
			"date_added": 1560903956600
		},
		{
			"quote_id": 8,
			"body": "\"We have destroyed what could have been a good race, and we are about to replace them with Mongolian savages. And all Europe will be communist.\"",
			"by": "George S.Patton ",
			"work": "",
			"date_added": 1560904046400
		},
		{
			"quote_id": 9,
			"body": "\"Cuanto más se desvíe una sociedad de la verdad, más odiará a aquellos que la proclaman.\"",
			"by": "George Orwell",
			"work": "",
			"date_added": 1560904310200
		},
		{
			"quote_id": 10,
			"body": "\"The Third World War must be fomented between the Christians and the Islamic World. The War must be conducted in such a way that Islam and Christianity mutually destroy each other leaving the Political Zionist in control.\"",
			"by": "Albert Pike",
			"work": "",
			"date_added": 1560904627700
		},
		{
			"quote_id": 11,
			"body": "\"Accelerate the Zionist agenda to achieve freedom.\"",
			"by": "Brenton Tarrant",
			"work": "",
			"date_added": 1560904943400
		},
		{
			"quote_id": 12,
			"body": "\"Through eternal struggle has mankind achieved greatness; through eternal peace will mankind decay.\"",
			"by": "William Luther Pierce",
			"work": "",
			"date_added": 1560905121900
		},
		{
			"quote_id": 13,
			"body": "\"It's hard for us all to coordinate our stories sometimes, so it appears there are disagreements among us. Fortunately we all agree on the most important issues: eradicating whiteness and undermining its civilizations.\"",
			"by": "Philip N. Cohen",
			"work": "",
			"date_added": 1560905346300
		},
		{
			"quote_id": 14,
			"body": "\"Masonic lodges are established all over the world to help us achieve our independence. Those pigs, the non-Jewish Masons, will never understand the final objects of Masonry.\"",
			"by": "Theodor Herzel",
			"work": "",
			"date_added": 1560905505600
		},
		{
			"quote_id": 15,
			"body": "\"El crimen imperdonable de Alemania antes de la II Guerra Mundial fue su intento de retirar su poder económico del sistema de comercio mundial y crear su propio mecanismo de cambio, que negaría beneficios a la finanza internacional.\"",
			"by": "Wiston Churchil",
			"work": "",
			"date_added": 1560906129700
		},
		{
			"quote_id": 16,
			"body": "\"Self-sacrifice is no encouraged by the Satanic religion.\"",
			"by": "Anton LaVey",
			"work": "",
			"date_added": 1560906270600
		},
		{
			"quote_id": 17,
			"body": "\"The social system based on and consonant with the altruist morality with the code of self-sacrifice is socialism, in all or any of its variants: fascism, Nazism, communism.\"",
			"by": "Ayn Rand",
			"work": "",
			"date_added": 1560906377500
		},
		{
			"quote_id": 18,
			"body": "\"And the town is willing to give up something so that the state can be in business, and the state is willing to give up something so the nation can succeed. Self-Sacrifice is the first principle of civilization.\"",
			"by": "George Lincoln Rockwell",
			"work": "",
			"date_added": 1560906644900
		},
		{
			"quote_id": 19,
			"body": "\"Civilization is built because I am willing to give up sommething for my family, and the family is willing to give up something in order to have the town succeed.\"",
			"by": "George Lincoln Rockwell",
			"work": "",
			"date_added": 1560906748900
		}
	],
	"quote_vote": {
		"4-1KkMG9dp4HYwhmjGZJYgUcKS3aV1AmfxYq": 1,
		"7-1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": 1,
		"1-15ATNsS6aHGvBg5xoMP94sXpNaLX4fSHjN": 1
	}
}