{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1616745520,
			"title": "Вышло обновление Retroshare 0.6.6",
			"body": "После двух лет разработки представлена новая версия RetroShare 0.6.6, платформы для конфиденциального обмена файлами и сообщениями при помощи шифрованной Friend-to-Friend сети. Сборки подготовлены для Windows, FreeBSD и многих дистрибутивов GNU/Linux. Исходный код RetroShare написан на языке C++ с использованием тулкита Qt и распространяется под лицензией AGPLv3.\n\nКроме прямого обмена сообщениями, программа предоставляет средства для чата с несколькими людьми, организации голосовых- и видеовызовов, отправки шифрованной электронной почты пользователям сети, организации обмена файлами с выбранными пользователями или любым участником сети (используется технология, похожая на BitTorrent), создания защищённых от навязывания цензуры децентрализованных форумов с поддержкой написания сообщений в offline, формирования каналов для доставки контента по подписке.\n\nВ новом выпуске:\n\n    Переработан интерфейс для работы с сообщениями, добавлено новое оформление каналов и форумов (board). Для отображения публикаций предложено два режима - стека и список: \n\nПереработана система токенов, используемых для подключения к другим пользователям. Идентификаторы стали значительно короче и теперь укладываются в размер QR-кода, что упрощает передачу идентификатора другим пользователям. Идентификатор содержит имя узла и профиля, SSL Id, хэш-слепок профиля и сведения об IP-адресах для подключения. \n\n Обеспечена совместимость с третьей версией протокола onion-сервисов Tor.\nДобавлены инструменты для автоматического удаления каналов и форумов спустя 60 дней после отмены подписки.\nПеределана система уведомлений, вкладка \"Log\" замена на \"Activity\", в которой помимо сводных данных о новых сообщениях и попытках соединения размещена информация о запросах на подключение, инвайтах и изменениях в составе модераторов.\nВнесены различные улучшения в интерфейс, например, добавлена новая вкладка для идентификаторов, повышена читаемость домашней страницы, переделана возможность закрепления тем в форуме.\nПри формировании цифровой подписи сертификатов вместо SHA1 задействован алгоритм SHA256. Старая асинхронная система токенов заменена на новый API, работающий в блокирующем режиме.\nВместо консольного сервера retroshare-nogui предложен сервис retroshare-service, который может применяться как на серверных системах без монитора, так и на устройствах на базе платформы Android.\nЛицензия изменена c GPLv2 на AGPLv3 для GUI и LGPLv3 для libretroshare. \n\nhttps://retroshare.cc/",
			"added": 1616745519
		},
		{
			"topic_id": 1616745772,
			"title": "Поддержка emule сообществом",
			"body": "https://github.com/irwir/eMule/releases/",
			"added": 1616745770
		},
		{
			"topic_id": 1616842839,
			"title": "OpenBazaar",
			"body": "одноранговый децентрализованный протокол торговли с открытым исходным кодом, использующий биткойн с возможностью указывать цены в фиатных валютах, разработчики Недавно текстиль штука классная захотелось даже свою жоп там продать всем советую протестировать https://openbazaar.org/",
			"added": 1616842836
		}
	],
	"topic_vote": {
		"1616745772_14bDUXb6RppLjK3ygbTaeoWGzzp8WY9esv": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1607478277_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 1,
				"body": "> [exhumator](#comment_1_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq): Android-верси\n\nAndroid-верси это не то фигня а вот десктопная там супер поиск и чаты",
				"added": 1616745677
			},
			{
				"comment_id": 2,
				"body": "> [geekless](#comment_200_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Там свежая версия недавно вышла. Надо попробовать что ли.\n\nРекомендую да вы сами видили все на видео на что он способен",
				"added": 1616842638
			}
		]
	},
	"comment_vote": {}
}