{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1543348094,
			"title": "I discovered Zeronet a few years ago, but immediately abandoned it due to the massive neglect of user-security. Have things changed?",
			"body": "I'm talking about these security concerns in particular if anything:\nhttps://endchan.xyz/supersecrettestinggrounds/preview/84.html\n\nThis one was an issue with me too\nhttps://news.ycombinator.com/item?id=14041077\n\nParticularly, I dislike the fact that ZeroNet tracks your ID across everything, with no actual option for anonymity, so that any experienced user can see what *you* posted and where.\n\nHave these issues been addressed since?\nI personally really love the idea of zeronet, I simply with that I could use it in good conscience.",
			"added": 1543348093
		}
	],
	"topic_vote": {
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_496_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @anon202010102 someone more qualified may reply, but this is what i know so far as an amateur user: [...]\n\nThank you so much for your detailed response. I understand completely that, as another user pointed out, I'm posting an \"imageboard argument\". However, I simply still have my concerns, and since I am not extremely familiar with this topic myself, it felt easier to ask it by posting the image.\n\n\n>On ZeroHello, you can switch identity. Example one ID you use for serious content, other for questionable.\nThe ID is my main concern, as ZeroNet stored (I would believe it still does?) everyone's ID and past comments in an un-encrypted way, in nicely organized JSON files: \nhttps://i.imgur.com/6I5CVd9.png\n\nNow, it's mildly unpleasant, but no different from something like Reddit where you have a username and comment history. The only issues is, this comment history follows you across sites \"due to zeronet using the same cert_sign and cert_user_id unless you make one per site\" (you can only make a new one every several hours) and always make sure to use the right one for the right site. Although that still leaves the problem of this making it easy for you to search the comments across every site simultaneously for similar patterns and post topics (say, via grep)  since everything is in the same (JSON) format. That, for me, is a little more privacy concerning. \n\nI don't want to create a throwaway id every single time I wish to post a comment if I want to be truly anonymous.\n\n\n>PS: @Krixano started some decentralized ID authority site http://127.0.0.1:43110/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/create-id using custom PeerMessage plugin (though nothing like that is bundled into ZeroNet by default).\nSorry, I'm having a bit of trouble understanding what this is, exactly? A third-party ID generator?\n\n\n> ZeroVoat generates own identity, Millchan also.\nI'm super happy to hear that this can at least be implemented. Here's to hoping more sites utilize this, or a built-in \"auto-throwaway-id\" function gets implemented.\n\n\n>Lola is creating Zeronet Browser that may block clearnet traffic in the future\n>You can use TOR\nI'm really happy to hear about both of these, thank you.  I'll definitely be looking forward to the browser.\n\n\n> You can not be be sure about someone's IP.\nThe ID to IP link is the scariest part. If such a link is found and the developers are willing to fix it, then that is fine.\nIf however, no such thing currently exists, then all is well. Although I have to question how sure \"not too sure about someone's IP\" is, still.\n\n\n>It may increase CPU utilization and possibly a bit RAM usage, though if that would be possible i would also prefer if certain data on HDD is encrypted by default. \nYeah, I think most users would agree with that. I would like my personal data to be encrypted, and on a modern computer, I feel like the performance hit would be negligible. And if it isn't, maybe it should be an opt-out feature.\n\n\n>Though it is anyone's responsibility to encrypt their HDD if it contains sensitive data. \nYeah, that's a fair assessment to be honest. It doesn't necessary help with the fact that other users have your data, but it is still good practice.",
				"added": 1543359646
			}
		]
	},
	"comment_vote": {
		"496_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"7_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"310_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": 1
	}
}