{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1577098395,
			"title": "راهکار برای درست کار کردن زیرونت در قطعی سراسری احتمالی ایران",
			"body": "دوستان به نظرتون چه کارهایی باید انجام بشه که اگر مثل آبان ماه ۹۸ اینترنت باز قطع شده اینجا کارکنه؟",
			"added": 1577098394
		},
		{
			"topic_id": 1577287203,
			"title": "مراقب هویت خودتون باشید",
			"body": "اینجا معلوم نیست کی به کیه، مراقب باشید که هویت خودتون رو لو ندید، از طریق ZeroMail میتونید با دوستان و آشناهای خودتون در ارتباط باشید. اطلاعات شخصی از خودتون به کسی ندید و...",
			"added": 1577287201
		}
	],
	"topic_vote": {
		"1576177062_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1577098395_1H1VjVyTYc6EJykyRTrWv7c19cBx7Jpev9": [
			{
				"comment_id": 1,
				"body": "فعلن میتونید با فعال کردن پلاگین Bootstrapper در تنظیمات. زیرونت خودتون رو به یه شبه tracker تبدیل کنید.\nAdd BitTorrent tracker server like features to your ZeroNet client. (default: disabled)",
				"added": 1577098507
			}
		],
		"1576602638_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 2,
				"body": "> [rashedheydari](#comment_10_19auC98Nvg4jXwZpKzvs3UdDazi4kUappa): آیا فقط zero net هست اگر خواستیم به عزیزانمون موقع قطعی پیام بدیم چه مواردی رو پیشنهاد میکنید بهترین روش برای دور زدن قطعی در اندروید چیست\n\nمیتونید از طریق این اپلیکیشن پیامک رمزنگاری شده ارسال کنید. https://silence.im",
				"added": 1577098671
			},
			{
				"comment_id": 5,
				"body": "> [r0ot](#comment_1_1BzD6oSr4yv2vmq6EoKoqWG8zpBYC9Uojo): سلام من الان با زیرونت آشنا شدم غیر از ساختن زیرو ایدی کار دیگه ای نباید بکنم؟\nخیلی بهتره که از ZeroMail و ZeroMe هم استفاده کنید",
				"added": 1577286691
			}
		],
		"1577264174_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 3,
				"body": "نه نظر میاد شروع کردن دارن یه انگولکایی روی اینترنت موبایل میکنن",
				"added": 1577267519
			},
			{
				"comment_id": 4,
				"body": "> [pouya](#comment_2_17jiBcpehnn7vbvGuoegXgBYBwy2qecRHH): اگر اینترنت قطع بشه زیرونت هم بلااستفاده میشه درسته؟در اینصورت چه باید کرد برای ارتباط؟\nیک پلاگین هست اون رو توی تنظیمات زیرونت فعال کنید، کمک میکنه به زیرونت و باعث میشه اکانت شما به یه چیزی مثل ترکر تبدیل بشهBootstrapper",
				"added": 1577279440
			},
			{
				"comment_id": 6,
				"body": "اینا کلی هزینه رو توی این مدت کردن که اینترنت جهانی رو قطع کنند و اینترانت داخلی رو داشته باشن که سایت‌های بانک‌ها و سرویس‌های دیگه کار کنن. اما خوبی زیرونت اینه که خیلی خوب با اینترانت میلی هم کار میکنه.",
				"added": 1577286858
			},
			{
				"comment_id": 7,
				"body": "> [mld29](#comment_3_1GdXmuvnKLVbb7zKx585uuQ3KXmA4RNZRW): فک نکنم بشه عوض کرد\n\nیکی دیگه بساز از اون استفاده کن",
				"added": 1577286889
			},
			{
				"comment_id": 8,
				"body": "خیلی جالبه امروز ایرانیا زیاد شدن سرعت عالی شده",
				"added": 1577286981
			},
			{
				"comment_id": 9,
				"body": "برم با اینترنت ایرانسل بیام ببینم بازم اینجا کار میکنه یا نه",
				"added": 1577287022
			}
		]
	},
	"comment_vote": {}
}