{
	"next_topic_id": 38,
	"topic": [
		{
			"topic_id": 1,
			"title": "Otter Browser open source старая добрая опера вернулась как альтернатива firefox",
			"body": "Otter Browser — свободный интернет-браузер с открытым исходным кодом на основе движков Qt и QtWebKit. Разработчики стремятся создать браузер максимально похожий на последнюю «классическую» версию браузера Opera 12.x. Пользовательский интерфейс написан на базе Qt5[5][6][7][8][9], что является одной из широко освещаемых особенностей.\n\nС января по август 2018 вышло множество[уточнить] релиз-кандидатов, направленных на исправление последних критических ошибок перед релизом полноценной версии 1.0.[источник не указан 122 дня]\nСодержание\n\n    1 Особенности\n    2 История версий\n    3 Полный список функций\n    4 См. также\n    5 Примечания\n    6 Ссылки\n\nОсобенности\n\n    Стартовая страница (аналог экспресс-панели в Opera)\n    Менеджер паролей;\n    Блокирование содержимого (встроенные списки блокировки: RU Adlist (недоступная ссылка) и другие);\n    Проверка орфографии;\n    Настраиваемый графический интерфейс;\n    Быстрый набор;\n    Закладки и различные сопутствующие компоненты;\n    Жесты мышью;\n    Таблицы стилей пользователя;\n\nи многое другое[уточнить\n\nДальнейшие планы разработчиков - реализация почтового клиента (как модуль), модуль BitTorrent[10], а также поддержка скинов Opera.",
			"added": 1547663862
		},
		{
			"topic_id": 2,
			"title": "Blackberry что это и стоит ли покупать",
			"body": "https://www.youtube.com/watch?v=iF3QKkA3twg",
			"added": 1547664028
		},
		{
			"topic_id": 3,
			"title": "Алюминиевая проводка в квартирах и домах?! Новый Приказ №968",
			"body": "https://www.youtube.com/watch?v=RFOJuiE8MFs",
			"added": 1547664054
		},
		{
			"topic_id": 4,
			"title": "Новая социальная сеть Vaffle",
			"body": "https://www.youtube.com/watch?v=z6fVqpidvmU",
			"added": 1547664081
		},
		{
			"topic_id": 5,
			"title": "Вселенная-25\"Искусственный рай",
			"body": "https://www.youtube.com/watch?v=xYTQMKvfQTY",
			"added": 1547664095
		},
		{
			"topic_id": 6,
			"title": "Лекция - шифрование, анонимность и альтернативные сети ч.1",
			"body": "https://www.youtube.com/watch?v=etMZNrtlpBw",
			"added": 1547664128
		},
		{
			"topic_id": 7,
			"title": "Шифрование информации и обеспечение анонимности в интернете» лекция И.И. Чертова 20.11.2015 20",
			"body": "https://www.youtube.com/watch?v=oKOVxgjvi9Y",
			"added": 1547664142
		},
		{
			"topic_id": 8,
			"title": "Шифрование информации и обеспечение анонимности в интернете.Практикум»Лекция И.И.Чертова",
			"body": "https://www.youtube.com/watch?v=1jWNkQ4up1E",
			"added": 1547664155
		},
		{
			"topic_id": 9,
			"title": "Слежка microsoft,skype",
			"body": "https://www.youtube.com/watch?v=Xf3phIsMpwM",
			"added": 1547664184
		},
		{
			"topic_id": 10,
			"title": "СОРМ-3",
			"body": "https://www.youtube.com/watch?time_continue=1&v=osd_aBY8u_4",
			"added": 1547664201
		},
		{
			"topic_id": 11,
			"title": "Лекция. Ричард Столлман Richard Matthew Stallman он же RMS",
			"body": "https://www.youtube.com/watch?v=SIvSgFhUA_k",
			"added": 1547664253
		},
		{
			"topic_id": 12,
			"title": "Информационная безопасность для политиков, бизнесменов, госслужащих, вольных граждан",
			"body": "https://www.youtube.com/watch?v=Tiohs-bvEZw",
			"added": 1547664308
		},
		{
			"topic_id": 13,
			"title": "Вся правда о контроле за информацией",
			"body": "https://www.youtube.com/watch?v=4Kl3LBoBp44",
			"added": 1547664336
		},
		{
			"topic_id": 14,
			"title": "Perfect Dark: Первый запуск клиента PD",
			"body": "https://www.youtube.com/watch?v=T68PN8n69nk",
			"added": 1547664367
		},
		{
			"topic_id": 15,
			"title": "Perfect Dark: Открытие порта",
			"body": "https://www.youtube.com/watch?v=FF_TwraRwGc",
			"added": 1547664398
		},
		{
			"topic_id": 16,
			"title": "Scuttlebutt – непривязанная к серверу безопасная социальная сеть",
			"body": "Представьте, что вы можете переписываться с друзьями без Интернета, а все посты хранятся на вашем компьютере, а не на сервере. А еще ваше общение полностью безопасно. По такому принципу работает социальная сеть Scuttlebutt. Корреспондент Теплицы разбирался, как устроена сеть.\n\nScuttlebutt создал разработчик программной платформы Node.js Доминик Тарр (Dominic Tarr) из Новой Зеландии. Дело в том, что Тарр часто путешествовал и был в офлайне. По этой причине он решил разработать социальную сеть, которая не требует подключения к Интернету, а значит, не зависит от него.\n\n    Их называют peer-to-peer сети (P2P, пиринговые файлообменные) – они обеспечивают интернет-пользователям возможность обмениваться файлами напрямую, без участия сервера.\n\nОна работает на основе уникальной сети сообщений Secure Scuttlebutt (SSB), что делает ее полностью децентрализованной. Например, как Bitcoin или BitTorrent. В отличие от централизованных систем, как PayPal или Dropbox, у нее нет единого веб-сайта или сервиса для подключения. То есть никакая компания или посредник не смогут проконтролировать сеть.\nПринцип шифрования в Scuttlebutt. Изображение: скриншот с сайта staltz.com\nПринцип шифрования в Scuttlebutt. Изображение: скриншот с сайта staltz.com\n\nКак правило, в социальных сетях Facebook или Twitter сетевые соединения централизованы со своими серверами. А это определенные риски. Были случаи, когда правительство закрывало социальные сети на несколько дней и недель. Такое происходило в Египте, Камеруне и Бразилии.\n\n    Доминик Тарр убежден, что коммуникация и распространение информации в этой социальной сети надежны и устойчивы.\n\nДля общения достаточно два компьютера, роутер и электричество. Безопасность переписки обеспечивается с помощью шифрования. Чтобы отправить сообщение кому-либо, нужно записать его в своем дневнике. Все посты и записи будут храниться на вашем компьютере.\n\n    Еще по теме: Цифровая безопасность правозащитников: вопросы, сомнения, рекомендации\n\nКаждый раз, когда два пользователя Scuttlebutt подключаются к одному и тому же Wi-Fi, их компьютеры будут синхронизировать последние сообщения в их дневниках.\n\nДля начала работы нужно установить Patchwork (доступен для Windows, macOS и Linux), а затем подключиться к серверу Pub. Scuttlebutt выглядит как обычное приложение с приятным и удобным дизайном. https://www.scuttlebutt.nz/",
			"added": 1547664576
		},
		{
			"topic_id": 17,
			"title": "diaspora,Mastodon,Pleroma pod list server list",
			"body": "https://the-federation.info/#protocols",
			"added": 1547664717
		},
		{
			"topic_id": 18,
			"title": "Manyverse мобильная версия Scuttlebutt",
			"body": "https://www.manyver.se/",
			"added": 1547664930
		},
		{
			"topic_id": 19,
			"title": "Вскрываем бизнес Дуровых. Действия настоящего борца за свободу коммуникаций",
			"body": "https://www.youtube.com/watch?v=Np417D6QpKw",
			"added": 1547674394
		},
		{
			"topic_id": 20,
			"title": "Закладки в UEFI и BIOS ▲ Немного о Coreboot и Libreboot",
			"body": "https://www.youtube.com/watch?v=wwXpFSNTFog",
			"added": 1547703101
		},
		{
			"topic_id": 21,
			"title": "Обход блокировок любых p2p file sharing",
			"body": "Видео https://www.youtube.com/watch?v=rHB98cXZHrw",
			"added": 1547738881
		},
		{
			"topic_id": 22,
			"title": "F-Droid альтернатива ебаному google play далой мусорской андроид",
			"body": "Все приложения в репозитории F-Droid имеет открытый исходный код что полностью соответствует требованиям фонда свободного программного обеспечения FSF  https://f-droid.org/en/",
			"added": 1547756209
		},
		{
			"topic_id": 23,
			"title": "ZeroTorrent.bit Перспективный торрент трекер",
			"body": "http://127.0.0.1:43110/ZeroTorrent.bit/",
			"added": 1547790834
		},
		{
			"topic_id": 24,
			"title": "perfect dark 1.23 Перспективная анонимная файлообменная сеть с шифрованием",
			"body": "perfect dark 1.23 download\n\nhttps://drive.google.com/file/d/1tyKJPbsTD75o8NojZRQFgDj2sFKlYvq5/view\nhttps://yadi.sk/d/ri9UkMQjKGRTPQ\nnodes https://perfectdark.benri-tool.net/node/\n\nMD5 bf4440588512a46c25fb1f06dac65413\nSHA1 698fdc7514147078828a7a9091d4937e59ede271",
			"added": 1547791208
		},
		{
			"topic_id": 25,
			"title": "Линус Торвальдс усомнился в необходимости использования STIBP",
			"body": "Создатель Linux выразил сомнения в целесообразности дефолтной активации технологии Single Thread Indirect Branch Predictors (STIBP). Этот патч обеспечивает дополнительную защиту от аппаратной уязвимости Spectre v2. Программисты, работающие над ядром ОС Linux, встроили STIBP в версию ядра 4.19.2 и реализовали в версии 4.20, находящейся в разработке.\nSTIBP и производительность\n\nТорвальдс заявил, что STIBP крайне отрицательно влияет на производительность системы при использовании в ней технологий SMT/Hyper-Threading. В отдельных случаях производительность снижается на 50 %. Чтобы избежать снижения производительности, пользователям приходится отключать эти инструменты реализации одновременной многопоточности. Но отключение SMT/Hyper-Threading — один из способов защиты от атак типа Spectre v2. Таким образом необходимость в использовании STIBP оказывается под вопросом.\n\nТорвальдс отмечает, что обычно объектом атаки в системе рядового пользователя становятся браузеры, разработчики которых уже встроили необходимые модули защиты. Ссылаясь на это, программист считает практическую реализацию атаку Spectre v2 маловероятной.\n\nЛинус не предлагает полностью исключить STIBP из ядра ОС, а только оставить этот механизм отключённым по умолчанию, предоставив возможность пользователям самостоятельно принимать решения о целесообразности его использования.\nМнения других разработчиков\n\nСпециалисты компании Intel Арьян ван де Вен (Arjan van de Ven) и Тим Чен (Tim Chen) сообщили, что Intel и AMD тоже считают излишним применение STIBP по умолчанию. По их мнению, этот инструмент необходимо использовать только в критических случаях, например при явном запросе через prctl или для процессов, запрещающих создание core-дампов памяти.\n\nТестирование ядра Linux 4.20 показало, что падение производительности зависит от характера выполняемой задачи. Инго Молнар (Ingo Molnar), ещё один разработчик ядра ОС, предложил ввести правило, по которому новые защитные технологии в списках модификаций системы будут отображаться вместе с результатами тестирования их влияния на быстродействие.\n\nАтаки типа Spectre нацелены на аппаратную уязвимость современных процессоров, связанную с реализацией спекулятивных вычислений. При выборе защиты приходится балансировать между безопасностью и производительностью. Перекладывая решение о включении технологии STIBP на пользователей, Торвальдс предоставляет им возможность самим настроить этот баланс.\n\nВопрос производительности остаётся ключевым в разработке защиты спекулятивных вычислений. Исследователи из Лаборатории информатики и искусственного интеллекта (CSAIL) MIT, разработавшие систему DAWG, особо подчеркнули, что она меньше влияет на быстродействие, чем аналогичные инструменты.",
			"added": 1547791239
		},
		{
			"topic_id": 26,
			"title": "Ричард Столлман против Ubuntu",
			"body": "Embrace, Extend, Extinguish («Поддержать, расширить, уничтожить»). Как было установлено Министерством юстиции США, эта фраза использовалась в корпорации Microsoft, чтобы описать стратегию внедрения в отрасли ПО путём расширения их стандартов и дальнейшего использования этих отличий для получения преимущества и уничтожения оригинальных свободных версий. https://www.youtube.com/watch?v=eMzaz3Zpfkk",
			"added": 1547791357
		},
		{
			"topic_id": 27,
			"title": "Интервью с Ричардом Столлманом Richard Matthew Stallman",
			"body": "https://www.youtube.com/watch?v=WtvpCBPyyoU",
			"added": 1547791717
		},
		{
			"topic_id": 28,
			"title": "Клуб любителей даркнета",
			"body": "кто какими сетями пользуется отписываемся\nу меня эти\nдополню список\nScuttlebutt\nperfect dark 1.23\nemule\ndiaspora\nmastodon\npleroma",
			"added": 1547986513
		},
		{
			"topic_id": 29,
			"title": "Фейк ньюс StopFakeNews или как действующая власть себя защищает",
			"body": "Сначало в РФ заблокировали сайты с наркотиками\nПотом в РФ заблокировали торрент трекеры\nТеперь в РФ начали бороться с фейковыми новостями\n\nВот моя история я никогда не любил сайт вконтакте но однажды все таки от нехуй делать решил там регистрироваться и не успел заполнить свой профиль в вк как мне начали поступать предложения заработать то есть начать распространять клады это делалось явно автоматически за 40 минут пребывания в вк ко мне поступило около 10 таких предложений я ради прикола ответил на одно из них примерно так \n( я знаю что вы ебаное ФСБ и прикрываете жопу действующий власти пытаясь оправдать их действия по блокировкам и вакансия закладчика меня не интересует я собираюсь занятся синтезом чтоб меня не смог сдать поставщик ) и как не странно сообщения о предложении работы прекратились их нет уже год. уже начали сажать https://pravo.ru/court_report/view/86608/\n\nПро блокировку торрентов В РФ\nизначально торрент трекеры создавали талантливые люди в 2000 годах к 2014 году доход крупных торрент трекеров колибался от 1 до 20 миленов долоров в год все эти деньги уходили владельцам которые живут за границей и все деньги утекали туда в 2013 годах тупые путинские пидорасы узнали про этот прикольный бизнес и в РФ заблокировали все торрент трекеры походу путятишна откроет свой собственый говнотрекер для тупых пезд и будет собирать с них по сто рублей в месяц\n\nТеперь в РФ начали бороться с фейковыми новостями чтобы мы читали только подконтрольные властям сми и никакие другие чтоб люди поменьше знали\n\nя тут к чему виду во всех странах где люди много работают и мало получают Китай Россия и тд везде там заблокирован интернет чтоб люди меньше знали меньше играли и больше работали ЭТО ВОЙНА АНАЛЬНЫЙ ДЖИХАД за свободу интернета за свободу дрочьки поддерживайте пиринговые сети ,поддерживайте децентрализованные сети,раздавайте торренты,поддерживайте любые p2p программы если мы будем сопротивляться то борьба с нами станет настолько дорогой что они плюнут на это дело и интернет станет сново свободным",
			"added": 1548001766
		},
		{
			"topic_id": 30,
			"title": "Как поехать рожать в США Сколько стоят роды, жилье и оформление документов",
			"body": "В августе 2012 года я с мужем прилетела в Майами, чтобы родить ребенка, пожить здесь несколько месяцев и уехать обратно в Россию.\n\n\nМы поехали рожать в США, чтобы ребенок получил американское гражданство. В США гражданство дается по праву рождения, происхождение родителей не имеет значения. Главное, чтобы ребенок появился на свет на территории страны.\n\nРасскажу о своем опыте организации родов в США.\n\nВиза\n\nВизу мы получали, когда я была на седьмом месяце беременности. Я подавала документы на американскую визу впервые, мужу до этого уже один раз отказали. Мы боялись, что беременной паре визу не дадут.\n\nНа собеседовании я прикрыла живот широкой одеждой и папкой с документами. Собеседование проводится за стойкой через окно. Стойка высокая, и визовый офицер ниже груди вас не видит. В анкете на визу про беременность ничего не спрашивали, на собеседовании тоже.\n\nВизу нам одобрили с первого раза.\nПерелет\n\nВ США я летела на девятом месяце беременности. Перед перелетом брала справку от врача, что мне можно лететь на самолете. Справку никто не спросил, а беременных было еще полсамолета.\n\n8 грязных приемов, чтобы сэкономить на перелете\n\nПосле приземления нас ждал таможенный контроль. Мы снова испугались: а вдруг развернут? Потом только узнали, что в худшем случае задержали бы на таможне на пару часов. Некоторых наших знакомых задерживали и допрашивали, но всех отпустили.\nПогода\n\nС апреля по ноябрь в Майами жарко, с августа по октябрь — невыносимо жарко: +35 °C днем и +30 °C ночью, влажно как в бане. Если оставить пластиковую бутылку в машине на солнцепеке, она расплавится. Если плохо переносите жару, лучше поехать в другой город.\n\nАренда жилья\n\nПрилететь, родить и сразу же улететь обратно не получится: придется прожить в Майами несколько месяцев. Это время нужно для подготовки к родам, восстановления и бюрократических процедур. Готовьтесь провести в США до полугода.\n\nВ Майами живет много русских. Больше всего их в районах Санни-Айлс, Халландейл, Авентура. Снимайте жилье в этих районах, если хотите быть поближе к соотечественникам и русскоязычной инфраструктуре. Там сможете ходить в русские магазины, салоны красоты, работать с русскоязычными риелторами, нянями и врачами.\n\nЗа двухкомнатную квартиру в Майами просят от 1500 до 3000 долларов в месяц. Чем ближе к океану, тем дороже. В некоторых случаях администрация здания не разрешает беременной паре снимать двухкомнатную квартиру: вас почти трое — ребенку нужно иметь отдельную спальню.\n\nКвартиру в США обычно арендуют вместе с профессиональным риелтором. У риелторов есть лицензия, они пользуются закрытой базой недвижимости. Услуги риелтора для арендатора бесплатны, за них платит владелец жилья.\n\nЛучше всего связаться с риелтором заранее, еще в России. К вашему приезду он подберет несколько вариантов — вы посмотрите их лично и выберете подходящую квартиру.\n\nРиелторов ищите по запросу «Russian Real estate Sunny Isles Florida».\n\nВ Майами принято торговаться за аренду. Хозяин просит за жилье 2300 $, а вы предлагайте снять за 1800. Он откажется, а вы предложите 1850. Хороший риелтор поможет в торге.\n\nКогда вы с хозяином ударите по рукам, начнется подготовка документов. Владельцы недвижимости обычно просят предоставить выписку со счёта и свидетельство о браке. В выписке нужно иметь 5000—6000 $, свидетельство следует перевести (это легко сделают прямо в Майами местные русскоязычные юристы). За проверку документов просят 100 $, процесс длится до 10 дней. Бояться проверки не нужно, это формальная процедура.\n\nЯ не советую снимать квартиру дистанционно. На фотографии жилье будет классным, а на деле обнаружатся проблемы: неприятный запах или плесень по углам.\n\nАренду обычно платят вперед. Заселяетесь на полгода — платите 12 000 $. Еще вносят два месячных депозита: один хозяину, второй для менеджера здания. Депозиты возвращают после выселения.\n\nТеоретически квартиру можно снять на «Эйр-би-эн-би», но там выбор меньше. Не арендуйте квартиру напрямую, без договора: есть риск нарваться на мошенников.\n\nКак снять квартиру на Airbnb\nВрач и госпиталь\n\nВ США рожают не в роддоме, а в госпитале, под присмотром личного врача. С госпиталем и врачом заключают отдельные договоры на медицинское обслуживание.\n\nВрач. Мы искали русскоговорящего врача, подешевле. Съездили на пробный прием к нескольким и выбрали того, кто понравился. Врач посоветует госпиталь, в котором вы будете рожать.\n\nВрачу платят за роды 5000 $, еще 1000 $ — за анестезию.\n\nКогда поедете знакомиться с врачом, обращайте внимание на его коллег. Может случиться так, что во время ваших родов доктор будет занят, тогда его подменят коллеги.\n\nВ договор с врачом обычно входит два приема до родов, непосредственно роды и один прием после них. Уточните, что вы рассчитываете на минимальный пакет услуг, иначе вам добавят кучу ненужных анализов, а после предъявят счет на 10 000 $. Договоритесь, что все дополнительные услуги вы будете обсуждать до их оказания.\n\nГлавное правило юридической грамотности\n\nСначала читать, потом подписывать\n\nГоспиталь. Средняя стоимость родов в госпитале — 3500—4000 $. В эту стоимость входят роды и 48 часов пребывания в палате. Каждые дополнительные сутки обойдутся в 1000 $.\n\nАмериканские госпитали выглядят потрясающе. Роженице выделяют отдельную палату с туалетом, душем, диваном для посетителей, телевизором и кроватью, в ручки которой встроен пульт управления: можно регулировать положение кровати, выключать свет, вызывать персонал. Медсестры тут улыбчивые и милые, потому что получают за работу 30—50 $ в час. Это много даже по американским меркам.\n\nРодильный дом. Кроме госпиталей в США есть родильные дома. Это маленькие частные больницы для родов, оборудования в них минимум. Роды в родильном доме стоят 4500 $.\n\nРодильные дома подходят для родов без осложнений и рисков. Если случится экстренная ситуация в родильном доме, роженицу повезут в обычный госпиталь, где есть всё для спасения. За это потом выставят отдельный счет.\nРоды\n\nВрачи в США часто сами назначают дату и время родов. В этот день беременную стимулируют с помощью специального препарата, от которого начинаются схватки. Через час, когда схватки сильные, но боль еще терпимая, врачи делают анестезию. Еще через пару часов происходят непосредственно роды. Это снижает риск для роженицы, но повышает риск для ребенка. Мы договорились с врачом, чтобы роды были естественными. На это соглашаются не все врачи.\n\nВ госпитале первым делом вы заполняете анкету. После роженицу переодевают в халат и отводят в помещение для родов. Сразу навешивают датчики на живот и палец. Ставят капельницу, пить и есть не дают, разрешают только сосать лед — всё как в сериале «Друзья». Муж находится рядом и отвечает на вопросы про дополнительные анализы. При необходимости сотрудники бесплатно звонят переводчику.\n\nЯ заранее решила, что не буду использовать анестезию. Думала, что сама справлюсь и заодно сэкономлю 1000 $, но не тут-то было. Боль была такая сильная, что я всё-таки попросила обезболить меня. Врач позвал анестезиологов. Они пришли и долго вспоминали, что знают о России, смотрели на Хрущева с Горбачевым на экране медицинского монитора. От неторопливых врачей в Штатах тоже никто не застрахован.\n\nАнглийский я понимала с трудом, но проблем с этим не испытывала. Если я переспрашивала, мне терпеливо объясняли всё по несколько раз.\n\nКогда родился ребенок, в первую очередь его дали мне, а не унесли мыть и пеленать. Все умилялись, говорили, какой он хорошенький, и поздравляли меня. Потом медсестра перевезла меня на кресле в палату. Мы были в одноместной палате, муж ночевал в ней же на диване.\nВ палату всё время кто-то приходит. Медсестры, врачи и практиканты каждый час отслеживают состояние ребенка. Фотограф предлагает провести фотосессию для новорожденного прямо в палате. Представитель социальных служб интересуется условиями жизни новоявленного американского гражданина. Еще приходит специалист по грудному вскармливанию, педиатры, уборщицы, медсестры приносят питание в номер — и заново по кругу. Чтобы поспать, я выставила мужа часовым: он просил пришедших зайти попозже.\n\nПитание в госпитале может удивить — это типичные американские гамбургеры, картошка фри и кока-кола. Но, к счастью, есть и альтернатива.\n\nВ госпитале вы сразу заполняете бумаги, чтобы потом получить свидетельство о рождении.\nЕще одна деталь: при выписке нужно обязательно иметь автокресло, иначе персонал просто не выпустит вас с ребенком из госпиталя.\nБез отчества\n\nВ американском свидетельстве о рождении отчество ребенка записывается в графе Middle Name. Мы этого не знали и написали только имя в First Name и фамилию в Second Name. Теперь у нас ребенок без отчества даже в русских документах (они делаются по американским). Это печалит моего мужа.\nПосле родов\n\nПосле выписки из госпиталя новорожденного нужно несколько раз показать педиатру. В госпитале вам помогут выбрать педиатра и запишут на прием. Мы искали русскоязычного. Пять лет назад выбранный нами педиатр был чуть ли не единственным русскоязычным врачом в Майами. Сейчас их несколько, но наш всё равно самый востребованный. Он принимает в детской поликлинике при госпитале в Авентуре.\n\nНа дом врача вызвать нельзя — нужно приезжать самим, даже если у новорожденного температура. На дом вызывают только неотложку по телефону 911.\n\nПервый раз педиатр принимает ребенка через сутки после родов. Потом надо будет прийти на прием еще несколько раз в ближайшие пару месяцев. Педиатр берет 100 $ за прием. Посещать его обязательно, иначе вами заинтересуется полиция. Вы родили гражданина США, и власти заботятся о нем.\n100 $\n\nстоит прием у педиатра\n\nНо в отличие от России в США нет обязательных к посещению врачей кроме педиатра. Если у ребенка всё в порядке, никто не заставит ходить еще к лору и невропатологу и выискивать какие-то проблемы. Про местных педиатров шутят, что они принимают так: «У ребенка десять пальцев на руках, есть голова? Он здоров, следующий!»\n\nМагазины и детские вещи\n\nПрежде чем покупать детские вещи, посмотрите в русскоязычных группах в фейсбуке (например в «Барахолке Майами»). Русские мамы рожают и уезжают, а вещи, которые не могут увезти с собой, продают или даже отдают бесплатно.\n\nСколько стоит ребенок\nв первый год\n\nЕще детские вещи распродают в стоковых магазинах: «Бирлингтон», «Росс», «Ти-джей-макс». Платье «Кельвин Кляйн» там можно найти за 30 $ вместо обычных 100. В супермаркете «Волмарт» большой детский отдел с подгузниками, смесями, игрушками. Супермаркет подороже — «Пабликс». Самый дорогой, но зато с экологически чистыми продуктами — «Хол-фудс», там всё в два-три раза дороже.\nВещи можно вернуть\n\nВ Америке все вещи можно вернуть в магазин в течение месяца, а коляску — в течение трех месяцев. Где-то возвращают деньги, где-то меняют на другие товары на ту же сумму. Сохраняйте все чеки и бирки. Мы три месяца проходили с коляской, которая нам не нравилась, и в последний день поменяли ее на другую.\nДокументы\n\nРебенку сначала делают американские документы, потом российские.\n50 $\n\nстоит свидетельство о рождении\n\nАмериканский паспорт. В госпитале вам выдадут свидетельство о рождении. Оно стоит 50 $. Советуем взять два экземпляра, на всякий случай.\n\nЗатем делается американский паспорт. Нужно сходить в ближайшее почтовое отделение и заполнить анкету. К анкете приложите свидетельство о рождении, фотографию ребенка, загранпаспорта родителей и чек на 80 $. Паспорт сделают за 6 недель или за 4 недели, если доплатите еще 40 $.\n\nКогда ребенку исполнится 21 год, родители смогут подать заявление в иммиграционную службу и тоже получить гражданство США.\n\nРоссийский паспорт. Чтобы улететь в Россию, ребенку нужно либо оформить российскую визу в американский паспорт, либо сделать загран. Мы сделали заграничный паспорт.\n\nСначала мы отправили в государственные органы свидетельство о рождении, где к нему выдали апостиль — это документ, который делает свидетельство международным. На это потребовалась неделя. Потом мы перевели свидетельство о рождении и апостиль на русский язык и заверили у нотариуса, это стоило 250 $.\n\nПосле этого мы собрали два пакета документов: на прием ребенка в гражданство и на выдачу ему загранпаспорта. Записались на прием в российское посольство в Вашингтоне. В посольство пришлось летать дважды: на подачу документов и на получение паспорта. Паспорт сделали за месяц.\nВ Майами есть агентства, которые оформляют документы сами, и летать никуда не придется. Их услуги стоят от 1000 $.\nСколько стоят роды в США\n\nМы посчитали, сколько в среднем стоят роды в США. Представим, что пробыли бы в Америке 3 месяца и роды прошли без осложнений. Цены — средние.\nБюджет на роды в Майами\nТрата\tЦена\nБилеты туда-обратно\t1200 $\nАренда квартиры\t5400 $\nРоды\t6000 $\nГоспиталь\t4000 $\nПедиатр\t550 $\nДетские товары\t800 $\nАренда автомобиля\t400 $\nЕда\t1500 $\nОформление документов\t650 $\nИтого\t20 500 $\nЗапомнить\n\n    Если решите рожать в Майами, планируйте беременность так, чтобы роды пришлись на зиму. Зимой в Майами не так жарко.\n    Найдите риелтора и отберите несколько вариантов квартиры еще в России. Не снимайте жилье без договора.\n    Выберите русскоязычного врача, который будет принимать роды.\n    Лучше рожать в госпитале, так безопаснее.\n    Ищите недорогие детские товары в русскоязычных группах в фейсбуке.\n    Сразу после родов оформляйте документы: сначала на американский паспорт, потом на российский.",
			"added": 1548054164
		},
		{
			"topic_id": 31,
			"title": "не все децентрализованные сети хороши",
			"body": "Концепция федерации очень похожа на окукливание ( разделяй и властвуй )\n\nEmbrace, Extend, Extinguish («Поддержать, расширить, уничтожить»). Как было установлено Министерством юстиции США, эта фраза использовалась в корпорации Microsoft, чтобы описать стратегию внедрения в отрасли ПО путём расширения их стандартов и дальнейшего использования этих отличий для получения преимущества и уничтожения оригинальных свободных версий. Думаю вы поняли\n\nобсуждаем дерьмовые p2p сети которые созданы чтоб окукливаться",
			"added": 1548062748
		},
		{
			"topic_id": 32,
			"title": "Пиратский туман Крысы на борту Rats on The Boat - BitTorrent search engine",
			"body": "“Крысы на борту” - торрент поисковик собирающий статистическую информацию о торрентах не используя торрент-трекеры и дающих возможность обеспечить поиск по торрентам (и отдельным файлам в них) даже если все трекеры заблокируют в будущем. поиск фактически снимает ограничение вашей торрент-базы и даже новый участник будет иметь возможность искать среди тысяч и миллионов чужих торрентов.\n\nРаботает через p2p торрент сеть, не требует никаких трекеров\nПоддерживает собственный протокол P2P для дополнительной передачи данных (например, поиск между клиентами крысы, передача описаний / голосов и т. Д.)\nПоиск по торрент-коллекции\nТоррент и поиск файлов\nПоисковые фильтры (диапазоны размеров, файлы, сеялки и т.д …)\nФильтры коллекции (фильтры регулярных выражений, фильтры для взрослых)\nПоддерживается сканирование пиров трекеров\nИнтегрированный торрент-клиент\nСобирайте только статистическую информацию и не сохраняйте внутренние данные торрентов.\nПоддерживает рейтинг торрентов (голосование)\nПротокол P2P-поиска. Поиск в других клиентах Rats.\nВеб-версия (веб-интерфейс) для серверов\nТоп-лист (в основном распространенные и популярные торренты)\nСписок каналов (канал активности клиентов Rats)\nПереводы: английский, русский, украинский, китайский\nПеретаскивание торрентов (расширение локальной поисковой базы с помощью специальных торрентов)\nОписания ассоциаций от трекеров\n\nВнимание самая стабильная версия по ка что это 1.0.0 а вот версия v1.1.0 глючьная\nhttps://github.com/DEgITx/rats-search/releases/\nlinux https://github.com/DEgITx/rats-search/releases/download/v1.0.0/rats-search-1.0.0-x86_64.AppImage",
			"added": 1548139841
		},
		{
			"topic_id": 33,
			"title": "Патрик Стюарт вернётся к роли Пикара в новом сериале по «Звёздному пути»",
			"body": "Пару месяцев назад стало известно, что канал CBS работает над четырьмя новыми сериалами по вселенной «Звёздного пути», и это не считая уже идущего «Дискавери». Как оказалось, главной звездой одного из готовящихся шоу станет не кто иной, как сэр Патрик Стюарт: он вернётся к роли капитана Пикара.\nСериал расскажет о следующей главе в жизни капитана «Следующего поколения» спустя двадцать лет после событий фильма «Возмездие» (2002). Как признаётся 78-летний английский актёр, возвращение к культовой роли стало для него приятным сюрпризом, «зарядившим» энергией.\nТворческую команду нового сериала возглавил Алекс Куртцман — шоураннер «Дискавери» и исполнительный продюсер двух фильмов Дж. Дж. Абрамса по вселенной «Звёздного пути». Помимо этого, над безымянным шоу работает Род Родденберри, сын создателя Star Trek Джина Родденберри.\nНеизвестным остаётся лишь дата премьеры сериала, а также имена других актёров, что появятся на малом экране вместе с Патриком Стюартом.",
			"added": 1548329398
		},
		{
			"topic_id": 34,
			"title": "Раздавайте торренты пока не поздно сидируйте торренты поддерживайте p2p сети",
			"body": "И так к чему все это \n1-сначало заблокировали все торрент трекеры \n2-потом удалили их из поисковой выдачи\nтак вот когда активных пользователей торрент сетей  станет меньше то есть их будет меньшинство \nих начнут запугивать менты то есть будут приходить и изымать компьютеры на экспертизу и потом штраф так вот фишка в том если нас будет много то есть большинство хуй менты сунутся все будет как раньше они же не могут из каждый третей квартиры в стране вынести компьютер это скандал будет на грани госпереворота а вот если останется небольшая кучка любителей торрентов их просто зажмут так что Раздавайте торренты , поддерживайте p2p сети\n\nнедавно нашел очень перспективный децентрализованный  торрент поисковик Rats on The Boat\nhttps://github.com/DEgITx/rats-search/releases\nпользутесть поддерживайте расширяйте сеть пускай роскомнадзор вскукарекнет",
			"added": 1548488957
		},
		{
			"topic_id": 35,
			"title": "Как прикрутить Sphinx к zeronet",
			"body": "",
			"added": 1548822559
		},
		{
			"topic_id": 36,
			"title": "Как прикрутить yacy к zeronet",
			"body": "",
			"added": 1548823007
		},
		{
			"topic_id": 37,
			"title": "как хостить diaspora в Onion",
			"body": "",
			"added": 1548824214
		}
	],
	"topic_vote": {
		"20_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"19_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"18_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"17_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"16_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"15_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"14_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"13_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"12_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"11_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"10_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"9_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"8_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"7_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"6_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"5_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"4_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"3_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"2_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": 1,
		"1_1JN4Ck6cLfg81fNjkhDJMkkmKGwk3Dpih4": 1,
		"1_1BghwqwD4SJaigm7kQjxvgTyEdxZgzWhSS": 1,
		"1_1DkpXcpJ5YBXnDpHFYveSsdj1aCbeEULrg": 1,
		"1_1DJpRTbqpzgjWQQPyKgj9QtVxQHKkpXPMP": 1,
		"1_1BfSUGhNmbYZHDgLw67nu2b9LbbPne92Dz": 1,
		"1_1PT9pN8Cuw62Vvs95xKmHJNYgo86vFwVE3": 1,
		"7_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": 1,
		"1_16nkBHuqRkit6TnaEfuJiGi6UEJJ6eCzds": 1,
		"8_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"7_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"1_1Dw6LvgbshhRFV9XQgPCAkqTZCdK5V7ce1": 1,
		"1_1oyaErvT1Ww6RVeJvRkp5LgenBpdfws99": 1,
		"1_1789XcRxNBxCsCTWFhhGsbmjrmg4XX4QPL": 1,
		"3_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": 1,
		"2_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": 1,
		"2_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": 1,
		"1_1mGVkvn1kU9drvETUm8orvoBRppv4mNeQ": 1,
		"2_14QcoQB7PsuREm2aD9RK3KtrfxPv73qx6Z": 1,
		"1_1HjPcm98huSQdRkf5F1VQs4w8caUgq6eA": 1,
		"1_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY": 1,
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": 1,
		"1_16fnuygRfs9cJeBagTocMnZGtjLSCwPZjZ": 1,
		"2_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": 1,
		"2_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1,
		"7_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": 1,
		"10_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": 1,
		"1_12TkPLvsD5FecF8Xbv331qjcvbY6Dt9DFa": 1,
		"5_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": 1,
		"2_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": 1,
		"1_1BGconZDFECxudsuKsBnkXpX1iqKbUWMku": 1,
		"2_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD": 1,
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"2_1266Hr6Kd2eoa89F6FeAeKu21FZSwYjpPw": 1,
		"1_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": 1,
		"1_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": 1,
		"1_1KqSnsduv8iRCWBaLGF8Cz3XszuwHvEr74": 1,
		"1_1NL5YZdozXc6ZNzKm78H4SjSMabyzV16YX": 1,
		"1_1Ae4VAbPLC6ZzSEBoVBS76M8URVBJ9Fwqx": 1,
		"5_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"9_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"21_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": 1,
		"1_16xnUKegknnxfYJn3Lrj9pq62DHenkVDmQ": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"22_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"23_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"24_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"25_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"26_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"27_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"29_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"30_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"31_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"32_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": 1,
		"2_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": 1,
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"33_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"35_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"36_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"37_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1
	},
	"next_comment_id": 32,
	"comment": {
		"2_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 1,
				"body": "world of tanks",
				"added": 1547661342
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 2,
				"body": "у меня debian centos",
				"added": 1547661397
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 3,
				"body": "здравствуйте я вафлер",
				"added": 1547703210
			}
		],
		"7_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 4,
				"body": "купите у провайдера внешний айпи адрес и пробросить порты в роутере отключите фаирвол",
				"added": 1547708646
			}
		],
		"1_1GewTebNkbfbLPvb4ZJKSmRbuEqcRqJJZ4": [
			{
				"comment_id": 5,
				"body": "нет",
				"added": 1547708685
			}
		],
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": [
			{
				"comment_id": 6,
				"body": "FSF это международное сообщество а не национальное",
				"added": 1547708857
			},
			{
				"comment_id": 7,
				"body": "https://www.gnu.org/",
				"added": 1547708887
			}
		],
		"2_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": [
			{
				"comment_id": 8,
				"body": "https://www.wireguard.com/install/",
				"added": 1547708968
			},
			{
				"comment_id": 19,
				"body": "> [geobor](#comment_9_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz): ентож одна из технологий vpn?\n\nпробивает nat",
				"added": 1547986556
			}
		],
		"1_1mGVkvn1kU9drvETUm8orvoBRppv4mNeQ": [
			{
				"comment_id": 9,
				"body": "нехуя небезопасно года три назад я занимался тем что шифровал выделенные сервера организаций через\n ( RDP ) И ВЫМОГАЛ С НИХ ДЕНЬГИ ЗА РАСШИФРОВКУ ФАЙЛОВ по 20 -30 к сам часто покупал левые симки без паспорта делал я это не один раз а много много раз покупал сим карты на авито у разных поставщиков и вот в чем первый прикол каждый раз при покупке сим карты место встречи в таком месте где дохуя камер первые покупки были в метро ну думаю хуй да с ним чувак просто боится и выбирает людные места второй поставщик продавал у своего поезда на котором стояла камера в третий раз покупал в переходе что не покупка сим карты то палево ебалика на камеру вывод эти ребята работают по инструкции мусоров иначе хуй бы им кто разрешил продавать сим карты без паспорта \n\nвторой нюанс если вы вставляете любую сим карту в любой даже самый старый телефон хоть на секунду то местоположение определяется и на карте у фсб записывается лог то есть фсб видео где включался телефон поэтому смс принимайте в другом районе города подальше от места проживания а еще лучше используйте криптовалюты вставки их не зря придумали в qiwi и яндексе деньги могут заблокировать а в крипте некогда",
				"added": 1547709901
			}
		],
		"1_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY": [
			{
				"comment_id": 10,
				"body": "лутьшие средства обхода\nemule\nperfect dark 1.23\nTor\nZeroNet\nPatchwork",
				"added": 1547710213
			}
		],
		"5_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb": [
			{
				"comment_id": 11,
				"body": "Tor",
				"added": 1547710246
			}
		],
		"7_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 12,
				"body": "та где нет цензуры",
				"added": 1547710368
			}
		],
		"1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": [
			{
				"comment_id": 13,
				"body": "Ему нужно было арендовать забугром VPS/VDS ЗА 250 рублей в месяц и там хостить ноду",
				"added": 1547710590
			}
		],
		"1_1KqSnsduv8iRCWBaLGF8Cz3XszuwHvEr74": [
			{
				"comment_id": 14,
				"body": "касперский это анальный зонд от фсб",
				"added": 1547710760
			}
		],
		"18_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 15,
				"body": "> [deliriumgoddesss](#comment_10_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): не пашет. Писал в поддержку, сказали ждать фиксов\n\nвроде все работает pub сервера тут https://github.com/ssbc/ssb-server/wiki/Pub-Servers",
				"added": 1547755428
			},
			{
				"comment_id": 24,
				"body": "> [deliriumgoddesss](#comment_13_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): вот что пишет http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/data/users/17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ/Screenshot_2019-01-18-19-53-13-133_se_manyver.png\n\nна второй телефон установи тоже сразу поймешь",
				"added": 1548327468
			}
		],
		"22_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 16,
				"body": "да нет не всем",
				"added": 1547785688
			}
		],
		"9_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 17,
				"body": "На сайтах разработчиков есть донатные счета",
				"added": 1547879471
			}
		],
		"24_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 18,
				"body": "> [dude](#comment_68_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Operating system    WindowsLicense    Closed sourceПерспективная, ага :)\n\nу меня все работает",
				"added": 1547986451
			},
			{
				"comment_id": 22,
				"body": "> [doblaeb](#comment_2_1CzLZRKeoZVeSPD6FQoJ3pKbPg5ETQDoPJ): Последнее обновление в 2015Запрет на пиратский контентДа ООООчень перспективная сеть\n\nтам вообще какие либо запреты отсутствуют",
				"added": 1548277481
			}
		],
		"1_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 20,
				"body": "щас много децентрализованных сетей многие ушли в другие",
				"added": 1548021103
			}
		],
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 21,
				"body": "дв все верно мейл ру , яндекс,касперский, фсб ,ПАВЕЛ  ДУРОВ все они пидорасы",
				"added": 1548177603
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 23,
				"body": "с чего вы взяли что умер может просто сел ? да в праздники в больницу лучше не попадать",
				"added": 1548325286
			}
		],
		"2_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 25,
				"body": "Качаеш Rats on The Boat и никакие трекеры не нужны\nhttps://github.com/DEgITx/rats-search/releases",
				"added": 1548327774
			}
		],
		"11_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 26,
				"body": "если не из россии то боятся нечего чтоб тебя трахнуть нужно взаимодействие ген-прокуратуры двух стран на это никто не придет",
				"added": 1548328177
			}
		],
		"3_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": [
			{
				"comment_id": 27,
				"body": "сироп это сахар можно",
				"added": 1548328364
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 28,
				"body": "в китаи мыслящие люди спокойно юзают интернет нужно только знать софт просто это небольшая кучка людей даже китаю не удалось полностью заблокировать",
				"added": 1548328694
			}
		],
		"1_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px": [
			{
				"comment_id": 29,
				"body": "RDP SSH",
				"added": 1548328748
			}
		],
		"16_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 30,
				"body": "где изменен лимит ?",
				"added": 1548582498
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 31,
				"body": "1-в zeronet нет поддержки dht\n2-невозможно загрузить фото\n3-сама программа написана на python и вряд ли тут когда нибудь будет поддержка dht\nzeronet сеть бесперспективная да и сайты в классическом его понимании это эволюционный тупик и самое главное здесь нет нормального поиска\n\nесть сеть под названием Twister там есть поддержка dht написана на c++ все серьезно но есть одно сраное НО там сильные ограничения на размер поста всего 300 символов если не ошибаюсь тоже нет нормального поиска\n\nкороче все эти сети сделаны таким образом чтоб раскидать юзеров по разным углам и чтоб ты там кукарекал но некто тебя там не услышал https://www.youtube.com/watch?v=z6fVqpidvmU \n\nчтоб найти что то полезное в этих ебучих сетя нужно просматривать все это вырвиглазное вручьную целый день а если сайто будет больше то и ненайдет вовсе\n\nКонцепция федерации очень похожа на окукливание ( разделяй и властвуй )\n\nне все децентрализованные сети хороши\nEmbrace, Extend, Extinguish («Поддержать, расширить, уничтожить»). Как было установлено Министерством юстиции США, эта фраза использовалась в корпорации Microsoft, чтобы описать стратегию внедрения в отрасли ПО путём расширения их стандартов и дальнейшего использования этих отличий для получения преимущества и уничтожения оригинальных свободных версий. Думаю вы поняли",
				"added": 1548790222
			}
		]
	},
	"comment_vote": {
		"11_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"9_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"14_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"21_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"22_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo": 1,
		"21_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo": 1,
		"23_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"8_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp": 1,
		"5_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"12_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": 1,
		"1_1F4oxgYUoS5TYCgRahBQmzriDSrDhbsMYc": 1,
		"2_1638vBEtAaRwFQpLUCwSaufp43MT6tbmYG": 1,
		"10_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"31_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1
	}
}