{
	"posts": [
		{
			"id": "ebc75735-4d09-4be0-bf64-d83b1cb75318",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": "I'm split on whether to begin working on a proof of work system to have anonymous posting by default. Is it even worth it? Would it cause the number of users to increase in any meaningful way? Heck, I'm not even sure the admin is still alive. He hasn't posted at all the last couple of days. **The good die young.**",
			"time": 1566866427300,
			"files": "[]",
			"last_edited": 1566866499300,
			"subject": null,
			"capcode": null
		},
		{
			"id": "94edda54-f61b-4410-96ed-e46b42d61c73",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>ce075196-8de8-440a-937d-c5fd50c26342\nNah, I mean actual anonymity **without making it too easy for spambots to do their job**. If we just disable the names like the retards are asking for I'm sure it will backfire and people are going to talk about how the glownigger CIA honeypot tells people they're anonymous while logging everything they do behind their backs.",
			"time": 1566866818982,
			"files": "[]",
			"last_edited": 1566866857082,
			"subject": null,
			"capcode": null
		},
		{
			"id": "7c5f2c25-e40b-4eb0-bece-5a56e3a67982",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": "What should probably be done first though is tell people they need a ZeroID rather than the 0 byte thing that pops up now, and maybe warning people who are posting with one of the original whitelisted IDs that they should get a ZeroID.",
			"time": 1566867171782,
			"files": "[]"
		},
		{
			"id": "ded8856f-9e20-4067-ba83-4d9691e1c5d5",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "e89f8927-4880-4cff-a254-b9110551b72e",
			"body": ">>8c8a0865-fc8e-4a4d-9415-ca4c0d310ae7\nYou need to rename users.json and restart ZeroNet, then create a new ZeroID and switch to it. IDs like the one you are using now can't be created anymore, the function was disabled because of spam.\nThere's a script to automatically create ZeroIDs for you, but it currently only works on Linux.",
			"time": 1566867380559,
			"files": "[]",
			"last_edited": 1566867426559,
			"subject": null,
			"capcode": null
		},
		{
			"id": "2c904c54-7309-42fd-a144-d1415acfc648",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": "I guess I could also port my script to Windows and give it a Tk GUI, but I'm afraid few people will bother even then.\n\n>>578af4ce-e67c-4eec-beba-88aac2df531b\n>The issue I see with PoW certs is scalability.\n>I don't see how it can be implemented while being fair to every (or at least most) possible device.\n>If it's too hard most people won't have the patience to generate it.\n>If it's too easy than any non-retard spammer will be able to fuck your shit up.\nWhat could be done is generating them in the background. What is the maximum a user posts here, 10 times per day? So suppose you generate them in the background throttling the generation at approximately 10% CPU usage (I'm sure there's some way to get approximate CPU usage in javascript, maybe by measuring how long an operation takes to complete at any given moment vs the fastest it has been observed to complete). Then when a user wants to post all they have to do is spend a few of those tickets the software has been generating for them in the background as long as they leave the zite open on some tab.\nAnother thing that could be done is to use custom certificates, as I've tried to convince you it's possible to do.\nThink for a second. What is a proof of work? It's basically a number or string that you can show to other people to prove you are a legit user. This is not too different from a digital certificate, which is basically a special kind of digital signature that signs a public key (or its hash) along with an username, as an endorsement of that public key belonging to the name it claims to belong to. And a digital signature is also a number or a string.\nSo if you can make a proof of work system without requiring ZeroNet's cooperation, you can also make a custom CA work.\nYou just need to create a new self-signed auth_address with createCert() before every post, and then have the web browser send that auth_address to your CA server through the clearnet. If the request comes from a non-blacklisted IP, the server sends back a signature endorsing that auth_address as not being a spammer (in this case the username is irrelevant, you can just leave that field blank or take it into account to make tripfagging possible). Then other clients scan the data.json for a valid signature in some pre-specified node of the json, and if it's not present the user is muted and no more data is accepted from that user. Bam, you just implemented a CA without needing ZeroNet to replace CA provided certs at the ZeroNet level, because for all ZeroNet cares it's just another self-signed certificate, the custom CA system is implemented completely outside the official ZeroNet provided CA system.",
			"time": 1566868719182,
			"files": "[]"
		},
		{
			"id": "77cca1ba-862d-431e-bc11-7bc96052949d",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>626824c9-0f16-46f1-93fd-a297bd69922c\nSure, but porting it takes effort and I did it primarily to use it myself. Still, porting it wouldn't be that hard. Giving it a GUI would take a little more effort. Not sure it'd be worth it vs working on the other many things this site needs.",
			"time": 1566870328800,
			"files": "[]",
			"last_edited": 1566870473700,
			"subject": null,
			"capcode": null
		},
		{
			"id": "641408b4-7d9d-4a4e-a14e-44ef7006d428",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>a9a04625-af0b-4a72-ab43-796ce7e1b489\nWell don't take it personally lol **I've probably said worse things about the admin and Millchan's developer.**\n>I do think actual anonymity -that did not require any action on the users end- would have a positive effect on the size of the user base here.\nMaybe I could do like the taylove fag does and distribute a modified client. Or an exe that patches an existing install and adds all the features I may come up with. After all p2p is supposed to be about giving the power back to the people and not depending on a centralized authority. Otherwise I'm sure eventually we're going to hit some other inherent ZeroNet limitation.",
			"time": 1566871857200,
			"files": "[]",
			"last_edited": 1566872889100,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}