{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1550754018,
			"title": "STAY AWAY FROM THE REGISTRATION REQUIRED SERVICES OF GOOGLE AND FACEBOOK!!!",
			"body": "Stay away from Gmail, You Tube, and other GOOGLE registration REQUIRED services! And Facebook too!\n\nThey can individually entertain you with no phone number. In vain for recovery email and other options! They won't let anyone else. We've tested a particular account in the field of view. Compared to other accounts. It can be shown that the goverment observed account it works differently!The recovery email does not accept the data you entered is in vain! Wait 1-3 hours for their colleague. With a phone number, a setting is made by them and played so that you can't go without it! They donot care the IP address and the browser. After every use of a user name / password pairs, he finds that we cannot identify you. He also rapes the phone in two-step identification. WITHOUT DOUBT CLEARLY CAN SEE THAT THE GOOGLE COPANY MAKE THIS SETUP WITH SOME OBSERVED ACCOUNTS.THIS IS  NO USER SETTING ISSUE OR SYSTEM FAILURE!There is another recovery options, but you still want to get the phone at all case! There is no way you would not try to force or reach it! As you delete your browser's history and enter the same browser with the same IP address the service no longer recognize the account. You need to let the phone call,SMS every time you log in and not delete your browser history by accident. The youtube is still rape off the phone again, because without it, it is useless! The whole system is based on how users can be identified. And not only the American but other foreign authorities,Google obey the clap,and they do everything for them.",
			"added": 1550754017
		},
		{
			"topic_id": 1580487512,
			"title": "Hardware backdoors",
			"body": "Do they exist, how they work and what threat to privacy are they?",
			"added": 1580487510
		},
		{
			"topic_id": 1586800582,
			"title": "Question to the chinese people/中国人,我有问题",
			"body": "How is the situation in your country? Some media claim it is still really bad and coronavirus is getting deadlier, but others say it is good. I don't know which one should I trust. Also, I heard claims that there is a lot racism to foreigners in China, that hospitals deny entrance for them. Is that true?\n\n你们国家的情况怎么样？一些媒体声称它仍然很糟糕，冠状病毒正在变得更加致命，但其他媒体说它是好的。我不知道该相信谁。还有，我听说在中国有很多对外国人的种族歧视，医院拒绝他们入境。是真的吗？\n\n对不起，我用翻译。",
			"added": 1586800579,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1587739208,
			"title": "How to delete all data on ZN that is stored on an old account I made?",
			"body": "I tried to delete data.json leaving content.json for cleaning itself on signing. However, my old posts are still visible. Am I doing it right?",
			"added": 1587739204
		},
		{
			"topic_id": 1587829097,
			"title": "How to redirect a certain object from a website to somewhere else?",
			"body": "Example situation: there is a web page with a javascript loaded from URL\nsomesite.xyz/script.js\nI want to make my browser load that page, but with script from /home/username/Desktop/folder/script.js instead. I don't want to change HTML or anything on the server. I want just to redirect that URL of js somewhere else when using firefox. \nI tried to set up privoxy, it worked good on HTTP sites, but it does not work on HTTPS.\nIs there any plugin or a program for that? It should work not only for js but also for txt, png, gif and more.",
			"added": 1587829092
		},
		{
			"topic_id": 1589055412,
			"title": "Why is privacy important?",
			"body": "Why should I care, if somebody knows what type of music I listen to or what websites I visit? If it is something to care about, what to do if that person knows much about me?",
			"added": 1589055406
		},
		{
			"topic_id": 1601047977,
			"title": "How to counter or sabotage facial recognition and AI learning in general?",
			"body": "I read there were some algorithms and tricks that could change a picture a bit and made it harder for AI to recognize. How something like that could be utilized to counter facial recognition used by cctv cameras? Maybe there are more effective ways to completely mess a training model?",
			"added": 1601047970
		}
	],
	"topic_vote": {
		"1587734994_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 1,
				"body": "```{\n  \"1MLTrdo4LXnqMmKs9ahSqVY9X7Y8Hk4B6j\": {\n    \"certs\": {\n      \"zeroid.bit\": {\n        \"auth_address\": \"1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R\", \n        \"auth_privatekey\": \"5KbPLmiR7raEpDjjxKvZYPxk8MF3S3WWdLhcu5rJCbb1WSXDn5T\", \n        \"auth_type\": \"web\", \n        \"auth_user_name\": \"shareduser\", \n        \"cert_sign\": \"HO7wbZbmvSTxr2SqWXTDhS/eDM9L4kIMqJHWiwseYFEugfFwHZAq1wPM0mQS63xL+cyZ16cYmaSic68u8MaeY7g=\"\n      }\n    }, \n    \"master_seed\": \"be1d20522e8741cf44395a82cd8a84db3bf1a61cca53d3b6a86efc4f454c1895\",```",
				"added": 1546053274
			}
		],
		"1570213999_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6": [
			{
				"comment_id": 2,
				"body": "isn't it a fork of tox?",
				"added": 1570285562
			}
		],
		"1570313405_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 3,
				"body": "The voice of people is the voice of nothing.",
				"added": 1570315227
			}
		],
		"1570756155_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 4,
				"body": "> [pussylicker](#comment_5_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P): How did y'all become Atheists?\n\nMy religious beliefs simply faded. I stopped going to church, went from theist to deist, then agnostic and i finally became an atheist.",
				"added": 1571176276
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 5,
				"body": "> [lumenwood119](#comment_5_1Hywym67BRyWThexTcfYNEPVMCkXFP4CwN): Daily reminder the Holocaust never happened!!! :^)\n\nWithout solid evidence your reminder make no sense at all.",
				"added": 1571851920
			}
		],
		"1571991991_18Qiw35UQuh8sSnqksUbQQh1SGaC3HaAxm": [
			{
				"comment_id": 6,
				"body": "you cant. You can only post links to images and it is up to you how you achieve that. For example put them on your website.",
				"added": 1572002560
			}
		],
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": [
			{
				"comment_id": 7,
				"body": "Is there any continuously updated CP blocklist with IDs of those suckers who upload this crap?",
				"added": 1572003073
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_1154_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You should report such content to Nofish. He will delete it ASAP. [...]\n\nI can easily avoid such content on nofishs sites like ZeroUP but what about others? I dont think he has enough power to do the same there.",
				"added": 1572079024
			}
		],
		"1576026161_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 9,
				"body": "> [falconixx](#comment_4_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu): did anyone use i2p to access zeronet?\n\nThere was a proxy on i2p for ZeroNet. That means it is possible to browse ZN with i2p. However, I have not heard about using i2p for ZN in way like tor is used.",
				"added": 1576184894
			}
		],
		"1579762565_17U5GzDuhL9qeWAyDZLNB1tguX8xX1hXUe": [
			{
				"comment_id": 10,
				"body": "funny thing that the internet, that is used to enslave those genz and millenials in their phones was not intended to be like that at the beginning.",
				"added": 1579818270
			}
		],
		"1586463960_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 11,
				"body": "what happened there?",
				"added": 1586794102
			}
		],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 12,
				"body": "> [pineapplehead](#comment_11_14wiApKP3aS8vQ3Ne7e8HW7ZzSykjHSHes): We don't have to imagine. It's already happening.\n\nWe are here, but most people still prefer centralized/binary software over free alternatives. Many people I know are using Discord/FB Messenger. That sucks.",
				"added": 1588517650
			}
		]
	},
	"comment_vote": {
		"274_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1145_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"33_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": 1,
		"6_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"8_1PxMvud9KvbqaSZnV4piygA6dFTASwapHY": 1
	}
}