{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1615805293,
			"title": "is the UNO/CCP trying to assassinate MBS?",
			"body": "defcon?",
			"added": 1615805292
		},
		{
			"topic_id": 1615806111,
			"title": "New Israel : IDF will eliminate all the israelis involed in pedogates worldwide or die",
			"body": "It's simple, the mossad wing and israelis or dual (even potential) civilians responsible for the rapes and child sexual exploitation of countless children in the west and in the east (former SU) have to be killed public, executed, by the IDF.\n\nOr Israel will be razed off the map, incuding the mosk. warfare unrestricted. \n\nchose jews.\n\nThe problem is that now the israelis constructed networks have been powned by the MSS... easy to do, btw. all 0day exploit will be harvested and used.\n\nof course this is not a conspiracy, contrary to what UNO/CCP controlled medias try to pretend.",
			"added": 1615806109
		},
		{
			"topic_id": 1615806455,
			"title": "If the CIA was setup by the DOD as a catch for all treasons and corruptions?",
			"body": "It would work perfectly, for example the mossad/mi6 join child rape combined would infect and infiltrate the CIA... the bait 101.\n\nThere is one thing I won't ever underestimate even in the worst days, is the american war culture...",
			"added": 1615806452
		}
	],
	"topic_vote": {},
	"next_comment_id": 46,
	"comment": {
		"1615799674_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 1,
				"body": "> [taarezameenpar](#comment_3_1RkMN2MuY7DSijeukcTdPNf2MRTVBChx7): Can't be downloaded, said no peers/\n\nEffectively, you are right ! The problem is that all the seeders are running on an old tor .onion address, meanwhile the latest version can't connect to it ! very easy to solve, just one of the seeders on the old tor .onion needs to update his tor config and it will sync... \n\nGreat find ! thanks for exposing it ! there is a network split...",
				"added": 1615804777
			},
			{
				"comment_id": 2,
				"body": "it's okay now, you should be able to sync :).",
				"added": 1615805025
			}
		],
		"1615805293_1GDKPE25cR59ZjSitNhm1KgDf4T2Fim8tz": [
			{
				"comment_id": 3,
				"body": "what they want beyond the usual looting pillaging and co (be ready to be shocked) they want gays commiting sodomy inside the kabah... or child sacrifices and co... their usual gig... lol. it's a side gig of course... control of makah, one world religion, gov , money , army etc etc... what are the mullahs seriously thinking about all this CCP/UNO crap? I mean did they betray their version of the faith?",
				"added": 1615805523
			}
		],
		"1615555101_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 4,
				"body": "> [zeroseed4](#comment_96_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Ovh contacted me today. The proxy Is Lost and they Will give me a new free vps within days...awaiting the new vps ti recreate the proxy\n\nDon't forget to join : http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/\n\nAt least in a really decentralized shared environment those failling can't happen. OVH should be held liable to have cut cost and not assured data redundancy.",
				"added": 1615806213
			}
		],
		"1615806455_1GDKPE25cR59ZjSitNhm1KgDf4T2Fim8tz": [
			{
				"comment_id": 5,
				"body": "I don't say america hadn't had serious defeat against real opponents, but in the end... \n\nI mean comparing the jew pedo crew to the Nazis, Imperial Japan, the Sunnah or SU is insulting to all !\n\nand as said, for PLA/MSS... kid play. level up.",
				"added": 1615806842
			},
			{
				"comment_id": 6,
				"body": "and the chance of the dod is just to have to resolve a pedocorrupt network having infected almost nothing, aka the removal of the band aid may look horrible for while, but it's not the end. However unremoved, even with the largest deadliest army in the world, it won't stand even a low skill player... like idf for example.\n\nyou think idf is a threat to PLA/MSS? lol... found > kill > next ! churning ! no fuss, they are so afraid, you can't imagine :). they believe in all their pumps and narrative, and then, they cross the WALL (border of china)... welcome to the silk webs...",
				"added": 1615806991
			},
			{
				"comment_id": 7,
				"body": "and my goal is clear regarding china, splitting the ccp originalists/nativists from the uno corruption wing of ccp. it won't take long once initiated. and yes, it's gonna, could be, extremely violent... but in the long run, PLA/MSS always win in CHINA !",
				"added": 1615807059
			},
			{
				"comment_id": 8,
				"body": "anyway, need to be renammed in or DoW(ar) or DoO(ffense) :) or my favorite : STORMFRONT.",
				"added": 1615807405
			},
			{
				"comment_id": 9,
				"body": "never again nation building, just nation razing.",
				"added": 1615807443
			},
			{
				"comment_id": 10,
				"body": "never occupation, only invasion !",
				"added": 1615807476
			}
		],
		"1615806111_1GDKPE25cR59ZjSitNhm1KgDf4T2Fim8tz": [
			{
				"comment_id": 11,
				"body": "For me, it's important to keep in mind that a lot of jews (israelis or not) would have never under any condition raped a child... or raped anyone, or cheated on their loved one. \n\nAs such it's a project similar to denazification, called depedofication in israel. there are two options (and a 3rd bonus one).\n\n1. israelis IDF/mossad/shinbeth do it themselves PUBLICLY aka not like the USS liberty cover up. good great ! forward. (marker : Ehud Barak)\n2. israelis close ranks with the pedos > invasion, occupation to clear the mess (:)) and execute the traitors / hunt them worldwide, 3 leave them\n3. bonus edition, mega bug with their vaxx program, autowiped. but it's in God's hand :) ! safest surest but I prefer 1 or 2... \n\nopinions?",
				"added": 1615808432
			},
			{
				"comment_id": 12,
				"body": "It was smart how they placed their agents in hollywood (weinstein and all his buddies, then expanded it to jayz and co) and the use of fiat central bank to bribes (combined with epstein pedogate ops) and get what they wanted... what I find a little bit sad, is the lack of coutner intelligence. In china we laugh at this crap ! it's so low iq and easy to counter (just killed the fallen... easy, there are many everyday)...\n\nthe problem is that it generate temptation to execute the Chinese World Order, take over the UNO to finally REUNIFY TAIWAN to the MAINLAND !\n\nand that's my whole, I don't believe that CCP will be able to resist the temptation of the CWO once executed to get Taiwan... and will become a global occupying power using the UNO / global agenda and western low iq and identity gov as proxies, and as such affect my life.\n\nand here we are at the core of the problem. I don't give a shit if the CCP is still traumatized by the corruption of the CCAS (Central administrative state) at the time of the opium war, in short, I am still with the Emperor, he was right, and so all had to collapse.\n\nit's a complex story this part, however pedogate, amateurish... not even classical banal, low skill, low iq... based on weakens and guilt, aka it wasn't mentionned for nothing the threat of \"chauvinism\" in the chinese constitution... biggest threat, they knew it !",
				"added": 1615809206
			},
			{
				"comment_id": 13,
				"body": "all of this, doesn't change my opinion, the good jews deserve their stupid homeland. and those who are bad jews, and who did bad things to the outer world, deserve to die, it's just the way to do it, where there are disagreement... peaceful and clean, israelis kill their own filths or the hard way... I would prefer the soft way but LOVE THE WARs !!!",
				"added": 1615809309
			},
			{
				"comment_id": 14,
				"body": "remember it's not about memory (or memory hole it) but to have the real complete real history of the usa ! that it ends or not is irrelevant. once upon a time, america went to the moon... .",
				"added": 1615809394
			},
			{
				"comment_id": 15,
				"body": "What's the funniest is the MSN... ahahahah... vs PLA/CCP/MSS information combine system? loooool,",
				"added": 1615809784
			},
			{
				"comment_id": 16,
				"body": "maybe I am not clear enough, I don't believe a second that CCP has surrendered to the UNO... I mean, look at those people at the UNO? they don't have the IQ, CCAS backing and information / moral / ethical / focus to even be able to compete... people don't understand how HARD china is. it's not a narrative country or culture, it's a reality one. just the joke of softpower... pfff... it's made inward ! it's the glorious china, backing and home of the troops ! you don't get it? you can't imagine that even... outter world? ultimate darkness, and they return, to the most beautiful and sensitive civilization on earth.\n\nso our little struggle? uno take over too easy too generating of blacklash worldwide, and damaging to chinese... yeah, I get it, they can always be wiped, but... I am not conforable with it. as such as I found it's stupid to want to impose any current way of life of china to the world (be it pre opening up, or feodal etc) as the foreigners won't be able to transition to the new models of the CCAS... embrassing constant systemic well though and deployed upgrades and evolution... now there are computers, but CCPs members have to take not, manually. I like that ! tradition and then they are back in the digital matrix :D.\n\nresiliance. and my problem is too this ressource waste on UNO, what the fuck if china helps, I don't want a UNO logo, the proud logo of china, nothing else. no cover, no decoy, or nothing at all :).\n\nand nothing would please the UNOers than to send chinese war culture against american war culture... it's a bad idea. for both side.\n\nso focus on restoring a rightful israel, by wiping the pedos and others who use it as a platform for bad deeds !",
				"added": 1615810214
			},
			{
				"comment_id": 17,
				"body": "and already against a liberated unrestricted dod the idf is wiped in sec... with pla it's just the time travel that is longer but the battle duration even shorter... both together against the demons of israel (the bad jews)... ahahhaha.",
				"added": 1615810264
			},
			{
				"comment_id": 18,
				"body": "like palestinians children at the gaza dmz, but the whole idf... :).",
				"added": 1615810278
			},
			{
				"comment_id": 19,
				"body": "hurry idf... tick tock :)",
				"added": 1615810294
			},
			{
				"comment_id": 20,
				"body": "and you force youtube to have the executions, at least for a while, can have the age limit, but it must go online. humilaited, ashamed, for ever, to never redo it again, and move forward ! or die.\n\nyou can pawn all the semits and others derivatives... PLA/MSS look at you like animals... believing in your crap? just lol... \n\nyou don't understand the power of the FLOW...\n\nwar flow china...",
				"added": 1615810404
			},
			{
				"comment_id": 21,
				"body": "one goal : winning.",
				"added": 1615810412
			},
			{
				"comment_id": 22,
				"body": "and all the rest we will write after :). in such splendid condition that your barbarians production couldn't even approach... it's not a civilization clash, it's inferirority pretending to be equal to what it can't reach even by narrative... just ... lol...",
				"added": 1615810481
			},
			{
				"comment_id": 23,
				"body": "it's all your moses play... the kid was stolen from the nile.\n(nile the life of egypt, to all it came, to all belong, to all is from, at least a the time).\nall.\nand so sending your child boating on the nile, is so normal... not current, not by all... big trust, but ultimatly without it, there is nothing, so all belongs to it !",
				"added": 1615810593
			},
			{
				"comment_id": 24,
				"body": "and all idf soldiers, can't even dream or imagine STORMFRONT china...",
				"added": 1615810640
			},
			{
				"comment_id": 25,
				"body": "and so to have corrupted the west for those virtual gainz deserve JUSTICE.\n\nWE WANT THEM DEAD. NOW. LINE UP AND EXECUTED. you know full well who it is, at least the officials...\ndo.\nor\ndie.",
				"added": 1615810709
			},
			{
				"comment_id": 26,
				"body": "and joined by pla we can guarantee you we see binary weapons as low tech...\nonly exponential ones... pfff. the rest. toys.",
				"added": 1615810769
			},
			{
				"comment_id": 27,
				"body": "so when you come with your 18m clean or those you control, same story... just a little bit more exceptional the victory is, with the more you bring to die.\n\nremember we don't care.\n\nfor real...\n\nmore is just bigger expo for us\n\nnothing else\n\nit change nothing to kill 18m or 4b. \n\nsame game, just a later stage :)",
				"added": 1615810854
			},
			{
				"comment_id": 28,
				"body": "so what will the dod do?",
				"added": 1615810908
			},
			{
				"comment_id": 29,
				"body": "> [zeronetuser77](#comment_25_1GDKPE25cR59ZjSitNhm1KgDf4T2Fim8tz): and so to have corrupted the west for those virtual gainz deserve JUSTICE. [...]\n\nand don't play the judge/legal deocy path... it's .mil speedy or death. ;),\n\nterrorists must die , GWoT ! what will the dod do... heheheh...\n\nremember, PLA/MSS watch :) always !",
				"added": 1615811043
			},
			{
				"comment_id": 30,
				"body": "and my opinion for dod is simple : Restore Honor and Dignity to DoD and America by bringing true justice to those american children and those worldwide who got exploited in this mossad/pedoscam. unrestricted war. we go where it leads, like the locusts, aka stormfront. \n\nwar in the flow :).\n\naka not some bullshit trial crap, it's war... act of war. not a civilian issue. and it's better. the victims don't need their moment in courts, to exposed, trashed and humiliated while reviving those wounds they carry, nope, just that if they wish they can see the moment those who hurt them having their life taken. if they wish. justice served. my way, not the scam way.\n\nact of war.",
				"added": 1615811174
			},
			{
				"comment_id": 31,
				"body": "at least AGTR-5 (USS Liberty) sailors were soldiers, navy, seamen (and NSA) aka DoD !",
				"added": 1615811366
			},
			{
				"comment_id": 32,
				"body": "and remember hasbara shit who covered for those pedos, you may be all in panick... ahahah already? wait for CHINA STORMFRONT... there you will experience life, at least once !",
				"added": 1615811531
			},
			{
				"comment_id": 33,
				"body": "I can't wait to have this little coast of the med sea redesigned, will go well with new south china (aka formerly known as australia) hyhyhy.",
				"added": 1615811608
			},
			{
				"comment_id": 34,
				"body": "because let's be clear, the relation with the romans is super old, of course, they spied for everything they wanted, but they were civilized... different, but there was a way to respect their ways... you know they had stuff too... interesting... and then there was the papal edict on lending, the take over of england and the war began... curious, isn't it? not to me.",
				"added": 1615811751
			},
			{
				"comment_id": 35,
				"body": "then I can add the writing of Aleksandr Solzhenitsyn... you know the red army... stalingrad... what ever the real reason for this conflagration, it was real war.... you can't imagine when it will fall on your little estate idf... the deceit, lies and narrative greek model, collapse always against the real \"cultists\" of war !",
				"added": 1615811847
			},
			{
				"comment_id": 36,
				"body": "how funny how the dates with the first opium war coHencide... lol. \n\nwhat is the opinion of the renegade on all this show (taiwan armed forces)?\n\nI bet taiwanese force smash idf... easy. maybe not at the first battles :)",
				"added": 1615812054
			},
			{
				"comment_id": 37,
				"body": "another plan is to use iran as a proxy to achieve the goal...",
				"added": 1615812127
			},
			{
				"comment_id": 38,
				"body": "But I always prefer direct confrontation. it's smoother, faster, no need to have third parties... straight victories.",
				"added": 1615812155
			},
			{
				"comment_id": 39,
				"body": "to take an example, and rewind to my history point : I have no problem that werhner was nazi, he wasn't born one, you can't and I beleive (?) when he died he was american and very proud of himself ! the moon ! \n\nby contrast henry kissinger may have been born \"american\" but was never one, and will die like epstein and maxwell and cohen as a jew, first and foremost, which they associate now with the state of israel.\n\nall chinese soldiers will die as chineses. 1st and only. not even a discussion, even the renegades.",
				"added": 1615812302
			},
			{
				"comment_id": 40,
				"body": "Furthermore \"Westwood One\", is for me one of the prime vector used by the israelipedos to cloak their rape : Levin, Shapiro, Bonghino... are among those I consider as DE.\n\nI am curious regarding alexjones, is it only Kelly or was/is there another branch there?\n\ntime will tell... \n\nI can't imagine the pressure the pedoisreali central banking cornerning state put on anyone opposing their diktat.\n\nWhat is funny is that their deceits and lies have weakened so much the combat structure and culture of the usa... \n\nmy final opinion is that it's easier to clean this mess in a time of relative peace, than to be smashed in war...\n\nremember it's easy to censor me, or anyone sharing infos on this like alan green but you know, censoring PLA/CCP/MSS... many have tried :). (censor = lie, deceit, try to silence, etc).",
				"added": 1615817232
			},
			{
				"comment_id": 41,
				"body": "Israeli Police State Medical Tyranny is the Model for Globalist Great Reset\nhttps://www.banned.video/watch?id=604fbe33dd5caf458aee03ad\nIlana Rachel Daniel joins Alex Jones to break down how the police state in Israel is the model for medical tyranny enforcement around the world.\n\nImpressive videos of Haredims trying to defend their liberties... they should have Uzis and AR15, little girls of the nazipolicestate (national socialist following ANY order given to them) would be less... arrogant.\nyou can always go to their homes later and kill them and their children and even force feed them their whole family before shoting them.\njust no rape policy\nthank you.",
				"added": 1615870866
			},
			{
				"comment_id": 42,
				"body": "Are those nazi police shin beth? I don't know it works there. maybe someone knows? we know already some in mossad came to the west and organized childrape to blackmails westerners.\n\nidf? shinbet involved in one, both or none?\n\nit just a question before the mrvs deploy with the whole abms hacked.\n\nanother funny word is \"saturation\"... I like the term \"black sky\". it's a classical :).",
				"added": 1615871031
			}
		],
		"1615869992_1EFczXC2qdKix14Dr4EZ7WaxFC65u4K3ie": [
			{
				"comment_id": 43,
				"body": "finally someone gets it ! pedoprotectors etc. but you know americans compared to haremdims have small dicks, that why they use blue pills to rape kids.",
				"added": 1615871081
			},
			{
				"comment_id": 44,
				"body": "when you think about it, the americans should learn from the talibans, on how to be men.",
				"added": 1615871132
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 45,
				"body": "new national sport !",
				"added": 1615871172
			}
		]
	},
	"comment_vote": {}
}