{
	"next_topic_id": 20,
	"topic": [
		{
			"topic_id": 1,
			"title": "A anatomia do estado - Murray N. Rothbard",
			"body": "“Em A anatomia do estado, Murray Rothbard explica o que o estado é e o que ele não é. Ele mostra como o estado nada mais é do que uma instituição que viola tudo aquilo que consideramos honesto e moral, sempre agindo sob uma falsa aura de bondade e preocupação para com o cidadão. Ele demonstra como o estado devasta a liberdade, destrói a civilização e ameaça a vida, a propriedade e o bemestar social de todas as pessoas.\n\nNeste influente e original ensaio, Rothbard consolida tudo o que aprendeu com a tradição misesiana, com a tradição liberal e com a tradição anarcocapitalista, dando origem, de forma verdadeiramente inovadora, a um pensamento profundamente sistemático sobre economia política e social.\nO leitor que assimilar a concepção de Rothbard conseguirá entender claramente como todos os eventos estatistas atuais se encaixam de maneira lógica e compreensível, alterando para sempre a maneira como ele vê o mundo.”\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/2015/10/A-anatomia-do-estado.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/2015/10/A%20anatomia%20do%20estado.mobi\nAudiobook: https://drive.google.com/open?id=1bBizIO8mq1EE4hRxd-AdxLbuH3ipAzF4",
			"added": 1599189954
		},
		{
			"topic_id": 2,
			"title": "Por Uma Nova Liberdade: O Manifesto Libertário - Murray N. Rothbard",
			"body": "Manifesto integral de exposição do libertarianismo moderno. Propõe uma “ciência da liberdade” apresentando as armadilhas do pensamento da esquerda, da direita e do centro. De argumentação lógica e clara, o manifesto reforça a importância da autonomia individual, dos direitos de propriedade, dos mercados livres e do combate ao Estado. Oferece uma versão totalmente inovadora e sem meias-palavras do que deve ser a liberdade no sentido mais radical do termo. É um texto clássico para os defensores da liberdade.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/manifestolibertario.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/manifestolibertario.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/manifestolibertario.epub",
			"added": 1599190313
		},
		{
			"topic_id": 3,
			"title": "A ética da liberdade - Murray N. Rothbard",
			"body": "Lançado em 1982, A ética da liberdade apresenta uma rigorosa e sofisticada defesa filosófica da liberdade, baseada no conceito do direito natural. Dando sequência à demonstração de seu mentor Mises de que a sociedade sem propriedade privada se degenera em caos econômico, Rothbard mostra que a interferência estatal sobre a propriedade privada representa uma invasão, que diminui a liberdade e a prosperidade. Suas conclusões radicais se mostram surpreendentemente práticas para lidar com dilemas éticos do dia-a-dia, tais como autodefesa, punições, direitos das crianças e dos animais, entre outros.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20etica%20da%20liberdade%20-%20miolo%20capa%20brochura_2013.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20%C3%A9tica%20da%20liberdade.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20%C3%A9tica%20da%20liberdade.epub\nAudiobook: https://drive.google.com/open?id=1BHMzpsqkr71wRmObOOv-k32Fs4gxgjvK",
			"added": 1599190527
		},
		{
			"topic_id": 4,
			"title": "A Origem do Dinheiro - Carl Menger",
			"body": "Há um fenômeno que desde o passado e em um grau peculiar atraiu a atenção dos filósofos sociais e dos economistas práticos, o fato de certas comódites (Estas sendo em civilizações avançadas pedaços de ouro e prata em formato de moeda, em conjunto, posteriormente, com documentos representando estas moedas) tornando-se meios de troca universalmente aceitáveis. É óbvio mesmo para aqueles de inteligência comum, que uma comódite deve ser dada por seu dono em troca de outra mais útil para ele. Mas que toda unidade econômica em uma nação deveria estar pronta para trocar seus bens por pequenos discos metálicos aparentemente inúteis como tal, ou por documentos representando estes discos, é um procedimento tão oposto ao curso normal das coisas, que nós não podemos nos surpreender se mesmo um pensador distinto como Savigny acha isso algo francamente “misterioso.”\n\nLink:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/2017/08/Sobre-A-Origem-Do-Dinheiro-Carl-Menger-1.pdf",
			"added": 1599190773
		},
		{
			"topic_id": 5,
			"title": "Uma breve história do homem: progresso e declínio - Hans-Hermann Hoppe",
			"body": "“Da aristocracia à monarquia e à democracia”, um dos ensaios incluídos em Uma Breve História do Homem resume a posição de Hans. Os leitores deste trabalho brilhante descobrirão que, se a monarquia é melhor que a democracia, a aristocracia é melhor ainda. Se você nunca leu Hans antes, será um deleite. Em apenas algumas páginas, ele fará você questionar tudo o que já leu sobre governo.\n\nAo longo de Uma Breve História do Homem, Hans mostra como as lições da economia austríaca podem ser usadas para nos ajudar a entender a história. Ao fazer isso, Hans segue o caminho traçado por seu grande mentor, Murray Rothbard. Como Murray, Hans é um estudioso de interesses quase universais. Ele está totalmente à vontade em antropologia e sociologia, além de história global, economia e filosofia.\n\nCom base em seu vasto conhecimento e ideias austríacas, Hans aborda duas questões. Como a família e a propriedade privada se originaram? Como começou a Revolução Industrial? Os leitores verão como o desenvolvimento de direitos de propriedade assegurados e do livre mercado foi essencial para o progresso humano. A questão para os nossos dias é: esses desenvolvimentos continuarão, para grande benefício da humanidade, ou o Estado será capaz de impedi-los?\n\nEm seu uso da economia e da filosofia para iluminar a história, Uma Breve História do Homem traz à mente clássicos libertários como O Estado de Oppenheimer (1904-1967), O Nosso Inimigo, o Estado de Nock (1870-1945) e O Rise e a Queda da Sociedade de Chodorov (1887-1966). Uma Breve História do Homem é uma introdução ideal ao pensamento de um importante pensador social e libertário destacado.\n\nLink:\n\nPDF: https://rothbardbrasil.com/wp-content/uploads/2020/07/HOPPE-Hans-Hermann-Uma-Breve-Hist%C3%B3ria-do-Homem.pdf",
			"added": 1599191003
		},
		{
			"topic_id": 6,
			"title": "Imposto é roubo, A ética dos lambedores de botas - Bruno Silva",
			"body": "O presente trabalho tem o propósito explícito de clarificar ao leitor a fonte não percebida de quase todos os males contemporâneos: a ética dos lambedores de botas. Pois, é como disse Larken Rose em sua obra A Mais Perigosa Superstição: “Folheie qualquer livro de história e você verá que a maior parte da injustiça e destruição que ocorreu pelo mundo não foi o resultado das pessoas “infringindo a lei”, mas sim os resultados de pessoas obedecendo e impondo as “leis” de vários “governos”. Os males que foram cometidos apesar da “autoridade” são triviais comparados aos males que foram cometidos em nome da “autoridade””.\n\nO leitor, ao abstrair o conteúdo deste livro, não terá outra conclusão a não ser a seguinte: a história dos muitos estados é a história dos muitos graus de escravidão.\n\nLink:\n\nPDF: https://rothbardbrasil.com/wp-content/uploads/2020/08/Imposto-e-Roubo-A-Etica-dos-Lambedores-de-Botas.pdf",
			"added": 1599191113
		},
		{
			"topic_id": 7,
			"title": "A Economia e a Ética da Propriedade Privada - Hans-Hermann Hoppe",
			"body": "A primeira edição de A Economia e Ética da Propriedade Privada, publicada em 1993, esteve fora de estoque por muitos anos. Já há algum tempo que muitas pessoas me pressionam para preparar uma nova edição, e Llewellyn Rockwell graciosamente ofereceu o Ludwig von Mises Institute como editora.\n\nA Economia e Ética da Propriedade Privada foi dedicado ao meu professor e mentor, Murray N. Rothbard, com quem eu estive estreitamente ligado durante os últimos dez anos de sua vida, primeiro como um acadêmico visitante no Brooklyn Polytechnic Institute em Nova Iorque e a partir de 1986 como colega na Universidade de Nevada, Las Vegas. O ano de 2005 marca o décimo aniversário da morte de Rothbard. Portanto, pareceu o momento mais apropriado para homenagear Murray novamente com a segunda edição.\n\nA presente edição de A Economia e Ética da Propriedade Privada é expandida. Adicionaram-se quatro artigos escritos depois da publicação do livro, mas tematicamente relacionado com o principal assunto sobre a racionalidade ética e econômica da instituição da propriedade privada – capítulos 6, 7, 8 e 15. A oportunidade de uma nova edição foi também usada para fazer significativas melhoras editoriais e revisões.\n\nLink:\n\nPDF: https://rothbardbrasil.com/wp-content/uploads/2020/09/l.pdf",
			"added": 1599191233
		},
		{
			"topic_id": 8,
			"title": "Manual para entender direito o Libertarianismo - Hans-Hermann Hoppe",
			"body": "Os textos reunidos neste livro são em sua maioria palestras dadas em Bodrum para a Property and Freedom Society, que o professor Hoppe é tanto o fundador quanto o presidente. Tive a sorte de assisti-las no evento, e me sinto profundamente honrado de ter sido convidado a apresentar uma introdução para a versões escritas.\n\nSean Gabb\n\nLink:\n\nPDF: https://rothbardbrasil.com/wp-content/uploads/2020/06/HOPPE-Hans-Hermann-Manual-para-entender-direito-o-Libertarianismo1.pdf",
			"added": 1599191410
		},
		{
			"topic_id": 9,
			"title": "Democracia, o deus que falhou - Hans-Hermann Hoppe",
			"body": "Este livro é um golpe intelectual na democracia. Ele explica que ela é uma máquina de destruição de riqueza, de desperdício econômico e de empobrecimento; e ele a identifica como uma causa sistemática de corrupção moral e degeneração. Em suma: a democracia é mostrada como uma forma “branda” – e especialmente insidiosa – de comunismo. Ao mesmo tempo, este livro apresenta uma rigorosa defesa da instituição da propriedade privada, demonstrando que ela é uma condição necessária para a paz e a prosperidade duradouras. \n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/deus-que-falhou.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/deus-que-falhou.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/deus-que-falhou.epub",
			"added": 1599191615
		},
		{
			"topic_id": 10,
			"title": "A Economia do Intervencionismo - Fabio Barbieri",
			"body": "Não existe nada mais empolgante do que aquelas leituras, feitas aos vinte anos de idade, que mudam o nosso modo de pensar para sempre. Essas leituras cruciais fornecem o material que une o nosso conhecimento até então fragmentado em uma visão de mundo coerente e ao mesmo tempo estimulam o senso crítico necessário para o exame dos fragmentos incompatíveis com essa visão. Para o aluno, o aspecto mais fascinante da educação universitária deveria ser a construção, como uma espécie de “Lego intelectual”, da própria visão de mundo, a partir do encaixe ou rejeição crítica de cada um dos tijolos sugeridos pelos textos.Em especial, o início do processo de construção de um edifício explanatório deve ser recompensador, pois toda teoria apresenta algo como retornos decrescentes: no início, somos expostos a vasto território inexplorado, ao passo que o intelectual maduro é condenado a se repetir. O estudo da Economia, em particular, deveria proporcionar essa sensação de descoberta, pois ele nos fornece a chave para a compreensão da maioria dos erros que povoam o núcleo do discurso dos políticos e fornece fascinantes teorias que abrem nossos olhos para os reais fatores que geram prosperidade, sem a qual não seriam possíveis todas as conquistas de nossa civilização.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/MisesBrasil_A%20Economia%20do%20Intervencionismo_BROCHURA.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Economia%20do%20Intervencionismo.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Economia%20do%20Intervencionismo.epub",
			"added": 1599191751
		},
		{
			"topic_id": 11,
			"title": "A Ética da Redistribuição - Bertrand de Jouvenel",
			"body": "O estudo de Bertrand de Jouvenel sobre a ética da redistribuição distingue-se, em primeiro lugar, porque enfoca precisamente a moralidade da redistribuição, não seus efeitos paralelos sobre os incentivos.  Isso é dizer que a crítica de Jouvenel incorpora um desafio fundamental aos valores expressos no pensamento redistributivista que de forma nenhuma depende de uma avaliação instrumental ou utilitária das consequências da política de redistribuição.  Jouvenel preocupa-se mais com o impacto da redistribuição sobre a liberdade individual e sobre a vida cultural do que com seus efeitos sobre a produtividade.Seu estudo também é significativo por uma outra razão: ele tem o cuidado de distinguir o redistributivismo de outras doutrinas a ele superficialmente similares.  Assim, ele mostra claramente como esse difere do igualitarismo agrário, que objetiva equiparar um recurso — terra — mas não procura controlar a distribuição do seu produto.  Novamente, redistributivismo não é socialismo.  O redistributivismo causou severos danos à civilização moderna, mas não a destruiu.  Por outro lado, o socialismo é a supressão da propriedade privada numa nova ordem de solidariedade moral comunal, e é incompatível com a sociedade moderna.  Pode-se imaginar que o seja nos monastérios, onde os bens materiais são rejeitados, ou em comunidades pequenas, simples, e mesmo primitivas — um insight que foi captado por Rousseau, mas não por Marx.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20%C3%A9tica%20da%20redistribui%C3%A7%C3%A3o%20-%20miolo%20capa%20normal.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20%C3%89tica%20da%20Redistribui%C3%A7%C3%A3o.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20%C3%89tica%20da%20Redistribui%C3%A7%C3%A3o.epub",
			"added": 1599191885
		},
		{
			"topic_id": 12,
			"title": "A Lei - Frédéric Bastiat",
			"body": "Escrito no ano da morte do autor, A lei é um bom diagnóstico da situação da França pós-revolucionária com relação as ideias de lei e justiça promovida por certos filósofos. Para ele, a Lei deve proteger o indivíduo, a liberdade e a propriedade privada. Infelizmente, essa mesma lei pode ser pervertida e posta a serviço de interesses particulares, tornando-se, então, um instrumento de espoliação. É dessa maneira que Bastiat analisa o funcionamento do Estado, esta “grande ficção através da qual todos se esforçam para viver às custas dos demais”. Para o autor, protecionismo, intervencionismo e socialismo são as três forças de perversão da lei. Apesar de escrito há mais de 160 anos, a temática permanece atual. \n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Lei%20-%20miolo%20capa%20brochura.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Lei.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Lei.epub\nAudiobook: https://drive.google.com/open?id=1NMKjWNN-7wLqoEhgbdfRdpi399cnmMDA",
			"added": 1599192010
		},
		{
			"topic_id": 13,
			"title": "A Mentalidade Anticapitalista - Ludwig von Mises",
			"body": "A Mentalidade Anticapitalista é uma influente análise cultural, sociológica e psicológica de Ludwig von Mises acerca da rejeição ao livre mercado por uma parte significativa dos intelectuais. Em linguagem agradável, o autor discute com clareza e lucidez os principais elementos que caracterizam o capitalismo, o modo como este sistema é visto pelo homem comum, a literatura sob este modelo econômico e as principais objeções às sociedades capitalistas, além de abordar a questão do anticomunismo.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Mentalidade%20Anticapitalista%20-%20WEB.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Mentalidade%20Anticapitalista.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20Mentalidade%20Anticapitalista.epub",
			"added": 1599192119
		},
		{
			"topic_id": 14,
			"title": "A Teoria da Exploração do Socialismo-Comunismo - Eugen von Böhm-Bawerk",
			"body": "Este pequeno trabalho vai muito além da mera questão acadêmica de saber qual das teorias é a decisiva e qual é a falaciosa: as teorias da exploração de Rodbertus e Marx, ou a crítica de Böhm-Bawerk. Seu ponto crucial é a defesa da empresa privada contra o ataque do socialismo, que traz o totalitarismo e o comunismo.\nEm relação à velha teoria da exploração o que Rodbertus e Marx nos apresentam não é apenas uma teoria incorreta: constitui-se mesmo numa das piores teorias sobre juros existentes, se formos considerá-la em seu valor teórico. Os erros de raciocínio de defensores de outras teorias, por mais graves que sejam, dificilmente serão tão graves e numerosos quanto os dos defensores dessa teoria: presunção, leviandade, pressa, dialética falseada, contradição interna e cegueira diante dos fatos reais. Os socialistas, que são críticos diligentes, apresentam-se como dogmáticos muito fracos. Acreditam na teoria da exploração porque ela lhes agrada, não importando que seja falsa. Acreditariam nela mesmo que sua fundamentação fosse ainda pior do que é.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20teoria%20da%20exploracao%20do%20socialismo-comunismo%20-%20WEB.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20teoria%20da%20exploracao%20do%20socialismo-comunismo.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/A%20teoria%20da%20exploracao%20do%20socialismo-comunismo.epub",
			"added": 1599192268
		},
		{
			"topic_id": 15,
			"title": "Ação Humana – Um Tratado de Economia - Ludwig von Mises",
			"body": "Obra magna de Ludwig von Mises, um dos maiores economistas da História, A ação humana pode ser considerado um dos pilares da ciência econômica do século XX. O livro, um tratado econômico, centra-se na refutação das teorias que excluem a participação humana dos processos econômicos. O núcleo do pensamento do autor é a Teoria da Ação Humana, ou Praxiologia, a ciência geral que ele busca explicar. Para ele, tudo que procuramos estudar em economia origina-se da escolha individual. O homem não escolhe apenas entre diversos bens e serviços, todos os valores humanos lhe são oferecidos como opção e submetidos às decisões individuais: o princípio da responsabilidade. Portanto, a teoria da escolha é muito mais do que o lado “econômico” do empreendimento humano – é central a toda a ação humana: a ação dos indivíduos. A ação humana é uma obra-prima da filosofia econômica, podendo ser lido tanto por acadêmicos quanto por cidadãos comuns que busquem entender o fenômeno dos preços, da inflação, da livre iniciativa, do Mercado como um todo: nada escapa à lente de von Mises.\n\nPDF: - http://rothbardbrasil.com/wp-content/uploads/arquivos/acao-humana.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/acao-humana.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/acao-humana.epub",
			"added": 1599192391
		},
		{
			"topic_id": 16,
			"title": "As Seis Lições - Ludwig von Mises",
			"body": "Síntese da obra do grande economista Ludwig von Mises, talvez o maior da história, As seis lições pode ser considerado a melhor introdução ao pensamento do mestre e um grande resumo de sua extensa produção acadêmica. Trata-se de um livro curto: em poucas palavras, ele demonstra a perenidade de seus conceitos a respeito de política econômica, como propriedade privada, livre comércio, preços, juros, moeda e inflação, bem como os de sistemas político-econômicos, como capitalismo, intervencionismo, socialismo, investimento externo. Fruto de palestras dirigidas a empresários, professores e alunos, As seis lições foi organizado pela viúva de Mises, é um clássico da ciência econômica em linguagem acessível para o público leigo e é provavelmente o livro mais vendido do autor.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/seis-licoes.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/seis-licoes.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/seis-licoes.epub",
			"added": 1599192501
		},
		{
			"topic_id": 17,
			"title": "Contra a Propriedade Intelectual - Stephan Kinsella",
			"body": "Esta monografia de Stephan Kinsella é justamente considerada um clássico moderno. Foi ela que fez com que libertários do mundo inteiro reconsiderassem suas posições relativas as fundamentações da propriedade intelectual. Mises alertou sobre o perigo das patentes, e Rothbard também. Mas Kinsella vai muito mais a fundo e argumenta que a simples existência de patentes é incompatível com o livre mercado, e inclui aí os direitos autorais e as marcas registradas. Eles se utilizam do estado para criar escassez artificial de bens não escassos e fazem uso da coerção de um modo que contraria os direitos de propriedade e a liberdade contratual. Muitas pessoas que leram este ensaio pela primeira vez foram pegas de surpresa pelo rigor de sua argumentação, que leva algum tempo para ser assimilada, pois num primeiro momento a ideia pode chocar. Porém, Kinsella demonstra sua razão através de uma lógica poderosa e exemplos que possuem um poder de convencimento avassalador.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/propriedade-intelectual.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/propriedade-intelectual.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/propriedade-intelectual.epub\nAudiobook: https://drive.google.com/open?id=1ajIGRWVaBAPG7RJYwmq2poPU21iUFa5W",
			"added": 1599192617
		},
		{
			"topic_id": 18,
			"title": "O Livro Negro do Comunismo - Diversos Autores",
			"body": "À luz dos fatos aqui revelados, o Terror Vermelho deve estar presente na consciência dos que ainda creem num futuro para o Comunismo. O Livro Negro do Comunismo traz a público o saldo estarrecedor de mais de sete décadas de história de regimes comunistas: massacres em larga escala, deportações de populações inteiras para regiões sem a mínima condição de sobrevivência, expurgos assassinos liquidando o menor esboço de oposição, fome e miséria que dizimaram indistintamente milhões de pessoas, enfim, a aniquilação de homens, mulheres, crianças, soldados, camponeses, religiosos, presos políticos e todos aqueles que, pelas mais diversas razões, se encontraram no caminho de implantação do que, paradoxalmente, nascera como promessa de redenção e esperança. Os autores, historiadores que permanecem ou estiveram ligados à esquerda, não hesitam em usar a palavra genocídio, pois foram cerca de 100 milhões de mortos. Esse número assustador ultrapassa, por exemplo, o número de vítimas do nazismo e até mesmo o das duas guerras mundiais somadas. Genocídio, holocausto, por tanto, confirmado pelos vários relatos de sobreviventes e, principalmente, pelas revelações dos arquivos hoje acessíveis.\n\nLink:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/livro.pdf",
			"added": 1599192812
		},
		{
			"topic_id": 19,
			"title": "O Caminho da Servidão - Friedrich A. Hayek",
			"body": "As páginas que se seguem são o resultado de uma experiência que se aproxima tanto quanto possível dessa oportunidade de vivermos duas vezes o mesmo período histórico – ou, pelo menos, de observarmos duas vezes uma evolução de ideias muito semelhante. Enquanto tal experiência tem pouca probabilidade de ser obtida em um único país. pode-se vir a adquiri-la, sob certas circunstâncias, vivendo alternadamente e por longos períodos em países diferentes. Embora as influências sofridas pela tendência do pensamento, na maioria das nações civilizadas, sejam em grande parte semelhantes, essas influências não operam ao mesmo tempo nem com a mesma rapidez. Dessa forma, indo de um país para outro, é possível observar duas vezes fases análogas de um processo intelectual. Os sentidos, em tais circunstâncias, adquirem uma agudeza especial. Quando ouvimos serem expressas pela segunda vez as opiniões de há vinte ou vinte e cinco anos, ou reclamadas as mesmas medidas, estas opiniões e medidas adquirem um novo sentido como sintomas de uma tendência definida. Elas sugerem, se não a necessidade, pelo menos a probabilidade de que o rumo dos acontecimentos será semelhante. Faz-se hoje necessário declarar esta verdade amarga: é o destino da Alemanha que estamos em perigo de seguir. Reconheço que esse perigo não é imediato, pois as condições na Inglaterra ainda estão de tal modo distantes daquelas que em anos recentes ocorreram na Alemanha, que se torna difícil acreditar estarmos marchando na mesma direção. Contudo, embora a estrada seja longa, é uma estrada na qual, à medida que se avança, é mais difícil voltar atrás. Se, a longo prazo, somos os criadores do nosso destino, de imediato somos escravos das ideias que criamos.\n\nLinks:\n\nPDF: http://rothbardbrasil.com/wp-content/uploads/arquivos/caminhodaservidao.pdf\nMOBI: http://rothbardbrasil.com/wp-content/uploads/arquivos/caminhodaservidao.mobi\nEPUB: http://rothbardbrasil.com/wp-content/uploads/arquivos/caminhodaservidao.epub",
			"added": 1599192929
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}