{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Língua protoindo-europeia",
			"body": "#O rei e o deus\n- H3rḗḱs h1est; só n̥putlós. H3rḗḱs súhxnum u̯l̥nh1to. Tósi̯o ǵʰéu̯torm̥ prēḱst: \"Súhxnus moi̯ ǵn̥h1i̯etōd!\" Ǵʰéu̯tōr tom h3rḗǵm̥ u̯eu̯ked: \"h1i̯áǵesu̯o dei̯u̯óm U̯érunom\". Úpo h3rḗḱs dei̯u̯óm U̯érunom sesole nú dei̯u̯óm h1i̯aǵeto. \"ḱludʰí moi, pter U̯erune!\" Dei̯u̯ós U̯érunos diu̯és km̥tá gʷah2t. \"Kʷíd u̯ēlh1si?\" \"Súhxnum u̯ēlh1mi.\" \"Tód h1estu\", u̯éu̯ked leu̯kós dei̯u̯ós U̯érunos. Nu h3réḱs pótnih2 súhxnum ǵeǵonh1e.\n\n#Tradução aproximada ao português:\n\n- Havia um rei. Ele não tinha filhos. Ele queria um filho. Ele pediu a um sacerdote: \"eu quero um filho!\". O sacerdote respondeu ao rei: \"reze ao deus Werunos.\" O rei se aproximou do deus Werunos agora para rezar a ele. \"Escute-me, pai Werunos!\". O deus Werunos desceu dos céus. \"O que queres?\" \"quero um filho.\" \"que assim seja.\" disse brilhando o deus Werunos. A esposa do rei teve à um filho.",
			"added": 1543457694
		},
		{
			"topic_id": 2,
			"title": "Um Dia Você Aprende que...",
			"body": "#Depois de algum tempo, você aprende a diferença, a sutil diferença, entre dar a mão e acorrentar uma alma. E você aprende que amar não significa apoiar-se, e que companhia nem sempre significa segurança. E começa a aprender que beijos não são contratos e presentes não são promessas. E começa a aceitar suas derrotas com a cabeça erguida e olhos adiante, com a graça de um adulto e não com a tristeza de uma criança.\n\n#E aprende a construir todas as suas estradas no hoje, porque o terreno do amanhã é incerto demais para os planos, e o futuro tem o costume de cair em meio ao vão. Depois de um tempo você aprende que o sol queima se ficar exposto por muito tempo. E aprende que não importa o quanto você se importe, algumas pessoas simplesmente não se importam... E aceita que não importa quão boa seja uma pessoa, ela vai feri-lo de vez em quando e você precisa perdoá-la, por isso. Aprende que falar pode aliviar dores emocionais.\n\n#Descobre que se levam anos para se construir confiança e apenas segundos para destruí-la, e que você pode fazer coisas em um instante das quais se arrependerá pelo resto da vida. Aprende que verdadeiras amizades continuam a crescer mesmo a longas distâncias. E o que importa não é o que você tem na vida, mas quem você tem na vida. E que bons amigos são a família que nos permitiram escolher. Aprende que não temos que mudar de amigos se compreendemos que os amigos mudam, percebe que seu melhor amigo e você podem fazer qualquer coisa, ou nada, e terem bons momentos juntos.\n\n#Descobre que as pessoas com quem você mais se importa na vida são tomadas de você muito depressa, por isso sempre devemos deixar as pessoas que amamos com palavras amorosas, pode ser a última vez que as vejamos. Aprende que as circunstâncias e os ambientes tem influência sobre nós, mas nós somos responsáveis por nós mesmos. Começa a aprender que não se deve comparar com os outros, mas com o melhor que pode ser. Descobre que se leva muito tempo para se tornar a pessoa que quer ser, e que o tempo é curto. Aprende que não importa onde já chegou, mas onde está indo, mas se você não sabe para onde está indo, qualquer lugar serve. Aprende que, ou você controla seus atos ou eles o controlarão, e que ser flexível não significa ser fraco ou não ter personalidade, pois não importa quão delicada e frágil seja uma situação, sempre existem dois lados.\n\n#Aprende que heróis são pessoas que fizeram o que era necessário fazer, enfrentando as conseqüências. Aprende que paciência requer muita prática. Descobre que algumas vezes a pessoa que você espera que o chute quando você cai é uma das poucas que o ajudam a levantar-se.\n\n#Aprende que maturidade tem mais a ver com os tipos de experiência que se teve e o que você aprendeu com elas do que com quantos aniversários você celebrou. Aprende que há mais dos seus pais em você do que você supunha. Aprende que nunca se deve dizer a uma criança que sonhos são bobagens, poucas coisas são tão humilhantes e seria uma tragédia se ela acreditasse nisso.\n\n#Aprende que quando está com raiva tem o direito de estar com raiva, mas isso não te dá o direito de ser cruel. Descobre que só porque alguém não o ama do jeito que você quer que ame, não significa que esse alguém não o ama, contudo o que pode, pois existem pessoas que nos amam, mas simplesmente não sabem como demonstrar ou viver isso.\n\n#Aprende que nem sempre é suficiente ser perdoado por alguém, algumas vezes você tem que aprender a perdoar-se a si mesmo. Aprende que com a mesma severidade com que julga, você será em algum momento condenado. Aprende que não importa em quantos pedaços seu coração foi partido, o mundo não pára para que você o conserte. Aprende que o tempo não é algo que possa voltar para trás.\n\n#Portanto... plante seu jardim e decore sua alma, ao invés de esperar que alguém lhe traga flores. E você aprende que realmente pode suportar... que realmente é forte, e que pode ir muito mais longe depois de pensar que não se pode mais. E que realmente a vida tem valor e que você tem valor diante da vida!\n\n- Veronica Shoffstall",
			"added": 1543459562
		}
	],
	"topic_vote": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1AD6remHtX8u7H4g7UsHD89AYrDYNwZG2n": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1PqwSiizFr8j1LRqegXwZPixWiQEntzc3c": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1
	},
	"next_comment_id": 36,
	"comment": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 1,
				"body": "#Torá\nTorá é o nome dado aos cinco primeiros livros do Tanakh e que constituem o texto central do judaísmo. Contém os relatos sobre a criação do mundo, da origem da humanidade, do pacto da Divindade com Abraão e seus filhos, e a libertação dos filhos de Israel do Egito e sua peregrinação de quarenta anos até a terra prometida.\n- https://web.archive.org/web/20181128170113/http://pauloilha.com/estudos/judaismo/tora.pdf",
				"added": 1543425219
			},
			{
				"comment_id": 29,
				"body": "#A Bíblia Sagrada na Língua Guarani M'byá\n- https://mega.nz/#!HCInhQIJ!UiFw97fiThFX3Z95SHQCZo0-MjxrPnZv9ABQJW8lzWc",
				"added": 1543453700
			},
			{
				"comment_id": 31,
				"body": "#Bíblia Hebraica\n- https://web.archive.org/web/20181129022657/http://www.adventistas.com/wp-content/uploads/2013/07/BIBLIA+EM+HEBRAICO+TRANSLITERADA+E+PORTUGUES+INTERLINEAR_2a_Edicao_12_06_2011_e-Book.pdf",
				"added": 1543458487
			},
			{
				"comment_id": 32,
				"body": "#BIBLIA SACRA\n- https://web.archive.org/web/20181129023557/http://www.wilbourhall.org/pdfs/vulgate.pdf",
				"added": 1543459009
			},
			{
				"comment_id": 33,
				"body": "\"Evite as controvérsias tolas e fúteis, pois você sabe que acabam em brigas. Ao servo do Senhor não convém brigar mas, sim, ser amável para com todos, apto para ensinar, paciente.\" 2 Tm 2:23-24",
				"added": 1543465788
			},
			{
				"comment_id": 34,
				"body": "#Mario Persona\n- https://www.youtube.com/channel/UCU6P1J2OW61Ist2FOj72Xzg",
				"added": 1543465939
			},
			{
				"comment_id": 35,
				"body": "#O Respostas Bíblicas é um site com perguntas e respostas sobre os mais diversos temas, dadas à luz da Bíblia e da fé cristã evangélica. Encontre aqui respostas para os seus questionamentos.\n- https://www.respostas.com.br/",
				"added": 1543465996
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#PI\nNão muito conhecido, esse filme de 1998 conta a história de um gênio que sofre de enxaquecas terríveis e vive dentro de um quarto escondido de tudo, todos e, especialmente, da luz. Max, nosso protagonista, passa o dia no computador mexendo com códigos e descobre um padrão universal em suas pesquisas lidando com a bolsa de valores. Enquanto de um lado Wall Street quer ganhar dinheiro com sua descoberta, um grupo de judeus acha que o que Max encontrou foi na verdade um padrão no Torá. O filme traz uma discussão bem legal de política, tecnologia e religião.\n\n\n- https://openload.co/embed/6G66XluVavM/?c1_file=https://pt.onmovies.to/sub/4779639__pob_13809_15852_13809_Pi__film_1998_1_0_0_0-0___.srt&c1_label=pob1\n\n- https://web.opendrive.com/api/v1/download/file.json/MzJfMjEzMzEzMV8?inline=1",
				"added": 1543425853
			},
			{
				"comment_id": 3,
				"body": "#Uma Mente Brilhante\nJohn Nash (Russell Crowe) é um gênio da matemática que, aos 21 anos, formulou um teorema que provou sua genialidade e o tornou aclamado no meio onde atuava. Mas aos poucos o belo e arrogante John Nash se transforma em um sofrido e atormentado homem, que chega até mesmo a ser diagnosticado como esquizofrênico pelos médicos que o tratam. Porém, após anos de luta para se recuperar, ele consegue retornar à sociedade e acaba sendo premiado com o Nobel.\n\n- https://ok.ru/video/352678971920",
				"added": 1543426992
			},
			{
				"comment_id": 4,
				"body": "#O HOMEM QUE VIU O INFINITO\nUma verdadeira história de amizade que mudou a matemática para sempre. Em 1913, Ramanujan, um gênio da matemática autodidata da Índia viaja para a o Colégio Trinity, na Universidade de Cambridge, onde ele se aproxima do seu mentor, o excêntrico professor GH Hardy, e luta para mostrar ao mundo a brilhantia de sua mente.\n- https://youtu.be/44V1UqF4YCU\n- http://thevid.net/video/ojt3vt50f6wmcowczcr2y/",
				"added": 1543427468
			},
			{
				"comment_id": 5,
				"body": "#PRENDA-ME SE FOR CAPAZ\nFrank Abagnale Jr. (Leonardo DiCaprio) já foi médico, advogado e co-piloto, tudo isso com apenas 18 anos. Mestre na arte do disfarce, ele aproveita suas habilidades para viver a vida como quer e praticar golpes milionários, que fazem com que se torne o ladrão de banco mais bem-sucedido da história dos Estados Unidos com apenas 17 anos. Mas em seu encalço está o agente do FBI Carl Hanratty (Tom Hanks), que usa todos os meios que tem ao seu dispor para encontrá-lo e capturá-lo.\n\n\n- https://openload.co/embed/usXlO9CFHCo",
				"added": 1543427948
			},
			{
				"comment_id": 6,
				"body": "#O Jogo da Imitação\nEsta biografia de Alan Turing (Benedict Cumberbatch) acompanha sua ascensão no mundo da tecnologia, quando seus conhecimentos inestimáveis em matemática, lógica e ciência da computação contribuíram com as estratégias usadas pelos Estados Unidos durante a Segunda Guerra Mundial. No entanto, este homem tinha diversos conflitos com sua própria homossexualidade, buscando soluções de cura, e vindo a cometer suicídio em 1954.\n\n- https://youtu.be/B6-kvmineak\n- http://thevid.net/video/5pjpeoecco06fm3n3mdvp0sci/",
				"added": 1543430962
			},
			{
				"comment_id": 7,
				"body": "#O Gigante de Ferro\n\nEm plenos anos 50, vive no Maine o jovem Hogarth. Quando ele repentinamente encontra um gigantesco robô de origem desconhecida, logo um forte laço de amizade se forma entre os dois. Porém, assim que a existência do robô revelada, um agente do governo logo parte em seu encalço, no intuito de destruí-lo.\n\n- https://ok.ru/video/1126332107280",
				"added": 1543431264
			},
			{
				"comment_id": 8,
				"body": "#Free Willy\nAte onde voce irira por um amigo ? Garoto rebelde e solitario, faz amizade com Willy, uma orca de doze metros, capturada para fazer shows aquaticos. Nesse solido relacionamento, o carinho e a ternura aumentam sempre e, quando o menino vem a saber que a baleia pode morrer no cativeiro, reune todas as suas forcas para liberta-la. Uma incrivel aventura que jamais sera esquecida! Órfão de 12 anos que não tem casa nem amigos conhece em um aquário a baleia Willy, pela qual se afeiçoa. Fantasia infantil que agrada ao seu público-alvo, que assiste ao filme já preparado para ver a cena-clímax, estampada no pôster. Fez razoável sucesso e conta com uma canção-tema da autoria de Michael Jackson, “Will You Be There”. Apesar de bem-fotografado, tem roteiro forçado e irreal, o que pode desagradar ao público adulto.\n\n- https://ok.ru/video/349685090832",
				"added": 1543431379
			},
			{
				"comment_id": 9,
				"body": "#Free Willy 4 : A Grande Fuga\nEm Free Willy 4: A Grande Fuga uma nova história comovente de uma menina e uma orca, Willy. Dois amigos improváveis estão unidos neste próximo capítulo da aventura da de filmes da família, aventuras e dramas a turma toda irá passar.\n\n- https://ok.ru/video/352699943440",
				"added": 1543431452
			},
			{
				"comment_id": 30,
				"body": "#O Filme Jesus na Língua Guarani Mbyá\n- https://youtu.be/3G-99oEerXw",
				"added": 1543453844
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 10,
				"body": "#Calculadora - Função gama\n- http://www.elektro-energetika.cz/calculations/gama.php?language=portugues",
				"added": 1543431947
			},
			{
				"comment_id": 11,
				"body": "#Solução de sistema de um equações lineares com números reais\n- http://www.elektro-energetika.cz/calculations/linrov.php?language=portugues",
				"added": 1543432057
			},
			{
				"comment_id": 12,
				"body": "#COMO FAZER QUALQUER COISA SIGNIFICAR QUALQUER COISA\n- https://web.archive.org/web/20181026072858/http://www.cabinetmagazine.org/issues/40/sherman.php",
				"added": 1543433490
			},
			{
				"comment_id": 13,
				"body": "#TEOREMA MESTRE DE RAMANUJAN\n- https://web.archive.org/web/20181128193418/http://arminstraub.com/downloads/pub/rmt.pdf",
				"added": 1543433722
			},
			{
				"comment_id": 14,
				"body": "#A desculpa do matemático - Godfrey Harold Hardy\n- https://web.archive.org/web/20180430020714/http://www.math.ualberta.ca/mss/misc/A%20Mathematician's%20Apology.pdf",
				"added": 1543434130
			},
			{
				"comment_id": 15,
				"body": "#Srinivasa Ramanujan\n- https://www.imsc.res.in/~rao/ramanujan/index.html",
				"added": 1543434373
			},
			{
				"comment_id": 16,
				"body": "#Em um teorema de Hardy e Ramanujan\n- https://sci-hub.tw/10.1112/jlms/s1-9.4.274",
				"added": 1543434490
			},
			{
				"comment_id": 17,
				"body": "#Os zeros da função zeta de Riemann na linha crítica\n- https://sci-hub.tw/10.1007/BF01211614",
				"added": 1543434622
			},
			{
				"comment_id": 22,
				"body": "#Propriedades de congruência das partições - Srinivasa Ramanujan\n\n- https://sci-hub.tw/10.1007/BF01378341",
				"added": 1543441561
			},
			{
				"comment_id": 23,
				"body": "#Conjectura de Lemoine\n- Na teoria dos números , a conjectura de Lemoine , em homenagem a Émile Lemoine , também conhecida como conjectura de Levy , depois de Hyman Levy , afirma que todos os inteiros ímpares maiores que 5 podem ser representados como a soma de um número primo ímpar e um semiprimo par .\n\n- Para colocá-lo algebricamente, 2 n + 1 = p + 2 q sempre tem uma solução nos primos p e q (não necessariamente distintos) para n > 2. A conjectura de Lemoine é semelhante, mas mais forte que a conjectura fraca de Goldbach .",
				"added": 1543441576
			},
			{
				"comment_id": 24,
				"body": "#Diferenças entre primos consecutivos.\n1, 2, 2, 4, 2, 4, 2, 4, 6, 2, 6, 4, 2, 4, 6, 6, 2, 6, 4, 2, 6, 4, 6, 8, 4, 2, 4, 2, 4, 14, 4, 6, 2, 10, 2, 6, 6, 4, 6, 6, 2, 10, 2, 4, 2, 12, 12, 4, 2, 4, 6, 2, 10, 6, 6, 6, 2, 6, 4, 2, 10, 14, 4, 2, 4, 14, 6, 10, 2, 4, 6, 8, 6, 6, 4, 6, 8, 4, 8, 10, 2, 10, 2, 6, 4, 6, 8, 4, 2, 4, 12, 8, 4, 8, 4, 6, 12",
				"added": 1543441592
			},
			{
				"comment_id": 25,
				"body": "> [zaitsev](#comment_24_1PqwSiizFr8j1LRqegXwZPixWiQEntzc3c): Diferenças entre primos consecutivos.\n> 1, 2, 2, 4, 2, 4, 2, 4, 6, 2, 6, 4, 2, 4, 6, 6, 2, 6, 4, 2, 6, 4, 6, 8, 4, 2, 4, 2, 4, 14, 4, 6, 2, 10, 2, 6, 6, 4, 6, 6, 2, 10, 2, 4, 2, 12, 12, 4, 2, 4, 6, 2, 10, 6, 6, 6, 2, 6, 4, 2, 10, 14, 4, 2, 4, 14, 6, 10, 2, 4, 6, 8, 6, 6, 4, 6, 8, 4, 8, 10, 2, 10, 2, 6, 4, 6, 8, 4, 2, 4, 12, 8, 4, 8, 4, 6, 12\n\n#Distribuição de frequência dos intervalos entre primos consecutivos para primos até 1,6 bilhões. Os picos ocorrem em múltiplos de 6. \n- https://web.archive.org/web/20181128212602if_/https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Prime-gap-frequency-distribution.svg/1280px-Prime-gap-frequency-distribution.svg.png",
				"added": 1543441612
			},
			{
				"comment_id": 26,
				"body": "#Estrutura oculta na aleatoriedade da sequência do número primo?\n- https://web.archive.org/web/20181128214746/https://arxiv.org/pdf/cond-mat/0310148.pdf",
				"added": 1543441689
			},
			{
				"comment_id": 27,
				"body": "#Grandes lacunas entre números primos consecutivos\n- https://web.archive.org/web/20181128214953/https://arxiv.org/pdf/1408.4505.pdf",
				"added": 1543441825
			},
			{
				"comment_id": 28,
				"body": "#Partição\nEm Teoria dos números, partição de um inteiro positivo n é uma forma de decomposição de n como soma de interos positivos. Duas somas são consideradas iguais se e somente se possuem o mesmos numero de parcelas e as mesmas parcelas, mesmo que em ordem diferente.\n\n#Exemplos\n\nAs cinco partições de 4 são:\n\n4 = 3 + 1 = 2 + 2 = 2 + 1 + 1 = 1 + 1 + 1 + 1\nE as onze partições de 6 são:\n\n6 = 5 + 1 = 4 +2 = 4 + 1 + 1 = 3 + 3 = 3 + 2 + 1 =\n= 3 + 1 + 1 + 1 = 2 + 2 + 2 = 2 + 2 + 1 + 1 = 2 + 1 + 1 + 1 + 1 = 1 + 1 + 1 + 1 + 1 +1\n\n#Função de partição\n\nA função de partição p(n) representa o número p de possíveis partições de um número inteiro positivo n; assim, p(4) = 5 e p(6) = 11. Por conveniência, define-se p(0) = 1, (compreensível se for pensado que 0 só se escreve apenas como ele mesmo uma única vez, semelhante a 1) p(n) = 0 para valores de n negativos. \n\n#Uma expressão assintótica de p(n) foi obtida por Godfrey Harold Hardy e S. Ramanujan em 1918, de forma independente por James Victor Uspensky en 1920:\n\n\n- https://web.archive.org/web/20181128215700/https://wikimedia.org/api/rest_v1/media/math/render/svg/a11a3eee425f44c7e136d36fa5439af5088267b2",
				"added": 1543442500
			}
		]
	},
	"comment_vote": {}
}