{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "如何评价华为回应李洪元被羁押 251天：支持其运用法律武器维权？",
			"body": "作者：刘琛\n链接：https://www.zhihu.com/question/358967893/answer/921496655\n来源：知乎\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。\n\n回应没有问题，符合华为的一贯风格，硬刚。任号称学习一代目的标兵，这个公司的风格就是带着毛派的风格。这个不表。更想谈的是这件小事本质上体现了社会哪些矛盾。最表象的就是劳资纠纷，经济不景气，蛋糕无法做大，资本又要维持利润，只有加大对劳动力的剥削，996成了福报，连加班给加班费的最低底线，现在成了可遇不可求，成了好公司的评判标准。西方经历过的大规模劳资纠纷不可避免的将会在我国日益涌现，如何处理这个问题，维持劳资双方的平衡将成为社会治理的重要难题。李宁教授还在看守所里面待着呢，比这个恶劣多了，但是木有牵涉到劳资问题，舆论并没有如此汹涌。第二是关于资本裹挟公检法的问题，华为极限操作将人关了251天，这才是最致命的，公器私用是大忌，雷霆雨露莫非君恩，几千年的传统，现在倒好了，连小小商人都能这么搞了，还理直气壮。前有鸿茅药酒跨省抓人，再有南山不败客，资本插入司法的手太深了。司法是上层建筑，资本都能插手，这不是毛认为的资本主义复辟是什么？？最尴尬的是政府一直强调依法治国，目前也在步步规范司法程序，然后政府按法律办事了，资本插手司法却来个一浪高过一浪。第三个问题就是最深层的问题，思想混乱问题，建国理论与现实现状的极大矛盾。一切社会问题都不可避免的夹杂这个根本矛盾。简单来说到底是姓资姓社的问题，明眼人都知道目前是挂羊头卖狗肉，宪法是无产阶级，社会主义，实际是国家资本主义混杂着私人资本主义，还有农村中岌岌可危的集体经济。前三十年大家饿肚子，主要矛盾是发展经济，资本主义的成分非常弱小，没有力量挑战或者参与上层建筑，所以前三十年普通民众主要的感观是厌恶国家公权对自我的钳制。但是经过几十年的发展，资本主义力量不断发展，不可避免的要求在上层建筑获得支持，而且是要求根本上的支持。因为实际上从鸿茅药酒，南山不败客，华为此事件来看，资本已经在法律面前获得了普通个人或者团体不敢想象的优势，但是他们还是不会满足，因为这种优势是操作上的优势而并没有写在纸面上，资本不会满足挂羊头卖狗肉，他要的是挂着狗肉卖狗肉。因为资本的强大，普通民众也反应过来了，资本的剥削比建国初期的国家公权更可恶，毕竟当年国家资本还有企业办社会，生老病死全包了。所以尽管网络上公知大V鼓吹小政府，但是底层民众却是强烈支持不断加强政府权威，可能有国际局势恶化因素的推动，但是最大的动力是希望借政府力量来压制资本的力量，也是无奈之举，再不支持政府，资本力量就可以为所欲为了。单单举华为例子而言，华为就是敢八年重签劳动合同，明显是恶意钻空子，这就是对社会主义的最大嘲讽。改革开放初期可以当鸵鸟，对于姓资姓社避重就轻，避而不谈。现在已经无法逃避了，如何解决思想上的混乱，才是根本中的根本。华为在这个案子里面有错么？？没有，他是按这个制度许可下来玩的，而且玩到了极致，程序没有任何问题，就是能关你251天。但是从理论上有错么？有错，大错特错，无产阶级领导的社会主义国家绝不允许资本借用司法力量打压工人阶级以及无产阶级。社会主义天然站在工人一边，他的屁股就是坐在弱者一边。舆论如果没有坐在弱者这边，那就证明我们社会主义教育是失败的。吊诡的是从小到大教育的是社会主义思想，进入社会才发现这已经是个彻底的资本主义世界了，一个人的身子在资本主义世界，脑子却在社会主义世界，就好比人的脑袋配着狗的身体，不伦不类，可笑至极。可以这样说，华为如果是美国企业，在美国这样搞这样回应，没有任何问题，一方面资本主义就是站在资本一方，辛普森案就是如此，人人都看得出是漏洞，但是这个漏洞跟根本制度而言，根本不值一提，资本主义必然会维护制度，而不会去堵偶然的漏洞，另一方面其制度有着律师跟受害者合伙的社会赔偿起诉来维护当事人利益。但是中国不同，中国是社会主义国家，我们根本制度是保护工人和农民，实际上有么？？没有？上层建筑跟经济基础脱节了。长此以往，要么改变上层建筑要么改变经济基础。否则只会越来越痛苦。身为一个普通百姓，我站在党国一边，希望姓社而不是姓资。但是姓资姓社不是比人头，是比经济力量。今天国有资本还占有主导地位，有能耐苦苦支撑名义上的社会主义。但是三十年以后，五十年以后，国内养大的企业席卷全球，晋升为跨国巨鳄，世界资本，那时候社资力量就会发生重要变化，你改还是不改。人微言轻。但是当局如果永远当鸵鸟，只会拱手让人。香港已经发生了，凭什么断定大陆不会发生。舆论汹汹，不是恨华为，是恐惧现实的潜规则被摆上台面，到那时真是做牛做马一辈子，不但自己连子孙后面也是大概率困在底层，翻身不得。无论姓李的多么不简单，插手司法拘押251天已经让人心寒至极。身为一个马克思主义者，如果制度不纠正，那么马克思告诉我的是最好去当一个资本家，衮衮诸公应当努力晋升资本家行列，大概率30年以后真姓资了，就再也没有翻身的机会了。但是我更希望的是，社会主义应当被重新拾起来，去认识。我们的教育就好比和尚念经，只有懵懂社会主义思想，却没有系统社会主义教育。拜着佛祖，念着经，却每天在做着基督教的礼拜，迟早从了基督",
			"added": 1575402167,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "什么是无产阶级，怎么区分？",
			"body": "资产阶级拥有生产资料，而广大无产阶级者只有劳力，只能够出卖劳动力，去换取薪酬，但是我们的出卖的劳动力越多，那么我们就会越是被剥削。工资是资本家为了保证劳动力的情况下支付的能够让劳动力能够存活的基本资金。而我们工时产出的产品的大部分都是被资本家剥削了的。\n我们有奴隶条款\n有996福报\n有人民富豪\n这些已经不再遮掩了，已经明目张胆的剥削了！\n\n所以以我的地位去看待问题，无产阶级当然要思考无产阶级该思考的东西，那就是反抗剥削。夺回属于自己的劳动果实。",
			"added": 1589019734,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "极端民族不可取！",
			"body": "如果修一个路也要投票表决，那么国家的基建工程也不用做了，修一条路就能让几个集团扯皮扯上几个月甚至几年",
			"added": 1590822483,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "如何像资本家一样剥削？",
			"body": "资本家的最大的秘籍就是剥削，剥削剩余价值。即便再怎么冠以别名吹的天花乱坠，它的根本的获取利益的方式是不会变的，靠的就是剥削，靠的就是把底层人民不当人，只是能够说话的工具。为了稳固自己的资本家的地位，我要如何做呢？\n\n重点来了，要让无产者对于资本家来说没有任何的威胁，那就是挑起群众斗群众，让他们自己内耗，难以形成统一战线。\n         这就要说到矛盾了，如果说没有矛盾怎么办，没关系，那就创造矛盾，比如有人天天划水，并没有干什么活儿，但是给他涨工资也就竖起了一块靶子，或者招新人，给新人高工资，让老员工与新员工合不来。或者说有人不满于自己的工资，做的多得的少，那么可以给他涨工资，然后让他一个人做两个人的活儿，然后就是要辞退另外一个人了。如果接受了，一切皆大欢喜，如果没有，顾及到会被辞退，也就无心反抗了。\n        说到底就是找不同，城里人，乡里人，收入多的人，收入少的人，工资高的人，工资低的人，读书多地人，读书少的人，男人，女人，性取向正常的人，性取向同性地人，外地人，本地人，等等不一而足。\n这些不同点，都可以用来做文章，都可以用来创造矛盾，重点是要让他们忘记自己是被剥削的，要不断地强化他们之间的不同点，弱化他们之间的相同点，至此，就是享受资本的好处的时候了。",
			"added": 1591593846,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "为什么中国的工人阶级、中产阶级、农民阶级将越来越虚弱",
			"body": "中国的下岗潮让工人再也不是自己的劳动成果自己拥有，而是变得你越是努力你越是贫穷，《劳动法》形同虚设。各种欠薪讨债被打，上访被打。层出不穷，从未断绝。\n而中产阶级在各种所谓“企业家”的手段下，闻到“女权”的味道，犹如得了闻到了屎的狗一般，顿时激情百倍。更别说这种刺激还有好几种：“地域”，“民族”，“婚姻”。只要能够有差别的，就能够挑起对立，分散中产阶级的内部力量。\n再说说农民，在中国立国之初，农民不单单要自己糊口度日，还需要产够城市人口足够的口粮。在城市百废待兴之时，城市并不能反哺农村。而现在在“合村并居”的政策下，随带着资本进入农村，并购大量土地，将农民从土地上赶出来，成为一无所有的只能出卖劳动力的工人，但是由于受教育水平有限，如今大多数的工作农民是不能胜任的。\n\n在这些政策手段之下，那些以鄙视底层为荣，以鄙视无产阶级为荣，以卖国为荣，以骑在人民头上拉屎拉尿为荣的“官老爷”、“资本家”，要狠狠地给他们一个教训\n\n所以，我还是努力学习，早日将微博这种粪坑给搞掉，服务器给弄掉，数据给彻底删掉。中国中央人民政府网站就是下一个了",
			"added": 1613275985,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"6_18JqgXYQvzEHxKm3CyMN3k9JxsPfVpisJm": 1
	},
	"next_comment_id": 9,
	"comment": {
		"21_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 1,
				"body": "目前两极分化，数据来看，不容乐观，更何况连提出996福报的人都能当人民富豪了，外加阅文集团压迫作者，连奴隶契约都出现了，革命的种子已经种下，但是如果一旦内部动荡，那么美国就会长臂管辖了。本来是我们中国的家务事，到时候谁都想参一脚，如果真的请进这尊大神，请神容易送神难。到时候我们未必能够有现在的环境。我的看法是如若要闹，那么必然会是有其他势力参与进来的，可以利用但是绝不能信任。",
				"added": 1589018897
			},
			{
				"comment_id": 2,
				"body": "香港问题如果单单以境外势力渗透是不足以服人的，更重要的是由于贫富差距加大，资本剥削严重，这才让有人有了请神的口子。但是美国要的是小弟，不会交一个和他一样强大的朋友的。",
				"added": 1589019058
			}
		],
		"3_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv": [
			{
				"comment_id": 3,
				"body": "> [360breakingwall](#comment_246_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV): 按照姨学观点，无产阶级是一系列价值观，方法论和物质现实的总和。无产阶级最显著的特点是没有什么可失去，因此没有必要维持自己的声誉和信用，便宜占尽，人得罪光。 [...]\n\n真是幼稚，可笑",
				"added": 1590821772
			},
			{
				"comment_id": 4,
				"body": "> [360breakingwall](#comment_246_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV): 按照姨学观点，无产阶级是一系列价值观，方法论和物质现实的总和。无产阶级最显著的特点是没有什么可失去，因此没有必要维持自己的声誉和信用，便宜占尽，人得罪光。 [...]\n\n按照你说的，无产阶级认为自己没什么失去的，全球赤贫才最好，那么为什么前苏联能够爆发出那么大的生产力，那么为什么无产阶级要反抗剥削，按照你说的，躺着接受赤贫不好么。当资产阶级利用工业革命带来的科技，以及科技带来的生产力，其生产能力远远大于小工业手工劳动者生产力，能够用低价挤压这些销售工业者，让他们连口饭都吃不上，如果要吃饭就得去工厂打工。那么这是你说的他们以出卖自己体力赚钱为正道？如果说维持自己的声誉和信用不必要，那么为什么苏联要和美国冷战，说实话，这样一个巨大的无产阶级政权就静等别人抹黑不就好了，为什么要和美国冷战呢",
				"added": 1590822214
			},
			{
				"comment_id": 5,
				"body": "> [digitalworship](#comment_45_15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco): 苏联的生产力发展依赖科技，苏联的科技有四大板块，一是沙俄留下的，二是大萧条时从美国引进的，三是二战时美国赏的，四是二战后间谍偷的。经过麦卡锡主义清洗苏联间谍大量减少，而且难以接近最新科技，所以苏联七八十年代技术发展继续延续五六十年代技术风格，被嘲笑傻大黑粗，其实二战前后美国技术风格也是这样。斯大林勃列日涅夫政权是地道的官僚政权，没有无产阶级啥事。世界上也不会有啥无产阶级政权。一旦有政权，就会少数人执政成为统治者，多数人被排除在外成为被压迫者。\n\n还有问题你并没有说明或是解答，你只是在说，屠龙少年一旦屠龙成功便成龙",
				"added": 1590835200
			}
		],
		"1_1BLLv2YRUobiEVbg1KDJQmbaqA3iN6Cnh": [
			{
				"comment_id": 6,
				"body": "你是没读过历史书？难道中国的教育差到这种地步？",
				"added": 1591179898
			}
		],
		"1_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": [
			{
				"comment_id": 7,
				"body": "打砸抢烧，不反你难道还要贴着叫砸的好？别人正常生活都没有还想然人念你好？脑子没问题吧，保险还是到医院检查一下脑子长没长吧",
				"added": 1591180166
			}
		],
		"18_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 8,
				"body": "民主的基础来自于民众，关键是民众有政治意识以及能够分得清局势，中国人当中有些人连一元二次方程都特么算不出来，搞民主完全就能把整个社会忽悠瘸。很多人一听到民主自由，立马就想到西方国家，第一，西方国家立场在资本权贵那里，不可能关照屁民。第二，并不是所有的社会制度就能够行之四海而皆准的，再不济也是要改革成适合那个国家的权力架构。\n从来就没有什么好的政治架构，能够正常运作的架构就是最好的。中国从洋务运动开始，直到共产党建立政权，已经试过了各种不同的政治架构，从君主立宪到资本主义，从中试过了种种，但是最终效果都不理想，一直试到了共产主义。说实话，第一届和第二届共产党确实是一直在为人民服务的。但是后面的政府已经完完全全的官僚主义了。",
				"added": 1591180945
			}
		]
	},
	"comment_vote": {
		"16_1Nv9coai3XzgiS8VgetKQF7VXxfZZoJq93": 1,
		"3_182mU2LywyDTzH2c9w5KjXfJvubxpnuCDH": 1,
		"4_1N8PgNmoqLHQsHVMqSNvndW4PsnVTo5mt8": 1,
		"1_1MDXPHaN8SwQeeUpDYc1bcHASTRCJiqSEX": 1,
		"4_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN": 1,
		"23_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": 1,
		"15_1ARf4SpYy1bTHXDAEyXVmEbxrcvVreUaNF": 1
	}
}