{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1598404536,
			"title": "The 4th Reich is being re-established...",
			"body": "#WakeUpAmerica\n\nExcerpt from \"On the Chariot of the Sun\"\n\nIn the early days, the CIA headed by Allen Dulles, a dedicated follower of Hitler, was filled with former Nazis.\n\nThis is because the CIA came into existence after the war partly for the purpose of giving a home to the 'Gehlen Org', the German intelligence network. Many members of the Third Reich were brought into the US spy service through Dulles' 'Operation Sunshine', including Richard Gehlen himself (of the Gehlen Org). Hundreds of Nazi scientists and specialists were also covertly recruited by the US via 'Project Paperclip'.\n\nAs discussed in Endgame II, Germany under Hitler was technologically very advanced and may even have succeeded in producing an antigravity or 'stargate' machine. In The Hunt For Zero Point (2001) journalist Nick Cook reveals his findings suggesting that the technological 'Holy Grail' was then likely seized by the US at the end of the war.\n\nCook's scientist informant is quoted as saying, \"When the Americans tripped over this mutant strain of nonlinear physics and took it back home with them, they were astute enough to realize that their home-grown scientific talent couldn't handle it. That it was beyond their cultural term of reference. That's why they recruited so many Germans. The Nazis developed a unique approach to science and engineering quite separate from the rest of the world, because their ideology, unrestrained as it was, supported a wholly different way of doing things. Von Braun's V-2s are a case in point, but so was their understanding of physics. The trouble was, when the Americans took it all home with them they found out, too late, that it came infected with a virus. You take the science on, you take on aspects of the ideology, as well.\"\n\nhttps://www.bibliotecapleyades.net/marte/marte_endgame05.htm",
			"added": 1598404535
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1598362059_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": [
			{
				"comment_id": 1,
				"body": "> [aspidochelone](#comment_405_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I was thinking thank God somebody is finally covering news about Assange, it's a complete blackout ... this is from a site that rants on about the \"Holocaust Hoax\". [...]\n\nYep... http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598404536_1A67pkZNx64w3sii9TAUCdJhRsFowGpYrY/The+4th+Reich+is+being+re+established",
				"added": 1598404588
			}
		],
		"1598303763_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ": [
			{
				"comment_id": 2,
				"body": "bump...\n\n#WakeUpAmerica",
				"added": 1598404692
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 3,
				"body": "> [savethechildren](#comment_2_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ): Please Please Please hear me out!! [...]\n\nBump.... http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598303763_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ/Please+Save+The+Children+Please\n\n#WakeUpAmerica",
				"added": 1598404746
			}
		],
		"1598185671_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe": [
			{
				"comment_id": 4,
				"body": "Is this related?...\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598303763_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ/Please+Save+The+Children+Please",
				"added": 1598404811
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 7,
				"body": "> [geekless](#comment_254_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): At least two of IDs: [...]\n\nConspiracy theorist...\n\nJust wait until this guy or someone who believes him so passionately that they go and do actual investigative work to discover the Global Network of all the people related to the \"otbtechh22f4wcuo conspiracy.\" I mean, it would totally be doable, otbtechh22f4wcuo seems to have sufficient enough connections around the world that one could make a strong case for him or against him depending on which side you are on... Then, the mainstream media could go and have a field day depending on who that persons connections are, or the alternative news networks would begin to use it to prove that otbtechh22f4wcuo has been trying to save the world from tyranny for at least around 2 years now...\n\nThey might say, \"Yes, but look at his ties to these criminal organizations.\"\nAnd the alt news might say, \"Yes, but look at all the work he did for the government pro-bono to make up for it.\"\nAnd, the MSM might retort, \"The government is full of criminals who are tied to these same international crime rings.\"\nAnd the alt news might say, \"Yes, but otbtechh22f4wcuo worked with the least corrupt individuals to stop these international crime rings from becoming so powerful that the human population was reduced to no more than slaves.\"\n\nThen there would be silence.... because nobody wants to be a slave right?\n\nAs bigbadbob said, \"Who cares?\"\n\nYes, who cares if it is the same guy if that guy is working to stop injustice! smh...\n\nAnd last point I will make for now, what if this is all part of otbtechh22f4wcuo's plan? Ever think about that?\n\nIts not hard to manipulate humans once you understand how they operate, and perhaps this is what otbtechh224fcuo has been doing this whole time? Maybe what he has done here by splitting his personalities up and using different IDs is just to prove a point that he is a lot more clever than some on ZeroNet may have originally thought.\n\nOr, maybe he is trying to send a message to his future followers who are likely reading this right now and don't even realize it yet since otbtechh22f4wcuo is so good with anonymity according to that thread anyway lol :)\n\nEither way, try using stylometric analysis, but if this otbtechh22f4wco guy is really so good at anonymity his most important works will not be identifiable lol... Gotta love the crazy ones right? xD\n\nhttps://programminghistorian.org/en/lessons/introduction-to-stylometry-with-python\n\nhttp://www.aicbt.com/authorship-attribution/online-software\n",
				"added": 1598438545
			},
			{
				"comment_id": 8,
				"body": "Also, there's this from August 22 posted by otbtechh22f4wcuo, \"(This is the new ZeroID for OTBTechnologies as I have run out of available data on the original profile; once this account's data limit is reached I will likely be going back semi-anonymous. The only reason I was not originally semi-anonymous was because I am still introducing new users to this platform and I wanted them to feel at home. ^_^)\" in thread http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+NOW+before+this+is+taken+down+ShadowGate\n\nI mean if he is going back semi-anonymous after revealing some fucked up stuff about the government it would make most sense to do it incrementally right? So, in this manner his closest follows can still identify him as they continue to join ZeroNet. Eventually this guy will probably be invisible to you all and you won't even realize he is still posting here... \n\nAgain, if otbtechh22f4wcuo is fighting tyranny, does it matter if these are \"all the same guy\" in that case?",
				"added": 1598440331
			},
			{
				"comment_id": 9,
				"body": "> [kapec](#comment_33_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Cool samefaging m8.\n\naaaand... now that I have everyone's attention... :)",
				"added": 1598475145
			},
			{
				"comment_id": 11,
				"body": "> [kapec](#comment_35_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I'd say you're not very intelligent to majority of us on zeronet. [...]\n\nFirst off, how many of you have college degrees beyond an associates degree (if that...?)\n\nSecond, have you ever had your life threatened by the government for exposing their corruption?\n\nThird, I'm pretty sure a business counts as anything that turns a profit..\n\nFourth, I majored in business in college...\n\nFifth... Dietz Nuts Nigga... :)",
				"added": 1598565812
			}
		]
	},
	"comment_vote": {
		"405_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"104_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"2_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ": 1,
		"1130_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1
	}
}