{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1548888322_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1561471236_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 1,
				"body": "> [realjohndoe](#comment_26_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): I have said it many times. I don't think a PUBLIC! #US online social media site should have the right to censor any free speech that inst illegal. It's a violation of human rights, international law and it's un-American. Maybe his thousands of viewers know it's all lies, and just support him for the entertainment. That's really for his viewers to decide. Not you, not me, not apple, not Facebook Etc. If it's not illegal speech, it's discrimination and wrong!\n\nThere's no such thing as \"illegal speech\".  Speech \"...neither picks my pocket nor breaks my leg\" so there can't be any secular laws prohibiting it.  The only form of speech which might fall under secular purview is to falsely accuse someone as in a court of law.\n\nWhimsical laws motivated by religious, social or leveling impulses (not an exhaustive list) prohibit all sorts of things and if it weren't for the people with guns I'd ignore them completely (think of the care one must exercise living under oppressive regimes).  But they certainly have no moral bindings on me.",
				"added": 1533956301
			},
			{
				"comment_id": 2,
				"body": "Madame Thérèse Defarge...",
				"added": 1533959130
			},
			{
				"comment_id": 3,
				"body": "> [krakodeal](#comment_17_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): Agree. There is no such thing as illegal speech.But there is no good reasons to keep someone's speech available on your server if you think it is crap. Youtube owners decided that they had enough of this crap and banned this idiot from their service.Still Alex Jones benefits from this ban more than google so now he can tell his \"I told you!\".\n\nAnd I agree with you.  We're very agreeable fellows, eh?  From a property rights point of view YT can have whatever they want on their service.  That of course means *not* having what they don't want on their service.   Whether or not we agreeable fellows think something is crap has no bearing on that right.  They could have the 20 hour 12 part dramatization of \"The Protocols of the Elders of Zion\"[*] and we'd both have to be fine with that.\n\nAnd yes, Alex Jones can only benefit.  Actually plotting against a paranoid can only enhance them in the eyes of their followers and gain them new followers at the same time.\n\n---\n[*} There's no such thing.",
				"added": 1534473200
			}
		],
		"1535639513_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX": [
			{
				"comment_id": 4,
				"body": "And with dowsers and phrenologists they should catch them in no time.",
				"added": 1535646146
			}
		],
		"1537844772_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": [
			{
				"comment_id": 5,
				"body": "> [swastika](#comment_20_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): Everything that can become corrupt will become corrupt, if it isn't already corrupt. I'm not talking only about technology here, everything. All that is due to the incredible amount of power concentration whether it's in corporations, governments, media, entertainment, technology, education, etc.\n\nIf you go to your grocers and pick a jar of corruption off the shelf and look at the ingredients list you will find the first ingredient to be secrecy.  Anything that's secret is corrupt.  If you don't air it out it rots.",
				"added": 1537879253
			}
		],
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 6,
				"body": "a. Game theory:  Tit for Tat with forgiveness (I use 1/7th for forgiveness).\n   \"Always cooperate first time then do what they did last time.\"\nb. Pragmatics: \"a.\" above works best in all simulated scenarios.",
				"added": 1542046423
			},
			{
				"comment_id": 7,
				"body": "> [robione](#comment_84_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): link that paper, it's a good read.\n\nThe links I used in my summer course were:\nhttps://www.forbes.com/sites/rogerkay/2011/12/19/generous-tit-for-tat-a-winning-strategy/#726d266266eb\n\nhttps://www.youtube.com/watch?v=fvQgXEXyiUk",
				"added": 1542052300
			}
		],
		"1553950519_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": [
			{
				"comment_id": 8,
				"body": "> [leftside](#comment_690_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Is it something to do with archive.org?\n\nI understand archive.org is looking at working with ipfs.ip which should scratch the P2P itch some of us feel.",
				"added": 1554150646
			}
		],
		"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 9,
				"body": "If you have nothing to hide then why aren't you naked?",
				"added": 1554493114
			}
		]
	},
	"comment_vote": {
		"262_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1
	}
}