{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1602785026,
			"title": "Social Network On IPFS PubSub.",
			"body": "Just a lightning fast open source peer-to-peer cross-platform social network that doesn’t sell you out.\n\nhttps://github.com/QuestNetwork/qDesk/",
			"added": 1602785025
		},
		{
			"topic_id": 1602785059,
			"title": "The Library Genesis aggregator is a community aiming at collecting",
			"body": "The Library Genesis aggregator is a community aiming at collecting and cataloging items descriptions for the most part of scientific, scientific and technical directions, as well as file metadata. In addition to the descriptions, the aggregator contains only links to third-party resources hosted by users. All information posted on the website is collected from publicly available public Internet resources and is intended solely for informational purposes.\nLibrary Genesis - aggregator items is a website that collects and organizes online items from users. Item aggregation is done for fact-finding purposes, and website Library Genesis respects the rights of copyright holders and respect dcma. Removing Content From Library Genesis / DMCA Policy Library Genesis respects the intellectual property of others.\nIf you believe that your copyrighted work has been copied in a way that constitutes copyright infringement and is accessible on this site, you may notify our copyright agent, as set forth in the Digital Millennium Copyright Act of 1998 (DMCA). For your complaint to be valid under the DMCA, you must provide the following information when providing notice of the claimed copyright infringement:\n\nA physical or electronic signature of a person authorized to act on behalf of the copyright owner Identification of the copyrighted work claimed to have been infringed\nIdentification of the material that is claimed to be infringing or to be the subject of the infringing activity and that is to be removed\nInformation reasonably sufficient to permit the service provider to contact the complaining party, such as an address, telephone number, and, if available, an electronic mail address\nA statement that the complaining party “in good faith believes that use of the material in the manner complained of is not authorized by the copyright owner, its agent, or law”\nA statement that the “information in the notification is accurate”, and “under penalty of perjury, the complaining party is authorized to act on behalf of the owner of an exclusive right that is allegedly infringed”\nThe above information must be submitted as a written, faxed or emailed notification to the following Designated Agent: ianzlib@protonmail.com. Appeals will be reviewed within 72 hours.\n\nhttps://libgen.lc/",
			"added": 1602785057
		},
		{
			"topic_id": 1602786830,
			"title": "freeread.org For the human right to read",
			"body": "freeread.org: For the human right to read\n\nfreeread.org’s mission is to fight for the human right to free education, and the human right to share in and benefit from culture, arts, and scientific knowledge per United Nations Universal Declaration of Human Rights Articles 26.1 and 27.1.\n\nIn order to ensure this right, we need free-access global libraries, but ours are in danger.\nInaccessible knowledge\n\nA decade ago most of humanity’s scientific knowledge sat locked behind paywalls inside subscription databases, inaccessible to the world. If a scientist didn’t have the right subscription access they were charged $45 to read just one paper: equal to more than half a week’s salary in many countries. Many scientists couldn’t pay, so they couldn’t read.\nFree knowledge\n\nAnd so free libraries were born. Free libraries offer portals to bypass paywalls, download re-shared and scanned books from private libraries. The shadow libraries Library Genesis and Sci-Hub collectively offer over 5 million books and 80 million scientific articles for free to the world. Democratizing science to bring knowledge to all people means protecting these free libraries and fighting for their survival.\nEndangered libraries\n\nFree libraries face intense legal attacks from publishers like Elsevier, resulting in domain name seizures and default judgments of millions of dollars. Both Library Genesis and Sci-Hub have managed to continue their work, but accessing their domains is difficult for readers in some parts of the world. A chapter of the free internet is ending. A new chapter of the internet is here.\nDecentralized internet\n\nA new internet is emerging: de-centralized, autonomous, and democratically hosted. We can democratize knowledge and science by taking back control of science, education, and the internet - one book at a time. Let’s begin.\n\nhttp://freeread.org/",
			"added": 1602786827
		}
	],
	"topic_vote": {
		"1602785026_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1,
		"1602785059_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1,
		"1602786830_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1570989643_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 1,
				"body": "CQEGAcGXxsBNBF+HDvIBCACnpwsQt1XU8i6yz7A7inyB6vmejBnrWGbuksLXnhr0\nmkimHkBzVtIeUhZQBUa9aoTlIqMhLgjTpNxbRuMBMBjGqZ6i6zDUnF0FZThvHCCy\nlqGjzwB9MKjHYgQRUqO7JgWA/MyCBjaJ45S0dhl/YNUgvw53vuRGmuU1KQWGty/D\nlTgo8IhAlFihoRWpkgsxv1Ht5AHPSpq0iij4TCvcf7d7gT6UrCfiRJyBjtsfoMBx\na7FILFLag1AsM3tPOaBOw9mQUcPvnMYwSsW1l4dlMnD9X5GQpGTGgrRPqfzVcgmd\nIVNPv/j75jHskPWSImuZIEoVshAos3KDCIUpLik9wXOXABEBAAHNI1J1c2xhbiAo\nR2VuZXJhdGVkIGJ5IFJldHJvU2hhcmUpIDw+wsBfBBMBAgATBQJfhw7yCRCsNwuP\nEOK9lgIZAQAA/RUH/Aj7tlZnuT1uB1CV1qyBcs2qXJZQg/+y9mvIVJSQNE8EmVox\n7syJl7d9W5JPHPx5JDROmcJwb7pjfieeJE5LeCPZJQTcpfPoQywROCSxJrjW9oTw\neLDDC3lM0Fa2pQFYj68rvdRzi6UcJOLZoTtShnmrfhUoqSIbaC8OAR7GgSXuDMjw\nm0nZ6wBFZixya46xYeER5xdiyIO2xBha6TMuR3hC1p5cWdrvY8giUI0Mv6z/81HM\nbXSlIjGHV6zgyuj8HDQqaR2wwUZoqwALB7WMp7sUm/jpiBnEvT0mJHtlgURUT0Vc\n1/A0wrE6X/O/F3jwFTR/oYbiBryHHlE4qYMwXy4CBgUDkHTdvQMGwKhY/t29BAAG\nC015IGNvbXB1dGVyBRCWuldt410T42NYnohMb4wcBwN9AOg=",
				"added": 1602687261
			},
			{
				"comment_id": 2,
				"body": "CQEGAcGXxsBNBF+HDvIBCACnpwsQt1XU8i6yz7A7inyB6vmejBnrWGbuksLXnhr0\nmkimHkBzVtIeUhZQBUa9aoTlIqMhLgjTpNxbRuMBMBjGqZ6i6zDUnF0FZThvHCCy\nlqGjzwB9MKjHYgQRUqO7JgWA/MyCBjaJ45S0dhl/YNUgvw53vuRGmuU1KQWGty/D\nlTgo8IhAlFihoRWpkgsxv1Ht5AHPSpq0iij4TCvcf7d7gT6UrCfiRJyBjtsfoMBx\na7FILFLag1AsM3tPOaBOw9mQUcPvnMYwSsW1l4dlMnD9X5GQpGTGgrRPqfzVcgmd\nIVNPv/j75jHskPWSImuZIEoVshAos3KDCIUpLik9wXOXABEBAAHNI1J1c2xhbiAo\nR2VuZXJhdGVkIGJ5IFJldHJvU2hhcmUpIDw+wsBfBBMBAgATBQJfhw7yCRCsNwuP\nEOK9lgIZAQAA/RUH/Aj7tlZnuT1uB1CV1qyBcs2qXJZQg/+y9mvIVJSQNE8EmVox\n7syJl7d9W5JPHPx5JDROmcJwb7pjfieeJE5LeCPZJQTcpfPoQywROCSxJrjW9oTw\neLDDC3lM0Fa2pQFYj68rvdRzi6UcJOLZoTtShnmrfhUoqSIbaC8OAR7GgSXuDMjw\nm0nZ6wBFZixya46xYeER5xdiyIO2xBha6TMuR3hC1p5cWdrvY8giUI0Mv6z/81HM\nbXSlIjGHV6zgyuj8HDQqaR2wwUZoqwALB7WMp7sUm/jpiBnEvT0mJHtlgURUT0Vc\n1/A0wrE6X/O/F3jwFTR/oYbiBryHHlE4qYMwXy4CBgUDkHTdvQMGwKhY/t29BAAG\nC015IGNvbXB1dGVyBRCWuldt410T42NYnohMb4wcBwN9AOg=",
				"added": 1602779689
			}
		]
	},
	"comment_vote": {}
}