{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1,
			"title": "Infos web américain",
			"body": "Salut!Je voulais savoir comment fonctionnaient les lignes internet aux USA.. ils ont une box comme nous ou bien les lignes sont directes ? merci",
			"added": 1465256503
		},
		{
			"topic_id": 2,
			"title": "Zerowiki Fr: modif lexique Peer-to-peer",
			"body": "http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/?Page:home",
			"added": 1465332003
		},
		{
			"topic_id": 3,
			"title": "mon blog d'astuces",
			"body": "Retrouver les astuces que j'utilise tous les jours pour faire tout et n'importe quoi sur un ordi ou ailleurs.. :D\nhttp://127.0.0.1:43110/1Jk4S2xDVTyZiZmJ71PyDKNiVAyp8gLmRf/?Home\n",
			"added": 1465767850
		},
		{
			"topic_id": 4,
			"title": "Actu: Le Brexit et vous!",
			"body": "Perso je pense que le Royaume Uni ne faisait pas partie de l'Europe puisqu'il n'y avait pas d'euros ni d'espace Schengen... Le Royaume Uni va surtout éviter les merdes de Bruxelles comme pour l'agriculture ou les décisions financières . Le peuple informé se rend compte du bordel géant qu'il y'a dans le reste de l'Europe... Et vous qu'en pensez-vous? ",
			"added": 1466808804
		},
		{
			"topic_id": 5,
			"title": "Créateur de ZerowikiFR",
			"body": "Bien le bonjour, je suis le créateur du ZerowikiFR et je voulais vous dire que j'ai dû formater mon disque dur donc le site existera encore pour longtemps :D \nBonne soirée",
			"added": 1466890319
		},
		{
			"topic_id": 6,
			"title": "bug Zeromail / Raspberry",
			"body": "Salut!  j'ai un Raspberry Pi 2 et une debian d'origine. Le système est à jour. Quand je veux accéder à Zeromail et créer un compte, j'ai une page qui s'ouvre (sur Firefox) et ca m'affiche \"remote xul error\". L'onglet dans la barre du haut est intitulé \"problem loading\". Personne n'a ça sur sa framboise? Merci d'avance!",
			"added": 1471433188
		},
		{
			"topic_id": 7,
			"title": "Soutien aux policiers Français",
			"body": "Même si je ne peux pas saquer les flics qui se cachent avec leurs radars de merde pour niquer ceux qui vont bosser, je respecte les policiers qui font véritablement leur boulot en arrêtant les v(i)oleurs, les assassins etc... et surtout ceux qui vont dans les cités, qui se font insulter et se font prendre à parti, toujours la même catégorie de personnes qui, elles-mêmes, savent qu'elles ne risquent ent rien.. \nMême le gouvernement (anti)Français ne supportent pas leurs collègues en cas de coup dur, et c'est LAMENTABLE.\nBon je reviendrai plus tard!",
			"added": 1476904820
		},
		{
			"topic_id": 8,
			"title": "Usenet et newsgroup",
			"body": "Bonjour, j'aimerais savoir si c'est intéressant de s'abonner aux newsgroup en passant par usenet? Je ne sais pas quoi penser de ce \"réseau\"! Merci!",
			"added": 1478821126
		},
		{
			"topic_id": 9,
			"title": "ASTUCES BLOG avance",
			"body": "http://127.0.0.1:43110/1Jk4S2xDVTyZiZmJ71PyDKNiVAyp8gLmRf/?Home\n\nDécouverte de \"Album Pirate\" trouvé via 0list. Trouvaille du dernier album de Metallica sur un site de torrents, 2 jours avant sa sortie mdr!",
			"added": 1479506642
		}
	],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"1_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq": [
			{
				"comment_id": 1,
				"body": "Salut! Je trouve que c'est une excellent idée! MDR la pseudo guerre, j'ai vu ça ce matin ^^ tout le monde a bien dormi entre temps donc oui elle devrait être finie lol.  bonne soirée",
				"added": 1465337858
			}
		],
		"1_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": [
			{
				"comment_id": 2,
				"body": "bon je vois que mon sujet n'intéresse personne, beaucoup préfère débattre sur un topic qui n'est même pas français et qui parle du foot...",
				"added": 1465758207
			},
			{
				"comment_id": 5,
				"body": "merci pour ces indications! Je savais que les américains avaient le net depuis fort longtemps, d'après des reportages TV",
				"added": 1466540069
			}
		],
		"3_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": [
			{
				"comment_id": 3,
				"body": "mon blog est suivi c'est cool! merci à vous",
				"added": 1466023760
			},
			{
				"comment_id": 4,
				"body": "Nouveau sujet ce soir!",
				"added": 1466026205
			},
			{
				"comment_id": 7,
				"body": "Une astuce supplémentaire orientée Android!",
				"added": 1466554861
			}
		],
		"1_17j27HKQPHHVbp3mmFQj7rRcjNDvDwiCji": [
			{
				"comment_id": 6,
				"body": "Sur Piratebay, tu trouves quelques films en truefrench.. mais sinon il y'a cpasbien.cm  qui a les derniers contenus ;)",
				"added": 1466540262
			}
		],
		"1_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 8,
				"body": "pleer.com c'est niquel! Personnellement, je fais une recherche Google avec: index of:metallica   (metallica est un exemple qui marche bien). Et je tombe sur des serveurs qui me permettent de DL directement les musiques ou tout autre contenu. Va voir sur Blog Astuce, j'ai fait un tuto ^^",
				"added": 1466809254
			},
			{
				"comment_id": 9,
				"body": "Au fait, il y'a un site musical sur le web classique qui diffuse de la musique libre de droits, c'est: jamendo.com\nBonne continuation",
				"added": 1466890543
			}
		],
		"5_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": [
			{
				"comment_id": 10,
				"body": "bonsoir! Mon blog c'était le suivant : http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/",
				"added": 1467508631
			},
			{
				"comment_id": 11,
				"body": "J'ai eu l'idée de faire le zerowiki fr et en parlant avec Openuser, il a proposé d'y contribuer également! C'est une bonne coopération, surtout que son blog OpenUser est vraiment bien abouti et donc cela prouve qu'il a beaucoup de compétence dans ce domaine! ",
				"added": 1467546515
			}
		],
		"5_16z1hkD8sJLAA7etbrHivbz4G4Zj6Y4ofC": [
			{
				"comment_id": 12,
				"body": "Salut! Je me sers souvent de Links aussi, quelle vitesse :D Oui j'ai remarqué que la navigation sur Zeronet ne fonctionne pas, c'est con! Et je n'ai pas de solution non plus pour le moment!\nA vos claviers !",
				"added": 1467925162
			}
		],
		"3_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": [
			{
				"comment_id": 13,
				"body": "salut! Pour ma part, je n'ai pas de nas, juste un raspberry (sans interface graphique). Pour me connecter avec un fichier.ovpn, j'installe OpenVpn et une fois que je suis dans le bon dossier, je fais:\nsudo openvpn monfichier.ovpn     et ensuite tu rentres login / MDP. Essaie et donne un retour ;)",
				"added": 1468959707
			}
		],
		"5_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 14,
				"body": "essaye openbazaar sinon... ca se sert du bitcoin ;)",
				"added": 1469823491
			}
		],
		"13_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 15,
				"body": "hasta la vista Torrentz!",
				"added": 1470698133
			}
		],
		"1_1P2bKj69E7TZthSdisXcio9n18uYgdCG4H": [
			{
				"comment_id": 16,
				"body": "j'adore le nom du site :D bonne continuation\n",
				"added": 1471333611
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 17,
				"body": "il y'a des astuces sur le \" blog astuces\" pour télécharger des musiques etc...",
				"added": 1472247755
			}
		],
		"1_1EMVG4bZxeXJFHf1oUQosLvGyV6dTQeJgs": [
			{
				"comment_id": 18,
				"body": "Pour ma part, je regrette seulement que ma mère ne soit pas juive. Je le serais du coup, et aurait une bonne place dans la société... Soit dans les médias, soit dans la politique, soit dans la finance",
				"added": 1479069325
			}
		]
	},
	"comment_vote": {}
}