{
	"next_comment_id": 15,
	"comment": [
		{
			"comment_id": 1,
			"body": "Нет идеи адаптировать движок под JS и выложить игры в ZeroNet? :)",
			"post_id": 4,
			"date_added": 1534508860
		},
		{
			"comment_id": 2,
			"body": "Кроме деперсонификации и всего, с ней связанного, у ZN есть два больших плюса:\n\n- Материалы тут не зависит ни от каких хостингов и капризов хостеров, властей, корпораций. И в идеале могут храниться вечно.\n\n- Вход сюда - некоторый потенциальный барьер. Из-за чего адекватность публики заметно растёт на фоне обычного Интернета и очень похожа на эпоху цифрового фронтира - Интернет и ФИДО конца 1990-х/начала 2000-х.",
			"post_id": 1,
			"date_added": 1534509247
		},
		{
			"comment_id": 3,
			"body": "> [hugeping](#comment_3_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): По второму, боюсь, что может повторить судьбу всех даркнетов... Но, поживём -- увидим. :)\n\nТут, по сравнению с большинством даркнетов, доступность инфо выше. И, хотя людей мало, информации с каждым годом все больше. И каждый новичок с каждым годом тут будет находить всё больше интересного. Процесс медленный, но выраженный :)\n",
			"post_id": 1,
			"date_added": 1534510930
		},
		{
			"comment_id": 4,
			"body": "> [hugeping](#comment_2_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): Нужно делать так. чтобы игра не грузилась пока ты ее не выберешь. Наверное, надо читать доки по ZeroNet. А так - технически - вообще без проблем.\n\nПросто один зайт  - одна игра. И ссылки в навигации между играми. Тогда каждый загрузит то, что интересно.\n\nТяжёлые файлы можно делать опциональными. Это режим, когда они грузятся не при загрузке зайта, а при обращении к файлу.\n",
			"post_id": 4,
			"date_added": 1534511136
		},
		{
			"comment_id": 5,
			"body": "> [hugeping](#comment_5_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): если на этом форуме кто-то начинает... гм... торговлю оружием итд, какая тут может быть защита? \n\nВладелец форума может запретить писарь на форум определённым ZeroID. Плюс каждый пользователь может заблокировать другого пользователя и в таком случае, кажется, перестаёт хранить у себя и раздавать контент заблокированного. Но тут не уверен, надо проверять :)",
			"post_id": 1,
			"date_added": 1534673605
		},
		{
			"comment_id": 6,
			"body": "> [hugeping](#comment_6_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): ВПросто игр сотни уже, на каждую зайт делать не очень удобно.\n\nНадо придумать автоматизацию. Клонируешь готовую игру, получаешь чистый движок. Заливаешь данные игры, переименовываешь, где нужно - и готово.\n\nЭто основная идея «правильных» зайтов, разделение движка и частного контента. Это и позволяет легко клонировать то, что нравится, получая чистый блог или форум без контента.",
			"post_id": 4,
			"date_added": 1534673821
		},
		{
			"comment_id": 7,
			"body": "На PC, почему-то, многие игры при переписывании с других платформ, теряли много изюминок и получали плохой геймплей. Самый яркий пример - Elite со Спекки. При переписывании на PC игра получила удаление невидимых линий, цвет, но полностью потеряла внутреннюю логику и лишилась ряда «пасхалок» :) Только к эпохе Frontier ситуацию исправили.",
			"post_id": 5,
			"date_added": 1534674154
		},
		{
			"comment_id": 8,
			"body": "> [anotherneko](#comment_4_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Про те же игры под DOS люди до сих пор регулярно вспоминают\n\nЛадно, вспоминают. Я в Master of Orion на телефоне иногда играю :D Особенно, когда в дороге в офлайн уйдёшь и книжки интересной в очереди нет, или читать надоело… 1993-й год, однако. 25 лет :)",
			"post_id": 12,
			"date_added": 1535539855
		},
		{
			"comment_id": 9,
			"body": "~~кто в армии служил, то в цирке не смеётся~~ Кто на программируемых калькуляторах играл, того минимализм в играх особо не привлекает :D\n\n…\n\nПомню ещё как нашего брата бесила в своё время мода на понижение цветовой палитры в видеоклипах. Мы только-только пережили 256 цветное виде на PC и привыкли к труколору, как нас пытаются вернуть в ужас прошлого! :D\n\nТа же фигня с имитацией понижения частоты кадров. Нет-нет, да дёрнется что-то в подсознании на тему «опять что-то тормозит!»…\n\nВот к чему не замечал таких претензий, что у себя, что у окружающих, это к музычке, имитирующей AY-3-8910 и аналоги со Спектрума и 8-битных приставок. Это было достаточно своеобразно, не противно и вызывает, скорее, ностальгию :D",
			"post_id": 13,
			"date_added": 1536594386
		},
		{
			"comment_id": 10,
			"body": "С Casio PV в нулевых не сталкивался? Интересный КПК был, конкурент Пальма. Там было 160x160 ч/б без градаций яркости. Процессор NEC V20, энергобережливый 80186. Музыки не было, зато от двух AAA батареек работало (не в режиме ожидания, а именно работы) 160 часов. В итоге игрушки там особо не прижились, но как читалка, девайс был отличный. Ну и как PDA. Всякие заметки и контакты активировались реально мгновенно из любого состояния. И скорость ввода текста виртуальной клавой была максимальной среди всех гаджетов до появления свайпа :)",
			"post_id": 14,
			"date_added": 1537692191
		},
		{
			"comment_id": 11,
			"body": "> [hugeping](#comment_17_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): Не, не сталкивался.  Погуглю. :)\n\nВот, [набросал в ZN-блоге](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:14:Casio+PV-S450+—+первый+КПК) :)\n\n> Были как раз Palm разные и Sony.\n\nНу, Sony тоже были на Palm OS и том же железе. А у Casio PV была своя платформа и своя ОС. Достаточно интересно организованые, хотя не так экзотично, как на Пальмах, когда всё в ОЗУ сидело, и хранилось, и выполнялось. В PVOS софт хранился во флеш-памяти, которая мапилась кусками на адресное пространство и оттуда же работал. Т.е. как и на Пальмах не требовалась загрузка из ПЗУ в ОЗУ, так что старт был мгновенным. Но зато была полная энергонезависимость. И выключаться можно было полностью, не поддерживая питание ОЗУ.",
			"post_id": 14,
			"date_added": 1537697004
		},
		{
			"comment_id": 12,
			"body": "Много лет назад щупал тогда ещё BeOS. Было приятно, быстро, но почти ничего из железа не определялось и не работало :) Больше с этой ОС не пересекался.",
			"post_id": 15,
			"date_added": 1539062333
		},
		{
			"comment_id": 13,
			"body": "У нас целый топик есть давний: [Гипотеза Сепира — Уорфа (о влиянии языка на мышление)](http://forums.balancer.ru/tech/forum/2008/04/t54441--gipoteza-sepira-uorfa-o-vliyanii-yazyka-na-myshlenie.html)\n\nОбнаружено не просто влияние языка на мышление, но влияние языка на структуру мозга :) Ну и на практике, конечно, мышление очень сильно зависит от языка. Мышление пользуется символами. Символы сегодня почти всегда переносятся языком. И у разных языков наборы и значения символов разные.",
			"post_id": 16,
			"date_added": 1540212120
		},
		{
			"comment_id": 14,
			"body": "Ещё о пиксельной графике. Для нас, из 1990-х, пиксели — это отстой. Потому что мы формировались сознанием в гонке за качеством и реалистичностью. Когда я виду в каком-нибудь музыкальном клипе упрощение цветовой палитры, для меня это до сих пор не спецэффект, а недостаток вычислительной мощности :D\n\nА вот нынешние дети формировались уже в среде реалистичного отображения. И для них такое упрощение — это именно art-эффект. Поэтому у них так и популярны Minecraft и пиксельная графика. Это для них компьютерная экзотика, форма эскапизма :)\n\nЭто я вспомнил сейчас, после того, как писал про пиксельную графику, что дочка делала: \n\nhttp://127.0.0.1:43110/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/?Post:25:WS2812+and+children+:)\n\nНадо эти мысли, как протрезвею, оформить в виде заметки в блог и [Храм Информационного Фронтира](/1LnBdExztQKGSb3wnnchtczk9dyzJQtUp4/) ;)",
			"post_id": 14,
			"date_added": 1544547596
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"5": 1,
		"6": 1,
		"15": 1,
		"18": 1
	}
}