{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1613257982,
			"title": "Fascism advances in the US following Trump acquittal",
			"body": "Today Trump was acquitted because, well, laws are a thing and you have to be fucking retarded to think what he said was an \"incitement to violence\". Or even more of a retard that you think impeaching him under those grounds wouldn't suddenly impeach a sea of Democrats for the same reason. \nhttps://youtu.be/k3RpxVFy-9s?t=280\n\nBut, we can't stop there can we? Until every political dissident is smeared into non-existence, and until every state votes blue out of fear, and until we have single party authoritarianism, the dems and their corporate counterparts won't be done. Take this lovely article:\n\nhttps://www.motherjones.com/politics/2021/01/the-insurrection-was-put-down-the-gop-plan-for-minority-rule-marches-on/\n\n\"With Republicans shut out of the White House and congressional leadership, minority rule is likely to intensify over the next four years in ways not seen in modern times.\"\n\nMinority rule? What? Hardly sounds like a problem. Why are liberals and the MSM drones so upset about this? \n\n\"This isn’t about which party wins elections, but whether democracy itself survives. Some anti-democratic measures were deliberately built into a system that was designed to benefit rich white men: The Senate was created to boost small conservative states and serve as a check on the more democratic House of Representatives, while the Electoral College prevented the direct election of the president and enhanced the power of slave states through the three-fifths clause.\"\n\nAh, there it is. It is racist to vote republican. Democracy isn't about votes, it's about who is ideologically favorable to win according to technofascist corporations. This, of course, is all despite the fact that \"rich white men\" are now literally profiting more than ever under Joe Biden and the Marxist agenda that preceded his election win.  The more social safety nets were implemented, the more Bezos and co. got wealthy. These are just the facts.\n\nIf the left, being the left, has no awareness of history and is now repeating it. If you live in the US, you will have two options.\n1. Say nothing, confirm, but maintain your beliefs. This will allow you to get by, presuming you bend the knee. Unfortunately everything you say will need to be anonymous, making it impossible for you to affect change and as a result, unable to prevent one party rule.\n2. Stand up for what you believe in and be denied products and services from colluding corporations. Be marginalized by average folk who insist you're a racist, and never enjoy yourself in public again.",
			"added": 1613257981
		},
		{
			"topic_id": 1615902626,
			"title": "Climate change and extreme weather.",
			"body": "The world is getting hotter. How much of that warming is specifically related to anthropogenic activity is yet to be quantified (despite our propensity to tax it). But, nevertheless, it does seem to be occurring and we are putting more CO2 into the atmosphere than would normally exist at background. In the spirit of polluting less if we can, something I believe in, it makes sense to reduce emissions in a controlled, economical manner. \n\n\"We know climate change triggers more extreme weather.\" We keep hearing this. Is it true? No. This battle cry is designed to terrify you into compliance. For some reason I am seeing this idiotic statement more and more often. Probably to support doubling down on government control while you're beaten down by COVID.\n\nMedia personalities who known nothing about climate science, have no qualifications, and haven't even spent any time researching it want to make bold claims like \"climate change is making weather disasters more frequent\" to scare you. It isn't and these people should stop scaring viewers. I specifically found some alarmist/lefty news sources to confirm this.\n\nWaPo: \"the link between recent Arctic warming and increased Northern Hemisphere blocking is currently not supported by observations\" https://www.washingtonpost.com/news/capital-weather-gang/wp/2014/02/20/scientists-dont-make-extreme-cold-centerpiece-of-global-warming-discussions/\n\nNOAA \"there has been little trend in the frequency of the stronger tornadoes over the past 55 years.\" https://www.ncdc.noaa.gov/climate-information/extreme-events/us-tornado-climatology/trends\n\nIPCC \"Current data sets indicate no significant observed trends in global tropical cyclone frequency over the past century\" www.climatechange2013.org/images/report/WG1AR5_Chapter02_FINAL.pdf",
			"added": 1615902624
		}
	],
	"topic_vote": {
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1612872237_14pSxPyLcN166TsqVnVQK8ZPLwdzHTkdki": [
			{
				"comment_id": 1,
				"body": "Oh the WHO research team who found no human to human transmission? Who, for some reason only investigated the lab 14 months later and then predictably found \"no evidence\" of the virus' origin?",
				"added": 1612905585
			}
		],
		"1613249444_163UBLKC6u68qLy8ymG8dQKzE4KXLm75yY": [
			{
				"comment_id": 2,
				"body": "Congrats on being the dumbest poster on here with the lowest quality shitposts seen to date. Muted.",
				"added": 1613256122
			}
		],
		"1613142823_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": [
			{
				"comment_id": 3,
				"body": "I think this is all more about dodging around creating discriminatory legislation that directly denigrates right wingers. Since that would make it exceedingly obvious that Biden is basically Hitler, they affect changes around their outcome to get what they want.",
				"added": 1613256215
			}
		],
		"1607300234_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 4,
				"body": "> [megasupersnail](#comment_6_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9): I beta tested gab censorship, and they are fucking lying cheats (like most usaers).they are a total cia (child rapist protection agency) honey pot, like the fuckers at parlorand you will see that most of the fake conservatives backing the pedos (if only opposing in words) are all for those... [...]\n\nhuh. Citation needed. not doubting you because this seems to be the way things are going. Just want to see some evidence to move anyone I know off of it.",
				"added": 1613256304
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "@quantumkitty I feel like you know UBI is not the answer and are just spurring conversation. Correct me if I'm wrong.\n\n> [deuxzaron](#comment_78_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): That would probably depend on how much ubi they give. $1000 a month is at least double most easy jobs\n\nUBI supporters haven't done any research. Which isn't surprising because, well,  they are UBI supporters and therefore are lazy. You could read into examples yourself, if they would not like to sound like a moron. Finland probably had the best success and while, short term, unemployment dropped, happiness did not improve and unemployment came roaring back ending the program. \n\nIt's almost like... if you hand everyone the exact same amount of money, the value of money decreases by exactly that amount. I get it. Difficult concept.\n\n> [deuxzaron](#comment_80_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): e\n\nSee now, that's that lazy attitude that makes you want UBI in the first place.",
				"added": 1613256463
			}
		],
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 6,
				"body": "> [megasupersnail](#comment_8_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9): my big problem here is the data limit trigger... even gates (8ko) would be shocked now...\n\nYou can open the sidebar and check the \"identity address\". Take note of it. The, go to  \\Zeronet\\data\\ and find the folder for this site (starts with 1TaLk). Open that up and under \\data\\users\\ find your identity address, delete the \"data.json\" file. Back to zero.",
				"added": 1613258308
			}
		],
		"1613587814_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 7,
				"body": "You can open the sidebar and check the \"identity address\". Take note of it. The, go to \\Zeronet\\data\\ and find the folder for this site (starts with 1TaLk). Open that up and under \\data\\users\\ find your identity address, delete the \"data.json\" file. Back to zero but deletes your old comments. Why is there a 50K limit? I dunno. Maybe nofish wanted us to start another site.",
				"added": 1613659985
			}
		],
		"1613642362_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 8,
				"body": "If one more billionaire who is buying every last square inch of land tells me I should own nothing.....",
				"added": 1613661072
			}
		],
		"1613425717_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "Been ages since I ran a Linux distro (because I like not being frustrated constantly). I used to really like Ubuntu but am told this is now an OS for plebs. Whats up with that.",
				"added": 1613661122
			}
		]
	},
	"comment_vote": {
		"27_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"18_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"71_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"12_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"60_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"61_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"120_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1
	}
}