{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "Well, lets see if I can learn finance from you.\nI dont know jack shit about it but Im thinking in investing a little money. Since Im brazilian and it seems that the socialist party will not endure another 3 years, a more market oriented goverment may actually make our companies values go up, and I may get some of this with your help.\nIf you have any books for beginners, Im game.",
			"post_id": 7,
			"date_added": 1457307012
		},
		{
			"comment_id": 2,
			"body": "> [theta](#comment_1_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma): @razkal I am sad to read the news about the situation in Brazil. The unemployment has doubled;  the president will stand trial (if I remember it correctly); many companies (e.g. Petrobras) has huge debts in the dollar, which has increased in value; and it looks like it going to be another year of negative growth.  However, as you write, political change is a first step out of this even if it will take time but this is maybe a good opportunity to get started, and you can go a long way with basic understanding and investing principles. Since the market is unstable, and I am cautious, I do not do much trading right now, so I am actually planning to write about my own trading/investment principles and book recommendations. I hope to publish at least one of those post this week.\n\nPlease do.\nSince we are living a crisis here, its actually a great opportunity to invest in companies that you know will not default but the stocks are very cheap like Petrobras. Because is state owned, the chances of they went bankrupt is minimal. And yet, in only 1 week, after the president was threatened with inpeachment, the stocks of PB valued 47%.\nLike I said before, I dont know jack shit about the market, but Im willing to learn at least the basics.",
			"post_id": 7,
			"date_added": 1457354390
		},
		{
			"comment_id": 3,
			"body": "> [theta](#comment_2_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma): I have never written any handbooks before so it is better for me first to get a feeling of how much you as a reader know (e.g. do you know what a stock is?) so I know where to start. I think it is better for me to adjust the information for the reader, so please, tell me what you want to know. If you want, you can send me a zeromail explaining what you want to know, and I will try to take that into account when I write my \"handbook\" (in a lack of a beter word).\n\nI dont know how to send emails through here yet so I will just write in here.\nI know what a stock is and so on, but I dont know how to make moves ON the market.\nI know that you have to buy low and sell high. The problem to me is how to \"read the data\" and know when a stock will go up or down.\nI cant stay all day long on the computer doing this so daytrading is not an option for me. \nI will probably hire someone to take care of the money, but I would to know a bit about the market so some times I can call him and tell which papers to avoid and what to buy or sell.\nThe very basic would be great, not just for me, but for any newcomwer to the site, I suppose.\nAnd thanks in advance.",
			"post_id": 7,
			"date_added": 1457407955
		},
		{
			"comment_id": 4,
			"body": "Thanks for your first post bro.\nJust a question. When you see stocks going up and down, or even entire sotck markets like NASDAQ going up and down and says that the stocks went up today 1,25%, them on the next day, it goes up another 0,8%. On the third day, it goes down 3%. Those percentages are compared to the day before, to a specific day of the week ( or month, or year) or what?\nI know it must be basic, but It had to be asked.",
			"post_id": 10,
			"date_added": 1457660943
		},
		{
			"comment_id": 5,
			"body": "> [theta](#comment_4_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma): I am happy to answer your questions!The percentage change is  based on yesterdays closing price. What it means is that yesterdays closing price/value will be the todays 100% value of the stock. So to give you an example: If the stock close at $100 at Day 1 and dropps to $97 at Day 2 that is a 3% dropp. BUT, for the third day, it uses Day2's closing price because it is now the new 100% value of the stock. To sum it up, any change in the stock price today is relative to  yesterdays closing price.\n\nSo if I have a stock worth $100, on day 2 the stock goes down to $99, and on day three it goes all the way up to $101 dollars, it had a 1% or 2% rise?\nThe reason I ask this in % is that for some reason, everytime news programs talk about economy in Brazil, they say the value in money, the % that went up or down and when talking about the entire sotck market (BOVESPA stock exchange) they say a score that I dont know what it means.\nAnyway, should I be worried about the % or should I stick with values in dolars? If you guys dont work in %, them I will just drop this and stick with the real value in currency.",
			"post_id": 10,
			"date_added": 1457758074
		},
		{
			"comment_id": 6,
			"body": "> [theta](#comment_7_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma): It had a 2% increase. About your second question, there is a difference between when we talk about \"the economy\" and \"the market(s)\". The economy is the country or a region's economy (e.g. South America). They usually measure the growth of an economy as a GDP. Then there is \"the market(s)\" that includes all the financial markets, such as the stock market, commodities market, etc.(e.g. when they speak about BOVESPA). If they use money as a measurement of the markets, they are probably talking about the entire index value. The index value is calculated on a daily basis. This calculation is the sum of the value of each company in the index. Do you understand, if not, keep on asking.\n\nNo. I get it. I think we can move on with basics and go back here once I get better understanding of the stocks as a whole. If we dont need to know this right now to understand how to make investments, we can put this on hold.",
			"post_id": 10,
			"date_added": 1457822283
		},
		{
			"comment_id": 7,
			"body": "Im still here. Keep going and thanks for your work.\nIn a side note, are you aware of what is happening in Brazil right now? The socialist goverment is about to be impeach and this may be a good time to buy stocks from Petrobras. But Im not sure if the stocks will go up after she get out of power because investors where projecting about 1,5 billion in deficit this quarter, but it end up being 35 billion. Its state owned tho, so bankrupcy is not a option, I suppose.",
			"post_id": 12,
			"date_added": 1459120585
		},
		{
			"comment_id": 8,
			"body": "> [theta](#comment_8_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma): I am not too familiar with Petrobras and far from an expert. I am, overall, very restricted when it comes to commodities and energy investments, especially now when the oil price is low, and Iran is going to be a new big export player in the industry. Also, from what I have read in the news the last couple of weeks, the risk has increased, and the potential downside is too big for my risk/reward preference. I am refereeing to the well-known corruption scandal. Yes, everyone knows about it, but the effects can become devastating for small investors and the stock price as big pension funds may reject the company's stock due to their investment rules (big pension funds are talking about putting Petrobras on \"suspension lists\"). Petrobras have also announced that they 1) want to sell off some of their oil and gas fields,  2) are going to reduce its investments with 20% in the next five years, which is not a good indicator.\n> I am not an expert in Petrobras, but I would not invest in them. However, it is well-known quote: \"Buy When There's Blood In The Streets\", well, that may apply here, so,  if you think it is a good idea, maybe just invest a very small amount of money. If Petrobras actually make it and pull it off, then you can \"scale in\" in the company and buy a small chunk of shares over a period of time. I recommend you to not invest an amount of money you cannot afford to lose,  especially at this stage.\n\nThanks for the repply.\nYeah, my investment potential is just 3000 US dollars in todays exchange rate. And its all I have right now for this purpose. I was thinking that since its state owned, it cant go bankrupt, an because the shares are so cheap, it would be almost impossible to them to devaluate even more. They should only go up in theory. But since it would be my very first move in the stock market, I really dont want to loose the money on my very first day.",
			"post_id": 12,
			"date_added": 1459265883
		},
		{
			"comment_id": 9,
			"body": "Haha, oh man. If the markets keep going this way, I will never be able to start investing. Im still learning and now, with this Panama Papers being released to the public, and with rich ppl all over the word about to be prosecuted by tax evasio among other things, I can already see the stock markets plumeting with ppl worried about the backlash. They got even George Soros apparently. And the PM of Iceland quit the office after a reporter discovered he also had off shores. Apparently I choose the worst possible time to learn about markets. Haha.",
			"post_id": 12,
			"date_added": 1459736814
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"7": 1
	}
}