{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 1,
				"body": "> [swastika](#comment_37_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): @achylles Unpopular opinion is unpopular on ZeroNet as well, most people here have only heard of the Mass Media and controlled opposition. \"Homosexuality\" was popularized since 1900, and would simply die off since people cannot reproduce with same-sex relationships.\n\nBro, the Greeks were gay back in 500 BCE.",
				"added": 1539566662
			}
		],
		"1566461918_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 2,
				"body": "yeah, and i did ur mom",
				"added": 1566466095
			}
		],
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 3,
				"body": "I love the idea of mesh networks, but making them requires a lot of effort and hardware that 99% of users won't ever want to bother with. Throw in that the average American has been programmed to hate the idea of free, publicly owned things because of the cold war, and the chances of getting even a small meshnet is almost zero.\n\nMaybe we should all just make prototypes. Keep some HAM radios on us too. If shit ever hits the fan we can talk it up through the radios and assemble our crappy internet 2.0",
				"added": 1566466290
			},
			{
				"comment_id": 4,
				"body": "> [kaffie](#comment_1062_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I already do something like this. I have 2 phone numbers/services I use, neither are a traditional carrier. One is google voice, which I use for texting and incoming calls (fetches to voicemail that's transcribed to text automatically), and then text-to-speech relay service I use for outgoing calls. Both work over the internet on any device on any data connection. [...]\n\nPfft, google voice? You really want to let Google read all your texts?",
				"added": 1566466456
			},
			{
				"comment_id": 5,
				"body": "> [kaffie](#comment_1063_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Is there a better option? I use google voice because of the transcribed voicemail. I trust google a hell of a lot more than I trust random no-name companies that recycle your number if you don't use it enough.\n\nHard to say if there's a better option out there. Probably is. But Google sure isn't worth trusting.",
				"added": 1566467364
			}
		],
		"1566538598_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 6,
				"body": "> [aim64c](#comment_36_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): Well, you see.... there was once this place called \"Gradec...\" now known by \"Graz.\"  \"Slov\" in the root of old Slavic languages means \"Pure\" - it is the root of how the Virgin Mary is addressed in Church Slavonic used in the Eastern Orthodox Church, if that gives you any idea.  Have you played \"Endless Legend?\"  The Vaulter's faction is really interesting. [...]\n\nI feel like an angry old man seeing all these new 08chan kids. Back in my day all we had was torrent lists and basic forums. But hey, more users is good, overall.",
				"added": 1566713442
			}
		]
	},
	"comment_vote": {}
}