{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1554143647,
			"title": "ZeroNets history/future?",
			"body": "Hey, I just just discovered ZeroNet and im really impressed. Im wondering if this thing is dying or growing? How was the traffic before and how do you think it will be in the future?",
			"added": 1554143646
		}
	],
	"topic_vote": {
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": 1,
		"1552823531_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 1,
				"body": "Easy you just ask all EU citizens to install a zeronet filter-addon and if they dont, ask again. ;p",
				"added": 1554112730
			}
		],
		"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": [
			{
				"comment_id": 2,
				"body": "> [pexo](#comment_78_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Currently somewhere in between. The number of people leaving and joining are roughly equal.The main dev is still around and doing developer things. [...]\n\nYeah the website thing is huge, think the thing zeronet needs is a reason for people to come here, if more people come more people will develop better websites and so on. its not easy to compete with the \"internet\" but i really can see zeronets reason to exist.",
				"added": 1554146710
			},
			{
				"comment_id": 3,
				"body": "> [tomasz21](#comment_63_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Pomału jest na +. Ludzie zaglądają, i oczekują fajerwerków. Zamiast samemu coś się dorzucić do tego programu. Byłby większy wzrost.It's slowly on +. People are looking in and waiting for fireworks. Instead of something to add to this program yourself. There would be more growth.\nYeah, understand what you mean but think its hard to help in a big way. Zero don't need 1000 people making  1000 shitty webpages. What its need is a really big and good site that makes people want to change from reddit/youtube/netflix or facebook to that site and that's not an easy task.\n\nBut Zero is proof that people can make insane stuff so I have hope.",
				"added": 1554150024
			},
			{
				"comment_id": 4,
				"body": "> [satoxyn1](#comment_40_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): How did you discover ZeroNet anyway?\n\nI couldn't sleep and came up with an ide of a torrent based browser, start to google and discovered that someone have done it but 10X better then i ever could imagine :p.",
				"added": 1554154488
			},
			{
				"comment_id": 5,
				"body": "> [eightyfour](#comment_88_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): Instead of making one you can always contribute to this one! But if you just stick around I'll be happy too. I joined half a year ago and it's definitely been getting more active lately, probably because of Art 11 & 13.\n\nI dont have the skills or the time right now. I really like this project and later I hope I have both :p, so maybe then. But for now im just gonna be a user and donate some money. Yeah its because of them I started to think about the idea!",
				"added": 1554156791
			},
			{
				"comment_id": 6,
				"body": "> [gametangia](#comment_4_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW): w service here that people will want to use, or the collapse of the old order. I am not sure ZeroNet will survive in its current \n\nah oki, yeah I discovered because of art 13. Think the internet going to be worse and worse so maybe more and more people? I think ZeroNet is ready to go viral the problem is there isn't much to do on here for now.   Some what of a catch 22, To few users to create content, few users because of low content. But im going to check in here as long as its alive.",
				"added": 1554334855
			}
		]
	},
	"comment_vote": {
		"1_1Nsd5kJBEgJquSMKw1VAYNpiLPEuJ4j1ci": 1,
		"78_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"63_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"40_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"88_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"350_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1_15EQoYieX2KjEEfky9n5SQtoEa31fEjF4U": 1,
		"16_1qHgDzjLBxeUFdTiNPQFuwfnW33ptNk84": 1,
		"4_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1
	}
}