{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "Queima de Arquivo (Eraser) 1996 Dublagem Clássica - Clone\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1601172772_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9\n\nSinopse: John Kruger (Arnold Schwarzenegger) é um agente do governo especializado em proteger testemunhas, destruindo seu passado para assegurar o futuro, que passa a proteger uma testemunha-chave (Vanessa Williams) que sabe tudo sobre uma firma de equipamento bélico que planejou e desenvolveu o mais revolucionário fuzil e pretende vendê-lo no mercado negro. Para isto conta com importantes agentes do governo, que estão dispostos a usar todo o seu poder para concretizar a operação e também matar tanto o agente quanto a testemunha.",
				"added": 1601173130
			},
			{
				"comment_id": 2,
				"body": "Um Tira Muito Suspeito 1999 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1601269949_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9\n\nSinopse: Miles Logan (Martin Lawrence) um ladrão de jóias, mas as coisas não correm muito bem em um assalto em que ele rouba um grande diamante, pois Deacon (Peter Greene), um cúmplice, o traiu e ele acabou sendo preso. Mas antes de ser capturado Miles escondeu a gema no duto do ar de um edifício em construção, para poder recuperá-la quando fosse solto. Dois anos depois Logan libertado e, desesperado, descobre que o prédio onde escondeu a pedra agora o quartel-general da polícia de Los Angeles. Tentando recuperar o diamante, ele se faz passar por Malone, um detetive que teria sido transferido. Mas antes que possa recuperar a pedra ele se torna parceiro de Carlson (Luke Wilson), um detetive aparentemente ingênuo, com quem tem que investigar roubos. Com Deacon no seu rastro, ele tenta recuperar a gema enquanto que paralelamente ilude os policiais de tal forma que logo se torna detetive-chefe da seção de roubos e, apesar de ainda querer o diamante, vai se tornando um exemplo entre os policiais.",
				"added": 1601270222
			},
			{
				"comment_id": 3,
				"body": "Ace Ventura - Um Detetive Diferente 1994 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1569866779_1BW8U38xw9YUTWxJDQp6m5zKrehq83iQ3X\n\nSinopse: Ace Ventura (Jim Carrey) é um detetive especializado em desvendar crimes envolvendo animais. Vive cercado de bichos, mas não tem muito trabalho. O desaparecimento de um golfinho, mascote da equipe de futebol americano Miami Dolphins, aparentemente seqüestrado, torna-se seu primeiro grande caso. Atrapalhado como é, Ace conduz a investigação de uma maneira bem peculiar.",
				"added": 1601482114
			},
			{
				"comment_id": 4,
				"body": "Excalibur, a Espada do Poder 1981 Dub\n\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1601574530_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9\n\nSinopse: O mago Merlin (Nicol Williamson) dá ao rei Uther Pendragon (Gabriel Byrne) a mística Excalibur, a espada do poder. Durante uma emboscada Uther é ferido mortalmente e, pouco antes de morrer, enterra a espada em uma pedra. Fica então decidido que o cavaleiro que puder retirá-la da pedra será o novo rei, mas ninguém consegue. Anos depois o país estava divido em guerra entre os senhores feudais e Arthur (Nigel Terry), um jovem escudeiro, retira facilmente a espada da pedra. Alguns nobres juram fidelidade ao novo rei e Merlin relata que Arthur é um filho bastardo de Uther, mas alguns nobres não aceitam sua autoridade.",
				"added": 1601574831
			},
			{
				"comment_id": 8,
				"body": "Loucademia de Policia 1984 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1602027148_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9\n\nSinopse: O prefeito resolve mudar a lei, afirmando que fatores como sexo, peso e inteligência não devem influenciar nas aplicações para a força policial. Liderado por Carey Mahoney, um grupo de jovens incompetentes, mas de bom coração, ingressa na Academia de Polícia para o desespero dos instrutores, que buscarão impedir de toda as formas as brincadeiras da turma.",
				"added": 1602027274
			},
			{
				"comment_id": 10,
				"body": "Gladiador 2000 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1602138195_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9\n\nSinopse: Nos dias finais do reinado de Marcus Aurelius (Richard Harris), o imperador desperta a ira de seu filho Commodus (Joaquin Phoenix) ao tornar pública sua predileção em deixar o trono para Maximus (Russell Crowe), o comandante do exército romano. Sedento pelo poder, Commodus mata seu pai, assume a coroa e ordena a morte de Maximus, que consegue fugir antes de ser pego e passa a se esconder sob a identidade de um escravo e gladiador do Império Romano.",
				"added": 1602138657
			},
			{
				"comment_id": 11,
				"body": "Dredd - O Juiz do Apocalipse 2012 Leg\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1548243668_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS\n\nSinopse: O juiz Dredd (Karl Urban) vive na megalópole Mega City Um, um oásis de civilização na Terra Maldita, cerca de 120 anos no futuro. Bastante temido pelos infratores da lei, ele acumula os cargos de polícia, de juiz e ainda tem o poder de executar suas sentenças. Um dia, ele é encarregado de treinar uma candidata a juíza com poderes mediúnicos (Olivia Thirlby), e neste primeiro dia de teste os dois enfrentam a maior e mais perigosa traficante de drogas do local (Lena Headey).",
				"added": 1602457479
			},
			{
				"comment_id": 12,
				"body": "O Sobrevivente 1987 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1602993807_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9",
				"added": 1602993933
			},
			{
				"comment_id": 13,
				"body": "The Imitation Game (jogo da imitação) 2014 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1560524167_12ShAsoQVkbEgqfjS2JmXt7cXBSbf8ifuS\n\nSinopse: Em 1939, a recém-criada agência de inteligência britânica MI6 recruta Alan Turing, um aluno da Universidade de Cambridge, para entender códigos nazistas, incluindo o “Enigma”, que criptógrafos acreditavam ser inquebrável. A equipe de Turing, incluindo Joan Clarke, analisa as mensagens de “Enigma”, enquanto ele constrói uma máquina para decifrá-las.",
				"added": 1603463075
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 5,
				"body": "Futurama S02E09 - O Acasalamento Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1601702650_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9",
				"added": 1601702744
			},
			{
				"comment_id": 6,
				"body": "Futurama S02E11 - De volta ao século XX Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1601788437_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9",
				"added": 1601788528
			},
			{
				"comment_id": 7,
				"body": "Futurama S02E10 - Quero meu corpo de volta Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1601793672_16SeYeZzHVMcsx9ahpG9PGVd6TfPtxjGV9",
				"added": 1601793733
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 9,
				"body": "The IT Crowd S03E05 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1548315826_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE",
				"added": 1602053951
			}
		]
	},
	"comment_vote": {}
}