{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1542515456_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1579514127_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1580821606_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	},
	"next_comment_id": 34,
	"comment": {
		"1_1ApJ2dibcJbE8cvEeo3Db75cwkRArD2XjA": [
			{
				"comment_id": 1,
				"body": "1. A computer in NK costs the equivalent of every soul that the devil managed to collect throughout history.\n2. Even if someone manages to get the funds together for one, the machine itself has to be government-approved; count on Uncle Kim summoning his bad-ass self all over that harddrive like he was Satan after a classic game of Quake.\n3. Congratulations, human factory cog, you now own a computer. Enjoy our state-sanctioned intranet with just three sites - all three hand-coded by our glorious supreme adult-diaper-wearing leader in glorious HTML. Please don't even dream about trying to browse anything else, our mandatory vacation camps can only accommodate so many million people at once (but there is always room for one more).",
				"added": 1510206342
			}
		],
		"3_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": [
			{
				"comment_id": 2,
				"body": "One clearweb example that didn't end too well some years ago, someone high up in the chain of our ministry of justice made some political enemies.\nOne day he browsed a supposedly non-porny site which apparently had some major no-no type porn advertising on it that the dumbass failed to remove from his cache...\nWithin days, news was broadcast with one of his political enemies' mouthpieces vehemently stating that the files were put on his computer in such a way that he had to have knowingly and expertly hidden them from scrutiny himself.\nNow, much of this example is political backstabbery, but even without politics, depending on where you live, it can all too easily be something that there's no protection against, and a surefire way to a fate where you end up becoming the currency that other inmates use when they want to buy a snickers and a pack of smokes.",
				"added": 1510207684
			},
			{
				"comment_id": 3,
				"body": "I was also going to add that with the ZeroNet infrastructure, a case might be made that the bad stuff was uploaded without the owner of the site being aware; ZeroNet certainly lends itself to such open structure, but I'm fairly certain judges would still drop the hammer on you by insisting that it's your computer, your site, your hard drive and as such your responsibility.\nThey could even go as far as saying that you enabled it in the frst place by installing ZeroNet and browsing/peering a site.",
				"added": 1510207918
			}
		],
		"1510141321_16tWPYFLbad3R8iGcMuetyiwC2q5qXp45T": [
			{
				"comment_id": 4,
				"body": "Fox news breaking story: \"President Trump tweeted that he'll stay and assist China with its prison problem for an indefinite time.\" - oh boy, that'd be something to grin about...",
				"added": 1510209937
			}
		],
		"1513201657_1LUy9iAxeWsj1DP5L8V17Yb2vo87FucjgD": [
			{
				"comment_id": 5,
				"body": "Short and cheeky answer: You can just send it to me, I'll... uh.... see to it that it gets to the developers. And I'll pretend that the devs are found in my favorite bar. The better answer: Take a look at missesrobot's answer, or if they won't take your royalty cheque, maybe just help spread the word (and basic knowledge) about ZeroNet to the general public. Or just name your firstborn \"Zeronet Tiberius the Third\".",
				"added": 1513618929
			}
		],
		"1512560923_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 6,
				"body": "> [flappyearz](#comment_95_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt): The best way to be paid for watching porn is to hold the camera as a job. :-)Or handle the lights, or direct that art piece itself.\n\nOr change your name to \"Jack Hammer\" (if you're a guy, at least), learn some plumber/pizza delivery guy jargon, and act - get paid AND have \"le snoo-snoo\", sounds like fun to me.\n(all joking aside, there are plenty working in the field who say it isn't as fun/glorious as one might think...)\n\nMe, I'd be the guy that cashes in on the royalties/DVD rentals, those make the real money, aqnd with that kind of money, even a fugly old creeper like me might actually end up with a blonde on each arm. Hopefully they won't be male nurses assigned to make sure this fugly old dude doesn't end up going number two at the local supermarket.",
				"added": 1513620150
			}
		],
		"1513825745_1vAdpJiyYEHcDZoJn93QcjzaFVKHHPg1F": [
			{
				"comment_id": 7,
				"body": "Around the same time your issue started, I had an issue with ZN and TOR too, when I went into ZN with a regular browser there was a zite reaching its size limit and when I tried raising the limit for it, ZN gave me a message that I needed to update to revision 3171 for that functionality.\nAfter that update I was able to use TOR on ZN again.\nMight be worth checking if you're on 0.60 rev. 3171 (the three-dot line next to \"Hello ZeroNet\" opens into a menu where it also shows your version/revision, even with the previous revision it would say that you're up to date, but as said only after I updated to 3171 did TOR on ZN work again for me).\nOfcourse, it's possible that I'm barking up the wrong tree here and that you're already on that revision - in that case, I'm not of much help at all.",
				"added": 1513845160
			}
		],
		"1514988274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "Ohhhh.... I can just picture this coming up at a D&D session...\nDM: \"You encounter the mighty dragon MeltDown the Fiery.\"\nP1: \"I whip out my mighty i7 and cast shield of--\"\nDM: \"The dragon smacks you down and penetrates you. Repeatedly. Angrily.You cry. You cry. You cry. Tou're dead.\"",
				"added": 1515186586
			}
		],
		"1515489402_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 9,
				"body": "This looks interesting... might be just the thing to point out to a cousin of mine who I was discussing some fun ZeroNet ideas to try out with him.\nOn a sidenote, your link to the ZeroNet Starter Zite template results in a \"404 page not found\", perhaps chikan was referring to that.\n(Or it's an actual \"file not found\" while trying to download a package... from time to time I've been getting that on GitHub as well, but only very sporadically, and usually a second try after a few minutes did the trick for those times).\n\nThat \"404 page not found\" - the second link in your list of 87 repositories shows a ZeroNet template at https://github.com/anoadragon453/ZeroNetTemplate which works :p",
				"added": 1515529044
			}
		],
		"1515454529_1P7ZF1U5tMb3BKzp6jxWzz37VqGg2XiMhs": [
			{
				"comment_id": 10,
				"body": "There might not be a single culprit in what's killing MMO's.\nI can think of a few things... the \"same shit different day\"(well, same shit different graphics actually) has a hand in it, so does this thing where companies forget that they're making an MMO and not another graphical interface to a single-vendor market full of recolored armors and other useless shit, or worse, an interface to a piece of bland software where the player just has to enter his credit carddata into said interface faster and more often than other players to automatically win.\nOnthat last bit, yeah, I know, they need to make money to stay afloat, but the moment a games company needs to drain millions of people for more cash than some countries' annual budget, just to stay afloat, well, that's where shit goes sideways.\nMeh, I'm starting to rant... there's more factors to why MMO's just aren't as great anymore as a genre, but I'm in full rant-mode now and nobody needs to hear an old fart go on about crap.",
				"added": 1515999781
			}
		],
		"1518401823_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 11,
				"body": "\"but yeah, I'm pretty sure the government already knows, deep down inside... that I'm not someone to be fucked with. I think they have every reason to leave me alone ... they'd be wasting a lot more taxpayer money on me by keeping me in prison... or in a mental institution, or whatever\"\nUhuh, and governments so dread the thought of wasting taxpayer money on frivolous stuff like controlling people/making people go away... [/end good-humoured sarcasm]\n\nStill, maybe (I don't know how the US situation is) you could buy a plot of park/forest land on the cheap (as in, still a few thousand dollars but cheaper than buying a regular plot for construction).\nYou'd own it; there'd still be rules likely, regarding what you can and can't do on it (usually they won't allow you to build a home on it).\nBut if you smuggle in the materials you then might be able to build an underground bunker, just make sure that once built, it isn't visible in any way aboveground, because that'd be like putting up a giant arrow-shaped sign saying \"Top secret hide-out\" and slapping on a welcome mat for rangers/government workers/cops/whatever.\n\nAs others said, any wifi/internet/cellphone stuff would easily be found too... there are some work-arounds for that as well, but then you'd also need to sneakily pull your own landlines to other locations where you have legit internet.\nOne clearnet site that I lost the URL for haad a pretty solid (if somewhat cartoon-villainish) scheme for something like that... surre, you'd be raising a lot of flags if you go to home depot and try to buy 500 miles of wire in one go, but you can figure out that you'd have to split that between different purchases at multiple stores, and pay in cash.",
				"added": 1518619190
			}
		],
		"1533207357_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 12,
				"body": "When going to the page from the link here, but also if I navigate the zite and then return to \"Chat\" in the menu, it will ask me to select my account.\nAnd trying to post something in the chat gave the same result without posting my message, which was just a test to see if it'd again ask me to select my account (which it did).\nI had a thought about what might cause that, but given the heat in my home, my brain is turning to mush and I lost what I thought it might be... maybe it'll hit me again in a bit.",
				"added": 1533308491
			},
			{
				"comment_id": 13,
				"body": "> [bitwolf](#comment_12_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu): When going to the page from the link here, but also if I navigate the zite and then return to \"Chat\" in the menu, it will ask me to select my account.And trying to post something in the chat gave the same result without posting my message, which was just a test to see if it'd again ask me to select my account (which it did).I had a thought about what might cause that, but given the heat in my home, my brain is turning to mush and I lost what I thought it might be... maybe it'll hit me again in a bit.\n\nAddition: \nIt just dawned on me right after posting the above, that I noticed it also said that there were no connections (even \"not one peer\" as a message somewhere said) to the zite... so I was thinking maybe it wasn't getting connected to anything, including ZeroID.\nBut I still can't remember what that thought lead me to... so, I'm still not very useful there it seems.",
				"added": 1533308656
			}
		],
		"1535213599_1CF7NrguXy6cEycDkSRd3CUFekLurYZpor": [
			{
				"comment_id": 14,
				"body": "I can't honestly say whether gods exist or not, unless I either see them with my own eyes, or manage to go anywhere in the universe/multiverse and see with my own eyes that they don't exist.\nBut the human idea of gods is rather flawed; it's always one or more god(s) that create everything, blablabla, and then instead of teaching us their divine language they rely on a man-made book, printed with man-made paper and ink, and usually in one group's specific language, to tell us \"right\" from \"wrong\" - and it tends to be the \"right\" or \"wrong\" that by some super-divine coincidence happens to suit the needs/desires/fears/purposes of whatever tribal bigwig controls what should or should not be in the supreme holy book that is the word of their god(s).\n\nIf, for example, the christian/jewish/islamic god has such a big problem with gay dudes, then why'd he create them in the first place?\n\"Ah, to teach us about free will!\"\nWell, what if my free will happens to be that a god who hates his own creations isn't worth me fighting his battles?\n\"But... that is against our god's will! You are a sinner! We will declare a holy war on you!\"\nAh, so if I don't kill gay dudes for your omnipotent god, who created them in the first place, then that makes me a sinner because I excersise my free will?\n\".... .... ... our god works in mysterio-\"\nAnd why does your omnipotent god require the help in exterminating those weak gays and other sinners he created? Can't he just, you know, put on his sparkly gemmed FABULOUOUOUSSSS glittery glove and snap his fingers to just do away with those free-willed gays and sinners he created himself?\n\".... SILENCE, SINNER! HOW DARE YOU QUESTION GOD!\"\nWell, he gave me this thing, uh, what was it called again.... oh, free will. And a brain. And thoughts.\n\"FATWA! JIHAD! EXCOMMUNICATE! MURDER THAT SINNER, AND HIS CHILDREN! AND THEIR CHILDREN!\"\nAh, so your god created a bunch of weak-willed child-murdering brainless sheep, and made them into his tool of righteous wrath because.... logic?\n\".... ... ...\"",
				"added": 1535587864
			}
		],
		"1538081577_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 15,
				"body": "The lizard people want you to believe that it's the bus companies, but anyone with half a brain knows it's really the unicorns that make frogs gay, so they can indoctrinate more people in becoming emo bronies.\nOnce they have enouh slaves, they can start building that magical stargate to Nibiru, from where their half-bear/half-pig/half chipmunk overlords can invade our world and have ungodly sex with the planet.",
				"added": 1538510908
			}
		],
		"1540777965_1Br6u3XGUK1cnNf4A35jksjJKHNLkYuh86": [
			{
				"comment_id": 16,
				"body": "> [mattytripps](#comment_1_1Br6u3XGUK1cnNf4A35jksjJKHNLkYuh86): how do you keep someone else from downloading and editing your website? if the website downloads to everyones computer than what stops this?\n\nI forgot exactly what line in the file it was, but somewhere in a .json fole (I think it was \"content.json\" but I'll have to check and I don't have much time right now) there's also a line that you can edit so your site won't be clonable.\nThis won't stop others from downloading (because that's the nature of ZeroNet) but they won't be able to just clone (copy) your site's code/content for their own use.\nThey'd still have their local copy distributed by ZeroNet itself, but not all of your content/code, depending on how your site's built.",
				"added": 1541017433
			},
			{
				"comment_id": 17,
				"body": "> [bitwolf](#comment_16_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu): I forgot exactly what line in the file it was, but somewhere in a .json fole (I think it was \"content.json\" but I'll have to check and I don't have much time right now) there's also a line that you can edit so your site won't be clonable.This won't stop others from downloading (because that's the nature of ZeroNet) but they won't be able to just clone (copy) your site's code/content for their own use.They'd still have their local copy distributed by ZeroNet itself, but not all of your content/code, depending on how your site's built.\n\nA small addition, as I just did check.\nIt's indeed \"content.json, somewhere in the first lines: \n\"address\": \"[your site's ZN address]\",\n \"address_index\": [some number],\n \"clone_root\": \"\",\n \"cloneable\": true, [THIS IS THE LINE; you can set \"true\" to \"false\" to make your site non-clonable]",
				"added": 1541017902
			}
		],
		"1542766666_1Bcm7BpVuYsQaE8wGB8CrLWzef32rrMy1r": [
			{
				"comment_id": 18,
				"body": "\"They may pretend to be hacked\" - that'll only last as long as it takes for someone to check the relevant blockchain, and then they can pretend to be magic fairy pixies, but they'll still be held accountable and made to pay.",
				"added": 1542833974
			}
		],
		"1543672789_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 19,
				"body": "Had two accounts.\nFirst one made years ago (2008/2009-ish), tied in with a business (renting out OpenSim servers) I was setting up back then... worked well for two years, then suddenly that account got hit with a ban, nothing but a cookie-cutter statement that I violated their rules, no explanation and no specifics about what/how I violated.\nSeeing how that was my main way of keeping in touch with prospective clients, it really screwed me hard.\nAbout a year and a half after that ban I made a new account, regular private-person use... had that account until last year.\nSaw a couple of Trumpicans  bashing and posting threats to an actress who I followed on Twitter, so I - along with a few others - reported those Trumpicans; about a week passed with no response or action from Twitter, those inbreds were still harrassing and threatening the actress, so I started giving those genetic rejects a taste of their own medicine - and blammo, after just three posts Twitter decided that I violated the rules for being inflammatory, hate-speech, harrassment, threats.... while those Trumpicans are still allowed to to have their daisy-chain gay circle-jerks on Twitter, just three posts from me was enough for a permanent insta-ban.\nIt's Twitter that abandoned its users, not the other way around.",
				"added": 1543806358
			},
			{
				"comment_id": 20,
				"body": "> [quantumworld](#comment_45_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Don't worry twitter will eventually ban all users for hate speech and racial discrimination and the only person left on the site will be Jackko Dorcey. Its really all about his tweets over there anyway. Anyone who is more popular than he is gets a ban. Seriously that's what it looks like to me. Only time will tell on this one.\n\nI'd say you're right about them banning anyone more popular than Jackie-boy... it might be a seperate issue from my own bans, or not - I'm completely in the dark about what \"logic\" they follow when banning people who aren't more popular. I only had maybe 30 followers on my personal twitter account, probably less, but some of my twitter-gems did reach larger crowds (nothing that'd put me in any big-league range, honestly... if I saw a tweet of mine make it to the epic scale of 2000-3000 viewers it already gave me delusions of grandure... heh... meanwhile my 17 year old nephew has tens of thousands following his tweets about his shitty unpacking video's on youtube)\nI'll be laughing my ass off when eventually Jack has a brainfart and bans himself, thinking that account is getting too close to his own \"popularity\". The self-inflicted butthurt will be huge that day.",
				"added": 1543860343
			}
		],
		"1551790772_19Yj3z87qtP6CoPvXNSYzTZjeZnvJvs5aL": [
			{
				"comment_id": 21,
				"body": "It's looking like a good enough zite for functionality, with plenty of value - but I'd suggest that the copyrighted/trademarked things are changed prior to any sale taking place, next thing you know, someone does something foolish and whammo, ZeroNet makes headlines for being the next dark web where anyone can pirate copyrighted/trademarked stuff and someone who just bought a zite gets the turds sued straight out of their bowels because there's a YT-logo on their non-YT zite.",
				"added": 1551815572
			},
			{
				"comment_id": 22,
				"body": "> [styromaniac](#comment_561_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): First of all, this YouTube site is a clone of an older version of KKBO with very minimally modified CSS, nothing improved, then you asked for Bitcoin because you pretty much clicked a button and changed a few icons and colors. [...]\n\nSo it's basically a rip-job of an older version of an original zite? Yikes... when put in that light, the YT logo and pitch are only more damning than I thought... yeah, I'd suggest folks look up the newer version of the original or take their business to a legit coder.",
				"added": 1551841848
			},
			{
				"comment_id": 23,
				"body": "> [zerosell](#comment_2_19Yj3z87qtP6CoPvXNSYzTZjeZnvJvs5aL): The logo is a mockery in the direction of the original YouTube, in order to show that they can be replaced in a ZeroNet.\n\nOh, well, I guess that'll show YouTube's department of lawyers who each make more money than you or I see all year, and surely that'll make any judge rule in your favor... in fact, maybe you should be sueing them pre-emptively, teach them a lesson... because I love a good slapstick comedy.\n\nAlso: \n> [zerosell](#comment_1_19Yj3z87qtP6CoPvXNSYzTZjeZnvJvs5aL): About the fact that this is a clone of KKBO and so everyone knows already discussed many times about it.KKBO does not sell its website, but we are interested in how much the website costs in ZeroNet.\n\nDepending on how much it's a clone and how much it's their code, maybe pre-emptively sue them as well.\nI hope my microwave popcorn will be ready in time.",
				"added": 1551885529
			}
		],
		"1552109959_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 24,
				"body": "I've tried it earlier and didn't like what I was seeing; literally everything you'd want to do costs OWT (OpenWeb Token), which from what I managed to figure out so far seems to be paid from your ethereum - and I also don't really like the idea of having to enter my ethereum wallet address at the get-go.... combined with the OWT thing, that just feels like a guy in a hoodie is standing around the corner of my street waiting for me to leave so he can try to mug me or get in my snail-mail box or pop my lock and leave a big steaming number two in my living room.",
				"added": 1552141643
			}
		],
		"1553360735_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": [
			{
				"comment_id": 25,
				"body": "Blockmarket, it looked promising some time ago but right now it looks like hardly anyone is active on it.\nSome time ago (maybe a year, or a year and a half ago) I also stumbled upon some .onion site that had their own p2p app but I haven't been able to find it again, the app was called \"Brine\" (back then it was alpha/beta, but already usable and it had a few hundred user-made shops mostly from Asia/middle-east), don't know if it's still active or if it went under but might be interesting to search for.\nAt least, if you don't mind what looked like mostly shops selling knock-off brand shoes/clothing/bags/wallets... that seemed to be what most of those user-shops were offering, with some electronics and hardware crypto-wallets scattered among them.\nThere's another one but I don't remember what it was called, it looked like a mix of OpenBazaar and Blockmarket, also had its own currency that you could exchange from BTC/DASH/XMR and it had at least a few hundred users with their own shops, but also ability for users without shops to place listings... I'll check if I can maybe find that app on the drive of a now defunct laptop, but it'll be a few days before I can get to that.",
				"added": 1553568212
			},
			{
				"comment_id": 26,
				"body": "> [i2pcin3s](#comment_2_14sXjeZErdSDaERcrbZkg5fSBHv8o3Nkrk): https://particl.io/Has one in beta right now and I think bitbay might have one too\n\nI had forgotten about that one. Came across it shortly after I started looking at OpenBazaar, but forgot all about it when there seemed to be no updates for some time. Will be keeping an eye on it again.",
				"added": 1553568385
			}
		],
		"1566086206_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 27,
				"body": "> [223556](#comment_160_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): We'll finally go full circle to people only trusting information they hear from the physical people around them\n\nIf we trusted those physical people, we wouldn't have become so dependant on our benevolent machine/AI overlords to begin with. And I'll be damned if I ever trust another meatbag who's just biding his time until he can claim that I pray to the invisible imaginary skydaddy in the wrong language, again.",
				"added": 1566103046
			}
		],
		"1566146346_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 28,
				"body": "Stop bitching on the internet (or ZeroNet, or any net) about me having a drink, it only shows that you can't handle your own shit so you have to make yourself feel good about yourself by getting all up in my shit... seriously, that's psychology 101, those who need to tell others how to live and what to do, only go there because they can't control their own lives so they have to try a weak attempt at controlling others' lives.",
				"added": 1566152152
			}
		],
		"1579890249_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 29,
				"body": "Amazing, so your scientiffically super-duper-sound study finds that men who like to diddle boys are more likely to diddle boys than they are to diddle girls? Amazing, what a golden age for science we live in... one can only wonder what's next.\nFor example, I recently found that people who get drunk a lot, are more likely to consume alcoholic beverages. I can't wait to get a Nobel prize for that amazing find... surely such a find could shape the face of science for centuries to come...\nAnd this other guy, he discovered that people who are sick are not healthy...",
				"added": 1580186461
			}
		],
		"1579514127_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 30,
				"body": "I've actually gotten a few jobs in the past by making it very clear that I wasn't skilled in the field that the rmployer was hiring for, but that I could find the needed information fast enough (Google, other search engines, but also (and maybe more importantly) asking/searching on forums that I've always been active on - yep, also a \"jack of all trades\" so I've always managed to find my way into a bunch of communities. From web design to coding to fixing phones to woodworking, and a lot of things in between. The internet can be your best friend on several levels, when it isn't being used to crush you into the ground).",
				"added": 1580187215
			}
		],
		"1579442143_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 31,
				"body": "I could've been an 'edgelord too' but my grandpappy would \"smack my ass\" if 'I pointlessly kept putting random words between inconsistent quotation marks' and \"if I ran my mouth like some waste of a father's seed\". So I guess I'll just \"have to settle\" for 'being some inferior adult' as opposed to 'the mental giant' (or was it 'midget') who \"chooses to be an ass and run his mouth\" on the very platform he's raging against.",
				"added": 1580187754
			}
		],
		"1580821606_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 32,
				"body": "\"The traditional tribal costumes probably also look a little different\"\nWhite pointy hats and dresses - whoops, I mean... \"robes\" - for the plebean supremacists. Their Big Witchdoctor (sounds better than that shitty \"grand wizard\" nonsense of the restoration era nutjob klan) can diversify with red, purple, yellow or pink dresses- whoops, \"robes\"... and pointy hats.",
				"added": 1581728841
			}
		],
		"1589915224_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 33,
				"body": "I'm seeing 8 results for \"Two Steps From Hell\", and a total of 83 results when clicking on music-Z's name.",
				"added": 1589927256
			}
		]
	},
	"comment_vote": {
		"301_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"40_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1,
		"302_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5": 1,
		"95_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": 1,
		"247_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"317_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"51_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"258_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"773_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"47_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"2_17pmbNMUtniJ4cTr1czysijJjPnYngg93s": 1,
		"1_17pmbNMUtniJ4cTr1czysijJjPnYngg93s": 1,
		"561_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"744_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"2_14sXjeZErdSDaERcrbZkg5fSBHv8o3Nkrk": 1,
		"3_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": 1,
		"381_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"328_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"3_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"4_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"119_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"2372_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"590_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}