{"cert_user_id": "HughIsaacs2@github", "next_comment_id": 5, "comment": {"1604066073_mirrored_krixano_github": [{"comment_id": 1, "body": "I might be able to build this as a plug-in (been tinkering with ZeroNet lately for fun), if I figure it out I'll have it rely on content.json for generating the web app manifest data (can't let the manifest be directly edited for security reasons).\r\n\r\nMain reason I'm interested and why I found this is it would open the door for adding the native share target API to ZeroNet zites (https://developers.google.com/web/updates/2018/12/web-share-target).\r\n\r\nAlso, it doesn't require a service worker. \r\nChrome only looks for one to have the banner displayed. Everything that's not offline, backround sync and push notifications works without it.", "added": 1557479277, "modified": 1557503192, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1065#issuecomment-491265914", "source_type": "github"}, {"comment_id": 2, "body": "@filips123 the \"scope\", \"start_url\", \"serviceworker\" and \"related_applications\" sections of a web app manifest all would make it possible for a zite to hijack ZeroNet in some capacity.\r\n\r\nSo basically even if we allow linking to a manifest from content.json, ZeroNet itself will have to generate one of it's own based on the one linked, to avoid letting zites potentially hijack everything.\r\n\r\nAlso the other upside to just having the information in content.json is it can clear any overlap that the two specs may have (\"background_color\", \"icon\" , etc...).", "added": 1557503076, "modified": 1557503367, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1065#issuecomment-491392462", "source_type": "github"}, {"comment_id": 3, "body": "@filips123 now that's you've gotten me thinking about it, I'm weighing both options.\r\n\r\nMy original idea was just to make a \"web_app_manifest\" section in content.json that supports everything but the dangerous stuff and generates one accordingly.\r\n\r\nBut linking to a separate manifest can't hurt.\r\n\r\nIt might make things easier for some developers.\r\n\r\nI could also just read the manifest from a meta tag like the standards, to support multiple installable apps within one site.", "added": 1557504215, "modified": 1557504215, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1065#issuecomment-491397879", "source_type": "github"}], "1604067037_mirrored_blurHY_github": [{"comment_id": 4, "body": "What about a service worker?\r\nZeroNet runs via localhost anyways, so it should get permission to use secure site APIs from the browser.\r\n\r\nCould just have it push notifications to the browser, this would also cover the case for notifications when the site (or browser) isn't open.", "added": 1557504396, "modified": 1557504419, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1801#issuecomment-491398719", "source_type": "github"}]}, "next_topic_id": 2, "topic": [{"topic_id": 1604067347, "title": "Update Sidebar.css for grabbing cursor", "body": "Cross browser grabbing cursor.", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1562341356, "modified": 1562401468, "source_link": "https://github.com/HelloZeroNet/ZeroNet/pull/2074", "source_type": "github"}]}