{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1DKfH9gGEig4MSj47r4Kgkh1atwUNE9KMX": 1
	},
	"next_comment_id": 17,
	"comment": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 1,
				"body": "Os Simpsons S02E19 O Professor Substituto Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587102263_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe",
				"added": 1587102337
			},
			{
				"comment_id": 4,
				"body": "Naruto Classico 58 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587193831_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe",
				"added": 1587193888
			},
			{
				"comment_id": 5,
				"body": "Naruto Classico 59 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587253869_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe",
				"added": 1587253926
			},
			{
				"comment_id": 14,
				"body": "Naruto Classico 60 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587979162_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe",
				"added": 1587979244
			},
			{
				"comment_id": 15,
				"body": "Os Simpsons S02E20 Guerra Conjugal Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587982035_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe",
				"added": 1587982122
			}
		],
		"1_12bpcgBZapJxQQvk6USaEhVLFaTmqK2tvQ": [
			{
				"comment_id": 2,
				"body": "SUS = sistema utópico de saude NUNCA FUNCIONOU, não era agora que iria funcionar.\n\nNão preciso de modelo algum, a realidade me basta  e ela demonstra que o estado e o seu sistema de SUS e qualquer merda, são lixo, não funcionam e ainda custam rios de dinheiro dos trouxas trabalhadores.\n\nPorto Alegre terá ônibus de graça! (ANCAPSU)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1580679833_17TKwrGLehYDEn2J26ooG1qKbtsg2EF9mZ\n\nCoronavirus - como a corrupção na OMS ajudou a espalhá-lo (ANCAPSU)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582701391_172waUkfSs5XTgatb5xa8uHibkV7QTeZhJ",
				"added": 1587146041
			}
		],
		"1_1DKfH9gGEig4MSj47r4Kgkh1atwUNE9KMX": [
			{
				"comment_id": 3,
				"body": "quero ver eles proibirem algo na zeronet :)  Coronavirus - como a corrupção na OMS ajudou a espalhá-lo (ANCAPSU)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582701391_172waUkfSs5XTgatb5xa8uHibkV7QTeZhJ",
				"added": 1587146294
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 6,
				"body": "Red 2 (Aposentados e Ainda Mais Perigosos) 2013 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587325444_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: Tudo o que Frank Moses (Bruce Willis) queria era levar uma vida normal ao lado da namorada Sarah (Mary-Louise Parker), mas seu sonho vira um pesadelo quando seu parceiro Marvin Boggs (John Malkovich) aparece com uma novidade: suas vidas estão em perigo. Frank não dá muito crédito para as palavas do amigo, mas logo se vê forçado a acreditar que algo está acontecendo quando acaba sendo levado para um interrogatório e quase é morto. Agora, ele tem certeza de que sua cabeça e a de seu melhor amigo estão a prêmio. A questão é descobrir porque e como evitar que isso aconteça, nem que para isso eles tenham que correr o mundo, reeconcontrar velhos parceiros, na figura de Victoria (Helen Mirren) e enfrentar antigos inimigos, como o poderoso Han (Byung-Hun Lee). A caçada está só começando.",
				"added": 1587326234
			},
			{
				"comment_id": 7,
				"body": "Missão Impossível 1 1996 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587358793_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: Durante missão em Praga, grupo especial de agentes cai em cilada. Ethan Hunt (Tom Cruise) descobre que apenas ele e outra agente sobreviveram. Tomado como informante, ele foge e tenta desvendar a trama por conta própria.",
				"added": 1587359306
			},
			{
				"comment_id": 8,
				"body": "Homem Aranha 1 2002 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587367783_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: Peter Parker é um jovem estudioso que vive com seus tios, Ben e May, desde que seus pais faleceram. Peter tem dificuldade em se relacionar com seus colegas, por ser tímido e por eles o considerarem um nerd. Até que, em uma demonstração científica, um acidente inesperado faz com que aranha modificada geneticamente pique Peter. A partir de então seu corpo é quimicamente alterado pela picada da aranha. Inicialmente Peter pensa em usar seus novos poderes para ganhar dinheiro, adotando o nome de Homem-Aranha e se apresentando em lutas de exibição. Porém, ao permitir que um ladrão fuja por não considerar sua função capturá-lo, o fugitivo acaba assassinando seu tio Ben. A partir de então, Peter decide usar seus poderes para enfrentar o mal, tendo como seu primeiro grande desafio enfrentar o Duende Verde.",
				"added": 1587367891
			},
			{
				"comment_id": 9,
				"body": "Homem Aranha 2 2004 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587371217_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: Após derrotar o Duende Verde a vida de Peter Parker (Tobey Maguire) muda por completo. Temendo que Mary Jane (Kirsten Dunst) sofra algum risco por ser ele o Homem-Aranha, Peter continua escondendo o amor que sente e se mantém longe dela. Ao mesmo tempo precisa lidar com Harry (James Franco), seu melhor amigo, cuja raiva pelo Homem-Aranha aumenta cada vez mais por considerá-lo como sendo o assassino de seu pai. Além disso sua tia May (Rosemary Harris) passa por uma fase difícil após a morte de seu tio Ben, estranhando também o comportamento do sobrinho. Enquanto precisa lidar com seus problemas particulares Peter recebe ainda uma má notícia: o surgimento do Dr. Octopus (Alfred Molina), um homem que possui tentáculos presos ao corpo.",
				"added": 1587371520
			},
			{
				"comment_id": 10,
				"body": "Homem Aranha 3 2007 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587371753_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: Peter Parker (Tobey Maguire) conseguiu encontrar um meio-termo entre seus deveres como o Homem-Aranha e seu relacionamento com Mary Jane (Kirsten Dunst). Porém o sucesso como herói e a bajulação dos fãs, entre eles Gwen Stacy (Bryce Dallas Howard), faz com que Peter se torne auto-confiante demais e passe a negligenciar as pessoas que se importam com ele. Porém a situação muda quando ele precisa enfrentar Flint Marko (Thomas Haden Church), mais conhecido como o Homem-Areia, que possui ligações com a morte do seu tio Ben. Tendo que lidar com o sentimento de vingança, Peter passa a usar um estranho uniforme negro, que se adapta ao seu corpo.",
				"added": 1587371873
			},
			{
				"comment_id": 11,
				"body": "Valkyrie (Operação Valquíria) 2008 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587406291_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: A história é sobre uma das histórias mais heróicas da Segunda Guerra Mundial, mas também uma das mais desconhecidas. Gravemente ferido em combate, o coronel alemão Claus von Stauffenberg (Tom Cruise) retorna para a África para se juntar à resistência alemã e ajudar a criar a Operação Valkyrie, um complexo plano que irá permitir a substituição de Hitler no poder assim que ele estiver morto. O destino e as circunstâncias fazem com que Stauffenberg se torne uma peça central na missão. Ele não só tem que liderar o golpe e tomar o controle do governo de seu país, como fica encarregado de matar Hitler com as próprias mãos.",
				"added": 1587406541
			},
			{
				"comment_id": 12,
				"body": "16 - 007 - Marcado para a Morte 1987 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587799254_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: Georgi Koskov, um general dissidente da União Soviética, escapa do país com a ajuda de James Bond, mas logo recapturado através de uma missão de resgate que faz o serviço secreto inglês perder credibilidade. A partir de então, 007 assume o caso e vê fatos surpreendentes ao conhecer Kara Milovy, uma violoncelista tcheca com quem se envolve. Bond acaba descobrindo uma grande trama ligada a Brad Whitaker, um grande comerciante de armamento bélico.",
				"added": 1587799508
			},
			{
				"comment_id": 13,
				"body": "Dog Soldiers (Cães de Caça) 2002 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1587865781_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: Imagine que você é o líder de um grupo de seis soldados num exercício de rotina do exército… E que algo sai terrivelmente errado.Você está atrás das linhas inimigas. Seus homens são inexperientes. E vocês não têm munição de verdade. Seu rádio não funciona e vocês estão a pé, isolados na mais deserta e hostil escuridão.Imagine que vocês foram traídos por seus próprios superiores. Que são iscas numa armadilha montada por forças governamentais. E que ainda têm um homem seriamente ferido para cuidar.Imagine que o sol começa a dar lugar a uma enorme lua cheia. Que uivos arrapiantes podem ser ouvidos ao longe. E seus homens estão com medo de morrer.Imagine que a sensação de que, a qualquer momento, vocês podem ser atacados por lobos assassinos está cada vez mais latente…",
				"added": 1587866288
			},
			{
				"comment_id": 16,
				"body": "Daybreakers (2019 – O Ano da Extinção) 2009 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1588049706_1Hm6fF83qtJTasEvEWfs9mmQ9NLuVpqSfe\n\nSinopse: No ano de 2019, uma praga transformou quase todos os humanos em vampiros. Com a queda do suprimento de sangue, a dividida raça dominante planeja sua sobrevivência, enquanto um pesquisador trabalha com um grupo de vampiros disfarçados em busca de um modo de salvar a humanidade.",
				"added": 1588049943
			}
		]
	},
	"comment_vote": {}
}