{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "PT remove nota em apoio a Venezuela, mas backup da Internet Arquive persiste",
			"body": "https://web.archive.org/web/20170810155819/www.pt.org.br/pt-divulga-nota-em-apoio-a-venezuela/",
			"added": 1539551642
		}
	],
	"topic_vote": {
		"1_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": 1,
		"1_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1_1LDX48jX1gt7dwgNFCAaeT7bSVXnuJWH9m": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1Anr114gznurn8nhMnQAwkfSTri4fZ7W9X": [
			{
				"comment_id": 1,
				"body": "ideia interessante, já estou pensando em algum tópico para postar",
				"added": 1539550345
			}
		],
		"1_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": [
			{
				"comment_id": 2,
				"body": "pra mim é sobre defender os valores da família e da propriedade, oque tá cada dia mais difícil nesse país, e também a liberdade econômica e desburocratização de órgãos públicos",
				"added": 1539606783
			},
			{
				"comment_id": 3,
				"body": "> [moor](#comment_2_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): Quais valores de família foram afetados? com quais políticas? quais de propriedade? liberdade econômica em que área? (com ou sem medidas antinacionalistas?). quais setores de órgãos públicos? tem exemplos?\n\nnão sou nenhum especialista, mas por exemplo:\nCom família digo manter os assuntos a respeito da educação dos filhos totalmente por conta dos pais, não cabendo ao estado interferir e ensinar nas escolas ideias de sexualidade, e padrões familiares, como foi o famoso caso do queermuseu onde crianças do fundamental foram levadas pra uma exposição totalmente inapropriada pra sua idade, e sem o conhecimento dos familiares a respeito do conteúdo.\nCom liberdade econômica digo a facilitação na criação de empresas e diminuição da carga tributária nesta área e também a abertura de alguns mercados para a competição, como as telecomunicações que atualmente é um oligopólio.\nCom propriedade creio que essa deve ser a mais sagrada, e mesmo assim existem limites no que cabe a legitima defesa, nos é negado o direito a posse da maioria das armas, existem grupos como o MST e MTST invadindo fazendas em diversos locais do Brasil, principalmente no norte, e nada o estado faz, e nada dessas pessoas serem punidas.\nE na desburocratização dos orgãos publicos dou de exemplo os cartórios, essenciais para a movimentação de empresas e também atribuído a diversas tarefas civis como casamentos, nascimentos, registro de imóveis etc, e ainda assim são extremamente lentos, não só nas filas mas também na realização das tarefas, podendo levar dias para tirar uma simples cópia autenticada de algum documento, e eu acredito que isso causa grande desincentivo as pessoas para fazer negócios, oque causa danos a economia.",
				"added": 1539655370
			}
		]
	},
	"comment_vote": {}
}