{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "郭文贵的遭遇和林彪悲剧的启示",
			"body": "郭文贵的遭遇和林彪悲剧的启示\n\n+ 郭文贵作为中共体制外的一流情报特工，执行能力很强的一流企业家，在草根阶层中脱颖而出、与众多访民冤民一样具有强烈维权意识的中国人，多次为特色党国立下一等功，但却遭到特色党国的无情压迫，甚至面临被暗杀、全家遭灭门的巨大危险，这个事实说明，如果是类似薄熙来那样有红色基因的人在政治斗争中失败，需要在秦城里继续为人民服务，而如果是没有红色血统的人士在某个阶段的政治斗争中一旦失利，随时都面临类似徐明、李明那样被杀人灭口的祸患。\n\n郭文贵的遭遇，让人想起伟大的林彪副统帅和国家主席刘少奇同志在文革当年的遭遇。郭文贵不断遭到特色党国不择手段地抹黑、诬陷，特色党国的抹黑手段如同对付刘少奇那样。除了抹黑诬陷之外，特色党国动用庞大的黑客力量攻击推特网站、操纵白宫请愿的网站数据等各种阴损招式则说明，特色党国在非常迫切地企图制造类似林彪九一三事件那样的暗杀伎俩。 林副统帅当年被毛泽东牵着鼻子走，把毛泽东捧上神坛，为毛泽东背弃49年前的宪政民主、走向独裁立下了汗马功劳，但很快就被人间蒸发。而不可一世的毛泽东在九一三事件后，“万岁”的神话难以维持，几年后就寿终正寝了。\n\n郭文贵多次立下一等功，与林彪的功勋可能无法比较，但是在亿万百姓维权意识强烈的时代，郭文贵的维权爆料将超越林彪的历史局限性。特色党国动用一切力量对付郭文贵，只是为了维持他们在网络柏林墙内的黑暗罪恶。随着各种罪恶不断地曝光，特色党国正在变得越来越疯狂，各种疯狂的手段，恰好暴露了他们走向穷途末路的惊慌失措。\n\n+ 郭文贵坚定追求公平正义，同时反复强调郭七条 — 反对以贪反贪、以黑反腐、以警治国、以警反腐的四个乱象；坚持三不原则，不反习主席，不反中华民族，不反国家。这种态度主要是希望避免过于激烈的暴力革命被某些盗国贼们利用特务捣乱，复制六四的血腥。随着实践层面不断地努力贯彻郭七条，越来越多的同胞们更加清晰地认识到，郭七条不一定很完美，无法满足所有人的诉求，但是郭七条很务实，是可以在实践中不断推动、符合多数人共同诉求的、能够实现公平法治的非暴力抗争运动。\n\n\t中国大陆一群披着所谓“共产的党”的外衣，实际上连官僚财产都不敢公布的蛆虫党、匿产帮匪徒们既无资格代表曾经伟大、光荣、正确的中国共产党，更不能代表中华民族！一群蛆虫帮匪徒们不只是在中国大陆老百姓的生活空间里到处制造雾霾，他们也在网络上到处制造信息雾霾，企图通过自欺欺人的信息恐怖主义愚民政策，对大陆的老百姓进行丧尽天良的长期专政，还企图奴役香港，控制台湾，腐化一带一路，甚至把邪恶的专政扩大到全世界去。\n\n\t郭文贵在5月中旬的爆料涉及香港、台湾、马来西亚和中东地区，全面的爆料信息说明，特色党国不顾国内百姓的死活，却在高调铺张地推行的所谓“一带一路”建设，里面隐藏着巨大的金融洗钱罪恶、官商勾结腐败，在巨大的房地产泡沫背后，隐藏着特色邪党蛆虫帮们罄竹难书的罪恶，所有罪恶黑幕，很快就会揭开！ \n\n\t随着各种爆料的深入探讨，中国、大陆、香港、台湾、马来西亚和一带一路沿线将会全面发起“一带一路”维权运动。\n\n+ 美国精英团体也联合起来了，在网络上下展开调查、准备反击。特色党国可能使用各种手段对付推特和白宫网站，操纵网络数据，但他们也不敢公然让白宫网站瘫痪。**既然有网友发起了白宫请愿，请海内外同胞和世界各地的人们一起推动白宫请愿吧。**\n\n\t世界各地关注郭文贵推特信息的群体非常庞大。请海内外同胞和世界各地的人们把白宫请愿的相关信息发给更多人看到，让更多人参与进来。越多人参与，特色党国就会越恐惧，然后又是不择手段地搞大规模的网络攻击，暴露出更多网络战争和网络罪恶的漏洞。\n\n\t雾霾天朝的反腐败实际上是黑帮内斗，只是庞大的黑帮内斗规模太大了，掩盖不住罪恶，所以他们企图制造一个以“人民的名义”进行反腐败的假象。在现实中，世界各地的人们真正展示出来的可是“人民的力量”，各种力量不断汇聚，准备一场涉及一带一路、波及全球的维权运动！\n\n\t在全球性的维权运动全面爆发之前，请同胞们大力支持白宫请愿。鉴于大陆目前处于疯狂的信息恐怖气氛之中，大陆以外的地区信息流动比较自由，\n请香港、台湾、海外同胞们积极参加白宫请愿签名。白宫请愿、全球联署！\n\n\t2017，正义的能量不断聚集。全球维权运动，准备爆发！\n\n***[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)***\n***[转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)***",
			"added": 1495555548
		},
		{
			"topic_id": 2,
			"title": "李克强大力支持香港民主，传递郭文贵蝴蝶效应",
			"body": "郭文贵爆料掀起蝴蝶效应，中南海蛆虫帮派系林立的权力斗争进入白热化状态，已全面失控。 \n\n习近平是一个虚伪无耻、懦弱无能的政客。习近平在公开场合宣扬“不忘宪政初心、推动法治前进”，但实际上却是与王岐山搞团团伙伙，暗中复辟文革，不断封杀媒体言论，还无耻地公开宣扬所谓“党媒姓党”，实际上也就是企图复辟毛泽东文革式的高压专政，把中国的媒体全部装进习家的口袋。 郭文贵说习近平没有王岐山那么严重的经济腐败，但郭文贵故意不指明，习近平实际上梦想的是比王岐山的经济腐败更隐蔽的特权腐败，类似文革时期的毛泽东那样，当时毛泽东可以随心所欲地杀掉任何一个与老毛有不同思想的人员，包括国家领袖刘少奇也被人间蒸发。习近平一直在企图效仿毛泽东，故意伪装成在经济上廉洁，但是在媒体言论层面施行比毛泽东更加残暴的高压专政。习近平在言论专制层面比毛泽东更加愚蠢，也更加残暴，是因为毛泽东清楚地知道，蛆虫帮的文革暴政不能蔓延到香港，因为大英法治的环境根本容不下罪恶滔天的大饥荒、粮食浮夸风、以及野蛮谋杀国家主席刘少奇等各种罄竹难书的罪孽。但是，习近平在中南海一群蛆虫智囊的误导下，以为在香港也可以裸奔，可以像毛泽东在大陆沦陷区的中南海大粪坑里一样无法无天，公然跨境逮捕香港书商，打压香港的言论自由，即使网络柏林墙无法围堵香港，习近平仍然要使用毛泽东式的文革暴政手法在香港制造法西斯恐怖主义气氛。\n\n假如毛泽东复活，以毛泽东的高超智商，即使在大陆制造出类似打压法轮功那样的大规模暴政，也不会愚蠢到公开跨境逮捕香港书商，因为破坏香港的法治，就是直接丢弃香港的民意支持。只有愚蠢的政客才会给自己挖掘坟墓。 习近平只有阿Q的智商，却企图复辟文革，梦想着拥有毛泽东曾经有过的各种无法无天的特权腐败。信息时代的客观环境已经完全不一样，但习近平的思想仍然停留在文革状态，是典型的刻舟求剑、邯郸学步、东施效颦。\n\n郭文贵猛烈爆料迅速发酵，披着“反腐败”外衣的蛆虫帮派系争斗，已经遭到党内的强烈抵触。蛆虫党魁习近平企图复辟文革的邪恶暴政也必然遭到亿万百姓的反抗。 \n\n在大陆媒体遭到蛆虫党高压封锁的情况下，李克强发声了。李克强虽然不方便公开地强调以信息流畅促进法治流畅的方式协助推动信息自由，但是学识渊博的李克强以迂回的方式，从宏观管理、经济创新的角度公开支持微信自媒体的发展。在这个非常独特的时代格局下，中南海敢公开支持信息自由的官员无疑既不会有王岐山那样的严重经济腐败，也没有像习近平那样制造了7-0-9事件的邪恶罪孽。李克强的非常举动，相当于在暗无天日的法西斯围墙内点燃了一炬火焰，公开告诉世人，以李克强为代表的部分官员是比较廉洁的，是有历史担当的，他们不是蛆虫帮匪徒。李克强等人也在学习郭文贵，不想在大粪坑里继续游泳了，要摆脱蛆虫党的大粪坑，以各种方式推动信息流畅，促进法治流畅。\n\n李克强的这种努力，其实也是在提醒香港人民，李克强既然支持信息自由，自然也支持香港人民要求的民主直选，只是因为网络柏林墙还没有倒塌，李克强不方便公开以维护人权的名义推动信息自由。 这也意味着李克强在鼓励香港人民发起民主运动，要求民主直选香港特首。 \n\n那么，以何种方式发起民主运动呢？李克强自然不方便公开指导，但是李克强支持信息创新的公开表态已经发出了强烈的明确信号。对付那些极端虚伪，躲在粪坑里搞派系斗争却伪装有华丽外衣的政客们，郭文贵的郭七条刚好歪打正着，一方面公开痛斥蛆虫帮、粪坑党的邪恶无耻，同时又强调不反对习主席，仅仅因为习近平没有经济腐败，就可以把习近平歌颂到“千古”圣君的级别，刚好是以特工式的灵活思维顺着习近平的矛，去攻击习近平自己的盾，以习近平相对的经济廉洁，大力揭发其他官员的蛆虫式腐败，是在变相地敦促习近平，不可回避第一裸官王岐山的严重腐败。而习近平即使已经被王岐山绑架，无法维持法治，郭文贵仍然绝口不提习近平梦想复辟文革的特权腐败，而是以拥护“千古”圣君的名义，帮助中国解决信息障碍。 \n\n网络柏林墙虽然没有直接封锁香港，但是9000多个特务进入香港，已经给香港造成法西斯的气氛。包括五毛党、七毛党在内的各种职业特务和业余特务们很多也是身不由己，只是把工作当成饭碗而已，而进入香港的国安特务们被迫去为蛆虫帮效力，是因为他们在大陆的家属受到蛆虫帮的控制。武警司令王建平因为贪图功利，被欺骗去参与黑暗的六四大屠杀，知道太多，已经被灭口了。王建平的蹊跷死亡，也像赵鑫那样，被自杀。被骗去泸州维稳的武警官兵们看到郭文贵爆料后，个个都非常后悔，而被迫去香港的国安特务们更加清楚，他们的命运也像王建平那样，随时都可能因为参与太多的犯罪，而被灭口。 \n\n蛆虫帮是以控制特务的思维来治国的，在比凶斗狠方面，古今中外没有一个门派或政党能够超越混合了马恩列斯、前苏联契卡、克格勃外加秦始皇暴政和满清蛮夷专制糟粕的特色党国。腐朽的蛆虫在阳光下是无法存活的。跟这个粪坑党、蛆虫帮的最佳较量方式不是采用暴力推翻蛆虫，而是让阳光穿透雾霾围墙— 香港和大陆联合起来，推动一场促进公平正义的爱国运动。\n\n习近平干过一件与亿万网民有交集的事情就是敢翻墙，曾经在推特网站维持过好几年的推特页面。 综观上下五千年的“文明史”，没有一位伟大的帝王领袖敢于一方面高高地筑起围墙，在雾霾遮天、暗无天日的法西斯围墙内干尽各种丧尽天良的伟业，同时又公开地翻过围墙，在隐约的翻墙光辉举动中，带有鄙视雾霾围墙的胆略。从这个层面而言，按照郭文贵的逻辑， 与过去的千年历史比较，习近平的确是“千古”圣君；与中国大陆过去的五千年或一万年历史比较，习近平也堪称是 “万古”圣君。历史上没有一个帝王自相矛盾的混乱逻辑，足可以与习近平相匹敌。 \n\n在“千古圣君”习近平的英明统治下，香港小圈子选举出来的伪特首林郑月娥自然也是“千古特首”了。\n\n目前的情况非常特殊。习近平伟人领导的特色党国，实际上是一群连官员财产都不敢公布的“匿产帮”，而不是曾经支持过“共产主义”、把人民当人看的人民的“共和国”。此外，伟大领袖习近平伟人在2012年曾开立过推特页面，但是在2017年3月底重庆出台网络恐怖主义政策后，把习近平吓得立即在4月份就把推特页面都隐身龟缩起来。这个事实说明，习近平伟人根本就不具备前苏联男儿那样的勇气，更不能跟普京相提并论。 一些激进的网友甚至认为习近平可能只是东亚懦夫而已，而不是千古圣君。但由于习近平目前仍然是国家机器名义上的法人代表，为了避免被绑架习近平国家机器的盗国贼们利用特务权术，复制类似“六四”镇压那样的阴谋手法，在大规模的行动中，网友们应当尽量避免公开斥责习近平伟人是东亚懦夫。\n\n反复强调“千古圣君”，以拥护千古“圣君”的说法，推动一场大规模的爱国运动，只是为了尽量减少大规模的摩擦冲突。这种策略，既是务实的，也是对历史负责的。这就是郭文贵反复强调郭七条的缘故。不反习主席这一条，可以理解为不反对习主席翻墙救国、支持习近平统一虚拟主权，支持文化统一和国家统一。\n\n在这个特殊的历史阶段，香港人斥责伪共“匿产帮”“粪坑党”为支那人和支那国，实际上是抬举他们了。为了避免特务们混淆是非，制造大规模的摩擦冲突，大家一起明确地将反对的目标界定为不敢公开官僚财产的伪共“匿产帮”，而不是有数千万党员的“中共”，可以公开痛斥伪共“匿产帮”匪徒们是支那蛆虫、支那孽障。扫帚不到，灰尘不去；全民行动，反蛆除孽。反蛆除孽和反华反共没有一点关系。 港澳台信息和人员组织更自由，可以在香港公开发起爱国运动，以拥护千古“圣君”的名义，公开敦促香港政府支持习近平翻墙救国，公开要求废除辱习反华的网络柏林墙。香港小圈子选举出来的伪特首林郑月娥刚好要不断地展示效忠党国的诚意，经常强调爱党爱国，这种方式，将让林郑月娥、五毛党和七毛党们也找不到反对的理由。被欺骗去维稳的警察们也在不断觉醒，运动一旦发起，大陆军民都会积极响应。\n\n零网、零封锁，自由无国界！零网比推特或者/Facebook等更自由，不需要绑定邮箱或手机。请港澳台同胞多使用零网，探讨交流非暴力爱国运动。\n华夏同胞，行动起来！睁开眼吧，放声吼吧：习核心雄起、习核心不龟缩！中国梦不是狗的梦！废除法西斯围墙、洗雪当代国耻！全民行动，反蛆除孽；清除伪共匿产帮，恢复宪政共和；清除蛆虫党，恢复中华。\n\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1498749126
		},
		{
			"topic_id": 3,
			"title": "一切都是刚刚开始",
			"body": "叶宁作词，铁勋作曲 \n\n严冬过去，大地春归。 一切都是刚刚开始。张开双臂拥抱宪政民主，\n“看那自由太阳正在升起，正在升起”。老百姓手挽手，肩并肩，一起上街去！\n直播直播就是力量，一切都是刚刚开始。蝴蝶的翅膀掀起巨浪狂风，\n“看那自由太阳正在升起，正在升起”。老百姓手挽手，肩并肩，一起上街去！\n有一个声音响彻大地，一切都是刚刚开始。铲除腐败结束一党专制，\n“看那自由太阳正在升起，正在升起”。老百姓手挽手，肩并肩，一起上街去！\n老百姓，上街去！老百姓，上街去！一起上街去！\n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
			"added": 1499146818
		},
		{
			"topic_id": 4,
			"title": "非常“肛裂”的床上女英雄—王芳",
			"body": "「青青蛇儿口，黄蜂尾上针。两者皆不毒，最毒妇人心。」\n\n这里的妇人，指的就是那个大淫妇。她或许明明知道雷洋是因为知道了她与孟肛裂的奸情，而被做局打飞鸡被杀灭口，但却红口白牙说雷洋是因嫖娼而被执法误杀。郭文贵先生的爆料掀起飓风，这对奸夫淫妇必遭天谴，天打五雷轰！",
			"added": 1505625610
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"3_1L3UBHScbiP33svDmiNfNnFLZzebNECgqC": [
			{
				"comment_id": 1,
				"body": "欢迎！即使自称为是所谓“吃瓜”的群众，也是很受欢迎的，因为“吃瓜”群众比部分居心叵测的五毛党们还是更有觉悟的，跟伟大领袖习核心一样智商正常的人都清楚，当人的嘴巴连说话都不自由的时候，还怎么“吃瓜”呀，去喝西北风都不配！ 因为人的嘴巴的功能就是吃饭和说话。\n\n不论是“吃瓜”群众，还是所谓的五毛党们，请更多的群众和党员光临驾到零网、进行视察指导。如果有不满意的地方，请自由地百家争鸣、百花齐放。学习习主席理想，活用习主席的思想，坚持读习主席的书，按习主席的指示办事。凡是习主席做出的决策，网民们都坚决维护；凡是习主席的指示，网民们都始终不渝地遵循。\n\n伟大、光荣、正确的习主席曾经英勇顽强地翻越网络柏林墙，这是五千年历史空前绝后的丰功伟绩、壮丽伟业！请让更多人跟着习主席翻墙，统一虚拟主权；无法翻墙的，请让他们多使用零网。零网、零封锁，协助习主席废除辱习围墙，洗雪国耻！\n\n**[废除辱习反华围墙，洗雪国耻！—香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13) **\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
				"added": 1497237448
			}
		],
		"9_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 2,
				"body": "从这个话题展开探讨，有点火爆，吸引了很多五毛党的火力。要再接再厉，欢迎包括五毛党在内的各路网友到零网来争论、争吵。\n应该予以特别说明：这不是传播“淫乱”传闻，而是对于其他网友传播的各种真假难辨的“淫乱”传闻，展开探讨，让更多人看到零网—零封锁的网络。 https://ZeroNet.io  \n零网 — 零封杀、去信息雾霾\t—  促进虚拟主权统一, 促进国家主权统一  \n\n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
				"added": 1499316840
			}
		],
		"6_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 3,
				"body": "无论是好鸟，还是坏鸟，只要敢公开跟“伪共”“匿产帮”匪徒对着干的人士，广大网民都会支持，真正的“共产党”员也会支持。真正的“共产党”在中南海已经消失了。  \n目前的支那专政国，既不属于人民，也不属于“共产党”。因为一群连官员财产都不敢公布的“伪共”“匿产帮”自然不能代表“共产党”。从“共产主义”、“共产党”等字面信息来看，真正的“共产党”已经消失了很多年。真正的“共产党”只有在习仲勋硕大无比的廉洁陵寝里面才有一丁点残余光辉，在中南海是已经不存在了。因此，郭文贵采取“两极”手法的策略，一方面，极端批判伪共“匿产帮”为“蛆虫帮”、“粪坑党”，一方面却歌颂“蛆虫帮”党魁为“千古圣君”。正常人很容易看清，这只是一种灵活的策略。披着“共产党”的外衣，实际上连官僚财产都不敢公开，干着“匿产帮”的勾当，蛆虫帮匪徒们还自称不但是代表“共产党”，而且还是代表“人民”的“共和国”，这是五千年来非常罕见的自欺欺人的荒唐“盛世”。对付这种极其无耻的、完全自相矛盾的荒唐逻辑，就应该采取类似郭文贵那样的“两极”手法。 结合特色国情和历史潮流来看， “两极”手法的策略，是为了尽量减少大规模的冲突，是对历史负责的务实策略。",
				"added": 1501212474
			}
		]
	},
	"comment_vote": {}
}