{
	"title": "Geekless.News.Ru",
	"description": "Персональная лента новостей",
	"links": "[Geekless@ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/geekless@zeroid.bit)\n\n[Geekless.Blog](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/)\n\n[Geekless.News.En](http://127.0.0.1:43110/1BLogS6nEnAMAuTXi48aVCzUFePD3RoaVD/)\n",
	"next_post_id": 4,
	"demo": false,
	"modified": 1548341240,
	"post": [
		{
			"post_id": 3,
			"title": "Бо́льшая часть текстов в интернете написана безумцами",
			"date_published": 1548340853.493,
			"body": "*Оригинал:  DinoInNameOnly, [reddit.com](https://www.reddit.com/r/slatestarcodex/comments/9rvroo/most_of_what_you_read_on_the_internet_is_written/). ([ZeroNet link](http://127.0.0.1:43110/1BLogS6nEnAMAuTXi48aVCzUFePD3RoaVD/?Post:3))*\n*Перевод: Вячеслав Голованов, [habr.com](https://habr.com/en/post/437108/).*\n*22.01.2019*\n\n\nЯ обнаружил [пост](https://np.reddit.com/r/TheoryOfReddit/comments/3qbpsp/do_we_know_the_percentage_of_redditors_who/cwefw3v/), написанный несколько лет назад, где перечислено, какой процент пользователей Reddit оставляет записи на этом сайте:  \n\n*   В Askreddit около 15 млн уникальных посетителей и 500 тыс. комментаторов.\n*   В /r/pics и /r/funny 10 млн посетителей и 200 тыс. комментаторов.\n*   В /r/TIL и /r/videos нет публичной статистики, но порядка 150 тыс. комментаторов. Также статистики нет у /r/pcmasterrace, /r/wtf, /r/gaming, у каждого из которых по 120 тыс. комментаторов.\n*   У каждого из следующих подреддитов порядка 100 тыс. комментаторов :/r/leagueoflegends (8 млн посетителей), /r/worldnews (6 млн), /r/news (6 млн), /r/movies (5 млн), /r/adviceanimals (3 млн), /r/gifs – неизвестно.\n\nВывод:  \n\n> В крупнейших подреддитах количество уникальных комментаторов составляет от 1% до 3% от читателей.\n\nПолучается, что на Reddit сидит порядка 97-99% пользователей, редко участвующих в обсуждении, и просто пассивно потребляющих контент, который генерят оставшиеся 1-3%. И эта тенденция устойчиво сохраняется в интернет-сообществах, и известна как [правило одного процента](https://ru.wikipedia.org/wiki/%D0%9F%D1%80%D0%B0%D0%B2%D0%B8%D0%BB%D0%BE_%D0%BE%D0%B4%D0%BD%D0%BE%D0%B3%D0%BE_%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D0%B0).  \n<a name=\"habracut\"></a>  \nНо это ещё не всё – ведь не все пользователи, которые реально что-то пишут, делают это регулярно. Правило 1% — это просто другой способ сказать, что распределение людей, делающих вклад, соответствует [степенному закону](https://ru.wikipedia.org/wiki/%D0%A0%D0%B0%D1%81%D0%BF%D1%80%D0%B5%D0%B4%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5_%D0%9F%D0%B0%D1%80%D0%B5%D1%82%D0%BE), то есть, уровень неравенства тем сильнее, чем меньшее подмножество пользователей мы рассматриваем. В статье 2006 года было указано:  \n\n> Неравенство обнаруживается и в Википедии, где более 99% пользователей просто посетители. Согласно самой Википедии, в ней участвует только 68 000 активных авторов, то есть, 0,2% от 32 млн уникальных пользователей в США.  \n>   \n> Наиболее активный костяк Википедии, 1000 людей, или 0,003% от всех пользователей, вносят порядка двух третей всех правок на сайте. Получается, что Википедия ещё более асимметрична, чем блоги, со своим правилом 99,8–0,2–0,003.  \n>   \n> Неравенство участия существует во многих местах сети. На Amazon.com можно найти книгу, проданную тысячами экземпляров, при том, что у неё есть всего 12 обзоров – а, значит, такие обзоры делает менее 1% пользователей.  \n>   \n> На время написания статьи 167 113 обзоров книг на Amazon были сделаны небольшим количеством людей из топ-100\\. Самый плодотворный из них написал 12 423 обзора. У меня не укладывается в голове, как кто-то может написать столько обзоров – не говоря уже о том, чтобы прочесть все эти книги – но это классический пример неравенства участия.\n\nНе знаю, как автор статьи в своё время обнаружил самого плодотворного критика, но я нашёл критика, у которого с 2011 года есть [20,8 К обзоров](https://www.amazon.com/gp/profile/amzn1.account.AGZV527R2U6APJG2FF4DP3AB5KBA/ref=cm_cr_tr_tbl_hof_name). Это получается чуть меньше 3000 обзоров в год, или примерно 8 обзоров в день. Этот человек писал в среднем 8 обзоров на Amazon в день, каждый день, в течение семи лет. Я думал, что это может быть какой-то бот, выкладывающий поддельные обзоры за деньги, но если так, то этот бот хорош, поскольку [Грэйди Харп](http://fictionaut.com/users/grady-harp) – реальный человек, работа которого совпадает с описанием в учётной записи. Я бегло просмотрел некоторые из обзоров, и они выглядят имеющими отношение к книгам, а также у этих обзоров стоит пометка «покупка проверена», что означает, что он, вероятно, их ещё и реально читал.  \n\nЕдинственное объяснение происходящему состоит в том, что этот человек безумен. Нормальные люди так не делают. Мы можем прочесть книг 20 в год, максимум, и мы не пишем для всех этих книг обзоры на Amazon. С ним явно должно быть что-то не так.  \n\nТо же верно и для других веб-сайтов. Один из активных редакторов Википедии, [Джастин Нэпп](https://en.wikipedia.org/wiki/Justin_Knapp), делал в среднем по 385 поправок в день с момента регистрации в 2005 году и, по крайней мере, вплоть до 2012 года. Даже если он не спит и не ест и ничего больше не делает (пока это самое вероятное объяснение), всё равно такое количество правок потребует одной правки каждые четыре минуты. А ещё он не замедляется; проработав семь лет, он внёс миллион правок, а спустя 13 лет приближается к 2 миллионам правок. Этот человек редактировал статьи в Википедии каждые 4 минуты 13 лет подряд. Он безумен, и он крайне серьёзно влияет на то, что мы с вами читаем каждый день, когда нам нужно больше информации практически по любому вопросу. [Есть и другие люди](https://en.wikipedia.org/wiki/Wikipedia:List_of_Wikipedians_by_number_of_edits), похожие на него. У одного пользователя есть 2,7 млн правок, и есть множество других пользователей с более, чем миллионом правок. Причём некоторые из них присоединились к проекту позже Нэппа, и, следовательно, вносят правки чаще него; но мне почему-то не хочется проводить расчёты.  \n\nОдин стример на проекте Twitch, Ninja (имя «в миру» — Тайлер Блевинс), делает видео о том, как он играет в игры, [по 12 часов в день](https://www.polygon.com/2018/4/24/17274636/ninja-fortnite-twitch-h3h3-podcast).  \n\n«График такой: я начинаю играть в 9:30, играю до 16 часов, получается где-то шесть, или шесть с половиной часов, — сказал Блевинс. – Затем я делаю перерыв на 3-4 часа, общаюсь с женой, собаками и семьёй – мы любим устраивать такие семейные вечера – а потом возвращаюсь к компьютеру в 19 часов, и играю до 2-3 часов ночи. Я занимаюсь этим минимум по 12 часов в день, и сплю не более шести-семи часов».  \n\nИ он делает это практически без перерывов с 2011 года, хотя зарабатывать начал совсем недавно.  \n\nСейчас он уже не так популярен, но примерно в течение года практически под любым видеороликом на YouTube самым популярным комментарием была запись, сделанная пользователем [Justin Y](https://www.youtube.com/watch?v=85l5VbJbTtM). Он говорит, что проводит 1-3 часа в день, оставляя комментарии на YouTube, находя видео через раздел статистики, где показано, какие ролики набирают популярность, и многие ролики комментирует, даже не смотря их. Может, он и не сумасшедший, но явно взаимодействует с сайтом не так, как большинство людей, по сути, занимаясь оптимизацией лайков для комментариев.  \n\nЕсли вы читаете обзоры на Amazon, вы по большей части имеете дело с материалами, написанными такими людьми, как Грэйди Харп. Если читаете Википедию, вы, по большей части, читаете статьи, написанными людьми типа Джастина Нэппа. Наблюдая за стримерами на Twitch, вы обычно смотрите за игрой таких людей, как Тайлер Блевинс. А читая комментарии на YouTube, вы, по большей части, читаете записи таких людей, как Джастин Янг. Потребляя контент в интернете, вы по большей части потребляете материалы, созданные людьми, которые по какой-то причине тратят большу́ю часть своего времени и энергии на создание контента для интернета. И эти люди явно отличаются от большинства людей в весьма важных аспектах.  \n\nПока не знаю, что делать с таким наблюдением, кроме как отметить, что его стоит иметь в виду, посещая интернет. Замечу, что я не имел в виду, что эти люди реально клинические сумасшедшие. Я употребляю это слово в ироническом контексте; я уважаю перечисленных людей и они, на первый взгляд, довольно неплохие. Я просто пытаюсь привлечь внимание к тому, что они ведут себя необычно."
		},
		{
			"post_id": 2,
			"title": "Никто ничего не знает о Китае. Даже китайское правительство",
			"date_published": 1548316644.801,
			"body": "*Оригинал:  Джеймс Палмер, [foreignpolicy.com](https://foreignpolicy.com/2018/03/21/nobody-knows-anything-about-china/). ([ZeroNet link](http://127.0.0.1:43110/1BLogS6nEnAMAuTXi48aVCzUFePD3RoaVD/?Post:2))*\n*Перевод: Александр Заворотний, [sputnikipogrom.com](https://sputnikipogrom.com/translated/84506/nobody-knows-china/).*\n*21.03.2018*\n\nЛюбой иностранец в Китае быстро привыкает слышать презрительное «да вы ничего не знаете про Китай» от местных жителей. Это своего рода безусловный рефлекс на любую неудобную тему — как современную, так и относящуюся к одному из множества [исторических мифов](https://camphorpress.com/5000-years-of-history/), которые дети в КНР заучивают как факты. Но, вместе с тем, это правда. Мы не знаем Китай. Но его не знают и сами китайцы, включая их правительство.\n\nМы не знаем Китай по той причине, что, хотя обычно это не признаётся, но почти вся информация о нём ненадёжна, обрывочна или искажена. Огромный размер страны и всё более жёсткая цензура вкупе со всепроникающей паранойей не позволяют узнать хоть что-то достоверное. Официальные данные [постоянно «приглаживают»](https://qz.com/530096/china-data-tricks/) — как в пропагандистских целях, так и ради карьерных соображений. Это в равной степени касается китайцев и иностранцев; возможно, китайским гражданам получить доступ к информации проще, но зато они могут поплатиться за ненужный интерес к ней.\n\nНапример, мы не знаем настоящих цифр роста китайского ВВП. Длительное время рост ВВП был одним из главных критериев оценки работы чиновников — именно поэтому все связанные с этим показателем данные искажаются на каждом уровне, поскольку чиновники, собирающие отчётность, заинтересованы показать впечатляющие результаты. Если же взглянуть на ВВП китайских провинций, то их сумма окажется [на 10% выше](http://www.scmp.com/week-asia/opinion/article/2130788/heres-how-beat-fake-data-about-chinese-economy) общей цифры, публикуемой центральным правительством — и ведь общая цифра тоже искажена в угоду политическим целям. [Руководство провинций](https://www.wsj.com/articles/real-news-on-fake-data-in-china-1515573859) в последние годы всё чаще признаётся в фальсификации данных, но эта фальсификация идёт уже не первое десятилетие. Мы не знаем объём [невозвратных кредитов](https://www.bloomberg.com/news/articles/2018-01-22/fresh-doubts-raised-on-china-s-bad-loan-data-as-fraud-uncovered), которые постоянно скрываются банками. Мы не знаем структуру большинства китайских [финансовых активов](http://www.baldingsworld.com/2017/10/23/everything-we-think-we-know-about-chinese-finances-is-wrong/). Иногда мы не узнаем даже [хороших новостей](https://www.ft.com/content/a9889330-f51c-11e7-88f7-5465a6ce1a00) из финансовой сферы, поскольку до этого ухудшение ситуации скрывали, и теперь никто не хочет в этом признаваться. Мы [не знаем](https://www.nytimes.com/2012/01/26/world/asia/26iht-letter26.html) истинного коэффициента Джини в КНР, который служит для измерения экономического неравенства населения.\n\n* * *\n\nКак бы ни иронично звучало, но экономические данные все же надёжнее всех остальных — поскольку их ненадёжности уделяют много внимания. Национальное бюро статистики Китая неоднократно указывало на факты неудовлетворительного сбора информации и теперь намеревается самостоятельно [собирать](http://www.scmp.com/news/china/economy/article/2117616/chinas-statistics-bureau-take-over-accounting-provincial-gdp-data) данные по провинциям. [Подчистки и попытки скрыть ранее допущенные ошибки](http://foreignpolicy.com/2013/03/20/lies-damned-lies-and-chinese-statistics/) повсеместны — хотя рост идеологизированности и паранойи в однопартийном государстве отчасти препятствует таким ухищрениям.\n\nНо наше незнание простирается далеко за пределы экономики. Посмотрите на любую сторону жизни в Китае — и обнаружите искажённую или скрытую информацию; поговорите с местными властями — в частном порядке они могут признать самые шокирующие факты.\n\nМы не знаем, сколько людей живёт в Китае, поскольку [мало кто спешит регистрировать](https://qz.com/941240/china-keeps-finding-millions-of-people-who-never-officially-existed/) вторых детей в семье, а отделы планирования семьи не хотят признавать, что не в состоянии контролировать рождаемость. Мы не знаем, где живут эти «лишние» люди: деревенские власти любят завышать численность населения ради правительственных субсидий, а городские любят занижать — ради отчётности по контролю над рождаемостью. Официально в Пекине проживает 21,7 млн человек. В реальности их может быть 30 или 35 млн. Десятки, возможно, сотни миллионов трудовых мигрантов официально числятся в сельской местности, а на самом деле проживают в городах (кроме того, мы [не знаем](https://www.economist.com/news/leaders/21731838-officials-beijing-are-using-brutal-tactics-limit-citys-population-they-are-wrong-even) масштаба недавних выселений бедняков из крупных городов КНР). Мы не знаем, дышат ли китайцы чистым воздухом и пьют ли чистую воду, потому что данные по экологии [полны лакун](http://datadriven.yale.edu/wp-content/uploads/2017/01/ThirdWave_Data_Gap_Analysis_Final.pdf).\n\nМы [не знаем](http://www.chinafile.com/reporting-opinion/viewpoint/why-do-we-keep-writing-about-chinese-politics-if-we-know-more-we-do) _вообще ничего_ о китайской политике на высоком уровне. В лучшем случае можно, как я, делать [догадки на основе определённых фактов](http://foreignpolicy.com/2017/10/19/the-resistible-rise-of-xi-jinping/). Мы не знаем, как функционирует политическая кухня Чжуннаньхай, китайского аналога Кремля. Китайские политики не пишут откровенных мемуаров; китайские журналисты не могут опубликовать ни _«Огонь и ярость»_, ни [_«Чего это стоит»_](https://www.amazon.com/What-Takes-Way-White-House-ebook/dp/B005EXHAVK/ref=sr_1_1?s=digital-text&ie=UTF8&qid=1521462553&sr=1-1&keywords=richard+cramer), ни даже [_«Игра изменилась»_](https://www.amazon.com/dp/B0033V4SDI/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1). Мы не знаем, заинтересован ли Си Цзиньпин в [богатстве и могуществе](https://www.amazon.com/dp/B00BH0VU4W/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1) Китая — или только в своём собственном.\n\nМы не знаем, были ли чиновники, попавшие под каток «антикоррупционных» кампаний, действительно [коррумпированными](https://www.nytimes.com/2015/06/12/world/asia/zhou-yongkang-former-security-chief-in-china-gets-life-sentence-for-corruption.html?mtrref=www.google.com&gwh=06FDE9F0D7FCE56CA3B35986230EAE81&gwt=pay&assetType=nyt_now), [развратными](http://languagelog.ldc.upenn.edu/nll/?p=36737) или ненадёжными — или им просто не повезло оказаться в числе [политических оппонентов](http://www.scmp.com/news/china/policies-politics/article/2123802/criminal-case-opened-against-sun-zhengcai-graft-charges) Си. Мы не знаем, насколько Коммунистическая партия Китая погрязла во фракционной борьбе, хотя мы знаем, что эти фракции [существуют](http://www.globaltimes.cn/content/968895.shtml), и это [осуждается](https://www.theguardian.com/world/2016/may/04/china-xi-jinping-house-of-cards-attacks-conspirators) Си Цзиньпином (и его фракцией). Мы не знаем, действительно ли расточающие [рабские похвалы](http://languagelog.ldc.upenn.edu/nll/?p=37158) Си Цзиньпину чиновники верят в собственные слова, или же ими движет страх и жадность.\n\nМы не знаем, что думают простые люди. Мы не знаем, действительно ли китайцы поддерживают правительство или осторожничают, когда незнакомцы задают им неудобные вопросы на улицах страны, известной политическими репрессиями. Мы не знаем, почему китайцы [заявляют опрашивающим](https://books.google.com/books?id=VGA9OONVhtcC&pg=PA102&lpg=PA102&dq=chinese+trust+values+survey&source=bl&ots=8_u0_otfAm&sig=NGEeQ1gCPw-kfMO9JnsDo3ljK4I&hl=en&sa=X&redir_esc=y#v=onepage&q=chinese%20trust%20values%20survey&f=false), что более склонны доверять друг другу, чем любые другие народы, если на самом деле [паранойя](http://foreignpolicy.com/2017/05/24/chinese-citizens-want-the-government-to-rank-them/) в китайском обществе достигла такого уровня, что старикам на улицах [отказываются помогать](https://thenanfang.com/helping-fallen-old-people-china-takes-another-backlash-video-proves-old-woman-wrong/), опасаясь какого-то обмана, а сбитых машиной детей вроде Ван Юэ [бросают умирать](https://en.wikipedia.org/wiki/Death_of_Wang_Yue).\n\nМы не знаем истинных размеров [оборонного бюджета](https://chinapower.csis.org/military-spending/) КНР. Мы не знаем, в каких условиях живёт обычный служащий китайской армии, поскольку информация об этом жёстко цензурируется, а солдаты ещё более ограничены в возможности высказаться, чем гражданские.\n\nМы не знаем, насколько качественное образование в китайских школах, потому что постоянно повторяемая статистика Международной программы по оценке образовательных достижений учащихся (PISA), согласно которой КНР заняла первое место в мире, основана на показателях небольшой группы элитных шанхайских школ. Как только анализ начал учитывать хотя бы Пекин — ещё один китайский мегаполис — и две богатых провинции, то результаты [резко ухудшились](http://www.sixthtone.com/news/1659/china-drops-top-tenth-pisa-education-ranking) (согласие PISA учитывать столь ограниченную статистику вполне соответствует [наивности и уступчивости](https://www.brookings.edu/research/attention-oecd-pisa-your-silence-on-china-is-wrong/), которые многие иностранные неправительственные организации, особенно в сфере образования, проявляют при работе в Китае; я видел множество иностранных специалистов по образованию, которые бросались восхищаться потёмкинскими деревнями — например, они верят, что [средняя школа №4 Пекина](https://en.wikipedia.org/wiki/Beijing_No._4_High_School), которую можно приблизительно сравнить с Итонским колледжем, — это «типичная китайская школа»). Мы не знаем, насколько [упал](https://www.sciencemag.org/news/2017/09/one-three-chinese-children-faces-education-apocalypse-ambitious-experiment-hopes-save) уровень образования в сельской местности. Мы не знаем, сколько китайцев грамотны — в том числе, и из-за того, что уровень грамотности в городе и на селе оценивается по разным стандартам — это обычная местная статистическая практика.\n\nМы не знаем реальных показателей преступности, особенно в городах, где официальные цифры [могут составлять](https://chinachannel.org/2018/01/10/crime-statistics/) лишь 1/40 от реальных. Мы не знаем, сколько людей гибнет в ходе непрекращающихся уйгурских бунтов в Синьцзяне, где местные чиновники, по словам одного правительственного эксперта по борьбе с терроризмом, «искажают цифры не меньше, чем во время „Большого скачка“»; мы также не знаем, [сколько людей](https://www.theguardian.com/world/2018/jan/25/at-least-120000-muslim-uighurs-held-in-chinese-re-education-camps-report) в настоящее время удерживаются в исправительных лагерях (и мы так и не узнали, сколько погибло в ходе «Большого скачка» при Мао, когда трупы сбрасывали в траншеи или бросали в поле: может, их было 16,5 млн человек, как утверждают официальные источники, а может, [45 миллионов](http://www.scmp.com/article/723956/revisiting-calamitous-time), как оценивают некоторые историки).\n\nБолее того: мы не знаем, чего мы еще не знаем. Есть известное неизвестное, но неизвестное неизвестное не менее обширно.\n\nВозможно, существуют вещи, которые влияют или повлияют в будущем на Китай и весь мир грандиозным образом — мы не знаем об этом. Иностранным репортёрам позволено находится лишь в ряде крупных городов, преимущественно в Пекине, Шанхае и Шэньчжэне; они подвергаются [слежке и притеснениям](http://www.scmp.com/news/china/policies-politics/article/2131231/foreign-journalists-china-complain-growing-abuse) при попытках перемещаться по стране, и особенно — по сельской местности (по официальным данным, Пекин и Шанхай, которые выдаются за «норму жизни в новом Китае» составляют не более 4% общего населения). Для китайских журналистов дела обстоят намного печальнее: даже весьма скромные возможности для занятия журналистскими расследованиями, которые существовали в 2000-е, активно пресекаются властями, которые уверены, что подобные расследования следует предоставить Партии. Страх запечатывает рты; те, кто раньше соглашался называть свои имена, теперь говорят только на условии полной анонимности, а большинство и вовсе отказывается говорить.\n\nИсточники информации, раньше бившие тонкой струйкой, за последние годы под прессом цензуры почти иссякли. Сервис микроблогов Weibo, какое-то время являвшийся отдушиной для жалоб и скандалов на провинциальном уровне, теперь [жёстко цензурируется](https://pen.org/forbidden-feeds/). На смену ему пришли групповые чаты в WeChat, но в прошлом году цензура обратила внимание и на него.\n\nВсё это заставляет еще выше оценивать работу людей, которым всё-таки удаётся собирать важные экономические и политические данные — здесь стоит упомянуть исследователя [Адриана Зенца](https://www.wsj.com/articles/china-spends-more-on-domestic-security-as-xis-powers-grow-1520358522). И, пока китайское государство последовательно уничтожает каждый неподконтрольный источник информации, можно поразмышлять, а сколько же знает само это государство. Китайские чиновники постоянно запрашивают титанические объёмы самой разнообразной информации; могут, например, потребовать подготовить «списки лиц, посещающих религиозные службы в вашем районе, и мест, где проводятся такие службы». Но система [всегда искажала](https://aeon.co/essays/will-information-open-up-china-or-close-the-ranks-for-good) информацию при передаче данных даже внутри самой себя; вероятно, этих искажений стало на порядок больше после того, как Си Цзиньпин [перешёл к откровенной диктатуре](http://foreignpolicy.com/2018/02/26/chinas-stability-myth-is-dead/). Ли Кэцян, премьер Госсовета КНР (орган, который, как мы предполагаем, всё больше утрачивает значение), в 2007 году жаловался американским дипломатам на неспособность получить хотя бы основные экономические данные в управляемой им тогда провинции; ему пришлось подряжать приятелей и коллег заниматься тайным сбором хоть какой-то информации.\n\nПравительство пытается решать проблемы, делая ставку на большие данные: оно верит, что, если обойти чиновников низших уровней, то можно получать информацию напрямую. В большие данные вкладываются [огромные средства](https://www.newamerica.org/cybersecurity-initiative/blog/chinas-plan-lead-ai-purpose-prospects-and-problems/). Работа также ведётся в области [превентивной охраны порядка](https://www.hrw.org/news/2018/02/26/china-big-data-fuels-crackdown-minority-region) и [повсеместной слежки](https://www.project-syndicate.org/commentary/xi-jinping-surveillance-state-by-mark-leonard-2018-02) за диссидентами. Правительство требует и от китайских фирм, и от [иностранных фирм](https://www.theregister.co.uk/2017/06/01/china_cybersecurity_law/) с китайским присутствием (вроде Apple) записывать и передавать информацию. Но и сами большие данные подвержены [систематическим искажениям](https://arstechnica.com/tech-policy/2017/12/is-big-data-racist-why-policing-by-data-isnt-necessarily-objective/), зачастую [не оправдывают доверие](https://theconversation.com/googles-flu-fail-shows-the-problem-with-big-data-19363) и вообще заставляют вспомнить древнейшее правило программирования, которое гласит: «ерунда на входе — ерунда на выходе».\n\nКак экономист Джозайя Стамп писал о другой державе, которая пыталась контролировать обширные территории репрессивными методами, «Правительство [Британской Индии] весьма серьёзно подходит к статистике: её собирают, суммируют, возводят в энную степень, извлекают из неё кубический корень и получают превосходные диаграммы. Но нельзя забывать, что все эти цифры в качестве первоисточника имеют _деревенского старосту_, который выводит, что ему только взбредёт в голову». Позволят ли современные технологии показать китайскому правительству лучшие результаты? Этого мы не знаем."
		},
		{
			"post_id": 1,
			"title": "О сайте",
			"date_published": 1548299400,
			"body": "Привет!\n\nДобра пожаловать на мою персональную ленту новостей! Я собираюсь публиковать здесь репосты из обычного интернета, посвященные в основном информационным технологиям, и, может быть, некоторым другим темам, таким как наука, языки, политика и т.д.\n\nНекоторые другие мои сайты:\n\n*   [Мой профиль в Zero.Me](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1GooUE19488nDwG3TdkM8seYAHct4gjkq4/geekless@zeroid.bit)\n*   [Мой персональный блог](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/)\n*   [Моя лента новостей на английском](http://127.0.0.1:43110/1BLogrYk5XU4A82eRugxzcwYDpYwkUXerj/)"
		}
	]
}