{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1556874344,
			"title": "Techniques and tools for creating system backups",
			"body": "I recently migrated from macOS to Linux and am in the process of getting a back-up process established. To mitigate the risk of losing my physical back-ups I'm looking at borg and possibly backing up to MEGA. What tools or techniques do you use?",
			"added": 1556874343
		}
	],
	"topic_vote": {
		"1557063639_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"1557199534_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"1557191513_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1555449613_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 1,
				"body": "Think of Bitcoin as an index as opposed to just one coin. Each split can create a chain doing some meaningful work. In the end the best features of each are chosen and the index grows and shrinks over time.",
				"added": 1555861798
			},
			{
				"comment_id": 2,
				"body": "> [atomiserxenolith](#comment_41_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Why value of BCH coming down?\n\nBCH is in full-on bull pennant formation at the moment based on the TraderView charts referencing Coinbase. It is the top performing larger-cap altcoin over the last three months with EOS up there as well.",
				"added": 1556013644
			}
		],
		"1556874220_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 3,
				"body": "Download NewPipe from F-Droid and start downloading. Search for \"x264\" and \"BRRip\", and group tags like \"YIFY\". If they can't be uploaded to DTube then you know where to start. Also, please don't offer money. It's insulting.",
				"added": 1556875444
			}
		],
		"1556874344_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1": [
			{
				"comment_id": 4,
				"body": "> [skwerlman](#comment_85_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): there are 2 types of backups, on-site and off-site, and within those are \"hot\" and \"cold\" backups. [...]\n\nCurrently I'm backing up to SD for on-site given they're cheap and portable. For off-site it's still a toss-up but I'd like to combine tooling and run some scripts for ease of maintenance. I'll duck the 3-2-1. Thanks for sharing.",
				"added": 1556875914
			},
			{
				"comment_id": 5,
				"body": "> [greyti](#comment_22_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse): Make sure, this is a last resort... if you back up to a cloud make sure that its trusted and encrypted... No google microsoft dropbox.. Mega is a maybe although I lost access to my account because the site could never load my drive.. if you want to go the long and lasting and most secure route then get a raid storage system or download a automatic fileback up program with atleast 2 drives...\n\nAgreed cloud as a last resort. But I also want 3 copies always. If I back-up online all data will be locally encrypted inside a container of some sort prior to upload. I'm curious to know more about what happened with MEGA? Were you using their API or a GUI client when you lost your account? Note I'm familiar with the MegaUpload story and Dotcom's suggestion not to trust MEGA a couple of years ago due to the Chinese investor.",
				"added": 1556876052
			}
		],
		"1557063639_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [
			{
				"comment_id": 6,
				"body": "Using wake locks I've had trouble getting processes in Termux to stay running. What have your experiences been?",
				"added": 1557120992
			}
		],
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 7,
				"body": "> [duck0](#comment_39_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I don't go near Brave due to their shitcoin ICO.  [...]\n\nBitcoin integration would be interesting. But I don't see it in any way aiding privacy.  As for Brave, they've been leaking trackers to Fakebook and Critter for well over two years using a short whitelist. To me that's worse than not blocking anything. Add BAT token to the mix and I'd expect deceptive tracking most've never even seen before.",
				"added": 1557121401
			},
			{
				"comment_id": 8,
				"body": "> [sinewave](#comment_7_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR): Waterfox is an interesting option. https://www.waterfox.net/. There are builds for Windows, OSX and Linux.  [...]\n\nThe \"No telemetry\" feature is a nice sell, though right below it they state they are, in fact, sending telemetry. Have you compared this with IceCat (formerly GNU IceWeasel)?",
				"added": 1557121559
			},
			{
				"comment_id": 9,
				"body": "> [quantumworld](#comment_409_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Expect a full computer and network shut down in the future. When the Cia makes there move everything will go down. This includes gps systems, software and hardware. We will have 7 days of no power and no internet just to push our buttons and let everyone know who is in control.\n\nLet's assume something like that did happen. At that point you enable Bluetooth and start distributing the Manyverse app to your friends. You rely on off-the-grid communication for a time as infrastructure is restored and Bluetooth Mesh networks are established. The end result is a more fault-tolerant and resilient Web.",
				"added": 1557201344
			},
			{
				"comment_id": 12,
				"body": "> [quantumworld](#comment_414_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): delta9\n\nIt may be time to adjust your understanding of Bluetooth Mesh.",
				"added": 1557293848
			}
		],
		"1557191513_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [],
		"1557049303_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 11,
				"body": "Before you react to this please consider the related ZeroTalk post titled \"The Gentleman’s Guide To Forum Disruption\" and appreciate the ability to do and say here what you please. If the message here upsets you, please find something else more productive to do.",
				"added": 1557208817
			}
		]
	},
	"comment_vote": {
		"27_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"33_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"739_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"399_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"742_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"20_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1
	}
}