{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1547153094,
			"title": "Duplicate files and/or symbolic links in Zeronet site?",
			"body": "Hi, I was just wondering : what happens if I put several occurences of the same file in a Zerosite? Since they all have the same hash, they'll only be downloaded once, won't they?\n\nAnd if that's so, what happens if I use symbolic links instead?",
			"added": 1547153093
		},
		{
			"topic_id": 1550128123,
			"title": "ZeroProxies as Hidden Services?",
			"body": "Are there any currently working zeroproxies that are published as TOR hidden services?",
			"added": 1550128121
		},
		{
			"topic_id": 1553065069,
			"title": "New cluster in IFS?",
			"body": "Is it possible to create a new cluster in IFS, or are we stuck with Cluster 1 & 2 until the zite's owner decides otherwise?",
			"added": 1553065066
		}
	],
	"topic_vote": {
		"1547325276_1Jn2r5AhDMYjYmfrxqKjRspzHpDYcWsAWX": 1,
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1553065069_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1530904389_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Long time ago, I started converting some old classics to modern html+javascript engines, like http://twinery.org/ and https://github.com/idmillington/undum . Never really finished anything, but I guess they could fit quite nicely on ZeroNet. Maybe I should just commit them to some 0Git repo someday.",
				"added": 1530909235
			}
		],
		"1547239393_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 2,
				"body": "I'm not sure we need more buttons. We need boxes. Small, possibly RPi-based boxes, to set to people houses and to serve ZeroNet through transparent proxying.\n\nI don't want to install some more software to, say, my parents or girlfriend. Just plug the thing to their router, and they're good to go.",
				"added": 1547241174
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_417_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The amount of hand-holding you'd have to do day in/out would be enough to charge a monthly rate, and then you'll have to convince them that they need or want ZeroNet enough to justify the cost, but more likely plebeians will prefer to drool and continue the currency exchange of likes for prayers on Facebook.\n\nNever said I was going to give away those little boxes =)\n\nIt's much easier to sell something physical, these days. People are just used to free services.",
				"added": 1547242085
			},
			{
				"comment_id": 6,
				"body": "> [james007](#comment_203_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): Already tried this. You can pitch it to them for $25 bucks or so, and you might even sell some. Shortly thereafter, they bug you continually for not understanding how to use it, and then the box is shelved for years and forgotten. I don't expect ZeroNet to be something elderly Facebook normies will ever use or understand.\n\nDo not sell them : lend them instead. For a rather symbolic fee. But when they're not interested in the service anymore, you could still recover your hardware. For sure, it's better with local clients, rather than over-the-world delivery =)",
				"added": 1547242301
			},
			{
				"comment_id": 7,
				"body": "> [quantumworld](#comment_135_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): LOL!!! OMG! Its Steve Balmer.. Ok, sorry just had to say that.. lol!!\n\nMaybe I am. On Zeronet, nobody knows you're Steve-Dawg ;)",
				"added": 1547242413
			}
		],
		"1547153094_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd": [
			{
				"comment_id": 3,
				"body": "Well, thanks guys, I finally found a way to avoid that issue altogether.",
				"added": 1547241223
			}
		],
		"1547138341_1A1wfPToMyKh7vu5YTpEtNCbGBmD32DgDH": [
			{
				"comment_id": 4,
				"body": "There's other way to make people seed your content : explain why it's worse clicking on it. Right not, it isn't.",
				"added": 1547241930
			}
		],
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 8,
				"body": "Slightly related question : in data/users.json, is it possible to specify several certs from the same authority?",
				"added": 1547398900
			}
		],
		"1550128123_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd": [
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_671_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): The list of proxies is on ZeroWiki and when you open the proxy URL it shows ZeroHello where is shown if Tor: enabled / Tor: always0net.io is tor enabled which means it should be connectable by onion peers (as a \"hidden service\" with .onion address)\n\nDoes that mean there's a .onion address for 0net.io? Where can I find it?",
				"added": 1550133013
			}
		],
		"1553065069_1EvWEgpVuMdbKTJR5vWZTV9LP1hBjMfyMd": [
			{
				"comment_id": 10,
				"body": "thanks guys, but it doesn't work that way ... for some reason, IFS keeps seeing only Cluster 0 and Cluster 1",
				"added": 1553103708
			}
		],
		"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w": [
			{
				"comment_id": 11,
				"body": "> [0bz](#comment_3_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w): Ok, I finally found time to put up something. Little more than a demo, right now. But it's work-ish. [...]\n\nIt looks nice for a first release, but some things are a little less than convenient. Basically, when you switch to previous/next page, it keeps you at previous height. So you need to scroll back to the top of the page.\n\nBTW, not that I don't like CBZ (it's a simple enough format, I give you that), but have you considered DJVU? there's a JS viewer too :  https://github.com/RussCoder/djvujs",
				"added": 1558384971
			},
			{
				"comment_id": 12,
				"body": "> [klu9](#comment_172_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @squarezero: I have a bit of a soft spot for the DJVU format (I used to use it to convert JPG scans of textbooks into files that were a fraction of the size and used far less RAM when viewing), but I didn't realize comics were being shared in it. A quick search for 'djvu' on IFS and Torrentz2 doesn't turn up any comics results (at least not in a language I read; half the results were in Cyrillic). Can you share any?\n\nI must confess I never really saw any. But it's not too hard to convert, and I did consider switching my own CBZ collection to DJVU, at one point. Haven't started yet.",
				"added": 1558641940
			}
		]
	},
	"comment_vote": {
		"61_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	}
}