{
	"next_comment_id": 8,
	"user_name": "Tusiko",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1544530397": 1544552231,
		"14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1544917329": 1544914492,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1545230330": 1545240210,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1546005904": 1546024575,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1545981842": 1546024858,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1546243218": 1546268348
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@leftside: The bible was written 100 - 200 years after Jesus' death. All stories are from hearsay and there are only tales in a big book.\nIf you look at the date of many christian celebrating days, you will find out that the former pagans had a celebration day at that time. The church put a celebration day exactly on this time to force the people into their faith (and prohibited the celebration of the pagan day).\nFormerly the people celebrated the coming back of the sun at December 25th. The roots are in Egypt. The Christmas tree is a pagan sign as well and was only \"occupied\" from the church.\nThere is no chapter in the bible about Christmas. It is all a lie.\nI do nit believe in any religion or any god.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1543355917",
			"date_added": 1543686824
		},
		{
			"comment_id": 2,
			"body": "@leftside: I have nothing created in my mind. \nWhat you call \"Many parts of the bible\" is the Old Testament. Look at Wikipedia:\n\"The Christian Old Testament overlaps with the Hebrew Bible and the Greek Septuagint; the Hebrew Bible is known in Judaism as the Tanakh. \"\nThe Christians just took over the parts from the Tanakh.\n\"Even the Gospels\", as you wrote, is the whole New Testament. The Gospels are only 1 of 4 genres. The New Testament is written some decades after Jesus's death. True. The whole content is transported from mouth to mouth. If you do this about some generations, how much from the original \"story\" will be in the final and written version? \nI believe in science and what I wrote was not from my mind, it all is well researched and you can proof it. I know that Wikipedia is not the best way to proof something, but in this case it is true. Sometimes hard to believe for believers.\n ",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1543355917",
			"date_added": 1543736686
		},
		{
			"comment_id": 3,
			"body": "THIS is a long trip :-)",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1544530397",
			"date_added": 1544552273
		},
		{
			"comment_id": 4,
			"body": "Great job! 😀",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1546005904",
			"date_added": 1546024613
		},
		{
			"comment_id": 5,
			"body": "Interessant. Ich habe zwischen der ganzen Werbung (trotz uBlock Origin) sogar den Artikel gefunden) :-)\nIch sehe das genau so. Ich würde mich aber eher auf die Bitcoin-technik als auf die Währung beziehen.\nAuch Ethereum oder ein paar andere sind sehr gut. Es wird sich zeigen, wer in ein paar Jahren noch da ist. Es gibt ja im Moment unzählige Kryptowährungen. Zu viele.\nWir brauchen eine weltweite unabhängige Kryptowährung, die nicht zum Spekulationsobjekt degradiert wurde. Eine Währung, die kursstabil bleibt.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1546243830",
			"date_added": 1546268247
		},
		{
			"comment_id": 6,
			"body": "Right. The important word is: **decentralized**\nNetworks as well as currencies.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1546243218",
			"date_added": 1546268405
		},
		{
			"comment_id": 7,
			"body": "@ulrichard: Ich bin gespannt, wo die Reise hingeht. Ein guter Coin ist jedenfalls notwendig. Bargeld wird immer unattraktiver und Kartenzahlung is ja alles andere als \"privat\".",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1546243830",
			"date_added": 1546375158
		}
	]
}