{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1FdTrzSCGAJNtwRagZBrhxx2KwLaxTX66Y": [
			{
				"comment_id": 1,
				"body": "Salut, \nNormalmet 'est un bug qui doit t'aariver uniquement sur les liens donnés sur le chat. Je n'ai pas encore trouvé de moyen de régler ça.",
				"added": 1457958095
			},
			{
				"comment_id": 2,
				"body": "> [starfish](#comment_2_1FdTrzSCGAJNtwRagZBrhxx2KwLaxTX66Y): Merci pour cette réponse rapide zarka :)\n\n@thekill38 a fixé cette erreur dans 0rc donc ça sera bientôt fonctionnel. https://github.com/cgm616/0rc/pull/29",
				"added": 1457978263
			}
		],
		"1_14yeJduXkemL1WVGqk9kJ1Wrn3UgBD175y": [
			{
				"comment_id": 3,
				"body": "Ça serait une bonne idée de se servir de Yacy pour chercher dans Zeronet. Mais on pourrait pas en faire un Zerosite. :(",
				"added": 1458072058
			}
		],
		"2_1MGse2Xfdae1FkAiGoHzWTeFx4Mo2yEqfH": [
			{
				"comment_id": 4,
				"body": "Salut, \n\nJe pose ça là…\n127.0.0.1:43110/1JRzcmmm7X4iLsSLRDK7DT6EP2uPMnuLhP/",
				"added": 1460418407
			}
		],
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": [
			{
				"comment_id": 5,
				"body": "Salut, \n\nJe suis d'accord avec la plupart de ce qui se dit ici, le projet est jeune, il ne peut pas avoir tout bon du premier coup.\nPar contre le truc qu'on peut (enfin ce que *je*) reprocher au dev c'est le manque de documentation à propos du fonctionnment de 0net. C'est un truc qui manque vraiment.",
				"added": 1460418555
			},
			{
				"comment_id": 6,
				"body": "Salut, \nJe réponds à ton commentaire :\n\n\n1)\n> Je vois ça comme une phrase de bootstrap\n\nOui, ça c'est nécessaire, mais c'est pas utilisé que pour le bootstrap.\n\n> Implémenter une DHT au lieu d'un tracker ne semble pas poser de souci technique majeur\n\nPour le cas de Zeronet si un peu. \nIls pourraient se greffer à la Mainline DHT, celle utilisée par Bittorrent, ça serait en effet pas trop compliqué. Mais le problème c'est que ça pèterai le support de Tor. \nTor ne peut transporter que du TCP. Or la DHT s'utilise via UDP. Donc ça force le dev à soit créer un nouvelle DHT, c'est possible mais plus long, soit il faut supprimer le support de Tor – ce qui n'est pas une mauvaise idée – mais comme c'est un des points fort du projet, ça va pas se faire. \n\n\n2)\nJe comprends ton point mais toi tu es un⋅e utilisateur⋅rice averti⋅e. Pour beaucoup des utilisateurs de Zeronet, cette discussion n'a pas de sens et ils pensent que Zeronet est complètement distribué parce que c'est comme ça que c'est vendu. C'est en effet pas grave que ce soit le comportement par défaut, ça permet de rendre le programme accessible au plus grand nombre, mais ça doit être documenté. Les utilisateurs doivent avoir le choix. Là ils sont pas plus au courant que ceux qui installent un programmes en cliquant sur suivant suivant sans voir les petites cases cochées. \n\n\n3)\n> Je vois surtout ZeroMail comme une application de démonstration\n\nC'est le cas. :)\n\n\n4) \n> J'ai du mal à comprendre en quoi ZeroVerse résoud ce souci\n\nIl ne le résout pas. C'est une question de confiance.",
				"added": 1461098746
			},
			{
				"comment_id": 7,
				"body": "",
				"added": 1461099206
			}
		]
	},
	"comment_vote": {}
}