{
	"posts": [
		{
			"id": "03dea8bd-c5f6-4137-a370-34429d6d33d2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>c5738fb5-d468-404d-9bf2-eee717249260\nFor me running on Linux and using Firefox ESR the daemon is using about 70mb, Firefox with a couple 08chan tabs open is using around 700mb.",
			"time": 1565142966072,
			"files": "[]"
		},
		{
			"id": "aefc21f0-42ce-4b13-98f1-f34a1b150601",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5e547fbb-86a2-4e3d-adef-145afa283168",
			"body": "BO controls the code but not the database, so for censorship he only has three options. He could make all posts require approval like >>a7216b6f-08a2-41b4-a91a-de54aa073773 said, or he could modify the code to specifically remove specific posts and certain users, but both of these don't scale well and users can change their IDs on a whim. The last option is to include a word filter, but we've seen how well that works in the past.\n\nThe most important part of this though is that the code is all public, so any attempts to censor are easily verified, and forking the entire site is just a button press away, and incurs no cost to the new admin. This nonexistent bar of entry for creating a new chan makes it so the moment BO tries to censor is the moment his chan becomes a ghost town as everyone moves to the next instance",
			"time": 1565186786304,
			"files": "[]"
		},
		{
			"id": "618e55a9-9246-4f61-94c7-cc57f58b16ab",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e923b3bc-519e-4a67-acdc-3d7ab8f5b22d",
			"body": "Zero sites using javascript may contain malicious code to fingerprint your browser or to leak your ip adress by pinging other websites. The tor browser adds the extra layer of protection in that any non-zeronet connections will also go through tor, and there have been many mitigations put in place to make the browsers fingerprint as generic as possible so it's hard to distinguish one tor browser users from another.",
			"time": 1565187838926,
			"files": "[]"
		},
		{
			"id": "024cc9e1-7843-4bf8-9485-6e82453b6f8a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "970aea10-19b2-473a-9ed1-da6aea653c7b",
			"body": ">>74a1db54-309f-42c4-afde-521b2f3d9b09\nunfortunately that is part of zeronet itself, not millchan's engine or o8chan",
			"time": 1565192610284,
			"files": "[]",
			"last_edited": 1565192635548
		}
	],
	"boards": [],
	"modlogs": []
}