{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"","body":"Homeless on the Cheap\n\nby Hawklover\n\n \n\nRoger is a homeless man that I have known for over 5 years. I met him again recently when I was taking a walk in the woods near his camp. \nHe had most of his gear stolen and was struggling to prepare for winter. This is a list of ideas to equip oneself with very low cost items for a stay in the woods.\n\n \n\nplastic ground cloth \ncardboard sleeping pad\nstring\nplastic sheetdrop cloth\ntarp shelter or tube tent\nblankets\nwatch hat or balaclava for sleeping\nbackpack or bag with carry strap\nBuddy burner stove\nhobo stove\npeach can with coat hanger bail\ncup\nclear lighter\nbook matches\nWater bottles, 2 liter, 1 liter\nplastic silverware\nsharpened butter knife\np-38 can opener\nbutter bowl with lid\n\nCondiments: salt, pepper, red pepper, mustard, mayonnaise, ketchup, \nsugar, creamer, tea, coffee, napkins, hot chocolate, oat meal, ramen soup,\npowdered dry milk, parmesan cheese packets\n\nGloves, socks, hooded sweat shirt, wind shell, 55-gal contractor trash bag\nbandana, towel, hotel soap, tooth brush, tooth paste, floss, comb, sewing kit\nmirror, finger nail clipper, round tip school scissors, razor, menstrual pads,\nbandages, toilet paper, trowel, sponge\n\n \n\nFlashlight \npen \npencil \npaper \ncity-state map \nBible\nAM-FM radio with head phones for weather\nfishing line wrapped on card \nhooks \near plugs for floats \nweights\nthrowing stick\nshepherd's sling\ndigging stick\n\n \n\n(Picture of stone tied in corners of plastic sheet for shelter)\n\n \n\nPass a line around two trees and down the center line of your plastic sheet tarp shelter to make an A-frame. Tie a line around small smooth stone or a wad of grass placed in the corners of the plastic sheet and tie the other end to an anchor point such as a log, rock, tree or sharpened stake driven in the ground with a large rock. Use another piece of plastic for a ground cloth to protect you from damp earth. This can be 2 plastic 55 gallon trash bags or one bag which has been opened along the seams or other found plastic. Mattress and bedding stores have large squares of plastic in their dumpsters. If you are lucky you could find an undamaged plastic twin bed cover which is the perfect size for a one man tube tent. Find a corrugated cardboard box and open it along one seam so that it lies flat about 6 feet long. Place this on top of the ground cloth. This makes an excellent insulated cushion for about 3 days until it is flattened out and will need to be replaced or additional cardboard laid on top. Watch out for and remove large staples as these will hurt if you get snagged by them. By making several cuts half way through the cardboard you can fold it down for easier carrying. Mason string can be had from construction sites or telephone wire from demolitions can be used. Visqueen may be available at some construction sites if you ask nicely. Tube tents can be had from Big Lots for about $3.\n\nHarbor freight sells wool blankets for $10 or $8 if you use the 20% off coupon from the Sunday paper. Walgreen’s had a sale of 4 fleece blankets for $10. Stocking hats, ski masks, balaclavas can be had from Dollar Tree for $1. Also pick up the one size fits all cloth gloves while you are there. They are OK by themselves but are even better if used as a liner under larger work gloves. Also get a box of emergency candles for a dollar.\n\nA buddy burner is a chicken, tuna or cat food can in which a long narrow strip of rolled up cardboard is placed. The cardboard should not extend beyond the top of the can for safety reasons. Melted wax is poured over the cardboard until it completely saturates it. The safest way to melt wax is using a double boiler system. A large can is half filled with water and a smaller can with un-melted wax is placed in the water. The water is heated slowly until the wax is liquid. Once the buddy burner is completed, you can add chunks of solid wax to the top if it starts to run low and burn the cardboard.\n\nIf you can get a single hole paper punch or a nail and hammer, you can use it to create an alcohol stove from a cat food or small tuna can. Once the lid and contents are removed use the paper punch to punch 16 holes evenly spread around the lip of the can. Pour in 1 to 1½ ounces of rubbing alcohol. Light it and let it burn for a minute to pre-heat. Then set your cup or small pot on the can. Flames will come out of the holes. Rubbing alcohol comes in three types: 50%, 70% and 90%. All will work but the 90% will work the best. Denatured alcohol from the paint department or yellow container of Heet from automotive department is even better. Be sure to clear away to bare soil or use the stove on a fire resistant surface.\n\nA hobo stove is a large can #10 with a diameter of 6 3/16” x 7” tall commonly used in the food service and restaurant industry. They can be found in dumpsters. On the end of the can that is unopened, use the triangular shaped church key can opener to open a series of holes in the body of the can on one side so hot air can escape from the fire. On the opposite side from the vent holes at the open end of the can open two holes several inches apart. Then cut the metal straight up from each triangle tip about 2 inches and then make a horizontal cut to join the two vertical cuts. Flatten down the panel formed by the cuts to the inside of the can. This is the fuel entrance. The unopened end of the stove can be cooked on directly for some items or pots or metal cups can be heated on its surface.\n\nUse a 30 oz. or larger peach can to make a water heating pot. Open the top and remove the contents. Remove the label. With a nail, punch a hole from the inside to the outside just below the lip of the can. Turn the can 180 degrees and punch another hole inside to out. Use a section of wire from a coat hanger and insert ½ inch of wire from the outside. Bend this up slightly about 45 degrees. Make a smooth arc with the longer side of the wire and insert the other end from the outside of the can and bend ½ inch up. This will make a bail for your can which will not slip off and will move out of the way when packing it away.\n\nUsing the buddy burner or other fuel in the hobo stove you can now heat water for tea, soup, coffee, oatmeal or ramen soup. A clear lighter lets you see how much fuel you have left in it so you are not caught short. Dollar tree sells them 3, 4 or 5 for a dollar at different times. I have found serviceable lighters in parking lots and smoking areas many times. Any place that sells cigarettes will likely give you a book of matches. Keep matches in a zip lock bag to protect it from water or sweat.\n\nHave your own cup. Metal cups can heat the contents directly over a fire or hobo stove. Any clean cup/mug is a serious advantage. You can go into almost any small store or office or restaurant and say “I am down on my luck. May I please have a cup of coffee?” and you will get it filled for nothing. Likely you can get soda, tea, slushy or other beverages also. The key is to have your own cup because inventory is taken on the cups but not on the product. Offices may also give you left over donuts.\n\nTwo liter and 1 liter bottles can be acquired from any trash can. Wash them out and haul water back to camp in the 2 liters for camp use. Keep a 1 liter on your person for drinking water. If you have a dollar to spend, fast food stores can keep you supplied in plastic knives, forks, spoons, sporks, straws, napkins, salt, pepper, hot sauce, ketchup, mustard, mayonnaise, honey, jelly, margarine, sugar and other items depending on the store. Keep condiments in a zip lock bag. Just don’t be greedy. Hotel clerks and cleaning ladies can be a good source of packets of coffee or tea. They may also set you up with soap, shampoo, tooth paste, sewing kits, wash cloth, towels, pillows, pillow cases, sheets, blankets, Bibles, ice buckets, ice and other goodies if you find a sympathetic person.\n\nDumpsters at universities and schools may have backpacks at the end of the school semesters. Gym bags with a strap are easy to find at thrift stores. These do not stick out as odd as many people carry or wear them. However, a laundry bag or heavy weight pillow case can be made into a back pack. A single snip of the scissors on the entrance edge of the pillow case will allow you to feed a piece of coat hanger wire with the end bent in a sharp V through the cuff. A knot tied in a cord and placed in the V of the coat hanger lets you pull the cord through so you can tie the end of the bag shut. Leave enough line so you can tie a good knot and possibly hang it up above the critter line \"Bear Bag style\" with the remaining cord. Place a small round stone in the two corners of the bag. Take the middle of a longer cord and tie a knot just under the draw string. Feed the free ends of the longer cord through a short piece of lightweight plastic garden hose and do the same with the other side. These will be the shoulder pads so the cord does not dig into you under load. Tie the free ends around the small stone in the corners. Any free cord left over can be tied back on the line above the stone using the taunt line hitch so you can adjust the shoulder straps.\n\nIt is easy to find a butter knife or other knives, silverware and tools if you are constantly checking out the trash cans and dumpsters. A butter knife can be sharpened up quite nicely. It has the added advantage as most people do not consider a butter knife as a sharp knife. A child’s round tipped scissors is small enough to carry and cuts most things you would want to cut with a knife. Police officers will not consider it as a weapon. The sharp pointed ones, they may take away. A file or sharpening stone may have to be purchased but you will want one anyway eventually.\n\nApple cider vinegar makes a cheap insect repellant. Transfer a small amount into hotel shampoo sized bottle. If you think you may use this as food seasoning or mouth wash get a food grade bottle. Camping stores sell these or just use an empty liquid medicine bottle or sample sized mouth wash bottle with the label removed. Apple cider vinegar is antiseptic and antifungal so it is useful for under arm deodorant, minor cuts, rashes, ringworm, and athletes’ foot.\n\nKeep a couple of empty hotel sized shampoo bottles on you and when you find a restroom with a soap dispenser or hand sanitizer fill up the bottles. Hand sanitizer will work well to clean your under arms. Don’t be greedy. Alcohol based sanitizers work great as fire starters.\n\nIf you keep yourself clean shaven and other wise clean and odor free you will not attract unwanted attention. Using a hotel ice bucket, pocket mirror, water bottle, razor and a bar of soap you can shave a short distance away from your camp site. A sponge or bandana works great to wash with. Use the scissors to trim your hair and side burns. Keep it as short as it will look nice. Clean your teeth and floss. Almost any dentist office will give you a free toothbrush, toothpaste; floss and mouth wash if you explain your circumstances and ask for it. Floss has other uses and is harder to come by so get as much of that as you can. They may invite you for a free cleaning or oral exam if they feel like it.\n\nBecause they are in sales, real estate agents and insurance agents give away small items with the company logo on it. Combs, pocket mirrors, nail clippers, fingernail files, calendars, hats, t-shirts, cups, coffee mugs, city maps, pens, pencils, erasers, paper pads and other useful things. Be nice and inquire about low cost housing or motorcycle insurance while you are there. You may find other businesses have give-away items as well. Job fairs and business conventions are gold mines for this kind of loot. Go to as many as you can. Be sure to get a thumb drive to keep your documents on. The military recruiters commonly give these out. Candy bowls are all over the place but don’t destroy your health by eating too much. Bring copies of your resume to hand out. Public libraries, state unemployment offices and sometimes FedEx Office Kinko’s will print you some for free.\n\nAdvertising specialties, especially screen printing companies have boxes of mistakes that did not meet quality control’s standards. Hats, t-shirts, wind breakers, ponchos, notebooks, pens, pencils and other items wind up in their dumpster. If not explain your circumstances, then just ask for them.\n\nP-38 and P-51 can openers are often given out by the Salvation Army, homeless shelters and relief organizations. Acquire one even if you have to buy it. Army surplus stores sell them for 10 cents to $1 each. Wal-Mart sells them too. This will give you a dependable tool to open canned food.\n\nHarbor freight stores run a free flashlight coupon in their weekly advertisement in the Sunday paper. This small flashlight is a bright LED with batteries. If a purchase is required, use the 20% off coupon and buy an aluminum tube whistle to carry for 80 cents.\n\nMany people who work outdoors wear hooded sweatshirts. Heat rises from the torso and moves over the back of the head keeping you significantly warmer than a sweatshirt without the hood. The zipper in the front will help you regulate temperature better than the style without the zipper. A wind shell or wind breaker over the hoody will stop air from penetrating through to the body. The dead air space will keep you warm. Balaclava ski mask covers the head, ears and face and is warmer than any other hat. You can roll it up and put it in a pocket when you don’t need it. Old timers used to sleep with a wool watch cap on their head at night. Insulated coveralls create an additional layer of warmth. They are not cheap but may be worth acquiring if you are cold. 55 gallon contractor trash bags make an emergency poncho during inclement weather. They can be stuffed with leaves and make a mattress or blanket. It can be pulled over the legs and torso as a sleeping bag; however it will accumulate perspiration on the inside and chill you after a while.\n\nDollar Tree has a FM radio with ear phones for $1. Living out of doors you really need to keep abreast of the weather conditions. A radio with AM, FM, weather band, or shortwave would be even better. Read the paper every day at the library if you can. Keep abreast of current news, the economy, the job market and new businesses opening in the community. Political rallies, job fairs, free public events, volunteer opportunities, church announcements, AA meetings, are listed in the local paper. Coupons can be gold for the right stuff.\n\nA simple fishing rig can be made from a rectangle of cardboard with a notch cut into each of the long sides. Punch a hole in one end and tie fishing line through the hole and wrap enough line (10 – 30 feet) around the notch. Push a nail through a foam ear plug or a packing peanut to use as a float. Thread the end of the fishing line through it. Attach a weight. At the end of the line tie on a hook or treble hook. Use natural baits. This will take up very little room and can provide hours of entertainment and lots of food. Small out of the way ponds, creeks and rivers are a safer place to fish if you don’t have a license yet, but do get one as soon as you can. Wal-Mart has free state fishing regulation booklets and you may find you do not need a license at certain locations or on certain days or if you meet age requirements.\n\nA shepherd sling can be made from canvas blue jeans and heavy cord. With practice you can become deadly accurate with a stone projectile. Make sure to consult the hunting regulations for your area. These are considered a toy by police but not by game wardens. A 12 - 18\" wood or metal pipe throwing stick is a primitive but very effective hunting weapon in practiced hands. A digging stick with one end sharpened to a bevel edge like a wedge is used to harvest root crops. Check out the library for books on ethno botany, wild foods, herbal medicines and mushrooms.\n\nSome churches and the Salvation Army will help you acquire a used bicycle. Bicycles can be had for free from Freecycle.org and the free section of Craigslist.com. The cheapest cell phone is T-Mobil pre-paid. You can get a phone for about $10.00 if you watch the sale ads at Target and Walgreens drug stores. Usage costs $0.10 -$0.33 per minute and $0.10 per text each way. Unused time expires in 90 days but rolls over when you add time. This works out to $3.33 per month unless you use the phone a lot. Cheaper phones can be had but the cost of using them is higher in the long run. Now you have a phone number for your resume. Community Voice Mail from cvm.org will give you a free voice mail box if you live in a local area served by them. Google Voice will also give you a free voice mail box. Get a free email account from Google’s G-Mail to use on your resume. Make it a standard john.smith@gmail.com because employers may not have a sense of humor if you use something else.\n\nSome thrift stores and Gideon’s society provide Bibles for free. Most motels and many churches will give you one. AA meetings can help you if you have an addiction. A good church will provide you with a sense of belonging to a group. The church or one of its members may allow you to use their address to receive mail. Some churches have food pantries, clothing closets and other social programs. Volunteer to build houses for habitat for humanity. They will teach you basic carpentry, plumbing, electrical wiring, heat and air conditioning and roofing. Often you will be fed while you are volunteering. A trailer may be provided to sleep in during the construction.\n\nThe Salvation Army will assist you to obtain a copy of your birth certificate and a copy of your social security card. Most states have a low cost state photo ID program at the department of motor vehicles. Employers will need a driver’s license or state ID and a social security card in order to hire you. Start at the state unemployment office and get an interview with a counselor. Sign up for any training programs they offer. They will have a resume writing program and will let you use computers, phones and fax machines to contact employers. Temporary employment agencies like Labor Ready, Manpower, Labor Finders, Express Personnel, Kelly Services can put you in short term work that often leads to full time employment. Manpower and others offer extensive online training programs for office skills, Information Technology and sales, which they offer free to their employees. A state health department issued food handler’s permit can open the door to immediate work in the food service sector. If you can pass the physical, sponsored 3 week CDL truck driver training is free with a guaranteed job at graduation and you can live in the truck once you start work.","language":"text/plain","encrypted":false,"added":1525370965}],"comment":[]}