{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 1,
				"body": "Essa parada da PEC, diferente que os comunas estão propagando em massa, é justamente pra acabar com a trenheira que o governo passado causou. A minha opinião é que por mais que ela não seja a forma mais eficiente e favorável pra todos, pelo menos é algo que tá sendo pensado em longo prazo, que vai pelo menos tentar dar uma estabilidade econômica ao país e evitar ao máximo, prejudicar o cidadão que paga seus impostos.",
				"added": 1478725886
			},
			{
				"comment_id": 2,
				"body": "> [kosherx](#comment_33_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Por que não acabar com os gastos do Judiciário, Legislativo e Executivo? Seria muito melhor ainda.\n\nNo caso vai ter um teto aos Três Poderes e, diferente de como os lavadores de cérebro falaram, o poder Executivo não vai poder interferir nas outras áreas e nem aos órgãos federais. Casa um vai colocar seu limite.",
				"added": 1478725991
			},
			{
				"comment_id": 3,
				"body": "> [ninjapi](#comment_5_1EcTBTYsro4Vr5ea5NahkseWCK883quWM1): Pelo amor de deus... Essa é a coisa mais estúpida que alguém pode fazer.\n> Limitar gastos nas áreas de educação e saúde é um retrocesso. Históricamente investimos bem mais em educação e saúdo do que a inflação todo ano. Parar isso porque? Parar por 10 anos para ver depois o que fazer? Ridículo!\n> Salário mínimo congelado e somente seguindo a inflação? Não vejo como isso pode ajudar alguém. No final como sempre só se fode quem já não tem dinheiro :(\n> Quero só ver o que vem depois com a Reforma Trabalhista e a Reforma da Previdência.\n\nErrado, saúde e educação não terão teto, mas sim piso, que será de no mínimo 18%. O salário mínimo desde sempre foi corrigido, cobrindo a inflação mais um acréscimo. E o que deve ser feito, é acabar com sindicatos e \"direitos obrigatórios\", onde o trabalhador não possa empregar seu dinheiro como ele desejar.",
				"added": 1478726261
			}
		],
		"1_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 4,
				"body": "Nunca ouvi falar. Só do mais puro, hipócrita e falacioso socialismo...",
				"added": 1478726405
			}
		]
	},
	"comment_vote": {}
}