{"cert_user_id": "namazso@github", "next_comment_id": 5, "comment": {"1604067617_mirrored_krixano_github": [{"comment_id": 1, "body": "@krixano have you considered simply not changing license?\r\nfor more info on what this would cause, see [here](https://github.com/HelloZeroNet/ZeroNet/issues/2272#issuecomment-549192208)\r\nthere are various big projects already doing similar, like the [FFMPEG](https://github.com/FFmpeg/FFmpeg/blob/master/LICENSE.md#incompatible-libraries) media processing tool / converter or the [Spigot](https://www.spigotmc.org/threads/buildtools-updates-information.42865/) serverside modding API for Minecraft", "added": 1572887343, "modified": 1572887410, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549525719", "source_type": "github"}, {"comment_id": 2, "body": "@krixano as far as I'm aware, those are only libraries (read: independent works) and not part of the ZeroNet core code. Was any code from them copypasted into ZeroNet code? If not, they still are independent works, which can have their own license. The only problem arising is that obviously at some point you want to link them together, and distribute the result, which would indeed be a violation. To solve this, you can provide tools for users to build ZeroNet themselves on their own machine. I'm wondering if you have simply read my previous post.\r\n\r\nI'm not saying GPLv3 wouldn't be better, but considering the hassle, I'm not sure if it's worth it.", "added": 1572887792, "modified": 1572887792, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549528355", "source_type": "github"}, {"comment_id": 3, "body": "> What does \"work based on the program\" mean.\r\n\r\nI am pretty certain that code that does not include any such licensed code at all cannot be considered to be a work based on the program. \r\n\r\n> ZeroNet can't really function without the libraries it uses, especially msgpack which is one of the violations I believe.\r\n\r\nThe point is, you can distribute independently non-functioning code, then the user can make it functioning on their own machine. You can even provide tools that help this. Look at Spigot for example: obviously a Minecraft server modding API cannot work without the Minecraft server, but their licenses are incompatible. They provide the build tools that you can use to build your own binary (redistribution of which would be illegal though).", "added": 1572888258, "modified": 1572888352, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549531024", "source_type": "github"}, {"comment_id": 4, "body": "I'm indeed not sure how difficult it would be to write an \"installer\" that does all the hassle of pulling the libraries and building ZeroNet automatically would be, or how much time/space/bandwidth such installer would take compared to the current one.\r\n\r\nI guess the voting has already begun anyways, so just hope for the best that about all of the contributors agree on something.", "added": 1572888735, "modified": 1572888924, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2269#issuecomment-549533886", "source_type": "github"}]}}