{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1575331476_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1573772721_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "I was sent here by the Dark Lord... to observe.",
				"added": 1573801612
			}
		],
		"1573239989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 2,
				"body": "Can you link to that first quote at the top of your post?  Is it an actual quote from someone, or just a generalization?  I feel like I might have missed something, somewhere (e.g. another thread).",
				"added": 1573802395
			}
		],
		"1575331476_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Because I'm a Pastafarian.  Praise be to The Flying Spaghetti Monster.  May the sauce be with you.",
				"added": 1575339757
			}
		],
		"1576309972_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 4,
				"body": "So create a new net.  I'm not sure what you want.",
				"added": 1576313054
			}
		],
		"1577487392_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 5,
				"body": "I'd have to agree with styromaniac.  Manjaro GNOME would be the better choice.  I don't know what \"good old games\" you want to play, but you'll definitely have more choice when it comes to games, compatibility layers, and emulators with Manjaro than you would with Elementary, or a better chance of them working at the very least.",
				"added": 1577515308
			}
		],
		"1577105495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "Oh for pity's sake man.  Linux is for anyone with the wherewithal to download it, and a desire to learn to use it - period!",
				"added": 1577517175
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 7,
				"body": "Or you could do the simple rational thing of going over to your neighbors house, and saying \"Howdy neighbor!  I see you got yourself some cool new surveillance equipment.  Has there been some activity in our neighborhood that prompted you to install that new equipment, or that I should be concerned about?  I also see that one of your cameras is overlooking my backyard.  Do you think you could make sure that it only captures your yard, as I too value my privacy and security.  Thanks neighbor!\"\n\nIf asking nicely doesn't work then just call the cops, and tell them your neighbor has a camera pointed at your house, and you believe he's being a Peeping Tom, watching you or your girlfriend / boyfriend nude sunbathing.  Then when they show up, stand at the edge of your backyard line.  Depending on where you live an altercation will most likely break out when your neighbor comes out to confront you, and the police will most likely shoot him, and it will all be caught on tape by his surveillance camera.  Then when you watch the evening news you'll be able to see whether the camera was recording your yard or not.",
				"added": 1578014312
			}
		],
		"1578105095_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 8,
				"body": "> [quantumkitty](#comment_327_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Rather than worrying about money, worry about producing the things that money buys.\n\nBasically this.  You can't eat gold, silver or Bitcoin.  You'd better learn to be completely self sufficient, and / or have useful things to bring to the bartering table.",
				"added": 1578198109
			},
			{
				"comment_id": 9,
				"body": "> [zaron](#comment_57_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): eh, the signs have been there for thousands of years.. still skidding into the endzone\n\nMaybe so, but then again I think we're entering (or have entered) some uncharted territories.  I think with the rise of AI, continuation of these endless wars, and being pushed further away from nature and our fellow humans, etc., hard(er) times are still waiting to greet us.",
				"added": 1578201549
			}
		],
		"1578202687_1JGiVKenWPWgSZpRgNufyk9TAEp67HzaPm": [
			{
				"comment_id": 10,
				"body": "Unless your business is giving virtual massages to super egos, selling delusions to the delusional, or plans for a better mouse trap (i.e. decentralized network) you're wasting your time here.  Try OpenBazaar if you actually have something someone wants.",
				"added": 1578207018
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 11,
				"body": "PLEASE.  LISTEN TO thetruth.\n\nWe own half the world, oh say can you see\nThe name for our profits is democracy\nSo, like it or not, you will have to be free\n'cause we're the cops of the world, boys\nWe're the cops of the world",
				"added": 1578211556
			},
			{
				"comment_id": 13,
				"body": "I guess 2020 is not going to be the year of 'hindsight'.  Sad.\n\n“Those who fail to learn from history are doomed to repeat it.” - Winston Churchill",
				"added": 1578467153
			}
		],
		"1578268512_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 12,
				"body": "> [draugrdeathlord](#comment_213_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Apathy\n\nThis.  Our apathy is their victory.  We've allowed them to create draconian laws that will pretty much ruin your life if you break one of them.  Most of the time you don't even know what those laws are because they make them up as they go.  Jane Fonda gets arrested every Friday for the same thing.  Do you care?  Do you do anything to support her?  NO.  Because we're all too afraid to lose the little bit that we think we have.  Ed Snowden is also just one person who tried to wake us up to what's going on.  Until ever last one of us is willing to put everything on the line nothing will ever change.",
				"added": 1578283540
			}
		],
		"1578603520_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 14,
				"body": "Well for their sake then I hope the power / Internet never goes out. ;)",
				"added": 1578615199
			}
		],
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 15,
				"body": "I use it because I'm interested in the underlying technology.  I also started using it to see its various uses and potential.  The latter part has been mostly underwhelming thus far.",
				"added": 1578627819
			}
		],
		"1578585187_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 16,
				"body": "Hello friend.",
				"added": 1578628137
			},
			{
				"comment_id": 18,
				"body": "Yep!  I won't mute you.  I may not always agree with you 100%, but I still read your posts and witty retorts lol.",
				"added": 1578630956
			}
		],
		"1578530635_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 17,
				"body": "I don't think it's so much about 'what' we see, but rather 'how' we see it.",
				"added": 1578628387
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 20,
				"body": "Ahh, where has the humanity gone?  \n\nUntil the philosophy which holds one race superior, and another inferior is finally, and permanently discredited and abandoned everywhere is war.  ~ Bob Marley\n\nI guess there are no stoics in this thread?  Maybe he needed that bike more than you.  Either way he just proved his integrity was only worth $700.  Maybe next time buy a cheaper bike - less likely to be stolen that way.",
				"added": 1579324171
			},
			{
				"comment_id": 21,
				"body": "> [mj6cp7czwnhyzxkp](#comment_40_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD): yet we keep doing the same things expecting better outcomes\n\nThe definition of insanity is doing the same thing over and over again, but expecting different results. ~ Albert Einstein\n\nWhat are you doing about it?\n\nI'll bust your chains if you break mine!",
				"added": 1579324364
			}
		]
	},
	"comment_vote": {
		"1498_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}