{
	"title": "Blog.ZAlex",
	"description": "[Home](http://127.0.0.1:43110/ZAlex.bit) | [PocketMod](http://127.0.0.1:43110/PocketMod.bit)",
	"links": "* [About me](http://127.0.0.1:43110/zalex.bit)\n* [PocketMod](http://127.0.0.1:43110/pocketmod.bit)",
	"next_post_id": 22,
	"demo": false,
	"modified": 1539955173,
	"post": [
		{
			"post_id": 20,
			"title": "Orange Pi Zero",
			"date_published": 1503746751.059,
			"body": "![==Big photo of small SBC==](./img/orange/kpdv.jpg)\n\nMy impressions and thoughts about the single-board microcomputer [Orange Pi Zero](http://www.orangepi.org/orangepizero/).\n\n* * *\n\n#### Short description:\n\n*   CPU: AllWinner H2 Quad-core Cortex-A7\n*   GPU: Mali400MP2 @600MH\n*   RAM: 256MB/**512MB** DDR3\n*   One USB 2.0 Port, Ethernet RJ45, Onboard WiFi\n\nSmall and compact SBC, apparently designed for a mini-server or for use in IoT purposes. Cheaper Chinese alternative to Raspberry Pi Zero.\n\nPersonally, I bought this basically as a very flexible WiFi router. Perhaps you ask \"wasn't it better to buy an ordinary router\"? The fact is that there is no wired Internet conection in my area. I have to use a mobile 4G connection via a USB modem. So, routers with the support of such modems are expensive for me.\n\n![==Photo==](./img/orange/compar.jpg)\n\n###### Good news: this device is Lego-compatible too :D\n\n#### Software\n\n![==Screenshot==](./img/orange/installer.png)\n\nFor unknown reasons, I was unable to launch the official image of `Debian Server`, it simply did not work. So, I decided to try the DietPi distribution. The compressed image takes only 70 MB (really dietary), and the unpacked image is ~ 450 MB. This distribution is quite minimalistic, it includes only the basic software. For me it's good - I will install only what I need. Also I liked very convenient and functional utilities for customization (very similar to `raspi-config`, but more possibilities). Of course, this can be done manually, but selecting the whole web server-stack at once will be faster than typing `apt-get ...`\n\n#### ~~Hot as a nuclear reactor~~\n\nI do not recommend even turning on this thing without any cooling it. If you installed only a radiator, then you shouldn't set high frequencies. Install a cooler together with a radiator is a **very** good idea, because Orange Pi Zero heats up quickly and strongly. You can see the current temperature using the `cpu` command. Here's how it looks to me:\n\n```\nArchitecture  |     armv7l\nTemp          |     32'c | Cool runnings.\nGovernor      |     interactive\n\n              | Current Freq    Min Freq   Max Freq\nCPU0          |      240 MHz      240 MHz    1200 MHz\n```\n\nBy the way, it supports dynamic overclocking: the processor will operate at a low frequency, but switch to a higher one if it is under load.\n\n![==Screenshot==](./img/orange/overclock.png)\n\n#### Home wireless local network\n\nThanks to the built-in WiFi module and antenna, I was able to easily launch a wireless access point using `hostapd`. The work of the AP makes me happy: the ping from PC to SBC is about 1.5 ~ 4 ms, very rarely it \"lags\" up to 10 ~ 20 ms, WiFi is working without interruptions, it perfectly serves 2-3 devices at once (I don't have more). But I don't know how to check the network bandwidth, because the speed of Internet connection is very low, and when reading from a memory card the speed is limited by it. _Maybe you can suggest something in the comments?_ The maximum connection speed that I noticed is 5 Mbps, but maybe this is not the limit, who knows...\n\nBy the way, it works as a server too, GRAV CMS works fine on nginx.\n\n#### Conclusion\n\nYou should buy Orange Pi Zero only if you realize what you are buying, and if you are not afraid of the terminal. For beginners, I would recommend buying a more expensive, but \"easy\" SBC - Raspberry Pi. There are no such problems with overheating, a larger community, lots of lessons, more ports and outputs. I own RPi too, so believe me, there are less problems for beginners.\n\nBut if you want to save money, if you don't need video outputs, but a mini-server or a router, then Orange Pi Zero is quite suitable for you.\n\n![==Photo==](./img/orange/inarow.jpg)\n\n#### Some random thoughts\n\n*   `Webmin` - a very cool thing, you can change some settings without going into the terminal (for example, from the tablet)\n\n![==Screenshot==](./img/orange/webmin.png)\n\n*   `aria2` - the download manager, which really surprised me. It is able to \"squeeze\" the maximum speed from my slow Internet connection using multithreading (I checked, it's exactly in multithreading), it supports Metalink, simultaneous loading from different mirrors, Torrent, and there's an excellent web interface (you can start download directly from the tablet)\n\n![==Screenshot==](./img/orange/aria2.png)\n\n*   [`ConnectBot`](https://f-droid.org/packages/org.connectbot/) - awesome free/libre SSH client for Android"
		},
		{
			"post_id": 18,
			"title": "My evenings with Arduino",
			"date_published": 1501681153.739,
			"body": "I was trying to find an alternative development environment for Arduino, but now I'm using this ~~ugly~~ combination.\n\n## ![screenshot-here](img/raspiduino.png)\n\n---\n\nI'm coding for Arduino on Raspberry Pi. The reason is that the main computer is not in my room (this means that I need to transfer a lot of details and tools) and it is used not only by me. And because of the limited finances, sometimes I use RPi as a cheap alternative to the desktop (of course, only for _\"light\"_ tasks). But there are a couple of problems - I do not have my HDMI monitor, and I have to use an old TV with an analog cable, so the resolution is _terribly_ low.\n\nBecause of this, the Arduino IDE looks too cumbersome and uncomfortable. And the space for the code is very small because of the panels at the top and the console at the bottom. I wanted to compile sketches from the console, but unfortunately, it goes for a very long time (most likely if you use the GUI, the libraries are loaded into RAM, and from the console it loads them again each time).\n\nThe final combination: [i3](https://i3wm.org/) + mcedit + xfce-terminal + \"minimized\" arduino ide. It may sound strange, but it's convenient for me. On the left I have enough space for the code, at the top right I see the progress of the load (I use the keyboard shortcuts for compiling and calling the menu), at the bottom I see error messages or serial monitor.\n\nAnd all this is perfectly controlled from the keyboard."
		},
		{
			"post_id": 17,
			"title": "PocketMod 0.3 Beta",
			"date_published": 1488015600,
			"body": "Incredibly, after more than a year of development, I'm releasing the first beta version of PocketMod Reloaded. The process is delayed mainly because of college and household responsibilities.\n\n![](img/zhdun.png)\n\n* * *\n\n###### Free, recyclable and customizable orginizer.\n\n###### Made from one sheet of paper.\n\n**Smartphone** is a great thing, but it lacks the convenience of typing and battery life.\n**Notepad** is great thing too, but it's very inconvenient to insert custom pages, although it would be useful to have a calendar or reference of resistors marking.\n\n![](img/pmfront.png)\n\n**PocketMod** is a case when the paper meets applications. It looks like a small pocket book with eight pages. With my app you can \"install applications\" to paper: you can print out Sudoku, shopping list, cheat sheet and anything you want. You can also enhance your notebook. Fasten with a clip a PocketMod to one of the pages in your notepad and get a lot of space for notes and any reference information in your pocket.\n\n![](img/notypad.jpg)\n\n###### Beta-test!\n\n**1\\. Download**\n[Linux\\Source Code](http://zausoft.ru/PocketMod-0.3b.tar.gz)\n[Windows\\Installer](http://zausoft.ru/PocketMod-0.3b-setup.exe)\n\n**2\\. Install**\nLinux: install dependencies `sudo pip3 install PyQt5 markdown pillow` (some packages are available in repositories, eg. `python3-qt5`), unpack archive, `python3 start.py`\nWindows: just run installer\n\n**3\\. Report**\nWrite E-Mail to [zalex@zausoft.ru](mailto:zalex@zausoft.ru) with subject `PocketMod Beta-Test` and tell _everything_: what is working, what isn't working, are there any freezes\\lags, what you don't like, which plugins would you like to add, any suggestions, etc.\nGitHub, PyPI, setup.py, new website - later.\n\n![](img/shot.png)\n\nAlso, check out new animation of folding guide:\n![gif-here](img/fold.gif)"
		},
		{
			"post_id": 16,
			"title": "Installing Linux distro to Lenovo ThinkPad",
			"date_published": 1480682250.101,
			"body": "My friend decided to try linux on his old laptop **Lenovo ThinkPad**. He asked me to help with the installation. I thought it will be the usual installation of the operating system, but I was wrong...\n\n---\n\nAt the first I booted from my USB Stick to prepare HDD for installastion. With gparted I formatted hard disk and made partitions (root, home, swap). The laptop was rebooted, openSUSE Linux was installed, but the first boot didn't happened - `OPERATING SYSTEM NOT FOUND`. Well, I checked the BIOS settings (it turned out that it's UEFI) tried to set \"CMS\" and \"Legacy\" modes of loading, but it didn't helped. I thought it was a curse. Laptop can only boot Windows and Linux distributions from a flash drive, other distributives was not detected by the laptop too. People on the forums tell that it is 32-bit UEFI and Linux can't work with it.\n\nI was desperate and tried to install Knoppix - because it runs from the USB stick, maybe it will work?.. **SUDDENLY**, it works! It's really awesome, it runs everywhere. But why Knoppix is the only distro that work?\n\nI opened GParted and found the answer. Knoppix has created FAT32 partition. The laptop only recognises GRUB if it is on **FAT32** partition (maybe NTFS too). So I have successfully installed openSUSE .\n\nUsing GParted I removed all partitions on hard disk, then maked the **first** partition (~50MB) for the GRUB with **BOOT and LBA flags**. Next partitions as usual - for the root and home mount points. During installation, I opened the GRUB-tweaking menu and pointed the bootloader installation to the first FAT32 partition.\n\nThat's all, enjoy your favorite Linux Ditribution!"
		},
		{
			"post_id": 14,
			"title": "We don't need the paid Photoshop!",
			"date_published": 1471525222.492,
			"body": "We have a free and cross-platform Gimp!\n![image-here](img/sky.jpg)"
		},
		{
			"post_id": 12,
			"title": "How to make ZeroNet links short?",
			"date_published": 1471164382.716,
			"body": "Browsing ZeroNet sites by URL's like `http://zalex.bit` without `127.0.0.1:43110/` :\n\n1.  Open notepad, paste this:\n\n    ```\n    function FindProxyForURL(url, host) {\n     if (shExpMatch(host, \"*.bit\"))\n      return \"PROXY localhost:43110\";\n     if (shExpMatch(url, \"*//zero/*\"))\n      return \"PROXY localhost:43110\";\n\n     return \"DIRECT\";\n    }\n    ```\n\n    And save as `zeronet.pac`\n\n2.  Go to system\\browser settings, and set this proxy file\n\n3.  That's all! Now you can go to adresses like `http://me.zeronetwork.bit/` or `http://zero/1JChcgVVMqBy5fmN4er6afLhcoD7YzRDP6/`\n\n**Note:**\n\nYou should paste this if you're want to browse regular `.bit` sites:\n\n```\nfunction FindProxyForURL(url, host) {\n    if (shExpMatch(url, \"*//zero/*\"))\n     return \"PROXY localhost:43110\";\n\n    return \"DIRECT\";\n}\n```"
		},
		{
			"post_id": 9,
			"title": "Solar battery",
			"date_published": 1460801188.7,
			"body": "![image-here](img/solar/1.jpg)\n_Yes, it looks terrible._\n\n---\n![image-here](img/solar/2.jpg)\nThe battery can be charged from the sun or from the wall outlet.\n\n![image-here](img/solar/3.jpg)\nIf you are interested, I can post the assembly instructions, it is not difficult.\n\n![image-here](img/solar/4.jpg)\n"
		},
		{
			"post_id": 7,
			"title": "Joystick!",
			"date_published": 1459417680.923,
			"body": "It works!\n\n![>image here<](img/retropad/thumb.JPG)\n\n* * *\n\nMajor work on the joysticks has been completed. They were developed for microcomputer Raspberry Pi, and they are incompatible with PC. Obviously, they were created for retro games (Sega & NES), in particular for cooperative games.\n\n![>image here<](img/retropad/rpi.png)\n_By the way, these homemade \"inventions\" are in harmony with LEGO-case for RPi._\n\nTo make the gamepads thinner, I decided to move all of the resistors ~~and a big pile of wires~~ on a separate circuit that connects the joystick to RPi.\n\n![>image here<](img/retropad/base.JPG)\n![>image here<](img/retropad/para.JPG)\n\n###### A small manual (DIY):\n\nAs an emulator of retro consoles I recommend **RetroArch**. On the Internet there are many lessons on how to configure it on the Raspberry Pi.\n\nTo simulate keystrokes I'm using **pikeyd**. This is a program that allows you to assign a pin to a key on the keyboard.\n\nTo install run the following commands:\n\n```\n$ sudo git clone https://github.com/mmoller2k/pikeyd.git\n$ cd pikeyd\n$ sudo make \n$ sudo modprobe uinput \n$ sudo cp pikeyd /usr/local/bin/pikeyd\n```\n\nPlace the configuration file in the path `/etc/pikeyd.conf`. I use this configuration:\n\n```\n# format:\n# [keycode from /usr/include/linux/input.h] [whitespace] [GPIO pin no]\n\nKEY_W        14\nKEY_S        9\nKEY_A        30\nKEY_D        11\nKEY_Z        25\nKEY_X        31\nKEY_C        7\nKEY_Q        8\n\nKEY_Y        4\nKEY_J        17\nKEY_H        27\nKEY_G        18\nKEY_B        23\nKEY_N        24\nKEY_M        22\nKEY_T        10\n```\n\nWiring diagram of the buttons:\n\n![>image here<](img/retropad/crc.png)\n\nNow we want to launch the uinput module every time we boot up automatically:\n\n```\n$ sudo nano /etc/modules\n```\n\nScroll to the bottom of the file and add:\n\n```\nuinput\n```\n\n###### Happy gaming and good luck!\n\n![>image here<](img/retropad/hnds.JPG)"
		},
		{
			"post_id": 6,
			"title": "Блокнот Шизофреника",
			"date_published": 1456051007.2,
			"body": "Русскоязычным посетителям предлагаю глянуть [Блокнот Шизофреника](http://127.0.0.1:43110/Shiza.ZAlex.bit)."
		},
		{
			"post_id": 3,
			"title": "New photos",
			"date_published": 1455188378.476,
			"body": "Added 3 new photos to [gallery](http://127.0.0.1:43110/ZAlex.bit/photos/index.html)."
		},
		{
			"post_id": 2,
			"title": "Update!",
			"date_published": 1455103614.891,
			"body": "The website \"ZAlex on ZeroNet\" was reorganized and updated.\n\nAlso, now there is this blog. Here will be posted news about the updates on my sites and about my works and projects."
		}
	]
}