{
	"message": [
		{
			"body": "juste un petit message à tous les frenchies, juifs ou non, la-bas, vos discours et autres belles phrazes et pensées celestes, vous se smasher contre le mur... pour etre simple quand new york rencontre moskow... disons que les petits merdeux du verbe on meilleurs temps de prendre le train en marche, car croire que vous, dans votre mediocrité, intellectuelle, spirtuelle, culturelle, fiancière ou militaire (covert and over) avez une chance, c'est vraiment... vous allez comprendre ou mourrir :) et on rigole pas, en fait au contraire, de votre mort :) heheheh. c'est la vie :)",
			"date_added": 1615528326200
		},
		{
			"body": "a+ gays",
			"date_added": 1615528364800
		},
		{
			"body": "et si tu crois que t'as taffé pour redshield que t'es un ubermensch... c'est que t as encore rien vu... :) ahahha. vous verrez. avertissemtn fait, dans votre langue + ou - enjoy ! ",
			"date_added": 1615528458500
		},
		{
			"body": "mais en tant que juif francais t'as comme une question a te poser avant de professer : pourquoi t as pas servi l'IDF? tu vois le mec qui vend des tanks system la, lui, il a servit, et ses enfants aussi. pas toi. nice guy btw :).",
			"date_added": 1615528847000
		},
		{
			"body": "alors alors la vaxx forcé c'est pour quand? moi je vois bien le petit coup en jeu... genre, les flics c'est les good guys, on augmente les peines et on tranfert le tout sur les resistants aux vaxx nazis.... tellement basic, un peu grossier a mon avis :D.",
			"date_added": 1615529742200
		},
		{
			"body": "mais bon, un etat occupé qui a trahit pour sa place a l'ONU... hehehehehe....",
			"date_added": 1615529782700
		},
		{
			"body": "avec une perspective extérieure ca en est risible !",
			"date_added": 1615529802800
		},
		{
			"body": "lol ils ont bien eut tord de ne leur peter que la geule... trouver leurs addresses a ces sales fils de putes dit \"educateur sociaux\" aka state operateurs et aller la regler les comptes de facon clair net et precise.",
			"date_added": 1615533099300
		},
		{
			"body": "cf loire :)",
			"date_added": 1615533109800
		},
		{
			"body": "moi je pense que encore plus de violence qui marche, jusque a ce que les state operateurs se rendent... arretez le bullshit... ca marche plus... avec les chretiens vous pouviez les frapper, les violer, les volers, faire ce que vous vouliez... trop tard !",
			"date_added": 1615533178000
		},
		{
			"body": "petite precison quand rasheed il vend du shit de merde a des petits blancs ignorant et non connaisseurs, et qu'il y a un salafiste qui passe, le salafiste dit bonjour et continue son chemin gentillement, comme tout bon citoyen qui s'occupent de ses affaires et pas de celle des autres :D",
			"date_added": 1615533316100
		},
		{
			"body": "celine pina... ca c'est le genre de pute qui m'enerve... pourquoi? deja avec son EU EU EU... okay on connait... tu veux ton EU car tu sais que la franc c'est fumé et sans ECB sa serai ttellement exploser lolll LOOOSERS... mais ce qui me fait rire avec elle, c'est comment elle fait la manche... tu sens qu' elle veut du cash... elle elle en bouffe ! c'est marrant les mendiants !",
			"date_added": 1615535220300
		},
		{
			"body": "et tu vois la petite pute tu peux pas me censorer ahhaha ! c'est que des mots, des putins de pixels, sans importance sauf pour toi et ton petit mensonge de merde... ta petite histoire, ta repulique de merde, conquise par l' EU suceuce de l'ONU pour cacher la faillite morale, economique, social, demographique culturelle d' un pays et de ses dirigents minable vorient !",
			"date_added": 1615535299700
		},
		{
			"body": "oué oué t as geule. bouffon",
			"date_added": 1615535332000
		},
		{
			"body": "alors cnews",
			"date_added": 1615536039700
		},
		{
			"body": "il fait quoi le pro?",
			"date_added": 1615536048100
		},
		{
			"body": "que de la merde au ciné...",
			"date_added": 1615536053700
		},
		{
			"body": "moi je veux voir du bollywood or chinawood ! la y a des bons films avec des valeurs ! j'adore !",
			"date_added": 1615536075300
		},
		{
			"body": "merde y a joffrin :)",
			"date_added": 1615536090100
		},
		{
			"body": "lui il est vraiment con !",
			"date_added": 1615536095300
		},
		{
			"body": "ahhahaha",
			"date_added": 1615536102500
		},
		{
			"body": "ruffiol quel couillon, pas de weed hein? illegal? je veux controler ton corps, petite pute comme joffrin",
			"date_added": 1615536126600
		},
		{
			"body": "en gros c'est des connards qui censurent !",
			"date_added": 1615536138200
		},
		{
			"body": "jackchirkization lol",
			"date_added": 1615536149400
		},
		{
			"body": "elle est pas maligne elle..",
			"date_added": 1615536191400
		},
		{
			"body": "mais elle a raison ! fuck l onu et son programe de resettlement !",
			"date_added": 1615536210700
		},
		{
			"body": "mais explique nous les plantes de la création... weed, coke, hero... arrete le bs ! legal ! plus de connerie, focus sur les viols, traitres d' etre humains . secure la border etc...",
			"date_added": 1615536295000
		},
		{
			"body": "mais realize que la france c'est fauché, fini, detruis... LoL ",
			"date_added": 1615536309100
		},
		{
			"body": "y a un journal online pas censuré en france? tor ipmasking whionix vpn etc... ",
			"date_added": 1615536351100
		},
		{
			"body": "mais quoi joffrin tu crois qu'on va tous renoncer a notre identité? on peut pas !!! c'est pas ma faute !!!",
			"date_added": 1615536386300
		},
		{
			"body": "mais y a plus droite gauche c'est internationalist / UNO global agenda vs NATIONALIST PATRIOTRS borders etc...",
			"date_added": 1615536434600
		},
		{
			"body": "lol la reanimation... pourquoi y en plus? car ils les maintiennet mieux en vie !!",
			"date_added": 1615536476200
		},
		{
			"body": "basic",
			"date_added": 1615536479200
		},
		{
			"body": "avant ils leur explosaient les poumons, mainteant ils gardent plus longtemps",
			"date_added": 1615536495700
		},
		{
			"body": "voila",
			"date_added": 1615536497900
		},
		{
			"body": "voila hypothese 2...",
			"date_added": 1615536536300
		},
		{
			"body": "nous y voila... combien de cycle sur un pcr test? 45? tjrs",
			"date_added": 1615536555100
		},
		{
			"body": "gagner plus de thune connasse !",
			"date_added": 1615536566900
		},
		{
			"body": "masi ces connasses... elles comprennent rien :D.",
			"date_added": 1615536580500
		},
		{
			"body": "lol sature a dessin... non pas sature... juste a la limite",
			"date_added": 1615536598500
		},
		{
			"body": "ca se faisait a fond aux usas !",
			"date_added": 1615536605300
		},
		{
			"body": "complotiste... t as geule connard !",
			"date_added": 1615536624100
		},
		{
			"body": "c est la base !",
			"date_added": 1615536628800
		},
		{
			"body": "non il peut pas dire...",
			"date_added": 1615536632800
		},
		{
			"body": "c'est normal confiance",
			"date_added": 1615536638300
		},
		{
			"body": "t as gueule joffrin tu sais rien t es qu une merde meme pas rentable degage",
			"date_added": 1615536660400
		},
		{
			"body": "qui est monsieur rousseau? l'ars... le scam 101",
			"date_added": 1615536692700
		},
		{
			"body": "non il est pas naif ! il veux qu on parle pas de conspiration, car il est au centre de plusieurs : remplacement de la population, dependence a l etat, l'homme european et encore apres (lui il est trop con en dessous) : l homme mondiale ! lol",
			"date_added": 1615536751700
		},
		{
			"body": "bon point pour la meuf ! prend de la vit c achete toi un oxymetre !",
			"date_added": 1615536784400
		},
		{
			"body": "band de trisot !",
			"date_added": 1615536789300
		},
		{
			"body": "il est bon peyromaure !",
			"date_added": 1615536827700
		},
		{
			"body": "mais t as rien compris joffrin : il veulent nous vaxxer. rien a dire d autre",
			"date_added": 1615536858100
		},
		{
			"body": "mais tu le sais... gouv mondial de la santé etc... ton etat socialiste mondiale mais va te faire foutre",
			"date_added": 1615536881800
		},
		{
			"body": "mais non connard t en sais rien de l interet d un gouv de traitre, qui met en taule de mome pour de la weed, taxes comme un mac verreux et surtout censure etc... onu onu onu...",
			"date_added": 1615536914100
		},
		{
			"body": "t as gueule roufiole... on peut remettre que les dogmes que tu veux en question... pas ceux qu'on veut...",
			"date_added": 1615536943500
		},
		{
			"body": "c est tellement de la caque",
			"date_added": 1615536951500
		},
		{
			"body": "mais essayes de faire une pharse courte connard...",
			"date_added": 1615536967200
		},
		{
			"body": "joffrin c'est tellement un con !",
			"date_added": 1615536974600
		},
		{
			"body": "mais bouffon t as pas besoin de tout les gens pour une conspiration... juste des \"nodes\" sur un network... c'est tu comprends pas les resos !",
			"date_added": 1615537008600
		},
		{
			"body": "c'est pas faceproot...",
			"date_added": 1615537014300
		},
		{
			"body": "lol ce bouffon de pro qui fold..",
			"date_added": 1615537024500
		},
		{
			"body": "lol",
			"date_added": 1615537025800
		},
		{
			"body": "mais une accusation grave, mais va te faire foutre, accuse ce que tu veux !",
			"date_added": 1615537046100
		}
	]
}