{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1
	},
	"next_comment_id": 19,
	"comment": {
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 1,
				"body": "#Cryptext\nCriptografar e descriptografar texto on-line em seu navegador, tudo é feito localmente em seu computador.\n- https://gateway.pinata.cloud/ipfs/QmcYkBPwyy4PgtriES4EPCHzAycfKiW3q5P3P7htkChw7a\n- https://notabug.org/PErYPsEN/Cryptext.git",
				"added": 1577370619
			},
			{
				"comment_id": 2,
				"body": "> [narsus](#comment_6_15vFuhNGd4CqJZ3opcvjV2WP1x3SxgkKrU): Criptografia que não pode ser hackeada\n> Os pesquisadores acabam de lançar um código criptográfico à prova de hackers - programas com o mesmo nível de invencibilidade que uma prova matemática.\n> \n> https://www.quantamagazine.org/how-the-evercrypt-library-creates-hacker-proof-cryptography-20190402/\n> \n> https://github.com/project-everest/hacl-star/blob/fstar-master/README.EverCrypt.md\n\n#Código criptográfico verificado de alto desempenho\n\n- https://ipfs.infura.io/ipfs/QmQX2iuEdAVVibGcmWhaMrTFb7ApHniApZQYu26dPsqYDx",
				"added": 1577377451
			},
			{
				"comment_id": 3,
				"body": "#Algoritmo DE criptografia rápida, paralela e segura usando o [atrator de LORENZ](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Lorenz_system.html)\n- https://ipfs.infura.io/ipfs/QmUMPrjwHWyFTgKNBpp1nZyjTe2ezBvzVD2HLDeLVYZ89e\n- https://ipfs.infura.io/ipfs/QmcaKS8WhdQvwe87XW8ZnpwjVbwg98Y4MXAUzgof5DN4kV",
				"added": 1577377737
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 4,
				"body": "#1984 - George Orwell\nPublicada originalmente em 1949, a distopia futurista 1984 é um dos romances mais influentes do século XX, um inquestionável clássico moderno. Lançada poucos meses antes da morte do autor, é uma obra magistral que ainda se impõe como uma poderosa reflexão ficcional sobre a essência nefasta de qualquer forma de poder totalitário.\n- https://ipfs.infura.io/ipfs/QmbvmWKKz3exqLv4ae7e55Tk32eDEMaHUpJhDYLc9iukxX",
				"added": 1577400349
			},
			{
				"comment_id": 5,
				"body": "#A REVOLUÇÃO DOS BICHOS - GEORGE ORWELL\nVerdadeiro clássico moderno, concebido por um dos mais influentes escritores do século XX, A revolução dos bichos é uma fábula sobre o poder. Narra a insurreição dos animais de uma granja contra seus donos. Progressivamente, porém, a revolução degenera numa tirania ainda mais opressiva que a dos humanos.\n- https://ipfs.infura.io/ipfs/QmcpGNYJ61Z6kioaTokXKTX2qr6dNAM22EQz9FWoCxJQRZ",
				"added": 1577400578
			},
			{
				"comment_id": 6,
				"body": "#Admirável Mundo Novo\nAdmirável Mundo Novo é um romance distópico escrito por Aldous Huxley e publicado em 1932 que narra um hipotético futuro onde as pessoas são pré-condicionadas biologicamente e condicionadas psicologicamente a viverem em harmonia com as leis e regras sociais, dentro de uma sociedade organizada por castas.\n- https://ipfs.infura.io/ipfs/QmdHjyTf1ejfrWmrbx1hKhFo1ZSJe7fMZvMboMCMZ8ctWW",
				"added": 1577400933
			},
			{
				"comment_id": 7,
				"body": "#A Ilha – Aldous Huxley\nNeste seu último romance, datado do início dos anos 60, Aldous Huxley volta a falar de uma sociedade idealizada, como fizera em ‘Admirável Mundo Novo’, escrito três décadas antes. Em vez de situar seus personagens em um futuro sombrio, dominado pelo consumo e por sofisticados mecanismos de controle social, o autor elegeu uma fictícia ilha como palco de uma civilização que persegue serenamente a felicidade. Lá a autopia da existência plena é possível, e esse é o grande tema da discussão proposta nesta obra de Huxley.\n- https://ipfs.infura.io/ipfs/QmfHZdyeEZ62kCR2cjwRzAgnDPFzAnE7DJohYV2Zh7xHea",
				"added": 1577401145
			},
			{
				"comment_id": 8,
				"body": "#Utopia – Thomas More\nUtopia - Obra de Thomas More propõe sociedade alternativa e perfeita\n- https://ipfs.infura.io/ipfs/QmQ7mb7PMVpSedcvotSaZc2MZ7EZ4pJ1Xz6CREwu9Takbg",
				"added": 1577401468
			},
			{
				"comment_id": 9,
				"body": "#Fahrenheit 451 – Ray Bradbury\nA obra de Bradbury descreve um governo totalitário, num futuro incerto mas próximo, que proíbe qualquer livro ou tipo de leitura, prevendo que o povo possa ficar instruído e se rebelar contra o status quo. Tudo é controlado e as pessoas só têm conhecimento dos fatos por aparelhos de TVs instaladas em suas casas ou em praças ao ar livre. O livro conta a história de Guy Montag, que no início tem prazer com sua profissão de bombeiro, cuja função nessa sociedade imune a incêndios é queimar livros e tudo que diga respeito à leitura. Quando Montag conhece Clarisse McClellan, uma menina de dezesseis anos que reflete sobre o mundo à sua volta e que o instiga a fazer o mesmo, ele percebe o quanto tem sido infeliz no seu relacionamento com a esposa, Mildred. Ele passa a se sentir incomodado com sua profissão e descontente com a autoridade e com os cidadãos. A partir daí, o protagonista tenta mudar a sociedade e encontrar sua felicidade.\n\n- https://ipfs.infura.io/ipfs/QmbSaiRMQLWtPDNpCWXr5gMwWGZyx6MJAnuCyEDP4PWnix",
				"added": 1577401787
			},
			{
				"comment_id": 10,
				"body": "#A Máquina do Tempo – H.G. Wells\n\nEste é considerado o primeiro romance que aborda viagens no tempo através de uma máquina criada unicamente com este propósito. Esta história foi mentalizada por um dos maiores escritores de ficção-científica de todos os tempos, H. G. Wells!\n\nNa obra de Wells, um homem desenvolveu uma máquina capaz de viajar para o futuro, chegando até o inimaginável ano de 802.601. Nesta época, o \"Viajante do Tempo\" se depara com civilizações remanescentes dos seres humanos, e que vivem uma realidade nenhum pouco otimista.\n\n- https://ipfs.infura.io/ipfs/QmQ7ZWT2GCNpeKznPE5GbEnX4ESkAAeyPUvhYQca9Xbo4A",
				"added": 1577401941
			},
			{
				"comment_id": 11,
				"body": "#Laranja Mecânica – Anthony Burgess\nNarrada pelo protagonista, o adolescente Alex, esta brilhante e perturbadora história cria uma sociedade futurista em que a violência atinge proporções gigantescas e provoca uma reposta igualmente agressiva de um governo totalitário. A estranha linguagem utilizada por Alex – soberbamente engendrada pelo autor – empresta uma dimensão quase lírica ao texto. Ao lado de “1984”, de George Orwell, e “Admirável Mundo Novo”, de Aldous Huxley, “Laranja Mecânica” é um dos ícones literários da alienação pós-industrial que caracterizou o século XX. Adaptado com maestria para o cinema em 1972 por Stanley Kubrick, é uma obra marcante: depois da sua leitura, você jamais será o mesmo.\n\n- https://ipfs.infura.io/ipfs/Qmb5m4fDFZc8SckzrvAuqk4WYrKfXnxHQ32tGb5RgruWmt",
				"added": 1577402043
			},
			{
				"comment_id": 12,
				"body": "#O Processo – Franz Kafka\nO Processo conta a história de um homem que se vê envolvido num absurdo processo judicial sem que lhe seja dado qualquer tipo de explicação. Um magistral romance sobre a angústia, a impotência e a frustração do indivíduo numa sociedade opressora e burocratizada, temas recorrentes em toda a obra do autor.\n\n- https://ipfs.infura.io/ipfs/QmZq1zfn8B8HUCiBKywn2eUWG8YZWXoNJhRkHit75wmokD",
				"added": 1577402304
			},
			{
				"comment_id": 13,
				"body": "#Eu, Robô – Isaac Asimov\nAutoria do russo Isaac Asimov, esta obra é uma coletânea composta por nove contos que têm em comum a evolução da robótica numa sociedade futurista.\n\nAs Três Leis da Robôtica, conceito muito interessante criado por Asimov, é a base das histórias narradas neste livro e que também passaram a ser adotadas por outros autores.\n\n- https://ipfs.infura.io/ipfs/QmNfBAUL7jMdgYtXS4YaGopn2baUysqvRAhNe3t7ZbhRy1",
				"added": 1577402414
			},
			{
				"comment_id": 14,
				"body": "#O Senhor das Moscas – William Golding\n\nPublicado originalmente em 1954, Senhor das Moscas é um dos romances essenciais da literatura mundial. Adaptado duas vezes para o cinema e traduzido para 35 idiomas, o clássico de William Golding já foi visto como uma alegoria, uma parábola, um tratado político e mesmo uma visão do apocalipse.\nDurante a Segunda Guerra Mundial, um avião cai numa ilha deserta, e seus únicos sobreviventes são um grupo de meninos. Liderados por Ralph, eles procuram se organizar enquanto esperam um possível resgate. Mas aos poucos esses garotos aparentemente inocentes transformam a ilha numa visceral disputa pelo poder, e sua selvageria rasga a fina superfície da civilidade.\nAo narrar a história de meninos perdidos numa ilha, aos poucos se deixando levar pela barbárie, Golding constrói uma reflexão sobre a natureza do mal e a tênue linha entre o poder e a violência desmedida.\n\n- https://ipfs.infura.io/ipfs/QmPWd7gPdTdvZAzeuifkXcCT3ciqQ3xs2DmE5o4kfyVney",
				"added": 1577402638
			},
			{
				"comment_id": 15,
				"body": "#Neuromancer – William Gibson\n\nNeuromancer é considerado o precursor do cyberpunk, um subgênero de ficção científica criado por William Gibson, e que aborda conceitos como inteligência artificial e cyberespaço.\n\nO mundo em Neuromancer é submerso numa \"alucinação coletiva digital\", onde todas as pessoas se conectam ao universo virtual para adquirir conhecimento. O livro conta a história de Case, um ex-hacker que tenta achar uma cura para o seu problema neural que impossibilita que se conecte com este cyberespaço.\n\nA visão criada por Gibson serviu de inspiração para várias obras do gênero, como a trilogia Matrix, por exemplo.\n\n- https://ipfs.infura.io/ipfs/Qmc9NX1SY7X1EyMTit7PmK7ed6f8zyQ6aHopadvdedtsoW",
				"added": 1577402840
			},
			{
				"comment_id": 16,
				"body": "#Não Me Abandone Jamais – Kazuo Ishiguro\n\nKathy H. tem 31 anos e está prestes a encerrar sua carreira de \"cuidadora\". Enquanto isso, ela relembra o tempo que passou em Hailsham, um internato inglês que dá grande ênfase às atividades artísticas e conta, entre várias outras amenidades, com bosques, um lago povoado de marrecos, uma horta e gramados impecavelmente aparados. No entanto esse internato idílico esconde uma terrível verdade: todos os \"alunos\" de Hailsham são clones, produzidos com a única finalidade de servir de peças de reposição.\nAssim que atingirem a idade adulta, e depois de cumprido um período como cuidadores, todos terão o mesmo destino - doar seus órgãos até \"concluir\". Embora à primeira vista pareça pertencer ao terreno da ficção científica, o livro de Ishiguro lança mão desses \"doadores\", em tudo e por tudo idênticos a nós, para falar da existência. Pela voz ingênua e contida de Kathy, somos conduzidos até o terreno pantanoso da solidão e da desilusão onde, vez por outra, nos sentimos prestes a atolar.\n\n- https://ipfs.infura.io/ipfs/Qma8QpfQAuQ64bphsnyb2Gzk3bG3Ddpn9GrRM6m81oQc98",
				"added": 1577403045
			},
			{
				"comment_id": 17,
				"body": "#Submissão – Michel Houellebecq\n\nAo contrário das outras obras distópicas que retratam sociedades num futuro distante, Submissão, de Michel Houellebecq, mostra a França de 2022, liderada por Mohammed Ben Abbes, o candidato do imaginário Partido da Fraternidade Muçulmana.\n\nA crítica central do livro é focada na chamada \"população silenciosa\", aquela que simplesmente aceita as imposições que servem para anular a cultura do local, impondo aquela praticada pelo regime dominador.\n\n- https://ipfs.infura.io/ipfs/QmbhSe6CSFkpU8oA1Dccna6aSQsK7gUA8Wwp5xPEe1VZ6J",
				"added": 1577403233
			},
			{
				"comment_id": 18,
				"body": "#O Conto da Aia – Margaret Atwood\n\nEm O conto da Aia Margaret Atwood escreve sobre um totalitarismo cristão. A sociedade foi tomada por um grupo extremista cristão que mata seus governantes, extingue o direito das mulheres e as divide entre férteis e inférteis. As férteis são separadas para uma vez por mês serem estupradas pelos líderes e existem para esse único objetivo, trazer novas vidas ao país.\n\n- https://ipfs.infura.io/ipfs/QmfQLRxwHeqythHUjPRTscgXWzYMkBTfsvZzVvBVhQ6BAu",
				"added": 1577403519
			}
		]
	},
	"comment_vote": {
		"1_1Mn4GBbEzzaoeofFNzQyoyMmJLQsBk8cBZ": 1,
		"2_1Mn4GBbEzzaoeofFNzQyoyMmJLQsBk8cBZ": 1,
		"3_1Mn4GBbEzzaoeofFNzQyoyMmJLQsBk8cBZ": 1
	}
}