{
	"title": "German info",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 15,
	"demo": false,
	"modified": 1538385158,
	"post": [
		{
			"post_id": 14,
			"title": "Wegbereiter des Genozids aus Raffgier und ungebremster Selbstsucht.  Die Mitarbeiter der Fa. Lutherkirche Osnabrück sind gottlose Geschäftemacher.  ",
			"date_published": 1538352130.6,
			"body": "Das vollgefressene Pfaffenpack hat mit der Kirche Jesu Christi nichts zu tun. Der Tradition des Nazibischofs August Maharens entsprechend setzen Sie sich ein für den Mord am deutschen Volk . Indem dort das aus der Kaiserzeit stammende Gotteshaus zur Moschee umfunktioniert werden sollte. \nWie dumm muss man sein zu glauben , das es sich hier um ein Kunstprojekt handelt ? https://www.noz.de/lokales/osnabrueck/artikel/350724/der-ruf-des-muezzin-erklingt-von-osnabrucker-kirchturm\n\nDer Protestantismus der Firma Lutherkirche und des gesamten Kirchenkreises Osnabrück ist die Fortsetzung des Nazibischofs August Maharens. \nSie verhalten sich entsprechend des Urteils vom Europäischen Gerichtshof in den Haag der die BRD als die Rechtsnachfolgerin des 3. Reiches richtigerweise\neinstuft. https://youtu.be/ws4JuLOH8Ks\nAuch hier wird bis aufs Blut getrickst . Nach Art.116 GG ist Deutschland !! das Gebiet von 1937. Die BRD jedoch ist die Verwaltung der Besatzungsmacht !\nDas ist der Trick im Vortrag einer Frau Gerster. Wer Schadenersatz von Deutschland will , kann natürlich nicht die BRvd verklagen.\nEs ist der falsche Klagegegner.\nDie ehemalige sogenannte Superintendentin Doris Schmidtke ist mit der ganzen Familie dabei. Zusammen kassiert Sie über 20000 Euro pro Monat von Ihren sogenannten Steuergeldern ! Sie lässt arme Verrecken nimmt noch Spenden von denen und zeigt somit den gesamten Protestantismus in krankhafter emanzipatorischer Sichtweise den Stinckefinger. Das der Segen Gottes noch nie billig gewesen ist weiss ein jeder. Für ein objektiv unatraktives Erscheinungsbild ist die Natur verantwortlich , für Masslosigkeit und Raffgier ist ein zionistischer , sozialistischer , multikultureller  Emanzencharakter verantwortlich , der körperliche Defizite kompensiert. Das Psychogramm dieser Kreaturen weisst insoweit schwerste Defizite auf. Am Beispiel der Firmenchefin Schmidte die weder pastorale noch christliche Eigenschaften verifiziert entsteht zusammen mit der man achte mal darauf Geschäfts !! führenden Renate Jacob die nach Braslien musste um von einen Mann akzeptiert zu werden und die sich dort zwei Kinder nämlich die eigenen mitbrachte. Sie erfüllen beiden von der Namensgebung und Ihrer Verhaltsweise das was man von einem Zionisten erwartet. Christlich ist hier nichts ! Raffgier und Charakterlosigkeit. Sanatanisten treten stets in Verkleidung auf. "
		},
		{
			"post_id": 13,
			"title": "Schwulengottesdienste ! Stellen Sie sich vor normale Leute dürfen auch kommen ! \nWie Irre ist dieses Land geworden ? \nPrivate Neigungen auf Kosten der Steuerzahler ausgelebt !",
			"date_published": 1538233805.5,
			"body": "http://queer-gottesdienst.de/"
		},
		{
			"post_id": 12,
			"title": "Aktiv gegen das Geld der Deutschen . Sie haben die Ideen des Geschäftsführers zu bezahlen.\nDas kostet ! \nSie gehen zur Tafel und er macht sich einen tollen Tag ! \nSprechen Sie Verantwortliche direkt an ! \nFragen Sie direkt und glauben Sie nichts was hier steht ! Kopieren Sie Zettel mit den upik.de Originaldaten und bringen Sie die mit.\nSchauen Sie hier nach und enttarnen Sie Täuscher !  www.upik.de",
			"date_published": 1538232017.1,
			"body": "Dieses Firmengebäude ist mal eine Kirche gewesen !\nSie wurde von Deutschen zur Verehrung Gottes erbaut !\nUnter gültigem staatlichem Recht ! \nMit dem Bau wurde am 23. September 1907 begonnen; am 14. November 1909 wurde die Kirche als Tochtergemeinde von St. Katharinen eingeweiht\nJetzt findet dort das grosse Fressen statt !  Unsere Heimat ist nicht mehr !\nEines der Meisterwerke des Geschäftsführers 2009 bis 2011 z.B. !  \nDer Muezzin ruft nun nach geltendem Recht !\n\nhttps://www.noz.de/lokales/osnabrueck/artikel/350724/der-ruf-des-muezzin-erklingt-von-osnabrucker-kirchturm\n\nUPIK® Datensatz – L\nL \tName \tLutherkirche Osnabrück\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t312512729\nL \tGeschäftssitz \tMiquelstr. 5\nL \tPostleitzahl \t49082\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t05415690166\n\tFax Nummer \t\nW \tName Hauptverantwortlicher \tMartin Wolter\nW \tTätigkeit (SIC) \t8661\n\nHier der Filialbetrieb !\n\nUPIK® Datensatz - L\nL \tName \tEv.-Luth. Pfarramt Margaretenkirche\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t340445669\nL \tGeschäftssitz \tWasserwerkstr. 77A\nL \tPostleitzahl \t49086\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t0541389202\n\tFax Nummer \t\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661"
		},
		{
			"post_id": 11,
			"title": "Von diesen Firmen werden Sie entrechtet. Es sind Geschäftsführer ohne hoheitliche Rechte. Die Immunität auch sogenannter ,,Beamter,, wurde weltweit am 11.7.2013 aufgehoben. Lesen Sie den Artikel ,, Motu propriu,,  .  Nichts glauben alles prüfen !",
			"date_published": 1538221539.8,
			"body": "Wenn Sie nur downloaden wollen kommen Sie hierher !\nhttp://www.agmiw.org/wp-content/uploads/2016/01/BRvD.pdf"
		},
		{
			"post_id": 10,
			"title": "Was ist eine Motu proprio und Ihre Folgen \nvom 11.7.2013 !  Um es klar auszudrücken, ein Motu Proprio ist die höchste Form eines legalen Werkzeugs (Rechtsinstrument) auf diesem Planeten ! Es ist oberstes Recht der Welt !",
			"date_published": 1538205760.3,
			"body": "Franziskus – Papst-Erlass vom 11.7.2013 — am 1.9.2013 ist die Immunität der Richter, Staatsanwälte, Rechtsanwälte, Regierungsbeamten gegenüber dem Strafrecht rechtskräftig aufgehoben.\n\nSeit dem 1. September 2013 ist dieser Erlass von Papst Franziskus in Kraft. Ein Motu Proprio (Lat.: aus eigenem Beweggrund, selbst veranlasst) ist ein offizielles Dekret, ausgestellt vom Papst persönlich in seiner Eigenschaft und seinem Amt als oberster, höchster Pontifex und nicht in seiner Eigenschaft als apostolischer Führer und Lehrer der Weltkirche.\n\nhttp://w2.vatican.va/content/francesco/en/motu_proprio/documents/papa-\n\nfrancesco-motu-proprio_20130808_prevenzione-contrasto.html\n\nhttp://w2.vatican.va/content/francesco/de/motu_proprio/documents/papa-\n\nfrancesco-motu-proprio_20130711_organi-giudiziari.html\n\nHier der Text\n\nAPOSTOLISCHES SCHREIBEN\nIN FORM EINES «MOTU PROPRIO»*\n\nSEINER HEILIGKEIT\nPAPST FRANZISKUS\n\nÜBER DIE GERICHTSBARKEIT DER RECHTSORGANE DES STAATES DER VATIKANSTADT\nIM BEREICH DES STRAFRECHTS\n\nIn der heutigen Zeit ist das Gemeinwohl zunehmend durch staatenübergreifende und organisierte Verbrechen bedroht, ebenso durch die unangemessene Handhabung des Marktes und der Wirtschaft, sowie durch den Terrorismus.\nEs ist daher notwendig, dass die internationale Gemeinschaft angemessene rechtliche Instrumente, zur Verhinderung und Bekämpfung von Straftaten, durch die Förderung der internationalen, justiziellen Zusammenarbeit in Strafsachen, einrichten.\nBei der Ratifizierung zahlreicher internationaler Übereinkommen in diesen Bereichen, hat der Heilige Stuhl, auch im Namen und Auftrag des Staates der Vatikanstadt gehandelt, sowie stets betont, dass diese Vereinbarungen Mittel zur effektiven Bekämpfung und Verhinderung der kriminellen Aktivitäten sind, welche die Menschenwürde, das Gemeinwohl und den Frieden bedrohen.\nIm Hinblick auf die Erneuerung des Apostolischen Stuhls und diesen, um eine solche Zusammenarbeit zu stärken, ordne ich durch das vorliegende Apostolische Schreiben in Form eines »Motu Proprio«* an:\n1. Die zuständigen Justizbehörden des Staates der Vatikanstadt üben Strafgerichtsbarkeit auch über:\na) Verbrechen gegen die Sicherheit, welche gegen die grundlegenden Interessen oder das Erbe des Heiligen Stuhls gerichtet sind;\nb) Straftaten, im Bezug auf:\n– Das Gesetz des Staates der Vatikanstadt Nr. VIII, vom 11. Juli 2013, mit ergänzenden Normen in Strafsachen;\n– Das Gesetz des Staates der Vatikanstadt Nr. IX vom 11. Juli 2013, enthaltenden Änderungen des Strafgesetzbuches und der Strafprozessordnung;\nso solche Verbrechen, von in Absatz 3 (unten) genannten Personen, bei der Ausübung ihrer Aufgabenpflicht verübt werden;\n\nc) jede andere Straftat, deren Bekämpfung von einem internationalen Abkommen verlangt wird, das vom Heiligen Stuhl unterzeichnet wurde, wenn der Täter sich im Staat der Vatikanstadt befindet und nicht ins Ausland ausgeliefert wurde.\n\n2. Die unter Punkt 1 erwähnten Straftaten werden nach der Gesetzgebung abgeurteilt, die zu der Zeit, in der sie verübt wurden, im Staat der Vatikanstadt gültig war, vorbehaltlich der allgemeinen Prinzipien der Rechtsordnung in Bezug auf die zeitliche Anwendung der Strafgesetze.\n\n3. Im Rahmen des Vatikanischen Strafgesetzes werden den »öffentlichen Amtsträgern« gleichgestellt:\n\na) die Mitglieder, Beamten und Mitarbeiter der verschiedenen Einrichtungen der Römischen Kurie sowie der mit ihr verbundenen Institutionen;\n\nb) die Päpstlichen Gesandten und die diplomatischen Mitarbeiter des Heiligen Stuhls;\n\nc) Personen, die vertretende, verwaltende oder leitende Funktionen bekleiden, sowie jene, die – auch »de facto« – unmittelbar vom Heiligen Stuhl abhängige Körperschaften verwalten und kontrollieren und die im Verzeichnis der kirchlichen Rechtspersonen eingetragen sind, das im Governatorat des Staates der Vatikanstadt geführt wird;\n\nd) jede weitere Person, die einen administrativen oder juristischen Auftrag am Heiligen Stuhl besitzt, sei es ständig oder vorübergehend, entlohnt oder unentgeltlich, auf jedweder Ebene der Hierarchie.\n\n4. Die unter Punkt 1 erwähnte Gerichtsbarkeit schließt auch die administrative Verantwortung der Rechtspersonen ein, die sich aus einer Straftat herleitet, wie es von den Gesetzen des Staates der Vatikanstadt geregelt wird.\n\n5. Falls in anderen Staaten in derselben Sache vorgegangen wird, kommen die im Staat der Vatikanstadt gültigen Normen über die konkurrierende Gerichtsbarkeit zur Anwendung.\n\n6. Art. 23 des Gesetzes Nr. CXIX vom 21. November 1987, durch das die Gerichtsordnung des Staates der Vatikanstadt verabschiedet wurde, bleibt weiterhin gültig.\n\nDies beschließe und bestimme ich ungeachtet jeder anderen gegenteiligen Anordnung. Ich bestimme, dass das vorliegende Apostolische Schreiben in Form eines »Motu Proprio« durch die Veröffentlichung im Osservatore Romano promulgiert werde und am 1. September 2013 in Kraft trete.\n\nGegeben zu Rom, aus dem Apostolischen Palast, am 11. Juli 2013, im ersten Jahr meines Pontifikats.\n\nFRANCISCUS\n\n\n\n\nhttp://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\n\nUm es klar auszudrücken, ein Motu Proprio ist die höchste Form eines legalen Werkzeugs (Rechtsinstrument) auf diesem Planeten, gemäss seiner Herkunft, seinem Einfluss und seiner Struktur zur westlich-römischen Welt, übertrifft es alles, was von den Vereinten Nationen, dem Inner und Middle Temple, der CROWN oder jedem anderen Monarchen oder Staats-, Regierungschef ausgestellt werden könnte. Für Mitglieder der Vereinten Nationen oder von den Vereinigten Staaten oder Großbritannien anerkannte Nationen ist dies das höchste legale Instrument, ohne Frage.\nIm Fall des Motu Proprio vom 11. Juli 2013 ist es ein mehrschichtiges Instrument mit mehreren Funktionen.\nIn erster Instanz, kann es rechtlich ausgelegt werden, zur Applikation bei lokalen Angelegenheiten bei der Verwaltung des Heiligen Stuhls.\nIn zweiter Instanz bezieht sich das Dokument auf die Tatsache, dass der Heilige Stuhl der Grundpfeiler ist, auf dem das gesamte globale Rechtssystem aufbaut, daher ist jeder, der irgendwo auf der Welt ein Amt bekleidet diesen Beschränkungen unterworfen und dass Immunität diesbezüglich nicht länger gilt.\nDrittens sehen wir, dass sich der Heilige Stuhl und die Weltkirche klar von der nihilistischen Welt der professionellen EL-ite trennen, die erwiesenermaßen kriminell krankhaft handeln und dies solange fortsetzen, bis sie jemand, der das Gesetz respektiert von der Macht reißt,\nAuf jedenfall ist dieses von Papst Franziskus ausgestellte Dokument auf mehreren Ebenen historisch, das Signifikanteste ist, dass es das wichtigste Gesetz, die Goldene Regel als oberste Gewalt anerkennt. Alle Menschen sind gleich, niemand steht über dem Gesetz.\nAlle Staatsdiener handeln seit der UCC-Einreichung “Declaration of Facts” (UCC Doc # 2012127914) vom 28. November 2012 durch den OPPT auf eigene Verantwortung und haften persönlich für ihre Handlungen. Sie haben seitdem nicht mehr die Sicherheit ihrer zwangsvollstreckten Firmen im Rücken.\nAlle Regierungschartas annulliert:\n(siehe: ERKLÄRUNG DER FAKTEN (DFECLARATION OF FACTS): UCC Doc # 2012127914 28. November 2012)\n“…Dass jegliche und alle CHARTAS, einschließlich der United States Federal Government, UNITED STATES, “State of.“, inklusive jeglicher und aller Abkürzungen, idem sonans oder andere rechtliche, finanzielle oder administrative Formen, jegliche und alle internationale Äquivalente, einschließlich jeglicher und aller ÄMTER und ÖFFENTLICHER DIENSTSTELLEN, BEAMTEN und ÖFFENTLICHER BEDIENSTETEN, VERWALTUNGSAKTE und VOLLZUGS-BEDIENSTETE, VERTRÄGE, VERFASSUNGEN und SATZUNGEN, MITGLIEDSCHAFTEN, VERORDNUNGEN und jegliche und alle sonstige Verträge sowie Vereinbarungen, die damit und darunter getroffen worden sind, jetzt nichtig, wertlos, oder anderweitig annulliert sind, unwiderlegt;… “\nBankchartas annulliert:\n(siehe: TRUE BILL: WA DC UCC Doc # 2012114776 24. Oktober 2012)\n“Erklärt und unwiderruflich gelöscht; jegliche und alle Chartas der Mitglieder der Bank für Internationalen Zahlungsausgleich (BIZ), aller Mitglieder und Nutznießer, einschließlich aller Begünstigter, einschließlich jeglicher Körperschaften, die private Geldsysteme besitzen, betreiben, unterstützen, begünstigen und die sich Rechnungsstellung, Geldeintreibung, Vollstreckungsmaßnahmen bedienen, um SKLAVENSYSTEME zu unterhalten … die rechtmäßige Werte mithilfe unrechtmäßiger Befugnis beschlagnahmen… “\n\nAnm: damit sind sämtliche Finanzämter, Steuerbehöden etc illegal unterwegs. Jeder, der es dennoch weiter betreibt, stellt sich gegen den Willen des Vertreters Gottes auf Erden. Und sowieso gegen das höchste Gesetzbuch: gegen die Bibel.\n\nLangsam zieht auch nicht  mehr die Ausrede „ich muss doch eine Familie ernähren“ … das muß der Geplünderte in der Regel auch."
		},
		{
			"post_id": 9,
			"title": "Rückkehr !  Konkordat mit dem deutschen Reich aus 1933 !  Sehen Sie hier die Originalurkunden vom 16.09.2014 ! ",
			"date_published": 1538197957.7,
			"body": "Schauen Sie hier ! Der sogenannte Kardinal Woelki wird vereitigt auf das Konkordat von 1933 mit Adolf Hitler ! \n\nhttps://youtu.be/te-bzXRRe_w\n\nDas ist auch nur jur.korrekt weil die BRD die Fortsetzung des 3. Reiches ist.So sagt es Petra Gerster ohne Umschweife im ZDF !\n\nhttps://youtu.be/SmkShuoX_Wc\n\nDas Konkordat stammt vom 20.Juli 1933 \n\nhttps://i1.wp.com/schaebel.de/wp-content/uploads/2018/02/urkunde-woelki.jpg"
		},
		{
			"post_id": 8,
			"title": "Neuigkeiten aus der Merkel Diktatur ! Nichts glauben alles nachvollziehen !",
			"date_published": 1538063063.7,
			"body": "https://youtu.be/SJB1prw18gg\n\n\nDie Nutzniesser der Firma evangelische Kirche be­grü­ßen BRvD Chefin. Sie ist ja evangelische Pastorentochter ! \n\nSie ist Geschäftsführer leitet ein Unternehmen und übernimmt die Geschäftsführung. Sie trägt die Verantwortung für Ihre Firma und haftet als gesetzlicher Vertreter persönlich, wenn er Richtlinien missachtet.\n\nhttps://youtu.be/6nzAwNoSbUw\n\nhttps://youtu.be/a9z-aKfPqkM\n\nFirmenprojekte  \nDamit niemand vergisst wer verantwortlich war ist hier alles konserviert !\n\nhttps://www.noz.de/lokales/osnabrueck/artikel/350724/der-ruf-des-muezzin-erklingt-von-osnabrucker-kirchturm\n\nFolgende Firma hat dieses Projekt durchgefuehrt !\nSchauen Sie mal wer das alles gut heisst. Es steht alles im Artikel. Das sind aber nur Firmanmitarbeiter !\n\nUnd die leben von einem nie in Kraft getretenen Steuergesetz.\nhttps://dejure.org/gesetze/AO/415.html\n\nSchreibt Ihnen  oder sprecht Sie an  !\nDer Geschäftsführer  redet gerne !\nEr schreibt es selbst !\n,,Ach ja und ich rede gerne und mag Menschen, die ebenfalls gerne reden und klüger sind als ich,, .\n\nEin Geschäftsführer leitet ein Unternehmen und übernahm die Geschäftsführung. Er trägt die Verantwortung für die Firma und haftet als gesetzlicher Vertreter persönlich, wenn er Richtlinien missachtet.\n\nWurde hier Geld verschwendet ?\nBeruhen die Einnahmen auf gültigem Recht ?\nDie AO ist jedenfalls nie in Kraft getreten.\nhttps://dejure.org/gesetze/AO/415.html\nWenn man aufgrund eines solchen Gesetzes Steuern erhebt und die dann\nz.b auch noch ausgibt ist das ein typischer Fall des 263 STGB. \nWurden Verträge geschlossen , gekündigt ? \nVerpflichtungen nicht eingelöst ?\nWurden Dokumente als ,, amtlich ,, ausgegeben oder Sie getäuscht indem Ihnen erklärt wurde das diese Firma amtlich hoheitliche Tätigkeiten vornehmen kann ?\nWurde gesiegelt oder amtlich gestempelt ? so etwas ?\nDas nächste mal gehen Sie zu Ihrem Bäcker. Der kann Ihnen das vielleicht umsonst machen , weil Sie regelmässig Brötchen kaufen !\nDas alles ist Betrug wenn es sich um eine Firma handelt.\nDa hilft auch kein 140 GG  der auf eine Weimarer Reichsverfassung verweist WRV 137 nachdem die kirchen alles selbst regeln. Es sind ja nur Firmen !\nUnd Hoheitsbetriebe eben nicht !  Und die koennen nun mal nicht mit einem Hoheitsbetrieb zusammengelegt werden 4\nhttps://dejure.org/gesetze/GG/140.html\nFuer so etwas haftet ein Geschäftsführer !\nWer kein ,,hoheitliches Amt ausübt  ,,  sondern Firma und sich  aber als Amt ausgibt begeht einen Straftatbestand ! \n\nStrafgesetzbuch (StGB)\n§ 270 Täuschung im Rechtsverkehr bei Datenverarbeitung\nDer Täuschung im Rechtsverkehr steht die fälschliche Beeinflussung einer Datenverarbeitung im Rechtsverkehr gleich.\n\noder\n\nDas kommt bei allen Verträgen zur Anwendung , wenn in einer Firma sich  z.b.als  Amt ausgibt . Dafür haftet der Geschäftsführer mit seinem Privatvermögen.\n\n§ 123 BGB\nAnfechtbarkeit wegen Täuschung oder Drohung\n\n(1) Wer zur Abgabe einer Willenserklärung durch arglistige Täuschung oder widerrechtlich durch Drohung bestimmt worden ist, kann die Erklärung anfechten.\n\n(2) 1Hat ein Dritter die Täuschung verübt, so ist eine Erklärung, die einem anderen gegenüber abzugeben war, nur dann anfechtbar, wenn dieser die Täuschung kannte oder kennen musste. 2Soweit ein anderer als derjenige, welchem gegenüber die Erklärung abzugeben war, aus der Erklärung unmittelbar ein Recht erworben hat, ist die Erklärung ihm gegenüber anfechtbar, wenn er die Täuschung kannte oder kennen musste.\n\n\n\n\n\nUPIK® Datensatz – L\nL \tName \tLutherkirche Osnabrück\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t312512729\nL \tGeschäftssitz \tMiquelstr. 5\nL \tPostleitzahl \t49082\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t05415690166\n\tFax Nummer \t\nW \tName Hauptverantwortlicher \tMartin Wolter\nW \tTätigkeit (SIC) \t8661\n\n\n\nHier ist eine Filiale !\n\nUPIK® Datensatz - L\nL \tName \tEv.-Luth. Pfarramt Margaretenkirche\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t340445669\nL \tGeschäftssitz \tWasserwerkstr. 77A\nL \tPostleitzahl \t49086\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t0541389202\n\tFax Nummer \t\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661\n\n\nDie Adresse des haftenden Geschäftsführer  finden Sie hier !  Sie haben hier einen vollhaftenden Geschäftsführer als Ansprechpartner für die entsprechende Firma und Ihre Filialen.\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\nNiemand weiss wie lange der link noch funktioniert .\nHier ist der Herr Geschäftsfuehrer !\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone/dirk_hartung\n\nBitte pruefen  Sie es selbst .\nGeben sie die Daten hier ein  \nhttps://www.upik.de//\n\nNichts glauben !\n\nHier sehen Sie den sogenannten \nSIC Code 8661 Religious Organizations es sind Religionsindustrie !\n\nIndustry\n    Services\nDescription\n    Establishments of religious organizations operated for worship, religious training or study, government or administration of an organized religion, or for promotion of religious activities. also included in this industry are religious groups which reach the public through radio or television media.\nCross References\n    Other establishments maintained by religious organizations, such as educational institutions, hospitals, publishing houses, reading rooms, social services, and secondhand stores, are classified according to their primary activity. Establishments of such religious groups which produce taped religious programming for television are classified in industry 7812, and those which produce live religious programs are classified in industry 7922. Establishments of such groups which operate radio or television stations are classified in communications, major group 48.\nIllustrative Examples\n    Churches, convents, monasteries, religious instruction, provided by religious organizations, religious organizations, shrines, religious temples.\n\n\n\n"
		},
		{
			"post_id": 7,
			"title": "Taufe in der Fa. Lutherkirche ! Ich bin getauft auf Deinen ! nicht meinen Namen !\nOder Tod durch Taufe in der Lutherkirche . \n",
			"date_published": 1538062927.6,
			"body": "\nWarnung ! \n\nAls ich das zum erstenmal erfahren habe , nahm ich an die Spinnen.\nLeider nicht !\nDieses Kapitel ist nicht ganz einfach. Durch die Gnade Gottes fallen auch Protestanten hierunter , also ist nicht ,, wir sind evangelisch ,,. \n\nIm Nachfolgenden werden die Schreibweisen der Begriffe wie folgt verwenden:\nI. Begriffsbestimmungen:\n\nMENSCH = Monster gem. Ballentine’s Law Dictionary 1st Edition aus 1930, versklavt durch die Menschenrechte aus 1947\n\nm e n s c h = natürliche Person gem. BGB aus 1900, aus der Art der MENSCHEN hervorgegangen als Mann / Frau, kein MENSCH, sondern eine Menschheit (mankind) = geistiges Seelenwesen in Fleisch und Blut\n\nSchreibweise S p e r r s c h r i f t = Bedeutung: l e b e n d\n\n„Normale“ Schreibweise = Bedeutung: tot\nII. Die Taufe\n\nZeitlebens war ich nie ein Bibelfreund.\n\nMöglicherweise stellt sich das nun als Fehler heraus, den ich jedoch korrigieren darf.\n\nSollte es kein Fehler gewesen sein, dient die Bibel als Verdeutlichung dessen, was wirklich mit uns im Todesritual „Taufe“ geschieht.\n\n    Für all jene, die nun meinen, aufgrund von Nichttaufung fein darzustehen, sei hier folgendes erwähnt: Das Personenstandsregister ist ein kirchliches Register. Da die BRvD eine vatikanische Verwaltungseinheit im heiligen römischen Reichsverwaltungsgebiet Deutschland ist, kommt ein Eintrag in dieses Register einem Taufritual gleich. (warum die BRvD den Amerikanern gehört, die Amerikaner den Briten und die Briten dem Papst, erläutere ich hier nicht weiter, da es an anderen Stellen, bspw. im Video „Sklaven ohne Ketten“ bereits ausführlich dargestellt ist).\n    Für all jene, die weder getauft noch registriert sind, darf ich anmerken, daß sie immer noch MENSCHEN → see Monsters sind:\n\nBALLENTINE’S LAW DICTIONARY (1930):\n\nhuman being: See MONSTER:\n\nMonster: A human being by birth, but in some part resembling a lower animal. A monster hath no inheritable blood, and cannot be heir to any land.\n\nUm nun zu verstehen, was die Taufe in Wirklichkeit ist und welche Fiktion er erschafft, holen Sie sich Ihren wenn Sie einen besitzen.\n\nUnser Probant heisst Markus !\n\nNun zum Trick:\nAuf dem Taufschein wird folgendes festgeschrieben:\n1. Es erfolgt die Taufe eines jenseitigen (umstehend genannten) Kindes\n\n2. Es wird ein diesseitig lebender M a r k u s erwähnt, der jedoch offensichtlich nicht getauft wurde, sondern wohl lediglich als Teil des Rituals diente.\nEin Blick in die Totenverordnung „Jugendschutzgesetz“ genügt, um zuerst einmal das jenseitige Kind der Taufe zu definieren:\n\n§ 1: „Kinder im Sinne dieses Gesetzes sind Personen…“\nAha, also im Jenseits existieren Personen. Wie sieht die getaufte Person nun aus?\n\n\n\nDie jenseitige Person, also das tatsächlich getaufte Objekt, ist ein toter Markus Martin Schmidt ,\n\ngeboren am 8. Dezember 1974 durch das Standesamt Dinslaken.\n\n    Diesseits = l e b e n d\n    Jenseits = tot\n\nDa ein Toter offensichtlich geboren wurde, schauen wir mal, was denn so geboren wird:\nhttps://de.wikipedia.org/wiki/Orderpapier\n\n„Orderpapiere sind auf einen Namen lautende Wertpapiere…“\n\n„Wertpapierrechtlich wird zwischen geborenen und gekorenen Orderpapieren unterschieden.“\n=> Am 8. Dezember 1974 wurde also das Wertpapier Markus Martin Legros geboren und am 5. Januar 1975 dem Papst übertragen.\n\nNun stellen sich jedem, dem noch ein Fünkchen Restintelligenz innewohnt, natürlich zwei Fragen:\n\n    Warum wurde ein Wertpapier geboren?\n    Was hat der diesseits lebende M a r k u s damit zu tun?\n\nDa wir nun wissen, daß Personen offensichtlich Tote sind und der Verstand uns nahelegt, daß Tote nicht auf Bäumen wachsen, muß also zwingend zuerst einmal jemand, der l e b t , sterben, damit ein Toter entsteht.\nSchauen wir also, was der Papst, Herrscher über und Erfinder von L e b e n und Tod (jedenfalls GLAUBT er es als eigenermächtigter Vertreter Gottes auf Erden selbst!) dazu beisteuern kann:\nDIE RECHTSSTELLUNG PHYSISCHER PERSONEN\n\nCan. 96 — Durch die Taufe wird der m e n s c h der Kirche Christi eingegliedert und wird in ihr zur Person…\nSo, durch das Ritual Taufe wird also ein m e n s c h zur Person.\n\nDa das canonische Recht deutlich älter als der derzeitige Juristenkram ist, habe ich mir erlaubt, zum Verständnis die Schreibweise anzugleichen.\n\nWarum der m e n s c h trotzdem noch zum MENSCH werden mußte, führe ich später aus.\n\n=> Durch die Taufe wird also ein vormals angeblich L e b e n d e r offensichtlich zu einem körperlichen Toten = physische Person\n\nSchauen wir weiter:\nJURISTISCHE PERSONEN\nCan. 114 — § 1. Juristische Personen entstehen entweder aufgrund einer Rechtsvorschrift selbst oder aufgrund einer durch Dekret gegebenen besonderen Verleihung seitens der zuständigen Autorität, und zwar als Gesamtheiten von Personen oder Sachen, die auf ein Ziel hingeordnet sind, das mit der Sendung der Kirche übereinstimmt und die Zielsetzung Einzelner übersteigt.\n\n=> Die vatikanische Verwaltung BRvD gebirt also juristische Personen und faßt die Gesamtheit selbiger unter der Bezeichnung „DEUTSCH“ zusammen.\n\nEntsprechend werden Ausweisdokumente korrekt ausgestellt!\n\nBeschäftigen wir uns nun mit der Ritual der Taufe / Personenstandsregistratur selbst:\nhttps://de.wikipedia.org/wiki/Taufe\nEs passiert also folgendes:\nWir werden\n\n    im Namen des Vaters, des Sohnes und des heiligen Geistes (also nicht in unserem, sondern im Namen anderer)\n    auf den Namen Jesu, das Lamm Gottes, das die Sünde der Welt trägt\n    in den Tod Jesu Christi\n\ngetauft und mit ihm begraben!\nDamit wissen wir nun, was die Taufe wirklich ist:\nDie fiktive Kreuzigung eines lebenden m e n s c h e n , die Sünde der Welt auferlegt bekommend, und sein Tod am Kreuz, wodurch er in das Totenreich Personenkult gelangt!\n\nJeder, der nun in die Kirche rennt, betet SICH SELBST am Kreuz hängend an und huldigt seinem Tod!\n\nDenn es ist Jesus am Kreuz und durch die Taufe wird jeder selbst zu Jesus!\nAn dieser Stelle könnte ich nun die Ausführung beenden, wir sind alle gekreuzigte Sklaven des Papstes.\n\nDamit könnte man sich nun auch begnügen und bei Brot und Spielen im Totenreich umeinander laufen, jedoch:\nLaut Bibel ist das nur die halbe Wahrheit…\n„Am dritten Tage auferstanden von den Toten und aufgefahren in den Himmel, zur Rechten Gottes des Vaters…“\nDas Totenreich zu betreten ist nicht das Problem, sondern es wieder zu verlassen!\nDer Papst und seine Kirche dienen keinem anderen Zweck, als genau DAS zu verhindern und sie spielen dieses Spiel, ob man nun daran glaubt oder nicht, bis zum letzten Spielzug in erbarmungsloser Konsequenz zu Ende!\nDa das hl. Römische Reich nie untergegangen ist, sondern vielmehr der corpus iuris civils und der corpus iuris canonici 1929 in der Erschaffung des Vatikans eins wurden, sowie jegliche Staatsgründung von den Jesuiten zur Versklavung der m e n s c h e n vorangetrieben wurde, sollte es nicht verwundern, daß jeder Kaiser und seinesgleichen entweder vom Papst gekrönt wurde oder aber dem Papst bereits von Haus aus hörig war.\n\nWährend 1530 der letzte Kaiser des hl. röm. Reiches deutscher Nationen, Karl V., vom Papst gekrönt wurde, waren alle seine Nachfolger von Haus aus bereits papstunterwürfig, wodurch eine Krönung durch den Papst unnötig wurde.\n\nDieses Spiel durchbrach ein Mann, dem dieses Spiel nur allzu gut bekannt war, der König Wilhelm von Preußen gerufen wurde und dem Deutschen Kaiserreich vorstehen sollte…\n\nEs war wohl ein kalter Neujahrsmorgen. Wir schrieben das Jahr 1900, als ein auf römischem Recht basierendes, von einem jungen, ambitionierten und intelligenten älteren Herrn mittleren Alters im Auftrag eben jenes Preußen verfasstes Gesetz in Kraft trat, das den Lauf der Geschichte für immer verändern sollte.\nDen Herrn nennen wir „von Bismarck“, das Gesetz „Bürgerliches Gesetzbuch“, kurz BGB.\nEs war weniger der Inhalt des Buches, der den Zorn des Herrschers der Totenwelt heraufbeschwor, als vielmehr die Überschrift des ersten Paragraphen:\nIII. Natürliche Personen\n\nDas Totenreich Personenkult wird vom Papst regiert, jedoch schon ein oberflächlicher Blick in den corpus iuris canonici offenbart die alles entscheidende Wahrheit:\nNatürliche Personen sind mit keiner Silbe im Buch der Toten erwähnt!\nVielmehr war es mit einem Schlag möglich, sowohl das Totenreich mit einer Maske zu betreten, als auch in der Welt der L e b e n d e n zu verweilen.\n\nWeiterhin forderte der Eigentümer der natürlichen Person, Kaiser Wilhelm, nun nicht die Herrschaft über die Deutschen, sondern machte jeden Deutschen zum Miteigentümer der natürlichen Person.\n\nDie Deutschen waren nun in der Lage, in der hier auf Erden herrschenden Totenwelt zu agieren, jedoch ohne ihr angehören zu müssen.\nWer nun den wahren Grund für inzwischen über 100 Jahre andauernden Weltkrieg sucht, er hat ihn jetzt und hier gefunden!\nZuerst entbrannte der Kulturkampf, in dem der Papst die Übertragung das natürlichen Person an ihn forderte, aufgrund der fruchtlosen Forderung danach der Weltkrieg.\n\nMit der Einrichtung der päpstlichen Verwaltung „Weimarer Republik“ wurde diese Möglichkeit nicht gelöscht, lediglich überblendet. Ein Mann jedoch sah sich 1933 veranlasst, diese Überblendung rückgängig zu machen, den Kaiser zu reaktivieren und die Deutschen als alleinige Eigentümer der natürlichen Person zu erklären.\n\nDas Schicksal dieses Mannes liegt jedoch verborgen im Nebel, lediglich wilde Geschichten über ihn machen die Runde…\n\nDer m e n s c h war nun in der Lage, anstatt einer Totengemeinschaft des Vatikans als juristische Person angehören zu müssen, die natürliche Person zu nutzen.\n\nDamit war dem Papst der körperliche Tote, die physische Person entzogen und der Deutsche war frei vom Sklaventum der Kirche, ohne jedoch dem Kaiser als Sklave untertänig zu sein!\nNachdem nun das BGB inkraft getreten war, übernahmen eine Vielzahl von römischen Reichsverwaltungseinheiten = Länder/Staaten dieses Gesetz auch für sich.\n\nEs begann eine wahre Sklavenflucht.\nJedoch gehörte (und gehört) die natürliche Person ausschließlich den Deutschen im allgemeinen und den Preußen im speziellen.\n\nEiner weiteren Erklärung, warum bis heute alles deutsche als abgrundtief schlecht und Preußen als Kriegstreiber dargestellt wird, bedarf es daher wohl nicht.\nAnti – Matrix: oben ist unten, Lüge ist Wahrheit, schlecht ist gut, Krieg ist Frieden…\nIV. Die Schaffung der Geburtstreuhand und das Spiel der Finanzelite\n\nNachdem sich nun der Totenherrscher beruhigt hatte, mußte ein Plan her, der die natürlichen Personen wieder in den Totenkult überführte.\n\nDas war die Geburtsstunde der Geburtstreuhand „NAME/Sozialversicherungsnummer“.Das Orderpapier war geboren!\nUm ein Wertpapier jedoch zu gebähren, muß es einen Wert enthalten. Eine Treuhand ohne Wert ist nicht existent.\nHier kommen all die Abscheulichkeiten ins Spiel, die zur heutigen Zeit Gang und Gäbe sind:\n\n    Wert eines Menschenlebens https://de.wikipedia.org/wiki/Wert_eines_Menschenlebens\n    FIAT – Geld der Finanzelite\n    MENSCH → see Monster\n    und so weiter und so fort\n\nDa zwar das M e n s c h h e i t s w e s e n wieder gekreuzigt werden kann, nach deutschem Recht jedoch „am dritten Tage aufersteht“ und damit als L e b e n d e r sein Erbe einfordern kann, welches aber der Papst als sein Eigentum betrachten möchte, bleibt diesem nichts anderes übrig, den Wert eines Menschenlebens errechnen zu lassen, diesen Wert als Startkapital durch die Finanzelite in einer Geburtstreuhand fiktiv erschaffen zu lassen und zu Gunsten des Gekreuzigten bis zu seiner Auferstehung zu verwalten.\nDer Papst ist nichts weiter als der Truchsess unseres Erbes!\nV. Der gelb/weiße Schein\n\nUm diesen Schein, der so unbeschwert den Namen „Staatsangehörigkeitsausweis“ trägt und bei dem selbst in seiner Kosenamensform „gelber Schein“ noch über seine wahre Bedeutung hinweggetäuscht wird, ranken sich viele Mythen und Legenden.\n\nWelche das alles sind, führe ich nicht weiter aus, denn sie sind alle falsch!\nWarum dieser Schein nicht gelb, sondern gelb/weiß ist, erschließt sich hier:\nhttps://de.wikipedia.org/wiki/Flagge_der_Vatikanstadt\nDie Schreibweise der Person sieht wie folgt aus (oder sollte so aussehen!):\n\n\n\n=> Die Ausstellung des gelb/weißen Scheins in dieser Form ist der Auftrag des Papstes an seine Verwaltung BRvD, die eigentlich tote Person l e b e n d zu erklären!\nUnd nochmal auf den Taufschein zurückkommend:\nWas bedeutet es für den einst lebenden Ritualsteilnehmer M a r k u s , wenn die Person, in die er gestorben werden sollte, nicht tot ist?\nUnd in das Ballentine’s Law Dictionary schauend:\nWas kann ein Toter nicht, sondern nur ein L e b e n d e r , und was ist somit ein L e b e n d e r nicht, sondern nur ein Toter?\nDie Antworten auf diese beiden Fragen beinhalten die wahre Bedeutung des sogenannten StaG – Ausweises / gelben Scheins!\nUm abschließend noch einmal den Bogen zur Bibel zu schlagen:\nJesus ist nicht gestorben, um dann im Himmel ewiges Leben zu erfahren.\n\nJesus ist gestorben, am dritten Tage auferstanden von den Toten und DANACH in den Himmel aufgefahren.\n\nJesus bezeichnete sich auch nie selbst als Gottessohn, sondern als MENSCHENSOHN (schreibweise an heutige Definition angeglichen!). Um zum G o t t e s s o h n zu werden, mußte er erst auferstehen.\nWie ich bereits eingangs erwähnte – ich war nie ein Bibelfreund.\n\nWährend jedoch der Großteil noch in der Matrix mit GEZ, Gerichten, Gerichtsvollziehern, Behörden und was weiß ich mit welchem fiktiven Unsinn noch alles spielt, lohnt sich ein Blick über den Matrixtellerrand, um zu begreifen, auf welcher Ebene dieses Spiel hier tatsächlich gespielt wird…"
		},
		{
			"post_id": 6,
			"title": "Man hilft sich unter Verwandten !\nAuch hierfuer ist die Lutherkirche Osnabrueck ein Paradebeispiel !",
			"date_published": 1538059924.9,
			"body": "https://d2m2t6h7e4d953.cloudfront.net/damfiles/default/evlka/presse-medien/news/2013/lasup-juergens-dd0984e46dc6acc641cd83c14f51a622.jpg\n\nEr ist ein grosser Firmenmitarbeiter . Natuerlich ist er nichts anderes .\nSieht nett aus oder ? Er hat fuer seinen Geschaeftsfuehrer alles getan ! Deshalb ist er ist ja auch geworden.\n\nKennen Sie den ?\n\nNa dann schauen Sie mal  wer jetzt die Geschäfte so führt .\nKarrieren wie im Bilderbuch .\nErst Kneipe jetzt Chef eines Mittelstandsunternehmens.\nWenn da man nicht die Verwandtschaft geholfen hat.\nEinfach mal anrufen und Nachfragen.\n\n\nAlles Zufall oder was ?\n\nGeschäftsführer\nErst Koch ! War nix\nDann hatte er eine Kneipe. War nix .\n\nDurch den Segen des Landessuperintendenten kam die Erleuchtung !\n\nUlf Jürgens\nMiquelstraße 5\n49082 Osnabrück\nTel.: 0541 5690167\nE-Mail: ulf.juergens@evlka.de\n\nWer Bilder sehen will.\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/gemeindebuero \n\nGutes Gehalt das ist wichtig  !  \nDer Steuerzahler macht vieles moeglich !"
		},
		{
			"post_id": 5,
			"title": "Nichts glauben alles klar !",
			"date_published": 1538055809.9,
			"body": "1. Auf dieser Seite siehst Du wie Du alles pruefen kannst.\nGehe auf diese Seite schau den Film !\n\nhttps://youtu.be/BUcncLo7qWw\n\n2. Suche selbst auf dieser Seite.\nhttps://www.upik.de//\n\n3. Stell deinen sogenannten Pastor zur Rede !\n\n4.Sage es anderen !"
		},
		{
			"post_id": 4,
			"title": "Kollekten ausgenommen bis aufs Blut ?  \nDie Fa.Lutherkirche Osnabrück sammelt Kollekten für Ihre Firmenkonten und gibt vor Kirche Christi zu sein. \nChristus unterstützt bestimmt keine \nGeschäfts Führer . Er hat die Händler aus dem Tempel vertrieben.",
			"date_published": 1538045276.3,
			"body": "Warum Spenden Sie nicht für Ihren Zeitungshändler oder Bäcker ?\nDer hat doch auch eine Firma. Geben Sie Ihre Spende doch einer Dönerbude. Die halten nur keine Kollekte ab . Die Idee dazu überhaupt zu sammeln ist schon eine Irre Idee.\nGeben Sie Ihr Geld direkt und seien Sie nicht so dumm das für eine kriminelle Vereinigung zu geben , die am Ende so in Unrecht verstrickt ist das Ihnen die Augen überlaufen werden.\nGeben Sie es ihrem Floristen , ist wenigstens kein Spendenbetrug möglich, weil dem Inhaber die Kollekte zugute käme und Sie das unmittelbar wissen wer der Begünstigte ist. \nSie wissen wer das Geld bekommt.\nIn der Fa. Lutherkirche Osnabrück  kriegen Sie gesagt was zusammengekommen ist und für welches  Subunternehmen ! das Geld verwendet [verschwendet] wird. Das ist in den anderen Filialen auch so.\n\n\n\nAuch die haben Geschäfts Führer und die wiederum wollen für das unterjochen kleiner Mitarbeiter auch noch gut bezahlt werden.\nDa gibt es Standesdünkel und vor allem Verwandtschaft .\nDavon profitierte auch der Koch , der jetzt den Geschäftsführer ist aber davon später.\nAuch für diese Dinge ist die Lutherkirche eines der abschreckensten Beispiele.\nUnd der ist auch hier eingetragen wie jeder Unternehmer.\nDer für die Untergruppe Lutherkirche Hauptverantwortliche hat einen den Namen Martin Wolter. Er ist Geschäfts Führer dieser Teileinheit , die Teil der Evangelisch - lutherische Südstadtkirchengemeinde ist .\nDie Haftung für das ganze hat Dirk Hartung für die Jahre 2009 bis 2011. Notieren Sie sich die Adresse ! \n\nSchauen wir uns das mal an.\n\nUPIK® Datensatz – L\nL Name Lutherkirche Osnabrück\nNicht eingetragene Bezeichnung oder Unternehmensteil\nL D-U-N-S® Nummer 312512729\nL Geschäftssitz Miquelstr. 5\nL Postleitzahl 49082\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05415690166\nFax Nummer\nW Name Hauptverantwortlicher Martin Wolter\nW Tätigkeit (SIC) 8661\n\nDer ehemaliger Geschäftsführer ist 2011 wieder in seine alte Rolle geschlüpft !\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\nHier wird seine Adresse eingeblendet.\nFragen Sie Ihm doch mal warum er Geschäfts Führer gewesen ist. \nGanz einfach er macht Geschäfte was sonst.\nDenn der Name Lutherkirche Osnabrück ist nichts anderes als eine Firma nach \n\nHandelsgesetzbuch § 17 \n(1) Die Firma eines Kaufmanns ist der Name, unter dem er seine Geschäfte betreibt und die Unterschrift abgibt.\n(2) Ein Kaufmann kann unter seiner Firma klagen und verklagt werden.\n\nDer Name ist also die Firma unter die der Kaufmann sein Geschäft betreibt.\n\nJa und wer betreibt das Geschäft Lutherkirche Osnabrück der oben genannte Geschäftsführer . Dieses Geschäft ist eine Filiale . \nDarüber kommt dann der Firmenverbund weil noch mehere Filialen vorhanden sind.  Diese Verwaltungsfirma ist  die Suedstadtkirchengemeinde. Sie verwaltet die anderen Unterfirmen.\n\n\nWas alles dazugehört finden Sie hier.\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns\n\nUnd der persönlich haftende Geschäftsführer im Zeitraum 2009 bis 2011 den finden Sie hier.\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/pastoren_diakone/dirk_hartung\n\nDer wurde ausgewechselt. Jetzt mach dieser ehemalige Koch.\n\nhttps://www.suedstadtkirchengemeinde.de/wir_ueber_uns/gemeindebuero\n\nSie sehen wie das mit der Geschäftsführung aussieht. \nFür den Fall das Sie z.B. etwas gespendet haben , sie eine ungültig unterschriebene Urkunde in  Händen halten , dann haftet für die Jahre 2009 und 2011 diese Person mit dieser Adresse.\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\nDeshalb wir Sie hier auch direkt abgebildet. \nDiese Information ist nicht vertraulich . \nSie ist offenkundig nur fehlt das manchmal im Handelsregister.\nDeshalb wird das hier ergänzt.\n\n\n\n\n\n"
		},
		{
			"post_id": 2,
			"title": "Die Verräter des Luther !",
			"date_published": 1538044105.4,
			"body": "Die evangelische Kirche in der BRD ist eine Firma von arbeitsscheulichen Täuschern. \nEs sind private Unternehmen die den einzigen Gott Mammon anbeten. \nEs sind Firmen wie wir gleich sehen werden die auf schlimmste Art Menschen bestehlen.\nWie kommt es das , das Sie im ältesten Handelsregister der Welt registriert sind ? \n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\nQuelle: United States Department of Labor\n\n\nUPIK® Datensatz - L\nL \tName \tEvangelisch-lutherischer Kirchenkreis Melle-Georgsmarienhütte\nW \tNicht eingetragene Bezeichnung oder Unternehmensteil \tEv.-luth. Kirchenamt Osnabrück\nL \tD-U-N-S® Nummer \t342853950\nL \tGeschäftssitz \tEversburger Str. 32\nL \tPostleitzahl \t49090\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054194049100\n\tFax Nummer \t\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661"
		},
		{
			"post_id": 1,
			"title": "Herzlich willkommen !",
			"date_published": 1433033779.604,
			"body": "Kirchenrecht und warum es uns alle betrifft  !\n\n1.Kirchenrecht ist das selbst gesetzte Recht der Religionsgemeinschaften. Es regelt die Rechtsbeziehungen der Religionsangehörigen untereinander.\n\n2.Davon zu unterscheiden ist das Staatskirchenrecht. Dabei handelt es sich im Gegensatz zum Kirchenrecht um – von der Warte der Religionsgemeinschaft her – fremd gesetztes Recht und regelt die Rechtsbeziehung der Religionsgemeinschaft zum Staat. Demgemäß beschränkt sich das Staatskirchenrecht entgegen dem Wortlaut nicht auf Kirchen, sondern erstreckt sich auf alle Religions- und Weltanschauungsgemeinschaften im Geltungsbereich des jeweiligen Staatskirchenrechtes. \n\nBischof Woelki schwört seinen Treueeid in Berlin auf das Konkordat mit Adolf Hitler !\n\nhttps://youtu.be/te-bzXRRe_w       \n\nWarum ist das so ?\n\nDer ehemalige Bischof von Berlin Woelki ist das auch ein Nazi ?  \n\nEs ist noch viel schlimmer !  Dieser Kasper ist Teil einer Unterdrückungsorganisation deren Entrechtungsprozess schon mit der Taufe beginnt.\n\n\n"
		}
	],
	"tag": []
}