{
	"next_topic_id": 2,
	"topics": [
		{
			"topic_id": 1,
			"title": "Testers for ZeroNet features?",
			"body": "Volunteer some of your time to speed up ZeroNet development!\n\nSo there's a lot of development going on with ZeroNet. Not everyone has the time or resources to sit down and contribute code, but I think there might be some people who have even a little bit of time, that could help. \n\nI want to gather people working on ZeroNet features here so they find other people who could test those features. I'll go first :)\n\nI'm working on issue #5 - replacing upnpc with a pure python way to forward ports. This will be more portable across platforms and will avoid false antivirus warnings. I have a working version here: https://github.com/sirMackk/ZeroNet/tree/upnp_punch . If anyone has a few spare minutes to run the code and see if it forwards ports on their router, that would be great. So far I know it works correctly on 3 routers. I've integrated it into the main project, so you have to start ZeroNet as you normally would and watch the log messages on the screen - it should say something about the port being closed, then about trying to open it, and finally \"Port open\". Thanks ya'll!",
			"added": 1424436845
		}
	],
	"next_message_id": 8,
	"comments": {
		"1@2": [
			{
				"comment_id": 1,
				"body": "This is amazingly cool!",
				"added": 1423484563
			}
		],
		"1@6": [
			{
				"comment_id": 2,
				"body": "HackerNews. Finally a project worth getting excited about and not another \"(facebook|airbnb|uber) for (cats|sub-saharan goats)\".",
				"added": 1424125851
			}
		],
		"1@13": [
			{
				"comment_id": 3,
				"body": "I feel like email-like messaging system would have the highest utility, especially since it could be added to other projects, like the decentralized marketplace. ",
				"added": 1424125978
			}
		],
		"1@35": [
			{
				"comment_id": 4,
				"body": "Hi there,\nI haven't looked at the internals of ZeroNet, but from what I've picked up here and there, I'll wager a guess that it's using public key crypto (http://en.wikipedia.org/wiki/Public-key_cryptography). Basically, you have your private key that you sign messages with so as long as that key is safe, people can't impersonate you here.",
				"added": 1424435756
			}
		],
		"3@2": [
			{
				"comment_id": 5,
				"body": "What about using https for protecting p2p channels? I saw that you're working on replacing 0mq now, so this would definitely have to wait until after that, but there's a few schemes that could be used here to pass p2p traffic over https.",
				"added": 1424435950
			}
		],
		"1@10": [
			{
				"comment_id": 6,
				"body": "A wiki is a great idea to coordinate efforts and share knowledge! I'm now looking over how sites are created, how the crypto signing stuff works, and looking at the ZeroTalk repo. Might try to turn this info into a working wiki.",
				"added": 1424628052
			},
			{
				"comment_id": 7,
				"body": "Thanks cryptozaurus, I'm happy it worked! Testing it out is actually a great contribution. ",
				"added": 1424786663
			}
		]
	}
}