{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1565699499,
			"title": "An Article about distribuite networks like Zeronet",
			"body": "ZeroNet, Diaspora*, Mastodon and the refugee 08chan are analysed with the point of view of hate speech.\nhttps://www.financialexpress.com/opinion/heavy-handed-moderation-and-banning-of-extremists-may-end-up-doing-more-harm-than-good/1672878/",
			"added": 1565699498
		},
		{
			"topic_id": 1565706281,
			"title": "08chan users came from USA and Europe (the map)",
			"body": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k/dpr_1.5/c_limit,w_690/fl_lossy,q_auto/unnamed_1_kw5fqc\n\nA IT tech has studied the IPs of the users of 08chan ZeroNet zite. About half users are not behind TOR wall and a lot has not VPN.\n\nThis is the article:\nhttps://www.thedailybeast.com/8chan-users-migrating-to-zeronet-are-accidentally-revealing-their-locations\n\n«The Daily Beast captured 819 IP addresses for 08chan users connecting from 62 different countries. Most users in our sample, 437 of them, are in the U.S., with Canada (46 users), and the U.K. (37), a distant second and third place. Ordered by states, California, Texas, Washington, and Florida top the list.»",
			"added": 1565706279
		},
		{
			"topic_id": 1617562900,
			"title": "Half billion records for free in forum from Facebook",
			"body": "https://www.businessinsider.com/stolen-data-of-533-million-facebook-users-leaked-online-2021-4\n\nThe personal data of over 500 million Facebook users has been posted online in a low-level hacking forum.\n\nThe data includes phone numbers, full names, location, email address, and biographical information.",
			"added": 1617562897
		},
		{
			"topic_id": 1617665358,
			"title": "[POLL] Have you been Facebook-powned?",
			"body": "Half billion records for free in forum from Facebook\nhttps://www.businessinsider.com/stolen-data-of-533-million-facebook-users-leaked-online-2021-4\n\nIf you are not tech savvy and you want see if your cell number is in the list:\nhttps://haveibeenfacebooked.com/\n\nIf you are a tech you can download via Torrent the list with half billion cell numbers:\nmagnet:?xt=urn:btih:awksoovwotqfcmnhk73j6skkikc3iknk&dn=Facebook%20Leak%20%5B2019%5D%5B533M%20Records%5D%5B106%20Countries%5D&tr=udp%3A%2F%2Ftracker.pomf.se%3A80%2Fannounce\n\nPlease post a message with only:\n\nYES if you are powned\nor\nNO if not",
			"added": 1617665354
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 1,
				"body": "> [kai0](#comment_1064_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 中英联合声明失效，香港由联合国托管。\nTranslation:\nThe Sino-British Joint Declaration expired and Hong Kong is hosted by the United Nations.",
				"added": 1565619382
			}
		],
		"1565583628_1C9SF8vbHqBVYVnqB7zzqZuNjuvXiUVUBv": [
			{
				"comment_id": 2,
				"body": "> [leftside](#comment_818_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm):  I think this could be easily achieved by modifying a tiny part of the zerotalk .js.Anyway ZeroTalk is managed by @nofish.\n\nFor many posts It is advantageous read only the first or two messages and the more recent messages are the best answers to the OP. For few posts I might want to read the entire discussion. So a button resolve the issue for every case.\n\nSo @nofish can do the change.",
				"added": 1565620164
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 3,
				"body": "Pay money for have IDs. If you don't want to pay the fee you can execute a precise 0net page with mining js https://github.com/cazala/coin-hive that mine monero cryptocurrency.\n\nhttps://www.getmonero.org/\nMonero is secure\nMonero is a decentralized cryptocurrency, meaning it is secure digital cash operated by a network of users. Transactions are confirmed by distributed consensus and then immutably recorded on the blockchain. Third-parties do not need to be trusted to keep your Monero safe.\n\nIf you have a normal desktop you execute coin-hive.js for about xx seconds or 1 minute and you get your ID.\n\nIf you have crypto you can change it with monero by an Exchange like https://monero.org/services/exchange/\n\nMonery is anonymous.\n\nIn the initial phase ZeroID can request to execute coin-hive.js for only a bunch of seconds, with a graph bar from 0% to 100%. If The spam become bigger ZeroID increase the time of execution of coin-hive.js.",
				"added": 1565629647
			},
			{
				"comment_id": 4,
				"body": "If 8chan or other 0page want to limit the spam can oblige users to post messages only with registred IDs.\nIDs can also to become of two levels, normal IDs and payed IDs. You can upgrade you ID to payed level if you pay or execute monero js mining code.\n\n8chan can request payed level for the IDs that want to post in its forum. 1 minute of js execution is less for a human but a lot for a bot.\n\nZeroID can create a multilevel pay IDs with time of execution vary from seconds to many minutes, ten minutes.",
				"added": 1565630448
			}
		],
		"1565677132_19ouxiGbVPzjqbCeAWLx4udeggoUsfEhdV": [
			{
				"comment_id": 5,
				"body": "> [7bit](#comment_2_1N11NsibgNVZrsTpnsSbhb65jxQme4wmET): NetZero is a potential rebirth of that early Internet culture!\n\nYess, I agree. :)\n\nNet0 really? not 0net?",
				"added": 1565694538
			}
		],
		"1565699499_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_978_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): So, some journalists think ZeroNet is a site mirroring service. [...]\n\nA piece of the article says:\n\n«ZeroNet is a peer-to-peer hosting service that downloads website material on behalf of visitors, then serves it back up as a decentralised content delivery network. This effectively performs the same function as Cloudflare, but rather than a single company controlling hundreds of servers, each server belongs to a unique visitor.\n\nCensorship-resistant services have provided refuge for sex workers when a new law tried to prevent free speech about their industry, and more recently for protesters in Hong Kong. Then again, Diaspora and Telegram have both been used by ISIS.»",
				"added": 1565702838
			}
		],
		"1565706145_17o47gAF2ADHSuwX4LZxdxzietaPdEyxsu": [
			{
				"comment_id": 7,
				"body": "It maybe contain child abuse, by the way do you have try 08chan.bit?",
				"added": 1565706980
			}
		],
		"1565706281_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 8,
				"body": "> [wkuvqb5egq](#comment_13_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf): repost\nIs It already posted? Do you have the link of the first post?",
				"added": 1565710583
			},
			{
				"comment_id": 9,
				"body": "> [wkuvqb5egq](#comment_14_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf): 127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz/8Chan+Refugees+Blow+Their+Anonymity\n\nTY.",
				"added": 1565711921
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 10,
				"body": "> [capitanjack](#comment_4_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk): Type netstat and start collectingBut who cares? They are going to jail us just for speaking? Better they should try fixing their heads first :^)They are crazy more most of those 8ch anons\n\nAhh, yes. The journalist has start Zeronet client, view all the 08chan zite, goes to /data folder of zeronet, delete all zites folders except 08chan folder and then activate netstat for some days. Filtered the zeronet IPs. The IPs collected are of 08chan users.\n\nThen He has separate IPs from TOR and IPs not from TOR by Tor exit node list and check the locations associated to the IPs. Finally put the Filtered IPs to the Map.",
				"added": 1565713243
			}
		],
		"1617562900_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 11,
				"body": "TY.",
				"added": 1617663202
			},
			{
				"comment_id": 15,
				"body": "> [rogu3anuerz2](#comment_1_14L3nYs5oE6mrFd6dp2siSGMjXtCAYU1YX): rogu3anuerz2 \n\n> [jeff](#comment_108_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Thanks. Would you happen to know the format for these records?\n\ntxt files.",
				"added": 1617755542
			}
		],
		"1617665358_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 12,
				"body": "NO",
				"added": 1617665387
			},
			{
				"comment_id": 13,
				"body": "> [stupidhorse](#comment_12_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH): NOThanks for the magnet.  I've checked half a dozen friends and none of them are listed in here either.  These records seem wildly incomplete.  I'm starting to wonder if this is actually Cambridge Analytica data.\n\nThe magnet link come from [rogu3anuerz2] in a previous 3ad.",
				"added": 1617754712
			},
			{
				"comment_id": 14,
				"body": "> [darkoo](#comment_25_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG): cool thanks ! safe file? how big is it?\n\nYou can download only your country. The magnet has hundred of country, unzip it you get a small amount of txt file like 0.txt, 1.txt and so on. The files are big so you can parse via shell and in linux you can find a string o a cell number with:\n\n$ cat *.txt | grep \"name:surname:\"\n\nit take few seconds.",
				"added": 1617755110
			}
		]
	},
	"comment_vote": {
		"4_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk": 1
	}
}