{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "川普是真的要打貿易戰嗎？中國領導層感到迷茫",
			"body": "KEITH BRADSHER, JANE PERLEZ\n2018年4月13日\nhttps://cn.nytimes.com/business/20180413/china-trade-war-trump/zh-hant/\n\n北京——12月，中國東部地區舉辦的一次會議上，在一間典雅的會議室內，一位中國領導層成員向出席此次會議的美國高科技企業高管尋求幫助。\n\n這位名叫王滬寧的官員是共產黨的戰略家，其職業生涯的大部分時間裡都把美國視為地緣政治對手，他想知道，川普總統是不是真地要跟中國打貿易戰，這些高管是否可以成為中國同白宮溝通的管道。\n\n他並不是唯一一個這樣做的人。\n\n在過去的幾個月裡，根據被諮詢到的人說，中國最有影響力的一些人在想方設法更好地去理解川普，以及如何應對他好鬥的貿易議程——這些人是習近平主席的盟友，與美國有著長期聯繫，有同美國打交道的深厚經驗。\n\n最近幾週，王岐山副主席與多位美國商界領袖和前內閣官員會面，向他們諮詢川普的貿易威脅。負責協調經濟政策的政治局成員劉鶴也在做同樣的事情。一位身在美國、長期研究中國的學者說，僅在過去两週內，就有五位官員拜訪他尋求建議。\n\n在這些會面中，美國人警告說，川普的抱怨應當被認真對待，因為華盛頓方面普遍對中國的政策感到沮喪，特別是《中國製造2025》，它是一項價值3000億美元的關鍵性高科技產業計劃，令美國國家安全機構備感警惕。\n\n目前還不清楚這一信息是否傳達給了習近平——亦不清楚他是否斷定川普是在虛張聲勢，最後美國仍將像過去那樣退縮，從而選擇忽視這個信息。\n\n根據分析人士以及與領導層有關係的內部人士的說法，習近平上個月一手策劃取消了對國家主席的任期限制，並且獲得了這一職務的新任命後，親自掌控著應對貿易僵局的決策。有人說，他不容置疑的權威使黨派機構更加難以傳送與他觀點相悖的消息。\n\n「如果政權是這樣的，你就希望報告好消息。」全球律師事務所德傑(Dechert)負責與中國高級官員交涉的合伙人陶景洲說。「我的印象是，領導層沒有充分了解到美國權勢階層反中氣氛的嚴重性。」\n\n週四，川普的貿易立場帶來的困惑進一步加深，他出人意料地宣稱，繼美國去年突然退出跨太平洋夥伴關係(Trans-Pacific Partnership)談判後，他現在在考慮重新加入這一多國貿易協議。\n\n習近平提拔了一小群顧問，他們的職業生涯部分取決於解讀和處理美國問題的能力，提拔的人數可能比習的歷屆前任都多。但是，許多與他們見面的人士表示，他們似乎對川普的迅速決策和貿易威脅感到驚訝和困惑，例如對中國進口商品額外加征1000億美元的懲罰性關稅。\n\n這些人包括王滬寧，中共的首席理論家，還是年輕學者的時候他寫過一本關於訪問美國的書；王岐山，習近平最得力的副手，數十年來與華爾街保持著良好的關係；劉鶴，主管經濟的副總理，擁有塞頓霍爾大學(Seton Hall)和哈佛大學(Harvard)的碩士學位。習近平還提拔前駐華盛頓大使楊潔篪加入了中共的25人政治局。\n\n儘管相關人才濟濟，但中國的領導層似乎很迷茫，急切地在被川普攪亂的美國政壇尋找中間人。二十多年來，中國政府一直看到的是美國商界支持與中國的貿易，美國的歷任總統也都支持這種做法。但川普摒棄了這種模式。\n\n「中國的專家們不了解美國的現狀，」培訓上海高級公務員的中國浦東幹部學院教授趙傑（音）說。「他們不了解川普，不了解他的團隊，也不了解他的政策來源。」\n\n一個原因在於，中國領導層在美國的常用聯繫人大都被川普邊緣化了。他們大多是擁有國際金融和外交背景的建制派人物。\n\n「中國官員在華盛頓熟悉的都是川普的敵人，」北京的中國人民大學國際關係教授時殷弘表示，「川普很討厭這些人。」\n\n北京也為一些潛在的盟友失寵而感到沮喪，包括首席經濟顧問加里·D·科恩(Gary D. Cohn)，他反對徵收關稅，但上個月辭職了；還有川普的女婿賈里德·庫什納(Jared Kushner)，由於他的家族在中國的商業利益，他似乎在迴避這個議題。\n\n為了尋找答案，中國國家副主席王岐山最近幾週會見了美國的三位前財政部長——蒂莫西·蓋特納(Timothy Geithner)、小亨利·M·保爾森(Henry M. Paulson Jr.)和勞倫斯H·薩默斯(Lawrence H. Summers)——以及前美國貿易代表羅伯特·B·佐利克(Robert B. Zoellick)和前國防部長威廉·S·科恩(William S. Cohen)。\n\n在同一時期與中國領導人會晤的商界領袖包括蘋果公司(Apple)的蒂莫西·D·庫克(Timothy D. Cook)、摩根大通(JPMorgan Chase)的傑米·戴蒙(Jamie Dimon)、思科(Cisco)的查克·羅賓斯(Chuck Robbins)、黑石集團(Blackstone Group)的史蒂芬·A·施瓦茨曼(Stephen A. Schwarzman)，以及高盛(Goldman Sachs)的戴維·M·所羅門(David M. Solomon)。\n\n「他們會問，『我們可以找誰去談？』」最近接待了五名中國官員的學者戴維·M·蘭普頓(David M. Lampton)說。「他們覺得這個結構很不穩定。」\n\n但約翰·霍普金斯大學高級國際問題研究學院(Johns Hopkins School of Advanced International Studies)的蘭普頓教授表示，中國人儘管沮喪，但似乎對自己可以「比這屆疏遠盟友、削弱政治基礎的美國政府存在更長時間，以及美國民眾對痛苦的承受能力很低而感到滿意」。\n\n對於如何應對川普的貿易威脅，北京似乎存在分歧。一些精英人士強調貿易戰對中國經濟的潛在影響，敦促進行談判；而另一些人則認為，這場爭端是阻礙中國崛起的更廣泛努力的一部分，北京必須做出相應的回應。\n\n「中國目前在貿易戰問題上，還是以戰為主的這個氛圍比較濃厚一些，」北京的政治評論員陳傑人表示。\n\n儘管川普實施的關稅迄今隻影響了中國鋼鋁行業的一小部分，但擬定額外徵收的一批關稅，可能會影響到1300多種商品的製造商。\n\n鑒於中共對媒體的嚴格控制，習近平的政策沒有像川普的關稅遭到美國商業領袖的反對那樣，引發強烈抗議。中國沒有一個行業或地區特別容易受影響這一點有利，但航空航天業可能會遭到重創，把出口對準美國的中國車企也會受到影響。\n\n本週，在中國南方城市博鰲召開的一場會議讓中國的商界領袖聚在了一起。在習近平發表講話並呼籲「對話而不對抗」後，會場氣氛樂觀。\n\n但中國國民經濟研究所所長樊綱在會上發表講話時提醒注意製造業供應鏈面臨的「系統性風險」。電商巨頭阿里巴巴的創始人馬雲也暗示貿易戰可能會毀掉1000萬個就業崗位。\n\n在北京，一個敏感的問題是《中國製造2025》計劃的命運。該計劃一直是川普政府抱怨的焦點。它會提供補貼和貸款，幫助中國企業收購外國競爭對手、發展先進技術並在替代能源、機械人、電信和人工智慧等關鍵領域佔據主導地位。\n\n軍事和安全機構，以及與它們密切相關的行業，認為該計劃對中國的戰略宏願至關重要。但分辨中國經濟政策制定者的態度更難，這不單是因為放棄習近平推崇的計劃是政治禁忌。\n\n比如，中國總理李克強在貿易爭端上的立場往往比他在領導層中的同僚更傾向於調解，後者支持維護中國作為全球大國的勢力。但他領導下的一批政府部委負責人正是《中國製造2025》計劃主要的設計師和支持者。\n\n他們包括工業和信息化部部長苗圩及科技部部長王志剛。相熟的人說，和李克強一樣，這兩人都在中國中部的貧困省份安徽長大，都支持國家在產業升級方面發揮廣泛的作用。\n\n另一方面，與習近平關係極為密切的政策制定者——包括劉鶴和副總理王岐山在內的有金融背景的人——對在地緣政治上尋求與美國平起平坐更關心，對產業政策總體上不那麼熱心。\n\n知情人士說，他們擔心國家干預可能會扭曲市場，加劇中國已經負債累累的金融系統的問題。\n\n但這些擔憂並沒有轉化為在川普的威脅下放棄《中國製造2025》計劃的意願。\n\n「我認為中國不會在《中國製造2025》上妥協，」位於北京的國際關係學院教授達巍說。「這是競爭的核心。」\n\n迄今為止，習近平制定了一條溫和的路線，在川普政府徵收關稅時採取同樣的措施進行報復，同時呼籲通過談判解決爭端。\n\n但自從中國官方拒絕了美國廢除《中國製造2025》的要求後，談判就陷入停滯。中國的一名發言人週四表示，雙方沒有進行實際的貿易談判。",
			"added": 1523709255,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}