{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Доступ к ZN из локалки и извне",
			"body": "Не знаю насколько это уничтожает мироздание, но, кажется, такой кульбит позволяет обращаться к вашему ZN и из локалки, и (при проброске порта) извне:\n\n\n\\ZeroNet-dist\\core\\src\\Config.py\n\tLine 175:         \n\tself.parser.add_argument('--ui_ip', help='Web interface bind address', default=\"ваш-локальный-сетевой-ip\", metavar='ip')\n\n\\ZeroNet-dist\\core\\src\\main.py\n\tLine 125:         \n\tconfig.fileserver_ip = 'ваш-локальный-сетевой-ip'  # Do not accept connections anywhere but localhost\n\tLine 132:         \n\tconfig.fileserver_ip = 'ваш-локальный-сетевой-ip'  # Do not accept connections anywhere but localhost",
			"added": 1488919758
		}
	],
	"topic_vote": {
		"1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi": 1
	},
	"next_comment_id": 37,
	"comment": {
		"1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7": [
			{
				"comment_id": 1,
				"body": ">  Ну и пока почему-то уродов тут нет :) Они все в RetroShare сидят :)\nКак-то не очень сейчас прозвучало. Что-то личное? Тебя там обидели что ли? )",
				"added": 1486977206
			},
			{
				"comment_id": 2,
				"body": "> [balancer73](#comment_57_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Да нет, не обидели. Но народ в тамошних форумах какой-то неадекватный. Параноидальный и злобный :) Тут коммьюнити намного качественнее.\n\nТ.е. априорно назвать всех пользователей RS-сети (которых ты хоть, к слову, не очень заинтересовал своим там появлением и флудом о ZN, но при этом не получил ни одного наезда или неаргументированного ответа) уродами это в твоем понимании и есть проявление \"качественного комьюнити\" к представителям которого ты себя видимо относишь? \n\nЧувак, тогда у тебя проблемы с: \n1. общением \n2. с логикой\n3. (...список, кстати можно продолжить, но мы же качественное комьюнити тут, поэтому не будем...)\n\nИ тут уже встает вопрос о _твоей_ адекватности.",
				"added": 1487001115
			},
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_60_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Проблема с адекватность явно у того, кто из лёгкой гиперболы «все уроды в RS» делает вывод о категоричном утверждении «в RS все уроды». Я не говорил того, что ты прочитал в моих словах.\n> \n> Вот, видишь. Ты пришёл с RS и принёс с собой разборку. Это тоже о чём-то говорит...\n\nСовершенно очевидно что ты не знаешь откуда я пришел и  где и когда я был. Поэтому я тебе объясню: я очень давно сижу и тут и там. И комьюнити там нисколько не хуже, а благодаря тебе и таким персонажам как ты и не лучше чем тут или где-то еще. Но в принципе, да, зря я перед тобой бисер мечу, видимо...",
				"added": 1487002123
			}
		],
		"4_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi": [
			{
				"comment_id": 4,
				"body": "http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies Выбираешь любой живой прокси и проверяешь свой мегазайт.",
				"added": 1487168201
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 5,
				"body": "> [serjo](#comment_1_1Au3RjYrQvHmcBFf6hZyhRkNmVxoGBqR3G): поцоны, пожалста, кому за 30, ставьте в конце комента. ++\n\nЗачем? Это эйджизм :)",
				"added": 1487168290
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 6,
				"body": "Ну раз уж тут про \"обходы\" и \"рутрекеры\", то... \nМогу, кончено, ошибаться, но пока в ZN \"файлообмен\" \"происходит\" через коллекционирование обычных магнетов, а поиск пиров для этих магнетов через обычный DHT никакие \"Зеро- обходы блокировок\" и никакие ЗероТьюбы и ЗероРутрекеры смысла не имеют - за вами смотрят и записывают все что вы качаете.\n\nВот вам простой сайтик в клире, который в реалтайм и 24/7 мониторит (и пишет) DHT на предмет раздач и IP в них участвующих, если еще не видели: \nhttps://iknowwhatyoudownload.com/ru/contacts/  (особенно прекрасный пункт \"Сотрудничество\")\nhttps://iknowwhatyoudownload.com/ru/peer/\n\nЗаконодательство сейчас меняется в сторону наказания скачивающего, а не раздающего, и на блокировки копирастам уже давно наплевать. Сейчас подход планируется такой: скачал, к примеру, \"Выжившего\" -  жди квитанцию, ну или повестку... :)\n\nА тут в магнетах лежит не только условный \"Выживший\", есть гораздо более... хм... спорные вещи. И у рядовых юзеров ZN, не владеющих инфой о том как тут все устроено, что совершенно нормально при низком пороге вхождения, создается мощная иллюзия безопасности, мне кажется.",
				"added": 1487252400
			},
			{
				"comment_id": 7,
				"body": "> [dragonna](#comment_1_15K5EuZ7F2jmMxxiacTU9Qc5pxsq5cPcVa): Вот так заходишь в даркнет впервые в жизни, а тут опять про прон)\n\nЭто не даркнет, конечно... Это, скорее, \"альтервэб\". И все.",
				"added": 1487321328
			},
			{
				"comment_id": 8,
				"body": "Для того же для чего и обычный в меру возможностей предоставленной технологии. Бложики и МегаХомпаги :)  \nПравда есть еще что-то вроде Твиттера (почти). \nНу и главная мысль такая, что тут невозможно зацензурить сайт, даже если там Гитлер трогает колбасу...",
				"added": 1487321665
			},
			{
				"comment_id": 9,
				"body": "Преимущество в отсутствии цензуры (ну почти \"отсуствии\", ибо из некоторых хабов ZMe владельцы уже удаляли кое что: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1DnhwsShChvDmLiG3hMnPHCgMj2nJbxG8J/journalist@zeroid.bit) и в том что сайт хостится не в одном месте, а у всех кто на него хоть раз заходил. А значит его нельзя просто так закрыть. \nЗато тут в дизайне сети нет полноценного безопасного файлообмена. \nПо дефолту ZN не про анонимность и безопасность. Это про другое :)",
				"added": 1487340314
			},
			{
				"comment_id": 10,
				"body": "Кстати вот интересный кейс.\n\nСкажем на хабе в ZeroMe выложил кто-то фотки не совсем одетых несовершеннолетних и присовокупил еще кучу магнетов на раздачу того-же добра (там такое есть, да), ты как простой обитатель того же хаба, в глаза этого не видишь и вообще всяческий противник, но хаб лежит в т.ч. и у тебя на диске. Ломается диск, к примеру, ты отдаешь его на восстановление, а пламенный комсомолец с румянцем на всю щеку, который работает в сервисцентре, увидел на твоем диске фотки и ссылки и позвонил дяде Степе. И все... Пишите письма.\n\nГде я не прав?",
				"added": 1487341469
			},
			{
				"comment_id": 11,
				"body": "Шифрование между пирами? \nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/17H6uxjm8hQK9Rk79yHkvQYQnTkJNroA3T/strawing@zeroid.bit\nОчевидно, нет. \nИ \"обычный рядовой юзер\" не знает ничего о том как и зачем шифровать раздел... Но это так, к слову.",
				"added": 1487410187
			},
			{
				"comment_id": 24,
				"body": "> [zernon](#comment_1_1Dif4FhYssQJCe7hFdSDpVbrxEVmFvtYzz): Привет, мое первое сообщение в ЗероНете.\n\nНу все теперь...",
				"added": 1488449029
			}
		],
		"1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi": [
			{
				"comment_id": 12,
				"body": "> [reshik](#comment_2_1MvofpUCKk25LNajbJVh5GP5eLKmH8WH75): zerro, а кто в твоём понимании вата? ты случайно не с хохляндии? а то про Путина, вату и прочее любят писать майданутые с Украины, да антипутинцы с России. Мне не живущему в этих странах противно видеть эти дрязги... криптовалютное сообщество в моём понимании аполитично, а тут оказывается тоже гниды водятся...\n\nСмотри: \"Путин\", \"хохляндия\", \"майданутые\", \"укроп\", \"гниды\"... Ты своим постом шикарно ответил на свой же вопрос \"кто вата\". \nЭто ты. Ta-daaa!",
				"added": 1487510442
			},
			{
				"comment_id": 14,
				"body": "> [gnome](#comment_2_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Аффтар ты думаешь, что с Путиным борешься? Ты просто гадишь сети, в которой пишешь, обращая на нее внимание разнообразных спецслужб. Ты часом не из казаков?\nТоварищ, брат-в-zero, коллега... Верь, спецслужбы обратят или не обратят свое внимание на ZN вне зависимости от того что и кто тут напишет, абсолютно. \nНо скорее всего они дааавно уже тут. \nКак и в Tor-е, как и в i2p, как и во Freenet, как и в ...",
				"added": 1487513633
			},
			{
				"comment_id": 16,
				"body": "Я не говорил про отдельного проверяющего на каждом форуме же :)\nИ скорость \"обращения внимания\" никак не связана с подобными этому топиками... Ну правда :)\n> [gnome](#comment_3_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Довольно наивно",
				"added": 1487514390
			}
		],
		"1_1HHsJVKEXQwfg8d1NSnNi55SfMWCsuqGYR": [
			{
				"comment_id": 13,
				"body": "А чем это хуже/лучше Tor-а? Не вообще, а применительно к ZN именно.",
				"added": 1487511807
			}
		],
		"1_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu": [
			{
				"comment_id": 15,
				"body": "> [vlad20012](#comment_254_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): используются только трекеры\nFail",
				"added": 1487513709
			},
			{
				"comment_id": 17,
				"body": "При полном заворачивании в Тор поднимается скрытая нода, а где посмотреть ее адрес? Что-то не найду никак о_О",
				"added": 1487525490
			},
			{
				"comment_id": 18,
				"body": "Так где увидеть адрес ноды? И является ли она выходной?",
				"added": 1487576763
			},
			{
				"comment_id": 19,
				"body": "> [dude](#comment_25_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): тут смотри http://127.0.0.1:43110/Stats\n\nТам только мой текущий IP с чей-то выходной тор-ноды, что мне до лампочки. \nОнион адреса моей zn-тор-ноды не вижу. Является ли моя zn-тор-нода выходной для кого-то тоже не вижу.",
				"added": 1487691418
			},
			{
				"comment_id": 20,
				"body": "В общем, никто ничего не знает. А разговоров...",
				"added": 1487766794
			}
		],
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": [
			{
				"comment_id": 21,
				"body": "Теперь это г всегда будет вверху как непрочитанное?",
				"added": 1488190506
			},
			{
				"comment_id": 22,
				"body": "А обратно изменить дату никак?",
				"added": 1488372046
			},
			{
				"comment_id": 23,
				"body": "> [zalex](#comment_72_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): К примеру, (на своей стороне) мы можем вносить таких \"хулиганов\" в черный список: идем на ZeroID.bit, там етсь пункт \"Search in user base\", вбиваем ник и блокируем.P.S. Я вовсе не призываю mist'a мутить.\n\nЭто понятно. Но было бы \"правильнее\" просто вернуть все взад :)",
				"added": 1488380370
			}
		],
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 25,
				"body": "https://www.youtube.com/watch?v=z7TsMSEbGX0\nhttps://www.youtube.com/watch?v=29HdgidzaTs\nВот вам и про кораблик и про элиты и про все. (Нет, это не \"Димон\"...)\n\nА по сабжу, уверен что ничего не получится - на выборы Навального не пустят так или иначе, найдут способы. \nНо это вовсе не значит что ничего не надо делать. Абсолютно правильное решение начать кампанию за допуск к выборам. Лично буду всячески поддерживать как могу (и даже уже это делаю), хотя и уверен что не дадут.",
				"added": 1488537657
			}
		],
		"1_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx": [
			{
				"comment_id": 26,
				"body": "Поэтому обязательно включить \"Tor-always\" режим. Что тоже, конечно, не спасает на 100%, но...",
				"added": 1488877055
			}
		],
		"1_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE": [
			{
				"comment_id": 27,
				"body": "При этом продолжает работать и коннект через тор и все остальное. Если баян, то не пинайте...",
				"added": 1488919848
			},
			{
				"comment_id": 28,
				"body": "Работает. Сижу с планшета. В стате IP торовский.",
				"added": 1488958075
			},
			{
				"comment_id": 29,
				"body": "Зачем андроидовский клиент? Как раз его не хотел юзать. Захожу браузером с планшета на машину с установленным ZN.",
				"added": 1488958934
			}
		],
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 30,
				"body": "Теневой сегмент интернета сократился почти на 85%\n\nС апреля 2016 года количество ресурсов в сети Tor сократилось с 30 тыс. до 4,4 тыс. Резкое снижение количества сайтов аналитики связывают с кибератакой на подпольного хостинг-провайдера Freedom Hosting II, которую в феврале этого года совершила группировка Anonymous из-за размещения детской порнографии. После атаки из сети Tor исчезли тысячи активных сайтов, отмечается в отчете. Ранее The Next Web сообщал, что в результате атаки в свободном доступе оказались персональные данные 381 тыс. пользователей.\n\nТакже OnionScan предполагает, что резкое сокращение количества ресурсов теневого сегмента связано с прекращением работы почтового сервиса Sigaint.\n\nПодробнее на РБК:\nhttp://www.rbc.ru/rbcfreenews/58bee43b9a7947f6606e5024",
				"added": 1489044469
			}
		],
		"1_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr": [
			{
				"comment_id": 31,
				"body": "Автор просто фашист (ну и безумный, конечно). Что вы тут вообще все делаете? Еще и апаете зачем-то эту помойку.",
				"added": 1491216354
			}
		],
		"3_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 32,
				"body": "> [pin240] Теперь эту же бумажку нужно в обязательном порядке  обменять на новую + заплатить за нее всего-то 2000 р\n\nГде это? Что это? Ссылка есть?",
				"added": 1491216603
			},
			{
				"comment_id": 33,
				"body": "\"Какие митинги? Какой Медведев? Какая коррупция? У нас тут людей в метро взрывают! Вы что?? Вы враг народа!\" Удобно...",
				"added": 1491221192
			}
		],
		"1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": [
			{
				"comment_id": 34,
				"body": "Держать exit-ноду Тора в россии? Правда? Хахаха...\nС другой стороны Дарвина никто не отменял.",
				"added": 1491938369
			}
		],
		"2_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 35,
				"body": "\"Фейри\". Только \"Фейри\". Никаких стиральных порошков. Эх, молодежь...",
				"added": 1513787337
			}
		],
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 36,
				"body": "Смотреть как Китай бессмысленно сжирает место на твоем винте.",
				"added": 1516716446
			}
		]
	},
	"comment_vote": {
		"1_1NKiJnE8wsXzb7jwFrkVfzota49SH7qTM5": 1,
		"64_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": 1,
		"11_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA": 1,
		"18_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE": 1,
		"19_1M3Cd4ukoi5yU564r4azCetBEGscFnRRtE": 1,
		"16_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA": 1,
		"19_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA": 1,
		"18_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA": 1,
		"2_1Dif4FhYssQJCe7hFdSDpVbrxEVmFvtYzz": 1,
		"4_1Dif4FhYssQJCe7hFdSDpVbrxEVmFvtYzz": 1,
		"1_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn": 1,
		"12_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni": 1,
		"10_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni": 1,
		"2_1DQEnGcUy5NUYKZFyptQMBrcDsGW6hbKpe": 1,
		"1_12vGFdk1Ur5rE7PqeGRzs5GwDg2Fmb1YDA": 1,
		"4_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn": 1
	}
}