{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "脑控技术专利摘要\n张学知--脑控武器受害者\n2013-12-23 13:40\n在国家知识产权局查询到的专利，明确表明了，通过同步脑电波，可以改变人的精神状态，也可以通过脑电波把思维显示在显示器上，以实现和他人的交流。\n民间发明家已经可以做到这一步，我们的政府和军事科研机构所掌握的脑电波技术更加超出人们的想象\n一、利用脑电波与其他人交流的方法与装置 “无声对话装着”\n申请（专利）号：201010189024.8\n大中小 ： 申请公开说明书 （4）页\n申 请 号： 201010189024.8 申 请 日： 2010.06.02\n名 称： 利用脑电波与其他人交流的方法与装置\n公 开 (公告) 号： CN101872242A 公开(公告)日： 2010.10.27\n主 分 类 号： G06F3/01(2006.01)I 分案原申请号：\n分 类 号： G06F3/01(2006.01)I;A61B5/16(2006.01)I\n颁 证 日： 优 先 权： 申请(专利权)人： 于潇洋\n地 址： 100036 北京市海淀区莲花小区1-4-503 发 明 (设计)人： 于潇洋 国 际 申 请：\n国 际 公 布： 进入国家日期： 专利 代理 机构： 代 理 人：\n摘要\n本发明“利用脑电波与其他人交流的方法与装置”涉及人与人之间交流的方法与装置。本发明解决了普通人之间只能通过语言或动作进行交流的问题，使得普通人之间还可以通过脑电波进行一些交流。本发明包括以下步骤：利用用户携带的脑电波检测器，检测用户的脑电波；根据检测到的脑电波，控制用户携带的、面向其他人的显示设备上显示的内容。\n二、 模拟思维及睡眠脑电波的装置 “控制他人思维和进入睡眠”\n申请（专利）号：97106813.5\n大中小 ：申请公开说明书 （9）页\n申 请 号： 97106813.5 申 请 日： 1997.01.15\n名 称： 模拟思维及睡眠脑电波的装置\n公 开 (公告) 号： CN1166366 公开(公告)日： 1997.12.03\n主 分 类 号： A61N2/04 分案原申请号： 分 类 号： A61N2/04;A61M21/00\n颁 证 日： 优 先 权：\n申请(专利权)人： 唐健 地址：210018江苏省南京市太平北路136号三楼知识产权部\n发 明 (设计)人： 唐健 国 际 申 请： 国 际 公 布： 进入国家日期：\n专利 代理 机构： 东南大学专利事务所 代 理 人： 沈廉; 王之梓\n摘要\n模拟思维及睡眠脑电波的装置是一种模拟正常人思维、睡眠、兴奋时的脑电波，诱导大脑的脑电波与其同步，从而达到提高思维效率和睡眠质量的装置，该装置由模拟脑电波发生器、α、β、δ波形转换器、时序电路、调幅信号发生器、功率放大器、指示电路、耦合线圈、电源电路所组成，时序电路通过α、β、δ波形转换器与模拟脑电波发生器相接，模拟脑电波发生器的电源端与调幅信号发生器输出端相接，输出端接功率放大器和指示电路，功率放大器的输出端接耦合线圈。\n三、平战两用脑电节律调节仪 “诱导人体尽快进入预想精神状态的效果”\n申请（专利）号：200820224769.1\n大 中 小 ： 实用新型说明书 （8）页\n申 请 号： 200820224769.1 申 请 日： 2008.12.01\n名 称： 平战两用脑电节律调节仪\n公 开 (公告) 号： CN201320347 公开(公告)日： 2009.10.07\n主 分 类 号： A61N2/04(2006.01)I 分案原申请号：\n分 类 号： A61N2/04(2006.01)I 颁 证 日： 优 先 权：\n申请(专利权)人： 刘 毅;张金涛;王永清 地 址： 271000山东省泰安市虎山东路5号\n发 明 (设计)人： 刘 毅;张金涛;王永清 国 际 申 请： 国 际 公 布： 进入国家日期：\n专利 代理 机构： 泰安市泰昌专利事务所 代 理 人： 高军宝\n摘要\n本实用新型提供了一种平战两用脑电节律调节仪，包括控制器、显示器、晶振器、控制信号输入装置、功率放大器和电磁耦合器，其中显示器、晶振器、控制信号输入装置、功率放大器分别连接在控制器的相应接口上，电磁耦合器连接功率放大器。本实用新型通过人为干预调节人体脑电波的频率，从而诱导人体尽快进入预想精神状态的效果，而且不使用任何药物，不存药物在依赖性，对人体无副作用，使用方便、安全可靠。\n四、植入式神经微刺激和采集遥控芯片\n申请号/专利号： 200710156513\n本发明公开了一种植入式神经微刺激和采集遥控芯片。包括脑神经电刺激和采集模块、神经微刺激和采集电极阵列、上行无线射频通讯模块、下行无线射频通讯及能量耦合电源模块；整个遥控装置至于人及动物脑内；下行无线射频通讯及能量耦合电源模块获取外界传入的指令，解析后控制脑神经电刺激和采集模块，产生刺激信号并利用射频能量耦合原理负责整个植入式芯片遥控装置的能量供给；上行无线射频通讯模块将脑神经电刺激和采集模块传入的神经电信号无线传输出；本发明通过在人及动物脑内植入芯片，可以使得对人及动物的生理信号获取以及控制的系统更加小型化，减少外界装置对人及动物的影响，同时在未来可实用的领域增加隐蔽性和质量安全性。\n申 请 日： 2007年11月06日 公 开 日： 2008年05月28日\n授权公告日： 2010年06月09日 申请人/专利权人： 浙江大学\n申请人地址： 浙江省杭州市西湖区浙大路38号\n发明设计人： 叶学松;陈默;王鹏;王清波;刘俊;郑筱祥\n专利代理机构： 杭州求是专利事务所有限公司\n代理人： 林怀禹 专 利 类 型： 发明专利\n分类号： A61N1/05;A61N1/00;A61B5/0476;H04B7/00;G08C17/02;G08C19/00;A01K15/02\n点此查看跟该专利相关的 主附图\\公开说明书\\授权说明书\n五、利用脑电波直接控制功能性电刺激器的方法\n申请号/专利号： 200510126360\n本发明属于肢残人康复医疗器械技术领域，其特征在于该方法依次含有以下步骤：预先定义功能性刺激器的Ｎ种刺激配置方案，同时定义Ｎ类不同的思维活动，以及它们之间的对应关系；受试者进行Ｎ类不同思维活动中的一种，由计算机分析出当前的思维活动类别码；由定义好的对应关系得出对应的功能性电刺激器的功能选择码，及对应配置方案中的一组刺激参数；将这组刺激参数分别送入通用的功能性电刺激器的相应的参数设置端，实施相应刺激以实现相应肢体的运动功能，如抬手、迈脚等。与传统功能性电刺激的控制方法相比，本发明可以帮助患者用自己的自主意识来控制功能性电刺激，从而恢复部分运动功能，而不需要其他人帮助。\n申 请 日： 2005年12月08日 公 开 日： 2006年07月19日\n授权公告日： 申请人/专利权人： 清华大学\n申请人地址： 北京市北京100084-82信箱 发 明 设 计 人： 高小榕;高上凯;张志广;洪波\n专利代理机构： 代理人：\n专利类型：发明专利 分类号： A61N1/00;A61N1/36;A61B5/0476;G06F19/00\n申 请 号： 97123268.7 申 请 日： 1997.12.18\n名 称： 一种动磁场穿透神经中枢方法及神经信号调节仪\n公 开 (公告) 号： CN1220172 公开(公告)日： 1999.06.23\n主 分 类 号： A61N2/02 分案原申请号：\n分 类 号： A61N2/02 颁 证 日： 优 先 权：\n申请(专利权)人： 梁晓新\n地 址： 161006黑龙江省齐齐哈尔市卜奎北大街北关小区44号石油劳动服务公司\n发 明 (设计)人： 梁晓新 国 际 申 请： 国 际 公 布： 进入国家日期：\n专利 代理 机构： 代 理 人：\n摘要\n本发明是以磁发生圈中的动磁场受偏磁磁极影响，穿透性作用于人体神经中枢，纠正人体内生物电信号错误的方法。神经信号调节仪是以微弱磁场作用于中枢，调整脑—脊神经中枢整合后错位的信号均衡点的装置。它的特点是，以一定频率组合的磁场穿透脊椎，就可治疗全身任何部位的疾病。目前临床证明，它首治中西医都难以治愈的银屑病，对治疗心肌缺血、顽固性便秘、腰胸骨质增生有奇效，它能独立治疗内、外科的多种疾病，安全并无副作用。\n六、基于听觉认知神经信号的自主意愿表达方法\n“过发声设备把相应的表达意愿的语音播放出来。”\n申 请 号： 200910076208.0 申 请 日： 2009.01.05\n名 称： 基于听觉认知神经信号的自主意愿表达方法 公 开 (公告) 号： CN101464729\n公开 (公告)日： 2009.06.24 主 分 类 号： G06F3/01(2006.01)I\n分 案 原申请号：\n分 类 号：\nG06F3/01(2006.01)I;G06F3/16(2006.01)I;A61B5/0476(2006.01)I;A61B5/04(2006.01)I;G10L15/08(2006.01)I\n颁 证 日： 优 先 权： 申请(专利权)人： 清华大学\n地 址： 100084北京市100084-82信箱 发 明 (设计)人： 洪 波;高上凯;高小榕;郭 婧\n国 际 申 请： 国 际 公 布： 进入国家日期：\n专利 代理 机构： 北京众合诚成知识产权代理有限公司 代 理 人： 朱 琨\n摘要\n基于听觉认知神经信号的自主意愿表达方法涉及残疾人辅助和人机交互领域，其特征在于该方法依次含有以下步骤：将所需要的意愿码本输入计算机，其中的语音索引是简短的中英文或数字语音，索引内容是完整意愿表达的语音；在用户头顶稍后位置安放脑电检测电极；由计算机按照随机顺序反复播放码本索引语音组成的声音序列；用户注意要选择的目标意愿对应的索引语音，并进行声音属性的识别；用脑电放大器记录脑电波，按照索引语音的时间起点分段对齐脑电波形，检测是否存在晚期正成分LPC及相关特征波形；出现特征波形的脑电波对应索引语音定为目标索引，通过意愿码本查找到对应的索引内容，并通过发声设备把相应的表达意愿的语音播放出来。\n申 请 号： 201010128031.7 申 请 日： 2010.03.19\n名 称： 基于神经信号再生的生物感觉传递及控制方法\n公 开 (公告) 号： CN101816550A 公开(公告)日： 2010.09.01\n主 分 类 号： A61B5/00(2006.01)I 分案原申请号：\n分 类 号： A61B5/00(2006.01)I;A61B5/04(2006.01)I;A61N1/36(2006.01)I\n颁 证 日： 优 先 权： 申请(专利权)人： 东南大学\n地 址： 210096 江苏省南京市四牌楼2号 发 明 (设计)人： 王志功;吕晓迎;黄宗浩;李文渊;沈晓燕\n国 际 申 请： 国 际 公 布： 进入国家 日期：\n专利 代理 机构： 南京经纬专利商标代理有限公司 32200 代 理 人： 奚幼坚\n摘要\n本发明公开了一种基于神经信号再生的生物感觉传递及控制方法，该方法将近端神经电极从近端生物体的不同神经上探测的感觉神经信号和运动神经信号经过包括放大、滤波、A/D转换在内的近端信号处理电路后输入计算机，然后通过通信传输至远端，经过包括单片机、D/A转换、激励电路在内的远端信号处理电路转换成电流信号并通过远端神经电极施加于至少另一生物体的对应相同神经上，分别重建出近端生物体上的感觉神经信号和运动神经信号，使远端生物体获得相同的感觉，或者在重建运动神经信号的作用下，控制远端生物体肌肉产生相应的动作，实现不同生物体之间感觉的传递与不同生物体之间运动的控制。\n七、单神经元及多神经元集群间神经信号传递特性探测装置\n“人体大脑思维主要是靠神经元进行冲动传递进行思维的”\n申 请 号： 200710191698.X 申 请 日： 2007.12.14\n名 称： 单神经元及多神经元集群间神经信号传递特性探测装置\n公 开 (公告) 号： CN101181158 公开(公告)日： 2008.05.21\n主 分 类 号： A61B5/04(2006.01)I 分案原申请号：\n分 类 号： A61B5/04(2006.01)I;G01N33/48(2006.01)I 颁 证 日：\n优 先 权： 申请(专利权)人： 东南大学\n地 址： 210096江苏省南京市四牌楼2号 发 明 (设计)人： 王志功;吕晓迎;潘海仙\n国 际 申 请： 国 际 公 布： 进入国家 日期：\n专利 代理 机构： 南京经纬专利商标代理有限公司 代 理 人： 陆志斌\n摘要\n本发明公开一种单神经元及多神经元集群间神经信号传递特性探测装置，其特征在于包括按照阵列分布的电极单元，该电极单元包括：激励电极和探测电极，在激励电极和探测电极上分别连接有激励控制开关和探测控制开关。与现有的技术相比，本发明具有以下优点：本发明将使每个电极点的工作状态可控的同时，大幅度减小电极对外引出线的数目，克服了随着电极阵列数目的增加引出线数目受限制的弊端。本发明可实现单个神经元胞体、树突与轴突等各结构之间和神经元集群之间信号传递特性的微观研究。\n八、液体神经信号探测/激励的电极、双电极、电极阵列及制备方法\n申 请 号： 201010120386.1 申 请 日： 2010.03.09\n名 称： 神经信号探测/激励的电极、双电极、电极阵列及制备方法\n公 开 (公告) 号： CN101816549A 公开(公告)日： 2010.09.01\n主 分 类 号： A61B5/00(2006.01)I 分案原申请号：\n分 类 号： A61B5/00(2006.01)I;A61N1/05(2006.01)I;A61N1/36(2006.01)I\n颁 证 日： 优 先 权： 申请(专利权)人： 东南大学\n地 址： 210096 江苏省南京市四牌楼2号 发 明 (设计)人： 吕晓迎;王志功;卢杰妍\n国 际 申 请： 国 际 公 布： 进入国家日期：\n专利 代理 机构： 南京经纬专利商标代理有限公司 32200 代 理 人： 黄雪兰\n摘要：\n本发明公开了一种神经信号探测/\n激励的电极、双电极、电极阵列及制备方法。所述电极包括针体，下部为针尖和上部为针柄的针灸针，在针尖以上、针柄以下的针体上涂有绝缘层；材料采用环氧树脂与聚酰亚胺复合物，设置方法为：先以摩尔比1∶1的4，4’-二氨基二苯醚和均苯四甲酸酐在0℃冰浴中聚合得到聚酰胺酸，再在聚酰胺酸中按照在每20ml聚酰胺酸中加入1g环氧树脂的比例加入环氧树脂，搅拌，使溶液均一透明，得到环氧树脂与聚酰胺酸的复合物溶液，用甩膜机通过甩膜使针灸针的针体包覆一层环氧树脂与聚酰胺酸的复合物，置于烘箱中先置125℃烘1h，再置250℃烘1h，在针体上形成作为绝缘层的环氧树脂与聚酰亚胺的复合物。??\n九、脊髓神经信号长期探测与激励电极的定位方法\n申 请 号： 200910185419.8 申 请 日： 2009.11.09\n名 称： 脊髓神经信号长期探测与激励电极的定位方法 公 开 (公告) 号： CN101703398A\n公开(公告)日： 2010.05.12 主 分 类 号： A61B5/04(2006.01)I\n分案原申请号： 分 类 号： A61B5/04(2006.01)I\n颁 证 日： 优 先 权： 申请(专利权)人： 东南大学\n地 址： 210096 江苏省南京市四牌楼2号 发 明 (设计)人： 王志功;吕晓迎;沈晓燕;黄宗浩\n国 际 申 请： 国 际 公 布： 进入国家日期：\n专利 代理 机构： 南京经纬专利商标代理有限公司 32200 代 理 人： 黄雪兰\n摘要\n本发明公开了一种脊髓神经信号长期探测与激励电极的定位方法：步骤a：采用专用的骨钻在脊椎骨上钻出按要求分布的孔，步骤b：利用微电极推进器将针灸电极通过各开孔插至待探测或激励的脊髓神经上，步骤c：在插入了针灸电极的孔中再插入圆锥形的牙胶尖，使针灸电极得到固定。与现有技术相比，本发明方法创伤小，操作简单，使用灵活且能实现任意要求的三维电极分布，电极截短后可大体与骨表面平，以便于掩埋在皮肤下，既不受碰撞，不损伤皮肤，也不损伤电极本身，安全可靠。\n十、神经元及多神经元集群间神经信号传递特性探测装置\n申 请 号： 200810196369.9 申 请 日： 2008.09.03\n名 称： 神经元及多神经元集群间神经信号传递特性探测装置\n公 开 (公告) 号： CN101349691 公开(公告)日： 2009.01.21\n主 分 类 号： G01N33/48(2006.01)I 分案原申请号：\n分 类 号： G01N33/48(2006.01)I;G01N27/00(2006.01)I\n颁 证 日： 优 先 权： 申请(专利权)人： 东南大学\n地 址： 210096江苏省南京市四牌楼2号 发 明 (设计)人： 王志功;吕晓迎;潘海仙\n国 际 申 请： 国 际 公 布： 进入国家日期：\n专利 代理 机构： 南京经纬专利商标代理有限公司 代 理 人： 陆志斌\n摘要\n本发明公开了一种用于探索单个神经元各部位和神经元集群之间神经信号传递特性的装置，包括按照阵列分布的电极单元、该电极单元包括激励电极和探测电极，在激励电极和探测电极上分别连接有激励控制开关和探测控制开关，还包括一用于控制激励控制开关和探测控制开关的电极单元选择电路。本发明采用电极单元选择电路连接电极单元的控制开关，即激励控制开关和探测控制开关，从而对电极单元进行选择控制，减少了电极单元的激励控制开关和探测控制开关引出线的总数目，在实现电极点工作状态可控的同时，大幅度减小电极对外引出线的数目，克服了电极阵列的数目受限于引出线数目的问题。\n胡文礼脑控实验者。被脑控18年妈妈植物人。36了。没工作。处男可怜呀。36年没上班。\n电话15663861217\n13359867209\n13206657585",
			"post_id": 1,
			"date_added": 1497457878
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}