{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1566086206_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 1,
				"body": "XD this is amazing",
				"added": 1566160754
			},
			{
				"comment_id": 4,
				"body": "> [allballsnobrawn](#comment_8_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD): The program probably use speech recognition on Petersons extensive collection of YouTube videos and podcasts, so any word he has used are catalogued and split up into individual sound-snippets that will be patched together kinda like a ransom letter ... some transition filtering is probably included, to level out any pitch differences and such...Unless he has used a lot of juicy profanities ( I kinda doubt that he has...) it's not going to be either available, or very good/real sounding...\n\nPeterson seems to be a good test subject because he usually spaces out each word so you can clip words together without making them sound unnatural",
				"added": 1566169845
			},
			{
				"comment_id": 12,
				"body": "> [allballsnobrawn](#comment_9_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD): I suppose we all need to get smarter when dealing with certificates and watermarking / owning everything we create or communicate digitally / online. The technology exists. Isn't that how YouTube identifies songs that show up in the wrong places ? Rambalac has high-res videos of him walking around different places in Japan, and if he walks past some place playing copyrighted music on the street, YouTube algorithms detect it and mutes the sound, until it is no longer audible. [...]\n\nFuck outa here with your ads",
				"added": 1566171921
			},
			{
				"comment_id": 13,
				"body": "> [allballsnobrawn](#comment_10_1Kz61HMH26hFwXwRzJoMbHePywcgLCG9fD): The first ad on ZeroNet... awesome ... where do I collect my shekels ?\n\nAuschwitz",
				"added": 1566172472
			}
		],
		"1566158607_1D7oqjJnnaxiFti8Kk3qQQx76L2v9ne9t4": [
			{
				"comment_id": 2,
				"body": "fuck off the real one could just move his money",
				"added": 1566160852
			},
			{
				"comment_id": 3,
				"body": "> [filips](#comment_146_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Or at least sign a message with original private key containing current date (to prevent just copying real old signatures).\n\nat this point if satoshi isn't a nwo sea person who will bring the second comming of Christ i will be disappointed",
				"added": 1566169777
			}
		],
		"1566155811_12wsdvQbd5L9bTBKXGgYazbFcHNegJUNfG": [
			{
				"comment_id": 5,
				"body": "cuz its a per to per service that not many use due to zeronet not being anonymous and free you tube steaming being a thing",
				"added": 1566169987
			}
		],
		"1566074416_1PGDKdsYUcJajEbqqgb91pJp1rUzznwGvU": [
			{
				"comment_id": 6,
				"body": "> [kidcourageous](#comment_24_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Thanks homie\n\nOkay commie fag, putin is a shit leader that manages to lead the slavs into poverty",
				"added": 1566170224
			},
			{
				"comment_id": 8,
				"body": "> [kidcourageous](#comment_30_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): -> a7eec: Okay commie fag, putin is a shit leader that manages to lead the slavs into poverty [...]\n\nslavs are basically Prussians the Prussians were the master race",
				"added": 1566171288
			},
			{
				"comment_id": 10,
				"body": "> [xlk](#comment_92_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Slavs are fucking awesome. The Slavs that come to China are much higher class than the Westerners that come here. YYYuge difference. Also White as fuck, many are blondes and most have blue eyes.\n\nmost seem to forget that more slavs were purified than jews in the holocaust plus the weakest half were killed in war leaving only Aryans behind",
				"added": 1566171755
			}
		],
		"1566044615_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 7,
				"body": "> [caryoscelus](#comment_201_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Eventually, if 0net will keep growing, we'll just have specialized communities; overall usage increase is good even if it increases stupid post count in short term. But yeah, it can be a bit annoying meanwhile\n\non the other hand tho the more people that come in the more likely that some will be pedos and the idea that some bad files could get on your computer could ether make users uncomfortable to leave their computer on with help distribute new files settings or make trigger happy lawmakers such as the eu try to ban things like zero net",
				"added": 1566170451
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_606_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You're missing a 8 from your username.\n\nhot take",
				"added": 1566171351
			}
		],
		"1566171789_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 11,
				"body": "the most bruv here me out stoned comment ever",
				"added": 1566171844
			},
			{
				"comment_id": 14,
				"body": "> [223556](#comment_168_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): They're inspiring tbh [...]\n\ni think Hitlers Germany already proved that the establishment are actually weak anyone can become a politician but few can actually make their own nation and those without nation building skills face nation builders they are no match",
				"added": 1566173768
			}
		],
		"1566178418_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 15,
				"body": "skitzos m8 im one i see them and they talk to me occasionally but they are not nwo sea people it is very explainable",
				"added": 1566188919
			}
		],
		"1566595857_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 16,
				"body": "Purchase data and purchase trends so they can more effectively advertise to people",
				"added": 1566600094
			}
		]
	},
	"comment_vote": {}
}