{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1524150545_1ErQYVi5mdM9hGb6uT4jg8iwGxcJBJYX8h": [
			{
				"comment_id": 1,
				"body": "\"measureable intelligence\" in guppies has been proven to be easily manipulated by breeding \"high iq\" guppies with each other, making even smarter guppies. Also genetic tests do find differences in specific genes between the races, allowing things like \"23andme\" to happen where they can tell you all of your genetic/racial diversity through specific genes you have inherited.\nI do kind of hate how everyone points at animals to compare them to humans though. \"Clownfish change genders, so why shouldnt we?\" Dolphins also rape each other, and frogs are cannibals, should we follow them too?",
				"added": 1525151037
			},
			{
				"comment_id": 2,
				"body": "> [spukkinfaceship](#comment_11_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): is there a scientific term for the disorder whereby self-identified \"white\" people think they are somehow better than everybody else?\n\nWhite people are the only people not \"allowed\" by general society to have a racial identity. Blacks, hispanics, jews, etc have very large in-group preferences. Something like 90% of hispanics use \"hispanic\" as their primary identity (as opposed to democrat, american), where as whites only do it about 30% of the time.",
				"added": 1525152654
			},
			{
				"comment_id": 3,
				"body": "> [renalec](#comment_9_1KCJ86Jg3LNBpHxcaRojsHTg9Qme9vuV1j): I see a fair few of your links are from the \"New Century Foundation\". Lead by a self-described white separatist. But hey, at least he isn't an anti-Semite as well. That's good, I guess.\n\nThat's not even an argument. Just because you're parents did some things you disagree with doesnt mean that everything they do/say is wrong. The same applies to other people. Hitler himself led germany towards environmental cleanliness, constructing dams for hydroelectric power. Does that mean \"green\" stuff is bad by default?",
				"added": 1525238625
			}
		],
		"1525103644_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP": [
			{
				"comment_id": 4,
				"body": "I hope that you frogs can kick out all of your darkies one day. God-speed",
				"added": 1525241010
			},
			{
				"comment_id": 5,
				"body": "Look at Italy, they got tired of all the \"refugees\" and managed to elect a conservative leader that pushed for stricter immigration policies. There may be hope for europoor countries",
				"added": 1525242737
			}
		]
	},
	"comment_vote": {}
}