{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1548608778,
			"title": "Robbanóanyag, petárda gyufából (Armstrong mixture)",
			"body": "A leg egyszerűbb robbanóanyag sima gyufából amit bárki elkészíthet.",
			"added": 1548608774,
			"parent_topic_uri": "1538011472_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV"
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1541081558_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [],
		"1548599511_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": [],
		"1544294712_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [],
		"1543484518_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [],
		"1548608778_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": [
			{
				"comment_id": 5,
				"body": "#Robbanóanyag,petárda gyufából (Armstrong mixture)\n\nA leg egyszerűbb robbanóanyag sima gyufából amit bárki elkészíthet.\n\nGyufa mix (Armstrong mixture) Hozzávalók\n\n\n#Kés\n#Penge\n#Gyufásdoboz\n#Gyufafejek\n#Védőeszközök: szemüveg, kesztyű, füldugó.\n#A hatékonyabb változathoz mozsár ha van\n...................................................................................................\n\n#FIGYELEM A KEVERÉK RENDKÍVÜL ÉRZÉKENY ÉS ÉRINTÉS HATÁSÁRA,AKÁR MOZGATÁSRA IS KÉPES ELINDULNI!\n...................................................................................................\n#Az elkészítés\n\nAz elkészítéséhez nem kell más mind gyufa és gyufásdoboz. Pengével a gyufásdoboz oldaláról le kell vakarni a vörös foszfort. És a gyufafejről finom por formában óvatosan a gyufamérget. Majd ezt 1:1 arányban összekeverni. Minél finomabb a két por annál hatásosabb lesz a keverék. A leg hatásosabb változat úgy készül hogy a gyufásdoboz oldalán lévő anyagot miután pengével levakarom, mozsárban még sűrű finom porrá őrlöm. A védelem fontos!: szemüveg, kesztyű! Majd a mozsarat kimosom, mert ha a két anyag nyomokban találkozna akkor azonnal gyullad, csattan amit mozsarazok. Ha tiszta a mozsaram azonos mennyiségű gyufafejet óvatosan nehogy kigyulladjon finomra őrlöm. Ha ez megvan a két összetevőt papíron összefogatom. Vigyázat ekkor már egy érintés is elég neki hogy magától elinduljon! \n\n#Hogyan működik?\n\nA gyufa fejében kálium-klorát található tüzelőanyagokkal, ragasztóanyaggal. A gyufa oldalán vörös foszfor. A két anyag KClO3+Vörösfoszfor nagyon hevesen reagál egymással. Az adalék anyag és a ragasztó a legtöbb reakcióban problémát jelentene, de itt ez nem valósul meg.A két keverék összekeverve nem lassan,hanem puffanva ég el!\n\n#Hogyan használjam fel?\n\nBármibe belerakod az robban! Én régen műanyag tollbetéteket használtam, és időzítésre durván vakart gyufafejeket használtam. Ezeket mindig jól lepréseltem hogy lassan égjenek. Ha gyufamérget pici vízzel keversz egy késhegyről cseppentve az megszáradva egy dörzsfejet ad amit gyufás doboz oldalán is meggyújthatsz. Műanyag pálcika, befőttesgumi, étolajba áztatott madzag lehet időzítés. A legjobb fojtásnak nyilván a papír ami nem repeszképző. De ami fontos fém testbe soha ne rakjuk, ugyan is az repeszel.\n\n#Hogyan töltsem be?\n\nA védelem nagyon fontos!: Egy úszószemüveg, vastag kesztyű, füldugó. Figyelni kell hogy ne érjünk kezünkel soha a tubusnál oda ahol a robbanóanyag van. Én két gyufásdobozt raktam egymásra. Kilyukasztottam a gyufásdobozokat, majd beleraktam a tubust amibe töltöttem az anyagot. Vagy pedig késsel a földbe csináltam egy lyukat és abba raktam a tubust, majd földel ismét körbepréseltem. Ezt ha celofánba rakjuk a tubus nem lesz földes. Ez megoldható egy tejfölösdobozban is. Ezután erre ragasztószalaggal egy hurkapálcikát, vagy hosszúszálú gyufát raktam. Ezt a pálcikát fogtam meg és nem a tubust VÉDŐKESZTYŰBEN. Így ha mégis eldurran beletöltés közben nem a kezemben durran el! Viszont fontos hogy ne csúszkáljon betöltésnél amit csináltam. A port bele kell egyszerre önteni majd óvatosan lenyomkodni amíg hagyja magát. De erőltetni nem szabad. Kicsiben akár egy gyufaszál és alufólia közé is tekerhetjük, majd időzített gyújtással elindíthatjuk.",
				"added": 1548608804
			}
		]
	},
	"comment_vote": {}
}