{
	"title": "cock xu",
	"description": "My Blog.",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 3,
	"demo": false,
	"modified": 1497147761,
	"post": [
		{
			"post_id": 2,
			"title": "another big swinging dick, down.",
			"date_published": 1497147720.98,
			"body": "6月7日，中国证券投资基金业协会将徐翔和他的泽熙“拉黑”，取消了基金行业从业资格。\n\n　　再联想到今年早些时候徐翔被判处有期徒刑五年六个月，同时并处110亿元罚金。至此，这个用了20年时间完成从散户到私募、再到上市公司控股股东“蜕变”的资本玩家，盖棺定论，彻底沦为传说。\n\n　　公开披露的“私募一哥”案底包括：“实际控制139个账户，与13家上市公司董事长或实控人合谋操纵股价，涉及76个自然人和1个合伙企业。”\n\n　　小伙伴们先不要震惊，判决书之外，徐翔还做了很多。经济ke带大家关注一家已经被徐翔“占领”多时的中关村(000931,股吧)老牌上市公司大恒科技(600288,股吧)，看看“野蛮人”徐翔控制之下的大恒科技都遭遇了什么。\n\n　　滑稽\n\n　　徐翔入主大恒科技，要从前不久伏法的青海“首虎”毛小兵说起。\n\n　　被判处无期徒刑的原青海省委常委、西宁市委书记毛小兵曾利用职务上的便利，为另一名隐型资本大鳄江彪，在西部矿业(601168,股吧)的股权收购上提供便利，谋取利益。江彪曾担任西部矿业副董事长、中国新纪元有限公司董事长。新纪元正是徐翔入主前大恒科技的控股股东。\n\n　　毛小兵在2014年4月24日被宣布接受组织调查后，江彪便开始运作旗下股份转让事宜，以求全身而退。最终，江彪和他的宁波老乡徐翔走到了一起。\n2014年11月24日，中国新纪元将其所持有的大恒科技1.29亿股作价12.02亿元转让给徐翔其母郑素贞，持股29.52%的郑素贞成为大恒科技第一大股东和实际控制人。\n　　2014年11月24日，中国新纪元将其所持有的大恒科技1.29亿股作价12.02亿元转让给徐翔其母郑素贞，持股29.52%的郑素贞成为大恒科技第一大股东和实际控制人。\n\n　　成为大股东后，泽熙人马开始全面接管大恒科技。曾在泽熙任职的鲁勇志等五人分别担任大恒科技董事长、董事和监事，多位出自中科院的大恒元老与企业相伴数十载，却未得“善终”。包括72岁的公司原副总裁兼总工程师宋菲君和原副总裁何建国相继“辞职”。\n\n　　离职过程啼笑皆非。大恒科技公告称：宋菲君由于年事已高、健康欠佳，申请辞去公司副总裁兼总工程师的职务。而宋菲君的“辞职”距他被聘为大恒科技副总裁，仅不到一周。\n\n　　何建国的离职更显滑稽，他的股票账户在四日之内买进买出自家股票，成交金额17700元，构成短线交易、年报窗口期交易。随后何建国提出辞职。\n\n　　年龄和违规短线交易原因似乎只是创业元老们离去的说辞。和A股市场曾经发生过的无数桥段类似，原班底与泽熙在发展规划、用人、企业文化等方面的格格不入，是这场离职闹剧的根本原因。\n\n　　“他们完全违背企业发展的规律，凭空臆想提出太高的财务指标，强求大恒在很短时间内要翻几番，让我想起大跃进的时候。”宋菲君对野蛮人的印象始终停留在资本上，他告诉《中国经济周刊》，“他们满嘴都是资本，他们就觉得资本是万能的。”\n\n　　当大恒的董事会变为泽熙内部会议时，一个并不了解实业，对公司管理和具体业务均无经验的团队，选择了最擅长的事情，用实业做筹码圈取更大的资本，谋取个人或小集团的利益。\n侠客岛：私募一哥徐翔除了操纵股市 远比你想象的更嚣张\n\n\n　　野蛮人\n\n　　徐翔入主大恒科技后，下出的第一步棋便是“做局”贱卖资产。\n\n　　2014年12月16日，大恒科技将控股子公司宁波明昕微电子以近7000万元的价格转让给吴建龙，但同时反手以1.7亿元的价格收购控股子公司旗下的资产。\n\n　　事实上受让“大礼”的吴建龙与徐翔早有“交集”。吴建龙曾担任浙江向日葵光能科技股份有限公司董事长，此人曾创记录，在五个工作日合计减持12.6亿元，成为创业板套现第一人。\n\n　　巧合的是，吴建龙减持的12.6亿元股票，几乎都由徐翔接盘。\n侠客岛：私募一哥徐翔除了操纵股市 远比你想象的更嚣张\n\n\n　　吴建龙\n\n　　宁波明昕虽然连年亏损，但是其厂房土地价格却一直飞涨，这或许是这块资产的最大诱惑。据说明晰的地在宁波市中心区域，地价就值几个亿，却以7000万卖给一个个人。\n\n　　此中缘由，明眼人一看便知。\n\n　　徐氏风格的“大动作”接踵而至，杠杆收购+业务重整的“市值管理”套路很快浮出水面。2015年1月15日，大恒科技宣布拟实施30亿元的定向增发，若此次发行完成后，郑素贞将占发行后总股本的58.72%。\n\n　　30亿的数字震惊了大恒上下，几乎所有人都认为如此大规模定增脱离实际。很多高管向《中国经济周刊》回忆当时的情景称，“我们都觉得30亿有些夸张，十几个亿比较靠谱。”\n\n　　在董事会的坚持之下，这一数字被多个业务部门分解，有的业务单元原本可能只需要几个亿，无奈之下却最终编制了十几个亿的定增任务。\n\n　　面对如此“定增”，不妥协者如大恒旗下中科大洋科技股份有限公司，其命运则是董事长姚威被迫“下课”。\n\n　　定增的真实目的是什么？按高管们的分析，如果定增成功，只有一小部分钱会用于大恒科技的业务发展，剩下的大头都会用作兼并重组。“野蛮人”是要靠资本运作来赚钱的。\n\n　　从这个角度看，实业只是“野蛮人”用以圈取更大资本的筹码。据中国证券投资基金业协会披露，在东方金钰(600086,股吧)的定增中，徐翔与东方金钰时任董事长赵兴龙合谋定向增发，徐翔在二级市场拉抬股价，赵兴龙配合发布利好。最终徐翔将定增股票抛售获利获利近10亿元。\n\n　　危险的“定增”一度距成功触手可及。2015年10月30日，大恒科技公告显示，证监会审核通过了公司定增方案，彼时尚在等待证监会书面核准文件。仅仅两天之后剧情便出现巨大反转。随着2015年11月1日徐翔从宁波杭州湾跨海大桥上被司法部门带走，所有的“资本运作”戛然而止。\n\n　　2016年2月16日大恒科技宣布公司定增失败。大恒科技的艰难度日，刚刚开始。\n\n　　困局\n\n　　在徐翔被警方带走后第八天，郑素贞所持有的大恒科技近1.3亿股无限售流通股被公安部门冻结，此后轮候冻结转为正式冻结，解冻期至2018年4月12日。\n\n　　从那时起，与徐翔密切的大恒科技独立董事杨旺翔，董事长、总裁鲁勇志等人陆续失联。“失联”原因正是配合调查他们的老板徐翔。\n\n　　虽然此后这些停留在执行层面的徐翔“打工者”陆续回归，但大股东的股权冻结，直接导致大恒科技融资紧张延续至今。\n\n　　由于徐案，银行从风控角度考虑基本上不愿与大恒科技打交道。从徐翔涉案至今，因为银行抽贷或提前还款，大恒科技业务拓展捉襟见肘。在大股东无法担保的情况下，大恒科技甚至将位于苏州街3号大恒科技大厦写字楼中的公司房产抵押给担保公司贷款，以维持日常运转。\n比业务举步维艰更显冰冷的，是大批骨干人员的离去。以大恒科技旗下核心子公司中科大洋为例，自2015年至今，该公司包括创始人、原董事长兼总裁、主管技术研发的董事副总裁在内的核心技术骨干离职率高达三分之二，其中硬件产品研发团队全部离职。\n　　比业务举步维艰更显冰冷的，是大批骨干人员的离去。以大恒科技旗下核心子公司中科大洋为例，自2015年至今，该公司包括创始人、原董事长兼总裁、主管技术研发的董事副总裁在内的核心技术骨干离职率高达三分之二，其中硬件产品研发团队全部离职。\n\n　　而比徐翔狱中控盘更令人触目惊心的是，大恒困局已经危及国家信息安全。\n\n　　中科大洋作为广电行业龙头企业还承担了大量国家级保密项目，人员变动以及经营管理水平的全面滞后，给中科大洋所承担的众多国家级涉密项目的运营、维护、升级带来很大不确定性。\n\n　　以中央某机构的音像资料存储项目为例。大洋硬发研发团队的全体离开，将会给密级较高的资料系统的维护工作带来巨大隐患，也会对内参系统的硬件维修也带来风险，比如在维修时更换的硬件如存在后门，则会使系统存在信息泄密的巨大安全风险。\n\n　　发生在大洋的困局似乎并不是个案。目前大恒科技多个子公司和事业部已经断了融资来源，靠应收帐款维持，从高管到普通员工都表示前途黯淡。\n\n　　重整\n\n　　如果没有徐翔案，以大恒三十年的发展成果，本身就是科学院科研成果产业化的成功案例。\n\n　　有着浓厚中科院烙印的大恒科技，可以看作是八十年代走过来的中关村企业群像的缩影：骨干几乎都有中科院的渊源，主要发展方向也来自中科院的技术积累，企业文化也沿袭了实事求是的作风。\n\n　　抛开“产业报国”、“脱虚向实”等宏大口号不论，从实践角度讲，把大恒这样现成的产业化公司盘活，比从头培养一个初始阶段的公司要快得多，效果也许好得多。\n\n　　在激烈的市场竞争里，企业往往是不进则退。如果现在这种僵局打破，大恒还很有机会逆转，几年后就很难说了，前文里中科大洋的窘境已足够有说服力。\n\n　　深陷囹圄但依然“控盘”的徐翔仍是解局棋眼。“他可能优先保大恒，实在不得已才会卖。”知情人士透露，也有传闻称目前现状下徐翔家人正在寻找接盘者。\n\n　　徐翔能否缴足天价罚金，直接关系着大恒这样的企业何去何从。经济ke获悉：如果不缴足罚金，法院就会强制拍卖股权；如果能缴足罚金就可以解冻股权，（解冻后）就可以融资、定增，公司正常运转。\n\n　　对徐翔来说，拍卖对他的损失太大，并不是最好办法。因为通常法院拍卖会比正常交易便宜，不排除外来资本乘机“捡便宜”。\n\n　　无论是否拍卖，破解僵局的核心关键当是产权。放大来讲，就是实业需要怎样的资本？\n\n　　这个答案已经是老调重弹了N多次，但经济ke依然愿意与所有人共勉：好的资本一定了解实业，和实业公司有共同语言，只投资不干预，才能真正成为助推企业发展的正能量。一旦用实业做筹码圈取更大的资本，谋取个人或小集团的利益，最终只能毁掉企业。\n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}