{
	"next_topic_id": 19,
	"topic": [
		{
			"topic_id": 1,
			"title": "The Thunder Network – an open sourced payment solution created by Blockchain; the company behind the world’s most popular bitcoin wallet -MyWallet. If it works as advertised; Thunder would be capable of processing up to 100,000 financial transactions a second – if implemented on a large scale. That means somebody could use it quickly create a payment processing network that could rival those of Visa or MasterCard in size and scope. Intriguingly; Thunder’s theoretical capacity exceeds that of Visa’s network, which can process up to 65,000 transactions a second according to some observers. Thunder could be truly disruptive because it is an open sourced platform that any developer can use to create solutions.",
			"body": "",
			"added": 1464877958
		},
		{
			"topic_id": 2,
			"title": "R3 – a consortium of financial giants that includes Barclays, JPMorgan Chase (NYSE: JPM) and Wells Fargo. R3 is developing a blockchain based trading platform and financial network that could greatly speed up the wire transfer of money and assets, Bloomberg reported. This could be truly disruptive because Chase; America’s largest bank, is planning to roll out Chase Pay – a digital wallet similar to Apple Pay – later this year. The combination of Chase Pay and Blockchain could greatly reduce transaction costs.",
			"body": "",
			"added": 1464878110
		},
		{
			"topic_id": 3,
			"title": "The Hyperledger Project – a collaborative effort to create a standard blockchain technology that is being spearheaded by the Linux Foundation. The idea is to create a sort of Linux for blockchain; an open sourced blockchain ledger that is available to all. A number of corporate giants including IBM, Intel, Hitachi, JPMorgan Chase, CME Group, Accenture, DTCC, Fujitsu and the Deutsche Borse Group are involved in Hyperledger. Hyperleader’s goal is to apply blockchain to a wide variety of fields including supply chain, banking, finance, technology and the internet of things. Legendary open-sourced programmer Brian Behlendorf has signed as director to make Hyperledger a reality.",
			"body": "",
			"added": 1464878211
		},
		{
			"topic_id": 4,
			"title": "Gem Health – a blockchain network for medical records and information created by Gem. The idea is to create a secure repository for medical records and to power research by creating a blockchain for hospitals and doctors, Bitcoin Magazine reported. A major motivation for this development is the vulnerability of medical information to cyber predators such as ransomware extortionists. On February 5, hackers used ransomware to seize control of the data in the computer networks at Hollywood Presbyterian Medical Center; a hospital in Los Angeles. The hospital had to pay crooks $17,000; ironically in Bitcoins to get access to its own data, Off the Grid News reported.",
			"body": "",
			"added": 1464878269
		},
		{
			"topic_id": 5,
			"title": "U.S.A's Nuclear Defense Program is run from Floppy Disks",
			"body": "",
			"added": 1464878535
		},
		{
			"topic_id": 6,
			"title": "apple is dying faster than you think",
			"body": "",
			"added": 1464878560
		},
		{
			"topic_id": 7,
			"title": "Similarities Between Tesla and a Failed 1940s Car Company",
			"body": "",
			"added": 1464878601
		},
		{
			"topic_id": 8,
			"title": "Robot Surgeons Are Taking Over not just the Operating Room, but soon Your Bedroom too",
			"body": "",
			"added": 1464878663
		},
		{
			"topic_id": 9,
			"title": "Caltech sues Apple for Wi-Fi patent infringement --- fuk for how long we have not haerd of caltech",
			"body": "",
			"added": 1464878695
		},
		{
			"topic_id": 10,
			"title": "UV LEDs to clean everything from water to surfaces --- is it safe?",
			"body": "",
			"added": 1464878738
		},
		{
			"topic_id": 11,
			"title": "This Woman’s $4.5 Billion Wealth Just Evaporated Into Nothing ---- who is she?",
			"body": "",
			"added": 1464878762
		},
		{
			"topic_id": 12,
			"title": "Xiaomi feeds troll and pays Microsoft patent toll --- fuk i just knew now stooges could be played by two",
			"body": "",
			"added": 1464878968
		},
		{
			"topic_id": 13,
			"title": "yes yes Quantified Vagina: This Startup Aims To Track Women's Health Through Smart Tampons",
			"body": "",
			"added": 1464879112
		},
		{
			"topic_id": 14,
			"title": "Sci-Hub is Blowing Up the Academic Publishing Industry",
			"body": "",
			"added": 1464879621
		},
		{
			"topic_id": 15,
			"title": "Australia to sell £8m of seized bitcoins",
			"body": "",
			"added": 1464879721
		},
		{
			"topic_id": 16,
			"title": "google has a abacus",
			"body": "",
			"added": 1464879776
		},
		{
			"topic_id": 17,
			"title": "US could become the first country to legalize marriage between robot and man by 2040",
			"body": "",
			"added": 1464880301
		},
		{
			"topic_id": 18,
			"title": "'Universal cancer vaccine’ breakthrough claimed by scientists",
			"body": "",
			"added": 1464880394
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}