{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1524327364,
			"title": "CoinCloud",
			"body": "A program, I've written, that allows anyone to up and download files to and from the Bitcoin-blockchain.\nAny file uploaded to the Bitcoin-Blockchain cannot be deleted. It is online(remains available for anyone) for as long as the Bitcoin currency itself is alive.\nDownloading any file is completely free, while the upload of files (unfortunately) does cost money(due to the design of the Bitcoin-blockchain). Downloading a file is harmless and can be justified to any third party since a download is essentially just accessing an transaction in the Bitcoin-blockchain(plausible deniability).\nDownload:\n-(Git Center) http://127.0.0.1:43110/126KYGEVcPaw9u7NKA6ZxqBUgFjGxqpF15\nAlternative (clearnet) links:\n-(Github) https://github.com/CoinCloudGuy/CoinCloud\n-(Gitgud) https://gitgud.io/CoinCloudGuy/CoinCloud",
			"added": 1524327363
		},
		{
			"topic_id": 1529135288,
			"title": "Is there a Bitcoin blockchain api in Zeronet?",
			"body": "As the title says, is there api in Zeronet to access the Bitcoin blockchain?\nBy accessing the blockchain, I mean reading blocks and submitting new blocks, while only making calls through the Zeronet api. I couldn't really find anything, but figured, since Zeronet uses a lot of the Bitcoin crypto, there would have to be api-calls for that somewhere.",
			"added": 1529135286
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1524327364_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": [
			{
				"comment_id": 1,
				"body": "@zeropyro\nThere is a difference here. Steemit uses it's own blockchain(not the Bitcoin one), that is not(entirely) designed to store transactions(be a currency). DTube uses the Steem-blockchain, to store the metadata of the video, but not the video itself. The video itself is uploaded to the ipfs network. The Steem-blockchain just contains the ipfs-file-path to that video, as well as the duration, description, title and so on, this data is red by DTube and then gets converted to a website.\n> Later its impossible to delete or edit those videos\nIronically the opposite is the problem with DTube, since all videos are stored in the ipfs network, videos, that are not watched for some time, will become unavailable. This is due to the design of ipfs(files that are not requested for some time will get purged/replaced by other files on each node, that causes data to be forgotten, if it isn't accessed frequently). You can actually see that: Try watching a video that has been uploaded a month or so ago, by a smaller channel(or even some of the bigger ones). \nThe problem with DTube, is that the video-metadata cannot be forgotten, while the video itself will be forgotten, at some point.\n\nCoinCloud wasn't intended to be used for blogs and the such. I intended CoinCloud to be a statement against censorship of data, **any** kind of data. To me, the very concept of banning or owing data(=some number) is laughable.\nWhat I mean by this, more specifically, can be red over at [millchan](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1H5YxVHvcfKM4STjJwyjYaBe8qbPyR6EZr:b:9ea42cb5-fb15-4de0-a8c3-b7f25fb1af0a).\nTL;DR: CoinCloud is a way of publishing data that cannot sensibly banned by law. (Since to ban just a single piece information, one would have to kill the entire Bitcoin-blockchain)",
				"added": 1524420339
			},
			{
				"comment_id": 2,
				"body": "@qh2fmfoawrup7rb\n\nThanks, however I want to be clear, that this is not(entirely) my idea. I thought about this for a while now and upon seeing [this thread](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1H5YxVHvcfKM4STjJwyjYaBe8qbPyR6EZr:b:9ea42cb5-fb15-4de0-a8c3-b7f25fb1af0a) on millchan I decided to actually implement this. The general idea dates back to around 2009-2010 and more concretely [2013](https://bitcointalk.org/index.php?topic=191039.0) and is, by no means, my invention. After all, credit where credit is due.\n\n> The whole point of bitcoin blockchain is immutability. You extended this nature to other type of data rather than only bitcoin ledger\n\nYes, however the Bitcoin-blockchain has severe limitations on file uploading, some of which are an really high cost for uploading and an file size limit(in the best possible case) of 67,959 bytes (67.959 kB) to name a few(if you want to know why that is, you can read it in the READMEs on [here](http://127.0.0.1:43110/126KYGEVcPaw9u7NKA6ZxqBUgFjGxqpF15)(Git Center, Zeronet), [here](https://github.com/CoinCloudGuy/CoinCloud)(Github, Clearnet) or [here](https://gitgud.io/CoinCloudGuy/CoinCloud)(Gitgud, Clearnet). There are three READMEs in total, one in the start-directory, one in the CoinCloudDownloader-directory and one in the CoinCloudUploader-directory).\n\nIf you wanted to have a blockchain, that is more optimized for files and does not cost you tons of money to upload files to, than [Steemit](https://steemit.com/)(as mentioned below by @zeropyro) is the better solution for you.\nThink of CoinCloud as an last resort, something you use if a file must remain published for as long as possible(or to make a point like I said in the answer post below to @zeropyro).\nIf you want to help this project all you have to do is to spread it.",
				"added": 1524596863
			},
			{
				"comment_id": 3,
				"body": "> [nullbock](#comment_16_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6): The oblivion problem is solved pretty easily: The creators (e.g. famous, pissed off youtube stars, conspiracy ranters like a certain AJ etc.) just have to install a Raspberry Pi at home self hosting the videos indefinitely for dtube, 0n etc.\n\n[I accidentally submitted before writing anything]\nThe thing is, that it is not entirely trivial to setup an pi and installing (and using)ipfs, especially, if you know nothing of technology and programing, like many (famous or not) people do, this will be really frustrating. \nAlso: The effort itself remains an entry barrier, not many are willing to cross, to the average user it is just some video website and, from their point of view, that video website either just works or it doesn't.\nAlso#2: A Raspberry, though cheap, is not free and needs to be bought along with lan-cable, storage and so on. That all will be around 70 bucks, which is already quite some price to pay, for just uploading videos(<-from the perspective of the average user, a pi is much more capable than that, but most won't care for that...).",
				"added": 1524929441
			},
			{
				"comment_id": 4,
				"body": "> Imagine a 300k subscriber explaining what ZN, Freenet or ipfs is\nHowever, that requires a 300k youtuber(or similar) to know about and understand these things, but it probably won't take long, for someone big to seriously consider alternatives, seeing as youtube alone fucks basically anyone on their platform(not to mention youtube = google in the first place). \nEven with all that stuff aside, now with FOSTA/SESTA I think, in general, that P2P nets are the next logical step to take. I kind of enjoy seeing this unfold, since that means people will slowly get away from the 'old internet'. I really can't wait for GNUnet to fix this mess(the current internet), so that almost anything is secure by default and no one has the excuse of 'That is too complicated for me.' or 'I have nothing to hide/fear.' (or similar) anymore!",
				"added": 1525180942
			}
		],
		"1526051818_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 5,
				"body": "> [chikan](#comment_21_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB): Guys, I think there has been a misunderstanding.I'm not a pedophile. I just sell CP .\nDo you mind me asking a question? Why? Why do you sell CP?\nWhat do you expect to gain from it, because selling CP for $0.01 is hardly even worth the 'work' of selecting and sending them.\n\nFor those thinking about buying CP: Please don't. I respect the you would want to see that stuff, but please don't buy it. You can find free CP either on [pedochan](http://127.0.0.1:43110/1P5AXm2CuAf2fx4FxD4iMu8sq8QB7fH8x2/), [millchan/CP/](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1PuqutSyC1dVVBzi7Ce8vAj1wmXrtguprN:CP:0) or on the TOR darknet(search for 'Topic Links').\nPaying for CP would only add money/value to the production of CP, which, in turn, would only cause more people of the 'morally flexible' kind(=/=pedophile), that want some of that money/value, to take action, which leads to abuse and hurt for children. Taking CP for free will crush the 'professional' production of CP, by taking the monetary incentive away.\n\n> [theanswerer0](#comment_38_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): You'll render it unusable and we'll have to fragment the network.\n\nThis frustrates me, every time I read this. It should not be possible to render an network unusable, just by some pixels on the screen. [CoinCloud](http://127.0.0.1:43110/126KYGEVcPaw9u7NKA6ZxqBUgFjGxqpF15/) will soon hopefully resolve this.",
				"added": 1526150526
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 6,
				"body": "It is nice to see, that I can inspire people enough to think about and question this more. I am also surprised at the more positive response to that statement, usually people get really hard to reason with after they read child porn.\n\nAs for me on that topic: I think CP should have never been banned, in the first place. I can only describe it, as a bad hack-job, a bodge, an attempt, to make the problem at hand go away, not an attempt, to solve the underlying issue(or any of the underling issues, for that matter). As a result, we have now something, that will get you in jail, in most countries, around the globe, for having looked(!) at it, regardless of context(or causal connection). In many places, the penalties for that, can be worse than breaking someones spine(irreversibly ruining someones life), or straight up murder. Mix that, with a more than fuzzy definition, on what even constitutes as CP and you have yourself an recipe, for failure and bizarre logical conclusions, that must be enforced as true, in order for that hack-job, of a ban to even make sense. On top of that there are literal billions in money, burned on enforcing, that nearly impossible to enforce, ban on CP, that could be spend on solving the issue at hand, helping the victims of actual abuse or so many other good things and not force the issue to hide away even further.",
				"added": 1527367416
			}
		]
	},
	"comment_vote": {
		"38_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}