{
	"next_comment_id": 6,
	"user_name": "Krixano",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509347414": 1509352311,
		"18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509720456": 1509734836,
		"18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509851753": 1509852354
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "There's some, but it's not that great. I think one of the better ways, even though it can get confusing quick, is to look at existing source code from other zites. The official documentation is here: [https://zeronet.readthedocs.io/en/latest/site_development/zeroframe_api_reference/#plugin-optionalmanager](https://zeronet.readthedocs.io/en/latest/site_development/zeroframe_api_reference/#plugin-optionalmanager)\n\nI looked at ThunderWave's source code to help me build optional file support for ZeroMedium, here: [https://github.com/AnthyG/ThunderWave/blob/master/js/page.js#L420](https://github.com/AnthyG/ThunderWave/blob/master/js/page.js#L420)",
			"post_uri": "18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509678574",
			"date_added": 1509679104
		},
		{
			"comment_id": 2,
			"body": "@P2P: Well, that's for Big Files also. I didn't know if Shouko wanted basic Optional Files, or Big Files on top of that.",
			"post_uri": "18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509678574",
			"date_added": 1509718889
		},
		{
			"comment_id": 3,
			"body": "Did you try ZeroMedium repo, [here](/1BEPbMfV8QtaZCD2cPNbabfDKnmhTAZRPx)? If you did before, can you try again just to make sure? That one should work. If it doesn't, then you can tell @Git Center: there is something wrong. The others won't work yet because there are problems with signing stuff. I was helping @Git Center: with these issues and we found a way to sign the ZeroMedium repo (because the sign and publish button on the actual zite wasn't working for initially signing the repo). It worked for his client, my phone, and bigcat.tk so not sure why it wouldn't work for you.",
			"post_uri": "18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509750910",
			"date_added": 1509820132
		},
		{
			"comment_id": 4,
			"body": "No, that's not the reason. Its because of a signing bug in Git Center.",
			"post_uri": "18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509751014",
			"date_added": 1509820204
		},
		{
			"comment_id": 5,
			"body": "@Shouko: For people who created a repository, they have to sign it properly. If they don't, other people get a content.json error. The blue sign button doesn't work properly. So, to fix this, you must go to your merger zite address (when in `my repos`, right click your repo and click copy link to get this address), but append `/1` to it so it doesn't redirect you to Git Center. You should get a page saying 1 is not found. Ignore that and open the side bar (drag 0 button in top right to the left) and scroll all the way down. Then click Sign and Publish (you don't need to publish if you have no peers).",
			"post_uri": "18GkKhDTQniChKDxcoDgmgrUd7KehaihpW_1509750910",
			"date_added": 1509852113
		}
	]
}