{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1593024956_1NdBeXkKaXNgjNEcSGbd6bMrptXjjeGe6M": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1592974194_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 1,
				"body": "those who still use twitter, facefuck or goolag products clearly deserve to be censored. they are stupid trolls contributing to an authoritarian technofascist project seeking to control the world...",
				"added": 1593026062
			},
			{
				"comment_id": 2,
				"body": "> [z0net](#comment_88_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): Twitter is hand in hand with the government like most social media companies, unfortunately\n\nwhich government? not the one of trump... they are more a ridicule lunatic bunch whose entire wealth and power rest on a few pieces of code that can be so easily forked and improved, making them totally fragile.\n\nand worst as they live in their own little perception bubble, they can't realize how hated they are, for their behaviors, their choices, their total contempt for the foundational value of america (free speech, right to bear arms, justice before the law).\n\nwhat are their aspirations, but to control us, to own and pown our minds, to make us servant and dependent of their easily clone-able platform so that they can impose their domination over our lives to transform us first on digital serfs before encroaching on our lives? \n\nwe will not let that happen, and we will make them pay.\n\nfirst by removing their section 230 exemption. they have become editors. As such they have to face the consequences of the law on their past and present actions. \n\nsecondly, one day we will make all their users ashamed to have become so dependent on the will of those ruling those softwares, making them realize their serfs mindset. \n\nWhen one of your friend or relative propose you something on those enclosed website, please tell them that you won't go see it, and propose them one of the many free and open source alternatives ! and step by step, mind by mind regain control of our digital destiny, so that little tyrants from the silicon mafia are just exposed and remembered as the filth they have become.\n\nbe free, for liberty !",
				"added": 1593067511
			}
		],
		"1593004202_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 3,
				"body": ">qbittorrent is so not trivial easy to hide your IP that it is not even worth mentioning.\n\nstrongly disagree. I find quite easy and wanted to propose this alternative to the op. IDK about Tribler. However don't load too much the tor network with stupid data plz... or run node, exits specially.",
				"added": 1593067638
			}
		],
		"1593027865_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Money :).",
				"added": 1593067664
			}
		]
	},
	"comment_vote": {}
}