{
	"next_comment_id": 32,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [varakin](#comment_1_1BR2d8kCqCBaFWLQ9KXnNbJzLmcPJ3DdTL): Steemit же напоминает пёстрый восточный базар\n\nИнтересно, какие ассоциации с [SSB Patchwork](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:1_1BkgWBWWN9CoXNeEmyyuagid7roJruBVjz/Scuttlebutt) и [RetroShare](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:14_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/RetroShare)? :)\n\n>ZeroNet напоминает открытую площадь\n\nА ещё на ней безлюдно и дует ветер :D Зато есть чувство контроля, что никто не подкрадётся и, пусть людей не много, но всех видно.",
			"post_id": 11,
			"date_added": 1494633465
		},
		{
			"comment_id": 2,
			"body": "> [varakin](#comment_2_1BR2d8kCqCBaFWLQ9KXnNbJzLmcPJ3DdTL): Там френдиться же нужно, чтобы что-то видеть, такой darknet-darknet?\n\n[Вот, мой сертификат](/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:14_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/RetroShare#comment_65_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw)",
			"post_id": 11,
			"date_added": 1494680984
		},
		{
			"comment_id": 3,
			"body": "> [pozya](#comment_1_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Кстати, может мне тоже RS поднять? Там не тухло? Троллей нет?)Ибо иногда хочется осмысленной беседы, без подколов.\n\nRetroShare — это f2f сеть. Глобальных каких-то точек, где можно отследить тенденции и трафик нет.\n\nУ меня на трёх машинах по 40+ френдов (для этой сети считается очень много — т.к. через френдов доступны данные и их френдов по цепочке), как русских, так и зарубежных. На разных машинах народ частично пересекается, частично — нет.\n\nВ рамках этих кругов сеть практически мертва. За сути в топовых форумах по 1-3 сообщения.\n\nЧистых троллей я особо не заметил. Но там зашкаливающее количество параноиков. Каждое второе сообщение переходит в обсуждение присутствия ФСБ-шников в тредах, взаимные обвинения в работе на ФСБ, истерики «за публикации ссылок в реальный Интернете буду банить!» и т.п. :) Я за год заигнорировал (в RS есть такая возможность) около десятка таких истеричек и стало тихо. Как на кладбище :D Т.е. я не знаю сейчас, это реально сеть вымерла или там вся активность на таких держится.\n\nВ общем, я там присутствую, поскольку стараюсь следить за всеми популярными p2p-средствами, но реально делать мне там нечего :)",
			"post_id": 11,
			"date_added": 1495227205
		},
		{
			"comment_id": 4,
			"body": "> [pozya](#comment_1_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): \n> Кстати, может мне тоже RS поднять? Там не тухло? Троллей нет?)\n\nВот, иллюстрация, скрины нескольких «популярных» форумов. Можно оценить активность (сортировка сообщений по дате) и тематику :)\n\n- https://gateway.ipfs.io/ipfs/QmaDTaGL17t8PzzcKT2hHFaaKMkhF6Xq7957bBZGSQhxAu\n- https://gateway.ipfs.io/ipfs/QmbxWstokrwrCFYj4c6iUUo73A6gutToRV6oytXXXRRqya\n- https://gateway.ipfs.io/ipfs/QmbxWstokrwrCFYj4c6iUUo73A6gutToRV6oytXXXRRqya\n\n",
			"post_id": 11,
			"date_added": 1495228260
		},
		{
			"comment_id": 5,
			"body": "> [liathit](#comment_1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36): Не пойму, как склонировать \"ZeroUP\"\n\nСоздать новый пустой зайт, скопировать туда файлы из ZeroUp, почистить data, поменять ссылки и ключи в разных *.json\n\nНо пока оно, всё же, очень сыро. Например, пропадают русские буквы в именах, нормально не работают симлинки на файлы и т.п. Я пока забросил эту идею, жду, пока автор доведёт продукт до лучшего состояния, а там уже буду экспериментировать и, может, давать советы :)",
			"post_id": 23,
			"date_added": 1508053839
		},
		{
			"comment_id": 6,
			"body": "Блин. Есть серьёзная проблема. При простом открытии зайта с видео на другом зайте, видеозайт там не подтягивается :-/ Т.е. видео ни при каких условиях само не грузится, пока не загрузишь вручную сайт с ним.\n\nНужен какой-то механизм прелоада зайтов :-/",
			"post_id": 30,
			"date_added": 1513511112
		},
		{
			"comment_id": 7,
			"body": "Похоже, эта проблема принципиально не решается :-/ Выходит, что раздавать видео через выделенные зайты без предварительного пинания пользователя на его подписку не получится :-/",
			"post_id": 30,
			"date_added": 1513512474
		},
		{
			"comment_id": 8,
			"body": "> [touhou13](#comment_1_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t): буду благодарен, за ссылки на японские и корейские форумы\n\nПрикольно. Не обращал внимания, что в языках локализации ZeroNet нет японского. Нет, соответственно, и японских фильтров в ZeroSites.\n\nГуглится такой ZeroTalkJP: http://127.0.0.1:43110/1FhzTdzLKAXxu18xRn7LzH8LohQucsJNDq\n\nДальше, наверное, можно у них спросить :)",
			"post_id": 26,
			"date_added": 1514829461
		},
		{
			"comment_id": 9,
			"body": "> [l0bster](#comment_1_1FcMuJwqkSPP7C3gnNLugZGwwSGpugX2rA): Анонимность говорили они...\n\nХм. В любой p2p системе у тебя есть IP твоих соседей :) Хоть в Tor, хоть в i2p. Другое дело, что в некоторых протоколах анонимность стоит выше скорости, поэтому ты не увидишь IP других нод, только своих соседей. А в ZeroNet скорость ставится выше, поэтому у тебя есть общий доступный список узлов. Если нужна анонимность, то ZeroNet может работать через Tor :)",
			"post_id": 37,
			"date_added": 1517225032
		},
		{
			"comment_id": 10,
			"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Столкнулся с аналогичной проблемой, только у меня все решилось обновлением zn\n\nВ смысле — сносом и перевыкачиванием всех зайтов (понятно, что при этом они обновятся до актуального состояния) или в смысле обновлением версии ZN (у меня, как раз, версии обновляются регулярно, так что проблема касается разных версий, включая последнюю)?",
			"post_id": 38,
			"date_added": 1517750422
		},
		{
			"comment_id": 11,
			"body": "> [geekless](#comment_1_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Лог довольно активный, последние правки в этом месяце.\n\nДа, я видел, что блог недавно ожил. По хорошему, надо свести и автора этого блога, и тему [ZeroBlog improvements wishlist](/142jqssVAj2iRxMACJg2dzipB5oicZYz5w/?Topic:1516747933_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE/ZeroBlog+improvements+wishlist) :)",
			"post_id": 40,
			"date_added": 1518928462
		},
		{
			"comment_id": 12,
			"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кстати, есть глюк. Если локально поредактировать файл, у меня ZN не хочет его обновлять даже по команде «Проверить файлы».\n\nПосле локального редактирования нужно подписать и опубликовать :)",
			"post_id": 38,
			"date_added": 1518928629
		},
		{
			"comment_id": 13,
			"body": "> [anotherneko](#comment_3_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Я под картинки и прочие файлы пилил свой форк ZeroUp: http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/\n\nУ меня и свой форк есть :) — http://127.0.0.1:43110/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/\n\nПроблема в том, что я хочу в ZN затаскивать технически плохо подготовленный и относительно ленивый народ. Т.е. вариант «постить на отдельном ресурсе, копипастить ручками ссылки» не прокатывает :)",
			"post_id": 43,
			"date_added": 1524372807
		},
		{
			"comment_id": 14,
			"body": "> [anotherneko](#comment_4_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Тогда нужно будет к каждому ресурсу добавлять функционал вроде ZeroUp\n\nНе, ну аттачи добавлять можно и проще, как это сделано в блогах или, лучше, в ZeroMe, ZeroVoat и т.п. :) Просто пока не знаю, как это технически сделать.\n\nКстати, я сразу не подумал, но, действительно, это лучше делать не прямым выкладыванием  картинок в зайт форума по аналогии с ZeroBlog, в этом случае размер будет расти стремительно, а именно как в ZeroMe/ZeroVoat — на merger-зайтах. Тогда сам форум останется таким же небольшим, как сейчас, а его контент будет доступен по запросу. Придётся разбираться, как это устроено в других системах :)",
			"post_id": 43,
			"date_added": 1524374036
		},
		{
			"comment_id": 15,
			"body": "> [trooper](#comment_1_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe): интересная статья))\n\nБлин. Чёрт. Черновик ненаписанный ушёл :D Я хотел статью сделать по этому посту: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/1524658997\n\nА потом понял, что оно не интересно и писать не стал, решив потом под уже открытую на редактирование запись что-то более интересное написать. Но, видимо, что-то пошло не так и пустая заметка запостилась :D",
			"post_id": 44,
			"date_added": 1524762714
		},
		{
			"comment_id": 16,
			"body": "> [geekless](#comment_6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А как CoffeeScript собираешь? Встроенным в ZN компилятором собираешь или вручную?\n\nВстроенным механизмом ZeroNet по опции `--debug`.",
			"post_id": 43,
			"date_added": 1525249117
		},
		{
			"comment_id": 17,
			"body": "> [geekless](#comment_7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А он работает под Linux?\n\nПод Linux только и пользуюсь, в Windows не проверял :)",
			"post_id": 43,
			"date_added": 1525252652
		},
		{
			"comment_id": 18,
			"body": "> [geekless](#comment_9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Ты в напрямую в реальной ОС запускаешь ZN? В докере эта штука точно не работает.\n\nДа, напрямую. Но, судя по записи в блоге, ты с проблемой разобрался :)",
			"post_id": 43,
			"date_added": 1525372346
		},
		{
			"comment_id": 19,
			"body": "> [strelok](#comment_1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3): Поддерживаю, использовать одновременно zeronet и ipfs - костыль.\n\nВ целом тоже так считаю, но сейчас для задачи вставки внешней картинки в ZN нормального инструмента нет. Приходится придумывать костыли более корявые, чем IPFS :)",
			"post_id": 46,
			"date_added": 1525617054
		},
		{
			"comment_id": 20,
			"body": "> [geekless](#comment_14_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Условно свежий - 17.06.2017. Улыбнуло.\n\nОбновлялось недавно, так что — свежее :)",
			"post_id": 47,
			"date_added": 1535480047
		},
		{
			"comment_id": 21,
			"body": "> [geekless](#comment_15_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кстати, насчёт этого\n\nПолтора часа назад завёл новый блог. У меня на ноуте в деревне. И утянул его для доступности же на свой домашний комп в Москве. Сейчас делаю новую запись туда, смотрю — «опубликовано на 4 узлах». Гляжу в левом сайдбаре — у блога 6 пиров :D",
			"post_id": 47,
			"date_added": 1535536052
		},
		{
			"comment_id": 22,
			"body": "> [l8](#comment_1_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): И пару скриптов ещё для флоппинетного дозвона написать, да. ;)\n\nВо, проснулся, а тут уже всё разошлось само, когда Интернет появился :)",
			"post_id": 49,
			"date_added": 1537604685
		},
		{
			"comment_id": 23,
			"body": "> [l8](#comment_3_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Гигабайт на выход это-то понятно. Но на вход? Хм.\n\nВот и я удивился. Фактически получается сайт с транзитным трафиком :) При чём, на самом деле, там и гигабайта много. Меньше 1Мб размером. А нод, использующих его всего десятки.\n\nСейчас на своём публичном прокси глянул — там так: `Получено: 22754.69MB; Отправлено: 71837.52MB` и это при 72 пирах.",
			"post_id": 51,
			"date_added": 1538270129
		},
		{
			"comment_id": 24,
			"body": "На прокси за прошедшее время: `Получено: 22808.02MB; Отправлено:72158.39MB`\n\nТ.е. за ~ сутки — 53Мб входящего и 320Мб исходящего. Для сайта размером 956кБ(!), бог с ним с исходящим (хотя всё равно очень много), но интересно, откуда 53Мб входящего :-/",
			"post_id": 51,
			"date_added": 1538362669
		},
		{
			"comment_id": 25,
			"body": "> [geekless](#comment_17_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Бан на уровне фреймворка. Т.е. если топистартер забанен, движок видит посты в несуществующие темы. И не показывает их.\n\nБлин. Фигово. В этом случае получается, что мы после бана топикстартера не видим постов тех, кто занимается тем же самым. И помогаем эти посты распространять.",
			"post_id": 54,
			"date_added": 1541148703
		},
		{
			"comment_id": 26,
			"body": "> [geekless](#comment_19_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Подумал. Если форум собственный, не проще сразу на форуме забанить всех из своего блок-листа? Превентивно.\n\nТак речь как раз о _пополнении_ такого листа. Пока тема видна без забаненных — можно увидеть там последователей забанненого топикстартера и их тоже зачистить. А если тема не видна, то мы не видим там и новых сообщений от не забаненных, но которых банить нужно. И их сообщения раздаются твоей нодой.",
			"post_id": 54,
			"date_added": 1541150802
		},
		{
			"comment_id": 27,
			"body": "> [geekless](#comment_21_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Бан же вручную осуществляется правкой правил сайта?\n\nНет, я пишу про бан через блэклисты.",
			"post_id": 54,
			"date_added": 1541157759
		},
		{
			"comment_id": 28,
			"body": "> [geekless](#comment_22_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): То есть ты не хочешь воспользоваться силой админа и забанить их на форуме?\n\nРечь о посторонних форумах :) Часто полузаброшенных.",
			"post_id": 54,
			"date_added": 1541158818
		},
		{
			"comment_id": 29,
			"body": "Коммент в копилку, потом, м.б., в статью допишу (но, скорее всего, поленюсь).\n\n> Худшее из плохого — это хранение ценных данных не в каком-то центральном хранилище( что заранее предупредит о проблемах )\n\nВот у тебя есть проблема. Попробуй теперь скачать терабайт фоток с Flickr :) Учитывая, что адекватных инструментов для этого нет. А какая была эпопея по скачиванию нескольких терабайт с Амазона, когда они внезапно заявили о прекращении халявы. Говорить о том, что это меньшая проблема, может только тот, кто не наступал на эти грабли :D\n\n> а вообще неизвестно где и как, при полной неизвестности, когда у кого-то что-то там откажет/сломается.\n\nЕсли ты видишь, что твои данные доступны хотя бы у 5-6 пиров, это уже офигенная гарантия. А если они у 50 пиров? :)\n\n> Что, в любом из вариантов, выглядит довольно нелепо для такой тяжёлой штуки, как медиа\n\nТут важно сразу разделить понятия хранения абстрактных приватных данных и хранения тех же фоток в социальных целях. При чём в последнем случае ещё надо делить блоги и фотоальбомы, поскольку подходы и аудитории разные по сути.\n\nРаспределённые сети сегодня почти не решают вопросы приватных данных. Sia или Storj не взлетают, да и не взлетят, наверное. Потому что обычному пользователю не интересно хранить чужие закрытые бессмысленные для него данные. Даже если кто-то в обмен хранит его файлы. Но этот вопрос не решается никем и тут, действительно, придётся платить.\n\nА вот что касается социальных решений, о которых пошла речь и к которым относится мой комментарий, вот тут в распределённых сетях всё намного лучше. И оправданней с точки зрения пользователей. То, что интересно сообществу, будет храниться гарантированно и столь долго, сколько будет оставаться интерес, хоть у кого-то из участников. Заодно получается автоматическая очистка инфопространства от никому не нужного мусора.",
			"post_id": 56,
			"date_added": 1541936015
		},
		{
			"comment_id": 30,
			"body": "> [anotherneko](#comment_8_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): По запросу \"flickr downloader site:github.com\" вываливается куча всего разного на любой вкус цвет и размер.\n\nЯ в своё время, перед тем, как делать выводы о юзабельности Flickr, перепробовал тонну таких. Если для заливки там ещё много годных, на скачивании больших объёмов почти всё неюзабельно. От глюков софта до прямых блокировок на Flickr. На чём я с ним и не стал связываться в контексте хранилища. Прежде чем залить что-то нужно убедиться, насколько удобно это доставать обратно :)\n\n> В sia и storj данные храняться в обмен на деньги. Желающих держать у себя оборудование в обмен на деньги более чем достаточно.\n\nНамного меньше, чем нужно для коммьюнити.",
			"post_id": 56,
			"date_added": 1541970391
		},
		{
			"comment_id": 31,
			"body": "> [darktrader03](#comment_3_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb): проблема здесь в том, что в ЗероНет просмотры можно накручивать легко, так как он децентрализованный и отчасти анонимный.\n\nВ ZeroNet просмотры никак не учитываются, поскольку смотришь ты только на своих нодах, другие про это ничего не знают :) Теоретически, конечно, можно организовать счётчики просмотров а ля лайки в ZeroTalk или ZeroBlog, но лишено смысла :)\n\nА сабжевая статистика никакой практической пользы, конечно, не несёт, просто для иллюстрации.",
			"post_id": 53,
			"date_added": 1542266316
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}