{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Аналог LiveJournal - вопрос новичка",
			"body": "Камрады, сейчас куча народу недовольного блокировкой бложиков по альтернативной истории. Подскажите по технологии - что можно им предложить?\nПо сути надо:\n1. чтобы они могли постить длинные опусы с картинками и было не сложно\n2. чтобы их можно было камментить\n3. чтобы можно было банить всяких уродов (автором, или читателями лично - как получится)\n4. чтобы было трудно прикрыть раздачу информации\n5. чтобы каждый мог себе делать копиюшечку интересных постов\n\nПодскажите, что из этого есть, что нет. Что есть, но как-то по другому.\nОтветьте по ходу на пару вопросов новичка... (я технарь и сам питонщик, пойму легко, но надо оценить - есть ли потенциал, чтобы глубже копаться).",
			"added": 1486926608
		},
		{
			"topic_id": 2,
			"title": "Быстрый старт в ZeroNet на русском",
			"body": "О том, как создать свой блог, немного неочевидных нюансов для быстрой адаптации, ну и может потом еще ченьть напишу :)\nhttp://127.0.0.1:43110/1EA78W4sAgrJxVVcNR9UFF2CBiiWFfPcQQ/\n\nЗадокументировал свои экзерсисы с картинками. Создал тему, чтобы другим новичкам виднее было.",
			"added": 1487106264
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7": [
			{
				"comment_id": 1,
				"body": "Спасибо!\nДа, склонировать удалось! Забавно работает - мозг все время спрашивает \"а где программа-то?\" :)\nЯ правильно понимаю, что логикой бложика управляет js, который дергает api?\n\nПо поводу картинок: мне редактор дал картинку прямо в текст загрузить. Картинка ссылается на /data/img.\nВот, что вышло\nhttp://127.0.0.1:43110/1EA78W4sAgrJxVVcNR9UFF2CBiiWFfPcQQ/?Post:3:ZeroNet:+разбираемся+с+вопросами\n...не знаю, опубликовалось или нет - интерфейс писал, что пиры не приняли.\nМеня видно, или что-то недопилил?\n\nС уродами - да, будет проблемка... особенно учитывая простоту получения имен :) Но решаемо когда-ньть.\n\nДалее вопросы:\n1. при подключении к бложеку он весь приезжает, или только прочитанные странички?\n2. у меня в кэше оседает все, что я когда-либо посмотрел и так и лежит потом?\n3. можно ли как-то маркировать интересные странички и остальное периодически прочищать?\n4. если автор удалит страницу (не сам пропадет, а именно удалит илт вытрет контент)  - она у меня тоже пропадет? можно ли как-то \"замораживать\" то, что мне нужно?\n5. как в блоге заблочить пользователя? Видел где-то скрин, что рядом с именем висит контекстное меню и  там можно. Но у меня нет такого, и здесь, на Talk, тоже нет.",
				"added": 1486968973
			},
			{
				"comment_id": 2,
				"body": "> [dmi](#comment_1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7):\n> при подключении к бложеку он весь приезжает, или только прочитанные странички?\n> у меня в кэше оседает все, что я когда-либо посмотрел и так и лежит потом?\n> можно ли как-то маркировать интересные странички и остальное периодически прочищать?\n\nХм... разговаривая сам с собой: для этого надо чтобы странички публиковались как опциональные файлы?\nКто ченьть кодил для ZN? Это допустимый допил, или будут какие-то конфликты с логикой сервиса?",
				"added": 1486987765
			},
			{
				"comment_id": 3,
				"body": "Так в итоге, что по поводу работы ZN: он сразу весь зайт скачивает, кроме опциональных файлов, или зайт сегментируется?",
				"added": 1487001074
			},
			{
				"comment_id": 4,
				"body": "> [vlad20012](#comment_248_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): А что за бложики такие, и почему их блокируют?\n\nДа, казалось бы, ничего особенного... после того как Фоменко растолкал народ на тему того, что историю очень легко переписывать (технология простая как пробка) и глупо полагать, что это не сделано несколько раз, сложилась некая общность товарищей с достаточно высоким интеллектом и нереализованным исследовательским потенциалом.\nОни несколько лет с завидной регулярностью вытаскивают на всеобщее обозрение разные фотки,  тексты, обзоры, аналитику, указывающие на несоответствие официальной истории.\n\nСреди всего этого невероятно много пурги. Но количество действительно интересного фактического материала, причем обработанного и очень объемного, кажется начало подходить к критической точке для формирования какой-то общей и более очевидной картины.\nВидимо на этом радостном моменте их и решили придавить легонько, чтобы чего не вышло.\nФормально там фиг знает за что - может просто неполиткорректный высер в камментах, каких тысячи. ЖЖ не объяснил.\n\nА тусуются они все на LJ потому, что там это оказалось очень удобно: они все друг друга читают и делают себе перепосты того, что подходит под их картину и для своей аудитории. Получается довольно занятный синергетический эффект.\n\nА поскольку у многих ЖЖ это единственное место, где их труды аккуратно собраны, перспектива все потерять их не радует.\n\nВот как-то примерно так...",
				"added": 1487071069
			},
			{
				"comment_id": 5,
				"body": "> [wrewolf](#comment_150_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): То есть необходимый минимум, это настройка автоматического зеркалирования бложика в ZN бложик. Просто как гарантия не потерять инфу.\n\nТут немного глубже. Каждый из них собирает свою аудиторию. Если его вышибают из ЖЖ, то есть у него альтернативное место или нет, \"канал вещания\" проседает.\nКроме того, дублировать - это лишний труд.\nИдеально было бы, если бы они всех тут и собрали. Причем если они уйдут с ЖЖ всей толпой (как сейчас и собираются), то это вполне реальный вариант.\nДальше - кто хочет камментить, ставит плагин. Порог входа не больше, чем в ЖЖ.\nКто просто читает - может через прокси-сайты это делать без регистрации.",
				"added": 1487078636
			},
			{
				"comment_id": 6,
				"body": "> [zeroalx](#comment_12_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): А примеры подобных бложиков будут? Я только wakeuphuman знаю, но там автор явно под веществами...\n\nПодобрал на скорую руку. И только из LJ, чтобы было репрезентативно. Так еще много где канеш.\n\nВеселые картинки (фотки) 19 века.\nhttp://kadykchanskiy.livejournal.com/316421.html\nhttp://kadykchanskiy.livejournal.com/635647.html\n\nПо картам с Тамерланом\nhttp://gilliotinus.livejournal.com/135677.html\n\nПро пугачевское восстание\nhttp://alekseyzayats.livejournal.com/3377.html\n\nЕще веселые картинки (гравюры)\nhttp://kadykchanskiy.livejournal.com/272748.html\n\nПро культурный слой\nhttp://tar-s.livejournal.com/1020843.html\n\nКак охотился Николай второй\nhttp://sandra-rimskaya.livejournal.com/1928592.html\n\nПро то, мимо чего бездумно ходим\nhttp://kadykchanskiy.livejournal.com/594677.html\n\nPS. Выводы авторов иногда, эм... \"своеобразные\", но не в них суть, а в самих материалах, которые они находят и в вопросах которые они задают.",
				"added": 1487085855
			},
			{
				"comment_id": 7,
				"body": "Кто-нибудь разбирался с Merger-ом?\nhttps://github.com/HelloZeroNet/ZeroNet/issues/232\nИли конкретно с ZeroMe?",
				"added": 1487086343
			},
			{
				"comment_id": 8,
				"body": "> [vlad20012](#comment_250_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Еще интересно узнать, кого конкретно заблокировали. Или с чего кипиш начался, что аж до \"уйти с LJ\" долшло.\n\nСамый кипиш начался с того, что заблокировали этого товарища: http://sibved.livejournal.com он достаточно центровой. Вчера разблокировали однако.\n\nВ результате этого маразма все собрались подружиться и уйти, но поссорились и подрались: http://kadykchanskiy.livejournal.com/668289.html :)",
				"added": 1487094320
			},
			{
				"comment_id": 9,
				"body": "Кстати, я правильно понимаю, что сейчас все комюнити ZN не превышает 400 человек? (сужу по к-ву сидов ZeroName и Ко). Ктонть представляет, как оно поведет себя на объеме хотя бы порядка 50 тыщ персон?\nСобственно, вопросов 2:\n1. потянет ли тор-сетка? все-таки, она основной транспорт.\n2. не захлебнутся ли трекеры от количества файлов? ведь каждый апдейт и каждый опциональный файл - это отдельная запись.",
				"added": 1487100817
			},
			{
				"comment_id": 10,
				"body": "> [dmi](#comment_9_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): потянет ли тор-сетка? все-таки, она основной транспорт.\n> не захлебнутся ли трекеры от количества файлов? ведь каждый апдейт и каждый опциональный файл - это отдельная запись.\n\nВ общем, снова сам себе и отвечу:\nDHT пока нет, поэтому, если не родят, то захлебнется. Если неправильно родят, то тоже захлебнется.\nТор, скорее всего, тоже захлебнется.",
				"added": 1487105835
			},
			{
				"comment_id": 11,
				"body": "> [balancer73](#comment_65_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Но проходит месяц-другой — и опаньки, фото нигде больше не видно. Ни на изначальной машине, ни на раздающих...\n\nА там если их у тебя в Файлах выделить и нажать \"Прикрепить\" - это их на твоем компе не заморозит?",
				"added": 1487106484
			},
			{
				"comment_id": 12,
				"body": "> [balancer73](#comment_66_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Tor, всё же, по умолчанию выключен. И большинство, ИМХО, сидит на прямых соединениях. У меня среди всех машин только две работает через Tor, т.к. при прямом соединении возникает конфликт портов на роутере (из дома ещё две машины работают). И штуки 4 работает напрямую. Так что Tor — это для тех, кто реально опасается потери анонимности :)\n\nПро числа - спс! Не знал.\nПро Tor - т.е., uPnP все-таки срабатывает, даже если пишет, что порт закрыт?\nНу и в кафешке и любой корпоративной сетке без тора уже нового ресурса не создать, получается...",
				"added": 1487112909
			},
			{
				"comment_id": 13,
				"body": "ну, кстати, git - да... и с интерфейсиком типа wayback machine - вполне вменяемо будет.",
				"added": 1490255898
			}
		]
	},
	"comment_vote": {}
}