{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Adicionando vídeo do IPFS ao seu blog",
			"body": "http://127.0.0.1:43110/17j8Y5EyKdnotYb1Q3ngnPmb3ES3AV3fiy/?Post:11:Adding+video%27s+from+IPFS+to+your+blog",
			"added": 1577070559
		},
		{
			"topic_id": 2,
			"title": "ZeroShortener",
			"body": "Faça seus zerolinks muito mais curtos e fáceis de lembrar.\n- http://127.0.0.1:43110/0sh.bit/",
			"added": 1577076929
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1_1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE": [
			{
				"comment_id": 1,
				"body": "#Monero e ZCash - Código Fonte\n- https://gateway.pinata.cloud/ipfs/QmTXxzRVJMoBSf9dtScTSQZk3eG6LY1sdEzCcoJbr9T5ps",
				"added": 1577069994
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 2,
				"body": "> [zcashmonero](#comment_17_1635jevzJXTxnL9ACG5Ab1fN7DA1VY4hkE): As ferramentas on-line fornecem funções de codificação / decodificação md2, md5, sha1, sha2, sha512, bas64 e html\n> \n> https://emn178.github.io/online-tools/index.html\n\n#Online Tools\n- https://gateway.pinata.cloud/ipfs/QmVatAptSefKK4R9tfSrz5YR4eLiYcHL3snzM3KZfN2B7c",
				"added": 1577070183
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 3,
				"body": "#Mussolini e a ascensão do fascismo\nMussolini e a ascensão do fascismo, estudo de Donald Sassoon, professor de História Comparada da Europa na Universidade de Londres, se constitui como exemplo de excelente síntese de história política sobre a elevação do fascismo a regime político na Itália, berço do movimento.\n- https://gateway.pinata.cloud/ipfs/QmRNJP3BTb9stVmUyPWUrdmvDm8KzHAYiW1zRWNgRuzcHG",
				"added": 1577070405
			},
			{
				"comment_id": 10,
				"body": "Minha Luta (Mein Kampf, no original alemão) é uma obra de autoria do líder nazista [Adolf Hitler](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Adolf_Hitler.html), e que combina elementos autobiográficos com a descrição de sua ideologia política.\n- https://gateway.pinata.cloud/ipfs/QmcoxbTuCpU9XmWmdVkus5m1pzwBwBmbHovYWRs5hD92XM",
				"added": 1577072994
			}
		],
		"4_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 4,
				"body": "#Cérebro artificial\nO cérebro artificial é um termo comumente utilizado na mídia para descrever as pesquisas que têm como objetivo o desenvolvimento de software e hardware com habilidades cognitivas similares às dos animais ou do cérebro humano.\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Artificial_brain.html",
				"added": 1577071591
			},
			{
				"comment_id": 5,
				"body": "#Filosofia da inteligência artificial\n- https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Philosophy_of_artificial_intelligence.html\n\nA filosofia da inteligência artificial tenta responder a questões como:\n\n  -  Pode uma máquina agir inteligentemente? Pode resolver qualquer problema que uma pessoa resolveria através do raciocício?\n  - Pode uma máquina possuir uma mente, estados mentais e uma consciência, da mesma maneira que os seres humanos possuem? As máquinas podem sentir?\n  - A inteligência humana e a inteligência de uma máquina são idênticas? É o cérebro humano essencialmente um computador?\n\nEstas três questões reflectem os interesses divergentes dos pesquisadores em inteligência artificial, filósofos e cientistas da cognição, respectivamente. As respostas a estas questões depende de como é definida \"inteligência\" ou \"consciência\" e exactamente que \"máquinas\" estão sob discussão.",
				"added": 1577071702
			},
			{
				"comment_id": 6,
				"body": "#Rede de nanofios mostra comportamentos como os do cérebro humano\nUma parceria formada por cientistas da Universidade da Califórnia, em Los Angeles, e do Instituto Nacional de Ciência de Materiais, no Japão, deu origem a um dispositivo minúsculo que apresenta características semelhantes a determinados comportamentos do cérebro humano. Capaz de mostrar atributos como sonolência, vigilância, esquecimento, aprendizado e memorização, o componente pode permitir importantes avanços na criação de máquinas com a habilidade de pensar como nós no futuro.\n- https://gateway.pinata.cloud/ipfs/QmWfn7CKV27cj1nrVCXvZLhhX8qi7dbyj9TZCPzApc39wo",
				"added": 1577071963
			},
			{
				"comment_id": 7,
				"body": "#Construindo um cérebro para a inteligência artificial\nMohammad Sharbati, da Universidade de Pittsburgh, nos EUA, usou grafeno para desenvolver uma nova versão de sinapse artificial, um componente que processa informações não como um computador digital, mas imitando a maneira analógica que o cérebro humano usa para completar suas tarefas.\n- https://gateway.pinata.cloud/ipfs/QmTJRveEXJ8ZmRjgaw6wvqDWALcm3s8v7rGWYAc67A9mVv",
				"added": 1577072183
			},
			{
				"comment_id": 8,
				"body": "#Rumo ao cérebro artificial, sinapses eletrônicas já aprendem sozinhas\nPesquisadores franceses criaram uma sinapse artificial capaz de aprender sozinha, sem que os humanos precisem se dedicar ao tedioso trabalho de treiná-la para que ela aprenda a executar suas funções.\n- https://gateway.pinata.cloud/ipfs/QmYMsjWhd5bKQ3fiQoWZ1JxgzmZqZz7QCfMf1UgJHCH6xN",
				"added": 1577072312
			},
			{
				"comment_id": 9,
				"body": "#Sinapse artificial memoriza e esquece como o cérebro\nUm grupo de pesquisadores japoneses desenvolveu um circuito eletrônico que imita o sistema de memorização e esquecimento que caracteriza o aprendizado do cérebro humano.\n- https://gateway.pinata.cloud/ipfs/QmTVC48fFHu6rgUQEvee2U3mF4cSNaYAuohZTBWfxxqpyM",
				"added": 1577072482
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 11,
				"body": "#Quais os impactos da computação quântica para o Bitcoin e altcoins?\n- https://gateway.pinata.cloud/ipfs/QmX8VPrdN2NQY5h6AAp1dp8VsXKbuy8LTmNdv89AJcXgsS",
				"added": 1577075780
			}
		]
	},
	"comment_vote": {}
}