{
	"title": "华尔街",
	"description": "Wall Street Things",
	"links": "- [College 34](http://127.0.0.1:43110/1Mr11twqYfgYE8DGB6USc3QqvGwiqjmzqt/)\n- [Wall Street 2](http://127.0.0.1:43110/15XesEuUbcgHcsRkawXcE9LR5oybBiMPs2)\n- [Sigma Fund 1](http://127.0.0.1:43110/1Avbvm4t7F1uwLKYcVVaJs82Th7szxyWXW)\n- [Sigma Fund 2](http://127.0.0.1:43110/1QJxJv6HLBk7NNRW3Vb49E6oouVA5y7UJt)\n- [Sigma Fund X](http://127.0.0.1:43110/12dCWY6j62zgow6vfbgjLTJvshz9erWZ54)\n- [Sigma Fund 50](http://127.0.0.1:43110/1FeWMkG4Jf3GWSGwLkKdnbzFjk4oHV7DWw)\n- [Sigma Fund SQ](http://127.0.0.1:43110/1Fih5isDDA6r8W8XuieWkrkez2EGyJnMLk/)\n- [The Beach Financing](http://127.0.0.1:43110/1EcM3sV3b2myCskAeKupL8WKk3QwCuGrJM)",
	"next_post_id": 717,
	"demo": false,
	"modified": 1496500946,
	"post": [
		{
			"post_id": 716,
			"title": "New blog post",
			"date_published": 1496500946.815,
			"body": "Blog post body"
		},
		{
			"post_id": 715,
			"title": "New blog post",
			"date_published": 1496500693.707,
			"body": "知名私募上海共喜资产管理有限公司平台下的投顾账户已无法正常使用，资金无法提取。耐人寻味的是，该私募高管近期已先后辞职，主要股东也已失联。部分投资人今日已向警方报案，另有知情人士称，该公司疑似资金链断裂。\n\n    合作账户已无法使用\n\n    “我们与共喜资产平台合作的账户已经无法登陆了。”有投资者向记者表示。“实际上，端午节前账户就曾出现异常，提示保证金不足、无法交易，节后干脆完全没法使用了。”数名投资者都向记者反映了类似的情况。\n\n    据进一步了解，上述投资者与共喜资产的主要合作模式类似配资业务：由投资者担任共喜资产产品投顾，向共喜资产提供一定委托资金后，共喜资产按照不同比例为投资者提供杠杆资金，收取配资利息和收益分成。在实际操作中，公司将资金汇集后使用专业软件为投顾提供虚拟账户，类似此前被监管部门查处的恒生HOMS系统。\n\n    记者看到的一份合作协议显示，共喜资产资金授权倍数为10倍，合作账户的收益70%归投资人所有，30%为共喜资产收取的盈利分成。\n\n    上海知名私募疑陷兑付危机：高管集体辞职股东失联，部分投资人已报案“每个人的合同都不一样，合作模式和资金杠杆都不相同。有保本型、保本保息型和管理型，前两者投资者都需转入一定资金作为劣后，保本型共喜资产只收取盈利分成，保本保息除盈利分成还要收取配资利息；管理型则是投资者担任纯投顾，无需转入劣后资金。”某投资者表示。\n\n    办公场地已无管理人员 股东失联\n\n    共喜资产在上海私募圈小有名气，其办公地址位于上海浦东新区某高档住宅小区内。记者今日下午前往该公司后发现，公司办公场地内已无经营管理人员，大门敞开，只剩个别基层员工。\n\n    上海知名私募疑陷兑付危机：高管集体辞职股东失联，部分投资人已报案上海知名私募疑陷兑付危机：高管集体辞职股东失联，部分投资人已报案进门可以看到维权投资者在写字板上留下的信息，声称“共喜诈骗”。\n\n    上海知名私募疑陷兑付危机：高管集体辞职股东失联，部分投资人已报案“包括总经理在内的公司高管都已经离职了，我们现在想联系公司的股东，有一位前天出现过，但现在打电话不接，另一位已经失联。”在场的维权投资者说。有接近该公司的人士向记者证实了高管集体离职的消息，券商中国记者辗转联系到该公司某位高管，对方表示5月25日已经申请离职，并拒绝透露更多信息。\n\n    知情人称前任股东曾挪用客户资金\n\n    “公司前任股东就曾经有挪用客户资金的情况，当时亏空了三四千万，之后有新的股东接盘并补上了资金，此次或是因为母基金杠杆过高，行情不好导致资金链断裂。”有知情人士透露。\n\n    查询相关信息后发现，上海共喜资产管理有限公司成立日期为2014年8月22日，注册资本1亿元，法定代表人为李晓天。\n\n    上海知名私募疑陷兑付危机：高管集体辞职股东失联，部分投资人已报案公司今年4月10日曾发生一次股权变更，原股东为两名自然人李晓天、申子豪，变更后申子豪退出，目前公司股东包括两名自然人：杨文、李晓天，一家企业法人：上海圣训资产管理有限公司。\n\n    上述知情人士表示，申子豪因挪用公司资金交易发生亏空被发现，被迫净身离开公司。申子豪离开公司后创办了另一家公司：上海共喜信息科技有限公司，从事类似业务并带走了部分优先资金提供方。此次共喜资产的兑付危机也与优先资金提供方的撤离有关。\n\n    中国基金业协会信息显示，共喜资产并非协会会员，可查询到的产品共有5只。据业内人士介绍，该公司此前管理规模曾在二十亿元以上。\n\n    上海知名私募疑陷兑付危机：高管集体辞职股东失联，部分投资人已报案上海知名私募疑陷兑付危机：高管集体辞职股东失联，部分投资人已报案部分投资人已报案\n\n    部分维权投资者今日下午已前往公安机关报案，券商中国记者也作为旁观者全程参与。\n\n    “我们在共喜资产的合作账户资金有一百多万，交易还有一定盈利，但现在连本金都取不出来了。”一位投资者向记者表示。据了解，今日下午共有七八名投资者参与报案，涉及金额不多，在600万元左右。\n\n    另据了解，一些资金量较大的投资方并未在此次报案中现身。“之前我们汇总时涉及维权金额已经过亿，最高的是6000万，还有两千万和一千多万的，但报案的时候都没有出现。”有投资人代表称。\n"
		},
		{
			"post_id": 714,
			"title": "现在的问题是为何上市公司的内部人（无论是大股东，还是董事和监事）在公司上市之后要千方百计地减持自己公司的股票？",
			"date_published": 1496027679.423,
			"body": "Blog post body"
		},
		{
			"post_id": 713,
			"title": "New blog post",
			"date_published": 1496027377.273,
			"body": "上周还在天津参加2014夏季达沃斯论坛，仅仅过了一个周末，孙兆学即落马。昨天晚上，中央纪委监察部官网公布消息称，“中国黄金集团公司原总经理，现中国铝业公司总经理孙兆学涉嫌严重违纪违法，目前正接受组织调查。”\n\n　　与此前公布的诸多“接受调查”的消息不同的是，这次孙兆学的头衔，除了现任的中国铝业公司总经理，还有一年前卸任的“中国黄金集团公司总经理”一职。\n\n　　靠上山砍柴攒足上大学的路费\n\n　　孙兆学落马并无征兆。9月11日，作为夏季达沃斯论坛主办方特邀主席，孙兆学主持了主题为“资源行业经济展望”资源峰会。\n\n　　截至昨晚10点，在中国铝业官网的“公司要闻”和“管理团队”栏目里，依然挂着孙兆学的相关讯息。根据官网的介绍，孙兆学毕业于中国地质大学(北京)资源产业经济专业，是“博士研究生，教授级高级工程师。第十届全国人大代表，第十二届全国政协委员”。\n\n　　作为曾经掌管过两大国有企业的高管，孙兆学走到今天实属不易。九年前一家杂志采访他，根据他的描述，其出生在山西运城市稷山县一个农民家庭。当年他是靠上山砍柴才攒足去东北上学的路费。\n\n　　1983年，孙兆学从本溪钢铁专科学校毕业，被分配到远离厂部300多公里的孝义铝矿，成为山西铝厂的第一批建设者。从那时起，到进京任职，孙兆学在山西一呆二十年。从调度组长、车间主任一路升至中铝山西分公司总经理。\n\n　　向地方领导汇报工作的央企高管\n\n　　报道说，在孝义铝矿这一时期，“检修运输索道时，需要几十个精壮的小伙子一起抬，他是队伍中的第一名；矿里的篮球队，他是活跃的队员。多少年后，孙兆学每一次回到孝义铝矿，老工人们总是与他围成一群，谈笑风生”。\n\n　　作为央企，以前山西铝厂同地方沟通较少。孙兆学上任后却打破这一习惯，他每年都要给省里写工作汇报，省委主要领导也多次批示支持铝厂发展。有人劝孙兆学，按管辖范围和级别，他没有必要汇报。孙兆学却回应说，“要尊重地方干部，要尊重人，这是我做人的基本态度。”\n\n　　曾经的CCTV中国年度经济人物\n\n　　2006年10月，已是中国铝业副总经理的孙兆学调任中国黄金集团公司总经理、党委书记。其间接受媒体采访时，媒体称，“大笑时候的孙兆学很放松，整个人简洁温厚”。根据记者描述，他不回避任何提问，偶尔会为自己长时间的讲述致以歉意。\n\n　　孙兆学对自己任上的业绩颇为满意。2006年底，按净利润排名，中国黄金集团排在央企中的106位，属于央企整合的生死线下。到2011年底，中国黄金跃升到第43位。4万职工人均年收入从不足1.1万涨到4万元。\n\n　　2011年，孙兆学获选当年的CCTV中国年度经济人物——这个评选活动，是时任央视财经频道总监郭振玺极力打造的。\n\n　　重回中国铝业一年即宣告落马\n\n　　两年后的2013年10月，孙兆学重回中国铝业，担任总经理一职。此次回归有些“救火”的意味。根据中国铝业2013年3月发布的上一年年报，公司2012年净利润亏损82.33亿元。\n\n　　孙兆学刚到任一个月，2013年11月19日晚间，中国铝业发布公告称，该公司副总裁李东光已因个人原因接受有关部门调查。此时，李东光刚刚履新半年。昨天，回归不到一年的孙兆学也落马了。中国铝业连损两员“大将”。\n"
		},
		{
			"post_id": 712,
			"title": "New blog post",
			"date_published": 1496027368.794,
			"body": "Blog post body"
		},
		{
			"post_id": 711,
			"title": "New blog post",
			"date_published": 1496026980.679,
			"body": "1949年前后，150多万吃“皇粮”的人口突然涌入台湾，对于当时只有600多万人口的台湾无疑增加了沉重的经济负担。然而，在这种经济背景下，蒋介石政权居然挺了过来，还使台湾创造出经济增长“奇迹”，这中间有什么秘密呢？\n\n1949年前后，国民党政权在大陆的统治岌岌可危，退守台湾已势在必行。蒋介石以其“精明”之道，在退守台湾前，将国库中的黄金、美钞、银元偷偷地运到台湾，来个釜底抽薪，使李宗仁的代总统“总而不统”，无法控制国民政权的局面，而且没有与共产党“和谈”的本钱，丢给将来的毛泽东、共产党政权一个烂摊子，使其难以维持大局，并给美国人一点颜色看看，使他们知道，中国非有蒋介石不可。\n\n1949年2月上旬的一天，曾任国民政府上海市市长、财政部部长、中央银行总裁、时已去职在香港逗留的蒋介石的亲信俞鸿钧，突然接到蒋介石从溪口拍来的电报，要他想方设法将国库中的黄金提出来秘密送到台湾，并叮嘱再三，“千万要守秘密！”\n\n2月14日下午，一架由香港飞来的飞机在虹桥机场降落，此时上海进入临战状态，机场四周，宪兵三步一岗，五步一哨，对往来旅客悉数搜查。当头戴一顶黑色礼帽，身穿一袭黑色风衣，鼻梁上架着副金丝眼镜的俞鸿钧一出飞机弦梯口时，立即引起了宪兵们的警惕，他们把俞鸿钧引至候机室，进行了审问。俞鸿钧介绍了自己的身份，但却拿不出任何证件和证明，宪兵们哪里肯信。无奈之下，他只好向宪兵提出和时任上海警备司令的汤恩伯联系一下，在电话机旁守候多时，终于和汤恩伯接上了话。汤恩伯立即派车到机场迎接。这时，宪兵们才知道他不是冒牌货，而是位大“长官”，立即向他道歉。俞鸿钧摆出“长者风度”，与宪兵们一一握手道别，嘉许了他们“恪尽职守”的精神。\n\n俞鸿钧在汤恩伯的帮助下，撇开了当时的财政部长兼中央银行总裁刘泗业，直接与自己原来的旧属取得了联系，转达了蒋介石转运黄金的旨意。这批旧属获知老长官的来头和来意之后，立即采取各种方案，将藏在中央银行的黄金、外币、银元做了明细账，告知了俞鸿钧，并协商了安全、可靠的运出方法。\n\n安排妥当后，俞鸿钧立即告知蒋介石一切安排妥当，只等行动。蒋介石得到消息后，立即致电曾是自己机要秘书、时任联勤总部财务署长的中将吴嵩庆，让他在上海秘密组织运送工作，并指令：所有这些硬通货，全部交由蒋介石掌握，吴嵩庆只对蒋个人负责，在上海运送过程中，不得有误。\n\n2月18日黄昏，一艘外表破旧的海军军舰接到海军司令桂永清的密令后，停泊到了上海外滩中央银行附近的码头旁边。午夜，在一片细雨蒙蒙中，一群由海军士兵化装成的民工进入中央银行，不声不响地将一箱箱黄金运上了军舰。凌晨4时许，装运完毕，这艘军舰驶出吴淞口，以最快的速度向东南方向驶去。\n\n20日中午，这批黄金运抵台湾基隆港，当晚，俞鸿钧接到当时台湾省主席陈诚从台湾打来的电报：货已收到。俞鸿钧放心地舒了口气，随即将这一消息电告蒋介石。\n\n随后几天，还是这条军舰将中央银行的美钞、银元从上海运到厦门，有的放置几天后才运到基隆。\n\n库存黄金运到台湾后，蒋介石看着清单，突然想起还有一箱珠宝存放在中央信托局，当即命令侍奉在自己身边的蒋经国迅速办理此事，将它运抵台湾。这箱珠宝多半系日军侵华期间，汉奸走狗们非法搜刮而来的，抗战胜利后，国民政府返都南京，对汉奸们进行了逮捕、收审，没收其财产，珠宝落入蒋介石政权手中。\n\n蒋经国领命后，迅速潜入上海，然而很快其行踪和目的就让李宗仁的手下侦察得知了。李宗仁立刻下令中央信托局妥善保存，没有他的手谕，任何人都不得动用，并将保管这箱珠宝的人调到香港。\n\n蒋经国无功而返，就劝说蒋介石“据所知情形，这一箱珠宝已经用了不少，剩余的东西，仅值二三千万美金，我们何必为此区区之物，同人家伤和气。”蒋介石听了非常生气，指责蒋经国道：“你懂什么，到了台湾，当军队粮饷发不出的时候，就是一块美金也是好的”。蒋经国被斥责得面红耳赤，无言以对，只得再作努力，但最终还是没把珠宝取出来，蒋介石为此很不高兴\n\n蒋介石退到台湾前从大陆带去了多少美元、黄金、银元？据有关资料显示“外币约合8000万美元，黄金92万两(其中属蒋介石私人贮藏的有2万余两)，银元约3000万元。此外，此时的宋孔两大家族也偷偷地把他们在大陆搜刮的财富近20亿美金(上世纪80年代的价格)存入美国的花旗、大众银行。”\n\n蒋介石这些运往台湾的财富是从哪里来的，“人民的血汗”，这是众所周知的事实。1948年8月，国民党政府推行所谓的“币制改革”，勒令国民交出私藏的黄金、美金、银元兑换成“金圆券”，不惜采取军事和特务手段强行索取、没收，不交的甚至被抓去坐牢、杀头。不少老百姓辛苦了一辈子、甚至是几辈子攒下的硬通货一夜之间变成了印有蒋介石头像的面值为50万、100万不等的纸币。而随着战局的紧张、银根的收缩，这些“金圆券”一夕之间狂跌，老百姓欲哭无泪，这也是国民党政权不得人心，最终垮台的原因之一。\n"
		},
		{
			"post_id": 710,
			"title": "New blog post",
			"date_published": 1474984724.455,
			"body": "2012年8月11日，百万年薪的原中金投行副总邹炎因为涉嫌内幕交易被刑事拘留，同年8月28日被执行逮捕。据邹炎的陈述，自己之所以涉嫌内幕交易，是“担心太太在家无聊，想给她找点事做”。2013年1月16日，邹炎因涉嫌内幕交易而在上海市第一中级人民法院公开审理，检察院请求法院判5至10年有期徒刑。\n\n　　夫唱妇随的内幕交易\n\n　　据邹炎的陈述，自己之所以涉嫌内幕交易，跟妻子有关系。\n\n　　资料显示，邹家在上海市内环一繁华地段拥有一套叠加别墅，价值超千万。而邹炎本身的工作，也给家庭带来了丰厚的物质保障。但同是大学毕业的妻子，则因为身体不佳的原因，于2009年开始休息在家做着全职太太。\n\n　　“但我担心太太在家无聊，想给她找点事做。”邹炎说。\n\n　　2011年1月，恰逢中金公司在三亚召开投资论坛。1月21日，同在中金公司投行部专做项目的一位副总经理找到邹炎，告知他粤高速A马上要重组了，希望邹炎可以安排其他三位同事进这个项目组，将工作重点转至该项目。\n\n　　“自此我获知粤高速A可能重组的信息。”邹炎称。21日是个周五，在接下来的周末，邹炎回家将消息告诉了妻子。妻子张玲依据邹炎的提示，在1月24日周一开盘后，即将账户中原有股票全数抛出，开始大量下单买入粤高速A。\n\n　　“内幕专家”掉进了陷阱\n\n　　邹炎为自己申辩说，购买粤高速A最主要的原因就是自己对“内幕知情人”这个概念理解有偏差。“那时候司法解释还没有出来，我就一直错误地以为内幕知情是要清楚地知道具体方案，或者至少要知道停牌时间。但粤高速A这个项目无论是停牌时间和方案我都是不知道的。所以我当时误以为这不算内幕知情。”\n\n　　种种“擦边”信息和理解让邹炎有了侥幸心理。\n\n　　事实上，邹炎对内幕交易跟市场操纵有着深入的研究。早在2005年，邹炎曾和他人合作过一篇题为《内幕交易与市场操纵的事件研究》的论文，论文非常详细地论述了内幕交易跟市场操纵的法律问题，并对内幕交易的认定标准进行了深入的实证研究。\n\n　　当天的庭审情况显示，公诉人将采纳2012年6月1日起施行的《关于办理内幕交易、泄露内幕信息刑事案件具体应用法律若干问题的解释》中的相关规定，对邹炎处以有期徒刑5至10年的量刑建议。\n\n　　据《证券市场周刊》\n\n　　新闻延伸\n\n　　中金频发内幕交易案\n\n　　处罚过轻存侥幸心理\n\n　　邹炎之所以抱有侥幸心理，跟以往的内幕交易案处罚力度不大有关系。\n\n　　“2011年年底证监会来查的时候，那时候正好有个岳远斌内幕交易的事被证监会在网上通报行政处罚了。我认为自己的事跟这个差不多，所以想最差不过是接受行政处罚。”邹炎称。\n\n　　据悉，证监会公布的处罚中，华鑫证券投行部高级副总裁岳远斌因在国泰君安工作期间，利用三爱富重组内幕信息，违规买卖400万元股票，被处以5年市场禁入和20万元罚款。\n\n　　“其实，之前的很多类似案件恶劣性远远超过邹炎案，处罚都不算重。像上海许春茂的案件，成交额达9500余万元，结果是判三缓三；同样在一中院判决的李旭利案，获利1070余万元，结果是四年有期徒刑。”邹炎的代理律师陶武平说。\n"
		},
		{
			"post_id": 709,
			"title": "第4季度赢利，主要靠10月！",
			"date_published": 1474984245.585,
			"body": "今天沪市低开6点于2974，三低波反抽见2987后开始缓慢下行，尽管地产股猛拉，但是相应者寡，午后出现跳水，在最低点2069，再跌将确认半年线跌破有效的关键时刻，机构护盘资金终于按耐不住而出手，狂拉银行券商，使得指数硬生生地45度上行，游资也趁机拉抬次新股，使得指数以最高点2298报收，上涨0.60%，成交量萎缩到1334亿，日K线为光头小阳，两市涨停个股共有29家，跌停3家。\n\n今天走势特点有：1、多空争夺半年线，空头利用技术面和基本面，多头则利用地产金融权重股，多头的成功靠尾盘偷袭，但是，半年线初步体现了支撑作用；2、跌破半年线2977后，G20后不见护盘的股市，终于迎来了护盘，表明半年线可能是国家队要守的堡垒，若真如此，那么，按股灾后国家队表现，一旦某位置国家队开始护盘，一般都会有一小波行情，或有一段箱体要走，所以，节前大盘会在半年线之上维系；3、今天走势除了护盘工具地产、金融外，仅有庄股和次新股有游资搏杀，表明市场谨慎心态依旧，热点不集中，不持续，利用护盘力量趁机短炒的特征明显。4、今天盘面体现了2850--2870一带支撑的力度，原因在于日K线半年线（2977）、周K线30周均线（2967）、月K线5、10月均线（2977、2979）都交汇于此。不过就今天指数技术反抽的效果来看，多空对次区间的争夺，还有反复，短期上看，半年线上能否企稳对游资将至关重要；5、从五步循环技术指标来看，波段HK继续下行，但收红，力度线小幅上行，大盘今天的表现属于反抽，周三五步循环技术的压力点在3014，而支撑点在2986，属于区间整理的概率大些。\n\n我们把周期略微放大，消息面上，10月份将召开十八届6中全会，将直接关系未来经济改革和经济转型的方向，同时会议之前按照惯例会有一波获利颇丰的维稳走势，且\n\n9月、10月、11月三个月，单月解禁市值分别为1888亿元、287亿元、2258亿元。其中，10月单月解禁压力环比降幅较大，并创下年内最低，因此10月行情应该超过9月，并且美股大选要在11月见分晓，10月也就是多头必须利用的间隙了；不过，不利的因素有，当前火爆异常的房地产市场、债券市场，以及大宗商品，甚至港股市场，都早已成为资金追逐的名利场。而A股已经成为资金的供给源。数据显示，证券交易结算资金余额，已从去年牛市的逾3万亿元回落至1.4万亿元附近；而代表高风险偏好资金的两融余额，也从去年牛市时的逾2万亿元回落至目前的8900亿元附近；特别是9月市场的连续跳水，使得两市成交额不到四千亿元，与去年牛市时单日逾2万亿元的成交额已经不可同日而语。这也说明当前市场，只要房市不倒，股市绝对难好。\n\n总结以上分析：1、短线来看，大盘将围绕半年线多空争夺，周三大盘将低开的阳星；节前大盘还有考验半年线的要求，但是，维稳会使得收盘象征性地在3000点附近报收；2、考虑国庆期间，各地房市会促销，使得房市节日到处喜报连连，所以，若节日期间没有利好，国庆节后，大盘将大跌开局；3、但是，更严厉的跳空房市政策会出台，根据10月召开十八届6中全会的维稳和10月解禁大幅减少，我们判断，10月将是今年股市的黄金月，投资收益将会比较大！\n\n操作策略：长假以持币为主，规避节日期间利空，预计节日首日将大跌；节后股市大跌就立即开始分批买股，重仓持有，我们认为10月是股市金色的月份，第4季度赢利，主要靠10月！\n"
		},
		{
			"post_id": 706,
			"title": "国庆节前的最后一周，大概率还会下探3000点，也不排除会破3000，甚至周一就有可能直接低开，在日线级别形成局部小‘岛型’反转",
			"date_published": 1474683108.836,
			"body": "Blog post body"
		},
		{
			"post_id": 705,
			"title": "主力的思路是要用时间换空间的缓跌，进而形成下跌趋势中的层层小套牢，这个手法并不是要套住散户多么深的幅度，而是要在反复下挫中摧毁多头的信心，长期目的是要在大行情来临的时候散户真的不敢追",
			"date_published": 1474681476.759,
			"body": "Blog post body"
		},
		{
			"post_id": 704,
			"title": "从上证指数的主力思路上推断，如果3050点以下是底仓成本区的话，在8月15日突破后合乎逻辑的运动应该是快速脱离底部成本区，即便是回踩一下，也应该是蜻蜓点水式----一踩就起！而当前在突破3100点之后，回踩时间已经接近20个交易日，完全没道理给散户这么长的买入时间，难道要等散户充分上车后再集体起飞吗？这个套路完全有悖于博弈论的逻辑！如果不是要散户充分上车后启动，那么必然是等散户充分上车后撂挑子。",
			"date_published": 1473162365.704,
			"body": "Blog post body"
		},
		{
			"post_id": 703,
			"title": "早晨交易所的计算机主机撮合的方法和平时不同，平时叫连续竞价，而早晨叫集合竞价。每天早晨从 9：15分到9：25分是集合竞价时间。",
			"date_published": 1472558669.099,
			"body": "Blog post body"
		},
		{
			"post_id": 702,
			"title": "New blog post",
			"date_published": 1472470070.726,
			"body": "北京，房价相当便宜。区位最好的瓦房，基本上相当于工薪阶层每家平均月收入的两倍多。即使是四合院，价格也不算贵，大文豪鲁迅在北京买过两回房，第一次是1919年，鲁迅和弟弟周作人合伙买下西直门内的一座四合院，不算契税和装修款，花了3500块大洋。第二次是在1924年，鲁迅和周作人闹分家，他在阜成门内买下另一座四合院，不算契税和改造费，花了800块大洋。\n　　这个价格是高是低呢？当时鲁迅任教育部公务员，并兼任北大国文系和高等师范等校讲师，月收入一共是200～300大洋左右。因此，四个月的工资可以买北京一套四合院，确实便宜。"
		},
		{
			"post_id": 701,
			"title": "目前的这波走势在前面看似和4月20日之后的很相似，但现在看来实际上和去年11月27日之后的走势更像。当时就是在大盘见到3678高点后逾11月27日出现一根大阴线，随后大盘用了17个交易日将大阴线收复并再创新高，但这也只是个双头而已，而随后便出现了一波千点杀跌。当时就是沪指很强，后来见3684点创新高，但中小创却相对较弱，未能创出新高。当时也是房地产板块异军突起，强势拉升，而现在也是一样（见上图）。现在的走势可以说与去年那一拨非常相似，而这一次最终也极有可能做出一个双头。而从更大的周期来看，上一次是自11月初做了一个左侧小双头的大型复合双头；而这一次是自4月3097以来的一个小双头在右侧、时间跨度更大大型复合双头。\n",
			"date_published": 1471093690.01,
			"body": "Blog post body"
		},
		{
			"post_id": 700,
			"title": "本次局部牛市很可能是快牛，而不是慢牛，这从这两天银行指数的飙升可以看出，所以，珍惜机会，是关键",
			"date_published": 1471011373.78,
			"body": "Blog post body"
		},
		{
			"post_id": 699,
			"title": "两天来金融涨幅巨大，下周一将冲高受阻，建议在金融回落的时候，重点关注券商股，它在下周将代替银行领涨，买入它的时机，在下周调整时。",
			"date_published": 1471011339.365,
			"body": "Blog post body"
		},
		{
			"post_id": 698,
			"title": "高派息股成为大资金买入的首选",
			"date_published": 1471011293.449,
			"body": "Blog post body"
		},
		{
			"post_id": 697,
			"title": " 2014年11月17日，沪港通正式开通。当年11月开始大盘拉出了持续半年的主升走势,金融等蓝筹股持续启动领涨,而之前几个月大盘已开始走稳,同样是金融等蓝筹股率先回升。\n\n    目前深港通已取得较大进展,年内或可望开通,近期银行股等走强或对未来市场的走势先知先觉。\n\n历史走势会否重演,不妨拭目以待,当然在杠杆效应大为收敛下,重演疯牛的走势似乎不现实,但走出合理的收复行情仍是可期待的。\n",
			"date_published": 1471010725.774,
			"body": "Blog post body"
		},
		{
			"post_id": 696,
			"title": "短线上看，今天大盘一阳吃两阴，如果周末有利好出台，则下周一大盘必将高开高走再收中长阳；如果周末没有利好出台，则下周一早盘或下周一全天将会出现小幅整理，整理之后最早在下周一尾盘，最迟在下周二，大盘仍将再度向上拉升。",
			"date_published": 1471010284.31,
			"body": "Blog post body"
		},
		{
			"post_id": 695,
			"title": "今天早盘股指长时间的横盘整理中，成交量是极度萎缩的，前两个小时的成交量竟然萎缩到仅有620.9亿元，连700亿都不到，如果不是尾盘的放量拉升，那么今天大盘的成交量绝对可以萎缩到1500亿元左右，甚至是1500亿元以下。今天下午经过前半个小时的极度萎缩之后，成交量开始随着大盘的回升而逐级放大，尾盘更是放量暴涨，所以今天大盘表现上看是缩量上涨，其实本质却是放量拉升",
			"date_published": 1471010200.818,
			"body": "Blog post body"
		},
		{
			"post_id": 694,
			"title": "打主力: 就是在多空搏杀中，通过对主力合约、主力品种的掌控来掌控全局（这次很可能是掌控金融股，然后控制全场）。而“接帽子”是和“抢帽子”对应的。抢帽子就是看到股票涨到很高很高，还往里冲。而接帽子就是看似股票涨的高了，机构自己也不买，结果自然会跌一下，但跌一下他立马就买回来，这叫“接帽子”。",
			"date_published": 1471004520.064,
			"body": "Blog post body"
		},
		{
			"post_id": 693,
			"title": "五大权重基本封杀了下跌的空间：  钢铁行业，三大利好一齐发力。供给侧改革去产能，钢铁行业直接受益，上半年实现利润增长。钢铁业合并转型加快速度，武钢和宝钢的重大重组方案正在酝酿中，华菱钢铁已经转型金融和节能发电了。再加上发改委近期强调的高铁经济对于拉动钢铁需求也有一定的帮助。\n\n  煤炭在上半年的经济数据报告中，也实现扭亏为盈，供给侧改革中发力点在煤炭行业，由于行业的地域性相对集中于山西、内蒙、陕西等大省，当前高层要求在11月底之前完成去产能的任务，煤炭价格也开始回升，基本上没有下跌的空间。\n\n  有色金属，供给侧改革持续发力，转型新材料案例频出，国际金属价格震荡反弹，同时黄金价格的持续高位，有色金属股价格基本上也相对稳定。\n\n  金融行业，银行券商中报业绩实现稳定增长，而且还担当供给侧改革最重要的一环，债转股方案的摸索，浦发银行和华夏银行刚发布的中报里，还出现国家队增持，有利于稳定市场。\n\n  房地产去库存加速度，从发改委的表态中可以看出来，还是很急于政策加力的，先有说择机降准降息、还有购房补贴促进地产去库存等等，房地产业绩有望集中于中报和年报体现。\n",
			"date_published": 1471003068.058,
			"body": "Blog post body"
		},
		{
			"post_id": 692,
			"title": "港交所:深港通即将开通；证金二季度增持华夏银行浦发银行；平安银行净利润近123亿元；花王股份和同益股份申购日；\n【板块信息】\n\n电容型镍氢电池获重大突破或改变电动汽车应用格局：时代万恒（600241）鹏辉能源（300438）等。\n\n国际智能停车设备展召开 智能停车产业：东杰智能（300486）五洋科技（300420）等；\n\n手机O L E D面板全盛时代即将来临：彩虹股份（600707）、深天马A（000050）等。\n量子芯片研究获突破性进展：凯乐科技（600260）、神州信息（000555）、福晶科技（002222）等。\n石墨烯薄膜生产速度提高150倍：中国宝安（000009）、方大炭素（600516）、华丽家族（600503）等。\n体育彩票十三五规划正式印发：粤传媒（002181）、鸿博股份（002229）、人民网（603000）中体产业（600158）等。\n",
			"date_published": 1470928778.068,
			"body": "Blog post body"
		},
		{
			"post_id": 691,
			"title": "中国太保",
			"date_published": 1470923558.384,
			"body": "Blog post body"
		},
		{
			"post_id": 690,
			"title": "格力电器",
			"date_published": 1470921452.539,
			"body": "Blog post body"
		},
		{
			"post_id": 689,
			"title": "大同煤业的魔咒就是如此，几次大同煤业涨停之后市场下跌，来了几次之后，自然就成了魔咒。并且多少还能讲点道理，毕竟煤炭股都涨了，说明多数股票都涨一遍，是该跌一跌了。 ",
			"date_published": 1470837696.169,
			"body": "Blog post body"
		},
		{
			"post_id": 688,
			"title": "大盘本次调整是回抽确认3000点突破的有效性，不是行情的结束，大盘会在2987附近止跌，重新走强，8月大盘会突破3100点",
			"date_published": 1470737578.97,
			"body": "Blog post body"
		},
		{
			"post_id": 687,
			"title": "在2016年上半年，百润股份(002568,股吧)的营业收入为4.20亿元，同比下降75.14%，亏损1.45亿元，而同期广告费却高达1.54亿元。",
			"date_published": 1470737576.316,
			"body": "Blog post body"
		},
		{
			"post_id": 686,
			"title": "do not worry about stock shooting up --- sell it, there is always a better one.",
			"date_published": 1470659060.214,
			"body": "Blog post body"
		},
		{
			"post_id": 685,
			"title": "但值得警惕的是，沪指虽上行但后劲不足，攻势并未一浪接一浪地出现，而创业板更是步履蹒跚，三把利剑可能抑制了A股上行的动力：1、央行发布的报告中明确了降准概率极低，“水牛”遥遥无期；2、上周共有9只新股发行，创下了年内新高，IPO提速徒然增加了市场资金面压力，投资者做多热情或下降；3、7月美国非农数据靓丽，加息概率激增，美国加息仍是资本市场的一颗大炸弹。",
			"date_published": 1470658704.243,
			"body": "Blog post body"
		},
		{
			"post_id": 684,
			"title": "A股可能受益的方向和标的包括：一是低估值、高股息的海外投资热门股。二是具有中国特色的行业或板块，如军工、白酒、医药等。",
			"date_published": 1470658615.81,
			"body": "Blog post body"
		},
		{
			"post_id": 683,
			"title": "高盛等三巨头发十万火急警告：抛售股票？",
			"date_published": 1470658443.801,
			"body": "Blog post body"
		},
		{
			"post_id": 682,
			"title": "一路下跌时候的交易买进的都是补仓或者抄底，这些都是投机力量，愿意不愿意让这些投机力量获利，直接反应了市场的态度。从1月跳水阶段的补仓成本在3100点，之后两次过3100点都不成，换而言之，至少到上个月，仍然不给那时候的投机者获利，现在离那时候过去了3周，是不是意愿有天翻地覆的变化呢？真的不好说。 \n\n而4月调整中的补仓成本在2950，虽然6月3日也没过，但之后7月的冲击直接就过了，并且最近的回踩2950后连续阳线往上走，显然在股灾之后的资金是愿意给他们获利机会的。这也说明眼下那是要筹码阶段。于是一个推论就出来了，既然要筹码，又不给股灾时的投机盘获利，唯一的选择也就是局部起行情了。\n",
			"date_published": 1470658077.962,
			"body": "Blog post body"
		},
		{
			"post_id": 681,
			"title": "上一轮反弹主角是万科，万宝之间的股权大战带动了整个市场的上行。最后不仅大股东之间陷入了僵局，还连带高位套牢了众多中小投资者。这次两市反弹的主角依旧是万科，只不过玩家换成了恒大。",
			"date_published": 1470657769.434,
			"body": "Blog post body"
		},
		{
			"post_id": 680,
			"title": "1、周二大盘冲高受阻，收盘为整理K线，小幅涨跌；2、周二冲高进入调整，延续到周三，但是，周三大盘可能放量上涨，本周周线收出中阳线的概率大；3、若周三开始放量坚决，则本波大盘不排除突破3069，并突破3097的可能。",
			"date_published": 1470657675.204,
			"body": "Blog post body"
		},
		{
			"post_id": 679,
			"title": "看过大老虎吃人吗？大老虎捕猎都是，慢慢地先往猎物跟前移动，待等距离一扑的射程了，一举拿下。指数可以用‘编小辫’的方式向3030--3050一线匍匐前进，等到距离前高不到1%的距离后，一次性发力拿下3100点，震荡后再冲3200点。",
			"date_published": 1470581639.508,
			"body": "Blog post body"
		},
		{
			"post_id": 678,
			"title": "海外都降息了 中国央行会不会跟风？",
			"date_published": 1470493877.752,
			"body": "Blog post body"
		},
		{
			"post_id": 677,
			"title": "中国公司持有的现金达到1.2万亿美元",
			"date_published": 1470493779.775,
			"body": "Blog post body"
		},
		{
			"post_id": 676,
			"title": "市场是池塘、是江湖、是大海，取决于参与资金的，资金小，是池塘，看涟漪；资金多是江湖，看波浪；资金巨大，是大海，看巨浪。",
			"date_published": 1470493229.85,
			"body": "Blog post body"
		},
		{
			"post_id": 675,
			"title": "既然石墨烯概念开始上涨了，虚拟现实，新能源，大屏幕，航空航天，军工股，都可能轮番上涨",
			"date_published": 1470492839.063,
			"body": "Blog post body"
		},
		{
			"post_id": 674,
			"title": "降息、降准，是宏观调控政策篮子的一部分，而未来几个月到底把握什么样的宏观调控方向，力度，需要等待北戴河会议，甚至等待六中全会（人士布局完成之后）。",
			"date_published": 1470492612.364,
			"body": "Blog post body"
		},
		{
			"post_id": 673,
			"title": "国企改革这是提了三十多年的概念，早已成为家常便饭，而且市场和国民对国企改革并没有明确的一致性诉求，对于改革目标的理解相差甚远，甚至高层对此的提法都存在很多模糊之处，在与各级国资委交流的时候，他们都一头雾水，几个土财主渲染一些概念，就能把事情说清楚吗？",
			"date_published": 1470492133.361,
			"body": "Blog post body"
		},
		{
			"post_id": 672,
			"title": "银行，它的业绩好坏取决于“三去”执行的力度，与公司本身的经营能力没有太大关系。什么时候银行板块补跌完成了，市场才算大体企稳",
			"date_published": 1470492082.627,
			"body": "Blog post body"
		},
		{
			"post_id": 671,
			"title": "券商股和保险股，都是大盘股，但他们的业绩严重依赖于资本市场的活跃程度，其业绩并没有独立性，市场下行周期业绩往往下跌80-90%，怎么能说他们是低估值的品种呢？",
			"date_published": 1470482108.761,
			"body": "Blog post body"
		},
		{
			"post_id": 670,
			"title": "which is the fuking one?",
			"date_published": 1470481985.141,
			"body": "创业板肯定会出现1-2个市值超过万亿的企业，与现在的不到千亿市值相比，未来的市场空间仍然巨大"
		},
		{
			"post_id": 669,
			"title": "中国白酒是怎么做的?",
			"date_published": 1470350690.401,
			"body": "中国白酒是怎么做的?\n\n　　华夏历史3000年以来，历朝历代的古圣先贤酿酒的首选材料都是纯粮，而纯粮酿造的酒有一点跟酸酯分离的裸体酒很有相似之处：“它们的酒液都是浑浊的”，所以历史上经常把酒称做为——浊酒。\n\n\\\n\n　　▲古法酿酒\n\n　　到了元朝才出现了蒸馏酒，但酿酒工艺还是在纯粮之中加入大曲、小曲或麸曲，然后在窖室中进行发酵，到了一定程度后粮食中的糖分会转化成乙醇，酒浆初成后再进行过滤，入酒甑蒸馏。酒甑在古代又叫天锅，形状像个大蒸笼。在锅中烧水，将加了曲精之后的酒糟放入到蒸锅里，用锅炉往蒸锅里压住蒸汽。乙醇的沸点是78.3度，而水的沸点是100度，所以在用蒸汽加热的过程中，水还没有沸腾，乙醇就已经先沸腾了，这样就可以将酒从酒糟里蒸馏出来。乙醇蒸汽会顺着锅盖上面的管子上行，经过冷凝后就得到了蒸馏酒。这就是传统白酒的酿造工艺和原理。\n\n　　这种酒的第一个特征是——用粮食发酵。因为粮食是固体的，而且酿酒的粮食都要整颗圆满无缺，所以这种酿造工艺被称为固态法，全称是“纯粮固态发酵法”。\n\n　　这种酒的第二个特征是一定要加曲。什么叫曲?曲就是——糖化发酵剂。粮食里的淀粉和糖必须要经过发酵才能转化为乙醇，而发酵需要有一个媒介来促进粮食的糖化，这个媒介就叫糖化发酵剂，也就是曲。曲和老百姓家里蒸馒头用的酵母是一类东西。有一种说法叫“粮为酒本、曲为酒骨”，充分说明了“曲”的重要性。为什么曲这么重要?因为曲决定了酒的香味，曲里面的微生物和微量元素决定了酒的风格和味道。\n\n\\\n\n　　▲大曲块\n\n　　曲有很多种。采用纯粮固态发酵法酿酒时加的是大曲，大曲是用麦子高温制成的，发酵期长，菌曲很长，微生物含量非常丰富。和大曲相对的是小曲，小曲是用米制成的，发酵温度低，发酵时间较短。最好的酒当然就是大曲酒，小曲的发酵方式及微生物、微量元素的含量跟大曲是不能相提并论的。除此之外还有第三种曲，叫麸曲。大曲是用麦子做的，成本较高。而用麸子、米糠之类的东西也可以制成曲，用这种曲做出来的酒就叫麸曲酒。北京的公交车上有一则广告，广告词是：“牛XX二锅头，朕喜欢，就是这个味。”商业广告不必深究，但我们应该知道，二锅头属于麸曲酒，皇帝是不可能喝麸子做成的酒的。\n\n　　好酒在酿造工艺上的三个基本标志就是“大曲、纯粮、固态”。这是传统的酿酒方法。不过显然现在的酒远非如此简单了，所以接下来要说的才是重点之重。\n\n　　1960年至1963年中国发生了很多大事，中苏断交，三年自然灾害爆发，导致粮食不够吃，饿死了很多人。党和国家的领导人认为即使粮食不够吃，酒还是要喝的，人民不喝酒建设社会主义怎么会有激情?那么粮食和酒之间的矛盾该如何解决呢?\n\n　　1963年，我们敬爱的周总理和方易副总理指示轻工业部，研究一种新的酿酒方法——不用高粱、大米之类的粮食，不用制曲，仅用廉价的芋头、薯杆、红薯、高粱秆、秸秆、甘蔗制糖后的废料等含糖的原材料来酿酒，或者更进一步，用这些原材料做出食用酒精，然后加水制成酒。\n\n\\\n\n　　▲53度酱香型茅台酒\n\n　　中国有五大酒都，第一个是泸州，第二是个古力，第三个是邛崃，第四个是宜宾，第五个是仁怀。除此之外，四川的射洪也是白酒的著名产区。这几大酒都，除了仁怀在贵州，其他都在四川。\n\n　　你到四川这几大酒都去旅游，会发现一个现象，街上的化工商店特别多，商店里都能够很方便地购买到乙酸、乙酯、苯甲酸乙酯、乙酸乙酯等化工原料，还有醇、醛、增辣剂等化学添加剂，所谓的塑化剂在这里也是可以买到的。\n\n　　就国家标准而言，酱香型白酒不能用水和酒精勾兑，只能用纯粮酿造。我们到街上去买酒，什么价位的酒都能买到，但是请注意一点，它们的国标都是一样的——GB/T10871。也就是说，无论什么价位的酒，都是按同一个标准酿造的，即纯粮固态发酵法。\n\n　　很多人喝了一辈子酒还是个酒盲，尤其很多退休的老同志，习惯于每天喝一点，他们不买很贵的酒，就在超市里买几块钱的廉价酒，甚至还会买用油壶装的大桶白酒。喝哪一种酒喝习惯了，别人问起他们：“为什么喜欢喝这种酒?”他们大都会说：“这个好，喝了一辈子了，是纯粮酿造的酒啊。”我只能非常遗憾地说：“那怎么可能!”粮食多少钱一斤?再加上那么复杂的制曲、发酵工艺，再说成本要多少?怎么可能那么便宜?\n\n　　所以不添加任何化学原料和食用酒精的酒只有一种，那就是酱香型白酒，技术上的全称叫——纯粮固态大曲酱香型白酒。\n\n　　很多人说：“我们农村有人拿粮食做酒。”这个我不否认，乡下的确有很多人用粮食来酿酒，那也属于纯粮酿造，但它不是商业化产品，大家买不到。而且纯粮酿造的酒也是有高低之分的。高粱是酿酒的最好原料，五粮液用的是高粱，汾酒也要用高粱，为什么?因为高粱酿酒是最香的，只有高粱皮里面含有单宁，其他的粮食都不含有这种物质。不同的高粱和高粱之间也是有区别的，糯高粱的市场价格已经涨到了4.2元一斤，而梗高粱每斤只要一两块钱。\n\n　　什么酒是最次的?\n\n　　玉米做的酒是最次的(云南等地也称为包谷酒)，因为玉米做的酒特别烈。很多酒厂用液态法或者固液法做酒的时候，连玉米酒都不用。玉米酒精主要用在哪里?主要用于制作乙醇汽油，东北粮库里面有大量的陈化粮，其中的玉米都被做成了乙醇汽油。\n\n　　现在大多数酒厂用的酒精有两种，一种叫薯干酒精，一种叫糖蜜酒精，这两种酒精市场价格基本在4000元至5000元一吨。用98度的酒精勾兑50度的酒，要加一倍的水，那么500毫升的酒成本才一块多钱，一吨酒加入的香精成本大概在200块钱左右，这样算下来，大多数液态法制成的酒一斤成本还不到2块钱。但就是这样的酒，配上华丽的包装就敢标价上千元。\n\n　　酱香型白酒只能以传统工艺酿造，五斤高粱酿一斤酒，原材料成本就要二十多元，再加上酒师、人工费用，一斤酒的酿造成本就达到了40多元，酿出基酒后还要进行窖藏几年。与之相比，浓香型的白酒生产周期只有一个月。\n\n\\\n\n　　为何领导人只喝酱香型白酒?\n\n　　为什么党和国家领导人喝酒都喝酱香型的白酒，不喝别的呢?因为他们非常清楚这里面的区别。在中国比地沟油、三聚氰胺、苏丹红、瘦肉精更可怕的就是——白酒，很多东西都是非法添加的，而白酒液态法又是符合国标的，是合格产品，所以很多酒我们喝了之后会头疼、口渴。\n\n　　政府管理企业外行不要紧，液态法合法也无所谓，但要把知情权还给我们。白酒出厂的标签上应该写清楚酿造工艺是固态法、液态法还是固液法，这是明确白酒品质最重要的一个标准，而国家对此居然没有要求，这证明政府的管理是业余的，这是对全国酒鬼最大的伤害。我并不是说液态法不好，但是为什么不写清楚是液态法?\n\n　　很多酒根本就不是酿造出来的，而是制造出来的。大家有兴趣的话可以做个实验，站在酒厂门口盯三天，计算一下它有多少辆拉粮食的车会进厂，有多少拉酒糟的车出厂。酒厂必然是有酒糟的，酿酒的烟囱也一定是会冒烟的。但是现在很多酒厂没有粮食进厂，也没有酒糟出厂，烟囱里也不冒烟。到工厂里参观一下你会发现，车间非常漂亮、干净和整洁。\n\n　　酒厂不可能是干净的，酒厂里的酒师不管一个月挣多少钱，他的穿着都会和乞丐差不多，这与卫生和文明无关，老祖宗几千年来都是这么教的。很多酒厂拍摄的广告片里，酒师穿着中式唐装的马甲和丝绸的灯笼裤，拿着崭新的铁铲在铲酒糟，这只是一种毫无根据的臆想，酒厂是没有这样的工作的。首先，铁铲不能铲酒，铲酒糟的工具叫宣板，是木头的，铁铲对于酒质会有影响。其次，酒厂里身份最低的人是铲酒糟的，酒师不可能去铲酒槽。\n\n　　总结一句话，酿酒有三种方法：固态法、液态法和固液法。\n\n　　现在市场上有很多人做酱香酒，但质量参差不齐。正宗的大曲酱香酒是坤沙，要九蒸九煮、八次加曲、七次取酒、三年窖藏。而市场上的酱香酒更多的是碎沙，生产流程简单，生产周期短，价格便宜，那些都不是正宗的大曲酱香白酒。\n\n　　为什么中央要打压白酒反对“三公”消费?在权贵经济的绑架下，出现了太多反人类的东西。高端白酒简直成了暴利行业，本不是纯粮食品，只有一两个月的生产周期，卖的却是天价。很多人以为用的粮食品种多酿出来的酒就好，殊不知金银铜铁再怎么混合，也比不上纯金。做酱香型白酒只需要用一种原料，那就是糯高粱。制曲也只用一种原料，那就是小麦，只有用这样才是正宗的酿造方法，但今天这样做的人已经非常少了。\n\n　　买酒时看到GB/T10871你就要小心一些了，一定要注意，标准酱香型白酒的国标是GB/T26760，二者是有区别的。\n\n　　如何鉴别酒的好坏\n\n　　要想鉴别酒的好坏，最有效的方法就是学一下如何做裸体酒。裸体酒就是给酒点一把火，把它的酒精烧光，把酒的衣服给扒下来，这个时候剩下的酒就叫裸体酒，这是一种酸酯分离的手法。纯粮酿造的酒做裸体酒之前是清澈透明的，做成裸体酒之后会变得很浑浊，入口细细品味会有粮食发酵的酸味，酸味之后会有一点淡淡的甜味，甜味之后又会有一点淡淡的酒糟味，舌根上还会带有一点淡淡的苦味。如果入口是像小便一样骚涩的味道，那它里面一定加了食用酒精——不管是薯干酒精、糖蜜酒精还是玉米酒精，它们都有这个特征。\n\n\\\n\n　　大家可以做个实验，在一个盘子里倒点儿酒，量不必多，盖住盘底就好，燃烧之后制成裸体酒，再把它倒入高脚杯里，看一下它是否是透明清澈的。纯粮酒中的乙醇燃烧完之后，剩下的东西就是粮食的发酵物，它一定是不透明的、浑浊的，喝到嘴里是酸酸的，后味是类似酒糟的甜香味。这是鉴别纯粮酒最简单的方法。\n\n　　先秦以来，中国白酒做的是从来不会有损身体健康的，但是现代人喝了酒之后大多会觉得头疼、头晕，那么原因可能有二种：\n\n　　第一是喝的酒太劣质了;\n\n　　第二是喝得太多了。（\n"
		},
		{
			"post_id": 668,
			"title": "1、周五大盘将冲高受阻，收盘为带长上影线的阴线；2、大盘下周将逐步靠近60日线，并最后跌破；3、大盘强支撑已经升到2882，因此，大盘跌破2900点随时会重新走强！\n",
			"date_published": 1470314874.095,
			"body": "Blog post body"
		},
		{
			"post_id": 667,
			"title": "三天沪市小阳，涨幅逐渐递减，从0.61%到0.24%，再到今天涨幅仅为0.13%，说明市场对反弹心态谨慎；在沪市2913-2915缺口未补前，大盘缺乏反弹空间，该缺口下周必然被补",
			"date_published": 1470314805.475,
			"body": "Blog post body"
		},
		{
			"post_id": 666,
			"title": "本周2、3、4的三连阳，是有瑕疵的，一则周四量能不济；二则如果周4、5出小阴缩量调整的话是比较完美的。本周四天这种K线组合要防‘变异下跌三法’的结构（参照K线语言课程），如果周五放量跌破2930点，则大概率将下探2807一线",
			"date_published": 1470308463.766,
			"body": "Blog post body"
		},
		{
			"post_id": 665,
			"title": " 下周不仅是张中秦给大盘短期反抽截止的时间点，同时也是正式进入奥运会期间的时间窗，市场表现值得警惕。",
			"date_published": 1470308243.387,
			"body": "Blog post body"
		},
		{
			"post_id": 664,
			"title": "北京时间8月6日星期六早上7点，里约奥运会正式开幕",
			"date_published": 1470308117.136,
			"body": "不仅是奥运会，欧洲杯等重大体育赛事期间，资本市场多是下跌。我们可以理解为这样的逻辑，散户、机构主力等投资者的目光转移至体育赛场，资本市场没有了聚焦，自然多是弱势市道。\n"
		},
		{
			"post_id": 663,
			"title": "下半年最确定的利好，就是深港通即将开通。按照正常运行时间来算，八月份应该会有相关消息公布，预计会在10月开通，一旦时间确定，那么利好最为明显的就是证券股了。",
			"date_published": 1470227190.614,
			"body": "Blog post body"
		},
		{
			"post_id": 662,
			"title": "真正高业绩、低估值的个股依然会迎来资金关注。从主力资金关注度而言，首先需要重点关注的就是证券板块。自本波调整以来，未有效拉升护盘，反而是在低位震荡。相信完成筑底之后，证券板块大概率迎来真正的反弹突破行情。\n",
			"date_published": 1470227158.032,
			"body": "Blog post body"
		},
		{
			"post_id": 661,
			"title": "欧洲银行业全面崩溃，银行股暴跌，欧洲已经在安全环境以及经济领域全面崩溃瓦解。欧洲崩溃短期对世界经济打击严重，对中国短期利空，但考虑到欧盟和北约即将解体，制约中国的势力也逐渐瓦解，长期利好中国的崛起。\n\n",
			"date_published": 1470224128.657,
			"body": "Blog post body"
		},
		{
			"post_id": 660,
			"title": "最大的消费 --- 汽车",
			"date_published": 1470224021.42,
			"body": "买上汽是好策略。"
		},
		{
			"post_id": 659,
			"title": "消费概念中的汽车以旧换新、汽车下乡、家电换新、家电下乡、智能家居、智能电器、旅游、商业、餐饮等等概念将再度焕发生机迎来政策利好",
			"date_published": 1470224005.809,
			"body": "Blog post body"
		},
		{
			"post_id": 658,
			"title": "再反抽后的下跌极有可能真正进入下跌周期",
			"date_published": 1470221028.481,
			"body": "Blog post body"
		},
		{
			"post_id": 657,
			"title": "上证指数20月线本月翻跌。历史上证指数20月线翻跌，后市必见新低，也就是说2638点必然要破，什么狗屁砖家唱多都没用",
			"date_published": 1470220976.371,
			"body": "Blog post body"
		},
		{
			"post_id": 656,
			"title": "本轮下跌持续了13天，中小创的跌幅也比较大。现在已经企稳，短线的低点已经出现。从时间上看反抽只进行两三天就彻底结束概率较低，反抽持续8天左右比较合理（至少5天左右",
			"date_published": 1470220788.928,
			"body": "Blog post body"
		},
		{
			"post_id": 655,
			"title": "1、周四大盘将形成反抽高点后进入调整，收盘为跌破5日线的阴线；2、大盘将逐步靠近60日线，并最后跌破；3、大盘强支撑已经升到2880，因此，跌破60日后，大盘将重新走强！",
			"date_published": 1470220536.729,
			"body": "Blog post body"
		},
		{
			"post_id": 654,
			"title": "周三大盘预计将低开后上补2972缺口，再下行，全天收盘为吞吃掉周二小阳的中阴线",
			"date_published": 1470134039.377,
			"body": "Blog post body"
		},
		{
			"post_id": 653,
			"title": "江苏银行上市，该股目前流通市值不足100亿，而银行板块比之高一点的也有近500亿，这让笔者想起第一创业第一天上市收盘流通市值仅为30亿，在大家不看好其业绩的情况下，结果它带动了券商股走了一大波，原因是比之大的市值也在接近200亿，目前江苏银行也大家不看好，原因自然是市盈率比较高（9.3倍），是否也会克隆第一创业呢？是否也会让银行股走一波呢？若能，那么，大盘就会被带动走一波反弹，所以，江苏银行的表现，是周三我们需要关注的",
			"date_published": 1470133853.852,
			"body": "this is a great observation. if right, then a good point to sell some 50 etf positions;"
		},
		{
			"post_id": 652,
			"title": "周三压力点在2977和2994，大盘反抽空间有限，周三不排除回杀的可能，但是，沪市60日线需要采取反复靠近的方式才能跌破",
			"date_published": 1470133498.581,
			"body": "创业板已经破；"
		},
		{
			"post_id": 651,
			"title": "今天的反弹只是技术上的反抽，反弹时间预计一天半左右；2、5日10日20日线空头排列，且5日与10日线开始发散，技术上来说，这个调整还将继续，2638与2807连线，目前大概在2858一带",
			"date_published": 1470133456.38,
			"body": "Blog post body"
		},
		{
			"post_id": 650,
			"title": "弱势炒本地股的惯例再现，今天沪市大炒上海本地国企改革股，本身就说明当前市场属于弱势",
			"date_published": 1470133331.622,
			"body": "Blog post body"
		},
		{
			"post_id": 649,
			"title": "2900--2935可大胆买入，2935--2970可高抛，2970--3010坚决抛",
			"date_published": 1470073662.943,
			"body": "Blog post body"
		},
		{
			"post_id": 648,
			"title": "“8月1日中午12点仅半天私募清掉8270家” 、“中国7月官方制造业PMI为49.9% 创5个月以来新低”，一大波去杠杆的组合拳，其意图是抑制资产泡沫，再加上经济数据不佳，我们不排除大盘进入中级调整，指数指向2827的可能",
			"date_published": 1470050890.223,
			"body": "Blog post body"
		},
		{
			"post_id": 647,
			"title": "炒股票的收益和下围棋的输赢差不多，下围棋赢半目和吃大龙级别一样，只要战胜对手就行。而炒股票不要算你这轮赚了多少赔了多少，而要看你这轮跑赢了多少人，是否跑赢了这个市场。如果你总是跑赢市场、跑赢大部分股民，最后的亿万富翁肯定属于你，没有任何悬念！\n",
			"date_published": 1470048039.771,
			"body": "Blog post body"
		},
		{
			"post_id": 646,
			"title": "有人说 --- 空仓也绝不能轻易买权重股、大盘股，因为沪市25年历史证明，权重股从来就没有跑赢过大盘，都是跑输大盘的领头羊，所以形势悲观的时候，中小市值股票做不了就休息，空仓也不买腐败透顶的老母猪！",
			"date_published": 1470047981.805,
			"body": "Blog post body"
		},
		{
			"post_id": 645,
			"title": "9月4-5号，G20领导人峰会",
			"date_published": 1469963966.347,
			"body": "Blog post body"
		},
		{
			"post_id": 644,
			"title": "监管层目前有很强烈的逼迫市场风格转换意图（逼迫游资进入大盘股，尤其是国企改革股票",
			"date_published": 1469717985.402,
			"body": "Blog post body"
		},
		{
			"post_id": 643,
			"title": "今天尽管一系列股仍在补跌，但是涨停板罕见地增加至25只了，其中，杭电股份涨停了、金运激光涨停了、名家汇涨停了、姚记扑克涨停了、新疆天业涨停了，这不是在于他们的技术反包，而是在于这里面继续在上演石墨烯、次新、3D、手游、博彩、借壳等所谓的“题材”敢于上涨。当有关权威者醒过味来时，那题材股的爆发将如同波浪一样来袭，让它如中国的房价一样越控越涨，如同泛滥的洪水一样越堵越猛。中国股市需要题材，中国的进步更需要题材！",
			"date_published": 1469713900.613,
			"body": "Blog post body"
		},
		{
			"post_id": 642,
			"title": "二线城市的房价暴涨",
			"date_published": 1469713581.849,
			"body": "Blog post body"
		},
		{
			"post_id": 641,
			"title": "结论是：1、继续认为后市大盘将在2910--3010之间做箱体整理，因此二分位2960之上不适合买股，靠近3010要减仓；2、周五大盘将在做月线的冲动下，个股行情复苏，涨停个股增加，但是，大盘收盘为小阴线，与周四K线形成并列形态；3、周五开始，个股进入新的炒作时期，重个股轻大盘风气重新回来。",
			"date_published": 1469713447.721,
			"body": "Blog post body"
		},
		{
			"post_id": 640,
			"title": "明天是收7月月K线日，由于月线对下月初具有强指引性，各路庄家会有强烈的做图形欲望，所以，周五大盘必然会有反抽，而能否上摸10日线，则取决量能能否放大，实际上只要不放量不能有效地站上10日线，下周一大盘必然会被回打",
			"date_published": 1469713380.17,
			"body": "Blog post body"
		},
		{
			"post_id": 639,
			"title": "从大的指数煤炭有色地产金融中小板创业板来看，只有煤炭指数受30日线支撑， 其它指数均跌破了30日线，从各指数互为验证定则来看，沪指跌破30日线是必然的选择",
			"date_published": 1469713220.057,
			"body": "true; but so waht?"
		},
		{
			"post_id": 638,
			"title": "start a new fund - sigma fund 50",
			"date_published": 1469712329.725,
			"body": "http://127.0.0.1:43110/1FeWMkG4Jf3GWSGwLkKdnbzFjk4oHV7DWw"
		},
		{
			"post_id": 637,
			"title": "大多数个股跌幅较大，元气大伤，再度进入上升趋势的难度加大，市场需要一定的时间来恢复被破坏的形态与人气",
			"date_published": 1469706630.427,
			"body": "Blog post body"
		},
		{
			"post_id": 636,
			"title": "陕国投A，分时上的交易非常明显，高位杀跌绿柱很小，跌到最后两个小时，杀跌爆发了。还有像君正集团，也是一样的情况，前面好几天都没多少杀跌主导的绿柱，到昨天出现一把猛杀，最后一小时的恐慌从杀跌绿柱的大小上都能感受到。但结果呢，全被轧空了。\n",
			"date_published": 1469706529.801,
			"body": "Blog post body"
		},
		{
			"post_id": 635,
			"title": "去年套到现在的筹码，昨天跌的时候会走吗？大概率是不会的。能走的都是五六月份刚买，现在都有利润，大跌一来多是逃跑。而这种逃跑如果引发了恐慌，那就有轧空的机会。 ",
			"date_published": 1469706440.813,
			"body": "Blog post body"
		},
		{
			"post_id": 634,
			"title": "一旦市场再次走弱或者反弹无力，那么这些短线抄底资金为了不被深套，就会选择止损离场，从而形成更多的抛压，对上次造成二次踩踏式下跌",
			"date_published": 1469706005.248,
			"body": "Blog post body"
		},
		{
			"post_id": 633,
			"title": "大盘未来几天可能会维持在2946-3000点之前的窄幅震荡整理",
			"date_published": 1469705921.69,
			"body": "Blog post body"
		},
		{
			"post_id": 632,
			"title": "现在到了兑现利润的时候，继续待着将是最后的“买单者”。操作上，继续逢高分批卖出盈利颇丰个股，降低仓位。",
			"date_published": 1469705754.519,
			"body": "Blog post body"
		},
		{
			"post_id": 631,
			"title": "六中全会10月召开，它的最主要任务是实现中国掌舵团队的新老交替",
			"date_published": 1469705489.933,
			"body": "Blog post body"
		},
		{
			"post_id": 630,
			"title": "蓝筹、改革、央企、白马",
			"date_published": 1469705292.498,
			"body": "所谓‘冲关拔寨用蓝筹’"
		},
		{
			"post_id": 629,
			"title": "三不买原则--不买突破点、不买大阳线、不买放量点。买支撑位、买止跌K线、买缩量点",
			"date_published": 1469705236.722,
			"body": "Blog post body"
		},
		{
			"post_id": 628,
			"title": "3400--3600的压力太大了，绝不是一轮行情就能打透的，上涨到3200--3400点之间应该能够停住了",
			"date_published": 1469705156.211,
			"body": "Blog post body"
		},
		{
			"post_id": 627,
			"title": "从今年4月20日开始出现了四次相对幅度偏大的单日暴跌走势，第一次是4月20日、第二次是5月6日和9日、第三次则是6月13日、第四次是6月24日，有一个简单的规律，这四次都是指数经历了单日暴跌走势后要么在大阴线的低位快速企稳，要么横向整理几天走稳，我要表达的是，这种规律性的单日暴跌都是一日游行情，也就是没有产生持续性下跌，所以大家也就习惯了箱体震荡，昨天的暴跌出现后，市场对后市相对还是比较乐观的。",
			"date_published": 1469704944.447,
			"body": "Blog post body"
		},
		{
			"post_id": 626,
			"title": "New blog post",
			"date_published": 1469704778.476,
			"body": "5G产业链上下游受益标的\n\n　　天线：信维通信；滤波器：麦捷科技；功率器件：三安光电；光器件：光迅科技、天孚通信、新易胜；主设备：中兴通讯、烽火通信、大富科技、武汉凡谷；传输：光迅科技；网优：亿阳信通、邦讯技术、世纪鼎力、华星创业；IT支撑：天源迪科、东方国信。\n"
		},
		{
			"post_id": 625,
			"title": "New blog post",
			"date_published": 1469704173.793,
			"body": "电子高景气细分领域\n\n　　1）3C自动化改造加速，无线充电有望兴起，武器装备信息化趋势明显。我国3C制造业体量巨大，产值高，企业多，发展空间大；无线充电技术具有方便、安全、空间利用率高等特点，我们测算2020年仅智能手机无线充电市场规模即可达到300亿元，电动车无线充电市场规模将达百亿规模；在信息化军备领域，电子元器件可广泛应用于计算机、通信系统、传感系统、定位系统中。\n\n　　2）增量信息：苹果主导自动化改造、无线充电突破瓶颈、军民融合政策落地。苹果产品立足高端市场，一直以来都是新技术应用的领导者。2016年是苹果采购大年，预计相关企业将会受益；无线充电瓶颈持续突破，大规模商用可期；2016年3月发布的《关于经济建设和国防建设融合发展的意见》将军民融合发展上升为国家战略。目前我国军民融合度为30%左右，处于初步融合向深度融合的过渡阶段，有较大成长空间。\n\n　　3）电子高景气细分领域重点关注标的\n\n　　3C自动化改造：大族激光、长盈精密、智云股份、长园集团；无线充电：欣旺达、信维通信、天通股份；武器信息化：中航光电、高德红外、振华科技、航天电器。\n"
		},
		{
			"post_id": 624,
			"title": "智慧停车",
			"date_published": 1469704068.815,
			"body": "智慧停车重点标的\n\n　　捷顺科技：公司的智慧停车系统市场占有率第一，且拥有众多大型房企战略客户，卡位优势得天独厚；\n\n　　东杰智能：公司目前机械式立体停车系统营收比重为6.26%，公司计划设立多个区域性的停车运营公司；\n\n　　五洋科技：收购标的伟创自动化深耕立体车库多年，未来不仅受益于行业高增长，更受益于行业集中度提高带来的红利。\n"
		},
		{
			"post_id": 623,
			"title": "石墨烯",
			"date_published": 1469703998.602,
			"body": "石墨烯\n\n　　“新材料之王”石墨烯开启万亿市场蓝海。石墨烯在强度、比表面积、柔性、导电性、导热性及透光性等各方面都达到了目前已知的“世界之最”，在很多领域石墨烯将是硅和碳纳米管的完美替代者。未来石墨烯将主要用于“超级电容器”、“触摸屏”、“结构材料”、“传感器”、“高性能计算机”等五大领域。\n\n　　增量信息：看好石墨烯的理由：a.政策支持力度不断加码；b.国内外已经在一些方面实现了石墨烯技术的突破；c.产业和学校科研建立了良好的合作关系，共同推动石墨烯产业发展；d.不断有专利、新技术的出现，中国领先全球。\n\n　　投资建议：我们认为具有核心技术储备以及拥有较大资金支持能力的公司将迎来高速发展时代，建议关注中国宝安、华丽家族、烯碳新材、方大炭素。\n"
		},
		{
			"post_id": 622,
			"title": "国企改革等内部经济关键改革上却进展不大，雷声大雨点小。与外部改革相比，内部改革涉及利益；改革是革既得利益者的命，却又要同一班既得利益者去执行改革，结果可想而知。中国陷入的恐怕不止是流动性陷阱，更是改革陷阱。\n",
			"date_published": 1469632531.096,
			"body": "Blog post body"
		},
		{
			"post_id": 621,
			"title": "当前暴跌一次，筹码就被狂吞一次，当市场整顿清空重来之时，3000点上面就没有多少压力了。所以，再上3000点时就不象此前那般纠结了，彼时，会有轰轰烈烈的行情出现",
			"date_published": 1469632139.366,
			"body": "Blog post body"
		},
		{
			"post_id": 620,
			"title": "近期MACD指标显示，有将近50%的上证综指成分股，释放卖出信号，高于两周前的5%。据彭博社报道，上次看空信号比例如此之高是在4月份，随后大盘跌了9%。",
			"date_published": 1469630657.763,
			"body": "Blog post body"
		},
		{
			"post_id": 619,
			"title": "预计明沪市高开高走，上冲3069点之上画月线，正式的反弹开始了。开盘后瞬间上拉至3024点之后，再慢涨上冲3069点。",
			"date_published": 1469630348.871,
			"body": "Blog post body"
		},
		{
			"post_id": 618,
			"title": " 据穆迪估算，去年中国影子银行业资产增加30%，达到近54万亿元人民币（8.10万亿美元），这相当于中国总经济产出的约78%，相当于银行业资产的27.6%。\n  2011年影子银行业产品占银行业总资产比重为17.2%，2014年这一比重增长至24.3%。\n\n  “总体杠杆增加及影子银行业活动进一步扩张推高了金融风险，”\n",
			"date_published": 1469630255.137,
			"body": "Blog post body"
		},
		{
			"post_id": 617,
			"title": "大盘周四探底后，跌势将进入尾声，个股行情将再起，我们认为低估值个股将逐步取代题材股，成为市场热点",
			"date_published": 1469629046.839,
			"body": "Blog post body"
		},
		{
			"post_id": 616,
			"title": "午后保险银行拉抬显然是国家队护盘，说明2939离国家队容忍的低点不远了",
			"date_published": 1469628894.149,
			"body": "Blog post body"
		},
		{
			"post_id": 615,
			"title": "东北特钢债务违约困局：债权人坚决不要\"债转股\"\n",
			"date_published": 1469625753.59,
			"body": "Blog post body"
		},
		{
			"post_id": 614,
			"title": "华为手机半年成绩单：出货6056万 全国第一全球第三",
			"date_published": 1469625197.834,
			"body": "Blog post body"
		},
		{
			"post_id": 613,
			"title": "李克强：加大法制化市场化去产能力度",
			"date_published": 1469624994.534,
			"body": "Blog post body"
		},
		{
			"post_id": 612,
			"title": "未来市场将会是严重的政策性主导的姿势，央企、国企、国企改革必定卷土重来",
			"date_published": 1469622327.347,
			"body": "Blog post body"
		},
		{
			"post_id": 611,
			"title": "周三两市仅166家个股收红，近一半个股跌幅5%以上，两市成交量都有了50%以上的放大，两市总成交额超过了8000亿，超过7月12日的反弹创下了近期成交量记录。以上数据说明周三A股已经陷入极度恐慌中，恐慌性出逃非常明显",
			"date_published": 1469621877.522,
			"body": "Blog post body"
		},
		{
			"post_id": 610,
			"title": "改革概念，弱市中强势，印证了主流判断，即与政治局会议密切相关的改革板块，尤其是沪深本地国资改革概念股以及基础设施类国资概念，强势红盘，这是中期行情一支可靠的新增主力。",
			"date_published": 1469621363.636,
			"body": "Blog post body"
		},
		{
			"post_id": 609,
			"title": "对不对是个傻逼就有个理论，that is fine --- 创业板中业绩不好的，有问题的个股，资金开始大举出逃，造成了不良的循环作用，致使大盘出现断崖式下跌，这才是今天大盘大跌背后的秘密",
			"date_published": 1469617926.238,
			"body": "Blog post body"
		},
		{
			"post_id": 608,
			"title": "资金脱离绩差股及问题股，逐步向绩优个股集中",
			"date_published": 1469617872.401,
			"body": "Blog post body"
		},
		{
			"post_id": 607,
			"title": "牧原股份\n002714",
			"date_published": 1469540232.66,
			"body": "- divident not stable\n- volatile \n- seems there is something fony about this stock"
		},
		{
			"post_id": 606,
			"title": "周三能冲多高？看量！",
			"date_published": 1469537697.362,
			"body": "Blog post body"
		},
		{
			"post_id": 605,
			"title": "亿元工业明胶流向八省餐桌 食品安全再上风口浪尖\n",
			"date_published": 1469535973.908,
			"body": "Blog post body"
		},
		{
			"post_id": 604,
			"title": "这一波的上升速度到目前为止都是比较慢的，虽然我们不排除后面可能会有加速的动作，可是如果不形成加速，而始终按目前的速度缓慢上攻，这途中会有一次较大的回撤。",
			"date_published": 1469535418.921,
			"body": "Blog post body"
		},
		{
			"post_id": 603,
			"title": "俄罗斯和日本当年房价都崩盘了，俄罗斯以卢布计价没跌，但过了半年也跌了；日本以日元和美元计价都跌了。",
			"date_published": 1469534686.45,
			"body": "Blog post body"
		},
		{
			"post_id": 602,
			"title": "三四线城市的大多数，房地产价格肯定垮了，不管货币怎么贬，利率怎么变。一旦当地产业和人口失速，跌破建筑成本也是可想而知的。我已经在最近的日子里看到了破败的城镇，是如何的景象。",
			"date_published": 1469534571.732,
			"body": "Blog post body"
		},
		{
			"post_id": 601,
			"title": "在过去的数年里，前所未有的货币泛滥，数量级的投放，和成本上的低利率，迫使资产价格上扬，除了股市、债市，就是房地产。大宗商品除了今年反弹，反而歇菜了，因为经济已经垮了。",
			"date_published": 1469534528.9,
			"body": "Blog post body"
		},
		{
			"post_id": 600,
			"title": "九十年代中期之后，你买一些股票到现在，翻几百倍都有了。",
			"date_published": 1469534471.212,
			"body": "Blog post body"
		},
		{
			"post_id": 599,
			"title": "价值七百多万，首付等等不说了，单税收付出了七十几万的现金。是那么容易让你炒房子获利吗？",
			"date_published": 1469534399.24,
			"body": "Blog post body"
		},
		{
			"post_id": 598,
			"title": "周二指数的无量反弹不排除市场主力刻意做高指数的可能，其目的就是诱惑更多场外资金和场内投资者加大投入。这从大部分个股的TOP数据上就可以看出，周二大部分个股是超大户和大户卖出，中户和散户在买进。因为在目前这样的成交量之下，之前介入热点概念较深的机构是无法全身而退的。只有拉高空间才有可能做到逐渐出逃。A股永远要记住：所有的无量上涨都是耍流氓！",
			"date_published": 1469531201.068,
			"body": "Blog post body"
		},
		{
			"post_id": 597,
			"title": "周二上证指数涨了超过1%，但是成交额只比周一多了100亿。而深证涨了超过1%，成交量却比周一少了167亿。",
			"date_published": 1469531050.124,
			"body": "Blog post body"
		},
		{
			"post_id": 596,
			"title": "周二交易一结束，满眼都是“A股中阳反弹”的字眼。其实周二A股双双都只涨了1%多一点，充其量也就是一个小阳线，离中阳有着很大的距离。对于指数，中阳基本以上涨2%为标准。1%的上涨只能算是小幅上涨，不要盲目夸大周二阳线的意义。\n看点二：要命的成交量。\n",
			"date_published": 1469530989.241,
			"body": "Blog post body"
		},
		{
			"post_id": 595,
			"title": "重大利好：流行很久的大股东高位套现，杠杆配资定增后又增加股份的招数，被证监会堵死了。这意味着，大股东掏空上市公司的传统做法已经被认定为“剥夺中小散户”行为，以往上市公司和关联方把股市当提款机日子属于“非法”。这是证监会今年以来做的最重要、最正确的一件事。",
			"date_published": 1469530760.928,
			"body": "Blog post body"
		},
		{
			"post_id": 594,
			"title": "这两周的目标是3100点，夏季反弹已近尾声，小心立秋后的风险，注意这两周内的高抛机会。",
			"date_published": 1469529810.313,
			"body": "Blog post body"
		},
		{
			"post_id": 593,
			"title": "看看傻逼真是赶超或 --- 环保概念股在配合市场能源趋势利好影响下，容易强势拉升，比如PM2.5概念股山大华特近期逐步以大阳线的形式间隔的将股价拉升；再如三聚环保，概念持续创新高，走势非常强，所以大家可以在环保板块掘出大牛股。",
			"date_published": 1469529692.767,
			"body": "Blog post body"
		},
		{
			"post_id": 592,
			"title": "20日线支撑住之后我们是不是可以大举做多？我认为不是。反弹的力度并不强，量能也没有能够跟上，热点也不够有吸引力。实际上再下探一下买点会更踏实，但一开盘券商、有色、煤炭走强，盘口告诉我们多方主力暂时不想向下。",
			"date_published": 1469529425.682,
			"body": "Blog post body"
		},
		{
			"post_id": 591,
			"title": "贵重金属、白酒、煤炭在经过了近半个月的调整之后，今天再次出现上涨，并且今天一天的涨幅几乎收复了之前一周调整的幅度",
			"date_published": 1469529194.593,
			"body": "Blog post body"
		},
		{
			"post_id": 590,
			"title": "挑战年线3150点",
			"date_published": 1469529143.75,
			"body": "Blog post body"
		},
		{
			"post_id": 589,
			"title": "滞涨股补涨，超涨股压盘出货，部分个股在底部、部分个股在腰部、部分个股在顶部，显示庄的实力不同，也印证这里不是牛市，牛市应该齐涨齐跌",
			"date_published": 1469529088.987,
			"body": "Blog post body"
		},
		{
			"post_id": 588,
			"title": "短期资金坐庄个股，操纵股价，这一点证监会竟然默认了，到现在都没有出手监管一次。其实这类资金做短庄模式对散户的伤害更大，因为这基本上是一种股价操纵。上峰水泥就是典型的案例，如果不明真相的小散在高位买进，几天就吃到十几个点的跌幅。这种形态上看似经历过题材炒作，但是背后的市场资金参与机理却完全不同。题材是市场合力的结果，是大家一致预期涨到一致预期跌导致的轮回。而上峰水泥这种，是一小撮大资金进行人为操纵的结果。\n",
			"date_published": 1469528189.519,
			"body": "Blog post body"
		},
		{
			"post_id": 587,
			"title": "会有回踩需求（特别在不算强势的市场），不成功亦会遇阻回落，所以追高万不可取。期待的机会只能是第二次回踩到20日均线能再次起跳。\n",
			"date_published": 1469528186.519,
			"body": "策略 - 冲高继续卖出；回落回补；高抛低吸"
		},
		{
			"post_id": 586,
			"title": "阴跌",
			"date_published": 1469460735.567,
			"body": "Blog post body"
		},
		{
			"post_id": 585,
			"title": "thinking of last year",
			"date_published": 1469460044.525,
			"body": "6月5日，周五，沪市指数开盘5016点，收盘5023点，站上5000点整数点大关。在这天我写私人操盘日志博客的时候，特意的加了一句，“市场已经进入高风险区域，短线是天堂，中长线是地狱，如果你的钱是亲生的，当前的市场只能做短线，千万不能有长线持股不动的想法。”\n这个周末，我有三场朋友约会。\n那五千万亏了三千多万，我这一个亿赚了六百万。\n周五的一场是一个非常有实力的房地产老板约请我的的饭局，这个饭局的主题是大老板想拿巨资请我帮他炒股票。如果是一般的企业家在这个点位提出这个要求，我会告诉他股市已进入高风险区，拒绝合作的，但是这个大老板对我有旧恩，他曾经在2000点多一点的时候就想请我帮炒股票，那时我因故没有答应，这次我犹豫了一下然后答应了，我担心，如果我不答应帮他炒，或许他还会去找别的高手，这样很可能会把钱赔了。但是，我多了一句嘴，说现在指数有点高，我会做的比较谨慎，而且短线为主，对收益率不能期望太高。\n要是我当时不说这句话就好了，可能是因为这句话，让他感觉到我信心不足，导致他给了我一个亿的资金，还给了另外一个高手五千万的资金。在今年（16年）春节2700点停止合作的时候，据说那五千万亏了三千多万，我这一个亿赚了六百万。\n我有种直感，这个小伙子可能没有把钱赔光，反而是大赚了一把，远走高飞到国外快活去了。\n周六是第二场，聚会的都是一些私募的朋友，大家谈到行情的时候，大家最感兴趣的话题有两个，一个是部分公募基金狂拉小盘高价股，哪个基金的重仓股不到一个月就翻了一倍；另一个是讲疯狂的配资，说南方一些省份的配资可以1配10，一千万可以赔一个亿。有一个年轻的小伙子忽然对1比10的配资产生了浓厚的兴趣，跟我说，“花老师，你帮我看看，有一个盈利模式你看有没有问题，我先买进一个100块钱的小盘股，股价高容易建仓，然后拉高，最后用1千万配资1个亿在高位边拉高边接货我的底仓，配资的那部分能出多少是多少，最坏是配资公司选择平仓把那1千万赔了，但是综合来算，还是暴赚。”我回答他，“这个模式没问题，你就不害怕，配资公司赔了钱不会找你算账？”小伙子问：“你刚才不是说场外配资不是违法的吗？”我说，“是啊，但是万场外配资的人，多数不是好惹的。”\n后来，股灾发生的时候，听说这个小伙子1比10配资的那只股票连续跌停，这个小伙子与我们这帮人失去了联系，大家都说找不到他人，就连他的女朋友也失踪了，可能是把钱赔光了。我有种直感，这个小伙子可能没有把钱赔光，反而是大赚了一把，远走高飞到国外快活去了。顺便说一句，这个小伙子原来很喜欢与我讨论孙子兵法和三十六计。\n如果我说清仓，一定要把股票全卖掉，如果犹豫，可能会……\n最后是星期天那场约会是我们几个羽毛球俱乐部的球友，星期天下午打完球后去八号公馆洗澡，一起聊聊股市，晚餐的时候，我本来就想给几个球友警示一下风险，谁知在央视工作的李小鸟率先问我，“花哥，你在《百战成精》里说，市场大行情涨到高市盈率的情况下，很容易出现暴跌，现在是不是很危险了，我想收收不干了，把融资还了，把房子贷款还了。”我回答他，也是同时告诉另外两个股友，“现在的关键点就是保，别买单，不跌则已，一跌肯定会非常的狠的，但是牛市最后一段又比较有诱惑力，所以我认为是，短线是天堂，中长线是地狱，现在收手不干也是可以的，但是在高位的时候个股短线挣钱也很快，大家都很疯狂，也可以控制仓位做短线，每只股仓位不能大，并随做好空仓的准备，一旦势头不对，卖股票要果断，千万不能犹豫，否则会死人的。”\n晚上回家后，我又专门发微信告诉几个比较熟悉的股友，如果我说清仓，一定要把股票全卖掉，如果犹豫，可能会死人。\n这轮行情的最高点是6月12日出现的，5178.19点，一个值得人玩味的数字。当时我持有的股票是华泰证券，针对的题材是江苏银行即将IPO上会（华泰证券持有江苏银行的股份，属于受益股）。15号星期一大盘大跌103.36点，16号星期二大盘再大跌175.56点，技术出现负连续，并且跌破了我的操作系统的短期生命线，我赶紧把华泰证券卖掉了，好在两天大盘大跌时它的股价还是涨的，然后在我的花友微信群中说，我把华泰证券卖了，空仓了，暂时也不敢买股票了，要把这轮行情的收益保住。我说过这话后，与我交往时间比较长的股友，比如说避暑山庄的，爬山队的，基本上都把股票卖掉了，但是一些新结识的股友比较犹豫，他们还想观望观望，绝大多数人是不愿意空仓喜欢永远持股的。\n\n晓禧说，“没事，花哥，我盯着30日线呢，一破我就砍。”\n我们每周二收市后，爬山队股友集体爬山，这时大多数爬山队的股友都已经大幅的减仓了，少数人有少部分仓位，只有晓禧和张老实是满仓。讨论行情时，我说这个位置股价有可能反抽，但速度可能会很快，动作慢的话不如不做，我是暂时不打算再进了，如果明天反弹，还得卖。说完后，我专门点了三个股友，晓禧、张老实、恩莲，我说，“别人我不担心，就担心你们三个被这次可能的暴跌伤住，你们都有价值投资的思维倾向”。\n晓禧说，“没事，花哥，我盯着30日线呢，一破我就砍。”\n我说，“前些时，股票涨的太猛，如果跌破30日均线再砍，损失太大，甚至有看不下去的可能了。”\n事实证明我的担心是对的，晓禧是跌破60日均线才砍的，张老实是晓禧苦口婆心的再三劝导下，跌了1000点后才把大部分股票卖掉的。\n\n这是我开微博拉黑骂人者最多的一天。\n17号周三上午大盘又跌了100多点，但是下午指数出现逆转，收盘的时候沪市指数反而上涨80.47点。\n6月18日周四，跌162.37点。\n6月19日周五，跌307点，千股跌停。\n接着是端午短假期。在端午节假期20号我发了一条微博，“【周末谜语】谜面：第一阶段、关门打狗，第二阶段、温水煮青蛙，第三阶段、痛打落水狗，第四阶段、温水煮青蛙，5、坐老虎登、灌辣椒水。谜底打一股市用语。”\n6月23日周二，大盘上午一度跌了100多点，下午收盘时拉回，涨98.13点。\n在下午我看见一个股友发微博，让大家不要怕，“洗洗更健康，不到6000点非好汉！”我转发并跟他开玩笑说，“小心没大错啊，现在趋势已经坏了，这轮下跌有可能跌到3000点以下。”\n没想到，这下子把马蜂窝捅了，几百个网友骂，跳着脚骂，我一看骂人的微博介绍，有公务员，有中学老师，有医生，有退伍军人，有边远地区的人……好家伙，在股市里赔钱的人，真TMD的恶毒，我估计连周星星都不一定能抗住，于是，我就在收市的时候把这条微博删了，然后去爬山了……\n晚饭的时候，我看了一下微博，依然是一大片的谩骂，可想象出骂人者是跳着脚骂的。\n有一次我同一个台湾演员讨论我写的股市小说《操盘手》改编成电影电视剧时，他说过一句话，“你们大陆演员演贪官和坏人，演的真像啊，演的真是好。”\n由于骂人的网友集中攻击我的一个事情是，我把那条写要跌破3000点的微博删掉了，他们要求重新发出来，否则就骂个没完，于是吃完晚饭的时候我按“疯子”们的要求又发了条微博，“【我现在的市场感觉】1、5178点可能是重要头部，即使不是今年最高点也是附近；2、今年下半年沪指可能跌破4000点，明年可能跌破3000点，年底1赢2平7亏的定律可能会依然有效；3、银行股、券商股基本面可能下行，30元以上股可能是重灾区；4、融资者、中长线者、有最低仓限的公募基金投资者可逢高离场？”\n结果，这条微博又是一大波骂声。没办法，我拉黑了200多个疯子，这是我开微博拉黑骂人者最多的一天。\n也许是天意，这条微博再次提醒了一些头脑尚属清醒的股友。\n也许是天意，这条微博再次提醒了一些头脑尚属清醒的股友。\n我们微信群里美女环球小姐启涵看见了这条微博后，问我发这条微博是赌气，还是心里真是这么认为的，我说，我是真心这么认为的。于是，她第二天就把满仓加融资的股票全卖掉了，后来她听配资公司的人说，她是这个配资中极少数赚钱卖掉的幸运者，有不少人其后把钱赔光了，环球小姐到底是环球小姐，素质就是比一般人高。\n我知道第二天卖掉股票还有微信群里的一位上海的女股友，她满仓加融资2个多亿第二天割掉的，回撤了几千万，卖掉后，她的股又涨了一些，在群里的发言有点后悔的意思，我鼓励她，“不用后悔，也许你这次卖股票是人生最重要的一次行为，如果今天大盘不涨，这么大量的股还不好卖呢。”\n也有舍不得的，群里的一位广东的女企业家，问我，“现在管理层一直再出利好，我的投资顾问说已经跌到位了，我的股票属于有题材的好股，是不是可以不卖，长线持有。”我回答说，“大行情后的熊市暴跌，最怕三种思想，1、我的股好，不用怕；2、等反弹，少赔一点再卖；3、做长线，留给孙子。你的股能不能抗跌，我拿不准，但是大多数人，持股不动，也许人生最慘疼的一次教训就即将发生。”这位女企业家到底没卖，她后来跟我说，这是股灾确实是她人生最惨痛的一次教训，连续多天晚上睡不这觉。\n\n这天尾市我开始少量的抄底，记得买的重庆水务。我计划，按照操作系统的指引，稍微谨慎些分批抄底，先是指标股，再是绩优股，最后是超跌股。\n6月24日，星期三，大盘上涨了113.66点。这是最后的逃命机会，大多数个股连续跌停的走势开始了。\n6月25日，星期四，跌162.37点，一大片跌停。\n6月26日，星期五，跌334.91点，千股跌停。\n6月27、28日，周末休市。\n6月29日，星期一，跌139.84点，一大片跌停，这天指标股上涨修饰指数，比如中国石油这天上涨3.99%。\n6月30日，星期二，上午千股跌停，市场非常绝望，根据我的实战经验，我此时做好了短线抢反弹的思想准备，并发了一条微博，“接到了好多求救的私信和v信，说什么的都有，没法一一回答，这里统一回答一下：再坚持4个小时吧！罗文《万里长城永不倒》”。11点多，我看见许多股票在跌停板上出现了密集坚决的大买单，于是也在几个自选股的跌停板上买进了一些，临近中午收市的时候，指数出现了迅猛的急拉。下午指数继续上漂，尾市收盘的时候，上涨224.19点，指数收在4277.22点。\n7月1日，星期三，上午指数还算平稳，由于昨天的反弹短线收益还可以，我就把股票全卖掉，落袋为安，抢反弹可不能犹豫，玩成了中线，赚钱不卖亏钱卖。尾市一个小时，风云突变，大盘急速跳水，前两天护盘的中国石油也顶不住了，下跌223.52点，千股跌停。\n7月2日，星期四，大盘再跌140.93点，千股跌停，虽然这天沪市指数只跌了-3.48%，但是指标股中石油倒是涨了8.75%，工商银行上涨了5.84%，这两只指标股我都少量买了一些。\n7月3日，星期五，指数跳空低开，大跌225.85点，千股跌停，市场极度恐慌。这天尾市我开始少量的抄底，记得买的重庆水务。我计划，按照操作系统的指引，稍微谨慎些分批抄底，先是指标股，再是绩优股，最后是超跌股。\n大家不太像来参加股市研讨会的，倒是像来参加股市英雄们的追悼会的。\n又到周末，我应邀去北京的郊区古北水镇参加一个机构的股票研讨会，这个周末估计全国持股的股民绝大多数心情不好，这点我可以从参会者的表情看出来，大家不太像来参加股市研讨会的，倒是像来参加股市英雄们的追悼会的。\n顺便说句，北京城虽然颇有盛名，但是城里特好玩的地方还真是不太容易找，钓鱼台不错，但是要吃顿饭才能进，这价钱一般老百姓够呛！周边的古北水镇、雁栖湖还不错。\n会议周六开了半天会，发言的人中有好几个眼睛是红的，也有边发言边骂娘，“臭不要脸的中国股市”。\n本来下午是要在古北水镇玩半天的，但是网络媒体刊登了重大消息，“7月4日，21家券商发布联合公告表示，以2015年6月底净资产15%出资，合计不低于1200亿元，用于投资蓝筹股，这些资金并非由券商直接投入市场，而是需要在6日上午11点前全部打入中国证券金融公司账户，由证金公司统一进行投资。”\n接着又有进一步的救市消息，停发新股，上个星期认购新股冻结的资金周一开市前退回。\n大家一下子兴奋了，有好多参会的人，选择了提前回城了——要选股大战了！\n\n《千载难逢的机会就在眼前》\n7月6日，周一，大盘开盘时高开，有一半的股是以涨停板开的盘，但是指数其后就一路下行，虽然尾市指数还是上涨了88.99点，但是绝大多数股票跌停，指标股和少数绩优股上涨拖住了指数。\n“卧槽，大家盼望解放军，结果国家给全体A股套牢者自己发了套军装，但是乌合之众没有战斗力，又迎来了一天千股跌停”。\n“那21家券商进没进啊？别不是利用早上的高开，乘机跑了，凑足了1200亿，孙子兵法玩的不错啊！”\n“再跌，只有自杀了，不是吓唬人的，真心话，我的人生真是失败”。\n这是那天收市后的一些股民写的微博。\n7月7日，周二，大多数股票跌停。\n7月8日，周三，大多数股票跌停。\n这天晚上，一个大户请我在亚运村的无名居吃饭问股票，这个大户是个美男子，气质特别的好，我要是这么帅就好了，但是那天他的神情不太对，他跟我说话的时候，眼睛不看着我，老是看着旁边。\n\n我安慰他，“别着急，现在千万不能卖，这几天我天天在买，明天会继续买的，你没看我的博客题目是，千载难逢的机会就在眼前”。\n▲ A股真是个神经病啊！经病啊！病啊！啊！\n前几天是大多数个股跌停卖不掉，这天是大多数个股涨停买不进，A股真是个神经病！\n7月9日，周四，这天早上醒的比较早，打开手机的时候，看见一个合作大户给我发了微信，半夜3点多发的，用语音发的，但是又什么都没说。我明白他的意思，因为前几天抄底，他的账户在这几天浮亏了1千多万，虽然仓位只占了三分之一，但这是他的账户历史上最大的一次回撤，他担心了。我给他回了个微信，“何总，不要着急，现在机会挺好的，股灾财是股市中的最佳机会，现在只能加大仓位买，不能卖。这样的暴跌，我经历过几次，最后都是赢家，市场转机就是这两天就可能出现，转机出现后，许多股会连续涨停的，我和我的朋友都在从银行往股票账户里转钱。”\n\n开市前，一个大官的二代打电话问我的看法，我把那条微信的内容重复的告诉了他。通完电话，我发了微博，“股灾财是股市第一利润，高于大牛市利润和无风险套利利润”。\n这天开盘的时候，大多数个股依然是跌停开盘，但是许多跌停的股票有连续的大买单吞吃筹码，我就把剩下的资金先买进了一半，看着自选股上的一些股跌停上巨单快被吃开，还有1、2百万股卖单的时候，就把全部的资金打出了。\n9点45分的时候，几乎所有跌停的个股跌停封单都被买开了，指数开始回升，于是，我在微博上放歌《万里长城永不倒》《陪我看日出》，之后一路上扬，直至绝大多数股票涨停。这天股指的最低点是3373.54点，收盘指数3709.33点，我买的好几只股由跌停冲向涨停。\n7月10日，星期五，大多数个股开盘就涨停。前几天是大多数个股跌停卖不掉，这天是大多数个股涨停买不进，A股真是个神经病！\n7月13日，星期一，大多数个股开盘就涨停。\n7月14日，星期二，大多数个股开始震荡，我就选择了减仓。\n\n2015年的股市，对于我来讲，可以说意义非常，买一支中超球队还养不起，拼不过国企，但是买一支中甲球队，那是没问题的……\n之后的两个星期，我一直在选择逢高减仓，直至清仓。清完仓后，我想我该奖励一下自己，去旅游一趟，先是开车去了趟承德的避暑山庄，说了好几年了要去的，这次真去了，然后飞到了张家界，在张家界、边城茶峒玩了一段时间，我的朋友在变成茶峒开了一间“悠然居”客栈，真的不错。\n在我旅游的时候，指数有几天小反弹，看微博的时候，有几个股友评论说，“花大侠，踏空了吧，是不是心如刀割？”\n哈哈！真可爱，在股市里你对牛弹琴，牛不但不欣赏你，牛还会跟你弹几首幽默的曲子呢！2015年的股市，对于我来讲，可以说意义非常，买一支中超球队还养不起，拼不过国企，但是买一支中甲球队，那是没问题的，以后生活上可以放大方一点，对人也宽容一点。下个人生目标，就是把《操盘手》《股囧》拍成大电影、电视剧，追求精神上的财富，争取在历史上雁过留名。\n8月18日，返京，这天股灾2.0又开始了，指数由这天的4006.34点一口气跌到2850.71点，许多个股又是5个跌停左右，市场又是腥风血雨，哭声一片。\n我听一个股友说，我们两个共同认识的一个股友，他的股票连续5个跌停后，那天晚上睡着后，以后再也没有醒过来。\n我们爬山队的一个小伙子跟我说，他的前女友给他打电话求助说，“家里给她在北京买房子的首付款跌没了四分之三，问怎么办？”小伙子说，“你别着急，先放着别动，等反弹到3300点左右卖掉，你赔了多少钱我给你补上。”\n我心里想，这个小伙子真不错，不但挣了钱，还有骑士精神，以后人生发展空间可能会不小，我有机会能帮他就帮他一下，可惜那个女孩没眼光，当初把这么优秀的一个小伙子放弃了。"
		},
		{
			"post_id": 584,
			"title": "中天科技600522 --- 这就叫吹牛逼的烂公司，学会以后如何吹",
			"date_published": 1469458707.394,
			"body": "要点一：所属板块　4G概念 长江三角 超导概念 大订单 高送转 沪股通 江苏板块 量子通信 融资融券 上证380 太阳能 腾安价值 通讯行业 新能源 一带一路 云计算 证金持股 智能电网 中证500 锂电池 \n\n要点二：经营范围　光纤预制棒、光纤、光缆、电线、电缆、导线、铁路用贯通地线、舰船电缆、舰船光缆、水密电缆、消、测磁电缆、不锈钢管、金具、绝缘子、避雷器、有源器件、无源器件及其他光电子器件、高低压成套开关电器设备、变压器、天线、通信设备、输配电及控制设备、光纤复合架空地线、光纤复合相线、光纤复合绝缘电缆、陆用光电缆、海底光电缆、海洋管道、射频电缆、漏泄电缆、铁路信号缆、高温同轴缆、高温线缆、太阳能电池组件、太阳能光伏背板、光伏接线盒、连接器、支架、充电设备用连接装置、储能系统、混合动力及电动汽车电池系统、锂电池、钠硫电池、钒电池、交流不间断电源、充放电设备、逆变设备、通信设备用直流远供电源设备、风机发电设备及相关材料和附件、塑料制品、高纯石英玻璃、高纯纳米颗粒及其相关制品的研发、生产、销售及相关设计、安装、技术服务;铜合金、铝合金、镁合金铸造、板、管、型材加工技术的开发;光缆、电线、电缆监测管理系统、输电线路监测管理系统、变电站监控系统、温度测量设备、网络工程的设计、安装、施工、技术服务;光伏发电系统、分布式电源、微电网的设计、运行维护的管理服务;送变电工程设计;电力通信工程设计及相关技术开发、咨询服务;输变电、配电、通信、光伏发电、分布式电源工程总承包;自营和代理各类商品及技术的进出口业务;实业投资;通信及网络信息产品的开发;计算机领域内的技术开发、技术转让、技术咨询、技术服务;软硬件的开发、销售;承包与企业实力、规模、业绩相适应的国外工程项目并对外派遣实施上述境外工程所需的劳务人员。(依法须经批准的项目,经相关部门批准后方可开展经营活动)(最终以工商登记机关核准的内容为准) \n\n要点三：主营业务-光通信、电力线缆、海底线缆及新能源　公司主营业务涵盖光通信、电力线缆、海底线缆及新能源领域。 \n\n要点四：行业背景-通讯行业　光纤光缆是构建现代化通信网络的基础,光纤光缆较传统的铜制电缆在成本、传输速度及传输质量等方面具有巨大优势,其产业链由光纤预制棒、光纤和光缆构成。光纤预制棒拉丝成光纤,光纤加工后成光缆产品。随着光纤通信技术的迅猛发展,光纤通信被应用于日益众多的领域,光纤光缆需求量快速增长。经过多年发展,中国现已成为世界上最大的光纤光缆生产基地。 \n\n要点五：核心竞争力-人才与技术优势　公司与浙江大学、南京邮电大学、中科院、信息产业部电子第八研究所、国家机械工业局上海电缆研究所和信息产业部电子第二十三研究所等高等院校和科研单位建立了紧密的技术合作关系。目前本公司拥有专利技术485项,其中发明专利124项,同时多项专利正在进行申请程序中。 \n\n要点六：核心竞争力-品牌优势　中天科技以创新的产品、可靠的质量以及良好的售后服务为公司赢得了良好的品牌形象,先后获得中国光纤光缆金牌企业、中国光纤光缆最具竞争力企业十强称号、中国光纤光缆30年最具影响力的企业、中国光通信行业最具综合竞争力企业十强。中天科技光纤光缆、电力导线为驰名商标,核心商标在9个国家和地区取得了保护。 \n\n要点七：核心竞争力-市场营销优势　公司拥有强大的国际销售网络,在海外设有54个长期、短期办事处,3家海外生产基地,海外员工占比达到10%,主营产品遍布全球156家电力运营商,为35家通信运营商提供解决方案,全球前十大油气公司已有5家使用中天海缆,OPGW连续6年全球市场占有率第一,海底光缆、海底光电复合缆、节能导线连续7年出口排名第一,境外收入多年保持40%以上的增长。 \n\n要点八：定增动力锂电池、海底光电缆、特种光纤等多个项目　 2016年4月21日发布定增预案,公司拟以不低于16.39元/股非公开发行不超过2.75亿股,募集资金总额不超过45亿元,拟用于投资动力锂电池、海底光电缆、特种光纤等多个项目。通过此次募集资金投资项目的实施将催生一批自主创新的专利技术,提升公司的自主创新能力,驱动主营业务转型升级、巩固提升,实现技术和产业化突破,为公司打造长期的核心竞争力,并将升级延伸公司产业链、培育新的盈利增长点、保持可持续的业绩增长。 \n\n要点九：重大项目中标　　2016年2月16日晚间公告称，公司近日收到华能招标有限公司关于“华能如东八仙角海上风电场300MW工程110千伏海缆及其附件”和“华能如东八仙角海上风电场300MW工程35kV海缆及其附件”项目中标通知书，确认公司为本次招标项目的中标人，中标金额为2.4亿元。华能如东海上风电场300MW工程是国内继珠海桂山风电、中广核如东风电三芯110kV海缆，三峡响水三芯220kV海缆工程后的又一标志性海上风电工程，也是目前国内最大的海缆项目。此次项目实施有利于进一步提升和巩固中天科技在国内外海上风电等三芯超高压海缆产品市场的品牌影响力和市场占有率。根据公告，中天科技将于2016年交付中标产品，执行完毕本次中标项目。 \n\n要点十：联手浙大 布局海底观测网　2016年1月31日晚公司公告,拟出资4000万元与浙大创投、浙江大学团队等成立合资公司“中天海洋系统有限公司”,公司占40%。新公司从事海底接驳盒等产品的研发生产,相关产品将填补国内空白的前沿技术。公司称,合资设立中天海洋,有利于实现海底接驳盒技术产业化,打造海底观测网系统集成商,开辟海底观测网新市场,赢得“互联网+海洋”先机。 \n\n要点十一：重大合作－上海电缆研究所战略合作　　2015年7月5日晚间公告称，公司近期与上海电缆研究所签署联合研发平台战略合作协议，双方拟共同进行特种导电材料、特种输电线、特种电缆等新型线缆产品技术开发和成果转化等。中天科技积极支持和参加上海电缆研究所所发起的针对线缆领域的基础共性技术研究，并愿意承担必要的研究经费、样品提供和试验测试等工作。双方在裸电线、特种电缆、装备电缆、通信电缆、海缆等多领域建立标准合作机制，进行国内外标准信息、立项等的沟通、交流与合作；同时进行技术人才培养等。 \n\n要点十二：股权收购-22.5亿收购大股东旗下三公司1　　2015年5月24日发布资产收购预案，公司拟收购控股股东中天科技集团等持有的中天合金、中天宽带、江东金具三家公司100%股权，并募集配套资金。根据方案，上述标的资产交易金额为22.49亿元，按14.69元/股的发行价格计算，公司此次合计发行数量为15311.30万股。同时，公司拟以不低于16.46元/股，向不超过10名符合条件的特定投资者非公开发行股份募集配套资金不超过6亿元，拟用于中天宽带4G智能电调天线研发及产业化项目、中天合金高精度无氧铜深加工技术改造项目、江东金具绝缘子、避雷器系列产品技改项目，以及补充三家标的公司的流动资金。 \n\n要点十三：股权收购-22.5亿收购大股东旗下三公司2　　其中，中天宽带致力于网络通信设备产品的研发、生产，已经成为中国电信、中国移动、中国联通、国家电网、南方电网等客户的长期战略合作伙伴和相关产品的主流供应商。此外，中天合金主要从事一般铜材的压延加工、销售以及铁路贯通地线的研发、生产与销售，主要面向电网企业和光伏企业销售。而江东金具是一家专业从事特高压线路金具、配网金具、光缆金具及通信附件设计、生产的高新技术企业，其主营业务包括金具（线路金具、光缆金具）、绝缘子以及光伏支架，涉及电力、通信及新能源三大板块。业绩承诺方面，根据标的公司2015年第一季度经审计财务数据以及《资产评估报告》，标的资产2015-17年的合计预测净利润分别不低于14241万元、15603万元和17909万元。 \n\n要点十四：特种光缆第一股　　公司是国内光电缆品种最齐全的专业企业之一，特种光缆(电力光缆和海底光缆)国内市场占有率高达30%-40%，其中ADSS，OPGW均是国内首家通过国家级鉴定的拳头产品，国内市场占有率稳居第一(ADSS占50%以上)，海外市场占有率接近8%(已批量出口欧盟，东南亚等地)，SOFC被誉为“光缆之王”，技术实力属国际一流。2011年6月，中国南方电网公布2011年一级物资集中采购招标结果：公司及子公司中标铝包钢绞线，铝包钢芯铝绞线等合计2.90亿元。公司中标国家电网公司集中规模招标采购2011年第一批，第二批220千伏及以上输电线路装置性材料，南方电网公司2011年220KV，110KV线材类第一批采购项目钢芯铝绞线等合计5.33亿元。 \n\n要点十五：投资新项目-光伏发电　　2011年12月，公司拟出资10,000万元，独资设立中天光伏技术有限公司，开发并网型太阳能光伏屋顶发电系统，包括太阳能光伏屋顶发电系统及相应的配套并网设施，通过并网售电取得收入和收益。本次对中天光伏技术投资的资金均为公司的自有资金。当前，光伏发电站组件及电池片价格持续下降，中天光伏技术项目建设成本有较大优势，同时得利于国家对太阳能发电技术的支持，此项目建成，能为上市公司带丰厚回报。 \n\n要点十六：2亿增资自贸区子公司 打造大宗商品采购平台　　2014年10月22日公告， 公司向全资子公司中天上海国贸增资20000万元，增资后，中天上海国贸的注册资本变更为30000万元。据公告，中天上海国贸从事货物和技术的进出口业务，具有专业化的大宗商品交易经验，拥有一支高素质的专业人才团队，随着时代环境变化，需要不断补充具备新思想、新技术的优秀人才，保证竞争优势。 \n\n要点十七：收购中天精密材料　2010年6月,公司为进一步延伸公司光通信产业链,减少外购环节,向中天科技集团有限公司收购中天精密材料100%股权,转让价格为7466.08万元。中天精密材料成立于2000年10月,注册资本10856万元,经营范围为光纤预制棒,光纤接插线,全光纤器件,光放大器,特种光纤,特种光缆,光学器件,光学组件制造,销售。 \n\n要点十八：股权投资　 子公司江苏中天投资参股光迅科技,初始投资2544万元,期初持股比例8.05%,2015年6月末持股比例为6.61%,期末账面价值6.67亿元,2015年中报期内损益746.41万元。另,公司初始投资672.2万元持有江苏银行0.22%股权,2015年6月末账面价值为672.2万元,2015年中报期内损益154.56万元。 \n\n要点十九：对外投资-巴西公司　　2013年5月，公司与巴西索维德公司合资在巴西设立一家光缆公司，拟定公司名称：ZTT do Brasil Ltda.（中天科技巴西有限公司），注册资金960万雷亚尔，中方现金出资489万雷亚尔，占总注册资金的51%。巴西索维德公司对巴西光缆市场有着深刻的理解，并有光缆销售的渠道及经验，中天科技股份具有多年光纤光缆生产、销售经验，又逢巴西电信建设高峰期，中天科技巴西有限公司的设立可提升上市公司的整体盈利能力。 \n\n要点二十：合资设立中天储能科技　　2012年12月，公司拟与浙江兴海能源科技有限公司合资设立中天储能科技有限公司，主要从事锂电池生产与销售。中天储能科技注册资本10,000万元人民币，其中公司以现金出资8,500万元人民币，占注册资本的85%。中天储能科技成立有利于公司产业的横向发展，增加公司的整体盈利能力，培育公司新的利润增长点。 \n\n要点二十一：募资22.6亿建屋顶光伏　　2014年2月，公司将以不低于10.43元/股的价格，非公开发行不超过2.17亿股，募集不超过22.6亿元，用于补充流动资金，及投资于南通经开区国家级分布式光伏发电示范区150MWp屋顶太阳能光伏发电等4个项目。公司加强新能源领域的投入，重点进行了分布式光伏发电、太阳能电池背板、锂离子电池等产业布局。本次募资，进一步扩大产能及提高技术实力，也为公司中长期的发展提供新动力。 \n\n要点二十二：携手中科院建电力超导技术研发中心　　2010年7月，上证报报道，中天科技与中国科学院电工研究所共同建立“电力超导技术联合研究开发中心”，双方结成面向输电系统应用的超导限流技术研究开发的战略合作伙伴，共同促成相关技术的转化和产业化。该联合研发中心的建立有助于为企业的发展提供决策建议并为企业技术发展方向提供科学建议，成为相关技术领域国家标准制定的参与者，并为国内外相关领域或行业提供咨询建议以及其他相关服务。据了解，超导电力技术是利用超导体的零电阻特性和状态瞬间转变特性发展起来的电力应用新技术，被美国能源部誉为21世纪电力工业唯一的高技术储备，是当今电力技术最活跃的研究领域之一。经过近二十年的快速发展，已经实现了重大突破和创新，全面进入到了示范运行阶段，部分小型超导电力装置已经实现了商业化运行。 \n"
		},
		{
			"post_id": 583,
			"title": "中兴通讯",
			"date_published": 1469457516.212,
			"body": "Blog post body"
		},
		{
			"post_id": 582,
			"title": "烽火通信",
			"date_published": 1469456949.254,
			"body": "要点一：所属板块　4G概念 5G概念 IPV6 股权激励 国企改革 湖北板块 沪股通 融资融券 上证380 通讯行业 云计算 中证500 \n\n要点二：经营范围　光纤通信和相关通信技术、信息技术领域科技开发;相关高新技术产品制造和销售,含光纤复合架空地线(OPGW)、光纤复合相线(OPPC)及金具和附件,电力导线、电线、电缆及相关材料和附件,通讯线缆及附件的制造与销售;系统集成、代理销售;相关工程设计、施工;技术服务;自营进出口业务(进出口经营范围及商品目录按外经贸主管部门审定为限)。 \n\n要点三：主营业务-光纤光缆等　公司产品主要包括光传输与光接入、光纤光缆、业务与终端、光配线、系统集成等,并可为客户提供完整的数据通信及行业网解决方案及定制化的软件与服务;主要客户遍布国内、国际和信息化三大市场;旗下拥有武汉烽火信息集成技术有限公司、武汉烽火国际技术有限责任公司、武汉烽火技术服务有限公司等多家控股公司,已跻身全球光传输与网络接入设备、光纤光缆最具竞争力前列。 \n\n要点四：行业背景-光通信产业　光通信产业超速发展,成为最具潜力、增长速度最快的行业之一,大容量、高带宽是未来光通信网络发展的基本需求;同时,新一代信息技术如云计算、大数据、下一代网络等将推动ICT产业链的跨界变革,带来广阔的市场空间。 \n\n要点五：核心竞争力-产业布局优势　公司在立足光通信主业做强做大的同时,拓展数据通信、信息网络安全、计费软件、集成业务、家庭网关等领域,也取得不俗业绩。2015年,公司完成南京烽火星空通信发展有限公司全部股权收购,对加快信息安全业务发展,加大大数据和移动互联网业务的投入,甚至对公司整体业务结构的调整都有积极作用。同时,先后在西安、珠海设立区域产业基地,投资发展智慧城市产业和海洋网络,打造公司发展新动能。 \n\n要点六：核心竞争力-技术引领优势　烽火在国内首次实现3模式200Tb/s超大容量波分复用及模分复用光传输实验;完成100G公司在国内首次实现3模式200Tb/s超大容量波分复用及模分复用光传输实验;完成100G直调信号传输320公里、4*28G直调直检传输160公里等系列方案设计及实验验证,传输指标属国际先进水平;成功研发32GS/s 6-bit高速模数转换器(ADC)和数模转换器(DAC),国内属首次,指标国际先进水平。公司实现面向SDN演进的大容量IP RAN系列和OTN系列新产品试点商用,开发出低损耗大有效面积光纤。 \n\n要点七：定增投资云服务等互联网项目　 2016年4月8日发布定增预案,公司拟以不低于22.20元/股非公开发行不超过8117.12万股,募集资金总额不超过18.02亿元,其中公司控股股东烽火科技承诺认购比例不低于10%;融合型高速网络系统设备产业化项目拟投资5.16亿元,项目建设内容包括在武汉市高新四路地块新建生产厂房,以及POTN、IP RAN、10G PON 的主要生产和辅助生产设备的购置、安装;特种光纤产业化项目拟投资2.47亿元,主要产品包括抗弯光纤/光缆、保偏光纤、掺镱光纤等三大系列新型特种光纤光缆产品。海洋通信系统产业化项目拟投资3.70亿元,主要产品为海洋通信系统,该系统由海底光缆、中继器和岸基通信设备组成;云计算和大数据项目拟投资4.13亿元,该项目产品为依托公司的烽火云应用服务平台“FitCloud”,将为政府、教育、通信、互联网等行业的企业级客户提供从云存储、云服务器、云数据中心、桌面云、云操作系统等云服务;营销网络体系升级项目拟投资2.56亿元,将用于公司总部营销中心和国内三大区域中心的建设。同日烽火通信发布年报显示,公司2015年度实现营业收入134.90亿元,同比增长25.81%;归属于上市公司股东的净利润6.57亿元,同比增长21.80%;基本每股收益0.64元;并拟向全体股东每10股派现3.4元(含税)。 \n\n要点八：7.5亿全资控股烽火星空 加码信息安全业务　　2014年11月13日发布资产收购预案，公司拟以以发行股份及支付现金的方式收购拉萨行动持有的烽火星空49%股权，并募集配套资金。收购完成后，烽火通信将持有烽火星空100%股权，从而加码信息安全业务、大数据及移动互联网业务。根据方案，烽火星空股东全部权益价值的评估值为15.32亿元，增值率为375.83%。经协商，烽火星空49%股权最终交易价格为7.5亿元。方案显示，烽火星空的主营业务由网络信息安全、移动信息化两个板块构成。网络信息安全板块，其核心产品包括电信数据采集和分流平台、私有云存储和大数据分析平台两大系列的核心产品；移动信息化板块，烽火星空的主要产品是企业移动应用平台ExMobi和企业移动管理平台MobileArk。 \n\n要点九：光通信行业龙头　　公司是中国通信基础设施建设的主要设备供应商和全面电信解决方案供应商之一，光缆年度销量超过200万公里，名列行业第二，FTTH产品成为市场领导品牌，09年公司在新业务方面围绕家庭网络和企业行业客户需求积极布局推进，家庭网关和IPTV产品形成较好市场布局和批量供货，OSP产品线已成为业界FTTx线路技术引导者和行业标准制订者，使烽火成为一个有别于单一的FTTH设备供应商或单一的光纤光缆供应商的FTTH全套解决方案提供商，企业综合办公和移动OA产品系列，成功入围运营商相关产品选型。 \n\n要点十：股东整合预期　　公司控股股东武汉邮科院是中国光通信的发源地，也是国内唯一集光通信三大战略技术(通信系统，光纤光缆，光电器件)的研究，开发，生产和销售于一体的科研与产业实体。另外，公司实际控制人为国务院国资委，在央企整合的势头不断推进下，公司从中获益的概率不断增大。 \n\n要点十一：收购公司-成都大唐线缆有限公司　2011年12月,公司将以7471.5万元的价格收购大唐电信科技股份有限公司所持的成都大唐线缆有限公司51%股权。通过本次收购,公司线缆产业布局将进一步完善,有利于丰富公司线缆产品种类,提高线缆产品交付速度,降低成本。本次收购将巩固公司在线缆制造行业的行业地位,对上市公司业绩产生积极作用。2015年1-6月,该公司实现净利润746.12万元。作用。 \n\n要点十二：参股金融　 公司为广发基金管理有限公司成立的发起人之一。2015年中报披露,公司累计初始投资2000万元持有广发基金15.76%股权,期末账面价值为2000万元,期内损益4.33亿元。 \n"
		},
		{
			"post_id": 581,
			"title": "奥瑞金",
			"date_published": 1469454795.131,
			"body": "要点一：所属板块　北京板块 高送转 金属制品 融资融券 深成500 预盈预增 证金持股 中证500 \n\n要点二：经营范围　许可经营项目：生产金属容器、玻璃容器、吹塑容器。一般经营项目：从事节能技术和资源再生技术的开发应用;并应用该技术设计金属容器、玻璃容器、吹塑容器;从事覆膜铁产品的研发、生产及销售;销售自产产品(涉及特殊行业项目经政府相关部门批准后方可实施)。 \n\n要点三：主营业务-食品饮料金属包装产品的研发、设计、生产和销售　公司主要从事食品饮料金属包装产品的研发、设计、生产和销售,主要包括食品罐和饮 料罐。饮料罐产品主要应用于功能饮料、茶饮料、乳品饮料、果蔬汁、咖啡饮品、碳酸饮 料、啤酒等的金属外包装。食品罐产品主要应用于调味品(番茄酱、香油等)、八宝粥、罐 头食品(午餐肉、水果、水产等)、奶粉等的金属外包装。目前,公司饮料罐产品的主要客 户包括红牛、加多宝、旺旺、露露、青岛啤酒、燕京啤酒、雪花啤酒等知名企业。公司食品 罐产品的主要客户包括银鹭、达利园、建华香油、伊利、三元、蒙牛、飞鹤等知名企业。 \n\n要点四：行业背景-包装行业　包装行业的发展与经济的整体发展水平以及主要包装原材料的供需变化密切相关。受经 济增速放缓、原材料价格波动等因素的影响,近年来包装行业在主要发达国家和地区的发展 放缓,而亚洲、东欧等发展中地区由于经济持续快速增长、居民消费能力不断提高,包装行 业增速较为明显。金属包装因其具有机械性能好、阻隔性优异、保质期长、易于实现自动化 生产、装潢精美、形状多样等优点,广泛应用于食品、饮料、医药产品、日用产品、仪器仪 表、军用物资等领域,在全球包装产业中占有重要地位。 \n\n要点五：核心竞争力-生产布局优势　公司是我国金属包装行业率先采用“跟进式”生产布局模式的企业。通过“共生型生产 布局”(Implant模式)和“贴近式生产布局”(Wall to Wall模式),公司与核心客户在空 间上紧密依存,结合核心客户的产品特点和品质需求配备具有国际领先水平的生产设备,形 成了相互依托的发展模式;同时,公司的布局优势最大程度地降低了产品运输成本。 报告期内,公司积极拓展新客户,扩大市场规模,提高市场占有率。 \n\n要点六：核心竞争力-商业模式优势　报告期内,公司持续推进商业模式创新。公司全资子公司北京包装完成收购饮料灌装业 务后,公司进一步优化灌装业务布局并积极拓展业务,以增强公司对客户的一体化综合服务 能力。 公司积极开发和生产差异化产品,投资设立福建漳州异型罐生产线及湖北咸宁新型包装 生产线,以拓展优质客户,并向高端化产品方向发展,向客户提供多层次、差异化包装解决 方案,给公司带来了新的利润增长点。 \n\n要点七：核心竞争力-技术优势　公司视技术为生存和发展的基石,建立起了国内领先的技术研发中心,专业从事金属包 装的应用技术、前瞻性技术及整体解决方案的持续研发,并在各主要产品领域均形成了技术 优势。报告期内,DR材应用、覆膜铁产品产业化、异型罐研发和二维码信息化服务等均取 得良好进展。经人社部和全国博管会批准,公司取得博士后科研站资格。 \n\n要点八：重大战略合作　 2016年3月7日,公司与中粮包装控股有限公司(以下简称“中粮包装”)签订了战略合作协议,双方建立战略合作伙伴关系。双方将在技术、营销、产能布局和供应链等多维度开展深度合作。公司与中粮包装系国内金属包装行业的优势企业,通过达成战略合作伙伴关系,双方强强联合,实现优势互补,共赢发展,促进双方在多业务领域的深度交流与合作。本次战略合作,有利于优化公司产品和客户结构,拓宽公司业务领域;有利于合理利用资源,增强市场竞争力,提升盈利能力;有利于拓展海外市场,培育海外运营和生产基地,稳步推进外延发展的步伐,符合公司综合包装解决方案提供商的战略定位。 \n\n要点九：股权收购-收购多家公司股权 进军饮料灌装　　2014年10月29日公告，公司全资子公司北京奥瑞金包装容器有限公司拟以自有资金收购公司控股股东上海原龙投资有限公司持有海南元阳食品有限公司67.5%股权、湖北元阳食品有限公司75%股权、昆明景润食品有限公司100%股权、辽宁元阳食品有限公司75%股权，收购香港奥瑞金投资实业有限公司持有海南元阳25%股权和收购香港元阳实业有限公司持有辽宁元阳25%股权。奥瑞金表示，通过此次收购，公司介入饮料灌装业务，助力公司客户品牌和渠道建设，扩大公司与灌装业务的客户在金属包装领域的合作规模和空间，增加公司与客户的粘性，使得灌装业务与包装业务形成协同效应。 \n\n要点十：定向增发-募资25亿元投资主业　　2015年6月23日晚间发布定增预案，公司拟以23元/股非公开发行不超过10869.57万股，募集资金总额不超过25亿元，拟全部用于补充公司的流动资金。根据方案，公司此次定增对象为：上海原龙、嘉华成美、嘉华优选、九泰基金拟设立的资产管理计划、民生加银拟设立的资产管理计划、建投投资、管理团队拟设立的合伙企业。其中上海原龙为公司控股股东，此次认购约9.08亿元；嘉华成美认购约5亿元；嘉华优选认购约3亿元；九泰基金拟设立的资产管理计划认购约3亿元；民生加银拟设立的资产管理计划认购约2亿元；建投投资认购约2亿元；公司管理团队拟设立的合伙企业认购0.92亿元。 \n\n要点十一：设立全资子公司并实施制盖生产线项目　　2012年12月，公司拟在山东龙口成立全资子公司并实施制盖生产线项目，项目总投资为39,219万元人民币，规划年产量预计为39亿片易拉盖。项目达产期预计年净利润为5,710.77万元人民币，达产期投资回报率为14.56%，静态投资回收期为5.74年（含建设期）。该项目的建设能够满足公司用易拉盖的需求，进一步扩展产业链，同时提高公司产品配套能力，大幅提高生产装备水平和产品供应能力，丰富产品线，控制生产成本，提高盈利能力。 \n\n要点十二：江苏宜兴三片饮料罐生产线项目　　2012年12月，公司拟使用30,000万元人民币超募资金，以公司全资子公司江苏奥瑞金包装有限公司为主体，在江苏宜兴投资建设三片饮料罐生产线项目。项目估算总投资为45,963.65万元人民币，规划年产量预计为11.84亿只三片（马口铁）易拉罐。项目全部达产后，预计年销售收入（不含税）为103,253.2万元人民币，年净利润为15,755.36万元人民币，投资收益率为34.28%，静态投资回收期为4.49年（含建设期）。该项目有利于公司完善在全国的战略布局，提升公司的品牌知名度，同时有利于拓展新客户，增强公司的市场竞争力。 \n\n要点十三：募资投向-佛山年产4.8亿只三片饮料罐扩建项目　　该项目计划总投资额为9,451.43万元人民币，全部以募集资金投入。项目拟新建2条三片饮料罐生产线，全部达产后新增4.8亿只三片饮料罐年产能。项目建设期为12个月。项目可实现年销售收入36,982万元人民币，年利润总额5,682万元人民币，年净利润4,262万元人民币，静态回收期为4.17年。 \n\n要点十四：募资投向-北京年产4.8亿只三片饮料罐扩建项目　　该项目计划总投资额为10,285.04万元人民币，全部以募集资金投入。项目拟新建2条三片饮料罐生产线，全部达产后新增4.8亿只三片饮料罐年产能。项目建设期为12个月。项目可实现年销售收入41,141万元人民币，年利润总额9,729万元人民币，年净利润7,297万元人民币，静态回收期为3.53年。 \n\n要点十五：募资投向-成都年产3.9亿只三片饮料罐扩建项目　　该项目计划总投资额为7,967.9万元人民币（2013年3月缩减至2,879.11万元人民币，差额部分全部投入江苏宜兴三片饮料罐生产线项目），全部以募集资金投入。项目拟新建2条三片饮料罐生产线，全部达产后新增3.9亿只三片饮料罐年产能。项目将分期建设，两期生产线的建设期均为12个月。项目可实现年销售收入30,827万元人民币，年利润总额5,043万元人民币，年净利润3,782万元人民币，静态回收期为3.17年。 \n\n要点十六：募资投向-上虞年产7亿只二片饮料罐项目　　该项目计划总投资额为41,489.6万元人民币，全部以募集资金投入。项目拟新建1条具有国际先进水平的二片饮料罐生产线，全部达产后新增7亿只二片饮料罐年产能。项目建设期为18个月。项目可实现年销售收入46,263万元人民币，年利润总额8,662万元人民币，年净利润为6,497万元人民币，静态回收期为6.03年。 \n\n要点十七：募资投向-临沂年产71亿只顶底盖扩建项目　　该项目计划总投资额为32,622.7万元人民币（2013年3月缩减至9,041.89万元人民币，差额部分全部投入龙口年产39亿片易拉盖项目），全部以募集资金投入。项目建成全部达产后，公司制盖年产能将增加到71亿片，主要满足奥瑞金体系内对盖子的需求。项目建设期总计为24个月。项目可实现年销售收入96,510万元人民币，年利润总额11,247万元人民币，年净利润为8,435万元人民币，静态回收期为4.62年。 \n\n要点十八：募资投向-新疆年产300万只220L番茄酱桶项目　　该项目计划总投资额为11,860.4万元人民币，全部以募集资金投入。项目拟在新疆昌吉高新技术产业开发区新建两条220L番茄酱桶生产线，全部达产后，将年形成300万只220L番茄酱桶产能，进一步丰富公司产品线，巩固公司在番茄酱金属包装领域内的竞争优势、提高市场份额，更好地服务于新中基、中粮屯河、中国昊汉、新疆冠农、新疆天业等主要客户，提高公司收入利润规模。项目分两期先后投入，建设期均为1年。项目可实现年销售收入27,692万元人民币，年利润总额5,410万元人民币，年净利润为4,058万元人民币，静态回收期为4.58年。 \n\n要点十九：募资投向-技术研发中心实验室扩建项目　　该项目计划总投资额为3,855.88万元人民币，全部以募集资金投入。扩建后的研发中心将新增研发人员26名，建筑面积扩大到2,240平方米，包括包装产品研究室、包装材料研究室、包装检测分析实验室、技术信息与标准化室等四个研究室的扩建。项目实施完成后，研发中心将对进一步增强公司自主创新能力，提升公司核心竞争力，保证公司的可持续发展发挥核心作用。 \n\n要点二十：税后优惠　　2012年11月，公司收到由北京市科学技术委员会、北京市财政局、北京市国家税务局、北京市地方税务局联合颁发的编号为GF201211000077的《高新技术企业证书》，认定公司通过高新技术企业复审，发证日期为2012年5月24日，有效期三年。根据相关规定，公司通过高新技术企业复审后，2012-2014年将继续享受高新技术企业的相关优惠政策，即按15%的税率缴纳企业所得税。 \n\n要点二十一：股利分配　　公司重视对投资者的合理投资回报，着眼于公司的长远和可持续发展，注意保持股利分配政策的连续性和稳定性。公司可以根据盈利情况和资金需求状况进行中期现金分红。公司未来每年以现金形式分配的利润不少于当年实现的可供分配利润的20%。在保证公司股本规模和股权结构合理的前提下，基于回报投资者和分享企业价值考虑，公司可以根据公司股票估值情况发放股票股利。 \n\n要点二十二：自愿锁定股份　　公司实际控制人周云杰承诺，在公司股票上市之日起36个月内，不转让或委托他人管理其所持有的海南原龙、二十一兄弟、原龙华欣、原龙京联、原龙京阳、原龙京原和原龙兄弟的股权，也不由该等公司回购其所持有的该等股权。公司控股股东海南原龙及其他由公司实际控制人控制的公司股东二十一兄弟、原龙华欣、原龙京联、原龙京阳、原龙京原和原龙兄弟均承诺，自公司股票上市之日起36个月内，不转让或者委托他人管理其持有的公司股份，也不由公司回购该等股份。公司股东佳锋控股承诺，自公司股票上市之日起18个月内，不转让或者委托他人管理其持有的公司股份，也不由公司回购该等股份。公司股东中瑞创业、弘灏控股、嘉华投资、加华威特、盈缤色承诺，自公司股票上市之日起12个月内，不转让或者委托他人管理其持有的公司股份，也不由公司回购该等股份。通过海南原龙间接持有公司股份的董事、高级管理人员魏琼、赵宇晖、沈陶均承诺，自公司股票上市之日起12个月内不对外转让间接持有的公司股份。 \n\n要点二十三：重大合作-获得了环宇制罐独家生产许可　　2015年8月3日公告，近日，公司与环宇制罐株式会社（以下简称“环宇制罐”）、东乡（香港）实业有限公司（以下简称“东乡实业”）就铝瓶罐生产技术排他性许可达成基本合作意向。东乡实业作为环宇制罐铝瓶罐生产技术许可的许可人，经环宇制罐同意，与公司签署了《技术许可合同》，公司获得了环宇制罐铝瓶罐生产技术在国内的独家生产许可。 \n\n要点二十四：重大合作-平安证券战略合作　　2015年8月20日晚间公告称，公司近日与平安集团旗下平安证券签订了关于成立体育文化产业基金的战略合作协议，双方建立战略合作伙伴关系，合作范围将覆盖体育文化项目的筛选与投资顾问、再融资保荐、债务融资顾问等全方位的资本运作。 　　根据公告，该产业基金规模初定为5亿元，可视项目进展情况分期募集。其中平安证券为产业基金运作提供持续、稳定的投后管理服务，同时积极寻找文化体育领域内的投资项目，为产业基金提供项目资源；积极寻找资金方，为产业基金募集优先级资金份额；并积极协调平安集团下属的相关子公司及业务部门，协助奥瑞金实现产业基金投资收益等全方位的金融服务业务。 \n\n要点二十五：重大投资收购中粮包装27%的已发行股份　　2015年11月9日晚间公告，为发挥各方优势，实现共赢发展，提高公司盈利能力，公司参与中粮集团有限公司旗下企业的混合所有制试点改革。与中粮包装控股有限公司（中国香港上市公司，股票代码00906）的第一大股东中粮集团（香港）有限公司就中粮包装部分股份事项签署《股份买卖协议》。 　　公司将以自筹资金16.16亿港元受让中粮包装27%的已发行股份（或在根据《股份买卖协议》进行调整的情况下，以自筹资金14.96亿港元受让中粮包装25%的已发行股份），每股价格为6港元。 \n\n要点二十六：定向增发投资主业　　2015年11月27日晚间公告，拟对2015 年度非公开发行股票方案中的发行数量及募集资金总额进行调整。发行股票数量由不超过10870万股，调整为不超过8261万股。募集资金总额由不超过25亿元，调整为不超过19亿元，募资用途仍为补充公司流动资金。 \n"
		},
		{
			"post_id": 580,
			"title": "牛逼大壮 --- 雷曼股份",
			"date_published": 1469454621.096,
			"body": "Blog post body"
		},
		{
			"post_id": 579,
			"title": "长江基建与国家电网争购澳洲最大电网 ",
			"date_published": 1469454243.078,
			"body": "Blog post body"
		},
		{
			"post_id": 578,
			"title": "东海证券董事因涉嫌行贿被立案调查 强制监视居住",
			"date_published": 1469453921.057,
			"body": "Blog post body"
		},
		{
			"post_id": 577,
			"title": "1-6月国企利润同比降8.5% 钢铁有色等行业继续亏损",
			"date_published": 1469453865.496,
			"body": "Blog post body"
		},
		{
			"post_id": 576,
			"title": "消息称中国铁路总公司拟年内发行1750亿元铁路建设债",
			"date_published": 1469453833.349,
			"body": "Blog post body"
		},
		{
			"post_id": 575,
			"title": "谁是假的？？",
			"date_published": 1469453048.076,
			"body": "大智慧近年的业绩也异常惨淡，去年巨亏4.56亿元，而同类上市公司中同花顺净利润9.57亿元，东方财富18.49亿元，今年一季度大智慧仍然深陷泥潭，亏损了1.68亿元。"
		},
		{
			"post_id": 574,
			"title": "海普瑞",
			"date_published": 1469451521.652,
			"body": "Blog post body"
		},
		{
			"post_id": 572,
			"title": "豪迈科技",
			"date_published": 1469450882.561,
			"body": "Blog post body"
		},
		{
			"post_id": 571,
			"title": "玉衡药业",
			"date_published": 1469450847,
			"body": "Blog post body"
		},
		{
			"post_id": 570,
			"title": "九阳股份 --- follow",
			"date_published": 1469449236.796,
			"body": "Blog post body"
		},
		{
			"post_id": 569,
			"title": "没有3年以上交易和分红历史的股票，不买",
			"date_published": 1469448645.285,
			"body": "Blog post body"
		},
		{
			"post_id": 568,
			"title": "分不了红的傻逼股，滚蛋",
			"date_published": 1469448454.714,
			"body": "Blog post body"
		},
		{
			"post_id": 567,
			"title": "亚邦股份 --- 龙抬头",
			"date_published": 1469447875.674,
			"body": "Blog post body"
		},
		{
			"post_id": 566,
			"title": "牛逼大壮骨不买，但是值得尊敬 --- 省通股份",
			"date_published": 1469447742.813,
			"body": "Blog post body"
		},
		{
			"post_id": 565,
			"title": "喊口号的股票永远不要买。举例：文化长城，你妈逼你是修长城埋人吗？文化大革命还不够吗？草泥马的傻逼",
			"date_published": 1469447539.983,
			"body": "Blog post body"
		},
		{
			"post_id": 564,
			"title": "傻逼机构真能看走眼，还是说你妈傻逼话，推荐的股票骗味十足",
			"date_published": 1469446629.323,
			"body": "Blog post body"
		},
		{
			"post_id": 563,
			"title": "相比较普通投资者，机构在研究上市公司上具备优势，他们重点关注的公司往往值得投资者参考。统计发现，上周，有36家公司首次被机构关注，评级方面以买入、增持为主。今日列出，供股友参考。",
			"date_published": 1469446478.916,
			"body": "Blog post body"
		},
		{
			"post_id": 562,
			"title": "every stock is a casino. every stock is a money machine. the key is if you now how to play it well.",
			"date_published": 1469446362.058,
			"body": "Blog post body"
		},
		{
			"post_id": 561,
			"title": "海康威视",
			"date_published": 1469446350.315,
			"body": "Blog post body"
		},
		{
			"post_id": 560,
			"title": "傻逼2观点",
			"date_published": 1469446070.339,
			"body": "以下六朵金花本周最具爆发力：花花花花花花\n　　浙江东日亮亮25日复牌拟近12亿收购加码农贸业务，浙江东日表示，此次交易完成后，公司农产品批发市场业务营业面积将迅速扩大，专业冷库规模可达到8.8万吨，同时还形成了以农产品批发交易市场为基础、电子商务和冷链物流协同发展的战略格局。此次购入集团已基本建设完毕的现代农贸城一期项目(批发市场部分)及冷链物流中心项目资产将成为公司快速实现规模扩张的必要途径之一。(this fuking stupid stock has almost 0 divident....what a stupid fuking recomm)\n　　黑牛食品亮亮出售5亿元资产促转型升级，黑牛食品22日晚间公告，上市公司黑牛食品拟将黑牛实业100%股权、揭阳黑牛100%股权、安徽黑牛100%股权、广州黑牛100%股权、黑牛营销100%股权以51,318.23万元的价格向黑牛资本出售，黑牛资本以人民币现金支付对价。(this is a fony stock)\n　　贵人鸟亮亮拟1.6亿元采购制鞋用石墨烯EVA发泡材料，贵人鸟7月22日晚间公告称，公司于7月22日与福建新峰二维材料科技有限公司(简称“新峰科技”)签署《采购合同》，公司拟在合同签署之日起3年内，向新峰科技共计采购5万立方米的休闲运动鞋用石墨烯EVA发泡材料，作为公司鞋产品的生产原材料，交易单价为每立方米3200元，交易总金额为1.6亿元。\n　　航天机电亮亮预计中报扭亏光伏组件出货量大增，航天机电7月22日晚间发布业绩预告，经财务部门初步测算，预计公司2016年半年度经营业绩与上年同期相比，将实现扭亏为盈，实现归属于上市公司股东的净利润9600万元左右，上年同期为亏损1233万元。\n　　海康威视亮亮上半年实现净利润同比增长18%，海康威视22日晚间披露2016年半年度报告，报告期内，公司实现营业总收入12,548,198,726.12元，比上年同期增长28.09%。其中，国内市场实现营业收入8,954,563,340.69元，比上年同期增长23.86%；海外市场实现主营业务收入3,593,635,385.43元，比上年同期增长40.02%。2016年上半年，公司实现净利润2,606,846,455.38元，比上年同期增长18.14%。(this seems to be a solid stock, good divident, should follow)\n　　京运通亮亮上半年净利润同比预增七至九成，京运通7月22日晚间发布业绩预告，经财务部门初步测算，预计公司2016年上半年度实现归属于上市公司股东的净利润与上年同期13420.60万元相比，将增长70%到90%；归属于上市公司股东的扣除非经常性损益的净利润与上年同期10673.86万元相比，将增长100%到130%。 \n"
		},
		{
			"post_id": 559,
			"title": "当机器学会思考，整个工业系统将被重塑 ",
			"date_published": 1469445411.792,
			"body": "Blog post body"
		},
		{
			"post_id": 558,
			"title": "皖新传媒",
			"date_published": 1469444953.485,
			"body": "Blog post body"
		},
		{
			"post_id": 557,
			"title": "阳光照明",
			"date_published": 1469444905.784,
			"body": "Blog post body"
		},
		{
			"post_id": 556,
			"title": "仙ju制药",
			"date_published": 1469444198.599,
			"body": "Blog post body"
		},
		{
			"post_id": 555,
			"title": "涨停股买卖 --- 因为不怕亏，所以他敢干，什么涨上去的不敢买，他都是照买不误的，而事实也证明了，没涨之前就知道是牛股，那根本不是他这种股民级别人可以知道的，但就是很多别人不敢买的股票，让他赚了很多钱。",
			"date_published": 1469443994.36,
			"body": "Blog post body"
		},
		{
			"post_id": 554,
			"title": "如果下周大盘大跌，那么5、6月修正的趋势，将破坏殆尽，如果继续上行，则连续三个月的强势，会从技术上改变市场对市场的结论。从这个角度，下周大盘深度回调的可能性几乎不存在。\n",
			"date_published": 1469370069.866,
			"body": "Blog post body"
		},
		{
			"post_id": 553,
			"title": "经历聊一年的股灾以后，市场对恐惧已经开始麻木，乐观情绪逐渐起来。从趋势上，大盘依然是上行的主旋律。\n",
			"date_published": 1469370004.595,
			"body": "Blog post body"
		},
		{
			"post_id": 552,
			"title": "回顾海南房地产危机的以后对金融政策，资本市场，金融市场的影响，以及对房地产行业自身影响，或者对居民的消费理念和消费意识的影响，以及今年国际流行的金融政策，方法和手段，银行业将是危机的最大受益者",
			"date_published": 1469369923.558,
			"body": "Blog post body"
		},
		{
			"post_id": 551,
			"title": "宝万之争最大的受害者是地产和保险板块，地产行业实质性影响相对较小，而保险板块则是盈利模式的颠覆，如果一旦宝能战败，那么保险业的打击或许将是一次极大的重创",
			"date_published": 1469369747.655,
			"body": "Blog post body"
		},
		{
			"post_id": 550,
			"title": "中国的彩民与股民的数量相当，都有一亿左右的人群",
			"date_published": 1469369530.105,
			"body": "Blog post body"
		},
		{
			"post_id": 549,
			"title": "房地产税讲了多年了，每次都引起高度关注，每次虚惊?一场。未买房者引颈高盼，喜出望外，己买房者担惊受怕，理论家们马上文章纷纷出笼，吸人眼球。最后财政部风声大雨点小不敢动真的，北上广深厦合宁苏房价又大涨一场。我敢和楼部长当面在央视或凤凰卫视pk，看看谁是谁非，谁在推进中国经济增长和发展，谁在致中国经济于死地。交了70年高额土地使用费再征西方房地产税，等于一只羊身上剥两次皮，税务总局先把70年收走的费吐出来还给百姓，再分70年一年年交西方式房地产税啊！讲理吗？另外，谁推高了房价？13、7亿国人？不是，是央行大发货币，朱镕基总理退休2003年，M2约为12万一13万亿，（1949起51年），现在仅13年为149万亿，10多倍，M2除以GDp为百分之200多，美国始终不到百分之100。大量货币到来，又百分之95是产能过剩，货币就往大城市房地产中钻，推高了房价。（朱总理管经济十多年，房价不涨，复旦大学附近房价始终3800一约4000元一平米，货币管住了啊），一边央行大发货币，一边房价推高，一边财政部部长又要征税，何等如意算盘。如果把中国经济推向日本失去的20年，楼部长担当得起码？相信?一定是前几年上海重庆的房产税，名存实亡，或北京的增值税，导致很多很多家庭假离婚，以失败而告终一幕的重演。相信党中央国务院决不会容忍财政部个别官员的胡言乱语及胡作非为。请记住，古今中外，货币财政税收部门不一定都对，干错事的多的是，新朝时王莽多次币制改革，法国雨果时的门窗税，都使人民恨之入骨。雨果讲，门窗税是对人民的空气阳光征税，是恶税。搞得成千成万人民假离婚的税是良税吗？中国老百姓不是西方国家的良民，收入低，挣点钱，给小孩买个房不容易，你有政策，我有对策，你是共产党我是八路军，你要征房地产税几万，几十万，我假离婚几十元，再非法同居。楼部长我们认识，希望你是总观全局的经济学家，不是贾康类的只知税收不知全局的傻毛官员。切切。（有关细节，理论，容当日后深入讨论。顺祝暑祺！）深夜于复旦大学",
			"date_published": 1469368659.815,
			"body": "Blog post body"
		},
		{
			"post_id": 548,
			"title": "M2增加，但是企业经营产生的利润并没变，甚至减少。这一点从大部分企业分红可以看到",
			"date_published": 1469365559.456,
			"body": "Blog post body"
		},
		{
			"post_id": 547,
			"title": "2003年M2是13万亿，现在已经是恐怖的149万亿，宇宙第一，美国只有100万亿",
			"date_published": 1469363977.548,
			"body": "Blog post body"
		},
		{
			"post_id": 546,
			"title": "近期习李政策中最要突出的政策就是明显有意图地提速国企业改革，而且在众多相关的大会议中，反复强调了国企改革的进程缓慢、效率低下的强调，既然上有政策反复强调了国有企业改革必须加快加强加大，那各个地主政府相关领导层必须准确及时地解读习李政策布署。否则，各个地方政绩将难以完成。而一路跟随常长亭文章的常粉们。地方国企改革最前沿部队当然是上海与深圳。",
			"date_published": 1469362211.018,
			"body": "Blog post body"
		},
		{
			"post_id": 545,
			"title": "目前行情---- 退二进一",
			"date_published": 1469361929.728,
			"body": "Blog post body"
		},
		{
			"post_id": 544,
			"title": "茅台会回调到150元一股",
			"date_published": 1469361884.4,
			"body": "Blog post body"
		},
		{
			"post_id": 543,
			"title": "曾担任过证监会副主席的李剑阁曾公开表示：\n \n股市的首要功能还是融资。我们的资本市场，如果一味地为了维护股价，放慢新股发行节奏，那股市就变得只有交易功能，没有融资功能。相信证监会的领导班子，在对资本市场完成一系列整治之后，第一大任务就是要恢复股市的融资功能。只有这样，资本市场才能真正和实体经济衔接起来。否则都是炒作资金进进出出，和实体经济没有什么关系。\n \n在国家急于提高直接融资比重的大背景下，李剑阁的观点绝对带有普遍性。所以，作为一个投资者我们要看清当前股市的实质。在IPO注册制出台之前，还是立足短炒，不满仓、不留恋，时刻保持警觉。\n",
			"date_published": 1469356353.814,
			"body": "Blog post body"
		},
		{
			"post_id": 542,
			"title": "目前A股市场里已经“过会”的银行有：江苏银行、杭州银行、上海银行、贵阳银行、张家港农商行、吴江农商行、常熟农商行、无锡农商行、江阴农商行等。其中江苏银行已经申购，贵阳银行、江阴农商行昨天拿到了批文，另外几家将择机放行。这些银行股的上市，一方面带来资金压力，另一方面也可以继续把股市的平均市盈率降低。",
			"date_published": 1469356301.89,
			"body": "Blog post body"
		},
		{
			"post_id": 541,
			"title": "自2010年光大银行上市以来，已经有6年没有银行股IPO。现在银行业面临着利率市场化后半程（先甜后苦），加上互联网金融的挑战、经济下行压力和利差变薄，多数银行需要补充资本金。但A股承受能力有限，相当一批银行被迫去了H股。",
			"date_published": 1469356262.943,
			"body": "Blog post body"
		},
		{
			"post_id": 540,
			"title": "当股指上冲到3100点附近的时候，一是会有国家队抛盘，二是会有新股提速。反过来，如果上证指数跌破2900点，则新股会减量，主力会护盘",
			"date_published": 1469356215.707,
			"body": "Blog post body"
		},
		{
			"post_id": 539,
			"title": "杠杆资金对上市公司围猎豪赌，映射出A股公司“壳化”和投资“VC化”的趋势。当所谓的“壳”成为待价而沽的稀缺资源，并购重组热衷“贴热点”、“赌未来”，新兴产业资产估值不断推升之际，资金的风险偏好急遽上升，更多产业资本亦趋之若鹜，逐渐形成了一个贯穿一二级市场、投机氛围颇为浓烈的利益生态链",
			"date_published": 1469356058.341,
			"body": "Blog post body"
		},
		{
			"post_id": 538,
			"title": "有人只出资1万元，就主导了21.5亿元的上市公司收购案，杠杆超过万倍！",
			"date_published": 1469355995.887,
			"body": "Blog post body"
		},
		{
			"post_id": 537,
			"title": "什么时候开始做空？",
			"date_published": 1469347361.62,
			"body": "Blog post body"
		},
		{
			"post_id": 536,
			"title": "大多数股票还要下跌40%；指数下跌20%",
			"date_published": 1469347207.944,
			"body": "Blog post body"
		},
		{
			"post_id": 535,
			"title": "7月20日江苏银行启动申购，拟募资72.38亿元，成为A股年内迄今为止最大的IPO，业界预计多家潜伏其中的上市公司将受益，因此近期华泰证券(601688,股吧)、苏宁云商(002024,股吧)、宏图高科(600122,股吧)等持有股份的上市公司也成了市场关注的焦点。",
			"date_published": 1469336112.612,
			"body": "7月20日，江苏银行在上交所发行申购，发行价为6.27元，拟募资72.38亿元，成为A股年内迄今为止最大的IPO。\n\n　　这是时隔6年，A股市场再次开闸迎接银行股。自2010年8月光大银行(601818,股吧)登陆A股市场后，证监会公布的首发名单里再难觅银行踪迹。挂牌之后，江苏银行将成为A股银行板块第17家成员，也是北京银行(601169,股吧)、南京银行(601009,股吧)、宁波银行(002142,股吧)之后的第四家A股上市城商行。\n\n　　新股发行，持有它们股份的影子股上涨是历来的炒作题材，这是几乎每一批新股都会发生的场景。因为新股上市后多数会被爆炒，所以影子股也会率先被炒。那么，到底江苏银行有哪些影子股呢？\n\n　　根据江苏银行招股说明书，其股东中潜伏了不少A股上市公司，其中，第三大股东华泰证券持有其6.4亿股，占比为6.16%；第九大股东华西股份(000936,股吧)持有2.49亿股，占比为2.39%；第十二大股东宁沪高速(600377,股吧)持2亿股，占其发行前总股本的1.92%；苏宁云商则排在第十四位，持有1.5亿股，占比为1.44%。\n\n　　其中，华泰证券、华西股份在江苏银行成立初期，就已持有该行股份，进入前十大股东之列；苏宁云商则是在2009年通过定向增发的方式进入。\n\n　　模塑科技(000700,股吧)6月20日公告称，持有江苏银行10044.25万股，占其发行前总股本0.97%，初始投资金额为7260万元。此前公开信息还显示，宏图高科以4.65亿元收购了三胞集团有限公司持有的江苏银行1亿股股份。而黑牡丹(600510,股吧)在江苏银行重组时加入，持有1.06%股权。此外，苏州高新(600736,股吧)持有江苏银行6685万股，占其发行前总股本0.64%；悦达投资(600805,股吧)持有4980万股，最少的苏常柴A持有3800万股。\n\n　　值得一提的是，2014年3月，江苏银行第二大股东凤凰集团计划将其持有的江苏银行8.9亿股注入凤凰股份(600716,股吧)，虽然至今尚未实施，但凤凰股份也因此成为江苏银行的潜在影子股之一。\n\n　　如果从6月17日江苏银行IPO获批开始计算，上述影子股表现各异。区间涨幅最大的是华西股份，达到23.48%；华泰证券区间涨幅也有16.57%；黑牡丹、悦达投资、凤凰股份、苏州高新的涨幅均在10%至15%之间。模塑科技、宁沪高速、苏常柴A的区间涨幅为6.84%，而苏宁云商和宏图高科的区间涨幅为负，分别跌0.27%和9.02%。\n"
		},
		{
			"post_id": 534,
			"title": "博傻理论说的是在资本市场中（如股票、期货市场）：人们之所以完全不管某个东西的真实价值而愿意花高价购买，是因为他们预期会有一个更大的傻瓜会花更高的价格从他们那儿把它买走。博傻理论告诉人们的最重要的一个道理是：在这个世界上，傻不可怕，可怕的是做最后一那个傻子",
			"date_published": 1469335545.863,
			"body": "Blog post body"
		},
		{
			"post_id": 533,
			"title": "两融数据与指数行情的关系",
			"date_published": 1469325782.377,
			"body": "回顾数据，2016年来曾有两波券商下调平仓线为两融松绑，分别是1月份招商证券率先将预警线、平仓线各下调了10个百分点，解除线下调了20个百分点，分别降至150%、130%和140%。而同期上证指数大幅下跌，创了有沪深交易所以来最差的开局；3月份，国泰君安率先以上调两融折算率的方式再次对融资融券业务进行松绑，此后有多家券商纷纷跟进。两市在两会效应下，开始了反弹模式，有过两波七连阳，两融余额也是持续增加，并在4月14日突破8975亿元，此后两融余额逐渐回落到8900亿元之下，到目前为止也没有再次突破8900亿元。\n　　随着指数站上3000点，两融余额在7.7日重新突破8700亿元。2016年初以来市场波动加大，市场成交量下降，两融规模和去年同期相比出现了大幅缩水。今年二季度末，两融余额为8535.84亿元，相比较去年同期的20493.86亿元的规模，已经缩水58.35%。环比今年一季度末8809.33亿元的规模，今年二季度末两融余额规模缩水3.1%。\n　　目前93家券商中，仅有中信证券、华泰证券两家两融余额规模超过500亿，上半年收官之际，两融余额分别为503.28亿元和500.91亿元，相比去年同期，有8家券商两融余额规模缩水超过50%，缩水最大的国信证券，幅度达到了67.13%；而当时排名第一位的广发证券，如今缩水65.32%。所以，对应市场走势也可以看到，两融数据的降低，带来指数行情的走弱，正所谓“水涨船高，水落船低”。\n　　从融资净买入的板块来看，近三个月以来，融资净买入额最高的行业为制造业、采矿业和信息传输、软件和信息技术服务业。从融资情况看，7月份以来至今，融资净买入的标的股有525只。其中，国防军工（93.75%）、有色金属（81.25%）和食品饮料（74.19%）等三行业融资净买入标的股数量占行业内融资融券标的股总数比例居前，合计吸引融资88.27亿元。所以，这些行业个股依然可关注一下，越是大资金炒作惯性的越强。"
		},
		{
			"post_id": 532,
			"title": "股庄理论",
			"date_published": 1469259332.989,
			"body": "Blog post body"
		},
		{
			"post_id": 531,
			"title": "如何判断庄股要发飙？",
			"date_published": 1469258584.927,
			"body": "Blog post body"
		},
		{
			"post_id": 530,
			"title": "东旭光电近期推出的一款石墨烯基锂离子电池意味着首个石墨烯产品从实验室走向市场。\n　　宝泰隆、华丽家族、东旭光电、新华锦、中国宝安、方大炭素、道氏技术。 \n　　龙头就是宝泰隆。\n",
			"date_published": 1469258045.449,
			"body": "Blog post body"
		},
		{
			"post_id": 529,
			"title": "　有消息称股市巫师程定华要重出江湖，再战私募，而且是一只规模百亿的大私募",
			"date_published": 1469257563.941,
			"body": "Blog post body"
		},
		{
			"post_id": 528,
			"title": "前段时间暴涨的次新股开始迎来崩盘式下跌，而且崩的是摧枯拉朽，合诚股份(行情69.10 -10.00%,买入)今日首次打开一字涨停板，集合竞价的时候还是涨停，收盘的时候早已封死跌停",
			"date_published": 1469256986.986,
			"body": "Blog post body"
		},
		{
			"post_id": 527,
			"title": "奇葩股争相表演的窗口，本周上峰水泥(行情7.91 -10.01%,买入)可谓特立独行，那叫一个坑爹，周二逼近涨停，周三逼近跌停，周四逼近涨停，周五又跌停，真是买买买、割割割的完美代言人，庄家这样赤裸裸的把自己推到风口浪尖，就不怕被查嘛，真令韭菜为此胆颤! ",
			"date_published": 1469256818.797,
			"body": "Blog post body"
		},
		{
			"post_id": 526,
			"title": "集合竞价虚假申报的异常交易行为。所谓“虚假申报”，是指不以成交为目的的申报，主要包括大量频繁申报并撤销申报的行为，以及在成交可能性很小的情况下，继续大量申报的行为。常见做法是在9时15分至9时20分之间，以明显高于前收盘价的价格连续、大量申报买入，导致该证券虚拟开盘参考价大幅上涨，以此吸引其他投资者跟风申报买入。此后，前述投资者会在9时20分之前撤销自己全部或大部分买入申报，并按照被影响后的相对高价反向申报卖出，实现其高价出货的真实交易目的。",
			"date_published": 1469256245.696,
			"body": "Blog post body"
		},
		{
			"post_id": 525,
			"title": "两融余额四连增逼近8900亿 呈现逆市净买入格局 ",
			"date_published": 1469255672.038,
			"body": "Blog post body"
		},
		{
			"post_id": 524,
			"title": "明知是火坑，仍有1.6亿元资金投入其中，化为灰烬。这就是大A股市场的真实状况。",
			"date_published": 1469252114.672,
			"body": "日前，深交所关于欣泰电气投资者关心问题的说明显示，该股自7月12日复牌至7月22日收盘，9个交易日连续跌停。7月22日报收5.64元，市值由24.96亿元，减至9.68亿元，较停牌前下跌61.22%，累计成交额16058万元。\n这1.6亿元资金的接盘侠都有谁？统计显示，9个交易日共有6767个个人账户买入该股，买入成交1621.18万股，占买入总量98.5%。资金规模在100万元以下的个人账户6354个，买入成交1094.09万股，占66.47%。仅14个机构账户买入24.75万股。\n"
		},
		{
			"post_id": 523,
			"title": "宁心静思，从即日起找出适合自己的那一招儿，反复操练。或许是每个股民最最有价值的一件事。",
			"date_published": 1469251771.931,
			"body": "Blog post body"
		},
		{
			"post_id": 522,
			"title": "打板可以赚，长久以年为单位持股也会赚，但那些聪明人，没有原则的，通常都会赔掉本金，离开市场。",
			"date_published": 1469251737.034,
			"body": "Blog post body"
		},
		{
			"post_id": 521,
			"title": "江湖久负大名的敢死队。只用一招打涨停，所创造了众多财富神话。不是不涨停不看它，不是涨停不去做。便是他们成功的秘诀。",
			"date_published": 1469251697.161,
			"body": "Blog post body"
		},
		{
			"post_id": 520,
			"title": "由简单到复杂其实是条歧途。股市是思想越简单，才越会赚钱。",
			"date_published": 1469251664.797,
			"body": "Blog post body"
		},
		{
			"post_id": 519,
			"title": " 通常反弹会从二个方面展开，一个是跌的最深的，最急的，内在资金没有充分时间走人，所以会反弹较猛。第二类就是那种一直自顾自在走独立行情的个股; 显然，市场选择了第二种，象石大胜华，兔宝宝，东旭光电，神州数码这一类个股都在盘中走出了顺势向上的突破大阳线行情。\n",
			"date_published": 1469251394.319,
			"body": "Blog post body"
		},
		{
			"post_id": 518,
			"title": "市场最后一个股坚强有色板块，今天 出现了大面积的补跌。按经验这基本是震荡区即将结束的一个信号。当最后的强势 板块进入全面补跌，则市场进入反再次的反弹之中。\n",
			"date_published": 1469251348.692,
			"body": "Blog post body"
		},
		{
			"post_id": 517,
			"title": "操作策略:精选庄股，高抛低吸",
			"date_published": 1469251264.81,
			"body": "Blog post body"
		},
		{
			"post_id": 516,
			"title": "庄股，看起来很美丽，但他最终的打击 性，破坏性更为强大，2004年左右倒下的那一批庄股，湘火炬，新疆屯河最后的一字跌停板，强度远大于2015年的股灾1.0，2，0",
			"date_published": 1469250773.318,
			"body": "Blog post body"
		},
		{
			"post_id": 515,
			"title": "象东旭光电，石大胜华，这种趋势性上涨的品种上，最近进入加速，这通常也是老庄最后的一波疯狂.之后的结局也是和连板个股一样洋，应该跌的还是会跌.",
			"date_published": 1469250707.917,
			"body": "Blog post body"
		},
		{
			"post_id": 514,
			"title": "最近四周，量子通信板块持续大涨，本周又成为板块涨幅榜冠军。量子通信原本是概念，到今年开始逐步落地，成为实实在在的超级大行情，有点像当初的新能源汽车。量子通信在近期的走强，直接诱因是我国第一颗量子通信卫星即将发射，多数人的想法不过是跟着热点，炒一把题材。但是，量子通信不仅仅是题材，而是一个正在快速实施的国家发展战略。",
			"date_published": 1469250459.316,
			"body": "由于这个技术的实用性，政府快速启动了京沪干线量子通信示范工程，最近要发射的量子通信卫星就是与之配套的。与这个工程同步的，是浙江的量子通信商业化工程，安徽和山西也在启动区域性量子通信示范工程。这个量子通信的市场机会非常大，短期看千亿级别，长期看万亿级别。这个板块的启动，不是概念炒作，有眼光的大机构会持续看好，长期运作。"
		},
		{
			"post_id": 513,
			"title": "战略性买入的板块是，增强现实产业链，量子通信产业链。这一板块的策略是越跌越买，只要看准目标，甚至可以满仓操作，不虑大盘涨跌。",
			"date_published": 1469250418.128,
			"body": "Blog post body"
		},
		{
			"post_id": 512,
			"title": "考虑买入的品种是，具有新材料性质的精细化工股，智能汽车及物联网板块，区域性房地产股票。",
			"date_published": 1469250394.273,
			"body": "Blog post body"
		},
		{
			"post_id": 511,
			"title": "考虑卖出的品种主要是，有色金属、煤炭、钢铁、交通运输、银行、券商、保险，对这些品种，基本思路是全部卖光，一股不留。博弈，需要的是果断。",
			"date_published": 1469250363.159,
			"body": "Blog post body"
		},
		{
			"post_id": 510,
			"title": "最近两周这两个板块出现了持续回调，其调整幅度超出了正常行情调整的必要幅度。我们尤其注意到，有色金属中最强势的锌板块与大宗商品市场走势的反向运动：最近两周锌价连续上涨接近6%，但主流的锌矿股票却下跌了20%左右。这种背离的正常解释是：股价已经透支了产品价格的上涨，主力机构正在大规模兑现。",
			"date_published": 1469250071.939,
			"body": "Blog post body"
		},
		{
			"post_id": 509,
			"title": "华中科技大学22日对外宣布，由该校张海鸥教授团队历经10余年潜心攻关发明的“铸锻铣一体化”金属3D打印技术，在3D打印技术中加入了锻打技术，日前已成功制造出世界首批3D打印锻件",
			"date_published": 1469249851.92,
			"body": "Blog post body"
		},
		{
			"post_id": 508,
			"title": "袋鼠妖怪游戏GQY板的时候，利用相关性找到了游戏相关标的任天堂的指定开发---嘉麟杰的旗下公司，迅速锁定，跟踪挖掘",
			"date_published": 1469249780.763,
			"body": "Blog post body"
		},
		{
			"post_id": 507,
			"title": " 量子科学实验卫星计划于8月中旬择机发射，成功发射后中国将成为全球第一个实现卫星和地面之间量子通信的国家，加上今年下半年建成的地面光纤，量子通信网络，国内将初步建成广域量子通信体系，构建一个天地一体化的量子保密通信与科学实验体系。在今年的“十三五”规划中，量子通信和天地一体化信息网成为十大重点推进项目，在明确的产业发展趋势面前，现阶段是布局量子通信主题的最佳时机。",
			"date_published": 1469224722.698,
			"body": "Blog post body"
		},
		{
			"post_id": 506,
			"title": "中报业绩不及预期大变脸，必定首当其冲被各路资金抛弃，面临深度回调的巨大风险，需及时出局。如业绩持续亏损的天山股份(000877,股吧)，成交量持续萎缩",
			"date_published": 1469224349.816,
			"body": "Blog post body"
		},
		{
			"post_id": 505,
			"title": "业绩为王是主力一致高度认同的选股思路，绩优股遭到主力疯狂的扎堆抱团，这类股也是市场为数不多可参与的交易机会，需牢牢把握住。如业绩预增超过200%的长江投资(600119,股吧)，消息一出，个股持续大阳逼空，连续五个交易日累计涨幅超过35%",
			"date_published": 1469224055.556,
			"body": "Blog post body"
		},
		{
			"post_id": 504,
			"title": "超级行情必然是人工牛市，当年998点到6124点亦是如此，所有舆论媒体都将为某个改革保驾护航，所有政策都会对这个改革开绿色通道，所有启动因素都是人为控制而非市场自发的行为",
			"date_published": 1469223445.67,
			"body": "Blog post body"
		},
		{
			"post_id": 503,
			"title": "国企改革进入新阶段的时候，企业债、地方债包袱要被逐步化解的时候，“一带一路”亚投行这些大事件要落实的时候，就带给了A股市场再度重启超级牛市的契机",
			"date_published": 1469223377.197,
			"body": "Blog post body"
		},
		{
			"post_id": 502,
			"title": "AR概念股主要有以下四类：GQY视讯、华策影视(300133,股吧)、美盛文化(002699,股吧)等控股参与AR的概念股；水晶光电(002273,股吧)、福晶科技(002222,股吧)等光学显示等涉及光学显示硬件分析的概念股；中科创达(300496,股吧)、华力创通(300045,股吧)等AR软件及平台概念股；以及掌趣科技(300315,股吧)、游族网络(002174,股吧)等布局AR手游影视的概念股。",
			"date_published": 1469199027.582,
			"body": "Blog post body"
		},
		{
			"post_id": 501,
			"title": "360回归A股市值3000亿元? 借壳的要暴富了",
			"date_published": 1469198632.59,
			"body": "奇虎360还未在A股上市，市场已经提前列队欢迎。随着奇虎360近期一纸美股退市公告，相关概念股就像打了鸡血一样，股价蹭蹭往上涨。这其中，既有浑水摸鱼的，也有实质性受益的股票，数据宝梳理以下相关个股，供投资者参阅。\n\n　　深圳惠程(002168,股吧)昨日晚间发布澄清公告：公司与奇虎360公司从未进行过任何接触，不存在相关重大资产重组、上市公司收购等重大事项。受此影响，深圳惠程今天放量跌停。不过，这并未影响实质参与360私有化的个股上涨脚步。拟4亿美元参与奇虎360私有化的中信国安(000839,股吧)，今天大涨3.31%，创出反弹以来新高。\n\n　　此外，拟8971.4万美元参与360私有化的天业股份(600807,股吧)股价也频频大涨，7月以来涨幅高达34.16%。另外两只拟投资360的A股，走势相对比较稳定，其中2.2亿元人民币参与360私有化的电广传媒(000917,股吧)7月以来涨幅8.55%，拟3000万元美元投资360的爱尔眼科(300015,股吧)7月以来涨幅3.68%。\n\n　　奇虎360回归A股市值3000亿？\n\n　　奇虎360回归A股的步伐进一步加快。美国东部时间2016年7月15日，奇虎360科技有限公司宣布私有化交易完成。届时，奇虎360的股票将不再在美国纽交所公开交易。截至退市前，360收报76.92美元，总市值90多亿美元，市盈率35倍左右。\n\n　　与A股同行相比，360的估值明显偏低，这也是中概股回归的原动力。坊间有分析仍是称，奇虎360回归A股后将成为千亿市值公司，相较退市前市值至少翻倍，而甚至有人认为市值有望达到3000亿元。\n\n　　目前A股市场上网络信息安全概念股中，估值最高的旋极信息(300324,股吧)，最新静态市盈率超过226倍。据Wind资讯，奇虎360去年实现净利润为30443万美元，按照旋极信息的市盈率计算，其总市值将达到惊人的688亿美元，按照6.7的汇率计算折合人民币4609亿元。即便按照板块平均市盈率111倍计算，其总市值将达到2264亿元人民币。事实上，这还仅仅是按照去年的净利润计算，要知道，奇虎360仍处于一个高速成长态势之中。\n\n　　参与私有化的A股公司也赚翻了\n\n　　如果奇虎360回归A股后真能达到上述估值，市场参与各方无疑赚翻天了。360私有化估值为93亿美元，按照A股板块平均市盈率回归计算市值的话，市值增加了260%多；按照市盈率上限回归计算市值的话，则足足增加了600亿美元，增幅达640%多。\n\n参与私有化的4家A股上市公司，也能够分得其中一杯羹。为了测算出奇虎360回归A股对上述公司的影响，引入投资部分市值除以上市公司最新市值的比值，可以一定程度看出该事项对相关个股的刺激程度。该比值越大，360回归对该股股价刺激作用则越大。\n　　参与私有化的4家A股上市公司，也能够分得其中一杯羹。为了测算出奇虎360回归A股对上述公司的影响，引入投资部分市值除以上市公司最新市值的比值，可以一定程度看出该事项对相关个股的刺激程度。该比值越大，360回归对该股股价刺激作用则越大。\n\n　　按照上市公司公告，中信国安持有相关投资主体80%权益，按照4亿美元投资额度计算，上市公司占有3.2亿美元额度，占私有化估值93亿美元的3.44%。按照回归市值2264亿元人民币计算，中信国安投资额度测算市值将达到78亿元人民币，占最新总市值比例为19.7%左右。其他上市公司方面，天业股份投资额度测算市值将达到22亿元人民币，占最新总市值比例约为15.2%左右。天业股份投资额度测算市值将达到8亿元人民币，占最新总市值比例约为3.1%左右。爱尔眼科投资额度测算市值将达到7亿元人民币，占最新总市值比例约为1.9%左右。\n\n　　又有一家公司发公告否认360借壳\n\n　　奇虎360回归A股的盛宴，除了上述四家A股上市公司铁定受益外，市场也在纷纷猜测谁会成为最幸运的那一个，即成为360借壳对象。继深圳惠程公告未与奇虎360接触外，今天下午博通股份(600455,股吧)也否认360借壳传闻。\n\n　　天下熙熙皆为利来、天下攘攘皆为利往，全民猜壳，为得当然也是巨大的利益。数据宝小编也来猜一猜，看看能不能撞个大运，主要有以下筛选标准：\n\n　　1、创业板不能借壳，所以要剔除创业板股票。\n\n　　2、业绩较差成为借壳常规标准，2014年、2015年年度每股收益不得大于0.1元。\n\n　　3、360上市后必然属于超级大盘股，借壳小盘小市值股概率小。选择总股本在5亿股-10亿股之间、A股市值在50亿-150亿元之间的个股。\n\n　　4、实际控制人为自然人，这样决策流程快，有利于快速上市。\n\n　　5、近1年没有资本运作或拟资本运作的个股。有上述行为的说明实际控制人仍有持续经营的欲望，再度短期卖壳的可能性小。\n\n"
		},
		{
			"post_id": 500,
			"title": "石墨烯",
			"date_published": 1469197077.339,
			"body": "东旭光电推出世界首款石墨烯基锂离子电池“烯王”，与普通电池相比，石墨烯基锂离子电池可在满足5C（C表示电池充放电时电流大小的比率）条件下，实现15分钟快速充放电，而且，该石墨烯基锂离子电池可在-30~80℃环境下工作，循环寿命高达3500次左右，而传统锂电池只能达到500次左右。 \n\n　　投资者对石墨烯并不陌生，过去几年在二级市场上就已经出现过炒作风潮。作为2010年度诺贝尔物理学奖主题，石墨烯具有高导电性、高韧度、高强度、超轻薄等特点，被许多科学家认为是革命性的新材料，称其极有可能推动电子产业步入新的发展阶段。 \n\n　　有石墨烯研究员介绍称，石墨烯整体的产业链分为上、中和下游，上游主要包括制备石墨烯的材料和设备，中游是各类石墨烯产品，下游是应用，主要包括新能源、复合材料、电子信息等多个领域。 \n\n　　政府亦非常重视石墨烯产业的发展和应用。《中国制造2025》提出，做好超导材料、纳米材料、石墨烯、生物基材料等战略前沿材料提前布局和研制。《重点领域技术路线图》也对石墨烯中长期发展路线进行了部署，并纳入《新材料产业“十三五”发展规划》。 \n\n　　西部证券(行情26.57 +0.42%,买入)高级投资顾问马征认为，未来石墨烯的总体目标是：2020年形成百亿规模，2025年要突破千亿。 \n\n　　中国非金属矿工业协会石墨专委会副秘书长刘荣华预计，在复合材料、锂离子电池正极材料以及电子触摸屏领域，石墨烯最有希望率先实现产业化。其中，石墨烯在锂离子电池市场上的潜在市场为10亿级别。 \n\n　　但石墨烯产业最大的瓶颈在于没有形成完整、成熟的产业链，石墨烯研发制备企业和下游应用企业脱节。 \n\n　　目前，石墨烯仍处于产业化初期，尚未完全实现石墨烯的规模化应用，对石墨烯产品最大的需求市场仍然是科研院校和少量生产厂商，大部分石墨烯企业仍无法找到稳定的盈利模式。 \n\n　　据了解，此前市场单层石墨烯销售价格在1000-2000元/克，由于掌握了低成本、高品质、大规模石墨烯制备方法，东旭光电旗下子公司碳源汇谷生产的单层石墨烯价格大幅下降。“石墨烯技术在不断地取得突破，与此同时国家又在大力推动，这两年应该是石墨烯产业发展的黄金时期。” \n\n　　对此，国务院参事徐锭明表示，从长远看，未来能源不取决于对资源的占有，而取决于能源高科技的突破。 \n\n　　平安证券指出，据估算2018年国内石墨烯导电剂浆料市场空间接近50亿元。随着新能源汽车（爱基,净值,资讯）市场的快速发展，石墨烯导电剂在替代传统导电剂领域尚有广阔的市场空间。国内石墨烯相关公司将迎来产业化良机。 \n\n　　相关个股点评： \n\n　　金路集团(行情7.33 停牌,买入)“金路集团是相关公司中产业规划最清晰的。”国海证券(行情7.45 -1.72%,买入)研究员称。金路集团涉足石墨烯业务时间并不长。2011年6月，金路集团与中科院金属所签订《技术开发合同》，双方同意在石墨烯研发及产业化方面展开平等互利的合作。2012年11月，“石墨烯材料的规模化制备技术”通过四川省科技厅专家鉴定。不过，该公司特意强调，该项技术尚处于中试阶段，还需要进行持续优化。 \n\n　　华丽家族(行情10.11 +6.87%,买入)华丽家族虽然没有涉足石墨烯，但研究员表示，其大股东旗下的宁波墨西科技公司号称要打造全球第一条300吨石墨烯量产生产线。未来如果能把这一资产注入进来，华丽家族也将大为受益。华丽家族大股东南江集团控股的宁波墨西科技合资公司设立于2012年4月，号称拥有全球第一条石墨烯生产线，设计年产300吨。 \n\n　　乐通股份(行情17.28 停牌,买入)乐通股份、ST南江B(行情2.89 停牌,买入)的大股东南江集团，与宁波墨西科技设立合资公司，分别研发石墨烯油墨、功能性涂层产品等。消息一出，两家公司的股价均出现大涨。不过，墨西科技能否实现那么大的产能，尚待确定。 \n\n　　中国宝安(行情10.89 +2.74%,买入)石墨烯项目是公司利润增长的主要希望。据公司2012年半年报显示，鸡西贝特瑞石墨产业园二期项目已建成投产，由贝特瑞公司控股的鸡西长源矿业有限公司年处理石墨原矿60万吨及配套采选矿厂项目，争取当年10月具备试生产条件；惠州贝特瑞工业园一期和天津贝特瑞新能源科技产业园建设顺利，预计将于当年9月和10月投产。\n"
		},
		{
			"post_id": 499,
			"title": "有人说经验教训是可以总结的，我觉得不能‘总结’，股市的教训就是金钱上的代价。我要求百分之百的正确。你说有百分之一错，问题不大。不行！你这百分之一，也许就是毁灭性的",
			"date_published": 1469196618.828,
			"body": "Blog post body"
		},
		{
			"post_id": 498,
			"title": "投资股市的本质，就是投资中国最赚钱的企业",
			"date_published": 1469196557.998,
			"body": "Blog post body"
		},
		{
			"post_id": 497,
			"title": "市场最理想的状态是下周跌破2980点平台低点，将市场的浮筹彻底清洗，让恐慌盘下车后止跌，这个做法是为再攻3100点做好准备的，届时金融类指标股悉数调整到位，配合市场板块热点，就能再次发动3100点的攻击战。在整个调整过程中偶尔昙花一现的板块也会是将来再次发动行情的主攻品种，因此，近期异动的板块都是很有价值的，需要耐心筛选，大概率将来会出牛股",
			"date_published": 1469196440.432,
			"body": "Blog post body"
		},
		{
			"post_id": 496,
			"title": "VR概念股将成为牛股",
			"date_published": 1469196315.025,
			"body": "Blog post body"
		},
		{
			"post_id": 495,
			"title": "现在是炒作妖股的最佳时期，因为大盘稳定，政策呵护，资金充沛，外盘向好，所以，投资者要及时找到选股方法，勇敢参与个股炒作",
			"date_published": 1469196264.938,
			"body": "Blog post body"
		},
		{
			"post_id": 494,
			"title": "大盘下周将产生2-3天反弹，之后将继续进入阶段性调整的第三段杀跌中，目标为2947点；\n",
			"date_published": 1469196207.141,
			"body": "Blog post body"
		},
		{
			"post_id": 493,
			"title": "大盘下周一将探底回升，收盘为带长下影的锤头阳线，下周一具备抄底条件，是逮获牛股甚至妖股的最佳时间点",
			"date_published": 1469196184.397,
			"body": "Blog post body"
		},
		{
			"post_id": 492,
			"title": "当前新市场唯有炒作妖股才能跑赢大势才能少亏多赚",
			"date_published": 1469196102.807,
			"body": "Blog post body"
		},
		{
			"post_id": 491,
			"title": "由于国家队救市救成了大庄家，控盘大盘，因此，想大盘大跌是不可能的，而向上突破又有巨大的套牢盘，且经济形势又不支持，所以，大盘必须阶段性调整，重新聚集做多动力，才能返身向上，才能突破3097，进入中级行情高潮，目前的调整是合理的，也是温和的；",
			"date_published": 1469187750.226,
			"body": "Blog post body"
		},
		{
			"post_id": 490,
			"title": "the dapan is down by -0.84%; and this is the first day there is no stock in our portfolio to sell.",
			"date_published": 1469186088.785,
			"body": "Blog post body"
		},
		{
			"post_id": 489,
			"title": "看看大盘现在的位置，不过3000点水平，8个月前同样的3000点，较量了一个月之后展开了去年4季度一轮时间最长的反弹。而时至今日，系统性风险比那时候更小。”",
			"date_published": 1469184471.357,
			"body": "Blog post body"
		},
		{
			"post_id": 488,
			"title": "A股估值高估30%；2200是合理区域",
			"date_published": 1469113472.407,
			"body": "Blog post body"
		},
		{
			"post_id": 487,
			"title": "傻逼民生",
			"date_published": 1469112253.513,
			"body": "大佬云集的民生银行从来就不缺故事。民生银行的价值分析市场上已经多如牛毛，不再复述，退一万步讲没价值的东西也不会有人盯着，今天只聊故事，不谈业绩。\n\n2016年6月30日，现任副董事长张宏伟的东方集团和华夏人寿签订一致行动人协议，合计股权比例5.48%，7月11日起，现任副董事长卢志强的泛海控股一、二级市场并进，耗资75亿，持股比例至从此前的2.32%提升至5.69%，持股数量已超越“东方集团+华夏人寿”联合体，成为安邦和之后的第二大股东。\n\n\n貌似在万科（000002.SZ）、神州控股（861.HK）告一段落之后，又有一场大戏在酝酿。\n\n然而，从1996年起，20年间民生银行已经有丰富的斗争经验。\n\n细看，今年这场戏貌似又有别样的风情。\n\n▌一、民“不聊”生银行\n\n民生银行的成立起源于1993年泛海集团董事长卢志强的提议，后由原全国工商联主席经叔平，牵头组建，于1996年1月在北京正式成立，注册资本金为13.80亿元。是大陆首家由民营企业入股的全国性股份制商业银行，股东均为工商联合员企业。“民生”是由当时的总理朱镕基拍板定名，当时成立的目的是为了解决民营中小企业缺乏金融支持的矛盾，引导非公有制经济发展。\n\n民生银行在创始期，是典型的民营企业特征，创始股东多达59家，对于创业之初的民生银行，市场上笑称民生银行是民不聊生银行，主要特点是：\n\n1、股东之间内斗激烈，为了争夺控制权，股东天天斗，人人斗，股东都是草根阶层，人粗话也粗，开会就是斗争，斗的不亦乐乎，经过数年的较量，在1999年至2000年的一年间，民生银行发动一场规模空前的股权大挪移，或拍卖，或协商，或抢夺，或明或暗，最终江山底定，最终形成三大诸侯势力，刘永好的新希望系，张伟宏的东方系，卢志强的泛海系。原来的59家世家大族，高门豪强，都被清洗殆尽，股权达到新的平衡结构，终于在2000年12月顺利在A股上市。最近的几场股权争夺的戏码，和当年民生银行从混乱之治到三国平衡相比，根本都不是事...\n\n2、管理班子混乱，行长常换，董事会与管理层权利不清晰，人事抵制严重。董事长没有争议，由经叔平担任，首任行长童赠银，从人行副行长位置上调任，只做了一年；第二任行长蔡鲁伦，从人行湖南分行行长位置调任，做了2年零9个月。两人均未做满三年一届的任期，离任多为股东，董事长，行长之间的矛盾。直至2000年5月，董文标升任行长、党委书记，2006年出任中国民生银行董事长。\n\n在成立之初的民生，董文标曾经总结工作的六字方针，即“民有，国营，党管”，股权是民营企业的，行长是国务院指定的，工作是在党委的管理决策下的。在十几年的经营中，股东权力逐渐平衡，经营班子逐步取得董事会信任，民生慢慢形成了自己的风格，以利润为中心，工资与利润挂钩，用利润来控制成本，属于风格激进，激风暴雨的经营方式。逐步在红海竞争中跑出。\n\n\n2006年民生银行举行董事换届选举，能够弹压各方诸侯的经叔平因病缺席。最终发生了两件大事，一是换董事长，董文标取代经叔平，另外一件则引爆了舆论，第三届副董事长刘永好落选第四届董事会成员。虽然张宏伟掌管的东方系持股比例不及刘永好掌管的新希望系，但自2000年4月30日起，他就一直担任民生银行董事会副董事长；2006年刘永好未能进入董事会，卢志强则在当年成为副董事长。三人的座次就从那时确定下来。对副董事长们的排序为：张宏伟、卢志强和刘永好。当时第一大股东（新希望）落选董事，不仅是民生银行历史上的一件大事，也是中国上市公司公司治理历史上的一个标志性事件。安邦入主前的权力格局基本由此奠定。\n\n\n在没有控股股东的董事会中，合纵连横之下任何选举结果都可能产生。\n\n\n董事会里有一群“难搞”的董事，民生银行的水自然深不可测。能够摆平诸位的，可能只有经叔平在世时钦定的接班人董文标。然而2014年董文标辞任民生银行董事长，成立中民投。这就是民生银行最大的命门，顺的时候，各位大佬扶一把民生银行，自然业绩随便刷；但如果谈不拢，大佬们斗起来，什么事情都有可能发生。\n\n\n▌二、暗潮涌动的董事会\n\n\n董事会作为吵架的第一阵地，分配利益的第一线，能不能上场，自己兄弟有多少人，座次怎么排都是兵家必争之地，先来回顾一下董事会改选前的格局，民生银行董事会公设18席，执行董事3位，非执行董事9位，独立非执行董事6位：\n\n1、执行董事（3位）：\n\n洪崎先生，自2004年1月8日起出任本公司执行董事，现为公司董事长。洪先生于本公司创立时加入本行。\n\n梁玉堂先生，自2009年3月23日起出任本公司执行董事，梁先生于本公司创立时加入本行。\n\n郑万春先生，自2016年2月1日起出任本公司执行董事，现为行长。\n\n2、非执行董事（9位）：\n\n\n1）东方系\n\n张宏伟先生，自2000年4月30日起出任本公司董事会副董事长。张先生现任东方集团（600811.SH）之董事长、联合能源集团（00467.HK）之董事局主席、东方集团投资控股有限公司董事局主席。\n\n\n2）泛海系\n\n卢志强先生，自2006年7月16日起出任本公司董事会副董事长。卢先生自本公司创立起至2003年6月止出任本公司董事，并于2006年重新出任本公司董事。卢先生现任泛海集团有限公司及中国泛海控股集团有限公司董事长兼总裁、中国泛海国际投资有限公司董事、泛海控股（000046.SZ）董事长、以及联想控股（03396.HK）之非执行董事。\n\n\n3）新希望系\n\n刘永好先生，自2009年3月23日起出任本公司董事会副董事长。于本公司创立起至2006年止亦曾出任本公司董事会副董事长。刘先生现任新希望集团有限公司及山东新希望六和集团有限公司董事长，新希望（000876.SZ）董事，以及新希望全球控股有限公司非执行董事。\n\n王航先生，自2006年7月16日起任本公司非执行董事。王先生现任新希望集团有限公司副董事长。王先生自2011年11月29日起出任新希望（000876.SZ）的非执行董事。\n\n\n4）安邦系\n\n姚大锋先生，自2014年12月23日起任本公司非执行董事，姚先生自2011年7月至今担任安邦保险集团股份有限公司董事、副总裁，及自2010年7月至今担任安邦人寿保险股份有限公司董事、董事长。\n\n\n5）复星系\n\n郭广昌先生，自2012年12月17日起任本公司非执行董事。持有民生银行11%左右的H股，郭先生现任复星国际（00656.HK）执行董事及董事长、南京南钢钢铁联合有限公司副董事长、复星医药（002196.HK，600196.SH）非执行董事以及复地（集团）股份有限公司董事。\n\n6）地方诸侯\n\n王玉贵先生，于1995年12月3日获委任，并自本公司创立起一直出任本公司非执行董事。王先生曾任中国船东互保协会总经理、中国海商法协会、中国服务贸易协会常务理事及海通证券（600837.SH）监事。\n\n王军辉先生，高级经济师，自2009年3月23日起任本公司非执行董事，王先生自2011年2月起担任国寿投资控股有限公司党委书记、总裁。\n\n吴迪先生，自2012年6月15日起任本公司非执行董事。吴先生现为福信集团有限公司总裁兼CEO，杭州联合农村商业银行董事。\n\n3、独立非执行董事（6位）：\n\n秦荣生先生（自2009年9月9日起）；王立华先生（自2009年9月9日起）；韩建旻先生（自2009年9月9日起）；郑海泉先生（自2012年6月15日起）；巴曙松先生（自2012年6月15日起）；尤兰田女士（自2012年12月17日起）。\n\n\n股东持股高度分散的情况下，董事会作为第二大权力机构就形成了实质性的控制权，对于公司的利益分配的重要机构，当前的董事会席位很有意思，史玉柱没在董事会，安邦仅有一席，新希望两席，目前的席位，反映不出实际的权力（股权）分布。\n\n银行是百业之母，即使不良压顶，经济下滑，其核心地位仍不可动摇，能调动的资源仍然极其丰富。感受一下最近的一些关联交易。\n\n2016-03-31，中国民生银行股份有限公司拟与安邦集团签署作框架协议，为安邦集团及其含附属公司提供金融产品代理销售服务，各项服务收费按照公平基准磋商及一般商业条款确定。协议项下2016年代销安邦集团金融产品服务费用不超过人民币60亿元。2015年，本公司代理销售安邦集团保险产品161亿元，取得手续费收入约3.41亿元。\n\n\n2016-01-01，中国民生银行股份有限公司拟给予福信集团（股东，董事会席位）统一授信额度20亿元（含福信集团集团成员企业在我行存量授信额度），期限一年。\n\n\n2015-12-24，中国民生银行股份有限公司拟给予复星系集团（股东，董事会席位）统一授信额度98亿元人民币（含复星系及国药系在我行存量授信额度），期限一年。\n\n\n关联交易，股东支持上市公司发展和股东捞上市公司好处都在一念之间，关键在于平衡，回到上文提到的，如果这些大佬股东们一起努力拉一把上市公司，业绩随便刷；如果斗起来，上市公司日子也好不到拿去。\n\n董事会换届，兵家必争之地，必有恶战。\n\n\n▌三、硝烟再起的民生银行\n\n再回顾一下近期几个大佬的一些动作：\n\n1、东方系\n\n?2016-06-30，东方集团股份有限公司和华夏人寿保险股份有限公司于2016年6月29日签署了一致行动协议，东方集团持股占比2.92%；华夏人寿持股占比2.56%。双方成为一致行动人后，可行使表决权合计为200，228.61万股，占本公司总股本的比例为5.48%。\n\n\n2、泛海系\n\n2016-07-11，民生银行副董事长、泛海控股董事长兼总裁卢志强通过大宗交易增持了3.92亿股民生银行，均价8.82元/股，斥资34.6亿元；卢志强还分别于7月11日、12日在二级市场先后增持共计300万股民生银行A股。另外，7月14日的大宗交易数据显示，当日民生银行还发生了一笔4.49亿股的大宗交易，均价为9元/股，交易金额为40.37亿元（买卖营业部与此前3.92的大宗交易相同），共计约75亿，持股比例至从此前的2.32%提升至5.69%。\n\n\n通过梳理泛海系的动作，不难发现：1）动作发生在东方系运作之后；2）两笔大宗接了8.41亿股，74.97亿；3）A股市场上买了300万股，约2700万。这里就不难解释，为什么泛海系不去港股买便宜30%多的民生银行H股（二级买的货不多），以及一个更深层次的问题，这8.41亿股必然是一个有分量的老股东放出来的，会是谁呢？\n\n\n3、希望系\n\n2016年5月，第二批民营银行名单陆续曝光，其中就有四川希望银行，希望银行注册资本30亿元人民币，由新希望集团、银米科技、红旗连锁三大发起人分别认购总股本30%、29.5%、15%的股份。新希望集团和红旗连锁在农村和城市超过2400家线下店资源、小米超过两亿的MIUI激活用户等都是希望银行的优势特点。\n\n\n2015年，刘永好旗下新希望集团减持民生银行股份套现约25.3亿元～29亿元。这一进一退，希望系民生银行董事会座次等等问题叠加，方向已然明显。\n\n\n4、安邦系\n\n稳坐钓鱼船，安邦集团合计持有民生银行普通股股票47.87亿股，占该行总股本的14.06%，为公司第一大股东。如果把中国中小企业投资有限公司委托给安邦集团行使表决权的3.19亿股算上，安邦拥有的有股份表决权股份数量为51.06亿股，占比15%。\n\n▌四、将来可能的走势\n\n根据《民生银行公司章程》，民生银行董事的提名由上届董事会在广泛征求股东意见的基础上，以书面提案的方式向股东大会提出。依据民生银行章程，单独或合并持有该行有表决权股份总数3%以上股份的股东，才有权提出提案。\n\n卢志强曾公开表示：“不赞同一家企业绝对控制民生银行。”根据民生银行2016年一季报，卢志强通过泛海集团持有民生银行股份占比已经不到3%，并且跌出前十名股东之列。最近的一系列运作就有以下几种可能走势：\n\n1、传统军阀再平衡\n\n新的董事会换届在即，按照之前场面上的格局，传统巨头对安邦已经是一种默许的态度，在董事会席位上安邦也插了一个人进来，接下改选肯定会拿到与安邦股权相对应的席位，那之前老巨头之间的平衡就要重构了。\n\n东方系突然出手突破了原有的股权平衡，泛海系为了避免掉队也增持跟上，确保三巨头平衡。目前泛海系（5.69%）、东方系（5.48%）、新希望系（4.18%）这传统三大诸侯之间的话语权（5%左右，现在入场券的价格已经从理论的3%，涨到了5%左右）是否持续保持平衡？史玉柱（3.15%）、复星系（2%左右）、船东互保（2.98%）等是否安于现状争入场券？都决定这场股权大战将来的规模。\n\n因为东方系、泛海系都是一级市场上的运作（一致行动人、大宗交易），暂时在二级市场上的动作不多。因为民生银行水太深，小诸侯还有很多，要通过大宗来整合还有可能，如果是这样的剧本，二级市场应该不会有大波澜。\n\n2、新旧军阀的正面冲突\n\n以前大家都是老朋友，斗归斗，但毕竟都是自己人，有什么事情都好商量，但是现在突然间有个土豪参进来，嘴上说得好好的，将来想干啥也还不知道，还是要防一防。\n\n目前安邦的股权比例在15%左右，传统三巨头在这波运作之后，合计已经默默的提到了15.35%，牌面上已经可以与安邦一战了，由于民生的股权结构足够分散，而且水面下（10大股东之外）的小诸侯相当多（想想民生的发家），排列组合可能有非常多的可能，这里的戏，可以有很多。\n\n这种新旧正面冲突的标志性事件就是，安邦增持，虽然目前万科事件引起的保险资金的争议众多，按道理险资最好是夹着尾巴做人，避免引起公众注意，但是董事会改组在即，如果这一时刻，地头蛇们团结起来冒头一致对外，限制住安邦的席位，那这几年的布局就白做了，从早前公布的民生银行销售安邦产品的关联交易来看，对于民生银行，安邦的期望有更多。\n\n万一，安邦出手了，那市场的情绪必然会被点燃。 \n\n\n▌结语：\n\n目前民生银行A股股价股价9.54元，H股股价7.99元，AH溢价-29.32%，折溢价倒数第二（第一是中信银行-33.41%）。\n\n在价值上，H股估值足够低。\n\n在战略上，如果股权真的大规模打到二级市场，H股的折价近30%，应该没有人和钱作对\n"
		},
		{
			"post_id": 486,
			"title": "激活今天市场做多人气无疑是量子通信，量子通信在上周四、周五就已经有不少个股在表现，但没被市场意识到，然后在本周连续三天的低迷，今天再次爆发！就近期的持续性来看，是市场最强的一个热点。",
			"date_published": 1469111485.05,
			"body": "Blog post body"
		},
		{
			"post_id": 485,
			"title": "现在是妖股盛行时期，投资者要善于挖掘妖股，理性炒作妖股",
			"date_published": 1469111417.122,
			"body": "Blog post body"
		},
		{
			"post_id": 484,
			"title": "大盘阶段行调整结束后，后市继续向好，本波行情依旧可以看到3250点附近",
			"date_published": 1469111349.063,
			"body": "即使补位"
		},
		{
			"post_id": 483,
			"title": "今天主力拉抬券商保险股时，跟风资金非常稀少，表明这个位置追涨动力严重不足，若不采取单日深度挖坑或进行有效的阶段性调整，大盘想立即突破3097是非常困难的",
			"date_published": 1469111260.621,
			"body": "Blog post body"
		},
		{
			"post_id": 482,
			"title": "茅台“飞天”一批价破900元 进货的渠道罕见紧张\n",
			"date_published": 1469108016.688,
			"body": "Blog post body"
		},
		{
			"post_id": 481,
			"title": "上海重灾区20多家理财平台接连出事 超800亿待还 ",
			"date_published": 1469107940.99,
			"body": "Blog post body"
		},
		{
			"post_id": 480,
			"title": "万科A(行情17.02 -0.35%,买入)7月21日晚间公告称，公司2015年度分红派息方案已获2016年6月27日召开的2015年度股东大会审议通过。2015年度A股派息方案为：以分红派息股权登记日股份数为基数，向全体A股股东每10股派现金人民币7.2元（含税）。",
			"date_published": 1469107782.81,
			"body": "Blog post body"
		},
		{
			"post_id": 479,
			"title": "由发改委城市中心和中国智慧产业联盟共同主办的2016第二届中国智慧城市国际博览会将于7月29日至31日在京开幕。参会代表将展示“5D城市”理念，即通过BIM+GIS+物联网 +云计算等国际先进的城市建设、运营、管理技术，以方向性顶层设计，确保城市战略定位的实现。",
			"date_published": 1469107016.647,
			"body": "海康威视\n\n要点1：1.2015年9月份,公司拟投资设立的创新业务子公司,公司持有60%的股权,保持控股地位,员工跟投平台跟投40%的股权。跟投平台分为A计划和B计划。其中,A计划,系由公司及全资子公司,创新业务子公司的中高层管理人员和核心骨干员工组成,强制跟投各类创新业务,确保海康威视核心员工与公司创新业务牢牢绑定,形成共创,共担的业务平台,B计划,系由创新业务子公司核心员工且是全职员工组成,参与跟投某一特定创新业务,旨在进一步激发创新业务子公司员工的创造性和拼搏精神,建立符合高新技术企业行业惯例的高风险和高回报的人才吸引,人才管理模式。\n\n要点2：2015年4月份,公司和浙江省公安厅签署合作协议。公司将发挥在数字安防领域的品牌、技术、人才、资金、服务优势,积极参与全省各级公安机关、院校及研究院的视频图像全警应用的研究,基于视频图像结构化、云存储云计算、大数据等技术,共同做好各级公安机关警务实战应用功能实现与推广。同时,公司将与浙江省公安厅网警总队联合共建“嵌入式”系统安全技术实验室,破解新技术应用中遇到的网络安全问题。\n\n要点3：2015年3月,股东大会同意公司发行不超过3.54亿股H股(占发行后总股本的8%)并在香港联交所主板上市,并授予簿记管理人不超过上述发行的H股股数15%的超额配售权;本次发行H股拟投向海康威视互联网业务投入,战略新兴产业投入,海外业务拓展,潜在收购,新建海康威视桐庐安防产业基地等6个项目。同时,股东大会同意公司第二大股东龚虹嘉将所持7.44亿股中的4.88亿股A股转为H股,其在本次发行及上市之后,将在一定时间内减持上述经A股转换而持有的H股。\n\n要点4：2014年9月份,公司调整后以9.25元/股向激励对象授予5334.51万股限制性股票。分3次按40%、30%、30%的比例解锁(分别为授予后的24个月至36个月,36个月至48个月,48个月至60个月)。业绩考核条件:净资产收益率解锁时点前一年度不低于20%,且不低于标杆公司前一年度75分位水平;营业收入增长率解锁时点前一年度较授予前一年不低于35%、20%、26%,且不低于标杆公司同期75分位增长率水平。2014年10月份,上述方案获得股东大会通过。\n\n要点5：2014年8月份,公司与乐视网信签订了合作框架协议,将在云服务,智能硬件,视频内容等方面展开深入合作。协议有效期二年,主要合作范围有:基于萤石系列的摄像机与乐视的智能电视,开发适合乐视智能电视的视频相关业务的萤石摄像机,采用“乐视”“萤石”双品牌的模式进行市场营销,发挥乐视内容与生态链的优势,将乐视网TV版,letvstore等服务集成到萤石互联网视频盒子上,将海康萤石云APP或SDK软件开发集成到乐视的盒子与超级电视等终端,乐视在全球布有约300个CDN节点,3.5T带宽,萤石云业务从技术,商务的角度与乐视云平台来开始合作的尝试,及基于双方产品及资源,协作开展智能家居,商业楼宇等项目型合作等。\n"
		},
		{
			"post_id": 478,
			"title": "万科是什么，于行业是翘楚，于股市是地产大蓝筹的旗帜，于股评是股权分散蓝筹的代表，万科事件还没有尘埃落定，但注定引爆目光，万科红了，意味的是股权分散大蓝筹的重新审视；\n    茅台是什么，于行业是引领，于股市是绩优大蓝筹，又因为身处传统行业创新求变而成为成长股的样本，茅台近期非常强势，意味的是绩优蓝筹的被追捧；\n    万科红了，茅台爆了，证实的是主流资金终于将关注的目光聚焦到成长性大蓝筹身上",
			"date_published": 1469098811.59,
			"body": "Blog post body"
		},
		{
			"post_id": 477,
			"title": "新发起的行情一定不会重复同一个板块。所以去年带过“神”字头的板块，什么神铁，神创都不可能再大玩",
			"date_published": 1469098591.856,
			"body": "Blog post body"
		},
		{
			"post_id": 476,
			"title": "底部磨的时间越长，超级主力的筹码越多，到时候涨的就越高。",
			"date_published": 1469024040.289,
			"body": "Blog post body"
		},
		{
			"post_id": 475,
			"title": "但不管什么样的群，可能都会遇到这样一个现象：一开始非常活跃，但过不了几天，最多一个月，就没有活跃度了，慢慢死掉了。大家呆在群里，每天只看到有几个人发发表情，问问好，偶尔丢一篇文章，于是便不知道这个群有什么价值，自己在群里有什么用。\n",
			"date_published": 1469023784.914,
			"body": "Blog post body"
		},
		{
			"post_id": 474,
			"title": "市场在中位绝对不能空仓应对！因为，一轮调整行情是可以随时重新启动的，没有底仓踏空一定会令人沮丧，连锁反应是盲目追高",
			"date_published": 1469023377.877,
			"body": "Blog post body"
		},
		{
			"post_id": 473,
			"title": "只要中国的投资主体仍然是地方政府和国企，只要银行照顾的重点仍然是地方政府和国企，只要IPO注册制仍然无法推出或者货不对板，那么你就可以放心大胆地投资楼市。因为经济效率将继续偏低，货币超发仍不可避免。",
			"date_published": 1469016471.261,
			"body": "Blog post body"
		},
		{
			"post_id": 472,
			"title": "银行新一轮债转股，获益的仍然是大国企以及少数有特权的民企，银行只是落得个账面好看。双创企业，只能在所谓的投贷联动试点里，获得一些利益。整体而言，资金的主渠道仍然是银行，银行照顾的仍然是国企、有特权的民企，以及地方政府。这意味，金融模式没有大的改变。",
			"date_published": 1469016360.782,
			"body": "Blog post body"
		},
		{
			"post_id": 471,
			"title": "（7月18日）下午，新华社播发了《中共中央国务院关于深化投融资体制改革的意见》。这份重要的文件在提到直接融资的时候，没有提到注册制，也没有用过多笔墨提到股市，这对于股市来说，应该是短期的利好。股市可以继续玩自己的中国式泡沫，直到注册制推出的时候。",
			"date_published": 1469016286.173,
			"body": "Blog post body"
		},
		{
			"post_id": 470,
			"title": "国家为什么突然又想让银行投资企业股权了？原因很简单，一是因为股市处于僵持阶段，融资能力发挥不出来；二是一批企业欠了银行的钱，在沉重的利息压力下，陷入恶性循环。如果把债权变成银行股权，企业获得喘息的机会，银行账面上将好看很多。说白了，就是来第二轮债转股，或者是第三轮为银行剥离不良资产。",
			"date_published": 1469016209.669,
			"body": "Blog post body"
		},
		{
			"post_id": 469,
			"title": "大幅提高直接融资比重，是中国历届政府的梦想。因为企业杠杆率不断走高，带来大量银行坏账。如果出问题，会危机金融体系。直接融资，尤其是股权融资是不用还的，风险自担，这可以激发民间投资热情，分散风险。所以国家想搞IPO注册制，但被去年自作聪明的政策牛市给毁了，注册制没有搞成，反而套进去央行上万亿，引发人民币汇率剧烈波动。为了维稳，注册制遥遥无期。在这种情况下，深沪股市事实上沦为花瓶，成为被小心呵护的危险泡沫，不敢轻举妄动。新三板交易非常清淡，基本上是个僵尸市场。",
			"date_published": 1469016084.765,
			"body": "Blog post body"
		},
		{
			"post_id": 468,
			"title": "一方面，企业债务率已经接近全球最高；另一方面，银行坏账大幅上升。在这种背景下，大量中小企业、民营企业无法获得银行贷款，只能靠高利贷应急。据《人民日报》近日披露，小微企业平均借贷成本是年利率22.04%。",
			"date_published": 1469015937.234,
			"body": "Blog post body"
		},
		{
			"post_id": 467,
			"title": "去年12月以来，占投资额六成以上的民间投资突然失速，从同比增长10%，一路下滑到2.8%，令人震惊。虽然政府投资在上升，但全社会投资增速已经被拉低",
			"date_published": 1469015936.245,
			"body": "Blog post body"
		},
		{
			"post_id": 466,
			"title": "为了应付贸易和对外投资的需求，中国的外汇储备也不可能主要以黄金的形态存在，而只能以主要贸易货币的形态存在。换句话说，只能在美元、欧元、日元、英镑、瑞郎、加元等主要币种之间选择、组合。",
			"date_published": 1469015878.563,
			"body": "Blog post body"
		},
		{
			"post_id": 465,
			"title": "目前全球央行持有的黄金一共才32702吨。而几千年来，人类黄金的总开采量也只有17.7万吨。",
			"date_published": 1469015845.529,
			"body": "Blog post body"
		},
		{
			"post_id": 464,
			"title": "6家券商披露中报业绩预报净利润同比减半",
			"date_published": 1469015062.457,
			"body": "Blog post body"
		},
		{
			"post_id": 463,
			"title": "最近一段时间要看着万科做股票，不是买万科，而是通过万科涨跌观察大盘的稳定性，观察政府态度，包括对混合经济所有制以及操作欠佳的宝能的态度。",
			"date_published": 1469012535.74,
			"body": "Blog post body"
		},
		{
			"post_id": 462,
			"title": "一些垃圾公司纷纷摇出“高送转”的橄榄枝。其实，高送转是并不高明，只是骗人的数字游戏。他们的一贯做法是，发出“高送转”的预案后，让散户推高股价，设计送转方案的大股东趁机高价大幅减持走人，留下高价买入的散户就在山上站岗。",
			"date_published": 1469012200.782,
			"body": "Blog post body"
		},
		{
			"post_id": 461,
			"title": "现代市场的主力机构已经放下辎重成了轻骑兵团，今天集结在某个板块，明天一获利就逃之夭夭，追逐主力资金流向反而会被误导。",
			"date_published": 1469012147.029,
			"body": "Blog post body"
		},
		{
			"post_id": 460,
			"title": "2933点 --- 关键补仓点位",
			"date_published": 1469011996.732,
			"body": "Blog post body"
		},
		{
			"post_id": 459,
			"title": "房地产板块的风向标就是万科和保利地产了。如果没有房地产版块联手这波“小牛市”不可能实现",
			"date_published": 1469011753.637,
			"body": "Blog post body"
		},
		{
			"post_id": 458,
			"title": "去年7月底，也是时间过半，业绩还是负数，“国家队”借助国务院“国企改革”的题材，首先在媒体上发动强大的“改革红牛”舆论攻势。同时，由金融板块与房地产板块联手，拉起一轮“改革红牛”的虚拟行情。狡猾的“国家队”，预想再次复制去年的操作模式，还是借助“多建设几个大国营企业”的题材，又再媒体上大造“小牛市”的舆论。大家看到，市场内还是由金融股首先发动。但机不逢时，国际上遇到了美联储加息、英国脱欧、南海局势、国内经济下滑、南方8省水灾、万科复牌等等，机构之间存在很大的分歧。金融股发动后，并没有得到大多数机构的响应。由于没有机构响应，前期率先拉起的券商股不过几日就夭折了。但“国家队”并不死心，再次拉动银行股。同时，继续在媒体上大造舆论想博回在券商股失败的脸面。\n",
			"date_published": 1469011669.126,
			"body": "Blog post body"
		},
		{
			"post_id": 457,
			"title": "本周将会出现一根大阴棒，会让“死多”目瞪口呆！\n",
			"date_published": 1469011578.65,
			"body": "Blog post body"
		},
		{
			"post_id": 456,
			"title": "仍处在深套的不要去割肉，当作“死猪不怕开水烫”只得认了，站在高山上看着散户轻骑兵与“国家队”厮杀就是了。\n",
			"date_published": 1469011436.997,
			"body": "Blog post body"
		},
		{
			"post_id": 455,
			"title": "众多散户投资者已经有深刻教训，一旦套死在大蓝筹股将是长期股东了",
			"date_published": 1469011380.389,
			"body": "Blog post body"
		},
		{
			"post_id": 454,
			"title": "“国家队”连续拉升银行股制造大盘继续上冲的假象",
			"date_published": 1469011314.636,
			"body": "Blog post body"
		},
		{
			"post_id": 453,
			"title": "仍在深套中的人吹裂了冲锋号，但大盘连续多天停滞不前",
			"date_published": 1469011281.674,
			"body": "Blog post body"
		},
		{
			"post_id": 452,
			"title": "大盘仍在阶段高位震荡，中短期均处在阶段顶部。后市爬得越高会摔得越惨",
			"date_published": 1469011229.928,
			"body": "Blog post body"
		},
		{
			"post_id": 451,
			"title": "目前A股市场是靠强力维持稳定的市场，震荡总体不大，成交量不大，看上去风险也不大。7月13日，上证收报3060.69点，比2月19日上涨200点，涨幅7%。刘士余先生上任后四个月（3月到6月）成交量50万亿，仅为去年同期的40%",
			"date_published": 1469011158.216,
			"body": "Blog post body"
		},
		{
			"post_id": 450,
			"title": "建议，为股票发行人和董事高管减持套现设定两个基本约束条件：一是连续十年平均年股息率不低于无风险收益率；二是连续十年平均现金分红总额不低于股市直接融资额。",
			"date_published": 1469011044.993,
			"body": "Blog post body"
		},
		{
			"post_id": 449,
			"title": "傻逼股票案例",
			"date_published": 1469009240.39,
			"body": "600386北巴传媒，引起我注意的时间是2013年9月24日这一根涨停板大阳线，当天晚上，我将这档股票纳入自选股，在我23年来总结的第一个经验就是股票能够拉上涨停板，必须原由，原因来自哪，开始了我对这档股票的挖掘。随后几天初步地尝试地买入了。之后一段时间，半死不活，同时看好的其他个股都已活蹦起跳。他依然我行我素。在盘中虽然鲜有主力踪迹。但明显表现一般。直至2014年5月8日又是一根大阳量大阳线，并且近一个月持续放量行情，最终发现了这是一档主力明显深陷其中的个股。\n\n \n\n     逐步定下了跟踪潜力对象后，所有的铁杆常粉都知道，接下来必须对该股基本面的深挖。600386北京巴士，身处北京国有企业改革受益股，身处巴士公交车上的媒体广告收益潜力，以及4.03亿股的小盘适中股，在底位堆积如此巨量的股票，潜力无限。\n\n \n\n     从最初的少量介入到追高加仓后，最终的成本已经超过11元，之后从小阳小阴走势十分缓步地落后于上证指数表现。看着筛选的其他潜力股远远超过大盘表现，在2015年元 月13日忍痛割爱。\n\n  \n\n     今天回过头来看再荐这档潜力股，再一次的经历了对其基本面的深挖，其中现在回过头来想一想，好股票始终会发光发亮，11元的成本经历了三次股灾后，现价依然站在18元上方，我们小散户投资，虽然持仓三年至今也有近80%的收益，个人认为，这样的投资收益足够大，而手握大资金的超级牛散们，相信他们也是这样认为，有哪些深厚的收益足矣。\n\n \n\n      今天再荐600386北巴传媒依然是当初的研判：\n\n 1底位堆积成交量，就是超级主力入场的踪迹表现；\n\n 2经历了三次股灾，拒绝新低股价挺立在上，代表着早期主力依然在家；\n\n 3股票名称从北京巴士改名为北巴传媒，说明公司已开始新的征途；\n\n 4国有企业改革已加速推行，作为北京前沿部队的北巴传媒理就纳入改革列队;\n\n 5公司合资设立隆瑞三优能源汽车服务公司，开始挺入新能源产车链并已开始起得成绩；\n\n6近一年里，公司频频进入股权投资加大新能源产业链投入，显示公司逐步进入转型阶段。\n\n7二级市场中，该股又开始进入脱离指数后的独立孤寂行情，从该股的历史走势来看，经历反复洗筹之后，将进入真正的主升浪行情。\n\n"
		},
		{
			"post_id": 448,
			"title": "都有什么样的猫腻",
			"date_published": 1468942413.203,
			"body": "中国证监会近日通报了对国开证券经纪人朱炜明行政处罚案，朱炜明作为证券从业人员买卖股票、先行建仓买入后公开荐股的两项行为均违反证券法规定，决定责令朱炜明依法处理非法持有的股票，没收朱炜明违法所得约452万元，并处以约1358万元罚款，同时对其采取终身证券市场禁入措施。\n\n　　朱炜明曾于2010年8月20日至2014年8月26日期间，担任国开证券上海龙华西路营业部经纪人，持有证券经纪人证书，从事股票经纪业务。其父朱某荣、其母孙某英和祖母张某英都于该营业部开立上海股东账户和深圳股东账户，经证监会查证发现，朱炜明实际控制朱氏账户组，并在作为证券从业人员期间，控制朱氏账户组买卖“海螺型材(000619,股吧)”、“神剑股份(002361,股吧)”、“襄阳轴承(000678,股吧)”等共计132只股票，盈利452.67万元。\n\n　　详细来看，2013年3月1日至2014年8月25日期间，朱炜明在上海电视台第一财经频道“谈股论金”栏目中通过明示股票名称或描述股票特征的方法，公开评价、推介“利源精制(002501,股吧)”、“万马股份(002276,股吧)”、“博晖创新(300318,股吧)”等10只股票，并在公开荐股前先行建仓买入，公开荐股后的3个交易日内卖出，获利43.93万元。\n\n　　处罚决定书指出，以上事实有朱氏账户组相关资料、资金转账记录、相关交易数据、上海电视台财经频道提供的相关资料、当事人询问笔录等证据证明，足以认定。\n\n　　有意思的是，该处罚决定书还“展示”了朱炜明及其代理人的申辩内容。针对这些申辩理由，证监会逐一反驳，并最终认为，朱炜明违法事实清楚，证据充分，行为特别恶劣，严重扰乱了证券市场秩序并造成严重社会影响，当事人及其代理人的申辩意见不能成立。\n\n　　根据当事人违法行为的事实、性质、情节与社会危害程度，依据《证券法》第一百九十九条、第二百零三条的规定，证监会决定：一、责令朱炜明依法处理非法持有的股票，没收违法买卖股票的违法所得408万元，并处以1226万元罚款；二、没收朱炜明操纵证券市场行为的违法所得43.9万元，并处以131.7万元罚款。以上合计，没收朱炜明违法所得452.6万元，罚款约1358万元。\n\n"
		},
		{
			"post_id": 447,
			"title": "债务危局：辽宁81家新三板企业过半负增长",
			"date_published": 1468941779.695,
			"body": "　辽宁省债务率三年翻番，今年一季度更成为全国唯一GDP负增长的省份。东北特钢40亿债券违约，持有人大会昨晚做出决议“提请证监会、银监会、发改委暂停辽宁省政府及企业融资并倡议所有金融机构全面停止购买辽宁省政府及辽宁地区债券”，这是要“拉黑”辽宁省的节奏？\n\n　　曾是共和国长子的东北重工业基地，现在处境有多么不堪？\n\n\n\n　　再多闪耀的词汇也救不了东北特钢\n\n　　2003年，时任辽宁省省长的薄熙来牵头引进俄罗斯舰艇特种钢制造技术，然后合并大连钢铁、抚顺特钢(600399,股吧)（始建于1937年日据时期）和北满特钢，成立了东北特钢集团，辽宁省国资委在其中持股46%，是第一大股东。\n\n　　东北特钢不仅生产航母用特种钢，还供应了2009年大阅兵时装甲方队80%的钢材。旗下控股了A股上市公司抚顺特钢（600399，目前市值近百亿），截至今年5月集团总资产527.76亿元，全部债务总额388.31亿元，资产负债率达到84.35%。\n\n　　从今年3月份开始，东北特钢总额接近40亿的债券接连违约。在第一笔利率6.5%，总额8亿的一年期短融债到期不能兑付时，一些机构投资者仍然认为，作为国企、中国500强企业，并由国开行承销的东北特钢只是会延期，并不会真正违约。\n\n　　然而东北特钢董事长杨华，却仿佛早就预见了事件的走向，今年3月24日在家中上吊自杀。\n\n　　政府想要债转股\n\n　　银行表示这锅坚决不能背\n\n　　上周辽宁省国资委终于打破沉默，召集各家债权银行开会，单方面宣布其债权处置方案。方案要求，70%的银行贷款债转股，并由主承销银行（国开行）先行兑付已违约债券。然而该方案却没有给债权银行和主承销行提供任何增信措施。\n\n　　但东北特钢曾于5月份向持有人会议承诺不会债转股、不会恶意逃废债；而且目前国家层面债转股政策也尚未出台。这个方案出台前也没有和债权人协商，各家银行因此都非常愤怒。\n\n　　于是债权人昨晚就搞了一个震动市场的大新闻，开会做出决议要求银行间市场交易商协会公开谴责东北特钢，并“拉黑”整个辽宁省的政府与企业债。\n\n东北债务危局：辽宁81家新三板企业过半负增长 \n　　辽宁政府负债率危若累卵\n\n　　甚至想让毕业生零首付买房\n\n　　整个辽宁省，现在已经陷入经济负增长和债务危机的泥潭，全省债务率达到157.72%，相比2012年翻番。尽管2015年债务余额小幅下降，但由于房地产市场不景气，辽宁财政收入和政府性基金收入双双腰斩\n\n　　据21世纪经济报道记者了解，2015年末，辽宁省的债务率仅次于贵州（190%），其中大连市债务规模最高，近两千亿，而锦州、铁岭、辽阳、抚顺等地级市债务率均超过100%，最高者抚顺已经超过200%。\n\n　　据，东北特钢现已完全丧失债市和银行贷款的融资信用，银行已经全部停贷，并且负面影响已经波及辽宁省地方专项债以及当地企业发债。\n\n　　今年5月、7月辽宁省政府发行的专项债券，中标利率均高于其他地方专项债券30-40个BP；而辽宁产业债已经发不出来了。\n\n　　今年3月，沈阳市还突发奇想，对毕业未超过5年的高校、中等职业学校毕业生在沈购买商品房的，实行‘零首付’政策，公积金连续缴存时限仅需3个月，最高贷款额度为单方60万元、双方80万元，并给予每平方米200元的奖励政策和契税全额补贴政策。然而这项脑洞大开的政策在披露一天半后，就在舆论的嘲讽声中被收回去“调研论证”了。\n\n辽宁省81家新三板企业过半负增长 \n\n辽宁省81家新三板企业过半负增长\n\n\n　　1/3企业辛苦一年不如存银行\n\n　　在新三板挂牌的81家辽宁省企业，其中创新层仅有9家。这81家挂牌企业中有41家营业利润同比出现负增长，19家出现亏损。另外，有27家企业2015年年化净资产收益率低于1年期定存利率（2015年3月数据为2.75%），占比三分之一，辛苦一年还不如存银行，场面十分凄惨。\n\n　　而在9家辽宁创新层企业中，紫竹桩基(830894)是做钢板桩施工，金柏股份(830947)主要在沈阳市承接园林绿化工程，鑫博技术(832989)主要做钢铁行业的铁矿选矿成套设备，这三家的经营状况预计都会受到目前该省经济状况的较大负面影响。尤其是金柏股份，不仅营收难以增长，其营收账款中有不少沈阳市国企、事业单位欠款，这些并不属于地方财政负有担保责任的政府债务，未来回款前景堪忧。\n\n"
		},
		{
			"post_id": 446,
			"title": "好多人担心土地买卖导致兼并继而产生流民，社会因此而不稳定，他们忽视了当今世界小农经济根本就没有竞争力，农民不是靠小块土地生存的；他们忽视了不让农民成为流民的唯一途径是让他们成为有保障的市民，而不是把他们捆绑在小块的土地上；他们忽视了基于土地确权基础上的流转集中，只会有利于将农民变成有保障的市民，只会有利于经济繁荣和社会稳定。",
			"date_published": 1468925598.572,
			"body": "Blog post body"
		},
		{
			"post_id": 445,
			"title": "国企改革唯一正确的道路是私有化。做大做强做优国有企业的唯一出路是行政垄断，这实质上是以吸民营企业的血为代价。当广大民营企业活不下去了的时候，该怎么办呢？",
			"date_published": 1468925463.235,
			"body": "Blog post body"
		},
		{
			"post_id": 444,
			"title": "当企业大规模死掉或者转移出去，中国经济就没有回天之力了，因为我们的企业大规模死掉或者转移出去，便意味着他国会形成集群优势",
			"date_published": 1468925410.871,
			"body": "Blog post body"
		},
		{
			"post_id": 443,
			"title": "收入有两个来源，一个是劳动，另一个是资产。一个人一天最多工作24小时，因此劳动收入是有限度的。要有效增加老百姓收入，就必须让他们获得资产收入，这就要求把土地等重要生产要素界定给老百姓",
			"date_published": 1468925358.288,
			"body": "Blog post body"
		},
		{
			"post_id": 442,
			"title": "国有企业投资快速增长的后果，一定是未来坏账进一步上升。还没消化2009年以来的坏账，新的坏账很快又要来了",
			"date_published": 1468925201.299,
			"body": "Blog post body"
		},
		{
			"post_id": 441,
			"title": "一笔资金，甲花出去，变成乙的收入和存款，经过金融中介，又变成丙的借款，不断循环，债权债务链无限延伸，M2跟着膨胀起来。这种债权债务链的拉长是高杠杆化的一个方面，而M2巨幅膨胀正是高杠杆化的外在表现。泡沫化中，赚钱那么容易，银行不会让其钱做存款被提取准备金，做贷款接受利率管制，理财产品于是应运而生。理财产品让银行可以将储户的钱全部用于生利，并且不接受利率管制。本来一个正常的经济不会将所有的钱都拿出去放贷生息，要留一部分做准备金、做保险的，但是中国社会急不可耐，将每一块钱都拿出去借贷生息。这当然是高杠杆。中国的理财产品从无到有，短短几年达到13万亿",
			"date_published": 1468924871.21,
			"body": "Blog post body"
		},
		{
			"post_id": 440,
			"title": "在今年58家评级下降的券商中，公司从去年的A级直降6级至C级，而C级也是95家参与评级的证券公司中目前最低的一个级别。",
			"date_published": 1468855948.768,
			"body": "　经历了2015年的动荡，2016年对于方正证券(7.540, -0.23, -2.96%)（601901.SH）来说无疑是分外重要的一年。在上半年平安过渡之后，这家公司迎来了一个意外的坏消息——在今年58家评级下降的券商中，公司从去年的A级直降6级至C级，而C级也是95家参与评级的证券公司中目前最低的一个级别。\n\n　　究其被扣分原因，一是去年因为配资外部信息系统违规接入被罚， 而另一重要原因或与其收购民族证券有关。\n\n　　直降6级带给方正的影响几何？《第一财经日报》记者采访发现，业内虽然评价不一，但较为统一的共识是，除了投资者保护基金缴纳会直接变多，在评级未提高前这家公司将无法开设新网点，这对经纪业务强势的方正证券而言影响多大有待时间验证，类似的影响也将体现在新业务的申请扩张。此外，方正证券的信用评级变化还将对短期融资形成一定障碍。\n\n　　对于可能带来的负面影响，方正证券给出的回复则是，公司目前各项风险控制指标均符合监管要求，并已就后续可能的影响做了相应安排，以求尽量降低和减少评级结果对公司的影响。\n\n　　两大主因致降级\n\n　　对于突如其来的连降6级，有方正证券内部人士表示，这一结果确实是让人深感意外。而对于降级的直接可见的原因则是，在去年的牛市中方正证券为场外配资违规提供外部信息系统接口。\n\n　　方正证券方面也告诉《第一财经日报》记者，去年9月10日，证监会向包括方正证券在内的四家券商发出《行政处罚事先告知书》，拟对四家公司及相关员工因涉嫌未按规定审查、了解客户身份等违法违规行为进行行政处罚。\n\n　　“尽管该案尚未有结论，但证监会按照规定对我公司信息系统外部接入所涉事项进行分类监管评价扣分，核减了我公司经纪业务市场影响力指标等加分项，从而导致我公司本次分类评级结果从连续5年的A级下调到今年C级。”方正证券相关负责人如是称。\n\n　　不过，这一扣分项在外界看来并不足以将方正拉至C级别。\n\n　　“除了配资被罚，和民族证券也有关系，去年民族证券的评级是3C，并入后打分也算在了方正头上。”上海一非银分析师对《第一财经日报》记者分析称，证券公司分类评级是证券监管部门以证券公司风险管理能力为基础，结合公司市场竞争力和合规管理状况打分之后，得出的综合性评价，而民族证券因20亿款项问题尚在被立案调查，在去年与方正的内斗纠纷中也暴露出一定问题，势必拖累方正分数。\n\n　　实际上，自方正证券收购民族证券后，由于前者与政泉控股在改选董事会以及整合方案等方面存有较大争议，双方缠斗不止，互相“揭短”，直接导致财务无法合并，相关业务也各自独立经营。去年5月，方正证券自爆民族证券20.5亿元款项涉嫌违规投资，并向监管机构申请介入核查。随后民族证券被北京证监局要求改正相关问题，并提交书面整改报告。而20.5亿元款项问题也在去年9月被证监会正式立案调查。\n\n　　而截至目前，民族证券20.5亿元款项仅追回4.11亿元，剩余17.415亿元本金尚未收回。对于被立案调查的进展，方正证券表示，目前公司公司尚未收到相关调查结果。\n\n　　“评级主要体现的就是证券公司合规管理和风险控制的整体状况。”有券商分析人士对《第一财经日报》记者表示，作为方正证券的子公司，民族证券的系列问题正是暴露了公司过去在这两方面存在缺陷，或成为被扣分项目。\n\n　　影响几何？\n\n　　从A到C，连降6级的结果已出，对方正证券未来的影响成为市场“围观”的重点。\n\n　　由于目前，券商缴纳的投资者保护基金比例与评级直接挂钩。对于方正而言，从A调降至C意味着缴纳比例从收入的1%增加至3%。2015年方正证券营业收入109亿，依此计算缴纳金额可达3.27亿元，由于当年归属上市公司股东净利润40.64亿，缴纳保护基金影响利润比重可达8%。\n\n　　此外，上述非银分析师告诉《第一财经日报》记者，按照《证券公司分类监管规定》规定，评级为C的公司司风险管理能力只与当前现有业务匹配，暂时不具有开展新业务或者业务扩张的能力，这意味着未来方正证券开设新网点、申请新业务将受阻。\n\n　　而以方正证券2015年年报的数据来看，其经纪及信用交易业务实现营业收入 93.75 亿元，占总收入比例近86%。\n\n　　“2015 年公司网点规模大幅增长，报告期内公司新设网点 91 家，网点数量达到 244 家，覆盖全国 22 个省级区域。”方正证券在年报中如是披露。而伴随评级的变化，或一定程度意味着方正证券在评级未提高前，想要继续这样的网点扩张速度成为不可能。\n\n　　对此，方正证券表示，公司欲通过加强互联网金融平台建设，提高对现有营业部实现网点综合化、收入多元化等措施，提高营业部单产，最大限度降低对不能新设网点的影响。\n\n\n\n\n\n　　除了新网点新业务扩张受阻，方正证券在短期内融资或也将更为困难。一券商固守人士告诉《第一财经日报》记者，评级大幅降低，无论是贷款还是发债都会受到影响。贷款方面，降级会影响银行对券商的授信额度，特别是短期授信；发债方面，短期融资债券可能会发不出去。\n\n　　这于这一影响，方正证券则回复，公司会进一步拓展融资渠道，解决各项业务用资需求。\n\n　　“未来公司将进一步加大与各个金融机构的合作，通过两融收益权转让、同业拆借、债券回购、资产出表、资产证券化等多种可行的融资方式，解决公司未来五年发展的用资需求。”方正证券方面称，在买方业务（资产配置）方面，公司会力求以资产端的较高收益弥补负债端的成本提高。\n\n　　除了上述影响，方正证券也坦承，从A到C，对公司开展机构业务或也产生一定影响，主要则是在心理层面和个别机构的准入方面。而公司采取的应对则是，提高服务水平，培育更多的核心战略客户。\n"
		},
		{
			"post_id": 439,
			"title": "方正证券对2009年-2014年三季度的历史数据研究也显示，以大股东解禁前一年为起始时间，随着解禁时间的临近，个股的累计超额收益的均值、中位数以及胜率均稳步上升，大约在解禁满1年时三个指标达到极大值。在解禁前1年至解禁后1年这两年时间中，全体解禁个股的平均超额收益率达30%，期间约60%的股票战胜中证500指数。",
			"date_published": 1468854482.614,
			"body": "Blog post body"
		},
		{
			"post_id": 438,
			"title": "真正的解禁高峰将出现11月份和12月份，解禁股数分别达到133.01亿股和330.27亿股，解禁市值分别达到2391.26亿元和4272.02亿元，远超7月份的解禁规模。",
			"date_published": 1468854003.928,
			"body": "http://finance.sina.com.cn/stock/s/2016-07-18/doc-ifxuapvw2274058.shtml"
		},
		{
			"post_id": 437,
			"title": "年内还有11只个股解禁市值过百亿 ---\n\n市场对于解禁股的担忧不仅在于市场整体，更在于高市值、大比例解禁的个股，中国铁建之所以引人注目，在于解禁股成本低廉、且市值规模超百亿元。据券商中国记者统计，除了中国铁建，今年解禁百亿市值的个股还有11只。\n",
			"date_published": 1468853754.214,
			"body": "Blog post body"
		},
		{
			"post_id": 436,
			"title": "2015年，中国铁建进行了12.42亿股增发，增发价格为每股8元，解禁前一交易日收盘价为10.29元，浮盈28.625%。如此大幅度的浮盈，显然吸引了定增获利盘的出逃。",
			"date_published": 1468853461.676,
			"body": "Blog post body"
		},
		{
			"post_id": 435,
			"title": "无论如何，大盘就是不急，任何一次调整，都要用足时间，这就是上涨初期的表现，说明大家都还在犹豫，这个时间仍是大资金降低成本，有远见的预先建仓的位置",
			"date_published": 1468844140.366,
			"body": "Blog post body"
		},
		{
			"post_id": 434,
			"title": "未来行情要想攻击阻力位，没有蓝筹板块的发力是难以想象的；‘军工’是历年必炒的方向，市场无军工不活，而军工股一旦出现‘列装’或者‘重组’等动作前后比较容易出现大动作，激进的投资者逢低配置军工是可以的；‘医药’板块，特别是二线中药、OTC药物，我们调研的结果是很多医药制造的上市公司订单都出现了明显的增长，不难推断年底业绩出现明显的变化，作为长线白马的品种回调布局是稳健投资者的首选。另外，改革主线、北斗导航也都是合适的养股标的。",
			"date_published": 1468840662.356,
			"body": "Blog post body"
		},
		{
			"post_id": 433,
			"title": "首个宫颈癌疫苗获准中国上市",
			"date_published": 1468838764.738,
			"body": "Blog post body"
		},
		{
			"post_id": 432,
			"title": "New blog post",
			"date_published": 1468838133.505,
			"body": "Pokemon Go联合开发商Niantic表示，公司要“尽快”在大约200个国家和地区推出这款热门游戏。至于中国市场，开发商表示在技术上推出是有可能的，但必须考虑监管。他拒绝进一步评论未来在中国推出游戏的前景。利好融资标的：歌尔声学[-1.91% 资金 研报]、水晶光电[-2.87% 资金 研报]、奥飞动漫[0.12% 资金 研报]、棕榈园林[4.40% 资金 研报]、金刚玻璃[0.23% 资金 研报]、乐视网[-4.61% 资金 研报]、光线传媒[0.17% 资金 研报]。"
		},
		{
			"post_id": 431,
			"title": "中铁二局 - 分红太少，10块钱考虑",
			"date_published": 1468837993.074,
			"body": "Blog post body"
		},
		{
			"post_id": 430,
			"title": "\n\n中国标准动车组完成420公里会车试验\n",
			"date_published": 1468837912.189,
			"body": "中国标准动车组完成420公里会车试验，这是世界上首次在实际运行轨道上进行的高速列车会车试验。利好融资标的：中鼎股份[0.04% 资金 研报]、时代新材[-2.96% 资金 研报]、晋西车轴[-2.39% 资金 研报]、中铁二局[-2.32% 资金 研报]、晋亿实业[-1.48% 资金 研报]、中国铁建[-9.72% 资金 研报]、中国中铁[-1.41% 资金 研报]、中国中车。"
		},
		{
			"post_id": 429,
			"title": "中国首艘海洋核动力平台",
			"date_published": 1468837551.089,
			"body": "中国首艘海洋核动力平台即将在中船重工集团旗下渤船重工进行总装建造，而中船重工未来将批量建造近20座海洋核动力平台。此外，近期世界上第一座海上浮动核电站——俄罗斯“罗蒙诺索夫院士”号日前进入下海测试阶段，将于2017年10月30日完成测试后正式投入使用。\n\n分析认为，海洋核动力平台属国内首创，平台技术可填补中国在民用核动力船舶领域的技术空白，形成具有自主知识产权的核心技术，对中国开发利用新能源和全球能源的发展具有深远影响。海洋核动力平台实现批量建设后，机构预计每座海洋核动力平台的投资约为20亿元，20座海洋核动力平台总造价大约为400亿元。海洋核动力平台被赋予军工属性，合理供求关系推动海上核动力平台健康发展，数百亿市场空间利好核电制造类上市公司。\n\n机构建议关注台海核电、应流股份、群兴玩具 ---- 什么他么鸡巴了垃圾股，机构傻逼\n"
		},
		{
			"post_id": 428,
			"title": "民生银行筹码遭哄抢：又是一场股权战 增持还将上演",
			"date_published": 1468837254.794,
			"body": "Blog post body"
		},
		{
			"post_id": 427,
			"title": "互联网金融",
			"date_published": 1468791386.167,
			"body": "理财需求空前旺盛——2015年，除了P2P理财规模疯狂增近400%以外，基金下属的资管子公司理财规模扩张最快，同比增长率高达130%，其次是私募基金，同比增幅也超过100%。\n\n但是与之前不同的是，随着移动互联网时代的到来，互联网理财正在快步进入移动端时代。不管是每年“双11”大战中的移动端下单占比的迅猛提升，还是股票基金交易等，都开始迅速从传统网络转移到手机客户端。\n\n所以移动互联网已在娱乐、信息获取、交易三个方面超越了PC互联网。相对传统理财方式，移动理财具备透明度更强、参与度更高、协作性更好、中间成本更低、操作上更便捷等优势。\n\n除此之外，市场人士认为，目前智能手机用户多为中青年，与其他年龄层次人群相比，其理财意识更强，理财需求也更旺盛。从这个角度而言，掌上移动理财或许用不了多久就会成为多数人习以为常的理财方式。因此移动理财板块有望从互联网金融的大板块中脱颖而出。\n\n3股瓜分万亿市场\n\n进入2016年以来，在互联网金融整体被监管的大背景下，依旧有很多公司相继布局手机APP应用和微信、微博等移动社交平台。沿着互联网金融相关公司布局的路线看，其中3股将有望成为龙头。\n\n金证股份(600446)：公司前期发布公告称，拟以现金方式收购联龙博通 100%的股权。联龙博通作为向商业银行提供全流程的移动金融业务解决方案的公司，拥有“手机银行”、“移动商务”、“移动支付”三大服务产品平台。\n\n奥马电器(002668)：全资子公司钱包金服与宜宾市商业银行签订全面开展互联网银行业务战略合作协议。主推“钱包生活APP”，主打“消费优惠、理财增值”等用户喜好点，深挖“消费信贷+ 商家信贷”万亿级长尾市场。\n\n天成控股(600112)：:天成控股拟定增募资用于基于移动互联的小微金融服务平台建设项目。公司表示将通过投放移动支付终端和“绑定银行、社保、交通”的居民一卡通，来搭建未来的小微金融服务平台。\n"
		},
		{
			"post_id": 426,
			"title": "美批准开放5G频谱：大唐电信（600198）、烽火通信（600498）、中兴通讯（000063）等",
			"date_published": 1468767129.85,
			"body": "Blog post body"
		},
		{
			"post_id": 425,
			"title": "二胎实质影响逐步显现　生育相关产业：戴维医疗（300314）贝因美（002570）、伊利股份（600887）等",
			"date_published": 1468767082.455,
			"body": "Blog post body"
		},
		{
			"post_id": 424,
			"title": "New blog post",
			"date_published": 1468765839.081,
			"body": "量子通信受追捧；\n\n点评：银监会就《中国银行业信息科技“十三五”发展规划监管指导意见(征求意见稿)》公开征求意见。意见指出：推进互联网、大数据、云计算新技术应用，构建绿色高效数据中心，加强信息安全管理。到“十三五”末期，面向互联网场景的主要信息系统尽可能迁移至云计算架构平台。量子保密通信等前沿技术的积极引用将提升网络安全防护能力。掌握信息技术的选择权，鼓励加大在核心系统和关键技术方面研发创新投入，积极研究开源软件在银行重要信息系统的应用。\n\n关注：浙江东方，神州信息，中信国安。\n"
		},
		{
			"post_id": 423,
			"title": "New blog post",
			"date_published": 1468765348.006,
			"body": "仲裁事件，南海军备建设有望加强；\n\n点评：短期内南海局势仍将紧张，美国为潜在的中国军备竞争对手。由于美国不太可能撤回布置在南海的军事力量，中国预计将在南海部署更多水面舰艇、潜艇等，加速我国舰船采购、研制；若周边各国有进一步行动，不排除中国在南海建立防空识别区，布置预警机、防空雷达等；此外，南海机场建设可能进一步加快，各类型飞机如反潜机、预警机、加油机等部署有望增加。\n\n关注：中国重工，中船防务，四创电子????，国睿科技，中航动力。\n"
		},
		{
			"post_id": 422,
			"title": "市场多方主力只有强力启动券商，从而带动蓝筹股的活跃，才能实现对前期高点3097点和10月均线的有效突破。否则，上证综指短期只能选择休整",
			"date_published": 1468765235.72,
			"body": "Blog post body"
		},
		{
			"post_id": 421,
			"title": "  股市九段",
			"date_published": 1468763864.144,
			"body": "股市一段水平，投资者知道了一些技术指标，MACD、KDJ、RSI之类的，总觉得它们有时准，有时又不准。你也关心基本面情况，今天世界上发生了什么大的事件？对于股市有什么影响？你总是第一时间上网查看。典型特征是，拿着股票总感觉不踏实，所以交易比较频繁，时赚时亏，但总的来说，帐户是亏损的。一段的特点是，对什么都是一知半解。\n \n     股市二段水平：投资者在市场上已经交易了一段时间了，但总的来说帐户是亏损的。你觉得要在这个市场赚钱真的很难，你急着想在股市翻本，可你不知道该怎么办。你看了很多，一些关于股票交易的书，可你觉得他们说的是一回事，拿到这个市场中实际操作又蛮不是那么回事。你觉得还是指标不够精确，于是你试着调整参数，可它们仍然是有时准有时不准。你上论坛，希望得到高手的指导。可他们也是说得，有时准有时不准。二段的特征是，开始怀疑股市投资是否有规律可寻。\n \n     股市三段水平：投资者已经有过股市大亏或者爆跌的经历。懂得开始敬畏市场。你知道要在这个市场上生存不能听信那些个评论。于是你开始系统地学习，你把能找到的相关书籍都看了，希望能从中找到一个战胜市场的法宝。你也学习了波浪理论、江恩的测市法则、价值投资之类的。你也知道了短线操作，要顺势而为、亏损了要止损。可你搞不清这个“势”是怎么确定的，止损设在什么地方才好。你觉得要准确地知道市场何时反转真的太难了，你不相信在这个市场有人可以赚到钱，因为有了很多经验的你都觉得面对市场束手无策，他们怎么可能赚到钱？三段的特点是，敬畏市场，懂得股市投资真的需要学习，明白学习很贵，不学习更贵。但是具体的学哪些东西，应该向谁学习，又似乎不明白。\n \n     股市四段水平：投资者开始明白，要在这个市场上赚钱，除了学习方法，还需要有有一套自己的交易系统。可这个交易系统具体都包括哪些东西，你还搞不太明白。你试着将几个老师的方法，几个技术指标组合成你的交易系统，根据它们提供的信号买卖。可技术指标之间，经常相互冲突，让你搞不明白此时到底该相信技术指标还是价值投资。你试着长线，尝试价值投资，可有时你搞不清到底股指是短期回调还是要反转了。你也试着就做日内短线，经常今天赚了几千，明天却亏了一万。你的帐单仍然是亏损的，你觉得做股市投资真是太难了，实在不行的话，你考虑是不是该放弃了。四段的特点是，懂得要建立自己的投资交易体系，但是具体的交易体系，包括哪些内容，开始反复测试，拿不准。\n   \n    股市五段水平：投资者开始明白，在股票市场上你没法预测价格走势。不仅你不行，其实别人也不行。你开始逐步的建立一套自己的交易系统，你知道只要自己严守纪律，长远的来看，你该能够赚到钱。选错了股你会止损，盈利的股票你也开始能拿得住了。你的交易会时赚时亏，盈亏基本相当或者略有盈利。有时你能按自己的系统交易，有时你不能。但你开始相信这个市场上肯定是有人可以赚到大钱。五段水平的人，开始能够偶尔选出好股，在一些博客论坛上你也开始成为大众关注的焦点。\n    \n   股市六-七段水平：知行合一，投资人开始能够稳定盈利，不管即使技术还是价值投资，都开始有自己的一整套值得信赖的投资系统。你已经解决了投资理念的种种问题，开始有了自己的投资哲学。对于技术性的东西你不会太关心，你知道只要投资理念正确，即使是不看移动平均线你也可以稳定获利。你知道股市在什么时候，你可以从容地进场，虽然你看不清以后的走势到底如何。但是你能凭借本能知道，后面一定有机会。六段水平的投资人，投资心态基本平静，但偶尔面对行情的剧烈波动还是会有些起伏，特别是重仓的时候。  \n \n   股市八段水平：投资人，已经觉得股市里面赚钱实在是太容易了。选出能赚钱的股票，对你来说是家常便饭。就像一名驾驶老手开车一样，遇到红灯就停、绿灯就行。选股对你来说完全是无意识的。你不再需要对着图表精确地定义止损的位置，也不需要拿着笔或计算器去精确计算股票的估值。大部分达到八段水平的投资人，开始做私募基金，或者公募基金的资产管理，因为你已经意识到，没有比股市再赚钱的行业。\n \n    股市九段水平：赚钱已经不是第一要务。投资人要么开始大隐隐于市，过上财富自由的生活。这时候你已经在股市投资行业，神一样的模糊存在。已经做到，手中有股，心中无股，所以很少有看盘的时候，多数时间你在打高尔夫或是在太平洋的某个小岛钓鱼。你从不和别人说起交易的事，因为你知道没人能明白。当然，最后，也可能有极少数大师，愿意像巴菲特和格雷厄姆一样，回报社会，开坛普渡众生。 \n"
		},
		{
			"post_id": 420,
			"title": "有20%的股票超过5178点，创历史新高。如果说上半年没有机会，也许是你选股水平不够，也许是你的股票还没有开始涨。",
			"date_published": 1468763610.475,
			"body": "Blog post body"
		},
		{
			"post_id": 419,
			"title": "券商出身的私募基金经理，更倾向于通过波段，追求绝对收益，倾向于到3300就清仓。准备跌破3000点再买。",
			"date_published": 1468763548.072,
			"body": "Blog post body"
		},
		{
			"post_id": 418,
			"title": "本周爆炒",
			"date_published": 1468760083.063,
			"body": "GQY视讯，国际上任天堂近日暴涨75%引爆市场对AR概念、手游概念股追捧，公司被冠上AR概念龙头被爆炒，本周连续4涨停（周五停牌自查），周涨46.38%夺魁。\n\n恒信移动，AR概念的龙二，本周2涨停（周五停牌自查），周涨32.79%位居第二。\n\n天润数娱，AR概念+半年报拟10转30的高送转方案引爆股价，周涨29.96%位居第三。\n\n山大华特，医药股是本周上涨的主流之一，外加公司中期业绩同比增长50-80% ,超市场预期的催化，本周1涨停，周涨25.44%位居第四。\n\n中房地产，本周地产股多次异动也是本周上涨的主流之一，公司作为代表小盘地产股炒作更轻松，本周1涨停，周涨23.70%位居第五。\n\n福晶科技，量子通信概念被挖掘，本周量子通信也是上涨的主流之一，公司前期未被爆炒，算是量子通信概念中的遗珠，本周无涨停，周涨22.07%位居第六。\n\n佳创视讯，AR概念股，并且周三晚间公告扩展虚拟现实产业引发一字板，本周1涨停，周涨21.06%位居第七。\n\n上峰水泥，消息面并无利好，供给侧改革的范畴，但板块的本周其他水泥并未被炒作，只能说公司是个例，前期横盘2个多月，补涨的属性，本周1涨停，周涨20.96%位居第八。\n\n葵花药业，医药股是本周上涨的主流之一，公司前期横盘大半年，具备补涨动能，本周迎来爆发，本周1涨停，周涨20.39%位居第九。\n\n神州数码，半年报预增近10倍，疑消息提前泄露被炒作，本周1涨停，周涨20.08%位居第十。\n"
		},
		{
			"post_id": 417,
			"title": "上海成线下理财爆雷重灾区 投资人逾800亿打水漂\n",
			"date_published": 1468757839.02,
			"body": "Blog post body"
		},
		{
			"post_id": 416,
			"title": "中国A股，是炒市，群众运动特点鲜明。",
			"date_published": 1468752114.46,
			"body": "Blog post body"
		},
		{
			"post_id": 415,
			"title": "\n\n1997年军方发动政变时，基准伊斯坦布尔证交所100指数基准在接下来的三个交易日内下跌了15%。该指数随后恢复涨势，年底最终上涨254%。\n",
			"date_published": 1468714176.114,
			"body": "Blog post body"
		},
		{
			"post_id": 414,
			"title": "中国首艘海洋核动力平台即将进行总装建造，而未来将批量建造近20座海洋核动力平台。海洋核动力平台将为中国南沙岛礁提供能源保障及淡水保障，并将支撑中国对南海地区进行实际控制。未来，得益于南海电力和能源系统建设力度加强，中国将加快南海地区的商业开发。该消息属于A股市场的重大利好，不仅提振做多信心，并给四个板块带来利好。\n",
			"date_published": 1468676332.143,
			"body": "\n一、核电板块：既然是建设核电站，当然需要核电技术、核电装备、核电原料。这为以中国核电为首的中核科技、中国一重、酒钢宏兴等个股带来巨大的推动力。\n\n二、船舶板块：南海核电站不是建立在陆地上，而是建立在船舶上，这必将给船舶制造带来利好。可以密切关注中国船舶、中国重工等个股。\n\n三、钢铁板块：要建设如此大如此多的船舶码头，需要巨量特种钢材，这必将给钢铁板块带来重大推动。可密切关注以宝钢、武钢、酒钢等个股为首的钢铁板块。\n\n四、电力板块：海洋核动力平台属国内首创，对中国开发利用新能源和全球能源的发展具有重大意义和深远影响。这对以上海机电、上海电力为首的新能源电力板块带来利好。"
		},
		{
			"post_id": 413,
			"title": "近期多个事件不断催化军工板块，对于此次仲裁事件中，中国态度早已比较明确，军工板块前期已大幅上涨，预期已经基本兑现，军工板块短期内上涨空间有限。但中国南海地区的军事建设有望加快，军工板块将维持高关注度，并看好船舶军工、雷达、航空等领域。船舶军工领域，推荐中国重工[-1.25% 资金 研报](大型水面舰艇研制)、中船防务(水面舰艇及相关装备建造)；雷达领域，重点关注四创电子????[-0.43% 资金 研报](雷达整机、通信射频)、国睿科技????(军用雷达整机及子系统供应商)；航空领域，推荐成发科技????[-2.87% 资金 研报](航空发动机关键零件制造)、中航动力(航空发动机总装)、中航飞机[-2.44% 资金 研报](大飞机生产基地).",
			"date_published": 1468673342.641,
			"body": "推荐者是鱼目混珠的好手."
		},
		{
			"post_id": 412,
			"title": "土耳其爆发军事政变，枪炮声大作，令脆弱的欧洲雪上加霜，此事件虽然很快被平息——很难得，说明各国人民群众希望维持民主政体，不希望军人掌权",
			"date_published": 1468672922.234,
			"body": "Blog post body"
		},
		{
			"post_id": 411,
			"title": "中国十大军工公司排名 ",
			"date_published": 1468671322.344,
			"body": "\n\n\n中国十大军工公司排名\n1 中国航天科技集团公司\n2 中国航天科工集团公司\n3 中国航空工业集团公司\n4 中国船舶重工集团公司\n5 中国船舶工业集团公司\n6 中国兵器工业集团公司\n7 中国兵器装备集团公司\n8 中国核工业集团公司\n9 中国核工业建设集团公司\n10 中国电子科技集团公司 "
		},
		{
			"post_id": 410,
			"title": "3100上方套牢盘密密麻麻，一定需要场外增量去推动，就像4月份为什么冲到3097就不行了",
			"date_published": 1468668955.685,
			"body": "Blog post body"
		},
		{
			"post_id": 409,
			"title": "单日中长阴随时可能出现，这个中长阴只要规避掉后面就是你赚钱的机会。直接说结论，下周只要出现单日中长阴那么短线机会就出现了，跌下来你一定要敢买",
			"date_published": 1468668785.235,
			"body": "Blog post body"
		},
		{
			"post_id": 408,
			"title": "黄金股",
			"date_published": 1468668352.489,
			"body": "中国黄金协会报告：矿产金排名前十的黄金企业依次为\n\n1、中国黄金集团公司\n\n2、山东黄金集团有限公司\n\n3、紫金矿业集团股份有限公司\n\n紫金矿业（601899）黄金储量居上市公司第一\n\n4、山东招金集团有限公司\n\n5、湖南黄金集团有限责任公司\n\n6、埃尔拉多黄金公司（中国）\n\n7、云南黄金矿业集团股份有限公司\n\n8、山东中矿集团股份有限公司\n\n9、灵宝黄金股份有限公司\n\n10、灵宝金源矿业股份有限公司\n\n紫金矿业（601899）：紫金矿业是一家以黄金及有色金属矿产资源勘查和开发为主的大型矿业集团，其控股公司分布在全国二十多个省区和海外8个国家，是中国控制金属矿产资源最多的企业、中国最大的黄金生产企业、中国第二大矿产铜生产企业、中国六大锌生产企业之一。\n\n中金黄金（600489）：中金黄金生产有高纯金、标准金、电解银、电解铜和硫酸等多种产品，是集黄金采、选、冶、加工综合配套能力的大型黄金企业。公司是“中国黄金协会副会长单位”，作为中国第一家专业从事黄金生产的上市公司，公司将不断借助资本市场平台，扩大黄金等矿产资源的占有率，通过逐步完善和创新经营机制，着力提高核心竞争力，打造中国黄金业的第一品牌。\n\n山东黄金（600547）：山东黄金是一家集采、选、冶于一体的大型上市公司，主要生产各种规格的投资金条和银锭等产品。公司生产经营主体为新城金矿、焦家金矿、玲珑金矿、三山岛金矿、沂南金矿、平度鑫汇金矿等多座国内外知名的大中型矿山。公司除拥有烟台、青岛、临沂、威海等地省内知名矿床的采矿权外，还通过兼并、收购等手段取得了内蒙古赤峰地区的采矿权，使公司保有黄金储量实现大幅增长。\n\n湖南黄金（002155）：公司主要从事金、锑、钨多金属生产的企业，锑锭和氧化锑的产量排名仅次于中国锡矿山闪星锑业公司，位居全球第二，湖南省最大的产金公司。目前拥有的资源储量为:金金属量41.64吨、锑金属量19.43万吨、钨金属量4.48万吨。锑品对公司的盈利贡献最大。\n\n豫园商城：豫园商城是一家集黄金珠宝、餐饮、医药、工艺品、百货、食品、旅游、房地产、金融和进出口贸易等产业为一体，多元化发展的国内一流的综合性商业集团。公司旗下拥有众多以中国驰名商标、中华老字号、上海市著名商标和百年老店等为核心的产业品牌资源，包括\"老庙黄金\"、\"亚一金店\"、\"南翔小笼\"等。\n\n辰州矿业：辰州矿业是集黄金及有色金属的矿山勘探、开采、选矿、冶炼、精炼、工程测量、矿山测量、地质测量为一体的大型矿业公司，主要产品为“辰州”牌黄金、精锑、氧化锑和仲钨酸铵。黄金产量位居湖南省第一，锑锭及氧化锑产量位居全国第二，仲钨酸铵产量排在湖南省前列。\n\n老凤祥：老凤祥控股子公司老凤祥有限主要从事金银珠宝首饰类产品的加工和销售，其终端品牌老凤祥银楼已成为国内知名的金饰品连锁零售门店之一。\n\n秋林集团：秋林集团收购山东栖霞鲁地矿业有限公司（下称“鲁地矿业”）与深圳金桔莱黄金珠宝首饰有限公司（下称“金桔莱”）100%股权，并补充流动资金。注入的两家公司都是控股股东颐和黄金旗下北京和谐天下金银制品的全资子公司，即控股股东的孙公司。\n\n明牌珠宝：明牌珠宝是国内专业生产、销售珠宝首饰产品的大型企业，拥有黄金饰品、铂金饰品与镶嵌饰品三大产品生产线和集研发、设计、生产、销售于一体的完整产业链。\n\n赤峰黄金：赤峰黄金是一家以黄金采选及销售业务为主的矿山企业。公司矿产资源主要为黄金，共包含有撰山子矿区、红花沟矿区、莲花山矿区采矿权3项采矿权和5项探矿权。\n\n金叶珠宝：金叶珠宝成为集黄金首饰开发设计、生产加工、批发零售于一体的珠宝企业。主营百花系列、五谷丰登系列、万足尊显系列产品。公司是唯一一家集黄金探、采、选、冶及黄金珠宝设计、生产、批发、零售的全产业链的上市公司。\n\n荣华实业：荣华实业全资子公司肃北县浙商矿业投资有限责任公司于近日取得国土资源部 《关于矿产资源储量评审备案证明》（国土资源储备字[2012]91号），截止2011年9月30日，金山金矿采矿许可证范围内保有金金属量4235.07kg。公司原为一家粮食与饲料加工企业，公司被八部委确认为151户农业产业化国家重点龙头企业之一。\n\n\n\n"
		},
		{
			"post_id": 407,
			"title": "傻逼字画",
			"date_published": 1468668001.74,
			"body": "其实不值钱，河南省委原常委、郑州市委原书记王有杰自诩是一位“笔耕不辍”的书法爱好者，曾任中国书法家协会会员，出版有《王有杰书法集》。他在台上时，有评估其书法价格为每平方尺上千元。落马后，某拍卖行曾通过网络拍卖一副王有杰的书法作品，起拍价仅30元，仍无人问津。再有原江西省副省长，他在位时，很多企业家和相关人员争相购买其字画，，动辄几十万之巨。但是他被处决后，他在很多地方题的字都被竞相铲除。由此可见，不要真以为自己艺术造诣让人家叹为观止，那是毛笔、相机中蕴藏的公权力值钱。"
		},
		{
			"post_id": 406,
			"title": "Coup underway in Turkey; president says he's still in charge ",
			"date_published": 1468630756.422,
			"body": "Turkey, a NATO member with the second biggest military in the Western alliance, is one of the most important allies of the United States in the fight against Islamic State, which seized swathes of neighboring Iraq and Syria.\n\nAfter serving as prime minister from 2003, Erdogan was elected president in 2014 with plans to alter the constitution to give the previously ceremonial presidency far greater executive powers. His opponents say his rule has become increasingly authoritarian.\n\nHis AK Party, with roots in Islamism, has long had a strained relationship with the military and nationalists in a state that was founded on secularist principles after World War One. The military has a history of mounting coups to defend secular principles\n"
		},
		{
			"post_id": 405,
			"title": "新股泡沫需要二十年消化 疯狂新股将套牢整整一代人",
			"date_published": 1468628187.892,
			"body": "Blog post body"
		},
		{
			"post_id": 404,
			"title": "近期人民币兑美元加速贬值，而以海外定价的大宗商品很多都是以美元标价，这意味着人民币标价的进口商品价格本身就有上涨需求，进口成本的提升带动了商品市场的整体上涨",
			"date_published": 1468627999.738,
			"body": "Blog post body"
		},
		{
			"post_id": 403,
			"title": "始于6月下旬的本轮商品大涨，来势汹汹，英脱欧事件之后，资金开始找寻新的投放市场，商品期货成为了首选。而大宗商品强势反弹，是资金推动还是实体改善？目前来看，实体改善有限，资金投机特性更明显，在国内流动性宽松背景下，存量资金寻找投资标的，商品经历多年持续下跌后价格处于低位，对于资金具备较强吸引力，而且期货没有套牢盘，不像A股方面大量套牢盘被锁定在高位。",
			"date_published": 1468587454.754,
			"body": "美国货币政策与商品市场表现存在较大的负相关关系。即美国货币政策宽松的话，商品牛市概率高；美国货币政策收紧，商品熊市概率高。反之亦然，如商品市场处于熊市之中，美国货币政策可能趋于收紧；如果商品市场处于牛市，美国货币政策可能趋于宽松。随着美股大选临近，所以7-9月的美联储很难执行加息政策，所以三季度迎来难得了消息真空期"
		},
		{
			"post_id": 402,
			"title": "品牌的力量",
			"date_published": 1468586950.906,
			"body": "安徽丰原生物化学股份有限公司系经安徽省人民政府皖政秘[1998]268 号文件批准,由安徽丰原集团有限公司(原蚌埠柠檬酸厂)(以下简称\"丰原集团\")作为主要发起人,以其生产柠檬酸及其盐类的生产经营性净资产作为发起人资本,与蚌埠市建设投资公司、蚌埠热电厂、安徽省固镇化工总厂、蚌埠市供水总公司共同发起设立的股份有限公司。 经2011年4月26日召开的公司2010年度股东大会审议通过,公司中文名称由\"安徽丰原生物化学股份有限公司\"变更为\"中粮生物化学(安徽)股份有限公司\",英文名称由\"ANHUI BBCA BIOCHEMICAL CO., LTD.\"变更为\"COFCO BIOCHEMICAL (ANHUI) CO., LTD.\"。2011年5月6日,经安徽省工商行政管理局核准,公司名称变更为\"中粮生物化学(安徽)股份有限公司\"。经公司申请,并经深圳证券交易所核准,自2011年5月11日,公司证券简称由\"丰原生化\"变更为\"中粮生化\"。\n\n2015 经营分析\n\n报告期内,公司主要产品之一,国家指令性计划产品燃料乙醇价格受国际原油价格下挫影响,遭遇“寒冬”,全年持续在底价区域徘徊,年均销售单价较上一会计年度下降约1,468元/吨,燃料乙醇产品营业收入同比减少5.01亿元,严重影响年度经营业绩。柠檬酸、赖氨酸等市场化业务由于前期产能扩张导致行业产能过剩、价格竞争异常激烈,年均销售单价较上一会计年度分别下降387元/吨、621元/吨,加之上游原料价格坚挺,售价倒挂,产品毛利大幅收窄。蛋白原料产品受到进口低价DDGS的冲击,加之养殖业周期性低迷、下游需求不足、替代品豆粕价格“决堤”式下跌等影响,全年销售价格下降25%。报告期内,根据蚌埠市政府规划,公司积极推进“退城进园”项目。根据公司与于蚌埠市政府等相关部门达成搬迁补偿方案及搬迁工作规划,报告期末公司根据《企业会计准则第8号——资产减值》相关规定,对拟搬迁资产计提了减值准备。综上,报告期内公司实现归属于母公司所有者的净利润-14.18亿元,较同期下降14.53亿元。回顾过去一年的经营管理工作,主要包含以下方面:1、经营管控成效显著。(1)采购方面,公司紧跟市场节奏,通过实施多样化采购,实现系统低成本采购战略。如:积极开拓进口低价玉米采购渠道、在低价时期集中锁定木薯采购合同、通过加强厂矿直采大幅降低煤炭采购价格。(2)生产方面,公司通过全面对标、深入挖潜降耗、稳步推进科研创新和新产品开发,各项生产消耗指标持续下降,生产成本较上一会计年度持续进步。(3)销售方面,面对国际油价跌入谷底和“两酸”持续低迷的不利形势,公司及时调整销售策略,灵活把握销售节奏,坚持以客户需求和市场趋势为导向,以“增效”为工作核心,通过全力争取高端客户、差异化销售、减量保价销售、弹性生产销售等方式,较好地完成了销售工作目标。2、稳步推进“退城进园”工作。(1)2014年,根据国务院办公厅《关于推进城区老工业区搬迁改造的指导意见》(国办发〔2014〕9号)、《全国老工业基地调整改造规划(2013-2022年)》(发改东北〔2013〕543号)及《中共蚌埠市委蚌埠市人民政府关于重点生物化工企业退城进园的实施意见》(蚌〔2014〕1号)等文件精神,为促进国民经济和社会发展、优化城市环境、促进节能减排等公共利益需要,蚌埠市人民政府明确将中粮生化蚌埠市内的企业列入搬迁范围。(2)报告期内,公司依据上述文件精神稳步推进“退城进园”工作,公司2015年第六次临时股东大会审议通过了《关于公司与蚌埠市人民政府签署〈征收补偿协议书〉的议案》、《关于公司与蚌埠市淮上区人民政府签署〈进驻沫河口工业园协议书〉的议案》,并于2015年底与蚌埠市淮上区人民政府签署了《进驻沫河口工业园协议书》、与蚌埠市人民政府及禹会区人民政府签署了《征收补偿协议书》。3、进一步夯实基础管理。(1)2015年,公司坚持以人为本的管理理念,加强党的组织建设和企业文化建设,通过优化组织架构、强化干部业绩考核等有效措施,实现企业内部人才实力稳步增长,劳动效能逐步提升。(2)2015年,公司积极参与行业标准制定等重要活动。一方面启动《推广乙醇汽油对大气PM2.5环境效益的研究》项目,积极普及乙醇汽油替代化石燃料、减少二氧化碳排放、改善空气质量等科学知识,引导公众正确认知乙醇汽油的清洁性,为国家制定产业发展政策提供科学、客观的理论保障。(3)2015年,公司积极参与国家质量标准制定,主持制定了《食品添加剂--柠檬酸钙》等10余个国家或行业标准。同时公司以总分第一名的成绩,荣获蚌埠市质量最高奖“市长质量奖”。(4)2015年,通过优化流程,健全内控评价机制,进一步夯实了内控管理基础,确保公司规范运作。(5)2015年,面对严峻的经营形势,公司灵活控制融资节奏,确保现金合理流动,提高资金使用效率,满足了公司正常经营和发展需要。(6)2015年,公司全年无安全生产事故,无职业健康危害事故。"
		},
		{
			"post_id": 401,
			"title": "去年搞了一年国改 到现在国企有改变呢 两公司和合一块就叫改革吗 套了一大批 ",
			"date_published": 1468586044.216,
			"body": "Blog post body"
		},
		{
			"post_id": 400,
			"title": "发一次新闻坑一批人",
			"date_published": 1468584172.744,
			"body": "Blog post body"
		},
		{
			"post_id": 399,
			"title": "政策提升风险偏好，投资者关注度明显上升，下半年国改料将成最大主题。",
			"date_published": 1468584132.502,
			"body": "未来可能出现超预期的改革内容"
		},
		{
			"post_id": 398,
			"title": "3000点一线是阶段性顶部区间，而不是所谓的顶部，顶部的判断我们认为只有主板指数放量跨过了3097点之后才可以确认",
			"date_published": 1468583368.986,
			"body": "Blog post body"
		},
		{
			"post_id": 397,
			"title": "大消费、家电、军工",
			"date_published": 1468582008.96,
			"body": "Blog post body"
		},
		{
			"post_id": 396,
			"title": "目前的行情属于货币泛滥下的资产荒行情，但是在监管趋严的情况下，井喷行情不可能有，震荡上行，是行情的主要表现形式。",
			"date_published": 1468581942.147,
			"body": "主力可以打压的确存在。"
		},
		{
			"post_id": 395,
			"title": "当前走势是“国家队控制大盘，采取拉长阳后让指数调整三五天后，挖坑再拉长阳”模式，已经被市场充分认识到，散户也因此学乖了，你拉长阳后，我不追涨了，也不杀跌了，就拿着筹码等你国家队拉指数了；",
			"date_published": 1468581813.015,
			"body": "主力应该采取的策略："
		},
		{
			"post_id": 394,
			"title": "矛盾 --- 收盘今天热点是量子通信和钢铁股，前者属于题材股，后者属于周期性补涨股，这两者同时存在，表明今天的资金性质比较矛盾，缺乏合力，对市场产生了相左的认识，这不利后市；",
			"date_published": 1468581745.417,
			"body": "Blog post body"
		},
		{
			"post_id": 393,
			"title": "看好证券、医疗、虚拟现实、无人驾驶、新材料以及国资改革板块",
			"date_published": 1468580870.103,
			"body": "Blog post body"
		},
		{
			"post_id": 392,
			"title": "统计显示，历史上合计共出现过85次连续2次以上十字星的情况。此前84次沪指出现连续十字星后5个交易日上涨概率65.48%，算数平均涨幅为1.22%",
			"date_published": 1468580753.047,
			"body": "Blog post body"
		},
		{
			"post_id": 391,
			"title": "主力都是通过何种方式来消化和解放前期套牢盘压力的",
			"date_published": 1468580017.43,
			"body": "   第一种也是比较常见的方式就是放量突破前高，将前期套牢盘全部通吃，然后继续展开上攻行情。从目前的市场表现来看，大盘自去年5178点开跌以来到今年5月份成交量大幅萎缩，并出现罕见地量水平，随着6月份以来的几件重大利空消息的逐步落地，成交量开始稳步回升，尤其是进入7月以来，更是出现难得的量价齐升势头。有句话说的好：“一根大阳线改变三观，三根大阳线改变信仰。”目前行情才刚刚开始，赚钱效应正在逐步发酵，场外资金也在不断进场抄底，成交量也呈现出移步推升的走势，其量能的变化规律永远是市场清淡无交易导致地量的出现，然后是一个缓慢放量到最后急剧放量到天量级别宣告行情结束的一个过程。而有些人仅从目前的量能就推断后面不会有更多的资金介入，不免有些片面和武断。市场一旦产生巨大的赚钱效应，资金就会源源不断的涌入市场，来分一杯羹的，因为资本是逐利的。随着市场的震荡盘升，以及成交量的稳步推升，将来成交量达到或超过去年11月份的量能水平也是完全有可能的。 \n\n   另一种消化前期套牢盘压力的方式是以时间换空间，经过长期的充分的底部震荡换手逼迫投资者割肉离场，将上方的套牢筹码逐步稀释并下移，由于在底部经过充分的换手之后，市场成本趋于一致，然后就会出现震荡盘升，当到了前期套牢盘附近也不会出现大量的抛盘，从而出现了量能的平稳过度。也即量能达不到前期量能水平也是可以突破过去的。 从大盘的指数来看，目前的市场走势与2005年6月份创出历史大底998点之后的12月份走势较为相近，反弹同样是面临前期8-9月份巨大套牢盘的压力，但是经过底部的充分换手后筹码成本趋于一致，在股指反弹到前期高点时并未出现明显的巨量就完成了冲关的过程。并由此展开了波澜壮阔的大牛市行情。回归到眼下的市场行情，即便是大盘不放量冲关3500点，从目前的市场长达半年之久的底部震荡换手来看，前期上方的套牢筹码已经被稀释和下移了，因此，即便没有强大的量能支撑，市场也有望向3500点进发。 \n"
		},
		{
			"post_id": 390,
			"title": "俗话说五穷六绝七翻身，进入七月份以来，股市翻身的行情已初露锋芒。从沪指日K线来看，被称为“牛熊分界线”的半年线被踩在了脚下，而且由原来的快速下行开始变为走平趋缓，中短期均线系统已形成多头排列。从成交量能来看，大盘自去年5178点开跌以来到今年5月份成交量大幅萎缩，并出现罕见地量水平，随着6月份几件重大利空消息的逐步落地，成交量开始稳步回升，尤其是进入7月以来，出现难得的量价齐升势头。",
			"date_published": 1468579942.768,
			"body": "Blog post body"
		},
		{
			"post_id": 389,
			"title": "6月以来，市场先后经历入摩失败，英国退欧，万科复牌，地缘风波四大利空密集冲击，但指数不仅没有破位下行再探2638，反而从2800涨到3000，股谚云，该跌不跌，理应看涨。既然在一片看空声中，一个刚经历三次股灾的市场却顽强地走出向上攻击行情，说明市场内在趋势悄悄发生转变，大行情呼之欲出",
			"date_published": 1468579853.521,
			"body": "Blog post body"
		},
		{
			"post_id": 388,
			"title": "券商板块做为行情起动的龙头，未来有望领涨市场，尤其是6月经营数据优异，加之金融改革的催化效应，未来将会有不错的表现。同样，军工行业催化剂不断，南海仲裁案、南海军演、美在韩部署导弹防御系统、国企改革等。",
			"date_published": 1468579832.497,
			"body": "Blog post body"
		},
		{
			"post_id": 387,
			"title": "A类公司36家，占比38%，B类公司51家，占比54%，C类公司8家，占比8%",
			"date_published": 1468579603.389,
			"body": "7月15日，证监会新闻发言人邓舸表示，证监会公布了2016年证券公司分类评价结果，经综合评价，2016年95家证券公司分类评价结果为：A类公司36家，占比38%，B类公司51家，占比54%，C类公司8家，占比8%，无D、E类公司。\n\n　　分类评价结果为A（AAA、AA、A）、B（BBB、BB、B）、C（CCC、CC、C）、D、E等5大类11个级别。A、B、C三大类中各级别公司均为正常经营公司。此次评价期间为2015年5月份至2016年4月份。\n\n　　根据评价结果，中信证券(600030,股吧)、海通证券(600837,股吧)、国信证券(002736,股吧)、广发证券(000776,股吧)、华泰证券(601688,股吧)、方正证券(601901,股吧)、兴业证券(601377,股吧)等7家上市证券公司分别因经纪业务、两融业务和新股发行保荐业务涉嫌违法违规被证监会立案调查，根据相关规定，其中6家公司由去年AA级降为BBB级，方正证券由A级降为C级。A、B、C三大类中各级别公司均为正常经营公司，因此，这意味着7家证券公司正常业务不受任何影响。\n\n　　证监会相关负责人表示，7家公司分类评价结果下降，是公司部分业务环节合规出现问题的客观反映，相关公司整体运营、管控仍处于正常范围。\n\n　　证券公司分类评价工作每年进行一次，从2007年开始，今年已经是第十个年头，经过多年来的不断完善，证券公司分类评价工作已经形成一套较为完善的工作机制。分类工作开展十年来，不乏有证券公司因违法违规行为导致分类评价结果下降的情况。\n\n\n"
		},
		{
			"post_id": 386,
			"title": "多地大雨催涨中药材价格 部分医药股价格闻风而动\n",
			"date_published": 1468508573.736,
			"body": "Blog post body"
		},
		{
			"post_id": 385,
			"title": "机构调研",
			"date_published": 1468508446.955,
			"body": " 7月份以来截至昨日，共有197家公司接待机构调研241次，其中，34家公司接待参与调研机构家数超过10家，包括三夫户外(108家)、海顺新材(38家)、超图软件(33家)、旋极信息(33家)、利亚德(30家)、康力电梯(29家)、联创互联(27家)、南方汇通(27家)、神州信息(26家)、盛达矿业(25家)、东方园林(24家)、双杰电气(23家)、翰宇药业(23家)、联创电子(20家)等在内的14家公司更是获得机构扎堆调研，参与调研机构家数均达到或超过20家。\n\n　　从机构调研公司的行业分布来看，主要集中在机械设备、化工、电子、计算机、医药生物、电气设备、有色金属、汽车等八大行业，分别有25家、22家、17家、16家、15家、15家、10家、10家。\n\n　　此外，外汇局公布的最新数据显示，6月末，外汇局合计批准273家合格境外机构投资者(QFII)累计发放811.8亿美元投资额度。QFII等海外机构在A股的动向颇受关注。\n\n　　7月份以来截至昨日，海外机构共计参与调研26家公司。从参与调研的海外机构数量来看，蓝思科技、伊利股份、海康威视分别有8家、7家、5家海外机构参与调研，而中航飞机、汇川技术、苏宁云商、比亚迪、盛达矿业、天齐锂业、双鹭药业、小天鹅A、神州信息、三夫户外等公司也接受了2家及以上海外机构的调研。\n\n　　上述备受海外机构关注的个股7月份以来市场表现也是可圈可点，月内实现上涨个股达到20只，占比为76.92%。其中，盛达矿业(34.57%)、海顺新材(22.78%)、中航飞机(22.50%)、旋极信息(12.91%)、海康威视(11.74%)、小天鹅A(10.12%)等个股月内累计涨幅均在10%以上。\n\n　　值得一提的是，从近期海外机构调研足迹可以看出，三类主线备受关注：一是以食品饮料、家用电器、医药生物为代表的大消费概念股；二是在政策红利推动下的国企改革概念股，三是具有业绩支撑的白马股。 "
		},
		{
			"post_id": 384,
			"title": "体育板块。",
			"date_published": 1468508071.17,
			"body": "随着人均可支配收入和消费主体结构的变化，一些新型的消费板块进入了快速的发展周期。近年来体育产业进入到快速的发展阶段，2015年体育产业的产值是4000亿，而国家的目标是2025年达到5万亿以上。在具体投资上，我们可以关注五个细分板块，第一是体育赛事，第二是体育场馆建设和体育器材，第三是职业俱乐部，第四是体育传媒，第五是体育彩票。"
		},
		{
			"post_id": 383,
			"title": "人工智能越来越受到国家的战略重视",
			"date_published": 1468508006.744,
			"body": "《中国制造2025》的一个亮点，人工智能越来越受到国家的战略重视，包括国家四部委将人工智能单独列出发文，7月5号又将人工智能列入战略性新兴产业（爱基,净值,资讯）。从市场空间来说，我们现在看到无人驾驶、智能穿戴、虚拟与现实，智能安防、智能医疗、智能服务机器人(行情26.06 -0.42%,买入)等，五到十年之后，很可能都是很平常的东西，这个市场发展空间是非常大的。在具体投资上，一是可以关注一下技术支撑板块，包括物联网、大数据、云计算等。二是应用终端设备。可以关注一下智能安防、智能医疗、虚拟现实，无人驾驶、智能机器人等。"
		},
		{
			"post_id": 382,
			"title": "国企改革试点",
			"date_published": 1468507310.239,
			"body": "国资委14号对外表示，当前国企改革试点全面铺开。\n\n　　其中，国有资本投资运营公司试点，中粮集团、国投公司试点工作继续深化，陆续将21项权利归位于或授予企业，在此基础上，选择诚通集团、中国国新开展国有资本运营公司试点，选择神华集团、宝钢、武钢、中国五矿、招商局集团、中交集团、保利集团等7家企业开展国有资本投资公司试点。\n\n　　落实董事会职权试点，在中国节能、中国建材(港股3.70 +1.65%)、国药集团、新兴际华集团(行情8.25 -0.24%,买入)等4家的试点进一步深化。\n\n　　中央企业兼并重组试点，选择中国建材和中材集团、中远集团和中国海运、中电投集团和国家核电等3对重组企业开展了试点。\n\n　　中央企业信息公开工作试点选择中粮集团、中国建筑(行情5.51 -1.08%,买入)等2家企业开展了试点。\n\n　　剥离企业办社会职能和解决历史遗留问题试点选择部分地方省市开展了试点。\n\n　　国资委表示，各地普遍将试点作为推动改革文件落地的重要抓手，今年上半年，各地共启动国企国资改革试点147项，已有50项试点取得了阶段性成果。\n\n　　试点企业名单旗下上市公司有望受益，以下为金融界网站独家整理： \n\n　　金融界网站注：\n\n　　中粮集团：中粮生化(行情11.56 -0.69%,买入) 中粮屯河(行情12.02 -1.15%,买入) 中粮地产(行情9.95 -1.49%,买入) \n\n　　国投公司：国投电力(行情6.61 -1.05%,买入) ST新集 国投中鲁(行情16.90 +0.06%,买入) 中纺投资 中成股份(行情19.96 -1.04%,买入)\n\n　　诚通集团：中储股份(行情8.11 +1.00%,买入) 冠豪高新(行情9.59 +0.84%,买入) 岳阳林纸(行情6.52 +0.31%,买入) 诚通发展 粤华包B(行情9.43 停牌,买入)\n\n　　中国国新：旗下无上市公司\n\n　　神华集团：中国神华(行情14.77 -1.20%,买入)(港股15.08 -0.13%)\n\n　　宝钢：宝钢股份(行情4.9 停牌,买入) *ST八钢(行情4.45 -0.45%,买入) *ST韶钢(行情3.00 -0.99%,买入) 宝信软件(行情23.14 -0.22%,买入) \n\n　　武钢：武钢股份(行情2.76 停牌,买入) \n\n　　招商局集团：招商银行(行情17.09 +0.23%,买入)(港股17.44 +1.51%) 招商证券(行情17.70 +0.34%,买入) 招商轮船(行情5.37 +2.68%,买入) 招商地产 深赤湾A(行情16.82 -1.12%,买入) 中集集团(行情14.89 +0.00%,买入)(港股10.18 +2.83%) 山东高速(行情5.41 -1.28%,买入) 皖通高速(行情14.99 -0.07%,买入) 四川成渝(行情4.84 -1.02%,买入) 五洲交通(行情5.26 +0.00%,买入) 华北高速(行情5.01 停牌,买入) 上港集团(行情5.36 -0.74%,买入) 福建高速(行情3.37 +0.90%,买入) 龙江交通(行情4.28 +0.47%,买入) 深高速(行情8.48 +2.79%,买入) 楚天高速(行情5.06 停牌,买入) 中原高速(行情4.66 +0.43%,买入) 宁波港(行情5.30 +0.38%,买入) 招商局国际(港股21.70 +0.70%) \n\n　　中国五矿：五矿发展(行情20.03 -1.81%,买入) 中钨高新(行情17.26 -2.21%,买入) 株冶集团(行情11.19 -0.89%,买入) *ST金瑞(行情12.77 -4.20%,买入) *ST五矿 五矿资源(港股1.99 -0.50%)\n\n　　中交集团：中国交建(行情10.93 -1.18%,买入)\n\n　　保利集团：保利地产(行情9.22 +1.32%,买入) 保利置业 保利文化(港股19.58 +1.45%) 久联发展(行情16.80 -1.70%,买入) \n\n　　中国节能：万润股份(行情50.14 -0.02%,买入) 启源装备(行情21.15 +1.63%,买入) 节能风电(行情10.01 -1.28%,买入)\n\n　　中国建材：中国建材 北新建材(行情9.90 -1.10%,买入) 中国巨石(行情11.60 +1.31%,买入) 洛阳玻璃(行情27.62 -1.29%,买入) 瑞泰科技(行情17.95 -1.54%,买入) 方兴科技\n\n　　国药集团：国药控股(港股38.65 +0.91%) 国药股份(行情27.42 停牌,买入) 国药一致(行情68.19 -1.60%,买入) 天坛生物(行情30.65 +0.49%,买入) 现代制药(行情30.33 +0.73%,买入) 中国中药(港股3.07 +0.00%)\n\n　　新兴际华集团：新兴铸管(行情4.90 -1.21%,买入) 际华集团\n\n　　中国建材：中国建材 北新建材 中国巨石 洛阳玻璃 瑞泰科技 方兴科技\n\n　　中材集团：中材国际(行情6.94 -1.42%,买入) 中材科技(行情20.60 -0.87%,买入) 中材节能(行情11.69 -1.27%,买入) 宁夏建材(行情9.69 -0.51%,买入) 祁连山(行情7.17 -0.14%,买入) 天山股份(行情6.45 -0.31%,买入) \n\n　　中远集团：中国远洋(行情5.47 +1.11%,买入)(港股2.89 +1.76%)A 中国远洋H 中远太平洋(行情6.56 +1.71%,买入)(港股7.96 +0.13%) 中远国际 中远航运(行情6.22 +0.65%,买入) 中集集团A 中集集团H\n\n　　中国海运：中海发展(行情6.39 +0.16%,买入) 中海海盛(行情10.54 停牌,买入) 中海集运(行情4.27 +0.23%,买入)(港股1.78 +4.09%) \n\n　　中电投集团：上海电力(行情10.91 -0.73%,买入) 吉电股份(行情5.83 +0.00%,买入) 东方能源(行情15.31 -1.61%,买入) 露天煤业(行情8.39 +0.12%,买入) 中电远达 中国电力(港股2.81 -0.35%) 漳泽电力(行情3.75 +0.27%,买入)\n"
		},
		{
			"post_id": 381,
			"title": "国内首家世界性投资银行----金大控投??",
			"date_published": 1468500982.14,
			"body": "光大银行重大事项停牌公告：中国光大银行股份有限公司获悉主要股东中国光大集团股份公司正在筹划涉及增持本行股份的重大事项，鉴于该事项存在不确定性，为保证公平信息披露，维护投资者利益，避免造成本行股价异常波动，经本行申请，本行股票自7月14日起停牌5日！ 5日后再行公告。\n\n1.大股东光大集团宣布增持光大银行，估计至少按4.98元净资产增持；\n\n2.整体上市，资产重组，光大将成国内首家世界性投资银行----金大控投，成中国的高盛！高盛股价150--200美元。\n\n3.此前光大银行一季度隐瞒0.02--0.03元利润，我看其实就是精心设计，压低股价，方便大股东低位买入。 \n\n有人网上透露：光大银行重大事项停牌： 集团增持.资产重组.整体上市.更名---金大控投！\n\n不知道是否确实？估计很有可能。\n\n 可能此时有人准备举牌光大银行，大股东于是只有增持保第一？\n\n  我的回复： 我早就说过，保险资金、养老金都虎视眈眈！ 5日复牌后连续打板！大概率！哈哈～ 连续打板，是中国股市中国股民的伟大创造！连续打板，省钱省力，花费资金最少，而效应最佳。一般来说，连续打板有以下几种情况：1.新股；2.重大重组停牌；3.整体上市；4.大股东回购或者增持。而光大银行此次停牌，2、3、4种情况都有！都有！\n"
		},
		{
			"post_id": 380,
			"title": "江苏银行IPO",
			"date_published": 1468500586.305,
			"body": "随着江苏银行IPO的再度启动，其实会给A股市场带来这几方面的影响。\n\n  其中，在江苏银行IPO顺利发行后，实际上意味着暂停多年的城商行上市进程再度重启，这或将引发更多城商行、农商行加快上市的步伐。然而，根据消息指出，就目前而言，已经有多家地方银行通过发审会，且距离上市的步伐越来越近了。从某种角度来看，这或将对未来市场构成一定的融资抽血压力。\n\n  再者，如果江苏银行等地方银行上市之后遭到市场的热炒，或将会给A股市场中长期估值定价严重偏低的上市银行股，带来一定的价格想象预期，或间接提升上市银行股的价值运行中枢位置，这从某种程度上激活了市场运行重心的抬升。\n\n  此外，随着江苏银行的成功上市，或意味着股市投资信心已经有所修复，而在现行IPO新规模式之下，取消预缴款申购机制，会对市场存量资金的冲击影响有所降低。\n\n  但是，即使如此，但地方银行IPO的来袭预期，却给市场带来了比较大的心理压力。时下，虽然A股市场采取的是取消预缴款申购机制模式，新股发行对股市存量资金的分流压力明显骤减，但若IPO发行节奏得不到控制，或人为导致市场融资与投资功能的失衡发展，这将会给刚刚修复不久的市场投资信心，带来再一次的创伤。\n\n  与此同时，时至今日，距离股灾风波爆发仅仅过了一年的时间，而股灾风波对市场人气的冲击影响，却依旧存在。但是，纵观中国股市的历史，促使股市“由牛转熊”容易，但让股市“由熊转牛”却相当困难。由此一来，在股市刚刚经历了“疯熊”的冲击之后，市场仍然需要有一个信心修复的过程，而时下的市场，也承受不了大批地方银行的上市融资抽血压力。\n\n  但是，面对时下IPO堰塞湖问题相对严峻的大背景，虽有不少地方银行存在上市融资的需求，但仍受到IPO诸多环节的束缚，而在此期间，即使拟上市企业顺利通过多个发行环节，仍需要时刻考虑到自身的发行规模、发行价格以及发行市盈率等因素，而稍有不慎，也很容易错失其上市的良机。\n\n  不过，站在当前的市场角度去思考，地方银行IPO来袭，或许是一种趋势，但要让股市投资与融资功能得到均衡发展，这才是目前市场管理者工作的重中之重。相反，如果在市场稍有回暖之际，却再度加大股市的抽血压力，则后果也是不堪设想的，甚至还可能会把之前艰难修复的市场投资信心，再度遭到创伤。这，确实需要引起管理者的深刻思考。\n\n"
		},
		{
			"post_id": 379,
			"title": "做一粒蒸不烂，煮不热，锤不扁，炒不爆，响当当的铜豌豆！",
			"date_published": 1468495734.007,
			"body": "Blog post body"
		},
		{
			"post_id": 378,
			"title": "主力策略 --- 待年线继续回落，伺机一根大阳线冲关则会顺利很多！这也是主力震荡洗盘的最大真相：通过洗盘吸收足够的筹码，汰弱留强，主力一旦筹码收集完毕，就会发动更大的强势大反攻！",
			"date_published": 1468495607.001,
			"body": "Blog post body"
		},
		{
			"post_id": 377,
			"title": "QFII如果再加码，连锁反应肯定是有的，这两天的行情已经有点苗头了，很多横盘的股票突然就启动，一下子解放几月的筹码，这种基本都是有实力的机构才敢那么做的，所以牛人给我打气，让我横盘的股票随便买",
			"date_published": 1468494642.449,
			"body": "Blog post body"
		},
		{
			"post_id": 376,
			"title": "在大金融板块中银行、保险、地产三个板块能够稳住不跌就算是对行情的重大贡献了，券商弹性最好",
			"date_published": 1468494309.821,
			"body": "Blog post body"
		},
		{
			"post_id": 375,
			"title": "谁能接过黄金的大旗的问题",
			"date_published": 1468494285.494,
			"body": "Blog post body"
		},
		{
			"post_id": 374,
			"title": "从上证周线角度来看，本轮行情量能有些不足，在三、四月份向3100点冲击的过程中，上证周成交还能维持在1.25万亿--1.4万亿的水平，而6、7月以来的本轮攻击周量能最大也就是1.25万亿，并不能在二次攻击3100点的过程中形成量能同比有效放大，说明多方的进场做多准备并不充分，只是临时被黄金板块的拉升所带动的被动补涨。",
			"date_published": 1468494139.258,
			"body": "Blog post body"
		},
		{
			"post_id": 373,
			"title": "上证指数补掉3060缺口之后反复实验3050点的有效性支撑，多次击穿、多次反抽后周四尾盘勉强收回到3054点，所幸的是周四调整成交量急剧萎缩，为周五再次冲击3078点留下了一丝希望。\n",
			"date_published": 1468494103.523,
			"body": "Blog post body"
		},
		{
			"post_id": 372,
			"title": "放眼未来，应该集中在两个条件上：第一，小型企业；第二，新型行业",
			"date_published": 1468493923.104,
			"body": "Blog post body"
		},
		{
			"post_id": 371,
			"title": "谁是真正的石墨烯龙头？",
			"date_published": 1468492550.966,
			"body": "国家十三五规划主推石墨烯，打造成新材料产业，到2020年突破百亿，中国的石墨烯企业有百来家，\n\nＡ股上市公司涉及石墨烯的大约有25家左右。谁是真正的龙头呢？　首先我们来了解下石墨烯材料。\n\n \n\n　　　石墨烯应用场景多元化，科研应用两手抓。石墨烯作为公认的“新材料之王”，下游应用场景众多，相关企业纷纷基于主营业务或开展石墨烯相关研究或将已有研究成果应用于传统产品，赋予产品新活力，新特性，激发了下游的新需求。将重点发展石墨烯、3D 打印、超导、智能仿生等4 大类14 个分类材料。\n\n　　良好的电导性和透光性。石墨烯良好的电导性能和透光性能，使它在透明电导电极方面有非常好的应用前景。触摸屏、液晶显示、有机光伏电池、有机发光二极管等等，都需要良好的透明电导电极材料。\n\n　　超高的表面面积对质量比例。由于石墨烯具有特高的表面面积对质量比例，石墨烯可以用于超级电容器的导电电极。这种超级电容器的储存能量密度会大于现有的电容器。防腐蚀。石墨烯不溶于水并且具有高导电性，与钢组合可以防止接触水并减缓氧化铁的电化学反应。\n\n \n\n　　在中国十大石墨烯生产商中，第一就是宁波墨西，第二是重庆墨西。　一个上市公司是不是龙头，不在于是不是涨的好，而是要看石墨烯在公司中占比多大，在整个行业当中地位如何。　在上市公司当中，有一家公司巨资投资了在国内占有第一和第二的公司，分别是宁波墨西和重庆墨西，投资是国内最大的。这才是真正的石墨烯股票。这只龙头就是华丽家族600503.\n\nmore info - \nhttp://28169147.blog.hexun.com/\n\n"
		},
		{
			"post_id": 370,
			"title": "多行不义必自毙！创业板和次新股作恶太多了，留给市场的只有一个后果，那就是惊天重挫。",
			"date_published": 1468492356.304,
			"body": "Blog post body"
		},
		{
			"post_id": 369,
			"title": "大众所谓的看好，只不过是高潮时候的盲目，这种情绪化的看好，一旦市场拉出一个放量巨阴线，你的贪婪立马变恐惧，一根阴线能改变你的世界观。",
			"date_published": 1468492327.935,
			"body": "Blog post body"
		},
		{
			"post_id": 368,
			"title": "只要你有耐心，下半年市场里的大部分股票会打折甩卖，绝大多数股票还要腰斩，再腰斩。",
			"date_published": 1468492287.359,
			"body": "Blog post body"
		},
		{
			"post_id": 367,
			"title": "欣泰电气事件折射出这市场的业绩 大部分都来自假账，昨天次新股等高价股出现放量重挫，今天上午跌幅榜依然有10只跌停板，跌幅8个点的上百家，其中大部分都是炒作过度没有业绩支撑的股票，主力采取了果断措施，资金放量出逃。这些资金的态度，代表了以次新股锂电池，黄金股，白酒股，高送转，等板块获利丰厚，在放量出逃的过程中还有反复诱多出货过程，这说明这个中级反弹将要结束。而今天创业板在杀跌的过程中，主板接力护盘，掩护创业板出货，市场拉起了银行板块为首的金融板块，多只银行大涨，券商大涨。更突出的一个亮点是煤炭和钢铁一直是市场当中的风向标，也就是钢铁煤炭魔咒，一旦权重股开始补涨掩护出货，市场也就在顶部构造，反弹也就是进入尾声。",
			"date_published": 1468492223.859,
			"body": "Blog post body"
		},
		{
			"post_id": 366,
			"title": "当市场上涨的时候，你等一个利空都等不到，同样当市场暴跌的时候，你等一个利好逃命的机会都没有。",
			"date_published": 1468492096.708,
			"body": "Blog post body"
		},
		{
			"post_id": 365,
			"title": "现在市场的投机炒作到了令人发指的程度，当前全球经济都面临巨大挑战，欧盟面临解体，德意志银行面临崩溃，所有这些炒作现象都是拉高逃命的象征，当市场上涨的时候，你等一个利空都等不到，同样当市场暴跌的时候，你等一个利好逃命的机会都没有。现在股市是那么的平静，就好像暴风雨之前的宁静，最近湖北，湖南，安徽，四川，下起了百年一遇的暴雨，这种狂风暴雨是上天在哭泣，预示着资本市场将面临绝地大屠杀！",
			"date_published": 1468492049.815,
			"body": "Blog post body"
		},
		{
			"post_id": 364,
			"title": "现在全球的股市依然非常淡定，欧洲股市在脱欧中走了出来，特别是英国还创新高，美国股市依然处于历史高位，牛市依然，在A股整天这概念那概念，这个高送转那个高送转，暴拉次新股，高呼做多A股的别有用心",
			"date_published": 1468491991.098,
			"body": "Blog post body"
		},
		{
			"post_id": 363,
			"title": "在这几个月里，从收紧中概股回归A股，到限制四大行业跨界并购，再到研究改进退市机制，防止忽悠式重组套利，合式的股市新政正逐步展现监管新思路。这些组合拳就是针对僵尸企业，目的就是让僵尸企业的泡沫破灭，让股价连续下跌，让这些企业无法讲故事自然就会选择退市。所以壳资源的股票和僵尸股会面临连续下跌和退市的风险",
			"date_published": 1468491896.252,
			"body": "Blog post body"
		},
		{
			"post_id": 362,
			"title": "熔断之后，市场进入了放水养鱼行情，没有韭菜可以收割了，所以用精准调控，什么叫精准调控呢？就是只要大盘上升无力，就马上推送利好，比如马上加入国际指数，马上开通深港通，诸如此类，这些消息不是随意出来的，而是精心设计，精准推送的，目的只有一个，引导场外资金入场，说的难听点就是忽悠接盘。",
			"date_published": 1468491834.073,
			"body": "Blog post body"
		},
		{
			"post_id": 361,
			"title": "千股跌停板将再现？\n",
			"date_published": 1468491685.398,
			"body": "Blog post body"
		},
		{
			"post_id": 360,
			"title": "谁是骗子？",
			"date_published": 1468491547.938,
			"body": "万福生科已经长期处于\"主业暂停\"的状态中，此前也未透露何时恢复生产。　  记者注意到，万福生科在年报中称，自2014年10月起，公司开始实施暂时性停产措施，2015年8月起对全部产品生产线实施阶段性停产，进入产业调整期，同时控制成本开支，使非经营性费用降到最低。年报显示，由于2015年实行全面停产，除稻谷购销和粮食保管收益外，万福生科没有其他收入来源。　　  万福生科年报还表示，2015年，为了减轻公司以后的盈利压力和便于新的资产的置入，公司进一步裁减员工，目前在职员工29人。　  2014年底，万福生科原控股股东龚永福、杨荣华夫妇名下合计26.18%股权因债务问题被司法划拨给桃源湘晖农业投资有限公司，后者成为万福生科第一大股东，自然人卢建之成为实际控制人。       对于这样欺诈发行的上市公司，看看大股东减持了多少，套现了多少钱。我们再看看仅仅就罚款30万。\n【2016-03-25】【出处】全景网万福生科(300268)股东抛150万股套现2394万元                                   全景网3月24日讯万福生科（300268）周四晚间发布公告，公司持股5%以上股东杨荣华于2016年3月22日、23日通以大宗交易方式减持公司股份150万股，占总股本的1.12%，减持均价15.96元/股，套现2394万元。    本次减持后，杨荣华仍持有公司2469万股股份，占总股本的18.43%，仍为公司持股5%以上股东。\n【2016-03-23】【出处】全景网万福生科(300268)股东减持250万股 占比1.9%                                　　全景网3月22日讯万福生科（300268）周二盘后公告称，公司持股5%以上股东杨荣华分别于2016年3月18 日、21日通过大宗交易方式减持公司无限售流通股份250万股，占股份总数的1.8657%。　　此次减持后，杨荣华持有公司2619万股，占总股本的19.54%，仍为公司持股5%以上股东。\n　证监会5月10日召开新闻通气会，专门通报万福生科涉嫌欺诈发行及相关中介机构违法违规案的行政处罚结果，拟对万福生科罚款30万元，对平安证券、中磊会计师事务所、博鳌律师事务所分别罚没7650万元、414万元、210万元。\n　\n　　由于涉嫌欺诈发行股票和信息披露违法，万福生科被证监会给予警告，并处以30万元罚款；对公司董事长兼总经理龚永福给予警告，并处以30万元罚款；对其他19名高管给予警告，并处以25万元至5万元罚款。此外，拟对龚永福以及万福生科原财务总监覃学军采取终身证券市场禁入措施。\n　　而平安证券在万福生科上市保荐工作中，未能勤勉尽责，并存在虚假记载，证监会拟对其给予警告，没收其该保荐业务收入2550万元，并处以2倍的罚款，暂停其保荐机构资格3个月；对保荐代表人吴文浩、何涛处以30万元罚款，撤销保荐代表人资格和证券从业资格，采取终身证券市场禁入措施。\n　　另外，证监会拟对中磊会计师事务所没收业务收入138万元，并处以2倍的罚款，撤销其证券服务业务许可；对湖南博鳌律师事务所没收业务收入70万元，并处以2倍的罚款，且12个月内不接受其出具的证券发行专项文件。同时，证监会也对两家机构的涉案人员进行依法处罚。万福生科欺诈发行案：两名保代终身禁入证券市场\n　　万福生科去年9月被证监会立案调查。经查证，在2008年至2011年间，公司累计虚增收入约7.4亿元、虚增营业利润约1.8亿元。另外，公司2012年半年度报告也存在虚假记载。"
		},
		{
			"post_id": 359,
			"title": "口号",
			"date_published": 1468491377.693,
			"body": "5100点  所有机构唱多，5000点是牛市新起点，目标一万点。     \n2015年8月14日   大盘4000点，所有机构喊为国护盘，千金难买回头牛！     2015年12月20日  大盘3600点  为国接盘，股灾已经过去，大盘将突破4500点以上     \n2016年7月13日   大盘3050点  中国股市将迎来牛市，创业板将引领大涨旗帜"
		},
		{
			"post_id": 358,
			"title": "在这个90%是散民的股市中，没有什么比信心更重要。",
			"date_published": 1468418813.066,
			"body": "Blog post body"
		},
		{
			"post_id": 357,
			"title": "美国使用一贯的策略，发动地缘政治危机。也就是这次的在韩国部署美国萨德导弹系统、和菲律宾南海仲裁事件。让国际资本看到中国地缘政治的风险，进而阻止资金流入中国",
			"date_published": 1468418735.26,
			"body": "Blog post body"
		},
		{
			"post_id": 356,
			"title": "在欣泰电气造假上市将被强制退市消息出来后，市场资金偏好开始迅速向蓝筹股转移，预计这种结构性变化的趋势还将进一步持续",
			"date_published": 1468417232.595,
			"body": "Blog post body"
		},
		{
			"post_id": 355,
			"title": "如果我们还是像当年处理南海撞机事件，或者南斯拉夫大使馆被炸事件一样，自认倒霉，那就是失败了！比南海政策还要失败。所以我们必须要短时间内给韩国一个有杀伤力的制裁措施，要让它付出惨痛代价。",
			"date_published": 1468415595.318,
			"body": "Blog post body"
		},
		{
			"post_id": 354,
			"title": "萨德导弹危机已经来临。我们眼下能做的就是如何在短时间内惩治韩国，让它付出巨大的代价。韩国和中国的贸易往来占其进出口总量的第一位，如果能伤害这个根基，至少把安装萨德导弹的城市的中韩经济往来封锁掉，那么将是对韩国一个严重的打击。这才是我们面对长久伤害的一个反制措施。",
			"date_published": 1468415520.254,
			"body": "Blog post body"
		},
		{
			"post_id": 353,
			"title": "中国和东盟十国之间，出现一个两个“古巴”也是可以的",
			"date_published": 1468415149.451,
			"body": "Blog post body"
		},
		{
			"post_id": 352,
			"title": "斗争之后的互相妥协。中国的妥协和美国的妥协意义是不一样的。中国的妥协就是真正崛起的开始，最后胜利的起点，只是早晚一点而已。而美国的妥协实际上标志着它真正衰落的开始。",
			"date_published": 1468415037.281,
			"body": "Blog post body"
		},
		{
			"post_id": 351,
			"title": "美国可以提交到安理会讨论，因为刚好日本是它的主席国。七月份，是一个非常敏感的时期。\n",
			"date_published": 1468414911.881,
			"body": "Blog post body"
		},
		{
			"post_id": 350,
			"title": "避免零和博弈的前提下寻求利益的平衡，中国要让渡一定的空间，比如照顾菲律宾渔民在黄洋岛附近的捕鱼权。这个是最考验智慧的可能。到目前为止中美还保留着广泛的接触渠道和沟通渠道，这种沟通渠道就有希望化解危机。",
			"date_published": 1468414879.781,
			"body": "Blog post body"
		},
		{
			"post_id": 349,
			"title": "美国海军开进去了12海里领海，那么中国捍卫主权，这个冲突就必然产生。不管是局部还是全面战争，结果只有一个，就是灾难。",
			"date_published": 1468414841.589,
			"body": "Blog post body"
		},
		{
			"post_id": 348,
			"title": "一个既成的事实是，美国已经向南海派出庞大的军事力量，同时中国近日派出了三大海军舰队在南海进行了实兵演练。怎么样减缓出现大面积战争的风险？我想两国的领导人都有这种要求。接下来的局势演变就有如下四种可能。",
			"date_published": 1468414758.54,
			"body": "Blog post body"
		},
		{
			"post_id": 347,
			"title": "很多人认为只要我们自己想和平崛起就可以和平崛起。这个观点显然是错误的。",
			"date_published": 1468414668.143,
			"body": "Blog post body"
		},
		{
			"post_id": 346,
			"title": "总共16次新老大国交替，其中12次发生了战争。新兴国家跟守成国家之间的矛盾和冲突，是很自然的现象，我们不应当感觉到惊讶。不过，同时，我们也要注意到，新兴国家的崛起也不是说一定会发生战争，毕竟还有4次是没发生战争的。如果策略好，战争也是可以避免的。",
			"date_published": 1468414615.491,
			"body": "Blog post body"
		},
		{
			"post_id": 345,
			"title": "围绕南海问题产生的斗争其实是很正常的，是地缘政治变迁的一个现象。发生这种事情不仅正常，并且是可以预期的。很多人对现在的这种状况感觉非常惊讶，主要是因为我们过去对国际政治现实的认知有错误，期望有错误。",
			"date_published": 1468414568.408,
			"body": "Blog post body"
		},
		{
			"post_id": 344,
			"title": "韩国国防部今天（13号）下午公布了美韩部署“萨德”反导系统的选址结果。对此，中国外交部发言人陆慷在今天（13号）的例行记者会上表示，中方坚决反对美韩在韩国部署“萨德”反导系统。",
			"date_published": 1468414398.977,
			"body": "Blog post body"
		},
		{
			"post_id": 343,
			"title": "中国6月进口同比（按美元计）-8.4%，预期-6.2%，前值-0.4%；6月出口同比（按美元计）-4.8%，预期-5%，前值-4.1%。按美元计，中国上半年出口同比下滑7.7%，进口下滑10.2%。中国6月贸易顺差（按美元计）481.1亿，预期456.5亿，前值499.8亿。\n",
			"date_published": 1468414329.196,
			"body": "Blog post body"
		},
		{
			"post_id": 342,
			"title": "当你等到了一个时刻，你成为或者几乎成为了唯一的出价者，就是等到了最便宜的时候，这就是逆向投资的时机了",
			"date_published": 1468412411.358,
			"body": "Blog post body"
		},
		{
			"post_id": 341,
			"title": "今天下午外媒就报道称“国务院总理李克强在欧盟-中国峰会的间隙暗示,中国第二季度经济增速可能接近于第一季度6.7%的水平,并补充道,中国的经济基本持稳”。这情况或许意味着周五的GDP数据很可能会达到预期，这将会对A股周五和下周走势起到进一步的正面驱动作用。",
			"date_published": 1468411691.977,
			"body": "Blog post body"
		},
		{
			"post_id": 340,
			"title": "在场内存量资金不足的情况下，能不能复制2012年底开始的创业板指数的独立走势，这个可能还是非常大的",
			"date_published": 1468411332.066,
			"body": "Blog post body"
		},
		{
			"post_id": 339,
			"title": "意义重大，那就是在下午14:16分左右，ih1607报2200点，而此时上证50指数为2198点，虽然时间非常短暂，但是如果我没有记错的话，这是自2015年股灾1.0以来，期指报价首次高于现货指数，也就是出现了升水。",
			"date_published": 1468411234.049,
			"body": "Blog post body"
		},
		{
			"post_id": 338,
			"title": "有一点很明确了，大机构资金充裕，后面还有后手，换而言之，真要做起来，有些股票后面的一波可能比现在还要大。",
			"date_published": 1468410299.614,
			"body": "Blog post body"
		},
		{
			"post_id": 337,
			"title": "大级别的机构，现在参与的资金都不算太大，所以现在很灵活，真觉得行情要有机会，后面的资金一把就能进去，那才是走大行情的时刻。",
			"date_published": 1468410252.569,
			"body": "Blog post body"
		},
		{
			"post_id": 336,
			"title": "为什么这两天很多人对补缺口这么敏感，归根到底就是最近的仓位重啊，稍微一个小波动，都是成百上千万的幅度。但真正大资金，这种行情不会重仓去参与的。因为重仓参与，那出来非常不容易，而当前的经济环境、政策因素和2014年下半年完全不同，当时可以满仓去博，但现在就不行",
			"date_published": 1468410200.547,
			"body": "Blog post body"
		},
		{
			"post_id": 335,
			"title": "今天行情走到下午，几个业内经验丰富的人都紧张起来了，好几个朋友说今天的走势太明显了，早上冲高补掉3066缺口然后就一下子失去了目标，不知道往哪走了。这种失去目标是很危险，因为多头失去了进取心",
			"date_published": 1468409716.967,
			"body": "Blog post body"
		},
		{
			"post_id": 334,
			"title": "解决内部问题是首要的，包括各种经济问题。内部是根本。中国应该把重点重新放在内部。",
			"date_published": 1468409659.31,
			"body": "Blog post body"
		},
		{
			"post_id": 333,
			"title": "一带一路。如果我国要强硬地推行这个战略，冒然进入西方经营几个世纪之久的海洋战略辖区，以及地缘政治风险极大的中亚地区，则未来面临的冲突可能十分激烈。关键是投入了很多，树了一大堆对手甚至敌人，自己还捞不到什么。现在，这种前景已经越发明显了。\n",
			"date_published": 1468409518.522,
			"body": "Blog post body"
		},
		{
			"post_id": 332,
			"title": "站在俄国前面，和美国形成对抗关系，实在是凶多吉少",
			"date_published": 1468409472.764,
			"body": "Blog post body"
		},
		{
			"post_id": 331,
			"title": "美日韩已经日益形成紧密的同盟，对抗中国的发展",
			"date_published": 1468408942.659,
			"body": "Blog post body"
		},
		{
			"post_id": 330,
			"title": "大盘走到目前这个阶段，投资者会慢慢的醒悟过来，然后不断加大投入，或者前期踏空的帐户开始大举买进.而这就是属于后知后觉了，或者用一些人的观点来说，是\"右侧交易\".",
			"date_published": 1468408049.53,
			"body": "Blog post body"
		},
		{
			"post_id": 329,
			"title": "大金融短期用资金催一下没问题，但是要想走中期大行情必须看宏观基本面，而宏观基本面并不支持大金融中线立即走强，因此，冲关拔寨用一下下没问题，但是持续力不行",
			"date_published": 1468407874.726,
			"body": "Blog post body"
		},
		{
			"post_id": 328,
			"title": "尽管短线存在冲过3100的可能性，但是要引导3100点之上的套牢筹码峰下移，必然还有区间震荡的过程，因此，冲高后回落到上箱体依然是大概率事件",
			"date_published": 1468407807.181,
			"body": "Blog post body"
		},
		{
			"post_id": 327,
			"title": "越是别人兴奋的时候越需要冷静，思考一下行情之初我们的逻辑判断是否需要改变",
			"date_published": 1468407739.457,
			"body": "Blog post body"
		},
		{
			"post_id": 326,
			"title": "对中线投资者，则利用难得的金种子黑天鹅事件带来的板块调整机会，逢低分批买入防御板块中的白酒、家电",
			"date_published": 1468407666.073,
			"body": "Blog post body"
		},
		{
			"post_id": 325,
			"title": "继续认为9月前大盘都是可看好的，给投资者10%盈利的蜜月期的概率很大",
			"date_published": 1468407633.728,
			"body": "Blog post body"
		},
		{
			"post_id": 324,
			"title": "大盘将进入调整，我们预计周四大盘将走倒N，收出阴线",
			"date_published": 1468407537.91,
			"body": "永远从一个确定的预期开始；\n- 如果对，直接盈利；\n- 入股错，实施预先制定的策略；"
		},
		{
			"post_id": 323,
			"title": "根据今年一季报，公募基金对于消费股的仓位只有18%，其中白酒业绩出现回升，虽然上半年涨幅不小，但截至一季报，公募对于白酒的仓位只有2%，而历史上标配水平大概在6%左右，即使中报仓位升至4%，也还有2%以上的加仓空间，所以，我们继续看好白酒板块",
			"date_published": 1468407339.801,
			"body": "本计算体现的方法；现在已经是3季度"
		},
		{
			"post_id": 322,
			"title": "开弓没有回头箭，虽然道路是曲折的，但经过反复震荡，向上突破是必由之路！",
			"date_published": 1468407296.098,
			"body": "Blog post body"
		},
		{
			"post_id": 321,
			"title": "今天指数最高点3069和四月份的高点3097较为接近，而卖盘就在此时涌出，显然目前已经进入了空放重地，指望一举拿下3097是不实际的",
			"date_published": 1468407254.934,
			"body": "Blog post body"
		},
		{
			"post_id": 320,
			"title": "主板由强转弱，创业板由弱转强，跷跷板效应表明资金依旧是存量运作",
			"date_published": 1468407189.625,
			"body": "Blog post body"
		},
		{
			"post_id": 319,
			"title": "创业板强势崛起，攻击2314点年线，二线蓝筹股退潮",
			"date_published": 1468407151.854,
			"body": "Blog post body"
		},
		{
			"post_id": 318,
			"title": "在金种子酒出乎意料地发布二季度业绩大幅下滑预告，并一度跌停带动下，整个白酒板块走弱，消费品板块遇冷",
			"date_published": 1468407121.468,
			"body": "Blog post body"
		},
		{
			"post_id": 317,
			"title": "沪市平开，瞬间产生最低点3048，接着券商保险快速拉升，创出反弹新高3069，该点也封闭了缺口3058-3066，之后进入震荡整理，午后万科突然90度拉升，联通飙升助阵，但是高点比早盘低2点，为3067，于是抛盘涌出，",
			"date_published": 1468407069.023,
			"body": "Blog post body"
		},
		{
			"post_id": 316,
			"title": "按照沪指月线的结构，现在明显在主升三浪中。一浪的长度是3097-2638=459点，那么三浪的低点是2780点，那么按照最低三浪与一浪等长的目标位是2780+459=3239点，那么短线震荡后沪指至少要看到那里。",
			"date_published": 1468406969.578,
			"body": "Blog post body"
		},
		{
			"post_id": 315,
			"title": "高度",
			"date_published": 1468406900.515,
			"body": "投资需要 - \n- 世界的高度\n- 国家的高度\n- 领导的高度\n- 战略的高度"
		},
		{
			"post_id": 314,
			"title": "July 12th lesson - 误过了一个极好的买的机会",
			"date_published": 1468341127.74,
			"body": "这是政治觉悟还不够高，缺乏预先仔细思考判断"
		},
		{
			"post_id": 313,
			"title": "安倍“二度上台”：多头吓傻 日元惨跌不止",
			"date_published": 1468339401.415,
			"body": "Blog post body"
		},
		{
			"post_id": 312,
			"title": "中美博弈之下A股走向大牛市？",
			"date_published": 1468339317.163,
			"body": "Blog post body"
		},
		{
			"post_id": 311,
			"title": "大家要坚定看好大势，坚定做多",
			"date_published": 1468339209.763,
			"body": "Blog post body"
		},
		{
			"post_id": 310,
			"title": "目前格局 --- 白酒、煤炭、有色、航运、医药五朵金花为代表的二线蓝筹股牛市",
			"date_published": 1468339134.767,
			"body": "Blog post body"
		},
		{
			"post_id": 309,
			"title": "周三预测 - 大盘周三开始进入新的整理区，整理范围为3028---3078，整理期间以白酒为代表的大消费概念股将再度走强，整理结束还会形成跳水，接着依旧会国家队暴力拉指数，长阳再竖起",
			"date_published": 1468339070.624,
			"body": "Blog post body"
		},
		{
			"post_id": 308,
			"title": "9月前大盘都属于蜜月期，我们认为目标位为3200的观点不变，这从收盘后五步循环波段HK来看，大盘趋势上涨形成，采取的是台阶上上行",
			"date_published": 1468338979.797,
			"body": "Blog post body"
		},
		{
			"post_id": 307,
			"title": "国家队救市救成了大盘庄家！其操作手法就是，拉权重拉出指数长阳，然后派发，使得指数整理五六天（最长的是11天），期间低吸后再进行拔高，再拉指数长阳，如此反复，使得国家队最终筹码减少，成本降低，盈利远跑赢大盘",
			"date_published": 1468338928.054,
			"body": "Blog post body"
		},
		{
			"post_id": 306,
			"title": "大盘放量接近3000亿，指数即将突破3050，距离上方缺口3060-3080缺口只有一步之遥",
			"date_published": 1468338861.504,
			"body": "Blog post body"
		},
		{
			"post_id": 305,
			"title": "继白酒黄金后，今天领涨扩散到航空、煤炭、钢铁、券商、食品，周期性品种和防御性品种成为赚钱的集中地",
			"date_published": 1468338842.061,
			"body": "Blog post body"
		},
		{
			"post_id": 304,
			"title": "创业板大幅跳水，盘中大跌近2%，使得沪指打出最低点2984，之后国家队明显进场，老手法再现，拉抬民航、石油、煤炭有色，尤其午后开盘，银行保险券商集体拉升，建设银行和中国银行均创2638点以来的新高",
			"date_published": 1468338800.145,
			"body": "Blog post body"
		},
		{
			"post_id": 303,
			"title": "中药材品种大涨 步入新一轮上涨周期：康美药业（600518）、香雪制药（300147）等",
			"date_published": 1468338662.834,
			"body": "Blog post body"
		},
		{
			"post_id": 302,
			"title": "海牙法庭仲裁后中美对抗的可能性，届时，日元的避险属性很可能卷土重来",
			"date_published": 1468327126.188,
			"body": "Blog post body"
		},
		{
			"post_id": 301,
			"title": "中国在卖出美元，买入欧元，换取德国、法国对中国南海主权的沉默！",
			"date_published": 1468327080.792,
			"body": "Blog post body"
		},
		{
			"post_id": 300,
			"title": "9月G20会议",
			"date_published": 1468327010.916,
			"body": "Blog post body"
		},
		{
			"post_id": 299,
			"title": "值得深度关注，或许是个转折点呢。很重要的事件，应该异常警惕，股市却异常拉高",
			"date_published": 1468326210.977,
			"body": "Blog post body"
		},
		{
			"post_id": 298,
			"title": "Psychology of Investment",
			"date_published": 1468322776.657,
			"body": "http://127.0.0.1:43110/1Goe9ywdAwTso2usZWyhxXr1SAeD8Pfmm7"
		},
		{
			"post_id": 297,
			"title": "\n低估值蓝筹股集体井喷",
			"date_published": 1468322619.322,
			"body": "Blog post body"
		},
		{
			"post_id": 296,
			"title": "交易的点位 - 九转序列理论",
			"date_published": 1468256972.206,
			"body": "今天下午出现了调整，这个调整是带30分钟的顶部结构的，盘中我确定了这个高点，但不是在最高点，我给出高点的地方是13:10，而最高点在20分钟后的13:30。但从交易的角度，我最近一直是这样说的，防止日线的九转序列的高9，必须找确定性的高点。上周一我就确定了周四出高9，所以上周四全天、上周五全天我都在寻找这个确定性的高点，但没有找到，还包括今天上午。\n\n\n没有确定性的高点，可能就不操作了，但今天下午的13:10的时候有三个条件形成，第一是30分钟钝化了，这是核心因素，即30分钟结构形成的前提条件已经完成；第二15分钟线出现了九转序列的高9，我多次建议大家关注九转序列，这是个非常牛X的择时策略；第三是盘口出现了5分钟高点（可以到www.ktkt.com 下载交易师经典版，免费，看各周期各品种的九转序列）。\n\n\n当时30分钟线只是钝化了，还没有形成结构，盘中的高点选择属于左侧交易，虽然不是最高点，但这个高点的确定性很强，这就符合了我这一段时间一直强调的，日线的九转序列高9要找一个确定性的盘中高点才行，13:10的确定性要超过13:30，也就是说你可以选择在13:10左侧卖出，也可以选择在14:30右侧卖出，但你不能13:30最高卖出，因为你没有卖出的依据。\n\n\n之后，形成了持续性的下跌，但对于下跌的性质，我们依旧没有太大的改变，跟昨天一样，这是上升途中的某一波调整，所有的调整都是买入时机。\n\n\n要坚定看多。\n"
		},
		{
			"post_id": 295,
			"title": "New blog post",
			"date_published": 1468256859.734,
			"body": "今天下午出现了调整，这个调整是带30分钟的顶部结构的，盘中我确定了这个高点，但不是在最高点，我给出高点的地方是13:10，而最高点在20分钟后的13:30。但从交易的角度，我最近一直是这样说的，防止日线的九转序列的高9，必须找确定性的高点。上周一我就确定了周四出高9，所以上周四全天、上周五全天我都在寻找这个确定性的高点，但没有找到，还包括今天上午。\n\n\n没有确定性的高点，可能就不操作了，但今天下午的13:10的时候有三个条件形成，第一是30分钟钝化了，这是核心因素，即30分钟结构形成的前提条件已经完成；第二15分钟线出现了九转序列的高9，我多次建议大家关注九转序列，这是个非常牛X的择时策略；第三是盘口出现了5分钟高点（可以到www.ktkt.com 下载交易师经典版，免费，看各周期各品种的九转序列）。\n\n\n当时30分钟线只是钝化了，还没有形成结构，盘中的高点选择属于左侧交易，虽然不是最高点，但这个高点的确定性很强，这就符合了我这一段时间一直强调的，日线的九转序列高9要找一个确定性的盘中高点才行，13:10的确定性要超过13:30，也就是说你可以选择在13:10左侧卖出，也可以选择在14:30右侧卖出，但你不能13:30最高卖出，因为你没有卖出的依据。\n\n\n之后，形成了持续性的下跌，但对于下跌的性质，我们依旧没有太大的改变，跟昨天一样，这是上升途中的某一波调整，所有的调整都是买入时机。\n\n\n要坚定看多。\n"
		},
		{
			"post_id": 294,
			"title": "股票市场必须读懂政策方能长存，政策是息息万变，股市也同样会息息万变。此一时彼一时，与时俱进。",
			"date_published": 1468256290.277,
			"body": "Blog post body"
		},
		{
			"post_id": 293,
			"title": "股市龙穴理论",
			"date_published": 1468247060.374,
			"body": "股市龙穴。沪指2015年7月中旬以来形成的较长期收敛下降通道，其上轨为2015年7月24日4184点与2015年12月23日3684点两高点连线(目前位于3030点)上下，这是“天线”，另外2014年以来形成长期重要支撑线，即2014年7月11日2033点、2016年1月27日2638点、2016年5月26日2780点等低点连线（目前位于2850点上下），这是“地线”。\n\n     这“天线”和“地线”目前收敛到顶端区，为天地线交感的区域，为股市“穴位”。\n\n    这天地线交感区域，未来如果大盘有效跌破“地线”，则为“死穴”，如果突破“天线”（3000-3100点压力区），则为“龙穴”，而这天地线于今年8月中旬左右交汇，为“龙穴”中的龙穴,估计7月底前最迟8月上旬要选择突破方向。\n\n     本周一沪指涨至3022点,接近“天线”而受压,未来有待有效突破。\n\n     从今年5月31日以来成交量比5月放大，特别是本周以来明显放大，并在本周持续突破沪市成交量近一年来所形成的下降趋势线看，在“天线”和“地线”收敛到顶端的区域，生机有所焕发，因而目前大盘进入“龙穴”，酝酿向上突破和形成中期涨势的机会较大，而大盘月线指标处超卖区，中线仍有多头能量持续释放的基础。\n\n     年初时我指出，猴年五行“火金”两旺，而“金”为财方, “火金”股存在机会, 特别是把握“金”股。火的行业或概念为科技、电子、网络、锂电池、照明、煤炭、电力、能源等，以及次新股;金的行业为黄金、有色金属、钢铁、机械、金融等。航天军工有“火金”两属性。\n\n     事实上“火金”股猴年以来不少形成趋势性上涨,特别是黄金、有色等“金”股成为涨幅较大的品种。\n\n    今年6月和7月为夏“火”月，8月和9月为秋“金”月，“金”为“火”之“财”, 金喜火炼而成器, 近期“火金”股成为市场反复炒作的对象。\n"
		},
		{
			"post_id": 292,
			"title": "大盘股是不是最后一涨？小盘股是不是要开始下跌？这是关键。",
			"date_published": 1468246306.286,
			"body": "Blog post body"
		},
		{
			"post_id": 291,
			"title": "这波反弹之后，下跌新动力弄不好就是创业板的退市潮引发的估值回归。（还没开始，今天动静都没有）",
			"date_published": 1468246144.19,
			"body": "Blog post body"
		},
		{
			"post_id": 290,
			"title": "3000点，大盘股不是最后一涨，因为根本就没怎么上涨，这样的反弹，就算涨完了，接下来的下跌也不会是大暴跌",
			"date_published": 1468245858.605,
			"body": "Blog post body"
		},
		{
			"post_id": 289,
			"title": "中庸选买股时间，操作的时点不在暴涨暴跌的档口，而是在交易从由做空优势转向做多优势的转折区间上",
			"date_published": 1468245362.002,
			"body": "Blog post body"
		},
		{
			"post_id": 288,
			"title": "股市的中庸之道",
			"date_published": 1468245219.858,
			"body": "中国人讲究中庸之道，学会中庸在股市里做起来会更轻松，更容易。比如人家说投资者为什么买股票，只有两个原因，一是买未来的发展，一是买现金奶牛。你走极端就不容易赚钱，就像银行股业绩一直好，但股价一直低，原因就是看不到发展，所有上市公司，一年净利润半数是银行。钱都给他们赚了，你还指望银行有啥大发展？所以只能做现金奶牛，分红回报要和理财产品比，自然股价高不起来，买银行会被磨蹭死。同样很多题材股半毛钱业绩没有，但只要说个大好前景，炒起来就很凶，但凶归凶，调整起来也不含糊，在这种股票上亏大钱的也很多。但中庸一点，我选择既有业绩又有成长的股票，那基本没有套死人的。 "
		},
		{
			"post_id": 287,
			"title": "唯一必须认定的，现在是熊市，可能转为阴跌概率非常高，那么做最坏的打算应对它那就是最安全的方式！老狐狸其实是任何时候都做最坏的打算！",
			"date_published": 1468244712.123,
			"body": "Blog post body"
		},
		{
			"post_id": 286,
			"title": "即使是市场会有一次大规模集体唱多，人人都追涨的情况出现，我又怎能判定不是最后的疯狂呢？\n",
			"date_published": 1468244682.604,
			"body": "Blog post body"
		},
		{
			"post_id": 285,
			"title": "整个指数在极小的空间波动，它酝酿两种可能：1、大反弹；2、阴跌！我从来不认为自己有能力确认它会大反弹还是会阴跌，我的做法一向极其简单：在历史性转折点上，搞不清就闪人。宁可错过不可做错",
			"date_published": 1468244646.353,
			"body": "Blog post body"
		},
		{
			"post_id": 284,
			"title": "　经过三轮崩盘，今年年初我就说暴跌4.0不存在，但是，未来市场一定会有阴跌的过程。何时出现阴跌的大趋势，现在不得而知。 ",
			"date_published": 1468244599.069,
			"body": "Blog post body"
		},
		{
			"post_id": 283,
			"title": "某人谈老狐狸",
			"date_published": 1468244269.072,
			"body": "老狐狸在牛市或部分时期盈利干不过韭菜是正常的，他们操作区别是：韭菜什么都敢追，老狐狸一般 持仓一类个股吃到相对高位走人。还有，真正的老狐狸一年出手交易次数不会超过2—3次（有时短线交易除外，因为动用资金量占比不高；基本都是赚个差价，是图个乐子），我见过的翻几十倍以上从散户成长为超级大户的老狐狸真的没有几个一年出手超过3次的，极少。\n\n为什么老狐狸出手次数很少？上过的当太多，找到一个标的前期考察要好几个月，最少1—2个月看盘面资金建仓的力度，然后基本面分析，牢牢把握大股东或资金的战略意图，整个分析过程3—4个月是正常，一旦持仓重仓敢吃到快喷出来。最难得是等买点，我现在看中一只个股15元，我能耐心的等他跌倒5元，很简单二级市场原有资金在减仓，而大股东还要拿公司说事。（资金减仓的我也看好，因为我更看好大股东的战略意图）。我看好两家公司资金长线建仓的，不跌我根本不会买它，既然是长线资金建仓，必然会借势大洗盘，不洗盘我进去它再洗我启不是累死。账面亏25%抗洗盘会压垮人的，多年的脑袋别裤腰带经验告诉我，凡是加重仓一定要对方杀跌洗盘，不杀跌进去会好累"
		},
		{
			"post_id": 282,
			"title": "\n\n\n江苏银行发行市盈率是7.64倍，净资产发行，上市后至少至少会翻倍，说不定还更多！也就是在15倍市盈率以上！\n",
			"date_published": 1468243464.143,
			"body": "july 20th is the day of going ipo of this bank"
		},
		{
			"post_id": 281,
			"title": "股市观点 - 反观股市中一些人（如恶意空头、金融大鳄等）的恶行，将最具投资价值的优质银行蓝筹股竟然打到4、5倍市盈率，净资产以下，血洗广大小散，它们一定会遭到报应！\n",
			"date_published": 1468243396.998,
			"body": "right or wrong?"
		},
		{
			"post_id": 280,
			"title": "煤炭",
			"date_published": 1468236442.455,
			"body": "煤炭。时值盛夏，用电高峰，南方水灾等等因素，火电成为了主要的发电方式，各大电场对于动力煤的需求进入旺季，各大港口和火电发电场都面临着补库存的需求，直接推升了夏季动力煤价格的走高。由于，用电高峰仅仅是短期事件，且动力煤价格已经从去年底上涨了50%以上，连续大涨概率不大，但是相关煤炭板块不排除还有补涨的空间。"
		},
		{
			"post_id": 279,
			"title": "黄金即有商品属性又有金融属性，此时凸显的是金融属性。由于黄金还有商品属性，从金融属性会向商品属性传导，黄金现货价格的大涨，必然引发生产企业的利润增厚以及库存价值重估。",
			"date_published": 1468236341.059,
			"body": "Blog post body"
		},
		{
			"post_id": 278,
			"title": "只要还有领涨股没表现够，板块炒作就不会停止！国庆中秋是炒作的参考时间点。",
			"date_published": 1468235999.398,
			"body": "Blog post body"
		},
		{
			"post_id": 277,
			"title": "周二，我们认为是大家调仓，逢低介入白酒等防御股的最佳时机，尤其是尚在底部的仅有的两只白酒股顺鑫农业、口子窖",
			"date_published": 1468235865.71,
			"body": "Blog post body"
		},
		{
			"post_id": 276,
			"title": "有消息称中国养老基金即将入市，规模为2万亿元的资金蓄势待发，显然这些资金也是避险为主，防御为主，毕竟养老金是大家的养命钱，所以，证监会出台严格退市制度，显然是为养老金等投资资金铺路的，而这类资金入市，那么，防御品种将更加稀缺",
			"date_published": 1468235374.871,
			"body": "大盘周二还将调整，尤其是后知后觉者周二会跟风杀跌题材股，使得创业板跌幅会加大，但是，以尚处底部的顺鑫农业、口子窖为代表的白酒股，将成为稀缺品种被市场聪敏的资金盯上，而券商板块不出意外，则会出来护盘，所以，预计周二大盘会走出V字形态，全天支撑在2975，压力在3012，收盘为类T锤头小阳；2、大盘将继续围绕3000点上下波动，3000点不会那么容易站上，但是，主力攻击到这个位置，也不会轻易放手，2975---3025这50点将是为蓄势进行的波动范围，最后大盘将向上突破 ，我们认为3200点是本波的目标；3、监管越来越紧，理性投资将逐步回归，欣泰电气强制退市开了个头，后面会有更多的不良公司受到监管，这迫使资金转入价值投资，白酒行业经过反腐考验后，目前消费市场上价量齐升，下半年国庆中秋又是白酒消费的黄金时期，也是历来白酒股价值重估的法定季，我们看好以白酒为代表的蓝筹股行情，我们认为欣泰电气强制退市是A股投资新时代的开启！"
		},
		{
			"post_id": 275,
			"title": "中国电信集团公司原董事长常小兵严重违反政治纪律，干扰中央专项巡视。利用职务便利在干部选拔任用中为他人谋取利益并收受财物，利用职权和职务上的影响为亲属的经营活动谋取利益。涉嫌受贿犯罪。决定给予其开除党籍、公职处分，涉嫌犯罪问题移送司法机关。",
			"date_published": 1468234337.027,
			"body": "Blog post body"
		},
		{
			"post_id": 274,
			"title": "国资委：中国国旅整体并入中国港中旅集团公司",
			"date_published": 1468234230.431,
			"body": "Blog post body"
		},
		{
			"post_id": 273,
			"title": "关于量的思考",
			"date_published": 1468162044.974,
			"body": "有个谚语，天量见天价，地量见地价。这句话是有前提的，天量对实体涨停妖股是不适合的，相反的是妖股的缩量反而是天价，比如最近的科泰电源（发现了，错过了的遗憾）地量必须是前几天放量下跌再缩量。\n　　一直很喜欢庄股，就以新亚制程这庄股举例。\n　　该股的天量，几次天价的量都是差不多的，看横的黄线。\n　　还有横盘洗盘的缩量，看斜的黄线。\n　　该股一般调整2个月之后都会来一波，每次涨幅都不是很大，涨的起始位置是5，10线向上发散，要主升浪，必须5,10,20,30四线粘合向上发散，几乎每个牛股都是类似的情形，妖股除外，这也就是前面帖子提到的大家好才是真的好的来源，最近买进去的都赚钱了，这时候万众一心，对手盘比较少（当然妖股必须换手大，因为妖股都是滚动操作，所以量能决定高度，必须有对手盘），庄股不同，因为庄有低价筹码，所以换手都不会太大。 \n\nhttp://bbs.tianya.cn/post-stocks-1752328-3.shtml"
		},
		{
			"post_id": 272,
			"title": "规律求证3 --- 高开假阴线的规律。\n　　高开假阴，最好是昨天第一个涨停，第二天涨停开板，同时，必须不能是尾盘开板，尾盘时候，大家临近收盘，大家都泡妞去了，没怎么关注，所以此时开板，意味着主力出逃。 ",
			"date_published": 1468161701.624,
			"body": "　　以深深宝A为例，买入理由有5点：\n　　1，股性好\n　　2，5,10,20,30 4线粘合向上发散\n　　3，开板时间午盘\n　　4，开板处有跟大红色量柱\n　　5，第二天高开 "
		},
		{
			"post_id": 271,
			"title": "规律求证2 ---- 券商股的连续涨停，经常是小牛市的开始，所以买入是很保险的。请验证对不对。",
			"date_published": 1468161502.691,
			"body": "Blog post body"
		},
		{
			"post_id": 270,
			"title": "规律的观察 - 举例1：假如是涨停第二天开盘买入，盈利的几率是多少？",
			"date_published": 1468161347.96,
			"body": "Blog post body"
		},
		{
			"post_id": 269,
			"title": "数字3 ---- 这个在股市很有用，但凡股票3天收盘价不创新高，一般就跌了，可能跟人性有关系",
			"date_published": 1468161025.558,
			"body": "Blog post body"
		},
		{
			"post_id": 268,
			"title": "有人说： 股性一定要好，也就是最近3个月内，曾经连续2个实体涨停",
			"date_published": 1468160939.82,
			"body": "agree or disagree"
		},
		{
			"post_id": 267,
			"title": "股价上涨的原动力是资金推动，均线，指标都是滞后的",
			"date_published": 1468160743.879,
			"body": "Blog post body"
		},
		{
			"post_id": 266,
			"title": "大多数情况下，低买高卖是唯一挣钱的途径。但不是唯一途径。",
			"date_published": 1468160393.526,
			"body": "Blog post body"
		},
		{
			"post_id": 265,
			"title": "炒股的精髓在于炒，跟炒菜是一样的。\n　　资金驱动，才是股票上涨的原动力。\n　　龙头，才是对的方向。",
			"date_published": 1468160355.848,
			"body": "Blog post body"
		},
		{
			"post_id": 264,
			"title": "7月12日，菲律宾诉中国南海仲裁案结果将出炉，外界普遍认为，该仲裁案将对中国不利。美国双航母耀武扬威，中国也高调宣布三大舰队在西沙举行军演。点评：习总都说了，中国人不信邪不怕邪，不惹事也不怕事。地区局势紧张，下周军工股有望梅开二度。关注中国重工、亚星锚链、 海兰信、航天电子、宗申动力等。\n",
			"date_published": 1468159461.165,
			"body": "Blog post body"
		},
		{
			"post_id": 263,
			"title": "中秋旺季或达950元 --- 近期，贵州茅台一批价大幅上涨，引发全国各地“涨声一片”。短短两周，贵州茅台经典产品53度飞天茅台每瓶从819元涨价40-60元，南方多个地区涨至890元，安徽涨至860-870元，上海涨至880元。机构预计中秋旺季来临前一批价可能会超过市场目前预期900元达到930-950元。\n",
			"date_published": 1468159265.058,
			"body": "Blog post body"
		},
		{
			"post_id": 262,
			"title": "“2016-秋季攻势”步入战略性建仓（6月20日～7月20日）阶段",
			"date_published": 1468155677.283,
			"body": "Blog post body"
		},
		{
			"post_id": 261,
			"title": "午休期间，同事们一起聚在公司一台电视机前看足球直播。不爱看球的女同事在一边睡午觉，当解说员大声喊到“射了！射了！”\n女同事朦朦胧胧说了一句“别射里边……”\n",
			"date_published": 1468155574.53,
			"body": "Blog post body"
		},
		{
			"post_id": 260,
			"title": "只有经历过地狱般的折磨，才有征服天堂的力量",
			"date_published": 1468154960.545,
			"body": "well, be careful about this thing - it is romantic thinking, but not things you should take too seriously and definitely not a thing to materialize. \n\ni put this statement here just for entertainment of the mind."
		},
		{
			"post_id": 259,
			"title": "没有不好的股票，只有“悲惨的操作”。",
			"date_published": 1468154835.231,
			"body": "Blog post body"
		},
		{
			"post_id": 258,
			"title": "person of some interest - 狗蛋",
			"date_published": 1468154600.965,
			"body": "狗蛋，狱名，38了。羁押受审2年余。 2006年6月20日晚17:00走出监所大门。夕阳西照，自由了，但一无所有。闲散月余，囊中羞涩。卖菜大姐说：帅哥，大葱要涨10倍。胖嫂说：瘦猴，股票要涨100倍。糟妻说：死人，儿子的择校费靠你了。儿子说：犯人，我也能吃德克士了吧。翻翻《刑法》，股场？即不偷也不抢；杀场?即不打人也不杀人. 真的？绝不犯法，狗蛋来了。 确定行股目标，10年，就10年，盆满钵满，满载而归，归心思家，家有笑脸。抱着梦想,狗蛋来了。狗蛋期盼:行股之途充满快乐、财富与希望。（狗蛋:goudan7@126.com） 2006-7-7 \n\nhis blog - \nhttp://blog.eastmoney.com/TONYJXM"
		},
		{
			"post_id": 257,
			"title": "下周解禁：240亿市值限售股下周上市",
			"date_published": 1468150268.368,
			"body": "this is a short term thing particular to chinese stock market. no need to worry over long run."
		},
		{
			"post_id": 256,
			"title": "我国银行业分成三、四个群体",
			"date_published": 1468149248.666,
			"body": "我国银行业分成三、四个群体。国有大行、股份行、城商行、信用社，这四类群体中后两类是风控能力最差的，贷款的随意性相对前两者大。如果做长期投资者，最好从国有大行和股份行里挑选标的，这是显而易见的，主要是规避系统性风险到来时引发的重大问题。\n  国有大行和股份行之间的差异，从现实生活中跟这些银行的接触中，也能看到问题。长期成长性前者不如后者，还是有原因的。排行前十的大型商业银行，对中国来说都是不可以随意撼动的，至少对中国经济来说都是系统性银行。从成长的角度看，工农中建，还是不如股份行。股份行的风控是可以的，摆弄过贷款的应该知道。\n  从企业经营效率角度看，四大行不如股份行，这是毫无疑问的。从创新的角度看，银行业都不足，这是因为监管较为严厉导致的。至于具体到每个银行，差异还是有的。\n  民生、兴业、招行、浦发，这四个银行各有特色。前面说了，大体上银行业整体差别并不是非常大，这是监管造成的。个别银行的差异，主要就是发展方向问题。股份行相对资产规模小，还有机会突出特色，大行已经没什么机会了。除此之外，再过多的强调各银行之间的资产质量差异，风控差异，其实是无意义的。\n  最保守的，效率最低下的，毫无疑问是四大行。不过，四大行的优势也是明显的，是中国经济的底线。一个底线，就不可能狂飙。对中国经济有信心，就可以提高风险偏好，没信心就可以守住底线。我，对守住底线没兴趣。 \n \n  "
		},
		{
			"post_id": 255,
			"title": "财务造假上市公司的共同特征基本都是上市两三年财务开始大幅度下降、变亏损",
			"date_published": 1468149102.29,
			"body": "Blog post body"
		},
		{
			"post_id": 254,
			"title": "top 10 of last week - very important, you should care about top 10 every week if not every day",
			"date_published": 1468148794.092,
			"body": "兴业矿业，有色股，国内外期货市场上白银、锌品种暴涨引爆了股价，本周3涨停，周涨46.46%夺魁。\n\n兰太实业，定增强化有色的工业金属纳产业，恰逢有色股本周风起云涌，外加陕西省筹建4核电项目消息公司地理位置临近的核电概念股的优势引发大炒作，本周1涨停，周涨37.91%位居第二。\n\n华钰矿业，有色股+次新股，含银矿，本周2涨停，周涨35.87%位居第三。\n\n金贵银业，有色股，涉银矿，本周3涨停，周涨34.15%位居第四。\n\n中色股份，有色股，含锌，本周2涨停，周涨32.99%位居第五。\n\n建新矿业，有色股，含锌，本周2涨停，周涨30.39%位居第六。\n\n中矿资源，有色股+周四晚间公布停牌因拟签署金额巨大的合同，有消息提前泄露的炒作之嫌，本周1涨停，周涨29.23%位居第七。\n\n信邦制药，医药股，本周的资金主要进攻板块之一，公司成为了龙头，本周涨27.86%位居第八。\n\n福达股份，主营汽车零部件 ，消息面和板块并无特别，技术突破走势引发追涨，本周1涨停，周涨27.7%位居第九。\n\n中金黄金，有色股，黄金范畴，本周2涨停，周涨27.06%位居第十。\n"
		},
		{
			"post_id": 253,
			"title": "当投资者集体发现自己的投资是在错误的配置，那会集体转折，从而形成巨大的资金流动，这股力量是根本无法阻挡的。",
			"date_published": 1468146287.605,
			"body": "根本无法阻挡的 - 意思是救也没用。"
		},
		{
			"post_id": 252,
			"title": "一个股票从40元跌到30元，别人和他说要跌了那么多不会再跌了，好在他没买，结果跌到了9元，然后他和他妈说了同样的话“跌了那么多，不会再跌了”，还好他妈也没听他的，之后又跌到3元多。",
			"date_published": 1468146121.938,
			"body": "Blog post body"
		},
		{
			"post_id": 251,
			"title": "如果周一市场确实拿欣泰电气的事情做文章，那必然增加这种试探的激烈程度，很可能一批股票先失控，然后在另一批股票的攻击中稳定人心，前者是短线的一个大风险，而后者则是立竿见影的机会",
			"date_published": 1468145994.442,
			"body": "Blog post body"
		},
		{
			"post_id": 250,
			"title": "市场的投资机构绝对不会把这事情只当一个孤立事件看待，又恰逢半年刚过，本身就要变，业内为这种事情炸锅，显然都想借题发挥。资金上出现一次大的转移，这种力量会非常巨大的。 ",
			"date_published": 1468145906.446,
			"body": "Blog post body"
		},
		{
			"post_id": 249,
			"title": "从欣泰电气1月4日警示财务造假有退市风险，到5月20日停牌，期间足足4个半月，要跑早有机会跑了，不跑怪谁？并且在这4个半月的时间里，欣泰电气的股价也并没有下跌，这是一种什么心态？造假怕什么，卖壳重组还能发财呢。",
			"date_published": 1468145420.076,
			"body": "Blog post body"
		},
		{
			"post_id": 248,
			"title": "机会，永远就在你身边。",
			"date_published": 1468136538.835,
			"body": "Blog post body"
		},
		{
			"post_id": 247,
			"title": "年年岁岁花相似，岁岁年年人不同。大盘股的春天要来了。股市直冲10000点不是梦。",
			"date_published": 1468136516.495,
			"body": "Blog post body"
		},
		{
			"post_id": 246,
			"title": "政府需要银行上市，所以接下去，媒体就会炮制银行价值。其实刚开始你可能不信，但是如果用事实来配合消息，那你可能就不得不信了。当某某电器连续三十个跌停板的时候，整个市场的眼球都会被吸引，于是舆论和媒体再添油加醋，那些先前不信的就都信了。如果江苏银行上市连续15个涨停板，你又作何感想？其他银行又岂会错过这么好的一个机会，况且他们的形态完全支持暴涨。",
			"date_published": 1468136498.706,
			"body": "Blog post body"
		},
		{
			"post_id": 245,
			"title": "这个时候，媒体和主流的观点都是又是七年大熊，可惜大多数人的想法总是错的。媒体和主流观点从来都是由政府操纵的，所以这些观点的目的总是由政府的目的决定的。政府当然不会想前期游资解套，所以就有了某某电子退市。",
			"date_published": 1468136422.38,
			"body": "Blog post body"
		},
		{
			"post_id": 244,
			"title": "国家牛会不会来？我认为，答案是肯定的。只是慢了一个节奏。此时，游资破产的破产，跑路的跑路，吓破胆的吓破胆，此时发动牛市总比游资都重仓低位买入等国家牛要好一万倍吧。",
			"date_published": 1468136368.217,
			"body": "Blog post body"
		},
		{
			"post_id": 243,
			"title": "在6月份发生股灾的时候，机构开始疯狂做空股指期货，为何？因为他要对冲下跌风险嘛。这客观上助长了股市的下跌。",
			"date_published": 1468136141.724,
			"body": "Blog post body"
		},
		{
			"post_id": 242,
			"title": "幻想一旦插上翅膀，猪也可以御风飞扬",
			"date_published": 1468136000.124,
			"body": "Blog post body"
		},
		{
			"post_id": 241,
			"title": "江苏银行就是银行上市的序幕。大幕刚刚拉开，好戏还在后头。不知道大家有没有注意点股灾暴跌对银行的冲击不大，去看看走势图就知道了，银行现在已经离前期高点不远了，正在等待爆发。当然，银行上市也是抓大放小，一些小银行，以后是要破产的",
			"date_published": 1468135871.97,
			"body": "Blog post body"
		},
		{
			"post_id": 240,
			"title": "均贫富要靠手腕的，分既得利益者的蛋糕要靠脑子。游资多是些迷信暴力，迷信权利，有钱无脑之人，靠着政商关系上位，这部分自己如果出逃，会严重危及中国外汇安全，而且到了外面也极容易被绞杀，既然这样，不如ZF宰了吃肉，肉烂在锅里总比被别人吃了强。 ",
			"date_published": 1468135789.348,
			"body": "Blog post body"
		},
		{
			"post_id": 239,
			"title": "需要：新兴产业上市。国家要避免经济危机，根本的是创新，开发新的生产力。而新兴产业就是这块基石。也就难怪创业板牛了三年多。 ",
			"date_published": 1468135707.975,
			"body": "Blog post body"
		},
		{
			"post_id": 238,
			"title": "A股从出生就注定是国企的人肉叉烧包。朱总理当年的国企改革也是吸股市的血完成的，吸血完成后股市就熊了五年。这次国企又要改革，改革最需要的是钱",
			"date_published": 1468135659.314,
			"body": "Blog post body"
		},
		{
			"post_id": 237,
			"title": "7月20日江苏银行开放申购，再加上欣泰电气退市，这两个标志性事件发生在一起绝非偶然。银行股大规模上市拉开了序幕。",
			"date_published": 1468135460.478,
			"body": "Blog post body"
		},
		{
			"post_id": 236,
			"title": "主板大概率是要跟着回调的，但性质不同，主板可以认为是洗盘，创业板可以认为是顶部",
			"date_published": 1468135438.388,
			"body": "Blog post body"
		},
		{
			"post_id": 235,
			"title": "为何在这个时候让欣泰电气退市呢?大盘现在处于变盘向上的关键点位，而最近的情况是创业板明显强于主板，次新股炒作明显强于其他。这不利于主板资金融通，反而让前期辛苦套住的游资再次解套，这是ZF不愿意看到的。所以一定要在关键时刻给其一闷棒。关键时刻就是现在。榜样的力量是无穷的，相信聪明的资金已经嗅出了味道，接下去，聪明的资金会疯狂逃离已经暴涨的次新股和创业板，如果效果不好的话，不排除ZF会接二连三再退市几家。",
			"date_published": 1468135366.9,
			"body": "Blog post body"
		},
		{
			"post_id": 234,
			"title": "端午节之后祭奠屈原的，全天跳水",
			"date_published": 1468134659.222,
			"body": "Blog post body"
		},
		{
			"post_id": 233,
			"title": "近7成私募看涨7月行情 2成看平1成看跌",
			"date_published": 1468119301.897,
			"body": " have you seen similar 7-2-1 splits somewhere else?"
		},
		{
			"post_id": 232,
			"title": "私分公款单人或超7000万 恒丰银行高管外资行账户首曝光",
			"date_published": 1468117350.8,
			"body": "恒丰银行高管在2015年年初，通过香港某银行账户，私分了过亿的公款，其中董事长蔡国华进账额近4000万元，时任行长栾永泰得钱2000余万元，副行长毕继繁获利1800万元，其他高管分获数额不一款项，而最低额在800万左右。\n\n　　恒丰银行在最初的声明中称，相关报道中关于该行高管通过香港某银行在境外私分巨额公款一事严重失实，该行从未在香港为个人开设银行账户。我国目前对资金出入境有完备的外汇管理规定，相关报道中所提及的该行巨额资金出入境行为，既不符合逻辑，也缺乏常识。\n\n　　一位知情人士接受记者采访时表示，确切的事实是：在董事长蔡国华的安排下，恒丰银行行政人员在东亚银行上海分行为高管人员办理银行卡，此卡后由蔡国华直接交给相关高管。后相关卡号在2015年4、5月间收到巨额汇款，金额大体与报道吻合。\n\n　　据了解，东亚银行成立于中国香港，是香港最大的独立本地银行，其业务范围涉及中国内地、东南亚、美国、英国等国家和地区。目前，东亚银行为内地网络最庞大的外资银行之一。\n\n　　“恒丰银行的相关声明有自欺欺人之嫌。他们应该明确回应：2015年初是否在东亚银行为高管开卡，是否向这些卡上汇入巨额款项？上述汇款的理由和用途是什么？为何要通过外行进行分钱？”上述知情人士说。\n\n　　而记者获得的银行信息显示，2015年5月，一家名为“上海衍溢投资管理有限公司”的企业，向恒丰高管在东亚银行的卡上汇入巨额资金，汇款理由是“代发工资”。东亚银行的业务公章为上述信息提供担保，力证事实确凿（见图）。\n\n　　至少两位高管直接证实获得了数额从800万到2000万不等的汇款。而多位高管在面对记者求证电话时，并未直接否认开卡及收到巨款事实，只是拒绝透露具体细节。\n\n　　腾讯财经援引一位受访高管的话称：“恒丰银行当时确实给了包括我在内的一些高管，一张东亚银行的卡，卡里有数额很大的一笔钱。”该高管称，给高管分钱一事并没有进入董事会或者股东会讨论，董事长蔡国华只是口头告知这笔钱属于奖金，但他以秘薪制为由未予透露细节。\n\n　　上述高管透露，恒丰银行部分高管，在内部签个字，就可以拿到银行卡。其中有些高管曾于2015年初从东亚银行北京分行提取巨款。\n\n　　中国平安董事长马明哲2007年的税前薪酬超过6000万元曾引发广泛争议。不过，一位恒丰高管分析，号称后无来者的“马明哲天价薪酬”，恐被蔡国华超越。据媒体报道，蔡国华2015年初分得款项高达近4000万元，而一位接近蔡国华的人士则明确指称蔡得款3850万元。依照当前我国最高45%的个人所得税率计算，其税前收入约为7000万元。\n\n　　在多位金融行业负责人看来，银监会早在2010年即对银行高管在内的员工薪酬体系设下红线，而财政部更有国有金融企业负责人最高年薪280万元的规定。十八大后，习近平总书记提出要对国企不合理收入进行调整，此后，国企薪酬制度改革方案实施，金融企业被要求同步对高管限薪。\n\n恒丰银行（英文名称为HENGFENG BANK Co.Ltd）是一家股份制商业银行，全称为恒丰银行股份有限公司。 其前身为烟台住房储蓄银行，于1987年10月29日获批，并于同年12月1日正式营业。开业时仅有员工29人。"
		},
		{
			"post_id": 231,
			"title": "相关国企改革概念股的股价也闻风而动。",
			"date_published": 1468116829.5,
			"body": "以内蒙古国企改革龙头——兰太实业(600328,股吧)为例，该股实际控制人为国务院国有资产监督管理委员会、中国盐业总公司。截至昨日收盘，兰太实业7月以来累计涨幅已经达到35.27%，同期上证综指涨幅不过2%。"
		},
		{
			"post_id": 230,
			"title": "中央企业结构调整，创新发展一批，重组整合一批，清理退出一批",
			"date_published": 1468116733.342,
			"body": "Blog post body"
		},
		{
			"post_id": 229,
			"title": "这里最大的变量和动能就是国企改革，它将改变当前A股以题材股、次新股为主的存量资金博弈格局，市场风格将由中小盘题材股切换到大盘蓝筹股",
			"date_published": 1468116686.311,
			"body": "Blog post body"
		},
		{
			"post_id": 228,
			"title": "2005年股改其实就是一次较大的国企改革（主要针对国有企业），随后催生了2007年的超级大牛市",
			"date_published": 1468116647.032,
			"body": "Blog post body"
		},
		{
			"post_id": 227,
			"title": "A股共有国有控股上市公司超过1000家，约占上市公司总数的40%，总市值占A股整体市值近六成",
			"date_published": 1468116579.499,
			"body": "Blog post body"
		},
		{
			"post_id": 226,
			"title": "折腾大于求稳，智慧大于知识，选择大于努力，坚持大于聪明",
			"date_published": 1468115659.795,
			"body": "Blog post body"
		},
		{
			"post_id": 225,
			"title": "股市大户多空单未平仓量是用真金白银砸出来的，如果股市大户对未来感到悲观，或有地区冲突或战争等系统性风险的话，未平仓量净值会是负值，也就是偏空；目前净值全是正的，远月近月也全是偏多看待的，中美南海对峙依此看来也仅是一场戏，私下中美双方早就进行了许多暗盘磋商和利益交换",
			"date_published": 1468115421.788,
			"body": "Blog post body"
		},
		{
			"post_id": 224,
			"title": "中方如果是玩真的，美股周五还能大涨200多点突破前高吗？",
			"date_published": 1468115331.664,
			"body": "Blog post body"
		},
		{
			"post_id": 223,
			"title": "茶楼是成都经济的晴雨表，经济确实不行了。\n",
			"date_published": 1468114707.24,
			"body": "茶楼是成都人的主要社交和娱乐场所之一。谈点事情、朋友见个面，同事们打个牌等工作、生活、娱乐上的许多事情，成都人都是在茶楼里搞定的。许多人外地人初到成都，都会惊叹，哇！怎么一家接一家的茶楼？\n　　好了，闲话少叙。说明了茶楼在成都人生活中的普及性和重要性。说它成都经济的睛雨表，是非常恰当的。\n　　可从去年下半年开始，成都的茶楼生意都不好做了。楼主在文殊坊对面有个茶楼办了张卡，前两天去消费时，老板已人去楼空，留下一张招租电话孤零零地贴在玻璃门上。楼主有个朋友在武侯大道金色花园那边，一年以前经常去打牌，对老板也比较熟，每次下午去包间基本都达到60%左右的使用状态，大堂散座也能达到50%以上的使用率。上个月又去了趟，大堂只有零星的几个顾客，15个包间，只有3间在用（含楼主和朋友那间）。老板面有忧色，又是上烟又是寒喧的。朋友说这茶楼几个股东退了股，大股东承起，可能过不了多久就要打出去。然后说到以前大家常去的一些茶楼，都直言生意难做，连带着茶楼生意都秋了不少。以前那些搞工程的，钱来得快当的，都认为喝茶的钱属渣渣。但渐渐的，大家觉得到茶楼谈事，也对生意并无多大帮助，减少了在茶楼里的经济活动。说明了不管什么行业，属于中下层人民的机会正慢慢减少。\n　　我想大抵亦是如此，现在单位同事出来打牌的渐渐在减少，年轻人到茶楼的减少了，年轻人打牌的也少了，像我们这样的中年人，一般想到到茶楼要自己买单的话，尽量把话在电话里都说了，或到单位上说也是一样的。这些开支属可压缩开支，能省则省。但一方面反应，大家包包都不太充足，打个麻将，如果有人经常打到欠起，那这个人只要不嗜赌成性，他就会减少此类应酬。以前打五十的，现在打二十，慢慢的就会觉得不打麻将一样过。静下来多找些出路，或者是回到家庭里，也落得家庭幸福。\n　　经济下行压力下，大家理性人都没有心思到茶楼了。\n　　常有其它地区的朋友，用身边的铺面关门等例子来证明经济的好坏。楼主就用身边的茶楼，说经济确实在下行，但也有可能是转型。有可能的是成都的茶楼社交会被其它社交经济形式所超越。\n　　谁说得清呢？ "
		},
		{
			"post_id": 222,
			"title": "截止5日收盘，万科企业已经悄悄地上涨了15%。这样的表现不仅是针对万科的，也是对中国房地产市场未来向好的一个肯定",
			"date_published": 1468113605.57,
			"body": "三季度房地产市场很可能走出低谷，机会很可能出现在三四线城市；中国股市在万科复牌后连续两天大涨，上证指数5日站稳关键点（3004）上方，如果万科第三个跌停板能够被打开，地产股成为中国股市板块轮动的引领者，将发出中国股市进一步前行的信号。"
		},
		{
			"post_id": 221,
			"title": "那只看不见的手却将这两个庞然大物摆平了——必须复牌；对王石以及他的团队实施有限度的保护——但必须低调、容忍；王石、华润、宝能，都必须按照市场化原则操作：认赌服输！",
			"date_published": 1468113425.409,
			"body": "Blog post body"
		},
		{
			"post_id": 220,
			"title": "不能再死掐下去的要害——谁都会被剥的一丝不挂，彻底暴露在光天化日之下。对谁最不利？",
			"date_published": 1468113333.221,
			"body": "Blog post body"
		},
		{
			"post_id": 219,
			"title": "万科三方，没有一个是干干净净的守法者！",
			"date_published": 1468113291.581,
			"body": "Blog post body"
		},
		{
			"post_id": 218,
			"title": "中国市场经济的大环境是不是保护守法者？！",
			"date_published": 1468113246.454,
			"body": "Blog post body"
		},
		{
			"post_id": 217,
			"title": "为什么宝能敢于在“高位”抢筹？它得到了什么人的默许？",
			"date_published": 1468113176.485,
			"body": "Blog post body"
		},
		{
			"post_id": 216,
			"title": "美元该涨不涨，为啥？南海会不会起飞黑天鹅？",
			"date_published": 1468112988.675,
			"body": "Blog post body"
		},
		{
			"post_id": 215,
			"title": "创业板和中小板以及题材股那些高估值的个股，那种鸵鸟一样把头埋在沙子里，屁股露在外面的心理，也不可能长期的挺住价格不跌。当造假的股破产清算，管理层堵住了借壳炒作之后，低价格基础也就随之塌陷了。价格体系的调整也就开始了",
			"date_published": 1468112730.053,
			"body": "Blog post body"
		},
		{
			"post_id": 214,
			"title": " 欣泰电气是第一造假退市的公司，但绝非是唯一的一家",
			"date_published": 1468112564.083,
			"body": "Blog post body"
		},
		{
			"post_id": 213,
			"title": "斗地主",
			"date_published": 1468112171.319,
			"body": "股票被筹码化了，股东被妖魔化了，股权之争被观众娱乐化了，围绕万科的这一把“斗地主”牌局，该怎样玩下去?\n\n　　其实就是一场斗地主游戏\n\n　　我们先来看看发生在东部沿海一个小渔村村头大榕树下的“斗地主”赌博游戏。\n\n　　游戏一开始是平淡的，姚老板主动邀约两位村中名人“小赌怡情”一下，按华叔——姚老板——王石头先后顺序，大家摸完牌，姚老板抬起头先望了华叔一眼，又望了王石头一眼，怯懦地说出五个字:我要做“地主”!\n\n　　华叔面无表情，王石头满脸不屑。\n\n　　王石头让上一把的“地主”华叔表态，华叔虽然拿着王炸，却摇了摇头，眼都没抬起来就说“过!”，于是，姚老板迫不及待地一把就将桌上的底牌摸走了。\n\n　　王石头眼睛虽小，但目光犀利，他眯起小眼睛，用余光偷看了华叔手上的牌，啊呀，华叔不愧是江湖大佬，把把都摸到了双王在手啊，老子手上还拿住4条2呢，王石头于是暗暗思忖，哪个山头来的?这么横，没啥大牌也要抢着做“地主”，是找死吧?\n\n　　姚老板牌风彪悍，一抬手就打出4条A，这可把王石头惹火了，还没等华叔表态，王石头就抽出4条2，啪啪拍在姚老板的面前，心想，我看你还拿什么横。\n\n　　然而，令人意想不到的事情发生了，华叔没有表扬王石头干得漂亮，却出人意料地拿出王炸，直接啪啪拍到王石头打出的4条2上。\n\n　　有没搞错呀?你怎么会轰炸盟军的航母?王石头满脸莫名惊诧，这时，围观群众捉急地对着华叔大喊，你炸错了，姚老板才是地主!你跟王石头是一家的，你怎么炸自己人呢?\n\n　　王石头被华叔不按牌理打出的王炸一下子炸晕了头，气得七窍冒烟，也就顾不得什么老朋友的礼节了，用食指指着华叔那颗硕大的脑袋，只是连说了三个你、你、你，就把牌扣在桌上，说老子头晕，歇一下再玩。\n\n　　姚老板看到气急败坏的王石头，神态自若，一副成竹在胸的表情。\n\n　　华叔虽被骂背信弃义，但大佬派头不倒，嘴角飘过一丝让人不易觉察的微笑，面对吃瓜群众的指责，华叔果断回击，宣称我与姚老板不熟，说我跟他打对家纯属谣言，我管谁是地主，我只想要赢!\n\n　　王石头恍然大悟，原来，不管谁做“地主”，他们都会合起来打我。\n\n　　王石头气得没有办法，趁着上厕所的功夫到处拉人入场买马，以便制衡华叔与姚老板的勾搭。\n\n　　跑来买马的人倒是挺多，但都块头不够，在华叔不由分说的傲慢和姚老板势不可挡的霸气面前，买马群众的力量还是太单薄，没办法阻止华叔与姚老板横扫一切牛鬼蛇神的节奏。\n\n　　在这个关键时刻，只见高大魁梧的铁牛哥提着钱袋从渔村地铁的工地上匆匆赶到村头大榕树下。\n\n　　铁牛哥说，买马我就不玩了，要玩我就要坐在牌桌上跟你们一起玩。\n\n　　王石头喜不自禁，人间处处有真情啊，关键时刻，还是有仗义行侠的好汉出手相救。\n\n　　华叔与姚老板眼看就要把王石头的裤子都脱了，鬼知道怎么半路杀出个程咬金来了，甚是不爽。望着铁牛哥身上暴凸的肌肉，华叔打死也不肯同意让他上桌，姚老板立马表明态度，铁牛哥站在边上买马可以，上桌做地主，那坚决不行。\n\n　　糟糕，一把牌竟然分不清谁是真正的地主，那还怎么“斗”下去呢?\n\n　　围观群众的情绪更激动\n\n　　这种斗地主的玩法简直太有创意了，让围观群众的情绪都显得比较激动，大家试图将他们的行为贴上标签，反正看热闹的也不怕事儿大的。\n\n　　其实，这不过是皇帝不急太监急而已。宝万之争的当事三方，即王石为代表的万科管理层、宝能系和华润，从头到尾都是理性的，并非外界认为的事件在走向非理性。倒是旁观的商业大咖、经济学家以及热情围观的买马群众按捺不住，纷纷扬扬地表达着自己的观点。\n\n　　可是，这么大的一盘生意，你以为他们都是一时冲动，赌气行事，那就错了。\n\n　　各执一词并相互攻讦的当事人及其粉丝们，都在想方设法把对方送上道德的审判席，甚至更狠一点，把对手送进监狱。\n\n　　王石为首的管理层强调自己动机的纯正，他自己贴上的标签是:万科文化的守望者，中国最佳上市治理结构的缔造者。\n\n　　宝能强调资本的意志，手段的合理性，是市场规则的坚持者。\n\n　　华润则标榜法治精神的捍卫者。\n\n　　似乎都有其理性与逻辑。\n\n　　可见，宝万之争，看起来是两种不同价值观的冲突。\n"
		},
		{
			"post_id": 212,
			"title": "下半年是酒类产品涨价的时间，特别是高档白酒，涨价空间巨大，业绩提升空间也很大",
			"date_published": 1468111970.626,
			"body": "Blog post body"
		},
		{
			"post_id": 211,
			"title": "酿酒板块，每每到了下半年，尤其是在7～11月份的5个月中，酿酒饮料板块都会出现一波固定的走强，哪怕是在股市处于弱势格局下也是如此。",
			"date_published": 1468111949.813,
			"body": "Blog post body"
		},
		{
			"post_id": 210,
			"title": "大盘区间横盘了大半年，别被麻痹了，现在大盘具备出现深度调整的条件，做个提防不是坏事。若下周大盘出现深度调整，本周大盘并是顶部结构，主跌浪将要到来。沪指前低2638点必须破",
			"date_published": 1468111811.791,
			"body": "Blog post body"
		},
		{
			"post_id": 209,
			"title": "'Brexit is Brexit': British parliament rejects bid for second EU vote",
			"date_published": 1468111117.328,
			"body": "Blog post body"
		},
		{
			"post_id": 207,
			"title": "美军已逼至距黄岩岛14海里",
			"date_published": 1468110890.427,
			"body": "7月7日，美国海军学院网站发文指责解放军在南海军演期间划定的禁航区“违反国际海洋法”。文章称，美国海军“不会尊重”中国海上禁航区，并暗示美军正在考虑派军舰或飞机挑衅中国实弹演习禁航区。"
		},
		{
			"post_id": 206,
			"title": "Software- The code that took America to the moon has just been put on GitHub ",
			"date_published": 1468110358.455,
			"body": "Blog post body"
		},
		{
			"post_id": 205,
			"title": "微软人工智能平台开源：利用《我的世界》测试AI软件",
			"date_published": 1468109888.594,
			"body": "Blog post body"
		},
		{
			"post_id": 203,
			"title": "看看什么叫狗咬狗- A股公司明家联合被指制造手机病毒 感染近亿用户",
			"date_published": 1468073570.311,
			"body": "中毒手机在2、3个小时内，安装了200个应用，共消耗掉2G流量。同时，若按照APP移动分发0.5美元下载成本保守估计，日赚可达50万美元。"
		},
		{
			"post_id": 202,
			"title": "奥巴马是不是在做多中国的军工股？",
			"date_published": 1468072357.771,
			"body": "前两天买的是舰船、航母概念，所以在南海挑衅；最近两天买的是航天、导弹概念，所以他掏出了萨德系统。\n \n今天（7月8日），美韩两国宣布，决定在韩国部署威力巨大的萨德系统。\n \n虽然美韩声称，萨德系统部署在韩国，仅用于防御朝鲜核武器与导弹，不会指向第三国，但这无疑是对中国、俄罗斯的巨大挑战。\n \n美国不顾中俄的反对，强行部署萨德系统，显然开启了东北亚地区的冷战之门和军备竞赛之门。\n"
		},
		{
			"post_id": 201,
			"title": "房价大幅下跌往往与破产挂钩",
			"date_published": 1468071331.279,
			"body": "房价大幅下跌往往与破产挂钩\n\n\n\n　　为什么？全民都盼着房价下跌，专家却说房价越低越买不起房，说的好像房价越高就越买的起一样？实际上现在人人都觉得房价贵，而且贵的很不合理，但任何不合理的现象背后一定有合理的解释，今天我们不讨论这些合理的解释是什么，就用事实来说一说房价跌了会怎么样？\n\n\n　　2013年，底特律房价跌到谷底，成为名副其实的白菜价，但那时候底特律人几乎已经不置业了，整个城市宣布破产，大部分家庭破产，谁还是考虑把生存的钱拿去购房？\n\n\n　　2008年下半年，全球金融危机蔓延到中国，万科降价了，结果售楼处人满为患，都是要闹事的业主；不久之后，一些开发商也顶不住跟着降价，于是全国性的“房闹”事件就上演了。回想那时候，你想着趁房价下跌而赶紧置业吗？不，那时候你担心的是会不会被炒鱿鱼，被炒之后如何承担家庭开销，担心的是公司会不会破产……\n\n\n　　事实讲完了，现在举个易懂的例子：你有一套价值100万的房子，手里有150万的现金，想买一套200万的房子，因为钱不够买不起，所以你盼着房价下跌。现在房价从200万开始下跌，190…170…150…原则上150万你可以买的起了，但要知道你固有的那套房子也从100万开始下跌到90万…80万…但房价还在跌，请问这个时候你会跟进买吗？这不是机遇来了，是风险来了。\n\n\n\n假如房价暴跌，你将要承受这些后果！\n\n\n\n　　海南资深房地产投资分析师王和东指出，若房价真的开始暴跌，那么以下这些情况将会发生：\n\n\n　　后果1.中小房企将面临倒闭\n　　房地产一直都是中国的支柱产业，全国目前有数万家大大小小的房企，其中许多中小房企都是半路出家，没有强大的资金支持。如果出现房价腰折式暴跌，那么这些没有强大资金作支撑的放弃，为了降低损失，大部分房企都是申请破产。只要房价暴跌，那么这种倒闭现象绝对不是小范围，而是波及全国，企业将会纷纷申请破产处理。\n\n\n　　后果2.失业率飙升\n　　众所周知全国房企大大小小数万家，解决了多少人的就业问题。除了房企外，地产行业还涉及到建材、装修等等，一旦发生大批房企倒闭现象，那么这些行业也将会受到重创，甚至于破产，连带效应会接踵而来，企业破产也就标志着员工失业，失业率方面带来的影响和冲击是非常非常大的。\n\n\n　　后果3.银行纷纷倒闭\n　　房价下跌，银行可能是最惨重的受害者。房地产贷款占到商业银行总贷款的20%，地产行业如果受到重创会让许多贷款面临违约，据统计，房价下降30%银行将增加1万亿元的坏帐，所以房价如果暴跌，那么银行就会受巨创。\n\n\n　　后果4.烂尾楼遍布全国\n　　房价暴跌，房地产就会开始贱卖房屋，以前买到1万/㎡的房子可能现在只需两三千一平米就轻松买到，但是，房子也会越来越不值钱，买房的人会大大缩减，到时候，必然会出现大量的烂尾楼，因为开放商已经破产了，银行也没有资金在贷款给房企。\n\n\n　　后果5.货币贬值严重\n　　房子的保值性没有任何意义了，资金就会外流，再加上国家不会让国有银行倒闭，拯救银行的办法只有疯狂的印钞票，增加货币流通量，实行宽松政策，这样，货币贬值就会更加严重。按照正常来说，五年时间，货币购买力将下降近一半，钱也就开始不值钱了。\n\n\n　　后果6.财富差距更加悬殊\n　　失业率增加，经济萧条，最痛苦的莫过于老百姓，在如此现状下，那些富人拥有者将会加大劳动者的剥削，因为劳动力太多，财富会更加集中。\n"
		},
		{
			"post_id": 200,
			"title": "what Microsoft has stored on DNA?",
			"date_published": 1468070945.36,
			"body": "Blog post body"
		},
		{
			"post_id": 199,
			"title": "1 in 20 Wendy's burger joints hacked? No, make that 1 in 3 – 1,025 in total",
			"date_published": 1468070468.651,
			"body": "Blog post body"
		},
		{
			"post_id": 198,
			"title": "The maker of the $4 smartphone now wants $7.5 billion",
			"date_published": 1468070391.479,
			"body": "Blog post body"
		},
		{
			"post_id": 197,
			"title": "Containing a Superintelligent AI Is Theoretically Impossible ",
			"date_published": 1468070330.151,
			"body": "Blog post body"
		},
		{
			"post_id": 196,
			"title": "欣泰电气的退市短期将引发市场投资者对问题公司股票的抛售，从而造成市场加大震荡幅度",
			"date_published": 1468055583.038,
			"body": "拿不准，先卖了再说。"
		},
		{
			"post_id": 195,
			"title": "A股市场中有2800多家上市公司，还有多少公司存在造假内幕，我想这是接下来每位投资者需要去考虑的问题，那些仅靠技术面吃饭的投资者，或许要开始去关注公司的基本面了",
			"date_published": 1468055555.698,
			"body": "Blog post body"
		},
		{
			"post_id": 194,
			"title": " 知名私募创势翔遭遇“黑天鹅”，2016年4月，知名私募创势翔对欣泰电气连续两次举牌，持股比例达10%，成为公司第二大股东。截至4月20日，创势翔累计持有公司股份1715.58万股，按照停牌前14.55元的价格计算，持股市值近2.5亿元。",
			"date_published": 1468055425.241,
			"body": "虽然兴业证券设立的5.5亿先行赔付专项基金，但可以明确的是，创势翔这一次可能拿不到这笔先行赔付款了，因为创势翔是在欣泰电气发布暂停上市风险提示公告或欣泰电气发布欺诈发行相关会计差错更正公告日之后买入的。\n 汇金公司也可能会“躺枪”欣泰电气2016年一季报显示，除了创势翔，汇金公司等机构也持有公司股票，假如这些机构尚未减持退出的话，也会“躺枪”。截至2016年3月31日，汇金公司持有欣泰电气137.13万股，占公司的流通股本的1.52%。"
		},
		{
			"post_id": 193,
			"title": "“资产荒”、民间投资增速急降、股市“异常波动”等令人窘迫的现象的根本原因也就是各类资产估值过高",
			"date_published": 1468055187.149,
			"body": "Blog post body"
		},
		{
			"post_id": 192,
			"title": "电解铝产能是严重过剩这几年前就确定了，但伴随汽车轻量化技术的发展，铝镁合金需求猛增，过剩产能的股票也会成为香饽饽，而这种机会算得上是实实在在的抄底",
			"date_published": 1468054974.469,
			"body": "Blog post body"
		},
		{
			"post_id": 191,
			"title": "给“水泥”装上智慧的大脑，工业智能化将是今后很长一段时间的发展方向",
			"date_published": 1468052821.237,
			"body": "Blog post body"
		},
		{
			"post_id": 190,
			"title": "现在吃一碗酸辣粉都可以团购、微信支付的时候，感觉互联网的发展已经遇到瓶颈了。",
			"date_published": 1468052768.246,
			"body": "Blog post body"
		},
		{
			"post_id": 189,
			"title": "无人机",
			"date_published": 1468052706.8,
			"body": "Blog post body"
		},
		{
			"post_id": 188,
			"title": "虚拟现实",
			"date_published": 1468052587.238,
			"body": "国际领先的虚拟现实头盔主要是Oculus、HTC和SONY三家，国内的蚁视也还是不错。七鑫易维的眼控技术，也是虚拟现实头盔一个重要技术。要从硬件入手选择虚拟股票，就应该围绕这几家公司。"
		},
		{
			"post_id": 187,
			"title": "智能驾驶和机器人、虚拟现实、人工智能作为智能制造最重要的四个板块，在未来会出现一些伟大的公司",
			"date_published": 1468052275.043,
			"body": "Blog post body"
		},
		{
			"post_id": 186,
			"title": "板块个股齐涨往往代表行情告一段落了",
			"date_published": 1468052207.383,
			"body": "Blog post body"
		},
		{
			"post_id": 185,
			"title": "智能驾驶板块",
			"date_published": 1468051819.683,
			"body": "近期概念股的炒作有以下特点：一、行情一般是一个突发新闻引爆，3月17日是美国在2022年前强制安装自动刹车的新闻，这次是特斯拉​Model 3的发布；第二，涨幅最大的并不是传统的汽车零部件股。不管是上一轮涨幅最大的数源科技，还是这轮涨幅最大的大富科技，都和汽配行业没有关系。大富科技还勉强算是特斯拉的供应商，数源科技并不具备智能驾驶的实质业务，上涨的原因主要还是因为前期涨幅较小。"
		},
		{
			"post_id": 184,
			"title": "优质的成长股",
			"date_published": 1468050996.129,
			"body": "Blog post body"
		},
		{
			"post_id": 183,
			"title": "淘金热中谁挣钱？",
			"date_published": 1468049997.652,
			"body": "每次淘金热潮中，淘金者不一定每个都能赚到钱，但给淘金送水肯定稳赚不赔。A股市场也一样。电动汽车很“热”，但近段时间涨的最多的却是做锂电池的公司股票。这和中国的国情是分不开的。中国经济由于政府介入太多，还不是完全的市场经济。像电动汽车行业，很多整车厂家并不是产品有真实的市场需求去生产，而是为了赚取国家的补贴去生产，这就决定了大部分生产电动汽车的厂家在市场上不能赚到钱。但生产电动汽车，锂电池是必须用到的，这就决定了锂离子电池生产厂家的效益不错。同样，前几年大家一拥而上的光伏行业，生产光伏发电设备的企业都亏损了，但生产光伏逆变器的厂家还在赚钱。从光伏行业的教训可以看出。新兴行业过于冒进，首先亏损的是终端产品的生产厂家，其次在供应过剩的情况下，原材料厂家的日子也不会好过。只有掌握关键零部件核心技术的厂家才可能笑到最后。\n\n但是的确，金子永恒。一切只是时间问题。"
		},
		{
			"post_id": 182,
			"title": "历史证明，上一轮牛市的大牛股，下一轮牛市一般都不会有好的表现",
			"date_published": 1468043888.206,
			"body": "Blog post body"
		},
		{
			"post_id": 181,
			"title": "创出历史新高的股票不能买",
			"date_published": 1468043864.52,
			"body": "Blog post body"
		},
		{
			"post_id": 180,
			"title": "一击不中，全身而退",
			"date_published": 1468043704.965,
			"body": "Blog post body"
		},
		{
			"post_id": 179,
			"title": "“傻瓜炒股法”。上证指数上涨百分之三以上，如果第二天继续上涨，就买入",
			"date_published": 1468043677.913,
			"body": "Blog post body"
		},
		{
			"post_id": 178,
			"title": "好的交易一开始就是盈利的",
			"date_published": 1468043628.902,
			"body": "Blog post body"
		},
		{
			"post_id": 177,
			"title": "A股这几年都不缺低估的股票，像银行、钢铁、水泥，再便宜都没有人买。银行股的坏账，钢铁、水泥的过剩产能，始终是阻碍他们估值的阴云",
			"date_published": 1468043404.162,
			"body": "Blog post body"
		},
		{
			"post_id": 176,
			"title": "回过头来看电动汽车板块的炒作，基本上还是和上市公司业绩相关的。由于国家政策扶持，电动汽车行业从去年下半年就出现了全行业的爆发式增长。",
			"date_published": 1468043282.824,
			"body": "按这个思路，从轨道交通、通用航空，以及工业4.0中选择次新股，可能机会要多一些"
		},
		{
			"post_id": 175,
			"title": "茅台股价突破300元已经成为标志性事件 - 关键是他标志着什么？",
			"date_published": 1468042039.681,
			"body": "Blog post body"
		},
		{
			"post_id": 174,
			"title": "2012年也是中小板和创业板股票最黑暗的一年，整个一年都在下跌，几乎没有像样的反弹。但从2013年起，创业板走出了长达两年半的大牛市，最高涨幅接近七倍的大牛市",
			"date_published": 1468041979.914,
			"body": "Blog post body"
		},
		{
			"post_id": 173,
			"title": "消费类股票的上涨，会不会也预示着股市已经是底部，即将迎来上涨呢",
			"date_published": 1468041972.301,
			"body": "Blog post body"
		},
		{
			"post_id": 172,
			"title": "2012年的股票走势。2012年是消费类股票跑赢大势的一年，茅台也是2012年7月股价超过200元（其后一路下跌，2015年才重回200元）。",
			"date_published": 1468041917.088,
			"body": "Blog post body"
		},
		{
			"post_id": 171,
			"title": "短线投资者看不到市场长期上涨的前景，为了‘不给老庄抬轿子’，就只有买次新股",
			"date_published": 1468041867.539,
			"body": "Blog post body"
		},
		{
			"post_id": 170,
			"title": "长线投资者看不到经济好转的前景，就只有买消费类个股",
			"date_published": 1468041385.395,
			"body": "Blog post body"
		},
		{
			"post_id": 169,
			"title": "有一类股是可以在接下来的一周寻求做多的机会，这类股就是大家耳熟能详的高送转概念，尤其是去寻找那些近期刚刚除权的高送转个股进行布局将是一个不错的选择",
			"date_published": 1468041037.951,
			"body": "Blog post body"
		},
		{
			"post_id": 168,
			"title": "理论决定现实",
			"date_published": 1468040757.316,
			"body": "Blog post body"
		},
		{
			"post_id": 167,
			"title": "上升较大空间后，日Ｋ线出现十字星或长上影线的倒锤形阳线或阴线时，果断出局。",
			"date_published": 1468040468.667,
			"body": "Blog post body"
		},
		{
			"post_id": 166,
			"title": "天量天价；地量地价",
			"date_published": 1468040362.233,
			"body": "Blog post body"
		},
		{
			"post_id": 165,
			"title": "成交量创下近数个月甚至数年的最大值，是主力卖出的有力信号，是持股者卖出的关键，没有主力拉抬的股票难以上扬，仅靠广大中小散户很难推高股价的。上扬末期成交量创下天量，９０％以上形成大头部区",
			"date_published": 1468038617.732,
			"body": "from the volume perspective, the current volume are still much smaller comparing to that of May 31; so there is still room to go up.\n\nthis theory is proven by several cases in the past 12 months, particularly the end of 2015, right before the big drop.\n\nif the level now is not the high, then we should have a strategy, to increase the holding increasingly as the price level adjust back, not linearly, but double down."
		},
		{
			"post_id": 164,
			"title": "大幅上升后，成交量大幅放大时要果断出局",
			"date_published": 1468038547.355,
			"body": "当股价大幅上扬之后，持股者普遍获利，一旦某天该股大幅上扬过程中出现卖单很大、很多，特别是主动性抛盘很大，反映主力、大户纷纷抛售，这是卖出的强烈信号。尽管此时买入的投资者仍多，买入仍踊跃，这很容易迷惑看盘经验差的投资者，有时甚至做出换庄的误判，其实主力是把筹码集中抛出，没有大主力愿在高价区来收集筹码"
		},
		{
			"post_id": 163,
			"title": "大盘形成大底部时，有９０％以上的个股形成大底部",
			"date_published": 1468038498.254,
			"body": "Blog post body"
		},
		{
			"post_id": 162,
			"title": "统计资料显示：大盘形成大头部下跌，９０％以上的个股形成大头部下跌",
			"date_published": 1468037915.623,
			"body": "Blog post body"
		},
		{
			"post_id": 161,
			"title": "通胀时期最大的热门是有色金属板块，其次是白酒、中药和医疗服务。这些板块虽然已经启动且涨幅不小，但依然会成为后续行情的活跃品种",
			"date_published": 1468037788.959,
			"body": "Blog post body"
		},
		{
			"post_id": 160,
			"title": "凌云股份（600480）",
			"date_published": 1468037515.716,
			"body": "公司是目前中国大型的汽车辊压件、 汽车冲压件产品生产厂商之一，子公司涿州亚大是目前国内PE燃气管道领域唯一能从管材、管件、施工机具到设计、施工、维修、提供成套服务的企业，也是PE燃气 管道领域唯一进入国际市场的企业。公司实际控制人中国兵器工业集团是中央直接管理的特大 型国有重要骨干企业，该集团是中国最大的武器装备制造集团。 \n  2016年一季度归母净利润同比增长高达91.57%， 源自财务费用降低和投资收益增长。凌云股份2015年收购了德国WAG公司，吸 收先进技术并开拓国际市场。报告期内凌云股份中标戴姆勒奔驰铝合金零部件产品。 凌云股份持续提升汽车零部件业务创新能力，不断优化产品结构，。我们预计2016年至2018年凌云股份的归母净利润分别为1.64亿 元、1.88亿元和2.18亿元"
		},
		{
			"post_id": 159,
			"title": "立思辰（300010）",
			"date_published": 1468037434.543,
			"body": "2016年6月，公司控股子公司北京立思辰合众与黄冈电信签 订了黄冈市教育云平台信息化项目建设合作合同书，双方将共同承担黄冈市教育云 平台信息化项目的建设和运营工作。黄冈模式的成功将为立思辰向全国各地城市复制开辟一条崭新的道路。 \n推进虚拟现实教育应用：2016年6月，公司全资子公司康邦科技与北航虚拟现实实 验室签署《共同推进虚拟现实教育应用战略合作协议》。虚拟现实，是利用三维图 形生成、多传感交互、多媒体、人工智能、人机互动、高分辨显示等高新科技，对 现实世界进行全面仿真的一种技术。 \n  加码在线教育及信息安全：2016年7月，公司完成以17.81元/股定增10084.22万股 +现金总计21.64亿元购买康邦科技100%股权及江南信安100%股权，增值率分别为934 .83%、443.35%。同时，拟向不超过5名特定对象定增募集配套资金不超过17.96亿元。 \n  公司预计1-6月净利润与上年同期相比实现 扭亏为盈"
		},
		{
			"post_id": 158,
			"title": "科陆电子（002121）",
			"date_published": 1468037151.878,
			"body": "公司是为智能电网、新能源应用提供装备和解决方案的国 家高新技术企业。近年来，公司为保持核心竞争力，紧跟国家战略性新兴产业战略 规划，重点布局新能源领域，公司已成功转型为以新能源发电运营、车联网、储能 、主动配网改造、产业园区综合能源服务等为核心业务的企业。 \n  2016年5月26日公告，公司与株式会社LG化学签署《中外合资经营企业 合同》，双方拟在中国合资设立深圳科乐新能源科技有限公司，经营储能电池组的 生产、销售及相关配套服务，合资公司注册资本为350万美元，公司出资245万美元 ，占合资公司70%的股权。预计公司2016-2018年的EPS分别为0.28、0.38和0.47元，公司充电桩 产品快速放量，电动汽车生态圈逐步打造."
		},
		{
			"post_id": 157,
			"title": "3450以下不言顶",
			"date_published": 1468037006.603,
			"body": "三千点一带是前期密集成交区，多空必定会有较量，回踩蓄势是必须的。由于本轮行情是大周期向上，下面等着补仓的资金嗷嗷待哺，因此向下空间不大。从结构上看3450以上才是阶段性头部区域，而3450以下，股指会继续振荡向上。"
		},
		{
			"post_id": 156,
			"title": "贵金属、白酒、医药和农业，均为防御性板块。 ",
			"date_published": 1467991078.422,
			"body": "Blog post body"
		},
		{
			"post_id": 155,
			"title": "贵州茅台于2001年8月27日上市，发行价31.39元，总股本25000万股，首日开盘价34.51元。昨天，贵州茅台收盘价317.19元，复权价高达1947.42元。上市10年，股价累计上涨62倍，平均年涨6倍多。",
			"date_published": 1467991016.117,
			"body": "Blog post body"
		},
		{
			"post_id": 154,
			"title": "“喝酒”行情如期而至 “吃药”行情还会远吗？",
			"date_published": 1467990907.311,
			"body": "在A股历史上，素有“喝酒吃药”行情，如今在行业景气度好转带动下，“喝酒”行情如期而至，那与之相随的“吃药”行情还会远吗？从目前机构观点来看，A股“吃药”行情可能正在路上。 "
		},
		{
			"post_id": 153,
			"title": "港股的地狱不止十八层！一股本周跌幅近95%",
			"date_published": 1467990321.987,
			"body": "在A股通常形容在股市抄底，地板之下有地下室，地下室下面有地窖，地窖下还有十八层地狱。这句话套用在妖孽众生的香港股市里，还要加句：地狱不止18层！\n\n　　本周有“老千股”之名的乐亚国际(L&A I.TL HOLD 08195.HK)用令人骇人听闻的走势诠释了这点，并且再次验证了，现实里的更残酷！\n\n　　本周前4个交易日，股价跌去近95%的乐亚国际今日反弹，一度最多涨17%，不过随后又逐步回落，收盘报0.026港元，仅涨4%。\n\n　　上周四收盘(上周五港股休市)乐亚国际股价还在0.465港元。进入本周，股价跌的令人完全认不出来。本周一乐亚国际便大跌40.86%，周二反弹38.18%，接着就是周三单日暴跌91.58%，还没完！周四该股继续大跌21.88%，收盘只剩下0.025港元。即便今日反弹4%，股价也不过0.026港元，距离上周收盘价0.465港元，也跌去近95%！\n\n　　妖孽众生的香港股市地狱不止18层！ \n\n　　香港“老千股”，顾名思义，就是骗人钱财的股票。“老千股”指的是经常以集资为导向，且大手笔作出收购或者出售项目，均是极大地损害股东权益，但对大股东有利的股票。所谓“不跟你在二级市场玩儿，合法的当骗子”，就是这么来的。\n\n　　2014年10月10日挂牌上市，乐亚国际控股有限公司(L&A I.TL HOLD 08195.HK，以下简称“乐亚国际”)(08195)主要收入来源于制造、出售羊绒服装及其他服装产品， 经以下两个途径出售：1。原设备制造业务(OEM) 2. 服装零售(由牌号“CASIMIRA”设计，采购，营销和零售羊绒服装及其他服装产品).\n\n　　当初集团在原设备制造业务的生产，包括纯羊绒衫及混纺羊绒衫，除了纯羊绒衫及混纺羊绒衫外，集团也会生产美利奴羊毛，亚麻布和棉布等的服装。\n\n　　该股配售价1.35元，挂牌的时候价格是4.06元，到2015年4月20日，最高股价炒到12.98元，市值几百亿元。就这样一家公司，谁会想到今天股价只有不到3分钱，市值不足6亿了。2015年10月后新股配售协议开始解禁，于是开始漫长出货阶段。\n\n　　从乐亚上市后的股价生命历程，我们可以看出，大股东玩儿资本游戏的手段也不高明。和香港其他老千股一样，不就是玩儿个股权游戏嘛。2015年3月23日1拆10股，2016年5月19日1股分拆5股，这时候的股价都还有2--3.00元之间，可惜最近几天被实在按耐不住的持筹者砍仓了，6月24日股价暴跌80%，成交了5亿港元；余下第二个交易日(6月30日)一个反弹13%，成交3.58亿元，股价还有0.465元；然后停牌到6日开盘，不曾想又暴跌，几百亿市值就这么灰飞烟灭！\n\n　　电影《捉妖记》台词说：妖就是妖，所谓的生活，不过就是一场厮杀！而香港股票市场的最大看点，注册制下的老千就是老千，穿个马甲还是老千。\n\n　　据智通财经获悉，3月15日，乐亚国际曾发布公告称，公司已与第九城市(NCTY.NASDAQ)、上海东方明珠文化发展有限公司及RED5Studios，Inc其他股东朱骏等签署谅解备忘录，计划以7650万美元收购RED5工作室45%的股份，交易各方将在尽职调查完成后签订最终股份转让协议。届时，乐亚国际将通过配发及发行新股的方式完成此次收购，而九城及其控制人朱骏也将获得港股上市公司乐亚国际的股份，为未来的资本运作打下基础。\n\n　　九城，作为最早一批登陆纳斯达克的中概股，是否也在考虑回归内地A股，不得而知。当时很多媒体认为，此次交易的背后，是否也意味着九城考虑借道乐亚国际，开始曲线回归的历程，着实令人浮想联翩。\n\n　　4月25日，乐亚国际宣布，控股股东抵押8.4亿股股份。控股股东 Yang‘s Holdings Capital Limited 4月21日向香港一名持牌放债人签立涉及公司股本中8.4亿股股份之股份押记，作为 Yang’s Holdings 所获授定期贷款融资之抵押。YangsHoldings 目前合共拥有20.41亿股公司股份，占公司已发行股本约51.02 %。抵押股份占公司之已发行股本约21%。\n\n　　港股老千在“现形”之前都是有前兆的，比如5月16日，王乐民辞任乐亚国际财务总监。同时，梁子炜获委任为公司新任财务总监及公司秘书，5月16日起生效。5月20日就宣布股份1拆5.\n\n　　6月21日，该公司公布，已完成收购创新娱乐软件及网络游戏开发公司Red5Studios47.6%权益。专业人士认为，《火瀑》有望成为继魔兽之后，成为下一个“现象级”的超级IP，乐亚有望从中受益。结果，似乎春天的气息刚来到，投资者就挨了当头一棒！\n\n　　据智通财经了解，RED5工作室的估值相较于2014年东方明珠入股时的7.15亿元人民币已攀升至此次交易的11亿元人民币(约1.7亿美元)，增幅达54%。所以，RED 5价值飙升，的是让人看到以游戏为代表的文化产业在资本市场中的强获利能力。甚至还有业内人士认为，在众多业内大玩家的推动下，《火瀑》有望成为继魔兽之后，成为下一个“现象级”的超级IP，乐亚有望从中受益。同时6月21日，公司同时预期年度亏损高出去年同期约60%。\n\n　　而这次暴跌，很可能是质押的股份被砍仓了，毕竟在2016年2月2日的时候，MSCI明晟就公布，由2月的季度指数检讨起，将把证监会警告股权高度集中的香港股份剔出全球可投资市场指数(GIMI)。股权高度集中的港股亦不会被纳入有关指数。至于被剔除的港股，日后即使获证监会解除股权高度集中的警告，亦需要至少12个月后才可重新被纳入，这其中就包括有乐亚国际。\n\n00.jpg\n\n　　实际上，211亿的股本也是相当可怕的，以前几天3.00元的股本计算也是600多亿港元的市值啊，拿什么来支撑股价？也许主力选择了香港老千股一贯做法“向下做”赚钱，更也许是质押的股份坚决砍仓，我们都能体会到香港市场风险巨大。在最近3个交易日的成交回报中，我们追踪资金，发现筹码集中的券商海通国际、招银国际、凯基证券席位不断出货，那股“要钱不要股”的劲头盘中浮现，真的令大家感到香港市场的可怕。\n\n　　这是一种最令投资者痛苦，而且怎么想都想不明白就无端端血本无归的股票，是一种由财技衍生出来的“由大股东或大庄家专门虐杀小股东或小股民的特别股票”。这种股票，通常杀人于无形。记住了，在香港，它的名字叫“老千股”。\n"
		},
		{
			"post_id": 152,
			"title": "过去十年美股涨幅前15的大牛股",
			"date_published": 1467989291.221,
			"body": "第一名：Priceline。在线旅游的毫无争议巨头！期间涨幅53倍。\n\n\n\n\n我刚刚写过Expedia的十倍股之路，其中也说过，其实涨幅更大的是Priceline。Priceline受益于垂直互联网中在线旅游需求的大爆发。互联网打破了中间环节，全球旅游越来越个性化。在这个过程中，旅行社的价值大幅下滑。而Priceline提供廉价的机票和酒店预订。同时，其收购的Booking，Agoda都给增长带来很大贡献，因为欧洲酒店太多，信息不透明很严重。关于Priceline，我会在之后具体讲解。\n\n\n\n\n关键词：互联网，收购\n\n\n\n\n第二名：Alexion Pharmaceuticals。亚力兄制药，期间涨幅35倍。\n\n\n\n\nAlexion是一家全球性的生物制药公司，专注于毁灭性疾病和罕见病药物的开发，总部位于美国康涅狄格州，是目前全球领先的罕见病研发公司之一。2015年，Alexion的市值已经达到398.9亿美元，5年平均销售增长率为43.0%。Soliris作为Alexion公司首个上市药物，一直以来，其作为Alexion的拳头产品为公司带来了持续而丰硕的利润。Soliris是世界上第一个被批准用于治疗重症肌无力的终端补体抑制剂（已获孤儿药地位），同时可用于治疗一种危及生命的非典型溶血性尿毒综合征以及阵发性睡眠性血红蛋白尿症，且目前该药仍在不停的探索新适应症并已有部分进展。\n\n\n\n\n没有哪家公司会像Alexion 公司那样，基于治疗全球仅有几百例严重和危及生命疾病的业务而取得成功，虽然许多制药公司也在试图复制 Alexion 公司的模式。Soliris的成功说明研发孤儿药虽然面临临床试验困难、研发时间长、成本高、市场规模小、企业获利困难等问题，但更多的是机遇和广阔前景。\n\n\n\n\n关键词：小众，创新，定价权\n\n\n\n\n第三名：Regeneron Pharmaceutical。期间涨幅31倍。\n\n\n\n\nRegeneron，伟大的生物医药公司。这个1989年创立的医药研发公司，从一个只有几个人的生物实验室发展到了今天市值数百亿美元的生物医药巨头，是美国医药创新中最励志的故事。公司花了20年努力在2008年获得一款FDA批准的产品ARCALYST，用于Cryooyrin蛋白相关综合症的治疗，虽然销售那年才1100万美元。基于这款产品，2011年11月，FDA批准了其第二个产品EYLEA，用来治疗视网膜疾病。这款产品爆款，2012年获得8.4亿美元销售，13年销售突破14亿。美国湿性黄斑变性治股价在09到13年中完成主升浪，上涨20倍以上。\n\n\n\n\n关键词：医药创新，爆款，寡头垄断\n\n\n\n\n第四名：Netflix，智能电视老大。期间涨幅29倍。\n\n\n\n\n我的十倍股系列有详细说过，一直以来的爱股。总结其十倍股历程，netflix经历了转型期的挖坑，转型后的估值模式切换，以及之后的商业模式不断创新。2013年有自制剧，2014年提价，2015年有电影点播。数据支持+识别度提高+商业模式认同是其十倍股的本质。在大量互联网巨头进入流媒体后，行业空间被识别，但公司的护城河足够深（为什么苹果只能进入音乐，只能做on-demand TV）。而那些能在netflix上赚十倍的投资者真是对其商业模式以及护城河有了足够深刻的理解。\n\n\n\n\n关键词：模式转型，互联网，估值模式切换\n\n\n\n\n第五名：illumina，基因测序。期间涨幅22倍。\n\n\n\n\n大名鼎鼎的全球基因测序仪制造商，目前占到了全球71%的市场份额。国内许多人听说这个公司还是由于其CEO Jay Flatley在2014年1月JP Morgan的医疗会议上告知Illumina的新测序仪能准确地测出全基因组序列，把其成本由最开始的数十亿美元指数递减至不到1000美元，具有划时代意义。由于掌握核心设备技术，illumina的具有很强的定价权，而基因测序也因为成本下降可以进入普通医院，带来新的医疗创新。\n\n\n\n\n关键词：基因测序，定价权，潜在用户数大幅增长\n\n\n\n\n第六名：Skyworks Solution，半导体龙头。期间涨幅13倍。\n\n\n\n\n作为全球领先的IC芯片公司，Skyworks受益于智能手机的渗透率崛起。Skyworks为苹果、三星等手机厂商提供模拟和混合信号产品。苹果的iPhone 6里面发现有多颗Skyworks的功率放大器，据估计每一部iPhone 6使用到4美元Skyworks的产品。以智能手机为切入口，Skyworks切入汽车电子，物联网等领域。\n\n\n\n\n关键词：智能手机，物联网，科技创新\n\n\n\n\n第七名：Monster Beverage，功能饮料。期间涨幅13倍。\n\n\n\n\n同样是我喜欢的公司，Monster Beverage就是可口可乐入股的功能性饮料。最著名的是包装上那个怪物爪子。其实如果追溯到2002年，Monster Beverage的涨幅超过1000倍。Monster Beverage的上涨还是小众市场的长大。过去几年功能性饮料增速是最快的，09-14年复合增长率32%。Monster以其怪异，高科技的品牌形象成为年轻人最爱的功能性饮料之一，市场份额超过40%。\n\n\n\n\n关键词：小众消费品长大，年轻人市场\n\n\n\n\n第八名：亚马逊。期间涨幅12倍。\n\n\n\n\n这个也没啥可多说的，大家都有些了解。亚马逊也是明显受益于移动互联网的崛起，同时公司不断在创新。从互联网的Everything Store，到AWS云计算服务，再到智能硬件，亚马逊一直在给消费惊喜。伟大的管理层，伟大的商业模式。亚马逊虽然常年不盈利，但其给世界带来的价值是巨大的。\n\n\n\n\n关键词：互联网，电商，商业模式\n\n\n\n\n第九名：CF Industries。期间涨幅12倍。\n\n\n\n\n榜单中唯一的“周期性”行业。CF Industries是美国龙头化肥企业。过去几年其最大成本开支天然气不断下降，而氮肥价格又在上升，可以说给公司带来一个sweet spot。同时，2010年CF Industries收购了Terra，将公司规模效应大幅提高，也带来了更强的定价权。\n\n\n\n\n关键词：周期性，成本下降，并购\n\n\n\n\n第十名：Under Armour。期间涨幅9倍。\n\n\n\n\n我的爱股Under Armour。曾经详细写过其十倍股路程。作为运动紧身内衣龙头，从一个细分小众市场变成一个大众市场。产品含有科技元素，有逼格，有强品牌形象。UA创业20年，最开始的10年不断在打造自己的品牌，明确了运动紧身衣市场的龙头地位，告诉大家自己的科技属性。而之后的10年，这个品牌影响力越来越大，或者说“越来越有逼格”。连美国总统奥巴马都开始穿UA的衣服跑步，而纸牌屋中总统夫人夜跑的那身行头也是来自于UA。同时受益于运动品功能性提升，装备党崛起的时代背景。消费品经典牛股路线，具有很强的可复制性。美国品牌还能向全球输出。\n\n\n\n\n关键词：功能性，细分市场崛起，逼格消费品\n\n\n\n\n第十一名：苹果。期间涨幅8.8倍。\n\n\n\n\n我想对于全世界的影响力，苹果可能是排名第一的，这也是为什么苹果是过去几年全球市值最大的公司，直到最近被谷歌超越。过去十年科技行业的变革都来自于苹果对智能手机的创新。传统的功能机变成了智能机，移动互联网改变了许多人的生活。同时，苹果也开创了软硬结合的商业模式，IOS系统软件成了其壁垒，造成用户迁移成本极高。然后通过手机硬件来变现。今天，这种商业模式也被广为效仿。\n\n\n\n\n关键词：硬件创新，生态圈，定价权\n\n\n\n\n第十二名：DollarTree。期间涨幅8.7倍。\n\n\n\n\n一美元商品的连锁店。记得上次看日本过去十年大牛股中也有一个100日元连锁店。Dollar Tree的成长来自于精准的差异化定位和有效的战略部署。依赖特殊的廉价产品结构，和大型超市形成差异化竞争。Dollar Tree在年报中将所有商品分为了三类：第一类，被称为“基本消费品”，约占全部商品的50%，包括糖果食品、保健美容用品等；第二类被称为“多样化产品”，如玩具和礼品等，约占全部商品的45%；第三类是“季节性商品”，如复活节、万圣节、圣诞节用品，占5%。公司通过消库存模式，收购廉价商品然后卖出。第一类产品是“流量入口”，后两类商品有着巨大的毛利。\n\n\n\n\n关键词：新模式，连锁\n\n\n\n\n13-16名，分别是仿制药公司Perrigo，航空公司阿拉斯加航空，企业级云计算Salesforce，汽车DIY维修Autozone。\n\n"
		},
		{
			"post_id": 151,
			"title": "洪灾或加剧下半年通胀压力：菜价肉价又要涨！",
			"date_published": 1467989121.805,
			"body": "Blog post body"
		},
		{
			"post_id": 150,
			"title": "历史经验表明，灾后重建的投资需求是经济景气回升的动力之一",
			"date_published": 1467989027.681,
			"body": "1998年特大洪灾后的灾后重建，中央政府不仅对受灾区农村房屋重建进行了补贴，还将荆江大堤加固工程、洪湖监利长江干堤加固工程等长江水利六大工程纳入国债重大项目，在随后十余年的长江防洪过程中发挥了关键作用。在1999年国家新增的1000亿元长期国债中，投向水利建设的资金高达304亿元，加上年初计划投入的部分，1999年全年水利建设投入近500亿元。如此大规模的农田水利建设，对水泥、钢铁、施工机械都产生了巨大需求，并成为此后中国经济缓慢走出困境的因素之一。\n"
		},
		{
			"post_id": 149,
			"title": "大势震荡整理，个股缤纷灿烂",
			"date_published": 1467987947.978,
			"body": "Blog post body"
		},
		{
			"post_id": 148,
			"title": "现在仍有机会。英国脱欧那天前后，股市大跌1-2天，一个工商银行上海分行的高级研究员笑着来电话：“我满仓加透支（借钱）买股票了”。",
			"date_published": 1467987852.849,
			"body": "Blog post body"
		},
		{
			"post_id": 147,
			"title": "管理层主动收购二级市场自己公司股票的。如东阿阿胶在46-47元一带，买了不少二级市场股票，说明他们对自己公司有信心。这种公司值得信赖。",
			"date_published": 1467987731.092,
			"body": "Blog post body"
		},
		{
			"post_id": 146,
			"title": "有的股票，分红很高，比如6.5元的皖能电力，分0.3元。还有一些可以连分几年、每年固定分红的股票。但这类股票，熊市里下跌有限；牛市里也就不涨或少涨，属防守型的股票。",
			"date_published": 1467987691.977,
			"body": "Blog post body"
		},
		{
			"post_id": 145,
			"title": "最根本的原因是国内货币M2太多了。达160多万亿；而城乡居民存款达120万亿。加之利率是新中国历史上最低的时期；只要股市止跌了，人们就会在挣钱效应的吸引下，先少批，后半仓，后80%仓位进入股市",
			"date_published": 1467987510.055,
			"body": "Blog post body"
		},
		{
			"post_id": 144,
			"title": "在股市里做好了，是老百姓少有随时可以进出挑选个股，设法保值增值的地方。（做的好，如茅台，15年从30涨到2000元了，比北上广深房产增值强得多",
			"date_published": 1467987476.469,
			"body": "Blog post body"
		},
		{
			"post_id": 143,
			"title": "九十年代，铁腕总理（副总理）朱镕基令人民币从1:5.7一下子贬到1:10，又上升到1:8.28达10年；外汇储备及中国国力大增长10年。因此GDP增速慢一下，汇率贬一些也不怕。",
			"date_published": 1467987424.024,
			"body": "Blog post body"
		},
		{
			"post_id": 142,
			"title": "实体经济向下属实，但中国股市不是实体经济的晴雨表（很多时候是反周期的）。实体经济向下，货币政策只能宽松，对股市反而有利。",
			"date_published": 1467987351.847,
			"body": "Blog post body"
		},
		{
			"post_id": 141,
			"title": "下周初或现千股跌停",
			"date_published": 1467987278.923,
			"body": "Blog post body"
		},
		{
			"post_id": 140,
			"title": "从大趋势角度去测算，从沪指上市最初的月K线连接上升趋势线，我们可以神奇的发现，沪指居然几乎完美的在这个大的上升通道中运行。那么本轮调整的幅度主要取决于见底的时间，从大趋势的角度测算，大约在2200点左右。",
			"date_published": 1467985278.464,
			"body": "Blog post body"
		},
		{
			"post_id": 139,
			"title": "再仔细观察一个事实，那就是每次长期的底部出现的时候，一定是60月均线被跌破，60月均线一般被称为强弱分界线，如果连60月均线都没跌破，怎么能称之为大底，底部往往是在人们最恐慌和最绝望的时候出现的。",
			"date_published": 1467984444.616,
			"body": "it is a simple fact that, now, investors are not desporate and panic."
		},
		{
			"post_id": 138,
			"title": "从调整幅度来看，前几轮上涨之后的调整从高点算起，1993年的调整在80%，2001年之后的调整幅度55%，2007年之后金融危机的调整是72.8%，而2015年之后目前3波股灾调整下来幅度也不过49%，而杠杆的威力我们是体会到了的，如果不是国家队的救市，调整幅度可能是这么小吗？",
			"date_published": 1467984402.969,
			"body": "Blog post body"
		},
		{
			"post_id": 137,
			"title": "从大周期角度来看，目前这轮熊市周期才刚刚一年左右，重新进入大周期上涨还有待时日",
			"date_published": 1467984331.358,
			"body": "Blog post body"
		},
		{
			"post_id": 136,
			"title": "一波完整牛熊周期，大约在89个月左右，也就是7-8年之间，和大经济周期几乎完全一致",
			"date_published": 1467984222.149,
			"body": "Blog post body"
		},
		{
			"post_id": 135,
			"title": "一个股票为什么会涨？根本的原因就是跌的多了，有价值了，有人买了，同样，一个股票为什么会跌？根本原因也就是涨的多了，没价值了，主力出货了。",
			"date_published": 1467984138.361,
			"body": "Blog post body"
		},
		{
			"post_id": 134,
			"title": "大道至简，技术分析可以包含一切信息",
			"date_published": 1467984121.484,
			"body": "Blog post body"
		},
		{
			"post_id": 133,
			"title": "做大行情大机会，就需要有更高的格局和眼光",
			"date_published": 1467984071.5,
			"body": "Blog post body"
		},
		{
			"post_id": 132,
			"title": "杠杆也好，国家队也好，都只是外部的因素，内因才是最重要的。所以技术分析是第一要素，历史是会重演的",
			"date_published": 1467983866.944,
			"body": "Blog post body"
		},
		{
			"post_id": 131,
			"title": "沪指的牛市其实并没有真正开始，而中小创的牛市并没有完全的结束。也就造成了现在整体指数似乎不强还在寻底，但是一些题材股还在创新高的格局",
			"date_published": 1467983815.68,
			"body": "Blog post body"
		},
		{
			"post_id": 130,
			"title": "A股现在实际上是两个牛市，一个是沪指的牛市，一个是中小创的牛市，两者既有联系又有区别",
			"date_published": 1467983784.838,
			"body": "Blog post body"
		},
		{
			"post_id": 129,
			"title": "2638是不是底和国家队救不救市毫无关系。\n",
			"date_published": 1467983685.518,
			"body": "Blog post body"
		},
		{
			"post_id": 128,
			"title": "目前沪深两市的总市值大约47.3万亿，国家队救市资金也就1万亿左右，如果仅仅不卖，对于市场到底能有多大的影响？如果高抛低吸做差价的话，那到底是救市还是砸盘？",
			"date_published": 1467983640.088,
			"body": "Blog post body"
		},
		{
			"post_id": 127,
			"title": "A record number of mining companies are exploring for lithium in the Northern Territory.",
			"date_published": 1467983130.144,
			"body": "Blog post body"
		},
		{
			"post_id": 126,
			"title": "With a strong Chinese appetite driving demand for Australian branded vitamins, Chinese companies are now going a step further and looking for takeover targets.",
			"date_published": 1467983063.091,
			"body": "Blog post body"
		},
		{
			"post_id": 125,
			"title": "大城市化和居民加杠杆能支撑房价多久",
			"date_published": 1467981997.667,
			"body": "Blog post body"
		},
		{
			"post_id": 124,
			"title": "新能源汽车毋庸置疑已经成为中国股市白马龙头板块",
			"date_published": 1467979375.619,
			"body": "Blog post body"
		},
		{
			"post_id": 123,
			"title": "政治、军事、经济形势逐渐恶化的角度看，股市里要更加注意风险，更加重视防灾难概念股的重要性，比如战略小金属、期货概念股、中药疫苗概念股、航天军工小市值",
			"date_published": 1467979312.72,
			"body": "Blog post body"
		},
		{
			"post_id": 122,
			"title": "短线行情感觉：近期的市场走势比较稳健，新股发行节奏也比较合理，预计在7月20日江苏银行发行前的这段时间，大盘以平稳的可能性大，有短线投机的市场环境，以举牌概念股和人民币贬值概念股为投机目标，再辅以技术分析，可能能做出一定利润",
			"date_published": 1467977618.088,
			"body": "Blog post body"
		},
		{
			"post_id": 121,
			"title": "三天K线拉出三根逐渐放量的红三兵",
			"date_published": 1467977440.173,
			"body": "Blog post body"
		},
		{
			"post_id": 120,
			"title": "博汇纸业",
			"date_published": 1467977048.925,
			"body": "前期这个股我买过一次，买过没几天就涨停了，情况与这周的明星电力表现很相似，我对这个股有些感情，就像老情人一样，哈哈，这个股去年底今年初的市场表现，我记忆很深刻，2016-01-05日，公司发布公告，公司控股股东博汇集团于2015 年 12 月 8 日至 2015 年 12 月 29 日期间，通过上海证券交易所交易系统增持公司股份 5,182,100股，这期间的股价20天均价是3.8元多一点的样子，股价2015年12月29日开始异动，12月29日股价涨停，12月30日股价涨停，12月31日股灾3.0开始，1月4日市场出现第一次暴跌熔断，博汇纸业股价也跌停，但是1月5日，博汇纸业股价就反击涨停，1月7日市场第二次暴跌熔断，博汇纸业股价跌停，1月8日再次反击涨停，这种逆势股价反抗一直持续到1月20日，真顽强（可回看一下）！其后股价放弃了抵抗大势，低量的跌到了低位，我个人感觉有人被套了，被套的人性格还挺刚烈，我就一直把它放进重点自选股榜上观察，博汇纸业的股价目前只有3块多，比较适合游资主力操作，大股东还有其他未上市资产，具有投机的想象力，本周前三天K线拉出三根逐渐放量的红三兵，Macd良性，今天上午的走势明显强于大盘，感觉有人想闹事，于是我下午就买进了不少。"
		},
		{
			"post_id": 119,
			"title": "热点规律逻辑",
			"date_published": 1467976717.274,
			"body": "当前的市场热点注意力主要有2个，第一个是万科复牌宝万之争，也就是举牌股权之争；第二个是货币贬值，导致黄金等贵金属大涨。按照这个逻辑规律，我本周选股的时候，主要是选取有股权之争并同时受益于人民币贬值的个股，再适当考虑重组的可能性，按照这个标准，两市中最符合条件的个股应该是凤竹纺织，这个股去年曾经被阳光人寿举牌，目前持有1360.01万股，面对阳光人寿的举牌攻势，凤竹纺织控股股东及其一致行动人在也采取了增持措施，6月8日增持590.77万股，占总股本的2.17%；7月21日和7月22日，又增持628.13万股，占总股本的2.31%，并表示在未来6个月内根据证券市场整体状况适时增持。人民币自5月初以来，人民币对美元持续走贬，尤其自6月24日英国脱欧公投事件以来，贬值加速，7月6日美元兑人民币中间价走到6.7关口。这周黄金股走势走势强劲，主要就是受益于货币贬值，但周五股价有短线回调的迹象，而同样受益于人民币贬值的纺织造纸板块中的潜力股则出现了低位放量启动的征兆，看到凤竹纺织的Macd良性，而且这个股也属于壳资源股，有一定的赌注价值，综合条件复合选股的4个思维，且人民币贬值概念具有防止人民币继续贬值影响股市黑天鹅的可能性，周五就决定买进了该股"
		},
		{
			"post_id": 118,
			"title": "新仓持股逻辑",
			"date_published": 1467976238.519,
			"body": "选股的思维有4个:\n- 当前热点规律逻辑，题材是第一生产力，有庄则灵，Macd良性"
		},
		{
			"post_id": 117,
			"title": "大盘本波行情就是波中级反弹，空间也就是300--400点左右，本波行情盈利最大的操作方法就是一路持有白酒和医药及医疗器械，贵州茅台已经做出了榜样，后面五粮液接棒，再之后有次新白酒迎驾贡酒、今世缘、口子窖等急先锋追上，白酒经过几年反腐后，估值已低，人民币贬值和深港通及大量印钞票，使得很多白酒价格不再是昂贵，大众消费时代已经来临",
			"date_published": 1467975989.93,
			"body": "Blog post body"
		},
		{
			"post_id": 116,
			"title": "三千下筹码难得！要敢买！ ",
			"date_published": 1467975831.911,
			"body": "国家队救市后已经成为了市场最大的主力，它们巨量筹码要盈利出局，唯一的办法就是横走几天突然拉权重拉出一根长阳，之后利用散户和技术派追进形成的惯性上冲，减仓一些筹码，再进入新的整理，如此反复，是今年行情的特点"
		},
		{
			"post_id": 115,
			"title": "SIAI---证券投资人工智能系统",
			"date_published": 1467975762.022,
			"body": "SIAI业务在基金业正在崛起，系统管理的基金在2012年几乎为零，2014年仅140亿美元，2015年突破1万亿美元，。预计在2020年，系统管理的基金规模有望超过200万亿美元。 在中国，北京济安金信与腾讯财经共同开发的“腾讯-济安价值100指数”2013年5月上线后，历时3年领跑各大指数，超越绝大多数公募私募基金，累计涨幅107.94%。\n\n机器人投顾是大数据金融的一个分支，伴随着普惠金融市场的高速增长，证券化红利从机构和富人的神坛走向民间，蚂蚁金服公司以支付宝业务为基础纵横拓展，短短几年时间就跻身于全球一流金融企业，不久前完成的B轮估值已高达3900亿元（600亿美元）！\n"
		},
		{
			"post_id": 114,
			"title": "智能手机的应用足以证明人的普遍性“弱智”",
			"date_published": 1467975447.81,
			"body": "Blog post body"
		},
		{
			"post_id": 113,
			"title": "证监会罚没兴业证券5738万元 兰翔和伍文翔将10年禁入市场",
			"date_published": 1467975044.881,
			"body": "中国证监会拟决定对公司及兰翔先生、伍文翔先生作出行政处罚及市场禁入措施:\n\n　　一、对公司给予警告，没收保荐业务收入 1,200 万元，并处以 2,400 万元罚款；没收承销股票违法所得 2,078 万元，并处以 60 万元罚款。\n\n　　二、对兰翔、伍文翔给予警告，并分别处以 30 万元罚款，撤销证券从业资格。此外，根据《证券法》第二百三十三条和《证券市场禁入规定》（证监会令第 33 号）第五条的规定，中国证监会拟对兰翔、伍文翔分别采取 10 年证券市场禁入措施。\n"
		},
		{
			"post_id": 112,
			"title": "证监会：欣泰电气启动强制退市程序 退市后不得恢复上市",
			"date_published": 1467974315.232,
			"body": "证监会新闻发言人张晓军8日表示：证监会8日已经完成对欣泰电气涉嫌欺诈发行以及信息披露违法违规案的调查工作，已发送行政处罚决定书和市场禁入决定书，对欣泰电气及相关当事人作出了行政处罚及市场禁入决定。而深交所层面，将对欣泰电气启动退市程序，且根据相关规定，欣泰电气不可重新上市。\n\n　　张晓军强调，证监会对欣泰电气欺诈发行坚决打击、绝不手软。证监会将冻结或限制行政责任当事人的原始股份，并关注相关股东减持合规性；加强对欣泰电气监管，确保欣泰电气正常生产经营，对于其首发剩余资金采取专户监管等。\n\n　　他表示，证监会将本着“绝不放过任何一个涉案主体、绝不放过任何一项违法失职行为、绝不放过任何一项需要承担的法律责任”的原则，充分行使和发挥行政、自律组织的职权职能作用，严格追究、推动落实案件责任人应当承担的行政、刑事和民事法律责任，对欣泰电气的相关中介机构的违法违规行为，依法坚决予以查处，全面追究责任。\n\n周五晚间公告，欣泰电气(300372,股吧)收到证监会的《行政处罚决定书》及《市场禁入决定书》，除对相关人员处以罚款外，对温德乙、刘明胜采取终身证券市场禁入措施，终身不得从事证券业务或担任上市公司董事、监事、高级管理人员职务。\n\n　　公司股票7月11日继续停牌一天，7月12日起复牌交易，证券简称将调整为“*欣泰”，股票价格的日涨跌幅限制比例不变。目前无现金实施股份回购承诺。深交所将自公司股票复牌30个交易日期限届满后的次一交易日对公司股票实施停牌，并在停牌后15个交易日内作出是否暂停公司股票上市的决定。\n\n　　　一、公司股票存在暂停上市风险\n\n　　2015 年 7 月 14 日，丹东欣泰电气股份有限公司（以下简称“公司”）收到中国证监会《调查通知书》（深证调查通字 15069 号）。因公司涉嫌违反证券法律法规，根据《中华人民共和国证券法》的有关规定，决定对公司立案调查。在调查期间，公司积极配合中国证监会的调查工作，并严格按照监管要求履行信息披露义务。上述信息本公司已于 2015 年 7 月 15 日在中国证监会指定信息披露网站进行了披露（公告编号：2015-078）。公司原根据《深圳证券交易所创业板股票上市规则（2014 年修订）》11.11.3 条的要求，每月至少披露一次公司股票可能被暂停上市的风险提示公告。由于 2015 年 11 月 27 日、12 月 10 日公司通过巨潮网分别披露了《关于对以前年度重大会计差错更正与追溯调整的公告》（公告编号：2015-134）和《关于 2015 年半年度财务报告会计差错更正的公告》（公告编号：2015-138），为了更好地提醒投资者注意投资风险，后改为每十五日披露一次公司股票可能被暂停上市的风险提示公告。 2016 年 5 月 31 日，公司收到中国证监会《行政处罚和市场禁入事先告知书》（处罚字[2016]57 号），并于 2016 年 6 月 1 日披露了《关于收到中国证券监督管理委员会<行政处罚和市场禁入事先告知书>的公告》（公告编号：2016-058）。公司因可能触及《深圳证券交易所创业板股票上市规则（2014 年修订）》第 13.1.1 条规定的欺诈发行或者重大信息披露违法情形，存在暂停上市风险，自 2016 年 6 月 2 日起，每五个交易日发布一次公司股票可能被暂停上市的风险提示公告。\n\n　　　　二、公司收到《行政处罚决定书》及《市场禁入决定书》情况\n\n　　2016年 7月7日，公司收到中国证监会《行政处罚决定书》（[2016]84 号）及《市场禁入决定书》（[2016]5 号），并于 2016年7月8日披露了《关于收到中国证券监督管理委员会<行政处罚决定书>及<市场禁入决定书>的公告》（公告编号：2016-066）。\n\n　　　　三、公司股票交易安排根据\n\n　　《深圳证券交易所创业板股票上市规则（2014 年修订）》13.1.8 条的规定，2016 年 7 月 7 日，公司收到中国证监会《行政处罚决定书》（[2016]84 号）及《市场禁入决定书》（[2016]5 号），2016 年 7 月 8 日对外公告（公告编号： 2016-066）。公司股票将于公告次一交易日即 7 月 11 日继续停牌一天，7 月 12 日起复牌，交易三十个交易日。深圳证券交易所将自公司股票复牌三十个交易日期限届满后的次一交易日对公司股票实施停牌，并在停牌后十五个交易日内作出是否暂停公司股票上市的决定。\n\n"
		},
		{
			"post_id": 111,
			"title": "茅台不算什么",
			"date_published": 1467906414.038,
			"body": "自2014年7月22日以来，有76只个股累计涨幅超过300%，有158只个股在此期间涨幅在200%-300%之间，还有664只个股的涨幅在100%-200%之间。\n\n涨幅靠前的多位中小板和创业板公司为主，而这些个股正是市场偏爱重组概念、壳资源，例如世纪游轮、鼎泰新材、恺英网络、分众传媒等，近两年来累计涨幅都在300%以上。"
		},
		{
			"post_id": 110,
			"title": "凡是大盘跳水中抗跌的品种，均可值得认真分析",
			"date_published": 1467905837.623,
			"body": "Blog post body"
		},
		{
			"post_id": 109,
			"title": "高送转填权这一历来确定性的机会，尤其值得重点跟踪和挖掘",
			"date_published": 1467905794.215,
			"body": "Blog post body"
		},
		{
			"post_id": 108,
			"title": "更加重要的是，考虑到咱们国家M2增速每年都在增长，现在A股的低估值尤其具有爆发性",
			"date_published": 1467905684.154,
			"body": "虽然12、13、14年上半年A股低点在2000点附近，但那时候的货币投放量跟现在是不可比的"
		},
		{
			"post_id": 107,
			"title": "目前A股的估值处在历史的均衡位置甚至略低一点的位置",
			"date_published": 1467905659.341,
			"body": "Blog post body"
		},
		{
			"post_id": 106,
			"title": "今年几乎每一天，股市都始终有大批股票涨停？！",
			"date_published": 1467905506.071,
			"body": "Blog post body"
		},
		{
			"post_id": 105,
			"title": "大灾之后有大疫，可关注医药医疗板块",
			"date_published": 1467905299.932,
			"body": "Blog post body"
		},
		{
			"post_id": 104,
			"title": "Bond market is in an ‘epic bubble of colossal proportions’ ",
			"date_published": 1467904886.676,
			"body": "Blog post body"
		},
		{
			"post_id": 103,
			"title": "6月下旬起，中国黄河以南部分省份遭遇强降雨，如湖北、安徽、江苏、江西、广东等地，而这些省份多是一些金属的主要产销集散地。一些金属企业被迫暂停生产引起今天有色、稀土全线走强，英洛华、中色股份、贵研铂业、华友钴业、云海金属等多只个股涨停，板块整体涨幅在3%左右",
			"date_published": 1467901434.988,
			"body": "Blog post body"
		},
		{
			"post_id": 102,
			"title": "短期量子通信、国产软件、无人驾驶等科技股进入蓄势阶段可以逢低加仓",
			"date_published": 1467901321.006,
			"body": "Blog post body"
		},
		{
			"post_id": 101,
			"title": "经济上有一个很有意思的现象，高端的产品，价格适当的提升，销量反而会更好",
			"date_published": 1467900763.745,
			"body": "Blog post body"
		},
		{
			"post_id": 100,
			"title": "A股的国际化明显加快",
			"date_published": 1467900638.812,
			"body": "Blog post body"
		},
		{
			"post_id": 99,
			"title": "每次熊市结束，进入震荡市，贵州茅台这类消费龙头往往得到资金的重点关注",
			"date_published": 1467900599.767,
			"body": "Blog post body"
		},
		{
			"post_id": 98,
			"title": "下一个飞天茅台",
			"date_published": 1467900492.99,
			"body": "贵州茅台股价持续创出历史新高，近期突破了300这一重要关口。\n\n \n\n贵州茅台的上涨源于多个因素，其一是白酒行业的业绩整体反转。从今年以来白酒行业的销售状况来看，白酒行业的中报业绩非常值得期待。一季度贵州茅台的经销商打款高达85.45亿元，创下2011年以来的历史新高。五粮液一季度预收款则高达68.26亿元，比2015年底增长242.36%。其实经历长达四年的全面调整，政务消费在白酒消费中的比例已经大幅下降。前期机构对于贵州茅台的调研显示，目前三公消费在茅台占比已经从40%降至1%，民间消费崛起已经成功实现对政务消费的换血替代。正因为如此，上述信息对于白酒行业的影响已经远远没有四年前那样大。白酒行业的中报业绩甚至全年的业绩，均值得期待。白酒行业的业绩反转，是建立在此前四年的行业大调整的基础上的。四年的大调整过程中，贵州茅台的产品价格虽然持续下跌，但是市场份额却在不断提升，一旦如今年这样整个行业回暖，则茅台在行业内反而有了比以前更大的优势，更为牢靠的龙头地位。\n\n \n\n此外，每次熊市结束，进入震荡市，贵州茅台这类消费龙头往往得到资金的重点关注。相比前几年，今年有一个新的变化，也是值得我们以后重点关注的。今年以来，A股的国际化明显加快，在此前的沪港通的基础上，今年的深港通的预期也在不算升温。A股纳入MSCI也是上半年的一个大议题，虽然暂时纳入失败，但是管理层为纳入MSCI指数做了诸多努力，譬如将QFII额度申请与机构投资规模挂钩，不再对单家机构设置统一的投资额度上限；在简化额度审批管理，超过基础额度的，才需外汇局审批；在资本管制方面，对QFII投资本金不再设置汇入期限要求等等。诸多政策其实是放宽了外资投资A股的限制，虽然此次纳入MSCI指数失利，但是未来纳入也是没有太大悬念的。A股纳入国际化，会增强资金的流动性，内部的资金会出去，外部的资金也会进来，茅台这类消费龙头则是国际市场价值投资的关注重点。从4月份以来的沪港通也可以看出，贵州埋汰是沪股通资金流入关注的一个重要品种之一。\n\n \n\n我们可以按照类似的思路去思考，谁会成为下一个贵州茅台？\n\n \n\n其一、需要和茅台一样是消费行业。这是海外机构资金价值投资配置的一个重点行业，也能长期持有。\n\n \n\n其二、必须为行业龙头，或者子行业的龙头。必须具备资源的稀缺性，以及对于产品价格的掌控能力。 只有企业的产品极为具备差异性，并且行业内部是不可复制，这样就有了资源的稀缺性。稀缺性意味着价格的掌控能力，企业在行业好转的时候，可以适时的提高价格，进而持续提升企业的业绩。归根结底，就是企业需要有产品的定价权。这一点，其实是最核心的。\n\n \n\n其三、公司产品定位高端，常年的业绩增长稳健。产品定位高端，其实也跟产品资源的稀缺性有关系。经济上有一个很有意思的现象，高端的产品，价格适当的提升，销量反而会更好。\n\n \n\n其四、公司的业绩处于稳步向好的过程中。就像茅台一样，虽然业绩稳健，但是过去四年整个白酒行业调整期，茅台的业绩增长速度也在放缓。因此，这类企业的业绩增长速度，应该有提升的预期。这样的话，其上升的趋势会更为明确一些。\n\n \n\n符合上述条件的上市公司范围已经大大缩小，但是还是有一批。因此，最后就需要对每家上市公司做出更深入的研究，包括上市公司的管理层，公司未来的几年的规划，公司的营销和产品策略等等，最终选择出两家左右自己认可的上市公司。这类个股，适合占一部分仓位，作为中长期的资产配置的一部分。\n\n"
		},
		{
			"post_id": 97,
			"title": "领涨",
			"date_published": 1467900380.61,
			"body": " 行业今天领涨的是有色金属板块，领涨股是中色股份。3日领涨的是贵金属板块，龙头是中金黄金。\n       概念今天领涨的是超级电容板块，领涨股是洛阳钼业。3日领涨的是黄金概念板块，龙头是贵研铂业。\n       区域今天领涨的是西藏板块，领涨股是梅花生物。3日领涨的是甘肃板块，龙头是中核钛白。\n主力资金净流入最多的是有色金属、材料行业和木业家具板块，净流出最多的是软件服务、电子信息和机械行业板块。\n      今天涨停的股票有48只，涨停最多的是有色金属板块，有6只涨停；其次是机械行业板块，有5只涨停，再次是化工行业板块，有4只涨停。"
		},
		{
			"post_id": 96,
			"title": "目前我国集成电路市场规模占全球的60%，但自给率仅为27%，存在较大提升空间",
			"date_published": 1467900014.613,
			"body": "七星电子、中颖电子、太极实业、上海新阳、通富微电、士兰微、晶方科技"
		},
		{
			"post_id": 95,
			"title": "2016年上海地区集成电路项目正有序推进，其中华虹宏力新设备线已进入环评阶段，中芯国际将在上海新建12寸线，上海上马的12寸大硅片项目推进顺利，即将试产，而在2015年，上海市集成电路产业实现销售收入950亿，实现两位数增长",
			"date_published": 1467899930.969,
			"body": "Blog post body"
		},
		{
			"post_id": 94,
			"title": "共有1044家上市公司公布2016年中期业绩预告，其中，696家公司业绩预喜，占比达66.67%，从行业分布来看，预喜公司占比居前的三个行业分别为建筑装饰、农林牧渔及电子",
			"date_published": 1467899892.497,
			"body": "Blog post body"
		},
		{
			"post_id": 93,
			"title": "猪肉板块",
			"date_published": 1467898906.579,
			"body": "这两三个月猪肉一直居高不下，既然这两三个月价格居高不下的话，那么很多猪肉个股中报业绩都会超预期的。为何会说超预期？因为，很多个股中报业绩预告一般都是在一季报公布完后出预告，而这两三个月猪肉再次大幅涨价，公司当时出的预告业绩肯定是以当时猪肉价格为基础去计算，后面两三个月价格再涨肯定会再次大幅提振中报业绩。加上，最近南方洪涝灾情很厉害，对这些畜牧业更是有一个短期强刺激作用。"
		},
		{
			"post_id": 92,
			"title": "2600~3000点那段是场外资金赚钱，而3000点上方，哪家能承接掉抛压，哪家就是接下来赢家",
			"date_published": 1467896004.865,
			"body": "Blog post body"
		},
		{
			"post_id": 91,
			"title": "公募",
			"date_published": 1467895890.666,
			"body": "公募的仓位80%以上都是规定的，他们买什么股票都不用他来说，猜都猜的到。还说现在公募浑身都是枪眼，处处被人算计。就拿这波行情上涨来说，拉升主力军就不是公募，因为1月份跌的太快，公募都套死在里面，真正推升这把行情的是场外的增量。虽然到底是谁不好说，但目的再清楚没有了，就等公募买了，给他们接盘。并且对于他们公募来说，哪怕本意3000点之上不想买股票也得买，因为上半年已经亏得不行，下半年行情有机会，你要是不去做，那对上没法交代，对买基金的人也没法交代。而现在他们要破这个局，能想的办法就是几家公募抱团，虽然每个基金能调控的余量不多，但几家一联手，资金量就很大的，然后把抛压全部承接掉，拉出足够的空间主动权就到他们手上了。 "
		},
		{
			"post_id": 90,
			"title": "price level",
			"date_published": 1467892878.002,
			"body": "\n\n\n上海证券交易所，平均市盈率：14.90倍，平均价： 8.24元。\n\n 深圳证券交易所，平均市盈率：41.10倍，平均价：14.40元。\n\n2015年参考\n\n市盈率高点是2015年6月12日34.17倍\n\n两市平均股价高点是2015年6月12日的17.81元\n\n两市成交金额低点是2015年9月30日的3712亿元，高点是2015年5月28日的24206亿元    \n\n\n\n\n2014年参考\n\n市盈率低点是2014年5月19日的12.33倍，高点是2014年12月31日19.57倍。\n\n"
		},
		{
			"post_id": 89,
			"title": "当多头市场接近巅峰时，卖掉涨得最多的，因为涨得越高，跌得越深，卖掉涨得最慢的，因为涨不上去的，势必会跌得更惨。",
			"date_published": 1467892274.688,
			"body": "Blog post body"
		},
		{
			"post_id": 88,
			"title": "交易不是勤劳致富，而是风险管理致富",
			"date_published": 1467892239.678,
			"body": "Blog post body"
		},
		{
			"post_id": 87,
			"title": "下跌的速度比上涨的速度大3倍",
			"date_published": 1467892205.991,
			"body": "Blog post body"
		},
		{
			"post_id": 86,
			"title": "市场一定会用一切办法来证明大多数人是错的。",
			"date_published": 1467892170.008,
			"body": "Blog post body"
		},
		{
			"post_id": 85,
			"title": "股市如果出现恐慌性抛盘，股市就是见底之时。股市如果出现疯狂性买盘，股市就是见顶之时。",
			"date_published": 1467892148.461,
			"body": "Blog post body"
		},
		{
			"post_id": 84,
			"title": "股市如果找到下跌原因之时，股市就是见底之日。股市如果找到上升原因之时，股市就是见顶之日。",
			"date_published": 1467892128.873,
			"body": "Blog post body"
		},
		{
			"post_id": 83,
			"title": "股市下跌，不需要任何理由。股市上升也不需要任何理由。",
			"date_published": 1467892106.648,
			"body": "Blog post body"
		},
		{
			"post_id": 82,
			"title": "技术指标是随着股价变动而变动，不是股价随着技术指标的变动而变动。",
			"date_published": 1467892066.146,
			"body": "Blog post body"
		},
		{
			"post_id": 81,
			"title": "任何波浪形态都是庄家做出来的，并为庄家服务。",
			"date_published": 1467892039.594,
			"body": "Blog post body"
		},
		{
			"post_id": 80,
			"title": "股市下跌时成交量可以不用放大，股市上涨时成交量必须放大。",
			"date_published": 1467892021.069,
			"body": "Blog post body"
		},
		{
			"post_id": 79,
			"title": "会买的是徒弟，会卖的是师傅，会休息的是师爷。",
			"date_published": 1467891999.375,
			"body": "Blog post body"
		},
		{
			"post_id": 78,
			"title": "股票市场是上帝根据人性的弱点而设计的一个陷阱。",
			"date_published": 1467891962.111,
			"body": "Blog post body"
		},
		{
			"post_id": 77,
			"title": "在我25年股市生涯里，去年第一次股灾到现在这么长的时间股市没有中级行情史无前例，但我一点不灰心不着急，因为证券市场永远符合自然界和易经阴阳转换之道，压抑的久了只能证明后面会有一个大幅度而且是漫长的上涨周期，你只要忍到那个时候就发了，还是一个忍字！",
			"date_published": 1467891860.391,
			"body": "Blog post body"
		},
		{
			"post_id": 76,
			"title": "强庄股最简单定义就是：爷们，从不拖泥带水，在他想拉升的时候就跟着老大发财，在他发脾气想出货的时候赶紧出货远离他，就是纯粹的江湖老大的感觉，有面儿，有范儿，顺之者昌逆之者亡！",
			"date_published": 1467891419.985,
			"body": "Blog post body"
		},
		{
			"post_id": 75,
			"title": "没有庄家的股票都随大盘走，很少能特立独行走出涨停板！",
			"date_published": 1467891376.572,
			"body": "Blog post body"
		},
		{
			"post_id": 74,
			"title": "强庄股还有一个显著地特点，就是你研究这种股票历史走势会发现，它封涨停板的速度极快，一般都是秒封，也没有什么书呆子的三浪五浪的，就是立起来干，陡直的义无反顾的大单子干，连续干，迅速封于涨停板！",
			"date_published": 1467891356.359,
			"body": "Blog post body"
		},
		{
			"post_id": 73,
			"title": "总之一山不容二虎，强庄股的特点你必须跟随庄家的方向走，不能干扰他，否则必然干你没商量",
			"date_published": 1467891290.382,
			"body": "Blog post body"
		},
		{
			"post_id": 72,
			"title": "强庄股盘口一般都很轻，不要有连续的上压板或者下托板，谁敢装相在卖盘挂个几十万股大单子，狠庄都会一笔吃掉，同样你想在买盘挂个大单子装主力，狠庄一笔砸给你，然后凌厉陡直的洗盘",
			"date_published": 1467891224.424,
			"body": "Blog post body"
		},
		{
			"post_id": 71,
			"title": "强庄股最主要的特征必须是强于大盘，也就是大盘上涨的时候比大盘涨的多，大盘下跌的时候比大盘跌的少，缺一不可。",
			"date_published": 1467890767.292,
			"body": "Blog post body"
		},
		{
			"post_id": 70,
			"title": "股票有没有庄家呢？这点至关重要，因为只有持有强庄股，你才有可能实现资金快速翻倍，而没有庄家的股票只能在大盘的腥风血雨之下随波逐流。",
			"date_published": 1467890740.826,
			"body": "Blog post body"
		},
		{
			"post_id": 69,
			"title": "绝大多数小市值股票里都有庄家，所以小市值才是中国股市翻倍王军团。\n\n",
			"date_published": 1467890708.794,
			"body": "Blog post body"
		},
		{
			"post_id": 68,
			"title": "绝大部分大盘股都没有庄家，因为他们根本没有资金实力来控制那些庞然大物。",
			"date_published": 1467890683.671,
			"body": "Blog post body"
		},
		{
			"post_id": 67,
			"title": "中石油里面有长期上万几亿几十亿的股东，一群弱智傻瓜而已，他们赚不到一分钱。原因是中石油根本没有控制盘面走势的庄家。",
			"date_published": 1467890649.348,
			"body": "Blog post body"
		},
		{
			"post_id": 66,
			"title": "回落2950再掀升浪！",
			"date_published": 1467890342.856,
			"body": "Blog post body"
		},
		{
			"post_id": 65,
			"title": "大盘已经进入了中级反弹行情，是今年最赚钱的行情，大盘调整必须勇于买股",
			"date_published": 1467890317.5,
			"body": "Blog post body"
		},
		{
			"post_id": 64,
			"title": "全球资源将继续上涨，黄金等大宗商品疯涨后，由于我们正好遇到1988年来的最大水灾，农产品也将涨价",
			"date_published": 1467890233.173,
			"body": "Blog post body"
		},
		{
			"post_id": 63,
			"title": "从大点的周期来看，5178以来的熊市已经结束，7月翻身行情不会才开头就结束，从周K线来看，本周及下周大盘将处于整理，却不改大盘中期向上的格局",
			"date_published": 1467890194.742,
			"body": "Blog post body"
		},
		{
			"post_id": 62,
			"title": "野蛮行动拉指数跟风盘已经稀少，主力在这个位置想再为所欲为拉指数已经力不从心",
			"date_published": 1467890141.518,
			"body": "Blog post body"
		},
		{
			"post_id": 61,
			"title": "大量资金被套万科，使得市场存量资金缩小，这些资金又是最激进的资金，对市场信心打击不小",
			"date_published": 1467890112.126,
			"body": "Blog post body"
		},
		{
			"post_id": 60,
			"title": "盘中频繁跳水，说明解套盘和获利盘纷纷急着要出局",
			"date_published": 1467890077.328,
			"body": "Blog post body"
		},
		{
			"post_id": 59,
			"title": "连续三天来主力转移到黄金白银有色白酒等防御股，说明主动攻击欲望已经撤离，做多信心已经不足",
			"date_published": 1467890055.863,
			"body": "Blog post body"
		},
		{
			"post_id": 58,
			"title": "冲动真的是魔鬼，所有的冲动都基于一点----恐怕失去赚块钱机会",
			"date_published": 1467889769.988,
			"body": "Blog post body"
		},
		{
			"post_id": 57,
			"title": "中国股市26年了，很多事情实际上是没有变过的，比如：‘七赔、二平、一赚’的市场格局多少年都没有变过",
			"date_published": 1467889639.682,
			"body": "Blog post body"
		},
		{
			"post_id": 56,
			"title": "楔形顶明显",
			"date_published": 1467889423.422,
			"body": "楔形顶明显，结构基本封闭，大雨将至。\n第一目标是7月4日的底部，所谓空对空。\n途中，12日如果短反弹，18日可以反序，\n随后继续下跌.\n\n如果这个判断成立，周五应该冲高卖出。"
		},
		{
			"post_id": 55,
			"title": "近年资源板块通常在行情的末端开始表现",
			"date_published": 1467889373.224,
			"body": "最近几个交易日有色金属板块独树一帜红红火火，是板块繁荣周期到来还是板块轮动的尾声？有色金属现在凭什么独树一帜，难道仅仅是包括黄金在内的金属期货反弹10%所导致？显然有色金属板块持续上涨的理由不充分，就是短期炒作。而近年资源板块通常在行情的末端开始表现，近些日子有色金属板块有所表现更像是板块轮动尾声。\n"
		},
		{
			"post_id": 54,
			"title": "大盘波段行情走势",
			"date_published": 1467812148.824,
			"body": "大盘波段行情才开始不久，采取的方式将是长阳+小阴小阳整理+中阴，以此为循环，逐步将指数推高，我们认为目标至少在3200点以上；2、这样的方式推高指数，最有利防御性和消费性品种个股的上涨，黄金、白银、有色、煤炭、白酒、饮料、猪肉等概念股，持续性最佳"
		},
		{
			"post_id": 53,
			"title": "人民币大幅贬值，今天离岸已经突破6.702，虽然对资源股是利好，但是，对A股的负面迟早会体现出来",
			"date_published": 1467812079.671,
			"body": "Blog post body"
		},
		{
			"post_id": 52,
			"title": "热点轮动过快，昨天铁路基建领涨，今天则领跌，表明市场短炒是主流",
			"date_published": 1467811584.43,
			"body": "Blog post body"
		},
		{
			"post_id": 51,
			"title": "选择防御性品种本身就说明当前股市估值过高",
			"date_published": 1467811539.949,
			"body": "Blog post body"
		},
		{
			"post_id": 50,
			"title": "重点还是蓝筹股，尤其是从近期盘面来看，酿酒、有色、军工、农业等二线蓝筹股成为了重点",
			"date_published": 1467808785.581,
			"body": "Blog post body"
		},
		{
			"post_id": 49,
			"title": "喝酒大涨之后就是吃药，这也是顺理成章的事情",
			"date_published": 1467807485.814,
			"body": "Blog post body"
		},
		{
			"post_id": 48,
			"title": "白酒为什么暴涨",
			"date_published": 1467807140.665,
			"body": "白酒股的利好驱动因素：\n\n\n1、市场避险情绪依然高涨，因为资金不愿意去博弈高位股，那样很容易遇到套牢盘，和获利盘的双重夹击，得不偿失。\n\n\n2、万科股权大战，有资金开始瞄上了白酒股，这是一块大肥肉，未来这些股票很容易被资金作为吸纳的对象。\n\n\n3、白酒股开始复苏了，最典型的是茅台五粮液纷纷提价。白酒是稀缺产品，就那么点产能和那么大点的窖池，需求确实一定的，价格一提高，利润滚滚而来。现在人们不喝低档酒了，开始和高档酒。\n\n\n4、贵州茅台的历史新高召唤着小弟们跟上，后面的行情如火如荼。\n"
		},
		{
			"post_id": 47,
			"title": "重回一月初",
			"date_published": 1467806836.509,
			"body": "当前这种市场里，基本面反正就是底了，政策又不打击炒股，只要有钱愿意推，肯定能涨回去。而听他这么一说，我也用博尔系统去量化那些表现已经超过1月份的股票，结果发现先兆都是很明确的，那就是价格超越1月水平的时候，增量资金主导交易的水平早就超过了。就像金贵银业，3月份的时候已经收复全部的股灾失地，而对比一下增量资金主导交易的红柱，2月份开始已经比去年4季度的时候更强了。结果后面是越来越强，现在已经涨的没边了。还有像金种子酒，2~4月的反击是增量资金主导红柱不行，所以那时候根本别指望收复失地。但5月市场僵尸横盘的时候，他的增量资金红柱爆发了，超过去年4季度，结果在一个没人看好的时刻也能回到股灾前的水平。"
		},
		{
			"post_id": 46,
			"title": "4、5、6三个月参与的人现在多数都是盈利状态，那赚钱效应会不断的体现出来",
			"date_published": 1467806548.062,
			"body": "4月调整以来的平均持仓成本已经过了好几天，所以最近4、5、6三个月参与的人现在多数都是盈利状态，那赚钱效应会不断的体现出来，从而吸引场外增量资金进场。而场外增量更多的不是去追逐几个老热点，处于资金的本性，一定是没怎么大涨的股票里找机会，短期上一个持续新热点很快会成型，这将会成为未来短线上的重点。"
		},
		{
			"post_id": 45,
			"title": "万科是个已摁下启爆健的500亿杠杆炸弹 ",
			"date_published": 1467804731.831,
			"body": "Blog post body"
		},
		{
			"post_id": 44,
			"title": "新能源汽车，现在以电动为主，但为什么今后不会被氢能源取代？",
			"date_published": 1467804561.271,
			"body": "Blog post body"
		},
		{
			"post_id": 43,
			"title": "什么资产具有保值功能？",
			"date_published": 1467803643.773,
			"body": "（1）具有独立知识产权的、较为容易保存生活必须品。比如，中药当中就有大量这类属性的产品。（2）易于保存的资源类商品，比如，黄金、白银、铜以及其他稀有而耐氧化金属，这类商品，世界各国无论如何都会需要，只要价格事宜，可以较为方便地变成世界任何国家的货币，尤其是，一旦出现大的危机，这类商品的价格会有巨大变化。不是因为工业生产需求，而是因为保值需求。"
		},
		{
			"post_id": 42,
			"title": "什么英国脱欧公投，什么乐视网停牌，巨无霸万科停牌，这些地雷都已经拆开，都还是彩蛋。",
			"date_published": 1467803089.941,
			"body": "Blog post body"
		},
		{
			"post_id": 41,
			"title": "市场的方向从来都是掌握在少数人的手里",
			"date_published": 1467803018.83,
			"body": "Blog post body"
		},
		{
			"post_id": 40,
			"title": "美元可看作全球股市的反向指标",
			"date_published": 1467802671.732,
			"body": "美元可看作全球股市的反向指标，对于A股也不例外。我们都知道，美元作为国际储备货币，其走势与商品呈负相关，而美元与全球的股市的关系基本也是如此。从历史上看，每一轮美元的扩张、贬值周期基本都对应着全球资本市场的繁荣，股市、商品通常会出现上涨，而反之则下跌。如今美联储已经开始收紧货币，去年开启了加息时间窗，且今后要缩减资产负债表。这意味着美元开始进入紧缩周期，美元的供给将会减少，美元将会进入上行通道。我们都知道当“钱很多”时就会推高资产价格，反之资产价格就会下跌。而如今美元变少了，那么全球的股市会怎么样就可想而知了。对于中国，美元的升值会加剧人民币贬值和资本的外流，这势必会对中国资本市场造成冲击，形成不利影响。\n\n二者的相关度达到80％，虽然有时也会同涨同跌，但大部分时候是反向的"
		},
		{
			"post_id": 39,
			"title": "A股当前和近期的走势特点",
			"date_published": 1467726268.286,
			"body": "国家队救市救成了大庄家，对指数已经是绝对控盘，这就让大盘缺乏了系统风险，虽然A股没跌透，估值依旧很高，但是，养老金要入市，救市的国家队要赚钱出来，这都封杀了下跌空间，提供了上涨的动力，只是如此大的庄家，在市场上找对手盘使得众多基金都害怕，其结果，就只能是各唱各的调，控盘的国家队在蓝筹股上拉抬吸引跟风盘做差价，各路基金则在中小创、新股上大肆炒作，如此步调就很不一致，使得A股难有漂亮的趋势上行行情，给大家看到的就是震荡或台阶式上涨，这就是A股当前和近期的走势特点。\n\n由于大家都明白国家队控盘大盘，指数跌不下去，只是大家必须防止进入权重股成为国家队的对手盘，所以，大盘的调整幅度非常有限，一旦市场平均成本被抬高，国家队无法派发筹码了，就又会拉指数，再出现长阳，来吸引跟风盘成为对手盘，由此，我们认为大盘的调整仅仅是等待5日线靠近，这个判断若正确，那么周四调整就结束，大盘将再度拉起；3097是个重要的压力点，若有效突破，就形成了大双底，我们认为，大盘在3097上下，会遇到很重的抛压，大盘到时候会产生比较明显的调整，而这之前，大盘总体上是安全的。"
		},
		{
			"post_id": 38,
			"title": "均线多头排列和空头排列 ",
			"date_published": 1467716215.504,
			"body": "\n\n\n\n \n \n均线多头排列和空头排列 \n\n　　多头排列 ：参数较小的短期均线在参数较大的长期均线的上方,并且均线向上发散,这种排列就是我们常说的多头排列。 \n　　实战意义 ：一只股票或大盘的多头排列,说明了市场短期内买进的投资者的平均成本超过了长期持有该股的平均成本。换句话说,就是短期内新进场的投资者情愿用高于长期平均成本的价格来购买股票。也意味着长期持有者已经获利了。这种盈利效应将会影响没有进入的投资者（买的越早越赚。。。）,从而形成看多的氛围。 \n\n　　空头排列 ：参数较小的短期均线在参数较大的长期均线的下方,并且均线向下发散,这种排列就是我们常说的空头排列。 \n　　实战意义 ：一只股票或大盘的空头排列,说明了市场短期内买进的投资者的平均成本超低于长期持有该股的平均成本。同多头排列相反。意味着长期持有者已经获亏损。这种亏损效应将会影响没有进入的投资者（买的越晚越便宜。。。）,从而形成看空的氛围\n"
		},
		{
			"post_id": 37,
			"title": "杀庄",
			"date_published": 1467713565.189,
			"body": "（一）盘口变化盯庄家的秘诀\n\n这是庄家无法藏身的盘口数据。庄家可以利用股价走势对技术指标进行精心“绘制”，但由于庄家的进出量大，如以散户通常的每笔成交量操作，其进出周期过长 将致使延误战机，导致做庄失败。平均每笔成交量突然放大，肯定有庄家。至于庄家的方向和目的，需配合其它情况具体分析。\n\n1、挂单心理战\n\n在买盘或卖盘中挂出巨量的买单或卖单，纯粹是庄家引导股价朝某方向走的一种方法。其目的一但达到，挂单就撤消。这也是庄家用来引导股价的常用手法。当买 盘挂出巨单时，卖方散户心理会产生压力。是否如此大单买进，股价还会看高一线?相反，当卖盘挂出巨单时，买方散户会望而却步。斗智斗勇在盘口，散户只须胆 大心细，遇事不慌，信仰坚定，暂死跟庄。\n\n2、内外盘中显真情\n\n内盘是以买盘价成交的成交量，也就是卖方的成交量。\n\n外盘是以卖盘价成的成交量，也就是买方的成交量。庄家只要进出，是很难逃脱内外盘盘口的。虽可用对敲盘暂时迷惑人，但庄家大量筹码的进出，必然会从内外盘中流露出来。\n\n3、隐形盘中露马脚\n\n盘口中，买卖盘面所放的挂单，往往是庄家骗人用的假象。大量的卖盘挂单俗称上盖板，大量的买盘挂单俗称下托板。而真正庄家目的性买卖盘通常是及时成交的，隐形盘虽在买卖盘口看不到，但在成交盘中是跑不了的。因此，研究隐形盘的成交与挂单的关系，就可看清庄家的嘴脸。\n\n4、盘口秘诀\n\n（1） 上有盖板，而出现大量隐形外盘，股价不跌，为大幅上涨的先兆。\n\n（2） 下有托板，而出现大量隐形内盘，为庄家出货迹象。\n\n（3） 外盘大于内盘，股价不上涨，警惕庄家出货。\n\n（4） 内盘大于外盘，价跌量增，连续第二天，是明眼人最后一次出货的机会。\n\n（5） 内外盘都较小，股价轻微上涨，是庄家锁定筹码。轻轻地托着股价上走的时候。\n\n（6） 外盘大于内盘，股价仍上升，看高一线。\n\n（7） 内盘大于外盘，股价不跌或反有微升，可能有庄家进场。\n\n（二）三招便知主力是否出逃!\n\n中小投资者判断主力是否出逃已经显得非常重要。那么，如何判断一只个股主力没有出逃呢?\n\n第一：趋势总是大涨小回，底部不断抬高。\n\n这个识别方法是技术上的重要手段，股票运行的方式有上涨、下跌、横盘这三种，一只股票中主力没有出局的重要识别 方式就是任何一次下跌形成的新的低点不会低于以往一个时期的次低位置，任何庄家洗盘，不会把盘底都洗穿，这是必须要清醒认识的问题，这也说明，主力不容许 市场成本低于自己的持仓成本，否则就应该理解为主力不计成本出走。\n\n第二：中长期均线系统必须是多头排列。\n\n其用意是，主力资金的长期护盘结果，好的技术形态利于个股股价推高，容易树立良好的市场口碑，盘口买卖活跃，才能 够利于主力出货和派发，很难想象，一只技术形态不完美的个股，主力做庄的难度会是如何，当然，这一点在洗盘阶段除外。即使有跌破重要的技术位置，主力也会 在不久的时间里有效收复。\n\n第三：整体趋势强于大盘。\n\n用简单的文字描述就是，大盘上涨的时候，个股涨幅大于大盘同期涨幅，而大势向坏或下跌的时候，以横盘或小幅调整代替。\n\n以上三点是识别主力没有出局的基本诀窍。当然，以往总结的其他方式，像成交量（换手率）、趋势线、是否出现衰竭性缺口、股价短期涨幅大小、市场消息利多是否增加等等，都是辅助识别方式，考虑到市场主力手法诡异多变，最有效的识别方式当为以上三点了。\n\n只要以上重要识别方式没有发生改变，投资者不妨任由主力震仓、洗盘，安心迎接强庄股的一个个新高出现。\n\n（三）揭秘庄家吸货\n\n通常大主力建仓方法主要有以下几种：\n\n1、隐蔽吸货，不露声色。\n\n此类股票的走势大都是当前阶段的冷门股，在相对于它过去的较低的价格上进行箱形盘整，与大盘的趋势一致，成交量很小。因此在建 仓阶段，尽量不能让人察觉有大资金介入，在操作上不能大手笔地明码执杖地买入，而必须将大资金拆小，这对于资金量大的机构主力来说，相对建仓时间会较长， 因而也必须要有足够的耐心和耐力，因为在底部吸的筹码越多，其建仓的成本越低。通常在低位盘整时间越长，则未来涨幅越大。对这类股票投资人只要注意就可以 了，不必介入其中和庄家比耐心。\n\n2、震荡建仓，上打下拉。\n\n由于底部的低点较难判断，同时大资金不可能全在最低点吸到筹码，因此大资金在进入底部区域后即开始分批建仓，越低越买。由于建 仓过程中难以避免不将股价抬高，但此时或是筹码尚未吸够，或是拉高时机没到，因此必须以少量筹码再次将股价打低，甚至打出恐慌盘、斩仓盘、止蚀盘。等到散 户心灰意冷的时候，便是大量吸筹完毕发动进攻的时候。\n\n3、拉高吸货，哄抢筹码。\n\n当突发性重大利好公布或者是股价已极度超值之时，某股票尚无主力入驻、散户正犹豫之时，大集团资金往往先下手为强，在当日大量 买入低位筹码，即使拉涨停板也在所不惜。往往在几天或几个小时就可完成建仓任务。\n"
		},
		{
			"post_id": 36,
			"title": "如何通过板块分析大盘上涨",
			"date_published": 1467713561.629,
			"body": "万科复牌连续跌停，沪市大盘国企股却象听到了冲锋号，强势上冲，上证指数今天突破3000点，同时将万科连续跌停带给市场的负面影响消化于无形。\n\n现在的问题是：这样一个敏感时刻，大盘国企股们突然来了精神，其亢奋上涨，是推升大盘指数？稳定市场情绪？还是真有一波象模象样的大盘蓝筹行情？\n\n不妨先看看是哪些大盘国企股在上涨？\n\n最突出的是煤炭、钢铁、有色金属类大盘国企股，是业绩亏损较重的行业。同时也是政策性“去库存，去产能”的主要对象，这些大盘国企股如果仅是超跌反弹不足为奇，但如果让它们引领一波上涨行情？还是让人心里不踏实。\n\n再就是稀缺资源类，大基建板块、航空运输、机械重工、电力水利等，都有轮番表现，整体涨幅最大的是黄金，然后是煤炭，以及钢铁板块中的强势题材品种。黄金股上涨有其合理性，煤炭钢铁更多是国企改革带给市场的想象空间。但值得注意的是，更有影响力的大盘蓝筹品种象大金融板块（包括银行、券商、保险），“两桶油”，在近期大盘国企股行情中，却表现得相对稳重，即便跟风涨一点，也非主动。这从另一个角度提示人们，眼下的所谓大盘国企股行情，并非新崛起的趋势性力量所推动。\n\n从历史经验看，长期滞涨的大盘国企股，往往会在比较关键的时候突然启动行情，充当维护市场稳定的力量。或者在大盘指数需要冲关的时刻，它们挺身而出，发挥杠杆撬动指数的功能。但这种上涨大多缺乏持续性，其上涨一旦完成某种使命，便会被渐渐打回原形，重新回归沉寂。这些特点，使这些大盘国企股多数时间里更象工具，而非投资获利的目标。\n"
		},
		{
			"post_id": 35,
			"title": "接下来大宗商品将再次崛起导致期货概念股翻倍，同时抵抗疫情的疫苗、中药等股票应对灾难暴涨",
			"date_published": 1467644593.339,
			"body": "Blog post body"
		},
		{
			"post_id": 34,
			"title": "电动车产业链",
			"date_published": 1467643865.651,
			"body": "Blog post body"
		},
		{
			"post_id": 33,
			"title": "行情总在犹豫中爆发，妖股总在沉默中走妖",
			"date_published": 1467642646.06,
			"body": "Blog post body"
		},
		{
			"post_id": 32,
			"title": "婴儿用品板块值得关注",
			"date_published": 1467637377.719,
			"body": "Blog post body"
		},
		{
			"post_id": 31,
			"title": "板块策略",
			"date_published": 1467637300.535,
			"body": "躺着赚钱是最好的方法，也就是养老、白酒、医疗医药、国产软件中的成长股，买入后耐心等待拉升，一直到本波结束再卖出"
		},
		{
			"post_id": 30,
			"title": "上涨节奏",
			"date_published": 1467634551.077,
			"body": "大盘进入了进三退二时期，指望连续大涨不实际，指望出现大的回调也不现实，大盘本次上涨将持续到8月中旬，目标3200点到3300点。"
		},
		{
			"post_id": 29,
			"title": "目前的形式",
			"date_published": 1467634420.03,
			"body": "包括国家队在内的多头对指数的控制已经到了庄股的程度，只是由于缺乏增量资金，多头不得不顾及拉高能否派发问题，也因此国家队等缺乏对手盘，而不得不拉一个台阶震荡一段时间，以等待对手盘的出现，这是救市后的新形势，要立即认识清楚。"
		},
		{
			"post_id": 28,
			"title": "量和价",
			"date_published": 1467634038.693,
			"body": "煤炭开采1～5月，产量13.4亿吨，同比下降8.4%，今年行业出现供给收缩，这必然拉动煤炭板块的上涨。涨幅居前的兖州煤业(600188)多次涨停"
		},
		{
			"post_id": 27,
			"title": "炒作之天气逻辑",
			"date_published": 1467633778.106,
			"body": "近期长江中下游沿江地区及江淮、西南东部等地出现入汛以来最强降雨过程，部分地区发生严重洪涝灾害。国家必将大力发展水利基础设施建设，水利板因此块大幅跃升。安徽水利(600502)、青龙管业(002457)全力领涨。"
		},
		{
			"post_id": 26,
			"title": "炒股策略",
			"date_published": 1467633134.749,
			"body": "专盯低流通市值、低价格股票打短线。周六说的利君股份，启动前8.8元，24亿流通市值，就是增量资金在横盘中取得主动权之后，股价爆发，结果今天又涨停，才几天时间市值36亿了。还有美晨科技今天接近4个点的涨幅也超过市场。而我自己找的新朋股份，10元的价格水平，32亿的流通市值，博尔系统量化下来，增量资金主导交易的红柱在震荡中也是越来越有优势，结果今天涨幅也是5个点。"
		},
		{
			"post_id": 25,
			"title": "“大基建+PPP”",
			"date_published": 1467631697.403,
			"body": "怎么样才能把保险业的充沛资金吸引到实体经济里去？“保险资金间接投资基础设施”就是一个非常重要的渠道。这个渠道是2006年开通的，2013年之后逐步做大。虽然有诸多限制，但仍然吸引了将近9000亿资金。\n \n据保监会的最近统计，截至今年5月末，保险资产管理机构累计发起设立基础设施债权投资计划300项、基础设施股权投资计划17项，合计注册（备案）规模8938.26亿元。通过这种方式，京沪高铁获得投资160亿元，南水北调中东线工程获得投资550亿元。\n \n通过这种方式，保险公司改善了资产配置结构，获得了合理的回报。比如债权投资计划平均投资期限7.54年，平均年收益率为6.65%。\n \n“保险资金间接投资基础设施”有债券、股权、物权等几种常见的投资方式。以债券计划为例，一般来说由保险公司作为委托人，发起一项针对某个具体项目的投资计划，设定投资金额、回报率、还款方式等，由信托公司、保险资产管理公司或产业投资基金管理公司为受托人，同时选择托管人（比如一家银行）、独立监督人等。至于受益人（实际出资并获得投资回报的机构或个人），可以是保险公司自身，也可以是企业或者个人。\n \n保监会此次新政主要内容是：第一，取消了“保险资金间接投资基础设施”的行政许可事项；第二，拓宽了投资范围；第三，引入了PPP模式；第四，将加快保险资金登记交易平台建设，实现基础设施投资计划的登记发行、交易转让、质押融资、资金结算和信息披露等一站式服务功能。\n \n其中第四项非常值得注意，因为保险公司设立的“基础设施投资计划”可以质押融资，这就增加了资产的流动性，等于给“保险资金间接投资基础设施”加了杠杆。\n \n到今年5月底，中国保险业总资产已经逼近14万亿，“保险资金间接投资基础设施”如果全面铺开，至少可以给“大基建”带来1万亿的增量资金。这对于引导资金进入实体经济、稳增长来说，都将产生积极作用。\n \n而这，仅仅是国家用“大基建”激活民间投资计划的一部分。\n"
		},
		{
			"post_id": 24,
			"title": "the market of july",
			"date_published": 1467630089.177,
			"body": "由于中国金融市场的开放度低，英国脱欧对上个星期中国股市影响不是很大，但在上半年，中国股市仍然是创世界股市下跌幅度第三，亚洲股市跌幅最大的记录。即上半年的中国股市基本上无运行，而且这种格局在7月份还有可能延续。\n\n因为，英国脱欧后，对世界经济的影响仅仅是开始，它的冲击与影响到底会有多大，未来存在一系列的不确定性。比如，为了应对这些不确定性，全球各国央行再次可能联手加大货币政策宽松，以此救世界经济。但是各国央行这样做，结果如何是不知道的。因为，现有的事实已经证明，全球各国央行这样做，根本就没有多少效果，反之会让全球市场的热钱更多，让更多的资金在全球市场流窜而冲击各国市场。\n\n可以说，当前全球各国股市最大的问题，或股市震荡的频率越来越高、冲击越来越大，并非实体经济增长不好，也不是上市公司业绩不行，更重要的是金融市场资金或热钱过多，它们在全球市场流窜并随时冲击各个市场，造成这些市场巨大的震荡。全球市场是这样，中国市场也如此。所以，各国央行货币政策再宽松，不是救起衰退的经济而是让热钱充斥各金融市场，让这些热钱快速流动而造成市场巨大的震荡，从而增加了国际市场不确定性。\n\n对于中国的投资者来说，特别是关注在英国脱欧后全球各国央行货币政策的动向，特别是关注美联储及日本央行货币政策的动向，因为这可能让美联储的货币政策逆转，从而让资金又从美国金融体系流出；也会可能改变日本的央行货币政策，从而让正在流向日本的资金也发生突然的逆转，日元又出现贬值；当然更重要的是英国脱欧可能让欧盟解体而造成全球市场的巨大震荡。这些国内投资者都是要注意的事件。\n\n当然更要关注的是中国当前的经济形势。对于当前中国的经济形势，尽管在第一季度中国经济增长能够保持在6.7%的水平，其重要的原因是一月份及之后，一线城市及部分二线城市的房价疯狂上涨，而造成了全国房地产市场全面繁荣，出现住房销售面积及销售金额快速上涨，而这种增长则是成了一季度经济增长主要动力。当然这种动力在二季度其他一些城市还在延续，但是这种延续的动力正在减弱，因为以高房价推动的经济增长是不可持续的。只要中国央行信贷过度扩张的货币政策不加码，首付贷等高杠杆方式得到限制，房价的疯狂上涨就会得到制止。所以，当一线城市的房价疯狂上涨得到收敛之后，以房价疯狂上涨的经济增长能否得以持续是相当不确定性。当前一线城市的情况就表明了这点。\n\n如果房地产拉动经济增长的动力减弱，那么第二季度中国的经济增长能否保持第一季度那种态势也是不确定的。比如，进入第二季度，中国的多项经济指标都出现了全面的转弱。比如工业生产、外贸出口、內需消费，自4月起又开始转弱，所以，第二季经济增长能否稳定在6.7%，还是进一步减速，事实上同样不可乐观。下半年的情况更是如此。\n\n更为重要的是，正如前面所指出的，如果房地产拉动经济增长的动力全面减弱，如果更多的经济数据也在减弱，那么，下半年的经济增长是否能够保持政府今年设定的底线同样是不一定的。从上个星期五公布的上个月国内采购经济指数（PMI）看，国内经济面临的困难与不确定性正在增加，就业压力也在上升。制造业PMI的从业人员指数跌至47.9%。这个数据表明了中国制造业招聘正在持续收缩。政府希望服务业向好来增长国内就业市场的平稳，但是实际上同期的非制造业PMI的从业人员指数收缩得更严重。而这些不仅意味着中国经济结构调整及淘汰落后产能严重影响居民就业，更重要的是失业加剧会影响国内居民的收入，影响国内居民的消费，从而导致内需进一步减弱。\n\n所以，就目前国内外的经济经济来看，下半年中国经济形势一点都不容乐观。这不仅在于国际市场的不确定性正在增加，也在于国内经济增长的动力正在减弱，特别是“房地产化”经济正在减弱，这些都会严重中国股市。\n\n还有，就目前中国股市的情况来看，中国股市正在自我修复之中，市场的信心要得以恢复还是一个漫长的过程。尽管刘士余主席上任之后正在对股市进行多方面的整顿，这有利于市场秩序的确立及投资者对股市的信心恢复，但就当前中国股市来说，不进行重大的制度改革，市场秩序要得以恢复是不容易的。不过，就当前中国股市来说，任何重大的改革都会对市场造成大的冲击，都不利于股市的休养生息及自我修复。如何在这两者之间达到平衡，则当前监管层面对的难题，也是当前中国股市面对的难题。在这种情况下，中国股市也只能在静静成长。这可能是下半年中国股市的基本态势。\n"
		},
		{
			"post_id": 23,
			"title": "let's start the game of yuan",
			"date_published": 1467629877.233,
			"body": "http://127.0.0.1:43110/1GyXxHvbnePhZNAQKsPMhXGWi5JeuXWzoC"
		},
		{
			"post_id": 22,
			"title": "如何找到大主力介入的股票",
			"date_published": 1467627399.783,
			"body": "如何找到大主力介入的股票，往往成为取得较大收益的关键：\n\n    1.股价长期下跌，股价止跌回升，上升时成交量放大，回档时成交萎缩，日K线图上呈阳线多于阴线。阳线对应的成交量呈明显放大特征，用一条斜线把成交量峰值相连，明显呈上升状。表明主力庄家处于收集阶段，每日成交明细表中可以见抛单数额少，买单大手笔数额多。这表明散户在抛售，而有只“无形的手”即主力庄家在入市吸纳，收集筹码。 \n\n　　2.股价形成圆弧底，成交量越来越小。这时眼见下跌缺乏动力，主力悄悄入市收集，成交量开始逐步放大，股价因主力介入而底部抬高。 \n\n　　3.股价低迷时刻，上市公布利空。股价大幅低开，引发广大中小散户抛售，大主力介入股价反而上扬，成交量放大，股价该跌时反而大幅上扬，惟有主力庄家才敢逆市而为，可确认主力介入。 \n\n　　4.股价呈长方形上下震荡，上扬时成交量放大，下跌时成交量萎缩，经过数日洗筹后，主力庄家耐心洗筹吓退跟风者，后再进一步放量上攻。\n"
		},
		{
			"post_id": 21,
			"title": "上涨形态",
			"date_published": 1467626802.731,
			"body": "我们复盘回看过去两个月的三颗阳线，5月31日、6月15日和6月27日。这三颗阳线在分时走势上，都呈现了‘稳步吸筹’式的状态，这与‘脉冲式’上涨截然不同。‘稳步吸筹’的上涨在分时上持续的时间在30分钟--120分钟，上攻角度也呈现趋于45?的特征，成交量能温和有序。‘脉冲式’上涨持续10分钟-15分钟，有些短促的仅有几分钟，角度在75?以上，量能迅速释放。"
		},
		{
			"post_id": 20,
			"title": "涨停的艺术",
			"date_published": 1467555134.429,
			"body": "Blog post body"
		},
		{
			"post_id": 19,
			"title": "新三板分层正式落地实施",
			"date_published": 1467549066.468,
			"body": "作为今年承上启下的关键时间节点，这一周，新三板分层正式落地实施，新三板进入2.0时代，但行情依然低迷；这一周，依然有公司陆续上新三板，这一周，首批被强制摘牌或主动退市公司成为市场优胜劣汰的注解；这一周开始，新三板2016年中报披露正式拉开序幕，中报行情是否值得期待？这一周，新三板市场依然纷扰非常，有人哭有人笑……新三板还是那个新三板，只是时间不一样，剧情也将不一样！\n\n　　2016年上半年已经过去，我们很怀念它；2016年下半年已经到来，我们祈望市场行情触底反转，成为多层次资本市场最闪耀的那一极！\n\n　　以下为本周新三板市场热点焦点新闻摘选，并配以独家热辣点评以飨读者，欢迎列位看官留言指点，新三板资本圈期待与您共同为市场发展献言献策！\n\n　　1、新三板分层第一周 行情欠佳市场惨淡分层利好出尽？\n\n　　6月24日正式发布了进入创新层企业的初始名单，最终进入新三板创新层初选的公司共953家，将贵州三力制药股份有限公司等39家挂牌公司调整进入创新层名单，将包括九鼎集团、联讯证券等在内的6家公司调出创新层名单。27日(本周一)，新三板正式实施分层管理。\n\n　　但从本周5个转让日的市况来看，分层之后的新三板市场依然缺乏亮点，指数屡次跌穿历史低值，市场成交量价齐跌，日均成交额更是持续维持在5-6亿元左右，较活跃期跌幅近半。与此同时，新三板融资案例和融资金额也延续了分层前的低迷态势，自5月总融资额创一年新低后，6月份的融资金额仍在低位徘徊。分层之后，市场并未如人们的期待那样雄起。\n\n　　点评：新三板分层制度从征求方案稿到创新层名单最终出炉，半年时间过去，这一利好已经被市场消化殆尽，分层也成为今年上半年最大的话题和利好，分层尘埃落定宣告短期内利好出尽。\n\n　　成熟的资本市场，政策利好固然是强心针，但市场的长期健康、可持续发展，不能依赖政策的强心剂，而是应该靠内生成长来推动市场的健康稳定发展。更何况，仍处于发展初期的新三板市场，制度建设还在持续推进当中，短期的不给力掩盖不了市场长期向好的趋势。因此，参与新三板就不能目光短浅，放长线才能钓大鱼！\n\n　　2、2016中报披露正式开启，中报行情是否值得期待？\n\n　　根据股转公司的安排，6月28-30日，7600多家挂牌公司将进行中报披露预约，从7月1日起至8月31日，这7600多家公司将陆续披露2016年中报。\n\n　　年报披露大限紧接着就是中报披露窗口开启。就在6月30日，股转公司对未能在最后期限披露年报的朗顿教育、中成新星两家公司强制摘牌，另有5家为按时披露年报的公司已经主动摘牌，5家公司正在申请摘牌。这也给7600多家有中报披露责任和义务的挂牌公司敲响警钟。\n\n　　新三板2015年年报的业绩已经证明，挂牌公司的业绩成长性值得期待。然而，进入2016年以来，新三板市场的表现却不尽如人意，指数下跌、交投不活跃、成交额低位徘徊，市场融资功能被弱化。经过半年的低位盘整，中报披露季是否会触底反弹并开启一波“中报行情”呢？\n\n　　点评：首先，新三板在快速发展存在各种问题，但其基本面还是向好的，市场的融资功能也是正常的，新三板市场阶段性的低迷属于正常的波动；\n\n　　其次，新三板挂牌公司2016年中期业绩整体应该不会低于预期，尤其是创新层公司，将更能体现其成长性和价值，因此，行情下行的空间有限；\n\n　　其三，市场低迷导致投资者恐慌和观望的情绪仍将持续一段时间，但借助于中报业绩的预期利好，市场面上或将得到修复，预计下半年市场面会得到改善，但光靠中报利好来刺激显然是不可持续的，效果也是有限的。\n\n　　3、新三板首次强制摘牌 将建立常态化退市制度\n\n　　周四是新三板挂牌公司2015年年报延期披露的大限，但仍有两家公司朗顿教育和中成新星未能及时发布年度报告，而被股转公司强制摘牌，这是股转公司首次实施强制摘牌。\n\n　　4月29日年报截止日，在当时6900多家挂牌企业中，有62家因为没有按时发布年报被股转公司暂停转让。除了5家已经摘牌和5家正在申请摘牌的企业，其他公司必须在6月30日晚上8点前披露年报，否则将面临强制摘牌。\n\n　　股转公司在周四晚间发布的公告中称，此次实施强制摘牌，是加强监管的一项重要举措，将对市场产生警示效应，将对不履行信息披露义务、存在重大违法违规等情形并触发退市条件的挂牌公司采取“零容忍”，坚决予以摘牌。股转公司还表示，将加快制定出台挂牌公司终止挂牌的实施细则，建立常态化退出机制，实现市场优胜劣汰。\n\n　　点评：股转此举，可以重点从三个方面进行解读：信息披露、市场监管、退市制度。\n\n　　信披规范性作为新三板市场建设发展的重要内容，监管层从年报披露违规延期等方面入手，对于大限截至仍无法交卷者，必须强制摘牌退市，同时，也倒逼其他存在同样问题的挂牌公司主动或被动退市，此类违法违规今后仍会有，但底线和后果也活生生摆在那儿，在中报披露开启之际，警示作用被最大化；\n\n　　决策层和监管层严抓市场监管，信披是其中之一，今后包括财务造假、董监高违法违规、资金占用、关联交易等都将成为监管的重要内容，力度不会减弱只会更大，这是市场发展的必然要求和趋势，挂牌公司必须遵从游戏规则，否则后果自负；\n\n　　在退市方面，强制退市和主动退市双管齐下，为今后出台和完善新三板退市制度做足铺垫，退市制度也是市场优胜劣汰、去伪存真的内在需求，决策层和监管层，也绝不能容忍注册制下的新三板市场，成为坑蒙拐骗偷者的乐园！\n\n　　4、股转诚邀社会各界对挂牌及拟挂牌公司进行监督\n\n　　本周三(6月9日)，股转公司发布公告称，去年及今年上半年分别收到103项和200多件举报，主要涉及信披不实或遗漏、企业违法违规、商业纠纷、股权债券纠纷等方面。股转还指出，挂牌及拟挂牌公司的合规运作需要社会各界的监督。\n\n　　点评：一方面，随着挂牌公司数量急剧增加，各类违法违规行为日益增多，且涉及的面会更广，这是市场发展初级阶段客观存在的事实；另一方面，对着监管力度和监管范围的扩大，各种被隐藏被忽视的违法违规行为，陆续被抓个正着，今后仍会有更多更隐蔽、更“有技术含量”的违法违规行为被逮住曝光。\n\n　　发展新三板市场，建设多层次资本市场，是国家经济转型升级和供给侧改革的重要战略任务，新三板市场的发展、繁荣、稳定，不只是决策层和监管层的责任，而是全社会共同的责任。光靠管是管不住的，也会让股转公司疲于奔命，需要包括主办券商、会计师事务所、律所、投资者等各市场主体共同参与，也需要全社会进行监督，更重要的是，要从根本上、制度上制定游戏规则，让挂牌公司不敢犯、不想犯！\n\n　　5、新三板定增融资连续跌破百亿，市场萎缩原因何在？\n\n　　进入2016年后，第一季度因为春节的影响，融资额度受到一定影响，全市场规模368.5亿。而2016年第二季度定增市场的融资规模降至293亿，这也是一年时间以来，单季度融资规模首次跌破300亿大关。\n\n　　全国股转系统公布的5月数据显示，全市场定增规模仅74亿，完成发行次数也降至200次左右。一级市场融资规模稳定在单月100亿近一年时间后，包括流动性在内的多重因素最终影响到了新三板定增市场。统计数据显示，6月定增规模依旧没有超过百亿，更加值得注意的是，6月206次的发行次数也跌至近年来的低点。\n\n　　点评：新三板一级市场衰退已是不争的事实，一级市场融资规模以及活跃度下降是多重因素共同造成的。一个重要因素便是二级市场始终未能活跃起来，不要说去年随着A股一路跌，春节后新三板做市指数一直在跌，仅仅在分层方案征求意见稿出台之后反弹了数日，随后至今每周都在创新低。\n\n　　以前大家推测监管层对二级市场流动性问题不重视，是因为一级市场的融资确实没有问题，但这两个月的数据开始下滑了，一二级市场本就是联动的，二级市场萎靡，缺乏退出通道最终肯定会影响到一级市场的融资。\n\n　　唇亡齿寒。新三板市场一级市场和二级市场是联动的，是同呼吸共命运的，二者一荣俱荣、一损俱损，因此，定增市场低迷，归根到底还是市场的流动性、流动性、流动性！\n\n　　6、新三板路演市场火爆，须慎防野鸡平台各种“坑”\n\n　　新三板挂牌公司数量众多，但行情不佳、流动性紧缺和投资者少而趋谨，企业融资困局倒逼企业必须主动走出去。\n\n　　今年上半年，全国各地路演市场日益火爆，政企联手、协会/联盟主办或第三方路演服务商召集的新三板路演活动几乎每日都在上演，各种路演形式包括现场路演、在线路演、微信群及APP路演等五花八门。\n\n　　眼花缭乱的新三板路演市场，政企联手正在成为重要推手。此外，在新三板市场火爆的2015年，全国各地的新三板企业家协会/联盟、投融资协会、挂牌公司联盟，以及各类第三方服务商如雨后春笋般涌现，而这些组织和机构，也成为当前路演市场的推手。\n\n　　点评：挂牌公司望“钱“欲穿，投资机构对优秀项目求贤若渴。路演是拉近企业与投资者的桥梁，未来会逐渐常态化。\n\n　　市况惨淡，路演未必能融到资，但不路演只会越走越艰难。然而，市面上各种路演多如牛毛，路演机构水平资质也是参差不齐，李逵李鬼真假难辨。选择路演平台，最重要的是平台和机构的项目筛选能力、风控水平、投资人等各种资源、投融资效率等方面，当然，平台的专业性和市场号召力、品牌形象也非常重要！\n\n　　7、新三板公司资金占用触目惊心，将成下一个严打目标？\n\n　　截至2016年6月7日，在7491家挂牌公司中，共有6963家公司发布资金占用公告，剔除占用金额为零、经营性资金占用以及未说明资金占用是否为经营性占用的5303家公司，有1660家公司发生了非经营性的资金占用。考虑到1390家公司未对资金占用的原因进行说明，实际上存在非经营性资金占用的公司远不止1660家。\n\n　　资金占用分为经营性资金占用和非经营性资金占用，其中非经营性资金占用一般是不正常的。据不完全统计数据显示，非经营性资金占用的公司主要集中在制造业、信息服务业，分别有860家、345家，占比为51.81%、20.78%。其余445家分布在科研服务业、租赁服务业、批发零售业等。\n\n　　占用挂牌公司资金主要有三种形式：通过关联交易转移占用挂牌公司资产；非经营性交易直接占用挂牌公司资金；利用挂牌公司进行违规担保。\n\n　　资金占用的主要原因包括：改制不彻底，关联交易严重；股东利益严重分歧，一股独大；法人治理结构不规范，缺乏有效的内部制约机制；会计制度的缺陷，会计信息失真以及法律制度的建设不健全，违规成本较低。\n\n　　点评：新三板2015年的火爆行情，让很多圈钱或耍钱的资本玩家们尽情撒欢，却坑害了整个市场、坑苦了真正需要融资做实体经济的挂牌公司。可以预见，此类资金占用情况不可能就此销声匿迹，只会通过更多方式和更隐秘的渠道、以新的面貌出现，挂牌公司财务规范和资金规范将任重而道远。\n\n　　新三板不是赌场，更不是任意圈钱者的天堂，否则这将于新三板的行为初衷背道而驰。很明显，监管层已经认识到了恶意圈钱、任性撒钱等扰乱正常市场秩序行为所导致的破坏性和恶果。\n\n　　今年上半年，关于大股东占款、关联交易占款等，股转公司已经揪出个别案例，中报披露窗，此类行为仍将存在，监管层已经子弹上膛，就看谁下一个、下一批谁将撞到枪口上，为监管祭旗！\n\n　　8、上半年新三板融资已超600亿，全年有望超1300亿元\n\n　　截至6月23日，全国中小企业股份转让系统(新三板市场)股票发行融资总额达到616.63亿元。今年上半年截至 6月23日，新三板市场股票发行融资总额达616.63亿元，大致相当于去年全年的一半。\n\n　　但不容忽视的是，挂牌公司定增融资的难度正在加大。\n\n　　据股转系统数据，5月份新三板市场股票发行225次，融资金融74亿元。从发行次数看，5月份发行次数仅高于2月份的208次及去年5月份的151次。融资金额则创2015年5月以来新低，仅为今年1月份融资金额的51.39%。从6月前三周的情况看，融资次数为169次，融资金额57.17亿元，情况不容乐观。\n\n　　另据统计，今年截止6月25日，新三板共有1013家挂牌公司实施1043起定增，较去年同期减少265起；今年1043起定增计划募资513.39亿元，同比减少18.19%，实际募资430.23亿元，同比减少32.74%；募资完成率仅为83.19%；在成功实施的1043起定增中，仅有566起定增发行后在二级市场产生交易，截至目前，浮亏案例多达430起，占27.77%！\n\n　　点评：一边是持续不给力的市场，一边是快速增长的挂牌公司和急剧膨胀的融资需求，这也是当前新三板市场的主要矛盾！\n\n　　今年上半年，新三板融资总额较去年同期仅呈微弱增长，这与宏观经济形势和资本市场的低迷相关，但也可以看出，新三板的融资功能并没有被破坏，市场的基本面还是向好的；另一方面，监管层喊停PE等类金融机构挂牌融资，剔除了这些吸水大象之后，让有限的市场资金资源更广泛地滋润了实业型挂牌公司，让新三板真正回归其本质和初衷。\n\n　　随着新三板挂牌公司数量急剧上升，融资需求也必定快速上升。在市况不佳的上半年，市场融资总额增长缓慢，但分层之后，整个市场的行情有望回暖，融资也将触底反弹，因此，我们可以乐观地展望，今年新三板融资总额超过去年、突破1300亿元都是极大概率的事。\n\n　　9、市况不佳新三板信托降温，大面积浮亏谁之过？\n\n　　经历了去年“火热”的市场行情后，今年以来新三板信托表现萎靡。2015年全年发行56款涉及新三板产品，平均每季度发行14款产品。而今年一季度、二季度发行新三板信托分别是3款、2款。\n\n　　当前新三板最主要的问题是流动性不足，不过这方面正逐步优化，包括挂牌企业分层制度落地等。制度逐渐完善以后，投资者参与热情会越来越高，市场具备更高流动性之后，信托也会乐于参与。\n\n　　点评：冰冻三尺非一日之寒，2015年的疯狂总会过去，回归理性才是发展的主旋律。没有永涨不跌的市场，也没有永跌不涨的行情，只要市场的根基还健康，涨跌都是正常的市场表现。\n\n　　新三板信托产品的表现，其实也是市场整体表现的必然现象和其中的缩影——覆巢之下焉有完卵？比信托还惨淡的，还有主力部队私募！其他友军包括公募、各类理财产品等，今年上半年也是大面积浮亏。市况惨淡的原因很多，外在的环境、内在的流动性紧缺和交投不活跃等，合力导致了这样的局面。\n\n　　要从根本上改变新三板“资金黑洞”的局面，提升市场流动性和交投活跃度刻不容缓，但这需要采取各方面的措施，包括但不限于引资入市、降低投资门槛等等，但一口吃不成胖子，新三板市场的回暖和稳步发展，仍需时日。\n\n　　10、广州国企借道新三板推进资产证券化\n\n　　在国企改革方面，广州市国资委旗下公司总是“积极分子”，2016年更是动作频频。除了充分利用现有A股上市公司平台，注入优质国有资产以外，广州市国资委旗下也有企业充分利用多层次资本市场的平台，大幅提高资产证券化水平，推动国企改革进程。\n\n　　6月29日，广州轻工旗下人印股份(837177)宣布，已在新三板敲钟挂牌；此前1月，广州轻工旗下的广州浪奇(000523)实现定向增发6.5亿元；3月11日，百花香料在北京股转中心举行挂牌敲钟仪式。\n"
		},
		{
			"post_id": 18,
			"title": "从总理说话，防止股市井喷和断崖式行情，我们认为，顺大势赚大钱的行情不会出现，股市总体处于大箱体内，投资者后续要集中资金做个股",
			"date_published": 1467540477.877,
			"body": "Blog post body"
		},
		{
			"post_id": 17,
			"title": "周K线，两阳夹三小阴，这样的组合，无疑是多头启动迹象",
			"date_published": 1467540299.196,
			"body": "Blog post body"
		},
		{
			"post_id": 16,
			"title": "英国脱欧后股市连续暴涨，已经突破了脱欧的高点，走出了极强势，当然欧洲股市虽然反弹了三天，但是，依旧比脱欧时的高点低，这虽然说明了脱欧对英国来说是正确选择，但是，对欧洲来说就是利空，任何争辩都没用，股市说明了问题",
			"date_published": 1467540203.198,
			"body": "Blog post body"
		},
		{
			"post_id": 15,
			"title": "big plate",
			"date_published": 1467539992.188,
			"body": "中小创和深圳成指均出现两阴夹一阳，而地产有色指数继续收阳，金融指数三连阴，沪市则连续两十字星，这表明多头的攻击力量减弱；"
		},
		{
			"post_id": 14,
			"title": "股市上，理论决定实际",
			"date_published": 1467539396.559,
			"body": "- 永远从理论开始；\n- 没有理论建立理论；\n- 理论可以不断修正；\n- 最终理论决定实际；"
		},
		{
			"post_id": 13,
			"title": "应该提前于市场跳出惯性思维",
			"date_published": 1467539181.27,
			"body": "- 市场里没有pattern;\n- pattern往往是陷阱；\n- pattern做的就是给你一个惯性思维的陷阱和假象；"
		},
		{
			"post_id": 12,
			"title": "趋势时时刻刻都有答案和标准",
			"date_published": 1467539048.112,
			"body": "在任何时间和任何周期都可以定义趋势的方向，只不过是标准不同，而结构不是所有的高点和低点都有结构。趋势是非黑即白的，一个趋势的结束就代表另一个趋势的产生，而结构不是一个顶部结构后面一定是底部结构，有可能顶部结构后面还是另一个顶部结构，也不是所有的位置都有结构。趋势随时可见，而结构，可遇而不可求。"
		},
		{
			"post_id": 11,
			"title": "趋势为王，结构修边",
			"date_published": 1467538991.296,
			"body": "Blog post body"
		},
		{
			"post_id": 10,
			"title": "由于目前市场依然是存量资金在博弈，逼空行情是不现实的，震荡攀升（进2退1）将是7月份的主基调。",
			"date_published": 1467297747.07,
			"body": "Blog post body"
		},
		{
			"post_id": 9,
			"title": "明天是党的90周年纪念日，也是香港回归纪念日，坊间都在传言深港通即将推出的利好。市场现处于强势整理，一旦有利好配合，就很有可能再上一个台阶。从目前来看，市场系统性风险较小，场外资金有逐步进场的准备，都在等待更低的位置介入，所以这个时候难以大幅杀跌，就像我们之前说的拉升之前最好有个黄金坑，但是大家都等着黄金坑的时候，就有可能不会出现黄金坑的走势。",
			"date_published": 1467297094.676,
			"body": "Blog post body"
		},
		{
			"post_id": 8,
			"title": "7月1日，月初，又是周末，就要小心",
			"date_published": 1467296678.945,
			"body": "study it from two dimensions - \n\n- weekend effect;\n- first day of the month, particularly half year starting day effect;"
		},
		{
			"post_id": 7,
			"title": "库存",
			"date_published": 1466816984.014,
			"body": "必须在尽可能低位建立大的库存；这对于T+1市场直观重要；这样才能在需要的时候当天完成海量交易；没有库存，无法捕捉当天的机会；"
		},
		{
			"post_id": 6,
			"title": "股市战争",
			"date_published": 1466816282.455,
			"body": "对于每一个参与者，股市是个整体；你对股市；\n\n股市只有两个方向：上，下；\n股市上下的动力学不同；形态不同；\n你的资金就是你的兵力；\n你用兵的方法决定了你的胜败；\n均匀分布兵力只是一种战法；但不是最优战法，回报也会低；\n如何用兵是关键；\n这就需要对形势作出判断；学会集中兵力，准备打主要的战役；"
		},
		{
			"post_id": 5,
			"title": "交易场",
			"date_published": 1466689311.495,
			"body": "场内最著名的角色叫做主力。要想挣钱，你必须紧跟主力。主力的主要目的都有什么？\n1. 从非主力身上挣钱；\n2. 完成光荣的政治任务；\n3. "
		},
		{
			"post_id": 4,
			"title": "交易课题: 向上突破，还是向下突破？如何判断",
			"date_published": 1466607438.527,
			"body": "这是可以有明确答案的。具体见线下操作笔记。"
		},
		{
			"post_id": 3,
			"title": "股市吸血",
			"date_published": 1466595854.683,
			"body": "假设我是上市公司A的控股股东，持有A股5000万股，A主业是经营火锅，1亿股本，净资产2亿，每股收益0.1元，股票价格10元/股。我有一个好朋友小李，开了一家烤鸭店，初始投资1000万，经过几年利滚利，净资产已经滚到了5000万，现在每年盈利500万。\n\n\n\n\n我和小李商量后达成协议，向他发行2000万股份，另外支付4500万现金，这4500万现金我向另外一个朋友C发行股份500万股获得，100%收购了小李的B烤鸭店。\n\n\n\n\n（一）那么对我来说，这笔买卖值不值呢？\n\n1. 我一分钱没花；\n\n2. 我手里还是5000万股；\n\n3. 增发后总股本变成1.25亿股；\n\n4. 增发后每股净资产还是2元；\n\n5. 增发后盈利变成：（1000w+500w）/1.25亿股=0.12元/股，比增发前盈利能力提高20%；\n\n6. 市场看到业绩会转好，而其他餐饮类公司股票还是100倍市盈率，那么A股价格也就顺理成章由原来的每股10元涨到每股12元，加上忽悠或许能涨到每股13元；\n\n7. 结论：作为大股东，我当然满意。\n\n\n\n\n（二）小李满意不？\n\n1. 小李得到了4500万现金；\n\n2. 小李知道现在火锅业不好做，利润率太低，很多老板都在考虑出兑店铺；\n\n3. 小李用很便宜的3500万买下了一家火锅店，又花1000万改造变成烤鸭店，又可以继续原来的生意了，手里多了2000万股A股股票；\n\n4. 3年后小李的股票锁定期结束，找到我，研究做业绩做故事，想办法把A股价格进一步炒高。我早有准备，已经公布要投资互联网，且公司名字也改为了量子金融，市场给120倍PE；\n\n5. 小李的2000万股票可以减持了，价格15.6元/股，拿到了3.12亿；\n\n6. 结论：小李满意。\n\n\n\n\n（三）我的朋友C满意吗？\n\n1. 我朋友C急性子，定增结束后，他马上发行了一款理财产品，将那500万股按11.8元/股的价格批发给下家了（当时市场价格12元/股）；\n\n2. C用两个月时间支出4500万，收回500万股*11.8元/股=5900万，年化收益率那叫个高！\n\n3. 结论：C满意\n\n\n\n\n（四）总结\n\n1. 只要股市有泡沫，只要估值有泡沫，定增、并购、重组的故事就少不了，因为对所有参与者都有利，中小创的扩张其实一直就是在演绎这样的故事。\n\n2. 如果估值没有泡沫，餐饮业市盈率5倍，市净率0.8，谁都不会再搞这个故事了；\n\n3. 定增本身只是菜刀，可以杀人，也可以切菜；\n\n4. 泡沫的受害者是最后的买单人，是接最后一棒的人；\n\n5. 最后一句：投资者教育是市场最后走向成熟的必由之路，但教育不是说教，需要血淋淋的教训，急也没用，慢慢来，还需要好几茬韭菜的血。\n\n\n\n\n另外，无论是通过资产定增，还是通过现金增发，其本质都是股票增容，对股市参与者来说，利空效果是一样的，除非估值够低，股东没有卖出动力。\n"
		},
		{
			"post_id": 2,
			"title": "1KtnLQynesLHw4QSc3kujrg5F67L2EH9Qh",
			"date_published": 1466595451.707,
			"body": "this thing, i know."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}