{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1554830412_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"1580029310_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1559842378_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 1,
				"body": "Niezbyt wiarygodne źródło podałeś a coraz bardziej nachalną cenzurę można samemu zauważyć jeśli przegląda się codziennie dużą liczbę kanałów na youtube.",
				"added": 1575139437
			}
		],
		"1580029310_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": [
			{
				"comment_id": 3,
				"body": "Tekst jest jakiś niespójny. Mieszkasz pewnie za granicą :(",
				"added": 1581685209
			},
			{
				"comment_id": 6,
				"body": "> [swarog](#comment_6_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG): @nomads95 a cos wiecej mozna gwoli wyjasnien gdzie co i jak?\n\nJuż nieważne, w drugim artykule piszesz że mieszkasz w Wielkiej Brytanii.",
				"added": 1582363741
			}
		],
		"1581694747_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 4,
				"body": "> [driud](#comment_28_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): @somuchfood.   Możesz nienawidzić, Takie jest twoje prawo; Ale pamiętaj, wiecznie młody nie będziesz. Też się zestarzejesz, i to szybciej niż myślisz. Ja mam już to za sobą, a ty masz jeszcze przed Sobą.Pozdrawiam. Dużo , dużo , zdrowia życzę, bo ono będzie potrzebne.\n\nJedyna mądra myśl w tym artykule",
				"added": 1582228280
			},
			{
				"comment_id": 5,
				"body": "Czyli nienawidzisz sam siebie. Narodziny: młodość - wiek średni - starość : Śmierć",
				"added": 1582228401
			}
		],
		"1592839559_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 7,
				"body": "> [tajny2z](#comment_33_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): Strony ZAWSZE POWINNY miec mozliwosc seedowania selektywnie wybranych uzytkownikow czy dzialow tej strony. Strach przed zniszczeniem reputacji powstrzyma przed publikowaniem smieci i badziewia. Wrogie organizacje beda wrzucaly kije w szprychy i oczernialy. Poczatki wolnej sieci internetowej musza byc pelne wyzwan. Jest to calkiem normalne.\n\nCzy ty mówisz o cenzurze czy mi się wydaje.",
				"added": 1597603070
			}
		],
		"1598188181_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 9,
				"body": "> [driud](#comment_72_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Pomijając wszystkie możliwe przypadki, pomyłki,?  Z internetem dzieje się coś dziwnego, zaczęło się od podłączenia masztów, nadajników, na 5-G, wtedy był pierwszy szok, / zakłócenia /. To wróciło do normy. Ale już nie do pierwotnego stanu. Nie było już, tak jak przedtem. Potem był drugi szok, kiedy zaczęli się wycofywać z tej imprezy. I Od tego momentu dzieją się dziwne rzeczy. Cały czas. Czy można to zauważyć? Tak jeśli dużo siedzisz w internecie, wysyłasz i przyjmujesz  po przez internet.      Gubi się, przerywa, na przykład telefon internetowy. Kiedyś tego nie było. Co jest przyczyną? Nie wiadomo. pogoda, zakłócenia, awarie?Co tamten gość ma, źle zrobione? Nie wiem?  Zakładam wciąż, że to jest  przypadek. I to o czym nie mógł powiedzieć do końca. / cenzura - okulary  /. Jack Kajleb, przesłał wszystkim ostrzeżenie, jeśli więcej ludzi będzie to obserwować; To na pewno czegoś się dopatrzymy. A to, że znikają strony, to od dawna wiadomo; Ja na strony wchodzę po adresie tej strony. I parę stron mam wykreślonych, Not Found,  - Tak to wygląda od zakrystii.Czeski Film,  Było i  niema.\n\nPanie driud. Tak jak koledzy już wspomnieli proszę podawać więcej szczegółów bo sypie pan ogólinkami.",
				"added": 1600290359
			}
		],
		"1606360383_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 10,
				"body": "Przyznam że nie przeczytałem całego artykułu a już będe na tyle głupi żeby ocenić twoje pierwsze \"Argumenty\" w których piszesz że nie ma wirusa ale kilka osób z mojego otoczenia które miały objawy tegoż nowego wirusa na co zachorowały według ciebie jeśli objawy ewidentnie wskazywały na coronavirusa.",
				"added": 1615586125
			},
			{
				"comment_id": 12,
				"body": "Jest marzec 2021 i nikt nie każe mi się szczepić więc proszę nie nakręcajcie paranoji strachu i zamordyzmu.",
				"added": 1615586361
			},
			{
				"comment_id": 14,
				"body": "> [trueerin](#comment_33_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz): ciekawe... nikt Ci nie każe ale....    [...]\n\nPracuję w firmie w której nikt nie każe mi się szczepić a w lutym chodziłem  do lekarza na wizytę osobistą",
				"added": 1615646129
			}
		],
		"1606098793_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 13,
				"body": "> [driud](#comment_108_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Można się wiele nauczyć,  jak funkcjonuje nasze otoczenie. I , Jak nas robią ? w bambuko.\n\nTy w ogóle możesz spać? Wszędzie widzisz spiski i intrygę.",
				"added": 1615586452
			}
		],
		"1628313902_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 15,
				"body": "Filozofom się nie śniły takie rzeczy.",
				"added": 1628709964
			}
		],
		"1626719398_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 16,
				"body": "kanibalizm to zjadanie swojego gatunku. Jeśli mamy mieć niezależne źródło to powinno ono być również rzetelne.",
				"added": 1628786760
			}
		],
		"1629535835_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 17,
				"body": "Dokładnie jak w biblii, każdy musi przyjąć znamię bestii.",
				"added": 1631383442
			}
		]
	},
	"comment_vote": {
		"28_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"4_17kVRGE5otWDwpkV4Pn1M7NrFKVLwgLUj8": 1,
		"5_17kVRGE5otWDwpkV4Pn1M7NrFKVLwgLUj8": 1,
		"36_1At298vUijuhjA2GtqXEydC8csRnhETzdH": 1,
		"4_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": 1,
		"11_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": 1,
		"1_19ffx3PUJM1UJsgBRQR3j1nM2MR1ESdwcE": 1,
		"25_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"29_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"20_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": 1,
		"53_1QBGxPiLVbhA9dt8Yqex2EsZxoWtAhMVix": 1
	}
}