{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "yeah..., so the oxygen at the other side of the fabric isn't enough for it?",
			"post_id": 14,
			"date_added": 1597797317
		},
		{
			"comment_id": 2,
			"body": "Great!, I posted a comment on zerome thinking what zeronet is commonly used for would not be well mixed with a POS but I see how genius this is now. What you describe sounds pretty nice given that it involves most of the basic functionality of a POS and how easy it is to add or replace terminals to it... Now, as far as I know POS systems tend to be really complex because you have to handle some accounting on them and also you must divide actions into really small sets so you can forbid specific actions for specific users (role permissions)... and handling drivers for printers and the rendering engine for receipts too.\n\nYou could export to word, excel or PDF and call it a day for the receipts but the other things may prove not so trivial, and now that we are at it let me remind you of an important thing you'll want to think early in design: Archiving. 3k products sounds nice but it may grow, so will the history of created sales and one day it may be too much for the pi to handle snappily, maybe some db indexes and calling optimized sql queries could help but I think the best is just to be able to pack a whole period of time and export it out of the running system so it becomes lean again.\n\nThe other nasty thing is power outages or interruptions, may they come from someone tripping over a cable, a kernel panic, storage media failure or just zeronet going haywire (hope your zerunet copes well with it) you should be prepared for those situations. How to recreate a broken db of a client? will you just assume newer db version as most correct version? you could keep two files, one for syncing every minute to proper zite db and another as a scratchfile so if something happens you'll only lose a minimal amount of progress and corruption will become pretty unlikely.\n\nThis post is pretty large by now, just wanted to say your project sounds really admirable and would love to hear more from it in the future. Kudos!",
			"post_id": 15,
			"date_added": 1602128805
		},
		{
			"comment_id": 3,
			"body": "I noticed that the page view for each manga page isn't fit to the window width like the way 1+Gallery already does, also, every time I click the page to render the next it issues an error \n`Error adding bookmark: could not serialize object Caused by: invalid type: string \"50\", expected usize at line 1 column 405`.",
			"post_id": 20,
			"date_added": 1614615538
		},
		{
			"comment_id": 4,
			"body": "> [anshorei@zeroid.bit](#comment_11_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Could you try again? At some point the results per page limit was stored as a string and parsing the user settings was likely failing on that field.\n\nSorry, I haven't been able to test it. It doesn't load for me anymore and I can't update 1+gallery fully, the file g4z_bg.wasm is always pending.",
			"post_id": 20,
			"date_added": 1614832717
		},
		{
			"comment_id": 5,
			"body": "> [anshorei@zeroid.bit](#comment_12_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Sorry about that, it's because I tend to push updates shortly before going to bed and then forget to give them time to propagate. It's morning now so my PC will be seeding for the rest of the day.\n\nWas able to update, the bookmark error doesn't appear anymore. Also, I checked the about/help page of g4z and it lists keys F, L and O yet none of those work when viewing a gallery. So far I'm stuck viewing the pages in fit whole page mode...",
			"post_id": 20,
			"date_added": 1614905286
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}