{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1565811143_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 1,
				"body": "typical moron",
				"added": 1566277266
			}
		],
		"1566600878_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 2,
				"body": "freenet is very good - bit slower than zero, but a totally closed system.  Lots of good people there, good discussion on FMS and Sone if you want to look it up     https://freenetproject.org",
				"added": 1566624818
			}
		],
		"1566595857_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 3,
				"body": "never ever use google - they are NOT your friend, duckduckgo is better for clearnet but I am finding that I use clearnet less and less all the time",
				"added": 1566624989
			},
			{
				"comment_id": 4,
				"body": "> [numismatist](#comment_65_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): The clear net is just designed to suck marketing data from you. I do almost all my browsing over Tor now, basically I only do online banking and bill pay and shopping in the clear net any more. I don’t even do anything illegal, I just don’t want the weirdos running the tech industry to learn any more about me.\n\nExactly - I use my (paid for) VPN for everything except email and bank - I refuse to online shop, especially with Amazon, I cannot justify Bezos with $125billion in his pocket only paying his staff starvation wages, that is the definition of a crook.  also I don't like getting tracked by anyone, so my trail ends at one of the worldwide endpoints of my (non-american based) VPN - freenet, tor, i2p, zeronet, all torrent and NNTP stuff is through my VPN, makes my paranoia just a little less!! :)",
				"added": 1566626470
			},
			{
				"comment_id": 5,
				"body": "> [darkanon](#comment_3_1HmE9NBVKZgaidhK26GKWppmafJkrHUvej): Tor and Duckduckgo are the best alternatives for me to use. But even M$ isn't privacy-friendly with their Windows system, so I very much prefer staying on Linux and not using Google at all\n\nAbsolutely - been with linux since 2003 - M$ is just a bunch of bloat software",
				"added": 1566628945
			}
		],
		"1567904814_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": [
			{
				"comment_id": 6,
				"body": "I think he is in south america now - it is too fishy to be real",
				"added": 1567910157
			}
		],
		"1568901657_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 7,
				"body": "same shit different day",
				"added": 1568934298
			}
		],
		"1568893908_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 8,
				"body": "I'd much rather use firefox than edge or chrome or ie or safari - sure firefox may have some bugs, but less bugs than any other proprietory browser.  Id have to see some proof of that - bring up the code for the backdoor, explain how you know it's a backdoor, show us you even know anything about what you are talking about.",
				"added": 1568934875
			}
		]
	},
	"comment_vote": {}
}