{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 1,
				"body": "Acho mais interessante ter conteúdo a um preço mais acessível do que a pirataria. Temos que lembrar que filmes e seriados tem um custo para ser feito e são feitos para gerar lucro.",
				"added": 1476920660
			},
			{
				"comment_id": 3,
				"body": "> [sirenyc](#comment_150_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Isso e verdade, mais o preço que esta as coisa e um absurdo! \n> =)\n\nConcordo, por isso comentei sobre ter um preço acessível. :)",
				"added": 1476930380
			},
			{
				"comment_id": 4,
				"body": "Galera, alguém usa ipfs aqui? Estou pensando em criar um zite tipo o PLAY, mas com o conteúdo todo por ipfs, ou seja, se estiver rodando o ipfs pode fazer streaming do filme/serie direto do zite. Quero fazer de uma forma colaborativa na qual as pessoas podem subir novos filmes e legendas. O que acham?",
				"added": 1476931481
			},
			{
				"comment_id": 6,
				"body": "> [kosherx](#comment_28_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): é só baixar impostos e reduzir gasto público. mas aqui mesmo neste site tem gente contra a PEC241, então a conta não fecha. os preços disparam, mesmo.\n\nTambém sou contra. Não entendi qual o problema? Acho que tu não percebeu os problemas que a PEC241 geram. Solucionam uns (talvez), mas geram outros.",
				"added": 1476992772
			}
		],
		"1_121wHEZXhLuoFQhmawdQRLVvtBzhSDT4R5": [
			{
				"comment_id": 2,
				"body": "no",
				"added": 1476920683
			}
		],
		"2_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 5,
				"body": "Pelo amor de deus... Essa é a coisa mais estúpida que alguém pode fazer.\n\nLimitar gastos nas áreas de educação e saúde é um retrocesso. Históricamente investimos bem mais em educação e saúdo do que a inflação todo ano. Parar isso porque? Parar por 10 anos para ver depois o que fazer? Ridículo!\n\nSalário mínimo congelado e somente seguindo a inflação? Não vejo como isso pode ajudar alguém. No final como sempre só se fode quem já não tem dinheiro :(\n\nQuero só ver o que vem depois com a Reforma Trabalhista e a Reforma da Previdência.",
				"added": 1476984559
			}
		]
	},
	"comment_vote": {
		"39_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": 1
	}
}