{
	"next_comment_id": 5,
	"user_name": "sl",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1549644262": 1549648632
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Realjohndoe: It is not about how good or bad drugs are. In Russia laws exists for the people, not for the government.",
			"post_uri": "17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1549644262",
			"date_added": 1549654748
		},
		{
			"comment_id": 2,
			"body": "@Quantumworld: Russia is two times smaller than US in population. ",
			"post_uri": "17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1549905135",
			"date_added": 1549921607
		},
		{
			"comment_id": 3,
			"body": "Как отслуживший в армии, могу сказать, дисциплина делает удивительные вещи. Малое количество свободного времени начинаешь использовать с пользой для себя эффективнее, чем когда у тебя этого времени значительно больше. Я там прочитал книг сколько не читаю за пять лет, хватало времени и на аниме и фильмы. Сильно возрастает мобильность, не нужно времени на раскачку. Притом, большую часть времени находишься в отличном самочувствии и в более выской работоспособности. И печальная сторона, что большая часть повседневных занятий - бессмыслица из-за плачевного состояния армии.\n\nИ вот после этого грусно, что многие про-свободные движения воспринимают такой способ организации, дисцилину и организованную иерархию как что-то плохое, как что-то недостойное свободного человека. Оттого практически не способны извлечь из этого пользу. Люди плохо способны объединиться в достижении общих целей, в организации, тогда как под давлением закона или экономических стимулов легко становятся частью других организаций, которые получают из этого выгоду и контроль. ",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1549895229",
			"date_added": 1549922989
		},
		{
			"comment_id": 4,
			"body": "@Quantumworld: the land cannot vote.",
			"post_uri": "17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1549905135",
			"date_added": 1549926572
		}
	]
}