{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1631527719,
			"title": "I WAS WRONG ABOUT COVID WAS THE FLU",
			"body": "Yes, it is true. I was talking all the time how covid was just the flu and it turns out that I was scientifically wrong. Covid is of course a subform of the common cold as it is a stem of coronaviruses.\n\nSo you can have the common cold without covid but you cannot have covid without having the common cold. It is that simple. By \"can have\" I mean that you are \"infected\" with the common cold. That does not mean you must also have any symptoms.But you could have symptoms of the common cold.\n\nPlease spread the truth and now back to normal you fucking stupid sheeple!\nAnd of course Fuck Joe Biden and Stop Fauciism !!!",
			"added": 1631527718
		},
		{
			"topic_id": 1632073647,
			"title": "It never begun for manlets and what that means for society - [Spoiler alert it's over]",
			"body": "Manlet 5' 6\" master race incel reporting in.\nReading about the heightpill on https://incels.wiki/w/Heightpill and on incels.is where they say that for example the average man in Netherlands was 5' 7\" in the sixties and is now 6'1\" is a result not necessarily from better nutrition and life conditions but actually from the fact that taller men have more offspring than short men.\n\nApplied to the ----bad times create strong men - strong men create good times - good times create weak men - weak men create bad times--- meme it turns out that giving strong wahmen rights is actually eugenic and not like many thought dysgenic. It will of course destroy the society as it usually does but after that only the strong tall men (and women) will have survived. And at that point a new better civilization can emerge out of the ashes from the old.\n\nBut yes as a manlet I will kill myself soon anyway. So it doesn't really matter to me after all.It's over for manlets.\n\nA must watch: https://www.youtube.com/watch?v=Uc6zWKH_XUE (Height and dominance)\nDiscuss !",
			"added": 1632073645
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1631527719_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": [
			{
				"comment_id": 1,
				"body": "It is simple: Covid is just a part of the viruses which leads to the common cold.There are many others.But the key is that a society should not kill freedom for something which is not really that deadly and even if it was it can't be stopped after all. Doing what they are doing is evil. No matter what reasons or arguments they have. It is just evil.\n\nDon't let your life be determined by a grid which is set up from others to enslave you. Believing in \"science\" has turned out to be as bad as believing in witches need to be burned.\n\nThere is something \"so deadly\" which nobody fears in real life.But because of propaganda and fines everybody act as if we have a deadly disease. But people only act this way while they fear that somebody could watch them not following the rules. Nobody is afraid of the actual virus. Some others pretend to be afraid so they can bully you into complying to the new rules, because they love to bully other people. That is a clear sign that we are all lied to on purpose.",
				"added": 1631879100
			}
		],
		"1632073647_12ftwUykzZMAF7aq5Sd3qGh8HUNmnPh8Fn": [
			{
				"comment_id": 4,
				"body": "Sure get a girlfriend / wife while being 5'6\" or below nowadays. Good luck with that. Pro Tip: It does not count when you are only \"together\" or married and she does not let her get fucked by you but only uses your money or has other uses for your skills. And of course just be a normal guy with a normal job not a tv superstar or really extraordinary successful. Normal people get fucked just like that. Manlets don't. They have to be very special. And not everybody can be like that. Because otherwise every Manlet has to be very special just to get a girl which is impossible, because if everyone is special it wouldn't be called special.",
				"added": 1632340258
			}
		],
		"1632001629_178KvFeW5b16fZsNtWY3pDjLHj8aiLdTMK": [
			{
				"comment_id": 3,
				"body": "Manlets are worse. Society is lying. I wish I was killed when I was born. No one should live as a manlet. It's over for us.",
				"added": 1632145623
			}
		]
	},
	"comment_vote": {}
}