{
	"next_topic_id": 17,
	"topic": [
		{
			"topic_id": 1,
			"title": "Разработка децентрализованной MMO",
			"body": "Как по вашему можно реализовать в подобной сети MMO игру или MUD?",
			"added": 1536790071
		},
		{
			"topic_id": 2,
			"title": "Проблема в ZeroMe",
			"body": "ZeroMe не даёт войти в свой аккаунт. Раньше было нормально. Это только у меня или у всех?",
			"added": 1537337233
		},
		{
			"topic_id": 3,
			"title": "Как бороться с автоматическими подписками?",
			"body": "На некоторых сайтах (зайтах) функция подписаться срабатывает при входе автоматически. Они потом отображаются в ленте. Как этого избежать?",
			"added": 1537521871
		},
		{
			"topic_id": 4,
			"title": "content.json ошибка загрузки",
			"body": "Мой форум на моём компьютере отображается нормально.\nПри попытке зайти через гейт выдаёт следующее: content.json ошибка загрузки.\nВ чём может быть причина?\nhttps://www.zerogate.tk/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/\nhttp://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/",
			"added": 1537813176
		},
		{
			"topic_id": 5,
			"title": "Вопрос про магазин",
			"body": "http://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:2_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/",
			"added": 1544528669
		},
		{
			"topic_id": 6,
			"title": "Форумная ролевая игра",
			"body": "Давайте замутим ФРПГ. Небольшую, всего в одну тему. Ну а там как пойдёт. Обсуждение игры в этой теме. Сама игра по ссылке на другом форуме.\nhttp://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:3_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/",
			"added": 1549599672
		},
		{
			"topic_id": 7,
			"title": "Фандомы",
			"body": "Как по вашему: насколько успешными будут сообщества фан-клубов в DarkNet? Фан-клубы: книг, фильмов, сериалов, мультиков, комиксов, игр и т. д. DarkNet не только ZeroNet, но и тот же Scuttlebutt, например.",
			"added": 1550080859
		},
		{
			"topic_id": 8,
			"title": "HunterCoin",
			"body": "Основанный на блокчейне игровой мир.\n\n>Huntercoin - это криптовалюта с открытым исходным кодом, похожая на биткойн. \nОсновное отличие состоит в том, что ~ 80% монет можно получить, собирая монеты в виртуальной вселенной, которая находится внутри блокчейна. \nВ простую игру играют, чтобы собрать монеты на карте, в которой есть элемент «сражение против игрока» для борьбы за ресурсы. Это можно назвать добычей человека (или ИИ), а соревнование, которое стало более сложным с течением времени, можно назвать уровнем сложности человека (или ИИ).\n\nhttp://huntercoin.org/\n\n>Обзор HunterCoin.\nHunterCoin – это криптовалюта, имеющая открытый исходный код и похожая на Bitcoin. Основное различие заключается в том, что примерно 80% всех монет можно получить, собирая монеты в виртуальном вселенной, которая находится непосредсвтенно внутри блокчейна. \nПростая игра проводится, чтобы собирать монеты, которых есть элемент борьбы с игроком против игрока, чтобы сражаться за ресурсы. Это можно назвать добычей и конкуренцией, которая со временем становится более трудной.\n\nГде и как купить HunterCoin.\nКриптовалюта HUC торгуется всего лишь на одной криптовалютной бирже – Poloniex, и всего лишь в паре с одной единственной валютой – Bitcoin. По мере успешного продвижения данного проекта количество поддерживаемых торговых площадок должно непременно увеличиться.\n\nДавайте рассмотрим процесс покупки токены HUC в торговой паре с Bitcoin на популярной торговой бирже Poloniex. Учитывайте, что для начала торговли вам нужно совершить депозит, который не должен быть ниже 25 000 долларов США. Если же вы имеете возможность совершить такой депозит, то переходим на страницу торговли токенами HUC (https://poloniex.com/exchange/#btc_huc). \nНа данный момент нас интересует только график курса криптовалюты и окно “BUY”, в которое необходимо вписать актуальную цену за единицу монеты и указать нужно вам количество этих самых монет. \n\nПосле успешного закрытия торгового ордера на ваш счет автоматически зачислятся купленные вами токены.\n\nКошелек HunterCoin.\nНа начало 2018 года разработчики до сих пор по каким-либо причинам не выпустили полноценный официальный кошелек для хранения токенов HUC, учитывая, что проект берет свое начало в 2014 году, но имеются некие аналоги кошельков и приложений, которые вы можете найти и установить на ваше устройство, перейдя по ссылке https://bitcointalk.org/index.php?topic=435170.0.\n\nПомимо вышеперечисленного, вам никто не запрещает хранить ваши монеты HUC на криптовалютной биржу Poloniex.\n\nМайнинг HunterCoin.\n\nМайнинг HunterCoin HUC осуществляется по принципу Proof-of-Work на двух алгоритмах - SHA-256 и Scrypt. Монета HUC может майниться параллельно с другими монетами (так называемый Merge Mining), например, добывая Биткойн или Лайткойн, можно параллельно добывать HUC. Максимальное число монет, которые доступны для добычи - 42 миллиона штук.\n\nВ майнинге HunterCoin HUC есть еще одна особенность. Текущая награда за добытый блок (время блока - 1 минута) составляет 10 HUC. Из них 1 монета достается майнеру, а 9 уходят в игровой мир. \n\nИгра - это альтарнативный способ \"майнить\" HunterCoin: игрок собирает на карте монеты, а потом приносит их в определенные зоны карты, откуда они уже попадают в кошелек игрока.\n\nПерспективы HunterCoin.\nУчитывая, что за все время существования проекта, а именно с 2014 года, ему удалось едва превысить капитализацию в 3 миллиона долларов США, что является крайне низким показателем на криптовалютном рынке. Этот факт заставляет задумать о перспективности данной разработки и, как следствие, инвестиций в нее. На рынке множество гораздо более перспективных проектов, инвестиции в которые будут целесообразнее, чем в HunterCoin. \nЕсли же вы хотите весело провести время, играя в игру и зарабатывая криптовалюту, то этот проект создан специально для вас.\n\nhttps://cryptomix.fund/currency/huntercoin\n\n",
			"added": 1551116625
		},
		{
			"topic_id": 9,
			"title": "Какие вы знаете свободные системы машинного перевода?",
			"body": "",
			"added": 1552402513
		},
		{
			"topic_id": 10,
			"title": "Парень делает полностью децентрализованную MMORPG",
			"body": "Всё на английском\nhttps://youtu.be/FOFgZlNfaWs\nhttps://www.reddit.com/r/eos/comments/9dc7jt/playable_eos_mmo_rpg_prototype_ready_for_download/",
			"added": 1552886279
		},
		{
			"topic_id": 11,
			"title": "Open Cobalt - браузер виртуальных миров",
			"body": ">Open Cobalt Alpha предоставляет всем людям бесплатную платформу с открытым исходным кодом для создания, доступа и обмена виртуальными рабочими пространствами для исследований и образования. Эта трехмерная мультимедийная вики-технология позволяет легко создавать многопользовательские виртуальные рабочие пространства с глубокими связями и гиперссылками, виртуальные выставочные пространства, а также обучающие и обучающие среды на основе игр, которые работают во всех основных программных операционных системах. Используя протокол обмена сообщениями между равноправными узлами, чтобы уменьшить зависимость от серверных инфраструктур для поддержки основных в мире взаимодействий между многими участниками, Open Cobalt позволяет людям создавать гиперссылки на свои виртуальные миры через трехмерные порталы для формирования большой распределенной сети взаимосвязанных пространств совместной работы.\n\nОбсуждение программы на моём форуме\nhttp://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:4_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/Open+Cobalt",
			"added": 1556004439
		},
		{
			"topic_id": 12,
			"title": "Вопрос о децентрализации Ethereum на моём форуме",
			"body": "http://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:5_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/+Ethereum",
			"added": 1560174370
		},
		{
			"topic_id": 13,
			"title": "Вопрос про WebOS в ZeroNet",
			"body": "http://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:6_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/WebOS+ZeroNet",
			"added": 1563777028
		},
		{
			"topic_id": 14,
			"title": "Обмен ссылками на аккаунты ZeroMe",
			"body": "http://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:7_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/",
			"added": 1567537561
		},
		{
			"topic_id": 1606134058,
			"title": "Маскот",
			"body": "Вопрос творческий, философский если хотите:\nhttp://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:8_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/",
			"added": 1606134043
		},
		{
			"topic_id": 1607968761,
			"title": "Где находится ключик от зайта?",
			"body": "Клонировал новый зайт. Пытаюсь его редактировать и подписывать. Где узнать ключик, который требуется для подтверждения?",
			"added": 1607968745
		}
	],
	"topic_vote": {
		"8_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": 1,
		"3_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1
	},
	"next_comment_id": 90,
	"comment": {
		"1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 1,
				"body": "> [l8](#comment_5_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Разрешаю. Реализовывай.\nИмел ввиду: это возможно теоретически?",
				"added": 1536845342
			},
			{
				"comment_id": 2,
				"body": "> [anotherneko](#comment_99_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): В сети подобной чему?\nВ децентрализованной сети, чтобы игровой мир не зависел от хоста.",
				"added": 1536853795
			},
			{
				"comment_id": 3,
				"body": "> [dude](#comment_62_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): http://127.0.0.1:43110/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg/http://127.0.0.1:43110/1D6f2CvDRhPeEeBAcmqGt3X9z2CkLpmv2V/\nА что за игра по второй ссылке?",
				"added": 1536904341
			},
			{
				"comment_id": 4,
				"body": "> [boozycat](#comment_5_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): Не очень корректное сравнение. Для форумов и блогов децентрализация сети даёт как минимум два больших плюса: достаточную степень анонимности, и сохранность и доступность информации за счёт пиров. Но для ММО игр ни то, ни другое, важности не имеет, а что реально важно — высокая скорость обмена мелкими сигнальными пакетами, что в пиринговой сети довольно слабое место. \nСохранность информации ещё как имеет. Плюс перечисленное в предыдущем посте. Так же уверенность в том, что игру не смогут закрыть.",
				"added": 1536935096
			},
			{
				"comment_id": 5,
				"body": "> [boozycat](#comment_6_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): Я вот тут, кстати, подумал про MUD — тут скорость обмена не так важна, задержка в 2--3 секунды на процесс не повлияет. И вот какая у меня идея – а если в децентрализованной сети сделать децентрализованную игру?.. Например: есть движок игры с её правилами, он подписан автором и раздаётся в неизменном виде. А всё остальное генерируется непосредственно на нодах игроков — у каждого игрока генерируется своя локация и свой рандомный набор игровых предметов. К примеру, я подключаюсь к игре, создаётся локация, которая цепляется к карте игрового мира, мне в файл карты приходит инфа, что к северу от меня локация такого-то игрока, к западу — такого-то, и т.д., но пока я к ним не зайду, файл с их локацией ко мне не грузится. Если неделю протупишь, то и мир вокруг тебя может измениться — когда-то к северу была деревня с орками, а тут раз, — и киберпанковский мегаполис…А есть в сети кто шарит в разработке игр?\n\nТут ты не одинок, в своей идее:\nhttps://gamedev.ru/flame/forum/?id=232628\nhttp://muder.ru/forum/index.php?topic=421.0",
				"added": 1536938465
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_421_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Есть огромный класс походовых игр, от почти реалтаймовых, типа Civilization или UFO до сеансовых, типа VGA Planet (или шахмат по переписке :D). Вот это — непочатый край для программирования в ZN.\nVGA Planet - не совсем MMO игра и даже не MUD. Про Civilization и UFO я вообще молчу. Есть браузерные игры, вот их можно портировать.",
				"added": 1536956378
			},
			{
				"comment_id": 7,
				"body": "> [boozycat](#comment_7_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx): А вообще, есть смысл, как сказал ТС, портировать что-нибудь браузерное… Например, кто помнит «Бойцовский клуб»?\nМеханика боя из \"Бойцовского клуба\" потом использовалась в игре \"Территория\". Важно, чтобы сохранялись достижения игры, как в приложениях социальных сетей. Создал тему на новом форуме:\nhttp://127.0.0.1:43110/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/?Topic:1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54",
				"added": 1537252060
			},
			{
				"comment_id": 13,
				"body": "> [geekless2](#comment_17_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo):  делать игру на блокчейне — сурово.\nОднако же делают.\n\n\n> [balancer73](#comment_441_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Если достаточно не исправлять, а только обнаруживать факт читерства, чтобы остановить игру, то можно проще делать. Например, иметь у себя данные, содержащие хеши чужих ходов. Тогда при обнаружении несовпадения, кто-то у себя что-то задним число подправил, это будет обнаружено и игру можно прервать :)\nЛучше вообще исключить возможность читерства.\n\n> [geekless2](#comment_18_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Можно попробовать шардирование вместо полной децентрализации. Игроки делают ходы в p2p-режиме, но также отсылают данные о своих ходах 3-м лицам по договорённости. Процесс игровой партии фиксирует 1 или несколько доверенных центров. Ну а доверять ли такому центру, каждый решает сам.\nЭто подходит скорее для сессионных игр, а не для MMO.",
				"added": 1537775081
			},
			{
				"comment_id": 14,
				"body": "Почему делать на блокчейне сурово? Задам вопрос по другому: чем плох блокчейн?",
				"added": 1537780391
			}
		],
		"2_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 8,
				"body": "> [l8](#comment_7_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Да.\n?",
				"added": 1537339487
			},
			{
				"comment_id": 9,
				"body": "Что же такое могло произойти?",
				"added": 1537393890
			},
			{
				"comment_id": 10,
				"body": "Раньше отображался пост Hello ZeroMe. Сейчас отображается Create new profile. При попытке создания выдаёт ошибку User mistalero@zeroid.bit already exists on this hub.",
				"added": 1537436236
			},
			{
				"comment_id": 11,
				"body": "> [balancer73](#comment_436_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Похоже на то, что на ноде на загружен нужный хаб. Просмотр в 1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV показывает, что твой хаб — 1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a\n> Проверь, загружен ли http://127.0.0.1:43110/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/\nPlease use ZeroMe to browse profiles on this page.\n> Твой профиль: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54/mistalero@zeroid.bit\nUser not found or muted\n\nВот такие сообщения.",
				"added": 1537506374
			},
			{
				"comment_id": 12,
				"body": "> [balancer73](#comment_437_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Всё так. Это не самостоятельный сайт, а база данных, которой пользуется ZeroMe.\n> \n> А вот это косяк какой-то. Или сайт повреждён, попробуй:\n> \n> Проверить файлы через контекстное меню сайта на ZeroHello\n> Перестрой базу данных из настроек самого сайта\n> Ничего не поможет — удали и загрузи заново\nБлагодарю, вроде помогло.\n> \n> Или ты сам себя в игнор где-то внёс :D — посмотри в настройках игнора на ZeroHello.\nА это где?",
				"added": 1537524114
			},
			{
				"comment_id": 17,
				"body": "Снова проблема, правда возникла после зависания компьютера.\nInternal error: DatabaseError: database disk image is malformed\nUiWebsocket.py line 81 > UiWebsocket.py line 267 > UiWebsocketPlugin.py line 255 > Db.py line 81 > DbCursor.py line 75 - на странице ZeroHello.\nZeroMe вообще выдаёт страницу с текстом ошибок.",
				"added": 1538385935
			},
			{
				"comment_id": 18,
				"body": "> [anotherneko](#comment_102_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): rebuild database не спасает?\n\nКак это сделать? Ничего не помогает. Вообще.",
				"added": 1538413337
			},
			{
				"comment_id": 19,
				"body": "> [anotherneko](#comment_103_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): На нужном сайте потянуть влево нолик в правом верхнем углу, откроется панель, там в разделе database есть конпка Rebuild.\n\nНа сайте не отображается панель, потому что отображается страница ошибок.\nP.S. Какие надо сохранять файлы, чтобы переустановить программу?",
				"added": 1538501651
			},
			{
				"comment_id": 20,
				"body": "> [anotherneko](#comment_104_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Можно попробовать удалить сайт и добавить снова.\n\nУже удалил при заходе обратно на него выдаёт страницу ошибок.",
				"added": 1538772225
			}
		],
		"4_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 15,
				"body": "На странице ZeroHello высвечивается сообщение: контент отсутствует.\nP.S. Ну всё заработало.",
				"added": 1537868805
			},
			{
				"comment_id": 16,
				"body": "> [balancer73](#comment_443_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Заход через прокси. Т.е. не со своего сервера с локалхоста, а с внешнего адреса. Выше пример — https://www.zerogate.tk/17PEJfM9tdKs1JTxAMbcKzmYzrKJcUwMk5/\nРазумеется без авторизации.",
				"added": 1538148817
			},
			{
				"comment_id": 21,
				"body": "> [balandoppel](#comment_1_1CtQYHYjLTJzmztarDcifKU5SrGtZy8ptH): С авторизацией. Только есть тонкости. Сразу после обычного получения ZeroID нужно сохранить masterseed. Впоследствии с ним можно заходить с любого прокси, введя на ZeroHello сверху и зайдя однократно на ZeroID. Но этот masterseed будет потерян при первом же рестарте прокси (зачем его и нужно сохранить).\n> Пишу этот ответ через прокси (хотя и не с zerogate.tk — там что-то глючит) как раз для демонстрации :) // Balancer73\n\nГде взять masterseed когда уже давно зарегистрировался?",
				"added": 1540964079
			}
		],
		"10_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 22,
				"body": "Наверное они уже расшарились у других участников.",
				"added": 1544426617
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 23,
				"body": "> [floodping](#comment_1_1DvqmS7maVsxLZJmCn6NEtnfS7hVKskvdk): Ага.Правда user файл не догадался забрать домой, так что теперь есть еще и floodping.Изучаю идею, нравится. Воспринимаю как попытку возродить старое-ламповое, но на новой основе.Пока изучаю материал, чтобы сделать нормальный сайт инстеда тут. Кончено, вряд ли он будет тут нужен, но хочется обкатать технологию. :)\n\nИнстед - это который движок для текстовых игр?",
				"added": 1544528987
			}
		],
		"2_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 24,
				"body": "В Бесконечное лето, другие визуальные новеллы, совсем немного, различные RPG.",
				"added": 1547653108
			}
		],
		"1_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": [
			{
				"comment_id": 25,
				"body": "> [shaper](#comment_8_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE): Вот тебе и доска объявлений\nВсё таки это не совсем тоже самое.",
				"added": 1549488021
			},
			{
				"comment_id": 58,
				"body": "> [7heaven](#comment_17_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Есть, просто русскоязычных нету. Поищи в каталогах зайтов.\nИскал, не нашёл.",
				"added": 1552488496
			},
			{
				"comment_id": 61,
				"body": "> [7heaven](#comment_20_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): http://127.0.0.1:43110/143QwTJC1GuEu4TveFAzB4Qij7KMUD6ytt/?Home - ну вот кто-то создал форум для этого. При чем русский. Осталось только дождаться наплыва юзеров.\n\nЭто же не магазин, нет функции корзины.",
				"added": 1552577057
			},
			{
				"comment_id": 62,
				"body": "> [anotherneko](#comment_143_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Бывают магазины без этой функции.\n\nТогда это просто доска объявлений или витрина.",
				"added": 1552624841
			}
		],
		"16_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 26,
				"body": "Создал профиль, добавляйтесь.\n@xly4FhqsYTS3UOYJFDFalLkRlQVbziwRBjICMTXtpwo=.ed25519",
				"added": 1549489603
			},
			{
				"comment_id": 31,
				"body": "> [p2pnews](#comment_2_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i): а под сервер какой\n\nqypea1.dyndns.info:8009:@6lOh+rLq4MQubPQoKenbB9ipq75NVc2FAjy30MTc08o=.ed25519~93RP4aT6YNm+7++Ab3VQd+w/CL2w6p8QuX7fRaUs9cY=\nКажется под этот, пока ещё плохо разобрался.",
				"added": 1549903505
			},
			{
				"comment_id": 42,
				"body": "> [akiiro](#comment_20_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): Не смог тебя добавить, что нужно сделать?\nСначала присоединиться к этому пабу:\nqypea1.dyndns.info:8009:@6lOh+rLq4MQubPQoKenbB9ipq75NVc2FAjy30MTc08o=.ed25519~93RP4aT6YNm+7++Ab3VQd+w/CL2w6p8QuX7fRaUs9cY=\nПотом в окошке добавить ключ.",
				"added": 1551332760
			}
		],
		"2_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 27,
				"body": "> [minack](#comment_3_1JMwDcwoUEvk3erLuqzCpMtFJzKtHSPeom): Не будет работать.\n\nПочему?",
				"added": 1549533824
			}
		],
		"2_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 28,
				"body": "Как то он некорректно работает.",
				"added": 1549560430
			},
			{
				"comment_id": 29,
				"body": "> [quirrel](#comment_65_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Он не работает.Единственный более-менее работающий поисковик здесь.http://127.0.0.1:43110/Sites.ZeroNetwork.bit/\n\nЭто каталог, а не поисковик.",
				"added": 1549590879
			}
		],
		"1_1F4oxgYUoS5TYCgRahBQmzriDSrDhbsMYc": [
			{
				"comment_id": 30,
				"body": "> [quirrel](#comment_12_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Конечно, но только на огороженных сайтах (тут есть такая опция) и только для своих.\nЧто за опция?",
				"added": 1549591049
			}
		],
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 32,
				"body": "Что за Matrix?",
				"added": 1549903758
			}
		],
		"3_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": [
			{
				"comment_id": 33,
				"body": "Круто, а RPG-Maker или Ren'Py не пробовали?",
				"added": 1549907344
			}
		],
		"3_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 34,
				"body": "Сложно, но в целом понятно.",
				"added": 1550082228
			}
		],
		"7_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 35,
				"body": "Это конечно хорошо, но не совсем то что я хотел. Я имел ввиду сообщества по конкретным фандомам, ну или сеттингам. Например я участник сообщества изумрудного города А. Волкова с продолжениями. Пытаюсь привлечь участников фандома к DarkNet, пока без особых успехов. Вот ссылка на тему где я их пытаюсь сюда завлечь:\nhttp://izumgorod.borda.ru/?1-6-0-00000258-000-0-0-1550057684",
				"added": 1550093478
			},
			{
				"comment_id": 40,
				"body": "Ну, а ещё затем, что в ZeroNet сайты практически вечные.",
				"added": 1550475478
			}
		],
		"1_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ": [
			{
				"comment_id": 36,
				"body": "Да, действительно суша.",
				"added": 1550094122
			}
		],
		"4_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 37,
				"body": "Работает.",
				"added": 1550159524
			}
		],
		"37_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 38,
				"body": "> [p2pnews](#comment_6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i): идея не плохая\n\nКакая из них?",
				"added": 1550207705
			},
			{
				"comment_id": 39,
				"body": "> [p2pnews](#comment_8_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i): хостить diaspora в Onion\n\nДа, действительно, а можно ещё в i2p.",
				"added": 1550210245
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 41,
				"body": "Вообще то коммунизма не было, был социализм.",
				"added": 1551110860
			}
		],
		"1_1Ae4VAbPLC6ZzSEBoVBS76M8URVBJ9Fwqx": [
			{
				"comment_id": 43,
				"body": "> [redfish](#comment_3_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f):  Это потребует огромного вклада усилий, а ЗероНет может свернуться в любой момент -- это тебе не Тор (и даже не И2П), который хоть как-то проверены временем и не зависят от одного единственного человека.\nZeroNet же децентрализован, как он может свернуться?",
				"added": 1551680052
			}
		],
		"1_19vb3KdkTdVe3RCfqVvSPHSLZg1jZu6T6k": [
			{
				"comment_id": 44,
				"body": "> [bxze](#comment_17_1EuiXCvBRfV3qrJTyi4KPcnj9iEppALsrt): к сожалению он только под linux\n\nНа википедии написано, что существует неофициальная поддержка Windows, правда я не нашёл.",
				"added": 1551809364
			},
			{
				"comment_id": 45,
				"body": "Нашёл версию 0.8.1a, но она не коннектится, наверное потому что актуальная 0.11, хотя вряд ли.",
				"added": 1551814466
			}
		],
		"5_1EuiXCvBRfV3qrJTyi4KPcnj9iEppALsrt": [
			{
				"comment_id": 46,
				"body": "А ссылку можно?",
				"added": 1551849432
			}
		],
		"2_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 47,
				"body": "Briar, как и GNUnet не поддерживает Windows, хотя википедия опять утверждает обратное.",
				"added": 1551866138
			},
			{
				"comment_id": 53,
				"body": "> [p2pnode](#comment_1_1CjXSjhpi742HFZts17YvN1U1v9CfrWHsq): https://jami.net/\n\nПод Windows вылетает с ошибкой.",
				"added": 1552023414
			}
		],
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 48,
				"body": "Scuttlebutt\nRetroShare\ntwister",
				"added": 1551977334
			}
		],
		"1_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 49,
				"body": "> [radjah](#comment_11_1KMBUmz57LumMsDZfoZJkzZhXC6FVcZrik): Эталонное ненужно. Будут там сидеть 3,5 гигка, которым в этом всё интересно колупаться. Остальным нужны музычка, видосики и картинки с котиками.\n\nПро игры забыли.",
				"added": 1551979904
			}
		],
		"1_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN": [
			{
				"comment_id": 50,
				"body": "Советские клоны и эмуляторы считаются?",
				"added": 1551980026
			}
		],
		"2_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 51,
				"body": "> [waylander](#comment_3_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2): даже браузерную игру\n\nКакую нибудь ферму или стратегию вполне реально.",
				"added": 1551980645
			}
		],
		"1_1Ku6DJ6bJHACK1VxwWZusvZ2KsseirHg6n": [
			{
				"comment_id": 52,
				"body": "Под Windows и то нет.",
				"added": 1551983613
			}
		],
		"1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 54,
				"body": "В локальной сети между компьютерами связь обеспечивается без участия провайдера.",
				"added": 1552056270
			},
			{
				"comment_id": 55,
				"body": "> [gsdth](#comment_2_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): это уже давно не так сечас не 2000 годы щас что то вроде vpn виртуальный изолированный канал шяс шлюз проваидера сам назначает вам диап виртуальный\n\nЕсли провайдер районный или домовой тоже так?",
				"added": 1552058133
			}
		],
		"5_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 56,
				"body": "Ной - это имя, пиши с большой буквы, а так молодец.",
				"added": 1552289832
			}
		],
		"1_14Jt9sxL6kaXBqgKppfZC9KiFV6JsZeNSx": [
			{
				"comment_id": 57,
				"body": "Вероятно форум появился несколько позднее.",
				"added": 1552405061
			}
		],
		"1_1MQFAyvjKRauYuP6a7sFBTyUVxPDVYsaHZ": [
			{
				"comment_id": 59,
				"body": "> [gsdth](#comment_5_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): начните с написание IDE короче для этого целая инфраструктура нужна которую даже гугл создавать поленился как результат мы имеем в андроиде переделанное ядро linux которые создавали программисты со всего мира\n\nВ том  и вопрос, как написать хотя бы программу HelloWorld?",
				"added": 1552488934
			}
		],
		"2_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": [
			{
				"comment_id": 60,
				"body": "> [7heaven](#comment_18_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): Да. Единственные два активно развивающийся проекты по децентрализированному интернету.\n\nТолько в RetroShare контент имеет свойство удаляться с течением времени независимо от его степени востребованности.",
				"added": 1552489423
			}
		],
		"10_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 63,
				"body": "> [promusik](#comment_66_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Зачем?\n\nИграть и ни от кого не зависеть.",
				"added": 1553074431
			},
			{
				"comment_id": 64,
				"body": "> [unme](#comment_1_16RytYnwdeUwGU9FfQR6XWbMV56HYuVMTB): не платить за серверы,\n\nРазработка может обойтись дороже, чем содержание серверов.",
				"added": 1554747566
			}
		],
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 65,
				"body": "> [deliriumgoddess6](#comment_25_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): скачал jami, но прога крашится при добавлении контакта\n\nТоже самое, обновления не нашёл.",
				"added": 1554877754
			},
			{
				"comment_id": 66,
				"body": "> [deliriumgoddess6](#comment_32_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): а у меня уже получилось добавить почему то, скажи как тебя там найти\nНе смог создать аккаунт, он постоянно вылетает, поэтому не найти.",
				"added": 1555047543
			}
		],
		"1_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 67,
				"body": "Звал на форуме изумрудного города, вот обсуждение:\nhttp://izumgorod.borda.ru/?1-6-0-00000258-000-0-0-1550720468",
				"added": 1556563209
			}
		],
		"11_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 68,
				"body": "> [kiraioshikage](#comment_9_1HCrHxcDShSn2H1rTBLkYYpScn7BhF3wLa): А можно проще? А то я укроп..\n\nДецентрализованное 3D пространство.",
				"added": 1556563419
			},
			{
				"comment_id": 69,
				"body": "> [root31337](#comment_2_14EzDCmg4n3iqQqG3rGyuXrY6oatRuzu5U): OpenSim? SecondLife  ))\n\nНет, они централизованы.",
				"added": 1557385143
			}
		],
		"3_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 70,
				"body": "Роскомнадзор признал, что изоляция рунета невозможна технически\nhttps://ichip.ru/roskomnadzor-priznal-chto-izolyatsiya-runeta-nevozmozhna-tehnicheski.html",
				"added": 1560174240
			}
		],
		"2_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [],
		"1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 72,
				"body": "Чаще всего люди счастливы рядом с любимыми.",
				"added": 1561432740
			}
		],
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 73,
				"body": "> [geekless](#comment_169_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):  Более существенная причина в том, что хабы всё равно нужны для того, чтобы пользователи могли друг о друге узнать - иначе получается идеальная (полностью закрытая) схема белого списка: «чтобы узнать о чем-то, ты должен сначала узнать об этом где-то в другом месте, а у тебя для этого каналов связи нет».\n\nКак в RetroShare?",
				"added": 1561665370
			}
		],
		"1_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": [
			{
				"comment_id": 74,
				"body": "> [justman](#comment_5_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE):  можно будет удалять пользователей с базы которые не будут активны на протяжении какого то периода, 1 год (к примеру)\nА вот этого не надо!",
				"added": 1562566220
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 75,
				"body": "Несколько владельцев вместо одного, это не выход. Чтобы ZeroNet не крутился вокруг одного человека, стоит действовать иначе. Создать альтернативную версию клиента, а лучше несколько. Клиент вместо страницы ZeroHello будет загружать, к примеру, рабочий стол. Зайты на рабочем столе будут являться приложениями.",
				"added": 1564069113
			},
			{
				"comment_id": 76,
				"body": "> [if0](#comment_138_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): И кто, интересно, будет этим заниматься, учитывая столь низкую востребованность данной сети? К тому же, сетевой протокол в референсной версии может в любой момент измениться, что сделает все альтернативные клиенты неработоспособными.\n\nКто умеет, тот и займётся. Это же не проприетарный софт , чтобы протокол от версии к версии менялся. С появлением альтернативных клиентов выработается некий стандарт. Их же можно сделать ближе к народу. Тогда и востребованность сети появится.",
				"added": 1564115213
			},
			{
				"comment_id": 77,
				"body": "> [if0](#comment_139_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Дело как раз в том, что - никому не нужно, если судить по количеству пользователей.\n\nЭтому количеству нужно.\n\n> Топик как раз про то, что рулит стандартами один единственный человек. Форк делать никто не будет, потому что сложностей в его долговременном поддержании будет много, а пользователей, ради которого он будет сделан - мало. Отсутствует целесообразность. \n\n> Сеть, использующаяя принцип p2p никогда не будет \"близка к народу\", потому что: сложно, жруще, неудобно, глюкаво, имеет дурную репутацию, и главное - плохо монетизируется. p2p для тех, кто знает для чего она нужна и готов ради этого мириться с неудобствами.\nTorrent не p2p или он недостаточно близок?\n\n> \"Утром - деньги, вечером - стулья!\" Нет пользователей -> нет контента -> нет пользовтелей.\nСоциальные сети в клирнете как то начинали?",
				"added": 1564385671
			},
			{
				"comment_id": 78,
				"body": "> [ultraviolet](#comment_77_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Предлагаю начать укрепление ZeroNet с малого\n> \n> Создать трекер на территории России на случай отключения внешних связей\n> \n> Сделать мост в RetroShare и обратно.  \n> \n> \n> Сообщения с этого форума должны отображаться в специальный форум в RetroShare и наоборот. Аналогично с чатами и с электронной почтой.\n\nПоддерживаю.\n\n> [if0](#comment_142_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): \n> Расскажите, пожалуйста, каким образом (кроме доната) можно монетизировать контент в ZN или и в других подобных сетях (с анонимными аккаунтами),  позволяющие каждому пользователю создавать любое количество аккаунтов \"без регистрации и SMS\"?\nКак телега монетизирует?",
				"added": 1564425542
			},
			{
				"comment_id": 79,
				"body": "> [if0](#comment_143_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Телега стала анонимной распределенной p2p сетью? Интересная новость. А мужики то и не знали...\n\nКто это сказал?",
				"added": 1564465070
			},
			{
				"comment_id": 80,
				"body": "> [if0](#comment_145_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Вы :-) Ответив вопросом на вопрос.\n> Модели монетизации централизованных сетей неприменимы к распределенным, хотя бы из-за невозможности аутентификации пользователей и как следствие - сложности определения количества реальных просмотров того или иного контента из-за возможности создания любого количества аккаунтов для накрутки статистики. Поэтому я и задал вопрос: \"как монетизировать контент в распределенных сетях\"?\n\nНу хорошо, а в торрентах как хоть что то монетизируется?",
				"added": 1564509298
			},
			{
				"comment_id": 81,
				"body": "> [if0](#comment_148_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В торрентах действует совершенно другая мотивационная модель. В отличии от социалок, при помощи торрентров, в подавляющем большинстве случаев, распространяется чужой контент, не требующий от его распространителя затрат на его создание, даже близко сопоставимых с трудозатратами на создание своего собственного.\n\nЭто верно, здесь не пиратский контент раздаётся. Но если уж так требуется найти способ монетизации, можно создать браузерную MMO. Это уже обсуждалось. Наверняка многие бы согласились в неё задонатить. Даже я... хотя вряд ли:-)",
				"added": 1564518333
			},
			{
				"comment_id": 82,
				"body": "> [if0](#comment_149_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Вот и ответ, на вопрос: \"почему p2p сети (за исключением торрентов, которые занимают свою обособленную нишу) имеют низкую популяроность?\"\n\nГде тут ответ?\n\n> Монетизация для p2p - технически сложна и нарушает анонимность, создатели контента останутся в сетях, позволяющих зарабатывать на нем или хотя бы частично отбивать затраты, хомяки будут сидеть там, где есть контент.\n\nСложна, но возможна, а анонимность обеспечивается криптой.\n\n> Для p2p сетей остается ничтожная доля процента маргиналов, принципиально не желающих быть хомяками в коммерческих социалках, но создающие собственный контент сугубо по остаточному принципу (редко и мало),  на чистом энтузиазме, не имея возможности хоть как-то окупать свой труд.\n\nБыло бы желание, ну и способности конечно.",
				"added": 1564529550
			},
			{
				"comment_id": 83,
				"body": "> [if0](#comment_187_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): \n> По поводу предложений стоит обратиться к @mistalero\nОбращайтесь, слушаю вас. Почему мне в теме видны последние сообщения только от @if0? Да и вообще сообщения двухдневной давности отобразились только сегодня утром.",
				"added": 1565156552
			},
			{
				"comment_id": 84,
				"body": "Что такое цп?",
				"added": 1565206641
			}
		],
		"5_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 85,
				"body": "Появляется.",
				"added": 1565359754
			}
		],
		"5_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 86,
				"body": "Не нашёл готовых сборок под windows, компилировать самому из исходников?",
				"added": 1565713214
			},
			{
				"comment_id": 87,
				"body": "> [wrewolf](#comment_183_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Ну для этого же искать надо было )\n\nВ IE отобразилась страница без ссылок на загрузки, только потом догадался в  другом браузере открыть.",
				"added": 1565852281
			},
			{
				"comment_id": 88,
				"body": "> [wrewolf](#comment_185_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Вообще отдельная тема, что ZN в IE работает? о_О?\n\nРаботает, только вкладки не поддерживает.",
				"added": 1566413725
			}
		],
		"7_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 89,
				"body": "Только нужно не просто сочинять историю, а отыгрывать роль за своего персонажа.",
				"added": 1582840363
			}
		]
	},
	"comment_vote": {
		"419_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"62_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"7_17qo2gNdw4Jq2nX2PtpnTXS3WVLxP5UvMx": 1,
		"436_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"439_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"443_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"468_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"14_1GP11T6BYKsTz63srBNo43iTjZaX461o3i": 1,
		"1_12vGFdk1Ur5rE7PqeGRzs5GwDg2Fmb1YDA": 1,
		"42_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"130_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"1_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": 1,
		"22_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd": 1,
		"1_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": 1,
		"15_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"18_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"2_14EzDCmg4n3iqQqG3rGyuXrY6oatRuzu5U": 1,
		"5_1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv": 1,
		"48_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": 1
	}
}