{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1561814117,
			"title": "The clearnet is creeping toward ridiculous amounts of advertising",
			"body": "YouTube now plays two ads in a row. A free calling and texting app I use has two ads showing at the same time.\n\nI think this is the aspect of unbridled capitalism we're told about.\n\nGranted, I'm not for communism either. What I've learned about Russia is that their royal family had been executed to bring it about, plus it's one of the forms of government that fought against Catalonian anarchy. I'm sure of unbridled communism being another similar phenomenon.\n\nI'm just trying to observe this supposed growing hunger of corporations to make higher profit margins.\n\nThe clearnet is becoming ridiculous.\n\nThis is a good reason why we should be careful with cryptocurrencies, plus the fact that for-profit leads to pro-censorship and maintaining government lies.",
			"added": 1561814116
		},
		{
			"topic_id": 1561847289,
			"title": "Alts to YouTube but with YouTube Videos",
			"body": "Android: Newpipe (F-Droid), https://Videoder.net and https://Ymusic.io\n\nDesktop:\n\nYouTube-dl\n\nhttps://freetubeapp.io/\n\nWeb:\n\nhttps://invidio.us/\n\n https://hooktube.com/\n\nHelp me fill this list.",
			"added": 1561847287
		},
		{
			"topic_id": 1627609672,
			"title": "This site's really messed up looking. Fix the CSS.",
			"body": "Titles and text go off-screen. I can't even see text in the input boxes for a width the size of the site title \"NetTalk Electronics Computers Internet.\" Thread subjects and bodies also go off screen.\n\nI don't participate here because of this..",
			"added": 1627609669,
			"modified": 1627647274
		}
	],
	"topic_vote": {
		"1535684571_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1528386725_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1538386317_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1560773982_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1566288245_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1524692872_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1636624775_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1532691444_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "You very rarely find ISPs with symmetric ⬆️⬇️ speeds, but it would be ideal. It's not good for content creators, nor P2P that there's a lack of bandwidth symmetry.",
				"added": 1533260137
			}
		],
		"1528234320_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "Visit here to configure Cloudflare's DNS, or if you have Android 9.0+, just enter the URL text into the Private DNS field in network & internet settings under Advanced, as it packs both IPv4 and IPv6 addresses:  [1dot1dot1dot1.cloudflare-dns.com](https://1dot1dot1dot1.cloudflare-dns.com)",
				"added": 1534896869
			}
		],
		"1561738460_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [],
		"1561814117_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "I use alternatives to the YouTube app, and like others, would use YouTube proxy sites in a browser.",
				"added": 1561846215
			}
		],
		"1561938559_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 5,
				"body": "You'll have to choose how many you want to run. They're all different.",
				"added": 1561938738
			},
			{
				"comment_id": 6,
				"body": "> [xcape2net](#comment_3_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Either you (styromaniac) didn't understand my question or I didn't understand your answer.  Let me rephrase my question.  Is it possible in the future that ZeroNet and other open source peer-to-peer networks could be linked together somehow (the way Friendica, Diaspora, and other peer-to-peer social networks are linked together now), so that if I'm running only ZeroNet on my computer, I can also get to Blockstack websites and Freenet websites.  I suspect the answer to my question may be \"no\".  But I was wondering, if all peer-to-peer networks could agree on a common format, would it be possible?\n\nI think it's unlikely.",
				"added": 1561947447
			},
			{
				"comment_id": 7,
				"body": "ZeroNet over IPFS is actually being worked on by some developers.",
				"added": 1562046236
			},
			{
				"comment_id": 8,
				"body": "> [xcape2net](#comment_10_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): That's good.  Seems like IPFS has some problems, but hopefully they'll be fixed.  Any idea about how the ZeroNet over IPS effort is going?\n\nBlurHY and D14NA seem to be working out the details of the idea.",
				"added": 1562068211
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_87_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I am not sure what is/are repo/s of this project, but found this: https://github.com/blurHY/AxonetSo watch/subscribe it if you want news.\n\nI pretty much named it. That's why I call it Axon.",
				"added": 1562242270
			}
		],
		"1517334612_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [],
		"1574531764_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "Install Gentoo.",
				"added": 1574538750
			},
			{
				"comment_id": 12,
				"body": "BTW, my comment is an ancient internet meme. Don't take it seriously.",
				"added": 1574565051
			}
		],
		"1584527577_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 13,
				"body": "If it's not the same microwaves that come from a microwave oven and if it's not ionizing radiation, then it should be okay.",
				"added": 1584540567
			}
		],
		"1584884182_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 14,
				"body": "Get a six core or higher AMD CPU. Handbrake has diminishing returns after 6 cores.",
				"added": 1584893116
			},
			{
				"comment_id": 15,
				"body": "VP9 doesn't have HEVC support, BTW.",
				"added": 1584905577
			}
		],
		"1588013341_13Pvy84dV1dMFAjrmAp7c8Aibs3uotYaAw": [
			{
				"comment_id": 16,
				"body": "This cracka doesn't know.",
				"added": 1588035039
			}
		],
		"1548340010_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 17,
				"body": "Is there one for Android with a firewall built in? I think it's best to block clearnet access from the browser as well as tunneling traffic.",
				"added": 1625507869
			}
		],
		"1627609672_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 18,
				"body": "I've replaced the CSS file of this site with the one belonging to ZeroTalk. Now everything's better.",
				"added": 1627610428
			},
			{
				"comment_id": 19,
				"body": "> [ssdifnskdjfnsdjk](#comment_153_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @styromaniac thank You for the feedback. I have tried to upgrade the site from zerotalk to zerotalk++ (changing cloned_from in content.json and clicking Upgrade code on ZeroHello, and then rebuilding & reloading site's DB).Can you check if issue persist? I see that in previous design and when i have set very low width of my browser window the text overflowed to the left. Now it does not ) [...]\n\nAll better. Thank you.",
				"added": 1627648941,
				"modified": 1627648963
			}
		]
	},
	"comment_vote": {
		"1_1ErxHxUEptPABYktaSbc93xGXnCLfsLaWo": 1,
		"1_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_1EgzWjmHScPyRx64GHH2bNXpGsbbshKjPA": 1,
		"83_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"5_1EgzWjmHScPyRx64GHH2bNXpGsbbshKjPA": 1,
		"1_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"2_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": 1,
		"10_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1
	}
}