{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1552785558,
			"title": "The infamous brick video (hosted on the original YouTube.com- not 0net)",
			"body": "https://www.youtube.com/watch?v=iazTQVi1CEE\n\nDon't worry, the video is 7 years old, it won't get taken down.",
			"added": 1552785557
		},
		{
			"topic_id": 1552894412,
			"title": "Our Mission Statement and How to Help Our Community",
			"body": "Mission Statement:\nOur mission statement is to provide a safe space for the public to conduct discussing of all matters of life and death scenarios that happen in the world, understand why it has occurred, and ultimately learn how to be proactive and prevent such incidents from happening in our own daily lives.\n\nHow you can help:\nIf you are viewing this site through our wpd.world proxy, then you are not helping to seed the site.  However, you can still help our community by posting content, commenting, and otherwise participating in our community in accordance with our rules.\n\nYou can help to seed the site by visiting https://zeronet.io/ , downloading ZeroNet, extracting the folder, and running the ZeroNet.exe.  Then, paste the following link into your favorite browser's URL bar:\n\n`http://127.0.0.1:43110/1P7FMP3qngJxRhJidG2C41faCo6yozj2KJ/`\n\nYou've now visited the actual site, and are receiving the data from other site seeders around the world.  Now when you download information from the site, ZeroNet will automatically save it into its folder on your computer, and it will seed it to other users as long as the .exe is running in your system tray (it auto launches on startup).\n\nBecause there is not one single server hosting this website, the very existence of the website relies on its seeders.  Seeding is a small and simple way to make a big difference in preserving the WPD community.  Please consider helping us by seeding.\n\nIf you are unable or unwilling to seed, you can also help us by inviting other people to join our community.\n\nThank you.",
			"added": 1552894410
		}
	],
	"topic_vote": {
		"1552745893_1Eq9RTPSPgdtJv2Q8wGUNXtp7qc6eo3a5B": 1,
		"1552891359_1N4d19g24kkXu5c2yJu2YpkgFKTWqLgvKe": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1552742469_1JP58rD6MN7BLfGvDTqyBHSwoUvUhvkobZ": [
			{
				"comment_id": 1,
				"parent_id": "comment_1_1LykTh9k8JtMsWJVVDxBUG5E5bVTDv1AkZ",
				"body": "Testing comment reply",
				"added": 1552783169
			},
			{
				"comment_id": 5,
				"parent_id": "",
				"body": "Primary server is banned.  Please just go directly to the backup server.  Also, please look at the sticky.  It provides us with other communal hubs like 8ch.net/wpd/ and a few telegram locations.",
				"added": 1552872016
			}
		],
		"1552740115_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg": [
			{
				"comment_id": 2,
				"parent_id": "comment_1_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg",
				"body": "testing comment reply",
				"added": 1552783475
			},
			{
				"comment_id": 8,
				"parent_id": "comment_1_1LniyqF4ysYtgN7epykcnTY2tMhjGNvrfW",
				"body": "Personally, I'm surprised how far its come along already!  Already buzzing with activity and it's only been like two days.",
				"added": 1552894826
			}
		],
		"1552778507_1P373RgxSZiCtpxC37TfNRYt5Pyb3JN2z8": [
			{
				"comment_id": 3,
				"parent_id": "",
				"body": "I hate how it looks like he's still moving afterwards.",
				"added": 1552785273
			}
		],
		"1552741471_1NqmcCyRVM9TsQQueXQCZkhCdRc5cHH1k3": [
			{
				"comment_id": 4,
				"parent_id": "comment_1_18pFELFDdnXNtDr3XTUddUFR2PLTw7uCtw",
				"body": "I think that if we are going to allow non-fatal gore, then it should have its own section... that way we basically have the old sub with the old rules, but the website is expanded to include basically /r/gore as well.",
				"added": 1552789100
			}
		],
		"1552891359_1N4d19g24kkXu5c2yJu2YpkgFKTWqLgvKe": [
			{
				"comment_id": 6,
				"parent_id": "comment_1_1NZrmyqh8TuE1swhpBzftF68EF4MJ9wcK2",
				"body": "It links to a p2p zeronet youtube clone.  You won't end up seeding the videos unless you click 'seed' on them.",
				"added": 1552894614
			},
			{
				"comment_id": 7,
				"parent_id": "comment_8_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg",
				"body": "That's what Kitsune was just talking about.  He might implement it.  Either way, I think that this site has a lot of improvements coming its way.",
				"added": 1552894675
			}
		],
		"1552925271_1NZrmyqh8TuE1swhpBzftF68EF4MJ9wcK2": [
			{
				"comment_id": 9,
				"parent_id": "",
				"body": "Kitsune or whoever has control over this site, maybe consider stickying this post.",
				"added": 1552964943
			},
			{
				"comment_id": 10,
				"parent_id": "",
				"body": "Vape, upload them to your mega account (make one if you don't have one) and then PM me the sharelink and I'll put it in the pastebin.",
				"added": 1552964993
			}
		]
	},
	"comment_vote": {
		"1_18pFELFDdnXNtDr3XTUddUFR2PLTw7uCtw": 1,
		"1_1N4d19g24kkXu5c2yJu2YpkgFKTWqLgvKe": 1,
		"1_1J4haWzZE62HoRUkVQbQmsPwg9HsCpjE9m": 1,
		"1_1DTxpAMfAWGZjUhZxBx9fQzCmcf1Xi3JiC": 1,
		"1_12B2nXHRXwRQHRihKGa4XWgyk1gDZ6x1Hu": 1,
		"4_1PCXzTVRKs5Fv2x7DNBc6PWZ8GyK7Rj65j": 1,
		"3_1N4d19g24kkXu5c2yJu2YpkgFKTWqLgvKe": 1,
		"1_14GmrfLHrqmHg6QG1PDVcP1zYiE7sk8a3J": 1,
		"2_15oegFThsV4jSHsxrxJZqohAAHjSsfAeb1": 1,
		"1_1JF8gdmJXDbF2vxke76k3aarmx8orXu5Kx": 1,
		"1_1LniyqF4ysYtgN7epykcnTY2tMhjGNvrfW": 1,
		"9_1PCXzTVRKs5Fv2x7DNBc6PWZ8GyK7Rj65j": 1,
		"10_1PCXzTVRKs5Fv2x7DNBc6PWZ8GyK7Rj65j": 1
	}
}