{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Sites sendo fechados",
			"body": "Eu acho extremamente desnecessário essa tal de \"operação barba negra\" que está fechando os sites piratas de filmes e séries, seria menos inaceitavel se o país estivesse sem problemas e isso se tornasse um problema, mas mesmo nessa situação acho isso desnecessário, já que informação e entretenimento deveriam ser absolutamente sem custo, alguém mais compartilha da mesma opinião, e se não, por quê?",
			"added": 1476544595
		},
		{
			"topic_id": 2,
			"title": "PEC 241",
			"body": "Eu sou um dos organizadores da ocupação da minha escola, como forma de protesto contra a PEC-241, e como na surface eu não teria tanta liberdade para criticar ela a vontade, eu venho até aqui para perguntar, qual a opinião de vocês a respeito da PEC-241?",
			"added": 1476977764
		},
		{
			"topic_id": 3,
			"title": "Anarquia",
			"body": "Existem anarquistas aqui? se sim, o que fez vocês aderirem o sistema?",
			"added": 1477331364
		}
	],
	"topic_vote": {
		"1_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": 1
	},
	"next_comment_id": 12,
	"comment": {
		"8_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": [
			{
				"comment_id": 1,
				"body": "Sou novo na zeronet, alguém pode me passar links interessantes, pode ser sobre qualquer conteúdo, só quero explorar a rede",
				"added": 1476456643
			},
			{
				"comment_id": 6,
				"body": "> [brkaka](#comment_30_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Infelizmente a maior parte do conteúdo está em inglês, mas veja a Wiki.\n\na parte do inglês não é problema, o problema é quando só acha conteúdo em russo ou polonês, obrigado pela ajuda",
				"added": 1477258763
			}
		],
		"1_18FhdUHnAmpoL4kuTCTvDyowHAsTUJCy6R": [
			{
				"comment_id": 2,
				"body": "> [kaba](#comment_1_1Ca76ePnEytHg93yUFEQPHCGV1VybJyyAp): o link não esta pegando aqui não\n\nnem aqui",
				"added": 1476464343
			}
		],
		"1_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 3,
				"body": "> [sirenyc](#comment_138_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Dessa vez foram 3 sites. E só a glr vim para ZeroNet e baixar =p\n> Para quem ainda não conhece =)\n> ZeroTV - http://127.0.0.1:43110/1BEJbnufyav7TK23ADTs2Qi2UJeKSGDzw6/PLAY - http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n\n mas sempre vão ter usuarios mais casuais, e que vão ter medo da zeronet e deep em geral devido a posts fakes publicados na surface, isso tudo seria resolvido se as pessoas aprendessem a como realmente usar a internet, sair do facebook, youtube e só, aprender a realmente explorar esse gigantesco mundo que a internet oferece, basta saber usar",
				"added": 1476554519
			},
			{
				"comment_id": 4,
				"body": "> [kosherx](#comment_14_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Eu só vim aqui pra dar risada dos socialistas mesmo. E você é um deles.\n\nnão sou socialista, mas eu acredito que informação deveria ser livre",
				"added": 1476567252
			},
			{
				"comment_id": 5,
				"body": "> [kosherx](#comment_15_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Você é socialista justamente por isso. Recursos têm custos. Informação é um recurso. E liberdade não significa ausência de custos, muito pelo contrário.\n\ninteressante o seu ponto, não pensei por esse lado, acho que isso me faz \"socialista\", hahaha",
				"added": 1476580354
			}
		],
		"3_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 7,
				"body": "> [kosherx](#comment_46_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Sim, existem.\n\nentão kosherx, por você eu já esperava, baseado em relatos de publicações passadas, em fato acho até que você é o membro que mais admiro aqui",
				"added": 1477417177
			}
		],
		"2_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 9,
				"body": "uma questão é que eu não tinha me aprofundado muito sobre a pec ainda agora que consegui compreender ela, eu não sei que ideia estupida foi aquela de ocupação, mas enfim, a sorte é que não foi aprovada",
				"added": 1477433832
			},
			{
				"comment_id": 10,
				"body": "> [kosherx](#comment_49_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): você sabe realmente do que tá falando? PEC, ou qualquer PL que seja, demora muito tempo pra ser aprovada ou não. a 241 foi aprovada em 2 turnos na câmara de deputados, vai pra aprovação no senado agora, mais 2 turnos de debates e tal. não foi aprovada nem desaprovada, ainda.\n\neu estava falando que a ocupação da minha escola não foi aprovada, não especifiquei bem",
				"added": 1477497482
			},
			{
				"comment_id": 11,
				"body": "> [kosherx](#comment_51_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): ah, ok. eu não entendi bem. enfim, esse negócio de ocupação de escola, a meu ver, é maluquice, os jovens não sabem o que fazem lá, são massa de manobra de interesses políticos.\n\neu percebi o tamanho da merda quando me colocaram em um grupo de whatsapp (telegram >) e as coisas que eles mandavam eram coisas absurdas, que você via que eram falsas com 2 minutos no google",
				"added": 1477528301
			}
		]
	},
	"comment_vote": {
		"12_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"47_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1
	}
}