{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1550072417,
			"title": "A Timeline of Article 13 (2015 - 2019)",
			"body": "With all the confusion around Article 13 and who it does or doesn't benefit. I figured it might be beneficial to examine a timeline of the events reported by TorrentFreak. \n\nThe article is posted on Unlimit Talk Article: http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1550001108_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY/A+TF+Timeline+of+Article+13+2015+2019",
			"added": 1550072416
		},
		{
			"topic_id": 1550532914,
			"title": "The Copyright Directive: how the mob was told to save the dragon and slay the knight",
			"body": "######By: European Commission   -  Feb 14\n\nFor those of you, who don’t know nor care about what the Copyright Directive is nor any of the articles within it, look away now.\n\nTake this test: Type in ‘EU Copyright Directive’ into the search box in Youtube. The majority of results in the top 20 will be passionately against it. Here’s some of the headlines, if you’re not sure: \n_‘Shocking update on the Copyright Directive.’ ‘Today Europe lost the Internet’ ‘How the new copyright laws will destroy the internet’ ‘Censorship machines’, ‘EU to end the internet’_ or _‘Europe to ban all memes’_\n\n__Of course, we know from recent elections and referendums that simple memorable slogans — however untrue or unobtainable — can go a long way to winning over hearts, minds and voters.__ And so it was, that the wholly inaccurate phrases ‘ link taxes ’ and ‘ censorship machines ’ started to be part of the campaign against the proposed Copyright Directive. Never let the truth get in the way of a catchy slogan.\n\nThe idea behind the Directive is to bring copyright rules into the 21st century. The current rules are very analogue and designed for the world before the web. Things have changed. Search and social media platforms largely define the way we enjoy content today, but their market dominance has now tilted the balance in their favour and away from those who design and create original things.\n\nAs it stands, big internet platforms such as Facebook or Google make a lot of money from ads that appear on their sites alongside copyrighted material such as music or clips. The more people view, the more money platforms can earn from those adverts.\n\nJust as Google and Facebook are being rewarded financially for all their hard work in producing amazing software, clever algorithms and exciting designs, we think authors, film-makers, journalists and musicians should also be rewarded for their endeavours too. At the moment the balance of power in who gets paid for such royalties resides overwhelmingly with the big Californian companies — who are worth around $1 Trillion.\n\nThe Copyright Directive is an attempt to create a level playing field where everyone can gain from the amazing options that the new technologies offer. Musicians, artists, video producers and the whole creative sector will benefit by having a fairer negotiating position.\n\nJournalists and online publications will have more money to keep on financing quality research and news. Despite what you might read, the Copyright directive supports a free press and could enable journalists to get some money when their articles are shared online. Good journalism costs money and without a free press there is no democracy.\n\nFair remuneration for and from the platforms and a fairer market place is what we want. We cannot achieve a real European digital single market which makes us all better off, if copyrighted material is misused or poorly remunerated. Because if creative people don’t get paid, they can’t afford to be creative. No Mon = No Fun\n\nJust like everyone else, the EU loves culture, cinema, art and music. We have no intention in restricting young people’s access to all these wonderful things on- or offline. Oh and by the way, no matter what some people (and paid-for campaigns) may tell you, you will never be prevented from having a laugh online. WE ARE NOT BANNING MEMES. On the contrary, there will be a guarantee that platforms respect your right to self-expression. That includes pastiche, critique and parody.\n\nNonetheless, it appears as if the largest search and video platforms in the world are afraid of regulation — despite having overwhelming dominance on the internet.\n\nFurthermore, there is ample evidence from respected sources, [here](https://www.ft.com/content/a8031d7a-78a0-11e8-bc55-50daf11b720d) and [here](https://www.theguardian.com/technology/2017/jul/13/google-millions-academic-research-influence-opinion) and perhaps [here](https://www.europeforcreativity.org/media/) or [here](https://www.lemonde.fr/economie/article/2018/09/03/a-bruxelles-l-intense-guerre-des-lobbies-autour-de-la-directive-copyright_5349374_3234.html) or [indeed here](https://www.corriere.it/cronache/18_novembre_23/i-ragazzi-arruolati-youtube-28dc8472-ef61-11e8-adae-c6c1226ef971.shtml?refresh_ce-cp) that ‘Big Technology’ has even [‘created’ grassroots campaigns](https://thetrichordist.com/2018/07/27/article-13-anatomy-of-a-political-hack-guest-post-by-volker-rieck/) against the Copyright Directive in order to make it look and sound as if the EU is acting against the ‘will of the people’.\n\nThat’s another myth. Unlike Google and Facebook, the EU is answerable to the public and to democratically elected politicians. Member states — through the Digital Single market — aim to make it easier and cheaper for European consumers and companies to surf, trade, study and work digitally in the EU.\n\nAs with most EU legislation, the text must be agreed by a majority of member states and voted upon by MEPs in the European Parliament.\n\nSo next time, when you get a sponsored message on your timeline, which says something like ‘the EU will kill the world wide web as we know it’, stop, pause and consider for a moment. Ask yourself: Cui Bono? Who really benefits from this message or this wider negative campaign?\n\nDo Google, Facebook or others really need to pay to persuade?\n\nAre we in a world where ordinary people side with the fire breathing dragon against the knight with a blue and yellow shield?\n\n__If you care, think before you share.__\n\nFor fewer myths and more facts, why not [click here](https://ec.europa.eu/digital-single-market/en/policies/copyright) or [here](https://medium.com/@EuropeanCommission/it-is-all-about-protecting-youtube-creators-26d18c0ea5b5) or [perhaps here](https://medium.com/@EuropeanCommission/https-medium-com-europeancommission-no-no-no-we-are-not-banning-memes-copyright-proposal-abf4d21f65d2) or [even here](https://medium.com/@EuropeanCommission/european-copyright-reform-benefit-469810710347).\n\n## Information on the Copyright Directive:\n- [What is the new Copyright Directive all about? (FAQs)](http://europa.eu/rapid/press-release_MEMO-19-1151_en.htm)\n- [Some of the common questions around the directive](https://ec.europa.eu/digital-single-market/en/faq/frequently-asked-questions-copyright-reform)\n- [Press Release](http://europa.eu/rapid/press-release_IP-19-528_en.htm)\n- [Factsheet](https://ec.europa.eu/digital-single-market/sites/digital-agenda/files/newsroom/copyright_web_41703_5.jpg)\n",
			"added": 1550532912
		}
	],
	"topic_vote": {
		"1528386725_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {
		"48_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"53_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1_1Gsi9eT29B2uDs5bgE8av17QJe4hZotADa": 1
	}
}