{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "1964: “O Brasil não estava à beira do comunismo”, diz historiador",
			"body": "O golpe militar que mergulhou o país num de seus períodos mais sombrios completa hoje 55 anos. Neste aniversário do golpe que durou de 1964 a 1985, a Pública entrevista o historiador [Rodrigo Patto Sá Motta](http://lattes.cnpq.br/5564617043735745), doutor em história pela USP e professor do Departamento de História da UFMG, autor da obra Em guarda contra o perigo vermelho (2002), que aborda o anticomunismo no Brasil entre 1935/37 e 1961/64.\n\nPatto, que também é autor de As universidades e o regime militar, faz duas provocações ao longo da conversa, a primeira: “Se o regime político instaurado em 1964 era popular e tinha apoio majoritário da população, por que diabos necessitou de mecanismos autoritários para se manter no poder?”. E a segunda: “Consideremos por um momento, apenas para construir raciocínio hipotético, que havia séria ameaça comunista e a intervenção militar visava defender a democracia contra o totalitarismo (reitero que considero tais argumentos sem fundamento). Se assim fosse, qual a justificativa, então, para terem instalado uma ditadura e se aboletarem no poder durante duas décadas? Porque não entregaram o poder aos civis depois de derrotada a “ameaça”?”.\n\nA seguir, o historiador explica em detalhes as batalhas de memória e historiográficas em torno do golpe e da ditadura, caso do [vídeo pró-golpe divulgado ontem pelo Planalto](https://web.archive.org/web/20190811072051/https://oglobo.globo.com/brasil/planalto-divulga-video-que-exalta-golpe-militar-de-1964-23563896) em que se descreve o período como um “tempo de medos e ameaças”, em que os “comunistas prendiam e matavam seus compatriotas”.\n\nSegundo Rodrigo, essa batalha vai se intensificar com a ofensiva dos grupos de direita para fazer valer uma “boa memória” sobre 1964, “o que representa não apenas a defesa de um ponto de vista sobre o passado, mas a afirmação de uma imagem positiva com propósito de atribuir legitimidade a um governo comandado por militares no presente”, afirma.\n\nQuando perguntado se vê a democracia em risco, o historiador é assertivo. “A democracia está em risco desde o impeachment de 2016, que foi uma manobra política sem fundamento legal”.\n\n#Como historiador o senhor avalia que ao negar o golpe o presidente Jair Bolsonaro tenta reinventar uma versão da história já refutada pela historiografia com provas documentais e testemunhais?\n\nJá havia um investimento em recuperar as comemorações de 1964 em sentido positivo. Vale a pena lembrar que em novembro passado o então comandante do Exército, general Eduardo Villas Bôas, escreveu no Twitter que era preciso recuperar “[a intentona comunista ocorrida há 83 anos](https://archive.is/1zjlW)”, sinalizando a retomada dos discursos tradicionais de que os militares salvaram o Brasil do comunismo. Grupos dentro e fora do governo vêm investindo nisso, inclusive com estratégias para alcançar público mais amplo por meio de recursos audiovisuais. As batalhas de memória e historiográficas em torno do golpe e da ditadura vão se intensificar com a ofensiva dos grupos de direita para tentar prevalecer sua “boa memória” sobre 1964, o que representa não apenas a defesa de um ponto de vista sobre o passado, mas a afirmação de uma imagem positiva com propósito de atribuir legitimidade a um governo comandado por militares no presente.\n\nPortanto, a visão de Bolsonaro não é pessoal, ela representa a opinião média dos defensores da intervenção militar em 1964 e da ditadura. Nada surpreendente a iniciativa dele, pois manifestou tais ideias inúmeras vezes ao longo de sua carreira política, com destaque para a declaração de voto no impeachment de 2016. Ainda assim é chocante e condenável vindo de presidente que chegou ao poder pelo voto. Embora a média dos militares concorde com a visão positiva sobre 1964, a iniciativa de Bolsonaro causou certo desconforto em alguns setores, que acharam o momento inconveniente para estimular a celebração, devido à perda de popularidade e as graves dificuldades de relacionamento com o Congresso. Excelente que setores do judiciário tenham reagido e demandado respeito à democracia e à Constituição, assim como a reação de setores políticos e sociais. É importante mostrar que há forças no Brasil contrárias à ditadura, especialmente para mostrar aos interessados em novo golpe que haveria reação.\n\n#Em nota enviada sobre as “comemorações” do 31 de março, o general Azevedo, ministro da Defesa, e os comandantes das Forças Armadas, destacam que a intervenção militar ocorreu com o apoio da população e citam a Marcha com Deus e a Família. O senhor considera que de fato o golpe foi apoiado pela população? Até que ponto a Marcha pode ser vista como representativa do conjunto da sociedade?\n\nO tema tem sido muito discutido na historiografia e não há dúvida que o golpe teve forte apoio de alguns grupos sociais, especialmente nas classes médias e superiores (o público principal das Marchas). Não é por coincidência que entre os mesmos grupos encontram-se os maiores entusiastas do impeachment de 2016 e as pessoas mais sensíveis aos discursos anticomunistas-antipetistas de hoje. Porém, é preciso deixar claro que o governo João Goulart também tinha muito apoio popular. É difícil dizer com os dados disponíveis quem tinha mais apoio às vésperas do golpe, pois ocorreu forte polarização política. Além disso, importa lembrar que a grande imprensa e outras instituições fizeram forte barragem discursiva em favor da queda de Goulart, em que mobilizaram à exaustão o tema do perigo vermelho para incrementar o clima de pânico. O certo é que ao sair dos quartéis as Forças Armadas desequilibraram a situação e promoveram a derrubada de Goulart, por isso seu papel foi essencial no golpe.\n\nDe qualquer modo, o apoio de certos segmentos da sociedade não altera o fato de que 1964 foi um golpe nas instituições e um ato autoritário. Ele apenas realça que os militares não agiram sozinhos. Por outro lado, nem todos que apoiaram a queda de Goulart desejavam uma ditadura na sequência. Foram ludibriados. Significativamente, algum tempo depois do golpe a ditadura sofria problemas sérios por perda de popularidade. Muitos dos que bateram palmas em 1964, em 1968 clamavam contra o autoritarismo nas ruas. Portanto, o apoio à ditadura variou muito ao longo do tempo, embora os instrumentos para medir isso sejam precários (as eleições eram controladas, candidatos podiam ser presos ou cassados às vésperas do pleito, uma parte do eleitorado boicotava por não acreditar no processo; a propaganda eleitoral era cerceada).\n\nVou propor uma questão que ajuda a pensar criticamente o tema do apoio social ao regime autoritário; ao mesmo tempo, a pergunta pode ser esclarecedora quanto à existência de ditadura, que alguns insistem em negar. Se o regime político instaurado em 1964 era popular e tinha apoio majoritário da população, por que diabos necessitou de mecanismos autoritários para se manter no poder? Ora, a ditadura foi instaurada exatamente para impor à população determinados governantes, que não teriam respaldo caso ocorressem eleições livres.\n\nO argumento mais forte dos que negam a ditadura é que ela manteve eleições regulares para vereadores, deputados, senadores e prefeitos de algumas cidades. No entanto, como já disse, a dinâmica eleitoral era precária, pois havia constantes intervenções autoritárias, prisões, cassações; e as pessoas não podiam votar para os cargos principais, presidente, governador, prefeito da capital. O jogo eleitoral da ditadura só funcionava enquanto ela fosse a dona da bola. Nos momentos em que corria o risco de perder o controle da situação, o governo respondeu com intervenções autoritárias, como nos casos do AI-2 e do AI-5. Em suma, tratou-se de uma ditadura porque os militares e seus aliados civis controlavam firmemente o poder e não permitiam à oposição chances reais de virar o jogo.\n\n#Estamos completando 55 anos do golpe militar. O golpe de 1964 pode ser definido mais como um movimento anti-reformista ou está mais para um movimento anti-comunista/esquerdista? Como você avalia o início desse processo a partir das suas pesquisas?\n\nA tradição anticomunista tem servido para expressar o medo de alguns grupos sociais com relação a processos de transformação social e cultural, ou seja, ela serve para consolidar e expressar sentimentos conservadores em relação a valores morais e religiosos e às hierarquias sociais tradicionais. Em outras palavras, o perigo vermelho expressa temores que ultrapassam os objetivos e a força real dos comunistas, servindo para expressar o medo de que as classes populares e os setores excluídos (negros) ascendam socialmente e com isso questionem as hierarquias.\n\nAlém disso, o “comunismo” é representado como foco originador de mudanças de comportamento moral e religioso, ou seja, a sua imagem é manipulada de modo a servir de fonte para “males” de todo tipo. É certo que os comunistas históricos defendiam a revolução para estabelecer igualdade social e questionavam os valores morais religiosos, no entanto, isso não significa que todo projeto de mudança social e comportamental seja comunista. Existe uma estratégia discursiva de generalizar o rótulo comunista para aumentar a gravidade ou a sensação de perigo em relação a certas mudanças sociais que incomodam a opinião conservadora. E essa sensação de medo e insegurança pode estimular muitas pessoas a aceitarem intervenções autoritárias.\n\nOs discursos centrais que sustentaram a intervenção militar em 1964 foram calcados no anticomunismo, essa foi a linguagem dominante do golpe. Porém, o alvo era a esquerda de uma maneira geral, bem como as lideranças sociais que demandavam reformas. O uso do anticomunismo, tal como hoje, devia-se à força de uma tradição que já demonstrara grande potencial de mobilização (como em 1935-37 e 1946-48). Então, era mais conveniente fazer campanha contra os comunistas e os “vermelhos” do que dizer que o governo João Goulart era considerado ameaçador por outras razões, menos “dramáticas”.\n\nOs grupos que apoiaram o golpe de 1964 agiram devido a diferentes motivações, entre elas: insatisfação com a sensação de crise econômica (principalmente inflação), insegurança por causa das mobilizações sociais por reformas, desconforto diante do protagonismo político de grupos populares demandando direitos, desconfianças quanto à capacidade de liderança de Goulart, medo de que ele desejasse ser um ditador ao estilo de Getúlio Vargas, medo da ação dos revolucionários e dos comunistas, discordância quanto ao intervencionismo estatal na economia.\n\nO único ponto que permitia unir esses grupos era a bandeira anticomunista, por isso a centralidade desse tema (aliás, isso explica também porque o anticomunismo voltou a ser usado com força recentemente). A questão das reformas, especialmente a reforma agrária desagradava aos mais conservadores, os fazendeiros sobretudo, mas não era um problema para os militares e para os industriais. O governo norte-americano tampouco era contra algumas reformas. Para estes grupos poderia ser feita uma reforma agrária, mas desde que não fortalecesse os grupos de esquerda. Daí que uma postura de puro antireformismo não iria unificar um arco tão diversificado de forças políticas. Nesse sentido, podemos dizer que o golpe de 1964 foi essencialmente anticomunista, no plano discursivo, enquanto na prática era mais propriamente antiesquerdista.\n\n#O que você diria para os que argumentam que o golpe evitou que o país caminhasse para o comunismo? Afinal, o Brasil estava à beira do comunismo?\n\nO Brasil não estava à beira do comunismo. É correto dizer que muitos atores da época acreditaram existir uma ameaça vermelha, mas, com frequência, não tinham visão clara sobre o significado de comunismo, às vezes confundiam-no vagamente com qualquer proposta de esquerda ou mesmo tentativa de reforma social (semelhante ao que vemos hoje, aliás). No entanto, muitas lideranças sabiam perfeitamente que o comunismo não estava no horizonte, mas manipularam o medo para engrossar a oposição ao governo Goulart.\n\nO cenário possível para o governo Goulart era fazer as reformas sociais prometidas, especialmente a agrária e a política. Isso poderia levar ao fortalecimento da esquerda, mas era muito improvável que a rota terminasse no comunismo. Goulart, obviamente, não concordaria com qualquer forma de socialismo, já que era grande proprietário, e o mesmo pode ser dito das principais forças políticas que o apoiavam, entre as quais os comunistas eram francamente minoritários. Goulart fez alianças com os comunistas, mas havia desconfiança mútuas e ele não entregou-lhes posições de poder relevantes. Além disso, pesquisas de opinião indicavam que os comunistas tinha escasso apoio popular – e que ao contrário, o anticomunismo, era bastante forte e enraizado –, de modo que é difícil imaginar como eles ganhariam sustentação para conquistar o poder. Enfim, o país não estava à beira do comunismo. O golpe não derrubou um governo que preparava transição para o comunismo, ou para qualquer forma de socialismo, e sim um governo moderadamente reformista.\n\nGostaria de esclarecer um ponto importante: dizer que na época muitas pessoas acreditavam na ameaça vermelha é uma coisa. É um argumento de análise relevante para compreender decisões tomadas por alguns líderes e a recepção social que tiveram. Entretanto, algo bem diferente é continuar pensando assim hoje, diante do que sabemos sobre a história. Depois do golpe, e das devassas que ele fez, muitos líderes golpistas disseram que havia exagero nas avaliações anteriores, ou seja, o perigo comunista havia sido insuflado. Não é sem motivo que a ditadura passou logo a investir no tema da caça aos corruptos, pois os alvos “comunistas” não sustentavam por muito tempo a campanha de autolegitimação do novo regime.\n\nGostaria de fazer um comentário provocativo, pensando no diálogo com quem aceita a versão favorável ao golpe. Consideremos por um momento, apenas para construir raciocínio hipotético, que havia séria ameaça comunista e a intervenção militar visava defender a democracia contra o totalitarismo (reitero que considero tais argumentos sem fundamento). Se assim fosse, qual a justificativa, então, para terem instalado uma ditadura e se aboletarem no poder durante duas décadas? Porque não entregaram o poder aos civis depois de derrotada a “ameaça”? Não vale dizer que era para continuar defendendo o Brasil do comunismo, porque os poucos comunistas existentes estavam presos, exilados ou escondidos. Mas, alguém poderia perguntar: e a luta armada do fim dos anos 1960? Não era necessária uma ditadura para responder a esse desafio? Em primeiro lugar, as ações armadas em grande medida foram uma resposta da esquerda derrotada em 1964 ao poder da ditadura. Quer dizer, a derrubada de Goulart e a construção de uma ditadura de direita estimularam a radicalização da esquerda. Em segundo lugar, nem todos os guerrilheiros eram comunistas, muitos eram na verdade nacionalistas radicais. Terceiro, e mais importante. Não era necessário uma ditadura e toda aquela violência extralegal (tortura, assassinatos, desaparecimentos) para derrotar a luta armada. Outros países enfrentaram situações semelhantes sem descambarem para a ditadura. Como disse há alguns anos um militar que conhecia o assunto, eles construíram um martelo pilão para matar uma mosca.\n\n#Em um de seus livros você avalia que o Brasil viveu três grandes ondas anticomunistas. E numa entrevista ao Estadão argumenta que pode ser que estejamos testemunhando a quarta onda. Poderia explicar a conjuntura que levou e quem faz parte dessa quarta onda anticomunista? Por que isso está acontecendo agora?\n\nPrimeiro gostaria de fazer uma defesa do uso da metáfora da onda. A rapidez como a influência direitista cresceu entre 2013 e 2016 é compatível com a imagem de onda, de maneira semelhante a 1935-37 e 1961-64. Mas isso não significa que a onda surgiu do nada. A metáfora sugere uma situação em que há marolas relativamente calmas (os militantes dos grupos de direita que estão sempre presentes, embora invariavelmente minoritários), ou seja, o mar está sempre em movimento, porém, a certa altura surge uma confluência de fatores a provocarem crises e tempestades.\n\nSão muitos os elementos que ajudam a entender essa onda ou guinada anticomunista. Um dos pontos é a reação aos governos de centro-esquerda que comandaram o país durante aproximadamente 13 anos, durante esse período colecionando inimigos e detratores. Os grupos que partilham a sensibilidade conservadora jamais aceitaram inteiramente os governos petistas, alguns deles apenas os toleraram nos momentos favoráveis, especialmente quando a economia crescia a elevadas taxas. Quando a crise econômica se instalou em 2014 as razões para tolerância desapareceram, aumentando o mal humor de muitas pessoas em relação ao governo. Há que mencionar também o impacto das acusações de corrupção contra os governos petistas, sobretudo os casos produzidos pela Lava Jato, que tiveram notável incidência entre a opinião mais à direita do espectro político.\n\nPortanto, o crescimento da direita foi uma resposta aos governos petistas. Eles não foram radicais e tampouco seguiram uma pauta socialista, porém, algumas de suas políticas afrontaram valores da direita conservadora e da liberal, como o aumento do intervencionismo estatal, a implantação de bolsas e cotas sociais, os programas visando a igualdade de gênero e racial, bem como as políticas em defesa das minorias sexuais. Um aspecto importante aqui é a reação dos setores religiosos contra a pauta de mudanças no campo dos valores e da moral, que afetou setores integristas católicos, mas, principalmente os grupos evangélicos, que são bem representados no sistema político. Daí o discurso de defesa da família tradicional e da religião contra o “comunismo”.\n\nOutro tema fundamental: as ações governamentais no campo da justiça de transição referida à ditadura, por moderadas que fossem, provocaram o descontentamento de segmentos militares que igualmente se embandeiraram em torno das palavras de ordem antiesquerdista. Alie-se a isso o incômodo provocado à direita pela orientação diplomática dos governos petistas, moderadamente distantes dos EUA e tendendo à busca de novos parceiros e ao fortalecimento do multilateralismo, ao lado do temor que a simpatia pelo regime chavista poderia trazer implicações internas ao Brasil. Mais um aspecto importante, que afetou a largos setores sociais foi o impacto da criminalidade comum, ou seja, o medo em relação à insegurança pública. Discursos direitistas acusaram os governos de esquerda de conivência com os criminosos comuns e convenceram alguns grupos sociais de que somente o aumento do autoritarismo estatal traria resposta à insegurança do dia a dia.\n\nEnfim, no período entre 2013-2015 surgiram condições propícias ao crescimento da opinião de direita, o que catapultou ao poder gurus, líderes e pequenos grupos de militantes que desde os anos 1990 vinham labutando por um (re)despertar conservador e/ou liberal no Brasil, o que àquela altura parecia improvável. A insistência desses grupos em utilizar o discurso anticomunista é tanto fruto de convicção como de oportunismo, por razões que penso ter já esclarecido.\n\n#Não é incomum ver declarações que dizem que a história tem sido contada com matiz ideológico socialista. O presidente já falou a respeito, o próprio filho do presidente, Eduardo Bolsonaro, publicou mensagens em que afirma que a ditadura militar é mal retratada pelos livros didáticos. “Um povo sem memória é um povo sem cultura, fraco. Se continuarmos no nosso marasmo os livros escolares seguirão botando assassinos como heróis e militares como facínoras.” Também o general da reserva Aléssio Ribeiro Souto também já declarou que “Os livros de história que não tragam a verdade sobre 64 precisam ser eliminados”. Estamos passando por uma tentativa de revisionismo? Em que medida o revisionismo se torna perigoso para o registro dos acontecimentos históricos?\n\nEle é perigoso quando tem intencionalidade política, como no presente caso. Mostrar uma ditadura positiva para o Brasil e esconder o autoritarismo e a violência que ela significou pode passar à população a imagem de que não seria problema termos outra ditadura.\n\nRevisar o conhecimento e questionar o saber já estabelecido é um movimento positivo, que faz parte do progresso de qualquer forma de ciência ou saber acadêmico. O problema é quando isso se faz sem consistência metodológica, sem evidências, sem provas, com base apenas na paixão política. Critica-se a influência de ideologias de esquerda sobre o conhecimento produzido, mas a resposta traz uma “ideologização” à direita muito mais intensa.\n\nNão é que exista conhecimento puramente objetivo, ou seja, sem qualquer influência do fator subjetivo (as opiniões do autor do conhecimento). Mas a meta do conhecimento acadêmico é lidar com o subjetivismo de maneira produtiva, evitando que leve a distorções ou, o que acontece em alguns casos, a falsificações. Uma das estratégias para enfrentar esses dilemas é o diálogo intersubjetivo, ou seja, o debate com as diferentes visões ou argumentos sobre determinado tema, o que significa levá-los a sério. É o que tento fazer.\n\n#O “perigo vermelho” é utilizado como argumento de convencimento da opinião pública em diferentes momentos históricos. Houve um tempo em que Cuba, China e União Soviética eram o modelo a ser negado e combatido. Mais recentemente, a Venezuela. São argumentos que voltam à baila com frequência, seja em momentos eleitorais ou processos de crise política. Como a história pode dar conta dessas comparações e percepções calcadas em realidades pouco concretas? Além disso, até que ponto a história falhou – se é que falhou – em educar a população para um conhecimento histórico mais robusto sobre o que aconteceu com o Brasil nesses períodos? A Lei da Anistia do jeito que foi configurada influenciou a forma como a mensagem chega ao povo?\n\nO tema da ameaça estrangeira é parte essencial da tradição anticomunista. E outros discursos políticos (inclusive de esquerda) batem na mesma tecla. Os imaginários que mobilizam o medo são tentados a explorar o tema do estrangeiro ameaçador (imigrantes, espiões, governos estrangeiros), pois isso toca sentimentos profundos, baseados na ansiedade em relação ao diferente, ao outro, e essa operação gera bons resultados políticos. Diga-se que normalmente são entes concretos, como a URSS, que de fato criou um modelo social radicalmente diferente, no entanto, são fantasiosos muitos dos discursos políticos construídos a partir disso. No caso da Venezuela, por exemplo, como acreditar que o bolivarianismo representa uma ameaça ao Brasil, tanto mais quando Lula e Dilma respeitaram rigorosamente a Constituição e jamais propuseram mudanças no nosso sistema político?\n\nSobre o ensino, é importante não exagerar o impacto do sistema escolar, porque a escola não tem tanto poder. Creio que são exageradas as críticas ao sistema escolar e aos professores de história, responsabilizados pela ignorância de largos setores da sociedade sobre temas básicos como nazismo, ditadura etc. A história e o gosto por ela não se aprendem apenas na escola, mas também em outras instituições culturais, a mídia e a própria família. Ou seja, a cultura histórica e a consciência histórica de uma determinada sociedade não são formadas apenas pela história acadêmica, embora ela tenha o papel mais importante no processo. Se há um fracasso é de todos nós, historiadores, professores, jornalistas, governantes, líderes políticos etc.\n\nFeita a ressalva, acho que o ensino da história da ditadura deve ser repensado, assim como o papel das universidades e das lideranças acadêmicas. Há que refletir sobre algumas possibilidades, como uma maior ênfase no ensino escolar da história recente, sem descuidar das outras áreas, porém, de olho na luta pela democracia. Não se trata de ensinar as crianças a seguirem tal ou qual cartilha, mas a analisarem a nossa experiência histórica coletiva em tom crítico, estimulando-as a fazerem escolhas conscientes e orientadas por suas convicções e interesses. Mesmo assim, alguns valores deveriam fazer parte dessa pauta, como direitos humanos, democracia e pluralismo. Importante também que mais historiadores se dêem conta da importância de cuidar da divulgação pública do conhecimento, com mais atenção ao papel das diferentes mídias.\n\nSobre o tema da lei de Anistia, para responder à questão proponho pensar o impacto da transição para saída da ditadura de maneira mais ampla. Como é sabido, no Brasil o fim da ditadura foi marcado por negociações. Embora as oposições tenham lutado e resistido, em essência o grupo dominante negociou uma saída suave do poder, que passava pela anistia dos presos políticos, mas, principalmente, pela expectativa de que os crimes da ditadura seriam esquecidos. Que fique claro, não se tratou de negociação simétrica (pois a ditadura mantinha o poder e a força das armas) nem consensual. Uma parte da oposição não gostou do esquema e tentou outra saída, mas prevaleceu o arranjo entre segmentos da ditadura e partes da oposição, que realizaram uma grande acomodação de interesses, em nome da estabilidade e para evitar rupturas mais radicais (que colocassem em risco tais interesses), algo tradicional no Brasil.\n\nEssa acomodação implicou também ações para apaziguar a memória sobre a ditadura, na verdade, tentou-se esquecer a ditadura. Por isso, os governos pós-autoritários nada fizeram para educar a população sobre o período anterior e a importância da conquista da democracia. A situação mudou a partir do governo Lula, ainda assim, de maneira tímida. É significativo que a Comissão da Verdade surgiu apenas 30 anos depois da ditadura. Enfim, a nossa transição democrática foi capenga e não enfrentou devidamente o legado da ditadura. Estamos pagando o preço agora.\n\n#O senhor vê a democracia em risco? Como tem analisado os primeiros meses do governo do presidente Jair Bolsonaro e a atuação da ala militar do governo?\n\nA democracia está em risco desde o impeachment de 2016, que foi uma manobra política sem fundamento legal. Seguiu-se formalmente o rito constitucional, mas o processo não tinha substância, pois não se conseguiu provar que a presidente afastada cometeu crime de responsabilidade. As instituições aceitaram uma série de manipulações, inclusive do sistema legal, para criar condições políticas para o afastamento de Dilma. A partir daí abriu-se caminho para o desrespeito em série de normas institucionais, assim como se fortaleceram no debate público grupos autoritários que defendem a afirmação de suas ideias por qualquer meio. A eleição de Bolsonaro aumentou os temores, não apenas por seu perfil, mas por se apoiar nas Forças Armadas. Desde o princípio estamos sob o risco de intervenção autoritária, seja porque o presidente não demonstra intenção real de governar respeitando o Congresso, seja porque os militares poderiam impor um regime autoritário em caso de fracasso do governo Bolsonaro. Há quem imagine mesmo que o objetivo é sabotar as relações com o Congresso, aumentar a tensão política e social e, com isso, abrir caminho para um golpe clássico.\n\nMas há obstáculos no caminho de uma saída golpista. Alguns líderes do Congresso estão reagindo ao governo, este perde popularidade rapidamente (o que seria uma das fontes para sustentar um ditadura), o ambiente internacional não é favorável a ditaduras (veja-se a postura recente de Piñera no Chile, que é de direita mas criticou a ditadura), hoje seria mais difícil estabilizar um regime autoritário (como censurar ideias e comportamentos da juventude conectada ao mundo virtual?) e os militares não mostram sinais claros de que topariam a aventura.\n\nO fator militar voltou a ser decisivo na nossa vida política, infelizmente. Esperemos que as lideranças militares não aceitem o caminho da aventura golpista e sejam mais perspicazes politicamente que outros setores do governo. Se não por amor à democracia, ao menos por cálculo estratégico, pois uma nova ditadura poderia comprometer seriamente o futuro da corporação militar. Esperemos também que as lideranças sociais e políticas mostrem com clareza que os apoiadores de ditaduras são minoritários.\n\n- Fonte: https://apublica.org/2019/04/1964-o-brasil-nao-estava-a-beira-do-comunismo-diz-historiador/",
			"added": 1595799690
		},
		{
			"topic_id": 2,
			"title": "Coreia do Norte",
			"body": "[Coreia do Norte](https://everipedia.org/wiki/lang_en/North_Korea), oficialmente República Popular Democrática da Coreia, é um país no leste da Ásia que constitui a parte norte da península coreana, com Pyongyang como capital e maior cidade do país.\n\n#Sim, eu apoio a Coreia do Norte! Notas sobre anticolonialismo, imperialismo e hegemonia\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:4_12rxQAQ1ME8vP56oHQTXmnp4XRJgmwv4Vd/Sim+eu+apoio+a+Coreia+do+Norte+Notas+sobre+anticolonialismo+imperialismo+e+hegemonia\n\n#A Revolução Coreana: o Desconhecido Socialismo Zuche\nPaulo Fagundes Visentini , Analúcia Danilevicz Pereira , Helena Hoppen Melchionna\n- https://gateway.pinata.cloud/ipfs/QmTLHfdSqXzdiUZrcZ67tY9A3rjZ7ekX6SzHEiJTS7Sk4P\n\nA Coreia do Norte é comumente retratada no Ocidente de forma caricatural. Difunde-se a imagem de um regime fechado, à beira do colapso, irracional, que oprime um povo faminto enquanto investe fortunas em um projeto nuclear megalomaníaco. Perdem-se, nessas representações caricatas e eivadas de objetivos políticos, tanto o contato com a real configuração do regime norte-coreano, de impressionantes conquistas socioeconômicas, quanto as complexidades que caracterizaram todo o processo revolucionário e continuam a tensionar o sudeste asiático.",
			"added": 1595947860
		},
		{
			"topic_id": 3,
			"title": "Curso de Inglês Mairo Vergara 5.0",
			"body": "O Curso de Inglês [Mairo Vergara](https://invidio.us/channel/UCDyjlawtWnY7j1C2RyObZlg) é um programa completo de estudos de inglês 100% online, que tem como objetivo levar o aluno do zero até a fluência no inglês. É importante mencionar que o termo “fluência” possui conceitos distintos, cada pessoa pode ter uma definição diferente do que é ser fluente em um idioma.\n\nDentro da nossa metodologia, fluência em inglês é você ser capaz de fazer duas coisas:\n\na) Entender o idioma falado tranquilamente, ou seja, conseguir assistir a filmes e seriados em inglês sem legendas, assistir a vídeos no YouTube, escutar programas de rádio totalmente em inglês ou mesmo entender tranquilamente uma conversa entre dois falantes nativos. Veja que aqui não estamos falando de “entender pelo contexto”, mas sim de realmente entender muito bem o idioma.\n\nb) Ser capaz de se comunicar bem em inglês, falando de forma fluída sobre praticamente qualquer assunto. Isso não quer dizer falar perfeitamente ou igual um nativo, mas sim que você consegue expressar as suas ideias com clareza e um falante nativo não precisará se esforçar e não terá dificuldades para te entender.\n\nEm outras palavras, a fluência no idioma é a combinação de um ótimo entendimento do idioma falado e uma boa capacidade de comunicação.\n\n#Arquivos\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_01-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_02-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_03-53\n\n#Vídeos\n\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_04-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_05-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_06-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_07-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_08-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_09-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_10-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_11-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_12-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_13-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_14-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_15-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_16-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_17-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_18-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_19-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_20-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_21-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_22-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_23-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_24-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_25-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_26-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_27-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_28-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_29-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_30-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_31-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_32-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_33-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_34-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_35-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_36-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_37-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_38-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_39-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_40-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_41-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_42-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_43-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_44-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_45-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_46-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_47-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_48-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_49-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_50-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_51-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_52-53\nhttps://lbry.tv/Curso_Ingles_Mairo_Vergara_5_0_53-53",
			"added": 1596298017
		}
	],
	"topic_vote": {
		"2_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"3_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1
	},
	"next_comment_id": 108,
	"comment": {
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 1,
				"body": "#Criptografando arquivos com AESCrypt\n\nO [AESCrypt](https://github.com/paulej/AESCrypt.git) é um utilitário livre e de código aberto que permite criptografar arquivos individuais no Linux. Às vezes queremos apenas encriptar um ou alguns arquivos, e não um diretório ou partição inteiros – e para isso esse utilitário é uma solução perfeita. Ele também está disponível em versões para Windows,  Mac OS X, Android e iOS, além de possuir pacotes para Java e C#.\n\nComo o próprio nome do pacote nos remete, é empregado o padrão de criptografia [AES (Advanced Encryption Standard)](https://en.wikipedia.org/wiki/Advanced_Encryption_Standard), com algoritmo de criptografia de 256 bits, que é extremamente seguro.\n\nVamos mostrar neste tutorial como instalar e utilizar o programa no [Ubuntu Linux](https://ubuntu.com/), realizando sua instalação a partir de um repositório ppa. Caso você prefira baixar o pacote do site oficial (se você estiver utilizando outra distribuição Linux), poderá obtê-lo em https://www.aescrypt.com/download/, que é o site oficial do pacote.\n\n#Instalação\n\nPara instalar o AESCrypt execute os seguintes comandos em um terminal:\n\n- sudo add-apt-repository ppa:aasche/aescrypt\n- sudo apt-get update\n- sudo apt-get install aescrypt\n\n#Criptografando e decriptando arquivos via terminal\n\nVamos criptografar um arquivo usando a linha de comandos. A sintaxe a utilizar é a seguinte (opção -e):\n\n- sudo aescrypt -e -p <password> <original file>\n\nSuponha que eu queira encriptar um arquivo de nome “memorandos” usando a senha “a1b2c3”. Para isso, utilize o comando a seguir (entre no diretório do arquivo antes ou forneça seu caminho completo):\n\n- sudo aescrypt -e -p a1b2c3 memorandos\n\nSerá gerado o arquivo memorandos.aes, que possui o conteúdo do arquivo original, porém criptografado. Você pode excluir o arquivo original agora, e manter apenas o arquivo encriptado.\n\nPara decriptar um arquivo, a sintaxe é a que segue (opção -d):\n\n- sudo aescrypt -d -p <password> <AES file>\n\nEm nosso exemplo:\n\n- sudo aescrypt -d memorandos.aes\n\nSerá requisitada a senha. Digite-a e pressione enter para que o arquivo original, decriptado, seja recriado.\n\n#Criptografando e decriptando arquivos via interface gráfica\n\nPara criptografar um arquivo por meio da interface gráfica, abra seu gerenciador de arquivos, localize o arquivo a ser criptografado, e clique sobre ele com o botão direito do mouse. Escolha a opção “Abrir com -> AESCrypt“: https://ipfs.infura.io/ipfs/QmcrL3PB3NfkrwMB13BBu5qE3hXqioNUZAuhi8TnMXvbPT\n\nEntre com a senha desejada na caixa de diálogo “Type your password” e clique no botão OK: https://ipfs.infura.io/ipfs/QmZ17FvyNZCJWqyVuNbvyrVo5oSXgCCRNJK3mgz64wuKZE\n\nSerá requisitada a senha novamente, para confirmação. Redigite-a, e clique novamente no botão OK.\n\nO arquivo criptografado será criado na pasta atual, com a extensão .aes. Você pode excluir o arquivo original e manter apenas o protegido por criptografia se quiser.\n\nPara descriptografar o arquivo, basta clicar sobre ele com o botão direito do mouse, e escolher a opção “Abrir com AESCrypt“. Será requisitada a senha de criptografia. Digite-a, clique em OK, e você terá o arquivo decriptado de volta: https://ipfs.infura.io/ipfs/QmXcSkCb5iAoDbSJZkxQ6cLeq9Ai6oVn4VyWXyHuYobPWd\n\n- Fonte: http://www.bosontreinamentos.com.br/linux-ubuntu/como-criptografar-arquivos-com-aescrypt-no-linux/",
				"added": 1595789907
			}
		],
		"1_1KimmPbPEBFZ1qHsRoz4W1GiBtCGnisy5B": [
			{
				"comment_id": 2,
				"body": "> [cellnova](#comment_1_1KimmPbPEBFZ1qHsRoz4W1GiBtCGnisy5B): Se puder dar pin no arquivo me ajudaria muito\n\nhttps://pinata.cloud/",
				"added": 1595790645
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 3,
				"body": "#1964: “O Brasil não estava à beira do comunismo”, diz historiador\nhttp://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ/1964+O+Brasil+n+o+estava+beira+do+comunismo+diz+historiador",
				"added": 1595799774
			},
			{
				"comment_id": 20,
				"body": "#Documentário de desertores da Coreia do Norte - \"Os Cidadãos Leais de Pyongyang em Seul\" (legendado)\n- https://siasky.net/AADwWYlPgPG5mBYQgn7odhkF5W9GkAF2mQYyz498tziy0Q\n\nDocumentário sul-coreano sobre cidadãos da Coreia do Norte que foram para a Coreia do Sul e contam suas experiências de vida tanto nos dois regimes, em uma versão um pouco diferente do que estamos acostumados a ouvir.\n\nLegendado por Bruno Lino e cedido gentilmente ao [Centro de Estudos da Política Songun do Brasil](https://cepsongunbr.com/).",
				"added": 1595905234
			},
			{
				"comment_id": 23,
				"body": "#Quem dividiu a Coreia em duas? A Coreia é uma só!\n\n- https://siasky.net/AABPJzlKJpdfjDaL3ghi4nYMwAbIe3gwMfqRc-FhGiNLZA\n\nEntenda como os Estados Unidos dividiram em duas partes a nação coreana com uma história unida de 5 milênios, causando inúmeras dores e desgraças para o povo da Coreia.\n\nVídeo publicado pelo [CENTRO DE ESTUDOS DA POLÍTICA SONGUN](https://cepsongunbr.com/) - RIO DE JANEIRO - BRASIL.",
				"added": 1595905685
			},
			{
				"comment_id": 55,
				"body": "#Lava Jato, A Destruição da Economia Brasileira\n- https://open.lbry.com/Lava-Jato-A-Destruição-da-Economia-Brasileira:2\n\nNesse documentário vocês vão ver como o Brasil foi sabotado por intermédio da [operação Lava Jato](https://pt.wikipedia.org/wiki/Opera%C3%A7%C3%A3o_Lava_Jato), assim como perceber o papel da mídia que discerniu nas suas reportagens e páginas de diversos jornais o estrondoso crescimento do país no período anterior ao início da operação, mas que após a colocação em prática da mesma operação, passou a atuar juntamente com interesses externos para colocar o país em desequilíbrio econômico.\n\n- Fonte: https://web.archive.org/web/20200721144024/https://verlereconhecer.blogspot.com/2016/11/destruicao-jato-documentario-2016.html",
				"added": 1595984822
			},
			{
				"comment_id": 61,
				"body": "#Revolução Africana: Uma Antologia do Pensamento Marxista\nJones Manoel, Gabriel Landi Fazzio\n\n- https://ipfs.infura.io/ipfs/QmSTfPy5Vj3basuuakeh2vzMTbqDyqrvQHvas3zMnkgpvo\n\nAtravessando três décadas de luta revolucionária na África, os artigos desta antologia permitem uma visão não apenas de diversas experiências políticas, mas de toda a riqueza e variedade do pensamento marxista africano – apresentado pelos textos e discursos de seus representantes mais radicais. Entre os autores estão Frantz Fanon, Kwame Nkrumah, Amílcar Cabral, Eduardo Mondlane, Samora Machel, Agostinho Neto, Thomas Sankara e Samir Amin. Os textos abordam temas como o racismo na sociedade de classes, a mentalidade colonial, a idealização do passado africano e a opressão patriarcal no continente, além de questões de tática e organização política; essa antologia oferece ao público algumas perspectivas teóricas que dizem respeito não apenas à Revolução Africana, mas também à própria luta contra o racismo no Brasil capitalista de nossos tempos.",
				"added": 1596132205
			},
			{
				"comment_id": 92,
				"body": "#O que é Fascismo? História, definição e sobrevivência no presente\n- https://siasky.net/AACdjHd3pGX69uCXCe_j_JFazh8MqoO2F3tXHgQQHcro4Q\n\n\"Surgido no início do século XX mas com raízes no século XIX, o Fascismo foi um fenômeno político responsável por políticas de exclusão, violência e extermínio. No entanto, seus adeptos nunca deixaram de existir, e com a ascensão de movimentos de extrema-direita pelo mundo, as discussões sobre o assunto voltaram à tona com força total. Mas afinal, o que significa fascismo? Quais as características que o definem? Convidamos o Prof. Odilon Caldeira Neto (UFJF) para conversar sobre isso e muito mais.\"\n\n#LEITURAS RECOMENDADAS:\nOdilon C. Neto & Leandro P. Gonçalves – O fascismo em camisas verdes\nRobert Paxton – [Anatomia do Fascismo](https://ipfs.infura.io/ipfs/QmaBCKtFTGFnwP55f2QpXoeN4EyrBzqrdgoa9KrDy61M88)\nJason Stanley – [Como funciona o fascismo](https://ipfs.infura.io/ipfs/QmYyjzEHy6VZTDQpXJ4XSyh2Zbuiy9VY6W8vxpTekap8D9)",
				"added": 1596478577
			},
			{
				"comment_id": 93,
				"body": "#Sobre o fascismo hoje: https://siasky.net/CADo8YX9i0VXRet3xm6y7wT6tAFGVQbU7a8XHkOW1_-a5A",
				"added": 1596478597
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 4,
				"body": "#1964: “O Brasil não estava à beira do comunismo”, diz historiador\nhttp://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ/1964+O+Brasil+n+o+estava+beira+do+comunismo+diz+historiador",
				"added": 1595799936
			},
			{
				"comment_id": 5,
				"body": "#Como EUA fabricaram o “marxismo cultural”\n\n- No Documento de Santa Fé, de 1988, novo intervencionismo dos EUA: infiltrar-se em instituições latino-americanas, alegando combater subversão. Coopta parte do Exército, Judiciário e das elites — receituário que retorna com Bolsonaro\n\nÉ real o risco da radicalização da direita, no sentido de um golpe de estado para a implantação de uma ditadura militar no estilo tradicional, tipo fechamento do Congresso e do STF, prisões massivas de opositores, empastelamento da imprensa e todo a série de barbáries decorrentes? Essa perspectiva seria de interesse das Forças Armadas Brasileiras (FFAA), do capital internacional, do imperialismo americano e da nossa elite vendida e associada a eles, ou seria apenas o sonho da família 00, 01, 02 e 03?\n\nEm um [texto publicado no ano passado](https://web.archive.org/web/20200407234502/https://outraspalavras.net/descolonizacoes/em-busca-da-funda-de-david/), no qual Maurício Abdalla busca apontar alternativas para a esquerda enfrentar o Golias do autoritarismo com armas adequadas, o autor cita um documento elaborado por quatro especialistas americanos de política externa, ligados ao Departamento de Estado, intitulado [“Documento de Santa Fé – 1988”](https://web.archive.org/web/20200610110943/http://www.elcorreo.eu.org/Documento-de-Santa-Fe-II1988), que define claramente a estratégia para a expansão americana na América Latina na década seguinte. O documento, como estratégia de enfrentar o “estatismo”, ou seja, operar a redução do papel do estado, recomenda o fortalecimento da sociedade civil liberal, a cooptação das elites locais, o convencimento das FFAA e a intensa propaganda, tal como depois se veio a definir como guerra híbrida, apontando para formas de dominação político-ideológicas sem o uso de canhões.\n\nEm outro texto mais recente, Thales Coelho n’[Os Divergentes](https://web.archive.org/web/20200726220146/https://osdivergentes.com.br/outras-palavras/o-tal-poder-moderador-dos-militares-a-volta-dos-que-nao-foram-ii/), sobre o artigo 142 da Constituição de 1988 e o poder moderador, lembra um informe sigiloso sobre “a situação da subversão no Brasil” apresentado na 17ª Conferência dos Exércitos Americanos, realizada em Mar del Plata, na Argentina, em novembro de 1987. Citando:\n\n- na referida conferência militar identificara-se o dedo do “movimento comunista internacional” nos movimentos ecológicos, feministas, estudantis, antirracistas, de defesa dos povos indígenas, de liberdade de orientação sexual e da descriminalização do uso de drogas, ou na teologia da libertação. Para os militares ali reunidos, seria preciso combater o “amerocomunismo”, que não se orientava mais por táticas guerrilheiras revolucionárias ou atos de “terrorismo”, mas pelo que, hoje, conhecemos como, soit disant, “marxismo cultural”, baseado nas ideias de Antonio Gramsci. Segundo o relatório do encontro, “para Gramsci, o método não consistia na conquista ‘revolucionária do poder’, mas em subverter culturalmente a sociedade como passo imediato para alcançar o poder político de forma progressiva, pacífica e perene”. E continuava: “Para este ideólogo, a ideia principal se baseia na utilização do jogo democrático para a instalação do socialismo no poder. Uma vez alcançado esse primeiro objetivo, se busca impor finalmente o comunismo revolucionário. Sua obra está dirigida especialmente aos intelectuais, profissionais e aos que manejam os meios maciços de comunicação social.\n\nChama a atenção a simultaneidade dos dois eventos, Mar del Plata e Santa Fé. Revisitando com um pouco de detalhes o documento resgatado por Mauricio Abdalla, a similaridade do conteúdo fica evidente.\n\nO Documento de Santa Fé – 1988 parte da afirmação de que as Américas estariam sob ataque de uma aliança entre a subversão comunista, o terrorismo e o narcotráfico, vistos do ponto de vista de que os americanos são o xerife do mundo. Expressa o temor de que as políticas americanas para a região, por pouco efetivas, levariam a mais governos pró-soviéticos, mais subversão, mais crimes e narcotráfico, mais imigração de cucarachos para os EUA e, por último, uma probabilidade maior de intervenção militar pelo xerife. Citando uma recomendação exemplar:\n\n“EEUU debe estar preparado para ampliar su programa de asistencia militar a las fuerzas armadas latino-americanas como parte de su reconocimiento de que las insurgencias indígenas son explotadas y agravadas desde el exterior”.\n\nOs conceitos do marxismo cultural, tão em voga atualmente, são aí apresentados, sendo possível reconhecer no texto as raízes do discurso dos gurus da extrema-direita. Numa suposta estratégia gramsciana, os intelectuais marxistas e seus métodos poderiam criar os valores dominantes de uma nação mediante a dominação cultural, em um processo que “requería una fuerte influencia en su religión, escuelas, medios de difusión masiva y universidades. Para los teóricos marxistas, el método más prometedor para crear un régimen estatista en un ambiente democrático era através de la conquista de la cultura de la nación. Conforme a este patrón, los movimientos marxistas en América Latina han sido encabezados por intelectuales y estudiantes y no por trabajadores.” Nesse contexto é que a Teologia da Libertação deveria ser entendida, como uma doutrina política disfarçada de crença religiosa.\n\nO ataque do marxismo cultural não atingiria apenas um ou dois componentes da cultura. Seria eficaz se de forma ampla buscasse redefinir toda a cultura em uma nova terminologia, impulsionado por diferentes teóricos da educação marxista em escolas e universidades e pelo controle estatal sobre a educação através de livros e manuais.\n\nA predominância da esquerda, em grande parte da mídia da América Latina, também deveria ser entendida nesse contexto. Nenhuma eleição democrática poderia modificar a inclinação contínua ao regime estatista, se a “indústria de conscientização” estivesse nas mãos de intelectuais estatistas. A mídia, igrejas e escolas continuariam a desviar formas democráticas para o estatismo, se os EUA e os novos governos democráticos não reconhecessem isso como uma luta do regime.\n\nComo resposta institucional, sempre sob a capa da defesa da democracia, recomenda principalmente que os “Estados Unidos não podem se interessar apenas por processos democráticos formais, mas devem estabelecer programas de apoio à democracia entre a burocracia permanente, incluindo as Forças Armadas e a cultura política.” Neste sentido, devem “fornecer, sempre que possível, os meios para fortalecer as instituições democráticas locais, como sindicatos, grupos empresariais independentes, associações e organizações comerciais; (…) fortalecer sua capacidade de cultivar valores de um regime democrático com as forças armadas da região; (…) devem aumentar o orçamento da USIA (Agência de Informação dos Estados Unidos)”. Indo além, “os Estados Unidos devem ajudar a fortalecer os sistemas judiciais (isto lembra alguém em Curitiba?) na região. Também deve diferenciar grupos de direitos humanos que apoiam o regime democrático e aqueles que apoiam o estatismo.”\n\nFrente a tal risco para os interesses políticos e econômicos dos EUA, o Documento relaciona uma longa série de recomendações institucionais, políticas e econômicas para a política externa americana, que batem exatamente com o desenrolar dos anos 90 até hoje.\n\nEm síntese, a aplicação do receituário de Santa Fé, iniciada em 1990 no Governo Collor com a abertura de mercado e precocemente interrompida, retomada durante os governos FHC com as grandes privatizações e novamente interrompida nos governos petistas, vem se dar de forma integral no desgoverno Bolsonaro, justamente eleito pelos mecanismos já delineados no Documento: participação de Think Tanks, fake news, MBL, Cambridge Analytica e tudo mais exaustivamente conhecido. E, no governo, Reforma da Previdência, Reforma Trabalhista, destruição da educação pública, moralismo, anulação de direitos humanos, privatizações a preço de banana, entrega da Embraer e tecnologia, sucateamento das pesquisas e das universidades etc etc etc.\n\nComo isto foi possível? Quais foram os agentes principais? Quem foram os cúmplices nacionais? Tudo parece indicar que os militares são mesmo parte ativa dessa empreitada sinistra, planejada e executada com rigor desde então.\n\n- Fonte: https://outraspalavras.net/geopoliticaeguerra/como-eua-fabricaram-o-marxismo-cultural/",
				"added": 1595801031
			},
			{
				"comment_id": 8,
				"body": "#UMA HISTÓRIA DA ONDA PROGRESSISTA SUL-AMERICANA\n\n- Livro: https://ipfs.infura.io/ipfs/QmNk6CjpuBrFs8axoGyqLZ4ZHSsHVq1gV74k9oz2mHWj1V\n\n#Descrição\n\nFabio Luis Barbosa dos Santos mergulha na história política da América do Sul para compreender as razões da ascensão e queda dos chamados “governos progressistas”. Na esteira das mobilizações contra as reformas neoliberais dos anos 1990, nove países da região elegeram presidentes identificados com as reivindicações populares. Contudo, menos de vinte anos depois da vitória do primeiro deles, Hugo Chávez, e após golpes de Estado mais ou menos explícitos, essa onda chegaria ao fim, abrindo espaço para o recrudescimento do conservadorismo. O que aconteceu? Talvez o diálogo crítico entre passado e presente proposto neste livro possa oferecer caminhos para o futuro de uma esquerda sul-americana aturdida com a força de macris, uribes, fujimoris, piñeras e bolsonaros depois de um ciclo de crescimento e inclusão social.\n\n==\n\nNa América Latina, de tempos em tempos, somos invadidos pelo sentimento desesperador do eterno retorno do mesmo. A cada tentativa de integração civilizadora, nossas sociedades são tragadas pela voragem do atraso que as mantêm presas à desigualdade, à falta de liberdade e à injustiça. Por quê?\n\nNo intuito de responder a inquietações que retornaram com força depois do desmanche da “onda progressista”, Fabio Luis Barbosa dos Santos procura, a partir de rica pesquisa de campo e de entrevistas, além de amplo domínio da literatura especializada, sintetizar o que ocorreu nas últimas duas décadas.\n\nAo analisar as contradições e os dilemas dos governos progressistas, o autor mostra que, apesar das particularidades de cada país, há características comuns: os presidentes não romperam com o legado macroeconômico das ditaduras; com pequenos piparotes na desigualdade, fortaleceram o capitalismo, deixando de cumprir promessas de integração social substantiva; levados ao poder pela insatisfação do campo popular com as políticas de ajuste neoliberais, canalizaram a revolta para demandas institucionais de pequeno resultado; e, por fim, se aproveitaram da acumulação por espoliação, surfando no consenso das commodities sem atentar para a predação socioambiental daí decorrente.\n\nEm suma, enfraqueceram o campo popular e incrementaram a inserção subordinada e passiva de seus países no mercado mundial, em nome de uma política de esquerda. É fácil entender que a volta da direita ao poder não é um raio em céu azul.\n\nFabio Luis conclui que a derrocada da onda progressista atesta mais uma vez que, dado o caráter antinacional, antipopular, antidemocrático e predatório das classes dominantes no continente, a única alternativa civilizatória para a América Latina é o socialismo. Não por acaso, o último país analisado neste livro é Cuba. Seus dilemas são os dilemas do socialismo hoje.\n\nAo mapear o debate público aberto em 2016 sobre os rumos da revolução, o autor mostra sem preconceitos nem idealizações os problemas enfrentados pela ilha, isolada no oceano do capitalismo global, assim como os limites da Revolução Cubana.\n\nDas reflexões de Fabio resta uma advertência: a alternativa civilizatória para Nossa América, que vá além do canto de sereia do consumo, está num projeto socialista humanista fundado em valores como igualdade, liberdade e participação popular, combinando direitos universais com relações mercantis disciplinadas por um Estado soberano.\n\nMas é sabido que mesmo uma proposta reformista tão modesta continua tabu absoluto para os donos do poder. Só resta concluir com Fabio Luis que, diante da contrarrevolução permanente, reforma é revolução.\n\n— Isabel Loureiro\n\n #SOBRE O AUTOR\n\n[Fabio Luis Barbosa dos Santos](http://lattes.cnpq.br/5107759022294795) é doutor em História Econômica pela Universidade de São Paulo (USP), professor do curso de Relações Internacionais da Universidade Federal de São Paulo (Unifesp) e autor dos livros Além do PT: a crise da esquerda brasileira em perspectiva latino-americana (Elefante, 2016) e Origens do pensamento e da política radical na América Latina (Unicamp, 2016). É também um dos organizadores de Cuba no século XXI: dilemas da revolução (Elefante, 2017).",
				"added": 1595825424
			},
			{
				"comment_id": 13,
				"body": "> [otp](#comment_8_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ): UMA HISTÓRIA DA ONDA PROGRESSISTA SUL-AMERICANA\n> \n> Livro: https://ipfs.infura.io/ipfs/QmNk6CjpuBrFs8axoGyqLZ4ZHSsHVq1gV74k9oz2mHWj1V\n> \n> Descrição\n> Fabio Luis Barbosa dos Santos mergulha na história política da América do Sul para compreender as razões da ascensão e queda dos chamados “governos progressistas”. Na esteira das mobilizações contra as reformas neoliberais dos anos 1990, nove países da região elegeram presidentes identificados com as reivindicações populares. Contudo, menos de vinte anos depois da vitória do primeiro deles, Hugo Chávez, e após golpes de Estado mais ou menos explícitos, essa onda chegaria ao fim, abrindo espaço para o recrudescimento do conservadorismo. O que aconteceu? Talvez o diálogo crítico entre passado e presente proposto neste livro possa oferecer caminhos para o futuro de uma esquerda sul-americana aturdida com a força de macris, uribes, fujimoris, piñeras e bolsonaros depois de um ciclo de crescimento e inclusão social.\n> ==\n> Na América Latina, de tempos em tempos, somos invadidos pelo sentimento desesperador do eterno retorno do mesmo. A cada tentativa de integração civilizadora, nossas sociedades são tragadas pela voragem do atraso que as mantêm presas à desigualdade, à falta de liberdade e à injustiça. Por quê?\n> No intuito de responder a inquietações que retornaram com força depois do desmanche da “onda progressista”, Fabio Luis Barbosa dos Santos procura, a partir de rica pesquisa de campo e de entrevistas, além de amplo domínio da literatura especializada, sintetizar o que ocorreu nas últimas duas décadas.\n> Ao analisar as contradições e os dilemas dos governos progressistas, o autor mostra que, apesar das particularidades de cada país, há características comuns: os presidentes não romperam com o legado macroeconômico das ditaduras; com pequenos piparotes na desigualdade, fortaleceram o capitalismo, deixando de cumprir promessas de integração social substantiva; levados ao poder pela insatisfação do campo popular com as políticas de ajuste neoliberais, canalizaram a revolta para demandas institucionais de pequeno resultado; e, por fim, se aproveitaram da acumulação por espoliação, surfando no consenso das commodities sem atentar para a predação socioambiental daí decorrente.\n> Em suma, enfraqueceram o campo popular e incrementaram a inserção subordinada e passiva de seus países no mercado mundial, em nome de uma política de esquerda. É fácil entender que a volta da direita ao poder não é um raio em céu azul.\n> Fabio Luis conclui que a derrocada da onda progressista atesta mais uma vez que, dado o caráter antinacional, antipopular, antidemocrático e predatório das classes dominantes no continente, a única alternativa civilizatória para a América Latina é o socialismo. Não por acaso, o último país analisado neste livro é Cuba. Seus dilemas são os dilemas do socialismo hoje.\n> Ao mapear o debate público aberto em 2016 sobre os rumos da revolução, o autor mostra sem preconceitos nem idealizações os problemas enfrentados pela ilha, isolada no oceano do capitalismo global, assim como os limites da Revolução Cubana.\n> Das reflexões de Fabio resta uma advertência: a alternativa civilizatória para Nossa América, que vá além do canto de sereia do consumo, está num projeto socialista humanista fundado em valores como igualdade, liberdade e participação popular, combinando direitos universais com relações mercantis disciplinadas por um Estado soberano.\n> Mas é sabido que mesmo uma proposta reformista tão modesta continua tabu absoluto para os donos do poder. Só resta concluir com Fabio Luis que, diante da contrarrevolução permanente, reforma é revolução.\n> — Isabel Loureiro\n> SOBRE O AUTOR\n> Fabio Luis Barbosa dos Santos é doutor em História Econômica pela Universidade de São Paulo (USP), professor do curso de Relações Internacionais da Universidade Federal de São Paulo (Unifesp) e autor dos livros Além do PT: a crise da esquerda brasileira em perspectiva latino-americana (Elefante, 2016) e Origens do pensamento e da política radical na América Latina (Unicamp, 2016). É também um dos organizadores de Cuba no século XXI: dilemas da revolução (Elefante, 2017).\n\n#Cuba, Venezuela e as polêmicas feat. Fabio Luis\nhttps://invidio.us/ipvxUMlMaBI",
				"added": 1595825752
			},
			{
				"comment_id": 21,
				"body": "#Documentário de desertores da Coreia do Norte - \"Os Cidadãos Leais de Pyongyang em Seul\" (legendado)\n- https://siasky.net/AADwWYlPgPG5mBYQgn7odhkF5W9GkAF2mQYyz498tziy0Q\n\nDocumentário sul-coreano sobre cidadãos da Coreia do Norte que foram para a Coreia do Sul e contam suas experiências de vida tanto nos dois regimes, em uma versão um pouco diferente do que estamos acostumados a ouvir.\n\nLegendado por Bruno Lino e cedido gentilmente ao [Centro de Estudos da Política Songun do Brasil](https://cepsongunbr.com/).",
				"added": 1595905249
			},
			{
				"comment_id": 22,
				"body": "#Quem dividiu a Coreia em duas? A Coreia é uma só!\n\n- https://siasky.net/AABPJzlKJpdfjDaL3ghi4nYMwAbIe3gwMfqRc-FhGiNLZA\n\nEntenda como os Estados Unidos dividiram em duas partes a nação coreana com uma história unida de 5 milênios, causando inúmeras dores e desgraças para o povo da Coreia.\n\nVídeo publicado pelo [CENTRO DE ESTUDOS DA POLÍTICA SONGUN](https://cepsongunbr.com/) - RIO DE JANEIRO - BRASIL.",
				"added": 1595905649
			},
			{
				"comment_id": 59,
				"body": "#Thomas Sankara: O líder visionário\n- https://ipfs.infura.io/ipfs/QmZetuD6GmzsqPcSq1X2Lyr5iynKcGGbXtVR4szmztP2Jo\n\nO \"Che Guevara africano\", como é conhecido, liderou a revolução de 4 de agosto de 1983 no Burkina Faso. Os ideais de [Thomas Sankara](https://everipedia.org/wiki/lang_en/Thomas_Sankara), assassinado em outubro de 1987, continuam ainda hoje a orientar muitos africanos.",
				"added": 1596129548
			},
			{
				"comment_id": 60,
				"body": "#Revolução Africana: Uma Antologia do Pensamento Marxista\nJones Manoel, Gabriel Landi Fazzio\n\n- https://ipfs.infura.io/ipfs/QmSTfPy5Vj3basuuakeh2vzMTbqDyqrvQHvas3zMnkgpvo\n\nAtravessando três décadas de luta revolucionária na África, os artigos desta antologia permitem uma visão não apenas de diversas experiências políticas, mas de toda a riqueza e variedade do pensamento marxista africano – apresentado pelos textos e discursos de seus representantes mais radicais. Entre os autores estão Frantz Fanon, Kwame Nkrumah, Amílcar Cabral, Eduardo Mondlane, Samora Machel, Agostinho Neto, Thomas Sankara e Samir Amin. Os textos abordam temas como o racismo na sociedade de classes, a mentalidade colonial, a idealização do passado africano e a opressão patriarcal no continente, além de questões de tática e organização política; essa antologia oferece ao público algumas perspectivas teóricas que dizem respeito não apenas à Revolução Africana, mas também à própria luta contra o racismo no Brasil capitalista de nossos tempos.",
				"added": 1596132084
			},
			{
				"comment_id": 63,
				"body": "> [thinulat](#comment_2_1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU): A ilusão do empreendedorismo, o desemprego e a esquerda perdida\n> \n> https://invidio.us/tgxrrq8VOX8\n> \n> https://swarm-gateways.net/bzz:/63764d3155598473db48a0eaafc67932ce8533d01cf7961cf3a35ac1ed6c48f9/A+ilusão+do+empreendedorismo,+o+desemprego+e+a+esquerda+perdida-tgxrrq8VOX8.mp4\n> \n> \n> Indicações de textos complementares\n> O “Que” de “Que fazer” de Althusser: https://web.archive.org/web/20200421193439/https://lavrapalavra.com/2019/12/06/o-que-de-que-fazer/\n> De onde vem o conservadorismo?: https://web.archive.org/web/20200328114003/https://blogdaboitempo.com.br/2015/04/15/de-onde-vem-o-conservadorismo/\n> A “reforma” trabalhista gerou os efeitos pretendidos: https://web.archive.org/web/20200505204549/https://www.jorgesoutomaior.com/blog/a-reforma-trabalhista-gerou-os-efeitos-pretendidos\n> O negócio é falar mal da CLT: https://web.archive.org/web/20190212021425/https://blogdaboitempo.com.br/2016/08/29/o-negocio-e-falar-mal-da-clt/\n> Garantia de Emprego para Todos Brasileiros - c/ Dep. Glauber Braga: https://invidio.us/HezdSnx2El0\n> Aspectos políticos do Pleno Emprego, por Michal Kalecki: https://web.archive.org/web/20200326171626/https://jornalggn.com.br/gestao/aspectos-politicos-do-pleno-emprego-por-michal-kalecki/\n\n#Garantia de Emprego para Todos Brasileiros - c/ Dep. Glauber Braga\n- https://siasky.net/AABWGYJHFMUvBSs44XE84QhQBDOqmSOz3lkOVrzTmbDB9w\n\n\"Fui ao Congresso Nacional conversar com o deputado mais aguerrido e combativo da atualidade sobre sua proposta de eliminação do desemprego involuntário, instituindo o Estado como empregador de última instância, amparando a classe trabalhadora que vivencia o drama do desemprego e do subemprego e que terá a oportunidade de trabalhar de forma digna por um salário mínimo em áreas importantes para todo o país, como a infraestrutura. Debatemos o custeio da proposta e seu efeito multiplicador sobre o PIB, aumentando a própria arrecadação governamental; a função perversa do desemprego como rebaixador de salários e disciplinamento da força de trabalho empregada; os danos sociais da política neoliberal de austeridade fiscal e sua inconsistência teórica; além do potencial radical dessa proposta como saída da crise via politização dos próprios trabalhos acerca da economia brasileira.\"\n\nO projeto do Deputado Federal Glauber Braga, que conta com influência teórica de Karl Marx, John Maynard Keynes, Michel Kalecki e da MMT:\n- https://www.camara.leg.br/proposicoesWeb/fichadetramitacao?idProposicao=2224946&fichaAmigavel=nao\n- https://ipfs.infura.io/ipfs/QmWh4jqKWRz2haaYaH7fpa3UhbKLVK32vSZCwFffM7Nn1V\n\nAndré Lara Resende, criador do Plano Real, refutando o paradigma monetário liberal em favor da MMT (Modern Monetary Theory):\n- https://web.archive.org/web/20200730181459/http://www.iea.usp.br/noticias/andre-lara-resende-novo-paradigma-macroeconomico\n- https://web.archive.org/web/20200730181610/https://www.unicamp.br/unicamp/index.php/ju/noticias/2019/08/15/revisao-da-macroeconomia-encontra-enorme-resistencia-afirma-andre-lara\n\nDebates anglófonos sobre a garantia de emprego (job guarantee) e o Green New Deal, proposto pela congressista Alexandria-Ocasio Cortez:\n- https://web.archive.org/web/20200730015743/www.huffpostbrasil.com/entry/federal-job-guarantee-explained_n_5b363f4ae4b007aa2f7f59fc?ri18n=true\n- https://web.archive.org/web/20200620121245/https://www.project-syndicate.org/commentary/yellow-vests-green-new-deal-by-joseph-e-stiglitz-2019-01?barrier=accesspaylog\n- https://web.archive.org/web/20200408131727/https://greenagenda.org.au/2018/09/universal-job-guarantee/\n\n#Fonte: https://invidio.us/HezdSnx2El0",
				"added": 1596133121
			},
			{
				"comment_id": 86,
				"body": "#MERITOCRACIA | Capitalismo NUNCA foi meritocrático\n- https://siasky.net/AAAIgBGSMc_3sjQxkph6-zJvGN9d-gmVaqsaYKNFlvNNYg\n\nCAPITALISMO E MERITOCRACIA || Você acredita mesmo que o capitalismo (ou a economia de mercado) é o reino da meritocracia? Nesse vídeo, atacamos essa fantasia. O capitalismo é o sistema menos meritocrático que algum dia existiu na história humana.",
				"added": 1596403144
			},
			{
				"comment_id": 87,
				"body": "#SpaceX e ELON MUSK: Tecnologia e capital se complementam ou se opõem?\n- https://siasky.net/AADVPb_1_o0KAqcpBe05Pc6CPXaUBGjFGtYHoP-Zi-rj3Q\n\nO capitalismo promove sempre o desenvolvimento da tecnologia?\nSe sim, de que forma e com quais critérios?\nEstado e empresas privadas são formas necessariamente opostas na sociedade capitalista?",
				"added": 1596404366
			},
			{
				"comment_id": 88,
				"body": "#Por que seria \"errado\" explorar o trabalhador? A tensão entre normatividade e cientificidade em Marx\n- https://siasky.net/AADZFTxvZmj7tF7mkaSrqAH4NS3-62Mz-fd7T32_k3SKCw\n\nA ideia de \"igualdade\" faz parte do espirito de nosso tempo. Mesmo que não exista na efetividade, ela é pelo menos um norte, um horizonte, um objetivo, e raramente nos perguntamos o que fundamenta ou justifica este princípio.\n\nQuando perguntamos a um marxista por que seria moralmente errado explorar outra pessoa, isso nos revela uma interessante característica do pensamento de Marx: a tensão entre o aspecto normativo de sua filosofia social, e o aspecto científico de sua crítica da economia política.",
				"added": 1596407285
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 6,
				"body": "#GitHub coloca projetos em cápsula do tempo no Ártico e espera que ela dure mil anos\n\nSe você postou um projeto no GitHub antes de 2 de fevereiro, os frutos do seu trabalho agora provavelmente estão guardados por um milênio em uma arca congelada. Na quinta-feira (16), o maior repositório de código-fonte do mundo [anunciou](https://web.archive.org/web/20200723082913/https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic/) que, em 8 de julho, consagrou seu arquivo abaixo de centenas de metros de permafrost em um cofre do Ártico.\n\nEle foi posto dentro de uma câmara em uma mina abandonada dentro de uma montanha no arquipélago norueguês de [Svalbard](https://en.wikipedia.org/wiki/Svalbard), habitado por alguns milhares de pessoas e ursos polares. Em outras palavras, a salvo das forças de especuladores imobiliários e influenciadores no futuro próximo.\n\nO GitHub diz ter feito uma captura de todos os repositórios públicos ativos e de inativos “significativos” tirada em 2 de fevereiro de 2020. Ela foi impressa em 186 bobinas de 1.066 metros de filmes digitais de arquivo. Espera-se que eles durem 1.000 anos — eles até [parecem](https://web.archive.org/web/20200723082913/https://github.blog/2020-07-16-github-archive-program-the-journey-of-the-worlds-open-source-code-to-the-arctic/) um pouco sagrados. O GitHub também planeja, em algum momento, gravar a laser todos os repositórios ativos em pratos de vidro de quartzo, que devem durar mais de 10.000 anos.\n\nSe isso soa familiar, provavelmente é porque o GitHub fez parceria com a Long Now Foundation, famosa por projetos de preservação eterna, como o [relógio de 10.000 anos](http://longnow.org/clock/), ainda em construção, projetado para funcionar por 10.000 anos dentro de uma montanha (de [propriedade de Jeff Bezos](https://web.archive.org/web/20200719163401/https://gizmodo.com/jeff-bezos-begins-installation-of-his-bonkers-10-000-ye-1823162799), após um investimento de US$ 42 milhões).\n\nO GitHub, um arquivo e uma colmeia para projetos de código aberto, contém projetos para reconstruir e expandir um cenário digital.\n\nUm alienígena com equipamentos tecnológicos poderia teoricamente aperfeiçoar suas habilidades de programação humana por meio do softwares de boot camp hospedado no GitHub e usar os dados do site para [criar um modelo de aprendizado de máquina](https://github.com/tensorflow/tensorflow) para treinar um robô a escrever [no estilo de Shakespeare](http://karpathy.github.io/2015/05/21/rnn-effectiveness/) e talvez até transformar o resultado em uma [animação](https://github.com/animate-css/animate.css).\n\nEle poderia estudar nossas [linguagens de programação](https://github.com/golang/go), nossos [sistemas operacionais arcanos](https://github.com/microsoft/MS-DOS), [nossos frameworks de desenvolvimento de aplicativos](https://github.com/ruby/ruby) e nossas [bibliotecas de criptografia](https://github.com/openssl/openssl). Se tiverem o tempo e a vontade, eles podem descrever suas descobertas em um [blog WordPress](https://github.com/WordPress/WordPress).\n\nSe os alienígenas nunca chegarem, isso ainda pode ser útil para especuladores de moeda digital, que [ficarão tranquilos](https://web.archive.org/web/20200720105751/https://www.coindesk.com/github-is-burying-bitcoin-code-inside-an-arctic-mountain-to-ride-out-the-next-1000-years) sabendo que o código do bitcoin está a salvo de quase qualquer catástrofe imaginável.\n\nOs alienígenas precisariam ler as instruções. Os 21 TB de dados do repositório foram compactados em arquivos TAR e serão transformados em QR codes. Portanto, pode ser necessário consultar o manual legível por humanos do GitHub para “decodificação QR, formatos de arquivo, codificações de caracteres e outros metadados críticos”.\n\nO pressuposto e a esperança, porém, são de que quem encontrar isso terá um computador. O GitHub também inscreveu um [guia](https://github.com/github/archive-program/blob/master/GUIDE.md) em cada rolo, como um arquivo leia-me, definindo os princípios do software. Antes de explicar o contexto dos projetos, o site adicionou um aviso sobre o universo tecnológico necessário para os projetos preservados funcionarem:\n\n\n- A leitura, decodificação e descompactação desses dados exigirão uma computação considerável. Em teoria, isso poderia ser feito sem computadores, mas seria muito tedioso e difícil.\n\n- Nossa expectativa é que você não precise de nossas definições de software, computador e outros termos. Imaginamos que você tenha computadores próprios, provavelmente muito mais avançados que os nossos, e possivelmente arquitetados de maneira fundamentalmente diferente. Depois de entender a visão geral e o guia abaixo, você poderá acessar facilmente todos os dados.\n\n- No entanto, é possível que você tenha computadores inferiores aos nossos, ou mesmo nenhum computador. Nesse caso, preparamos um rolo de dados não compactado, não codificado e legível por humanos, que chamamos de Árvore Tecnológica. A Árvore Tecnológica contém informações sobre nossas tecnologias fundamentais, nossos computadores e nosso software, na esperança de que, com o tempo, você possa usar esse conhecimento para recriar computadores que possam usar o software de código aberto deste arquivo.\n\n\nA “Árvore Tecnológica”, que o GitHub [descreve](https://archiveprogram.github.com/) como uma “[Pedra de Roseta](https://pt.wikipedia.org/wiki/Pedra_de_Roseta)” para computação e desenvolvimento de software, foi impressa em um rolo separado legível por humanos.\n\nNeste ponto, uma carta pós-apocalíptica para uma raça futura não parece nada assustadora. No caso de uma catástrofe imediata, mas não apocalíptica, os projetos do GitHub também são arquivados pelo Internet Archive, pela Software Heritage Foundation e pela Bodleian Library.\n\n- Fonte: https://gizmodo.uol.com.br/github-capsula-do-tempo-artico/",
				"added": 1595808759
			},
			{
				"comment_id": 7,
				"body": "#O sistema operacional do apocalipse\n\nAinda não sabemos como será o fim do mundo. Um desastre natural? Uma guerra nuclear? Uma bactéria ou vírus mortal? Uma infestação de zumbis? Qualquer que seja o final dos tempos, uma coisa é certa: haverá um sistema operacional capaz de rodar no que sobrar da tecnologia como a conhecemos. Conheçam o Collapse OS!\n\nDesenvolvido pelo programador canadense Virgil Dupras e compilado para o processador [Zilog Z80](https://ipfs.io/ipfs/QmXoypizjW3WknFiJnKLwHCnL72vedxjQkDDP1mXWo6uco/wiki/Zilog_Z80.html), o Collapse OS será o sistema operacional mais utilizado no mundo pós-apocalíptico desbancando facilmente o Windows. Mas porque o sistema roda no Z80? Lançado em 1976, o chip de 8 bits da Zilog está presente em incontáveis dispositivos e é produzido até hoje, assim em um mundo devastado as chances de você encontrar algum equipamento com o Z80 serão grandes. Muito bem pensado!\n\nConforme a [página do projeto](https://collapseos.org/), o Collpase OS compõe um kernel para o Z80 (sob a licença GNU), alguns programas (como um shell e um editor de texto baseado no ed do Unix), ferramentas e documentação, com a capacidade de ser compilado dentro de si mesmo. Ele também consegue ler cartões SD. Wow!\n\nO kernel ocupa apenas 3 KB de RAM, chegando a 8 KB ao se auto compilar, enquanto que o editor de texto ed usa um mísero KB. Segundo o desenvolvedor, o Collapse OS já é capaz de rodar nos consoles Master System e Mega Drive. É isso aí, mesmo após o fim do mundo os nerds ainda terão um bom passatempo! \n\nEm tempo, o código-fonte e a documentação do sistema podem ser encontrados no [GitHub](https://github.com/hsoft/collapseos.git).\n\n- Fonte: https://www.michaelrigo.com/2019/11/sistema-operacional-do-apocalipse.html\n\n#Source code: https://siasky.net/_AoCxBqhYP_Ubgb61IwOF1DBiHS2TII_o3_C-Vwwpkctlw",
				"added": 1595813739
			},
			{
				"comment_id": 26,
				"body": "> [otp](#comment_6_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ): GitHub coloca projetos em cápsula do tempo no Ártico e espera que ela dure mil anos\n> Se você postou um projeto no GitHub antes de 2 de fevereiro, os frutos do seu trabalho agora provavelmente estão guardados por um milênio em uma arca congelada. Na quinta-feira (16), o maior repositório de código-fonte do mundo anunciou que, em 8 de julho, consagrou seu arquivo abaixo de centenas de metros de permafrost em um cofre do Ártico.\n> Ele foi posto dentro de uma câmara em uma mina abandonada dentro de uma montanha no arquipélago norueguês de Svalbard, habitado por alguns milhares de pessoas e ursos polares. Em outras palavras, a salvo das forças de especuladores imobiliários e influenciadores no futuro próximo.\n> O GitHub diz ter feito uma captura de todos os repositórios públicos ativos e de inativos “significativos” tirada em 2 de fevereiro de 2020. Ela foi impressa em 186 bobinas de 1.066 metros de filmes digitais de arquivo. Espera-se que eles durem 1.000 anos — eles até parecem um pouco sagrados. O GitHub também planeja, em algum momento, gravar a laser todos os repositórios ativos em pratos de vidro de quartzo, que devem durar mais de 10.000 anos.\n> Se isso soa familiar, provavelmente é porque o GitHub fez parceria com a Long Now Foundation, famosa por projetos de preservação eterna, como o relógio de 10.000 anos, ainda em construção, projetado para funcionar por 10.000 anos dentro de uma montanha (de propriedade de Jeff Bezos, após um investimento de US$ 42 milhões).\n> O GitHub, um arquivo e uma colmeia para projetos de código aberto, contém projetos para reconstruir e expandir um cenário digital.\n> Um alienígena com equipamentos tecnológicos poderia teoricamente aperfeiçoar suas habilidades de programação humana por meio do softwares de boot camp hospedado no GitHub e usar os dados do site para criar um modelo de aprendizado de máquina para treinar um robô a escrever no estilo de Shakespeare e talvez até transformar o resultado em uma animação.\n> Ele poderia estudar nossas linguagens de programação, nossos sistemas operacionais arcanos, nossos frameworks de desenvolvimento de aplicativos e nossas bibliotecas de criptografia. Se tiverem o tempo e a vontade, eles podem descrever suas descobertas em um blog WordPress.\n> Se os alienígenas nunca chegarem, isso ainda pode ser útil para especuladores de moeda digital, que ficarão tranquilos sabendo que o código do bitcoin está a salvo de quase qualquer catástrofe imaginável.\n> Os alienígenas precisariam ler as instruções. Os 21 TB de dados do repositório foram compactados em arquivos TAR e serão transformados em QR codes. Portanto, pode ser necessário consultar o manual legível por humanos do GitHub para “decodificação QR, formatos de arquivo, codificações de caracteres e outros metadados críticos”.\n> O pressuposto e a esperança, porém, são de que quem encontrar isso terá um computador. O GitHub também inscreveu um guia em cada rolo, como um arquivo leia-me, definindo os princípios do software. Antes de explicar o contexto dos projetos, o site adicionou um aviso sobre o universo tecnológico necessário para os projetos preservados funcionarem:\n> \n> A leitura, decodificação e descompactação desses dados exigirão uma computação considerável. Em teoria, isso poderia ser feito sem computadores, mas seria muito tedioso e difícil.\n> \n> Nossa expectativa é que você não precise de nossas definições de software, computador e outros termos. Imaginamos que você tenha computadores próprios, provavelmente muito mais avançados que os nossos, e possivelmente arquitetados de maneira fundamentalmente diferente. Depois de entender a visão geral e o guia abaixo, você poderá acessar facilmente todos os dados.\n> \n> No entanto, é possível que você tenha computadores inferiores aos nossos, ou mesmo nenhum computador. Nesse caso, preparamos um rolo de dados não compactado, não codificado e legível por humanos, que chamamos de Árvore Tecnológica. A Árvore Tecnológica contém informações sobre nossas tecnologias fundamentais, nossos computadores e nosso software, na esperança de que, com o tempo, você possa usar esse conhecimento para recriar computadores que possam usar o software de código aberto deste arquivo.\n> \n> \n> A “Árvore Tecnológica”, que o GitHub descreve como uma “Pedra de Roseta” para computação e desenvolvimento de software, foi impressa em um rolo separado legível por humanos.\n> Neste ponto, uma carta pós-apocalíptica para uma raça futura não parece nada assustadora. No caso de uma catástrofe imediata, mas não apocalíptica, os projetos do GitHub também são arquivados pelo Internet Archive, pela Software Heritage Foundation e pela Bodleian Library.\n> \n> Fonte: https://gizmodo.uol.com.br/github-capsula-do-tempo-artico/\n\n#Alguns dos principais projetos arquivados no programa [Arctic Vault 2020](https://archiveprogram.github.com/)\n- https://gateway.pinata.cloud/ipfs/QmY1n8BgZP9e5hx3X8PYpmh36AYFJWmH2fr7iFAK1Mqoyn\n- https://gateway.pinata.cloud/ipfs/QmXjapy9ZV43j1d8X3vEP3Y4Sb6oANFJT9RMYpH944BRth",
				"added": 1595945331
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 9,
				"body": "#UMA HISTÓRIA DA ONDA PROGRESSISTA SUL-AMERICANA\n\n- Livro: https://ipfs.infura.io/ipfs/QmNk6CjpuBrFs8axoGyqLZ4ZHSsHVq1gV74k9oz2mHWj1V\n\n#Descrição\n\nFabio Luis Barbosa dos Santos mergulha na história política da América do Sul para compreender as razões da ascensão e queda dos chamados “governos progressistas”. Na esteira das mobilizações contra as reformas neoliberais dos anos 1990, nove países da região elegeram presidentes identificados com as reivindicações populares. Contudo, menos de vinte anos depois da vitória do primeiro deles, Hugo Chávez, e após golpes de Estado mais ou menos explícitos, essa onda chegaria ao fim, abrindo espaço para o recrudescimento do conservadorismo. O que aconteceu? Talvez o diálogo crítico entre passado e presente proposto neste livro possa oferecer caminhos para o futuro de uma esquerda sul-americana aturdida com a força de macris, uribes, fujimoris, piñeras e bolsonaros depois de um ciclo de crescimento e inclusão social.\n\n==\n\nNa América Latina, de tempos em tempos, somos invadidos pelo sentimento desesperador do eterno retorno do mesmo. A cada tentativa de integração civilizadora, nossas sociedades são tragadas pela voragem do atraso que as mantêm presas à desigualdade, à falta de liberdade e à injustiça. Por quê?\n\nNo intuito de responder a inquietações que retornaram com força depois do desmanche da “onda progressista”, Fabio Luis Barbosa dos Santos procura, a partir de rica pesquisa de campo e de entrevistas, além de amplo domínio da literatura especializada, sintetizar o que ocorreu nas últimas duas décadas.\n\nAo analisar as contradições e os dilemas dos governos progressistas, o autor mostra que, apesar das particularidades de cada país, há características comuns: os presidentes não romperam com o legado macroeconômico das ditaduras; com pequenos piparotes na desigualdade, fortaleceram o capitalismo, deixando de cumprir promessas de integração social substantiva; levados ao poder pela insatisfação do campo popular com as políticas de ajuste neoliberais, canalizaram a revolta para demandas institucionais de pequeno resultado; e, por fim, se aproveitaram da acumulação por espoliação, surfando no consenso das commodities sem atentar para a predação socioambiental daí decorrente.\n\nEm suma, enfraqueceram o campo popular e incrementaram a inserção subordinada e passiva de seus países no mercado mundial, em nome de uma política de esquerda. É fácil entender que a volta da direita ao poder não é um raio em céu azul.\n\nFabio Luis conclui que a derrocada da onda progressista atesta mais uma vez que, dado o caráter antinacional, antipopular, antidemocrático e predatório das classes dominantes no continente, a única alternativa civilizatória para a América Latina é o socialismo. Não por acaso, o último país analisado neste livro é Cuba. Seus dilemas são os dilemas do socialismo hoje.\n\nAo mapear o debate público aberto em 2016 sobre os rumos da revolução, o autor mostra sem preconceitos nem idealizações os problemas enfrentados pela ilha, isolada no oceano do capitalismo global, assim como os limites da Revolução Cubana.\n\nDas reflexões de Fabio resta uma advertência: a alternativa civilizatória para Nossa América, que vá além do canto de sereia do consumo, está num projeto socialista humanista fundado em valores como igualdade, liberdade e participação popular, combinando direitos universais com relações mercantis disciplinadas por um Estado soberano.\n\nMas é sabido que mesmo uma proposta reformista tão modesta continua tabu absoluto para os donos do poder. Só resta concluir com Fabio Luis que, diante da contrarrevolução permanente, reforma é revolução.\n\n— Isabel Loureiro\n\n #SOBRE O AUTOR\n\n[Fabio Luis Barbosa dos Santos](http://lattes.cnpq.br/5107759022294795) é doutor em História Econômica pela Universidade de São Paulo (USP), professor do curso de Relações Internacionais da Universidade Federal de São Paulo (Unifesp) e autor dos livros Além do PT: a crise da esquerda brasileira em perspectiva latino-americana (Elefante, 2016) e Origens do pensamento e da política radical na América Latina (Unicamp, 2016). É também um dos organizadores de Cuba no século XXI: dilemas da revolução (Elefante, 2017).",
				"added": 1595825509
			},
			{
				"comment_id": 11,
				"body": "> [otp](#comment_9_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ): UMA HISTÓRIA DA ONDA PROGRESSISTA SUL-AMERICANA\n> \n> Livro: https://ipfs.infura.io/ipfs/QmNk6CjpuBrFs8axoGyqLZ4ZHSsHVq1gV74k9oz2mHWj1V\n> \n> Descrição\n> Fabio Luis Barbosa dos Santos mergulha na história política da América do Sul para compreender as razões da ascensão e queda dos chamados “governos progressistas”. Na esteira das mobilizações contra as reformas neoliberais dos anos 1990, nove países da região elegeram presidentes identificados com as reivindicações populares. Contudo, menos de vinte anos depois da vitória do primeiro deles, Hugo Chávez, e após golpes de Estado mais ou menos explícitos, essa onda chegaria ao fim, abrindo espaço para o recrudescimento do conservadorismo. O que aconteceu? Talvez o diálogo crítico entre passado e presente proposto neste livro possa oferecer caminhos para o futuro de uma esquerda sul-americana aturdida com a força de macris, uribes, fujimoris, piñeras e bolsonaros depois de um ciclo de crescimento e inclusão social.\n> ==\n> Na América Latina, de tempos em tempos, somos invadidos pelo sentimento desesperador do eterno retorno do mesmo. A cada tentativa de integração civilizadora, nossas sociedades são tragadas pela voragem do atraso que as mantêm presas à desigualdade, à falta de liberdade e à injustiça. Por quê?\n> No intuito de responder a inquietações que retornaram com força depois do desmanche da “onda progressista”, Fabio Luis Barbosa dos Santos procura, a partir de rica pesquisa de campo e de entrevistas, além de amplo domínio da literatura especializada, sintetizar o que ocorreu nas últimas duas décadas.\n> Ao analisar as contradições e os dilemas dos governos progressistas, o autor mostra que, apesar das particularidades de cada país, há características comuns: os presidentes não romperam com o legado macroeconômico das ditaduras; com pequenos piparotes na desigualdade, fortaleceram o capitalismo, deixando de cumprir promessas de integração social substantiva; levados ao poder pela insatisfação do campo popular com as políticas de ajuste neoliberais, canalizaram a revolta para demandas institucionais de pequeno resultado; e, por fim, se aproveitaram da acumulação por espoliação, surfando no consenso das commodities sem atentar para a predação socioambiental daí decorrente.\n> Em suma, enfraqueceram o campo popular e incrementaram a inserção subordinada e passiva de seus países no mercado mundial, em nome de uma política de esquerda. É fácil entender que a volta da direita ao poder não é um raio em céu azul.\n> Fabio Luis conclui que a derrocada da onda progressista atesta mais uma vez que, dado o caráter antinacional, antipopular, antidemocrático e predatório das classes dominantes no continente, a única alternativa civilizatória para a América Latina é o socialismo. Não por acaso, o último país analisado neste livro é Cuba. Seus dilemas são os dilemas do socialismo hoje.\n> Ao mapear o debate público aberto em 2016 sobre os rumos da revolução, o autor mostra sem preconceitos nem idealizações os problemas enfrentados pela ilha, isolada no oceano do capitalismo global, assim como os limites da Revolução Cubana.\n> Das reflexões de Fabio resta uma advertência: a alternativa civilizatória para Nossa América, que vá além do canto de sereia do consumo, está num projeto socialista humanista fundado em valores como igualdade, liberdade e participação popular, combinando direitos universais com relações mercantis disciplinadas por um Estado soberano.\n> Mas é sabido que mesmo uma proposta reformista tão modesta continua tabu absoluto para os donos do poder. Só resta concluir com Fabio Luis que, diante da contrarrevolução permanente, reforma é revolução.\n> — Isabel Loureiro\n> SOBRE O AUTOR\n> Fabio Luis Barbosa dos Santos é doutor em História Econômica pela Universidade de São Paulo (USP), professor do curso de Relações Internacionais da Universidade Federal de São Paulo (Unifesp) e autor dos livros Além do PT: a crise da esquerda brasileira em perspectiva latino-americana (Elefante, 2016) e Origens do pensamento e da política radical na América Latina (Unicamp, 2016). É também um dos organizadores de Cuba no século XXI: dilemas da revolução (Elefante, 2017).\n\n#Cuba, Venezuela e as polêmicas feat. Fabio Luis\nhttps://invidio.us/ipvxUMlMaBI",
				"added": 1595825610
			},
			{
				"comment_id": 14,
				"body": "#Livro verde: um balanço da atuação do BNDES entre 2001 e 2016\n- https://ipfs.infura.io/ipfs/QmNSUjfTUndidok5jYJYiQnEFo3kDzAYVKJrGEEFm44Gdn\n\nCom o objetivo de prestar contas à sociedade brasileira, o Livro verde: nossa história tal como ela é faz um balanço integrado e abrangente da atuação do [BNDES](https://www.bndes.gov.br/) no período de 2001 a 2016.\n\nO balanço dos 16 anos é dividido em cinco capítulos, que trazem informações sobre a forma de atuar do Banco, seu desempenho, suas fontes de financiamento e sua gestão de risco, crédito e conformidade, além de questões setoriais, como o apoio à infraestrutura, à exportação, ao mercado de capitais, ao desenvolvimento tecnológico, à temática socioambiental, e também uma visão territorial da presença do Banco no país. Por último, dois apêndices contam a história resumida da instituição desde 1952, ano em que foi criada, apresentando casos de sucesso e a lista dos maiores clientes.\n\n- Fonte: https://www.bndes.gov.br/wps/portal/site/home/conhecimento/noticias/noticia/livro-verde-final",
				"added": 1595827895
			},
			{
				"comment_id": 15,
				"body": "> [otp](#comment_14_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ): Livro verde: um balanço da atuação do BNDES entre 2001 e 2016\n> \n> https://ipfs.infura.io/ipfs/QmNSUjfTUndidok5jYJYiQnEFo3kDzAYVKJrGEEFm44Gdn\n> \n> Com o objetivo de prestar contas à sociedade brasileira, o Livro verde: nossa história tal como ela é faz um balanço integrado e abrangente da atuação do BNDES no período de 2001 a 2016.\n> O balanço dos 16 anos é dividido em cinco capítulos, que trazem informações sobre a forma de atuar do Banco, seu desempenho, suas fontes de financiamento e sua gestão de risco, crédito e conformidade, além de questões setoriais, como o apoio à infraestrutura, à exportação, ao mercado de capitais, ao desenvolvimento tecnológico, à temática socioambiental, e também uma visão territorial da presença do Banco no país. Por último, dois apêndices contam a história resumida da instituição desde 1952, ano em que foi criada, apresentando casos de sucesso e a lista dos maiores clientes.\n> \n> Fonte: https://www.bndes.gov.br/wps/portal/site/home/conhecimento/noticias/noticia/livro-verde-final\n\n#BNDES não financia Cuba nem Venezuela\nhttps://ipfs.infura.io/ipfs/QmY3V2jEv6TzRXMfEFDsyEcgbFKkt1fxwbdug5T9zmud6a\n\n- Fonte: https://invidio.us/MofJVCRpOCs",
				"added": 1595827974
			},
			{
				"comment_id": 62,
				"body": "#Revolução Africana: Uma Antologia do Pensamento Marxista\nJones Manoel, Gabriel Landi Fazzio\n\n- https://ipfs.infura.io/ipfs/QmSTfPy5Vj3basuuakeh2vzMTbqDyqrvQHvas3zMnkgpvo\n\nAtravessando três décadas de luta revolucionária na África, os artigos desta antologia permitem uma visão não apenas de diversas experiências políticas, mas de toda a riqueza e variedade do pensamento marxista africano – apresentado pelos textos e discursos de seus representantes mais radicais. Entre os autores estão Frantz Fanon, Kwame Nkrumah, Amílcar Cabral, Eduardo Mondlane, Samora Machel, Agostinho Neto, Thomas Sankara e Samir Amin. Os textos abordam temas como o racismo na sociedade de classes, a mentalidade colonial, a idealização do passado africano e a opressão patriarcal no continente, além de questões de tática e organização política; essa antologia oferece ao público algumas perspectivas teóricas que dizem respeito não apenas à Revolução Africana, mas também à própria luta contra o racismo no Brasil capitalista de nossos tempos.",
				"added": 1596132221
			},
			{
				"comment_id": 91,
				"body": "#Aprendendo Inteligência: Manual de instruções do cérebro para estudantes em geral\nPierluigi Piazzi\n- https://ipfs.infura.io/ipfs/QmR6pvxtEi67pEoCzEwqpmZy7UUkeFmXH7cTq6b39292Lt\n\nDurante muito tempo, acreditou-se que a inteligência fosse uma característica inata. O fator genético era considerado bem mais influente do que o fator ambiental. Porém, devido aos avanços da neurociência, ficou demonstrado que inteligência, talento e vocação são características que podem ser adquiridas com facilidade e um pouco de esforço. Neste livro, dedicado aos estudantes de todos os níveis, o Pierluigi Piazzi (conhecido carinhosamente pelos seus alunos como Prof. Pier) ensina a usar a inteligência para se tornar uma pessoa mais inteligente.",
				"added": 1596478518
			},
			{
				"comment_id": 94,
				"body": "#Livros de [Alberto Dell'isola](https://web.archive.org/web/20190118045359/https://albertodellisola.com.br/sobre-o-albertinho/)\n- https://siasky.net/AAAZhlYF4H7zlll4LYHkwDTKiGjson9A7rm0pEgoqO4tDQ",
				"added": 1596478882
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 16,
				"body": "> [herowbou](#comment_5_1DvxHKEut1np1S1qP3KYupsJUVn1FBMbmR): Sia\n> Sia é a principal plataforma de armazenamento em nuvem descentralizada. Sem inscrições, servidores ou terceiros confiáveis. A Sia aproveita a tecnologia blockchain para criar um mercado de armazenamento de dados mais robusto e acessível do que os provedores tradicionais de armazenamento em nuvem.\n> \n> https://sia.tech/\n> https://gitlab.com/NebulousLabs\n\n#Skynet Webportals\n\nOs Webportals da Skynet são servidores de baixo custo que ficam entre a Skynet e os usuários comuns, permitindo que eles acessem o conteúdo da Skynet sem precisar operar nenhum software especial. À medida que os Skylinks são gerados, eles podem ser compartilhados com qualquer pessoa para recuperar dados de qualquer Webportal. O remetente original não precisa ficar online para que o arquivo permaneça disponível. A rede Sia serve como a camada de armazenamento de back-end da Skynet e lida com toda a fixação, garantindo altas velocidades e excelente tempo de atividade.\n\n[Sia](https://sia.tech/) é a principal plataforma de armazenamento em nuvem descentralizada. Sem inscrições, servidores ou terceiros confiáveis. A Sia aproveita a tecnologia blockchain para criar um mercado de armazenamento de dados mais robusto e acessível do que os provedores tradicionais de armazenamento em nuvem.\n\n#Skynet Webportals\n\n- https://siasky.net/ | https://github.com/NebulousLabs/skynet-webportal.git\n- https://skydrain.net/ | https://github.com/Fornaxian/skynet_portal.git\n- https://sialoop.net/\n- https://skynet.luxor.tech/ \n- https://skynet.tutemwesi.com/\n- https://siacdn.com/\n- https://vault.lightspeedhosting.com/",
				"added": 1595898074
			},
			{
				"comment_id": 17,
				"body": "> [otp](#comment_16_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ): Skynet Webportals\n> Os Webportals da Skynet são servidores de baixo custo que ficam entre a Skynet e os usuários comuns, permitindo que eles acessem o conteúdo da Skynet sem precisar operar nenhum software especial. À medida que os Skylinks são gerados, eles podem ser compartilhados com qualquer pessoa para recuperar dados de qualquer Webportal. O remetente original não precisa ficar online para que o arquivo permaneça disponível. A rede Sia serve como a camada de armazenamento de back-end da Skynet e lida com toda a fixação, garantindo altas velocidades e excelente tempo de atividade.\n> Sia é a principal plataforma de armazenamento em nuvem descentralizada. Sem inscrições, servidores ou terceiros confiáveis. A Sia aproveita a tecnologia blockchain para criar um mercado de armazenamento de dados mais robusto e acessível do que os provedores tradicionais de armazenamento em nuvem.\n> Skynet Webportals\n> \n> https://siasky.net/ | https://github.com/NebulousLabs/skynet-webportal.git\n> https://skydrain.net/ | https://github.com/Fornaxian/skynet_portal.git\n> https://sialoop.net/\n> https://skynet.luxor.tech/ \n> https://skynet.tutemwesi.com/\n> https://siacdn.com/\n> https://vault.lightspeedhosting.com/\n\n#Scripts de configuração do Skynet Portal\nEste diretório contém um guia de instalação e scripts que instalam e configuram alguns requisitos básicos para a execução de um Skynet Portal. A suposição é que estamos trabalhando com um sistema Debian Buster Minimal ou similar.\n- https://github.com/NebulousLabs/skynet-webportal/blob/master/setup-scripts/README.md\n\n#Como configurar um nó Sia via linha de comando\nA configuração de um nó Sia é o primeiro passo para usar o Skynet. Seu nó Sia é como você pode fazer upload e fixar arquivos e confiar apenas em si mesmo em vez de em um portal da web de terceiros.\n- https://support.siasky.net/article/vmmzyes1uy-skynet-sia-set-up",
				"added": 1595898272
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 18,
				"body": "#Quanto tempo demora para dobrar um rendimento? - Regra do 72\n- https://siasky.net/AAB58rTHMNmMZsKdZlVy3UmQmCbcfdHm44Kd1qK6_7Uqhg\n\nRegra de [Luca Pacioli](https://en.wikipedia.org/wiki/Luca_Pacioli) para determinar aproximadamente o tempo para um dinheiro aplicado em juros compostos duplicar de valor.",
				"added": 1595898389
			},
			{
				"comment_id": 71,
				"body": "#Conjecturas sobre números primos\n- https://en.wikipedia.org/wiki/Category:Conjectures_about_prime_numbers\n\nEm matemática, uma conjectura é uma conclusão ou proposição que se suspeita ser verdadeira devido a evidências preliminares de apoio, mas para as quais ainda não foram encontradas provas ou reprovações.",
				"added": 1596311886
			},
			{
				"comment_id": 78,
				"body": "#[Conjecturas](https://en.wikipedia.org/wiki/Conjecture) (possíveis demonstrações): https://gateway.pinata.cloud/ipfs/QmTXbkgnSgUh4Dy4o27QREBorGoigWeVh3bCtfGMbPMqhw",
				"added": 1596332881
			},
			{
				"comment_id": 79,
				"body": "#A UTILIZAÇÃO DE PROBLEMAS MATEMÁTICOS EM ABERTO NO ENSINO MÉDIO\n- https://ipfs.infura.io/ipfs/QmNgMExRZceUzRUMrgYbHbGfX2K5bwMYxTrBizDFtwcZ9J\n\nEm matemática um problema em aberto é uma questão não resolvida. Esse trabalho visa apontar a importância da utilização de problemas matemáticos em aberto no ensino médio, quebrando a concepção de estudantes deste nível escolar de que todos os problemas matemáticos têm solução.",
				"added": 1596334761
			},
			{
				"comment_id": 80,
				"body": "#Álgebra e teoria dos números para olimpíadas\nhttps://ipfs.infura.io/ipfs/QmYoVEbENMcgf9DDSzzNeLCk9aaiCSmjsceXVhie4GNpv1",
				"added": 1596334866
			},
			{
				"comment_id": 81,
				"body": "#Bases aditivas de um ponto de vista topológico e prime gaps de um ponto de vista algébrico\n- https://ipfs.infura.io/ipfs/QmRAkPvME9QaSQdFDQ96JSt6vJCqaxMVtLTgPNTXmikqmd\n\nEsta tese objetiva apresentar duas abordagens inovadoras acerca de dois assuntos clássicos da teoria dos números: bases aditivas e [prime gaps](https://en.wikipedia.org/wiki/Prime_gap). O primeiro tópico é estudado de um ponto de vista topológico, com o intuito de oferecer uma visão abrangente e resultados gerais sobre o conjunto de todas as bases aditivas, não versando sobre uma base aditiva específica, como é de costume. Por meio da introdução de uma métrica, são apresentadas várias ferramentas topológicas que permitem tratar problemas de difícil ataque direto sobre bases aditivas por meio de argumentos indiretos sobre bases melhor comportadas e suficientemente próximas das originalmente consideradas. Já a contribuição sobre prime gaps é realizada utilizando ferramentas algébricas, no lugar das analíticas, como habitual. Por meio de técnicas oriundas tanto da [teoria de Galois](https://en.wikipedia.org/wiki/Galois_theory) quanto da [teoria algébrica dos números](https://en.wikipedia.org/wiki/Algebraic_number_theory), é apresentado um estudo da [conjectura de Firoozbakht](https://en.wikipedia.org/wiki/Firoozbakht%27s_conjecture), juntamente com algumas de suas consequências, caso ela venha a ser provada",
				"added": 1596335201
			},
			{
				"comment_id": 82,
				"body": "#Aspectos Ergódicos da Teoria dos Números\nhttps://ipfs.infura.io/ipfs/QmRJTdUkiv11rS8A4X44digkDeXbz644DEbm6FJrdk2zcK",
				"added": 1596335960
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 19,
				"body": "#Documentário de desertores da Coreia do Norte - \"Os Cidadãos Leais de Pyongyang em Seul\" (legendado)\n- https://siasky.net/AADwWYlPgPG5mBYQgn7odhkF5W9GkAF2mQYyz498tziy0Q\n\nDocumentário sul-coreano sobre cidadãos da Coreia do Norte que foram para a Coreia do Sul e contam suas experiências de vida tanto nos dois regimes, em uma versão um pouco diferente do que estamos acostumados a ouvir.\n\nLegendado por Bruno Lino e cedido gentilmente ao [Centro de Estudos da Política Songun do Brasil](https://cepsongunbr.com/).",
				"added": 1595905172
			},
			{
				"comment_id": 53,
				"body": "#Hércules - Filme 2005\n- https://open.lbry.com/Hércules---Filme-2005:9\n\nNuma época muito remota, quando Hera e Zeus disputavam o poder, esta rivalidade chegou até os humanos, pois os seguidores de Hera tentavam derrotar os adoradores de Zeus. Neste contexto Alcmena (Elizabeth Perkins), princesa de Tebas e grã-sacerdotisa de Hera, espera o retorno do marido, Anfitrião (Timothy Dalton), que partiu com seus homens para se vingar dos piratas cretenses, que assassinaram alguns parentes de sua esposa. Alcmena anseia que o marido não seja bem- sucedido, pois é um adorador de Zeus. No entanto ele volta vitorioso, tendo matado vários piratas e os restantes estavam sendo levados como escravos. Quase ao chegar um destes cativos, Anteu (Tyler Mane), escapa e ao chegar na praia estupra Alcmena, que na verdade é engravidada por Zeus. Logo depois chega Anfitrião, que a leva ao leito e também a engravida. Alcmena se recusa a ter um filho de Zeus e pensa em matá-lo, mas o oráculo Tirésias (Kim Coates) prediz que ela terá dois filhos e diz que será difícil saber qual é o filho de Zeus. Quando nascem (curiosamente ninguém sabe qual dos bebês nasceu primeiro) duas harpias conseguem identificar qual deles é o filho de Zeus e o chamam de Hércules (Paul Telfer). Alcmena chama o outro filho de Íficles (Luke Ford) e manda que Anfitrião mate Hércules. Ele quase cumpre o pedido mas volta com o bebê, dizendo que se é mesmo o filho de Zeus ele não quer ser o responsável pela sua morte. Alcmena diz que não cuidará da criança e Anfitrião assume a tarefa de arrumar uma ama-de-leite. A rivalidade entre os seguidores de Zeus e Hera vão provocar muitas tristezas para ambos os lados.",
				"added": 1595984635
			},
			{
				"comment_id": 54,
				"body": "#O GRANDE DITADOR\n- https://open.lbry.com/O_Grande_Ditador_Filme_1940:7\n\nAdenoid Hynkel (Charles Chaplin) assume o governo de Tomainia. Ele acredita em uma nação puramente ariana e passa a discriminar os judeus locais. Esta situação é desconhecida por um barbeiro judeu (Charles Chaplin), que está hospitalizado devido à participação em uma batalha na 1ª Guerra Mundial. Ele recebe alta, mesmo sofrendo de amnésia sobre o que aconteceu na guerra. Por ser judeu, passa a ser perseguido e precisa viver no gueto. Lá conhece a lavadora Hannah (Paulette Goddard), por quem se apaixona. A vida dos judeus é monitorizada pela guarda de Hynkel, que tem planos de dominar o mundo. Seu próximo passo é invadir Osterlich, um país vizinho, e para tanto negocia um acordo com Benzino Napaloni (Jack Oakie), ditador da Bacteria.",
				"added": 1595984691
			},
			{
				"comment_id": 56,
				"body": "#Lava Jato, A Destruição da Economia Brasileira\n- https://open.lbry.com/Lava-Jato-A-Destruição-da-Economia-Brasileira:2\n\nNesse documentário vocês vão ver como o Brasil foi sabotado por intermédio da [operação Lava Jato](https://pt.wikipedia.org/wiki/Opera%C3%A7%C3%A3o_Lava_Jato), assim como perceber o papel da mídia que discerniu nas suas reportagens e páginas de diversos jornais o estrondoso crescimento do país no período anterior ao início da operação, mas que após a colocação em prática da mesma operação, passou a atuar juntamente com interesses externos para colocar o país em desequilíbrio econômico.\n\n- Fonte: https://web.archive.org/web/20200721144024/https://verlereconhecer.blogspot.com/2016/11/destruicao-jato-documentario-2016.html",
				"added": 1595984871
			},
			{
				"comment_id": 95,
				"body": "#SEM LIMITES\n- https://siasky.net/CADojiaZJu2coWylrwGUquwvtJBthJftPZTKjealhXP7tw\n\nEddie Morra (Bradley Cooper) sofre de bloqueio de escritor. Um dia, ele reencontra na rua seu ex-cunhado, Vernon (Johnny Whitworth), que lhe apresenta um remédio revolucionário que permite o uso de 100% da capacidade cerebral. O efeito é imediato em Eddie, pois ele passa a se lembrar de tudo que já leu, ouviu ou viu em sua vida. A partir de então ele consegue aprender outras línguas, fazer cálculos complicados e escrever muito rapidamente, mas para manter este ritmo precisa tomar o remédio todo dia. Seu desempenho chama a atenção do empresário Carl Van Loon (Robert De Niro), que resolve contar com sua ajuda para fechar um dos maiores negócios da história.",
				"added": 1596480282
			},
			{
				"comment_id": 97,
				"body": "#Mestres do Combate - Muay Thai\n- https://siasky.net/AADCfZCs6OZ9my3EK1Xazd55DNl2HW1nCLAEdsFwy59IAw\n\n[Muay thai](https://pt.wikipedia.org/wiki/Muay_thai) é uma arte marcial originária da Tailândia, onde é considerado desporto nacional. Esta disciplina física e mental que inclui golpes de combate em pé, é conhecida como \"a arte das oito armas\", pois caracteriza-se pelo uso combinado de punhos, cotovelos, joelhos, canelas e pés, estando associada a uma boa preparação física que a torna uma luta de contato total bastante eficiente.",
				"added": 1596838052
			},
			{
				"comment_id": 100,
				"body": "#Documentário: Evacuando a Terra\n- https://siasky.net/AABhFJ0CHqxuAS2KP1g5aIL0ijqR1ZO8AJ_fJylUPChaeQ\n\nSe enfrentamos uma contagem regressiva para a destruição, poderíamos construir uma nave espacial para nos levar a mundos novos e habitáveis? Podemos evacuar a Terra? No especial de duas horas que examina este cenário aterrador, mas cientificamente plausível, explorando como nós podemos nos unir para garantir a sobrevivência da raça humana.",
				"added": 1596851117
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 24,
				"body": "Livra-me, ó Deus! Apressa-te, Senhor, a ajudar-me!\nSejam humilhados e frustrados os que procuram tirar-me a vida; retrocedam desprezados os que desejam a minha ruína.\nRetrocedam em desgraça os que zombam de mim.\nMas regozijem-se e alegrem-se em ti todos os que te buscam; digam sempre os que amam a tua salvação: \"Como Deus é grande! \"\nQuanto a mim, sou pobre e necessitado; apressa-te, ó Deus. Tu és o meu socorro e o meu libertador; Senhor, não te demores!\n\n- Salmos 70:1-5",
				"added": 1595905736
			},
			{
				"comment_id": 25,
				"body": "#Parábola do fariseu e do publicano\n- https://ipfs.infura.io/ipfs/QmXjdGphsxh51tvpay8oMD3vitSx3rLYPASddFxPfKzwmJ\n\nA [Parábola do fariseu e do publicano](https://web.archive.org/web/20190426201222/https://estiloadoracao.com/parabola-do-fariseu-e-o-publicano/) é uma das parábolas de Jesus e aparece em apenas um dos evangelhos canônicos. Em [Lucas 18:9-14](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ_0), Jesus contrasta um fariseu, obcecado por sua própria virtude, com um publicano que, humildemente, pede a Deus misericórdia.",
				"added": 1595907470
			},
			{
				"comment_id": 57,
				"body": "#Bíblia - [Nova Versão Internacional](https://siasky.net/_AFCVUxBSjJQIgytk-mYy5dRX9gM66IwPHtPycb1TMl-3A)\nhttps://siasky.net/AACBY1Jxf5rR8L7C8V1lZosDFlZtAgqZvdDYD3nVrGPDSQ",
				"added": 1595991808
			}
		],
		"2_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": [
			{
				"comment_id": 27,
				"body": "#A construção do Estado norte-coreano [Parte 1]\nhttps://web.archive.org/web/20200430185605/https://revistaopera.com.br/2019/09/25/a-construcao-do-estado-norte-coreano-parte-1/\n\n#A construção do Estado norte-coreano [Parte 2]\nhttps://web.archive.org/web/20191127144452/https://revistaopera.com.br/2019/10/07/a-construcao-do-estado-norte-coreano-parte-2/\n\n#O boom da construção em Pyongyang: A Coreia do Norte está superando as sanções?\nhttps://web.archive.org/web/20200430190036/https://revistaopera.com.br/2020/01/23/o-boom-da-construcao-em-pyongyang-a-coreia-do-norte-esta-superando-as-sancoes/\n\n#Direitos humanos: Quando a Coreia do Norte fala\nhttps://web.archive.org/web/20191127144452/https://revistaopera.com.br/2019/11/16/direitos-humanos-quando-a-coreia-do-norte-fala/\n\n#Por uma Coreia pacífica e unida\nhttps://web.archive.org/web/20200430190635/https://revistaopera.com.br/2019/08/12/por-uma-coreia-pacifica-e-unida/\n\n#Norte ou Sul: Que Coreia enfrenta uma “crise alimentar”?\nhttps://web.archive.org/web/20200422215129/https://revistaopera.com.br/2019/07/11/norte-ou-sul-que-coreia-enfrenta-uma-crise-alimentar/\nPara sua referência, a população do Norte, em dezembro de 2013, era de 24,8 milhões. A população do Sul, a partir de julho de 2013, era de 51,06 milhões. Se pensarmos em imagens de pessoas norte-coreanas morrendo de fome ou sofrendo de desnutrição, como já foram divulgadas pela mídia e por funcionários dos governos sul-coreano e americano, a resposta pode parecer simples. Com base nessas imagens, você pode dizer que a produção agrícola, a autossuficiência de grãos e o consumo per capita de alimentos da Coreia do Sul certamente devem exceder em muito os do Norte.\n\nPorém, se sua resposta é essa, bem, você provavelmente foi enganado pela propaganda manipuladora. A realidade é exatamente o oposto.\n\nNa verdade, o Norte tem uma produção agrícola superior à do Sul, embora o Sul tenha o dobro da população. O rendimento anual estimado da colheita da Coreia do Norte é de 5.030.000 toneladas. O rendimento da safra de 2013 da safra do Sul foi de 4.833.148 toneladas. A autossuficiência de grãos do Norte é de 93,67%, enquanto a do Sul é de apenas 23,1%. O consumo de alimentos per capita é de 174 kg no Norte e 126,7 kg no Sul. A média per capita diária é de 476g no Norte e 347g no Sul.\n\n#Para a mídia ocidental, zumbis e unicórnios são comuns na Coreia do Norte\nhttps://web.archive.org/web/20191127150154/https://revistaopera.com.br/2019/06/16/para-a-midia-ocidental-zumbis-e-unicornios-sao-comuns-na-coreia-do-norte/\nSe a grande mídia serve para ser acreditada, a Coreia do Norte é uma terra repleta de campos prisionais, zumbis e unicórnios.\n\n#A mentira da foto noturna: Desenvolvimento econômico na Península Coreana\nhttps://web.archive.org/web/20200430191335/https://revistaopera.com.br/2019/06/03/a-mentira-da-foto-noturna-desenvolvimento-economico-na-peninsula-coreana/\nDefensores do capitalismo global desregulado frequentemente comparam as condições econômicas na Coreia do Norte com as da Coreia do Sul para estabelecer um argumento para defender suas políticas. Isto é completamente falacioso, ignorando a história real de como a Península Coreana se desenvolveu desde 1945.\n\n#Coreia do Norte: conquistas em saúde e educação\nhttps://web.archive.org/web/20191127132443/https://revistaopera.com.br/2019/04/11/coreia-do-norte-conquistas-em-saude-e-educacao/\nO governo norte-coreano, segundo a imprensa ocidental, segue oprimindo e empobrecendo sua população. De acordo com a U.S. News & World Report, “a Coreia do Norte é um dos lugares mais miseráveis ​​do mundo. O padrão de vida se deteriorou a níveis extremos de privação, em que o direito à segurança alimentar, à saúde e a outras necessidades mínimas de sobrevivência humana é negado”.\n\n“Aqui nos EUA contamos com o Medicare, todos os nossos filhos são educados, todos somos alfabetizados e todos queremos viver na América. E na RPDC, o sistema de saúde é péssimo, eles não têm escolas e leitos hospitalares e são todos um monte de analfabetos. Você não gostaria de morar lá!” (paráfrase do autor).\n\nSob a montanha de desinformação da mídia, há mais do que se aparenta. Apesar das sanções e ameaças militares, sem mencionar a intenção fracassada de organizações “respeitáveis” de direitos humanos (incluindo a Anistia Internacional) de distorcer os fatos, o “sistema de saúde da Coreia do Norte é invejado pelo mundo em desenvolvimento”, segundo a ex-diretora-geral da Organização Mundial da Saúde: “Diretora-geral da OMS, Margaret Chan, disse que o país não enfrenta ‘falta de médicos e enfermeiras’.\n\n#As seis maiores mentiras da mídia sobre a Coreia do Norte no encontro em Hanói\nhttps://web.archive.org/web/20200430192256/https://revistaopera.com.br/2019/03/22/as-seis-maiores-mentiras-da-midia-sobre-a-coreia-do-norte-no-encontro-em-hanoi/\n\n#O soldado fugitivo norte-coreano e a mídia como instrumento da guerra\nhttps://web.archive.org/web/20180114013058/https://revistaopera.com.br/2017/12/06/o-soldado-fugitivo-norte-coreano-a-midia-como-instrumento-da-guerra/\n\n#Cantora norte-coreana “executada” é negociadora de delegação da Coreia do Norte\nhttps://web.archive.org/web/20190629230110/https://revistaopera.com.br/2018/01/25/cantora-norte-coreana-executada-e-negociadora-de-delegacao-da-coreia-norte/\n\"\"Há alguns anos os meios de notícia internacionais informaram que ela havia sido executada por um pelotão de fuzilamento. Hyon Song Wol, uma dirigente sênior do Partido do Trabalho da Coreia, agora reaparece como uma das faces da delegação norte-coreana que foi para a Coreia do Sul negociar a formação de uma equipe única nas Olimpiadas de Inverno.\"\n\n#Hipocrisia, a narrativa da mídia para a Coreia do Norte\nhttps://web.archive.org/web/20171031070707/https://revistaopera.com.br/2017/08/17/hipocrisia-narrativa-da-midia-para-coreia-norte/\n\"Como disse Ésquilo, o pai da tragédia, a primeira vítima da guerra é a verdade – contra a Coreia do Norte, a imprensa já prepara o campo de batalha há anos.\"\n\n#Coreia do Norte e a hipocrisia nuclear\nhttps://web.archive.org/web/20200430210009/https://revistaopera.com.br/2016/09/11/coreia-do-norte-e-a-hipocrisia-nuclear/\n\n#Na ONU, Coreia do Norte defende direito a ter armas nucleares\nhttps://web.archive.org/web/20200430210120/https://revistaopera.com.br/2016/09/23/na-onu-coreia-norte-defende-direito-ter-armas-nucleares/",
				"added": 1595948258
			},
			{
				"comment_id": 28,
				"body": "Juche TV é um canal no Youtube em língua portuguesa que combate a manipulação midiática contra a Coreia do Norte, divulgando a verdade sobre o país. Foi ao ar pela primeira vez em 20 de setembro de 2017.\n- https://invidio.us/channel/UCDL1vd54UFeyKiqeyIRI6xQ",
				"added": 1595948334
			},
			{
				"comment_id": 29,
				"body": "#Coreia do Norte em Foco.\n- https://www.facebook.com/coreiadonorteemfoco/\n\nCoreia do Norte em Foco tem como objetivo divulgar as conquistas do regime socialista da República Popular Democrática da Coreia.\n\n#Blog Solidariedade a Coreia Popular\n- https://solidariedadecoreiapopular.blogspot.com/\n\nO Blog Solidariedade a Coreia Popular é a página oficial do Centro de Estudos da Ideia Juche - Brasil. O objetivo do Blog criado em 2010 é divulgar informações sobre a Coreia Popular, criando assim um contraponto às constumeiras mentiras e deturpações da imprensa ocidental.\n\n#Centro de Estudos da Política Songun – Brasil\n- https://cepsongunbr.com/\n- https://www.facebook.com/CEPSBR/\n- https://invidio.us/channel/UC001pdZ7vaiksSDtyvlgmMg\n- https://twitter.com/CEPSBR\n- https://www.instagram.com/cepsongunbr/\n\nO Centro de Estudos da Política Songun – Brasil é uma organização responsável pelo estudo da política de valorização dos aspectos militares adotada pela República Popular Democrática da Coreia, além da discussão sobre temas históricos, políticos, econômicos, filosóficos e sociais do país.\n\n#KFA - Brasil - Associação de Amizade com a Coreia\n- https://korea-dpr.com/index.html\n- https://www.facebook.com/KFA.Brasil/\n\nA Associação de Amizade da Coreia (KFA) foi fundada em novembro de Juche 89 (2000) com o objetivo de construir laços internacionais com a República Democrática Popular da Coreia. Tem atuação em 120 países. A KFA tem total reconhecimento do Governo da República Popular Democrática da Coreia, e foi criada com a aprovação desta.\n\n#O Outro Lado da Coreia do Norte\n- https://www.facebook.com/OOutroLadodaCoreiadoNorte/\n- https://invidio.us/channel/UC4RwYem5zm74VxqV1wPVPMg\n\nPagina com o objetivo de mostrar O Outro Lado da Coreia do Norte, que vive constantemente sendo bombardeada com enxurradas de mentiras, falacias e calunias por parte da grande mídia.",
				"added": 1595948431
			},
			{
				"comment_id": 30,
				"body": "#A discreta transição da Coreia do Norte: diplomacia de risco e modernização sem reforma\n- https://gateway.pinata.cloud/ipfs/Qmc7r4G84goUREWnJugMwb6hWeHHaQAPGuLGrwVwWuVpCJ\n\nA Coreia do Norte acaba de passar por nova sucessão, com um líder jovem, o que para analistas representa ausência de mudanças e esgotamento do regime. Enquanto as disputas de poder interno e as crises militares externas parecem sinalizar continuidade, e que foram iniciadas algumas transformações importantes. O regime impulsiona a modernização da defesa, enquanto recoloca o Partido como ator relevante, definindo o desenvolvimento econômico como vetor. Mas a modernização em curso prossegue com a tradicional diplomacia de risco que parece descartar a ideia de reforma, conservando a essência do regime.",
				"added": 1595948487
			},
			{
				"comment_id": 31,
				"body": "#Sobre a Coréia do Norte no Ciberespaço: O Juche e o Grande Líder nas Páginas do Solidariedade à Coréia Popular\n- https://gateway.pinata.cloud/ipfs/Qme3UczPdMnUPtVchnS7irv5v4gDwbem8CMM9vEiN9qm7a\n\nEste artigo analisa o blog “[Solidariedade à Coréia Popular](https://solidariedadecoreiapopular.blogspot.com/)” (S.C.P.) e sua proposta de apresentar o que realmente seria a Coréia do Norte. Esta iniciativa está inserida no contexto dos usos do ciberespaço por grupos que encontram neste ambiente um local propício para apresentar versões alternativas sobre temas polêmicos. Através da análise de postagens selecionadas, será possível entender como essa proposta se fundamenta e como a mesma apresenta o Juche e seu criador Kim Il-Sung. A análise demonstrará como a visão apologética do S.C.P. está em conformidade com o discurso feito pelo governo norte-coreano, fazendo com este blog seja considerado uma página de apoio ao regime.",
				"added": 1595948524
			},
			{
				"comment_id": 32,
				"body": "#Biblioteca - [Blog Solidariedade a Coreia Popular](https://solidariedadecoreiapopular.blogspot.com/)\nO Centro de Estudos da Ideia Juche - Brasil iniciou em 2017 o trabalho organizar o material já traduzido ao longo do tempo de atividades, com artigos, discursos e documentos escritos pelos camaradas Kim Il Sung, Kim Jong Il e Kim Jong Un, em pdf, em um formato digital inspirado nas Edições em Línguas Estrangeiras de Pyongyang, para que facilite o estudo dos interessados.\n\nVeja a lista dos trabalhos já editados: https://gateway.pinata.cloud/ipfs/QmdHVY1BFWqAtaGdZnaUXuTUyu37LnarjTCX4VXcWqQu5B",
				"added": 1595948570
			},
			{
				"comment_id": 33,
				"body": "#O Código Penal da Coreia do Norte\n- https://gateway.pinata.cloud/ipfs/QmPNjpjLsKZnEtykH1NznGjrqUwpNL17eBJeBjAA1LoHx8\n\nO Centro de Estudos da Política Songun – Brasil editou o Código Penal da República Popular Democrática da Coreia em português e o publica a seguir.\n\nO Código Penal da RPDC especifica os atos que são considerados crimes e as punições equivalentes.\n\nNa Coreia Popular, as punições mais comuns são as de trabalho forçado. Diferentemente dos países capitalistas, onde os presos são mantidos em cárcere e inertes, na RPDC os prisioneiros pagam por seus crimes desenvolvendo trabalhos de construção para se desculpar ao país e ao povo.",
				"added": 1595948604
			},
			{
				"comment_id": 34,
				"body": "#Documentário de desertores da Coreia do Norte - \"Os Cidadãos Leais de Pyongyang em Seul\" (legendado)\n- https://siasky.net/AADwWYlPgPG5mBYQgn7odhkF5W9GkAF2mQYyz498tziy0Q\n\nDocumentário sul-coreano sobre cidadãos da Coreia do Norte que foram para a Coreia do Sul e contam suas experiências de vida tanto nos dois regimes, em uma versão um pouco diferente do que estamos acostumados a ouvir.\n\nLegendado por Bruno Lino e cedido gentilmente ao [Centro de Estudos da Política Songun do Brasil](https://cepsongunbr.com/).",
				"added": 1595948694
			},
			{
				"comment_id": 35,
				"body": "#Quem dividiu a Coreia em duas? A Coreia é uma só!\n\n- https://siasky.net/AABPJzlKJpdfjDaL3ghi4nYMwAbIe3gwMfqRc-FhGiNLZA\n\nEntenda como os Estados Unidos dividiram em duas partes a nação coreana com uma história unida de 5 milênios, causando inúmeras dores e desgraças para o povo da Coreia.\n\nVídeo publicado pelo [CENTRO DE ESTUDOS DA POLÍTICA SONGUN](https://cepsongunbr.com/) - RIO DE JANEIRO - BRASIL.",
				"added": 1595948730
			},
			{
				"comment_id": 36,
				"body": "#A vida social dos norte-coreanos\n- https://siasky.net/AAC2agMlARQPU4uFP11a1kUvZUXznXRfQnpyCH4My23Zhg\n\nOs norte-coreanos usam celular? Como se vestem? São religiosos? Como vão para o trabalho? Reportagem de Ali Gudarzi, da HispanTV, revela alguns aspectos da vida social dos cidadãos da Coreia do Norte.\n\n- Fonte: https://invidio.us/8tQ_5iAa8hw",
				"added": 1595949371
			},
			{
				"comment_id": 37,
				"body": "#Documentário \"A outra realidade da Coreia do Norte\"\n- https://siasky.net/AABT3ld7kwRgcGK8g8JfNOof4C7LDUYwGoFbINst-2bo4g\n\n\"A Outra realidade da Coreia do Norte\" é um documentário alternativo realizado com a finalidade de entender melhor a realidade coreana. Ver a outra face de muitos aspectos do país que a mídia nos mostra, muitas vezes de maneira distorcida, e entender o porquê de muitos de seus aspectos que antes criticávamos e, mesmo que continuemos a criticar ou que tenhamos mudado positivamente nossa opinião após conhecer a verdade, não será por que alguém está nos dizendo, mas porque, após conhecer melhor suas causas, suas lutas e seus medos, decidimos tampar os ouvidos e tirar nossas próprias conclusões.\n\n- Fonte: https://invidio.us/7hs2D3EFPg8",
				"added": 1595952981
			},
			{
				"comment_id": 39,
				"body": "#Delegado da Coreia do Norte explica confronto com EUA\n- https://siasky.net/AAD6LBqcYmlVwtChfgOeztIsXfLaoujhtMSOICBphLXpGw\n\nÚnico ocidental a serviço da Coreia do Norte, o espanhol [Alejandro Cao de Benós](https://everipedia.org/wiki/lang_en/Alejandro_Cao_de_Ben%25C3%25B3s_de_Les_y_P%25C3%25A9rez) explica nesta entrevista a razão das frequentes escaladas de tensão com os Estados Unidos e a Coreia do Sul, desde a Guerra da Coreia até os testes nucleares e os exercícios militares na Península Coreana.\n\nAssista à segunda parte da entrevista, em que ele explica como funciona a sociedade norte-coreana: https://siasky.net/AACzPlMepdszHaB108c858Y0yvcXCGr66sNR13N6UOwUyA\n\n- Fonte: https://invidio.us/B3VNC8cJ1DQ",
				"added": 1595959135
			},
			{
				"comment_id": 40,
				"body": "#Kim Jong Il, Herói da RPDC\n\n- https://ipfs.infura.io/ipfs/QmT8LkYEiQM1VCyaHDYQpejChYZwy6LjPEakVX9Ni1QoFi\n\nTrecho do documentário \"O Respeitado Camarada Kim Jong Il é um Grande Pensador e Teórico\" (2000), sobre o Dirigente [Kim Jong Il](https://everipedia.org/wiki/lang_en/Kim_Jong-il), sucessor de seu pai, [Kim Il Sung](https://everipedia.org/wiki/lang_en/Kim_Il-sung), na liderança da República Popular Democrática da Coreia (Coreia do Norte).\n\n- Fonte: https://invidio.us/XNYl7PJ2nHE",
				"added": 1595959899
			},
			{
				"comment_id": 41,
				"body": "#Por que os testemunhos de desertores da Coréia do Norte se desintegram com tanta frequência?\n\n- Incentivos em dinheiro e o apetite interminável da mídia ocidental por histórias chocantes incentivam os refugiados a exagerar, argumenta [Jiyoung Song](https://web.archive.org/web/20160721122832/http://www.nknews.org/2015/09/why-some-n-korean-defectors-stories-fall-apart/)\n\nCom o fluxo de informações da Coréia do Norte ferozmente controlado, pessoas de fora contam com testemunhos de desertores há muito tempo para entender o que se passa dentro do estado secreto.\n\nMas confiar nas histórias de indivíduos - todos com visões e experiências diferentes - também pode ser arriscado.\n\nEm um relatório divulgado no ano passado, a ONU [acusou o líder norte-coreano Kim Jong-un](https://web.archive.org/web/20200718074617/http://www.ohchr.org/EN/HRBodies/HRC/CoIDPRK/Pages/ReportoftheCommissionofInquiryDPRK.aspx) de crimes contra a humanidade e pediu que o caso fosse encaminhado ao tribunal criminal internacional.\n\nOs investigadores da ONU tiveram acesso negado ao país, então a organização realizou 240 entrevistas confidenciais com refugiados norte-coreanos que vivem na Coréia do Sul, Japão, Reino Unido e EUA, incluindo Shin Dong-hyuk, cuja história foi contada no best-seller [Fuja do Acampamento 14](https://web.archive.org/web/20200703220901/http://www.theguardian.com/books/2012/apr/13/escape-camp-14-korea-harden-review).\n\nEm janeiro, o governo da RPDC [divulgou um vídeo alegando mostrar](https://siasky.net/AAAm5yzqxbRdfONBPsXzzMLsSWWF3AqynNiRjXmb0F_bIw) o pai de Shin denunciando as histórias de seu filho como falsas. Quando questionado, Shin [confessou que partes de sua conta](https://web.archive.org/web/20200701150902/http://www.theguardian.com/world/2015/jan/19/north-korea-defector-change-story-shin-dong-hyuk) também eram imprecisas, incluindo seções sobre seu tempo no acampamento 14, o infame campo de trabalho para prisioneiros políticos e a idade em que ele foi torturado.\n\nShin não está sozinho. Outro norte-coreano, Lee Soon-ok, prestou depoimento à Câmara dos Deputados dos EUA em 2004, descrevendo tortura e assassinato de cristãos em líquido quente de ferro em uma prisão política norte-coreana.\n\n\nMas o testemunho de Lee foi contestado por Chang In-suk, então chefe da Associação de Defensores da Coreia do Norte em Seul, que alegou saber em primeira mão que Lee nunca havia sido preso político. Muitos ex-cidadãos da RPDC no [site NKnet](http://www.nknet.org/index.php) concordaram que é improvável que as contas de Lee sejam verdadeiras.\n\nDa mesma forma, Kwon Hyuk disse ao Congresso dos EUA que era oficial de inteligência da embaixada da RPDC em Pequim e havia testemunhado experiências humanas em prisões políticas - um fator crítico na decisão dos EUA de aprovar a Lei de Direitos Humanos da Coréia do Norte em 2004.\n\nA conta de Kwon, [recontada em um documentário da BBC](https://web.archive.org/web/20200715213836/http://www.theguardian.com/world/2004/feb/01/northkorea) em 2004, foi posteriormente [questionada pela agência de notícias Yonhap da Coréia do Sul](https://web.archive.org/web/20150916115205/http://www.mediatoday.co.kr/news/articleView.html?idxno=25579), que argumentou que ele nunca teve acesso a essas informações. Muitos anos depois, Kwon desapareceu dos olhos do público.\n\nEmbora não haja dúvida de que o regime norte-coreano cometeu sérios abusos dos direitos humanos, há perguntas a serem feitas sobre o quanto os estrangeiros devem confiar nos depoimentos dos desertores como evidência credível.\n\nTenho entrevistado norte-coreanos como observador da RPDC e pesquisador de direitos humanos desde 1999. O que descobri sugere que existem sérios dilemas éticos na maneira como coletamos informações.\n\n#O que está por trás das inconsistências?\n\nPagamentos em dinheiro em troca de entrevistas com refugiados norte-coreanos têm sido uma prática padrão no campo há anos.\n\nInicialmente, o pagamento era para cobrir o custo das refeições e do transporte local, que era de aproximadamente US $ 30 no final dos anos 90, quando comecei a entrevistar na China e na Coréia do Sul. No entanto, as taxas haviam aumentado para US $ 200 por hora quando tentei entrevistar pessoas da Coréia do Norte em maio de 2014.\n\nUm funcionário do governo do ministério sul-coreano de unificação me disse que a faixa de taxas pode variar bastante, de US $ 50 a 500 por hora, dependendo da qualidade das informações.\n\nMas essa prática levanta uma dificuldade: como o pagamento muda a relação entre um pesquisador e um entrevistado e que efeito isso terá sobre a própria história?\n\nEssa prática também impulsiona a demanda por “histórias vendáveis”: quanto mais exclusivas, chocantes ou emocionais, maior a taxa.\n\nShin, filho de um prisioneiro político, sem dúvida teve um momento horrível dentro do país, e acredita-se ser o único prisioneiro a ter escapado com sucesso do campo de internação da \"zona de controle total\".\n\nApós sua fuga, ele conheceu o ex-presidente dos EUA George W. Bush, e sua história foi transformada em um documentário. Embora partes de sua história tenham sido contestadas por contra-testemunhos e contradições, o poder da curiosidade do Ocidente e o desejo da mídia por uma boa história não podem ser superestimados.\n\nOs refugiados norte-coreanos ficaram bem cientes do que o entrevistador deseja ouvir. Seja falando na ONU, no Congresso dos EUA ou na mídia ocidental, as perguntas são as mesmas todas as vezes: por que você deixou a Coréia do Norte e quão terrível é?\n\nCom o número de desertores atingindo 20.000 em 2010, os testemunhos em primeira pessoa tornaram-se a norma e passaram a envolver cada vez mais vítimas mais jovens com relatos mais trágicos, dramáticos, visuais e emocionais.\n\nIsso levanta outra questão, porque, na minha experiência, as entrevistas individuais tendem a gerar histórias mais exageradas. Embora existam maneiras de confirmar informações por meio de interrogatório e consultando várias fontes, esses métodos consomem muito tempo, enquanto uma quantidade significativa das informações divulgadas por uma única fonte é simplesmente inverificável, dada a natureza ferozmente secreta da RPDC.\n\n#Pressão\n\nNos meus 16 anos estudando refugiados norte-coreanos, experimentei inúmeras histórias inconsistentes, algumas omissões intencionais e, ocasionalmente, algumas mentiras. Em um caso, a quebra de confiança foi tão significativa que não pude continuar minha pesquisa - não apenas porque afetou minha capacidade profissional de analisar e fornecer histórias confiáveis ​​de maneira ética, mas também porque teve um profundo impacto na confiança pessoal que eu tinha. tinha investido em assuntos com os quais sinceramente me importava.\n\nMas muitos refugiados dizem que se sentem pressionados por histórias de desertores. Ahn Myung-chol, ex-agente penitenciário do Campo 22, disse que as pessoas gostam de histórias chocantes e que os chamados \"ativistas desertores\" estavam apenas respondendo a esse desejo. Chong Kwang-il, ex-prisioneiro do Campo 15, disse que a fama provocada pela exposição na mídia os prendeu, forçando-os a reproduzir uma certa narrativa.\n\nChoi Sung-chol, da Associação Nacional de Moradores da Nacionalidade da Coréia, disse que a linha entre pequenas e grandes inconsistências é difícil de traçar: “A maioria dos norte-coreanos não se preocupa com pequenos erros de fato, desde que o quadro geral de que a Coréia do Norte viole os direitos humanos seja grande. certo.\"\n\nChoi acrescentou: \"Nós, norte-coreanos, sabemos o que é verdade e o que é falso, mas, ao mesmo tempo, não queremos arruinar os movimentos políticos maiores, como o comitê de investigação da ONU ou a Lei de Direitos Humanos dos EUA\".\n\n- Fonte: https://www.theguardian.com/world/2015/oct/13/why-do-north-korean-defector-testimonies-so-often-fall-apart",
				"added": 1595963217
			},
			{
				"comment_id": 42,
				"body": "#Desertores norte-coreanos recebem 860 mil dólares para mentir\n- https://ipfs.infura.io/ipfs/QmRHE35ToN566MYNy1Y63S6kF2JmbJ3c2sywmrCuo5XbkG\n\n\"Desertores\" norte-coreanos recebem 860 mil dólares do governo da Coreia do Sul para mentir sobre a vida na Coreia do Norte. Os grandes jornais internacionais também pagam para que eles contem histórias surreais em entrevistas exclusivas, para ganhar audiência com base em mentiras absurdas e que ninguém acreditaria se fossem sobre qualquer outro país. Mas alimentam a indústria de propaganda contra a Coreia do Norte.\n\n- Fonte: https://invidio.us/BS1fUKzGwQc",
				"added": 1595964274
			},
			{
				"comment_id": 43,
				"body": "#Conheça a farsa da \"refugiada\" norte-coreana!\n- https://ipfs.infura.io/ipfs/QmewXjiwiidN7M7nfJqhYjTXqGZ66zDJBxoDAy2W43HJFf\n\nNão é de hoje que a mídia ocidental nos enche de propaganda anti-comunista. Essa é [Yeonmi Park](https://everipedia.org/wiki/lang_en/Park_Yeon-mi), e ficou conhecida por ser uma refugiada norte-coreana, porém dentre tantas entrevistas, ela entra em diversas contradições em seus discursos.\n\n- Fonte: https://invidio.us/g2WPT0OEuHc",
				"added": 1595964467
			},
			{
				"comment_id": 44,
				"body": "#A manipulação sobre o caso do soldado desertor norte-coreano\n- https://siasky.net/AADi8fwOioQlsN4W6XJY55cbPhn_jBO4qjpoy1tHA7LRDg\n\nUma pequena análise crítica sobre o caso do soldado que desertou da Coreia do Norte para a Coreia do Sul na metade de novembro. A imprensa internacional, mais uma vez, utilizou o acontecimento para demonizar o país socialista, transmitindo uma notícia enviesada, manipulada, distorcida e descontextualizada. Nunca se fala, por exemplo, dos sul-coreanos e estadunidenses que tentam ir para a Coreia do Norte mas são impedidos por seus governos, inclusive com pena capital. Nem mesmo que a Coreia do Sul oferece quase 1 milhão de dólares para quem fugir da Coreia do Norte e contar mentiras sobre o país.\n\nPS: Dois meses após a fuga, o soldado desertor admitiu ter cometido assassinato enquanto vivia na Coreia do Norte: https://archive.today/2020.05.02-013111/https://noticias.uol.com.br/ultimas-noticias/afp/2018/01/23/soldado-norte-coreano-que-desertou-em-novembro-cometeu-assassinato.htm?utm_source=facebook.com&utm_medium=social&utm_campaign=fb-noticias&utm_content=geral",
				"added": 1595965533
			},
			{
				"comment_id": 45,
				"body": "#A zona rural da Coreia do Norte\n- https://siasky.net/AACuW68vFeNuNFZZlglHbRiO-TSPliFlufFMFNpwgOuuQQ\n\nDocumentário sobre as zonas rurais da República Popular Democrática da Coreia (Coreia do Norte). O vídeo explica a formação e desenvolvimento do campo na RPDC desde sua independência, em 1945. Mostra a importância da agricultura para o país, bem como o funcionamento da estrutura rural, a crise sobre a economia agrícola na década de 1990 e como é a vida e o trabalho dos camponeses no interior da RPDC.\n\n#Fontes das informações e dados apresentados no vídeo:\n\n- https://web.archive.org/web/20180606194448/https://creandopueblo.files.wordpress.com/2011/09/lacuestionagrariaencoreadelnorte1945e280931965.pdf\n\n- https://web.archive.org/web/20180606194529/https://creandopueblo.files.wordpress.com/2011/09/lacuestionagrariaencoreadelnorte1964e28093los90.pdf\n\n- https://web.archive.org/web/20180606194452/https://creandopueblo.files.wordpress.com/2011/09/lacuestionagrariaencoreadelnortecrisisdelos90.pdf\n\n- https://drive.google.com/drive/folders/0B5aXB074TCjIZ21PUHVQV0ZEX0k\n\n- https://web.archive.org/web/20200502010133/https://www.novacultura.info/single-post/2017/05/02/Relatorio-de-uma-viagem-a-Republica-Popular-Democratica-da-Coreia\n\n- https://web.archive.org/web/20161010085435/http://solidariedadecoreiapopular.blogspot.com.br/2012/05/comite-petropolis-em-luta-entrevista.html\n\n- https://web.archive.org/web/20200502010810/https://vermelho.org.br/coluna/viagem-a-coreia-do-norte-o-estado-da-economia/\n\n- https://web.archive.org/web/20200503235225/http://depyongyangalahabana.blogspot.com/2013/01/zonas-rurales-de-corea-del-norte.html\n\n- https://web.archive.org/web/20170906064857/http://republicademocraticapopulardacoreia.blogspot.com.br/2009/02/vida-rural.html\n\n- https://web.archive.org/web/20200502011459/http://solidariedadecoreiapopular.blogspot.com/2016/11/recentes-desastres-naturais-exigem-solidariedade-do-povo-brasileiro-a-coreia-popular.html\n\n- https://web.archive.org/web/20200622120418/https://www.globalresearch.ca/amnesty-international-is-us-state-department-propaganda/32444\n\n- https://web.archive.org/web/20200508110756/http://www.bbc.com/mundo/internacional/2010/07/100716_oms_critica_informe_salud_corea_norte_lr.shtml\n\n#Fonte: https://invidio.us/7_7DgHCCcHU",
				"added": 1595969063
			},
			{
				"comment_id": 46,
				"body": "#Religião na Coreia do Norte: a verdade\n- https://siasky.net/AABgWNkWn-qSYl4pAl76cSvHchQ32dBWgrg-S6K_U81lSA\n\nA religião é um dos muitos temas que a mídia capitalista controlada pelo imperialismo americano usa para atacar e satanizar a Coreia do Norte. Neste vídeo mostramos a verdade sobre a religião na RPDC: não há perseguição e existem mais vertentes religiosas do que se imagina (existem cristão católicos, protestantes e ortodoxos no país, por exemplo). Mostramos depoimentos dos próprios líderes religiosos norte-coreanos, em entrevistas concedidas à imprensa dos EUA.\n\n#Vídeos originais, para quem quiser conferir:\n\n- Depoimento à Associated Press: https://siasky.net/AABQw5DrzcVShVZcHwTGuF1opLa3VYso8ZryYh8afxbwbA\n- Depoimento à Voice of America: https://siasky.net/AACK2c4bNaGx4cFviHQlhOKjfnUKAtwn0S7g26rQpyHf_A\n\n#Fonte: https://invidio.us/DmuQnNchUyY",
				"added": 1595972135
			},
			{
				"comment_id": 47,
				"body": "#Lançado livro virtual gratuito de KIM IL SUNG sobre a Guerra da Coreia\n\nEm comemoração aos 67 anos da Vitória na [Guerra de Libertação da Pátria](https://web.archive.org/web/20200728214303/https://cepsongunbr.com/2020/07/27/27-de-julho-o-dia-da-vitoria-na-coreia-do-norte-mas-que-vitoria/), a Associação Brasileira de Amizade com a Coreia ([KFA-BR](https://www.facebook.com/KFA.Brasil/?epa=SEARCH_BOX)) traduziu uma importante obra do Generalíssimo Kim Il Sung para o português.\n\nO livro «Para lograr a vitória na Guerra de Libertação da Pátria rechaçando a invasão armada dos imperialistas estadunidenses» é um conjunto de textos, documentos, ordens e escritos de Kim Il Sung durante o período da guerra contra a agressão promovida pelos EUA na Coreia.\n\n\nO livro inclui quase 200 páginas de rico material inédito em português que dão a dimensão da organização político-militar do povo coreano durante os árduos anos da guerra.\n\nVocê pode ler o livro gratuitamente [clicando aqui](https://ipfs.infura.io/ipfs/QmWN7ZgQYEr3xcL8aR8TnjnyWt6E7MDQwFjQukSqNExrbk).\n\n- Fonte: https://cepsongunbr.com/2020/07/27/lancado-livro-virtual-gratuito-de-kim-il-sung-sobre-a-guerra-da-coreia/",
				"added": 1595973113
			},
			{
				"comment_id": 48,
				"body": "#Coreia: Uma viagem ao Norte do Paralelo 38 - documentário\n\n- https://siasky.net/AAC6RrBwKcxgP4JSVuEDr5gGp2vtKte3ZQf3sKywR6XZAQ\n\nDocumentário do canal HispanTV mostra diversas facetas da República Popular Democrática da Coreia, a Coreia do Norte. Sua sociedade, sua ideologia, história, o cotidiano da população, locais dentro e fora de Pyongyang, educação, saúde.\n\n- Fonte: https://invidio.us/PogDrnm7S1Y",
				"added": 1595977997
			},
			{
				"comment_id": 49,
				"body": "#A educação na Coreia do Norte\n\n- https://siasky.net/AADokI47R772K1JrfR0oWPbBDe7o0B1P1nGovZ8ylF3EcA\n\nReportagem de Ali Gudarzi, da HispanTV, sobre a educação na Coreia do Norte. A taxa de alfabetização é de 100% desde 1949. O sistema educacional do país segue estritamente uma das metas mais importantes da Unesco, que é a oferta de 12 anos de educação pública, gratuita e de qualidade para os estudantes. Além disso, o ensino universitário também é gratuito.\n\nA educação na Coreia do Norte não consiste apenas no ensino dentro das salas de aula. Em todas as cidades existem os chamados \"Palácios das Crianças\", locais em que são realizadas atividades extra-escolares, especialmente atividades culturais e artísticas. Outros locais, como bibliotecas e museus, também estão presentes na vida cotidiana dos jovens norte-coreanos.\n\n- Fonte: https://invidio.us/oYPX2Fa7sSY",
				"added": 1595981477
			},
			{
				"comment_id": 50,
				"body": "#O sistema de saúde na Coreia do Norte\n\n- https://siasky.net/AABaERy-ni85Hag8CHx4S_23q-OLRtomr9z4ZYkJ6Rdchw\n\nEsta reportagem do canal iraniano HispanTV mostra como é o sistema de saúde da Coreia do Norte. No país socialista, a saúde é pública e gratuita para toda a população e, apesar das sanções da ONU a afetarem, os norte-coreanos continuam em seu desenvolvimento.\n\nA atenção médica gratuita foi estabelecida na Coreia do Norte em 1947 e seu sistema de saúde gratuito foi totalmente estabelecido em 1960. Não faltam médicos em nenhum povoado do país. Em 2010, por exemplo, a RPDC foi o terceiro país no mundo com o maior número de camas de hospital por habitante, segundo a Organização Mundial da Saúde (OMS).\n\n- Fonte: https://invidio.us/qCEmYyFLqbk",
				"added": 1595981600
			},
			{
				"comment_id": 51,
				"body": "#Os direitos humanos na Coreia do Norte\n- https://siasky.net/AADxxhoBJQtI3LPBO0LBOz0-UzCE25sxXbIg5a83qHHdrQ\n\nOs direitos humanos são respeitados na Coreia do Norte mais do que em qualquer país capitalista.\n\n- Fonte: https://invidio.us/YFe3HbA20xY",
				"added": 1595981702
			},
			{
				"comment_id": 52,
				"body": "#A Coreia do Norte é uma ditadura?\nhttps://web.archive.org/web/20200423204738/https://cepsongunbr.wordpress.com/2020/03/27/a-coreia-do-norte-e-uma-ditadura/\n\n#A Coreia do Norte é uma monarquia?\nhttps://web.archive.org/web/20200422122822/https://cepsongunbr.wordpress.com/2020/03/27/a-coreia-do-norte-e-uma-monarquia/\n\n#Como funcionam as eleições na Coreia do Norte?\nhttps://web.archive.org/web/20200424192705/https://cepsongunbr.wordpress.com/2019/03/09/entenda-como-funcionam-as-eleicoes-na-coreia-do-norte/\n\n#Coreia: Ditadura x Democracia (2011)\nhttps://web.archive.org/web/20200614211626/http://solidariedadecoreiapopular.blogspot.com/2011/08/coreia-ditadura-x-democracia.html\n\n#Informações básicas sobre a RPDC\nhttps://ipfs.infura.io/ipfs/QmYGXFS4dGRQyY95TXwPLccWZG4ckqf8A5S16RfHah2UFn\n\n#O Cristianismo na Coreia do Norte\nhttps://web.archive.org/web/20200424142806/https://cepsongunbr.wordpress.com/2019/09/17/o-cristianismo-na-coreia-do-norte/\n\n#Indicações de obras escritas pelos Líderes da RPDC\nhttps://web.archive.org/web/20200614211231/https://solidariedadecoreiapopular.blogspot.com/p/obras.html\n\n#Por que o povo coreano está armado?\nhttps://web.archive.org/web/20200614223405/https://www.facebook.com/KFA.Brasil/posts/2637648752985297\n\n#Só existe uma Coreia!\nhttps://web.archive.org/web/20200614223654/https://www.jornalapatria.com/post/s%C3%B3-existe-uma-coreia-por-matheus-novaes\n\n#Como o bombardeamento mais mortal da história mundial criou a atual crise na Coreia\nhttps://web.archive.org/web/20200614224006/https://www.jornalapatria.com/post/estado-de-medo-como-o-bombardeameto-mais-mortal-da-hist%C3%B3ria-mundial-criou-a-atual-crise-na-coreia\n\n#Os melhores sites para conhecer a arte da Coreia do Norte\nhttps://web.archive.org/web/20200620123522/https://cepsongunbr.com/2020/05/06/os-melhores-sites-para-conhecer-a-arte-da-coreia-do-norte/",
				"added": 1595984126
			},
			{
				"comment_id": 58,
				"body": "#Diário de viagem: Coreia do Norte\n- https://siasky.net/AACzok9FvijbFlYEsUOUzJ_I5vlnWbInMrw9JEirY3YRjg\n\n\"Não, não foi o Filipe nem o Geraldo quem viajou, e nem foi pra Cuba, como muitos nos mandaram! Conversamos com o Paulo Ferracioli (FGV), que volta ao podcast para falar de sua experiência em primeira mão na Coreia do Norte. O Paulo contou sobre sua viagem ao país e relata o que viu em suas andanças pela melhor Coréia. Entenda como a filosofia Juche se manifesta na prática naquela sociedade, seus dilemas de segurança e relação com o Estado. E descubra o que são os rádios que estão sempre ligados por lá. Dica: não estão tocando podcast.\"\n\n#Fonte: https://chutandoaescada.com.br/2018/11/27/chute-084/",
				"added": 1596128583
			},
			{
				"comment_id": 64,
				"body": "#Leia a Constituição da Coreia do Norte em português\n\nO Centro de Estudos da Política Songun do Brasil e a Associação de Amizade com a Coreia do Brasil traduziram em conjunto a versão mais recente da Constituição socialista da República Popular Democrática da Coreia para o português, visando popularizar materiais de estudo sobre esse país no Brasil e no mundo lusófono.\n\nVocê pode acessar e baixar gratuitamente o documento [clicando aqui](https://ipfs.infura.io/ipfs/QmbFyg61pKmykGuymcCAfXA7k6jvPwtDcUvG2bMiCnLRjE).\n\n- Fonte: https://cepsongunbr.com/2020/07/29/leia-a-constituicao-da-coreia-do-norte-em-portugues/",
				"added": 1596297681
			},
			{
				"comment_id": 65,
				"body": "#Coreia do Norte mostra como se lida com o imperialismo\n\nA Coreia do Norte é um país totalmente militarizado. Isso não é mentira da imprensa capitalista. A questão é: por que o país investe tanto em seu desenvolvimento bélico? É aí que chegamos no mar de desinformação e manipulação diária dos meios de comunicação a serviço dos interesses dos Estados Unidos.\n\nA República Popular Democrática da Coreia é uma pequena nação, menor do que o estado do [Amapá](https://pt.wikipedia.org/wiki/Amap%C3%A1), localizada no extremo leste asiático cuja população é de pouco mais de 25 milhões de pessoas. Se encontra na metade norte da Península Coreana. Seria esse país uma ameaça à paz mundial? Claro que não.\n\nPrimeiro, porque o mundo não está em paz, não existe paz em nenhuma parte do mundo. Quem vê o discurso dos EUA sobre a Coreia do Norte reproduzido por seus porta-vozes da imprensa golpista nacional e da imprensa imperialista acredita que o mundo é um paraíso e está em perigo devido às ameaças de um gorducho maníaco. Pelo contrário: o imperialismo estadunidense é quem agride e destrói o mundo. Se a maior ameaça fosse a Coreia do Norte, o mundo estaria em paz.\n\nOs EUA detêm 6.800 ogivas nucleares! Mais de 200 armas nucleares estadunidenses estão estrategicamente localizadas em outros países [1]. São os EUA que mantêm cerca de 800 bases militares pelo mundo, com pelo menos 150 mil efetivos que podem atacar qualquer ponto do planeta em questão de minutos; que jogam 70 mil bombas por ano sobre o Oriente Médio; que têm a maior presença militar inclusive no Mar do Japão [2]. E é justamente no Japão onde os EUA têm o maior número de tropas (39.345), espalhadas por 112 bases, desde o final da II Guerra Mundial. A terceira maior colônia militar dos EUA é exatamente a Coreia do Sul, com 23.468 tropas estadunidenses em 83 bases [3].\n\nComo clara provocação à Coreia do Norte, os Estados Unidos realizam desde 1955 manobras militares “conjuntas” com Seul na fronteira com o Norte [4]. Este ano, já foram realizados dois grandes exercícios militares. No encerramento do último deles, dois bombardeios norte-americanos com capacidade nuclear sobrevoaram a Península [5]. Os EUA enviam porta-aviões, com igual capacidade nuclear, para as portas do isolado país [6] e instalaram recentemente o sistema antimísseis THAAD no norte da Coreia do Sul, outra clara ameaça à Coreia do Norte (e também à China), mas também à própria população sul-coreana [7].\n\nEssa corrida armamentista dos EUA no leste asiático supostamente contra a ameaça norte-coreana tem um objetivo muito mais oculto. Ainda que não haja uma guerra contra a Coreia do Norte, nada disso está sendo feito em vão. Primeiro, porque marca a posição estadunidense em uma disputa geoestratégica com a China. Mas principalmente porque movimenta todo o motor da economia imperialista dos EUA, que é o seu complexo militar-industrial. O envio de modernos equipamentos para a região, aparelhos de última geração, gera uma soma inimaginável de lucro para os grandes capitalistas, que fabricam e vendem as armas para o governo dos EUA (que é controlado por eles) e obrigam seus regimes-fantoches de toda a região a comprar esses armamentos para alegadamente “se protegerem das hostilidades” da “ditadura” de Kim Jong Un.\n\nA Coreia do Norte está completamente cercada por regimes capachos do imperialismo estadunidense, sufocada economicamente, com todas as mais sofisticadas armas de aniquilamento apontadas para seu povo, com ameaças diárias de que irá ser destruída, com a presença da maior potência assassina da história da humanidade – os EUA – bem ao lado. O próprio Kim Jong Un sofreu recentemente ameaças de morte da CIA [8] e do governo sul-coreano, que declarou publicamente que pretende decapitá-lo [9]. É Pyongyang o agressor?\n\nPortanto, a Coreia do Norte não se arma até os dentes para atacar ninguém, como fazem os EUA. Ela se arma para se defender da barbárie imperialista. A RPDC se arma para evitar que suas escassas, mas importantes, riquezas naturais, sejam entregues aos grandes capitalistas. Se arma para evitar que as multinacionais entrem no país para saquearem tudo e explorarem os trabalhadores norte-coreanos. Se arma para que não haja um golpe de Estado, para não se transformar em um bordel do imperialismo como era antes da Revolução Coreana de 1945.\n\nOs norte-coreanos não têm memória fraca. Sabem que seus avós sofreram graves atrocidades nas mãos dos imperialistas japoneses durante a ocupação, na primeira metade do século XX. E sabem que o país conquistou sua soberania na marra. Sabem que os EUA não permitiram e invadiram o sul da Península, instalando um regime fantoche que dura até hoje. Sabem que os EUA, para impedir a reunificação do país, despejaram mais bombas sobre a Coreia do Norte durante a Guerra da Coreia (1950-1953) do que haviam despejado em todo o Pacífico durante a II Guerra Mundial, incluindo mais de 30 mil toneladas de napalm [10]. Sabem que quase três milhões de pessoas perderam a vida naquela agressão imperialista, a maioria delas norte-coreanas. Sabem que seu país perdeu quase um terço da população que tinha [11]. Sabem também que os EUA ordenaram o massacre em massa de civis [12] e que quase utilizaram a bomba atômica naquela intervenção genocida [13].\n\nApós a devastação provocada pelo imperialismo estadunidense, com total apoio da mesma ONU que hoje chama a Coreia de Norte de inimiga da paz, começaram as sanções. Elas não vêm de hoje. Assim como Cuba, a parte norte da Coreia sempre foi um país bloqueado. Enquanto existiu a União Soviética e os sistemas da chamada “Cortina de Ferro”, ela ainda pôde contar com alguma parceria. Depois disso, sofreu novamente com um brutal isolamento, aumento das sanções e catástrofes naturais que destruíram a maior parte das colheitas e parte de sua infraestrutura, causando sérias mazelas sociais durante os anos 90.\n\nFoi a época mais dura para o país em quase 50 anos. O cerco imperialista asfixiou a Coreia do Norte, que teve de arrumar uma maneira para não ser vítima do ataque final: a destruição de sua soberania e de seu sistema, que, apesar de tudo, garante o atendimento de todas as necessidades básicas de sua população, como educação, saúde, moradia e segurança. O país teve de desenvolver mecanismos de dissuasão, teve de se armar à altura de seus agressores, fabricando armas nucleares e focando grande parte de seus recursos nas forças armadas (política conhecida como Songun, que significa justamente “o exército em primeiro lugar”).\n\nIsso aconteceu também porque o governo norte-coreano viu o que ocorria ao redor do mundo. Após a chamada “Guerra Fria” (na verdade, tentativa de asfixia do imperialismo para derrubar a URSS), o imperialismo não deteu seus ataques. Arranjou novos inimigos. Destruiu muitos países mais, sendo os casos recentes mais conhecidos as invasões do Iraque, do Afeganistão, da Líbia e da Síria. Em alguns desses casos, como o Iraque e a Líbia, seus governos caíram no canto da sereia de que, se abandonassem seus programas nucleares, não sofreriam qualquer ameaça. Pelo contrário, a Coreia do Norte viu que esses dois países foram completamente destruídos, suas populações massacradas, seus líderes assassinados, seu território dividido, suas riquezas assaltadas. A Coreia do Norte não quer sofrer esse destino.\n\nTodos os testes de mísseis, todos os lançamentos de foguetes, todas as bombas desenvolvidas e toda a força demonstrada nas suas paradas militares, além de toda a retórica de advertência são claros avisos aos imperialistas de que a Coreia do Norte vai defender sua soberania e suas conquistas até o fim. É muito improvável que os EUA tentem se aventurar contra um país que se mostrou mais preparado para se defender do que qualquer outro exemplo recente. Até porque uma nova guerra da Coreia teria uma magnitude infinitamente maior do que a primeira. Envolveria o mundo todo e poderia desencadear uma terceira guerra mundial, senão uma guerra nuclear nunca antes vista que destruiria boa parte do mundo como o conhecemos. A Coreia poderia até mesmo ser varrida do mapa, mas uma coisa ela garante: pelo menos um soco na cara (e bem dado) dos EUA ela daria. Acho que os EUA não querem isso, porque seria uma gigantesca humilhação.\n\nO povo norte-coreano, ao contrário do propaga(ndea)do pela mídia terrorista a serviço do imperialismo, está consciente de que é preciso defender o seu país. Em agosto, impressionantes 3,5 milhões de pessoas buscaram se alistar nas forças armadas para defender a RPDC dos agressores ianques [14]. E na semana seguinte à declaração pública de Kim Jong Un respondendo às ameaças de Trump, nada menos que 4,7 milhões de estudantes e trabalhadores se voluntariaram para ingressar nas fileiras militares, incluindo 1,2 milhões de mulheres [15]. Esse não é um país que se ajoelhará para o saque imperialista.\n\n#NOTAS:\n\n[1] https://web.archive.org/web/20181014215459/https://noticias.uol.com.br/internacional/ultimas-noticias/2017/08/10/qual-e-o-arsenal-nuclear-dos-eua-que-trump-se-gaba-ao-ameacar-os-coreanos.htm\n\n[2] https://web.archive.org/web/20181014215451/https://www.abc.es/internacional/abci-inmensa-militar-estados-unidos-domina-mundo-201704171957_noticia.html\n\n[3] https://web.archive.org/web/20181014215455/https://www.theguardian.com/us-news/2017/aug/09/what-is-the-us-militarys-presence-in-south-east-asia\n\n[4] https://web.archive.org/web/20181014215459/https://www.38north.org/2014/02/rcollins022714/\n\n[5] https://web.archive.org/web/20181014215450/https://noticias.uol.com.br/ultimas-noticias/reuters/2017/08/31/bombardeiros-dos-eua-sobrevoam-peninsula-coreana-em-reacao-a-missil-norte-coreano.htm?utm_source=facebook.com&utm_medium=social&utm_campaign=fb-noticias&utm_content=geral\n\n[6] https://web.archive.org/web/20181014215453/https://brasil.elpais.com/brasil/2017/04/29/internacional/1493483830_392354.html\n\n[7] https://web.archive.org/web/20181014215450/https://www.telegraph.co.uk/news/0/thaad-south-koreas-best-defence-against-missile-attack/\n\n[8] https://web.archive.org/web/20181014215454/https://edition.cnn.com/2017/07/20/politics/cia-mike-pompeo-north-korea/index.html\n\n[9] https://web.archive.org/web/20181014215456/https://www.nytimes.com/2017/09/12/world/asia/north-south-korea-decapitation-.html\n\n[10] https://web.archive.org/web/20181014215502/https://apjjf.org/-Charles-K.-Armstrong/3460/article.html\n\n[11] https://web.archive.org/web/20181214055751/http://www.globalresearch.ca/north-korea-their-health-system-sucks-do-they-have-schools-and-hospitals-in-america-weve-got-medicare/5604293\n\n[12] https://web.archive.org/web/20181014215456/https://www.cbsnews.com/news/report-korean-war-era-massacre-was-policy/\n\n[13] https://web.archive.org/web/20181014215456/https://thediplomat.com/2016/01/what-if-the-united-states-had-used-the-bomb-in-korea/#!/web/20181014215456mp_/https://thediplomat.com/\n\n[14] https://web.archive.org/web/20170821200132/https://www.msn.com/pt-br/noticias/mundo/mais-de-3-milh%C3%B5es-de-norte-coreanos-desejam-se-alistar-para-lutar-contra-eua/ar-AApUrCv\n\n[15] https://web.archive.org/web/20181014215459/http://english.yonhapnews.co.kr/news/2017/09/28/0200000000AEN20170928005700315.html\n\n- Fonte: https://web.archive.org/web/20181014213814/https://www.causaoperaria.org.br/acervo/blog/2017/10/02/coreia-do-norte-mostra-como-se-lida-com-o-imperialismo/",
				"added": 1596300731
			}
		],
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 66,
				"body": "#Como se faz uma bomba atômica, por José Goldemberg. Instituto de Física da USP.\nhttps://ipfs.infura.io/ipfs/QmPnvyDHM1FMcpoDZR56B8RHVN6dUgEQjPgFR9Yy5iF7Sv",
				"added": 1596301521
			},
			{
				"comment_id": 67,
				"body": "#Espuma metálica supera todas as blindagens de aço\n\nColetes e escudos feitos com uma espuma de aço inoxidável poderão bloquear projéteis e estilhaços viajando a até 1.500 metros por segundo (5.400 km/h), ejetados de uma detonação a apenas 45 centímetros de distância.\n\nAs espumas metálicas são fabricadas criando um grande número de poros, de diversos tamanhos, no metal base, gerando um material de baixa densidade e, portanto, muito mais leve do que o metal original.\n\nO experimento envolveu disparar um projétil explosivo e incendiário, de 23 x 152 milímetros (mm), em uma placa de alumínio de 2,3 mm de espessura. A 45 centímetros (cm) de distância, foram colocadas placas feitas com a espuma metálica, com 9,5 mm e 16,5 mm de espessura.\n\nOs escudos resistiram à onda de pressão da explosão e detiveram os fragmentos de cobre e aço criados pela própria explosão, bem como o alumínio da placa onde ocorreu a detonação.\n\nOs painéis das duas espessuras bloquearam a onda de choque. A espuma de 16,5 mm bloqueou todos os fragmentos, que mediam de 15 mm2 até mais de 150 mm2. A espuma de 9,5 mm deteve a maioria, mas não todos os fragmentos.\n\nExtrapolando esses resultados, uma chapa de espuma de aço de 10 mm seria suficiente para defender de todos os efeitos da explosão.\n\n\"Em resumo, descobrimos que a espuma compósita de aço inoxidável oferece muito mais proteção do que todos os materiais de blindagem existentes, ao mesmo tempo em que reduz o peso notavelmente,\" disse o professor Afsaneh Rabiei, da Universidade da Carolina do Norte, nos EUA. \"Podemos fornecer tanta proteção quanto uma blindagem de aço atual em uma fração do peso - ou fornecer muito mais proteção com o mesmo peso.\"\n\nAlém da proteção de veículos civis e militares, as espumas metálicas são promissoras para uso aeroespacial - já se sabia, por exemplo, que as [espumas de metal bloqueiam radiação gama, de nêutrons e raios X](https://web.archive.org/web/20171105205935/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=espuma-metalica-antirradiacao-gama-neutrons-raios-x&id=010170150721).\n\n#Artigo: [A study on blast and fragment resistance of composite metal foams through experimental and modeling approaches](https://ipfs.infura.io/ipfs/QmYqBKskfPiNYZiQM9FgXkUamhEBbvu6iFSmjj8Fbq19cT)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=espuma-metalica-supera-todas-blindagens-aco&id=010170180612",
				"added": 1596310294
			},
			{
				"comment_id": 68,
				"body": "#Construído primeiro protótipo de radar quântico\n\nFísicos do Instituto de Ciência e Tecnologia da Áustria construíram o primeiro protótipo de um radar que usa o entrelaçamento quântico como método de detecção de objetos à distância.\n\nEssa integração da mecânica quântica em equipamentos pode impactar significativamente as indústrias biomédica e de segurança.\n\nO entrelaçamento quântico - ou emaranhamento - é um fenômeno físico pelo qual duas partículas permanecem interconectadas, compartilhando características físicas, independentemente da distância entre elas.\n\nO novo tipo de tecnologia de detecção - chamada iluminação quântica de micro-ondas, mas mais conhecida como radar quântico - utiliza fótons de micro-ondas entrelaçados como método de detecção.\n\nO protótipo mostrou-se capaz de detectar objetos em ambientes térmicos \"barulhentos\", onde os sistemas de radar clássicos geralmente falham.\n\nComo funciona em temperaturas criogênicas, a exemplo de equipamentos como a tomografia, a tecnologia é vista como promissora principalmente para scanners de imagens biomédicas de potência ultrabaixa - o objeto a ser detectado pode estar em temperatura ambiente. Mas há também quem se arrisque a dizer que os [radares quânticos poderão anular a tecnologia dos aviões invisíveis](https://web.archive.org/web/20200603080438/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=radar-quantico&id=010170121220).\n\n#Como funciona o radar quântico\n\nO princípio de funcionamento do radar quântico é simples: Em vez de usar micro-ondas \"no atacado\", dois grupos de fótons, chamados de sinal e inativo, ou intermediário, são entrelaçados. Os fótons de sinal são enviados para o objeto de interesse, enquanto os fótons intermediários são medidos em relativo isolamento, livres de interferências e ruídos.\n\nQuando os fótons de sinal são refletidos pelo objeto, o entrelaçamento entre eles e os fótons inativos é perdido, mas uma pequena quantidade de correlação sobrevive, criando uma assinatura que descreve a existência ou a ausência do objeto, independentemente do ruído no ambiente. Ou seja, um grupo de fótons atinge o objeto, e as informações são lidas nos seus parceiros entrelaçados, que nunca vão até o objeto.\n\nO processo é basicamente o mesmo usado recentemente para criar uma [câmera quântica, que literalmente fotografa o que nunca visualizou](https://web.archive.org/web/20200426060810/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=camera-quantica&id=010110200416).\n\n\"O que nós demonstramos é uma prova de conceito para o radar quântico de micro-ondas,\" disse Shabir Barzanjeh, que já havia ajudado a desenvolver os [princípios teóricos da tecnologia de radar quântico](https://web.archive.org/web/20200603103657/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=radar-quantico-detecta-avioes-invisiveis&id=010110150302) em 2015. \"Usando o entrelaçamento gerado a alguns milésimos de grau acima do zero absoluto (-273,14 °C), conseguimos detectar objetos de baixa refletividade a temperatura ambiente\".\n\n\n#Vantagens do radar quântico\n\nEmbora o entrelaçamento quântico em si seja frágil por natureza, o radar quântico tem algumas vantagens sobre os radares clássicos convencionais.\n\nPor exemplo, em baixos níveis de energia, os sistemas de radar convencionais normalmente sofrem de baixa sensibilidade, tendo dificuldade em distinguir entre a radiação refletida pelo objeto e o ruído de fundo que ocorre naturalmente.\n\nA iluminação quântica oferece uma solução para esse problema, uma vez que as semelhanças entre o sinal e os fótons intermediários gerados pelo entrelaçamento quântico tornam mais eficaz distinguir os fótons de sinal (recebidos do objeto de interesse) do ruído gerado no ambiente.\n\n#Artigo: [Microwave quantum illumination using a digital receiver](https://ipfs.infura.io/ipfs/QmXnQrpFxTXEciM88zCGUcPPuwg8XdLhTpgcKqZaRWce21)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=radar-quantico-prototipo&id=010150200513",
				"added": 1596310910
			},
			{
				"comment_id": 69,
				"body": "#Pele eletrônica torna você invisível ao radar\n\nEngenheiros da Universidade do Estado de Iowa, nos EUA, desenvolveram uma \"meta-pele artificial\" que utiliza a tecnologia dos metamateriais e dos metais líquidos para capturar as ondas de radar e camuflar objetos, impedindo que eles sejam detectados.\n\nEsticando essa meta-pele flexível, é possível ajustá-la para reduzir a reflexão de uma vasta gama de frequências de radar.\n\nA meta-pele deve seu nome aos metamateriais, estruturas artificiais projetadas para apresentarem propriedades não encontradas na natureza e que podem manipular os mais diversos tipos de ondas. Seu produto mais conhecido são os mantos de invisibilidade.\n\n\"Portanto, esta tecnologia de meta-pele é diferente das tecnologias tradicionais de camuflagem, que normalmente só reduzem o retroespalhamento, isto é, a potência refletida de volta a um radar de sondagem,\" escreveram Siming Yang e seus colegas.\n\n#Pele antirradar\n\nO metamaterial flexível é formado por fileiras de anéis ressonadores incorporados dentro de folhas de silicone. Os ressonadores elétricos são preenchidos com galinstano, uma liga de metal que é líquida a temperatura ambiente e menos tóxica do que outros metais líquidos, como o mercúrio.\n\nCada anel tem um raio exterior de 2,5 milímetros e uma espessura de meio milímetro. Eles são postos nas folhas de silicone a um intervalo de 1 milímetro, essencialmente criando um painel de \"fios líquidos\".\n\nOs anéis funcionam como bobinas, e as lacunas entre eles funcionam como capacitores. Juntos, eles criam um ressonador que pode capturar e suprimir as ondas de radar em uma determinada frequência. Mas basta esticá-los para alterar suas propriedades elétricas, o que altera a frequência das ondas que eles capturam e suprimem.\n\n#Controle de frequências\n\nQuando um objeto é revestido com a meta-pele, as ondas de radar são inibidas em todas as direções incidentes e ângulos de observação. Os testes mostraram uma supressão das ondas de radar de 75% no intervalo de frequências de 8 a 10 gigahertz.\n\n\"Acredita-se que esta tecnologia de meta-pele vai encontrar muitas aplicações no controle, camuflagem e espalhamento de frequências eletromagnéticas,\" concluem os pesquisadores.\n\n#Artigo: [From Flexible and Stretchable Meta-Atom to Metamaterial: A Wearable Microwave Meta-Skin with Tunable Frequency Selective and Cloaking Effects](https://ipfs.infura.io/ipfs/QmagBQMuXmLsRprbVZ4Zd5TWk8QzugjLwqULsmnSo1ZpRk)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=pele-eletronica-torna-voce-invisivel-radar&id=010160160308",
				"added": 1596311252
			},
			{
				"comment_id": 101,
				"body": "#Bomba termobárica, a mais terrível das bombas\n- https://siasky.net/AADn3YAffPkUTgyMTvEwZjFCPNPNqbS3sfdsR7mDvP6VtQ\n\nA [arma termobárica](https://en.wikipedia.org/wiki/Thermobaric_weapon) é um tipo de explosivo que utiliza oxigênio do ar circundante para gerar uma intensa explosão de alta temperatura, e na prática a onda de explosão tipicamente produzida por uma tal arma é de uma duração significativamente mais longa do que a produzida por um explosivo condensado convencional.",
				"added": 1596853978
			},
			{
				"comment_id": 107,
				"body": "#A [bomba de nêutrons](https://en.wikipedia.org/wiki/Neutron_bomb)\nhttps://siasky.net/AAB1weC6HgMuay18Nq6zk76QX_Fph1AIStfJnGuK6iZ9SQ",
				"added": 1596854621
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 70,
				"body": "#Computação é feita na velocidade da luz - sem gastar energia\n\nNo início deste ano, o potencial impressionante dos metamateriais - muito além dos mantos de invisibilidade - foi demonstrado sem qualquer sombra de dúvida com a construção de um [dispositivo passivo que resolve equações usando luz - sem computador](https://web.archive.org/web/20200224091713/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=equacoes-resolvidas-na-hora-usando-luz-sem-computador&id=010160190403).\n\nAgora, uma equipe dos Países Baixos e dos EUA criou uma metassuperfície capaz de realizar operações matemáticas complexas de forma dinâmica, ou seja, não é mais necessário criar um metamaterial para cada cálculo que se deseja fazer.\n\nAlém disso, como a metassuperfície é transparente, ela pode ser usada diretamente em uma câmera digital, por exemplo, para executar cálculos necessários para reconhecer imagens em sistemas de vigilância ou de realidade virtual e aumentada.\n\n#Computação passiva\n\nAndrea Cordaro e seus colegas se concentraram em uma das técnicas mais utilizadas no processamento de imagens, a detecção de contornos, que é a base para a identificação de objetos em imagens.\n\nNormalmente, a detecção de contornos é realizada digitalmente usando circuitos eletrônicos integrados, o que implica limitações fundamentais de velocidade e alto consumo de energia, ou de maneira analógica, o que requer uma óptica volumosa.\n\nTudo isso foi substituído por um substrato transparente sobre o qual foram construídas nanobarras de silício, que interagem com a luz para fazer os cálculos.\n\nQuando uma imagem é projetada na metassuperfície, a luz transmitida forma uma nova imagem que mostra os contornos da imagem original. Efetivamente, a metassuperfície executa uma operação de derivada matemática na imagem, que fornece uma visualização direta de bordas presentes na imagem.\n\nA transformação matemática resulta do fato de que cada frequência espacial que compõe a imagem possui um coeficiente de transmissão específico através da metassuperfície. Essa transmissão ajustada é o resultado da complexa interferência gerada conforme a luz se propaga pela metassuperfície, interagindo com os nanopilares de silício, especialmente projetados para produzir a interação.\n\n#Computação óptica\n\nEsta nova técnica de computação e imageamento óptico opera na velocidade da luz e a operação matemática em si não consome energia, uma vez que envolve apenas componentes ópticos passivos.\n\nA metassuperfície pode ser colocada diretamente em um chip detector CCD ou CMOS padrão, abrindo novas oportunidades na computação óptica e em uma eletrônica híbrida de baixo custo que opere com baixa potência e em pequenas dimensões, disse a equipe.\n\n#Artigo: [High-Index Dielectric Metasurfaces Performing Mathematical Operations](https://ipfs.infura.io/ipfs/QmYTtiYYUMoKEhmtvgSY5bkzi58S8v8aWuvsr1SVR82Z1p)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=computacao-feita-velocidade-luz-sem-gastar-energia&id=010150191111",
				"added": 1596311643
			},
			{
				"comment_id": 83,
				"body": "#Buracos de minhoca em modelos de universo eterno\nhttps://ipfs.infura.io/ipfs/QmXX3C5JBoDGfPF4PLBmz86LHGBnxyRNyjVaLfpxLRmQy9",
				"added": 1596401210
			},
			{
				"comment_id": 84,
				"body": "#Mundos Brana: Buracos negros e buracos de minhoca\nhttps://ipfs.infura.io/ipfs/QmVwkQuMXEizWnjzYd6uzj1x2CZGT6thV5EgXAh3Xqvp1o",
				"added": 1596401533
			},
			{
				"comment_id": 85,
				"body": "#Buraco negro pode funcionar como usina descomunal de energia\n\nUma teoria pensada há mais 50 anos, que começou como uma especulação sobre como uma civilização alienígena poderia usar um buraco negro para gerar energia, foi verificada experimentalmente pela primeira vez.\n\nEm 1969, o físico Roger Penrose sugeriu que a energia poderia ser gerada baixando um objeto na ergosfera do buraco negro - a camada externa do horizonte de eventos do buraco negro, onde um objeto teria que se mover mais rápido que a velocidade da luz para permanecer imóvel, algo como uma versão extrema de um satélite geoestacionário.\n\nPenrose previu que o objeto poderia capturar uma [energia negativa](https://web.archive.org/web/20191220140716/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=energia-negativa-possivel-mas-voce-tera-paga-la-volta&id=010115191015) nessa área incomum do espaço. Ao soltar o objeto e dividi-lo em dois, de modo que uma metade caia no buraco negro, enquanto a outra é recuperada, a ação de recolhimento mediria uma perda de energia negativa - em termos efetivos, a metade recuperada ganharia energia extraída da rotação do buraco negro.\n\nA escala da engenharia que o processo exigiria é tão grande que Penrose sugeriu que apenas uma civilização muito avançada, talvez alienígena, seria capaz de vencer o desafio - de fato, um desafio muito maior do que a chamada \"[esfera de Dyson](https://en.wikipedia.org/wiki/Dyson_sphere)\", que prevê capturar energia \"apenas\" de uma reles estrela.\n\nDois anos depois, outro físico, chamado Yakov Zeldovich - o mesmo que sugeriu a existência dos [anapolos magnéticos](https://web.archive.org/web/20171106022934/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=nova-teoria-explicar-materia-escura&id=010130130703) -, sugeriu que a teoria de Penrose poderia ser testada com um experimento mais prático e ao alcance dos terráqueos. Ele propôs que ondas de luz torcida, atingindo a superfície de um cilindro de metal girando na velocidade adequada, acabariam sendo refletidas com energia extra extraída da rotação do cilindro, graças a uma peculiaridade do [efeito doppler rotacional](https://web.archive.org/web/20171105101653/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=exoplaneta-tem-ventos-supersonicos-temperatura-1-200c&id=020175151117).\n\nMas a ideia de Zeldovich permaneceu também no campo da teoria porque, para que o experimento funcionasse, o cilindro de metal que ele propôs precisaria girar pelo menos um bilhão de vezes por segundo - outro desafio insuperável para os atuais limites da engenharia humana.\n\n#Ondas acústicas torcidas\n\nAgora, pesquisadores da Universidade de Glasgow finalmente encontraram uma maneira de demonstrar experimentalmente o efeito que Penrose e Zeldovich propuseram.\n\nEm vez de usar a luz, eles usaram o som, uma fonte de frequência muito mais baixa e, portanto, muito mais prática para se trabalhar em laboratório.\n\nMarion Cromb e seus colegas construíram um sistema que usa um pequeno anel de alto-falantes para criar uma torção nas ondas sonoras, análoga à torção nas ondas de luz propostas por Zeldovich.\n\nAs ondas sonoras torcidas foram direcionadas para um absorvedor de som rotativo feito de um disco de espuma. Um conjunto de microfones atrás do disco captava o som dos alto-falantes conforme eles passavam pelo disco, o que aumentava constantemente a velocidade de sua rotação.\n\nPara saber se as teorias de Penrose e Zeldovich estavam corretas, a equipe esperava ouvir uma mudança distinta na frequência e na amplitude das ondas sonoras enquanto elas viajavam através do disco, um resultado do efeito doppler.\n\n\"A versão linear do efeito doppler é familiar para a maioria das pessoas, uma vez que o fenômeno ocorre quando o tom de uma sirene de ambulância parece subir à medida que se aproxima do ouvinte, mas cai à medida que se afasta. Ele parece aumentar porque as ondas sonoras estão chegando ao ouvinte com mais frequência à medida que a ambulância se aproxima, e com menos frequência à medida que passa.\n\n\"O efeito doppler rotacional é semelhante, mas o efeito é limitado a um espaço circular. As ondas sonoras torcidas mudam de tom quando medidas do ponto de vista da superfície rotativa. Se a superfície gira rápido o suficiente, então a frequência do som pode fazer algo muito estranho - ela pode passar de uma frequência positiva para uma frequência negativa e, ao fazê-lo, rouba energia da rotação da superfície,\" explicou Marion Cromb.\n\n#Usina do buraco negro\n\nÀ medida que a velocidade do disco giratório aumentava durante o experimento, o tom do som dos alto-falantes diminuiu até que se tornasse muito baixo para ser ouvido. Então, o tom voltou a subir novamente até atingir o tom anterior - mas mais alto, com uma amplitude até 30% maior do que o som original dos alto-falantes.\n\nO aparato de fato gerou energia.\n\n\"O que nós ouvimos durante o nosso experimento foi extraordinário. O que está acontecendo é que a frequência das ondas sonoras está sendo levada até o zero pelo efeito doppler à medida que a velocidade de rotação aumenta. Quando o som retorna novamente, é porque as ondas foram deslocadas de uma frequência positiva para uma frequência negativa. Essas ondas de frequência negativa são capazes de absorver parte da energia do disco de espuma giratório, tornando-se mais altas no processo - exatamente como Zeldovich propôs em 1971,\" explicou Marion.\n\nA conclusão geral é que os dois físicos - Penrose e Zeldovich - estavam certos: uma civilização suficientemente avançada poderá desfrutar da energia extraída de um buraco negro.\n\n#Artigo: [Amplification of waves from a rotating body](https://ipfs.infura.io/ipfs/QmP7haVBoZdThLbvcnRn5e26tUj2Ytzos5LoytKhsvhzcw)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=buraco-negro-usina-descomunal-energia&id=010130200626",
				"added": 1596402735
			},
			{
				"comment_id": 96,
				"body": "#Viagem no tempo liberada: Você não conseguirá mudar a história\n\nUm dos desenhos animados de maior sucesso entre as crianças atualmente tem uma curiosidade confortante: Depois de derrotar os vilões - o que todas as vezes implica em destruir grande parte de Paris - a super-heroína Ladybug (joaninha) arremessa para o alto um talismã, chamado Miraculous, e tudo volta ao normal - coisas quebradas se \"desquebram\", coisas destruídas se reconstroem e até as mentiras são esquecidas.\n\nPois parece que, acaso alguém consiga viajar no tempo, o milagre da Lady Bug poderá acontecer de fato, com a vida real se rearranjando para consertar qualquer problema que o viajante no tempo tenha causado.\n\nEm outras palavras, pode não existir paradoxo na [viagem no tempo](https://en.wikipedia.org/wiki/Time_travel), como aquele que pergunta o que aconteceria se você voltasse no tempo e matasse seu avô, impedindo sua linhagem e, portanto, sua própria existência - se você voltar no tempo e, por alguma razão, em vez de querer dar um abraço no vovô, querer matá-lo, ao voltar ao presente a própria realidade anulará suas ações e tudo voltará ao normal.\n\nEsta é a conclusão de Bin Yan e Nikolai Sinitsyn, do Laboratório Nacional Los Alamos, nos EUA.\n\n#Artigo: [Recovery of Damaged Information and the Out-of-Time-Ordered Correlators](https://ipfs.infura.io/ipfs/QmSapgsJC9Tcw6qCw5N8dTpckHVtrxm1y75wrDrqVev3KF)\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=viagem-tempo-liberada-voce-nao-conseguira-mudar-historia&id=010130200803",
				"added": 1596480856
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 72,
				"body": "#Princípio da razão suficiente\n- https://siasky.net/_AYIErB_6BgtLdmBz6KLY9oCbQRWnBadmjBFpqZl2DzpeA\n\nO [Princípio da Razão Suficiente](https://en.wikipedia.org/wiki/Principle_of_sufficient_reason) é um princípio filosófico poderoso e controverso que estipula que tudo deve ter uma razão, causa ou base. Essa simples demanda por inteligibilidade completa produz algumas das teses mais ousadas e desafiadoras da história da filosofia. Nesta entrada, começamos explicando o Princípio e depois voltamos à história dos debates em torno dele. Concluímos com um exame da discussão contemporânea emergente do Princípio.",
				"added": 1596314774
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 73,
				"body": "#Uma poção medieval provou ser um antibacteriano efetivo\n\nUma receita de 1.000 anos para tratar infecções oculares pode levar a uma forma pouco ortodoxa de combater a resistência aos antibióticos.\n\nAlho, cebola, vinho e uma pitada de bílis bovina. É uma verdadeira poção de bruxas, mas como mostra um novo [artigo](https://ipfs.infura.io/ipfs/QmSGbvVMwbA5jcj8K4cXzonLNQnYW9RUoEjviSu1ZnQmPe) da Scientific Reports na revista Nature, esta receita medieval, chamada de “Bald’s eyesalve” (algo como “pomada para olhos de Bald” ou “colírio de Bald”), é eficaz para evitar várias cepas de bactérias, incluindo aquelas que evoluíram para resistir a antibióticos.\n\nDe fato, o novo artigo, liderado por Freya Harrison da Escola de Ciências da Vida da Universidade de Warwick, destaca uma forma pouco reconhecida de adquirir compostos antibacterianos.\n\nMuitos medicamentos antibióticos anteriormente eficazes não funcionam mais, pois os micro-organismos estão desenvolvendo novas defesas, por isso é importante desenvolver estratégias alternativas. Os textos medievais, embora sejam uma fonte aparentemente estranha de informações médicas, poderiam ajudar nesse sentido.\n\n“As plantas têm sido usadas como medicamentos contra infecções durante milênios, e nós apenas arranhamos a superfície para entender seu verdadeiro potencial”, disse Cassandra Quave, uma etnobotânica da Universidade Emory que não estava envolvida na nova pesquisa. “Este estudo é empolgante porque demonstra como misturas de ingredientes específicos de plantas, tais como os encontrados nesta poção, podem às vezes funcionar melhor do que componentes individuais no combate à infecção.”\n\nDe fato, como mostra a nova pesquisa, a potência da pomada de olhos não poderia ser reduzida a um único ingrediente. Para que funcionasse, todos os ingredientes tinham que estar presentes, destacando a importância de estudar combinações de compostos.\n\nO novo estudo é uma continuação da [pesquisa anterior](https://web.archive.org/web/20200731110414/https://www.nottingham.ac.uk/news/pressreleases/2015/march/ancientbiotics---a-medieval-remedy-for-modern-day-superbugs.aspx) realizada por Christina Lee da Escola de Inglês da Universidade de Nottingham. Lee tinha estudado o [Bald’s Leechbook](https://en.wikipedia.org/wiki/Bald%27s_Leechbook), um livro didático médico anglo-saxão primitivo contendo conselhos e receitas de medicamentos, loções (ou pomadas) e tratamentos.\n\nO livro, escrito por volta do ano 905 d.C., foi encontrado na Biblioteca Britânica. Intrigado com a pomada para os olhos de Bald, Lee, com a ajuda de outros especialistas, descobriu que a loção era surpreendentemente eficaz como um composto antibacteriano contra Staphylococcus aureus (MRSA) – um estafilococo que pode causar infecções graves, e até mesmo fatais.\n\nPara o novo estudo, Harrison e seus co-autores recriaram a poção, testando-a contra cinco cepas bacterianas, incluindo bactérias planctônicas e biofilmes, sendo esta última uma colônia bacteriana complexa muitas vezes equipada com atributos de resistência a antibacterianos.\n\nEspecificamente, a loção de Bald foi aplicada a modelos de infecção de tecidos moles, incluindo infecções de Acinetobacter baumanii (frequentemente encontradas em feridas de guerra), Stenotrophomonas maltophilia (comumente ligada a infecções pulmonares), Staphylococcus aureus (frequentemente ligada a infecções cirúrgicas) e Staphylococcus epidermidis (associada a infecções como amigdalite, escarlatina, celulite infecciosa e febre reumática). Estas bactérias também são encontradas em úlceras de pé diabético, e todas têm demonstrado graus variados de resistência aos antibióticos padrão.\n\nOs testes da loção demonstraram “atividade antibacteriana promissora” contra essas bactérias, seja na forma planctônica ou de biofilme, de acordo com o artigo. A mistura medieval não era prejudicial às células humanas ou aos ratos, o que é uma boa notícia, pois sugere que o composto poderia ser reconstituído como um tratamento eficaz para infecções.\n\nO fato de uma mistura de cebola, alho, vinho e bílis bovina funcionar tão bem neste contexto é bastante surpreendente, e é claro que o inventor desta poção tinha algumas respostas. Quanto a como ela funciona, isso ainda é um mistério.\n\nO alho contém alicina, que, embora seja eficaz contra as formas planctônicas de bactérias, não é muito eficaz para combater os biofilmes, como o tipo de bactérias vistas nas úlceras dos pés. Por isso, os pesquisadores dizem que a loção é a soma de suas partes totais.\n\n“Descobrimos que a potente atividade anti-biofilme da loção não pode ser atribuída a um único ingrediente e requer a combinação de todos os ingredientes para atingir a plena atividade”, escreveram os pesquisadores.\n\nDe fato, a nova pesquisa mostra a importância de adquirir compostos antibacterianos com múltiplos ingredientes, como Harrison [explicou](https://web.archive.org/web/20200731082120/https://warwick.ac.uk/newsandevents/pressreleases/medieval_medicine_remedy/) em um comunicado de imprensa da Universidade de Warwick.\n\n“A maioria dos antibióticos que usamos hoje são derivados de compostos naturais, mas nosso trabalho destaca a necessidade de explorar não apenas compostos únicos, mas misturas de produtos naturais para tratar infecções por biofilme”, explicou Harrison. “Pensamos que a futura descoberta de antibióticos a partir de produtos naturais poderia ser melhorada por meio de estudo de combinações de ingredientes, em vez de plantas isoladas ou compostos. Nesta primeira instância, pensamos que esta combinação poderia sugerir novos tratamentos para feridas infectadas, tais como pé diabético e úlceras na perna.”\n\nEsta não é a primeira vez que os cientistas encontram valor em remédios antigos. No ano passado, Quave foi co-autor de um trabalho de investigação de plantas médicas utilizadas durante a Guerra Civil dos EUA. Os remédios, encontrados em um guia de campo da Guerra Civil Confederada, descreveram três remédios tópicos baseados em plantas, todos com potencial antimicrobiano.\n\n- Fonte: https://gizmodo.uol.com.br/pocao-medieval-antibacteriano/",
				"added": 1596316402
			},
			{
				"comment_id": 74,
				"body": "#Drogas da Inteligência - [Ritalina](https://en.wikipedia.org/wiki/Methylphenidate), [Provigil](https://en.wikipedia.org/wiki/Modafinil) e [Eranz](https://en.wikipedia.org/wiki/Donepezil) - [Prof. Paulo Jubilut](https://invidio.us/channel/UCG-eghyORxNrzSG8FkAWKyw)\n\n- https://siasky.net/AAAXIWcGK9x4DbaxbP6ulOZkq12XJ3Z0j7ASNWeywz5EnQ",
				"added": 1596318393
			},
			{
				"comment_id": 75,
				"body": "#Nootrópicos e doping mental | Nerdologia\n- https://siasky.net/AADWqmKJUPh36sBHjcsINNjLcVcpCLwH8e8ME69N1utTJw\n\nFONTES: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ_1",
				"added": 1596318509
			},
			{
				"comment_id": 76,
				"body": "#7 benefícios do Ginkgo biloba e Como tomar\n\nO [Ginkgo biloba](https://en.wikipedia.org/wiki/Ginkgo_biloba) é uma planta medicinal ancestral da China que é bastante rica em flavonóides e terpenóides, tendo assim uma forte ação anti-inflamatória e antioxidante.\n\nOs extratos feitos com esta planta parecem possuir vários benefícios para a saúde que estão relacionados, principalmente, com a melhora do fluxo sanguíneo arterial, cerebral e periférico. Devido à sua ação especialmente marcada na estimulação cerebral, o Ginkgo é conhecido como um elixir natural para a saúde mental.\n\n#1. Melhorar o rendimento cerebral e a concentração\nO ginkgo biloba melhora a microcirculação sanguínea, aumentando a quantidade de oxigênio disponível em vários locais do corpo. Um desses locais é o cérebro e, por isso, o uso desta planta pode facilitar o pensamento e aumentar a concentração, já que existe mais sangue chegando no cérebro para o seu correto funcionamento.\n\nAlém disso, como também possui ação anti-inflamatória e antioxidante, o uso contínuo de Ginkgo biloba também parece evitar o surgimento de cansaço mental, especialmente em pessoas muito ativas.\n\n#2. Evitar a perda de memória\nDevido ao aumento da circulação sanguínea no cérebro e melhora da capacidade cognitiva, o Ginkgo também evita danos nos neurônios, combatendo a perda de memória, especialmente em idosos, ajudando a prevenir casos de Alzheimer.\n\nMesmo em pacientes que já têm Alzheimer, vários estudos apontam uma melhora da capacidade mental e de socialização, quando se utiliza o Ginkgo biloba associado ao tratamento médico.\n\n#3. Combater a ansiedade e a depressão\nO uso de Ginkgo biloba ajuda a melhorar a capacidade do corpo para lidar com os elevados níveis de cortisol e adrenalina, que são produzidas no organismo quando existe um episódio de muito estresse. Dessa forma, pessoas que sofrem com distúrbios de ansiedade podem ter benefício com o consumo desta planta já que se torna mais fácil lidar com o excesso de estresse que estão sentindo.\n\nTambém devido à sua ação sobre o equilíbrio hormonal, o Ginkgo diminui as alterações bruscas de humor, especialmente em mulheres durante a TPM, reduzindo o risco de desenvolver uma depressão.\n\n#4. Melhorar a saúde dos olhos\nDevido à sua capacidade para melhorar a circulação sanguínea e eliminar os radicais livres do organismo, o Ginkgo parece evitar danos em locais sensíveis dos olhos, como a córnea, a mácula e a retina. Assim, este suplemento pode ser usado para preservar a visão por mais tempo, especialmente em pessoas com problemas como glaucoma ou degeneração macular, por exemplo.\n\n#5. Regular a pressão arterial\nO Ginkgo biloba provoca uma ligeira dilatação dos vasos sanguíneos e, com isso, melhora a circulação sanguínea, diminuindo a pressão sobre os vasos e o coração. Dessa forma, a pressão arterial tem tendência para diminuir, especialmente em pessoas com pressão alta.\n\n#6. Melhorar a saúde do coração\nAlém de diminuir a pressão arterial, o Ginkgo também parece evitar a formação de coágulos sanguíneos. Assim, existe menos pressão sobre o coração, o que acaba facilitando o seu funcionamento. Além disso, como existe menor risco de ter coágulos, também existem menos chances de sofrer um infarto, por exemplo.\n\n#7. Aumentar a libido\nO Ginkgo biloba parece aumentar a libido através do equilíbrio hormonal que provoca e do aumento da circulação sanguínea para a região genital, o que acaba ajudando homens com disfunção eréctil, por exemplo.\n\n#Como tomar o Ginkgo biloba\nO modo de uso do Ginkgo biloba pode variar de acordo com o benefício que se pretende alcançar e da marca do laboratório que está produzindo o suplemento. Assim, o melhor é sempre ler as indicações da caixa do produto ou pedir aconselhamento para um naturopata, por exemplo.\n\nNo entanto, a dosagem padrão de extrato de Ginkgo biloba para melhorar a concentração e o rendimento cerebral é de 120 a 240 mg, 1 a 4 horas antes de uma prova, por exemplo. Já como suplemento alimentar e para obter vários outros benefícios, a dose padrão é de 40 a 120 mg, 3 vezes por dia.\n\nIdealmente, os suplementos de Ginkgo biloba devem ser ingeridos junto com a refeição, para facilitar sua absorção.\n\n#Possíveis efeitos colaterais\nOs efeitos colaterais do Ginkgo biloba são raros, especialmente quando utilizado na dose correta, no entanto, algumas pessoas podem sentir dor de cabeça, reação alérgica na pele, enjoos, palpitações, sangramentos ou diminuição da pressão arterial.\n\n#Quem não deve tomar\nEmbora seja uma planta bastante segura, o Ginkgo biloba não deve ser usado em crianças com menos de 12 anos, grávidas, mulheres a amamentar, assim como em pacientes com elevado risco de hemorragia ou com alguma hemorragia ativa.\n\n#Bibliografia: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ_2\n\n- Fonte: https://www.tuasaude.com/ginkgo-biloba/",
				"added": 1596319027
			},
			{
				"comment_id": 77,
				"body": "#Pílulas da Inteligência | Ritalina\n- https://siasky.net/AABeKfgby_MjnOaMOl5uVZLNImg_Cdsllh_WRE3blrCvfw\n\nSerá que existem medicamentos que aumentam a inteligência? [Ritalina](https://en.wikipedia.org/wiki/Methylphenidate) aumenta a atenção? Faz mal ingerir cafeína? Neste vídeo, o professor Paulo Jubilut entrevista o psiquiatra José Hamilton para responder essas perguntas.",
				"added": 1596324005
			},
			{
				"comment_id": 98,
				"body": "#Como o lucro afeta a corrida contra o câncer\n- https://archive.today/2020.08.07-221651/https://outraspalavras.net/outrasaude/metade-dos-remedios-contra-cancer-aprovados-pela-europa-tem-falhas-nos-testes-clinicos/\n\nNa Europa, eficácia de metade dos remédios contra a doença pode ter sido exagerada. Interesses comerciais e lobbies das empresas farmacêuticas colocam vidas em risco. Leia também: a delicada relação entre filantropia e pesquisas",
				"added": 1596839099
			},
			{
				"comment_id": 99,
				"body": "#Uma cura potencial para o câncer está sendo ignorada?\nhttps://siasky.net/fAd-Etpx1kxkRdJUT4OPslRKGLhtSl_HT5T677KlzlFDiQ",
				"added": 1596839710
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 89,
				"body": "[Bitwarden](https://bitwarden.com/) é um gerenciador de senhas 100% de código aberto. O código fonte do Bitwarden está hospedado no GitHub e todos são livres para revisar, auditar e contribuir com a base de código do Bitwarden.\n- https://github.com/bitwarden",
				"added": 1596410018
			},
			{
				"comment_id": 90,
				"body": "#Radar Hacker - Funções\nhttps://siasky.net/AABsaqDTZ-G6MqCp3Bi-3gwMcOTllay-6vi31E0gNEcfWg\n\n#Radar Hacker - removendo server Spy net\nhttps://siasky.net/AABzV4DRj03p8DBB8ItxlHog3nwrJrC-eAGn8AdvQpsanA\n\n- Download: https://swarm-gateways.net/bzz:/be69755dfe41e8bfc73b4027a06cf85e0e007f8fff1a3f75f08fe804fb22aafd/Radar_Hacker.rar  | SHA-256: d603def3b4db7566eeacb109241f9d129c84c78917f5fee07efd574a03465b53\n\n#Use-o por sua conta e risco: https://www.virustotal.com/gui/file/d603def3b4db7566eeacb109241f9d129c84c78917f5fee07efd574a03465b53/detection",
				"added": 1596414751
			}
		]
	},
	"comment_vote": {
		"37_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": 1,
		"47_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": 1,
		"15_1HLN9buyxiYNSBR8dwXKHmQArpMeJwttnQ": 1
	}
}