{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1590686514,
			"title": "reimplimenting keybase on zeronet",
			"body": "Something i have been thinking about for the past 2 weeks has been if someone could somehow reimplement keybase to work in zeronet. since it's end to end encrypted, it should compliment the P2P nature of zeronet really well and it would act as a very solid discord replacement. if something like this already exists i am curious to know, but i do want it in a similar style to discord, without voice chat since it would help to shill zeronet to a bunch of groups i am on\n\nmy guess is that to reimplment keybase, one would need to reconstruct the server environment then prune things like the integrations and bots, if there is more to it, please do let me know. but it would be nice if someone could actually do something like this here since it would allow for very modern chat rooms to exist on zeronet, which could possibly help to mainstream zeronet. especially since groups like qanon were recently mass banned from discord. could make for a good oportunity to mainstream zeronet",
			"added": 1590686513
		},
		{
			"topic_id": 1590689346,
			"title": "trump readys executive order to nationaliz... (cough) i mean punish social media over dissent",
			"body": "https://www.washingtonpost.com/technology/2020/05/27/trump-twitter-executive-order/",
			"added": 1590689344
		},
		{
			"topic_id": 1591644770,
			"title": "Reddit is tightening controls on speech",
			"body": "https://reclaimthenet.org/reddit-announces-even-stricter-moderation-policies/\n\ni think i see an opportunity to get people onto alternative social media platforms",
			"added": 1591644767
		},
		{
			"topic_id": 1593195001,
			"title": "senate introduces bill to backdoor software and operating systems",
			"body": "welp. looks like it's time to ditch mainstream operating systems or at least severely limit their purpose with the help of a separate computer because they actually went there. https://news.bitcoin.com/lawful-access-to-encrypted-data-act-backdoor/",
			"added": 1593194997
		}
	],
	"topic_vote": {
		"1589664235_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1589664235_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 1,
				"body": "not using windows for anything but normie stuff check, TOR and VPN check, bleachbit check, using nonstream browsers check, RFID protection check, good password generator check, password manager check, lots and P2P communication and darknets check, E2E chats check, hardware switches on phone check.",
				"added": 1589878508
			},
			{
				"comment_id": 2,
				"body": "> [edgelordofdecent](#comment_542_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Agentrogue? Is that you? You may know me from xmpp.\n\nyes. it's me.",
				"added": 1589979562
			},
			{
				"comment_id": 5,
				"body": "I've been migrating away from some mainstream stuff including many social media sites on the surface web because i just feel it coming where we'll start seeing major crackdowns on what people post online like what we have seen in the UK. eventually the dark web may honestly be the only viable internet left unless something like Althea outright decentralizes the internet down to a hardware level",
				"added": 1590000407
			}
		],
		"1588776312_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4": [
			{
				"comment_id": 3,
				"body": "others may use this and it's probably not too horrible but personally i'd put it nowhere near my machine. maybe if the machine in question was low power and it was just some easy way to get a little bit of crypto then sure. but not for if there's a machine capable of doing some decent mining",
				"added": 1589979816
			}
		],
		"1589886834_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": [
			{
				"comment_id": 4,
				"body": "well i think there will always be the counter economy of crypto. that will never die, but for existing companies, they also want in on it because even they realize that it is likely going to replace fiat currency. they know they can't beat crypto with fiat so companies are joining in, and this mainstreaming of crypto could very well be the best thing that can ever happen to it. lowering the knowledge barrier to normies entering the counter economy is a good thing as it will be seen as regular trade to them.",
				"added": 1589996817
			}
		],
		"1590263087_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [
			{
				"comment_id": 6,
				"body": "would be cool if someone can get it working",
				"added": 1590418425
			}
		],
		"1590686514_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 7,
				"body": "> [anshorei](#comment_121_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): If you're looking for a discord replacement I think Riot/Matrix is a better option, that's not to say ZeroNet-based solutions are a bad idea, but they don't exist yet AFAIK.\n\nit could work in theory if i was to self host a matrix server, but it would be best if it could be something anyone could host and also have it integrate as a P2P network",
				"added": 1590729001
			}
		],
		"1590567168_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 8,
				"body": "i like using ungoogled chromium. the heavy sandboxing it has makes chromium based stuff nice",
				"added": 1590729071
			}
		],
		"1590689346_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 9,
				"body": "> [ls9125s](#comment_4_1MoiNscMBZopwz1HdWDky1kXHAb4GrTruH): The dumb masses, who do not care to make an effort to use anything other than the Facebook and Twitter DO NOT DESERVE to be free. Facebook is like a local bar: important for politicians for emotion based superficial votes, but hardly the place for news and scientific knowledge, unless one tries to measure the average level of drunkenness and the levels of announced nonsense.\n\nit requires some semblance of a liberty oriented mind to want privacy. facebook and twitter i use but it sure is not my entire network. i can't imagine why anyone lives with only mainstream services when there's a far bigger world out there",
				"added": 1590816859
			}
		],
		"1590861974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "https://safenetwork.org/\nhttp://retroshare.cc/",
				"added": 1590883727
			}
		],
		"1591579090_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 11,
				"body": "the other moral of the story, don't wholy trust a product by how many stars it has. use independent content creators if you can but for services this unfortunately is far from easy, simply finding someone from a irl connection is always going to be your best bet especially nowadays",
				"added": 1591644630
			}
		],
		"1591644770_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 12,
				"body": "> [adrenochrome](#comment_15_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): Try self hosted federated alternative lemmyhttps://dev.lemmy.mlhttps://github.com/LemmyNet/lemmy\n\nvery nice. granted zerotalk is also meant to be kind of reddit like if i'm not mistaken, but the more alternatives the better",
				"added": 1591688605
			}
		],
		"1591731867_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 13,
				"body": "yeah i had the same issue\n\ni assumed it was because i was installing it on an ARM64 system but i guess not",
				"added": 1591737967
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 14,
				"body": "i've been on it for a while as they say, nothing lasts forever",
				"added": 1591823656
			},
			{
				"comment_id": 15,
				"body": "yeah so far i got well over 500GB of data from the wayback machine\nprob gonna end up with over 2 terabytes unless it goes to hell real soon",
				"added": 1591838654
			},
			{
				"comment_id": 16,
				"body": "> [merithtk](#comment_45_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Atleast its only several dozen petabytes, so a nice serverfarm can handle it\n\nunfortunately i don't have that kind of space. though 100TB is definetely a decent size\ngranted i mostly use it for media like video though as far as number of files, the majority are in fact compresed (zip, rar, etc) and html files",
				"added": 1591841537
			}
		],
		"1591795514_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 17,
				"body": "this is honestly a solid indicator of the growing political instability of America. only a matter of time before we see more of these zones pop up or violent suppression of them by the govenment waco/ruby ridge style. either way this situation has little chance of going back to normal. probably a good idea to have a plan in your back pocket incase things really go to shit.",
				"added": 1592023136
			}
		],
		"1591804075_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 18,
				"body": "probably. someone could make some sort of facebook alternative here for people and given the speed is influenced by the number of peers it definitely makes sense to leverage that, the more people that use zeronet, the better it becomes. a client-server based model simply doesn't have this",
				"added": 1592023544
			}
		],
		"1592974194_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 19,
				"body": "aaaaaand this is why i don't use twitter too often.",
				"added": 1593048001
			}
		],
		"1593195001_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 20,
				"body": "> [slondrex](#comment_2_1AMDCwJEDNWWiP3KVp5M9vCCaj91tefBbB): Lineage is Android\n\nlineage is a different ASOP based OS not tied to google if my memory is correct",
				"added": 1593620741
			}
		],
		"1593724956_18FmpbxghV4UBgrjHpwgU1igoAt2gRzApL": [
			{
				"comment_id": 21,
				"body": "dark web, whonix, qubes, tails, that sort of thing",
				"added": 1594160217
			},
			{
				"comment_id": 22,
				"body": "as far as darknets it depends. if your using tor be absolutely sure to use bridges.",
				"added": 1594160300
			}
		]
	},
	"comment_vote": {}
}