{
	"next_post_id": 7,
	"next_comment_id": 5,
	"next_follow_id": 5,
	"avatar": "jpg",
	"user_name": "😀Leinariys😍",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Zite Developer, Contact \nZite开发人员，联系方式",
	"post": [
		{
			"post_id": 1546641651,
			"body": "Всем привет!, если нужен Зеро сайт обращайтесь))😎\nHello everyone, if you need Zero site please contact))✌\n各位大家好！如果您需要Zero网站请联系））💋",
			"date_added": 1546641647,
			"meta": "{\"img\":\"900,506,eeeedadb8dcaedceedb97cbadcbbaaba9888776545665,0123415000026442450007245288400838898885047A3B38408CDB9DE950\"}"
		},
		{
			"post_id": 1546794460,
			"body": "Hello!\nAs promised, I publish a story about the customer’s project (with his permission :-)))\nUnderstood with loading video, and unfortunately at this tonight, until next weekend. (working on projects only on weekends)\nWhat to do?\nI showed the message\n@Pexo:  [this](/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC/1545597889)\nand the customer liked the idea very much, but unfortunately, they don’t want to give me mockups (they don’t know how to draw, they only pay money) ((and without mock-ups it’s very hard to do something (therefore, the design is so poor)\nIf you wish, please make a site layout with functionality as described by @Pexo:  [this](/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC/1545597889)\nBe sure to multilingual, at least 9 languages.\n#Do you have a gif?\n*Chromium is cool, and once again proved that you can not trust the file extension :-))*  \n\nEdit: *Use Chromium based browser to see GiF*\n And clear cache Ctrl + F5",
			"date_added": 1546794455,
			"meta": "{\"img\":\"900,561,556645222233877766bcd89a67834543369d9bd878112999,01233333331456666789A59BCCC85A55300332DD00EE2E23FF2900330509\"}"
		},
		{
			"post_id": 1546893636,
			"body": "Architecture\n\nHow do you like architecture? it is not perfect ... but I have to create it, because of the story with the customer ...\nRemember I said I would kick him over the weekend so he would give mockups?\nSo, I received a retaliatory strike in the form of $ and tasks to come up with design and architecture both in social networks and for all occasions, and so that (node / cluster / site) anyone could connect the customer to his site (ie, come up with a standard).\n\nTotal philosophy\n1) There should be a folder in which only folders\n2) Or folders in which only files\nIf there is at least 1 file in the folder, then the folder is counted as (group with files).\n\nNote, chrome and fox do not support additional tracks, however it is not a reason to abandon the voice acting.\nThe customer said that the site would have to be divided into (node / cluster / site), 1 (node / cluster / site) is 4 TB of disk space (3.64TB to be exact).",
			"date_added": 1546893630,
			"meta": "{\"img\":\"900,641,eeefffdddedd,0000000111020000111102200011110311111111021111111100011111110000000001\"}"
		}
	],
	"post_like": {
		"1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546893636": 1549180020,
		"1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546794460": 1549180024,
		"1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546641651": 1549180027
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@SSDifnskdjfnsdjk: Hello friend, I'm doing a project using technologies: ZeroFrame, Vue, less, webpack, sql.\nNow I’m busy when I finish the project, I’ll choose the next one. Can you put a technical task on the page for evaluation?\n$ 2 = one page",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546641651",
			"date_added": 1546643230
		},
		{
			"comment_id": 2,
			"body": "@SSDifnskdjfnsdjk: Very interesting! after the current project I will write to you if there is time.\nWhen I'm done, I will post the results of the development on the page and add the images to my portfolio))",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546641651",
			"date_added": 1546647063
		},
		{
			"comment_id": 3,
			"body": "@Pexo: \n\nHAHAH)) dude you are lucky, I make this order)) at the customer 50% less requirements, but he also ordered this functionality.\nIf there is a desire to make a layout by any means in Peinte or Photoshop ,.\nI can make any style on css, you can take inspiration here.\n\nhttps://www.pinme.ru/search?q=design+site&color_id=\nhttps://www.pinterest.ru/search/pins/?q=design%20site&rs=typed&term_meta%5B%5D=site%7Ctyped\n\n\nTomorrow I will publish the probe and will test the video player.\nWe really miss the designer or the person who draws or sticks the layout.\nBefore the publication of the portfolio left 24 hours. Follow the news))",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546641651",
			"date_added": 1546718854
		},
		{
			"comment_id": 4,
			"body": "@Pexo: Yes, the customer takes the media space, I think the site will be anime, hentai, music, books, several chats on one page.\nAnd a few of your ideas, the project will be open.\nNow he is on the test address.\nBe sure to multilingual, at least 9 languages (the customer probably will hire translators or use Google translator like me).\nI think the development should always start with the layout, so I’ll kick the customer the whole week)) maybe it will draw something before the weekend))",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546794460",
			"date_added": 1546798689
		}
	],
	"follow": [
		{
			"follow_id": 4,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg",
			"user_name": "😍Leinariys😎",
			"date_added": 1548607007
		}
	]
}