{
    "article": [
        {
            "title": "Sneakernet",
            "text": "{{fsb}}\n[[File:Holding a cruzer 8gb.jpg|thumb|right|300px|A [[USB flash drive]] allows the transfer of data between individuals without use of the Internet.]]\n[[File:Memory-card-comparison.jpg|thumb|300px|[[Memory card]]s are a popular physical medium for transferring files and have become smaller in size as technology has advanced]]\n'''Sneakernet''' is an informal term describing the transfer of electronic information by physically moving media such as [[magnetic tape]], [[floppy disk]]s, [[compact disc]]s, [[USB flash drive]]s or external [[hard drive]]s from one [[computer]] to another; rather than transmitting the information over a [[computer network]].  \n\nThe term, a [[tongue-in-cheek]] play on ''net(work)'' as in ''[[Internet]]'' or ''[[Ethernet]]'', refers to the wearing of [[sneakers (footwear)|sneakers]] as the transport mechanism for the data.<ref>{{Cite web|url=http://www.oxforddictionaries.com/definition/english/sneakernet |title=Oxford Dictionary| accessdate=2016-09-09}}</ref>\n\n==Summary and background==\n\nSneakernets, also known as trainnets or pigeonets, are in use throughout the computer world. Sneakernet may be used when computer networks are prohibitively expensive for the owner to maintain, in high-security environments where manual inspection (for re-classification of information) is necessary, where information needs to be shared between networks with different levels of security clearance, when data transfer is impractical due to [[List of device bandwidths|bandwidth limitations]], when a guest laptop is incompatible with the local network, or simply when two computers are not powered up at the same time or lack the correct interconnecting cabling. Because sneakernets take advantage of physical media, different security measures must be taken into account for the transfer of sensitive information.\n\nThis form of data transfer is also used for [[peer-to-peer]] (or [[friend-to-friend]]) file sharing and has grown in popularity in [[metropolitan area]]s and [[college]] communities. The ease of this system has been facilitated by the availability of [[USB]] external hard drives, [[USB flash drive]]s and portable music players.<ref>{{cite web|url=https://www.wired.com/culture/lifestyle/news/2002/08/54739 |title=Sneakernet Redux: Walk Your Data |last=Boutin |first=Paul |date=2002-08-26 |work=[[Wired News]] |accessdate=8 June 2010 |deadurl=yes |archiveurl=https://web.archive.org/web/20091119134710/http://www.wired.com/culture/lifestyle/news/2002/08/54739 |archivedate=November 19, 2009 }}</ref>\n\nThe [[United States Postal Service]] also offers a [[United States Postal Service#General domestic services|Media Mail]] service for [[compact disc]]s, among other items. This provides a viable mode of transport for long distance sneakernet use. In fact, when mailing a sufficiently large hard drive or a spindle of DVDs, the throughput (amount of data per unit time) may compete favorably with other methods of data transfer.\n\n==Theory==\nFrom an [[information theory]] standpoint, sneakernets can achieve tremendous throughput, but they suffer from high latency (''see [[Network performance]]''). The [[throughput]] of the network is directly proportional to the size of the transmitted file(s). [[Latency (engineering)|Latency]] is based on the amount of time it takes to fully process the request for information. Latency would include the time it takes to write the storage media and the time to travel from point A to point B.\n\nFor example: Alice requests Bob to send her a [[DVD]] (4.7&nbsp;GB) worth of information. Over the Internet, the latency for the file request may be milliseconds—Alice starts receiving the information nearly immediately—but at a modest [[broadband]] download speed of 50&nbsp;kB/s it may take up to a day to complete the transfer. On the other hand, Bob could burn a DVD and deliver it to Alice in an hour. The latency was an hour, but the throughput of the transfer is roughly equal to a transfer rate of 1305&nbsp;kB/s.\n\nIf an [[Airbus A380]] were filled with [[microSD]] cards each holding 512 gigabytes of storage capacity, the theoretical total storage space onboard would be approximately 91 million terabytes. A 4h47m flight from New York to Los Angeles would work out to a data transport rate of well over 5 [[petabytes]] per second, although this does not account for the time required to write to and read from the cards, which would almost certainly be much longer than the duration of the flight.\n\nSimilarly, {{As of|2016|lc=on}} the highest capacity backup tape format available is [[Linear Tape-Open#LTO-7|LTO-7]], with a capacity of 6&nbsp;TB. If a tape of this capacity were sent by overnight mail and were to arrive around 20 hours after it was sent, the effective data rate would be 664&nbsp;Mbit/s. With networking technology, this magnitude of speed over this distance would be very difficult to attain without a costly dedicated connection as one would likely need to use several [[Hop (networking)|hops]] and have a connection that is not [[Overselling|oversubscribed]].\n\nSneakernets may also be used in tandem with computer network data transfer to increase data security. For example, a file or collection of files may be encrypted and sent over the [[Internet]] while the encryption key is printed and hand delivered or mailed. This method greatly reduces the possibility of an individual intercepting both the key and encrypted data.\n\nAnother way sneakernets are used together with network transfers is to provide an initial full backup as a base for incremental backups.  In the case of a large (several [[terabyte]]) dataset that grows by just a few megabytes a day, the initial seeding of the data to be backed up would require an excessively long time upload over a network. One solution is to make a local copy of the data which is then physically relocated to the remote location and topped up with daily incremental backups over a network.\n\n==Usage examples==\nWhen [[Australia]] joined [[Usenet]] in 1983, it received articles via tapes sent from the United States to the [[University of Sydney]], which disseminated data to dozens of other computers on the country's Unix network.<ref name=\"marquis19830329\">{{cite newsgroup | url=http://article.olduse.net/467@sdchema.UUCP | title=Australia joins USENET | date=1983-03-29 | accessdate=14 February 2016 | author=Marquis, Bret | newsgroup=net.news.newsite | id=467@sdchema.UUCP}}</ref>\n\nThe [[Death of Osama bin Laden|May 2011 raid]] of [[Osama bin Laden's compound in Abbottabad]], [[Pakistan]] revealed that he used a series of USB thumb drives to store his email drafts.  A courier of his would then take the saved emails to a nearby Internet cafe and send them out to the desired recipients.<ref>{{cite news |authors=Apuzzo, Matt & Goldman, Adam |url=http://www.washingtontimes.com/news/2011/may/13/how-bin-laden-emailed-without-being-detected-us/ |title=How bin Laden emailed without being detected by US |agency=Associated Press |publisher=[[The Washington Times]] |date=May 13, 2011 |accessdate=June 29, 2012}}</ref><ref>{{cite news |first= Declan |last=McCullagh |authorlink=Declan McCullagh |url=http://news.cnet.com/8301-31921_3-20062755-281.html |title=How bin Laden evaded the NSA: Sneakernet |work=Privacy Inc |publisher=[[CNET]] |date=May 13, 2011 |accessdate=May 17, 2011 }}</ref>\n\nIn September 2009, Durban company Unlimited IT reportedly pitted a [[Homing pigeon|messenger pigeon]] against South African ISP [[Telkom SA|Telkom]] to transfer 4&nbsp;GB of data {{convert|60|mi|km}} from [[Howick, KwaZulu-Natal|Howick]] to [[Durban]]. The pigeon, carrying the data on a [[USB flash drive|memory stick]], arrived in one hour eight minutes, with the data taking another hour to read from the memory stick. During the same two-hour period, only about 4.2% of the data had been transferred over the [[ADSL]] link.<ref>{{cite news |first= |url=http://news.bbc.co.uk/2/hi/africa/8248056.stm |title=SA Pigeon 'Faster than broadband' |publisher=BBC News |date=September 10, 2009}}</ref> A similar experiment was conducted in England in September 2010; the \"pigeonnet\" also proved superior.<ref>{{cite web |url=https://www.theregister.co.uk/2010/09/17/bt_bird/|title=BT feathers ruffled over pigeon-based file transfer caper |work=[[The Register]] |date=September 17, 2010}}</ref><ref>{{citation |url=http://www.bbc.co.uk/news/technology-11325452 |title=Pigeon flies past broadband in data speed race |publisher=BBC News Technology |date=September 16, 2010}}</ref> In November 2009 the Australian comedy/current-affairs television program [[Hungry Beast]] repeated this experiment. The experiment had the team transfer a 700&nbsp;MB file via three delivery methods to determine which was the fastest; A carrier pigeon with a [[microSD]] card, a car carrying a [[USB Stick]], or a [[Telstra]] ADSL line. The data was to be transferred a distance of 132&nbsp;km by road. The pigeon won the race with a time of approximately 1 hour 5 minutes, the car came in second at 2 hours 10 minutes, while the internet transfer did not finish, having dropped out a second time and not coming back.<ref>{{cite web | url = https://www.youtube.com/watch?v=ci2bFFGM8T8 | work=ABC Television/Hungry Beast | title=The Great Australian Internet Challenge | date=10 November 2009}}</ref>\n\n[[Google]] has used a sneakernet to transport large datasets, such as the 120 [[terabyte|TB]] of data from the [[Hubble Space Telescope]].<ref>{{cite news |url=http://news.bbc.co.uk/1/hi/technology/6425975.stm |publisher=BBC News |title=Google helps terabyte data swaps |date=March 7, 2007 |accessdate=May 23, 2010 }}</ref><ref name=\"FedExNet\">{{cite web|url=https://www.wired.com/science/discoveries/news/2007/03/73007|title=Google's Next-Gen of Sneakernet|last=Farivar|first=Cyrus|date=20 March 2007|work=[[Wired (website)|Wired]]|accessdate=5 February 2013}}</ref> Users of [[Google Cloud Platform|Google Cloud]] can import their data into [[Google Cloud Storage]] through sneakernet.<ref>{{cite web|title=Offline Media Import / Export|url=https://cloud.google.com/storage/docs/offline-media-import-export|publisher=Google|accessdate=29 January 2016}}</ref>\n\nThe [[SETI@home]] project uses a sneakernet to overcome bandwidth limitations: data recorded by the [[Arecibo Observatory|radio telescope in Arecibo, Puerto Rico]] is stored on magnetic tapes which are then shipped to [[Berkeley, California]] for processing.  In 2005, [[Jim Gray (computer scientist)|Jim Gray]] reported sending hard drives and even \"metal boxes with processors\" to transport large amounts of data by postal mail.<ref>{{cite journal|url=http://queue.acm.org/detail.cfm?id=864078 |title=A Conversation with Jim Gray |quote=Who would ever, in this time of the greatest interconnectivity in human history, go back to shipping bytes around via snail mail as a preferred means of data transfer? |magazine=[[ACM Queue]] |volume=1 |issue=4 |date=July 31, 2003 |deadurl=yes |archiveurl=https://web.archive.org/web/20091205080459/http://queue.acm.org/detail.cfm?id=864078 |archivedate=December 5, 2009 }}</ref>\n\nMany film editing and visual effects companies transfer large film-scans using hard drives shipped via courier (to reduce bandwidth bills, and to reserve bandwidth for more time-critical transfers).{{Citation needed|date=September 2008}}\n\n[[Wizzy Digital Courier]] provided Internet access to schools in South Africa with poor or no network connectivity by implementing [[UUCP]] on USB memory sticks. This allowed offline cached email transport and scoops of web pages to back-fill a web cache.<ref>[http://archive.wired.com/techbiz/media/news/2004/04/63131?currentPage=all \"Seeking Riches From the Poor\"], Megan Lindow, 04.23.04, Wired.com</ref>\n\nWhen home broadband access was less common, many people downloaded large files over their workplace networks and took them home by sneakernet.  Today, as home broadband is more common, sometimes technical workers at institutions with congested WAN links do the reverse: downloading data at home in the evening and carrying the files to work on USB flash drives.{{Citation needed|date=September 2008}}\n\nIn the early [[demoscene]], the primary method of exchanging data was using [[snail mail]] to exchange floppies between groups. Each group usually had at least one person designated as a ''swapper'', who would exchange news, data and productions with swappers from other groups this way. The best swappers were known to send and receive over 100 mails a month.{{Citation needed|date=May 2009}}\n\n[[Online DVD rental]] services such as [[GameFly]], or those formerly provided by [[Netflix]], are effectively sneakernets. They deliver data, stored on DVDs and occasionally other forms of digital media, via regular postal [[mail]].\n\nPetroleum seismic surveys routinely record field data which are many terabytes in size. A cluster computer is required to process these data and may take a year or more, during which time the field crew will wish to work in other areas. The field data are generally hand-carried on tape and increasingly on hard disk inserts, to the processing centre.{{Citation needed|date=September 2008}}\n\nData analytics teams in the financial services sector often use sneakernets to transfer sensitive corporate information and information obtained from [[data mining]], such as ledger entries, customer data and financial statistics.  There are several reasons for this: firstly, sneakernets can generally provide very high security (and possibly more importantly, they are ''perceived'' to be secure) due to the impossibility of a [[Man-in-the-middle attack]] or [[packet sniffing]]; secondly, the volumes of data concerned are often extremely high; and thirdly, setting up secure network links between the client business and the analytics team's facilities is often either impossible or an extremely convoluted process.\n\n[[Very Long Baseline Interferometry]] performed using the [[Very Long Baseline Array]] ships hard drives to a data reduction site in Socorro, New Mexico.  They refer to their data transfer mechanism as \"HDOA\" (Hard Drives On Airplane).\n\nThe Rigsum Sherig Collection project<ref>[http://sherig.rigsum-it.com/ Rigsum Sherig Collection]</ref> uses a sneakernet to distribute offline educational resources, including [[Kiwix]] and [[Khan Academy]] on a Stick,<ref>[http://mujica.org/khan/ Khan Academy on a Stick]</ref> to hundreds of schools and other educational institutional in the Kingdom of [[Bhutan]]. Many of the schools in Bhutan have computers or IT labs, but no Internet connection (or a very slow one).<ref>{{cite news |url=http://www.kuenselonline.com/only-a-third-of-government-schools-have-internet-access |archive-url=https://archive.is/20130615201815/http://www.kuenselonline.com/only-a-third-of-government-schools-have-internet-access |dead-url=yes |archive-date=June 15, 2013 |title=Only a Third of Government Schools Have Internet Access |publisher=Kuensel |date=April 18, 2013}}</ref> The sneakernet, facilitated by teachers, distributes about 25 GB of free, open-source educational software to the schools, often using external [[hard disks]].\n\n[[North Korea]]n dissidents have been known to smuggle flash drives filled with western movies and television shows, largely in an effort to inspire a cultural revolution.<ref>[http://techli.com/2012/05/north-korea-sneakernet-insurgency/ Fighting The State, Without The Web: North Korea's Sneakernet Insurgency | Techli<!-- Bot generated title -->]</ref><ref>https://www.wired.com/2015/03/north-korea/</ref><ref>[https://gizmodo.com/how-one-man-wants-to-free-north-korea-with-usb-drives-a-1688814490 How One Man Wants to Free North Korea With USB Drives and Pirated Movies<!-- Bot generated title -->]</ref><ref>[http://www.thedailybeast.com/articles/2014/12/22/north-korea-s-secret-movie-bootleggers-how-western-films-make-it-into-the-hermit-kingdom.html North Korea’s Secret Movie Bootleggers: How Western Films Make It Into the Hermit Kingdom - The Daily Beast<!-- Bot generated title -->]</ref><ref>[https://www.theguardian.com/film/2015/apr/08/balloon-activist-sends-thousands-of-copies-of-the-interview-to-north-korea Balloon activist sends 'thousands of copies' of The Interview to North Korea | Film | The Guardian<!-- Bot generated title -->]</ref>\n\n[[El Paquete Semanal]] is a roughly 1TB compilation of media, distributed weekly throughout [[Cuba]] via portable hard drives and USB memory sticks.<ref>[http://www.fastcompany.com/3048163/in-cuba-an-underground-network-armed-with-usb-drives-does-the-work-of-google-and-youtube In Cuba, An Underground Network Armed With USB Drives Does The Work Of Google And YouTube<!-- Bot generated title -->]</ref>\n\nIn 2015 [[Amazon Web Services]] launched AWS Snowball, a {{convert|50|lb|kg|abbr=on}}, 50&nbsp;TB device for transporting data to the AWS cloud;<ref>{{cite news|url=https://www.theverge.com/2015/10/7/9471381/amazon-snowball-data-transfer-device|title=Amazon made a huge plastic box called Snowball so people can ship data to the cloud|first=Jacob|last=Kastrenakes|date=October 7, 2015|accessdate=October 8, 2015|website=[[The Verge]]}}</ref> and in 2016 AWS Snowmobile, a truck to transport up to 100&nbsp;PB of data in one load.<ref>{{cite news|url=http://www.zdnet.com/article/aws-snowmobile-data-transport-truck-highlights-why-cloud-giant-is-so-damn-disruptive/|title=AWS' Snowmobile data transport truck highlights why cloud giant is so damn disruptive|first=Larry|last=Dignan|date=November 30, 2016}}</ref>  For similar reasons, there is also a Google Transfer Appliance and an IBM Cloud Mass Data Migration device.<ref>{{cite news|last1=Sharwood|first1=Simon|title=IBM packs 120TB into a carry-on bag, for snow-balling cloud uploads|url=https://www.theregister.co.uk/2017/09/19/ibm_cloud_mass_data_migration_appliance/|accessdate=19 September 2017|work=[[The Register]]|date=19 September 2017}}</ref>\n\n==In media==\n\n===Non-fiction===\n<blockquote>\n\nNever underestimate the bandwidth of a [[station wagon]] full of tapes hurtling down the highway.\n\n<cite>—{{cite book| authorlink=Andrew S. Tanenbaum| first=Andrew S.| last=Tanenbaum| title=Computer Networks| location=New Jersey| publisher=Prentice-Hall| year= 1989| page=57| isbn=0-13-166836-6}}</cite>\n\n</blockquote>\n\nThe original version of this quotation came much earlier; the very first problem in Tanenbaum's 1981 textbook ''Computer Networks'' asks the student to calculate the throughput of a [[St. Bernard (dog)|St. Bernard]] carrying [[floppy disk]]s (in 1981 the standard 8&nbsp;inch floppy held 241&nbsp;[[kilobytes]] of data per side, though various formatting and data blocking techniques could get that as high as 800&nbsp;[[kilobytes]] per side, while the 5.25&nbsp;inch floppy held 180&nbsp;[[kilobytes]] per side). The first [[USENET]] citation is July&nbsp;16,&nbsp;1985 and it was widely considered an old joke already.\n\n<blockquote>\n\nThere's a lot of band-width in a station wagon.\n\n<cite>-{{cite book|last1=Gruenberger|first1=Fred|title=Computing: A Second Course|date=1971|publisher=Canfield Press|location=San Francisco|isbn=978-0063834057|page=138|accessdate=24 January 2017|url=https://books.google.com/books?id=m2YgAQAAIAAJ&focus=searchwithinvolume&dq=band-width}}</cite>\n</blockquote>\n\nOther alleged speakers included Tom Reidel, Warren Jackson, or Bob Sutterfield. The station wagon transporting magnetic tapes is the canonical version, {{Citation needed|date=June 2013}} but variants using trucks or [[Boeing 747]]s or C-5s and later storage technologies such as [[CD-ROM]]s, [[DVD]]s, [[Blu-Ray]]s, or SD Cards have frequently appeared.\n\n===Fiction===\n\nThe [[Terry Pratchett]] novel ''[[Going Postal]]'' includes a contest between a horse-drawn mail coach and the \"Grand Trunk Clacks\" (a [[semaphore line]]) to see which is faster to transmit the contents of a book to a remote destination.\n\nThe \"valuable data file\" has become a common [[MacGuffin]] in action films and television programs and indeed the motif of the \"valuable letter or documents\" (pre-electronic information storage technology) dates back hundreds of years.\n\n* The film ''[[Live Free or Die Hard]]'' depicts a digital thief attempting to download 500&nbsp;TB of financial data to (a) suitcase sized package(s).\n* The 1995 film ''[[Johnny Mnemonic (film)|Johnny Mnemonic]]'', based on [[Johnny Mnemonic|the short story]] by [[William Gibson]], stars [[Keanu Reeves]] as a digital courier with 320&nbsp;GB of corporate data transported in his head. Gibson's 2007 novel ''[[Spook Country]]'' also featured sneakernets, with [[iPods]] being the storage device used to clandestinely move information.<ref>{{cite news|url=https://www.theguardian.com/books/2007/aug/18/sciencefictionfantasyandhorror.fiction?gusrc=rss&feed=books |first=Steven |last=Poole |authorlink=Steven Poole |date=August 18, 2007 |title=\nSign language |work=[[The Guardian]] |publisher=Guardian Media Group |accessdate=September 24, 2009 | location=London}}</ref>\n\n*In the episode \"Amen\" of ''[[The Newsroom (U.S. TV series)|The Newsroom]]'', associate producer Maggie Jordan, after being told \"it's 2011, we don't run film manually\", is told that the video is taking too long to [[Video renderer|render]] on the local machine.  It cannot feasibly be transferred over the network in raw form and must be run to the newsroom manually on a [[USB flash drive|USB drive]].\n* In the [[James Bond in film|James Bond film]] ''[[Skyfall]]'', [[MI6]] sets up a sneakernet due to security concerns.\n* In the film ''[[Snowden (film)|Snowden]]'', the title character is seen evading security by carrying a data chip concealed in a [[Rubik's Cube]].\n\n==Similar concepts==\n* [[Delay-tolerant networking|Delay-tolerant networks]], such as the Haggle project<ref>{{cite web|url=http://www.cl.cam.ac.uk/research/srg/netos/haggle/ |title=Haggle |author=Ben Hui |date=March 1, 2006 |work= |publisher=University of Cambridge Computer Laboratory |accessdate= |deadurl=yes |archiveurl=https://web.archive.org/web/20150628135144/http://www.cl.cam.ac.uk/research/srg/netos/haggle/ |archivedate=June 28, 2015 }}</ref> at [[Cambridge University]].\n* [[IP over Avian Carriers]] (RFC 1149), an [[April Fools' Day RFC]] describing the transmission of messages via [[homing pigeon]].\n* [[Drew Houston]], the inventor of the [[Dropbox (service)|Dropbox]] cloud storage and file synchronization system once referred to his invention as \"sneakernet minus the removable media\".\n\n==See also==\n{{Portal|Computer Science}}\n\n{{Div col||25em}}\n* [[Air gap (networking)]]\n* [[Darknet]]\n* [[Data Mule]]\n* [[Jargon File]]\n* [[Meatspace]] (tongue-in-cheek implication of the real world as a similar analogue to cyberspace writ large)\n* [[Pod slurping]]\n* [[Repurposing]]\n* [[Sideloading]]\n* [[Twilight (CD-ROM)]]\n* [[USB dead drop]]\n{{Div col end}}\n\n==References==\n{{Reflist|30em}}\n\n\n[[Category:Data transmission]]\n[[Category:Computer networking]]\n[[Category:File sharing networks]]",
            "slug": "sneakernet",
            "date_updated": 1520687331144,
            "imported": "https://en.wikipedia.org/wiki/Sneakernet"
        }
    ]
}