{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1611157084,
			"title": "The truth about the Covid-19 vaccination campaign",
			"body": "It's been researched independently, the so-called vaccine is actually a gene therapy tool akin to chemotherapy. The good news is that people injured or killed by it can actually seek justice once the state of emergency ends (at least in the US). This technology has never been used before in this way and the claims of \"95% efficacy\" is wishful thinking at best. From what I could take from it is that the big pharma has taken the vaccine concept and turned it from true prevention to treatments for a condition instead, as they have done with virtually everything else.\n\nMore blood money for the blood gods.\n\nhttps://cantcensortruth.com/watch?id=60076fda8c03b74ce0e2f6f5",
			"added": 1611157083
		},
		{
			"topic_id": 1615053324,
			"title": "Double ad and malware-guarded free DNS server",
			"body": "This is a semi-transparent free DNS service that uses multiple blacklists that include various telemetry and analytics blocking, malware site prevention, ad control and various security perks. It is a dedicated pi-hole service using Adguard DNS for the backend.\n\nTo try it, add 70.179.123.101 to your router or network connection settings for the DNS server. I used to have two but I am currently just at one and will post updates here as necessary.",
			"added": 1615053322
		}
	],
	"topic_vote": {
		"1615061408_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1607077342_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 1,
				"body": "Hello FBI agent, how are you doing?",
				"added": 1607077811
			}
		],
		"1607283206_1GmSP4jfJEvcrTYaDmsfocWCXETGPghSDH": [
			{
				"comment_id": 2,
				"body": "https://translate.google.com/translate?hl=en&sl=auto&tl=en&u=https%3A%2F%2Fwww.thepaper.cn%2FnewsDetail_forward_10231077\n\nQuick english translation link",
				"added": 1607306462
			}
		],
		"1608250382_1vHZxSPDWPsY1FxSNrccx845qs4AoNtq2": [
			{
				"comment_id": 3,
				"body": "People are divided into two types: \n\nThe blue pills, the slaves, those who get all their information from the mainstream media and are naive enough to believe that nothing bad can happen to them (until it does) and think there is nothing else in life than to do their 9 to 5, retire and die. If they'll do anything at all, they will sacrifice themselves to keep the control grid in place because they can't see the prison that was built around them.\n\nThe red pills, the free thinkers, people who are open to the idea that the world is completely screwed up (usually by little more than simply paying attention to the world around them) and realize there is no reason the world has to be like this, think that people like Alex Jones is actually on to something because he has a track-record that exceeds Nostradamus due to his analytical ability and understanding the world isn't all rainbows and puppies. \n\nI just hope our \"Neo's\" they will make the similar sacrifice to keep what little freedom we have left in our world.",
				"added": 1608461933
			}
		],
		"1610169002_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "There's no way I'd ever use an app that asks for things like my SSN, no matter how good it is",
				"added": 1610170750
			}
		],
		"1610682330_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 5,
				"body": "I have a server that's running a node with a lot of free space and bandwidth dedicated, I am just looking for sites to help host. I have a few of the mentioned sites added but I am always looking for more that are well used to help host.",
				"added": 1610683823
			}
		],
		"1611157084_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": [
			{
				"comment_id": 6,
				"body": "Maybe you should turn off your TV",
				"added": 1611178904
			}
		],
		"1611491350_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 7,
				"body": "It works",
				"added": 1611494448
			}
		],
		"1612173389_1P99tURa4T43muCjSejqPrYHsi9km7g2X6": [
			{
				"comment_id": 8,
				"body": "\"For Western medicine, COVID-19 is a life-threatening disease; while for Chinese medicine, COVID-19 is just a cold.\" That sounds exactly like something the CCP would say. It's just like how China stopped reporting Covid deaths just a few months in the pandemic to make sure they wouldn't be anywhere near number 1 in the numbers. They release it on the world and then ban terms that label it as a Chinese virus. You can't believe anything they tell you.",
				"added": 1612200323
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "Better a conspiracy theorist than a complacency theorist, asking questions is healthy.",
				"added": 1612383466
			}
		],
		"1612481231_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "No, they are not. The mandatory use of them, however...",
				"added": 1612490186
			}
		],
		"1613249444_163UBLKC6u68qLy8ymG8dQKzE4KXLm75yY": [
			{
				"comment_id": 11,
				"body": "What the fuck are you talking about? Are you really that dumb or are you some just some counter-intelligence shill. This is basically just verbal diarrhea.",
				"added": 1613250976
			},
			{
				"comment_id": 12,
				"body": "Yeah, I thought so.",
				"added": 1613256286
			}
		],
		"1613332768_1KKDj2JuKJ1M6SsUyTuFG4Wbndu7Y7XAJr": [
			{
				"comment_id": 13,
				"body": "Oldest trick in the BTC  book",
				"added": 1613334103
			}
		],
		"1613730379_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": [
			{
				"comment_id": 14,
				"body": "Added two dedicated peers for the English, may add the rest as well.",
				"added": 1613773169
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 15,
				"body": "They're not the problem, the ones to blame are well above them.",
				"added": 1615152156
			}
		]
	},
	"comment_vote": {
		"1_153Xi8knyBkgxoom2XgYaHYDFZ42hMJaU5": 1
	}
}