{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1602267852,
			"title": "Twitter found at least 926 accounts with suspicious of Thailand army's information operation",
			"body": "According to Twitter's report, said that about 926 Twitter accounts are related to Thailand army's information operation. Deputy Chief of Staff Santipong Thampiya, by the time, had declined. \"We didn't have any IO or related. Also as our social media accounts are purposely used for publicize and help people.\", Said Santipong.\n\nAs the side of Thai army's spokesman, also said this was not justified, due to lack of deep analysis of those anonymous accounts, not their own official.\n\nReference: https://www.blognone.com/node/118929 (Thai)",
			"added": 1602267851
		},
		{
			"topic_id": 1602684360,
			"title": "Anyone here knows how to increase network latency on purpose?",
			"body": "I just want to make my own network NOT suitable for gaming, bcz my d__ba__ brother just have annoyed me with his friend with his night time gaming. Tried search for how-to, but found nothing.",
			"added": 1602684358
		},
		{
			"topic_id": 1602791912,
			"title": "Please help poor Thailand by signing this petition.",
			"body": "Warning! : External Link -> chng.it/VtsBHyz865",
			"added": 1602791909
		},
		{
			"topic_id": 1603284377,
			"title": "I'm curious, is there anyone who can bring ZeroNet or Freenet as a dedicated network into a private or totally isolated environment (like, into Cuba for example)",
			"body": "I've seen this vlog from http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1603283195_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK. As far as I know, Cuba almost has zero access to the internet, and one who has it is always monitored. In the video, they have made a dedicated intranet called SNET (stands for Street Network), and many people gain access to it, mostly for games, and others for a dedicated web server for shopping.\n\nBut there's a problem, the network itself is quite unstable, likely if someone who is the main host or a bridge has died (disconnected), the network is partially \"shut down\". This can be annoying when you are on the internet and someone keeps dying on the line.\n\nSo, is ZeroNet really suitable for this type of network, I mean, we can create a never-die network for them. Can it be designed to work on this form of network? It would pretty much help the network stability. Plus number of people in this network are not that large already (around 20K)",
			"added": 1603284373
		},
		{
			"topic_id": 1609017796,
			"title": "What happens when there are millions of 'like' or 'vote up' interactions happened on ZeroNet?",
			"body": "Ain't that slow down or freeze the network entirely? It may sounds ridiculous or impossible, but I'm just curious.",
			"added": 1609017791
		},
		{
			"topic_id": 1609524025,
			"title": "It seems like all video zites are dead",
			"body": "I clicked on many video zites and they didn't work. It kept saying like \"function is missing\" or somehow.\nHere is one: http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/\n\nHow can I fix it?",
			"added": 1609524019
		},
		{
			"topic_id": 1609922680,
			"title": "Does Bitcoin network not use any sort of network encryption, but ZeroNet does?",
			"body": "I tried searching for information, but details I found is quite confusing.",
			"added": 1609922673
		},
		{
			"topic_id": 1610479210,
			"title": "Consider forking ZeroTalk in my hometown language, where should I start?",
			"body": "Consider making a board for my folks, but I don't know how to start making it.",
			"added": 1610479202
		}
	],
	"topic_vote": {},
	"next_comment_id": 38,
	"comment": {
		"1602309517_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 1,
				"body": "It depends on remote site, because if it does go out of your control, it's gone. If you desire to increase your size limit on remote site, it's like trying to sneak into other's house and expand their area for your own mail without permission. \n\nAnd as my experience, ZeroNet also asks me to increase site limit for ZeroHello.",
				"added": 1602316047
			}
		],
		"1602349275_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7": [
			{
				"comment_id": 2,
				"body": "I somehow felt like ZeroTalk is like  Cytus 2's iM system (it's a music game), but in real life.",
				"added": 1602350931
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 3,
				"body": "hhasdawdawfw",
				"added": 1602350949
			}
		],
		"1602610264_12753F1cUp1iuvwJYJCsD2nvniWM9Yt6sK": [
			{
				"comment_id": 4,
				"body": "add a new one from http://127.0.0.1:43110/zeroid.bit\n\nthen, change your user agent to new id from user chooser menu (depends on what zite you are in)",
				"added": 1602657393
			}
		],
		"1602719673_1DxTtidQDLuoPMUtirmLG6qNc1jFrku7X7": [
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_2587_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Here you go: [...]\n\nCursed",
				"added": 1602765574
			}
		],
		"1602793600_1KBkXs64bRMnZoTXzq5gdrsd1ZupSfMrwE": [
			{
				"comment_id": 6,
				"body": "If your game is not real time, just make sure you have some good logic on trust system. Maybe blockchain can help you.",
				"added": 1602801679
			},
			{
				"comment_id": 8,
				"body": "I've got a bit understanding on the idea. Maybe you can get it to work. Even that you have said it's a real time game, but network communication for Travian-like games like this are not frequent. Blockchain implementation definitely can help you here.",
				"added": 1602972601
			},
			{
				"comment_id": 9,
				"body": "> [legor](#comment_2_1KBkXs64bRMnZoTXzq5gdrsd1ZupSfMrwE): The same server of the \"OGame\", maybe it really looks like \"Travian\", this is a PHP script that we want to have here. [...]\n\nIf you want to directly run this code on ZeroNet, unfortunately, ZeroNet still only supports it's own API called ZeroFrame, which is based on JavaScript. Currently, there is no way to implement alternative runtime on ZeroNet remotely, unless you create an extension and invite others to install and use it.",
				"added": 1603137160
			}
		],
		"1602791912_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 7,
				"body": "> [leaks](#comment_4_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU): Can we not turn this country into another Syria? I get that they want to do away with one monarch/dictator, but a civil war will ensue, people will starve and NATO, Russia, China will break the country apart. Get this done peacefully or don't get it done at all.\n\nIt wouldn't go on that way, as my experience would tell. Maybe, nothing will happened from these petitions/protests. But it will be a great example of such a weird monarch + Communism in this country, and Thais are trying to fix it.",
				"added": 1602926736
			}
		],
		"1573616487_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "GM dev here. Mostly I made GM extensions for HTML5-based games, like multi-touch or WebSocket. Sadly, I'm still figuring out how to create sites on ZeroNet, and also don't have enough time due to hell of commissions.",
				"added": 1603199107
			}
		],
		"1603107058_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 11,
				"body": "It definitely can be done. You just fork ZeroTalk and modify them to be a Thai forum, then publish to ZeroSites or even better create a .bit domain. Anyone who wants to use it will also help replicate the board for you.",
				"added": 1603208753
			}
		],
		"1603191016_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 12,
				"body": "If the binary is not yours, also attach the original hash from site you retrieved it.",
				"added": 1603362615
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 13,
				"body": "Not everyone are interested in illegal stuffs, like you, here. Basically, any contents you download are based on your interests, and you won't be stopped by searching for that. \n\nThe main purpose of ZeroNet is to be a censorship-free platform, not dark internet. Think about you want to upload illegal stuffs, surely someone will stop seeding and delete your stuff from their peer, because data is also under their control, or it will be stored by someone else who likes your stuff. \n\nBut to be clear, there are some folks distribute illegal stuffs here, search from ZeroUp with your own risk. Some china GFW stuffs can also be found here, and that's my main point of using ZeroNet here.",
				"added": 1603515643
			}
		],
		"1603504012_1CNbp1ekMfWRzS6QeEYMoD9UxHgmnwznb9": [
			{
				"comment_id": 14,
				"body": "Maybe, you will plan for your data usage, and download some sites you wanted. Think about you are in the remote area, and mail rarely delivers to you. And you will be very happy with ZeroNet. \n\nDo not forget to configure your ZeroNet client to stop or limit seeding bandwidth.",
				"added": 1603516059
			},
			{
				"comment_id": 15,
				"body": "> [zeroseed2](#comment_16_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz): You can run zeronet on a dedicate server/vps hosted near you or try to access zeronet via tor. This should fix this. You can also use my proxy https://0net-preview.com\n\nOff-topic, how can you integrate TLS to ZeroNet? I've really wanted to do that, because I want to use ZeroNet from my dedicated server, but found nothing.",
				"added": 1603542773
			}
		],
		"1603695205_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 16,
				"body": "Linux 5.8 (Debian Buster as Server + ElementaryOS in everyday use)\n- As memory serves, I've used Linux since 2.6.8\n- I used Windows 98.\n- I'm not any familiar with Mac OS.\n- I do use Kolibri as my temporary OS, mainly for recovery and experiment reason. \n\nI'm an ordinary user, so nope. I will not install anything that potentially could harm the system, especially driver which could give a direct access without hypervisors.",
				"added": 1603707255
			}
		],
		"1603711762_15T1rLX5qkySwZU2RB3dzYB3oDWxnEox3A": [
			{
				"comment_id": 17,
				"body": "Try to install it from source. Do not forget to install its dependencies from your OS distribution guide. (Basically, it's python3 and python3-pip)\n\nHere is what I found, never tried it before.\nhttps://discourse.coreelec.org/t/how-to-add-pyhon-modules/3830/2\n\nDownload source:\nhttps://github.com/HelloZeroNet/ZeroNet\n\nPs. I do install ZeroNet from source. It's own binary does not work on my server.",
				"added": 1603714626
			}
		],
		"1603894128_1JV9baqEPCwXcpw8YUJGNDvLJWhi2JTVMV": [
			{
				"comment_id": 18,
				"body": "20 yrs old or more: tinycore (a lot of command line stuffs)\n10 yrs or more: Lubuntu, Xubuntu, Arch with LXDE XFCE or i3, Manjaro XFCE\nOthers: Anything will work fine. But I recommend Pop!_OS or Manjaro",
				"added": 1603910076
			}
		],
		"1604200104_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "ZeroNet was built with torrent-based in mind. It is quite tricky to break the basis and reconstruct the new feature, since you have to split the content itself you interested out of the base zite. To be clear, ZeroNet does have content split feature by just start a new torrent and download/seed them dynamically, but it only supports files. \n\nBut if all you just wanted is a user follow button, then it's going to be quite easy. ZeroNet already supports content following button, but not for the account/person one. Also zite has to support this feature.\n\nIf possible, yes, voted for this feature. Quite nice to have this one.",
				"added": 1604254895
			}
		],
		"1605824826_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 20,
				"body": "Every states hate freedom of speech, even they are figured out as freedom state.",
				"added": 1605891439
			}
		],
		"1608328579_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 21,
				"body": "GFW is a sophisticated network gate that filters any suspicious traffic that is likely out-of-control, not only they looking for IP address, but also scan the content inside the package. Now, they even use AI for enhanced filtering. Even ZeroNet + Tor still finds a hard time to get it to work.",
				"added": 1608444363
			}
		],
		"1608604929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 22,
				"body": "> [deuxzaron](#comment_2_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): On Stadia it's not bad. It's not great either. Considering it was delayed to iron out the glitches there shouldn't be glitches. I've seen Jackie walk through lockers and ride his bike straight into a pole. Hopefully like No Man's Sky they get shit fixed\n\nI'm thinking about moving to Stadia. Thanks for the information.",
				"added": 1609212669
			}
		],
		"1609524025_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_2836_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): If people are using the DIY compiled dependencies version of ZeroNet (ZeroNet-py3), then that explains the problem. That version gave me a seeding problem.\n\nAny advises to workaround this issue?",
				"added": 1609540017
			},
			{
				"comment_id": 24,
				"body": "It seems like the mainline Python runtime on Debian Buster screwed up with ZeroNet, changed the runtime to the ZeroNet-provided one and it works just fine.",
				"added": 1609787500
			}
		],
		"1609856915_1EgNFQT4TxGEw7UpWfaRhEButB3vYqqXQk": [
			{
				"comment_id": 25,
				"body": "Ps. except some illegal genres. I won't gonna find it for you. Try keep scrolling through the board or ZeroUp.",
				"added": 1609869528
			}
		],
		"1608417688_1HrVG2Jz8897agGqyS3oYyFeaocypxp8Mg": [
			{
				"comment_id": 26,
				"body": "It's not down, it's just there's no serving peers online on that time.",
				"added": 1610009156
			}
		],
		"1609922680_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 27,
				"body": "> [zeroflag](#comment_1_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu): Bitcoin and basically every cryptocurrency is completely built around encryption. If you mean anonymity then that's a different topic. You can have a Bitcoin address which is not in any way connected to your identity at all. Theoretically you can create one with pen and paper if you know the algorithm and use dice or coin flip for randomness. You can send BTC to that address. Only when you want to send BTC from that address to another you have to use software connected to the internet. You would need an anonymous way to buy and/or send BTC to that address so the address it can't be tied to your identity.\n\nSorry for the confusion, I mean do they both (or individuals) use any sorts of encryption for communicating with each peers?",
				"added": 1610042879
			}
		],
		"1610213876_1DwHLw8xozvxUCnABQUo3RENEScpas5kRj": [
			{
				"comment_id": 28,
				"body": "If you mean the entry point, you may go to [http://127.0.0.1:43110/Mail.ZeroNetwork.bit/](http://127.0.0.1/Mail.ZeroNetwork.bit/)",
				"added": 1610215314
			},
			{
				"comment_id": 29,
				"body": "Oops, wrong link, here's a fix: [http://127.0.0.1:43110/Mail.ZeroNetwork.bit/](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/)",
				"added": 1610215399
			}
		],
		"1610267529_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": [
			{
				"comment_id": 30,
				"body": "I see you talk about password, I guess you may get it opposite. \n\nThe whole idea of this network is about trust-based communication.\n\nYou don't need any sort of authentication (like password) at all, because you are, of course, the system owner, along with others which had their own system. All you do is sending and receiving contents from other users (peers). When you first join to the network, you just tell anyone that \"hey, my name is ..., and here is my public key;:$@#%!\" and publish it.\n\nWhen you do something (in term of communication), you write data, and attach it with your public key and cryptographic signature, then publish them all over known users. They then will read the name & public key, if it is you (verified by your signature), they will likely keep it for others who do not have your data.\n\nIn term of signature, I mean the \"digital signature\", which is a pair of three things, private key, public key, and signature. They will be used by cryptographic mathematical calculation.\n\nPrivate key is a key to keep secretly, and be used to encrypt or write a signature. That means you don't need a password, except in the case you want to lock (encrypt) the key inside your device.\n\nPublic key is, of course, a key to share with others. People will identify you with this thing, and also be used to verify a signature with a cryptographic methods.\n\nSignature, is a cryptographic stream of bytes generated with a private key and stream of data as a template to ensure no one tamper your data and being sent safely.",
				"added": 1610305008
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 31,
				"body": "maybe he needs mental illness treatment",
				"added": 1610370868
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 32,
				"body": "You can use any OS in your favor, none of them had vulnerability than others. But if you really care about your data, you may consider using virtual machines, like using Qubes OS, but sacrifices the ability to run advanced software like games. And running Whonix + ZeroNet on top\n\nPs. ZeroNet is not designed for privacy or anonymity, it just a decentralized platform. If you run the network, especially without Tor, someone can take a little more effort to find that you are using the platform. By nature, anonymity of ZeroNet increases when there are many people holds the same data, because it becomes harder to find the original author of pieces of data.",
				"added": 1610371537
			}
		],
		"1610354895_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 33,
				"body": "You can find the information from many places by searching keywords independently. All stuffs you had mentioned had independent technology or combinations. ZeroNet uses Bitcoin wallet to generate data address, encryption for transmission and privacy, digital signature for identity, it does not have any concepts of blockchain since it is unnecessary to operate the platform.",
				"added": 1610371905
			}
		],
		"1610353747_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 34,
				"body": "If it does run on Node.JS, there may be a chance. But it's not.",
				"added": 1610390877
			}
		],
		"1610438350_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": [
			{
				"comment_id": 35,
				"body": "so you made [WeHateFreeSpeech.com](http://WeHateFreeSpeech.com) to be a real domain too?",
				"added": 1610478950
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 36,
				"body": "I don't really trust all of those apps in the case of privacy. P2P chat would be wise for the purpose.",
				"added": 1610765812
			}
		],
		"1620574964_1C6gAPEiSgWRPes1bmpFhWcKGyyT2WMTiX": [
			{
				"comment_id": 37,
				"body": "No way it can be. It's just a favor of choice. As the best in can go, it'll never hit million concurrency.\n\nThe biggest roadblock of IPFS is stil a concept of 'identity', which there is no exact solution to be usable in the real world. As long as we still relies on trust-based mechanism, people still need to meet in-person to exchange security measurements to avoid using it. Another big roadblock is 'content distribution', that all of current centralized services also utilize the concept of 'decentralization' to provide as best of both worlds, but it'll less likely to happen on a 'true' distributed platform.",
				"added": 1621180742
			}
		]
	},
	"comment_vote": {
		"375_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"52_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": 1
	}
}