{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Dans un Wiki de type ZeroWiki, comment inclure des images ?",
			"body": "J'ai créé un Wiki perso en clonant le ZeroWiki, mais je ne sais pas comment y inclure des images.\nJ'ai essayé de les placer directement dans la zone data du Wiki, mais elles ne sont pas propagées\nvers les ordinateurs des autres participants du Wiki.",
			"added": 1529874501
		},
		{
			"topic_id": 2,
			"title": "Sites clonables, sans publication",
			"body": "Des sites de Zeronet sont clonables, ce qui est très chouette, mais comment être sur que le code de ces sites ne publie pas des informations sur certains indexes ?\nQuand on souhaite créer un site partageable par une communauté privée, existe-t-il des modèles dont on est certain de la discrétion (je n'ai pas le courage de rentrer dans le code pour voir).\nPar expérience, j'ai constaté que le clonage de zerotalk ou zerochat entraîne la présence de pairs sur des sites dont je n'ai pas diffusé l'adresse...",
			"added": 1533572127
		},
		{
			"topic_id": 3,
			"title": "Série de sites vides sur ma page Zero-Hello impossibles à enlever.",
			"body": "6 sites sans titre, nommés par leur identifiant sont visibles à gauche sur ma page ZeroHello. si j'essaie de les supprimer par le menu de ZeroHello, on me dit que j'en suis le propriétaire et que je dois les supprimer dans mon espace data, ce que je fais, mais à la connexion suivante, ils sont de nouveau là ...\nLes dossiers dans l'espace data sont absolument vides.",
			"added": 1542132718
		},
		{
			"topic_id": 4,
			"title": "Quel bilan ...",
			"body": "C'est dur de se dire qu'on appartient à l'espèce animale la plus bête de cette planète.\nhttps://fr.wikipedia.org/wiki/Th%C3%A9ories_sur_les_risques_d%27effondrement_de_la_civilisation_industrielle",
			"added": 1543830470
		},
		{
			"topic_id": 5,
			"title": "Recherche site clonable du genre \"Poster\"",
			"body": "Le modèle de blog \"Poster\" est intéressant, mais les chapitres sont chronologiques comme dans tout blog. Existe-t-il un modèle semblable pour faire un site, c'est-à dire pouvoir ajouter des chapitres n'importe où et pas exclusivement en tête ?",
			"added": 1563608972
		},
		{
			"topic_id": 6,
			"title": "Suppressions difficiles dans Zeronet",
			"body": "Que ce soit par l'action \"supprimer\" de ZeroHello, ou par la suppression directe du dossier, dans les 2 cas suivants, c'est impossible :\n- sur des sites absolument vides, dont je ne m'explique d'ailleurs pas la provenance.\n- sur des sites dont je suis propriétaire, et dont ZeroHello me dit pourtant qu'il n'y a aucun pair.",
			"added": 1564223066
		},
		{
			"topic_id": 7,
			"title": "Coup de gueule à propos de la situation absurde que nous vivons.",
			"body": "Mon coup de gueule va à ces puissants en tout genre dans le monde entier et à leurs fameux experts qui bien sûr n'ont jamais tenu compte des avertissements pourtant clairs du \"Club de Rome\" et plus récemment du rapport Meadows/Renders .\n\nPour résumer, c'est stupide d'accroître la population dans nos villes comme on le fait dans les élevages en batterie, ce qui est tout aussi stupide. \nIl ne faut pourtant pas être bardé de diplômes pour comprendre qu'une épidémie dans ces conditions devient vite fatale.\n\nJe me calme !  je me calme !\n",
			"added": 1585499869
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1_14gQY4WNgiKmTkrmPF6mGS5RcwNikfzayK": [
			{
				"comment_id": 1,
				"body": "Oui ipfs semble sympa, mais je vais plus simplement utiliser un clone du blog \"poster\" qui lui inclus cette possibilité de charger des documents et des images.",
				"added": 1530170957
			}
		],
		"3_14gQY4WNgiKmTkrmPF6mGS5RcwNikfzayK": [
			{
				"comment_id": 2,
				"body": "Comme je le dis dans mon message, c'est bien ce que j'ai fais, mais sans succès !!!\nJe me suis aussi aperçu que les adresses de ces sites vides sont connues dans mon fichier users.json, peux-t-on froidement les supprimer de ce fichier  ? ",
				"added": 1542706605
			},
			{
				"comment_id": 3,
				"body": "Dans mon cas, ces sites sont sur zerohello dans la rubrique \"owned sites\".\nA chaque redémarrage de zeronet, j'ai pourtant ces messages dans la console, mais les répertoires des sites sont toujours dans mon espace data :\n\n[13:21:48] - Creating FileServer....\n[13:21:48] - Creating UiServer....\n[13:21:55] SiteManager Deleting orphan site from content.db: 1BGzY525RukvPbZj3jCXxBfoeXGb87s3wy\n[13:21:55] SiteManager Deleting orphan site from content.db: 13MxkY4zcf9pE1NDwiu4S5TBFdC2zPt7xR\n[13:21:55] SiteManager Deleting orphan site from content.db: 1BwVurjrSVg34kTdFixy9hMiWKCF7i1VSv\n[13:21:55] SiteManager Deleting orphan site from content.db: 1Lc1pfpCDFioirXSVY3kHjWxQrg1FSrdj9\n[13:21:55] SiteManager Deleting orphan site from content.db: 14FZ9NVFjCw7d33NMUtm1UERfc1TJJogMA\n[13:21:55] SiteManager Deleting orphan site from content.db: 1LS6iSKtsNTzfppaUELu5rabg2jCmQQeRZ\n[13:21:55] - Removing old SSL certs...\n[13:21:55] - Starting servers....\n\n Je n'ai pas osé bricoler le fichier users.json .",
				"added": 1542890925
			}
		],
		"4_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 4,
				"body": "Bonjour,\nTrès bonne initiative, merci.\nComment peut-on participer ?\nExiste-t-il un forum français semblable à celui-ci ou l'on parle uniquement de Zeronet ?",
				"added": 1545820421
			}
		],
		"3_1NCFaqDcMU94Ce2qUrZg2QXUWzNcWSnpxR": [
			{
				"comment_id": 5,
				"body": "Oui, c'est une question que je me pose aussi, et en consultant les différentes docs, il n'y a rien de clair sur le sujet.",
				"added": 1561624191
			}
		],
		"6_14gQY4WNgiKmTkrmPF6mGS5RcwNikfzayK": [
			{
				"comment_id": 6,
				"body": "Oui en effet, c'est ce que j'avais fait aussi.",
				"added": 1566731961
			}
		],
		"1_1FSfeha2tbwLR8Y7md6z2XfkCeYJPgdLnJ": [
			{
				"comment_id": 7,
				"body": "Liens très intéressants !\nMerci pour ce message.",
				"added": 1570348788
			}
		],
		"1_1HYvVnPB2ZAL1SUUZ1t4sX4qBRsjvGoxNA": [
			{
				"comment_id": 8,
				"body": "Bonjour,\nSans photo, sans schéma, sans modèle de la porte, il sera difficile de te répondre...",
				"added": 1573291228
			}
		],
		"1_1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH": [
			{
				"comment_id": 9,
				"body": "Bonne idée !  mais ça ne fonctionne pas.\nJe suis allé voir dans le dossier, et j'ai vu qu'il ne contient que le fichier content.json ...",
				"added": 1584466608
			}
		],
		"1_1Lm7quPgcqy7kHXqXqA4wx3ddWecEjn7MD": [
			{
				"comment_id": 10,
				"body": "Salut, comme dit @mariage nous sommes tous plus ou moins à l'écoute ici,  mais souvent nous partageons des sites ou des essais en  petits groupes.",
				"added": 1585496437
			}
		],
		"9_1FSfeha2tbwLR8Y7md6z2XfkCeYJPgdLnJ": [
			{
				"comment_id": 11,
				"body": "Salut f0grx, \nbonne initiative, mais surtout il faut éviter  la diffusion de l'adresse comme ici par forum ou autres annuaires de sites, car au point de vue sécurité cela revient à la même chose qu'un blog public dans l'internet normal.\nIl faut donc  diffuser l'adresse en comité restreint chez les jeunes, et aussi assurer sois-même un hébergement minimum avec un raspberry par exemple 24h/24, car si le nombre d'utilisateurs est faible, ils seront vite découragés par l'absence de \"pairs\".",
				"added": 1588576471
			}
		],
		"2_17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc": [
			{
				"comment_id": 12,
				"body": "Oui, NewPipe c'était bien !  mais sur android 5.1, suite sans doute à des modifs ça ne fonctionne plus.",
				"added": 1597854746
			}
		]
	},
	"comment_vote": {}
}