{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_185UysPko7xLz54ExGz94Ywajd89X9bEg6": [
			{
				"comment_id": 1,
				"body": "说说中药注射剂那些事儿\n2017年6月11日 墙外仙 减小字体 / 增大字体 发表评论 阅读评论 \n放牛娃斯基\n​​​\n早上看见人日鼓吹中药注射剂的文章，俺吹了个小牛，说作为一个对化工和制药工艺都略有点了解的前字幕组，要写篇关于中药注射剂的文章，帮大家厘清下相关概念，算个小科普吧。\n\n学过初中化学的都知道化学式，绝大多数药品都有一个化学式，其有效成分非常清楚，而且纯度非常高，药品性能稳定。根据给药途径不同，分为外用药、内服药物、注射药物。外用药的不良反应相对少，最多起个疹子，内服药一般说明书会列明不良反应，由于口服后经消化系统代谢，药物作用路径相对较长，不良反应有，但是不致命。而注射剂通过肌肉或者静脉注射，直接通过血液、肝、肾代谢，其不良反应非常快，而且容易后果严重，想必做过青霉素皮试的小伙伴都有这个药物过敏的概念。药物一方面能治病，另外一方面难免会有不良反应，原因在于：1、药品生产过程中的杂质或者辅料发生毒副作用2、患者个体因素，人体体质不同，性别差异，年龄大小，对特定药物有反应和禁忌。3、与药物吸收、分布、排泄有关的因素：有些药物的不良反应与药物的药理作用有关，常表现为剂量依赖性，比如肝肾功能不全的，对特定的药物就有不良反应4、药物的相互作用，通常意义说就是光喝白酒不醉，你同时上好几种酒很快就倒了。\n\n正是因为药物作用的两面性和差异性，所以在药品研发过程中要进行三期临床试验，经过多年试验后批准上市，然后监管部门还会建立不良反应的报告制度，通过不良反应的追踪和分析，确保药品治病而不害人，常用药物常见不良反应的抢救方法也是大夫的必修课。总体上说化药一样有不良反应，主要由于患者个体差异、联合用药引发的多，禁忌事项相对清楚。\n\n那么同样的不良反应，为啥中药注射剂为啥有不良反应就引发监管和大夫的各种担忧呢？这得从中药注射剂的有效成分提取过程说起。我国中医药博大精深，但是有个核心问题没解决就是成分说不太清楚，知道它在起作用，但是不知道它是谁。而且中药讲究配伍，就是很少有一味药单独起作用，通常都要配上好几味药一起来治病。作为口服中药，基本没啥问题，但是做出注射剂，问题就来了，中药的有效成分是啥？杂质是啥？虽然有图谱，但是要写出分子式太难了。\n\n退一万步讲，有效成分不清楚没事儿，只要你能治病就行。但是治病时候要控制不良反应呀，现实中由于以下因素的存在，导致不良反应发生很吓人 ：（1）中药药材质量稳定性差。主要因其产地不同，受土壤、气候、采收季节等种植条件的影响。（2）中药注射剂成分复杂，多为大分子物质，如蛋白质、淀粉、鞣质、色素、树脂、挥发油等致敏成分及各种增溶剂、有机溶剂、调节剂等，这些成分既具有免疫原性，又具有免疫反应性，这些成分进入人体后刺激机体产生抗体或致敏淋巴细胞，当再次接触该抗原即发生过敏反应。（3）制备工艺因素。目前纳入国家标准的中药注射剂大多报批时间较早，工艺水平滞后。大多数涉及水醇法、醇水法、蒸馏法等方法制得的中药注射剂，所含成分为不够清楚的混合成分，尤其是复方中药注射剂，其有效成分和杂质的含量难于严格控制，安全性和有效性也就难以保证。（4）配伍因素。大输液在临床上多被作为载体，配伍一种或多种中药注射剂通过静脉滴注给药，输液的性质及pH值可影响中药注射剂在溶液中的稳定性。（注:综合自公开披露论文）\n\n转过来说，国家能不能在质量控制上下功夫，严格控制质量呢？目前国家的质量标准很不完善，只能对所含个别成分进行定性定量分析，说到根上是：我们即便知道里面是啥，咋检查控制知道一丢丢，对于剩下的东西无能为力。这种现状我只能引用一个文献大家了解下就知道了。权威文献《中国新药与临床药理》（2001，12（2）：67～72）总结中药注射剂的质量标准存在的问题较多，现分述如下：1）含量测定方法科学性不强《中药成方制剂》收载的70种注射剂中，有9种规定测定总黄酮成分，以芦丁计算含量，这些品种的总黄酮成分中不一定都含有芦丁，结构不同，分子量不同，最大吸收波长也不尽相同，应采用该品种本身含有非黄酮成分作对照品并计算含量。例如复方蒲公英注射液中蒲公英、鱼腥草、野菊花三味药均含黄酮类成分，但结构与分子量各异，均以芦丁作对照并计算含量，科学性差。2）缺含量测定 卫生部标准收载的70种注射剂中有8种未规定含量测定，即无量化指标，有的仅在〔检查〕项下规定在某一波长下吸收值不得低于多少。如黄瑞香注射液，在276～280nm波长，吸收度不得低于0.30，类似这样检查吸收值的情况还有5种注射液。而且所用波长相近，专属性差。特别是红花注射液，除肌注外，尚用于静脉滴注，只有吸收度的测定且列入[鉴别]项，其质量难于控制。3）可控指标少，含量微 如退热解毒注射液，由8味药组成的复方，但只测定绿原酸含量，并规定每毫升不得少于0.04mg。脉络宁注射液规定每支（10ml）含滨蒿内酯不得少于0.05mg，即每毫升为0.005mg，百万分之五（5ppm）。又如鱼腥草注射液甲基正壬酮含量，规定每毫升不得少于0.8ug，仅为百万分之0.8mg（0.8ppm），含量如此之微，对药品质量控制有何意义。4）标准不完善，缺原料质量标准 部颁药品标准《中药成方制剂》收载的夏天无、血塞通、血栓通、雪上一枝蒿总碱、正清风痛宁、灯盏花素、莲必治等11种注射剂，其原料为单体或有效部位，但夏天无、猪苓多糖及正清风痛宁注射液未附原料标准；血塞通与血栓通注射液，其原料均为三七总皂苷（前者为三七芦头提取物，后者为三七主根提取物）但其测定方法与限度规定均不相同）。\n\n毒舌如@陈如是说 夸张说化学注射剂好比注射了蒸馏水，中药注射剂好比注射了老火靓汤。虽然没这么夸张，但是在事实上确实有一比，特别是除了有效成分外的大分子和特殊蛋白及不明杂质，注射进了人体带来的过敏反应经常是致命性的。中药注射剂出现不良反应的原因跟化药有受药个体差异、联合用药等外，核心有一个原因是不知道什么东西过敏了！而且中药注射剂真过敏时候可能出现休克、肝肾衰竭等情况，危及生命。\n\n那么是不是所有的中药注射剂都不安全了呢，我不能这么讲。因为毕竟是经过国家严格审批同意上市的药物。相对来说，单方药物或者已经直接提取出有效成分明确的药物相对安全，比如得了诺贝尔奖的青蒿素就是救命良药。目前国家药监局在对中药注射剂安全再评价和一致性评价，如人日所说根据2017版国家基本医保药品目录，限制基层使用的中药注射液品种从2009年的6个增加到26个，且只能在二甲以上医院使用，毕竟基层医院抢救条件有限，出了事情容易出人命，所以限制点使用还是好。这点上，我要为国家药监局点赞。\n\n家里有老人和小朋友，万一生病去医院时候，能吃药就别不打针，能打针就别输液，真要注射前也记得问一声是不是中药注射剂，毕竟有很多名字分不太清楚，看看说明书上的有效成分和禁忌，要是都写不明那就小心点。\n\n最后还是祝大家都身体健康！中医药早日走向世界！",
				"added": 1497183981
			}
		]
	},
	"comment_vote": {}
}