{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565925621_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 1,
				"body": "> I would have preferred a much more \"toned down\" and elegant/minimal interface\n\nI for one love the home/opening page. Imagine if something like ZeroNet existed, but all of its practical uses/sites were hidden. Without a vibrant homepage, I think it would feel like No Man's Sky at launch: huge and infinite possibilities, but vast, cold, and lifeless. I think the interface is a pretty well-organized way of showing off the great tech that exists. In general the zero sites are pretty minimal, I mean ZeroMail has a send and delete button... thats about as minimal as you can get for email.\n\nI agree whoever controls it will have a ton of power. I mostly agree with your other points as well.\n\n> Basically, how reliable is the concept of ZeroNet? \n\nEven if all the developers get killed by the NSA, I've cloned the repo and can get it running myself. So I'd say pretty reliable.\n\n> I have no grasp of how big this thing is, how big it can reasonably become, what's being done in practical terms to make that happen, what the \"roadmap\" looks like, etc\n\nI do feel the same way about this though. And with most other GitHub repos I don't have this problem.\n\n>  even though I've a lot of experience with programming in general, and even JavaScript/HTML/CSS in particular, I find it very confusing as to how to get started with the API and whatnot\n\nWhile I agree, most of the industry API's like Google, Spotify, etc are straight nightmares to get working. While ZeroNet API isn't great, it seems to be above par. As someone who is working on my own library, its actually incredibly difficult to write basic documentation, especially when you want to change/improve the very feature you'd be documenting.\n\n> I do unfortunately get the feeling that there is that same old arrogant attitude among \"geeks\" \n\nI know exactly what you're talking about, but I'm not (yet) getting that vibe from ZeroNet.",
				"added": 1566012037
			}
		]
	},
	"comment_vote": {
		"7_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"40_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"62_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"290_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"24_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": 1,
		"1_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": 1,
		"89_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1_1LBs6NGC7ixZWkzQdd7RBMeMDQy6nWJNcz": 1,
		"4_1CtmW1WAMxFohHS3ovNPG4QeLADhdF4xkB": 1
	}
}