{
	"next_comment_id": 25,
	"comment": [
		{
			"comment_id": 1,
			"body": "@nofish\n> Whats your wishlist?\n\nSearch feature for ZeroTalk [issue #10](https://github.com/HelloZeroNet/ZeroTalk/issues/10) & ZeroBlog [issue #55](https://github.com/HelloZeroNet/ZeroBlog/issues/55) and Moderation feature for Zerotalk [issue #60](https://github.com/HelloZeroNet/ZeroTalk/issues/60).\nAlso my concerns is too big Zeronet directory: [this \"issue\"](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1515669115_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS)",
			"post_id": 125,
			"date_added": 1517854745
		},
		{
			"comment_id": 2,
			"body": "Thank You for important features.\n\n> Auto download big file size limit\n\nthis is nice feature, was very needed, because one though he will download all files but that was not true. Now it suggests there is a limit that can be modified by user. :-)\nI guess i have to discover somehow which sites i am distributing and set the higher file size limits on them if needed.\n\n> Display local peers on the sidebar\n\ni am using OpenVPN on my Windows home computer and i can see 15 Local peers, isn't this wrong..",
			"post_id": 128,
			"date_added": 1521618933
		},
		{
			"comment_id": 3,
			"body": "> [nofish](#comment_260_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj):\n> I only see 1 local IP for this site (which is correct), do you see it for every site or only for not-so-popular sites?\n\nI see \"Local: 2\" for this site. On KopyKatebig: \"Local: 6\". Other old unpopular, low peer blogs do not show Local at all.\n",
			"post_id": 128,
			"date_added": 1521627260
		},
		{
			"comment_id": 4,
			"body": "Some things that may need imporing:\n- database corrupting when computer crash\n- slow newsfeed at random times when it has to search many sites (100 in my case)\n- newsfeed search/loading is blocking loading of other zites concurrently (needs multi threading)\n- let zeronet automaticaly and regularly backup most important user settings/configurations files and allow easy built in recovery of the backups\n- let zeronet automaticaly find updates and notify user, update function is hidden currently\n- download updates not from a single point of failure (github, zeronet.io) but from zeronet itself?",
			"post_id": 130,
			"date_added": 1525364164
		},
		{
			"comment_id": 5,
			"body": "Number of the ZeroNet users is not high. Why there is no updated list of their IPs so these can be used by the ZN for further peer discovery instead of trackers? Would they all be blocked by GFW? [DHT feature](https://github.com/HelloZeroNet/ZeroNet/issues/57) would not solve GFW issue? There was somewhere suggestion ZN user be allowed upon ZN start to input IP/s of other fellow ZN users he knows and this way connect ZN and discover other peers from these privately known IPs.",
			"post_id": 130,
			"date_added": 1527067023
		},
		{
			"comment_id": 6,
			"body": "**Curious how the ContentFilter works**:\nAfter updating ZN i see i have v. 0.6.3, i go to sample [blocklist site](/1FiLTerEAHp7UT8Aw2zQBypcm5T14kgZDa) and visit sample blocked site successfuly. Then i enable sites blocking and try to visit blocked site again, and i can still visit it which is confusing how this filtering works. I see the ContentFilter plugin folder is not disabled.",
			"post_id": 131,
			"date_added": 1530018534
		},
		{
			"comment_id": 7,
			"body": "I see, when i deleted the site, i am properly blocked attempting to visit it.\nThough i think if there is a button to visit the site, there should also be a button to go back or close the browser tab. It is always easier to click only one big enter button than moving cursor away finding small button to close the tab. I think it should be much easier to go back or close than to enter blocked site. The reason for blocking should be highlighted as it is the second most important text on the page (after the message that the site was blocked).",
			"post_id": 131,
			"date_added": 1530046749
		},
		{
			"comment_id": 9,
			"body": "Here is my testing blocklist site: [ssdifnskdjfnsdjk's blocklist](http://127.0.0.1:43110/13CgSQeywg2ius5pjXVCk7dKUCRkz5xvW3/)",
			"post_id": 131,
			"date_added": 1530183192
		},
		{
			"comment_id": 10,
			"body": "@nofish regarding the page which informs user the zite is blocked, i usually visit bad sites somewhere from the depth of the Zeronet, not from ZeroHello, so the \"Back to homepage\" button only create new duplicate tab with ZeroHello (i usually have it already opened). The [\"Close tab\" button](https://www.w3schools.com/jsref/met_win_close.asp) and [\"Go back\" button](https://www.w3schools.com/Jsref/met_his_back.asp) would be more useful there.",
			"post_id": 131,
			"date_added": 1530194186
		},
		{
			"comment_id": 11,
			"body": "> [ornataweaver](#comment_11_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): \"I also changed the title of the block listing menu item and planning to also list the locally blocklisted sites there.\"\n\nHe mean main ZeroHello menu where one manage the users one muted. (the three dots menu next to ZeroHello logo). He changed menu entry name. And he plan to show there also the sites you manually blacklisted when deleting them.\n",
			"post_id": 131,
			"date_added": 1530198903
		},
		{
			"comment_id": 12,
			"body": "In my opinion the bulk user blocking feature may require additional user confirmation or an on-site notice like: \"If you enable blockling of these users you will not see ANY content (including posts that may be safe and useful) that they have posted across whole Zeronet and the content they will post in future!\" so people really understand what they are doing by clicking that switchbox?",
			"post_id": 131,
			"date_added": 1530611089
		},
		{
			"comment_id": 13,
			"body": "> Add notification about hosted blocklisted sites\n\nThank You, also for allowing to hide these notifications",
			"post_id": 132,
			"date_added": 1531288493
		},
		{
			"comment_id": 14,
			"body": "Thank you for ZeroUp search field, very usefull. I am missing it on ZeroBlog & ZeroTalk.",
			"post_id": 134,
			"date_added": 1532595401
		},
		{
			"comment_id": 15,
			"body": "@leftside You are not the first one facing this ISSUE. I agree with you. [Check here](https://github.com/HelloZeroNet/ZeroMe/issues/123) are proposal to solve this. nofish if you raise styromaniac limit, please kindly also raise mine on sunhub.",
			"post_id": 133,
			"date_added": 1534319936
		},
		{
			"comment_id": 17,
			"body": "Nice new fixes, features.\nAt /1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1\nNot Found\nindex.html\nTrackers 10/16, port closed, tor available. 16 peers. ZeroHello shows next to site: \"Running out of size limit\" 20MB, but on site i do not seen any pop-up. When i click to raise limit, update(restart) Zeronet, still not work. How to discover cause of this?",
			"post_id": 142,
			"date_added": 1544774211
		},
		{
			"comment_id": 18,
			"body": "> [nofish](#comment_322_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Do you have something in your  data/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1 directory?\n\nonly content.json file 37KB. In it, index.html is listed:\n  \"index.html\": {\n   \"sha512\": \"b80dbc73c9f6ac6020751734d3018efd644fe9702ab8a6af17749be9650492ea\",\n   \"size\": 31761\nthe site on ZeroHello do not appears like some file update failed, Check files works. But i am wondering why it do not download index or other files/folders beside content.json. The (0) menu of the site not opening.\nSpotted this log line: Site:1DocsY..kVv1 No info or size for file: index.html, removing from bad_files\nWanted to check latest /data/debug.log entries, but i see the file is not updated since morning when was around the time i updated zeronet to recent revision.",
			"post_id": 142,
			"date_added": 1544793981
		},
		{
			"comment_id": 19,
			"body": "> [nofish](#comment_323_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj):\n\nyes, enough free disk space, for example ZeroTalk clone loading and i can upvote, which gets published and is preserved upon page reload. I tried to quit ZN and in zeronet.conf comment out data_dir line:\n\\#data_dir = Z:\\ZeroNet\\data\nstarted ZN and it used empty /data dir with only users.json file, no sites and in this case site opened without problem!\nAlso it opened when i quit ZN and set:\ndata_dir = Z:\\ZeroNet\\data2\n(i copied whole data folder (which was empty before this recent session) to become data2)\nbut when i changed back to:\ndata_dir = Z:\\ZeroNet\\data\n(which is my main large data folder), it not working. (1Docs*** , MIllchan... not loading (gray empty zeronet page with (0) button, non stop loading tab) - 1Docs shows mentioned No index error)\n\nNext day i tried to click to update Zeronet because even Search in connected sites not worked, and it solved the issue (it was rebuilding the db around 30 minutes) and [here are log entries from that](/Talk.ZeroNetwork.bit/?Topic:1544973426_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/Site+db+malformed+after+content+db+rebuilt+too+many+values+to+unpack+ZeroHello).",
			"post_id": 142,
			"date_added": 1544801359
		},
		{
			"comment_id": 20,
			"body": "@nofish @mcdev Hello, when i post a comment on a Millchan merger site http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC , it pop up an auto-hidding message that the content was published to peers. Good, but at same time it shows non-autohidding message:\n\"1 modified file\ndata/users/content.json [Sign & Publish]\" and it ask me Private key. This is not my merger site nor hub.\nisnt this redundant message while my content was published, why to publish it again?",
			"post_id": 143,
			"date_added": 1549132514
		},
		{
			"comment_id": 21,
			"body": "[List of ZeroNet blocklists that are using ContentFilter plugin](/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1549533305_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/List+of+ZeroNet+blocklists+that+are+using+ContentFilter+plugin) (ZeroTalk topic)",
			"post_id": 131,
			"date_added": 1549533736
		},
		{
			"comment_id": 22,
			"body": "> New updater that also support updating bundle runtime files\n\nWhat does this mean for the user? Are there still any files in zeronet directory that can not be updated and user need to update them manually?",
			"post_id": 146,
			"date_added": 1559839396
		},
		{
			"comment_id": 23,
			"body": "@everybody: i would backup the file, restart zeronet, try to find your site address in the file and see if there is any syntax error around, compare the non-woring site code (one in users.json) with your other (working) site code, restore earlier backup and compare both backups.",
			"post_id": 148,
			"date_added": 1565303890
		},
		{
			"comment_id": 24,
			"body": "@Nofish maybe the [/Config](/Config) feature\n\"Threads for async file system reads\"\nand\n\"Threads for async file system writes\"\nis not yet complete. I wanted to report that at least one of these when enabled is causing my zeronet to eat up all the remaining memory (4GB+) and start SWAPping rendering my computer hardly usable.",
			"post_id": 152,
			"date_added": 1578126777
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"94": 1,
		"126": 1,
		"128": 1,
		"130": 1,
		"131": 1,
		"132": 1,
		"133": 1,
		"134": 1,
		"135": 1,
		"136": 1,
		"140": 1,
		"141": 1,
		"142": 1,
		"143": 1,
		"144": 1,
		"150": 1,
		"151": 1,
		"152": 1
	}
}