{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Buscando gente para charlar y crear contenidos (podcasts, webs, arte, expresionismo)",
			"body": "Tengo ganas de ver el esbozo de un mundo oculto y diferente. Creo que es una pintura que tenemos que hacer entre todos... -menciona que te gusta, que sabes o publica un sitio con tus referencias-",
			"added": 1465907486
		},
		{
			"topic_id": 2,
			"title": "Torrents y sentido",
			"body": "Use a network based on p2p free to post torrents of movies that either from their content, elements or script, perform the clear function of naturalizing in us that what we want to deliver, it seems a huge contradiction.\n\nUsar una red libre basada en p2p para publicar torrents de peliculas que ya sea desde su contenido, elementos o guion, cumplen la clara funcion de naturalizar en nosotros aquello de lo que nos queremos librar, me parece un enorme contrasentido.",
			"added": 1466066686
		}
	],
	"topic_vote": {
		"1_1FDJNGTu75RPazzaf7h7qe317H9bhho2hN": 1
	},
	"next_comment_id": 16,
	"comment": {
		"36_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 1,
				"body": "uno mas por aqui...",
				"added": 1465907240
			}
		],
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 2,
				"body": "un comentario en la web me recordo que lo habia leido anteriormente. El pasado desperto en el presente y aqui estoy.",
				"added": 1465907620
			}
		],
		"1_1K8SQkVCSEtF4o1jHitLiY1VfMcByDeDvm": [
			{
				"comment_id": 3,
				"body": "a mi el culo desde hace 4 años! son hongos, pero son divertidos! déjate de joder y ráscate con placer!",
				"added": 1465907689
			}
		],
		"1_1FDJNGTu75RPazzaf7h7qe317H9bhho2hN": [
			{
				"comment_id": 4,
				"body": "Hola gente! les quiero comentar que podemos usar mumble para charlar... -www.mumble.com-\n\nEtiqueta: el binario\nDireccion: mumble.elbinario.net\nPuerto: 60601\nNombre de usuario: \"el que quieras\"",
				"added": 1465907990
			},
			{
				"comment_id": 6,
				"body": "p> [polinesso](#comment_4_1Gfb349Y8BjRBSwTW3srWRXSdcMSocYVsC): ¿Y si mejor nos quedamos aquí?\n\n Si, pero aqui solo se puede desde la escritura! no desde la voz!\n\n Realmente no me agrada mucho la gente que se quiere esconder detras de internet y la distancia de la palabra escrita. Yo mismo ando por estos lugares para conocer \"mutantes\" -en la vida real casi no los hay- vivos! no temerosos..",
				"added": 1465910639
			},
			{
				"comment_id": 12,
				"body": "> [joupelotas](#comment_1_15ozgYJv56GXQcGMcHj6pGnzjCSi5KCE2a): Estaba pensando lo mismo creemos un blog en el que aportemos cada uno nuestros puntos de vista .\n\nhola... a ver, cada uno puede hacer su blog, pero no se si es posible hacer uno en el que escriban todos. me parece que tenemos que hacer una web. Aun no se como hacerlas en zeronet, si tu sabes y me avanzas algo de info mejor.",
				"added": 1466152745
			}
		],
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 5,
				"body": "hola gente! hay contenido streaming en zeronet?",
				"added": 1465908100
			}
		],
		"3_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo": [
			{
				"comment_id": 7,
				"body": "interesante che! pero ninguna idea ni conocimiento al respecto.",
				"added": 1465965371
			}
		],
		"3_157MVeoKveeBWvUFjemXzb1f4TJyZfzVkT": [
			{
				"comment_id": 8,
				"body": "hola che! ya lo vi, esta como ayer.\n Cual es tu nombre? nick? gracia? etc...  podremos charlar? me gustaria hacerte unas preguntas y ver que se puede hacer en zeronet, porque me esta sonando que esta \"red\" esta en buen camino y con algo de trabajo podemos construir cosas muy copadas...",
				"added": 1466049664
			},
			{
				"comment_id": 14,
				"body": "La verdad esta buenisima, tiene toda la pinta.. en que te podemos ayudar? no se javascript! solo html y css...",
				"added": 1466153728
			}
		],
		"2_1GtJqyJRsuZhmxVtw5USgvqGbUmVH7EmBD": [
			{
				"comment_id": 9,
				"body": "> [yo](#comment_21_1GtJqyJRsuZhmxVtw5USgvqGbUmVH7EmBD): http://127.0.0.1:43110/1KmvqK1WUidEA5vH3KVb6xExAfW7maj9jK/www.voachinese.com/index.html \n> mi experimento con los chinos tampoco tiene mucho éxito :/  esto va de mal en peor\n\nme tenes podrido con los chinos! y como quiero ver que carajo has echo me hiciste aumentar la capacidad de almacenamiento en 5mb... LPQT!! jajaja..\n Espero que este bueno..\n\nP.D.: no eran 5 mb, eran 5gb LPQTP!! HDMP!!! \n",
				"added": 1466066919
			},
			{
				"comment_id": 11,
				"body": "Respondiendo al topic... veo que tenes un enfoque muy economico al respecto. Hay gente que quiere hacer cosas porque las quiere hacer, no por algo a cambio.",
				"added": 1466067586
			}
		],
		"1_1GsrTPLoAfhqn8Ds4DDNjYRzupw5inbm9": [
			{
				"comment_id": 10,
				"body": "GENTE!! y como podemos hacer una biblioteca? (material tengo o se consigue claro..) es decir; como alojamos el material?",
				"added": 1466067071
			},
			{
				"comment_id": 13,
				"body": "> [ceritium](#comment_10_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo): Desde mi punto de vista para compartir ficheros está el torrent y otras tecnologías que aún no controlo como ipfs.Zeronet se puede aprovechar para publicar y listar estos torrents (magnets) .\n\nCorregime si me equivoco certium -o cualquier otro-, porque nunca comparti torrents pero tengo intenciones de hacerlo desde hace rato, tambien ed2k (ando de un lado al otro y recien ahora estoy mas sedentario). \n Para hacerlo solo se necesita un pc prendido con un directorio o varios donde se aloje el material de interes y el gestor de torrents de nuestra preferencia activo? Vi que con el gestor hay una opcion de \"crear torrent\" de un archivo o un directorio completo. Esto seria en el lado servidor digamos. Luego resta publicar el torrent  en algun lugar -en zeronet no se donde-, o quizas hacer un enlace magnet pero ya no se que son, solo se que me funcionan, jeje..",
				"added": 1466153533
			}
		],
		"1_15Pp74LJxb9UZS7U3jffibZTZc73b6jbKr": [
			{
				"comment_id": 15,
				"body": "..y... eso depende de a que chico... no todos los pibes se pueden educar de la misma forma para proporcionarle cariño y firmeza.\n igualmente, yo estoy convencido de que todo es muy simple. A un chico, a nuestros hijos los hacemos hacer lo que queremos mediante el amor, casi de la misma forma en que nuestro gato sigue el paquete de comida cuando le servimos. Asi un niño bien amado sigue el amor de sus padres. Claro! primero hay que amarlo profundamente. no dejar que el mundo con sus valores y llamados perturbe los momentos con nuestro hijo, interfiriendo la fraternal union.\n Una vez entendido esto, se pasa al segundo asunto... que es como evitar que tal apego se vuelva excesivamente demandante.... Hay que usar la inteligencia! usar la devocion que tu hijo tiene por ti e inculcarle acciones o actividades beneficiosas. Es un metodo de transferencia. El niño solo entendera que haciendo 'tal cosa' esta amando a su padre o madre sin estar encima de el, asi nos demostrara el mismo apego y amor indirectamente.\n\n No creo que necesites mas viejo, lo que natura non da salmamca no presta! saludos y suerte con el humanito!",
				"added": 1466154789
			}
		]
	},
	"comment_vote": {
		"2_1Gfb349Y8BjRBSwTW3srWRXSdcMSocYVsC": 1,
		"6_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo": 1,
		"45_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": 1
	}
}