{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1585772362,
			"title": "Technitium Mesh - это безопасный, анонимный одноранговый (p2p) открытый мессенджер с открытым исходным кодом,",
			"body": "Technitium Mesh - это безопасный, анонимный одноранговый (p2p) открытый мессенджер с открытым исходным кодом, разработанный для обеспечения сквозного шифрования. Основной целью разработки этого мессенджера является обеспечение конфиденциальности, которая достигается с помощью криптографии и анонимности с использованием сети Tor. Он может использоваться через Интернет и частные сети LAN (без Интернета) для обмена мгновенными сообщениями и передачи файлов с поддержкой частных и групповых чатов.\n\nMesh основан на Bit Chat и является его преемником. Mesh берет основные идеи от своего предшественника и удаляет некоторые. В частности, Mesh не требует централизованной регистрации пользователей и обеспечивает поддержку анонимного профиля с использованием скрытого сервиса Tor. Он также исключает использование трекеров BitTorrent для поиска пиров, что вызывало проблемы с Bit Chat, поскольку некоторые интернет-провайдеры, блокирующие трафик BitTorrent, также блокировали трафик Bit Chat. Вместо этого Mesh использует только распределенные хеш-таблицы (DHT) для всех целей.\n\nMesh позволяет создавать как чистые p2p, так и анонимные профили с поддержкой одновременного запуска нескольких профилей. Как p2p, так и анонимные профили являются совместимыми, так что пользователь профиля p2p может подключаться к анонимному пользователю профиля через сеть Tor.\n\nВ Mesh метаданные не генерируются. Идентификатор пользователя разработан таким образом, что его можно изменить в любое время, чтобы скрыть личность. Поскольку нет регистрации пользователя, мы не знаем, кто использует Mesh или сколько людей его используют. В режиме p2p соединения используют соединения IPv4 или IPv6 напрямую для соединения с одноранговыми узлами без какого-либо промежуточного сервера. В анонимном режиме все соединения осуществляются через сеть Tor и используют скрытый сервис Tor для приема входящих соединений.\n\nhttps://mesh.im/",
			"added": 1585772361
		},
		{
			"topic_id": 1586964506,
			"title": "Вычислительные сети системы и телекоммуникации",
			"body": "Настоятельно рекомендую к просмотру подчеркнете для себя много нового заполните пробелы если таковые имеются\n\nhttps://www.youtube.com/watch?v=i1GGtXce-QQ\nhttps://www.youtube.com/watch?v=tMc84pxtQog\nhttps://www.youtube.com/watch?v=RdKSsK9-UrU\nhttps://www.youtube.com/watch?v=0y2W7TP8_dI\nhttps://www.youtube.com/watch?v=2qQ4Z-0egKU\nhttps://www.youtube.com/watch?v=yJoGZ_1G9WM\nhttps://www.youtube.com/watch?v=nP8EcyMk5uA\nhttps://www.youtube.com/watch?v=-mf0uy8_5uM\nhttps://www.youtube.com/watch?v=h_yEOwAKHjI\nhttps://www.youtube.com/watch?v=zVtiooM_QhU\nhttps://www.youtube.com/watch?v=3uhkl0JpBZM\nhttps://www.youtube.com/watch?v=49ifz11I4bE\nhttps://www.youtube.com/watch?v=Iv7v00Bwxw4\nhttps://www.youtube.com/watch?v=-mf0uy8_5uM\nhttps://www.youtube.com/watch?v=h_yEOwAKHjI\nhttps://www.youtube.com/watch?v=zVtiooM_QhU\nhttps://www.youtube.com/watch?v=3uhkl0JpBZM\nhttps://www.youtube.com/watch?v=49ifz11I4bE\nhttps://www.youtube.com/watch?v=TmV0kq7PL-s\nhttps://www.youtube.com/watch?v=iDvOdvCW5Oc\nhttps://www.youtube.com/watch?v=j--xP6iLeHQ\nhttps://www.youtube.com/watch?v=Ufilhiu1xJE\nhttps://www.youtube.com/watch?v=wun1eiYYh-8\nhttps://www.youtube.com/watch?v=1AHKLKptuH4\nhttps://www.youtube.com/watch?v=hBhXAFXo8Pw\nhttps://www.youtube.com/watch?v=KkeO-xO3_dQ\nhttps://www.youtube.com/watch?v=OkipCYwLQvg\nhttps://www.youtube.com/watch?v=Ufilhiu1xJE\nhttps://www.youtube.com/watch?v=OkipCYwLQvg\nhttps://www.youtube.com/watch?v=XURtqXeiBOI\nhttps://www.youtube.com/watch?v=5hypCtRkjag\nhttps://www.youtube.com/watch?v=Ehg4t5W1xso\nhttps://www.youtube.com/watch?v=dlasiRz0avo\nhttps://www.youtube.com/watch?v=uZJ8WVdw-Ck\nhttps://www.youtube.com/watch?v=xCEiYBmEh38\nhttps://www.youtube.com/watch?v=e50Xcxeol4E\nhttps://www.youtube.com/watch?v=GZTqZQVSY1A\nhttps://www.youtube.com/watch?v=xgWWqdKNaEI\nhttps://www.youtube.com/watch?v=B-dlhkWBNuA",
			"added": 1586964504
		},
		{
			"topic_id": 1587750621,
			"title": "MuWire Файлообмен через i2p",
			"body": "MuWire\n\nПростой анонимный обмен файлами с использованием технологии I2P\nMuWire - анонимная программа для обмена файлами. Вы можете обмениваться, искать и скачивать файлы любого типа.\n\nMuWire абсолютно бесплатен и имеет открытый исходный код. В комплекте нет рекламы или предложений любого рода.\nЗапуск MuWire\n\nПри первом запуске MuWire загрузка занимает несколько минут.\n\nПри первом запуске MuWire вам будет предложено выбрать псевдоним. Этот псевдоним сочетается с криптографически надежным адресом I2P и формирует вашу уникальную личность на MuWire.\n\nhttps://muwire.com/\n\ni2p это как закрытый VPN только вместо виртуального ip адреса в i2p В качестве IP адресов сети используются криптографические идентификаторы, представляющие собой открытые криптографические ключи. IP-адреса в сети I2P не используются нигде и никогда, поэтому определить истинный адрес какого-либо узла в сети не представляется возможным\n\nSOCKS — прокси — самый часто-используемый протокол. Позволяет пользоваться I2P совместно с практически любой программой, поддерживающей его.\nSAM (Simple Anonymous Messaging) — своеобразный API. Реализован поверх TCP.\nBOB (Basic Open Bridge) — ещё один API. Фактически, модернизированная версия SAM, но использующая отдельные каналы для комманд и данных.\n\nЧто такое I2P ● I2P Самая анонимная сеть в интернете\nhttps://www.youtube.com/watch?v=KTLTNv0fK3s",
			"added": 1587750618
		},
		{
			"topic_id": 1588056691,
			"title": "Децентрализованная биржа.",
			"body": "Bisq — это не требующее регистрации P2P-приложение с открытым исходным кодом, позволяющее покупать и продавать криптовалюты за национальную валюту.\n\nhttps://bisq.network/ru/",
			"added": 1588056687
		},
		{
			"topic_id": 1588557584,
			"title": "Sia p2p хранение файлов",
			"body": "Sia заново изобретает облачное хранилище. Наша технология объединяет пользователей, которым необходимо хранилище файлов, с хостами по всему миру, которые предлагают недостаточно загруженную емкость жесткого диска. Технология Blockchain защищает их данные и позволяет повысить экономичность для пользователей и хостов.\n\nhttps://sia.tech/",
			"added": 1588557579
		},
		{
			"topic_id": 1591021642,
			"title": "ipfs Клиент Orion",
			"body": "Orion - это простой в использовании клиент IPFS для настольных компьютеров. Это помогает обмениваться контентом в общедоступной одноранговой сети без какой-либо командной строки или технических знаний. Приложение включает в себя все необходимое для запуска собственного персонального узла IPFS https://orion.siderus.io/",
			"added": 1591021635
		},
		{
			"topic_id": 1607478277,
			"title": "BiglyBT Торрент клиент с шифрованием и чатом и поиском файлов",
			"body": "Статья на хабре BiglyBT стал первым торрент-клиентом с поддержкой спецификации BitTorrent V2\nhttps://habr.com/ru/news/t/523102/\n\nВидео по настройке\n https://www.youtube.com/watch?v=IxJVWik8z3A\n\nСайт \nhttps://www.biglybt.com/\n\nСтатя в zeronet\nhttp://127.0.0.1:43110/1RuZntipLvXcLKFEjT6Fr7ZA3GuywYfr5/?Topic:1603436759_1F6HSgCKLAeihH9crEmVCejPJHSKrhNPJu/BiglyBT+BitTorrent+V2",
			"added": 1607478269
		}
	],
	"topic_vote": {
		"1528380810_1EBhoAVnat8KH6dezimDFHDMyhcxP6fgMh": 1,
		"1_1KMBUmz57LumMsDZfoZJkzZhXC6FVcZrik": 1,
		"1607478277_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1588056691_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 1,
				"body": "> [jk7](#comment_1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): боян\n\nпочему ? вроде все норм тестил",
				"added": 1588557610
			}
		]
	},
	"comment_vote": {}
}