{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1525090186_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": [
			{
				"comment_id": 1,
				"body": "После прочения этой темы у меня впечатление, что украинцев в Зеронете даже больше, чем россиян.\nА вообще, на мой взгляд, ситуация, сложившаяся на Украине в языковой сфере, вполне подходит в данный момент и здесь. Это украинский сегмент Зеронета, и я, как и все русскоязычные пользователи, здесь гость и чужак. И долг любого честного человека, на мой взгляд - уважать сложившееся положение вещей, вне зависимости от того, украинец он или россиянин.\nПоэтому давайте, может быть, придём к компромиссу: тот, кто знает мову - пишет на мове. А уж проблемы понимания - личные проблемы каждого здесь (не нравится - не читай/не ходи). Но ведь есть люди, которые просто не знают мову, а обсудить некоторые вещи хочется. И в то же время 99,99% украинцев великолепно знают русский. \nЭто не навязывание никому своего языка, это просто здравый смысл. \n\n> [zeronetix](#comment_64_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): А ще краще підіть і українською напишіть в російському сегменті інтернету/зеронету. [...]\nНу вот я лично нормально бы отнесся, например.",
				"added": 1542840814
			},
			{
				"comment_id": 3,
				"body": "> [jackyl](#comment_2_1NwWUsuSWoRUw2xTvGbkQomgvN9CQLKpvK): А також поважайте українську мову. Якщо ви не помітили, це є українськомовний сегмент ZeroNet-у. [...]\nЯ её уважаю. Просто ей не владею, и поэтому прошу разрешить мне хотя бы самому писать по-русски здесь, т.к. я точно знаю, что поймете.\n\nК слову, на том укромовном ресурсе одна статья выходит в среднем раз в год. Вы еще слишком укоренены в русской культуре, чтобы резать \"по-живому\", вам не кажется? Не то чтобы я вас осуждаю, ваше дело, но каковы тут шансы на успех?\n\nP.S. Я не украинец и не русский, просто русскоязычный. Поэтому претендую на определенную объективность.",
				"added": 1543612325
			}
		]
	},
	"comment_vote": {}
}