{
	"next_post_id": 6,
	"next_comment_id": 2,
	"next_follow_id": 5,
	"avatar": "generate",
	"user_name": "Quebecois",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Utilisateur ZeroNet aléatoire",
	"post": [
		{
			"post_id": 1,
			"date_added": 1599960016,
			"body": "Bonjour ZeroMe!"
		},
		{
			"post_id": 1600312020,
			"body": "what happened to zero board ? ",
			"date_added": 1600312018
		},
		{
			"post_id": 1601608289,
			"body": "Pourquoi encore une pandémie maintenant ? À qui pouvons-nous faire confiance ? Pouvons-nous faire confiance à l'OMS ?\n\nQuels sont les vrais chiffres ? Qui a marqué les morts Covid-19 ? Le test Covid-19 est-il crédible à plus de 19% ? Pourquoi tant de statistiques incohérentes et différentes d'un jour à l'autre ? \n\nY-a-t-il vraiment une onspiration derrière ces masques et le fait de garder la distance entre les gens ? Ces consignes nous sont imposés et nous sont dictés à tous les jours par l'état profond !\n\n\nNou nous demandons tous s'il est vraiment nécessaire d'aller aussi loin quand nous voyons les principaux médias d'informations nous donner de fausses nouvelles truffés d'erreurs .\n\nAlors maintenant comment notre société évolue-t-elle ? De nombreuses petites entreprises ferment ! Les grandes entreprises achètent les petites. Voyons-nous la concurrence progressivement abolie ?\n\nLe Marketing change, les Sports n'ont pas d'audiences, les Cinémas sont fermés, certains restaurants ferment, les industries cinématographiques, les industries touristiques, les agents de voyage meurent tous lentement .\n\nRegardez les sports par exemples. Ils meurent lentement aussi . Pourquoi ? À l'origine, les sports étaient destinés à être des amusements, des jeux, des loisirs, des activités physiques et des exercices, etc.\n\nLe sport est devenu le culte du corps de l'homme, l'éducation est le culte de son esprit, les affaires sont le culte des oeuvres de ses main; et les église d'aujourd'hui sont l'adoration de son esprit, de son propre esprit, pas vraiment de Dieuou de l'Esprit de Dieu, et la guerre est l'ultime que tous cela mène ! Ses prouesses physiques, son igéniosité mécanique, son génie tactique et son esprit indomptable ! Croyez-le ou non ? Alors qu'est-ce que Dieu veut abolir ? Vraiment ? Eh !\n\nJ'ai donc cherché une réponse vers Dieu. La plupart des Chrétiens qui étudient les prophéties telle que Mathieu chapitre 24 savent que nous vivons dans la période des temps de la fin. Ce scénario est donc un aperçu de la venue de l'Antéchrist. Dieu a créé le diable et il laissera l'Antéchrist arriver au pouvoir pendant un certain temps pour tester le monde. Nous le savons, mais en sommes-nous vraiment rendu là ?\n\nQui survivent maintenant ? Les médias ? ils reçoivent tellement d'argent du gouvernement. Et le gouvernement survit parce qu'il reçoit de l'argent des partisants multimillionnaires s'il accepte que les mondialistes et leur dictateurs imposent la pandémie jusqu'à quand ? Jusqu'à ce qu'ils aient leur homme, leur sauveur, l'antéchrist qui fera passer quoi ? La nouvelle commande = The new world order Dans le monde entier !\n\n'' Parce que l'amour de beaucoup se refoidira '' Mathieu 24:12\nPrenez vos distances, portez un masque et restez à la maison ! Vous ne pouvez pas être plus froid que ça ! Autre prophétie accomplie !\n\nSi vous étudiez les prophéties, vous verrez que c'est de plus en plus clair. Daniel 8:23 '' Et au dernier temps de leur royaume, lorsque les transgresseurs auront atteint leur plénitude, un roi au visage audacieux se lèvera, ayant des traits féroces, qui possède des plans sinistres ''\n\nL'un des signes les plus importants et finaux de la fin même que de nombreux prophêtes ont prédit est la montée du gouvernement mondial Anti-Christ dirigé par un dictateur qui sera en fait possédé par Satan lui-même ! il viendra sur les lieux avec un accord ou un pacte de 7 ans dans lequel il promettera au monde de la paix et la liberté religieuse, et il rêglera en quelques sorte la crise actuelle au Moyen-Orient en élaborant un compromis entre les Arabes et les Juifs, permettant aux Juifs de reconstruire leur temple dur le mont Morah, Jérusalem, où se trouvait autrefois leur temple antique et où se trouve aujourd'hui la mosqu. musulmane du '' dôme du rocher '' [ Dan 8:23-25, 2th 2:1-4;dan9:27]\n\nCe serait donc un signe important dans l'histoire et nous devrions garder un oeil sur les médias pour savoir exactement quand cela se produira .\n\nPourquoi ? car cela nous donnera le compte à rebours du début du règne de l'AC . Puis après 7 ans, nous avons le retour de Jésus Christ ! Le seigneur! Le roi des rois !\n\nÊtes-vous une personne de paix ? Ou un pari de guerre ! '' Heureus les artisans de paix car ils seront appelés fils de Dieu ! '' [ Mat:5:9] Rejoignez les artisants de paix et aidez à apporter la paix dans les coeurs, les esprits et les âmes des hommes, à travers le Prince de la Paix Jésus ! Cette prière suivante est une semence qui grandira dans votre coeur et laissera Dieu vous aider. '' Jésus merci pour votre donc d'Amour, pardonnes mes erreurs et viens dans mon coeur, et dans ma vie pour m'aider à surmonter mes craintes avec toi et donnes-moi la vie éternelle au nom de Jésus !\n\nLe monde n'est pas dangereux à cause de ceux qui font le mal, mais à cause de ceux qui regardent sans rien faire ! Albert einstein\n\nPour de plus amples informations vous trouverez mon email sur mon site \n\nwww.lifeandthetruth.com ",
			"date_added": 1601608286
		},
		{
			"post_id": 1602968360,
			"body": "Renegade Film - A Feature Documentary, featuring David Icke The 'mad man' who has been proved right again and again and again David Icke has been warning for nearly 30 years of a coming global Orwellian state in which a tiny few would enslave humanity through control of finance, government, media and a military-police Gestapo overseeing 24/7 surveillance of a micro-chipped population. He has said that 'physical' reality is an illusion and what we think is the 'world' is a holographic simulation or 'Matrix' created by a non-human force to entrap human perception in ongoing servitude. They called him 'crazy', 'insane', a 'lunatic', and he was subjected to decades of ridicule, dismissal and abuse. Oh, but how things change. Today his books are read all over the world and his speaking events are watched by thousands on every continent. Why? Because what he has been so derided for saying is now happening in world events and even mainstream scientists are concluding that reality is indeed a simulation. Almost every day something that David Icke said long ago is supported by happenings and evidence. As Mahatma Gandhi said: 'First they ignore you, then they laugh at you, then they fight you, then you win.' David Icke's time has come.\n\nhttp://imdb.com/title/tt9715646/\n\nhttps://www./watch?v=TJUw2s3Wgi8\n\nmagnet:?xt=urn:btih:F5D7DC2BA43D0C48F2FA8F4844F95CD38BFBA939&dn=Renegade.The.Life.Story.of.David.Icke.2019.1080p.WEBRip.x264-RAR&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969%2Fannounce&tr=udp%3A%2F%2F9.rarbg.me%3A2850%2Fannounce&tr=udp%3A%2F%2F9.rarbg.to%3A2920%2Fannounce&tr=udp%3A%2F%2Ftracker.opentrackr.org%3A1337&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969%2Fannounce",
			"date_added": 1602968356
		},
		{
			"post_id": 1602968432,
			"body": "18 year old girl takes a shower\n\nhttps://anonfiles.com/P500J7ebpc/18_old_girl_takes_a_shower_mp4",
			"date_added": 1602968427
		}
	],
	"post_like": {
		"1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4_1599939668": 1599960223,
		"129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71_1600766340": 1600975809,
		"1MYphGidpbF2Yw1BPeTEsmgcwkV14RctxX_1601608289": 1601695158,
		"17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc_1606053794": 1606237708,
		"19PMdv4WkMucGvG6BqLJwRqazzywgPwJK9_1": 1606237874
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@落后起跑的乌龟: any games available now ?",
			"post_uri": "1MYphGidpbF2Yw1BPeTEsmgcwkV14RctxX_1600312020",
			"date_added": 1600636171
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "17TFi7VtcyxehZB8JUN43trfr5hkjnoHsc",
			"user_name": "Foxtrot",
			"date_added": 1605198324
		},
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1KihcBqcwgH1TKeZtKRnocUr22oUb5Av5A",
			"user_name": "agocs6921",
			"date_added": 1605198337
		},
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "19PMdv4WkMucGvG6BqLJwRqazzywgPwJK9",
			"user_name": "Macrotte",
			"date_added": 1606237868
		},
		{
			"follow_id": 4,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1AS8BxFxLaPngLmeY1WK3joP3HY5T1tmKx",
			"user_name": "Shirikun",
			"date_added": 1606237937
		}
	]
}