{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1581694747_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 1,
				"body": "somuchfood - rozumiem twoje rozgoryczenie, ale takie mamy zacofane społeczeństwo. Kurski dostał na propagandę 2mld złotych, to rekordowa kwota. Oprócz propagandy w tvpis masz jeszcze wszechobecną chemię w żarciu, mikrofale, haarp, leki wywołujące otępienie umysłowe, zastraszanie. Inteligencja zdolna do przywództwa to mniej niż 10% Reszta to idioci bez względu na wiek. Spójrz na młodych, jedyna rzecz w jaką są zapatrzeni to srajfon, pejsbook i inne śmieci....",
				"added": 1582216774
			}
		],
		"1577981477_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 2,
				"body": "Przeczytałem artykuł...\nWnioski:\n1. Wyścig zbrojeń trwa w najlepsze i Rosja zdaje się nie ustępować w nim, a nawet ma przewagę w niektórych dziedzinach.\n2. F35 to totalny niewypał, za który zapłacą wiernopoddańcze państewka takie jak Polin...\n3. USA traci wpływy, powiększa się chaos w zarządzaniu, finansach oraz utrzymaniu najdroższej armii świata...\n4. Rosja odzyskuje wpływy na Bliskim Wschodzie i Północnej Afryce..\n5. Rośnie frustracja i nerwowość elyt usmańskich, które podbijają coraz bardziej stawkę w utrzymaniu swojej hegemonii, poprzez prowokacje militarne i ryzyko konfliktu od regionalnych po globalny...\nPytania:\n1. Zasadnicze to czy tu w Polin możemy się spodziewać regionalnej wojny na wiosnę, ze względu na te manewry defender 2020, które zdają się być jawną prowokacją...\n2. Jaki może mieć przebieg? Czy Rosja zaryzykuje jakąś wojnę pozycyjną/frontową na wyniszczenie czy od razu odpali rakiety i wojna skończy się nawet w 15 minut? Tak mi się wydaje, skoro tak intensywnie rozwijają swój arsenał rakietowy...",
				"added": 1582277959
			}
		],
		"1565086389_1JZcGPhLfmeACHEXu4R16hrU2Rz6wBgYoY": [
			{
				"comment_id": 3,
				"body": "Sama się zniszczy, to tylko kwestia czasu, a po nich przejmą pałeczkę mahometanie i zaprowadzą swój nowy porządek. Pytanie czy tylko sami czy jeszcze z kimś do spółki. Ten twór popełnia samobójstwo od społecznego, demograficznego, kulturowego po gospodarczy i ekonomiczny. Nic tylko czekać i być przygotowanym...",
				"added": 1582278808
			}
		]
	},
	"comment_vote": {}
}