{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1528148704,
			"title": "Can't get Tor to work with Zeronet on Fedora!",
			"body": "I uncommented ControlPort 9051 as well as CookieAuthentication 1 and restarted Tor. When I enter the command:\n\"ls -al /var/run/tor/control.authcookie\" I get:\n\"-rw-r-----. 1 toranon toranon 32 Jun  4 17:18 /var/run/tor/control.authcookie\"\nI even did \"sudo chown (myuser) /var/run/tor/control.authcookie\" to no avail. I have logged out several times.\n\nI constantly get either Errno 13: Permission denied /var/run/tor/control.authcookie or Errno 111: Connection Refused (or failed I can't remember).\n\nHow can I fix this and get it to work? I added some stuff to my /torrc file to try and give group ownership to the file to no avail.\n\nHow can I get tor to work?",
			"added": 1528148703
		},
		{
			"topic_id": 1528169498,
			"title": "How to disable all images/ videos?",
			"body": "I read you can even use a blur feature to not download unless you click on it? I am using the Tor browser (linux) but don't even want to RISK downloading actual CP or god knows what else by accident. I know it's unlikely to come across that stuff, I've been on the darknet for years and, well, it's very rare but you hear things. But I just wanted to be sure I don't come across any even by accident. How can I disable it?",
			"added": 1528169496
		},
		{
			"topic_id": 1528170453,
			"title": "How to fix Errno 13?",
			"body": "Status: Error ([Errno 13] Permission denied: '/var/lib/tor/control_auth_cookie')\n\nI assume it cannot read the control_auth_cookie file. I fixed Errno 111 but now I have Errno 13. How can I give it permission on Fedora? The instructions in the FAQ are for Debian and I am not running Debian.",
			"added": 1528170450
		},
		{
			"topic_id": 1528171357,
			"title": "Wouldn't I2P be better than Tor for Zeronet?",
			"body": "Unlike Tor, I2P actually encourages torrenting and file sharing. I'd imagine Zeronet slows Tor traffic somewhat for everyone, especially watching movies and what not. Also adding I2P compatibility would significantly increase the amount of I2P routers on the network, making it mutually beneficial for all parties involved. Garlic routing is also inherently more decentralized than onion routing (and both are good), which makes it even harder to attack. Just my thoughts.",
			"added": 1528171353
		},
		{
			"topic_id": 1528271824,
			"title": "How can I get a new ZeroID/ Change to a new one?",
			"body": "As you can see by my name, I intended to use this name only until I could get Tor working properly. Anyone know how to get a new ZeroID/ delete the one I have now?",
			"added": 1528271819
		},
		{
			"topic_id": 1528345024,
			"title": "Censorship resistance is great but... Let's maybe change the architecture so people don't see links to shocking sites by default?",
			"body": "I think we could do more to at least \"segregate\" and put away CP and CP related content. By virtue of design, there can be no censorship, but can we at least add \"porn\" to the filter list on ZeroSites? Can we put it behind an additional level of obfuscation? Look at Tor's hidden wiki. If you want CP you go to the UNCENSORED hidden wiki (i.e. don't make the mistake of going there!) Look at Freenet, immediately users are introduced to the Filtered Index with no pornographic or shocking sites. Look at I2P, the only sites given and approved a \"readablelink.i2p\" do NOT contain CP and reflect good on the network. Obviously ZeroNet is a great thing, but I think the developers should try to change the ZeroSites architecture to say \"these links blatantly contain CP or might contain CP\". Even the pedo's themselves would probably willingly label their sites as \"shocking\" in order to go into a little bin that users can see IF and only if they want to. I mean, let's not pretend child abuse is equal in the court of morality to a discussion forum. And to the critics of this idea: this is NOT censorship I am advocating, only a change in architecture to ensure that by default people don't see links to shocking sites!",
			"added": 1528345018
		}
	],
	"topic_vote": {
		"1528148704_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": 1,
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1527561576_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 1,
				"body": "I would prefer people's self governance, a free association of producers, democratic control and neither state or corporate domination. Basically, Orthodox/ Libertarian Marxism. There should be unlimited political freedom and the world should be privacy respecting by default!",
				"added": 1528169261
			}
		],
		"1528148704_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 2,
				"body": "> [y3z](#comment_6_1BsusbGKX6JotDgsF1KBebHSZJA7Hd9mGs): sounds like you forgot to add permissions for yourself [...]\n\n\"No such file or directory\"",
				"added": 1528230417
			},
			{
				"comment_id": 3,
				"body": "> [y3z](#comment_6_1BsusbGKX6JotDgsF1KBebHSZJA7Hd9mGs): sounds like you forgot to add permissions for yourself [...]\n\nOh wait no I think I deleted it by accident, hold on",
				"added": 1528230980
			},
			{
				"comment_id": 4,
				"body": "> [y3z](#comment_6_1BsusbGKX6JotDgsF1KBebHSZJA7Hd9mGs): sounds like you forgot to add permissions for yourself [...]\n\nYes it says no such file or directory now",
				"added": 1528235179
			},
			{
				"comment_id": 7,
				"body": "I fixed it! This will be the last post with this username. The problem was: I had TWO Cookie authentication files! I commented the one that was NOT /control.authcookie. Hopefully this will help someone else in the future",
				"added": 1528270604
			}
		],
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 5,
				"body": "Even if Microsoft was the most benevolent corporation on earth, it would still be an inherently undemocratic institution. There are, though, some corporations that exist solely for the promotion of the public's interest. Purism for instance is a good example. But Microsoft? I don't care how much they fund \"open source\", until they release the source code for Windows, until they make all their products \"open source\" and privacy respecting by default, I will continue to look upon them negatively just as I look upon any undemocratic economic or political institution.",
				"added": 1528269810
			}
		],
		"1528171357_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 6,
				"body": "There is literally no reason not to do it!",
				"added": 1528270025
			}
		],
		"1528271824_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 8,
				"body": "> [thunder33345](#comment_113_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): backup your user.json filedelete itrestart zeronet [...]\n\nSo I deleted users.json in the /data directory, restarted Zeronet and... it reappeared on restart. Did I delete the wrong file? You said user.json but I deleted users.json. Where would I find this .json file?",
				"added": 1528341950
			},
			{
				"comment_id": 9,
				"body": "> [thunder33345](#comment_113_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): backup your user.json filedelete itrestart zeronet [...]\n\nAlso you said, \"\n\nYou will need to go to whichever shortcut that you use normally or create one and add --multiuser_local to the start argument\"\n\nBut what shortcut exactly? Do you mean ZeroNet.sh? Like edit the code and add --multiuser_local to the start of it?",
				"added": 1528342174
			},
			{
				"comment_id": 10,
				"body": "> [thunder33345](#comment_113_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): backup your user.json filedelete itrestart zeronet [...]\n\nReally cool blog by the way :)",
				"added": 1528342302
			}
		],
		"1528175266_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "Hang in there! One of my best friends had autism. If it wasn't immediately obvious that it was autism, it probably isn't too too severe. We all have bad times friend, bad days, and bad years. I hope things get better for you soon!",
				"added": 1528344471
			},
			{
				"comment_id": 12,
				"body": "And you know, the internet is a great place to make friends with people who share common interests!",
				"added": 1528344505
			}
		]
	},
	"comment_vote": {
		"39_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"1_1MLUqSEnxsRvThQEP2wqWeTFBAk9oTD4iB": 1,
		"113_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}