{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1589756609_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Do you have website that teach it how to use it with kdenlive?",
				"added": 1589966982
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_2199_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't.\n\nDamn, I'll search a bit if I can find anything for it. Since I work in the IT business, I'm always open to new and better standard. The problem is always the adoption, but for video we have a least program like VLC who act as a swiss-knife for most \"exotic\" format.\n\nI remember having a hard time with .webp on Linux (the default Gnome app doesn't support it. Seem better on Windows).",
				"added": 1590074030
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_2205_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't know if this will help, but Netflix and Intel created their own encoder. [...]\n\nThanks for the link, I just checked and kdenlive is still stuck at the previous generation (VP9, the one that AV1 is supposed to replace).\n\nI'll check if I found another editing software, but the solution seem to render the final video on VP9 and then convert it (so more work). I'll test it when I got the time, just to see the differences.",
				"added": 1590076384
			},
			{
				"comment_id": 5,
				"body": "> [anshorei](#comment_117_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): When I published my shortfilm Thaïs on my ZeroBlog I tried to get an AV1 encoder working, but I had a really hard time and ended up abandoning it and using H264 instead. H265 in browser is only supported by Edge apparently so that was out as well. I might try reencoding with RAV1E now though!\n\nI tried on Linux (distro Pop!_OS) with Brave (Chromium based like Chrome) and your video work well, a little buffering at the start to kickstart the thing (like 3/4 secs) and then it was a smooth ride.",
				"added": 1590134955
			},
			{
				"comment_id": 6,
				"body": "> [anshorei](#comment_118_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Yes, but that's still the H264 encoding. My H265 attempt was ~20% smaller, and V1 is supposed to trim up to 30% off on top of that so a 40% decrease in filesize compared to H264 wouldn't be unreasonable.\n\nI need to try it, but I didn't succeed at my first attempt to convert a video to AV1. I know I can render with VP9 (which is the codec previous to AV1) with kdenlive, but I didn't found a plugin/add-on to make it render in AV1.\n\nMy attempt to convert a video ended up taking too long and the weight of the file was bigger. I'm still searching and trying until I get a good result.",
				"added": 1590170826
			}
		],
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 3,
				"body": "> [pexo](#comment_176_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): It looks like the purism laptops are pretty much what you look for.So the librem13(clearnet) and the librem15(clearnet). They are also currently in the process of making a phone.\n\nYeah, I agree. They do have anti-tamper process in place, depending of the level of threat you're under and some are advanced, so you may want to look at their products.",
				"added": 1590074410
			}
		]
	},
	"comment_vote": {
		"176_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1
	}
}