{
	"comment_vote": {},
	"comment": {
		"5_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR": [
			{
				"comment_id": 2,
				"body": "єєєє))",
				"added": 1517921858
			},
			{
				"comment_id": 3,
				"body": "якщо тут буде набагато більше і активніше сидіти народ ніж в riot.im (чат,месенжер, звонілка, форум, для технічних розробницьких спільнот), то буду тут постійно висіти",
				"added": 1517922089
			}
		],
		"1_1MREdcZdDjmPyVL8YH53wPfzjc6FX9aJ8b": [
			{
				"comment_id": 1,
				"body": "Привіт всім! Прикольно бачити укр. спільноту хоч в якихось ІТ технологіях. Я ще часом заходжу в riot.im, але там наших майже немає і ніхто не активний.",
				"added": 1517921808
			}
		],
		"1523653054_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN": [
			{
				"comment_id": 4,
				"body": "потестируйте http://retroshare.net/\nЗдесь описание и мануал на понятном языке   https://adorabilis.wordpress.com/",
				"added": 1523744819
			}
		],
		"1525090186_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5": [
			{
				"comment_id": 5,
				"body": "Щось нічого не можу добавити. Щось таки не працює!!!.",
				"added": 1529010358
			},
			{
				"comment_id": 6,
				"body": "Нажаль не зміг зкористатись, торент файл зкачується з помилкою і закачка не відбувається. *Світ дикого заходу 2 сезон*",
				"added": 1532764611
			},
			{
				"comment_id": 7,
				"body": "Гаразд, дякую! Спробую щось залити",
				"added": 1533849251
			},
			{
				"comment_id": 9,
				"body": "> [dmio](#comment_5_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN): Плохой пример. На том же российском nonameclub порой бывают релизы на украинском. Никто не бесится по этому поводу. Релиз и релиз. На такой товар тоже покупатель найдется, если образно.Фарион, Тягныбок, отмена языкового закона. Достаточно многие сходятся на том, что это был старт и повод для событий в Крыму. Если бы вместо отмены их кто-то быстренько заткнул и выступил бы по всем каналам, что давайте все дружить, то случился бы Крым? Может и нет. А может и да, но найти правдоподобный повод было бы однозначно сложнее.Дети? Учит школа. Язык тот, какая школа по месту прописки. Такой закон. В семье на русском. За пределами семьи - как сами захотят, как им самим будет удобно.Ну видимо таки придется идти к врагу, дружить там и привыкать, что может там и не враги вовсе. Раз свои же выгоняют.Чао.\n\nПитання в тому,як ви себе пзиціонуєте! Я як звичайна пересічна людина, можу розмовляти на кількох мовах (укр., рос., анг.,), бо в такий час живемо, і при цьому ніхто не має права і не зможе завидити розмовляти на тій мові, на якій я хочу, навіть якщо це буде російська чи то польська. Але є одноне *АЛЕ*, ....я і кожний хто проживає на території держави Україна і є її громадянином, має знати і вміти розмовляти на державній укр.мові, поважати традиції та культуру, захищати її суверенність,....тому що,..... кожен її громадянин є її представником, характерною ознакою та носієм ідентичності тої країни в якій проживає. Основним багатством будь-якої держави є її народ.Ознаками ідентичності (відмінності)будь-якої держави і в часності народу є: мова, прапор, герб, гімн, традиції. Якщо ми втратимо ознаки ідентичності, Україна зникне. Ось в чому головна суть. А не тому що рос.мова не подобається. Всі в Україні знають і вміють розмовляти на рос.мові, дискомфорту ніякого. Проблема в політиканах і олігархах, які роз*язують війни, і нацьковують народи один на одного. Мій начальнік розмовляє на рос.мові, а я йому відповідаю на укр.мові, і ні разу ні в кого проблем не виникало. Але якщо ВИ, хто розмовляє на рос.мові не готові поступитися своїм комфортом і хотєлками за ради ціілісності та ідентичності країни в якій народились, то йдіть  НАХРІН лісом туди де вам будуть раді. Сподіваюсь я трохи відкрив ваші очі на проблему з іншого кута зору. Всім надобраніч!!!",
				"added": 1536967624
			}
		]
	},
	"topic_vote": {},
	"topic": [],
	"next_comment_id": 10,
	"next_topic_id": 1
}