{"next_paste_id":12,"next_comment_id":0,"paste":[{"paste_id":0,"description":"","body":"拜托您指教, 对于动辄扬言核平的人. 该怎么回复呢?\n刘的言论显然是有人说 \"你们大蜀民国想要独立, 先问我党国的核武器\"\n而且贵妃显然是以远逊于美苏的核武器能力, 最喜欢扬言打核战争的.\n所以刘该怎么回复呢?\n如果你遇到了张献忠, 你能怎么和张献忠说话呢?\n\n题外话, 猫 juicy 并不是布尔什维克里面最残暴的人.\njuicy 是残暴不错, 但张国焘没接收 juicy 的教导不也残暴得丝毫不弱?\n\n---\n\n匿名用户 • 2019-03-27\n\n刘仲敬回复的人只说擋不住戰術核武的，您是怎么解读出动辄核武器和党国的呢？\n\nrtgzddgh • 2019-03-27\n\n所以不正是让我猜准了吗?\n\"你们别说现在这副人数寥寥的样子, 将来就算真的让四川人都信了你们的大蜀民国, 党国根本不需要派军队, 就能把你们像杂草一样践踏\"\n\nrtgzddgh • 2019-03-28\n\n别以为我不知道你们这群温和派中国人怎么想的.\ndouble think 的能力是姨学的基本素养.\n匿名用户\n\n匿名用户 • 2019-03-27\n\n@rtgzddgh: 仅凭这一句话能读出这么多动机吗？\n\nrtgzddgh • 2019-03-27\n\n当然, 我不知道您是否是外宾.\n作为当过很长时间中国人 + 小粉红 + 大一统爱好者的我, 可是看得非常清楚的. 这些人在想什么.\n阿姨也当过中国人, 所以他也看得出来.\n\n当过中国人又看不出来这句话. 还上新品葱的人都是没良心的撒谎者.\n匿名用户\n\n匿名用户 • 2019-03-28\n\n@rtgzddgh: 先把所有人都贴上标签再批斗，这难道不是你党国惯用伎俩吗？所有说挡不住核武的都有这个意思吗？如果是真的支持诸夏独立但客观上认为挡不住中国核武的人会怎么回复呢？\n\nrtgzddgh • 2019-03-28\n\n\"如果是真的支持诸夏独立但客观上认为挡不住中国核武的人会怎么回复呢？\"\n靠美国的核保护伞. 换句话说, 比如萨德.\n但是台湾真装了萨德的话, 中国人还不是又要像死了妈一样的抱怨自己受了欺负?\n而且刘说的是事实, 贵妃敢先动核武器挑战世界秩序, 只会死得又快又彻底.\n\n小钙 • 2019-03-28\n\n已删除\n\nrtgzddgh • 2019-03-27\n\n但是大概率 \"挡不住核武器\" 言论的主人就是温和派中国人\n(可能具体实例上会出错, 但是统计学上没问题)\n一边假设别人因为资产阶级的软弱性之类的原因不敢杀光中国人, 一边自己蠢蠢欲动想用核武器.\n别误会, 我目前还在沦陷区, 我讨厌这种弱智自己要死还拉上我. 并且说出了他们的心里话而已.\n\n小钙 • 2019-03-28\n\n@rtgzddgh: 刘可能只是对粉红的嘲讽，但你说的我觉得这完全说不通，假如我认为美国不一定来帮忙，而巴蜀利亚扛不住你国核武，那我也是支持你国橄榄诸夏的人？\n匿名用户\n\n匿名用户 • 2019-03-28\n\n@rtgzddgh: 所以大概率是的话就要以偏概扣个帽子打倒吗？\n\nrtgzddgh • 2019-03-27\n\n@小钙:\n我对巴蜀利亚没什么兴趣. 实际上我对诸夏也不乐观.\n但我只是单纯的说出了概率上的现象, 言必及有核武不会分裂的, 一般却是可以以七成以上的概率认为是粉红.(这个结论有 30% 的错误率. 但我觉得不会更高了)\n\nrtgzddgh • 2019-03-27\n\n你也可以这么想.\"廉价七成正确\" 的意思是阿姨也没义务对每个问题都那么客气那么求真.\n但是这里不回复是不是又有点显得气弱? 那就开嘲讽气死小粉红.\n\n实际上如果不是四川而是台湾, 认为台湾遭受了战术核武器而美国可能不会介入的人, 以九成概率至少是温和派中国人 (比如国民党).\n这基本是直接攻击美国的世界霸权不合法不正当不稳固了. 十足是匪谍后备军的样子.\n(但四川就超过我的判断能力了)\n\nrtgzddgh • 2019-03-27\n\n@小钙: 我无意为刘仲敬洗地.https://pincong.rocks/question/2747\n之前我就提过诸夏运动也是强烈的费拉士大夫性质.\n但是两波同样是费拉吵起来了的时候, 很明显, 刘仲敬的言论几乎永远最多只是以牙还牙的程度. 从来不曾逾越列宁全集和毛泽东选集的主张.\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 我认为如果台湾被核平，美国肯定会介入，但问题在于即使美国介入美国也不会向你国投一颗原子弹，除非美国自己被核平，但你国没这个胆子核平美国，除非想玩 fallout，所以我认为台湾无论如何都是挡不住你国原子弹的，这点毫无疑问。假设你对你姨的分析是正确的，那么你姨最大的问题就是 prior distribution 太 skewed，包括之前的 @张献忠，多次提及「贝叶斯概率」。先不说这个 prior 是怎么来的，仅凭一句话我觉得谁也没法判断这个人到底是怎么想的，除非你有读心术。\n这么来看，这个论坛反姨才是正常的，因为大部分的 prior 就和姨粉是不同的。如果你在大部分人看不出动机的情况下开嘲讽，一般通过只能认为你魔怔，而姨粉则认为说的对说的好，因为姨粉默认了一些言论就是大一统粉红特有的，无论它究竟是不是粉红。\n\n小钙 • 2019-03-28\n\n@rtgzddgh: 更何况，根据这位挡不住战术核武的回复者的推特（https://twitter.com/robintseng_cp/with_replies）判断，此人应该是支持诸夏和台湾独立的，他回复挡不住的原因就是真的认为挡不住。正是因为支持台湾独立才怕你国核武，所以才提出这个问题，这是一个防患于未然的提醒，而你姨的回复确实让人摸不着头脑，我只能认为是嘲讽之前支持核平的粉红，但我是真的看不出来整个讨论哪里存在粉红之处，所以这点我实在没法赞同你姨。\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 现在看来姨学被橄榄可能不全是姨黑的锅，你姨自己越来越魔怔也是一个原因，不过我已经快一年没关注你姨了，但就这个回复看来魔怔程度不亚于李威\n\nrtgzddgh • 2019-03-28\n\n@小钙: 嗯. 所以你如果在非粉红立场上. 真的觉得很受冒犯吗? 反而会很高兴吧. 我看了那个人的 twitter. 如果他是独派. 有人告诉他 \"党国的核武器落地二十四小时内就再也不存在北京了\", 独派会觉得被冒犯吗? 能被这个嘲讽强烈冒犯的只有站在党国这边的.\n\n\n而且我也不是完全赞同刘仲敬, 如同我贴的链接. 诸夏投机性质太强. 但这次刘的言论, 在我这种接受以牙还牙. 或者说 \"比烂也比天下乌鸦一般黑好\" 的人来说. 可以接受.\n李井泉饿死了上千万四川人, 我觉得四川如果想独立, 准备付出几百万的损失并不是恐怖主义.\n难道我能要求毕苏斯基打仗前把伤亡控制在五万以内吗?\n当然, 这样的言论肯定听起来很难听. 我完全理解对刘仲敬的指责. 但只是觉得应该看看刘仲敬面对的是什么.\n\nkillreddragon • 2019-03-28\n\n@小钙: 挡不住核武就挡不住核武呗，台湾也挡不住核武啊，难道你觉得支共真敢对台湾扔核弹？打破核威慑核平衡的代价是支共负担不起的。苏联解体都没按下核按钮，我不觉得桂枝如今信仰能比苏共更坚定。\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 我仔细分析了一下刘的心理，我认为可能是这样的：\n刘知道这个人是姨粉，支持独立，但害怕被核平，所以发了挡不住核平，请教刘怎么办，而为了鼓舞士气，意淫了一番粉红的言论打了回去，但问题就在这。首先他没有核武，根本不可能核平，其次没有整个讨论也没有粉红，一般人看到之后只能蒙在姨缸里。他的这番话是为了让支持诸夏的人不要畏惧你国核平的，而魔怔就魔怔在他对着空气批判了一番，只是为了安慰诸夏支持者，实则画饼充饥。从这点可以看出，你姨现在和毛 juicy 已经完完全全一路人，就是投机革命家。\n\n我为什么反对这种言论在品葱，因为他把粉红的垃圾言论又转述了一遍，如同疯狗咬你一口你又反咬一口一样，只能做到狗咬狗，污染品葱讨论氛围。如果整个品葱都是五毛言论，相比没人愿意再继续讨论。我承认他的宣传和洗脑确实很有效，但我认为这种言论在品葱并不适合。\n\n小钙 • 2019-03-28\n\n@killreddragon: 姨学是不允许挡不住核武的，你要挡不住核武就可能放弃诸夏独立，因为毕竟还是「费拉」，还是贪生怕死，还是「武德不足」。因此你姨需要一种方法让支持巴蜀利亚的人认为核武并不可怕，认为你姨一样也可以核平北京，这样大家就能心安理得的继续进行诸夏夜之梦。\n\n小钙 • 2019-03-28\n\n@rtgzddgh: 看来我之前确实把你姨想象的太学术了，目前看来你姨的确是个宗教头子了，我还以为是被姨黑和迫真姨粉风评被害，，，\n\nrtgzddgh • 2019-03-27\n\n@小钙: 你看看我那个帖子吧. 他们的假设是北京会先和美国打起来.\n\nrtgzddgh • 2019-03-27\n\n@小钙:\"德性力学的一个直接推论就是以中国的德性, 必然会和美国开战, 或者至少高烈度的冷战 (刚好和共产党强硬派的看法一致)\n热战对应帝国主义直接碾碎中国, 对除了帝国主义以外的所有人都是好事, 冷战意味着张献忠大洪水, 除了不脏帝国主义的手以外都是坏事 (姨学家也不敢摘桃子了)\n前者是 \"诸夏派\" 的机会窗口, 与军阀和各路诸侯合流, 裹挟吃瓜群众.(是不是很像列宁先锋队? 姨学家最后也活成了讨厌的样子, 但是这也不能怪阿姨, 得怪东亚洼地没几个人有贵族爵位, 产生不了毕苏斯基)\n而冷战导向张献忠大洪水好像是姨学家都公认的不可接盘对象? 他们好像是准备等人死的差不多了再回来. 就像尼罗河洪水过去后的沃土上播撒新种子.\n\n所以诸夏派所做的武力准备和群众基础远远达不到社会革命党和社会民主党的水平. 因为根本没打算靠自己嘛!\"\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 那可真是毛死我力，这样下来诸夏一国一个共产党毫无悬念，完完全全一路上\n\nrtgzddgh • 2019-03-28\n\n@小钙: 意思是姨粉基本上内心深处没有打算自己先动手的. 他们可以当先锋队做脏活, 但是不认为自己可以当主力.\n所以这个意义上他们的逻辑是自洽的.\n他说的核弹不足为惧的意思其实是 \"等北京开始扔核弹的时候肯定北京已经和美国开战, 因为践踏了这个底线之后已经和开战没区别了, 到时候我们无论付出多大代价, 都看得到确切的胜利, 绝对不存在有北京的核弹比美国强的可能\"\n\nrtgzddgh • 2019-03-28\n\n@小钙: 如果你上墙内社区, 就知道刘仲敬打的不是稻草人靶子. 留岛不留人并不是没有非常非常多人这样主张.\n如果你要说情景, 接近这样:\n事件 a, 说话的人是粉红, 刘仲敬指出来党国的核武器并不敢首先越过雷池. 嘲讽达成.\n事件 b, 说话的人是独派台湾居民, 刘仲敬指出来台湾有美国保着, 就算是四川如果北京用了核武器, 遭受的制裁也一定会让北京和美国开战. 所以四川也不要怕.\n\n虽然很丑陋, 但他们那套理论是自洽的. 坚持以美国为中心的世界观.\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 结合背景来看，你姨的确没有魔怔，只不过司马昭之心太过明显。所以你我之前的分析是错的，这句话就是你姨给他的教徒传教用的，而不是认为对方就是粉红。这和 1984 里想象出来出来一个敌人再打倒鼓舞士气是一样的。\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 没错，你国粉红核平言论是有的，现在我是明白了，这一切都是他们圈内自嗨，是一种宗教式的 reassurance\n\nrtgzddgh • 2019-03-27\n\n@小钙: 也可以这么说，耶稣也告诉门徒不要爱现世，要完全爱神，最后可以上天堂吗？\n刘的意思是不要怕，真的压力有美国顶着，诸夏只要付出很小的代价就可以得到子孙后代几百代的富贵。（所谓「不用很辛苦也能当好汉奸」）\n我没有任何说刘可以与耶稣并列的意思，但是手法相似。\n\n小钙 • 2019-03-28\n\n@rtgzddgh: 看来我之前以为姨学是迫真姨粉学姨学魔怔了建立的宗教性黑屁圈，现在发现你姨是真的在领导这个宗教，而不是风评被害，他之前的各种黑屁也很有可能是有目的性的，和你猫 juicy 大概从一开始就完完全全是一路人\n\nrtgzddgh • 2019-03-27\n\n@小钙: 这就超过我的判断能力了。但姨学的力量来源似乎至少比共产党健康（基督教几千年正常运转总比马克思的纯粹臆想好吧？），对硬实力的判断比 juicy 好（猫连希特勒墨索里尼的硬实力和地位都弄错了），提倡的东西也至少比共产主义对普通人好。\n如果按比烂的说法，北欧人在纳粹和共产主义之间，诚实的说也是纳粹好五倍，犹太人的话就相反。\n\n小钙 • 2019-03-28\n\n已删除\n\n小钙 • 2019-03-28\n\n@rtgzddgh: 点错删了回复……\n\n硬要比烂的话，你姨确实比大部分古代宗教和现代极右或极左党派好得多，但至于还有没有什么新方法，我认为还是有的。我个人在这方面是比较警惕的，我认为任何给出特定实践方案又用极端言论造势的组织都是危险的。历史一次次的证明极端手段总是会失效，我在这方面的确算是温和派中国人，毕竟我认为除了极端方法应该还是有某种方法实现现代化和民主自由的。\n\n龙玉涛 • 2019-03-28\n\n@rtgzddgh: 不是 double think，是馬基雅維利；double think 這個詞太貶損了\n\n龙玉涛 • 2019-03-28\n\n@小钙: 與其說姨在給教徒一個心理安慰，倒不如說姨是在給某些目標聽眾喊話：包是一定會對內用核武器的，做好準備\n\n龙玉涛 • 2019-03-28\n\n@小钙: 姨之前喊話過一次：\n更大更多的反人類罪還在路上，列強將來會以鎮壓濫用核武器的食人族武裝流民為法律依據，嚴格關閉貴國海陸邊界的。諸夏軍閥如果有眼色，就會抓住這個機會冒充張作霖，跟越南分列強的難民援助，負責看守核平區邊界，從而贏得政治身份。諸夏知識份子的認為，就是教育他們在正確的時間做正確的事情。\n\n小钙 • 2019-03-28\n\n@龙玉涛: 那其实还是给教徒心理安慰，毕竟根据姨的观点，大部分人都是费拉贪生怕死的，一定使用核武器就是等死，因此武德不足的多数人就会放弃独立的念头，此时这句话就是用一些可能完全没有根据的 assumptions 得来的结论安慰这些潜在的不够衷心的诸夏建国人民\n\n小钙 • 2019-03-27\n\n@龙玉涛: 他的喊话群众仅限相信他的教徒，一般通过会认为他是极端主义疯狗，而给教徒喊话的目的也很明显，就是为了让教徒坚定诸夏的决心。\n\n龙玉涛 • 2019-03-27\n\n@小钙: 相互確保毀滅（哪怕是潛在的 / 意淫出來的）本來就很 MAD，而且包子用核的可能性本來就不為 0\n\n小钙 • 2019-03-27\n\n@龙玉涛: 但在我看来是安慰，因为首先他没有核武器，其次一旦美国你和国打起来，核武器一用上就 fallout online 了，你在诸夏还能在废墟上建国吗？他的意思其实就是不要担心核武器，（美国）会核平北京的\n\n龙玉涛 • 2019-03-27\n\n@小钙: 目標不是教徒，而是地方實力派\n意思是：不想為支那陪葬的話，就拿起諸夏大旗（至少帶路也有名分）\n\n小钙 • 2019-03-28\n\n@龙玉涛: 并不会如此，地方实力派根本不屑一顾的，根据背景来看就是安慰一些诸夏分子罢了，毕竟你姨的影响力还没有到能威胁地方势力的程度。\n\nrtgzddgh • 2019-03-28\n\n@小钙: 我不知道你在墙内待过与否. 我就不问了. 但我以前在学校的时候 (按人口比例在沦陷区 1% 的学校), 和知识分子家庭的同学聊过天, 他是那种完全的所谓开明知识分子 + 温和派中国人 + 闷声发大财派. 不是核心党人士. 但他提到共产党的时候, 也是一口咬定 \"如果共产党要失去了天下, 杀三亿人能换三十年天下, 他们肯定杀\".\n注意, 他绝对不是姨学分子, 他喜欢看的是民小那批人. 关心的问题也是阶级固化什么的.\n但得出的结论也是 \"共产党至少有这个意愿用 30% 人口换 30 年江山\"\n彼时我完全不知道姨学. 但是只要是墙内中国人我见到的. 这个结论多多少少都赞同.\n\n龙玉涛 • 2019-03-27\n\n@小钙: 這沒辦法，核武器本來就很變態\n還有，支那有核武器米國也要負責，誰讓米國監督不嚴，導致核武器擴散\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 没错，这点我是赞同的，因为我说过了你国就是你党设置的丛林社会，你不杀我我就杀你，是一种零和博弈，用你姨的词汇来讲就是「原子化」，所以支持这种观点很正常。任何一个独裁政权能毫无笋丝的维护自己政权的话，都是会使用的，只不过他把问题想得太简单了，现在谁能毫无笋丝的杀三亿人？如果拿这种观点来论证姨学是唯一出路的话，我实在是看不出来有什么联系。\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 我没有否定你姨早期对中国的评价，而且我也很支持他提出的反对大一统理念和你国强加的民族国家文化认同，我认为你国最厉害的一点就在于发明出来一个中华民族并且不断的实施民族自卑教育，将你国人变成一滩散沙。但你姨现在的宗教化实在是太过极端，我认为即使他能做到诸夏独立，也是一国一个共产党，我认为应该有更好的办法实现你姨提出的诸夏，而不是用他现在的手段\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 姨学的各种黑话和自带的歧视属性使不少原来的粉红一瞬转变成迫真姨粉和支黑，这点对实现诸夏没有任何好处。如果独立后仍然一国一个共产党，我认为还不如不独立，毕竟这种独立的方案必定伴随大量杀戮和牺牲（极端的诸夏分子必然会直接或间接地屠杀那些不信诸夏的所谓「低贱费拉」，最终走你国朝代更替的暴乱老路），我实在看不出来你姨提出的理论究竟怎么才能脱离他的提出的费拉循环。\n\nrtgzddgh • 2019-03-28\n\n@小钙: 说真的, 你完全可以放宽心. 如果姨学是错的, 也就是中国不和美国开战, 那姨学家自然不能危害社会. 都没有摘桃子的机会.\n如果姨学是对的呢? 这种情况下且不说姨学家敢不敢在尘埃尚未落定的时候回东亚, 就算他们敢吧, 姨学的诸夏, 也是中国历史上给出的答案中相当好的了.(我们客观一点, 孙中山, 毛泽东夺权以前提出的那套东西现实吗? 有可行性吗?), 客观来讲肯定将来造成最大破坏的是新黄巢, 新张献忠之类的人吧? 如果有的话\n如果真要说的话, 姨学正因为缺少原创性. 搞出来的再坏也无非是一个天主教异端裁判所, 异端裁判所一般人认个错也就完了, 三百年也没杀几万人.\n最后如果中国落到了更悲惨的结果, 也不是姨学这份不太坏的回答给出的.\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 你姨认为只有走过封建才能走向民主共和，但事实是这种说法不一定成立，其次你姨实现诸夏的方法是通过暴力要挟群众，并口口声声说只有这一条路可以救中国。在这一点上，他是发自真心的不把大多数中国人当人看的，本质还是法家思想。他不是真的让人们意识到诸夏是唯一出路，而是把不相信的人先打成费拉然后批斗。这是我对你姨目前实现诸夏方案的理解，如果我的理解有误，请指正。\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 是的，姨学就建国就是建立在他预言的大洪水一定会到来的情况下，给出一个迫真解决方案。即使所谓大洪水真的来，我也不认为你姨以现在圈内自嗨的水平能摘出来什么桃子。只是不少姨粉魔怔到把姨提出的那一套方案当作唯一出路并且反对其他讨论，这点是大多数人无法与其交流的原因，毕竟大多数人实在是看不到洪水是该怎么来。\n\nrtgzddgh • 2019-03-28\n\n@小钙:\"你姨实现诸夏的方法是通过暴力要挟群众\" 这里有点问题\n我们假设姨学可以学以致用吧.\n是什么时候? 中国已经被美国打败了. 是姨学自己的暴力手段吗? 不是\n\n中国人对征服者臣服需要用很暴力的手法吗?(我这里没有种族歧视的意思, 只是客观指正)\n但是仍然害怕有野心家利用 \"中华文明\",\"大一统\" 的帽子招揽类似孙中山毛泽东等职业革命家.\n用游击队, 把愿意顺服的普通居民当人肉盾牌的手段继续搞革命.\n\n姨学想做的类似于日本占领台湾时, 使辜显荣这样的人主动箪食壶浆以迎王师.\n\n对于共产党, 如果在直接的对美战争中被粉碎, 外围几千万党员必定是会受至少财产级别的损失, 这不算严苛的对待吧?(我觉得真不算, 在所有意义上共产党对被打倒的阶级敌人都要狠上五倍)\n这时候还愿意相信共产党的人是哪些人呢? 列宁托洛茨基等离不开革命的老布尔什维克.\n而对待老布尔什维克的手段超过老布尔什维克对待中国人的手段了吗? 并没有.\n\n而且你是不是有点误解, 中国人虽然德性低落, 但我确实不觉得如果在被战争打败, 又除去共产党和游击队以后还有大批良民, 或者说普通人会心心念念想着大一统复国的.\n\n小钙 • 2019-03-27\n\n@龙玉涛: 这个真不是美国的锅，毕竟当时美国已经被苏联渗透成筛子了，而且核武器本身并不是理论上很困难的东西，只是当时没有一个人认为这么搞会有用，但曼哈顿计划证明了确实有用，苏联间谍再偷点关键性的实现技术细节，自己造出一个毫无问题，之后从苏联那扩散到了你国和朝鲜。\n\nrtgzddgh • 2019-03-27\n\n@小钙: 大洪水不是姨学家危害世界的机会, 他们也不敢回来.(我看多半是不敢, 只敢鼓励洪水区居民努力奋斗争取一个安全区域, 有利于洪水后重建)\n\n姨学真正有机会危害世界的时间只能在美国战胜中国之后.(如果倒过来那姨学家都得去跳太平洋了). 而那个时间点怎么看怎么看. 姨学并不是很坏的一份答案.\n秩序的主要来源也还是希望美国能进行输入 (达到苏联对共产党输入的那波强度就可以了).\n\n我举我以前同学的例子是因为, 我想指出, 哪怕是没有接触姨学的中国人, 心中埋藏的黑暗都是难以想象的 (我敢这么说, 至少中国有 30% 的人, 在因缘际会下如果有机会夺取天下, 杀 50% 的人口绝对没有心理负担.)\n我目的并不完全是比烂, 朱元璋能瓜蔓诛, 你觉得将来流血的危险主要真的在于姨学?\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 那你就错了，你国自始至终都是大汉主义盛行的，即使分裂的朝代，也是有不少国家想着要大一统复国的，而且最终都又成功大一统了。如果想彻底毁灭大一统，仅凭姨学在圈内自嗨是没希望的，而且如果只是你国内战美国插手，也是很难消灭大一统思想的。\n\n如果你国和美国真打了核战争，fallout 差不多也就开始了，毕竟美国打你国又不是秒杀的程度，而且你国还是核大国（除非美国在此之前搞出了秒杀目前人类科技的东西，比如超人工智能 / 核聚变能源 / 量子计算 / 生物武器）。这时候人类文明倒退几百年，到那时候你姨如果还想建国，那我是真佩服。\n\nrtgzddgh • 2019-03-27\n\n@小钙: 满洲武士和大明的科技差距不比美国对中国的优势大吧? 人数劣势还更大\n\n退一步说, 如果姨学假设美国打中国摧枯拉朽的局面没出现, 那他们也不敢回东亚\n\n小钙 • 2019-03-28\n\n@rtgzddgh: 姨学能成功的唯一出路依我看来，大概是美国取得了超越人类目前可有的神必黑科技，从冷战转移到对你国发动热战（前提是冷战相当成功，你国间谍没有窃取到这个关键的科技），成功轻松秒杀你国，你国人意识到共产党的民族和大一统都是洗脑，美国要求分裂你国，姨学家回来摘桃。\n\n我只想说，还有这种好事？\n\nrtgzddgh • 2019-03-28\n\n@小钙: 我只是指出来大部分情况下姨学并不会危害世界. 就算有机会的时候, 也不是主要的恶.\n\n你总不能要求每个人任何时候都在为使世界更美好奋斗吧?\n\nkillreddragon • 2019-03-28\n\n@小钙: 实际上我觉得姨学底限应该在于反大一统反桂枝的国家构建。至于你说的路径表达上的问题，很多时候并非是理性表达，而是因为对于桂枝粪坑般的现状的无垠憎恨所产生的感性表达。事实上何岸泉懂什么姨学么？东突厥斯坦的圣战士们又懂什么姨学？\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 现代战争主要有个核，这也是为何不能拿以前的战争和现代作比较。古代都是冷兵器，别说导弹，就是步枪都没有，现在一个核弹就能摧毁大部分军工设施，随便几个下来双方都得玩完，没有一方超越另一方的黑科技只能沦落到 fallout 的地步\n\nrtgzddgh • 2019-03-27\n\n@小钙: 那不就完了? 既然他们不会危害世界, 回东亚都不敢, 那你也没必要揪着指责. 你当他们是地心说爱好者就行了.\n\n我学的是工科, 但我真没能力判断两国科技差距有多大. 武装力量有多大区别, 隔行如隔山. 而且因为中国承担的分工不同, 我也不敢说中国到底在我这个专业是绝对做不出美国那些东西, 还是只是没有必要.\n\njuicy 掌握了最高权力, 理论上什么事情都有人为他分析, 但他连发动群众炼钢行不行得通都不知道.\n\n小钙 • 2019-03-28\n\n@rtgzddgh: 没错，不过我看不惯的是那些冷嘲热讽真正为世界变得更美好而奋斗的人，将其打成所谓「幼稚民小」，这是目前来看部分姨粉做的唯一的恶，但我还是这些是迫真姨粉真支黑。\n\nrtgzddgh • 2019-03-28\n\n@小钙: 核武器也没人用过, 中国核武器应该是不够的, 但我不敢确定.\n我的意思是, 苏联似乎并没有直接对外扩张的意思, 如果中国的核武器足够作为挑战者自保, 那苏联就该在达到中国核武器数量的时候停下来, 因为反正也不用来直接进攻西方.\n如果 1000 枚核弹就足够毁灭地球了. 那地球上根本不会有这么多核弹\n\n这是我的想法\n\n小钙 • 2019-03-27\n\n@killreddragon: 所以我之前一直认为刘仲敬本人没有那么恶臭，都是恶臭你支的锅，刘是风评被害，我只是说现在来看制造真支黑刘有一定责任。\n\nkillreddragon • 2019-03-27\n\n@小钙: 我觉得这其实不过是民运反共圈抓特务风潮的另一种演变形式而已，哪怕没阿姨不照样特务来特务去么？\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 核军备竞赛本来就是一种博弈行为，这和一亿玉碎的性质几乎一样，就是要形式上拼个你死我活，但实际上都是为了自保，不过也都做好了同归于尽的打算。如果你国和美国现在开始新冷战，强度和苏联一样，而且有不可调和的矛盾，那你国也会造一堆核武器，目的其实还是为了不要打起来。\n\n小钙 • 2019-03-28\n\n@killreddragon: 不明白特务是什么意思，我只是反对一些冷嘲热讽的犬儒主义者，我觉得民运至少总体对反共做出的贡献比姨粉大多了，迫真姨粉们不仅不反，有的竟然还反别人反，实在无法理解。\n\nrtgzddgh • 2019-03-27\n\n@小钙: 一个解释是 (我觉得这个解释能让很多人接受, 但不一定对), 姨学家的来源有两大流派, 一是民小, 一是皇汉, 阿姨本人以前就是民小, 我以前是民小 + 皇汉, 民小和皇汉在和姨学接触过多以后, 可能发生转化变成姨学家. 至于粉红能不能直接转化成姨学家, 我不了解.\n\n也就是姨学本身就很有动力去攻击民小和皇汉, 因为一旦姨学转化了一个民小和皇汉, 就相当于争取到了一个追随者.\n而且打击民小和皇汉的过程如果很有理的话, 也可能吸引吃瓜群众了解姨学.\n\nrtgzddgh • 2019-03-27\n\n@小钙: 比如之前的佳士事件, 新品葱相当多人冷嘲热讽\n\"用 juicy 那套搞工人运动? 你还真以为共产党会怕你?\"\n是不是我们不该同情工人待遇不好? 还是该的. 但是如果采取的手段自己觉得太错了. 那也没法去支持. 甚至忍不住就冷嘲热讽起来了.\n我并不是说新品葱的冷嘲热讽一定是对的. 但是至少冷嘲热讽的人认为 \"我就是不做. 也比你用如此错误的方法抱薪救火好\"\n姨学家们嘲讽民小, 也可能出于这样的心态.(当然, 这的影响并不大. 民主人士要是行得通, 还怕这点嘲讽吗? 连姨学家的嘴皮子嘲讽都怕. 怎么面对共产党?)(姨学家一般认为民小分子最终结局是自取灭亡. 所以我认为他们倒不至于主动做什么损害民运的事情, 所做的最多就是黄鹤楼上看翻船)\n\nkillreddragon • 2019-03-27\n\n@小钙: 这其实也好理解，因为虽然我们可能感情上可能都在站在民主派开明派那一边，但在实际上，体制内的这些开明力量很可能反而起到了一种对共匪的修补维护甚至是抢救的功能。最典型的例子就是 wto，而如果你让他彻底烂下去，反而有可能已经完蛋了，不止开明力量如此，国际人道主义力量可能也是如此。如果没有胡赵，如果没有来自自由世界的人道主义化肥，也行支共早亡了。\n这是一种矛盾的博弈，也就是说如果桂枝的自由开门力量能大于秦政保守力量，那么也许最终能让桂枝走上正常道路，很多人怀着这种本能期待的人支持了这些力量。但是如果答案是完全相反的，自由开明力量最终也无法避免失败，那么这些自由开明力量可能反而变成了共匪欺骗自由世界的伪装，反而成了共匪残破体制的修补剂，长远来看让共匪日后获得了更加强大的力量。而如果没了这些自由开明力量，也许共匪早就彻底垮了。\n\n小钙 • 2019-03-27\n\n@rtgzddgh: 所以这种冷嘲热讽就是情绪化表达，毫无帮助 + 打击积极性。品葱很多人是对为民主而奋斗持观望态度，大多数人仅仅是对你国不满，还没到要为你国民主奋斗的程度，而且也不知道该怎么奋斗。这时候来几个支黑三言两语说几句桂枝没救费拉该死，听不懂的一般通过就跑了（因为这种言论谁听了都会不舒服），或者见识到你国太多绝望的人就信了，然后也开始传播这种思想。最终结果就是品葱沦为一个一堆犬儒主义者发泄的场所（结合膜小鬼的抖机灵，基本就半死不活了）。\n\n此外民小一般的确都是小清新，所以上来就扣个帽子批判一番只能把人气跑，很难吸引到新的人了解姨学，更何况姨学自带的一些极端言论民小是真的看不下去的。但如果用比较理性的文字转述和解释，却可以让他们更好的理解。这也是为什么编程随想在无论什么持什么立场的人看来都是风评极佳，而你姨几乎处处风评被害。\n\n真正的民主斗士是不会因为这种嘲讽而退步的，但品葱几乎没有 1 个甚至 0 个真正的民主斗士，甚至连一些真正愿意讨论的人。\n\n以上仅限迫真姨粉，品葱有哪些我就不指名道姓了，而且从来没有反对过姨学家。\n\n小钙 • 2019-03-28\n\n@killreddragon: 但是共垮了以后可能再上来一个新共，这点是很难避免的，这也是为什么编程随想一直在呼吁非暴力革命，而且必须是革命而不是改革。曾经的确存在一种反共和反支的矛盾，但目前这种矛盾几乎不存在了，因为共不反支也没地方反，可以说你共是把支利用到了极致。\n\n> https://pincong.rocks/question/2980","language":"text/plain","encrypted":false,"added":1554109437},{"paste_id":1,"description":"","body":"{{Information\n|name = 习近平\n|photo = 文件:习近平.jpg\n|photocap = 死妈脸\n|id = 小熊维尼\n|rating = ∞+\n|class = 国家主席\n|ability = 开坦克\n|speciality = 意淫<br>吹牛<br>出道<br>做中国梦\n|hissatsuwaza = 枪毙<br>赵弹打击\n|idcard = 110101195306xxxxxx\n|affinity = 死妈人<br>赵弹能力持有者\n}}\n{{AmBox\n|image = [[文件:需要出道.jpg|50px]]\n|border= red\n|type  = 需要出道\n|info  = 该页面描述的对象'''较为神必'''且硬度极高。为了更全面的记载该人物，本维基需要你的帮助，'''出道'''更多个人信息。\n}}\n'''''谨慎行动:该页面描述的对象有极强的反咬能力，如:赵弹打击等，请在与其互动时保护好自己的信息，以免造成不必要的笋丝。'''''\n= 简介 =\n习近平，1953年6月出生，陕西富平人。硬度无限，是本站最硬、最恶俗的人。\n== 事迹 ==\n=== 无限连任 ===\n2012年12月5日，在当选国家主席不到一个月后，习近平在纪念现行宪法公布施行30周年大会上引用了邓小平的语录：必须使民主制度化、法律化，使这种制度和法律不因领导人的改变而改变，不因领导人的看法和注意力的改变而改变。\n\n废除领导职务终身制是1982年《宪法》的重要贡献。36年后，国家主席任期限制却被中共委员会建议从宪法中取消。不出意外，这条建议将在今年两会期间获全国人大常委会审议通过。\n25日新华社发布消息后，社交媒体上一石激起千层浪，很多用户或明或隐地表达了反对之意。有一篇“我为什么想当皇帝——袁世凯采访手记”的文章在微信朋友圈热传，但很快遭到删除。\n\n几小时内，微博启动了审查机制，大量的微博帐号遭禁言甚至删号。百度指数上，从新华社下午3点多发布消息至晚上7点，“移民”二字的指数从不到100飙升至近2500。目前，“袁世凯”在微博上的搜索结果已被屏蔽，“移民”一词在百度指数上的显示也已被屏蔽。\n=== 历史罪人 ===\n中共在人大、政协两会召开前，突然宣布要修宪，废除国家主席任期的限制，换言之，只要习近平想坐多久就坐多久，被讥为习包子大帝。\n\n虽然很多人将俄国总统普京和习近平作比较，但普京比习近平君子得多，至少尊重宪法对总统任期的限制，他一度退任总理，也算一名多党制下普选总统。尽管俄国的民主政制充满问题，习近平就完全不把所谓宪制放在眼内，更不要说中共与别的政党角逐国家主席一职了。\n\n==== 改变党内游戏规则 ====\n\n习近平这次恢复终身制的举动，本身是漠视了中共党内共识。邓小平虽然在改革开放政策替毛泽东的乱政拨乱反正，有极高威望，但1989年北京大屠杀后，邓小平是以“普通党员”身份影响政局，在中共党内以至政府都不保留任何职位。邓小平的做法其实某程度上反映中共党内的共识，当时中共有改革派保守派，邓小平没有将自己的位置坐到底，不同派系的人可以轮流做庄，某程度上令中共权力格局得到平衡。习近平之前已经废掉了文革后刑不上常委的共识，现在连终身制都恢复过来，改革开放后中共仅存的游戏规则，已经被习近平一人破坏净尽。\n\n习近平现在挑战一人独揽权力，去当皇帝的做法，其实与毛泽东、袁世凯和溥仪无异。这三人之中，毛泽东有开国君主的威望，而且有一套搞个人崇拜的能力，习近平肯定无法与之相比。溥仪只是日本人扶植的傀儡，不值一提。习近平实际有点像袁世凯，袁世凯当年假造民意，意图称帝，破坏民国共和体制。袁世凯洪宪称帝虽称胡闹，但当时袁世凯逼大清皇室逊位，将政权移交中华民国有功，袁世凯在中国现代军事、教育现代化，甚至天津实施普选等事上都有贡献。习近平请问何以与袁世凯相比，袁世凯纵使有一定威望，甚至军权在握，当年称帝都被蔡锷等人发动护国运动搞得人仰马翻，笔者看不到外强中乾的习近平，比袁世凯更有实力和条件搞无帝制之名、但有帝制之实的帝制。\n\n这次习近平恢复终身制，实际是自找麻烦之举，不单世人看到习近平的倒退，令本来对中国多加防备的世界各国更防备中国。另一方面，习近平的政敌自此可用维护改革和体制之名反习近平，他们干了多少贪污勾当，不少人都可能暂搁一旁，这与给予蔡锷等人起兵造反的借口无异。而且终身制一确立，就不知如何由习近平身上取得政权，那重新搞枪杆子争政权，而非搞党内斗争一类的文斗，就会成为习近平敌人们的唯一选择，习近平当权期间已经可能为中共政治带来不稳因素，万一习近平突然离开人世，权力真空一现，届时中国不会爆发军阀内战才怪，届时中国有有可能变成今日叙利亚的翻版，若最后局势发展至此，习近平将成历史罪人。\n=== 扛麦子中级高手 ===\n习近平曾经说道：“我几乎那一年365天没有歇着，除了生病。下雨刮风我在窑洞里跟他们铡草，晚上跟着看牲口，然后跟他们去放羊，什么活都干，'''因为我那个时候扛200斤麦子，十里山路我不换肩。'''”\n==== 引发质疑 ====\n黄土高原一个农村壮劳力，到底可以肩扛人挑多重的东西不换肩走多远？习近平在央视周末播出的原创名为《初心》（梁家河篇）的微视频中回忆在陕西省延川县梁家河村的生活经历，说他“扛200斤麦子，十里山路我不换肩的” ，这个描述引来诸多质疑。\n其实，这已不是中国媒体首次谈到习近平这个描述了。2012年中共18大之后，就有重要媒体如《人民日报》将这段话见诸报端，当时这句话就引起很多的质疑和调侃。\n<br>\n* 旅居美国的媒体人温云超周末在其“推特”上说，农村那个时候没有那么大的包，而且这么重的包，一般用扁担挑，而不是直接扛。关于“不换肩”的说法，他说习近平没有说是一口气走完山路，所以应该是每隔一会放下休息一下。\n* 旅居美国的经济学者夏业良在“推特”上批评习近平“吹牛都不打草稿”。还有网友在推特上说，标准麻袋装满小麦185斤左右，永远达不到200斤；装满的麻袋根本没法扛；人在上梁下坡的山路上根本无法扛麻袋前行；毛驴驮200斤麻袋连续走十里山路基本上累半死。\n* 在一个名为“未名观察”的论坛上，网友聚集讨论“扛200斤麦子，十里山路不换肩”是否是在造谣。（http://www.weiming.info/zhuti/Military/40127351/）其中一名网友说提供信息说，农村装麦子的麻袋大的180斤，小一点的100斤，而且能够扛着走十里路的说法不可信。\n* 据一位曾在黄土高原插队的知情回忆，那个时代农民本来就苦，而夏收秋收农民之苦，更是苦不堪言。一般来说，黄土高原的农民，收获季节并不需要挑担子走如此远的路。从生产队地里往村里收庄稼，一般是挑担子，路程在二、三里路之内。往公社送公粮，也许要走十里，但一定要换肩或休息。还有就是晒粮食，需要扛麻袋上房，这是又一个概念和范畴。\n=== 维尼皇帝 ===\n观察：小熊维尼在中国动了谁的蜜糖被封杀？\n周末，中国网管部门在社交媒体上封杀小熊维尼的消息流传甚广。有报道称，小熊维尼因为貌似中国最高领导人'''习近平'''，“维尼熊”成为中国网络的禁用语。\n\n== 语录 ==\n* 别看你今天闹得欢，小心今后拉清单\n* 中国人不打中国人\n* 因为我那个时候扛200斤麦子，十里山路我不换肩","language":"text/x-markdown","encrypted":false,"added":1555146080},{"paste_id":2,"description":"","body":"貴匪看台灣和國民黨看滿洲是一樣的\n都是沉迷於大國夢變成了傻逼\n\n劉仲敬挺弱智\n僅限豬瞎理論\n\n就憑指出「國民黨=低配版共產黨」這一點，就已經超越99.85%的支那人\n\n豬瞎理論的意思是，因為秦朝以後就墮落了（這點是事實），所以回檔到先秦（極不可能，指望返老還童還不如指望支那滅絕）","language":"text/plain","encrypted":false,"added":1555308879},{"paste_id":3,"description":"姨","body":"\nList members\n\n汉之云\n @3As7SpJjom8nHla\n\nbunglong\n @bunglong4\n\n。。。。。。。。\n伏地魔\n @warhammer9527\n\n调皮的童年，暴虐的少年，启蒙的青年，责任的中年。斯宾格勒历史学爱好者，极右翼基督徒。反左反穆反教皇。毕生之敌日月星。\nsinocaliphate\n @sinocaliphate\n\n提倡科学乳滑，谢绝爱匪屠支\nZhongjing Liu | 劉仲敬\n @LiuZhongjing\n\nHistorian, ex-medical examiner, author of Canons and Chronicles: China's Historical Construction | 《經與史》作者，曾刀下閱屍、現筆下論史\nJohn C.Lily\n @yubarlily\n\n学习直升机驾驶中\nI HUNG CHEN 陳易宏\n @isawamaho\n\n台灣執業重症醫師。劉仲敬姨粉。有問題想問阿姨可以直接在站內傳私訊給我。\nMichael\n @wusewuxiang\n\n不用多写什么介绍了 Medium https://t.co/2ZMT5TLw5M 吴越不死，诸夏不生（1） https://t.co/o4p2g6O8A 吴越不死，诸夏不生（2）（上中下） https://t.co/xp2dp5bs8d https://t.co/W9qs2PiSvZ https://t.co/OJiP\n","language":"text/plain","encrypted":false,"added":1562229594},{"paste_id":4,"description":"日","body":"魔幻力量\n @40KrZZ7akgOUx5t\n\nwkwk\n🇮🇳\n🇲🇾\n🇮🇩\n🇻🇳\n🇵🇭\n🇯🇵\n @IrwanHardja\n\n其实你们是菜人，本来就是给炮灰当想肉吃的（确信）\n吱吱做响\n @zhizhizuoxiang\n\n新自由主义份子司马\n累\n @Mr__lei__\n\n愛がなければ視えない\n変態な猫\n @knight5xxx\n\n日本語勉強中 / 秦国人 / 自民党精神党员 / AKB48＆乃木坂 46＆欅坂 46 & 日向坂 46 大好き\n烈くん\n @sirakirei\n\n知性とせいぎ。——无论是举起「左手」还是举起「右手」，你都打不倒任何人\n","language":"text/plain","encrypted":false,"added":1562229639},{"paste_id":5,"description":"支","body":"\n老 K\n @jimpangzi\n\n前医师，政治评论员\nmalau\n @malau94428928\n\n😎🤓🧐🤣😂😄😆🤪😍🤡💀\nUFO Spotter\n @w94lNaqf\n\n🛸🔫\n生活越来越美好啦\n @cidjdveveb4h\n\n这世界上没有大神，只有跳大神。\n🐳\n @Uromayutori\n\n李颖\n @LiYing_2015\n\n资深非著名汉奸\nAndrew\n @andrewxandrew\n\nmacro investor\n5GRefugee\n @5G_Refugee\n\nRT just for RT\n","language":"text/plain","encrypted":false,"added":1562229668},{"paste_id":6,"description":"惡","body":"\nVindermiatrix@反送中\n @Vindermiatrix2\n\n麻烦屑推不要迫害一般通过人士\nthecommanderofpkf\n @commanderofpkf\n\n，，，\n神秘人\n @1anHF7pv5YndH6Y\n\n大羊殘暴賽虎狼，一氣襲來無能擋\ntype74g 42nd@8964 广场大屠杀\n @fortunateuser\n\n本质恶俗小鬼；海厨；尊师兼恶俗头子习近平；硬汉（直球）\n神必商人こうみく#\n🇵🇳香港頑張れ!\n🐻\n🔫\n @tosawamuno8964\n\n廢推、隨時虛無、已魔怔、謝絕野蠻欽點 | 尊師 @Twitter 大號 @koumikudayo | 高雅互動熱線：18615651570 | 本人愈頌豪居住證號 11010819920625574X 歡迎小鬼檢舉橄欖\n侯旭升\n @esg444\n\n完完全全的二次元，戒支黑\n魔怔 13\n @Block50cents\n\n支持惡俗 我喜歡惡俗娘啊啊啊啊啊啊\n白胡椒\n🇭🇰 #香港加油\n @BKPNU\n\n萌新 | 洋垃圾爱好者 | 蹭热度一把手 | 东方众的萌二 | R6S 小叮当 | 支持一中各表 | 谢绝野蛮视奸号 | 政治推文减少中 | 布丁帮中央网评员 | 大概会互 fo | 头像 cr @Lv9996exp\n2501_0\n @nf0RvF9qLpjzOpv\n\nWilliam Smith\n @fakeFreeShadow\n\n@realFreeShadow\n恶俗维基\n @ESUweiki\n\n恶俗维基——恶俗的百科全书\n黒田雅紀＠反送中\n🇭🇰\n @KurodaMasaki324\n\n美帝留学生 / 安卓服 FGO 长草中 / 大二 / 日本語勉強中 / Parradox 大好き / 奥斯曼史 /🇯🇵🇩🇪🇫🇷最高 / カトリシズム / 下北澤蘇丹 / 社會民主主義者\nさくらばめい\n @SakurabaMay\n\nメイと申すです！所有的关注者都是朋友、フォロワー全員友達。時々絵を描きます。主に健全な二次元画像 RT、美術、音楽、百合、鉄道、艦これ、リリスパ、ガルパン、リズと青い鳥、きらファン。吹奏楽と占いが好き。日本語を使えます。\nBill\n @Bill89109768\n\n塔塔ちゃん、xxxx\n @Ozawa_Nagise\n\n貴族でもいい、普通な人でもいい、夢があるならちゃんと叶えよう！／やはりみんなの力になりたい！そうになれるように頑張る！ 提问箱→http://odaibako.net/u/Ozawa_Nagise \n烂泥偏指\n @FakeJansonJohn\n\n无知，无礼，无趣。这里是 114514 个偏指的公用账户。 TG 频道: https://t.co/mW1HQM9zSU?amp=1\n锡兵统领库洛海姆\n @KulonheimSuka\n\n巴蜀利亚独立运动爱好者，您身边的辱华 / 辱支国东方圈小能手，伤害车万韭韭人感情的老朋友，你車支音播音员（欢迎投稿。+86 13808826652\n姬川图书之助 @自由樺太\n @Masayuki_II\n\n嘗試變得更自強 | 撤回送中恶法 | 我要真普选 | 广告位出租 | 广告位出租 | 广告位出租 |\n𝗦𝘂𝗺𝘂\n🇭🇰香港必勝!\n @VOERH\n\n𝐒𝐭𝐫𝐞𝐧𝐠𝐭𝐡 𝐓𝐡𝐫𝐨𝐮𝐠𝐡 𝐔𝐧𝐢𝐭𝐲 • 𝐔𝐧𝐢𝐭𝐲 𝐓𝐡𝐫𝐨𝐮𝐠𝐡 𝐅𝐚𝐢𝐭𝐡\nbunny ^O^@八九六四\n🇭🇰\n @asakuramiu_114\n\nsuspended\n远方无声鸽\n☂\n @Silent_Dove8964\n\n文明玩网 👨🏻‍💻| 尊师：@HeyMe0w\nObentou@創持ゾンビ\n🇭🇰\n🏳️‍🌈\n @sonshidoku13\n\n生きていて良かったな、本当に良かった\nZhinaWiki 的更新姬\n @ZhinaWiki\n\n正义事业只为乐子，混乱邪恶才是本质\n(¬_¬)\n @Satori_Kom\n\nME student with hobbies of 東方 project, fluids, math, physics and politics. Independent but friendly. Fo me and chances we'll become friends. 来自中华民国沦陷区，不姓赵的赵国人。\nEdsger Lin\n @LinCodes\n\n在日中国人プログラマ、日英中 3 ヶ国語で発信します。 Chinese programmer in Japan, lang: ja, en, zh. 在日中国人程序员, 日英中三语。 My PGP Public Key: https://lin.codes/key.asc \n溫文儒雅的ジャービス\n🇸🇭\n🇬🇧\n @Yajyu_senpi\n\n24 歲 / 學生 / 溫文儒雅 / 遊戲玩家 / 夜行貓科動物 / 程式設計 / 需要回 fo 或轉世推友請私信 / 不喜歡討論政治（迫真）合作電話：13121593759\nMikaAkagi\n @MikaAkagi\n\n◄Track01 |◄Track02 | ◄Track03     +PLAY-| + PLAY - |+ PLAY -     Play∷xm∷EternalBeat/aRTy∷\n由乃\n @Yuno337\n\nPHE. Os iusti meditabitur sapientiam, et lingua eius loquetur iudicium（Psalmi37:30）\n𝒜𝒾𝓇\n🌟 空空和夏日晚风\n @Solitude_Sola\n\n一个孤单的人格，一种快乐的意识。- - - 守序邪恶 == 真名宿敌\n嘤嘤嘤的 Adobe@64 三十周年\n @yingyingadobe\n\nFFF 团中将军衔，FFF 团推特分部下属第一机械化喷火大队，推特动物园工作人员，死宅，萝莉控，2B 青年，吸猫，吸狗，吸兔子……。不求权钱名利，只求心安理得。视奸号见一个 B 一个.\n","language":"text/plain","encrypted":false,"added":1562229738},{"paste_id":7,"description":"網","body":"\niyouport\n @iyouport_news\n\nThe job of the press is to disprove the falsehoods that power invariably disseminates to protect itself.#humanrights #Cypherpunk #FreedomofInformation\nDon Evans\n @DonEvansWm\n\n#cypherpunk #formercorrespondent #psychology #author Pirate Party\ndjvu\n @ddjvu\n\nOpinions are my own.\nclowwindy\n @clowwindy\n\nFENG DONG\n @middlefeng\n\nAdobe. Programming C++, Lua, iOS, macOS, Metal, OpenGL, Windows. Linux kernel fan (once). Photoshop development. Believe in singularity.\n","language":"text/plain","encrypted":false,"added":1562229787},{"paste_id":8,"description":"陰","body":"\nWoody_real\n @naskid_\n\nWoody🐧\n首推狮\n @CapitalloveLion\n\n复兴路 2 号院 41 号楼 509 隔壁\nTabγač Türük\n @Tabgach\n\nGnostic Christian✝️star-seed✴️ indigo👤Pathfinder of ⚡️Trumpet Russophile; 🇺🇸🇷🇺灵修基督徒😇光的探索者，普京和川普的粉丝;\n野罂粟\n @WilderMohn\n\n🇩🇪🇩🇪🇩🇪❤️❤️❤️🍀🍀🍀\n","language":"text/plain","encrypted":false,"added":1562229813},{"paste_id":9,"description":"二","body":"\n東方众的萌二\n🌸虚无\n @ARP_343542\n\n一般通过东方 project 爱好者，车万图转推 bot（迫真），有事请联系 + 1 605-475-6968 /// 由于各种原因全平台虚无一段时间\nCGTN 日本語\n @CGTNJP\n\nCGTN 違うものをみつけよう\nỴữKỉ\n @uki_WisniewskY\n\nCyber-Extremist || 言语温和，观点极端\n桜の下の猫\n🇸🇪\n @531213573er\n\nある人に必要なのは過去と向き合う 勇気、別の人に必要なのは夢の実現 の努力、また一部の人に必要なのは 長い時間と仲間。\n絶滅天使\n @Matattron\n\n過激派百合厨、マリアリ好き。ゆり画像の RT、中国語呟き多め。蜀國出身、日本在住。国信大 2 年｜meme 初心者｜中道右派｜歷史反革命｜剿匪学術研究\n工口组组长\n @erochain\n\nエロゲマー・ はなざわ さくら厨・漢日英 OK ・牛学家・ 善雅鸽汉化组组长・ LAMUNATION 中文版訳者\n末日幽靈\n @doomsdayspecter\n\n「藝術乃意志的表現」 ACG 自由撰稿者 (自稱－－無可藥救的 ACG 萌宅；囉囉嗦嗦的意志廚；義無反顧的政治廚；光明磊落的左膠；頂天立地的蘿莉控, 喜歡分析世事萬象。 開放 DM, 基本只 fo 中文, TL 全讀強迫症故極挑選回 fo, 望請見諒 噗浪：doomsday_specter 電郵：doraemongai@hotmail.com\n","language":"text/plain","encrypted":false,"added":1562229839},{"paste_id":10,"description":"？","body":"\n🇷🇺Фуа0.0Гра\n🇷🇺\n @EGANXIAO666\n\n俄羅斯右翼力量聯盟\nQuitKina\n🐗\n @quitkina01\n\n古文明、人性、陰謀 / 華夏自古德行不堪 / theism,ancient civilization/trust in mud fossil,flat earth more than the oppisite / 轉法輪 http://big5.falundafa.org/falun-dafa-books.html …\nJames Fridman\nVerified account @fjamie013\n\nDo not submit any personal photos that you do not want to be made public. Terms and conditions apply. http://jamesfridman.com/termsandconditions …\nstupidwz\n @stupidwz\n\n专注经济分析，货币，观察国家整体和宏观经济现象。\nArchillect\n @archillect\n\nThe ocular engine. Sources: @archillinks http://archillect.com \nSaida El Alloumi\n @SaidaElAlloumi\n\n某个说汉语的阿拉伯人。微信：shallman1 微信公众号：伊朗咖星人\n","language":"text/plain","encrypted":false,"added":1562229862},{"paste_id":11,"description":"main","body":"\nICE-Coal Fish 姉貴\n@KBMollysuh ‏ Follows you\n\n日本語能力 N10 の魔理沙大すきの深セン人💯迫真万事魔法使，什么事都做，包括飞行咨询等⭐️完全不会韩语 나는 한국어를 모른다⚠️\n\n🐳\n@Uromayutori ‏\n\nFENG DONG\n@middlefeng ‏\n\nAdobe. Programming C++, Lua, iOS, macOS, Metal, OpenGL, Windows. Linux kernel fan (once). Photoshop development. Believe in singularity.\nclowwindy\n@clowwindy ‏\n\nmalau\n@malau94428928 ‏\n\n😎🤓🧐🤣😂😄😆🤪😍🤡💀\n李颖\n@LiYing_2015 ‏ Follows you\n\n资深非著名汉奸\n烈くん\n@sirakirei ‏\n\n知性とせいぎ。——无论是举起「左手」还是举起「右手」，你都打不倒任何人\n5GRefugee\n@5G_Refugee ‏\n\nRT just for RT\n2501_0\n@nf0RvF9qLpjzOpv ‏\n","language":"text/plain","encrypted":false,"added":1562229917}],"comment":[]}