{
	"next_topic_id": 6,
	"topics": [
		{
			"topic_id": 1,
			"title": "Version 0.2.8 was released! Namecoin (.bit) domain support!",
			"body": "see the official blog:\n127.0.0.1:43110/1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8/?Post:24:Changelog:+Mar+29,+2015\n\nyou have to update manually.\n\nseems the author of the article forgot to paste the new site ( ZeroName )'s address:\n\n127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F\n\nThe feature is really cool! THX!",
			"added": 1427849374
		},
		{
			"topic_id": 2,
			"title": "Start a new site using Tor, can you see my site?",
			"body": "http://127.0.0.1:43110/16ynw3e3G6mVz3LkaztXufXqjRtyZjPJ3K\ncan you see my site? please tell me! THX!\n\nEDIT: someone reported the site could be seen. Thanks to all involved!",
			"added": 1429232101
		},
		{
			"topic_id": 3,
			"title": "Can traffic be encrypted in ZeroNet now?",
			"body": "Can traffic be encrypted in ZeroNet now? If can't, please  offer traffic encryption  option.  It's necessary in CHINA because of the Great FireWall which has Deep Packet Inspection. If traffic contains sensitive content, nodes may be blocked. And traffic without encryption results in privacy problem. I think traffic encryption can be easily implemented since you can refer the code of  shadowsocks ( https://github.com/shadowsocks/shadowsocks ), a popular Python tool to bypass  the Great FireWall in China. THX!",
			"added": 1429575722
		},
		{
			"topic_id": 4,
			"title": "idea of ZeroSocial -- timeline view of ZeroHello",
			"body": "ZeroSocial ( whatever it is named) is like a timeline view of ZeroHello, since seeding a site is like following a site. If the site we followed is a blog and has a new post, the new post will be at the top  of the timeline, just like G+/facebook/twitter. And we can comment or retweet posts in the timeline, fo or unfo a site.",
			"added": 1433079478
		},
		{
			"topic_id": 5,
			"title": "pls update to latest version to make more traffic encrypted/请升级到最新版本以加密流量",
			"body": "from Version 0.3.1, support Encrypted connections using SSL by default, pls update ASAP! if a update message doesn't popup in web UI, pls:\n1. stop ZeroNet in python console\n2. excute update.py\n3. start ZeroNet again\n\n从 0.3.1开始支持SSL流量加密（默认设置），请尽快升级！如果升级提示没有在页面上出现，请：\n1. 在python控制台停止ZeroNet\n2. 执行update.py\n3. 再次启动ZeroNet",
			"added": 1434081116
		}
	],
	"next_message_id": 63,
	"comments": {
		"1@59": [
			{
				"comment_id": 1,
				"body": "在ZeroBoard上一堆中国人呢。在这发言需要路由器开uPnP，另外需要在左上角点Request access，随意填一个昵称",
				"added": 1427331248
			},
			{
				"comment_id": 3,
				"body": "> [p2p](#comment_1_62): 在ZeroBoard上一堆中国人呢。在这发言需要路由器开uPnP，另外需要在左上角点Request access，随意填一个昵称\n\n回复某人留言，点那个人昵称右边的时间",
				"added": 1427331513
			}
		],
		"1@60": [
			{
				"comment_id": 2,
				"body": "works well in a fresh installed linux mint, THX!",
				"added": 1427331326
			}
		],
		"1@62": [
			{
				"comment_id": 4,
				"body": "> [nofish](#comment_48_2): Thanks :)\n> The first time you try to access a site by domain the ZeroName site is automatically added to your sites, so no need to open in manually, but it could not hurt :)\n\noh, I got it. I didn't see the ZeroName site in ZeroHello after I updated, so I searched the address from github repo : )\n I think it would be better if you mention \"the ZeroName site will be automatically added\" in your article.",
				"added": 1427859031
			},
			{
				"comment_id": 5,
				"body": "> [nofish](#comment_48_2): Thanks :)\n> The first time you try to access a site by domain the ZeroName site is automatically added to your sites, so no need to open in manually, but it could not hurt :)\n\none thing I want to ask: I pressed enter between sentences, why the post is shown without Line break?\ntest again",
				"added": 1427859699
			},
			{
				"comment_id": 7,
				"body": "> [nofish](#comment_49_2): p2p: one thing I want to ask: I pressed enter between sentences, why the post is shown without Line break?\n> \n> Site uses markdown syntax that only breaks your text if you press the enter twice. Its also frustrates me sometime probably im going to find some workaround to break with one enter.\n> Btw you can edit/delete your previous posts and topics by hover your mouse over the text and pressing the § icon. (This also needs to be changed something more clear)\n\nyep, pressing the enter twice works. I'm waiting for your workaround.\n\noh, pressing the § icon works. I haven’t known it before.  It really needs to be changed something more clear.\n\nTHX!\n",
				"added": 1427957910
			},
			{
				"comment_id": 8,
				"body": "> [nofish](#comment_50_2): p2p:  yep, pressing the enter twice works. I'm waiting for your workaround.oh, pressing the § icon works. I haven’t known it before.  It really needs to be changed something more clear.\n> \n> § changed to pencil icon, i think its clear enough\n> And single linebreaks also working :)\n\nWhat a quick fix! THX!\nBTW, in your latest article, I think it should be April 2 instead of Mar 2 : )\nAnd do you know Twister, a fully decentralized P2P microblogging platform？It has \" DHT relay mode \" to fully support Tor.",
				"added": 1428023761
			},
			{
				"comment_id": 9,
				"body": "> [nofish](#comment_51_2): p2p: BTW, in your latest article, I think it should be April 2 instead of Mar 2 : )\n> \n> Thanks, fixed :)\n> \n> And do you know Twister, a fully decentralized P2P microblogging platform？It has \" DHT relay mode \" to fully support Tor.\n> \n> I didn't knew it, after quick look its sound similar to ZeroNet, i will try it later.\n\noh, I can't imagine you didn't know it! Twister and ZeroNet are so similar! Twister was born in late 2013, and got some fame in P2P circle. If Twister and ZeroNet can learn from each other, we'll get perfect P2P microblogs, blogs, forums, sites...WOW, exciting!",
				"added": 1428050905
			}
		],
		"2@20": [
			{
				"comment_id": 10,
				"body": "> [nofish](#comment_56_2): und3rd0g: nofish dont go the tor way please . tor is backdoored .\n> \n> Currently experimenting them, i want to implement both, not sure yet which comes first, but I cannot see any easy solution yet, so help/ideas/suggestions greatly welcomed.\n\nsee: \ntwister-core 0.9.22: Tor support available http://twister.net.co/?p=366\nDHT traffic may be TCP-tunneled http://twister.net.co/?p=363",
				"added": 1428587299
			},
			{
				"comment_id": 11,
				"body": "> [nofish](#comment_57_2): p2p: see:twister-core 0.9.22: Tor support available http://twister.net.co/?p=366DHT traffic may be TCP-tunneled http://twister.net.co/?p=363\n> \n> I'm not sure if its a good idea to tunnel tor traffic to clearnet. We not tied to libtorrent or mainline (torrent) DHT, so i think we can modify the protocol (or use a different one) to allow to store .onion/.i2p addresses and make it work between Tor/i2p clients.\n\nwhen many people say Tor support, I think they mean supporting to use Tor as a SOCKS5 proxy. So I don't understand when you talked about .onion addresses. \nJust like under Tor we can read & post anonymously in Twister, I expect under Tor we can read & post & host  Zeronet sites  anonymously in Zeronet if we don't want to open a port. I think Zeronet is hard to blocked or censored, which means it can be more easily accessed by many people in countries like China than Tor hidden service. Some people really need to hide their IP when using Zeronet, but some don't. People who don't need to hide their IP can serve as  relays which help to relay others' TCP to UDP. \nAnd what do you think of Tor support? Can you explain more? Access  Tor hidden service through Zeronet?",
				"added": 1428652261
			},
			{
				"comment_id": 12,
				"body": "> [nofish](#comment_61_2): p2p: when many people say Tor support, I think they mean supporting to use Tor as a SOCKS5 proxy. So I don't understand when you talked about .onion addresses.\n> \n> In Tor network you can reach an another computer using his .onion address. Its the \"IP address\" of Tor network. \n> If you want to talk with an another peer without tunneling it to clearnet you must know his .onion address. So if we want a proper solution we need a something that able to store not only clearnet ip addresses, but also .onion (and .i2p) address and accessible using TCP.\n\nI got what you meant. But I don't think .onion address is  the \"IP address\" of Tor network. I think if a Tor node doesn't run hidden service, it has no .onion address. I'm not very sure. Maybe I'm wrong.\nIf i'm right, I think it's not very useful to store  .onion address because few people run  hidden service.   Running hidden service is not easy for non-technical guys. In my opinion,  supporting to use Tor as a SOCKS5 proxy is high priority.",
				"added": 1428676984
			},
			{
				"comment_id": 13,
				"body": "> [nofish](#comment_62_2): p2p: I got what you meant. But I don't think .onion address is  the \"IP address\" of Tor network. I think if a Tor node doesn't run hidden service, it has no .onion address.\n> \n> Yes, you need to run hidden service to have .onion address. If we don't support .onion addresses then it's not possible to start a new site on Tor network, you going to need peers on clearnet who is stores your site, so its not secure anymore.\n> Starting a hidden service is pretty easy (2 line in config file), to make it even easier i'm going to pack a Tor client with preconfigured hidden service, so you don't have to edit any file just start using zeronet.py --tor and its automatically start the tor node with the proper settings. (and shuts down when you closes zeronet)\n\nYour \"Tor support\" means distributed hidden service, right? Distributed hidden service is a great idea,  go to implement it  without any doubts. \nBut pls consider implementing another kind of  \"Tor support\"--support to use Tor as a SOCKS5 proxy. It is not used to run hidden service, but to setup a site anonymously and let other people access it ( store it ) without Tor. You know, Tor is blocked in countries like China,  even though \"Allow clearnet connections\" setting is on, if tor exit nodes are  blocked, some people can not access the sites. \nI understand your concern of security, but there are contents are not dangerous to store if one person is just a P2P node rather than the sites' owner. Just like in Twister, we can follow someone ( automatically store his/her posts in local drive), I don't think storing any posts posted by others is not secure or illegal. So give option to users : )",
				"added": 1428726945
			},
			{
				"comment_id": 14,
				"body": "> [TorUser](#comment_1_87): p2p: p2p: But pls consider implementing another kind of  \"Tor support\"--support to use Tor as a SOCKS5 proxy. It is not used to run hidden service, but to setup a site anonymously and let other people access it ( store it ) without Tor. \n> \n> Just added socks proxy + http tracker support, looks like everything is working well using Tor. If no other problem found i'm going to publish it in next days.\n\nTHX！Is it OK to start a new site like ZeroTalk using Tor, and other people without Tor can register & post? ",
				"added": 1428896291
			},
			{
				"comment_id": 15,
				"body": "> [TorUser](#comment_2_87): p2p: THX！Is it OK to start a new site like ZeroTalk using Tor, and other people without Tor can register & post?\n> \n> Anyone outside from Tor network can't connect to Tor peers, so its not possible. Socks proxy support only allow you to browse zeronet content, but you can't create new sites using it.\n\nAre you nofish ? Do you know Twister? In Twister we can use Tor as SOCKS proxy to read & post, can send private messages to clearnet nodes.  Twister has \"DHT relay mode\" -- clearnet nodes relay UDP to TCP for Tor users, so Tor users have full features. Both ZeroNet and Twister use BitTorrent  technology, so I think it's possible.",
				"added": 1428928692
			},
			{
				"comment_id": 16,
				"body": "> [TorUser](#comment_3_87): p2p: In Twister we can use Tor as SOCKS proxy to read & post, can send private messages to clearnet nodes.  \n> \n> You can also read and post using zeronet & tor, but creating new sites is not possible.\n\nLet's think from another angle. Did u use BitTorrrent Sync? We can start a new folder synchronizing from a tor node to clearnet nodes using BitTorrrent technology. This procedure is like starting a new site in ZN. In the procedure some relay servers help to forward Tor traffic.\nEdit: \nsome clearnet nodes can be the relay \"servers\" which help to forward Tor traffic.\nDid nofish forget something? My autoupdate did  not get the new tor-socks-proxy feature. I did git clone to get the latest code. I'm using Tor to post now:)",
				"added": 1428977515
			},
			{
				"comment_id": 21,
				"body": "> [nofish](#comment_70_2): p2p: TorUser: p2p: In Twister we can use Tor as SOCKS proxy to read & post, can send private messages to clearnet nodes.You can also read and post using zeronet & tor, but creating new sites is not possible.\n> \n> The problem is every zeronet site is independent, if there is no clearnet node using the site then noone can help you.\n\nIf someone starts a new site using Tor and promotes the site somewhere, is it possible for clearnet users (who want to help) to download the site and transfer the site's data to other clearnet users when the owner (Tor node) is offline? If it is not possible yet, please make it possible.\n",
				"added": 1429164396
			},
			{
				"comment_id": 22,
				"body": "> [nofish](#comment_72_2): p2p: If someone starts a new site using Tor and promotes the site somewhere, is it possible for clearnet users (who want to help) to download the site and transfer the site's data to other clearnet users when the owner (Tor node) is offline? If it is not possible yet, please make it possible.\n> \n> Its already possible by running a zeroproxy (zeronet on a public ip)\n> To do that you have to start zeronet using --ui_ip \"*\" (and enabling multiuser plugin is recommended). After that anyone can access your zeronet interface on your public ip address. This allows anyone to \"kickstart\" his/her website by addig the site to your client.\n\nHmm，running a zeroproxy may be a workaround.\nBut when I run python ./zeronet.py    --proxy 127.0.0.1:9050 --disable_udp sitePublish XXXXXXXXXXXXXXXXXXXXXXX\nit says:\"Port not opened, passive publishing not support yet\"\nIt is strage. We can post in ZeroTalk using Tor in passive mode, why we can't start a new site using Tor in passive mode？\nIf someone can't start a new site using Tor， running a zeroproxy seems not to help him/her.",
				"added": 1429196381
			},
			{
				"comment_id": 24,
				"body": "> [nofish](#comment_73_2): Yeah, that limitation no longer required, removed it. (you can update your zeronet by executing update.py or re-download from github)\n\nTHX! I tried many times, it says:\n\n- Gathering peers from tracker\nSite:16ynw3..PJ3K Publishing to 20/8 peers...\nSite:16ynw3..PJ3K [FAILED] 95.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 77.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 95.*.*.*15441: None\nSite:16ynw3..PJ3K [FAILED] 96.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 96.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 62.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 37.*.*.*:15441: {'exception': 'Timeout'}\nSite:16ynw3..PJ3K [FAILED] 64.*.*.*:15441: None\nSite:16ynw3..PJ3K Successfuly published to 0 peers, publishing to 0 more passive peers\n- Serving files...\n\nsuccess? seems no peers found.\nmy site is:\n http://127.0.0.1:43110/16ynw3e3G6mVz3LkaztXufXqjRtyZjPJ3K\ncan anyone see it? please tell me!",
				"added": 1429231897
			}
		],
		"1@91": [
			{
				"comment_id": 17,
				"body": "你现在已经会用了：）",
				"added": 1428979343
			},
			{
				"comment_id": 18,
				"body": "> [p2p](#comment_17_62): 你现在已经会用了：）\n\n刚才是Tor下留言，测试成功\nusing Tor, success!",
				"added": 1428979442
			},
			{
				"comment_id": 19,
				"body": "突然来了这么多新人，欢迎啊！从哪里知道ZeroNet的？\n这个不是用来翻墙的，不能用来浏览别的网站，但是好心人可以建站，把墙外的内容同步到这里，达到免翻墙效果。目前只支持用Tor 浏览和发贴， ~~暂时不支持Tor下建站。~~\n想翻墙的用VPNGate吧，附上最新的镜像下载地址：\nhttp://180.70.94.98:62215/en/ \nhttp://112.173.79.56:45964/en/ \nhttp://14.37.147.135:24165/en/ \nhttp://220.118.154.142:10857/en/          ",
				"added": 1429016311
			},
			{
				"comment_id": 34,
				"body": "> [oneonek_02](#comment_1_99): dns也实现了，是什么意思？？\n\n就像用域名代替IP地址，可以用namecoin注册的talk.zeronetwork.bit来代替1TaLk3zM7ZRskJvrh3ZNCDVGXvkJusPKQ访问这个论坛（当然前面都要加http://127.0.0.1:43110/）",
				"added": 1429454509
			},
			{
				"comment_id": 35,
				"body": "> [bts](#comment_2_121): 貌似用的websocket同web server交互，但是用户数据怎么发到所有人的呢？\n\n在ZeroTalk里，web server交互，分为远程的和本地的web server。远程的web server是site owner的，只用于注册（所以目前注册是中心化的）。等site owner把你的注册信息（用户名、公钥）写到网站文件夹里并同步到其他节点，你就能直接发贴到P2P网络，不需要经过site owner。本地的web server相当于后端，负责P2P传输并同浏览器前端交互。\n我之前提建议，能不能把注册去中心化，像Twister一样。或许可以不用PoW而用PoS",
				"added": 1429573228
			},
			{
				"comment_id": 37,
				"body": "> [bts](#comment_4_121): 恩，昨天花了点时间看了下，小数据量是可以这样搞，不过还是需要site owner授权这一步。如果大数据量的话，还是需要类似twister的技术，简单说不能把所有的数据都弄下来才能访问，必须把数据分散保存并且有一定的检索能力才行。\n\n如果大数据量的话，类似twister的才有问题。因为spam数据可能会占满用户硬盘。而ZN是有选择地下载数据，垃圾站的数据自然没有人去下载。twister本身的检索能力也不行，这是P2P的通病",
				"added": 1429628585
			},
			{
				"comment_id": 44,
				"body": "> [g20](#comment_3_141): 请教：如何创建ZeroNet的Blog啊？看了教程：“Create a new site using python zeronet.py siteCreate command”这句话命令行从哪里进去啊？有谁知道的吗？不胜感激！\n\n你看的教程说的是Linux下的语法。\nWindows下需要对命令行比较熟悉。我记得作者nofish在这里答疑时有提到Windows下的方法，找不到那帖子了，奇怪\n\nUPDATE:\n找到了，根据最新的文档： http://zeronet.readthedocs.org/en/latest/using_zeronet/create_new_site/\nWindows users using the bundle version must browse into the ZeroBundle/ZeroNet folder and run \"../Python/python.exe\" zeronet.py siteCreate",
				"added": 1430124756
			},
			{
				"comment_id": 59,
				"body": "> [wodetor](#comment_1_234): ubuntu下怎么用VPNGate？网上搜了一遍也没有。\n\n只有Win版",
				"added": 1435581746
			},
			{
				"comment_id": 60,
				"body": "> [p2p](#comment_44_62): 你看的教程说的是Linux下的语法。Windows下需要对命令行比较熟悉。我记得作者nofish在这里答疑时有提到Windows下的方法，找不到那帖子了，奇怪\n\n找到了，根据最新的文档： http://zeronet.readthedocs.org/en/latest/using_zeronet/create_new_site/\nWindows users using the bundle version must browse into the ZeroBundle/ZeroNet folder and run \"../Python/python.exe\" zeronet.py siteCreate",
				"added": 1435935638
			}
		],
		"1@94": [
			{
				"comment_id": 20,
				"body": "突然来了这么多新人，欢迎啊！从哪里知道ZeroNet的？\n这个不是用来翻墙的，不能用来浏览别的网站，但是好心人可以建站，把墙外的内容同步到这里，达到免翻墙效果。目前只支持用Tor 浏览和发贴，暂时不支持Tor下建站。\n想翻墙的用VPNGate吧，附上最新的镜像下载地址：\nhttp://180.70.94.98:62215/en/ \nhttp://112.173.79.56:45964/en/ \nhttp://14.37.147.135:24165/en/ \nhttp://220.118.154.142:10857/en/          ",
				"added": 1429016364
			}
		],
		"7@2": [
			{
				"comment_id": 23,
				"body": "60 FPS, Version 41.0.2272.76 64bit Chromium Linux",
				"added": 1429229399
			}
		],
		"2@62": [
			{
				"comment_id": 25,
				"body": "> [doublec](#comment_7_16): I'm unable to see this. It tells me content.json could not be found. Is your node still up?\n\nTHX for your response.\n I tried MANY times, it says:\n\nGathering peers from tracker\nSite:16ynw3..PJ3K Publishing to 20/8 peers...\nSite:16ynw3..PJ3K [FAILED] 95.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 77.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 95.*.*.*15441: None\nSite:16ynw3..PJ3K [FAILED] 96.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 96.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 62.*.*.*:15441: None\nSite:16ynw3..PJ3K [FAILED] 37.*.*.*:15441: {'exception': 'Timeout'}\nSite:16ynw3..PJ3K [FAILED] 64.*.*.*:15441: None\nSite:16ynw3..PJ3K Successfuly published to 0 peers, publishing to 0 more passive peers\nServing files...\n\nI wonder whether it succeeded.\nI'm using Tor and my node is always up. But you know my IP is changing because of Tor. So I think if I cannot publish to clearnet nodes, people cannot get my site.",
				"added": 1429244185
			},
			{
				"comment_id": 26,
				"body": "> [nofish](#comment_75_2): The problem is the clients only add the address to his known sites if he was able to download it.\n> So you can't push your new modifications to peers that hasn't downloaded it yet. (btw i think you should remove the ip addresses)\n> Looks like i was wrong and it do works in my testings:\n> \n> Created new site on local, Tor-ed machine: zeronet.py siteCreate\n> Opened the generated address on server machine http://server:43110/siteaddress\n> Executed zeronet.py --debug --debug_socket --proxy 127.0.0.1:9050 --disable_udp sitePublish siteaddress on local Tor-ed machine\n> The site do loaded on the server.\n\nthe ip addresses were masked.\nTHX! I'll test in debug mode. Can other people see your site created in your Tor-ed machine?",
				"added": 1429274469
			},
			{
				"comment_id": 27,
				"body": "> [nofish](#comment_76_2): After one clearnet peer with open port pickup up your site then anyone can access it from him.\n\nBut how can I publish a new site when no one knows my site's address? \nIf I tell a man ( with open port) my new site's address BEFORE I publish it through Tor,  can he get my site?",
				"added": 1429275232
			},
			{
				"comment_id": 28,
				"body": "> [nofish](#comment_77_2): You create a new site: 16ynw3e3G6mVz3LkaztXufXqjRtyZjPJ3K\n> The clearnet peer with open port open the site (he could not find any other peers, so the page loading screen is displayed)\n> The Bittorrent trackers stores his ip:port as possible peer for your site\n> You executes sitePublish command\n> Your client connects to bittorrent tracker using Tor and you found his ip:port as possible visitor\n> You connect to his ip:port and your client send the files to he\n> The page loads he and he becomes seeder of your site\n\nThank you so much!! So detailed! After trying many times, I saw I succeeded in publishing to a open port node in the console. Also THX the node! ",
				"added": 1429279093
			},
			{
				"comment_id": 29,
				"body": "> [p2p](#comment_28_62): Thank you so much!! So detailed! After trying many times, I saw I succeeded in publishing to a open port node in the console. Also THX the node!\n\nOh, I'll be near 20K limit in ZeroTalk, help! ",
				"added": 1429280134
			},
			{
				"comment_id": 30,
				"body": "> [nofish](#comment_78_2): Bumped to 50k. (congrats you are the first user who reached the 20k limit :) )\n\nHaha, you have not reach 20K? I thought you posted more than me. Or you are the site owner, no limit for you?",
				"added": 1429283497
			},
			{
				"comment_id": 31,
				"body": "> [nofish](#comment_79_2): I did (currently at  37.5K / 150K limit)\n\nSo you have 150K, I have 50K, others still have 20K? you can adjust the limit for a specific user?",
				"added": 1429286795
			},
			{
				"comment_id": 32,
				"body": "> [nofish](#comment_81_2): Sure, its a simple file: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/data/users/content.json\n\nI got it, THX! Support to start a new site using Tor is a milestone. I think next milestone is  support to start a new forum like ZeroTalk using Tor. User registration is a big problem because of IP changing of the forum owner. I've seen your idea of proof of burn in reddit. It is a good idea for preventing abuse, but it also keeps lots of people out of forum discussion because  many people don't have BTC or don't know how to get BTC. \nWhat about proof of stake? You keep most of stakes, and you can give stakes to volunteers who can run a node with a open port for long time. All usernames and pubic keys are stored in the blockchain, and can be used across sites. Every  PoS forging node keeps its own blacklist of IP for 24hrs to prevent more user registrations from same IP in 24hrs. ",
				"added": 1429318780
			},
			{
				"comment_id": 38,
				"body": "> [hailtotheking](#comment_13_131): What about using a Namecoin .bit domain ?\n> You would be able to receive direct payments for your site.\n> Simply open the Namecoin Wallet and pay to d/example (example.bit would get the funds in this case)\n> Hail to the king, nofish, baby !\n\nTHX！I  only setup the site for test. I may try namecoin later.\nWhat do think about my suggestion of decentralized user registration in ZeroTalk using proof of stake? ",
				"added": 1429686723
			}
		],
		"1@115": [
			{
				"comment_id": 33,
				"body": "SO COOL！ THX！",
				"added": 1429454152
			}
		],
		"3@62": [
			{
				"comment_id": 36,
				"body": "> [nofish](#comment_90_2): SSL support is planned, but gevent's (the python library we use for event system) ssl support is broken yet, waiting for fix...\n\nIts latest commit is on Dec 13, 2014! Where is the author? ",
				"added": 1429578218
			}
		],
		"1@131": [
			{
				"comment_id": 39,
				"body": "> [hailtotheking](#comment_2_131): OpenID for Namecoin is available as well.\n\nit costs coin? how much for one OpenID?",
				"added": 1429686856
			},
			{
				"comment_id": 42,
				"body": "> [hailtotheking](#comment_21_131): You need 0,01NMC to register a Namecoin Name (in this case and id/) - thats all :)\n> Renewal fees are not necessary so you can keep your Namecoin identity forever.\n\nto register in Twister costs nothing, but the username can be used only in Twister.",
				"added": 1429712961
			}
		],
		"2@105": [
			{
				"comment_id": 40,
				"body": "nice blog! where are you from? I used to think only eastern people like japanese animation",
				"added": 1429696464
			},
			{
				"comment_id": 41,
				"body": "> [salvotnt](#comment_11_105): thanks , I'm italian . Animation is my passion : )\n\nseems japanese animation spreads all around the world ",
				"added": 1429712681
			}
		],
		"18@2": [
			{
				"comment_id": 43,
				"body": "nice slide! \n1. what happen if a site owner private key is stolen by NSA or sth? can NSA  delete content of the site in all nodes? in other words, does ZN have  versioned backup?\n2. have you seen my suggestion of decentralized user registration in ZeroTalk using proof of stake? any comment?\nhere: \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:2@62/Start+a+new+site+using+Tor+can+you+see+my+site",
				"added": 1430012550
			},
			{
				"comment_id": 45,
				"body": "> [nofish](#comment_99_2): You can create a script easily that backups the data dir every 24 hour, so you can create a new site when its got deleted. In theory - since we use the same cryptography as Bitcoin - it can be possible to use hardware-based signing method (eg. Trezor) which makes this kind of attack impossible.\n\nwe can use some backup tools, of course. but I think a built-in backup feature is great. maybe it should not be called \"backup\", it should be like version control feature. when you go to implement P2P \"github\", please consider it.\nI didn't mean Brute-force attack, I meant other attacks like key logger, malicious software...\n> \n> There is no blockchain involved in zeronet, but every site is independent, so you can create a site that has PoS based. Probably in the next few months there will be a feature (trusted authorization partners) that allows you to use the same identity between sites without contacting the site owner.\n\nregister to trusted authorization partners may not work in China because GFW may block them. built-in cross-site decentralized user registration is far more difficult to block.",
				"added": 1430139911
			},
			{
				"comment_id": 46,
				"body": "> [nofish](#comment_101_2): Decentralized Github requires other features (commit messages, push/pull, merge, and the history has to be also synced) so its totally different. It would be easy to do a backup plugin for zeronet, but it greatly increase the used hdd space, so probably it will not be enabled by default.\n\nI know its different, but the version control feature is common feature of Decentralized Github and Incremental/Differential backup https://en.wikipedia.org/wiki/Backup \nof course, there should be a option of backup, and users can turn it on if needed.\n\n> Brute-force attack is impossible in Bitcoin-type encryption, hardware based signing method is only protect you from key loggers and similar attacks.\n\nSeems you didn't get my point. NSA may NOT use Brute-force attack, it may use  key logger/ malicious software instead. hardware based signing does cost money, right? I don't think many people would pay for it. So a built-in Incremental/Differential backup is the easiest and cheapest way to avoid the single point ( leak of private key) of failure. \n\n> trusted authorization partners = cross-site user auth:\n> \n> You register at trustedzeronetid.bit (using http, namecoin, email, bitmessage or anything it totally up to the site),  \n> The site owner give you a certificate of the registration\n> You visit myblog.bit that trust in certificates provided by trustedzeronetid.bit\n> You post on myblog.bit using the same auth_address you used to register at trustedzeronetid.bit + the certificate of the registration\n\nif trustedzeronetid.bit offers many ways to register, it would be great. but I still believe  decentralized user registration ( maybe PoS )is more difficult to block by Chinese Great Fire Wall.",
				"added": 1430190043
			},
			{
				"comment_id": 48,
				"body": "> [nofish](#comment_103_2): I know what you mean: hardware based signing IS protect you from key loggers. It's an usb device that holds your private key that needed for site modifications and never let your computer to access it.If you want to modify your site you have to send the hash of your content.json to it, push a hardware button on it then it will send back the sign to your computer.So it makes your site impossible to modify without pushing a hardware button on your hardware key.I think its much better solution to protect your site from modifications than re-creating it on different address every week.\n\nI know hardware based signing can protect people  from key loggers. But it DOES cost money and its hard to buy it anonymously. \n\n> If they can block bitmessage then they can block zeronet, so no point to register. \n> I think its poor user experience if you have to wait weeks before you can register on a site. And if we only let 1 stake per ip then it makes staking from Tor network almost impossible.\n\nI think its  poor user experience if you install bitmessage first to register and install ZN to post. its good to have a built-in decentralized user registration.\nWhy you said \"have to wait weeks before you can register on a site\" ? Have you tried Twister? it has built-in decentralized user registration ( PoW ), registration is confirmed by miners in about 5 ~20 minutes. but I think PoW  wastes energy in usage of user registration, so PoS may be an  alternative. ",
				"added": 1430277968
			},
			{
				"comment_id": 49,
				"body": "> [nofish](#comment_106_2): Please describe your idea, how would you use PoS for registration without IP limit and days of waiting.\n\nOh, seems you have not tried Twister, so I have to explain how twister does.\nTwister has blockchain, but NO coins. when a user want to register, (s)he just sends request to miners, NO coin needed, NO PoW for the user. miners do PoW. if a miner mines a block, (s)he writes the user's username and public key into blcokchain, and has the right to send a piece of advertisement to part of Twister users.\nso I think in usage of user registration, PoS may be a replacement of PoW, also NO coins, NO PoS for non-miner users, who don't need to wait weeks for registerration.  You keep most of stakes, and you can give stakes to volunteers who can run a node with a open port for long time. Every PoS forging node keeps its own blacklist of IP for 24hrs to prevent more user registrations from same IP in 24hrs.",
				"added": 1430455461
			},
			{
				"comment_id": 50,
				"body": "> [nofish](#comment_109_2): If no PoW on client side then how does the miners know if its a good user or just a bot that constantly sending the registration requests from different IP addresses (eg. using tor)?\n\nIn Twister, we have seen bots sending registration requests, but single block's size is limited, so bad registration speed is limited. bad registration is not a big problem because twister is a microblog,  in which people don't follow bad usernames. ( what about a P2P G+ or facebook in ZeroNet? user complain twister's lack of image support and  limit of post size )\nAs said in my last post, every PoS forging node keeps its own blacklist of IP for 24hrs to prevent more user registrations from same IP in 24hrs. blacklist exchange between forging nodes may  be good. of course, this can't prevent all bad registrations, but I think if a bot that constantly sending the registration requests from different IP addresses to ZeroTalk, you can't prevent all bad registrations either.",
				"added": 1430526612
			}
		],
		"1@141": [
			{
				"comment_id": 47,
				"body": "浏览速度快，使用体验好，跨平台，不依赖java",
				"added": 1430276438
			},
			{
				"comment_id": 56,
				"body": "> [xiaolan](#comment_1_203): 不依赖Java是比较大的亮点..I2P貌似有些类似于这个,但是万恶的Java!\n\ni2pd是个I2P的C++语言实现，不知道现在怎样了，我前段时间看时还不够完善",
				"added": 1434073601
			}
		],
		"3@2": [
			{
				"comment_id": 51,
				"body": "> [nofish](#comment_110_2): The current authentication is similar to BitID customized for ZeroNet.\n\nyes, similar. BitID works well on centralized sites, but ZeroNet sites are decentralized. although trusted authorization partners feature is planed, IMO it is not an ideal way. I've described a PoS decentralized user registration here:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:18@2/Presentation+about+how+ZeroNet+works",
				"added": 1430785764
			},
			{
				"comment_id": 52,
				"body": "what about a decentralized G+ or facebook in ZeroNet?",
				"added": 1430785803
			},
			{
				"comment_id": 53,
				"body": "> [nofish](#comment_111_2): In ZeroNet every user holds every data, so its not ideal for big sites (yet).\n\nis it possible that ZeroNet only download data of people who we follow? decentralized G+ may be easier to implement than FB because most post are public in G+.\n\n> Its really hard to fight spam in a fully decentralized registration. Using your PoS with 100 nodes with 24h IP ban a bot could create 100 fake account per day using one IP. And if we limit user account creation to IP then probably it makes impossible to register an account using Tor.\n> Using authentication sites there is many possible solutions to control registrations (Proof of burn, Proof of bitcoin stake, Invite only, Namecoin IDs, Bitmessage, Email verification, Social media login, Captcha etc.) and i don't see too much drawbacks of it.\n\n IP blacklist may be exchanged between forge nodes, so I think we can prevent more fake account registrations from same IP. if  IP ban expires after 24h, its possible to  register an account using Tor. \nOK, you can implement trusted authorization partners first. if users feedback is not that good or trusted authorization partners are blocked in China, and then you can consider decentralized user registration.\n",
				"added": 1430871491
			}
		],
		"1@185": [
			{
				"comment_id": 54,
				"body": "To use ZeroNet over Tor network start it with \nzeronet.py --proxy 127.0.0.1:9050 --disable_udp",
				"added": 1432732090
			}
		],
		"1@203": [
			{
				"comment_id": 55,
				"body": "> [xiaolan](#comment_3_203): 更正下端口是:43110\n\n可以访问。你可以编辑帖子。鼠标经过帖子的时候有个铅笔的图标会出现，点击它就能编辑了",
				"added": 1434073460
			},
			{
				"comment_id": 57,
				"body": "> [gchodo](#comment_1_205): ZeroSite的安全性如何？ 服务器放在天朝会不会被查水表？\n\nP2P的不需要服务器，只要有节点帮你做种就行。如果你想发敏感的东西，要戴Tor用ZeroNet:\nzeronet.py --proxy 127.0.0.1:9050 --disable_udp\n先让一个有公网IP的人访问你的站地址（暂时打不开也没关系），然后你戴Tor用ZeroNet发布站点，这样他就能帮你做种，其他人就能打开了。\n以后可以搞个公共的节点，让这个节点自动访问你想让它访问的ZeroNet地址（戴Tor后通过http get/post请求告知公共节点你的站地址），然后你戴Tor用ZeroNet发布站点，公共节点就帮你做种了",
				"added": 1434107328
			}
		],
		"4@62": [
			{
				"comment_id": 58,
				"body": "> [oracle](#comment_2_212): You could call it Tweeter, the decentralized version of Twitter\n\nwe've had twister, a p2p Twitter.\nwhat we lack is p2p G+( no limit for words' length and ability to post pictures )",
				"added": 1434540969
			}
		],
		"1@250": [
			{
				"comment_id": 61,
				"body": "u can use zeronet over Tor\nHow to use ZeroNet with Tor?\nYou have to install Tor then start ZeroNet using zeronet.py --proxy 127.0.0.1:9050 --disable_udp command.\nmore FAQ see: http://zeronet.readthedocs.org/en/latest/faq/",
				"added": 1436163991
			}
		],
		"1@274": [
			{
				"comment_id": 62,
				"body": "> [S466531257BOSS](#comment_7_272): FULLY AGREE TO THAT ( but not just to project anger on the project )\n> \n> It seems pttrsmrt and brunoloff are aware of handling python at least in simple USER-TERMS ;\n> \n> I AM NOT : I HATE IT !\n> What that means: It would be wonderful to have ( at least the proposed ) alternative of handling stuff in WEB-TEQ like JS ;: Any considerations about that ?: Are there any efforts of others that try to handle ZeroNet in ANYTHING ELSE THAN PYTHON ?\n> :)\n> THANKS FOR YOUR INTEREST .\n> S466531257 BOSS - PAETH CLAUDIUSRAPHAEL\n> P.S.: It's not that i just hate Python , i hate it to the bottom of my heart, it eats my soul and it mangles my brain ;: On the other hand:  It was used by you and yours to GLUE the needed stuff to fulfill the task of having all this actually happen ; Damn it !\n> :)\n\nwhy u hate python?\nit just works, and zeronet does not slow down ur machine.\ndo u know twister ( a P2P microblog platform which is written by C++)? it works, but may crashes when u run it for some days. this bug exits very long, but developers fail to fix it. what makes things more painful is porting it to other platform ( windows/mac/ios/android ). users complain that all the time.\nbut zeronet works just stable (seems never crashes when running for long time) and is able to run cross-platform.",
				"added": 1436496137
			}
		]
	},
	"comment_votes": {
		"2@131": 1,
		"116@2": 1
	}
}