{
	"post": [
		{
			"name": "No name",
			"body": ">>bbf9tXu3\nI'm not sure if you can revoke certificates at all, I don't think so. \nIt's not documented in the ZeroNet documentation [1]\n\n[1]: http://127.0.0.1:43110/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe",
			"time": 1468856141800,
			"hash": "ClRtFjQCoNa6JLC6JJY2qyOtF6LLm1TftL+PnZ1fzTc="
		},
		{
			"name": "No name",
			"body": ">>2Qlm+NnE\n\nZeroID is operated by the main developer of ZeroNet, @nofish. \nAnd ZeroVerse is ran by someone else, which provides a similar service, but exclusively using BitMessage\n\nEvery site can choose which certificates they accept, like this for the official ZeroBlog [a]:\n\n \"user_contents\": {\n  \"cert_signers\": {\n   \"zeroid.bit\": [ \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" ]\n  },\n\nSo if you have a user certificate signed by \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" or ZeroID\nyou can add user data like a comment or vote on that website.\n\nAnd this Nanasi text board accepts users from ZeroID, and a self-signed certificate [b]. \nAnd the part that defines which certificates are allowed to be signed by, looks like this:\n\n \"user_contents\": {\n  \"cert_signers\": {\n   \"nanasi\": [ \"16PmAP6z2MCJX9jNjvMrteMfnqX4KeDRNT\" ],\n   \"zeroid.bit\": [ \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" ]\n  },\n\nSo Nanasi text board accepts users with a ZeroID-signed certificate and Nanasi-signed (self-signed) certificate.\n\n[a]: This is from [ZERONET]/data/1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8/data/users/content.json\n[b]: The private key to sign your user certificate is embedded into the application, \nso people can sign their own certificates without requiring a central certificate authority.\n",
			"time": 1468858137700,
			"hash": "56c4Fg+YfOsTV4waoGCxdaYQDDOEoBOCsle0updRd3s="
		},
		{
			"name": "No name",
			"body": "ZeroVerse is an alternative to ZeroID.\n\nBut it doesn't use a web server like ZeroID but you must send a BitMessage with ZeroVerse (ZeroID added support for BitMessage as well).\n\nThe keys posted here are public keys, Nanasi's private key\ncan be considered public because it is embedded into the application.",
			"time": 1468859210500,
			"hash": "D9zE98Zw8sWKpbQJTBMLeW9ft6Hk1m/HpjKSaER4cms="
		},
		{
			"name": "No name",
			"body": "But ZeroVerse is centralized as well, there's a central party that signs your certificate.\n",
			"time": 1468859352000,
			"hash": "MZSVXLGniRURNdXYLKr1OKSTDgf3eD/hxNNxf+SYsc8="
		},
		{
			"name": "No name",
			"body": ">>6u2X0X9H\nA central certificate authority can rate-limit, deny signing a certificate.\nBesides that, nothing.",
			"time": 1468863564400,
			"hash": "9fK6DKG8LHm3WpXn4X7cj6gRoLZeq9oBPoqvBWdOP58="
		},
		{
			"name": "No name",
			"body": ">>9fK6DKG8\nRate-limit the amount of certificates it signs...",
			"time": 1468863611400,
			"hash": "pB9UdZlNtufh/6oLLoFprtI+bB/MiA73SLMHxATT6zs="
		},
		{
			"name": "No name",
			"body": "But I think rate-limiting can and should be done at the site or peer level.\nBecause if someone already has 100 ZeroID-signed certificates and the site accepts \nZeroID-signed certificates a site quickly can be spammed and the ZeroID certificate authority can't do anything to stop it.",
			"time": 1468863824200,
			"hash": "5rO+Xm7/WlzZZjIyx3Otl7zLRMHZhmwwZ18Y+2s55gg="
		},
		{
			"name": "No name",
			"body": ">>WbTGIJwE\nI'm thinking of creating a site where you can sign your own certificates.\nAnd add some explanation on how to accept those certificates in your site. Plus a tutorial on how to create your own self-signed certificate \"authority\".\n\nNow because almost all sites accept ZeroID and you can't really switch ZeroIDs easily, you can easily be tracked on ZeroNet, and thus be pretty quickly deanonymized.",
			"time": 1468864274300,
			"hash": "SsjY3NkSCBQByE7g7N/cm/LPul500rHP5igfHlYQ8hs="
		},
		{
			"name": "No name",
			"body": "Its not about the username exhaustion, but that you can spam a site with multiple users.",
			"time": 1468866060100,
			"hash": "hueYNUGds/GRIBdOSUc87o+c7Yyuz9O4Z38/u2ej3Nk="
		},
		{
			"name": "No name",
			"body": "Every site has a size limit for each user, so you could quite easily with 10 or more ZeroID user certs clutter / spam a site.",
			"time": 1468866112100,
			"hash": "FqvHKj7q1Qt2KsSQT/pwFJx1BUQFK5WTmfsFLhES7ig="
		},
		{
			"name": "No name",
			"body": ">>N4JkuCHe\nYeah, that's what I meant, centralized certificate authorities are not solving that problem, no.",
			"time": 1468878374900,
			"hash": "NFgjcfiyuzOYjbA4EWWFPoqdCc9vnGzHJLk2Cx6qWtM="
		},
		{
			"name": "Yes, totally possible",
			"body": "",
			"time": 1469628220800,
			"hash": "ppsYiovp0W3TwOemnCtTu954opAOf8VmIwJZ/PFQ7oA="
		}
	]
}