{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "bit.no is always great for testing if your content reached the no-tor part of the network",
			"post_id": 26,
			"date_added": 1458037782
		},
		{
			"comment_id": 2,
			"body": "> 3-letter organizations infiltrating ZeroNet\n\nFSF is comming…\n\n---\n\nNSA is just looking for some good porn",
			"post_id": 32,
			"date_added": 1458166470
		},
		{
			"comment_id": 3,
			"body": "> If anything, they'd be more worried about the various meshnets popping up, since those have been used to get around government surveillance and censorship.\n\nSpeaking of this, I should definitely try to join FreiFunk now that I have tor running.\n\nThere seem to be already 2 in my dorm, so …",
			"post_id": 32,
			"date_added": 1458202367
		},
		{
			"comment_id": 4,
			"body": "@musickiller: Well I know one thing from diaspora*, as an ‘oldtimer’ you are more likely to overlook new features, since you already have your established workflow. (even there I feel pretty new, it's running since '10 and I'm there since '11)",
			"post_id": 34,
			"date_added": 1458315710
		},
		{
			"comment_id": 5,
			"body": "The version system is confusing. People who use 3.5 get told, they use an outdated version, despite that's actually the last stable release",
			"post_id": 47,
			"date_added": 1458814212
		},
		{
			"comment_id": 6,
			"body": "The chat has a visitor counter, it’s probably the seeds",
			"post_id": 48,
			"date_added": 1458822322
		},
		{
			"comment_id": 7,
			"body": "> [p2p](#comment_2_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): last stable release should be 3.63.5 is really outdated.\n\nhttps://github.com/HelloZeroNet/ZeroNet/releases\n\n3.6 is in development",
			"post_id": 47,
			"date_added": 1458822864
		},
		{
			"comment_id": 8,
			"body": "oh, then he is about to develop 3.7 now?",
			"post_id": 47,
			"date_added": 1458823678
		},
		{
			"comment_id": 9,
			"body": "*Best way* is to clone the git repo, you can then use `git stash` easy backup and merging. Which falls back to manual merging if merging errors occure.",
			"post_id": 4,
			"date_added": 1459792770
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}