{
	"next_comment_id": 11,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [eventi](#comment_1_1DcDDitsjFJohvwonPmpibRChmA7uGxqL7): Anxious to see what you write here, Ekaterina - your work here is great\n\nThanks! :)\n\n> [zozon](#comment_1_1QBLGLcgKfcpfLmiDYuDzUKVXFfmTAew55): change country?\n\nYou're joking but yeah maybe at some point that will really be the case. But which country is there really that doesn't have problems? And running away is probably not a good solution :) Maybe this new age of decentralized networks will bring us to a point where we can all discuss and share ideas freely, without fear, without censorship, and hopefully make the world a better place by doing so. There will be bad ideas shared and we will discuss those and decide they are bad. There will be good ideas shared and we will discuss those and decide they are good.",
			"post_id": 2,
			"date_added": 1458562164
		},
		{
			"comment_id": 2,
			"body": "> [nippletwister](#comment_1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Decentralized networks, I believe we have many of them already. What about any working decentralized reputation system?\n> Personally I am waiting for new decentralized reputation systems to emerge. Because I think that decentralized reputation + self-budgeting and self-governance system (like DASH's DGBB, see http://dashvotetracker.com/) = new powerful economy.\n\nYeah  there is a lot of interesting stuff coming, DAOs and the like, democratic, decentralized companies/foundations. Reputation systems on the other hand I don't know if they are such a good idea. Scammers on ebay use to sell cheap, high quality goods for a year to get a perfect reputation after thousands of sales. Then they start the scam. And if you look at celebrities, very popular but not always the most shining example of mankind... Well, popular doesn't always mean something (or someone) is good :)",
			"post_id": 2,
			"date_added": 1458562448
		},
		{
			"comment_id": 3,
			"body": "> [villoldo](#comment_1_16nZf7G4qaYRtFpHM9MM1A32nV5oqU9TW1): Some details remind me of Wuala a swiss company that built a decentralized storage just in the way you described SAFE. But it was sold to LaCie and all interesting features were killed. Could that happen to SAFE as well?\n\nI remember that! Because I read about all those cool features but when I checked it out there were none of those features :)\n\nI don't think it can happen to SAFE, because unlike WUALA it is open source. https://github.com/maidsafe\n\nAlthough if it were to happen right now, who knows if there would be enough developers with the necessary know how willing to continue the development. I think it would die off if that were to happen. If it happened in a year or two someone would probably save it (pun intended).",
			"post_id": 3,
			"date_added": 1458566776
		},
		{
			"comment_id": 4,
			"body": "> [tylerabeojordan](#comment_1_1FbKLRSWXXZe7Jz7JbPzwdpCFRrMY2LLqn): Nice article.  One point of clarification: \"There are always 4 copies of a file in existance on the network\"  --> four is a minimum I think - depending on the popularity of the file. Still overall this leads to a massive amount of de-duplication of data that hypothetically may lead to a much lower cost of cloud storage.\n> A link to this article has also been posted on the safenet forum here:\n> https://forum.safenetwork.io/t/maidsafes-safe-network-vs-zeronet-fight/8068\n> Thanks :-)\n\nThanks! I don't have an account on the SAFE forums yet, but I'll keep an eye on the replies and add corrections and clarifications to my blog post if something comes up. Glad people seem to have liked it over there too :)\n\nThe 4 copies of a file number I have heard either on the SafeCrossroads podcast (I think it was in the episode where John Ferguson is a guest on The Crypto Show: https://soundcloud.com/heryptohow/john-ferguson-safe-xroads-and-vit-jedlika-president-of-liberland) or The Daily Decrypt interview.\n\nI'll try to find more info to see if it is a minimum and add that to the blog. Makes sense it would be more copies for more popular files, would make it faster too.",
			"post_id": 3,
			"date_added": 1458682662
		},
		{
			"comment_id": 5,
			"body": "> [erkan](#comment_1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): It's April 1, could it be a joke?\n\nI don't think any company would joke about that, it would also make their warrant canary useless, in a \"the boy who cried wolf\" sense. But thanks for reminding me, have to be careful today! :)",
			"post_id": 4,
			"date_added": 1459505950
		},
		{
			"comment_id": 6,
			"body": "> [nofish](#comment_1_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): it was only a draft and it's already revoked. http://444.hu/2016/04/01/megse-zar-bortonbe-a-kormany-ha-titkosito-appot-hasznalsz (hungarian)\n\nDid they only revoke the part about putting in jail people who use encryption software or also the part about wanting to add backdoors to encryption software? Because the article I linked says they still want to add backdoors and while the Google Translation of the article you linked is barely readable it sounds like it says the same thing.\n\nAnd that is the real problem here, if they go after you. If they go after users that is a big problem for people who live in Hungary, which is bad enough, but if they go after you it's a big problem for everyone no matter where they live, and of course especially for you. But this is of course all still theoretical, ZeroNet is most likely too small a target, they would mostly want to go after instant messagers with millions of users I imagine.",
			"post_id": 5,
			"date_added": 1460139945
		},
		{
			"comment_id": 7,
			"body": "> [nofish](#comment_2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): It's not clear, most of things are speculation. I'm pretty sure the author of it does not know anything about it security and probably its just a distraction from other government actions.\n\nThanks for explaining, hopefully this is something that will never happen. But it's frightening. At least in England and the US politicians are also playing around with the idea of outlawing encryption.\n\nIn the US I don't think they would get away with it, too many companies behind encryption and the US has legal bribery (lobbying) after all so it will always act in companies' best interest.",
			"post_id": 5,
			"date_added": 1460140894
		},
		{
			"comment_id": 8,
			"body": "> [bukaking](#comment_3_17n5jg4bBEoWodXDf8L4Y2u88ShagS272Y)\n\nSometimes secret, sometimes open. This is the top news on Reddit right now, [U.S. Senate Bill Seeks To Ban Encryption](https://www.reddit.com/r/technology/comments/4dx1pk/us_senate_bill_seeks_to_ban_effective_encryption/). What a day.",
			"post_id": 5,
			"date_added": 1460149700
		},
		{
			"comment_id": 9,
			"body": "> [erkan](#comment_2_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Yes, it would be ideal (e.g. we would not lose version history).But in case worst happens, we can restore them also from ourselves, from our HDs.\n\nRight, since ZeroNet is written in Python all of the source code should be in the download. And yeah IPFS and SAFE would help with making it really impossible to delete. One also needs to make sure all the accompanying information is saved, that is usually what gets lost. ZeroNet's docs are already on ZeroNet [here](/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/), but Github's issue tracker for example isn't backed up and those bug reports and feature requests and todo lists / road maps are probably the most important part right after the source code, it wouldn't be devastating to loose all that but it would be extremely helpful if it wasn't lost.\n\nOne Hacker News comment I read a few days ago mentioned a version control system I never heard of before, Fossil, apparently created by the people who also created SQLite. The big difference to Git is that it downloads all branches AND also the isssues and the wiki. I've been playing around with it and it seems to be really neat, seems to be better than Git in a lot of ways, might start using that for my own projects, then nothing is ever lost, the whole project is decentralized not just the source as it is the case with Git.\n\nAlthough really cool would be a system that integrates with ZeroNet and hosts the wiki and issues on ZeroNet. Maybe that can be added to Git or Fossil via post commit hooks or something like that. And of course, which is a shame, since nobody ever heard of Fossil, using it means nobody would ever clone the repository so it becomes useless. Still interesting though and an inspiration to create better, more decentralized tools not just for our communication but also for our development.",
			"post_id": 5,
			"date_added": 1460189509
		},
		{
			"comment_id": 10,
			"body": "> [erkan](#comment_3_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Fossil seems nice. Would be great to hear how much storage it takes for a lots-of-commits project?\n\nFossil itself is a good project to try out, that's what I did. It's stats are here: https://www.fossil-scm.org/fossil/stat\n\nSize: 52.5MB\nCommits: 9398\nIssues: 1089\nFiles: 945\nWiki pages: 27\n\nWas a really quick download, took only seconds. It's not like git where you have thousands of small files, it's all in one big SQL database.",
			"post_id": 5,
			"date_added": 1460202930
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}