{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "Никому не доверять, жить там, где все тебе - враги, а человек человеку - волк...\n\nЧеловек, с жизненным кредо \"никому нельзя доверять\" не одинок, таким единственным и неповторимым можно быть только в соответствующем обществе предателей. Всегда найдётся второй. \n\nНельзя считать, что все вокруг предатели - тогда возникает закономерный вопрос: <А откуда взялся ты?>, ведь если все предатели, без исключения - ты тоже предатель, но таковым себя считать не будешь... Ведь мысль \"никому нельзя доверять\" - это мысль о своём превосходстве, раскусил, что вокруг предатели, познал истину, видишь всех насквозь - этим можно гордиться. Или нет? \n\nЧему тут гордиться, если человек собрал вокруг себя безответственных и простых людей, в обществе которых \"доверие\" - это детские сказки и вымысел?",
			"post_id": 7,
			"date_added": 1527696305
		},
		{
			"comment_id": 2,
			"body": "> [deepstrelok](#comment_12_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Да в статье есть некоторое преувеличение, однако по опыту и не только моему стоит придерживаться  дистанции в  разглашении опасной для тебя информации в чужие руки. \n\nВот из-за этого преувеличения и финала сложилось впечатление, что речь идёт о какой-то абсолютной истине, которая не допускает существования доверия. Я понимаю, что некоторой информации место только у себя в голове, но мир без тех, с кем можно поделиться почти всем - гнетущий мир.\n\n> Ты все еще доверяешь кому-либо? В этой мире доверие - это слишком хорошо, чтобы быть правдой.\n\nP.S. Писал про \"человека\" в общем, я же не могу знать, что всё здесь написанное - истина и касается лично автора текста, не принимайте на свой счёт.\nПо своему опыту знаю, что собрать круг людей, которым ты можешь доверять практически безоговорочно - реально, в том числе собрать и такой круг людей, в котором ни один человек не будет \"читаться\" насквозь. Немного обидно стало за \"Ты сможешь менять маски легко и просто. Видеть людей насквозь.\", ведь много очень сложных людей ходят по планете, которых мало того, что понять затруднительно, к ним даже подступиться - большая проблема.",
			"post_id": 7,
			"date_added": 1527867845
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}