{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"36_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 1,
				"body": "Yo estoy ejecutando un proxy sobre una máquina Debian y navegando desde una Windows 10",
				"added": 1555151580
			}
		],
		"1_1PDryjn9XzJ6pR6M98ST8EvdYheXV8gAQS": [
			{
				"comment_id": 2,
				"body": "Me estás comentando que literalmente estás intentando vendernos un esquema ponzi sin siquiera intentar ocultarlo o maquillarlo?\n\nSi es que me cago en la puta, qué bajo hemos caído...",
				"added": 1609090929
			}
		],
		"1_1BKJ69CmzwqdJ4WCD6rMZeoeM55Xbth2XZ": [
			{
				"comment_id": 3,
				"body": "> [wsnlndr](#comment_4_19y8t7RztB4Tgm1P1E1ezDrACMEfa9hacS): ¿Alguien conoce algún algoritmo que evite o bloquee preguntas estúpidas?\n\nSi se pudiese detectar la estupidez por algorimo, qué mundo más bello sería este",
				"added": 1609091453
			}
		],
		"1_1KEsCNSboxPFpP73TVu6XtpFLYv86jnQFj": [
			{
				"comment_id": 4,
				"body": "Con mentos y una cocacola.",
				"added": 1609091545
			}
		],
		"1_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 5,
				"body": "Menuda gilipollez",
				"added": 1609091761
			}
		],
		"2_1BnR6LVLQ7t1hAv4ubZFdtWJmhKgWFFTy4": [
			{
				"comment_id": 6,
				"body": "> [londot](#comment_1_1L4wXoWHX1YJSqFB7Hj2j3SUQHrndpJ4EC): Concuerdo al 100% contigo.Creo que todos debemos de realizar cierta investigación sobre esta \"PANDEMIA\". He hablado, con varias personas que han tenido el COVID, les he preguntado.¿Que medicamentos te han dado?Muchos dicen, \"ninguno solo me controlan y realizan mínimos controles de respiración.\"Algunos me han comentado que les dan medicamentos, los típicos para un resfriado comunes.\n\nqué medicamento quieres que te den para una enfermedad nueva? qué medicamento quieres que te den para una enfermedad viral?",
				"added": 1609091910
			},
			{
				"comment_id": 7,
				"body": "> cuanto podían controlar a la población\n\nQuién?\n\n> Por otro lado creo que esta pandemia fue inventada por el humano para que las droguerías y farmacéuticas hagan dinero especulando con la salud\n\nEs una opinión, sin embargo, una opinión errada. De todas formas, se puede ir viendo que de esa opinión hay una clara necesidad por un sistema farmacológico público y antiespeculativo",
				"added": 1609092042
			}
		]
	},
	"comment_vote": {
		"1_19yGjJuztHvDMQprqT7cxPjzbjfthnf3nQ": 1,
		"4_12YzecmCkUZujXT2NVvQiZQiVhMfSsox1J": 1,
		"5_1Mh8SXmJGSQtYUXbtjUVL7SaXB6bdy5RzV": 1
	}
}