{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": [
			{
				"comment_id": 1,
				"body": "> [selfsigned](#comment_20_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): Para un resumen no está mal.Creo que te centras demasiado en el problema y poco en lo que puedes hacer tú por cambiarlo. \n> En lo que más razón te puedo dar, es que el sistema de votar a un partido que luego hace y deshace me parece el sistema más absurdo y de gilipollas jamás creado. Un sistema de votación mucho más granular sería mejor, por no hablar de sanciones o penas de cárcel a quien prometa el oro y el moro y luego sólo te cague en la cara.\n> El problema de este puto páis es que mentir no está mal, el alcohol no es una droga, y dejarte convencer por cualquier gilipollas que te hable es ser ciudadano y sociable. Si a todos estos que prometen mierda les escupieran sus propios votantes en la cara otro gallo cantaría. El problema auténtico es que españa está llena de subnormales y como supongo te figuras, hacen falta muy pocos lobos para controlar cientos de ovejas.\n> A la gente de este país le faltan huevos para pensar, porque eso cansa mucho, y oye, ya tienen bastante con trabajar como putos animales para no tener ni un euro en el banco a fin de mes. Si eso no les hace pensar, nada puede.\n> Por mí sinceramente que les jodan a todos los anormales de este país.\n> No es que me dé vergüenza ser Español, es que hay días que siento vergüenza de considerarme un ser Humano inteligente, así que te puedes imaginar lo que pienso del resto.\n> La felicidad tiene que venir de tí mismo, así como el cambio, si tanto lo necesitas.\n> PD: Entre todo estoy la crudeza de mi lenguaje, también siento admiración en el mismo grado de intensidad por gente que ha sacrificado su tiempo, su carrera e incluso su propia vida por defender cosas que vale la pena defender, porque quien ama, odia, y viceversa.\n> Suerte!\n\nAcertado!",
				"added": 1606862884
			}
		],
		"1_1PD6ADNcGcQkAvVL9dcZVUTMwWSLmDFGmc": [
			{
				"comment_id": 2,
				"body": "Arch y sus hijas, para jugar la competencia.",
				"added": 1609032441
			}
		],
		"1_1KEsCNSboxPFpP73TVu6XtpFLYv86jnQFj": [
			{
				"comment_id": 3,
				"body": "@flasht, mis bombas caseras son los peos que me tiro al lado de mi mujer mientras vemos una pelicula, los que no hacen ruido son los mas letales. xD\n\nDesde luego, tu pregunta es graciosa e ingenua.",
				"added": 1609032918
			}
		],
		"1_1BKJ69CmzwqdJ4WCD6rMZeoeM55Xbth2XZ": [
			{
				"comment_id": 4,
				"body": "¿Alguien conoce algún algoritmo que evite o bloquee preguntas estúpidas?",
				"added": 1609033093
			}
		],
		"1_1PDryjn9XzJ6pR6M98ST8EvdYheXV8gAQS": [
			{
				"comment_id": 5,
				"body": "LOL ?",
				"added": 1609033166
			}
		],
		"1_1HMq3qhhtVm5pigSGNppCDxhSxmsjpg1EK": [
			{
				"comment_id": 6,
				"body": "esta six, esta nox, exta me guxta me la....",
				"added": 1609033234
			}
		]
	},
	"comment_vote": {}
}