{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565877012_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1565912574_1BGMdmnUwq2Bz94TfyZLwHTGTA5kprbsvg": 1,
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1565877012_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "No. Zeronet and other \"dark web\" services are the equivalent of international waters for information. The reason we are here in the first place is because of the discrepancy between what users believe their rights are and the rights provided by governments. There are obvious examples where users are violating another human's rights, but the line is mercurial. It is more important that the people who have their rights violated by a government see freedom here than the service becomes legitimate in the eyes of anyone, including the government or the majority.\n\nFurthermore, governments are inherently unjust. They by definition need to make compromises to facilitate their citizens. A common unjustice comes when a minority of citizens have their rights violated by a compromise that panders to the majority. Additionally, the people with more money and power have their needs met by governments disproportionately to those without power. In this way, freedom of speech, which is a basic human right, can be limited by compromises pandering to both majorities and the rich. This place prevents those human rights from being violated.",
				"added": 1565900676
			}
		],
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 2,
				"body": "\"Virgin and serene\" women are a male fantasy, and have never been a reality. Women will do what they can get away with, and always have. The modern age has not corrupted women, it has exposed who they have been the whole time.\n\nThat said, I don't understand why there is an age limit on sex with sexually mature people. I think CP is gross, but a 13 year old female is historically ready to be a mother. The modern age exclusively has made this a taboo subject, and I have never heard a logical argument for it, just various types of shaming.\n\nLastly, I have become convinced that marriage is only suitable for strong families and communities. It isn't a good practice for the west now because people are too individualistic, mercenary, and untrusting. To have a successful marriage, the couple need to be committed to the marriage and have everyone around them pushing them towards healthy decisions. Without that, it ends up being the man trying to keep the marriage together, which looks and sounds like the man being a tyrant versus the woman seeking freedom (regardless of whether staying married is the best decision for the woman).\n\nReally, the only way to have a successful marriage as a western man is to live most of your life in the same community, and make sure the woman has a strong family who are also ingrained in the community.",
				"added": 1565978668
			}
		],
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 3,
				"body": "ECB has been massively debasing the euro to stop deflation. In order to go into negative interest rates (where the bank pays you for borrowing), they have to stop capital from leaving the banking system. That's the cause for their tightening of the various kinds of anonymous liquid value transfer mechanisms.\n\nIts extremely retarded and is going to backfire bigtime. Get in on cryptocurrency now -- buy Monero. People will find a way of getting their wealth out of that bullshit system and crypto is the best replacement for a bank account's services.",
				"added": 1566170421
			}
		]
	},
	"comment_vote": {
		"51_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1
	}
}