{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "KopyKate - YouTube alternative for ZeroNet",
			"body": "&nbsp;\n## view on ZeroNet!\nhttp://127.0.0.1:43110/kopykate.bit\n&nbsp;\n## Change Log:\n## v1.3.24\n> - Improved player CSS.\n> - Changed admin e-mail.\n> - Added option to either upload instant webseed or upload torrent.\n> - (NEW - Katy-Torrent WebTorrent client under development. See below!)\n&nbsp;\n## Introduction:\nKopyKate is a ZeroNet site; it is an alternative to YouTube, but instead of hosting videos on webservers, it uses decentralized databases in order to store magnet links for videos, and then uses WebTorrent in order to stream them. Note that WebTorrent (WebRTC) and BitTorrent use two different protocols, and the videos can only be seeded by clients made specifically for WebTorrent (e.g. WebTorrent Desktop). Users also have the option to upload webseeds to a CORS-enabled webserver. This allows torrents to temporarily use a backup file from an HTTP server, until enough peers are available!\n&nbsp;\n## view on GitHub!\nhttps://github.com/kopy-kate/kopy-kate\n## NEW - KatyTorrent WebTorrent client\nhttps://github.com/kopy-kate/katy-torrent\n&nbsp;\n## Use these links to view outside of ZeroNet!\nhttp://www.kittyseedbox.tk:43110/kopykate.bit\nhttps://fuckcf.cf/kopykate.bit\n&nbsp;\n## If you want to get your video featured (USD $5 a month via Bitcoin)\nContact on ZeroNet: @ realkittykate\nContact on e-mail: kopykate@protonmail.com",
			"added": 1507676271
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_17H8EGEoNF1z2AXFtXmBQJLHTmh7gMGzzS": [
			{
				"comment_id": 1,
				"body": "> [mari0](#comment_1_1BMjn5jgrLrGbQTbnZDLFKUuxP2ZBr4ufC): Wouldn't KopyKate be better off using new big files feature in ZeroNet?\n\nI have yet to see an app that can beat WebTorrent. You can even go to Kopykate.ga on any android phone and watch videos on it without having ZeroNet installed.. and videos are seeded as you watch them.\n\nhttps://github.com/MuxZeroNet/ZeroMux\n\nZeroMux also has the same bug as WebTorrent; video streaming doesn't work on Chrome. This bug was fixed on KopyKate by redirecting the user to a torrent player/client outside of ZeroNet, which is basically the same thing as having a third party torrent client.\n\nSo at the moment, I see no benefit in re-writing the code if it's practically gonna work the same way. WebTorrent feels a lot more plug-and-play to me.. and is pretty versatile.",
				"added": 1507854323
			},
			{
				"comment_id": 2,
				"body": "Now that I think about it, the best approach would probably be to have a WebTorrent / ZeroMux hybrid. I just don't like the idea of having my site folder overloaded with bulky .mp4's.. especially on the Proxy.. but then, it could probably serve as a seedbox more than anything.\n\nI'll be sure to experiment with this.",
				"added": 1507856743
			}
		]
	},
	"comment_vote": {}
}