{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1566248008,
			"title": "08chan has performed a code update",
			"body": "We just pushed an update on the master seed that anons from /tech/ had graciously compiled from mcdev's work on Millchan.  If you are a 08chan user, please do the following:\n\n>From ZeroHello, select 08chan's \"dots\" menu and perform \"Check files\" and then \"Update\".  \n>Go to 08chan.  If the page doesn't load correctly after a few minutes open the 0 drag menu in the right corner and select \"rebuild database\" and then \"reload database\" when finished.\n>Shut down ZeroNet, clear your browser cache, restart your browser, and then restart ZeroNet.\n\nThis has fixed any issues that appeared to anons in testing.  In the worst case scenario, do a clean install of ZeroNet and 08chan, but that shouldn't be necessary.  Please report bugs and issues here if you can't access the main site.",
			"added": 1566248007
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 1,
				"body": "Make sure you go to the ZeroHello \"3 dots\" menu for the site and use \"Check Files\" and then \"Update\" before you go to the trouble of deleting.  The site change has to propagate, so it may take several minutes to get it.",
				"added": 1565331016
			},
			{
				"comment_id": 2,
				"body": "I've been tinkering with the site trying to get a fix for all files to show under the new cert.  If it seems to be especially wonky, look for posts my be talking about progress because I might be just fucking with it at the time you're trying to do something.\n\nRight now I've got the announcements fixed and I think I've narrowed down what I need to do.  Now I just have to figure out HOW to do it.  Good night.",
				"added": 1565429324
			},
			{
				"comment_id": 3,
				"body": "Also, from my end the master seed is nearly 16 gigs.  You'll need a lot of space to save everything.",
				"added": 1565429371
			},
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_891_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): maybe soon @08admin: will try to apply this IDEA on how to fix the site. It worked apparently for me and other user. But better to wait for admin than messing with the site maybe. The work around is about marking site as own (on 08chan, corner button dragging to the left and scrolling to the bottom of the menu, clicking \"This is my site\") which should disable updates of the site core files. Then replacing 08chan ...zeronet/data/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/data/users/content.json file contents shown here (you have to first download whole site before you will see that contents, may need to reload page). Then again from the 08chan site clicking button to \"Sign and publish\" changes made in the file). It will fail to publish because file is not authorized, but it should start loading all the 2K users self-signed content. [...]\n\nYou're a damned genius.  I was trying to do it via arguments, I didn't even think of just hard-coding it into the damned content.json file.",
				"added": 1565555986
			},
			{
				"comment_id": 5,
				"body": "> [memesadler](#comment_25_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): imo I would say millchan merger is best for a decentralized 8chan-type thing since it segregates boards for seeding and lets board owners have total control over their boarders. Millchan sounds big and 08chan has been a headache for me too. I haven't been able to post despite doing the id thing and have given up. Merger stuff in general feels like it takes advantage of ZeroNet features more, too.\n\n> [08admin](#comment_4_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): You're a damned genius.  I was trying to do it via arguments, I didn't even think of just hard-coding it into the damned content.json file.\n\nActually there's still a hiccup.  People are still able to post with just a fresh 08chan cert.  I'm working on it now, based on your idea.",
				"added": 1565558347
			},
			{
				"comment_id": 6,
				"body": "We got it fixed a couple hours ago.  Based partly on the idea from this discussion and help from several users.\n\nThank you all, please do a full update and continue posting at your leisure.",
				"added": 1565604416
			}
		],
		"1565661379_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": [
			{
				"comment_id": 7,
				"body": "We're working on it now.  The Millchan developer actually has a Git repository with code for fixing this exact issue and we're trying to figure out how to implement it.\n\nhttps://gitgud.io/millchan/Millchan/commit/27b6f9365e9d2cbaf07b2316c49af757869e68d6",
				"added": 1565690060
			},
			{
				"comment_id": 8,
				"body": "> [pexo](#comment_124_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): It would be a good idea to look at the repo (at a state before the switch to typescript happened, if you're unfamiliar with typescript) and see how the image upload has been done. Don't focus on specific commits, since there were things in that regard that got fixed and added later on, in a nutshell: [...]\n\nSome of our users did a test update of their local clients, and many of them developed errors and massive slowdown.  There's also mistrust of the merger system giving board owners moderation powers.  Our circumstances are rather different than Millchan's proper.",
				"added": 1565743747
			},
			{
				"comment_id": 9,
				"body": "> [pexo](#comment_128_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): The errors are probably due to the hacky way they updated 08chan. There is a massive slowdown on Tor Browser(TBB) due to the lexical parser(does the markup) and a runtime performance penalty for vue(the display library used in millchan and 08chan). The runtime penalty should be the same on 08chan and millchan, with TBB getting worse performance compared to FF(because TBB throttles js and hardware acceleration to obfuscate the kind of hardware your computer has). I dumped a few of my test results on this millchan/dev/ thread if you're interested on more metrics. [...]\n\nThis is useful information, thank you!",
				"added": 1565862275
			},
			{
				"comment_id": 10,
				"body": "> [pexo](#comment_129_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): No worries!I have contributed some code to millchan and thus have a pretty good understanding of how millchan and ZeroNet development in general works. If you have more questions, you can always ask me here or on millchan /dev/ where you can also find mcdev. [...]\n\nSome users are reporting pages freezing when loading with the new client.  Any thoughts on this?",
				"added": 1565920210
			}
		],
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": [
			{
				"comment_id": 11,
				"body": "You're welcome!  This update adds several quality of life features, fixes the TOR image posting bug, fixes a major memory leak and improves posting and upload speeds at the cost of slightly slower page loading.  From the main end it seems to be working just fine, but input from users is critical.  I'm going to let it seed for a few hours and check back.  I opted to do it now since their are few people using the site at this moment.",
				"added": 1566248900
			},
			{
				"comment_id": 12,
				"body": "> [littlepaw](#comment_8_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): That's great news! I hope it'll be a smooth transition to a new version. I personally just get an empty white screen with [Options] and [FAQ] at the top left corner. I rebuilt and reloaded the database, checked the files and updated the site manually, but it does not seem to affect the issue. Is completely deleting and re-downloading the whole site my only option left?\n\nThis actually happened to me as well, at first.  Clear your browser cache, shut down your browser, and restart ZeroNet and wait 10 minutes for it to reload everything.  Then restart ZeroNet and your browser and try.",
				"added": 1566249532
			},
			{
				"comment_id": 13,
				"body": "> [uypchoz2t0chmax9](#comment_1_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): @08admin: can I send you a private message somehow?\n\nI'm going to be gone for a few hours but I have an email at ayanamiashit@cock.li",
				"added": 1566250198
			},
			{
				"comment_id": 14,
				"body": "> [uypchoz2t0chmax9](#comment_2_1FTDaUq9WYodtgWDMPkTUDTd1du3WAW1fW): Btw it doesn't want to work for me either. There are a few files stuck at updating, but otherwise I tried update, check files, database rebuild, reload in various combination, restarting zeronet, trying a different browser, etc, to no avail. If I manually replace js/all.js from a backup, that's the only thing that fixes this thing. Nothing interesting in the debug console either.\n\nBest I can say is patience.  It took a good 20 minutes of loading and fiddling to get it to work for me.  There's also a manual update path you can do from the clearnet site 08ch.net",
				"added": 1566250940
			},
			{
				"comment_id": 15,
				"body": "> [transdude](#comment_1_1G8gsfYACpCg2eXfNb34ZeKMGzvnwSRom8): Both the beta and the update overload my browsers for any thread that's longer than 100 posts. What am I suppose to do?\n\nWhat exactly does it do?  Big threads will take more time to load, but will eventually get there.  With a 3.7ghz processor and 4gbs of RAM I can load that huge thread on /pol/ in about fifteen seconds in Firefox.  You may wish to Pin the board to download all its content and then you're only loading the files locally after the first time.  That will make it easier/faster.",
				"added": 1566278717
			},
			{
				"comment_id": 16,
				"body": "TOR posting is extremely important, considering the need for individual users to protect their privacy in the wake of the zite being targeted.  No matter which way we went there were going to be tradeoffs.  I'm not deaf to the complaints about the current setup (Palemoon lost compatibility, runs very slow on low-spec PCs), but we never anticipated needing to use the site for so long that it would come under spam attack (or what vector such an attack would come by) or that Tor would update their browser in a way that broke the nice, working hack we had built from Millchan code a year ago.",
				"added": 1566530448
			},
			{
				"comment_id": 17,
				"body": "> [totheend](#comment_1_1AY3JJVDvoGg5vyouaucsYFbtbrT2XonMM): Cannot get in.  Have been unable to do so for over a week now.  All I have is a pale blue background, and unresponsive \"Options\" and \"FAQ\" buttons in the top-left.  Stuck updating 728 unresponsive files currently.  Have tried deleting and redownloading the entire zite a couple of times now.\n\nHmm.  You're the first person with this particular problem.  Please make sure the site is whitelisted in any script blockers, ad blockers, and other filtering addons you have.  Also try shutting off ZeroNet, cleaning your entire browser cache, then restart your browser and restart ZeroNet.  Also make sure that your index.html files in the 08chan zite folder are NOT set to \"read only.\"  This sounds like a script or caching issue.",
				"added": 1567134951
			}
		]
	},
	"comment_vote": {}
}