{
	"title": "DeadSea's Blog",
	"description": "[CLICK FILE DOWNLOAD ARCHIVE](../1MyHXb4PMsLCwg99P5DD6WtKVjXeDNu8Ez/)",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 22,
	"demo": false,
	"modified": 1554131191,
	"post": [
		{
			"post_id": 21,
			"title": "Astonishing pedophile crime in Finland revealed",
			"date_published": 1554130479.011
		},
		{
			"post_id": 20,
			"title": "Abe, in congress, says, \"I'm the country.\" Netizens criticized it \"Louis 14\"",
			"date_published": 1551485076.5,
			"body": "Original article: [아베, 의회서 \"내가 국가다\".. 日 네티즌들 \"루이 14세냐\" | Daum 뉴스](https://news.v.daum.net/v/20190302030414917?d=y)\n\nWitten by 정시행 기자 입력 2019.03.02\\. 03:04\n\n(Partial machine-translation)\n\ncontroversy over comments in response to statistical fraud cases\n\nJapanese Prime Minister Shinzo Abe has said in a parliamentary session, \"I am a nation.\",There is criticism that \"I'm the state\" of Louis XIV, the \"Sun King\", who wielded power in the 17th century, the absolute monarchy of France.\n\nAccording to Japanese online media Litera, Abe attended the House of Representatives budget committee on the 28th and responded to the question on the issue of \"labor statistics fraud\".\n\nThe labor statistics fraud is a statistical manipulation scandal in which the Japanese government has reduced the wage of large corporations since 2004 and miscalculated the wage increase rate.,Abe's credibility has been cracked, but no senior official has been responsible, and the ruling Liberal Democratic Party is pushing for Abe's fourth consecutive term.\n\nAkira Nakasuma, a member of the opposition Democratic Party, said, \"It is better not to look at the statistical problem lightly. Do you have any perception that it can be a national crisis by dealing with this problem?\",Abe said, \"I was asked about the national crisis, but I am the nation.\" The audience stirred as which was accepted as \"what kind of national crisis are you talking about even though I am not in a crisis?\"\n\nWhen this video was released, Japanese netizens criticized social media and others as \"disregarding the fact that it is a law-governed state and talking a bullshit,\" \"Abe is a national crisis,\" and \"Abe is Louis XIV in the 21st century.\"\n\nEarlier this month, Abe also said in a parliamentary budget committee on statistical manipulation that he did not read the report of the committee (a special inspection of statistical manipulation), saying, \"The prime minister is in charge of everything of the universe.,I can not afford to read all the reports every day. \" This comment was also criticized \"Is Abe a god?\" and \"Abe turned out to be a minister of the universe\""
		},
		{
			"post_id": 19,
			"title": "torrent magnet: <8mm (1999)>",
			"date_published": 1550378145.2,
			"body": "magnet:?xt=urn:btih:6b8369a6938a4ab3dd01b54643b2999bb662b4bc&dn=8MM+%281999%29+720p+5.1ch+BRRip+AAC+x264+-+%5BGeekRG%5D&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Fzer0day.ch%3A1337&tr=udp%3A%2F%2Fopen.demonii.com%3A1337&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Fexodus.desync.com%3A6969"
		},
		{
			"post_id": 18,
			"title": "Rogue Nodes Turn Tor Anonymizer Into Eavesdropper's Paradise | WIRED",
			"date_published": 1550149926.6,
			"body": "<div class=\"byline-component\">Original article URL: [https://www.wired.com/2007/09/rogue-nodes-turn-tor-anonymizer-into-eavesdroppers-paradise/?currentPage=all](https://www.wired.com/2007/09/rogue-nodes-turn-tor-anonymizer-into-eavesdroppers-paradise/?currentPage=all)</div>\n\n*   <div class=\"byline-component\"><span class=\"visually-hidden\">r</span><span class=\"byline-component__content\" itemprop=\"author\">[Kim Zetter](https://www.wired.com/author/kim-zetter)</span></div>\n\n*   <div class=\"brow-component\"><span class=\"brow-component--security\">[security](https://www.wired.com/category/security/)</span></div>\n\n*   <time class=\"date-mdy\">09.10.07</time>\n\n*   <time class=\"date-gia\">02:00 am</time>\n\n# Rogue Nodes Turn Tor Anonymizer Into Eavesdropper's Paradise\n\n<div>\n\n<span class=\"lede\">A security researcher</span> intercepted thousands of private e-mail messages sent by foreign embassies and human rights groups around the world by turning portions of the Tor internet anonymity service into his own private listening post.\n\nA little over a week ago, Swedish computer security consultant Dan Egerstad [posted the user names and passwords](https://www.wired.com/27bstroke6/2007/08/embassy-e-mail-.html) for 100 e-mail accounts used by the victims, but didn't say how he obtained them. He revealed Friday that he intercepted the information by hosting five Tor exit nodes placed in different locations on the internet as a research project.\n\nTor is a [sophisticated privacy tool](http://tor.eff.org/overview.html.en) designed to prevent tracking of where a web user surfs on the internet and with whom a user communicates. It's endorsed by the Electronic Frontier Foundation and other civil liberties groups as a method for whistleblowers and human-rights workers to communicate with journalists, among other uses.\n\nIt's also used by law enforcement and other government agencies to visit websites anonymously to read content and gather intelligence without exposing their identity to a website owner.\n\nBut Egerstad says that many who use Tor mistakenly believe it is an end-to-end encryption tool. As a result, they aren't taking the precautions they need to take to protect their web activity.\n\nHe believes others are likely exploiting this oversight as well.\n\n\"I am absolutely positive that I am not the only one to figure this out,\" Egerstad says. \"I'm pretty sure there are governments doing the exact same thing. There's probably a reason why people are volunteering to set up a node.\"\n\nVictims of Egerstad's research project included embassies belonging to Australia, Japan, Iran, India and Russia. Egerstad also found accounts belonging to the foreign ministry of Iran, the United Kingdom's visa office in Nepal and the Defence Research and Development Organization in India's Ministry of Defence.\n\nIn addition, Egerstad was able to read correspondence belonging to the Indian ambassador to China, various politicians in Hong Kong, workers in the Dalai Lama's liaison office and several human-rights groups in Hong Kong.\n\nEgerstad says it wasn't just e-mail that was exposed but instant messages passed internally between workers and any other web traffic that crossed the network. Among the data he initially collected was e-mail from an Australian embassy worker with the subject line referring to an \"Australian military plan.\"\n\n\"It kind of shocked me,\" he says.\n\nTor has hundreds of thousands of users around the world, according to its developers. The largest numbers of users are in the United States, the European Union and China.\n\nTor works by using servers donated by volunteers around the world to bounce traffic around en route to its destination. Traffic is encrypted through most of that route, and routed over a random path each time a person uses it.\n\nUnder Tor's architecture, administrators at the entry point can identify the user's IP address, but can't read the content of the user's correspondence or know its final destination. Each node in the network thereafter only knows the node from which it received the traffic, and it peels off a layer of encryption to reveal the next node to which it must forward the connection. (Tor stands for \"The Onion Router.\")\n\nBut Tor has a known weakness: The last node through which traffic passes in the network has to decrypt the communication before delivering it to its final destination. Someone operating that node can see the communication passing through this server.\n\nThe Tor website includes a diagram showing that the last leg of traffic is not encrypted, and also [warns users](http://wiki.noreply.org/noreply/TheOnionRouter/TorFAQ#ExitEavesdroppers) that \"the guy running the exit node can read the bytes that come in and out of there.\" But Egerstad says that most users appear to have missed or ignored this information.\n\nUnless they're surfing to a website protected with SSL encryption, or use encryption software like PGP, all of their e-mail content, instant messages, surfing and other web activity is potentially exposed to any eavesdropper who owns a Tor server. This amounts to a lot of eavesdroppers – the software currently lists about 1,600 nodes in the Tor network.\n\nEgerstad discovered the problem about two months ago when he signed up five servers he owns in Sweden, the United States and Asia to be Tor nodes, and started peeking at the traffic. He was surprised to discover that 95 percent of the traffic that passed through his Tor nodes was not encrypted.\n\nEven more surprising was the number of embassies and other government agencies that were using Tor, and using it incorrectly.\n\nThat prompted Egerstad to narrow his search to e-mail correspondence with a focus on government agencies. He wrote a script to search for .gov domains and keywords such as \"embassy,\" \"war\" and \"military,\" and focused on sniffing port-25 traffic, the port through which e-mail passes.\n\nHe collected between 200 and 250 accounts belonging to embassies and government agencies that were sending passwords and the content of correspondence in the clear. None of them belonged to U.S. embassies or government agencies.\n\nAmong the data he found in the correspondence was a spreadsheet listing passport numbers and personal information about the passport holders, as well as sensitive details about meetings and activities among government officials.\n\nEgerstad contacted one account holder about his vulnerability but was ignored, he says. So on Aug. 30 he posted 100 of the accounts and passwords online to get the word out, but kept largely mum about how he'd obtained the information.\n\nSince posting the data, he says only one victim has contacted him to find out what they were doing wrong and learn how to fix it: Iran. In addition to Iran's Ministry of Foreign Affairs, the country's embassies in Ghana, Kenya, Oman and Tunisia were swept up by Egerstad's experimental surveillance.\n\nShava Nerad, the development director for the nonprofit group that supports Tor, admits the group needs to produce better documentation for users to make the risks of the system clearer. But she adds that people in high-risk environments, such as embassies, should understand those risks already and should be encrypting their communication on their own.\n\n\"If you're in a position like that handling sensitive data and you're working for the government,\" she says, \"it is irresponsible to send that data unencrypted. They should institute practices that educate their users and ensure the privacy of the data by going through encrypted VPNs.\"\n\nEgerstad says he has shut down his Tor nodes.\n\n</div>\n\n<div>Further discussion: [Can you trust Tor’s exit nodes? - ZeroTalk](../1LfvE91ZF18jdG3wW62Dw7NtfTZh737KPL/?Topic:1550135195_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS)\n</div>"
		},
		{
			"post_id": 17,
			"title": "How Mickey Mouse Keeps Changing Copyright Law",
			"date_published": 1550049848.3,
			"body": "<div class=\"herald-breadcrumbs\">Original Source: [https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/)\n</div>\n\n<div id=\"herald-breadcrumbs\" class=\"herald-breadcrumbs\"><span><span><span>**How Mickey Mouse Keeps Changing Copyright Law**</span></span></span></div>\n\n<div class=\"herald-post-thumbnail herald-post-thumbnail-single\">![Mickey-Mouse-896x556.jpg (0x0)](data/img/post_17_Mickey-Mouse-896x556.jpg)\nIs copyright duration in the U.S. due to Mickey Mouse Copyright?</div>\n\n<div class=\"col-lg-12 col-md-12 col-sm-12\"><span class=\"meta-category\">[Intellectual Property](https://alj.artrepreneur.com/category/ip/)</span>\n\n# How Mickey Mouse Keeps Changing Copyright Law\n\n<span class=\"updated\">February 15, 2014</span> <span class=\"vcard author\"><span class=\"fn\">[Steve Schlackman](https://alj.artrepreneur.com/author/steve-schlackman/)</span></span>\n\nWhen the Copyright Act was first enacted in the United States, the copyright duration was only 14 years. Today Copyright duration can last over a century in some cases. Why such a drastic change? Some say it is all due to a cute little mouse named Mickey.\n\nCopyright duration had some changes over the 125-years before Mickey Mouse. In the Copyright Act of 1790, the 14-year term was renewable for one additional 14-year term, if the author was alive at the end of the first 14 years. And it only applied to maps, charts, and books. Registration and use of a copyright notice were also required. If you didn’t meet those requirements, the work immediately entered into the public domain. By 1831 it was changed to 28 years with a 14-year renewal and in 1909, copyright duration became 28 years with a 28-year renewal. Very few works actually maintained those copyright durations as only a small percentage of people even bothered to register copyrights in the first place, and of those that did, only a tiny fraction renewed them.\n\n> <span style=\"font-size: 16px;\">Disney now has until 2023 to figure out how to extend that date once again.</span>\n\nEnter [Steamboat Willy](https://www.imdb.com/title/tt0019422/ \"Steamboat Willie (1928) - IMDb\"), the first Mickey Mouse cartoon and the first animated short by Walt Disney in 1928\\. Under the 1909 Copyright scheme, the Mickey Mouse character had copyright protection for 56 years (with the renewal), expiring in 1984\\. With the impending loss of copyright on it’s mascot, Disney is said to have begun serious lobbying push for changes to the Copyright Act.\n\n![Mickey-Mouse-Curve-1-e1451928012325.png (0x0)](data/img/post_17_Mickey-Mouse-Curve-1-e1451928012325.png)\n\n<span style=\"line-height: 1.5em;\">In 1976, Congress authorized a major overhaul of the copyright system assuring Disney extended protection. Instead of the maximum of 56 years with extensions, individual authors were granted protection for their life plus an additional 50 years, (which was the norm in Europe). For works authored by corporations, the 1976 legislation also granted a retroactive extension for works published before the new system took effect. The maximum term for already-published works was lengthened from 56 years to 75 years pushing Mickey protection out to 2003\\. Anything published in 1922 or before was in the public domain. Anything after that may still be under copyright.</span>\n\n<span style=\"line-height: 1.5em;\">With only 5 years left on Mickey Mouse’s copyright term, Congress again changed the duration with the</span> [_Sonny Bono Copyright Term Extension Act of 1998_](http://www.copyrightextension.com/page01.html \"The Sonny Bono Copyright Term Extension Act\")<span style=\"line-height: 1.5em;\">.</span><span style=\"line-height: 1.5em;\">This legislation lengthens copyrights for works created on or after January 1, 1978, to “life of the author plus 70 years,” and extends copyrights for corporate works to 95 years from the year of first publication, or 120 years from the year of creation, whichever expires first. That pushed Mickey’s copyright protection out to 2023.</span>\n\nThe chart above illustrates the “Mickey Mouse Curve,” showing how copyright duration has changed close to each time Mickey Mouse is about to expire.\n\n<div class=\"IRPP_kangoo-content\">[You may like:](https://alj.artrepreneur.com/school-copyright-in-student-work/) [Can a School District Claim Copyright in its Student Art?](https://alj.artrepreneur.com/school-copyright-in-student-work/)</div>\n\nNot everybody has been happy about these changes due to our inability to use old work to create new artistic works. One author noted that we are [“the first generation to deny our own culture to ourselves](https://twitter.com/thepublicdomain/statuses/3179288729)<span style=\"line-height: 1.5em;\">” since “</span>[no work created during your lifetime will, without conscious action by its creator, become available for you to build upon](https://twitter.com/thepublicdomain/statuses/3179305900)<span style=\"line-height: 1.5em;\">.”</span>\n\nDisney now has until 2023 to figure out how to extend that date once again. In 5 years or so, we can probably expect to see stories about proposed changes to copyright duration, once again. It is unlikely that a company as strong as Disney will sit by and allow Steamboat Willie to enter the [Public Domain](https://alj.artrepreneur.com/can-find-creative-work-copyright-free/ \"How can I Find Out if a Creative Work is Copyright Free?\").\n\n> <span style=\"font-size: 14pt;\">What would you do with Steamboat Willie’s Mickey Mouse if it enters the public domain? Post your ideas in the comments section below.</span>\n\n<div class=\"awac-wrapper\">\n\n<div class=\"awac widget wtpsw-post-list-widget-2\">#### Popular Posts\n\n<div class=\"wtpsw-post-items\">\n\n<div class=\"wtpsw-post-thumb-right\">###### [How to Respond to a Getty Extortion Letter](https://alj.artrepreneur.com/respond-getty-images-demand-letter/)\n\n<div class=\"wtpsw-post-stats\"><span class=\"wtpsw-post-author\">By [Steve Schlackman](https://alj.artrepreneur.com/author/)</span> | <span class=\"wtpsw-post-comment\">136 Comments</span></div>\n\n<div class=\"wtpsw-post-thumb-right\">Should anyone find themselves a recipient of a Getty Demand letter, this article includes a sample response letter that might be helpful.\n\n###### [Fair Use of Copyright Images in Your Blog](https://alj.artrepreneur.com/fair-blogging-bloggers-copyrighted-images/)\n\n<div class=\"wtpsw-post-stats\"><span class=\"wtpsw-post-author\">By [Nicole Martinez](https://alj.artrepreneur.com/author/)</span> | <span class=\"wtpsw-post-comment\">82 Comments</span></div>\n\n<div class=\"wtpsw-post-thumb-right\">Today's artists and creative entrepreneurs use blogging as a necessary tool to demonstrate thought leadership and capture a dedicated audience and internet following. For artists and photographers, finding photos aren't usually a problem – they're just using their own. But what about lifestyle, fashion, and food bloggers, who tend to...\n\n###### [How Mickey Mouse Keeps Changing Copyright Law](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/)\n\n<div class=\"wtpsw-post-stats\"><span class=\"wtpsw-post-author\">By [Steve Schlackman](https://alj.artrepreneur.com/author/)</span> | <span class=\"wtpsw-post-comment\">77 Comments</span></div>\n\n<div class=\"wtpsw-post-thumb-right\">When the Copyright Act was first enacted in the United States, the copyright duration was only 14 years. Today Copyright duration can last over a century in some cases. Why such a drastic change? Some say it is all due to a cute little mouse named Mickey. Copyright duration had...\n\n###### [Who Really Owns The Art: Creator or Buyer](https://alj.artrepreneur.com/visual-art-ownership/)\n\n<div class=\"wtpsw-post-stats\"><span class=\"wtpsw-post-author\">By [Steve Schlackman](https://alj.artrepreneur.com/author/)</span> | <span class=\"wtpsw-post-comment\">70 Comments</span></div>\n\n<div id=\"rpwwt-recent-posts-widget-with-thumbnails-2\" class=\"rpwwt-widget\">Buying visual art, such as an oil painting, and we may have joint ownership along with its creator. So what did we really buy?\n\n#### Recent Posts\n\n* [![Metropolitan Museum of Art](https://alj.artrepreneur.com/wp-content/uploads/2019/02/New-York-Met_0913-74x55.jpg \"New York Met_0913\")<span class=\"rpwwt-post-title\">How Can Museums Copyright the Works of Old Masters?</span>](https://alj.artrepreneur.com/how-can-museums-copyright-the-works-of-old-masters/)\n\n<div class=\"rpwwt-post-excerpt\">If an artwork is in the public domain, free from copyright protection, then how can a museum claim it holds the copyright? […]</div>\n\n*   [![M.C. Escher](https://alj.artrepreneur.com/wp-content/uploads/2019/01/Dolphins-by-Escher-74x55.jpg \"Dolphins by Escher\")<span class=\"rpwwt-post-title\">2019 is a Huge Year for Public Domain Art</span>](https://alj.artrepreneur.com/2019-public-domain-art/)\n\n    <div class=\"rpwwt-post-excerpt\">On Jan 1, 2019, we not only ushered in a new year but also an unprecedented amount of creative works entering the public domain. […]</div>\n\n*   [![Copyright an Idea](https://alj.artrepreneur.com/wp-content/uploads/2018/12/Copyright-an-idea-74x55.jpg \"Copyright an idea\")<span class=\"rpwwt-post-title\">Can You Copyright an Idea?</span>](https://alj.artrepreneur.com/can-you-copyright-an-idea/)\n\n    <div class=\"rpwwt-post-excerpt\">Understanding the difference between idea and expression is crucial to ensuring your creative work has sufficient copyright protection. […]</div>\n\n*   [![orphan work](https://alj.artrepreneur.com/wp-content/uploads/2018/11/copyright-orphans-74x55.jpg \"copyright orphan\")<span class=\"rpwwt-post-title\">Using Orphan Works (Copyright Holder Can’t Be Located)</span>](https://alj.artrepreneur.com/using-orphan-work/)\n\n    <div class=\"rpwwt-post-excerpt\">If the owner of a copyrighted work cannot be found, can I use it? It may be possible if you analyze the orphan work properly. […]</div>\n\n*   [![College Art Association](https://alj.artrepreneur.com/wp-content/uploads/2017/02/CAA-74x55.jpg \"CAA\")<span class=\"rpwwt-post-title\">The College Art Association Guide to Fair Use</span>](https://alj.artrepreneur.com/resource-caa/)\n\n    <div class=\"rpwwt-post-excerpt\">Fair use is a common art law issue that arises for artists. Here, we review the College Art Association's Code of Best Practices in Fair Use for the Visual Arts. […]</div>\n\n</div>\n\n</div>\n\n</div>\n\n</div>\n\n</div>\n\n</div>\n\n</div>\n\n</div>\n\n<div class=\"meta-tags\"><span>Tags</span>[Copyright Act](https://alj.artrepreneur.com/tag/copyright-act/) [Copyright Duration](https://alj.artrepreneur.com/tag/copyright-duration/) [Public Domain](https://alj.artrepreneur.com/tag/public-domain/)</div>\n\n</div>\n\n<div class=\"col-lg-12 col-md-12 col-sm-12\">\n\n<div id=\"author\" class=\"herald-vertical-padding\">\n\n<div class=\"herald-mod-wrap\">\n\n<div class=\"herald-mod-head \">\n\n<div class=\"herald-mod-title\">\n\n#### About the author\n\n</div>\n\n<div class=\"herald-mod-actions\">[View All Posts](https://alj.artrepreneur.com/author/steve-schlackman/)</div>\n\n</div>\n\n</div>\n\n<div class=\"herald-author row\">\n\n<div class=\"herald-author-data col-lg-2 col-md-2 col-sm-2 col-xs-2\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=140&d=mm&r=g)</div>\n\n<div class=\"herald-data-content col-lg-10 col-md-10 col-sm-10 col-xs-10\">\n\n#### Steve Schlackman\n\nAs a photographer and Patent Attorney with a background in marketing, Steve has a unique perspective on art and law. Should you have any questions on Intellectual Property contact him at steve@orangenius.com. His photography can be seen online at Fotofilosophy.com or on display at the Emmanuel Fremin Gallery in New York City.\n\n</div>\n\n</div>\n\n</div>\n\n<div id=\"comments\" class=\"herald-comments\">\n\n<div class=\"herald-mod-wrap\">\n\n<div class=\"herald-mod-head \">\n\n<div class=\"herald-mod-title\">\n\n#### 77 Comments\n\n</div>\n\n</div>\n\n</div>\n\n</div>\n\n</div>\n\nThis site uses Akismet to reduce spam. [Learn how your comment data is processed](https://akismet.com/privacy/).\n\n*   <div class=\"comment-author vcard\">**[Pouco Pixel 134 - Como preservar a história - Central da Pauta](https://centraldapauta.com.br/2018/09/17/pouco-pixel-134-como-preservar-a-historia/)**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2018-09-17T13:20:28+00:00\">September 17, 2018 at 1:20 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-69281)</div>\n\n    <div class=\"comment-content\">\n\n    […] o deputado Sonny Bono (sim, o marido e parceiro da Cher). Mas acabou ficando famoso como Lei de Proteção ao Mickey Mouse – afinal, sem a lei, o rato famoso entraria em domínio público já em 2003\\. Se a lei não […]\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-69281)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/2a02949ebd6f3afd41834f4f11c93f37?s=60&d=mm&r=g) **Moises colon gomez**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2018-08-30T12:12:14+00:00\">August 30, 2018 at 12:12 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-69010)</div>\n\n    <div class=\"comment-content\">\n\n    I’m trying to write a story inspirex with medieval fantasy elements. I would love to add King Artur related monsters and characters, but I’m afraid I might get in trouble with some copyright problems. For how much longer are they going to keep this rights? They said 18 years, so it should be 18 YEARS!!! The law is the law! How in the world are they allowed to just pay their problems away? Just let go and learn to lose!\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-69010)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=60&d=mm&r=g) **[Steve Schlackman](http://orangenius.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2018-10-10T20:07:58+00:00\">October 10, 2018 at 8:07 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-69366)</div>\n\n        <div class=\"comment-content\">\n\n        Copyright is for the life of the author plus 70 years or if it is a company then 95 years from publishing. If you want to use monsters and characters from Arthurian legends, you can do so. However, if you are using characters, monsters or if those monsters have certain updated traits form recent stories, then they could be protected. For example, anybody can write a story about a boy wizard but if your boy has a lightning scar on his head, you could be infringing.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-69366)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/325efcf7555a5a8810fded73de9e0cf4?s=60&d=mm&r=g) **Frank Claycomb**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-09-23T18:45:11+00:00\">September 23, 2017 at 6:45 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64814)</div>\n\n    <div class=\"comment-content\">\n\n    Steamboat will was neither the first Disney animated short nor the first appearance of Mickey Mouse. Please check your sources before spreading the common misconception.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64814)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/e147ba158b81e455fbbdafd9103403bd?s=60&d=mm&r=g) **Jose**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-09-22T13:05:02+00:00\">September 22, 2017 at 1:05 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64785)</div>\n\n    <div class=\"comment-content\">\n\n    No Comment\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64785)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/fb6af1eb04e2073f266da3ef9127b70c?s=60&d=mm&r=g) **Valorie**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-08-16T07:16:45+00:00\">August 16, 2017 at 7:16 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64396)</div>\n\n    <div class=\"comment-content\">\n\n    Our high school band is doing a show using Disney songs this year. One of the students drew the Mickey Mouse head outline using the title of the songs for their t-shirts. We have been told we can not use it due to copyright. We were event told we can’t use the word Disney on the shirt. Do you have any suggestions on how we might adapt this to be able to get the kids shirts related to their theme? We are running out of ideas, it is very frustrating.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64396)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/057b3b571dd5de186edff13ffc486bc7?s=60&d=mm&r=g) **Vincent Amico**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-08-15T18:14:31+00:00\">August 15, 2017 at 6:14 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64391)</div>\n\n    <div class=\"comment-content\">\n\n    So does that mean Disney owns the single name of Mickey?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64391)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/b577c254aaea72e92c82b47621d81013?s=60&d=mm&r=g) **Ben Gaskin**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-07-09T02:01:34+00:00\">July 9, 2017 at 2:01 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64096)</div>\n\n    <div class=\"comment-content\">\n\n    Off topic: This website is just about unusable on mobile due to the massive Facebook, Twitter and Pinterest logos suspended in mid air on the left side of the screen (invisible tool bar).\n\n    How many menu bars do you need, art law journal? How much screen real estate?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64096)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/2f9e310be640df66801f494f0d74f35e?s=60&d=mm&r=g) **Brad**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2017-09-28T18:31:04+00:00\">September 28, 2017 at 6:31 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64906)</div>\n\n        <div class=\"comment-content\">\n\n        Yeah it’s pretty horrid site design…\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64906)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/9b8701bd652f894f28a932b584d105ea?s=60&d=mm&r=g) **Quiet Storm**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-07-06T06:21:07+00:00\">July 6, 2017 at 6:21 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64079)</div>\n\n    <div class=\"comment-content\">\n\n    So many popular works around today had to wait for copyrights to expire before they could be produced, e.g. Pineapple Poll had to wait for the copyright on Gilbert & Sullivan to expire. Can you imagine what extended copyright laws would have done to them? They might not even be around!\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64079)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/9b8701bd652f894f28a932b584d105ea?s=60&d=mm&r=g) **Quiet Storm**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-07-05T20:59:32+00:00\">July 5, 2017 at 8:59 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64075)</div>\n\n    <div class=\"comment-content\">\n\n    I’ve been looking around. One source says that Disney’s track record is to make their moves to extend Mickey’s copyright 7-8 years before it is due to expire. That time is now, but I haven’t found any sign that they are doing so, unless they are keeeping it under wraps or still seeking legal advice. Maybe it’ll be something different this time, such as a compromise. Perhaps they realise that their motions to extend Mickey’s copyright are not good PR. Here’s hoping.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64075)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/9b8701bd652f894f28a932b584d105ea?s=60&d=mm&r=g) **Quiet Storm**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-07-05T06:43:44+00:00\">July 5, 2017 at 6:43 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64072)</div>\n\n    <div class=\"comment-content\">\n\n    I wouldn’t bother with Mickey if he went into the public domain. I’d just be glad there weren’t any more of these pesky copyright extensions in the US.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64072)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/9b8701bd652f894f28a932b584d105ea?s=60&d=mm&r=g) **Quiet Storm**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-07-05T06:26:16+00:00\">July 5, 2017 at 6:26 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64070)</div>\n\n    <div class=\"comment-content\">\n\n    I don’t think it’s fair to continually extend copyright laws, just to keep Mickey out of the public domain. It’s definitely not fair on creative artists who want to use material that is projected to enter the public domain, only to get screwed because copyright’s been extended again. At this rate it’s going to end up at 1,000 years before copyright can expire on anything in the US.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64070)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/4ccd77d1668848b586c6035b0833cdf3?s=60&d=mm&r=g) **John Willow**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-06-19T23:37:14+00:00\">June 19, 2017 at 11:37 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64004)</div>\n\n    <div class=\"comment-content\">\n\n    Leave it to the people who revolutionized the concept of motion picture as a tool for creativity and entertainment to be the ones who destroy it as well.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64004)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/66f5d345161deb9e358b4927da734d66?s=60&d=mm&r=g) **Kate**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-06-13T03:55:38+00:00\">June 13, 2017 at 3:55 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-63956)</div>\n\n    <div class=\"comment-content\">\n\n    Wouldn’t the comment of Steamboat Willie not being copyrighted in Australia be enough to assume that if it did go to court that it would be shown that it wasn’t copyrighted? It wouldn’t be public domain in Australia and not here, would it?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-63956)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/25db9fe3b6d74bb1bedd9d1623bbaf76?s=60&d=mm&r=g) **nancy**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-06-05T16:07:24+00:00\">June 5, 2017 at 4:07 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-63911)</div>\n\n    <div class=\"comment-content\">\n\n    interesting\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-63911)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/d02bd0149e0b5d117dc57e080bc2d0b9?s=60&d=mm&r=g) **Eric S.**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2017-05-07T12:36:50+00:00\">May 7, 2017 at 12:36 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-63541)</div>\n\n    <div class=\"comment-content\">\n\n    ‘since “no work created during your lifetime will, without conscious action by its creator, become available for you to build upon.”’\n\n    This is not true. The ‘net abounds with fanfic and fanart.\n\n    It’s not available to _make money_ on.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-63541)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/a330f0ee425b41c0c46584461de581e0?s=60&d=mm&r=g) **Jacob**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-12-07T19:17:12+00:00\">December 7, 2016 at 7:17 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58527)</div>\n\n    <div class=\"comment-content\">\n\n    If mickey mouse ever entered the public domain i would use him as the logo for the phone/computer that I am trying to build.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58527)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/8c4cbfa2b11c77ebfe423cec41bd46ed?s=60&d=mm&r=g) **Scott**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2017-09-03T04:46:17+00:00\">September 3, 2017 at 4:46 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64542)</div>\n\n        <div class=\"comment-content\">\n\n        You couldn’t as many iconic still images of Mickey are trademarked. But you could create one that resembles the Mickey with your own twist. You can do that even today.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64542)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/43a02610c5ebe0a3c2995d5342fb8a0f?s=60&d=mm&r=g) **Michelle price**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-09-24T20:33:54+00:00\">September 24, 2016 at 8:33 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-53289)</div>\n\n    <div class=\"comment-content\">\n\n    My son is an artist and loves to do various Mickey Mouse pictures….he is also autistic and needs work that is non traditional. It would be great if he could supplement his income by selling Mickey art without having to go through legal hoops.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-53289)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/16f8a953c5ef33b3a0cb4352b013c1a1?s=60&d=mm&r=g) **Deborah**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-09-16T17:32:50+00:00\">September 16, 2016 at 5:32 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-52429)</div>\n\n    <div class=\"comment-content\">\n\n    I took a photo in an antique shop of a variety of Donald Duck figures, etc. I would like to do a painting from the phot. Is that permissible?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-52429)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/d294505b49d4bb94cb3c51428359e684?s=60&d=mm&r=g) **SteveAdmin**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2017-01-08T22:41:30+00:00\">January 8, 2017 at 10:41 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-59792)</div>\n\n        <div class=\"comment-content\">\n\n        Sorry, I missed this one. While this would be normally considered fair use, there might be a trademark issue here, although I am not sure if the characters or aspects of characters have been trademarked. However, as long as you are only making a single work or a small fine art series, then you would be ok. Fine art is generally given a pass, however, if you were to use this image on pillow in Target or something, then you might have some issues.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-59792)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/1b21bc7f8540af2b0b69500b9b7a25c7?s=60&d=mm&r=g) **Austin Knox**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-08-28T17:27:54+00:00\">August 28, 2016 at 5:27 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-51061)</div>\n\n    <div class=\"comment-content\">\n\n    I wonder if the constant extension of copyright law is unconstitutional due to the fact that it inhibits free speech and expression. Could there eventually be a supreme Court case on this matter?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-51061)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=60&d=mm&r=g) **[Steve Schlackman](http://orangenius.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-08-28T21:39:50+00:00\">August 28, 2016 at 9:39 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-51070)</div>\n\n        <div class=\"comment-content\">\n\n        It seems unconstitutional, but the Supreme Court has said that the extensions are constitutional. Also, remember that free speech has limitations but it is a constitutional amendment. The Copyright Clause is Article 1 Section 8 so it would be hard to make a free speech argument that the amendment is more important.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-51070)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/797be4e45df34ed698fd3719d9a2eb7a?s=60&d=mm&r=g) **Stev Krue**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2016-11-04T09:08:19+00:00\">November 4, 2016 at 9:08 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-55692)</div>\n\n            <div class=\"comment-content\">\n\n            Wouldn’t the opposite be correct! The point of a constitutional amendment is to change the contents of the Constituion. Therefore the First Anendment freedom of speech prevails over a limitation on speech in the Constitution.\n\n            On another point, the technology of 1790 was such that 14 years of exclusivity was reasonable. Books were high tech, expensive and commerce was slow. From handwritten manuscript to binding, publication would take months; from one coast to the Mississippi could take weeks. Today’s technology has speeded up the life cycle of copyrighted material such that a reasonable period of exclusivity is now much less than 14 years. The law has gone in the wrong direction.\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-55692)</div>\n\n            *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/75ff235bd6bee19c22ccf36512c3350c?s=60&d=mm&r=g) **[Nicolas Falacci](http://falacci.tumblr.com/)**</div>\n\n                <div class=\"comment-metadata\">[<time datetime=\"2017-03-20T17:31:50+00:00\">March 20, 2017 at 5:31 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62214)</div>\n\n                <div class=\"comment-content\">\n\n                The Sonny Bono congressional extension is corporate overreach. However, I do feel that it’s important to give original creators a solid length of copyright protection. We can argue over the exact length, but content creators (big and small) make their living through selling their work and I think they are entitled to a reasonable length of protection even following their death for the benefit of their families. I believe the European model (lifetime plus 50 years) is reasonable. I also understand the need for content-creating corporations (say like television studios/networks and movie studios) to have lengthy copyright protection — because their business model is to put out enormous amounts of money on content they have no idea will make a return for profit and indeed, the vast majority of content created by studios for film and television fail economically. This means these companies rely on a few major hits. Those hits pay their salaries, but the few hits also pay for the development and production of the majority of content they create that fails to make profit. That means these content creators (networks, studios, etc) need to get the most profit from these hits over time. And they need to be able to build libraries of content that people will continue to come to and pay to experience via subscription or embedded advertising — creating a necessary revenue stream for these corporations. They can’t do that without a fairly lengthy copyright protection. They could never remain in business with a 14 year copyright. You’d see all the major studios and networks disappear or just walk away or produce just a few minor pieces of inexpensive content if we went back to a 14 year copyright. But I also believe the European length is fair and adequate for individuals as well. Creators, writers, artists, photographers, should have a lifetime copyright plus an additional number of years beyond for the benefit of their families or family estates. However, I do believe our current copyright length is unnecessarily too long. I would appeal/petition congress to roll back to the 1976 amendment. Life time plus 50 years. That is fair and adequate to both individual artists and content-creating corporations.\n\n                </div>\n\n                <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62214)</div>\n\n                *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/92fe9afcdfa49b5ec529527cc21b0deb?s=60&d=mm&r=g) **Josh**</div>\n\n                    <div class=\"comment-metadata\">[<time datetime=\"2017-09-14T18:13:23+00:00\">September 14, 2017 at 6:13 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64653)</div>\n\n                    <div class=\"comment-content\">\n\n                    Good, let the current major studios die off if they can’t adapt. You are forgetting one very crucial flaw in your analysis of (what I assume you’re talking about is movies, if I’m wrong so is everything this comment says). The reason so many movies flop and fail, is because they are BAD, not because the creator got unlucky. Take any movie released recently, it was either horrible and bombed, or was horrible and succeeded. Good movies almost don’t exist in this day and age and that is why so many movies fail. Big studios think it is more effective to spend small money on many movies than to spend that money developing and marketing one very good movie.\n\n                    </div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/9241a3ac2f433b95ee9626fa2f6dc5fa?s=60&d=mm&r=g) **Michael**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-07-06T06:43:39+00:00\">July 6, 2016 at 6:43 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-43874)</div>\n\n    <div class=\"comment-content\">\n\n    The article implies Disney is the driving force behind all these copyright extensions. Has this been established as fact? Are there any other major beneficiaries of these extensions? Does Disney make political contributions? Do those contributions correlate to passage of the copyright extensions?\n\n    Not defending Disney. Just wondering.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-43874)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=60&d=mm&r=g) **[Steve Schlackman](http://orangenius.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-07-15T10:35:25+00:00\">July 15, 2016 at 10:35 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-45113)</div>\n\n        <div class=\"comment-content\">\n\n        The information is anecdotal but it is a well-known meme in the industry. Disney does have a large lobbying organization as to do all of the major record labels and movie studios. So Disney is well known as the driving force. Do I have actual evidence, no but there are sources out there much more respectable than myself that also follows this reasoning who may have better evidence. But it also makes sense. But we will have to see what happens in a few years when the copyright is close to ending to see if there are new lobbying efforts.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-45113)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/288ef3359e092dffe62d488c816d1c8e?s=60&d=mm&r=g) **Ben Kleschinsky**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-12-13T01:38:57+00:00\">December 13, 2016 at 1:38 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58905)</div>\n\n        <div class=\"comment-content\">\n\n        We can look to Open Secrets website to find that Walt Disney Company has lobbyied on a lot of bills relating to copyright law going back to 1998:\n\n        [https://www.opensecrets.org/lobby/clientissues_spec.php?id=d000000128&year=2016&spec=CPT](https://www.opensecrets.org/lobby/clientissues_spec.php?id=d000000128&year=2016&spec=CPT)\n\n        And here is the amount lobbying dollars by year going back to 1998:\n\n        [https://www.opensecrets.org/lobby/clientsum.php?id=d000000128&year=2016](https://www.opensecrets.org/lobby/clientsum.php?id=d000000128&year=2016)\n\n        1995 is as far back as these websites have history of thanks to Lobbying Disclosure Act of 1995.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58905)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/990459160f8b658bebdc7bcb5aca980d?s=60&d=mm&r=g) **[Jeremy Johnson](http://www.amazingbean.com)**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-05-29T22:19:54+00:00\">May 29, 2016 at 10:19 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-39344)</div>\n\n    <div class=\"comment-content\">\n\n    How has MGM’s Jerry Mouse not been a copyright infringement on Disney’s Micky Mouse?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-39344)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=60&d=mm&r=g) **[Steve Schlackman](http://orangenius.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-05-30T20:33:47+00:00\">May 30, 2016 at 8:33 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-39576)</div>\n\n        <div class=\"comment-content\">\n\n        Copyright only protects the execution of an idea but not the idea itself. So the character of Micky Mouse, such as the personality traits as well as the physical characteristics such as the ears are copyrightable, but not the idea of the mouse. Jerry is a very different character from Mickey.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-39576)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/29a9438cfebacd54013e048446d7dfcc?s=60&d=mm&r=g) **Vishal Grover**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2016-06-02T02:26:15+00:00\">June 2, 2016 at 2:26 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-40077)</div>\n\n            <div class=\"comment-content\">\n\n            Fantastic article Steve…..one thing still not clear can Jerry the mouse be used? Is it in public domain?\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-40077)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/f2d0c01c1902941957c787f6ec6502ef?s=60&d=mm&r=g) **Ben M.**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-02-18T18:02:51+00:00\">February 18, 2016 at 6:02 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-30395)</div>\n\n    <div class=\"comment-content\">\n\n    Regarding the last paragraph, I am wondering when Disney and other copyright holders will start pushing for another extension. In fact, I stumbled upon this article while trying to find out whether they’ve started yet. An activity I have been partaking in regarding all of this is periodically figuring out how many days until works start entering the public domain again. As of writing this, 1923 will be public domain in 1048 days, counting today. That is all.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-30395)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/44011a713f55b332d1ec66716eb0379a?s=60&d=mm&r=g) **Tom**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-02-03T09:22:20+00:00\">February 3, 2016 at 9:22 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-27886)</div>\n\n    <div class=\"comment-content\">\n\n    Mickey Mouse will just be made into legal cartoon porn lol\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-27886)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/38e57cba751a8ee2516c3f4e74b76bec?s=60&d=mm&r=g) **Calum**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-02-03T05:59:26+00:00\">February 3, 2016 at 5:59 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-27860)</div>\n\n    <div class=\"comment-content\">\n\n    Steamboat Willie is already in the public domain here in Australia.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-27860)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/fba9d3467f282b5a4603ffc843ea980e?s=60&d=mm&r=g) **Michael_Emmett**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-01-28T04:20:35+00:00\">January 28, 2016 at 4:20 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-27029)</div>\n\n    <div class=\"comment-content\">\n\n    Very interesting. Reminded me of this talk from Lawrence Lessig: [https://www.youtube.com/watch?v=xVk77VQuPAY](https://www.youtube.com/watch?v=xVk77VQuPAY) which steps through the radical change to copyright law in the last decades, mostly driven by Disney. I also just came across Disney World’s original real estate shenanigans. “Using a series of separate holding companies (so that nobody would realize that Disney was making a large commercial investment in central Florida), Disney’s representatives began buying up a very large, contiguous property from multiple land-owners. Disney acquired much, much more land than was needed for his immediate purpose (the initial development of the Magic Kingdom). By hiding the real buyer and disguising his intent, Disney way able purchase land much more cheaply than he otherwise would have been able to. Likewise, by building a theme park in the center of the property, he was able to boost the value of all of his surrounding real estate.”\n\n    This seems borderline fraudulent. At LEAST unethical. I know (or am realizing) that this happens all the time, but this is an example of the rich having economies of scale capabilities (not to mention access to legal and legislative cover) that ordinary people don’t have. At the very least, shouldn’t one criticize the lack of transparency of acts like this that are essential for free market’s invisible hand?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-27029)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/ba27cecb838b31dba27922312ecab33b?s=60&d=mm&r=g) **Damian**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-04-28T03:01:35+00:00\">April 28, 2016 at 3:01 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33954)</div>\n\n        <div class=\"comment-content\">\n\n        There is nothing unethical about the practice undertaken here. I think you could more easily argue that it would have been unethical for the sellers to sell the land at inflated prices just because a big business wanted to buy the land and not a number of smaller businesses. No one was coerced into selling (at least not in the recorded details) and each sale would have given both parties equal opportunity to negotiate price.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33954)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/d9043fedfeea29074b9ade4d38846d3a?s=60&d=mm&r=g) **[Karine](https://Www.coursera.org/user/i/8ae26d4898639e92f6f7b304947b80c4)**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-01-20T14:58:02+00:00\">January 20, 2016 at 2:58 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-26223)</div>\n\n    <div class=\"comment-content\">\n\n    I am in fact delighted to glance at this web site posts which contains plenty of useful facts, thanks for providing such statistics.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-26223)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/1b1575c6556da356d933020bbb0efa74?s=60&d=mm&r=g) **Timothy**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-01-20T04:00:08+00:00\">January 20, 2016 at 4:00 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-26137)</div>\n\n    <div class=\"comment-content\">\n\n    Great information. Lucky me I discovered your blog by accident (stumbleupon).\n    I’ve book marked it for later!\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-26137)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/c591f087b145c6b260e5e521d56ea822?s=60&d=mm&r=g) **Eddie B.**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2016-01-18T15:35:19+00:00\">January 18, 2016 at 3:35 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-25913)</div>\n\n    <div class=\"comment-content\">\n\n    In my humble opinion, Mickey Mouse should have not received copyright protection in the first place. That is due to the fact that Walt Disney had nothing to do with its creation. He borrowed the original stories of Mickey Mouse from the works of the Persian poet and satirist Ubayd-e Zakani. Zakani, born in the city of Qazvin in 1300 CE, was a satirist as well as a social critics of those in power at his time. His Moush-and-Gorbeh (Mouse and Cat) stories were intended to ridicule the powerful (represented by the cat) who were out to exploit the weak (the mice), but were outsmarted by the mice in every turn.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-25913)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/935accc0219fb1101328a0c7845da93b?s=60&d=mm&r=g) **Mike**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-04-26T16:08:48+00:00\">April 26, 2016 at 4:08 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33801)</div>\n\n        <div class=\"comment-content\">\n\n        What you’re describing sounds like “Tom & Jerry”, not any Mickey Mouse cartoon that I’m familiar with (let alone the basis for the character in general).\n\n        In fact, if Google is any indication, you’re the only one who believes that Disney’s “Mickey Mouse” stories are close enough to Zakani’s to warrant a lack of Copyright protection.\n\n        There are plenty of “Walt Disney didn’t create Mickey Mouse” stories, but yours is the only one I’ve seen crediting Zakani instead.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33801)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/ecf534af5bb8b68e68e2a1947fdafbfb?s=60&d=mm&r=g) **[Roger Berkeley](http://www.rogerberkeley.com)**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2016-12-13T18:18:36+00:00\">December 13, 2016 at 6:18 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58942)</div>\n\n            <div class=\"comment-content\">\n\n            Mike, that’s not even the issue. Ideas are not protected by copyright, not the expression of ideas. Mickey Mouse drawing are the expression of an idea. Zakani’s character is an idea, with only his works being the expression of an idea. Disney has never reproduced – to my knowledge – the works of Zakani in any form, so any relationship to them are irrelevant in the bestowing of copyright protection.\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58942)</div>\n\n            *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/75ff235bd6bee19c22ccf36512c3350c?s=60&d=mm&r=g) **[Nicolas Falacci](http://falacci.tumblr.com/)**</div>\n\n                <div class=\"comment-metadata\">[<time datetime=\"2017-03-20T18:19:50+00:00\">March 20, 2017 at 6:19 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62216)</div>\n\n                <div class=\"comment-content\">\n\n                Well said. Additionally, if people bother to look at the history of Mickey Mouse, they would see that the character originated when Disney lost the rights to his first animated character, Oswald the Lucky Rabbit (created for Disney by his then business partner, Ubbe Iwerks). Disney had lost not only his main character, he lost his entire company to then Universal. Disney desperately needed a new character. Ubbe Iwerks created dozens of different animal characters, but none of them caught DIsney’s imagination. It wasn’t until Iwerks discovered an old drawing by Hugh Harman (a Disney animator from Kansas City who together with Carl “Rudy” Ising and producer Charles Mintz would leave Disney and work for Universal continuing the Oswald character) that showed mice surrounding an image of Disney. Disney took the idea of a mouse character. On a train ride returning from a business meeting, he sketched out the first image of Mickey. He also tried out various names on his wife. She hated his first choice, “Mortimer,” but thought his next suggestion “Mickey” was perfect.\n\n                The specific execution of Mickey is the only thing that can be copyrighted, and was extraordinarily close to the image of Oswald. But of course Oswald was a rabbit. Mickey was a mouse. Disney knew there would be no infringement with his previous character. And despite the similarities in the overall look of the two characters, Mickey was distinct enough in execution to be individually copyrighted.\n\n                If people want to get into an argument about Disney not really creating Mickey, they usually bring up the fact that Ubbe Iwerks (Disney’s business and artistic partner) was mainly responsible for the execution of Mickey Mouse and deserved at least a partial ownership and copyright. However, in truth, despite Iwerks’ suggestion of a mouse character, as mentioned, it was Disney himself that sketched out the very first image of Mickey. Ubbe then refined the drawing and was responsible for animating the first few Mickey cartoons including “Steamboat Willie.” One can easily make the argument, however, that not only did Disney himself create the original sketch, but also that Iwerks was working under contract to Disney which meant in return for his financial compensation, Iwerks work remained the property of the company. Iwerks did feel after a number of years that he was not fairly or adequately compensated or recognized for his contributions to the Disney company and left to start his own company. [https://en.wikipedia.org/wiki/Ub_Iwerks](https://en.wikipedia.org/wiki/Ub_Iwerks) Though he did later return to Disney in 1940 and finished the rest of his career working at Disney creating novel animation/film processes.\n\n                </div>\n\n                <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62216)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/30f0d6364de9c86c262e558fec27b741?s=60&d=mm&r=g) **Milo Tsukroff**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2015-11-09T12:11:24+00:00\">November 9, 2015 at 12:11 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-18894)</div>\n\n    <div class=\"comment-content\">\n\n    United States Constitution, Article 1, Section 8, duties of Congress: “To promote the Progress of Science and useful Arts, by securing for limited Times to Authors and Inventors the exclusive Right to their respective Writings and Discoveries;” What part of “limited” does Congress not understand?\n\n    Oh yeah, their income. It’s TOO limited.\n\n    Prediction: Disney will buy out Congress, and extend the unconstitutional limits of the copyright law, yet again.\n\n    Another prediction: People will more and more ignore the copyright law until it becomes a “wild west”. Because, the harsher the law, the more incentive to break or ignore it.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-18894)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/3181c101bc4abf11a66e627023ce8b9d?s=60&d=mm&r=g) **Christina Thomas**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-02-09T18:28:31+00:00\">February 9, 2016 at 6:28 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-29085)</div>\n\n        <div class=\"comment-content\">\n\n        I agree with you!!!\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-29085)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/935accc0219fb1101328a0c7845da93b?s=60&d=mm&r=g) **Mike**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-04-26T16:17:35+00:00\">April 26, 2016 at 4:17 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33803)</div>\n\n        <div class=\"comment-content\">\n\n        Unconstitutional? Seriously?\n\n        I hate to break this to you, but it seems to be you who doesn’t understand “limited”. It carries no intrinsic value. It’s not a number. Anything that’s not “infinite” is, by definition, “limited”.\n\n        They can extend it to 3,000 years, and, by definition, it’s still a limited amount of time.\n\n        Just because you think you can arbitrarily decide what constitutes “limited” and then accuse others of breaking the law for violating your definition doesn’t mean that they’re actually breaking the law or that your definition holds water.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33803)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/e62b8e696079fb98e55c67d11ee64aac?s=60&d=mm&r=g) **Davey**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2016-05-26T15:13:51+00:00\">May 26, 2016 at 3:13 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-38532)</div>\n\n            <div class=\"comment-content\">\n\n            I was going to say the same thing! Excellent point!\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-38532)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/1210d3fe4971ad4bb78a44eba8c4c2ec?s=60&d=mm&r=g) **TR**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2016-07-06T20:09:38+00:00\">July 6, 2016 at 8:09 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-43918)</div>\n\n            <div class=\"comment-content\">\n\n            You can’t read “limited” in isolation. It’s explicitly connected to “Authors and Inventors.” In context, the original intent was that copyright protection would not extend beyond the life of the creator.\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-43918)</div>\n\n            *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/56bbac79a2ee6eb2e028c22eb84d5d0a?s=60&d=mm&r=g) **Mike**</div>\n\n                <div class=\"comment-metadata\">[<time datetime=\"2017-03-18T15:38:40+00:00\">March 18, 2017 at 3:38 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62156)</div>\n\n                <div class=\"comment-content\">\n\n                Unless you can point me toward the USSC ruling saying that, I have to disagree.\n\n                If they wanted to say “for the lifetime of the artist or inventor”, they would’ve. Instead, they used the arbitrary “limited” with no further caveats–leaving me to believe that, like most other Constitutional issues, the intent was for the Court and Legislature to define the limit.\n\n                </div>\n\n                <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62156)</div>\n\n            *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/75ff235bd6bee19c22ccf36512c3350c?s=60&d=mm&r=g) **[Nicolas Falacci](http://falacci.tumblr.com/)**</div>\n\n                <div class=\"comment-metadata\">[<time datetime=\"2017-03-20T18:55:29+00:00\">March 20, 2017 at 6:55 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62219)</div>\n\n                <div class=\"comment-content\">\n\n                Yes, however “Authors and Inventors” can now be content-creating corporations such as film and television studios. They explicitly create their contracts with original artists/creators to claim authorship of the material. In feature films, in return for financial compensation, the writer surrenders legal authorship and ownership to the studio. The companies’ argument being that without their enormous financial investment and corporate development there would be no such content created. Which is inarguably true. How many individual artists/writers/directors are going to make a 150 million dollar film on their own? Or make a 7 million dollar television pilot and get a network to put it on the air? (If you want to retain full ownership of a film you need to raise or even better, put up your own money, for say a small film that costs a few hundred thousand or a million. But even then, if you want to get the film distributed or put on air, you’ll have to surrender a major amount of ownership to the distributor.)\n\n                This sort of corporate authorship/ownership goes back to the beginning of the film and television industry. Disney worked this way. Ubbe Iwerks was Disney’s partner in spirit, but ultimately, truthfully, an employee of Disney and all his work developing Mickey Mouse for Disney was simply contractual work. He was compensated, but he did not negotiate any ownership (which doesn’t translate to copyright participation, yet ties one financially to the copyright for life).\n\n                These days in feature films, writers receive no ownership or copyright participation. It’s a sore spot in the Writers Guild and several suggestions from writers about demanding authorship and copyright participation have been suggested, but never acted upon.\n\n                One reason why many feature writers have migrated to television, is the fact that television show creators are actually given an ownership percentage. Which ties one into profit participation for the life of the creator. Of course, not that many shows become profitable. Studios (and to a smaller degree networks) invest so much money to produce television series that even the successful ones are usually running in the red during their original airings. It’s only when a series is successful enough to be sold in syndication that it has a chance to begin to earn actual profits. Still, TV studios and networks are laying out so much money to continue to create new series, that they tend to be very protective of their profits and the creators are often forced to have the studios audited or even sued to attempt to gain their rightful profit participation. BUT — the reality still remains in television that the creator will be given ownership participation. Which is a great thing. I believe, in full fairness, original writers/creators in both film and television should receive not only partial ownership, but also copyright participation. However, given the legal and financial stance of the major content-creating media conglomerates, that is unlikely to happen.\n\n                In a previous comment, I make the argument for why these large media companies need and should receive fairly lengthy copyrights. I also make the same argument for individuals, for artists, writers, etc to be given not only lifetime copyrights, but lifetime plus 50 years (European model) for the benefit of the artist’s family or family estate. I think that’s plenty long enough for both individuals and for media companies. Though it’s easy to see why Disney and the other media companies want to extend the copyright length as long as possible.\n\n                </div>\n\n                <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62219)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/852cabb166881b83e57f1e6ac12afac6?s=60&d=mm&r=g) **Jeigh**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2016-07-10T00:06:26+00:00\">July 10, 2016 at 12:06 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-44286)</div>\n\n            <div class=\"comment-content\">\n\n            cool\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-44286)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/ca70cc786993b2ce8fa978431374c611?s=60&d=mm&r=g) **[sjmlibrarian](https://gravatar.com/sjmlibrarian)**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2015-09-18T13:39:55+00:00\">September 18, 2015 at 1:39 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-14851)</div>\n\n    <div class=\"comment-content\">\n\n    Correction: ” With the impending loss of copyright on it’s mascot”: it’s should be its. I was going to recommend this to students but the error makes me reluctant to do so. Can it be edited?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-14851)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/852cabb166881b83e57f1e6ac12afac6?s=60&d=mm&r=g) **Jeigh**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-07-10T00:09:35+00:00\">July 10, 2016 at 12:09 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-44288)</div>\n\n        <div class=\"comment-content\">\n\n        Are you kidding? Come on. There are so many misuses of that contraction. You’re being a little ridiculous. Simply add (sic) and be done with it!\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-44288)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/368048ba61cf1931de904a86dd600972?s=60&d=mm&r=g) **Lisa**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2015-09-08T22:56:37+00:00\">September 8, 2015 at 10:56 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-14740)</div>\n\n    <div class=\"comment-content\">\n\n    It’s ironic how much of Disney’s success comes from using public domain characters.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-14740)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/9b8701bd652f894f28a932b584d105ea?s=60&d=mm&r=g) **Quiet Storm**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2017-07-05T06:29:34+00:00\">July 5, 2017 at 6:29 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64071)</div>\n\n        <div class=\"comment-content\">\n\n        You’re not the only one to have noticed that irony.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-64071)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/ff7a19d0d78179f440db43ae9bae336c?s=60&d=mm&r=g) **Steve Cody**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2015-04-19T08:42:08+00:00\">April 19, 2015 at 8:42 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-13086)</div>\n\n    <div class=\"comment-content\">\n\n    The copyright for “Steamboat Willy” and for all the original black and white characters that appear in the short has likely expired. Under the 1909 Act, the notice requirements were very strict and Disney failed to follow them. The upshot of that was that the copyright never properly attached. But to fully test it, someone is going to have to produce a work with the original Mickey Mouse, get sued by Disney, and slog it out i the courts. (A law review article was published on the subject a number of years ago. See, Hedenkamp, Douglas A. “Free Mickey Mouse: Copyright Notice, Derivative Works, and the Copyright Act of 1909 (Spring, 2003)”. Virginia Sports & Entertainment Law Journal (2))\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-13086)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/2977d8322e23d27513e4a3115c363b1b?s=60&d=mm&r=g) **Rose Rodgers**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2015-04-13T18:06:20+00:00\">April 13, 2015 at 6:06 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12943)</div>\n\n    <div class=\"comment-content\">\n\n    Technically, “Plane Crazy” was the first Mickey cartoon. “Steamboat Willie” was just the first one with synchronized music and dialogue.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12943)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=60&d=mm&r=g) **[Steve Schlackman](http://schlackmaniplaw.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2015-04-13T21:30:08+00:00\">April 13, 2015 at 9:30 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12945)</div>\n\n        <div class=\"comment-content\">\n\n        That’s right! I totally forgot about that.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12945)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/3e282b6f0e18651cd1e899845d7b81e0?s=60&d=mm&r=g) **Duane**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2015-03-18T16:40:41+00:00\">March 18, 2015 at 4:40 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12109)</div>\n\n    <div class=\"comment-content\">\n\n    What would you do with Steamboat Willie’s Mickey Mouse if it enters the public domain?\n    I would do absolutely nothing.\n    Sure the original may be out of copyright, but that only applies to the original film. I doubt after 100 years, there is a copy around. All the newer versions will have had colour correction, audio remixing, and encoding for either VHS, DVD, or HD. These activities are copyrighted and you can’t separate the new product from the original. So in reality, Disney and the other film makers already has a perpetual copyright. With the shortened lifetime of current and future recording mediums, Disney et al probably won’t need to extend the copyright duration. They just need to guard the original recordings.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12109)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/9ef7cacc583ef46d7c824a6c3938ebf8?s=60&d=mm&r=g) **John R.**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2015-04-13T21:04:20+00:00\">April 13, 2015 at 9:04 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12944)</div>\n\n        <div class=\"comment-content\">\n\n        It’s entirely possible to create a derivative work using the character of Mickey Mouse, as depicted in Steamboat Willie, without using the original film or anyone else’s derivative work. For example, I can make “Steamboat Willie Goes to Mars” once the 1928 copyright expires (assuming the Congress isn’t bought off yet again).\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12944)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/b457a0eb03fb23b8c9492d41d1d9cb0d?s=60&d=mm&r=g) **zippo marx**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2015-03-18T01:14:59+00:00\">March 18, 2015 at 1:14 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12085)</div>\n\n    <div class=\"comment-content\">\n\n    “What would you do with Steamboat Willie’s Mickey Mouse if it enters the public domain?”\n\n    Commercially viable Disney porn.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-12085)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/ba913e2cc77984c1b2079adfe3fd9f93?s=60&d=mm&r=g) **Portabella**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2014-12-16T12:41:23+00:00\">December 16, 2014 at 12:41 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-7272)</div>\n\n    <div class=\"comment-content\">\n\n    My suggestion would be to let Disney specifically buy their way out. So Mickey stays as their property as long as they keep forking over significant amounts of cash; everything else becomes public domain (unless its owners also buy their way out). Tie the cash to something substantial (like Congressional salaries :), so that not only can Disney not reduce the payment, they are under constant pressure to pay more.\n\n    Imperfect? You bet. But substantially better than having copyright just extended indefinitely.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-7272)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/46fdd18238863cfa4289294918b96bff?s=60&d=mm&r=g) **hornakapopolis**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2015-01-22T21:42:45+00:00\">January 22, 2015 at 9:42 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-9412)</div>\n\n        <div class=\"comment-content\">\n\n        Ideally, we should be shooting for equal protection under the law. Having deep pockets shouldn’t be an advantage over ones creative work.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-9412)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/f55d61b27ec82993ccb6694d12562c6e?s=60&d=mm&r=g) **James McGrath**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2015-03-10T20:12:12+00:00\">March 10, 2015 at 8:12 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-11677)</div>\n\n            <div class=\"comment-content\">\n\n            Exactly.\n            What I find most ironic about all of this however, is the fact that Disney has conceivably built much of it’s empire based on intellectual properties in the public domain.\n            Segar’s Popeye (or Thimble Theater) also has a unique situation born from this.\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-11677)</div>\n\n            *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/75ff235bd6bee19c22ccf36512c3350c?s=60&d=mm&r=g) **[Nicolas Falacci](http://falacci.tumblr.com/)**</div>\n\n                <div class=\"comment-metadata\">[<time datetime=\"2017-03-20T19:03:47+00:00\">March 20, 2017 at 7:03 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62220)</div>\n\n                <div class=\"comment-content\">\n\n                It doesn’t matter if you create content based on public domain material.\n\n                Once you create a distinct execution of an idea, no matter what the source material, it is copyrightable — it will be the artist’s copyright.\n\n                </div>\n\n                <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62220)</div>\n\n            *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/75ff235bd6bee19c22ccf36512c3350c?s=60&d=mm&r=g) **Nicolas Falacci**</div>\n\n                <div class=\"comment-metadata\">[<time datetime=\"2017-03-21T00:38:28+00:00\">March 21, 2017 at 12:38 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62234)</div>\n\n                <div class=\"comment-content\">\n\n                It doesn’t matter if Disney used works in the public domain for inspiration.\n\n                It all comes down to an original and specific execution of an idea, no matter the source material.\n\n                </div>\n\n                <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62234)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/935accc0219fb1101328a0c7845da93b?s=60&d=mm&r=g) **Mike**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-04-26T16:35:20+00:00\">April 26, 2016 at 4:35 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33804)</div>\n\n        <div class=\"comment-content\">\n\n        …so Copyright holders should bribe members of Congress to give them & their creations special treatment?\n\n        “Imperfect” is an understatement. “Insanely illegal” is the phrase you’re looking for.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-33804)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/ecf534af5bb8b68e68e2a1947fdafbfb?s=60&d=mm&r=g) **[Roger Berkeley](http://www.rogerberkeley.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2016-12-13T18:22:34+00:00\">December 13, 2016 at 6:22 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58943)</div>\n\n        <div class=\"comment-content\">\n\n        Sounds like morphing copyright into patents, paying renewal fees. Interesting idea – flawed, of course, given the purpose of copyright being for economic protection of the creator and an incentive for the arts – but interesting nonetheless!\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-58943)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/b7ce312d11a4684f34b20f7bb17c942c?s=60&d=mm&r=g) **imeanwutevur**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2017-04-08T06:49:53+00:00\">April 8, 2017 at 6:49 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62762)</div>\n\n        <div class=\"comment-content\">\n\n        This is basically what is happening already, isn’t it? Lobby the politicians wallets so a new copyright law is passed extending it well beyond what it should be already.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62762)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/3ec833802dab0406f38ad8463ea0a395?s=60&d=mm&r=g) **Paul Kucharski**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2014-06-05T14:44:19+00:00\">June 5, 2014 at 2:44 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-495)</div>\n\n    <div class=\"comment-content\">\n\n    I agree that copyrights law needs to be modified; in the other direction. Copyright duration should be made the same as patent duration. 20 years and your work “ceases to have any legal protection.” If somebody dreams up a song or dreams up the transistor or aspirin, the legal protection limits should be the same. The Beatles songs are well past 20 years and would free game for songwriters to build off of today.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-495)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/75ff235bd6bee19c22ccf36512c3350c?s=60&d=mm&r=g) **[Nicolas Falacci](http://falacci.tumblr.com/)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2017-03-20T19:13:52+00:00\">March 20, 2017 at 7:13 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62221)</div>\n\n        <div class=\"comment-content\">\n\n        As a creator/writer I disagree. I think the European model is fair. Lifetime of the creator plus 50 years. It allows the artist/creator to perpetuate financial remuneration for his/her family or family estate.\n\n        I think that is adequate and fair length for the artist (or media company) and for the public.\n\n        Fair use is allowed even under current copyright protection, so an artist can make art with Mickey Mouse. (It’s just that Disney is so absurdly aggressive about their copyright/trademark that most artists I assume shy away from playing around with Disney characters, but still fair use is available.)\n\n        Imagine you’re a composer/song writer/musician. You’re still alive 20 years after writing a hit song. Or any song. And someone comes along and uses a loop of the opening guitar lick, or they take the key 5 piano chords of the song, and create a whole new song based on your work — and it becomes a hit. Is it fair you get no financial consideration for your work?\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-62221)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/52e3e94806f0018137b48128d485c50c?s=60&d=mm&r=g) **Roy Braatz**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2014-02-19T00:53:00+00:00\">February 19, 2014 at 12:53 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-157)</div>\n\n    <div class=\"comment-content\">\n\n    Mickey Mouse is conceivably a source identifying trademark of Disney which provides protection in perpetuity. Why the need to keep a copyright?\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-157)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=60&d=mm&r=g) **[Steve Schlackman](http://strategyiplaw.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2014-02-19T01:19:36+00:00\">February 19, 2014 at 1:19 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-158)</div>\n\n        <div class=\"comment-content\">\n\n        Trademark protection is based on good and services being used in commerce. It ensures that nobody can use your name or identifying design, such as a mascot for other goods and services. The idea behind that is to make sure that consumers aren’t confused or tricked into buying something that they believe is one company and is actually another. But that won’t always protect your mascot in the same way as a copyright infringement count. It depends on the use of the character.\n\n        There is also a question of damages. In copyright, if the work is registered, you can get minimum statutory damages which can sometimes be more lucrative than Trademark infringement damages. There are several other reasons too lengthy for this reply, but one last point is that when you sue, it is always good to have as many attacks as possible. You won’t be victorious on all your counts, or the awards may be dramatically different, and each has different proof requirements etc.\n\n        So you don’t want to rely on just trademark as a protection since it may not work in all situations or get you the money that you want for the infringement. Although there is a lot of crossover, not every trademark infringement would be a copyright infringement and vice versa.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-158)</div>\n\n*   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/8477808675578d830be81932b79bf2b0?s=60&d=mm&r=g) **[Paul Kamp](http://www.backboneradio.com)**</div>\n\n    <div class=\"comment-metadata\">[<time datetime=\"2014-02-17T04:03:50+00:00\">February 17, 2014 at 4:03 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-156)</div>\n\n    <div class=\"comment-content\">\n\n    Excellent article though I would note two additional things that have made copyright law what it is today.\n\n    1\\. Registration of a work is no longer required.\n\n    2\\. Copyright now covers a large amount of additional “works”.\n\n    These two things complicate the effort in securing rights for those that want to use the work. It has also created orphan works that makes use uncertain.\n\n    </div>\n\n    <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-156)</div>\n\n    *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/01aa6bb61ec43af213ec081afc6e0047?s=60&d=mm&r=g) **[Steve Schlackman](http://strategyiplaw.com)**</div>\n\n        <div class=\"comment-metadata\">[<time datetime=\"2014-02-19T01:23:23+00:00\">February 19, 2014 at 1:23 am</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-159)</div>\n\n        <div class=\"comment-content\">\n\n        Yes. That is true. There is actually some controversy about whether there is copyright protection for Mickey since some argue that the copyright notice requirements were not proper, and so Steamboat Willie is actually in the Public Domain. That is something only decided in court and not a lot of people would be willing to take on Disney over copyright to their mascot.\n\n        </div>\n\n        <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-159)</div>\n\n        *   <div class=\"comment-author vcard\">![](https://secure.gravatar.com/avatar/5ad8eb276083120f35bc9beeac410435?s=60&d=mm&r=g) **[IRMacGuyver](http://ign.com)**</div>\n\n            <div class=\"comment-metadata\">[<time datetime=\"2016-06-14T15:17:11+00:00\">June 14, 2016 at 3:17 pm</time>](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-41185)</div>\n\n            <div class=\"comment-content\">\n\n            Disney submitted a paper copy of Steamboat Willie for those purposes as it was common practice for studios at the time. Today some films have been entirely lost except for their paper copies on file with the government and thus have been restored from the paper back to film. They were either submitted on paper rolls or in sheet format depending on how the studio did it at the time.\n            [http://www.edwardsamuels.com/illustratedstory/chapter%203/sneeze.jpg](http://www.edwardsamuels.com/illustratedstory/chapter%203/sneeze.jpg)\n            [http://boingboing.net/images/loc/11.jpg](https://boingboing.net/images/loc/11.jpg)\n\n            </div>\n\n            <div class=\"reply\">[Reply](https://alj.artrepreneur.com/mickey-mouse-keeps-changing-copyright-law/#comment-41185)</div>"
		},
		{
			"post_id": 16,
			"title": "‘Zombie Deer Disease’ is Spreading Across the United States – What Can You Do to Protect Yourself?",
			"date_published": 1549875067.3,
			"body": "Original source: [https://awarenessact.com/zombie-deer-disease-is-spreading-across-the-united-states-what-can-you-do-to-protect-yourself/](https://awarenessact.com/zombie-deer-disease-is-spreading-across-the-united-states-what-can-you-do-to-protect-yourself/)\n\nBy Elizabeth DeVille January 25, 2018 Environment, Health & Wellness, Science\n\n![mad-deer-disease.jpg (0x0)](data/img/post_16_mad-deer-disease.jpg)\n\nIt may sound like something out of a bad horror movie, but experts are warning that ‘Zombie Deer Disease’ is anything but. The real name for the illness is ‘[Chronic Wasting Disease](https://www.livescience.com/61504-chronic-wasting-disease-spread-humans.html)’ (CWD), and it was first discovered in Colorado in 1967\\. Progressive and fatal, the disease causes chronic weight loss leading, ultimately, to death. In other words, the animals affected are literally ‘wasting away.’\n\nOther symptoms of CWD include drooling, a ‘blank’ or absent facial expression, listlessness, tremors, lowering of the head, grinding of the teeth, lack of coordination and a lack of fear of people or other potential predators. Most commonly seen in members of the cervid (deer) family including mule deer, white-tailed deer, elk, reindeer and moose, fatalities from the disease has now been recorded in at least 22 states and parts of Canada.\n\n![cwd-map.jpg (0x0)](data/img/post_16_cwd-map.jpg)\n\nReported Cases of Chronic Wasting Disease in the United States\n[Source: CDC](https://www.cdc.gov/prions/cwd/index.html)\n\nThe disease is caused by a type of infectious protein called prions, which are not easily transferred between species, however, experts are now warning that we should be taking precautions. While prions in their original form will not easily move between different species they have been known to evolve. One classic example of this is the ‘mad cow disease’ epidemic. Originally recognized solely as a bovine disease, as the prions involved we saw it transmitted to people who ate infected meat resulting in several hundred human infections. The fear now is that CWD may be the next to follow this pattern.\n\n[](http://csu-cvmbs.colostate.edu/academics/mip/Pages/Mark-Zabel.aspx)\n\nThe disease is caused by a type of infectious protein called prions, which are not easily transferred between species, however, experts are now warning that we should be taking precautions. While prions in their original form will not easily move between different species they have been known to evolve. One classic example of this is the ‘mad cow disease’ epidemic. Originally recognized solely as a bovine disease, as the prions involved we saw it transmitted to people who ate infected meat resulting in several hundred human infections. The fear now is that CWD may be the next to follow this pattern.\n\n[Mark Zabel](http://csu-cvmbs.colostate.edu/academics/mip/Pages/Mark-Zabel.aspx), associate director of the Prion Research Center at Colorado State University advised that **_“we have every reason to suspect”_** that CWD could pass to humans. He explained that the disease **_“may still be evolving, and it may be just a matter of time before a prion evolves in a deer or elk that is capable of infecting a human.”_**\n\nConfirming this risk, the [Centers for Disease Control and Prevention (CDC)](https://www.cdc.gov/prions/cwd/index.html) shared the following statement on their website: **_“To date, there have been no reported cases of CWD infection in people. However, animal studies suggest CWD poses a risk to some types of non-human primates, like monkeys, that eat meat from CWD-infected animals or come in contact with brain or body fluids from infected deer or elk. These studies raise concerns that there may also be a risk to people. Since 1997, the World Health Organization has recommended that it is important to keep the agents of all known prion diseases from entering the human food chain.”_**\n\n## **– Always wear gloves when handling deer or deer meat**\n\n## **– Do not put any equipment used to handle or cut raw deer meat in your mouth at any time**\n\n## **– Avoid handling or cutting through the spinal cords or brains of deer**\n\n## **– Get all deer tested for CWD prior to consumption or handling their meat**\n\n## **– Do not eat the brain, spinal cord, spleen, tonsils, lymph nodes or eyes of deer**\n\n## **– Properly dispose of all infected deer meat**\n\n## **– Don’t touch, eat or handle deer urine or poop**\n\n## **– Avoid deer that are acting like zombies in any way**\n\n**If you witness any deer behaving strangely or have concerns that you have spotted a dead deer that does not appear to have an obvious cause of death, please contact your local wildlife department or health department immediately in order to allow for a proper investigation.**"
		},
		{
			"post_id": 12,
			"title": "THAILAND: Hospital accused of kidney theft after cancer misdiagnosis",
			"date_published": 1544695454.7,
			"body": " \n[Hospital accused of kidney theft after cancer misdiagnosis](https://www.bangkokpost.com/news/general/1589634/hospital-accused-of-kidney-theft-after-cancer-misdiagnosis)\n\n    7 Dec 2018 at 16:28 63 comments\n    WRITER: YUTTAPONG KUMNODNAE\n\n![1.jpg (0x0)](data/img/post_12_1.jpg)\n\nSinawaporn Homklang, 33, second right, accompanied by her 56-year-old mother, files her complaint at the Udon Thani provincial hall in Udon Thani province on Friday. (Photo by Yuttapong Kumnodnae)\n\nUDON THANI: A 33-year-old woman has accused Udon Thani Hospital of stealing her kidney during surgery to remove her womb and ovaries after a misdiagnosis that she had cancer.\n\nSinawaporn Homklang, a former employee of Prince of Songkla University in Songkhla province's Hat Yai district, outlined her complaint at the provincial hall complaints centre on Friday,\n\nShe said that on June 16 she suffered pain in her abdomen. At Hat Yai Hospital she was diagnosed with an intestinal obstruction, with a recommendation she be admitted for hospital treatment.\n\nShe decided to return to her native province of Udon Thani for treatment.\n\nThe symptoms recurred upon her arrival in Udon Thani and she sought immediate treatment at Udon Thani Hospital. A duty doctor diagnosed her with chocolate cysts (noncancerous, fluid-filled cysts) in her ovaries and intestine, and recommended an injection to dissolve them.\n\nAlthough her symptoms improved, a senior doctor arrived, diagnosed her with cancer and insisted that she needed surgery. The doctor rejected her request for an examination of a tissue sample before committing to surgery.\n\nLater, she agreed to the operation. Afterwards she was informed that her womb and ovaries were removed and her rectum relocated. Her relatives were not informed of the details during the operation, Ms Sinawaporn said.\n\nTwo weeks later the hospital informed her that she did not have cancer. She made a complaint and received 240,000 baht in compensation.\n\nOn Nov 9, she returned to Udon Thani Hospital to seek the restoration of her rectum. A doctor there warned her she should not work too hard because she had only one kidney left. She was very surprised and wondered if her kidney was taken for any vested interest.\n\nMs Sinawaporn said she was the sole breadwinner of her family and now she could neither work hard nor have a baby. Her Singaporean boyfriend, who had planned to marry her next year, was distancing himself from her.\n\nThe director of the hospital, Dr Narong Tadadet, said the missing kidney complaint was new and would be investigated."
		},
		{
			"post_id": 11,
			"title": "[리얼미터] \"오늘밤 김제동 방송 논란···文지지율 40%대 하락에 영향\"",
			"date_published": 1544662445.7,
			"body": "<div class=\"clearfx\">\n\n출처: [[리얼미터] \"오늘밤 김제동 방송 논란···文지지율 40%대 하락에 영향\"](https://news.joins.com/article/23202624)\n\n_[중앙일보]_ _입력 2018.12.12 12:21_ _수정 2018.12.12 16:35_\n\n**[정은혜 기자](https://news.joins.com/reporter/1874)**\n\n<div id=\"article_body\" itemprop=\"articleBody\" class=\"article_body mg fs4\">\n\n<div class=\"ab_photo photo_center \" style=\"width: 560px;\">![e32f5773-9cab-4dfb-a810-685e8e7f57d9.jpg (0x0)](data/img/post_11_e32f5773-9cab-4dfb-a810-685e8e7f57d9.jpg)방송인 김제동이 9월 12일 KBS 시사 토크쇼 '오늘밤 김제동' 기자간담회에서 질문에 답하고 있다. [연합뉴스]</div>\n\n편파 논란에 휩싸인 KBS 1TV 시사토크쇼 ‘오늘밤 김제동’이 문재인 대통령의 국정 수행 지지율을 40%로 끌어내렸다는 분석이 나왔다.\n\n10일 여론조사 전문기관 리얼미터는 YTN 의뢰로 지난 3일부터 7일까지 조사한 결과 문재인 대통령에 대한 지지율이 전주 대비 1.1%포인트 오른 49.5%를 기록했다고 밝혔다. 리얼미터에 따르면 ‘잘못하고 있다‘는 부정평가는 1.4%포인트 떨어진 45.2%였으며 ‘모름/무응답’은 0.3%포인트 오른 5.3%였다.\n\n리얼미터에 따르면 문 대통령의 지지율은 지난 3~5일 주중집계 기간 동안 자연적 조정(회귀) 효과와 김정은 북한 국무위원장의 서울 답방 가능성 보도 등에 따라 50%를 기록하며 회복세에 접어들었다.\n\n그러나 결국 40% 후반으로 다시 떨어졌고, 리얼미터 측은 ‘오늘밤 김제동’의 영향이 있었다고 분석했다. “(이 프로그램의) ‘김정은 위인맞이 환영단’ 인터뷰를 두고 논란이 확대되었던 지난주 후반에 다시 40%로 떨어진 것으로 조사됐다”는 것이다.\n\n<div class=\"ab_photo photo_center \" style=\"width: 578px;\">\n\n<div class=\"image\">![df690e81-63d3-4901-b7b0-f79106401112.jpg (0x0)](data/img/post_11_df690e81-63d3-4901-b7b0-f79106401112.jpg)</div>\n\nKBS의 시사프로그램 '오늘밤 김제동'에 출연한 김수근 위인맞이환영단장이 북한의 3대 세습에 대한 질문에 \"시진핑 주석과 푸틴 대통령도 20년 넘게 집권했는데 왜 세습이라고 비판하지 않느냐\"며 반문하고 있다. [사진 KBS]\n\n</div>\n\n‘오늘밤 김제동’은 지난 4일 ‘김정은 위인 맞이 환영단’의 김수근 단장 인터뷰를 여과없이 내보내면서 김 위원장 찬양 방송을 했다는 논란에 휩싸였다. 이날 방송에서 김씨는 “(김 위원장의) 겸손하고, 지도자의 능력과 실력이 있고, 지금 (북한) 경제발전이나 이런 모습을 보면서 정말 팬이 되고 싶었다”고 말했다.\n\n취재진의 ‘북한 세습과 인권 문제’에 대한 질문에는 “박정희 전 대통령 이후에 박근혜 전 대통령도 대통령이 되고, 시진핑이나 푸틴은 20년 넘게 하는데 그럼 왜 거기는 세습이라고 이야기 안 하느냐”고 반문하기도 했다.\n\n<div class=\"\" style=\"width: 250px; height: 250px; float: right; clear: both; margin-left: 20px;\" id=\"criteo_network\">\n\n<div id=\"imp_ad_da_250_1\">\n\n<div id=\"7TzXV_PfR6u5epgxyPjtOA\"><iframe src=\"https://ad.imp.joins.com/html/joongang_p/article/article@article_body_250x250?_cid=7TzXV_PfR6u5epgxyPjtOA&amp;_uid=kojLT2fM45QgaVEk7dxIABxSeh1iQlyKBo9yaqZDenKEAM4qWzAZAbZTV2ZQN2RoVFNnVzc1dHh3aHlEWldBAstB1wRmXc-QywPLQdcEZl3PkMs&amp;_ref=https://news.joins.com/article/23202624\" name=\"mliframe\" scrolling=\"no\" topmargin=\"0\" leftmargin=\"0\" marginwidth=\"0\" marginheight=\"0\" width=\"250px\" height=\"250px\" frameborder=\"0\"></iframe></div>\n\n</div>\n\n</div>\n\n해당 방송에 대해서는 시청자들 뿐 아니라 KBS 공영노동조합, 정치권도 나서서 비판했다. KBS 공영노동조합는 지난 5일 성명을 통해 “공영방송 KBS가 보도할 내용이 맞는가. 마치 북한 중앙방송을 보고 있는 것 같았다”며 “국가 기간방송이 어떻게 현행법에 반국가 단체로 규정된 북한의 김정은을 일방적으로 찬양하는 발언을 그대로 방송하는가”라고 지적했다.\n\n6일 국회 과학기술정보방송통신위원회 박대출(자유한국당) 의원은 보도자료를 내고 “KBS를 남조선중앙방송으로 만들 참이냐”고 지적했다. 그는 “‘오늘밤 김제동’은 뉴스라인을 폐지하고 확대 편성된 프로그램으로 시작 때부터 정치 편향 논란을 샀다. 당장 폐지하라”고 촉구했다.\n\n앞서 문 대통령의 지지율은 평양 남북정상회담 직후인 9월 4주차에 65.3%를 기록한 이후 11월 4주차까지 49.4%로 떨어지는 등 두 달동안 하락했다. 12월 1주차에 문 대통령의 지지율이 소폭 반등하면서 9주에 걸친 하락세가 멈춘 것으로 분석됐다.\n\n정은혜 기자 jeong.eunhye1@joongang.co.kr\n\n</div>\n\n[출처: 중앙일보] [리얼미터] \"오늘밤 김제동 방송 논란···文지지율 40%대 하락에 영향\"\n\n</div>"
		},
		{
			"post_id": 10,
			"title": "CHINA: Human rights group \"The Uighur oppression is the leading act of genocide\" 人权组织“维吾尔族镇压是集体屠杀的先导行动”",
			"date_published": 1544499531.2,
			"body": "Human rights group \"The Uighur oppression is the leading act of genocide\"\n입력 2018.12.07\\. 15:33\nThe copyright belongs to the original writer of the content, and there may be errors in machine translation results.\nWe urge Western countries to \"stop normal relations with China until they stop oppression.\"\n\nReporter Jung Jae-yong (Seoul = Yonhap News) warned that Uighur human rights groups working in the United States could be a \"leading act leading to genocide\" against the Chinese authorities' oppression of Uighur Muslims.\n\nThey also urged Western countries to stop \"normal relations\" with China until China stopped the Uighur Muslim oppression.\n\nLeaders of the Uighur Human Rights Project (UHRP), a human rights organization based in Washington, U.S., said this during a visit to Australia, the Guardian reported on Tuesday.\n\n![1.jpg (0x0)](data/img/post_10_1.jpg)\n\nguardian photograph capture\n\nThey argued that governments, business circles, academia, and think tanks in the Western world are all responsible for stopping normal relations with China.\n\n\"It's time to act,\" said UHRP chairman Nuri Turkel. \"It's a terrible thing happening in front of our eyes.\"\n\nSince last year, the Chinese authorities have been operating a \"retraining camp\" for Muslims in the Uighur Autonomous Region of Xinjiang (Yuygur).\n\nAbout one million Uighur Muslims have been retrained in retraining camps, media reports said.\n\nPreviously, the Chinese authorities provided legal grounds for establishing and operating retraining camps through the \"Act on Extreme Extreme Disciplines in the Shinjang Uighur Autonomous Region\" enacted on October 9th.\n\nThe law stipulates that \"local governments can set up, operate and supervise educational and edifying institutions such as vocational training centers to edify those affected by extremism.\"\n\nThe operation of the retraining camps of the Xinjiang Uygur Autonomous Region has emerged as a strong criticism from UN human rights officials and Western countries.\n\nThe United Nations Racist Committee urged the Chinese government to immediately release Uighur Muslims detained in retraining camps in August.\n\nHowever, the Chinese authorities are actively advocating that the retraining camps are necessary to respond to terrorism and extremism, and that they are \"humanitarian vocational education centers.\"\n\nIn an interview with China's official Xinhua News Agency on October 16, Xinjiang Uygur Autonomous Region's Shakeridi Chakkerer defended the retraining camps for Uighur Muslims as \"a vocational education center that provides opportunities for various lives\" and \"a humanitarian and legitimate shield against terrorism\"\n\nFurthermore, media reports have recently reported that the repression of Chinese authorities targeting Muslims is spreading beyond Xinjiang Uygur Autonomous Region to Ningxia (Hui) Autonomous Region, another Muslim group residence.\n\nJjy@yna.co.kr\n\n人权组织“维吾尔族镇压是集体屠杀的先导行动”\n입력 2018.12.07\\. 15:33\n版权归内容原作者所有。机器翻译结果可能存在错误。\n○西方国家敦促中国停止镇压,中断与中国的正常关系\n\n(首尔=联合新闻)郑在容记者=在美国活动的维吾尔族人权团体对中国当局的“威吾尔族伊斯兰教徒镇压”警告说:“这可能是导致集体屠杀的先导性行动。”\n\n同时,他们还敦促中国停止与中国的\"正常关系\",直到中国停止对维吾尔族伊斯兰教的镇压为止。\n\n英国《卫报》7日报道说,总部设在美国华盛顿的人权团体维吾尔人权项目(UHRP)的领导人在访问澳大利亚时表明了上述立场。\n\n![1.jpg (0x0)](data/img/post_10_1.jpg)\n《卫报》摄影截图\n\n他们主张,西方世界各国政府、财界、学术界、智囊团都有责任中断与中国的正常关系。\n\nUHRP的会长\"现在行动的时候\",\"可怕的事情发生在我们眼前\"会长努里·图克尔。\"\n\n中国当局从去年开始在新疆维吾尔自治区内的伊斯兰教徒开设了“再教育收容所”。\n\n大约100万名维吾尔族穆斯林被收容在重新教养所接受再教育的媒体报道。\n\n此前,中国当局通过10月9日生效的《新长维吾尔自治区反极端主义法》,制定了可以设置和运营再教育收容所的法律依据。\n\n该法律规定,\"为了教化受到极端主义影响的人,可以设立像职业培训所一样的教育、教化机构,并进行监督。\"\n\n新疆维吾尔自治区当局的再教育收容所的运营成为了联合国人权相关人士和西方国家的强烈批判对象。\n\n联合国种族歧视委员会敦促中国政府立即释放今年8月被关押在重教所的维吾尔族穆斯林。\n\n但是,中国当局主张,重新教养收容所是应对恐怖主义和极端主义的必要条件,并积极主张\"人道主义职业教育中心\"等。\n\n今年10月16日发行的中国官方媒体新华社采访中,新疆维吾尔自治区主席辛克尔曾主张,\"为维吾尔族穆斯林等人提供多彩的生活机会的职业教育中心\"、\"为了对抗恐怖主义的人道主义、合法的盾牌\"。\n\n更进一步,最近有媒体报道称,针对伊斯兰教徒的中国当局的镇压正在扩散到新疆维吾尔自治区,另一个伊斯兰教集体居住区宁夏回族自治区。\n\njjyyna.co.kr"
		},
		{
			"post_id": 9,
			"title": "CHINA: The protest against the Tibetan oppression in China ..154 \"Unknown life\" 在中国,抗议西藏镇压的第154个“生死不明”",
			"date_published": 1544498810.8,
			"body": "The protest against the Tibetan oppression in China ..154 \"Unknown life\"\n이재준 입력 2018.12.11\\. 10:50\nThe copyright belongs to the original writer of the content, and there may be errors in machine translation results.\n\n![1.jpg (0x0)](data/img/post_9_1.jpg)\n[Seoul = NewSys] Tibetan resistance against the coercion of China is constantly being urged to reconcile the nation and the suicide suicide of Tibetan monk is known and impressed.,On the 16th, the 6th anniversary of the \"Ava Butcher Day,\" the Buddhist monk Luo Du-dan (20), who committed suicide near the temple of Aba Prefecture,\n\n[Seoul = NewSys] Lee Jae-joon Reporter = A Tibetan man in his 20s tried to protest against the oppression of Chinese authorities, the Central News Agency reported on November 11.\n\nA Tibetan man named \"Zu Qi ()\" burned his body as a sign of dissatisfaction with China's recent persecution in Aba Prefecture, a Tibetan and Zhang Autonomous Prefecture of Sichuan Province, China.\n\nThe life and death of Tibetan men has not yet been confirmed, and it is the 154th protest in China since 2009, the correspondent said.\n\nThe police immediately blocked the site and blocked contact with the outside, while strengthening surveillance of the surrounding Hyunjin Village (Non-Hyangchon) and controlling the freedom of the Tibetan monks and residents.\n\nIn the Ava Autonomous Region of Sichuan Province, Tibetan protests followed, and the Tibetans committed 154 suicides, of which 132 were killed.\n\nJuquo is the third insurgent of the year and the 42nd in Abba Prefecture.\n\nThe 10th was the 29th anniversary of the Nobel Peace Prize of the Tibetan Buddhist leader, Dalai Lama 14.\n\nChinese authorities have recently been working on removing the Dalai Lama portraits from Tibetan settlements and forcing them to take portraits of Mao Zedong () and Xi Jinping () instead of removing the Dalai Lama pictures from the Buddhist temples in Tibetan houses.\n\nyjs@newsis.com\n\n在中国,抗议西藏镇压的第154个“生死不明”\n이재준 입력 2018.12.11\\. 10:50\n版权归内容原作者所有。机器翻译结果可能存在错误。\n\n![1.jpg (0x0)](data/img/post_9_1.jpg)\n首尔:抗议中国强压统治的西藏人的抵抗不断,在这种情况下,敦促民族和解、自焚的西藏僧侣的遗书被传开,让人感动不已。,图为,本月16日迎来“阿巴宰杀日”6周年之际,在阿巴贤巨蛋寺附近自杀的该寺院僧侣“双班团”(20岁)。,(照片来源:博)\n\n首尔=据中央通讯社11日报道,20多岁的藏族男性抗议中国当局的镇压,试图自焚。\n\n据新华社报道,8日,在中国八星阿巴藏族藏族·藏族自治州阿巴县,一名名为“珠格”的藏族男子对最近加强的中国迫害表示不满,并对自己的身体起火。\n\n据新华社报道,目前尚未确认藏族男性的生死情况,是自2009年以来在中国发生的第154次自焚抗议。\n\n阿巴县警方立即封锁了焚身现场,并切断了与外界的联系,同时加强了对周边玄真乡村的监视,控制了藏族僧侣和居民的言论自由。\n\n在四川省,接连发生了藏族抗议自焚事件。,此前,藏族共进行了154次自焚,其中132人死亡。\n\n这是今年第3次自焚,也是第42次自焚。\n\n10日是西藏佛教最高领导人达赖喇嘛14岁获得诺贝尔和平奖29周年纪念日。\n\n近来,中国当局针对藏族居住地展开了清除达赖喇嘛肖像的工作,并强迫在藏族家里的佛堂上挂上前主席毛泽东和国家主席习近平的肖像。\n\nyjjsnewsis.com"
		},
		{
			"post_id": 8,
			"title": "CHINA: Police, raid the underground church, arrest 100 pastors and believers. 警方、地下教会突袭,逮捕了100多名牧师和信徒。",
			"date_published": 1544496713,
			"body": "Police, raid the underground church, arrest 100 pastors and believers.\n입력 2018.12.11\\. 11:00\nThe copyright belongs to the original writer of the content, and there may be errors in machine translation results.\nThis year, 10,000 Christians in China are detained.\n\n![1.jpg (0x0)](data/img/post_8_1.jpg)\nSCMP Capture of the Chinese Underground Church\n\nAhn Seung-seop, a correspondent for the Hong Kong-Yongan News (Yongan News)- The South China Morning Post (SCMP) reported on November 11 that Chinese police raided an underground church without permission from the authorities and arrested more than 100 people including pastors and believers.\n\nAccording to SCMP, the police in Chengdu (Sung) in Sichuan, China raided the cold church (Cold) which is one of China's most famous underground churches, and arrested more than 100 believers including the pastor, King.\n\nPolice raided the house of the church and dragged the believers, or arrested the believers on the streets throughout the city.\n\nSome believers were asked by the police to sign a pledge that they would no longer attend this church.\n\nA deacon at the church said, \"The police said our church is an illegal organization and can not participate in any rallies in the future.\"\n\nFounded in 2005, the Cold Testament Church is famous for its open missionary church, unlike other underground churches in China, which secretly act to avoid the crackdown of the authorities.\n\n\"We will continue our religious activities even if the last five believers remain,\" said Lee, a member of the church. \"We hope more Chinese churches will rise and raise their voices.\"\n\nSince Chinese President Xi Jinping took power in late 2012, the suppression of underground churches, which have not been under the control of the authorities in China, is strengthening.\n\nMoreover, since February this year, the 'Religious Ordinance', which strengthens the requirements of religious organizations and religious activities in China, has been implemented, and the intensity of the oppression is increasing.\n\nThe new ordinance strengthens surveillance of religious and religious groups, and imposes a large fine if it provides a place for illegal religious events.,It also included the cancellation of the authorization when an unapproved educational facility was used for religious activities.\n\nAccording to the US human rights group China Aid, the number of Christians in China, which was detained this year, reached 10,000, more than three times last year, which was 3,000.\n\nIn September, the Zion Church, the largest underground church in Beijing, was closed, and 4,000 church crosses were demolished in Henan Province.\n\nsahn@yna.co.kr\n\n저작권자(c)연합뉴스. 무단전재-재배포금지\n\n警方、地下教会突袭,逮捕了100多名牧师和信徒。\n입력 2018.12.11\\. 11:00\n版权归内容原作者所有。机器翻译结果可能存在错误。\n今年,中国基督教徒被拘留10000人。\n\n![1.jpg (0x0)](data/img/post_8_1.jpg)\n中国地下教会SCMP捕获\n\n(香港=联合新闻)特派员安承燮=香港《南华早报》(SCMP)11日报道说,中国警方突袭了未经当局批准的地下教会,逮捕了牧师和信徒等100多人。\n\n据SCMP透露,中国三省成都市警察于本月9日突袭了中国最有名的地下教会之一的寒冷圣约教会,逮捕了包括牧师王在内的100多名信徒。\n\n警方还突袭了该教会信徒的家,或者在市内各处的街道上逮捕了信徒。\n\n一些信徒被要求签署誓言,他们不再去教堂了。\n\n该教会的一位执事表示:\"警方表示,我们的教会是非法组织,今后不能参加任何集会。\"\n\n2005年成立的\"寒冷圣约教会\"与逃避当局管制而偷偷活动的中国其他地下教会不同,以公开传教活动著称。\n\n该教会的信徒李英昌表示:\"我们即使剩下最后五名信徒,也会继续进行信仰活动\",\"希望更多的中国教会能够站起来提高声音\"。\n\n中国国家主席习近平在2012年底执政以后,中国国内对当局控制之下的地下教会的镇压正在加强。\n\n更何况,从今年2月开始,随着加强中国国内宗教团体和宗教活动条件的\"宗教事务条例\"的实施,其镇压强度进一步提高。\n\n新条例规定,加强对宗教人士和宗教团体的监视,如果向非法宗教活动提供场所,将处以巨额罚款。,如果未认可的教育设施被用于宗教活动,还包括取消许可的内容。\n\n据美国人权团体\"中国人\"透露,今年被拘留的中国国内基督教徒人数达到1万多人,超过了去年的3倍。\n\n今年9月,北京最大的地下教会锡安教会被关闭,河南省也拆除了4000多个教会十字架。\n\nsahnyna.co.kr"
		},
		{
			"post_id": 7,
			"title": "\"육즙까지 똑같은 맛\"..식물로 만든 '가짜고기' 한국상륙",
			"date_published": 1544438551.6,
			"body": "### \"육즙까지 똑같은 맛\"..식물로 만든 '가짜고기' 한국상륙\n\n<span class=\"info_view\"><span class=\"txt_info\">김보라</span> <span class=\"txt_info\">입력 2018.12.09\\. 17:45</span> <span class=\"txt_info\">수정 2018.12.10\\. 03:53</span></span>\n\n<div id=\"cMain\" style=\"\">\n\n<div id=\"mArticle\" class=\"hcg_media_pc_mArticle\">\n\n<div class=\"news_view\" style=\"font-size:17px\">**동원F&B, 美비욘드미트 독점계약..내년 초 판매\n콩·버섯 등 식물성 단백질로 배양..형태까지 재현\n푸드테크의 총아\n세계 95억명 인구 먹여 살릴 미래 식량 각광\n진짜 고기보다 단백질·철분 많고 콜레스테롤은 낮아\n제이영헬스케어는 '콩고기' 기술 확보 내년 햄·소시지 판매**\n\n<div id=\"harmonyContainer\" class=\"article_view\" data-translation-body=\"\">\n\n[ 김보라 기자 ] 100% 식물성 단백질로 만들었지만 고기와 거의 똑같은 맛을 내는 ‘비욘드미트’가 한국에 상륙한다. CJ제일제당, 신세계푸드 등 종합식품기업이 눈독들이던 이 시장에 가장 먼저 깃발을 꽂는 건 동원F&B다.\n\n동원그룹 고위 관계자는 9일 “미국 대체육 시장을 주도하고 있는 비욘드미트와 지난달 독점 공급계약을 맺고, 내년 초 정식 유통을 시작한다”고 밝혔다. 비욘드버거(패티), 비욘드치킨스트립, 비욘드비프크럼블 등 3종을 우선 공급한다. 비욘드미트는 콩, 버섯, 호박 등에서 추출한 식물성 단백질을 효모, 섬유질 등과 배양해 고기의 맛과 형태, 육즙까지 재현한 대체육을 생산한다. 2009년 설립돼 빌 게이츠, 리어나도 디캐프리오 등 유명 인사와 미국 최대 육가공 업체 타이슨푸드의 투자를 받았다. 동원F&B는 미래 식량으로 주목받고 있는 대체육 시장을 선점하고 장기적으로 이 분야에서 독보적인 기술력을 확보하겠다는 로드맵을 세웠다.\n\n![1.jpg (0x0)](data/img/post_7_1.jpg)\n\n**식물성 고기…대체육은 왜 뜨나**\n\n고기 없이 만드는 고기, 즉 대체육 시장은 미국에서 약 7~8년 전부터 형성됐다. 대체육이 등장한 배경에는 인구 증가가 있다. 유엔식량농업기구에 따르면 세계 인구는 2050년엔 지금보다 20억 명 증가한 95억 명에 달할 것으로 보인다. 매년 2억t 이상의 육류 단백질이 추가로 필요하다는 계산이 나온다. 현재의 공장식 축산 방식으로는 환경 오염과 동물 학대 등의 논란을 피하기 어렵다. 건강상 또는 도덕적인 이유로 채식주의자(비건)가 된 사람에게도 대체육은 반드시 필요한 영역이다.\n\n이 때문에 실리콘밸리 스타트업(신생 벤처기업)은 일찌감치 식품과 기술을 결합한 ‘푸드 테크’에 주목했다. 대체육 시장은 △곤충식품 △식물 기반의 대체육 △줄기세포 등을 활용해 축산·도축을 하지 않는 배양육 등 세 분야로 나뉜다.\n\n이 중 가장 활성화된 시장은 식물 기반의 대체육 시장이다. 곤충은 혐오감 때문에 성장이 더디고, 줄기세포 배양육은 가격이 높아 아직 상용화되지 못했다. 닭 없이 달걀을 만드는 ‘햄튼크릭’, 식물의 헤모글로빈을 추출해 식물성 고기를 생산하는 ‘임파서블푸드’, 동물 줄기세포를 근육조직으로 분화시켜 고기를 배양하는 ‘멤피스미트’ 등이 시장을 이끌고 있다. 지난해 세계 대체육 시장 규모는 42억달러였지만 2025년엔 75억달러까지 성장할 전망이다.\n\n**육즙·향·식감 살린 ‘고기 없는 고기’**\n\n![2.jpg (0x0)](data/img/post_7_2.jpg)\n\n\"나는 원래 쉽게 속지 않는 사람인데, 한입 먹는 순간 진짜 치킨의 맛과 식감을 느꼈다\" 빌 게이츠\n\n비욘드미트는 기존 식물성 고기로 알려진 콩고기와는 전혀 다르다. 콩고기는 콩을 갈아 글루텐으로 굳힌 것. 비욘드미트는 일반 고기에 비해 철분, 단백질은 많고 포화지방과 콜레스테롤은 매우 낮다. 식감과 맛, 향, 육즙까지 고기와 비슷하다. 또 항생제를 사용하지 않고 환경호르몬이 없어 안전성도 담보된다. 빌 게이츠는 비욘드미트를 맛본 뒤 “나는 원래 쉽게 속지 않는 사람인데, 한입 먹는 순간 진짜 치킨의 맛과 식감을 느꼈다”며 “차이를 전혀 알 수 없는 고기 대체품 그 이상이었다”고 말하기도 했다.\n\n동원F&B가 출시하는 대표 제품은 소고기맛 햄버거 패티 ‘비욘드버거’다. 2016년 출시돼 지금까지 2500만 개 이상 팔렸다. ‘비욘드치킨스트립’은 큼직한 순살치킨 형태로 맛과 식감이 구운 닭고기와 비슷해 샌드위치나 샐러드 등에 쓰인다. ‘비욘드비프크럼블’은 소고기를 잘게 다져 밑간을 한 형태의 제품으로 토마토소스 등에 버무려 파스타나 샌드위치를 만들기 좋다. 동원 관계자는 “건강을 중시하고 환경, 미래를 생각하는 밀레니얼 세대의 식문화를 감안하면 국내에서도 대체육 시장의 성장 가능성이 높다고 판단했다”고 말했다.\n\n**전통 축산업 위협할까**\n\n비욘드버거 가격은 미국에서 일반 소고기버거보다 2달러 정도 비싸다. 채식주의자가 아니더라도 건강과 환경을 생각하는 소비자에게 2달러는 큰 비용이 아니라는 게 업계 분석이다. 인류의 ‘육식 역사’를 뒤집어 놓는다는 점에서 ‘궁금증에 의한 소비’도 적지 않다.\n\n대체육은 바이오 분야 투자로 이어지고 있다. 바이오벤처기업 제이영헬스케어는 콩 단백질 구조를 자르고 붙여서 소나 닭 돼지 칠면조 등 원하는 육류의 원하는 분위로 변형시키는 압출 성형 기술을 보유하고 있다. 미국 헤리티지헬스푸드에서 관련 기술을 이전받았고, 아시아 시장 판권도 확보했다. 회사 관계자는 “조만간 헤리티지헬스푸드의 햄과 소시지, 버거 패티 등을 들여와 직접 판매할 예정”이라며 “전문 레스토랑을 열고 도시락 시장에도 진출할 계획”이라고 밝혔다.\n\n대체육이 채식주의자를 위한 시장이라고 생각하면 오산이다. 문정훈 서울대 농경제사회학부 교수는 “식물성 단백질의 핵심 가치는 ‘채식’이 아니라 ‘고기’에 방점이 있다”며 “고기를 먹기 위해 축산을 해야 하고, 축산으로 환경이 훼손되는 데 죄책감을 느끼는 사람들이 지속가능한 식품 소비를 위한 하나의 카테고리로 대체육 시장을 바라보게 될 것”이라고 전망했다.\n\n김보라 기자 destinybr@hankyung.com\n\n</div>\n\n</div>\n\n<div class=\"foot_view\">\n\n<div class=\"copyright_view\"><span class=\"txt_copyright\">Copyrights 한경닷컴, 무단 전재 및 재배포 금지</span>\n</div>\n\n</div>\n\n</div>\n\n</div>"
		},
		{
			"post_id": 6,
			"title": "감자 많이 먹으면 당뇨병 위험 높아진다 (일본 연구진)",
			"date_published": 1544330602.5,
			"body": "[https://www.huffingtonpost.kr/2016/01/01/story_n_8902018.html](https://www.huffingtonpost.kr/2016/01/01/story_n_8902018.html)\n\n<div class=\"timestamp\"><span class=\"timestamp__date timestamp__date--published\">2016년 01월 01일 11시 27분 KST</span> <span class=\"timestamp__separator\">|</span> <span class=\"timestamp__date timestamp__date--modified\">**업데이트됨** 2016년 01월 01일 11시 27분 KST</span></div>\n\n<div class=\"author-byline yr-byline\" data-rapid-subsec=\"byline\">\n\n# 감자 많이 먹으면 당뇨병 위험 높아진다 (일본 연구진)\n\n<div class=\"author-card__details\"><span class=\"author-card__microbio\">연합뉴스</span></div>\n\n</div>\n\n<div class=\"post-contents yr-entry-text\" id=\"entry-text\" data-rapid-sec=\"{&quot;entry-text&quot;:&quot;entry-text&quot;}\">\n\n감자를 많이 먹을수록 성인(2형) 당뇨병에 걸릴 위험이 높아진다는 연구결과가 나왔다.\n\n특히 찌거나 구운 감자보다는 썰어서 기름에 튀긴 '프렌치 프라이'의 위험도가 더 높다고 의학 전문 사이트 메드스케이프 등이 보도했다.\n\n![1.jpg (0x0)](data/img/post_6_1.jpg)\n\n일본 '오사카 암 및 심혈관질환 예방센터'의 무라키 이사오 박사 팀은 미국의 간호사나 의사 등 보건 관련 직업인들을 대상으로 조사한 방대한 데이터 등을 분석 평가한 결과 [이같이 나타났다는 내용의 논문을 미국당뇨학회 '당뇨관리' 최신호에 게재했다.](http://care.diabetesjournals.org/content/early/2015/12/09/dc15-0547)\n\n이 논문에 따르면, 1주일에 2~4회 감자를 먹은 사람들은 1회 이하 먹은 사람들에 비해 2형 당뇨병에 걸릴 위험이 평균 7%, 1주 7회 이상 먹은 사람들은 33%나 높아졌다.\n\n특히 감자를 잘게 썬 뒤 기름에 튀긴 일명 프렌치 프라이가 가장 건강에 좋지 않았다.\n\n1주 3회 감자를 먹은 사람 중에서 굽거나 찌거나 으깬 감자를 먹은 사람이 당뇨 걸릴 위험은 1회 이하 섭취자에 비해 4% 높아진 반면 프렌치 프라이로 먹은 사람의 경우 19% 높았다.\n\n![2.jpg (0x0)](data/img/post_6_2.jpg)\n\n_미국 당뇨학회 학술지 '당뇨관리'에 실린 해당 논문 초록._\n\n이사오 박사는 \"미국 정부의 건강식 지침'엔 감자가 채소로 분류돼 있으나 감자는 곡식처럼 탄수화물(또는 당질(糖質)) 공급원의 하나이며, 특히 채소라기보다는 흰쌀처럼 정제한 곡물로 봐야 한다는 점을 이번 연구가 재삼 시사한다\"고 지적했다.\n\n그는 \"감자에는 전분이 많지만 상대적으로 섬유질, 비타민, 미네랄, 폴리페놀 등이 적다\"며 \"질 낮고 양이 많은 탄수화물(당질)은 2형 당뇨와 관계있으며, 게다가 뜨거운 전분은 소화가 빨리돼 혈액 속 포도당 수준을 급격히 올라가게 한다\"고 밝혔다.\n\n그러면서 당뇨에 걸리지 않으려면 탄수화물(당질) 섭취원으로 가공하지 않은 통곡식, 견과류, 과일, 채소 등을 많이 먹는 게 좋다고 권고했다.\n\n미국 농무부의 '식생활지침'(MyPlate)이나 '여성과 영유아, 어린이를 위한 특별 보충 영양 프로그램 리뷰' 등은 감자를 '건강에 좋은 채소'로 분류하는 반면에 영국 국가보건의료기구인 국민건강보험(NHS)의 '식생활지침'(Eatwell plate)은 설명자료에서 감자를 '곡물'로 분류한다.\n\n<div id=\"entry_paragraph_4\" data-label-height=\"50\" class=\"advertisement-holder entry-paragraph-ad entry-body--paragraph-ad ad-visible\">한편 연구팀이 분석에 사용한 미국의 기본 자료는 7만773명의 여성을 대상으로 조사한 '간호사 건강 연구' (1984~2010), 8만7천739명이 조사 대상인 '간호사 건강연구 Ⅱ'(1991?2011), 보건 관련 직업 남성 4만669명을 조사한 '건강 관련 직업인들에 대한 추적 연구'(1986~2010) 등이다.\n</div>\n\n또 398만8천여 명을 대상으로 4년 동안 감자 소비량과 건강 등을 추적 조사한 결과 등을 분석했다.\n\n나이나 성 등 인구학적 요인, 생활양식, 다른 음식으로 먹은 탄수화물 섭취량 등 변수들을 제거·조정한 뒤 당뇨 유병 위험률을 계산했다.\n\n이번 연구에서 감자 총섭취량에 감자칩은 포함되지 않았는데, 당초 기존 데이터들에 사용된 설문이 감자칩과 옥수수칩(콘칩) 섭취를 한데 묶어 물었기 때문에 제외했다고 연구팀은 설명했다.\n\n</div>\n\n<div class=\"yr-entry-footer\" id=\"entry-footer\" data-rapid-sec=\"{&quot;entry-footer&quot;:&quot;entry-footer&quot;}\"><a class=\"follow-us__correction\" data-post-origin=\"mt\" data-post-id=\"8902018\" data-edition=\"kr\" id=\"suggest-corrections\" data-popup-target=\"#corrections_container\" data-rapid_p=\"1\" data-v9y=\"1\">정정 제보</a>\n\n<div class=\"author-byline author-byline--footer\">\n\n*   <div class=\"author-card__details\"><span class=\"author-card__microbio\">연합뉴스</span></div>\n\n</div>\n\n</div>"
		},
		{
			"post_id": 5,
			"title": "여기는 자전거 은행?",
			"date_published": 1544152888.4,
			"body": "### 여기는 자전거 은행?\n\n<span class=\"info_view\"><span class=\"txt_info\">입력 2018.12.06\\. 22:11</span></span>\n\n![](data:,)\n\n<div id=\"cMain\" style=\"\">![20181206221155191lcsu_.jpg (0x0)](data/img/post_5_20181206221155191lcsu_.jpg)\n\n<div id=\"mArticle\" class=\"hcg_media_pc_mArticle\">\n\n<div class=\"news_view\" style=\"font-size:17px\">중국 안후이성 허페이에서 공무원들이 자전거를 공유자전거 임시 보관소로 옮기고 있다. / 2018년 12월 3일, 중국 허페이\n</div>\n\n<div class=\"foot_view\">\n\n**관련 태그**\n\n<div class=\"copyright_view\"><span class=\"txt_copyright\">REUTERS/ Thomas Peterer ⓒ로이터, 무단전재 및 재배포 금지</span></div>\n\n</div>\n\n</div>\n\n</div>"
		},
		{
			"post_id": 2,
			"title": "체코, 이동식 전기차 충전소",
			"date_published": 1544150911.9,
			"body": "체코, 이동식 전기차 충전소\n\n입력 2018.12.06\\. 17:26\n\n<div id=\"cMain\" style=\"\">\n\n<div id=\"mArticle\" class=\"hcg_media_pc_mArticle\">\n\n<div class=\"news_view\" style=\"font-size:17px\">\n\n<div id=\"harmonyContainer\" class=\"article_view\" data-translation-body=\"\">![20181206172641139aejy.jpg (0x0)](data/img/post_2_20181206172641139aejy.jpg)\n\n체코 프라하의 거리에서 한 배달원이 뒤쪽에 이동식 전기차 충전기를 매단 채 자전거를 타고 가고 있다. 체코는 전 세계에서 전기자동차의 에너지원이자 '미래의 석유'라 불리는 천연 리튬의 약 3%에 달하는 양을 보유하고 있으며, 작년에 체코에서 유럽 최대의 리튬 광맥이 발견되기도 했다. / 2018년 12월 4일, 체코 프라하\n\nREUTERS/ David W Cerny\n\nⓒ로이터, 무단전재 및 재배포 금지\n\n</div>\n\n</div>\n\n<div class=\"foot_view\">\n\n<div class=\"relate_tag hc_news_pc_mArticle_relatedTags\">**관련 태그**</div>\n\n<div class=\"copyright_view\"><span class=\"txt_copyright\">REUTERS/ Thomas Peterer ⓒ로이터, 무단전재 및 재배포 금지</span></div>\n\n</div>\n\n</div>\n\n</div>"
		},
		{
			"post_id": 1,
			"title": "아침에 먹은 계란·두부, 저녁 꿀잠의 묘약이 됩니다",
			"date_published": 1544067497,
			"body": "<span class=\"info_view\"><span class=\"txt_info\">조선일보 / 도쿄/김철중 의학전문기자</span> <span class=\"txt_info\">입력 2018.12.06\\. 03:07</span></span>\n\n[https://news.v.daum.net/v/20181206030757395](https://news.v.daum.net/v/20181206030757395)\n\n<div class=\"news_view\" style=\"font-size:17px\">**[오늘의 세상] 일본 수면교육기구의 숙면 비법**\n\n<div id=\"harmonyContainer\" class=\"article_view\" data-translation-body=\"\">\n지난달 25일 일요일 아침 일본 도쿄 연수센터빌딩 5층 강당에 기자를 포함하여 120여명이 '잠 잘자는 법'을 교육받으러 모였다. 일본수면교육기구(機構)가 주최하는 수면 건강 지도자 양성 코스다. 이비인후과·정신과·뇌신경학자 등이 모여 만든 수면교육기구는 도쿄·나고야·고베 등을 돌며 지금까지 51회 코스를 열어 수면 지도자 2000여명을 배출했다. 나이 들수록 숙면을 이루기 힘든데, 초고령 사회 일본에 그만큼 잠 못 자는 사람이 많다는 의미다. 수면 지도자는 주민센터, 노인홈, 요양 시설 등에서 건강 수면을 코칭한다. 이날 이뤄진 교육 중 일상 속에서 실천하는 수면 건강 행동 지침을 소개한다.\n\n◇아침 빛과 식사가 밤수면 결정\n\n수면은 과학이다. 잠은 햇빛으로 세팅되는 뇌 안 생체 시계와 매일 일정 시간 잠을 자려는 뇌 속 수면 항상성 본부의 합작품이다. 이에 햇빛과 '수면 본부 호르몬'을 조화시키는 생활 습관이 쾌면을 만든다. 적정 수면 시간은 개인마다 다르다. 6시간을 자도 낮에 졸리지 않으면 그게 적정 수면 시간이다. 하지만 수만명을 대상으로 수면과 사망위험률 관계를 조사한 연구에 따르면 7시간 수면(6.5~7.4시간)일 때 사망위험률이 가장 낮다〈그래픽〉. 이보다 적을수록, 많을수록 사망위험률은 올라간다.\n[![img4.daumcdn.net.jpg (0x0)](data/img/post_1_img4.daumcdn.net.jpg)](../12XDghETTnMMsD4MxRhDZFxbnSq5yda3K3/data/img/post_1_img4.daumcdn.net.jpg)</div>\n\n<div class=\"article_view\" data-translation-body=\"\">.</div>\n\n<div class=\"article_view\" data-translation-body=\"\">아침에 생체 시계를 각성으로 켜는 스위치는 햇빛이다. 태양빛을 맞으며 잠에서 깨는 게 좋다. 적은 양의 햇빛도 눈꺼풀을 뚫고 뇌를 자극하기에 잘 때 커튼을 10㎝ 정도 열어 놓고 자길 권한다. 기상 후 2시간 이내 밖으로 나가 햇빛을 많이 쬐면 생체 시계는 기상 후 15~16시간 뒤에 졸음을 유발하여 자연스럽게 수면에 이르게 한다. 비 오는 흐린 날도 실외가 전기 조명으로 환한 실내보다 수 배에서 수십 배 빛의 양이 많다.\n\n아침 식사 때 단백질을 구성하는 아미노산 중 하나인 트립토판을 많이 먹어야 한다. 트립토판은 콩·두부·낫토·살코기·계란·참치 등에 많다. `섭취된 트립토판은 낮에 햇볕을 받아 세로토닌으로 바뀌고, 밤에는 수면을 유도·유지하는 멜라토닌으로 전환된다.` 매일 아침 식사를 하면 소화 활동을 하는 배 안의 '배꼽시계'도 작동되어 아침 각성에 상승효과를 낸다.\n\n◇생체 시계와 맞물린 생활해야 쾌면\n\n낮시간 중 오후 1~3시 사이에 각성도가 떨어지고 졸리다. 점심을 먹었기 때문이 아니라 하루 수면-각성 사이클상 그렇다. 이때 교통량은 적은데도 교통사고 건수는 새벽 다음으로 많다. 낮잠은 3시 이전에 20~30분 이내로 해야 밤 수면에 영향을 미치지 않는다. 3시쯤부터 다시 각성과 신체 능력이 올라가서 늦은 오후와 저녁에 최고가 된다. 이 시기 적절한 운동은 수면의 질을 높인다.\n\n스마트폰·컴퓨터·TV 등에서 나오는 파란색 계열의 파장 블루라이트(blue light)는 각성을 유발하고 멜라토닌 생성을 차단한다. 밤에는 홍채가 커져 적은 양의 빛도 망막을 크게 자극한다. 이에 저녁부터 아침까지는 스마트폰에서 블루라이트를 차단하는 설정을 해야 한다. 집에서 밤에는 간접 조명이나 은은한 황색등을 쓰는 게 좋다.\n\n밤에 체온이 서서히 떨어져야 멜라토닌 분비가 잘 된다. 밤에 체온 올리는 운동이나 격렬한 대화는 멜라토닌을 낮춘다. 밤에는 근육이 이완되는 은은한 음악과 향기가 권장된다. 자는 동안 약 90분 주기로 깊은 수면에서 얇은 각성 상태로 올라온다. 수면 시간을 꼭 줄여야 할 때라면 3시간이나 4시간반 자는 식으로 하면 깨어나기 쉽다. 숙면 초기에 성장 호르몬 분비가 활발해 항노화 효과도 있다.\n\n수면 지도자 코스를 이끈 중부대학 미야자키 소이치로 교수는 \"주말·일요일을 포함해 매일 일정 시각에 일어나 생체 시계 리듬과 맞게 햇빛 쬐기, 식사, 활동 등을 하면 누구나 쾌면에 이를 수 있다\"고 말했다.\n</div>\n\n</div>"
		}
	],
	"tag": [
		{
			"value": "electric",
			"post_id": 2
		},
		{
			"value": "car",
			"post_id": 2
		},
		{
			"value": "delivery",
			"post_id": 2
		},
		{
			"value": "bike",
			"post_id": 2
		},
		{
			"value": "Czech",
			"post_id": 2
		},
		{
			"value": "china",
			"post_id": 5
		},
		{
			"value": "bike",
			"post_id": 5
		},
		{
			"value": "morning",
			"post_id": 1
		},
		{
			"value": "wakeup",
			"post_id": 1
		},
		{
			"value": "circardian",
			"post_id": 1
		},
		{
			"value": "egg",
			"post_id": 1
		},
		{
			"value": "sleep",
			"post_id": 1
		},
		{
			"value": "potato",
			"post_id": 6
		},
		{
			"value": "diabetes",
			"post_id": 6
		},
		{
			"value": "carbohydrate",
			"post_id": 6
		},
		{
			"value": "vegetarian",
			"post_id": 7
		},
		{
			"value": "beyondmeat",
			"post_id": 7
		},
		{
			"value": "beyondburger",
			"post_id": 7
		},
		{
			"value": "bean",
			"post_id": 7
		},
		{
			"value": "plantbasedmeat",
			"post_id": 7
		},
		{
			"value": "china",
			"post_id": 8
		},
		{
			"value": "religion",
			"post_id": 8
		},
		{
			"value": "free",
			"post_id": 8
		},
		{
			"value": "persecution",
			"post_id": 8
		},
		{
			"value": "christian",
			"post_id": 8
		},
		{
			"value": "china",
			"post_id": 9
		},
		{
			"value": "persecution",
			"post_id": 9
		},
		{
			"value": "free",
			"post_id": 9
		},
		{
			"value": "religion",
			"post_id": 9
		},
		{
			"value": "tibetan",
			"post_id": 9
		},
		{
			"value": "china",
			"post_id": 10
		},
		{
			"value": "religion",
			"post_id": 10
		},
		{
			"value": "free",
			"post_id": 10
		},
		{
			"value": "persecution",
			"post_id": 10
		},
		{
			"value": "Uighur",
			"post_id": 10
		},
		{
			"value": "KBS",
			"post_id": 11
		},
		{
			"value": "김정은",
			"post_id": 11
		},
		{
			"value": "김제동",
			"post_id": 11
		},
		{
			"value": "문재인",
			"post_id": 11
		},
		{
			"value": "빨갱이",
			"post_id": 11
		},
		{
			"value": "종북",
			"post_id": 11
		},
		{
			"value": "hospital",
			"post_id": 12
		},
		{
			"value": "treatment",
			"post_id": 12
		},
		{
			"value": "kidney",
			"post_id": 12
		},
		{
			"value": "theft",
			"post_id": 12
		},
		{
			"value": "complaint",
			"post_id": 12
		},
		{
			"value": "doctor",
			"post_id": 12
		},
		{
			"value": "operation",
			"post_id": 12
		},
		{
			"value": "surgery",
			"post_id": 12
		},
		{
			"value": "zombie,",
			"post_id": 16
		},
		{
			"value": "deer,",
			"post_id": 16
		},
		{
			"value": "mad",
			"post_id": 16
		},
		{
			"value": "cow",
			"post_id": 16
		},
		{
			"value": "disease,",
			"post_id": 16
		},
		{
			"value": "usa,",
			"post_id": 16
		},
		{
			"value": "canada",
			"post_id": 16
		},
		{
			"value": "copyright,",
			"post_id": 17
		},
		{
			"value": "mickey",
			"post_id": 17
		},
		{
			"value": "mouse,",
			"post_id": 17
		},
		{
			"value": "walt",
			"post_id": 17
		},
		{
			"value": "disney",
			"post_id": 17
		},
		{
			"value": "tor,",
			"post_id": 18
		},
		{
			"value": "exit",
			"post_id": 18
		},
		{
			"value": "node,",
			"post_id": 18
		},
		{
			"value": "eavesdrop,",
			"post_id": 18
		},
		{
			"value": "hack,",
			"post_id": 18
		},
		{
			"value": "vulnerability",
			"post_id": 18
		},
		{
			"value": "pizzagate",
			"post_id": 19
		},
		{
			"value": "podesta",
			"post_id": 19
		},
		{
			"value": "pedophile",
			"post_id": 19
		},
		{
			"value": "snuff",
			"post_id": 19
		},
		{
			"value": "japan",
			"post_id": 20
		},
		{
			"value": "abe",
			"post_id": 20
		},
		{
			"value": "louis14",
			"post_id": 20
		},
		{
			"value": "dictatorship",
			"post_id": 20
		},
		{
			"value": "statistics",
			"post_id": 20
		},
		{
			"value": "fraud",
			"post_id": 20
		},
		{
			"value": "manipulation",
			"post_id": 20
		},
		{
			"value": "finland,",
			"post_id": 21
		},
		{
			"value": "pedophile",
			"post_id": 21
		}
	]
}