{
    "issue_comments": [
        {
            "issue_id": 0,
            "issue_json": "data/users/164x9q7LJPLX4SMbhqLPraKAGZRPa2gTFe",
            "body": " Yes, AceStream is proprietary p2p torrent-like live streaming software. So, herp is asking if live streaming can be implemented in ZeroNet, especially since we now have big file support i.e. ability to split file into pieces.\n\nI have not looked at how it works and neither have granular knowledge about working of ZeroNet but maybe it can be implemented something like this:\n\n* stream file is split into pieces with big file support like 256KB, 512KB or 1MB and for smoothness in playback, it is also set at constant stream bitrate\n* Once someone broadcast live streaming, they prioritize sending out latest pieces and those which have been sent least amount of times to those who have ports open. And only when these conditions are met, they send out older pieces and to closed port users.\n* Similarly everyone prioritize sending pieces to those having open ports first so that it can spread fast as people would not be able to request streaming files from closed port users. This issue is not common in torrents because UPnP is well implemented in torrents and almost everyone have open port.\n* Anyone who joins streaming in middle can ask which is the latest piece like 1728th piece and start streaming from there.\n* Depending on bandwidth capacity of peer-network, some may serve request of older pieces for rewinding and pause feature (just like torrents, it would be known who have which pieces). Meanwhile everyone saves pieces to storage media also which they can delete afterwards if they want. Since every piece have a number like 128th piece just like in torrents, they would known which pieces are missing and can request them for offline storage of entire event afterwards or may choose to delete entire video/audio after watching.\n* With size limit feature, one can also purge older pieces and not fill up storage with live streaming.\n\nMaybe somehow like this, live streaming feature can be implemented. What are your thoughts on it? Is it doable?",
            "date_added": 1514966772600,
            "id": 0
        }
    ],
    "next_issue_comment_id": 1,
    "issue_reactions": [
        {
            "comment_id": -1,
            "comment_json": "data/users/164x9q7LJPLX4SMbhqLPraKAGZRPa2gTFe",
            "issue_id": 0,
            "issue_json": "data/users/164x9q7LJPLX4SMbhqLPraKAGZRPa2gTFe",
            "reaction": "thumbs-up"
        }
    ]
}