{
	"title": "Flax's blog",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1554229314,
	"post": [
		{
			"post_id": 5,
			"title": "EU passing Article 13",
			"date_published": 1554229053.734,
			"body": "Well it sure looks dark now. Article 13 has been passed for good within the EU. EU member states will have 2 years to implement these new laws. What this means in every individual member state is uncertain however I would strongly recommend anyone in the EU to invest in a VPN when that day comes and to stand up now against this. I will be getting a VPN and using services like ZeroNet more."
		},
		{
			"post_id": 4,
			"title": "Changing the look of Windows",
			"date_published": 1537114709.741,
			"body": "So I was bored the other day and decided to change the look of my Windows 10 installation. I ended up installing the Arc theme by user niivu on Deviantart and the icon pack also by niivu.\n[Theme](https://www.deviantart.com/niivu/art/Arc-704024954)\n[Icon pack](https://www.deviantart.com/art/Arc-iPack-704026527)\nOther tweaks are oldnewexplorer, classicshell and wallpaper engine for a pretty and functional desktop experience even on Windows. Some parts of the OS definitely look flaky at best like the task manager.\n**Pretty desktop screenshot**\n![Windows with arc dark theme](img/LookOfWindows/rice.png)\n**Task manager looking uglier than ever**\n![Task manager with white and dark bits](img/LookOfWindows/uglyrice.png)\n\n**UPDATE: For some reason the task manager decided to fix itself.**\n![Fixed task manager](img/LookOfWindows/fixedforsomereason.png)\n\nConclusion I guess, this was rather pointless and the result is mixed. Especially with Firefox for some reason which I noticed on Ubuntu as well. Strange."
		},
		{
			"post_id": 3,
			"title": "My first blog",
			"date_published": 1536770008.983,
			"body": "I've never used any blogs before, I came here due to the vote that the EU had today (12/Sep/2018).\n\nI was tipped off about ZeroNet by a person on a chat server and looking at their official site it made me intrigued.\n\nI like the idea and implementation of ZeroNet so I will probably stay but not use this for all of my online needs since there isn't much content or a big community here. I am willing to bet though that if article 11 & 13 pass and are written into law next year and people finding that the content they upload is getting taken down for \"copyright infringement\" they will either switch to a VPN or using hidden services like ZeroNet or TOR for spreading things such as memes.\n\nIf nothing else using ZeroNet will be an experience different to the clearnet."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}