{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1573278709,
			"title": "Hello dwellers of ZeroNet",
			"body": "I hope you day is going well. I would like to know what Zites you think I should seed now. I am getting a drive bay enclosure in the mail Sunday. It will house a 500GB hard drive that ZeroNet can use most or all of its space. Right now I have a dedicated server (repurposed hp laptop, will run ZeroNet 24/7) that uses very little power that I tinker with as a hobby. I remote into it when I want to use ZeroNet. I am all about free speech and the spread of democracy, ZeroTalk seems to be a great Zite for that. Could you all perhaps give me a few links for those whom want to start seeding useful or helpful Zites? (Unfortunately image board Zites are a no-go due to the cp)",
			"added": 1573278708
		},
		{
			"topic_id": 1573443918,
			"title": "Trouble reaching Zite",
			"body": "http://127.0.0.1:43110/Board.ZeroNetwork.bit/\n\nI can't get it off the connecting page, is something wrong? There are many peers connected so I assume people are on it now.",
			"added": 1573443916
		},
		{
			"topic_id": 1573689881,
			"title": "Is the IFS website still active?",
			"body": "I'm rather new to ZeroNet and I've been poking around for a few months now. IFS\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/\nseems to be a great file hosting solution without you needing to be directed to a onion site. Its really convenient as you get to pick and choose the content you seed as you view the contents of the file. While it is a moderated site (only blocking CP) it seems to be a great Zite for public file distribution. I am piecing together the history of ZeroNet and it is becoming my main form of leisure activity versus clear net activities. What caused it to not flourish?",
			"added": 1573689878
		},
		{
			"topic_id": 1574042302,
			"title": "Is this a working youtube alternative on ZeroNet?",
			"body": "http://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Home\n\nHere it is, bask in its beauty. Its fast and it has a great easy to use UI. This is what I was looking for in terms of a decentralized video and media sharing site. It seeds videos you watch and doesn't to those you click on. There is a convenient seeding category to free up space and there is [NSFW] tags on videos title. It feels like YouTube in terms of UI.\n\nI only wish there was a setting to delete videos you don't watch starting from the oldest one in the list automatically with a set storage amount (I don't mind giving up 80GB for the cause).\n\nRight now the content is flowing at a slow but steady rate. Try it out, mostly there are memes and some [NSFW] content. I could see this taking off.",
			"added": 1574042298
		},
		{
			"topic_id": 1574217448,
			"title": "Possible security breach (user caused) with revealing ZeroNet to local network",
			"body": "So I watched this video:\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1508167290_16t83GyRixTRFbTL91Lvk2q3Z8kJzJfAXH\n\n(On KopyKate BIG OFFICIAL)\n(Its a video about giving your external IP an address and assigning a ZeroNet server a port on port 80)\nI did not want to make ZeroNet public on my network so I only changed my config.\n-----------\n[global]\noptional_limit = 120\ntor = always\nfileserver_port = 25144\n\nui_ip = *\nui_port = -------\n-----------\n(Dashed lines to hide my selected port)\nMy ui_port is NOT 80 and my server does NOT have the selected port forwarded externally and my server is behind a router (Requiring a port to be opened externally, out of the two ports I have open ui_port is NOT one of them). However, upon starting ZeroNet there was a dialog that said your ZeroNet UI is open to the internet! The reason I would do this in the first place is to reveal the UI to my trusted home network. For the first five seconds I tested it it worked great (The same ZeroNet instance can be opened on my phone/PC/tablet) before I killed it and rolled back the config. I am fairly confident that the ZeroNet UI and services are not open to the internet but I wanted to check with y'all. I am adept to web servers, perhaps in a future ZeroNet update there will be a UI toggle for noobs like me?",
			"added": 1574217443
		},
		{
			"topic_id": 1574310770,
			"title": "Android browser for ZeroNet.",
			"body": "What browser do you use/suggest for ZeroNet on Android? I can't change proxy settings for the latest tor browser (Android) so what are good alternatives?",
			"added": 1574310764
		},
		{
			"topic_id": 1575339719,
			"title": "KopyKate can't seed own content",
			"body": "http://192.168.1.44:43110/big.kopykate.bit/?Home\n(KopyKate site)\nI have put up a video but it says 0/0 peers. Is that inclusive or exclusive? There is a option to seed with the +seed button available but clicking it does nothing. Is it working?\n\nhttp://192.168.1.44:43110/big.kopykate.bit/?Video=1575000339_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3\n(SFW news capture about trump)\n\nIf it does work, I have a server running with a dedicated hard drive. What should I put on KopyKate? news articles? movies? The entire site of you tube before COPPA wipes out all channels?",
			"added": 1575339712
		},
		{
			"topic_id": 1575850577,
			"title": "Kopy Kate upload feature seems not to work",
			"body": "I uploaded 2 videos on big.kopykate.bit and I wanted to check if my videos where going through. I tried to download and seed these videos but I could not get the video to play. My server has hosted this video for over a week and on recently. BOTH ZeroNet instances are over tor. Peers are stuck on 0/0 for both and I don't have the ability to watch the videos when I navigate to them in the browser. I have not checked Kopy Kate's files for the video I have hosted, ill update when I check. The computer I am trying to watch the video on has a fresh instance of ZeroNet running. Perhaps I don't have enough trackers yet?",
			"added": 1575850569
		},
		{
			"topic_id": 1576012034,
			"title": "AI DUNGEON 2",
			"body": "It came out yesterday and does any one have it? I cant download it because they cant serve the files so would you mind sharing on Zero Up?",
			"added": 1576012025
		},
		{
			"topic_id": 1613799897,
			"title": "The entire Wikipedia, the free (in beer LOL) encyclopedia",
			"body": "I am downloading XOWA and a whole 65 GB wiki database. Ill dump a copy on my Zeronet server. There, you can download and or seed the entire database and application. I cannot believe I have found this just now. What a human accomplishment honestly. The download was unstable for me so I thought I would put it here so it can be more stable.\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f7_1KruxJQQfajktbt58UXVm2THe3tjjL7t98_item_8+type:archive",
			"added": 1613799887
		}
	],
	"topic_vote": {
		"1573159148_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1572293998_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK": 1,
		"1574673324_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"1575161695_1KDpaUh79hAu9u5dFdZeJptTi2u3wQcCUT": 1,
		"1575265213_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575331476_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1575342587_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1575530407_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": 1,
		"1575616132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1576021217_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1576474700_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"1577184518_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": 1,
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1595800278_1G8RD4XVsFK1eJZQCV42moboev12debJDS": 1,
		"1605282602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1605228744_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": 1,
		"1605144642_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"1604257651_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1604219688_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": 1,
		"1604080292_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1606242897_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1612193748_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": 1,
		"1612036757_1LPWdVJ1GNU738u2VUkoZdw9B7u4VPmfNZ": 1,
		"1611850021_1N6HArdCgfF7zK7vWNR5UEPBDSXAbv2WEN": 1,
		"1612217578_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1612726861_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1613598462_1ALhG1MKihUZVUmDdNYUzD7rzrCF29uLwk": 1,
		"1613598698_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"1614197588_1AHGnE7rAzw84wX7v3oNeZvUuyB5cWLycU": 1,
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1625807197_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1625793981_1PoimK7hZWHqrhWBZAVe8bi9g7sv4cj87R": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 113,
	"comment": {
		"1573231068_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 1,
				"body": "I have a laptop always running (plastic, keyboard and screen removed leaving nothing but the motherboard). I then remote into it when I want to browse ZeroNet. Soon I will have a hard drive attached to house all of ZeroNet's data and Zites",
				"added": 1573279021
			}
		],
		"1573159148_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": [
			{
				"comment_id": 2,
				"body": "Because it needs to download all Zites to seed them when ZeroNet starts, Its always ready.",
				"added": 1573279299
			}
		],
		"1573278709_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 3,
				"body": "> [filips](#comment_289_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You can set up New ZeroNet Sites script (but be careful of sites with illegal content with this way as script automatically downloads sites). [...]\n\nAlright, I am seeding you Zites now! Thank you for your suggestions!",
				"added": 1573313510
			},
			{
				"comment_id": 4,
				"body": "> [xcape2net](#comment_546_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I would appreciate it if you would seed ZeroTalk Tech:  1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq [...]\n\nZeroTalk Tech along with the others are being seeded now. Thank you for your cool Zites!",
				"added": 1573313576
			},
			{
				"comment_id": 5,
				"body": "Ill need to wait until I prefect a secure system on my network before I randomly start downloading and seeding new Zites automatically. I like the idea and in a perfect world I would jump on seeding random Zites without my consent or visual approval however, a few love to abuse absolute freedom. Id like ZeroNet to be friendly enough for others to adopt without fear of getting in trouble for just using a service. Someone should split up 08Chan so each board has their own Zite (/g/ would be a good example of a community that would become a role model for how to self moderate.) The board /g/ would be great to seed but it seems it has turned into ZeroTalk Tech?",
				"added": 1573314284
			},
			{
				"comment_id": 6,
				"body": "> [filips](#comment_292_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): There is plan to make decentralized Reddit alternative with all (most) features from the real reddit (decentralized subreddits, management...). See this for more details.\n\nI checked the Reddit alt idea and it's kinda what I was looking for. I'm really excited for it to go from idea to execution!",
				"added": 1573364115
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 7,
				"body": "Testing",
				"added": 1573405690
			},
			{
				"comment_id": 65,
				"body": "Testing the system",
				"added": 1575339748
			},
			{
				"comment_id": 97,
				"body": "test (Zeronet backup restore)",
				"added": 1577158217
			},
			{
				"comment_id": 104,
				"body": "this is a test message, no trackers currently",
				"added": 1595903343
			}
		],
		"1573407833_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 8,
				"body": "I thank God for having a warm bed to sleep in at night. College is rough right now but I think I can make it to the end.",
				"added": 1573441853
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_1219_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Don't count on college friendships lasting unless your friends are intellectually competent.\n\nGood advice and don't worry. I have no friends lel",
				"added": 1573501700
			}
		],
		"1573438999_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 9,
				"body": "That would be cool but it unfortunately relies on honest people to hold up their end of the deal.",
				"added": 1573442002
			}
		],
		"1573443918_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 10,
				"body": "> [qingqing](#comment_7_1dUopDebW9j3LuiBuSm54faMWQRvBU6S4): i cannot connect this site either\n\nOK, the site data must not be there yet. The author is just getting ready for its release. Thanks for checking",
				"added": 1573446955
			},
			{
				"comment_id": 12,
				"body": "> [filips](#comment_296_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): That site is actually old demo site and it is not meant to be used anymore. If you want to create another site similar to it, check source code.\n\nI'm honored that you think I know how to clone a project on git Center much less git hub. I know just a pinch of java and I'm starting on python for engineering. Thanks for letting me know its dead, I will stop distributing files.",
				"added": 1573527498
			}
		],
		"1573658191_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 13,
				"body": "If someone brings over the entire site to zero net ill seed it. I remember reading these, it was a nice community.",
				"added": 1573658677
			},
			{
				"comment_id": 14,
				"body": "> [lukashenko](#comment_2_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m): It seems to me that at least the original English SCP Wiki is rather bad for one's mental health and can lead to cuicide. You should be careful reading it and stop immediately if it hurts your feelings or makes sad.\n\nYou haven't happen to be a class C personnel did you?",
				"added": 1573689393
			},
			{
				"comment_id": 22,
				"body": "> [fractalzoomer]\n\nI don't care, im in",
				"added": 1573738958
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 15,
				"body": "Look, I don't want you to die. You bring up a good point I agree with though \"Its only logical\". I once did think that but there is a reason for everything. If you don't believe in God then you can easily make the argument that \"everything is pointless\" however, Only a fool would believe there is no higher force beyond your sight that has purposely created you. Why anything? Time has and always been scripted and, there is a start and there is an end, events will be played out in the meantime. Even though things are bad wouldn't you so desperately seek the end you are supposed to see? Why would an organism purposely curtail its existence? There might be nothing else to do or see but that's NEVER true. I'm on the edge of my seat exhausting myself to ensure my future so I can get a job that can support a family of my own. And if I can't? Ending it all should not be in your cards. If you've given up TIME is your only God now so why would you reject your gift given directly to you and no other? Please, I don't know who you are but the God that one of us believe in seek to help you. If you are hesitant on taking your life, time has been steering you away. Listen to it.",
				"added": 1573691144
			},
			{
				"comment_id": 19,
				"body": "> [anonymouslogin](#comment_124_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): ....and the most peaceful way to make the heart stop is?.....drum roll please......\n\nWhy do you seek destruction? What do you get out of it if you've never seen this person before?",
				"added": 1573694562
			},
			{
				"comment_id": 20,
				"body": "> [anonymouslogin](#comment_126_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): The world already has too many people. Why encourage anyone to stay and consume precious resources if they want to leave? Irrespective of your faith in higher power or lack thereof, if you want to check out, check out. Don't procreate, as likely a mental illness is informing your choices regarding survival and you're offspring may inherit it. Inert gas flooding is an effective way to kill numbers of organisms silently and painlessly in their sleep, or their prison cells..... ;-)\n\nWe all are an extension of each other. Unfortunately, you are only hurting yourself trying to undo harm that you have unfortunately. While I cannot confront you, I hope someone does by opening the door for you or complementing you. We all share the same dirt and those who feel like they don't try to alienate others and devise dirt. I encourage our friend here to stay because our acts will echo throughout the future. You argue traits are passed down through us right? And a solution is to self terminate right? What is left? You. Do not weaponize said resources to shed others of theirs. That use them in vein wouldn't it? Re-arranging the pieces sounds like a constructive idea. Kaar, Moving to a new town with a resume sounds like near reincarnation. You can make a new set of friends and routines.",
				"added": 1573700148
			},
			{
				"comment_id": 24,
				"body": "> [kaar4bears](#comment_58_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): climate apocalypse? facebook-google regime? governments spying on our very thoughts? muslims invading europe? you call that 'better'?\n\nclimate apocalypse? Two things will happen not in our lifetime, Humans learn to be efficient or how to survive on another planet. facebook-google regime?? I just upset my peers by telling them about google ripping up peoples accounts, they all agree its wrong. I suggested to setup thunderbird or hotmail accounts and backing up photos locally to steer away from the cloud. Governments spying on our thoughts? Close but its big companies that use that as a source of income. Again, If the centralized internet was perfect we wouldn't be on this platform evading all of thus said. Things snap back like a spring, When we say \"It will get better\" we are serious. Its the conservation of energy really, nothing is permanent.",
				"added": 1573771431
			},
			{
				"comment_id": 31,
				"body": "> [kaar4bears](#comment_72_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): Smog is so bad where i live that weather guys recommend not going outside unless really needed (I guess they don't realize people MUST go to work every day?). Scientists think it will drastically reduce our lifespan and it damages children physical development. I don't wanna live in such world. [...]\n\nI live in a quite diverse area. Going through school devoured with \"diversity\" wasn't so bad, I just saw others that drug down average GPA as leverage and it made me shine. It worked but, about the smog in your area. I'm sorry you live in that climate. Perhaps you should scrape together what you have and move? I don't know if that's in your cards but its worth thinking about it and maybe looking forward to? Some areas in the U.S are covered in 100 Y.O trees with absolutely stunning landscape and if you live far enough away from cities it becomes a quiet paradise. For google and Facebook, one of my hobbies is trading stock in massive companies and the overthrowing of some is in motion. Intel has been \"King for too long\" and AMD is swooping in. Too many security breaches start to jar at others consciousness and making them switch. Its starting to reflect in the Stock market. Perhaps the same will happen to google and Facebook. I'm exited for that.",
				"added": 1574018431
			},
			{
				"comment_id": 40,
				"body": "> [web30](#comment_1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH):   [...]\n\nReally? While suicide is a sensitive subject, Its still technically free speech. What will the government prove? Telling someone to kill them selves with a few minuets on googling to compile a list sticks them right in the under 18 age group. Its the most primitive type of bulling and no one should take advice from an adolescent. Ill out the agency for getting a 13 year old to say KYS and then using that to try to shut down what? Just one peer? good luck.",
				"added": 1574187333
			}
		],
		"1573689881_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_1243_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The UI is kind of lackluster, lacks thumbnails and is not very mobile-optimized. KopyKate BIG Official's is nicer-looking, mobile-optimized, has thumbnails and is a bit more simplified.\n\nThank you for the suggestion, does KopyKate have content moderation of any kind?",
				"added": 1573691513
			},
			{
				"comment_id": 17,
				"body": "> [styromaniac](#comment_1243_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The UI is kind of lackluster, lacks thumbnails and is not very mobile-optimized. KopyKate BIG Official's is nicer-looking, mobile-optimized, has thumbnails and is a bit more simplified.\n\nI just checked up on the Zite, while it looks nice you cannot seed the content when you watch it. You must re-download it, that's not ideal.",
				"added": 1573692270
			},
			{
				"comment_id": 18,
				"body": "> [xcape2net](#comment_551_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Hey, goodafternoon.  I'm sure many of us would really enjoy reading a good article on the history of ZeroNet.  Why don't you write it and post it on ZeroTalk Tech!\n\nThat sounds like a nice idea! I wish I knew the history though. I heard the buzz when 8chan shut down and how they where using a decentralized platform to keep the community alive. That's what brought me here. Ill update on Zero tech in a year when I have some actual history! :)",
				"added": 1573694361
			},
			{
				"comment_id": 23,
				"body": "> [styromaniac](#comment_1245_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That is not correct.\n\nReally? Perhaps I am using it wrong. Ill see if I can get the content I watch to seed. If I can that would be great for others.",
				"added": 1573751574
			},
			{
				"comment_id": 25,
				"body": "root2elroy, have you tried zeroup? making your own zite could work too.",
				"added": 1573796655
			}
		],
		"1573702465_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 21,
				"body": "There should be a redirect notice first. Other than that, sure",
				"added": 1573702690
			}
		],
		"1573794798_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 26,
				"body": "I did some quick research on Lokinet. my conclusion, whats wrong with Zeronet? There is a community here already and seeding is free range and not forced with coin. I would check out apps but I think it wont be long before they are drug over here.",
				"added": 1573798055
			},
			{
				"comment_id": 27,
				"body": "Huh, ill run an instance of it to see if its worth server resources.",
				"added": 1573833675
			},
			{
				"comment_id": 32,
				"body": "> [kaar4bears](#comment_75_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr):  [...]\n\nI overlooked that, good catch. I came here to increase activity in alternate internet assess. Ill start up LokiNet too!",
				"added": 1574019413
			}
		],
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": [
			{
				"comment_id": 28,
				"body": "Here is my unpopular opinion, the people. Hear me out, each branch might have its own interests but the imperfect system is made by imperfect people. While it can be argued to be inefficient, I am very glad decisions are not made with haste. In the end, they are just trying their best (50/50) to utilize tax money. Maybe its because I live in a good community where we talk to officers like they are our friends and they do the same. I had a talk with the firemen and they gave me a tour of how the fire truck works, it was really cool and they where glad to show me around. Our neighborhood also paid for an American flag grill that looks really cool on the truck too. They worked themselves hard when Harvey hit our area too setting up camp in our local grocery store. I guess its a small town thing so you get my small town answer. How about you Sully?",
				"added": 1573846099
			},
			{
				"comment_id": 29,
				"body": "> [kaar4bears](#comment_68_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): Best utilize tax money? Maybe best for THEM. In my country, politicians live like kings because they steal most of MY tax money. We taxpayers however, are in majority very poor with shit jobs.\n\nI did say 50/50, using probably around %50 for actual work and the rest for anything OTHER than that.",
				"added": 1573847967
			},
			{
				"comment_id": 30,
				"body": "I'm not going to disclose any names but, your right xcape2net. Someone I know hasn't gotten any reports for a week strait. He is almost bored to tears too, and yes most of the time he just waits for reports and kills time in the process. He is trying to get another job as innovation is not encouraged in the work place. There are some hard working people in there though but, the just a few levels up they are following STRICT protocol from the highest. Inefficient because its in standby most of the time but if disaster strikes its a organized machine ready to pounce or, at least I hope so. Higher up is where most energy is waited in the food chain though for any type of system.",
				"added": 1573867803
			}
		],
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 33,
				"body": "> [bigbadbob](#comment_802_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I'M CUUMMMMMMING!!!!!!!!\n\nDarn coomers",
				"added": 1574041838
			}
		],
		"1574042302_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 34,
				"body": "Aaannnnnnnddddd there it goes, a good idea that just absolutely crumbled to pieces literally within less than 30 minuets.",
				"added": 1574043978
			},
			{
				"comment_id": 35,
				"body": "> [kaffie](#comment_1120_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Just added that spammer to my spamlist. [...]\n\nthanks man, adding it now.",
				"added": 1574046837
			},
			{
				"comment_id": 38,
				"body": "> [merithtk](#comment_102_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): yes that is the official bit site\n\nYep, can confirm.",
				"added": 1574186332
			}
		],
		"1574118268_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 36,
				"body": "KopyKate BIG OFFICIAL is where I'm at.",
				"added": 1574124967
			}
		],
		"1574102813_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF": [
			{
				"comment_id": 37,
				"body": "no, glad he is in jail",
				"added": 1574125134
			}
		],
		"1574171891_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF": [
			{
				"comment_id": 39,
				"body": "Take you time, I love you to Anon.",
				"added": 1574186902
			}
		],
		"1574206496_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 41,
				"body": "Ah, \"and a OnePlus7pro\" as I am filming the scenario from afar.",
				"added": 1574214211
			}
		],
		"1574217448_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 42,
				"body": "> [mg0](#comment_167_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): ui_ip =  allows all addresses to connect to the server, only limitation is knowing the port which is fairly easy to be done with nmap or a tiny script using netcat. what you need is to only allow your home network to access your server, I think maybe zeronet allows you to use something like 192.168.0. being your home network under 192.168.0.0/24 network but I'd personally recommend setting up a firewall too.\n\nAnyone externally can use the computer hosting ZeroNet even though the port is not exposed to my public IP? How could someone on the outside preform a port scan internally if (1. My services don't respond to ping 2. My two ports forwarded are do NOT match the port Ive set up on my home network. I see how those two ports can be seen.)? Do you mean if someone is on my home network? If that's the case, sure, id expect that.",
				"added": 1574270665
			},
			{
				"comment_id": 43,
				"body": "> [mg0](#comment_168_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Yeah, I meant for anyone inside your home network, sorry for not being clear with that.\n\nIf that's the case, I should be fine. ZeroNet running locally cant check if its port is exposed to the external network without getting a external computer to check. The UI prompt is great though, It could catch someone else that is running their computer directly out of the modem and let them know about their config.",
				"added": 1574283291
			},
			{
				"comment_id": 44,
				"body": "> [mg0](#comment_169_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I don't think that prompt really checks much before saying your PC is exposed to the internet, I think it just checks if any address besides local address (like 127.0.0.1 and ::1) are being allowed and triggers that message, so it will say that even if you only accept connections originated from your PC's local network address instead of localhost for example.\n\nSounds about right. I used to browse through a screen sharing software, this is MUCH better.",
				"added": 1574284548
			},
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_1294_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It would be simple to test. I've port forwarded to my phone and temporarily had file servers online. After that, you'd navigate to your public IP and the port number. Going online like that is very intentional and not accidental, so I think you're fine.\n\nIf I knew your phones ip and preformed a port scan to reveal a FTP server running and you had no password I could scrape everything. Same here, I thought about it. I'm fine but what you did is potentially dangerous.",
				"added": 1574309271
			},
			{
				"comment_id": 46,
				"body": "> [styromaniac](#comment_1298_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I understand the risk. Most of the time it was limited to a selected folder.\n\nOk, but in my case I can't have such risk.",
				"added": 1574310062
			}
		],
		"1574310770_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 47,
				"body": "> [filips](#comment_319_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Tor browser changed way to set up proxies. Continue using it and check this and this for details how to change proxy settings. [...]\n\nYep, I did what was in the second link to set up my tor browser for my desktop. Works great. No working mobile one though. :(",
				"added": 1574355532
			},
			{
				"comment_id": 48,
				"body": "> [filips](#comment_321_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): What does not work? Maybe latest mobile version is still not 9.0+ so only old method works. Try this. [...]\n\nAll right, I tried and it doesn't work. Back to remote desktop for my Android because I have a tor browser on the server. I could use Firefox but the first time I used it for ZeroNet it wouldn't render the page correctly.",
				"added": 1574376457
			}
		],
		"1574368389_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": [
			{
				"comment_id": 49,
				"body": "Yeah I heard. Its for the VR only though, I have a rift S so I'm not too bent out of shape. I'm looking forward to the release!",
				"added": 1574376688
			}
		],
		"1574357441_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 50,
				"body": "Isn't there a feed on your main page? It has like 5 topics a day.",
				"added": 1574378219
			}
		],
		"1574455508_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 51,
				"body": "http://127.0.0.1:43110/17aqJNrBjH63D5kgjLLfFi3FZVtW74JDxS/games.html\n\nHey man, you'll love this. This is a working implementation",
				"added": 1574477668
			},
			{
				"comment_id": 52,
				"body": "> [styromaniac](#comment_1311_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You need a jsGBC option if you can pull that off, because the emulator on there isn't mobile-functional.\n\nDarn, I haven't tried that on a smartphone yet. I just hoped that it worked. If you have an android phone perhaps there is an app that mimics a keyboard with touch controls?",
				"added": 1574478199
			},
			{
				"comment_id": 53,
				"body": "> [styromaniac](#comment_1318_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Maybe, but if anyone is so determined, they'd have a folding Bluetooth keyboard with a mousepad or mouse. Hardly anyone uses Android like that.\n\nActually, I just got buy playing with my little cousin with his Xbox one controller. Worked great kinda like plug and play. It probably wouldn't work here though...",
				"added": 1574573214
			}
		],
		"1574608682_1CYE9ryvvXCW4CJPX51T24BFD62cyrXNno": [
			{
				"comment_id": 54,
				"body": "I wish Zites here had auto content deletion after a set date.",
				"added": 1574616980
			},
			{
				"comment_id": 56,
				"body": "> [ratsmack](#comment_102_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): That's kinda the way Freenet works. If content isn't accessed for a period of time, it will cease to exist on the network. That prevents stale crap from accumulating and eating up disk space.\n\nLook, i'm a normie. I tried freenet and I know \"Free\" doesn't mean free to use but there was some things I need to buy to use the network? After a day of trying to get it to work I abandoned it because of the usability of ZeroNet",
				"added": 1574891008
			}
		],
		"1574883594_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 55,
				"body": "I think Linus tech tips the creator of Linux already did...",
				"added": 1574890864
			}
		],
		"1574877477_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": [
			{
				"comment_id": 57,
				"body": "There sure is. Look at wolves, they create packs to increase the chance of survival. There would be an almighty few humans if we didn't need to cooperate to survive.",
				"added": 1574891154
			},
			{
				"comment_id": 60,
				"body": "> [z3n5if](#comment_89_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): @goodafternoonWe are not dogs we are higher apes.Trusting in our reason over our base emotions is what separates us.We can think for ourselves, they cannot.\n\nDid you really just try to draw the line from Humans and animals? We operate on the same hardware just with a few extra synapses thrown in there. While primitive, other \"semi\" intelligent species can communicate through various audio or seismic means. There are a lot of animals that can at least say \"I'm horny\" for a mating call. From whimpering in pain like a dog to crying like a human, we share the same makeup.",
				"added": 1575001251
			}
		],
		"1574848015_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 58,
				"body": "If you don't mind the botnet, OnePlus 7Pro. God I love this phone. Its fast and the battery lasts like 2 days for me (Very light social media, texting, some videos). If your not into micro SD expansion or a replaceable battery its a no go.",
				"added": 1574891478
			}
		],
		"1574806526_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 59,
				"body": "Video games are great. I only play multiplayer, I use it more than an excuse to talk to my friends/cousins than to actually play the game.",
				"added": 1574891574
			},
			{
				"comment_id": 99,
				"body": "If is is leisure and not a daily thing / Good / I catch up with my cousins playing CS source / Money? lol Time? spent not drinking enslavement? PC. Everything within moderation dude.",
				"added": 1577241123
			}
		],
		"1575211763_17DxbCXzmCiauR7nrdYcornB3DNKZYrheM": [
			{
				"comment_id": 61,
				"body": "90 down 10 up. Sorry guys",
				"added": 1575244760
			},
			{
				"comment_id": 64,
				"body": "> [fke13](#comment_19_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): About 2MiB/s symmetrical.\n\nZeronet is a perfect match for you then",
				"added": 1575339220
			}
		],
		"1575331476_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 62,
				"body": "I tried to watch it but it wouldn't load.\nI promise you though, I cant provide a reason.\n\nhttp://192.168.1.44:43110/big.kopykate.bit/?Video=1575000339_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3\n(SFW news clip of president trump)\nthis is my video I put up. My server is always on and always seeding. Could y'all please tell me if its up? I'm starting to think KopyKate isn't working.",
				"added": 1575339004
			},
			{
				"comment_id": 63,
				"body": "ok, it loaded now. Nice",
				"added": 1575339152
			},
			{
				"comment_id": 66,
				"body": "> [styromaniac](#comment_1388_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Isn't it glorious?\n\nGlory like never before.",
				"added": 1575339785
			}
		],
		"1575339719_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 67,
				"body": "> [styromaniac](#comment_1389_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): >the entire site of YouTube [...]\n\nOk, I retract my statement. Thats impossible",
				"added": 1575340100
			},
			{
				"comment_id": 68,
				"body": "> [styromaniac](#comment_1390_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Son, what are you doing on the deep web? You have homework to do!\n\nI finished my homework already.",
				"added": 1575340636
			},
			{
				"comment_id": 69,
				"body": "In double the seriousness i'm not a child. I was thinking of a meme \"image board\" type of site that could be hosted on Zeronet. It would be massive and it would detect duplicate images and dynamically link it to the original because of the sheer amount of reposing. I guess a board on the millchan site will do for now.",
				"added": 1575342081
			}
		],
		"1575342587_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 70,
				"body": "That would be a great idea if Zeronets contents where well seeded and huge. I'm sure most of its users (including me) have zeronet running on a laptop striped of everything except the motherboard and a single hard drive connected dedicated for Zeronet. I don't run a data center so if people don't seed in Zeronets infancy it could steer people away. It would be nice if it was temporarily stored and downloads and seeds by default.",
				"added": 1575342892
			},
			{
				"comment_id": 71,
				"body": "> [duck0](#comment_153_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I run on a laptop, and need to see about running it on my phone.  [...]\n\nI got an old laptop from a friend for $20. It only draws like 6W from my wall. Try to go to thrift stores and poke around for a used laptop. Once you have one watch this video to set up Zeronet for your local network ONLY. (I use this as my always on seedbox/zeronet server. I can then go to any of my devices and browse.)\n\nhttp://192.168.1.44:43110/big.kopykate.bit/?Video=1508167290_16t83GyRixTRFbTL91Lvk2q3Z8kJzJfAXH\n\nAnd then you should be set up. Alternatively, if you have an android phone to burn (Local store has them for around $20 with microSD expansion.) set it up on that. I'm afraid you cant set it up for your whole network though.",
				"added": 1575343563
			},
			{
				"comment_id": 72,
				"body": "> [duck0](#comment_155_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Totally, I've even had a Pi set up at a local library tucked under a couch to help seed at one point in time :^]\n\nNice, all you need now is to set zeronet up on it. check that video out. Its just one config file to change to get it on your entire internal network",
				"added": 1575343673
			},
			{
				"comment_id": 73,
				"body": "> [duck0](#comment_155_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Totally, I've even had a Pi set up at a local library tucked under a couch to help seed at one point in time :^]\n\nwait, a library? Bring that bitch home, its out there cold in this cruel world.",
				"added": 1575343730
			},
			{
				"comment_id": 74,
				"body": "> [duck0](#comment_156_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Home is [ b r e a k i n g T O S ] tether innawoods. It's nice to have a permanent sticky.\n\nI guess",
				"added": 1575343876
			},
			{
				"comment_id": 75,
				"body": "Are the ports exposed just enough to get a VPN in there?",
				"added": 1575344026
			},
			{
				"comment_id": 76,
				"body": "> [duck0](#comment_158_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Tor is my only punch.\n\nAlright. Tor works in a pinch",
				"added": 1575344094
			},
			{
				"comment_id": 77,
				"body": "> [duck0](#comment_159_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Conversation kinda drifted from my intent of having an option to be able to browse zites without saving/seeding.  [...]\n\nYeah, we just need more people to be using Zeronet. That would be fine if 200 people where seeding a video but the top seeding video on KopyKate has only 8 peers. This puts massive load on those 8 people.",
				"added": 1575344460
			},
			{
				"comment_id": 78,
				"body": "> [duck0](#comment_160_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): It's a rework of social media. The old styles don't work.  [...]\n\nYeah I guess so. Having the toggle would be nice. I don't mind seeding though.",
				"added": 1575344798
			},
			{
				"comment_id": 79,
				"body": "> [duck0](#comment_161_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I don't mind seeding, but I don't necessarily want to seed everything I randomly click on trying to find new content.  [...]\n\nYeah, I agree. I browse a lot too, and I often drop sites too.",
				"added": 1575345002
			},
			{
				"comment_id": 80,
				"body": "> [lianna](#comment_45_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): What I do is: [...]\n\nThats a good idea",
				"added": 1575349143
			}
		],
		"1575616132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 81,
				"body": "http://127.0.0.1:43110/1Je4fMTW2o1egVF1pzJL52r4hKpdqYsF9p/\njust wolfenstein 3d in the browser. nothing else really.",
				"added": 1575616402
			}
		],
		"1575850577_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 82,
				"body": "I just checked the Kopy Kate data directory. My two videos are missing. What gives?",
				"added": 1575851098
			},
			{
				"comment_id": 83,
				"body": "Am I not supposed to upload .mp4? The average of both videos are 20Mb\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1575847603_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3\n(Music video, Vocaloid, SFW)\n\nhere is the video if y'all have any luck opening it.\nYou can delete the video after viewed, it wont hurt my feelings. Just please help me out and come back to this thread to tell me if it worked. I have a server running with 24H operation and a big drive, give me a video link to yours if you need seeding.",
				"added": 1575851376
			},
			{
				"comment_id": 84,
				"body": "> [moor](#comment_329_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): perhaps a bug cause this... can you reupload it?\n\nYeah, I can try. It might be worth mentioning that I am using Zero Net not on the computer that hosts it (Zero Net runs on my home network and is accessible to any computer on the local network). Maybe that it the root of the problem? Perhaps there is a program that runs to move the file you selected to the Kopy Kate folder that I am bypassing using it on another machine?",
				"added": 1575851810
			},
			{
				"comment_id": 85,
				"body": "> [moor](#comment_330_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): oh yeah tor browser has issues with that, you can still upload your videos through the tor proxy zeronet uses but by using another browser.\n\nThanks, Ill try that and see what happens. I'm going to use another machene instead of the server to test out the system I use.",
				"added": 1575852234
			},
			{
				"comment_id": 86,
				"body": "http://192.168.1.44:43110/big.kopykate.bit/?Video=1575852309_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3\n(Music video, Vocaloid, SFW)\n\nIt worked. I now see that video in my \"Video Box\" tab. Unfortunately I have uploaded two unwatchable videos that are stuck in Kopy Kate now that I cannot delete. Sorry everyone.... I fear I have created dead videos that cannot be deleted. Now I can watch the videos I have uploaded. Thank you moor and nickwa for helping me figure it out!",
				"added": 1575852678
			},
			{
				"comment_id": 87,
				"body": "> [moor](#comment_331_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): you can remove the entries from your content.json and data.json (make backups before in case you corrupt these files) then click and drag the zero buttom to the left to bring the sidebar (while on kopykate) and click in the rebuild button to rebuild the zite db (not sure if this is really necessary)\n\nNow there are two videos reporting the same date of creation in the data.json file.... Ima just make a backup and delete the whole file. Ill re-upload those two videos and I didn't comment much so hopefully destroy all of my seeded videos",
				"added": 1575854465
			}
		],
		"1576012034_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 88,
				"body": "> [moor](#comment_333_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what do you want exactly? the source code + model data?\n\nI'm very new to debain/linux so the less compiling I need to do the better. I was hoping he provided an executable on his web page but no dice.",
				"added": 1576035575
			},
			{
				"comment_id": 89,
				"body": "> [moor](#comment_334_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): from what i can see they don't provide binaries but its really easy to run it from what i can tell:just follow instructions: https://github.com/AIDungeon/AIDungeon [...]\n\nOk, I don't have a dedicated Linux/Debian machine so I'm using windows subsystem for Linux and praying it works. I'm needing to get a whole lot of prerequisite programs installed right now. I'm about to find out if it passes through the GPU automatically. I'm really new to Debian and Linux all together, I'm going to be crushed am I?",
				"added": 1576037233
			},
			{
				"comment_id": 90,
				"body": "OK, I'm surprised I got this far but I'm at the point where it says initializing! But it crashes because I don't have the model_v5. I seeded that file on my server but not on my machine. I'm seeing what I can do to fix that right now...",
				"added": 1576039990
			},
			{
				"comment_id": 91,
				"body": "> [lianna](#comment_68_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): or pip3 install -r requirements.txt works too. [...]\n\nYep, Neural networks man. I'm installing the whole file right now 5.8GB",
				"added": 1576040584
			},
			{
				"comment_id": 92,
				"body": "YES ITS WORKING! JESUS THE MEMORY HIKE. I knew getting 16gb of ram was not a meme. I need to close my browser now to save memory, I have saved my $history and I'll touch it up for Windows 10 users using Debian when I play a few games.",
				"added": 1576041345
			},
			{
				"comment_id": 93,
				"body": "Nice, It's not using my GTX 1080. I thought I installed the GPU version of TensorFlow..... How can I change that? Right now I'm sitting on \"Generating Story\" while my computer becomes a space heater.....",
				"added": 1576041647
			},
			{
				"comment_id": 94,
				"body": "> [reichardnixon](#comment_86_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): It hasnt been that exciting so far... and its a serious resource hog. I wouldnt recommend wasting time on this.\n\nIt may not be fun, but this is the cutting edge technology I want to track the growth over the years. I don't think NN are a meme, I see a lot of promise. It didn't pass through my GPU so ill need to make a boot able Debian disk and some drive space.",
				"added": 1576106700
			}
		],
		"1576120994_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 95,
				"body": "Cotton candy",
				"added": 1576195570
			}
		],
		"1576474700_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 96,
				"body": "> [filips](#comment_367_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): There is already KxoQA/ZeroExchange.\n\nAwesome, seeding now.",
				"added": 1576574712
			}
		],
		"1577184518_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": [
			{
				"comment_id": 98,
				"body": "Merry Christmas to you too! Best of wishes!",
				"added": 1577240959
			}
		],
		"1580247379_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 100,
				"body": "My Zeronet server is behind a router then modem with no ports open. I'm safe right? (My internal network is secure to my knowledge)",
				"added": 1580877147
			}
		],
		"1591995772_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 101,
				"body": "Yall try out Master Boot Record. Its good stuff, my favorite album is Keygen Church,",
				"added": 1593109690
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 102,
				"body": "> [nzogth](#comment_15_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a): It would be cool if you needed to reach a seed limit to increase your character limit.",
				"added": 1595341206
			},
			{
				"comment_id": 103,
				"body": "For better or worse, wildly popular youtube creators need to cover ZeroNet. While the audience is a little younger, LinusTechTips should cover ZeroNet like he did TempleOS. That will at least bring a somewhat technical audience over here.",
				"added": 1595341411
			}
		],
		"1605228744_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 105,
				"body": "Why hello, welcome to Zeronet!",
				"added": 1605485073
			}
		],
		"1604477660_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 106,
				"body": "Go fuck yourself. Your degeneracy puts a bad taste in peoples mouth when they hear \"decentralized\" and \"Dark net/web\". Honestly, fuck you and your friends. Hope I bump into you in real life, you wouldn't fare too well.",
				"added": 1605485692
			},
			{
				"comment_id": 108,
				"body": "> [anonynous38883](#comment_10_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): technology i am only 1 guy over Million ... Good luck hahahahahahah.\n\nOne at a time third worlder.",
				"added": 1605629666
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 107,
				"body": "As long as its backwards compatible with other Zero Net instances and the existing Zero Net web. But yes, I'm all for rapid growth of the platform.",
				"added": 1605486939
			}
		],
		"1613642362_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 109,
				"body": "> [zeroseed4](#comment_79_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N)\n\nSeeded",
				"added": 1613780889
			}
		],
		"1613799897_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 110,
				"body": "> [theborg](#comment_30_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK): No need to donate, This is an outdated version. Its before the Covid stuff for sure.",
				"added": 1613880936
			}
		],
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 111,
				"body": "Baconboi, there are files for a carbine on IFS. just 3D print them.",
				"added": 1620531022
			}
		],
		"1627048130_1KwEE8EphVS4FAQxXHsgGSawPR5BAgCyBm": [
			{
				"comment_id": 112,
				"body": "Why hello.",
				"added": 1627065744
			}
		]
	},
	"comment_vote": {
		"101_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"289_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"546_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"292_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"47_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"21_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": 1,
		"1220_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"296_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"96_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1243_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"551_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"552_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"29_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2": 1,
		"1_1LhmqxrVVKUVu4VpSZoXHHBT8uiW9cx5So": 1,
		"1298_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"13_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"8_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"3_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"66_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"154_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"155_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"72_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"1395_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"157_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"75_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"158_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"159_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"161_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"45_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"88_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"274_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"3_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": 1,
		"33_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"329_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"330_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"467_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"331_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"11_1SNukFwksAnncCiRAnG4996tagosfhSE4": 1,
		"13_1SNukFwksAnncCiRAnG4996tagosfhSE4": 1,
		"333_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"334_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"335_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"42_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"68_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"53_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"367_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"311_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"2495_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1BxFYB1aErUeU7si96ff693EauJ25V5Uv7": 1,
		"12_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ": 1,
		"637_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1_1BMR61AWR7zMU1dpjpYDXgVVrJEWRRhaKD": 1,
		"12_1MSprhw31RwydrtYRHGJvbd5H9Lb2JsDxU": 1,
		"1197_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"16_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq": 1,
		"56_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"9_12C4ypkzVhDg4g8xjS8DARB1LcFTauXcXN": 1,
		"2646_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG": 1,
		"25_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": 1,
		"5_1JEkT4fCm1xo9HX4KPHLJM341j9M1bVYBa": 1,
		"204_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"3_1KqRW6E7xaTFMVsErAKaN48V6pq3cq8L3z": 1,
		"788_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"2968_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"32_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"79_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"10_15TKSujroWTFtZsNqFnpejDA6JsnvXXrCK": 1,
		"10_1KBserDE8oownu1aR5REHcC3jf9qNkmQDo": 1,
		"15_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N": 1
	}
}