{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_1P3rCvY9Ns2PQVuT1GhdHBBuZzMYX8M1rf": [
			{
				"comment_id": 1,
				"body": "Bonjour à tous. J'espère que ygg, animé par des ex de t411, va décoller. Bonne chance, on a hâte de contribuer. Je propose un surnom approprié :\"bibliothèque numérique d'Alexandrie\". Qulle richesse en oeuvres anciennes et rares ; nous sommes nombreux à leur devoir beaucoup...@djack, as-tu essayé http://www.t411.telechargementz.tv/ebooks/  ?\nEn attendant, je suis demandeur d'une invitation à Ethor, ou Elite...mais étant nouveau sur ZN, je ne sais pas comment je la recevrais (si je la reçois un jour). Merci.",
				"added": 1499581330
			},
			{
				"comment_id": 2,
				"body": "hmmm..ah oui, ça y est, je crois que j'ai compris : en créant une mailbox dans zeromail sous mon ID...ça devrait marcher pour recevoir des  messages. Pas se moquer, je débute ici ! Bonne journée à tous.",
				"added": 1499582712
			},
			{
				"comment_id": 3,
				"body": "@djack : c'est vrai que T411 était une véritable bibliothèque, unique pour les francophones. Pour la musique, essaie rutracker, très vaste catalogue (il faut s'inscrire, et se donner un peu de mal pour traduire, pas de ratio exigé - mais chacun contribue honnêtement, vu qu'il y a toujours tôt ou tard des seeders) ; tu as aussi nextorrent.cc (pas encore très fourni), bonne chance ! ",
				"added": 1499623687
			}
		],
		"1_12ieSrCzre9k5CCveXhcoC2fNV5Xmnx2NN": [
			{
				"comment_id": 4,
				"body": "Pour la musique classique, il existe un site peu connu offrant de nombreux enregistrements anciens, en téléchargement libre, ici : http://renegagnaux.ch/577982/614226.html \nPrécieux pour ceux qui cherchent des œuvres et artistes non disponibles dans le commerce...\n",
				"added": 1499628712
			}
		],
		"5_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2": [
			{
				"comment_id": 5,
				"body": "Méfiance, méfiance... Bien des usurpateurs voudraient accaparer la base d'utilisateurs de T411. Là, par exemple seulement 7 (sept !) torrents en musique format FLAC (lossless)...ça fait sourire. Si c'était vraiment des membres de l'ancienne équipe, ils auraient sans aucun doute bien plus de contenu. De toutes manières, il est conseillé de ne pas fournir ses anciens identifiants T411, évidemment.\nLancer un nouveau site avec des objectifs louables, c'est bien, mais se prévaloir d'être \"le\" T411 qui reviendrait, c'est autre chose, si, comme je le pense les gens qui font ça ne sont pas les mêmes.",
				"added": 1500536315
			}
		]
	},
	"comment_vote": {
		"1_1K6iU6dHsLJN7A2uEgFD8qhZdPJoR3jEsi": 1
	}
}