{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "A Escola da Ponte - Rubem Alves",
			"body": "A Escola Básica da Ponte ou Escola da Ponte - Escola Básica Integrada de Aves/São Tomé de Negrelos, popularmente referida apenas como Escola da Ponte, é uma instituição pública de ensino, localizada em Vila das Aves e São Tomé de Negrelos, em Santo Tirso, no distrito do Porto, em Portugal, que proporciona aprendizagens a alunos do 1.º e 2.º Ciclo, dos 5 aos 13 anos, entre o 1º e o 9º ano, cujo método de ensino se baseia nas chamadas Escolas democráticas e numa educação inclusiva.\n\n- https://web.archive.org/web/20171118033358/http://servicos.educacao.rs.gov.br/dados/edcampo_texto_rubem_alves_a_escola_com_que_---_existir.pdf",
			"added": 1549560435
		},
		{
			"topic_id": 2,
			"title": "História",
			"body": "História é a ciência responsável por estudar os acontecimentos passados. Esse estudo, no entanto, não é feito de qualquer maneira, pois o historiador, em seu ofício, deve colocar em prática uma análise crítica do seu objeto de estudo a fim de racionalizar a conclusão sobre os acontecimentos investigados.\n\nA palavra “história” tem origem no idioma grego e é oriunda do vocábulo “hístor”, que significa “aprendizado”, “sábio”. Sendo assim, faz referência ao conhecimento obtido a partir da investigação e do estudo. A importância da História está em seu papel de nortear o homem no espaço e no tempo, dando-lhe a possibilidade de compreender a própria realidade.\n\nO conceito de História recebe definições distintas de acordo com diferentes historiadores. O historiador Marc Bloch, por exemplo, considera que a História não é a ciência que estuda os acontecimentos passados, mas sim a ciência que estuda o homem e sua ação no tempo. Outros entendem como o estudo das transformações na sociedade humana ao longo do tempo.\n\nNesse sentido, o papel do historiador é fazer uma análise crítica que o permita chegar a uma conclusão sobre determinado acontecimento passado a partir da investigação de fontes históricas. O historiador não deve glorificar ou demonizar determinado acontecimento, mas deve analisá-lo criticamente, utilizando todas as fontes que estiverem ao seu alcance e empregando métodos de análise que o auxiliem em seu exercício.",
			"added": 1549568165
		}
	],
	"topic_vote": {
		"1_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"1_1A2AJCxA3n4QjikssyECqWMk8xBYniBpWa": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 1,
				"body": "#O aluno computador -  Rubem Alves\n- Há perguntas para as quais a memória perfeita não consegue responder.\n\nEra uma vez um jovem casal muito feliz. Ela estava grávida e eles esperavam com grande ansiedade o filho que nasceria.\n\nTranscorridos os nove meses de gravidez, ela deu à luz um lindo computador! Que felicidade ter um computador como filho! Era o filho que desejavam! Por isso eles haviam rezado muito, durante toda a gravidez.. O batizado foi uma festança. Deram-lhe o nome de Memorioso, porque julgavam que uma memória perfeita é o essencial para uma boa educação. Educação é memorização. Crianças com memória perfeita vão bem na escola e não têm problemas para passar no vestibular.\n\nE foi isso mesmo que aconteceu. Memorioso memorizava tudo o que os professores ensinavam. E não reclamava. Seus companheiros reclamavam, diziam que aquelas coisas que lhes eram ensinadas não faziam sentido. Não aprendiam. Tiravam notas ruins. Ficavam de recuperação, o que não acontecia com Memorioso.\n\nEle memorizava com a mesma facilidade a maneira de extrair raiz quadrada, reações químicas, fórmulas de física, acidentes geográficos, datas de eventos históricos, regras de gramática, livros inteiros. A memória de Memorioso era perfeita.\n\nEle só tirava dez. E isso era motivo de grande orgulho para os seus pais. Os outros casais, pais e mães dos colegas de Memorioso, morriam de inveja. Quando seus filhos chegavam em casa trazendo boletins com notas vermelhas, eles gritavam: “Por que você não é como o Memorioso?”.\n\nMemorioso foi o primeiro no vestibular. O cursinho que ele freqüentara publicou sua fotografia em outdoors. Apareceu na televisão como exemplo a ser seguido por todos os jovens. Na universidade, foi a mesma coisa. Só tirava dez. Chegou, finalmente, o dia tão esperado: a formatura.\n\nMemorioso foi o grande herói, elogiado pelos professores. Ganhou medalhas e mesmo uma bolsa para doutoramento no Instituto de Tecnologia de Massachusetts. Depois da cerimônia acadêmica, estavam todos felizes no jantar. Até que uma linda moça se aproximou de Memorioso: “Eu gostaria de lhe fazer uma pergunta”, disse a jovem. “Pode fazer”, respondeu Memorioso, confiante.\n\nEle sabia todas as respostas. Aí ela fez a pergunta: “De tudo o que você tem memorizado, o que mais te comove?”.\nMemorioso ficou em silêncio. Aquela pergunta nunca lhe havia sido feita. Os circuitos de sua memória funcionavam com a velocidade da luz procurando a resposta. Mas ela não estava registrada em sua memória. Onde poderia estar? Seu rosto ficou vermelho. Começou a suar. Sua temperatura subiu. E, de repente, seus olhos ficaram muito abertos, parados, e se ouviu um chiado estranho dentro de sua cabeça, enquanto a fumaça saía por suas orelhas.\n\nMemorioso primeiro travou. Deixou de responder a estímulos. Depois apagou, entrou em coma. Levado às pressas para o hospital de computadores, verificaram que o seu disco rígido estava irreparavelmente danificado. Há perguntas para as quais a memória perfeita não consegue responder. É preciso coração.",
				"added": 1549560518
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 2,
				"body": "Se vocês obedecerem fielmente ao Senhor, ao seu Deus, e seguirem cuidadosamente todos os seus mandamentos que hoje lhes dou, o Senhor, o seu Deus, os colocará muito acima de todas as nações da terra.\nTodas estas bênçãos virão sobre vocês e os acompanharão, se vocês obedecerem ao Senhor, ao seu Deus:\nVocês serão abençoados na cidade e serão abençoados no campo.\nOs filhos do seu ventre serão abençoados, como também as colheitas da sua terra e os bezerros e os cordeiros dos seus rebanhos.\nA sua cesta e a sua amassadeira serão abençoadas.\nVocês serão abençoados em tudo o que fizerem.\nO Senhor concederá que sejam derrotados diante de vocês os inimigos que os atacarem. Virão a vocês por um caminho, e por sete fugirão.\nO Senhor enviará bênçãos aos seus celeiros e a tudo o que as suas mãos fizerem. O Senhor, o seu Deus, os abençoará na terra que lhes dá.\nO Senhor fará de vocês o seu povo santo, conforme prometeu sob juramento, se guardarem os mandamentos do Senhor, do seu Deus, e andarem nos caminhos dele.\nEntão todos os povos da terra verão que vocês são chamados pelo nome do Senhor e terão medo de vocês.\nO Senhor lhes concederá grande prosperidade, no fruto do seu ventre, nas crias dos seus animais e nas colheitas da sua terra, nesta terra que ele jurou aos seus antepassados que daria a vocês.\nO Senhor abrirá o céu, o depósito do seu tesouro, para enviar chuva à sua terra no devido tempo e para abençoar todo o trabalho das suas mãos. Vocês emprestarão a muitas nações, e de nenhuma tomarão emprestado.\nO Senhor fará de vocês a cabeça das nações, e não a cauda. Se obedecerem aos mandamentos do Senhor, do seu Deus, que hoje lhes dou e os seguirem cuidadosamente, vocês estarão sempre por cima, nunca por baixo.\nNão se desviem, nem para a direita nem para a esquerda, de qualquer dos mandamentos que hoje lhes dou, para seguir outros deuses e prestar-lhes culto.\nEntretanto, se vocês não obedecerem ao Senhor, ao seu Deus, e não seguirem cuidadosamente todos os seus mandamentos e decretos que hoje lhes dou, todas estas maldições cairão sobre vocês e os atingirão:\nVocês serão amaldiçoados na cidade e serão amaldiçoados no campo.\nA sua cesta e a sua amassadeira serão amaldiçoadas.\nOs filhos do seu ventre serão amaldiçoados, como também as colheitas da sua terra, os bezerros e os cordeiros dos seus rebanhos.\nVocês serão amaldiçoados em tudo o que fizerem.\nO Senhor enviará sobre vocês maldições, confusão e repreensão em tudo o que fizerem, até que vocês sejam destruídos e sofram repentina ruína pelo mal que praticaram ao se esquecerem dele.\nO Senhor os encherá de doenças até bani-los da terra em que vocês estão entrando para dela tomar posse.\nO Senhor os ferirá com doenças devastadoras, febre e inflamação, com calor abrasador e seca, com ferrugem e mofo, que os infestarão até que morram.\nO céu sobre a sua cabeça será como bronze; o chão debaixo de vocês, como ferro.\nNa sua terra o Senhor transformará a chuva em cinza e pó, que descerão do céu até que vocês sejam destruídos.\nO Senhor fará que vocês sejam derrotados pelos inimigos. Vocês irão a eles por um caminho, e por sete fugirão, e vocês se tornarão motivo de horror para todos os reinos da terra.\nOs seus cadáveres servirão de alimento para todas as aves do céu e para os animais da terra e não haverá quem os espante.\nO Senhor os castigará com as úlceras do Egito e com tumores, feridas purulentas e sarna, males dos quais vocês não poderão curar-se.\nO Senhor os afligirá com loucura, cegueira e confusão mental.\nAo meio-dia vocês ficarão tateando às voltas, como um cego na escuridão. Vocês não serão bem sucedidos em nada que fizerem; dia após dia serão oprimidos e roubados, sem que ninguém os salve.\nVocê ficará noivo de uma mulher, mas outro homem a possuirá. Construirá uma casa, mas não morará nela. Plantará uma vinha, mas não provará dos seus frutos.\nO seu boi será abatido diante dos seus olhos, mas você não comerá da sua carne. O seu jumento lhe será tirado à força e não lhe será devolvido. As suas ovelhas serão dadas aos inimigos, e ninguém as livrará.\nOs seus filhos e as suas filhas serão entregues a outra nação e os seus olhos se consumirão à espera deles, dia após dia, sem que você possa erguer uma só mão para trazê-los de volta.\nUm povo que vocês não conhecem comerá aquilo que a terra e o seu trabalho produzirem, e vocês sofrerão opressão cruel todos os seus dias.\nAquilo que os seus olhos virem os levarão à loucura.\nO Senhor afligirá os seus joelhos e as suas pernas com feridas dolorosas e incuráveis, e que se espalharão sobre vocês desde a sola do pé até o alto da cabeça.\nO Senhor os levará, e também o rei que os governar, a uma nação que você e seus antepassados nunca conheceram. Lá vocês adorarão outros deuses, deuses de madeira e de pedra.\nVocês serão motivo de horror e motivo de zombaria e de riso para todas as nações para onde o Senhor o levar.\nVocês semearão muito em sua terra, mas colherão bem pouco, porque gafanhotos devorarão quase tudo.\nPlantarão vinhas e as cultivarão, mas não beberão o vinho nem colherão as uvas, porque os vermes as comerão.\nVocês terão oliveiras em todo o país, mas vocês mesmos não utilizarão o azeite, porque as azeitonas cairão.\nOs seus filhos e filhas não ficarão com vocês, porque serão levados para o cativeiro.\nEnxames de gafanhotos se apoderarão de todas as suas árvores e das plantações da sua terra.\nOs estrangeiros que vivem no meio de vocês progredirão cada vez mais, e cada vez mais vocês regredirão.\nEles lhes emprestarão dinheiro, mas vocês não emprestarão a eles. Eles serão a cabeça, e vocês serão a cauda.\nTodas essas maldições cairão sobre vocês. Elas o perseguirão e o alcançarão até que sejam destruídos, porque não obedeceram ao Senhor, ao seu Deus, nem guardaram os mandamentos e decretos que ele lhes deu.\nEssas maldições serão um sinal e um prodígio para vocês e para os seus descendentes para sempre.\nUma vez que vocês não serviram com júbilo e alegria ao Senhor, ao seu Deus, na época da prosperidade,\nentão, em meio à fome e à sede, em nudez e pobreza extrema, vocês servirão aos inimigos que o Senhor enviará contra vocês. Ele porá um jugo de ferro sobre o seu pescoço, até que os tenham destruído.\nO Senhor trará, de um lugar longínquo, dos confins da terra, uma nação que virá contra vocês como a águia em mergulho, nação cujo idioma não compreenderão,\nnação de aparência feroz, sem respeito pelos idosos nem piedade para com os moços.\nEla devorará as crias dos seus animais e as plantações da sua terra até que vocês sejam destruídos. Ela não lhes deixará cereal, vinho, azeite, como também nenhum bezerro ou cordeiro dos seus rebanhos, até que vocês sejam arruinados.\nEla sitiará todas as cidades da sua terra, até que caiam os altos muros fortificados em que vocês confiam. Sitiará todas as suas cidades, em toda a terra que o Senhor, o seu Deus, lhe dá.\nPor causa do sofrimento que o seu inimigo lhes infligirá durante o cerco, vocês comerão o fruto do próprio ventre, a carne dos filhos e filhas que o Senhor, o seu Deus, lhes deu.\nAté mesmo o homem mais gentil e educado entre vocês não terá compaixão do seu irmão, da mulher que ama e dos filhos que sobreviverem,\nde modo que não dará a nenhum deles nenhum pedaço da carne dos seus filhos que estiver comendo, pois nada lhe sobrará devido aos sofrimentos que o seu inimigo lhe infligirá durante o cerco de todas as suas cidades.\nA mulher mais gentil e delicada entre vocês, tão delicada e gentil que não ousaria encostar no chão a sola do pé, será mesquinha com o marido a quem ama e com o filho e a filha,\nnão lhes dando a placenta do ventre nem os filhos que gerar. Pois a sua intenção é comê-los secretamente durante o cerco e no sofrimento que o seu inimigo infligirá a você em suas cidades.\nSe vocês não seguirem fielmente todas as palavras desta lei, escritas neste livro, e não temerem este nome glorioso e terrível, o Senhor, o seu Deus,\nele enviará pestes terríveis sobre vocês e sobre os seus descendentes, desgraças horríveis e prolongadas, doenças graves e persistentes.\nEle trará sobre vocês todas as temíveis doenças do Egito, e vocês as contrairão.\nO Senhor também fará vir sobre vocês todo tipo de enfermidade e desgraça não registradas neste Livro da Lei, até que sejam destruídos.\nVocês, que no passado foram tantos quanto as estrelas do céu, ficarão reduzidos a um pequeno número, porque não obedeceram ao Senhor, ao seu Deus.\nAssim como foi agradável ao Senhor fazê-los prosperar e aumentar em número, também lhe será agradável arruiná-los e destruí-los. Vocês serão desarraigados da terra em que estão entrando para dela tomar posse.\nEntão o Senhor os espalhará pelas nações, de um lado ao outro da terra. Ali vocês adorarão outros deuses; deuses de madeira e de pedra, que vocês e os seus antepassados nunca conheceram.\nNo meio daquelas nações vocês não encontrarão repouso, nem mesmo um lugar de descanso para a sola dos pés. Lá o Senhor lhes dará coração desesperado, olhos exaustos de tanto esperar, e alma ansiosa.\nVocês viverão em constante incerteza, cheios de terror, dia e noite, sem nenhuma segurança na vida.\nDe manhã dirão: \"Quem me dera fosse noite! \" E de noite: \"Ah, quem me dera fosse dia! \", por causa do terror que lhes encherá o coração e por aquilo que os seus olhos verão.\nO Senhor os enviará de volta ao Egito, ou em navios ou pelo caminho que eu lhes disse que nunca mais poderiam percorrer. Lá vocês serão postos à venda como escravos e escravas, mas ninguém os comprará.\n\n- Deuteronômio 28:1-68",
				"added": 1549560630
			},
			{
				"comment_id": 3,
				"body": "Vocês não sabem que os perversos não herdarão o Reino de Deus? Não se deixem enganar: nem imorais, nem idólatras, nem adúlteros, nem homossexuais passivos ou ativos,\nnem ladrões, nem avarentos, nem alcoólatras, nem caluniadores, nem trapaceiros herdarão o Reino de Deus.\nAssim foram alguns de vocês. Mas vocês foram lavados, foram santificados, foram justificados no nome do Senhor Jesus Cristo e no Espírito de nosso Deus.\n#\"Tudo me é permitido\", mas nem tudo convém. \"Tudo me é permitido\", mas eu não deixarei que nada domine.\n\n- 1 Coríntios 6:9-12",
				"added": 1549560760
			},
			{
				"comment_id": 4,
				"body": "#Dicionário Bíblico\n\n- https://web.archive.org/web/20181230033249/http://www.cenovalianca.com.br/biblia/dicionario_biblico_strong.pdf",
				"added": 1549562352
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 5,
				"body": "#Ilíada e Odisseia – Homero\n\n\nIlíada e Odisseia são os maiores clássicos da literatura ocidental. Seus elementos míticos influenciaram a cultura através dos séculos e ainda conseguem dialogar com leitores de hoje. A Editora Nova Fronteira traz ao mercado uma edição especial dessas obras-primas de Homero, num boxe de luxo, com a famosa tradução de Carlos Alberto Nunes. Ilíada é considerada uma obra-prima da poesia épica. Verdadeiro marco da literatura ocidental, o grande poema narra, em 24 cantos, os episódios do nono ano da famosa Guerra de Troia. As batalhas iniciadas quando Helena, esposa do rei de Esparta, é raptada por Páris, príncipe de Troia, desencadeiam também um duelo entre deuses e humanos. Ao romper os limiares do tempo, Ilíada chega aos dias de hoje como um livro indispensável. Odisseia é uma das mais inspiradas a venturas já criadas pelo espírito humano. O grande poema conta o regresso de Odisseu à sua terra natal, após dez anos de conflitos na Guerra de Troia. O herói grego, com astúcia, inteligência e força, vive episódios memoráveis em busca da reconquista de seu território e do amor de sua esposa, Penélope. A história narrada por Homero continua conquistando gerações de leitores e é considerada um clássico da literatura mundial.\n\n\n- https://mega.nz/#!XywVzKTJ!rHtxbmS9mU0fuHN2NvW6BFFC1vcK7GM-6E3YO3M2VeY",
				"added": 1549563975
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 7,
				"body": "#Revolução Francesa\n\n\n#Contexto Histórico: A França no século XVIII \n\n\n\nA situação da França, no século XVIII, era de extrema injustiça social na época do Antigo Regime. O Terceiro Estado era formado pelos trabalhadores urbanos, camponeses e a pequena burguesia comercial. Os impostos eram pagos somente por este segmento social, com o objetivo de manter os luxos da nobreza.\n\n \n\nNessa época, a França era um país, que possuía um governo absolutista. O rei governava com poderes absolutos, controlando a economia, a justiça, a política e até mesmo a religião dos súditos. Havia falta de democracia, pois os trabalhadores não podiam votar e nem mesmo dar opiniões na forma de governo. Os oposicionistas eram presos na Bastilha (prisão política da monarquia) ou condenados à morte.\n\n \n\nA sociedade francesa, do século XVIII, era estratificada e hierarquizada. No topo da pirâmide social estava o clero, que também tinha o privilégio de não pagar impostos. Abaixo do clero, estava a nobreza; formada pelo rei e sua família, condes, duques, marqueses e outros nobres que viviam de banquetes e muito luxo na corte. A base da sociedade era formada pelo terceiro estado (trabalhadores, camponeses e burguesia) que, como já dissemos, sustentava toda a sociedade com seu trabalho e com o pagamento de altos impostos. A condição de vida dos desempregados, que aumentavam em larga escala nas cidades francesas, era dramática.\n\n \n\nA vida dos trabalhadores e camponeses era de extrema miséria. Por esta razão, desejavam melhorias na qualidade de vida e de trabalho. A burguesia, mesmo tendo uma condição social melhor, desejava uma participação política maior e mais liberdade econômica em seu trabalho.\n\n \n\n#A Revolução Francesa: Queda da Bastilha, fases e principais acontecimentos\n\n\n\nA situação social era tão grave e o nível de insatisfação popular tão grande, que o povo foi às ruas com o objetivo de tomar o poder e arrancar do governo a monarquia comandada pelo rei Luís XVI. O primeiro alvo dos revolucionários foi a Bastilha. A Queda da Bastilha, em 14/07/1789, marca o início do processo revolucionário, pois a prisão política era o símbolo da monarquia francesa.\n\n \n\nO lema dos revolucionários era \"Liberdade, Igualdade e Fraternidade \", pois ele resumia muito bem os desejos do terceiro estado francês.\n\n\nDurante o processo revolucionário, grande parte da nobreza deixou a França; porém, a família real foi capturada enquanto tentava fugir do país. Presos, os integrantes da monarquia, entre eles o rei Luís XVI e sua esposa Maria Antonieta, foram guilhotinados, em 1793. O clero também não saiu impune, pois os bens da Igreja foram confiscados durante a revolução.\n\n \n\nNo mês de agosto de 1789, a Assembleia Constituinte cancelou todos os direitos feudais que existiam. E promulgou a Declaração dos Direitos do Homem e do Cidadão. Este importante documento, trazia significativos avanços sociais, que garantiam direitos iguais aos cidadãos, além de maior participação política para o povo.\n\n\n#Girondinos e Jacobinos\n\n\nApós a revolução, o terceiro estado começou a se transformar. Em decorrência disso, começaram a surgir partidos com opiniões diversificadas. Os girondinos, por exemplo, representavam a alta burguesia e queriam evitar uma participação maior dos trabalhadores urbanos e rurais na política. Por outro lado, os jacobinos, representavam a baixa burguesia e defendiam uma maior participação popular no governo. Liderados por Robespierre e Saint-Just, os jacobinos eram radicais e defendiam, também, profundas mudanças na sociedade que beneficiassem os mais pobres.\n\n#A Fase do Terror \n\n\n\n \n\nEm 1792, os radicais jacobinos, liderados por Robespierre, Danton e Marat, assumiram o poder e a organização das guardas nacionais. Estas, receberam ordens, dos líderes, para matar qualquer oposicionista do novo governo. Muitos integrantes da nobreza e outros franceses de oposição foram condenados a morte neste período. A violência e a radicalização política foram as principais marcas desta época.\n\n#A burguesia no poder \n\nEm 1795, os girondinos assumiram o poder e começaram a instalar um governo burguês na França. Uma nova Constituição foi aprovada, garantindo o poder da burguesia e ampliando seus direitos políticos e econômicos. O general francês, Napoleão Bonaparte, foi colocado no poder após o Golpe de 18 de Brumário, em 9 de novembro de 1799, com o objetivo de controlar a instabilidade social e implantar um governo burguês. Napoleão assumiu o cargo de primeiro-cônsul da França, instaurando uma ditadura.\n\n \n\n#Conclusão\n\n\n\nA Revolução Francesa foi um importante marco na História Moderna da nossa civilização. Significou o fim do sistema absolutista e dos privilégios da nobreza. O povo ganhou mais autonomia e seus direitos sociais passaram a ser respeitados. A vida dos trabalhadores, urbanos e rurais, melhorou significativamente. Por outro lado, a burguesia conduziu o processo de forma a garantir seu o domínio político e social. As bases de uma sociedade burguesa e capitalista foram estabelecidas durante a revolução. Os ideais políticos, (principalmente iluministas) presentes na França antes da Revolução Francesa, também influenciaram o processo de independência de alguns países da América Espanhola e o movimento de Inconfidência Mineira no Brasil.\n\n- Fonte: https://suapesquisa.com/",
				"added": 1549569115
			},
			{
				"comment_id": 8,
				"body": "#Religiosidade na revolução francesa\n\nEste livro aborda o estudo da relação Religião-Revolução num caso paradigmático: a Revolução Francesa.\n\n- https://mega.nz/#!X7ZklIxZ!6c_LND-OZNx5pfiz5hhL3sHsr_De3Okr-q9Uhv6iJU0",
				"added": 1549569505
			},
			{
				"comment_id": 10,
				"body": "#Hebreus\n\nOs hebreus são conhecidos como israelitas ou judeus. Antepassados do povo judeu, os hebreus têm uma historia marcada por migrações e pelo monoteísmo.\n\nMuitas informações sobre a história dos hebreus baseiam-se na interpretação de textos do Antigo Testamento, a primeira parte da Bíblia. O Antigo testamento foi escrito com base na tradição oral dos hebreus. Consta dele, por exemplo, a interpretação feita por esse povo da origem do mundo e de muitas das normas éticas e morais de sua sociedade. Convém ressaltar, entretanto, que esses textos são repletos de símbolos e sua interpretação é bastante difícil.\n\nVestígios da sociedade hebraica continuam sendo encontrados. Eles contribuem para lançar novas luzes sobre a história dos hebreus.\n\nSegundo a tradição, Abraão, o patriarca fundador da nação hebraica, recebeu de Deus a missão de migrar para Canaã, terra dos cananeus, depois chamada de palestina, onde se localiza hoje a Estado de Israel.\n\nApós passarem um período na terra dos cananeus, os hebreus, foram para o Egito, onde viveram em 300 e 400 anos, e acabaram transformados em escravos. Sua historia começa a ganhar destaque a partir do momento em que resolvem sair do Egito e, sob a liderança de Moisés, voltar a Canaã. Na história judaica, esse retorno é chamado de êxodo e aconteceu entre 1300 e 1250 a.C.\n\nEm 70 d.C., a Palestina  era uma província do Império Romano; as muitas rebeliões ocorridas na região levaram o governo imperial a expulsar os hebreus da Palestina. Esse acontecimento é denominado de diáspora. Até 1948, quando foi fundado o estado de Israel, os judeus viveram sem pátria, atualmente são os palestinos que não tem pátria, pois suas terras foram tomadas pelos israelenses.\n\nPraticam a agricultura, o pastoreio, o artesanato e o comércio. Têm por base social o trabalho de escravos e servos. As tribos são dirigidas de forma absoluta pelos chefes de família (patriarcas), que acumulam as funções de sacerdote, juiz e chefe militar. Com a unificação destas, a partir de 1010 a.C., elegem juízes para vigiar o cumprimento do culto e da lei. Depois se unem em torno do rei. Produzem uma literatura dispersa, mas importante, contida em parte na Bíblia e no Talmude.\n\n#Localização\n\nA Palestina localizava-se em uma estreita faixa a sudoeste do atual Líbano. O rio Jordão divide a região em duas partes: a leste a Transjordânia; e a oeste, a Cisjordânia. Essa região é atualmente ocupada pelo estado de Israel.\n\nAté hoje a região é bastaste árida. O principal rio é o Jordão, e assim mesmo não era suficiente para grandes obras de irrigação. Um solo pouco fértil e um clima bastante seco impediam que a região fosse rica. No entanto, tinha bastante importância, pois era passagem e ligação entre a Mesopotâmia e a Ásia Menor. E foi nessa região que assentou o povo hebreu, um entre os muitos que vagaram e se estabeleceram na Palestina.\n\n#Organização social e política dos hebreus\n\nApós a morte de Moisés, os hebreus chegaram à palestina e, sob a liderança de Josué, que cruza o rio Jordão, combate com os cananeus que então habitavam a terra prometida. Vencidos os cananeus, os israelitas se estabelecem na Palestina. Nessa época, o povo hebreu estava dividido em 12 tribos (“os doze filhos de Israel”), que viviam em clãs compostos pelos patriarcas, seus filhos, mulheres e trabalhadores não livres.\n\nO poder e prestígio desses clãs eram personificados pelo patriarca, e os laços entre esses clãs eram muito frágeis. Porém, devido às lutas pelas conquistas de Canaã ou Terra Prometida, surgiu necessidade do poder e do comando estar nas mãos de chefes militares. Estes chefes passaram a ser conhecidos como Juizes.\n\nCom a concentração do poder em suas mãos, os juizes procuraram à união das doze tribos, pois ela possibilitaria a realização do objeto comum: O domínio da Palestina.  As principais lideranças deste período foram os juizes: Sansão, Otoniel, Gideão e Samuel, todos eram considerados enviados de Jeová, para comandar os Hebreus.\n\nA união das doze tribos era difícil de ser conseguida e mantida, pois os juizes tinham um poder temporário e mesmo com a unidade cultural, (língua, costumes, e, principalmente religião), havia muita divisão política entre as tribos. Assim foi preciso estabelecer uma unidade política. Isto foi conseguido através da centralização do poder nas mãos de um monarca, Rei, o qual teria sido escolhido por Jeová para governar. \n\n#Os reis hebreus\n\nO primeiro rei hebreu foi Saul (1010 a.C.) que liderou guerras contra os filisteus, porém morreu sem conseguir vencê-los. Foi sucedido por Davi (1006 a 966 a.C.), que conseguiu derrotar os filisteus e estabeleceu domínio sobre a Palestina, fundando o Estado Hebreu, cuja a capital passou a ser Jerusalém. E iniciou uma fase marcada pelo expansionismo militar e pela prosperidade.\n\nEm seguida, Salomão ( 966 a 926 a.C.); sábio e pacífico famoso pelo poder e riqueza. Filho de Davi desenvolveu o comércio, aumentando a influência do reinado sem recorrer a guerra. No entanto a fartura e a riqueza que marcaram o seu reinado exigiam o constante aumento de impostos, que empobreciam mais e mais o trabalhador, criando um clima de insatisfação no povo hebreu.\n\n#O cisma político-religioso: os reinos de Israel e Judá\n\nApós a morte de Salomão, houve a divisão política e religiosa das tribos e o fim da monarquia unificada.\n\nOs hebreus dividiram-se em Dez tribos do norte e formaram o Reino de Israel, liderados por Jerobaão. Após disputas internas, chegaram a um acordo em 878 a.C., com a escolha  de Omri para rei. Apesar de a veneração a Iavé persistir, foi introduzido o culto a vários deuses.\n\nDuas tribos do sul e formaram o Reino Judá, liderados por Reoboão, filho de Salomão (924 a.C.). \n\n#A dominação estrangeira\n\nO Reino de Israel, desde o inicio viveu na idolatria; isto fez com que a ira de Deus se manifestasse sobre ele permitindo que no ano 722 a.C., fosse conquistado por Sargão II, da Assíria, e seu povo fosse levado para o cativeiro, sendo seu território habitado por outros povos, ali colocados por ordem do rei da Assíria.\n\nO castigo de Deus veio sobre ela através do rei Nabucodonosor, da Babilônia, no ano 586 a.C. A cidade santa, Jerusalém, foi destruída  e o Templo queimado e os nobres eram amarrados e levados para o cativeiro.\n\nO cativeiro durou até os dias de Ciro, rei da Pérsia que permitiu que o povo que estava escravizado na Caldeia, regressar a Palestina e reerguer o Templo de Jerusalém (536 a.C.). A seguir a Palestina foi invadida por Alexandre da Macedônia (322 a.C.). Depois passou a seu protetorado egípcio (301 a.C.), Colônia Síria (198 a.C.), e província romana (63 a.C.).\n\nNo ano 70 da era cristã, após uma fracassada revolta contra a dominação romana, Jerusalém foi conquistada por Tito e seus exércitos, ocorrendo uma segunda destruição do Templo. Atualmente do templo de Jerusalém resta apenas um muro, conhecido como o Muro das Lamentações.\n\n#A religião dos hebreus\n\nOs hebreus foram um dos primeiros povos a cultuar um único deus, isto é, eram monoteístas. No judaísmo, religião professada pelos hebreus, o único deus é Javé, cuja imagem não pode ser representada em pinturas ou estátuas.\n\nO judaísmo é baseado nos Dez Mandamentos supostamente revelados a Moisés no monte Sinai. Os dois traços característicos da religião dos hebreus são o monoteísmo e o salvacionismo isto é a crença na vinda de um Messias ou Salvador para libertar o povo hebreu.\n\nO Judaísmo constitui uma das bases do cristianismo, com o qual o Islamismo formou tríade das religiões universais.\n\n#Aspectos culturais\n\nDa cultura criada pelos hebreus, a religião, é sem dúvida o legado mais importante. A escrita e literatura, entre os hebreus, povo de língua semita, surgiu muito cedo através de uma escrita própria. A arqueologia revelou a existência da escrita a partir de meados do segundo milênios a. C., (época do Êxodo). Aos poucos, porém eles foram substituindo, em sua escrita a sua língua original pelo aramaico, que era a língua comercial e diplomática do Oriente, próximo na antiguidade. O alfabeto hebraico atual é uma variedade do aramaico, que juntamente com a língua aramaica tornou-se muito difundido, suplantando os outros alfabetos e línguas semitas.\n\nNas artes o monoteísmo hebraico influenciou todas as realizações culturais dos hebreus. Deve-se destacar a arquitetura, especialmente a construção de Templos, muralhas e fortificações. A maior realização arquitetônica foi o Templo de Jerusalém.\n\n Nas ciências, não apresentaram progresso notável. A importância cultural da sociedade hebraica residiu principalmente na esfera religiosa e moral (na lei Mosaica), sua área de influência atingiu o Ocidente e grande parte do oriente.\n\n\n- Fonte: https://www.sohistoria.com.br/",
				"added": 1549580176
			},
			{
				"comment_id": 11,
				"body": "#Grécia Antiga - resumo\n\n#Introdução (origens, colonização e pólis)\n\n \n\nA civilização grega surgiu entre os mares Egeu, Jônico e Mediterrâneo, por volta de 2.000 a.C. Formou-se após a migração de tribos nômades de origem indo-europeia, como, por exemplo, aqueus, jônios, eólios e dórios. As pólis (cidades-estado), unidades político-administrativas, caracterizaram a vida política dos gregos. Elas surgiram por volta do século VIII a.C. As duas pólis mais importantes da Grécia Antiga foram: Esparta e Atenas.\n\n#Expansão do povo grego (diáspora) \n\n \n\nEntre os séculos VII a.C. e V a.C. aconteceram várias migrações de povos gregos para vários pontos do Mar Mediterrâneo, como consequência do grande crescimento populacional, dos conflitos internos e da necessidade de novos territórios para a prática da agricultura. Na região da Trácia, os gregos fundaram colônias, na parte sul da Península Itálica e fizeram o mesmo na região da Ásia Menor (Turquia atual). Os conflitos e desentendimentos entre as colônias da Ásia Menor e o Império Persa ocasionaram as famosas Guerras Médicas (499 a.C. a 449 a.C.), em que os gregos saíram vitoriosos.\n\nEsparta e Atenas envolveram-se na Guerra do Peloponeso (431 a.C. a 404 a.C.), vencida por Esparta. No ano de 359 a.C., as pólis gregas foram dominadas e controladas pelos Macedônios. \n\n#Economia da Grécia Antiga \n\n \n\nA economia dos gregos baseava-se, principalmente, no cultivo de oliveiras, trigo e vinhedos. O artesanato grego, com destaque para a cerâmica, teve grande a aceitação no Mar Mediterrâneo. As ânforas gregas eram usadas para o transporte de vinhos, azeites e perfumes para os quatro cantos da península. Com o comércio marítimo, os gregos alcançaram grande desenvolvimento, chegando até mesmo a cunhar moedas de metal. Os escravos, devedores ou prisioneiros de guerras, foram utilizados como mão de obra na Grécia. Cada cidade-estado tinha seu próprio sistema político-administrativo, organização social e deuses protetores.\n\n #Cultura e religião (principais características)\n\n \n\nFoi na Grécia Antiga, na cidade de Olímpia, que surgiram os Jogos Olímpicos em homenagem aos deuses. Os gregos também desenvolveram uma rica mitologia. Até os dias de hoje, a mitologia grega é referência para estudos e livros. A filosofia também atingiu um desenvolvimento surpreendente, principalmente em Atenas, no século V (Período Clássico da Grécia). Platão e Sócrates são os filósofos mais conhecidos deste período.\n\n \n\nA dramaturgia grega também pode ser destacada. Quase todas as cidades gregas possuíam anfiteatros, onde os atores apresentavam peças dramáticas ou comédias, usando máscaras. A poesia, a história, as artes plásticas e a arquitetura foram também muito importantes na cultura grega.\n\n \n\nA religião politeísta grega tinha uma forte marca humanista. Os deuses possuíam, ao mesmo tempo, características humanas e divinas. Os heróis gregos (semideuses) eram os filhos de deuses com mortais. Zeus, deus dos deuses, comandava todos os demais, do topo do monte Olimpo. Podemos destacar outros deuses gregos: Atena (deusa das artes), Apolo (deus do Sol), Ártemis (deusa da caça e protetora das cidades), Afrodite (deusa do amor, do sexo e da beleza corporal), Deméter (deusa das colheitas), Hermes (mensageiro dos deuses) entre outros. A mitologia grega também era muito importante na vida desta civilização, pois através dos mitos e lendas, os gregos transmitiam mensagens, tradições, explicações o funcionamento do mundo e ensinamentos importantes.\n\n \n\nOs gregos acreditavam que era possível consultar os deuses nos oráculos. Eles acreditavam que, nestes locais sagrados, os deuses ficavam orientando as pessoas sobre questões importantes da vida cotidiana e desvendando os fatos que poderiam acontecer no futuro. O oráculo mais importante era o de Delfos.\n\n \n\nNa arquitetura, os gregos ergueram palácios, templos e acrópoles de mármore no topo de montanhas. As decisões políticas, principalmente em Atenas, cidade onde surgiu a democracia grega, eram tomadas na Ágora (espaço público de debate político). \n\n#Aconteceu na História da Grécia:\n\n \n\n- Em 776 a.C., foram iniciados os Primeiros Jogos Olímpicos da história, realizados na cidade grega de Olímpia.\n\n \n\n- Em 594 a.C., o legislador grego Sólon deu início a uma ampla reforma política, econômica e social em Atenas.\n\n \n\n- Em 490 a.C., os gregos venceram os persas na batalha de Maratona, no contexto das Guerra Médicas.\n\n \n\n- Em 478 a.C., Atenas implementou a Liga de Delos (aliança militar grega) para combater os persas durante as Guerras Médicas.\n\n#Fonte: https://www.suapesquisa.com/\n",
				"added": 1549580614
			},
			{
				"comment_id": 12,
				"body": "#História da Roma Antiga e o Império Romano\n\n#Introdução\n\n\nA história de Roma Antiga é fascinante em função da cultura desenvolvida e dos avanços conseguidos por esta civilização. De uma pequena cidade, tornou-se um dos maiores impérios da antiguidade. Dos romanos, herdamos uma série de características culturais. O Direito Romano está presente na cultura ocidental até os dias de hoje. De igual forma o latim, que deu origem a língua portuguesa, francesa, italiana e espanhola.\n\n \n\n#Origem de Roma: explicação mitológica\n\n\nOs romanos explicavam a origem de sua cidade através do mito de Rômulo e Remo. Segundo a mitologia romana, os gêmeos foram jogados no rio Tibre, na Itália. Resgatados por uma loba, que os amamentou, foram criados, posteriormente, por um casal de pastores. Quando se tornaram adultos, os gêmeos retornaram a cidade natal de Alba Longa e ganharam terras para fundar uma nova cidade, que seria Roma.\n\n \n\n#Origens de Roma: explicação histórica e Monarquia Romana (753 a.C. a 509 a.C.)\n\n\nDe acordo com os historiadores, a fundação de Roma resulta da mistura de três povos que foram habitar a região da Península Itálica: gregos, etruscos e italiotas. Na região, desenvolveu-se uma economia baseada na agricultura e nas atividades pastoris. A sociedade, naquela época, era formada por patrícios (nobres proprietários de terras) e plebeus (comerciantes, artesãos e pequenos proprietários). O sistema político era a monarquia, já que a cidade era governada por um rei de origem patrícia.\n\n\nA religião era politeísta e adotava deuses semelhantes aos dos gregos, porém, com nomes diferentes. Nas artes, destacavam-se a pintura de afrescos, murais decorativos e esculturas com influências gregas.\n\n \n\n#República Romana (509 a.C. a 27 a.C.)\n\n\nDurante o período republicano, o senado Romano ganhou grande poder político. Os senadores, de origem patrícia, cuidavam das finanças públicas, da administração e da política externa. As atividades executivas eram exercidas pelos cônsules e pelos tribunos da plebe. \n\n\nA criação dos tribunos da plebe estava ligada às lutas dos plebeus por uma maior participação política e melhores condições de vida.  \n\n\nEm 367 a.C., foi aprovada a Lei Licínia, que garantia a participação dos plebeus no Consulado (dois cônsules eram eleitos: um patrício e um plebeu). Esta lei também acabou com a escravidão por dívidas (era válida somente para cidadãos romanos).\n\n \n\n#Formação e Expansão do Império Romano\n\n\nApós dominar toda a Península Itálica, os romanos partiram para as conquistas de outros territórios. Com um exército bem preparado e com muitos recursos, venceram os cartagineses, liderados pelo general Aníbal, nas Guerras Púnicas (século III a.C.). Esta vitória foi muito importante, pois garantiu a supremacia romana no Mar Mediterrâneo. Os romanos passaram a chamar o Mediterrâneo de Mare Nostrum (Nosso Mar).\n\n\nApós dominar Cartago, Roma ampliou suas conquistas dominando a Grécia, o Egito, a Macedônia, a Gália, a Germânia, a Trácia, a Síria e a Palestina.\n\n \n\nCom as conquistas, a vida e a estrutura de Roma passaram por significativas mudanças. O império romano passou a ser muito mais comercial do que agrário. Povos conquistados foram escravizados ou passaram a pagar impostos para o império. As províncias (regiões controladas por Roma) renderam grandes recursos para Roma. A capital do Império Romano enriqueceu e a vida dos romanos mudou.\n\n \n\n- Principais imperadores romanos: Augusto (27 a.C. - 14 d.C.), Tibério (14-37), Caligula (37-41), Nero (54-68), Marco Aurelio (161-180), Comodus (180-192).\n\n #Pão e Circo \n\n\nCom o crescimento urbano vieram também os problemas sociais para Roma. A escravidão gerou muito desemprego na zona rural, pois muitos camponeses perderam seus empregos. Esta massa de desempregados migrou para as cidades romanas em busca de empregos e melhores condições de vida. Receoso de que pudesse acontecer alguma revolta de desempregados, o imperador criou a política do Pão e Circo. Esta consistia em oferecer, aos romanos, alimentação e diversão. Quase todos os dias ocorriam lutas de gladiadores nos estádios (o mais famoso foi o Coliseu de Roma), onde eram distribuídos alimentos. Desta forma, a população carente acabava se esquecendo dos problemas da vida. Assim, as chances de revolta eram diminuídas.\n\n\n#Cultura Romana\n\n\nA cultura romana foi muito influenciada pela cultura grega. Os romanos \"copiaram\" muitos aspectos da arte, pintura e arquitetura grega.\n\n\nOs balneários romanos foram espalhados pelas grandes cidades. Eram locais muito frequentados por senadores e membros da aristocracia romana. Eles utilizavam estes espaços para discutirem política e ampliar seus relacionamentos pessoais.\n\n\nA língua romana era o latim, que depois de um tempo, espalhou-se pelos quatro cantos do império dando origem, na Idade Média, ao português, francês, italiano e espanhol.\n\n\nA mitologia romana representava formas de explicação da realidade que os romanos não conseguiam explicar de forma científica. Tratava também da origem de seu povo e da cidade que deu origem ao império. Entre os principais mitos romanos, podemos destacar: Rômulo e Remo e O rapto de Proserpina.\n\n \n\n#Religião Romana \n\n\nOs romanos eram politeístas, ou seja, acreditavam em vários deuses. Grande parte dos deuses romanos foi retirada do panteão grego, porém, os nomes originais foram mudados. Muitos deuses de regiões conquistadas também foram incorporados aos cultos romanos. Os deuses eram antropomórficos, ou seja, possuíam características (qualidades e defeitos) de seres humanos, além de serem representados em forma humana. Além dos deuses principais, os romanos cultuavam também os deuses lares e penates. Estes deuses eram cultuados dentro das casas e protegiam a família.\n\n\n- Principais deuses romanos: Júpiter, Juno, Apolo, Marte, Diana, Vênus, Ceres e Baco.\n\n \n\n#Crise e decadência do Império Romano\n\n\nPor volta do século III, o império romano passava por uma enorme crise econômica e política. A corrupção dentro do governo e os gastos com luxo retiraram recursos para o investimento no exército romano. Com o fim das conquistas territoriais, diminuiu o número de escravos, provocando uma queda na produção agrícola. Na mesma proporção, caia o pagamento de tributos originados das províncias.\n\n\nEm crise e com o exército enfraquecido, as fronteiras ficavam a cada dia mais desprotegidas. Muitos soldados, sem receber salário, deixavam suas obrigações militares. \n\n \n\nOs povos germânicos, tratados como bárbaros pelos romanos, estavam forçando a penetração pelas fronteiras do norte do império. No ano de 395, o imperador Teodósio resolveu dividir o império em: Império Romano do Ocidente, com capital em Roma, e Império Romano do Oriente (Império Bizantino), com capital em Constantinopla.\n\n\nEm 476, chegou ao fim o Império Romano do Ocidente, após a invasão de diversos povos bárbaros, entre eles, visigodos, vândalos, burgúndios, suevos, saxões, ostrogodos, hunos etc. Foi o fim da Antiguidade e início de uma nova época, chamada de Idade Média.\n\n \n\n#Legado Romano\n\n \n\nMuitos aspectos culturais, científicos, artísticos e linguísticos romanos continuam presentes até os dias de hoje, enriquecendo a cultura ocidental. Podemos destacar como exemplos deste legado: o Direito Romano, técnicas de arquitetura, línguas latinas originárias do Latim (Português, Francês, Espanhol e Italiano), técnicas de artes plásticas, filosofia e literatura.\n\n- Fonte: https://www.suapesquisa.com/",
				"added": 1549580891
			},
			{
				"comment_id": 13,
				"body": "#Babilônia\n\n#Introdução \n\n\nMuitos historiadores afirmam que a Babilônia é um dos berços das civilizações, pois é uma das sociedades mais antigas que conhecemos. Situada na região da Mesopotâmia (entre os rios Tigre e Eufrates) apresentou um grande desenvolvimento social, econômico, político e cultural. Achados arqueológicos apontam para a existência da sociedade babilônica há mais de cinco mil anos.\n\n \n\n#Reinado de Hamurabi \n\n\nA grandiosidade da Babilônia apareceu durante o reinado de Hamurabi. Este rei, utilizando sua habilidade bélica, conquistou várias cidades e regiões ao redor. Governou criando leis severas. O Código de Hamurabi baseava-se na ideia do “olho por olho, dente por dente”. Ou seja, a pessoa que cometia uma irregularidade ou crime pagava com uma punição no mesmo sentido e intensidade. Este código de leis foi registrado em escrita cuneiforme e gravado em pedras de argila. A economia da região era baseada na agricultura (praticada às margens dos rios Tigre e Eufrates) e no comércio.\n\n\n\nDurante esta época a Babilônia tornou-se uma das regiões mais prósperas do mundo antigo. A cidade era composta de habitações luxuosas e grandes templos religiosos. Estes, eram administrados pelos sacerdotes, que também tinham a função de tomar conta das finanças do governo.\n\n\n\n#Reinado de Nabucodonosor \n\n\nApós a morte de Hamurabi, a Babilônia perdeu força e foi invadida e conquistada por diversas tribos da região. Voltou a ganhar poder e importância somente no século VI AC, durante o reinado de Nabucodonosor. Este rei retomou as conquistas e ampliou as áreas de domínio e influência. Ordenou a construção de muralhas em volta da cidade. Dentro das muralhas foram construídos diversos templos e palácios luxuosos, decorados com pinturas e jardins. Para sua esposa, Nabucodonosor ordenou a construção dos famosos Jardins Suspensos da Babilônia (uma das sete maravilhas do mundo antigo).\n\n\n\n#Curiosidade:\n\n\n- A agricultura na Babilônia era praticada graças a um complexo sistema de canais de irrigação, construídos nas margens dos rios Tigre e Eufrates. Estes canais conduziam a água para regiões mais internas da cidade. Faziam também reservatórios de águas. A agricultura baseava-se, principalmente, na produção de cereais.",
				"added": 1549581390
			},
			{
				"comment_id": 14,
				"body": "#História da Mesopotâmia\n\n#Introdução (origem e significado do nome)\n\n \n\nA palavra mesopotâmia é de origem grega e significa \"terra entre rios\". Essa região, localiza-se entre os rios Tigre e Eufrates, no Oriente Médio, onde atualmente é o Iraque. Esta civilização é considerada uma das mais antigas da história.\n\n \n\n#Principais povos mespototâmicos\n\n \n\nVários povos antigos habitaram a região da Mesopotâmia entre os séculos V a.C. e I a.C. Entre estes povos, podemos destacar: babilônicos, assírios, sumérios, caldeus, amoritas e acádios. \n\n \n\n#Resumo das principais características comuns aos povos\n\n \n\nNo geral, seguiam religiões politeístas, pois acreditavam em vários deuses ligados à natureza. No que se refere à política, tinham uma forma de organização baseada na centralização de poder, onde apenas uma pessoa (imperador ou rei) comandava tudo. A economia era baseada na agricultura e no comércio nômade de caravanas.\n\n \n\n#Características geográficas da região\n\n \n\nVale dizer que os povos da Antiguidade buscavam regiões férteis, próximas aos rios, para desenvolverem as suas comunidades. Dentro desta perspectiva, a região da mesopotâmia era uma excelente opção, pois garantia água para consumo, rios para pescar e vias de transporte pelos rios. Outro benefício oferecido pelos rios, eram as cheias que fertilizavam as margens, garantindo um ótimo local para a agricultura.\n\n \n\n#Principais povos mesopotâmicos\n\n \n\n#Sumérios \n\n \n\nOs sumérios se destacaram na construção de um complexo sistema de controle da água dos rios. Construíram canais de irrigação, barragens e diques. A armazenagem da água era de fundamental importância para a sobrevivência das comunidades. Uma grande contribuição dos sumérios foi o desenvolvimento da escrita cuneiforme, por volta de 4000 a.C. Para registrar a escrita, usavam placas de barro, onde cunhavam os textos e dados. Muito do que sabemos hoje, sobre este período da história, deve-se às placas de argila com registros cotidianos, administrativos, econômicos e políticos da época.\n\n \n\nOs sumérios, que eram excelentes arquitetos e construtores, desenvolveram os zigurates. Estas construções eram em formato de pirâmides e serviam como locais de armazenagem de produtos agrícolas; e também como templos religiosos. Construíram várias cidades importantes como Ur, Nipur, Lagash e Eridu.\n\n#Babilônios \n\n \n\nEste povo construiu suas cidades nas margens do rio Eufrates. Foram responsáveis por um dos primeiros códigos de leis que temos conhecimento.\n\n \n\nBaseando-se nas Leis de Talião (\"olho por olho, dente por dente\"), o imperador e legislador Hamurabi, desenvolveu um conjunto de leis para poder organizar e controlar a sociedade. De acordo com o Código de Hamurabi, todo criminoso deveria ser punido de uma forma proporcional ao delito cometido. \n\n \n\nOs babilônios também desenvolveram um rico e preciso calendário, cujo objetivo principal era conhecer mais sobre as cheias do rio Eufrates e também obter melhores condições para o desenvolvimento da agricultura. Excelentes observadores dos astros e com grande conhecimento de astronomia, desenvolveram um preciso relógio de sol.\n\n \n\nAlém de Hamurabi, outro imperador que se tornou conhecido por sua administração foi Nabucodonosor II, responsável pela construção dos Jardins suspensos da Babilônia (que fez para satisfazer sua esposa) e a Torre de Babel (zigurate vertical de 90 metros de altura). Sob seu comando, os babilônios chegaram a conquistar o povo hebreu e a cidade de Jerusalém.\n\n \n\n#Assírios\n\n \n\nEste povo destacou-se pela organização e desenvolvimento de uma cultura militar. Encaravam a guerra como uma das principais formas de conquistar poder e desenvolver a sociedade. Eram extremamente cruéis com os povos inimigos que conquistavam. Impunham aos vencidos, castigos e crueldades como uma forma de manter o respeito e espalhar o medo entre os outros povos. Com estas atitudes, tiveram que enfrentar uma série de revoltas populares nas regiões que conquistavam.\n\n \n\n#Caldeus\n\n \n\nOs caldeus, de origem semita, habitaram a região conhecida como Baixa Mesopotâmia no primeiro milênio antes de Cristo. Entre 612 a.C. e 539 a.C., formaram um império na Mesopotâmia (Segundo Império Babilônico). O auge do Império Caldeu ocorreu em 587 a.C., quando Nabucodonosor conquistou os judeus de Jerusalém e ampliou o território do império. Portanto, Nabucodonosor II foi o mais importante imperador caldeu. Após a morte deste imperador, o império babilônico foi conquistado pelos persas, em 539 a.C., sob o comando do rei Ciro.\n\n- Fonte: https://suapesquisa.com/",
				"added": 1549581582
			},
			{
				"comment_id": 15,
				"body": "#Os vikings na América \n\n- A ação dos vikings antecipou em séculos a chegada de Cristóvão Colombo na América. \n\nQuando estudamos o descobrimento da América nos bancos da escola, logo aprendemos que foi o navegador Cristóvão Colombo o primeiro a se estabelecer naquelas terras distantes da Europa. Na verdade, a informação se mostra errada por duas razões fundamentais: primeiro, a América já havia sido descoberta por várias populações nativas, há milhares de anos; segundo, o primeiro europeu a se situar nessas mesmas terras foi o viking Leif Eriksson.\n\nFazendo parte da tradição oral viking, essa história remonta a antiga tradição que esse povo tinha na exploração e conquista de novas terras. Segundo os seus relatos, tudo teria começado quando “Eric, o Vermelho”, nos fins do século X, foi expulso da Islândia após ter cometido assassinato. Mandado para a Groelândia, este viking construiu uma fazenda e constituiu sua família. Foi daí que, Leif, um de seus três filhos, se empolgou com os relatos de marinheiros que falavam da presença de terras à Oeste.\n\nAtingindo a atual região de Terra Nova (Canadá), esse viking teria batizado o território como Vinland. Para os especialistas, o significado do nome atribuído gera grandes controvérsias, sendo dado como “Terra das Vinhas” ou “Terra do Pasto”. A confirmação da chegada dos vikings ao território americano aconteceu na década de 1960, quando uma expedição liderada por Helge Ingstad levantou uma série de artefatos e antigas ruínas que antes eram erroneamente considerados de origem indígena.\n\nAo contrário dos colonizadores espanhóis, a presença dos vikings em território americano acabou não durando muito tempo. Outras narrativas do povo viking dão a entender que a curta estadia teria sido motivada pelos ataques realizados por povos locais chamados de “skraelings” (homens feios). Já alguns estudiosos sugerem que a saudade da terra natal e as dificuldades de assentamento em uma área isolada seriam hipóteses mais seguras para explicar a curta temporada dos vikings na América.\n\n- Fonte: https://brasilescola.uol.com.br/",
				"added": 1549582008
			},
			{
				"comment_id": 16,
				"body": "> [homero](#comment_15_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB): Os vikings na América\n> \n> A ação dos vikings antecipou em séculos a chegada de Cristóvão Colombo na América. \n> \n> Quando estudamos o descobrimento da América nos bancos da escola, logo aprendemos que foi o navegador Cristóvão Colombo o primeiro a se estabelecer naquelas terras distantes da Europa. Na verdade, a informação se mostra errada por duas razões fundamentais: primeiro, a América já havia sido descoberta por várias populações nativas, há milhares de anos; segundo, o primeiro europeu a se situar nessas mesmas terras foi o viking Leif Eriksson.\n> Fazendo parte da tradição oral viking, essa história remonta a antiga tradição que esse povo tinha na exploração e conquista de novas terras. Segundo os seus relatos, tudo teria começado quando “Eric, o Vermelho”, nos fins do século X, foi expulso da Islândia após ter cometido assassinato. Mandado para a Groelândia, este viking construiu uma fazenda e constituiu sua família. Foi daí que, Leif, um de seus três filhos, se empolgou com os relatos de marinheiros que falavam da presença de terras à Oeste.\n> Atingindo a atual região de Terra Nova (Canadá), esse viking teria batizado o território como Vinland. Para os especialistas, o significado do nome atribuído gera grandes controvérsias, sendo dado como “Terra das Vinhas” ou “Terra do Pasto”. A confirmação da chegada dos vikings ao território americano aconteceu na década de 1960, quando uma expedição liderada por Helge Ingstad levantou uma série de artefatos e antigas ruínas que antes eram erroneamente considerados de origem indígena.\n> Ao contrário dos colonizadores espanhóis, a presença dos vikings em território americano acabou não durando muito tempo. Outras narrativas do povo viking dão a entender que a curta estadia teria sido motivada pelos ataques realizados por povos locais chamados de “skraelings” (homens feios). Já alguns estudiosos sugerem que a saudade da terra natal e as dificuldades de assentamento em uma área isolada seriam hipóteses mais seguras para explicar a curta temporada dos vikings na América.\n> \n> Fonte: https://brasilescola.uol.com.br/\n\n#Leif Eriksson\n\nNavegador e explorador islandês, que terá nascido por volta de 975 e falecido em 1020, é considerado por alguns historiadores como o descobridor da América do Norte, onde chegou por mar no ano 1000.\n\nLeif era filho do norueguês Erik, \"o Vermelho\", responsável pelo povoamento da Gronelândia, por volta de 985.\nAos oito anos, respeitando a tradição viking, Leif Eriksson saiu de casa e foi viver com um homem chamado Thyrker, um alemão que havia sido capturado por Erik e levado para a Islândia. Thirker foi o tutor de Leif, que passava muito tempo no porto para ouvir as histórias dos navegadores. Aos doze anos Leif regressou para casa do pai, com quem acabou por viajar para a Gronelândia. Durante a viagem marítima Leif aprendeu a navegar. \n\nPouco antes do ano 1000 Leif terá navegado da Gronelândia para Noruega, onde foi convertido ao cristianismo pelo rei Olaf I. Este acabou por lhe ordenar que regressasse à Gronelândia para combater, em nome do cristianismo, os vikings que lá se tinham instalado. De regresso desta viagem, o barco de Leif terá perdido o rumo e encontrou o noroeste da América, uma terra, bastante fértil, arborizada e com muitas vinhas. Por isso, Leif Eriksson chamou-lhe Vinland, a terra do vinho, e lá terá estabelecido contacto com os índios locais.\n\nUma outra versão da história, mais antiga e mais credível segundo os historiadores modernos, conta que Leif Eriksson terá chegado ao continente americano pouco depois do ano 1000, após ter comprado um barco ao navegador e comerciante islandês Bjarni Herjólfsson, que já teria estado perto da América. O próprio Bjarni disse a Leif como poderia chegar a essa terra desconhecida, que ele avistara depois do seu barco ter sido desviado por uma tempestade. Leif Eriksson e os seus companheiros de viagem terão permanecido na terra entretanto batizada de Vinland durante mais de um ano, antes de regressarem à Gronelândia para incentivar a população a viajar para Vinland. No entanto, devido à morte do pai, Leif acabou por emprestar a sua embarcação ao irmão Thorvald para ser este a viajar rumo a Vinland, onde terá sido morto por índios americanos. Uma colónia esteve estabelecida até 1012, ano em que houve um massacre perpetrado pelos índios. Vestígios dessa povoação foram encontrados em 1962.\nLeif Eriksson terá morrido por volta de 1020, sem ter regressado à América.\n\nEm 1964, o presidente norte-americano Lyndon B. Johnson proclamou 9 de outubro como Dia Leif Eriksson de forma a comemorar a chegada do primeiro europeu à América do Norte.",
				"added": 1549582341
			},
			{
				"comment_id": 17,
				"body": "#Prado Junior, Caio. História econômica do Brasil.\n- https://web.archive.org/web/20190104021625/http://www.afoiceeomartelo.com.br/posfsa/Autores/Prado%20Jr,%20Caio/Historia%20Economica%20do%20Brasil.pdf\n\n#Furtado, Celso. Formação econômica do Brasil.\n- https://web.archive.org/web/20190104021643/http://www.afoiceeomartelo.com.br/posfsa/Autores/Furtado,%20Celso/Celso%20Furtado%20-%20Forma%C3%A7%C3%A3o%20Econ%C3%B4mica%20do%20Brasil.pdf\n\n#\"O povo brasileiro\", autor Darcy Ribeiro\n- https://web.archive.org/web/20161013012724/http://www.usp.br/cje/anexos/pierre/ribeiro_darcy_povo_brasileiro_formacao_e_o_sentido_do_brasil.pdf",
				"added": 1549582938
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "#Filmes Gregos e Romanos\n\n- https://www.youtube.com/playlist?list=PLgIqa4NfevsNQG2J2O8PVldOVJ4ifhVOc",
				"added": 1549576903
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 18,
				"body": "#50 Ideias de Matemática Que Você Precisa Saber – Tony Crilly\n\nPara entender e se encantar com a matemática quem inventou o zero? Por que há 60 segundos em um minuto? Qual o tamanho do infinito? Onde é o ponto de encontro das linhas paralelas? E será que as asas de uma borboleta conseguem mesmo provocar uma tempestade no outro lado do mundo? Em 50 ideias de Matemática Que Você Precisa conhecer o professor Tony Crilly explica, em 50 ensaios claros e concisos, os conceitos matemáticos – antigos e modernos, teóricos e práticos, cotidianos e esotéricos – que permitem entender o mundo. Do zero e dos algarismos romanos ao último teorema de Fermat e o grande enigma da hipótese de Riemann, o pi, números primos e o infinito, esse livro conta coisas que não foram ensinadas na escola, incluindo o que o cálculo, a estatística e a álgebra realmente fazem e os usos muito reais dos números imaginários. Ao iluminar as grandes ideias da relatividade, a teoria do caos, os fractais, a genética e os hiperespaços e ao revelar o raciocínio não dito atrás do Sudoku e da revelação de códigos, loterias e apostas, administração financeira e juros compostos, esse livro é o levantamento perfeito para esse assunto, muitas vezes intimidador, mas sempre essencial. Pela primeira vez, a Matemática não podia ser mais simples.\n\n- https://mega.nz/#!wwQhjQIR!jDW8bAjJyzLgqNV1esTb90IpL9XGFMXN81gSyyRb_gE",
				"added": 1549586769
			},
			{
				"comment_id": 19,
				"body": "> [hubble](#comment_17_1MVFLCBADF6YVCHtnbWN9vBTjQQQQKma9R): Conjectura de Polignac\n> \n> Para qualquer número par positivo n, existem infinitos intervalos primos de tamanho n. Em outras palavras: Existem infinitamente muitos casos de dois números primos consecutivos com diferença n.\n\nEm 1849, Alphonse de Polignac desenvolveu uma conjectura na teoria dos números. Segundo ele, para cada número par n, haverá indefinidamente números primos consecutivos separados por n. Ou seja, seria infinita a quantidade de pares de números primos separados por duas unidades, como 3-5, 5-7, 11-13, etc. Em 2013, um grande avanço foi descoberto por Zhang Yitang, que conseguiu provar que o tal número par n é menor que 70.000.000. Usando os cáculos de Zhang, outro matemático, James Maynard, anunciou no mesmo ano que a diferença entre números primos sucessivos é menor ou igual a 600. Em 2014, o projeto Polymath conseguiu reduzir n para 246. Eles ainda não fizeram as descobertas necessárias para diminuir n até chegar a 2, mas usando outra conjectura que ainda não foi comprovada, a de Elliott-Halberstam, eles conseguem diminuir para 6.",
				"added": 1549587330
			}
		]
	},
	"comment_vote": {
		"9_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1
	}
}