{
	"next_comment_id": 15,
	"comment": [
		{
			"comment_id": 1,
			"body": "\"Teoretycznie poprawia anonimowość\". Ale w ogóle jak miałby to robić? To jest wąskie gardło. Można używać zeromail- NIE, Można oglądać wideo- NIE, Można zamieszczać posty- NIE. \"widzę, że 4202 części na YoutubePL nie jest dostępnych\" Bo jest kilka klientów uruchomionych i nie sciągneli najstarszych plików wideo. Tak więc proxy to jest błędne koło.",
			"post_id": 17,
			"date_added": 1613128369
		},
		{
			"comment_id": 2,
			"body": "To chyba nie są dramatyczne zmiany. Czy te zmiany starsze nie były bardziej poważne?",
			"post_id": 18,
			"date_added": 1613143826
		},
		{
			"comment_id": 3,
			"body": "> [krzotr@zeroid.bit](#comment_8_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F): większość filmów (oczywiście te, których części były udostępniane przez inne węzły) była już pobrana i udostępniana innym w sieci ZeroNet.\n\nNadal nie rozumiem, jak to różni się od klienta zeronet który jest ciągle połączony? ",
			"post_id": 17,
			"date_added": 1613497830
		},
		{
			"comment_id": 4,
			"body": "Wzrosła aktywność na blogu, b pozytywnie. Jaki jest dokładnie system tor którego używa zeronet?",
			"post_id": 19,
			"date_added": 1613498218
		},
		{
			"comment_id": 5,
			"body": "> [krzotr@zeroid.bit](#comment_10_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F): Korzystam z Always\n\nTo jest chyba tryb, a nie wersja programu? Każdy peer sieci tor komunikuje się przez protokół do innych. Gdzie jest określony ten protokół komunikacji tor?",
			"post_id": 19,
			"date_added": 1613500658
		},
		{
			"comment_id": 6,
			"body": "> [krzotr@zeroid.bit](#comment_9_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F): .. nie trzeba żadnych ulepszeń a jedynie potrzeba pozyskać nowych użytkowników?\n\nA może prowadź blog o technologii czy nauce? W tej chwili obserwuję już twój zerome.\n",
			"post_id": 18,
			"date_added": 1613506938
		},
		{
			"comment_id": 7,
			"body": "Tor to protokół komunikacji pomiędzy peer. Tor ma już wiele wersji. To jest jak 'papryka z tesco'.",
			"post_id": 19,
			"date_added": 1613512359
		},
		{
			"comment_id": 8,
			"body": "> [krzotr@zeroid.bit](#comment_12_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F):  domyślnie 127.0.0.1:9050, co dalej Tor robi z połączeniem - tego Ci nie powiem\n\nRozumiem. Są pewne realia śledzenia ip, a zachowanie drużyny tor zadziwia. tor to 'arranżacja'. Można zrobić swoje wersje.",
			"post_id": 19,
			"date_added": 1613552945
		},
		{
			"comment_id": 9,
			"body": "I teraz czym to się różni od statystyki YouTube? Niczym.",
			"post_id": 20,
			"date_added": 1613558775
		},
		{
			"comment_id": 10,
			"body": "@krzotr Miałem na myśli YouTube.com LOL w sensie, że 3/4 użytkowników tylko odwarza wideo. A że jest kolejny skrypt to super. :D\n\nPodobno ytpl zawieszał się, więc więcej zamieszczających nie dziwi.",
			"post_id": 20,
			"date_added": 1613663633
		},
		{
			"comment_id": 11,
			"body": "Czyli korporacja youtube nie podołała youtube-dl?",
			"post_id": 14,
			"date_added": 1613690022
		},
		{
			"comment_id": 12,
			"body": "> [krzotr@zeroid.bit](#comment_16_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F): To Microsoft \n\nA to jeszcze ciekawiej jest. Czyli jedni kolesie poprosili drugich kolesi, żeby nastraszyli cyberpunków. Ale to chodzi o to, że związek autorski nie ma takich cybernetycznych pleców stąd nie mogli sami złorzyć podania? Cyrk. A youtube nie prosi nikogo, oni sami blokują na swojej platformie. Nasuwa mi się jeszcze jedno pytanie; Jeżeli youtube-dl ma być usunięty, to kto ściga strony 4K Downloader?\n\nNa ich stronie downloader 4K istnieje w wersji na Win, Mac i ..... Ubuntu. Bezcenne! Jak cofam się w pamięci, zwyczaj był używać kategori Linux. No a potem jakieś szczegóły związane z wersją itd. Wierchużka nie śpi, 'niewygodne zapiski i wzmianki o zdarzeniach i osobach muszą być wymazane'.  Przypomniało mi się jak to niedawno na formularzach 'rodzic' został zamieniony na 'opiekun'. \n\nZeronet p2p to ostatnia ostoja. To tak jeden kolega już tutaj to mówił. Dzięki wam, nam coś ciągle trwa.\n",
			"post_id": 14,
			"date_added": 1613749933
		},
		{
			"comment_id": 13,
			"body": "Czy masz dużo plików opcjonalnych?",
			"post_id": 24,
			"date_added": 1615651059
		},
		{
			"comment_id": 14,
			"body": "zeroid.bit works. PEERS Connected:10Connectable:68Onion:0Local:8Total:68\n",
			"post_id": 25,
			"date_added": 1629824838
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}