{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1605294278,
			"title": "Decentralized Youtube?",
			"body": "I don't know if anyone's noticed but a lot of youtube videos are not monetized, get taken down or worse just because the shareholders and the CEO hold biased values. Zeronet seems to have opened up a new area on the internet governed directly by the people instead of these idiots at the top. I don't care if its AOC screaming the top of her lungs for the green new deal, Alex jones making conspiracy theories or maybe even ISIL uploading a new terror video. People will be free to express their opinions and be held accountable for their actions by everyone else, not just a biased silicon valley. So would a decentralized version of youtube work well in this modern world of political correctness?",
			"added": 1605294277
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1605268368_1LKV9xTJGWsmvJNHYC5Y7KPSiUY48AmKMH": [
			{
				"comment_id": 1,
				"body": "i don't care. lets talk about boobs",
				"added": 1605294311
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_2688_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): If you think you're funny enough to spam comments like this, then you will end up on a spam blocklist. Nobody's laughing, despite how awesome boobs can be. Just putting that out there. [...]\n\nmeh, i'll just create a new id. joke's on you though, you got triggered.",
				"added": 1605300689
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2690_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't recommend it. [...]\n\nDefinitely triggered.",
				"added": 1605379255
			}
		],
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": [
			{
				"comment_id": 4,
				"body": "> [freemankind](#comment_47_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): there are multiple decentralized youtube alternatives just do a proper search. [...]\n\nNothing as good as youtube and nothing that monetises for the uploaders.",
				"added": 1605379737
			}
		]
	},
	"comment_vote": {}
}