{
	"title": "最后的斗争",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 11,
	"demo": false,
	"modified": 1571280710,
	"post": [
		{
			"post_id": 10,
			"title": "New blog post",
			"date_published": 1571279811.794,
			"body": "Blog post body"
		},
		{
			"post_id": 9,
			"title": "币神班报告",
			"date_published": 1553367403.329,
			"body": "![1.png (871x337)](data/img/post_9_1.png)![2.png (896x294)](data/img/post_9_2.png)![3.png (1289x532)](data/img/post_9_3.png)![4.png (1301x1003)](data/img/post_9_4.png)![5.png (887x325)](data/img/post_9_5.png)![6.png (284x298)](data/img/post_9_6.png)![7.png (841x464)](data/img/post_9_7.png)![8.png (1277x814)](data/img/post_9_8.png)![9.png (796x888)](data/img/post_9_9.png)![10.png (893x214)](data/img/post_9_10.png)![11.jpg (1200x856)](data/img/post_9_11.jpg)![12.png (852x392)](data/img/post_9_12.png)![13.png (928x729)](data/img/post_9_13.png)![14.png (1301x1560)](data/img/post_9_14.png)![15__2_.png (896x945)](data/img/post_9_15__2_.png)![15.jpg (1200x483)](data/img/post_9_15.jpg)![16.png (870x532)](data/img/post_9_16.png)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "大海和斗哥聊天的体会",
			"date_published": 1504795699.346,
			"body": "吾今日下午与斗哥小聚，豁然开悟，收获良多，特向班委分享共勉。概括之主要2大点，第一：如何活出精彩，有意义且能回馈社会的人生。第二：如何实现财务自由。\n\n时间对于每个人都是最公平的，需要合理的规划才能实现人生的目标且获得精彩。斗哥曰：尽早规划自身的终极目标（如果我们去见上帝了，你希望后世如何评价你），选择一个你爱的事业，你才会遇到挫折的时候仍有激情，根据实际情况可分成短期、中期等目标。如果每天进步一点点，1.01^365=37.8，改变和进步巨大；然而每天偷懒一点点，0.99^365=0.03，退步也是惊人的。所以，斗哥建议每个人首先应放空自己，千万别给自己设限，静下心来，自问1我是谁 2 要往哪里去 3如何去。别觉得自己的目标过于宏大或不切实际，记住anything is possible。所以找到自己的闪光点，结合自己的经验，梳理自己已走的人生轨迹，做下新的目标，并朝着自己的梦想每天进步一点点。\n等自己成功达成梦想，别忘记回馈社会，能量守恒，很多人能做到独乐乐，自己衣食无忧，但鲜少有人能做到众乐乐，提携和造就他人，让更多的人得到幸福人生。所以想让后人如何评价你，看你对社会的回馈是多少啦。\n\n实现财务自由可从以下4方面入手：投资、房产、创业、移动互联网技术。斗哥曰：目前个人投资项目的成功率很低，投资人对投资的项目没有实际的控制，除非专业投资机构或团队。所以以后等大伙都财大气粗了，加入斗哥的基金吧，让专业的人做专业的事。\n2000年开始在中国投资房产或5年前在加拿大投资房产都是好时机，可以狠赚一笔，但这需要有大笔原始积累的钱买房，并且目前整体的房地产市场偏疲软，可能不是最佳的进入时期。\n创业的成功率也是很低的，大家可以查看数据，一般只有3%的成功率，但如果找一个自己有激情的朝阳行业那就大不同了，然后找准定位，真正解决社会的某一个问题，企业采用聚焦战略，扩大核心竞争力与品牌差异，塑造品牌价值。成功了以后记得找 斗哥最顾问，密谋发币事宜。\n\n移动互联技术是斗哥最看好的， 也是草根能短时间内咸鱼翻身的项目，适用于我们，投入少见效快，跟着斗哥投投新项目，眼睛一睁一闭，钱就赚好了；要是不满足的， 大伙自己倒腾几个短线，搬搬砖还是能赚个盆满钵满的，就是小心砖块太大砸了自己的脚。目前是区块链技术发展的黄金时期，虽说时机很要紧，但跟对人才是最重要的。斗哥曰国家目前对新项目管制是好事，让真正的黄金项目跳出来，他后期会帮大家选择真正有技术革新，解决社会问题，有产品实际落地的项目，后期可能会多看些国外的项目。最后也是最重要的，斗哥希望大家每个人都能都能成为 岛主，实现财务自由， 每个人不用工作就能有用不完的Passive Income。例如斗哥要成为 桃花岛岛主的话（桃花岛大家都知道深层含义的吧），最快的方式就是使自己成为网红，有一大帮脑残粉簇拥，他随便网络露个脸，唱个小曲就有几个亿看直播，每个人送朵花或像可心那样每次送个兰博基尼，斗哥想不发达都难啊。前提是你要精准的给自己贴标签，优势部分无限扩大，提升影响力。只要斗哥有影响力，广告公司啥的自动送上门，财源滚滚啊！斗哥不止有貌，肚里还晃荡晃荡满肚子墨水，准备写有关数字货币专业类的书，这版权可不得了，每卖一册斗哥就能收到版税，未来收钱这速度比印钞票还快吧！例如，Micheal Jackson虽然已经到上帝那里报道了，但每年他音乐的版费还是不得了啊，所以为了早日能成为岛主，大家躺在沙滩上晒太阳还不停的有钱赚，大家除了跟随斗哥投投项目，也可努力找到自身优势，提升自己的影响力，贡献和回馈社会，有事没事就写写书，扑扑粉，一直播下，实现真正的财务自由。\n以上是今日下午与斗哥剪短的聊天摘要，与大家共勉！"
		},
		{
			"post_id": 7,
			"title": "关于幸福感",
			"date_published": 1501244390.523,
			"body": "关于幸福感\n\n**幸福感**\n\n幸福感是一种大脑的一系列化学反应，无论外界的刺激如何提高，这种化学反应带给人类的体验总是有天花板的，而且很早就已经接近了上限。所以人类进入文明社会以来，无论科技如何发达，物质如何丰富，幸福感并没有提高多少。吃冰激凌很愉悦，找到真爱也令人愉悦，但是吃很多冰激凌所得到的愉悦既不能线性增加，也不能等同于找到真爱。\n\n幸福感的核心是你的收获和期望的差值，而不是收获的绝对值；所以，我们要向内心寻找幸福，改变认知模型，降低期望值都有助于幸福感的提升。\n\n但是，事物都有两面性。人类的进步也得益于先辈们的冒险追求和持续探索，而内在的驱动力就是欲望、好奇心和不满足。如果全人类都降低期望值，很容易获得满足感，从而停止外在的追求、不再冒险，那么人类社会的进步速度也会大大降低。\n\n如果有一种药物，能欺骗大脑，直接催生这种幸福化学反应，让人类轻易得到幸福感，满足感，那么人类就会沉迷于这种药物而无法自拔。这种药物确实存在，我们称之为海洛因，或者简称毒品，因为绝大部分人一旦尝试，就几乎会不可避免地上瘾，放弃外在的所有努力和追求，只想借助着一种最轻松的方式获得满足感体验。所以我们都不敢轻易尝试挑战自己的“定力”。做为骑象人，我们很难驾驭“本能”这头大象。在通过电极刺激老鼠获得快感的试验中，那只可怜的老鼠就会不停地按下电源开关而无法自拔，直到精疲力尽后倒下。人类的自控力并不比老鼠高多少。\n\n还有一个令我细思极恐的事实是，战争导致了互联网和很多科技的发明、发现；如果没有残酷的战争，人类科学进展和生活水平，要比现在落后的多。\n\n多么痛的领悟，再次说明了这个世界不是非黑即白，而是中国文化中的太极那般，白中有黑黑中有白啊。"
		},
		{
			"post_id": 6,
			"title": "人类的互联主观",
			"date_published": 1501244185.816,
			"body": " 人类的互联主观\n\n**人类的互联主观**\n\n人类的现实有三类：\n\n> _1）客观现实、_\n> \n> _2）主观现实、_\n> \n> _3）共同主观现实（intersubjective，互联主观）_\n\n客观现实就是万有有力这种亘古不变的物理法则；\n\n主观现实就是我们内在的感受和情绪、酸甜苦辣；\n\n互联主观并不是因为个人的信念或者感受而存在，而是依靠许多人的沟通互动及认可而存在。上帝、国家、货币、公司、民族、价值观、道德、婚姻、信用、等都是人类虚构出来的互联主观，他是基于不同群体的共同想象而存在与一个族群和文化当中的一种共同的主观现实。\n\n让人类主宰地球的不是智力和使用工具的能力，而是大范围的灵活协作，促成人类在全球范围内灵活协作的根本能力是——想象力。领导就是要激活一群人的共同想象，编制一个共同认可的故事，让群体相信这个故事，形成信仰，从而组织他们进行大规模高效协作。 \n\n大多数人生活的意义，都只是存在于彼此讲述的故事之中。在教堂结婚、结婚要戴戒指、初一十五烧香拜佛、在节假日放炮庆祝、过年给红包等等的意义就在于我们的父母和前辈，邻居和朋友都认为这有意义。人类会以一种不断自我循环的方式，持续增强彼此的信念。每一次互相确认，都让这张意义的网收的更紧，直到你别无选择，只能相信大家都相信的事。\n\n> _星座、易经、画、钻石、玫瑰、比特币、米老鼠、可口可乐、释迦摩尼和猫王这些都属于互联主观的概念，都有一个高度认同的群体。_\n\n人类不仅可以跨性别、跨年龄、跨文化，跨种族，跨国界协作，甚至还可以跨越时空协作，我们的所有科学成就，其实就是与前人协作的结果，所有的这些协作，除了基于共同想象的很多虚构概念之外，还有一项重要工具就是”语言”，语言也是一种共同的互联主观，离开了人类的主观意识，语言就失去了存在的意义！而即便说着相同语言的北朝鲜和南韩，他们的区别并不是气候和山川，也不是基因和民族，而是他们分别相信截然不同的两套故事。\n\n通过文字和语言，人类不光实现了计算和存储从大脑内走向大脑外，而且还实现了从单人计算到集体计算的跨越。人类的成功，是个体退化，集体进化的综合结果。"
		},
		{
			"post_id": 5,
			"title": "BBB理论",
			"date_published": 1501243138.715,
			"body": "BBB理论解释：\n\n第一个B是 Blood，血缘关系，你是我亲哥哥，我有难，你一定会帮我，类似美剧越狱的场景。\n\n第二个B是 Beauty，性关系，你是我的情人，我有难，你一定会帮我，类似罗密欧与朱丽叶的场景。\n\n第三个B是 Benifit，利益关系，你是我的生意伙伴，我有难，你一定会帮我，类似天天在发生的商场故事。\n\n第一个和第二个B在社群里面属于小众关系，第三个B才是大众关系。\n\n听一个社群元老说好的社群是：家庭+学校+军队，这些正好解释了BBB。\n\n好的社群要和家庭一样有血缘关系，和学校一样有男女朋友，共同学习的关系，还有最重要的是能有军队一样的分配利益的关系。"
		},
		{
			"post_id": 4,
			"title": "现在前面",
			"date_published": 1501204451.352,
			"body": "前几天小密圈突然全部下线不能访问了，我自己的VPS被黑客攻击还在恢复，一直播海外一直不能播很久了，所以万般无奈，在零网开了一个自己的“官方微博”，用的是自己名字的bit域名：[http://127.0.0.1:43110/wangdou.bit](http://127.0.0.1:43110/wangdou.bit)  因为我没有匿名的需求，所以也没有用tor，没有用vpn啥的来隐藏自己，这里就是一个对自己的言行完全负责的地方，越是自由，越是自律。\n\n1.为什么微博叫 最后的斗争？\n\n因为我叫王斗，斗争的斗，我是靠朋友对我的称呼来判断他和我的远近的，很多人叫我“抖”哥，那一定是没有看我的这篇文章，一定是离得比较远的朋友。叫我斗（逗）哥的，基本都是比较近的朋友或者看过我这篇文章的朋友。我姓王，按照百家姓排名一定进了前八，全球估计有几百万姓王的人，所以我爸也就是老王想到一个斗字来把我和其他人区别开，斗争的斗是个很简单，很常见的字，但是入名字的凤毛麟角，这里真的要感谢老王。他用这个字的原因是国际歌里面一句：这是最后的斗争！团结起来到明天，英特耐雄纳尔就一定要实现！。好吧，international 还没有实现，永不消失的电波先实现吧。\n\n因为我已经42岁，对，一不留神浑浑噩噩的过了42年，虽然看过我大事记的朋友感觉我的经历还是蛮牛逼的，在我看来离我的目标还都太远。随着年纪越来越多，所有的努力越来越像是最后的斗争。70后都年近半百了，还折腾个啥？所以把微博名字改成 最后的斗争 提醒自己，抓紧时间。"
		},
		{
			"post_id": 3,
			"title": "拥有自己的bit域名来访问零网",
			"date_published": 1501108846,
			"body": "看了能找到的全部攻略，拥有自己的bit域名，并且用这个域名来访问零网，其实非常简单。"
		},
		{
			"post_id": 2,
			"title": "我用石头砸开IBM的门",
			"date_published": 1501108730.9,
			"body": "# 我用石头砸开IBM的门\n\n我把金发染成黑色![我用石头砸开IBM的门](http://ugc.qpic.cn/gbar_pic/HsJCHECqvywawruRWnujaMBH7gkJhpADDy4scibmShtI4L9mTM2hX7w/0)\n\n　　接到IBM面试通知时，已经是我递交简历后的第三个星期。我正在一个小县城出差。\n\n　　当时我在一家激光公司实习做技术，负责打标机的安装和调试，有的时候还充当搬运工。\n\n　　购买我们机器的厂家多半都在小县城的偏远地方，比较荒凉，这次也不例外。我和公司的几个兄弟在工作结束的当天回到县城，先是找地方大吃 了一顿，然后聚在一个小发廊里洗头，放松放松。发型师建议我把头发染染颜色，我看价格不贵，也很时髦，就选了种颜色很炫的金黄色。一面是放松自己，一面是 把自己从等待IBM通知的焦灼中解放出来。\n\n　　头发刚染好，我的电话响了，看号码似乎是IBM公司的，我一把扯下围在胸前的白布，紧张地接电话。IBM秘书小姐温柔地通知我于第2天的下午5：00-6：00到IBM总部面试。\n\n　　我开始傻笑，冲回发廊，指着刚染的金发大叫：“快给我把头发染回去，染黑!染黑!”\n\n　　头发一弄完，我就买票赶到IBM公司。\n\n　　请你修好这盏灯\n\n　　等我进到IBM公司里，发现男士都身着很正规的西服，女士都穿庄重的职业套装。\n\n　　而我是工作服，牛仔裤，白色运动鞋，大大的工具包，特别是头发，长得可以遮住眼睛。\n\n　　我强烈感觉我不属于这里，巨大的压力让我觉得自己矮小了许多。\n\n　　就在我感觉战战兢兢的时候，我的面前出现了一个漂亮的女孩，她甜美的声音指引我：“请走这边”。我迷迷糊糊跟着她走，顺着走廊拐弯、走路、再拐弯，只觉得路过的一个个工作区域里的工作场景像是在放电影。\n\n　　终于她在一间会议室门口停下来，转过身，看着迷茫的我，指指[天花](http://www.iask.com/n?k=%E5%A4%A9%E8%8A%B1)\n\n板说：“就是这两盏日光灯不亮，尽快把它们修好吧。”我的大脑一片空白。她看我没反应，关心地问：“你怎么了?”\n\n　　“我，我不是来修灯的，我是来面试的，请问S109房间在哪?”女孩没说话，疑惑地打量着我，可能她的确没有见过穿这身行头来面试的。过了很久，她指了指对面的一间不大的会议室，“那间就是，上面有号的”。\n\n　　6斤重的花岗岩\n\n　　我忐忑不安地坐在面试的房间里。房间不大，色调很柔和，黄色的圆桌，白色的墙，墙上有一幅抽象的画，一切显得简单协调。圆桌上放了一杯刚泡的茶，显然面试我的人来过。\n\n　　“不是通知你5点的吗?”面试的老板不知道什么时候从什么地方出现在我面前。\n\n　　我赶忙解释：“真不好意思，我迟到了，我刚从外地出差赶过来，路上堵车，又没有来得及换西装。”\n\n　　他很年轻，有些胖，灰色的西装，细条纹的领带，衬衣是雪白的有金属袖扣的那种。他手里拿着我的简历，面前放着一张白纸和一支笔，对我说：“记得下次要准时，请坐。”\n\n　　他开始对照我的简历发问，并不时在纸上用英语记下我说的话。\n\n　　我记不得其他问题我都是如何回答的，但是有一点，我都是实话实说，因为我知道说谎的人记性要好，而我偏偏记性不是太好。在外企服务的朋友再三提醒过我外企最不能接受的就是说谎，一定要诚实。我想我这次是做到了的。\n\n　　在了解了我过去工作的大致情况之后，他问起我现在的情况。我说我在一家激光公司工作，我很热爱现在的工作。为了进一步阐述我的热爱程 度，我鬼使神差地从工具包里拿出一块大概6斤重的花岗岩放在他面前。那块石头有一本书那么大，是用来做二氧化碳激光测试的，黑色的一面有我用激光雕刻的古 代仕女图，纹路极其细致均匀。\n\n　　我跟他解释激光的形成，雕刻的步骤、工艺、材料、技巧，谈到测试激光时的种种趣事，甚至告诉他激光打标机的利润很高，自己也想买一台做加工，可以很快收回成本，创造利润等等。\n\n　　他一直都很有兴趣地听着，没有打断我，大概过了20分钟，等我说完了，最后他才说希望我保持旺盛的斗志和冲劲，做一个正直的人。\n\n　　我听他说话，赶紧说：还有个问题，我不是本地人，没有本地户口。他却笑着对我说他自己也不是本地人。\n\n　　我想在IBM做一辈子\n\n　　两个星期过去了，我接受了又一轮面试。这一次面试我的是一位女性，精明强干，有一双似乎能洞穿一切的眼睛。好在我这次穿了我花血本买的西装，可以挡挡她犀利的目光。\n\n　　她问了我对IBM的看法，对生活的想法。她说IBM是一个很大的公司，可以学到很多东西，又问我如果我被IBM录用，我打算干多长时间。我看着她的眼睛回答：如果可以，我想是一辈子。\n\n　　两星期后，又是一轮英语测试。通知我的人告诉我，我不用准备什么，因为这次很简单，都是些智力测试题。也许这是我经历过的最难过的测试，走出考场，我没有丝毫印象，只记得铅笔削得很尖，墙上的钟啪嗒啪嗒地走。\n\n　　又过了大概三个星期，通知我体检。我到指定医院做了有生以来最完整的一套身体检查。一个星期后，我终于收到了录取通知书。\n\n　　他们都没带石头\n\n　　现在我在IBM干得很好，很开心，认识了很多人，学到了很多东西。我找机会问过人力资源部的人，知道我这个职位当时有200多人提交申请，17个人得到面试机会。我也问过我的老板，当时为什么选我?他想了想，笑着回答，答案十分简单：“他们好像都没有带石头!”\n\n　　事情过去了近两年，到现在很多细节我还历历在目，我要感谢当初记得我拿一块石头来面试的老板，要感谢朋友提醒我要时刻诚实。我还想用自 己的经历告诉所有没有太多背景，又想找到好工作的朋友们：永远都要自信，自信是骨子里的一种精神，要随时准备去尝试从来没有想过和做过的事。因为要记得， 我曾从一个小县城里长途跋涉，用一块石头砸开了IBM的门!"
		},
		{
			"post_id": 1,
			"title": "王斗大事记",
			"date_published": 1433033779.604,
			"body": "互联网营销专家 资深IT顾问 独立讲师\n历任 IBM/MOTO/HP销售总监\n著有《IBM回忆录》《超级销售》《单词魔咒》\n悉达多自由群落创始人 5941网校校长\n500强俱乐部创始人 情商未来机构负责人 极客营销创始人\n热爱极限探险 专注互联网营销 另类思维 潜能开发\n\n1975年 0岁\n出生的时候就哭了两声\n1976年 1岁\n在11个月的时候已经可以跑 但是不会走 放到地上像机器娃娃一样拼命向前冲\n同年 9个月说出生平第一句话:拿来! 是看到别的摇椅里小朋友的手里的苹果时伸手去拿 大声说出的\n1977年 2岁\n开始学习中国汉字,掌握500中文字\n1978年 3岁\n开始做各种智力游戏,掌握全部毛主席语录\n一次吃5个西瓜，边吃边尿…\n1979年 4岁\n已经认识四千汉字,小学二年级期末考试语文数学80分,计划就读小学2年级\n当时最大的梦想是造飞机\n1980年 5岁\n小学一年级,已经认识四千汉字,小学二年级期末考试语文数学80分\n同年 评为班长 红花少年 模范班干部\n同年 第一次过马路买冰棒 被飞驰的自行车撵过 安然无恙 自行车轻度受损\n1981年 6岁\n开始练习书法 专攻柳体\n开始背诵唐诗 专攻唐诗三百首\n1982年 7岁\n开始练习武术 刀 棍 长拳\n1983年 8岁\n进校乒乓球队，苦练球技,可以翻空心跟斗\n1984年 9岁\n参加市演讲比赛《我的同桌》获奖,得到一个小半导体收音机\n1985年 10岁\n父亲把家里一间房间改造成游泳池，当时我们家在六楼！成为方圆几十公里唯一在楼房里的游泳池!\n1986年 11岁\n天气冷了，有游泳池变成了蘑菇养殖房，天天可以吃到新鲜的蘑菇了！成为方圆几十公里唯一在居民楼房里的蘑菇房！\n1987年 12岁\n初中一年级 在校门口鼻子和同学的额头对碰 血流不止 从此多动症状有所减轻\n同年 因为气愤老师怀疑自己口吃,发誓学好英文,当选英语课代表 英语成绩一直名列年级前列\n1988年 13岁\n英文考试100分受到全校MM的青睐\n1989年 14岁\n书法在市报纸上发布,名字第一次变成铅字\n1990年 15岁\n发明一套密码系统用于写日记，到现在还能不用密码表就可以看懂！\n![](http://ugc.qpic.cn/gbar_pic/HsJCHECqvyx5guhM7EeJoUsLqKy8aumYrdJpBX1giaAWlOaYrWYS4AQ/0)\n\n1991年 16岁\n念诵 唵嘛呢叭咪吽\n修 炼道家功夫，走火入魔，离家出走50公里寻找梦里的师傅，被老父亲找回\n1992年 17岁\n老父亲送了一袋米上山布施主持,让我在山上的寺里住了些日子,听竹林潺水,反省人生\n1993年 18岁\n在学校食堂吃饭,吃出半个啤酒瓶底,拒绝和女生接近,理由是”要练童子功”\n1994年 19岁\n写小程序让计算机中心网络瘫痪\n1995年 20岁\n课余时间，在夜 总 会当门童,月薪300,还有小费,太晚回不了学校,和民工挤在一起睡在臭烘烘的破房子\n1996年 21岁\n做项目技术支持，表现突出，破格提拔做了5个人的小团队的leader.\n1997年 22岁\n在广州遇见李阳，成为最早的疯狂英语亲善大使！\n1998年 23岁\n加入大族激光，开始白天扛着箱子到各地工厂装机器，晚上埋头写程序。\n1999年 24岁\n带领华东售前和技术支持6人小团队\n2000年 25岁\n[**《我用石头砸开IBM的门》**](http://www.ibmpcd.com/book/doc-view-16.htm)成为IBM个人电脑事业部业务代表\n2001年 26岁\nIBM PELT 第一名\nIBM BRAVO 销售奖励\n2002年 27岁\n介绍INTEL朋友加入IBM\n2002 IBM HPC (Hundred Pecent Club)\n2003年 28岁\n介绍HP朋友加入IBM\n2002 IBM HPC (Hundred Pecent Club)\n在澳洲黄金海岸从3000米跳伞,40秒自由落体再开伞\n\n2004年 29岁\n3月预测到IBM PC 会卖,10月离开IBM,加盟 symbo l(后被MOTOROLA收购）出任渠道经理\n12月8日联想宣布收购IBM PC部门\n2005年\n创作 **《IBMPC回忆录》**\n美国纽约，华盛顿，迈阿密东海岸旅行 思考不工作就赚钱的方法\n主讲《公司复杂人际关系处理技巧》《超级销售十大工具》培训\n2006年 31岁\n美国洛杉矶,拉斯维加斯,大峡谷,圣地亚哥,墨西哥旅行\n\n飞行在上海街头,每小时32公里!!\n[![](http://ugc.qpic.cn/gbar_pic/HsJCHECqvyx5guhM7EeJoUSStDROmlVq3WbGpvYjnB7ian8NZM2fiagw/0)](http://www.justican.com/)\n\n2006年 31岁\n1月美国西海岸洛杉矶,拉斯维加斯,大峡谷,圣地亚哥,墨西哥旅行\n4月联合美国讯宝主要代理商推出美国讯宝渠道联盟及讯宝宝点计划\n2月8日 用poweriser飞行在上海街头,每小时32公里!!\n[7月3日 父亲病世 纪念父亲 父亲锻造了我 未来的路我坚定前行](http://www.wodebaba.com/)\n2007 32岁\n参与主导摩托罗拉无线产品全国项目建设\n9月加盟美国NComputing 出任销售总监\n赢得海尔出口马其顿10万台大订单\n2008年 33岁\n赢得5i5j两万台大订单\n**确定自己墓志铭：这里躺着传授实现**[**财富自由**](http://www.caifuziyou.com/)**和**[**心灵自由**](http://www.xiulian.org/)**方法的一代宗师**\n2009年 34岁\n出任源科销售总监\n2010年 35岁\n出任中国惠普销售总监\n2011年 36岁\n创立悉达多自由群落，5941网校 帮助更多人实现梦想\n2012年 37岁\n创立500强俱乐部，帮助更多人进入500强。\n2013年 38岁\n情商未来机构负责人\n2014年 39岁\n创立极客营销 [发明群客服](http://www.qunkefu.com/ \"微信群客服\")\n\n2015年 40岁\n[发明群直播 获得硅谷投资，开始用软件改变世界。](http://www.qunzhibo.com/)"
		}
	]
}