{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Как вы думаете, есть ли будущее у технологий p2p сетей?",
			"body": "На данный момент, есть не мало работоспособных примеров пиринговых mesh-сетей (i2p, Tor, ZeroNet и etc.), но все они сильно режут скорость передачи данны. Данные технологии врятли позволят стримить видео или играть в реалтаймовые онлайн игры, по крайней мере в обозримом будущем. Какие преимущества пользователь получает взамен? По крайней мере я вижу следующие:\n* Конфедициальность передачи данных (I2P, Tor?, ZeroNet?)\n* Анонимность при взаимодействии в сети (I2P, Tor?, ZeroNet?)\n* Свобода публикации своих собственных ресурсов (ZeroNet, I2P, Tor)\nУ всего есть плюсы и минусы. В данном случае минус довольно существенный, но и плюсы не маловажны. И появляется вопрос, есть ли у одноранговых распределённых сетей будущее и как вы его видите?",
			"added": 1622388628
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_15UbkF42UTPuFGbvHgeGMm2mFfnoYEqCZ3": [
			{
				"comment_id": 1,
				"body": "Ты: \"Эй, чувак, привет тебе!\"\nТвой друг: \"Привет\"\nТвой личный ФСБшник (и любая третья сторона): \"Здравие желаю\"",
				"added": 1622386656
			},
			{
				"comment_id": 2,
				"body": "А кто любит, что бы копались в его грязном белье? Да-да, сейчас это норма, когда огромная корпорация выбрасывает в массы бесплатное проприетарное приложение, а бабки наруливает с помощью данных которое это самое приложение собирает. Всё просто, по аналогии: \"сыр\" - информационные технологии, \"мышеловка\" - тот поток данных, которые через них утекают. Когда стали всплывать крупные сливы данных, а так же государства полезло в интернеты со своей цензурой, пропогандой и посадками за репосты, тут юзверь среднего звена и задумался, а прошаренные энтузиасты-криптопанки начали выкатывать такие продукты как I2P, ZeroNet, BlockChain и т.д. (Tor не в счёт, у него другой исторический бэкграунт). Системы с одноранговыми узлами(aka p2p-сисиемы) - это скажем так народный ответ проблемам комерциализации всего и вся и злоупотребления властью. Идея по сути не сложная, выплюнул \"it-продукт\" в массы, а дальше массы пусть своими силами и тащат этот \"it-продукт\", им не напряжно, да и тебе по карману вообще не бьёт(ты же не платишь за использование проца и харда каждого конкретного пира в сети).",
				"added": 1622387600
			}
		],
		"1_12dAnS5wgcFCUEijJ69oibEABDtbHi2SEM": [
			{
				"comment_id": 3,
				"body": "На текущий момент \"в тренде\" криптография на основе элиптических кривых. Я вроде как читал про него на хабре, реализация не тривиальная, но в OpenSSL вроде как добавили и i2pd в протоколе NTCP2 внедрён(можно на github'е подглядеть). Что сказать, про ксстомные алгоритмы, разработать алгоритм - задача довольно нетривиальная, например ассинхронные методы базируется в основном на сложнообратимых математических операциях(RSA - взятие по модулю), с синхронными дела проще. Самое простое, что лично я могу предложить(из разряда симметричных алгоритмов) - это модифицировать шифр одноразовых блокнотов. Он крайне тупой(XOR любой кусок кремния сделать сможет) и вполне криптостоек.",
				"added": 1622389516
			}
		],
		"9_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 4,
				"body": "Держу в курсе: 21-й год, блокируют торрент трекеры - кинчики и игры всё ещё качаются, пытались блочить телеграм - тоже не особо получилось, собираются блочить Tor и i2p - начинаю видеть тенденцию...",
				"added": 1622389938
			}
		]
	},
	"comment_vote": {}
}