{
	"next_paste_id": 1,
	"next_comment_id": 0,
	"paste": [
		{
			"paste_id": 0,
			"description": "",
			"body": "Жил-был в деревне старый человек. Он был очень беден, но даже короли завидовали ему, потому что у него был прекрасный белый конь. Ему предлагали за коня баснословные деньги, но старик говорил: “Этот конь для меня не конь, а личность. Как можно продать личность, друга?”\nЧеловек был беден, но никогда не соглашался продать коня. Однажды утром он не обнаружил коня в стойле. Собралась вся деревня и все осудили старика: “Ты – глупый старик, – говорили ему. – Мы знали, что когда-нибудь коня украдут. Уж лучше бы ты его продал. Что за невезение!”\nСтарик сказал: “Я не знаю всей истории. Я не знаю, ушел ли он, или его увели. Есть факт, все остальное – суждение. Является это невезением или благословлением, я не знаю, потому что все это только часть. Кто знает, что последует за этим?”\nЛюди засмеялись. Они всегда знали, что он немного ненормальный. Но спустя пятнадцать дней конь неожиданно вернулся, мало того, он привел с собой четырех жеребят. Люди снова собрались и сказали: “Ты был прав, старик, это не было невезением, это – благо”. И опять старик сказал: “Я не знаю всей истории. Знаю только, что коня не было, потом он вернулся. Кто знает, благословение это или нет? Вы прочли единственное слово в предложении – как вы можете судить о целой книге?”. Но люди все равно решили, что он не прав, ведь коней стало больше! У старика был единственный сын. Он начал объезжать жеребят и спустя неделю упал и сломал ногу.\nЛюди сказали: “Вот ведь невезение! Твой единственный сын лишился возможности ходить, а ведь он был тебе единственной поддержкой! Уж лучше бы ты тогда продал коня, были бы хоть деньги”.  И в который раз старик ответил им: “Вы одержимы суждением, не заходите так далеко. Я только знаю, что сын упал и сломал ногу. Никто не знает, невезение это или благословение”.\nТак случилось, что через несколько недель в стране разгорелась война, и всю молодежь забрали в армию. Только сын старика остался, потому что был покалечен. Все жители плакали, потому что сражения были проиграны и большинство молодежи погибло. Люди пришли к старику и сказали ему: “Ты был прав, это оказалось благом. Может быть, твой сын и покалечен, но он с тобой, наши сыновья ушли навсегда”. И снова старик сказал: “Вы продолжаете судить. Я не знаю всей истории, и никто не знает. Суждение означает застывшее состояние ума. Не судите, иначе вы никогда не станете едины с целым.”",
			"language": "plaintext",
			"added": 1457100847
		}
	],
	"comment": []
}