{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Sites de torrent da ZeroNet",
			"body": "#Play: Site de torrent estilo netflix só que somente de filmes com mais de 10 mil filmes dispoiveis.\n- http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/?Home\n\n#ZeroTorrent\n- http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3/?Home",
			"added": 1547923155
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1,
		"1_17vVta4NPuy7UXxmbwtHuB9YKf7opibVJ9": 1
	},
	"next_comment_id": 21,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Unobtainium\nNo campo da literatura, unobtainium é um termo frequentemente usado para descrever qualquer material (tal como um metal ou uma liga metálica) que possui propriedades extraordinárias que são únicas ou impossíveis de se obter no mundo real e, portanto, \"inobtível\" (em Inglês, unobtainable).\n\nEsses materiais são comumente citados no contexto dos romances de ficção científica.\n\n#Composição do Unobtainium (Inobtênio)\nTemos uma ligação metálica muito poderosa, feita principalmente da ligação entre a matriz de Tungstênio e Titânio a baixíssimas temperaturas, o que já faz menção ao nome: Inobtênio. Ao combinar esses metais, que no caso são os que tem maior e médio ponto de fusão, conseguimos aumentar o ponto de fusão e ebulição, além de teoricamente fazermos uma mutação com as partículas desse metais, transformando-os em um metal indestrutível se considerando o calor e a pressão do ambiente em que ele é encontrado.",
				"added": 1547918481
			},
			{
				"comment_id": 4,
				"body": "#Cientistas inventam liga de metal semelhante ao adamantium de Wolverine\nUm dos maiores sonhos dos fãs de histórias em quadrinhos está prestes a se realizar. Pesquisadores criaram uma nova liga de metal que, de tão resistente,  está sendo comparada ao adamantium, o metal indestrutível do qual é feito o esqueleto de Wolverine, um dos principais personagens dos X-Men.\n\nApós uma série de simulações feitas em computadores, cientistas dos Estados Unidos calcularam a composição ideal para uma liga super resistente e chegaram a uma combinação de háfnio, carbono e nitrogênio que tem o maior ponte de fusão já conhecido: 4126ºC.\n\n“A vantagem de começar a abordagem computacional é que nós podemos tentar lotes diferentes de combinações muito baratas e encontrar aqueles que talvez valesse a pena experimentar em laboratórios, fazendo assim com que haja uma significativa queda nos gastos”, explica Axel van de Walle, engenheiro que liderou a pesquisa.\n\nAgora o desafio dos cientistas chegará ao campo real: eles tentarão em breve colocar na prática a fusão dos materiais descoberta por computador. Caso essa fase tenha êxito, começarão a ser estudadas outras propriedades dos materiais, que poderão ser usadas principalmente no reforço de máquinas e naves que viajem pelo espaço.\n\n- Fonte: https://br.noticias.yahoo.com/",
				"added": 1547918987
			},
			{
				"comment_id": 11,
				"body": "#Radar quântico pode anular tecnologia de aviões \"invisíveis\"\n\n\n#Radar ultrasseguro\n\nUm radar baseado nas leis da mecânica quântica promete acabar de vez com a indústria dos detectores, pequenos aparelhos que motoristas usam para enganar os radares da polícia.\n\nMais do que isso, o sistema ultrasseguro poderá ser usado para anular mecanismos de camuflagem militar usados para que os aviões de guerra apareçam como pássaros nas telas de radar.\n\nSistemas de radar e LIDAR (radar a laser) emitem ondas de rádio ou de luz que refletem em um objeto e retornam à posição de origem, permitindo calcular posição, velocidade e formato do objeto.\n\nMas esses sistemas podem ser ludibriados por dispositivos que gerem ondas da mesma frequência que as emitidas para o rastreamento. É assim que os detectores de radar funcionam.\n\n#Criptografia de radar\n\nMehul Malik e seus colegas das universidades de Rochester (EUA) e Ottawa (Canadá) descobriram que é possível usar uma técnica da criptografia quântica - usada para proteger documentos - para revelar quando os fótons que retornam ao sistema são falsos.\n\nIsso permite distinguir entre os fótons verdadeiros, aqueles que são frutos da reflexão e trazem informação sobre o objeto de interesse, e aqueles que nasceram de um aparelho espião, que está tentando enganar o sistema.\n\nA técnica consiste em polarizar cada fóton que sai do radar em uma de duas formas, seguindo uma sequência precisa.\n\nO radar super-seguro mede a polarização dos fótons que chegam até ele, o que força alguém que está tentando criar um feixe de retorno falso a também polarizar seus fótons - só que eles não sabem a sequência correta, o equivalente à senha usada na criptografia.\n\n#Aviões visíveis\n\nMesmo que o sistema de detecção do radar tente medir os fótons que chegam até ele, a mecânica quântica garante que uma quantidade significativa das polarizações verdadeiras será perdida.\n\nAssim, um feixe falso sempre conterá mais fótons com polarizações erradas do que o feixe verdadeiro.\n\nNos testes de laboratório, os fótons refletidos pelo recorte de um bombardeiro stealth apresentaram uma taxa de erro inferior a 1%, enquanto mais de 50% dos fótons criados em tempo real para imitar a forma de uma ave - uma técnica usada pelos militares - tinham a polarização errada.\n\nA técnica é a mesma usada na criptografia quântica para detectar quando alguém está tentando interceptar uma mensagem.\n\n- Artigo científico: https://sci-hub.tw/10.1063/1.4770298",
				"added": 1547936868
			},
			{
				"comment_id": 12,
				"body": "#Retrorrefletividade\nRetrorrefletividade é um conceito utilizado nas tecnologias de sinalização vertical e horizontal para avaliar a quantidade de luz que retorna ao observador a partir de uma fonte luminosa próxima do ponto de vista do observador. Um retrorrefletor é um dispositivo ou superfície que reflete a luz de volta a sua origem com um mínimo de espalhamento da luz, mesmo os raios desta não estando ortogonais à superfície do retrorrefletor. Uma frente de onda eletromagnética é refletida de volta ao longo de um vetor que é paralelo mas com sentido oposto em rumo à fonte da onda. O ângulo de incidência da superfície pode ser maior que zero. É diferente de um espelho planar, que só reflete desta forma se o espelho está na perpendicular exata à fonte da onda, tendo um ângulo zero de incidência.",
				"added": 1547937077
			},
			{
				"comment_id": 13,
				"body": "#Pesquisadores brasileiros construíram um diodo óptico, um dispositivo fotônico que deixa a luz passar apenas em um sentido.\n\n- Os cientistas brasileiros participaram de um trabalho conjunto com aquela equipe pioneira, além de parceiros da Universidade Nanjing, na China.\n\n\n\nUm diodo óptico é um componente que impede os refluxos da luz, evitando, por exemplo, que a luz reflita no interior de uma fibra óptica, interferindo com o feixe principal.\n\nAs aplicações de um componente fotônico desse tipo são inúmeras, da simulação de sistemas quânticos até a fabricação de processadores fotônicos, que substituem os elétrons por fótons.\n\n#Camuflagem militar\n\nTecnicamente, o experimento pertence à classe dos metamateriais, materiais sintéticos mais conhecidos pelo desenvolvimento dos mantos de invisibilidade.\n\nOs pesquisadores brasileiros, ligados ao campo militar, estão interessados justamente em aplicações de invisibilidade.\n\nMais especificamente, eles estão interessados em impedir que objetos sejam vistos por radares, e planejam fazer isto interferindo com as ondas eletromagnéticas que os atingem, evitando sua reflexão.\n\nSegundo o grupo, a demonstração de um componente individual que impede o retorno das ondas eletromagnéticas demonstra a viabilidade de construção de aparatos mais complicados que possam ser usados para revestir os veículos de guerra.\n\n- Artigo científico: https://sci-hub.tw/10.1038/nmat3495",
				"added": 1547937582
			},
			{
				"comment_id": 14,
				"body": "#Primeiro avião com propulsão sem partes móveis\n\n#Avião sem partes móveis\n\nEngenheiros do MIT, nos EUA, construíram o primeiro avião sem partes móveis em seu sistema de propulsão e comprovaram que ele voa de verdade.\n\nEm vez de motores e hélices ou turbinas, a aeronave é impulsionada por um \"vento iônico\", um forte fluxo de íons que é produzido a bordo do avião e gera impulso suficiente para propelir a aeronave em um voo contínuo e constante.\n\nE, como não há motores, o voo é totalmente silencioso.\n\n\"Este é o primeiro voo sustentado de um avião sem partes móveis no sistema de propulsão,\" disse o professor Steven Barrett. \"Isso potencialmente abre novas e inexploradas possibilidades para aeronaves mais silenciosas, mecanicamente mais simples e que não emitem emissões de combustão.\"\n\nBarrett espera que, no curto prazo, tais sistemas de propulsão elétrico-eólica possam ser usados para viabilizar aviões menos barulhentos.\n\nAlém disso, ele prevê a propulsão iônica funcionando em paralelo com sistemas de combustão convencionais para criar aviões de passageiros híbridos mais eficientes em termos de combustível e outras aeronaves de grande porte.\n\n#Vento iônico\n\nO \"vento iônico\", também conhecido como impulso eletroaerodinâmico, é um princípio físico identificado pela primeira vez na década de 1920 e descreve um vento, ou impulso, que pode ser produzido quando uma corrente elétrica é passada entre um eletrodo fino e um espesso.\n\nSe uma tensão suficiente for aplicada, o ar entre os eletrodos pode produzir impulso suficiente para propelir uma pequena aeronave. Esse conceito de motor de vento iônico já havia sido demonstrado pela mesma equipe, mas em um experimento estático.\n\nPor anos, o impulso eletroaerodinâmico tem sido usado principalmente em projetos de hobby, limitados a pequenos \"ascensores\" (elevadores) de mesa amarrados a grandes fontes de tensão, que criam vento suficiente apenas para uma pequena aeronave pairar brevemente no ar. Supunha-se que seria impossível produzir vento iônico suficiente para impulsionar uma aeronave maior durante um voo sustentado. Barret e sua equipe provaram o contrário usando um planador grande e leve.\n\n#Avião elétrico sem motor\n\nA aeronave, que pesa cerca de 2,2 kg e tem uma envergadura de 5 metros, carrega uma série de fios finos, dispostos como uma cerca horizontal abaixo da extremidade dianteira da asa do avião. Os fios atuam como eletrodos carregados positivamente, enquanto fios mais grossos, dispostos de forma similar ao longo da extremidade traseira da asa do avião, servem como eletrodos negativos.\n\nA fuselagem do avião contém uma série de baterias de lítio-polímero. Uma fonte de alimentação converte a saída das baterias em uma tensão suficientemente alta para impulsionar o avião - nada menos do que 40.000 volts.\n\nUma vez que os fios são energizados, eles agem para atrair e remover elétrons das moléculas da ar ao redor, como um imã gigante que atrai limalhas de ferro. Com isso, as moléculas de ar são ionizadas e, por sua vez, atraídas pelos eletrodos carregados negativamente na parte de trás do avião.\n\nÀ medida que essa nuvem de íons flui em direção aos fios carregados negativamente, cada íon colide milhões de vezes com outras moléculas de ar, criando um impulso que empurra a aeronave para frente.\n\nA equipe de Barrett está trabalhando agora para aumentar a eficiência do projeto, para produzir mais vento iônico com uma tensão mais baixa. Eles também esperam aumentar a densidade de empuxo - a quantidade de empuxo gerado por unidade de área. Atualmente, o sistema de propulsão do avião requer uma área de eletrodos muito grande, mas a equipe vislumbra chegar a uma aeronave sem sistema de propulsão visível ou com superfícies de controle separadas, como lemes e elevadores.\n\n- Artigo científico: https://sci-hub.tw/10.1038/s41586-018-0707-9",
				"added": 1547939900
			},
			{
				"comment_id": 15,
				"body": "#Propulsão a laser supersônica para foguetes e aviões\n- https://sci-hub.tw/10.1364/AO.53.000I55",
				"added": 1547940099
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 2,
				"body": "#Envie notas que serão auto-destruídas após serem lidas.\n- https://secret.huri.biz/\n- Código-fonte: https://github.com/1tayH/secret.git",
				"added": 1547918596
			},
			{
				"comment_id": 3,
				"body": "#ViaCRYPT\nEste aplicativo é um sistema de mensagens criptografadas onde o destinatário pode ler a mensagem apenas uma vez. Após a leitura, a mensagem é apagada e não pode mais ser recuperada.\n\n- https://viacry.pt/\n- Código-fonte: https://github.com/vialink/viacrypt.git",
				"added": 1547918847
			},
			{
				"comment_id": 6,
				"body": "#Método Diceware: aprenda um método para criar senhas \"inquebráveis\"\nPara utilizá-lo, você vai precisar de pelo menos um dado, um pedaço de papel, uma caneta ou lápis e a tabela de palavras estruturada por seu criador.\n\nO primeiro passo é definir quantas palavras terá a sua frase-senha. Em seguida, pegue o dado e o jogue cinco vezes, sempre anotando cada um dos números tirados. Com essa sequência numérica de cinco dígitos formada, consulte a [tabela de Diceware](https://web.archive.org/web/20181208132416/http://world.std.com/~reinhold/dicewarewordlist.pdf). O termo correspondente será a primeira palavra da sua passphrase.\n\n- Exemplo: suponhamos que após jogar o dado por cinco vezes seguidas, obtivemos a sequência numérica 21254. Ao consultar a [tabela de Diceware](https://web.archive.org/web/20181208132416/http://world.std.com/~reinhold/dicewarewordlist.pdf), encontramos a palavra \"coil\". Portanto, esse será o termo inicial da nossa frase-chave.\n\nRepita o procedimento até que a quantidade de palavras previamente planejada para a criação da frase de acesso seja atingida. Sugerimos que você anote a senha criada em um papel e o carregue com você. Sempre que tiver a necessidade de usar a frase-senha, tente primeiro recordá-la a partir da sua memória. Caso precise, use a anotação como uma cola. Assim, em pouco tempo você deve memorizá-la completamente e poderá jogar fora o rascunho.\n\n#Posso confiar?\n\nA resposta é: SIM. Como o dado possui o formato de um cubo, ele possui seis lados representando os numerais de 1 a 6. Elevando esse número à quinta potência (6^5), que é a quantidade de vezes que você precisa jogar o dado para obter um termo, podemos concluir que a tabela de Diceware possui 7.776 palavras únicas.\n\nAssim, para uma senha que possua apenas uma palavra, a pessoa que esteja tentando descobri-la tem uma chance em 7.776 para desvendá-la “de primeira”. Com isso, se você construir uma passphrase com dois termos, essas chances são multiplicadas exponencialmente, o que significa 7.776^2 que resulta em 60.466.176 frases-chaves possíveis.\n\nArnold Reinhold, que inventou o método, sugere que as pessoas construam frases de acesso com pelo menos seis termos. Dessa forma, se formos bem precavidos e criarmos uma senha com sete palavras, o hacker terá uma chance em 1.719.070.799.748.422.591.028.658.176 de adivinhá-la pegando termos aleatórios da tabela de Diceware. Mesmo usando um computador que faça um trilhão de tentativas por segundo, essa pessoa poderia levar 27 milhões de anos para desvendar a frase de acesso.\n\n#Tabela de Diceware: https://web.archive.org/web/20181208132416/http://world.std.com/~reinhold/dicewarewordlist.pdf | SHA-256: 19ba9640273220097f874b6875eca818c378b2d8c211e776b165040872eafbcb\n\n- Fonte: TecMundo\n\n",
				"added": 1547919792
			},
			{
				"comment_id": 7,
				"body": "#Gerador de senhas Diceware\nAplicativo diceware baseado na Web que usa a função getRandomValues () criptograficamente segura\n- https://diceware.dmuth.org/\n- Código-fonte: https://github.com/dmuth/diceware.git",
				"added": 1547921208
			},
			{
				"comment_id": 8,
				"body": "#Password.diet | O gerador seguro de senhas diceware\nUm gerador de senha multi-wordlist diceware do lado do cliente com código-fonte completo\n- https://password.diet/\n- Código-fonte: https://github.com/password-diet/password.diet.git",
				"added": 1547921361
			},
			{
				"comment_id": 17,
				"body": "#Encryptr\nEncryptr é um programa gratuito que lhe oferece um cofre criptografado e protegido por uma senha mestra para você guardar suas senhas e outras informações pessoais, como os dados de seus cartões de crédito.\n\n- https://spideroak.com/encryptr/\n- Código-fonte: https://github.com/SpiderOak/Encryptr.git",
				"added": 1547942823
			},
			{
				"comment_id": 18,
				"body": "#Verficador de malware da Jotti\nO verificador de malware da Jotti é um serviço gratuito que permite a você verificar arquivos suspeitos com vários programas antivírus. Você pode enviar até 5 arquivos ao mesmo tempo. Existe um limite de 250MB por arquivo. Por favor tenha em mente que nenhuma solução de segurança oferece 100% de proteção, nem mesmo quando se usa vários motores de antivírus. Todos os arquivos são compartilhados com empresas de antivírus, para que a precisão de seus produtos antivírus possa ser melhorada.\n\n- https://virusscan.jotti.org/pt-BR/scan-file",
				"added": 1547943089
			},
			{
				"comment_id": 19,
				"body": "#VirusTotal\nO VirusTotal é um serviço online que analisa arquivos e URLS suspeitas e facilita a detecção de vírus, worms, cavalos de tróia e outros tipos malware.\n- https://www.virustotal.com/",
				"added": 1547943268
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 5,
				"body": "#Médicos injetam 5 litros de cerveja em estômago de paciente para salvá-lo\nMédicos de um hospital no Vietnã injetaram 5 litros de cerveja diretamente no estômago de um paciente para salvá-lo de uma intoxicação alcóolica. Nguyen Van Nhat, de 48 anos, recebeu o conteúdo de 15 latas da bebida até que recuperasse a consciência, segundo reportagem dos jornais britânicos LADbible e Daily Star.\n\nO médico Le Van Lam, responsável pela unidade de tratamento intensivo onde foi realizado o procedimento, afirmou que o paciente deu entrada com o nível de metanol no sangue 1.119 vezes acima do limite aceitável.\n\nSegundo ele, o corpo humano continua liberando o álcool na corrente sanguínea mesmo depois de a pessoa já ter terminado de consumir a bebida, inclusive durante os períodos de inconsciência.  O álcool, ainda de acordo com Van Lam, é encontrado nas formas de metanol e etanol, sendo que o fígado humano processa primeiramente o etanol – abundante na cerveja.\n\nA intoxicação do paciente, segundo o médico, ocorreu pela oxidação do metanol dentro do corpo, transformado primeiro em formaldeído e posteriormente em ácido fórmico. Para paralisar a formação do ácido fórmico, os médicos injetaram três latas de cerveja diretamente no estômago de Van Nhat, obrigado o fígado a dar prioridade para a quebra do etanol.\n\nO procedimento deu tempo para que fosse feita uma diálise completa no paciente. A partir daí, foram injetadas uma lata por hora no estômago de Van Nhat, até que ele recuperasse a consciência. Ao todo, foram utilizadas 15 latas.\n\nO médico Hans-Jörg Busch, do Hospital Universitário de Freiburg, na Alemanha, classificou a técnica como “incomum”, segundo a agência de notícias DPA. “O tratamento com 15 latas de cerveja é incomum, mas a teoria é bem conhecida. Talvez os colegas vietnamitas não tivessem outro álcool a disposição. O importante é iniciar o tratamento o quanto antes”.\n\n- Fonte: https://br.noticias.yahoo.com/",
				"added": 1547919075
			},
			{
				"comment_id": 16,
				"body": "#Cientistas querem sequenciar DNA de toda a vida na Terra\n\n#BioGenoma da Terra\n\nEstima-se que existam na Terra entre 10 milhões e 15 milhões de espécies eucarióticas, organismos cujas células têm um núcleo que abriga seu DNA cromossômico, o que inclui todas as plantas, animais, fungos e outros. Mas apenas 14% deles (2,3 milhões) são conhecidos e menos de 0,1% (15 mil) tiveram seu DNA sequenciado completamente.\n\nO conhecimento dessa pequena fração da biodiversidade terrestre resultou em enormes avanços na agricultura, medicina e indústrias baseadas em biotecnologia, além de melhorias nas estratégias para conservação de espécies ameaçadas de extinção, avaliam pesquisadores da área.\n\nA fim de preencher a enorme lacuna no conhecimento e explorar o potencial científico, econômico, social e ambiental da biodiversidade, um consórcio internacional pretende sequenciar, catalogar e caracterizar o genoma de todas as espécies eucarióticas da Terra ao longo de 10 anos.\n\nO projeto Projeto BioGenoma da Terra (EBP, na sigla em inglês) terá participação da FAPESP (Fundação de Amparo à Ciência do Estado de São Paulo).\n\n\"Sendo o Brasil um dos países mais biodiversos, os objetivos podem contribuir de forma muito destacada para o país\", disse Carlos Henrique de Brito Cruz, diretor científico da FAPESP.\n\n#Bioeconomia\n\nO projeto é considerado um dos mais ambiciosos da história da biologia e, na avaliação de seus coordenadores, só será possível realizá-lo agora em razão dos avanços na tecnologia de sequenciamento genômico, computação de alto desempenho, armazenamento de dados e bioinformática e da queda de custo do sequenciamento de genoma. E, além disso, da valorização dos biobancos - locais que armazenam a biodiversidade de forma catalogada, como museus, herbários e centros de coleção de culturas.\n\nCom o custo atual de US$ 1 mil para sequenciar o genoma de um vertebrado de tamanho médio, será possível sequenciar, ao custo aproximado de US$ 4,7 bilhões, o genoma de todo o 1,5 milhão de espécies conhecidas de eucariotos, estimam os cientistas. E também de entre 10 e 15 milhões de espécies desconhecidas - a maioria deles organismos unicelulares, insetos e pequenos animais nos oceanos.\n\nO custo, que inclui gastos com instrumentos de sequenciamento, coletas de amostras, armazenamento, análise, visualização e disseminação de dados e gerenciamento de projetos, é comparável ao investido no Projeto Genoma Humano, iniciado em 1990 e concluído em 2003, que custou US$ 4,8 bilhões.\n\n\"O Projeto BioGenoma da Terra lançará as bases científicas para uma nova bioeconomia que tem o potencial de trazer soluções inovadoras para problemas de saúde, ambientais, econômicos e sociais para pessoas em todo o mundo, especialmente em países subdesenvolvidos que possuem ativos de biodiversidade significativos\", disse Harris Lewin, da Universidade da Califórnia em Davis e presidente do grupo de trabalho que originou o projeto.\n\n- Artigo científico: https://sci-hub.tw/10.1073/pnas.1720115115",
				"added": 1547940477
			},
			{
				"comment_id": 20,
				"body": "#Projeto 1000 Genomas\n\nO Projeto 1000 Genomas, lançado em Janeiro de 2008, foi um esforço internacional de pesquisa para estabelecer o catálogo mais detalhado da variação genética humana.\n\n- https://anonfiles.com/5eu2ebr9b8/20130502.phase3.analysis.sequence_index SHA-256: 4986303a041485089fd0762d86fb8cbf61b41555c67f153cb026b0e595faf5e9",
				"added": 1547943634
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "#HOMEM-ARANHA: DE VOLTA AO LAR\nDepois de atuar ao lado dos Vingadores, chegou a hora do pequeno Peter Parker (Tom Holland) voltar para casa e para a sua vida, já não mais tão normal. Lutando diariamente contra pequenos crimes nas redondezas, ele pensa ter encontrado a missão de sua vida quando o terrível vilão Abutre (Michael Keaton) surge amedrontando a cidade. O problema é que a tarefa não será tão fácil como ele imaginava.\n- https://chishare.cc/embed/6501372326/",
				"added": 1547921713
			},
			{
				"comment_id": 10,
				"body": "#O HOMEM ELEFANTE\nA história de John Merrick (John Hurt), um desafortunado cidadão da Inglaterra vitoriana portador do caso mais grave de neurofibromatose múltipla registrado até então, tendo 90% do corpo deformado. Exibido como monstro em circos e considerado débil mental pela sua dificuldade de falar, é salvo por um médico, Frederick Treves (Anthony Hopkins). No hospital Merrick se libera emocionalmente e intelectualmente, além de mostrar ser uma pessoa sensível ao extremo. Sra. Kendal (Anne Bancroft), uma grande atriz, torna-se sua amiga e até a coroa britânica sensibiliza-se com o caso.\n- https://ok.ru/video/27646691987",
				"added": 1547928717
			}
		]
	},
	"comment_vote": {
		"4_17vVta4NPuy7UXxmbwtHuB9YKf7opibVJ9": 1,
		"5_17vVta4NPuy7UXxmbwtHuB9YKf7opibVJ9": 1,
		"37_14ixKDLhbV4cd57M52FX5iVDvpwKB4ufuS": 1
	}
}