{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1515489402_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1
	},
	"next_comment_id": 50,
	"comment": {
		"1512670072_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": [
			{
				"comment_id": 1,
				"body": "Many do not distinguish between Muslims and radical Islamists. Among Christians, too, there are aggressive minorities. Remember, for example, the recent burning of sorcerers in Kenya. This is no reason to blame all Christians for their bloodthirstiness.",
				"added": 1513817792
			}
		],
		"1512173823_1PdVrw7boKHUavWTQxD3UaNGM4tx5baXDy": [
			{
				"comment_id": 2,
				"body": "> [penetratormk2](#comment_7_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5): You'd be better off waiting for some English-speaking slav to do it. They have much bigger chance of surviving. :)\n\nI can not remember that we have killed foreign fans :)",
				"added": 1513817970
			}
		],
		"1512623414_1HBy99H2dsCwevdYZp8VVC2SVG69DGVyEd": [
			{
				"comment_id": 3,
				"body": ">What perspectives?\n\nI see very good prospects :) ZeroNet is well developed. And the number of users, although not great, but enough for communication. But I'm happy with ZN in another - guaranteeing the safety of content, while there are people interested in it.",
				"added": 1513818177
			},
			{
				"comment_id": 5,
				"body": "> [schiz0](#comment_11_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k): in IPFS proxies are part of the network and they seem more useful\n\nThis is not true. Gateways in IPFS are not part of the network, but the same private solutions as the proxy in ZeroNet. gateway.ipfs.io is not part of the network, it is a **centralized** network development service. And tomorrow it can be closed or blocked. At work IPFS this will not affect, but all the usual Web-resources using this gate will stop working. Therefore, for my own purposes I use my own gates, as in ZeroNet :)",
				"added": 1513935347
			},
			{
				"comment_id": 27,
				"body": "Statistics on the number of posts in blogs that I found and posts which I collect at http://www.zites.cf\n\nIndeed, in 2017 the message was three times less than in 2016:\n\nhttp://127.0.0.1:43110/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/data/img/post_66_2018-01-25_22-24-21.png",
				"added": 1516927682
			}
		],
		"1513852777_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": [
			{
				"comment_id": 4,
				"body": ">Does it work ? can it be defeated ?\n\nIt works. They just look at the hashes available by DHT. To struggle with it - to close DHT or to leave through any VPN about which you precisely know, that he will not give out you.",
				"added": 1513860581
			},
			{
				"comment_id": 6,
				"body": "> [tombombadildo](#comment_10_16AACVBLhoSY2jjGMtP7VKAEbjJUcKgQ1y): It shows the BitTorrent sharing/download of videos by certain IP addresses. [...]\n\nThe belonging of an IP to a particular person at the right time is almost always determined. Almost in all countries there are massive examples of convictions for illegal activities on the Internet. And the culprits are determined, naturally, through their IP. To prove the guilt of this, depending on the laws of the country, there may be few, but it helps to find the offender. And then his guilt is determined by more unambiguous methods. For example, during a search by court order.",
				"added": 1514002605
			}
		],
		"1514239987_1AWmDPJBYVGXKfNwKvkSFZmbqRu1eeVQTi": [
			{
				"comment_id": 7,
				"body": "17723 peers\n\nhttp://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:26:География+ZeroNet\n\n(Post in Russian, but the pictures are clear :) )\n\nBut, in general, I saw 27,000+ peers.",
				"added": 1514313683
			},
			{
				"comment_id": 8,
				"body": ">if you look at zeroname there is 1k seeders is that the total number of seeders or just connected ones ?\n\nThis is only the number of peers that your ZeroNet node knows about. With each of which your zero-node can try to connect. But the total number of ZeroNet users can be much larger.\n\nI very roughly estimate the number of nodes in ZeroNet no less than 40,000.",
				"added": 1514313995
			}
		],
		"1515157044_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": [
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_36_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Installed on a phone with 128GB ...\n\nIn the topic-start, it seems, not about phones, but about ordinary computers :)",
				"added": 1515165663
			},
			{
				"comment_id": 10,
				"body": "> [alooptheloopthel](#comment_4_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P): Ya, general sites with zeronet don't require servers to be running 24/7\n\nFor me, the main plus of ZeroNet is not even that. And the fact that important information does not disappear because someone will run out of money to pay for hosting or lose interest in your site. I have been on the Internet for 20 years. And, my God, how much unique information has disappeared during this time ... And with ZeroNet, I can be sure that such information will be kept while there is at least one to whom it is interesting and necessary.",
				"added": 1515193251
			}
		],
		"1515489402_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 11,
				"body": "**Perfect solution!**\n\nA couple of comments.\n\n1. It would be very useful to make discussion of music and albums, requests for re-laying out, pointing out mistakes, etc. In the future, you can do it right in the program, but for now it's easy enough solution - you can make a clone of ZeroTalk and in ZeroLSTN add to each page a link to such a forum. If it is inconvenient and troublesome for you to follow such a forum yourself and support it, it can be, for example, such a copy: http://127.0.0.1:43110/1HidBY8MhvfnGJNPcuh47TCfbK25VvdzzY/\n\n2. For the previous sentence, it would be nice if you could make links directly to the albums, not just the artist.\n\n3. It is very important to be able to store your own playlists!\n\n4. A more complex, less important, but very useful feature is the ability to specify a cover for the album, and for the song its lyrics.\n\n5. It is also important to be able to search the song database.\n\n>I am currently in the process of writing a dev blog\n\nWhere can I read it? :)",
				"added": 1515833500
			},
			{
				"comment_id": 12,
				"body": "> I've also already started to see some typos in song information (i.e. Adele - Turning Tabels), this will hopefully become less common as I will soon have automatic tag-reading from files, but issues could still arise.\n\nThere will be many typos. There will be many simple mistakes. And in the tags - too :) In Russia there is a large social network Vkontakte, a local analogue of Facebook. Unlike Facebook, there is an opportunity to share music. And for many years this social network did not control copyright issues in any way. Millions of users there left a huge amount of different music. So, the number of errors and typos there is simply beyond the reach! :D\n\n> Covers can be stored in the song's metadata, so yes this will be coming! Some song files may already have it embedded as well!\n\nYes, in those files that I uploaded, the cover everywhere has mp3 tags.",
				"added": 1515835128
			},
			{
				"comment_id": 13,
				"body": "> [zerolstnmobile](#comment_19_1EmrB8xSDYobVFSc3Kad1vx1EPaPR2myCW): One interesting idea would be to instead store song metadata wiki-style\n\nI'm afraid this can eventually consume a lot of resources. Not in the matter of storage, but in the matter of processing. I do not know yet how to do better. I think this problem can be solved later :) Now it is not yet relevant. And as they say in the important rule of programming - **premature optimization is the root of all evil in programming** :)\n\n>I've also just realized that if we store the album cover entirely in the audio file, then it'll be impossible to change down the road since changing the file would change the hash\n\nIt may be easier not to become attached to playlists to the hash, but only to the name? This will not allow us to store incorrect names in the playlists, but if we assume that most of the names will be correct, this will allow us to manipulate the file painlessly in the future - to change the tags, update it with a higher quality version, etc. You can also try to search, for example, by name, and if not found, then by hash.",
				"added": 1515836330
			},
			{
				"comment_id": 44,
				"body": "On all my ZN-nodes recently, when I try to download ZeroLSTN, everything is downloaded except for these 4 files:\n```\ndbschema.json\njs/bundle.js.map\ncss/main.css\njs/bundle.js\n```\nBecause of this, the ZeroLSTN site does not work. The same files that are in GitCenter have different sizes and hashes. If I take `content.json` from GitCenter, then when I update the site, it still downloads another content.json, the files in which are different from the GitCenter files.",
				"added": 1526199347
			},
			{
				"comment_id": 45,
				"body": "```\nNEEDS TO BE UPDATED:\ndbschema.json\ncss/main.css\njs/bundle.js.map\n./recommended.json\njs/bundle.js\n```\n\nDownloaded **content.json** from ZeroNet:\n```\n  \"js/bundle.js\": {\n   \"sha512\": \"5447a300af7c1528b5e3de899e56db870a0d1813ebbfd2eda96af823b6fb6ed7\",\n   \"size\": 1942070\n  },\n```\n\nReally downloaded `js/bundle.js`:\n```\n-rw-rw-r-- 1 balancer balancer 1729207 May 13 11:12 bundle.js\n```",
				"added": 1526199715
			}
		],
		"1516279757_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 14,
				"body": "Do not look in this venture a lot of meaning. It's all simple. The modern classic Internet is very vulnerable to the impact of the United States. It is enough to disrupt the work of Russian domains in root DNS or make appropriate changes to routing. Given the pressure from the West in recent times, all Russian networks should have the ability to continue working after sanctions against Russia. And this task is not simple. Here its decision, I think, was called loudly \"the creation of the Russian Internet\" :)",
				"added": 1516327449
			},
			{
				"comment_id": 18,
				"body": "> [alooptheloopthel](#comment_16_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P): zeronet.io is banned in china\n\nYes, but there are not struggling with the network itself. And zeronet.io is only an entry point where you can read about the network and find where to download the software",
				"added": 1516372255
			},
			{
				"comment_id": 39,
				"body": "> [test20180221](#comment_12_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): This is just an extended strategic action.  [...]\n\nhttp://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1519616295_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/Russia+s+own+Internet",
				"added": 1519616324
			}
		],
		"1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 15,
				"body": "It's hard to struggle with the brainwashed western philistine :)",
				"added": 1516331264
			},
			{
				"comment_id": 16,
				"body": "> [caryoscelus](#comment_12_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Lol, 0net must be getting popular if pro-putin trolls have already appeared\n\nOf course. In Russia now 86% of such trolls. There are about 84 million Russian on the Internet. And it turns out that the internet-pro-putin-trolls are more than 72 million. No wonder you meet us even in ZeroNet :)",
				"added": 1516354787
			},
			{
				"comment_id": 17,
				"body": "> [mnemonic](#comment_26_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE): Therefore tribalism is very desirable thing to ignite ...\n\nOne of the reasons I came to English-speaking forums three years ago. As soon as the electronic translators began to allow this. (Since I know English only at the level of reading technical documentation :)) Western media, show a very one-sided and distorted picture of Russia. And it builds a natural one-sided iron curtain. It is very simple to abstractly hate someone unfamiliar. But it's harder to hate someone you know. The Russians are in a somewhat more favorable position. There are a lot of Western media in Russia. We watch western films. We read modern Western literature. Tens of millions of Russians communicate on the Internet, which, for the time being, has no boundaries. Therefore, we in Russia represent what the West is living and Russian official propaganda affects us much less. In addition, many people in Russia have remained immune to state propaganda since the time of the USSR. In the West, the picture is quite different. Western users do not go to Russian sites. Do not watch the Russian media. Blindly believe what is said in the Western media. Although here some blow struck the last scandals with Trump. But still, the belief in official sources in the West, at times, is simply amazing. So I'm trying to build a bridge. No, the bridge is an exaggeration. I try to put my small plaque on the construction of such a bridge :) Well, since I write something like that in English-language forums, so that my translations into English are not lost and did not disappear, at the same time I write many of my notes here, in ZeroNet in my \"Broken-English\" blog :)",
				"added": 1516367617
			},
			{
				"comment_id": 19,
				"body": "> [caryoscelus](#comment_13_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I have no idea whether you're pro-putin or not, but you do not look like a troll.\n\nIt's easier for me to immediately call myself a troll and admit that I live in Mordor. This saves a lot of senseless holywars :)\n\n> Also, it's sad to see these 86% being repeated seriously.\n\nThis is reality. Many do not believe, but the opposition in Russia, indeed, has a few percent support.",
				"added": 1516374937
			},
			{
				"comment_id": 20,
				"body": "> [mnemonic](#comment_27_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE): People who think before they react generally can be found all over the world.\n\nCertainly. In any country in the world there are people who know how to think on their own, and those who believe any propaganda thoughtlessly. I see both, both in Russia and in the foreign Internet. But in Russia, people are traditionally more critical of state propaganda than in the West. Moreover, as soon as some kind of active propaganda starts in the media, most people start to look for some kind of dirty trick :) And even fanatics with brainwashed Russians in their arguments never use links to Russian media :) They can repeat arguments from the media. But the media themselves will not be used as an argument. But in communicating with Western users, I often see a link to the media as a source, the information of which is absolute truth only because it is the media :)",
				"added": 1516375412
			},
			{
				"comment_id": 21,
				"body": "> [caryoscelus](#comment_14_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Low opposition support does not mean high gov support.\n\nIn Russia there are few dissatisfied with the current government. We survived the horror of the 1990s. And they remembered it well after the coup in Ukraine. In addition, the sanctions of the West create an image of the enemy and engender rallying of Russians around the leader. This is a traditional, centuries-old reaction developed :) Until 2014, Putin's rating fell even below 50%. But after 2014 it grew very much.\n\nThis is not love for Putin. This is the absence of a strong alternative policy. And few people want to change the famous and powerful Putin to an unknown weakling.\n\n> And yet 86%? Seriously?\n\nI can not vouch for every percent, besides, the figure always changes and depends on the conditions of the survey. But the fact that Putin supports an absolute majority. Maybe it's 75%. Maybe 90%. More precisely, in my assessment I can not say. But the figure of 86% was voiced by the independent agency Levada. Which is now recognized as a foreign agent and whose activities in Russia are now limited. So it's hard to blame him for juggling the results :)",
				"added": 1516376375
			},
			{
				"comment_id": 22,
				"body": "> [ssdifnskdjfnsdjk](#comment_48_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): and i do not like \"powerfull empires\" and one person \"ruling it\" and dictating others.\n\nI, too, are opposed to the concentration of power in one hand. Even if it's some kind of perfect hands. People grow old and die. A country that has held on only one leader may not survive the withdrawal of this leader. Therefore, I am against authoritarian power. I plan to live longer than Putin and even more so I hope that my children will live even longer :) And I do not want Russia to collapse into chaos similar to the 1990's when Putin leaves power. But the trouble is that, indeed, in Russia now there is no second policy of this level. It's bad, but it's reality: - /\n\n> I believe in Russia is more corruption on high levels than in most european democratic countries\n\nHere I can not evaluate reliably. In Russia, the exact level of corruption was enormous in the 1990s. But throughout the 2000s, corruption was systematically eliminated. Both at the household level and at the ministerial level. If in the 1990s to give a small bribe to a policeman was considered normal, today it is almost impossible. I think that corruption in Russia today meets the average level in Europe. Exactly lower than, for example, in Italy or Greece :)",
				"added": 1516377058
			},
			{
				"comment_id": 23,
				"body": "> [ssdifnskdjfnsdjk](#comment_48_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): https://en.wikipedia.org/wiki/Corruption_Perceptions_Index\n\nSuch figures should be treated with caution. For example, Finland ranks third in the list. And at the domestic level, corruption is really minimal there. But there is a lot of information that there is a very high level of corruption at the level of enterprise management and its connections with the state.\n\nCanada is on the 9th place. But a friend who lived there for 7 years (and obtained Canadian citizenship), says that the level of corruption there at all levels is much higher than in Russia. That everything, from the removal of an apartment and medicine to business is done only through bribes and gifts, strangers diligently get out of the market, etc.\n\nSo such lists only give a very rough idea and you need to be critical of them :)",
				"added": 1516377441
			},
			{
				"comment_id": 24,
				"body": "> [kai0](#comment_452_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): even Korea change president all the time no body worry about ...\n\nAnd what do you say about Angel Merkel? :)\n\n>if Putin no more as a president they all will finished, that's a stupid nation.\n\nCall an independent Russian politician, who today can change Putin.",
				"added": 1516377640
			},
			{
				"comment_id": 25,
				"body": "> [caryoscelus](#comment_15_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): And if you live in russia, you should know the proverb about lies and statistics. There's not much point in looking at survey % if you don't have enough understanding to interpret it.\n\nExactly. Statistics numbers must always be critically evaluated. But in Russia, indeed, Putin's very high rating. I have 15 young and middle-aged people in my office. About 2/3 of them support Putin. Another 1/3 - do not care. None against. They are active modern people, e-commerce and IT. Among my relatives, the attitude is approximately the same. I do not write about my friends, because they will still be a non-representative example (we choose our friends ourselves, unlike colleagues and relatives :)) Voices against Putin in real life I hear sometimes usually only on the street amidst, strangely enough, pensioners :) Judging by the image, these are the remains of those who broke up the USSR. But there are not many of these.\n\n>If opposition is continuously repressed and propaganda covers most of population, you get no strong opposition. Surprise.\n\nFor the West it's amazing, but in Russia no one actively suppresses the opposition. This is not required, because the opposition's statements are categorically not supported by the majority of Russians. For example, the entire active opposition publicly adheres to the position \"Russia is a good country. But people in Russia are cattle. \" With such an attitude, it is impossible to count on any support from the population. Propaganda against the opposition? She is simply not needed in these conditions :)\n\n> Well, if you prefer to live in such a world, i'll leave you alone here.\n\nAs you say. Probably, we can not convince each other. You do not see what is happening in Russia with your own eyes. I can not persuade you more than Western propaganda. And the limit of my messages in ZeroTalk is limited to 50kB :)",
				"added": 1516380026
			},
			{
				"comment_id": 26,
				"body": "> [caryoscelus](#comment_17_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): So, can we expect a constructive reply from you or are you only interested in monologues\n\nI responded to another forum:\n\nhttp://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1516525953_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/+I+will+consider+Russia+as+a+low+IQ+nation+as+China",
				"added": 1516527279
			},
			{
				"comment_id": 34,
				"body": "> [helium](#comment_153_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): I'm running out of characters again on ZeroTalk\n\nFunny, I already offered a clone of ZeroTalk with a large limit for messages :)\n\nhttp://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/\n\nBut for your link I only see the empty forum without any topic.\n\n(USED: 23.5K/50K here)",
				"added": 1518199901
			}
		],
		"1517522636_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5": [
			{
				"comment_id": 28,
				"body": "https://proxy.zeronet.a0z.ru/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/data/img/post_37_2018-01-19_23-24-37.jpg\n\n:)\n\nRussia, Moscow.",
				"added": 1517535383
			},
			{
				"comment_id": 30,
				"body": "> [l0bster](#comment_6_1FcMuJwqkSPP7C3gnNLugZGwwSGpugX2rA): I understand why from China so many people, but why US, EU? The wind of democracy?Russia, Moscow\n\nBy the way, I chose ZeroNet not because it allows you to bypass those sprouts of lack of freedom that appeared on the Russian Internet, but because ZeroNet allows you to keep forever information that is of interest to someone. I have been on the Internet for more than 20 years and I am horrified how much useful and unique information was lost during this time due to the use of classical Internet technologies.",
				"added": 1517643887
			},
			{
				"comment_id": 32,
				"body": "> [l0bster](#comment_8_1FcMuJwqkSPP7C3gnNLugZGwwSGpugX2rA): For example? Google cache, internet archive...\n\nThis all does not ensure the reliability of storage. And does not store everything that was. Want an example? Find me the verses and prose of my friend, who contained the site http://www.initiation.ru/ and who died in 2010.\n\nAnd this is a very fresh example.",
				"added": 1517682708
			},
			{
				"comment_id": 33,
				"body": "> [helium](#comment_123_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): Except the people, who run the ZeroNet servers.\n\nBut here the availability of \"servers\" does not depend on one person. Even if the author of the site dies, while this site will be of interest - it will live.",
				"added": 1517711286
			}
		],
		"1517542675_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 29,
				"body": "More topics:\n\n- [ZeroLSTN - Music Streaming For All!](/Talk.ZeroNetwork.bit/?Topic:1515489402_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/ZeroLSTN+Music+Streaming+For+All)\n- [Introducing ZeroLSTN Dev Notes!](/Talk.ZeroNetwork.bit/?Topic:1516961495_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj/Introducing+ZeroLSTN+Dev+Notes)",
				"added": 1517570946
			}
		],
		"1_1JnpHQf9rBR1hp2UMj6NNq8KYwV99jLr1f": [
			{
				"comment_id": 31,
				"body": "At me now it is worse. Antilibrary generally ceased to open. Gives an error message:\n\n```\nInternal error: Exception: No merger (147nKEb9bBJgBDgQytEQhmiGjF8e6HkEua) permission to load: \nmerged-Antilibrary/19sZZmJPz1hADwitEs2XT6U46uHLGbHqKi/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/data.json (Antilibrary not in [])\nUiWebsocket.py line 217 > MergerSitePlugin.py line 150 > MergerSitePlugin.py line 127 > MergerSitePlugin.py line 44\n```",
				"added": 1517659829
			}
		],
		"1518793754_1D8nrvyX1Hwj1FvSvFWZWLsT8R48F3sqpF": [
			{
				"comment_id": 35,
				"body": "> [vnjghj](#comment_3_14AFYC2XHruHCHZ2G7qhBfNtZmGwGAZ8xE): is dead because nobody want to donate ipfs hosting ...\n\nPreviously, I actively supported IPFS on multiple servers. But new versions of IPFS consume more and more memory and IO. It seems that the IPFS daemon is trying to take all available resources of the machine. Do not even help the conclusion of a daemon in a Docker-container. Because of this, I had to remove IPFS from all my servers, leaving it only on one to distribute only my own data, which was once referred to somewhere.",
				"added": 1518928249
			}
		],
		"1519293678_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 36,
				"body": ">What is the difference between these two systems\n\nIPFS is only a transport for transferring static data. ZeroNet is a platform with dynamic applications and its own transport. Compare IPFS and ZeroNet - about the same as comparing the Intel processor and mobile phone :)\n\n> If I understand it correctly, IPFS is mainly to be used for files whereas ZeroNet's focus seems to be websites.\n\nIf we compare not IPFS and ZeroNet, but IPFS and file transfer to ZeroNet, the main difference is that IPFS is a content-addressed system. Each file is determined by its hash, regardless of where it is located and under what name. In ZeroNet files, as in Clearnet are at specific addresses under specific names.",
				"added": 1519307864
			},
			{
				"comment_id": 37,
				"body": "> [beenotung](#comment_5_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): note that IPFS can also do dynamic webapp.by using Ajax to ipns or the clearnet\n\nAs noted above, IPNS is extremely slow. In the best case, it is only suitable for specifying the entry point to the static network. Of course, you can make dynamic content on WebRTC. But in the end it turns out to be a very complex model for implementing what already exists and works great in ZeroNet :)",
				"added": 1519328259
			}
		],
		"1519403325_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": [
			{
				"comment_id": 38,
				"body": ">Is there any way to sort directories of sites on the bash command line?\n\nhttp://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1519459714_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/command+line+site+sorting\n\nSorry that I am responding to another forum, this is the end of my message limit.",
				"added": 1519459785
			}
		],
		"1524390613_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 40,
				"body": "In this forum a VERY small messages limit of 50k bytes and it is exhausted for many. With such big topics as politics, it's better to go into forums with a larger limit, for example: http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/",
				"added": 1524391519
			}
		],
		"1526116721_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 41,
				"body": "If you use a connection via Tor, you will not see yourself on this map. If you use a direct connection, your IP is known. And on it is determined and an approximate position on the globe.",
				"added": 1526117638
			},
			{
				"comment_id": 42,
				"body": "> [thunder33345](#comment_42_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): the zeronet has tor but i am using normal browsers\n\nIn this case, you should not be visible on the map :)",
				"added": 1526118362
			},
			{
				"comment_id": 43,
				"body": "> [thunder33345](#comment_43_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): it still seems like i am somehow visible in the map, verified by creating a new site with no peers\n\nThe map shows not the sites, but ZeroNet nodes. In general, ZeroNet does not know who created the site.",
				"added": 1526122883
			}
		],
		"1526232741_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 46,
				"body": "If you run out of space (like me :D), and the forum administration does not increase the limits, you can delete old messages or go to an alternative forum with more limits. For example:  [Unlimit Talk](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh). Or clone your own.",
				"added": 1526239741
			},
			{
				"comment_id": 47,
				"body": "> [thunder33345](#comment_53_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): Ghost town here i come!\n\nAll ZeroNet - is a Ghost town where there are more buildings (content) than people :)",
				"added": 1526241707
			}
		],
		"1526283454_17d3S7saDQP5phkkWS9F7tMJTymqLCQmig": [
			{
				"comment_id": 48,
				"body": "[Reply in another forum](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1526291696_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw)",
				"added": 1526291800
			}
		],
		"1526415723_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 49,
				"body": "[Is the Universe a Simulation?](/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1526443011_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw#comment_15_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw)",
				"added": 1526443971
			}
		]
	},
	"comment_vote": {
		"21_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1
	}
}