{"users_books":[{"userid":"1Av4nvMzFu3DE92iGS2JpBXBBngF7NkKr","b_id":"90e7e49ee46ea4dd7680171183c0f656","t":"Blink - The Power of Thinking Without Thinking","a":"Malcom Gladwell","i10":"","i13":"","asin":"0316010669","p_m":null,"p_y":"2007","d":"Blink is a book about how we think without thinking, about choices that seem to be made in an instant-in the blink of an eye-that actually aren't as simple as they seem. Why are some people brilliant decision makers, while others are consistently inept? Why do some people follow their instincts and win, while others end up stumbling into error? How do our brains really work-in the office, in the classroom, in the kitchen, and in the bedroom? And why are the best decisions often those that are impossible to explain to others?\n\nIn Blink we meet the psychologist who has learned to predict whether a marriage will last, based on a few minutes of observing a couple; the tennis coach who knows when a player will double-fault before the racket even makes contact with the ball; the antiquities experts who recognize a fake at a glance. Here, too, are great failures of \"blink\": the election of Warren Harding; \"New Coke\"; and the shooting of Amadou Diallo by police.\n\nBlink reveals that great decision makers aren't those who process the most information or spend the most time deliberating, but those who have perfected the art of \"thin-slicing\"-filtering the very few factors that matter from an overwhelming number of variables.","p":"","l":"en","f_n":"book_files/Malcom Gladwell - Blink, The Power of Thinking Without Thinking.mobi","f_s":309366,"f_t":"mobi","f_u":"/ZeroNet-Internal/BigfileUpload?upload_nonce=cfa23a9ec75fde81e0aaba4e5719367bc92edd7454b2fbafa0eef1c3e6d6d7d3","g_id":""},{"userid":"1Av4nvMzFu3DE92iGS2JpBXBBngF7NkKr","b_id":"5947c49c0023411aab1f1a22faae08ef","t":"The Tipping Point - How Little Things Can Make a Big Difference","a":"Malcom Gladwell","i10":"0316346624","i13":"","asin":"","p_m":null,"p_y":"2002","d":"The tipping point is that magic moment when an idea, trend, or social behavior crosses a threshold, tips, and spreads like wildfire. Just as a single sick person can start an epidemic of the flu, so too can a small but precisely targeted push cause a fashion trend, the popularity of a new product, or a drop in the crime rate. This widely acclaimed bestseller, in which Malcolm Gladwell explores and brilliantly illuminates the tipping point phenomenon, is already changing the way people throughout the world think about selling products and disseminating ideas.","p":"","l":null,"f_n":"book_files/Malcom Gladwell - The Tipping Point, How Little Things Can Make a Big Difference.mobi","f_s":443085,"f_t":"mobi","f_u":"/ZeroNet-Internal/BigfileUpload?upload_nonce=aa716b17152026d0fafc59b3111a7eeddd90621321cf075026ff43e3115efc03","g_id":"2612.The_Tipping_Point"},{"userid":"1Av4nvMzFu3DE92iGS2JpBXBBngF7NkKr","b_id":"2e4882a27a8c5b931ebe39e82dd04457","t":"Outliers - The Story of Success","a":"Malcom Gladwell","i10":"0316017930","i13":"","asin":"","p_m":null,"p_y":"2011","d":"In this stunning new book, Malcolm Gladwell takes us on an intellectual journey through the world of \"outliers\"--the best and the brightest, the most famous and the most successful. He asks the question: what makes high-achievers different?\n\nHis answer is that we pay too much attention to what successful people are like, and too little attention to where they are from: that is, their culture, their family, their generation, and the idiosyncratic experiences of their upbringing. Along the way he explains the secrets of software billionaires, what it takes to be a great soccer player, why Asians are good at math, and what made the Beatles the greatest rock band.\n\nBrilliant and entertaining, Outliers is a landmark work that will simultaneously delight and illuminate.","p":"","l":"en","f_n":"book_files/Malcom Gladwell - Outliers, The Story of Success.mobi","f_s":412659,"f_t":"mobi","f_u":"/ZeroNet-Internal/BigfileUpload?upload_nonce=0c9a67dfeb83d5e82dce51c14706309e2496263e62bdcb2df82c8055a85aad23","g_id":"3228917-outliers"}],"shelves":[{"name":"Want to Read","books":[],"index":0},{"name":"Read","books":[],"index":1},{"name":"Pending","books":[],"index":2},{"name":"Uploads","books":[],"index":3}]}