{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1525490283,
			"title": "Is there any pre-packaged software that will work with ZeroNet?",
			"body": "I know that running websites that have php backends won't work. But is there any existing services such as EtherBB, etc, that will work?",
			"added": 1525490282
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1525490283_1DaTaCBTsLEJn1EpEfiuJQpVuDbZrQncwx": [
			{
				"comment_id": 1,
				"body": "> [eibriel](#comment_44_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): you will get an empty zite just by clonning them using the user interface. ZeroBlog, ZeroTalk for example\n\nFirst off, I want to say thanks for this - it's a great resource. I really love what is going on here with ZeroNet. I'm majoring in Software Programming and I'm definitely interested in the possibilities with ZeroNet. I'm actually a low-level C programmer so making some change to web development languages is definitely a change. \n\nHas anyone thought of making a client-side database management tool yet? Something similar to phpMyAdmin? I assume that this would be possible? Thanks again for the help everyone :)",
				"added": 1525499940
			},
			{
				"comment_id": 2,
				"body": "> [shitchell](#comment_41_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Anything that's purely javascript based should run just fine. Lots of HTML5 games. I've got a document editor that currently just saves your work to localStorage, which would be easily used on ZeroNet or the clearnet just the same (though I'm working on getting it to save documents locally as well as being shareable). [...]\n\nThanks for your information. Not sure if I overlooked this or if I hadn't updated when I replied (?), but the input's very much appreciated. \n\nI'm a bit confused about the database schema. I assume that the data is actually stored in SQLite locally? Or is it actually stored in json? If it is stored in json, am I correct to assume that once a user has been authorized by the site owner to modify the json file in their directory (/data/users/..) that data is then read/write through jscript and displayed locally for the user? Please correct me if I'm wrong. I'm just trying to get a better understanding of how this works.\n\nRegards!",
				"added": 1525501491
			},
			{
				"comment_id": 3,
				"body": "> [shitchell](#comment_41_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo): Anything that's purely javascript based should run just fine. Lots of HTML5 games. I've got a document editor that currently just saves your work to localStorage, which would be easily used on ZeroNet or the clearnet just the same (though I'm working on getting it to save documents locally as well as being shareable). [...]\n\nThanks for your information. Not sure if I overlooked this or if I hadn't updated when I replied (?), but the input's very much appreciated. \n\nI'm a bit confused about the database schema. I assume that the data is actually stored in SQLite locally? Or is it actually stored in json? If it is stored in json, am I correct to assume that once a user has been authorized by the site owner to modify the json file in their directory (/data/users/..) that data is then read/write through jscript and displayed locally for the user? Please correct me if I'm wrong. I'm just trying to get a better understanding of how this works.\n\nRegards!",
				"added": 1525501500
			},
			{
				"comment_id": 4,
				"body": "> [quantumday3](#comment_12_1EHjrNgbVBWHQ7BiKwqKD6pSbowepFP8sf): no more stabbing in the back. we cooperate, or thats the end of the species\n\nRight :D",
				"added": 1525502136
			}
		],
		"1525624122_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 5,
				"body": "A database management script would be great. Something along the lines of what phpMyAdmin is for MySQL databases. A software that would allow developer to easily create databases, tables, rows, columns, etc.",
				"added": 1525745742
			}
		]
	},
	"comment_vote": {}
}