{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#MEMÓRIAS CUBANAS: CHE, 40 ANOS DEPOIS\n- https://open.lbry.com/Memórias-Cubanas---Che-40-anos-depois:c\n\nErnesto Che Guevara é lembrado por Pombo e Urbano, dois rapazes protegidos do guerrilheiro que lutou no Congo e na Bolívia. Eles contam como sobreviveram depois de sua morte em outubro de 1967 em Las Higueras. Meninos naquela época, revelam que nunca foram abandonados por Che nos 11 anos e 7 meses que o acompanharam. São testemunhas oculares de uma história que os livros não contam.",
				"added": 1591973595
			},
			{
				"comment_id": 2,
				"body": "#Memórias Cubanas: Marcos, Estamos Aqui\n- https://open.lbry.com/Memórias-Cubanas--Marcos,-Estamos-Aqui:d\n\nEste documentário mostra a longa marcha por terras mexicanas dos membros do Exército Zapatista de Libertação Nacional em 2001. Seus ideais e sua luta são explicados pelo sub-comandante Marcos, líder do movimento ao jornalista Gianni Miná e ao escritor Manuel Vázquez Montalbán no encontro que aconteceu no Departamento de Antropologia da Universidade da Cidade do México. A experiência de um intelectual branco adotado pelo Maia de Chiapas foi o gatilho para este movimento pacifista ganhar popularidade no começo do terceiro milênio.",
				"added": 1591973642
			},
			{
				"comment_id": 3,
				"body": "#Salário, preço e lucro - Karl Marx\n- https://ipfs.infura.io/ipfs/QmXwEQGe9CzHiG9GETxdJD9kLeNhC7bQy8wswwwh7GoS62\n\nEsta é uma obra de disputa teórica no seio do movimento operário internacional, onde pela primeira vez Marx expõe os elementos essenciais para a construção da teoria da mais-valia. Foi escrita entre fins de maio e junho de 1865 para a reunião do Conselho Geral da Primeira Internacional, na qual buscava criticar as concepções equivocadas da corrente de delegados influenciados pelo socialismo utópico. O texto de Marx representou naquela reunião uma verdadeira demarcação de campo entre os revolucionários e os reformistas.",
				"added": 1591973775
			}
		]
	},
	"comment_vote": {}
}