{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1552714058,
			"title": "Coincidence or not?",
			"body": "The latest terror attack in Christchurch has similarities to other historical massacres.",
			"added": 1552714057
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1552714058_1Gh7gvCSCCgaNZbK5TN2RrSg1FACYuLQkY": [
			{
				"comment_id": 1,
				"body": "The Christchurch massacre shows similarities to the Port Arthur Massacre in the 90's. It happened at a time the government was trying to pass a new legislation quickly, the Australian gun laws. The kiwis are now doing the same as Australian did in the 90's with one exception. The Australian government is using this to enforce their original anti-encryption laws and trying to push two counter terrorism bills put to parliament on the the 6th of march using this current media circus to do the work for them. Did anyone notice the shooter was of south African decent.  Why is the shooter now staying quiet as did Martin Bryant?",
				"added": 1552714503
			},
			{
				"comment_id": 2,
				"body": "I am by no means condoning the shooters behavior, it was horrific. However less than 24hrs after the shooting the NZ prime minister announces they are digging graves for the victims today. I understand the delicate nature of the NZ government supporting the victims, but since when does a government rush a mass burial without thorough autopsies of each of the victims to support the case that they are taking to the court. They withhold information from the public to prevent the case being jeopardized yet lack the basic legal procedure to murder. A good criminal defense lawyer would have a field day in court.",
				"added": 1552715134
			},
			{
				"comment_id": 3,
				"body": "The media tell us the shooter, Brenton Harrison Tarrant is a far right wing extremest. These guys don't know how to shut up. They like to boast. 3 days of social media boasting should raise alarm bells. No white supremacist has ever been quiet about a victory to their cause in any court preceding. Tarrant demonstrates  weapons training that you don't get at a normal gun range. He has had training from law enforcement or military personnel.  I know the counter argument would be that he learned this stuff from a video game. The accuracy and natural reflex handling firearms shows otherwise. He has participated in defensive/offensive driving training and used easily accessible  firearms and ammunition that anyone could purchase over the counter. The markings on the weapons I believe are a setup. Targeting  muslim places of worship is easily believed by the public. Curious as to whether or not this guy gets a luxury \"prison sentence\" as did Martin Bryant.",
				"added": 1552716726
			},
			{
				"comment_id": 4,
				"body": "What is the point of hating a system and preaching the hate if you aren't going to do anything about it Kitty. Discussion is always the starting point for change.",
				"added": 1552720244
			},
			{
				"comment_id": 5,
				"body": "Uh so using encrypted p2p decentralized software so big brother does not see what you are doing is? Nobody takes anything seriously unless a nation state gets hacked now. Anonymous screwed us all by posting ufo conspiracies. Discussion encourages research which leads to such exposures as wikileaks CIA vault etc. Sounds like your a republican.",
				"added": 1552720928
			},
			{
				"comment_id": 6,
				"body": "UH duh!!!! thats what is being ramped up in Australia because of this.",
				"added": 1552721258
			},
			{
				"comment_id": 7,
				"body": "search proposed bills Australian parliament 6th march 2019.",
				"added": 1552721387
			}
		]
	},
	"comment_vote": {}
}