{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Не считаю пиратство воровством. Это навязываемый стереотип с целью получения выгоды. Можно считать это тоже в какой-то степени дополнением к рекламе. Мне не особо часто встречаются авторы, которые во введении просили бы не качать их произведения, и что они считают скачивание воровством. Если это указывалось бы лично автором, то я бы отказался от чтения или просмотра, скорее всего. Ворую ли я у автора, когда отказываюсь потреблять? Ведь в этом случае он недополучает даже больше, чем если бы я воспользовался пиратской копией. В последнем случае я участвую в распространении, почти что заменяю автору рекламу.\n\nА вот пометки издательств, о запрете на воспроизведении в любой форме для меня вообще ничего не значат. Они даже не гнушатся ставить их на произведения, давно перешедшие в общественное достояние. Зачастую авторы поставлены в такое положение, что им проще заключить контракт с издательством, потому-что аудитория этими издательствами давно прикормлена. \n\nБолее того, ассортимент официально издаваемого скуден. Дистрибьюторам зачем все ваши предпочтения. Им лишь бы продавать то, что продается в большем количестве копий. Тогда и процент автору наименьший идёт. И в отсутствии пиратства прогноз крайне негативный. \n\nИ что вы думаете, что от того что вы перестанете качать, авторы станут получать больше, а цены будут снижаться? Как бы не так. Скорее дистрибьюторы взвинтят цены, и наценка будет идти в их карман. А авторам и аудитории будет поставлены невыгодные условия. Да и пример в комментарии ниже, про рекламу в кинотеатрах показателен. \n\n",
			"post_id": 7,
			"date_added": 1457060083
		},
		{
			"comment_id": 2,
			"body": "> [kostanew](#comment_1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): А почему Steam мерзкий то? Ты привязан к аккаунту, заместо этого тебе дают простую систему установки, рекомендации, комьюнити...\n\nЧто не понравилось лично мне:\n1. Cлишком назойливая реклама. Мне постоянно предлагают игры, которые мне вовсе не интересны. И от этого не отписаться никак.\n2. Бесплатные игры там ни во что не ставят. Как сейчас помню, там нельзя отсортировать по ним, в них нет карточек, и при удалении локально они удаляются из библиотеки. Это уже не говоря о том, что там нет ничего для указания свободных лицензий. \n3. Клиент под линукс кривой. \n4. Пришел туда посмотреть, что там из жанра VN, но там крайне мало. По сути есть только одна студия что занимается переводом и публикацией там.\n",
			"post_id": 7,
			"date_added": 1457392480
		},
		{
			"comment_id": 3,
			"body": "> [igix](#comment_1_1Fwxj6dVq8BHxSL6EfEFmLEFRXARw9f97Z): Это же свободный ресурс?Я хочу сказать слово ХУЙ!\n\nСвобода, это возможность написать слово ХУЙ в чьём-нибудь блоге.",
			"post_id": 8,
			"date_added": 1457774429
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}