{"cert_user_id": "aaannndddyyy@github", "next_comment_id": 15, "comment": {"1604064781_mirrored_komachi_github": [{"comment_id": 1, "body": "+1\n", "added": 1445161927, "modified": 1445161927, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-149008653", "source_type": "github"}, {"comment_id": 2, "body": "any news on this?\n", "added": 1452712058, "modified": 1452712058, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-171452463", "source_type": "github"}, {"comment_id": 3, "body": "Thank you for your quick response.\n\nMaybe your first set of issues is something @str4d can help with.\n\nRe bundling i2p: i think that making the i2p transport optional and then require the user who wants to use it, to install i2p himself is ok. I don't think everything should be bundled.\n", "added": 1452714277, "modified": 1452714277, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-171461134", "source_type": "github"}, {"comment_id": 4, "body": "that will not scale in i2p.\nbecause i2p router must build those tunnels and rebuild them as they \nchange every few minutes for increased privacy.\nMaybe sorting them into different pools could be a viable solution?\nthough this would require much work. Who decides which pool a site would \nbe in? would have to be the user and would require one additional step \nfor him before seeing the site. So not really good.\n\nOTOH, vuze does not create a different destination for each torrent \neither.\nBut I perfectly understand the point of uncorrelating the sites.\n", "added": 1452763050, "modified": 1452885810, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-171629773", "source_type": "github"}, {"comment_id": 5, "body": "@str4d : ZN is running around 75 hidden services in my case. (To make sites served by same peer less linkable)\nIs i2p able to handle such an amount of different destinations, besides maybe other tunnels like i2psnark etc?\n", "added": 1465529184, "modified": 1465529565, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-225103457", "source_type": "github"}, {"comment_id": 6, "body": "On 2016-07-23 13:46, str4d wrote:\n\n> I'm doing the grunt work for this issue this weekend 😄\n> \n> ## \n> \n> That's great news. Thanks\n", "added": 1469449759, "modified": 1469449759, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-234988263", "source_type": "github"}, {"comment_id": 7, "body": "On 2016-07-23 10:25, str4d wrote:\n\n> @aaannndddyyy [1] in theory, yes it can. In practice, you'd want to\n> set up tunnel management such that each Destination only had one\n> tunnel unless it was being actively used and needed the additional\n> bandwidth. And of course you'd want to have your I2P router sharing a\n> lot of bandwidth, because even with every hidden service Destination\n> using only one tunnel, you'd be using a total of 225 hops by default\n> (for 3-hop tunnels), so you'd need to be sharing appropriately to\n> avoid Zeronet causing network congestion. (We had that problem\n> initially with Vuze, until they changed the default sharing percentage\n> of their internal I2P router to 80%. Now Vuze nodes contribute a\n> sizeable fraction of our routers.)\n\nI guess the reason why tor can do so without any proble is that for tor \nit makes almost no difference if you access 200 sites through one own \nhidden service (just like visiting 200 eepsites using your eepProxy) or \nyou access the same 200 sites through/from 200 different hiddenserver \naddresses. The per service overhead should be as small as possibly, so \nthat the overwhelming factor is only the actual data being transferred, \nwhich in both cases is the same.\nThen it would also not matter if you use a total of 6 hops or 300 or \n1200 hops (200 sites \\* 3 hops \\* 2 directions), because all the 1200 hops \nwould consume only little more than the 6 hops would do if the same \nsites were visited/served through them. Like if a user share X kB/s, it \nshould not matter if he routes two tunnels with X/2 kB/s each, or 100 \ntunnels with X/100, also amounting to exactly the same ressource usage.\nOnly floodfills would have more work.\n\nI have the impression, thugh, that i2p in that respect is much more \nressource hungry and needs significant traffic overhead per-tunnel. Is \nthe reason bhind that, that i2p is more decentralized than tor or that \ntunnels are more short-lived? Is there anything that could be done to \nreduce? - apart from tunnel management that reduces the per-dest tunnel \ncount to one, which would still be a huge amount if you are serving 200 \nsite only with zeronet and are still having other aplications use i2p \ntoo (torrent, …)\n", "added": 1469450873, "modified": 1469450873, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-234993922", "source_type": "github"}, {"comment_id": 8, "body": "Any progress here?\n", "added": 1475457982, "modified": 1475457982, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-251024506", "source_type": "github"}, {"comment_id": 9, "body": "Thank you for your work! \nHopefully, someone can fix i2p.socket\n", "added": 1476208137, "modified": 1476208137, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-253041420", "source_type": "github"}, {"comment_id": 10, "body": "Any news here? what's the status of this, now that i2p.socket was patched?", "added": 1488555365, "modified": 1488555365, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-284034056", "source_type": "github"}, {"comment_id": 11, "body": "In my experience this was an issue with i2p. It was some time ago, but it happened. Because of all the tunnel maintenance that has to take place. But only actual test will tell, if it is still the case. And if it is, the pooling @MuxZeroNet has talked about could be a way to mitigate that. Maybe the i2p side itself could also work on improving that, as it is a non-issue for tor.", "added": 1488973404, "modified": 1488973404, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-285058948", "source_type": "github"}, {"comment_id": 12, "body": "in tor it uses different circuits per site for inter-site unlinkability - which is a pretty neat feature.\r\n", "added": 1488974164, "modified": 1488974164, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-285062633", "source_type": "github"}, {"comment_id": 13, "body": "it makes sense, it just adds a lot of load. so instead of on a per-site basis, this could be done on a per-pool basis, joining the different sites into pools. This works fine on i2p and is a compromise between anon/privacy and performance. The churn come from i2p rebuilding tunnels every some minutes.", "added": 1488974419, "modified": 1488974560, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/45#issuecomment-285063871", "source_type": "github"}], "1604064818_mirrored_HelloZeroNet_github": [{"comment_id": 14, "body": "There are working DHT implementations for I2P (cf. Vuze's i2phelper plugin or i2p's i2psnark, i2p-bote also uses a dht)\n", "added": 1445162091, "modified": 1445162091, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/60#issuecomment-149008774", "source_type": "github"}]}}