{
	"title": "Homegrown's Experience",
	"description": "A Blog about anything, from videogames to linguistics.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1567176137,
	"post": [
		{
			"post_id": 5,
			"title": "The War of the Gripplis. \nIntroduction part I.(Reupload)",
			"date_published": 1567102587,
			"body": "### **It is known since the ancients’ time that in a place far away from us, both in time and space, lived and maybe still lives a people of small frogs, called Gripplis, a word which means people in their language. First Homer, next Phaedrus, told the world their stories, but they were romanced, maybe by needs or maybe by lack of knowledge, but I know the true tale of these people, small but mighty. Civilized and curious, I will tell you of the war between the West House and The South House, the civil war that divided the land for almost three years. This story begins in the time after the liberation from the Hobgoblin by Forstandro and before Ascoldo, the Skald Prince, was born.**\n\n**In his castle in Bactatropoli the young king Lurandro was ill, all the alchemist and cleric from the Swamp Empire were called to his court in an attempt to cure his dangerous disease. A Svirfnebrin Arcanist from west the Divider Chain, said the wise court’s skald that the illness was caused by a spell casted upon the king by some draconic enchanter. The skald counselor decided to make the army go into the swamp in the North March to hunt down every kobold and find the cause of the illness, the Marquis of North send a coalition of 350 Gripplis to aid the Royal Army, but they found no kobold capable of such a spell, so they asked the Elvish Kingdom to west for help. The Elfs sent 20 of their best detective to track down anyone capable of the enchantment in their kingdom, but it was a vain search.**\n\n**Desperate, the Court’s Skald, called alchemist and cleric and sage of every kind from all Erop and Aisia. Monks from Tiamt, cleric from The Capital, alchemist from the Han Empire, they all came to the court of the King of Bactatropoli. For month they investigated in search of the cause of the disease, for the Court’s Skalds put a prize of one hundred thousand platinum coins to everyone who could cure the Marquis of Bactatropoli, but none could figure what kind of spell or pestilence could the King have taken. As month passed the hope of recovery turned into desperation, in all the shrines and churches of the world known there were at least one hundred candles lighted for the Grippli’s King, and then the King ceased to move his legs and started coughing blood as red as the fire that burns deep into dwarven furnaces. His skin began solidificating like stone courasse and was green as the swamp. It became clear to every arcanist and skald in all Erop that such disease was terminal, that it was an hex casted upon the King by a powerful sorcerer, one of whom are banished and feared in every angle of the civilized world, except the Elven Kingdom. So Gripplis sent their aralds to talk to the King of Elfs and he, to avoid the war, gave thousands of sorcerers as prisoner to the Swamp Empire, but none had casted the hex, for they were of the wrong kind. They were the elfs and drows in who the High Elfs blood was more powerful, not those who have drunk dragon blood, or their fathers did.**\n\n**So the young King, who was only fourteen, an extremely young age even for gripplis, waited until his death and chose to not look for any cure anymore, for he realized it was all a pointless waste of time and money. He wrote a letter to be readen to whole kingdom and it cites as follows:**\n\n_**Proud people of the Swamp Empire,**_\n\n_**Gripplis, descendent of high linage, eldest race than men, hobbgoblin, dwarfs and duergar put all together, chosen people of the Swamp Archdrake. You who have never lost hope through the countless wars that afflicted us in the ages. I’m mortally ill and you know it already. Some of you, honorable people, have even considered a crusade against kobolds to find the cure to the hex that has been casted upon me, but do not forgot what makes us more than froggs and humans, do not forgot the kindness that our skald have taught through the centuries, do not let wrath makes you blind, instead chose the light of reason. Yes, we fought in past and we will probably fight in future, but we must not lose countless lives of our brothers and sons in a war that’s already lost. I will die even if we kill every kobold on Therraïn, for my days are counted by the fate of the One to whom none, even gods, cannot rebel. I will probably not see any other winter and never smell again the Drakeblood’s Fruit when they flourish, but still the end of a king does not mean the end of his people, king come and go like flies, but we, the Grippli People, will stay, even when there will be no homeland to come back. Do not forget the courage of our ancestor whomst discovered lands so far from home and risked their life in journeys that seemed suicidal to most race, we discovered Cafria, and we barely had ship to sail with. Either you’re earing this letter in a village near your fields where you work day and night, either in the square of a big city where you are contributing to culture and development of our own civilization, either in a castle where you’re defending our borders and streets from the bandits whomst tries to steal what we worked hard for, or, perhaps, you’re earing it in big hall at a nobleman castle, do not lose hope. Remember, even if I won’t see it, the sun will rise tomorrow again and bring a new bright future for you and your sons and daughters.**_\n\n_**I thanks and hail thee for the last time Grippli People,**_\n\n_**Your King,**_\n\n_**Lurandro of the Good People of Gripplis.**_\n\n**And so the skalds began a long search to find the rightful heir to the Swamp Empire. They searched and searched for weeks and months, until they found that King Forstandro IV, great grandfather of the King, had a first son, which was King’s grandfather, had two twins which were the grandfather of the Marquis of the South March Visondro and the Marquis of the West March Prudondro, so they came to the King for he had to chose who would be king, but, unfortunately, it was too late and, in the sixth day of the second of winter, the king never woke to see dawn. The seventh day of the second month of winter, Visondro came to the great castle of the King in Bactatropoli. He was marching riding his wonderful grey grippli hound and accompanied by 400 infantrymen armed with hallebardes and traditionals shields, which depicted the coat of arms of the South March, 200 archers armed with the long grippli composed bow and, at last, for his Psubargandro, the Marquis’s personal escort, 100 gripplis knights that had beautiful darkwood shields and elaborate obsidian khopesh, all wielding the grippli hallebarde. Each of the knights mounted a grippli hound and had a majestic cape all over their shoulders; the scale armor was their protection. Beside the men of war there were also 10 skalds accompanying the Marquis, those were sages of high regard in the Swamp Empire and their names were famous in all the realm. For Visondro had no living parents or siblings, he brought, as the tradition says, 5 chariots, each trained by two magnificent stegosaurus. The stegosaurus had beautiful azure, blue and white feathers all over their body, forming a wonderful fluff. Their plates were as red as the Drakeblood’s fruits. Each of the chariots brought a stone and bronze statue of the Swamp Archdragon. Along with these train there were tons of stegosaurus and workers that accompanied the Marquis, they served as they carried supplies for the main procession.**\n\n```\nNote: This is a reupload of the novel I was writing on Zeromedium. I had to reupload it since the zite seems to have been closed. If someone knows something about it, please tell me.\n```"
		},
		{
			"post_id": 4,
			"title": "How I met your mother in 2019 and the value of escapism",
			"date_published": 1567089992.217,
			"body": "Today I begun rewatching the cult classic sit com \"How I met your mother\" and in retrospective I must say that this is one hell of a sit com. It is true escapism, a purely fantastic story and a great show. I think that its most valuable feature is its plausibility and yet the complete void of politics and ideology. The characters acts as real people would and the story has no political or moral undertone, and if it has it's very lightly and well masked. Shows that don't impose a moral or political judgement on the plot or, like in Family Guy's Trump episode, on the viewer. The show teaches good life and love lessons, without the \"I'm holier than you\" attitude. It does so by simply showing how the behaviors of the character is rewarded or punished in different situations. I'm convinced that shows like Steven Universe, Star vs the Forces of Evil and even their great grandfather Adventure Time will be forgotten whereas How I met your mother will stand as a cult classic for all ages, this is because it has more universal morals than the mere \"Fuck Trump!\", \"Smash the Patriarchy!\", \"Collecting Male Tears\", which find moderate success now, but in 15 years will feel outdated, due to the society having been changed, as it normally does. I apologies to my two viewers if I didn't update the blog in six/seven months, but I had a lot of irl work to do."
		},
		{
			"post_id": 3,
			"title": "Donkey Kong Country on GBC",
			"date_published": 1546863961.245,
			"body": "Looking into strange rom sites who don't care about Nintendo's legal team I found something rather interesting, a Donkey Kong Country rom for the GBC(Game Boy Color). At first I thought it was a kind of hackrom of Donkey Kong Land, however I decided to try it. So I put my microsd card into my pc, put the rom in the roms' folder and turned on my Odroid GO. What I found was surprising, it was a full port of Donkey Kong Country for GBC with special features for the GB Printer, multi language interface and even a detailed option menu. The game was pretty much the same, as level design, of its snes counterpart, however, graphically, it was one the most surprising title for GBC. Indeed the graphics was all prerendered, as for the snes version, but downscaled to fit the GBC limited hardware. I have pretty much finished the game and I have still to find any difference between this version and the snes in level design."
		},
		{
			"post_id": 2,
			"title": "Hello World",
			"date_published": 1546460157.094,
			"body": "Hi everyone and welcome to my new blog, I do not know  what I'm talking about right now, therefore I shall introduce myself.\n\nI'm Homegrown and I'm a linguistic enthusiast and a videogame fan. My favorite game is Zelda II for the NES and I'm currently writing a novel that you can find on Zeromedium.\n\nThat's all for now folks."
		}
	]
}