{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 1,
				"body": "Recommend for normal use:\n1. Fedora\n2. Arch\n3. Debian\n\nBSD are cool but not really all that worth using for most people, anything that uses snaps is a no.\n\nIf your primary goal is learning, starting with Arch and going to Gentoo (selinux hardened) is a decent idea. Especially if you want to learn about MAC controls, how kernels decrypt encrypted root volumes, and maybe how to encrypt user folders.",
				"added": 1610353623
			}
		],
		"1610353747_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 2,
				"body": "Probably better off running it on a dedicated machine and using a vpn to connect, waiting for it to sync would not be great",
				"added": 1610354019
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 3,
				"body": "So after reading this thread I'm thinking these things:\n- people that want a vaccine should just take it, just like any other seasonal vaccine they already take\n- op's opinion on individual rights is extremely suspicions\n- I'll probably pass on this one just like any other seasonal vaccine that I already don't take cause I'm lazy and don't mind getting sick once in awhile, and yes I've taken all the vaccines that keep me from becoming crippled\n\nWhat kind of person would be cool with state mandating that people walk around wearing bubble wrap, because they are a potential physical risk to others and themselves? <- Women (nanny state)",
				"added": 1612085110
			}
		],
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "Good post, might also add that people should ask themselves if someone (gov't/etc.) is trying to fedpost/discredit a community or yourself by giving you disinformation (poisoning the well). Which is why maintaining a calm state is extremely important in making rational decisions/statements.",
				"added": 1612085406
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 5,
				"body": "it's not a white issue, because you have to deal with. the nigger riots isn't a black issue because everyone tolerates it. women ruining the country, the market, and the home isn't a woman issue because men encourage it. btw, func if the first thing that comes to mind when someone calls you nigger is muh dick, you've already lost but if not then congrats.",
				"added": 1612086151
			}
		],
		"1612091787_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 6,
				"body": "make a cheese sauce with it for mac and cheese, add spicy peppers and cooked bacon so that the only thing you taste is the peppers and bacon. profit?",
				"added": 1612122551
			}
		],
		"1612173389_1P99tURa4T43muCjSejqPrYHsi9km7g2X6": [
			{
				"comment_id": 7,
				"body": "china #1",
				"added": 1612233873
			},
			{
				"comment_id": 8,
				"body": "1 social credit has been deposited into your account",
				"added": 1612233992
			},
			{
				"comment_id": 9,
				"body": "1958 social credit has been deposited into your account a free tank has been added to your garage",
				"added": 1612247206
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 10,
				"body": "> [zenanon](#comment_117_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Also look up the CCR5-Delta32 mutation. It is more common in Whites who's ancestors went through the Black Plague. It can protect (partially) against that and also HIV (again, partially). One of the big reasons blacks may be hit harder by COVID is a result of fewer of them having that mutation.\n\nmore likely due to blacks being 3.5 times more likely to be diagnosed with diabetes (this assumes that they're more likely to have diabetes which I think is true, based on their likelihood of lower limb amputations and double death rate to diabetes)\n\nthis could also mean that they're more likely to be fat, etc.",
				"added": 1612423616
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "it's good to catalog these things and look back on them and see if they were significant, but for now it's the competing theory to the msm narrative. if enough guinea pigs croak to a vaccine and it doesn't work, the gov't will probably stop and either try something else or give up and call it the \"biden economy\".\n\nbtw we didn't shut down during polio (that shit paralyzes people) and that vaccine actually mattered, this one not so much..",
				"added": 1612425440
			}
		]
	},
	"comment_vote": {
		"73_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"86_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"108_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"12_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1
	}
}