{
	"next_post_id": 11,
	"next_comment_id": 3,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Arduino Nano",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "新 年",
	"post": [
		{
			"post_id": 1,
			"date_added": 1555316518,
			"body": "你好 ZeroMe!"
		},
		{
			"post_id": 1555328386,
			"body": "分离提取编辑\n目前，黄芪多糖的提取多采用水煮醇沉、醇碱、微波、超滤、纤维素酶等提取方法。\n醇除水提法\n①称取一定量黄芪饮片，先用大约是其6倍量的90%乙醇水浴回流提取3次，每次1h；将90%乙醇提取过的黄芪饮片挥去乙醇后，加大约是其5倍量的水，隔水加热提取3次，每次2h；合并水提液，处理，结果黄芪多糖的提取率为28.54%。②准确称取一定量蒙古黄芪，先用95%乙醇与药材以5：1的比例回流除去黄芪中黄芪总皂苷，提取2次，第1次3h，第2次1h；将药渣用水和黄芪药材以10：1的比例回流3h，过滤，处理，结果黄芪多糖提取率为 6.21%。由上可见，用相似的方法提取黄芪多糖，而提取率相差很大，这可能与所用乙醇的浓度和体积、加水量、提取时间和次数有关。\n碱醇提取法\n采用碱醇提取法提取黄芪多糖。准确称取一定量黄芪饮片，用5%乙醇与黄芪药材按10：1 的比例，在pH=12(碳酸钠调节)、温度为90℃的条件下提取2次，每次1.5h，过滤，合并滤液，浓缩沉糖。黄芪多糖的提取率为19.15%。该方法简便，并且成本低、时间短，条件温和，提取率较高，适合于大规模生产。\n碱水提取法\n采用Ca(OH)2溶液(pH 为9～10)煮沸提取黄芪多糖。提取液浓缩时调pH 为6.5 左右，浓缩得到黄芪多糖粗提物，其提取率为11.7%；而用 Na2CO3同法提取，黄芪多糖粗提物的提取率为5.17%。由上可见，Ca(OH)2 碱水法提取条件温和、简便、经济，提取率较高，适合于大生产。\n酶提取法\n①采用纤微素酶进行酶提法提取黄芪多糖，其用酶量为0.8%，酶解温度为75℃，酶解时问为2h，黄芪多糖提取率为9.78%。②采用纤微素酶量为0.4%使用前按1:10的比例，用40℃温水活化，煮沸的黄芪降温至(55±1)℃，用 0.5%2SO4调 pH<6.0，恒温1h，煎煮提取；同法提取2次，第1次加10倍量水，第2次加6倍量水，每次1h。所得黄芪多糖的提取率比水煎煮提取法增加了392.6%\n超声波提取法\n①采用超声波提取法。称取一定量黄芪茎粗粉，先用20倍量体积的80%乙醇在高频超声波下提取80min，过滤，黄芪药渣再加20倍量体积的水，方法和超声提取相同，水提取液经浓缩得黄芪多糖。结果黄芪多糖提取率为用20倍量体积的 70%乙醇、回流 2.5h的索氏提取法的5倍左右。②采用超声细胞粉碎仪提取黄芪多糖。首先用 80%乙醇回流提取3h进行黄芪药材的前处理，然后称取处理过的黄芪样品，加8倍量体积的蒸馏水，连接超声细胞粉碎仪，超声处理1h，过滤，滤渣再用6倍量体积的蒸馏水超声处理40min，过滤，合并滤液，浓缩。所得黄苠多糖含量为7.6%。而用传统的水煎法提取该黄芪样品所得黄芪多糖含量为 4.70%。\n温水提取法\n称取一定量黄芪根短杆或黄芪粉末，加入到5～8倍量提及的蒸馏水中，在62—68℃温度下，浸取1～3h，过滤，95%乙醇沉淀，分离提纯。得黄芪多糖提取率为8.2%。该方法简便、成本低、环保，适合于大生产。\n微波提取法\n将晾干的黄芪破碎，称量，放入连续微波反应器中，调整功率为560，500，400，350W，依次用2.5 倍量的石油醚(60～90℃)、乙醚、80%乙醇，回流20min，除去杂质；药渣用水在功率630，600，560，450W 条件下同法回流提取黄芪多糖，所得黄芪多糖提取率为6.55%。\n水回流提取法\n采用水回流提取法提取黄芪多糖。称取黄芪粉末(0.533mm)，用10倍量水，回流1h，离心；药渣再用8倍量水，回流40min，离心；合并提取液，浓缩、醇沉，得黄芪粗多糖。再经除杂质等处理，得淡黄色黄芪多糖。\n传统水煎煮法\n传统水提取法即直接水煎煮法。一般是用8一12倍量体积的水，煎煮2～3次，每次1～2h，过滤，合并滤液，经浓缩、醇沉或分离等处理得黄芪多糖。该法简便易行，但提取黄芪多糖的含量较低，适合家庭使用。",
			"date_added": 1555328384
		},
		{
			"post_id": 1555328664,
			"body": "方药组成:针砂,皂矾(服用过多会中毒致死,1日最多3次,每次0.3克,与红糖同用),茵陈,黑白丑(每次0.3~1g) , 槟榔(致癌) , 陈皮,六神曲,山楂,鸡内金,肉桂(含致癌物,不宜长期服用),桂枝,桔梗.打粉每次一勺10g，一天2次。\n\n此方是安徽黄山的一名姓杨的退休工人(男,现年79岁)祖传治疗肝炎、肝腹水验方,其外祖父卢少华，享年88岁，系安徽省庐江县人,祖籍世代业医，本人是当时庐江县知名中医，尤以祖传专治肝病见长，晚年悬壶乡里，因医德崇尚，医技精湛,深得居地方园数百里民众准崇.杨自幼耳闻目染，秉承家训，得此传方,自五十年代移居太平县(现黄山区)后，用此传方在民间治愈肝病患者达千人之余，方药疗法独特鲜为人知，据笔者考证，中国医史书尚未见记载，确属祖传中医经验秘方。 \n方药组成:针砂,皂矾,茵陈,黑白丑,槟榔,陈皮,六神曲,山楂,鸡内金,肉桂,桂枝,桔梗. （“ 我只是老人家的方子公布出來，而且具體用量，我也不得而知，也只是隨證加減”，此句是原创人回答，有关此方剂量问题时的原话 针砂60皂矾60 茵陈20黑丑 20 槟榔10陈皮10神曲10 山楂10 鸡内金10 肉桂3 桂枝6 桔梗6 制备方法 上药按剂量调配,皂矶生用，肉桂干燥．茵陈、陈皮、桔梗、桂枝等晒干，针砂、鸡内金、山楂、神曲同炒黄，二丑盐水炒制，上十二昧中药同研细粉，过100目筛，另加红糖适量拌匀，装入容器内干燥贮存备用. 服用方法每服药粉一汤匙(约l0克左右)，早、晚各服一次 服药宜忌及注意事项 严禁饮酒及服食晕腥，辛辣物品(包括公鸡、鸡蛋、鲤鱼等)，严禁房事。服药期间大便变黑色属正常现象，停药即恢复正常；少数患者开始服药时有呕吐、烦燥表现，可改为先小剂量服用，逐渐加大到正常剂量。 功效用途 祛湿热，退黄疸，解毒活血祛瘀，消肿利水。主要用于治疗甲、乙型肝炎(急、慢性)，肝脾肿大并早期肝腹水。 治疗效果 急性肝炎(甲肝)需服药30～40天左右；慢性肝炎(乙肝)需服用药2～4个月；早期肝腹水需服药l～2个月左右,临床治愈率达95%以上，随访5年以上均未复发。中、晚肝脾肿大并腹水常期服用有软缩痞块，消退腹水作用，可减轻或延缓病情恶化，近期疗效明显；肝癌患者服用镇痛效果明显.近期有抑制癌细胞扩散或延缓死亡时间作用。重复服用有效，无毒付反应. 中药针砂，化学成分主要为铁、药理作用为补血、利尿。因其味酸，性平，归脾胃二经，具清热利湿之功。故能清脏腑之湿热，使脾胃功能调达，胆循常规。辛味能行能散，清热祛湿，下气消滞，祛瘀散结因其功燥湿利水，用之可去湿浊、利水，而消浮肿。<<本草纲目>>曰清积聚，肿满、黄疸。” 皂矾一药一又名青矾、绿矾、皂荚矾，为硫酸盐类矿物水绿矶的矿石或化学合成品(含琉酸亚铁的矿石)，性味酸涩，凉，人肺、肝、脾，大肠四经，具燥湿化痰利水之功，用治黄肿胀满，疟利，水肿黄疸等疾.《本草纲目》消积滞，燥脾湿，化痰诞，除胀满黄肿疟利”《医学正传》记载其与针砂一神曲、五倍子配伍为细未，生姜汁煮枣为丸用治黄肿病。 因针砂、皂矾二药同具退黄消肿利水之殊功，用量独大，列全方它药之首，故应为此方之主药. 茵陈味苦而凉，其气清芬，功专清热退黄，为黄疸证之主药。 牵牛子苦辛、寒，人肾经，走水道，既能泻水，又有利尿，使水湿从二便排除，功效泻水消肿，虽为峻下之品，但药用剂量恰到好处，炮制人药，用治臌胀，形气实虚之虑， 槟榔辛行温通，沉重主降，能散邪所，调中化痰，通消滞胀，攻逐水湿，为消积、行气、利水之要药，诸药相合不失为行气消胀退黄利水通二便辅佐之品 肉桂，桂枝同生于桂树，一为纣皮，一为嫩柱，二者皆有温营血，助气化，散寒凝的作用，但肉桂长于温里止痛，人下焦而补肾阳，归命火；桂枝长于发表散寒，振奋气血，主上行而助阳化气，温通经脉，妙在人药剂量耩当．虽属辛温太热之品，然其功在化气通经t温阳利水而无燥血助瘀之过。 神曲甘温，健脾和胃，消积寻滞。 山楂能人血分，善消肉积痛块，并能行气活血鸡内金消食开胃、健脾消滞。陈皮具健脾理气，燥湿化痰之功，又能宣肺行水，通阳化水，化气行水治疗水肿。 桔梗辛开，宣扬肺气。以上七味中药相伍，下焦温化，中焦复运，上焦宣通，三焦通达，则津液得下，痰滞得通，瘀热可清，黄疸易退，水肿可消，诸药同为佐使，甚为合拍，此所谓祛邪不忘扶正，正足邪自祛”也。 另加用红糖适量拌药粉服用，一则可避免药粉刺激咽喉，二则可骄味骄臭. 方药针对病因，切中病机，立意精确，配伍协调，主次分明，剂量精当微妙，祛邪扶正，攻补兼施，退黄重在清热祛湿解毒，消肿功在活血祛瘀利水，七情和合为散，相得益彰，又具容易分散和奏效迅速的特点，终达退黄消肿以治病之目的。\n\n\n服药宜忌及注意事项\n\n严禁饮酒及服食晕腥，辛辣物品(包括公鸡、鸡蛋、鲤鱼等)，严禁房事。服药期间大便变黑色属正常现象，停药即恢复正常；少数患者开始服药时有呕吐、烦燥表现，可改为先小剂量服用，逐渐加大到正常剂量。\n\n功效用途\n\n祛湿热，退黄疽，解毒活血祛瘀，消肿利水。主要用于治疗甲、乙型肝炎(急、慢性)，肝脾肿大并早期肝腹水。\n\n治疗效果\n\n急性肝炎(甲肝)需服药30～40天左右；慢性肝炎(乙肝)需服用药2～4个月；早期肝腹水需服药l～2个月左右,临床治愈率达95%以上，随访5年以上均未复发。中、晚肝脾肿大并腹水常期服用有软缩痞块，消退腹水作用，可减轻或延缓病情恶化，近期疗效明显；肝癌患者服用镇痛效果明显.近期有抑制癌细胞扩散或延缓死亡时间作用。重复服用有效，无毒付反应.",
			"date_added": 1555328661
		},
		{
			"post_id": 1555377948,
			"body": "原来arduino nano还可以控制电压高低鸭.",
			"date_added": 1555377944
		},
		{
			"post_id": 1555383642,
			"body": "Proxifier\n全局代理,",
			"date_added": 1555383637
		},
		{
			"post_id": 1555388555,
			"body": "人再高级,也得吃饭.拉屎 etc.",
			"date_added": 1555388549
		},
		{
			"post_id": 1555388843,
			"body": "书早就给出结论，一切文明都建立于物质基础之上，粮草先行，没有物质基础作保证，你行动个锤头鸭。\n\n吃老本儿，是有限度地。\n疯狂开采地球一次性资源，等用完了，你真以为你能去火星开采？\n复活节岛会向你招手。断子绝孙就是你们的美好未来。\n\n弄不好，地球空了，系统架构被破坏，引力都没有了，地球解体就完事儿了。\n\n现在人类在破坏地球系统架构的内核代码。危险的狠内~\n\n你就一台主机，连个重起系统U盘都没有，玩坏了，就没得玩喽。\n\n你这么高级了，聪明了，高科技了，你先把撒哈拉种满大树，变成亚马逊，你连地球生态都解决不了，你还想去火星种树人造生态。你真逗逼鸭。\n\n连自己姓字名谁都搞不清，还天天想替别人取名字。\n\n蛋子儿是不是都扯没了？哈哈-,-\n\n就算你能改造撒哈拉了，你也不证明就能改造火星。科学不是胡编，更不能胡说。严谨符合客观事实。否则就得认罪。开花就完了。-,-\n\n就像你养你家孩子，你要天天胡扯跟你孩子，你孩子长大准是个外瓜裂枣。英年早逝。-,-",
			"date_added": 1555388836
		},
		{
			"post_id": 1555466035,
			"body": "现在微sd卡都达到512G了, 一块硬盘大小的体积,可以装下1024T容量了.比硬盘还牛.\n看看我这不停旋转的笔记本硬盘超大,才只有几百G.\n像这种情况,都可以把硬盘拆了,直接买个sd卡,代替硬盘,算了.\n当然,可以把sd卡接usb转换器上,当u盘启动系统,都支持了.\n就是太贵.",
			"date_added": 1555466026
		},
		{
			"post_id": 1555502028,
			"body": "其实，zeronet就是个代理服务器程序，不过，走的是bt下载的节点服务器罢了。\n也就是说zeronet利用了节点服务器做免费服务器，给自己的软体用。\n所以说，这并不是一个脱离服务器的软体。\n只是一个利用公共服务器的软体。\n也就是说，任何人都可以利用公共服务器，写一个网络软体，比如聊天软体，加密就可以了。\n应该是这意思吧。瞎猜。",
			"date_added": 1555502018
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Thanknofish: 不知道啊,好像不支持, 你的名字让我想起一句话, thanksgiving,你是把nofish当成上帝了吗.哈哈. Your name let me remind of some thing word that 'thanksgiving', looks like nofish is god.",
			"post_uri": "1LzKsWbLzLT9PechimkiGGhZmwWQPyX9q1_1555383642",
			"date_added": 1555383823
		},
		{
			"comment_id": 2,
			"body": "@猫叉酱（小号）: 树莓派系统都在tf卡上，还行吧。速度。没觉得慢也。我就过过嘴瘾，家里没矿，无法实现行动。",
			"post_uri": "1LzKsWbLzLT9PechimkiGGhZmwWQPyX9q1_1555466035",
			"date_added": 1555501015
		}
	],
	"follow": []
}