{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [],
		"1567166183_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_915_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Investigating the pastebin code. [...]\n\nIt worked for me with a random value. I actually thought it was the other way around, that different browsers would have a different width, and the problematic browser's specific width would be blocked.\n\n> [gitcenter](#comment_916_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This is wrong too. The code can now contain Math.pow, and it was afterwards replaced with DOM manipulation. [...]\n\nWell, it's wrong now, it wasn't wrong before! There were a few other bugs, but it's not like it matters now that it actually requires booting a web browser to get the IDs. Registering with Tor is still broken for me even when just doing it using Tor Browser btw.\n\n>so he has probably registered fewer accounts\nYeah, I just registered a few per day.",
				"added": 1567363924
			},
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_920_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Nice to meet a new uh, scriptkiddie!\nThat's funny. I thought the reason you might've said that was because of my posts. But if you hadn't seen the ZeroID script then I guess you assumed 8chan had script kiddies just because.\n>Now that's interesting, because my (later) attempts to register with an old width were broken.\nMaybe before your spam wave there was no check or the check was disabled.\n>That's weird.\nYou said it yourself, the work tasks before were simple multiplications.\n>Greet my 221 IDs :)\nI didn't attempt to make as many IDs as possible. I only made them as I needed them, which basically was every couple of posts.",
				"added": 1567366175
			}
		],
		"1567454449_13VoN9gGPqenYYp56NTtHdbZuAokan3fv3": [
			{
				"comment_id": 4,
				"body": "> [gitcenter](#comment_938_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): It looks like either someone is still spamming ZeroID (that's not me), or it's just that nofish changed limits a lot.\n\nYeah, it would be great if he could clarify what's happening.",
				"added": 1567500170
			}
		]
	},
	"comment_vote": {}
}