{
	"next_comment_id": 39,
	"comment": [
		{
			"comment_id": 2,
			"body": "> [ktotut](#comment_1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8): А через GUI этот список никак не заливается?\n\nК сожалению, нет. Через ключи запуска можно много что настроить, например, изменить стартовую страницу сети на другой сайт. Но ничего этого в GUI не вынесено.",
			"post_id": 5,
			"date_added": 1518530369
		},
		{
			"comment_id": 3,
			"body": "> [nulc](#comment_1_19xkVTXjXQR92UG2TyqtXnRRnGjHuKCbpX): Чем плоха IPFS на практике?\n\nКак многие пишут, в текущей реализации жрёт много ресурсов.",
			"post_id": 8,
			"date_added": 1518870637
		},
		{
			"comment_id": 4,
			"body": "> [zalex](#comment_1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): ...\n\nLinux я обязательно хочу погонять на этом девайсе, на днях как буду посвободнее, попытаюсь это сделать. Накопитель тут eMMC, работает, как я понял, черед интеловский штатный SD-контроллер в составе SoC, через него же подключен и модуль WiFi. Наверное, проблем с этими контроллерами быть не должно, посмотрим. Есть некоторые опасения, что может не подхватиться тачпад, он как-то странно опознаётся виндой, так что хз, опознается ли линуксом.\n\nBIOS тут очень неурезанный. Чёртова уйма настроек, в том числе, кажется, и таких, которые запросто могут окирпичить устройство. Многие я лишь очень приблизительно понимаю, что означают. Но никаких следов поддержки legacy загрузчика, тольку UEFI. Secure Boot не залочен. На первый взгляд, ничего не мешает загрузить Linux, посмотрим, как это получится.",
			"post_id": 17,
			"date_added": 1519578822
		},
		{
			"comment_id": 5,
			"body": "> [trooper](#comment_1_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe): мне вот интересно зачем вы его использовали?несколько юзеров с одной ноды звучить неплохоно несколько нод, не могу понять..\n\nЯ использую в основном для экспериментов, но применения можно найти самые разные. Например, использование нескольких аккаунтов так намного удобнее — одну цифру в номере порта сменил в адресной строке, и вот ты уже в сети как другой ID. Или для повышения безопасности и анонимности: поднял временную ноду с хранилищем в tmpfs, поработал в ней, удалил.",
			"post_id": 15,
			"date_added": 1522456731
		},
		{
			"comment_id": 6,
			"body": "> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): [...]\n\nА что там жрет ресурсы, DHT? Я вот думаю, IPFS не особо популярен, но всё-таки используется много кем. Если уже сейчас DHT не масштабируется, что будет дальше? И когда в ZN впилят DHT, не возникнет той же проблемы?",
			"post_id": 19,
			"date_added": 1522564097
		},
		{
			"comment_id": 7,
			"body": "> [dude](#comment_1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Это все так, пока не создали механизм очистки :)\n\nЗачем его создавать?",
			"post_id": 20,
			"date_added": 1522651086
		},
		{
			"comment_id": 8,
			"body": "> [dude](#comment_2_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Диск не резиновый. Канал в инет - тоже.\n\nПока что несколько сотен зайтов занимают места намного меньше, чем один фильм, расшаренный в торрентах. :)",
			"post_id": 20,
			"date_added": 1522653316
		},
		{
			"comment_id": 9,
			"body": "> [dude](#comment_3_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): [...]\n\nНу, giftime я, хоть с автоочисткой, хоть без, вряд ли буду у себя хостить, а вот блоги — запросто. Тут получается такой баланс, где с одной стороны заинтересованность, а с другой — нехватка места в компе, и в этом мы фактически возвращаемся во времена до распространения широкополосного интернета. Как у меня разные книги, HOWTO, FAQ лежат с 90-х, так и блоги могут лежать — потому что их проще хранить, чем удалять. («А вдруг пригодится!») Места занимают копейки.\n\nВидеоблогерам придётся что-то придумывать, да. Мало хранить сайт у себя, надо еще обеспечивать его хорошую доступность во всем мире. Может, появятся специализированные хранилища, как сейчас есть у хостинг-провайдеров. С помесячной оплатой за использованные гигабайты.",
			"post_id": 20,
			"date_added": 1522654570
		},
		{
			"comment_id": 10,
			"body": "> [balancer73](#comment_5_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Если без urlencode, то всё становится лучше.\n\nЕще лучше оформить ссылкой осмысленный текст. ;)",
			"post_id": 23,
			"date_added": 1525158197
		},
		{
			"comment_id": 11,
			"body": "> [deepstrelok](#comment_2_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): read more\n\nЭто стандартная фича. Вот так:\n\n```\nТекст...\n\n* * *\n\nБольше текста.\n```\n",
			"post_id": 23,
			"date_added": 1525158358
		},
		{
			"comment_id": 12,
			"body": "> [deepstrelok](#comment_3_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): Очень длинный пост вышел. В блогах разве нельзя как-то скрыть часть информации под hide?\n\nВроде, нет. В принципе, можно реализовать spoiler на CSS и вставить html-теги в код поста. Но тут конвертёр кривой, и портит HTML-разметку внутри markdown. ([Например.](http://127.0.0.1:43110/1ysjnZzsz5YYXhTNBxELnY4ftz42QupMg/?Post:5)) Лень проверять, сохранит ли он div-ы или span-ы.",
			"post_id": 25,
			"date_added": 1525254884
		},
		{
			"comment_id": 13,
			"body": "> [zeroout](#comment_1_1CF4nUiqsa2mxwzjnW98vGfi8n55Lz1VtQ): Извините, может быть что то не понял, но страница по ссылке пуста.\n\nМогут быть разные причины:\n\n* Репозиторий 1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG не скачался полностью. (Процесс скачивания можно увидеть на главной странице [ZeroHello](http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/) в левой панели.)\n* Git Center не скачался полностью. (Аналогично.)\n* Вы не дали Git Center-у всех прав, которые он просил (уведомления в верхнем правом углу).\n",
			"post_id": 26,
			"date_added": 1525400278
		},
		{
			"comment_id": 14,
			"body": "Вообще это так работает:\n\n* По адресу http://127.0.0.1:43110/1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG лежит репозиторий + редирект на Git Center.\n* Когда сайт прогружается, он делает редирект на Git Center и открывает сам себя через него.\n* Git Center прогружается и спрашивает у пользователя разрешение на доступ к данным.\n* Пользователь даёт разрешения, Git Center отображает комбинированный интерфейс с использованием двух сайтов.",
			"post_id": 26,
			"date_added": 1525400510
		},
		{
			"comment_id": 15,
			"body": "> [gitcenter](#comment_1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Опечатка: 43110, а не 43111\n\nАга, уже.\nДа блин. Надо скрипт что ли прикрутить, который за мной ошибки в номере порта будет исправлять. >_< У меня 4 ноды запущено так.",
			"post_id": 27,
			"date_added": 1525617211
		},
		{
			"comment_id": 16,
			"body": "> [gitcenter](#comment_2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Типа :43110, :43111, :43112, :43113?\n\nДа.",
			"post_id": 27,
			"date_added": 1525617251
		},
		{
			"comment_id": 17,
			"body": "> [gitcenter](#comment_4_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Блог глючит (который 19fZJhX7FGENeRRLB8ftgrziBJ5vsLtFog). Выдает File write error: [object Object].\n\nСтранно, ничего, касающегося записи данных, я пока не трогал. Как бы мне это воспроизвести.",
			"post_id": 27,
			"date_added": 1525617558
		},
		{
			"comment_id": 18,
			"body": "> [gitcenter](#comment_5_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Я в комменты писал.\n\nПопробовал на чистой ноде, не воспроизводится.\nПопробуй грохнуть сайт и заново перекачать. Кроме варианта, что заглючила схема базы данных, пока нет идеи. ",
			"post_id": 27,
			"date_added": 1525617859
		},
		{
			"comment_id": 19,
			"body": "> [gitcenter](#comment_6_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): \n\nКстати, то, что на вкладке *My Repos*, у меня пустота — \nhttps://gateway.ipfs.io/ipfs/QmaarpK6zT4T4FZzgX2kPV9AGDQDrzWgegFFGgTrG976G5 — это так и должно быть, или я что-то делаю не так?\n\n",
			"post_id": 27,
			"date_added": 1525619340
		},
		{
			"comment_id": 20,
			"body": "> [gitcenter](#comment_7_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): My Repos - это те репозитории, которые Вы сами создали.\n\n[Репозиторий](http://127.0.0.1:43110/1FEvdSRAqTEuGpc31s9ad7rPc4jqRpeWfG), созданный кнопкой «New repository», таким считается?",
			"post_id": 27,
			"date_added": 1525622512
		},
		{
			"comment_id": 21,
			"body": "> [gitcenter](#comment_8_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Да, считается. Вроде.\n\nПосмотрел [код](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?18r929Hq8hE5Pi9Zf7ovMQVyn3WcGfxMgu/main/dist/myrepos/js/main.js@master).\n\n```javascript\nzeroPage.cmd(\"mergerSiteList\", [true])\n\t.then(repos => {\n\t\trepos = Object.keys(repos)\n\t\t\t.filter(repo => typeof repos[repo].privatekey != \"undefined\");\n```\n\nВыбираются все репозитории, для которых указан privatekey? Это поле вообще когда-либо бывает чем-то заполнено?\n\nТем более для, зайтов, созданных клонированием, приватный ключ в явном виде нигде не фигурирует, он движком ZN формируется из публичного address_index и приватного master_seed.\n\n",
			"post_id": 27,
			"date_added": 1525624275
		},
		{
			"comment_id": 22,
			"body": "> [gitcenter](#comment_9_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): privatekey != undefined означает, что стоит галка \"Мой сайт\"/\"This is my site\".\n\nА, так это boolean. Жесть, API зеронета интуитивно непонятное.\nТеперь понятно, я не из-под той ноды смотрю эту страницу. Исходно я думал, что на самом сайте хранится соответствие ID пользователя и репы, а оно всё намного проще. :)",
			"post_id": 27,
			"date_added": 1525624582
		},
		{
			"comment_id": 23,
			"body": "> [x86128](#comment_1_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): А вот интересно, получается так, что если обновится мэйнстримовая версия блога/чата (любого другого компонента ZeroNet) и т.д. то это надо ручками все свои блоги патчить?\n\n**Upgrade code** в меню сайта на главной ZeroHello.",
			"post_id": 28,
			"date_added": 1525706281
		},
		{
			"comment_id": 24,
			"body": "> [calmaquesse](#comment_2_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Пишите багрепорт Nofish\n\nЛень.\n\nДа и что его дёргать, у него всё время на движок ZN уходит.",
			"post_id": 28,
			"date_added": 1525706375
		},
		{
			"comment_id": 25,
			"body": "> [calmaquesse](#comment_3_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Вы это хотите самостоятельно пофиксить и залить в репозиторий?\n\nВ свой.",
			"post_id": 28,
			"date_added": 1525706556
		},
		{
			"comment_id": 26,
			"body": "> [calmaquesse](#comment_4_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Но проблема же на уровне движка самого Зеронета. Значит, надо делать коммит прямо туда, или я ошибаюсь?\n\nНа уровне движка блога.\n\nКстати, было бы неплохо ввести identicon + что-то типа humanhash или tripcodes на уровне движка сети для человеко-читабельной идентификации криптографичеких идентификаторов. Но пока сильной необходимости в этом нет.",
			"post_id": 28,
			"date_added": 1525707134
		},
		{
			"comment_id": 27,
			"body": "> [zalex](#comment_2_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Ого, о моих заброшенных сайтах не только кто-то ещё помнит, а они таки ещё приносят кому-то пользу. Надо же! :)\n\nСтрока поиска на ZeroHello помнит всё. :)",
			"post_id": 34,
			"date_added": 1526029179
		},
		{
			"comment_id": 28,
			"body": "> [zalex](#comment_3_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS)\n\nЭто наверное последствия вручную проставленной `>` для цитирования.\n\nВроде исправил.",
			"post_id": 34,
			"date_added": 1526030449
		},
		{
			"comment_id": 29,
			"body": "> [blurhy](#comment_1_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): What will it be if i do this with 3000 zites.\n\nThat will be interesting :)\n\n",
			"post_id": 43,
			"date_added": 1536052818
		},
		{
			"comment_id": 30,
			"body": "> [balancer73](#comment_7_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): https://github.com/Balancer/benchmarks-fib-obj/wiki/Результат-теста:-i3-2.2ГГц\n\n> **Компьютер: ноутбук Samsung 300E7A**\n\nОоо! Вещь! :)",
			"post_id": 44,
			"date_added": 1539441558
		},
		{
			"comment_id": 31,
			"body": "> [balancer73](#comment_7_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw):  Большинство синтетических тестов различных языков, их реализаций и сред исполнения ориентируются на «числодробительные» возможности. В то время, как сегодня, при программировании широкого спектра задач, чаще требуется высокая скорость работы с объектами и быстрое выделение и освобождение памяти.\n\nИнтересный подход. Я гонял тесты как раз числодробилок + вызов-возврат из функций. Поскольку трассировщик LuaJIT работает через границы функций (насколько я это понимаю), ему такой код оптимизировать плёвое дело.\n\nНадо будет с объектами поэкспериментировать.",
			"post_id": 44,
			"date_added": 1539442001
		},
		{
			"comment_id": 32,
			"body": "> [balancer73](#comment_8_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw):\n\nУ моего на рамке идет сквозная трещина от левой петли вверх до экрана. Сама петля тоже не в порядке, люфтит. Всё жду, когда развалится, но пока тьфу-тьфу... USB-порты и разъем питания разболтались, но пока держатся. Буквально на днях сдохла ЛКМ тачпада, вот это самое обидное.",
			"post_id": 44,
			"date_added": 1539447549
		},
		{
			"comment_id": 33,
			"body": "> [balancer73](#comment_7_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n\nПро два порядка я прогнал.\n\nПосмотрел старые результаты для числодробилки.\n\n`gcc -O0` vs `luajit` — разница менее чем в 2 раза.\n\n`gcc -O0` vs `pypy` — разница в 5-10 раз. Но памяти на простых программах он жрет в 10 раз больше простого питона.\n\n`gcc -O0` vs `python[23]` — разница в 50 раз. ",
			"post_id": 44,
			"date_added": 1539449444
		},
		{
			"comment_id": 34,
			"body": "> [balancer73](#comment_7_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n\n```lua\nFib = {}\nFib.__index = Fib\n\nfunction Fib:new(n)\n    local f = {}\n    setmetatable(f,Fib)\n    f.n = n\n    return f\nend\n\nfunction Fib:value()\n    if self.n <= 2 then\n        return 1\n    end\n    return Fib:new(self.n - 1):value() + Fib:new(self.n - 2):value()\nend\n\nprint(Fib:new(34):value());\n```\n\n```python\nclass Fib:\n    def __init__(self, n):\n        self.n = n\n\n    def value(self):\n        if(self.n <= 2):\n            return 1\n\n        f1 = Fib(self.n - 1)\n        f2 = Fib(self.n - 2)\n\n        return f1.value() + f2.value()\n\nprint (Fib(34).value())\n```\n\nНа объектном алгоритме pypy обходит luajit:\n\n```\n=> gcc-O0          fib-obj             0.55 s,    1904 KB,   2138555203 Refs\n=> gcc-O2          fib-obj             0.45 s,    1904 KB,   1967468608 Refs\n=> luajit          fib-obj             3.48 s,    2544 KB,  12255245901 Refs\n=> pypy            fib-obj             1.14 s,   74992 KB,   2045327223 Refs\n=> python2         fib-obj            12.47 s,    6952 KB,  41252628352 Refs\n=> python3         fib-obj            13.37 s,    8008 KB,  47365407786 Refs\n=> tcc             fib-obj             0.55 s,    1896 KB,   2144279192 Refs\n```\n\nИнтересно. По числу ref-ов видно, что luajit не смог оптимизировать код с объектами до уровня Си. А pypy — смог. Что-то я в сомнениях по этим числам. Если pypy выполнил даже меньше инструкций CPU, чем профиль gcc-O0, как он мог так сильно отстать от сишного кода.\n\nВот тест, где было наоборот, luajit оптимизировался, а pypy — нет:\n\n```\n=> gcc-O0          fib                 0.08 s,    1488 KB,    194099889 Refs\n=> gcc-O2          fib                 0.02 s,    1488 KB,     71132501 Refs\n=> luajit          fib                 0.11 s,    2164 KB,    379322913 Refs\n=> pypy            fib                 0.63 s,   62508 KB,   1375890604 Refs\n```\n\nНо результаты это еще с каким-то старым pypy. Надо будет повторить на новой версии.",
			"post_id": 44,
			"date_added": 1539451624
		},
		{
			"comment_id": 35,
			"body": "> [hugeping](#comment_1_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): Не могу молчать.  :) Lua прекрасен! Спорить не буду, ибо если ты не видишь его красоты, что тут можно доказывать? :) Красота, простота, скорость... Это всё про Lua.\n\nПрекрасен-то он прекрасен, но одна единственная вещь его портит, примерно как ложка дерьма в бочке мёда.\n\nЭто всё равно что выпустить дорогой, красивый, быстрый, нафаршированный опциями автомобиль, но поменять в нём газ и тормоз местами.\n\n> [hugeping](#comment_2_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): Хотя у меня тоже есть предубеждения. Одно из них, это принудительное форматирование (как в python). И табы в виде spaces.Мое твёрдое убеждение - табы должны быть табами (код 8), а форматирование не должно быть частью языка. Правда, в итоге я все-таки заценил питон и го и даже пользовался ими :)\n\nТабы удобны в идеальном мире, где все пользуются табами и делают это правильно. А в реальном по-всякому бывает. Но в целом согласен.",
			"post_id": 44,
			"date_added": 1540276105
		},
		{
			"comment_id": 36,
			"body": "> [moor](#comment_1_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): could you elaborate? i'm curious.\n\nThe key-based addressing is pure math. As long as the private key is kept in secret and quantum computers don't crack the elliptic-curve cryptography, one can trust the address. Nobody knows how much time will pass before that kind of cryptography become unreliable, maybe some years or maybe some centuries, but it's the only point of failure.\n\nOn the other hand, Namecoin domains are temporary by their nature. If you don't renew it, you lose it. And since we all will die someday, you for sure don't renew it.\n\nNamecoin is also vulnerable to the 51% attack.\n\nAnd Namecoin can become completely unpopular someday, so all the domains just disappear then.",
			"post_id": 46,
			"date_added": 1548592110
		},
		{
			"comment_id": 37,
			"body": "> [quirrel](#comment_2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): BTW, if this kind of cryptography become unreliable, Zeronet would be one of the least problems.\n\nHahah, yeah!",
			"post_id": 46,
			"date_added": 1548641715
		},
		{
			"comment_id": 38,
			"body": "> [dimka511](#comment_1_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH): А как поднять лимит ?\n\nЧерез опцию командной строки:\n\n```\nAnnounceShare plugin:\n  --working_shared_trackers_limit limit\n                        Stop discovering new shared trackers after this number\n                        of shared trackers reached (default: 5)\n```\n",
			"post_id": 48,
			"date_added": 1584585628
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {}
}