{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Testes 1 2",
				"added": 1565121038
			},
			{
				"comment_id": 2,
				"body": "> [daydreamingjelly](#comment_1_1HbffZB9egQtfPz8HEV9JHBkys6EmKi6d9): hello guys, please visit and peers my first site, thank you!! http://127.0.0.1:43110/16W3qvMdzB4hJYBsz3sdLpcbULHLvX4zpP/\n\nIt's down.",
				"added": 1565121108
			},
			{
				"comment_id": 3,
				"body": "test comment 2",
				"added": 1565125815
			},
			{
				"comment_id": 4,
				"body": "> [benisman](#comment_1_13Tyfdt3oj7wjLJCvpQRgFHezxLaJnpxYf): Finally managed to make an account.\n\nTook me a while earlier. I would suspect the services for ID creation weren't ready for an influx due to the recent 9chan news,",
				"added": 1565131552
			}
		],
		"1561670029_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 5,
				"body": "> [majekfashek](#comment_5_1CrRkbW7es9dPf9JarnxFaF1T5MMUWYKnt): Trump has been selling out lately. Ever since his comments on crypto, I've been very skeptical of him. No other viable choice though...for now.\n\nI mean....he is probably surprised by his own farts. So I suspect unless he has baron at his side, this techno stuff is well beyond his feeble mind.",
				"added": 1565135386
			}
		],
		"1565132888_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 6,
				"body": "The fact that you posted this tells me your mind is not healthy. Being preoccupied with others is a sure sign of very low self esteem and a probable victim of abuse.\n\nWanna hug, trooper?",
				"added": 1565135520
			},
			{
				"comment_id": 7,
				"body": "> [223556](#comment_9_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): There is nothing wrong with seeking to uplift your fellow man from being fat and unhealthy.Your message shows only that you care very little about the state of the people around you. I actually do.You equate me trying to get people healthy and starting exercise, with trying to force them to have certain opinions, like the Communist chinese government does. That is wrong.  [...]\n\nDon't be mad, baby girl. The effort you put in shit talking others is a deflection your poor self image. Nothing wrong with that. Just work on it. You will start to realize that you only shit on others as a way to deal with your own shortcomings. I am sure your parents did the best they could. But some parents are just shit and raise shit kids.\n\nYou'll get there, champ. Be better. Rise above.",
				"added": 1565139230
			}
		]
	},
	"comment_vote": {
		"2_1HQ42LN1m8HQeBdKxRANi66HhHmjD1Nocz": 1,
		"1_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"2_137EHEniszjVXJyG94euNo13499PHuB3qL": 1,
		"1_1HpXTx1e9sJUVJ3U4URXWCdZCDSvXW5UBB": 1,
		"1_133JQBpgvo7LZCRbrMugcgwPbMwYMTDwBD": 1,
		"1_1NCb9nEqyrbkhoLjuMaipiWGoSyF3gHrC": 1,
		"1_19GNihftUzvoVyaLeAFSf4fGMyE5nzMAr": 1,
		"2_1CYfbmt76tpvWsZh2xgcFMnb7pVi7UGhoZ": 1,
		"21_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": 1,
		"1_18jmm5K92icHYrBzbvG4wo6NtPZEVMoTBP": 1
	}
}