{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1592264885_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 1,
				"body": "This is a bunch of unsupported word salad. \n\nDie mad, bigot.",
				"added": 1592335913
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 2,
				"body": "> [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): What would really do your country some justice is to send all stupid niggers like yourself back to Africa. \n\n\nAnd we can send you back to the hordes in Germany, where people like you are sacrificed to Odin. \n\n\n> [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): truth is that your ancestors were already slaves back in Nigeria few ages ago and the tribes sold them for beads to their new white masters.\n\n\nHEY GUYS, THEY DID SLAVERY FIRST SO I'M ACTUALLY ONLY A LITTLE BIT OF A PIECE OF SHIT\n\nJesus dude, take your kindergarten logic out of here. At one point men were subservient, hunting in groups to feed the tribe. Go get me an elk, you excuse of a human. \n\n\n > [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): Now you are all privileged, \n\nGlass houses, bro. \n\n> [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): wearing cotton clothes, riding cars, \n\n\nSooo... The same things you do. Which means you are privileged, too!\n\n\n\n\n> [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): your grandmothers got inseminated by white rapist masters and you got IQ boosted this way just enough so you could learn to spell and count drug money. \n\n\nWeeelllllllllll about that...modern math is derived from ancient African cultures, like the Nubians. \n\n> [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG):Meanwhile your fellow Africans are starving \n\n\nThey're not, many nations in Africa have better living standards than states like Georgia or Louisiana. There is deep poverty in America, and the fact that you tie hunger exclusively to race just goes to show that you are entirely ignorant of class. Which means you aren't qualified to discuss this subject. 😊😊😊\n\n\n\n\n\n\n> [glosrozsadku](#comment_1_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): and beg you to come back and use your white ancestry to help build new African economy. Donald Trump is the greatest president, made actually more good to niggers than Abe Lincoln, you should be ashamed of yourself.\n\n\n\nDONALD DRUMP MAYDE EET MOAR GUD\n\nRead a book, caveman.",
				"added": 1592336488
			},
			{
				"comment_id": 3,
				"body": "> [adrenochrome](#comment_16_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): Why not closing all the twitter accounts of leftwing Antifa, because I don't like Soros propaganda and his paid marxist activists. Who else wants a global socialist government?The man behind twitter (twitter founder) recently posted that he likes to read satanic literature (!). Maybe he thinks he is a member of a powerful elite.If you do not believe me - research all points I mentioned!\n\nI mean, I want a socialist government. Single payer health care sounds awesome!!",
				"added": 1592336605
			}
		]
	},
	"comment_vote": {
		"2_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": 1,
		"1_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": 1
	}
}