{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1568598626,
			"title": "I've set up a permanant node. Now I want to start seeding.",
			"body": "Zeronet downloads and seeds every zite I visit. Do I need to manually update the site? Or will they update automatically over time?",
			"added": 1568598625
		},
		{
			"topic_id": 1568656823,
			"title": "ZeroNet convenience, Achievable even by the technically retarded.",
			"body": "I've got ZeroNet set up up and spinning on a dedicated box at home. Now, I can access it from anywhere at anytime using duckdns. \n\nI have a couple questions that I think are relevant going forward. Just how much space can I expect this to take if I leave it running for months (years?) on end. It seems that it's theoretically possible for the entirety of zeronet to eventually end up hosted by me locally depending on my usage habits. If we plan to grow, then the average user will eventually need to dedicate massive amounts of space to the network. I've got 100g dedicated, but it seems that if we grow, which we must, then eventually each normal user could need terabytes in order to make the network readily accessible to everyone. \nHow is this being planned for? Is there any plan to perhaps make sure that old sites that haven't been updated for a long time (some threshold) are eventually pruned automatically? \n\nSecond: I know ZeroNet has multi-user capability, which I think is great because it allows the average user to connect via proxy and experience zeronet without having to do their own install. But it begs the question; from the perspective of a normal internet user, what benefit do they reap from being here vs clearnet? All their friends are on clearnet. Their socials are on clearnet, their banking is on clearnet, their email is on clearnet... all the interesting meme video sites are on clearnet for heavens sake. \n\nHow do we draw them? The answer I think is creative and interesting content. If zeronet is to be a place where oddballs such and me and (possibly you) congregate away from everyone else, then it will never be anything more than a bunker for the technically inclined. \n\nWhy does content blossom and grow on clearnet? The answer I think is because the clearnet exists for one reason and one reason alone: To make money. Rarely is anything done that doesn't benefit someone financially. There are rare exceptions like 4chan (it doesn't make money, but it at least breaks even). Facebook exists for advertising, google is an advertising company. Even places like redding, deviant art, etc... they MAKE MONEY by advertising. They do it on the back of content creators, but they exist for advertising nonetheless. \n\nIt seems like these things have a natural cycle to them: First people are genuinely interested in making content because it brings them joy to do so, eventually, they realize they can make money on it. They rarely do so by themselves... rather, its done through a system of advertisement, through subscription, syndication, etc. Either people get on board or they don't. Look at liveleak, it couldn't compete with youtube, it's hanging on by a thread now and it looks like a site from the late 90's. \n\nI guess my main concern is this: How to we get content creators interested in ZeroNet, how do we ensure they benefit from it , how can we drive traffic here, and ensure they stay here, and most importantly, how can we implement some kind of advertising to generate revenues that will allow the network to grow and expand, and to fund additional content creation. \n\nWe need to answer these questions or this project will only ever be a bunch of us weirdos hanging out on the secret internet.",
			"added": 1568656821
		},
		{
			"topic_id": 1568744754,
			"title": "Blocking people is easy.",
			"body": "Does he know? \n\nPlug qqqqqqqqqqqqqqqq into the search on ZeroId, select mute, and he's done.",
			"added": 1568744751
		},
		{
			"topic_id": 1568854490,
			"title": "seed zeronet zites via transmission-daemon",
			"body": "Seed zeronet sites without running zeronet. \n\nThe details are unimportant at this point. Can I seed a zeronet side from my vps using tranmission-daemon? Like a regular torrent? Or is it only possible to seed with the zeronet application itself?",
			"added": 1568854486
		},
		{
			"topic_id": 1568856272,
			"title": "Publish content always fails.",
			"body": "I am not on tor always mode and I have an open port. \n\nI built a shitty test site, and went to publish it. It says signing successfull, publish failed, content is available, no peers. \n\nWat do?",
			"added": 1568856267
		},
		{
			"topic_id": 1568995610,
			"title": "Lying news media hacks.",
			"body": "I hear on the radio this morning that a white man was charged for vandalizing the store fronts of \"east African immigrants\".. .Why don't they just say Somalians? Everyone here hates Somalianigger scum, and we want them out of our state. They're stupid, smelly, muslim scum, and the gov't favors them over the real americans that live here. \n\nThe media won't even call the victims Somalians because they know that the people here would approve of what was done to them. \n\nNo wonder no one trusts the news anymore.",
			"added": 1568995604
		},
		{
			"topic_id": 1569171713,
			"title": "How Balkanized has ZeroNet become?",
			"body": "I imagine that there are blocks of users that have created their own imaginary mental islands where only they and few other people that they haven't muted are allowed to exist. \n\nP2P has just as much potential to be used for the creation of closed off hug-boxes as any other platform.",
			"added": 1569171706
		},
		{
			"topic_id": 1569674003,
			"title": "Audio in ZeroWiki",
			"body": "I cloned zerowiki and am putting together a page which hopefully will feature audio. What I neeed to do is figure out how to make an audio clip available as a link in ZeroWiki. I don't see anything in the documentation, and I am at a loss. Can someone offer some assistance?",
			"added": 1569673995
		}
	],
	"topic_vote": {},
	"next_comment_id": 46,
	"comment": {
		"1568508391_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_998_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This guide is about making Tor work with ZeroNet, whilst the topicstarter most likely wants to setup ZeroNet first. Here's how to do that: [...]\n\nI did this and it worked. Thanks for the information.",
				"added": 1568596460
			},
			{
				"comment_id": 2,
				"body": "> [randomshits](#comment_107_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): While that may sound effective, it doesn't sound very retard proof. 😛I really don't expect much skill beyond an ability to copy & paste lines of code from a guide and hope for success. [...]\n\nthis guy gets it",
				"added": 1568596570
			}
		],
		"1568598141_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 3,
				"body": "Easy. I read the book of morman, made a short comparison study of the actual bible, and proceeded to school them when they came back. I felt bad because the guy had his kids with him, and he couldn't answer any of my accurate statements about the falseness of his religion.",
				"added": 1568598531
			},
			{
				"comment_id": 4,
				"body": "> [bigbadbob](#comment_731_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I gave that a try.  It worked for a bit, but they came back to invite me to a bbq via text, I ignored them. I find myself making excuses because they are indoctrinated and on transmit.  And they come off as determined females and use my nature against me.  My indifference seems to fuel them, I have shared my honest concerns of the workings of their organization as i see it.  They are really nice and relentless.  Should i get them to clean my house?\n\nThe only way to make them piss off if to tell them to piss off. Just tell them that you're a right-wing protestant fundamentalist and that you don't need their backwater fake religion.",
				"added": 1568599288
			},
			{
				"comment_id": 6,
				"body": "> [edgelordofdecent](#comment_114_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): I tell people that try to convert me to their religions to fuck off.\n\nI love that your name is edgelord, fits your post perfectly lol",
				"added": 1568640889
			}
		],
		"1568561319_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 5,
				"body": "You could tickets to that show OP",
				"added": 1568600842
			}
		],
		"1568598626_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 7,
				"body": "> [filips](#comment_196_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): If you have a lot of space and you want to seed new sites, you can setup New ZeroNet Sites. This will download new ZeroNet sites and start seeding them. [...]\n\nI've got 100gigs dedicated. \n\nQuestion: I've got my box running over tor, what risk is there really if i'm seeding other peoples shady content? I didn't sign it, am I really responsible for it?",
				"added": 1568649593
			}
		],
		"1568607154_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 8,
				"body": "> [undisputed](#comment_1_19MNueeefmtMbBKPCdqtB8UnQmZC8QwLJX): QoS\n\nI googled it for you: \n\nPort-based rate limiting allows you to limit the speed at which network traffic is sent or received by a device that is connected to a port on your switch. Unlike 802.1p Quality of Service (QoS), port-based rate limiting does not prioritize information based on type. Rate limiting simply means that the switch will slow down traffic on a port to keep it from exceeding the limit that you set. If you set the rate limit on a port too low, you might see degraded video stream quality, sluggish response times during online activity, and other problems.\n\nThe best use of rate limiting is to keep low-priority devices that are connected to your switch from using too much of your bandwidth and slowing down your other connected devices. A combination of rate limiting and QoS can help you maximize your network’s efficiency and prioritize devices and activities.",
				"added": 1568658365
			}
		],
		"1568652007_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 9,
				"body": "I guess it depends on which system you mean. I left CA because they wanted me to pay for all sorts of stupid shit, and they hated the idea of my owning the firepower necessary to say No. \n\nNow I live in the midwest and I'm forced to pay for all sorts of stupid shit for somalianiggers and drug addicts. \n\nIt sucks no matter where you go, OP.",
				"added": 1568658501
			}
		],
		"1568656823_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 10,
				"body": "> [xcape2net](#comment_386_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): There have already been many discussions about how to make money on ZeroNet.  As you pointed out, the clearnet exists to make money.  And that is what has corrupted it to the point where we are now looking for alternatives.  If ZeroNet expands rapidly and becomes enormous, the same thing will happen to it.  Then, we'll have to go somewhere else.  So, why would you want to hasten the process?  Can't you just be happy making money on the clearnet, and let ZeroNet exist uncorrupted for a while longer?\n\nIt's not a matter of me personally making money. The fact is that money (rather, the flow therof) drives progress, development, and the production of interesting content. \n\nThe question I'm interested in answering is deeper. How do we totally divorce the process of development from the thing that has always driven development throughout history? That is money. \n\nHow do you motivate people to abandon the clearnet for better alternative without something to draw them? How do you cause people to dedicate themselves to generating content when there isn't anything in it for them. In the beginning you might draw in a few people who like to make content for the sake of it, but they need to live too. Sooner or later they need to make a buck. \n\nEven me, I voluntarily seed as much as I can because I am counting on this project becoming more than just a project. It seems that a lot of people just want a cool clubhouse to hang out in.",
				"added": 1568662345
			},
			{
				"comment_id": 11,
				"body": "> [xcape2net](#comment_387_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What is the point of driving development to something we don't want--something like already exists in the form of the clearnet?  Why would people abandon the clearnet for something just like the clearnet?  What's wrong with a cool clubhouse to hang out in--something similar to the clearnet of the 1990's, before the it became corrupted by money?\n\nDon't get me wrong. I'm not trying to make a moral issue out of it. I'm just thinking aloud. \n\nI agree that clearnet is certainly corrupted in many ways. But I think that the corruption was caused by a finite number of individuals who used it for personal gain at the expense of everyone else's ability to think, have meaningful conversations, and express their true ideas. I don't see it as a flaw integral to the system itself; the system is merely a series of tubes and boxes to be used one way or another to put it simply. \n\nI suppose I came here because I view the internet as a tool, as opposed to a source of entertainment. It is a tool that I use to communicate, to be introduced to interesting ideas, and to try to seek the truth of the world through the noise. \n\nI can see that the question I should have asked is: What do the users of ZeroNet want this place to become?",
				"added": 1568670088
			},
			{
				"comment_id": 12,
				"body": "> [xcape2net](#comment_388_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I'm sure many would have received something of value from what you said if you had written it in English.  For other peoples' benefit, I'll quote part of it: [...]\n\nI can see that my language has been through a few permutations now. \n\nWhat is meant by \"rams\" when you say \"not a place for rams\". Obvious It's an animal, but I'm not sure what is meant by the symbolism.",
				"added": 1568670226
			},
			{
				"comment_id": 14,
				"body": "> [tomasz21](#comment_79_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw): Witam na ZeroNet; Po stylu pisania oceniam, że zrozumiesz co ja pisze. Dożyliśmy takich czasów że ludzie się wstydzą swojego języka. Ale to nie jest moja sprawa, mogę pisać w języku angoli, mogę po niemiecku. Mogę po rosyjsku; Ale piszę po Polsku. Dlaczego? Bo to jest trudny język, i trzeba go szanować, a nie poniewierać.Jestem od urodzenia oportunistą, i takim zostanę. Nie dałem się sowietom, to i nie dam się usmanom, ani czarnogłowym. Dlatego jestem tutaj w ZeroNecie. Wprowadzenie reklam uważam za bardzo zły pomysł, Wystarczy że tam jest Acta-2. Śmieci, i reklamy, i sprzedajna polityka. Tutaj powinno być czysto, i tak powinno pozostać. Te miejsce jest dla wolnych ludzi, którzy mogą powiedzieć co chcą i mają na myśli, bez żadnej krępacji. Pozostali do klearnetu  proszę  wypier...ć,  w podskokach, tam jest wasze miejsce. Kontrola i ograniczenia, cenzura i serwery, które można w każdej chwili wyłączyć. Tutaj nie ma miejsca dla pedałów politycznych.Zostało to tak podzielone, i tak niech pozostanie na zawsze.Cytuję; Wygląda na to, że teoretycznie możliwe jest, aby cały zeronet ostatecznie został hostowany przeze mnie lokalnie, w zależności od moich nawyków użytkowania.Absolutnie nie musisz hostować całego ZeroNetu. Wystarczy ze zrobisz to ze stronami które lubisz, które się tobie podobają. No chyba że jesteś pracownikiem służb na trzy litery, to wtedy musisz. Taki żart.  [...]\n\nI appreciate you having taken the time to reply so eloquently and completely.\n\nTo one of your points: No I am not an official of any kind, although I realize that my question may have carried imperious connotations. I simply meant the question from a practical standpoint - a serious question how the network will expand, and how we can expect to keep content as it ages and looses relevancy.\n\nAdditionally, I have no interest in making money through ZeroNet personally. I actually think it will be interesting to see how it unfolds on it's own, without being spurned forward erratically by the whips of corporate interests. I'm merely curious to understand what the creators expect to happen, and how the userbase thinks about the development of this place being divorced from the normal means of expansion, that it, capitalistic means. \n\n\"Niech na talerzu będzie mało, ale zdrowe i smaczne jedzenie.\nTakie dla koneserów.\"\n\nI this quote sums up the entire thing nicely. I appreciate your insight, and I have no intention going anywhere.",
				"added": 1568679588
			},
			{
				"comment_id": 15,
				"body": "> [xcape2net](#comment_390_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): By the way, despite the lack of encouragement of commercialism, ZeroNet is growing.  When I first came here in the beginning of April,  I was seeing typically 600 to 1200 peers.  Now I'm seeing 4500 to 6500.   That's an annual growth rate of thousands of percents.  I know the dissolution of 8Chan has something to do with that, and only time will tell if this continues.\n\nIt'll be interesting to see what happens what/if infinitychan comes back. I'd be hesitant to go anywhere near it now. Too many oddities surround Jim Watkins.",
				"added": 1568681854
			}
		],
		"1568675236_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 13,
				"body": "Always up. It's not late here though.",
				"added": 1568678231
			}
		],
		"1568748111_149JsPomUWvpfHqaAPPZhdxu24FGnKVnCg": [
			{
				"comment_id": 16,
				"body": "I'll just block you again.",
				"added": 1568749287
			}
		],
		"1568749254_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 17,
				"body": "Whats the different between KxoID and ZeroID and more importantly why should I care. You're entitled to squabble, but maybe you just explain instead. I'm happy to host whatever. What reasons should I seed KxoID?",
				"added": 1568749685
			}
		],
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 18,
				"body": "It showed me show gay the big internet is.",
				"added": 1568767156
			},
			{
				"comment_id": 35,
				"body": "> [gagger](#comment_3_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG): ZeroNet can help me cast off GFW's control, I am from China, you know\n\nI'm interested to hear about this. I see many users from china, and the Chinese language blogs and forums seem to be the most active. I thought that the CCP was blocking VPNs and TOR and other technologies designed to circumvent the GFW. How it that ZN is able to operate freely and undetected on Chinese internet infrastructure?",
				"added": 1569193450
			},
			{
				"comment_id": 37,
				"body": "> [xcape2net](#comment_403_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I've also had the same questions.  I've not gotten a lot of answers, but one thing I gather is that Chinese ZeroNetters are busy setting up trackers as trackers are being taken down by their government.  I also assume there are small, closed networks where NetZero Files are updated by those who have outside access.\n\nSo it stands to reason that while ZN may be quite active in China, quite a bit of what they discuss remains in China.",
				"added": 1569196783
			}
		],
		"1568856272_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 19,
				"body": "> [randomshits](#comment_125_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): a user named 'trustedlearnings' is unable to comprehend what they read. You're going to have one hell of a time here.\n\nHere's an idea: don't be a bitch about it.",
				"added": 1568904778
			}
		],
		"1568942181_1KJWLBhkwmtbUH2zhcbfWinQK9kJ4Kosfb": [
			{
				"comment_id": 20,
				"body": "I'm posting from orbit. Fucking noobs.",
				"added": 1568942880
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 21,
				"body": "It doesn't matter if we are or not. I say this because we're stuck here no matter what, so you may as just well deal with it.",
				"added": 1568942983
			},
			{
				"comment_id": 36,
				"body": "> [xcape2net](#comment_404_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I've heard the phrase, \"as above, so below\" many times.  Is it a quote from the Bible, or from something more esoteric, like Emanuel Swedenborg or Kabbala?\n\nIt's not from the bible directly, although one could argue that it reflects an idea found in the old testament. That is that everything laid out in the old Jewish law was to serve as an earthly reflection of something spiritual or heavenly. I'm just speculating about the connection though. \n\nI stole this answer from the internet, I didn't write anything below this line: \n--------------------------------------------------------------------------------------------------------\n\n\"Some of the other answers here are pretty solid interpretations. I would offer some practical examples that illustrate the concept.\n\nIf you look at your body, you may notice the visual patterns that are reflected (in scale) outside of your body. For instance, the dendritic pattern of your veins & nerve cells is mirrored in rivers & trees (respectively specific). We can look at the number Phi, for instance, and see its role in the proportions of the body (length of fingers, space between eyes, etc). We can look at many patterns within nature and see their correspondence with the body, and to scale from the smallest patterns to the largest ones that we can perceive.\n\nI would say that this is one of my favorite parts about Hermeticism as a philosophy. It enables the interpretation of life through a poetic lens of metaphor and correspondence, and fosters the connection between phenomena across various scales, giving a sense of connection. Perhaps the \"biggie\" example here would be if we take \"As above, so below\" and apply it to the existence of consciousness and creativity, then indeed we could follow it all the way up and see that humans are a mirror of Godhead, the singular consciousness and creative potential.\n\nYou can apply this axiom in \"practice\" by considering the larger, or more abstract version of whatever it is that you might be observing or doing, and keeping sight of the implications.\"",
				"added": 1569196640
			}
		],
		"1568995610_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 22,
				"body": "> [randomshits](#comment_130_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Everyone wants to blame foreigners and their unfortunate situations instead of the results of capitalism that have put them in to those situations in the first place. [...]\n\nSadly I hear blurbs on the radio from time to time, it's unavoidable. Why are you listening to Karl Marx? That stuff will rot your brain.",
				"added": 1569000337
			},
			{
				"comment_id": 23,
				"body": "> [randomshits](#comment_133_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Nonsense, I and many others avoid it just fine. Maybe your skills of avoidance are as honed as your reading comprehension.  [...]\n\nFuck off, you self righteous cocksucker.",
				"added": 1569002958
			},
			{
				"comment_id": 24,
				"body": "> [bigbadbob](#comment_773_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): A funny recent example is the media calling blackface brownface...  i guess its more gentle somehow, lol  They are shit and no one should pay any attention unless they are willing dive into all the sources from all the interest groups.  And understand they are shit... It's all mind pollution.\n\nIf the left does it, then it's brownface",
				"added": 1569012348
			}
		],
		"1569165906_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 25,
				"body": "I'll play with you, but no one is there.",
				"added": 1569166684
			},
			{
				"comment_id": 26,
				"body": "I entered cactus dragon. Waiting on you, friendo.",
				"added": 1569166830
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 27,
				"body": "Totally agree. Some user named randomshits started lashing out at me for speaking, and then muted me. Why? I mean the point of this place is to be able to say what what you think. Honestly, If you can't handle what other people think then maybe you belong on facebook. \nMuting is for pussies. The only acceptable application for muting is when you're dealing with relentless spammers.",
				"added": 1569170315
			},
			{
				"comment_id": 28,
				"body": "> [moor](#comment_252_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): i think you are confusing free speech with choice my nigga.\n\nNothing wrong with choice. But I think that permanently destroying the ability to communicate with another user, where the decision is based on almost zero data, and also cutting yourself off from any ability to ever change your mind about that user is a pretty lousy thing to do. \n\nIn a place like this, we are all we have. So it's better to get along and get to know each other over time, instead of perma-muting other people just because one thing they said rubbed you the wrong way.",
				"added": 1569171567
			},
			{
				"comment_id": 30,
				"body": "> [filips](#comment_222_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Permanently? Did you know that ZeroNet has unmute feature?\n\ncompletely aware. but once someone is muted, they may easily slip your mind.",
				"added": 1569178562
			},
			{
				"comment_id": 31,
				"body": "> [randomshits](#comment_148_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): It is really simple...I will stand to protect your ability to say 'fuck niggers' , but that doesn't mean that I must be forced to hear your retarded ass say 'fuck niggers' That group is not my cup of tea, but I also realise that the world does not revolve around my flavour choice.\n\nYou probably can't hear me, but I thought it was rather rude and inappropriate the way you spoke to me and then muted me for literally no reason.",
				"added": 1569178623
			},
			{
				"comment_id": 32,
				"body": "> [filips](#comment_223_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): So, what is your \"solution\"?\n\nDon't mute unless it's spam. Be productive. In my case, I was immediate attacked for not knowing enough about how zeronet and p2p works. The user who muted me could just as easily have pointed me to newie reference material instead of making a point to treat me like an asshole. Yes, my feelings were hurt, because I am a person and I have those. Rude and unnecessarily insults make a place shittier, not better.",
				"added": 1569180631
			},
			{
				"comment_id": 33,
				"body": "> [randomshits](#comment_150_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Just imagine me as one of those Somalian immigrant that you hate and I will imagine you as the capitalist racist retard. You don't want help from some Somalian immigrant do you? Of course not.\n\nYou know absolutely nothing about what the immigrant situation is like here. You also know nothing about my views on capitalism.",
				"added": 1569181523
			},
			{
				"comment_id": 34,
				"body": "> [randomshits](#comment_153_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): It is likely no surprise to you but I agree with cary...  [...]\n\nAnd this: \nhttps://www.ict.org.il/Article/1790/use-of-the-zeronet-network-by-the-islamic-state#gsc.tab=0 \n\nI'm wondering if they're still lurking somewhere.",
				"added": 1569193241
			},
			{
				"comment_id": 39,
				"body": "> [chergriog](#comment_7_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd): if it's a leftist/liberal/democrat/communist/marxist, i have the sacred duty to mute him/her. They already own google, facebook, twitter and all the rest of the shitnet\n\nThey can't \"own\" ZN though. It's literally impossible. Muting them encloses you in a hugbox, it doesn't actually inhibit left leaning users from using ZN in any way.",
				"added": 1569254289
			}
		],
		"1569149074_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 29,
				"body": "> [undisputed](#comment_25_19MNueeefmtMbBKPCdqtB8UnQmZC8QwLJX): Don't waste your time, most of the nazis and qcumbers from 8chan are barely any more intelligent than leftists. Once in a while you find a smart person who happens to know his shit, but that's just because there were lots of users on the site.Wrt to the topic, personally I bet a large portion of pedos (at least hebephiles) are just normal people with low risk aversion who happen to be fed up with their wives and decide to take a shot at seducing some teen in their lives (or download cee pee) despite the risk of going to jail. One of their students, some family member, etc. I mean, let's be honest, who wouldn't like to fuck some 14 yo prime virgin pussy? Especially now that almost every 20 yo woman is a tattooed whore with >20 past sex partners and who knows what STDs. Same thing with porn. Who wants to look at some professionally produced porn showing a 30 yo fake blond whore taking the BBC from her three nigger step fathers or whatever, or some cam whore with >100 dick count pissing (oh, sorry, \"squirting\") all over the floor while making fake moans every time one of her orbiters donates to her? All jewish shit. I'd rather watch some leaked vids of a teen masturbating with a hairbrush or whatever. [...]\n\nDon't worry undisputed, He's muted you by now.",
				"added": 1569172055
			}
		],
		"1569200371_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": [
			{
				"comment_id": 38,
				"body": "If you hit the limit what happens? Are you just unable to chat here anymore?",
				"added": 1569200479
			}
		],
		"1569269870_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 40,
				"body": "It's not your property. Property ownership does not exist in the US for private citizens unless you own it outright and are rural enough that you can't see your closet neighbor.",
				"added": 1569274333
			},
			{
				"comment_id": 41,
				"body": "> [styromaniac](#comment_1056_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I understand that. The concept of using alternatives to grass is beyond some people though.\n\nPeople are ridiculous, I agree. You may be able to mount a legal case in your favor, but if you're fighting the town or city you're unlikely to win. You're not in a HOA are you?",
				"added": 1569277133
			}
		],
		"1569608915_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": [
			{
				"comment_id": 42,
				"body": "> [anonymouslogin](#comment_16_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Fomenting paranoia are we? Nice try, want-to-be.\n\nWould you elaborate on this?",
				"added": 1569625460
			}
		],
		"1569674003_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 43,
				"body": "> [gitcenter](#comment_1116_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You can create a directory e.g. data/audio that will store audio files. You can then use [Audio name](data/audio/filename.mp3) syntax to embed a link to an audio file. AFAIK there's no way to show an audio menu inline (if you need that, I might make a research though).\n\nOK, so you have to link each audio file individually. I'm hoping for a way to ready out the entire directory as links. I've got about 50 audio files, and I don't want to have to link each one individually.",
				"added": 1569675666
			},
			{
				"comment_id": 44,
				"body": "> [gitcenter](#comment_1118_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): And this is probably literally impossible on ZeroWiki. Your only hope would be to fork ZeroWiki and change lots, no lots of code.\n\nThat sucks lol. I'll figure something out. Thanks for the input.",
				"added": 1569676486
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 45,
				"body": "> [anonymouslogin](#comment_23_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Those of us who hunt them for sport are dying to know....\n\ndo you really? can we go camping or something?",
				"added": 1569800436
			}
		]
	},
	"comment_vote": {
		"1033_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"114_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1038_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"10_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M": 1,
		"36_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"248_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1090_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}