{
	"title": "☘兼听则明☘",
	"description": "❤☀**_<font color=\"blue\">立志真实记录中国\n望您慷慨做种传播</font>_**☀❤\n这个网站的方向注定体积会越来越大，愿意缓存这个网站为这个网站做种的网友，<font color=\"#A020F0\">按住右上角的零符号左拉，打开“”下载并帮助分发所有文件“”选项</font>，共同记录真实的中国，博主在此跪谢了，谢谢您。\n![image alt](sticker/weibo/9.png)",
	"next_post_id": 30,
	"demo": false,
	"modified": 1505731448,
	"post": [
		{
			"post_id": 29,
			"title": "批评官员的尺度",
			"date_published": 1505645358.33,
			"body": "批评官员的尺度\n一(1)\n“为川者决之使导，为民者宣之使言。” 《国语?周语上》\n“对公共事务的讨论应当不受抑制、充满活力并广泛公开。” “《纽约时报》诉沙利文案”\n\n* * *\n\n作为当今世界最有影响力的媒体之一，《纽约时报》虽正经受电子传媒的挑战，发行量也有所下降，却从未感受到生存威胁。但是，1960年，一个名叫L.B.沙利文的警察局长提起的一场诽谤诉讼，却几乎将《纽约时报》逼至绝境，如果不是联邦最高法院九位大法官力挽狂澜，这家百年老店或许早已关门大吉。\n由威廉?布伦南大法官撰写的本案判决，不仅适时挽救了《纽约时报》，还推动美国新闻界真正担负起监督政府、评判官员的职能，跃升为立法、行政、司法之外的“第四权”。{“第四权理论”（the fourth estate theory），源自美国联邦最高法院大法官波特?斯图尔特1974年11月2日在耶鲁大学法学院的一次演讲。他认为，宪法之所以维护言论自由和出版自由，就是要维持一个有组织而且负责任的新闻界存在，使之成为立法、行政、司法三权之外的第四权，真正起到监督政府，防止政府滥权的作用。这一说法也得到威廉?布伦南大法官的支持。参见Brennan，Address，32 Rutgers Law Review 173(1979)。} 近半个世纪之后，这起名为“《纽约时报》诉沙利文案”（New York Times v. Sullivan）的案件，仍影响着当代美国社会，与每一位普通美国人的生活息息相关。{本案一审原告为阿拉巴马州蒙哥马利市警察局长沙利文，初审案名为“沙利文诉《纽约时报》案”，沙利文作为原告排列在先。《纽约时报》一审、二审失利后，请求最高法院复审此案。此时，《纽约时报》为上诉人，沙利文为被上诉人，本案在联邦最高法院的案名随即变更为“《纽约时报》诉沙利文案”。}新近发生的一起案件，就是最好的证明。\n2011年3月2日，联邦最高法院宣布了“斯奈德诉费尔普斯案”（Snyder v. Phelps）的判决结果，九位大法官以8票对1票，判定极端反同性恋组织“韦斯特伯勒浸礼会教会”胜诉。消息传出，有保守派团体击掌相庆，也有自由派组织表示欢迎，报刊电视亦纷纷叫好。到底是一起什么样的案件，能令左右两派、传媒大佬们皆大欢喜呢？\n“斯奈德案”触及的，是美国宪法中的一项永恒议题：言论自由。原审被告弗瑞德?费尔普斯来自堪萨斯州，是“韦斯特伯勒浸礼会教会”创始人。这个教会规模不大，成员多是费尔普斯的亲友。二十年来，但凡有军人下葬，费尔普斯都会率教众奔赴现场，并在附近亮出标语。标语内容相当令人反感，多是“感谢上帝，弄死士兵”、“为 9?11 感谢上帝”、“上帝仇恨同性恋”、“你们会下地狱”、“美国应遭天谴”，等等。这些人极端仇视同性恋，在他们心目中，美国社会，尤其是美国军方，因为对同性恋行为态度过于宽容，正承受上帝的责罚，那些战死异乡的军人便是明证。\n2006年，马里兰州居民阿尔伯特?斯奈德主持了爱子马修的葬礼。马修在海军陆战队服役，阵亡于伊拉克战场，遗体被运回家乡下葬。葬礼现场庄严肃穆，观者无不动容。当晚，沉浸在悲痛中的斯奈德打开电视，突然看到一幅令他心碎的画面。原来，葬礼举行时，距离墓地不远的一片空地上，费尔普斯等人正举牌抗议。白发人送黑发人，本就是人生至恸。可以想象，“感谢上帝，弄死士兵”这样的标语，会对一位丧子老父造成多大刺激。\n斯奈德以诽谤、侵犯隐私、故意造成精神伤害为由，将费尔普斯等人告上法庭。费尔普斯则援引美国宪法第一修正案，为抗议行为申辩。他提出，既然第一修正案规定“不得立法 侵犯言论自由或出版自由”，那么，举牌抗议便是自己的基本权利，骂天\n\n一(2)\n骂地骂总统，都受宪法言论自由条款保护。{美国宪法第一修正案全文是：“国会不得立法：确立国教或禁止信教自由；侵犯言论自由或出版自由；剥夺人民和平集会或向政府陈情请愿申冤之权利。”其中，不得立法侵犯言论自由或出版自由的内容，又被称为“言论自由条款”或“出版自由条款”。}\n不过，一审法院和陪审团可不这么看。陪审团经过商议，判定费尔普斯的行为构成侵权，要求他赔偿斯奈德1090万美元。其中，290万元是补偿性赔偿金，800万元是惩罚性赔偿金。后来，还是法官网开一面，减免了210万元惩罚性赔款。费尔普斯既不甘心，也无能力支付这么多赔偿。他很快提起上诉，并在联邦第四巡回上诉法院胜诉，官司随即打到联邦最高法院。\n美国主流媒体多偏向自由派，尽管他们不赞同费尔普斯的反同性恋立场，甚至厌恶他的平素作为，但是，本案的争议焦点，是言论自由的边界如何确定，而非同性恋是否合法。所以，包括《纽约时报》、美联社在内的各大媒体，一边倒地支持教会一方，陆续向最高法院提交了“法庭之友”意见书，以表达他们维护言论自由的立场。{“法庭之友”（amicus curiae或friends of the court）意见书：是指法院在审理案件过程中，当事人以外的第三人向法院提供与案件事实、法律或政策有关的书面意见，借此达到说服法院，支持某一方立场的目的。}而斯奈德这边，也得到四十八个州和哥伦比亚特区的司法总长、四十位参议员及各退伍军人团体的支持。\n近两年，尽管最高法院日臻保守，但在捍卫言论自由问题上，立场却颇为坚决，甚至不惜为此违背主流民意。2010年1月21日，大法官们在“公民联盟诉联邦选举委员会案”（Citizens United v. Federal Election Commission）中，宣布企业亦拥有言论自由，解除了对企业以投资拍摄“竞选广告”形式介入政治选举的限制，激起总统、国会的强烈反弹。1月24日，巴拉克?奥巴马总统发布首次国情咨文时，一反“三权分立，和和气气”的规矩，公开谴责了这一判决。2010年4月20日，最高法院又在“美国诉斯蒂文斯案”（United States v. Stevens）中，宣布国会一部禁止传播包含虐畜内容的音像、图书制品的法律违宪，得罪了大批动物保护人士。{作为例外，美国最高法院近年适当限制了在校学生的言论自由，如2007年的“莫尔斯诉弗雷德里克案”（Morse v. Frederick）。2002年1月，几名高中生观看冬奥会火炬传递时，打出写有“为耶稣抽大麻（BONG HITS 4 JESUS）”字样的条幅。学生为此受罚后，起诉校方侵犯言论自由。2007年6月25日，最高法院以5票对4票，判定校方胜诉，判决意见指出：校方为保护其他学生不受有害言论影响，可以处罚学生在学校组织的活动中宣扬吸食毒品的行为，这么做不违反宪法言论自由条款。}人们纷纷预测，这一次，最高法院也会支持教会一方。\n果不其然，8票对1票的投票结果，显示了多数大法官的司法倾向。判决意见由首席大法官约翰?罗伯茨执笔。判决理由部分，汇集了最高法院历史上诸多言论自由名案的经典判词。比如，“对公共事务的讨论应当不受抑制、充满活力并广泛公开”（“《纽约时报》诉沙利文案”［1964年］）；“对公共事务的讨论不只是一种自我表达，更是人民自治的基础”（“盖瑞森诉路易斯安那州案”［1964年］）；“在第一修正案的价值体系中，关于公共事务的言论位于最高层级，应受到特别保护”（“康尼克诉迈尔斯案”［1983年］）。\n罗伯茨认为，费尔普斯的抗议言论的确“令人不适”，标语内容在促进“公共讨论”方面的作用，亦细微到\n\n一(3)\n可以“忽略不计”。但是，他们的所作所为，针对的不是阵亡士兵马修，而是军方的同性恋政策。类似抗议行为，已在600场军人葬礼附近发生过，所以，这些抗议应被视为“对公共事务的讨论”。此外，抗议者站立的地方，距离葬礼现场有1000英尺，抗议者听从警察指令，既未大声喧哗，也无暴力行为，更没有越界之举。事实上，在葬礼现场，斯奈德虽隐约看到远方有人群聚集，但根本不知道这是针对葬礼的抗议。这也充分说明，死者父亲受到的冒犯，主要来自从电视上目睹的标语内容，而非抗议者对葬礼秩序的直接侵扰。\n罗伯茨最后总结道，不能仅仅因为抗议者的言论“对死者不敬，或令人憎恶”，就予以限制。他说：“言论威力无穷，可激发人们各样情绪，或令他们怆然泣下，或令他们喜极而涕，而在本案中，某些言论给死者家属带来了巨大痛苦。但是，即便如此，我们也不能为安抚他人伤痛，而令言者有罪。”基于维护言论自由之立国承诺，“为确保政府不压制公共讨论，即使是伤害公众感情的言论，也应当加以保护”。\n罗伯茨的判决，延续了最高法院近半个世纪以来的基本立场，那就是，尽可能保护政治性言论的自由，或者说，保护人民就公共事务开展讨论的自由。这些立场，正是由1964年的“《纽约时报》诉沙利文案”确立的。\n费尔普斯的言论自由固然重要，可是，斯奈德的丧子之痛，与此事给他带来的痛苦煎熬，真的可以忽略不计，甚至让位于抗议者简单、粗暴的“公共讨论”吗？\n九位大法官中，惟一持异议意见的小塞缪尔?阿利托大法官就认为，费尔普斯的标语完全是一种“挑衅言论”，不应受宪法第一修正案保护。言论自由不是恶毒污蔑的通行证。的确，教会可以在任何地方，以任何形式表达抗议，但是，法律不能允许他们用伤害公民私人感情的方式表达意愿。他说：“就算在一个可以公开、充分讨论公共事务的社会，也不应当让无辜者受到这样的残忍对待。”尽管在最高法院内部，阿利托大法官属于孤独的少数方，可我相信，他的观点，也代表着许多普通人的看法：凭什么言论自由与公民情感冲突时，一定是前者优先？{关于本案详情及对阿利托大法官的异议意见的深入分析，参加林达：“一票反对的意义”，载2011年4月3日《东方早报?上海书评》。}\n一百多年来，类似的价值冲突，以案件形式，在最高法院这个大舞台上不断上演。比如：散发反战传单，是否危及前线将士安危？（“艾布拉姆斯诉美国案”，［1919年］）穿着写有“操他妈的征兵制度”的外套出现在政府办公楼内，算不算扰乱社会治安？（“科恩诉加利福尼亚州案”，［1971年］）当众焚烧国旗，有没有亵渎人民对国旗的神圣情感？（“德克萨斯州诉约翰逊案”，［1989年］）州法官候选人在竞选中宣扬自己的司法立场，是否违反了司法伦理？（“明尼苏达州共和党诉怀特案”，［2002年］）往黑人家里投掷燃烧的十字架，是不是散布“仇恨言论”？（“弗吉尼亚州诉布莱克案”［2003年］）禁止节目嘉宾说粗口，是否侵犯言论自由？（“联邦通讯委员会诉福克斯电视台案”［2009年］） 在这些案件中，最高法院大法官们殚精竭虑，小心翼翼地标定言论自由的尺度，试图通过一系列判例，在宪法条文、社会现实与价值变迁之间，实现微妙的平衡。这其中，“《纽约时报》诉沙利文案”在推动新闻自由和言论自由，尤其是媒体、公民批评政府官员的自由方面，起到了里程碑式的作用。\n\n二(1)\n今人说起美国宪法中的“言论自由条款”，多以为它巨细靡遗，对形形色色的言论一视同仁，施以保护。然而，根据历史学家的考证，美国建国之初，制宪者之所以在第一修正案中规定“不得立法侵犯 言论自由或出版自由”，更多只是针对英国殖民者的“事前限制”措施，也即出版许可制度。这一观点，受到早期大法官的普遍认同，在司法个案中也有所体现。直到1907年，大名鼎鼎的小奥利弗?温德尔?霍姆斯大法官在审理“帕特森诉科罗拉多州案”（Patterson v. Colorado）时，仍坚持认为，言论自由条款的“主要目的”，在于防范“事前限制”，宪法“并不禁止对那些危害社会安全的言论进行事后惩戒”。\n当然，美国宪法能够沿用至今，并被誉为“活的宪法”，靠的是最高法院大法官们与时俱进，适时根据社会情势变迁，通过灵活解释，不断赋予宪法条文新的含义。到1919年，霍姆斯大法官已改变立场，认为宪法既严禁“事前限制”，也保障言者不受事后追惩，惟一被排除在保护范围之外的，是可能带来“明显而即刻的危险”的言论。后来，受勒尼德?汉德法官、哈佛法学院泽卡赖亚?查菲教授等人影响，霍姆斯进一步解放思想，又为“明显而即刻的危险”标准加上了“迫在眉睫”与“刻不容缓”两个限定，再度拓宽了对言论的保护范围。1931年，最高法院审理“尼尔诉明尼苏达州案”（Near v. Minnesota）时，政府律师詹姆斯?马卡姆试图用霍姆斯1907年的判决意见为打压媒体言论的举措开脱。审判席上，已经九十高龄的霍姆斯大法官微笑着插话：“写那些话时，我还很年轻，马卡姆先生，现在，我已经不这么想了。”\n一个人的司法立场尚能有如此变化，更何况一个群体，一个机构。20世纪20年代之后，在霍姆斯、路易斯?布兰代斯、雨果?布莱克、约翰?哈伦、厄尔?沃伦、小威廉?布伦南等伟大法官的孜孜努力下，言论自由的保护范围不断扩展，对不同类型言论的保障标准，亦逐步确立。按照最高法院的分类原则，言论自由并非绝对，为了保护公共治安与普遍福利，某些言论必须受到限制。如个人不得在法庭作伪证、不得谎报火警引起公众恐慌、不得教唆或悬赏杀人、不得刊登虚假商业广告。淫秽（Obscenity）、挑衅（Fighting Words）、泄恨（Hate Speech）言论也不受宪法第一修正案保护。{参见张千帆：《美国联邦宪法》，法律出版社2011年版，第345页。}\n对言论进行适当限制，当然大有必要，但是，从操作角度看，依法禁止某种言论并不可怕，可怕的是禁止者不给出明确的认定标准，想查禁什么言论，就随意给某种言论贴上禁止“标签”。因此，大法官们的努力，更多集中在列明标准方面，使人们对该说什么，不该说什么，以及相关结果，有一个理性、明确的预期。20世纪中叶，许多文学作品仅仅因为有“淫秽”嫌疑，就被政府随意禁止出版。1957年，大法官们在“罗斯诉美国案”（Roth v. United States）中宣布，淫秽作品不受宪法保护，但是，衡量一个作品是否“淫秽”，必须根据三个原则：首先，按照当代的社区标准，作品是否通篇都在渲染色情趣味；其次，作品是否会对普通人产生不良影响，而不止是对未成年人而言；第三，作品是否没有任何社会价值。这一标准确定后，政府再不能随便以“涉黄”为由，将某本书打入冷宫。{1973年，最高法院在“米勒诉加利福尼亚州案”中，进一步修改了认定“淫秽”的标准：首先，作品放在本地当前的社会环境中判断，主题是否会唤起普通人的淫欲；其次，作品对性行为的描写，是否明显引起人们的反感，而且违反各州相关法律；第三，作品从整体上看，是否缺乏真正的文学、艺术、政治或科学价值。如果答案\n\n二(2)\n全部是肯定的，相关作品就可视为淫秽作品，不受宪法言论自由条款保护。为了进一步缩小“淫秽作品”的范围，“米勒案”否定了“罗斯案”“完全没有社会价值”的判定标准，而以“缺乏真正的文学、艺术、政治或科学价值”取而代之。这么一来，要想认定一部作品“淫秽”，就比过去更加困难了。}《洛丽塔》、《包法利夫人》、《南回归线》、《尤利西斯》与《查泰莱夫人的情人》等传统禁书，终于得见天日。\n与此同时，对言论自由的研究也进入繁荣期，各类学说层出不穷，进而影响到法官裁判。霍姆斯大法官关于“真理只有在思想市场中，才能得到最好的检验”的说法，布兰代斯大法官关于“靠更多言论矫正异议，而非强制他人噤声沉默”的名言，皆源自英国哲人约翰?弥尔顿、约翰?密尔的理论。弥尔顿认为，世上本无绝对真理，只有让不同意见争执冲突，彼此互补，部分真理才有发展为完全真理的可能。密尔提出，一种言论如果有害，就需要更多的言论来校正、稀释、中和，而非厉行禁止，令万马齐喑。这些思想，在《论出版自由》、《论自由》中都有精彩论述，并最终转化为“艾布拉姆斯诉美国案”（Abrams v. United States）、“惠特尼诉加利福尼亚州案”（Whitney v. California）等著名案件的判词。\n进入20世纪，美国哲学家亚历山大?米克尔约翰进一步提出，言论自由并非绝对，可将之划分为“私人言论”与“公共言论”，后者亦可称为“政治性言论”。私人言论与公共事务无关，国会可视其危害程度，决定是否立法限制。但是，公共言论是人民自治的基础，政府不应干预。他在1948年出版的《言论自由与人民自治之关系》（Free Speech and Its Relation to Self-government）一书里，集中阐述了上述理论。尽管私人言论不受宪法保护的说法，日后受到很大争议，米克尔约翰教授也在晚年修正了这一观点，但是，关于政府不应干预公共讨论的理论，却逐步深入人心，最终被布伦南大法官吸纳到“《纽约时报》诉沙利文案”的判决意见中。{按照米克尔约翰早先的说法，私人言论不受宪法保护，与文学、艺术、科学、教育有关的言论都不在宪法保护范围之类，这一观点受到各方质疑。晚年的米克尔约翰接受批评，拓宽了公共言论的范围，认为凡与大众参与民主政治相关，能够增进个人智慧、正直、良知的言论，都属于政治性言论。但是，如此一来，任何言论都成了公共言论，言论自由的保护范围反而更加模糊。后来，罗伯特?博克法官修正了米克尔约翰晚年的结论，认为言论自由保护的言论只限于“纯正、明显的政治性言论”，与教育、文学、艺术、科学相关的言论，以及商业性言论，都不能被视为政治性言论。参见Bork, Neutral Principles and Some First Amendment Problems,47 IND.L.J.1(1971)。泽卡赖亚?查菲教授对米克尔约翰教授观点的批评文章，可参见魏晓阳译：“第一修正案是一只美丽的独角兽：评《言论自由与人民自治之关系》”，载张千帆组织编译：《哈佛法律评论?宪法学精粹》，法律出版社2005年版，第299 314页。}\n“沙利文案”的案情并不复杂。1960年3月29日，《纽约时报》刊登了一则名为“关注他们的呐喊”的广告，广告描述了南部地区肆虐的种族歧视现象，不点名地批评了当地警方打压民权人士与示威学生的行为。但是，由于审查者把关不严，广告部分细节失实。事后，阿拉巴马州蒙哥马利市的警察局长沙利文以诽谤为由，在当地法院起诉了《纽约时报》，法官判令时报作出巨额赔偿。两审失利后，《纽约时报》不得不上诉到最高法院。1964年，大法官\n\n二(3)\n们以9票对0票，撤销了下级法院的裁判。判决指出，在美国，参与公共讨论是一项政治义务，“公民履行批评官员的职责，如同官员恪尽管理社会之责”，因此，除非媒体蓄意造假或罔顾真相，官员不得提起诽谤诉讼。布伦南大法官执笔的判决意见气势恢宏，充分吸纳了米克尔约翰的观点，尤其是那句“对公共事务的讨论应当不受抑制（uninhibited）、充满活力（robusts）并广泛公开（wide-open），它很可能包含了对政府或官员的激烈、刻薄，甚至尖锐的攻击”，成为日后被频繁引用的经典判词。就连2011年宣判的“斯奈德案”，也把这句话作为判决依据。或许，正是因为这番渊源，“沙利文案”宣判后，当有人问九十二岁的米克尔约翰，对判决有何感想时，老先生意味深长地说：“这是值得当街起舞的时刻”。\n\n三(1)\n《批评官员的尺度》讲述的，正是与“《纽约时报》诉沙利文案”有关的故事。{本书原名为Make no law：the Sullivan Case and the First Amendment，直译为《不得立法侵犯：“沙利文案”与第一修正案》，其中，“不得立法侵犯”为美国宪法第一修正案原文，考虑到中国读者并不熟悉这一表述，结合全书主旨，将本书书名改为《批评官员的尺度：纽约时报诉警察局长沙利文案》，特此说明。}当然，如果以为这本书只是就事论事，简单叙述案件始末，显然是小看了作者安东尼?刘易斯。\n刘易斯生于1927年3月27日，是美国著名公共知识分子，也是新闻界“老兵”。他毕业于哈佛学院，1948年进入《纽约时报》工作，历任编辑、记者、驻伦敦记者站主任。1969年至2001年期间，他还兼任时报的专栏作者，至今仍在《纽约书评》设有书评专栏。{刘易斯最新一篇书评是2011年3月为威廉?布伦南大法官的新传记Justice Brennan：Liberal Champion所作。}1964年，最高法院审理“《纽约时报》诉沙利文案”时，三十七岁的刘易斯正好是时报驻华盛顿的“跑线记者”，专门负责与最高法院事务有关的报道，和参与此案的大法官、律师、当事人都很熟悉。这些经历与资源，为他日后写作此书，提供了极好的素材。\n刘易斯布局谋篇、驾驭文字能力极强，擅长设置悬念、以点带面、娓娓道来。1955年，刘易斯因报道一起海军雇员受“麦卡锡主义”迫害事件，第一次获得“普利策奖”。这名雇员也因为这则报道成功复职。这段故事，后来被改编为电影《海军共谍案》（Three Brave Men）。1963年，刘易斯又因对最高法院事务的出色报道，再度获得“普利策奖”。\n刘易斯既精于新闻写作，也是畅销书作家。1964年，他根据著名的“吉迪恩诉温赖特案”（Gideon v. Wainwright），撰写了《吉迪恩的号角》（Gideon's Trumpet）一书。这本书讲述了一个穷困潦倒的囚徒，通过不断给最高法院写信申诉，最终改变美国法律，并成功洗脱冤屈的故事。刘易斯以生动笔触，尽力还原事件全貌，刻画了大时代中小人物的命运。该书出版后，受到社会各界追捧，销量高达80万册，并被改编为同名电影，由大明星亨利?方达主演。{本书已有中译本，即〔美〕安东尼?路易斯：《吉迪恩的号角》，陈虎译，中国法制出版社2010年版。}\n值得一提的是，多年的新闻从业经历，令刘易斯深谙读者心理，他的作品语言平实、通俗，很少使用深奥法理或晦涩术语。即使遇到专业名词，他也会在正文中举例释明，几乎不劳译者费心作注。比如，在《吉迪恩的号角》中，为解释美国联邦与州的双重法律制度，他就举了这样的例子：“以偷车为例。当小偷将停靠在曼哈顿东87街的汽车偷走时，就违反了纽约州法律；如果他驾车通过乔治?华盛顿大桥进入新泽西州，他又会触犯禁止驾驶赃车跨越州境的联邦法律。”三十年后，刘易斯推出《批评官员的尺度》一书时，更将这种化繁为简的能力发挥到极致。\n与《吉迪恩的号角》相比，《批评官员的尺度》视角更为广泛，时间跨度也更大，它以“《纽约时报》诉沙利文案”为叙事主线，串接起美国言论自由的历史，涵盖了独立战争、制宪会议、南北战争、罗斯福新政、两次世界大战、民权运动、越南战争、“水门事件”、“伊朗门事件”等各个历史时期的重要人物与事件。书中既描述了美国建国之初的残酷党争，又涉及最高法院的人事变迁与判决内幕，完美刻画了美国法政人物群像。这其中，既有霍姆斯、布兰代斯、沃伦、布伦南、布莱克等最高法院大法官，也有汉德、格法因等下级法院法官，还包括韦克斯勒、查菲、米克\n\n三(2)\n尔约翰、比克尔等著名律师和学者。更重要的是，这些人当中，不少人是刘易斯的好友，书中许多素材都来自作者与他们的通信、访谈。而与本案判决有关的第一手材料，则由判决意见主笔者威廉?布伦南大法官亲自提供。\n尽管刘易斯本人就是《纽约时报》资深记者，但难能可贵的是，他没有简单站在媒体立场上，渲染绝对的新闻自由。从本书第十七章起，刘易斯结合本案后续发展，对现代媒体的角色、伦理，进行了全面反思，甚至是自我批评，许多观点亦发人深省。比如，为什么“沙利文案”之后，起诉媒体诽谤的案件仍越来越多，标的额也越来越大？为什么媒体与政客、名人对簿公堂时，陪审团甚至广大民众，却宁愿支持权贵？最高法院为保护“公共讨论”，降低了对“公众人物”名誉权的保护规格，可是，一位女明星的酒后口角，与“公共讨论”又有什么关系？有必要动用宪法第一修正案，去保护八卦小报的胡编乱造么？{1967年，最高法院在“沙利文案”基础上，又通过“柯蒂斯出版公司诉巴茨案”（Curtis Publishing Co. v. Butts）宣布，即使诽谤案原告并非政府官员，只要他属于“公众人物”（public figure），也可以适用“《纽约时报》诉沙利文案”确立的规则。}对此，刘易斯指出，现代媒体的权力、影响日益扩大，许多新闻人太把自己当回事，仿佛自己发布的不是新闻，而是真理，如此一来，媒体的所作所为，反会招致公众反感。刘易斯认为，宪法第一修正案的核心目的，是保障人民自由无羁地讨论公共事务，而非只为媒体一家服务。所以，言论自由并不是由媒体一家独享，而是取决于广大人民的理解与支持。否则，就会像罗伯特?博克法官所警告的：“媒体独享某种自由到什么地步，这种自由所受的威胁，就达到什么程度。”{2007年，安东尼?刘易斯在新书Freedom for the Thought that we Hate: A Biography of the First Amendment中，再次强化了上述观点。新书已有中译本，即〔美〕安东尼?刘易斯：《言论的边界：美国宪法第一修正案简史》，徐爽译，法律出版社2010年版。}可以说，本书最后几章的反思性内容，看似与“沙利文案”案情已无太大关联，却恰恰是最有价值的点睛之笔。\n虽然刘易斯从事过多年司法报道，并先后在哈佛大学、哥伦比亚大学讲授“第一修正案与新闻自由”课程，但他本人并非法律科班出身。用他自己的话来说，哈佛法学院一年的“尼曼学者”学习经历，使他获益匪浅。{“尼曼学者”（Nieman Fellow）：是哈佛大学“尼曼基金会”1938年建立的，旨在培训新闻精英的教育计划，该基金每年会从美国本土和世界各国的记者中，遴选20多位佼佼者，组织他们在哈佛大学进行为期一年的学习。}更有意思的是，刘易斯还有一位“法律贤内助”。他的妻子玛格丽特?马歇尔，是马萨诸塞州最高法院首席大法官。2003年的“古德里奇诉公共健康局案”（Goodridge v. Department of Public Health），判决意见就由她主笔。此案首度确认了同性恋婚姻的合法性，引起社会各界轰动。可以想象，刘易斯的著作中，也包含着这位大法官的智慧。套用刘易斯在新书《言论的边界》“致谢”部分的话，玛格丽特?马歇尔对他书中的每一字句，“都提出过专业而充满爱意的批评”。\n\n四(1)\n“《纽约时报》诉沙利文案”涉及不少法律争议。比如，对某一政府部门的批评，是否“指涉且关系到”主管该部门的官员？相关官员能否以个人名义，提起诽谤之诉？对于这类诉讼，法院是否应作为一般侵权案件裁判？媒体行使监督权、批评权时，如果掺杂了不实报道，应如何承担责任？\n认真对照中国当下的社会现实，我们会发现，这些争议和问题，仍具有强烈的时代意义。比如，近年频繁发生的“诽谤”官员案件中，许多地方官员面对媒体或网络上的负面言论，表现出的常常是反戈一击的迅猛，跨省追捕的“豪情”，而非理性宽容与沉稳回应，甚至令“跨省”二字，都成为官员打压网络舆论的代名词。{单是最近几年，较著名案件的就有：重庆彭水县秦中飞案（又称“彭水诗案”，2006年）、山西稷山县薛志敏案（2007年）、内蒙古吴保全案（2007年）、陕西志丹县“短信诽谤案”（2007年）、辽宁西丰县“进京抓记者案”（2008年）、河南灵宝市王帅案（2009年）、山东曹县段磊案（2009年）、宁夏吴忠市王鹏案（2010年），等等。详细统计可参见雷丽莉：“从20起诽谤案件看公权力追究公民言论责任的路径”，载《法治新闻传播》2010年第5辑，中国检察出版社2010年版，第42 46页。} 以至于公安部不得不在2009年4月下发通知，强调侮辱、诽谤案件一般属于自诉案件，应当由公民个人自行向人民法院提起诉讼，只有在侮辱、诽谤行为“严重危害社会秩序和国家利益”时，公安机关才能按照公诉程序立案侦查。{《公安部关于严格依法办理侮辱诽谤案件的通知》指出：“随着国家民主法制建设的不断推进，人民群众的法制意识和政治参与意识不断增强，一些群众从不同角度提出批评、建议，是行使民主权利的表现。部分群众对一些社会消极现象发牢骚、吐怨气，甚至发表一些偏激言论，在所难免。如果将群众的批评、牢骚以及一些偏激言论视作侮辱、诽谤，使用刑罚或治安处罚的方式解决，不仅于法无据，而且可能激化矛盾，甚至被别有用心的人利用，借机攻击我国的社会制度和司法制度，影响党和政府的形象。”至于“严重危害社会秩序和国家利益”，可以作为公诉案件办理的侮辱、诽谤案件包括：（一） 因侮辱、诽谤行为导致群体性事件，严重影响社会秩序的；（二） 因侮辱、诽谤外交使节、来访的外国国家元首、政府首脑等人员，造成恶劣国际影响的；（三） 因侮辱、诽谤行为给国家利益造成严重危害的其他情形。}诽谤公诉屡禁不止，民事侵权诉讼亦屡见不鲜。这其中，既有官员的个人起诉，也有国家机构的单位行为。比如，深圳市福田区人民法院就曾因《民主与法制》杂志的一则报道，以侵犯法院名誉权为由，起诉了这家杂志社，并在深圳市中级人民法院胜诉。{参见“中国新闻侵权案例精选与评析”课题组：《中国新闻（媒体）侵权案件精选与评析50例》，法律出版社2009年版，第12页。冷静：“从法院状告新闻媒体谈起：一起名誉侵权官司引发的思考”，载《北大法律评论》（第二卷第一辑），法律出版社1999年版。} 根据耶鲁大学陈志武教授对210起媒体侵犯名誉权判例的统计，在这类案件中，如果原告是政府官员，媒体败诉率高达71.39%，远远高于原告是普通民众的案件。{参见陈志武：《媒体、法律与市场》，中国政法大学出版社2005年版，第95页。}\n最近几年，国内关于美国宪法第一修正案及言论自由理论的译著、专著已有不少。{与言论自由相关的主要译著包括：〔美〕亚历山大?米克尔约翰：《表达自由的法律限度》，侯健译，贵州人民出版社2003年版；〔美〕欧文?费斯：《言论自由的反讽》，刘擎、殷莹译，新星出版社2005年版；〔美〕凯瑟琳?麦金农：《言词而已》，王笑红译，广西\n\n四(2)\n师范大学出版社2005年版；〔美〕艾布拉姆斯：《第一修正案辩护记》，王婧、王东亮译，上海三联书店2007年版；〔美〕小哈里?卡尔文：《美国的言论自由》，李忠、韩君译，生活?读书?新知三联书店2009版；〔美〕安东尼?刘易斯：《言论的边界：美国宪法第一修正案简史》，徐爽译，法律出版社2010年版。学术专著包括：邱小平：《表达自由：美国宪法第一修正案研究》，北京大学出版社2005年版；侯健：《表达自由的法理》，上海三联书店2008年版；唐煜枫：《言论自由的刑罚限度》，法律出版社2010年版；郑文明：《诽谤的法律规则：兼论媒体诽谤》，法律出版社2011年版，等等。}介绍“《纽约时报》诉沙利文案”案情及其影响的著作、文章也逐渐增多。{比如，萧瀚：《法槌十七声：西方名案沉思录》，法律出版社2007年版，第263 288页；任东来等：《美国宪政历程：影响美国的25个司法大案》，中国法制出版社2004年版，272 290页。}更加值得注意的是，从“沙利文案”及其延伸判例中提炼的规则，已直接体现于国内司法实践。许多法官撰写的民事判决，已开始引入“公众人物”的概念，如“范志毅诉《东方体育日报》案”（2003年）、“唐季礼诉《成都商报》等媒体案”（2004年）和“张靓颖诉《东方早报》案”（2007年），等等。\n在上述案件中，法官偏好用“公众人物”一词，论证媒体监督的正当性与合理性。如“唐季礼案”中的判词：“公众人物较之普通人具有更高的新闻价值，对公众人物的报道会引发社会关注乃至给新闻媒体自身带来更高的知名度和更大的经济利益。新闻媒体为履行其社会舆论监督职责，可以对公众人物的行为进行适度的报道。”以及“范志毅案”中的判词：“在媒体行使舆论监督的过程中，作为公众人物的范志毅，对于可能的轻微损害应当予以忍受。从表面上看，报道涉及的是范志毅个人的私事，但这一私事 属于社会公众利益的一部分，当然可以成为新闻报道的内容。新闻媒体对社会关注的焦点进行调查，行使报道与舆论监督的权利，以期给社会公众一个明确的说法，并无不当。”从这些判词中，依稀可以看到“《纽约时报》诉沙利文案”判决意见的影响。\n但是，根据一些学者的观察与总结，上述包含“公众人物”概念的判决，存在如下共性：首先，原告都是文艺界、体育界或科学界名人，却没有一个是政府官员。其次，案件涉及的法律争议，用民法中的过错责任原则已足以解决，“公众人物”的概念只起辅助性作用，甚至有画蛇添足之嫌。最后，多数案件只与名人的情爱纠葛、丑闻八卦相关，并不关乎“公共事务”。{参见魏永征、张鸿霞：“考察 公众人物 概念在中国大众媒介诽谤案件中的应用”，载徐迅主编：《新闻（媒体）侵权研究新论》，法律出版社2009年版。}美国法官之所以降低对“公众人物”名誉权、隐私权的保护规格，是因为“公众人物”主要是政府官员，允许人民批评“公众人物”，更有利于推动公众、媒体“对公共事务的讨论”。可在我国法官手中，相关概念更多成为装饰判决书的“西式甜点”。当原告是手握实权的政府官员时，舶来理论就不见踪影了。这到底是对“公众人物”的理解不同，还是我们的法院“欺软怕硬”呢？\n也许有人要说，中国是中国，美国是美国，“沙利文案”的裁判依据是美国宪法第一修正案，相关规则对中国没有意义。但是，这些人可能忘了，《中华人民共和国宪法》第三十五条中，同样规定了公民的“言论、出版”自由，第四十一条进一步指出：“中华人民共和国公民对于任何国家机关和国家工作人员，有提出批评和建议的权利。”国务院总理温家宝近年更是多次强调：“国之命在人心，解决人民的怨气，实现人民的愿望，就必须创造条件，\n\n四(3)\n让人民批评和监督政府。”{参见温家宝总理2011年3月14日在中外记者招待会上的讲话。“创造条件，让人民批评和监督政府”也曾在近两年的《政府工作报告》中出现。}一个社会对批评之声有多大的容忍限度，往往标志着这个社会有多高的民主程度。对人民如此，对新闻界亦然。一个成熟的民主政府，就得像默里?格法因法官在“五角大楼文件案”判决书中说得那样，容忍“一个不断找茬的新闻界，一个顽固倔强的新闻界，一个无所不在的新闻界”。{关于这方面的观点，可参见〔美〕迈克尔?舒德森：《为什么民主需要不可爱的新闻界》，贺文发译，华夏出版社2010年版。}\n以宪法条文、国家政策与民主精神为依据，我们有理由对更多现实问题，进行更加深入的思考。比如，在刑法中，是否应删去第二百四十六条第二款，关于对“严重危害社会秩序和国家利益”的侮辱、诽谤行为可提起公诉的规定？{严格意义上讲，涉及广义言论自由的刑法条款，还包括第103条“煽动分裂国家罪”、第105条第2款“煽动颠覆国家政权罪”、第249条“侮辱国旗、国徽罪”、第221条“损害商品信誉、商品声誉罪”、第249条“煽动民族仇恨、民族歧视罪”，对这些罪名的认定，都应当有明确的标准，避免因条文含义模糊而导致打击面过宽。}或者，是否应考虑以司法解释形式，对何谓“严重危害社会秩序和国家利益”做紧缩性的界定？对“被害人”是国家工作人员的侮辱、诽谤类刑事案件，是否应对诉讼程序、证据规格与定罪标准予以进一步限制和明确？{2010年8月，最高人民检察院曾发布《关于严格依法办理诽谤刑事案件有关问题的通知》，要求今后一段时间内，对于公安机关提请逮捕的诽谤案件，受理的检察院经审查认为属于公诉情形并有逮捕必要的，在作出批捕决定之前，应报上一级检察院审批。这一规定，有利于摆脱地方官员对司法机关办理诽谤案件的干扰。}在民事案件中，我们是否应当明确，当国家机构起诉媒体或公民侵犯名誉权时，法院可以驳回其诉讼请求？或立法禁止国家机构提起名誉权之诉或诽谤之诉？{在英国、美国，相关立法禁止国家机构提起民事诽谤诉讼和刑事诽谤诉讼，也根本不存在这类案件。参见郑文明：《诽谤的法律规制：兼论媒体诽谤》，法律出版社2011年版。}是否应将国家工作人员纳入“公众人物”范畴，当他们因职务行为受到批评而提起侵权之诉时，法官是不是应适用更加严格的判断标准？{2006年，部分学者受中国记者协会委托，起草过“新闻侵害名誉权、隐私权新的司法解释建议稿”，“建议稿”关于“公共人物”的条文规定：“人民法院在审理公共人物提起的名誉权诉讼时，只要内容涉及公共利益，被告没有主观恶意，对于公共人物提出的侵权请求，人民法院不予支持。前款所称公共人物的范围一般包括：（1） 依《中华人民共和国公务员法》管理人士；（2） 在事关公共利益的企业或组织中担任重要职务的人士；（3） 文化、体育界名人及其他众所周知的人士；（4） 在特定时间、地点、某一公众广泛关注或者涉及公共利益的事件中，被证明确有关联的人士。”参见徐迅主编：《新闻（媒体）侵权研究新论》，法律出版社2009年版，第338页。}当媒体报道部分失实，却并非蓄意造假时，应如何认定媒体的责任？在这个风云际会的大时代，思考并解决这些问题，是我们这一代法律人的使命。\n翻译本书期间，我曾看过一则关于“广州华侨房屋开发公司诉《中国改革》杂志社案”的新闻报道。在这起案件中，广州市天河区法院驳回了原告的侵权诉讼请求，主审法官在判决书中写道：“衡量新闻机构的评论是否公正，应当从其评论的对象是否与社会公共利益有关、评论依据的事实是否真实存在、评论是否出于诚意来考量。”记者问这位名叫巫国平的法官，为什么在涉及社会公益问题上，法院会更倾向于保护媒体的权利？巫法官回答：“这个社会对媒体的容忍有多大，这个社会的进步就有多大。一个文明、民主、进步的社会，都应当充分发挥传媒的监督作用。”从这些朴素的话语里，我仿佛又听到霍姆斯、布兰代斯、汉德等伟大法官的声音，也感受到一位中国法官的智慧和勇气。\n\n五\n有幸翻译这本好书，得益于北京大学出版社曾健先生的信任。曾健与我都有过警察经历，审美、行文又都偏好“文艺腔调”，也算是臭味相投，相见恨晚。从谈妥版权、文字审校，到版式设计、美编配图，曾健全部亲力亲为，本书亦凝聚着他的智慧和心血。在此，特对蒋浩、曾健、乔智炜、贺维彤和陈晓洁诸君的编校、设计、配图工作表示感谢。\n感谢最高法院的蒋惠岭法官，他最早向我推荐本书，翻译所用原书，亦由他提供。四年来，是他言传身教，让我感受到，为司法改革的理想呐喊、奋斗、行进，本身就是一种美好。感谢最高法院陈现杰、周加海、刘树德、范明志、王晓滨、陈鹏展、付育、姜强、田朗亮诸位法官，以及南京师范大学法学院的屠振宇副教授，我对相关宪法、刑事、侵权理论问题的深入理解，多得益于他们的智慧和指点。\n感谢美国西北大学语言学系的郑晓菊博士，她对照原文，逐字逐句审校了全文，提出了许多精确、中肯的修改意见。最高法院审判监督庭的李英凯法官，也对译稿进行过细致、认真的校对，并指出了用词用典的诸多不当之处。多谢北京市检察院二分院公诉处的刘峰老弟，陪伴我度过北池子南院北楼307那段苦乐交织的时光，并忍受了我在工作、翻译之余的无尽唠叨。\n最后要感谢爱妻王鸿谅。她对我不分昼夜，在电脑前寻章摘句的行为，始终保持宽容态度。翻译，尤其是学术翻译，是一项费力不讨好的事业。没有她的支持，我不会在繁重的工作之余，选择这条无名少利的“窄路”。作为资深记者，她以特有的认真与细致，对本书中的每一字句，“都提出过专业而充满爱意的批评”。\n\n何帆\n2011年6月18日\n于最高人民法院\n\n第 一 章 “关注他们的呐喊”(1)\n故事的开头很普通。1960年3月23日傍晚，约翰?默里来到纽约西43街《纽约时报》总部，联系刊登广告事宜。在二楼广告部，业务员格申?阿伦森接待了他。\n阿伦森已在《纽约时报》工作了近二十五年，按照女儿朱迪的说法，他向来“恪尽职守，兢兢业业”。阿伦森负责受理各类社团委托刊登的广告业务，即所谓“社论式广告”（Editorial Advertisement）。这类广告来源形形色色，形式五花八门。比如，朝鲜领导人金日成，每年都会在《纽约时报》买下两个版面，宣扬自己的“不断革命理念”。有时，阿伦森内心会有一种冲动，想劝人们不要这么大张旗鼓地宣传各种极端思想，但最终还是隐忍不发。\n默里打算在《纽约时报》预约一版广告版面，刊登一则由“声援马丁?路德?金和在南方争自由委员会”发起的“社论式广告”。{马丁?路德?金（1929 1968），美国黑人民权运动领袖，倡导以非暴力方式废除种族隔离，实现种族平等，著名演讲“我有一个梦想”曾深入人心。金于1964年获得诺贝尔和平奖，1968年4月4日遇刺身亡。\n说明：作者注释按原书体例，附录于书后，正文中的注释均为译者注。}此时虽已是20世纪60年代，但南方腹地各州的种族隔离观念，仍根深蒂固。{南方腹地（Deep South）：指位于美国南部，对种族、文化问题态度保守的地区，包括佐治亚州、阿拉巴马州、密西西比州、路易斯安那州和南卡罗来纳州。}各类歧视行为或假法律之名，或直接诉诸暴力。在金博士领导下，挑战上述观念与暴行的民权运动，也正如火如荼。最近一次抗议活动，上月刚刚发生在北卡罗来纳州的格林斯波诺郡。当时，四名黑人大学生打算在当地的伍尔沃思餐厅用餐，由于这家餐厅向来只对白人开放，店员拒绝向黑人供餐。学生们就地静坐，抗议这一种族歧视行径。消息迅速传遍南方，金博士立即表态，支持学生们的行动。然而，两周后，他自己也遭遇司法“暗算”。当他填完1956年至1958年的纳税申报表后，阿拉巴马州一个大陪审团以伪证罪为由，对他提出指控。这可是一项重罪，也是该州历史上第一起逃税案。{大陪审团（Grand Jury）：刑事案件中，由检察官选定并召集的组织，其职责为受理刑事指控，听取控方提出的证据。与普通陪审团不同的是，大陪审团只决定是否将犯罪嫌疑人交付审判，而非认定其是否有罪。英国已于1948年彻底废除大陪审团制度，但美国一直予以保留。根据美国宪法第五修正案，对可能判处死刑或重罪的犯罪，原则上必须经由大陪审团起诉。联邦法院的大陪审团由16~23人组成，各州法院的大陪审团人数由各州法律自行规定。}金博士怀疑这是阿拉巴马州政府故意罗织罪名，令他入罪。\n“声援马丁?路德?金和在南方争自由委员会”成立于纽约，是为了募款援助金博士和其他受迫害的南方黑人而发起的组织。委员会成员包括工会领袖、牧师和演艺明星，如哈里?贝拉方特、西德尼?波伊特、尼特?金?科尔。默里是一位志愿者，考虑到他曾做过编剧，委员会安排他撰写各类广告文案。3月23日，他受命将这则广告从位于125街的委员会办公室送到《纽约时报》总部。\n当时，在《纽约时报》刊登一则全版广告，需要支付4800多美元。默里表示，本来已有一家广告商承诺代理相关事宜，但为节省时间，他希望报社直接将广告文案排版、送印。为此，他出示了委员会主席菲利普?伦道夫的一封亲笔信。伦道夫是“卧铺车侍者兄弟会”的负责人，也是一位杰出的黑人领袖。他在信中表示，联合署名者一致同意以他们的名义刊登这则广告。阿伦森见所有文件都符合要求，便将这则广告转交广告审查部处理。《纽约时报》内部政策规定，凡有欺诈、捏造之嫌，或“对个人进行人身攻击”的广告，\n\n第 一 章 “关注他们的呐喊”(2)\n均不予受理（同时也拒绝刊登色情、淫秽书刊、电影的广告）。广告审查部主管文森特?瑞丁审查完广告文案后，签字同意刊出。{《纽约时报》广告审查部负责审查广告的“可接受性”与“适当性”，文森特?瑞丁是该部门首任主管，《纽约时报》内部沿用至今的“广告接受适当性的准则”（Standards of Advertising Acceptability）即由他制定。关于《纽约时报》内部工作流程，可参见其华裔编辑李子坚的回忆录。即李子坚：《纽约时报的风格》，长春出版社1999年版。}\n1960年3月29日登出的这则广告，使用了大字标题，题为：“关注他们的呐喊”（Heed Their Rising Voices）。此话援引自《纽约时报》3月19日的社论，广告右上角还引述了社论内容：“由黑人发起的这次和平示威声威日壮，虽在南方前所未有，却事出有因，值得同情 恳请国会关注他们的呐喊，因为世人终将听到他们的心声。”接下来是广告正文。\n“今天，全世界都知道了。”广告说，“美国南方数以千计的黑人学生，正发起一次和平示威游行，宣布黑人同样受美国宪法和 权利法案 保护，并享有人格尊严与生存权利。他们遭遇了前所未有的粗暴对待，施暴者正是那些蔑视并践踏宪法的人。”\n接下来，广告描述了发生在南方的种族主义行为。第三段说：“在阿拉巴马州蒙哥马利市的州议会厅前，当学生唱完 我的国家，也是你的 这首歌后，学生领袖随即被校方开除。而且，一大批荷枪实弹，携带催泪弹的武装警察，严阵以待，并包围了阿拉巴马州立学院。当所有学生以罢课方式，抗议州政府滥用公权时，警察封锁了学校食堂，试图用饥饿迫使他们就范。”\n广告并未对任何人进行指名道姓的批评，而是以“南方违宪者”（Southern Violators of the Constitution）指代相关人员。广告说，他们“决定干掉的不是别人，正是风靡南方的新精神之象征 小马丁?路德?金牧师 ”广告文案第六段更进一步说明：“对于金博士的和平抗争，南方违宪者一而再、再而三地用暴力、威胁回应。他们炸毁了金博士的家，差点儿杀死他的妻儿；他们抹黑他的名声；甚至用 超速 、 侮辱 、 游荡 等不同罪名先后逮捕他七次。现在，他们又用 伪证罪 起诉他，这可是一项能使他入狱十年的重罪。”\n文案的下方，列出了六十四位联合署名者名单，其中，埃莉诺?罗斯福{埃莉诺?罗斯福（1884 1962），美国前总统富兰克林?罗斯福的夫人，她本人也是一位著名政治家和社会活动家。}与杰基?罗宾逊{杰基?罗宾逊（1919 1972），美国职业棒球大联盟历史上第一位黑人球员。}都是广告赞助人。名单下方还附有一句话：“我们身在南方，我们每日都在为尊严与自由而战，我们由衷支持这一呼吁。”紧随其后的，是一份二十人名单，其中多数是南方黑人牧师，置于右下角的则是一张供读者捐款的回执。广大读者踊跃捐款，没隔多久，委员会就收到了数倍于广告费的捐款。\n无论对默里、阿伦森，还是其他经手这则广告的人来说，此事已告一段落。不过，他们万万没有想到，“关注他们的呐喊”会在种族议题之外，掀起另一轮更大的争议。他们更未料到，这则广告将成为对美国言论和出版权利的一大考验。更让他们始料未及的是，这起事件将演变为一座自由的里程碑。但是，一切就这么发生了。1\n这则广告只是一个开始，而非结束。一场法律与政治的严重冲突即将开始。这场冲突将威胁到《纽约时报》的生存，也危及媒体报道重大社会议题的自由，乃至公众的知情权。四年后，靠美国最高法院的转折性判决力挽狂澜，所有威胁才烟消云散。过去，最高法院通过行使司法审查权，已确立一系列涉及人民生活\n\n第 一 章 “关注他们的呐喊”(3)\n方方面面的基本准则。但是，在这起事件中，最高法院不仅重申美国是一个开放社会，也让人民了解到，他们有权对政府表达自己的意愿，更重要的是，这起案件，使1791年发布的宪法第一修正案中那寥寥几个单词，焕发出新的活力：\n“国会不得立法 侵犯言论自由或出版自由。”\n（Congress shall make no laws...abridging the freedom of speech，or the press.）\n\n第二章 蒙哥马利的反击(1)\n1960年，《纽约时报》日发行六十五万份，其中，只有三百九十四份被送到阿拉巴马州的报摊或订户手中。蒙哥马利市的《广告报》及姊妹报《阿拉巴马纪闻》订阅了一份《纽约时报》，新报纸往往会在出报数日后，才被送到编辑部。这里有一位《纽约时报》的忠实读者，有时甚至是唯一读者，年轻的《阿拉巴马纪闻》地方版编辑：雷?杰金斯。\n“那天，我正趁编版间隙浏览《纽约时报》。”多年之后，杰金斯回忆道，“我看到了那则广告，并据此写了一篇报道。”3这则报道刊登在1960年4月5日的《阿拉巴马纪闻》上。文章开头说：“包括埃莉诺?罗斯福女士在内的六十位知名自由派人士，近日在《纽约时报》的一则全版广告上联合署名，呼吁人们为 声援马丁?路德?金和在南方争自由委员会 捐款。据悉，德克斯特大街浸信会教堂前牧师小马丁?路德?金因涉嫌伪证罪，将于五月出庭受审。这位黑人牧师目前住在亚特兰大 ”\n杰金斯列出了部分联合署名者的姓名，并援引了数段广告内容。比如，民权运动人士“遭遇了前所未有的粗暴对待”。报道还说：\n“广告对事实的描述，有些与真相不符，有些未经证实。广告说，阿拉巴马州立学院的黑人学生领袖在州议会厅前唱完 我的国家，也是你的 之后，就被校方开除。事实上，这些学生是因为领导静坐抗议才被开除的。”\n“广告还说： 当所有学生以罢课方式抗议州政府滥用公权时，警察封锁了学校食堂，试图用饥饿迫使他们就范。 校方认为上述说法 纯属无稽之谈 。尽管春季入学登记确实出了些状况，但学校食堂从来没有被封锁过。”\n杰金斯后来回忆，他的报道在《阿拉巴马纪闻》刊出后，《广告报》编辑格罗夫?克利夫兰?霍尔“骂骂咧咧地冲进编辑部，嚷嚷着要看那则惹是生非的广告”。随后，霍尔将那期《纽约时报》拿回自己办公室，边读边骂。\n霍尔的父亲是《广告报》内著名的改革派，曾因一篇抨击三K党的社论，荣获1926年的普利策奖。霍尔本人对种族问题的立场比较复杂。他极力维护南方现行种族制度，却又对推行种族隔离措施过程中出现的极端主义、暴力行为深恶痛绝。4《纽约时报》那则广告刊登一个月前发生的一件小事，颇能看出他的立场。1960年2月27日，南方各地爆发静坐运动。有流言称，一些黑人学生将到蒙哥马利市的餐厅用午餐。消息传开后，一些手握棒球棍的白人开始在街头游荡，四处寻找民权人士，结果却一无所获。但是，还是有人殴打了一位黑人妇女。第二天，蒙哥马利《广告报》不仅刊出记录暴行的照片，还在图说中点出施暴者姓名，并指责现场警察袖手旁观，无所作为。\n蒙哥马利市警察局长L.B.沙利文，看到这些照片与图说后，公开批评了《广告报》的报道。{沙利文当时是蒙哥马利市主管警政、消防、墓葬事务的市政专员（City Commissioner），客观上也行使着警察局长的职权，这里为方便国内读者理解，将其职务译为警察局长。}霍尔回应说：“沙利文不应死盯着扛相机的记者，他更应该关注那些手握棒球棍的白种男人。”不过，霍尔谴责的不止是那些“白人恶棍”，还包括“鲁莽、无知的黑鬼学生”。（沙利文在第二年的“自由乘车运动”中亦扮演了关键角色。{自由乘车运动：1961年5月4日，七位黑人、六位白人为抗议公共汽车及候车室内的黑白隔离措施，从华盛顿乘灰狗长途车赶往密西西比州首府杰克逊市。汽车行进到阿拉巴马州伯明翰市、蒙哥马利市等地时，当地白人向车上的人发动袭击，导致多人受伤。四个月后，州际公共汽车及候车室内的种族隔离措施被取消。马丁?路德?金由于拒绝支持上述示威行动，受到黑人民权运动内部一些激进人士的批评。}当时，沙利文曾承诺，“自由乘客”［Freedom Riders］抵达蒙哥马利市时，自己会\n\n第二章 蒙哥马利的反击(2)\n保证他们的安全。但是，1961年5月20日，当“自由乘客”乘坐的大巴抵达时，沙利文却命令警察撤离公交总站。一群手持棍棒的白人暴徒包围了那里，打伤了许多乘车者，伤者包括司法部长罗伯特?肯尼迪的助手约翰?希根塔克勒。事后，沙利文很快现身，并对记者说：“我看到三个人躺在街上。两个黑鬼和一位白人。”）\n金博士很欣赏霍尔这篇谴责蒙哥马利市种族暴力行为的社论。他在《迈向自由》一书中写道：“我读到霍尔铿锵有力的声明后，非常钦佩这位绝顶聪明，却立场纠结的人士。此君公然支持种族隔离，但反对以此名义实施暴行。”\n其实，霍尔很看不上国内媒体对这类事件的报道，那么多记者放着北方大城市紧张的种族关系不顾，却跑到南方来搅浑水、凑热闹，实在令人不齿。1958年，他在芝加哥一次媒体座谈会上表示：“国内在处理种族事务上之所以那么不理智，其根本问题在于，美国媒体在报道北方的种族问题时，根本不像对待南方事务时那样热衷和投入。”\n《纽约时报》的广告触动了霍尔的敏感神经。4月7日，他在《广告报》上发表了一篇气势汹汹的社论：“世上有两类说谎者，一类主动撒谎，一类被动为之，这两类说谎者在3月29日《纽约时报》的整版广告中，粗鲁地诽谤了蒙哥马利市。”社论引述了广告的第三段，也即学生被校方困在食堂外那段内容。“谎言，谎言，谎言，”霍尔写道，“这就是些一心想募款的三流小说家捏造出来的故事，好欺骗那些偏听偏信、自以为是、以讹传讹的北方佬。”\n接着，霍尔援引一百年前的南北战争、废奴运动为例，评价道：“共和国已因为这些歇斯底里、撒谎成性的废奴煽动者们，付出了沉痛代价。这则广告的作者，绝对是废奴主义者们的孝子贤孙。”\n蒙哥马利市警察局长沙利文，也正认真研究这篇社论。第二天，他寄了封挂号信给《纽约时报》（那天是4月8日，他把发信日期误写为3月8日）。沙利文提出，广告指控他“严重失职”，指责“蒙哥马利市警方处置不当、玩忽职守”，因此，《纽约时报》应尽快“发布声明，撤回之前那荒谬不经的诽谤性言论”。\n当天，沙利文还将同样内容的信寄给四位黑人牧师，他们的姓名也在那则广告的二十人名单上。四位黑人牧师都住在阿拉巴马州，他们是：蒙哥马利市的拉尔夫?阿伯内西和S.S.西伊，伯明翰市的弗雷德?沙特尔沃思，与莫比尔市的J.E.洛厄里。他们后来作证说，在收到沙利文的来信前，根本没听说过这则广告。显然是有人未经许可，擅自使用了他们的姓名。\n《纽约时报》的法律事务，当时由洛德、戴&洛德律师事务所代理。4月15日，这家律所回复沙利文说：“我们颇有些迷惑 您凭什么推断广告上的声明是在影射您呢？”毕竟，广告压根儿没提到“沙利文”几个字。不过，回函仍然表示，《纽约时报》已着手“调查此事”。调查开始后，《纽约时报》在蒙哥马利的特约记者唐?麦基迅速提交了调查报告。调查结果表明，除了警察封锁学校食堂，“试图用饥饿迫使学生就范”之说无法查证，广告其他说法“完全属实”。回函指出，由于“我们的客户《纽约时报》向来注重真相，有错必纠”，相关调查将继续进行，“也烦请沙利文先生告诉我们，究竟这则广告什么地方冒犯了您？”\n沙利文没有答复，至少未书面回函。4月19日，他在蒙哥马利市巡回法院（属于阿拉巴马州属法院）提起诉讼，控告《纽约时报》及在广告上署名的四名黑人牧师涉嫌诽谤。沙利文诉称，广告第三段提到蒙哥马利市的部分，以及第六段提到对付金博士的“南方违宪者”部分，是对他本人的诽谤，他要求索赔50万美元。\n05月9日，阿拉巴马州州长约翰?帕特森致信《纽约时报》，提出与沙利文同样的要求。他说，广告指控他“作为阿拉巴马州州长及前教育厅厅长 严重失职”。与沙利文一\n\n第二章 蒙哥马利的反击(3)\n样，他也认为广告第三段与第六段存在问题。其实，此信无非是起诉的前奏，因为根据阿拉巴马州法律，政府官员若想提起诽谤之诉，必先申请更正，否则，就不能索要惩罚性赔偿金。\n一周后，《纽约时报》刊文向帕特森州长致歉，题为“时报撤回广告声明”。文章除了转述帕特森的抗议内容，还附加了报社一段声明：\n《纽约时报》此则广告，系合法广告代理商依正常流程办理，且由知名人士付费刊载。广告并非《纽约时报》的新闻报道，也未承载本报编辑任何意见或观点。广告刊出后，《纽约时报》已展开调查，并秉承本报撤销并更正不实报道或虚假消息之原则。据此，本报撤销阿拉巴马州州长提出异议的两段文字。《纽约时报》从未打算借广告中伤尊敬的约翰?帕特森先生，也未质疑他作为州长及前教育厅厅长的领导能力，更未指控他“严重失职、处置不当或玩忽职守”。为避免读者从广告声明中推断出不当结论，《纽约时报》谨向尊敬的约翰?帕特森州长致以诚挚歉意。\n这一天，也即5月16日，《纽约时报》总裁奥维尔?德赖富斯致信帕特森州长。他附上报纸刊登的致歉声明，并再次道歉：“为避免读者从广告声明中推断出不当结论，《纽约时报》谨向阁下致歉。”可是，两周后，帕特森州长还是告上法庭，要求100万美元的赔偿。与沙利文一样，他也把《纽约时报》与四位黑人牧师列为共同被告。不过，他在被告名单上又加了一个人：金博士。除了沙利文与帕特森，又有三人陆续加入原告阵营，他们是：蒙哥马利市市长厄尔?詹姆斯、市政专员弗兰克?帕克斯、前市政专员克莱德?塞勒斯，他们每人要求《纽约时报》和四位黑人牧师赔偿50万美元。\n四位牧师之所以与《纽约时报》一起惹上官司，完全是原告方的诉讼策略。原告律师这么做，是为避免《纽约时报》申请将本案从州法院移至联邦法院管辖。因为按照美国宪法，诉讼双方当事人来自不同州时，类似诽谤官司这样的普通民事案件，可由联邦法院审理。这么规定的目的，是为防止A州公民在B州受到不公正待遇。案件移送至联邦法院，可保证法官公正、中立地审理案件。但是，如果A州公民控告B州公民，但被告中也有A州公民时，案件可以不必移至联邦法院审理。阿拉巴马州的官员们正是借助这一策略，争取到本州法院对这起诽谤案的管辖权。\n仅仅因为刊登“关注他们的呐喊”这则广告，《纽约时报》就将面临总计300万美元的诽谤赔偿。在那个年代，这笔钱实在是个天文数字。《纽约时报》管理层与代理律师们，根本无法说服原告方撤诉。更可怕的是，阿拉巴马州法院的法官与陪审团们，也正对这份介入种族问题的北方报纸虎视眈眈。\n\n第三章 南方的忧伤(1)\n南部生活，顾名思义，总能让人联想到白色柱廊的净雅庄园、友善和蔼的白人家庭、满脸堆笑的黑人仆役。然而，种族隔离的现实，绝非田园牧歌一般惬意悠闲。马丁?路德?金博士曾以亲身经历，说明现实状况的残酷。一次，他与一群号称同情黑人遭遇的白人同行，这些人竟要求金博士放慢脚步，走在他们身后。1963年，金博士因在阿拉巴马州伯明翰市领导抗议游行而入狱，当地八名白人牧师痛批游行“不合时宜”。他为此写信给他们，这就是后来著名的“伯明翰狱中信札”。\n“那些从未感受过种族隔离之苦的人，很容易轻言 等待 ，”金博士写道，“但是，当你目睹暴徒对你的父母滥用私刑 当你试图向六岁的女儿解释，为什么她不能像电视广告里那样在公园嬉戏玩耍，却怆然词穷 当你驾车远行，却发现没有一家旅店愿意让你留宿，而你不得不蜷在车上夜复一夜 当你日复一日被 白人 和 有色人种 这样的标签字眼所羞辱 你就会了解， 等待 为什么对我们那么艰难。”\n种族歧视现象在美国比比皆是。但南方的情况却更为恶劣，因为在那里，种族歧视受法律认可与保障。根据南方各州州法，黑人由生至死，都被打入社会底层。从医院呱呱落地，到墓地入土为安，法律对他们设置了重重隔离屏障。黑人小孩只能在教学质量低劣的公立学校就读。警察虎视眈眈，不许黑人进入绝大多数旅馆、餐厅，就连搭乘公车，他们也只能屈居车厢后座。而且，由于多数南方地区的黑人被剥夺了投票权，他们的诉求根本无法在立法中体现。\n政府借公权力实施种族隔离的情形，绝非只在南方偏远地带发生。直到20世纪中叶，华盛顿特区各大餐厅仍禁止黑人入内进餐，更不许他们在影院观影。在南方十七州，以及哥伦比亚特区，多数公立学校仍执行种族隔离政策，只有40%的学校招收黑人学生。“二战”期间，尽管黑人可以应征入伍，却被单独列编。联邦政府推行的种族隔离政策，直到1948年才由哈里?杜鲁门总统终结。\n美国的立国之基，明明是“人人生而平等”，为什么种族隔离之法却能公然存在，而且根深蒂固呢？答案只能从历史深处探寻。{关于美国黑人民权运动的历史，参见〔美〕埃里克?方纳：《给我自由！一部美国的历史》，王希译，商务印书馆2010年版。}1619年，第一艘载满非洲奴隶的商船在北美弗吉尼亚靠岸，到1776年南方各州独立后，奴隶制已成为南方各殖民地种植产业发展的关键因素。现代历史研究的成果，进一步揭示了奴隶制经济的丑陋真相：贩卖奴隶，在当时简直是一本万利的行当。1787年，制宪会议召开时，南部地区为维护奴隶制度，积极游说各州代表，试图保留蓄奴条款。宪法第一条要求，众议院在计算各州人口时，应以“自由民人口之和”加上“其他人口数的五分之三”。也就是说，一个奴隶，只能算作3/5个人。1808年之前，尽管宪法回避使用“奴隶”字眼，而以“现存于各州，有望获得承认的移民或外来人口”指代这一人群，却不许国会立法禁止国际奴隶贸易。最后，宪法要求废奴州必须应原主要求，将逃亡过来的奴隶直接遣回。1857年，最高法院首席大法官罗杰?坦尼在“德雷德?斯科特案”{最高法院在该案中判称，被贩卖到美国的非洲奴隶后裔，不论其是否已解放成为自由人，均不能算作美国公民，不能享有美国公民的权利，也不受美国宪法保护，除非政府授予其权利或特权。亚伯拉罕?林肯总统曾多次抨击该判决，他曾说：“房屋分成两半就会倒塌。我相信，在半是奴隶半是自由民的国家里，政府也长久不了。”}中，援引宪法条文，直斥非洲后裔是“卑贱、劣等人种”，不能算美国公民。\n南北战争改变了历史，或者说，使社会向新的趋势发展。起初，南方各州宣布脱离联邦。1861年2月4日，南部各州代表齐聚阿拉巴马州蒙哥马利\n\n第三章 南方的忧伤(2)\n市，决议加入美国邦联。战争随即爆发，诱发战事的原因不仅在于南北经济差异，还涉及双方对奴隶制的不同认知。北方最终决定彻底抛弃奴隶制。1863年，林肯总统发布《解放宣言》，宣布解放南部邦联的奴隶。战争结束后，国会于1865年通过宪法第十三修正案，明令禁止奴隶制。{美国宪法第十三修正案规定：“一、 除非是对已通过正当程序判刑的罪犯的处罚，无论奴隶制还是非自愿劳役，都不得存在于联邦境内及其管辖的任何地方。二、 联邦议会有权通过适当立法贯彻此条。”}\n南方虽然战败，却并未放弃压迫黑人的想法。南部各州很快通过所谓“黑人法典”，继续钳制脱离奴隶身份者的自由。例如，某些地方规定，黑人只有获得特别许可，方可务农耕种，甚至禁止他们拥有土地。1866年，国会为推翻“黑人法典”，通过了第一部“民权法案”。法案规定，黑人与白人一样，有权“订约、履约、兴讼、结社、作证、继承、购物、租赁、出售、持有或转让不动产及其他私人财产 一旦违法，亦应接受刑罚、罚金，并受法律、条例、训令、规章与习惯法之约束”。\n1868年，美国宪法增补了第十四修正案。修正案规定联邦政府有权保护公民个人免受各州歧视或侵害。修正案宣布，凡出生或归化联邦，遵守联邦法律之人，就是联邦公民，也是他们所居住州之公民，这无疑推翻了坦尼首席大法官在“德雷德?斯科特案”中的判词。修正案明确指出：“任何一州 未经正当法律程序，不得剥夺任何人的生命、自由和财产，在该州司法辖区内，不得否认任何人受法律平等保护的权利。”\n那么，上述语意宽泛的条文，对权利仍处南方法律钳制下的黑人们，究竟意义何在？1880年，最高法院通过“斯特劳德诉西弗吉尼亚州案”的判决，给出了决定性的答案，或者说，是一个近乎决定性的答案。根据西弗吉尼亚州法令，黑人不得被遴选为陪审员。最高法院宣布这部法律违宪，威廉?斯壮大法官援引宪法第十四修正案称：“既然已宣布黑人白人在法律面前一律平等，为什么还要维持这样的法令？ 仅仅因为肤色不同，就禁止有资格的美国公民出任陪审员，这是对他们的侮辱，是把他们视为劣等种族，这是鼓励种族偏见。”8\n但是，“斯特劳德案”判决很快被政治风潮裹挟，正义再次蒙受羞辱。三K党和其他南方种族势力转而诉诸暴力。北方的政客们也意识到，除非强力干涉，黑白同权根本无法实现。他们试图甩开种族包袱，将政治重心转移到振兴北方工业上。主导北方的共和党人不再执著于解放奴隶的宏大理想，逐步默认了白人与黑人间的阶层关系，不少人甚至向往起“旧式南方”的生活。1876年大选中，民主党人塞缪尔?蒂尔登与共和党人拉瑟福德?海斯竞选总统，选举结果因计票纠纷而“难产”。最后，还是靠共和党人组成的特别委员会大力支持，海斯才以一张选举人票之差当选总统。这一结果，其实是政治妥协的产物。作为获胜的回报，共和党允许南方自行处理种族事务。{拉瑟福德?海斯1865年当选为国会议员，1868年当选俄亥俄州州长，以“为人正直和办事有效率”著称。1876年被共和党提名为总统候选人。这次大选导致美国历史上最大的一次计票纠纷，最后，由国会议员和最高法院大法官组成的特别委员会裁定海斯获胜。由于共和党最终答应了民主党提出的部分先决条件，海斯在总统就职日前两天，才被宣布为合法总统。海斯上任后，撤回了北方在南部各州的驻军，南方黑人的权益再次失去保障。}\n1880年代末，南方各州议会再次推出压制黑人权利的法令，新法不像“黑人法典”那么高调，桎梏力度却更胜一筹。这类被称为“吉姆?克劳法”的法律，将种族隔离范围从火车延伸到所有公共场所。{吉姆?克劳法：泛指美国南部各州自1870年代开始制定的，对黑人实行种族隔\n\n第三章 南方的忧伤(3)\n离或种族歧视的法律。吉姆?克劳原是19世纪上半叶黑人歌舞剧中一首歌曲的名称，剧中扮演反叛者的黑人在歌词中曾用吉姆?克劳的名字，以后就成为对黑人的蔑称。这种法律实质上是美国内战结束后南部各州白人种族主义政府所制定的“黑人法典”的继续，主要内容是通过征收人头税、选举登记、文化测验、仅容许白人参加预选、“祖父条款”（即法律规定本人或其祖辈在1867年参加投票者才享有选举权）等手段，剥夺黑人选举权；并在学校、住区、公共交通、公共场所（包括旅馆、剧场、公园、教堂、医院、娱乐体育场所等）以及就业、司法、军役、婚姻等各方面，实行种族隔离和种族歧视。}国会这次偃旗息鼓，并未推出平权法案应对。面对当时的政治气氛与主流舆论，最高法院也开始见风使舵。\n1896年，最高法院在“普莱西诉弗格森案”中，宣布路易斯安那州采取的种族隔离措施，并未侵犯宪法第十四修正案规定的“受法律平等保护的权利”。9案件当事人霍默?普莱西是位拥有八分之一黑人血统的美国公民，因在路易斯安那州踏入白人专用火车车厢而被捕。他上诉辩称，相关法律违反了宪法平等保护条款，但最高法院却以7票对1票宣布州法合宪。亨利?布朗大法官代表多数方撰写了判决意见，指责普莱西的诉求是无稽之谈，认为他这么做，是把“种族隔离措施看作为有色人种贴上了低劣阶层的标签”。其实，正如“斯特劳德案”判决所言，立法隔离黑人，“就是在他们身上打下烙印”。宪法第十四修正案的字面含义与社会现实之间，仍有十分漫长的距离。\n约翰?马歇尔?哈伦大法官忧心忡忡地在异议意见中写道：“这样的法律一旦通过，必将播下种族仇恨的种子。州政府不但支持隔离之法，还把试图在公共场所与白人同坐一张长凳的黑人送进监狱，还有什么会比这么做更能煽起种族仇恨？还有什么比这么做更容易加剧种族间的不信任？大家都很明白，路易斯安那州通过这样的法律，无非是想制造“平等”假象。但这又骗得了谁呢？这简直是弥天大错。”\n一切正如哈伦大法官所料，在最高法院纵容下，种族隔离愈演愈烈，甚至有法可依。之后数十年间，南方各州将黑人完全逐出白人惯常出入的公共场所。“黑白同权”成了自欺欺人的说法。黑人默默死去，仅仅因为白人医院将他们挡在门外。至于投票权与其他基本民权，黑人更是不敢奢望。州政府为黑人选民登记设置了五花八门的障碍，如识字测验、解释州宪含义，而负责选民登记的官员，多是些有强烈种族偏见的白人。南方各州的民主党人在各项重要选举之前，也会将黑人排除在选民阵营之外。\n20世纪已过去数十年，种族主义对人类社会的危害，几乎成为普世公论。纳粹暴行带给世界的冲击，更是触目惊心。尽管有“普莱西诉弗格森案”判决撑腰，但谁若直接说南方的种族歧视做法符合宪法，肯定要受人耻笑。可笑的是，南方的白人政客硬是把“普莱西案”确立的规则视为“尚方宝剑”。结果，直到20世纪中叶，国会仍对南方的政治体制网开一面。但凡国会想就民权问题出台立法，如以联邦法律禁止私刑，南方议员们都会以“阻挠议事”（Filibuster）的方法来阻击，使相关法律无法进入表决环节。{阻挠议事：也被称为“冗长演说”，是美国国会一种特殊的运作方式，目的在于通过不停地发表演说，阻止将正在审议的议案或人事提名交付表决，一般由少数派议员使用。阻挠议事法来源于参议院的议事规则，即参议院只有在所有参议员都发言完毕后才能进行表决。只要有人要求发言，主席就必须同意，如此一来，议员通过不停地发言，就可以阻止投票。根据相关规则，进行“冗长演说”的议员可以吃饭，可以喝水，但不能坐下，也不能离开会议大厅，一旦交回发言权，就不能索回。如果违反上述规则，其他议员就可以提出表决或其他要求，\n\n第三章 南方的忧伤(4)\n主席即可采纳，“冗长演说”即告失败。}\n1954年，种族隔离的法理基础被击垮了。最高法院九位大法官在“布朗诉教育委员会案”中一致裁定，公立学校的种族隔离措施违宪。首席大法官厄尔?沃伦并未明说1896年的“普莱西诉弗格森案”是应被推翻的不当判决，对此他说，最高法院无法令时光倒流，但他在判决意见中明确写道，“在教育机构推行种族隔离原本就是不公正的”。10\n“布朗案”判决犹如一阵惊雷，震撼了社会各界，并激起了南方白人的强烈反弹。旧南部邦联在参众两院的十一名议员联合发布“南方宣言”，声称“最高法院在没有任何法律依据的情况下，滥用司法权力，将个人政治理念与社会立场凌驾于国家法度之上”。{南部邦联：美国南方的十一州曾于1861年组成南部邦联，以维护奴隶制与州权。邦联后来发动了南北战争，战败后，南部邦联于1865年解散。}\n判决同样激起南方黑人的愤怒。他们认为，最高法院既已发声，“权利平等”理当落到实处，黑人被奴役的不公局面必须被打破。\n黑人觉醒后的第一波示威浪潮，发生在南部邦联的起源地：阿拉巴马州的蒙哥马利市。1955年12月1日晚上，黑人女裁缝罗莎?帕克斯下班后搭公车回家，她非常疲惫，就近坐在车厢前部。司机令她给一个白人让座，并坐到车后去。帕克斯女士拒绝这么做，警察赶来逮捕了她，并指控她违反种族隔离法。\n帕克斯女士被捕后，蒙哥马利市的黑人民众发起抵制公车运动。在一年多的时间里，大家宁愿步行数英里上下班，或者选乘教会专车，也不搭乘本市公车。领导这场运动的，正是金博士。当时他只有二十七岁，只是蒙哥马利市右街浸信教会的一位名不见经传的牧师。而这场运动却让他名声大振，甚至成为全球知名人士。他呼吁黑人同胞们效仿印度“圣雄”甘地，用非暴力方式对抗压迫。“即使我们每天都有人被捕，”他告诉大家，“即使我们每天都被剥削被蹂躏，也别让任何人逼着你放低身段去仇恨他们。我们用 爱 做武器。我们必须对仇视我们者抱以同情、包容之心。我们必须认识到，那些仇视我们者，并非天生如此，而是被教导仇恨我们。我们在黑夜屹立，我们必将迎来黎明。”11\n金博士的话并未消解种族主义者的敌意。他因涉嫌非法煽动抵制公车而被定罪。抵制公车引起的官司一直打到最高法院，大法官们的判决结果表明，“布朗案”的裁判思路并不局限于教育领域，蒙哥马利市公车上的种族隔离措施被判定违宪。1956年12月21日，公车上的“黑白同乘”终于成为现实。\n“布朗案”对北方民众也产生了很深的政治影响。人们首次关注到南方泛滥的种族主义。许多全国性的报纸、杂志和广播节目，开始大篇幅报道南方的种族冲突情况。1957年，国会通过1875年以来的第一部“民权法案”。尽管相关条文力度有限，但它推动创立了民权委员会，允许司法部对侵犯选举权的案件启动调查。立法推进至此，显示整个国家的政治气候正发生变化。\n然而，南方黑人的命运并未很快得到改善。白人对平权措施的抵制愈演愈烈。许多社区成立了“白人公民委员会”，他们通过群体集会、政治呼吁和经济施压，希望政客与利益集团维持种族隔离现状。面对重重暴力与威胁，黑人希望各级法院尽早兑现他们的权利。“布朗案”判决六年后，在阿拉巴马、密西西比、佐治亚、路易斯安那和南加利福尼亚诸州，没有一位黑人被准许进入公立学校或大学就读。在南方腹地各州，意欲投票的黑人，很可能被殴打或刺杀。1960年代末，密西西比州适龄黑人选民中，只有4%被纳入选举名册，阿拉巴马州也只有14%。\n阿拉巴马与密西西比两州对种族平权的抵制最为强烈。1956年，阿拉巴马州屈从于联邦压力，不得不在高等教育领域取消了种族隔离措施。黑人女性奥瑟琳?露西在联邦法院指令\n\n第三章 南方的忧伤(5)\n的护佑下，得以进入阿拉巴马州立学院就读。但是，由于其他学生骚动抗议，校方不得不将她逐出校园。{除了学生闹事，当地暴徒亦以露西入学为借口，在当地发动骚乱，如焚烧十字架，挥舞南部邦联旗帜，攻击黑人驾驶的汽车。1957年，阿肯色州州长奥瓦尔?福布斯为阻止黑人学生到小石城中心高中就读，动用州国民警卫队封锁街区、校园。为维护联邦法律的尊严，艾森豪威尔总统派出101空降师进驻小石城，解除了国民警卫队的武装，并护送九名黑人学生入校。但是，直到艾森豪威尔离职，旧南部邦联各州内，也只有不到2%的黑人学生在废除了种族隔离的学校就读。}露西再次向联邦法院求助，希望能重返校园。校方被她以诉讼维权的做法激怒，干脆以“道德败坏”为由开除了她。艾森豪威尔政府始终无所作为，这起案件亦无果而终。\n即便是由联邦掌控的州际交通，也未能逃脱种族隔离措施的侵扰。1961年春天，部分民权运动人士搭乘公车，赶赴阿拉巴马州抗议种族隔离措施。这些被称作“自由乘客”的人刚刚来到伯明翰与安妮斯顿，就遭遇白人暴徒的袭击。肯尼迪政府担心赶往蒙哥马利市的另一组“自由乘客”再度受袭，调遣了五百名联邦法警沿路护卫。此举激怒了阿拉巴马州州长约翰?帕特森，认为联邦法警的出现，是“对州权的粗暴蹂躏和侵犯”。12“自由乘客”来到蒙哥马利市时，金博士恰好回乡省亲。白人暴徒包围教堂时，他正大谈“非暴力抵抗”之道。若非联邦法警及时出手，他与听众很可能已死于棍棒之下。\n1960年4月12日，也即“关注他们的呐喊”广告发布两周后，《纽约时报》又在头版刊出一则题为“恐惧与仇恨在伯明翰蔓延”的报道。这则由哈里森?索尔兹伯里撰写的文章开篇即说：\n没有纽约人能把握伯明翰当前的形势。白人与黑人漫步于同样的街道，可在这些街道上，惟有供水系统与排污系统算得上人们共享的公用设施。从球场、出租车，到图书馆，到处都有种族隔离措施。“白人”电台禁放“黑人音乐”。任何交流渠道，哪怕是合理接触，都可能被种族过激情绪破坏，那些铁鞭、刺刀、手枪、炸弹、燃烧瓶、棍棒、匕首、暴徒、警察和州政府的种种作为，更激化了这样的情绪。\n哈里森?索尔兹伯里的报道惹来更多诽谤官司，原告共向《纽约时报》索偿315万美元，索尔兹伯里也被要求赔偿150万美元。伯明翰当地许多报纸肆意攻击《纽约时报》，说它“充满偏见、恶意调唆和散布仇恨”，就像蒙哥马利市《广告报》极力抨击那则广告一样。\n这就是阿拉巴马州当时的气氛。此时，《纽约时报》正着手应对警察局长沙利文提起的首场诽谤诉讼，第一场较量将在蒙哥马利市的法院展开。\n\n第四章 初审失利(1)\n类似诽谤索偿这样的民事案件，必先经过文书送达程序：原告拟好诉状，送交被告或其代理人，书面告知本人的诉讼行为及要求。这一程序看似简单，其实隐藏着复杂的诉讼考量。比如，究竟谁是被告的“代理人”？如何令送达的文书对被告有法定约束力？如何令远在异州的当事人乖乖到本州应诉？\n沙利文通过将诉状送达《纽约时报》驻蒙哥马利市特约记者唐?麦基，启动了对报社的诽谤诉讼。麦基是《广告报》专职记者，平时很少为《纽约时报》跑新闻。1960年，麦基只从《纽约时报》那里拿到90美元薪水。但沙利文的律师认为，这就足以将他视为时报在阿拉巴马州的代理人了。此外，根据阿拉巴马州法律，如果被告公司在本州没有办事处或代理人，原告将诉状提交本州州务卿，也可视为送达。\n诽谤官司对《纽约时报》本来算不上难缠之事。报社很少被陪审团判定诽谤，也从未支付过巨额赔偿。但报社法律顾问路易斯?洛布已经意识到，“沙利文案”可没那么好对付，背后隐含极大威胁。洛布是华尔街洛德、戴&洛德律师事务所的合伙人，但他大部分时间、精力都耗在《纽约时报》这一个客户身上。他经常在工作日来到时报总部，与高级编辑或管理层聊天，与发行人阿瑟?海斯?苏兹贝格私交也非常不错。洛布乍看起来，有点儿像一个举止夸张的英国上校，身材高大，性格彪悍。生活中，他却是一位儒雅之士，酷爱藏书读书。洛布的妻子珍妮特是一位雕塑家，夫妻俩经常远赴英伦，在亨利?摩尔家中畅谈艺术人生。{亨利?摩尔（1898 1986），英国雕塑家，以大型铸铜雕塑和大理石雕塑而闻名，备受英国艺术界推崇。}\n洛布的第一项工作，是尽快物色一位阿拉巴马州律师，代表《纽约时报》应对“沙利文案”。这件事远比他预期的要艰难。他致电蒙哥马利市一家与洛德、戴&洛德有过颇多合作的律所，合伙人婉拒了他。随后，他又联系伯明翰市最大的一家律所，对方再次说不，以可能“存在利益冲突”为由，含糊其辞予以拒绝。最后，他终于找到伯明翰市一家行事风格特立独行的律所，贝多斯、恩布里&贝多事务所，这家律所经常为黑人被告提供辩护。合伙人T.埃里克?恩布里同意代表《纽约时报》打这场官司。\n在阿拉巴马州，连找一位合作律师都如此困难，显然是种族因素在作祟。《纽约时报》那则广告，彻底激怒了地方政客，他们指责时报是粗暴干涉南方内部事务的北方煽动者。哈里森?索尔兹伯里关于伯明翰形势的报道，更令《纽约时报》成为众矢之的。在这种情势下，没人乐意与《纽约时报》扯上关系，哪怕是经常为罪大恶极的被告辩护的律师们，也惟恐避之不及，不敢蹚这摊浑水。恩布里在蒙哥马利踏破铁鞋，也没找到一个律师协助他处理“沙利文案”。甚至当路易斯?洛布南下赶来与他会晤时，恩布里不但将他安置在远离市区的一家汽车旅馆，连住宿登记用的都是假名。\n恩布里与律所另一个合伙人罗德里克?贝多飞赴纽约研讨案情，与会的除了诸位律师，还包括报社高层。“我们在那里待了好几天。”多年后，恩布里回忆道，“我们与所有高管和高级编辑交谈，他们详细介绍了报纸的审编流程，比如如何组版，如何投放广告。他们告诉我，报社愿不计代价打赢这场官司，绝不轻易言败。”13\n洛布与恩布里思虑再三，认为击败沙利文的最好策略，是挑战阿拉巴马州法院的“属人管辖权”。那帮人正是利用这一权力，将《纽约时报》逼至阿拉巴马受审。在美国，五十个州都有专属立法及法院，一州法院可以在另一方当事人的业务、财产或身份与本州有关联时，通知对方从其他州赶至本州应诉。一个佛蒙特州人如果与亚利桑那州没有任何瓜葛，你就没办法在亚利桑那州告他。但是，如果仅仅因为路途遥远，就忽略对方的异地起诉，那就大错特错了。假设前面提到的佛蒙特州人恰好与亚利桑那州有\n\n第四章 初审失利(2)\n所关联，他又没把别人的起诉当回事，亚利桑那州法院很可能以“缺席审判”形式，判他赔偿10万美元。随后，亚利桑那州的原告会持判决赶到佛蒙特州，要求当地法院强制执行。当然，佛蒙特州人可以质疑亚利桑那州的管辖权。不过，如果佛蒙特州法院发现被告与亚利桑那州确有关联，对方管辖权确实成立，就将秉持宪法要求的“充分信任和尊重”（Full Faith and Credit）原则，主动执行亚利桑那州的判决。{美国宪法第四条第一款规定：“每个州对于他州的公法、诉状和司法程序，应给予充分信任和尊重。国会得以一般法律规定如何证明这类法律、诉状和司法程序的有效性及其实际效力。”}此时，即使佛蒙特州人没有出庭应诉，也将被迫支付10万美元。因此，对被告而言，审判伊始就提出管辖异议，是一种相对稳妥的策略。\n恩布里正是这么做的。他首先提出动议，要求撤销之前的送达程序。理由是，《纽约时报》与阿拉巴马州没有足够的业务往来，当地法院对其没有司法管辖权。恩布里提出，《纽约时报》的日发行量为六十五万份，而每日发送到阿拉巴马州的报纸，只有区区三百九十四份，根本不足以令报社业务与阿拉巴马州建立起有力关联。即使《纽约时报》特约记者偶尔会在阿拉巴马采访，又或本地公司偶尔会在《纽约时报》投放广告，与报社每年3750万美元的销售额相比，阿拉巴马州那区区1.8万美元的年营业额，实在是微不足道。\n在挑战阿拉巴马州法院对《纽约时报》的属人管辖权过程中，为确保万无一失，恩布里认真研读了沃尔特?琼斯撰写的《阿拉巴马州诉讼与法律执业须知》一书，后者是蒙哥马利地区巡回法院法官，“沙利文案”很可能由他主审。然而，在种族议题上，一切荒谬皆有可能。\n琼斯法官是南部邦联与南方生活方式的忠实拥趸。其父托马斯?琼斯内战时是南军一员，曾受南军统帅罗伯特?李将军之托，将休战旗交至北军统帅格兰特将军手中。战后，老琼斯还出任过阿拉巴马州州长。琼斯法官著有《论南部邦联纲领》一书，他曾在书中感慨：“我看到邦联的荣耀旗帜迎风招展，它是自由的象征，洋溢着我们对宪法的热忱，和对光荣与尊严的无限向往。”1961年，南部邦联成立一百周年之际，蒙哥马利市曾举行仪式，再现了邦联“总统”杰弗逊?戴维斯当年宣誓就职的场景。扮演监誓人的，正是琼斯法官。其他出演者后来都曾在琼斯主持的庭审中担任过陪审员，琼斯允许他们身着南部邦联时代的制服坐在陪审席上。\n1960年至1961年期间，琼斯法官为对抗民权运动与联邦政府，曾发布过一系列指令。他禁止“全国有色人种协进会”在阿拉巴马州开展任何活动，不许“自由乘客”为抗议公车上的种族隔离措施举行示威，甚至设置障碍，阻止司法部调查阿拉巴马州的选民登记记录。更过分的是，琼斯连法庭也不放过，在那里一样推行种族隔离措施。沙利文提起诽谤诉讼后，詹姆斯市长又把《纽约时报》告上法庭，这起案件庭审期间，部分黑人群众赶来旁听，并与白人坐在一块儿。第二天，琼斯法官硬说黑人们都是“暴民和种族主义煽动者”，让法警在法庭内强制执行黑白隔离。“沙利文案”开庭前，琼斯甚至扬言，本案的审判依据是“阿拉巴马州法律，而不是宪法第十四修正案”。14\n多年之后，埃里克?恩布里仍然坚信，琼斯法官在当时几起诽谤诉讼中，刻意偏向沙利文等原告。“格罗夫?霍尔这些人整天往琼斯的办公室跑，商量着怎么对付我们。”不过，就算真有这样的密室商议，如今也已无证可查。\n1960年7月25日，赶在琼斯法官开庭前，恩布里提交了对本案管辖权的异议。之后许多天里，双方律师为《纽约时报》与阿拉巴马州是否有足够的业务关联争论不休。报纸在该州的发行量、特约记者的薪水、接受本州客户委托的广告数量，都成为\n\n第四章 初审失利(3)\n争议焦点。8月5日，琼斯法官裁定，《纽约时报》与阿拉巴马州有充分的业务往来，该州法院有权管辖此案。\n路易斯?洛布认为，管辖权异议被驳回，对报社绝对是致命一击。现在，《纽约时报》必须因“关注他们的呐喊”一文被诉诽谤，被迫走进阿拉巴马州法院，接受陪审团的裁决。讽刺的是，广告事件的起因，本是因为金博士被控申报税款时作伪证，如今，这项指控却不了了之。五月的最后一周，金博士在蒙哥马利受审时，声称自己接受的捐款都已转赠给教会和民权组织，阿拉巴马当局亦无法证明金博士有挪用捐款之举，他被当庭无罪开释。\n琼斯对“沙利文案”的审理用了三天，即11月1日至3日。光是出庭律师的数量，就可以看出这绝不是一次普通的诽谤诉讼。沙利文一方的代理律师依次是罗兰?纳奇曼、罗伯特?斯坦纳和加尔文?怀特塞尔，他们都是蒙哥马利本地人。埃里克?恩布里找到四位帮手，协助他为《纽约时报》申辩。另外，因在广告内署名，而被沙利文一并起诉的四名阿拉巴马黑人牧师也委托律师出庭。这几名律师分别是弗雷德?格雷、弗农?克劳福德和小S.S.西伊{这位律师与他所代理的S.S.西伊牧师并非同一人。}，他们都是黑人，并因此导致一个诡异的场景。最高法院存档的本案一审庭审笔录显示：庭审现场，白人律师都被冠以“先生”头衔，如“纳奇曼先生”、“恩布里先生”。黑人们却被称作“格雷律师”、“克劳福德律师”、“西伊律师”。仅仅因为肤色不同，他们居然连“先生”这样的敬语都享受不到。\n审判的第一步是挑选陪审团。陪审员候选人共三十六人，其中有两名黑人。沙利文的律师将他们从候选名单内剔除，从中选出十二名白人组成了陪审团。《阿拉巴马纪闻》在头版刊登了陪审团名单，还附上他们出庭时的照片。《纽约时报》的律师以陪审员可能受当地舆论压力所迫，转而支持沙利文为由，向法庭提出异议。琼斯法官驳回了他们的异议。\n纳奇曼代表沙利文进行了开场陈述。他说，原告方之所以提起损害赔偿，是“为防止被告屡教不改，更是要防止其他人犯同样的错误”。代表《纽约时报》的恩布里回应说，广告根本没有提到沙利文的名字，“即使从最广泛的范围推论，也不可能让人联想到沙利文本人”。代表牧师出庭的格雷提出，委员会没有征求过任何一位牧师的意见，就把他们的名字登在了广告上。“他们根本就没答应过。”他说，“发生在他们身上的事，可能发生在你们任何人身上”。\n庭审伊始，沙利文的律师之一，怀特塞尔向陪审团宣读了广告全文。当他读到“黑人”（Nergo）一词时，牧师的律师之一，克劳福德提出反对，因为，怀特塞尔故意把这个词读成“黑鬼”（Nigger）。琼斯法官问怀特塞尔是不是故意念错。怀特塞尔说，他“这辈子”都是这么念这个词的。《阿拉巴马纪闻》的记者朱迪斯?罗辛后来写道：“记者们没听到他说 黑鬼 ，他只发了 nigra 或 nigro 等类似 黑人 的音。”\n一般来说，若想证明对方诽谤成立，原告方通常要列举如下证据：（1） 被告有出版行为；（2） 被告有诽谤陈述；（3） 原告是诽谤对象（诽谤损害了原告名誉）。沙利文的律师团的举证重点，正是第（3）项。尽管《纽约时报》上的广告没有提到沙利文的大名，但律师们倾尽全力，试图证明广告确有暗指沙利文之嫌，或者套用法律术语，是“指涉且关系到”（of and concerning）沙利文。沙利文本人也提供了主要证言。作为蒙哥马利三名市政专员之一，他主管警政、消防、墓葬、测绘等事务。他并非每日操持警务，因为另有一位警察总监替他主持警局日常工作。但沙利文还是认为，广告第三段关于“警察”行为的描写，针对的就是他本人。这段内容是：\n在阿拉巴马州蒙哥马利市的州议会厅前，当学生唱完“\n\n第四章 初审失利(4)\n我的国家，也是你的”这首歌后，学生领袖随即被校方开除，而且，一大批荷枪实弹、携带催泪弹的武装警察，严阵以待，并包围了阿拉巴马州立学院。当所有学生以罢课方式抗议州政府滥用公权时，警察封锁了学校食堂，试图用饥饿迫使他们就范。\n沙利文同时对第六段部分内容提出异议：\n对于金博士的和平抗争，南方违宪者却一而再、再而三地用暴力、威胁回应。他们炸毁了金博士的家，差点儿杀死他的妻儿；他们抹黑他的名声；甚至用“超速”、“侮辱”、“游荡”等不同罪名先后逮捕他七次。现在，他们又用“伪证罪”起诉他，这可是一项能使他入狱十年的重罪。\n沙利文指出，广告把错误归咎于“南方违宪者”，就是针对蒙哥马利警方的所作所为，文章多次提到“逮捕”一词，而执行逮捕正是警队的主要职能之一。当牧师的代表律师之一，克劳福德对沙利文进行交叉询问时，俩人进行了一番颇有些讽刺意味，却可能被旁观者忽略的对话。\n问：“沙利文先生，你认为你的警员们是南方违宪者吗？”\n答：“当然不是。”\n问：“那么，沙利文先生，作为警察局长，你认为自己是南方违宪者吗？”\n答：“我认为自己根本没有违宪，不管在南方还是其他什么地方。”\n接着，纳奇曼问他的客户：“你认为广告中的陈述直接提到了你，或者与你有关联么？”沙利文答道：“我可以肯定，广告的确提到了警员和他们的逮捕措施。我认为这些与本人息息相关。”\n不过，原告必须证明，广告中的陈述就是诽谤行为。沙利文说，这则广告辱及自己的“能力与正直”。他“感受”到，广告针对的不仅是他个人，还“中伤了市政专员们与整个警队”。在交叉询问中，恩布里一再暗示，沙利文的社会声望没有受到任何影响。\n问：“你被人嘲笑了吗？当你走在蒙哥马利街头，有没有感到很不自在？”\n答：“没人因为那则广告当面对我进行过人身侮辱。”\n问：“你曾在公共场合、朋友家或餐厅里刻意避开过任何人么？”\n答：“印象中没有过。”\n沙利文的律师传召了六位证人，试图证明广告“指涉且关系到”沙利文，并损害了他的名誉。第一个证人是蒙哥马利《广告报》编辑格罗夫?霍尔，他曾在《纽约时报》刊出那则广告后，撰写了一则措辞强烈的社论。霍尔说，广告第三段与阿拉巴马州立学院相关的那部分内容，很容易让人联想到本地市政专员，因为“他们负责维持社区秩序”，而且“会自然而然地联想到警察局长”。尤其令他恼火的，是“学生挨饿那段内容”，这根本就是无稽之谈。当律师问到他与沙利文的私交时，霍尔承认，俩人之前为《广告报》的照片事件弄得并不愉快，但关系目前已有所改善。\n原告方的其他五位证人，分别是商业兼水务委员会成员阿诺德?布莱克韦尔；沙利文的密友、服装店老板哈里?卡明斯基；餐饮设备公司老板H.M.普瑞斯；沙利文的好友、加油站老板小威廉?帕克尔；怀特货运公司老板霍瑞斯?怀特，沙利文曾是这家公司的保安主任。这五人一致声明，广告使他们联想到了蒙哥马利市警方与沙利文本人。他们认为，如果广告所述属实，必会伤及沙利文的形象。比如，怀特就说，要是他知道沙利文会“纵容警察们做报纸上说的那些事”，当初就不会聘他当保安主任。然而，在交叉询问环节，五个人又拍着胸脯保证，说他们绝不相信广告内容，更不会因为区区一则广告，就把沙利文视作恶人。其实，这些证人中，只有霍尔真正读过《纽约时报》那则广告，怀特说不确定自己有没有看到过。另外几人还是在沙利文的律师邀请他们作证时，才首次读到广告内容。\n真相是回应诽谤指控的最好武器。沙利文的律师竭力证明广告陈述不实。所谓不实，就是诬陷别人做了本来没有做的事。他们认为，广告指控警方和沙利文炸毁金博士的住宅，那么，只要证明沙利文没这么做，诽谤就是成立的。《纽约时报》当然想\n\n第四章 初审失利(5)\n证明广告压根与沙利文无关，但庭审给人的感觉，却是沙利文被罗织了一堆莫须有的罪名。比如，应当对开除学生领袖或校园餐厅事件负责的，本来应当是阿拉巴马州政府，至少是主管州立学院的教育委员会。但沙利文的律师向他提问时，却故意把问题往诬陷上引，仿佛此君被人指控从事了上述行为。而沙利文也郑重否认了这些指控，尽管根本没人把账算到他身上。\n纳奇曼：“你曾经刻意陷害过金博士么？”\n沙利文：“从来没有。”\n纳奇曼：“我问你，警方是否在你任职期间，或其他任何时候，参与或纵容炸毁金博士的住宅？”\n恩布里听到上述问答，实在按捺不住，嚷道：“法官阁下，我反对。没人读到任何关于警察炸毁他人住宅的文字，也无法从广告文字里推断出上述内容。这完全是他们的臆测空想。法官阁下！”琼斯法官打断了他的发言，并宣布反对无效。\n在关于虚假陈述的指控中，原告律师还提供了其他证据。他们指出，广告第三段关于阿拉巴马州立学院事件的描述是不准确的。律师引述了《纽约时报》驻南方地区记者克劳德?西顿在1960年3月2日的一则报道，以及驻蒙哥马利特约记者唐?麦基的一篇报道。原告律师试图证明，广告第三段存在多处不实描写。比如，学生们在州议会厅前唱的明明是国歌“星条旗永不落”，而不是那首“我的国家，也是你的”。部分学生被开除也与此无关，而是因为他们进入实行种族隔离措施的餐厅，要求在那里就餐。警方确实在校园周围部署了大量警力，但肯定称不上“包围”学校。更严重的失误发生在与校园餐厅事件相关的那段描述。《纽约时报》的律师后来向最高法院提交的诉状中，并未隐讳这一失误：“关于警察封锁学校食堂，试图用饥饿迫使学生就范的报道，确实缺乏事实依据，也正是这部分内容，引起蒙哥马利方面的强烈不满。”此外，广告第六段也有一处错误，金博士曾被逮捕过“四次”，而不是广告提到的七次。\n以上是原告方的主要立场。\n被告阵营这方，恩布里传召了《纽约时报》几位员工。业务员格申?阿伦森出庭陈述了这则广告的受理过程。广告审查部主管文森特?瑞丁也表示，他之所以签字同意刊出这则广告，是因为“相关文案由知名人士联署，其动机亦无可置疑”。《纽约时报》行政主管哈丁?班克罗夫特也出庭作证，表示报社“广告内容根本没有指涉沙利文先生”。当对方问他，为什么《纽约时报》在帕特森州长提出抗议后才撤销广告，而没有理会沙利文的抗议时，班克罗夫特表示：“我们这么做，是不希望我们刊载在报纸上的任何内容，被理解为对阿拉巴马州政府的评论，众所周知，州长本人即可代表阿拉巴马州政府 ”\n最后，四位牧师也当庭进行了答辩。像这类诽谤案件，原告必须证明被告公开出版了诽谤言论，但谁都清楚，刊登报道的是第一被告《纽约时报》公司。但是，牧师们照样无法推脱责任。虽然四人都有证人证明他们与此事完全无关，更未授权广告援引本人姓名。他们的律师传召约翰?默里作证，默里是“声援马丁?路德?金委员会”的志愿者，广告接洽事宜正是由他经办。默里承认，他将广告初稿送至报社时，广告中确实没有这二十位南方支持者的名单。这个名单是后来应委员会执行主任贝亚德?拉斯廷的要求加上去的，因为他对初稿并不满意。默里说，俩人讨论一番后，拉斯廷“打开抽屉，从里面取出一份名单，那其实是加入 南方基督教领袖会议 的牧师名单”。默里说他曾问拉斯廷，委员会是如何做到让这么多人署名的，但拉斯廷回答，不需要经过他们同意，他们本来就是这场运动的一部分。\n弗雷德?格雷要求撤销对牧师们的指控，因为没有任何证据显示他们与广告刊出相关。琼斯法官驳回了他的动议。在对陪审团的结辩陈词中，格雷质疑道：“如果这些被告压根没有发表什么声明，你又怎么指望他们能撤回声明呢？”\n\n第四章 初审失利(6)\n他认为牧师们是“被遗忘的被告”，“与这个案子没有任何关系”。但沙利文一方的律师斯坦纳提出，四名牧师中，有两人来自蒙哥马利市（即拉尔夫?阿伯内西和S.S.西伊），这“恰好证明广告指涉到沙利文”。他说，报纸“当然是好东西，但报纸必须忠于事实。要想引起报纸注意， 无非是拿钱去砸”。恩布里认为，广告犯的唯一错误，是关于警察封锁学校食堂那段报道，但这个错误“怎么也不可能让人们联想到沙利文局长”。事实上，广告根本没有提到沙利文，他也不可能为此受到伤害。“有任何证据显示沙利文先生为此受到伤害吗？”恩布里问陪审团，“这则广告究竟是给沙利文先生带来不幸，还是反而提高了他的社会声望呢？”\n琼斯法官指示陪审团如何裁判时，请他们重点关注广告是否构成诽谤这一问题。他介绍道，广告中被质疑的陈述，已经构成“直接诽谤”{直接诽谤（libelous per se）：又称当然诽谤，是指文字明显具有诽谤性，原告可以据此直接起诉，不必证明自己已遭受特定损害。与之相对的是间接诽谤（libelous per quod），即词句或言论不具有诽谤性，表面上不能起诉，但经过举证，结合具体情境，可认定为诽谤。}，也就是说，它确定无疑地中伤到了被指涉者，而且损害了这个人的名誉、事业与社会地位。琼斯法官还说，陪审团无需考虑“不实陈述”的认定问题，因为按照阿拉巴马州法律，只要“直接诽谤”成立，相关言论即可推定为“不实陈述”，除非被告能够举证证明自己所言属实，才可推翻上述推定。由于《纽约时报》已承认“封锁食堂”等内容有误，他们在举证上已失去主动权。至于对被告造成的损害，也完全建立在推定基础上，沙利文更无需为此举证。总之，案件推进至此，法官已对陪审团作出下列指示：广告构成诽谤，不实陈述成立，原告深受其害。而留给陪审团裁定的，则是下列三个问题：被告是否出版了广告？广告内的陈述是否“指涉且关系到”沙利文？如果陪审团认为前面两个问题的答案都是肯定的，那么沙利文应得到多少钱的赔偿？\n陪审团只用了两小时二十分钟就得出了结论。他们判定被告败诉，《纽约时报》与四位牧师必须按沙利文的诉讼要求进行赔偿，金额是：50万美元。\n\n致谢\n\n这本书能呈现在读者面前，《纽约时报》居功至伟。三十五年前，是《纽约时报》华盛顿记者站主任詹姆斯?赖斯顿，给了我报道最高法院事务的机会。多年来，发行人阿瑟?奥克斯?苏兹贝格与各位报社编辑，提供了足够机遇与充分自由，使我能够顺利从事各类法制报道。与琳达?格林豪斯的多次交流，令我获益匪浅。现在，为《纽约时报》报道最高法院事务的任务，已由她承担。此外，我的写作，还得益于朱迪思?格林菲尔德与约翰?默蒂卡两位时报研究员的大力襄助。\n以“尼曼学者”身份深造期间，哈佛法学院为我打开了法律之门。如果没有那段学习经历，和之后十五年的从教生涯，若想写出此书，无疑是天方夜谭。我的学生罗斯玛丽?里夫替我核对了所有引注。法学院图书馆的琼?达科特、艾伦?德莱尼、艾伦?迪芬巴赫、珍妮特?卡茨、赫达?科瓦利、贝丝?拉德克里夫、娜奥米?罗恩和乔纳森?托马斯给予我诸多帮助。耶鲁法学院图书馆苏珊?刘易斯萨默斯为我搜得许多重要文献。兰德尔?肯尼迪教授提供了与阿拉巴马州有关的大量资料。\n哥伦比亚大学法学院的文森特?伯雷西教授审读了本书初稿，他在宪法第一修正案领域的精深造诣，令我获益良多。在我创作期间，玛格丽特?马歇尔和伊莱扎?刘易斯逐章审阅初稿，提出了许多有价值的建议。赫伯特?韦克斯勒与桃瑞丝夫妇接受采访期间，慷慨无私地提供了大量与“沙利文案”有关的信息。同样应感谢其他参与此案，并接受我采访的律师，他们是：罗兰?纳奇曼、马文?弗兰克、\n\n第四章 初审失利(7)\nT.埃里克?恩布里。艾伦?布林克利教授在史料方面，也提供了许多及时、有效的帮助。\n我在《纽约时报》任职期间的助理，苏珊?罗利杰拉姆，总能激发我的创作灵感。米娅?刘易斯校对了全文。戴维?格林威对书名提出了建议。\n衷心感谢下列作者允许我援引大作，他们是：泰勒?布兰奇（Parting the Waters：America in the King Years 1954-63）、弗雷德?弗兰德利（Minnesota Rag）、罗德尼?斯莫拉（Suing the Press：Libel，the Media and Power）、理查德?波兰伯格（Fighting Faiths：the Abrams Case，the Supreme Court and Free Speech）、伦纳德?利维（Emergence of a Free Press）、詹姆斯?莫顿?史密斯（Freedom's Fetters：The Alien and Sedition Acts and American Civil Liberties）和伦纳德?加门特（Annals of Law：The Hill Case）。杰拉尔德?冈瑟教授编撰的《美国宪法：判例与文献汇编》（Cases and Materials on Constitutional Law），助我在浩如烟海的第一修正案判例中理出头绪，厘清思路。\n兰登书屋的约瑟夫?福克斯为这本书奉献了大量时间、精力。长期以来，是他提醒我放宽眼界，不要只专注于日常报道。编辑过程中，他没有漏掉一处精华，也未放过一丝错漏。苏诺?罗森伯格校正了文稿中的许多小错误。多谢二位了。\n最后要感谢的，是小威廉?布伦南大法官。布伦南大法官在“《纽约时报》诉沙利文案”中为后人所作之贡献，已无须赘言。当我决心撰写此书，并请求他提供与本案的相关文献时，他慨然应允，并倾其所能，给予我各种便利与帮助。\n\n* * *"
		},
		{
			"post_id": 28,
			"title": "上海松江警察VS抱小孩的妇女",
			"date_published": 1504339314.376,
			"body": "看着都有些后怕，但愿小孩无大碍\n原视频如下：\n\n* * *\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/songjiangjingchabaoshuai1.mp4\" controls=\"controls\" id=\"360videoname\">您的浏览器不支持 video 标签。</video> <video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/150f0251f125060043dc146ecf56ac59.mp4\" controls=\"controls\" id=\"360videoname\">您的浏览器不支持 video 标签。</video>\n\n微博认证账号为中国警察网的辟谣：\n![image alt](optional-files/005JznHYly1fj40mhq3agj30ch0m80uz.jpg)\n\n后又删帖并微博致歉：\n![image alt](optional-files/3612859973.jpg)\n\n事发地警方表态：\n![image alt](optional-files/36012182461.jpg)\n\n部分网友评论：\n![image alt](optional-files/20170902162358.jpg)\n\n![image alt](optional-files/2162643.jpg)\n\n![image alt](optional-files/170902162523.jpg)\n\n![image alt](optional-files/20170902163257.jpg)\n\n官方培训视频：\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/9dbe8daed6851cd2ce24f1926b92cbc5.mp4\" controls=\"controls\" id=\"360videoname\">您的浏览器不支持 video 标签。</video>\n\n美国同类事件视频：\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/9fe8f595c95d61051c7adf241270db1d.mp4\" controls=\"controls\" id=\"360videoname\">您的浏览器不支持 video 标签。</video>\n\n电影镜头： <video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/e8e21ed5ccc24f1e6937be1500b5995b.mp4\" controls=\"controls\" id=\"360videoname\">您的浏览器不支持 video 标签。</video>"
		},
		{
			"post_id": 27,
			"title": "这是什么啊？文化监管客户端？",
			"date_published": 1502460633.932,
			"body": "文化监管客户端是什么鬼?\n![image alt](img/wenhuajianguan4258125.jpg)"
		},
		{
			"post_id": 26,
			"title": "关于本站",
			"date_published": 1502100952.007,
			"body": "曾经不止一次在腾讯、优酷、微博、土豆、搜狐等视频网站上上传视频被通知违反相关法律法规未通过审核，或者本已通过审核却被屏蔽下线，而那些所谓的违反相关法律法规的视频从来没有指出违反了哪一项哪一条，而事实上这些视频都是真实的记录，或是批判骗子的，或是传播真相的，或是揭露行业内幕能对公众起到惊醒作用的，然而就是这些良心视频却被指控违规，滑天下之大稽！！！\n\n* * *\n\n曾经考虑建个网站让这些被腾讯、优酷、微博等屏蔽的视频留存下去，怎奈心有余力不足，毫无建站知识，另外经查询，国内建网站必须实名备案，各种麻烦，偶然发现零网这个好工具，遂建此博客。\n\n考虑到零网的特殊性，尽量选取精短视频，以节省网友空间。但是由于本博客的定位，注定这个博客的体积会越来越大。如今已经五十兆，好在已经有网友帮忙全站做种，不过网友也提醒：“”太大的站点不会有人长期留存“”。我也深知于此，但是本网站的定位不会改变，依然会不定期更新。\n\n如果未来体积大到没有一个人愿意为此站做种了，或许此站的寿命也就到头了。\n\n不过我还是希望广大网友哪怕在电脑里少存放一部两部高清电影节省出的空间来帮助此站分发文件，为本站做种，但是不得不遗憾的告诉您，本站无法给您任何好处，小说、电影、种子、岛国片资源？没有，都没有。\n\n不知道看到这篇文章网友是否愿意按住右上角的零符号左拉，打开“”下载并帮助分发所有文件“”选项为本站分发文件做种呢？大家的热情决定此站的寿命。谢谢大家了。"
		},
		{
			"post_id": 25,
			"title": "捕获的鱼被注入不明物体，有没有人知道那是什么",
			"date_published": 1502100300.984,
			"body": "时间：未知\n\n地点：海边渔船之上\n\n简述：捕上来的鱼被注射入不明物体\n\n(如果视频无法查看请按住右上角符号往左拉伸，往下滑，打开“”下载并帮助分发所有文件“”选项)\n\n* * *\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/zhurudebumimgwuti.mp4\" controls=\"controls\" id=\"360videoname\">您的浏览器不支持 video 标签。</video>"
		},
		{
			"post_id": 24,
			"title": "201708归档",
			"date_published": 1500628320,
			"body": "1、[为什么我看到的自己的博客跟别人看到的不一样呢](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:22:%E4%B8%BA%E4%BB%80%E4%B9%88%E6%88%91%E7%9C%8B%E5%88%B0%E7%9A%84%E8%87%AA%E5%B7%B1%E7%9A%84%E5%8D%9A%E5%AE%A2%E8%B7%9F%E5%88%AB%E4%BA%BA%E7%9C%8B%E5%88%B0%E7%9A%84%E4%B8%8D%E4%B8%80%E6%A0%B7%E5%91%A2)\n\n2、[终于能先让大家看到博客的整体框架了，希望大家选择“下载并帮助分发所有文件”](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:23:%E7%BB%88%E4%BA%8E%E8%83%BD%E5%85%88%E8%AE%A9%E5%A4%A7%E5%AE%B6%E7%9C%8B%E5%88%B0%E5%8D%9A%E5%AE%A2%E7%9A%84%E6%95%B4%E4%BD%93%E6%A1%86%E6%9E%B6%E4%BA%86%EF%BC%8C%E5%B8%8C%E6%9C%9B%E5%A4%A7%E5%AE%B6%E9%80%89%E6%8B%A9%E2%80%9C%E4%B8%8B%E8%BD%BD%E5%B9%B6%E5%B8%AE%E5%8A%A9%E5%88%86%E5%8F%91%E6%89%80%E6%9C%89%E6%96%87%E4%BB%B6%E2%80%9D)\n\n3、[捕获的鱼被注入不明物体，有没有人知道那是什么](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:25:New+blog+post)\n\n4、[关于本站](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:26:%E5%85%B3%E4%BA%8E%E6%9C%AC%E7%AB%99)"
		},
		{
			"post_id": 23,
			"title": "终于能先让大家看到博客的整体框架了，希望大家选择“下载并帮助分发所有文件”",
			"date_published": 1502094643.172,
			"body": "给某个博客导航站提交收录申请，博主回复再丰富丰富内容，很是莫名奇妙，我这已经很丰富了啊，比有些收录的还丰富，\n\n* * *\n\n原来我将视频文件也搞成了必选文件，无法同步，别人只能看到我的一两篇文章，怪不得说我博客不丰富。之前看到有些站点有““‘“”下载并帮助分发所有文件“”这个选项而我的没有，问了也没人理我，原来问题出在这里啊。\n\n感谢[工科菜鸡的瞎bb](http://127.0.0.1:43110/1NsQX8JQYbjDfM3Die226PQ8WwMqXidZRE/?Home)的指点：《[真实菜鸡关于Optional-files作为下载源添加的_初步_log](http://127.0.0.1:43110/1NsQX8JQYbjDfM3Die226PQ8WwMqXidZRE/?Post:6:%E7%9C%9F%E5%AE%9E%E8%8F%9C%E9%B8%A1%E5%85%B3%E4%BA%8EOptional-files%E4%BD%9C%E4%B8%BA%E4%B8%8B%E8%BD%BD%E6%BA%90%E6%B7%BB%E5%8A%A0%E7%9A%84*%E5%88%9D%E6%AD%A5*log)》，为表感谢特加友情链接，并分发此网友网站所有文件以示谢意。\n\n最后，欢迎大家做种，欢迎大家按住右上角的零符号左拉，打开“”下载并帮助分发所有文件“”选项，共同记录真实的中国，谢谢大家了。"
		},
		{
			"post_id": 22,
			"title": "为什么我看到的自己的博客跟别人看到的不一样呢",
			"date_published": 1501930926.767,
			"body": "[设置了目录，设置了连接，十几篇文章，也显示发布成功了，为什么别人看到的依然是两篇文章，目录什么的都没有呢？求解啊，谁知道怎么回事儿？](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1MmVt2RBx3QRBevJ31pRYmnsLssDcsCLAo/coy@zeroid.bit)"
		},
		{
			"post_id": 21,
			"title": "王老吉使用其他产品罐子被消费者发现",
			"date_published": 1500925143.717,
			"body": "时间：未知\n\n地点：未知\n\n简述：消费者购买王老吉发现撕下包装都是其他罐子，生产日期也是重新打印的，提醒大家注意。\n\n* * *\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/1487393376366&#10;.mp4\" controls=\"controls\" id=\"360videoname\">您的浏览器不支持 video 标签。</video>"
		},
		{
			"post_id": 20,
			"title": "不知名学校的校园暴力和欺凌",
			"date_published": 1500923728.06,
			"body": "时间：未知\n地点：学校\n简述：欺凌\n\n* * *\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/xiaoyuanbaoli1.mp4\" controls=\"controls\">您的浏览器不支持 video 标签。</video>"
		},
		{
			"post_id": 19,
			"title": "城管众目睽睽之下掠夺冰糖葫芦，看了想哭",
			"date_published": 1500923241.298,
			"body": "时间：未知\n地点：未知\n简述：城管队员抢夺冰糖葫芦，后来还二次折返，又捋走一大把，看了想哭。\n\n* * *\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/187954648992.mp4\" controls=\"controls\">您的浏览器不支持 video 标签。</video>"
		},
		{
			"post_id": 17,
			"title": "某地城管队员拿了几个小贩的水果，自称无所谓",
			"date_published": 1500921558,
			"body": "时间：未知\n地点：未知\n简述：某地城管队员拿了小贩的水果，自称无所谓，小贩很无奈\n\n* * *\n\n<video src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/chengguannalejigeshuiguozchengwusuowei.mp4\" controls=\"controls\">您的浏览器不支持 video 标签。</video>"
		},
		{
			"post_id": 16,
			"title": "怕删不是中国网民（转载）",
			"date_published": 1500666624.716,
			"body": "**博主前记**：\n\n<font color=\"red\">_本文来自虎嗅网，作者伯通，虎嗅网微信公众号疑似因为此文被封禁一周，而微信原文已被删。_</font>\n\n* * *\n\n昨天，中文互联网上哀声载道。\n\n　　难过的理由各自不同，但其中一个是因为，以B站为代表的境外影视内容载体们出事了。即便是对公共话题再不敏感的人，也可能因为打开剧集列表目睹一片狼籍，而转身加入到声讨的队伍中。\n\n　　种种情绪中，令我印象深刻的是一位姑娘，她在回答知乎上《B站被团灭，你怎么看?》的问题时，写了一句话——\n\n　　“我36码，想问现在裹脚还来得及吗?”\n\n　　1\n\n　　中国互联网发轫以来，遗留了大量灰色地带。它们如同数十年来从未划定的中印边界一样，在官民互动的过程中，形成了一条传统习惯界线。双方以某种默契维持着边界的稳定。\n\n　　这其中的一条灰色界线，就是互联网视频。\n\n　　36人电影审查委员会决定了冯小刚的心情，新闻出版局可以迫使韩寒更换十家出版社，伴随着广电总局和文化部对于网络游戏审查权的争抢，腾讯开放平台甚至打出了“游戏版号办理7.5折，平台担保省心省钱”的广告。在这些战场上，炮火可能是随机的，但壕沟走向却是固定的。\n\n　　而互联网视频的边界却是另外一番光景。早在2004年时，广电总局就通过39号和42号令，将视频网站的自制剧和海外引进剧纳入了监管范围。在2014年时，总局还再次重申了将加强管理——“2015年4月1日起，未经登记的境外影视剧不得上网播放。”\n\n　　然而视频网站却一直在试探监管政策的底线，不要说起家伊始就搬运海量境外内容的AB站，就连一些老牌公司也同样盯上了这种“低监管红利”——2014年2月，在为庆祝发布《纸牌屋》第二季而举办的媒体沟通会上，张朝阳坚决否认了记者所有关于“政府审查、自我审查、内容删节”的猜测。\n\n　　别忘了，就在张朝阳志得意满的三个月前，快播才刚刚领到了第一张罚单，共计25万元，原因是侵权。而彼时快播已经创立6年，总安装量超过3亿，充分享受了低版权优势和低监管优势的红利期。\n\n　　院线一年只能引进34部外国电影，电视台一年所能播放的外国电视剧也有定额。而民营视频网站却可以从容提供大量影院和电视台不能播放的境外节目，在中国娱乐领域仅此一家。\n\n　　这是副奇怪的光景：即便时而传来个别字幕组的离别、生活大爆炸们的下架、播放软件的洗牌，但总局的指示似乎永远只闻雷声，网民们依旧能够以非常便利的方式观看未经任何审查核准的境外视频内容。\n\n　　在很长一段时间里，免费而海量的视频资源，与淘宝(快递)、美食、低价人工服务一起，构成了海外留学生思乡的底蕴。更别提B站的访客中，曾有19%的IP地址是来自日本的。\n\n　　2\n\n　　看上去没人管的领域，最后往往都印证了“一放就乱，一管就死”的老话。\n\n　　一旦传统习惯边界的默契被打破，接下来很难会推导出某种双方利益权衡的结果，而是打破边界一方的意志体现。无论冯小刚和韩寒们的心情再差，只要肯弯腰闭嘴，就几乎没有过不去的坎。然而灰色地带一旦被纳入中央版图，下场往往就是赤野千里。\n\n　　豆瓣网友“崇子”颇为精髓地点出了问题所在——\n\n　　现在评论强制ab站视频下架的事儿，言论两边倒。一边说“这是药丸，闭关锁国咯”。一边说“你们这些看盗版还看出优越感了么?”这两种言论其实揉巴在一起比较合适。那就是“其实严管盗版满好的。我愿意花钱。但总得给我个花钱看 翻译好/没广告/不阉割/原声/字幕美观/的引进片儿的地方啊!!”\n\n　　虽然本次B站出事并非缘于盗版，但这个逻辑是没错的。即：长期的灰色红利，导致行业难以按正常规律发展，而从严从重的治理，又让网民一夜回到解放前。网民在享受低版权和低监管红利时，内心或许并不排斥付费观看B站上的日韩英美剧，然而洪水一至，大家才惊觉被B站惯了这么多年，自己硬盘里连种子都没存，于是哀鸿遍野。\n\n　　同理，其实到现在也有很多人不知道王欣是谁，但普通公众此前为快播案愤慨，明面上在乎的是判决，根本上在乎的是网络色情在这个国家的命运——我之前的确偷偷绕过收费站来着，但你不能因为这个，就不让我们这辆车上路了呀。\n\n　　3\n\n　　说回那个准备“裹脚”的姑娘。\n\n　　这种玩笑和调侃本身没任何问题，但还是让我杞人忧天了起来。\n\n　　伟大领袖在《丢掉幻想，准备斗争》一文中曾说过，“自我批评的方法只能用于人民的内部”。我认为“裹脚”式调侃同样代表着某种自我批评和精神层面的自我矮化，颇有些“我再也不敢了”的味道。\n\n　　过去几月间，不就是删除些视频，封掉几个公号，出台了些新政策吗?如果中国网民因为这些风向就在评论里大刷什么“男的留辫子，女的去裹脚”(见B站官微评论区)，那可能真是好日子过多了有些气喘心虚。\n\n　　中国网民曾经一直是靠着技术储备、检索能力、处变手段而行走局域网江湖的——如今网盘和离线下载把宅男喂肥了，怎么能忘记前辈们靠PP点点通、Vagaa和飞鸽传书传阅日本小电影的岁月?如今廉价可靠的梯子软件让人们爬长城不费劲了，怎么能忘记前辈们靠几分钟掉一次的在线代理、每周都要更新的封装工具看Twitter的日子?\n\n　　忘记过去就意味着背叛。魔兽不开服的日子里，性感玉米曾做出闻名天下的《网瘾战争》。要知道在那之前，央视已经开播纪录片《战网瘾》，同年还出版了记录文学《战网魔》。这些内容记载了以山东临沂市第四人民医院精神科大夫杨永信的网瘾治疗所作为治愈网瘾的希望之光，兽化的玩家在此得到救赎的故事。\n\n　　即便到了今年7月13日，人民网、新华社、人民日报在过去10天中各开三炮，三大官媒接力达成了“九评王者荣耀”的成就，但这能比那个央视鼓动全国家长把孩子送去电击的时代更荒谬?\n\n　　不要以为在不便监控的移动端过了几天好日子就可以不再受苦，习惯于漂泊是每个中国网民的必修课，哪有什么家园，好汉就要习惯换个ID下次来过，每个荒芜的互联网墓碑才是你的勋章。2009年7月到2010年5月，新疆625万网民经历了长达312天的断网生活，不也想出了用RTX代替QQ、用沙砾博客代替开心网、把四大门户首页下载回来打包观看的办法吗?\n\n　　人是要有点自信的，拍拍良心自问一下，国家扫黄打非了这么多年，你少看过一部AV吗?\n\n　　ZeroNet、Resilio Sync、Tox学起来，网盘里的资料备份起来，获取信息的路子野起来，天塌不下来。这两天一些豆瓣用户在以手抄本的方式，交流B站未删除的视频，没想到第一拔放弃幻想打持久战的，竟是这些整天看起来晒猫发丧的文青。\n\n　　你看，谁也难不倒我们。"
		},
		{
			"post_id": 15,
			"title": "有网友反映视频无法播放",
			"date_published": 1500663393.725,
			"body": "关键那些视频才几秒几百K啊，跟一张图片差不多，怎么会呢，是不是因为他们点开还没加载完全？费解，我看到有些网友的站点拉开右边的圈圈隐藏菜单有“下载分发所有文件”的选项，为什么我的站点没有呢？\n\n有没有高人指点一二，谢谢了！"
		},
		{
			"post_id": 13,
			"title": "20170721杭州发生爆炸，原因不明",
			"date_published": 1500625127.363,
			"body": "据媒体报道：7月21日，浙江杭州西湖区，一店面发生煤气瓶爆炸事故。视频显示，爆炸引发大量黄色烟雾，\n\n* * *\n\n不明物体被炸飞后散落马路，有公交车窗户被炸碎，目击者称，炸了三次，一次大的，两次小的。目前，事故已造成2人死亡，55人受伤，其中12人伤势较重，伤者已送往医院治疗。\n以下为未经处理的现场视频：\n\n<video controls=\"\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha1.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha1.mp4\" type=\"video/mp4\">\n您的浏览器不支持 video 标签。</video><video controls=\"\" id=\"360videoname\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha2.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha2.mp4\" type=\"video/mp4\">\n您的浏览器不支持 video 标签。</video>\n<video controls=\"\" id=\"360videoname\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha3.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha3.mp4\" type=\"video/mp4\">\n您的浏览器不支持 video 标签。</video><video controls=\"\" id=\"360videoname\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha4.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170721hangzhoubaozha4.mp4\" type=\"video/mp4\">\n您的浏览器不支持 video 标签。</video>"
		},
		{
			"post_id": 12,
			"title": "牢骚满腹",
			"date_published": 1469065717,
			"body": "1、 [兼听则明，偏信则暗](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:1:%E5%85%BC%E5%90%AC%E5%88%99%E6%98%8E%EF%BC%8C%E5%81%8F%E4%BF%A1%E5%88%99%E6%9A%97)\n\n2、 [有网友反映视频无法播放](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:15:%E6%9C%89%E7%BD%91%E5%8F%8B%E5%8F%8D%E6%98%A0%E8%A7%86%E9%A2%91%E6%97%A0%E6%B3%95%E6%92%AD%E6%94%BE)\n\n3、[怕删不是中国网民（转载）](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:16:%E6%80%95%E5%88%A0%E4%B8%8D%E6%98%AF%E4%B8%AD%E5%9B%BD%E7%BD%91%E6%B0%91%EF%BC%88%E8%BD%AC%E8%BD%BD%EF%BC%89)\n\n4、[为什么我看到的自己的博客跟别人看到的不一样呢](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:22:%E4%B8%BA%E4%BB%80%E4%B9%88%E6%88%91%E7%9C%8B%E5%88%B0%E7%9A%84%E8%87%AA%E5%B7%B1%E7%9A%84%E5%8D%9A%E5%AE%A2%E8%B7%9F%E5%88%AB%E4%BA%BA%E7%9C%8B%E5%88%B0%E7%9A%84%E4%B8%8D%E4%B8%80%E6%A0%B7%E5%91%A2)\n\n5、[终于能先让大家看到博客的整体框架了，希望大家选择“下载并帮助分发所有文件”](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:23:%E7%BB%88%E4%BA%8E%E8%83%BD%E5%85%88%E8%AE%A9%E5%A4%A7%E5%AE%B6%E7%9C%8B%E5%88%B0%E5%8D%9A%E5%AE%A2%E7%9A%84%E6%95%B4%E4%BD%93%E6%A1%86%E6%9E%B6%E4%BA%86%EF%BC%8C%E5%B8%8C%E6%9C%9B%E5%A4%A7%E5%AE%B6%E9%80%89%E6%8B%A9%E2%80%9C%E4%B8%8B%E8%BD%BD%E5%B9%B6%E5%B8%AE%E5%8A%A9%E5%88%86%E5%8F%91%E6%89%80%E6%9C%89%E6%96%87%E4%BB%B6%E2%80%9D)\n\n6、[关于本站](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:26:%E5%85%B3%E4%BA%8E%E6%9C%AC%E7%AB%99)"
		},
		{
			"post_id": 11,
			"title": "201707归档",
			"date_published": 1469063072,
			"body": "1、[兼听则明，偏信则暗](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:1:%E5%85%BC%E5%90%AC%E5%88%99%E6%98%8E%EF%BC%8C%E5%81%8F%E4%BF%A1%E5%88%99%E6%9A%97)\n2、[20170720江苏新沂华宏钢厂员工劳资纠纷斗殴事件](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:3:20170720%E6%B1%9F%E8%8B%8F%E6%96%B0%E6%B2%82%E5%8D%8E%E5%AE%8F%E9%92%A2%E5%8E%82%E5%91%98%E5%B7%A5%E5%8A%B3%E8%B5%84%E7%BA%A0%E7%BA%B7%E6%96%97%E6%AE%B4%E4%BA%8B%E4%BB%B6)\n3、[新人扫盲导航](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:4:%E6%96%B0%E4%BA%BA%E6%89%AB%E7%9B%B2%E5%AF%BC%E8%88%AA)\n4、[这是坏人变老了还是老来少的调皮啊](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:6:%E8%BF%99%E6%98%AF%E5%9D%8F%E4%BA%BA%E5%8F%98%E8%80%81%E4%BA%86%E8%BF%98%E6%98%AF%E8%80%81%E6%9D%A5%E5%B0%91%E7%9A%84%E8%B0%83%E7%9A%AE%E5%95%8A)\n5、[小作坊徒手罐啤酒有图有视频有报案，可惜无结果](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:7:%E5%B0%8F%E4%BD%9C%E5%9D%8A%E5%BE%92%E6%89%8B%E7%BD%90%E5%95%A4%E9%85%92%E6%9C%89%E5%9B%BE%E6%9C%89%E8%A7%86%E9%A2%91%E6%9C%89%E6%8A%A5%E6%A1%88%EF%BC%8C%E5%8F%AF%E6%83%9C%E6%97%A0%E7%BB%93%E6%9E%9C)\n\n6、 [20170721杭州发生爆炸，原因不明](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:13:20170721%E6%9D%AD%E5%B7%9E%E5%8F%91%E7%94%9F%E7%88%86%E7%82%B8%EF%BC%8C%E5%8E%9F%E5%9B%A0%E4%B8%8D%E6%98%8E)\n\n7、[有网友反映视频无法播放](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:15:%E6%9C%89%E7%BD%91%E5%8F%8B%E5%8F%8D%E6%98%A0%E8%A7%86%E9%A2%91%E6%97%A0%E6%B3%95%E6%92%AD%E6%94%BE)\n\n8、[怕删不是中国网民（转载）](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:16:%E6%80%95%E5%88%A0%E4%B8%8D%E6%98%AF%E4%B8%AD%E5%9B%BD%E7%BD%91%E6%B0%91%EF%BC%88%E8%BD%AC%E8%BD%BD%EF%BC%89)\n\n9、[某地城管队员拿了几个小贩的水果，自称无所谓](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:17:%E6%9F%90%E5%9C%B0%E5%9F%8E%E7%AE%A1%E9%98%9F%E5%91%98%E6%8B%BF%E4%BA%86%E5%87%A0%E4%B8%AA%E5%B0%8F%E8%B4%A9%E7%9A%84%E6%B0%B4%E6%9E%9C%EF%BC%8C%E8%87%AA%E7%A7%B0%E6%97%A0%E6%89%80%E8%B0%93)\n\n10、[这些人往鱼里面注入的什么东西？](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:18:New+blog+post)\n\n11、[城管众目睽睽之下掠夺冰糖葫芦，看了想哭](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:19:%E5%9F%8E%E7%AE%A1%E4%BC%97%E7%9B%AE%E7%9D%BD%E7%9D%BD%E4%B9%8B%E4%B8%8B%E6%8E%A0%E5%A4%BA%E5%86%B0%E7%B3%96%E8%91%AB%E8%8A%A6%EF%BC%8C%E7%9C%8B%E4%BA%86%E6%83%B3%E5%93%AD)\n\n12、[王老吉使用其他产品罐子被消费者发现](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:21:%E7%8E%8B%E8%80%81%E5%90%89%E4%BD%BF%E7%94%A8%E5%85%B6%E4%BB%96%E4%BA%A7%E5%93%81%E7%BD%90%E5%AD%90%E8%A2%AB%E6%B6%88%E8%B4%B9%E8%80%85%E5%8F%91%E7%8E%B0)"
		},
		{
			"post_id": 10,
			"title": "民生安全",
			"date_published": 1469062381,
			"body": "1、 [小作坊徒手罐啤酒有图有视频有报案，可惜无结果](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:7:%E5%B0%8F%E4%BD%9C%E5%9D%8A%E5%BE%92%E6%89%8B%E7%BD%90%E5%95%A4%E9%85%92%E6%9C%89%E5%9B%BE%E6%9C%89%E8%A7%86%E9%A2%91%E6%9C%89%E6%8A%A5%E6%A1%88%EF%BC%8C%E5%8F%AF%E6%83%9C%E6%97%A0%E7%BB%93%E6%9E%9C)\n\n2、[20170721杭州发生爆炸，原因不明](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:13:20170721%E6%9D%AD%E5%B7%9E%E5%8F%91%E7%94%9F%E7%88%86%E7%82%B8%EF%BC%8C%E5%8E%9F%E5%9B%A0%E4%B8%8D%E6%98%8E)​​​​​​​\n\n3、[王老吉使用其他产品罐子被消费者发现](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:21:%E7%8E%8B%E8%80%81%E5%90%89%E4%BD%BF%E7%94%A8%E5%85%B6%E4%BB%96%E4%BA%A7%E5%93%81%E7%BD%90%E5%AD%90%E8%A2%AB%E6%B6%88%E8%B4%B9%E8%80%85%E5%8F%91%E7%8E%B0)\n\n4、[捕获的鱼被注入不明物体，有没有人知道那是什么](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:25:New+blog+post)"
		},
		{
			"post_id": 9,
			"title": "社会百态",
			"date_published": 1469062262,
			"body": "1、 [这是坏人变老了还是老来少的调皮啊](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:6:%E8%BF%99%E6%98%AF%E5%9D%8F%E4%BA%BA%E5%8F%98%E8%80%81%E4%BA%86%E8%BF%98%E6%98%AF%E8%80%81%E6%9D%A5%E5%B0%91%E7%9A%84%E8%B0%83%E7%9A%AE%E5%95%8A)\n\n2、[某地城管队员拿了几个小贩的水果，自称无所谓](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:17:%E6%9F%90%E5%9C%B0%E5%9F%8E%E7%AE%A1%E9%98%9F%E5%91%98%E6%8B%BF%E4%BA%86%E5%87%A0%E4%B8%AA%E5%B0%8F%E8%B4%A9%E7%9A%84%E6%B0%B4%E6%9E%9C%EF%BC%8C%E8%87%AA%E7%A7%B0%E6%97%A0%E6%89%80%E8%B0%93)\n\n3、[城管众目睽睽之下掠夺冰糖葫芦，看了想哭](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:19:%E5%9F%8E%E7%AE%A1%E4%BC%97%E7%9B%AE%E7%9D%BD%E7%9D%BD%E4%B9%8B%E4%B8%8B%E6%8E%A0%E5%A4%BA%E5%86%B0%E7%B3%96%E8%91%AB%E8%8A%A6%EF%BC%8C%E7%9C%8B%E4%BA%86%E6%83%B3%E5%93%AD)\n\n4、[不知名学校的校园暴力和欺凌](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:20:New+blog+post)\n\n5、[上海松江警察VS抱小孩的妇女](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:28:%E4%B8%8A%E6%B5%B7%E6%9D%BE%E6%B1%9F%E8%AD%A6%E5%AF%9FVS%E6%8A%B1%E5%B0%8F%E5%AD%A9%E7%9A%84%E5%A6%87%E5%A5%B3)"
		},
		{
			"post_id": 8,
			"title": "群体事件",
			"date_published": 1469062106,
			"body": "1、 [20170720江苏新沂华宏钢厂员工劳资纠纷斗殴事件](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:3:20170720%E6%B1%9F%E8%8B%8F%E6%96%B0%E6%B2%82%E5%8D%8E%E5%AE%8F%E9%92%A2%E5%8E%82%E5%91%98%E5%B7%A5%E5%8A%B3%E8%B5%84%E7%BA%A0%E7%BA%B7%E6%96%97%E6%AE%B4%E4%BA%8B%E4%BB%B6)"
		},
		{
			"post_id": 7,
			"title": "小作坊徒手罐啤酒有图有视频有报案，可惜无结果",
			"date_published": 1500595870.449,
			"body": "之前网传的徒手罐啤酒被证实是假冒百威的，然后百威报了案，虽然有图有视频，人物清晰，还有当事人报案，然而并没有见到结果.\n\n* * *\n\n<video controls=\"\" width=\"320\" height=\"240\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Jiapijiu1.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Jiapijiu1.mp4\" type=\"video/mp4\">\n您的浏览器不支持 video 标签。</video><video controls=\"\" width=\"320\" height=\"240\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Jiapijiu2.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Jiapijiu2.mp4\" type=\"video/mp4\"></video>\n所有的新闻都是一如既往的不去追究责任,查获真凶，反而教大家如何甄别假酒。\n一个多月过去了，搜遍网络也还是没有找到这个案件的后续结果，天气更热了，啤酒喝的更多了，也只能给大家一个鉴定方法，自求多福吧:\n\n# 辨别方法1：<font color=\"blue\">看包装</font>\n\n<font color=\"red\">真的啤酒商品标签图案比较清晰，颜色比较鲜艳，摸上去表面有凹凸感，冒牌的啤酒商品标签则比较模糊、颜色比较浅。假冒啤酒的瓶盖是重新压上去的，因此会比较松.</font>\n![image alt](data/img/jianbiejiapijiu1.png)\n\n# 辨别方法2：<font color=\"blue\">闻气味 看气泡</font> <font color=\"red\">由于假冒啤酒的瓶盖是重新压上去的，极易存在密封不严的情况，容易导致挥发，啤酒缺少酒香。不会冒气泡或气泡很少。真的啤酒打开盖后，闻起来有很浓的酒香味，打开后气泡较多。</font>\n![image alt](data/img/jianbiejiapijiu2.png)\n\n# 辨别方法3：<font color=\"blue\">尝味道</font>\n\n<font color=\"red\">饮用假冒啤酒时，会感到味道比较淡，没有什么啤酒味。而真的啤酒味道则比较重，酒味也比较浓。</font>\n![image alt](data/img/jianbiejiapijiu3.png)"
		},
		{
			"post_id": 6,
			"title": "这是坏人变老了还是老来少的调皮啊",
			"date_published": 1500588751.956,
			"body": "老爷爷路都快走不稳了，还有力气将共享单车全部推倒，是恶意还是调皮？\n\n* * *\n\n<video controls=\"\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Old1.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Old1.mp4\" type=\"video/mp4\"></video>\n\n老爷爷硬是拿着锤子敲开了共享单车的锁：\n\n<video controls=\"\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Old2.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Old2.mp4\" type=\"video/mp4\"></video>\n\n高铁之上为老不尊，汗颜呐：\n\n<video controls=\"\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Old3.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/Old3.mp4\" type=\"video/mp4\"></video>"
		},
		{
			"post_id": 4,
			"title": "新人扫盲导航",
			"date_published": 1500578935.814,
			"body": "[零网教学 zh-wiki](http://127.0.0.1:43110/1NCezLP8aXjABVreBB1CKGPub2tKTtyhWU/?Page:home)\n\n[**ZeroNet网站中文导航**](http://127.0.0.1:43110/0cnguide.bit/?Home)\n\n[0Net123 中文网站导航](http://127.0.0.1:43110/0net123.bit/)\n\n[编程随想的博客镜像](http://127.0.0.1:43110/bcsx.bit/)"
		},
		{
			"post_id": 3,
			"title": "20170720江苏新沂华宏钢厂员工劳资纠纷斗殴事件",
			"date_published": 1500573118.833,
			"body": "新沂华宏钢厂员工因劳资纠纷引发斗殴，有人传言打死人了\n\n* * *\n\n<font color=\"red\">政府一方</font>：新沂市人民政府官方帐号的“新沂发布”发了这样一篇文章\n\n`2017年7月16日，华宏特钢职工黄某和张某两人在工作期间打架（两人均为新沂人），被车间主任郑某（福建人）按照厂纪给予一千元罚款。黄某当时并未对该处罚表示异议。7月19日，黄某上班期间故意与车间主任发生口角并用安全帽砸破自己的头，谎称被郑某打伤（视频）。7月19日下午15时29分，新沂市公安局接报警称华宏特钢有限公司有人被打伤。接报后，当地派出所迅速赶赴现场。经查，当事人黄某（男，45岁，港头镇人，华宏特钢厂工人）因劳资纠纷与厂方发生冲突，后纠集亲属多人到厂，与厂内员工发生打斗，过程中致3人轻伤，3人轻微伤，公安机关于当日依法对相关人员传唤调查。 20日早晨8时许，黄某家人煽动亲友及部分群众以“新沂人被福建人打伤”为由到厂区门口聚集，一度造成现场混乱。事情发生后，新沂市主要领导第一时间赶赴现场指挥处置工作，市委市政府迅速成立了由公安、人社、开发区等部门组成的应急处置工作领导小组，组织力量现场疏导、教育，截止20日12时，现场已基本平静，后续处置工作正有序展开。`\n\n并在文章结尾附上了这样一个视频，显然是监控：\n\n<video controls=\"\" width=\"320\" height=\"240\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170719xinyihuahongtegangjiankong.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/20170719xinyihuahongtegangjiankong.mp4\" type=\"video/mp4\"></video>\n\n<font color=\"red\">民间网上流传</font>的是这样两个视频：\n视频1：据称是打工人视频，不知真假\n\n<video controls=\"\" width=\"320\" height=\"240\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/10_1e1cf47ca25bc596cc559e11f47d31bf.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/10_1e1cf47ca25bc596cc559e11f47d31bf.mp4\" type=\"video/mp4\"></video>\n\n视频2：据称是现场视频：\n\n<video controls=\"\" width=\"320\" height=\"240\"><source data-cke-saved-src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/1500576287839.mp4\" src=\"http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/optional-files/1500576287839.mp4\" type=\"video/mp4\"></video>"
		},
		{
			"post_id": 1,
			"title": "兼听则明，偏信则暗",
			"date_published": 1433033779.604,
			"body": "古人云：兼听则明，偏信则暗。\n\n* * *\n\n夫民别而听之则愚，合而听之则圣。——《管子·君臣上》\n\n上（唐太宗）问 魏徵 曰：“人主何为而明，何为而暗？’对曰：‘兼听则明，偏信则暗。” ——《资治通鉴·唐太宗贞观二年》\n\n今人毛泽东亦云：\n\n唐朝人魏徵说过：“兼听则明，偏信则暗。”也懂得片面性不对。可是我们的同志看问题，往往带片面性，这样的人就往往碰钉子。——《矛盾论》\n\n无论古人今人，都懂得兼听则明，，偏信则暗，为什么如今却丧失了这个常识呢？微博删贴，禁止评论，贴吧删贴，关闭贴吧，新闻删贴，禁止跟贴。这是不应该的。"
		}
	],
	"links": "**<font color=\"red\">写在前面</font>**\n[关于本站](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:26:%E5%85%B3%E4%BA%8E%E6%9C%AC%E7%AB%99)\n[新手导航](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:4:%E6%96%B0%E4%BA%BA%E6%89%AB%E7%9B%B2%E5%AF%BC%E8%88%AA)\n[给我写信ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=coy)\n\n**<font color=\"green\">分类目录</font>**\n[社会百态](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:9:%E7%A4%BE%E4%BC%9A%E7%99%BE%E6%80%81)\n[民生安全](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:10:%E6%B0%91%E7%94%9F%E5%AE%89%E5%85%A8)\n[群体事件](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:8:%E7%BE%A4%E4%BD%93%E4%BA%8B%E4%BB%B6)\n[牢骚满腹](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:12:%E7%89%A2%E9%AA%9A%E6%BB%A1%E8%85%B9)\n\n**<font color=\"red\">友情链接</font>**\n[工科菜鸡的瞎bb](http://127.0.0.1:43110/1NsQX8JQYbjDfM3Die226PQ8WwMqXidZRE)\n[半日偷闲](http://127.0.0.1:43110/zeee.bit/?Home)\n\n**<font color=\"bronze\">历史归档</font>**\n[2017年08月](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:24:201708%E5%BD%92%E6%A1%A3)\n[2017年07月](http://127.0.0.1:43110/1DFjnPxzp63Nb4BPpnPyAnqf1y6nUcNKBg/?Post:11:201707%E5%BD%92%E6%A1%A3)"
}