{"cert_user_id": "62gs8ha@github", "next_comment_id": 3, "comment": {"1604065071_mirrored_HelloZeroNet_github": [{"comment_id": 1, "body": "Would it be possible to create a normal website which isolates large media files or sections of the website so that a viewer onlky downloads them when they try to view it?\n\nOr is the Merger Sites feature only restricted to the social site being planned?\n", "added": 1470353214, "modified": 1470353214, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/232#issuecomment-237739740", "source_type": "github"}, {"comment_id": 2, "body": "@HelloZeroNet Thanks. Can you explain the syntax of that Optional Files argument? So say if I wanted to make MP3 embedded audio or embedded PDFs optional, how would I do it? What are the js and css arguments in that syntax string?\n\nTo save having to go to the other page, here is the Optional Files argument for everybody:\n\n\"optional\": \"((js|css)/(?!all.(js|css))|data/mp4-._/._)\",\n\nHere is another one:\n\n\"optional\": \".*\\.(jpg|png|gif)\",\n", "added": 1470442485, "modified": 1470442991, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/232#issuecomment-238002817", "source_type": "github"}]}, "next_topic_id": 2, "topic": [{"topic_id": 1604065363, "title": "[feature suggestion] Wordpress-style admin panel and WYSIWYG editor", "body": "As it says on the title. I think by implementing a Wordpress-style admin panel and WYSIWYG editor for the default ZeroNet blog, we can enable websites and blogs to be much more content and feature-rich. I believe this will drive adoption of ZeroNet as it will make the creation of aesthetically-pleasing sites quite easy for the novice who most likely is not prepared to spare the time to learn HTML. \n\nI did a quick search and found this open-source CMS and Admin panel:\n\nhttp://www.opensourcecms.com/scripts/details.php?scriptid=86&name=Textpattern\n\nI think with some minor tweaks, such as integration of one-click embedded video (especially with WebTorrent.io and Instant.io support), this can make the creation of nice-looking websites a breeze. I think this admin panel could be somehow integrated with the standard ZeroNet software as part of a suite of media-creation tools (such as blog creation tools, WYSIWYG html website creation tools, One-click forum creation and design tools etc).\n\nI have also noticed that BootStrap is HTML and Javascript-based. Is it possible to integrate that and a free and open-source Bootstrap admin panel into ZeroNet?>\n\nhttp://getbootstrap.com/\n\nFree and open-source admin panels:\n\nhttps://almsaeedstudio.com/\n\nI do realise that there are already some basic tools with ZeroNet to do the things I described, but for the novice who does not know HTML, he or she would be turned off. Without HTML skills, he or she cannot create the type of functional and feature-rich websites on ZeroNet that we take for granted on the normal internet, which we find on CMS' like WordPress.\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1466116420, "modified": 1510951176, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/499", "source_type": "github"}]}