{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1556986926,
			"title": "Lost ZeroBit ID whilst trying to use 'Multiuser' plugin?",
			"body": "I enabled the Multiuser plugin in Zeronet and went to ZeroID to get a new ID. It registered the user on the zite but I didn't get the credentials. Did I do something wrong or is this a glitch? I'm just playing around with Zeronet at the moment so it could be simple user error. No record of the new user ID exists in user.json so I'm not quite sure what happened. Obviously this user ID registered fine (when not using the multiuser plugin).",
			"added": 1556986925
		},
		{
			"topic_id": 1556988115,
			"title": "Is Zeronet ready for mass market?",
			"body": "I'm just exploring Zeronet at the moment, looking into it as an option for the web going forwards (because of all the problems with centralization etc.). I was just wondering, what's the general consensus with trying to pull the general public into Zeronet. Any scaleability issues? Security issues? Anything like that?\n\nI know there is still a lot to do but from what I can see so far a 'killer app' of some sort could make the ZeroNet community skyrocket. Putting a wrapper around ZeroMe and making it a click and go mobile app of some sort could be the sort of thing that pulls in millions. What would be the potential drawbacks? \n\nAm I missing anything? As I say I'm new to this and just testing everything out but would be interested to hear what everyone's views are.",
			"added": 1556988113
		}
	],
	"topic_vote": {
		"1557063639_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"1556988115_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": 1,
		"1555000915_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1557191513_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1
	},
	"next_comment_id": 12,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Testing one two...",
				"added": 1556988423
			}
		],
		"1556988115_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [
			{
				"comment_id": 2,
				"body": "> [diff](#comment_4_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD): Software performance. Current implementation is not enough for c10k.\n\nAh, is that 10k hosting the same website? Issues with how it updates all the peers and so on?\n\nEDIT: Just for clarity, may I ask what is the bottleneck specifically? ",
				"added": 1556993039
			},
			{
				"comment_id": 3,
				"body": "> [blazingeye](#comment_17_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Zeronet is not market and it's not for market.\n\nBy mass market I mean the internet at large. Is it ready for the mainstream and tens of thousands (or more) users. Same way that a physical product is moved from development to mass market/ global deployment.",
				"added": 1556994392
			},
			{
				"comment_id": 4,
				"body": "> [pexo](#comment_83_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): I haven't really gotten around to test Py3 which is supposed to be a lot faster, but zeronet currently doesn't handle a lot of activity very well, since all content.jsons must automatically be downloaded and retrieved(and checked). Your client effectively DDOSes itself if you have somewhere around 20 posts per second on any zite at any one time. You could see that if you were on millchan about haft a year ago, when a fairly large site of, let's say, politically minded individuals linked to it and zeronet became unusable for about two to three days or so for those that had millchan and didn't pause it because the client couldn't keep up updating the content.jsons.\n\nAh, I see. Thanks for explaining it so clearly.",
				"added": 1556997998
			},
			{
				"comment_id": 6,
				"body": "> [quantumworld](#comment_399_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Subxero:  Zeronet is ready for everyone. So toss some links out and advertise it. You know it is good when you get lots of backlash about posting links. Government's hates Zeronet because they cant control it.\n\nYeah, it's interesting looking through the comments on the board. I wonder if there are a few chan raid tactics being deployed. Derailing conversations and so on. Shilling irrational positions in order to make the board look kooky etc. You see it a lot on Reddit and so on. Not sure it's happening here yet. Maybe, maybe not but worth bearing in mind. I'll start promoting ZeroNet once we have 'click and go' app of some sort. I think what will sell it to the masses will be a simple implementation of ZeroNet (Via ZeroMe or some distributed chat or whatever). If it's easy to use and robust enough to support the traffic I think the time is coming for people to pile into ZeroNet.",
				"added": 1557085759
			},
			{
				"comment_id": 7,
				"body": "> [quantumworld](#comment_400_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): subxero: I have been in chat rooms for 30+ years and the tactics are exactly the same thing over and over. Its like they never updated there play book and they all act about the exact same. I actually find this so laughable it isn't even funny. Oh well, I may even wright a lisp script file to analyze there content. I can do more with Zeronet since the data is right here to look at. And the search on Zeronet is pretty good.  If  user name says _ then say _ to counter and side track __ conversation. (Yaaawwwnnnnnn... It's so boring!!!)\n\nYeah, the trick is trying to get them to revel their agenda so you can tell whether it's anything orchestrated or just some isolated individual. If it's the former then you can be on the look out for similar accounts using similar messaging. The fun of public forums, eh?",
				"added": 1557088838
			},
			{
				"comment_id": 8,
				"body": "> [quantumworld](#comment_402_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): subxero: I think there is one guy running hundreds of user accounts on many virtual machines on a bunch of chat rooms. I don't have the computer horse power to do a large data grab of postings on twitter Facebook and other sites to do a text trend analysis. I am sure if some one could do that they could trace it back to a central type of code or user text style. Here on Zeronet it would be super easy todo.  Emacs is really the center of all creation. Shhh don't tell anyone I told you that. The lisp code may leak out. ((*/%) What a bitch of a leak.\n\nHaha, it's way worse than that. Astroturfing (false 'grass roots' comments on comment sections and public boards) is massive multi-million dollar business. People get paid $10 an hour to post pre-decided 'talking points' to help with public 'consensus building'. You see it with political (and religious and national) factions on all sides, all the time. The worst I've seen was literally the same post, word for word, posted on two separate boards by two separate users in regards to some public event or other. They had literally copy and pasted their morning briefing notes in response to a 'negative narrative' without even modifying their guide text.  The way you expose them is by engaging with them in conversation and then raise certain questions that you know they have canned answers to. They will jump at the chance to explain it all in detail as they get paid per post I believe (depending upon the organization and particular campaign they are running). There are other tactics, of course, such as posting questionable content to smear a board/group or just derailing conversations that are going the 'wrong' way or simply raising topics that will started a heated debate (which are politically irrelevant) to keep the users distracted. It's an interesting area to look into. \n\nThe actual financial reports for a few of them were leaked a few years ago showing the scale of operations and it was in the multi-millions for a single political party. I've not seen anything at that level here yet. \n\nIt's Election season in the USA next year, it will all kick off into overdrive again then. At the moment it all seems quite quiet.",
				"added": 1557091652
			},
			{
				"comment_id": 9,
				"body": "> [quantumworld](#comment_401_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): subxero:I do not think that the android app is ready for prime time for the average user. But that is now and it can change. Maybe the next version will address some user gui ease of use issues.\n\nAh, yes, I've not bothered with the Android App yet. I just run the source code on Android manually. I'm thinking about wrapping ZeroMe or similar up as a single App (or designing my own, I've not started on ZeroNet development properly yet). The only thing that needs to be shared between apps would be the user certificate etc. granted by ZeroID. I'm thinking that could be exported and then imported into another app so you can have a single user profile across all platforms. If you want to that is.",
				"added": 1557092585
			},
			{
				"comment_id": 10,
				"body": "> [quantumworld](#comment_403_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): subxero: People get paid $10 an hour to post pre-decided 'talking points'  [...]\n\nI'm sure word will spread fast regarding ZeroNet as soon as any remaining issues are ironed out. I have a feeling it will be a one shot deal though. It's about getting the general public here rather than any 'fringe' groups. If the fringe groups come first  then ZeroNet will be smeared by the MSM and it will be harder to draw people in. See what happened to Gab.ai or tor hidden services for example. It would have to hit a certain critical mass of 'normal' users before it would have a chance of, for example, usurping Facebook (which it could do, down the line). \n\nI'm very impressed so far. I really think it is the perfect solution for many of our problems. Very high quality code all round. So much potential. \n\nRegarding the android App, I think I saw that the old maintainer had used Kivy and had found some limitations in the framework or something and had said that the only option was a total rewrite. Don't quote me on that, I didn't look into it too closely and besides, running it from source in a Terminal allows you to see the console log of what's happening in the background. Useful for getting your head around Zeronet generally. \n\nLooking forwards, what do you imagine would be a good platform to have on here? The current developers seem to have done a great job cloning various platforms (medium, twitter, voat, basic blogging etc.) generally. What do you see the future of ZeroNet being? ",
				"added": 1557099490
			}
		],
		"1556986926_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [],
		"1555000915_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 11,
				"body": "I'll have a look at this and test it out. Thanks for putting it all together. I'll get back to you if I create anything interesting.",
				"added": 1557100997
			}
		]
	},
	"comment_vote": {
		"21_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"158_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"119_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"11_14iCuAn3m8Uz6fkJcu7KEPbHdSR2qmmrH1": 1,
		"83_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"5_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": 1,
		"4_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": 1,
		"399_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"400_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"9_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"8_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"8_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"11_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"7_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"10_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"29_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"401_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"404_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"47_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"18_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"21_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"41_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"6_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1": 1
	}
}