{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1606601124,
			"title": "The Future Of The Deep Web",
			"body": "What do you think will happen when advertisers start digging into the deep web?\nSince much of the popular deep web is based on open source technology, then only thing that has kept advertisers out so far has been... well, just the fact they haven't thought to do it.\nWhile the most popular deep web areas may not cooperate with advertisers, there really isn't anything stopping them from posting on places like this or paying listings sites from stapling misleading links on their sites.\nDo you think (mainstream, commercial) advertisers will ever invade the deep web?",
			"added": 1606601123
		},
		{
			"topic_id": 1617298889,
			"title": "Anyone Know Why 4Chan Is Down (April 1st, No Joke)",
			"body": "The Cloudflare Copy Is Up But The Live Version Is Down.\nAnyone Know What's Going On?\nAnother War Like In 2009?",
			"added": 1617298887
		},
		{
			"topic_id": 1618331544,
			"title": "Predators in Politics (not just MG)",
			"body": "\"Weak people seek revenge.\nStrong people seek forgiveness.\nIntelligent people ignore.\"\n- @JamesCappleman\n\nSo, immediately after leaving the priesthood after being outed as \"gay\", he married a lawyer and ran a racist campaign in Chicago for an alderman spot.\nWhen pointed out that his policies and business dealings were hurting the poor in the area, he responded by changing his Twitter bio to say that intelligent people just ignore abuse.\nThere's been rumors he left the priesthood over child sex abuse allegations and that is how he met his lawyer husband.\nI have no problem with gay people and identify as passive pansexual myself, but something about the way the guy phrased this message makes me think he is in fact a predator.\nI also can't find any philosophers that claimed it was wise to ignore abuse/problems, nor calling revenge a concept solely for the weak.\nIt sounds like sophism that a predator would peddle to their victims.\n\nHis policies have gotten so bad people have picketed his house calling him a racist (just search \"James Cappleman racism/protest\" on youtube).\n\nIs this just politics?",
			"added": 1618331541
		},
		{
			"topic_id": 1621513388,
			"title": "Antivaxxers are mentally ill",
			"body": "Antivaxxers deny science, lie about what the mainstream scientific community say and what their conclusions are, and they use unsupported claims to peddle conspiracy theories.\nTherefore... they're mentally ill. Psychotic, specifically.\nHere are some facts:\n- There are no robots in the vaccines.\n- Vaccines have nothing to do with 5G.\n- Vaccination doesn't cause autism.\n- Vaccines do not cause allergic reactions in the overwhelming majority of the public.\n- Vaccines are effective.\n- Vaccines are not part of any \"psy-op\" to test conformity.\nGrow up.",
			"added": 1621513384
		},
		{
			"topic_id": 1621542671,
			"title": "Paranoid people are stupid, as are political extremists...",
			"body": "Just a reminder that you're all idiots.\nEvery few years morons like you keep claiming that the totalitarian government will drop down upon us.\nEvery few years you scream about Word War III.\nEvery few years it's another end of the World scenario.\nEvery few years you break down into tears and rage screaming that fictional material is a blueprint for reality.\nEvery few years you repeat conspiracies you read on 4chan or some other internet troll/skitzo platform.\nEvery few years you claim all Rights will be suspended.\nEvery few years you claim some magic leader will save us all.\nEvery few years you claim alien contact is around the corner.\nIt just goes on and on.\nWhat in sam hill makes you losers so addicted to this borderline personality + skizto bullshit?\nWhat kind of rush do you need satisfied so you don't relapse into cray-cray junkie dopamine land?\nYou know you're full of shit, otherwise you wouldn't post to rustle up your own jimmies.\nAnd this is a substantiated fact because you all claim no one will listen or you only speak with your echo chambers.\nTherefore the only possibility is that you do it rile yourselves up to feel something.\nGet some prescription drug you losers.\nReality isn't boring enough to need to make up bullshit to \"get off\" or feel empowered (\"in the know\").\nWatch videos of super storms. Read a book about the struggle to educated the public on science.\nAnything besides posting political flame bullshit and nutty conspiracy bullshit.",
			"added": 1621542666
		},
		{
			"topic_id": 1621828480,
			"title": "You claim to be extreme radicals yet also claim you're not the unhinged ones...",
			"body": "How quaint.\nHalf of you admit to being paranoid libertarians/anarchists and the other half admits to being fascist.\nYet, when a rational person asks to you consider the Scientific Method, Logic and Reason, you all freak out and start engaging in personal attacks and stating conclusions are incorrect even when they're supported with evidence.\nYou all claim the mainstream is part of some big conspiracy and keep claiming something will happen, but it never does.\nThere are so many flaws in your conspiratorial mindsets; least of all you reject the requirement of the burden of proof and in fact engage in shifting the burden of proof.\nGood luck with that.",
			"added": 1621828474
		}
	],
	"topic_vote": {},
	"next_comment_id": 78,
	"comment": {
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 1,
				"body": "Cuz pizza.\nCuz tacos.\nCuz Indian food.\nCuz Chinese food.\nCuz snack food.\nCuz orgasms.\nCuz hot baths.\nCuz interesting media.\nCuz swimming.\nCuz cultural revolutions.\nCuz technological revolutions.\nCuz justice revolutions.\nCuz economic revolutions.\nCuz of the Ashoka Principle.\nCuz smells.\nCuz sights.\nCuz warmth.\nCuz Oceans.\nCuz Jungles and Forests.\nCuz Deserts.\nCuz reasons.",
				"added": 1606601354
			},
			{
				"comment_id": 6,
				"body": "> [sj29msn5kz0ldmn](#comment_17_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): pizza - unhealthy and full of fattacos - sameindian food - india is a hellhole, dont support their govs by buying foodchinese food - china is a hellhole, dont support their govs by buying foodsnack food - unhealthy toxic garbage, dont support corrupted govs and greedy corpos by buying snacksorgasms - ok, but seem too short to be worth living for, and too difficult to find a gf and avoid pregnancy - in my hell country, good luck having affordable contraception, to say nothing of abortionhot baths - i dont have a bath, only shower spotmedia - mostly corrupted propagandaswimming - in coruna pandemic, no swimming is openrevolutions - in a normal healthy world, no revolutions would be neededtech revol - oh yeah, great! google, facebook, spyware, mics, surveillance cameras, toxic fumes cars, millions of annual victims of car accidents, and soon bill gates-sanctioned nanochips for remote human control. fuck tech.justice - see revolutionseconomic - horrible inequality, 1% of humans own half the world's money, as sick as can be, and revolutions, well...ashoka - wut? dont know about it , dont caresmells - most often toxic fumes and smelly shit in the toilet, then any actually good smellssights - yeah, grey-and-gray dystopian towns with occasional shades of grayish greyment are surely nice to look at, every fucking day on the way to slave workwarmth - global warming makes warmth questionable advantage, and now in my place is winter so also no warmth for me.oceans - dont care, never seen onejungles - sameforests - mostly the same, hard to find time and place to go to one, and it's still shit because of ticks, dangerous animals, and rubbish even in forestsdeserts - wut? fiery hellholes in which almost no animal can survive?reasons - not really, as described.\n\nOh you're just making up reasons to hate life.\nGo ahead then. Jump.",
				"added": 1609201793
			}
		],
		"1606531643_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": [
			{
				"comment_id": 2,
				"body": "Japanese soft style (a form of poached egg).\nThe style they include in traditional ramen where the yolk is only partially cooked all the way through to the point it's partially gelled.\nEither that or sunny side up.",
				"added": 1606601593
			}
		],
		"1606601124_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 4,
				"body": "> [dsfds56f4dfsd4f](#comment_3_13syutvzzp8g4tJP1c9m7vxDwRe7XUd82K): The holy grail for those advertisers is \"traffic\" non of those deep web open source tech has that...\n\nI've seen ads on sites that barely get any traffic. There was a period in the early 2000s that ads and popup ads were on every single site... causing such a problem that browsers had to eventually in-bake ad blocking.\nAs it is now, most people install ad blockers on sites now, but advertisers may find a way to get around that with the deep web.\nProtective layers could actually work against the idea of wedging out advertisers.",
				"added": 1606601856
			},
			{
				"comment_id": 5,
				"body": "> [tvpede](#comment_12_14JRtW3jByzZEQeEkG9QMXNi2jTKudcotJ): Advertising is a flawed business model and has no chance to exist in a fully free society.\n\nI don't know if that's true. I'm sure as soon as people were trading things they were yelling out that they were doing so.",
				"added": 1606601895
			}
		],
		"1608052496_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "It wasn't down.\nYour computer skills are a joke.",
				"added": 1609201919
			}
		],
		"1607947918_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 8,
				"body": "Citation needed.",
				"added": 1609201946
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 9,
				"body": "1. Corona is real.\n2. Epidemiologists agree that it spreads more than the flu and is more deadly.\n3. There was no vaccine for about a year.\nSo it's not a hoax. No one made money from this.\nGovernments lost money. Even pharma corps lost money because they lost more money on people panic buying than they're going to make on the vaccine.\n\nYou're an idiot.",
				"added": 1609202081
			}
		],
		"1608952482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "Right.\nBecause great journalism doesn't come from educated journalists that base their claims on substantiated facts...\n...it comes from internet conspiracy theorists that post debunked hypotheses mined from random conjecture that itself was derived from nationalist and prejudiced propaganda.\n(Sarcasm)",
				"added": 1609202336
			}
		],
		"1608830774_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 11,
				"body": "Why would you think that you have to fight another Country at all?\nAre you seriously so mentally ill that you sincerely believe if someone isn't number one that they die?\nHoney, baby... America hasn't been number one since the 1980s.\nLook it up.\nAlso, China isn't a \"full-blown police state\". Most of China is generally free, and the Chinese Government only clamps down on loud anti-Nationalists (which I agree is fascist).\nBut it's not some ultra-dystopia. Even anti-Chinese YouTubers show day-to-day life in China is pretty much unimpeded by the Government.\nPeople work in normal shops, have families, etc.\nYes, China has it's issues, but so does every Country.\nThe dumb fear mongering about China is unfounded.\nThey have made zero effort to \"take over the entire world\".\nThey're equally allowed to expand business and fight for their rights just like you, me and everyone.",
				"added": 1609202636
			}
		],
		"1608645993_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 12,
				"body": "Voat (and Poal) are leftovers from 4chan's /pol/ and stormfront.\nThey only thing they \"need\" is a lesson in basic Human Rights and Epistemological Sociology.",
				"added": 1609202723
			}
		],
		"1608712796_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 13,
				"body": "What kind of person can't afford a $60 game?\nI can understand pirating old films and games because who cares and it might be the easiest way to obtain them...\n...but for new games? Pony up the money. Be an adult.",
				"added": 1609202808
			}
		],
		"1608117446_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": [
			{
				"comment_id": 14,
				"body": "JP is an idiot that uses logical fallacies in order to promote his \"feelings\" and paranoia as facts.\nHe's an idiot.\nThe jackass said epidemiology wasn't a real science and that viruses couldn't spread and do people harm if people just pretend a pandemic wasn't a real thing.\nThis is what he implied in his \"comedy\" bits.\nStop listening to uneducated sophists that couldn't pass an Epistemology entry exam.",
				"added": 1609203037
			}
		],
		"1608604929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 15,
				"body": "\"Upper echelon gamers\" - is the dumbest phrase I've ever heard in my life.",
				"added": 1609203082
			}
		],
		"1608693974_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 16,
				"body": "Right, so your corner of the world supersedes all the data elsewhere.\nWhy do I get the feeling that you don't grasp how science works?",
				"added": 1609203161
			}
		],
		"1609976542_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 17,
				"body": "\"Trump supporters\"... you mean deluded terrorists.",
				"added": 1610011735
			}
		],
		"1614409620_172Vi8HghL8PzkqoAVbGbfvE456rnfkWES": [
			{
				"comment_id": 18,
				"body": "Many things that perform network trickery may be picked up as malware. This includes obfuscation and things like scanners. You'd be surprised as to what is considered \"malware\" by major security companies, despite popular understanding of massively used applications. Generally, anything that \"CAN\" be used to get around security is labeled as \"malware\".",
				"added": 1614454573
			}
		],
		"1614539923_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 19,
				"body": "I don't trust any browser that is \"privately\" owned and doesn't have an opensource counterpart.\nThe larger the company, the more whistleblowing eyes there are.\nYes, large companies are often corrupt as well, but I the numbers game over \"good faith\" claims any day.\nStatistics are always more reliable than faith and intuition.",
				"added": 1614875608
			},
			{
				"comment_id": 21,
				"body": "Asking people what kind of browsers they use? \nDo you expect anyone to fall for th... just kidding.\n\nFirefox with the following:\nClearURLs\nNoScript\nUserAgent Switcher\nClear Browsing Data\nDecentraleyes (disable if browser slows)\nVulners Web Scanner\nuBlockOrigin\nPrivacy Badger\nNordVPN (yeah, I know, but they're improving despite the setback... two years ago?)\n\nChrome is best for video viewing\n\nTor has been compromised over and over, but still okay for basic blah blah blah.\n\nThe newest iteration of Edge is actually lightning quick, but too little too late. Plus everyone is paranoid of Microsoft.",
				"added": 1614875950
			}
		],
		"1614861650_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 20,
				"body": "\"Libtards\" - Spoken like a true brainwashed sycophant, desperate to use made up words created for the soul purpose of ad hominem based obsessions.",
				"added": 1614875688
			}
		],
		"1614693108_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 22,
				"body": "Oh, quit your conspiracy theory bullshit please.\nHe didn't \"switch\".\nAs soon as he made bank he started getting invested in art, photography, philanthropy, etc.\nThe philanthropy lead to an interest in diseases. \nAfter being outed as moderately narcissistic and sociopath in the Microsoft monopoly case, he turned his focus towards more philanthropy; partially to repair his image and legacy, partially to improve himself and the world around him.\nHe's analytical. Deal with it.",
				"added": 1614876120
			}
		],
		"1614725482_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 23,
				"body": "That's how Keynesian Economics work.\nContrary to what internet conservatives and libertarians will have you believe, the Austrian school of Economics ALSO supports equating spending to positive economic outcomes.\nHoarding isn't Austrian economics, and an economy has to move to be working.\nEveryone shutting themselves up in their houses doesn't produce wealth.\nWealth is a concept, as is value. Contrary to what many people have been lead to believe, most \"valuable\" materials aren't really that more precious than other common materials.\nYes, this applies to gold and diamonds as well.\nNo, your coin collection isn't going to make the history books, and you can't trade any of that if the economy crashes due to hoarding and a lack of spending.\nThink of the economy as a living thing. To be alive, it has to move.\nYou're not promoting hibernation or nut-squirreling, you're promoting hoarding and suicide.\nStop being stupid please.",
				"added": 1614876442
			},
			{
				"comment_id": 29,
				"body": "> [bortbortbort](#comment_10_16e6K52Q1xLbhxAFrLeXvDjS5q8QhQ4eQm): government spending based on borrowed funds isn't good and it's inflating the bubble.\n\nIt's a myth that the current base of the currency is based on borrowed/owed articles.\nThat's only flung around in the Sovereign Citizens Movement circles of utter bullshit.\n\nNo, money isn't borrowed from the Treasury, Mint or Federal Reserve.\nNo, the Federal Reserve is not a \"private company\" that makes loans out to the Mint.\nIt's part of the Federal Treasury Department.\n\nThe value of the US Dollar is based on a number of things:\n1. GDP value\n2. Import/Outport Value\n3. Precious Reserves (Minerals, Metals)\n4. Natural Resource Reserves (Gas, Oil)\n5. US Based Stock\n6. US Bonds\n\nForeign investors hold roughly 40% of the US' debt, which is outmatched by how much debt is owed to the USA by the same Countries.\nNo, they don't cancel each other out instantly to get a more accurate \"live\" balance; that's not how live economics work.\nA example would be that the US owes China 1.1 Trillion, but China owes the US 2.1 Trillion.\nThis isn't paid back and forth with Tax money, it's virtual credit backed by Valuable Resource Reserves which can only be pulled at the end of the economic cycle.\nNo Country has done this because then they would have to start all over and pay to get back into the trade cycle (current estimated cost of this is about 4 Trillion, with 10 Trillion required for Rebound Reserves).",
				"added": 1615544478
			}
		],
		"1613342125_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 24,
				"body": "> [mateusrm](#comment_5_15qVru57g2Gpumhby7UkDWuS3qKnmGSqG8): they already uses teleport, last one its from canada\n\nCitation needed.",
				"added": 1614876552
			},
			{
				"comment_id": 25,
				"body": "> [markinformer](#comment_5_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4): From what I can tell, China doesn't want you to know they are trying to build a time machine. A time machine is hardly a small project anyway. You'll need someone as bright and eccentric as Tesla to even begin I would say.\n\nCitation needed.",
				"added": 1614876567
			}
		],
		"1615534190_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 26,
				"body": "1. Move your cursor to their comment.\n2. You will see three dots appear in the upper right of their comment box.\n3. Click it.\n4. Select \"Mute This User\"",
				"added": 1615543350
			},
			{
				"comment_id": 33,
				"body": "> [cvs77user1](#comment_3_13PRLtXnYDj2ovZW1NeDJpE9ZnCpW51tPg): the problem is that captain404 can't cope with encensored speech... he is going all crazy inside the code to find a way to censor nodes to remove user forever  :) hehehehe  a classical demoncrat :). [...]\n\n1. Claiming your assumption is true on the basis of your own intuition of what goes on in other's heads... is a mixture of the Mind Projection Fallacy, the Argument from Ignorance Fallacy, Confirmation Bias and the Appeal to Motive Fallacy.\n2. Ignoring annoyances is no different than avoiding harm; your belief in self-hard to prove toughness is ridiculous and without rationale.\n3. You seem to be unable to cope with the idea that people don't have to listen to you. Odd. Why are you so sensitive to this?\n4. You're obviously a mentally ill person that is obsessed with seeing everything through a \"political enemy\" or \"political asset\" lens. People can just want to avoid seeing things they're not interested in.",
				"added": 1615762375
			}
		],
		"1615341294_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG": [
			{
				"comment_id": 27,
				"body": "They're not banned. The only books actually banned are books that contain illegal things like perverted crap.\nThis \"they're banning books!\" is mixing up Cancel Culture with Banning.\nCancel Culture is when people decide as a group not to support something.\nThat's just people exercising their rights.\nSome may even protest to companies, which is also their right.\nBut it's not law.\nAnyway, it's Conservatives that have a history of banning books.\nLiberals just point to harmful media. How is that \"hiding\" anything if they're pointing to it as an example of destructive media?",
				"added": 1615543640
			},
			{
				"comment_id": 32,
				"body": "> [cvs77user1](#comment_6_13PRLtXnYDj2ovZW1NeDJpE9ZnCpW51tPg): wrong cancel culture or wokism is a front for the take over of the usa... rather than wanting to not be exposed to something (mute user) they want to ban to have full control of discourse, speech, and then liberty and then your assets and even body (specially the one of your children).\n\n1. A take over by whom?\n2. How is ethical analysis and action a \"front\"?\n3. Why is direct exposure a requirement for anything?\n4. The Germans didn't leave up Nazi bullshit to be reminded of why they were wrong, correct or incorrect?\n5. Canceling isn't the same as legalizing; It's just means not supported. Nothing has been criminalized.\n6. Again, showing ethics and civil standards are not the same thing as thought control.\n7. Do you know what a Slippery Slope Fallacy is?\n8. The Children comment is a complete non-sequitur. Do you know what that is?",
				"added": 1615762143
			},
			{
				"comment_id": 34,
				"body": "> [ov105user1](#comment_5_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy): t take\n\nCancel culture is a just holding people accountable for criminal actions or prejudice.\nThat doesn't undermine all of \"western civilization\" unless you're claiming \"western civilization\" is defined by crime and prejudice.\n\"Cultural Marxism\" is a conspiracy pushed by The Daily Stormer, a neo-nazi forum.\n>> \"you values are threatened by ours\"\nMy only values are Evidence Based Thinking and Epistemic Ethics.\n\nI think you may have a mental illness.",
				"added": 1616871259
			}
		],
		"1615300036_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": [
			{
				"comment_id": 28,
				"body": "Your conspiracy theory is lacking in citations and is just a dumb narrative.\nInto the trash your opinion goes.",
				"added": 1615543717
			},
			{
				"comment_id": 30,
				"body": "> [markinformer](#comment_13_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4): You forgot to say “‘Baseless,’ ‘Without evidence,’ ‘Debunked’.  Your narrative likely notes that Fauci is a saint of a good man and a really fine scientist beyond reproach.\n\nArgumentum ad absurdem fallacy detected.\nAsking you for a citation doesn't at all indicate a claim of faith on the other end.\nI'm an atheist and an evidentialist. All claims require evidence. Fauci isn't the only scientist on this case; the World Health Organization and millions of healthcare professionals are involved as well.\nOccam's Razor indicates the simplest explanation is the most rational one.\nIn this case, an pandemic is far more rational than a vast conspiracy theory.\nTake your straw man and absrudem arguments elsewhere, you mentally ill, tinfoil-hat wearing lunatic.",
				"added": 1615761893
			},
			{
				"comment_id": 31,
				"body": "> [peaceistheway](#comment_18_13jbVt6WuLu9Rp7YZwUceYVkYgyaxBfWWk): let's settle all of this with some Enhanced interrogatory Techniques aka waterboarding, however after queuing all the friends of epstein /dreamin !\n\nNon-sequitur.",
				"added": 1615761943
			},
			{
				"comment_id": 35,
				"body": "> [peaceistheway](#comment_18_13jbVt6WuLu9Rp7YZwUceYVkYgyaxBfWWk): let's settle all of this with some Enhanced interrogatory Techniques aka waterboarding, however after queuing all the friends of epstein /dreamin !\n\nThe fact you make all sorts of incoherent comments and immediately escalate to comments that contain violence indicates you are mentally ill, especially when your username is \"peaceistheway\".",
				"added": 1616871335
			}
		],
		"1616864409_1ASw9nbUv8QsYxWggwsMsNZ37STaEo26Di": [
			{
				"comment_id": 36,
				"body": "1. No one clicks on HTTPS links on here.\n2. I doubt any site called \"minds.com\" is a legit source for anything.",
				"added": 1616871435
			},
			{
				"comment_id": 39,
				"body": "> [scotcyguy2](#comment_86_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): The fact you have manged to be on the internet and not heard of minds kind of puts real doubt on your credibility\n\nSays the idiot believing in conspiracy theories.",
				"added": 1617225082
			},
			{
				"comment_id": 43,
				"body": "> [neosin](#comment_1_1ASw9nbUv8QsYxWggwsMsNZ37STaEo26Di): stay ignorant\n\nYou clearly don't even know what epistemology is, let alone epistemic differentials or sound reasoning/conclusions.",
				"added": 1617661550
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 37,
				"body": "Trollololololol...",
				"added": 1616871455
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 38,
				"body": "Trying to eliminate the Free Press is a sign you've been brainwashed by fascist propaganda.\nc17h21no4 & hyperangrymuppet are obviously mentally ill, and the rest of you posting on here don't seem much better.",
				"added": 1616871659
			},
			{
				"comment_id": 44,
				"body": "I'm reporting this thread to the FBI. I'm also reporting the earlier BBC threats to Scotland Yard and MI5.",
				"added": 1621184575
			},
			{
				"comment_id": 62,
				"body": "> [materialdefender](#comment_8_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP): good luck with that. they will laugh at you more than we are.\nLoons laughing at the person reporting a \"CNN kill list\"?\nI can live with that.\nBy the way, you should really read up on Zeronet and Tor. Neither are secure.\n;)",
				"added": 1621544352
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 40,
				"body": "Most on here are the Schizophrenic variety of Libertarian.\nThe type that believe freedom of information is \"under threat\", despite the only things not allowed on the basic internet are things associated with crime related to human rights violations.",
				"added": 1617299028
			}
		],
		"1616716381_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 41,
				"body": "Take your pills.",
				"added": 1617299070
			}
		],
		"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2": [
			{
				"comment_id": 42,
				"body": "People use it for access to ZeroNet Sites, not the default stuff that comes with the ZeroNet package.\nYou won't see much here because it's all publicly accessible, so people that are using this for anonymity aren't going to post directly to the most easily accessible parts.",
				"added": 1617394363
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 45,
				"body": "Why not just take the vaccine. Why lie about it.",
				"added": 1621222486
			},
			{
				"comment_id": 47,
				"body": "> [atheistamerican](#comment_15_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH): they're afraid it's going to kill them early based off lies told about the vaccine's safety.\n\nBut... if it was killing people then obviously we'd be seeing dead bodies everywhere and it would be all over the news.\nI mean, are they so far gone the believe the \"spooky mainstream media\" is part of a conspiracy to cover it up?\nBecause if that's the case, do they believe all the other people taking for the job or what every they're going to are also faking taking it too? Because otherwise they'd be dead?\nWhat kind of tomfuckery is going on here?",
				"added": 1621223717
			},
			{
				"comment_id": 48,
				"body": "> [znakesonaplane](#comment_2_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE): Here's what you and others like you should do with respect to vaccines - go and get them all. It shouldn't concern you that half of Fauci's team, and of the FDA and of the CDC, have not wanted to be vaccinated either, just go and get ALL the vaccines - pfizer, astra-zeneca, johnson & johnson, moderna - collect ALL the badges and then get your kids to do the same. [...]\n\nNone of this is true.\nYou just made all of that up in your head.\nOtherwise you'd be able to cite reputable sources for the information.\nSo that kind of makes you the idiot.",
				"added": 1621465443
			},
			{
				"comment_id": 56,
				"body": "> [materialdefender](#comment_4_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP): Where's your reputable sources to contradict?  none? just an ad hominem attack is all you got?\n\nThat's not how the Burden of Proof works you loser. You're the one making wild and fantastic claims, therefore you have to provide evidence for them.\nYou fucking moron.",
				"added": 1621542916
			}
		],
		"1620117334_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": [
			{
				"comment_id": 46,
				"body": "There's a difference between Civil Disobedience, and active disruption and spreading harmful misinformation.\nTake your meds.",
				"added": 1621222578
			},
			{
				"comment_id": 51,
				"body": "> [doomer](#comment_3_1NhSzUMdaQqZKaniiSxysB7EoNZsDUB1jX): Ha! Let's engage with this one, shall we? You got me with that \"misinformation\" codeword. [...]\n\n\"Codeword\"... Jesus Christ on a Gondola, you're a loon.\n\nCan you give an example where dissent was criminalized recently in the USA?\n\nSomething that wasn't about violating laws that were about Health, Safety or Misinformation?\n\nAnd by the way, objecticism and empiricism require epistemic differentials; that is the elimination of all premises that are based solely on logistical fallacies. Your word salad attempt to boldly claim there are no known-knowns (in regard to falsehoods) is absolute bullshit. Falsification is a thing.\n\nSo please, in all of your \"internet wisdom\", can you name at least one example, you lunatic?",
				"added": 1621513006
			},
			{
				"comment_id": 57,
				"body": "> [materialdefender](#comment_1_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP): CJ Hopkins\n\nNot only are you now using that correctly, but it shows how unhinged you are.\n\"You deny my wild accusation! Well then that just PROVES it! Whoop whoop whoop whoop!\"",
				"added": 1621543008
			}
		],
		"1620756113_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 49,
				"body": "Statistically more people are housed, educated and fed more than any other point in history.\nYes, there are some remnants of cultural hegemony, but you fight that with polls, petitions, pocketbooks and protesting, not bitching and moaning on the internet like some coward.",
				"added": 1621465676
			},
			{
				"comment_id": 50,
				"body": "> [anonymouslogin](#comment_297_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): First of all, Fuck you. Second, there is no reason anyone should be homeless in a first world country, much less the lower echelon of the working class. There has been a shift from substance abusing people, and people suffering untreated illness to families living in tents. You have some nerve calling me, a person simply sharing observations a coward. Polls, petitions, protesting...the same shit that brought us all to our knees, begging some rich fuck for a job that takes 80 hours a week and still doesn't pay the bills? Pocketbook? Sure, gold definitely changes policy, but the people in power keep all of it for themselves. Inflation at 12%? Here is a raise that doesn't even account for the stated inflation rate of 2%. I want people to get angry. They should be angry about this, and when it hits...we're coming for you oligarchs. I'm going to burn you alive in your fucking mansion.\n\n\"Fuck you\" - Great rational argument there.\n\n\"Second, there is no reason anyone should be homeless in a first world country\" - Except the people that are criminals, don't choose to care for themselves, don't choose to treat others humanely, and those and don't want housing.\n\n\"much less the lower echelon of the working class\" - I've read the book The Working Poor, and less than 1% of the homeless even attempt to work. 98% of are not only mentally ill, they're also complete psychopaths. Look it up, buttercup.\n\n\"There has been a shift from substance abusing people, and people suffering untreated illness to families living in tents.\" - Even if that were true (and it's not according to the World Health Organization statistics) you don't just get to demand free property and land when people working for it can't even obtain it. Why do the lazy, insane people get free everything and those that work don't?\n\n\"Polls, petitions, protesting...the same shit that brought us all to our knees, begging some rich fuck for a job that takes 80 hours a week and still doesn't pay the bills?\"  - Then start your own business, unless you're lazy, crazy, or stupid.\n\"Pocketbook? Sure, gold definitely changes policy, but the people in power keep all of it for themselves.\" - Prove it, lazy conspiracy nut.\n\n\"Inflation at 12%? Here is a raise that doesn't even account for the stated inflation rate of 2%. I want people to get angry.\" - Hey, idiot... no business can pay you more than they take in. They have to cover head, taxes and pay everyone and have savings for the business and improvements. At the very best all employees should be earning at least 25% of what they help bring into the company because the rest is to keep the business going. Guess what?  Even if you took 100% of all CEO/management income and distributed it across their workers, they wouldn't see much of a boost. Why? Because that's how percentages work with division.\n\n\"it's unpleasant but nothing a short shit on your gold toilet, and a good brushing won't fix, meanwhile the faceless corporate beast consumes your fellow man, and shits out soylent green money for all of your elite friends.\" - I don't have any elite friends, jackass, I just understand BASIC MATH.\n\nThis has been explained by economists time and time against, but most Americans have a 8th grade level of math comprehension.\n\nIf all of the Walmart Management divided all of their income across their employees, they'd all receive less than dollar. Because they employ millions of people. So, in example, a million divided by a million... is one. One dollar. But Walmart employs MILLIONS, not just one million.\n\nSame thing with homelessness. Even if all the billionaires in the USA, were taxed at 100%, their wouldn't be enough to feed, cloth, home and educate the homeless. The figures on people like Musk (who isn't American) and Bezos on YouTube videos are fake because they're only calculating for one month or one year. Then what?\n\nIf you want to cry about it, then talk about how housing prices should come down; that the housing market should be regulated like power and water. That Apartment Housing should never exceed Social Security Income. Something RATIONAL like that instead of your emotional crying and anger nonsense.",
				"added": 1621512629
			}
		],
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 52,
				"body": "> [haxorz](#comment_5_1N5YTyNeraRGksf76WNQiJ3ZB2ZMMa4pnf): :D You are totally blind man, I don't even know how u was able to come on ZeroNet.. Take the vaccine and be a slave then soon you will feel it soon what is all about.. ;)\n\nLet me guess... you're diagnosed as mentally ill, but deny it and believe it's part of some big conspiracy, right?",
				"added": 1621514766
			},
			{
				"comment_id": 58,
				"body": "> [fox20012](#comment_1_1CPMi1adhz1sh7dLTfbppPztkoH6wUUsS8): Karma is a bitch isn't it. Look at them twitch...  HAHAHA\n\nLook at who twitch?",
				"added": 1621543066
			},
			{
				"comment_id": 59,
				"body": "> [zeroplissken](#comment_2_1K1Y6kTYm7QXpmvbZiCAdzB5w7jCwBkird): I'm pretty pro vaccine but anytime anyone wants to say things like \"deny science\" or \"believe in science\" it makes me want to beat them over the head with a bat. That kind of terminology is half the problem surrounding the scientific and medical fields today and stems from a gross misunderstanding of both fields and the philosophy underlying them.\n\nYou're wrong. Dead wrong.\nPeople that deny science are people that refuse to accept demonstrated reality.\nWhen people say others \"deny science\" they're not using an appeal to authority or some \"conclusions are infallible\" argument.\nPeople that deny science are people that use known logical fallacies in order to avoid changing their unsound conclusions, and they specifically outright deny both the scientific research and make claims about conspiracies.\nIf someone says \"the scientific method is never adequate enough to make specific sound conclusions\", then they're science deniers.\nYou obvious don't have any understand of how serious and prevalent science-denialism is.\nEveryone from Feynman to Popper had pointed out that science-deniers are a real thing.\nThere's entire documentaries about people that have things demonstrated right in front of them, and they refuse to believe it because they're pathologically fixated on a belief they arrived at via unsound reasoning.",
				"added": 1621543396
			},
			{
				"comment_id": 63,
				"body": "> [ospeaking](#comment_1_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf): Fuck off kike.\n\nI'm not Jewish (not that it matters).\nWait, are you one of those wackjobs that believe in an evil Jewish conspiracy to take over the world? Bwa-hahahaha.\nWhat a loser.",
				"added": 1621559256
			},
			{
				"comment_id": 64,
				"body": "> [materialdefender](#comment_7_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP): And this just exemplifies how much of an idiot you are.  Nobody here is denying science.  Science is a method.  What is being refuted is your conclusions. [...]\n\nYou provide zero evidence for antivaxxer bullshit. You claim I use fallacies but you don't quote them or cite them.\nScience is a method, a method for reaching sound conclusions. To refute my conclusions requires an actual refutation, which doesn't exist. You keep shifting the burden of proof and act as if there is a superior method to the scientific method.\nYou're a wackjob without anything to back up your beliefs or assertions.\nAs far as me promoting science? I'm not going to take the time to post all of the mainstream accepted science or refutations of your crazy conspiracy theories.\nIt's already been done a million times.",
				"added": 1621559419
			},
			{
				"comment_id": 65,
				"body": "> [emuu](#comment_4_1L4u9yoxDkhRSqkQGddh73gRg9oFWWn9y3): vaccines is the word SERPENT in the bible. Specifically:: Revelation chapter 12\n\nYou're fucking retarded.",
				"added": 1621559451
			},
			{
				"comment_id": 69,
				"body": "> [materialdefender](#comment_7_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP): And this just exemplifies how much of an idiot you are.  Nobody here is denying science.  Science is a method.  What is being refuted is your conclusions. [...]\n\nThe conclusion that vaccines are good and developed through science?\nWow, you sure showed me.",
				"added": 1621696746
			},
			{
				"comment_id": 70,
				"body": "> [znakesonaplane](#comment_12_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE): nothing can reach people like this. nothing can shake their unwavering belief in the honesty and goodness of governments. so don't try, just let him and everyone he loves take all the vaccines and all the booster shots. he and others like him are the finest examples of trash taking itself out.\n\nI never once said I trusted Governments with everything, but to claim all Governments are secretly pure evil?\nThere's a term for that: Mental Illness.\nFor the record, there is evidence of people dying due to a lack of vaccines, but not because of taking vaccines.\nThe entire scientific establishment disagrees with your claims and assertions.\nBecause there is no evidence to back them up.",
				"added": 1621696842
			}
		],
		"1617430409_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX": [
			{
				"comment_id": 53,
				"body": "OP and the other Alt-Righters on here claim \"others are non-thinkers\" while they literally just use buzzwords to ignore points.\n\"Criticizing Trump is just orange man bad\"\n\"Pro-Palestinian Rights is anti-semitic\"\n\"Historical discussions that tackle riductio absurdem and misrepresentation are stupid\"",
				"added": 1621542017
			},
			{
				"comment_id": 54,
				"body": "> [reflektion](#comment_16_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8): read 1984, that's where the world is heading.\n\nPeople that say \"fiction is real! it always predicts the future\" just seem unforgivably childish and asinine to me; especially when it's something political and scifi. Some tropes and cliches have always been around, but to use any work of fiction as a religious textbook is just lazy and stupid.",
				"added": 1621542159
			},
			{
				"comment_id": 55,
				"body": "> [anonymouslogin](#comment_293_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Widespread eugenics haven't been tried. Castration of the insane was real eugenics for sure.\n\nI thought you were a rational and skeptical person until I read this. You might want to look into the criticisms of psychiatry by the psychiatric mainstream themselves. I'd start with the Rosenhan Experiment.",
				"added": 1621542218
			},
			{
				"comment_id": 60,
				"body": "> [materialdefender](#comment_2_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP): And yet you don't provide evidence to the contrary.\n\n Again, you're the one making claims. The burden of proof is the person claiming they have evidence for a specific set of claims.\nYou're clearly an idiot that doesn't understand that they're using the \"Argument From Ignorance\".\nJust look it up. You'll soon recognize your folly.",
				"added": 1621543627
			}
		],
		"1621542671_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 61,
				"body": "> [materialdefender](#comment_5_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP): Why does it bother you so much?  Do you NEED an enemy to fight?  Is this your great Crusade to make the world a better place?\n\nIt's not that I need an enemy to fight, it's that you morons spreading misinformation causes damage to the real world; it's also a great annoyance to see adults polluting society with bullshit.\n\nSome girl dies because she didn't get a vaccine. That's entirely your fault. You fought a war to lie to people to try to coerce then into believing lies.\n\nYou morons keep falsely claiming it's an argument about freedom of speech and autonomy and personal decisions, whole billions of dollars are having to be spent to correct your pathological lying. Billions. That could fix society in the snap of a finger if the loon patrol wasn't forcing the Government, Medical Community and Academic Community to waste most of the tax payer money on correcting you idiots and managing your mental illnesses.\n\nFood, water, shelter, education. All possible if all the money wasn't wasted on combating your dishonest pleas for people to hurt themselves and each other.\n\nIf all the conspiracy nuts died tonight, we'd have enough money to fix every problem within a 72 hour period.\n\nBut nooo.... you all incorrectly believe it's your \"right\" to lie to people.\n\nPlease die in your sleep, all of you. So that the decent people (ie; non-liars) can live on with healthy-happy lives unimpeded by your destructive bullshit.",
				"added": 1621544191
			},
			{
				"comment_id": 66,
				"body": "> [styromaniac](#comment_3096_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Hypocrite detected.\n\nHow so? sycophant is an academic term, not a buzzword. That is the difference between rational people and those like you; you don't understand the difference.",
				"added": 1621559526
			},
			{
				"comment_id": 67,
				"body": "> [sabretooth](#comment_15_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU): All I have to say is, shut up and watch.\n\nAgain... Every year you losers make claims.",
				"added": 1621559547
			}
		],
		"1621555984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 68,
				"body": "There is no hypocrisy there.\n\"Libtards\" is a made word used for propaganda.\nNone of the words I used are made up and used for propaganda.\nPointing that out while also insulting you isn't an ad hominem because I offered an argument/assertion.\nYou don't seen to understand how logical fallacies work.\nTake you meds, loser. And take the vaccine.",
				"added": 1621559668
			},
			{
				"comment_id": 76,
				"body": "> [anonysan](#comment_49_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): \"NOOOOOOOOOOOOOOO BUT THIS IS PSEUDOSCIENCE SNOPES SAID SO!!!!!!!!!!!\"\n\nIt's obvious that you are so uneducated that you don't know what the \"Reductio ad absurdum\" and \"straw man\" fallacy are.\nYou and your use of capitals and exclamations to mock calm discussion actually proves without a doubt that psychologically you believe anyone that disagrees with you calmly and rationally must be attacked and mocked.\nYou're unhinged.",
				"added": 1622523077
			},
			{
				"comment_id": 77,
				"body": "> [jeff](#comment_117_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): I have to agree, Styro. I've hesitated a few times previously, but I think it's time, now, to block Holden.\n\nBlock the person stating vaccines are ok. You are all insane.",
				"added": 1622523123
			}
		],
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": [
			{
				"comment_id": 71,
				"body": "Sounds like a hack trap.",
				"added": 1621828526
			}
		],
		"1621828480_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 72,
				"body": "> [scotcyguy2](#comment_92_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): Ad hominem attacks, appeals to authority and claims of legitimacy because of consensus have nothing to do with the scientific method. [...]\n\nThe mentioned of resources and personal attacks would only be fallacious if they were the center of the argument, which they're not.\nYou have no idea how logical fallacies work.\n\nThe current consensus is based on peer-reviewed, double-blind independently replicated test data.\nThat's the appeal. The appeal to the scientific method.\nNot authority. Not people. Not shooting the alternative messenger.\nYou're a sophist.",
				"added": 1622522641
			},
			{
				"comment_id": 73,
				"body": "> [anonysan](#comment_41_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): yep, people say \"trust the science\" as if science isn't an open ended process that is ever changing and requires constant debate and disagreement to advance. If we just \"trusted the science\", never questioned it, and always assumed it was correct we would still believe in things like alchemy and turning silver into gold rather than building particle accelerators or exploring space. [...]\n\n\nThe mentioned of resources and personal attacks would only be fallacious if they were the center of the argument, which they're not.\nYou have no idea how logical fallacies work.\n\nThe current consensus is based on peer-reviewed, double-blind independently replicated test data.\nThat's the appeal. The appeal to the scientific method.\nNot authority. Not people. Not shooting the alternative messenger.\nYou're a sophist.",
				"added": 1622522656
			},
			{
				"comment_id": 75,
				"body": "> [scotcyguy2](#comment_92_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): but it's also not impartial they are corporations with financial interests\n\n> but it's also not impartial they are corporations with financial interests\n\nNo one said \"trust the authorities\". It's only science if there is double-blind independent replication.\nJust because YOU aren't smart enough to understand that benefit of that doesn't mean you should roll on the floor screaming that all the conspiracies you've read on the internet are true \"just because\".\n\nSo odd you obsess over hating the scientific method whole also engaging in some false dilemma view of \"either science is perfect or all conspiracies are true!\".",
				"added": 1622522907
			}
		],
		"1622433900_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": [
			{
				"comment_id": 74,
				"body": "No one is saying \"trust the authorities\", they're saying \"trust the process\".\n\nThe current consensus is based on peer-reviewed, double-blind independently replicated test data.\nThat's the appeal. The appeal to the scientific method.\nNot authority. Not people. Not shooting the alternative messenger.\nYou're a sophist.",
				"added": 1622522723
			}
		]
	},
	"comment_vote": {
		"6_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH": 1
	}
}