{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Modelo matemático aponta colapso do sistema de saúde a partir de 21 de abril",
			"body": "#No ritmo atual de evolução da pandemia de covid-19 no Brasil, o volume de unidades de terapia intensiva (UTIs) disponíveis no país não seria suficiente para atender a demanda a partir da semana do dia 21 de abril. \n\nEssa é a projeção de um modelo matemático criado por um grupo de seis pesquisadores das áreas de Física e Medicina ligados às universidades federais de Alagoas e do Rio Grande do Norte, à Santa Casa de Maceió, ao Centro de Testagem e Acolhimento de HIV/AIDS de Itaberaba (BA) e à Escola Superior de Ciências da Saúde, em Brasília.\n\nO [estudo](https://swarm-gateways.net/bzz:/f3cce122ffa042fd54b99f3367fc9cdfed9c2aa5f93a1fafb16b390bca9345c8/2020.04.03.20052498v2.full.pdf), publicado no dia 3 de abril, foi submetido a publicação internacional e é preliminar, ou seja, ainda não foi avaliado por pares — mas mostrou aderência aos dados reais pelo menos até o último dia 15 de abril: a evolução do números de mortos divulgados pelo Ministério da Saúde (um indicador com menor subnotificação do que o volume total de casos e, por isso, mais confiável) tem sido consistente com as previsões apontadas pela equipe e usadas como base para o cálculo da utilização dos leitos de UTI nos hospitais.\n\nO trabalho leva em consideração ainda as medidas de distanciamento social atualmente vigentes — a chamada \"quarentena voluntária\" —, seu impacto na redução da transmissão da doença e o percentual médio de infectados que precisam ser internados nas unidades de terapia intensiva por apresentarem quadros mais graves de infecção nos pulmões. \n\n#País ainda não tem dados nacionais sobre ocupação de UTIs\n\nNa última terça-feira (14/04), o Ministério da Saúde informou que estabelecimentos de saúde públicos e privados nos 26 Estados e Distrito Federal passariam a ter de registrar em um sistema unificado as internações hospitalares dos casos suspeitos e confirmados de coronavírus.\n\nO \"censo hospitalar\", segundo a pasta, servirá para avaliar o consumo dos leitos da rede assistencial e a média de permanência dos usuários. O primeiro balanço deve sair na próxima semana.\n\nAté então, o país não tem um dado nacional consolidado sobre a utilização dos leitos de UTI. Os números têm sido divulgados de forma desordenada pelos Estados — alguns com atualizações diárias e outros com notificações esporádicas e incompletas sobre as taxas de ocupação.\n\nEm São Paulo, que concentra o maior número de mortos e infectados, o primeiro hospital atingiu nesta quarta (15/04) 100% de ocupação de leitos de UTI, o Instituto de Infectologia Emilio Ribas, como informou o secretário estadual da Saúde, José Henrique Germann, em coletiva de imprensa.\n\nOs dados da plataforma da secretaria abastecidos pelos hospitais no Estado não estão disponíveis para consulta. No último dia 14, contudo, a pasta informou que quatro hospitais tinham mais de 70% da capacidade utilizada: Hospital das Clínicas da Faculdade de Medicina da USP (77%), Hospital Municipal do Tatuapé (77%), Conjunto Hospitalar do Mandaqui (76%) e Santa Casa de São Paulo (71%). \n\nComo os dados nacionais sobre o uso de leitos de UTI ainda não estão disponíveis, o grupo de pesquisadores utilizou como parâmetro inicial uma [pesquisa](https://swarm-gateways.net/bzz:/eaa6ef85441e9850f0da821ef0a50b6ac14da63b9652a42352821507b195fa58/E-EFI-03.pdf) da Agência Nacional de Saúde Suplementar de 2013 com o grau de utilização médio desses leitos no país e, em paralelo, [os dados disponíveis no Datasus](http://tabnet.datasus.gov.br/cgi/tabcgi.exe?cnes/cnv/leiutibr.def) com a capacidade instalada na rede pública e privada no país. \n\nSão cerca de 60 mil leitos — esse total contabiliza, entretanto, unidades que não estão disponíveis para tratamento de covid-19, como UTIs neonatal, o que foi levado em conta pelos pesquisadores.\n\nA partir das premissas, o modelo aponta uma saturação do sistema por volta do dia 21 de abril. O físico Askery Canabarro, um dos autores do estudo, ressalta que o resultado reflete um dado consolidado para o país e não quer dizer, por isso, que todas as UTIs estarão ocupadas necessariamente nesta data.\n\nDe um lado, a distribuição dos leitos pelo território nacional é desigual — 26% do total, ou 15,7 mil, estão em São Paulo. De outro, a evolução da doença tem afetado algumas áreas mais do que outras.\n\n\"Há Estados mais ou menos vulneráveis\", ele destaca.\n\nA intenção dos pesquisadores era avaliar se as medidas tomadas até o momento para tentar evitar o colapso do sistema de saúde eram suficientes, à semelhança do que fizeram pesquisadores do Imperial College London, que apresentaram em meados de março um [modelo matemático que levou o Reino Unido a mudar sua estratégia contra a pandemia](https://web.archive.org/web/20200320192059/https://www.bbc.com/portuguese/internacional-51944800).\n\n\"A gente já fez muito, mas infelizmente precisamos fazer mais\", avalia Canabarro, que acaba de concluir o pós-doutorado em Física.\n\nO Amazonas, que assistiu a um aumento vertiginoso no número de mortes pela doença na última semana, é hoje o ente da federação em que o sistema de saúde está mais próximo da falência. O prefeito de Manaus, Arthur Virgílio Neto (PSDB), chegou a afirmar na semana passada que a capital não tinha mais como atender a demanda.\n\nO Estado registra o maior coeficiente de incidência de covid-19 por habitante, seguido por Amapá, Distrito Federal, São Paulo, Ceará e Rio de Janeiro. Nos seis, o indicador está pelo menos 50% acima da média nacional — parâmetro utilizado pelo Ministério da Saúde para classificar a situação como estado de emergência. \n\n#Mais de 3 milhões de infectados\n\nAs projeções do modelo desenvolvido pelo grupo de pesquisadores apontam para um número total de infectados de 3,15 milhões, com 393 mil mortos em um período que não está predeterminado, mas que, segundo o pesquisador, se concentraria em alguns meses.\n\nEle ressalta, entretanto, que esse é o cenário de \"inércia\", caso as medidas atuais não sejam endurecidas — e que leva em conta [dados compilados pelo Google](https://www.google.com/covid19/mobility/) sobre o deslocamento das pessoas em diferentes cidades, apontando uma taxa de isolamento média de 50%.\n\nCanabarro acredita, entretanto, que o Brasil pode repetir a trajetória de outros países: à medida que o volume de mortos crescer, as regiões mais afetadas farão quarentenas mais restritivas, que diminuirão a incidência da doença e, por consequência, o número de mortos.\n\nOs pesquisadores também fizeram projeções para cenários alternativos para avaliar a efetividade das medidas tomadas até agora. Caso não houvesse qualquer tipo de restrição de deslocamento, por exemplo, o número total de infectados seria de 30,47 milhões, com 1,45 milhão de mortos.\n\nEm um cenário de [isolamento vertical como aquele defendido pelo presidente Jair Bolsonaro](https://web.archive.org/web/20200407185303/https://www.bbc.com/portuguese/internacional-52043112), com distanciamento social apenas daqueles com mais de 60 anos, seriam cerca de 26 milhões de infectados e 723 mil mortos. \n\n- Fonte: https://www.bbc.com/portuguese/brasil-52300278",
			"added": 1587054804
		},
		{
			"topic_id": 2,
			"title": "Como criar um proxy público ZeroNet para que todos possam usar",
			"body": "- https://invidio.us/9wnPv7Q5UA0\n- https://swarm-gateways.net/bzz:/a6b7d07c5069ea4d4289362010c61e1bb904725822a38b5af0f5d1fd59953c2f/How+to+Create+a+ZeroNet+Public+Proxy+for+Everyone+to+Use-9wnPv7Q5UA0.mp4",
			"added": 1587055762
		}
	],
	"topic_vote": {
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": 1
	},
	"next_comment_id": 9,
	"comment": {
		"2_12bpcgBZapJxQQvk6USaEhVLFaTmqK2tvQ": [
			{
				"comment_id": 1,
				"body": "#AceZeroProxy - Meta Proxy da ZeroNet\n- https://github.com/AceLewis/AceZeroProxy.git",
				"added": 1587055965
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 2,
				"body": "#Noam Chomsky destroi a farsa dos 2 milhões de mortos pelo Khmer Vermelho\n- https://swarm-gateways.net/bzz:/c20aacee9bce027e66e4f41b0fb3acc4a2f5ba3fb588bfb345f02de18d7643eb/Noam+Chomsky+destroi+a+farsa+dos+2+milhões+de+mortos+pelo+Khmer+Vermelho-DTOOaiqhQR4.mp4",
				"added": 1587085374
			},
			{
				"comment_id": 3,
				"body": "#Noam Chomsky Socialismo, Lenin e Bakunin\n- https://swarm-gateways.net/bzz:/1755744c75bc0f988364a5064de16980ea1a3ee62a0e84bb1183c39d1e3e521f/Noam+Chomsky+++Socialismo,+Lenin+e+Bakunin+Legendado-1-WW-_GP6XU.mp4\n\n#Noam Chomsky - União Soviética vs Socialismo\n- https://swarm-gateways.net/bzz:/897583fa0375ebe052cde013ae992e3dcb1dbfc959e84d695827b01df1b05098/Noam+Chomsky+-+União+Soviética+vs+Socialismo-xJABuO6gjvc.mp4\n\n#Noam Chomsky - Marxismo vs Leninismo\n- https://swarm-gateways.net/bzz:/eb688f67c1592c895978f1593f1249c83d110a296d2e4f4f4fa55117b8cef470/Noam+Chomsky+-+Marxismo+vs+Leninismo-nGBSl3lIuZ8.mp4\n\n#Noam Chomsky - Porque não sou um liberal\n- https://swarm-gateways.net/bzz:/dbdc92e291a2a2ba282883e31a0b1107a091ab7b86bbed513faee2c31135a422/Noam+Chomsky+-+Porque+não+sou+um+liberal-WtbJvA5gfEQ.mp4\n\n#Noam Chomsky - A visão das elites a respeito dos pobres\n- https://swarm-gateways.net/bzz:/284d81b9c8e3753c5055a6fd1f1120aa3ff04b2b780d68ce0dbef7b3772da546/Noam+Chomsky+-+A+visão+das+elites+a+respeito+dos+pobres+(+legendas+em+português+)-Gkke6l6HMJY.mp4",
				"added": 1587086645
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 4,
				"body": "#Breve história da REVOLUÇÃO RUSSA\n- https://invidio.us/watch?v=nxzpjGW32tw\n- https://swarm-gateways.net/bzz:/c48d178a8574a0ae4e83fc3b7ae5ace4a27c701f0dd616d7c9069c4f8a2b7f71/Breve+história+da+REVOLUÇÃO+RUSSA-nxzpjGW32tw.mp4\n\n#BIBLIOGRAFIA\n- Sheila Fritzpatrick - A Revolução Russa\n- China Miéville - História da Revolução Russa\n- Daniel Aarão Reis - As revoluções russas e o socialismo soviético\n- Daniel Aarão Reis - A revolução que mudou o mundo\n- Daniel Aarão Reis (org) - Manifestos vermelhos\n- Richard Pipes - História concisa da Revolução Russa\n- Marc Ferro - A Revolução Russa de 1917\n- Jean-Jacques Marie - História da Guerra Civil Russa\n- John Reed - Dez dias que abalaram o mundo\n- Leon Trotski - A história da Revolução Russa\n- Dmitri Volkogonov - Os sete chefes do Império Soviético\n- S.A.Smith - The Russian Revolution\n- Michael C. Hickey - Competing voices from the Russian Revolution\n- Rex A. Wade - Revolutionary Russia: new approaches",
				"added": 1587088054
			},
			{
				"comment_id": 5,
				"body": "> [hardyy](#comment_4_12bpcgBZapJxQQvk6USaEhVLFaTmqK2tvQ): Breve história da REVOLUÇÃO RUSSA\n> \n> https://invidio.us/watch?v=nxzpjGW32tw\n> https://swarm-gateways.net/bzz:/c48d178a8574a0ae4e83fc3b7ae5ace4a27c701f0dd616d7c9069c4f8a2b7f71/Breve+história+da+REVOLUÇÃO+RUSSA-nxzpjGW32tw.mp4\n> \n> BIBLIOGRAFIA\n> \n> Sheila Fritzpatrick - A Revolução Russa\n> China Miéville - História da Revolução Russa\n> Daniel Aarão Reis - As revoluções russas e o socialismo soviético\n> Daniel Aarão Reis - A revolução que mudou o mundo\n> Daniel Aarão Reis (org) - Manifestos vermelhos\n> Richard Pipes - História concisa da Revolução Russa\n> Marc Ferro - A Revolução Russa de 1917\n> Jean-Jacques Marie - História da Guerra Civil Russa\n> John Reed - Dez dias que abalaram o mundo\n> Leon Trotski - A história da Revolução Russa\n> Dmitri Volkogonov - Os sete chefes do Império Soviético\n> S.A.Smith - The Russian Revolution\n> Michael C. Hickey - Competing voices from the Russian Revolution\n> Rex A. Wade - Revolutionary Russia: new approaches\n\n#Angelo SegrilLo - Historiografia da Revolução Russa\n- https://swarm-gateways.net/bzz:/ab53ee54b960973a1ebe12bc1f962cf9d3eae2a457325d6b55f36e2517da9627/6535-15915-1-SM.pdf\n\nO presente artigo visa apresentar um panorama e um balanço historiográfico da literatura sobre a Revolução Russa. Revisitando os autores clássicos, prosseguimos até as principais obras mais recentes, incluindo as que tentativamente parecem marcar novos paradigmas de investigação no período pós-soviético.",
				"added": 1587088162
			},
			{
				"comment_id": 6,
				"body": "#ALEMANHA ORIENTAL: História política e econômica\n- https://invidio.us/watch?v=PoWPGZ5nBIQ\n- https://swarm-gateways.net/bzz:/168139874e8920efad85a1e06099fbd518ceb026d17701e143758d2cf03d7a17/ALEMANHA+ORIENTAL_+História+política+e+econômica-PoWPGZ5nBIQ.mp4",
				"added": 1587089637
			},
			{
				"comment_id": 7,
				"body": "#Mussolini e a ascensão do FASCISMO\n- https://invidio.us/watch?v=z2_h7o9y0w0\n- https://swarm-gateways.net/bzz:/0051d754746d55968e165f086cb3054448aff5f2905fcf9ef8061f9c77feceb2/Mussolini+e+a+ascensão+do+FASCISMO-z2_h7o9y0w0.mp4\n\nVÍDEO BASEADO NO LIVRO: [Donald Sassoon: Mussolini e a ascensão do Fascismo](https://swarm-gateways.net/bzz:/a27847a305a59b5d6ae2c719b878489b0ec287a28261390447008fe05df42322/Mussolini_Fascismo.pdf)\n\n#LINKS CITADOS NO VÍDEO:\nOpera Omnia Vol. XIV\nDalla Marcia di Ronchi al secondo Congresso dei Fasci (14 settembre 1919 – 25 maggio 1920)\n- Download: https://swarm-gateways.net/bzz:/70ea733c3ff8d4b2ae4629cf6a005aeb2ad5989aa959a18725ccfb6f935b30a1/vol_14-Opera-omnia-Dalla-marcia-di-Ronchi-al-secondo-congresso-dei-fasci-14-settembre-1919-25-maggio-1920-.pdf\n\nOpera Omnia Vol. XVIII\nDalla Conferenza di Cannes alla Marcia su Roma (14 gennaio 1922 – 30 ottobre 1922)\n(o nome do arquivo diz que é o vol. XIX, mas é o XVIII)\n- Download: https://swarm-gateways.net/bzz:/b10129c37716680a5b258425fa87401cfa0d360b81759ac51a10308dbbacc7c3/vol_19-Opera-omnia-Dalla-conferenza-di-Cannes-alla-marcia-su-Roma-14-gennaio-1922-30-ottobre-1922-.pdf",
				"added": 1587090280
			},
			{
				"comment_id": 8,
				"body": "#O que é Fascismo? - Conceitos Históricos\n- https://invidio.us/watch?v=I4wJ8iTqgVY\n- https://swarm-gateways.net/bzz:/e1e2e3db6a0dcc39eb4680f1fc46db758074df7711326591f774645b90a42446/O+que+é+Fascismo_+-+Conceitos+Históricos-I4wJ8iTqgVY.mp4\n\n#LIVROS\n- Donald Sassoon – Mussolini e a ascensão do Fascismo\n- Adam Tooze – O preço da destruição\n- Eric J. Hobsbawm – A era dos extremos\n- Norberto Bobbio – Dicionário de Política\n- Kalina V. Silva e Maciel H. Silva – Dicionário de conceitos históricos\n- René Rémond – O século XX\n- Robert O. Paxton – A anatomia do Fascismo\n\n#ARTIGOS\n- Umberto Eco. \"Ur-Fascism\" - https://web.archive.org/web/20200414145011/http://www.pegc.us/archive/Articles/eco_ur-fascism.pdf\n- Robert Griffin. \"What fascism is not and is\" - https://swarm-gateways.net/bzz:/7b9deceea260d73311712c9f43df7baab058ad440ac2bafc1b5848c667366610/Robert_Griffin.pdf\n- Chip Berlet. \"Populism as core element of fascism\" - https://web.archive.org/web/20200117022258/https://www.politicalresearch.org/2016/12/21/populism-as-core-element-of-fascism\n\nO termo \"fascismo\" NÃO É SINÔNIMO de \"autoritarismo\". Fascismo é um tipo específico de regime autoritário de extrema-direita, e usar esse conceito pra se referir a qualquer indivíduo ou grupo que demonstre traços de autoritarismo ou violência é conceitualmente errado.\n\nE pra turma do Fascismo de esquerda, alimentado pelo livro de J. Goldberg e seus seguidores, segue texto do Robert Paxton, autor citado no vídeo e um dos maiores especialistas do mundo no assunto: https://web.archive.org/web/20200417024750/https://leituraobrigahistoria.com/2018/11/09/as-falhas-academicas-do-fascismo-de-esquerda/",
				"added": 1587091714
			}
		]
	},
	"comment_vote": {}
}