{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1602091740,
			"title": "Truecaller database leak",
			"body": "Anyone know where I can find the truecaller database leaks or maybe those of other caller id apps?\nIt says here it was sold on the dark web. Even if its not from truecaller, its a huge list of names, addresses and phone numbers. \nhttps://www.bankinfosecurity.asia/researcher-data-leaked-for-300-million-truecaller-users-a-12519",
			"added": 1602091739
		},
		{
			"topic_id": 1603385950,
			"title": "What's interesting in here?",
			"body": "Other than the underage porn which is a pest on most of the darknet, where's all the good stuff? Drugs, Assassinations, Weapon sales, Homemade weapons tutorials just to name a few...",
			"added": 1603385948
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1602091740_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 1,
				"body": "Y u no gives truecaller db? \n(╯°□°)╯︵ ┻━┻",
				"added": 1602217680
			},
			{
				"comment_id": 2,
				"body": "> [zeronetuser101](#comment_16_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD): You can exploit instagram\n\nexploit how exactly?\nI did manage to decompile the truecaller apk to work with APIs inside, but they're rate limited per user. How would instagram help here?",
				"added": 1602430567
			},
			{
				"comment_id": 3,
				"body": "Still nothing? Thought zeronet would be more valuable than this.",
				"added": 1602698369
			},
			{
				"comment_id": 7,
				"body": "> [zeronetuser101](#comment_17_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD): Exploit to not be limited by instagram APIs and simply export the db like how someone did in the past.\n\nIt's far more secure than in 2014",
				"added": 1603384451
			}
		],
		"1602791912_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 4,
				"body": "Can we not turn this country into another Syria? I get that they want to do away with one monarch/dictator, but a civil war will ensue, people will starve and NATO, Russia, China will break the country apart. Get this done peacefully or don't get it done at all.",
				"added": 1602880869
			},
			{
				"comment_id": 5,
				"body": "> [mentos](#comment_7_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK): It wouldn't go on that way, as my experience would tell. Maybe, nothing will happened from these petitions/protests. But it will be a great example of such a weird monarch + Communism in this country, and Thais are trying to fix it.\n\nYeah, that's what they said about Egypt, Libya, Syria, the Soviet Union just to name a few",
				"added": 1603053043
			}
		],
		"1603368158_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 6,
				"body": "you don't need anyone's help. bait the guy, get more information and files and post them on a site like malwaretips. they'll take care of it. otherwise, just pay someone to destroy his life either virtually or physically.",
				"added": 1603384371
			}
		],
		"1603284377_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 8,
				"body": "Cuba discovers it, they'll arrest people and shut down the entire internet and ask China for help with a new firewall. Good luck.",
				"added": 1603386113
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 9,
				"body": "> [bigbadbob](#comment_1167_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I personally would not consider \"Drugs, Assassinations, Weapon sales, Etc\" to be \"good stuff\", but I am neither a cop or criminal.  There are plenty of cops and criminals who live to dwell in the abyss.  Each to their own.\n\nThe US is probably planning assassinations and coups in the middle east and south america, the Russians are offering bounties on american troops. If you speak against the government in most other countries, consider yourself a dead person. In fact, most of the world's economy is propped up by the good stuff including drugs, weapons, alcohol, contracts and crude oil. So let's stop acting all innocent and pretending to be good little angels.",
				"added": 1603808504
			}
		],
		"1603695205_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 10,
				"body": "Parrot OS, Lineage OS, Brave browser, Double VPN",
				"added": 1603808654
			}
		],
		"1603637541_1Dr4Ji2TmsvhJW383ukksrobMvEwJnNrxQ": [
			{
				"comment_id": 11,
				"body": "Sell it to the CIA, you'll make tons off it lol.",
				"added": 1603808736
			}
		]
	},
	"comment_vote": {}
}