{
	"next_comment_id": 50,
	"user_name": "Binchan",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1495216291": 1495367738,
		"1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1496083557": 1496119777,
		"1AABRF6MEZpwihXdJSPNdygREjis6LzD2w_1498131278": 1498148170,
		"1AABRF6MEZpwihXdJSPNdygREjis6LzD2w_1498481353": 1498483414,
		"15RjhDcq8atUmPHEH9w6nUmWeHDYniyzpT_1498646420": 1498684848,
		"1PUwRK6yhb3KGGYCwpZzGBSMaZ4Ap54DJP_1500818794": 1500884576,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1501608870": 1501630712,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1501969900": 1502038726,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1502618087": 1502850226,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1507741525": 1507752849,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1507929418": 1507947465,
		"1GxP4BKwry1BPiWBGNpWz7G5yucEKPavVJ_1507936156": 1507959689,
		"1GxP4BKwry1BPiWBGNpWz7G5yucEKPavVJ_1511871712": 1511920850,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1512223859": 1512276709,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1515439223": 1515464262,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1532535662": 1533053370,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1533429553": 1533454484
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "One of my best game memory in childhood :D",
			"post_uri": "1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu_1492945793",
			"date_added": 1493097476
		},
		{
			"comment_id": 2,
			"body": "Welcome to ZeroNet! The rhythm is a bit slow here, but still you can find many interesting things. Besides the default sites you are visiting, you can discover some interesting stuff on [ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/) and from search engine [Kaffiene](/kaffiene.bit/). Also check the official [Help & FAQ thread](/Talk.ZeroNetwork.bit/?Topic:8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj) if you have any question. Hope you have a good time here :)",
			"post_uri": "14J1BJYEpzk48EE1zXX7MzUiZwYsqbGwBQ_1496488984",
			"date_added": 1496576932
		},
		{
			"comment_id": 3,
			"body": "My pleasure :D Also the theme on userstyles.org has been unmaintained for some time, check [this post on ZeroTalk](/Talk.ZeroNetwork.bit/?Topic:1_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h/A+ZeroNet+Dark+Theme) for the sources of new version. `ZeroSites` is included ;)",
			"post_uri": "1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1497042260",
			"date_added": 1497060978
		},
		{
			"comment_id": 4,
			"body": "@Grimsdottir: The link for git.gnu.io doesn't link to the updated version, try [this one](https://git.gnu.io/chbinnc/Userscripts/raw/master/Userstyles/zeronet-dark-theme.userstyle.css). Thx :)",
			"post_uri": "1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1497042260",
			"date_added": 1497082671
		},
		{
			"comment_id": 5,
			"body": "@Grimsdottir: It sounds like you are using ZeroNet on a different server instead of 127.0.0.1. In the bottom of the css there are quite some addresses for special sites, so you need to replace all of them.",
			"post_uri": "1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1497042260",
			"date_added": 1497083904
		},
		{
			"comment_id": 6,
			"body": "@Grimsdottir: Hey, I replace those domains in the bottom with regular expression. Could you just try again and tell me if it works? :)",
			"post_uri": "1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1497042260",
			"date_added": 1497086952
		},
		{
			"comment_id": 7,
			"body": "@Grimsdottir: That is weird. There isn't any fundamental difference (if I didn't make some mistakes...) between the version on userstyles.org and the newest one. I'm quite sure it's because of the code in the bottom for specific sites.\nLike for latest comments on ZeroBlog\n```\n/* ZeroTalk */\n@-moz-document regexp(\"^https?://.*/Talk.ZeroNetwork.bit/.*\"),\nregexp(\"^https?://.*/0list.bit/.*\")\n{\n.comment {\nbackground-color: #242424 !important;\n}\n}\n```\nSorry I can't think of any possible cause. If you have time and interest, you can experiment it and find out the culprit by yourself :3",
			"post_uri": "1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1497042260",
			"date_added": 1497200969
		},
		{
			"comment_id": 8,
			"body": "Here is a ZeroWiki of [un index pour répertorier les torrents français](/122nvvhftBeZq9a47WAdg9RpkzLeWTJuw5/)",
			"post_uri": "1Q3DcejYbdNFDSDdjpznMmgg1ZCzn1SUsn_1498589986",
			"date_added": 1498606233
		},
		{
			"comment_id": 9,
			"body": "There is no diff and file change log, only the newest files signed by owner are served and updated. But you can git one by yourself.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1501637894",
			"date_added": 1501638394
		},
		{
			"comment_id": 10,
			"body": "@Martinv: Yes. Except in some cases like asking your friend whose zeronet is still offline for it. From my experience the new file can spread very fast.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1501637894",
			"date_added": 1501639934
		},
		{
			"comment_id": 11,
			"body": "@Martinv: As there is no git log, they can't get the old versions of their files. I don't know what non-official way will be.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1501637894",
			"date_added": 1501741404
		},
		{
			"comment_id": 12,
			"body": "What about [multiple citizenship](https://en.wikipedia.org/wiki/Multiple_citizenship)? ;)",
			"post_uri": "1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1510356938",
			"date_added": 1510360219
		},
		{
			"comment_id": 13,
			"body": "I have this in the console: `GET \nhttp://192.168.1.110:43110/images/logo0.jpg     [HTTP/1.1 404 Not Found 21ms]` Do you have the file in the folder? Also svg files are not allowed to display to avoid wrapper escape [[ref]](https://github.com/HelloZeroNet/ZeroNet/search?utf8=%E2%9C%93&q=svg&type=)\n> Download directly accessed Pdf/Svg/Swf files instead of displaying them to avoid wrapper escape using in JS in SVG file. [Reported by Beardog108]",
			"post_uri": "1GxP4BKwry1BPiWBGNpWz7G5yucEKPavVJ_1511871712",
			"date_added": 1511921311
		},
		{
			"comment_id": 14,
			"body": "@Tdd: \n>I can click links and image shows up. \n\nMe too. If that is the problem, change \n`<img src=\"/images/logo0.jpg\" alt=\"sculpture\" data-action=\"zoom\" width=\"100%\">` to `<img src=\"../../images/logo0.jpg\" alt=\"sculpture\" data-action=\"zoom\" width=\"100%\">` works for me.",
			"post_uri": "1GxP4BKwry1BPiWBGNpWz7G5yucEKPavVJ_1511871712",
			"date_added": 1511973757
		},
		{
			"comment_id": 15,
			"body": "@Tdd: Also here is the reason I found from [imachug (GitCenter)'s tutorial](https://github.com/krixano/ZeroNet-Dev-Center/issues/28)\n> Because of zite address: `http://127.0.0.1:43110/1CyNApZ4zp7k3SSXsrW54vEFMHHBpDy3nm/`. So `/css/index.css` gets calculated as `http://127.0.0.1:43110/css/index.css`. So, using absolute paths is not allowed in ZeroNet.",
			"post_uri": "1GxP4BKwry1BPiWBGNpWz7G5yucEKPavVJ_1511871712",
			"date_added": 1512040444
		},
		{
			"comment_id": 16,
			"body": "Cool project!",
			"post_uri": "1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1512110231",
			"date_added": 1512120740
		},
		{
			"comment_id": 17,
			"body": "Nice post! Btw, you need to add `\\` before your link or it becomes a sub-link of ZeroMe [@TomasCW](?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1A6rok3j9w6paahtGoxrePy7SSkMz5A48s/zc456@zeroid.bit \"mention:1A6rok3j9w6paahtGoxrePy7SSkMz5A48s\") ",
			"date_added": 1513469318,
			"post_uri": "1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1513396992"
		},
		{
			"comment_id": 18,
			"body": "That's awesome! :D",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1515439223",
			"date_added": 1515464257
		},
		{
			"comment_id": 19,
			"body": "> is there at least example of comment integration into static sites?\n\nThere is ;D [[ZeroMessage: ZeroChat as a Widget for Any Zite!]](/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/?Post:35), if you need markdown support for the widget, check the small code changes in [ZeroMail Bot](/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/?Post:67).\nFor the first question, it's possible, e.g. [Git Center](/gitcenter.bit) can show Markdown from git repo. But it's only for site owner, visitors can just post comments by creating and sharing their data.json.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1516735983",
			"date_added": 1516757384
		},
		{
			"comment_id": 20,
			"body": "@caryoscelus: You don't need to check the src of git center actually, basically any website project implementing that feature without backend should work on ZeroNet.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1516735983",
			"date_added": 1516760985
		},
		{
			"comment_id": 21,
			"body": "@caryoscelus: Then static site (no js) with comment integration (some js) will be ideal. Have you checked [my Jekyll zite](/1ADGCZCvC6wCf5GwCY23H9uwKyRiixoLt6/)? Hugo is also recommended! Others I know on ZeroNet is [Hexo](/eddyle.bit/test/), Just check my seeding list and I find [this!](/bluishcoder.bit/) Probably by Hugo or Jekyll, lots of new content but I never pay attention to it, because of lack of newsfeed support.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1516735983",
			"date_added": 1516770002
		},
		{
			"comment_id": 22,
			"body": "@caryoscelus: one idea is by pushing rss/new article to ZeroMessage widget (a bit weird, so need some tweak), don't know how to implement it with Jekyll, a simple python script can help.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1516735983",
			"date_added": 1516771735
		},
		{
			"comment_id": 23,
			"body": "@caryoscelus: have fun! You may like to check [ZeroNet dev resources](/Talk.ZeroNetwork.bit/?Topic:1509171908_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h/Yet+another+ZeroNet+Dev+Resources+Index), some recent projects haven't added though.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1516735983",
			"date_added": 1516954318
		},
		{
			"comment_id": 24,
			"body": "Quite a piece of professional writing and not easy to digest. \n> We’ve all been there. You’re arguing with someone – about politics, or a policy at work, or about whose turn it is to do the dishes – and they keep finding all kinds of self-serving justifications for their view. When one of their arguments is defeated, rather than rethinking their position they just leap to another argument, then maybe another. They’re rationalizing –coming up with convenient defenses for what they want to believe, rather than responding even-handedly to the points you're making.\n\nYep, I experienced it a lot when taking political news or issues with a close friend. That's disapointing, but sometimes we just need communication, even if it's just small talk or something politically-incorrect.. That's ok I guess.\n\nOn the other hand, the author tried to raise a new concept and named it \"rationalization\", but maybe, to some extent he was also rationalizing something.. a kind of self-contradition or self-reference.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519408769",
			"date_added": 1519460930
		},
		{
			"comment_id": 25,
			"body": "Here is my writing for zite bootstrapping: [Zite Publishing - From A User's Perspective](/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/?Post:70). I can't download your RainyNite Demo, \"home page under construction\", repo for Obligatory empty page. The other two in your profile are ok. Hope my writing can help",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1517271094",
			"date_added": 1519461629
		},
		{
			"comment_id": 26,
			"body": "> It's not a new concept.\n\n@caryoscelus: I see, then the `More formally, in recent work we have defined rationalization as ... ` in his article is just a re-defining.",
			"date_added": 1519516559,
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519408769"
		},
		{
			"comment_id": 27,
			"body": "I guess more than 90% of people in my local don't care about our native language or mother tongue. But it's said that the language here changed little for more than a thousand year, as the culture here is quite conservative. I care about it but it's hard to systemize, and systemizing it may also destroy it and its diversity\n--- ---\nImo language is a communication tool but also a (culture) identity, and sometimes it's a secret/encryption, a group with same/similar identity have some consensus, can understand and accept each other more easily, and are more willing to talk to and help each other.",
			"date_added": 1519611866,
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172"
		},
		{
			"comment_id": 28,
			"body": "> I didn't say \"care about language\", but \"care to understand language\".\n\n@caryoscelus: sorry that I misread such a small post.\n\n> More generally the problem is that many (maybe all to some degree, but the degree matters a lot in this case) people prefer (unconsciously, of course) to understand any external information (including text/speech in their native language, mentioned in original post) in a way that is most consistent with their expectations.\n\nAgree. People don't learn a native language by learning grammar or language theory, it's quite a subconscious process.\nPeople prefer to understand more about external info, it might because it's more natural in that way (I also wanted to mention self and others, but I feel that idea could be a bias).\nWe can also change to question to: Why do some people begin to care about understanding their native language?\n\n> but that identity appears to be largely illusionary.\n\nI agree that identity isn't a good word, as it sometimes isolates a group and raises racism. Maybe familiarity, feeling at home, consensus are some better words.\n\n> Different groups who speak supposedly single language might have the \"tourist\" level of mutual understanding.\n\nYep, might have, there are also some opposite. E.g. Japanese tends directly absord different languages into itself. Many Japanese people can only speak Japanese but are very open-minded and creative, I even saw a documentary from Arte, an English professor brought a Japanese assistent to Africa to do some research, he could only speak Japenese and they communicated with each other in it.\n--- ---\n> my original thought was not about native language vs more popular language. \n\nThat's also something I'm concerning about. Because some children of my relatives here now speak more national language taught in school than native language learnt from the beginning. That's unavoidable I guess, because most of their time is now spent and exposed to the national language, and because they live in a more (inter)nationlized region.",
			"date_added": 1519691603,
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172"
		},
		{
			"comment_id": 29,
			"body": "@caryoscelus: I really like and agree your answers to the new question :) but I also feel your answers missed the keyword \"native\", i.e. you are more answering \"Why do some people begin to care about understanding language?\"\n\n> My point about identity being illusionary was not about the word being appropriate. Rather, that the feeling of being similar due to speaking same language is largely an illusion.\n> ...\n> but then it is more correct to say that language is a part of cultural identity, but it does not define it\n\nFor some culture the language may not define the identity, but for some culture it does. German and Germany is a good example I guess, though some Dutch seems to consider German as not a real language, from the popular \"American first, the Netherlands second\" video [[IFS]](/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_1G27nKed7YQPtNxhH7DXoEKkmjj7Yq5D1x_item_10+type:video) [[Youtube]](https://www.youtube.com/watch?v=ELD2AwFN9Nc) (so it may be just a joke). Similarly once I saw someone complaint \"the grammar of English is that English has no grammar\".\n\n> Admittedly, sometimes language and cultural tradition go hand in hand and not very separated\n\nYep, sometimes, and sometimes not, you may like to take a look at this wiki for a whole view of the current situation of languages: [Language family](https://en.wikipedia.org/wiki/Language_family)\n\n> i.e. you may speak the language but feel alienated from the rest of culture, even if there is single culture associated with language\n\nIf an individual gets alienated, it has nothing to do with the language, and my previous view \"a group with same/similar identity (language) have some consensus, can understand and accept each other more easily, and are more willing to talk to and help each other.\" is still proper I guess.\n\n> Somewhat similar is with human languages: direction of thought, common themes, education and worldview often contribute more to productivity of communication than sharing native language.\n> ...\n> I'd be quite happy if everybody would switch to a single logical constructed language as first lang or at least would be able to communicate in english.\n\nI guess the Japanese example I mentioned in previous post is still a counterpoint to this view. I prefer an idea that capable individuals learn more languages and bridge different culture (or creating a high quality translation machine), instead of all people in the world can communicate each other with the same language.\n\n> But it seems to me that attaching inherent ethical value to diversity is a dangerous path (less dangerous than attaching ethical value to unification, though).\n\nFor the trend of decentralization (if it's not an illusion), I think we are favoring diversity than unification.",
			"date_added": 1519778270,
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172"
		},
		{
			"comment_id": 30,
			"body": "@caryoscelus: \n> i just noticed that phrase \"to understand language\" can have two somewhat different emphasises\n\nYep, I also often get stuck in finding that a phrase may have more than one meaning or emphasize on different things, and can't reply immediately, one of the reasons that I seldomly speak in chatroom.\n\n> Do you use german as example of language that defines identity?\n\nThink about it one more time, I suppose \"German language defines Germnay identity\", or \"Germany identity is only defined by German language\" is wrong, afaik Germany identity is also defined by its history, geography, culture, etc. So now I agree with your opinion:\n\"but then it is more correct to say that language is a part of cultural identity, but it does not define it\"\n\n> But for a language spoken by hundred thousands or millions?\n> ...\n> Hmm, did you mean \"counterargument\"? (Supposedly) more common musical meaning of word \"counterpoint\" seems to be only tangentially related.\n\nThen that language is probably a macrolanguage instead of a single language, in WordNet \"counterpoint\" as a noun only means \"a musical form involving the simultaneous sound of two or more melodies \", but in Oxford Dictonary it has three meanings, and one is \"(written) a pleasing or interesting contrast\". Good example to show that there are quite a lot of differences between AmE and BrE, there are also Canada English, Australia English, Chinese English, etc, in different region a language can varies a lot and is influenced by the speaker's native language. Further more some may become mutually unintelligible. Like Singlish (one kind of English spoken in Singapore), heavily mixed with Malay, Chinese, Tamil, and also acronym (RMB -> remember..)\n\n> This is why i call the consensus and identity illusionary. It often works for people who are similar, but breaks when differently enough people confront each other.\n\nYep, That's also why I consider identity isn't a good word. Consensus is a bit different I guess, in Oxford Dict it means \"an opinion that all members of a group agree with\", so a consensus can also apply to all human, like peace, empathy, fairness. It should be helpful for solving \"No true Scotsman\" argument, too.\n\nAlso language diversity may lead to more misunderstanding, but it doesn't mean it's guilty for the issue you mentioned and shouldn't be promoted.\n\n> as for language diversity, i don't see how it can increase freedom.\n\nYep, it's not for increasing freedom, imo diverisity is for more differences, more different kinds of things, more things that I still don't understand, and more possiblility.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172",
			"date_added": 1519867036
		},
		{
			"comment_id": 31,
			"body": "@caryoscelus: \n> Would it be better if everyone would speak their own unique language?\n> ...\n> Every person can be viewed as unique regardless of language.\n\nI find this question hard to answer, but I think it would be better if everyone has their own opinions, thinks different but is still agreeable and tolerant to others. A unique language is helpful for the former, a common language is helpful for the latter I guess.\n\n> I don't think i can persuade people who are not close to my opinion that it would be better if there would be a single common language.\n\nEnglish is already a global [lingua franca](https://en.wikipedia.org/wiki/Lingua_franca) [[ref]](https://en.wikipedia.org/wiki/English_language), but still learning English is hard for many people in many regions, learning a language takes a lot of time. I think it would be nice if learning a language became very easy and anyone could easily communicate with each other with a same language.\nBut a differnet approach, a high quality translation machine is also ideal I suppose. It would be wonderful when a human being met an alien, the translation machine collected the language the alien spoke, understood it and then they could communicate with each other.\nMachine is better for this job I guess.\n\n> Would it be better if there would be millions of languages spoken in the world?\n> Would it be better if there would be hundreds of languages spoken in the world?\n\nWhat about replacing languages with species: would it be better if there are millions of species in the world? Or only hundreds of species?\n\n> diversity in one area may take away resources from another. For example, consider how much resources is put into translation\n> ...\n> Even understanding each other while speaking supposedly single (macro)language proves to be a hard task\n\nI think this problem should be solved by technology instead, aka translation machine or others.\n\n> Natural sciences, social sciences, arts\n\nIn Europe, before most natural sciences papers were written in Latin, later in German (iirc, especially for modern physics), and now in English. English isn't a good language for precise writing, if you agree..\n\nSome branches of social sciences are related to culture, and so need a differnet language. Some are not, so a common language is probably better. Arts has nothing to do with this topic I guess, and it sounds weird if all people did arts and communicated arts with a common language.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172",
			"date_added": 1519947971
		},
		{
			"comment_id": 32,
			"body": "@caryoscelus: \n> I think it's slightly better than average, due to having a rich \"extended\" grammar that is however rarely used in many areas and can be misunderstood by those unfamiliar with it. That said, i suppose any language with philosophy and science tradition would have that.\n\nI totally agree on these statements.\n\n> There are a lot of untranslatable ambiguities and nuances though.\n\nA single language itself also has a lot of ambiguities and nuances. These issues are not easy to solve, but it doesnt mean they are unsolvable.\n\n> I suspect that even the most sophisticated machine would not stop smaller languages being influenced by and even possibly merged into bigger ones. While it would solve the problem of extra work, it might also end up accelerating language extinction.\n\nThat's true, but it doens't mean we can't save them. There are many ancient scripts written in different languages, unique culture expressed in different languages (by spoken or by written). And translation isn't enough to understand and preserve them. Like Maya civilization, it's extinct but now many people (historians, etc) are taking a lot of time trying to re-discovery and understand them. Why not try to save (keep) them from the beginning when it's possible?\n\n> As for me, i don't like attempts to fit humanity into reflecting biological processes ...\n\nUnfornately I studied life sciences when I was a student, and I like to fit (compare) human(ity) to a larger system :3\n\n> Better for whom? What hundreds of species? Depending on that, it may be considered better or worse.\n\n(Language) diversity is better for everyone I suppose, from [wiki - Ecological effects of biodiversity](https://en.wikipedia.org/wiki/Ecological_effects_of_biodiversity): \"The current rate of extinction is sometimes considered a mass extinction, with current species extinction rates on the order of 100 to 1000 times as high as in the past.\" From [wiki - Extinct language](https://en.wikipedia.org/wiki/Extinct_language): \"As of the 2000s, a total of roughly 7,000 natively spoken languages existed worldwide. Most of these are minor languages in danger of extinction; one estimate published in 2004 expected that some 90% of the currently spoken languages will have become extinct by 2050.\" Certainly language diversity is diferent with biodiversity, but like species, if a language was extinct, all related things were unrecoverable, and it would be harmful than helpful to human culture ecosystem I think.\n\n> Arts, just like sciences were an example of diversity and things to explore unrelated to language diversity.\n\nI don't think arts is unrelated to language diversity. Even some arts from the beginning are languages, like calligraphy.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172",
			"date_added": 1520049714
		},
		{
			"comment_id": 33,
			"body": "@caryoscelus: \n> I don't think you've answered why should we be trying to preserve them\n\nMy statement \"translation isn't enough to understand and preserve them.\" is one of the answers, and your new statement \"the only way to get those nuances across would be to write a long footnote describe all possible meanings in the original.\" also proves it I guess.\n\n> For my \"anti-conservative\" mind possibility that exactly current situation is the best sounds very improbable\n\nActually the situation is getting worse for language diversity, from the prediction in \"wiki - Extinct language\", as mentioned in my previous post. For \"anti-conservative\", I also agree that sometimes old things need to die and make room for the new. But lost of diversity can become a different thing, it can mean the whole system is dying, like you previous statement \"smaller languages being influenced by and even possibly merged into bigger ones\", so in the end would there be only one existing, then die of loneliness or mono.\n\n> My point is that the efforts put into language diversity might as well be put into other diversities or just things to explore (where sciences, arts and math are just examples) and i don't see any way to evaluate what will result in a better diversity overall.\n\nThey are not in conflict I suppose, some people choose learning more languages and study different culture, some people study sciences, arts, etc, and try to discover something totally new. But without language diversity, no one could do the former any more. \n\n> ..but not proving them. In other words, it is good for illustrating position, but it isn't evidence that can be used as sound argument.\n\nYep, though imo proving, sound arguments may be necessary for debate, are not always necessary for discussion or understanding. And analogy can provide a wider/new vision for it, but this is a bit off-topic.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172",
			"date_added": 1520136795
		},
		{
			"comment_id": 34,
			"body": "@caryoscelus: sorry for the late reply!\n\n> Why not create more languages?\n\nNo problem with that, and I think it's not in conflict with existing languages. I'm also interested in constructed languages like toki pona, though I still haven't look into it. Creating one new language should be fun, too.\n\nFor Esperanto there were/are quite many critics: For [the current wiki page](https://en.wikipedia.org/wiki/Esperanto#Critics) there are only 3 lines. But if you dig the history a bit, you may find something very different... Like [this version on 12 April 2016‎](https://en.wikipedia.org/w/index.php?title=Esperanto&oldid=714902227#Criticism)\n\n> Even if one language is dominating, there probably will always be people who would be interested in learning other (including dead ones; and note that internet languages will be much better preserved than ancient ones) languages for fun.\n\nI agree. People can also learn dead languages, like Latin, ancient Greek. But it needs a lot of effort. It's hard for a learner to reach the level of native speaker, and a learner can't find a native speaker for helping practise the language as there are not native speakers any more.\n\n> I think i understand your position well enough and the rest is indeed a debate. I could be mistaken (or it is possible that you don't understand my position) though. But it seems to me that we started going in circles.\n\nYep, it looks like our discussions couldn't focus on specific arguments. I won't say we are in circles though, imo we are still sharing valuable opinions :)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172",
			"date_added": 1520769080
		},
		{
			"comment_id": 35,
			"body": "@caryoscelus: Yep, toki pona is a toy, probably won't be used for serious things/study/research, but like esperanto, the community is quite active, too. \n\nFrom wiki, Ithkuil is designed to express deeper levels of human cognition briefly yet overtly and clearly. That's super cool! Guess using that language will be like solving difficult math problems :D \n\nFor lojban, it looks quite user-friendly and not hard to understand, I can't say I like those `.`, `'` before looking into it more though.\n\nI wonder if there is a research project like teaching AI or robot to use a constructed language. Relatively easy word creation process is important and can be used as a criterion, maybe AI can help us find/create a best constructed language and even a common language\n\nBtw, before I tore an English sentence and created such a thing: ðose vvh0 1 n 1gn0re 0 _no_ 0n1y ha1f 0f ðe vv0r1d. ðey vvill l0se n 1't _no_ y. (the content is kind of a rant though)\n--- ---\n\"Some people have claimed that using Ithkuil, a person would be able to think five times faster. Do you believe this?\" XD [[Ithkuil FAQ]](http://ithkuil.net/faqs.html)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1519602172",
			"date_added": 1520905452
		},
		{
			"comment_id": 36,
			"body": ":O 知っている。ですが、人類が前に進むために機械の進化が必要だと思う",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1520944931",
			"date_added": 1520946691
		},
		{
			"comment_id": 37,
			"body": "@caryoscelus: 読める (yomeru) =D\n\n> kanji no kaku wa dzibun ga dekinai\n\nкорз уа чотто кагакутзки дзуанаи\nこれはちょっと科学的ではない :P",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1520944931",
			"date_added": 1520988049
		},
		{
			"comment_id": 38,
			"body": "@caryoscelus: dzibun(人類)はどうやってshinkaできる？工具(kikkai)の発明がいるですから",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1520944931",
			"date_added": 1521043135
		},
		{
			"comment_id": 39,
			"body": "@caryoscelus: yep :3 it's called [Pe̍h-ōe-jī](https://en.wikipedia.org/wiki/Pe%CC%8Dh-%C5%8De-j%C4%AB):\n> Developed by Western missionaries working among the Chinese diaspora in Southeast Asia in the 19th century and refined by missionaries working in Xiamen and Tainan, it uses a modified Latin alphabet and some diacritics to represent the spoken language. After initial success in Fujian, POJ became most widespread in Taiwan and, in the mid-20th century, there were over 100,000 people literate in POJ.\n\nI don't understand Pe̍h-ōe-jī, but my native language is a relative to Hokkien so I can somehow understand some words",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1520944931",
			"date_added": 1521067486
		},
		{
			"comment_id": 40,
			"body": "おめでとう！どうなんインプットメスッド（メソッド :）をお使いですか？僕は[fcitx-kkc](https://www.archlinux.org/packages/?name=fcitx-kkc)を使います。しかし使うのはほとんどない;_;",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1522766920",
			"date_added": 1522798984
		},
		{
			"comment_id": 41,
			"body": "@caryoscelus: 以前僕もfcitx-mozcをインストールした、しかしグーグルのモノが好きじゃないので、fcitx-kkc見つかたからmozcをアンインストールしました :P\n\n> カタカナオーヴァードーズ:O\n\nたしかに XD",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1522766920",
			"date_added": 1522813233
		},
		{
			"comment_id": 42,
			"body": "Cool learning method! Kana was [simplified/developed from Kanji](https://en.wikipedia.org/wiki/File:FlowRoot3824.png), you may like to use the chart as a cheatsheet",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1522809900",
			"date_added": 1522813996
		},
		{
			"comment_id": 43,
			"body": "@caryoscelus: I discovered an ancient Japanese poem [Iroha](https://en.wikipedia.org/wiki/Iroha), which is a perfect pangram, containing each character of the Japanese syllabary exactly once! (sic except the !) For Kanji, as there are too many.. so no one created a pangram ;_; But there is [Thousand Character Classic](https://en.wikipedia.org/wiki/Thousand_Character_Classic), exactly 1000 different Kanji, thank @Leftside for mentioning it.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1522809900",
			"date_added": 1522972476
		},
		{
			"comment_id": 44,
			"body": "@caryoscelus: sorry for the late reply again :P You may like to try https://www.linguee.de/ and https://www.dict.cc/",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1523371478",
			"date_added": 1524106657
		},
		{
			"comment_id": 45,
			"body": "@caryoscelus: my pleasure ;)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1523371478",
			"date_added": 1524151399
		},
		{
			"comment_id": 46,
			"body": "Your worry is reasonable.. I try to seed your homepage with my clearnet proxy (port is opened) but it's hard to download for the first time, now there are 29 files failed to download, then.. in my local node (port is close) I open your homepage, claim it's my site and publish it, now I can view your blog on my clearnet proxy \\o/ Also.. I add your homepage to the left panel of my ZeroBlog ;D",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1526063576",
			"date_added": 1526092131
		},
		{
			"comment_id": 47,
			"body": "> any \"serious\" problems.\n\n@caryoscelus: one is about large scale opinion manipulation (though media (esp. TV-media) has been doing this kind of things for a long time already), like the recent scandal about Cambridge Analytica manipulated US election -> Psychology, Neuroscience, Social engineering (political science). If an individual can't control her/his data, s/he probably won't have real freedom, by what s/he is doing online, from what s/he views to what s/he dis/likes. The statement about [creating a class acton against gafam](https://www.laquadrature.net/en/class_action_gafam) is also a piece of solid opinion:\n\n> However, European law is now crystal clear: monetized, sold-off consent has no value, and is no longer enough to make their mass surveillance legal. Zuckerberg and his friends can no longer use this worthless agreement as their alibi to claim we're responsible for the loss of our privacy, or for the destruction of our social bonds. \n\n--- ---\n\nCorrection: I think it isn't the free network is causing sth, but the profit/busniess model behind the free network is causing the problem, and it seems the time has come to reshape that business model..",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1527273982",
			"date_added": 1527441132
		},
		{
			"comment_id": 48,
			"body": "> one can simply stop using bad services.\n> ...\n> Unfortunately i still need at least one service that wanted me to reconfirm my agreement.\n\n@caryoscelus: looks like these two opinions are a nice couple..",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1527273982",
			"date_added": 1527441542
		},
		{
			"comment_id": 49,
			"body": "@caryoscelus: Fine, thx for your reply.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1527273982",
			"date_added": 1528345812
		}
	]
}