{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1586599656,
			"title": "After 5 years of development",
			"body": "here is \"decentralized\" ecosystem without \"single point of failture\", which can not exist without some fucking servers running trackers (operate by WHO ???) which collect and log all info about users of this \"system\"\n\nARE YOU FUCKING SERIOUS?",
			"added": 1586599655
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": [
			{
				"comment_id": 1,
				"body": "> [draugrdeathlord](#comment_523_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): you dont need the trackers after the first initial syncthey only collect data of the IP address, use a VPN !? dumbo\n\nConnected through TOR of course, einstein. \n\nPlugin enabled: AnnounceShare, Bootstrapper\n\nWrote some random shit to config → Trackers, restart. \nZeronet STILL connects to trackers WITHOUT any trackers fill in trackers or trackers files in 127.0.0.1:43110/Config.\n\nDumbo",
				"added": 1586610009
			},
			{
				"comment_id": 3,
				"body": "> [blurhy](#comment_393_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): I wrote a wiki on this. [...]\n\nThat's good summary. Seriously the official ZeroNet website is complete joke. Decentralized without single point of failure my ass. \n\nWho is this nofish? It was some college project five years ago? He chicken out? \nLack of money? Why this project is not push through channels like youtube, twitter to bring more people? To show progress? There are ZeroNet trademark acounts but without any activity.\n\nOr some crowdfunding campaign to gain resources and attention. Nothing. Zero.\n\nIt stinks here. Sorry. It's like the rest bullshit around,  come here it's free sit down and have a good time. \n\nThe promotion says something else than what is deliver in reality. \n\nSorry, but that's bullshit.",
				"added": 1586631896
			},
			{
				"comment_id": 4,
				"body": "> [krzysztof113](#comment_29_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5): I don't mind planning and organizing some marketing campaign. I wouldn't have known about ZN if not for the torrentfreak article in 2016. But if you are antifa behind decentrack then I expect you are more about complaining then accepting that ZN is pretty good for circumstances.\n\nAntifa? Walking across towns in black hoodies chanting socialistic slogan and protect people by kicking them in ass? Lmao.\n\nI found info about ZeroNet on github ( there is long summary about random peer to peer and decentralized networks projects - clearnet address: https://github.com/moshest/p2p-index ). \n\nAfter https://zeronet.io visit I was like fuck this is insane and genius. After I fired up zeronet.py and lurk around the system I'm just like omg, wtf. Sorry. But ehm, no.\n\nAccepting that ZN is pretty good for circumstances? Hm, why? It' s not decentralized and It has lots of point of failture. \n\nYea, I have to admit I can talk with you without any moderator's action now. \nIt's open source.\nI have also admit that all traffic is log by servers which are run by unknown entities 24/7/365 and without them there is no ZeroNet.\nI have admit that crucial parts of ecosystem are depend on some VPS running by guy in Eastern Europe too.\n\nSorry, but what the fuck? \n\nThis is FIVE YEARS old project. This is not techdemo which I should worship yea yea this is good I see a lot of potential in future. \n\nSo question is what nofish intends with his work now? He is pretty inactive, no communication towards potential market (users) on established channels (youtube, twitter).  Already under pressure of law and cops and he is bug out?\nBecause it looks like he is.  \n\nI would rather see some feedback, for example:\n\nI don't have money for develop ...\nI don't have time ...\nI don't have any credence in future of this so I finish develop\nCops are on my back, so project is ceases\nI collaborate with cops and \"law agencies\" so keep speak your minds and seed copyright material idiots, my friends will put you in cage, the tropical island with whores and booze waits for me. \n\nIt's a nice techdemo, college project. Don't see any point of building sites, services, construct anything on it. Basements of this structure are unstable with one housekeeper and fuzzy future. Thats my 0.02 $.\nMy pov. I will lurk around. \n\nTake care.\n\n\nOne thought in the end. If the presentation of ZeroNet be like: \n\n- it's tech demo\n- we depends on that ...\n- we have problems with that ...\n- we need change this ...\n- this is only temporary solutíion ...\n\nand not this corporation's crap \"we build best bulletproof solutions without single point of failure, join us\"\n\nit will HELP A LOT and the whole picture will be more clear.\n\n\nLast thing in this total useless brainstorm session. The project is fully dead in my opinion, because the founder showed his real identity and in the end of the day he will be under pressure of \"law\" to cooperate no matter what the circumstances are or will be.  This was his mistake. \n\nPush code, push open source code. Not yourself to masturbate your ego. You don't get lovely pictures in fashion magazine for your results in this sector.",
				"added": 1586678556
			},
			{
				"comment_id": 5,
				"body": "> [draugrdeathlord](#comment_524_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): I said you don't need trackers after initial sync not it won't connect to them if they are there you fucken idiot. [...]\n\nHello my friend !! Thanks for your advice. I will definitely use some VPN which naturally isn't backdoored and all logs aren't sent to \"security agencies\".\n\nBecause VPN services have on website information that they \"didn't log traffic\" and you can paid services by crypto for your \"anonymity\". \n\nI remember how truecrypt end instant because it stood in the way. You can use Vera fork paid by french \"government\". Remember how Lavabit was push like a whore and they simply destroyed them without any problem.\n\nAll VPN cooperate. If not, they are terminate. \n\nTOR is paid by USA \"government\" most entry guard are loged. Still preferable than VPN. \n\nTake care\n\nAnd don't use rude language,  watch your mouth. You are in public.",
				"added": 1586680054
			},
			{
				"comment_id": 6,
				"body": "> [bisks](#comment_19_1Pf7ntfCB66Jxn5dkCubd28dB5saz4z9uS): So, after all that waffle my question still remains unanswered.  Do you or any one else have something better in mind? In other words, does anything exist similar to zeronet that is fully decentralized?\n\nNope, I don't have anything.  Most projects offer this:\n\n- not open source\n- you have to use or pay some crypto fake shit\n- unknow dev + not open source\n- 'federate moderation bullshit\" which is basically censored crap \n\nIn the end of a day I have to admit there is no better or similar services (Freenet, i2p, ZeroNet).",
				"added": 1586718378
			}
		],
		"1586627246_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 2,
				"body": "> [astrav](#comment_33_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): Do we know more about the github being down? Issues? DDOS?\n\ngithub works.  Xorro P2P latest commit on Aug 16, 2017, Issues 0, Pull requests 0\n\nIt looks like student's (chen, lee) school project with teacher (kurutz) in the lead.",
				"added": 1586629355
			}
		]
	},
	"comment_vote": {}
}