{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1613213110,
			"title": "#freebritney the fastest way is to kill her \"psychatrists\"... death to apa...",
			"body": "I am deadly serious, it's such a waste of time to go the legal route against those who receive bribes from her father to keep her hostage, furthermore I am sure most of the us judges are full on pedos... like their big chief that will be murdered with his spawns of hell scotus enemy no1 john robets... yeah like the children of amy when this whore will try to take our guns or force vaxx us...\n\nwar ... waged.",
			"added": 1613213109
		},
		{
			"topic_id": 1613220840,
			"title": "who is the cia station chief in paris france?",
			"body": "I want to be able to kill his mothers, his sister brother, his father anything he or she knew\n\nI see them as paraiste, vermins, plagues and the enemy of mankind\n\nwho is this guy / girl?\n\nleak...\n\nplease\n\nwe kill him and all like him until they don't dare to fuck us like the MSS does...\n\ncorpses that's all they are \n\ndeath to all personalls, former and current of the cia and their offsprings\n\nwar eternal forever.",
			"added": 1613220838
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1613197883_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 1,
				"body": "I guess like modizilla they got some checks, to serve the child rapists techno oligarchy, and like them will go to the dark web to order kids to rape from the us forces... that's it.",
				"added": 1613208271
			}
		],
		"1613138369_1KihcBqcwgH1TKeZtKRnocUr22oUb5Av5A": [
			{
				"comment_id": 2,
				"body": "china homeland, dreamland program... aka mega economic growth project to get to our first star !!! yes, a star, far away... \n\notherwise, the big lee programs, defeating child rapists forces on the pacific, securing south east asia (from the child rapists again who always seek to conquer this part of asia to then push toward china ((harder to invade NK or RUSSIA) and what? that's it... biz as usual... less covid.",
				"added": 1613208377
			}
		],
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 3,
				"body": "clearnet is for the plebes.",
				"added": 1613208416
			},
			{
				"comment_id": 8,
				"body": "my big problem here is the data limit trigger... even gates (8ko) would be shocked now...",
				"added": 1613220006
			}
		],
		"1612976844_16E25Tu9jf8GTS2S1W5mZs6Ayc9vQkC8SN": [
			{
				"comment_id": 4,
				"body": "you know cia/nsa aka the child rapists forces needed access to windows since dos... so... then by cooperating he got child rape rights like with epstein to then accomplish his father dream of depopulating china... gl&hf demons.",
				"added": 1613208528
			}
		],
		"1612580386_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 5,
				"body": "useless, waiting for his execution primarly for being a child rapists defender, supporter... he may get killed before he dies. but that's the only thing for those things, death.",
				"added": 1613208859
			}
		],
		"1607300234_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 6,
				"body": "I beta tested gab censorship, and they are fucking lying cheats (like most usaers).\nthey are a total cia (child rapist protection agency) honey pot, like the fuckers at parlor\nand you will see that most of the fake conservatives backing the pedos (if only opposing in words) are all for those...\n\naka done.\n\nbut it's a fucking great idea to defeat the censorship of the bastard serving the child raping aristocracy.\n\ninternet second layer :).",
				"added": 1613209316
			}
		],
		"1613213110_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9": [
			{
				"comment_id": 7,
				"body": "?",
				"added": 1613213158
			}
		],
		"1613220840_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9": [
			{
				"comment_id": 9,
				"body": "for fr disc : http://127.0.0.1:43110/1Vp5LH4wegCaqeB72yMw2jgNdVm4aR7ET/?Topic:4_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9/c+est+qui+le+fils+ou+la+fille+de+pute+qui+est+cia+station+chief+a+paris",
				"added": 1613221121
			},
			{
				"comment_id": 10,
				"body": "and cross posting for censorship (fr talk is reknown to wipe un pc post).",
				"added": 1613221141
			},
			{
				"comment_id": 11,
				"body": "facebook pics, insta account or his special tinder acces (with premental training of his target, like his or her wife). like they do... slave herders.",
				"added": 1613221178
			},
			{
				"comment_id": 12,
				"body": "but as said, his or her life is worthless nothing, pedo slave servant or pedo itself... prefer to kill the oligarch / aristocrats in the background... funnier, faster, easier... pintades.",
				"added": 1613221228
			},
			{
				"comment_id": 13,
				"body": "american officials were born to be hunted down... they are to be hunted beasts... not humans, not animals, not even demonic... just a blend... inhuman. to be hunted and eliminated.",
				"added": 1613222063
			},
			{
				"comment_id": 14,
				"body": "hey jonny brennan we will kill your whole family... no doubt about it, and all the kidos you hide too... oh we know more than you even do... boy, goy even,... ahahhaa. and to be fake muslim...ohhh that's very bad... yuge sin.",
				"added": 1613222146
			}
		],
		"1613222411_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": [
			{
				"comment_id": 15,
				"body": "americans...",
				"added": 1613224051
			},
			{
				"comment_id": 16,
				"body": "killing the cia, dod, fbi, doj, congress (state and federal lvl)... but after the american child raping cleptocrat aristocrats (all the friends of epstein and weinstein)...",
				"added": 1613224094
			}
		]
	},
	"comment_vote": {}
}