{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1579103005_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "For the firewall/antivirus you should also add nftables (firewall) and clamd (antivirus),\nthere's inkscape natively for linux afaik,\nfor f.lux there's also redshift,\nQEMU is another hypervisor that runs in linux and takes advantage of KVM,\nI don't know Technitium MAC address changer but by the name I think macchanger is an alternative in linux,\nViewnior is rather simple for image viewing, there's also eye-of-mate and KDE's okular,\nfor reading PDF files, there's atril/evince, okular, mupdf, zathura ...",
				"added": 1579289385
			}
		],
		"1582105711_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "dd is like the most foolproof way of doing it assuming you get the size correctly and your drives are healthy. ddrescue is a better approach if your drives show faults. But dd is slow in respect that it just copies empty space as well. Using more specialized tools like partclone and ntfsclone (for ntfs partitions) allows to skip most free space, and if you use Clonezilla you could even clone to an smaller drive given there's enough free space to lay data out in the destination drive. Though, partclone doesn't produce exact clones so it may not be what you are after if trying to duplicate licensed software or other things. Even UUIDs may end up changing at the end.",
				"added": 1582121307
			}
		],
		"1582101669_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "you'd have to open an administrator command prompt and use diskpart, there you'll see the partitions. It may be many things, for once I think windows won't automount more than 1 partition in removable drives so you may have to assign letters to the rest manually (You can also do in the disk manager window).",
				"added": 1582121428
			}
		],
		"1584103549_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "One concern that stays is non isolated APs where a local attacker connected to the same network could attack other ports in your devices other than HTTPS, SSH and other secure protocols, the main issue here is since it is a public network, it is commonly located in a public area as well where many people can come and go at any time, making it harder to find a potential culprit of an attack.",
				"added": 1584116211
			}
		],
		"1584106140_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 5,
				"body": "Not that I know of. If they just check your monthly bandwidth consumption then there's nothing you can do after reaching your limit. You could instead try using less traffic and avoiding apps that keep using mobile bandwidth in the background.",
				"added": 1584116450
			}
		],
		"1594553128_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 6,
				"body": "I think you might be interested in [dismail.de](https://dismail.de), they hold a list of [capabilities of many email providers](https://dismail.de/serverlist.html).",
				"added": 1594612880
			},
			{
				"comment_id": 7,
				"body": "> [ssdifnskdjfnsdjk](#comment_138_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Thanks for the input. This does not make me want to make them my primary e-mail provider for tens or hundreds of services.\n\nHmm, yeah. Kinda forgot about that but it is ok for my usage. Hope you find a better alternative with the service list they have (the list with the feature list of other email service providers).",
				"added": 1595118475
			}
		],
		"1601197833_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 8,
				"body": "Just a note, you can do just that with ddrescue alone, once it recovers what it can from the faulty drive it will have left the bad sectors marked with a '-' symbol in its mapfile, you can then use fill mode on it like this:\n    `ddrescue -f -F '-' /dev/zero /dev/sdX mapfile`\nand it will overwrite with zeros from /dev/zero the bad sectors in /dev/sdX as per the mapfile. I prefer it this way as I don't have to bother too much about proper sector sizes/addresses when writing over bad blocks, which in your case you may not be paying too much attention; your dd command is using bs=1024 which sets the input block size (the one that seek uses) to 1024bytes as well, that is, you will be seeking to the sectors listed by badblocks but that is assuming your disk (or badblocks, which actually does) uses 1 kilobyte sectors instead of conventional 512 bytes sectors or modern 4096 sectors. I think it would be better to make badblocks use 512byte sectors in its listing so if you forget to put 'bs=1024' in dd it will still work as dd's default block size is still 512bytes.",
				"added": 1601212454
			}
		],
		"1601196324_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 9,
				"body": "I know because I've used it so for a long while enough that windows 7 can play nicely with any linux os as long as you install windows first into a drive and then let linux take over the bootloader (grub for example). That way both can play along. I don't know from windows 8 onwards, maybe they are now more aggressive with the bootloader...",
				"added": 1601213283
			}
		],
		"1604611827_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 10,
				"body": "So, what filesystem did you end using for your root? btrfs? ext4? xfs?",
				"added": 1604800790
			},
			{
				"comment_id": 11,
				"body": "I asked because afaik btrfs doesn't work well with encryption or at least have many caveats (raid 5/6 is also a source of worries)",
				"added": 1604965207
			}
		]
	},
	"comment_vote": {}
}