{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1637305080,
			"title": "What is this?",
			"body": "So, its like a decentralised and uncesored network??? wait is this unmodded, if yes, i suppose its a dark web on the surface web?, i mean i wont be suprised if i click on the more sites button on th homepage, and the first results are either drug stores or illegal p***n.",
			"added": 1637305079
		}
	],
	"topic_vote": {
		"1637305080_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1637504933_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1637305080_18DQw1RXP4gQcqPcYrxZEPzc55fXAv16eQ": [
			{
				"comment_id": 1,
				"body": "i mean if i come aross ilegal p***rn a cop isn't gonna show up on my door right???, i mean i don't technically host anythyng on this network (exept the things i upload/download)",
				"added": 1637305495
			},
			{
				"comment_id": 2,
				"body": "also what are those \"trackers\" in the upright corner, i have my tracker blocker on, those shouldnt exist, i have legit privacy concerns here",
				"added": 1637306515
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac@kxoid.bit](#comment_264_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3):  on ZeroHello site so you benefit from Tor anonymity.\n\nok",
				"added": 1637560655
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac@kxoid.bit](#comment_264_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Those are BitTorrent or BitTorrent-like trackers. Have you never used BitTorrent before?\n\nI have used µTorrent to get my hands on a photoshop version from 2012 when i was i kid, and my mom didn't buy me any games., i read about µTorrent and how i can get any software i want, i really didnt use the software i torrented, i just torrented  out of curiosity and experimenting (and because my mom didn't want to buy me minecraft\" , but i use FDM for my torrenting needs now,\nbut at the time i really didn't understand how torrenting works, i said to myself \"I dont know how it works, but as long as i get my hands on the thing i want - im fine\"",
				"added": 1637561417
			},
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_1158_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Except what mentioned musickiller i would suggest not clicking Help distribute all files kind of option on sites. That will prevent download and distribution of files you have never seen. But many static sites works the way it downloads all content, not just the one seen on the page you have visited. On big user contributed sites, they are using \"optional files\" which means user contributed files (images, videos) will be downloaded only when requested on page you have landed. So when some image is bad, you can delete it onsite or manually by its name from HDD. Mute the user, Delete whole site, block the site from displaying again. And if you are worried about police, use good VPN or enable Tor:Always mode on ZeroHello site so you benefit from Tor anonymity.\n\nim really not conserned about legallity & law stuff, i dont care about those, thanks for the advise, anyway, im rather conserned about my braincells not being boiled with PTSD, but your advice helped me here so i guess thanks.\n\nOne thing i learned: This is like 2B2T, If you know where to go - youll be just fine, but if you don't, then buckle \nup.",
				"added": 1637562091
			}
		]
	},
	"comment_vote": {}
}