{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Quem criou o avião: Santos Dumont ou os irmãos Wright?",
			"body": "Os irmãos Wright começaram voando com planadores baseados nos estudos do Alemão Otto Lilienthal, que foi o inventor deste tipo de aeronave. O Flyer era basicamente um planador motorizado. O seu motor era fraco, possuía apenas 12 HP de potência para um peso que podia chegar até 300 quilos, o que dava uma relação peso/potência cerca de 28 Kg por HP, com isso seria impossível ele decolar apenas com a força de seu próprio motor. O local aonde teria acontecido o voo era uma colina, aonde haviam correntes de vento ascendentes, necessárias para o voo com planadores. O Flyer 1 atingia apenas 10 milhas por hora (cerca de 16 km/h) utilizando apenas o seu próprio motor, sendo que para decolar ele necessitava de pelo menos o dobro da velocidade. Se ele realmente voou, foi ou com uso de catapulta ou com ventos de pelos menos 20 MpH (cerca de 32 Km/h). Já o 14 Bis, pesava carregado cerca de 340 Kg e estava equipado com um motor de 50 HP, o que dava uma relação peso/potência de 6,8 Kg/HP, o suficiente para uma decolagem sem catapulta ou em condições de ventos muito fracos. Além disso o 14 Bis era uma aeronave mais completa, ele possuía aileron, asa com diedro e trem de pouso e o piloto ficava em pé enquanto no Flyer 1 o piloto ficava deitado, ou seja ele era mais prático. Quanto a sua qualidade de voo realmente não era muito boa, ele era instável, difícil de pilotar, afinal, era o primeiro modelo de aeronave deste tipo projetado por Santos Dumont, mas ele conseguiu cumprir os requisitos exigidos para a obtenção do prêmio Archdeacon. Realmente os irmãos Wright chegaram a fazer voos mais longos com outros modelos seus (especificamente o Flyer 3 de 1905), mas eles fizeram estes voos utilizando o sistema de catapulta (somente em 1910 os Wright abandonariam o sistema de catapultas com a construção do Flyer B, que possuía trem de pousos com rodas), e, além disso, o modelo que eles voaram ainda não possuíam os demais elementos que o 14 Bis possuía, sendo que hoje em dia todos os aviões possuem estes elementos que foram instalados pela primeira vez no 14 bis, este que é o pioneirismo do Santos Dumont, além da criação do dirigível. Falar que Dumont foi o inventor do avião ou que foram os Wright é uma perda de tempo, pois ambos deram a sua contribuição, que no caso de Dumont foi maior, pois como já disse antes, todo avião possui os elementos estruturais que apareceram pela primeira vez no 14 Bis.",
			"added": 1548704200
		},
		{
			"topic_id": 2,
			"title": "Como a direita pode ocupar a mídia?",
			"body": "A dominação gramcsiana é, principalmente, uma dominação na cultura. Em seu livro, \"Em Defesa do Socialismo\", o ex-candidato a presidentes, ex-Lula e atual réu em mais de 20 processos por corrupção, lavagem de dinheiro e crimes relacionados Fernando Haddad afirma que o Partido dos Trabalhadores já estava, na década de 90, dominando o cenário no que diz respeito à estratégia de dominação cultural.\n\nNão são poucos os relatos de professores que, por amor ao debate, há mais de 50 anos, participaram de bancas de seleção em diversas universidades selecionando marxistas de quem discordavam para favorecer as diferenças de ideias. Ledo engando. Uma vez capaz de formar sozinhos as bancas, os novos ocupantes, que entraram por cota da diversidade ideológica, começavam a formar bancas sozinhos, isolando os antigos mestres a quem deviam o acesso ao magistério e contratando mais dos seus até a ocupação completa.\n\nNa mídia houve um processo similar. O mesmo New York Times que publicou um editorial extremamente lúcido esclarecendo que o salário mínimo iria causar problemas seríssimos, especialmente para os mais pobres, nos Estados Unidos, agora não publica mais matérias com estudos aprofundados de diversas questões. Claro que este exemplo não revela uma estrutura, mas de fato o dano foi estrutural. Pessoas como Olavo de Carvalho e os grandes mestres Alceu de Amoroso Lima e Nelson Rodrigues publicavam com frequência. Hoje a coluna de João Pereira Coutinho parece uma esmola, apenas para não sermos obrigados a ler Leandro Karnal explicar o que é o conservadorismo com base em algum artigo da Wikipedia. Dos jornalistas propriamente ditos nem se fala.\n\nNas novelas, no cinema, na música e na demais \"belas artes\" ocorreu o mesmo. Há um sistema que é montado para que as pessoas elogiem umas às outras, teçam loas à atuação de quem concorda com a patota e exclua quem não concorda. De Mel Gibson a Regina Duarte, discordar é um erro que se comete na carreira para nunca mais cometer novamente. A festa acaba. Em premiações como o Óscar, vale lembrar que um estuprador como Harvey Weinstein é homem e branco; só não vale lembrar que é, também, um democrata. Tudo é interno; tudo é partidarizado.\n\nDado este panorama, o que é necessário para os conservadores é retomar a cultura, criando instituições e organismos capazes de viver sem depender do glamour dos meios dominados e, ao longo do tempo, capazes de fazer frente a esta gente.",
			"added": 1549551159
		}
	],
	"topic_vote": {
		"1_1A2AJCxA3n4QjikssyECqWMk8xBYniBpWa": 1,
		"2_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}