{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1548408145,
			"title": "About ZeroMe",
			"body": "I hope ZeroMe can have this feature: you can choose to view/not view which/Which several Hubs that have already been downloaded.",
			"added": 1548408143
		},
		{
			"topic_id": 1548757127,
			"title": "Report",
			"body": "I found that after opening the \"Use Tor meek bridge for tracker connections\" setting, after running ZeroNet for a long time, there is often no connection to the Tracker. (I guess it may be that there is a short-term network fluctuation or other situation during the operation of ZeroNet)\n\nIs it possible to add a function that makes Tor meek bridges to automatically reconnect when the connection is abnormal?",
			"added": 1548757124
		},
		{
			"topic_id": 1548825111,
			"title": "The Islamic State may have a new propaganda haven",
			"body": "> But now, the Islamic State may have found a solution that could make it virtually immune from removals online. It’s called **ZeroNet**\n\nBy Rita Katz\nContributor, PostEverything\nJanuary 28 at 5:15 PM\n\nRita Katz is the executive director of the SITE Intelligence Group and a terrorism analyst.\n\nEven after the Islamic State lost massive swaths of territory in the past few years, there’s one place where it still has survived: the Internet.\n\nIt hasn’t been an easy existence, especially in the past year. Messenger and social media platforms have become increasingly aggressive against the group’s online propaganda machine, perhaps to a breaking point. Telegram, the group’s current media headquarters, is removing Islamic State channels and chat groups at a rate previously unseen. Equally unwelcoming are social media platforms such as Facebook, Twitter and YouTube, all of which the group once relied upon as its loudspeakers.\n\nBut now, the Islamic State may have found a solution that could make it virtually immune from removals online. It’s called ZeroNet, and it could completely change the way we fight the group online.\n\nZeroNet was created in 2015 as a way to get around Internet censorship. It does so by building what’s known as a “peer-to-peer” network. Typical websites on the Internet are hosted by a single server somewhere, but sites on ZeroNet are decentralized. ZeroNet websites can be created by installing the network’s software on an initial host computer. Then when visitors (or “seeders,” in peer-to-peer parlance) arrive that a site, if they also have ZeroNet downloaded, they host the website on their own computers. These seeders can remain anonymous if they connect to these sites via the Tor network, which encrypts traffic and hides where it’s coming from.\n\nIn other words, this host computer functions as the website’s main server, at least until other visitors who have also downloaded the software automatically become hosts themselves. At that point, there is no single host to remove the site, eliminating many of the vulnerabilities that come along with standard web hosting services such as GoDaddy. Thus, if a website on the network contains illegal material, authorities have no company to source the content to and have it removed. As ZeroNet says of any given site on its network: “It’s nowhere because it’s everywhere.”\n\nIt’s not hard to understand why the Islamic State, a group that applies any and all applicable technologies to its propaganda machine, would gravitate toward such a network. Indeed, in September 2016, the Islamic State-linked “Cyber Caliphate” hacking group announced a ZeroNet website, boldly characterizing it as a way to counteract removals on social media sites:\n\n“This is our arena which we will never relinquish no matter what you do. . . . [You] wanted an electronic war and here we are. Your stupid policies on the social media sites will not deter us, and we will educate you what the word terrorism means.”\n\nAlso setting up camp on ZeroNet was Ansar Al-Khilafah (Supporters of the Caliphate), a prominent site for English-language Islamic State media and tech guides to help Islamic State supporters remain anonymous online. An August 2016 post by Ansar Al-Khilafah promoted its new “ZeroNet Edition” as “a permanent backup” and instructed supporters to bookmark it as such.\n\nThe Islamic State-supporting operative behind Ansar al-Khilafah’s ZeroNet edition, a 35-year-old from Cardiff, Britain, named Samata Ullah, was arrested by British authorities in 2017.\n\nDespite these examples, ZeroNet did not become a major component of the terrorist organization’s media machine. The success of the group’s propaganda machine in recent years has been the element of ease: just click a link and view. ZeroNet, despite its advantages, still required the extra step of downloading the ZeroNet program. Not an epic chore in itself, but a hiccup in the propaganda ingestion process.\n\nUntil now. Using proxy servers, third-party developers have recently begun offering alternative ways to access the ZeroNet network without having to download the software. Now, users — including Islamic State supporters — can pass around ZeroNet links like they would any other Internet link.\n\nThis development was not lost on the Islamic State, and it wasn’t long until the group made its first foray into ZeroNet using one such proxy. Amaq News Agency, an official Islamic State news outlet that is often the first to report on the group’s attacks and responsibility, announced its account on the platform on Dec. 14.\n\nThe Islamic State’s public creation of this Amaq site on ZeroNet marks a significant step. To have an official media arm of the group, especially one that has struggled to stay afloat online, publicly promote its presence on ZeroNet was effectively a signal to its entire online community to follow it in turn.\n\nWhile we have yet to see how deeply and to what effect the group will continue employing ZeroNet, it is alarming how much potential this online network holds to transform the fight against terrorism. The online battles of recent years have revolved around the Islamic State’s constantly changing tactics of bypassing platforms’ security measures while governments, tech companies and third parties work to predict and counteract these adaptations. To varying degrees, the Islamic State has been at the mercy of whatever platform it sneaked onto.\n\nBut with ZeroNet, the group may hold at least one safe online bastion to get its message out. And it won’t be the only well-intentioned technology that the group exploits. Last month, the Islamic State also began promoting accounts on unsuspecting messenger applications — some purposed for businesses and others for video game enthusiasts.\n\nThis is another reminder that the Islamic State’s online propaganda machine remains among its high-priority weapons. Government counterterrorism units and tech companies must collaborate and stay on track of these latest strategies. There’s no kill-switch for such a threat online — only reciprocal tenacity and the ability to adapt.\n\nhttps://www.washingtonpost.com/opinions/the-islamic-state-might-have-found-the-perfect-propaganda-machine/2019/01/28/0d31f7ec-2036-11e9-8e21-59a09ff1e2a1_story.html?noredirect=on&utm_term=.8205e1ee04d7",
			"added": 1548825107
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}