{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "That doesnt work for my personal Blog... only for ZeroSites of the boorkmarks",
			"post_id": 68,
			"date_added": 1461497955
		},
		{
			"comment_id": 2,
			"body": "Now, I understood your post @erkan... :-D very usefull, but you have to use this (profile-) browser only for ZN... ",
			"post_id": 60,
			"date_added": 1461513818
		},
		{
			"comment_id": 3,
			"body": "Hi, I want to clone and customize a zerosite (like zerotalk), but I have a lot of pronlems to customize it.\n\nDo you have any idea, where is/would be a guide to do it? On Gihup I didnt find documentation about customization of Zerotalk-GUI... I am not programer, but I understand a litle bit.",
			"post_id": 67,
			"date_added": 1461917802
		},
		{
			"comment_id": 4,
			"body": "1) ZN is JavaScript, Twister NO\n2) ZN and Twister have different idea/objectives\n3) ZN needs more, more, more and very hungry of space, Twsiter NO\n4) Twister has jet a Android client, ZN no\n5) ZN works on Tor, BUT JavaScript does security, privacy and anonimity broken\n6) In ZN, zeroID does a similar work like JavaScript... Twister you dont have it\n7) You has a lot of very good thinks on ZN, BUT the most of them arent usefull for \"normal\" people\n8) ZN doesnt offers very much the new users.... Twister works very like to Twitter\n9) Twister-code is more mature than ZN...\n10) Twister is multi-ID-user, ZN no\n\n**_I think, both social-projects are very good... and it is very awful to see, that people wants every time to compare... all new projects to help againt and avoid the control of the NSA & Co. are wellcome._**",
			"post_id": 2,
			"date_added": 1461957729
		},
		{
			"comment_id": 5,
			"body": "While _IPFS doesnt have support for Tor (or better I2P)_ I dont will user it!\nThat is for me, Argument enought.",
			"post_id": 71,
			"date_added": 1461958119
		},
		{
			"comment_id": 6,
			"body": "> [redacted](#comment_11_1QQggeZo72jptq7AvVQbrQKXZetKzF5kj):\n> @anoni2p Twister has tons of JS, what do you mean? You mean JS from other users, not just the app?\n> [erkan](#comment_137_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): \n1) aren't all web-UIs for twister in JS also?Twister itself is in C(++), ZN is in python\n\nSorry, I expressed me wronght. Twister & ZN have a lot of JS, BUT twister works on my Firefox and ZN doesnt work with deactivated JS.\n",
			"post_id": 2,
			"date_added": 1462026703
		},
		{
			"comment_id": 7,
			"body": "> [oracle](#comment_1_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP): Does i2p, freenet or IPFS have a blog with an admin panel for non-coders like myself?\n\nFor I2P and Freenet, you has Thingamablog ;)",
			"post_id": 71,
			"date_added": 1474960766
		},
		{
			"comment_id": 8,
			"body": "darkblog.bit tambien admite id@ZeroVerse :)",
			"post_id": 19,
			"date_added": 1486281318
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}