{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1589810453,
			"title": "Аудиопередача «Три Трека»",
			"body": "Сделал зеркало сайта музыкальной аудиопередачи «Три Трека» про малоизвестных исполнителей. На зайте можно послушать существующие выпуски программы.\nВ эфир выходит каждую среду, в 20:00 по Московскому времени, на радио anon.fm.\n\n[Три Трека](/1FoCPFzkjmcpdCXrbN9CXqXwkRYDSBeAqv/)",
			"added": 1589810452
		}
	],
	"topic_vote": {},
	"next_comment_id": 28,
	"comment": {
		"1_12gkvzRiZk99ZSaaCWFkBEXaefBzhz75vJ": [
			{
				"comment_id": 1,
				"body": "Возможно, вы имели ввиду Zeronet и IPFS?\n\nIPFS нацелен скорее на предоставление хранилища и транспорта для файлов. На данный момент, это аналог BitTorrent с доступом через HTTP, с помощью него можно раздавать файлы и статические сайты, но какие-то серьезные функциональные возможности он не предоставляет (но работы над этим ведутся, в частности, над pubsub, ipfs-js). На данный момент, с помощью IPFS нельзя сделать распределенную систему комментариев, Wiki или другой динамический сайт. IPFS можно использовать не через веб-браузер.\n\nZeroNet же нацелен на динамические веб-сайты, из-за чего работает только из браузера и требует Javascript. ZeroNet предоставляет доступ к базе данных и стандартизует разделение на данные (контент сайта) и код сайта, из-за чего, в принципе, можно делать сторонние программы для конкретных движков, не прибегая к парсингу сайта.\n\nI2P — анонимная оверлейная сеть в виде UDP и TCP-транспорта. I2P можно использовать для всего, для чего используют обычные сети: веб (хостинг сайтов и доступ к ним), передача пакетов (прокси, VPN), не-веб-приложения (IP-телефония, вещание видео). Она не предоставляет каких-то дополнительных функций для веба. В ней хостятся обычные сайты, такие же, как в интернете, и используют такие же технологии. Она не распределенная: если сервер, на котором находится сервис, выключить, то он перестанет быть доступен.",
				"added": 1552739782
			}
		],
		"1_1e2mHauMGG8GgSDvaaPrNanxvaxwpGQRV": [
			{
				"comment_id": 2,
				"body": "Да, шифрует, с помощью своего собственного протокола, обёрнутого в TLS.",
				"added": 1552766136
			}
		],
		"1_1KDowLVWPX3uVoksFQ1e9Pw1ZA6xcLTfSX": [
			{
				"comment_id": 3,
				"body": "В ZeroNet используется шифрование транзитного трафика на основе TLS, с TLS-сертификатами, которые автоматически генерируются при каждом запуске. Сами сертификаты не проверяются (доверие всем сертификатам).\n\n>при размещении контента я де факто палю свой IP и помочь с этим могут только прокси, VPN и Торы-хуёры?\n\nВерно.",
				"added": 1552931678
			}
		],
		"2_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP": [
			{
				"comment_id": 4,
				"body": "> [fuckthepolice](#comment_4_1FRx7BoFqFAbwqRbQzHPy4gqVDT4aezhtP): У тебя паранойя, готов поспорить, ты даже не открывал эти ссылки\n\nКак их открыть, если они требуют Telegram?",
				"added": 1553069814
			}
		],
		"4_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 5,
				"body": "data/users.json",
				"added": 1553419859
			}
		],
		"1_1DjCUmkQqfrh4PZueVGAdMS1f4EmUAc3yJ": [
			{
				"comment_id": 6,
				"body": "> [gitcenter](#comment_5_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Конкретно с этой репой бага, которую непонятно как исправить.\n> Решается так:\n> mkdir /home/user/ZeroBundle/ZeroNet/data/1KVD7PxZVke1iq4DKb4LNwuiHS4UzEAdAv/silent-uefiinsecureboot-disk.git/refs\n> git clone /home/user/ZeroBundle/ZeroNet/data/1KVD7PxZVke1iq4DKb4LNwuiHS4UzEAdAv/silent-uefiinsecureboot-disk.git\n> Смысл в том, что ZeroNet игнорирует пустые папки, и это до сих пор ни на что не влияло, а вот git'у обязательно нужна папка refs. В этом репозитории все refы лежат в файле packed-refs, поэтому директории refs нет.\n\nВидимо, проблема проявляется только на старых версиях git. В Fedora 29 с `git version 2.20.1` работает, но на Debian 9 `git version 2.11.0` — нет.\nВообще, это самый обычный bare-репозиторий с packed-refs, который я создал с помощью `git clone --bare`. В репозитории нет ничего странного или необычного, я не редактировал его вручную. У меня он работает как через веб-интерфейс Git Center, так и через git, и успешно клонируется, проверил на свежеустановленном ZeroNet.\n\nПересоздал репозиторий, вручную добавив refs и удалив packet-refs.",
				"added": 1555653639
			}
		],
		"3_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 7,
				"body": "Total XYNTA.",
				"added": 1555769000
			}
		],
		"1_19sZ5x78VtERtZ3M6znWdbJoLdJYg152Hu": [
			{
				"comment_id": 8,
				"body": "Скорее всего, всё будет работать. Телефония использует обычные TCP/UDP-соединения.",
				"added": 1555889841
			}
		],
		"1_17pyCvFSCXyYUiEid8Wa1dmchWa1Cr7AcK": [
			{
				"comment_id": 9,
				"body": "Украинцы [там](/193psz3yGj7EH39nyKb4A2KKBXEHT49Csf)",
				"added": 1556205354
			}
		],
		"1_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 10,
				"body": "Проще всего популяризировать сеть на реальных примерах использования. Следует написать статьи, в которых рассказать о возможностях сети, и о том, как её использовать обычным людям, как можно её применять веб-мастерам для существующих сайтов, зачем это нужно, в чем преимущество.",
				"added": 1556312956
			}
		],
		"2_1AefSRYaJKZg4XhSbQJs2GtNA4cur8h1Qp": [
			{
				"comment_id": 11,
				"body": "Протокол шифрования чего? Данных? Трафика? Сообщений?",
				"added": 1557108603
			}
		],
		"2_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 12,
				"body": "Если ещё проще: хаб — источник информации для сайта, его использующего. Сайт может объединять несколько источников информации, и отображать их в едином интерфейсе.\nПредставьте, что сайт, использующий хабы — новостной агрегатор, а хабы — СМИ, публикующие новости.",
				"added": 1557265842
			},
			{
				"comment_id": 17,
				"body": "> [ozago](#comment_6_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8): А как файлы со своего ПК раздавать можно в зеронете??? И где их искать если что-то нужно??\n\nМожно либо создать сайт с файлами, либо загрузить их на [ZeroUpload](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/) или [IFS](/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/)",
				"added": 1557611546
			}
		],
		"1_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 13,
				"body": "[Important Zites NEW](/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/)",
				"added": 1557265965
			}
		],
		"1_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8": [
			{
				"comment_id": 14,
				"body": "[/1Jtjb5CU9aod4jtz8hF5NPPqFKofRSsb4x/](/1Jtjb5CU9aod4jtz8hF5NPPqFKofRSsb4x/)",
				"added": 1557524196
			},
			{
				"comment_id": 19,
				"body": "> [ozago](#comment_7_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8): Получается , прежде чем залить сайт в Zeronet , нужно отключить регистрацию с белой почты? А восстановление пароля как происходить будет?\n\nО чём речь? Где отключить, какую регистрацию? В ZeroID восстановление пароля при обычной регистрации не предусмотрено, если вы об этом. Но он и почту не использует, только BitMessage, опционально.",
				"added": 1558038427
			}
		],
		"1_1PmTT7rXXV3k1cEr4ecFR3DPEbR2biHbuj": [
			{
				"comment_id": 15,
				"body": "Включите Tor, ничего не качается.",
				"added": 1557573909
			},
			{
				"comment_id": 16,
				"body": "> [ruslan777c](#comment_4_1PmTT7rXXV3k1cEr4ecFR3DPEbR2biHbuj): Переделал качается на форми можно публиковать файлы и фото http://127.0.0.1:43110/17JNqUXGB5s6kzjXH6ipYLhohnYuksQTsk/?Home\n\nУ меня всё равно не могут синхронизироваться 4 файла.",
				"added": 1557579663
			}
		],
		"1_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7": [
			{
				"comment_id": 18,
				"body": "Можно использовать поиск непосредственно с главной страницы ZeroNet (ZeroHello). \"Search in connected sites\".",
				"added": 1558038348
			}
		],
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": [
			{
				"comment_id": 20,
				"body": "Для эффективной работы любой P2P-сети и распространения контента в ней, каждый клиент в сети должен иметь возможность подключаться к другим клиентам сети. Если у вас «серый» (не «белый», не «реальный») IP-адрес или «закрытый» порт, клиенты не могут к вам подключиться, но вы можете подключаться к другим клиентам. Это снижает эффективность распространения контента: ZeroNet всё ещё будет корректно работать, но могут быть проблемы, например, с раздачей файлов в ZeroUp.\n\nЕсли вы родились в 80-х, вы должны были застать звонки через коммутатора. Представьте, что ваш компьютер находится за коммутатором, и не имеет прямого номера телефона: вы можете звонить на прямые номера телефонов любому человеку, но вам обратно, с определившегося номера телефона, дозвониться без дополнительных действий не могут.",
				"added": 1559355548
			},
			{
				"comment_id": 21,
				"body": "> [anamvyo](#comment_1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2): Так что мне делать в этой ситуации?\n\nНужно узнать у провайдера, предоставляет ли он вам «белый» IP-адрес, и если предоставляет, открыть порт на маршрутизаторе, и убедиться, что он не заблокирован межсетевым экраном на компьютере.\nZeroNet, вообще говоря, сам умеет открывать порт, так что, вероятно, ваш провайдер не предоставляет «белый» адрес.",
				"added": 1559379609
			}
		],
		"1589810453_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": [
			{
				"comment_id": 22,
				"body": "Вчера вышла новая передача.\n\nКлип Yves Tumor, о котором говорится: [Gospel For A New Century](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq/Yves%20Tumor%20-%20Gospel%20For%20A%20New%20Century%20%28Official%20Video%29-G-9QCsH3OQM.mp4)",
				"added": 1590066600
			},
			{
				"comment_id": 26,
				"body": "Уже 6 выпусков.",
				"added": 1593019265
			},
			{
				"comment_id": 27,
				"body": "Вчера вышел 12 выпуск.",
				"added": 1597299376
			}
		],
		"1591036220_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 23,
				"body": "Да, вроде, практически любой такое позволяет: WhatsApp, Viber, Telegram, Conversations. Интересует что-то конкретное?",
				"added": 1591145512
			},
			{
				"comment_id": 24,
				"body": "> [cra](#comment_131_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv): А Conversations разве умеет в голосовые сообщения?\n\nНе только голосовые сообщения, но и с недавнего времени и полноценные звонки.",
				"added": 1591820425
			}
		],
		"1592930911_1PdBGXhry7hTnACiz3LR9vPzFYoMa356kC": [
			{
				"comment_id": 25,
				"body": "https://reddit.com/r/netsec/",
				"added": 1593017870
			}
		]
	},
	"comment_vote": {
		"1_1LxaUgzJJJcWkh9xCnW2Mmh2LwKiiZoffo": 1
	}
}