{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1564689117,
			"title": "puri.sm (clearnet) Librem One",
			"body": "I'm interested to hear about your experiences with this service, PureOS, Librem Computers, and upcoming Librem 5 phone. At a glance it looks pretty decent, a refreshing departure from centralized data vacuuming corporate interests.",
			"added": 1564689116
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1564106401_1EsM7XQ7MNtL2M8e823PoNiZMy2SBmWKHi": [
			{
				"comment_id": 1,
				"body": "Does anyone know why human skin color differs in such significant ways? I'll offer an evolutionary rationale for the difference. The occurrence of skin cancer isn't a good evolutionary reason for white people and black people...let us go back to the beginning when our brains were smaller and our knuckles were closer to the ground. Black people are black because of high concentrations of melanin positioned above the cytoplasm and nucleus of skin cells. This compound effectively shades the DNA in the nucleus from the mutating effects of ultraviolet radiation lowering the rate of mutation in somatic (body) cell replication. It also shades the blood in the capillaries from UV, and it turns out that UV destroys folic acid in exposed blood, lowering the overall concentration of vitamin B-9. Low levels of vitamin B-9 substantially decrease the success rate of pregnancy. In short, people who live in equatorial land masses have much higher exposure to UV, and melanin protected blood provides a reproductive advantage. So why would people be white? Vitamin D is produced in the skin cells using a mechanism that relies on high energy photons (UV) interacting with various compounds in the skin cells. A sunscreen of 30 or above lowers production of vitamin D by 95%. Rickets is a syndrome that will kill you well before reproductive age resulting from insufficient levels of vitamin D. Therefore, white skin is a survival advantage in latitudes where UV radiation is much weaker. When black people live in far northern and southern latitudes, they need to take vitamin D supplements to avoid rickets. Now let us bring it all together. People who live at extreme latitudes having a diet rich in vitamin D (liver, fatty meats) have dark skin. Having sufficient dietary vitamin D means that melanin protected blood and higher folic acid concentrations become the primary selective force in their phenotype. This means that skin color is simply an adaptation increasing fitness in specific global climate conditions. Nothing more. Saying that white people are more or less intelligent because of their skin color is like saying people are more or less intelligent because they are tall, or they have brown eyes. This type of thinking blatantly reveals the person expressing it as either uneducated or promoting some agenda in spite of strong evidence to the contrary.",
				"added": 1564672657
			},
			{
				"comment_id": 3,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_516_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Does anyone know why human skin color differs in such significant ways?\"Not just the colour of the skin, the average length of the bones, the shape of the skull, etc.There is not a single human species, but many biological species. That is why inter-species pregnancies are difficult and 'you need to force them'.\n\nI disagree. Inter-species pregnancies are impossible. Homo sapiens sapiens is a species with phenotype variation. One species. I could let a chimpanzee copulate with me all day every day and have no risk of pregnancy.",
				"added": 1564679263
			}
		],
		"1564584559_1FvUoTBvkBv4vgfpxGLEu4ggPJje422K1y": [
			{
				"comment_id": 2,
				"body": "I suggest this approach to supporting the uncensored internet with Zeronet. \n1.Run a good VPN on your host machine. \n2. Use Veracrypt to create an encrypted drive with a 64 character password.\n3. Run Whonix however your host machine will allow you to do it on the encrypted drive. Run a second VPN in the workstation and do not modify the gateway. \n4. Install Zeronet and enjoy.\n\nThis routes your traffic in this way: VPN 2 encrypts the data stream to Tor. Neither Tor or VPN 2 can discern content because they each use encryption. VPN 1 encrypts the Tor traffic through your ISP. Malicious software is limited to the workstation by the gateway. Vulnerabilities include a compromised host, and CPU backdoors, but in general this is a safe way to support Zeronet with low personal liability for content. Whonix allows you to encrypt each VM independently as well, adding an additional 64 character password for both the gateway and workstation. Please contribute financially to each project you choose to utilize as these developers rely on donations to advance these technologies.",
				"added": 1564674290
			}
		],
		"1564655403_1EhJMLVMZUfhiFBYi9pkjzoaFzBNeauUxR": [
			{
				"comment_id": 4,
				"body": "Share your bandwidth. Enable the wifi hotspot on your phone and set the password as password or no password if you can. Likely you have an unlimited plan anyway and the brief contact you have with the people around you will cost an insignificant amount of money and data. Imagine the headache it would cause centralization if IP addresses couln't be correlated to an individual. Sharing will also enable mesh routing. Envision home and mobile routers acting as relays.",
				"added": 1564682215
			}
		],
		"1564523508_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 5,
				"body": "I would avoid the clouds. Even if you encrypt it thoroughly you are offering the opportunity for any powerful interested party to clone the data and examine it. Probably nobody is interested in your data, but a healthy security skepticism is good. So who is going to create the encrypted, distributed, compressed, user data backup zite? Post the address here!",
				"added": 1564689528
			},
			{
				"comment_id": 6,
				"body": "I think Kim Dotcom is still involved under the Hong Kong shell company, but if he isn't I wouldn't trust Mega's encryption alone. Add your own initially, then upload if you have to use a cloud service. SpiderOak is an option too. Client-side encryption and a zero knowledge framework.",
				"added": 1564689714
			},
			{
				"comment_id": 11,
				"body": "> [moor](#comment_169_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): he posted somewhere some years ago that he didn't have control on MEGA anymore and that people shouldn't use it. something like that.\n\nI'm not sure what he said wasn't forced by the US government. They raided his NZ property and separating himself from MEGA and placing it in HK where the US can't raid it without starting an international incident with China was a smart move. I know the guy lost everything, wife, family, and a large portion of his wealth but he is a brilliant guy. I think he'll resurface in the crypto world stronger than ever. Bitcache, K.im, and mesh routing are his new sweethearts. Just wait and see. He isn't done with the US by a long shot. He is an unsung hero of our time.",
				"added": 1564772337
			}
		],
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "Please do start your own site. I'll support it, also thank you for all those high quality movies. I'm peer supporting you on those as well. Good work!",
				"added": 1564704964
			},
			{
				"comment_id": 8,
				"body": "While we're on this tracker topic, would someone provide detailed instructions for running a tracker please? I would be happy to do so but haven't stumbled upon the documentation. Thank you.",
				"added": 1564705174
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_801_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Do you have an open port forwarded to your device? If so, in ZeroNet's plugin folder is disabled-Bootstrapper [...]\n\nYes indeed. I'll do that. Thank you.",
				"added": 1564766760
			},
			{
				"comment_id": 10,
				"body": "Are there also TCP trackers? It seems like UDP is impractical in a Tor dependent environment.",
				"added": 1564768296
			}
		]
	},
	"comment_vote": {
		"795_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"165_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"521_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}