{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1566014746_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": 1,
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": 1,
		"1566051166_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": 1,
		"1565907500_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": 1
	},
	"next_comment_id": 25,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Testing new zeroid",
				"added": 1565398144
			}
		],
		"1565346520_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 2,
				"body": "> [vont](#comment_1_1QCsDvKVMzq4PnuZc41JF5GgWwWkKCemzL): Better to upload something that's not heavily censored and manipulated like Infogalactic, or start a new one...\n\nI think the idea would be to use it as a starting point. Over time the community can scrap obvious points of censorship & post alternate interpretations. Still need some kind of quality control process so it doesn't turn into a total circlejerk, but some form of voting system could help offset that.",
				"added": 1565398312
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 3,
				"body": "Go free? You mean, remain loose and exposed after legions of autists already started gearing up for war & are itching for targets? You have a funny definition of \"free\".\n\nReminder: This isn't the only occasion that elites have been caught out participating in something like this: https://en.wikipedia.org/wiki/Westminster_paedophile_dossier\n\nHow anyone can STILL defend \"Democracy\" or think a peaceful solution to all this is possible is just amazing to me.",
				"added": 1565510584
			},
			{
				"comment_id": 4,
				"body": "> [bigbadbob](#comment_180_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): You gonna lead the charge?\n\nNo officer, I'm totally not making a specific & credible threat at all lmao. I'm simply pointing out causality - action & reaction are inevitable, and this should be obvious to any student of history. Look at Walter Lubke in Germany, or the Gambino boss getting shot by the Q fan, innumerable other little incidents recently. Anyone making such a specific claim as far as their own personal actions go would be extremely foolish on any public forum, not to mention that people pulling the Internet Tough Guy thing are pathetic.\n\nBut it's a fact that it's a dangerous & unpredictable world out there, filled with a LOT of people that've reached the end of their rope to the point where death or imprisonment are ceasing to be serious disincentives to action. Hell, just look at the suicide rate - imagine if say, 5% of those decided to make their exit count for a bit more. \n\nTotally avoidable of course, considering that if the cops/feds actually just did their damn jobs and arrested these people we wouldn't need to have such conversations. But it's evident at this point that it's not gonna happen - ergo, only a matter of time now. The only things keeping the shitshow together is bread and circuses. I'm betting on around 2025 for the REAL fireworks personally, with a steady ramp-up of intermittent actions in the meantime - the effects of continued degradation of the global economy & innumerable more overt slaps in the face to make \"muh comfortable paycheck\" stop being enough of a reason to NOT just simply go clean house.",
				"added": 1565516386
			},
			{
				"comment_id": 5,
				"body": "> [manifesto](#comment_8_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT): Clinton Clinton Clinton\n\nNot just the Dems though. There's no shortage of Republicans named as well. NOT Trump fortunately, not in any convincing fashion - in fact the courtroom testimony clears him. The RINO crowd need to burn along with Bill & Hillary as well. Plus the various executives & celebs named as well.",
				"added": 1565516728
			},
			{
				"comment_id": 6,
				"body": "> [bigbadbob](#comment_153_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): There is a possibility he did suicide and was giving the option.   I have no doubts his life was fact beyond repair.\n\nWhat, and it's just a \"coincidence\" that the camera stopped at the same time? That nobody checked in on him? Yeah, it's \"possible\" - but it's just too many coincidences to be likely, especially after everything else that's happened. If he DID suicide, it was via people handing him the rope, tying it off and giving him now choice in the matter - ie, not really a suicide in that sense at all.",
				"added": 1565517019
			},
			{
				"comment_id": 7,
				"body": "> [eightyfour](#comment_117_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): Someone posted he killed himself \"by hanging and cardiac arrest\" on 4ch before it got into the news. [...]\n\nYep, I have the screenshot of it.",
				"added": 1565517096
			},
			{
				"comment_id": 8,
				"body": "> [memesadler](#comment_13_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I don't think this is just \"NOTHER CLINTON BODYCOUNT\", but mostly because Epstein had many connections all over and likely a lot of paranoid politicians. The camera malfunction is especially dumb to say and only makes the story sound fishier. \"Oops, Epstein hung himself when his 1 on 1 watcher went to the bathroom and his camera malfunctioned, woopsidaisy.\"He was either smugged to Israel to live the rest of his days, or sacrificed to try shoveling mud on the fire. Maybe he was \"allowed to kill himself\" but I would factor that under the latter.\n\nI dunno about the body double & putting him into retirement in Israel or something - haven't seen any evidence that's particularly convincing, but then this whole thing is such a shitshow that I wouldn't be at all shocked.",
				"added": 1565517448
			},
			{
				"comment_id": 9,
				"body": "> [toxictootsie](#comment_1_15xDkfTojXrEu5xip2XzRRFsFoCgU9yNDg): It will be a breaking story for a week or two. After that, the sheeple of the world will just be following the next breaking story. It's obviously a coverup, nothing will come of it though, 99% of the world's population are powerless to do anything about it. All we can do is point our finger in the air and vent our frustration online. That's it.\n\nNo, we can do more than that. We can ensure our own kin don't believe this garbage, don't watch their propaganda & we can prepare for what we all know is coming. Don't get too down friend, keep your chin up. Besides, the far-Left have latched onto it as well - so if you've got all sides outside of the idiot fence-sitters out for blood it'll keep it in public view for a while longer. Unless they false-flag something else in the next day or so of course.",
				"added": 1565517712
			}
		],
		"1566018895_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 10,
				"body": "I'd be interested in having a look at it. Busy with a LOT of other projects right now, but I agree - TOR isn't intended for P2P stuff. I'm also interested in how IPFS could be integrated to provide the DHT functionality for serving static assets. Obviously need to make sure that's all going over TOR/I2P as well. I'd kinda like a  I'm new to Zeronet though, would like to work through at least figuring out the basics first - I'm wanting to build a Bitchute-esque Webtorrent based video sharing service that can automatically mirror Youtube vids & start seeding them, just to get my head around how it all works together.",
				"added": 1566030517
			}
		],
		"1565995598_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 11,
				"body": ">He a good boi, he dindu nuthin.\nGood. It's not about the price, it's about someone feeling that they have the right to violate your rights & act as a parasite. If it's a beer, then why not a case? If you steal a case, why not hold up the store? Should he have shot him, as opposed to simply arresting him? Well, maybe the shop owner felt threatened, if the guy looked like a thug it's understandable. Maybe if the cops & society at large hadn't decided to utterly abandon the rule of law (because obviously, nothing would have been done) then we'd see less of this.",
				"added": 1566037273
			},
			{
				"comment_id": 12,
				"body": "> honestly I was expecting the right-wingers to go a different direction on this one.\nWhich direction were you expecting? Right-wingers tend to look down on criminals. Incidentally, that story is fucked up, but it sounds like they had a prior relationship. Why would they think he had money buried? That's pretty specific.",
				"added": 1566037591
			}
		],
		"1566014746_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 13,
				"body": "Why not just use Millchan itself? Seems fine to me, just disable auto image downloading.\n\nAnd as for the Fedposting - yeah, obviously a large chunk will be more Cointelpro shills trying to set up more low level shootings. Here's the thing though - with this Epstein thing now out in the open it's clear that pretty much the worst conspiracy theories are probably correct - the elites really ARE engaging in everything from child rape, sex slavery, organ harvesting, drug running & apparently they really are doing it in the name of Moloch, with full protection from the glowniggers. So do you honestly think anyone that say's \"I'm going to go kill them\" is REALLY overreacting? A lot of people really have given up on a political solution now, I highly doubt it's all shills, a lot of it looks like venting.",
				"added": 1566039496
			}
		],
		"1566020351_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 14,
				"body": "Ethereum tokens, preferably a totally decentralized stablecoin like DAI. No weird price variance & it'd be simple to add support for web3 & use zites for Ethereum dapps, meaning you could use smart contracts for escrow. I have no idea why you'd want to use Nano.",
				"added": 1566039942
			}
		],
		"1566038009_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 15,
				"body": "Yes. It's at https://www.fbi.gov",
				"added": 1566041022
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 16,
				"body": "Top tier b8! Well done, have a (You).",
				"added": 1566041603
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 17,
				"body": "> [styromaniac@kxoid.bit](#comment_115_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Judaism isn't a race.\n\nNot a race, yet they have a country that can use DNA testing to help confirm ancestry on return: https://lawoffice.org.il/en/aliyah-to-israel-by-dna-test/\n\nSo it's simultaneously a race (well, an ethnicity), a culture AND a religion. Hence why you can have people like Bill Maher, \"Atheist jews\".",
				"added": 1566042173
			},
			{
				"comment_id": 18,
				"body": "> [aspidochelone](#comment_88_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I don't think it's that simple.  There are some definite comic fascists, genuine fascists, and people I can't figure.\n\nWhy is it so hard to believe that people are genuine Facists or whatnot? Look at this crap with Epstein - do you seriously think voting and happy thoughts are going to root out that level of corruption in society, where the alphabet agencies will openly kill a guy & help cover up evidence because he can finger the elites participating in pedo & slavery rings? Fuck that, I can tell you right now that a lot of the \"I'm gonna kill those fuckers\" posts are genuine. Especially after the 8chan takedown, that's a slap in the face that can't be ignored. Escalation is fucking coming.\n\nWe now live in a world where millions of invaders pour over the border openly, and are greeted with social welfare paid for by people that are called racist for arguing with it (but the military threatens to shoot kids that charge at a base lmao). A society where children are brainwashed into chopping their genitals off in state-owned schools, and month-long parades celebrating butt-sex are thrown. Usury is used to sell the future out while suicides reach record numbers - but that's ok, we just need to medicate people even more! And even when people try a political solution, vote in an outsider like Trump, NOTHING changes - hell, the guy turns around and screws over his own voters with more gun laws & \"hate speech\" laws, while not building the wall & just keeping on with the Neocon/Neoliberal agenda of attacking more countries Israel hate - hate speech meaning anyone who isn't a Neoliberal cultist. \n\nSo no, it's not all a joke (not anymore, although most of us started out that way I guess), and I assure you it's not a damn bot posting all of it.\n\n> [peppermintswirl](#comment_10_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx): Ok faggot, bye. If you don't want a decentralized internet to be a thing then go back to your Neoliberal overlords where they constantly censor shit and doxx people if they dissent with their left-wing policies. A toxic, free internet will always be better than some shitty safe space where you have to tread on eggshells. Fuck you.\n\nThis.",
				"added": 1566043796
			},
			{
				"comment_id": 19,
				"body": "> [pseudonymity](#comment_57_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM): The majority are having a joke. It's a small minority that are actually real racists, that, in an act of irony, think there being taken seriously. In actuality, they are just another punchline in the act. Poetic really, when you think about it.\n\nSure, we're all just pretending lmao.",
				"added": 1566044130
			}
		],
		"1566086206_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 20,
				"body": "Heh, good old Kermit. Someone should make him read Mein Kampf & \"leak\" it to some Leftist media for lulz.\n\nDeepfakes are game changing. Imagine the chaos when the first Deepfake scandal breaks publicly and the average person is forced to exist in a kind of post-truth Gnostic state where all media narratives are now untrusted.  \n\nVideo deepfakes still aren't perfect yet, getting there though. That's when the real fun's gonna start.",
				"added": 1566088417
			}
		],
		"1566012765_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 21,
				"body": "Imagine Fedposting this hard. Pedo's get the rope regardless.",
				"added": 1566092991
			}
		],
		"1565764347_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 22,
				"body": "No, but I'm experimenting with using Vue. Agreed though, any SPA framework should work IMO. You can import ZeroFrame.js like any other lib (It's actually up on NPM I think), and it should be fine.",
				"added": 1566093308
			}
		],
		"1566051166_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 23,
				"body": "Why aren't you using the Millchan zite itself? http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\nIt's slow, but seems fine to me. I agree, 08chan is a shitshow right now.",
				"added": 1566093497
			},
			{
				"comment_id": 24,
				"body": "> [12345679](#comment_16_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): Please enter a mental health facility; you aren't that important. IF the feds wanted you they'd have done it.\n\n>Don't use Opsec goy, Feds are omnipotent and omniscient, that's why crime doesn't exist.\n\nGlow harder lmfao.",
				"added": 1566093561
			}
		]
	},
	"comment_vote": {
		"8_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT": 1,
		"7_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT": 1,
		"32_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"13_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"2_14ZZDCbrWsetVv3dVGUjKk6f274tvvHQDx": 1,
		"991_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"20_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"160_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"12_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"126_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"2_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": 1,
		"1040_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}