{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1578161735,
			"title": "Searching for \"Silicon Valley\" episodes.",
			"body": "Hi all,\n\nSharing is loving. I'm searching for some episodes of Silicon Valley.\n\nIn English: Seasons 1 and 2 in 1080p.\n\nIn French: All seasons, no matter the resolution.\n\nFor those who are interested, I have all the seasons in English, but only seasons 3 to 5 in 1080p. Seasons 1 and 2 in 720p.\n\nSharing possible via either/or:\n- Torrent file or magnet link,\n- OnionShare,\n- ZeroUp unlimited: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/\n\nHappy new 2020 year.",
			"added": 1578161734
		},
		{
			"topic_id": 1578223165,
			"title": "Searching for \"Silicon Valley\" episodes.",
			"body": "Hi all,\n\nSharing is loving. I'm searching for some episodes of Silicon Valley.\n\nIn english: Seasons 1 and 2 in 1080p.\n\nIn french: All seasons, no matter the resolution.\n\nFor those who are interested, I have all the seasons in english, but only seasons 3 to 5 in 1080p. Seasons 1 and 2 in 720p.\n\nSharing possible via either/or:\n- Torrent file or magnet link,\n- OnionShare,\n- ZeroUp unlimited: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/\n\nHappy new 2020 year.",
			"added": 1578223163
		},
		{
			"topic_id": 1578338323,
			"title": "Searching for \"Silicon Valley\" episodes.",
			"body": "Hi all,\n\nSharing is loving. I'm searching for some episodes of Silicon Valley.\n\nIn english: Seasons 1 and 2 in 1080p.\n\nIn french: All seasons, no matter the resolution.\n\nFor those who are interested, I have all the seasons in english, but only seasons 3 to 5 in 1080p. Seasons 1 and 2 in 720p.\n\nSharing possible via either/or:\n- Torrent file or magnet link,\n- OnionShare,\n- ZeroUp unlimited: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/\n\nHappy new 2020 year.",
			"added": 1578338320
		},
		{
			"topic_id": 1601724367,
			"title": "Police-Capture taken down Paolo Cendri threatened by Gerald Darmanin",
			"body": "Paolo Cendri had to take down his website after being threaten by the french minister himself of pseudo-legal action: https://www.en24news.com/2020/10/threatened-with-prosecution-by-darmanin-an-artist-removes-photos-of-police-officers-from-his-site.html\nHow shall we retaliate?",
			"added": 1601724363
		},
		{
			"topic_id": 1604310069,
			"title": "Play vs Play+",
			"body": "What are the differences between these two zites?",
			"added": 1604310064
		},
		{
			"topic_id": 1604790440,
			"title": "Searching for TV series \"How to sell drugs online fast\".",
			"body": "In English or French. I found it in German only. NZB or Torrent. Thanks for sharing.",
			"added": 1604790434
		},
		{
			"topic_id": 1609246965,
			"title": "Ledger Hack",
			"body": "Anyone has the databases?",
			"added": 1609246958
		},
		{
			"topic_id": 1611330261,
			"title": "Encrypted Apps in Australia?",
			"body": "Any Australian here to tell us how you can use apps such as Wire, Wickr, Signal and so on in Australia? Should we assume they have backdoors if you can download them from the Australian App Store or Google Play?",
			"added": 1611330253
		},
		{
			"topic_id": 1611693126,
			"title": "Scenario for threat model.",
			"body": "Hi all,\n\nI would appreciate your constructive feedback on a scenario for a threat model. The aim is to test communication apps. But there are so many of them available, that it’s difficult to weed out which ones shall be used and which ones shall be avoided. So to decide on the specifications sheet, it’s easier to have a not-so-fictitious scenario that is used to benchmark the features of the app, what we’re looking for and also to help prioritise features by order of importance. This app would be used in a business environment, so users are not necessarily supposed to be geeks. And it’s not used to send messages to girlfriends/boyfriends either, it can have devastating implications if communication is falling in the wrong hands. So we need to find an app that ticks the OpSec boxes for real life use in a complicated environment. The aim of having a scenario is to help make discussions more down to earth, instead of ending up with the one shouting the louder winning the argument.\n\nThis thread is not about getting opinions on apps or devices to use. This thread is only about deciding on a scenario. Then, and only once we have a consensus on a relevant scenario, can we start reviewing apps and devices, one at a time. And these reviews would be made according to the scenario, not according to each and any specific case of the reviewer (that's you and me). So basically, this scenario is a way to structure the review and not make it personal.\n\nSo here is the scenario:\n\nWe are a news agency, such as \"The Guardian\". Our team of journalists were investigating international drug cartels, when they realise corruption was occurring as deep as prosecutors, law enforcement and customs clearance officers, the military and many administrative clerks. They realise corruption was also happening in self proclaimed \"democracies\" and self proclaimed \"developed countries\" such as France, the UK or the US.\n\nOur journalists knew for a fact that they could be arrested and jailed, indefinitely, without any charges whatsoever. They knew for a fact that their homes could be invaded, their property stolen, their family harassed or physically harmed, without any possibility of using the law to defend themselves.\nThey knew for a fact that surveillance tools would be used against them, their collaborators, their sources, their families.\n\nSo the news agency decided to be proactive in protecting its journalists and sources. Instead of the naive \"if I have nothing to hide then I have nothing to fear\", or sometimes \"if I'm not doing anything illegal then I have nothing to fear\" which is constantly proving to be a false and dangerous approach, the news agency decided to protect all communications and data, at all time, no matter their perceived importance. And to protect all the people they were in contact with, including families, suppliers, contractors, sources and so on.\n\nBecause the threat was not about what they were actually doing, or with whom. The threat when dealing with state-sponsored criminals is: what kind of false and baseless accusations can they invent in order to cause harm to the organisation, under the colour of law.\n\nIn this scenario, if you replace \"drug cartels\" with \"political parties\" or \"surveillance agencies\" or \"weapon dealers\" or \"pharmaceutical companies\" or \"crude oil company\" you'll see that the threat remains the same.\n\nState-sponsored criminals can harm individuals, businesses, non-profit organisations, for no other reason than to satisfy their urge of domination and social status. And to mimic what they see on television with all their electronic devices and firearms. They get their kick of dopamine by destroying lives and projects. They are out of control, without any real supervision, there is no such thing as check and balance when it comes to state-sponsored criminals.\n\nOne could end up fighting the justice system for years, spending its entire income, just to dismiss false and baseless accusations from a brain dead police officer or a sadistic prosecutor.\n\nWe live in a world where those who are doing nothing wrong but just want to live a peaceful life and run a successful business must protect themselves against the most evil form of criminality.\n\nOpSec is not backward compatible. You protect yourself from state-sponsored criminals before they can even come to know about you and your business.",
			"added": 1611693117
		},
		{
			"topic_id": 1612011009,
			"title": "Reminder: ZeroMail & ZeroMe.",
			"body": "Hi,\nJust a quick shout-out to people on ZeroNet. Please activate at least your ZeroMail account and possibly your ZeroMe too.\nWhen you are contributing to a thread, it helps fellow ZeroNet users to get in touch directly with you.\nCheers,",
			"added": 1612010999
		}
	],
	"topic_vote": {
		"1601801657_1JSiiS2nVVHx65snyUci3MJhnB2e1jPVZy": 1,
		"1602091740_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": 1,
		"1611680008_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"1561820909_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1
	},
	"next_comment_id": 57,
	"comment": {
		"1578338323_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 1,
				"body": "> [robione](#comment_379_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): why aren't you responding to messages? [...]\n\nHi ribione,\n\nIs it me or you are being aggressive here?\n\n1-I am responding to messages. See. Did you send me a ZeroMail or something?\n2-I looked on Torrent sites but apparently no one is seeding any more, so if someone in the Zeronet community has these files, it would be nice to create a torrent and share. Or share the file on ZeroUp directly.\n3-Who are you to decide that my message is a spam?\n\nCheers,",
				"added": 1578379418
			},
			{
				"comment_id": 3,
				"body": "> [robione](#comment_381_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Check your ZeroMail [...]\n\nHi robione,\n\n1-I don't have any email from you, sorry, maybe send it again.\n2-I'm using Skytorrent.lol and BiglyBT to search for torrents. Couldn't find Sillicon Valley in 1080p. But as you seem so clever and helpful, what about you just post the magnet links here, that what my post is about.\n3-What are you talking about. There is only one post on this thread.\n\nI'm using Zeronet since day one (almost), we used to have polite and helpful people there, I guess things had to get that way with more people from anywhere. Shame.",
				"added": 1578422221
			},
			{
				"comment_id": 4,
				"body": "> [robione](#comment_382_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Perhaps you forgot about this one:http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1578223165_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT\n\nNo I didn't \"forget\", I just didn't see it. I thought the message didn't publish because I had connection errors.",
				"added": 1578475054
			},
			{
				"comment_id": 5,
				"body": "> [robione](#comment_383_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): It retried & succeeded. Resilience. [...]\n\nHave you ever been told that you may suffer from circumstantiality? It's a mental condition, you may want to talk to a psychiatrist because this is going to make your life difficult.",
				"added": 1578565367
			}
		],
		"1578406050_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 2,
				"body": "yes I tested it, but a long time ago, it may have changed. It was working fine, but download was slow.",
				"added": 1578421712
			}
		],
		"1600897212_1PwWwS85gsGDcbKXYUqgD1HchDXiNC4DM9": [
			{
				"comment_id": 6,
				"body": "> [kai0](#comment_1113_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): yes,  you can put any web site to zeronet. use httrack_x64-3.49.2 to make a website copy.\n\nBut can we then use a CMS to manage the website? For people who don't code.",
				"added": 1600930356
			},
			{
				"comment_id": 9,
				"body": "> [smashbuckler](#comment_9_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Can you make a more indepth instruction/explanation of how to do so, step by step? Even better to describe it here in ZeroWiki dev section\n\nYes that would be nice. You can do it on a Cryptpad and share the read-only key here. I'm managing several websites myself, but all using Wordpress or Joomla. I wish I could put them on Zeronet, as a replacement to using a central server, maybe with a Zeronet->clearnet gateway, but I'm not a coder, I'm into marketing, so setting up a website on Zeronet is too intimidating for me at the moment.",
				"added": 1600952299
			}
		],
		"1600902116_1A2q7qJ8xFsE2p1sdzkN87rQQx5Hdkdppx": [
			{
				"comment_id": 7,
				"body": "I'm not a coder but I'm interested to help. I can find content, help seed it etc. For communication, I work only with Wire or Wickr. Do not even try to take me on GAFAM owned apps, such as Whatsapp. Do not even try to take me on apps that are not E2EE such as discord.",
				"added": 1600930544
			},
			{
				"comment_id": 8,
				"body": "Why not use Zeronet to stay in touch? There is Zeromail and Bitmessage. Any other way to manage a group on Zeronet? To share files within a team we can use Resilio or Cryptpad https://cryptpad.fr/ (not Etherpad). Element can be E2EE, it's not decentralized, it's federated. Your encryption keys are not synchronized between devices, this is cumbersome. Tox, Briar, Semaphor, Jami, Retroshare, can be used.",
				"added": 1600931087
			}
		],
		"1597083511_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 10,
				"body": "Impossible to download. The page wouldn't even load.",
				"added": 1601012171
			}
		],
		"1601010152_1JzVFcSHTgVo7B3XWbznqCrooUdMsDgM94": [
			{
				"comment_id": 11,
				"body": "Torrent: https://anonfiles.com/Ffn8u2Yaoa/Microsoft_leaked_source_code_archive_2020-09-24_torrent\n\nMega: https://mega.nz/file/PdhxBSZD#w-O3C-BAMwE4E02qPn_fSdTivILcE8hzk9PeyoXg7wU",
				"added": 1601119212
			}
		],
		"1601061418_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 12,
				"body": "Useless, the size of the file is limited to 700 Mo.",
				"added": 1601624621
			}
		],
		"1601724367_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 13,
				"body": "Here is the website, captured with Httrack before it was taken down: https://anonfiles.com/l6bfc4c3p9/Httrack_Capture_Police_7z",
				"added": 1601773909
			},
			{
				"comment_id": 14,
				"body": "Magnet link : magnet:?xt=urn:btih:C061B4FE 6E68CEF1 C93DFEDE 23808CB4 67162165&dn=Website%20Police-Capture%20with%20Httrack%20before%20it%20was%20taken%20down&tr=udp://tracker.cyberia.is:6969/announce&tr=udp://tracker.port443.xyz:6969/announce&tr=http://tracker3.itzmx.com:6961/announce&tr=udp://tracker.moeking.me:6969/announce&tr=http://vps02.net.orel.ru:80/announce&tr=http://tracker.openzim.org:80/announce&tr=udp://tracker.skynetcloud.tk:6969/announce&tr=https://1.tracker.eu.org:443/announce&tr=https://3.tracker.eu.org:443/announce&tr=http://re-tracker.uz:80/announce&tr=https://tracker.parrotsec.org:443/announce&tr=udp://explodie.org:6969/announce&tr=udp://tracker.filemail.com:6969/announce&tr=udp://tracker.nyaa.uk:6969/announce&tr=udp://retracker.netbynet.ru:2710/announce&tr=http://tracker.gbitt.info:80/announce&tr=http://tracker2.dler.org:80/announce",
				"added": 1601820572
			}
		],
		"1602348205_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 15,
				"body": "> [claude](#comment_22_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): To anyone reading this: [...]\n\nIs there a CMS like Wordpress that allows you do build your website locally on your computer so as to export it onto Zeronet afterward? Because otherwise if you use Httrack for example, you need a live website, so Zeronet would just be a backup website.",
				"added": 1602399720
			},
			{
				"comment_id": 16,
				"body": "> [claude](#comment_23_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): Not quite sure why you insist on using WordPress, as it's bloated when simple HTML/CSS will likely do fine. But you can run WordPress locally on your computer and then use WP2Static to convert it to a static website. [...]\n\nExpert's Syndrome: you don't realize that I can only use Wordpress or Joomla as a simple wysiwyg editor. What you call \"simple HTML/CSS\" doesn't mean much to me as I'm not going to code the page myself, being in HTML or CSS. Basically I need a wysiwyg for Zeronet, a CMS like WP or Joomla or whatever, that's not really the point. I'll lookup how to run WP locally and use WP2Static. Thanks for that.",
				"added": 1602444539
			}
		],
		"1602511765_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 17,
				"body": "Magnet link is working fine, thanks.",
				"added": 1602525266
			},
			{
				"comment_id": 18,
				"body": "Very good documentary, must watch.",
				"added": 1602603094
			},
			{
				"comment_id": 19,
				"body": "Your Youtube link isn't working. Here is it: https://www.youtube.com/watch?v=uVDHoY_JngM",
				"added": 1602668039
			}
		],
		"1603637541_1Dr4Ji2TmsvhJW383ukksrobMvEwJnNrxQ": [
			{
				"comment_id": 20,
				"body": "Send it using OnionSgare then>",
				"added": 1603652610
			},
			{
				"comment_id": 21,
				"body": "Send it using OnionShare then.",
				"added": 1603652662
			},
			{
				"comment_id": 22,
				"body": "Send it using OnionShare then.",
				"added": 1603652719
			},
			{
				"comment_id": 23,
				"body": "Send it using OnionShare then.",
				"added": 1603654766
			},
			{
				"comment_id": 24,
				"body": "Send it using OnionShare then.",
				"added": 1603658686
			},
			{
				"comment_id": 25,
				"body": "Sorry, when posting I had this pop up 'failed to publish' which is why you see my post many times, because in fact it was working.",
				"added": 1603658792
			}
		],
		"1604310069_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 26,
				"body": "Play -> http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\nPlay+ -> http://127.0.0.1:43110/1J3JSAxiM3uhpkp2dymY59yud8r2RGW6MA/\nIf the talented webdesigners of these website could tell us more about it, that would be nice.",
				"added": 1604679965
			}
		],
		"1604477660_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 27,
				"body": "This could be a honeypot from law enforcement though. That's how I'd do it to catch those perverse people.",
				"added": 1604680741
			}
		],
		"1604610093_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 28,
				"body": "The real question is: how did they get the private key of the wallet?",
				"added": 1604749483
			}
		],
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [
			{
				"comment_id": 29,
				"body": "There is a documentary about the Covid hoax, but it's in French, not sure if we can find somewhere a version that has been translated or has subtitles.\nLink Lybry.tv: https://lbry.tv/Hold-Up-le-documentaire:9\nLink Odysee.com: https://odysee.com/Hold-Up-le-documentaire:9",
				"added": 1605172235
			},
			{
				"comment_id": 30,
				"body": "And the video on Anonfile: https://anonfiles.com/L4W4ucp3p3/Documentaire_Hold_Up_en_entier_sur_les_v_rit_s_de_la_covid_1_mp4",
				"added": 1605259928
			}
		],
		"1609246965_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 31,
				"body": "> [svengaliexploit](#comment_3_1HCzMbNXn6ieu4UiBGvpama35f88pBPmCW): I know where they are....you have an exploit.in account?\n\nNope. I have one with Raidforum, but I need some credits.",
				"added": 1609441023
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 32,
				"body": "What about Wire, Wickr, Threema?",
				"added": 1611083378
			},
			{
				"comment_id": 33,
				"body": "> [radiator](#comment_38_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): IMO, the problem is not the system itself, but how it is distributed:  [...]\n\nI think diaspora is not decentralized but federated. If your server goes down, everything is gone, your messages, your contacts etc. So it's not difficult to attack.",
				"added": 1611155309
			},
			{
				"comment_id": 34,
				"body": "> [orien3242](#comment_51_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): if its not open source and 3rd party verified its not good. Full stop.\n\nThreema is open source. Wire and Wickr have been \"audited\" by third parties. Yet, in Australia where encryption is unlawful now, what happens when you download Wire or Wickr on the App store? Do they have backdoors?",
				"added": 1611316262
			},
			{
				"comment_id": 35,
				"body": "> [sword000000](#comment_91_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): 1.Briar is currently the highest standard of secure communications [...]\n\nMatrix is not decentralized, it is federetad. Your data goes through one and only one server. If it goes down, you're entire system is down. No failover. No backup.\n-> https://ubinodes.org/portfolio/review-end-to-end-encrypted-chat-server-using-matrix-and-riot/",
				"added": 1611398677
			},
			{
				"comment_id": 37,
				"body": "> [test123a](#comment_36_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ): https://docs.google.com/spreadsheets/d/1-UlA4-tslROBDS9IqHalWVztqZo7uxlCeKPQ-8uoFOU/htmlview\n\nI'd like to end you a zeromail, to test123a@zeroid.bit, but it's not working, your email doesn't show up so that I can select it as the addressee. Did you set up Zeromail?",
				"added": 1611400452
			},
			{
				"comment_id": 38,
				"body": "> [binary1173](#comment_55_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Freudian slip, however its far more transparent than signal/telegram and I would much prefer to use Matrix over signal/telegram.\n\nI didn't know what was a Freudian slip, aka parapraxis. We're learning everyday, thanks for that. Note however that psychology is a pseudo-science, not a single hypothesis has been validated using a scientific methodology. It's people chitchatting and playing doctor. If you observe psychologists, as the scientific or technician person that you seem to be, you'll soon see that they have circumlocutory prolixity syndrome. In the same manner, psychiatry is a para-science. It looks like science, but again, at closer look, it's closer to sorcery. Neuroscience is a science. It's based on imagery. And neuroscience is disproving psychological and psychiatrical \"theories\" and \"principles\" one after the other. In fact, neuroscience has proven that psychology has destroyed lives and families, for example with the \"repressed memories\" theory. If you are interested in the subject, may I recommend the book from Dr Julia Shaw \"the memory illusion\"? (Link: https://www.drjuliashaw.com/thememoryillusion/).\n\nAnyway, you're steering the discussion to another direction. We're not talking transparency here, in my post anyway, but decentralization.",
				"added": 1611401492
			},
			{
				"comment_id": 39,
				"body": "> [binary1173](#comment_56_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Any self hosted service would and should be backed up(mine all are, this is no differrent), so the mitigation is dependent on the owner/user and how much effort you want to keep your data/privacy safe.\n\nYes, but again, you're steering the discussion away from the subject. We're not talking backups here, but decentralization. If their is a single point of failure, then it's not decentralized. Whether the user(s) opt for Matrix (federated) or Signal (US centralized open source) or Telegram (global citizen centralized closed source with multiple servers) is based on the threat model. For Telegram, the biggest threat seems to be state-sponsored criminals (aka governments) so they have servers in many countries, which are as many \"jurisdictions\" in legal terms. For Signal, it seems they still think US is a state of law (it's a criminal state to the highest order), so for them being open source in the US does the trick. Matrix is another culture, a culture of developers, they are good at programming but utopians.\n\nWe had a matrix server for our organization. It got hacked and taken down (by Chinese it seems, maybe just fooling around). So then, because it takes a lot of time to manage such a server, we moved to their servers and set up other instances for our organization. But we learned our lesson. We use other apps so secure our communications and as fail over. Jami and Briar are ones of a few to be really decentralized. The problem with Jami is that you don't have offline messaging (yet). Wickr is the only one with a true self-destroy feature that wipes the messages in a manner that makes them unrecoverable, even (apparently) using Cellebrite (Video: https://www.youtube.com/watch?v=QGymjCi6khI) (Article 1: https://www.wired.com/story/smartphone-encryption-law-enforcement-tools/) (Article 2: https://www.wired.com/story/cellebrite-ufed-ios-12-iphone-hack-android/).\n\nBut again, we're steering to other topics, which are the threat model and the recoverability of deleted messages.\n\nInitially the thread is about Signal And Telegram. Which offer very few benefits actually, compared to Wire, Wickr, Threema, Jami, Briar and so on.\n\nAnd my post about Matrix was just to point out that it is not decentralized, but federated, like Diaspora and Mastodon. So if people are after resiliency, they should put decentralization first in their specifications sheet.",
				"added": 1611403028
			},
			{
				"comment_id": 40,
				"body": "> [binary1173](#comment_57_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Everyone is entitled to chose what they want in the realms of security/privacy, the discussion is about these two which personally I would not/do not use. For every argument about easy/comfortable end user ease of use offerings the open source point is there to be made. Bottom line if you want to use these go ahead, but with so many better offerings out there, its short sighted to assume these two 'main stream top 10' will mitigate the risk posed just because everyone else is getting on the band wagon because all it does is move the goal posts into another barrel that Govt can attack or surpress.\n\nI agree. I wouldn't use either Signal nor Telegram for personal or business purpose.\nTelegram, maybe to host a public channel/group if you think you're going to have a lot of followers. But then, you're absolutely not after privacy, it's just used as a contender to Discord.\nSomeone coming to me, asking if (s)he shall use Signal or Telegram, I would answer Threema, Wire, Wickr, Briar, Jami and as you said there are so many apps available. Note that if you send them to Matrix/Element, there is some explaining to do. For one, it's not encrypted by default, you have to create an encrypted chat room (Telegram isn't encrypted by default either). Then, the keys are created for each device, so (for now), you can't move your account to another device without moving the keys at the same time. It's not difficult for geeks, but for people new to encryption, it might be just a little above their proficiency level. Hence the explaining to do.\nIt's good to see that on Zeronet there are people who contribute experience and knowledge on these topics.\nWhat about we test apps together? I've seen someone giving his Briar key, I think I'll give it a try to review this app by myself.",
				"added": 1611429897
			},
			{
				"comment_id": 41,
				"body": "> [sword000000](#comment_94_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): It appears you are confusing \"Decentralized\" with P2P. Even in the link you posted, Matrix is listed as a decentralized network. Yes, Matrix is Federated. P2P and Federated are Both types of decentralized networks. I'm sorry to hear about your group server being attacked and taken offline. While your server was compromised, the rest of the Matrix network continued to function. Matrix uses Federated decentralization.\n\nI see where this is going.\n\nMatrix would be decentralised if data from your own server was copied to other servers and ready to be used as fail over. Decentralisation is the process of having your data spread across instances. For physical items, it would be to keep every single item composing your stock held in many warehouses instead of all of it in one big warehouse which is the way to go so as to rationalise costs, so you pay to mitigate risk of loss. The military is decentralised. \n\nFederation barely allows clients from the bar next door to get a free pass to the night club if so they wish. It's more like being in the same yellow pages. I see it at the step forward after the highly centralised apps we were fed with, like Facebook. But compared to truly decentralised apps, there isn't much substance to it. Matrix could become decentralised.\n\np2p is decentralising the communication channels only, not the data. In the case of Briar for example, it's p2p, but if the device hosting the forum goes offline or is destroyed, then the data is gone forever and for everyone.\n\nBlockchain is decentralised because each node/miner has an entire copy of the data, although it doesn't mean it can access it as it can be encrypted, it only means it has a copy available. There are a few blockchain projects that aim to offer decentralised storage, like Storj. In the case of Matrix, if a few other servers in the federation circle were holding encrypted copies of your data, and these copies would instantly become available in case of your main server going down, then yes it would be decentralised. Federated systems are not resilient and are expensive to maintain. I'm not sure Diaspora and Mastodon are going to live long with all these social media apps using the blockchain.\n\nThere is no need to use blockchain to be decentralised. There is no need to be p2p to be decentralised.\nRetroshare is decentralised: https://retroshare.cc\nManyverse is decentralised: https://www.manyver.se\n\nZeronet is decentralised AND p2p. Best of both worlds (and anonymous). Zeronet has a social media component that works well (ZeroMe). It's just the websites that currently are a bit difficult for non programmers to build, because they don't have a wordpress like CRM. And you can't manage access rights, ike giving editor access while retaining administrator access. With Steemit (blockchain) you can give the editing key while keeping the owner key.\n\nI'm not going into decentralised vs distributed. Or we open an other thread if you're interested in the topic. You can find more about it by reading the whitepaper of Ubinodes: https://cp.sync.com/dl/6c98c4050/j7fpiw84-gcikx899-7vzzx448-3nb5b6y9\n\nThis thread was about Signal vs Telegram, it seems that here the consensus is to not use any of them and go for other alternatives. Maybe we could open threads to discuss other apps? One at a time.",
				"added": 1611562905
			},
			{
				"comment_id": 54,
				"body": "> [diurpagissa](#comment_26_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK): Forget about Telegram or you will be toasted!\n\nEven though we agree with you, this is not a constructive feedback. How exactly would a user be toasted? Do yo have sources? Have you made some observations yourself?",
				"added": 1611923313
			},
			{
				"comment_id": 55,
				"body": "> [diurpagissa](#comment_27_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK): Yes I have: [...]\n\nI'm trying to send you a ZeroMail but it's not working. Did you set up your ZeroMail account?",
				"added": 1612005286
			}
		],
		"1611330261_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 36,
				"body": "> [thewhispering](#comment_20_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH): I second the comment from this user. F-Droid is a wonderful FOSS app store! You should look into the Aurora Store App which can provide Play Store access by using an anonymous(or your own) account. I had to use that alternative when my old phone was no longer communicating with Google's Play Store servers...\n\nAlright. So the question stays the same. If Wire and Wickr are forced, by law, to build backdoors into their apps for Australia, then how do you know it is not these backdoored apps that F-Droid or Aurora are going to serve users if they use their phone in Australia? Are F-Droid and Aurora serving any apps to their users regardless of location (IP, registration etc), or as the App Store and Google Play Store, they are serving a different set of apps based on location.\n\nIf F-Droid, APKPure, Aurora, are serving the same set of apps to their users, then the Australian law is useless (good). It just means that as long as Wire Wickr and the like make sure their apps are available on these alternative stores, Australians stile are entitled to a private life.\n\nOnly people using Apple devices are living in a cage.",
				"added": 1611399219
			}
		],
		"1611635380_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq": [
			{
				"comment_id": 42,
				"body": "Is this the Patchwork you are talking about? -> https://www.trypatchwork.com\nHow is it decentralised?",
				"added": 1611657185
			}
		],
		"1611693126_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 43,
				"body": "I've updated the initial post and added:\n\n\"This thread is not about getting opinions on apps or devices to use. This thread is only about deciding on a scenario. Then, and only once we have a consensus on a relevant scenario, can we start reviewing apps and devices, one at a time. And these reviews would be made according to the scenario, not according to each and any specific case of the reviewer (that's you and me). So basically, this scenario is a way to structure the review and not make it personal.\"",
				"added": 1611754867
			},
			{
				"comment_id": 44,
				"body": "> [zerotwee](#comment_4_1BGkjiYVSWuenLNRJoghTFwdCKMgJCRZXL): Law inforcement will build a profile about online users using active times and the way they talk. [...]\n\nThis is very interesting stuff, but still not exactly on the topic of coming up with a scenario for a threat model. However, to keep all this information together, maybe we could open another thread. We could call it \"OpSec for communication\" or something descriptive.",
				"added": 1611772307
			},
			{
				"comment_id": 45,
				"body": "> [smashbuckler](#comment_71_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Well, okay, here is the scenario.You are the company, that is about to reveal some sensitive info, \"to crack up the grand lie\". Your company consists of various independent journalists, that are probably located in various places. From your saying, \" the news agency decided to protect all communications and data, at all time\" - so it means that you are already a honeypot. [...]\n\nThis is useful information, but too soon at this stage. First we need to decide on a scenario.",
				"added": 1611841493
			},
			{
				"comment_id": 46,
				"body": "> [qzm](#comment_21_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX): If we want to talk about a scenario in which operational security could become important on a day-to-day basis, I don’t think that being a political dissident in 2021 is too far off from the mark.The federal government has all but branded everyone on the right as terrorists, and I think that we can expect action to be taken slowly over the period of the next few years against individuals who fall into that category. We saw it with the weaponization of the IRS under the Obama administration, and they think that we will see similar action taken against disagreeing types during this administration.OPSEC is not something that can be maintained by people who are not diligent, adequately fearful, and motivated to do so. Given this, I recommend not putting every single individual within your organization on some kind of secure chat application or secure email server in which they are to conduct all of their business all the time. The danger in this is simple, do you really want your local law-enforcement to wonder why all of your communications are encrypted, or otherwise hidden? I think that it would be better to identify those activities which should remain hidden from law-enforcement, regulators, or business enemies, and ensure that all communications pertaining to those activities are secure. Think about it, a small number of elements makes for a simple and easy to control system. A few individuals can be trained to maintain operational security and it is easier to ensure that they are doing so then it is to haphazardly train a large number of individuals and then attempt to keep them accountable.If I were to establish a secure channel of communication, you can bet your bottom dollar that no one who has not been properly trained and vetted would ever be permitted to access it.So my advice is regardless of the threat scenario keep your system small, and simple. Train a few people, only those who have critical need for security. If you absolutely must have everybody on a secure system then ensure that those critical actors are on a separate system then the larger mass of people who need lower security.\n\nBased on your feedback, I'm suggesting another scenario. Instead of being a news agency, we are a political party.",
				"added": 1611841546
			},
			{
				"comment_id": 47,
				"body": "Based on the feedback received so far, I’d like to suggest another scenario. Instead of being a news agency, we are now a political party. In this new scenario, members of the team are coming from all walks of life, compared to the news agency scenario where we were dealing with a homogenous group of people. I have also clarified the type of offensive actions we can expect from our opponent as well as the means at his disposal.\n\nTo make things simpler, I’m writing again the new thread. Please read it from top to bottom, I have clarified the aim of this thread and what we are trying to achieve, step by step. This thread is step 1 only, please keep your notes aside for the other steps. I’ll open one thread for each step.\n\nHi all,\n\nI would appreciate your constructive feedback on a scenario for a threat model.\n\nThe aim is to test communication apps. By apps, I include operation system as well, and any software that shall be used in conjunction, like encryption software (Bitlocker, VPN, Tor etc).\n\nBut there are so many of them available, that it’s difficult to weed out which ones shall be used and which ones shall be avoided. If I open a generic thread on encrypted communications apps, opinions and advises are going to come from everywhere, based on each individual’s experience and knowledge, and in the end its going to take us no-where. Same if I open a thread on OpSec. The aim of having a scenario is to help make discussions more down to earth, instead of ending up with the one shouting the louder winning the argument.\n\nStep 1: This not-so-fictitious scenario will help structure the reviewing process of apps and of procedures on how to use them depending on the situation (communications with teammates, with families etc).\n\nStep 2: We’ll use this scenario to decide on a specifications sheet for the apps we need to use: what features we’re looking for and also to help prioritize features by order of importance.\n\nStep 3: Once we have made a decision on a specifications sheet, we’ll short list apps that should be reviewed. These apps would be used in a business environment, so users are not necessarily supposed to be geeks. And they’re not used to send messages to girlfriends/boyfriends either, it can have devastating implications if communication falls in the wrong hands. So we need to find apps that tick the OpSec boxes for real life use in a complicated environment. The scenario below is taking inspiration from real life cases like Edward Snowden, Julian Assange, Jamal Khashoggi, Chelsea Manning, Daniel Hale etc. (suggest names). However, note that our people are not whistle blowers, they are working on many other projects, still have their day-to-day job as main source of income, still have to deal with housekeeping tasks and family’s affairs and so on. So their desktop is used for anything and everything, as well as their mobile devices. This is the scenario. We’ll see in later steps how to deal with that.\n\nStep 4: Once we start reviewing these apps, we’ll use this scenario to benchmark the features of the app (user friendliness, anonymity, reliability etc).\n\nStep 5: Once we have made a final decision on which apps we keep and use, we’ll put together an OpSec manual to describe how to use them.\n\nSo here is the new scenario:\n\n1-We are a moderate (centre) political party acting in the USA.\n\n2-We are preparing for the next presidential election in 12 months, and we have a candidate that has realistic chances of being elected. In this scenario we are therefore still a honeypot as much as with the news agency scenario. However, they don't know who to target as easily as with the news agency scenario.\n\n3-Our team is made of people from all walks of life, bringing their knowledge and experience in many fields: university professors, lawyers and magistrates, investigation journalists, law enforcement officers, IT professionals, accountants and so on.\n\n4-While monitoring our opponents, our team found some discrepancies in the advertising budget of the Black party. Their advertising spending was clearly way over what they claimed and what would be possible based on the donations they were receiving.\n\n5-Our team discovered that they were using money from drug cartels. The DEA (drug Enforcement Agency) was being used as a cover to ship drugs from Mexico directly into the US. DEA’s aircraft were being used, and even military aircraft coming back from Afghanistan were carrying drug, shipments were then given to drug cartels based in the US, and from this scheme cash was pouring into their party and financing the advertising of their campaign. Such operations must involve customs, law enforcement and military officers, as well as prosecutors and probably some three letters agencies (FBI, NSA, CIA, MI6).\n\n6-A British news reporters from ICIJ (international consortium of investigative journalists) who was investigating the case was found shot dead in his car, a bullet in his head, and all his electronic devices and paper files had disappeared from both his car and his home. Strangely, after just three weeks of investigation, prosecutor ruled the case as suicide and closed it.\n\n7-An Australian news reporter decided to investigate the death of his British counterpart as he knew him from a joint reportage they had done in Africa while they were both students. Soon after he had started his investigation, his house caught fire at night, the fire had started in his office and all his work got destroyed. The week after, his car caught fire, in broad day light, while he was in a shopping mall.\n\n8-Our team then decides to contact the US news agency “The Guardian” to tell the story. Contact is made and the team gives to the journalist from the Guardian all information they have collected on the case. Two weeks later, the journalist from The Guardian is arrested at his home during a Swat raid early in the morning. Under the Patriot Act, he is put in jail on suspicion of having shared classified information with Wikileaks. All his work is confiscated. He is strongly denying the charges but no-one can reach him, even his lawyer is not allowed to visit him.\n\n9-It now falls down onto our team to investigate this fraudulent scheme and gather undeniable evidence, in order to disclose them publicly as soon as possible, and before the opposition has gained to much momentum in the campaign.\n\n10-Our team are not all geeks nor trained spies. They know that the opponent has insiders in the law enforcement and judicial system, as a result, they know for a fact that surveillance tools are being used against them, their collaborators, their sources, their families. They know that the opponent will not hesitate to use violence against them or their families. Because two journalists living outside of the US got targeted, they know their opponent has international reach, 14 eyes countries shall be treated with extreme suspicion (USA, UK, Canada, Australia, New Zealand, Denmark, France, Netherlands, Norway, Germany, Belgium, Italy, Sweden, Spain). They know for a fact that they can be arrested and jailed, indefinitely, without any charges whatsoever. They know for a fact that their homes can be invaded, their property stolen, their families harassed or physically harmed, without any possibility of using the law to defend themselves. The threat when dealing with state-sponsored criminals is: what kind of false and baseless accusations can they invent in order to cause harm to the organisation, under the colour of law. The usual modus operandi is to take a piece of communication out of context and fabricate a case from it, creating suspicion through figure of speech (rhetoric). So the threat is not about what they are actually doing, or with whom, as it is lawful and they are not dealing with criminals at all. But simply how not to give the opponent any piece of communication at all. So the team decides to be proactive in protecting its work in progress and its sources. Instead of the naive \"if I have nothing to hide then I have nothing to fear\", or sometimes \"if I'm not doing anything illegal then I have nothing to fear\" which is constantly proving to be a false and dangerous approach, the team makes the decision to protect all the people they are in contact with, including families, suppliers, contractors, sources and so on. As if it were not enough, police brutality is a reality anywhere. State-sponsored criminals can harm individuals, businesses, non-profit organizations, for no other reason than to satisfy their urge of domination and social status. And to mimic what they see on television with all their electronic weapons and firearms. They get their kick of dopamine by destroying lives and projects. They are out of control, without any real supervision, there is no such thing as check and balance when it comes to state-sponsored criminals. One could end up fighting the justice system for years, spending its entire income, just to dismiss false and baseless accusations from a brain dead police officer or a sadistic prosecutor. We live in a world where those who are doing nothing wrong but just want to live a peaceful life and run a successful business must protect themselves against the most evil form of criminality.\n\n11-However, democracy is in danger, they have to act, anywhere they are, at all time, anyhow they can.\n\n12-OpSec is not backward compatible. The team has to protect itself from state-sponsored criminals before they can even come to know about them or what there are doing.",
				"added": 1611843186
			},
			{
				"comment_id": 48,
				"body": "> [smashbuckler](#comment_71_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Well, okay, here is the scenario.You are the company, that is about to reveal some sensitive info, \"to crack up the grand lie\". Your company consists of various independent journalists, that are probably located in various places. From your saying, \" the news agency decided to protect all communications and data, at all time\" - so it means that you are already a honeypot. [...]\n\nTo make our scenario clear and simple, we can do as in a board game, create fictitious roles. These will be used when creating the OpSec manual. Accountant, Lawyer, Journalist, IT specialist, Wife, Teenage child, client and so on.",
				"added": 1611843489
			},
			{
				"comment_id": 50,
				"body": "> [smashbuckler](#comment_71_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): From your saying, \" the news agency decided to protect all communications and data, at all time\" - so it means that you are already a honeypot. [...]\n\nYes, in the new scenario in point 2 it says : \"In this scenario we are therefore still a honeypot as much as with the news agency scenario. However, they don't know who to target as easily as with the news agency scenario.\" So I used your feedback.",
				"added": 1611906578
			},
			{
				"comment_id": 51,
				"body": "I've added a new item:\n13- After what happened to the journalist from The Guardian, our team decides that we must publish the information on the internet ourselves. It must be easy to find and access for everyone, so it must be SEO friendly. At the same time, we must protect our publishers and blog/website administrators/editors and we must find ways to make our content censorship resistant.",
				"added": 1611921492
			},
			{
				"comment_id": 52,
				"body": "I'm updating the text to make it more personal, for example instead of \"our team\" and \"they know\" I'm writing \"we know...\"",
				"added": 1611922011
			},
			{
				"comment_id": 53,
				"body": "I'm going to rename \"The Black Party\" into \"The Blackrock Party\". Because the use of black/white terms could be misinterpreted. And we are therefore \"The Yellowstone Party\". I'm also using the present tense, \"is\" instead of \"was\".",
				"added": 1611922345
			}
		],
		"1611680008_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": [
			{
				"comment_id": 56,
				"body": "> [weakish](#comment_16_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): Webflow is a SaaS solution. I'd prefer open source tools that I can run on my own machine.\n\nAgree. A SaaS defeats the purpose of using ZeroNet for anonymity.",
				"added": 1612011161
			}
		]
	},
	"comment_vote": {
		"653_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"62_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1114_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"9_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"1115_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"597_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"39_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"44_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"36_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1,
		"6_174K6TcAsHBzCgA4Fqq9duYKdNaFPtSSUf": 1,
		"58_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"37_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"46_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"4_1BGkjiYVSWuenLNRJoghTFwdCKMgJCRZXL": 1,
		"51_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"27_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"2_1LS3ur69MC9WP8UMjAHCWYdfopv39kEfaJ": 1
	}
}