{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1615300036,
			"title": "Covid-19 & Crimes Against Humanity",
			"body": "Anthony Fauci has been the director of the National Institute of Allergies and Infectious Diseases (NIAID), since 1984 as a physician-scientist-immunologist. No scientist-physician is above the law, yet there is ample evidence in his background to question his ethics, morals, and actions as the appointed director of a federal agency that dictates health measures that may or may not be logical, legal, or even grounded in cult scientism.\n\nAccording to a January 2021 Forbes Magazine article, Fauci makes the most money a federal employee can make. As an appointed messenger for all things viruses and vaccines, he has a habit of writing one narrative in medical journals, while stating the exact opposite in the media. In this world of duality, double messages, and “BLM,” Fauci believes he can have it both ways, but he is telling huge mistruths, a series of lies that should tell you that nothing he says can be trusted. Yet, you trust him.\n\nA recently released Fauci Dossier makes it clear that Fauci participated in crimes against humanity using COVID19 terrorism as part of a larger group of corporations and agencies to violate antitrust laws. This scheme is part of a pattern of programming the masses going back well before the inflow of millions of dollars to NIAID, under Fauci, when HIV was “discovered” as a similar threat before it vanished from reality. But don’t expect that dossier to go anywhere, as no authority is likely to recognize the findings. All of this leads back to the government of the United States, in some cases, complicit all the way to the top. \n\nHere is the document that outlines crimes by Dr. Fauci. Get it while you can. https://www.davidmartin.world/wp-content/uploads/2021/01/The_Fauci_COVID-19_Dossier.pdf",
			"added": 1615300035
		},
		{
			"topic_id": 1615569545,
			"title": "Covid & Mechanisms of Injury",
			"body": "an interview with Dr. Sherri Tenpenny\nImportant Vaccine Interview of Dr. Tenpenny - #Covid & the Mechanisms of Injury [audio] https://t.me/markinformer/1689 #coronavirus #vaccine #danger",
			"added": 1615569543
		},
		{
			"topic_id": 1616340894,
			"title": "Are You Wrapped Up in Covid Lies and Gaslighting?",
			"body": "1.No Such Thing as Herd Immunity — Except From Vaccines — Herd immunity occurs when enough people acquire immunity to an infectious disease such that it can no longer spread widely in the community. When the number susceptible is low enough to prevent epidemic growth, herd immunity is said to have been reached. Prior to the introduction of vaccines, all herd immunity was achieved via exposure to and recovery from an infectious disease.\n\nEventually, as vaccination became widespread, the concept of herd immunity evolved to include not only the naturally acquired immunity that comes from prior illness but also the temporary vaccine-acquired immunity that can occur after vaccination.\n\nIn the case of COVID-19, however, we’ve been told that the idea of natural herd immunity to COVID-19 is not achievable — and even considering that it could be is “deadly and dangerous.”2 Yet, a curious thing happened. When vaccines became available, the idea of vaccine-induced herd immunity to COVID-19 became widespread. According to Kendrick:3\n\n“First, I was told that attempting to create herd immunity was not achievable. It would also be extremely dangerous and would inevitably result in many hundreds of thousands of excess deaths.\n\nThen the vaccines arrived at fantastical speed and I was told that mass vaccination, by creating herd immunity, would be the factor that would allow us to conquer COVID19 and return to normal life. I am not entirely sure which of these things is impossible, but one of them must be.”\n\n2.Vaccines Induce ‘Stronger and Longer Lasting Immunity’ — In February 2021, The HuffPost reported that the COVID-19 vaccine would “induce stronger and longer lasting immunity” than the immunity induced by natural infection.4 However, an internist with special interests in vaccine-induced illnesses, Dr. Meryl Nass, suggests the protection the COVID vaccine provides will be inferior to that acquired via natural infection:\n\n“No one knows how long immunity lasts, if in fact the vaccines do provide some degree of immunity … For every known vaccine, the immunity it provides is less robust and long-lasting than the immunity obtained from having had the infection.\n\nPeople who have had Covid really have no business getting vaccinated — they get all the risk and none of the benefit.”\n\nIn the U.S., the Centers for Disease Control and Prevention advises people who have previously been infected with COVID-19 to still get vaccinated, even though trials suggest there’s no benefit in this population. A CDC report also incorrectly cited the vaccine’s effectiveness for those previously infected, prompting one congressman to say they’re “lying.”\n\nIn a high-profile report issued by the CDC’s Advisory Committee on Immunization Practices, 15 scientists stated that the Pfizer-BioNTech COVID-19 vaccine had “consistent high efficacy” of 92% or more among people with evidence of previous SARS-CoV-2 infection.5\n\nBut according to Rep. Thomas Massie, R-Ky, “That sentence is wrong. There is no efficacy demonstrated in the Pfizer trial among participants with evidence of previous SARS-CoV-2 infections and actually there's no proof in the Moderna trial either.”6 Kendrick adds:7\n\n“I also know that vaccinations can only ever really create an attenuated response. Whereas a full-blown infection triggers a full-blown immune response.\n\nSo, I think it is pretty close to impossible that vaccination can provide greater protection than that from getting the actual disease. Which is why I think it is utterly bonkers we are actually vaccinating people who have circulating antibodies in their blood.”\n\n3.Universal Mask Use Is Essential to Stop COVID-19 — It’s been touted that face masks are essential to stopping the spread of COVID-19 and could save 130,000 lives in the U.S. alone.8 But in 2019, the World Health Organization analyzed 10 randomized controlled trials and concluded, “there was no evidence that facemasks are effective in reducing transmission of laboratory-confirmed influenza.”9\n\nOnly one randomized controlled trial has been conducted on mask usage and COVID-19 transmission, and it found masks did not statistically significantly reduce the incidence of infection.10\n\n“Never has a trial been subjected to such immediate and hostile reporting. Fact-checkers (whoever exactly they might be, or what understanding they have of medical research) immediately attacked it,” Kendrick noted, adding:11\n\n“Yes, we have now entered a world when political fact checkers feel free to attack and contradict the findings of scientific papers, using such scientific terms as ‘Mostly false’ … Ignoring the modern-day Spanish Inquisition, and their ill-informed criticisms, I will simply call this study.\n\nMore evidence that face masks don’t work. Perhaps someone will come along with a study proving that face masks work. So far … nada. Another impossible thing.”\n\n4.COVID-19 Death Statistics — The positive reverse transcription polymerase chain reaction (RT-PCR) tests for COVID-19 are plagued with problems, one of which is that they are not designed to be used as diagnostic tools as they cannot distinguish between inactive (noninfectious) viruses and \"live\" or reproductive ones.12\n\nIf you have a nonreproductive virus in your body, you will not get sick from it and you cannot spread it to others. Further, many if not most laboratories amplify the RNA collected far too many times, which results in healthy people testing \"positive.” These false positive tests, in turn, can contribute to the number of people dying “with” COVID-19, but not actually dying “of” the disease.\n\n“[W]e have the very strange concept that any death within twenty-eight days of a positive COVID19 swab is recorded as a COVID19 death,” Kendrick said, explaining:13\n\n“You can have a positive swab long after you have been infected — and recovered. There are just some bits of virus up your nose that can be magnified, through the wonders of the PCR test, into a positive result.\n\nWhich means that an elderly person, infected months ago, can be admitted to hospital for any reason whatsoever. The they can have a positive swab — everyone is swabbed. Then they can die, from whatever it was they were admitted for in the first place. Then, they will be recorded as a COVID19 death.\n\nIn truth, this is just the start of impossible things when it comes to the number of COVID19 deaths. Do not get me started on PCR cycle numbers, and false positives. We would be here all day.”\n\n5.The Swedish COVID-19 Response Was a Disaster — Sweden handled the pandemic differently than most of the globe, and has been chided for its looser restrictions and lack of severe lockdowns. In October 2020, TIME called the Swedish COVID-19 response a “disaster,”14 but Kendrick cites data showing that the death rate in Sweden in 2020 was right in line with other years — nothing out of the ordinary.15\n\nWhen Kendrick compared the number of deaths in Sweden in 2012 — one of their highest death statistics — to 2020, the difference between absolute death rate in 2012 and 2020 is 0.012%.\n\n“That is 120 extra deaths per million of the population, which is 1,224 people in a population of 10.2 million. The statistics tell us that twelve thousand people died from COVID19 in Sweden. Maybe you can make all that add up. Frankly, I find it impossible.”16\n\n6.Lockdowns Have Worked — Available data reveal lockdowns have been completely ineffective at lowering positive test rates, while extracting a huge cost in terms of human suffering and societal health.\n\nUsing data from the Worldometer,17 Kendrick compiled a list of the countries with the highest rate of COVID-19, based on deaths per million of the population. Every country on the list, which included the U.K., Italy, the U.S., Spain, Mexico and others, had “fairly strict” lockdowns.\n\nFour countries that have been criticized for not having strict lockdowns — Sweden, Japan, Belarus and Nicaragua — did not make the list, and have an average death rate of 391 per million. In contrast, the top 20 “lockdown” countries have an average death rate of 1,520 per million. According to Kendrick:18\n\n“Yet although this evidence is out there, I am being asked to believe that lockdowns work. At least the WHO agrees with me on this impossible thing.\n\nAs Dr. David Nabarro, the WHO special envoy on COVID19 said, ‘We really do appeal to all world leaders, stop using lockdown as your primary method of control. Lockdowns have just one consequence that you must never ever belittle, and that is making poor people an awful lot poorer.’19”\n\n7.Asymptomatic Spreaders Are Driving the Pandemic — The reasoning given for lockdowns, masks and social distancing is to stop the spread of disease among people who are asymptomatic. It’s common sense to stay home if you’re sick and exhibiting symptoms, but for people who feel healthy, the institution of lockdowns to prevent asymptomatic spread is unprecedented.\n\nYet, during a June 8, 2020, press briefing, Maria Van Kerkhove, the World Health Organization's technical lead for the COVID-19 pandemic, made it very clear that asymptomatic transmission is very rare, meaning an individual who tests positive but does not exhibit symptoms is highly unlikely to transmit live virus to others.\n\nA study in Nature Communications also found \"there was no evidence of transmission from asymptomatic positive persons to traced close contacts.\"20 When they further tested asymptomatic patients for antibodies, they discovered that 190 of the 300, or 63.3%, had actually had a \"hot\" or productive infection resulting in the production of antibodies. Still, none of their contacts had been infected.21\n\n8.The Virus Didn’t Come From a Lab Accident — Despite the complete absence of a plausible zoonotic origin theory, WHO’s investigative commission, tasked with identifying the origin of SARS-CoV-2, the virus that causes COVID-19, has officially cleared the Wuhan Institute of Virology and two other biosafety level 4 laboratories in Wuhan of wrongdoing, saying these labs had nothing to do with the COVID-19 outbreak.22\n\nThe WHO investigation was riddled with conflicts of interest from the start, and no credible theory for natural zoonotic spillover has been presented to date. However, there are at least four distinct lab origin theories, including the serial passage theory, which proposes the virus was created by serial passaging through an animal host or cell culture, as well as evidence for genetic manipulation.23\n\nYou may be wondering, if there’s so much evidence pointing toward a lab origin, why are leading health authorities and scientists dismissing it all and insisting SARS-CoV-2 is a natural occurrence, mysterious as it might be?\n\nShould the COVID-19 pandemic be officially recognized as the result of a lab accident, the world might be forced to take a cold hard look at gain-of-function research that allows for the creation of these new pathogens. The end result would ideally be the banning of such research worldwide, with significant financial repercussions, the ending of prestigious careers in that realm and potential criminal charges for those involved as well.\n\nIn the face of misinformation and manipulation, what you can do now is keep your eyes open and your ears tuned to the science, so you don’t fall victim to the unnecessary panic and fear, or the increased surveillance and control, that is being created.\n\n1, 3, 7, 11, 13, 16, 18 DrMalcomKendrick.org March 6, 2021\n2 SELF November 9, 2020\n4 HuffPost February 8, 2021\n5 MMWR December 18, 2020\n6 WWMT January 29, 2021\n8 STAT News October 23, 2020\n9 WHO\n10 Annals of Internal Medicine November 18, 2020 DOI: 10.7326/M20-6817\n12 CDC 2019 Novel Coronavirus RT-PCR Diagnostic Panel July 13, 2020 (PDF)\n14 TIME October 14, 2020\n15 MedRxiv November 13, 2020\n17 Worldometer, Coronavirus\n19 ABC News October 12, 2020\n20, 21 Nature Communications November 20, 2020; 11 Article number 5917, Discussion\n22 The Washington Post February 9, 2021\n23 Independent Science News February 16, 2021",
			"added": 1616340891
		},
		{
			"topic_id": 1616930889,
			"title": "The end of America? The end of the Republic.",
			"body": "Sidney Powell: The truth of the 2020 elections and the harm to America\n\nSince the election, Sidney Powell has come to call this nation \"Merika [Mare-eeka], a Nazi Fascist country.\" \n\n\"All I can say is that we've had a complete institutional failure of all the institutions that were created in the Constitution to protect the Constitutional rights of the individuals against the government, and they have.. every single one of them has failed us, every branch. The executive branch failed us, the legislative branch failed us, and the judicial branch failed us. Nothing worked as it should have worked. It was all succumbed by massive fraud and whatever influence China and Iran, and any other nefarious actor brought to bear on the process, whether it be by blackmail, extortion, or bribery - or just some form of corruption.\" defendingtherepublic.org ﻿#election﻿ ﻿#fraud﻿ \n\nListen to the interview here: https://www.bitchute.com/video/X4Qi15DFKvb4/",
			"added": 1616930885
		},
		{
			"topic_id": 1620131868,
			"title": "Chat App Surveillance Publicly Under Way in the USA",
			"body": "Beijing Biden regime considers chat app surveillance\nThe plans would reportedly allow large amounts of data to be gathered from private, \"encrypted\" messaging apps. Are you at risk? Get secure and prepare your communications. Find secure ways to contact each other. The fact that this is mentioned indicates that spying activities of the state have been and are under way.\nhttps://reclaimthenet.org/biden-administration-considers-chat-app-surveillance/",
			"added": 1620131863
		}
	],
	"topic_vote": {
		"1613921922_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1620756113_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	},
	"next_comment_id": 37,
	"comment": {
		"1613257982_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 1,
				"body": "The key is that this is wholly about intimidation. Work and organize around these idiots. You don't give in. The war is already at hand, evidenced by the movement at hand involving censorship that initially started around the election. They started the war against freedom and privacy. The first action is to find modes of secure communications, or at least not mainstreamed or easily hackable. You might have it here.",
				"added": 1613517172
			}
		],
		"1613419711_16E25Tu9jf8GTS2S1W5mZs6Ayc9vQkC8SN": [
			{
				"comment_id": 2,
				"body": "Interesting bit there. The only thing they have succeeded in so far is shutting down and/or stunting the economy, along with creating fear - \"fearmongering\"",
				"added": 1613520056
			}
		],
		"1613421453_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 3,
				"body": "It's a good idea, but it might not fit in with their project focus.",
				"added": 1613520151
			}
		],
		"1613425717_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Linux Mint Mate has worked out well for me. I started out years ago with LMDE, and while it was lots of fun, it started having issues on my old machine. Mint Cinnamon is nice, but not stable.",
				"added": 1613520995
			}
		],
		"1613342125_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 5,
				"body": "From what I can tell, China doesn't want you to know they are trying to build a time machine. A time machine is hardly a small project anyway. You'll need someone as bright and eccentric as Tesla to even begin I would say.",
				"added": 1613521191
			}
		],
		"1613690812_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 6,
				"body": "While it may have its disadvantages, I find that bitwarden works best, and is unfailingly reliable. If you change your operating system or are forced to reinstall it, it is easy to deal with since it can be linked to many browsers.",
				"added": 1613708817
			}
		],
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 7,
				"body": "Gold and silver - but don't be seduced by paper or digital certificates - gotta have the real thing in your possession.",
				"added": 1613864529
			}
		],
		"1614627631_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 8,
				"body": "Your zite is quite nice. The only problem that I can see is that it is not secure for business. I did register, but the browser still shows unsecured even though the page claims encryption. Like I said, nice sample.",
				"added": 1614644565
			}
		],
		"1615021326_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 9,
				"body": "Thanks for your fine recommendations!",
				"added": 1615127036
			}
		],
		"1615300036_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": [
			{
				"comment_id": 11,
				"body": "Fauci: Can You Believe a Word He Says? Wait, It Gets Worse http://127.0.0.1:43110/18MrqieNkfZpBwV8i4eRAwkrSpC4EToWYm/?Post:141",
				"added": 1615300951
			},
			{
				"comment_id": 12,
				"body": "Here is the document that outlines crimes by Dr. Fauci. Get it while you can. https://www.davidmartin.world/wp-content/uploads/2021/01/The_Fauci_COVID-19_Dossier.pdf",
				"added": 1615300980
			},
			{
				"comment_id": 13,
				"body": "> [calmdownholden](#comment_28_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Your conspiracy theory is lacking in citations and is just a dumb narrative.Into the trash your opinion goes.\n\nYou forgot to say “‘Baseless,’ ‘Without evidence,’ ‘Debunked’.  Your narrative likely notes that Fauci is a saint of a good man and a really fine scientist beyond reproach.",
				"added": 1615572999
			},
			{
				"comment_id": 14,
				"body": "> [peaceistheway](#comment_22_13jbVt6WuLu9Rp7YZwUceYVkYgyaxBfWWk): ahhh I like the censors are lost here ! add redstone (cdc) to the EIT... who transfered this virusdna mesh to china to be able to later release it and frame china? who launched the pork attack ealier? little heads at the cia going boom boom ! there own parents dead !\n\nThe strange thing is that Fauci (as director of the NIAID) has been funding the China lab at Wuhan all along, even though his boss Obama (at the time) told him to lose the lab (link not currently included), that it was too risky. All-in-all, Fauci is the man responsible for entire covid mess if the info is correct. There are also indications that the covid mess was originally planned, but perhaps was released a little earlier than expected due to the lab accident.",
				"added": 1615588583
			},
			{
				"comment_id": 20,
				"body": "That is what Fauci and his minions are... a narrative, albeit with creating a vaccine that will \"save the world\" when natural solutions do the same job. His kind work solely for their own benefit and glory, to control others. They aren't needed except to the mind-numbed distracted masses that are busy chasing their dreams, or whatever. That is the problem. The \"science\" has too much money to make, and a few people aren't going to get in their way.\n",
				"added": 1617040636
			}
		],
		"1616036792_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 15,
				"body": "Illegal!! Oh no! The criminals are actually doing illegal things, even unconstitutional... and they're getting away with it too.",
				"added": 1616076113
			}
		],
		"1616012216_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 16,
				"body": "The government is your friend. Now be happy and do anything you please, and leave me and mom alone.",
				"added": 1616076213
			}
		],
		"1616048739_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 17,
				"body": "A prison planet is what you make of it.",
				"added": 1616076298
			}
		],
		"1615979560_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 18,
				"body": "So you're saying the \"Prince Philip\" has been on adenochrome and that is why he looks so good and has lived so long? The thing is, since reincarnation is a myth, he'll just take a long dirt nap after his bitter butt has finished cursing the world.",
				"added": 1616076495
			}
		],
		"1616896201_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "Will I Take the COVID Injection?\nThose who have been following my blog since it began late 2020 know that I have been posting many articles and information about COVID.  Judging by the proportion of posts on COVID, you can see how very important this issue is to me.  I believe we are at a critical moment in history—how it turns out depends on the choices everyday people make. In early April 2020 when we first began the lockdown in the United States, I wrote this update for the North Central Regional Center for Rural Development.  The US and other countries around the world were shutting down their economies, initially for just two weeks, to “flatten the curve.”  At the time, it was acknowledged that it was not possible to prevent the disease from spreading…rather the stated goal was to slow the spread so that the hospitals would not be overwhelmed with patients.  I questioned the wisdom of shutting down the economy and implored my colleagues to work together to evaluate the benefits of the lockdowns (lives saved from COVID) against the costs (lost jobs, failed businesses, increased suicide, increased alcohol and drug related fatalities, etc.). \nThe two-week lockdowns got extended, and again, and again.  The rationale for continued lockdowns morphed into this idea that we had to keep things locked down until the “vaccines” came out.  Through Operation Warp Speed, Pfizer, Moderna, Johnson and Johnson, and other companies worked to produce a new type of gene therapy (inappropriately labeled a “vaccine”) to treat the disease.  Officials implored us to “hang on” until the roll out of the “vaccines” made the world safe again.\nEarly on, the CDC altered its definition for how it counts COVID fatalities (but only for COVID and not other diseases), which has led to dramatic over count of fatalities attributed to COVID as compared to the method that had been used for many years.  You can read about it here.  Why did the CDC change this definition?  In addition, many countries began to use the PCR test to determine whether people were infected with COVID.  However, the PCR test generates 94% false positives. That is, in 94% of the positive tests people were not actually sick and not contagious.  You can learn more about this here and here.  The U.S and other countries were basing policy decisions on a wildly inaccurate tool.  Why base policy on a tool known to be useless for the purpose of identifying COVID? \nAs the CDC collected data on COVID fatalities (using the modified definition which leads to a dramatic over count of actual fatalities), we learned that the survival rate is about 99.7%.  This is roughly equivalent to a typical flu season.  However, we also learned that the elderly are more vulnerable as are the obese and those low on vitamin D.  Children and young people have an extremely low risk with survival rates of 99.9%.  As these data emerged, a logical policy response would have been to open schools and allow people to engage in everyday activities while protecting the most vulnerable (the elderly and those with underlying health conditions).  Instead, we continued to disrupt the lives of everyone.\nIn addition, some doctors and scientists pointed out that existing medications proven to be safe were very effective in treating COVID.  You can read about all the peer reviewed studies showing that hydroxychloroquine (HCQ), ivermectin, and vitamin D here.  Though these treatments are demonstrably safe and effective, for some reason this information is suppressed.    For example, this recent Senate hearing testimony by Dr. Kory on the effectiveness of ivermectin was banned by Youtube (but you can view his testimony here).  Why would a Senate hearing presentation by a qualified professional be banned?  The voices of many doctors and scientists have been suppressed/banned from mainstream outlets.  As a result, thousands of people in the United States have unnecessarily died of COVID because they were not given these effective treatments.  Of critical importance, the leaders of our medical establishment have known for many years that HCQ was very effective in treating coronavirus.  See here for evidence that Dr. Fauci said so himself in 2005.\nAs we are all being corralled into the “vaccine” as one and only solution to the “raging pandemic”, Operation Warp Speed thrust the vaccine development process forward.  We now have three “vaccines” available from Pfizer, Moderna, and Johnson and Johnson, all of which have been approved by our government for emergency use. \nYou can read here about the nature of these “vaccines”, which aren’t vaccines at all in the traditional sense.  With a traditional vaccine, a person is injected with an attenuated virus, which stimulates a natural immune response so that the body responds and begins building immunity.  The “vaccines” being offered to us for COVID are not this, but rather a form of gene therapy.  The injection stimulates your own cells to produce a spike protein that comes from the coronavirus.  The body’s immune system responds by destroying the cells that create the foreign spike protein.  Such an approach has never before been used population-wide.  You can access information on the number of deaths and adverse reactions from the injections that are occurring around the world here.  Further, we don’t yet know the potential longer-run negative effects might be, though previous studies on animals resulted in many fatalities–the animal trails were skipped.  The mRNA gene therapy being used for COVID is truly experimental.  Read the descriptions of this new technology from those who are developing it[1]:\n“–Our Operating System – Recognizing the broad potential of mRNA science, we set out to create an mRNA technology platform that functions very much like an operating system on a computer. It is designed so that it can plug and play interchangeably with different programs. In our case, the “program” or “app” is our mRNA drug – the unique mRNA sequence that codes for a protein.” – Moderna\n“We think of it as information therapy” – Tal Zaks Chief Medical Officer of Moderna\nWriter David O’Hagen offers: “Computers are information processing machines; the mRNA and DNA injections can be seen as rudimentary biological computing systems running within the body. The reference to storage, software and applications is not metaphorical, we are dealing here with synthetic biology an aspect of which is biocomputing.  The development of gene-based logic circuits forming CPUs, bio-censors etc, fabricated using living materials instead of silicone is already well advanced.”\n“Controlling gene expression with sophisticated logic gates has been and remains one of the central aims of synthetic biology. However, conventional implementations of biocomputers use central processing units (CPUs) assembled from multiple protein-based gene switches, limiting the programming flexibility and complexity that can be achieved within single cells. Here, we introduce a CRISPR/Cas9-based core processor that enables different sets of user-defined guide RNA inputs to program a single transcriptional regulator (dCas9-KRAB) to perform a wide range of bitwise computations, from simple Boolean logic gates to arithmetic operations such as the half adder. Furthermore, we built a dual-core CPU combining two orthogonal core processors in a single cell. In principle, human cells integrating multiple orthogonal CRISPR/Cas9-based core processors could offer enormous computational capacity.” – A CRISPR/Cas9-based Central Processing Unit to Program Complex Logic Computation in Human Cells\nIs this kind of technology used in the current mRNA injections?  Consider the words of the people developing the treatments.\n“First, we would like to introduce to the vaccine community the concept of synthetic gene circuits and how they could help create more effective vaccines with sophisticated programmable behaviour. Second, we would like to challenge the mammalian synthetic biology community to engineer sophisticated gene circuits for vaccination by using the emerging modified or replicating RNA technologies….\nNucleic acid vaccines have been gaining attention as an alternative to the standard attenuated pathogen or protein-based vaccine. However, an unrealized advantage of using such DNA or RNA based vaccination modalities is the ability to program within these nucleic acids regulatory devices that would provide an immunologist the power to control the production of antigens and adjuvants in a desirable manner by administering small molecule drugs as chemical triggers…\nAdvances in synthetic biology have resulted in the creation of highly predictable and modular genetic parts and devices that can be composed into synthetic gene circuits with complex behaviours. With the recent advent of modified RNA gene delivery methods and developments in the RNA replicon platform, we foresee a future in which mammalian synthetic biologists will create genetic circuits encoded exclusively on RNA… ‘smart vaccines’ will revolutionize the field of RNA vaccination…\nSynthetic biology is a radically new style of genetic engineering in which living organisms are “programmed” using genetic circuits to systematically engineer novel and useful biological properties. The earliest accomplishments in the field included the construction of simple genetic circuits such as oscillators [1]and toggle switches [2]in bacterial species using mathematical modelling and rational network design. Since then, increasingly more complex circuits have been engineered…” – Synthetic Biology Devices and Circuits for RNA-based ‘Smart Vaccines’: A Propositional Review. January 2015\nDoes this type of gene therapy alter one’s DNA?  Again, consider this NYT piece and words of the people developing this technology.\n“I.G.T. (immunoprophylaxis by gene transfer) is altogether different from traditional vaccination. It is instead a form of gene therapy. Scientists isolate the genes that produce powerful antibodies against certain diseases and then synthesize artificial versions. The genes are placed into viruses and injected into human tissue, usually muscle. The viruses invade human cells with their DNA payloads, and the synthetic gene is incorporated into the recipient’s own DNA. If all goes well, the new genes instruct the cells to begin manufacturing powerful antibodies.” – Carl Zimmer New York Times March 2015, Protection Without a Vaccine\n“Once inside the nucleus, DNA vaccines have a risk of permanently changing a person’s DNA.” – Moderna White Paper\nIn reading through the descriptions of this emerging technology written by the very people who created them, I believe that we are now at a critical point in history—we must all decide right now what it means to be human.  And we must decide whether we trust those corralling us into accepting this type of treatment.  Consider the implications of the following statements regarding how this technology could be used:\n“A minimally invasive optogenetic technique that does not require brain implants successfully manipulated the activity of neurons in mice and monkeys…The researchers first genetically engineered neurons to produce a newly developed, extremely light-sensitive protein called SOUL. They then demonstrated that it is possible to shine light through the skull to alter neuronal responses throughout the entire mouse brain, and through a thick membrane called the dura to reach superficial regions of the macaque brain.” – Implant-free Optogenetics Minimizes Brain Damage During Neuronal Stimulation\n“It is a technology that enables researchers to stimulate cells with light, thereby allowing for the direct control of behaviour. Until now, this technique has been applied in animal research only but, as we argue, it holds promise for research in humans as well.” – Optogenetics as a neuromodulation tool in cognitive neuroscience\n“The study suggests that with an injection of a virus carrying the ChRmine gene—either through the eye socket or through veins—it’s potentially possible to control something as integral to a personality as sociability with nothing but light.” – Singularity Hub\nConcurrent with the pandemic crisis, the lockdowns, and the gene therapy solution is the Great Reset as put forward by the World Economic Forum, which is one of mouthpieces for a group of elites who seem to have a great deal of influence.  One the stated goals is to merge the physical and digital identity of every person on the planet as described here.  A strategic move is to connect this goal of digital IDs with the “pandemic” through the adoption of vaccine passports, which are now be rolled out in many countries and business sectors around the world.  Israel is leading the way where they already have a unique ID for each person…they have been able to quickly adopt a “vaccine passport” system.  If a person has been vaccinated, the verified digital system will indicate positive vaccine status.  Hotels, restaurants, airlines, entertainment venues only allow the vaccinated access to services.  Some places of employment will also use it.  See here for brief description of Israel’s digital vaccine passport system.  If we allow it, this type of system will be implemented in the US, Europe and eventually everywhere else. \nIn parallel, all major central banks of the world are developing block-chain digital currencies. See here for some information on the implementation of digital currencies.  I believe these parallel developments will eventually be merged.  Independent researcher Alison McDowell has integrated seemingly unrelated technological developments that, if taken together, offer a mosaic of how the Great Reset will play out.  It’s not a pretty picture. You will learn much if you listen to this interview.\nSummary:\n    1. Pandemic was declared and supported with false data on COVID infections and fatalities.\n    2. Lockdowns were imposed in many countries, again justified with false data on COVID infections and fatalities.\n    3. Severe human and economic consequences from lockdowns ensued resulting in $ trillions in federal spending and borrowing, money printing, millions of lost jobs, tens of thousands of lost businesses, increased suicide and alcohol/drug fatalities, domestic abuse, and the death of more than 200,000 children in the developing world, etc.\n    4. Information about safe and effective alternative treatments such as HCQ and ivermectin were and are suppressed in many countries.  Some doctors were even terminated for using such treatments to save lives.  The result was that many thousands of lives were unnecessarily lost to COVID.\n    5. The survival rate for those who are recorded as infected with is about 99.7% (using the false data).\n    6. An experimental gene therapy (inappropriately labeled as vaccine) was rolled out in record time under Operation Warp Speed.  The injections have led to thousands of fatalities and strange adverse health impacts.  We do not yet know the nature of the longer-run impacts from the gene therapy. Many eminent scientists have expressed serious concerns about the health impacts of the gene therapy in both the short- and longer-run.\n    7. The pharmaceutical companies are completely exempt from legal action for any damages or fatalities caused by their products, and this is especially true for products approved for use by the US government under “emergency use.”\n    8. The plans for use of the mRNA gene therapy include regular injections/updates, and these injections have the potential to change one’s DNA.\n    9. Moderna’s mRNA gene therapy is the first product it has ever produced and delivered.  Pfizer and Johnson and Johnson have engaged in criminal activity and have been convicted numerous times.  See here and here for information about past crimes.  Historically, these companies have demonstrated themselves to be corrupt.\n    10. Digital vaccine passports and other health monitoring applications are being rolled out globally.  Look to Israel for the model of what could be implemented if we allow it.  Increasing pressure will be placed on people to accept the COVID injection.  At some point, I believe these digital health/passport systems will be integrated with the new digital monetary system…again if we allow it.\nGiven this information, does it make sense for me to take the COVID injection? \nI do not consent to the COVID injection and I do not consent to digital passports and medical tyranny (and the subsequent surveillance state that logically follows).  I anticipate that this decision may be costly for me personally and for my family.\nI will do my best to help build a more human society based on core principals as outlined in the US Declaration of Independence:\nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.–That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed…\n\n[1] David O’Hagan has compiled a huge amount of information about the nature of the mRNA technology used in gene therapies now being rolled out globally.  This information is summarized at:  https://www.option3.co.uk/covid-19-injection/",
				"added": 1617027618
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 21,
				"body": "freedom... enjoy.",
				"added": 1617223689
			},
			{
				"comment_id": 22,
				"body": "independent thinking",
				"added": 1617717118
			}
		],
		"1618427843_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 23,
				"body": "the simple answer to all of this is \"self-interest\" - upon which the whole is based. Self-interest is larger than the individual in many, even most cases. Self-interest is corporate as well. Courage and fearlessness can also be seen as arrogant and reckless - the purpose is the key factor that wins hearts.",
				"added": 1618494889
			}
		],
		"1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q": [
			{
				"comment_id": 24,
				"body": "this is all about plunder, and the CCP is behind it all - either by free will, extortion or blackmail. Now that the land has been divided, there is little in place that would bring them together of common purpose. One side wants things as they have been, and the other wants complete reform, which in reality is destruction. Justice is the problem. It is corrupted and now serves those that serve themselves and those that operate through them.",
				"added": 1618495259
			}
		],
		"1618323031_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 25,
				"body": "the pollution has already been happening all these years. Tepco captures all they can, but much of it already flows into the caverns of the earth to inflict its untold and unknown damage. The poison is already diluted and continues to flow into the earth - and Japan, despite herculean efforts, has had little effect because they cannot control the contamination. The idea that they can control the contaminants both flowing and dripping into nature is marketing or even propaganda, not reality.",
				"added": 1618495623
			}
		],
		"1618367645_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 26,
				"body": "Safe seafood? What century are you living in? The waste has been dumping, leaking, dripping into nature all these years, and they have put huge effort into the task, but have failed. This is mostly due to poor planning in the first place. Who puts a nuclear plant on a beach and doesn't expect trouble? The plant design has enough trouble of its own - all to boil water.",
				"added": 1618495880
			}
		],
		"1618331544_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 27,
				"body": "The predator seeks out prey, which to the sociopath or psychopath, could be just about anyone or anything. As long as the predator remains at the top of the wave he or she is on, the predator remains just that. Politics is just the vehicle just as the corporate world can be the vehicle. They are all corporations anyway.",
				"added": 1618496143
			}
		],
		"1619297900_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": [
			{
				"comment_id": 28,
				"body": "I suspect it always has been. Many believed in an element of what appeared as truth. Covid has opened a door. Many of us have more sensitized to the media glare, especially since it is apparent that most is pure propaganda and cultural steering.",
				"added": 1619445173
			}
		],
		"1620117334_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": [
			{
				"comment_id": 29,
				"body": "As you mentioned, this is going on globally. Stand resolute and stay the course. Do what you know is right, not what the proponents of the state want for building their authority through fear.",
				"added": 1620130748
			}
		],
		"1619672454_1MSrWkSQEYGHb8PkP7joZFUaJNSdxJnuju": [
			{
				"comment_id": 30,
				"body": "Interesting. Does it have a way to search and find other people, domains?",
				"added": 1620221116
			}
		],
		"1620756113_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 31,
				"body": "Sounds like California, but could happen anywhere in the USA. We have a major problem where at least 10% of the population nationwide are at risk of being evicted because they have been allowed by the government to live rent-free at the expense of landlords or landholders. All of this was started and escalated by Covid. California has been hard hit by Covid, and as a liberal haven of government, the economy has been shut down. We are facing a financial dustbowl.",
				"added": 1620823090
			},
			{
				"comment_id": 32,
				"body": "> [markinformer](#comment_31_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4): Sounds like California, but could happen anywhere in the USA. We have a major problem where at least 10% of the population nationwide are at risk of being evicted because they have been allowed by the government to live rent-free at the expense of landlords or landholders. All of this was started and escalated by Covid. California has been hard hit by Covid, and as a liberal haven of government, the economy has been shut down. We are facing a financial dustbowl.\n\nNational eviction ban remains in effect as government appeals ruling. https://www.cnbc.com/2021/05/06/eviction-ban-remains-in-effect-as-government-appeals-ruling.html",
				"added": 1620823298
			},
			{
				"comment_id": 33,
				"body": "> [markinformer](#comment_31_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4): Sounds like California, but could happen anywhere in the USA. We have a major problem where at least 10% of the population nationwide are at risk of being evicted because they have been allowed by the government to live rent-free at the expense of landlords or landholders. All of this was started and escalated by Covid. California has been hard hit by Covid, and as a liberal haven of government, the economy has been shut down. We are facing a financial dustbowl.\n\nStriking down of eviction moratorium puts pressure on governments to deliver tens of billions of dollars in promised rental aid  https://ktla.com/news/nationworld/striking-down-of-eviction-moratorium-puts-pressure-on-governments-to-deliver-tens-of-billions-of-dollars-in-promised-rental-aid/ - Ultimately, the government will sacrifice the people it promised to help.",
				"added": 1620823471
			},
			{
				"comment_id": 36,
				"body": "> [walmartguy](#comment_1_1MTxPGn4HFD7gwYcCzyxycftPtkCNSzJZU): all homelessness could be solved if we designated a certain amount of land per county basically free from zoning laws/ highly relaxed zoning for the poor. Poor people could afford roughly 30-50k mortgage over 10 years for just a plot of land with septic+outhouse, and then live in their car or something on the land. With a PHEV poors could live in them and use a small power hookup to run a/c 24/7. counties get bitchy if you even want to set up a trailer in the wrong place, so this will never happen.\n\nWe can form the best of plans and ideas, but some people like to be homeless.",
				"added": 1621594030
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 34,
				"body": "> [thefather](#comment_1_1QF6hFgijw5BqUeyY9hRPmH7qxcaRvgCyM): Why would you not want to be vaccinated? The vaccines are safe and highly effective. Pfizer and Moderna are even effective against the two most common variants (British and South African). mRNA technology cannot modify your DNA as humans do not have the reverse transcriptase enzyme. No fetal cells were involved in the production of the COVID-19 vaccines, either.\n\nYou do sound like my dad.",
				"added": 1620824803
			},
			{
				"comment_id": 35,
				"body": "For a while the morons put it out for public consumption on the internet. It's still out there somewhere. You just need to find it. Why use a certificate. Just use your mouth (say it and it is true like the political morons) and use natural solutions to prevent a virus. Then you won't need a vaccine or any of their BS. http://127.0.0.1:43110/18MrqieNkfZpBwV8i4eRAwkrSpC4EToWYm/",
				"added": 1621085055
			}
		]
	},
	"comment_vote": {
		"22_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2": 1
	}
}