{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "No lo arregles si no está roto, no necesitamos alimentos transgénicos",
			"body": "Podemos estar debatiendo meses sobre las maldades o bondades de los alimentos transgénicos, podemos hablar conceptaulmente o podemos hablar de la realidad de lo que la biotecnología está haciendo realmente con los campos, nuestra salud y la economía, lamentablemente no faltan mercenarios ni simples idiotas que actuarán y hablarán a favor de esta herramienta del crimen en que se ha convertido la ingeniería genética en particular la dirigida a la producción de alimentos.  \n\nPero hoy no, hoy seremos radicales, buscaremos la raíz de la cosa y luego vemos. El principal argumento de los criminales que pretenden convertirnos en sus vasallos a base de apropiarse de nuestra soberanía alimentaria es que “los alimentos trasngénicos son necesarios para combatir el hambre producido por la creciente población mundial y el cambio climático.”  Dicen que hay que solucionar problemas de productividad. \n\nEsta es la gran falacia, la misma falacia que sustentó la llamada revolución verde que a partir de la década de los 60 del siglo xx comenzó con una muy mala industrializción de la agricultura, esta “revolución” propagada por la fundación Rockefeller fue nefasta para la economía y el medio-ambiente al concentrar riquezas y desertificar suelos.  \n\n¿Pero como carajo piensan solucionar un problema que no existe? Si, hay hambre en el mundo, pero no hay falta de alimentos, no hay problema de productividad alguno excepto los que están creando las malas praxis biotecnologicas, se destruyen grandes cantidades de cosechas para “normalizar\" los precios, desde los ochenta en Europa se está destruyendo las producción de alimentos a base de subvenciones para no producir y   persecución a la pequeña producción de autoconsumo e intercambio, los barcos pesqueros a causa de reglamentaciones y valoraciones, llevan al mercado menos de lo que descartan. Se trata de un problema de reparto de recursos, se trata de un problema socio-económico-político, pero no es un problema tecno-productivo, es fácil demostrar que los alimentos transgéncios no solucionarán el problema ya que el problema de productividad no existe, se trata de una clásica acción mercadotécnica, crear un problema o la sensación de que el problema existe para vender una solución, pero esta vez el precio es la soberanía alimentaria, es la libertad, es la vida. ¿estás dispuesto a pagar?",
			"added": 1477260115
		},
		{
			"topic_id": 2,
			"title": "He creado (clonado) un blog ¿ahora como lo administro?",
			"body": "Eso... lo del título, no hay más pregunta :)  ¿como vuelco contenido? ¿Como lo modifico? Me parece estar a mediados de los 90 cuando la web era nueva para mi, toda internet en realidad.",
			"added": 1477295996
		},
		{
			"topic_id": 3,
			"title": "¿tenemos alguna herramienta para combatir el spam, trolling, etc?",
			"body": "Eliminar contenidos de un sistema p2p es conceptualmente imposible,  si se pudiese eliminar un usuario o parte de su contenido esto no sería lo que es, pero.... una herramienta de bloqueo de usuarios tanto desde una identidad o bien para un sitio en particular si ha de ser posible.\n\n¿Tenemos algún mecanismo?",
			"added": 1477478601
		},
		{
			"topic_id": 4,
			"title": "No me carga zerotube",
			"body": "Zerotube se me queda en una página con el logotipo y diceindo buscando partes, asi eternamente ¿a todos les pasa?",
			"added": 1478025849
		},
		{
			"topic_id": 5,
			"title": "¿Quien tiene experiencia con ZeroWiki?",
			"body": "Estoy colaborando con ZeroWiki ES  http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/  y además cloné una para hacer una wiki sobre soberanía alimentaría http://127.0.0.1:43110/1WXrbTh9HiJoemqBWxfLc1h7zHF1mHjfb/  pero resulta que no tengo ni idea de como crear nuevas páginas y como se agregan al índice :(",
			"added": 1478121698
		},
		{
			"topic_id": 6,
			"title": "Los proxys que funcionan hoy",
			"body": "https://zeronet.korso.win\nhttps://zero.btnova.org\n\nSe está haciendo complicado hacer accesibles los contenidos de ZeroNet a los forasteros, no se si son problemas particulares de quienes crean y mantienen proxys o es que hay algún problema sistemático, me gustaría conocer la opinión de quienes mantengan uno o sepan algo al respecto.\n\nTambién podemos aprovechar este post para informarnos mutuamente de los que funcionan.",
			"added": 1484241205
		}
	],
	"topic_vote": {
		"4_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": 1,
		"7_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 1,
				"body": "Hola, es la primera vez que uso zeronet, no tengo ni idea pero el concepto es mucho mś que interesante.",
				"added": 1477174521
			},
			{
				"comment_id": 4,
				"body": "**A ver como va aquí el tema enlaces, marcdown, etc:**\n\nEnlace al blog de Eibriel sin formato: https://zeronet.korso.win/1EMcXwk7qQdY3pbj86A98gZHjDBNRrscdL/?Home\n\nEnlace a zeroChatEs en marckdown: [ZeroChat ES](http://127.0.0.1:43110/18nQPR4TCM4tQ8L7fm6dX6SGXLsj7wa8sv/ \"Title\")\n\nUna imagen: ![caraperro](http://juanruetter.piesnegros.org/files/2010/04/coco.jpg)",
				"added": 1477248033
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 2,
				"body": "creo que el pefil es este http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i/1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i/juansantiago@zeroid.bit",
				"added": 1477175766
			}
		],
		"1_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 3,
				"body": "La verdad... no lo se, pero se lee mucho últimamente sobre esto.",
				"added": 1477223761
			}
		],
		"4_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": [
			{
				"comment_id": 5,
				"body": "> [aoi](#comment_10_13NJuU9nw3cFSVoETCkN6BCv5s5v5V2ngA): El problema es que usa webtorrent para ver los videos, pero los trackers que utiliza siempre marcan a los archivos como direccion invalida.Traduccion: Aun esta en desarrollo, ya que podria haber contenido pero no hay manera de mantenerlo en linea de manera constante.Puedes escribir cualquier palabra en la barra de busqueda en ZeroTube y vas a encontrar como 6 videos y ninguno de ellos tiene peers. Subi uno para probar y a pesar de que lo estoy compartiendo, no hay manera de verlo por lo que te comento.\n\ngracias por tu respuesta, estaremos antentos y a ver si podemos hacer algo",
				"added": 1478096509
			}
		],
		"1_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": [
			{
				"comment_id": 6,
				"body": "> [aoi](#comment_9_13NJuU9nw3cFSVoETCkN6BCv5s5v5V2ngA): Uno esperaria que el problema de los transgenicos llegase solo a lo que comentas en relacion a la soberania alimentaria y a la distribucion de los alimentos.\n> Yo creo que el verdadero problema son las externalidades:\n> \n> El uso de cultivos resistentes a plaguicidas incentiva el uso desmedido de estos, lo cual ocasiona problemas  en el suelo, en los mantos acuiferos y en la salud de los animales que habiten cerca de estos cultivos, incluidos los hombres.\n> \n> El uso de cultivos con BT no solo afecta a las plagas, tambien afecta a polinizadores, en especial a las abejas.\n> \n> Perdida de variabilidad genetica al no haber mas que una sola variedad y una sola especie de cultivo, sin mencionar que esto solo hace que dichos cultivos sean objetivos de otras plagas (hongos, nematodos, insectos resistentes)\n> \n> \n> A esto se le puede añadir la campaña descarada que existe tanto en los medios de comunicacion como en las universidades para desacreditar, sobornar o callar las voces de los que los critican.\n> Lo unico que cre que nos puede salvar de que esto se convierta en la norma es la misma Europa. Si la union europea cede a la presion de Montsanto, o permiten las fusiones  de Bayer con Montsanto, o la de  DuPont y Dow Chemical, no habra ningun otro poder que lo cuestione, y nadie le dice que no a Estados Unidos.\n\nEstoy 100% de acuerdo con lo que dices, solo que esta vez quería apuntar a la raiz de la cosa, no son necesarios, no solo no se puede solucionar un problema que no existe sino que  está claro que hacen el efecto contrario al promocionado.",
				"added": 1478096766
			}
		],
		"2_13bJknLwBVJ4nmEHLqovNhzyD8wVA6ez6C": [
			{
				"comment_id": 7,
				"body": "¿Hablamos sobre decrecimiento?",
				"added": 1478121831
			}
		],
		"5_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": [
			{
				"comment_id": 8,
				"body": "Ya vi como!!! luego publico.",
				"added": 1478129228
			},
			{
				"comment_id": 9,
				"body": "> [ekodjtal](#comment_1_1Pg3bGXNVV9uB2HnirHFU2vaJLvmK77Dox): puedes escribir [[titulo de tu nueva pagina]] para crear una nueva pagina, se agregan al indice automaticamente\n\nGracias :)",
				"added": 1478129254
			}
		],
		"6_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 10,
				"body": "Ya sabés que no soy programador pero se me ocurre que: \nCambiando la ip interna que usa zeronet (http://127.0.0.1:43110) por otra tendrás una red privada, luego ¿se trata de que no se pueda conectar semillas libremente? Tal vez como en torrent, trackers con pasword",
				"added": 1478353354
			},
			{
				"comment_id": 11,
				"body": "> [juansantiago](#comment_10_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): Ya sabés que no soy programador pero se me ocurre que:Cambiando la ip interna que usa zeronet (http://127.0.0.1:43110) por otra tendrás una red privada, luego ¿se trata de que no se pueda conectar semillas libremente? Tal vez como en torrent, trackers con pasword\n\ncorrijo: cambiando esa ip, tendrás una red distinta, no una red privada.",
				"added": 1478353428
			}
		],
		"2_1HQ8XgxtabgN9qLhPvbwWzUQsoTPRsmeLs": [
			{
				"comment_id": 12,
				"body": "Connecting...\nNo peers found\ncontent.json download failed\n\nDale una refirma y republicar :)",
				"added": 1478793321
			}
		],
		"1_1GsrTPLoAfhqn8Ds4DDNjYRzupw5inbm9": [
			{
				"comment_id": 13,
				"body": "Por el momento me las estoy arreglado con la wiki, lo bueno de la wiki es que permite organizar bien y fácil, lo malo que por el momento no tiene buscador \n\nhttp://127.0.0.1:43110/1WXrbTh9HiJoemqBWxfLc1h7zHF1mHjfb/?Page:libros\n\nhttp://127.0.0.1:43110/1WXrbTh9HiJoemqBWxfLc1h7zHF1mHjfb/?Page:la-revolucin-de-una-brizna-de-paja\n\nfalta organizar pero.... \n\nLuego, si es solo para organizar biblioteca, tenemos: blogs que permiten etiquetas, foro con buscador y etiqueta, el blog sería una biblioteca administrada por un responsable, el foro colectiva.",
				"added": 1479564968
			}
		],
		"7_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 14,
				"body": "Explicación o tuto about?",
				"added": 1482241049
			}
		],
		"6_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": [
			{
				"comment_id": 15,
				"body": "https://bit.no.com:43110 ya funciona",
				"added": 1484335550
			}
		]
	},
	"comment_vote": {
		"10_1C1pqw3EhTRk5ciHHPB283xu1EUxsGhCpo": 1
	}
}