{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1612387614,
			"title": "Could someone send me a zeromail testmail please?",
			"body": "I have only tested zeromail by sending a mail to myself and I do not have any other contacts. could you please send me a testmail and I will reply.\n\nname is asdf1111\n\nthanks",
			"added": 1612387613
		},
		{
			"topic_id": 1612387935,
			"title": "is KxoId working for anyone? I tried registering but it times out",
			"body": "",
			"added": 1612387933
		},
		{
			"topic_id": 1612626557,
			"title": "List of zeromail identities",
			"body": "I noticed that there is a file archived.json in the files tab in Zeronet which is from zeromail. Does that contain the complete list of zeromail accounts and if so, doesn't that open a spamming problem since one could just send a mail to all known identities?",
			"added": 1612626554
		}
	],
	"topic_vote": {
		"1612299574_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": 1,
		"1612184585_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1612387614_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 1,
				"body": "that is not correct, there is no valid account for trump on Parler",
				"added": 1610321069
			}
		],
		"1610847074_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [
			{
				"comment_id": 2,
				"body": "i am very much interested in secure chatting systems, e.g. i am trying matrix.org now and obviously zeronet. if you like send me a message on zeromail as asdf1111",
				"added": 1612056132
			},
			{
				"comment_id": 3,
				"body": "> [oldone](#comment_9_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp): I have been wanting to get into IRC but don't really know where to start\n\nIf you want a irc-like experience but more security, you can give matrix.org a try",
				"added": 1612056212
			}
		],
		"1612049204_17DwXt69rTzQ2mdL3LPLSW9rfNWNQgKcxt": [
			{
				"comment_id": 4,
				"body": "dang! the server gives error 500",
				"added": 1612056885
			},
			{
				"comment_id": 5,
				"body": "the page says you need version 0.6.6 but only 0.6.5 is released on the retroshare website\ndo you have to get a pre-release version for this?",
				"added": 1612116320
			},
			{
				"comment_id": 6,
				"body": "Ok, the site is now giving an error message that it does not support lower than 0.6.6\n\n**Couldn't accept ID: wrong ID or old certificate (Retroshare 0.6.6+ required)**",
				"added": 1612298201
			},
			{
				"comment_id": 7,
				"body": "> [megalodon](#comment_7_19a2pUJoCuyjWucc83VoUXjNLHoYNZf2Ey): why would you connect to a retroshare server, that does not allow i2p or tor? thatś pretty unsecure!\n\nthat does not really matter for retroshare, the communication is secured by the certificates, it is not anonymous though since it publishes the ip",
				"added": 1612298329
			},
			{
				"comment_id": 8,
				"body": "> [rnb](#comment_16_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E): I'm asking that myself too\n\nbtw, if you want to connect, send me a zeromail message at asdf1111, we can do some testing",
				"added": 1612298418
			}
		],
		"1612184585_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 9,
				"body": "how does that relate to e.g. tux?",
				"added": 1612298525
			},
			{
				"comment_id": 14,
				"body": "ok, it got on, this looks quite ok for a group chat it is good\n\nplease all come and join",
				"added": 1612387101
			}
		],
		"1612299574_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": [
			{
				"comment_id": 10,
				"body": "well, it would be safe if it would use a hash that can be verified on the developer page",
				"added": 1612300522
			},
			{
				"comment_id": 11,
				"body": "> [hatebot](#comment_3_13kyRkukBSEXhXA3w72Gv1mo5n7Pgtuqg5): Well, he has a point. If the hashes are correct, it doesn't really matter where you got the file from.(I just don't see why you wouldn't download it from the official sites at decent speed..)\n\nI would guess to prove that the network works\ni used to download libreoffice from bittorrent out of principle just to prove that you can use it for normal downloads",
				"added": 1612386403
			},
			{
				"comment_id": 12,
				"body": "> [startrek](#comment_6_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE): I understand that source of a file doesn't matter if the checksum match. But when choosing between downloading from official server at decent speeds v/s doing from a third party protocol that's still in beta at crawling speeds; the former is the logical site.\n\nthat reminds me of the because it is there story. the guy who tried to climb mount everest in the 20s was asked why he would want to climb it and he answered because it is there. we are could be downloading linux from zeronet to prove that it works.\ni have not downloaded anything yet though",
				"added": 1612386597
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 13,
				"body": "lbry.tv is not a useful source for medical information, it is mostly conspiracy bullshit\nand videos that include please share in the title are even worse",
				"added": 1612387023
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 15,
				"body": "> [franksky](#comment_7_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): How about disorder? it seems to be the  most popular communication app in the Darknet, though the end-to-end encryption is not supported.\n\non darknet e2e may not be necessary when the communication is based on host certificates (though it would be better to have it just the same)",
				"added": 1612387189
			},
			{
				"comment_id": 16,
				"body": "> [startrek](#comment_2_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE): I have seen quite some communities using Matrix for communication. As for Briar, I am aware of it but it's user base is still quite low, isn't it? Jami is new for it, will see how it is.\n\nI have recently started using matrix.org again after I tested it maybe 2016 for the first time. it is quite good, the Element clients are great\nI am on poal.co and use the site chat.poal.co they have a nice #general chat thought most users are racist assholes, i should have not joined the site",
				"added": 1612387275
			},
			{
				"comment_id": 17,
				"body": "> [jager](#comment_63_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Always such a bizarre argument to me. Computers are used by terrorists to organize things. Take away all computers.\n\nthere was an advert years ago from CISCO which claimed that 80% of all internet traffic goes through routers from CISCO. This would mean that 80% of all terrorist traffic goes through CISCO, so they must be a terrorist organisation",
				"added": 1612387351
			},
			{
				"comment_id": 18,
				"body": "> [franksky](#comment_7_1FfPxzPuUbAk94WFtmoGd8jY3wusv8NX1b): How about disorder? it seems to be the  most popular communication app in the Darknet, though the end-to-end encryption is not supported.\n\nWhich one is disorder?",
				"added": 1612387425
			}
		],
		"1612387614_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN": [
			{
				"comment_id": 19,
				"body": "also, if anybody wants to try retroshare, send your certificate and we can connect",
				"added": 1612387643
			}
		],
		"1612703862_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 20,
				"body": "i have never used it, sorry",
				"added": 1612723364
			}
		],
		"1612901583_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": [
			{
				"comment_id": 21,
				"body": "is that a hash address or some kind of code?",
				"added": 1612902571
			}
		]
	},
	"comment_vote": {
		"16_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E": 1,
		"5_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN": 1,
		"6_13JWeXQebtUHRPphNJ5EpjodwKGViDkaEE": 1,
		"797_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}