{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1618412687,
			"title": "Nancy Pelosi's Husband Uses Call Options To Buy Microsoft Ahead Of Big Govt Contract >> SEND THE POLICE !!!!! ARREST !!!",
			"body": "a nigga smokes a doobie, and it's BAGDAD, now this bitch and her whorish husband plunder america, finance pedo stuff, buy land before public transport hub construction... and I guess cheat election, protect bill clinton...\n\nand what the fuck is doing the police? killing blacks?\n\nWHERE IS THE JUSTICE !!! \n\nonce the Secret service is killed, moving to the DoJ... \n\nhttps://www.zerohedge.com/markets/nancy-pelosis-husband-uses-call-options-buy-microsoft-ahead-big-govt-contract",
			"added": 1618412686
		}
	],
	"topic_vote": {},
	"next_comment_id": 31,
	"comment": {
		"1618267083_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 1,
				"body": "> [febriansasi](#comment_3_1P7A6cCSYV4EdGzGfKT64SLp2FGevvmgZ9): I am a muslim, but for me they bring chaos to muslim society. They claim they follow the teach of prophet Muhammad (Peace be Upon Him) but actually they only follow their own interpretation. Their history are close with the raise of SA kingdom. When they join with british to revolt against Utsmani.\n\nHi sir, Thank you for your reply and perspective ! this is a free speech space with muting capabilities, so always feel free to express your current ideas.\n\nMay I ask who is Utsmani, what is so important about him (I guess) and I never heard about him ever.\n\nWhat is (are) the points of interpretations in which you are in conflict with them?\n\nI fully support the total independence of the Arab world ! \n\nFinally I don't understand your chaos point... Chaos can only emerge on fertile ground, from what I see as an outsiders, KSA and others nearby are very stable, peaceful, prosperous, creative and innovative societies... maybe you could shed some light too on this remark.\n\nand as a side note, where are you from?",
				"added": 1618412567
			}
		],
		"1618386482_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 2,
				"body": "mitch has only 34 millions, while nancy has over 100m... mitch is a small fry.\n\nhttps://www.zerohedge.com/markets/nancy-pelosis-husband-uses-call-options-buy-microsoft-ahead-big-govt-contract",
				"added": 1618412774
			},
			{
				"comment_id": 3,
				"body": "ahh me neither I can't find the speech... I mean it appears to be another great one !!!",
				"added": 1618412836
			}
		],
		"1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q": [
			{
				"comment_id": 4,
				"body": "I am so clement today, I propose to the daughter of pelosi, to kill her parents... otherwise... nothing... just an offer (why? because she is the only one who dared to accuse and expose bill clinton publicly, this worthless subhuman still protected by the secret services, core enemies of mankind).",
				"added": 1618412926
			},
			{
				"comment_id": 5,
				"body": "I want an execution wall for both the pelosi... not some covert shit... FULL SCALE, BIGGEST SHOW ON EARTH... the LIVE EXECUTION OF AMERICAN DOMESTIC ENEMIES.",
				"added": 1618413039
			},
			{
				"comment_id": 6,
				"body": "but the girl gets two slips, the bill for the bullets used to kill her parents. then will see what she can keeps... nothing more than george flyod ever had. It seems fair, she lives, she can change name and start a new life... or she wants to play like dead daddy and mommy?",
				"added": 1618413113
			},
			{
				"comment_id": 7,
				"body": "by ar15s !",
				"added": 1618413143
			},
			{
				"comment_id": 8,
				"body": "and now the tick tock programs, those who should arrest him and her NOW, are next in line for the execution... when will the cutting time be? more kills... I like that...",
				"added": 1618413196
			},
			{
				"comment_id": 9,
				"body": "but before execution, DATA Extractions... all will be known...",
				"added": 1618413231
			},
			{
				"comment_id": 10,
				"body": "I am curious at which speed the most recent mind reading devices can extract a life of corruption and crimes...\n\nwas nancy a sex toy of the \"kennedy who cheated in chirak\"?",
				"added": 1618413287
			},
			{
				"comment_id": 11,
				"body": "and the little boy of the state of virgina (200+ millions) wanted to take our ARs? his assets will be used to pay a little bit of the debt of this state... money recovery program, active.",
				"added": 1618413349
			},
			{
				"comment_id": 18,
				"body": "if could find the speech transcript of pedotrump before congress that she torn appart,.. that's one what the bill for their executions will be quickly written on it... and send to the daughter... funny isn't it?",
				"added": 1618414910
			},
			{
				"comment_id": 19,
				"body": "I am curious what will be the price, no gov over pricing... market price...",
				"added": 1618414971
			},
			{
				"comment_id": 20,
				"body": "zzzz",
				"added": 1618513846
			},
			{
				"comment_id": 21,
				"body": "zzzZZZzzzZZZZzzzzZZZZZzzzZZZZ",
				"added": 1618513862
			},
			{
				"comment_id": 22,
				"body": "cs;)",
				"added": 1618513867
			},
			{
				"comment_id": 23,
				"body": "camping101.",
				"added": 1618513877
			},
			{
				"comment_id": 26,
				"body": "she is a teaser : https://www.zerohedge.com/markets/im-street-fighter-nancy-pelosi-says-capitol-rioters-would-have-had-battle-their-hands-if",
				"added": 1618514014
			},
			{
				"comment_id": 27,
				"body": "yeah yeah... try not to fracture your bones female...",
				"added": 1618514028
			}
		],
		"1617873274_1Nv7HrYvwPjyGyx6iUG7KZrj4TNduUBcah": [
			{
				"comment_id": 12,
				"body": "> [6283822](#comment_89_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): i was currently drafting a next gen p2p network. code is not released yet but soon will be published with specs and white paper.link useful to track project https://github.com/decentnetwork\n\nwith censorship embedded or individual moderation, like here, aka muting?",
				"added": 1618413451
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 13,
				"body": "Why don't you go do a tour of pelosi assets? that's I hate you, believe in executing you all but the 2. YOU have played a yuge role in the destruction of an idea that I loved so much...\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q/Nancy+Pelosi+s+Husband+Uses+Call+Options+To+Buy+Microsoft+Ahead+Of+Big+Govt+Contract+SEND+THE+POLICE+ARREST\n\nyes, we know... you will stone wall us, gaz light us, lie to us, to protect them to get a fee from those they employ... aka corporate cheats, pay the congress to get their regulatory capture laws (cronies capitalism) and then those cheating corporation pay you their fees in ads...\n\nyou can't imagine how I hate... and worst how you have preyed on those gullible fat idiots, who TRUSTED YOU, you D.C. will they ever learn? will they get ANGRY? but not angry mad angry... I hope so...\n\nand they chant... KILL THEM KILLL THEM KILLLL THEM...\n\nand served they will.",
				"added": 1618414478
			},
			{
				"comment_id": 14,
				"body": "it would be even cooler to broadcast your executions on your systems :).",
				"added": 1618414499
			},
			{
				"comment_id": 15,
				"body": "and we have already the two for the live of their lives !",
				"added": 1618414532
			},
			{
				"comment_id": 16,
				"body": "wolf blitzer, will be executed not with an ar... but with an abram... we want to see the shot... head shot at close range...",
				"added": 1618414614
			},
			{
				"comment_id": 17,
				"body": "> [pelosis4jail](#comment_16_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q): wolf blitzer, will be executed not with an ar... but with an abram... we want to see the shot... head shot at close range...\n\nand as i like little challenge, it will be the oldest munition... the next one to be shuffled at the time... heheheh.",
				"added": 1618414794
			}
		],
		"1618389476_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 24,
				"body": "ahh iran... persia... if only you could wake up...",
				"added": 1618513908
			},
			{
				"comment_id": 25,
				"body": "you could learn from china :)... you have the best teacher known in the universe at your disposal to improve... don't waste this once in a civilization chance...",
				"added": 1618513941
			}
		],
		"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 28,
				"body": "https://www.zerohedge.com/political/ice-pays-352day-199-days-house-1239-illegal-families",
				"added": 1618514069
			}
		],
		"1616149451_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 29,
				"body": "https://www.zerohedge.com/political/bunch-black-men-have-been-attacking-asians-says-cnn-director-during-undercover-tinder",
				"added": 1618514090
			}
		],
		"1514127848_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 30,
				"body": "nothing else to say.",
				"added": 1618514110
			}
		]
	},
	"comment_vote": {}
}