{
	"title": "unrealistic world",
	"description": "关于生活，关于一切。",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 22,
	"demo": false,
	"modified": 1488330941,
	"post": [
		{
			"post_id": 21,
			"title": "Your First ASP.NET Core Application on a Mac Using Visual Studio Code",
			"date_published": 1488330921.126,
			"body": "https://docs.microsoft.com/en-us/aspnet/core/tutorials/your-first-mac-aspnet"
		},
		{
			"post_id": 20,
			"title": "kindle电子书分割技巧",
			"date_published": 1487033374.442,
			"body": "\n####**工具:**Calibre\n####**插件获取:**[首选项]->[插件]->[获取新插件]->搜索\"EpubSplit\"->[安装]\n####**使用方法:**[选中书籍]->点击[EpubSplit]->选中想要单独分割的章节->点击[new book]->编辑元数据->[确定]->done!\n\n还是非常简单的.\n"
		},
		{
			"post_id": 19,
			"title": "在线激活IntelliJ IDEA",
			"date_published": 1486970298.329,
			"body": "地址:[http://idea.iteblog.com/](http://idea.iteblog.com/)\n打开地址在线生成key\n或者用服务器激活,服务器地址填写:[http://idea.iteblog.com/key.php](http://idea.iteblog.com/key.php)"
		},
		{
			"post_id": 18,
			"title": "令人失望的改编-评<我不是潘金莲>电影",
			"date_published": 1485328329.642,
			"body": "![image alt](img/p2416040755.jpg)\n圆形构图，海报的感觉是极好的。但是用在电影镜头语言中，总感觉像是在偷窥。\n\n到北京换成了方的，规矩、方圆的意境是挺好的，但是就是有种违和感，像是在用14寸大屁股显示器看电影。太过追求所谓的艺术效果。\n\n因为刘震云豫北人，我读刘震云的小说，脑子里一只都是用河南话脑补对白。电影里不知道哪个地方方言，再加上演员太过刻意的模仿，听的真的很令人抓狂。\n\n再说剧情，原著里假离婚仅仅因为有了孩子，秦玉河怕丢了工作。电影里先是说为了分一套县城的房子，最后又说是为了多要一个孩子。虽然有讽刺现实的味道，但李雪莲的本质就变了。由本身的淳朴、愚昧的乡村妇女，变成了势利、顽固不化的底层小人。电影的基调也就变得low了起来。\n\n李雪莲的故事，只是原著中的序言，这部号称最长序言的小说，私以为最后两万多字的正文，才是最饱含对上访最荒诞不经的讽刺，可惜电影给舍弃了。\n\n至于所谓的对官场的讽刺，电影里的演绎，我提都不想提。\n\n失望。"
		},
		{
			"post_id": 16,
			"title": "七月书单",
			"date_published": 1470382117.068,
			"body": "超忙的七月，为了省心看的小说比较多，不用思考，按摩脑筋。\n\n七月书单：\n\n《黑暗精灵三部曲》，从小就是奇幻题材的忠实粉丝，不过被遗忘国度系列一直没能看下来，这次补全遗憾了。\n\n伊坂幸太郎系列：《重力小丑》、《金色梦乡》、《奥杜邦的祈祷》：读完伊坂幸太郎的几本成名作，彻底的喜欢上了这个作家，下一个目标就是读完能找到的所有他的书吧。\n\n《魔兽电影小说》、《最后的守护者》：看完电影，然后看了官方小说，果然是电影的问题，小说里该交代的细节都交代了，电影里拍不出来也不怪别人说是烂片。顺便又看了一遍《最后的守护者》对比了下两者的区别。还是当做不同平行宇宙的事情吧。\n\n《我不是潘金莲》，刘震云的每本书我都能用河南话读出来，也着实有趣。\n\n《罗马人的故事1：罗马城不是一天建成的》，当做小说来看了，对罗马的描述确实很殷实。\n\n《Aangularjs in action》，工作需要翻来当参考的技术书。其实这样的一个例子走下来的对于刚毕业的挺有用的，对于有基础，想要迅速了解这个技术的，不太合适。\n\n《正方形的忧愁》，正方形的构图，我也一直很喜欢，但是这本书的文字不是太喜欢了。台湾人的调调，有时候和大陆的风格还确实不太一样。\n\n《观念的水位》，最近读了好几本刘瑜的书，可能有点审美疲劳了，这本的感觉不太好。"
		},
		{
			"post_id": 15,
			"title": "鲁迅——读书杂谈",
			"date_published": 1469614865.384,
			"body": "    【读到鲁迅先生的《读书杂谈》，颇有感触，转录于此，供以学习。】\n\n正文：\n因为知用中学的先生们希望我来演讲一回，所以今天到这里和诸君相见。不过我也没有什么东西可讲。忽而想到学校是读书的所在，就随便谈谈读书。是我个人的意见，姑且供诸君的参考，其实也算不得什么演讲。 \n\n---\n\n说到读书，似乎是很明白的事，只要拿书来读就是了，但是并不这样简单。至少，就有两种：一是职业的读书，一是嗜好的读书。所谓职业的读书者，譬如学生因为升学，教员因为要讲功课，不翻翻书，就有些危险的就是。我想在坐的诸君之中一定有些这样的经验，有的不喜欢算学，有的不喜欢博物，然而不得不学，否则，不能毕业，不能升学，和将来的生计便有妨碍了。我自己也这样，因为做教员，有时即非看不喜欢看的书不可，要不这样，怕不久便会于饭碗有妨。我们习惯了，一说起读书，就觉得是高尚的事情，其实这样的读书，和木匠的磨斧头，裁缝的理针线并没有什么分别，并不见得高尚，有时还很苦痛，很可怜。你爱做的事，偏不给你做，你不爱做的，倒非做不可。这是由于职业和嗜好不能合一而来的。倘能够大家去做爱做的事，而仍然各有饭吃，那是多么幸福。但现在的社会上还做不到，所以读书的人们的最大部分，大概是勉勉强强的，带着苦痛的为职业的读书。  \n        \n现在再讲嗜好的读书罢。那是出于自愿，全不勉强，离开了利害关系的。——我想，嗜好的读书，该如爱打牌的一样，天天打，夜夜打，连续的去打，有时被公安局捉去了，放出来之后还是打。诸君要知道真打牌的人的目的并不在赢钱，而在有趣。牌有怎样的有趣呢，我是外行，不大明白。但听得爱赌的人说，它妙在一张一张的摸起来，永远变化无穷。我想，凡嗜好的读书，能够手不释卷的原因也就是这样。他在每一叶每一叶里，都得着深厚的趣味。自然，也可以扩大精神，增加智识的，但这些倒都不计及，一计及，便等于意在赢钱的博徒了，这在博徒之中，也算是下品。  \n        \n不过我的意思，并非说诸君应该都退了学，去看自己喜欢看的书去，这样的时候还没有到来；也许终于不会到，至多，将来可以设法使人们对于非做不可的事发生较多的兴味罢了。我现在是说，爱看书的青年，大可以看看本分以外的书，即课外的书，不要只将课内的书抱住。但请不要误解，我并非说，譬如在国文讲堂上，应该在抽屉里暗看《红楼梦》之类；乃是说，应做的功课已完而有余暇，大可以看看各样的书，即使和本业毫不相干的，也要泛览。譬如学理科的，偏看看文学书，学文学的，偏看看科学书，看看别个在那里研究的，究竟是怎么一回事。这样子，对于别人，别事，可以有更深的了解。现在中国有一个大毛病，就是人们大概以为自己所学的一门是最好，最妙，最要紧的学问，而别的都无用，都不足道的，弄这些不足道的东西的人，将来该当饿死。其实是，世界还没有如此简单，学问都各有用处，要定什么是头等还很难。也幸而有各式各样的人，假如世界上全是文学家，到处所讲的不是“文学的分类”便是“诗之构造”，那倒反而无聊得很了。  \n        \n不过以上所说的，是附带而得的效果，嗜好的读书，本人自然并不计及那些，就如游公园似的，随随便便去，因为随随便便，所以不吃力，因为不吃力，所以会觉得有趣。如果一本书拿到手，就满心想道，“我在读书了！”“我在用功了！”那就容易疲劳，因而减掉兴味，或者变成苦事了。  \n        \n我看现在的青年，为兴味的读书的是有的，我也常常遇到各样的询问。此刻就将我所想到的说一点，但是只限于文学方面，因为我不明白其他的。  \n        \n第一，是往往分不清文学和文章。甚至于已经来动手做批评文章的，也免不了这毛病。其实粗粗的说，这是容易分别的。研究文章的历史或理论的，是文学家，是学者；做做诗，或戏曲小说的，是做文章的人，就是古时候所谓文人，此刻所谓创作家。创作家不妨毫不理会文学史或理论，文学家也不妨做不出一句诗。然而中国社会上还很误解，你做几篇小说，便以为你一定懂得小说概论，做几句新诗，就要你讲诗之原理。我也尝见想做小说的青年，先买小说法程和文学史来看。据我看来，是即使将这些书看烂了，和创作也没有什么关系的。 \n\n事实上，现在有几个做文章的人，有时也确去做教授。但这是因为中国创作不值钱，养不活自己的缘故。听说美国小名家的一篇中篇小说，时价是二千美金；中国呢，别人我不知道，我自己的短篇寄给大书铺，每篇卖过二十元。当然要寻别的事，例如教书，讲文学。研究是要用理智，要冷静的，而创作须情感，至少总得发点热，于是忽冷忽热，弄得头昏，——这也是职业和嗜好不能合一的苦处。苦倒也罢了，结果还是什么都弄不好。那证据，是试翻世界文学史，那里面的人，几乎没有兼做教授的。  \n        \n还有一种坏处，是一做教员，未免有顾忌；教授有教授的架子，不能畅所欲言。这或者有人要反驳：那么，你畅所欲言就是了，何必如此小心。然而这是事前的风凉话，一到有事，不知不觉地他也要从众来攻击的。而教授自身，纵使自以为怎样放达，下意识里总不免有架子在。所以在外国，称为“教授小说”的东西倒并不少，但是不大有人说好，至少，是总难免有令大发烦的炫学的地方。  \n        \n所以我想，研究文学是一件事，做文章又是一件事。  \n        \n第二，我常被询问：要弄文学，应该看什么书？这实在是一个极难回答的问题。先前也曾有几位先生给青年开过一大篇书目。但从我看来，这是没有什么用处的，因为我觉得那都是开书目的先生自己想要看或者未必想要看的书目。我以为倘要弄旧的呢，倒不如姑且靠着张之洞的《书目答问》去摸门径去。倘是新的，研究文学，则自己先看看各种的小本子，如本间久雄的《新文学概论》，厨川白村的《苦闷的象征》，瓦浪斯基们的《苏俄的文艺论战》之类，然后自己再想想，再博览下去。因为文学的理论不像算学，二二一定得四，所以议论很纷歧。如第三种，便是俄国的两派的争论，——我附带说一句，近来听说连俄国的小说也不大有人看了，似乎一看见“俄”字就吃惊，其实苏俄的新创作何尝有人绍介，此刻译出的几本，都是革命前的作品，作者在那边都已经被看作反革命的了。倘要看看文艺作品呢，则先看几种名家的选本，从中觉得谁的作品自己最爱看，然后再看这一个作者的专集，然后再从文学史上看看他在史上的位置；倘要知道得更详细，就看一两本这人的传记，那便可以大略了解了。如果专是请教别人，则各人的嗜好不同，总是格不相入的。  \n        \n第三，说几句关于批评的事。现在因为出版物太多了，——其实有什么呢，而读者因为不胜其纷纭，便渴望批评，于是批评家也便应运而起。批评这东西，对于读者，至少对于和这批评家趣旨相近的读者，是有用的。但中国现在，似乎应该暂作别论。往往有人误以为批评家对于创作是操生杀之权，占文坛的最高位的，就忽而变成批评家；他的灵魂上挂了刀。但是怕自己的立论不周密，便主张主观，有时怕自己的观察别人不看重，又主张客观；有时说自己的作文的根柢全是同情，有时将校对者骂得一文不值。凡中国的批评文字，我总是越看越胡涂，如果当真，就要无路可走。印度人是早知道的，有一个很普通的比喻。他们说：一个老翁和一个孩子用一匹驴子驮着货物去出卖，货卖去了，孩子骑驴回来，老翁跟着走。但路人责备他了，说是不晓事，叫老年人徒步。他们便换了一个地位，而旁人又说老人忍心；老人忙将孩子抱到鞍鞒上，后来看见的人却说他们残酷；于是都下来，走了不久，可又有人笑他们了，说他们是呆子，空着现成的驴子却不骑。于是老人对孩子叹息道，我们只剩了一个办法了，是我们两人抬着驴子走。无论读，无论做，倘若旁征博访，结果是往往会弄到抬驴子走的。  \n        \n不过我并非要大家不看批评，不过说看了之后，仍要看看本书，自己思索，自己做主。看别的书也一样，仍要自己思索，自己观察。倘只看书，便变成书厨，即使自己觉得有趣，而那趣味其实是已在逐渐硬化，逐渐死去了。我先前反对青年躲进研究室，也就是这意思，至今有些学者，还将这话算作我的一条罪状哩。  \n        \n听说英国的培那特萧（Bernard Shaw），有过这样意思的话：世间最不行的是读书者。因为他只能看别人的思想艺术，不用自己。这也就是勖本华尔（Schopenhauer）之所谓脑子里给别人跑马。较好的是思索者。因为能用自己的生活力了，但还不免是空想，所以更好的是观察者，他用自己的眼睛去读世间这一部活书。  \n        \n这是的确的，实地经验总比看，听，空想确凿。我先前吃过干荔支，罐头荔支，陈年荔支，并且由这些推想过新鲜的好荔支。这回吃过了，和我所猜想的不同，非到广东来吃就永不会知道。但我对于萧的所说，还要加一点骑墙的议论。萧是爱尔兰人，立论也不免有些偏激的。我以为假如从广东乡下找一个没有历练的人，叫他从上海到北京或者什么地方，然后问他观察所得，我恐怕是很有限的，因为他没有练习过观察力。所以要观察，还是先要经过思索和读书。  \n        \n总之，我的意思是很简单的：我们自动的读书，即嗜好的读书，请教别人是大抵无用，只好先行泛览，然后决择而入于自己所爱的较专的一门或几门；但专读书也有弊病，所以必须和实社会接触，使所读的书活起来。  \n        \n来源：《北大学者谈读书 》 "
		},
		{
			"post_id": 14,
			"title": "毕竟西湖六月中，风光不与四时同",
			"date_published": 1467299754.263,
			"body": "![image alt](img/0630hehua.gif)\n\n我读书的计划，终于坚持到了年中。感觉读书，有时候就跟看综艺节目一样。与不断按电视按遥控器的的习惯一样，读书的过程中也会养成，不断反复翻页的习惯。都是娱乐放松自己罢了。如果给了太多读书的好处和理由，反而读的不自在了。就像毛姆说的那样，读无趣的书，感觉就会难受。\n\n---\n\n列出书单的目的，也不是为了完成任务而炫耀，仅仅是想记录和分享。发现一本好书，或者读到一本烂书，重在读的过程。一年后在来看这些记录的博客文章，可能会有一些其他的感想吧。\n\n\n六月的书单，先罗列一下，我觉的有趣的书，这些也是能够让我不断阅读下去的动力。\n\n《毛姆读书心得》——最会讲故事的是毛姆，最会说八卦的也是毛姆，看这本书的目的，本来是想看看我喜欢的毛姆是怎么样读书的，或者读了什么样的书，然后却看到了很多其他同时代伟大的作家的八卦，这本书。。让人怎么能够放的下手。一口气读完，果然是有趣的人，读书有趣，与人相处也是那么有趣。\n\n《深夜食堂13》——不知不觉已经读了到了第13卷了，每次买回来，都舍不得马上去读完，主要是好怕看到了美食，却没办法吃到。也害怕读完了，等待后面几卷的时间，太过难熬。谁让这套漫画温暖而又吸引人呢。\n\n《武士会》、《刀藏背身》、《国术馆》——喜欢一个人的作品，就恨不得找来他所有的作品来读。年初喜欢上徐浩峰之后，对他的作品，就愈发的欲罢不能。愈发的佩服起徐浩峰的人，也惊叹他的知识储备。怎么可以如此的博学和善写。也渐渐能够看的出来，徐浩峰的写作套路，忽然想到了丹布朗（达芬奇密码的作者），他们的小说是有共同点的，丹布朗里的基督教隐喻和内涵，我看不懂。徐浩峰文字里国学和佛家的秘密和精神内涵，我也看不懂。还是读书太少了。\n\n《冰与火之歌：权力的游戏》第一卷——读的是英文版的，从去年开始就断断续续、吭吭哧哧的读了起来。本来是抱着学习下英文阅读的态度去读的，但是当经历过最艰难的每页查字段十几次之后，现在已经基本能每章才查几个单词了。算下来，也有八个月的时间了。仍不算太流利，不过已经能体会到英语原版阅读的乐趣。翻译的版本语言和文字的造诣也很不错，而读原版，才能真正感受到那个味道。体会到英语这门语言的一些乐趣。这算是意外之喜。\n\n《死神的精确度》——伊坂幸太郎的书，这是第一本。读完之后查了作者的资料，他在日本是跟东野圭吾等大牛齐名的小说家。国内的知名度不算高，亦或是我太孤陋寡闻，以前真的没有读到过。就这样，我被吸引了。跟读东野圭吾的感觉完全不同，伊坂幸太郎的文字，像一个普通的文青，而且是我认识的那种，内容温暖和煦。看来要多找几本他的小说来读读看了。\n\n《魔兽编年史》——作为一个魔兽脑残粉，我是第一时间读完的这本书。而作为一个魔兽通史能会被的人，读编年史仍会大呼过瘾。沉浸于它描绘的上古时代的艾泽拉斯星球、卡里姆多大陆。只是为了把魔兽争霸、魔兽世界、魔兽小说，所有提到的故事和历史，给编囫囵，也算是煞费苦心了。梳理精美的地图、插画，就是吸引我这样的脑残粉。\n\n有趣的书固然吸引人，在翻开书皮之前，其实是不知道书的好坏，而如果读到的书无趣，也只能硬着头皮翻完，最后在骂上一句了事。\n\n《魔鬼经济学》——很早就听过这本书了，一直没有提起兴趣去读，听了『罗辑思维』罗胖的推荐，找来读了读。大呼上当和后悔啊，罗胖的节目是越做越烂，节目内容就是把这本书的前言的故事讲了一遍，内容也没有啥实际意思，只不过从猎奇的角度看世界，满足了一些好奇心。\n\n《联盟：互联网时代人才的变革》——也是从『罗辑思维』上听到的，其实听的过程我是愤怒的，通篇在大谈梦想，而忽略经济学原理，不讲工资去谈升值，这不就是耍流氓吗？连马云都说，员工辞职只有两个原因，一是就是钱没到位，二是心伤了。如果听信这种忽悠人的论调去创业、去管理公司，就太秀逗了。只有创业成功的，人才会把血淋淋的创业史，描绘成美好的童话故事给别人听。\n\n《过得刚好》——我喜欢郭德纲，我毫不掩饰的在任何场合夸郭德纲。但这本书是真的不好看。相声段子里损人，当做一个梗，没事玩玩，无可厚非。居然还在书里继续去玩老梗，讲老段子，这本书看的我尴尬症都犯了。\n\n《我还是喜欢东京》——现在真的是啥人都能出书，啥内容也能出书。本以为这本书是讲东京，讲这个城市的内涵，结果内容全是夸日本人细节做得好，大量的照片，搭配上文笔不高的文字描述。翻完它的时间，都没有读一篇马蜂窝上精美的游记，花费的时间长，自然也达不到游记的水平。\n\n《鱼羊鲜史》——矮大紧高晓松，着实让人佩服。从『晓说』一直追到现在的『晓松奇谈』，我也算是高晓松的忠实粉丝了。出于对讲稿的好奇，就读了这本书。它也并不是不太好，只不过是不太符合现在我读书的选择和心情了。从时间线的角度，去整理历史上发生过的有趣的事情。初读起来确实非常吸引人。差在不够严谨，而且比较内容散乱，毕竟是讲稿整理嘛，可以理解。从之前听节目开始，已经成功的引出了我对了解历史，和认识这个世界的兴趣。这已经足够了。\n\n题目出自南宋诗人杨万里的《晓出净慈寺送林子方》——毕竟西湖六月中，风光不与四时同。接天莲叶无穷碧，映日荷花别样红。"
		},
		{
			"post_id": 13,
			"title": "在Zeronet注册并绑定.bit域名全攻略",
			"date_published": 1466599002.3,
			"body": "对于跟我一样刚接触Zeronet的小伙伴，运行并迫不及待的创建了自己的网站、博客之后，下一步就是想要注册并绑定自己的.bit域名了。\n\n为了让大家少走弯路，应邀我整理下，我的整个注册和绑定流程，希望能帮助到喜欢Zeronet，并且想要坚持用下去的小伙伴。\n\n如果想要自己动手，去注册.bit域名，需要对Namecoin有一定了解，可以参见[Namecoin官网](https://namecoin.info/)。注册后的绑定方法，可以参见[Zeronet官方说明](https://zeronet.readthedocs.io/en/latest/faq/#how-can-i-register-a-bit-domain)。\n\n不了解Namecoin，也不想自己弄的也没关系，[Zeronet官方](http://127.0.0.1:43110/domains4free.bit/?Post:2)也免费帮忙注册.bit域名。\n我主要讲解下这种免费注册和绑定的方法。\n\n---\n\n## **具体路程如下：**\n\n#### **1，检查想要注册的域名是否可用**\n\n到[这里](https://dotbit.me),检查下你想要注册的账号是否可用。(可能需要翻墙才能正常访问）\n![img](img/160622dotbit.png)\n\n#### **2. 准备一个bit-message账号**\n\n以前可以通过发ZeronetMail到@domains4free,但是作者说他最近比较少关注ZeronetMail，如果想要得比较及时的响应，还是用bit-message吧。\n\n不想去单独下载bit-message软件的，或者对bit-message不了解的，可以去网站[bitmsg](http://bitmsg.me)在线申请账号并使用。\n![image alt](img/160622bitmsg.png)\n\n我就是在这个网站上操作的，操作方式也很简单，注册之后先创建自己的地址，点击Create random address!创建一个随机地址。如下图：\n![image alt](img/160222bitmsgnew.png)\nBM-2cX6vX84qTBvL6ArkwZKkt8qsm9kghPAZv就是我的bit-message地址。有兴趣的可以给我发消息。\n\n#### **3. 有了bit-message，可以发信了**\n点击New Message如下地址发信\n> *BM-2cVddUzqe4DWCGorpXUXAUh2SwyD5S9ByU*\n\n内容如下:\n>Subject : *Desired a .bit domain*\nMessage : \n\tDomain : *mcjiffy.bit*(你想要申请的域名）\n\tZeronet Site : *166sh6pozauyn8GnKGPQhqcG6ebRMyu9na*(你的站点的key，也就是你URL里最后的那一长串)\n\n![image alt](img/160622bitmsgnewmsg.png)\n\n如果你有Namecoin账号，建议同时附上钱包地址，这样在域名注册成功之后，他会把域名push到你的Namecoin里。也就拥有了域名的管理权限，自己可以新增和删除域名指向和二级域名。我是个懒人，就没有去折腾NameCoin。\n\n#### **4.等待注册成功的回信之后，等待24h生效**\n![img](img/160622bitmsgre.png)\n看到如上的回复，恭喜你，已经注册成功了，剩下的就只有等待了。\n\n#### **5.绑定到站点配置文件**\n这一步也是最重要的一步，如果没有正确的配置的话，别人访问你的站点是无法自动访问到.bit域名下的。\n配置方法是找到站点目录下的content.json文件\n例如路径为：> zeronet/data/你的站点/content.json \n\n打开文件，增加一行domain节点的配置：\n> \"domain\":\"*mcjiffy.bit*\"\n\n*mcjiffy.bit*替换成你注册的.bit域名\n\n![image](img/160622domainjson.png)\n\n#### **6. 重启Zeronet**\nBOOM! 在列表里就会发现域名绑定已经生效。\n如果发现别人访问还是无法自动访问到域名，就随便更新个啥内容，publish一下吧。\n\n#### **最后，不要忘记回复bit-message表示感谢。**\n\nenjoy！"
		},
		{
			"post_id": 12,
			"title": "站点配置绑定的.bit域名",
			"date_published": 1466575210.47,
			"body": "申请了mcjiffy.bit的域名也有一点时间了。但是一直没有配置绑定到站点上，所以访问博客一致还是那一长串的http://127.0.0.1:43110/166sh6pozauyn8GnKGPQhqcG6ebRMyu9na/\n让人着实不爽，查了很久创建站点很久的前辈们发的相关建站只是的内容，也一直没有找到如何配置。\n\n今天研究了下zeronet/data/site.json发现有域名的站点会有一个 \"domain\"的配置节点，于是在zeronet/data/站点/content.json的文件里也加上了这个节点。bomb！重启之后居然搞定。访问的站点就变成了http://127.0.0.1:43110/mcjiffy.bit/\n\n没想到这么简单啊，zeronet真是越用越舒服。"
		},
		{
			"post_id": 11,
			"title": "情怀也应该矜持点——看完魔兽电影之后",
			"date_published": 1466383830.127,
			"body": "![image alt](img/0620wow.jpeg)\n\n今天终于组队开完了电影《魔兽》的荒，了却了情怀。穿着印着德鲁伊字样的文化衫，进入电影院的时候，想起最初玩warcraft和wow的时光，青葱变大叔，时间的跨越，还真让我有些恍惚。\n\n---\n\n\n电影上映之前，从各方面的反馈来看，评价不高。我以为我内心已经做好了准备，挑了个没太多人的时间去开荒，内心还是有一些希冀。\n\n但是整个观影过程，却成了两小时的煎熬。看着一个个熟悉的场景，内心激动之余，更多的是难过，甚至有些愤怒。才发现我还是太在意了。\n\n交代不清楚的剧情，模糊的人物关系，薄弱的人物性格，凌乱的镜头剪切，平淡的台词对白，连特效都只是靠魔法来掩盖场景的塑料布质感。我简直不敢相信这是根据我钟爱了这么多年的warcraft改编的。\n\n这感觉就像是——自己从小熟知的各种英雄的传奇，被蹩脚的吟游诗人，改编成了下三滥的荤段子一样。而电影里确实也有荤段子，蹩脚且残忍。\n\n作为“电影”，它是完全不及格的，简化了背景故事和世界观的刻画，别说是没有玩过游戏的人看不懂，很多玩过游戏但是没有深入了解过的人，也肯定有很多地方会觉得莫名其妙。而作为有着十二年情怀的玩家，如果仅仅是因为一闪而过的小鱼人和集合石，这样的游戏彩蛋，就得到满足的话，那也太不值钱了，还不如当年充点卡送的鱼人钥匙扣。\n\n据说电影外景只拍了四个月，大部分的镜头都是在室内和电脑里完成的。现在的特效技术，确实做的不错，但也仅仅是不错。有时候我的感觉，恍惚就是在看游戏CG，甚至还不如最新的wow CG。至少CG能让我热血沸腾。当然，这个也只能怪制作方经费不足，1亿美元的投资，能做成这样，已然是用尽了全身解数。\n\n所以才出现了，大头娃娃样的矮人，长的像身边同学的暗夜精灵。违和感太强烈了，像极了粗劣的cosplay，还不如我买个手办来的精美。台词方面也极尽平庸，以为能听到很多充满力量的兽人语对话，但是导演的自作聪明，让观众都吃了精通兽人语的药丸，也造成了语言转换的混乱。\n\n单从制作的方面来看，魔兽电影的制作连《权力的游戏》这样的经典美剧都比不上。更别提《指环王》这样标杆一样的奇幻题材系列电影了。\n\n也无怪乎网上传言，暴雪高层对电影非常不满，想要收回版权，自己改编续作。这样一部定位为消费粉丝情怀的电影，确实严重缺乏诚意。有点自毁招牌的意思了。\n\n而我们评价电影的时候，也不能总用情怀、特效，这样贫瘠的词，惯坏了那些只想赚钱，而不讲诚意的电影公司。至少，自己的情怀还是应该矜持些。\n\n只希望，如果暴雪真的拿回版权自己，自己精心制作，能够从头重新开始吧，这一部，我才不想承认它是属于warcraft系列电影开篇。\n\n当然，以上都是我个人看法，毕竟一场电影结束后，还是要过自己的生活。重要的是，你开心就好。 "
		},
		{
			"post_id": 10,
			"title": "大抵幸福的生活",
			"date_published": 1466149708.062,
			"body": "![image alt](img/0617syst.jpeg)\n\n最近看了漫画《深夜食堂》的第13卷，其中有个故事印象挺深的——家庭主妇出色的完成了生养孩子、照顾小姑子和婆婆的任务之后，毫无征兆的提出了离婚，去追求自己想要的生活了。\n\n---\n\n\n男人当然崩溃，因为他失去了在生活上，习惯于一切被人照顾的状态。曾经每个月只需要如数上缴工资，就能享受精致的生活的状态一去不复返。\n\n由此可以看到，一个普通日本家庭的生活状态。大多数日本女人在结婚生子后选择当全职的家庭主妇，照顾起整个家庭。一方面是因为政府的福利政策和法律保障比较完善，能够让一个人赚钱的男人养活起整个家；另一方面我觉得仍是日本传统思想上认为男尊女卑的一种体现，需要女性承担起全部家务和照顾孩子的任务。对于女性有一种道德规范上的要求。如果不遵循的话，就会被认为是不道德的或者是不好的。\n\n国内不明就里的女性，往往会很羡慕这样的生活状态，而不知其中的辛苦和付出的代价。当然，每个人都有权利选择怎样的生活，在我们东方文明的略保守的我道德思想下，有勇气做出选择的女性都是值得尊重的。\n\n漫画里提到的女性即使如此。最终的结局，男人为了挽回女人，重新组织起了当年追女人时的乐队，成员都是已经年逾不惑的同学。虽然重新建立了纽带，但是关系已经不是之前的那种男尊女卑的状态了。但是谁又能说新的状态不是更令人羡慕呢。\n\n最近我接待个老同学，他在日本工作生活了多年，回国办事，见面就跟我抱怨说：“养家难啊，一个人的工资养三口人。每周上六天班，回家后还不受老婆待见，被埋怨不做家务。想打打网络游戏都没有时间。”\n\n我心想，从微信朋友圈偶尔发的状态看，穿衣打扮和生活细节上已经看不出跟日本人的区别了。但是，从这个小家庭的矛盾上看，果然骨子里还是咱中国的观念。虽然他太太也是全职家庭主妇，但是从根本并没有产生日本人的那种认同感。而他自己也并没有日本的那种理所当然的大男子主义。所以才会爆发这种家庭矛盾吧。\n\n当然，他本人也很努力，辞掉了稳定的工作，从兴趣开始创业，已经能赚的比工资多很多钱。拿回家的钱多了，家庭矛盾自然也就消失了。从对赚钱这点上看不管在日本还是在中国，都还挺一致的。\n\n所以我想大抵幸福的生活即是如此，不论外部环境压力如何，都能够作出自己的选择，两个人目标和想法大抵一致，偶有拌嘴，但是从不记仇。有成熟的思想和健康的身体。而幸福，不就是在自己身边么。"
		},
		{
			"post_id": 9,
			"title": "品质与能力",
			"date_published": 1466149587.322,
			"body": "![image alt](img/0617gsw.jpeg)\n“斯蒂芬-库里，6英尺3英寸，185磅，位置：控卫。斯蒂芬的运动能力在NBA平均水平之下，他在篮下的终结能力并不突出，他正在升级自己的控球技术，但面对强硬的防守，他会表现得很挣扎。斯蒂芬必须打控卫才能在这个联盟生存，他没什么潜力，很难达到更高的级别，而且千万别指望他担任球队的进攻指挥官。”\n\n---\n\n\n这是库里进入NBA前球探对他的评价报告。对比库里在联盟和球队中的表现，对报告打脸之余，也包含着另一个更深层的问题——选秀到底应该注重品质还是能力？\n\n一个人的品质包含先天和后天两个部分，先天因素就是性格，深深烙印在DNA之中的，包含了感性，决定了一个人的起点，但绝不是上限。后天因素，包括成长环境、家庭和教育，决定了理性。是一个人为人处事、待人接物的方式与态度。能够看到一个人能够做到的极限，甚至能够自我驱动到没有上限。\n\n而能力，是在一部分先天品质的决定下，当前能够直观看到的状态。而且是一个不稳定的印象集合。可能一段时间表现出来出色的能力，但是后天品质无法驱动他成长的时候，就会出现选秀中所谓的“水货，或者成名已久的巨星也无法改变人们对其固有的印象。\n\n库里在先天看起来不足的情况下，有着后天品质不断驱动着成长，质疑的声音就是他成长的动力。不断去打破外部对他能力的固有印象，达到了现在的位置。这些是那些只有固有能力而无法驱动自己改变的球员无法做到的，所以只看当前能力决定选择的时候，仍然会错过其他类似库里，类似追梦格林这样的拥有优秀品质的球员。\n\n马刺队传奇教练波波维奇曾经说过：“你们球探啊，在考察球员的时候，别总是盯着得分、篮板、弹跳、防守、天赋这些东西。这些东西并不难，是个搞篮球的都能看得懂。看来看去有什么用？你们应该去看看球员在板凳席上的样子，他和队友是怎么相处的，他对教练是什么态度，他失败后的表现是什么样子，赢球后又是什么样子。”\n\n这些都是一个人优质品质里所包涵的。波波维奇调教球员也都按照品质去选择。邓肯吸引人的一部分是因为出色的能力，但更多的仍是他温厚恭谨的品性，“石佛”的外号可见一斑。\n\n而库里吸引我的也是同样的，不仅仅是目前能在精彩的比赛中看到的，那样拥有逆天水花的能力，而是他在场上和场下、面对教练队友和敌人，所表现出来的优秀品质。"
		},
		{
			"post_id": 8,
			"title": "收集和记录一些Bit Sync地址",
			"date_published": 1465278022.113,
			"body": "http://bskey.xyz/\nhttp://btsynckeys.com/\nhttp://notepad.live/share/802e1fkeys"
		},
		{
			"post_id": 7,
			"title": "在看魔兽电影之前我想说的",
			"date_published": 1465261059.63,
			"body": "![image alt](img/0607wow.jpg)\n看了剧透，已经对魔兽世界电影不抱什么期望了。毕竟是一部消费情怀的电影。其实我还想保留点自己的情怀，到老了以后慢慢回忆。\n\n遥想最初，从02年的war3roc，到03年的war3ft，再到04年的wow。暴雪为玩家构建了一个庞大而精细的奇幻世界。而且它不像托尔金的中土世界那样距离我们遥远，它是我们曾经切实参与过，曾经以某种身份奋斗过的地方。这些都是情怀的来源，切实产生过回忆的地方。\n\n---\n\n大学毕业以后，玩wow的时间越来越少了，直到彻底的AFK，仅仅是每次版本更新后，刷一波剧情任务后继续AFK。对于魔兽世界的热情与幻想，也在生活的压力下慢慢消失。\n\n但是我收集了从war3到wow所有版本的CG动画，每次怀念的时候，都拿出来刷一遍，每段剧情都了然于胸，对于魔兽的剧情和历史早已经背诵如织。对于魔兽世界电影，我自己脑子里是有一个版本的。这个版本包含了我对魔兽世界所有的情怀与回忆。\n\n作为IT男，我也会常去想——魔兽世界这么庞大而复杂的世界，到底是怎么构建出来的。私服横行的年代，我也曾拿各种模拟器去构建自己的服务器，然后一点点的研究数据、研究代码、研究任务文本的每一个细节、装备的每一个属性，乐此不彼。\n\n最近在bilibili上看到有up主发布了一系列魔兽世界游戏各个版本的幕后制作过程。每个版本的主创人员出来谈每一个细节的制作过程。忽然发现，我所有的情怀有了一个宣泄点。\n\n能够详细的听到warcraft从RTS变成MMORPG的过程，能够了解到每一个细节设计的思路和过程。作为一个铁粉来说，简直太幸福了。就像是喜欢一部小说，熟谙小说里的每个角色，然后忽然知道了作者创造每个角色和情节当时的考虑和思路。这种兴奋的感觉是无法言表的。\n\n所以对我来说，魔兽的情怀已经宣泄，再加点对商家炒作之风的厌恶，电影会去挑个最后的场次，静静的欣赏。而票房，我不会关注，毕竟那属于商家的数据，而不是玩家的情怀。\n\n最后附上bilibili地址，留待以后没事刷刷：http://www.bilibili.com/video/av4831665/"
		},
		{
			"post_id": 6,
			"title": "开启新域名mcjiffy.bit",
			"date_published": 1465175066.369,
			"body": "通过@domains4free注册了新域名mcjiffy.bit，非常感谢，以后可以通过http://127.0.0.1:43110/mcjiffy.bit/ 访问我的这个Blog了。\n再次感谢@domains4free\n有需要注册的，建议给他发bitmessge注册，ZeroMail他只是偶尔会看一眼，不会保证一直看。bitmessage响应非常快。\n他的bit message 地址：BM-2cVddUzqe4DWCGorpXUXAUh2SwyD5S9ByU"
		},
		{
			"post_id": 5,
			"title": "落樱缤纷五月天",
			"date_published": 1464750788.186,
			"body": "![image alt](img/0601ds.jpeg)\n读书有时候有趣的是，会扩展开来。读到一本有趣的书，会想着寻找同类型，或同作者的书，继续去读，这样精神上的欢愉感是加成的。四月份读了一本刘瑜的《送你一颗子弹》感觉很好，然后找了她的《民主的细节》来读，忽然对美国相关的人和事儿刚兴趣，又找了其他人写的关于美国的《历史深处的忧虑》。\n\n另外一种增加快乐的情况就是，忽然读到一本书，发现把自己之前零碎的知识都给串联起来了，有一种豁然开朗的感觉，《人类简史》就是带给我这样感觉的一本书。\n\n五月份书单如下：\n\n---\n\n《西风东土》——之前读过熊培云的《自由在高处》，不是太喜欢，不知道是不是文风不喜欢，还是字里行间表达出来的意思读起来不太喜欢，这本《西风东土》本来以为是从他的角度看日本的一个很好的角度，但是还是读起来不喜欢，看来是跟我不搭。\n\n《民主的细节》——真的是太喜欢刘瑜的文字，自然流露出来的俏皮，让人读起政治这种东西，都很轻松愉快。\n\n《历史深处的忧虑》——本来看了是书信形式的有点读不下去，但是读了几张之后发现，一发不可收拾，内容殷实，透过文字展现出来的，对中国和美国两国的思考，也非常深刻。\n\n《人类简史》——就是真本书，把以前我零零碎碎的，关于人类历史的知识给很好的串联、整合了起来，前两个月读过一本《人类前史》，在这本书里也有很好的印证。虽然叫『简史』，也只是限于篇幅的『简』，真希望作者能多出基本，来个『全史』。\n\n《一桩事先张扬的谋杀案》——看电影『心迷宫』下面有人评论说，和这本书的叙述方式类似，就去找来看了，作者是写《百年孤独》的加西亚.马尔克斯。看完的感觉就是，大师就是大师，文字的每个细节都很到位，对每个人物的刻画和掌握的每一句话，都缺一不可。\n\n《局外人》——由上面那本延伸来读的，加缪同样也是这方面的大师级人物。\n\n《Learn Python the Hard Way》——学习python的一本入门书，推荐给初学者。\n\n《理性动物》——作者试图解释人类做出决定的时候，有多少理性的成分。但是在我看来整个阐述是不好的，这本书更像是一本团队培训的讲解书，拿来做个ppt挺好。\n\n《雪崩》——奠定尼尔斯蒂芬森赛博朋克地位的一本书，可惜我看的太晚了，1992年出版的，关于科技关于互联网，到现在已经24年了，看起来已经没有太多的感觉。\n\n《唐诗排行榜》《宋词排行榜》——理科生的角度读唐诗和宋词，角度很有趣，算法也很特别，算是从大数据的角度给唐诗和宋词做了排序，当然，每个人心里肯定有一个自己的情怀排行榜。"
		},
		{
			"post_id": 4,
			"title": "IFTTT, Pocket和kindle配合管理自己的内容",
			"date_published": 1464697786.094,
			"body": "![image alt](img/ifttt.jpg)\n自从认识了ifttt，感觉互联网内容对我来说就变得不一样起来，轻轻松松让本来毫不相关的网站或者app关联起来。而自从google reader停止服务以后，pocket就慢慢成了我的订阅中心，在ifttt的配合下把rss、内容都同步到pocket里离线阅读。\n今年以来，我忽然爆发的阅读热情，让kindle的利用率也高了起来，但是ifttt一直没办法很好的连接到kindle，这个不得不说是个遗憾。虽然也有其他的第三方服务可以让内容同步到kindle，例如instapaper，但是相关服务也是需要付费的，让人不爽。所以，索性自己写个服务来吧ifttt、pocket、kindle给connect起来。\n\n---\n\n大致的思路如下：\n\n    1. 阅读内容首先通过ifttt，同步到pocket。在pocket中进行粗度，需要放到kindle中精读的，给文章加一个tag，我起名叫#tokindle#。\n\n    2. ifttt中新建任务，如果pocket有item被加了#tokindle#标签，则发一条微博，内容为：#tokindle#文章标题&文章链接\n\n    3. 写了一个小程序，定时抓取微博内容，取到带有#tokindle#标签的微博，分析道文章标题和文章链接。\n    4. 分析了chrome插件push to kindle,得到了推送服务的地址，把分析到的文章标题和链接发送到亚马逊kindle推送服务的kindle.cn邮箱中。\n\n    5. BANG！几分钟不要，kindle中就出现了和pocket同步的，并且阅读感觉良好的文章推送。\n\n以上的方法也有两点需要注意的地方：\n\n    1. 抓取微博的程序，需要设置user-agent为爬虫，最好是新浪爱问的爬虫，否则会被跳转到特殊内容的页面导致抓取失败。\n\n    2. push to kindle服务响应比较慢，不能频繁推送，否则也会被ban掉。\n\n从我目前使用的情况来看，整个流程还蛮舒服的，kindle、pocket、ifttt都得到了很好的利用，而且连废弃已久的微博都可以用起来，当做一个同步内容的平台。\n\n类似这种碎片化的网页内容，我另外还会把喜欢的内容用ifttt同步到onenote中，进行归类收藏。对！就是onenote，不是evernote或者有道笔记之类的，因为我比较习惯微软的onenote，最重要的是onenote保存URL内容，有体验比较好的内容预览展示，这点做的还是很赞的。"
		},
		{
			"post_id": 3,
			"title": "mac上使用ZeroNet",
			"date_published": 1464683881.403,
			"body": "ZeroNet提供了mac对应的解决方案，但是如果按照提示的方法运行zeronet.py可能会得到一个错误——提示找不到gevent moudel。\n如果使用pip安装gevent，也会提示安装不成功。\n[github](https://github.com/HelloZeroNet/ZeroNet/issues/286)提问链接里也给出了问题的原因，主要是因为mac osx有System Integrity Protection，阻止了对/usr/bin目录的操作。\n\n---\n\n所以，需要先把SIP给禁用，之后再进行安装。\n禁用SIP的方法如下：\n 1、重新启动操作系统； \n 2、按住Command + R键；\n 3、菜单“实用工具” ==>> \\\"终端\\\" ==>> 输入 csrutil disable\n然后再重新系统之后，执行python -m pip install gevent msgpack-python，安装缺少的moudel。\n\n这样mac osx下再运行zeronet.py就能正常访问了。\n重新启用SIP，只需要把刚才禁用的最后输入的命令改成csrutil enable即可。"
		}
	]
}