{
    "article": [
        {
            "title": "Home",
            "text": "{{Use dmy dates|date=August 2012}}\n{{Use British English|date=August 2012}}\n{{Infobox television\n| name = Freefonix\n| image = \n| caption =\n| genre =  {{flat list |\n*[[Animation]]\n*[[Action (fiction)|Action]]\n*[[Fantasy]]\n*[[Music genre|Music]]}} \n| creator = [[Magnus Fiennes]]<br/>Alex Tate<br/>Simeon Warburton\n| director = Jerome France<br/>Pierre Alan Chartier\n| voices = [[Shelley Longworth]]<br/>[[Marcel McCalla]]<br/>[[Jules de Jongh]]<br/>Adam Longworth<br/>Joseph Fiennes<br/>Susan Zelouf\n| theme_music_composer = Freefonix\n| opentheme = \"Do What Ya Like\"\n| country = United Kingdom\n| language = English\n| num_episodes = 40 ([[#Episodes|list of episodes]])\n| executive_producer   = Anthony Bouchier<br/>Steve Christian<br/>Magnus Fiennes<br/>P. Jayakumar<br/>Aton Soumache<br/>Alexis Vonarb\n| runtime = 24 mins\n| company              = [[Method Animation]]<br />[[Toonz Animation]]<br />Cinnamon Entertainment<br />[[Isle of Man Film]]\n| distributor          =\n| network = [[BBC One]]<br/>[[CBBC]]\n| picture_format = [[SDTV]] ([[576i]])\n| first_aired = {{start date|2008|1|4|df=y}}\n| last_aired = {{end date|2009|1|22|df=y}}\n| website =\n}}\n'''''Freefonix''''' is a 2008–2009 British children's animated television series created by [[Magnus Fiennes]], Alex Tate and Simeon Warburton and produced by Cinnamon Entertainment with [[Toonz India Ltd|Toonz Animation]], [[Isle of Man Film]] and Method Films for [[CBBC]].<ref>{{cite book |last1=Crump |first1=William D. |title=Happy Holidays—Animated! A Worldwide Encyclopedia of Christmas, Hanukkah, Kwanzaa and New Year's Cartoons on Television and Film |date=2019 |publisher=McFarland & Co |isbn=9781476672939 |page=350}}</ref> The series launched on 4 January 2008 on [[BBC One]] with the first thirteen episodes; airing weekly up until 28 March 2008. The rest of the series was broadcast on CBBC from 18 December 2008 to 22 January 2009.\n\nThe series focuses on three musical 'Freewave' renegades that make up the fictional band of the same name. Using the power of the Thirteenth Note, a mystical musical energy source, they take part in musical battles against antagonist band Mantyz in order to keep their home city of Los Bosmos safe from the evil Sonic Lord known as Vox and the money-making schemes of Mya De Zya, the head of ComaCo, a record label and corporation who produce manufactured 'prepsi' musical acts.\n\n==Storyline==\nFreefonix have discovered a sophisticated way of fighting their battles against rival band Mantyz, by using the power of the Thirteenth Note, an awesome force that can bend space, time and minds when the perfect sound is created. When the two rival bands meet, the result is an explosive Soundclash, where the opposing forces do battle as all the energies of the Thirteenth Note are released.\n\n==Production==\nFreefonix features performances from singers Jamelia and Justin Hawkins, saxophonist and former cricketer [[Alastair Cook]], actor [[Joseph Fiennes]] and musician [[Haylie Ecker]]. With a budget of more than £10 million ($15 million), Freefonix is the largest commission by BBC for an animation. The scripts for Freefonix were written in Los Angeles and Toronto, and story edited by [[Jeffrey Alan Schechter]], Baz Hawkins and Will Schifrin.\n\n==Characters==\n===Freefonix===\n*'''BB''' (voiced by [[Shelley Longworth]]) – 15-year-old lead singer, formally a member of the prepsi band BCD before becoming a Freewaver.\n*'''Freezbone \"Freez\"''' (voiced by [[Marcel McCalla]]) – 16-year-old guitarist and secondary singer/ rapper with an outgoing and sometimes hippy personality. His guitar is named Misty.\n*'''Mostart \"Mo\"''' (voiced by [[Jules de Jongh]]) – 13-year-old beatmaker and DJ of the band, whose SoundShaper device acts as his mixer. Mo lacks confidence due to being the youngest and shortest member, and has a crush on Lady Lux.\n\n===Mantyz===\n*'''Kurtz''' (speaking voice by Adam Longworth, singing voice by [[Justin Hawkins]]) – 17-year-old self-absorbed lead singer and lead guitarist and half-brother to Lady Lux. His guitar is named Axe.\n*'''Lady Lux''' (voiced by Shelley Longworth) – 16-year-old bass player and Kurtz's half-sister, also the brains behind their schemes against Freefonix.\n*'''Hitt''' (voiced by Joseph Fiennes) – 17-year-old drummer and muscle of the band, whose clueless-ness often annoys the other members.\n\n===Other===\n*'''Sugar Che''' (speaking voice by Susan Zelouf, singing voice by [[Jamelia]]) – An ancient Sonic Lord who brought Freefonix together and acts as their guide and aid.\n*'''Vox''' (voiced by Adam Longworth) – An renegade Sonic Lord who Sugar Che trapped to the Void of Silencia and seeks freedom through the schemes of Mya and Mantyz.\n*'''Mya De Zya''' (voiced by Susan Zelouf) – The vain head of ComaCo, a record label who produce manufactured 'prepsi musical acts, who after is promised \"untold riches and power\" from Vox, decides to aid him in his fight against Sugar Che and Freefonix.\n\n===Recurring===\n*'''CC & Dee Dee''' – Two members of BB's former Prepsie band BCD, and like all Prepsies, are shallow and obsessed with pop culture.\n*'''Snugg Fitt & DJ Loose''' – Two DJs that work at The Bounce, a Freewave music club.\n*'''Mr & Mrs Start''' – Mostart's parents who are unaware that their loving nature towards their son is an annoyance to him.\n*'''Aw'right Jack''' – The owner of the diner Jack's Pies and Fries, where Freefonix often visit.\n*'''Nerdry''' – A [[nerd]]y employee at ComaCo and nephew of Mya, who assists her in her plans against Freefonix, much to her hatred towards him.\n\n==Production==\nFreefonix, created by Magnus Fiennes, Alex Tate and Simeon Warburton, is produced by Richelle Wilder and Chris Rice for Cinnamon Entertainment with Method Films and [[Toonz India Ltd|Toonz Animation]]. The series is directed by Jerome France and Pierre Alan Chartier, and features new tracks from Freefonix with some of the world's top record producing talents and features performances from Justin Hawkins (of [[The Darkness (band)|The Darkness]]), singer Jamelia, and Joseph Fiennes, actor and brother of Magnus.\n\n==Episodes==\n{{Episode table |background=#F77F00|overall= |title= |director= |writer= |airdate= |episodes=\n{{Episode list\n |EpisodeNumber = 1\n |Title = The Story Begins\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = [[Jeffrey Alan Schechter|Jeff Schechter]]\n |OriginalAirDate = {{Start date|2008|1|4|df=y}}\n |ShortSummary = At Sugar Che's behest, Freez tracks down BB to accompany him on a mission to empower the young musical genius Mostart with the mystical power of the Thirteenth Note. Meanwhile, the evil Sonic Lord, Vox, teams up with Mya De Zya, the most powerful person in all of Los Bosmos, in order to break out of his prison, the Void of Silencia, with the help of the rock band Mantyz and their corrupted version of the Thirteenth Note.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 2\n |Title = Risky Music Business\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Jeff Schechter\n |OriginalAirDate = {{Start date|2008|1|11|df=y}}\n |ShortSummary = When Mo's parents go away for the weekend, they leave Mo in charge of the house. But Mantyz wins the house in a freewave sound battle, and now Freezbone and BB must help Mo win back his house by battling Mantyz again.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 3\n |Title = Bizarro BB\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2008|1|18|df=y}}\n |ShortSummary = In a freak soundclash, BB and Lady Lux switch bodies. Now looking like BB, Lady Lux tries to steal Freez and Mo's instruments to help Vox harness the 13th note. Meanwhile, BB desperately tries to convince Freez and Mo that they're in jeopardy.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 4\n |Title = Grand Theft Audio\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Jeff Schechter\n |OriginalAirDate = {{Start date|2008|1|25|df=y}}\n |ShortSummary = When Freefonix catches wind that a special violin is to be stolen by Mantyz from the Los Bosmos museum, the trio set out to stop the crime, only to be mistaken for thieves themselves. Now on the run, they must protect the rightful heir to the instrument - a young girl who has yet to embrace her destiny as a guardian of the Thirteenth Note.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 5\n |Title = Out of Time\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Will Schifrin\n |OriginalAirDate = {{Start date|2008|2|1|df=y}}\n |ShortSummary = Mo gets his hands on one of Sugar Che's Thirteenth Note power tools, which allows him to accelerate through time. In the blink of an eye, he can clean his room and write a whole new catalogue of Freefonix songs. But when the device malfunctions, Mo begins to 'decelerate', moving at a snail's pace.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 6\n |Title = Love Stinks\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2008|2|8|df=y}}\n |ShortSummary = Mya uses a love potion and the dubious charms and talents of a wannabe singer named King Boy to break up Freefonix and bring BB under her control.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 7\n |Title = Mr Start Skips Town\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alan Hescott\n |OriginalAirDate = {{Start date|2008|2|15|df=y}}\n |ShortSummary = When Mo's dad is promoted and he plans to move his family out of Los Bosmos, it looks like the end for Freefonix - but Mo plans to go out in style. Meanwhile, BB and Freez smell a rat: is Mo's dad's promotion on the level? They investigate and discover a sinister trail of deceit.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 8\n |Title = Gloveball Been Very Good to Me\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Will Schifrin\n |OriginalAirDate = {{Start date|2008|2|22|df=y}}\n |ShortSummary = Mo becomes a phenomenon at Gloveball and his success threatens the future of Freefonix. But BB and Freez suspect ComaCo might be behind Mo playing at the Gloveball Championships.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 9\n |Title = Phantom of the Hip-Hopera\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Jeff Schechter\n |OriginalAirDate = {{Start date|2008|2|29|df=y}}\n |ShortSummary = In order to help his friend keep the oldest independent venue in Los Bosmos from falling into Mya's hands, Freez gets BB and Mo to agree to play a gig there. They soon discover that the venue is haunted by an entity which calls itself \"The Phantom\", who is dead against Freewave music being played in his home.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 10\n |Title = Back by Unpopular Demand\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Will Schifrin\n |OriginalAirDate = {{Start date|2008|3|7|df=y}}\n |ShortSummary = BB is horrified to learn that Mya has a contract obligating her to do one more song with BCD, but when the song goes titanium, success goes to BB's head - especially since she has finally won the admiration of Zera, who was the prettiest and most popular girl in BB's school.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 11\n |Title = Play Misty for Me\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = \n |OriginalAirDate = {{Start date|2008|3|14|df=y}}\n |ShortSummary = Freez suspects that he and Misty are no longer (MLP) Musical Life Partners. Under the mistaken idea that if he loves Misty he should give her away to someone she loves in return, he gives her to the mysterious Carlos.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 12\n |Title = Send in the Clones\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alex Spiro\n |OriginalAirDate = {{Start date|2008|3|21|df=y}}\n |ShortSummary = Mya clones Freefonix in the hope that the duplicate band will play the Thirteenth Note, free Vox and give Mya the power she craves. As the clones spend a day in Los Bosmos, they begin to act more and more like the real Freefonix, ultimately becoming able to play the Thirteenth Note. Meanwhile, the real Freefonix - masquerading as the dorky clones - slip into ComaCo, where a sound clash ensues with Mantyz.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 13\n |Title = Music Soothes the Savage Genie\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Ross Jameson\n |OriginalAirDate = {{Start date|2008|3|28|df=y}}\n |ShortSummary = When musical genie Ozzy grants Kurtz three wishes, Kurtz idiotically wastes the first wish, but uses the second to make Mantyz the greatest band in history. As Los Bosmos is hit with \"Mantyz-mania\", Freefonix must find an ancient bootleg tape which is the only thing that will return Ozzy back to the amp.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 14\n |Title = Prepsie Idol\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Neil Mossey and Robert Venes\n |OriginalAirDate = {{Start date|2008|12|20|df=y}}\n |ShortSummary = While Mya tries to figure out a way to sell Fizzy Blast, an overly carbonated ComaCo soft drink, Vox announces he's detected a 13th note prodigy in Los Bosmos. Seeing a way to kill two birds with one stone, Mya holds a viddycast prepsie music contest designed to draw out the prodigy. Freez alone gets picked to perform, while BB and Mo track down Coda, the prodigy. BB empathizes with Coda's desire to win the contest, but she convinces him not to play 13th note. As Coda and Freefonix get away, the Mantyz goes after them. A sound clash ensues in which Coda helps our heroes defeat Kurtz, Lady Lux and Hitt.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 15\n |Title = Death of Cool\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alex Spiro\n |OriginalAirDate = {{Start date|2008|12|28|df=y}}\n |ShortSummary = In an attempt to bring down Freefonix before a big Freewave festival, Nerdry programs a viddy mail virus which causes Freewavers to lose their cool. The virus turns Freez into a nerd and Mo into a 1970s lounge lizard. Only BB, who is too much of a \"techophobe\" to check her email, is immune. During the concert, BB must get over her fear of technology and figure out how to reverse the virus so that Freez and Mo can get their cool back.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 16\n |Title = Roborapper\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2008|12|25|df=y}}\n |ShortSummary = Roborapper Flap, an old friend of Freez's, comes to Los Bosmos as the biggest rap star in the city. There is some bad blood between these two, something which is not helped when Sugar informs Freez that Flap is a potential Thirteenth Note guardian.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 17\n |Title = Baby BB\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = [[Jimmy Hibbert]]\n |OriginalAirDate = {{Start date|2008|12|26|df=y}}\n |ShortSummary = Mya is working on an age-reversing potion which only works when it's exposed to a blast of pure Thirteenth Note energy during a soundclash. The potion spills on BB, who regresses into a five-year-old girl. Meanwhile, Sugar and Vox sense there is a new musical prodigy in Los Bosmos: a two-year-old toddler.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 18\n |Title = Who's Your Daddy?\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alex Spiro\n |OriginalAirDate = {{Start date|2008|12|24|df=y}}\n |ShortSummary = Freez believes Aw'right Jack is his long-lost father. When Aw'right Jack learns Freez may be his son, he becomes convinced he has musical talent and superpowers just like Freez. Meanwhile, Freefonix try to find a missing cell phone that has a Thirteenth Note ringtone and the power to free Vox.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 19\n |Title = Everybody Was Polka Yodel Fighting\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2008|12|29|df=y}}\n |ShortSummary = When the Polka Yodel craze sweeps into Los Bosmos, BB suspects that there is more to the Polka Meister and Yodeler than meets the eye. It turns out that she's right; this musical duo are actually master villains in disguise, and what's worse, they're actually CC and DD!\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 20\n |Title = Summer Breeze\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alex Spiro\n |OriginalAirDate = {{Start date|2009|1|1|df=y}}\n |ShortSummary = Sugar Che warns Mo and BB that a banned Freewave prodigy nicknamed 'The Chameleon' is back in town and looking to get revenge on the Freewave for kicking him out of the movement. The Chameleon has the ability to take on the appearance of anyone, and Mo immediately suspects an old friend of Freez's named Breez. In his relentless attempt to prove Breez is 'The Chameleon', Mo becomes a suspect himself, angering Freewavers and nearly facing banishment from Los Bosmos. Ultimately, The Chameleon is exposed, and it is neither Breez nor Mo, but someone thoroughly unexpected.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 21\n |Title = Land of the Lost\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Jimmy Hibbert\n |OriginalAirDate = {{Start date|2008|12|18|df=y}}\n |ShortSummary = During a frantic soundclash, Freez breaks one of Misty's strings and is transported to a 13th Note dimension where he encounters the shapeshifting Kalano. Can BB and Mo return Freez before Kalano ensnares him in the lost dimension forever?\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 22\n |Title = Yule Spend\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2009|1|6|df=y}}\n |ShortSummary = In an attempt to boost ComaCo sales, Mya creates a bogus holiday called 'Yule Spend'. Nerdry invents a machine that fills Los Bosmos with brainwashing snow that causes everyone in the city to relentlessly buy useless ComaCo junk. Desperate to stop Mya from perpetuating her greedy consumer holiday, Freefonix disguise themselves as the ghosts of Yule Spend Past, Present and Future. When Mya sees a glimpse of her future, in an empty city where no one buys ComaCo products, she ends up smashing the show machine and destroying the holiday.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 23\n |Title = Mya Mania\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2009|1|14|df=y}}\n |ShortSummary = Mantyz use one of Nerdry's microships to hypnotise Freezebone so he becomes a follower of Mya, dedicating all of his songs to her and turning anyone who hears them into Mya fans. With the whole of Los Bosmos screaming devotion to Mya, it's up to BB to use her Thirteenth Note power to help Freezbone regain his Freewavosity and turn Los Bosmos back to normal.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 24\n |Title = You Say It's Your Birthday\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Nick Ransome\n |OriginalAirDate = {{Start date|2009|1|3|df=y}}\n |ShortSummary = Everyone seems to have forgotten Mo's birthday, so he makes a wish. To Mo's delight, it comes true and Mo finds himself in an endlessly repeating birthday. But the sonic disturbance caused by the repeating day gives Vox the opportunity to escape. Freefonix must stop the repeating day and send Vox back to the void!\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 25\n |Title = BB's Bro\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2009|1|4|df=y}}\n |ShortSummary = BB gets the ultimate test of sisterhood when her rebellious brother Bucky comes to stay with her. Unfortuately, BB treats him like, well, a kid brother. Feeling slighted, Bucky becomes an easy target for Mantyz. Pretending to really want to be his friends, Mantyz manipulate Bucky into stealing the power chip from BB's microphone, putting Freefonix and himself in grave danger from the now super charged Mantyz.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 26\n |Title = Notes in the Machine\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Jeff Schechter\n |OriginalAirDate = {{Start date|2009|1|7|df=y}}\n |ShortSummary = Using a new invention from Nerdry, Mantyz manages to steal BB's voice and store it inside of ComaCo's main computer system. Vox has detected a weak spot in the void, centered in the computer, and wants to manipulate BB's voice to crack it open. With BB now silent and Nerdry unable to figure out how to use BB's voice, a new plan is hatched.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 27\n |Title = The New Guardian\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Will Schifrin\n |OriginalAirDate = {{Start date|2009|1|5|df=y}}\n |ShortSummary = Mya orders Mantyz to sabotage a Freefonix concert with a sonic scrambler. Trouble is, Mo has rigged the Bounce with sonic booby traps, making it impossible for Mantyz to break into the club. Meanwhile, Snug Fitt introduces Freefonix to his sister Chandra, an insecure, under-confident teenager. BB becomes convinced Chandra is a sonic guardian and bets Freez and Mo one Chocko Ducko she can prove it. But when Chandra learns about the bet, she mistakenly believes BB was just using her and, in an act of spite, agrees to help Mantyz sabotage the Bounce. As the concert starts, Freefonix's music becomes scrambled, and Chandra realizes the error of her ways. She jumps in to help Freefonix, and everyone realizes she is a sonic guardian, but her powers only work when sound waves are scrambled!\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 28\n |Title = The Jericho Serpent\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alan Hescott\n |OriginalAirDate = {{Start date|2008|12|23|df=y}}\n |ShortSummary = When Freefonix find a piece of an ancient trumpet named the Jericho Serpent, they are told by Sugar to find the other pieces so she can destroy them. After finding the other pieces, Freefonix accidentally assemble the horn and blow it, releasing Satch, Vox's old henchman. Only, it's been so long that Satch mistakes Mo for Vox! After realising his mistake, Satch takes possession of the Serpent and finds the real Vox, forcing a showdown at ComaCo between Freefonix, Mantyz, and Satch before he has a chance to free Vox.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 29\n |Title = Two Moons Rising\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Ray De Laurentis\n |OriginalAirDate = {{Start date|2009|1|2|df=y}}\n |ShortSummary = When Freezbone sees the two moons in the sky one night, he knows it's a bad omen and will bring bad luck to him. He plans to stay in the closet for the duration of the lunar event. Sugar Che gives him \"lucky bling\" to help him get over his superstition but when Kurtz plants a device in it that makes him start dancing like a loon, it seems Freefonix won't be able to stop Mantyz deactivating the Los Bosmos shield at the Shielding Station to allow the power of the two moons in and destroy Freewave forever.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 30\n |Title = Mr Start's Opus\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = \n |OriginalAirDate = {{Start date|2009|1|8|df=y}}\n |ShortSummary = By beaming a sonic ray of corrupt 13th note energy from a satellite, Mya plans to destroy a protected forest to build a new prepsie theme park. As Freefonix try to figure out what Mya is up to, they stumble upon Mo's father playing a truly awful song in Mo's garage. It turns out that Mr Start is a frustrated singer songwriter. It also turns out that his song contains the only sounds dreadful enough to power Mya's deadly sonic ray.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 31\n |Title = Viva La Diva\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2009|1|9|df=y}}\n |ShortSummary = An egotistical sonic entity aptly named Diva escapes the 13th note realm and enters Los Bosmos, where she knows she can be a star. Sugar warns Freefonix that Diva's voice, though beautiful, has the unwanted side effect of unhinging and mixing up sounds - dogs will sound like cats and crying babies will sound like car alarms. Vox sees Diva's arrival as a chance to escape.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 32\n |Title = Manager Mom\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Dan Pilditch\n |OriginalAirDate = {{Start date|2009|1|12|df=y}}\n |ShortSummary = Freefonix decide they need a manager and Mo is horrified when BB and Freezbone decide his very organised mum is the perfect candidate. Tensions run high as Mrs Start becomes the manager from hell, but when Freefonix need help to beat Mantyz in a soundclash, Mo's mum comes to the rescue and Mo realises that despite her fussiness she's a pretty cool mum after all.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 33\n |Title = A Nightmare on Freefonix Street\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Nick Ransome\n |OriginalAirDate = {{Start date|2009|1|13|df=y}}\n |ShortSummary = When Freefonix all have nightmares based on their fears, their Thirteenth Note powers begin to weaken. Vox sees this as a chance to escape the void by making Freefonix's nightmares come true: BB is near-invisible, Freez can't play his guitar, and Mo becomes tiny. Only a sound clash with Mantyz can restore the band to their former states.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 34\n |Title = iMinkys\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Baz Hawkins\n |OriginalAirDate = {{Start date|2008|12|21|df=y}}\n |ShortSummary = BB is sucked into a new fad that is taking Los Bosmos by storm, a cross between a music storage device and a cute little pet. It turns out that the iMinkys are actually a Comaco conspiracy and they are less cute when they start rampaging through the city.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 35\n |Title = BB's Bot\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alex Spiro\n |OriginalAirDate = {{Start date|2009|1|15|df=y}}\n |ShortSummary = BB wins a house robot in a competition and after a rocky start they become firm friends. Little does BB know, the bot has been implanted by Mya with a program to destroy Freefonix. When the bot turns on them, BB has to call on all of her inner powers to keep the bot from succumbing to Mya's evil plan, showing again that good will always prevail over evil.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 36\n |Title = Play It Again Kurtz\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Alex Spiro\n |OriginalAirDate = {{Start date|2009|1|16|df=y}}\n |ShortSummary = When Kurtz is granted exclusive knowledge of a rare Thirteenth Note riff that could give Mantyz unlimited powers, it's up to Freefonix to use all their cunning to decipher the riff before Mantyz can release Vox and Freewave is destroyed forever.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 37\n |Title = Nightshift\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Ross Jameson\n |OriginalAirDate = {{Start date|2009|1|19|df=y}}\n |ShortSummary = Mya decides she wants 24-hour shopping and concocts a plan to keep the people of Los Bosmos awake all night so they can spend more creddies on ComaCo goodies. But a lack of sunshine turns Freezbone, BB and the rest of Los Bosmos onto the dark side and they all join Mantyz. Only Mo can see what's happening and it's up to him to bring the light back to Los Bosmos.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 38\n |Title = Sugar's Day Out\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Ross Jameson and Baz Hawkins\n |OriginalAirDate = {{Start date|2009|1|20|df=y}}\n |ShortSummary = One of Mo's sound shaper experiments goes wrong and sonic lord Sugar Che is transferred into Los Bosmos in human form. As she struggles to adjust to life in Los Bosmos as a soul diva, Freefonix realise that her sonic lord powers are diminishing, being consumed by the evil Lord Vox, who plans to use his increased power to break out of the realm of Silencia and destroy Freefonix. Freefonix must act quickly to stop him.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 39\n |Title = Nine to Fivish \n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = \n |OriginalAirDate = {{Start date|2009|1|21|df=y}}\n |ShortSummary = Mya advertises for a personal assistant, so BB applies for the job in order to gain inside information about recent strange power surges in Los Bosmos. BB discovers the surges are caused by Nerdry's experiments to release the evil Lord Vox from the Void of Silencia into Los Bosmos. A mistake causes Vox's powers to transfer into all the inanimate objects in the office and as Freefonix battle staplers, filing cabinets and rogue office chairs, they call on Sugar Che in an ultimate battle to defeat Lord Vox and return him to the Void of Silencia.\n |LineColor = #F77F00\n}}\n{{Episode list\n |EpisodeNumber = 40\n |Title = The World's Hottest Band\n |DirectedBy = Jerome France and Pierre-Alain Chartier\n |WrittenBy = Lissa Kapstrom\n |OriginalAirDate = {{Start date|2009|1|22|df=y}}\n |ShortSummary = When one of Nerdry's experiments goes wrong, Mantyz accidentally acquire heat energy so great that they become literally the world's hottest band. It's up to Freefonix to find a way to cool things down before Mantyz dominate the planet.\n |LineColor = #F77F00\n}}\n}}\n\n==Album==\n{{Infobox album\n| name       = Freefonix\n| type       = studio\n| artist     = Freefonix\n| cover      = Freefonix Album.jpg\n| alt        =\n| released   = 26 January 2009\n| recorded   = 2007–08\n| venue      =\n| studio     =\n| genre      = {{flat list |\n*[[Pop music|Pop]]\n*[[pop rock]]\n*[[R&B]]}}\n| length     = {{duration|m=44|s=01}}\n| label      = {{flat list |\n*Freewave\n*USM JR}}\n| producer   = {{flat list |\n*[[Magnus Fiennes]]\n*[[Lucas Secon]]}}\n| prev_title =\n| prev_year  =\n| next_title =\n| next_year  =\n}}\n\nA soundtrack to the series was released on 26 January 2009, marketed as the self-titled debut studio album of Freefonix. The album features a handful of songs played in the series. A second album is said to be produced if there is enough interest.\n\n===Track listing===\n{{Track listing\n| collapsed       = no\n| headline        =\n| title1          = Kickin' in the Beat\n| length1         = 2:50\n| title2          = Frequalize\n| length2         = 3:18\n| title3          = We Rule the Playground\n| length3         = 3:04\n| title4          = Livin' It Lovin' It\n| length4         = 3:41\n| title5          = Born to It\n| length5         = 3:14\n| title6          = No Place Like Home\n| length6         = 2:23\n| title7          = Top of the O\n| length7         = 3:13\n| title8          = Obviously\n| length8         = 2:36\n| title9          = What is Cool?\n| length9         = 3:09\n| title10         = Sing\n| length10        = 3:02\n| title11         = Something in the Music\n| length11        = 3:59\n| title12         = They'll Make a Monster of You\n| length12        = 3:18\n| title13         = Best I've Ever Had\n| length13        = 2:51\n| title14         = Do What Ya Like\n| length14        = 2:23\n}}\n\n==References==\n{{Reflist}}\n\n==External links==\n* {{BBC programme}}\n*{{IMDb title|id=0943642|title=Freefonix}}\n*[https://www.youtube.com/freefonix  Freefonix YouTube channel]\n*[http://www.myspace.com/freefonix  Freefonix MySpace page]\n*[https://www.variety.com/article/VR1117979286.html?categoryid=2523&cs=1 Variety article]\n*[http://www.isleofmanfilm.com/pastproductions/2006/freefonix.xml Isle of Man film, show information]\n\n[[Category:2000s British children's television series]]\n[[Category:2008 British television series debuts]]\n[[Category:2009 British television series endings]]\n[[Category:British children's animated action television series]]\n[[Category:British children's animated fantasy television series]]\n[[Category:British children's animated musical television series]]\n[[Category:English-language television shows]]\n[[Category:BBC high definition shows]]\n[[Category:BBC children's television shows]]\n[[Category:Animated musical groups]]\n[[Category:Fictional rock musicians]]\n[[Category:Recorded music characters]]\n[[Category:Musical groups established in 2008]]\n[[Category:British musical trios]]\n[[Category:British pop rock music groups]]\n[[Category:Animated television series about teenagers]]\n[[Category:Television series by Method Animation]]",
            "slug": "home",
            "date_updated": 1615062141520,
            "imported": "https://en.wikipedia.org/wiki/Freefonix"
        }
    ]
}