{
	"next_post_id": 11,
	"next_comment_id": 11,
	"next_follow_id": 4,
	"avatar": "jpg",
	"user_name": "Daffy",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Utilisateur ZeroNet aléatoire",
	"post": [
		{
			"post_id": 1,
			"date_added": 1554705336,
			"body": "Bonjour ZeroMe!"
		},
		{
			"post_id": 1554708501,
			"body": "♥",
			"date_added": 1554708499,
			"meta": "{\"img\":\"732,700,fffeeedba976987a86dcb864ca8eed865974754a75853532,001234561000237748600188225581094822255909A338AB58093C484CBD095222227E09388588CF09355358AC02D388834A\"}"
		},
		{
			"post_id": 1554710015,
			"body": "",
			"date_added": 1554710012,
			"meta": "{\"img\":\"655,700,fff999543776321b98dbaa76532643aa9854edd887dcc211,00012210000344441000356572000766668000787973006A5656760076B75BC00D3BB7A000089B40000E8FFB00\"}"
		},
		{
			"post_id": 1556464099,
			"body": "1 - Le vote est volontaire.\n2 -  Les mariages de même sexe sont de plus en plus courants.\n3 - Tous les livre devront être autorisée tant qu'ils n'appellent pas au meurtre ou à la blessure\n4 - \n5 - programmes de protection sociale.\n6 - Nous avons besoin de plus de liberté d'expression, pas moins\n7 - Parce que, franchement, Dieu est un gros tas de Spaghettis. Tous le monde peux croire en qui il veulent.\n8 - \t\"Nous vivons dans une période de turbulences, Turbulent et dangereux et la seule reponse et d'augmenter les effectif militaire\n9 - Les dépenses d'éducation et de bien-être social à la hausse.\n10 - Il est interdit aux partis politiques de faire de la publicité et de recevoir des dons privés.\n11 - Les personnes à revenu élevé paient un taux d'imposition égal en pourcentage aux plus pauvres \n12 - Fumer est légal tant que ça n'embête personne c'est à dire vous pouvez fumer chez vous mais pas dans un lieu public\n13 - Toutes les principales zones publiques sont surveillées par des caméras de surveillance de la police.\n14 - Le principe de la liberté d'expression est cheri.\n15 - On a a besoin de plus de protection de l'environnement\n16 - Un filet de sécurité sociale bien financé protège les malheureux.\n17 - Les scientifiques devraient respecter les règles éthiques\n18 - Le ton d'organes est autorisé mais ils ont le choix\n19 - Les émission de télévision devraient être libre de diffuser ce qu'il veulent\n20 -  Les plages sont des espaces publics",
			"date_added": 1556464095
		},
		{
			"post_id": 1561711892,
			"body": "представляет себе, что российское и китайское правительства критикуют Францию в отношении свободы печати, и хуже всего то, что они будут абсолютно правы.",
			"date_added": 1561711887
		},
		{
			"post_id": 1561713768,
			"body": "C'est vraiment triste quand nous traitons des entreprises / entreprises privées comme des entités publiques / gouvernementales. Personne n'a le droit aux produits ou services de quelqu'un d'autre.  Les interdictions de censure s'appliquent UNIQUEMENT aux gouvernements d'états et locaux \"Mais c'est une plateforme PRIVE. Le gouvernement ne se soucie guère de la propriété privée (à moins que ce soit la leur), elle aime juste voir ses ennemis politiques et idéologiques punis.  Je n'aime pas que Google, Facebook, etc., censurent la liberté d'expression, mais je dois soutenir leur droit de le faire si je veux respecter les principes de la propriété privée. La cohérence des principes principaux.",
			"date_added": 1561713762
		},
		{
			"post_id": 1562662129,
			"body": "What does he think the opposition for Macron is? They are conspiracyists, who are on the side of evil, of hatred. They can afford the worst thing in the face of the \"hate parties\", for him the opposition is extremists. he considers himself as good and his opponents as evil. i of course some members of the opposition are stupid which does not help anything",
			"date_added": 1562662122
		},
		{
			"post_id": 1562758729,
			"body": "I saw the ideological sect on the documentary on evergreen school in Washington State \"the excesses of progressivism\". It looks like a sect except that this sect is the current institutional climate. If you are left-wing and you oppose this ideology you are considered a facho. I have seen the article of \"Marianne\" or Americans trapped sociologists by providing them with extracts from \"Mein Kampf\" by replacing the word \"Jewish\" by \"white\" sociologists have validated these terms. It's frightening because French universities follow the same patterns and I have the impression that my high school courses are written by blue-haired people who follow this kind of ideology. I have seen people from the extreme left and socialist parties being sorry that this is the way it is. There are testimonies such as the testimony on the University of Tolbiac, the University of Rouens and the University of Lille \"Evergreen et les dérives du progressisme\" de Sanglier Sympa",
			"date_added": 1562758721
		},
		{
			"post_id": 1563021410,
			"body": "Test Message \nFailure to sign the content\nInclude too large 19273B > 10000B",
			"date_added": 1563021401
		},
		{
			"post_id": 1563176713,
			"body": "@ironwoman: Pour le post que je n'ai pas pu poster\n- Je connais le problème de la censure par des entreprises privé, j'ai vu pleins des gens qui se plaignent d'un 410 abusif sur des sujet du genre \"j'ai mangé une pomme\". Les administrateur prétendaient lutter contre des contenus illégaux et hors charte hors c'étais pas que ces sujet là qui ont été visé par la censure et du coup bruiter le clone de ces site répertorie les 410 au debut j'ai vu un 410stat et j'ai halluciné en voyant que 22/25 des contenus supprimé n'étaient ni hors charte ni illégal. Bon maintenant je vois qu'il y a quasi que des sujets hors chartes dessus ce qui est leurs boulots normalement, Samedi j'ai vu des gens parler à un admin de la loi avia, l'admin a déclaré que le site était fier d'appliquer la loi Avia depuis fin 2017 et puis après le lendemain matin il a effacé tous les messages alors que c'étais pas hors charte. C'est impossible de dire qu'une entreprise privé à tort sur la censure car elle a le droit de faire ce qu'elle veux hors là le problème de la loi avia ce que la censure viens directement d'un ordre du gouvernement, vous ne pourrez pas contester car \"c'est privé\". Je sais le comportement du fofo en octobre-novembre c'étais une connerie qui a permis de donner du pouvoir à des extrémistes du genre fac de Tolbiac, Facs de Rouen, Facs du Mirail, Nantes\n- la liberté d'expression en France n'existe que sur les espaces publiques (= qui appartiennent à l'Etat) et non pas sur les espaces privés (= qui appartiennent à des individus ou sociétés privées). mais le problème ce que tu pourra rien dire en public sinon tu seras victime d'ostracisme\n- Je cite un post du début de l'année dernière \"C'est une règle qu'ils appliquent eux-même, sans la nommer, parce que techniquement ils sanctionnent quelque chose qui n'est pas interdit. Et ils ne bannissent pas pour ça parce que justement ce n'est pas interdit. Du coup tout ce qu'il reste, c'est la censure bête et méchante. Ils ne peuvent pas ouvertement restreindre la liberté d'expression avec des règles écrites, ça leur retomberait dessus et ça serait facile à screener pour le montrer. Alors ils censurent tout bêtement, et si quelqu'un proteste, ils diront qu'ils ne le font pas, et que nul part il n'y a de règle qui interdit la critique d'un mouvement.\"\n- Les libéraux ont dis  \"En revanche, la \"censure privée\" est tout à fait légitime, car elle s'exerce dans un cadre privé et exprime les droits du propriétaire\"\" et si le mec qui a la propriété privé censure n'importe quoi, n'importe comment en possédant un monopole ? Le monopole fait que ça reste par exemple au alentour de 2000 connecté en direct, les gens se plaignent de la censure absurde en masse ils créent une autre alternative avec disons 10-100 connecté seulement par jour. J'ai par exemple vu le cas d'une personne victime d'une censure rat-taupe-nu alors que la discussion étais dans la partie \"général\" je voulais pas poster sur zerome à la base mais sur un autre \"site\" de zeronet",
			"date_added": 1563176703
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Bonjour Lordangelux",
			"post_uri": "1KytKP79oaw4HeonU6E6teNnW5TsQbViSM_1",
			"date_added": 1554710672
		},
		{
			"comment_id": 2,
			"body": "Bonjour, tu es en forme ?",
			"post_uri": "1KAfaybmXBh916cDwXjd4gaE7ScnwfiYcR_1554579392",
			"date_added": 1554710704
		},
		{
			"comment_id": 3,
			"body": "http://127.0.0.1:43110/Sites.ZeroNetwork.bit/\n",
			"post_uri": "1HzU7f1Ctj6bKEU1aNQrb7ULzvW18TmTMi_1555325036",
			"date_added": 1555326296
		},
		{
			"comment_id": 4,
			"body": "It has the ISLAM party in Belgium which obtained a seat thanks to Molenbeek I know that the problem of this kind of party what their program is a setback of human rights, they will for example in their speeches say that women are inferior to men. The Koran is supposed to be Allah's word and therefore unchangeable, but its laws are too old and not adapted to our times. For a moment my moral and civic education teacher told me that Marine Le Pen was a racist I thought that for a few months without questioning my teacher then I saw that Marine Le Pen was not so Islamophobic as that since she was taking pictures with Muslims and that's when they finally called me a facho I couldn't argue but they were worse they made reductio ad hitlerium. Some killers think she's racist when she's not, so I'm associated with these killers. I'm sick of it.",
			"post_uri": "1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX_1557862416",
			"date_added": 1558203682
		},
		{
			"comment_id": 5,
			"body": "bonjour mikdesign",
			"post_uri": "13fQ8RFfUT5wRxjXDU9E44WZ2B97MJhWsb_1",
			"date_added": 1558793204
		},
		{
			"comment_id": 6,
			"body": "Bonjour",
			"post_uri": "1BRALBKEE8wikdRiqeGNaXdMrifhoKUxDS_1",
			"date_added": 1559284246
		},
		{
			"comment_id": 7,
			"body": "bonjour",
			"post_uri": "13YJoLJZTP1GCXs2XMddquvwhfYaBFNf7m_1",
			"date_added": 1559311054
		},
		{
			"comment_id": 8,
			"body": "@If0: Привет, проблема в том, что есть люди, которые говорят \"хуже, чем в России, быть не может\", когда правительство делает что-то глупое, что оно бы осудило, если бы оно было где-то еще. До демонстраций правительство уже рассматривало его как \"врага демократии\" с ассоциативной атакой в стиле \"они нацисты\", поэтому оно относилось к ним как к таковым, разрешая демонстрации. Я думал, что живу в мире, где люди не должны пострадать или умереть, чтобы ими манипулировали, я был немного неправ, они добавляют клевету крестными замечаниями, я видел нечто абсурдное в партии, известной как \"крайне правая\", чтобы быть единственным, кто идет против закона, вредного для демократии, и я думал себе \"как жаль, что она говорит это потому что она права\", но поскольку у нее репутация дьявола, никто не понимал. Я знаю, что мы живем почти как привилегированные маленькие дети на Западе \"хлеб и игры\" - вот чего хотят люди, потому что 300 000 - это не так уж много, и я сомневаюсь, что миллион человек в настоящее время маршируют по улицам Парижа. Я вижу цензуру \"против ненависти\", критику со стороны ассоциаций защитников свободы слова. Проблема в том, что \"борьба с ненавистью\" популярна и депутат, голосующий против закона \"против ненависти\", пострадает от плохой репутации, и вы можете себе представить газеты \"крайним правом голоса против закона \"против ненависти\" и их влияния на массы\". Когда я увидел президента с банановым счетом, я подумал, что это исключает меня из западной мессы. Я узнал пугающие вещи, которые являются правдой, такие как то, что левая газета продвигала парня, оскорбившего мультфильм после пожара этой газеты в 2011 году, с явно незаконными комментариями, и даже был один будущий депутат, который сказал, что она была против этой газеты после пожара, какое неуважение она избрала сегодня, но народ не знает ее комментариев против нее.",
			"post_uri": "1EKuhc7Z1NrcT5LexBRAJsKVyt9oiPSAkc_1561711892",
			"date_added": 1562404359
		},
		{
			"comment_id": 9,
			"body": "how you do it ?",
			"post_uri": "1B8RRWzQpdQyCSV7UvbQZQW6qGvBoLuocv_1562007949",
			"date_added": 1562565539
		},
		{
			"comment_id": 10,
			"body": "@Caropc5  The documentary the red pill talks about the same ideology as in evergreen university. For example, in the documentary \"the red spill\" there was a time when feminists called those who disagree with her facho and macho. evergreen university (washinton states) there are students who humiliate those who disagree with them, they introduce segregation: ",
			"post_uri": "1EKuhc7Z1NrcT5LexBRAJsKVyt9oiPSAkc_1562758729",
			"date_added": 1563022734
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1EKuhc7Z1NrcT5LexBRAJsKVyt9oiPSAkc",
			"user_name": "Daffy",
			"date_added": 1554710350
		},
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "13YJoLJZTP1GCXs2XMddquvwhfYaBFNf7m",
			"user_name": "Yreyory",
			"date_added": 1559311231
		},
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1BEt1F2JpPiMu7kxjyk92uYUz1z8JYRb59",
			"user_name": "Motherhen",
			"date_added": 1563021295
		}
	]
}