{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 32,
	"comment": {
		"10_1EEj7HkE59AB2rExqQgD5TXsipqHvbtnnP": [
			{
				"comment_id": 1,
				"body": "> [olhador](#comment_2_1MmWLh75HG1yfzP1TtTdAwPkeBJEBxQ8me): Baboseira, você e eu. Comemos por 10 africanos, gastamos mais energia que 10 africanos... deixa de ser hipócrita.Se qualquer um aqui tivesse um jato faria igual ou pior.\n\n#Falácia Tu quoque\nTu quoque (Você também) ou falácia do apelo à hipocrisia é uma falácia informal que pretende desacreditar o argumento do adversário afirmando que este falha em agir consistentemente de acordo com a conclusão do próprio argumento e não em rebater os argumentos elaborados por este.\n- Fonte: https://pt.wikipedia.org/wiki/Tu_quoque",
				"added": 1588521789
			}
		],
		"4_1DzzCLZPTRXVQCDf7AGyr6ZEyeqg9NJDQ1": [
			{
				"comment_id": 2,
				"body": "> [olhador](#comment_8_1MmWLh75HG1yfzP1TtTdAwPkeBJEBxQ8me): Você está em um ambiente mais avançado e também descentralizado. Não entendi porque você está fazendo propaganda de algo mais arcaico. Nesse nosso ambiente você também pode compartilhar arquivos, vídeos e tudo mais.\n\nVocê está fazendo tempestade em copo d'água. Qual é o problema em divulgar outras redes descentralizadas aqui? Caso não saiba, a Retroshare tem possibilidade de fazer integração com [Tor](https://www.torproject.org/) ou [I2P](https://geti2p.net/pt-br/), que possui diversas [vantagens em relação ao Tor](https://geti2p.net/en/comparison/tor). \n#Lembrete: por enquanto, a ZeroNet só possui integração com Tor. E, como já foi divulgado no blog do projeto Tor, Bittorrent+Tor não é uma boa ideia: https://blog.torproject.org/bittorrent-over-tor-isnt-good-idea",
				"added": 1588522146
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 3,
				"body": "#A eficácia irracional da matemática nas ciências naturais\n- https://gateway.pinata.cloud/ipfs/QmePZhp7Y4HKcxuegt6mvowAwU1KPY63krAb9HpMxrQhrM\n\n\n \"A eficácia irracional da matemática nas ciências naturais\" é o título de um artigo publicado em 1960 pelo físico Eugene Wigner. No artigo, Wigner observou que a estrutura matemática de uma teoria física frequentemente indica o caminho para avanços adicionais nessa teoria e até para previsões empíricas.",
				"added": 1588538398
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 4,
				"body": "#O Brasil privatizado: Um balanço do desmonte do Estado\n- https://gateway.pinata.cloud/ipfs/QmSfdiLp9BJHVo8woLNoHnhp8gE4eBCjhLaqL7yoUhBLFe\n\nQuem não leu este livro não tem — e nem terá — a menor ideia do que se passou nos anos 1990. Foi quando o Brasil, ao torrar suas estatais, emprestar dinheiro para os compradores as adquirirem e aceitar moedas podres no pagamento, fechou alguns dos piores negócios de que se tem notícia. Mais: antes de privatizar as empresas de energia e telefonia, o governo do PSDB turbinou as tarifas em até 500 por cento, o que premiou o comprador e puniu o consumidor. Seu autor, Aloysio Biondi, um dos mais importantes jornalistas de economia que o país já teve, não recorre ao discurso político-ideológico para nos convencer. Usa uma ciência mais neutra, a matemática. Aqui, os números falam pelas palavras. É um trabalho profundo, meticuloso e — importante — didático. Biondi procurou e descobriu as muitas caixas-pretas das privatizações. E, para nosso espanto e horror, abriu uma a uma, escancarando o tamanho do esbulho que a nação sofreu.",
				"added": 1588538874
			},
			{
				"comment_id": 5,
				"body": "#O Brasil Privatizado II: O assalto das privatizações continua\n- https://gateway.pinata.cloud/ipfs/QmcdxDF4PB34SLD6HVtncDwZUKaPpTgerbjwsYSJbKNRyS\n\n\nA publicação de O Brasil Privatizado II: O assalto das privatizações continua poderia ser justificada de várias formas. A mais imediata seria simplesmente dizer: “O Aloysio já havia acertado com a Editora Fundação Perseu Abramo uma continuação do primeiro.\nAlém disso, ele até já preparara um roteiro, apontando os temas que seriam abordados, e estava pronto para começar o trabalho” – o que é verdade.\nPoderíamos também lembrar que o tema continua a ser de importância fundamental na discussão da política econômica, dos rumos e do futuro do país. Embora muita coisa tenha mudado após O Brasil Privatizado – Um balanço do desmonte do Estado, publicado em abril de 1999, várias distorções no processo de privatização foram mantidas. O favorecimento a grupos específicos; a utilização de recursos do BNDES; os prejuízos que o governo, “o povão, a classe média, os agricultores”, como dizia Biondi, tinham com o “saneamento” das empresas que eram privatizadas; a importação maciça de peças por parte das multinacionais que “compravam” as estatais; as remessas de lucro para o exterior. Todas essas características do processo, que se mantiveram praticamente inalteradas, o autor pretendia discutir neste segundo livro –  mais especificamente com relação ao setor energético, sobretudo no que diz respeito ao petróleo, e aos bancos estatais.\nA necessidade da publicação, seja do ponto de vista profissional, seja sob a ótica da pertinência do assunto, não justificaria de todo, porém, que esse volume chegasse a público.\nAlém de continuação do primeiro trabalho, O Brasil Privatizado II tem como principal justificativa realizar uma homenagem a Biondi. Homenagem essa em parte bastante difícil, pela qualidade e quantidade de artigos que ele escrevera sobre o tema após o livro inicial. Pela ausência do jornalista, amigo e pai. Pela dificuldade em se trabalhar sem ele e, ao mesmo tempo, tentar pensar um pouco como ele, imaginar como ele gostaria que o livro fosse, que tabelas montaria, como analisaria os dados, como relacionaria as informações. Não nos demos o direito de fazer tais análises, sabíamo-nos incapazes. Haveria, aliás, alguém capaz de realizar esse trabalho como ele?",
				"added": 1588539118
			},
			{
				"comment_id": 8,
				"body": "#Biblioteca - [Blog Solidariedade a Coreia Popular](https://solidariedadecoreiapopular.blogspot.com/)\n\n O Centro de Estudos da Ideia Juche - Brasil iniciou em 2017 o trabalho organizar o material já traduzido ao longo do tempo de atividades, com artigos, discursos e documentos escritos pelos camaradas Kim Il Sung, Kim Jong Il e Kim Jong Un, em pdf, em um formato digital inspirado nas Edições em Línguas Estrangeiras de Pyongyang, para que facilite o estudo dos interessados.\n\nVeja a lista dos trabalhos já editados: https://gateway.pinata.cloud/ipfs/QmdHVY1BFWqAtaGdZnaUXuTUyu37LnarjTCX4VXcWqQu5B",
				"added": 1588540467
			},
			{
				"comment_id": 17,
				"body": "#Library Genesis\n\nLibrary Genesis ou LibGen é um motor de busca de artigos científicos e livros, que permite o acesso aberto a conteúdo protegido sob acesso pago. Entre outros, esse site carrega PDFs de conteúdos dos portais de internet Elsevier e ScienceDirect.\n\n- http://gen.lib.rus.ec/\n- https://libgen.pw/\n- https://libgen.is/\n\nLista de servidores ativos: https://vertsluisants.fr/index.php?article4/where-scihub-libgen-server-down",
				"added": 1588545285
			},
			{
				"comment_id": 18,
				"body": "> [keyficid](#comment_17_1MDyXZ8EMhcUoiBMC53DFxFYYsLPT61phy): Library Genesis\n> Library Genesis ou LibGen é um motor de busca de artigos científicos e livros, que permite o acesso aberto a conteúdo protegido sob acesso pago. Entre outros, esse site carrega PDFs de conteúdos dos portais de internet Elsevier e ScienceDirect.\n> \n> http://gen.lib.rus.ec/\n> https://libgen.pw/\n> https://libgen.is/\n> \n> Lista de servidores ativos: https://vertsluisants.fr/index.php?article4/where-scihub-libgen-server-down\n\n#Cloudflare free servers\n\nlibgen.unblocked.at\nlibgen.unblocked.mobi\nlibgen.unblocked.app\nlibgen.unblocked.win\nlibgen.unblocked.name\nlibgen.unblocked.me.uk\nlibgen.unblocked.blue\nlibgen.unblocked.club\nlibgen.unblocked.how\nlibgen.unblocked.pink\nlibgen.unblocked.cloud\nlibgen.unblocked.gdn\nlibgen.unblocked.vet\nlibgen.unblocked.red\nlibgen.unblocked.uno\nlibgen.unblocked.tv\nlibgen.unblocked.cat\nlibgen.unblocked.ink\nlibgen.unblocked.pro\n\nlibgen.unblocked.mx\nlibgen.unblocked.lat\nlibgen.unblocked.tw\nlibgen.unblocked.co\nlibgen.unblocked.sh\nlibgen.unblocked.pl\nlibgen.unblocked.li\nlibgen.unblocked.bet\nlibgen.unblocked.vip\nlibgen.unblocked.live\nlibgen.unblocked.cam\nlibgen.unblocked.one\nlibgen.unblocked.pub\nlibgen.unblocked.pw\nlibgen.unblocked.bid\nlibgen.unblocked.onl\nlibgen.unblocked.ve\nlibgen.unblocked.la\nsci.libgen.me",
				"added": 1588545630
			},
			{
				"comment_id": 19,
				"body": "1 - https://sci-hub.tw/\n2 - https://booksc.org/\n3 - https://sci-hub.ren/\n4 - http://93.174.95.27/scimag/\n5 - http://gen.lib.rus.ec/scimag/\n6 - http://libgen.is/scimag/\n7 - http://sci-hub.wang/\n8 - https://sci-hub.shop/\n9 - https://booksc.xyz/\n10 - http://libgen.st/scimag/\n11 - https://libgen.me/\n12 - https://libgen.lc/\n13 - https://sci-hub.im/",
				"added": 1588546943
			},
			{
				"comment_id": 20,
				"body": "#Diamantes de Sangue: Corrupção e Tortura em Angola\n- https://gateway.pinata.cloud/ipfs/Qmc3TjNWC6pJS8AqGdG3ftQTsfAFYS7wMmsyLbnvbxXDCJ\n\nO trabalho de investigação de Rafael Marques é já bem conhecido, sobretudo através dos canais de comunicação on-line. É ele um dos principais responsáveis por denunciar e divulgar os esquemas de corrupção que envolvem as mais altas esferas do poder em Angola, bem como as empresas e entidades estrangeiras que com ele negoceiam. Na região do Cuango, a situação é trágica. Para benefício dos que exploram os diamantes, as populações são mantidas em condições de quase escravatura, sendo torturadas, assassinadas, roubadas e impedidas de manter quaisquer actividades de auto-subsistência. As autoridades e o governo ignoram os crimes, as forças armadas e policiais são não só coniventes como também protagonistas desses crimes.",
				"added": 1588557226
			},
			{
				"comment_id": 21,
				"body": "#Falácias de Moro: Análise Lógica da Sentença Condenatória de Luiz Inácio Lula da Silva - Euclides Mance\n- https://gateway.pinata.cloud/ipfs/QmcH2nZVMSybznDn59Gb9hotAGaDZT8AGCCMxJEZHNEvzC\n\nEste livro está disponível para download gratuitamente na internet. A compra de um exemplar aqui serve como contribuição solidária com o autor e editora pelo trabalho realizado. O texto apresenta uma análise exaustiva das principais inconsistências lógicas, tanto semânticas quanto formais, presentes na sentença condenatória do ex-presidente Lula no caso do triplex do Guarujá. O livro está dividido em duas partes, demonstrando que os argumentos do juiz violam frequentemente as leis da lógica para obter conclusões que não podem ser validamente obtidas. Na primeira parte, analisa dez falácias, explicando-as uma a uma, indicando sua forma lógica e a nomenclatura filosófica recorrente na tipificação desses raciocínios falhos, facilitando sua análise e estudo com base na tradição acadêmica. Na segunda parte, percorre a sentença como um todo, evidenciando os diferentes erros lógicos cometidos pelo juiz no transcorrer de sua argumentação, demonstrando como a condenação do ex-presidente está apoiada justamente nessas inconsistências lógicas.",
				"added": 1588558623
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 6,
				"body": "#A discreta transição da Coreia do Norte: diplomacia de risco e modernização sem reforma\n- https://gateway.pinata.cloud/ipfs/Qmc7r4G84goUREWnJugMwb6hWeHHaQAPGuLGrwVwWuVpCJ\n\nA Coreia do Norte acaba de passar por nova sucessão, com um líder jovem, o que para analistas representa ausência de mudanças e esgotamento do regime. Enquanto as disputas de poder interno e as crises militares externas parecem sinalizar continuidade, e que foram iniciadas algumas transformações importantes. O regime impulsiona a modernização da defesa, enquanto recoloca o Partido como ator relevante, definindo o desenvolvimento econômico como vetor. Mas a modernização em curso prossegue com a tradicional diplomacia de risco que parece descartar a ideia de reforma, conservando a essência do regime.",
				"added": 1588539750
			},
			{
				"comment_id": 7,
				"body": "> [lensombo](#comment_1_14tPtkpr1VBND7gAcThMkSziyZBMXUBx4J): Coreia do Norte em Foco.\n> \n> https://www.facebook.com/coreiadonorteemfoco/\n> \n> Coreia do Norte em Foco tem como objetivo divulgar as conquistas do regime socialista da República Popular Democrática da Coreia.\n> Blog Solidariedade a Coreia Popular\n> \n> https://solidariedadecoreiapopular.blogspot.com/\n> \n> O Blog Solidariedade a Coreia Popular é a página oficial do Centro de Estudos da Ideia Juche - Brasil. O objetivo do Blog criado em 2010 é divulgar informações sobre a Coreia Popular, criando assim um contraponto às constumeiras mentiras e deturpações da imprensa ocidental.\n> Centro de Estudos da Política Songun – Brasil\n> \n> https://cepsongunbr.com/\n> https://www.facebook.com/CEPSBR/\n> https://invidio.us/channel/UC001pdZ7vaiksSDtyvlgmMg\n> https://twitter.com/CEPSBR\n> https://www.instagram.com/cepsongunbr/\n> \n> O Centro de Estudos da Política Songun – Brasil é uma organização responsável pelo estudo da política de valorização dos aspectos militares adotada pela República Popular Democrática da Coreia, além da discussão sobre temas históricos, políticos, econômicos, filosóficos e sociais do país.\n> KFA - Brasil - Associação de Amizade com a Coreia\n> \n> https://korea-dpr.com/index.html\n> https://www.facebook.com/KFA.Brasil/\n> \n> A Associação de Amizade da Coreia (KFA) foi fundada em novembro de Juche 89 (2000) com o objetivo de construir laços internacionais com a República Democrática Popular da Coreia. Tem atuação em 120 países. A KFA tem total reconhecimento do Governo da República Popular Democrática da Coreia, e foi criada com a aprovação desta.\n> O Outro Lado da Coreia do Norte\n> \n> https://www.facebook.com/OOutroLadodaCoreiadoNorte/\n> https://invidio.us/channel/UC4RwYem5zm74VxqV1wPVPMg\n> \n> Pagina com o objetivo de mostrar O Outro Lado da Coreia do Norte, que vive constantemente sendo bombardeada com enxurradas de mentiras, falacias e calunias por parte da grande mídia.\n\n#Sobre a Coréia do Norte no Ciberespaço: O Juche e o Grande Líder nas Páginas do Solidariedade à Coréia Popular \n- https://gateway.pinata.cloud/ipfs/Qme3UczPdMnUPtVchnS7irv5v4gDwbem8CMM9vEiN9qm7a\n\nEste artigo analisa o blog “[Solidariedade à Coréia Popular](https://solidariedadecoreiapopular.blogspot.com/)” (S.C.P.) e sua proposta de apresentar o que realmente seria a Coréia do Norte. Esta iniciativa está inserida no contexto dos usos do ciberespaço por grupos que encontram neste ambiente um local propício para apresentar versões alternativas sobre temas polêmicos. Através da análise de postagens selecionadas, será possível entender como essa proposta se fundamenta e como a mesma apresenta o Juche e seu criador Kim Il-Sung. A análise demonstrará como a visão apologética do S.C.P. está em conformidade com o discurso feito pelo governo norte-coreano, fazendo com este blog seja considerado uma página de apoio ao regime.",
				"added": 1588539890
			},
			{
				"comment_id": 9,
				"body": "#Biblioteca - [Blog Solidariedade a Coreia Popular](https://solidariedadecoreiapopular.blogspot.com/)\n\n O Centro de Estudos da Ideia Juche - Brasil iniciou em 2017 o trabalho organizar o material já traduzido ao longo do tempo de atividades, com artigos, discursos e documentos escritos pelos camaradas Kim Il Sung, Kim Jong Il e Kim Jong Un, em pdf, em um formato digital inspirado nas Edições em Línguas Estrangeiras de Pyongyang, para que facilite o estudo dos interessados.\n\nVeja a lista dos trabalhos já editados: https://gateway.pinata.cloud/ipfs/QmdHVY1BFWqAtaGdZnaUXuTUyu37LnarjTCX4VXcWqQu5B",
				"added": 1588540488
			},
			{
				"comment_id": 14,
				"body": "#O socialismo funciona? \n\n#Economias planificadas e de propriedade pública funcionam?\n\n  A União Soviética foi um exemplo concreto do que uma economia planificada pôde produzir: pleno emprego, pensões garantidas, licença maternidade paga, limites de horas de trabalho, cuidados médicos e educação (incluindo ensino superior) gratuitos, férias pagas, moradia barata, cuidado infantil a baixo custo, transporte público subsidiado e baixa desigualdade de renda. A maioria de nós deseja tais benefícios. Entretanto, eles são alcançáveis permanentemente? É largamente acreditado que embora a União Soviética tenha produzido tais benefícios, no fim a economia de propriedade pública e planificada provou-se um fracasso. Caso contrário, como explicar o fim do país? Ainda sim, quando a economia soviética foi pública e planificada, de 1928 a 1989, esta cresceu de forma sólida ano a ano, exceto durante os anos de guerra. Para ser claro, enquanto as economias capitalistas mergulharam em uma depressão profunda e solidamente caíram em recessões de poucos em poucos anos, a economia soviética infalivelmente não o fez, expandindo-se incessantemente e proporcionando emprego a todos. Longe de ser um fracasso, a economia pública e planificada da União Soviética funcionou notavelmente bem. O que não funcionava era o capitalismo, com suas ocasionais depressões, regulares recessões, desempregos em massa e extremos de riqueza e pobreza, tanto mais evidente hoje quando as economias capitalistas contraem ou mancam juntas, condenando inúmeras pessoas à inatividade. O que eventualmente levou à queda da União Soviética foi  o pedágio acumulado sobre a economia soviética para derrubá-la, a intensificação da Guerra Fria pelo governo Reagan e a inabilidade da liderança soviética para achar uma maneira de escapar do prejuízo que tais coisas causaram.\n\n Nos anos 80, a URSS estava demonstrando as estirpes da Guerra Fria. Sua economia crescia, mas a um ritmo menor que no passado. A competição militar com seu adversário ideológico, os EUA, atrasou seu crescimento de várias maneiras. Primeiro, recursos R&D (pesquisa e desenvolvimento, ''research and development'') foram monopolizados pelos militares, privando a economia civil dos melhores cientistas, engenheiros e ferramentas. Segundo, gastos militares aumentaram para se responder ao abandono da trégua em favor de uma nova corrida armamentista por parte do governo Reagan que tinha claramente como objetivo prejudicar a economia soviética. Para impedir a agressão estadunidense, os soviéticos utilizaram uma punitiva porcentagem de seu PIB no setor militar enquanto os EUA, com uma economia maior, investiam mais em termos absolutos porém em uma cota menor e mais gerenciável da renda nacional. Em terceiro lugar, para se proteger contra os perigos de depender de importações estrangeiras de matérias-primas importantes que poderiam ser cortadas para deixar o país de joelhos, a União Soviética escolheu extrair matérias-primas de seu próprio vasto território. Ao mesmo tempo em que fez a URSS autossuficiente, o abastecimento interno enredou o país numa armadilha Ricardiana*. O custo de produzir matérias-primas aumentou, à medida que fontes mais novas e difíceis de alcançar precisavam ser exploradas enquanto as mais velhas e de fácil alcance se esgotavam. Em quarto lugar, a fim de melhor defender o país, os soviéticos procuraram aliados no leste europeu e no terceiro mundo. Porém, porque a URSS era mais rica que os países e movimentos com que se aliou, esta se tornou a âncora e financiadora oficial dos outros países socialistas, movimentos de libertação e estados que buscavam libertar-se da espoliação por parte das potências ocidentais. Como seu número de aliados, aumentou, e Washington manobrou para armar, financiar e apoiar as revoltas anti-comunistas em uma tentativa de impôr pressão adicional ao tesouro soviético, os custos de Moscou para auxiliar seus aliados. Esses fatores — corolários da necessidade de prover defesa para a União Soviética — combinaram-se para empurrar custos até o ponto que eles impediram seriamente o crescimento soviético.\n\n  Com a desaceleração do crescimento e os custos de defender o país aumentando, parecia que era apenas uma questão de tempo até que a URSS se achasse entre a Scylla de um posicionamento militar insustentável e a Caríbdis de uma falência impulsionada pela corrida armamentista. Mikhail Gorbatchev, o último líder do país, enfrentou um dilema: ele poderia falir a economia tentando manter o ritmo com os gastos armamentistas americanos ou retirar-se completamente da corrida. Gorbatchev escolheu a última opção. Ele agiu pelo fim da Guerra Fria, retirando auxílio militar aos aliados e comprometendo-se à cooperação com os Estados Unidos. No plano econômico, ele agiu para transformar a União Soviética em uma social-democracia ocidental. Entretanto, ao invés de resgatar o país de um futuro de crescimento econômico ainda mais lento, as capitulações de Gorbatchev em política econômica e externa levaram a um desastre. Sem a mão restritiva da União Soviética, os Estados Unidos iniciaram uma série de agressões ao redor do mundo, a começar pelo Iraque, prosseguindo à Iugoslávia, Afeganistão, Iraque de novo e então Líbia, com numerosas intervenções menores entre essas. O abandono do planejamento econômico e os esforçar para limpar o caminho para a implementação de uma economia de mercado empurrou o país para uma crise. Dentro de 5 anos, a Rússia mostrou-se um desastre econômico. O desemprego, a falta de moradia, a falta de segurança e o parasitismo social (viver do trabalho dos outros) retornaram como uma vingança.\n\n No dia de natal de 1991, data em que a URSS oficialmente acabou, Gorbatchev disse: ''Vivemos em mundo novo. A Guerra Fria está terminada. A corrida armamentista e a militarização louca dos Estados, que deformaram nossa economia, sociedade e valores, foram parados. A ameaça de uma guerra mundial foi eliminada'' (Roberts, 1999). Isso fez de Gorbatchev bastante popular no ocidente. Os russos  estavam bem menos entusiasmados. Contida nas palavras de Gorbatchev estava a verdade de que a primeira tentativa consciente do mundo de construir uma alternativa ao capitalismo havia chegado ao fim. Não foi porque o sistema soviético provou-se ineficiente; pelo contrário, ele mostrou funcionar melhor que o capitalismo. A verdadeira razão para o fim da URSS foi que seu líder capitulou diante de um inimigo americano, que, desde a 2º Guerra Mundial, e com vigor crescente durante a era Reagan, promoveu uma corrida armamentista para eliminar a economia soviética. Esta foi uma economia que funcionou para 99% da população, e, portanto, se lhe tivesse sido permitido prosperar, teria desacreditado as economias privadas e reguladas pelo mercado de que 1% da população se favorece e beneficia. Foi esse modelo de livre iniciativa e desregulamentação do mercado que gerou vasta riqueza, conforto e segurança as prerrogativas dos capitães da indústria e titãs financeiros e desemprego, pobreza, fome, insegurança econômica e indignidade — condições necessárias para a existência dos 1% mais ricos — para o resto de todo mundo.\n\n Os 21 anos desde o fim da URSS não têm sido fáceis. Stálin, sob cuja tutela a primeira economia pública e planificada do mundo foi construída, deu certa vez uma advertência profética: ''O que aconteceria se o capitalismo conseguisse esmagar as repúblicas soviéticas? Isto iniciaria uma era da mais negra reação nos países capitalistas e coloniais. A classe trabalhadora e os povos oprimidos seriam pegos pela garanta, as posições do comunismo mundial estariam perdidas'' (Stalin, 1954). E da forma como Stálin havia precisamente profetizado 10 anos antes da operação Barbarossa, a invasão nazista da União Soviética, que seu país tinha apenas 10 anos para se preparar para um ataque, também previu ele com precisão as consequências da queda da União Soviética perante as forças do capitalismo. Uma era da mais negra reação, de fato, iniciou-se. Washington tem agora mais liberdade para força militar para prosseguir com sua agenda reacionária em todo o mundo. A posse pública e a planificação mantém-se em Cuba e na Coreia do Norte, porém os Estados Unidos e seus aliados usam sanções, isolamento diplomático e assédio militar para sabotar as economias dos sobreviventes (tal como fizeram com a economia soviética), de modo que as consequências podem ser falsamente atribuídas às deficiências da propriedade pública e da planificação. Elas são, na verdade, fruto de um programa metódico de guerra de baixo nível. Estimulados a acreditar que o sistema econômico soviético tinha falhado, muitas pessoas, incluindo tanto os defensores e detratores comunistas da União Soviética, concluíram que um sistema de propriedade pública e planificação é inerentemente defeituoso. Comunistas bandearam-se de partidos comunistas para social-democratas, ou abandonaram a política radical logo. Os social-democratas deslocaram-se à direita, evitando a reforma e abraçando o neoliberalismo. Além disso, os governos ocidentais, não precisando mais barrar o apelo da propriedade pública e da planificação, abandonaram a política de pleno emprego e declararam não serem mais acessíveis serviços públicos robustos (Kotz, 2001). Ao mesmo tempo, a privatização na antiga União Soviética e países ex-comunistas expandiu a oferta global de força de trabalho, com consequências previsíveis para os níveis de salários em todo o mundo. A derrota da União Soviética deu início a uma era áurea para o capital. O resto de nós, como advertiu Stálin, fomos pegos pelas gargantas...\n\n As maiores economias do mundo estão em crise desde 2008. Algumas estão presas em uma espiral fatal de austeridade, algumas nas garras da recessão, a maioria crescendo lentamente na melhor das hipóteses. Austeridade — na realidade a eliminação de serviços públicos — é a pseudo-solução prescrita. Não há fim à vista. Em algumas partes da Europa, o desemprego oficial chega a 2 dígitos; o desemprego entre os jovens, ainda mais. Na Grécia, um país de 11 milhões, há apenas 3,7 milhões empregados (Walker e Kakaounaki, 2012). Além disso, a crise não pode, de forma alguma, ser atribuída a um poder externo trabalhando sistematicamente para trazer a derrubada do capitalismo, tal qual os EUA e seus aliadas fizeram para com a propriedade pública e a planificação na URSS. Ainda sim, livre para se desenvolver sem o ônus de um esforço organizado para sabotá-lo, o capitalismo não está funcionando. Poucos deixam isso claro. Em contraste, o modelo soviético de propriedade e planejamento — que, desde o início, foi alvo de um esforço concentrado para derrubá-lo — jamais, exceto os anos de 2ª Guerra Mundial, caiu em recessão, nem deixou de oferecer pleno emprego. Entretanto entende-se, até mesmo por alguns ex-partidários da União Soviética, ter sido ineficiente. Ao contrário do engano geral, a experiência soviética não demonstrou que uma fraqueza inerente existiu dentro da propriedade pública, que a levou ao fracasso. Ela demonstrou, pelo contrário, o oposto - que a propriedade pública e a planificação puderam fazer o que o capitalismo não pode: produzir um crescimento econômico constante, pleno emprego, uma ampla gama de gratuitos e semi-gratuitos serviços públicos e uma distribuição bastante igualitária da renda. Além disso, pôde fazê-lo ano após ano e continuou a fazê-lo até que a liderança soviética puxou a tomada. Demonstrou, também, que a elite dos 1% iria defender a propriedade privada usando meios militares, econômicos e ideológicos para esmagar um sistema que funcionou contra eles mas fê-lo esplendidamente pelos outros 99% (um esforço que continua hoje contra Cuba e Coreia do Norte).\n\n A derrota da União Soviética, de fato, marcou o início de um período negro de reação. A saída permanece sendo, como sempre, a propriedade pública e a planificação — que a experiência soviética de 1928 a 1989 demonstrou funcionar muito bem — e a luta contra aqueles que tentam desacreditá-la, degradá-la ou destruí-la.\n\n# O que a propriedade pública e a planificação fizeram pelos cidadãos comuns da URSS\n\n Os benefícios do sistema econômico soviético encontraram-se na eliminação dos males do capitalismo - o fim do desemprego, da inflação, das recessões e depressões, os extremos de riqueza e pobreza; o fim da exploração, ou seja, de viver do trabalho dos outros; e a prestação de um vasto leque de gratuitos ou semi-gratuitos serviços públicos.\n\n A mais importante conquista da economia soviética foi a abolição do desemprego. A União Soviética não apenas proveu emprego para todos como o trabalho era considerado uma obrigação social, de tanta importância que foi consagrado na constituição. A constituição de 1936 estipulara que ''os cidadãos da URSS têm o direito de trabalhar, ou seja, são garantidos o direito ao emprego e ao pagamento por seu trabalho de acordo com a qualidade e quantidade.'' Por outro lado, viver de meios que não o trabalho era proibido. Consequentemente, tirar riqueza de rentismo, lucros, especulação ou mercado negro — parasitismo social — era ilegal (Szymanski, 1984). Achar um emprego era fácil, porque normalmente havia baixa oferta de trabalho. Consequentemente, os funcionários tinham um alto poder de negociação no trabalho, com evidentes benefícios em segurança do trabalho e a gestão prestando muita atenção á satisfação do empregado (Kotz, 2003).\n\n O artigo 41 da constituição de 1977 estabeleceu a semana de trabalho em 41 horas. Trabalhadores do turno da noite trabalhavam 7 horas mas recebiam a remuneração total (correspondente a 8 horas). Os trabalhadores empregados em empregos perigosos (por exemplo, mineradores) ou onde a vigilância mantida era crítica (por exemplo, médicos), trabalhavam 6 ou 7 horas mas recebiam salário integral. Trabalho em hora-extra foi proibido, exceto em circunstâncias especiais (Szymanski, 1984).\n\n A partir dos anos 60, os trabalhadores receberam em média um mês de férias (Keeran e Kenny, 2004; Szymanski, 1984), que poderiam ser tomadas em resorts subsidiados (Kotz, 2003).\n\n A todos os cidadãos soviéticos era fornecida uma renda de aposentadoria, aos homens com 60 anos de idade e às mulheres com a idade de 55 (Lerouge, 2010). O direito à pensão (assim como benefícios por invalidez) foi garantido pela constituição soviética (artigo 43, constituição de 1977), ao invés de ser revogável e sujeita a caprichos momentâneos de políticos, como é o caso nos países capitalistas.\n\n Às mulheres era garantida licença maternidade totalmente remunerada desde 1936, além de muitos outros benefícios, pela constituição soviética (artigo 122, 1936). Simultaneamente, a constituição de 1936 provia uma ampla rede de maternidades, creches e jardins de infância, enquanto a constituição de 1977 obrigava o Estado a ajudar ''a família, proporcionando e desenvolvendo um amplo sistema de assistência à infância... mediante o pagamento de subvenções sobre o nascimento de uma criança, fornecendo subsídios às crianças e benefícios para as grandes famílias'' (artigo 35). A União Soviética foi o primeiro país a criar creches públicas (Szymanski, 1984).\n\n  Também lhes foi garantida a igualdade de direitos em relação aos homens, em todas as esferas da vida econômica, política, cultural e social (artigo 122, 1936), incluindo o direito ao emprego, descanso e lazer, segurança social e educação. Entre seus muitos pioneirismos, a URSS foi o primeiro país a legalizar o aborto, que estavam disponíveis sem custo algum (Sherman, 1969). Também foi o primeiro país a trazer as mulheres para os cargos superiores do governo. Uma intensa campanha foi realizada na Ásia central soviética para libertar as mulheres da opressão misógina do islamismo conservador. Isso produziu uma transformação radical das condições de vida das mulheres nestas áreas (Szymanski, 1984).\n\n O direito à moradia foi garantido por uma disposição constitucional de 1977 (artigo 44). O espaço urbano para habitação foi, entretanto, reduzido à metade do que era por cabeça na Áustria e na Alemanha Ocidental, por exemplo. As razões eram construção inadequada na era czarista, a destruição massiva de moradias durante a 2ª Guerra Mundial e a ênfase soviética na indústria pesada. Depois da revolução, novas moradias foram construídas, mas seu ''estoque'' permaneceu insuficiente. A construção de habitações pesava fortemente sobre o capital, de que o governo necessitava urgentemente para a construção da indústria. Além disso, os invasores nazistas destruíram de 1/3 a 1/2 das habitações soviéticas durante a 2ª Guerra Mundial (Sherman 1969).\n\n Cidadãos urbanos soviéticos vivam tipicamente em edifícios de apartamentos de propriedade da empresa em que trabalhavam ou do governo local. Os aluguéis eram baratíssimos por lei, cerca de 2 a 3% do orçamento familiar, enquanto os utilitários ocupavam de 4 a 5% (Szymanski, 1984; Kenny & Keeran, 2004). Isso difere nitidamente dos Estados Unidos, onde os aluguéis consumiam uma parcela significativa do orçamento familiar médio (Szymanski, 1984) e ainda o fazem.\n\n Produtos alimentares e outras necessidades eram subsidiados, enquanto itens de luxo eram vendidos bem acima de seus custos.\n\n O transporte público era eficiente, extenso e praticamente gratuito. A tarifa de metrô era cerca de 8 centavos nos anos 70, inalterada desde 1930. Nada comparável existiu nos países capitalistas. Isto porque um serviço público eficiente, acessível e extenso limitaria severamente as oportunidades de lucro de fabricantes de automóveis, companhias de petróleo e empresas de engenharia civil. A fim de salvaguardar seus lucros, essas empresas usam sua riqueza, conexões e influência para impedir o desenvolvimento de eficientes, extensas e baratas alternativas públicas ao transporte privado. Os governos, que precisam manter a indústria privada feliz para que esta possa gerar empregos, são obrigados a jogar seu jogo. A única maneira de mudar isto é pôr o capital sob o controle público, a fim de usá-lo para atender às metas de políticas públicas estabelecidas em um plano conscientemente construído.\n\n A União Soviética deu maior ênfase à saúde do que seus adversários capitalistas. Nenhum outro país teve mais médicos ou leitos hospitalares por cabeça que a URSS. Em 1977, esta tinha 35 médicos e 212  leitos hospitalares a cada 10.000 habitantes, em comparação com 18 médicos e 63 leitos hospitalares nos EUA (Szymanski, 1984). O mais importante: a saúde era gratuita. Que cidadãos dos EUA tivessem que pagar por atendimento médico foi considerado extremamente bizarro na URSS, e os cidadãos soviéticos ''frequentemente questionavam os visitantes estadunidenses de forma bastante incrédula quanto a isso'' (Sherman, 1969).\n\n A educação superior também era gratuita, e bolsas estavam disponíveis para estudantes de pós-graduação, adequadas para pagar livros-texto, hospedagem e alimentação, dentre outras despesas (Sherman, 1969; Szymanski, 1984).\n\n A desigualdade de renda na União Soviética era leve em comparação com os países capitalistas. A diferença entre a maior renda e o salário médio era equivalente à diferença entre a renda mensal de um médico e um trabalhador comum nos EUA, cerca de 8 a 10 vezes maior (Szymanski, 1984). Os rendimentos mais elevados da elite proporcionou privilégios não maiores que a capacidade de se adquirir uma casa modesta e um carro (Kotz, 2000). Para comparar, em 2010, os 100 CEO's mais bem pagos do Canadá tinham rendimentos 155 vezes que os salários médios de tempo integral. Este era de US$43.000 (Canadian Centre for Policy Alternatives, 2011). Um rendimento 10 vezes maior seria de US$430.000 — mais ou menos o que os membros da elite capitalista ganham em uma semana. Um fator que mitigou a desigualdade de renda na União Soviética foi o acesso de todos os cidadãos soviéticos a serviços essenciais, sem nenhum ou quase nenhum custo. Assim, o grau de desigualdade material era ainda menor que o grau de desigualdade de renda (Szymanski, 1984).\n\n Líderes soviéticos não vivam nas opulentas mansões que são as residências comuns de presidentes, primeiros-ministros e monarcas na maioria das capitais do mundo (Parenti, 1997). Gorbatchev, por exemplo, vivia num prédio de apartamentos para 4 famílias. Um alto funcionário da construção em Leningrado viva numa apartamento de um quarto, enquanto o funcionário político do topo em Minsk, sua esposa, sua filha e seu filho adotado moravam num apartamento de dois quartos (Kortz e Weir, 1997). Críticos da União Soviética acusam sua elite de ser uma classe dominante exploradora, mas os rendimentos modestos e as circunstâncias materiais humildes desta levantam sérias dúvidas sobre esta avaliação. Se foi de fato uma classe dominante exploradora, foi a mais estranha da história.\n\n# O recorde de crescimento da economia soviética sob a propriedade pública e a planificação\n\n\n A partir do momento que, em 1928, a economia soviética tornou-se propriedade pública e planificada, até o ponto em 1989 no qual a economia foi empurrada em direção ao livre-mercado, o crescimento do PIB per capita soviético foi superior ao de qualquer outro país exceto Japão, Coreia do Sul e Taiwan. Ele cresceu a uma taxa de 5,2% contra 4% para a Europa Ocidental e 3,3% para as ramificações da Europa Ocidental (EUA, Canadá, Austrália e Nova Zelândia). Em outras palavras, no tempo em que a economia planificada e de propriedade pública estava em prática, o registro de aumento das riquezas na URSS foi melhor que a dos principais países capitalistas industrializados. O robusto crescimento da União Soviética durante esse período é ainda mais impressionante considerando que o período inclui os anos de guerra, quando um grande ataque da Alemanha nazista deixou um rastro de destruição no caminho. Os invasores alemães destruíram mais de 1500 cidades e vilas, mais de 70000 aldeias, 31000 fábricas e 100 milhões de cabeças de gado (Leffler, 1994). O crescimento foi máximo até 1970, ponto em que a economia soviética começou a ocorrer mais devagar. No entanto, mesmo durante esse período chamado (erroneamente) de estagnação pós-1970, o PIB per capita cresceu 27% (Allen, 2003).\n\n\n Enquanto as taxas de crescimento do PIB per capita soviético se mostram positivas em comparação com a das principais economias capitalistas, uma comparação ainda mais relevante é a com o resto do mundo. Em 1929, a União Soviética ainda era em grande parte um país agrário, e a maioria das pessoas trabalhava na agricultura, comparado com uma minoria na Europa Ocidental e na América do Norte. Assim, a economia da URSS no momento de sua transição para a propriedade pública e a planificação era muito diferente da dos países ocidentais industrializados. Por outro lado, o resto do mundo se parecia com a União Soviética, sendo também, em grande parte, agrário (Allen, 2003). É, por conseguinte, com o resto do mundo e não os Estados Unidos e outros países industrializados avançados que a URSS deve ser comparada. De 1928 a 1989, o PIB per capita soviético não só ultrapassou o crescimento dos países ricos como também excedeu o crescimento em todas as outras regiões do mundo combinadas, bem como em maior grau. Assim, a economia planificada de propriedade pública não só ultrapassou o desenvolvimento das economias capitalistas mais ricas como também cresceu ainda mais rápido que os países; ela cresceu ainda mais rápido que as economias dos países que eram parecidos com ela em 1928. Por exemplo, fora do seu núcleo sul, o PIB per capita da América Latina era de US$1332 (dólares de 1990), quase igual aos US$1370 da URSS. Em 1989, o mesmo dado alcançou, na América Latina, US$4486, mas a renda média da União Soviética havia alcançado um nível muito maior, US$7078 (Allen, 2003). A propriedade público e a planificação havia elevado nível de vida a um patamar mais alto do que o capitalismo na América Latina havia feito, apesar do mesmo ponto de partida. Além disso, enquanto a economia soviética nos tempos de paz crescia seguramente, a economia latino-americana crescia aos trancos e barrancos, com empresas regularmente fechando as portas e demitindo seus funcionários.\n\n Talvez o melhor exemplo de como a planificação e a propriedade pública se saiu melhor em elevar o padrão de vida venha de uma comparação dos rendimentos da Ásia Central soviética com o dos vizinhos no Oriente Médio e Sul da Ásia. Em 1928 essas áreas estavam em um estado pré-industrial. Sob a propriedade pública e a planificação, a renda média na Ásia Central soviética cresceu para US$5257 em 1989, 32% maior que na vizinha capitalista Turquia, 44% maior que no vizinho capitalista Irã e 241% maior que no vizinho capitalista Paquistão (Allen, 2003). Para os asiáticos centrais, ficou claro que o padrão de vida do lado soviético da fronteira era mais alto.\n\n# A emulação do financiamento público de pesquisa e desenvolvimento por parte dos EUA\n\n\n Os defensores de uma economia de livre iniciativa querem nos fazer acreditar que a propriedade pública e a planificação sufocam a inovação, enquanto a livre iniciativa estimula-o. Se for esse o caso, como é que vamos explicar:\n\n- Que a União Soviética superou os EUA alcançando o espaço em 1950, acumulando um recorde de pioneirismos na exploração do espaço e, consequentemente, desencadeando um pânico em Washington?\n\n- Que a maioria das inovações nos EUA, da internet ao algoritmo do mecanismo de pesquisa do Google passando pelos medicamentos avançados e o iPhone sejam baseados não em investimento privado, mas em financiamento público?\n\n\n  Na realidade, a verdade sobre a inovação é o exato oposto do que os apologistas do livre-mercado querem nos fazer crer. Não é a iniciativa, mas a planificação e o financiamento público que a dirigem.\n\n As conquistas soviéticas no espaço, se consideradas à luz da ideia equivocada de que a URSS sempre foi uma pobre segunda-melhor para o supostamente mais dinâmico EUA, são verdadeiramente surpreendentes. As conquistas soviéticas constituem o primeiro satélite, o primeiro homem em órbita, a primeira mulher em órbita, a primeira caminhada espacial, o primeiro pouso lunar, a primeira imagem do lado mais distante da lua, a primeira aterrissagem suave não tripulada na lua, o primeiro veículo lunar, a primeira estação espacial e a primeira sonda interplanetária. O pânico criado em Washington depois que a economia soviética supostamente sufocadora-de-inovações permitiu à URSS bater seu adversário ideológico muito mais rico no espaço galvanizou os Estados Unidos para pegar uma folha do livro soviético. Assim como os soviéticos estavam fazendo, Washington usaria fundos públicos para fortalecer a pesquisa em inovações. Isso seria feito por meio da Agência de Projetos de Pesquisa Avançada em Defesa, a DARPA. Esta viria a canalizar dinheiro público para cientistas e engenheiros para pesquisa militar e espacial, entre outras. Muitas das inovações que sairiam da DARPA viriam a fazer o caminho para os investidores privados, que os usariam para lucro próprio (Mazzucato, 2011). Desta forma, os investidores privados foram poupados de arriscar seu próprio capital, como a mitologia da livre-iniciativa quer nos fazer crer que eles fazem. Nessa mitologia, perspicazes e ousados capitalistas colhem grandes lucros por arriscar seu capital em uma pesquisa que poderia nunca ser paga. Exceto que não é assim que funciona. É muito melhor para os investidores investir seu capital em empreendimentos com menos riscos e retornos imediatos, enquanto o público arca com o ônus do financiamento de pesquisa e desenvolvimento e seus muitos riscos e inseguranças. Usando sua riqueza, influência e conexões, os investidores têm pressionado com sucesso os políticos para manter este agradável arranjo no lugar. A realidade da livre-iniciativa, portanto, baseia no sistema-otário: o risco é socializado (ou seja, bancado pelo público, os otários), enquanto os benefícios são ''privatizados'' (por investidores que manipularam políticos para impôr ao público o ônus de financiar a pesquisa e o desenvolvimento).\n\n Um estudo realizado por Block e Keller (2008) constatou que, entre 1971 e 2006, 77 das 88 melhores inovações em pesquisa e desenvolvimento tinham sido totalmente financiadas pelo governo dos EUA. Resumindo uma pesquisa da economista Mariana Mazzucato, o colunista do Guardian Seumas Milne (2012) aponta que\n\n- ''Os algoritmos que sustentaram o sucesso do google foram financiados pelo setor público. A tecnologia no iPhone da Apple foi inventada no setor público. Em ambos EUA e Reino Unido foi o Estado, e não a indústria farmacêutica, que financiou os mais inovadores medicamentos 'nova entidade molecular', com o setor privado desenvolvendo, então, pequenas variações. E na Finlândia, foi o setor público que financiou o desenvolvimento precoce da Nokia — e fez um retorno desse investimento.''\n\n\n  A energia nuclear, a tecnologia para satélites e foguetes e a internet são outros exemplos de inovações que foram produzidas com dinheiro público, e têm sido usadas desde então para lucro privado. O presidente estadunidense Barack Obama reconheceu a natureza da fraude em um pronunciamento sobre o estado da nação de 2011: ''Nosso sistema de livre-iniciativa'', começou o presidente, ''é o que impulsiona a inovação.'' No entanto ele imediatamente se contradisse ao dizer que ''mas porque nem sempre é rentável às empresas investir em pesquisa básica, ao longo da história o nosso governo tem proporcionado cientistas e inventores de ponta e o suporte de que eles necessitam.''\n\n Tudo isso aponta para dois fatos importantes: (1) os Estados Unidos deram o ponta-pé inicial na inovação de sua economia pela simulação do modelo soviético de pesquisa dirigida pelo Estado porque a iniciativa privada não estava à altura da tarefa e (2) em vez de imitar o modelo soviético para o beneficiamento público, os EUA canalizaram o financiamento público em pesquisa e desenvolvimento para o lucro privado. A partir do segundo ponto pode inferir-se um terceiro: o fato de que os soviéticos socializaram os benefícios que fluem dos riscos socializados, enquanto os EUA ''privatizaram-lhes'', reflete a natureza antagônica dessas duas sociedades: uma delas, uma sociedade orientada pelo coletivo e organizada para beneficiá-lo; a outra, uma sociedade de negócios organizada para beneficiar uma minoria de proprietários e donos de empresas. O capitalismo, como o presidente dos EUA reconhece, não promove a inovação, porque ''nem sempre é rentável para as empresas investir em pesquisa básica.'' Por outro lado, o financiamento dirigido pelo Estado é fonte de inovação. Claramente, então, uma agenda política tem alimentado dois mitos: (a) que um sistema de propriedade pública e planificação impede a inovação e (b) que o sistema de lucro a estimula.\n\n# Por que o crescimento desacelerou\n\n Embora a economia soviética tenha crescido rapidamente entre 1928 e 1989, esta nunca ultrapassou as economias da América do Norte, Europa Ocidental e Japão. Consequentemente, a renda perca pita da URSS sempre foi menor que a das economias capitalistas industrializadas. A desvantagem comparativa dos rendimentos e condições de vida foi falsamente atribuída às supostas ineficiências da propriedade pública e da planificação, em vez da realidade de que, tendo iniciado ainda mais para trás que os países capitalistas ricos, a União Soviética tinha mais estrada para percorrer. Quando a corrida começou, em 1928, a União Soviética ainda era em grande parte um país agrário enquanto os EUA já era industrializado. Por isso a União Soviética tinha de percorrer o terreno que os EUA já haviam percorrido quando a Rússia estava sob o domínio sufocante da tirania czarista. Além disso, tinha que fazê-lo sem riquezas extraídas de outros países, como os EUA, Grã-Bretanha, França e Japão que haviam baseado parte de sua prosperidade em explorar seus próprios impérios formais e informais (Murphy, 2000). É verdade que a URSS possuía um grupo de países satélites na Europa Oriental — sobre os quais exerceu hegemonia, mas, exceto nos primeiros anos do pós-2ª Guerra Mundial, esses países nunca foram economicamente explorados pela União Soviética. Se qualquer coisa, os soviéticos, que exportavam matérias-primas em troca de bens manufaturados, saíram perdendo no final de sua relação comercial com seus satélites. Enquanto eles permaneceram membros do Pacto de Varsóvia — uma aliança defensiva formada depois e em resposta à OTAN — e mantiveram alguma aparência de propriedade pública e planejamento, Moscou permitiu aos países do Leste Europeu traçar seu próprio curso. A hegemonia soviética, então, limitou-se a dar cumprimento a essas duas condições (Szymanski, 1979).\n\n Em meados da década de 1970 havia uma série preocupação em Washington de que a economia soviética estava em rumo de ultrapassar a dos Estados Unidos. Uma vez que Washington sempre apontou para a maior renda média e o padrão de vida mais elevado dos Estados Unidos para mobilizar a fidelidade de sua população, a liderança soviética (no campo da economia) seria um golpe mortal à legitimidade do capitalismo estadunidense. Estimativas cuidadosas preparadas nos EUA mostraram que o PIB soviético estava ganhando do estadunidense. Em 1950, a economia soviética era apenas um terço da economia estadunidense, mas cresceu para quase metade 8 anos depois (Sherman, 1969). Do ponto de vista dos estrategistas em Washington no final dos anos 1950, o perigo que se aproximava era que, no ritmo corrente, a economia soviética ultrapassasse a economia dos EUA por volta de 1982. Nesse momento, todo o fundamento da crença da população dos EUA na necessidade da livre-iniciativa — que esta produziu um padrão de vida mais elevado do que a propriedade pública e a planificação — desmoronaria. Alguma coisa tinha de ser feita.\n\n Em 1975, a CIA estimou que a economia soviética era cerca de 60% da economia estadunidense (Kotz  e Weir, 1997). No entanto, o crescimento econômico soviético começava a desacelerar. De acordo com dados fornecidos por Allen (2003), o PIB per capita soviético cresceu a uma taxa de 3,4% de 1928 a 1970, mas a menos de metade dessa taxa, 1,3%, de 1970 a 1989. Teria os Estados Unidos, alarmado por ter sido batido na corrida espacial e agitado por aquilo que parecia a perspectiva bem real de ser economicamente ultrapassado pela URSS, manobrado para sabotar o progresso soviético?\n\n A guerra fria nunca foi gentil com as perspectivas soviéticas de crescimento. Os líderes soviéticos reconheceram que uma economia planificada e de propriedade pública era uma anátema para os capitães da indústria e das finanças que usam sua riqueza e conexões para dominar a política nos países capitalistas. A URSS tinha sido invadida várias vezes, e em duas ocasiões por potências capitalistas agressivas com o intuito de varrer o sistema soviético para fora do mapa. A fim de deter futuras agressões, foi necessário manter o ritmo militarmente. Portanto, a União Soviética lutava da melhor forma que podia para obter uma paridade militar áspera para manter uma convivência pacífica com os seus vizinhos capitalistas (Szymanski, 1979).\n\n No entanto, o tamanho menor da economia soviética em relação a seus concorrentes ideológicos gerou problemas. A necessidade de manter a paridade militar áspera significou gastar um percentual muito mais elevado do PIB com os militares em comparação com o que os EUA e outros países da OTAN gastavam em suas forças armadas. Recursos que poderiam ter sido mobilizados para a expansão industrial para ajudar o país a elevar-se economicamente tiveram de ser alocados para a auto-defesa (Murphy, 1999). Desde a década de 1950 até a de 1970, os soviéticos gastaram de 12 a 14% do seu PIB com o exército (Szymanski, 1984; Allen, 2003), um número que iria crescer muito mais depois, quando o governo Reagan elevou os gastos militares, antecipando um esforço soviético para manter-se que poderia prejudicar a economia da URSS.\n\n Outra restrição imposta à economia soviética pela necessidade de deter a agressão militar foi a monopolização dos recursos de pesquisa e desenvolvimento por parte dos militares.\n\n Mantendo o ritmo militarmente envolvido numa batalha incessante para alcançar a inovação militar estadunidense. Quando os EUA Explode a primeira bomba atômica em 1945, a URSS correu para igualar a façanha científica dos EUA. O que fez isso quatro anos depois. A introdução dos Estados Unidos da bomba de hidrogênio em 1952 foi rapidamente seguido pelos soviéticos explodindo  sua própria bomba de hidrogênio, um ano depois. O primeiro submarino estadunidense lançador de mísseis nucleares foi acompanhado pela URSS um ano depois. Nenhuma arma importante foi primeiro desenvolvida pela URSS, com uma única exceção — A ICBM. Ao contrário dos EUA, a URSS não tinha bases militares perto do seu rival ideológico. E, portanto, precisava de uma maneira de transportar ogivas nucleares em longas distâncias. No entanto, o objetivo foi em legítima defesa, e que a União Soviética era normalmente em modo de recuperação em sistemas de armas demonstrou que os Estados Unidos estavam estimulando a Guerra Fria adiante, não a URSS. Para os soviéticos, a Guerra Fria era um veneno econômico. Para os estadunidenses, a Guerra Fria foi uma forma de arruinar a economia soviética. Devido a autodefesa ter sido a prioridade, os cientistas e engenheiros da URSS foram canalizados para o setor militar. Os bens de consumo soviéticos foram, frequentemente, ditos terem sido de baixa qualidade, mas ninguém diz o mesmo sobre os equipamentos militares soviéticos. A razão é clara: Os militares tinham a primazia sobre as melhores mentes e os melhores equipamentos e nunca teve falta de financiamento. Há um ponto subsidiário: armas soviéticas de alta qualidade por um sistema de propriedade e planejamento público, apesar do mito de que tal sistema é incapaz de produzir produtos de alta qualidade (Kotz,2008). A necessidade de canalizar a maior parte e melhores recursos de pesquisa de desenvolvimento para a área militar fez com que os outros setores sofressem, e o crescimento do PIB foi interrompido. Por exemplo, os soviéticos fracassaram em seus esforços para aumentar a produção de petróleo, por causa dos metais, máquinas, cientistas e engenheiros necessários para aumentar a produção de óleo que foram enviados para o setor militar (Allen,2003). Metade de produção de máquina- ferramentas produzidas e, pelo menos, metade dos gastos em Pesquisas e desenvolvimento estavam indo para indústria da defesa.\n\n Outra razão para a desaceleração pós-1975 na economia soviética era que a URSS tinha se ficado enrolada numa armadilha ricardiana (Allen, 2003). A União Soviética tinha uma oferta abundante de todas as matérias-primas de uma economia industrial necessária e, a princípio, eles eram fáceis de alcançar e, portanto, poderiam ser obtidos a baixo custo. Por exemplo, no início dos anos de industrialização da URSS, minas a céu aberto foram escavadas perto de centros industriais. Minerais estavam perto da superfície e poderiam ser transportados em distâncias curtas para fábricas próximas. Portanto, os custos de produção e transporte eram mínimos. No entanto, ao longo do tempo, os minerais que estavam perto da superfície foram escavados para fora e poços tornou-se mais profundo e mais estreito. Em grandes profundidades, a quantidade de minerais que puderam ser extraídos e os custos diminuídos para alcançá-los, aumentaram.\n\n Eventualmente as minas foram esgotadas, e novas minas tiveram de ser abertas, mas bem longe dos centros industriais, o que significa custos mais elevados para o transporte de matérias- primas para as fábricas. A indústria do petróleo soviético ficou igualmente presa numa armadilha ricardiana. No início da década de 1970, a União Soviética foi perdendo $ 4.6 bilhões de dólares por ano para manter sua indústria petrolífera. Como o petróleo tornou-se mais difícil de alcançar, os soviéticos tinham que ir mais profundamente e através das rochas mais duras. Os custos aumentaram atingindo $6.0 bilhões de dólares até o final da década. No início da década de 1980, os custos haviam subido para $ 9,0 bilhões por ano (Schwizer.1994). Os soviéticos poderiam ter escapado da armadilha ricardiana procurando por importados mais baratos. Porém, isso os teria deixado vulneráveis a problemas de fornecimento. Os Estados Unidos e seus aliados — aqueles que sempre seriam hostis à União Soviética, exceto quando a conveniência ditava alianças temporárias ou abrandamento das tensões, poderiam interditar matérias-primas importantes para URSS para deixar a economia soviética de joelhos ou extorquir concessões. Em outras palavras, dada a elevada probabilidade de que os Estados Unidos iriam explorar oportunidades para colocar a União Soviética em desvantagem, comprando importados mais baratos, em vez de implementar uma política de recursos de autossuficiência, não era uma opção realista.\n\n  Outra razão de a economia soviética ter desacelerado foi o fato de que os custos para a União Soviética apoiar os seus aliados começaram a alcançar níveis insustentáveis. Uma forma de reforçar a autodefesa é encontrar amigos que partilham o mesmo inimigo, e a União Soviética começou a expandir sua aliança de países amigos, prestando assistência econômica e militar a países e movimentos hostis às forças reacionárias. Ao fazê-lo, tornou-se o banqueiro para os movimentos de libertação nacional, os países socialistas do Leste Europeu, e vários países do Terceiro Mundo, que procuraram escapar e permanecerem livres da dominação dos poderosos estados capitalistas.\n\n\n\n Em 1981, a União Soviética e seus aliados europeus orientais tiveram 96.000 conselheiros econômicos em 75 países e 16.000 conselheiros militares em 34 países, em conjunto com um contingente de 39.000 tropas cubanas na África, um exército que Moscou acabou pagando a conta. Ao mesmo tempo, os soviéticos foram pegar bolsa de estudos para 72.000 estudantes do Terceiro Mundo matriculados em universidades soviéticas e do Leste Europeu (Miliband, 1989). Em 1980, Moscou estava gastando 44 bilhões de dólares por ano com seus aliados (Keeran e Kenny, 2004). Ele deu US $ 4,5 bilhões em ajuda para Varsóvia a partir de agosto de 1980 a agosto 1981 sozinho para ajudar a conter o movimento Solidariedade apoiado pelos EUA (Schweizer, 1994). Enquanto isso, a guerra no Afeganistão estava drenando o tesouro Soviético até a quantia de US $ 3 a US $ 4 bilhões por ano. Em outras palavras, os custos para sustentar aliados tinham crescido enormemente, os custos das matérias-primas foram aumentados, os melhores cientistas, engenheiros e máquinas-ferramentas estavam sendo monopolizado pelos militares e gastos militares estavam consumindo uma grande porcentagem da renda nacional.\n\n Uma grande parte da situação em que os soviéticos se encontravam deveu-se a uma decisão da administração Reagan que tinha tomado para tentar paralisar a economia soviética. Em Outubro de 1983, o presidente estadunidense Ronald Reagan lançou o que se tornaria conhecido como a Doutrina Reagan ‘‘O objetivo do mundo livre não deve mais ser indicado em negativo, isto é, como resistência ao expansionismo soviético,” disse o presidente dos EUA.  ''o  objetivo do mundo livre deve, em vez disso, ser indicado no positivo. Nós temos de ir para a ofensiva com uma estratégia progressiva para a liberdade''. A guerra começou.\n\n De modo mais formal, a Doutrina Reagan foi exposta numa série de decisões diretivas de segurança nacional, ou NSDDs (sigla em inglês). NSDD-66 foi anunciado que seria a política dos EUA para perturbar a economia soviética, enquanto que o NSDD-75 comprometeu os EUA a tentar elevar os custos da economia soviética a fim de mergulhar a URSS numa crise. A economia soviética era para ser espremida, e uma das medidas era induzir Moscou a aumentar seu orçamento de defesa (Schmweizer 1994). A alta tecnologia na corrida armamentista, seria a chave.Ela não só forçaria Moscou a desviar mais recursos para o setor militar, mas canalizaria ainda mais cientistas, engenheiros, máquinas-ferramentas  e orçamento para pesquisa e desenvolvimento militar, reduzindo investimentos produtivos e travando a economia civil ainda mais do que a Guerra Fria já havia feito. O objetivo era forçar a União Soviética \"a gastar sangue precioso para disputar uma corrida contra um inimigo mais atlético\" (Schweizer, 1994), um inimigo que tinha uma economia maior e mais recursos para durar a corrida, porque tinha começado a um nível superior de desenvolvimento e foi saqueando vários países ao redor do mundo de suas riquezas.\n\n Durante os primeiros seis anos de sua presidência, Reagan mais do que duplicou gastos militares dos EUA, a compra de 3.000 aviões, 3.700 mísseis estratégicos, e perto de 10.000 cisternas (Schweizer, 1994). Para acompanhar, os gastos militares Soviéticos, anteriormente em 12 a 14 por cento do PIB, começou a subir. Já duas vezes maior que o dos Estados Unidos como uma percentagem do rendimento nacional (Silber, 1994) o orçamento de defesa cresceu mais ainda. Os gastos militares aumentaram 45 por cento em cinco anos, superando consideravelmente o crescimento da economia soviética. Em 1990, os soviéticos estavam gastando mais do que 20 por cento do PIB do país em matéria de defesa (Englund, 2011). Ao mesmo tempo, Moscou aumentou seus gastos  militares em pesquisa e desenvolvimento quase duas vezes. Na primavera de 1984, o líder soviético Konstantin Chernenko anunciou que \"a complexa situação internacional nos obrigou a desviar uma grande quantidade de recursos para reforçar a segurança do nosso país\" (Schweizer, 1994).\n\n  Enquanto isso, a administração Reagan tinha tomado uma página do livro de Che Guevara. O revolucionário argentino havia chamado por não um, não dois, mas três Vietnãs, para drenar o Tesouro dos EUA. Voltando a doutrina de Che contra o comunismo, o diretor da CIA Bill Casey chamado por não um, não dois, mas uma meia dúzia de Afeganistãos . Para atolar os soviéticos no \"seu próprio Vietnã\", os mujahedin afegãos foram regados com dinheiro e armas. Na Polônia, apoio financeiro, inteligência e apoio logístico foram vertidos para o movimento Solidariedade, forçando Moscou a aumentar o apoio ao governo polaco (Schweizer, 1994).\n\n Os meios de comunicação soviéticos se queixaram de que os Estados Unidos queriam impor \"uma corrida armamentista ainda mais ruinosa\", acrescentando que Washington esperava que a economia soviética estaria esgotada (Izvestiya, 1986). Ministro soviético das Relações Exteriores,  Andrei Gromyko, reclamou que reforço militar dos Estados Unidos teve como objetivo esgotar os recursos materiais da URSS e forçar Moscou para se render. Gorbachev ecoou Gromyko, dizendo que os cidadãos soviéticos sobre isso,\n\n“Os EUA querem esgotar a União Soviética economicamente através de uma corrida nas armas espaciais mais modernas e caras. O país quer criar vários tipos de dificuldades para a liderança soviética, para destruir os seus planos, inclusive na esfera social, no âmbito da melhoria do nível de vida do nosso povo, assim despertando a insatisfação entre as pessoas com a sua liderança” (Schweizer de 1994 ).\n\n\n Em meados da década de 1980, era claro em Washington e Moscou, que a União Soviética estava em apuros. Não era que o sistema de propriedade e planejamento público não estava funcionando. Pelo contrário, reconhecendo as vantagens do sistema soviético, os próprios Estados Unidos haviam emulado para estimular a inovação em sua própria economia. Além disso, a economia soviética ainda estava se expandindo de forma confiável, como tinha feito todos os anos em tempo de paz desde que Stalin tinha trazido sob o controle público, em 1928. No entanto, a defesa do país em face de uma intensificada Guerra Fria estava ameaçando sufocar o crescimento econômico completamente. Ficou claro que as perspectivas de Moscou para manter o ritmo com os Estados Unidos militarmente, e, ao mesmo tempo sustentando aliados sob ataque de insurgentes anticomunistas, estadunidenses alimentando e derrubando movimentos, estavam longe de ser otimista. Os Estados Unidos haviam manobrado a União Soviética em uma armadilha. Se Moscou continuasse a tentar se igualar aos EUA militarmente, isso acabaria por levá-la a falência e sua capacidade de deter os EUA ficaria perdida. Se não se tentou manter o ritmo, já não se poderia deter a agressão estadunidense. Não importa o caminho que Moscou tomou, o resultado seria o mesmo. A única diferença seria o tempo que levaria para o inevitável acontecer.\n\n\n\n Gorbachev escolheu atender o inevitável, mais cedo ou mais tarde. Seu assessor de Relações Exteriores, Anatoly Chernayaev, lembra que foi \"um imperativo para a Gorbachev que tivemos que colocar um fim à Guerra Fria, que tivemos que reduzir nosso orçamento militar de forma significativa, que tivemos de limitar nosso complexo industrial militar, de algum jeito \"(Schweizer, 1994). A necessidade de frear o orçamento de defesa foi ecoado por outro consultor de Gorbachev, Aleksandr Yokovlev, que mais tarde recorda que \"Ficou claro que o nosso gasto militar era enorme e tivemos que reduzi-lo\" (Blum, 1995). Gorbachev, portanto, retirou o apoio de aliados e prometeu cooperação com os Estados Unidos. Esta foi uma rendição. A capitulação foi escondida por trás de frases melosas sobre promoção da cooperação internacional e promoção dos valores humanos universais, mas a retórica não escondeu o fato de que Gorbachev estava jogando a toalha. Ele descreveu a rendição como uma vitória para a humanidade, declarando que ele havia evitado \"a ameaça de guerra nuclear\", terminou a \"corrida armamentista nuclear,\" reduzido \"forças armadas convencionais,\" resolvido \"inúmeros conflitos regionais que envolvam a União Soviética e os Estados Unidos \", e substituído\" a divisão do continente europeu em campos hostis com ... uma casa comum europeia \"(Gorbachev, 2011). Ao reduzir a ameaça de uma guerra nuclear global, Gorbachev tinha realmente conseguido uma vitória para a humanidade. No entanto, a vitória foi provocada por ceder aos Estados Unidos, que agora estava livre para passar por cima países que eram fracos demais para recusar as exigências dos EUA que produzem para a dominação política, militar e econômica.\n\n Por questões domésticas, Gorbachev-que se identificou com a posição democrático-social, principalmente, do Partido Comunista Italiano (Hobsbawm, 1994) tentou transformar a União Soviética num estilo ocidental de democracia social (Roberts, 1999). Ele citou a necessidade de inverter a desaceleração da economia soviética como sua justificativa para a transição (Gorbachev, 1988). O crescimento econômico certamente tinha abrandado, e realmente havia o perigo de que a continuação do crescimento lento iria ameaçar a posição frente aos rivais capitalistas do seu país. No entanto, a solução de Gorbachev totaliza, \"Se você não pode vencê-los, junte-se a eles.\" O aparato de planejamento, que infalivelmente traçava o percurso para o crescimento incessante em tempo de paz, foi desmantelado, a fim de levar a economia à regulação pelas forças de mercado. Ao invés de impulsionar o crescimento econômico, como Gorbachev esperava, o abandono do planejamento fez exatamente o oposto. A economia caiu de cabeça em um abismo, a partir do qual os países sucessores da URSS não sairiam por anos. Como um engraçadinho colocou, \"Stalin encontrou a União Soviética um naufrágio e deixou uma superpotência; Gorbachev achou uma superpotência e deixou um naufrágio. \"Gorbachev ainda é muito admirado no Ocidente, mas sua popularidade termina na fronteira com a Rússia.  Em março de 2011, uma pesquisa constatou que apenas um em cada 20 russos admiram o último líder da União Soviética, e que \"perestroika\", o nome para o movimento de Gorbachev em direção a uma economia de mercado \", tem quase puramente conotações negativas\" (Applebaum, 2011).\n\n# O sistema superior\n\n\n Com poucas exceções, o que dizem numa discussão séria sobre URSS está cheio de preconceito, distorção e equívoco. Trancada em batalha com a União Soviética, durante décadas, Washington deliberadamente promoveu equívocos sobre o seu inimigo ideológico. O objetivo era fazer com que a URSS parecesse sombria, brutal, repressiva, economicamente lenta e ineficiente, e não o tipo de lugar que ninguém em sã consciência iria querer imitar ou viver. Hoje, acadêmicos, jornalistas, políticos, funcionários do Estado, e até mesmo alguns comunistas repetem a  velha propaganda da Guerra Fria. A economia soviética, na opinião deles, nunca funcionou muito bem. No entanto, a verdade sobre a questão é que ela funcionou muito bem. Ela cresceu mais rápido ao longo do período que foi de propriedade pública e planejada do que a economia dos EUA, supostamente dinâmica, para não falar das economias dos países que eram tão subdesenvolvidas como a URSS era em 1928, quando a economia soviética foi trazida sob o controle público. A economia soviética era inovadora o suficiente para permitir que a URSS ultrapassasse os Estados Unidos na exploração espacial, apesar de os Estados Unidos \"terem mais recursos, um evento que inspirou os estadunidenses a imitar o apoio público da União Soviética para pesquisa e desenvolvimento. Além disso, o sistema soviético de propriedade pública e do planejamento empregava de forma eficiente todos os seus recursos de capital e humano, ao invés de manter exércitos de trabalhadores desempregados e ineficiente funcionando abaixo de sua capacidade, como as economias capitalistas regularmente fazem. Todos os anos, 1928-1989, exceto durante os anos de guerra, a economia soviética se expandido de forma confiável, proporcionando empregos, abrigo e uma grande variedade de serviços públicos de baixo custo ou gratuito para todos, enquanto que as economias capitalistas afundaram regularmente em recessão e que tiveram de  lutar continuamente em meio aos destroços de vidas humanas.\n\n O Conselho Nacional de Inteligência estadunidense faz um alerta preocupante de que a economia mundial tendente à crise poderia produzir o caos e angústia numa escala ainda maior do que a última crise (Shanker, 2012). Oferecendo um \"prognóstico sombrio\" sobre a economia mundial, a ONU adverte que \"uma nova recessão global que afunda muitos países em um ciclo de austeridade e desemprego durante anos\" (Gladstone, 2012). Mas, ao mesmo tempo, somos informados de que a economia soviética nunca funcionou, e que o capitalismo, com suas crises regulares, falha em não promover emprego, comida, roupas e abrigo a todos, é ao mesmo tempo a única opção e o sistema superior. Claramente, não é um sistema superior, ao contrario, é claramente inferior e tampouco a  única opção. Não só podemos fazer melhor, temos feito melhor. É hora de derrubar o muro de equívocos politicamente engendrados sobre a propriedade pública e do planejamento. Por muito tempo, o muro nos impediu de ver um modelo alternativo viável ao capitalismo, cujo histórico de pontos de sucesso inigualável para um futuro realista e possível aos “99 por cento”, um futuro livre de desemprego, recessão, extremos de riqueza e pobreza, e onde bens e serviços essenciais estão disponíveis sem nenhum custo para todos.\n\n#BIBLIOGRAFIA: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1MDyXZ8EMhcUoiBMC53DFxFYYsLPT61phy_0\n\n- Fonte: https://boradiscutir.blogspot.com/2014/12/uma-economia-socialista-funciona.html?m=1",
				"added": 1588543623
			},
			{
				"comment_id": 22,
				"body": "#O Código Penal da Coreia do Norte\n- https://gateway.pinata.cloud/ipfs/QmPNjpjLsKZnEtykH1NznGjrqUwpNL17eBJeBjAA1LoHx8\n\nO Centro de Estudos da Política Songun – Brasil editou o Código Penal da República Popular Democrática da Coreia em português e o publica a seguir.\n\nO Código Penal da RPDC especifica os atos que são considerados crimes e as punições equivalentes.\n\nNa Coreia Popular, as punições mais comuns são as de trabalho forçado. Diferentemente dos países capitalistas, onde os presos são mantidos em cárcere e inertes, na RPDC os prisioneiros pagam por seus crimes desenvolvendo trabalhos de construção para se desculpar ao país e ao povo.",
				"added": 1588558990
			}
		],
		"8_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 10,
				"body": "#Como a não-violência protege o estado\n- https://gateway.pinata.cloud/ipfs/QmVZTMtYiXJiKvUhQSYd3A78UD4VC7SSrfALMPTMTzz2aV\n\nComo a não-violência protege o estado desafia a crença de que a não-violência é a única forma de lutar por um mundo melhor.",
				"added": 1588540815
			},
			{
				"comment_id": 11,
				"body": "#Agência de Notícias Anarquistas\n- https://noticiasanarquistas.noblogs.org/\n\nBlog que reproduz as notícias da Agência de Notícias Anarquistas (A.N.A.)\n\n#Rede de Informações Anarquistas (R.I.A ou RedeInfoA)\n- https://redeinfoa.noblogs.org/\n\nA R.I.A é uma organização e coletividade anarquista dedicada à comunicação anarquista e libertária que tem como princípio a contra informação como forma de ação direta.\n\n#Cumplicidade\n- https://cumplicidade.noblogs.org/\n\n#para mudar tudo | um chamado anarquista\n- https://paramudartudo.com/\n\nO projeto “Para Mudar Tudo” tem como objetivo a propaganda das pensamentos e valores libertários e radicais para pessoas que ainda não tiveram contato com essas ideias ou prátias mas que mesmo assim sentem que precisamos resistir à ordem política vigente.\n\n#Cordel Anarquista\n- https://cordelanarquista.milharal.org/\n\n\"É um meio de comunicação anarquista, que tem como objetivo contribuir para a organização e luta anarquista, combatendo as diversas formas de opressões, tanto macro (capitali$mo, e$tado, governos) como as opressões que acontecem no micro( machismo, racismo, homofobia, autoritarismo etc), tendo a luta pela diversidade e liberdade plena de todxs xs seres (humanx, animal) como nossa principal bandeira. Buscamos utilizar uma linguagem que seja mais acessível para todxs.\"",
				"added": 1588541411
			},
			{
				"comment_id": 12,
				"body": "#FACÇÃO FICTÍCIA\n- https://faccaoficticia.noblogs.org/\n\nSe nunca nos chamamos de anarquistas insurrecionalistas, não é porque não queremos a insurreição, mas porque o nosso próprio temperamento nos predispõe a um anarquismo sem adjetivos. O mais importante é lutar pela liberdade e contra a hierarquia. Imaginamos que isso exige diferentes abordagens em diferentes situações e que estas abordagens podem precisar uma das outras para ter sucesso. \n\nSomos anarco-sindicalistas no chão das fábricas, anarquistas verdes nas florestas, anarquistas sociais em nossas comunidades, anarquistas individualistas quando estamos só, anarco-comunistas quando temos algo para compartilhar e anarquistas insurrecionalistas quando é hora de erguer uma barricada.",
				"added": 1588541462
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 13,
				"body": "#Afinal, a Ciência Explica ou Descreve?\n- https://gateway.pinata.cloud/ipfs/QmcngqWC3sAUo4h7xXm7ukirUmrKxce8uqYdrBYPaiEiTg\n\nUm debate filosófico que se intensificou no início do século XX questionou a capacidade da ciência em fornecer explicações. Desde então, filósofos da ciência, cientistas e educadores têm contribuído para essa reflexão. Algumas propostas configuram-se em torno da modelização de teorias como recurso explicativo utilizado pela ciência, mas o sucesso de uma explicação, principalmente no ensino de ciências, parece estar vinculado à sua capacidade de satisfazer o interlocutor. Auxiliando na tarefa de fornecer explicações, recursos como episódios da história da ciência e a introdução de entes inobserváveis para a construção de teorias e modelos têm se mostrado eficientes.",
				"added": 1588541957
			},
			{
				"comment_id": 15,
				"body": "#Filosofias da Matemática - Jairo José da Silva\n- https://gateway.pinata.cloud/ipfs/QmRUTetyZiuwbppKqu11P2Pem1NvLcEt3bxA6YCtKFxwVH\n\nEsta obra faz uma abordagem histórica dos problemas da filosofia da matemática -- que sentido de existência têm os objetos da matemática, se existem de fato objetos matemáticos propriamente ditos? Qual é a natureza da verdade matemática? Como é possível que a matemática tenha algo a dizer sobre o mundo empítico? --, apresentando uma ou muitas respostas mais ou menos satisfatórias aos problemas suscitados pelo conhecimento matemático.",
				"added": 1588544238
			},
			{
				"comment_id": 16,
				"body": "#Filosofia das lógicas - Susan Haack\n- https://gateway.pinata.cloud/ipfs/QmaW76uVYgD9DH6jrHYSEgei9fZsBTYkytXUaXSv18hUnA\n\nA relação entre a lógica e a linguagem é um dos principais pontos deste livro. O estudo de termos como validade, conectivos sentenciais, quantificadores, termos singulares, sentenças, enunciados, teorias da verdade, paradoxos, lógica modal e polivalente ocorre de uma maneira que privilegia a pluralidade de interpretações. Dessa maneira, são gerados problemas e perguntas - nem sempre respondidas, mas invariavelmente instigantes - que permitem os professores, estudantes de lógica e, de maneira geral, a todos aqueles interessados na dinâmica da argumentação, ampliar a sua visão do assunto, estimulando o diálogo com outras áreas do conhecimento.",
				"added": 1588544416
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 23,
				"body": "#Quais são as 'drogas da inteligência' e o que aconteceria se todos recorressem a elas para 'turbinar' o cérebro\n\n#Honoré de Balzac era um grande entusiasta dos benefícios do café para o cérebro. O renomado escritor francês seguia uma rotina rígida - todas as noites, vagava pelas ruas de Paris à procura de um local que estivesse aberto até meia-noite para tomar a bebida. Depois, escrevia até a manhã seguinte. Relatos indicam que ele consumia 50 xícaras de sua bebida favorita em um único dia.\n\nEm determinado momento, ele passou a comer colheradas inteiras de café moído, que acreditava trazer benefícios quando em jejum.\n\n\"As ideias caminham rapidamente em movimento, como batalhões de um grande exército em seu lendário campo de batalha, e a batalha continua\", disse ele sobre sua bebida favorita.\n\nPode ter funcionado. Balzac foi um escritor prolífico e produziu quase cem romances, novelas e peças de teatro durante sua vida. Morreu de insuficiência cardíaca aos 51 anos.\n\nDurante séculos, trabalhadores de todo o mundo fizeram o mesmo: consumiam café para enfrentar sua jornada diária. Mas isso vem mudando. Jovens que ingressam no mundo corporativo têm experimentado uma gama de substâncias que, segundo eles, melhoram suas habilidades mentais e os ajudam progredir em suas carreiras.\n\nDe fato, algumas dessas chamadas \"drogas inteligentes\" já são incrivelmente populares. Uma pesquisa recente com dezenas de milhares de pessoas descobriu que 30% dos americanos entrevistados afirmaram tê-las tomado nos últimos 12 meses.\n\nParece que em breve todos estaremos fazendo o mesmo - e é fácil se deixar levar pelas consequências. Será que essas substâncias vão nos levar a deslumbrantes invenções da era espacial? Ou talvez a uma explosão no crescimento econômico? A semana de trabalho pode ficar mais curta, à medida que as pessoas se tornem mais eficientes?\n\n#Estímulo mental?\n\nPara responder a essas perguntas, primeiro precisamos entender quais são essas drogas.\n\nA \"droga inteligente\" original é o [piracetam](https://en.wikipedia.org/wiki/Piracetam), que foi descoberto pelo cientista romeno Corneliu Giurgea no início dos anos 1960. Na época, ele estava buscando uma substância química que pudesse penetrar no cérebro e deixar as pessoas com sono. Após meses de testes, ele criou o \"Compound 6215\".\n\nEra seguro, tinha muito poucos efeitos colaterais - mas não funcionou. A droga não possibilitou uma melhor noite de sono a ninguém e pareceu funcionar de maneira oposta àquela pretendida.\n\nO piracetam teve um efeito colateral surpreendente. Quando os pacientes fizeram uso da substância pelo menos uma vez por mês, suas memórias registraram melhorias substanciais. Giurgea imediatamente reconheceu a importância de suas descobertas e cunhou o termo \"nootrópico\", que combina as palavras gregas para \"mente\" e \"flexão\".\n\nHoje, esse medicamento é o favorito entre estudantes e jovens profissionais que buscam uma maneira de melhorar seu desempenho, embora até hoje, décadas depois da descoberta, não haja evidências de que a substância de fato ajude a incrementar as habilidades mentais de pessoas saudáveis.\n\nTrata-se de uma droga que não tem aprovação da FDA (Food and Drugs Administration, órgão governamental que fiscaliza medicamentos e alimentos) nos EUA. No Brasil, é vendida em farmácias mediante receita médica.\n\nO empresário e podcaster do Texas Mansal Denton toma o fenilpiracetam, um parente próximo de uma versão do piracetam originalmente desenvolvida pela União Soviética como um remédio para ajudar os astronautas a suportar as dificuldades da vida no espaço.\n\n\"O fenilpiracetam me deixa uma pessoa mais articulada. Então, acabo fazendo várias gravações (de podcasts) quando tomo\", diz ele.\n\nNa verdade, esse cenário proporcionado por essas drogas é bastante típico. Embora muitas tenham uma legião de seguidores apaixonados, seus benefícios no cérebro são mínimos ou não comprovados por estudos científicos. O que nos leva a uma conclusão menos instigante: nada seria diferente.\n\n#Cérebro 'turbinado'?\n\nE a creatina monohidratada? Esse suplemento dietético consiste em um pó branco, que geralmente é misturado em bebidas açucaradas ou milkshakes, ou tomado em forma de pílula. A substância química é encontrada naturalmente no cérebro, e agora já há algumas evidências de que tomar uma quantidade extra de creatina pode melhorar sua memória operacional e sua inteligência.\n\nMas, apesar de ser relativamente uma novidade entre jovens profissionais ambiciosos, a creatina tem uma longa história com fisiculturistas, que fazem uso dela há décadas para melhorar seus ganhos musculares. Nos EUA, suplementos esportivos são uma indústria multibilionária - e a maioria contém creatina.\n\nDe acordo com uma pesquisa realizada pelo instituto Ipsos Public Affairs no ano passado, 22% dos adultos disseram que tinham tomado um suplemento esportivo no período. Se a creatina tivesse um grande impacto no local de trabalho, certamente já teríamos visto alguns sinais disso.\n\nClaro, existem drogas com mais poderes transformadores. \"Acho que é muito claro que algumas funcionam\", diz Andrew Huberman, neurocientista da Universidade Stanford, nos EUA.\n\nDe fato, há uma categoria de drogas inteligentes que recebeu mais atenção de cientistas e biohackers - aqueles que buscam alterar sua própria biologia e habilidades - do que qualquer outra. São os chamados estimulantes.\n\nDuas opções cada vez mais populares são anfetaminas e metilfenidato, medicamentos vendidos sob as marcas [Adderall](https://en.wikipedia.org/wiki/Adderall) e [Ritalina](https://en.wikipedia.org/wiki/Methylphenidate). Nos Estados Unidos, ambos são aprovados como tratamentos para pessoas com Transtorno do Déficit de Atenção com Hiperatividade (TDAH), um distúrbio comportamental caracterizado por sintomas de desatenção, inquietude e impulsividade.\n\nAgora, essas drogas são amplamente usadas por pessoas em ambientes altamente competitivos, como uma forma de elas permanecerem focadas em tarefas específicas.\n\nAs anfetaminas têm um longo histórico como \"drogas da inteligência\" - do matemático húngaro Paul Erdös, que contou com elas para solucionar enigmas matemáticos, ao escritor inglês Graham Greene, que as usou para escrever dois livros ao mesmo tempo. Mais recentemente, há uma abundância de relatos em revistas sobre seu amplo uso em certas áreas, como jornalismo, artes e finanças.\n\nAqueles que tomaram anfetaminas juram que elas funcionam - embora não da maneira como você talvez pense. Em 2015, pesquisas mostraram que seu impacto sobre a inteligência é \"modesto\". Mas a maioria das pessoas não as toma para melhorar suas habilidades mentais. O objetivo é melhorar sua energia mental e motivação para trabalhar.\n\nUma observação importante: tanto o Adderall quanto a Ritalina trazem sérios riscos e efeitos colaterais (ver abaixo).\n\nUm dos resultados de tomar essas substâncias é a habilidade de solucionar tarefas mentalmente desgastantes, especialmente aquelas que proporcionam uma recompensa no final. Um estudo descobriu que muitas pessoas consideravam um problema matemático \"interessante\" quando faziam uso delas.\n\n#E se o uso fosse disseminado?\n\nMas se toda a nossa força de trabalho começasse a se dopar com estimulantes desse tipo, parece provável que eles teriam dois efeitos principais.\n\nEm primeiro lugar, as pessoas deixariam de evitar tarefas desagradáveis, e funcionários preguiçosos que talvez tenham aperfeiçoado a arte da procrastinação passariam a realizar suas tarefas agilmente, mantendo planilhas atualizadas e participando entusiasticamente de reuniões enfadonhas.\n\nEm segundo lugar, os escritórios se tornariam ambientes significativamente mais competitivos.\n\n\"Parece haver uma parcela crescente de funcionários do Vale do Silício e de Wall Street usando nootrópicos. Eles se assemelham aos atletas profissionais, que vivem em ambientes extremamente competitivos e onde há muito o que se perder\", diz Geoffrey Woo, CEO e cofundador da empresa de nutrição HVMN, que produz uma linha de suplementos nootrópicos.\n\nO empresário e podcaster do Mansal Denton concorda. \"Acho que os nootrópicos apenas tornam tudo cada vez mais competitivo. A facilidade de acesso ao capital intelectual russo e chinês nos Estados Unidos, por exemplo, está aumentando. E há uma disposição para obter qualquer vantagem possível que esteja disponível.\"\n\nMas também estima-se que haveria prejuízos significativos. As anfetaminas são estruturalmente semelhantes à metanfetamina - uma droga recreativa potente e altamente viciante que arruinou diversas vidas e que pode ser fatal.\n\nTanto o Adderall quanto a Ritalina são medicamentos conhecidos por provocarem vício, e já existem inúmeros relatos de funcionários que lutaram para se livrar deles. Há também efeitos colaterais, como nervosismo, ansiedade, insônia, dores de estômago e até queda de cabelo, entre outros.\n\n#Haveria impacto na produtividade geral?\n\nPor fim, uma força de trabalho baseada em estimulantes não seria necessariamente mais produtiva no geral. \"Alguém pensa: essas coisas são perigosas? E isso é importante de se considerar a curto prazo\", diz Huberman.\n\n\"Mas surge também uma outra pergunta: 'Como você se sente no dia seguinte?' Talvez você fique hiper-focado por quatro horas, 12 horas, mas depois fora de área por 24 ou 48.\"\n\nConsiderando essas desvantagens, parece justo prever que os estimulantes vendidos sob receita médica provavelmente não mudarão o mundo tão cedo. Mas existe uma versão mais leve na praça, que você pode comprar em praticamente qualquer lugar: cafeína.\n\nNos Estados Unidos, as pessoas consomem mais café do que refrigerantes, chá e suco juntos. Infelizmente, ninguém jamais estimou seu impacto no crescimento econômico - mas muitos estudos encontraram muitos outros benefícios. Curiosamente, a cafeína traz comprovadamente mais benefícios do que o suplemento comercial à base de cafeína que a empresa de Woo criou, que atualmente é vendido a US$ 17,95 por 60 comprimidos.\n\nOutra opção popular é a [nicotina](https://en.wikipedia.org/wiki/Nicotine). Os cientistas estão cada vez mais certos de que essa droga é um poderoso nootrópico, com a capacidade de melhorar a memória de uma pessoa e ajudá-la a se concentrar em certas tarefas - embora também apresente riscos óbvios bem documentados e efeitos colaterais.\n\n\"Existem alguns neurocientistas muito famosos que mastigam Nicorette para melhorar seu funcionamento cognitivo. Mas eles são ex-fumantes e esse é o substituto deles\", diz Huberman.\n\nEntão, o que aconteceria se todos nós tomássemos pílulas da inteligência? Na verdade, a maioria de nós já faz uso delas todos os dias, enquanto bebemos nosso café da manhã. Mas Balzac poderia ter dito isso a você antes.\n\n- Fonte: https://www.bbc.com/portuguese/vert-cap-46202403",
				"added": 1588559964
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 24,
				"body": "#As 3 Leis de Newton EXPLICADAS\n- https://swarm-gateways.net/bzz:/ecc1e85a1feefacd5026841ec7a4082768f8fd439bccfad5b987d5eda9ee69ec/As+3+Leis+de+Newton+EXPLICADAS-B2u8FYE9fWk.mp4\n\nIsaac Newton começou o que hoje chamamos de física clássica quando enunciou suas três leis do movimento: A lei da inércia, a lei fundamental da mecânica e o princípio da ação e reação. Esse vídeo é uma viagem histórica desde as nossas primeiras noções de movimento até uma explicação de como Newton chegou nas suas famosas leis.",
				"added": 1588563914
			},
			{
				"comment_id": 25,
				"body": "#Como Ímãs Funcionam? (Ímãs Explicados)\n- https://swarm-gateways.net/bzz:/1ee632e1b20d7a85a27def69790a0c1c2f26b9163c55c32d563cad65b3ed1a7e/Como+Ímãs+Funcionam_+(Ímãs+Explicados)-agoy2NlJUJc.mp4\n\nÍmãs são um dos objetos cotidianos mais divertidos de se usar para fazer experiências. Eles colam na sua geladeira, prendem os seus dedos e estão até nos aceleradores de partículas. Mas como os ímãs funcionam? Esse vídeo explica ímãs, campos magnéticos e o mais importante: como fazer um ímã.",
				"added": 1588564393
			},
			{
				"comment_id": 26,
				"body": "#O Espaço-Tempo Explicado\n- https://swarm-gateways.net/bzz:/e3ff882844f799c87e63c4bed06159d77f5cb6a1d3d251f9732f9f0d5a0d83a7/O+Espaço-Tempo+Explicado-kJ5xNaSIeTI.mp4\n\nO espaço-tempo é um dos conceitos físicos mais famosos. Ele surge como uma consequência da relatividade de Einstein e muda drasticamente a maneira como nós enxergamos o universo.",
				"added": 1588565756
			},
			{
				"comment_id": 27,
				"body": "#O Paradoxo dos Gêmeos Explicado\n- https://swarm-gateways.net/bzz:/ba2727e6829fef51647f1d4e4f32783c394736745a94a0bee1e3c552908874a4/O+Paradoxo+dos+Gêmeos+Explicado-98OvQpOkOIU.mp4\n\nO paradoxo dos gêmeos é um dos experimentos mentais mais interessantes (e famosos) da relatividade.",
				"added": 1588566572
			},
			{
				"comment_id": 28,
				"body": "#O Paradoxo de Bootstrap Explicado\n- https://swarm-gateways.net/bzz:/e1fb01d12bd0b628b5a2d963840a276027017e315d7cd1b507a6d2961a3b14f1/O+Paradoxo+de+Bootstrap+Explicado-4s28mk9qZXs.mp4\n\nSe você assistiu [Dark](https://pt.wikipedia.org/wiki/Dark), você provavelmente foi apresentado ao conceito do paradoxo de Bootstrap, que é um dos exemplos de problemas gerados por viagens no tempo para o passado. Esse vídeo é uma explicação dele.",
				"added": 1588566999
			},
			{
				"comment_id": 29,
				"body": "#Física Quântica EXPLICADA\n- https://swarm-gateways.net/bzz:/36e50504936885f936d2ba7cfdb437a53d69513d706c86e7d983c13954fbf78f/Física+Quântica+EXPLICADA-eA1E2HGdbKg.mp4\n\nEsse vídeo explica a física quântica e as diferenças entre ela e a física clássica (de Newton). O vídeo cobre a história do desenvolvimento, o porquê da palavra \"quântica\" e ainda fala sobre o surgimento da mecânica quântica.\n\n#O Gato de Schrödinger Explicado\n- https://swarm-gateways.net/bzz:/92c9abd2791facbc126de51d66ec041fca6c3b5ac65d7fcacf459921063e1630/O+Gato+de+Schrödinger+Explicado-pKEq8d_1pn4.mp4\n\nO gato de Schrödinger foi um experimento mental proposto pelo físico Erwin Schrödinger mais ou menos no surgimento da física quântica. A ideia é bem simples, mas muitas vezes a discussão interessante proposta por Schrödinger é deixada de lado.",
				"added": 1588567623
			},
			{
				"comment_id": 30,
				"body": "#O Enigma da Antimatéria\n- https://swarm-gateways.net/bzz:/19274d32313a6bbe2062d63c31c569b8185edf99fe8a3d871396a8796228e6b8/O+Enigma+da+Antimatéria-LJML4ffF4i0.mp4\n\nLogo após o surgimento do Universo, quantidades iguais de matéria e antimatéria foram criadas. Esse é um dos maiores enigmas do Universo atual: o sumiço da antimatéria.",
				"added": 1588568079
			},
			{
				"comment_id": 31,
				"body": "#Cinco mistérios que a Física não consegue explicar\n\n#Modelo incompleto\n\nO Modelo Padrão é a teoria mais rigorosa da física de partículas, incrivelmente precisa em suas previsões. Ele estabelece matematicamente os 17 blocos de construção da natureza: seis quarks, seis léptons, quatro partículas de força e o bóson de Higgs. Elas são governadas pelas forças eletromagnética, fraca e forte.\n\nInfelizmente, este que é o nosso melhor modelo da física explica apenas cerca de 5% do Universo.\n\n\"Em relação à pergunta 'O que somos nós?', o Modelo Padrão tem a resposta. Ele nos diz que todo objeto no Universo não é independente, e que toda partícula está lá por uma razão,\" descreve Saúl Ramos, pesquisador da Universidade Nacional Autônoma do México (UNAM).\n\nApesar de seu grande poder preditivo, no entanto, o Modelo Padrão falha em responder cinco questões cruciais, e é por isso que os físicos de partículas sabem que seu trabalho está longe de estar acabado.\n\n#1. Por que os neutrinos têm massa?\n\nTrês das partículas do Modelo Padrão são diferentes tipos de neutrinos. O Modelo Padrão prevê que, como os fótons, os neutrinos não devem ter massa.\n\nNo entanto, os físicos descobriram que os três neutrinos oscilam, ou se transformam em um outro, enquanto se movem. Isto só é possível se os neutrinos tiverem massa.\n\n\"Se usarmos as teorias que temos hoje, obtemos a resposta errada,\" diz o físico brasileiro André de Gouvêa, atualmente professor da Universidade Northwestern, nos EUA.\n\nO Modelo Padrão descreve incorretamente os neutrinos, mas ainda é preciso ver o quanto ele está errado. Afinal, [as massas dos neutrinos são bem pequenas](https://web.archive.org/web/20200422003622/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=massa-dos-neutrinos&id=010130151009).\n\nIsso é tudo que o Modelo Padrão deixa escapar, ou há mais que não sabemos sobre neutrinos? Alguns resultados experimentais sugerem, por exemplo, que pode haver um quarto tipo de neutrino, chamado neutrino estéril, que ainda não descobrimos.\n\n#2. O que é matéria escura?\n\nOs físicos perceberam que estava faltando alguma coisa quando notaram que as galáxias estavam girando muito mais rápido do que deveriam com base na atração gravitacional de sua matéria visível. Elas giram tão rápido que deveriam ter-se esfacelado. Algo que não podemos ver, que os cientistas apelidaram de \"matéria escura\", deve estar dando uma massa adicional - e, portanto, um puxão gravitacional - a essas galáxias.\n\nAcredita-se que a matéria escura represente 27% do conteúdo do Universo. Mas o Modelo Padrão não a inclui.\n\nOs físicos estão procurando maneiras de estudar esse assunto misterioso e identificar seus blocos de construção. Se eles pudessem mostrar que a matéria escura interage de alguma forma com a matéria normal, \"ainda precisaríamos de um novo modelo, mas isso significaria que o novo modelo e o Modelo Padrão estão conectados,\" explica Andrea Albert, do Laboratório Nacional SLAC, nos EUA, que estuda a matéria escura, entre outras coisas, no Observatório Cherenkov de Água de Alta Altitude no México. \"Isso seria uma mudança no jogo gigantesca\".\n\n#3. Por que há tanta matéria no Universo?\n\nOnde quer que uma partícula de matéria passe a existir - por exemplo, em uma colisão de partículas no Grande Colisor de Hádrons ou no decaimento de outra partícula - normalmente sua contraparte de antimatéria emerge junto. Quando partículas iguais de matéria e antimatéria se encontram, elas se aniquilam.\n\nOs cientistas supõem que, quando o Universo foi formado no [Big Bang](https://web.archive.org/web/20200422142323/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=big-bang-ciencia-ou-dogma-cientifico&id=010130180323), a matéria e a antimatéria deveriam ter sido produzidas em quantidades iguais. No entanto, alguns mecanismos mantiveram a matéria e a antimatéria fora de seu padrão usual de destruição total, e o Universo ao nosso redor é dominado pela matéria.\n\nO Modelo Padrão não consegue explicar esse desequilíbrio. Muitos experimentos diferentes estão estudando a matéria e a antimatéria em busca de pistas sobre o que inclinou a balança.\n\n#4. Por que a expansão do Universo está se acelerando?\n\nAntes que os físicos pudessem medir a expansão do Universo, eles imaginavam que ele havia surgido velozmente depois do Big Bang e que, com o tempo, passado o ímpeto da explosão, começado a desacelerar. Por isso, foi um choque que não só a expansão do Universo não tenha abrandado, como também está se acelerando.\n\nAs últimas medições feitas pelo Telescópio Espacial Hubble e pelo observatório Gaia da Agência Espacial Europeia indicam que as galáxias estão se afastando de nós a 72 km por segundo. Essa velocidade se multiplica por cada megaparsec adicional, uma distância de 3,2 milhões de anos-luz, em relação à nossa posição.\n\nAcredita-se que essa taxa venha de uma propriedade inexplicável do espaço-tempo apelidada de \"energia escura\", que está empurrando o Universo rumo a um espalhamento total. Acredita-se que essa energia escura represente cerca de 68% da energia do Universo. \"Isso é algo muito fundamental que ninguém poderia ter previsto apenas olhando para o Modelo Padrão,\" comentou Gouvêa.\n\n#5. Existe uma partícula associada à força da gravidade?\n\nO Modelo Padrão não foi pensado para explicar a gravidade. Esta quarta e a mais fraca força da natureza não parece ter qualquer impacto sobre as interações subatômicas que o Modelo Padrão explica.\n\nMas físicos teóricos acham que uma partícula subatômica chamada [gráviton](https://web.archive.org/web/20191019001636/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=graviton-nexus-explicar-energia-materia-escura&id=010130150320) poderia transmitir a gravidade da mesma forma que partículas chamadas fótons carregam a força eletromagnética.\n\n\"Depois que a existência das ondas gravitacionais foi confirmada pelo LIGO, nós nos perguntamos agora: Qual é a menor onda gravitacional possível? É como perguntar o que é um gráviton,\" explica Alberto Güijosa, professor do Instituto de Ciências Nucleares da UNAM.\n\n#Mais para explorar\n\nEstes cinco mistérios são as grandes questões da física no século 21, diz Ramos. No entanto, existem ainda mais enigmas fundamentais: Qual é a fonte da geometria do espaço-tempo? Onde as partículas ganham seu spin? Por que a força forte é tão forte, enquanto a força fraca é tão fraca? E quanto às [partículas detectadas na Antártica que não se encaixam no Modelo Padrão](https://web.archive.org/web/20181014035020/https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=particulas-detectadas-antartica-nao-se-encaixam-modelo-padrao&id=010130181011)?\n\nHá muito a explorar, diz Güijosa: \"Mesmo que acabemos com uma teoria final e perfeita de tudo em nossas mãos, ainda faríamos experimentos em diferentes situações para ampliar seus limites.\"\n\n\"É um exemplo muito clássico do método científico em ação,\" acrescenta Albert. \"A cada resposta surgem mais perguntas; nada está pronto\".\n\n- Fonte: https://www.inovacaotecnologica.com.br/noticias/noticia.php?artigo=cinco-misterios-fisica-nao-consegue-explicar",
				"added": 1588568679
			}
		]
	},
	"comment_vote": {}
}