{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1578064771_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1578048945_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "God damn it, draug beat me to it.\nYou won't get any sales on hardware until ~end of spring, just before Summer vacation...",
				"added": 1578050978
			},
			{
				"comment_id": 2,
				"body": "Oh, and you're still better off selling it for parts. The 1070 isn't exactly fresh anymore with the 20** line available (and AMD cards coming around), but it'd sell on ebay pretty quickly outside of all that other stuff (excluding the CPU, which also would sell quick).",
				"added": 1578051098
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 3,
				"body": "Hate to break this to you but Iran knows full well American military capabilities, doesn't have the skill to counter, doesn't have the budget to counter, has crap naval capabilities, would get waxed in the sky, and doesn't even have most of their own population behind the regime these days.\n\nNo one is edging into anything. See you in 6 months when Iran is still talking their regligi-nut bullshit and the US is beating China over the head with a trade-stick.",
				"added": 1578051561
			},
			{
				"comment_id": 4,
				"body": "> [quantumkitty](#comment_317_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): It's highly likely there will be a war. People tend to forget that the prospect of being obliterated and outnumbered has never really been a good deterrent... it certainly isn't a deterrent for terrorists, suicide bombers and mass shooters. Humanity isn't a rational acting agent.\n\nWell, especially the ones that act on religious edict...",
				"added": 1578076549
			},
			{
				"comment_id": 5,
				"body": "> [thetruth](#comment_45_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): The time has come to ISOLATE U.S. WORLDWIDE. [...]\n\nPfft...last I checked when the US implodes the rest of the idiot world gets sucked in...as the largest money pit on the planet you greedy fucks can't keep your hands out of it for how much you claim to hate the place.\n\nIsolation? You're already here. Get out.",
				"added": 1578076916
			},
			{
				"comment_id": 8,
				"body": "> [thetruth](#comment_58_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): -STOP BEING COPS OF THE WORLD AND MIND YOUR BUSINESS. [...]\n\nRecall how before the US existed all of Europe was at war, the Middle East was a haven of slavery, China was poverty incarnate, Africa was Africa, and well...even the Natives were fighting each other.\n\nFucking moron. If the US wasn't slapping Isislam around they'd be crawling so far up your ass until the explosion blew more bullshit from your mouth and the air from your skull...",
				"added": 1578221050
			},
			{
				"comment_id": 9,
				"body": "> [thetruth](#comment_58_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): -STOP BEING COPS OF THE WORLD AND MIND YOUR BUSINESS. [...]\n\nRename yourself to TheMoron. More fitting.",
				"added": 1578221092
			},
			{
				"comment_id": 10,
				"body": "> [thetruth](#comment_59_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): ANOTHER INDOCTRINATED SHEEP, ASLEEP, BLINDED BY EDUCATION AND MEDIA. DON'T YOU GET IT, IT'S NOT ABOUT ISLAM. IF YOU WERE EDUCATED OUTSIDE THE BOX, YOU WOULD AT LEAST SEE, IT'S OIL, CONTROL AND YET, THE REAL REASON IS VERY DEEP IN THE RABBIT ROLE FOR ONLY A FEW TO S33 AND UNDERSTAND. LET'S FORGET THE PAST FOR A MOMENT (MANY MISTAKES HAVE BEEN DONE, YES), THE PRESENT AND THE FUTURE OF OUR CHILDREN ARE AT STAKE AND ONLY THAT CAN BE INFLUENCED AS WE SPEAK NOW. DO YOU CARE? [...]\n\nCapslock is cruise control for the missile that strike your house, inbred.",
				"added": 1578237950
			},
			{
				"comment_id": 11,
				"body": "> [dranzer](#comment_1_1EZcCHjZ2G4HHygcH5BqdqBYP66VGnkwzk): Please stop raping beautiful people and killing them.\n\nSpeaking to the Sharia practicers, I take it?",
				"added": 1578242859
			}
		],
		"1578154157_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 6,
				"body": "> [cupcake](#comment_1_1H4eK5ZTs4ZL3s486bQQPn71qdeQXqKXjK): Another uncensorable P2P net is Freenet. https://freenetproject.org/index.html\n\nEh...Freenet is more or less not safe these days since a few small-time researchers figured out some form or another to hone in on people if they downloaded previously flagged files, on top if Freenet intentionally not masking the first few jumps into the network so any adversary who was sitting first or so in your travel path would always be able to know what you were looking for (unless you actually had Darknet mode active and actually had trusted peers).\n\nIt's also slower than honey sprinting uphill and has a garbage update cycle...",
				"added": 1578180305
			},
			{
				"comment_id": 7,
				"body": "> [fke13](#comment_129_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): I do not know, but the way I understand, the IPFS is more like an FTP analogue, except that it is using a P2P network. In that case the solution might be some sort of a P2P-email service, where the individual emails form a forum thread.  [...]\n\nApparently there are already encrypted P2P file sharing and email services running on IPFS.\n\n> [anon05](#comment_36_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Can't it be used through Tor?\n\nNot that I recall, no. Something about their communication protocols causing conflicts or something.",
				"added": 1578208188
			}
		],
		"1578406050_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 12,
				"body": "Straight garbage. It used to not work AT ALL (to the point where you'd think your were anon but your IP was leaking), then they made it worse with the BS crypto that forces you to become untrusted when you join the network for bad share ratio unless you're an uploader first...and even that barely works.\n\nIt's got a good...5 years til it's good or the dev blows his brains out.",
				"added": 1578419891
			}
		],
		"1578406618_1HyEXXEZoDTRH1ZgVoZv8QPoGu2e3fc63t": [
			{
				"comment_id": 13,
				"body": "You can also check by looking at your Notification pane (windows) or whereever it is on Linux for your listed IP : if it's not the IP you have from your ISP, you're connected via Tor. Restart your zeronet bin from time to time to see if you're being placed on different onion routes.",
				"added": 1578420227
			}
		],
		"1578439030_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 14,
				"body": "SWIFT is on the way out, especially if more banks adopt into the RippleX network where you can transfer funds bank-to-bank nearly instantly so you don't need to wait 3 days for your money.",
				"added": 1578439733
			}
		]
	},
	"comment_vote": {
		"166_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1507_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"3_1JbZKtuFZMRTCgBjhpnD4pCXwi5gniQsKZ": 1,
		"1575_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}