{
	"title": "Aktuell !",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 42,
	"demo": false,
	"modified": 1541084014,
	"post": [
		{
			"post_id": 41,
			"title": "Polizeigesetze vernichten die letzte Freiheit !",
			"date_published": 1541083822.6,
			"body": "Polizeigesetz in Brandenburg stoppen - Grundrechte schützen!\n\nAm Samstag den 10.11. ab 13:30h wird in Potsdam gegen das geplante Polizeigesetz demonstriert. Die Demo beginnt am Bahnhof Charlottenhof und führt über die Staatskanzlei zum Landtag. Aktion Freiheit statt Angst ist als Unterstützer des Bündnisses dabei.\n\nBis dahin muss man aber nicht Däumchen drehen.\nEs gibt bei WeAct eine Petition 'Neues Polizeigesetz in Brandenburg stoppen - Grundrechte schützen!'. Mit dieser Petition kann man den Politikern der rot-roten Regierung in Brandenburg noch einmal sagen, wie gefährlich ihre Pläne sind. Mitte November soll das Gesetz in 1. Lesung behandelt werden.\n\nIm Petitionstext heißt es dazu:\n\nBrandenburg will ein neues Polizeigesetz verabschieden, das die Überwachungs- und Eingriffsbefugnisse der Polizei massiv ausweitet. Unschuldsvermutung und Gewaltenteilung werden untergraben. Das neue Gesetz ist damit ein Angriff auf die Grundrechte aller Menschen. Gerade im Hinblick auf eine mögliche rechtspopulistische Regierungsbeteiligung dürfen keine unverhältnismäßigen Instrumente eingeführt werden, bei denen man darauf angewiesen wäre, dass die Landesregierung es gut mit Demokratie und Meinungsfreiheit meint.\n\nWir haben in der Türkei gesehen wie schnell eine rechtsgerichtete Regierung ihre Kritiker und auch völlig Unschuldige auf Dauer wegsperren kann. Es müssen nach der \"Machtübernahme\" nur noch \"fertige LIsten mit Auffälligen\" abgearbeitet werden.\n\nDas Gesetz in Brandenburg ist eine schlechte Blaupause der Vorlage aus Bayern. Das bayrische Polizeiaufgabengesetz (PAG) wird von den Bundestagsfraktionen von Grüne/B90, FDP und Linke vor dem Bundesverfassungsgericht beklagt. Statt diese Klage und das Ergebnis abzuwarten, folgt man den anvisierten Verschärfungen der CSU.\n\nDie geplanten Grundrechtsverstöße im Brandenburger Entwurf sind\n\n    Heute politisch aktiv, morgen schon \"Gefährder\" - Im Rahmen der \"Terrorismus\"-Abwehr werden polizeiliche Befugnisse weit ins Vorfeld einer konkreten Gefahrensituation verlagert.\n    Unklare Begriffe werden genutzt, um Menschen und Gruppen als \"Terror\"-Verdächtige einzustufen.\n    Ein weiterer Schritt zur dauerüberwachten Gesellschaft -  Obwohl schon jetzt Videoüberwachungen möglich sind, werden die Anlässe zur Überwachung durch die Polizei immer beliebiger.\n    Quellen-Telekommunikationsüberwachung (TKÜ) bzw. Staatstrojaner - Bei der Quellen-TKÜ verschafft sich der Staat Wissen über IT-Sicherheitslücken, so kann über das Internet verschlüsselte Kommunikation unbemerkt \"geknackt\" und abgehört bzw. gelesen werden.\n    Sicherheitslücken geheim zu halten ist ein aktiver Angriff auf die innere Sicherheit und die Privatsphäre aller Menschen.\n    Aufenthaltsgebote - Angriff auf die politische Teilhabe - Mit Aufenthaltsgeboten (im Gesetz als Meldeauflagen bezeichnet) kann die Polizei bestimmen, wo sich bestimmte Personen aufhalten müssen und wo sie sich nicht aufhalten dürfen.\n    Schleierfahndung - Steilvorlage für diskriminierendes \"Racial Profiling\"- künftig nicht nur in Grenznähe sondern überall im Land.\n    Militarisierung - Bislang dürfen sogenannte Explosivmittel nur zur Beseitigung von Hindernissen bei Naturkatastrophen oder für sogenannte Zugangssprengungen genutzt werden. In Zukunft sollen diese auch gegen Personen eingesetzt werden dürfen.\n    ...\n\nUm das alles zu verhindern, ist es nötig, die Regierung in Brandenburg zum Umdenken zu bringen - Petition unterschreiben!"
		},
		{
			"post_id": 40,
			"title": "Deutsche verhungern ! Asylanten werden versorgt .  Deutsche Rentner sterben !",
			"date_published": 1540890706.4,
			"body": "Die Asylindustry ist der Tod der Deutschen ! Hauptverantwortlich ist die Diakonie ! Sie verschwendet die Renten und die Sozialversicherungsbeitraege !\n\nDie verzweifelte 70-jährige Renate P. sprang von ihrem Balkon und beging Selbstmord, als sie vom deutschen Staat und ihrer Polizei aus ihrem Haus vertrieben werden sollte, berichtet eine Lokalzeitung.\n\nAm Mittwochmorgen gegen 9:45 Uhr wurde die ältere Frau von der Wohnungsgesellschaft und der Polizei besucht, um sie dazu zu bringen, ihre Wohnung zu verlassen.\n\nNach Angaben der Nachbarn konnte die 70-jährige Rentnerin ihre Miete nicht mehr bezahlen. Weil die Frau ankündigte, dass sie sich der Räumung widersetzen würde, waren die Polizisten\\n zur Unterstützung vor Ort.\n\nAls die Männer an ihre Tür klopften und sie nicht öffnete, wurde ein Schlosser beauftragt, die Tür gewaltvoll aufzubrechen.\n\n„Nachdem die Haustür und zwei verschlossene Zimmertüren geöffnet worden waren, kletterte die ältere Frau auf das Balkongeländer und sprang ohne Vorwarnung in den Tod“, sagt die Polizei.\n\nDie Frau sprang vom siebten Stock auf das Gras vor ihrer Wohnung. Ein Notarzt erklärte die Frau noch am Tatort für tot.\n\n„Beweise für mögliches suizidales Verhalten standen den Behörden nicht zur Verfügung“, sagt die Polizei.\n\nDie deutschen Rentner in Deutschland verarmen zunehmend, während die Merkel-Regierung pro Jahr laut offiziellen Daten des DBI 55 Milliarden Euro für Migranten ausgibt. Ein einzelner Migrant kostet den deutschen Steuerzahler somit 5.000 Euro im Monat. Mit diesem Geld könnte die deutsche Regierung 10 Rentner mit 500€ monatlich vor dem Balkonsprung in den sicheren Tod oder dem Hungern im Alter retten.\n\nDie Zahlen zeigen, dass im Jahr 2016 rund 8,6 Millionen Rentner eine Rente unter 800 Euro pro Monat erhalten haben. Das entspricht 48 Prozent.\n\nDie Altparteien versagten zum Thema Rente auf voller Linie. Eine Rentenreform benötigt Deutschland dringender denn je.\n\nGut 11,3 Millionen oder 62 Prozent der Rentner erhalten weniger als 1.000 Euro für ihre Altersrente, wovon sie ihre Miete zahlen müssen, während ein illegaler Migrant in Deutschland kostenlose Wohnungen, ein Taschengeld von 1.300 Euro, inklusive einer kostenfreien Fahrkarte für den Öffentlichen Nahverkehr erhält."
		},
		{
			"post_id": 39,
			"title": "Kirchenkreis Bramsche. Da wohnt jemand im Unternehmen !",
			"date_published": 1540666750.2,
			"body": "UPIK® Datensatz - L\nL \tName \tEv. Kirchenkreisamt\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t340693387\nL \tGeschäftssitz \tKirchhofstr. 6\nL \tPostleitzahl \t49565\nL \tPostalische Stadt \tBramsche\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054611597\n\tFax Nummer \t\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661\n\nhttps://www.st-martin-bramsche.de/Kontakte"
		},
		{
			"post_id": 38,
			"title": "Besucht  den Kanaken in seinem Palast. Hochverrat am deutschen Volk !",
			"date_published": 1540284190.1,
			"body": "Firmenchef  Joachim Jeska !\nEr ist gegen das deutsche Volk. Er zerstört mit Genderwahn die Familien.\nJetzt das ganze Volk. Er hat keine Kinder , deshalb ist es Ihm egal.\nEr ist Mitschuld am Genozid !\nhttps://www.kirchenkreis-osnabrueck.de/\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\n\nUPIK® Datensatz - L\nL Name Evangelisch-lutherischer Kirchenkreis Osnabrück\nW Nicht eingetragene Bezeichnung oder Unternehmensteil Ev.-luth. Kirchenkreis Osnabrück\nL D-U-N-S® Nummer 341606149\nL Geschäftssitz Marienstr. 13-14\nL Postleitzahl 49074\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 054128392\nW Fax Nummer 054127869\nW Name Hauptverantwortlicher Freidemann Pannen\nW Tätigkeit (SIC) 8661\n\nUPIK® Datensatz - L\nL Name Ev.-Luth. Pfarramt St. Katharinen\nNicht eingetragene Bezeichnung oder Unternehmensteil\nL D-U-N-S® Nummer 340450283\nL Geschäftssitz An der Katharinenkirche 7\nL Postleitzahl 49074\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 054120239556\nFax Nummer\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\n\nDiese Clique ist dafür verantwortlich ! Es ist eine schlichte Firma !\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations"
		},
		{
			"post_id": 37,
			"title": "Schlagt zurück ! Zerstört die überwachung !",
			"date_published": 1540283407.8,
			"body": "http://www.faz.net/aktuell/wirtschaft/netzwirtschaft/supermarktkette-real-testet-gesichtserkennung-15039495.html     Wir müssen uns nun wehren !"
		},
		{
			"post_id": 36,
			"title": "Das grosse Fressen Doris Schmidtke verdient sich als Firmenchefin dumm und dämlich !",
			"date_published": 1540245119.1,
			"body": "Das grosse Fressen auf Kosten der Steuerzahlenden. Schmidtke zockt mehr als 20000 Euro pro Monat ab. Die Firmenchefin frisst auch noch in Kirchen ohne Skrupel. Es ist das letzte !\nhttps://www.kirchenkreisverband.de/ueber-uns/presseinformationen.html#c548"
		},
		{
			"post_id": 35,
			"title": "Die Firma BRD ist der einzige Terorrist !",
			"date_published": 1540214757.3,
			"body": "Leben in Terrorangst oder solidarisches Miteinander?\n\nElias Davidsson, geboren in Palästina als Sohn deutscher Eltern mit jüdischem Glauben, kennt sich aus mit der \"Bedrohung durch den Terror\", auch wenn er die letzten Jahrzehnte in Island und Deutschland gelebt hat. Und er sagt: \n\nEs gibt keine Terroristen! Das Konzept \"Terrorismus\" wird zur Verfolgung Andersdenkender missbraucht.\n\nNach unserem Rechtsempfinden vermeiden wir es jemanden, der eine Straftat begangen hat, egal welcher Art, sei es Diebstahl, Betrug oder Mord, diese Person vor ihrer Verurteilung als Dieb, Betrüger oder Mörder zu bezeichnen. Bis zum Urteilsspruch gilt in diesen Fällen die Unschuldsvermutung. Auch Strafgerichte verwenden die Begriffe Dieb, Betrüger oder Mörder nicht für mutmaßliche Täter.\n\nAnders ist es plötzlich, wenn jemand oder eine ganze Gruppe als \"Terrorist\" bezeichnet wird. Die USA haben sich im weltweiten Drohnenkrieg damit einen scheinbaren Freibrief zurecht gebogen, Menschen zu ermorden. Diese sind nicht wegen einer bestimmten Tat angeklagt oder verfolgt, sondern als „Terroristen“ bezeichnet und werden dann auf dieser Grundlage „entsorgt“, dabei werden dann sogar \"Kollateralschäden\", weitere offensichtlich zivile Opfer in Kauf genommen.\n\nDavidsson stellt fest: Die Reduzierung eines Menschen auf einen Schädling, sei es als Schmarotzer, Ganove, Pädophiler oder Terrorist, geschweige denn auf seine mutmaßliche Gesinnung oder Veranlagung, verletzt Grundsätze der modernen Zivilisation. Die Bezeichnung „Terrorist“ verletzt übrigens auch die Unschuldsvermutung.\n\nDer Begriff Terror stammt aus der Zeit nach der französischen Revolution und bezog sich damals ausschließlich auf staatlichen Terror, das heißt auf die Einschüchterung der Bevölkerung durch den Staat, aus dem letzten Jahrhundert kennen wir ihn aus dem Dritten Reich. Heute verbinden die meisten Menschen damit eine Gewalttat von Einzelpersonen oder Gruppen auf Zivilisten, die angeblich durch die Grausamkeit ihrer Tat der gesamten Bevölkerung eine politische oder ideologische Botschaft vermitteln wollen.\nDer Einzug des Terrorbegriffs in das Strafrecht\n\nUnser Strafrecht beruht auf der Bestrafung von Menschen nach bereits begangenen Straftaten. Gesinnung und Motiv eines möglichen Täters dürfen im herkömmlichen Recht bei der Feststellung der Schuld keine Rolle spielen, lediglich bei der Verurteilung zur Abwägung des Strafmaßes. Die Gesinnung darf deshlab auch nicht von der Polizei für vorbeugende Maßnahmen genutzt werden, zum Beispiel einer Überwachung oder Festnahme.\n\nDas hat sich mit Einführung der §129 ff StGB geändert. Das Strafrecht wurde durch den Terrorismusbegriff aufgeweicht. Inzwischen reicht die mutmaßliche Gesinnung einer Person für deren Überwachung beziehungsweise Festnahme. Dafür wurde die politische Konstruktion „terroristische Vereinigung“ geschaffen. Das Fatale daran ist, dass nicht Gerichte eine Organisation als \"terroristisch\" klassifizieren, sondern die Exekutive, das heißt die Regierung. Diese Einteilung erfolgt also nach politischem Ermessen und den jeweiligen Mehrheitsverhältnissen.\n\nDavidsson führt weiter aus: Wenn also Politiker eine Organisation oder eine Gruppe als eine „terroristische Vereinigung“ bezeichnen, darf die Polizei „Mitglieder“ oder „Unterstützer“ dieser Vereinigung überwachen und verhaften. Diese werden dann gerichtlich in der Regel nicht wegen der Begehung einer Straftat verfolgt, sondern wegen ihrer vermeintlichen Gesinnung. Es soll hier beiläufig erwähnt werden, dass der Begriff „terroristische Vereinigung“ selbst falsch und eine Täuschung ist, weil sich keine Organisation zum Ziel setzt, „terroristische Anschläge“ zu begehen, auch wenn sie solche Handlungen gelegentlich organisiert oder duldet.\n\nDie Begriffe \"Mitgliedschaft\" und \"Unterstützung\" sind juristisch so vage, dass sogar der Besitz oder die Vermittlung von Materialien, in Schrift- oder Bildform bestraft werden kann, wenn Behörden diese einer mutmaßlichen \"terroristischen Vereinigung\" zuordnen. Der \"Tatbestand der Gesinnung\" erlaubt der Polizei zur sogenannten Strafvorbeugung die Überwachung und vorbeugende Festnahmen.\n\nSind solche Rechtspraktiken für gewisse geselschaftliche Gruppen erst einmal \"üblich\", könnnen sie bei Bedarf leicht auf andere vom Staat definierte Gefährder ausgedehnt werden. Das können je nach aktuellem politischen Anlass gewerkschaftliche, demokratische, anti-kapitalistische oder anti-imperialistische Aktivisten sein.\n\nEine besondere Rolle in der Verbreitung von Terrorangst spielen die Medien. In der Regel möchte der \"terroristische\" Täter, der Bevölkerung mit der Grausamkeit seiner Tat eine Botschaft senden. Das kann er nur, wenn darüber in den Massenmedien möglichst spektakulär berichtet wird. Davidsson stellt fest: Den Massenmedien, die eine zeitlich und örtlich beschränkte Gewalttat zu einem öffentlichen Ereignis erheben und damit die Bevölkerung verängstigen, kommt eine besondere Verantwortung zu. Indem sie die Informationen über die Straftat verbreiten, erfüllen sie den Wunsch des mutmaßlichen Täters, die Bevölkerung zu verängstigen, einzuschüchtern oder zu traumatisieren. Die Medien schenken dem Täter ohne jeglichen Zwang eine Stimme, die er sonst nicht hätte.\n\nDas sehen wir insbesondere bei den Medien mit den überdimensionalen Buchstabengrößen, die damit ihre Verkaufszahlen verbessern wollen ...\n\nMehr dazu bei https://www.rubikon.news/artikel/es-gibt-keine-terroristen"
		},
		{
			"post_id": 34,
			"title": "Kampfansage der Firma BRD. Nun werden Sie auch noch Ihrer Bankdaten beraubt.",
			"date_published": 1540150244.9,
			"body": "Die BRD ist die Verwaltung der Aliierten. Die Mitarbeiter halten Deutschland im Besatzungszustand. Ab Januar 2018 gehören Ihnen nicht mal mehr Ihre Bankdaten. \n\nKaum zu glauben, aber wahr: Ab Januar 2018 muss Ihre Bank fremden Dienstleistern Zugriff auf die Daten Ihres Bankkontos gewähren. Verantwortlich dafür ist eine neue EU-Richtlinie. Das Bankgeheimnis wird de facto völlig abgeschafft und dürfte die Nachfrage nach Kryptowährungen wie Bitcoin weiter explodieren lassen.\n\nDas Bankgeheimnis -immerhin ein Gewohnheitsrecht, das seit dem 17. Jahrhundert verbürgt ist- existiert in Realität nicht mehr. Formaljuristisch mag es so etwas wie ein Bankgeheimnis noch geben, in der Praxis spielt dieses aber keine Rolle. So können Behörden bereits seit Jahren sämtliche Transaktionen von Bankkonten einsehen.  Was zunächst auf Verdachtsfälle gegen den Kontoinhaber beschränkt war, gilt inzwischen auch dann, wenn es überhaupt keine Anhaltspunkte dafür gibt, dass eine bestimmte Person etwas Unrechtmäßiges getan hat.\n\nSeit dem 25. Juni 2017 dürfen Finanzbehörden nach § 93 Abs. 1a der Abgabenordnung auch sogenannte Sammelauskunftsersuchen stellen „über eine ihr noch unbekannte Anzahl von Sachverhalten mit dem Grunde nach bestimmbaren, ihr noch nicht bekannten Personen“. Heißt konkret: Die Finanzbehörde kann einer Bank die Auflage stellen, ihr sämtliche Konten von Personen offenzulegen, die bestimmte Kriterien erfüllen.\n\nWelche Kriterien das sind, steht im Gesetzestext nicht. Bedingung ist zwar, „dass ein hinreichender Anlass für die Ermittlungen besteht und andere zumutbare Maßnahmen zur Sachverhaltsaufklärung keinen Erfolg versprechen“. Aber das bedeutet eben nicht, dass gegen die Personen, deren Kontodaten eingesehen werden, auch Verdachtsmomente bestehen müssen. Es reicht aus, wenn die Finanzbehörde ganz abstrakt „hinreichenden Anlass für Ermittlungen“ sieht – und zwar völlig egal, gegen wen und warum, erklärt Olivier Baron.\n\nAber die schleichende Abschaffung des Bankgeheimnisses geht noch weiter: Ab Januar 2018 muss Ihre Bank nicht nur den Behörden, sondern auch privaten Finanzdienstleistern Zugang zu sämtlichen relevanten Daten ihres Bankkontos, inklusive Kontostand und Transaktionen, gewähren. Verantwortlich dafür ist die neue EU-Richtlinie Payment Services Directive 2 (PSD2), die Banken dazu verpflichtet, eine Schnittstelle zu schaffen, über die Drittanbieter Zugriff auf Ihre Kontodaten erhalten.\n\nZwar müssen Sie als Bankkunde zustimmen, dass ein bestimmter Finanzdienstleister Ihre Kontodaten einsehen darf. In der Praxis ist aber absehbar, dass viele Finanzdienstleistungen (man denke an Kreditkarten, Online-Zahlungsdienste, u.v.a.m.) ohne Zugriff auf Ihre Kontodaten einfach nicht mehr angeboten werden! Stimmen Sie also nicht zu, werden Sie entsprechende Dienstleistungen womöglich gar nicht mehr in Anspruch nehmen können. Spätestens durch die PSD2-Richtlinie wird das Bankgeheimnis völlig ausgehebelt. Realität ist stattdessen der gläserne Bankkunde, dessen Daten nicht mehr ihm selbst gehören, sondern eben auch den Finanzbehörden und privaten Finanzdienstleistern.\n\nDieses Vorgehen ist nicht nur skandalös, sondern beraubt  Bankkunden auch um ein weiteres Grundrecht. Erst im November wurde bekannt, dass die Europäische Zentralbank die staatlich garantierte Einlagensicherung auf Guthaben von bis zu 100.000 Euro, abschaffen wird. In einer offiziellen Mitteilung der EZB vom 8. November 2017 heißt es, dass man ein Einlagensicherungssystem zum Schutz von Kundengeldern angeblich nicht mehr benötigt und man sich diesem daher kurzerhand einfach entledigt."
		},
		{
			"post_id": 33,
			"title": "Verkaufen ohne wenn und aber .",
			"date_published": 1540141466,
			"body": "Sparen sie Ihr Geld. Nicht mehr zu Ebay oder Amazon ! \n\n\nOpen Bazaar ist ein Open-Source-Protokoll für einen dezentralisierten e-Commerce-Marktplatz. Die Nutzer treten über Open Bazaar direkt miteinander in Kontakt. Das heißt, es gibt keine zentralisierte Partei, die Gelder oder Güter verwaltet. Käufer und Verkäufer müssen weder einander noch einer dritten Partei vertrauen. Stattdessen sorgen kryptographische Mechanismen für die Integrität der Daten. Die Zahlungen werden mit Kryptowährungen durchgeführt und per Multi-Signature-Wallets in Escrow gehalten.\n\nInsofern stellt Open Bazaar für Marktplätze eine ähnliche Entwicklung dar wie BitTorrent verglichen mit Napster. In Napster wurden die Daten noch auf zentralen Servern gespeichert, während BitTorrent komplett dezentral ist.\n\nhttps://www.btc-echo.de/open-bazaar-verkuendet-roadmap-fuer-2018/"
		},
		{
			"post_id": 32,
			"title": "Das Mittelalter ist zurück ! Bischof Bode nimmt seine !!! ev.luth.Katharinenkirchen in Besitz.\nSklaverei ist wieder da ! ",
			"date_published": 1540123675.9,
			"body": "https://bistum-osnabrueck.de/31493-2/\nDie ökumene ist nichts anderes als der Verrat an den Protestanten selbst.\nHier besteigt der vom Papst eingesetzte Franz Bode die im 13. Jahrhundert erbaute Katharinenkirche. Durch den Verrat der Clique der Osnabrücker Protestanten wurde das möglich gemacht.\nJedem sollte klar sein was das bedeutet. Das katholische Kirchenrecht das sich als mundiales Recht versteht , findet jetzt auch hier wieder seine Anwendung. \nhttp://www.vatican.va/archive/DEU0036/_INDEX.HTM\n\nDie Sklaverei beginnt mit der Taufe ! Mit Ihr verliert der ,, Mensch seine Rechte und wird als Person !! also als Sache mit Rechten aber viel mehr Pflichten versklavt !\n\nEs ist römisches Recht das sich vor allem damit beschäftigt eine Rechtsordnung für Sklaven wiederherzustellen. Damit entfallen die wichtigsten Reformen Luthers.\nOtto von Bismarcks Reformen werden zurücküberführt in die Rechtsordnung des Mittelalters. Nichts anderes passiert hier gerade bzw. ist passiert.\nDas wirkt sich bis auf den Besuch einer öffentlichen Toilette aus. Das schlimmste aber ist das Fehlen einer Grenze. \nEs ist wie die Asylpolitik genau das Gegenteil. Es ist eine Katastrophe !\nDie Ausweitung des römischen Rechts führt wie die Asylpolitik ins verderben. \nSchlimm ist das deutsche das nicht sehen.  Was hier passiert ist die Vernichtung des Gegenpols ein riesiger Schritt der NWO zur Einheitsreligion.\nDie das veranlasst haben sollte der alte Luthersatz gelten ,, ich will der erste sein der Sie ans Feuer legt ,, . Es ist Hochverrat !! \n\nUPIK® Datensatz - L\nL \tName \tEv.-Luth. Pfarramt St. Katharinen\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t340450283\nL \tGeschäftssitz \tAn der Katharinenkirche 7\nL \tPostleitzahl \t49074\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054120239556\n\tFax Nummer \t\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661\n\n\nDiese Clique ist dafür verantwortlich ! Es ist eine schlichte Firma !\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\n\nWas das bedeutet zeigt der Bericht über die Sklaverei der Jesuitischen Georgetownuniversität. https://www.welt.de/geschichte/article154753943/Amerikas-Elitehochschule-handelte-mit-Sklaven.html  \n\nhttps://www.deutschlandfunk.de/sklavenhandel-an-us-uni-wie-georgetown-seine-schuld.680.de.html?dram:article_id=366965\n\nEs ist zu überlegen was man diesen üblen Pack zeigen muss , damit Sie ihr Unheil einmal selbst erfahren. Sie sind einfach Kopfkrank !\n\n\n"
		},
		{
			"post_id": 31,
			"title": "Dieser sogenannte Bishof August Marahrens war wohl eine gespaltene Person .",
			"date_published": 1540062993.7,
			"body": "Entscheidend für den hannoverschen Sonderweg war die Persönlichkeit von Landesbischof August Marahrens. Gemäß lutherischer Zwei-Reiche-Lehre unterschied Marahrens streng zwischen kirchlichem und staatlichen Machtbereich: Als Geistlicher war er überzeugter Anhänger, Gründungsmitglied und Vorsitzender der 1. vorläufigen Leitung der Bekennenden Kirche und duldete keine staatliche Einmischung in religiöse und kirchliche Belange. Als Staatsbürger dagegen war er der Regierung und Hitler als Staatsoberhaupt treu und loyal ergeben und erlaubte kirchlicherseits keine offene Kritik an der staatlichen Politik. Stattdessen versuchte er immer wieder zwischen der Bekennenden Kirche und den Deutschen Christen bzw. dem NS-Regime zu vermitteln. Das gab ihm und seiner Landeskirche einen gewissen Schutz vor staatlicher Einmischung, andererseits wurden beide oft zu schweigenden Zuschauern des NS-Unrechts. Seine Haltung wurde Landesbischof Marahrens später oft vorgeworfen und macht ihn bis heute zu einer der umstrittensten Persönlichkeiten der hannoverschen Kirchengeschichte.\n\nDer war einfach nur Irre. Wie kann man für und gegen etwas sein.\nOder er war total verlogen ?"
		},
		{
			"post_id": 30,
			"title": "Treten Sie aus der Kirche aus. Das faule Pack soll selber arbeiten ! Werdet wach !",
			"date_published": 1540039874.1,
			"body": "https://unternehmensteilbrd.wordpress.com/category/unternehmen-kirche/\n\nFirmen haben kein recht auf Steuergelder. oder zahlen sie die auch in Ihrer KZW Werkstatt ?  Hier sind weitere Beispiele !\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\nUPIK® Datensatz – L\nL Name Lutherkirche Osnabrück\nNicht eingetragene Bezeichnung oder Unternehmensteil\nL D-U-N-S® Nummer 312512729\nL Geschäftssitz Miquelstr. 5\nL Postleitzahl 49082\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05415690166\nFax Nummer\nW Name Hauptverantwortlicher Martin Wolter\nW Tätigkeit (SIC) 8661\n\n\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\n\nUPIK® Datensatz - L\nL \tName \tEvangelisch-lutherischer Kirchenkreis Osnabrück\nW \tNicht eingetragene Bezeichnung oder Unternehmensteil \tEv.-luth. Kirchenkreis Osnabrück\nL \tD-U-N-S® Nummer \t341606149\nL \tGeschäftssitz \tMarienstr. 13-14\nL \tPostleitzahl \t49074\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054128392\nW \tFax Nummer \t054127869\nW \tName Hauptverantwortlicher \tFreidemann Pannen\nW \tTätigkeit (SIC) \t8661\n\nWeitere Optionen:\n\nDa muss auch ein Bild dazu !\n\nhttps://www.landeskirche-hannovers.de/evlka-de/wir-ueber-uns/sprengel-kirchenkreise/sprengel-osnabrueck/osnabrueck/portrait_friedmann_pannen"
		},
		{
			"post_id": 29,
			"title": "Tagesnachricht !",
			"date_published": 1540038766,
			"body": "\nFreie Wähler gegen CETA ?!\n\nErinnern wir uns an die Aussagen der Parteien in Bayern vor der Wahl. Die Freien Wähler hatten sich, neben Linken und Grünen, stets gegen das EU-Kanada-Abkommen ausgesprochen. In Deutschland müssen noch immer der Bundestag und der Bundesrat über CETA entscheiden. Ein Nein oder eine Enthaltung aus Bayern im Bundesrat könnte das Aus für den Handelsvertrag bedeuten.\n\nGestern haben die Koalitionsgespräche zwischen der CSU und den Freien Wählern begonnen. Die bayerische Verfassung gibt vor, dass der Landtag 22 Tage nach der Wahl das erste Mal zusammentreten muss - das wäre der 5. November. Da können wir Druck machen. Der BUND Naturschutz in Bayern, das Umweltinstitut München, Campact, foodwatch und Mehr Demokratie haben die Freien Wähler in Bayern aufgefordert, mit aller Kraft das europäisch-kanadische Freihandelsabkommen CETA im Bundesrat zu verhindern.\n\nDazu gibt es eine Petition an den Vorsitzenden der Freien Wähler, Hubert Aiwanger. Hier kann man ihn per Mail auffordern den Widerstand gegen CETA ernst zu nehmen. Die Mail an Herrn Aiwanger lautet:\n\nSehr geehrter Herr Aiwanger,\nbald muss der Bundesrat über das Handelsabkommen CETA entscheiden. Bayern sollte dabei nicht mit Ja stimmen. Denn CETA dient nicht der Allgemeinheit, sondern bedient einseitig die Interessen von Großkonzernen. CETA bedroht den Mittelstand, die Landwirtschaft und die kommunale Daseinsvorsorge. Mit seinen Regeln zum Investitionsschutz schafft das Abkommen zudem eine Paralleljustiz ohne demokratische Legitimation.\n\nSie haben ihre Kritik an dem Abkommen wiederholt deutlich gemacht - jetzt sind Sie in der Position, die Politik des Freistaats Bayern in den nächsten Jahren maßgeblich zu gestalten. Wir fordern Sie daher auf: „Sorgen Sie dafür, dass Bayern CETA im Bundesrat nicht zustimmt und sichern Sie dies im Koalitionsvertrag ab!\"\nWarum ist der Widerstand gegen CETA weiter wichtig?\n\nDas Vorsorgeprinzip – Grundsäule der Verbraucher- und Umweltpolitik Europas – wird durch das Handelsabkommen ausgehebelt. Mit CETA droht etwa, dass die EU den Einsatz von hormonell wirksamen Chemikalien zukünftig nicht mehr wirksam regulieren kann. Außerdem wird es mit CETA schwerer, europäische Verbraucherschutzstandards zu verbessern. Eine bessere Kennzeichnung für Lebensmittel zum Beispiel rückt damit in weite Ferne. Denn: Einmal zwischen den Vertragspartnern vereinbarte Bestimmungen können mit CETA nicht mehr einseitig geändert werden. Darüber hinaus sind exklusive Sonderklagerechte für ausländische Unternehmen In CETA festgeschrieben. Investoren können Regierungen auf hohe Schadensersatzsummen verklagen, wenn sie sich durch Umwelt- oder Verbraucherschutzgesetze benachteiligt sehen.\n\nDie Freien Wähler können nun beweisen ob ihre Wahlaussage etwas gilt. Freie-Wähler-Chef Hubert Aiwanger hat sich bisher immer gegen das EU-Kanada-Abkommen ausgesprochen. Er darf jetzt nicht einknicken, sondern muss zu seinem Nein zu CETA stehen. Die Interessen großer Konzerne dürfen nicht über dem Gemeinwohl stehen. Auch wertkonservative Bürger, denen Umwelt und Gesundheit am Herzen liegen, können Bündnispartner im Kampf gegen die sogeannten \"Frei\"-Handelsabkommen sein.\n\nMehr dazu bei https://www.foodwatch.org/de/informieren/freihandelsabkommen/aktuelle-nachrichten/bayern-koennte-ceta-stoppen/\nund die Mitmach Aktion https://www.foodwatch.org/de/informieren/freihandelsabkommen/nein-zu-ceta/"
		},
		{
			"post_id": 28,
			"title": "Der Grösste Raubzug der Geschichte",
			"date_published": 1539942350.2,
			"body": "„Cum Ex“ – Der größte Steuerraub der Geschichte"
		},
		{
			"post_id": 27,
			"title": "Wieso leben in Deutschland 2025 nur noch 28 Millionen Menschen ?",
			"date_published": 1539851339.2,
			"body": "http://www.deagel.com/country/Germany_c0078.aspx  Sie brauchen kein Statistiker zu sein um obige Statistik zu verstehen. Schauen Sie auf das Jahr 2018 . Dort sehen Sie eine Population in dem Gebiet der BRD von 81 Millionen Menschen. Schauen Sie nun auf das jahr 2025 unten bei der Prognose. Dort sind nur noch 26 Millionen Menschen. Wo ist der Rest geblieben ?  Und nun wissen Sie vielleicht das man mit Bürgerkrieg und ähnlichem. Mit Chemtrails , Impfen usw. lässt sich viel machen. Falsche Behandlungen , ja es gibt viele Möglichkeiten. \n\nDieses Pack will das erwirken in Osnabrück. Im Mittelpunkt steht der Herrscher !!  war Firmenrichter der Fa. Amtsgericht. Klaus Havliza ! Zusammen mit seiner Frau Barbara wollen die die Haft für den Widerstand !  Präventivhaft nennt man das ! https://www.noz.de/deutschland-welt/niedersachsen/artikel/1199566/verschaerftes-polizeigesetz-soll-kampf-gegen-terror-erleichtern\nEs ist an der Zeit das das deutsche Volk lernt gut von Böse zu unterscheiden.\n\nhttps://www.kirchenkreis-osnabrueck.de/kirchenkreis/kirchenkreisvorstand.html\n"
		},
		{
			"post_id": 26,
			"title": "Umvolkung im vollen Gange. Es wird Zeit zu handeln.",
			"date_published": 1539816756.9,
			"body": "In einer Videoreportage, wurde die AfD genannt, sich dem Thema „Umvolkung“ immer wieder annimmt, um auf Stimmenfang zu gehen. Daraufhin wurde ein Kommentar hinterlassen, den ich euch nicht vorenthalten möchte:\n\nAlso das mit der -Umvolkung- in dem Sie die AfD mit in Zusammenhang bringen, dass sie dann durch diese Stiftungen, intellektuell das besser vermarkten könnte. Da braucht es keine AfD dazu – ich würde mal empfehlen das hier zu lesen:\n\nPeter Sutherland, Sondergesandter des Generalsekretärs der Uno für internationale Migration, Ehemaliger irischer Europäischer Kommissar für Wettbewerb, dann Generaldirektor der Welthandelsorganisation (1993-95); ehemaliger BP-Vorsitzender (1997-2009), Aufsichtsratsvorsitzender von Goldman Sachs International (1995-2015); ehemaliger Administrator der Bilderberg-Gruppe, Vorsitzender der europäischen Sektion der Trilateralen Kommission und Vizepräsident des European Round Table of Industrialists.\n\n(Aussage des Generaldirektors der „International organzation for migration / IOM“ am „Council and Foreign Relations /CFR“ vom 30.9.2015. Man höre und staune:\n\n„Migration in großem Ausmaß ist unvermeidbar, notwendig und wünschenswert, wenn wir erfolgreich sein wollen. Als erstes müssen wir das öffentliche Narrativ über Migration verändern. Derzeit ist es toxisch, Migration hat ein schlechtes Image.“\n\nDazu dann der ehemalige WTO-Generaldirektor und Goldman Sachs Aufsichtsrat Peter Sutherland:\n\n„Jeder Idiot, der daherkommt und mir erklärt, dass ich dazu entschlossen bin, die Einheitlichkeit der Völker zu zerstören, hat absolut recht. Genau das habe ich vor. Wenn ich es morgen tun könnte, würde ich es tun.“\n\n(Er redet dann weiter darüber, wie man insbesondere in DEUTSCHLAND die öffentliche Meinung dazu verändern könne. Und jetzt halte man sich fest:)\n\n„Von äußerster Wichtigkeit ist es, die Medien zu erwischen, die Medien ins Boot zu holen ist der Schlüssel. Aber wir müssen auch bei den Spinnern die Tür einlaufen, bei der Beklopptenbrigade, die weite Teile unserer Medien in der modernen Welt beherrschen…“\n\nUnd wer das nicht glauben will, der Kommentator hat die Quelle nachgereicht, ist direkt beim CFR als unkorrigiertes Protokoll nachzulesen\n\n1.) https://www.cfr.org/event/global-response-mediterranean-migration-crisis?fbclid=IwAR0cyoiL3hvF4gqOd8eFqca9GFBpzjhPiWH2hgyqdEKv5vYGucOTN2wiPac\n\nDie UNO schmiedet einen globalen Pakt für dauerhafte, geordnete Massenmigration mit Aufnahmepflicht\n\n2.) https://fassadenkratzer.wordpress.com/2018/05/02/die-uno-schmiedet-einen-globalen-pakt-fuer-dauerhafte-geordnete-massenmigration-mit-aufnahmepflicht/?fbclid=IwAR3AMSTo6FqoKVc4aiwmoq5-CvoI9pOGV0zUg6uIZaHh5vp9v6T6Ko9uMIc\n\nUnd wer wissen will, was in den Denkfabriken ausgedacht wurde, wie viel Millionen Migranten Deutschland ertragen kann – und auch soll, der darf hier auf der Seite 112 lesen: https://ec.europa.eu/home-affairs/sites/homeaffairs/files/e-library/docs/pdf/final_report_relocation_of_refugees_en.pdf?fbclid=IwAR1gg60VssKWuQYp17Dwka07TWB_TZ5U3wVtnxAP42LAHsJUsQafcQErCcM\n\n217 Millionen würde Deutschland locker verkraften. Das sind Pläne der Zukunft.\n\nDoch das ist nicht alles: Das neue Menschsein wird hier vorbereitet: Das sind die Visionen der europäischen Elite bis in das Jahr 2050, daran wird mit Brachialgewalt gearbeitet. Ich kann nur allen Lesern empfehlen, sich mit der Agenda: Dialoge Zukunft. Visionen 2050 die auch unsere Kanzlerin Merkel über alles lobt; und auf allen europäischen Kanälen beworben wird, zu studieren.\n\n»Die zentrale Speicherung von Informationen (Konten, Identität, Gesundheit, Versicherungsinformationen auf dem Personalausweis) und die Vernetzung aller Lebensbereiche machten Barzahlungen überflüssig.«\n\nWir verstehen uns jetzt als Europäer, nur noch in manchen Köpfen ist das Wort Deutscher, Engländer oder Franzose verankert. Die Kinder unserer Nationen lernen nur noch, dass sie in einem Staat von Europa leben, welcher Staat das ist, ist irrelevant geworden.«\n\nBudgets werden global vergeben. Gelder werden somit international aufgeteilt. Der Rückgang der Geburtenrate in einigen Industriestaaten wird nicht als Nachteil gesehen. Im Gegenteil. Aufgrund des großen ökologischen Fußabdruckes wird es als notwendig empfunden, dass in den Wohlstandsnationen die Gesellschaft schrumpft. In der Gesellschaft findet eine Durchmischung der Völker statt. Die Menschheit sieht sich als Weltbürgertum.\n\n»Wir leben im Jahr 2050 in einer Welt, die keine (Staats)Grenzen mehr kennt. Das traditionelle Bild der Familie gibt es nicht mehr. Die Menschen werden in großen ‚Familiengemeinschaften‘ zusammen leben, ohne unbedingt verwandt zu sein. Kinder werden von mehreren Elternteilen mit unterschiedlichen sexuellen Hintergründen behütet. Die Gleichheit des Liebens, egal von welchem Geschlecht, ist auf allen Ebenen festgeschrieben. Daher wurde die Ehe abgeschafft.« https://www.nachhaltigkeitsrat.de/wp-content/uploads/migration/documents/RNE_Visionen_2050_Band_2_texte_Nr_38_Juni_2011.pdf?fbclid=IwAR2i7V3ZdrdqC3JtcppDqs_x26mCOFWD7ZXBei-czVQ6vfbABNkSwg0PQH4\n\nKein Journalist, auch kein Investigativer traut sich an dieses Thema ran. Die haben alle Schiss.\n\nPS: ein interessantes Buch über das geheime Eliteprojekt der Migration, ist von Friederike Beck, die ein Jahr nach Erscheinen dieses Buchs von einem Hund beim Joggen angefallen wurde, ins Krankenhaus kam, und da wurde dann ein bösartiger Krebs entdeckt, an dem sie verstarb.\n\nQuelle: Marigny de Grilleau, Facebook\n\nhttp://www.deagel.com/country/Germany_c0078.aspx\n\nHier werden keine Parteiinteressen vertreten ."
		},
		{
			"post_id": 25,
			"title": "Barbara Havliza ist als neue Chefin im Unternehmen Justizministerium eingetragen ! ",
			"date_published": 1539794841.5,
			"body": "UPIK® Datensatz - L\nL \tName \tNiedersächsisches Ministerium der Justiz\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t340596043\nL \tGeschäftssitz \tAm Waterlooplatz 1\nL \tPostleitzahl \t30169\nL \tPostalische Stadt \tHannover\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t05111200\nW \tFax Nummer \t05111205170\nW \tName Hauptverantwortlicher \tBarbara Havliza\nW \tTätigkeit (SIC) \t9111\n\nJa auch in der Fa.Bundesrat ist Sie eine grosse Nr. Sie regiert katholisch er evangelisch.\n\nhttps://www.bundesrat.de/SharedDocs/personen/DE/laender/ni/havliza-barbara.html \n\nEs ist an der Zeit das das deutsche Volk sich solcher Subjekte entledigt.\nhttps://www.noz.de/lokales/osnabrueck/artikel/1541660/justizministerin-warnt-vor-rechtsprechung-nach-stimmungslage\n"
		},
		{
			"post_id": 24,
			"title": "Es steht kurz bevor ! Dieser Beitrag ist übernommen . Jeder soll wie in China total erfasst und überwacht werden.",
			"date_published": 1539697557.4,
			"body": "https://youtu.be/xDOEeP5Xnk8"
		},
		{
			"post_id": 23,
			"title": "Widerstand leisten !",
			"date_published": 1539595105,
			"body": ""
		},
		{
			"post_id": 22,
			"title": "Die Geburturkunde mit der Du versklavt wirst !",
			"date_published": 1539593833.8,
			"body": "Das römische Recht macht Dich zum Sklaven. Der gelbe schein befreit davon . Hier die Zusammenhänge.  Es hängt alles an dem papier was nach deiner Geburt erstellt wurde.\n\nhttp://schaebel.de/wp-content/uploads/2015/04/Was-ist-eine-Geburtsurkunde.pdf"
		},
		{
			"post_id": 21,
			"title": "Es wird täglich schlimmer !",
			"date_published": 1539457447.1,
			"body": "Es muss etwas geschehn. Menschen sind keine Schweine die von der Geburt bis zum Ende Ihres Lebens überwacht werden dürfen. Personen die so etwas gut heissen sind zu bestrafen es sind selbsternannte Herrscher ! \n\nSüdkreuz-Gesichtserkennung ein \"durchschlagender Erfolg\"\n\nDas meint zumindest die Bundespolizei im Bericht der Tagesschau zu einer ersten Auswertung des Projekts am Bahnhof Südkreuz. Fefe meint dazu:\n\nMit bis zu 80% Trefferquote! Also durchschlagend jetzt im Durchfall-Sinne, klar. Denn 80% ist eine Bankrotterklärung sondergleichen. Jeder Fünfte wird falsch erkannt?! Soll das ein Scherz sein?!? Das sind ja Erkennungsquoten wie bei Robert Lemke! Da hat ja Aktenzeichen XY eine höhere Aufklärungsquote!?\n\nGenau das hatten wir in unseren Fragen- und Forderungskatalog dem Innenminister und der Bundespolizei vorgehalten. Die Antworten der Bundespolizei waren nur Zahlenspiele. Solche Tricksereien kann man umgekehrt auch anstellen: Entscheidend für solche Berechnungen ist nämlich wie viel Prozent der Leute gesuchte Verdächtige sind. Wenn wir von einem Teroristen in Deutschland ausgehen, also 1:82.000.000 kann es lange dauern, bis der mal unter den täglich mehreren Hundert False Positives (falsch Verdächtigten) ist. Nehmen wir den Satire-Clip von Alexander Lehmann \"Du bist Terrorist\" mit 82.000.000 Terroristen in Deutschland als Grundlage, dann würde auch die Bundespolizei mit dem System welche einfangen. ;-)\n\nDas Projekt geht nun in die zweite Phase, in der voraussichtlich ab Januar 2019 getestet werden soll, inwieweit Computerprogramme gefilmte Situationen und Gegenstände analysieren können. Damit will die Deutsche Bahn feststellen, wie gut die Programme seltene oder gefährliche Abweichungen von der Normalität im Bahnhof erkennen können. Dazu zählen beispielsweise hilflose Menschen und Gegenstände, die stehen gelassen wurden oder Menschengruppen, die ein auffälliges Verhalten zeigen - etwa indem sie alle schnell zu einer bestimmten Stelle laufen.\n\nDazu können wir wieder nur Fefe zitieren: Jawohl, Herr Pofalla! Ein derart auffälliges Verhalten hat man in Bahnhöfen der Deutschen Bahn noch nie beobachten können! So rechtzeitig kommen die Züge bei der Bahn nicht.\n\nWir warten auch nach 6 Monaten noch auf eine Antwort auf unseren Fragen- und Forderungskatalog von Anfang Mai.\n\nMehr dazu bei https://blog.fefe.de/?ts=a53e9348\nund https://www.tagesschau.de/inland/gesichtserkennung-berlin-test-103.html"
		},
		{
			"post_id": 20,
			"title": "Der Papst  hebt die Immunität für die sogenannten Beamte auf. Sie unterschreiben deshalb nicht !",
			"date_published": 1539342821.8,
			"body": "Seit dem 1. September 2013 ist dieser Erlass von Papst Franziskus in Kraft. Ein Motu Proprio (Lat.: aus eigenem Beweggrund, selbst veranlasst) ist ein offizielles Dekret, ausgestellt vom Papst persönlich in seiner Eigenschaft und seinem Amt als oberster, höchster Pontifex und nicht in seiner Eigenschaft als apostolischer Führer und Lehrer der Weltkirche.\n\nUm es klar auszudrücken, ein Motu Proprio ist die höchste Form eines legalen Werkzeugs (Rechtsinstrument) auf diesem Planeten, gemäss seiner Herkunft, seinem Einfluss und seiner Struktur zur westlich-römischen Welt, übertrifft es alles, was von den Vereinten Nationen, dem Inner und Middle Temple, der CROWN oder jedem anderen Monarchen oder Staats-, Regierungschef ausgestellt werden könnte. Für Mitglieder der Vereinten Nationen oder von den Vereinigten Staaten oder Großbritannien anerkannte Nationen ist dies das höchste legale Instrument, ohne Frage.\n\nIm Fall des Motu Proprio vom 11. Juli 2013 ist es ein mehrschichtiges Instrument mit mehreren Funktionen.\n\nIn erster Instanz, kann es rechtlich ausgelegt werden, zur Applikation bei lokalen Angelegenheiten bei der Verwaltung des Heiligen Stuhls.\n\nIn zweiter Instanz bezieht sich das Dokument auf die Tatsache, dass der Heilige Stuhl der Grundpfeiler ist, auf dem das gesamte globale Rechtssystem aufbaut, daher ist jeder, der irgendwo auf der Welt ein Amt bekleidet diesen Beschränkungen unterworfen und dass Immunität diesbezüglich nicht länger gilt.\n\nDrittens sehen wir, dass sich der Heilige Stuhl und die Weltkirche klar von der nihilistischen Welt der professionellen EL-ite trennen, die erwiesenermaßen kriminell krankhaft handeln und dies solange fortsetzen, bis sie jemand, der das Gesetz respektiert von der Macht reisst,\n\nAuf jedenfall ist dieses von Papst Franziskus ausgestellte Dokument auf mehreren Ebenen historisch, das Signifikanteste ist, dass es das wichtigste Gesetz, die Goldene Regel als oberste Gewalt anerkennt. Alle Menschen sind gleich, niemand steht über dem Gesetz.\n\nAlle Staatsdiener handeln seit der UCC-Einreichung “Declaration of Facts” (UCC Doc # 2012127914) vom 28. November 2012 durch den OPPT auf eigene Verantwortung und haften persönlich für ihre Handlungen. Sie haben seitdem nicht mehr die Sicherheit ihrer zwangsvollstreckten Firmen im Rücken.\n\nAlle Regierungschartas annulliert:\n(siehe: ERKLÄRUNG DER FAKTEN (DFECLARATION OF FACTS): UCC Doc # 2012127914 28. November 2012)\n\n    “…Dass jegliche und alle CHARTAS, einschließlich der United States Federal Government, UNITED STATES, “State of“, inklusive jeglicher und aller Abkürzungen, idem sonans oder andere rechtliche, finanzielle oder administrative Formen, jegliche und alle internationale Äquivalente, einschließlich jeglicher und aller ÄMTER und ÖFFENTLICHER DIENSTSTELLEN, BEAMTEN und ÖFFENTLICHER BEDIENSTETEN, VERWALTUNGSAKTE und VOLLZUGSBEDIENSTETE, VERTRÄGE, VERFASSUNGEN und SATZUNGEN, MITGLIEDSCHAFTEN, VERORDNUNGEN und jegliche und alle sonstige Verträge sowie Vereinbarungen, die damit und darunter getroffen worden sind, jetzt nichtig, wertlos, oder anderweitig annulliert sind, unwiderlegt;… “\n\nBankchartas annulliert:\n(siehe: TRUE BILL: WA DC UCC Doc # 2012114776 24. Oktober 2012)\n\n    “Erklärt und unwiderruflich gelöscht; jegliche und alle Chartas der Mitglieder der Bank für Internationalen Zahlungsausgleich (BIZ), aller Mitglieder und Nutznießer, einschließlich aller Begünstigter, einschließlich jeglicher Körperschaften, die private Geldsysteme besitzen, betreiben, unterstützen, begünstigen und die sich Rechnungsstellung, Geldeintreibung, Vollstreckungsmaßnahmen bedienen, um SKLAVENSYSTEME zu unterhalten … die rechtmäßige Werte mithilfe unrechtmäßiger Befugnis beschlagnahmen… “\n\nUnterlassungsanordnungen:\nEs wird auf die Unterlassungsanordnung (DECLARATION AND ORDER) UCC Doc # 2012096074 vom 9. September 2012, welche durch COMMERCIAL BILL UCC Doc. Nr. 2012114586 und TRUE BILL UCC Doc. No.2012 114776 ordnungsgemäß bestätigt und ratifiziert wurde, hingewiesen:\n\n    Freiwillige des Militärs … “zur Verhaftung und Verwahrung jeglicher und aller Körperschaften, ihrer Beauftragter, Beamten und anderer Akteure, ungeachtet des gewählten Domizils (domicil), die private Geldsysteme besitzen, betreiben, unterstützen, begünstigen und die sich Rechnungsstellung, Geldeintreibung, Vollstreckungsmaßnahmen bedienen, um SKLAVENSYSTEME gegen Menschen zu betreiben…“,\n\nund\n\n    “Wiederinbesitznahme aller privaten Geldsysteme, Nachverfolgungssysteme, Transferierungssysteme, Fakturierungssysteme, Inkassoeinrichtungen, Vollstreckungssysteme, welche SKLAVENSYSTEME betreiben… “\n\n    .\n\n    “…Alle Seinswesen (BEings) des Schöpfers sind verpflichtet, unverzüglich allen hier identifizierten öffentlichen Bediensteten und Beamten bei Implementierung, Schutz, Erhaltung und Durchführung dieser Anordnung (ORDER) mit allen Mitteln des Schöpfers und Schöpfungen zu unterstützen, durch, mit und in ihrer vollständigen persönlichen Haftung… “\n\nDie UCC-Dokumentnummern können in der Washington DC UCC Registry recherchiert werden: https://gov.propertyinfo.com/DC-Washington/\n\nAlle Regierungs- und Bankchartas sind annulliert, es existiert nichts mehr, was zur Leistung verpflichten könnte; es sei denn es besteht ein rechtmässig bindender Vertrag zwischen Einzelindividuen.\n\nIm Fall von unrechtmässigen Forderungen/Handlungen durch Vertreter zwangsvollstreckter Regierung-Unternehmen können Kulanzmitteilungen verschickt werden, welche die Staatsdiener über die neue international gültige Rechtslage aufklären und die die Bedingungen und Konditionen für zukünftige Interaktionen zwischen Einzelindividuen festlegen.\n\nHierzu zählen auch die Schadensersatzansprüche im Fall von unrechtmässig zugefügtem Schaden, falls die Informationen der Kulanzmitteilung entweder nicht gelesen oder nicht verstanden werden. Die dafür ausgestellten Rechnung können bis zum Pfandrecht durchgesetzt werden.\n\nAus eigener Erfahrung kann ich berichten, dass die Staatsdiener die Informationen entweder nicht lesen oder einfach nicht wahrhaben möchten, sie ignorieren und weiter “business as usual” betreiben. Es würde ihr Leben verändern und das möchten sie um jedem Preis vermeiden.\n\nAndererseits sind sie alle Befehlsempfänger, egal in welcher Position, sogar als sogenannter Direktor eines der Regierungs-Sub-Unternehmen. Sie können nicht autonom denken und handeln und dies ist auch gar nicht erwünscht. Sie sind Regelwerkjünger und gehorchen nur den Befehlen einer höheren Autorität.\n\nIm Fall von erlittenem Schaden und Menschenrechtsverletzungen durch Handlungen von öffentlichen Bediensteten, die für Einrichtungen arbeiten, welche unter dem Recht der Römischen Kurie funktionieren, sollte man sich deshalb an den Papst höchstpersönlich wenden. Es gibt für sie keine höhere Macht und Autorität auf diesem Planeten.\n\nUnd es gibt kein höheres universelles Gesetz als jenes, den Freien Willen jeder Seele zu respektieren. Das Motu Proprio – deutsche Version\nhttp://w2.vatican.va/…/papa-francesco-motu-proprio_20130711…\n[Texterklärungen in Klammern geschrieben von Kate of Gaia, übersetzt von: claudine]\n\nAPOSTOLISCHES SCHREIBEN\nIN FORM EINES «MOTU PROPRIO»\nSEINER HEILIGKEIT\nPAPST FRANZISKUS\nÜBER DIE GERICHTSBARKEIT DER RECHTSORGANE DES STAATES DER VATIKANSTADT IM BEREICH DES STRAFRECHTS\n\nIn der heutigen Zeit ist das Gemeinwohl zunehmend bedroht durch das staatenübergreifende und organisierte Verbrechen, den unangemessenen Umgang mit dem Markt und der Wirtschaft sowie durch den Terrorismus.\n\nEs ist daher notwendig, dass die internationale Gemeinschaft geeignete Rechtsmittel anwendet, die es ermöglichen, der Kriminalität vorzubeugen und ihr entgegenzuwirken, indem sie die internationale Zusammenarbeit der Justiz im Bereich des Strafrechts fördern.\n\nDurch die Unterzeichnung zahlreicher internationaler Abkommen auf besagtem Gebiet hat der Heilige Stuhl, der auch im Namen und Auftrag des Staates der Vatikanstadt handelt, stets betont, dass diese Vereinbarungen Mittel sind zur effektiven Bekämpfung der kriminellen Aktivitäten, die die Menschenwürde, das Gemeinwohl und den Frieden bedrohen.\n\nIn dem Wunsch, die Bemühungen des Apostolischen Stuhls um eine diesbezügliche Zusammenarbeit zu stärken, ordne ich durch das vorliegende Apostolische Schreiben in Form eines »Motu Proprio« an:\n\nDie zuständigen Rechtsorgane des Staates der Vatikanstadt üben die Strafgerichtsbarkeit auch aus in Bezug auf:\na) Straftaten, die gegen die Sicherheit, die grundlegenden Interessen oder die Güter des Heiligen Stuhls gerichtet sind;\nb) die Straftaten, die erwähnt werden im:\n– Gesetz des Staates der Vatikanstadt Nr. VIII vom 11. Juli 2013, das »Ergänzende Normen im Bereich des Strafrechts« enthält;\n– Gesetz des Staates der Vatikanstadt Nr. IX vom 11. Juli 2013,das »Änderungen im Strafgesetzbuch und in der Strafprozessordnung« enthält; die von den unter dem folgenden Punkt 3 aufgeführten Personen im Rahmen ihrer Amtsausübung begangen wurden;\nc) jede andere Straftat, deren Bekämpfung von einem internationalen Abkommen verlangt wird, das vom Heiligen Stuhl unterzeichnet wurde, wenn der Täter sich im Staat der Vatikanstadt befindet und nicht ins Ausland ausgeliefert wurde.\n\n2. Die unter Punkt 1 erwähnten Straftaten werden nach der Gesetzgebung abgeurteilt, die zu der Zeit, in der sie verübt wurden, im Staat der Vatikanstadt gültig war, vorbehaltlich der allgemeinen Prinzipien der Rechtsordnung in Bezug auf die zeitliche Anwendung der Strafgesetze.\n\n3. Im Rahmen des Vatikanischen Strafgesetzes werden den »öffentlichen Amtsträgern« gleichgestellt: [ehemalige vom Gesetz freigestellte “Privatbeamte” sind nun innerhalb dessen, was das Gesetz diktiert und werden haftbar gemacht, auch bekannt als „Staatsdiener“]\n\na) die Mitglieder, Beamten und Mitarbeiter der verschiedenen Einrichtungen der Römischen Kurie sowie der mit ihr verbundenen Institutionen; [weltweite Unternehmen und alle Individuen in der Treuhand sind Unternehmen gemäss ihrer Geburtsurkunde]\nb) die Päpstlichen Gesandten und die diplomatischen Mitarbeiter des Heiligen Stuhls; [Der Papst regiert die Kirche/Menschen/Treuhand, alle Menschen in der Geburts-Treuhand, durch die Römische Kurie, dem regierenden Organ des Vatikans]\nc) Personen, die vertretende, verwaltende oder leitende Funktionen bekleiden, sowiejene, die – auch »de facto« – unmittelbar vom Heiligen Stuhl [Treuhand Begünstigte]abhängige Körperschaften [Staatsdiener] verwalten und kontrollieren und die im Verzeichnis [durch Geburtsurkunden] der kirchlichen Rechtspersonen [Legale Fiktion repräsentiert durch deine Geburtsurkunde mit NAME IN GROSSBUCHSTABEN]eingetragen sind, das im Governatorat des Staates der Vatikanstadt geführt wird.\nd) jede weitere Person, die einen administrativen oder juristischen Auftrag am Heiligen Stuhl besitzt, sei es ständig oder vorübergehend, entlohnt oder unentgeltlich, auf jedweder Ebene der Hierarchie. [alle Staatsdiener]\n\n4. Die unter Punkt 1 erwähnte Gerichtsbarkeit schließt auch die administrative Verantwortung der Rechtspersonen ein, die sich aus einer Straftat herleitet, wie es von den Gesetzen des Staates der Vatikanstadt geregelt wird. [Staatsdiener sind nun haftbar für ihre Verbrechen gegen die Menschlichkeit]\n\n5. Falls in anderen Staaten in derselben Sache vorgegangen wird, kommen die im Staat der Vatikanstadt gültigen Normen über die konkurrierende Gerichtsbarkeit zur Anwendung.\n\n6. Art. 23 des Gesetzes Nr. CXIX vom 21. November 1987, durch das die Gerichtsordnung des Staates der Vatikanstadt verabschiedet wurde, bleibt weiterhin gültig.\n\nDies beschließe und bestimme ich ungeachtet jeder anderen gegenteiligen Anordnung. Ich bestimme, dass das vorliegende Apostolische Schreiben in Form eines »Motu Proprio« [auf seinen eigenen Impuls] durch die Veröffentlichung im Osservatore Romano promulgiert werde und am 1. September 2013 in Kraft trete.\n\nGegeben zu Rom, aus dem Apostolischen Palast, am 11. Juli 2013, im ersten Jahr meines Pontifikats.\n[Synopsis: Kirche = Menschen = Treuhand\n\nDer Vatikan hat eine weltweite Treuhand erschaffen, indem die Geburtsurkunde benutzt wird, um den Wert der zukünftigen produktiven Energie jedes Individuums zu erbeuten. Jeder Staat, Provinz und Land im Fiat Geld System (Papiergeld ohne Deckung) trägt den Wert seiner Menschen zu dieser Welt Treuhand bei, identifiziert z.B. durch SS, SIN, EIN Nummern (Sozialversicherungsnummern, Steuernummern), die von der Vatikan Registrierung verwaltet werden. Weltweit sind Unternehmen (Individuuen werden zu Unternehmen durch ihre Geburtsurkunde) mit dem Vatikan verbunden durch das Gesetz (Vatikan zur CROWN zur BAR zu Gesetzen, um Menschen zu richten) und durch Geld (Vatikan Geburts-Konten zum IMF zur Treasury (Federal Reserve) zu Banken zu Menschen (Kredite) zu Richtern (Administration) und Sheriffs (Polizei/Gerichtsvollzieher)(Beschlagnahmung).\n\nRichter verwalten das Geburts-Treuhandkonto im Falle von Gerichtsfällen, begünstigen das Gericht und die Banken, handeln als mutmasslicher „Begünstigter“, da sie den „wahren Begünstigten“ nicht richtig über deren eigene Treuhand beraten haben.\n\nRichter, Anwälte, Banker, Gesetzgeber, Strafverfolgung und alle öffentlichen Beamten (Staatsdiener) sind nun persönlich haftbar für ihre Beschlagnahmung von Häusern, Autos, Geld und Anlagen der wahren Begünstigten, für Freiheitsberaubung, Betrug, Belästigung und die Umwandlung der Treuhandfonds der wahren Begünstigten.]"
		},
		{
			"post_id": 19,
			"title": "Befreiung von der Herrschaft !",
			"date_published": 1539342312.5,
			"body": "http://schaebel.de/allgemein/herrschaftslos-simpel-einfach-fern-ab-vom-chaos/009265/   Trenne Dich von den Peinigern."
		},
		{
			"post_id": 18,
			"title": "Befreiung von google !",
			"date_published": 1539340962.6,
			"body": "Diese Datenkrake weiss alles über Sie. Es ist einfach Handys ohne diese kriminelle Firma zu betreiben. \nLernen Sie ohne Verzicht auf einen Service wie es geht. Schreiben Sie an einen sinnvollen Dienst. Er hilft Ihnen dabei. Wir haben Ihn durch Zufall gefunden."
		},
		{
			"post_id": 17,
			"title": "Die whats app Katastrophe !",
			"date_published": 1539338340.9,
			"body": "Milliarden WhatsApp-Nutzer durch Sicherheitslücke bedroht\n\nEin Angreifer könnte mit einem einzigen Videoanruf eine Sicherheitslücke in der Android Version von WhatsApp ausnutzen. Das hat jetzt das Google Project Zero bekannt gegeben. Bereits in der letzten Woche hatte WhatsApp eine fehlerbereinigte iOS-Version bereit gestellt. Auf dem Google Play Store sollte seit dem 28.9. die Version 2.18.302 oder neuer herunterladbar sein. Allerdings wurde \"vereinzelt\" auch am 10.10. noch die fehlerhafte WhatsApp-Version 2.18.293 vom 24.09.2018 angeboten.\n\nIn der angreifbaren Version wird die Speicherverwaltung des Video-Conferencing Dienstes angegriffen. Mit ein em speziell präpariertes RTP-Paket kann der Absender eigenen Code einschleusen und damit das Smartphone kapern. So lässt sich unter Umständen auch Spionage-Software auf dem Gerät installieren.\n\nWir können nur zum x-ten Mal vor der Verwendung von WhatsApp warnen, weil die App, wie auch Facebook selbst, seit Jahren nicht nur durch fehlerhaften Code sondern durch unlautere Methoden aufgefallen ist. \n\nMehr dazu bei https://www.heise.de/security/meldung/Kritische-Sicherheitsluecke-gefaehrdet-Milliarden-WhatsApp-Nutzer-4186365.html\nund alle unsere Artikel über Facebook https://www.aktion-freiheitstattangst.org/cgi-bin/searchart.pl?suche=Facebook&sel=meta\n"
		},
		{
			"post_id": 16,
			"title": "Der Steuerzahler zahlt Schwulengottesdienste !\nPrivatveranstaltungen des Geschäftsführers Hartung !",
			"date_published": 1539297036.3,
			"body": "Korrespondenz einer Dissertation !\nBeteiligt waren \n1.\nUPIK® Datensatz - L\nL \tName \tPfarramt St. Joseph\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t340447743\nL \tGeschäftssitz \tMiquelstr. 23\nL \tPostleitzahl \t49082\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t0541500510\nW \tFax Nummer \t05415005112\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661\n\n2. Beteiligter\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\nGeschäftsführer des Unternehmens\n\nUPIK® Datensatz – L\nL Name Lutherkirche Osnabrück\nNicht eingetragene Bezeichnung oder Unternehmensteil\nL D-U-N-S® Nummer 312512729\nL Geschäftssitz Miquelstr. 5\nL Postleitzahl 49082\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05415690166\nFax Nummer\nW Name Hauptverantwortlicher Martin Wolter\nW Tätigkeit (SIC) 8661\n\n\n\nKorrespondenz !\n\n\nSubject: \t[Fwd: Abschrift]\nFrom: \t\"Priv.Dozent Uta Maur\" <Maur@secmail.pro>\nDate: \tMon, August 27, 2018 18:10\nTo: \tlouiy@dodg.email\nOptions: \t\nView Full Header | View Printable Version  | Download this as a file\n\n---------------------------- Original Message ----------------------------\nSubject: Abschrift\nFrom:    \"Priv.Dozent Uta Maur\" <Maur@secmail.pro>\nDate:    Mon, August 27, 2018 4:00 pm\nTo:      dhartungd@gmx.de\n--------------------------------------------------------------------------\n\n---------------------------- Original Message ----------------------------\nSubject: Vertrauliche Abschrift\nFrom:    \"Priv.Dozent Uta Maur\" <Maur@secmail.pro>\nDate:    Sat, August 25, 2018 12:36 pm\nTo:      pfarrer@st-joseph-os.de\n--------------------------------------------------------------------------\n\nManchmal wird etwas vergessen. Ich habe Ihren Diakon Herrn Niermann\ninsoweit informiert und Sie vergessen !\nDie Verantwortlichkeit fuer die hier gelisteten Gottesdienste , in denen\nIhre Gemeinde genannt wird  http://queer-gottesdienst.de/ liegt\nausschliesslich ausserhalb Ihrer Kirchengemeinde. Das wurde von Herr\nDiakon Hartung ev.luth.Lutherkirchengemeinde damaliger Geschaeftsfuehrer ,\nausdruecklich bestaetigt.\n\n\nHerzl.Gr\n\n---------------------------- Original Message ----------------------------\nSubject: Kenntnisnahme\nFrom:    \"Priv.Dozent Uta Maur\" <Maur@secmail.pro>\nDate:    Fri, August 17, 2018 10:56 am\nTo:      diakon-niermann@st-joseph-os.de\n--------------------------------------------------------------------------\n\nDer Vollständigkeit halber , moechte ich Ihnen einen Auszug einer mail zur\nKenntnis bringen , die zu einem Abschluss meiner wissschft. Arbeit in dem\nPunkt der ,,Beteiligung Ihrer Gemeinde an Gottesdiensten fuer\nHomosexuelle,, bezogen auf diese Veroeffentlichung im Internet\nhttp://queer-gottesdienst.de/ abschliessend beitragen konnte.\n\nEr beweist die Richtigkeit meiner Darstellung und zugleich die Richtigkeit\nIhrer freundlichen Informationen , fuer die ich mich nochmals herzl.\nbedanke.\n\nBitte behandeln Sie diese information unter dem Siegel des\nBeichtgeheimnisses , insbesondere da es mir fern liegt mit meinen ohnehin\nnicht einfachen Studien voran zu kommen , da es laut der Nutiatur in\nBerlin\nkirchliche Vorschriften gibt , die eine solche Beteiligung moeglicherweise\nzu einem kirchenrechtlichen Problem machen , so wurde es mir erklaert\nzumindest.\n\n\nHerzl. Gr.\n\n\nZitat Auszug aus der mail :\n\nAch ja, die Joefskirche war wahrscheinlich nur zufällig und unbeabsichtigt\nGastgeberin dieser Queer Gottesdienste. Der jetzt abgelöste Priester, der\ndamals\nzustänig war, hatte große Probleme damit, dass ich  als Geistlicher meinen\nMann in\nder Lutherkirche vor 2 Jahren geheiratet habe.  Mit der Gemeindereferentin\nhatte ich\nzum Reformationsjubiläum konfessionsverschiedene Ehepaar zu einem Abend\neingeladen.\nDa mein Mann auch katholisch ist, war ich dafür ja der prädestinierte\nGesprächspartner für diese Ehepaare. Der Priester hätte  aus diesem Grund\nbeinah die\nVeranstaltung abgesagt. Für ihn war diese Sichtweise unvorstellbar, für die\neingeladenen Ehepaar übrigens nicht... sie fanden mein Statement zu gelebten\nkonfessionverbindender Ehe als sehr interessant.\n\nWahrscheinlich habe ich jetzt nichts zu Ihrer Untersuchung und Desertation\nbeigetragen.\n\nMit freundlichstem Gruß\nDirk Hartung\n\n\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
		},
		{
			"post_id": 15,
			"title": "Das alte deutsche Reich , das vor dem 3.Reich ist nicht untergegangen. Die BRD ist die Rechtsnachfolgerin des 3. Reichs. Deutschland ist das Gebiet in den Grenzen des Art.116 GG . Lesen !",
			"date_published": 1539281396.1,
			"body": "Seht es selbst ! https://www.bundestag.de/presse/hib/2015_06/-/380964\n\nPetra Gerster , die BRD ist Rechtsnachfolgerin des 3.Reiches !\nhttps://youtu.be/SmkShuoX_Wc"
		},
		{
			"post_id": 14,
			"title": "Wichtige Nachricht ! Dieses Bild sollten Sie sich einprägen !  Wer hat den beauftragt ?\n\n\n\nhttps://duckduckgo.com/?iax=images&ia=images&iai=http%3A%2F%2Fmedia0.faz.net%2Fppmedia%2Faktuell%2F589647824%2F1.2640932%2Fwidth610x580%2Fchristoph-heusgen.jpg",
			"date_published": 1539278652.3,
			"body": "Dr. Christoph Heusgen von der CDU/CSU.\n\nSeines Zeichens Außen- und sicherheitspolitischer Berater der Bundeskanzlerin.\n\nViel wichtiger jedoch: seit 2017 ist Herr Heusgen ständiger Vertreter der Bundesrepublik Deutschland bei den Vereinten Nationen.\n\nJa, schön nicht wahr? Dieser Mann vertritt Ihre Interessen bei den Vereinten Nationen.\nAm 11.12.2018 wird er, sofern ihn niemand aufhält dort in Ihrem Namen den Globalen Migrationspakt unterzeichnen.\n\nDieser beinhaltet die Organisation und Vorbereitung von Auswanderung bereits in den Herkunftsländern und die Schaffung sicherer Reiserouten.\n\nIm Zielland angekommen soll dem Migranten sofort und grundsätzlich ein “diskriminierungsfreier Zugang” zur Grundversorgung, zu den Sozialwerken, zu einer «bezahlbaren und unabhängigen» Rechtsvertretung, zu Bildung, lebenslangem Lernen und zur Gesundheitsversorgung gewährt werden.\n\nDies bedeutet umgehender Zugang zu allen Leistungen des Sozialstaats und vollkommene Gleichstellung zur dort lebenden Bevölkerung in allen Belangen.\n\nAuch der Familiennachzug soll erheblich erleichtert werden.\n\nJa, und da man damit rechnet, daß die Bürger der Ursprungsgesellschaften, wie schon jetzt die Realitäten des “Fachkräftezuwachs” beweisen, massiv belastet werden, und zwar ökonomisch, finanziell, kulturell, religiös und als Opfer von sexistischer, religiöser, rassistischer, oder schlicht durch kriminelle Energie motivierter Straftaten, beugt man dem zu erwartenden Unmut ebenfalls vor:\n\nHerr Heusgen wird in Ihrem Namen unterschreiben, daß Deutschland «alle Formen von Diskriminierung» “eliminieren” wird, und die Förderung des öffentlichen Diskurses «zur Gestaltung der Wahrnehmung der Migration» mit staatlichen Mitteln fördert.\n\nDas bedeutet, Widerspruch gegen die Massenmigration wird kriminalisiert, und die Medien sind staatlich angehalten, die durch ein paar Einzelfälle zu unrecht eher negative allgemeine Meinung zu “Flüchtlingen” zu re-framen, heißt, mittels Propaganda ein neues frisches Migrantenbild zu schaffen, in dem diese von der Bevölkerung endlich als Zugewinn und “wertvoller als Gol…” ( ach nein..der hatte ja nicht so gut geklappt), eben bereichernd wahrgenommen werden..\n\nUnd damit da auch niemand Gegenteiliges berichtet, geht es weiter:\nMan verpflichtet sich, Medien öffentliche Gelder oder sonstige Unterstützung zu entziehen, die «systematisch Intoleranz, Xenophobie, Rassismus und andere Formen von Diskriminierung gegen Migranten fördern». Eine sehr schwammige Formulierung, die Raum für vielseitige Repressalien gegen unliebsame Gegenstimmen zulässt.\n\nJa, das ist ein beängstigendes Bild.\nUnd eines, das wütend macht.\n\nIch kann mich nämlich nicht erinnern, Herrn Heusgen den Auftrag erteilt zu haben, diesen Pakt in meinem Namen zu unterschreiben.\nIch kann mich nicht mal daran erinnern, von meiner Regierung oder den Mainstreammedien darüber aufgeklärt worden zu sein, was genau dieser beinhaltet.\n\nEs mag daran liegen, daß ich mich für diesen Pakt nicht begeistern kann.\nUnd selbstverständlich auch daran, daß meine Interessen mit Füßen getreten werden, um globale Märkte zu erschließen und den hochmobilen “Weltenarbeitssklaven” zu erschaffen, denn darum geht es in Wirklichkeit: Kaufkraft und humanes Kapital.\n\nWem es ähnlich geht, der kann gern folgende Petition unterschreiben:\n\n    Home\n\nUnd Herrn Heusgen gern teilen.\nDa er in unserem Namen zu handeln gedenkt, ist es doch nur nett, wenn ihn wenigstens alle mal kennenlernen.\n\nAnm: Redaktion: vielleicht hat ja einer die Faxnummer dieses Herren… man sollte ihm wenigstens mitteilen, dam man die Haftungszusage für diese Angelegenheit nicht geben mag."
		},
		{
			"post_id": 13,
			"title": "Wir werden vergiftet !",
			"date_published": 1539262253.7,
			"body": "\n“Die Kunst des Krieges”\nDie Insektenarmee des Pentagons\nvon Manlio Dinucci\n\nQuelle  http://www.voltairenet.org/article203415.html\n\nDas Pentagon ist damit beschäftigt, alle Arten von Forschung zu betreiben. Die Defense Advanced Research Projects Agency (DARPA) untersucht die Möglichkeit, Pflanzen durch Insekten zu infizieren, während das Office of Naval Research hofft, andere Insekten als Sensoren zu verwenden, die Sprengstoffe erkennen können. Das ist keine Science-Fiction.\nInsektenschwärme, die gentechnisch veränderte infektiöse Viren transportieren, die landwirtschaftliche Nutzpflanzen eines Landes angreifen und seine Nahrungsmittelproduktion zerstören - das ist kein Science-Fiction-Szenario, sondern ein Plan, der von der DARPA, der Defense Advanced Research Projects Agency des Pentagons, derzeit vorbereitet wird.\n\nFünf Wissenschaftler von einer französischen und zwei deutschen Universitäten haben diese Informationen in Science, einem der angesehensten wissenschaftlichen Magazinen der Welt, veröffentlicht [1]. In ihrem am 5. Oktober veröffentlichten Leitartikel stellen sie ernsthaft in Frage, dass die Forschung der DARPA mit dem Titel \"Insektenverbündete\" nur für den von der Agentur erklärten Verwendungszweck - den Schutz der US-Landwirtschaft vor Krankheitserregern durch die Verwendung von Insekten als Überträger gentechnisch veränderter Infektionsviren - bestimmt sei. Diese Viren werden auf Pflanzen übertragen und verändern deren Chromosomen. Diese Kapazität - wie von den fünf Wissenschaftlern erklärt - scheint \" sehr begrenzt \" zu sein.\n\nInnerhalb des wissenschaftlichen Milieus wird das Programm jedoch \"weithin als Versuch wahrgenommen, biologische Kampfstoffe für feindliche Zwecke und ihre Trägersysteme zu entwickeln\", mit anderen Worten \" eine neue Form von biologischer Waffe \". Dies verstößt gegen das 1975 in Kraft getretene Übereinkommen über biologische Waffen, das jedoch vor allem aufgrund der Weigerung der USA, Inspektionen ihrer eigenen Labors zu akzeptieren, inaktiv geblieben ist.\n\nDie fünf Wissenschaftler stellen fest, dass \"unschwer Vereinfachungen genutzt werden könnten, um eine neue Klasse von biologischen Waffen zu entwickeln, Waffen, die aufgrund der Insektenausbreitung als Trägermittel extrem übertragbar auf empfängliche Pflanzenarten wären\".\n\nDieses Szenario eines Angriffs auf die landwirtschaftlichen Kulturen in Russland, China und anderen Ländern, angeführt vom Pentagon mit Schwärmen von Insekten, die das Virus transportieren, ist keine Science-Fiction-Geschichte. Das Programm der DARPA ist nicht das einzige, das Insekten als Kriegswaffe einsetzt. Das US Office of Naval Research hat die Washington University in St. Louis [2] um Forschung gebeten, um Heuschrecken in biologische Drohnen zu verwandeln [3].\n\nMit einer in das Gehirn implantierten Elektrode und einem winzigen Sender auf dem Rücken des Insekts kann der Bediener am Boden entschlüsseln, was die Antennen der Heuschrecke aufnehmen. Diese Insekten haben eine olfaktorische Fähigkeit, verschiedene Arten von chemischen Substanzen in der Luft sofort wahrzunehmen - was die Identifizierung von Sprengstofflagern und anderen Stätten ermöglicht, die von Luft- oder Raketenangriffen getroffen werden können.\n\nNoch beängstigendere Szenarien wurden im Editorial von den fünf Wissenschaftlern im Science Magazine erwähnt. Das Programm der DARPA - betonen sie - ist das erste Programm zur Entwicklung von genetisch veränderten Viren, die in der gesamten Umwelt verbreitet werden können und andere Organismen \" nicht nur in der Landwirtschaft \" infizieren könnten. Mit anderen Worten, Menschen könnten zu den Organismen gezählt werden, die von den durch Insekten übertragenen infektiösen Viren potenziell betroffen sind.\n\nWir wissen, dass während des Kalten Krieges in den Labors der USA und anderer Nationen an Bakterien und Viren geforscht wurde - wenn diese Erreger durch Insekten (Läuse, Fliegen, Zecken) verbreitet werden, können sie Epidemien in der feindlichen Nation auslösen. Dazu gehören die Bakterien Yersinia Pestis, die Ursache der Beulenpest (der schreckliche \"Schwarze Tod\" des Mittelalters) und das Ebola-Virus, das sowohl ansteckend als auch tödlich ist.\n\nMit den heute verfügbaren Techniken ist es möglich, neue Arten von Krankheitserregern zu produzieren, die sich durch Insekten ausbreiten und gegen die die Zielbevölkerung keine Verteidigung hätte.\n\nDie \"Plagen\", die in der biblischen Erzählung von Gott gesandt wurden, um Ägypten mit riesigen Schwärmen von Moskitos, Fliegen und Heuschrecken zu treffen, können heute tatsächlich von Menschen gesandt werden, um die ganze Welt zu treffen. Diesmal werden wir nicht von Propheten gewarnt, sondern von Wissenschaftlern, die ihre Menschlichkeit bewahrt haben."
		},
		{
			"post_id": 12,
			"title": "Die Unwägbarkeiten eines \"öffentlichen privaten Raums\"",
			"date_published": 1539259931.4,
			"body": "Die Unwägbarkeiten eines \"öffentlichen privaten Raums\"\n\nSeit nun drei Jahren kämpft Thomas H. sich durch den Dschungel der Gerichte, weil er bei einer Messe fünf Minuten sein Recht auf Meinungs- und Versammlungsfreiheit gegen die massive Werbung der Bundeswehr im öffentlichen Raum wahrnahm.\n\nEigentlich gibt es sogar zum Demonstrationsrecht auf Privatgelände sogar eine höchstrichterliches Urteil: Der Staat darf sich „seiner Grundrechtsbindung durch eine ‚Flucht ins Privatrecht‘ nicht entziehen“, heißt es 2011 im Fraport-Urteil des Bundesverfassungsgericht. Im Fall von Thomas H. handelte es sich um eine Messehalle, die sich vollkommen in öffentlicher Hand der Stadt Stuttgart befindet. Die Stadt übernahm die Schirmherrschaft über die besagte Messe-Veranstaltung. Der Protest fand also in einer öffentlichen Einrichtung statt, die als privat-öffentliche Kooperation angemietet wurde, und wo die Bundeswehr als öffentliche Institution versuchte Nachwuchs zu werben.\n\nTrotzdem verlief der bisherige Rechtsweg eher ernüchternd. Anklage und die Gerichte konnten im bisherigen Prozessverlauf weder Thomas H. eine individuelle Schuld nachweisen, z.B. dass er den Messeablauf im besonderen Umfang beispielsweise durch ein Megaphon gestört haben soll; noch konnten sie deutlich machen, ob das Hausverbot überhaupt ausgesprochen werden konnte oder ob es überhaupt beim Angeklagten ankam. Das Hauptargument der Verteidigung des Aktivisten allerdings, dass es möglich sein muss, gegen die Bundeswehr auch zu demonstrieren, wenn sie sich im Privaten versteckten will, blieb bisher fast völlig ungehört. Das vorletzte Kapitel war die Beschwerde beim Bundesverfassungsgericht. Sie wurde am 8. Juni 2018 abgelehnt, da sie nicht zur Entscheidung angenommen wurde. Nun bleibt nur noch der Europäische Gerichtshof.\n\nMehr dazu bei http://www.imi-online.de/2018/10/08/bundeswehrmessen-wann-darf-demonstriert-werden/"
		},
		{
			"post_id": 11,
			"title": "Einige adressen aus der Religionsindustry der Fa. Osnabrück (SIC) 8661",
			"date_published": 1539192095.9,
			"body": "\nDer Chef ist wieder da  !!\nhttps://bistum-osnabrueck.de/31493-2/  \nWeck die tote Christenheit aus dem Schlaf der Sicherheit“ singen wir seit bald 200 Jahren. Wach werden leute ! \nDas Mittelalter ist zurueck. Aufwachen der Ablasshandel ist wieder da. Diesmal machen das Firmen !  Es geht alles sehr zeitgemaess zu. Noch ein bisschen abhoeren und so ein bisschen Praeventivhaft fuer die Suender ja dann sind wir wieder bei der Inquisition !  https://de.wikipedia.org/wiki/Inquisition.\n\n\n\nGeschäftsführer 2009 bis 2011 z.B.\n\nDiakon Dirk Hartung\nEvangelisch - lutherische Südstadtkirchengemeinde\n49082 Osnabrück, Miquelstraße 5\nFernruf: 0541-5690168, Fax: 0541 - 5690165\nEmail:dhartungd@gmx.de\nMobil: 0151- 22951931\nPrivat: Liebigstr. 3 Fernruf 0541-29133\nwww.suedstadtkirchengemeinde.de\n\n\n\nUPIK® Datensatz – L\nL Name Lutherkirche Osnabrück\nNicht eingetragene Bezeichnung oder Unternehmensteil\nL D-U-N-S® Nummer 312512729\nL Geschäftssitz Miquelstr. 5\nL Postleitzahl 49082\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05415690166\nFax Nummer\nW Name Hauptverantwortlicher Martin Wolter\nW Tätigkeit (SIC) 8661\n\nHier ist die Haupstelle !! der Filale Osnabrück\n\nUPIK® Datensatz – L\n\nL Eingetragener Firmenname Evangelisch-lutherische Landeskirche\nHannover\nL Nicht eingetragene Bezeichnung oder\nUnternehmensteil\nEv. Kirche Hannover\nL D-U-N-S® Nummer 333379993\nL Geschäftssitz Rote Reihe 6\nL Postleitzahl 30169\nL Postalische Stadt Hannover\nLand Germany\nW Länder-Code 276\nPostfachnummer\nPostfach Stadt\nL Telefon Nummer 05111241163\nW Fax Nummer 05111241163\nName Hauptverantwortlicher\nW Tätigkeit (SIC) 8661\nQuelle: upik.de\n\nSIC Code\n8661 Religious Organizations\nQuelle: United States Department of Labo\n\nUPIK® Datensatz - L\nL \tName \tEvangelisch-lutherischer Kirchenkreis Melle-Georgsmarienhütte\nW \tNicht eingetragene Bezeichnung oder Unternehmensteil \tEv.-luth. Apostelkirchengemeinde Sutthausen-Holzhausen\nL \tD-U-N-S® Nummer \t342853949\nL \tGeschäftssitz \tAm Kniebusch 7\nL \tPostleitzahl \t49082\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054159032\nW \tFax Nummer \t054159132\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661\n\nUPIK® Basics\nWeitere Optionen:\nUPIK® Datensatz - L\nL \tName \tEvangelisch-lutherischer Kirchenkreis Osnabrück\nW \tNicht eingetragene Bezeichnung oder Unternehmensteil \tEv.-luth. Kirchenkreis Osnabrück\nL \tD-U-N-S® Nummer \t341606149\nL \tGeschäftssitz \tMarienstr. 13-14\nL \tPostleitzahl \t49074\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054128392\nW \tFax Nummer \t054127869\nW \tName Hauptverantwortlicher \tFreidemann Pannen\nW \tTätigkeit (SIC) \t8661\n\nUPIK® Datensatz - L\nL \tName \tEv.-luth. Kirchenkreis Osnabrück, Körperschaft des öffentlichen Rechts\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t312899439\nL \tGeschäftssitz \tMarienstr. 13/14\nL \tPostleitzahl \t49074\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054128392\n\tFax Nummer \t\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661\n\nUPIK® Datensatz - L\nL \tName \tEv.-luth. Kirchenkreis Osnabrück, Körperschaft des öffentlichen Rechts\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t312899439\nL \tGeschäftssitz \tMarienstr. 13/14\nL \tPostleitzahl \t49074\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t054128392\n\tFax Nummer \t\n\tName Hauptverantwortlicher \t\nW \tTätigkeit (SIC) \t8661\n\nUPIK® Datensatz - L\nL Name Ev.-Luth. Pfarramt St. Katharinen\nNicht eingetragene Bezeichnung oder Unternehmensteil \nL D-U-N-S® Nummer 340450283\nL Geschäftssitz An der Katharinenkirche 7\nL Postleitzahl 49074\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer \nPostfach Stadt \nL Telefon Nummer 054120239556\nFax Nummer \nName Hauptverantwortlicher \nW Tätigkeit (SIC) 8661\n\nUPIK® Datensatz - L\nL Name St.-Katharinen-Kirche\nNicht eingetragene Bezeichnung oder Unternehmensteil \nL D-U-N-S® Nummer 340644499\nL Geschäftssitz An der Katharinenkirche 8\nL Postleitzahl 49074\nL Postalische Stadt Osnabrück\nLand Germany\nW Länder-Code 276\nPostfachnummer \nPostfach Stadt \nL Telefon Nummer 054120239556\nFax Nummer \nName Hauptverantwortlicher \nW Tätigkeit (SIC) 8661\n \n"
		},
		{
			"post_id": 10,
			"title": "Spanien stellt sich gegen Energiekonzerne !",
			"date_published": 1539072670.9,
			"body": "\nFür eine klimafreundliche Energieerzeugung\n\nMuss man gewöhnlich auf den \"Rechtsweg\" jahrelang warten, so haben 2 kurzfristige Entscheidungen in der letzten Woche einiges bewegt.\n\n    Das OVG Münster hat das Rodungsvorhaben von RWE im Hambacher Forst für unbestimmte Zeit gestoppt. \n    Zur gleichen Zeit hat das VG Aachen das kurz zuvor von der Polizei erwirkte Demonstrationsverbot für das letzte Wochenende aufgehoben.\n\nGleich mit blamiert ist damit die Staatsgewalt in NRW, die sich vor den Karren des Konzerns spannen ließ und mit einem völlig unverhältnismäßigem Polizeieinsatz gegen ca. 200 Baumschützer ausrückte. Am Samstag kamen daraufhin Zehntausende in den kleinen Ort Buir. Die Veranstalter sprachen am Mittag auf ihrer mehrstündigen Kundgebung von 50.000 Teilnehmern.\n\nFür alle Umweltaktivisten wurde es ein Tag der Freude, während die RWE-Aktie um mehr als 8% absackte. Trotz dieser Entwicklung hat Brandenburgs SPD Ministerpräsident Woitke zum Wochenbeginn weiter von der \"Notwendigkeit der Braunkohleförderung in der Lausitz\" bis in die 40-iger Jahre\" gesprochen. Sein Unvermögen die Zeichen der Zeit zu verarbeiten, werden deutlich, wenn gleichzeitig Klimaschützer auf ihrer Konferenz in Seoul aufgrund der Klimaentwicklung das 2-Grad-Ziel durch ein 1,5 Grad-Ziel ersetzen müssen.\n\nAuch andere EU Staaten neben Deutschland haben da einiges nachzuholen. So gab es bis jetzt in Spanien eine Sonnensteuer, die nun von der neuen spanischen Regierung abgeschafft wurde. \"Schlussendlich wird Spanien von der großen Absurdität der Sonnensteuer befreit, mit dem sich das Land bei internationalen Experten lächerlich gemacht hat\", erklärte die zuständige Ministerin für den ökologischen Übergang Teresa Ribera.\n\nDie konservative PP-Regierung hatte im Interesse ihrer Energiekonzerne mit drakonischen Strafen den Eigenverbrauch von Solarstrom verhindert. Solarstromerzeuger haben hohe Abgaben zu zahlen und die Nichtanmeldung von privaten Solaranlagen wurde verfolgt. Nur damit ist die geringe Zahl von ca. 1000 Solaranlagen in Spanien im Vergleich zu einer Million in Deutschland zu verstehen.\n\nDas Sonnenland Spanien hatte sich damit auch gegen das Europaparlament gestellt, welches im Frühjahr jede Form einer Sonnensteuer verboten hatte. Das Parlament hatte beschlossen, dass auf die Produktion mittels Erneuerbarer Energiequellen (EE), der innerhalb der eigenen Räume verbraucht wird, keinerlei \"Steuern, Abgaben oder Gebühren jeglicher Art\" erhoben werden dürfen.\n\nAuch diese Entscheidung ist ein gewaltiger Schritt gegen die europäischen Energiekonzerne, die das Geschäft mit dem Strom in ihrer Hand behalten wollen, auch wenn ihnen die Produktion durch lokale Initiativen entgleitet. In Deutschland erfolgt dies durch ständig steigende \"Netzentgelte\" und die \"EEG-Abgabe\".\n\nMehr dazu bei https://www.heise.de/tp/features/Hambacher-Forst-Der-Wald-ist-wieder-besetzt-4182752.html\nund https://www.heise.de/tp/features/Spanien-schafft-absurde-Sonnensteuer-ab-4182929.html"
		},
		{
			"post_id": 9,
			"title": "Weg zur Rettung des freien Internets !",
			"date_published": 1539071979.2,
			"body": "WWW-Erfinder Tim Berners-Lee will das Internet retten\n\nNicht mehr \"wir suchen etwas im Internet\" sondern einige wenige Internetkonzerne bestimmen \"was wir zu suchen haben\" und liefern uns das Ergebnis, meist zusammen mit weiterer Werbung, die wir nicht bestellt haben. Unsere Daten, unsere Kommentare, unsere Bilder landen dabei \"in der Cloud\", irgendwo auf uns unbekannten Servern im Besitz uns unbekannter Firmen, die damit Milliarden verdienen.\n\nDas war nicht seine Absicht als er, Tim Berners-Lee, vor 30 Jahren das World Wide Web, bzw. seine Sprache HTML erfunden hat. \"Wie können wir selbst über unsere Daten bestimmen, statt sie großen Konzernen zu überlassen?\" war seine Frage als er sich in den letzten Jahren damit beschäftigt hat ein freies und faires Internet zu schaffen.\n\nDas Ergebnis seiner Arbeiten: es ist möglich den Konzernen das Internet wieder abzunehmen und vor allem die  eigenen Daten wieder selbst zu verwalten. Das benötigt auch keine neue Sprache - immer noch kann HTML dabei helfen. Im letzten Jahre ist er nun mit \"Solid\" an die Web-Öffentlichkeit getreten, einer Open-Source-Software, mit der das Web ganz neu organisiert werden kann. Kern-Elemente von Solid sind persönliche Daten-Lager, sogenannte PODs, die sich jeder schon jetzt gratis überall auf der Welt -also dezentral - anlegen kann. Nicht mehr auf den Servern von Google, Amazon und YouTube werden unsere Daten gespeichert, sondern mein Name, meine Adresse, aber auch alle Fotos, Videos, Fitnessdaten, Gesundheitsdaten, Adressbücher, Bestellhistorien, ja selbst Kommentare, die wir zu irgendwelchen Webseiten hinterlassen – alles das landet künftig in meinem privaten Pod.\nWie kann man da den Überblick behalten?\n\nJeder Datenschnipsel in meinem Pod, jedes Bild, jeder Kommentar, jedes Like besitzt künftig genau eine URL, eine eindeutige Adresse im Web - und die kenne nur ich selbst und nicht ein Internetkonzern verwaltet meine Daten und sagt mir nichts darüber. Jeder Nutzer kann selbst genau festlegen, welche App was aus seinem Pod lesen darf, beziehungsweise etwas reinschreiben darf. Viele Apps können dann, wenn sie denn dürfen, Daten aus allen möglichen Pods zusammensuchen, zusammenfügen und anzeigen. Die Knoten unseres neuen Webs sind also unsere Pods, nicht mehr die Server irgendwelcher Konzerne.\nKann man das schon ausprobieren?\n\nJa, Solid ist freie Software und es gibt eine Reihe von Pod-Anbietern. Man holt sich also die Software, sucht sich einen Pod, z.B. bei \"inrupt\", das ist eine Firma, die Tim Berners-Lee gegründet hat, um seine Solid-Technik voranzubringen. Jede/r kann auch selbst einen Pod im Netz aufmachen.\n\nUnd dann beginnt (noch) der Ärger. Alles ist noch neu, ungewohnt und auch unfertig. Tim Berners-Lee ist so früh an die Öffentlichkeit gegangen, um Entwickler für das Projekt zu begeistern, aber auch, um auf das Problem aufmerksam zu machen. Nun sind weltweit Software-Entwickler gefragt daraus etwas Ganzes zu bauen - schließlich hat das WWW auch mehrere Jahre gebraucht, um die Nutzer zu überzeugen.\n\nDie Frage ist, was die Konzerne tun werden. Sie werden sicher nicht Solid in ihre Umgebungen einbauen und sich die Kontrolle über unsere Daten nehmen lassen. Die Menschen müssen selbst aktiv werden und das nicht nur zu 2% sondern möglichst viele. Noch immer suchen in Deutschland 98% im Internet mit einer Google Suchmaschine obwohl viele Alternativen wie z.B. Startpage, Searx u.v.a. existieren.\n\nWie groß die Gefahren, auch für Leute, die angeblich \"nichts zu verbergen haben\" ist, zeigen die Berichte aus Indien und über Facebook (s.u.).\n\nMehr dazu bei https://www.deutsachlandfunkkultur.de/datenhoheit-den-nutzern-zurueckgeben-wie-www-erfinder-tim.1264.de.html?dram:article_id=429819\nund passend dazu https://www.deutschlandfunkkultur.de/internet-zensur-und-massenueberwachung-der-glaeserne-inder.1005.de.html?dram:article_id=418067\nund https://www.deutschlandfunkkultur.de/datenskandal-wie-investoren-bei-facebook-mitmischen.1008.de.html?dram:article_id=415344"
		},
		{
			"post_id": 8,
			"title": "Firmengericht in Osnabrück !",
			"date_published": 1539014040.7,
			"body": "UPIK® Datensatz - L\nL \tName \tLandgericht Osnabrück\n\tNicht eingetragene Bezeichnung oder Unternehmensteil \t\nL \tD-U-N-S® Nummer \t340167274\nL \tGeschäftssitz \tNeumarkt 2\nL \tPostleitzahl \t49074\nL \tPostalische Stadt \tOsnabrück\n\tLand \tGermany\nW \tLänder-Code \t276\n\tPostfachnummer \t\n\tPostfach Stadt \t\nL \tTelefon Nummer \t05413150\nW \tFax Nummer \t05413156129\nW \tName Hauptverantwortlicher \tAntonius Fahnemann\nW \tTätigkeit (SIC) \t921\n\nSchauen Sie mal wer in der Firma mitmacht !\n\nhttps://www.noz.de/lokales/osnabrueck/artikel/847647/osnabruecker-landgerichtspraesident-veen-uebernimmt#gallery&0&3&847647\n\nUnd es geht weiter mit dem hl. Antonius !\nhttps://bistum-osnabrueck.de/address/antonius-fahnemann/#zoom=15&lat=52.27991120000001&lng=8.047178799999983\n\n\n"
		},
		{
			"post_id": 7,
			"title": "Vor jeder Gerichtsverhandlung den Richter hoeflich bitten !",
			"date_published": 1538491386,
			"body": "Weiterhin folgt aus dem Fehlen der Staatlichkeit der \"BRD\", daß es im \"BRD\"-System logischerweise keine gesetzlichen Richter und keine Staatsgerichte gibt.\n\nSämtliche Gerichte im \"BRD\"-System sind deshalb \"BRD\"-Unterfirmen, beziehungsweise private Schiedsgerichte. Man könnte sie auch als Ausnahme- oder Sondergerichte, beziehungsweise als Standgerichte bezeichnen.\n\nDies haben die westlichen Besatzungsmächte bereits im Jahre 1950 ermöglicht, indem sie den §15 des Gerichtsverfassungsgesetzes aufgehoben haben, worin es hieß,\n\nZitat:\n\n\"Alle Gerichte sind Staatsgerichte.\"\n\n(Nebenbei bemerkt wird dieser Satz zu Verschleierungszwecken in Gesetzessammlungen der BRD-GmbH nicht mehr zitiert. Es wird lediglich noch erwähnt, daß der §15 \"weggefallen\" sei).\n\nDabei hat man allerdings einige gesetzliche Regelungen wohl \"vergessen\" aufzuheben, nämlich den Grundgesetzartikel 101, der immer noch heißt:\n\nZitat\n\n(1) \"Ausnahmegerichte sind unzulässig. Niemand darf seinem gesetzlichen Richter entzogen werden.\"\n\n(2) \"Gerichte für besondere Sachgebiete können nur durch Gesetz errichtet werden.\n\nNun können Sie einmal einem \"Richter\" im \"BRD\"-System das Angebot machen, daß Sie sich seinem Recht unterwerfen, sofern er Ihnen im Gegenzug schriftlich eidesstattlich oder besser mit Eid versichert, daß er der für Sie zuständige, gesetzliche, staatliche Richter ist. Sollte doch kein Problem sein, oder?\n\nEine solche eidesstattliche Versicherung wird Ihnen ein \"BRD\"-Richter im Leben nicht geben, weil er sich Ihnen damit rechtlich ausliefert, da ja die Abgabe einer falschen eidesstattlichen Versicherung, geschweige denn eines Eides, eine schwere Straftat darstellt, die selbst nach den allgemeinen Geschäftsbedingungen der Firma \"BRD\" mit Freiheitsstrafe nicht unter einem Jahr zu bestrafen ist.\n\nDa der \"BRD\"-Richter Ihnen diese eidesstattliche Versicherung nicht unterschreibt, können Sie ihn ablehnen. Das können Sie mit sämtlichen Richtern machen, und sofern die Bediensteten der Firma \"BRD\" sich an ihre eigenen Regeln halten, können Sie das durch alle Instanzen machen, und Sie sind hierdurch rechtlich praktisch nicht mehr greifbar.\n\nDa die \"Richter\" im \"BRD\"-System die Rechtslage kennen, wissen sie auch, daß sie wegen \"Täuschung im Rechtsverkehr\" haftbar zu machen sind, wenn sie sich als \"Richter\" bezeichnen. Aber auch wegen der von Ihnen ausgesprochenen Zwangsmaßnahmen sind sie persönlich haftbar zu machen, sofern sie diese im Zusammenhang mit dem Tatbestand \"Täuschung im Rechtsverkehr\" verfügen.\n\nAus diesem Grunde tragen seit 1990 keine Schriftstücke, welche \"BRD\"-\"Gerichte\" verlassen, eine richterliche Unterschrift, da die Richter als Juristen natürlich genau wissen, daß sie für ihr Tun rechtlich zur Verantwortung gezogen werden können.\n\nDamit sind die Haftbefehle, Beschlüsse und Urteile jedoch nur Entwürfe, beziehungsweise Scheindokumente, und selbst nach den Allgemeinen Geschäftsbedingungen der Firma \"BRD\" rechtsungültig.\n\nDie Rechtsungültigkeit dieser Papiere selbst nach \"BRD\"-Recht ergibt sich aus dem § 126 BGB und den §§315 und 317 der ZPO (für zivilrechtliche gerichtliche Dokumente), dem §275 StPO für Strafurteile und dem § 34 VwVfG (Verwaltungsverfahrensgesetz) für sonstige öffentliche Gerichtsurteile.\n\nDennoch werden die Inhalte dieser rechtsungültigen Schriftstücke von mutigen \"Gerichtsvollziehern\" und hierzu mißbrauchten \"BRD\"-\"Polizisten\" und \"Justizvollzugsangestellen\" gelegentlich noch durchgesetzt, womit sich diese Herrschaften vor richtigen Gerichten strafbar machen.\n\nEine weitere Kuriosität ist die Tatsache, daß in \"BRD\"-Gerichtsurteilen die \"Richter\" bezeichnet werden mit der Floskel \"Richter am Amtsgericht\". Hierbei handelt es sich jedoch lediglich um eine geographische Bezeichnung, weshalb steht nicht \"Richter des Amtsgerichtes\"? Weil es keine Amtsgerichte mit Richtern gibt!\n\nIn der Regel findet sich unter Gerichtsbeschlüssen auch die Angabe \"Mustermann, Max als Urkundsbeamter\". Die Formulierung „handelnd als“ besagt juristisch eindeutig, daß die- oder derjenige die Funktion nicht tatsächlich innehat. Dann müßte dort zwingend stehen, daß die- oder derjenige auch tatsächlich der Urkundsbeamte ist. Mustermann, Max spielt also offensichtlich nur einen Urkundsbeamten, er ist es jedoch nicht!!\n\nMan kann also auch in dieser Hinsicht nicht behaupten, daß man betrogen wird. Man muß nur genau lesen, und die deutsche Sprache erweist sich einmal mehr als sehr präzise!\n\nIn einer ähnlichen Weise ist die Floskel \"Im Namen des Volkes\" zu interpretieren. Früher hieß es \"Im Namen des Deutschen Volkes\" – hierdurch wurde klar gestellt, daß das Staatsvolk des Deutschen Reiches gemeint war.\n\nDa die \"BRD\" kein Staat ist und kein Staatsvolk hat, heißt es heute eben nur noch \"Im Namen des Volkes\". Kein Mensch kann nun sagen, um welches Volk es sich dabei handeln soll, um das chinesische, das portugiesische, oder gar um ein Bienenvolk in den Anden, wer soll das wissen??\n\nDarüber hinaus gibt es im Rechtssystem der Firma \"BRD\" eine weitere Kuriosität:\n\nIn vielen \"Gerichts\"-\"Verfahren\" wird nämlich ein Anwaltszwang postuliert.\n\nDies ist jedoch absolut unstatthaft, insbesondere nach der Allgemeinen Erklärung der Menschenrechte Artikel 6:\n\nZitat\n\n\"Jeder hat das Recht, überall als rechtsfähig anerkannt zu werden.\"\n\nDiese Aussage ist in Verbindung mit dem Artikel 25 des Grundgesetzes zu interpretieren in dem es heißt:\n\nZitat\n\nArtikel 25 \"GG\":\n\n\"Die allgemeinen Regeln des Völkerrechtes sind Bestandteil des Bundesrechts. Sie gehen den Gesetzen vor und erzeugen Rechte und Pflichten unmittelbar für die Bewohner des Bundesgebiets.\"\n\nDer durch die \"BRD\"-Justitz behauptete Anwaltszwang ist ein direkter Verstoß gegen Art. 6 der Allgemeinen Erklärung der Menschenrechte von 1948. Die BRD aber hat für die Menschenrechte und deren Einhaltung unterschrieben.\n\nMan kann es nicht oft genug wiederholen:\n\n\"BRD\"-Gerichtsurteile sind selbst nach den Allgemeinen Geschäftsbedingungen der Firma \"BRD\" rechtsungültig !!\n\nNicht ohne Grund liegen beim Internationalen Strafgerichtshof in Den Haag 170.000  Strafanträge gegen Bedienstete der \"BRD\"-GmbH vor (Stand 06/12).\n\nGegenwärtig bestehen 9 Aktenzeichen beim IStGH gegen Bedienstete des \"BRD\"-Systems (Stand 06/12). Die meisten der dort vorliegenden Strafanträge werden gegenwärtig nicht bearbeitet, sie werden inhaltlich den bereits bestehenden Aktenzeichen zugeordnet, bis eine Grundsatzentscheidung in den neun Fällen getroffen ist.\n\nHierzu muß man wissen, daß ein Aktenzeichen dort erst vergeben wird, wenn ein Chefankläger den Strafantrag geprüft, und einem Gremium aus drei Richtern vorgelegt hat.\n\nErst wenn alle genannten Beteiligten eine rechtliche Verfolgung für erforderlich halten, und anerkennen, daß die gültige Rechtslage eine Strafverfolgung verlangt, wird beim IStGH in Den Haag ein Aktenzeichen überhaupt erst vergeben.\n\nDie Existenz dieser neun Aktenzeichen belegt, daß die Richter beim IStGH die Rechtslage offenbar genau so beurteilen wie der Verfasser dieser Abhandlung.\n\nZum Abschluss\n\nDer Europäische Gerichtshof für Menschenrechte (EGMR) hat im Urteil EGMR 75529/01 am 08.06.2006 die Menschenrechtsverletzungen nach Art. 6 und 13 der Menschenrechtskonvention in der BRD festgestellt.\n\nDieses Urteil des EGMR Art. 36 Menschenrechtskonvention besagt im Tenor, daß ein wirksames Rechtsmittel gegen Rechtsmißbrauch und Billigkeitsrecht für die Einhaltung des Rechtes auf ein rechtsstaatliches Verfahren in der BRD nicht gegeben ist.\n\nDie Bundesrepublik Deutschland hat zugegeben, daß Staatsaufbaumängel vorliegen.\n\nZum Thema Menschenrechte äußerte sich der ehemalige Botschafter Singapurs und brillanter Intellektueller Asiens, Professor Kishore Mahbubani im Spiegel 21/2008 Seite 62 wie folgt:\n\n\"die BRD - nicht Deutschland - hat all ihre moralische Glaubwürdigkeit verloren und sollte andere nicht über Menschenrechte belehren.\"\n\nIn weiteren Ausführungen konnte der ansonsten im diplomatischen Umgang geübte Politiker dann nicht einmal mehr an sich halten und äußerte sich aufgebracht:\n\n\"BRD-ler, wenn es um Menschenrechte geht, dann müsst ihr das Maul halten!\"\n\nDies wollen wir unkommentiert so stehen lassen.\n\nAbschließend ist jedoch noch anzumerken, daß in einem künftigen Rechtsstaat auch Gerichte, Richter, Staatsanwälte und sonstige Mitarbeiter des Justizwesens selbstverständlich gebraucht werden. Diese Menschen leisten bereits heute eine wichtige Arbeit, weshalb es völlig falsch wäre, auf diese Menschen mit dem Finger zu weisen oder irgendwelche Schuldzuweisungen zu machen. Diese Menschen werden nur oft genug mißbraucht. Es zeigt, wie verantwortungslos die \"BRD\"-Oberen auch mit den Menschen dieser Berufsgruppen umgehen, indem sie diese Menschen ohne die vorherige Schaffung der nötigen Rechtsgrundlagen auf die Menschheit loslassen."
		},
		{
			"post_id": 6,
			"title": "Der Pranger ist hier !  Nehmen Sie das Handbuch der Justiz und ermitteln Richter ohne jegliche Legitimation !",
			"date_published": 1538947659.7,
			"body": "Hier entsteht eine Adressliste von Personen die gegen jegliches Recht verstossen. Dazu gehören alle Firmenrichter ! Alle !\n\nAls ersten Hinweis um die Täter einer verbrechersichen Justiz mit Namen zu nennen dient das Hanbuch der Justiz. Hierin werden die sogenannten Richter mit vollem Namen  vor und Familiennamen benannt . Ebenfalls Ihr Geburtsdatum und weitere Informationen.\n\nSo ist es möglich die Richter persönlich zu ermitteln !\nEs gibt verschiedene Quellen es sich aus dem Internet kostenlos als pdf herunterzuladen. \n\nHier ist das Original ! https://www.amazon.de/Handbuch-Justiz-2018-2019-rechtsprechenden/dp/3811407260?tag=duc03-21"
		},
		{
			"post_id": 5,
			"title": "Nichts gilt mehr. Missbrauch in der Kirche jetzt ist Bode Schwulenbischof !",
			"date_published": 1538946980,
			"body": "Um die NWO gegen die Menschen durchzusetzen wird Bode zum Schwulenbischof. Hier passt nichts mehr. Garnichts !\n\nLesen sie selber was seine Zeitung die NOZ schreibt ! Es ist schlimmer als alles was denkbar war.\n http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/\n"
		},
		{
			"post_id": 4,
			"title": "Freiheit statt Angst ! Bekämpfen wir die Firma BRD die das Recht beseitigt !",
			"date_published": 1538917959.5,
			"body": "\nFreiheit statt Angst – Stoppt die Polizeigesetze!\nam 13. Oktober 2018 in Berlin !\n\nDatum: Samstag, 13. Oktober 2018\nAuftakt: 12 Uhr | Demozug ab 13 Uhr\nOrt: Alexanderplatz, Berlin\n\nAuf die Straße – mit #unteilbar – für Freiheit und Rechtsstaat! Gegen Wahrscheinlichkeitsjustiz, Prognosepolizei, Politik der Angst und die Verschärfung der Polizeigesetze.\n\nFast alle Landesregierungen rüsten Polizei und Geheimdienste auf, obwohl die Kriminalität auf einem Tiefpunkt seit Jahrzehnten ist. Überwachung und Repression machen uns nicht sicherer, sie bringen Demokratie und Freiheit in Gefahr.\nWir wollen den Protest – auch vor dem Hintergrund eines möglichen Musterpolizeigesetzes – bündeln und nach Berlin tragen. Und zwar im Schulterschluss mit der Demo #unteilbar!\n\nWir fordern:\n\n    Überwachung stoppen! Vorratsdatenspeicherung stoppen!\n    Kein hackender Staat – Staatstrojaner stoppen!\n    Unschuldsvermutung und Rechtsstaat schützen!\n\nPolizei und Geheimdienste werden aufgerüstet – trotz sinkender Kriminalität. SPD, CDU/CSU und Mitregierende beschwören eine ständige Gefährdungslage herauf, um die Exekutive mit Waffen, Überwachungstechnik und repressiven Kompetenzen hochzurüsten. Innenminister Seehofer hat ein bundesweites Musterpolizeigesetz angekündigt.\nZentral ist die Verlagerung von Polizeiarbeit in das Vorfeld von Alltagskriminalität. Diese Aufrüstung und ihre diffusen Rechtsbegriffe untergraben jedes Vertrauen in Recht und Sicherheit.\n\nWir wollen keinen Verdächtigungsstaat, keine Prognosejustiz und keine Überwachungspolizei! Unter den Maßnahmen sind unter anderem:\n\nder Begriff der „drohenden Gefahr“ – rechtfertigt nahezu jede Maßnahme Aufenthalts- und Kontaktverbote Staatstrojaner\n\nWir bilden einen Block auf der Demo am 13. Oktober: „Freiheit statt Angst – Stoppt die Polizeigesetze“\nUnser Block ist politisch unabhängig und überparteilich.\nJetzt anschließen: demo@digitalcourage.de!\n\nWerde aktiv:\nsag es weiter und komm am 13. Oktober mit Freunden, Kolleginnen und Bekannten nach Berlin verteile Infomaterial und hilf so bei der Mobilisierung unterstütze den Demo-Block mit einer Spende\nunterstütze dein lokales Bündnis gegen die Anpassung der Polizeigesetze\n\n\nTwitter: @akvorrat\n"
		},
		{
			"post_id": 3,
			"title": "Liste von 90 Gesetzen die die BRD aus der Gesetzbung Adolf Hitlers benutzt !",
			"date_published": 1538847688.8,
			"body": "Wir danken AG Mensch Wuertemberg fuer seine Arbeit !\nhttp://www.agmiw.org/wp-content/uploads/2016/05/NS-Gesetzgebung.pdf"
		},
		{
			"post_id": 2,
			"title": "Gehen Sie zu den Personen und greifen Sie die Argumente auf !",
			"date_published": 1538833578.5,
			"body": ""
		},
		{
			"post_id": 1,
			"title": "Rechtsbankrott !",
			"date_published": 1433033779.604,
			"body": "Aktiv werden zur Herstellung von staatlichem Recht !\nHarte Bestrafung bei Hochverrat !\n\nDie BRD ist Rechtsbankrott !\n\nRechtsbankrott ist das Unvermögen einer Rechtsordnung, den Rechtsunterworfenen Recht zu verschaffen. Eine Einrichtung, insbesondere eine Rechtseinrichtung offenbart beispielsweise Rechtsbankrott, wenn sie Lügner an die Spitze gelangen lässt, Schmierer zu Schriftführern macht, Betrüger zu Kassieren, Fälscher zu Protokollanten, Hochstapler zu Beisitzern und Erpresser zur Rechtsaufsicht. Eine Besserung verspricht unter solchen Umständen allein die vollständige Rückkehr zu allgemein anerkannten Werten (z. B. Wahrheit, Freiheit) und Rechtsgrundsätzen (z. B. pacta sunt servanda, Willkürverbot, Wettbewerb usw.).\n\n\nArt. 146 GG\nDieses Grundgesetz, das nach Vollendung der Einheit und Freiheit Deutschlands für das gesamte deutsche Volk gilt, verliert seine Gültigkeit an dem Tage, an dem eine Verfassung in Kraft tritt, die von dem deutschen Volke in freier Entscheidung beschlossen worden ist.\n\nDiese Norm zeigt das es sich bei einem Grundgesetz um keine Verfassung handelt , sondern um eine Regelung fuer ein durch Besatzung belastetes Gebiet. Es braucht keine Auslegung da es durch eine Verfassung abzuloesen ist !"
		}
	],
	"tag": [
		{
			"value": "http://www.spiegel.de/wirtschaft/unternehmen/google-einspruch-gegen-milliardenstrafe-von-eu-kommission-a-1232411.html",
			"post_id": 18
		},
		{
			"value": "2015",
			"post_id": 23
		},
		{
			"value": "\nKI",
			"post_id": 23
		},
		{
			"value": "diskriminiert",
			"post_id": 23
		},
		{
			"value": "auf",
			"post_id": 23
		},
		{
			"value": "Grund",
			"post_id": 23
		},
		{
			"value": "des",
			"post_id": 23
		},
		{
			"value": "Geschlechts\n\nAmazon",
			"post_id": 23
		},
		{
			"value": "wollte",
			"post_id": 23
		},
		{
			"value": "sich",
			"post_id": 23
		},
		{
			"value": "die",
			"post_id": 23
		},
		{
			"value": "Arbeit",
			"post_id": 23
		},
		{
			"value": "leichter",
			"post_id": 23
		},
		{
			"value": "machen,",
			"post_id": 23
		},
		{
			"value": "ein",
			"post_id": 23
		},
		{
			"value": "Wunsch,",
			"post_id": 23
		},
		{
			"value": "der",
			"post_id": 23
		},
		{
			"value": "schon",
			"post_id": 23
		},
		{
			"value": "den",
			"post_id": 23
		},
		{
			"value": "Zauberlehrling",
			"post_id": 23
		},
		{
			"value": "im",
			"post_id": 23
		},
		{
			"value": "Faust",
			"post_id": 23
		},
		{
			"value": "an",
			"post_id": 23
		},
		{
			"value": "Rand",
			"post_id": 23
		},
		{
			"value": "Verzweiflung",
			"post_id": 23
		},
		{
			"value": "gebracht",
			"post_id": 23
		},
		{
			"value": "hat.",
			"post_id": 23
		},
		{
			"value": "Mit",
			"post_id": 23
		},
		{
			"value": "einem",
			"post_id": 23
		},
		{
			"value": "selbst",
			"post_id": 23
		},
		{
			"value": "entwickelten",
			"post_id": 23
		},
		{
			"value": "Machine-Learning-gestütztem",
			"post_id": 23
		},
		{
			"value": "Tool",
			"post_id": 23
		},
		{
			"value": "sollten",
			"post_id": 23
		},
		{
			"value": "eingehenden",
			"post_id": 23
		},
		{
			"value": "Bewerbungen",
			"post_id": 23
		},
		{
			"value": "vorsortiert",
			"post_id": 23
		},
		{
			"value": "werden.",
			"post_id": 23
		},
		{
			"value": "Nur",
			"post_id": 23
		},
		{
			"value": "noch",
			"post_id": 23
		},
		{
			"value": "in",
			"post_id": 23
		},
		{
			"value": "Auswahl",
			"post_id": 23
		},
		{
			"value": "Tools",
			"post_id": 23
		},
		{
			"value": "hervorstechenden",
			"post_id": 23
		},
		{
			"value": "BewerberInnen",
			"post_id": 23
		},
		{
			"value": "eingeladen",
			"post_id": 23
		},
		{
			"value": "werden.\n\nMan",
			"post_id": 23
		},
		{
			"value": "bemerkte",
			"post_id": 23
		},
		{
			"value": "jedoch",
			"post_id": 23
		},
		{
			"value": "sehr",
			"post_id": 23
		},
		{
			"value": "schnell",
			"post_id": 23
		},
		{
			"value": "Problem:",
			"post_id": 23
		},
		{
			"value": "Der",
			"post_id": 23
		},
		{
			"value": "Algorithmus",
			"post_id": 23
		},
		{
			"value": "hatte",
			"post_id": 23
		},
		{
			"value": "sexistische",
			"post_id": 23
		},
		{
			"value": "Tendenzen",
			"post_id": 23
		},
		{
			"value": "und",
			"post_id": 23
		},
		{
			"value": "bewertete",
			"post_id": 23
		},
		{
			"value": "Männer",
			"post_id": 23
		},
		{
			"value": "grundsätzlich",
			"post_id": 23
		},
		{
			"value": "mit",
			"post_id": 23
		},
		{
			"value": "einer",
			"post_id": 23
		},
		{
			"value": "höheren",
			"post_id": 23
		},
		{
			"value": "Punktzahl",
			"post_id": 23
		},
		{
			"value": "als",
			"post_id": 23
		},
		{
			"value": "Frauen.",
			"post_id": 23
		},
		{
			"value": "Diese",
			"post_id": 23
		},
		{
			"value": "Haltung",
			"post_id": 23
		},
		{
			"value": "\"Künstliche",
			"post_id": 23
		},
		{
			"value": "Intelligenz\"",
			"post_id": 23
		},
		{
			"value": "beigebracht.\n\nDas",
			"post_id": 23
		},
		{
			"value": "Attribut",
			"post_id": 23
		},
		{
			"value": "Frau",
			"post_id": 23
		},
		{
			"value": "wurde",
			"post_id": 23
		},
		{
			"value": "scheinbar",
			"post_id": 23
		},
		{
			"value": "vom",
			"post_id": 23
		},
		{
			"value": "Programm",
			"post_id": 23
		},
		{
			"value": "schlecht",
			"post_id": 23
		},
		{
			"value": "bewertet",
			"post_id": 23
		},
		{
			"value": "floss",
			"post_id": 23
		},
		{
			"value": "negativ",
			"post_id": 23
		},
		{
			"value": "Endwertung",
			"post_id": 23
		},
		{
			"value": "ein.",
			"post_id": 23
		},
		{
			"value": "Die",
			"post_id": 23
		},
		{
			"value": "Entwickler",
			"post_id": 23
		},
		{
			"value": "hatten",
			"post_id": 23
		},
		{
			"value": "dieses",
			"post_id": 23
		},
		{
			"value": "Verhalten",
			"post_id": 23
		},
		{
			"value": "festgestellt.",
			"post_id": 23
		},
		{
			"value": "Sie",
			"post_id": 23
		},
		{
			"value": "änderten",
			"post_id": 23
		},
		{
			"value": "daraufhin",
			"post_id": 23
		},
		{
			"value": "das",
			"post_id": 23
		},
		{
			"value": "so,",
			"post_id": 23
		},
		{
			"value": "dass",
			"post_id": 23
		},
		{
			"value": "ihrer",
			"post_id": 23
		},
		{
			"value": "Meinung",
			"post_id": 23
		},
		{
			"value": "nach",
			"post_id": 23
		},
		{
			"value": "Wort",
			"post_id": 23
		},
		{
			"value": "neutral",
			"post_id": 23
		},
		{
			"value": "angesehen",
			"post_id": 23
		},
		{
			"value": "wurde.",
			"post_id": 23
		},
		{
			"value": "Wie",
			"post_id": 23
		},
		{
			"value": "nun",
			"post_id": 23
		},
		{
			"value": "heraus",
			"post_id": 23
		},
		{
			"value": "stellte",
			"post_id": 23
		},
		{
			"value": "war",
			"post_id": 23
		},
		{
			"value": "keine",
			"post_id": 23
		},
		{
			"value": "ausreichende",
			"post_id": 23
		},
		{
			"value": "Lösung.\n\nNicht",
			"post_id": 23
		},
		{
			"value": "nur",
			"post_id": 23
		},
		{
			"value": "Amazon",
			"post_id": 23
		},
		{
			"value": "kämpft",
			"post_id": 23
		},
		{
			"value": "dem",
			"post_id": 23
		},
		{
			"value": "Problem",
			"post_id": 23
		},
		{
			"value": "ungerechter",
			"post_id": 23
		},
		{
			"value": "KI-Systeme.",
			"post_id": 23
		},
		{
			"value": "Eine",
			"post_id": 23
		},
		{
			"value": "Forscherin",
			"post_id": 23
		},
		{
			"value": "am",
			"post_id": 23
		},
		{
			"value": "Massachussetts",
			"post_id": 23
		},
		{
			"value": "Institute",
			"post_id": 23
		},
		{
			"value": "of",
			"post_id": 23
		},
		{
			"value": "Technology",
			"post_id": 23
		},
		{
			"value": "(MIT)",
			"post_id": 23
		},
		{
			"value": "hat",
			"post_id": 23
		},
		{
			"value": "etwa",
			"post_id": 23
		},
		{
			"value": "herausgefunden,",
			"post_id": 23
		},
		{
			"value": "Bilderkennungssysteme",
			"post_id": 23
		},
		{
			"value": "von",
			"post_id": 23
		},
		{
			"value": "IBM",
			"post_id": 23
		},
		{
			"value": "Microsoft",
			"post_id": 23
		},
		{
			"value": "unfair",
			"post_id": 23
		},
		{
			"value": "bewerten.",
			"post_id": 23
		},
		{
			"value": "So",
			"post_id": 23
		},
		{
			"value": "sind",
			"post_id": 23
		},
		{
			"value": "weiße",
			"post_id": 23
		},
		{
			"value": "hervorragende",
			"post_id": 23
		},
		{
			"value": "Kandidaten",
			"post_id": 23
		},
		{
			"value": "für",
			"post_id": 23
		},
		{
			"value": "KI-System,",
			"post_id": 23
		},
		{
			"value": "bei",
			"post_id": 23
		},
		{
			"value": "schwarzen",
			"post_id": 23
		},
		{
			"value": "Frauen",
			"post_id": 23
		},
		{
			"value": "ist",
			"post_id": 23
		},
		{
			"value": "Fehlerquote",
			"post_id": 23
		},
		{
			"value": "ungleich",
			"post_id": 23
		},
		{
			"value": "höher.\n\nMmh,",
			"post_id": 23
		},
		{
			"value": "davon",
			"post_id": 23
		},
		{
			"value": "Heimatminister",
			"post_id": 23
		},
		{
			"value": "Seehofer",
			"post_id": 23
		},
		{
			"value": "wohl",
			"post_id": 23
		},
		{
			"value": "nchts",
			"post_id": 23
		},
		{
			"value": "gehört,",
			"post_id": 23
		},
		{
			"value": "gerade",
			"post_id": 23
		},
		{
			"value": "sein",
			"post_id": 23
		},
		{
			"value": "Gesichtserkennungssystem",
			"post_id": 23
		},
		{
			"value": "20%",
			"post_id": 23
		},
		{
			"value": "Fehlerrate",
			"post_id": 23
		},
		{
			"value": "\"durchschlagenden",
			"post_id": 23
		},
		{
			"value": "Erfolg\"",
			"post_id": 23
		},
		{
			"value": "bezeichnet.",
			"post_id": 23
		},
		{
			"value": "Dabei",
			"post_id": 23
		},
		{
			"value": "waren",
			"post_id": 23
		},
		{
			"value": "seine",
			"post_id": 23
		},
		{
			"value": "Testpersonen",
			"post_id": 23
		},
		{
			"value": "auch",
			"post_id": 23
		},
		{
			"value": "fast",
			"post_id": 23
		},
		{
			"value": "alle",
			"post_id": 23
		},
		{
			"value": "weiß",
			"post_id": 23
		},
		{
			"value": "...\n\nMehr",
			"post_id": 23
		},
		{
			"value": "dazu",
			"post_id": 23
		},
		{
			"value": "https://www.golem.de/news/machine-learning-amazon-verwirft-sexistisches-ki-tool-fuer-bewerber-1810-137060.html\nund",
			"post_id": 23
		},
		{
			"value": "https://www.golem.de/news/maschinelles-lernen-gesichtserkennung-ist-zuverlaessig-bei-weissen-maennern-1802-132709.html\n\nKategorie[21]:",
			"post_id": 23
		},
		{
			"value": "Unsere",
			"post_id": 23
		},
		{
			"value": "Themen",
			"post_id": 23
		},
		{
			"value": "Presse",
			"post_id": 23
		},
		{
			"value": "Short-Link",
			"post_id": 23
		},
		{
			"value": "dieser",
			"post_id": 23
		},
		{
			"value": "Seite:",
			"post_id": 23
		},
		{
			"value": "a-fsa.de/d/2XX\nLink",
			"post_id": 23
		},
		{
			"value": "zu",
			"post_id": 23
		},
		{
			"value": "https://www.aktion-freiheitstattangst.org/de/articles/6652-20181015-der-roboter-ist-maennlich.htm\nLink",
			"post_id": 23
		},
		{
			"value": "Tor-Netzwerk:",
			"post_id": 23
		},
		{
			"value": "nnksciarbrfsg3ud.onion/de/articles/6652-20181015-der-roboter-ist-maennlich.htm\nTags:",
			"post_id": 23
		},
		{
			"value": "#männlich",
			"post_id": 23
		},
		{
			"value": "#weiblich",
			"post_id": 23
		},
		{
			"value": "#Roboter",
			"post_id": 23
		},
		{
			"value": "#KI",
			"post_id": 23
		},
		{
			"value": "#AI",
			"post_id": 23
		},
		{
			"value": "#Gleichberechtigung",
			"post_id": 23
		},
		{
			"value": "#Gender",
			"post_id": 23
		},
		{
			"value": "#Diskriminierung",
			"post_id": 23
		},
		{
			"value": "#Ungleichbehandlung",
			"post_id": 23
		},
		{
			"value": "#Gewerkschaft",
			"post_id": 23
		},
		{
			"value": "#Mitbestimmung",
			"post_id": 23
		},
		{
			"value": "#Koalitionsfreiheit",
			"post_id": 23
		},
		{
			"value": "#Gesichtserkennung",
			"post_id": 23
		},
		{
			"value": "#Bewerberauswahl\nErstellt:",
			"post_id": 23
		},
		{
			"value": "2018-10-15",
			"post_id": 23
		},
		{
			"value": "09:01:18",
			"post_id": 23
		}
	]
}