{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Обход блокировок в России и КНР",
			"body": "Какие средства лучше заготовить на случай введения в России цензуры aka Китай? А вдруг КНДР? Что лучше использовать для гарантированной связи с внешним миром (можно не только через Интернет)?",
			"added": 1524327574
		}
	],
	"topic_vote": {
		"1_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY": 1,
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 1,
				"body": "Я не разу не встретил сайт в ZeroNet, которому понадобилось использовать куки. Всё держится на сертификатах",
				"added": 1524326752
			}
		],
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 2,
				"body": "Python, Java (любимый) и (внимание!) free object pascal! Раньше на pascal когда-то даже ОС писали, сейчас почти не используется, но полезен, когда нужен \"скомпилированный\" файл aka .exe, а не установка интерпретатора на каждую машину",
				"added": 1524326948
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 3,
				"body": "+1",
				"added": 1524327008
			}
		],
		"4_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb": [
			{
				"comment_id": 4,
				"body": "> [sangokas](#comment_7_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb): Но Меня же не посадят за такое?\n\nРаз ты не в России, то нет :)",
				"added": 1524327113
			}
		],
		"1_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY": [
			{
				"comment_id": 5,
				"body": "> [hikikomori](#comment_12_1FLQiXhoa56vb91aiVxyAiC8L5YJy4W3Hi): VPN, shadowproxy, Tor (с бриджами), всё это работает в Китае. В КНДР Интернета нет, там большая локальная сеть.\n\nКитай объявил войну VPN (в том числе и частным), там необходимо получать спец.разрешение на использования, за нарушения может грозить тюрьма. У tor тоже проблема - он централизован, бриджи можно выявлять",
				"added": 1524329026
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_335_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): ZeroNet :) VPN ему не нужен. Опционально — RetroShare и SSB Patchwork.\n> \n> Тогда всё равно ZeroNet, но общение будет только внутри страны :)\n\nНеужели ZeroNet не возможно заблокировать? Каким образом он находит первых пиров? В i2p для этого есть встроенный список, т.е. адреса для первого старта, и если их заблокировать, то подключиться не получиться. А каким образом ZeroNet находит первых узлов?",
				"added": 1524330469
			},
			{
				"comment_id": 7,
				"body": "А каким образом ZeroNet тогда сможет работать в \"локальной\" сети (КНДР), каким образом можно обнаружить других клиентов без центрального сервера?",
				"added": 1524337716
			}
		],
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 8,
				"body": "FidoNet не пытались контролировать, вспомните обстрел Белого дома: телецентр захватили, а на \"университетскую\" сеть плевали",
				"added": 1524337977
			}
		]
	},
	"comment_vote": {}
}