{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1606985120,
			"title": "Why are you here?",
			"body": "Why are you reading this message here on Zeronet? Why aren't you browsing and I2P eepsite or a TOR onion site? Or a <insert-random-network-here>?\n\nI'm digging this test run of Zeronet that I'm participating in but hate that I have to have JS enabled to use this thing as intended.",
			"added": 1606985119
		},
		{
			"topic_id": 1607561475,
			"title": "I created a reddit-like site that bridges I2P, Tor and Yggdrasil to allow users to interact with one another without leaving their network of choice.",
			"body": "I'd integrate it with ZeroNet, if that were a realistic option.\n\nSo, I wanted a reddit-like site that was:\n\n* Lightweight / fast\n* Privacy focused\n* Not heavy on censorship\n* And integrated with \"alternative internets\" (Tor, I2P, Yggdrasil for now)\n\nThis website is accessible as a service on each of the individual large anonymity networks allowing users of those networks to not leave their network of choice. Whereas normally, members on a Tor Onion Service web forum would only be able to communicate with other members using that same Tor Onion Service (typically), on here, they can interact with members using the website via the I2P eepsite, or the regular internet, even. It's a unique idea and we're excited to see how it plays out.\n\nOriginally I wasn't going to have a clearnet version, but decided that bridging everyone into one place may serve valuable in getting regular, everyday people more interested in online privacy and help make them supporters of these various alternative networks.\n\nAnyway, it has just literally launched. I've just finished populating some default content on some 'featured forums' (defaults) but it's now open and anyone can register, sign up, and create their own content or forum for their liking.\n\nYou can access the website via the following networks / urls:\n\n* The clearnet: https://ramble.pw \n* I2P: http://smv3cryi3n7d5ll7xpvlhstubi5yj4dadeltyrdwdr4onwd2jvvq.b32.i2p (Until ramble.i2p starts resolving network wide)\n* TOR: http://rambleeeqrhty6s5jgefdfdtc6tfgg4jj6svr4jpgk4wjtg3qshwbaad.onion/ (If you use the clearnet site on Tor, you'll be notified of this Onion Service or switched automatically depending on your browser settings)\n* Yggdrasil: http://[200:718d:c499:3fce:c5e:65c6:73d6:f46d]/\n\nThere is also a ZeroNet community on [RAMBLE] here: https://ramble.pw/f/zeronet but it's empty, of course.\n\nI'm working on a wiki with more details here: https://ramble.pw/wiki and have a welcome post made in the [RAMBLE] meta forum here: https://ramble.pw/f/ramble/3/welcome-to-ramble.",
			"added": 1607561472
		},
		{
			"topic_id": 1607823667,
			"title": "How to install a ZeroNet instance on a remote VPS, enable Tor traffic routing and access it for local browsing using a SSH tunnel.",
			"body": "So the little blurb on the github page about connecting to a remote VPS is fine if you have a static IP but I use a SSH tunnel a lot for I2P so thought I'd write a quick guide on installing ZeroNet on a VPS and connecting to it via an SSH tunnel. I posted it on /r/zeronet on reddit but it was autoremoved or something. Anyway: \n\nhttps://ramble.pw/f/zeronet/230/how-to-install-a-zeronet-instance-on-a-remote-vps-enable-tor",
			"added": 1607823663
		}
	],
	"topic_vote": {
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1607170877_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1607558436_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1607823667_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1608645993_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"1609017796_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1
	},
	"next_comment_id": 29,
	"comment": {
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 1,
				"body": "While I disagree with the OP, I respect his/her right to say it.\n\nWith that said, \"All Lives Matter\".\n\nGo cry on reddit.",
				"added": 1606983737
			}
		],
		"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 2,
				"body": "It's something I've been trying to get my family more involved in, to take privacy more serious. The final straw for me came within the last few months. I've always been relatively privacy minded, even with some use of popular services like Facebook. I'm not even sure what the final straw was, but one day I just requested my data, and de-activated my account. I then to start moving away from GMail, though all my email for the last ten years has been to an @my-domain address and Gmail hosted those for free. So I need to find an affordable alternative so I can continue to use my same domain/email that some people have known for ages, but host it on a different platform. I've looked at things like ProtonMail, which I also use (with their own domain).\n\nLately I've been spending more time on I2P and Tor (onion) sites. I've actually been getting some news via shortwave radio, mainly because it's fun, but also because I haven't had a TV in like ten years. I'd like to have a day in the not so distant future where I could satisfy most my technological cravings via the 'darknet'. But I guess that would require a couple things:\n\n1.) An independent and non-biased source of news, updated frequently, available via I2P, TOR, ZeroNet, Freenet, etc.\n2.) Perhaps some search indexer that can index the -content- of clearnet sites, and serve the content over the darknet. This would come especially handy when I'm staring at some god damned error in a terminal and can't figure out the solution when doing sys-admin stuff. I hate to admit but even though duckduckgo is my first search engine, Google is often used since I can copy paste some obscure error in quotations in usually find the answer rather quickly. Bring that level of convenience to the darkweb.\n3.) Social media. I've gotten rid of my social media namely due to privacy concerns but at the end of the day I really just don't care what other people are doing. But social media is still something many crave and it'd have to be brought over to this side of things without invading privacy or sending you some retarded fucking notifcation because it 'knows' you just put your phone down and it wants to tell you that Sarah uploaded a new photo. Fuck that.\n4.) Can't be an echo chamber. I wish there was better representation of all the political spectrums on these platforms. I'm definitely right of center, but lean pretty left of center on some issues too. A lot of these platforms seem like right wing echo chambers in the same way that reddit is a left wing shit hole. Gotta have both sides.\n5.) Etc.",
				"added": 1606984909
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 3,
				"body": "> [geck4bee](#comment_1_1JRReFAonxccQRM3AbrGFEEc2VqckGzo56): I'm here because the coverage of the presidential election has revealed the censorship of  major SNS.As far as I know, Zeronet is the most useful decentralized network right now.\n\nI understand that. Seeing how 'wrong think' was labeled, hidden or 'needed more context' to skew the view really opened my eyes.\n\n> [anonynous38883](#comment_25_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): hey , why because we don't know how to Host a i2p Website securely inside whonix. we have already a zeronet site and a tor site. [...]\n\nI actually run a clearnet site that is mirrored both on the I2P and the Tor network, but it's hosted on a VPS. I run the I2P router on a different VPS than my site, so I just create an http tunnel to it in the tunnel manager, add the IP and the port in question.",
				"added": 1606995397
			},
			{
				"comment_id": 6,
				"body": "> [sqmnf3ixy2lgfpz7](#comment_1_19ZkyYnsyNaf8RoMf7ZCJWTD6zEqHnTKjq): Really disappointed with I2P. I want to like it - but it's so slow. Zeronet is very fast most of the time. [...]\n\nInterestingly enough, I discovered ZeroNet **through** I2P, as there is an I2P -> ZeroNet bridge.\n\nI find the I2P network speeds to be okay enough for me but I don't use it for much outside of lurking IRC. I don't use the outproxy on I2P because they're just relaying traffic over the TOR network and I can do that myself.\n\nI'm pushing over 1TB/mo from my I2P server as a means to help the network (It's a 10Gbps server but I do have a data cap on transfer I have to respect for now) so obviously people are using it. Right now 2,250 active peers on I2P.\n\nIf I2P had some ZeroNet's modern design and they were able to integrate the networks we'd have a real winner. A part of me wishes these great minds with these wonderful visions worked together and found common ground and met in the middle in some areas of their vision to create a truly P2P, secure, anonymous network that can not be disrupted and then sourced a bunch of legitimate content to be pushed on it. I really don't care about file sharing and torrents, porn and drugs and stuff. That's what is commonly associated with networks like these. It's a shame. Imagine just having a web forum with 1,000 moderately active users. Or a legitimate news site that updated at least twice a day. Or an email service that bridged to the clearnet so that you could send/receive 'normal' emails.\n\nWhat I like about these networks is it takes me back to the late 90's early 00's of the internet. Where web forums are where you went to discuss and read about topics of interest and hobbies. Everyone had a handle/username that they created, it was rare to know the first/last name of who you're talking to, you didn't require a phone number to sign up and post or email verification in most cases. A user 'photo' was almost always a movie/tv/cartoon character or some other graphic, rarely was it an actual photo of the person. It was the internet in it's absolute prime, in my opinion. The only thing that changed was companies realized the value in advertising, which isn't inherently wrong, but they went all in with little oversight and it became a privacy nightmare.",
				"added": 1607223194
			}
		],
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 4,
				"body": "So far the only thing I've found on ZeroNet that seems to be worthwhile is this forum. If there is more to see, that's similar or just as good, let me know. Seems like most the blogs haven't been updated in 2018. But this place seems active enough for me to do a quick run of ./ZeroNet.sh in the terminal just to check for an update.",
				"added": 1607027947
			}
		],
		"1585356118_1HJtxgNm8uvChV6fixT4Y3FiupwfkAjC3d": [
			{
				"comment_id": 5,
				"body": "B2",
				"added": 1607170662
			}
		],
		"1606796276_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "Isn't it still very developmental? For now can't you just:\n\n     sudo systemctl stop yggdrasil \n\n     sudo apt-get update && apt-get upgrade -y\n\n     (wait)\n\n     sudo systemctl start yggdrasil\n\nI disable/enable these networks all the time depending on what I'm doing or trying to do. \n\nCurious: do you have your system setup for IPv6? It shouldn't *need* it but just incase:\n\n     sysctl -w net.ipv6.conf.all.disable_ipv6=0\n\nI just started playing with yggdrasil after I read your post. It's pretty neat. I've not had any issues but I recognize it's still a very very early product.",
				"added": 1607270378
			}
		],
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_2781_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): https://yggdrasil-network.github.io/services.html [...]\n\nWill do, thanks for the heads up!",
				"added": 1607562566
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_2783_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You didn't enter the Yggdrasil URL correctly here.\n\nFixed.",
				"added": 1607562966
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_2782_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Please take my mobile interface suggestion.\n\nI'll see what can be done. :)",
				"added": 1607562984
			},
			{
				"comment_id": 11,
				"body": "> [quantumkitty](#comment_488_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Yeah, I think bridging is the only way to make people become aware of the pointlessness of having multiple different tools trying to accomplish the same goal, and dividing users all across.\n\nI agree. We have all these great platforms and it's wonderful they exist, but often people get stuck within their own familiar bubble. I'm hoping that making the site accessible via several different networks will encourage those who, for example maybe are more prone to using TOR and onion services to give something like I2P a try. And maybe things like Yggdrasil which is still pretty new will gain some more supporters. But more importantly, maybe the clearnet visitors will think, \"Woah, what is this all about?\" and go down a rabbit hole of caring about digital privacy.",
				"added": 1607563129
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_2784_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I know a developer who needs a gig site. Would you be interested in getting in contact with him? He's homeless. Maybe he could be rewarded for bug bounties?\n\n>I'll send you a Zmail of his email address if that is possible.\n\nSure, but truth be told I'm more or less in the same boat myself. Ramen and tuna every day, rent was due 9 days ago. No one is calling me back about jobs. Tough time.\n\nWorking on projects like this keeps me (relatively) sane, though.",
				"added": 1607563244
			},
			{
				"comment_id": 13,
				"body": "> [edgelordofdecent](#comment_716_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): I'll check it out later.\n\nI hope you enjoy it!",
				"added": 1607575062
			},
			{
				"comment_id": 14,
				"body": "> [schiz0@kxoid.bit](#comment_83_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): Wow! I'm waiting for a ZeroNet integration; it's what we all need\n\nIf I knew how, I would. I'm not certain it's possible but I may be wrong!",
				"added": 1607592926
			},
			{
				"comment_id": 15,
				"body": "> [reichama](#comment_49_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): To take off, being a copy won't be good enough. There needs to be some value to attract people. The value of reddit isn't the infrastructure, but the content the people contribute. But I don't know how to solve this chicken-egg-proglem.\n\nThat's a good assessment, and honestly, I'm hoping that it being a combination of users from Tor, I2P, Zeronet, yggdrasil, and the clearnet will help sort of mold the site into a more privacy conscious, tech minded group. I'm not going to lie and claim it's a unique site in function, it's not. People post links and text/image based submissions, people in turn can comment on them. If it's good, they can upvote it. If it's bad, they can downvote it. Though the votes don't matter as karma isn't a thing, it's just for calculating what the community finds useful and what it finds garbage. (And the + & - votes are shown) It's pretty simple and not pretty, but it works.\n\nI'm anxious and nervous to see what direction it takes, I think implementing it came at a good time because it's not a response to some sort of massive ban wave on reddit, but it does come at a time where more and more people in general are ditching social media and realizing big tech is a nightmare of manipulative algorithms to change the way you feel about things.",
				"added": 1607616738
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_2788_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Through Yggdrasil I get: 400 Bad Request\n\nThat's been fixed. I use Yggdrasil and I2P for most of my connections to the site.",
				"added": 1607715176
			},
			{
				"comment_id": 17,
				"body": "> [schiz0@kxoid.bit](#comment_86_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): an experimental ZeroRamble [...]\n\nThanks. I wish it was easier to integrate independent sites into ZeroNet without having them 'built in' and all look the same.\n\nSpeaking of easy and independent sites: We're now available on LokiNet via http://ramble.loki\n\nI think LokiNet is going to be big. It has the 'flash' and 'wow' of ZeroNet in terms of consumer appearance. It 'looks modern and is easy to use', but also allows for easy self-hosted sites on their network.\n\nIt's like if I2P and ZeroNet had a baby.",
				"added": 1608281096
			}
		],
		"1608206269_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 18,
				"body": "Show us on this doll where Donald Trump hurt you.",
				"added": 1608281194
			}
		],
		"1608250382_1vHZxSPDWPsY1FxSNrccx845qs4AoNtq2": [
			{
				"comment_id": 19,
				"body": "Predictions:\n* Biden doesn't survive his first year in office, we get President Harris as a result.\n* Many small businesses tank, while big business (Wal-Mart, Target, Lowes, Amazon, etc. The corporations) grow.\n* The inequality in wealth between classes grows. The middle class shrinks even more, to where we essentially just have the struggling poors who rely on the 'generosity' of corporations, the government and the rich to survive and the other class will just be the rich/elite class.\n\nWith any amount of luck earth just gets pelted with a dozen or so Texas sized asteroids and we're all put out of our misery in a relatively quick fashion.",
				"added": 1608281518
			},
			{
				"comment_id": 20,
				"body": "> [octopodes](#comment_4_1cLuFbBnM79y6F6tSHkUeiXuqZkENxogh): Why doesn't Biden survive?\n\nHealth.",
				"added": 1608322310
			}
		],
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "I use I2P all the time, but I prefer the I2P+ router over the stock one. Works well for me, and I browse my own site ( http://ramble.i2p / https://ramble.pw clearnet ) all the time with it.\n\nI also run a Lokinet site ( same as above, just replace .i2p with .loki ) and use it, but there is hardly any content on that network. It's faster but you have much less control over your access to it as you do with I2P. It's a very... ambitious project. Seems like the goal of Loki is to create a cryptocurrency to be used within the network. You have cafe.loki which is a neat social media site, but hardly anyone on it, and to be 'verified' you have to submit personal details which is fucking pointless on an anonymity network.\n\nFor and I2P outproxy, ditch the false.i2p or whatever ships stock and swap it for the purokishi.i2p outproxy with  ECIES-X25519 encryption. It's faster and blocks ads by default on the clearnet, if you're not already blocking them yourself for some reason.",
				"added": 1608891836
			},
			{
				"comment_id": 24,
				"body": ">i2p is really laggy and half the time the sites dont load\n\nYeah, that's one issue I had when going through and trying to document all the sites that DID load. I made a big list of them here: https://ramble.pw/wiki/i2p_links There may be some sites that work that aren't on the list, but they didn't work at the time I was compiling it. \n\nMain issue with most of these networks, whether it be I2P or ZeroNet or LokiNet or whatever is... lack of content. What does exist is usually some tech-guy's blog or file directory to torrents.\n\nShit, even most onion sites are trash. If you search for something, 90% of the links are dead and you can't find just 'regular' content most the time. It's great that these networks exist but in order for them to grow and be supported by regular folks there needs to be a push for regular, every day content.",
				"added": 1608920790
			},
			{
				"comment_id": 26,
				"body": "Jesus, I just did a stock/vanilla install of I2P on a device that didn't have it and you're right. Out of the box, it does kind of suck.\n\nThe default subscription list is so limited, but then the docs suggest you add other subscription lists for more sites. Why aren't they just added by default? FFS. That's a needless task for a new user, those subscription lists should be added automatically so the address book actually has some sites in it. Furthermore, I've been suggesting purokishi.i2p to others as a better outproxy, but it's not in any of the pre-packaged or suggested subscription lists either. I forgot how much of a cluster fuck that is, since my install has been running for a couple months and I've gotten it setup how I want. I kind of forgot how bad it sucks as a new user, out of the box. Things that could very easily be fixed, however, and I hope that they do because it's pretty off-putting.\n\nI've had a number of people tell me they've never heard of I2P before until coming to my site and they were going to try it out. It hadn't occurred to me that their experience as a new user, with a default/vanilla install is going to differ greatly from someone who has spent time to set it up to not-suck.",
				"added": 1608928746
			},
			{
				"comment_id": 27,
				"body": "> [sword000000](#comment_65_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Honestly I don't have enough experience on I2P. It's difficult to find any sites that are worth going to. Have any decent link lists I can check out?\n\n> [deuxzaron](#comment_8_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): i2p could be a lot better but currently it just doesn't really work\n\nI wrote this: https://ramble.pw/f/I2P/629/the-easiest-way-to-get-the-most-out-of-i2p-update-your\n\nHopefully that helps you out. Out-of-the-box I2P isn't that great, the default \"link list\" (subscription list that has sites you can visit) is only like 40 sites and half don't work. That'll add some new lists to give you more sites to visit and a better/faster outproxy as well.\n\nHonestly, I2P+ is the way to go. It's the same I2P network but with a better router that has more features.\n\nIf you want a list of links to visit, check out: https://ramble.pw/wiki/i2p_links as those I recently tested and confirmed they worked, but make sure your address book has the appropriate subscription list(s) first.\n\nI2P makes it more difficult than it should to visit sites on their own network, I know. But once you're setup, you're setup. They just make it dumb to get started and it's off putting for new users.",
				"added": 1609050602
			}
		],
		"1603695205_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 22,
				"body": "Last Windows OS I ran at home was XP, and for the last 10+ years it's been Linux or nothing.",
				"added": 1608892089
			}
		],
		"1608645993_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 23,
				"body": "Always [RAMBLE] :)\n\nhttps://ramble.pw is the clearnet site, or you can access it via TOR, I2P, LokiNet or Yggdrasil. Just visit the wiki to find the links if you want to access it from the various anonymity networks.",
				"added": 1608892160
			},
			{
				"comment_id": 25,
				"body": "> [shadowperson](#comment_13_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq): Thanks I never even heard about that one.\n\nNo problem. I made a forum specific for Voat refugees here https://ramble.pw/f/Voat/587/to-the-voat-refugees-from-the-admin but you guys are free to create your own forum(s) as you see fit.\n\nI'm pretty libertarian with things so all I ask is: No CP, no direct calls for violence, and treat anyone offering or asking for anything illegal as a cop. No one is banned for speech, I just ask that the featured / frontpage forums are more 'tame'. Basically, know your audience when in regular, featured front page forums but feel free to create your own or 'anything goes' type forums that people who don't want to see it can block if they choose.",
				"added": 1608920998
			}
		],
		"1609017796_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 28,
				"body": "Let's find out. One million likes and I'll... do nothing.",
				"added": 1609050676
			}
		]
	},
	"comment_vote": {
		"19_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": 1,
		"1_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1_1JRReFAonxccQRM3AbrGFEEc2VqckGzo56": 1,
		"25_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": 1,
		"49_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"86_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"47_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"9_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": 1,
		"416_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"209_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"54_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"624_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1_15fFKEVL87t9KJRxh6M1SvHovNSbijK3c9": 1,
		"71_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"1_19ZkyYnsyNaf8RoMf7ZCJWTD6zEqHnTKjq": 1,
		"6_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"7_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"2781_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"488_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"2783_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2782_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"716_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"83_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"86_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"13_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"25_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"23_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"8_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"65_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1
	}
}