{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1588691602,
			"title": "ptrcnull z wykopu to nie laska, to pedał, ruski troll i spierdolina życiowa w jednym",
			"body": "Dzisiaj ujawniamy, kto odpowiada za serwer s3.bialystok.pl, który \"udaje\" stronę Urzędu Miasta Białegostoku, na którym poza podśmiechujkami z papaja znajduje się PDF z rzekomym oryginałem pakietu wyborczego. Jak słusznie ustalił mirek @bigota, ten sam serwer hostuje https://ptrcnull.me/ czyli stronę domową niejakiej \"Patrycji\" ze Szczecina, z linkiem do \"jej\" Facebooka pt. \"Patrycja Rosa\". Wystarczy chwila googlowania, żeby ustalić, że \"jej\" konto na LinkedIn miało jeszcze niedawno treść \"Jan Rosa. Programista JavaScript + Sysadmin. Szczecin, woj. zachodniopomorskie, Polska\" Potem już łatwo znaleźć artykuły o jego sukcesach w konkursach informatycznych dla gimnazjalistów, zdjęcia i tak dalej. Jeżeli przestawimy niektóre litery w imieniu PaTRycjA, to wyjdzie nam TRAP. Piszę o tym na mirko, bo użytkownicy @ptrcnull i @tpap (multi?) już mi dwa komentarze zgłosili do moderacji i efekt Streisand wymaga adekwatnej reakcji. Jeśli by to mirko zniknęło, to wkleję poza wykopem.\n\n@glos_rozsadkowy: uwaga, @tpap i @ptrcnull już zgłaszają (a może to multikonto?) moje komentarze do moderacji, bo napisałem że to drugie to Jan/Patrycja Rosa ze Szczecina i że to tego serwer, a nie urzędu miasta. \n\n@Teylor: żadna nastolatka, tylko Jan Rosa ze szczecińskiego Collegium Informatycznego, znany lewacki shitposter, udaje laskę żeby być bardziej cringe. Bagiety już po niego jadą. \n\n@bigota: Żadna Patrycja Rosa, tylko @ptrcnull Jan Rosa, szczeciński licealista. A PDF ma w metadanych nazwisko autora i datę stworzenia, można się rozejść. \n\nLinki do znalezisk:\nhttps://www.wykop.pl/link/5485357/wydrukuj-sobie-pakiet-wyborczy-pdf-juz-jest-w-internecie/\nhttps://www.wykop.pl/link/5485665/pdf-z-pakietem-wyborczym-w-sieci-to-trollowanie-z-um-bialegostoku-w-tle/",
			"added": 1588691601
		},
		{
			"topic_id": 1592306794,
			"title": "Wybory prezydenckie 28 czerwca 2020 - niewygodne fakty",
			"body": "Pierwsza kwestia, której nie rozumie większość społeczeństwa to dwie tury wyborów. Jest to rozwiązanie mające zapobiec głosowaniu taktycznemu - https://pl.wikipedia.org/wiki/G%C5%82osowanie_taktyczne - a więc takiemu, gdzie wyborca głosuje na Trzaskowskiego, byle tylko Duda nie wygrał, mimo że wolałby np. Stanisława Żółtka. Otóż w pierwszej turze należy głosować na swojego faworyta i mieć kompletnie w dupie sondaże, a dopiero gdy w drugiej turze się on nie pojawi, głosować na \"mniejsze zło\". Nie da się tego prościej wytłumaczyć, niby wszyscy wiedzą że to tak działa, ale i tak 3/4 elektoratu negatywnego PiS głosuje na PO, bo dają sobie wmawiać, że to jedyna alternatywa.\n\nPo drugie, PiS i PO to w 90% te same poglądy i programy polityczne. Jedna i druga nie obniża podatków, kradnie i oszukuje na każdym kroku, spowalnia gospodarkę, nie potrafi zreformować ZUS, służby zdrowia, kościołów, wojska. Połowa ludzi w tych partiach była lub będzie w drugiej partii, bo są to osoby bezideowe, które za 1200zł podwyżki gotowe byłyby sobie nawet dać obciąć kutasa. W telewizji jest pisowskie TVP i platformiany TVP, jedni i drudzy nadają na siebie nawzajem, jak Duda powie że pedały są złe, to Trzaskowski publicznie obciągnie Tuskowi. Obecnie biją się o głosy prawdziwej prawicy, bo wiedzą, że w drugiej turze zaważyć może malutka przewaga. No i nie oszukujmy się, Duda to prezydent który nic nie może, który nic nie zrobił, nic nawet przez te pięć lat nie powiedział. Zwykła kukła Kaczyńskiego, nie zawetował ani jednej ustawy, niby niezależny od PiS, a robi wszystko, co chcą. Trzaskowski to w ogóle nie wiadomo kto. To, co TVP na niego nadaje, że jakichś ludzi w Warszawie okradł, to prawdopodobnie też prawda. W niczym od Dudy nie będzie lepszy. Ustaw pisowskich też nie będzie wetował tak samo jak PO nie głosowała przeciwko im - przy 75% pisowskich ustaw głosowali za, to taka opozycja dla lemingów, drzeć ryja tylko potrafią, ale sami mają taki sam program.\n\nKtokolwiek tych wyborów nie wygra, będzie od pierwszego dnia kontestowany przez zagranicę. Putin od razu powie, że nie uznaje nowego prezydenta bo wybory były zafałszowane i zaproponuje przysłanie swoich czołgów, żeby zrobić wybory jeszcze raz. A jak nie Putin, to Amerykanie. Będą się z nas śmiać na całym świecie, że po co nam konstytucja, skoro nie umiemy z niej korzystać. Dodatkowo wybory spowodują jeszcze większą pandemię.\n\nZaraz po wyborach trzeba będzie wreszcie wyjebać górników w dupy, kopalnie zostaną przekazane zagranicznym firmom, które zwolnią 90% górników, zainstalują maszyny, zwiększą eksploatację i nie zapłacą ani złotówki podatku do budżetu. Podobnie ZUS, na który pieniędzy nie ma i nie ma skąd wziąć, sam nie wiem skąd ukradną, ale to będzie największa afera od czasów FOZZ. Tylko z NFZ nie będą musieli się tłumaczyć, bo po prostu epidemia będzie trwała pięć lat - odpowiednie przepisy już stworzyli. Każdy, kto jeszcze ma tutaj firmę i wychodzi na plus, do końca 2020 lub najpóźniej do połowy 2021 roku zbankrutuje, zostanie zamknięty lub wszystko sprzeda i spierdoli za granicę. Ekonomię przejmą duże niemieckie lub żydowskie koncerny, obniżą pensje, podniosą ceny, będziemy jak ludzie na farmach w Matriksie.\n\nNo chyba, że wygra prezydent, który nie boi się postawić tym interesom i nie boi się, że go odstrzelą. Prezydent, który będzie wetował te ustawy i proponował swoje, mające na celu odciążenie gospodarki, zliberalizowanie przepisów, prywatyzację szkolnictwa i służby zdrowia, spłatę zadłużenia zagranicznego oraz ZUS, zagonienie bezrobotnych do pracy, podniesienie kwoty wolnej od podatku, oddzielenie państwa od kośćioła. Nie będę wam podpowiadał, którzy kandydaci mają to w programie, sami sobie sprawdźcie.",
			"added": 1592306792
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1587477797_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": [
			{
				"comment_id": 1,
				"body": "Cześć! Mam zupełnie przypadkiem bordo na wykopie, chyba mi dali za wklejki z telefonami do prokuratorów. Dzisiaj dałem na mikro linka do forum, może ktoś z nich tu zajrzy.",
				"added": 1588693066
			},
			{
				"comment_id": 10,
				"body": "> [ejkej](#comment_17_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs): Fajny motyw, jestem grafikiem chętnie coś sklecę - masz jakiś pomysł na mema?\nStos pedałów rowerowych i podpis \"w Zeronecie możesz nazywać rzeczy po imieniu\".\nPodobizna Mahometa i \"w Zeronecie żadna religia nie dominuje\".\nWizerunek laski jarającej blanta i \"w Zeronecie możesz palić, co chcesz\".\nFacet dotykający swoich sutków i \"w Zeronecie wszystkie sutki są wolne\".\nStos gotówki i \"w Zeronecie nie płacisz podatku od reklamy\".",
				"added": 1596409721
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 2,
				"body": "To bot przecież. Tekst jest tłumaczony maszynowo z angielskiego czy tam chińskiego, prawdopodobnie któryś rząd poczuł, że nie ma kontroli nad tym, co tu się dzieje i chce zniechęcić użytkowników do postowania wartościowego contentu. Jeżeli się mylę, to proszę bardzo - niech root2elroy odpowie w tym temacie nienaganną polszczyzną, że się mylę, da jakieś screeny.",
				"added": 1588693315
			}
		],
		"1588691602_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 3,
				"body": "> [ejkej](#comment_14_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs): Wow, mogę wrzucić na mirko? Tak serio mogę wrzucić opis na fanpage?\n\nW jaki sposób miałbym cię powstrzymać? ( ͡° ͜ʖ ͡°)",
				"added": 1589159927
			}
		],
		"1590331802_1HBTrB6MUAYKvXYgawBVApd2qapGCQsYXC": [
			{
				"comment_id": 4,
				"body": "O ile sam pomysł na pewno zasługuje na zgłębienie, o tyle na obecnym etapie rozwoju 0net, jego popularyzacji, dostępności i stopnia anonimowości, jest to zdecydowanie pomysł przedwczesny. Przede wszystkim nawet na znanylekarz można tylko pomarzyć o opiniach większości pacjentów, a to dlatego że są to przeważnie ludzie starsi, niekorzystający z internetu, tym bardziej więc nie można się ich spodziewać tutaj. Po drugie, jeśli tu jest 30 osób, to jaka jest w ogóle szansa, że chociaż jeden lekarz, którego ja chociaż jeden raz w życiu spotkałem, będzie kiedykolwiek mieć do czynienia z tobą? Także te opinie niewiele nam dadzą, to dopiero wtedy ma sens, gdy na stronie jest tyle osób, że jest realna szansa natrafienia na opinię, która może coś zmienić w twoim życiu. Po trzecie, nie każdy używa tora, póki co spodziewałbym się jednak że opinie będą do namierzenia. Chociaż oczywiście opinia o usłudze to nie przestępstwo, w najgorszym razie grozi ci pozew cywilny o naruszenie dóbr osobistych, nikt z tego powodu nie będzie cię namierzał. Jednak jeśli w którymś momencie strona stanie się znana, pojawią się wrogie grupy, np. sponsorowane przez lekarzy, może być potrzebny wyższy poziom anonimowości. Kolejny problem to ochrona przed spamem - nie chcesz, żeby konkurent pisał tu syf na temat dobrego lekarza, jak temu zapobiec? Jak promować pożyteczne opinie?\n\nWszystkie te wątpliwości nie zachodzą w przypadku propozycji założenia strony z opiniami o prostytutkach. Nie ma ich aż tak wiele, klienci są raczej młodzi i zamożni, można załączać dowody swoich słów w postaci zdjęć, nagrań, nie trzeba się obawiać pozwania przez prostytutkę. Natomiast taka strona już jest na garso i może tyle wystarczy?",
				"added": 1592214031
			}
		],
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": [
			{
				"comment_id": 5,
				"body": "Wstyd, kurwa. Pandemia, totalitaryzm, cisza wyborcza, a na polskim zerotalku nie ma ani jednej dyskusji na złość kaczyńskiemu. Pewnie nie umiecie ztoryfikować zeronetu i siedzicie tu tylko bo kreskówki są.",
				"added": 1593351892
			},
			{
				"comment_id": 8,
				"body": "> [kapec](#comment_15_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Powiedziałeś znajomym żeby zainstalowali zeronet?\nTo najgłupsze, co można zrobić - zacząć rozgłaszać, że się działa w podziemiu i jeszcze podać swój pseudonim operacyjny. Ja piszę posty i utrzymuję węzeł czynny całą dobę, tyle wystarczy. Gdyby każdy tak robił, od razu byłoby inaczej.",
				"added": 1593608542
			}
		],
		"1592306794_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 6,
				"body": "Druga tura, więc i sytuacja inna. Duda i Trzaskowski idą łeb w łeb, z analiz im wynika, że decydujący głos będzie mieć elektorat Konfederacji. No to szybko, co ci konfederaci tam chcieli? Obniżyć podatki? Dobra, obniżymy, PAD nie podniósł żadnego podatku a już na pewno nie podniesie. Trzaskowski też nie podniósł żadnego i obiecuje, naprawdę szczerze, że podniesie kwotę wolną od podatku. Oczywiście wyborcy Konfedereacji nie są aż tak tępi, żeby dać się na to nabrać, nawet aszdziennik się już nabija, że obaj kandydaci będą się płaszczyć, żeby wygrać. Inne media wkładają w usta Korwinowi, że kogoś poparł, ogólnie jest niezły cyrk.\n\nZastanówmy się jednak konkretnie. Wybór \"bezpartyjnego\" Dudy oznaczał będzie dalszą kampanię totalitaryzmu Kaczyńskiego. Moim zdaniem najlepszy sposób, żeby pozbyć się PiSu z polityki, to dać im rządzić dalej. Do następnych wyborów wyrzucą nas z UE, doprowadzą do bankructwa ZUS, skompromitują się na każdej możliwej płaszczyźnie. W dodatku kaczor jest już stary i chorowity, myślę że pierdolnie nawet szybciej. Poza tym nie będą mieli na kogo zwalić winy za swoje porażki i nawet te stare baby nie dadzą się nabrać na kolejną łapówkę, bo będzie je stać na mniej chleba po 10zł niż wcześniej.\n\nWybór Trzaskowskiego z kolei oznacza, że nie zawetuje on ani jednej ustawy, która by miała jakieś znaczenie ekonomiczne. Nawet jeśli obecnie nie są dogadani, kaczor na sto procent znajdzie jakiś sposób, żeby człowiek pod żyrandolem mu nie przeszkadzał. Formalnie, w telewizji dalej będą się oczywiście żreć o bzdury przez całą kadencję, ale jak trzeba będzie zrobić VAT 25% to nawet się nie zająkną, przepchną go w jeden dzień. Społeczeństwo będzie nadal podzielone i skonfliktowane, bo nawet TVP czasem mówi prawdę gdy ujawnia łgarstwa platformy, tak samo jak TVN czasami mówi prawdę, gdy obnaża oszustwa PiSu. Taki dualizm polityczny już mieliśmy od 2010 i nic z tego nie wyszło.\n\nOptymizmem napawa, że PSL i lewica w ogóle się już nie liczą. Nagle w połowie sondaży między popisem i przystawkami znalazła się realna opozycja, pierwszy raz od upadku komunizmu, wbrew okrągłostołowemu postanowieniu Jaruzela, u władzy pojawia się ekonomiczna prawica. 1300000 obywateli nie tylko ma swoją reprezentację w sejmie, ale już najwyższe osoby w państwie klękają przed nimi, żeby móc pokraść jeszcze przez dwa lata. Nikt już nie wątpi, że osłabieni z wiekiem komuniści muszą odejść, nadchodzi porządek pokolenia ludzi urodzonych w III RP, którzy nie oglądają telewizji, rozumieją wolny rynek i w dupie mają pracowanie na złodziei.",
				"added": 1593608315
			},
			{
				"comment_id": 9,
				"body": "Nic, chuj, jakie liczenie? Wszyscy od początku wiedzieli, że spisowiały SN nie uzna ani jednego protestu wyborczego, pytanie było tylko o to, czy zdąży wszystkie rozpoznać. Teraz już wiemy, że zdąży. Kolejne pytanie, to czy OBWE będzie kwestionować ważność tych wyborów, tak jak już dziś niektóre państwa nie chcą nam przekazywać aresztowanych, bo u nas się rzekomo łamie prawa człowieka. Nic się do końca kadencji nie zmieni, można tylko działać na przyspieszenie tego końca. Przy czym nie chodzi o to, żeby kolejnym razem było pół miliona więcej dla platformy, tylko żeby ludzie zaczęli dostrzegać prawdziwą opozycję jako realną siłę w parlamencie. Po prostu rozpowszechniać to, co mówią w sejmie, pokazywać że PO nic nie robi ze zbrodniami pisowskimi, że PiS nic nie robi ze zbrodniami platformerskimi. Jak się patologii skończą zasiłki, a za 500+ nie będzie można kupić nawet biletu miesięcznego, to szybko się nauczą kalkulować. Starym babom nie dadzą trzynastki, górnikom pozamykają kopalnie, nadchodzące trzy lata będą bardzo orzeźwieńcze dla niejednej grupy. A jak nas jeszcze wirus potrzyma i kwarantanna pociągnie, to nawet w tym roku spodziewałbym się marszu na Wiejską.",
				"added": 1596408927
			}
		],
		"1593366129_1BBdtbg2Lf7AKGkoqGkU7wt1gvupFWg7Cu": [
			{
				"comment_id": 7,
				"body": "Zdolny rocznik.",
				"added": 1593608347
			}
		],
		"1598188181_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 11,
				"body": "Jak blokuje? Na poziomie DNS, routingu, rozszyfrowują ruch SSL i patrzą co masz w środku? Jakie masz dowody, źródła doniesień, eksperymenty do sprawdzenia? Jak odpowiesz na te pytania, możesz potem dodać, kto cenzuruje, jak wybiera filtry, po co i na czyj koszt.",
				"added": 1598193812
			}
		],
		"1598206333_19ffx3PUJM1UJsgBRQR3j1nM2MR1ESdwcE": [
			{
				"comment_id": 12,
				"body": "Problem jest z ludźmi, nie myślą, są leniwi, dają się oszukiwać. Przykłady można mnożyć. Po co fryzjer ma stawiać własny serwer, jak fanpage na facebooku ma za darmo? Po co seedować film na torrentach, jak można wgrać na youtube? Po co konfigurować filtry w programie pocztowym, jak gmail sam usuwa spam? Owszem, może i w 90% przypadków to się opłaca, ale chodzi właśnie o te kilka %. Gdy masz w rękach jakiś niewygodny filmik, to gdzie w zasadzie możesz go zuploadować? Nie ma nawet jak rozsyłać linka, bo taki na przykład facebook daje ci bana za samo wklejanie URL-i z \"niewygodnych\" domen. A ludzie nie widzą w tym nic złego. Ja cały czas wyobrażam sobie appkę na smartfony, w której społeczeństwo na złość rządowi przesyła sobie niewygodne artykuły, multimedia, pieniądze, gazety piszą jaka to zła aplikacja, ale nikt nie umie jej wyłączyć, zablokować. Kiedyś oczywiście powstanie, chociaż oczywiście nie pojawi się w Play store.",
				"added": 1599086645
			}
		],
		"1598206779_19ffx3PUJM1UJsgBRQR3j1nM2MR1ESdwcE": [
			{
				"comment_id": 13,
				"body": "Zobacz jakie błędy python wypisuje na konsoli / w pliku z logiem.",
				"added": 1599086695
			}
		]
	},
	"comment_vote": {
		"4_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": 1
	}
}