{
	"next_comment_id": 8,
	"comment": [
		{
			"comment_id": 1,
			"body": "Be careful you don't step in human biological waste or catch a broken needle. ",
			"post_id": 134,
			"date_added": 1532572437
		},
		{
			"comment_id": 2,
			"body": "Its possible to resume files download using the \"PIN\" file option in files menu? Without the +SEED button in a site,its problematic to complete the download.And the PIN button and PINNED FILES do not do too much.Setting up \"Auto download big file size limit\" download all files in the site.And not just that what the users want. ): It would be more useful a \"PIN RESUME\" button.",
			"post_id": 140,
			"date_added": 1541282329
		},
		{
			"comment_id": 3,
			"body": "The TED talk is also available at ZeroNet: http://127.0.0.1:43110/big.kopykate.bit/?Video=1541884826_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2",
			"post_id": 139,
			"date_added": 1546044250
		},
		{
			"comment_id": 4,
			"body": "Thank you!",
			"post_id": 151,
			"date_added": 1574137653
		},
		{
			"comment_id": 5,
			"body": "A default page contains HTML, CSS, pictures, JS files and nothing else is required for a web page to appear in the browser. It is inconvenient to have to specify optional files in the content.json file. The problem is that no separate parameter is specified in the content.json file, than can't download larger files either. It would be easier to copy all file to just the site folder. And the program itself could detect other types of files. Other types of files could be downloaded later, so pages would load faster. ",
			"post_id": 150,
			"date_added": 1594481390
		},
		{
			"comment_id": 6,
			"body": "Causes problems that need to be set separately in content.json file the optional files parameter. HTML, CSS, pictures, JS files are required for a web page to display correctly in the browser. All other file types could be automatically detected as optional files without specifying separate parameters in the content.json file. \n\nSites what uses non-UTF-8 encoding will not be displayed correctly in the browser. The installation of websites should be simplified so that it is enough to copy the files in the current zite folder. \n",
			"post_id": 151,
			"date_added": 1594483839
		},
		{
			"comment_id": 7,
			"body": "> [gitcenter](#comment_2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): cert_user_id from siteInfo is the username. In other words: (await page.cmdp(\"siteInfo\")).cert_user_id. Notice: cert_user_id is only available after the use logs in.\n\njust know there exist cmdp for async API? looks great",
			"post_id": 99,
			"date_added": 1598719040
		}
	],
	"comment_vote": {},
	"post_vote": {
		"132": 1,
		"133": 1
	}
}