{"next_paste_id":2,"next_comment_id":0,"paste":[{"paste_id":0,"description":"Carlos Marighella (1911-1969)","body":"Aos 18 anos iniciou curso de Engenharia na Escola Politécnica da Bahia e tornou-se militante do Partido Comunista. Conheceu a prisão pela primeira vez em 1932, após escrever um poema contendo críticas ao interventor da Bahia. Em 1932 muda-se para o Rio de Janeiro. Em 1o de maio de 1936 Marighella foi novamente preso e enfrentou, durante 23 dias, as terríveis torturas da polícia. Permaneceu encarcerado por um ano sendo solto pela “macedada” – nome da medida que libertou os presos políticos sem condenação. Transferindo-se para São Paulo, Marighella passou a agir em torno de dois eixos: a reorganização dos revolucionários comunistas, duramente atingidos pela repressão, e o combate ao terror imposto pela ditadura de Getúlio Vargas. Voltaria aos cárceres em 1939, sendo mais uma vez torturado de forma brutal na Delegacia de Ordem Política e Social (DOPS) de São Paulo, mas se negando a fornecer qualquer informação à polícia. Recolhido aos presídios de Fernando de Noronha e Ilha Grande pelo seis anos seguintes, ele dirigiria sua energia revolucionária ao trabalho de educação cultural e política dos companheiros de cadeia. Anistiado em abril de 1945, participou do processo de redemocratização do país e da reorganização do Partido Comunista na legalidade. Foi eleito deputado federal constituinte pelo estado da Bahia. Com o mandato cassado pela repressão que o governo Dutra desencadeou contra o comunistas, Marighella foi obrigado a retornar à clandestinidade em 1948, condição em que permaneceria por mais de duas décadas, até seu assassinato. Nos anos 50, exercendo novamente a militância em São Paulo, tomaria parte ativa nas lutas populares do período, em defesa do monopólio estatal do petróleo e contra o envio de soldados brasileiros à Coréia e a desnacionalização da economia. Cada vez mais, Carlos Marighella voltaria suas reflexões em direção do problema agrário, redigindo, em 1958, o ensaio “Alguns aspectos da renda da terra no Brasil”, o primeiro de uma série de análises teórico-políticas que elaborou até 1969. Após o golpe militar de 1964, Marighella foi novamente preso. Repetindo a postura de altivez das prisões anteriores, Marighella fez de sua defesa um ataque aos crimes e ao obscurantismo que imperava desde 1º de abril. Conseguiu, com isso, catalisar um movimento de solidariedade que forçou os militares a aceitar um habeas-corpus e sua libertação imediata. Desse momento em diante, intensificou o combate à ditadura utilizando todos os meios de luta na tentativa de impedir a consolidação de um regime ilegal e ilegítimo. Na ocasião, Carlos Marighella aprofundou as divergências com o Partido Comunista, criticando seu imobilismo. Em dezembro de 1966, em carta à Comissão Executiva do PCB, requereu seu desligamento da mesma, explicitando a disposição de lutar revolucionariamente junto às massas, em vez de ficar à espera das regras do jogo político e burocrático convencional que, segundo entendia, imperava na liderança. E quando já não havia outra solução, conforme suas próprias palavras, fundou a ALN – Ação Libertadora Nacional para, de armas em punho, enfrentar a ditadura. Na noite de 4 de novembro de 1969, surpreendido por uma emboscada, Carlos Marighella tombou varado pelas balas dos agentes da repressão.","language":"text/plain","encrypted":false,"added":1576201201}],"comment":[]}