{
	"title": "Hou fengqi page 2017-21",
	"description": "My Blog.",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1514353771,
	"post": [
		{
			"post_id": 4,
			"title": "New blog post",
			"date_published": 1514353771.083,
			"body": "Blog post body"
		},
		{
			"post_id": 3,
			"title": "here is another fuking cock master, take a look",
			"date_published": 1514352163.036,
			"body": "Blog post body"
		},
		{
			"post_id": 2,
			"title": "New blog post",
			"date_published": 1514352144.628,
			"body": "今年10月，内蒙古乌海原市委书记侯凤岐案一审宣判，其获刑17年，其妻杨秀娥被判处有期徒刑3年、缓刑5年。\n\n看法新闻记者梳理判决书发现，他们的家庭财产超过了1亿元，而其中合法收入仅为636万。侯凤岐获认定的受贿共有30起，均是商人所送，以至于辩护人提出“无卖官之事，希望从轻处罚”，结果被法院驳回。\n\n此外，除了大肆受贿，这夫妻二人还钱生钱，比如购买铺买房、股票投资、放高利贷等，进而把赃款洗白，获取更大的利益。\n\n亿元身家厅官一次性收千万贿款 放高利贷搞钱生钱（侯凤岐夫妻受审）\n\n第一次受贿就达30万，当时他才39岁\n\n公开宣判两个月后，12月25日，中国裁判文书网公布了该案的一审判决书，使得这起引发广泛关注的贪腐大案更多触目惊心的细节得到披露。\n\n2015年11月，年仅53岁的侯凤岐落马，这个曾被委以重任的煤炭资源重镇一把手迅速陨落。内蒙古纪委的双开通报显示，此人问题多多：搞迷信活动、与他人发生不正当性关系、不如实报个人事项、大肆敛财……\n\n纵观其履历，可以说他是几乎刚有点实权，就开始贪腐。具体来说，从1980年9月考入大学，直至1998年11月挂职结束，他都是在学校、宣传系统工作。之后，侯凤岐赴地方历练，2000年11月开始担任主政一方，即巴彦淖尔盟杭锦后旗政府旗长（相当于县长）。\n\n然而，就是从这个时候起，他的贪欲就开始萌发。判决书显示，当地一企业垫资承建公路工程，为讨要修路工程款，2001年底的一天，老板李某安排下属送侯凤岐30万。后者转身把钱给了妻子杨秀娥，在北京中关村科技商贸城买了商铺。\n\n亿元身家厅官一次性收千万贿款 放高利贷搞钱生钱\n\n看法新闻记者注意到，收受第一笔贿赂时，侯凤岐刚刚39岁。此后边腐边升的他2008年来到乌海担任市长，4年后再进一步获任市委书记，直至2015年11月落马。\n\n今年10月，也就是落马2年后，侯凤岐和杨秀娥在通辽中院双双一审获罪。法院经审理查明，侯凤岐受贿人民币2500余万、欧元13万元、美元29万元，并有人民币2500余万元、欧元58万元、美元1.8万元不能说明合法来源，故而被认定犯受贿罪、巨额财产来源不明罪，决定执行有期徒刑17年。\n\n而他的妻子杨秀娥，因犯掩饰、隐瞒犯罪所得、犯罪所得收益罪，获刑3年、缓刑5年。至于她的涉案金额，当时并未公布。随着一审判决书的公开，看法新闻记者发现，其妻涉案达2021万余元。\n\n更加令人吃惊的是，侦查部门查封、扣押、冻结侯凤岐家庭财产合计人民币9766万余元、70万欧元、30.8万美元，可以称得上是真正的“身家亿元”。\n\n至于支出，共计人民币1200万余元、3万欧元、5万美元。相比之下，他们的合法收入仅为636万余元。总而言之，侯凤岐犯罪及非法所得合计人民币7818万余元、15万欧元、34万美元。\n\n大肆受贿：煤老板一送就是300万\n\n必须要指出的是，虽然违法所得得到7800多万，但受贿所得被认定为2500多万，法院共查明事实30起。\n\n看法新闻记者梳理发现，这30起事实中，最小的一笔为3万元，最大的一笔近1000万，可以称得上是“大小通吃”。\n\n具体来说，2003年冬季，当地一家绒毛制品老总白某找到时任巴彦淖尔盟副盟长侯凤岐的家，以即将过春节为由，送了3万元，为的就是感谢侯在银行贷款方面对其给予的帮助。\n\n最大的一笔发生在侯凤岐任乌海市市长期间，送钱的是一家矿业集团的董事长张某，即一位煤老板。原来这名煤老板在当地签了个采煤工程，于2008年9月找到侯凤岐，送了15万美元，希望得到关照。第二年，煤老板希望能找有关部门打打招呼，使采煤工程延期、抓紧开采，便一口气给了侯凤岐300万。\n\n谁知，事情并没有办成。煤老板觉得是钱送少了，便再次送了300万，结果他成功了。转过年，也就是2010年4月，煤老板希望再次延期，又给侯凤岐送了300万，工程便随之延长到同年7月。\n\n据侯凤岐供述，2009年第一次收300万时，对方开着车到家，从后备箱搬下来3个酒箱子，说是给领导拿点钱，然后就走了。其余2次的行贿情况类似，每次均为3个箱子的现金，煤老板直接开车送到他家。\n\n亿元身家厅官受贿还放高利贷 将29块金条埋藏入土\n\n看法新闻记者注意到，侯凤岐并非“光吃不吐”，当反腐的风声正紧时，他数次把受贿的钱财退了回去，但这样的做法并不妨碍受贿罪及涉案金额的认定。举例来说，此人曾收受一家投资公司老总熊某260万元的贿赂，为其协调开工、收工程款等。\n\n2013年和2014年底，侯凤岐因迫于反腐压力，分两次共计退给熊某人民币60万元。相同的时间段内，还有退钱的事情发生。此前他收受一家公司董事长孙某70万元，后来迫于反腐压力全部退回。\n\n必须要提醒的是，梳理已经查明的30起受贿事实，可以发现侯凤岐有一个特点——他收的全部都是老板的钱，无一起是官员买官相送。\n\n这也就使得其辩护律师曾提出：侯凤岐作为地方党政\"一把手\"、主要领导干部，在本案中并无\"买官卖官\"行为，其受贿行为对其主政地域的政治生态的负面影响相对不大，进而希望能从轻处罚。\n\n不过，这个理由被法院驳回：该意见与案件无关联性，不能作为从轻处罚情节。\n\n搞钱生钱：用赃款放高利贷\n\n如果说收受贿赂只是侯凤岐犯罪的开始，那么通过钱生钱，也是铸就亿元身家非常重要的因素。在这个方面，杨秀娥的作用就凸显了出来。\n\n看法新闻记者发现，他们主要通过购买商铺和房子、股票投资、放贷等方式，把赃款洗白，也进而获取更大的利益。\n\n在买房买铺方面，杨秀娥共买了5家商铺，分布在北京、呼和浩特，共买了5套房，分布在呼和浩特、海南等地。而他们的方式则是不用自己的名义买，而是请人代持。\n\n在投资股票方面，从2007年开始，杨秀娥便用朋友的名字开了5个账户，涉案金额达1100余万元。侯凤岐供述称，是他动员妻子炒股的，并教她分两部分炒股，一部分是合法收入，实名开户；另一部分是借用别人的名字，洗的是非法收入。\n\n亿元身家厅官一次性收千万贿款 放高利贷搞钱生钱\n\n至于放贷，他们涉及的不仅有小额贷款公司，竟然还染指了高利贷。比如侯凤岐早在2009年至2010年期间，就在当地一家公司老总倪某处放贷过160万元人民币，2014年底收回来，金额已经翻滚到400万。\n\n另外一个例子更加典型。2004年，侯凤岐到一家餐饮集团吃饭，董事长韩某说想借钱，便得到50万元，约定利息为年利率20%。后来，韩某给杨秀娥打电话，说现金流不够，还想借150万，年利率依然是20%。\n\n韩某先还了30万元利息，后给杨秀娥打电话，说年利率20%有点高，看能不能降一点，得到了可以的答复。后来他又付了25万利息、100万本金，却依然欠侯凤岐他们65万。\n\n\n至于杨秀娥窝藏、转移侯凤岐的非法收入，还有一个生动的事实。2014年初，反腐风声越刮越猛，他们决定将收受的29块金条（重4570.04克，价值170余万元）等物品藏匿于杨秀娥舅舅魏某家中。\n\n杨秀娥供述，2014年春天的时候，侯凤岐让她把家里的黄金物品拿回老家放起来。于是，她把黄金、手表等贵重物品拿出来，用家里的旅行拉杆箱装好后，开车拉到其父母家里。又买了一个普通的旅行箱和一把小锁头，把东西倒进去，她开车拉到四舅家，让他把这些东西埋在他家凉房里。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}