{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1616664124_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 1,
				"body": "Sharing large files are unusable all in the network. The system are half finished, not resumed file downloads, in single user zites default way does not download large files. Need the owner  to add all files in the content.json as optional what larger than 10MB. If the zite owner do not do this you will not be able to download the files. If the zite owner  do this you will not be able to download the files because default way optional files does not download with the zite. There is no simple setup to download all large files when the zite are loading like a download button. The first thing we should fix, because the whole network is unusable with this setup! A critical problem what the developpers about years not fixed!",
				"added": 1621481701,
				"modified": 1621481883
			}
		],
		"1624387612_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": [
			{
				"comment_id": 2,
				"body": "I want to see a pay or seed system. The user seed back the file, or pay if refuse to do so. Pay the content owner and those who seed properly. The cost must be deducted when downloading, and if completely seeded back than return. On clearnet  only a small amount of content should be made available like the non optional files. Some HTML and pictures.  Just that content  what need to index the content correctly the clearnet search egnies. If the user needs more then download the software and help seed the content. From the clearnet this must be indicated to the user. The user pays here by seeding the content. Who not to do will harm the content owner and the other users who want the file, in a torrenting this equates to stealing. That’s why a lot of content owners don’t use such networks, users do not seed and the content is inaccessible. This is even helped by the engineering stupidity that even supports this. Here the large file sharing, the ZeroNet system is done for half the duration of the file download. The result is that no one seed the content, dead files, truncated content.",
				"added": 1630777317,
				"modified": 1630778762
			}
		]
	},
	"comment_vote": {}
}