{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1567104740,
			"title": "How to handle Moderation",
			"body": "Is there a post already about moderation already?  No one likes censorship so I'm thinking it would be nice if moderated posts moved to a pending delete page.  Some posts are placed in that queue for evidence (out of the way) or after at least 7 days removed (to save space).  Is there a better idea?  It would be cool to have moderators and a review period so any public member could stop by and review and see how well they are doing.  Thank you..",
			"added": 1567104739
		}
	],
	"topic_vote": {
		"1548888322_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1566425767_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1,
		"1566858736_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1567260953_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1548887246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "http://bitbacker.io",
				"added": 1548892316
			}
		],
		"1538339767_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 2,
				"body": "This is on Debian stretch:\n```bash\n$ sudo snap refresh zeronet\nsnap \"zeronet\" has no updates available\n```\nAnd I'm seeing the message about the security vulnerability..  Good thing I'm sand-boxed in snap..",
				"added": 1555812259
			}
		],
		"1567001589_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 3,
				"body": "Glad your not in denial!  After I woke up to this I got angry and hurt when I found out how much my family even mis-guided me just out of ignorance.  I'm still trying to wake people up, some will never accomplish this.  \n\nI'm more of a porcupine than a lion now.  A good self defense is useful.  Think about groups though, these are powerful forces but they are far limited in number than the about of honest people out there that want peace.  Don't be divided, find ways to work with people you don't understand yet.  This is so powerful, the entire fake media is dedicated into getting us to fight and separate.  It starts all the way back in school elementary school.  Like I said, many people will never see this.\n\nSo, I grew out of violence but I find an outlet in thinking about self-defense.  The solutions took a lot of time and thought before it could become my new way of thinking.  I had to work through it though.  A LOT of videos and blogs helped.\n\nAnger has a purpose and it is motivating so I don't want to say it is silly even though I'm not on that page now..  I learned more ways I could accomplish the same thing in a better way.  Eventually one by one my other brain cells calmed down.  But I didn't force it, just let it come on its own time.  I just studied.\n\nIt makes since to not strike where the enemy is the strongest (violence and guns) but where they are the weakest (truth and morals).  Organize with your peers and build better systems that make the old systems obsolete.  If you just destroy the problem you get a power vacuum.  You'll be hard-pressed to find people to do that, so keep chipping away at it and get a better plan.  If you instead build systems that are better we can evolve and make today the past that others will look back on and say: wow that sure was a fucked up time in history, lets not repeat it.\n\nJeff Berwick is a pretty good person for me to listen too given personal factors, that may or may not work for you.  James Corbett is the history buff I never became, only he is publishing the censored history.  Keep looking for answers, we need lots of minds on that one..  Find the people that are right for you.",
				"added": 1567100353
			}
		],
		"1566425767_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 4,
				"body": "Seems like you could do a page that outputs RSS feed complaint xml.  It is just text data.  Each site would need to add it.  I bet it will be popular especially if site owners only need to copy a file and add the file (script) to their URL rules mapping it to their database.  Your reader could then point to localhost and get html out of the site.",
				"added": 1567100703
			}
		],
		"1567104740_1HiD82hP36YF93PEqKcgdgfgmAq8UigrjD": [
			{
				"comment_id": 5,
				"body": "In the extreme case where there is lots of spam, and a posted terms (no CP for example) it would be nice to delegate moderation.  But the moderators need to be accountable so they can't abuse it..",
				"added": 1567105228
			},
			{
				"comment_id": 7,
				"body": "Here is an idea from 8chan:\nSee http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/ FAQ:\n\n\"Someone posted something that I do not like!\nCan you delete it?\nI can't. Only you can control the content that you're seeing.\nThere are tools for filtering content that you do not want to see/seed.\nUse them. \"\n\nFits in with the user-chooses blacklist model.",
				"added": 1567109861
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 6,
				"body": "> [estimene](#comment_13_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ): I mean, it's in the documentation so... [...]\n\nPay with crypto, that is a little better.  There are a few good VPNs that don't require an email address so signup is really easy.  You may need a calendar so you don't forget to pay ;) ..",
				"added": 1567109274
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 8,
				"body": "In the mean time, a captcha or a proof-of-work is probably the best you can get.  Unless your able to create a reputation system.\n\nIf you can find a way for users to earn the right to flag \"spam\" or \"not spam\" that will help so you can by-pass the captch and proof-of-work requirement.  The proof of work may not be so bad because it can run while your filling out the post.  That would get very annoying though for valuable contributors.  Another method might be to delay the post from a new account by say 24 hours then decrease that delay a little for each new post that does not get flagged as spam..  Let users go in and pre-flag spam or pre-approve non-spam before the delay.  Who gets to flag spam though?\n\nIn the future, this is an idea to use selfies to verify users allowing them to take selfies with other users and eventually prove a unique identity.  It is very complicated so it is good that a large well-funded liberty minded company is working on it.  That will all be on a blockchain.  You'll probably have to buy an account though so this may be one option and not the only option for users.  Another service will be needed (not mentioned in the patent) that could use something like ring signatures to issue users anonymous identities that can't be faked.  You cryptographically know a user is one in the pool of all users that reached a trusted level of identity verification while also knowing they can only get issued one anonymous identity for a given site (like ZeroTalk).  https://patents.google.com/patent/US10325084B1/  The patent is required to protect the creating company from other companies.  It has yet to be seen, but other chains may get permission to fork and modify it for their own purposes.",
				"added": 1567119713
			}
		],
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 9,
				"body": "Police are involved in crimes too and greatly expand upon what is a \"crime\" into what any rich cartel or corporation considers a crime.  I subscribe to this guideline: \"no victim no crime.\" ..  Also, we need to get away from state run monopolies like the Police.  Check out Cell411.",
				"added": 1567527733
			}
		]
	},
	"comment_vote": {}
}