{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT": 1,
		"1_16xCeREFAca5Autq5gG55AAUkwRTU47AMk": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT": [
			{
				"comment_id": 1,
				"body": "en plus de fliquer ouvertement, en plus de dire que le privatif est plus sûr, Microhard en fait toujours plus...",
				"added": 1488666092
			},
			{
				"comment_id": 2,
				"body": "toujours plus de conneries !",
				"added": 1488666130
			}
		],
		"1_16xCeREFAca5Autq5gG55AAUkwRTU47AMk": [
			{
				"comment_id": 3,
				"body": "\"Maurice Levenson, the secretary of the Initiation Society, an Anglo-Jewish organisation which represents about 55 mohels, said: “The great majority of the enquiries we receive come from those of the Jewish faith, Muslims, Afro-Caribbeans and Americans, where circumcision remains popular.” He said very few upper class British parents approached the organisation as they did in previous decades.\"\nhum... apparemment, ça s'est stoppé et perdu. ou ça se stop et se perd... Diana avait refusé cette habitude royale mise en place depuis George I apparemment... \"plus hygiénique\" et \"plus classe\" ! :) hum... je pense que c'est aussi relié à ce que cela représente dans l'Ancien Testament... \"le lien de ce peuple élu avec El, le grand Dieu Unique\". Relation favorisée, \"peuple Élite\". Peut être veulent ils se sentir pareil... \"on est pas de la merde, on est différents de vous, sous merdes\" ! bref...\nPEACE",
				"added": 1488666690
			},
			{
				"comment_id": 4,
				"body": "> [princecharles](#comment_1_1QGguD6RcW4Ft2c284R6qMqPERwsbXsfHJ): Royals anglais perversPrince Charles est homosexuel.Prince Philip est bisexuel.https://hetherophibie.blogspot.nl/2011/08/prince-philip-bisexuel-comme-la.htmlPrince William est homosexuel.www.pausefun.com/le-prince-williams-une-magazine-gay/\n\nsérieux ?",
				"added": 1488667285
			},
			{
				"comment_id": 5,
				"body": "> [mindcontrol](#comment_1_138dgaXdygAYWczHtCnsLYSRJW3r5CgbeC): Les Juifs ont pris le contrôle au-dessus de l'Église anglicane. La famille royale, la plus haute autorité dans l'église anglicane est circoncis et aspiré dans le pénis par des rabbins depuis des générations.Ils ont également parrainer le lobby gay à l'intérieur de l'église.\n\nIntéressant ! Sources ?",
				"added": 1488667307
			}
		]
	},
	"comment_vote": {
		"1_138dgaXdygAYWczHtCnsLYSRJW3r5CgbeC": 1
	}
}