{
	"title": "Dead inside blog",
	"description": "The blog of a man who has been dead inside for ages.\n\nEmail Me at noleafclover1994@zeroid.bit",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1526615433,
	"post": [
		{
			"post_id": 8,
			"title": "I want to fucking kill myself",
			"date_published": 1526615338.488,
			"body": "I want to die. I want to kill myself. I'll never be able to see the country I want to see before it gets turned into a warzone. I'll never be able to find work. I'll be stuck in this miserable shithole I'm in forever. Fuck it. I may as well buy the rope and stool tonight."
		},
		{
			"post_id": 7,
			"title": "Dying of loneliness",
			"date_published": 1526516383.14,
			"body": "Being alone is killing me. I can't handle this anymore. No girlfriend, no love, no attention. I need to end this."
		},
		{
			"post_id": 6,
			"title": "Hate",
			"date_published": 1526339762.693,
			"body": "I hate myself\n\nI hate everything I have become\n\nI hate everyone around me\n\nI hate this crushing loneliness\n\nI hate my past self for making the bad choices that led me here\n\nI hate that I seemingly can't fix myself or my life\n\nI hate my life\n\nI hate that I don't have the courage to pull the trigger\n\nMaybe one day..."
		},
		{
			"post_id": 5,
			"title": "Failure",
			"date_published": 1526255745.223,
			"body": "You are a failure\n\nYou have failed yourself\n\nEvery decision you've made was a mistake\n\nYou are a failure\n\nYou have failed everyone you love\n\nYou failed your mother\n\nYou failed your friends\n\nYou are a failure\n\nYou've wasted your potential\n\nYou're a failure\n\nYou're a failure\n\nYou're a failure"
		},
		{
			"post_id": 4,
			"title": "Being broke, no future.",
			"date_published": 1526125953.554,
			"body": "Fear, fear is quite the emotion. I fear my future. I fear for what I may become. I am not someone who ever wanted to do anything with his life. There is only one place in the world I ever wanted to see and I never will because lack of money.\n\nHaving a heart problem screws me over in the employment world. And my lack of intelligence screws me harder. I can never do anything with my life. What will I do? The only jobs I can do require me to sit and work at a PC, but I lack the intelligence and skills to do these jobs.\n\nI watch my life fade before me. Will I ever escape this?"
		},
		{
			"post_id": 3,
			"title": "Additional information about me",
			"date_published": 1525913349.07,
			"body": "I have come to realize that I should attempt to put out a bit more info to give context to my sorrow and depression.\n\nI was born into a family that has been rather dysfunctional in a sense. My mother was always the only calm, rational and sane person in my family. Everyone else had tendencies to break down hardcore.\n\nDespite this I lived a pretty happy life until I was 13\\. At 13 I watched my grandmother die of a heart attack. A night that haunts me to this day, 11 years later. After that things went downhill for me and my family, hard.\n\nFirst off, my mother continually got screwed by hospitals she worked at, putting her out of work for years and incurring so much debt that we went from middle-class to brink-of-poverty in no time.\n\nBetween the ages of 14 and 19 I was in no less than 4 abusive relationships, these women destroyed my self-worth and my mental stability for their own gain.\n\nI dropped out of high school at 16 because I was failing anyway and I hated school. I ended up with a GED. In that same year I was diagnosed with Hypertrophic Cardiomyopathy, a severe heart condition which would prevent me from working any job that would require lifting or running.\n\nAround 19 years old I finally met a woman who treated me well and actually cared for me. We were engaged until I accused her of something a few years later. By the time I realized my mistake and that I was actually wrong she wanted nothing to do with me.\n\nI have been single ever since...\n\nI did go to college at 22...For one day. I then dropped out because I realized I was too stupid to be in college.\n\nAnd thus, here I am. In hell. Alone. Unloved. A waste of oxygen."
		},
		{
			"post_id": 2,
			"title": "Introductions",
			"date_published": 1525659294.984,
			"body": "Welcome to my blog. You're probably curious as to who I am and why I'm making this blog. Well I intend to answer all your questions.\n\nSo who am I? Well I'm a 24 year old man living in a slum in the USA. I'm what many people would call a NEET. Between medical and psychological issues I don't work. I don't go to school because I'm stupid as shit and basically I'm just sitting here wasting away.\n\nSo why did I make this blog? Because I am suicidal. I want to be able to post my suicide note-esque thoughts somewhere where people won't care and won't call the cops to my place on a \"Suicide call\" (That happened to me once and I wanna track down the motherfucker who did it). And here on a decentralizeed website I can post all I want and no one will care.\n\nI'll post more soon, bet on it."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}