{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565965808_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1553138703_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 1,
				"body": "> [innocentchild](#comment_10_1Gsi9eT29B2uDs5bgE8av17QJe4hZotADa): Icons don't work in any of my firefox browsers.\n\nSo I don't think this happens with standard Firefox (all icons work just fine with mine) but it definitely does happen in Tor Browser (and I wouldn't be surprised if tweaking Firefox's privacy settings produced the same result).\n\nBasically I've noticed the same issue with my own sites in the past. It really comes down to ZeroNet not applying permissive Access Control headers for font/css files when there's a mismatch between the HTTP referrer and the content you're trying to access.\n\nThe code is [here](https://github.com/HelloZeroNet/ZeroNet/blob/7bff5f562c42a4a5f73e104c0f767c1413064aa6/src/Ui/UiRequest.py#L431-L436) and basically in some cases that regex isn't doing what we want it to.\n\nI'll send a PR later today to fix it, but with the current untested fix I'm able to get icons working on default Tor browser config.\n\nTo achieve the same result, add the following lines to `src/Ui/UiRequest.py` at line 515:\n\n```\n        if url_a.startswith(url_b) or url_b.startswith(url_a):\n            return True\n```\n\njust after `return False`. Restart ZeroNet and see if things work after that.",
				"added": 1553177385
			}
		],
		"1554985622_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 2,
				"body": "Was predicted: https://twitter.com/wikileaks/status/1113919962995884033\n\n> “BREAKING: A high level source within the Ecuadorian state has told @WikiLeaks that Julian Assange will be expelled within \"hours to days\" using the #INAPapers offshore scandal as a pretext--and that it already has an agreement with the UK for his arrest. ",
				"added": 1554986024
			}
		]
	},
	"comment_vote": {
		"1265_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	}
}