{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Yggdrasil - Rede IPv6 criptografada de ponta a ponta para conectar mundos",
			"body": "Yggdrasil é uma implementação em estágio inicial de uma rede IPv6 criptografada de ponta a ponta. É leve, auto-organizado, com suporte em várias plataformas e permite que praticamente qualquer aplicativo compatível com IPv6 se comunique de forma segura com outros nós Yggdrasil. Yggdrasil não exige que você tenha conectividade IPv6 com a Internet - ele também funciona com IPv4.\n\n- Sites(Clearnet + ZeroNet): https://yggdrasil-network.github.io/ | http://127.0.0.1:43110/1H2hcep9CaGYrYycMJwFx7Jr5jA81oLC34 | http://127.0.0.1:43110/1PffaPsQp81gec3GbLDTzH3cY57WuRfC36\n\n- GitHub: https://github.com/yggdrasil-network/yggdrasil-go.git\n\n- Tutoriais + APK: https://ipfs.io/ipfs/QmaA17ySEZD5fVb1ZE26jD1suKfvNPf1oebQyhnoJjP7Ab\n\n- Canal \"Yggdrasil Brasil\" no Telegram: https://t.me/yggdrasilbr",
			"added": 1599461493
		}
	],
	"topic_vote": {},
	"next_comment_id": 26,
	"comment": {
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 1,
				"body": "#Guilhotina #22 – Camila Rocha\n- https://siasky.net/AABifvcIUjSQ4TXQx7vX7voq6UPOgQNTmwEqW7v3H7ksdA\n\nBianca Pyl, Cristiano Navarro e Luís Brasilino recebem a cientista política Camila Rocha, autora da tese de doutorado “[‘Menos Marx mais Mises’: uma gênese da nova direita brasileira (2006-2018)](https://ipfs.infura.io/ipfs/QmaXEtC37eSB7J4wmsAW2gbMHdPEdGbqxVKRfZgSZwGAXh)”. Camila iniciou a pesquisa em 2015, quando passou quatro meses estudando os arquivos na sede do Instituto Liberal, e entrevistou as principais lideranças do que hoje se pode chamar a nova direita brasileira, como Bernardo Santoro, Fábio Ostermann, Hélio Beltrão, Paulo Batista, Ricardo Vélez Rodrigues e Rodrigo Constantino. No papo, a trajetória do próprio Instituto Liberal, do Instituto Mises, do Estudantes pela Liberdade, do MBL, do bolsonarismo e do Partido Novo, do PSC e do PSL, as três legendas que encampam esse movimento ultraliberal-conservador, há dez anos marginal e que hoje, além do controle do Palácio do Planalto, pauta o debate político mainstream no Brasil. Como isso aconteceu e quais lições podem ser tiradas desse processo?\n\n#Link para o artigo de Arlie Hochschild: https://web.archive.org/web/20200906174430/https://diplomatique.org.br/como-a-direita-seduziu-o-eleitorado-popular/\n\n- Fonte: https://diplomatique.org.br/guilhotina-22-camila-rocha/",
				"added": 1599416375
			},
			{
				"comment_id": 8,
				"body": "#ARTIGO – As encruzilhadas do imperialismo e a situação da classe trabalhadora\n\n“O mundo passa, desde pelo menos 2008, por um verdadeiro turbilhão político e econômico. Nos países centrais, Europa e Estados Unidos, as promessas do livre mercado, do desenvolvimento continuado sob a base do livre tráfego de mercadorias e dinheiro falharam copiosamente. O fantasma do desemprego e o rebaixamento do nível de vida assombram os trabalhadores dos países ditos de primeiro mundo. Esse fenômeno tem alavancado alternativas nacionalistas e intervencionistas com a promessa de recuperar o emprego e resguardar o nível de vida geral. Eis, nesse novo cenário, uma guerra de tarifas puxadas pelos Estados Unidos e a saída do Reino Unido da União Europeia.\n\nPor outro lado, nos países periféricos vemos uma situação análoga, mas que expressa o outro lado da moeda. A restauração capitalista na China em fins dos anos de 1970 fez com que as grandes empresas capitalistas voltassem seus olhos para uma população de dois bilhões de habitantes: fonte de mão de obra barata e, ao mesmo tempo, um novo mercado consumidor para as empresas de todos os ramos. Combinado a este processo, temos uma nova revolução tecnológica nos anos de 1980: a revolução eletroeletrônica. Para os países asiáticos se moveram a maior parte das unidades produtivas recém-criadas.\n\nAssim, naufragou os projetos desenvolvimentistas dos países periféricos da América Latina, África e Oriente Médio.\n\nNessas extensas áreas do globo terrestre vemos um continuado processo de desindustrialização, fazendo com que tais países, cada vez mais, tornem-se, como 100 anos antes, meros exportadores de matérias-primas de todos os tipos. Fracassam, assim, os projetos desenvolvimentistas nacionais, sejam de corte liberal ou intervencionistas. Elevam-se as migrações de trabalhadores dos países periféricos para os países centrais e as alternativas políticas clássicas, sociais-democratas e sociais liberais, naufragam irremediavelmente.\n\nNesse [artigo](https://ipfs.infura.io/ipfs/QmZa6ZSWwd9mw2qsF8FnVnCRRk7GsLgLPbsQifSYGkk9dC), procuramos ilustrar essa dinâmica com a análise de alguns fenômenos marcantes que se desdobram no setor automobilístico e de aeronaves, sobretudo na General Motors e Embraer. Tomamos essas empresas apenas como ponto de partida para um debate mais amplo: o mecanismo de exploração capitalista na época imperialista e o ponto em que se encontra na atualidade. Em particular, procuramos indicar como os países imperialistas dominam o mercado mundial, mas de modo algum o controlam. Cada saída apresentada produz, no polo oposto, contradições e instabilidades que fazem emergir, cada vez mais, novos problemas.\n\nNos afastamos, assim, das vertentes que interpretam o imperialismo como uma teoria político-conspiratória que tem o destino de sete bilhões de pessoas em suas mãos. Indicamos, em sentido contrário, que se trata de uma dominação política e econômica sobre um oceano indomável de contradições insolúveis e incontroláveis. É nesse sentido que procuramos fornecer elementos para a tese de que o Estados Unidos, nos dias de hoje, apesar de não possuir um rival imediato no que diz respeito a dominação imperialista, tem seu domínio enfraquecido diante das instabilidades que se aprofundam, sobretudo, desde a crise de 2008.”\n\nArtigo retirado do [Anuário Estatístico ILAESE: Trabalho e Exploração 2019](https://ipfs.infura.io/ipfs/QmRH8zC3yNGahzrckxMuPsENNYpK5Cp8yUNfbgQNtAfoVC)\n\nFaça o download do artigo [aqui](https://ipfs.infura.io/ipfs/QmZa6ZSWwd9mw2qsF8FnVnCRRk7GsLgLPbsQifSYGkk9dC).\n\n- Fonte: http://ilaese.org.br/artigo-as-encruzilhadas-do-imperialismo-e-a-situacao-da-classe-trabalhadora/",
				"added": 1599426598
			},
			{
				"comment_id": 10,
				"body": "#Gêngis Khan e o império mongol | Nerdologia\n- https://siasky.net/AAAksSyQkLvlEVkK65gpk_5JvnSkRT43_7SQM6OJFi9QOA\n\n#FONTES\nA principal referência para o vídeo foi o livro Genghis Khan & the Mongol Conquests 1190–1400, de Stephen Turnbull: https://ipfs.infura.io/ipfs/QmdVs1modvPbAkEgrDejuWZS5NYbtG5yweKdJDZaugiwoj\n\n#SAIBA MAIS\nO livro História das Guerras, organizado por Demétrio Magnoli, tem um capítulo sobre as conquistas mongóis, escrito pela professora Elaine Senise Barbosa: https://ipfs.infura.io/ipfs/QmbLhLTSEEbBbNhrZAj34aZnRYZVb4zszKaFtUCVDeA3tk\n\nThe Mongols, da coleção Oxford A Very Short Introduction, de Morris Rossabi: https://ipfs.infura.io/ipfs/QmTn1M5Toi7sW5Fy8jnKEVxy3pLQkhuPqy3pqpApSX5n6G\n\nO filme [O Guerreiro Genghis Khan](https://www.imdb.com/title/tt0416044/), além de fornecer diversas imagens pro vídeo, é bem interessante do ponto de vista histórico, embora seja uma obra de ficção: https://siasky.net/AADzs1xQ5h131-vGe4Ks97WgYtNKPV97rG6emsUrB-P2uA\n\nA universidade de Columbia tem um site dedicado aos mongóis:\n- http://afe.easia.columbia.edu/mongols/history/history.htm\n- https://web.archive.org/web/20200712201755/http://afe.easia.columbia.edu/mongols/history/history.htm",
				"added": 1599435756
			},
			{
				"comment_id": 11,
				"body": "#O liberalismo no Brasil: uma ideia fora de lugar?\n- https://siasky.net/AACPLQ3IIrYMtNybmpWl0nMPBDQVUTejmA_hBC-f5MLwNw\n\nNascido na Europa Ocidental no final do século XVIII, o liberalismo chegou no Brasil no século XIX e encontrou uma sociedade escravocrata e regida por um governo monárquico. Sendo o liberalismo defensor do trabalho assalariado e de uma democracia representativa, havia lugar para o liberalismo no Brasil neste contexto? Ou, de forma mais profunda, faz sentido falar em liberalismo no Brasil ou este seria uma ideia fora do lugar num país com uma história tão distinta da europeia? É por meio destas perguntas, e do debate iniciado pelo grande crítico literário Robert Schwarz, que este episódio do Estação Brasil discute a história do liberalismo no Brasil, atentando para suas contradições, tensões e principais características.\n\n#LEITURAS RECOMENDADAS\nRoberto Schwarz – Ao vencedor as batatas\nRoberto Schwarz – [Martinha versus Lucrecia](https://ipfs.infura.io/ipfs/QmYaByas7J4ic8J8CgZHwcgpJ9KqGKJqtRBtNzHLtA7N3A)\nMaria Sylva de Carvalho Franco – [As ideias estão no seu lugar](https://ipfs.infura.io/ipfs/QmbMSybqz9Rmzb1JLXgUwywYV9WyjNkeHWtMBbMMxsFBNN)\n\n- Fonte: https://leituraobrigahistoria.com/2020/05/25/o-liberalismo-no-brasil-uma-ideia-fora-de-lugar/",
				"added": 1599437750
			},
			{
				"comment_id": 12,
				"body": "#Lulismo: ascensão, queda e perspectivas pro futuro\n- https://siasky.net/AADBapCPkedNrLo9dgXmZ3TJX3MY5Mi9XwY_XoeDCWxPAQ\n\n\"Segundo o cientista político André Singer, o lulismo existe sob o signo da contradição. Conservação e mudança, reprodução e superação, decepção e esperança num mesmo movimento. Neste episódio, tentaremos debater as contradições e sentidos deste fenômeno a partir da obra do próprio Singer, buscando dar contornos mais rigorosos para o conceito de lulismo, tão banalizado no debate público. O que é o lulismo? Como e quando ele surgiu? Qual sua relação com o eleitorado mais pobre? Qual é a realidade social e política do eleitorado lulista? E quais as possíveis perspectivas deste fenômeno para o futuro, tendo em vista que vive um momento de crise?\"\n\n#LEITURA RECOMENDADA\nAndré Singer: [Os sentidos do lulismo](https://ipfs.infura.io/ipfs/QmUUqeKgy67kgSmiB6EiQJ1mbsZMYEkSDV9TUGYAyn9i4d)\n\n- Fonte: https://leituraobrigahistoria.com/2020/08/17/lulismo-ascensao-queda-e-perspectivas-pro-futuro/",
				"added": 1599439138
			},
			{
				"comment_id": 13,
				"body": "#Segunda Guerra: uma síntese da maior de todas as guerras\n- https://siasky.net/AADrlAJG1JlOuzX-pPoTgwglt_iQhjqNOSjdgC1WhFx2KQ\n\n\"A Segunda Guerra Mundial foi, em certa medida, a grande ironia decorrente da Primeira, que se dizia ser “a guerra para acabar com todas as guerras”. O resultado, ao invés disso, foi a maior guerra da história da humanidade, com números entre 50 e 60 milhões de mortes, tentativas de genocídio, expansões imperialistas e lutas não apenas pela sobrevivência de governos e sistemas, mas de grupos humanos inteiros. Nunca uma guerra teve uma escala tão grande, e essa guerra deixou marcas profundas na história que estão longe de ser apagadas. Para falar sobre o assunto, convidamos o Prof. Dennison de Oliveira (UFPR) para conversar sobre os principais pontos desse conflito.\"\n\n#LEITURAS RECOMENDADAS:\nDennison de Oliveira – [Para entender a Segunda Guerra Mundial](https://www.amazon.com.br/gp/product/8536293209/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=8536293209&linkCode=as2&tag=obrigahisto0d-20&linkId=5e9b311a11ab0bec422c02e986753cab)\nPaul Kennedy – [Ascensão e queda das grandes potências](https://ipfs.infura.io/ipfs/QmZSQ1nMmCNNynMfyqtM8RgHEfxGmJRRvYJHsHuYtfyNTM)\nAntony Beevor – [A Segunda Guerra Mundial](https://ipfs.infura.io/ipfs/QmVG6RCN1LVQRPGcedcNz17XQ7DSbvEwUAu6cPGy7NZNPG)\n\n- Fonte: https://leituraobrigahistoria.com/2020/06/01/segunda-guerra-uma-sintese-da-maior-de-todas-as-guerras/",
				"added": 1599441110
			},
			{
				"comment_id": 14,
				"body": "#Redemocratização brasileira: pelo povo ou para o povo?\n- https://siasky.net/AAAfA2N1YkiGULk_qwORtBSDhsC4jEE85Nft0GeQWl3UjQ\n\n\"Neste primeiro episódio do nosso podcast, trataremos de um dos temas mais caros para a sociedade brasileira no momento: a nossa democracia. Mais especificamente, discutiremos o processo de redemocratização no Brasil, abordando: como a nossa democracia foi sendo germinada nas décadas de 1970 e 1980 por meio da luta contra a ditadura militar, e como se deu o retorno ao Estado democrático de direito com a posse do primeiro presidente civil em 1985 e a proclamação da Constituição Federal em 1988. Teriam os militares controlado totalmente esse processo de transição para a democracia ou a resistência popular conseguiu interferir no processo de redemocratização?\"\n\n- Fonte: https://leituraobrigahistoria.com/2020/03/02/redemocratizacao-brasileira-pelo-povo-ou-para-o-povo/",
				"added": 1599442719
			},
			{
				"comment_id": 15,
				"body": "#Polarização? Antagonismos políticos no Brasil\n- https://siasky.net/AACHP98H75EVW-AajO1bFft4ENeaVZevHRIlmuOOeIv_yA\n\n\"Antagonismos políticos e sociais são antigos na história do Brasil. Nesse episódio tentamos explicar como eles ocorreram.\"\n\n#LEITURAS RECOMENDADAS:\nLuis Felipe Miguel – [Democracia e representação](https://www.amazon.com.br/gp/product/8539305003/ref=as_li_tl?ie=UTF8&camp=1789&creative=9325&creativeASIN=8539305003&linkCode=as2&tag=obrigahisto0d-20&linkId=a821073c69916bd4fb646bf66039b98f)\nEllen M. Wood – [Democracia contra o Capitalismo](https://ipfs.infura.io/ipfs/QmcN1DwhRoQCYAXNYS3FaJtzffDjgk1XqGrQMqMLnasXDj)\nSabrina Fernandes – [Sintomas Mórbidos](https://ipfs.io/ipfs/Qma5SyJXTQWxo2oP3nnC9uhhsxUq49Dd2KZkYThFpYcGaM)\n\n- Fonte: https://leituraobrigahistoria.com/2020/03/09/polarizacao-antagonismos-politicos-no-brasil/",
				"added": 1599443681
			},
			{
				"comment_id": 16,
				"body": "#Integralismo: das origens ao neofascismo do século XXI\nA história do principal movimento fascista brasileiro e a articulação da extrema-direita hoje\n- https://siasky.net/AAD0PMiTy--rybxyMJT7bHfc_ROhVWq9c2krZjkmj4RxPA\n\n#LEITURAS RECOMENDADAS:\nLeandro Pereira Gonçalves – [Plínio Salgado](https://amzn.to/2R65aet)\nJoão Fábio Bertonha – Plínio Salgado: biografia política\nHelgio Trindade – [Integralismo: fascismo brasileiro na década de 30](https://amzn.to/2QJ0zzI)\n\n- Fonte: https://leituraobrigahistoria.com/2020/01/13/integralismo-das-origens-ao-neofascismo-do-seculo-xxi/",
				"added": 1599444828
			},
			{
				"comment_id": 17,
				"body": "#O impacto dos choques petrolíferos na diplomacia brasileira (1969-1985)\n- https://ipfs.infura.io/ipfs/QmexnN3JefH5qacRNfbZKGXxEqX2jaeXanJbinzZ5ThrxN\n\nEste trabalho tem por objetivo principal descrever e avaliar os impactos dos choques petrolíferos da década de 1970 (1973-1974 e 1979-1980) na condução e transformação da diplomacia brasileira. Utilizando a Análise dos Sistemas Mundo (ASM) como principal pressuposto para a compreensão do Sistema Internacional e do Modelo Nacional Desenvolvimentista da Política Externa Brasileira como referencial específico para a avaliação da ação externa brasileira, esse trabalho procurou contribuir com um estudo que abordou de forma seqüencial três governos do regime militar brasileiro, Médici, Geisel e Figueiredo (1969-1985). Este recorte espaço temporal se justifica fundamentalmente por permitir uma abordagem de médio e largo prazo do problema petrolífero brasileiro que evite análises de caráter conjuntural das crises. Dividido em quatro capítulos, o trabalho trata em seu primeiro capítulo da ASM, do Modelo Nacional Desenvolvimentista e da situação petrolífera do Brasil. Nos três capítulos subseqüentes, cada um dos governos anteriormente referidos são abordados e avaliados, destacando o contexto petrolífero e econômico particular de cada um deles, assim como as principais alterações e permanências da diplomacia brasileira. De forma geral, as principais conclusões são: a) Os choques petrolíferos impactaram decisivamente e comprometeram o processo de inserção do Brasil no sistema internacional dos anos 70; b) a política externa modificou sua atuação no sistema internacional, transformando a questão petrolífera em elemento fundamental na condução e modificação dos vetores em vários cenários regionais como o Oriente Médio, África e América Latina; c) as subsidiárias internacionais da Petrobras, BRASPETRO e INTERBRAS tornaram-se elementos determinantes na resolução do dilema energético externo através da prospecção, exploração e formação de redes de contatos no exterior que internacionalizaram a empresa brasileira; d) a atuação da diplomacia brasileira nos cenários regionais não foi preventiva, mas sim reativa aos problemas criados pelos choques, modificando significativamente sua ação externa no Oriente Médio e África durante a gestão de Ernesto Geisel como presidente; e) A partir da administração Figueiredo, a condução do problema petrolífero brasileiro manteve continuidade na ação externa brasileira nos cenários do Oriente Médio e África, mas modificou sua ação externa para a América Latina, colhendo nessa região bons resultados no processo de diversificação das importações que se tornou objetivo básico da política externa de Figueiredo para o dilema energético.",
				"added": 1599445233
			},
			{
				"comment_id": 20,
				"body": "#Palmares e Zumbi: História, Controvérsia e Revisionismo\n- https://siasky.net/AAAIkyyh-kWBNDXupKBGh3TihUniT3snh6pbjonMi2GywA\n\n\"Diante de toda a controvérsia que ronda a história de Palmares e de seu mais famoso líder, Zumbi, conversamos com um especialista sobre essa história.\"\n\n#LEITURAS RECOMENDADAS:\nEdson Carneiro: O Quilombo de Palmares\nDécio Freitas: Palmares: a guerra dos escravos\nFlávio dos Santos Gomes (org): Mocambos de Palmares\n\n- Fonte: https://leituraobrigahistoria.com/2019/11/18/palmares-e-zumbi-historia-controversia-e-revisionismo/",
				"added": 1599452580
			},
			{
				"comment_id": 21,
				"body": "#Legado Negado: a escravidão no Brasil em um guia incorreto\n- https://open.lbry.com/Slavery-in-Brazil:d\n\n\"Legado negado: a escravidão no Brasil em um guia incorreto\" é uma análise profissional da obra \"[Guia politicamente incorreto da História do Brasil](https://ipfs.infura.io/ipfs/QmRrPQDnQ2uzFXtw9fir9YaEvucgxqsUb6dprHUuPsXjaj)\", escrito pelo jornalista Leandro Narloch em 2009, e que traz não apenas erros factuais, como interpretações problemáticas a respeito de aspectos da História do Brasil.",
				"added": 1599452690
			},
			{
				"comment_id": 24,
				"body": "#Esquerda fragmentada: análise de uma encruzilhada, com Sabrina Fernandes\n- https://siasky.net/AAAWuoB6PE2WTuOoEuEJjo29jjroxv_Y-2BKof_4_K_vPw\n\n\"No episódio de hoje do Podcast do Leitura ObrigaHISTÓRIA convidamos [Sabrina Fernandes](https://twitter.com/safbf), socióloga e responsável pelo canal [Tese Onze](https://www.youtube.com/channel/UC0fGGprihDIlQ3ykWvcb9hg), no YouTube, para falar sobre seu objeto de pesquisa nos últimos anos: a fragmentação da esquerda brasileira. Nesse episódio, conversamos sobre as esquerdas pós-junho de 2013, quem é quem entre os partidos desse campo e quais alternativas para a esquerda retomar o rumo como projeto de sociedade e alternativa representativa da classe trabalhadora.\"\n\n#LIVROS RECOMENDADOS:\nSabrina Fernandes: [Sintomas Mórbidos: a encruzilhada da esquerda brasileira](https://ipfs.io/ipfs/Qma5SyJXTQWxo2oP3nnC9uhhsxUq49Dd2KZkYThFpYcGaM)\nKarl Marx: [O 18 Brumário de Luis Bonaparte](https://ipfs.infura.io/ipfs/QmQKguMzPynHu4QCUeeBAMrebPgeiUuQCQqUuwer675oL2)\n\n- Fonte: https://leituraobrigahistoria.com/2019/08/26/esquerda-fragmentada-analise-de-uma-encruzilhada-com-sabrina-fernandes/",
				"added": 1599455447
			},
			{
				"comment_id": 25,
				"body": "#Leitura ObrigaHISTÓRIA\n- https://leituraobrigahistoria.com/\n\nO Leitura ObrigaHISTÓRIA surgiu como um [canal do YouTube](https://www.youtube.com/channel/UCtMjnvODdK1Gwy8psW3dzrg) criado em agosto de 2015 dedicado a compartilhar conhecimento histórico, focado especialmente em dicas de leitura tanto para estudantes e professores da área quanto para o público geral.\n\nO canal foi criado por Icles Rodrigues, historiador e mestre em História pela Universidade Federal de Santa Catarina, e conta também com quadros apresentados por Luanna Jales, também historiadora pela UFSC, e Mariane Pisani, antropóloga, com doutorado na mesma área pela Universidade de São Paulo e professora da Universidade Federal do Tocantins.\n\nEm 2019 surgiu o História FM, podcast do canal apresentado por Icles Rodrigues, que busca trazer acadêmicos de Ciências Humanas (especialmente História) para conversar sobre temas pertinentes ao estudiosos e entusiastas da disciplina.\n\nEm 2020 o Leitura ObrigaHISTÓRIA se consolidou como um selo de produção de podcasts de Ciências Humanas, adicionando ao seu plantel os podcasts História Noturna, Colunas de Hércules e Estação Brasil.",
				"added": 1599456641
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 2,
				"body": "#LIBERALISMO é crença teológica: Guedes e Constantino explicam\n- https://siasky.net/AABs54boT7MLtHjaw4mQSV19bcGMgyIF9hYPxZK9HCMvVg\n\nNesse vídeo, analisamos os pressupostos teóricos e a mentalidade liberal. Usamos como ilustração dois trechos de Paulo Guedes e Rodrigo Constantino.\n\nOs seguintes aspectos são abordados: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?17ZpHZGw3D1VZQN14QJFgK2zW41bQzAQ5R_0",
				"added": 1599417278
			},
			{
				"comment_id": 3,
				"body": "#MAMÃE FALEI Besteira | Arthur (Des)explica Mais-Valia | REAGINDO\n- https://siasky.net/AABCYOCAvt0EGGFbyz2qMVQiPoEj6gB5EkEhcVRE07VIYA\n\nReagimos ao vídeo do canal [Mamaefalei](https://www.youtube.com/channel/UCkSjy-IOEq-eMtarZl2uH1Q), em que Arthur, deputado do MBL, procura explicar o que é mais-valia. O vídeo se encontra no seguinte link: https://siasky.net/AAC1378ODFblY2ppQUBS9BLkra3-So3JQHzT99CQv62x-Q",
				"added": 1599418141
			},
			{
				"comment_id": 4,
				"body": "#MBL explica porque liberalismo é burrice\n- https://siasky.net/AABskr7C-EUF8JJ6YpG2diQqZ3qA7DACqoNbENyaS_XQ0A\n\nDiante da crise atual, MBL redefine liberalismo como sendo a intervenção total do Estado para garantir os \"princípios\" supremos do liberalismo: a vida, a propriedade e a segurança. Para tal, o Estado precisa investir em tempos de crise, precisa garantir a renda mínima, precisa atuar sempre que ocorra um fenômeno natural fora do que eles chamam \"normalidade\". Em outras palavras, o liberalismo econômico é perfeito, desde que ele não seja usado nunca; segundo o Movimento Brasil Livre.\n\nSe encontra no seguinte link: https://siasky.net/AAAosBlHZFXkobhZaNMalJQcL5HpfA_IrwHp5KLpOjlh_w\n\nFoi citado o Ensaio sobre o governo civil de John Locke.",
				"added": 1599419360
			},
			{
				"comment_id": 5,
				"body": "#Liberalismo e Keynesianismo não funcionam. Introdução à sociedade capitalista\n- https://siasky.net/AACELgiEHcC2kxEuqb74OOtJw1YiLaY7k7e2HU1MBsNJ-g\n\n\"Nesse vídeo discutirmos o funcionamento da sociedade capitalista do ponto de vista da distribuição de capital, isto é, a articulação entre o Capital Industrial, Comercial, não produtor de mercadorias, portador de juros e o Estado. Procuramos indicar a articulação entre essas partes e os limites dos modelinhos \"enfeitados por matemática\" dos liberais e keynesianos.\"\n\nVeja artigo completo no Anuário Estatístico do ILAESE: https://ipfs.infura.io/ipfs/QmRH8zC3yNGahzrckxMuPsENNYpK5Cp8yUNfbgQNtAfoVC",
				"added": 1599421287
			},
			{
				"comment_id": 6,
				"body": "#PETROBRAS | pouco IMPOSTO, muito LUCRO\n- https://siasky.net/AABKfT40X8rZVY3oJwPtsRgDtXMSkLZvH2QreYdEA0ndYw\n\nNesse vídeo mostramos alguns dados comparativos das receitas, lucros, impostos e taxas da Petrobras com outras gigantes do setor tais como: ExxonMobil (Estados Unidos), Royal Dutch Shell (Anglo-Holandesa), Equinor (Noruega), Chevron (Estados Unidos), BP (Inglaterra), Total (França), Petrobras (Brasil).\n\nVocês verão que a Petrobras é hoje a empresa de capital aberto mais lucrativa do setor e a que possui a menor taxa de impostos, considerando os dados acumulados desde 2012 até 2019.\n\nEsse é o motivo de sua privatização. Privatizar quando dá certo e se der errado o Estado salva com o dinheiro de seus impostos.\n\nBaixe gratuitamente o Anuário Estatístico do ILAESE 2019: https://ipfs.infura.io/ipfs/QmRH8zC3yNGahzrckxMuPsENNYpK5Cp8yUNfbgQNtAfoVC",
				"added": 1599423039
			},
			{
				"comment_id": 7,
				"body": "#A verdade sobre os IMPOSTOS no Brasil: a utopia liberal\n- https://siasky.net/AACUzEB85zJe8r3fkG_S147HiZAKhNFYCTrEAdFzdYjZgg\n\n#Fontes:\n- [CARGA TRIBUTÁRIA NO BRASIL - MINISTÉRIO DA FAZENTA E RECEITA FEDERAL](https://ipfs.infura.io/ipfs/QmX4vqgnVP5Qmy9jNxkzLZpUygXU3qwND7yob1oe1FzGGG)\n- [Séries históricas do IPEA](https://web.archive.org/web/20200220053349/https://www.ipea.gov.br/cartadeconjuntura/index.php/series-estatisticas-conjunturais-2/)\n- Anuário Estatístico do ILAESE: No prelo\n- [Relátorio 20F VALE](https://web.archive.org/web/20200729094757/http://www.vale.com/brasil/pt/investors/information-market/annual-reports/20f/paginas/default.aspx)",
				"added": 1599424000
			}
		],
		"1_1ExYhecdNveJBbZnjsxEyjs6FWq7XDv9dr": [
			{
				"comment_id": 9,
				"body": "#Como Jogar Xadrez para Iniciantes\n- https://ipfs.infura.io/ipfs/QmVjznzgK78G6DEGhAw8c6oKZg6G5gT8EPaDnr7Z9sWPDT\n\nO xadrez é um jogo incrivelmente divertido e viciante, que requer habilidade e estratégia. Ele existe há séculos como passatempo para intelectuais e acadêmicos; no entanto, não é preciso ser um gênio para dominá-lo - até uma criança pode jogar, às vezes melhor do que muitos adultos. Leia mais para aprender este antigo jogo, considerado como um dos melhores jogos de tabuleiro.\n\n#Como Ser um Jogador de Xadrez Melhor\n- https://ipfs.infura.io/ipfs/QmNbg1s48FSYNDM2vAS2XkktQnJWo1RAyBgiE2SctyJ2hc\n\nQualquer um pode tentar jogar xadrez, mas é preciso um pouco mais de esforço para se tornar um bom jogador. Continue lendo este artigo para saber como desenvolver suas habilidades no xadrez.\n\n#Como Ensinar Xadrez a Crianças\n- https://ipfs.infura.io/ipfs/QmPgCYjH9PdNBSvDsaAMp2RaFdwz1TRVfXHE9GPXXn2EzC\n\nO xadrez é um ótimo jogo de tabuleiro e pode ensinar qualquer criança a examinar as situações de forma estratégia e analítica. Comece com os conceitos básicos, como as peças e seus movimentos. Quando o pequeno (seu filho, por exemplo) dominar essa parte, passe a jogar versões modificadas da partida. Deixe-o aprender em seu próprio ritmo, sempre incentivando-o e sendo paciente. Por fim, o jovem vai desenvolver interesse pelo jogo e passar a considerá-lo uma atividade muito divertida.",
				"added": 1599427612
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 18,
				"body": "#O que o coronavírus faz nos órgãos: novas descobertas\n- https://ipfs.io/ipfs/QmUEokXcMTRk19jrkUDxRCQYNAhmH6TyUh4vZokAuT1hTP\n\nQuais os danos do coronavírus nos diversos sistemas? Há sequelas nos pacientes já curados? O que os médicos já aprenderam sobre a doença nesses meses de [pandemia](https://pt.wikipedia.org/wiki/Pandemia_de_COVID-19) por aqui? Descubra ouvindo cientistas que lideram estudos de ponta sobre o tema!",
				"added": 1599450357
			},
			{
				"comment_id": 19,
				"body": "#12 Apostilas de Plantas Medicinais para Baixar em PDF (Fonte: [Online Cursos Gratuitos](https://onlinecursosgratuitos.com/12-apostilas-de-plantas-medicinais-para-baixar-em-pdf-medicina-alternativa/))\n\n- https://ipfs.io/ipfs/Qmb4aBTn9pT2foLfmQhYsyYojyuUnSE2RtkFh88UVwcfjP\n\nAs [plantas medicinais](https://en.wikipedia.org/wiki/Medicinal_plants), também chamadas de ervas medicinais, foram descobertas e utilizadas nas práticas da medicina tradicional desde os tempos pré-históricos. As plantas sintetizam centenas de compostos químicos para funções, incluindo defesa contra insetos, fungos, doenças e mamíferos herbívoros. Vários fitoquímicos com atividade biológica potencial ou estabelecida foram identificados. No entanto, como uma única planta contém fitoquímicos amplamente diversos, os efeitos do uso de uma planta inteira como medicamento são incertos. Além disso, o conteúdo fitoquímico e as ações farmacológicas, se houver, de muitas plantas com potencial medicinal permanecem não avaliados por pesquisas científicas rigorosas para definir eficácia e segurança. Os primeiros registros históricos de ervas foram encontrados na civilização suméria, onde centenas de plantas medicinais, incluindo o ópio, estão listadas em tabuletas de argila. O [papiro Ebers](https://en.wikipedia.org/wiki/Ebers_Papyrus) do antigo Egito, c. 1550 aC, descreve mais de 850 medicamentos vegetais.",
				"added": 1599451124
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 22,
				"body": "#Como usar o [Firewall GUFW](https://help.ubuntu.com/community/Gufw) - Interface Gráfica para o firewall UFW no Ubuntu Linux\nhttps://ipfs.infura.io/ipfs/Qmagdxz7KNQ34ghyMNiwcPpmc8NYq6dH5ed4Ch72GuKfV6",
				"added": 1599453051
			},
			{
				"comment_id": 23,
				"body": "#[ClamAV](https://www.clamav.net/) - Antivírus para Linux - Instalação e uso no Ubuntu\nhttps://ipfs.infura.io/ipfs/QmPfBDi1QEECKXePvQ1KLJuoDDKqwaCVFE6EUodtVXEhPZ",
				"added": 1599453257
			}
		]
	},
	"comment_vote": {}
}