{
	"title": "Computer Ethics",
	"description": "Discussing Computer and Cyber Topics",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1555555239,
	"post": [
		{
			"post_id": 9,
			"title": "Flood cyber space",
			"date_published": 1555554487.6,
			"body": "On a recent trip abroad, one lesson I learned from the people I stayed with in southern Jordan was the power and widespread affect of an almost radical amount hospitality. This often translated to a sense of love that our fellow travelers felt during their stays at this family's home. This hospitality or love for someone needing help, seeking refuge, or just needing a place to stay underpins the entire Jordanian culture.\n\nAs a quick note - I'm not talking about religious love, but simply an outward show of love and care.\n\nThis got me thinking, and let me know your view on this, what if we as power users or people on the internet worked to show more compassion. It's been shown to spread better than hate or malice. This can be on the clear net, the dark net, or on decentralized nets like this one. What happens if we flood servers with content of love, humility, and acts of good. This doesn't mean ignore the bad things or to not solve the problems that are present, but to do so with compassion.\n\nI know even in my short time blogging on this platform and my time on other platforms as well as at work, that it's easy to magnify the awful and gruesome. But that happens in the news enough...\n\nHow will this spread if cyberspace gets better morals and acts out of kindness and the good of others? Ethical Hackers hopefully act out of good intent and have been working to solve problems in software and better secure the our networks. Love isn't just a soft, weak thing that we feel, but can be strong and durable.\n\nI'm sorry if this is too religious or lofty sounding, but it's an idea I've been milling over and wanted new perspectives.\n\nJaveli"
		},
		{
			"post_id": 7,
			"title": "Cyber Weapons",
			"date_published": 1555474838.6,
			"body": "Starting with 2010, the world saw its first cyber weapon. The Stuxnet malware package was the first of its kind. It not only did damage by stealing, corrupting, or deleting data on the Iranian nuclear program, but it also moved in the physical world. It adjusted the controls for the enrichment plants and spun them to death.\n\nThis bridge was big to make because it shows how powerful malware can be in the physical world. Not only can data be stolen, machines controlling our infrastructure can also be manipulated.\n\nThese are 4 points that help to define a cyber weapon:\n\n1.  A campaign that may combine multiple malicious programs for espionage, data theft, or sabotage.\n\n2.  A stealth capability that enables undetected operation within the targeted system over an extended time period.\n\n3.  An attacker with apparent intimate knowledge of details for the workings of the targeted system.\n\n4.  A special type of computer code to bypass protective cybersecurity technology.\n\nNot only is this a big step in the malware and virus development world, it's also paving the way for more malware that can do physical damage in the real world. In an age where software is controlling more and more of our lives (automation, smart homes, smart cities, smart traffic lights, etc.) this opens the way for cyber attacks on more than just our information. Each of our country's grids are becoming more and more at risk."
		},
		{
			"post_id": 6,
			"title": "Slantwise Actions",
			"date_published": 1554868564.2,
			"body": "Hi everyone, I apologize for the delay in new content. A few things came up. Hopefully back to daily posting for awhile.\n\nAn article I came across recently discussed slantwise actions. Briefly slantwise action in this content is developing apps that appeal to normal users, but have hidden benefits. For example, Signal and WhatsApp provide full end-to-end encryption without users having to do anything extra. This makes it so that more and more people are encrypting their conversations, thus, adding to the growing resistance to surveillance.\n\nApps like these make it so that the normal citizen who doesn't really think about security or privacy is protected from surveillance. Each step forward and each person is progress. \n\nIt would be interesting to continue to develop other applications and services that help people resist surveillance without having to be technologically inclined.\n\nThere are two other issues or possibilities I'd like to discuss here. The first, would it be possible to create or adapt zeronet as an app or a website in which users wouldn't necessarily need to know that they are using a decentralized application that is very hard to censor? Is that moral to take that knowledge away from them? It could be plugged into the ZeroTalk and be an interface where they can post from an app, read posts, comment, etc. and serve and seed other pages in the background. This could help make the community more mainstream.\n\nLastly, how can people start to spread this movement, quietly of course? Are we a full blown resistance? I think it's much like speaking with our dollar. Instead we are trying to speak with our data, or rather lack of data. If there is a critical mass that's big enough the gaps in usable data could make a difference.\n\nQuestions? Comments? Suggestions?\n\nJaveli"
		},
		{
			"post_id": 5,
			"title": "Learning how to Ethically Hack",
			"date_published": 1554439409.2,
			"body": "Ethical Hacking originally sounded like an ironic term. Ethics and hacking normally don't go together. No matter how ethical you may be, hacking always pushes a sort of gray area. However, it's a growing field and is becoming increasingly useful on the internet and in major applications. If the good people can find the critical bugs before the crackers find them, then we have a safer web (at least that's the theory).\n\nWhile I was in school I did a research paper on teaching ethical hacking techniques in a school setting. It's a very controversial topic for higher education and not many schools are doing it at all, even less are doing it well. A case study I looked at in my research was a school in Dubai. This school combined the practical applications with the theory behind common attacks and methodologies. Students worked in rotating red and blue teams to learn how to defend from attacks and how to launch attacks. This was on a protected lab network and done with caution. In addition to the technical aspects, students were also taught ethics.\n\nThe skills, however, weren't bound to heavily monitored lab machine or isolated network. Students were learning and successfully launching DOS attacks, CSRF attacks, ARP poisonings, brute force, and other common attacks for their coursework.\n\nIT buckled their seat belts and were in for a ride. This was expected, but still posed as a problem. IT noticed that they would receive influxes of various attacks throughout the school year. They would all the sudden get a bunch of network map scans or a DOS attack on their systems. These were the things students were learning and trying out on their own.\n\nOne response was to employ students to test the network as ethical hackers. They'd go bug hunting, try to access information, shut down servers, etc, and then report their findings to the school. Some teams also helped lock down the systems using the reports.\n\nIn anonymous surveys of the pilot class, students reported that they had targeted school systems, but were mostly doing it to learn and to have fun. Most of us are computer nerds and we all know it. Watching an exploit run and getting root on a remote target is so satisfying.\n\nI've also had experience taking an ethical hacking course within a school setting. I learned much of the same material and had to practice on something. Sometimes I'd hit my spare laptop with various attacks and other times I'd hit nearby devices with small attacks. Everything I did was harmless and no dangerous exploits were used.\n\nThis brings me to a major line of questioning. I learned more than just the attacks in my class; I also learned ethics to go along with it. Even though I broke some rules, I maintained a generally ethical position. Should ethical hacking programs be taught in school and should powerful exploits and exploit writing be taught?\n\nMy answer is yes. I'd rather have someone who I know has had at least some sort of hacking related ethical system taught to them. They should have some understanding of expectations and codes and disclosure standards. So many of the online courses like Udemy teach great skills, but lack the underlying ethical platforms.\n\nAny comments? Other opinions?\n\nJaveli"
		},
		{
			"post_id": 4,
			"title": "Censorship",
			"date_published": 1554339576.9,
			"body": "Censorship shouldn't happen. Of course I'm preaching to the choir on this platform... But regardless, society as a whole has nothing to gain in my opinion by censoring out information.\n\nThis hit hard and became very real to me when I initially heard about the New Zealand Mosque shootings recently. Unfortunately I read the news on the clearnet after a majority of the live streams had been removed. Luckily, I had also discovered ZeroNet shortly before this incident. When I was browsing through some of the conversations, I came across the raw video on ShareTube.\n\nHere's the link on ShareTube: [http://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/?watch=1552627778_1HUrXNQjRheQouoqpwcxoxokEBTyvFeq1M](http://127.0.0.1:43110/1Share3xUeAF71KTqcvFyfDu516kNDETx/?watch=1552627778_1HUrXNQjRheQouoqpwcxoxokEBTyvFeq1M)\n\nI didn't fully realize what it was until he started shooting. This hit hard because I had recently visited Jordan and Palestine and had spent plenty of time with Muslims. Most times I felt more comfortable and safe around the Muslims than I did while I was around Jews and Christians. That's hard to explain, but the general culture and traditions of the religion are peaceful.\n\nThen the bulk of the systematic removal of the live streams come on the clearnet. It becomes more or less illegal to host and store the video. So most people don't know or haven't seen the reality of the event. The pictures can only do some much. In this case the only thing I'd recommend is that there should be warnings in it because it is graphic. Kind of like Facebook's warnings. It still allows you to watch with no problem, it just makes you aware of the nature of the content.\n\nOtherwise, there's no gain from taking videos like these down and away from the public. I think that we should let those videos, articles, etc. make people hurt. Maybe my view is a little extreme or insensitive, but hear me out. When do people act? How do we get people to put their energy towards something? Make them care, make it personal, educate them, make it burn in their minds and hearts. I know the video did for me. With some content we can drive people into action.\n\nThis veered a bit from technical discussions, but I think it's still useful. Any thoughts?\n\nJaveli"
		},
		{
			"post_id": 3,
			"title": "Knee of the curve",
			"date_published": 1554268313.1,
			"body": "<span style=\"font-size:11.0pt;line-height:107%;\nfont-family:&quot;Calibri&quot;,sans-serif;mso-ascii-theme-font:minor-latin;mso-fareast-font-family:\nCalibri;mso-fareast-theme-font:minor-latin;mso-hansi-theme-font:minor-latin;\nmso-bidi-theme-font:minor-latin;mso-ansi-language:EN-US;mso-fareast-language:\nEN-US;mso-bidi-language:AR-SA\">In one of the books we read the author talks about this “knee of the curve” that we are entering. Arguably, we’ve been in this point for some time, but everything is getting faster. I think we are a crucial moment of both technological advances and ethical growth. With all of the prediction we can make, no one really knows where we are headed next. There has been so much growth in such little time and we’ve created issues within our technology. At some point humanity will need to take a step back and fix the issues that come along with growing quickly. Our technology could be more efficient since a lot of our progress has been made without the plan for the speed that technology is growing. These issues are not only technical and security related, but also ethical problems and cultures that have been allowed to persist and have been dragged along.</span>\n\n<span style=\"font-size:11.0pt;line-height:107%;\nfont-family:&quot;Calibri&quot;,sans-serif;mso-ascii-theme-font:minor-latin;mso-fareast-font-family:\nCalibri;mso-fareast-theme-font:minor-latin;mso-hansi-theme-font:minor-latin;\nmso-bidi-theme-font:minor-latin;mso-ansi-language:EN-US;mso-fareast-language:\nEN-US;mso-bidi-language:AR-SA\">This \"knee of the curve\" we are all in sometimes creates the need for platforms like ZeroNet and Tor. With privacy being given away for ease of use and cool new features, it's all the more important to maintain the privacy and uncensored nature that anonymity and decentralization presents.</span>"
		},
		{
			"post_id": 2,
			"title": "Introduction",
			"date_published": 1554267848.6,
			"body": "This blog will primarily be me sharing some thoughts from a personal development class I'm taking on computer ethics. In it we are watching various movies, reading a few books, and having group discussions on current and rising issues. Some topics we've already hit are A.I., exoskeleton suits, data privacy, whistle blowing, smart homes, etc.\n\nI'll try to keep the content in my posts as true as possible. Of course filtering out and generalizing things that might jeopardize my identity or privacy. Feel free to comment and ask questions. I'm always willing to discussion.\n\nBest,\n\nJaveli"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433030400,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}