{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565188740,
			"title": "8ch refugees welcome!",
			"body": "That's one nice freedom of speech you got there, where one single rich dude suddenly decides you are no longer allowed to be on the internet. It was well deserved you say? Maybe. Maybe not. The thing is, if they can do it to them, they can do it to everyone. That's how centralized power in todays internet really is. And it's getting worse.",
			"added": 1565188739
		}
	],
	"topic_vote": {
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"1565252472_1Avp8UHcU4e2F3LDSh66sRhs9G5zmbnQ7u": 1,
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1565148747_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 1,
				"body": "atm its faster than 8ch tho (just saying)",
				"added": 1565166994
			}
		],
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": [
			{
				"comment_id": 2,
				"body": "Just run over tor for now. In the long run, that might not be the ultimate solution, because torrenting over tor is bad. But zeronet is work in progress.",
				"added": 1565191152
			},
			{
				"comment_id": 3,
				"body": "> [unadu](#comment_2_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): Even more scarry is that the new CDN they used got shut down by their infrastructure provider.While every site can choose another CDN or run without CDN and you can switch as fast as a DNS update gets distributed, you can't do anything when some public company on the backbone decides to shut you down. [...]\n\nThat's why distributed, serverless operation needs to happen.",
				"added": 1565191750
			},
			{
				"comment_id": 4,
				"body": "> [unadu](#comment_3_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): is there some site where i can check my IP that i use to connect to other peers?So that i know that i know for sure that i am behind tor without my IP leaking for non-tor users?\n\nThere is no check.torproject.org for zeronet because that's not how it works. If you really want to make sure it's not leaking your id, I would suggest looking into something like whonix/tails/qubes or the like or just jail the zeronet process/user so there is no outgoing route for it. For a quick check, tcpdump/netstat should tell you all you need to know or may watch the connections your tor node makes (eg. nyx).",
				"added": 1565192036
			},
			{
				"comment_id": 5,
				"body": "> [unadu](#comment_4_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): Thank you, got it.One more question:Per default the P2P connections run through tor hidden service, except to peers that do not use Tor, if i set the Tor settings in zeronet to \"Always\"... what exactly happenes now to connections to peers without Tor?If they don't use Tor, they can't connect to my Tor hidden service that zeronet uses, so all connections to them are established from me towards them? [...]\n\nTor to tor connections run hidden service to hidden service. Tor to clearnet also run via tor - the connection for the clearnet peer looks like it's connecting to the exit node. Just not sure if it's invite only or if there are advanced nat traversing techniques applied or not.  In an ideal world, all nodes would be on hidden networks so nothing,  not even meta data or patterns which could be subject to correlation or deep package inspection would ever leak to the clearnet (atm they do if you connect to clearnet nodes).",
				"added": 1565216138
			}
		],
		"1565241348_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw": [
			{
				"comment_id": 6,
				"body": "If you have a real strong need for anonymity, your setup shouldn't have any permanent storage in the first place.",
				"added": 1565242901
			},
			{
				"comment_id": 7,
				"body": "> [nowotny](#comment_4_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw): How would you go about setting up a dynamic storage?\n\nEncrypt with a decent random key, newfs, mount, forget the key, repeat next time you boot your system.",
				"added": 1565254534
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 8,
				"body": "> [kaffie](#comment_883_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Being hateful does not mean you are free. Be careful not to fall into controlled opposition narratives. Hate, by it's nature, provides an inequality which combats true free speech. Yes, you can say hateful things by having free speech, but in practice you'd learn why hating people (especially in line with official narratives) is a poor choice. [...]\n\nCommunism owes me 20 years of my life because I've been there (unlike most of the  people glorifying it nowadays).",
				"added": 1565254904
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 9,
				"body": "Not even an actual 8channer nor a zeronet regular but I'm in for the lulz.",
				"added": 1565302845
			}
		],
		"1565305639_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 11,
				"body": "here comes the cruise control",
				"added": 1565306726
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "> [aspidochelone](#comment_14_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Despite the fearmongering, they seem to agree with everything else I saw that you're not serving any child porn that you didn't actually go and view. [...]\n\nCP is indeed the #1 FUD, followed by terror and drugs. Fear is how you control the unknowing.",
				"added": 1565332692
			}
		],
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 13,
				"body": "Can I have your stuff?",
				"added": 1565339611
			},
			{
				"comment_id": 15,
				"body": "> [rusnoob1](#comment_2_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): Free speech without netiquette was, is and will be garbage. Sooner or later every site needs moderation. Reddit idea is brilliant - users creates streams/channels and moderate it with friends or trusted users. Look at Voat and you see where free speech is going.Democracy doesnt work if IQ drops < 90\n\nI don't need rules as long as I got regular expressions and a killfile.",
				"added": 1565344854
			},
			{
				"comment_id": 16,
				"body": "> [rusnoob1](#comment_4_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): Everything needs a rules. Even if this is \"no rules\" rule.\n\nRules are because someone wants them to be. So if there is nobody who  wants a rule, it ceases to exist. TL;DR just stop asking for rules and they go away.",
				"added": 1565345468
			},
			{
				"comment_id": 17,
				"body": "> [rusnoob1](#comment_6_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): We shouldnt. It was right there from the very beginning of public internet and was called \"netiquette\" - boils down to simple \"dont be moron\". Sadly is dead now. The new norm is \"giva a man a mask, and he will show you his real face\"\n\nNah, the new cool is to join a working community and keep insisting they need a code of conduct.",
				"added": 1565345770
			}
		],
		"1565342542_16vtDQkRKY8atc9K3oCBTvMW1ojLLVxry5": [
			{
				"comment_id": 14,
				"body": "1GB? It's 2019 mate. We are talking TB now.",
				"added": 1565342775
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 18,
				"body": "Someone help me out with the reason they need to hide in the first place? Last time I checked, browsing 8chan wasn't illegal. On the contrary, collecting peoples adresses without consent is at least a violation of privacy and certainly a violation of the DSGVO within EU legislation.\nAlso, the best \"news\" still seems to be the one the \"journalist\" created - first get their readers all curious about zeronet, then presenting onlookers addresses as proof.",
				"added": 1565356365
			},
			{
				"comment_id": 20,
				"body": "> http://shoebat.com/2019/08/08/do-not-trust-zeronet-if-you-thought-8chan-was-bad-zeronet-is-a-hideous-trap/\narticle is so boomer, I can almost smell the monster ultra from over here",
				"added": 1565376510
			},
			{
				"comment_id": 21,
				"body": "> [nickwa](#comment_277_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Some users were paranoid(mostly Q people), saying the FBI lured them in.\n\nKek, into what? I mean given the 8chan siteowners record, getting their identities was just a matter of asking nicely.",
				"added": 1565376928
			}
		],
		"1565358483_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 19,
				"body": "And they are going to get their backdoored code into openssl&friends exactly how?",
				"added": 1565358808
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 22,
				"body": "Dutroux reloaded",
				"added": 1565532309
			}
		]
	},
	"comment_vote": {
		"1_1NA1GS8pXSCVWDD4ESfGXcfkcBnbV6zJMh": 1,
		"1_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"2_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"2_129uWu4oE98C98BFC2GoJGSq51RetSBP4f": 1,
		"618_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"11_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_1A39LR6nrsneGEpBV8GWQ7k6TnCTXNr5K3": 1,
		"11_1H12MuvP4JeeK74scutN2fbNbUbdSgZ1Lz": 1,
		"13_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT": 1,
		"912_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1
	}
}