{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"CloudAtCost Clean OS Reinstallation","body":"(Open the server's console via the Panel, and log in with whatever account.)\n(First, we download a netboot iPXE to boot into.)\n(Note: you can actually do this part via SSH, if you want to copy/paste the URL.)\n#cd /boot\n#wget -c \"https://boot.netboot.xyz/ipxe/netboot.xyz.lkrn\"\n\n(Reboot the server. Make sure we're using the Panel's console for this, so we can change boot options.)\n#shutdown -r now (Or hit the Ctrl+Alt+Del button in the top-right of console window.)\n(When the server reboots, keep pressing 'c' repeatedly during boot to get to grub commands.)\n\n(Tell the server to boot from the netboot iPXE we downloaded.)\n#linux16 /netboot.xyz.lkrn\n#boot\nThen press 'm' during the boot options, and select the \"Manual network configuration.\"\n\nJust use net0 as your network interface. (It's the default, so just hit Enter for that.)\nEnter your server's static IP address, netmask (255.255.255.0), default gateway, and DNS (8.8.8.8).\n(This info is all in the server's Panel details. (Hit the blue 'i' button on the server details.)\n\nThe server will then attempt to chainload the iPXE netboot.\n!!!Note that sometimes (often) it will time out.\n(This is fine. Just reboot the server, and try again. It can take multiple tries sometimes. Stick with it.)\nYou can then choose which OS to install. (It will download the distro straight from the official sites, and update it.)\n\nThis is all done within server memory, without using hard drive space.\nSo you can completely format your hard drive during installation. (Clean installs ftw.)\n\nSide note for Ubuntu: to get rid of that pesky PIIX4 SMBus Controller message on boot, just append this to /etc/modprobe.d/blacklist.conf:\nblacklist i2c_piix4\n(The error message is perfectly benign, so it's completely optional.)\n\n(Good luck; have fun.)","language":"text/plain","encrypted":false,"added":1565827322}],"comment":[]}