{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1560773982_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1544691845_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "Apologies if this is a bit wordy or overly descriptive. I like to keep these sorts of posts general so they may be beneficial to people other than the OP specifically.\n\nIf you're not anonymizing your IP at all then your main concern should probably be that you'll want to change all of those things at once if you at some point decide to mask your identity. I'd expect that IP to be considered a strong primary identifier (your ISP presumably knows who has it, since you're likely paying them for it directly) but anyone particularly interested in tracking as such will also associate it with the other characteristics listed. So, should you visit a site both now and, say, through a proxy later it will be possible to associate your current identity (IP, user name, etc.) with that session with a high level of confidence rather easily, especially if it turns out that that particular site has only ever had one user (you) with your specific fingerprint.\n\nThe Tor Browser Bundle will (barring shenanigans) mask your IP from sites and especially at its higher security settings helps prevent many types of fingerprinting, though I don't know if it will change content language. NoScript in general helps a lot, judging by the amount of \"JS disabled\" I see on these fingerprinting sites. Other tools of possible interest include VMs, live CD/DVD/USB distros, AnonSurf, distros like Parrot and Kali, any tools necessary for ensuring you won't run malicious code that will compromise or de-anonymize your system (pdfid for PDFs, for example), and if you intend to upload anything you've touched then metadata tools like mat2.\n\nOf course, whether you want to be anonymous or pseudonymous all the time is up to you. You can keep a secondary setup for doing things you wish kept private, just remember to present a very different fingerprint, preferably one that blends in and looks like any of n million other users so that fingerprint itself can't be tracked. Browsing habits, usernames, etc. all should also look nothing like your non-hidden ones.\n\nHopefully I haven't missed anything too interesting :)\n\nShort answer to the specific question asked: If you're not worried about hiding your IP then probably the main thing to worry about is giving away information that can be associated with it if you decide to later. A visible static IP already identifies you for tracking purposes at least as well as even a unique browser fingerprint.",
				"added": 1544697563
			},
			{
				"comment_id": 2,
				"body": "> [anonimoose](#comment_6_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): However, your full fingerprint is unique among the 914968 collected so far.  [...]\n\nI think that means the opposite of what you think it does. Being easily identified out of a group of nearly a million isn't indicative of safety.",
				"added": 1544712583
			},
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_39_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i have very similar uniqueness on MS Windows & latest Firefox. Anti-tracking test at https://panopticlick.eff.org shows i am unique among around 2.8 million tested in the past 45 days. Biggest uniqueness is in \"System Fonts\", followed by canvas fingerprint. Thinking how can i normalize my fingerprint and system fonts to be less unique, if it really matter.\n\nI just had a dig around and here's what I found.\nFirefox's resistFingerprinting option in about:config helps with many things. Tor Browser's is probably better. Both will spoof system fonts lists. Other browsers may have something similar, though as far as I know only Firefox and browsers based on it have much care for privacy built in.\nAlso for Firefox there's this addon, though resistFingerprinting seems to quiet Panopticlick, BrowserLeaks.com. and AmIUnique about the matter. For me this leaves WebGL (easily disabled in Firefox) and window size if I change from the default new window size. Unfortunately, probably everyone does change the window size so that still sticks out a bit.\nhttps://addons.mozilla.org/en-US/firefox/addon/canvasblocker/\n\nAs for Brave, trusting a browser built partly to track its users directly is certainly a choice a person could make. I wouldn't, since Firefox and Tor Browser are well known and trusted.\n\nOn the other hand, even these are just basic, general privacy precautions. There's a whole world of tracking tools out there keeping watch on who's saying what, who's listening to what, who's watching what, and so on. As always, it's up to you how much you care. Maybe you don't do anything more interesting than buying Japanese candy on Amazon and don't care if the whole world knows about it.",
				"added": 1544756957
			}
		],
		"1545064108_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "Are people worrying about tech from the US too?",
				"added": 1545075459
			},
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_41_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I have found this quotation about integral part of the modern Intel CPUs (Intel Management Engine): \"we have seen that Intel ME is potentially a very worrisome technology. We cannot know what’s really executing inside this co-processor, which is always on.\" a bit more details here\n\nThat's a good example of why there should be at least as much concern about US tech as Chinese. Software, hardware, all of it proprietary and *guess what* the US government wants to be just as invasive as the Chinese one. The US government has already given itself the power to make companies spy on people for them and they're constantly trying to force companies to be more \"cooperative.\" How are they less of a \"threat\" than China? This isn't even considering corporate interests outside of what their government compels them to do. Our world is already running on hardware compromised by *US* companies but no one \"important\" seems to mind that. They only worry when an *opposing* tyrannical regime \"might present a threat.\" Guess they think *their* \"big brother\" can do no wrong.\n\nPower plays its games but no matter who wins we lose.",
				"added": 1545164537
			}
		],
		"1545125003_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 6,
				"body": "These 'technologies' are disgusting idiocy defended by lies. They think these little 'features' are things everyone wants? They think it's worth building them into every chipset? People hardly even know this bullshit exists and they expect us to believe there's good reason to add some extra \"management\" hardware and software? How *generous* of them to give us \"more\" than we ever wanted just in case we decide to use it.\n\n...Then lock it all off where it can trivially invade our lives and prevent us from ever knowing... or telling anyone about it? Would we even know how much damage has been done through these things?",
				"added": 1545165089
			}
		],
		"1521970229_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 7,
				"body": "I2PMail and PGP?",
				"added": 1566658108
			}
		]
	},
	"comment_vote": {
		"11_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY": 1
	}
}