{
	"next_comment_id": 54,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [mama21mama](#comment_1_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt): \n> Supongo que zeromail tiene cifrado.\n\nSi, a mi tambien me lo parece, pero no podria asegurarlo, todavia no he mirado en la copia local de ZeroMail...",
			"post_id": 1,
			"date_added": 1457331701
		},
		{
			"comment_id": 2,
			"body": "> [solced](#comment_1_1Bubf8CnaA6DdK9xq19iHCGpACGdQZ6HsP): No tengo muy claro si la pregunta que voy a hacer tiene que ver estrictamente con los dominios. \n\nNo, ZeroID no tiene nada que ver con los dominios.\n\nZeroid es solo un seudonimo (o usuario) para usar en los diversos foros, chats y sitios en donde puedes opinar... si has conseguido opinar aqui, quiere decir que ya estas usando tu ZeroID. Tu ZeroID es **solced**.",
			"post_id": 7,
			"date_added": 1457466406
		},
		{
			"comment_id": 3,
			"body": "> [riotpulv](#comment_1_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): O puedes montar tu propio servicio de VPN, igual no creo que debamos desconfiar enteramente de los VPN comerciales, por ejemplo, un amigo tuyo puede tener un servicio y deseas comprarle y usarlo: Esa es la relación más cercana (si no, entonces ya valió verga internet y mejor no usarlo) y \"confiable\" (suponiendo que aquella empresa no se alimenta de capitales extraños) a la que se podría acceder. Además no todo mundo tiene el conocimiento por ejemplo para tener un cliente y un tracker onion a la vez... y la mula... bueno, está más focalizada en España y por eso mismo no es tan masiva :(\n\nEsta es mi opinion muy personal:\n\n1. Un servicio VPN comercial registrara TODOS tus movimientos en Internet (aunque te diga lo contrario), ya que al momento en que alguna autoridad de algun pais importante se lo requiera... NO dudara un segundo en delatarte.\n\n2. Un servicio VPN alojado en la maquina de un _amigo_ es aun + riesgoso, ya que seras identificable con mas facilidad aun.\n\n3. BitTorrent y la Mula funcionan 100% anonimamente en I2P: mira en http://geti2p.net\n\n4. Internet es el espacio/lugar mas controlado que existe actualmente.",
			"post_id": 5,
			"date_added": 1457466699
		},
		{
			"comment_id": 4,
			"body": "> [lordgault](#comment_1_1AYEfrTivq7GKNycX9NeTrF1Zazg6H7bdi): No se si es sitio adecuado para preguntar pero allá voy ¿existe algún cliente torrent que utilice la red Zero para descargar de forma anónima? Gracias.\n\nZeroNet no soporta aplicaciones fuera de la distribucion de contenidos en si... ",
			"post_id": 6,
			"date_added": 1457535945
		},
		{
			"comment_id": 5,
			"body": "> [solced](#comment_2_1Bubf8CnaA6DdK9xq19iHCGpACGdQZ6HsP): Lo que no entiendo es por qué no puedo utilizar este usuario desde 127.0.0.1 y tengo que irme a bit.no.com para poder dejar este mensaje.\n\nOk, ahora entiendo mejor tu problema... **no** te puedo dar una respuesta precisa, pero _supongo_ que el ID (ZeroID) esta conectado/asociado a algun parametro que se almacena en el nodo local de ZeroNet.\n\nSi usas ZeroNet a traves de un proxy (bit.no.com) implica que ese ID esta almacenado ahi y solo se podra usar desde ahi. Si has instalado ZeroNet localmente en tu PC, eso te genera otro par de llaves publico/privadas  (BTC) diferentes y no pueden asociarse al ID antiguo, a menos que importaras las llaves publico/privadas desde el otro nodo (bit.no.com)... puede ser que la explicacion sea + simple...",
			"post_id": 7,
			"date_added": 1457624953
		},
		{
			"comment_id": 6,
			"body": "> [solced](#comment_3_1Bubf8CnaA6DdK9xq19iHCGpACGdQZ6HsP): Esa hipótesis parece buena. ¿Se pueden importar las llaves?  ¿Sabes cómo se hace?\n\nSi, de seguro se pueden exportar/importar las llaves, pero NO se como.\n\n",
			"post_id": 7,
			"date_added": 1457679312
		},
		{
			"comment_id": 7,
			"body": "> [xikufrancesc](#comment_1_1NXas4VQNUb9Vgd6zW7E1xGPUCfcxSXBF5): Que bueno leer esto y gracias por la aportación, ir poco a poco conociendo bien para mejorar el dominio y contexto de la buena comunicación. Gracias.\n\nEs bueno saber que hay los que se puedan beneficiar :-)",
			"post_id": 14,
			"date_added": 1457715199
		},
		{
			"comment_id": 8,
			"body": "> [mama21mama](#comment_3_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt): \n> cd /home/mama/Descargas/ZeroNet-master\n> screen -fa -d -m python zeronet.py --tor disable\n> Descativando tor (cia) que este proyecto lo toma que todo tor entre a tu sitio.\n\nNo estoy muy seguro, pero al desactivar Tor, solo le impides a tu nodo NO usarlo... NO impides que nodos en Tor puedan visitar el tuyo.\n\nYo mismo (creo y espero) tener mi nodo 100% oculto (hidden) en Tor y aun asi puedo visitarte...",
			"post_id": 14,
			"date_added": 1457716416
		},
		{
			"comment_id": 9,
			"body": "> [mama21mama](#comment_4_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt): tomas de otros pares mi blog pero no directamente. Tor no entra en mi blog.\n\nY cual es la razon para \"censurar\" Tor?",
			"post_id": 14,
			"date_added": 1457722769
		},
		{
			"comment_id": 10,
			"body": "> [mama21mama](#comment_5_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt): Impedir que computadoras de la cia indexen mi sitio.\n\nPero tener un sitio fuera de una red anonima... no lo hace aun mas facil de ser indexado?\n\nSi lo piensas un poco mas... no seria logico u obvio que **todos** los sitos abiertos ya esten siendo indexados activamente? Mientras que los sitios en las redes invisibles estan mas protegidos... o no?",
			"post_id": 14,
			"date_added": 1457861523
		},
		{
			"comment_id": 11,
			"body": "> [lao](#comment_1_12gppTfEoyX6PuQV1bZqoseLmk2Sn4eMtJ): En la medida en que tor es software libre \n\nCierto, tienes razon. La WWW tiene el mismo origen, pero toma en cuenta que en universidades europeas tambien se estaba trabajando en proyectos bastante similares. Los americanos solo fueron los primeros.\n\nRecordemos los problemas que se dieron a causa de las supuestas aportaciones de codigo que hizo la NSA al kernel de linux... que gracias a las aportaciones de Snowden... se comenzaron a \"auditar\" y se encontraron nada menos varias puertas traseras... años despues. Y (creo) con eso se le prohibio a la NSA seguir participando de la Linux Foundation.\n\n**En cuanto a la fundacion Tor, aunque la NSA no participa, aun asi... el propio Snowden nos abrio los ojos: _Todos los Exit Nodes son monitorizados_... una cantidad indeterminada de nodos internos son camuflados... de tal forma que los usuarios que usan Tor para navegar por la WWW son identificados muy rapidamente... la NSA solo necesita entre algunos dias y hasta 6 meses para conseguirlo... dependiendo de los cuidados que tenga cada usuario**.\n\nEl software libre nos protege de poder usar, compartir, modificar y/o usar parte de su codigo en otros proyectos... pero NO nos defiende en contra de las agencias de espionaje y seguridad.",
			"post_id": 20,
			"date_added": 1457941879
		},
		{
			"comment_id": 12,
			"body": "> [mama21mama]\n\nMuchas gracias!!!",
			"post_id": 19,
			"date_added": 1458048415
		},
		{
			"comment_id": 13,
			"body": "> [lao](#comment_2_12gppTfEoyX6PuQV1bZqoseLmk2Sn4eMtJ): Hace tiempo que instalé I2P por última vez, pero leyendo tu artículo me han dado ganas de volverlo a probar. Gracias :)\n\nOjala te animes a volver ;-)\n\nGracias por el aporte!!",
			"post_id": 23,
			"date_added": 1458063180
		},
		{
			"comment_id": 14,
			"body": "> [lao](#comment_4_12gppTfEoyX6PuQV1bZqoseLmk2Sn4eMtJ): > En cuanto al listado que aportas, veo que falta SAFE:https://forobits.com/t/maidsafe-hilo-general/no conozco mucho, hace poco alguien me habló de ella y parece interesante también.\n\nLa verdad es que la lista de proyectos que he mensionado antes es apenas un 10% o menos del total que actualmente estan en desarrollo o ya estan en uso.\n\n> Por cierto, también fui usuario de Retroshare una temporada pero indagando el otro día sobre su estado, me pareció que está algo abandonado el proyecto. \n\nCuidado. RS **no** esta para nada abandonado. Recien ahora en febrero se acaba de lanzar oficialmente la version 0.6, que como novedad trae soporte para **I2P** y muchas otras sorpresas...\n\nSi, ya te puedes imaginar que pronto tambien tengo pensado escribir algo al respecto.",
			"post_id": 25,
			"date_added": 1458111630
		},
		{
			"comment_id": 15,
			"body": "> [xikufrancesc](#comment_2_1NXas4VQNUb9Vgd6zW7E1xGPUCfcxSXBF5): Quizás cuantos mas ejemplo prácticos se muestren como proceder en un enlace p2p no abierto, mas fácil y mas se animarán en probar. Saludos.\n\nNo se ha que te refieres exactamente.\n\nAntes de escribirte una respuesta me lo he pensado varias veces y la verdad es que no consegui entenderte del todo.\n\nHaber si me aclaro: _**A que te refieres con \"ejemplos de P2P Anonimo\"?**_\n\nEn cuanto al P2P, ya he escrito algunas cosas y pienso seguir tocando el tema en el futuro.\n\nGracias por tu interes.",
			"post_id": 27,
			"date_added": 1458427710
		},
		{
			"comment_id": 16,
			"body": "> [ana](#comment_1_1ALwoMDS9yUytLfFjRM9eUytgcgB68cYZG): Hola! Me alegra ver que ya hay gente de la comunidad de GNU/Linux por aquí... :D\n\nSip, aunque parezca que somos muy pocos, la verdad es que muchos usuarios de Linux, simplemente prefieren quedarse en el anonimato.",
			"post_id": 41,
			"date_added": 1459673163
		},
		{
			"comment_id": 17,
			"body": "> [antiposmos](#comment_1_13xeefPxhcVXmsxQer6zQinHKipgTU7CAA): Hola.Muy interesante tu blog, ¡te felicito!\n\nMuchas gracias!\n\n> [antiposmos](#comment_1_13xeefPxhcVXmsxQer6zQinHKipgTU7CAA): \"Tus votos están asociados a tu ZeroID, ellos son seudónimos, pero no anónimos. Con un poco de trabajo alguien puede averiguar lo que tú (tu ZeroID) has votado.\"\n\nCierto, la verdad es que tu traduccion es mucho mejor que la mia... la verdad es que tampoco quise hacer una de forma literal y por eso mismo puse \"Traducido, siginifica _mas o menos_\".\n\n> [antiposmos](#comment_1_13xeefPxhcVXmsxQer6zQinHKipgTU7CAA): ...El seudonimato no es algo que en las redes necesariamente ponga en peligro nuestro anonimato... Es posible decir que el pseudonimato puede ser anonimato. Lo que a lo mejor se refiere la oración con \"anonimato\" es a la ausencia de \"nombre registrado\" (en general) o de \"asociación de otros datos con el usuario que vota\". Es un asunto interesante, para conversar largo rato, ¿verdad? Saludos.\n\nDesde mi punto de vista, el anonimato y la privacidad se diferencian en un solo punto: A quien protegen.\n\nLa privacidad protege al mensaje y al canal que se usa en una comunicacion entre dos o mas personas. El anonimato protege a los participantes de la comunicacion.\n\nZeronet es una red que se concentra en la privacidad. Desde fuera de la red, es casi imposible conocer o descubrir los contenidos que circulan por ZN. Y si en caso de llegar a conocerlos, es casi imposible impedir que se mantengan en linea.\n\nEl problema es que ZN tiene muy pocas herramientas para proteger a sus participantes; y ZeroID las debilita aun mas. ZN usa JS, que de por si es un gran enemigo de la proteccion de datos... a eso se agrega, que ZeroID te encadena a una identidad... es decir, si quiero dejar mi opinion en varios espacios diferentes (con diferentes temas) de ZN, con solo enlazarlos entre ellos, alguien que tenga conocimientos del tema, puede crear un perfil de mi, que con algo de analisis y como dijo [erkan] y en el sitio de ZeroPoll se puede descubrir quien soy (esto es solo un ejemplo).\n\nEn mi opinion, prefiero una red completamente anonima y privada, que me proteja a mi y a mis datos.\n\nSi tu crees, que la proteccion que da la privacidad es suficiente, es una eleccion personal.",
			"post_id": 42,
			"date_added": 1459779897
		},
		{
			"comment_id": 18,
			"body": "> [antiposmos](#comment_3_13xeefPxhcVXmsxQer6zQinHKipgTU7CAA): ¿(1) quieres anonimato respecto de tus contactos o (2) respecto de tu ISP? \n\nGracias, muchas gracias!\n\nLa verdad es que no me habia planteado esas dos preguntas/perspectivas y _comparto tu opinion_.\n\nEs verdad en principio, que el optar por un nodo invisible, el primer objetivo es neutralizar a los ISPs (y las NSAs)... pero la poca cantidad de usuarios de RS, tambien te obliga a aceptar contactos que no son amigos, pero que necesitas para tener acceso a los recursos de la red.\n\nSi se escogiese solo a amigos, entonces todos seriamos islas. Mientras RS no alcance la popularidad de Firefox o eMule, estaremos obligados a confiar en los otros.\n\nTambien coincido en que RS podria ahorrarse algunos servicios... foros y canales? e-mail y chat privado? Y tambien esta la maraña de configuraciones posibles... ufff",
			"post_id": 38,
			"date_added": 1459781596
		},
		{
			"comment_id": 19,
			"body": "> [nikkus](#comment_3_19a51UMcWozeoBFiXmhWbyQWQzygqKpPyW): Yo, como tengo dupla nacionalidad, considero que mis dos paises se estan radicalizando, uno para la \"derecha\" y el otro para la \"izquierda\"... \n\nNo conozco ningun pais en Europa que halla girado hacia la izquierda... a lo sumo, Portugal o Grecia apenas se han quedado en la Social Democracia de los 60s.\n\n> [nikkus](#comment_3_19a51UMcWozeoBFiXmhWbyQWQzygqKpPyW): Yo, Considero que los extremos nunca son buenos. De igual manera que considero un grave error, que todos pagaremos futuramente, \n\nCierto, los extremos son malos...\n\nEs por eso que considero que el _poder_ deberia estar tan distribuido como fuera posible y que _ninguna_ empresa, organizacion o institucion estatal debiera tener mas _poder_ que el mismo numero de ciudadanos que lo componen.\n\n_Una persona, un voto es simplemente una ilusion_.",
			"post_id": 57,
			"date_added": 1460371100
		},
		{
			"comment_id": 20,
			"body": "> [nikkus](#comment_5_19a51UMcWozeoBFiXmhWbyQWQzygqKpPyW): Es solo el principio...\n\nLamentablemente se me olvido exponer un detalle muy importante de la noticia: \n\n_Todas las señales o radioseñales (que tambien implican las de **WLAN**) ya no podran ser usadas por ningun dispositivo que no este certificado._\n\nEjemplo: Los firmwares libres como Tomato, DD-WRT, OpenWRT o cualquiera de los que aparecen en esta [lista](https://en.wikipedia.org/wiki/List_of_router_firmware_projects)... estaran **_prohibidos_**.",
			"post_id": 61,
			"date_added": 1460966663
		},
		{
			"comment_id": 21,
			"body": "> [epoch](#comment_1_1ALHyxaNjL7txuopaMJ8fAg6WF1DEZCFe9): Yo uso OpenVPN que depende del archivo.ovpn que cargues\n\nSi OpenVPN es probablemente la mejor aplicacion para tuneles cifrados... pero NI el te protegera en contra de la empresa (o NSA) que te da el servicio VPN.",
			"post_id": 76,
			"date_added": 1461313185
		},
		{
			"comment_id": 22,
			"body": "> [brkaka](#comment_1_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3):  Ese BitMessage es viejo e los desarrolladores están trabajando aquí hasta que se funden los dos.\n\nMuchas gracias @brkaka habia olvidado completamente que habia ese **fork** mejorado.",
			"post_id": 90,
			"date_added": 1461647764
		},
		{
			"comment_id": 24,
			"body": "> [neflyte49](#comment_2_1AkE5mjeYRiQLGF8Q6NmGvpkm1kk1R6zMe): Que sitios te piden 500 megas o mas?\n\nPor ejemplo: 1BLuish1ZbwVfPaCSDVQkg5WW58hqEoYQw",
			"post_id": 88,
			"date_added": 1461830885
		},
		{
			"comment_id": 25,
			"body": "> [cudam](#comment_1_1MBZrgSwMQMRnMFjQkw2JpwdWRaKo7Eb55): Espero que sigas publicando ;)\n\nAsi lo intentare :-D",
			"post_id": 102,
			"date_added": 1462868241
		},
		{
			"comment_id": 26,
			"body": "> [riotpulv](#comment_2_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): He visto un video sobre zeronet y curiosamente los que hablan en este video desenfocan este blog como contenido pornográfico y/o ilegal https://www.youtube.com/watch?v=m__k4CShldM\n\nMala publicidad es mejor que nada... quisas mas gente se anime a pasar por aqui.",
			"post_id": 114,
			"date_added": 1474960851
		},
		{
			"comment_id": 28,
			"body": "> [lekamor](#comment_1_18T3Erq9Tk7VRPVgvufTNTWjXEVMrpRm1W): Que bien lo probare sigue aportando cada dia, hay gente que te lee\n\nEso espero ;)",
			"post_id": 125,
			"date_added": 1475886817
		},
		{
			"comment_id": 29,
			"body": "Test",
			"post_id": 1,
			"date_added": 1476038522
		},
		{
			"comment_id": 30,
			"body": "> [cer](#comment_29_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Test\n\ntest",
			"post_id": 1,
			"date_added": 1476039358
		},
		{
			"comment_id": 31,
			"body": "> [riotpulv](#comment_4_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): Pues en vista de que existe la posibilidad de crear IDs diferentes a los centrales...\n\nSi, tienes razon, solo que los otros IDs se pueden usar en apenas 3 o 4 sitios... nada mas.\n\n",
			"post_id": 130,
			"date_added": 1476469346
		},
		{
			"comment_id": 32,
			"body": "> [riotpulv](#comment_5_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): He escuchado otra crítica en el sentido psíquico: un antisocial hacker con problemas mentales serios intenta salvar el mundo, pero como es loco y antisocial es muy inofensivo y su tarea filántropa es parte de su comportamiento alejado de la \"normalidad\".\n\nEsa si me ha gustado mucho... y no tan deformada como mi opinion ;)",
			"post_id": 131,
			"date_added": 1476470259
		},
		{
			"comment_id": 33,
			"body": "Test, aqui vamos a hacer otro test! 123",
			"post_id": 111,
			"date_added": 1478807285
		},
		{
			"comment_id": 35,
			"body": "> [eibriel](#comment_1_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Gracias por agregar mi blog! ^^\n\nGracias a ti por decidirte a crear tu propio Blog :)",
			"post_id": 209,
			"date_added": 1478864162
		},
		{
			"comment_id": 36,
			"body": "> [juansantiago](#comment_3_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): documenta porfa eso de como administrar los cometarios.\n\nListo, gracias por tu interes!",
			"post_id": 210,
			"date_added": 1479056349
		},
		{
			"comment_id": 37,
			"body": "> [juansantiago](#comment_2_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): POsdata lectura recomendada: _La carta perdida, Edgar Alan Poe_\n\nHaber si lo tengo en mi biblioteca... gracias!!!\n\nAhora estoy leyendo el libro de Assange... despues escribire alguna entrada al respecto.",
			"post_id": 212,
			"date_added": 1479140030
		},
		{
			"comment_id": 38,
			"body": "> [juansantiago](#comment_5_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): Bueno, no olvides que spydroid no es GNU pero si linux, sin duda la peor distro linux, una asquerosa utilización del kernel linux, por lo tanto...\n\nJustamente no habia pensado en Spydroid... sino en Linux Arch o algo parecido",
			"post_id": 214,
			"date_added": 1479230432
		},
		{
			"comment_id": 39,
			"body": "> [eibriel](#comment_4_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Medio offtopic, pero como hacés para calcular el \"leído por última vez hace X minutos\"? Es storage local?\n\nSupongo que es una funcion interna de JS, que la deberias encontrar bajo js/all.js. Yo no se nada de este lenguaje, solo mire el contenido y traduje lo que me parecio + logico, para que al menos apareciera en cristiano :)",
			"post_id": 220,
			"date_added": 1479642097
		},
		{
			"comment_id": 40,
			"body": "> [juansantiago](#comment_2_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): <i>lectura recomendada: La carta perdida, Edgar Alan Poe</i>\n\nJa ja ja... ese relato de E. A. Poe realmente no lo conocia, pero no me sorprendio realmente... aunque me parece que exagera en su exposicion sobre las supuestas contradicciones entre _matematicos_ y ...mmmm... ¿como fue que les llama?, _logicos_ (o algo asi) y tambien los _poetas_. Eso se lo podria haber ahorrado o al menos reducido un poco la complejidad.\n\nEl relato lo encontre bajo el titulo \"_La carta robada_\"",
			"post_id": 212,
			"date_added": 1479715044
		},
		{
			"comment_id": 41,
			"body": "> [juansantiago](#comment_8_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): Uno de los más formidables ... fue ... Aaron Swartz ...\n\nSi mal no recuerdo, ademas fue miembro fundador de REDDIT o ¿me equivoco? Y no hay que olvidar, que como en el caso de cierto periodista a finales de los 70s (por caso contras + drogas + CIA) Swartz fue acosado hasta el suicidio...",
			"post_id": 223,
			"date_added": 1479919659
		},
		{
			"comment_id": 42,
			"body": "> [eibriel](#comment_7_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): \n> »siempre está el factor novedad que hace que las cosas \"exploten\" y después se estabilicen...«\n\n\n\nCierto! \n\n\n\nHe observado que las aplicaciones o servicios que consiguen superar cierto umbral, conseguiran tambien sobrevivir en el tiempo. Aunque pierdan o desaceleren el crecimiento se consideraran lo suficientemente fuertes para seguir existiendo. \n\n\n\nEspero que 0Net lo consiga o ya lo halla conseguido. De lo contrario, necesitara de otra gran revolucion, otro 0Me.",
			"post_id": 283,
			"date_added": 1481398237
		},
		{
			"comment_id": 43,
			"body": "> [juansantiago](#comment_10_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i): Podemos elegir nuestro menú mconlads y como dice Galeano, podemos elegir con que salsa nos han de comer, pero eso de que no nos cocinen no es opción.\n\nJajajaja... Galeano siempre tuvo una respuesta precisa para temas que muchos ocultan",
			"post_id": 281,
			"date_added": 1482149350
		},
		{
			"comment_id": 44,
			"body": "> [eibriel](#comment_8_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): En latinoamérica también hay un resurgimiento de los NeoNazis...\n\nEl NeoNazismo en America (a excepcion de USA) se puede considerar un problema muy aislado... nunca han conseguido sobrepasar el 0,00001% del interes... solo sus acciones desmedidas reciben mas atencion. Cada 2 o 3 años aparece alguna noticia en ese sentido...\n\n> [topnep](#comment_1_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ): »no el de unos supuestos neonazis«\n\n_eibriel_, es justamente esta la actitud ciega y manejada x los medios, la que ayuda a esos cabezas rapadas o imbeciles a ganar simpatia y hacer sus canalladas: En Polonia, Hungria, Ucrania, la r. Checa ya estan en el gobierno... en Holanda, Francia, Austria, Suecia... ya son la segunda fuerza politica... y todavia NO son considerados un problema!\n\n¿Vamos a esperar que alguno de esos idiotas tome el poder en Alemania o USA para que el mundo si se preocupe?",
			"post_id": 291,
			"date_added": 1482149831
		},
		{
			"comment_id": 45,
			"body": "> [webdiegotcozer](#comment_1_1PycpCs1trJgLPSMNt2CvTVFrzf8oJ8GTs): Hola\n> Cómo rayos clono un sitio?\n> Porque mira: http://screencast.com/t/UAXKloIqKlJy\n> En ningún lado te deja clonar\n\nNo todos los sitios dejan clonarse.\n\n> [webdiegotcozer](#comment_1_1PycpCs1trJgLPSMNt2CvTVFrzf8oJ8GTs):  Y otra cosa: Sabes en donde puedo poner mi queja? Es decir, alguien de la comunidad que pueda hacer que Zeronet sea fácil e intuitiva? Donde está el botón clonar, crear website, comprar dominio, subir archivo?\n> No hay nada ;( creo que lloraré jeje\n> Al parecer zeronet solo es de geeks pero los de a pie todavía tenemos que esperar un par de años\n\nLa verdad es que zeronet es un desarrollo colaborativo, producido con el esfuerzo de la comunidad... quisas la primera version fue el resultado de un solo devs, pero desde entonces han aportando codigo un sinnumero de voluntarios anonimos (y los no tantos). Creo que de a poco se volvera mas y mas simple, pero es un desarrollo que lleva su tiempo.\n\n> [m3nda](#comment_1_1Phski1AngzFsFbArVPtYW9azGMY719jTC): Que anda constando en Namecoins el .bit?? ¿Se puede pagar minando un poquito o lleva más trabajo? A mi me interesa mucho ZeroNet y si se puede ayudar comprando los dominios .bit lo haría. Estoy hasta los huevos de pagar 9€ anuales por un dominio que a veces ni voy a usar :V y me interesa probar esto. A modo alternativa, he sustituido por uno nuevo en hg-pages de github, usando Jekyll. Te dan 1Gb y puedes subir ficheros de al menos 50Mb, para un blog es genial y no hay que comprar un dominio ni nada, tienes una como por ejemplo erm3nda.github.io ;)\n\nLa verdad, es que no se exactamente cuanto cuesta un dominio `.bit`, pero recuerdo vagamente algo asi como 30 centavos de euro... comparado con un dominio tradicional es realmente no comparable.\n\nY si, si puedes minarlos... eso de todas maneras.",
			"post_id": 16,
			"date_added": 1482248443
		},
		{
			"comment_id": 46,
			"body": "> [eibriel](#comment_9_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Listo! agregado a mi Chatbot: http://127.0.0.1:43110/1AeCt2VSk9NR1nGvegkunUpDvHtgsJ5dNj/\n> Mi consulta, ¿Por qué en accepted_domains hay solo 2 IDs y en cert_signers hay 4?\n\nEso no es ningun problema, ni error... veras que si alguien intenta usar otro ID seguira funcionando. La cuestion es simple (asi me lo explicaron a mi), solo es una cuestion de prioridades. Lo que realmente importa es la linea `\"accept_any\": true`",
			"post_id": 295,
			"date_added": 1482267022
		},
		{
			"comment_id": 47,
			"body": "> [topnep](#comment_2_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ): Desde que escribí el mensaje anterior, un musulman ha atropellado a un montón de personas en Berlín.Aun estoy esperando un ataque terrorista del mismo calibre por parte de neonazis.\n\n---\n\n## Datos _**solo**_ en Alemania (año 2015)\n\nAtaques a Refugiados y/o Residencias de Refugiados: 1832\nAtaques directos a Refugiados: 348\nAtaques Incendiarios a las residencias: 103\nOtro tipo de ataques (Piedras, Fuegos artificiales, disparos, etc.): 1381\nVictimas por los ataques a Refugiados: 458\n\nFuente: http://mut-gegen-rechte-gewalt.de/service/chronik-vorfaelle\n\nAqui no se incluyen, ni los ataques a grupos de izquierda, ni periodistas, ni de DDHH... y solo en uno de los paises comunitarios...\n\nAyer vi un documental sobre el tema... _¿Europa esta doblando a la Ultra-Derecha?_ en donde mostraban cuasi campos de concentracion que se han ido creando en Hungria con sus _propios_ compatriotas de origen \"extranjero\"... o que en la Rep. Checa los NeoNazis hacen verdaderas fiestas en las calles, persiguiendo y golpeando a cualquiera que se vea diferente... y como la actual presidenta tiene una tendencia muy tolerante... no reciben castigo alguno... y para que hablar de Ucrania, en donde los NeoNazis ha realizado verdaderas cacerias... bajo las narices de la UE...",
			"post_id": 291,
			"date_added": 1482335140
		},
		{
			"comment_id": 48,
			"body": "> [begica](#comment_1_1QDdn9mZ9vpsSLCqdfuUvnKnUi4xT58SGb): QUE ES MAS SEGURO??? \n\nFreenet es mas Seguro, consume menos almacenamiento (ya que nosotros decidimos cuanto asignarle y no depende del numero de sitios que visitamos), es 100% anonimo... y muchas cosas dañinas de la web estan desactivadas: JS, Java, WebRTC, Flash, PDF, etc.\n\n> [begica](#comment_1_1QDdn9mZ9vpsSLCqdfuUvnKnUi4xT58SGb): ...pero como veo esta en pena mi privacidad, como solucionarlo?\n\nHay puntos que se pueden mejorar... ya he escrito varias entradas en este blog que los explican",
			"post_id": 294,
			"date_added": 1482568103
		},
		{
			"comment_id": 49,
			"body": "> [rapapobre](#comment_3_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): sabes algo de este servicio?\n\nSera [este](/Stats) ? Si es algun servicio exclusivo para los nodos Tor, no te puedo ayudar, ya que no lo conozco.\n\nSi solo te interesa saber que nodos y donde se encuentran... eso sera aun mas dificil.\n\n",
			"post_id": 204,
			"date_added": 1484296469
		},
		{
			"comment_id": 50,
			"body": "> [martinv](#comment_1_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj): http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj/1484096314\n\nGracias Martin! \n\nLo habia perdido de vista y no lo encontraba. Y ahora que mire un poco mas, encontre unas entradas antiguas parecidas aqui mismo.",
			"post_id": 302,
			"date_added": 1484350288
		},
		{
			"comment_id": 51,
			"body": "> [maew](#comment_1_1Ke91Z2HzexABP9QZHoeps8shA62qNwCRa): pero Friendica es compatible con diaspora no?\n\nPor lo mismo, si puedes usar Friendica, que es cuasi universal, ¿para que molestarte con Diaspora?",
			"post_id": 315,
			"date_added": 1485026545
		},
		{
			"comment_id": 52,
			"body": "> [limozero](#comment_1_1BehrXRhf9ai6DJQXgLsU6UZ5BeowDGVy1): Yo creo que tiene que ver con el nivel de ocupacion. El trafico que reciben las antenas de telefonia debe ser transferido a través de una red troncal de enlaces. Esta red troncal tiene limites y requiere dinero para ser mantenida.\n\nLa infraestructura ya esta disponible. Si se usa o no, los ISPs deben mantenerla, los costos para ellos son cuasi fijos.\n\nAunque fuera todos los costos variables, aun asi queda otra opcion: Las ISPs conocen bastante bien el comportamiento de los clientes y saben, que en total (todos juntos) consumen X Tbits de datos mensuales... por que no simplemente dividirlos por 30 y ofrecer una tarifa plana a una velocidad incluso por debajo del promedio, pero constante!\n\nCasi todos los usuarios que conozco (incluyendome), estarian satisfechos con una conexion de entre 256Kbs y 512kbs.\n\nSoñar es lo unico que no cuesta... todavia.",
			"post_id": 317,
			"date_added": 1497556602
		},
		{
			"comment_id": 53,
			"body": "A mi no me molesta, ni me incomoda que hagas eso. Spamea todo lo que quieras la 0net.\n\nPero de seguro no podrias hacer lo mismo en Freenet + WoT.",
			"post_id": 322,
			"date_added": 1507740085
		}
	],
	"comment_vote": {},
	"post_vote": {
		"1": 1,
		"2": 1,
		"27": 1,
		"115": 1,
		"131": 1,
		"151": 1,
		"202": 1,
		"203": 1,
		"206": 1,
		"208": 1,
		"215": 1,
		"221": 1,
		"223": 1,
		"294": 1,
		"302": 1,
		"318": 1,
		"319": 1,
		"320": 1,
		"321": 1
	}
}