{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1527003512,
			"title": "Censorship on ZN - how to access older versions / fork?",
			"body": "The two galleries at /17xRnYBMYGv3gCEQ5Pvc1iAT1GFL5YA92t/ and\n/1PjvhPBiBifdxrEEsRqgDpzi23zAeUt2TY/ got censored, likely by the site's owner or someone in control of their PC. It mentions some concern over re-sharing files elsewhere - go check it out.\n\nI'm a little amused by the irony involved, but also confused by the ZN UI. So how does one now call up the uncensored version of this site on this censorship-resistant network, or even fork the whole site?",
			"added": 1527003511
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1527003512_13mmQytg34syftQYB5eFFMA9ATsGGmjk46": [
			{
				"comment_id": 1,
				"body": "I get that the owner has control over what appears under a certain identifier.\n\nBut this is one of the obvious methods of censorship, a site gets taken down by means of pressuring its owner to do so, or by the owner censoring [sections of] it.\n\nThe question still is, how do you access older versions of the site or fork it? It doesn't need to appear under the same identifier. Seems also important to have to keep sites maintained over time.",
				"added": 1527015611
			},
			{
				"comment_id": 2,
				"body": "> [thunder33345](#comment_88_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): you cant, that's only possible if someone archived or saved an older version as of now\nWow. That's sounds like a giant oversight. Enables the most obvious methods people always have censored content with and it also makes it opaque that censorship is happening when it is happening.\n\n> [thunder33345](#comment_88_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): tho i dont really get why the owner in this case want to remove said sites\nMe neither. But even with just this example I find it pretty obviou sthat we'll just be facing all combined reasons why sites may get censored.\n\nSeems to me like ZN needs a version history and general ability to fork every site in every version. Should also help some with saving sites that become unmaintained, right?",
				"added": 1527017941
			},
			{
				"comment_id": 3,
				"body": "> [thunder33345](#comment_89_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): you can \"fork\" by saving the current site as a zip, afaik in the bleeding edge built rn\nThat's a start, but I'd think the whole thing should use the distributed mirrored copies to keep the version history [particularly with people who decided to mirror it all], no?\n\n> [thunder33345](#comment_89_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): tho maybe something about githistory, where peers will keep something like a gitlog of each changes, to prevent repeat saving unnecessary data, and easy reverts shall anything happen, but this relies on peers to be bothered to save the history\nI honestly thought that would happen automatically. People who just visit store up to the site storage limit, and people who mirror store the whole thing. I didn't think you can affect the mirrored copies.\n\n> [thunder33345](#comment_89_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): to start we will can make a plugin \nOh, I wasn't even aware I was talking to a dev before. Silly me. But yea, that sounds like an interesting start.\n\nMay I suggest having a look at bup or borgbackup's method in case you need ideas? There are a bunch of adaptations of git for binary storage like that.\n\n> [thunder33345](#comment_89_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): (random note you cant archive tor because source code is behind a server, you can archive everything with zeronet because all code and data client sided)\nYea, and I personally think that should be a feature. Quick warning: We can be almost sure that the people who wanted \"private bits\" in torrents / private tracker sites will not like it when information is \"that\" free and easy to clone.\nThey pop up every time. They also did with git and everything else. You'll have to figure out what you want to do. \n\nPersonally, I believe that the ability to clone and fork sites is important to keeping them alive and making it hard to censor. They at least should be encouraged, if not the only type of site (because honestly, what keeps anyone from crawling and cloning them except extra effort?)",
				"added": 1527020086
			},
			{
				"comment_id": 4,
				"body": "> [krixano](#comment_449_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): We can clone and fork zites. It's just not automatic. You have to do it manually.\nI see. But in context, the important bit was whether you can do it *after* you notice something went wrong.\n\nRight now, censorship or malicious changes \"instantly\" propagate and almost or entirely all copies will be censored before anyone notices. That is really dangerous.\n\nIt'll be already hard to prove to most users some censorship happened, never mind to identify the most recent viable backup from some user and the make sure the replacement itself isn't censored. If put up replacement galleries, could you actually tell if they were complete or accurate as-is right now?\n\n> [blazar](#comment_25_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83): What zite owner doing with his zite is not your concern. \nIf you want censorship-resistance, I believe it is our concern what other people's zites do. \n\nResisting censorship is certainly mostly about keeping information from elsewhere intact. If someone destroys or maliciously alters the statements by or censors half the users on this forum, it won't really do to say \"oh well, it was just their zite\". We (as in, at least the people retaining sufficient data to do so - the people with full mirrors and the people that just have enough MB of data stored to cover these recent changes) need to be able to identify it happened and be able to fork, and everyone probably should even be able to tell it was a \"valid\" fork as in identical with it being the zite x versions ago when it was still \"good\".",
				"added": 1527083581
			},
			{
				"comment_id": 5,
				"body": "> [krixano](#comment_452_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): when using the ZeroNet clone feature\nRight. I perhaps should have explicitly stated I don't see us doing this via the \"Hello ZeroNet\" clone button, meticulously doing clones - and only for zites that explicitly enable it no less. [Did you really click that clone button in time to still catch a good version close to the time before it went wrong so you have the last good version after it went wrong? For all sites? Would you catch it if the last 50 good posts happened three minutes before the site was censored as a reaction?.]\n\nWhat propagates automatically and dangerously without log and history is the is the \"download\" and help distribute feature and the partial variant with the storage limit for locally mirrored files [I don't know how it's accurately called in ZN terminology - local file mirror?].\nThat's where I think \"almost or entirely all copies\" factually are, and that's probably where we should have a version history and the ability to fork.",
				"added": 1527119268
			}
		]
	},
	"comment_vote": {
		"92_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}