{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1514798211,
			"title": "Animation (JS) troubles with a new Site",
			"body": "I'm working on a site but wanted to use animations. I've seen it used in other ZN sites. Locally the animation performs correctly (a box that slides from off the screen into the middle of the page).\n\nWhen I transfer the files to the correct folder and Update the files I load the site normally by opening the URL. The page loads but doesn't seem to recognize the JS or CSS files. The box doesn't even appear at all. I placed a second box below it that does nothing and that box appears.\n\nI read in documents something about how all JS and CSS may have to be in all.css and all.js files but I've tried that and it didn't work for me (copy and pasted all the js and css files into two separate files (as stated in the docs).\n\nIf anyone can give me any ideas on what could be wrong, that would be appreciated.",
			"added": 1514798210
		},
		{
			"topic_id": 1514872660,
			"title": "Anyone willing to test this site out?",
			"body": "Nothing crude but I'm trying to figure out if the animations will load correctly now.\n\nhttp://127.0.0.1:43110/1N5gDTi8rURQuSBKssjpKLaQ8kGdYDHvcB/\n\nIf the fix I just put in doesn't work, you will see large white spaces on the webpage with no animations.",
			"added": 1514872658
		},
		{
			"topic_id": 1516184122,
			"title": "Registered .bit using NameCoin Core but address not found?",
			"body": "I've created the address using namecoins core client. Waited the 12 blocks for the bit address to be confirmed. The address now states an expiration date in the Manage Names section of the client. I've also gone into the sites contents.json file and added the domain entry with the domain bit address.\n\nThe bit address itself is using this:\n{ \"zeronet\": { \"\": \"1N5gDTi8rURQuSBKssjpKLaQ8kGdYDHvcB\" } }\nas its Data (which is the json format for the zeronet address)\n\nAny idea why the address doesn't work?\nThe address is NexusOG2.bit",
			"added": 1516184119
		},
		{
			"topic_id": 1518637294,
			"title": "Testing link for Meg Turney Set (120mb)",
			"body": "blob:null/56d2d0a9-e535-4c1a-964e-48ee714aea38",
			"added": 1518637290
		},
		{
			"topic_id": 1518751354,
			"title": "New Test for Zeronet files",
			"body": "Can anyone download from this site? It's a clone of binshare which is a modified version of ZeroUP. I've uploaded some files to the personal site. After the site loads, are you able to download the 120mb archive?\n\nhttp://127.0.0.1:43110/17L1fy9Pk7nYLhKA1qydRoA8oGeqoVr4ti/",
			"added": 1518751349
		},
		{
			"topic_id": 1519869360,
			"title": "ZeroNet Site tutorial question about private keys",
			"body": "Where exactly is this private key for a site. I'm following the ZeroTalk site and it just assumes you have it. I've looked into the contents.json and it has a cert_signers: value with multiple /'s in it, which did not work. Not sure where else to go.",
			"added": 1519869354
		},
		{
			"topic_id": 1520107438,
			"title": "dbQuery in ZeroNet",
			"body": "I'm continuing on the track of trying to figure out how to use databases within zeronet. There seems to be little information aside from a singular example of a dbschema.json file with brief explanation and no other sources.\n\nI've noticed in a ZeroChat tutorial that you can use a SELECT statement (using SQL from a dbquery function) so decided to see if ZeroNet can use SQL fully. My first test involves trying a simple UPDATE string:\n\n\"UPDATE json SET access=1 WHERE json_id=1\"\n\nI'm using the same site made from the ZeroChat tutorial:\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:99:ZeroChat+tutorial\n\nIt unfortunately doesn't seem to have any affect (the access value remains null, so not even an integer). This the dbschema.json that i've used to build the database:\n\n{\n    \"db_name\": \"ZeroChat\",\n    \"db_file\": \"data/zerochat.db\",\n    \"version\": 2,\n    \"maps\": {\n        \"users/.+/data.json\": {\n            \"to_table\": [ \"message\" ]\n        },\n        \"users/.+/content.json\": {\n            \"to_json_table\": [ \"cert_user_id\" ],\n            \"file_name\": \"data.json\"\n        }\n    },\n    \"tables\": {\n        \"json\": {\n            \"cols\": [\n                [\"json_id\", \"INTEGER PRIMARY KEY AUTOINCREMENT\"],\n\t\t\t\t[\"access\", \"INTEGER\"],\n                [\"directory\", \"TEXT\"],\n                [\"file_name\", \"TEXT\"],\n                [\"cert_user_id\", \"TEXT\"]\n            ],\n            \"indexes\": [\"CREATE UNIQUE INDEX path ON json(directory, file_name)\"],\n            \"schema_changed\": 10\n        },\n        \"message\": {\n            \"cols\": [\n                [\"body\", \"TEXT\"],\n                [\"date_added\", \"INTEGER\"],\n                [\"json_id\", \"INTEGER REFERENCES json (json_id)\"]\n            ],\n            \"indexes\": [\"CREATE UNIQUE INDEX message_key ON message(json_id, date_added)\"],\n            \"schema_changed\": 10\n        }\n    }\n}",
			"added": 1520107431
		},
		{
			"topic_id": 1520304150,
			"title": "Zeronet and Databases (question about deleting entries)",
			"body": "I've been following a bunch of tutorials that were suggested by another user from my last post. I'm having some trouble understanding the whole thing but have not seen anything about deleting information from a database.\n\nI'm working on a potential forum and need the ability to delete threads/comments. The ugly things section did mention that how zeronet works, only people with admin level access can delete. Even so, I'm still curious how to do the actual deletion.",
			"added": 1520304142
		},
		{
			"topic_id": 1520895901,
			"title": "dbQuery, Select statement not returning all values?",
			"body": "I've added two new fields into Posts (date_modified and date_created). I've tried both INTEGER and BIGINT as the field types (they will be holding fairly large numbers). The date_created value is saved properly but dbQuery from getPost (in posts.js) doesn't seem to read the fields as anything but null. \n\nI'm not sure what the problem is but saving works. Reading is hitting some sort of strange problem in which it will read successfully every other field, but never the two new fields.",
			"added": 1520895892
		},
		{
			"topic_id": 1521917677,
			"title": "Trying out NexusTalk since JessTalk is down (I made Nexus OG1&2)",
			"body": "http://127.0.0.1:43110/1Ayvj4fK8PgQBm7Gn3kSnfpETGXaMBEXn6/",
			"added": 1521917667
		},
		{
			"topic_id": 1521987200,
			"title": "Let's try this again NexusTalk",
			"body": "went with original link",
			"added": 1521987189
		},
		{
			"topic_id": 1527732536,
			"title": "Learning Zeronet through development, progress made so far [forum development]",
			"body": "https://imgur.com/a/L6uDkIc\n\nPreview of a forum that I'm working on. It only works for the admin atm and it's big features is that it allows the admin to post/edit/remove. It's not anywhere near done and I'm doing this just out of curiosity. The original code was ZeroBlog.\n\nThe site is functional in the sense that you can post, edit, and remove messages as the admin. I've not tested it from the outside perspective but it should allow people to see the mainpage (without buttons) and they can view the posts.",
			"added": 1527732524
		}
	],
	"topic_vote": {
		"1515131864_1837re6Z2oivvKdamxhrGndFf6XkYvYfDS": 1,
		"1516322022_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 64,
	"comment": {
		"1514798211_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_170_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Can you send me your site files somewhere? Maybe on clearnet.\n\nSure, i'll put up a link\nhttps://mega.nz/#!JjpFXTrI!aWm6FM8WzkPrFDWnHcFVU3tNTQ1J64aBLA8rOcXSZxs\n\nI would just paste the files into a new site directory and select update. I am using an editor 'Xara Web Designer' though from what I've been able to gather, it uses JS and CSS to make animations work. Any help would be appreciated.",
				"added": 1514799241
			},
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_172_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): In ZeroNet, each index.html must contain this thing in <head>: [...]\n\nI don't think that did anything but yes the files were directly from the web designer ide. So I didn't add anything to the files to make them more ZeroNet Appropriate. Added that line after <header> section of the index.html and updated the files, unfortunately no change.",
				"added": 1514799937
			},
			{
				"comment_id": 3,
				"body": "> [krixano](#comment_279_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Should be inside the head section right?\n\nAh yes I typo'd that, it is within the <head> section\nhttps://image.ibb.co/d92aGb/oops.jpg",
				"added": 1514800120
			},
			{
				"comment_id": 4,
				"body": "Strange I'm not hitting any errors but nothing has changed. It's also taking ages to Update (often 2 minutes) even though the project is quite small.\n\nhttps://i.snag.gy/fv74wC.jpg",
				"added": 1514800431
			},
			{
				"comment_id": 5,
				"body": "> [gitcenter](#comment_178_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Defenitely incorrect solution, but you can replace all top.isRemotePresenter with false in roe.js.\n\nI feel like something more basic is wrong on my end. Did you guys manage to get it to run on ZeroNet?",
				"added": 1514800717
			},
			{
				"comment_id": 6,
				"body": "> [frosticnotion](#comment_5_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ): I feel like something more basic is wrong on my end. Did you guys manage to get it to run on ZeroNet?\n\nNote: I just changed the entry in the JS file to > [gitcenter](#comment_178_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Defenitely incorrect solution, but you can replace all top.isRemotePresenter with false in roe.js.\n\nI just put that entry in and Updated with no change, though I haven't seen that cross-origin problem",
				"added": 1514800793
			},
			{
				"comment_id": 7,
				"body": "> [gitcenter](#comment_180_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Could you screenshot that please?\n\nhttps://snag.gy/2xkPLv.jpg\n\nI believe you can use the word false directly in javascript (rarely use it) and when i used Find it only found that one entry",
				"added": 1514801259
			},
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_181_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Reply\n\nThank you guys you got it to work! Though for some reason the editor I was using the make the code more readable didn't have two of those \"top.isRemotePresenter\" uses. The help was much appreciated!",
				"added": 1514801562
			},
			{
				"comment_id": 9,
				"body": "So to sum up the solution for anyone using Xara Web Designer and Zeronet:\n\nAdd the following after your pages <head> tag:\n<base href=\"\" target=\"_top\" id=\"base\">\n<script>base.href = document.location.href.replace(\"/media\", \"\").replace(\"index.html\", \"\").replace(/[&?]wrapper=False/, \"\").replace(/[&?]wrapper_nonce=[A-Za-z0-9]+/, \"\")</script>\n\nand go into 'index_html_files\\roe.js' and change all (should be at least two) 'top.isRemotePresenter' entries to 'false'\n\nThank you to Krixano and Gitcenter for spending this time working on this with me!",
				"added": 1514801802
			}
		],
		"1514872660_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 10,
				"body": "> [gitcenter](#comment_187_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @frosticnotion Did you change top.isRemotePresenter again? Also, you'll have to sign and publish your site after each change.\n\nI'm having an issue with publish it seems. Each time it rarely gets beyond 1/5 peers than stops. Sometimes it even fails. But yes i've been sign than publishing each time. Before that I would even 'Update' from the ZeroNet Home site.",
				"added": 1514876470
			},
			{
				"comment_id": 11,
				"body": "The files that I've had for some time now (since the last post in Nigri Archive) has had the roe.js files modified (so no top. problems) and both html files have the <head> lines added. So it should work but it seems like maybe the update isn't going out.",
				"added": 1514877466
			},
			{
				"comment_id": 12,
				"body": "> [gitcenter](#comment_188_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I am currently seeding your site. What happens if you change top.isRemotePresenter to false in all roe.js, then sign and publish? Will it show content publish failed or not?\n\nIt shows publishing like normal and quickly goes to 1/5 peers. Soon after (within 30 seconds) it will reach 2/5 peers than it just makes no more progress. After about 2 minutes of 2/5 peers it will just go away (the status fades) and it seems like nothing happened.",
				"added": 1514878650
			},
			{
				"comment_id": 13,
				"body": "> [frosticnotion](#comment_12_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ): It shows publishing like normal and quickly goes to 1/5 peers. Soon after (within 30 seconds) it will reach 2/5 peers than it just makes no more progress. After about 2 minutes of 2/5 peers it will just go away (the status fades) and it seems like nothing happened.\n\nNow it seems to end with 'Content published 1/1' after a few minutes of stalling at 2/5 peers",
				"added": 1514878854
			},
			{
				"comment_id": 14,
				"body": "> [gitcenter](#comment_190_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hm... Still cannot load your site correctly. Maybe you are behind NAT? As far as I know, ZeroNet doesn't work well behind NAT.\n\nIt could have been the NAT, I never did open any ports. FAQ suggested opening 15441 (which is now open). I'll try publishing from that and work on this more tonight (heading out for the day).",
				"added": 1514914709
			},
			{
				"comment_id": 15,
				"body": "> [gitcenter](#comment_190_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hm... Still cannot load your site correctly. Maybe you are behind NAT? As far as I know, ZeroNet doesn't work well behind NAT.\n\nI've also installed PureVPN in the last day or so (which seems to be in the same window of time for this problem). The VPN is not set to take affect onto my browser or zeronet. Could be something involving this.",
				"added": 1514917011
			},
			{
				"comment_id": 16,
				"body": "> [gitcenter](#comment_192_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hmm. I think VPN is why publish fails. Try again with VPN disabled?\n\nPublishing doesn't seem to do anything more than 0/5 peers now.\n- Disabled TOR (TOR does not use open ports? something like that)\n- Opened port 15441 (should help get around the NAT issue)\n- Disabled VPN (though it was split tunneled to not affect anything regarding zeronet)\n\nI'm not sure whats going on but tonight I'll try a few other things. So far I'm not sure what the problem is other than my inability to publish changes. If this doesn't work out I'll probably just start from scratch again and do the animations by hand or just not use animations at all.\n\nThough the issue seems that I can't seem to publish so animations are no longer the issue.",
				"added": 1514920563
			}
		],
		"1515131864_1837re6Z2oivvKdamxhrGndFf6XkYvYfDS": [
			{
				"comment_id": 17,
				"body": "Great site, keep up the good work!",
				"added": 1515134472
			}
		],
		"1516142516_14xd9UF7Q2XSQXojvjdPHra479UbXtzZtm": [
			{
				"comment_id": 18,
				"body": "\"Just a reminder liberals are terrorists\" A great way to cause division even among people who may even agree with you on some points. To generalize is not a good strategy when trying to open a discussion. It only invites endless round about arguments that wastes much time and accomplishes nothing. Just my opinion though, could be wrong.",
				"added": 1516155127
			}
		],
		"1516184122_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 19,
				"body": "> [htgozn](#comment_87_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): So as nofish stated, you will need to re-register the domain name as nexusog2.bit (all lowercase)\n\nI'll give that a shot, thank you guys for the suggestion.",
				"added": 1516324406
			},
			{
				"comment_id": 20,
				"body": "Yeah that was the problem works great now. Made the new domain for Jessica Nigri's Nexus OG2 to nexusog2.bit",
				"added": 1516339924
			}
		],
		"1516483143_1Kqyz9aeehairY135iV4ofuQjELTDeT9f3": [
			{
				"comment_id": 21,
				"body": "> [jlxip](#comment_70_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): I have been using Cryptopia for some days and I'm pretty happy about it.\n\nYeah same here but only for trading digital currencies. It tends to get more complicated when you try to withdraw real money (USD for example) from any exchange.",
				"added": 1516501938
			}
		],
		"1516673295_1EqzMve3ZFTvmF8H2v2iebeLvcZJPnSbig": [
			{
				"comment_id": 22,
				"body": "I believe its called batch file commands. You use them in the cmd itself or make a batch file (.bat) and that will run like an executable. To start maybe look at batch file examples and run them within cmd.",
				"added": 1516685871
			},
			{
				"comment_id": 24,
				"body": "> [programmingdata](#comment_12_1EqzMve3ZFTvmF8H2v2iebeLvcZJPnSbig): Copy that. I'm the only one still reading books.\n\nI'm under the impression that the books on this subject are actually about MSDOS. That's how I learned about this stuff and it was before the internet. There should be many tutorials online, this one seemed decent:\n\nhttps://www.tutorialspoint.com/batch_script/index.htm\n\nMy advice would be to try the examples along with a cmd and make sure you understand how the results came to be. There could be books on the subject, hopefully someone with knowledge of that will come forward.",
				"added": 1516761557
			}
		],
		"1516732205_18cuVo4ak3NDVwhTCXE5WtUc4q5ZXYYMu1": [
			{
				"comment_id": 23,
				"body": "I have mined in the past and found an easier way to get almost any currency is to mine an altcoin (my current favored coin is Electroneum) and use that on an exchange and trade it for BTC. The same exchange would normally also have a way to buy Namecoin for BTC (almost every coin trades with BTC). The last step is transferring the Namecoin from your exchange account to your personal wallet. The Namecoin Core contains a way to register .bit addresses.\n\nThe exchange I've been using for ETN to BTC is \nhttps://www.cryptopia.co.nz",
				"added": 1516739897
			},
			{
				"comment_id": 25,
				"body": "> [0tan](#comment_1_14fAXpncRfUGE9opBuSanxnmxVdQb6aSFE): 'm also going to check that out. shouldn't have investes all my btc in ether then..frosticnotion, i have a small ASCII ant miner. Would hooking that up with a raspberry and leaving it mining for some weeks be sufficient?\n\nI'm only familiar with the SHA256 ASIC Devices (for Bitcoin or coins of the same algorithm). From my understanding, if you wish to get anything out of it, it needs to be at least 1TH or better. Many of the older ASIC's operate in GH which is way too low for the current difficulty of Bitcoin. The price of the current TH level ASIC's have exploded due to the value of BTC rising so high. So in other words, unless you have an ASIC device with the hashing power in TH already, it won't be worth it.",
				"added": 1516818122
			}
		],
		"1516892765_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 26,
				"body": "I'm under the impression that communities like this tend to be a bit more open because the bigots are generally stupid. They can't be bothered to figure out how to use things like darknet/zeronet work. Reddit/Youtube are some of the easiest platforms to access and participate in, so you get the largest amount of hate in it.",
				"added": 1516905456
			}
		],
		"1518637294_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 27,
				"body": "Can anyone successfully download the zip file from that link?",
				"added": 1518637334
			},
			{
				"comment_id": 28,
				"body": "I'm trying to find a way to share it. NullFolder seems to take issue with it being a zip file. Doesn't create a torrent or direct download. ZeroUP doesn't support anything above 100mb (gave an error). Anyone know any alternatives?",
				"added": 1518640637
			},
			{
				"comment_id": 29,
				"body": "http://127.0.0.1:43110/17L1fy9Pk7nYLhKA1qydRoA8oGeqoVr4ti/data/users/1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ/1518636671-PUBG%20V-Day%20Patreon.zip",
				"added": 1518642005
			},
			{
				"comment_id": 30,
				"body": "I appreciate the guide but can anyone tell me if this link works?\n\nhttp://127.0.0.1:43110/17L1fy9Pk7nYLhKA1qydRoA8oGeqoVr4ti/data/users/1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ/1518636671-PUBG%20V-Day%20Patreon.zip\n\nI've already cloned a file sharing site and I'm in the process of trying to see if it works.",
				"added": 1518647007
			},
			{
				"comment_id": 31,
				"body": "> [zerolstn](#comment_41_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj): I get a long loading time until it tells me the URL is not found. [...]\n\nThe limit is no longer the problem after having cloned a ZeroUp alternative. Though it seems people can't see the links so it is pointless.",
				"added": 1518656494
			},
			{
				"comment_id": 33,
				"body": "Yeah I haven't figured out how to use ZeroNet to easily host files. Will look into it more in a few days.",
				"added": 1518750741
			}
		],
		"1518682391_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 32,
				"body": "It's still misunderstood why gun control is the goto subject when mass shootings occur. It's not that it will solve the entire problem, it's that you have one part of the problem that can be solved by stricter gun laws. To do nothing about the few mass shootings you have due to weak gun laws, is literally to do nothing at all.",
				"added": 1518708603
			},
			{
				"comment_id": 34,
				"body": "The US has the ability to implement gun control that will prevent potential mass killings that are becoming more and more common. It doesn't mean it will stop all killings and all forms of violence, nothing will. However they have one legal method of limiting the sources of these tragedies and so far, they have done nothing.\n\nWorse yet, people are arguing against their one and only way to doing something, which is gun control. This is a problem for the US to deal with. They need to value life and safety more than their freedom to attain a gun.",
				"added": 1518751214
			}
		],
		"1519869360_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 35,
				"body": "\"following the ZeroTalk site\" was meant to be \"following the ZeroTalk tutorial\"",
				"added": 1519869395
			},
			{
				"comment_id": 36,
				"body": "> [test20180221](#comment_55_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd): chk this.\n\nThat does supply every privatekey that i'd probably need but it seems that the problem lies elseware. I'm running into a hard error \"Content signing failed. Private key invalid! Valid signers\". ZeroNet within GitHub has an issue open for this from Oct2017 with no solution, could find no other details on how to properly set the private key for this test site.",
				"added": 1519881557
			},
			{
				"comment_id": 37,
				"body": "> [zerolstn](#comment_50_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj): Reply\n\nIn another day i'm going to redo the tutorial and explain better.",
				"added": 1519967267
			}
		],
		"1520107438_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 38,
				"body": "Note: the table within table 'json' has a user [json_id 1, acess null]",
				"added": 1520107566
			}
		],
		"1520304150_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 39,
				"body": "> [gitcenter](#comment_299_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di):   Reply\n\nThanks, I will give that a shot soon.",
				"added": 1520483821
			},
			{
				"comment_id": 40,
				"body": "See above post",
				"added": 1520581041
			},
			{
				"comment_id": 41,
				"body": "The tutorial example of blog_single has an issue in which a post that is in the process of being added (the page in which you input title and description) is only cancelled if you click the button cancel. By pressing publish or the browsers back button, both ways the post is added. I'm hoping to figure out a way to make it so that using the browsers back button would result in cancelling the new post because publish was not clicked.",
				"added": 1520581962
			},
			{
				"comment_id": 42,
				"body": "> [krixano](#comment_364_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Are you adding to the user's json file (or signing) before the publish button is clicked? Because if you are, then the post is being added to the file, but not pushed out to other people, before the user clicks the publish button and probably before the back button is hit, and will therefor show up for the user (and show up to everyone else the next time the publish button is clicked). Instead, I would write to the data file, sign, and publish after the publish button is clicked.\n\nI'll have to go over the process of how posts are added because I don't fully understand it. So far it seems to add a blank node and use the updatePost() function to than set the values to it. Beyond that I do need to study how the publish commands tie into it, thank you for the tip.\n\nNote: I believe the part that is confusing is that the onclick event for the Publish button (of the edit form) is the only way to fire the event in which something is added/published. The cancel button sets the page to return to index.html and back has no ties to publish(). Somehow the back browser button is firing off publish(). I'm going to try and look into this more.",
				"added": 1520657538
			},
			{
				"comment_id": 43,
				"body": "I may have figured it out, though it will take some time to fix.\n\nThis is from the index.js:\n\tpostAdd.onclick = function() {\n\t\taddPost(function(id) {\n\t\t\tlocation.href = \"edit.html?\" + id;\n\t\t});\n\t};\n\nWhen an admin clicks the add post button on the main index.html page, it automatically runs addPost() which creates a blank post and saves it to the file (finalizing the changes). This doesn't answer the problem of how a blank post gets filled with values from the edit form, but this does show that even when pressing back/cancel that a blank post at the very least is being added and saved to the json file.\n\nWill be working on this further, thank you guys for the patience/help.",
				"added": 1520658989
			}
		],
		"1520895901_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 44,
				"body": "It seems that all writes are sent to data.json and all reads are requested from admin.db. The admin.db doesn't seem to save the new fields values and keeps them null. I'm not sure how to get around this.\n\ndata.json is sucessfully written too and new/updated posts get passed to the admin.db file. For some reason the two new fields that I've made do not get sent and remain null.",
				"added": 1520899755
			},
			{
				"comment_id": 45,
				"body": "> [krixano](#comment_389_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Did you change the \"schema_changed\" field when you modified the dbschema file. You may also need to reload (and perhaps rebuild) the database from the sidebar.\n\nYeah, didn't change schema number but rebuild/reloaded the database. I'm using SQLlite Studio to inspect the database and it has the structure. I'm thinking it has something to do with publishing after changes, though it does it after add/update/deletion. I may just upload the code (even though its a bit messy) and hope someone can help me out that way.",
				"added": 1520971991
			},
			{
				"comment_id": 46,
				"body": "> [gitcenter](#comment_301_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I would like to read your dbschema.json and an example of data.json, please.\n\nI'll post more details when i get some time off from work. This so far is just the requested dbschema and data at pastebin.com:\n\nhttps://pastebin.com/Kh7iJgTB",
				"added": 1521131592
			},
			{
				"comment_id": 47,
				"body": "> [gitcenter](#comment_302_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Facepalm [...]\n\nMan I must be dyslexic to not have noticed that lol, thanks for the heads up",
				"added": 1521169038
			},
			{
				"comment_id": 48,
				"body": "I'm going to work on cleaning it up. As it stands it is the original blog but you can edit/remove posts and it keeps track of date created/modified (displays next to posts in edit and when posts are listed on index page). So far though it's simple and only the admin can do the edit/remove.\n\nMy plans are to hopefully get it become a basic forum while learning about how zeronet works. Thanks for the assistance so far gitcenter and krixano",
				"added": 1521171416
			}
		],
		"1521750958_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 49,
				"body": "What is with the need for people who don't understand something to lecture others about it?\n\n\"Anyone with even a basic understanding of economics would know that currencies are only as valuable as the products and services that they can purchase.\"\nIt can be traded for USD. USD is used for everything. This argument completely ignores currency to currency trading or even basic bartering. You can't use fur to buy a car wash, yet it holds value if you trade it for USD at the right places. \n\n\"So next time you get some crypto, buy something with it. That's what makes it valuable\"\nThat literally has nothing to do with why it is valuable. Many people don't even use the coin, they buy/sell it and when it drops in value they just hold it. Digital currency is a new concept. Digital coins hold value when people buy and mine it. The more people doing that at the same time raises demand for the coin and the prices go way up. When people stop mining it, the circulation drops (values stop going up and down and it becomes stagnant), people often start selling it on mass at this point. Value goes down. If you must use an existing concept to try and understand how it works, it's driven by supply/demand.",
				"added": 1521787820
			}
		],
		"1521917677_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 50,
				"body": "> [sstrooper](#comment_26_1PfpsxK9HpYgyPkBtdr7C7UJNfhMwFACue): No peers found :(\n\nPublished it again just now. Sent out to 3 people. Kept zeronet running non stop and that seems to make no difference.",
				"added": 1521934771
			},
			{
				"comment_id": 51,
				"body": "> [okcoin](#comment_15_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD): try later. Published it again.\n\nYeah published as well, this time to 7 peers.",
				"added": 1521936861
			},
			{
				"comment_id": 52,
				"body": "> [okcoin](#comment_16_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD): Are there any topics?\n\nI added the Fakku and Saint Patricks Day sets. Doesn't seem like anyones been able to load the board though. Didn't have this problem with Nexus OG and OG2.",
				"added": 1521937917
			},
			{
				"comment_id": 53,
				"body": "> [okcoin](#comment_19_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD): you should sign content.json and usr/data/content.json and publish them too.\n\nI do both each time",
				"added": 1521940097
			},
			{
				"comment_id": 54,
				"body": "> [okcoin](#comment_20_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD): I meet same problem before. Try to clone this site, maybe easy for set up a forum. good luck! [...]\n\nI'm fiddling with some code myself but it's no where near ready. If someone can find a general forum that's public that would be great. So far I think MillChan and Voat are two of them, but they are having many issues and don't seem to work very well.",
				"added": 1521948045
			},
			{
				"comment_id": 55,
				"body": "> [okcoin](#comment_22_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD): here is another clone site: http://127.0.0.1:43110/1Am2bDQhptVMxaLtKxbHCorvL1rjXtqdFH/, try to clone this one and publish.\n\nI cloned the original ZeroTalk board and modified it. \n\nhttp://127.0.0.1:43110/17VTYZNkCo3Bnjyo46MPEHo3um4mdsNBxt/\n\nThis is a clone of the foreign board you gave me, any success?",
				"added": 1521949110
			},
			{
				"comment_id": 56,
				"body": "> [shadomare](#comment_1_1EWfVBr3cRiXcK8iS9Ytwky7VCVTSbv4Fs): Does this work ? http://127.0.0.1:43110/1Du19jncrwhTykufvj69iZpfrk7CGZ1vut/\n\nIt does work but the reason why the previous two forums went down is because the admin insisted on being respectful. May as well scrap the forum before you even start.",
				"added": 1521986720
			},
			{
				"comment_id": 57,
				"body": "As long as it works. I (like many others) just want a consistent forum that we can use. Only thing that will stop NexusTalk is technical issues.",
				"added": 1522118505
			},
			{
				"comment_id": 58,
				"body": "Can anyone confirm that this link is working?\n\nAlmost nobody is upvoting or commenting so it's really hard to tell.",
				"added": 1522170237
			}
		],
		"1522151817_1AHQ72HHYxedyyvaVTxKcozy486xAynJn5": [
			{
				"comment_id": 59,
				"body": "Some of us are trying to get a ZeroTalk board up and running for the community. I'm still testing this one:\n\nhttp://127.0.0.1:43110/1Ayvj4fK8PgQBm7Gn3kSnfpETGXaMBEXn6/",
				"added": 1522171231
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 60,
				"body": "Anonymity is sort of an all or nothing deal. The technology that let's a community read the news when it's otherwise locked down (in more controlled poor nations) is also the same technology that let's people organize assassinations. \n\nAnonymity can be good and it can be bad. However I firmly believe that government in various countries have become so strict that it is a necessary evil.  If things were more open and fair without anonymity, there would be no need for it in the first place.",
				"added": 1527357066
			}
		],
		"1527732536_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 61,
				"body": "> [thunder33345](#comment_104_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): how do you as admins edit other's post?\n\nAs it stands, the admin can edit anything. Than again the way ZeroBlog is set up, the person who makes the site is also the only one who can make posts. I'm planning to add users eventually.\n\nAs for using a non zeronet link to share the image. I've had too many images in the past go to 'ffile not found' with zeronet. Figured why not use something that works 100% of the time.",
				"added": 1527777829
			},
			{
				"comment_id": 62,
				"body": "https://streamable.com/m994c\nhttps://imgur.com/a/cXuv9sr\n\nAdded a little bbcode (from a github) though it doesn't support all of it. Had to modify the image tag since by default it would allow a full sized image. Introduced min/max/default sizes.\n\nhttps://streamable.com/eid8t\n\nThis video shows the catagories filter and how it works",
				"added": 1527793485
			}
		],
		"1531575795_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 63,
				"body": "I've been using 4k video downloader (sounds tacky) but works great. When you paste the youtube link, it will give you the quality options available for the video and you can download whichever one you want.",
				"added": 1531596581
			}
		]
	},
	"comment_vote": {
		"278_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"170_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"175_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"181_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"7_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"172_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"2_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"173_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"279_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"3_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"174_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"176_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"177_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"4_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"178_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"179_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"5_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"6_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"180_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"8_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"282_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"9_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"190_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"100_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"83_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"87_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"1088_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"18_1EqzMve3ZFTvmF8H2v2iebeLvcZJPnSbig": 1,
		"208_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p": 1,
		"55_13E6xCFLmbGYCNAPrKd3m5o6gTgnzMW4rd": 1,
		"357_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"299_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"363_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"302_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"4_1Bppp2Vnp1JiQQyhL6JFsP8Gznfb8cKAB5": 1,
		"28_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": 1
	}
}