{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "从妓女请愿到红女捧场 看袁称帝与习修宪",
			"body": "1912年2月13日， 在逼退满清王朝下野后, 袁世凯通电“赞成共和”，孙中山提出辞职咨文。2月15日，南京参议院正式选举袁世凯为中华民国临时大总统。1913年10月6日的大总统选举中， 袁世凯玩弄“公民团”的把戏，大闹议会, 终于成为正式的大总统。可袁不忘初心, 并不满足, 称帝的梦越做越大, 最后天怒人怨, 一命呜呼。\n\n  回顾历史，袁想在几亿人面前搞个大忽悠, 实现皇帝梦并非易事。他认为有了袁家铁军, 就万无一失了， 但也需几个套路配合, 例如喊喊口号, 制造舆论, 然后找各类托儿们来捧场。其实哪里需要寻找, 中外的马屁精们多的是了。袁世凯申令“天下兴亡，匹夫有责…应如何振兴国势，应如何刷新政治，跻进文明…国民责备愈严，期望愈切，竟使子无以自解，并无可诿避”。翻译成白话文就是形势紧迫所需, 全国人民坚决一致拥护, 不得已而为之, 他必须称帝了。他的托儿们来头都不小, 比如通晓中国事务的前哈佛大学校长查尔斯·艾略特, 他安排宪法顾问弗兰克·约翰逊·古德诺发表《共和与君主论》, 简言之就是吹捧开创人类文明史的中国特色新君主制。袁非常激动，因为这篇劝文登载在美国《亚细亚日报》上，强调中国人只宜”君主立宪”。那个年代没有电视, 可以想像，这份报纸的名字足以吓尿了当时大部分国人。\n\n  光有外援不够, 还需要有内挺。袁的手下组成了各类请愿团，包括”各省公民请愿团”、”军警请愿团”、”商会请愿团”、”人力车夫请愿团”、”孔社请愿团”、等等，不一而足。最搞笑的是“烟民请愿团”，“乞丐请愿团”、“青楼请愿团”。这些请愿团名曰请愿，其实都是袁儿子出资，凡参加者赏银洋若干, 好处多多。有传说, “青楼请愿团的发起人是京中阔妓花元春和小阿凤。一开始小袁让花元春等搞青楼请愿团的时候，她们嫌太招摇还不肯答应。小袁说：俺老爸当了皇上，俺就是太子了吧？将你们选入宫中当贵人，不是强如当风尘女子嘛。元春撒娇说： 妾等系路柳墙花，怎当得贵人？不过大公子既为大阿哥，如蒙不弃贱陋，就是当个烧火丫头，也是无上的荣耀啊。小袁高兴的没法儿，自此鸨母王八等青楼之众，都称呼他大阿哥，小袁也欣然接受。这时各界请愿团竞集，不下数十，小袁遂嘱花元春发起了妓女请愿团，真是别具一格。花元春是个时髦妓女，也乐得借此出风头，当下就请人写了个帖子，刊发京城各青楼征集签名。八大胡同的婊子们接了帖子，都来向花元春咨询，元春说：现在车夫乞丐都集会请愿了，我等姊妹们虽然陷入风尘烟花，难道还不如车夫乞丐？况且袁皇帝登极，一定记念我们也有微劳，也要特沛恩施的，这岂不是一纸书可抵万金么？婊子们听罢，莫不欢天喜地， 早就听说她结交大公子，是通天的本事，这种千载一时的机会，如何不赞成？当即推举花粉头领名，请平时相识的才子，写了一篇言词恳切的请愿劝进书，大家签了名，投递参政院。并择了吉日上街游行“劝进”，众多嫖客们也加人了请愿行列捧场，再加上看热闹的尾随者，人数众多，声势不小。于是袁世凯听到了手下这样的汇报：女人都愿变更国体，这是人民的呼声啊，总统应顺应民心早登龙位！”\n\n  不知上述记载的小阿凤真正身世, 有趣的是后来追随蔡锷造反的京城名妓小凤仙与前者是同一个人吗? 就算不是一个人, 小凤仙也极有可能参加了“青楼请愿团”。为何不可以? 蔡锷不也是先劝袁称帝, 后又反袁造反吗? 国人常说”婊子无情, 戏子无义”。 袁世凯称帝心切, 但也深知婊子不可重用之理, 知道她们派不了大用场, 且有失斯文和羞辱中华民国国体。袁精心操纵了几次议会闹场, 为自己造势, 但选进去捧场的都是看上去衣冠楚楚的”上流人士”。青楼女子们固然无缘进京城大议场请愿, 但她们也知书达理, 自比车夫乞丐一类，情愿在街边跑跑, 扭扭腰肢, 算是尽了金钱和面子的本分。一句话, 民国的妓女们尚知礼义廉耻, 不敢越位招摇, 辱国辱民。\n\n  话说一百多年后, 同样在北京城的中华人民共和国, 却发生了一件奇事。在这坐宏伟的大厦,  事关中国梦的“两会”召开了。光看这阵势, 气派和戒备森严不但能吓尿当年的大总统袁世凯, 也能吓傻所有的当代外国人。现在也用不着各类请愿团了, 从习近平公开宣布”修宪”, 到”人大”投票”通过”仅仅用了半个月时间，大部分的国人还没听说过。时代不同了, 这15天的”修宪”期限不许议论, 所有相关的词汇都被封杀，但劝进和完全拥护的声音都在官办的报纸上。看上去请愿团没了, 洋人也没了, 还用的着洋人的报纸来捧场? 不需要外国人来写什么共和理论, 大大自信的很, 中国特色的新时代的社会主义道路已经成了宇宙第一真理!\n\n  看起来的“称帝修宪”万无一失, 不料这场世纪梦幻大戏却让两个红衣和蓝衣女子彻底搅黄了。\n\n  原来这位红衣女子远道从美国来, 专门为”修宪”捧场和”献计”的。在那个气势辉煌的场面里, 红衣女子被百里挑一的”选中”, 在无数镁光灯下, 当着十几亿国人的面侃侃而谈。一看她的身份: 《全美电视台》的执行台长，两会气质姐。。。这些头衔足以再吓尿所有电视机前的观众，让他们找不到换裤子的时间。妙就妙在“全美”两字， 那可比当年袁世凯时代的《亚细亚日报》威风多了，既不细也不亚，是全美的第一， 那不就是全宇宙第一？ 怪不得两会要提供两台采访车，发放五个记者证呢？！而且习近平亲自接见红衣女子打赏，气质姐站在第一排的中央。哎呀，那个感觉，不可描述！\n\n  红衣女子本来风光无限，却让蓝衣女子的翻白眼和表情包掀了老底，全世界为之哗然， “庄严肃穆”的中共两会成了当代最大的笑话和闹剧。网民们在几十个小时内， 迅速扒下了红衣女子的大红马甲，她竟然是北京著名风月场所“天上人间”的坐台女，如今的头牌地位， 远在当年的花元春，小阿凤或小凤仙之上。原以为袁世凯的“婊子请愿团”已经退出历史， 不料中共却能让它从街头走进“议会”，从炕头走上镜头，果然是中国特色的自信和新时代的伟大中国梦！\n\n\n  按理说妓女参政, 本无非议。婊子从良者，比比皆是，也算不上笑话。问题是这个叫张慧君的妓女，有着多个身份的快速变脸转换, 非同寻常。从选美到坐台，主持人，总编辑， 电视台长，外交官， 中校军官， 央视记者。。。官方的头衔多的吓人。 更奇葩的是她那个《全美电视台》，竟然是仅比巴掌大一点的邮箱。但官方“人民日报”于去年10月8日正式宣布其为该报“海外网美国频道”。婊子上殿堂，就是官匪一家了。老话“婊子无情”说的有道理， 央视，新华社和人民日报， 哪个不是婊子当家， 谎言无数？ 所以那个张慧君才能青云直上。那些完全拥护的声音都是风月场所的余音，能翻下白眼， 没有尿失禁， 已经算是中华男儿了！先总统袁世凯大人如是在天有灵， 得知今天的青楼翻身，也不必再懊悔不已，毕竟他已经有了挨骂名的垫背。\n\n  附网友的评论和网上下载的照片，仅供参考。\n\n“张慧君，81年生，2001年考入河北大学，2003年参加选美比赛，2015年在央视实习，现任全美电视台执行台长，自称“两会气质姐”。 同学说，这个“唐山婊子”，上大学时，睡学生会干部、睡老师。毕业后，在“天上人间”睡达官贵人，一路睡到美国。 她是“大外宣”假记者，将灵魂卖给中共的真“妓者”。“红衣女”张慧君就是个中共高层的“外围女”。模特出身，摇身一变成为央视主持。虽未在央视新闻部门工作过，却能随国家主席、总理出访。近年张女一直是两会、党代会的热点，“气质主持”、“央视名嘴”是其标签。这次如果不是因“外媒”露馅，还会驰骋党中央。论电视主持专业水平，还真不如周永康看上的那几个。一会是全美电视台执行台长，一会是香港经济与旅游电视台执行台长，一会又是世界知识杂志社记者，这就是两会所谓的“外媒”提问！花着老百姓的钱，却拿老百姓当猴耍！然而，假的毕竟真不了，再浓烈的香水也掩盖不住制度的腐臭，再舒服的马屁也干不过一个翻白眼的。两会，注定要在一个大白眼中“胜利”闭幕！”",
			"added": 1521275139,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "特朗普动手了！",
			"body": "对比两国的加税清单，高下立判！\n特朗普一方面在国内减税，另一方面对出口到美国的商品加税，\n目的就是逼那些把产品制造组装环节放在兲朝的企业搬回美国。\n\n好一招釜底抽薪！",
			"added": 1521804942,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1_144QmvXcgytVyRAVPf3Rre6AMAYYLHC64F": [
			{
				"comment_id": 1,
				"body": "习包子，跳梁小丑，止增笑耳！",
				"added": 1520849272
			}
		],
		"1_14BL9jNfFXAV821beMvgQWJqRumoX9C15t": [
			{
				"comment_id": 2,
				"body": "习包子，跳梁小丑，止增笑耳！",
				"added": 1520849345
			}
		],
		"10_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 3,
				"body": "包子登基尽然被两个女人抢尽风头，CCAV的记者，编辑，导播估计要被犯下重大政治错误而扫地出门。\n估计这个翻白眼的女人也没好果子吃。",
				"added": 1520960597
			}
		],
		"76_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 4,
				"body": "美国有贪官，但比兲朝不在一个数量级。\n美国没有袁大，更没有袁二。",
				"added": 1521270290
			}
		],
		"71_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 5,
				"body": "独夫民贼只会点燃野心家的欲火，你可以干的我也可以干。\n刚愎自用，自作聪明的独夫会给人类带来深重的灾难。\n\n中国的历史表明，一旦掌国权利的传承出现问题，轻则灭国，重则灭族（民族灾难）；\n以史为鉴，\n曹氏，司马氏争权给中华民族带来500年的乱世，北方汉族几乎是灭顶之灾。\n唐朝之后的节度使割据导致五代十国近百年的战乱，\n袁世凯称帝，篡改原有的总统更替机制，让中国陷入军阀混战，几乎被日本灭国。\n毛氏独夫在位二十多年，多少人死于非命，多少人家破人亡，多少人妻离子散。。。",
				"added": 1521273005
			}
		],
		"1_17nvGBiEjkw5BibxSWZvcQvqDWvE4t7UFy": [
			{
				"comment_id": 6,
				"body": "来这里就等于自领进兲朝监狱的资格！\n\n真正危险的是你自己而已，所有的文件都是在你的机器上，兲朝的SB条子未必有能力和耐性去追踪谁发的，\n你机器上拥有的文件就是能把你送进监狱的铁证，你浑身是嘴也说不清。\n\n要不说你这样的二货确实够蠢的。",
				"added": 1521565691
			},
			{
				"comment_id": 14,
				"body": "> [mrc](#comment_107_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 如果你不是敏感人士，狗腿子们也不会去你家查你的电脑。如果是敏感人士，也不怕他们查电脑。\n\n说的是风险而已，比如你把zeronet装在手机上，不被法律容许的内容（比如儿童色情）可能会在你不知情的情况下进入你的设备，一旦你的设备被抽检，你是说不清的。\n\n美国，加拿大海关抽检你的电子设备的概率还是很高的，糊涂蛋中招的概率也会很高的。",
				"added": 1522544054
			},
			{
				"comment_id": 15,
				"body": "> [mrc](#comment_111_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 如果自己不看儿童色情站点，发生这种情况的概率非常低。而且即使发生了这种情况，欧美司法机构也不是共产党警察，不问青红皂白抓来立功，而是会看实际情况的。\n\n不看也会中招的，你再仔细想想吧。\n欧美司法机构不会把司法资源用来证明你的清白的，特别是那些还没有获得身份的人，他们正愁没合适的理由将你遣返。",
				"added": 1522562028
			},
			{
				"comment_id": 16,
				"body": "> [mrc](#comment_112_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 不要造谣，我就是德国大学里研究欧美法律的。\n\n既然研究法律就应该凡事讲证据，否则跟那些信口开河的匪共党棍打手有何区别？！\n我只是提个醒而已，否则无端惹上麻烦，估计谁都不想。\n欧洲的情况不太了解，美，加海关对于第三国非外交护照入境人员的自由裁量权是很大的。\n比如搜查行李和电子设备无需申请搜查令。\n一旦证据确凿，遣返决定通常在48小时内作出，最严重的可永久丧失入境权利，没有申诉和辩解渠道。\n指望匪共为你提供领事协助？你就做梦吧！",
				"added": 1522572562
			}
		],
		"17_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 7,
				"body": "兲朝的宫廷政治从来就只有办差的奴才，官员是没有任何实权力的，\n撸掉他就皇上一句话的事，写错一个字都有掉脑袋的风险。\n跟皇上唱反调？一万个人里出一个就了不得了。\n\n更何况现在的官员都是一屁股屎，没一个干净的，皇上一拿一个准啊！\n所以“劝进”只能是他们的不二选择！",
				"added": 1521784440
			}
		],
		"175_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 8,
				"body": "五毛蠢狗确实搞笑，你不用太费心思就能从众人中发现他。",
				"added": 1522238068
			},
			{
				"comment_id": 9,
				"body": "我也说两句：\n1. 中国有文字纪录的历史超过3000年，为何没有诞生《人权宣言》？是历史的偶然还是必然？\n2. Nothing is 100% perfect， 没有事情是完美的，因为不完美就不去做或者阻止别人做，只能说这种人太卑劣。\n3. 民主和自由是推动人类文明进步的巨大力量，民主社会300年的发展成果数百倍与过去3000年的总和便是最好的明证。\n4. 专制社会只能是不断的轮回陷阱，是死循环（兲朝就是最好的例子）；民主社会的优势在于自我更新，自我修复，是迭代，是持续的过程改进，能充分发挥人的能动性，从而激发出无穷的生产力。\n",
				"added": 1522291725
			},
			{
				"comment_id": 10,
				"body": "> [mrc](#comment_99_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 有兴趣的话，查一下明朝的李贽，他在世界学术界都很著名。维基百科上德文版对其介绍，比中文版详细、深刻很多。https://de.wikipedia.org/wiki/Li_Zhi_(Philosoph)\n\n可惜看不懂德文啊！",
				"added": 1522334212
			}
		],
		"2_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 11,
				"body": "把猪头像铸成硬币就夯实“袁二”了！",
				"added": 1522541937
			}
		],
		"178_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 12,
				"body": "不懂的可以看看斯大林，赫鲁晓夫，贝利亚之间的游戏。",
				"added": 1522542017
			},
			{
				"comment_id": 13,
				"body": "> [mrc](#comment_108_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 各位不要不懂装懂，这里说的是这个雪亮工程不会监视习等人的家居生活。\n\n手段有了，谁也逃不掉的。不信的话可以拭目以待！\n蠢货总以为自己掌控一切，殊不知它自己亦被人掌控。\n苏联，东德有很多类似的监控项目。\n毛腊肉厉害不？看看它的最后时日！\n\n独裁者追求的就是社会控制能力，尽可能控制他能想到的一切。\n然而有些东西，上帝也未必能控制得了。\n\nThe Matrix是部很好的电影，可惜真正看懂的人不多。",
				"added": 1522542557
			}
		]
	},
	"comment_vote": {}
}