{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1622772574,
			"title": "Alex Jones struggles...",
			"body": "Why care about those too dumb to live? \n\nWe have to think again. Alexjones is an american. American are extreme egoistical things. they will above all foster their own interests and use all tricks and ways to achieve such means.\n\nAs such in reality when he says : I care about others, it's absolutely a lie. His only goal is to increase in viewership / listener base.\n\nSadly for him he has reached the wall of his potential consumer group. \n\nto use more layman term, you can't increase the size of the SS without or draining the few remnants of the SA or lowering the standards to include the WM.\n\nI hope this nazi analogy doesn't hurt the prone to fainting. But it's fundamentally the situation he finds himself in.\n\nWhat I am saying is that you can't save people from themselves.\n\nAnd that I was more drone to the truth seeking of the operation rather than the save the world narrative.\n\nSpecifically, as the widening of the base really slows the progress toward truth seeking... \n\nThe second point that feeds me is China...\n\nI guess that's come from the first point, in reality he knows that CCP / PLA / MSS really saved everyone they could...\n\nbut first had to come the Cultural Revolution, or resaid the great bloodbath of the feodal and aristocratical forces and beneficiaries...\n\nto plow through lines and lines, millions of sorros sons, bill gates families, and on and on and on...\n\nso that one day we could be free !\n\nthis is liberation, \"man\"...\n\nso I prefered the pre trump alex jones...\n\n1 full total commitment to truth seeking.\n2. move forward, and the linking with troops (from cops to the benghazi boys)\n\nI guess there is something wicked and wickening in the christian teaching in america...\n\nin short it fucks your minds.\n\nthe question is what is the fucking goal?\n\nfrom what I understand of the life of the christ from his apostle : he gave his life to repent from the sins of mankind before God. \n\nbut again what it has to do with vaxxes or todays current events? \n\ndo you want to put a fucking bullet in the head of the daughter of mike pence? feed her corpse to the wife of mike pence? and win? or not?\n\nthat's the question.\n\nbut now alex wants to  be come a russian orthodox...",
			"added": 1622772573
		},
		{
			"topic_id": 1622777378,
			"title": "Prove me wrong, africans born in the west hate me for my skin color...",
			"body": "I say that because africans born in africa, don't. \n\nSo even if I said that at least black american, some, understand the plantations theory. I know they hate me for my skin color.\n\nI know, that if I see a black in america he will hate me for my skin color, there are of course a few exception, but most will...\n\nthey see my skin, they hate me. and assume a lot... or presume.\n\nso as much as I am not in friendly term with them, I don't have this feeling with black born in africa... or I am a foreigner there, and we are clear on it, or they are foreigner here, there is no reason to hate each others, just because of our skin colors... I could be a bad person, same as he could.\n\nhowever american blacks hate me. most... just for my skin color. I am there enemies, opponents, adversaries... for an appearance reason only.\n\ni loved how 0 of them moved a little finger on jeffrey epstein crimes, and I believe they loved it... to see white kids raped... that's good for them, that's how I understand the don lemons, barack obama, and even this defense secretary...\n\nthey are black supremacists seeking the conquest of the west...\n\nblack born in africa understand what TRIBES means... they don't have \"communities\" based on skin color... tribe isn't maybe the right word, but born and raised in africa understand what I try to say... you aren't bantu or you are... and yes everyone is \"black\"... it has nothing to do with that... it's way bigger...\n\nthat's my current position... I don't see what could change it...\n\nand yeah... the black females not born in africa, specially all the marxists, reverse colonialists... omg... they wouldn't last long in AFRICA... \n\nthere is a good video of the american black, going full community in the street of south africa, and hit the wall of the ethnies... if some prefer this world... \n\nhe was like , oh my brother... etc etc... those saw wealth... not skin.\n\nand that's what reveal their hate for me (should I say us)?\n\nanyway...",
			"added": 1622777376
		},
		{
			"topic_id": 1622777764,
			"title": "crazy story of the day : werhner brown (nazi v2 to the moon) \"elon\" book on mars...",
			"body": "what the fuck did himmler found? or is it simply for the lulz to find a muppet with the name elon and lead it to the goal? I mean... what is this wickedness? what is going... \n\nwhy elon... werhner wasn't an idiot... or maybe it was just a name like that... who knows...",
			"added": 1622777761
		}
	],
	"topic_vote": {
		"1584988405_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1622735239_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 1,
				"body": "> [ospeaking](#comment_7_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf): \n\nalien?",
				"added": 1622772598
			}
		],
		"1622704505_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 2,
				"body": "> [ospeaking](#comment_8_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf): Taxation is extortion.\n\ncommon defense needs financing.",
				"added": 1622772624
			}
		],
		"1622700855_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 3,
				"body": "> [ospeaking](#comment_9_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf): Kick out the niggers.\n\nI hate establishment niggers. You can kill them as all the others colors of the establishement... However I have a little fanhood for the street niggers, those who understand and have the flame, and get : burn the fucking plantations, with the owners children in the fire.\nthat's it...\n\nmost whites are or old desilusional old fucks (living in la-la-land) or some faggots plantations builders... \n\nbut the establishment niggers with their marxist breethen, to the fire...",
				"added": 1622772826
			}
		],
		"1622655036_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE": [
			{
				"comment_id": 4,
				"body": "> [ospeaking](#comment_10_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf): America is great, jews, niggers, and others arent'.\n\nis america without the bisons america? I don't think so...\n\nI am just jealous and envious of the large plots of land that people can enjoy in the usa... that fundamentally makes me angry. I live like an industrial chicken.",
				"added": 1622772935
			}
		],
		"1622777378_1NV2bkBW46zh6RrNVHCu7YpGhFPBfqxLrJ": [
			{
				"comment_id": 5,
				"body": "I have adopted a dual non colonial approach : african said : get out. Fine, I wasn't involved. but the reverse is true.",
				"added": 1622777564
			}
		]
	},
	"comment_vote": {}
}