{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1567804619,
			"title": "Zeronet, I need your help bringing Decentralized Applications to Bitcoin",
			"body": "Hey Zeronet, I'm Allen and I've been scrambling for years in how to make Cryptocurrency better. Specifically Bitcoin as that is what most people are aware of at this point. One of the main issues that we have with the adoption of Cryptocurrency is how fragmented everything is. There are so many developers making great applications that many ordinary people would consider using if there wasn't a barrier to entry with how many different chains there are today. The environment is building apart from each other lacking interoperability and an inviting culture to these casual users, which is what the majority of people involved in crypto are. \n\nThrough the r/Decentralization discord, I was recently introduced to a project that a few contributors online have been building out for the past couple years called Echo. Echo is a decentralized sidechain that allows for easy compatibility of Dapps made on Ethereum, Augur, and other chains to work with Bitcoin payments too. It's a new project and is taking Decentralization as the primary goal in reaching consensus and to give people like us ownership of the protocol. If we can achieve this, we can Bitcoin 1000x more useful and cryptocurrency even easier for the layman. Which is why I'm asking for your help today\n\nTo make this truly decentralized I need help in spreading the word in how Echo will benefit the world. We need unbiased node operators, we need developers to tinker and break things, we need people to scrutinize and give all the programmers feedback. We want to take satoshi’s and the bitcoin community’s original vision and expand upon it. \n\n\nThere are a ton of people here with different skill sets, but whatever it is you can do to help me it’d be greatly appreciated. Even if it’s just checking out our website and sharing it with someone else down the line. Echo.org If you have any question or need any help at all with learning how the protocol works, how to build your own dapp, or anything else i can answer I’m on Zeronet at least once a day. I’d appreciate any feedback you guys have.",
			"added": 1567804618
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1567804619_1QKXiGWHj3d7fGTiPmYD5R6mupzt4uq285": [
			{
				"comment_id": 1,
				"body": "You can chat with all the contributors helping out Echo on Discord! here's a link if you have questions or want to discuss https://discord.gg/UaPEbYk",
				"added": 1567807800
			}
		]
	},
	"comment_vote": {}
}