{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "[ACTIVISME] Désobeissance civile ",
			"body": "_Il faut reprendre le contrôle de nos vies._\n\nBonjour à tous.\n\nJe profite de cette nouvelle plateforme sécurisée pour créer un petit sujet pour partager des idées et pourquoi pas mettre en pratique quelques une d'entres elles.\n\nJe vais essayer d'être syntétique:\n\nJe suis un homme né en 82, je pense être un bon technicien web et je suis orienté \"sécurité\" et \"anonymat\" sur internet. Je vis dans le grand Est de la France. Je suis apolitique, solitaire, marginal, et j'essaye d'être bienveillant avec mes semblables.\n\nJe suis très septique sur... non. En fait j'ai peur pour notre avenir. Je lis beaucoup de manière générale et de nombreux chercheurs (dont je partage l'avis) prévoit la fin de notre civilisation pour ce siècle.\n\nAujourd'hui est un jour comme le sera beaucoup d'autre à l'avenir. Nous sommes le 18 mai et aujourd'hui est reconduit la manifestation/émeute contre le projet de loi qui a été imposé par notre gouvernement via le 49.3.\n\nJ'ai posé un jour sans soldes pour aller manifester (ou plutot pour aller voir) mais j'ai changé d'avis depuis. Bien sûr que cette loi est un danger pour nous tous, mais elle n'est qu'une infime partie d'un problème bien plus complexe et dangereux.\n\nDésolé de m'interompre là-dessus mais je dois partir. Je repasserai cette nuit pour alimenter le topic.\n\nJ'espère que ce sujet vous inspira autant qu'il m'inspire =)\nBonne journée.\n\n@kai",
			"added": 1463561099
		}
	],
	"topic_vote": {
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": 1,
		"1_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": [
			{
				"comment_id": 1,
				"body": "Yo.\n@kai, web-bidouilleur utopiste.\n\nLà par curiosité, mais repassera sûrement.\nHave fun.",
				"added": 1463440357
			}
		],
		"1_12pnvfwuwBJJ3cFfbMEhZTQUod2qYUCKfb": [
			{
				"comment_id": 2,
				"body": "Ouais, faut voir comment ça se répend tout ça.\nHave fun o/",
				"added": 1463525549
			}
		],
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": [
			{
				"comment_id": 3,
				"body": "Merci à tous pour vos commentaires et participations.\nCa me réchauffe le coeur =)\n\n> [up4]\n\nOui, je pensais faire un site sur Zeronet sur le sujet. Je manque un peu de temps mais je trouverai =)\nA ce sujet, pirate-informatique(.com), un magasine que j'aime beaucoup propose un concours de blog sur Zeronet. Pour ceux que ça interesse, voici l'adresse [links]http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this\n\n> [pld]\n\nJe vois de quoi tu parles.\nMais nous sommes bien plus nombreux qu'on ne le pense... la \"majorité silencieuse\".\nNous sommes trop institutionalisé pour nous reconnaitre par le chemin premier (la parole). La liberté d'expression en devient un non-sens dans ce monde où tout est faux.\n\n> [weedcoder](#comment_6_151xfrGz3zugtqCT51AStxjJNTHa6harBb): J'ai été dans la peur, puis la colère aussi.Mais j'ai confiance.[...]\n\nCool ! Mais pourquoi ?\nJ'étudie la crypto depuis quelques temps, j'imagine de quoi tu veux parler... \n\n> (prends tes outils et participe à sa construction, il y a du boulot!)\n\nJe m'y attèle :)\n\n> Je prépare un article plus détaillé que ça sur la fameuse \"fin de la civilisation\". Je posterais ça dans le coin.\n\nJe le lirais avec grand plaisir.",
				"added": 1463604412
			}
		]
	},
	"comment_vote": {
		"4_151xfrGz3zugtqCT51AStxjJNTHa6harBb": 1,
		"6_151xfrGz3zugtqCT51AStxjJNTHa6harBb": 1,
		"7_151xfrGz3zugtqCT51AStxjJNTHa6harBb": 1
	}
}