{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1538343658,
			"title": "Using Angular on ZeroNet",
			"body": "I'm thinking to run Angular Apps on ZeroNet. I already managed to get my simple Onepage App running with it, so I guess it works.\n\nHave you guys already created Angular Pages on ZeroNet ?",
			"added": 1538343657
		},
		{
			"topic_id": 1553607490,
			"title": "Did the EU just vote for Article 13?",
			"body": "Apparently it seems like the EU has in fact accepted article 13. What are you guys thinking ?",
			"added": 1553607488
		},
		{
			"topic_id": 1554133768,
			"title": "Russians Spoofing the GPS ?",
			"body": "https://nakedsecurity.sophos.com/2019/04/01/russia-accused-of-massive-gps-spoofing-campaign/\n\nI hope thats a joke",
			"added": 1554133765
		}
	],
	"topic_vote": {
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": 1,
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"1553709852_1CYxQVr5DjuxAebfadW9q7wNF9fFe9A758": 1,
		"1553845655_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1553902251_1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi": 1,
		"1554040243_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": [
			{
				"comment_id": 1,
				"body": "Lets put FurAffinity clone in here :D",
				"added": 1538245278
			},
			{
				"comment_id": 2,
				"body": "> [thunder33345](#comment_250_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): no one said darknet has to be only used by 1337 hackers doing illegal things\n\nYeah. I mean ZeroNet is just awesome.",
				"added": 1538331911
			}
		],
		"1553607490_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 3,
				"body": "> [head](#comment_1_1Mxifa1mKj8HCCrV4vVW3f9TykoDLTVBVj): That's the reason why I've downloaded this ZeroNet thing. IMHO dezentralisation become needed more and more!\n\nI agree. They cant shutdown this as easily as a centralized server.",
				"added": 1553607786
			},
			{
				"comment_id": 4,
				"body": "Great song I just found about article 13: http://127.0.0.1:43110/big.kopykate.bit/?Video=1553525039_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2",
				"added": 1553634675
			},
			{
				"comment_id": 5,
				"body": "> [quantumworld](#comment_329_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Just drop the zeronet link out there and help out all the new people when they join. Zeronet reminds me like the early web was when it first started. The digital wild west..\n\nThats correct. We need to spread the word about a decentralized internet. The more the better. The network will benefit from more peers to download content from. This is a chance to build a better web. A web without a metric Sh*tton of servers needed for a search engine :D",
				"added": 1553708036
			},
			{
				"comment_id": 7,
				"body": "> [quantumworld](#comment_336_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I think i have 90% of the web that has been removed saved on my drives here. I may post some of it on zeronet. Depends on the interest level.\n\nDepends on the content... I'm always interested in for example leaks or source code",
				"added": 1553715295
			},
			{
				"comment_id": 9,
				"body": "> [leveler1](#comment_3_17qBubjn1rzAQjAK2JGDH8gttMis9N5qhp): Yea, fucking disaster, cause some people NEED A FUCKING TAMPER-PUSHER to push their asses, beause they CAN'T THINK FOR THEMSELVES. Like some fucking babies. European intelligence agency full of fucking newborns. Such a BIG FUCKUP. One fucking person is unavailable and everything is fucked up to the point of no return. WHAT THE FUCK?\n\nLook... The government usually contains of people, that simply dont know how digital stuff works. Also I can imagine some politians being bought by the entertainment business. I dont say it happened. But I wouldnt be surprised either.\n\nAnd it isnt 100% passed yet. There will be another last voting I heared today. The chances of it failing tho are very... very very veeeeerryyy low.",
				"added": 1553715695
			}
		],
		"1553709852_1CYxQVr5DjuxAebfadW9q7wNF9fFe9A758": [
			{
				"comment_id": 6,
				"body": "Like, a technical explanation on how Zeronet works, or how to use it?",
				"added": 1553709883
			},
			{
				"comment_id": 8,
				"body": "> [gr3y](#comment_1_1NhcmC4BU2sEnrouQoSQWqvBSZKEVRytZW): Just signed up and +1 to this.  [...]\n\nFor now, I can give you a link to the developer reference of Zeronet: http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/\n\nit tells you how to do development and how this network works in general. I'm still learning myself.",
				"added": 1553715396
			},
			{
				"comment_id": 12,
				"body": "> [kaffie](#comment_813_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I've been wanting to do a writeup at least. But I could maybe do videos?\n\nIf you decide to make some, maybe put them on big.kopykate.bit as well? That site could use some beginner friendly content...",
				"added": 1553730733
			},
			{
				"comment_id": 13,
				"body": "> [kaffie](#comment_814_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): That'd be where I post my videos, yeah. If it's zeronet-specific content, I'm gonna post it to zeronet. Kinda silly to have zeronet tutorials only available on youtube. [...]\n\nRight, I really like the services we have available. Sure, sometimes they are slow as heck, but they work. Which is amazing when you realise... no server was ever involved in this.\n\nWhen I link a clearnet link, its usually cause I reuploaded something from the clearnet, and I want to credit the source.",
				"added": 1553756706
			},
			{
				"comment_id": 14,
				"body": "> [60](#comment_58_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): maybe we can tell people why to use zn and how to set up a node on yt to attract people here, and video about how zn works can be shared inside zn (for example, kopykate or kxovid)\n\nI'm actually experiencing issues with kxovid beta. My Zeronode is password protected and it seems like it cannot access the material font icons file. Its weird, because KopyKate can easily access my video files. I dont know yet if i messed up my HTTPS Proxy or something.",
				"added": 1553757142
			}
		],
		"1553726059_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 10,
				"body": "I know GitCenter: http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/",
				"added": 1553728609
			},
			{
				"comment_id": 11,
				"body": "Also, this is the link to the ZeroNet Sourecode in Zeronet itself: http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB",
				"added": 1553728695
			}
		],
		"1553845655_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 15,
				"body": "I think, ZeroMail does exactly that ?",
				"added": 1553852976
			}
		],
		"1554040243_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 16,
				"body": "ZeroNet should be served by us, the people who use it. Datacenters can be shut down easily, as they are at one location. (Drop the bomb for example).\n\nThe people tho, they are everywhere on this world. I for my part, have a dedicated machine running 24/7 to support the network.",
				"added": 1554102430
			}
		],
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 17,
				"body": "We dont. Zeronet is not about censorship of people who dont know shit about the internet. Also not from people who decide based off their own profit.",
				"added": 1554111164
			}
		],
		"1554133768_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": [
			{
				"comment_id": 18,
				"body": "I see, a simple old printed map as a backup isnt bad then. Geez not even GPS is free of government trash -.-",
				"added": 1554188437
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 19,
				"body": "> [sheendocks](#comment_24_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): On the zerotalk home page is a post asking for \"furry zites\". Smartphones are the least of peoples' problems lol\n\nI dont think that furries are our problem either. Actually some of em are the nicest people I ever met. \n\nI'd say we have other issues to fight, like climate change and the government being corrupted.",
				"added": 1554986771
			}
		]
	},
	"comment_vote": {
		"3_1HkY5PYrDcEiLotJNaANYGLebcDSQ93wP4": 1,
		"1_1Mxifa1mKj8HCCrV4vVW3f9TykoDLTVBVj": 1,
		"761_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"638_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"352_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1
	}
}