{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": 1,
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1_1EeMB9Y46ra4a3ZDRMqvPVZ3WmP2Dgferj": 1,
		"1_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL": 1,
		"1_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"1_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr": 1,
		"1_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": 1,
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": 1
	},
	"next_comment_id": 12,
	"comment": {
		"2_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 1,
				"body": "Надо же. Это как работает то? Полноценный скэйп и перевод в структуру ЗероНет или как-то проще?",
				"added": 1457538967
			},
			{
				"comment_id": 2,
				"body": "> [redfish](#comment_1_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): Надо же. Это как работает то? Полноценный скэйп и перевод в структуру ЗероНет или как-то проще?\n\nlol, iframe",
				"added": 1457539867
			}
		],
		"1_1Ae4VAbPLC6ZzSEBoVBS76M8URVBJ9Fwqx": [
			{
				"comment_id": 3,
				"body": "Содрать и выгрузить торренты crawlerом не просто -- нужно медленно (а то забанят), а их огромное количество. Я один рад пытался содрать один раздел, точнее сохранить в HTML локальное зеркало, т.е. без извлечения данных и их импорта в базу данных. Содрал частично, но это не перспективно и оооочееееень долго. Перспективней начать с базы, которую они релизнули (пару лет назад).\n\nДля того, чтобы подружится, придется им предоставить вариант заработка на рекламе в ЗероНет (кстати, вероятно это довольно просто). Иначе гиблое дело, так как трэкер это бизнес.\n\nВот, базу PirateBay легче достать и использовать, они более \"открыты\", кажется.\n\nОгромная задача в ЗероНет -- это сделать сайт на который пользователи могут выкладывать торренты. Для этого нужен метод модерации и много другого фунционала. Текущее положение -- один ключ к сайту -- это не серьезно. Play не заслуживает весь шум посвященный ему имеено из-за этой полной централизации в собственнике сайта. Задача открыть ресурс который будет сам по себе служить в неопределенное будущее.\n\nВторая задача -- масштабирование в ЗероНет. Сайт такого масштаба как РуТрэкер просто не в силу текущей архитектуре ЗероНета.\n\nСамый перспективный вариант, кажется, это пропатчить ЗероНет столько сколько нужно для распределенного торрент-сайта и открыть такой сайт. (Конечно использовать открытые базы торентов для начала, но это ключевой аспект дела.) Это потребует огромного вклада усилий, а ЗероНет может свернуться в любой момент -- это тебе не Тор (и даже не И2П), который хоть как-то проверены временем и не зависят от одного единственного человека.",
				"added": 1464392504
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 4,
				"body": "++",
				"added": 1468732507
			}
		],
		"1_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 5,
				"body": "Децентрализованный репозиторий -- сложная задачка. Мои поиски и размышления остановилисъ на PubSub моделе, где клоны репозитория это потоки. Scuttlebot: git ssb пример. Ты подписываешься на поток от того пользователя кому доверяешь. Если источник пропадает, ты форкаешъ поток и объявляешь его. Проблема заключается именно в объявлении. В конце концов нужен какой-то централъный список потоков (можен блокчейн).",
				"added": 1504816987
			}
		],
		"5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn": [
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_53_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В «живом Web'е» через пять лет отмирает четверть ресурсов, через 10 — половина. Хотя «ответственность» там выше и хостинг обычно «нормальны» — на внешнем сервере.\n> В Onion (как и в i2p), полагаю, часто сайты поднимаются как попало, нередко вообще на домашней машине под столом или на старом ноуте. Так что средний срок жизни сайта должен быть ещё меньше.\n> При этом, как Onion, так и ip2 имеют централизованные сайты. Умер сайт — всё, пропал у всех.\n> В этом плане ZeroNet и должен рулить :) Тут зайт, интересный всем не умрёт, пока к нему есть интерес. В худшем случае может только перестать обновляться.\n\nУмрет. Архив сайта не умрет, а сайт умрет. Ведъ ключ у одного человека, который может запросто пропасть.\n\nНужны полностью автономные ресурсы, которые содержаться, обновляются, и модерируются группами пользователей, а не одним (или мелкой группой) администраторов.",
				"added": 1504817346
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_161_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В контексте у меня «смерть сайта» подразумевает пропажу информации, а не прекращение её обновления.\n\nАрхивация это легкая задача. Методов полно. Бери и сохраняй, кому не лень. Но, архив имеет очень малую пользу. Кому нужен архив трэкера, например, а кому нужен живой трэкер?\n\n> Вот с модерированием пока да, плохо. В ZeroNet эта проблема пока почти не актуальна, видимо, поэтому почти и не прорабатывается.\n\nДа, децентрализованное модерирование может быть только частичным. Тут просто мало людей, поэтому спамерам не интересно. Как станет интересно, без модерации не обойтись. \n\nЕсли добавить какую-то коммунальную модерацию, то Талк, Вики платформа может теоретически жить без хозяина (но на деле, не совсем... без возможности обновлений ситуацию Children of Men напоминает).\n\nМоя мысль это встроить гладкий путь к обновлению сайта без ключа в саму систему. Например, у Гит-репо этот путь есть -- это форк. Остаётся задача объявления (и сортировки) клонов, но если эту задачу решить, то путь появляется: после смерти ресурса, любой пользователь может создать форк (вместе со всеми данными!), после его смерти, опять форк. Форки делать должно быть просто и список форков должен быть доступен при посещении ресурса. Ясно, что все совсем не просто. Но, цель -- это избежать ситуации которая произошла с форум.и2п например (хозяин исчез, теперь ни форума ни данных). В том случая таже архив потерян, но даже если бы он был, архива мало: нужен не путь создания нового форума и импортирования данных, нужен путь плавного продолжения жизни того же самого ресурса.",
				"added": 1504993233
			},
			{
				"comment_id": 8,
				"body": "Другой подход к этой задаче это строго отделить данные от кода. Ресурс (вики, твитер, трэкер, и т.п.) это распределенная база данных, а доступ к ресурсу это клиент. Клиентов может быть много и разных, и они могут эволюционировать независимо от базы данных. Самый важный момент это что у базы данных нет хозяина. (Модерация становится проблемой №1.) Таким образом, ресурсы действительно бессмертные. Клиенты эволюционируют, а все данные продолжают добавлятся в одну и ту же концептуальную \"базу\".\n\nУже эта модель встречается в реальности: сеть битторента (исключим трэкеры) -- у нее очень простая функциональность по сравнению той что нужна для вики, тветера или трэкера. Или, гипотетический ИРК как текущий ИРК но где все сообщения как-то сохраняются, а не исчезают (Матрикс кажется даже ближе). Юзнет тоже по этой модели оперирует (но с меньшей распределённостью).\n\nЯсно, что сложность в маштабируемости. Возможно решения на базе потоков имеет смысл: то есть, общей базы нет, есть только \"вид\" на базу у каждого пользователя свой, который определяется подписками на какое-то множество потоков. (См. модель твитера). Но недостатков много...",
				"added": 1504994871
			},
			{
				"comment_id": 9,
				"body": "Syndie кажется тоже по такой модели оперирует. Может это даже наилучший пример.",
				"added": 1504994990
			},
			{
				"comment_id": 10,
				"body": "> [balancer73](#comment_163_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Так это и есть ZeroNet :)\n\nНет. Зеронет сайт это и данные и код. Отделения нет. Нет протокола доступа к распределенной базе -- каждый сайт делает что хочет, сайт и является едиственным клиентом. В этом и есть главный недостаток зеронет. \n\nБлокчейн это один вариант распределенной базы но не единственный и не \nочень подходящий для соц-ресурсов.",
				"added": 1505009896
			},
			{
				"comment_id": 11,
				"body": "> [balancer73](#comment_166_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): MergerSite. Смотри ZeroMe или ZeroVoat :)\n> Например, сравни контент ZeroMe и ZeroMe Reloaded. Или ZeroMe+.\n\nЯсно. Теперь прочитал подробнее про мерджер прежде чем комментировать... Вижу нофиш ужепришел к этой модели разделения данных от клиента.\n\n> Но я как раз не считаю такой подход хорошим решением. Снова приходится тащить к себе тонны не нужных тебе данных, как и с блокчейном.\n\nПо крайней мере, тащить не всю базу приходится. Ты, что имеешь ввиду конкретнее?",
				"added": 1505072289
			}
		]
	},
	"comment_vote": {
		"30_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": 1,
		"1_1HvJYyy3nzjHtTWTKZxaBQ15aYDhFWNC2U": 1,
		"35_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": 1,
		"2_19arYgVKguUamTqtYGu6T9FSUsr19CyEcG": 1,
		"24_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"166_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"9_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni": 1
	}
}