{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 26,
	"comment": {
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 1,
				"body": "Завёл вторую учётку, куда деваться.",
				"added": 1525603992
			}
		],
		"1_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX": [],
		"1_16ViRrCEqRCH6tyZekTUzyLtYQTtNAW1RY": [
			{
				"comment_id": 3,
				"body": "И майская премия за самый онтопиковый вопрос этого топика досрочно присуждается @machine799-у.",
				"added": 1525927480
			},
			{
				"comment_id": 4,
				"body": "> @trooper\n\n1. https://zeronet.readthedocs.io/en/latest/faq/#how-can-i-register-a-bit-domain\n2. Сайт статический.  Все данные лежат прямо в index.html. В каталоге ZeroNet/data/1MagneTSMMkNmJTMsTGJtfuNsqGjzzXgQv/\nЕсли же вопрос про торренты, то в торрент-сети по магнет-линкам.",
				"added": 1525969408
			},
			{
				"comment_id": 5,
				"body": "> где найти файлы этого сайта\n\nКстати, если у сайта .bit domain, то узнать его реальный адрес можно из правой выдвигающейся панели ZN. Там есть поле Site address.",
				"added": 1526001219
			}
		],
		"1_1KcPa74X88hPnyc64nnkXveXA8daeKpvcU": [
			{
				"comment_id": 6,
				"body": "При работе через Tor все эти трекеры [бесполезны](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:38).",
				"added": 1535442131
			}
		],
		"3_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 7,
				"body": "> А значит трекеры уже тоже децентрализированные. Я правильно понял ведь?\n\nВсё правильно. Как раз писал об этом: http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:39",
				"added": 1535513538
			},
			{
				"comment_id": 8,
				"body": "> [dude](#comment_60_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): на динамическом адресе поднимать трекер есть смысл?\n\nЗа NAT? Нет.",
				"added": 1535529360
			}
		],
		"5_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 9,
				"body": "1. Зарегистрировать ID через прокси.\n2. Не сохранить master seed.\n3. ???\n4. Profit!\n\nИли:\n\n1. Зарегистрировать ID на одном компе.\n2. Установить ZeroNet на другой комп.\n3. Не перенести master seed.\n4. ???\n5. Profit!",
				"added": 1535978014
			},
			{
				"comment_id": 10,
				"body": "ZN для Windows в виде архива идёт, AFAIK. А не IT-народ мог случайно запустить другую копию ZN из другой папки? Или запустить из какого-то менеджера архивов, который скрывает процесс распаковки файлов?",
				"added": 1535978513
			},
			{
				"comment_id": 11,
				"body": "Пусть забекапит master_seed перед любыми действиями.\n\n> Если там нет блока \"certs\" (\"сертификаты\"), то какие-то проблемы с записью/обновлением этого файла. И, вероятно, созданный тобой ник на ZeroID потерян. Если есть, то х.з., почему не читается. Но бэкап сделай, сохрани этот файл на всякий пожарный :)\n\nЕсли master_seed не менялся, достаточно зайти на ZeroID, и он восстановит сертификат.",
				"added": 1535978813
			},
			{
				"comment_id": 12,
				"body": "Проверил: если заходишь с тем же master seed с чистого профиля без сертификатов, то при посещении ZeroID, сразу же восстанавливает сертификат без вопросов:\n\n> New certificate added web/geekless2@zeroid.bit.\n\nи\n\n> Authorized for web/geekless2@zeroid.bit\n\nПойду потыкаю ZN на семёрке. Может, тоже повезёт наступить на те же грабли. Клиент я юзал под виндой, но с винды никогда никуда не логинился в ZN.",
				"added": 1535979801
			},
			{
				"comment_id": 13,
				"body": "> [balancer73](#comment_413_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Точно. После переноса в каталог без кириллицы всё завелось.\n\nА это точно виновата кириллица, а не пробел в названии \"Рабочий стол\"? Я проверял из винды, где пользователя зовут Таня русскими буквами.",
				"added": 1536030038
			}
		],
		"4_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 14,
				"body": "http://127.0.0.1:43110/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/ - потенциально децентрализованный (но еще нет), но требует установки плагина PeerMessage.",
				"added": 1536030245
			}
		],
		"3_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 15,
				"body": "> [balancer73](#comment_438_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Хотя таких автоподписывающих я не встречал, вроде.\n\nДвижок ZeroBlog-а подписывает на ленту постов при первом входе.",
				"added": 1537760727
			}
		],
		"1_1GewTebNkbfbLPvb4ZJKSmRbuEqcRqJJZ4": [
			{
				"comment_id": 16,
				"body": "> [balancer73](#comment_434_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Чтобы с тобой могли связаться другие ноды. Например, обновить мгновенно сайт при обновлении у них. Без открытого порта ты будешь обновляться только периодически, по расписанию (или вручную).\n\nВроде, для часто обновляемых сайтов ZN стремится поддерживать соединения. Так что нода без открытого порта будет пытаться постоянно быть на связи, открывая исходящие соединения.",
				"added": 1537764160
			}
		],
		"1_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 17,
				"body": "Теоретически можно делать сложные игры, а практически — нет. Для коллективных вычислений без читерства нужен блокчейн, а делать игру на блокчейне — сурово.",
				"added": 1537764698
			},
			{
				"comment_id": 18,
				"body": "Можно попробовать шардирование вместо полной децентрализации. Игроки делают ходы в p2p-режиме, но также отсылают данные о своих ходах 3-м лицам по договорённости. Процесс игровой партии фиксирует 1 или несколько доверенных центров. Ну а доверять ли такому центру, каждый решает сам.",
				"added": 1537765980
			},
			{
				"comment_id": 19,
				"body": "> [mistalero](#comment_13_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Это подходит скорее для сессионных игр, а не для MMO.\n\nКак сделать MMO  поверх p2p  (без блокчейна) вообще не представляю :)",
				"added": 1537775549
			}
		],
		"5_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 20,
				"body": "> могу ли я тогда просто зайти в папку и взять те файлы, чтобы потом использовать их и создать свой клон зайта\n\nДа.\n\nВообще смысл функции запрещения клонирования от меня ускользает. Любой сайт можно скопировать.",
				"added": 1539500630
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 21,
				"body": "Светлая память.",
				"added": 1548318242
			},
			{
				"comment_id": 22,
				"body": "Этот сайт давно остался без админов. И вот теперь Роман умер, и сразу несколько форумов в ZeroNet тоже остались без присмотра. Надеюсь, его ключи не попадут в чужие руки, и никакой злоумышленник не удалит его сайты, и они продолжат работать.\n\nЖаль, что в ZeroNet еще не реализовано архивирование состояния сайтов, и из-за этого контент уязвим к действиям злоумышленника, завладевшего приватным ключом.\n\nУ меня давно была идея заюзать возможность мультиподписи для форума. Создать форум и дать права на управление нескольким доверенным пользователям. Теперь, думаю, пора этим заняться. Вот только кому, кроме Ромы, я мог бы теперь доверить доступ? И кто согласится? Пока не знаю...",
				"added": 1548318646
			},
			{
				"comment_id": 23,
				"body": "> [quirrel](#comment_8_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): А где старый аккаунт?\n\nНа нём место кончилось для этого форума. Скоро и на этом кончится.\n\nZeroNet нуждается в системе бесшовной интеграции существующих сайтов с частными хабами пользовательских данных...",
				"added": 1548384790
			},
			{
				"comment_id": 24,
				"body": "> [shevanez](#comment_3_1FSbdEiKNhHNUNpnHBbbPS3s39TrFCS7P8): где в Зеро Нет находится раздел для новеньких, где более-менее понятно описаны основные принципы взаимодействия в сети, возможности её, ну и места где можно пообщаться.\n\nВот мой раздел для новеньких: http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/\n\nНе обновлял около полугода, к сожалению.",
				"added": 1548421742
			},
			{
				"comment_id": 25,
				"body": "> [quirrel](#comment_14_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): скоро грядут изменения.\n\nКакие?",
				"added": 1548569085
			}
		]
	},
	"comment_vote": {}
}