{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1599734730,
			"title": "Fear: Trump in the White House by Bob Woodward",
			"body": "I spotted this posted on Bitmessage:\n\nPosted from [chan] books  BM-2cUyAt4xPDaexJH6Lf4jxUUALJfu6j5w43\n\n Fear: Trump in the White House by Bob Woodward (EPUB format, 17,640,358 bytes)\n\nhttps://anonfiles.com/T8LbGfTdof/Fear_by_Bob_Woodward_epub\n\nWith authoritative reporting honed through eight presidencies from Nixon to Obama, author Bob Woodward reveals in unprecedented detail the harrowing life inside President Donald Trump’s White House and precisely how he makes decisions on major foreign and domestic policies. Woodward draws from hundreds of hours of interviews with firsthand sources, meeting notes, personal diaries, files and documents. The focus is on the explosive debates and the decision-making in the Oval Office, the Situation Room, Air Force One and the White House residence.\n\nFear is the most intimate portrait of a sitting president ever published during the president’s first years in office.",
			"added": 1599734729
		},
		{
			"topic_id": 1600158515,
			"title": "PC Pro magazine - November 2020",
			"body": "A post I found on Bitmessage.\nPC Pro magazine - November 2020 (PDF format, 74.7 MB)\n\nhttps://anonfiles.com/H366d1V2oa/PC_Pro_-_November_2020_pdf",
			"added": 1600158513
		},
		{
			"topic_id": 1601801657,
			"title": "The American Crisis by Writers of The Atlantic",
			"body": "The American Crisis by Writers of The Atlantic (EPUB format, 1.1 MB)\n\nhttps://anonfiles.com/p5a2Q6bapb/The_American_Crisis_by_Writers_of_The_Atlantic_epub\n\nSome of America’s best reporters and thinkers offer an urgent look at a country in chaos in this collection of timely, often prophetic articles from The Atlantic.\n\nThe past four years in the United States have been among the most turbulent in our history—and would have been so even without a global pandemic and waves of protest nationwide against police violence. Drawn from the recent work of The Atlantic staff writers and contributors, The American Crisis explores the factors that led us to the present moment: racial division, economic inequality, political dysfunction, the hollowing out of government, the devaluation of truth, and the unique threat posed by Donald Trump. Today’s emergencies expose pathologies years in the making.\n\nFeaturing leading voices from The Atlantic, one of the country’s most widely read and influential magazines, The American Crisis is a broad and essential look at the condition of America today—and at the qualities of national character that may yet offer hope.",
			"added": 1601801654
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1570483391_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 1,
				"body": "When I first learned of Bitcoin in 2012 I started using every Bitcoin faucet I could find to collect it, and this continued for about a year until the returns from the faucets became too small.\nI was able to consolidate and move all of this into one paper wallet, which has a balance of 0.56 BTC.",
				"added": 1570532375
			}
		],
		"1590977546_18j7m1AWJFGgWCTe5KwBCbUNohYzxSoTmR": [
			{
				"comment_id": 2,
				"body": "I went to http://dreadytofatroptsdj6io7l3xptbet6onoyno2yv7jicoxknyazubrad.onion/\nbut I was unable to solve their Captcha.",
				"added": 1591000217
			}
		],
		"1600158515_1JSiiS2nVVHx65snyUci3MJhnB2e1jPVZy": [
			{
				"comment_id": 3,
				"body": "Don't blame me, I'm only the messenger, not the original file uploader.\nI downloaded and read the magazine with no problems. It is what it is, a computer magazine in .pdf format.",
				"added": 1600250377
			},
			{
				"comment_id": 4,
				"body": "Most Bitmessage users would recommend using Tor Browser to download something like this.",
				"added": 1600623940
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 5,
				"body": "Don't be such a big baby! Just get the jab, and you'll receive a real vaccine certificate.",
				"added": 1620664594
			}
		]
	},
	"comment_vote": {}
}