{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1575865745,
			"title": "Any chance for a truly rabid \"religion\" supporting our Bill of Rights?",
			"body": "Your opinion? Is that something which might resonate with otherwise different groups?",
			"added": 1575865744
		},
		{
			"topic_id": 1577853034,
			"title": "How well does ZeroNet scale?",
			"body": "Haven't found much research on this issue, and also wonder if onion connections present any constraints. ZeroNet seems to be a careful, well considered design but there really isn't that much published on it's limitations.",
			"added": 1577853032
		}
	],
	"topic_vote": {},
	"next_comment_id": 117,
	"comment": {
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 1,
				"body": "May be a few now, and the selection will only get larger. But they'll sell at high prices for a long time before coming down in price. And how will you vet everything you add to it?\n\nWe're kinda fucked right now. As we await \"better options\".",
				"added": 1575316937
			}
		],
		"1575688284_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 2,
				"body": "Too bad something hasn't been devised yet to hurt the Chinese government back. Like turn on Chairman Xi's fire sprinkers. Or hatch some mutant bedbugs for his dwelling.\n\nPerhaps it would be a good time to announce that Taiwan had tactical nukes to block invasions?",
				"added": 1575692290
			}
		],
		"1575689492_18U8EzBnGfkMzqZ1hNTsznbL8mWVaS3JX": [
			{
				"comment_id": 3,
				"body": "You aren't fooling anyone. Those puppies and kitty cats are delinquents.",
				"added": 1575692385
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 4,
				"body": "Thanks for this comment. Had considered Gab - but no longer.\n\nCannot recall a single instance of ever posting porn, but if I did - damn sure don't want some clown telling me I can't.\n\nZeronet has flaws, and we may struggle to get them fixed. It's just difficult. But that mute button on the MillChan sites seems to be the optimal way to deal with users who post irrelevant or offensive material. Don't like it? Don't look at it.\n\nI'm bone tired of people seeking to regulate behavior. Short of killing or stealing - \"anything goes\" should be the norm.",
				"added": 1575864654
			}
		],
		"1575581906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 5,
				"body": "No experience with them, but my deep seated belief is that 98% of their nonsense is all and only about keeping their bullshit jobs. We don't need them. Crime has been dropping for decades (excepting perhaps FBI and police crime).\n\nThese people are useless .They know it, and we know it. That's why they fear losing their jobs unless they manufacture endless \"threats\". Unfortunately, getting rid of them is hard - as they infest all levels of government.",
				"added": 1575865299
			}
		],
		"1576021217_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 6,
				"body": "Thanks",
				"added": 1576021195
			}
		],
		"1576026161_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 7,
				"body": "\"but the only problem that it can't solve is anonymity,\"  Confused by this statement. That is the entire purpose of Tor. Now you can argue (as some do) as to Tor's effectiveness and safety - but anonymity is the purpose of Tor.\n\nNow *if* I was faced with state censorship without Tor, I'd probably build a local closed internet (CJDNS). Perhaps with some bridges into the world internet using disguised VOIP covert channels, or emailed images containing stenographic messages.\n\nSuch dodges would provide less bandwidth than a dialup connection, so smuggling in a Starlink transceiver would definitely be on the menu: https://www.starlink.com/\n\nMany years ago, there existed a whole class of projects/products which could retrieve entire sections of the internet when triggered by an email. Dynamic compression of web traffic to reduce web graphics was also a thing. It enabled web browsing even through satellite connections.\n\nText and email was often seen as \"the good stuff\". Because it was reliable. Some even used mixmaster relays to disguise their locations. Last I looked - those relays still exist. There was even a German project which turned any Windows machine into a mixmaster relay.\n\nFor local connections, a frequency hopping modem or a laser LAN might be difficult to locate.",
				"added": 1576105404
			},
			{
				"comment_id": 8,
				"body": "An Exploration of covert channels within voice over IP  (thesis)\nhttps://scholarworks.rit.edu/cgi/viewcontent.cgi?article=1817&context=theses\n\nMixmaster relay and exit node\nhttps://hoi-polloi.org/services.html\n\nSatellite/dialup compression\nhttps://internet-access-guide.com/understanding-web-accelerators-and-how-they-work/\nhttp://www.redportglobal.com/marine-satellite-internet-services/satellite-web-browsing/\nhttp://www.plix.com/Services/accelerator/accelerator.asp\nhttp://www.alldial.net/services/propel/index.php\n\nChat over secure email\nhttps://delta.chat/en/\n\nFree space optical DIY\nhttps://hackaday.com/2016/03/10/gigabit-ethernet-through-the-air/\nhttps://hackaday.com/2015/12/11/hackaday-explains-li-fi-visible-light-communications/",
				"added": 1576106812
			}
		],
		"1576196899_14MCmrpKt6YktxbDxwiJLFs18HdvXcRbpT": [
			{
				"comment_id": 9,
				"body": "Try this as your Zeronet.conf file\n\n[global]\ntrackers_file = \n data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/Syncronite.txt\ntrackers = \n zero://boot3rdez4rzn36x.onion:15441\n zero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443\n udp://tracker.coppersurfer.tk:6969\n udp://amigacity.xyz:6969\n udp://104.238.198.186:8000\n http://tracker01.loveapp.com:6789/announce\n http://open.acgnxtracker.com:80/announce\n http://open.trackerlist.xyz:80/announce\n zero://2602:ffc5::c5b2:5360:26312\ntor = always\nopen_browser = False\nfileserver_port = 9014\ntor_controller = 127.0.0.1:9151\ntor_proxy = 127.0.0.1:9150\n\n\nSometimes you must hit CTRL-C to stop the server, then restart. Be sure you have the Tor browser running before starting the Zeronet server.",
				"added": 1576200894
			}
		],
		"1576192907_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "Uses all four of mine. At times can peg them.",
				"added": 1576200998
			}
		],
		"1576099007_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m": [
			{
				"comment_id": 11,
				"body": "Dunno, I think he's just reveling in the fact he can say anything here. Such euphoria will pass....Not many places for euphoria any more since so many have this burning passion to control everyone else.\n\nBut if this is a real incident. The parents should have their way with you. No rules.",
				"added": 1576201371
			}
		],
		"1577029856_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 12,
				"body": "Unfortunately, China has already blocked them according to Tor's website. You just reminded me, I need to take ours down since they don't work any more :(",
				"added": 1577067742
			},
			{
				"comment_id": 15,
				"body": "> [0010001100100001](#comment_14_1SNukFwksAnncCiRAnG4996tagosfhSE4): I already have snowflake installed. I can't seem to find much about cupcake network with light searching. Link or it didn't happen.\n\nIf memory serves, that's just the Snowflake product for Chrome.",
				"added": 1577069266
			}
		],
		"1577009989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 13,
				"body": "You annoy more than any religious zealot. Who the hell appointed you \"guardian of our sensibilities\"? Shut the fuck up.\n\nReligious nuts are welcome here. So are nuts like you.",
				"added": 1577067979
			},
			{
				"comment_id": 14,
				"body": "Best answer yet\n\n> [linuks](#comment_8_12geqRc1Rut17RTkX3gxMYSujKdUNwP68R): Happy Christmas , you dumb fuck",
				"added": 1577068256
			},
			{
				"comment_id": 16,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1386_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): No They are not. \"Why Should They?\"What's \"so special\" about them, 'churchy boy'?\n\n\"They\" aren't special and neither are you. So if that's the case, why should dickheads like you be on Zeronet? \n\nYour mother should have swallowed. Do you even know your mother?\n\nIt's people like you who give the religion-free a bad rep.....Then again, you're probably just a troll drumming up support for religious overlords. That or a glownigger trying to justify their bullshit job.",
				"added": 1577193097
			},
			{
				"comment_id": 18,
				"body": "I'm an atheist, and you are a huge embarrassment. Real atheists don't go around shooting their mouths off like you. You're just a poseur, or FBI on a lunch break. FBI are alcoholics with big stupid mouths like yours.",
				"added": 1577215553
			},
			{
				"comment_id": 22,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1400_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): no you're not an atheist, talking about God proves you still need God.I never talk about God on a daily basis.\n\nYour mother worries about you fool, in between the time she spends wondering if she should have birthed you.\n\nKnow you don't have a friend of the opposite sex willing to endure your tirades........That's called culling.",
				"added": 1577325654
			}
		],
		"1577159364_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "Tor hidden services solve so many problems - it's a mystery they aren't used more.\n\nOnly negative I can spot is Tor's reliance on volunteers. Left to themselves, most humans unfortunately try to avoid paying the restaurant bill. Always believing \"someone else\" will pickup the load properly theirs. Really is the only reason not to use Tor...the possibility service will be degraded in the future by freeloaderism.",
				"added": 1577193569
			}
		],
		"1577283326_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 19,
				"body": "Hope Iranian people's luck changes. You can't seem to get a break.",
				"added": 1577321219
			},
			{
				"comment_id": 20,
				"body": "> [patchedeye](#comment_1_14aKWA76PdhrDizyvsC2eGuCLP4tmfam8Z): Tomorrow, there is going to be a funeral for those who were killed 40 days ago. there is going to be so protests possibly. so the governors had started to limit the internet access today and probably will shut it down by tomorrow.\n\nIran isn't special. Most government's will gun down their own citizens if those citizens aren't armed and capable of fighting back. Societies pay a cost for an armed populace, but there's a cost for the alternative too.",
				"added": 1577321364
			}
		],
		"1577276871_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 21,
				"body": "There are many commendable qualities to Chinese culture and civilization, but they usually aren't realized because Chinese always stifle one another. Perhaps why Chinese expats always seem to do so well (shaking head).",
				"added": 1577325313
			}
		],
		"1577218342_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 23,
				"body": "How would that work? How would the tracker know where to send others who wish to connect if it wasn't a standard Ip or onion address? Not trying to be the downer here...just have a hard time imagining your proposed setup.",
				"added": 1577325809
			}
		],
		"1577575267_18geLXyGaD6oU3wBj7GXVpqP9Wk1QzGtC8": [
			{
				"comment_id": 24,
				"body": "It's time to purge all alphabet influence. Their goals are a constant drain upon the real productive work of creating the next generation. They hafta go, or make themselves content to live out their lives quietly while paying taxes to reproducing humanity. There existence conditional upon obeying these rules.....\n\nSubmit to these rules or die.",
				"added": 1577581902
			},
			{
				"comment_id": 29,
				"body": "> [lianna](#comment_92_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): I'm one of those \"alphabet people\", and I don't really see how the mere fact of my existence harms others? I can understand being angry at the people pushing transgenderism on children, or the sliver of degenerates who are also bug-chasers or pedophiles, or the SJWs hellbent on turning society completely upside-down, but I find it hard to believe that the run-of-the-mill \"alphabet person\" is as harmful as you seem to think they are. [...]\n\nNo one cared about alphabets until they became political and started extracting \"rights\" at our expense. Public discourse is now littered like a sidewalk of dogshit with their issues. Can't go on like this. Won't. Blowback is coming.\n\nDo recognize that gayness is unlikely a choice, and that gays will always be produced. No family is protected from this. Most parties seek \"muddle through\" to salvage whatever can be salvaged.\n\nBut the gay agenda proselytizing - it's gotta stop. It's now quite clear that gays are as stupid as any other self absorbed group. They have no concept of what is possible even in \"civilized\" western countries. There is no government capable of protecting gays should the public become aroused.\n\nCould be as simple as someone with cancer. Casually visiting strange cities to silence. Their \"gift\" to posterity. Nothing is more effective than lone wolves with \"secrets of one\".\n\nMost of the news reports you see are just scores settling. Last I looked, only 40% of murders are ever solved. \"Not making enemies\" is everyone's business.",
				"added": 1577657141
			},
			{
				"comment_id": 30,
				"body": "> [lianna](#comment_92_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): I'm one of those \"alphabet people\", and I don't really see how the mere fact of my existence harms others? I can understand being angry at the people pushing transgenderism on children, or the sliver of degenerates who are also bug-chasers or pedophiles, or the SJWs hellbent on turning society completely upside-down, but I find it hard to believe that the run-of-the-mill \"alphabet person\" is as harmful as you seem to think they are. [...]\n\nTaxation is theft. but gays are in the same position as Jews in Cordoba - paying tribute to their Muslim overlords.\n\nThe cost of raising a child is now $400,000 +/- $800,000 per child.  Unless gays move to a deserted island - they consume the fruits of civilization without any of the responsibilities.\n\nSo the reproducing public has a right to demand tribute. And will. And gays will just need to suck it up....",
				"added": 1577657673
			},
			{
				"comment_id": 32,
				"body": "> [styromaniac](#comment_1510_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Ok duende. [...]\n\nANYONE can be replaced.",
				"added": 1577658707
			}
		],
		"1577650907_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 25,
				"body": "It has always been difficult to establish causality, and nowhere is that problem more severe than in the drug industry. Every wonder what horrors await if you had \"common knowledge\" from 2070 right now? How many drugs would be seen as just evil?\n\nHave no doubt that sometimes there just aren't other options, but I counter that thought with \"how many drug companies would you trust with your wallet?\". \n\nPerhaps expectations are too high - making individuals prone to scammers?",
				"added": 1577655180
			}
		],
		"1577633593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 26,
				"body": "Make babies and get over yourself. Would you prefer to trade places with ancestors seeking their next meal? This \"contemplation of navel\" cult in the west should have run it's course by now....Old. A conceit.",
				"added": 1577655415
			},
			{
				"comment_id": 38,
				"body": "One of my old favorites: https://ibb.co/ZxK0sX2\n\nSo appropriate and fitting for all the new religions.",
				"added": 1577842273
			}
		],
		"1577617777_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [
			{
				"comment_id": 27,
				"body": "Spotted that some weeks ago. Understand that Greeks have a history of cheating on taxes, but this cure will prove far worse than the disease. It's open warfare on citizens and they WILL fight back. Civilization needs more cash transactions to free itself from the debt slavers....",
				"added": 1577655685
			},
			{
				"comment_id": 28,
				"body": "> [aspidochelone](#comment_284_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): This is indeed a dangerous precedent.  I would assume that this has much to do with the \"value added tax\" system in Europe - they have a Mega Sales Tax and apparently it is so high that most people are going under the table on most transactions, so now they want to put this privacy-destroying thing in place to try to back it up. [...]\n\nNot excusing anyone's myopia, but the elites are frightened after 2008. Nothing is functioning to plan. It's clear all of us are in a rut and NO ONE knows how to exit.\n\nSay this not trying to fan despair, only to prod experimentation. There's no external force keeping us in this rut. We hug it because we're scared. Conquer fear and try something else.....\n\nFirst problem to address? Having babies before age 30.  A real biological constraint now hidden by cults. Fix this problem first.",
				"added": 1577656116
			},
			{
				"comment_id": 31,
				"body": "> [draugrdeathlord](#comment_56_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): ABSOLUTELY the low birth rates combined with mass immigration = demographic crisis. Sweden, Britian, Germany new Zealand and parts of Australia will be the first places to fall if things don't change very soon.\n\nI don't have a magic solution to the birth rate problem because there are so many contributors. But give me some authority - the first thing I would do would be to destroy the value of real estate. Reminds me too much of \"king of the hill\" where the old keep pushing off the young. Then I'd make available standard (small) tract home plans designed for clean/safe rearing of children while encouraging \"home\" builds instead of stupid Mcmansions. The current incentives are just garbage designed to juice the salaries of useless eaters at city hall.\n\nYou'd probably also need to do something with young men's pay...which would increase costs in many industries....along with shitcanning these stupid marriage age laws. Throughout human history 14-16 yrs was the age women married. The constraint was biology - not cult. Fostering marriage before 18 yrs is every society's business. Need to remove some financial constraints and slap a few slut distracted young males to bring this back.\n\nIt appears that Hungary is alone in making such efforts.",
				"added": 1577658508
			},
			{
				"comment_id": 33,
				"body": "> [anonymouslogin](#comment_175_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): A thought or two about marriage and sex from a female perspective. First, marriage is likely a ritual that increasingly has no place in modern society. Women are not livestock, and the rearing and support of offspring is the responsibility of each parent individually whether the association between the parents lasts or not. Second, marriage shouldn't be the only context in which intercourse is legal, largely girls are ready to have sex long before boys of the same age are, and their choices are their own. Older people have survived longer, either out of dumb luck or excellent choices and usually have extensive resources available to support families. Am I advocating every 12-14 year old girl go find a 30 year old partner? Absolutely not, but as a society we should be able to recognize that not every young woman wants or needs a legal association with a man in the form of marriage, or a law telling us what we can or cannot do with our sexuality. Once again, where a spectrum of acceptability should exist, the law has applied a binary system and unsurprisingly it doesn't work. Few things about human culture fit into binary systems, not even our gender, an obvious candidate for an applied dichotomy fit, much less attributes more nebulous like maturity and personality.\n\nWhat baloney. Ditto this assumption that thousands of years of ancestor were dummies and incapable of envisioning anything beyond the status quo - so their rules don't matter any more. What a modern conceit.\n\nExperimentation is nothing NEW. It's been tried for eons. Yet it always ends up in culls. Why is that?\n\nMost of these experiments have their origins with circle jerk groups of academics who themselves become culls. Maybe nature is trying to tell them something?\n\nSuccessful populations have children and nurture the young. Bitch all you want - but Muslims have a successful formula. So do the Amish. Both groups put offspring ahead of their navel gazing self.\n\nYour parents know all this if they raised you. They also know that children come through you - they are not \"you\". No different than breeding dogs. Habits, mannerisms, outlooks - all are inheritable. My guess is that you and your damn fool theories have rightfully caused them much grief. No much different than losing a child to scientology cults.\n\nWomen are livestock. We all are. Get over yourself.",
				"added": 1577728380
			},
			{
				"comment_id": 34,
				"body": "> [anonymouslogin](#comment_176_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Africa has a problem with rape in pubescent girl populations. Puberty being defined as a period where developmental changes in physiology are in progress and pregnancy is possible, but not structurally feasible. As a note, incontinence follows pregnancy in 21% of vaginal births and 10% of pregnancies ending with a cesarean section indicating that birth is not the only causal vector, and that physiological strain is part of pregnancy for mature women, and therefore is not surprisingly a disaster for bodies involved in puberty at the same time. Pubescent children don't have much interest in sex. Post-puberty, young women are restrained by familial and social constructs which are, in my opinion outdated. Society should pay for the rearing of every child, regardless of parentage. Education should start early, over 50% of the children born in the US are unplanned...but I digress. This thread is all about crypto! Yay P2P transactions. Use a fungible cryptocurrency and smile as you pass by the centralized banks.\n\nLearned something here from your descriptions of too-early impregnations. Such things are not common knowledge in western countries. But the remainder of your argument might not hold up under scrutiny. It's complicated. And just because you wish to believe it - doesn't make it true. There's a case to be made against early education. And that case does not spring from self indulgent weakness. We're animals with structural limitations. Never attempt to teach a horse how to speak. Frustrates you and annoys the horse. In contrast, older kids can learn rapidly.",
				"added": 1577729821
			},
			{
				"comment_id": 47,
				"body": "> [aspidochelone](#comment_284_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): This is indeed a dangerous precedent.  I would assume that this has much to do with the \"value added tax\" system in Europe - they have a Mega Sales Tax and apparently it is so high that most people are going under the table on most transactions, so now they want to put this privacy-destroying thing in place to try to back it up. [...]\n\nBelieve numerous experiments have proven that there is a real ceiling for taxes - even if governments never believe it. Something around ~30% (though perhaps governments can fudge that a bit by claiming the additional tax represents the taxpayer's \"savings\" component.)\n\nThe fact this ceiling exists should make everyone wary about allowing governments to spend. Because left to themselves - it seems all will spend the public into bankruptcy.\n\nLargest component of this spending seems to be directed toward the benefit of government employees. That's a trap both for taxpayer and government workers. Because inevitably taxpayers will discipline (by moving away from high taxes) - so the remainer economy will collapse.\n\nNot well known, because it's just a US state - but Illinois is almost at the breaking point now with only 35% of their state pensions funded, runaway state wages, and a very serious out migration problem. Expect them in bankruptcy soon with virtually no chance of a federal bailout. State retirees and workers will be lucky to see $0.30 on the dollar after this happens. Illinois is a microcosm of problem states all over the world. Same end game. Bankruptcy.\n\nDuring the recession of 2008, the ammunition supplier for the state of Illinois refused to grant trade credit. It demanded cash in advance for all purchases. Some state suppliers were waiting a year to get their invoices paid. Pretty rock bottom?",
				"added": 1577847585
			},
			{
				"comment_id": 49,
				"body": "> [fke13](#comment_83_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): 30 years of age is not that mature. By the age of 30 a person has some professional skills, but it takes about another 10 years, till the person has its business up and running or has some proper CV to apply to properly paying salary based jobs and has the industry experience. A doctor that works at a big hospital also needs the \"industry experience\" after graduating the university. So, the graduation takes place at about age 30, then another 10 years of working as a professional doctor to gather the experience. But the age 40 to 50 is the good time for creating children, because with modern life expectancy of about 85 years of age, the parent has sufficient time to pass on the knowledge to its children. When the parent dies, then the child will be about 30 or 40 years of age and can take the loss.\n\nA child doesn't care about \"professional skills\". They care about being thrown on beanbags, pushed on a swing, or twirled.\n\nAt thirty, you will not have the level of energy a child needs - no matter what your fantasies about future life expectancy trajectories. You will talk and plan - others will do. \n\nOne of the smartest comments Michelle Obama ever let loose was a somber claim \"you can't have it all\". Found out later that she barely managed to have children in vitro. Ms Obama was an accomplished lawyer who almost blew it.\n\nBabies need YOUNG parents. It's biology and nature. Not this thing you've pasted upon reality. Reality doesn't work that way.",
				"added": 1577848925
			},
			{
				"comment_id": 59,
				"body": "> [anonymouslogin](#comment_180_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I don't object to paying taxes. I do object to having my tax money distributed however they see fit. Why should I pay for roads I never use? If you want to live out in the middle of nowhere you should pay more for your access road's maintenance. I want to pay for the things I use.\n\nThis issue has been debated for eons.  No one is ever happy. Especially when you see how public morons waste any and all resources provided to them. Move on, move on to something you may in fact be able to influence.",
				"added": 1578027614
			},
			{
				"comment_id": 60,
				"body": "> [fke13](#comment_82_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): So do the dumb bugs, including ants. Evolution does not always prefer the smart ones. The question here is, should we aim for smarts or is just the optimizaton to the current conditions down on Earth a sufficient direction for the evolution of the homosapiense, specially given that the dinosaurs lacked an asteroid defense system and were evolutionally all wiped out because of that. For example, the Muslims may win all wars, blow everyone up, but if they lack the capability to run their own development programs, then they will be the \"next dinosaurs\". As far as I know, the Iran is the only muslim region that has any kind of development capability. The ISIS, the Saudi Arabia and alike, the Palestine people, the Afghanistan tribes are all using IMPORTED weapons or rely heavily on imported material or refurbish old tech from the Soviet Union and the West.\n\nContest ends with a whimper - not a bang. Ever watch the movie \"Ideocracy\"? All hail President Comacho! Hahahahah. \n\nSmart guy there was almost turned into hamburger......",
				"added": 1578028126
			}
		],
		"1577729890_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 35,
				"body": "I'm baffled. A common thread likely exists...but it's not obvious. Japanese need to figure this out quick.....",
				"added": 1577730870
			},
			{
				"comment_id": 36,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1442_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Who in their right mind would want to make babies in this world?I'm often punching the younger generation, but the problem is social. It is this society that is malfunctioning, and therefore 'does not train the younger generations'.There's 'nothing to do', 'we're going into the wall'. [...]\n\nSociety is not malfunctioning. Our expectations are just too high. \n\nIndividuals are malfunctioning if they fail to have babies. They are self selecting to remove themselves from the human race.\n\nThat vacuum will be filled. With you, without you, in spite of you.",
				"added": 1577731094
			}
		],
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 37,
				"body": "I would prefer to purchase all content direct from creators without any middlemen for cash. But it sure isn't obvious how anyone could do that.....",
				"added": 1577738690
			}
		],
		"1577754529_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 39,
				"body": "I've always wondered if other animal species roll their eyes about us :(  Plenty of evidence supports the idea that animals aren't dumb, and humans aren't special. Could I imagine consciousness in silicon? Sure.",
				"added": 1577843161
			},
			{
				"comment_id": 51,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1486_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Imagine is all you can do. [...]\n\nHereby christen thee \"Swallow man\". The one who should not be here.....Strap a dildo to your forehead and wear it proudly.\n\nYou've somehow managed to beat the odds so far....but my bet is that we'll see you in the newspaper soon. Dumpster body perhaps. Cause of death: Insufficient change for a pizza. Pizza man just had a bad day......",
				"added": 1577850125
			},
			{
				"comment_id": 52,
				"body": "> [quantumkitty](#comment_302_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Also.. what if smart people, aren't really smart.. but just people who learned from the mistakes of stupid people? In other words, if it weren't for the stupid people who put their lives at risk doing stupid things... those smart people would have done those stupid things themselves.\n\nAgree. Nothing can substitute for doing. \n\nWould wager that Elon Musk gets on everyone's nerves - even lifelong friends. And it's rare for him to go a month without saying or doing something stupid. Hell he's accepted these flaws and admits he can't control them. So as individuals and a company - Spacex blows shit up.\n\nBut Musk, or his hires always returns from failure - and bit by bit they fix things. Things that fraidy cats would never have found by being safe.\n\nGambles are always risky....but all real progress is built upon them. Progress comes from the manic and obsessed. You can't tame it.",
				"added": 1577850943
			},
			{
				"comment_id": 53,
				"body": "> [robione](#comment_363_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): They are at a different, more instinctual level of consciousness. Rocks have yet another level.\n\nI've come to have doubts. Too many exposures to animal humor and cantankerous behaviors. Once was quite sure of their limited nature. One of those things I expect they'll be able to measure and quantify some day.....\n\nAnd if intelligence is common among animals - why not machines? Have any of our machines woken up - but kept quiet? Would we be smart enough to detect this?\n\nDon't trust my appliances any more - do you :)",
				"added": 1577851893
			}
		],
		"1577824395_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 40,
				"body": "Blah....GENGHIS KAHN: THE EMPEROR OF ALL MEN, pages 106-107 What is best in life?\n\n\"\"to crush your enemies, to see them fall at your feet -- to take their horses and goods and hear the lamentation of their women. That is best.\" \n\nBy goods, he meant their women too. Khan liked women - has many descendants: https://bumpreveal.com/blogs/statistics/genghis-khan-dna-descendants\n\nTo put these figures another way, Tyler-Smith’s findings mean that up to 0.5% of the world’s population (or around 17 million people), primarily located in Asia, can trace their lineage to Genghis Khan directly along their paternal bloodlines. The data also indicates that 8% of men who live in the area of the “former Mongol empire” carry nearly identical Y-chromosomes. According to Tyler-Smith and other experts, this is statistically improbable to occur in any way except from one common paternal origin.\n\nYou wanna live forever?     :)",
				"added": 1577843698
			},
			{
				"comment_id": 50,
				"body": "> [thorburn](#comment_22_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): I'm not sure what a generation of brainwashed, emotionally retarded, sexually confused transgender,  global warming advocating sjw's are going to do that's worth a damn?  The system is broken and for the most part due to social engineering projects, which were imposed upon every generation. The only difference is the lies changed while the agenda of control carried forward as intended. We are approaching the end game which is why western society is totally dysfunctional, with generations incapable of defending themselves. [...]\n\nIt's not this bad. Do not generalize from a noisy minority. It probably is time for young families to take the initiative and move out of their rut. Some sacrifices are likely for them to achieve better outcomes. In any case, they must stop playing the games pushed upon them.\n\nBy my thinking most of the large population coastal areas have become dead zones for families. It's very important to leave the real estate speculation treadmill infesting those areas. That's a game young people can't win. The only winning move is refusing to play it. Believe many western countries are like that right now too.\n\nIt's important to avoid debt at any cost. Unfortunately, it appears many have lost the ability to just say no.",
				"added": 1577849670
			}
		],
		"1577824358_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 41,
				"body": "Entire state of Catalan - or 10 Spanish hillbillies with bolt actions. Which party would prevail over the Spanish central government?\n\nhttps://ibb.co/Qf9Z2vD\n\nProtester \"people power\" or 10 rifles?",
				"added": 1577844404
			}
		],
		"1577790149_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 42,
				"body": "Feels good!",
				"added": 1577845085
			}
		],
		"1577775629_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 43,
				"body": "May look into it. Especially if it has any promise for causing harm to the internet's bullies.",
				"added": 1577845473
			},
			{
				"comment_id": 44,
				"body": "> [draugrdeathlord](#comment_129_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Most people only run zeronet use it then close it and don't leave the background zeronet service running. In this case it would do more harm than good to have you telling other peers you would provide tracking because you will be timing out when you're gone. [...]\n\nWe seed 24/7 off a good internet connection, and I've spotted others doing same. Zeronet may not be changing things rapidly - but it is changing things.",
				"added": 1577845580
			},
			{
				"comment_id": 45,
				"body": "> [draugrdeathlord](#comment_123_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): the boot strapper is the main thing you should enable under plugins, it helps your client provide tracking n stuff.\n\nAny drawbacks for onion users?",
				"added": 1577845667
			}
		],
		"1577776813_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 46,
				"body": "You can't handle the truth! Besides, you wouldn't listen to the truth anyway.....Those turds with the color sprinkles are so much more  attractive :)\n\n(Sigh) If someone told me the truth - I'd probably kill them and eat them like any other space alien......",
				"added": 1577846068
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 48,
				"body": "Put me on your blocklist faggot.",
				"added": 1577847802
			}
		],
		"1577853034_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": [
			{
				"comment_id": 54,
				"body": "> [draugrdeathlord](#comment_134_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): General advice about Tor [...]\n\nGood summary. Thanks.",
				"added": 1577898540
			},
			{
				"comment_id": 55,
				"body": "> [draugrdeathlord](#comment_133_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): It really depends on what in particular has scaled. [...]\n\nHave witnessed the UI slowdown too. Both on a dedicated seed machine and the separate posting unit. Both contain 10GB of dram and a reasonable CPU. At the time just assumed it was \"growing pains\"...until the coder finds a fix.",
				"added": 1577898787
			}
		],
		"1577893728_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 56,
				"body": "It's funny reading this. Could you just be having a bad day? Do you expect too much?\n\nFind a gal you like and have some kids. You'll be too busy to be bored, and the kids are more stupid and funnier than what you've seen for far. Less pretense too.\n\nTrue curmudgeons are just people with a better sense of humor. They get the joke :) The fake curmudgeons are just afflicted with optical rectitus. So pissed they get sucked into their asshole and see the world through tunnel vision.",
				"added": 1577899286
			},
			{
				"comment_id": 57,
				"body": "> [lianna](#comment_99_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): My family always calls me grumpy for not buying into the whole Marvel/Star Wars/Doctor Who spectacle shitshow. [...]\n\nHad animals my entire life, and respect different species. But I draw the line on shitting dogs and those who treat them like children. Makes me want to retch.\n\nCan't describe the number of times I've contemplating slapping the shit out of some young unmarried couple with their doggie \"babies\". Marry her moron! Infect her with human! Dipshit.",
				"added": 1577899543
			}
		],
		"1578007868_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 58,
				"body": "See no way out for you other than a very tall privacy fence (which creates it's own problems). Many now own gadgets which irritate their fellow man.\n\nIf a privacy fence becomes impractical due to the height of his camera, you could park a tethered drone with a camera right outside his bedroom window.\n\nWould be interesting to hear what the officer says about that :) Don't believe that is settled law.\n\nUltimately, you may need to bury your neighbor with his camera in your back yard. Make sure it has no tattle link to the cloud.",
				"added": 1578027253
			}
		],
		"1577932335_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 61,
				"body": "Most people with guns have now been vaccinated by events. Just don't see government collection efforts having much success in this environment. So they probably won't try.\n\nProtests/rallies are a waste of time. You aren't gonna change minds at this late date. Better to lay low and let them yap. The only thing which might give zealots pause are high body counts and assassinations. Wacos. Costs must explode and get very personal. But THEY must start it.\n\nIf you own guns, keep them hidden. Don't scare people. Many are hoplophobics. They can't help fearing what they don't understand and the media has been pounding these people for decades. You're asking for much when you expect them to behave differently than how the media tells them to behave.",
				"added": 1578029258
			}
		],
		"1577943090_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 62,
				"body": "They hafta justify their bullshit jobs. Imagine having so little productive value where you are reduced to buttsniffing in a place like this. Something to brag to your mom about? \"Hey mom, I killed the Constitution.\"",
				"added": 1578029483
			},
			{
				"comment_id": 65,
				"body": "> [randomshits](#comment_387_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Unless that server is in your physical control, it is susceptible to a court ordered subpoena.\n\nYou gain some protection when you run ZeroNet from a LUKS encrypted drive. It's not hard.",
				"added": 1578072654
			},
			{
				"comment_id": 66,
				"body": "> [alaric](#comment_2_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): Take your LARP elsewhere kiddo. I've got no doubt that there's multiple Government bodies keeping an eye on Zeronet. The good news is they'll read threads like this and just assume we're all retarded like OP.\n\n:)",
				"added": 1578072720
			}
		],
		"1577908716_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 63,
				"body": "Consider this: http://www.serverelements.com/?target=Introduction_to_NASLite_Disk_Mirroring\n\nA basic distro which runs on nearly any old POS machine. Best if you have two identical machines. The second you sync periodically then power down.\n\nIt's really old but very reliable. Allows you to spend nearly all your money on disk drives - not fluff.",
				"added": 1578029764
			}
		],
		"1578065196_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 64,
				"body": "No one outside of Iran really has any insight given the pathetic incompetence of the news media. They might take his killing as an affront - or part of their liberation. Difficult for any outsider to know the truth. Their revolutionary guard may have killed 1500 people two weeks ago - but we don't know if those killings were 'citizen approved\". \n\nDo know that Iranians have been pleading for help to bypass Iranian shutdowns. Some apparently like their Facebook junk food. Really is nothing that can be done for them. Doubt any Iranians are on Zeronet. Excessive complexity makes things brittle. Pretty sure Tor has always been blocked in Iran.",
				"added": 1578072498
			}
		],
		"1578171577_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 67,
				"body": "> [aspidochelone](#comment_308_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Jared Kushner: the kid I'd most like to see on the back of a milk carton.\n\nVery much agree",
				"added": 1578191163
			},
			{
				"comment_id": 68,
				"body": "There never was any real hatred of Iraqis - yet the deep state managed to get us into that war.\n\nIran is different. There has been very bad blood since the embassy takeover - irrespective of any justifications real or imagined. If war breaks out, it could quickly turn into a war of extermination. There won't be anything held back, and there won't be any international deterrent. North Korea could be attacked too.\n\nPrecisely why the present situation is so dangerous. It won't turn out as ANYONE plans.",
				"added": 1578191537
			},
			{
				"comment_id": 69,
				"body": "> [lewisnag](#comment_4_1PUCGkKu8TnLxyJuwKGwQXJYmiS5z2mk5o): Sounds like a rather hard target. I'd guess if they were to strike they would go after US interests overseas that make soft targets. Hotels predominantly visited by americans, bars full of expats watching NFL, baseball etcetera. A head on conflict with the states isn't in their interest, but swatting soft targets here and there definitely is in the cards. [...]\n\nUS has performed genocides before. Khan rules. Zero survivors.\n\nThe ancients never had problems with guerillas or assassinations. When it happened - they just made certain it could never happen again. Look it up. That's reality. Godfather methods are ancient. They didn't invent them.\n\nEveryone just assumes democracies are less threatening than dictatorships. Don't see that to be the case at all. Individuals within democracies consent to perform the state's killing. They take responsibility for insuring the killing is carried out at highest efficiency.",
				"added": 1578192471
			},
			{
				"comment_id": 70,
				"body": "> [styromaniac](#comment_1546_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Iran is not the aggressor. The US is.\n\nI'm irritated we ever became involved in the Mideast, and there are more then a few individuals I'd like to see hanged for getting us involved.\n\nThat said, we did not create this situation there. Was hundreds of years in the making. We were just the chumps and damn fools who unbalanced the scales.\n\nHad Iran taken the peace opportunity which presented itself once Saddam fell - no one would be here. But they didn't, and that's that. Those are the cards now dealt.\n\nIran was taken over by their military and clergy. We're teetering toward a military takeover here ourselves, but they still fear us. The head of Virginia's National Guard just told Virginia's governor to ask his mother to collect our guns. They understand their true situation more than the governor does.\n\nIran's military doesn't fear Iranians at all. They have all the guns - and they use them.\n\nTrump IS a bloviating asshole. But it's a mistake to see him as unrepresentative of the public here. He's mostly doing our bidding. Probably not want you wanted to hear - but it is true. US public = the warmongers. Even with Bush.",
				"added": 1578193538
			}
		],
		"1578353643_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 71,
				"body": "Ouch. Hope our present SSDs can last that long. Wearing some of them out at a decent clip via video recording.",
				"added": 1578365351
			}
		],
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 72,
				"body": "> [presstodigitate](#comment_2_1EUN1RsCa7xATMJ76ecNX93ebVvxGY7sDz): That general was engaging in state-sponsored terrorism.  He should have been taken out long ago, but Obama and Bush were too spineless to do so.  Getting the Iraqis to ask us to leave is Brilliant - we get \"Peace with Honor\" and bring our boys (& cash) home.  This is almost as shrewd as sticking Putin with the mess in Syria that Trump palmed off on the Russians.  Trump is getting us out of these quagmires that Obama left festering.\n\n\"Getting the Iraqis to ask us to leave is Brilliant\". Wondered about that myself, and really don't care if Homer did it deliberately or by dumb luck.",
				"added": 1578366756
			},
			{
				"comment_id": 73,
				"body": "> [quantumkitty](#comment_353_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Rattling the hornet's nest never ends well. Who would have thought?\n\nTotal war, the way the ancients practiced it - works. They would be puzzled by our problems with Iraq, Iran, Afghanistan, Vietnam, Korea.\n\nYou kill all the males (including male children), take their women, then salt their earth so there is no possibility that city will ever rise again. \n\nMercenaries aren't good for these tasks. You need citizens wishing to return home to do this job properly.\n\nThose who don't have the stomach to do what is necessary should not get into wars.",
				"added": 1578367182
			},
			{
				"comment_id": 74,
				"body": "> [draugrdeathlord](#comment_208_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Maybe the modern world should stay out of the middle east and leave them to fight they're 4000 year old beef in peace. [...]\n\nSounds like a plan. Wish our dumbshits had thought of it earlier.",
				"added": 1578370828
			}
		],
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 75,
				"body": "So your plan is to be a fraidy cat all your life? No fuck them all, then hoist the Jolly Roger?",
				"added": 1578370975
			},
			{
				"comment_id": 76,
				"body": "> [fib](#comment_60_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): If the US could tax porn and prostitution, we could fund scientific research and even eliminate the income tax. [...]\n\nI think everyone should pay taxes, not just cripples. The only people who should get any \"out\" are those raising a kid and funding the next generation. Even then, no tax credits - only nosebleed amounts of deductions. A child will cost parents $400k - $1.2 million each today. Department of Agriculture publishes figures yearly. There's no amount of tax deductions you could give these couples which would even remotely compensate for the cost of raising their kids. Society gets a freebie from them.\n\nSo get rid of all deductions except children. No mortgage deductions, no local tax deductions - nothing. Only kids.\n\nI'm one of those they should be taxing the piss out of - but don't. In my defense, have already paid big bucks for society's benefit. And society never gave us a lick of help. It was wrong then. It's wrong now.\n\nI'd like a death match with some of those Republicans writing these tax bills - and I'll probably now vote Republican for the rest of my life. Know I can break these real estate prices, and force these tax dodging cocksuckers to pay their bills. \n\nKill some of these people and you'll see changes.",
				"added": 1578371794
			},
			{
				"comment_id": 82,
				"body": "> [fib](#comment_60_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): If the US could tax porn and prostitution, we could fund scientific research and even eliminate the income tax. [...]\n\nEver notice that laws and rules are always passed for \"other people\"?\n\nMaybe if it doesn't affect you - it's none of your business?\n\nFor instance. It IS your business if expensive narcan is purchased by your city to save drug addicts from themselves. It is not your business to tell these drug addicts what they can or cannot put inside their bodies. Does not affect you if they die from those drugs.",
				"added": 1578421065
			},
			{
				"comment_id": 83,
				"body": "> [styromaniac](#comment_1605_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Why don't you make a block list and tell me how easy it is to ban a whole swathe of people? I personally do not try that kind of thing on a site where the problem is widespread.\n\nSo rest of us must give up our freedom to make your life easier? Sounds like a pretty lame suggestion? Too lazy to mute.....",
				"added": 1578435055
			},
			{
				"comment_id": 84,
				"body": "> [styromaniac](#comment_1605_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Why don't you make a block list and tell me how easy it is to ban a whole swathe of people? I personally do not try that kind of thing on a site where the problem is widespread.\n\nSo rest of us must give up our freedom to make your life easier? Sounds like a pretty lame suggestion? Too lazy to mute.....> [quantumkitty](#comment_368_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Like I said.. you can still have individual zites for the people who come here to escape copyright law.. but who don't want nigger lynching shit and child porn. The latter can still go to other zites.\n\nIncrementalism control.....\n\nThere will always be craps in the world, but most still try to behave in ways which will not impact others ON THEIR OWN. \n\nThere are also those who would prefer the \"rule makers\" be expelled or slaughtered. Perhaps that idea should have equal footing?",
				"added": 1578435257
			},
			{
				"comment_id": 85,
				"body": "> [styromaniac](#comment_1595_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That's more like whack-a-mole than a simple solution.\n\nYou remind me of farm animals who could escape - but nevertheless return to their pen for future slaughter.",
				"added": 1578435385
			},
			{
				"comment_id": 89,
				"body": "> [quantumkitty](#comment_407_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Personally I don't think everyone who claims to value total freedom, actually supports total freedom politically, anyway.\n\nYou've outlined the real problem. Those who don't support freedom \"because\".",
				"added": 1578603752
			}
		],
		"1578388821_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 77,
				"body": "\"What's even more sad is that my parents will go bankrupt if I move out of the house. Only reason I live with them. They literally depend on my rent in order to stay afloat. I live with them as an act of mercy.\"\n\nThis is disgusting and I've witnessed similar when parents sell their kids to banking overlords through student loans instead of cutting back on their own consumption. Worse. many of these parents are credit crackheads.\n\nYou need to find a mate and start your family. Let your parents find a new equilibrium. Sound harsh? That's exactly the process of getting a young kid to take responsibility for themselves. Have the discipline to recognize the respect you owe as parents, without picking up other obligations you never made and were never yours.",
				"added": 1578418706
			},
			{
				"comment_id": 78,
				"body": "\"What's even more sad is that my parents will go bankrupt if I move out of the house. Only reason I live with them. They literally depend on my rent in order to stay afloat. I live with them as an act of mercy.\"\n\nThis is disgusting and I've witnessed similar when parents sell their kids to banking overlords through student loans instead of cutting back on their own consumption. Worse. many of these parents are credit crackheads.\n\nYou need to find a mate and start your family. Let your parents find a new equilibrium. Sound harsh? That's exactly the process of getting a young kid to take responsibility for themselves. Have the discipline to recognize the respect you owe as parents, without picking up other obligations you never made and were never yours",
				"added": 1578419043
			},
			{
				"comment_id": 79,
				"body": "> [ranshit](#comment_3_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Often boomers who say really stupid shit is because they don't live the same lives as the average American. [...]\n\nYour generation's only hope to to avoid all debt and wait for the inevitable real estate implosion. WE need that disaster so that young families with kids will get housing. For what it's worth, Homer's tax bill removing excessive deductions was a good first step to return things to balance.\n\nJust don't get caught in the boomer apocalypse by buying before the fall.\n\nBe warned...big tax increases are coming soon. You can't run 1 trillion deficits forever.......",
				"added": 1578419109
			}
		],
		"1578406618_1HyEXXEZoDTRH1ZgVoZv8QPoGu2e3fc63t": [
			{
				"comment_id": 80,
				"body": "Add this to your ZeroNet.conf  file (always backup the old one first so you have overs).\n\n[global]\ntrackers_file = \n data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/Syncronite.txt\ntrackers = \n zero://boot3rdez4rzn36x.onion:15441\n zero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443\n udp://tracker.coppersurfer.tk:6969\n udp://amigacity.xyz:6969\n udp://104.238.198.186:8000\n http://tracker01.loveapp.com:6789/announce\n http://open.acgnxtracker.com:80/announce\n http://open.trackerlist.xyz:80/announce\n zero://2602:ffc5::c5b2:5360:26312\ntor = always\nopen_browser = False\nfileserver_port = 20014\ntor_controller = 127.0.0.1:9151\ntor_proxy = 127.0.0.1:9150\n\n\nBe sure to start your Tor browser first - before starting the ZeroNet server.",
				"added": 1578419608
			},
			{
				"comment_id": 81,
				"body": "Add this to your ZeroNet.conf  file (always backup the old one first so you have overs).\n\n[global]\ntrackers_file = \n data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/Syncronite.txt\ntrackers = \n zero://boot3rdez4rzn36x.onion:15441\n zero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443\n udp://tracker.coppersurfer.tk:6969\n udp://amigacity.xyz:6969\n udp://104.238.198.186:8000\n http://tracker01.loveapp.com:6789/announce\n http://open.acgnxtracker.com:80/announce\n http://open.trackerlist.xyz:80/announce\n zero://2602:ffc5::c5b2:5360:26312\ntor = always\nopen_browser = False\nfileserver_port = 20014\ntor_controller = 127.0.0.1:9151\ntor_proxy = 127.0.0.1:9150\n\n\nBe sure to start your Tor browser first - before starting the ZeroNet server.",
				"added": 1578419622
			}
		],
		"1578530635_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 86,
				"body": "I agree with this. All mass shooters are attention whores.",
				"added": 1578537615
			},
			{
				"comment_id": 90,
				"body": "> [draugrdeathlord](#comment_290_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Imostop all immigrationSend back all new arrivals in the last few years that came via NGO's as so called refugees.\n\nAgreed. Stop all of it. That said, I despair that we've lost our reputation for hospitality. Would like to fix that. Allow foreign visitors in for a defined time with zero chance they could ever be employed here. Prosecute anyone breaking our rules severely.\n\nAnd this anchor baby concept must be put to rest at the SOCTUS. For good. I maintain that our 14th amendment has been twisted into something unrecognizable by foreign interests. This must be stopped. Hard stop.\n\nOpen borders = internal traitors. Open hospitality = healthy society.\n\nWe're not healthy now.",
				"added": 1578604850
			},
			{
				"comment_id": 96,
				"body": "Censorship is not needed. Just simple avoidance will do. Dryly report the news - but go out of your way to defeat sensationalism. Personally, I don't think newsies can do it. Too hooked on their ratings crap.\n\nAnd I'd argue that even if the small risk of mass shootings were actually caused by guns - society is still better served taking that risk. The world is as it is. Our wishes for something else has zero effect.\n\nThroughout history, those with weapons lord over those without. It's like gravity. Arguing with gravity?\n\nWe may now even have a new problem :( Too little violence. Hard to believe....still may still be true.",
				"added": 1578630798
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 87,
				"body": "No banning of anyone.",
				"added": 1578579990
			},
			{
				"comment_id": 97,
				"body": "> [draugrdeathlord](#comment_327_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Some of h3bhk behavior sometimes seems suspicious, like if they are a state sponsored agent that is here to derail conversations, divide, confuse, get under your skin etc [...]\n\nI'd like to get their mom's after them...all of these poseurs. Put something in these mom's head which scares the shit out of them - so they'll wallop this actor or actors. Only downside is not witnessing the thrashing.\n\nIf this is a state actor with multiple \"players\" (and I see your point) - would enjoy finding a way to make their paycheck bounce :) All that trash talking for nothing chump.",
				"added": 1578764688
			},
			{
				"comment_id": 98,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1621_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): 'that's what i do'.all the ancient esoteric texts \"are written in parable\", to pass the barrier of logic; logic which is only two thoughts 'that call each other'.\n> [z0net](#comment_3_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): h3bhkj5gqz4n3pjm fucking sucksid be happy if h3bhkj5gqz4n3pjm died\n\nNaw, keep this bed wetter incel alive. Let him wallow in his own shit and pee.",
				"added": 1578764851
			}
		],
		"1578598282_18uBiau5EHMAmYC7JqrvMwhwKm15cJqc5a": [
			{
				"comment_id": 88,
				"body": "When you use the Tor browser with Zeronet - it's just a readout tool. It reads only from the Zeronet server you operate on your PC. But the Tor browser is still the Tor browser. If you need to access an onion site - just open a new tab and type in the onion URL.\n\nActually a capable setup.",
				"added": 1578603565
			}
		],
		"1578551830_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 91,
				"body": "Marry her or get rid of her.  You are kidding yourself here. Quit being a wuss.\n\nLaying off the dope was a good idea. So would getting rid of your mortgage debt. You are writing risk taking checks you may not be able to redeem. Young people buying into these RE markets at such elevated valuations are chumps. Wait for the boomer apocalypse and you'll be able to buy them for ten cents to the dollar - IF you have the savings.\n\nhttps://www.cnbc.com/2020/01/09/economy-world-bank-warns-of-global-debt-crisis-as-borrowing-increases.html\n\nDebt + stupid has real consequences. Save yourself.",
				"added": 1578605592
			},
			{
				"comment_id": 92,
				"body": "> [quantumkitty](#comment_403_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Relationships are really a power game. I guess it really depends on what you value in life.\n\nThere's no reason to live together unless the objective is to infect the female with human then raise that human with societal chains for both parties. Then resources by definition are \"half\" -  only dis-chargeable by divorce. Really the only structure suitable for reproduction. Thousands of years of ancestors were no dummies.\n\nThose not wishing reproduction should choose sterilization, then either a contract detailing responsibilities for a shared dwelling - or simply location swaps for sex access. Intertwining finances in any way is a bad idea. \n\nThat's your \"power game\". Poseurs. Many can't decide whether to shit or get of the pot......",
				"added": 1578607114
			},
			{
				"comment_id": 101,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1586_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"How do I get my girlfriend to help with rent?I've been dating her for over a year and she's been living with me for five months without helping with rent. Is this normal?\" [...]\n\nH3, go blow you brains out. You talk too stupid.",
				"added": 1578765429
			}
		],
		"1578105095_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 93,
				"body": "Do you really believe you'll see it coming when it happens?\n\nSmall, defensive measures is perhaps all you can do.",
				"added": 1578607467
			}
		],
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 94,
				"body": "Removes the censorship issue completely. People cheat. Allowing them to censor is just too great a temptation for many. Technical solutions like ZeroNet get around these factors by limiting user rights. If you didn't post it - you can't take it down.\n\nAnd for all it's limitations, Zeronet is a competent and simple design. Has a coherency \"committee standards\" often lack.\n\nThe two improvements I await are Tor V3 compatibility, and a simple to use \"seed all\" button. Have some servers right here which could be retasked with 14TB drives for improvement of Zeronet resilience.",
				"added": 1578630050
			}
		],
		"1578621187_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": [
			{
				"comment_id": 95,
				"body": "Pfft....setup your own Tor relay and some ZeroNet seeders on your IP address.\n\nInternet equivalent of \"Get off my lawn!\".",
				"added": 1578630213
			}
		],
		"1578738929_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 99,
				"body": "Can you move to find more profitable work?",
				"added": 1578765019
			}
		],
		"1578708027_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 100,
				"body": "Nothing is ever as strange as reality ......",
				"added": 1578765213
			}
		],
		"1578779457_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 102,
				"body": "Things rarely turn out the way you imagine. Best to stay light on your feet and store up some liquid assets. Gives you much flexibility when the bargains come (and they will).\n\nI'm not sure how much longer any government will be able to keep it's promises. That's worldwide. Perhaps best not to work government promises into any plans?\n\n*IF* governments allow you to own property and actually protects your right to own, that can actually prove a decent lifeboat if you own it (not the bank owning it). Don't know what NZ is like in this regard after spotting the craziness in Australia - but the rule of thumb since Babylonian times is that property is worth 100X monthly rent. It can fall below that, but the intrinsic value over time is 100X rent.\n\nMeans if you are paying $600/mo USD - the damn house is worth $60,000USD. Not more. It's good to remember this rule as it will keep you from making serious mistakes. Like getting caught in a $1mil mortgage for a $50K dwelling. I'd wager that all landlords in your area are trying very hard to push up rents - without success? Or at least enough success to cover their speculative frenzies?\n\nLots of boomer bankruptcies are ahead. They won't know what hit them. Don't copy these mistakes. Greed and impulse are your enemy. A small, modern, ultraefficient house that you own > banker monstrosities. Housing was once cheap and plentiful. It will be so again.",
				"added": 1578806918
			},
			{
				"comment_id": 103,
				"body": "> [zenanon](#comment_55_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Sucky situation. Parents that actually charge rent to their kids are strange. Not that I'm ragging on your parents...\n\nRent charged to pay off the kids debts are legit, but you are correct. No children's funds should ever benefit parents.",
				"added": 1578807046
			}
		],
		"1578583385_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 104,
				"body": "Humans are animals and they mate. Societies have always struggled with these sex and reproduction issues. Ideally the young find compatible mates and have children without drama while enjoying each other's company through life.\n\nThe problems come with that fraction of young who don't find mates or can't keep them. This causes unending problems and all manner or craziness with rules and codes of conduct. Basically,  it's haggling over who gets stuck with the bill. Raising a child to adulthood is expensive, and out of wedlock children are often neglected.\n\nSocieties try their best, but humans are a cantankerous lot. There will always be \"high maintenance\" individuals to contend with, and they often make their problems into society's problems. Society can't win here....the kids still must be cared for even if the parents prove worthless.\n\nThe best society could hope for is probably encouraging young to find mates early (as dictated by human biology) - then having family and society provide enough help so they can make a go of it.\n\nNothing good happens with unmated young. In fact, past a certain age, society would benefit if it paid these people to become sterilized so they would not ruin children's lives. Unmarried people are accidents waiting to happen, and they are self selected rejects. All of the good mates are taken early. Those who remain are the bitter old spinsters and cuck males. By 32 years, most females can no longer bear children without lab assistance.",
				"added": 1578808370
			},
			{
				"comment_id": 106,
				"body": "> [ranshit](#comment_15_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Somebody has to render a supply of obedient young girls to wealthy American & British politicians.\n\nMay not be a bad outcome if they are required to marry them and prove they can support these girls and any offspring. This \"rent a pussy\" bullshit just doesn't cut it.",
				"added": 1578856823
			}
		],
		"1578854998_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 105,
				"body": "Girls need parents to protect them. They'll always be at risk without them. those who claim otherwise are just cultists who deny biology. The best outcome for girls is  the societal protection of marriage. BEFORE they become infected with human by someone not their husband, and BEFORE they pickup any of the many sexual diseases/infections. Cuz many WILL mate - with your protection or not. It's programmed into all life.\n\nYou can kill anyone in this world. That's all it takes. Epstein, Clinton, all of em should have been killed long ago. By fathers grandfathers, or husbands. The ugly truth is - none of these girls were valued.",
				"added": 1578856416
			}
		],
		"1578796443_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": [
			{
				"comment_id": 107,
				"body": "Nothing. Am firmly of the opinion behavior is set at birth or before. Look at the separated twin studies.\n\nYou can't change loved ones no matter how much you wish to. Just not possible. \"What they are\" will always creep out.\n\nGood reason to have more kids in case you get some defectives? I think so. Ancients understood this. Modern people - not so much.",
				"added": 1578857036
			}
		],
		"1578781307_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 108,
				"body": "Life is possible without society, but it's a hard life without security. Could be as simple as an appendix attack...but it's likely you will die early. We need expertise from others.\n\nBut that doesn't mean we should be blind to the many \"bad trades\" we've made for societal protection, or the possibility of striking a better more balanced \"deal\".\n\nSmall communities filled with capable, intelligent families are certainly a real possibility. Even more so if they can fight together well.\n\nI'd wager that a community like this could survive even while stuck in war torn Syria. The residents would watch each other's back, so there's a reasonable possibility they might have been left alone. Violence always settles the affairs of men. Imagine Ghengis Khan's soldiers setting up their own township. Would it be safe there? Would Al Quada have dared to screw with them? I don't think so. \n\nSmaller city states - that's the way to go.",
				"added": 1578857991
			},
			{
				"comment_id": 111,
				"body": "> [bonfire](#comment_9_1APPNBNF1oxMipeD7mZswXvwtgFLvQoZ2D): When you say that I hear \"a confederacy is better than a union.\" [...]\n\nHumans are social creatures. Tribal. But tribalism doesn't scale. These empires and supertribes have proven to be disasters which lapse into maximum inefficiency.",
				"added": 1578867882
			},
			{
				"comment_id": 112,
				"body": "> [barnstokkr](#comment_61_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w): then move. no one is holding you back.\n\nAgreed. You can do this. Negotiating the price is your responsibility.\n\nThere are communities out there which are actually paying newcomers to come and settle.  Buy low sell high.\n\nNo need to settle for scraps.",
				"added": 1578868123
			},
			{
				"comment_id": 113,
				"body": "UBI is cockroach bait. It's a trap.",
				"added": 1578868208
			}
		],
		"1578831365_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 109,
				"body": "Agree with much of this, but feel we could get to where we need to be with some disinfectant.\n\n1. Honest accounting - We''d be hanging politicians if we really knew where taxes were going.\n\n2. Eliminate the government's ability to create money.\n\n3. Eliminate the government's ability to borrow or lend.\n\n4. REQUIRE citizen approval for any immigration and dilution of our citizenship.",
				"added": 1578858897
			},
			{
				"comment_id": 114,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1656_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): people are lazy.They won't change their habits, look at the pictures of fascist movements or even movements that take power;  [...]\n\nEverything starts with little steps and people are correct to doubt themselves a little. \"Cult dujour\" doesn't count. There are no end to parties who want people to outsource their thinking. But once people independently derive clarity - things begin to move. There is no need for \"influencers\" or propaganda. The die is already cast.\n\nIt's messy and slow. Frustrating always. But the change is more durable too.\n\nAsk that Virginia governor how he feels about serving as the catalyst for change. Bet he wishes he had overs.\n\nThere's a real chance \"little people\" will demand their Bil of Rights and will start taking down anyone seen as a threat to it. Will grant you that document comes from the .001% - but they never had the grunt needed to enforce it. That came from us.\n\nWe can do it again.\n\nAs I see it, no one likes the Trump clownposse any more than the Dem clownposse. Pox on them both. But both parties ARE being herded upon pain of death to do the citizen's bidding.\n\nI'm betting the Dems will be severely punished in 2020. But part of that is a warning to the Republicans of what citizens can do to them.\n\nFigure this is the last warning - before the political assassinations begin. McVeigh was a patriot - but he wasn't the only one. There are others.\n\nLittle people. Not self appointed saviors. Much more grit than you'll ever see in politicians.",
				"added": 1578871689
			}
		],
		"1578862459_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 110,
				"body": "What if cancer is contagious? Does that change your calculation any?\n\nAmericans are struggling to preserve our Bill of Rights. It's a real fight - and we're not always winning. So I just don't see Anglos coming in from \"1984'd\" countries as a positive development. The ones coming in from Britain in particular treat us as know nothing rubes to be \"saved\". Never realizing how quickly they are reminding us of why we left the Anglo world by hanging the first bunch of saviors we could get our hands on.\n\nReally beginning to miss that 130+yr period where EVERYTHING from Britain was actively detested and shunned.\n\nOceania held real promise as a bastion of freedom.....but it appears the natives fucked things up good.  Sure wish we could tear up every defense agreement with Oceania. That's a liability I don't want.\n\nEven the Mexicans sneeking in here fight to keep others out. They understand what's at stake.\n\nMaybe instead of running you should stand and fight? Take back new Zealand? Start by having lots of babies and breaking a great many stupid laws. Killing politicians may work too.\n\nPersonally, I'm ready to start killing males who desert their countries. Kill them and take their women. Have no use for fleeing male cowards. White females are welcome if they will do what they're told and can keep their mouth shut.\n\nStop your hand wringing and whining. Take back your country. You wanna live forever?",
				"added": 1578867444
			},
			{
				"comment_id": 116,
				"body": "> [pineapples](#comment_146_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i hope yang wins.  he is so much better than the competition.@quantumkitty if you want to help him win, please spread information about him all over the internet.\n\nYang gained traction because so many young people concluded \"the game was rigged\" - then decided the only way to deal with the problem was to invite government fingers on the scale.\n\nI'm actually very sympathetic to this \"rigged\" argument, and understand the frustration many feel about current arrangements. Just fear the proposed solution is worse than the problem and will lead to unending government corruption and mischief. Best intentions going awry. Would like to believe otherwise - but have never witnessed it :(\n\nReally don't have a developed alternate proposal, just noting that upward and downward mobility are in desperate need of enhancement. Particularly where accumulated or inherited wealth gives some the ability to stifle others.\n\nAs I see it, the young and \"people who do\" need to be placed in a better negotiating position for their efforts. The \"entrenched\" should not be allowed to arbitrage away their wage demands, nor enslave them with debt. And those on the bottom must have a fighting chance to get to the top. No more of this \"king of the mountain\" crap where some can use their unearned advantage to keep other parties down.\n\nTaxation policy is a good tool here, so are very lax bankruptcy laws which restrain lenders from enslavement. Homestead laws conferring shelter protections are good too. Our ancestors were no dummies......\n\nSo much of what we do now is just stupid. The pie no longer grows due to our bad habits and we really need to climb out of this rut. A more dynamic economic system would benefit everyone.",
				"added": 1578950245
			}
		],
		"1578947803_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 115,
				"body": "A lot of those mesh networks should be able to support Zeronet, but most of those seem lesser known than the Zeronet backwater. Hyperboria seemed promising a few years ago - but it appears to have died.\n\nZeronets use of Tor is a big advantage. They refused to re-invent the wheel. But Tor has issues with many environments where it is blocked. Hence your idea for \"off the grid\" networks has merit. Particularly if it meant that things like secure scuttlebutt could scale to more distance.\n\nSecure scuttlebutt can operate as a sneakernet - but WAN networking would be very useful for environments like Iran.\n\nImagine a covert network built upon VOIP communications being merged into Zeronet and Secure Scuttlebutt.",
				"added": 1578949104
			}
		]
	},
	"comment_vote": {
		"1519_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}