{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1532223050,
			"title": "How to restore ZeroNet usernames?",
			"body": "So, recently my account started saying \"failed to execute script boot\" so I figured I would reinstall and restore from my users.json file. However this didn't work. I created this username so I can talk here. I'm running Windows 7 and just recently started using ZeroNet (withing 72 hours). I have the old folder from when I extracted all files. Is it possible to restore or is my username just gone?",
			"added": 1532223049
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1532143672_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 1,
				"body": "> [styromaniac](#comment_88_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm not a person to ask.\n\nI believe you can: https://grapesjs.com/docs/#download\nAlthough I haven't tried it.",
				"added": 1532223205
			},
			{
				"comment_id": 2,
				"body": "",
				"added": 1532223542
			},
			{
				"comment_id": 3,
				"body": "> [glightstar](#comment_85_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Hmm, GrapesJS seems quite nice IMO, but I just tried to put it into a zite and it doesn't quite seem to work, as it uses an iframe to render the editor.. :/Not sure if there already was a solution for iframes in ZeroNet :? (it seems like it's just the CORS-thing again x_x) [...]\n\nI agree, GrapeJS is very nice but it does lack certain features like an html box, cart, account management, e.c.t. However I can't wait to see how it will look in the future. It is a much needed project.",
				"added": 1532223560
			}
		],
		"1532224996_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "I would also donate,  but only so many projects I can support. \nMany organizations need supporting my opinion (examples: Whonix, TOR, Mozilla, UbPorts, Rhombus Tech, FSF, Gnu, EFF, NoScript, Qubes OS, Fedora, Debian, e.c.t) what we need is an organization to help figure out a payment for each service and help the ones in need more than the ones who already have lots of donations. I'm trying to figure out how to do this but I don't know how. Larger projects like OSes need more funding as they require lots of work while smaller projects like NoScript could work with less.",
				"added": 1532280942
			}
		]
	},
	"comment_vote": {}
}