{
    "article": [
        {
            "title": "Auction theory",
            "text": "'''Auction theory''' is an applied branch of [[economics]] which deals with how people act in [[auction]] markets and researches the properties of auction markets. There are many possible designs (or sets of rules) for an auction and typical issues studied by auction theorists include the [[Efficiency (economics)|efficiency]] of a given auction design, [[optimal]] and equilibrium bidding strategies, and revenue comparison. Auction theory is also used as a tool to inform the design of real-world auctions; most notably auctions for the privatization of public-sector companies or the sale of licenses for use of the electromagnetic spectrum.\n\n==General idea==\nAuctions are characterized as transactions with a specific set of rules detailing resource allocation according to participants' bids. They are categorized as games with incomplete information because in the vast majority of auctions, one party will possess information related to the transaction that the other party does not (e.g., the bidders usually know their personal valuation of the item, which is unknown to the other bidders and the seller).<ref name=\"McAffeeandMcMillan\" /> Auctions take many forms, but they share the characteristic that they are ''universal'' and can be used to sell or buy any item. In many cases, the outcome of the auction does not depend on the identity of the bidders (i.e., auctions are ''anonymous''){{citation needed|date=March 2018}}.\n\nMost auctions have the feature that participants submit ''bids'', amounts of money they are willing to pay. ''Standard'' auctions require that the winner of the auction is the participant with the highest bid. A ''nonstandard'' auction does not require this (e.g., a lottery).\n\n==Types of auction==\n{{Main|Auction#Types}}\n\nThere are traditionally four types of auction that are used for the allocation of a single item:\n\n* [[First-price sealed-bid auctions]] in which bidders place their bid in a sealed envelope and simultaneously hand them to the auctioneer. The envelopes are opened and the individual with the highest bid wins, paying the amount bid.\n* [[Sealed second-price auction|Second-price sealed-bid auctions (Vickrey auctions)]] in which bidders place their bid in a sealed envelope and simultaneously hand them to the auctioneer. The envelopes are opened and the individual with the highest bid wins, paying a price equal to the ''second-highest'' bid.\n* [[English auction|Open ascending-bid auctions (English auctions)]] in which participants make increasingly higher bids, each stopping bidding when they are not prepared to pay more than the current highest bid. This continues until no participant is prepared to make a higher bid; the highest bidder wins the auction at the final amount bid. Sometimes the lot is only actually sold if the bidding reaches a reserve price set by the seller.\n* [[Dutch auction|Open descending-bid auctions (Dutch auctions)]] in which the price is set by the auctioneer at a level sufficiently high to deter all bidders, and is progressively lowered until a bidder is prepared to buy at the current price, winning the auction.\n\nMost auction theory revolves around these four \"basic\" auction types. However, other auction types have also received some academic study (see [[Auction#Types|Auction Types]]).\n\n=== Benchmark model ===\nThe ''benchmark model'' for auctions, as defined by McAfee and McMillan (1987), offers a generalization of auction formats, and is based on four assumptions:\n# All of the bidders are risk-neutral.\n# Each bidder has a private valuation for the item independently drawn from some probability distribution.\n# The bidders possess symmetric information.\n# The payment is represented as a function of only the bids.\nThe benchmark model is often used in tandem with the ''Revelation Principle'', which states that each of the basic auction types is structured such that each bidder has incentive to report their valuation honestly. The two are primarily used by sellers to determine the auction type that maximizes the expected price. This optimal auction format is defined such that the item will be offered to the bidder with the highest valuation at a price equal to their valuation, but the seller will refuse to sell the item if they expect that all of the bidders' valuations of the item are less than their own.<ref name=\"McAffeeandMcMillan\" />\n\nRelaxing each of the four main assumptions of the benchmark model yields auction formats with unique characteristics:\n* ''Risk-averse bidders'' incur some kind of cost from participating in risky behaviors, which affects their valuation of a product. In sealed-bid first-price auctions, risk-averse bidders are more willing to bid more to increase their probability of winning, which, in turn, increases their expected utility. This allows sealed-bid first-price auctions to produce higher expected revenue than English and sealed-bid second-price auctions.\n* In formats with ''correlated values''—where the bidders’ values for the item are not independent—one of the bidders perceiving their value of the item to be high makes it more likely that the other bidders will perceive their own values to be high. A notable example of this instance is the ''Winner’s curse'', where the results of the auction convey to the winner that everyone else estimated the value of the item to be less than they did. Additionally, the [[linkage principle]] allows revenue comparisons amongst a fairly general class of auctions with interdependence between bidders' values.\n* The ''asymmetric model'' assumes that bidders are separated into two classes that draw valuations from different distributions (i.e., dealers and collectors in an antiques auction).\n* In formats with ''royalties or incentive payments'', the seller incorporates additional factors, especially those that affect the true value of the item (e.g., supply, production costs, and royalty payments), into the price function.<ref name=\"McAffeeandMcMillan\" />\n\n==Game-theoretic models==\nA game-theoretic auction model is a [[Game theory#Representation of games|mathematical game]] represented by a [[Set (mathematics)|set]] of players, a set of actions ([[Strategy|strategies]]) available to each player, and a payoff [[vector (geometric)|vector]] corresponding to each [[combination]] of strategies. Generally, the players are the buyer(s) and the seller(s). The action set of each player is a set of bid [[Function (mathematics)|functions]] or [[reservation price]]s (reserves). Each bid function maps the player's [[Value (economics)|value]] (in the case of a buyer) or [[cost]] (in the case of a seller) to a bid [[price]]. The payoff of each player under a combination of strategies is the [[Expected utility hypothesis|expected utility]] (or [[Expected value|expected]] profit) of that player under that combination of strategies.\n\nGame-theoretic models of auctions and strategic bidding generally fall into either of the following two categories. In a [[private values auction model|private value model]], each participant (bidder) assumes that each of the [[Competition|competing]] bidders obtains a [[random]] ''private value'' from a [[probability distribution]]. In a [[Common value auction|common value]] model, the participants have equal valuations of the item, but they do not have perfectly accurate information about this valuation. In lieu of knowing the exact valuation of the item, each participant can assume that any other participant obtains a random signal, which can be used to estimate the true valuation, from a probability distribution common to all bidders.<ref>{{Cite book|title=Strategy: An Introduction to Game Theory, Third Edition|last=Watson|first=Joel|publisher=W.W. Norton & Company|year=2013|isbn=978-0-393-91838-0|location=New York, NY|pages=360–377|chapter=Chapter 27: Lemons, Auctions, and Information Aggregation|quote=|via=}}</ref> Usually, but not always, a private values model assumes that the values are [[Statistical independence|independent]] across bidders, whereas a common value model usually assumes that the values are independent up to the common [[parameter]]s of the probability distribution.\n\nA more general category for strategic bidding is the ''affiliated values model'', in which the bidder's total utility depends on both their individual private signal and some unknown common value. Both the private value and common value models can be perceived as extensions of the general affiliated values model.<ref>{{Cite journal|last=Li|first=Tong|last2=Perrigne|first2=Isabelle|last3=Vuong|first3=Quang|year=2002|title=Structural Estimation of the Affiliated Private Value Auction Model|url=|journal=The RAND Journal of Economics|volume=33|issue=2|pages=171–193|jstor=3087429|via=}}</ref>\n\n[[File:EnumaElish102.jpg|thumb|100px|right|Ex-post equilibrium in a simple auction market.]]When it is necessary to make explicit assumptions about bidders' value [[Probability distribution|distributions]], most of the published research assumes [[Symmetric game|symmetric]] bidders. This means that the probability distribution from which the bidders obtain their values (or signals) is identical across bidders. In a private values model which assumes independence, symmetry implies that the bidders' values are [[I.i.d.|independently and identically distributed (i.i.d.)]].\nAn important example (which does not assume independence) is [[Paul Milgrom|Milgrom]] and [[Robert J. Weber|Weber]]'s \"general symmetric model\" (1982).<ref>Milgrom, P., and R. Weber (1982) \"A Theory of Auctions and Competitive Bidding,\" Econometrica Vol. 50 No. 5, pp. 1089–1122.</ref><ref>Because bidders in real-world auctions are rarely symmetric, applied scientists began to research auctions with asymmetric value distributions beginning in the late 1980s.  Such applied research often depended on [[Numerical solution|numerical solution algorithms]] to compute an equilibrium and establish its properties.  Preston McAfee and John McMillan (1989) simulated bidding for a government contract in which the cost distribution of domestic firms is different from the cost distribution of the foreign firms (\"Government Procurement and International Trade,\" ''Journal of International Economics'', Vol. 26, pp. 291–308.)  One of the publications based on the earliest numerical research is Dalkir, S., J. W. Logan, and R. T. Masson, \"Mergers in Symmetric and Asymmetric Noncooperative Auction Markets: The Effects on Prices and Efficiency,\" published in Vol. 18 of ''The International Journal of Industrial Organization'', (2000, pp. 383–413).  Other pioneering research include Tschantz, S., P. Crooke, and L. Froeb, \"Mergers in Sealed versus Oral Auctions,\" published in Vol. 7 of ''The International Journal of the Economics of Business'' (2000, pp. 201–213).</ref> One of the earlier published theoretical research addressing properties of auctions among asymmetric bidders is Keith Waehrer's 1999 article.<ref>K. Waehrer (1999) \"Asymmetric Auctions With Application to Joint Bidding and Mergers,\" International Journal of Industrial Organization '''17''': 437–452</ref>  Later published research include [[Susan Athey]]'s 2001 Econometrica article,<ref>Athey, S. (2001) \"Single Crossing Properties and the Existence of Pure Strategy Equilibria in Games of Incomplete Information,\" Econometrica Vol. 69 No. 4, pp. 861–890.</ref> as well as Reny and Zamir (2004).<ref>Reny, P., and S. Zamir (2004) \"On the Existence of Pure Strategy Monotone Equilibria in Asymmetric First-Price Auctions,\" Econometrica, Vol. 72 No. 4, pp. 1105–1125.</ref>\n\nThe first formal analysis of auctions was by [[William Vickrey]] (1961). Vickrey considers two buyers bidding for a single item. Each buyer's value, v, is an independent draw from a uniform distribution with support [0,1]. Vickrey showed that in the sealed first-price auction it is an equilibrium bidding strategy for each bidder to bid half his valuation. With more bidders, all drawing a value from the same uniform distribution it is easy to show that the symmetric equilibrium bidding strategy is \n:<math>B(v)=\\left(\\frac{n-1}{n}\\right)v</math>.\nTo check that this is an equilibrium bidding strategy we must show that if it is the strategy adopted by the other n-1 buyers, then it is a best response for buyer 1 to adopt it also. Note that buyer 1 wins with probability 1 with a bid of (n-1)/n so we need only consider bids on the interval [0,(n-1)/n]. Suppose buyer 1 has value v and bids b. If buyer 2's value is x he bids B(x). Therefore buyer 1 beats buyer 2 if\n\n:<math>B(x)=\\left(\\frac{n-1}{n}\\right)x<b</math>  that is  <math>x<\\left(\\frac{n}{n-1}\\right)b</math>\nSince x is uniformly distributed, buyer 1 bids higher than buyer 2 with probability nb/(n-1). To be the winning bidder, buyer 1 must bid higher than all the other bidders (which are bidding independently). Then his win probability is\n:<math>w(b)=\\Pr {{\\{{{b}_{2}}<b\\}}^{n-1}}={{\\left(\\frac{n}{n-1}\\right)}^{n-1}}{{b}^{n-1}}</math>\nBuyer 1's expected payoff is his win probability times his gain if he wins. That is,\n:<math>U(b)=w(b)(v-b)={{\\left(\\frac{n}{n-1}\\right)}^{n-1}}{{b}^{n-1}}(v-b)={{\\left(\\frac{n}{n-1}\\right)}^{n-1}}({{b}^{n-1}}v-{{b}^{n}})</math>\nIt is readily confirmed by differentiation that U(b) takes on its maximum at \n:<math>B(v)=\\left(\\frac{n-1}{n}\\right)v</math>\n\nIt is not difficult to show that B(v) is the unique symmetric equilibrium. Lebrun (1996)<ref>Lebrun, Bernard (1996) \"Existence of an equilibrium in first price auctions,\" Economic Theory, Vol. 7 No. 3, pp. 421–443.</ref> provides a  general proof that there are no asymmetric equilibria.\n\n==Revenue equivalence==\n{{Main|Revenue equivalence}}\nOne of the major findings of auction theory is the celebrated '''Revenue equivalence theorem'''. Early equivalence results focused on a comparison of revenue in the most common auctions. The first such proof, for the case of two buyers and uniformly distributed values was by {{Harvtxt|Vickrey|1961}}. In 1979 {{harvtxt|Riley|Samuelson|1981}} proved a much more general result. (Quite independently and soon after, this was also derived by {{Harvtxt|Myerson|1981}}).The [[revenue equivalence theorem]] states that any allocation mechanism or auction that satisfies the four main assumptions of the benchmark model will lead to the same expected revenue for the seller (and player ''i'' of type ''v'' can expect the same surplus across auction types).<ref name=\"McAffeeandMcMillan\" />\n\nRelaxing these assumptions can provide valuable insights for auction design. Decision biases can also lead to predictable non-equivalencies. Additionally, if some bidders are known to have a higher valuation for the lot, techniques such as price-discriminating against such bidders will yield higher returns. In other words, if a bidder is known to value the lot at $X more than the next highest bidder, the seller can increase their profits by charging that bidder $X – Δ (a sum just slightly inferior to the sum is willing to pay) more than any other bidder (or equivalently a special bidding fee of $X – Δ). This bidder will still win the lot, but will pay more than would otherwise be the case.<ref name=\"McAffeeandMcMillan\">{{cite_journal |last=McAfee |first=R. Preston |authorlink2=John McMillan (economist) |first2=John |last2=McMillan |year=1987 |title=Auctions and Bidding |journal=[[Journal of Economic Literature]] |volume=25 |issue=2 |pages=699–738 |jstor=2726107 }}</ref>\n\n==Winner's curse==\n\nThe [[winner's curse]] is a phenomenon which can occur in ''common value'' settings—when the actual values to the different bidders are unknown but correlated, and the bidders make bidding decisions based on estimated values. In such cases, the winner will tend to be the bidder with the highest estimate, but the results of the auction will show that the remaining bidders' estimates of the item's value are less than that of the winner, giving the winner the impression that they \"bid too much\".<ref name=\"McAffeeandMcMillan\" />\n\nIn an equilibrium of such a game, the winner's curse does not occur because the bidders account for the bias in their bidding strategies. Behaviorally and empirically, however, winner's curse is a common phenomenon. (cf. [[Richard Thaler]]).\n\n==JEL classification==\nIn the [[JEL classification codes|Journal of Economic Literature Classification System]] C7 is the classification for Game Theory and D44 is the classification for Auctions.<ref name=\"JEL\">\n{{cite web\n  | title = Journal of Economic Literature Classification System\n  | publisher = American Economic Association\n  | url = http://aea-web.org/journal/jel_class_system.html\n  | accessdate = 2008-06-25\n}} (D: Microeconomics, D4: Market Structure and Pricing, D44: Auctions)</ref>\n\n==Footnotes==\n<references/>\n\n==Further reading==\n* Cassady, R. (1967). Auctions and auctioneering. [[University of California Press]]. An influential early survey.\n* Klemperer, P. (Ed.). (1999b). The economic theory of auctions. Edward Elgar. A collection of seminal papers in auction theory.\n* Klemperer, P. (1999a). Auction theory: A guide to the literature. Journal of Economic Surveys, 13(3), 227–286. A good modern survey; the first chapter of the preceding book.\n* {{cite book|author=Klemperer, Paul|year=2004|title=Auctions: Theory and Practice|publisher=[[Princeton University Press]]|isbn=0-691-11925-2}} [http://www.nuff.ox.ac.uk/users/klemperer/VirtualBook/VirtualBookCoverSheet.asp Draft edition available online]\n* {{cite book | last1=Krishna | first1=Vijay | year=2002 | title=Auction theory | location=New York | publisher=[[Elsevier]] | isbn=978-0-12-426297-3}} A very good modern textbook on auction theory.\n* {{Cite journal\n  | author = McAfee, R. P. and J. McMillan\n  | title = Auctions and Bidding\n  | journal = [[Journal of Economic Literature]]\n  | volume = 25\n  | pages = 708–47\n  | year = 1987\n  | postscript = <!--None-->\n }}. A survey.\n* Myerson, R. (1981). Optimal auction design. [[Mathematics of Operations Research]], 6(1), 58–73. A seminal paper, introduced revenue equivalence and optimal auctions.\n* Riley, J., and Samuelson, W. (1981). Optimal auctions. [[The American Economic Review]], 71(3), 381–392. A seminal paper; published concurrently with Myerson's paper cited above.\n* Parsons, S., Rodriguez-Aguilar, J. A., and Klein, M. (2011).  [http://www.sci.brooklyn.cuny.edu/~parsons/projects/mech-design/publications/bluffers-final.pdf Auctions and bidding: A guide for computer scientists].\n* {{cite book | last1=Shoham | first1=Yoav | last2=Leyton-Brown | first2=Kevin | title=Multiagent Systems: Algorithmic, Game-Theoretic, and Logical Foundations | publisher=[[Cambridge University Press]] | isbn=978-0-521-89943-7 | url=http://www.masfoundations.org | year=2009 | location=New York}} A recent textbook; see Chapter 11, which presents auction theory from a computational perspective. [http://www.masfoundations.org/download.html Downloadable free online].\n* Vickrey, W. (1961). Counterspeculation, auctions, and competitive sealed tenders. The Journal of Finance, 16(1), 8–37. A pathbreaking paper that introduced second price auctions and performed new analysis of first price.\n* Wilson, R. (1987a). Auction theory. In J. Eatwell, M. Milgate, P. Newman (Eds.), [[The New Palgrave Dictionary of Economics]], vol. I. London: Macmillan.\n\n==External links==\n* [http://www.gametheory.net/dictionary/Auctions/ Auctions on GameTheory.net], also available on the [https://web.archive.org/web/20170227204629/http://www.gametheory.net/dictionary/Auctions/ Wayback Machine]\n\n[[Category:Auction theory| ]]\n[[Category:Game theory]]",
            "slug": "auction-theory",
            "date_updated": 1533067365300,
            "imported": "https://en.wikipedia.org/wiki/Auction_theory"
        },
        {
            "title": "Auction theory",
            "text": "'''Auction theory''' is an applied branch of [[economics]] which deals with how people act in [[auction]] markets and researches the properties of auction markets. There are many possible designs (or sets of rules) for an auction and typical issues studied by auction theorists include the [[Efficiency (economics)|efficiency]] of a given auction design, [[optimal]] and equilibrium bidding strategies, and revenue comparison. Auction theory is also used as a tool to inform the design of real-world auctions; most notably auctions for the privatization of public-sector companies or the sale of licenses for use of the electromagnetic spectrum.\n\n==General idea==\nAuctions are characterized as transactions with a specific set of rules detailing resource allocation according to participants' bids. They are categorized as games with incomplete information because in the vast majority of auctions, one party will possess information related to the transaction that the other party does not (e.g., the bidders usually know their personal valuation of the item, which is unknown to the other bidders and the seller).<ref name=\"McAffeeandMcMillan\" /> Auctions take many forms, but they share the characteristic that they are ''universal'' and can be used to sell or buy any item. In many cases, the outcome of the auction does not depend on the identity of the bidders (i.e., auctions are ''anonymous''){{citation needed|date=March 2018}}.\n\nMost auctions have the feature that participants submit ''bids'', amounts of money they are willing to pay. ''Standard'' auctions require that the winner of the auction is the participant with the highest bid. A ''nonstandard'' auction does not require this (e.g., a lottery).\n\n==Types of auction==\n{{Main|Auction#Types}}\n\nThere are traditionally four types of auction that are used for the allocation of a single item:\n\n* [[First-price sealed-bid auctions]] in which bidders place their bid in a sealed envelope and simultaneously hand them to the auctioneer. The envelopes are opened and the individual with the highest bid wins, paying the amount bid.\n* [[Sealed second-price auction|Second-price sealed-bid auctions (Vickrey auctions)]] in which bidders place their bid in a sealed envelope and simultaneously hand them to the auctioneer. The envelopes are opened and the individual with the highest bid wins, paying a price equal to the ''second-highest'' bid.\n* [[English auction|Open ascending-bid auctions (English auctions)]] in which participants make increasingly higher bids, each stopping bidding when they are not prepared to pay more than the current highest bid. This continues until no participant is prepared to make a higher bid; the highest bidder wins the auction at the final amount bid. Sometimes the lot is only actually sold if the bidding reaches a reserve price set by the seller.\n* [[Dutch auction|Open descending-bid auctions (Dutch auctions)]] in which the price is set by the auctioneer at a level sufficiently high to deter all bidders, and is progressively lowered until a bidder is prepared to buy at the current price, winning the auction.\n\nMost auction theory revolves around these four \"basic\" auction types. However, other auction types have also received some academic study (see [[Auction#Types|Auction Types]]).\n\n=== Benchmark model ===\nThe ''benchmark model'' for auctions, as defined by McAfee and McMillan (1987), offers a generalization of auction formats, and is based on four assumptions:\n# All of the bidders are risk-neutral.\n# Each bidder has a private valuation for the item independently drawn from some probability distribution.\n# The bidders possess symmetric information.\n# The payment is represented as a function of only the bids.\nThe benchmark model is often used in tandem with the ''Revelation Principle'', which states that each of the basic auction types is structured such that each bidder has incentive to report their valuation honestly. The two are primarily used by sellers to determine the auction type that maximizes the expected price. This optimal auction format is defined such that the item will be offered to the bidder with the highest valuation at a price equal to their valuation, but the seller will refuse to sell the item if they expect that all of the bidders' valuations of the item are less than their own.<ref name=\"McAffeeandMcMillan\" />\n\nRelaxing each of the four main assumptions of the benchmark model yields auction formats with unique characteristics:\n* ''Risk-averse bidders'' incur some kind of cost from participating in risky behaviors, which affects their valuation of a product. In sealed-bid first-price auctions, risk-averse bidders are more willing to bid more to increase their probability of winning, which, in turn, increases their expected utility. This allows sealed-bid first-price auctions to produce higher expected revenue than English and sealed-bid second-price auctions.\n* In formats with ''correlated values''—where the bidders’ values for the item are not independent—one of the bidders perceiving their value of the item to be high makes it more likely that the other bidders will perceive their own values to be high. A notable example of this instance is the ''Winner’s curse'', where the results of the auction convey to the winner that everyone else estimated the value of the item to be less than they did. Additionally, the [[linkage principle]] allows revenue comparisons amongst a fairly general class of auctions with interdependence between bidders' values.\n* The ''asymmetric model'' assumes that bidders are separated into two classes that draw valuations from different distributions (i.e., dealers and collectors in an antiques auction).\n* In formats with ''royalties or incentive payments'', the seller incorporates additional factors, especially those that affect the true value of the item (e.g., supply, production costs, and royalty payments), into the price function.<ref name=\"McAffeeandMcMillan\" />\n\n==Game-theoretic models==\nA game-theoretic auction model is a [[Game theory#Representation of games|mathematical game]] represented by a [[Set (mathematics)|set]] of players, a set of actions ([[Strategy|strategies]]) available to each player, and a payoff [[vector (geometric)|vector]] corresponding to each [[combination]] of strategies. Generally, the players are the buyer(s) and the seller(s). The action set of each player is a set of bid [[Function (mathematics)|functions]] or [[reservation price]]s (reserves). Each bid function maps the player's [[Value (economics)|value]] (in the case of a buyer) or [[cost]] (in the case of a seller) to a bid [[price]]. The payoff of each player under a combination of strategies is the [[Expected utility hypothesis|expected utility]] (or [[Expected value|expected]] profit) of that player under that combination of strategies.\n\nGame-theoretic models of auctions and strategic bidding generally fall into either of the following two categories. In a [[private values auction model|private value model]], each participant (bidder) assumes that each of the [[Competition|competing]] bidders obtains a [[random]] ''private value'' from a [[probability distribution]]. In a [[Common value auction|common value]] model, the participants have equal valuations of the item, but they do not have perfectly accurate information about this valuation. In lieu of knowing the exact valuation of the item, each participant can assume that any other participant obtains a random signal, which can be used to estimate the true valuation, from a probability distribution common to all bidders.<ref>{{Cite book|title=Strategy: An Introduction to Game Theory, Third Edition|last=Watson|first=Joel|publisher=W.W. Norton & Company|year=2013|isbn=978-0-393-91838-0|location=New York, NY|pages=360–377|chapter=Chapter 27: Lemons, Auctions, and Information Aggregation|quote=|via=}}</ref> Usually, but not always, a private values model assumes that the values are [[Statistical independence|independent]] across bidders, whereas a common value model usually assumes that the values are independent up to the common [[parameter]]s of the probability distribution.\n\nA more general category for strategic bidding is the ''affiliated values model'', in which the bidder's total utility depends on both their individual private signal and some unknown common value. Both the private value and common value models can be perceived as extensions of the general affiliated values model.<ref>{{Cite journal|last=Li|first=Tong|last2=Perrigne|first2=Isabelle|last3=Vuong|first3=Quang|year=2002|title=Structural Estimation of the Affiliated Private Value Auction Model|url=|journal=The RAND Journal of Economics|volume=33|issue=2|pages=171–193|jstor=3087429|via=}}</ref>\n\n[[File:EnumaElish102.jpg|thumb|100px|right|Ex-post equilibrium in a simple auction market.]]When it is necessary to make explicit assumptions about bidders' value [[Probability distribution|distributions]], most of the published research assumes [[Symmetric game|symmetric]] bidders. This means that the probability distribution from which the bidders obtain their values (or signals) is identical across bidders. In a private values model which assumes independence, symmetry implies that the bidders' values are [[I.i.d.|independently and identically distributed (i.i.d.)]].\nAn important example (which does not assume independence) is [[Paul Milgrom|Milgrom]] and [[Robert J. Weber|Weber]]'s \"general symmetric model\" (1982).<ref>Milgrom, P., and R. Weber (1982) \"A Theory of Auctions and Competitive Bidding,\" Econometrica Vol. 50 No. 5, pp. 1089–1122.</ref><ref>Because bidders in real-world auctions are rarely symmetric, applied scientists began to research auctions with asymmetric value distributions beginning in the late 1980s.  Such applied research often depended on [[Numerical solution|numerical solution algorithms]] to compute an equilibrium and establish its properties.  Preston McAfee and John McMillan (1989) simulated bidding for a government contract in which the cost distribution of domestic firms is different from the cost distribution of the foreign firms (\"Government Procurement and International Trade,\" ''Journal of International Economics'', Vol. 26, pp. 291–308.)  One of the publications based on the earliest numerical research is Dalkir, S., J. W. Logan, and R. T. Masson, \"Mergers in Symmetric and Asymmetric Noncooperative Auction Markets: The Effects on Prices and Efficiency,\" published in Vol. 18 of ''The International Journal of Industrial Organization'', (2000, pp. 383–413).  Other pioneering research include Tschantz, S., P. Crooke, and L. Froeb, \"Mergers in Sealed versus Oral Auctions,\" published in Vol. 7 of ''The International Journal of the Economics of Business'' (2000, pp. 201–213).</ref> One of the earlier published theoretical research addressing properties of auctions among asymmetric bidders is Keith Waehrer's 1999 article.<ref>K. Waehrer (1999) \"Asymmetric Auctions With Application to Joint Bidding and Mergers,\" International Journal of Industrial Organization '''17''': 437–452</ref>  Later published research include [[Susan Athey]]'s 2001 Econometrica article,<ref>Athey, S. (2001) \"Single Crossing Properties and the Existence of Pure Strategy Equilibria in Games of Incomplete Information,\" Econometrica Vol. 69 No. 4, pp. 861–890.</ref> as well as Reny and Zamir (2004).<ref>Reny, P., and S. Zamir (2004) \"On the Existence of Pure Strategy Monotone Equilibria in Asymmetric First-Price Auctions,\" Econometrica, Vol. 72 No. 4, pp. 1105–1125.</ref>\n\nThe first formal analysis of auctions was by [[William Vickrey]] (1961). Vickrey considers two buyers bidding for a single item. Each buyer's value, v, is an independent draw from a uniform distribution with support [0,1]. Vickrey showed that in the sealed first-price auction it is an equilibrium bidding strategy for each bidder to bid half his valuation. With more bidders, all drawing a value from the same uniform distribution it is easy to show that the symmetric equilibrium bidding strategy is \n:<math>B(v)=\\left(\\frac{n-1}{n}\\right)v</math>.\nTo check that this is an equilibrium bidding strategy we must show that if it is the strategy adopted by the other n-1 buyers, then it is a best response for buyer 1 to adopt it also. Note that buyer 1 wins with probability 1 with a bid of (n-1)/n so we need only consider bids on the interval [0,(n-1)/n]. Suppose buyer 1 has value v and bids b. If buyer 2's value is x he bids B(x). Therefore buyer 1 beats buyer 2 if\n\n:<math>B(x)=\\left(\\frac{n-1}{n}\\right)x<b</math>  that is  <math>x<\\left(\\frac{n}{n-1}\\right)b</math>\nSince x is uniformly distributed, buyer 1 bids higher than buyer 2 with probability nb/(n-1). To be the winning bidder, buyer 1 must bid higher than all the other bidders (which are bidding independently). Then his win probability is\n:<math>w(b)=\\Pr {{\\{{{b}_{2}}<b\\}}^{n-1}}={{\\left(\\frac{n}{n-1}\\right)}^{n-1}}{{b}^{n-1}}</math>\nBuyer 1's expected payoff is his win probability times his gain if he wins. That is,\n:<math>U(b)=w(b)(v-b)={{\\left(\\frac{n}{n-1}\\right)}^{n-1}}{{b}^{n-1}}(v-b)={{\\left(\\frac{n}{n-1}\\right)}^{n-1}}({{b}^{n-1}}v-{{b}^{n}})</math>\nIt is readily confirmed by differentiation that U(b) takes on its maximum at \n:<math>B(v)=\\left(\\frac{n-1}{n}\\right)v</math>\n\nIt is not difficult to show that B(v) is the unique symmetric equilibrium. Lebrun (1996)<ref>Lebrun, Bernard (1996) \"Existence of an equilibrium in first price auctions,\" Economic Theory, Vol. 7 No. 3, pp. 421–443.</ref> provides a  general proof that there are no asymmetric equilibria.\n\n==Revenue equivalence==\n{{Main|Revenue equivalence}}\nOne of the major findings of auction theory is the celebrated '''Revenue equivalence theorem'''. Early equivalence results focused on a comparison of revenue in the most common auctions. The first such proof, for the case of two buyers and uniformly distributed values was by {{Harvtxt|Vickrey|1961}}. In 1979 {{harvtxt|Riley|Samuelson|1981}} proved a much more general result. (Quite independently and soon after, this was also derived by {{Harvtxt|Myerson|1981}}).The [[revenue equivalence theorem]] states that any allocation mechanism or auction that satisfies the four main assumptions of the benchmark model will lead to the same expected revenue for the seller (and player ''i'' of type ''v'' can expect the same surplus across auction types).<ref name=\"McAffeeandMcMillan\" />\n\nRelaxing these assumptions can provide valuable insights for auction design. Decision biases can also lead to predictable non-equivalencies. Additionally, if some bidders are known to have a higher valuation for the lot, techniques such as price-discriminating against such bidders will yield higher returns. In other words, if a bidder is known to value the lot at $X more than the next highest bidder, the seller can increase their profits by charging that bidder $X – Δ (a sum just slightly inferior to the sum is willing to pay) more than any other bidder (or equivalently a special bidding fee of $X – Δ). This bidder will still win the lot, but will pay more than would otherwise be the case.<ref name=\"McAffeeandMcMillan\">{{cite_journal |last=McAfee |first=R. Preston |authorlink2=John McMillan (economist) |first2=John |last2=McMillan |year=1987 |title=Auctions and Bidding |journal=[[Journal of Economic Literature]] |volume=25 |issue=2 |pages=699–738 |jstor=2726107 }}</ref>\n\n==Winner's curse==\n\nThe [[winner's curse]] is a phenomenon which can occur in ''common value'' settings—when the actual values to the different bidders are unknown but correlated, and the bidders make bidding decisions based on estimated values. In such cases, the winner will tend to be the bidder with the highest estimate, but the results of the auction will show that the remaining bidders' estimates of the item's value are less than that of the winner, giving the winner the impression that they \"bid too much\".<ref name=\"McAffeeandMcMillan\" />\n\nIn an equilibrium of such a game, the winner's curse does not occur because the bidders account for the bias in their bidding strategies. Behaviorally and empirically, however, winner's curse is a common phenomenon. (cf. [[Richard Thaler]]).\n\n==JEL classification==\nIn the [[JEL classification codes|Journal of Economic Literature Classification System]] C7 is the classification for Game Theory and D44 is the classification for Auctions.<ref name=\"JEL\">\n{{cite web\n  | title = Journal of Economic Literature Classification System\n  | publisher = American Economic Association\n  | url = http://aea-web.org/journal/jel_class_system.html\n  | accessdate = 2008-06-25\n}} (D: Microeconomics, D4: Market Structure and Pricing, D44: Auctions)</ref>\n\n==Footnotes==\n<references/>\n\n==Further reading==\n* Cassady, R. (1967). Auctions and auctioneering. [[University of California Press]]. An influential early survey.\n* Klemperer, P. (Ed.). (1999b). The economic theory of auctions. Edward Elgar. A collection of seminal papers in auction theory.\n* Klemperer, P. (1999a). Auction theory: A guide to the literature. Journal of Economic Surveys, 13(3), 227–286. A good modern survey; the first chapter of the preceding book.\n* {{cite book|author=Klemperer, Paul|year=2004|title=Auctions: Theory and Practice|publisher=[[Princeton University Press]]|isbn=0-691-11925-2}} [http://www.nuff.ox.ac.uk/users/klemperer/VirtualBook/VirtualBookCoverSheet.asp Draft edition available online]\n* {{cite book | last1=Krishna | first1=Vijay | year=2002 | title=Auction theory | location=New York | publisher=[[Elsevier]] | isbn=978-0-12-426297-3}} A very good modern textbook on auction theory.\n* {{Cite journal\n  | author = McAfee, R. P. and J. McMillan\n  | title = Auctions and Bidding\n  | journal = [[Journal of Economic Literature]]\n  | volume = 25\n  | pages = 708–47\n  | year = 1987\n  | postscript = <!--None-->\n }}. A survey.\n* Myerson, R. (1981). Optimal auction design. [[Mathematics of Operations Research]], 6(1), 58–73. A seminal paper, introduced revenue equivalence and optimal auctions.\n* Riley, J., and Samuelson, W. (1981). Optimal auctions. [[The American Economic Review]], 71(3), 381–392. A seminal paper; published concurrently with Myerson's paper cited above.\n* Parsons, S., Rodriguez-Aguilar, J. A., and Klein, M. (2011).  [http://www.sci.brooklyn.cuny.edu/~parsons/projects/mech-design/publications/bluffers-final.pdf Auctions and bidding: A guide for computer scientists].\n* {{cite book | last1=Shoham | first1=Yoav | last2=Leyton-Brown | first2=Kevin | title=Multiagent Systems: Algorithmic, Game-Theoretic, and Logical Foundations | publisher=[[Cambridge University Press]] | isbn=978-0-521-89943-7 | url=http://www.masfoundations.org | year=2009 | location=New York}} A recent textbook; see Chapter 11, which presents auction theory from a computational perspective. [http://www.masfoundations.org/download.html Downloadable free online].\n* Vickrey, W. (1961). Counterspeculation, auctions, and competitive sealed tenders. The Journal of Finance, 16(1), 8–37. A pathbreaking paper that introduced second price auctions and performed new analysis of first price.\n* Wilson, R. (1987a). Auction theory. In J. Eatwell, M. Milgate, P. Newman (Eds.), [[The New Palgrave Dictionary of Economics]], vol. I. London: Macmillan.\n\n==External links==\n* [http://www.gametheory.net/dictionary/Auctions/ Auctions on GameTheory.net], also available on the [https://web.archive.org/web/20170227204629/http://www.gametheory.net/dictionary/Auctions/ Wayback Machine]\n\n[[Category:Auction theory| ]]\n[[Category:Game theory]]",
            "slug": "auction-theory",
            "date_updated": 1533067367000,
            "imported": "https://en.wikipedia.org/wiki/Auction_theory"
        }
    ]
}