{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Un \"Zite\" específico sobre videojuegos",
			"body": "¡Hola gente!\nMe dí cuenta de que en ZeroNet no hay demasiadas cosas sobre gaming en español. Por esta razón, acabo de crear un board dedicado a los gamers de habla hispana. Se llama \"Zero Juegos\".\nEntren y díganme qué les parece ;)\n(puede haber errores, ya que es la primera vez que publico un \"z\"itio en ZeroNet)\n\nhttp://127.0.0.1:43110/1E3x1bMj78DVgX5QoAYHc8ofEJbjX6LZ4o\n\n¡Saludos!",
			"added": 1538073283
		},
		{
			"topic_id": 2,
			"title": "ZeroWiki en español: La wiki descentralizada",
			"body": "¡Hola gente!\nMe encontré con este Zitio: http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ y estaba pensando en que tiene bastante potencial: ¿Se imaginan crear una wiki descentralizada, como una alternativa a Wikipedia?\n\nPor eso les quería decir que si tienen ganas de colaborar, sería una buena idea comenzar a escribir artículos sobre diversos temas para que comience a crecer.\nPor otro lado, hice una especie de \"logo\" para el Zitio: https://svgshare.com/i/8g_.svg . ¿Qué les parece?\nSi alguien tiene alguna idea mejor, sientase libre de crear su propia imagen y mostrarla.\n\nDesde ya, muchas gracias.\n-Lordnet-",
			"added": 1539200594
		}
	],
	"topic_vote": {
		"2_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": 1,
		"36_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": 1,
		"1_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": 1,
		"1_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1
	},
	"next_comment_id": 3,
	"comment": {
		"2_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 1,
				"body": "> [el3ctron](#comment_1_1S6HYgixbMAbyjpK1pq71UHa9vemyKowo): es un a excelente idea!\n\n¡Me alegro de que te haya gustado la idea!\nCreo que entonces tenemos que ponernos a trabajar en dos aspectos:\n\n1: Atraer gente hispanohablante a esta plataforma que quiera colaborar con la Wiki descentralizada.\n2: Aumentar el número de artículos y mejorar la clasificación de los contenidos.\n\nPor mi parte, pienso dedicarme a ir agregando artículos a la wiki. Sin embargo, creo que es un proyecto que vale la pena tomarse más en serio.\n\nEstá claro que si queremos mantener la libertad de compartir contenidos, el Internet descentralizado es el lugar para eso, sobre todo ante ciertas acciones de los gobiernos contra la red...\n\n¡Saludos!",
				"added": 1540690415
			}
		],
		"1_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 2,
				"body": "Hola\n\nHay muchas cosas que podríamos hacer, pero me doy cuenta de que no hay suficiente actividad en español en ZeroNet.\n\nTal vez deberíamos dedicarnos a hacer que esta plataforma sea más conocida; por ejemplo, recomendándosela a amigos o mediante nuestras redes sociales.\n\nTambién podríamos pedirle a youtubers dedicados a la tecnología, que hablen sobre el internet descentralizado. Creo que con todo lo que está pasando en la Unión Europea, mucha gente estará interesada en probar ZeroNet y podríamos hacer algo grande.\n\nNo dejemos que esto quede en el olvido. Hagamos algo.\n\n¡Saludos!",
				"added": 1540690789
			}
		]
	},
	"comment_vote": {
		"1_1S6HYgixbMAbyjpK1pq71UHa9vemyKowo": 1,
		"1_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": 1,
		"1_1QBAch1RKFoDyVPeMi5z73ToLosXkEz2hD": 1,
		"2_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": 1
	}
}