{
	"next_comment_id": 12,
	"user_name": "If0",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Наверно возникает сезонное желеание в хакеров поиграть... Которое скоро проходит, потому что становится скучно :)",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557176385",
			"date_added": 1557330399
		},
		{
			"comment_id": 2,
			"body": "@Xan: Уж лучше хоть какой-нибудь секс ( пусть даже с компьютером), чем вообще никакого :)",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557176385",
			"date_added": 1557361074
		},
		{
			"comment_id": 3,
			"body": "@caryoscelus: К сожалению, если народ в подавляющем большинстве до сих пор не понимает, что постя свой контент в любую коммерческую социалку - он кормит ее владельца, являясь для него прямым источником сверхдохода - бесплатной рабочей силой, которой он нагло пользуется играя на потребности общения. Такой народ не пойдейт в свободную сеть. Потому что не видит между ними разницы. Разве только, что в коммерческой сети пользователй много, поэтому есть с кем общаться и что читать...  ",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557522308
		},
		{
			"comment_id": 4,
			"body": "@caryoscelus: \n> Люди вовсе необязательно чего-то не понимают, у них просто другие приоритеты\nСкорее, им просто - все равно, лень заморачиваться. Все так делают, значит это - правильно, и я буду делать  вместе с ними. Только когда реальность заставит их задуматься о своих неразумных действиях, будет слишком поздно. Классическая ситуация: \"Когда они пришли...\"",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557563726
		},
		{
			"comment_id": 5,
			"body": "@caryoscelus: \n> которые бы перешли на нецензурируемую/неподконтрольную платформу, если бы та стала \"достаточно\" популярна\nХозяева коммерческих платформ этого не допустят. Хотя, наметилась тенденция закручивания гаек с цензурой: где про секс нельзя упоминать, где банят за \"хейт спич\" или за недостаточную толерастию или лояльность к властям.",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557564337
		},
		{
			"comment_id": 6,
			"body": "@Anonymouslogin: \n> Немного статистики по популяризации\n\nКогда только выходит что-то новое, вокруг него традиционно начинается хайп. Но если это новое оказывется нишевым прдуктом, не очень нужным и подходящим для массового использовния, хайп быстро спадает и зеваки, рассматривающие новую диковинку быстро расходятся.\nБыстрый спад хайпа свидетельсвует о существенных проблеммах, мешающих его массовому использованию. Хороший тому пример - распределеный мессенджер Bitmessage, про который в свое время не писал только ленивый.\n\n",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557664562
		},
		{
			"comment_id": 7,
			"body": "@Xan: \n> И намекаю на то, что ZN следует не популяризировть, а развивать строго точечно, то есть в режиме human to human.\n\nСогласен. Если за годы существования сети в ней не прибавляется пользователей, то причины этого \"лежат вне области популяризации\". Наверное дело в других факторах: особенностях технологии, сложности вхождения, неудобстве использования, ненадежности, недоработанности, отсутствие извесности, авторитета и, как следствие этого, доверия к разработчикам - всего того с чем способны мириться далеко не все. В особенности при наличии извесных альтернатив, лишенных явных недостатков с точки зрения массового пользователя.",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557666819
		},
		{
			"comment_id": 8,
			"body": "@Xan: \n> Ведь массовый пользователь ( читай потребитель ) всегда приходит за своей выгодой. Вот какая ему выгода в наших зеронетах?\n\nЗдесь не спрашивают телефонный номер, не достают рекламой, не предлагают экспортировать содержимое телефонной книги \"с целью повышения удобства нашего сервиса\", не заставляют соглашаться с  \"условиями использования\" и не могут забанить в любой момент по причине \"админу перестала нравиться ваша рожа\" :) По моему - это уже заметная выгода перед другими сетями.\n\n> перед самым входом одни убытки\nС этим не поспоришь, но тем не менее они не столь масштабные, что бы полностью свести на нет выгоду.",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557694436
		},
		{
			"comment_id": 9,
			"body": "@Xan: \n> Те, кто уже ощущают потребность в платформе и достаточно технически подготовлены, уже могут её обнаружить.\n\nИменно. Те, кто осознал для себя потребность в подобном техническом решении, уже используют сети похожего на ZN типа. Или, по крайней, мере ищут и пробуют альтернативы. А те, кому все равно, так и продолжат сидеть в коммерческих.",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557695190
		},
		{
			"comment_id": 10,
			"body": "@Xan: \n> Пользователь приходит не из-за отсутствия ограничений и дополнительных условий, наоборот, он соглашается на них, чтобы получить свою выгоду.\n\nБорьба двух мазохизмов: технического - в альтернативных сетях, против административного - в коммерческих.",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1557512071",
			"date_added": 1557695848
		},
		{
			"comment_id": 11,
			"body": ">Но нужно же человекам как-то самоутверждаться.\n\nНекоторые находят извращенные способы прокачки ЧСВ...\n\n >А накопление изошников это типичное собирательство.\n\nПозволю себе не согласиться. Ведь, жаль не взять, когда дают на халяву :-) Нужно оно - не нужно и что с этим потом делать, решим потом, по обстоятельствам, когда встанет такой вопрос, а на данный момент главное - не упустить сидов на раздаче.",
			"post_uri": "1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY_1561999667",
			"date_added": 1562002425
		}
	]
}