{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1569959500,
			"title": "disability question",
			"body": "How do I appeal my rep payee? I got a letter saying I need to appeal rep payee status in 60 days, my credit union account is gone even the money I worked part-time. I don't want to live my parents forever because my mom is too overprotective. I am starting to feel suicidal. Can't I at least change my rep payee and live with my brother or sister instead? Going to my local social security office is no help.",
			"added": 1569959498
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1565874606_1GZPZKDb8JzHmjYMt14L3dHpzPxnNYm3Sn": [
			{
				"comment_id": 1,
				"body": "I got it as soon I entered 08chan and tried to post.",
				"added": 1565875104
			}
		],
		"3_1LJMypJ67iEBwah82xwVVdB8SGZ1mwqgHQ": [
			{
				"comment_id": 4,
				"body": "test",
				"added": 1567390547
			},
			{
				"comment_id": 5,
				"body": "ok",
				"added": 1567390587
			}
		],
		"1569959500_1GZPZKDb8JzHmjYMt14L3dHpzPxnNYm3Sn": [
			{
				"comment_id": 6,
				"body": "> [duende](#comment_116_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, useless maggot.\nI got my worker comp settlement a year ago now this my first check I got from disability. Right now I am only working only 10 hours a week\n",
				"added": 1569962919
			},
			{
				"comment_id": 7,
				"body": "> [cactusdragon](#comment_34_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): I can't give legal advice, but that's what i would do:If you can't get through with the appeal, get a offline monero wallet for example. (or bitcoin = payment on many websites)And wait until you have freedom. [...]\n\nYes I live in the US, I already sent the appeal but I need to provide proof that I could handle my own money somehow. Don't know which to see doctor to prove that I could handle my own money .",
				"added": 1570017945
			},
			{
				"comment_id": 8,
				"body": ">Hearing – If you have a hearing, the judge may ask you questions about your finances. \nDon't remember being asked that\n>after approval – You will probably meet or speak on the phone to review your finances \nDon't remember being asked that, they made me sign my finances  to my Mom without questions from me as soon as I got approved",
				"added": 1570148862
			},
			{
				"comment_id": 9,
				"body": "basically the vocational expert that was suppose to argue against me during my disability hearing somehow argued for me after one or two questions. It felt so surreal",
				"added": 1570149395
			},
			{
				"comment_id": 10,
				"body": ">The decision can be made by any of these people, or by some combination:\n>The judge – If you have a hearing with a judge, the judge may make a decision about representative payee status, and this may be written in your award letter.\n> this may be written in your award letter.\nThis is the most likely situation on what  happened.",
				"added": 1570150500
			},
			{
				"comment_id": 11,
				"body": "> [cactusdragon](#comment_40_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr): xample: people being sentenced without evidence)\n>I hope you get through with it\nIf I appeal I just hope I don't have to go back to court, I already lost 4k on my lump sum from my lawyer plus court fees. \n>Now I have guardianship through ARC. \nthe social security office recommended me to join group housing if I wanted to leave my parents. Is this what you are talking about?",
				"added": 1570195294
			}
		]
	},
	"comment_vote": {}
}