{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "А чего так за 2 недели пиры резко со 150 до 1000 поднялись?",
			"body": "Насколько я помню, 2 недели назад ( да и вообще максимум пиров 0net ) были ~150-200\nПросто, как то очень не обычное и странное чувство.С одной стороны рад, что будет больше постов и зайтов, но с другой стороны боюсь что все эти зайты будут мусором ( ну, порнография, которой так \"не хватает здесь\" )",
			"added": 1519921585
		}
	],
	"topic_vote": {
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"6_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": [
			{
				"comment_id": 1,
				"body": "хм, есть децентрализованный аналог youtube - viuly.Но, дело в том, что подобные сервисы хорошо показывают истинную сторону человека, я это к тому, что по сути в очень полезном для журналистов/расследователей, сервисе, НО к сожалению большая часть контента - порно и пропаганда Путина ( я не шучу, в разделе \"Politics\" каждое 2 видео с фамилией Путин в названии )\nТак что, к сожалению YouTube пока что самый актуальный видео-хостинг",
				"added": 1519314226
			},
			{
				"comment_id": 2,
				"body": "> [balancer73](#comment_294_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): И вдогонку. Посмотрел сейчас и так понял, что работать можно только через их сайт? Тогда, как и с steemit/golos это на практике не децентрализованная система, пусть она и является распределённой :) Всё будут решать владельцы центрального узла.\n\nДумаю за децентрализацию выдают просто частность и более мягкую политику пользования, этакий youtube \"на максималках\"",
				"added": 1519329662
			}
		],
		"1_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN": [
			{
				"comment_id": 3,
				"body": "> [gitpol](#comment_2_1HfFyR9N9t4qwEngJSV5JoQE5eccWoPaWE): ахахахЧто люди хотят то и показывает, видать ты очень хотел порно посмотреть :)\n\nК сожалению, наверное.Всё же у этого мог бы быть более благой смысл.Но сперматаксикозники никак не насытятся..",
				"added": 1519333606
			}
		],
		"1_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT": [
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_301_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Я и более 40 тыс. пиров видел :)\n> Вот тут есть скрины с 17 тыс, но это не максимум:\n> http://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:26:География+ZeroNet\n> Вот тут пиров ещё меньше, но тоже по теме и с новой картой:\n> http://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/?Post:37:География+ZeroNet\n\nхмм, спасибо большое, не думал что такое большое кол-во пиров было у 0net. А вы тут и правда очень давно, мне даже как то неловко стало, что я ограничился \"максимумов\" в 150 пиров.Правда до глобальности ещё расти и расти",
				"added": 1520101795
			}
		],
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 5,
				"body": "Насчет Северной Кореи. Думаю всё таки есть лазейка, не возможно, что они сделали идеальную изоляцию.Мне кажется, тут и глобальный интернет повлиял на блокировку этого самого интернета на территории КНДР путем фаервола, ну, вы знаете, что там творится в КНДР, и как то интернету показывать такое не особо то и нужно.Так что, уверен, лазейки там есть, да и своя локальная сеть наверняка тоже.Всё же найдутся люди, которые, например, будут поставлять оборудование специальное ( шпионское ), которое запросто будет обходить блокираторы частот. Думаю США этим занимается, ибо, у них там терки между собой, так что нужны свои люди у врага, что бы сливать информацию.\nА насчет отключения интернета в России, тут два варианта.Либо его вообще не отключат, ибо люди точно поймут, что это последняя капля, и будут месить друг друга, и всё во круге на улицах, дойдя до и до кремля.Или же, если терпилы после такого всё ещё начнут сидеть себе спокойно по домам, то, найдутся ребята, которые создадут лазейку в фаерволе, или же если это блокиратор частот, то найдутся и те кто сделает спец оборудование.\n\nУ любого человека есть инстинкт на адаптацию к определенным ситуациям, так что на любое действие - найдется противодействие",
				"added": 1520501581
			}
		],
		"6_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 6,
				"body": "Забавно наблюдать за тем, что ещё 2-3 года назад обычные пользователи говорили друг другу, что фейсбук имеет доступ к всему, включая геолокацию пользователя, камеру и, соответственно, данные, которые он вводит в приложение FB, НО при этом называли таких людей параноиками или же с ума сошедшими. Ведь - \"кому же сдалось то, что я пишу в интернете, мне всё равно нечего скрывать!\".\nВ итоге, стадо баранов услышало это уже от самого Марка, и начало бунтовать..Вот так и живём.",
				"added": 1521910648
			},
			{
				"comment_id": 7,
				"body": "> [anotherneko](#comment_24_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Представляю что будет когда он протечет.\nОн и так по сути протёк, да и не был без дырок с начала появления. Мне КАЖЕТСЯ , хакерам на государственном уровне ( например, работающих в ЦРУ ), и так известна вся информация, которая им нужна. Ну не поверю я в то, что корпорации, которые годами создавали лазейки для шпионажа за людьми по всему миру, вдруг не могут популярный мессенджер взломать, при том что сервера стоят у них в стране, и нет никаких проблем с доступом, если это просьба страны. Да, в США демократия, все дела, конфиденциальность, но нет этого всего. Соц сети, да и вообще весь интернет просматривается государствами, а те кто как то спалился, например \"Фейсбук\", то просто они создают спектакль, мол - Как так!?Это ведь нарушает свободу человека!",
				"added": 1522006576
			}
		],
		"2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 8,
				"body": "Какой то вопрос с подвохом, если вы про именно IP человека, то проследить его никак не получится. Должно быть тут автоматическое отключение WebRTC, ибо показывается только IP провайдера. По крайней мере у меня так, не знаю как у других. \nА вот подвох в том, что это же не безопасно. Так в чём тогда смысл 0net, если свободно можно просмотреть IP пира?",
				"added": 1522052174
			},
			{
				"comment_id": 9,
				"body": "> [azz](#comment_31_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): В том, что нету единой точки отказа. У тебя всегда есть копия контента и ты автоматически становишся распотранителем\n\nДумаешь, разрабы не предусмотрели шифрование IP адресов ( non-TOR ) пользователей?Это ведь опасно, нет? Да и контента тут, за который моралфаги или же обиженки могут начать искать, довольно много. Странно как то тогда это всё звучит.",
				"added": 1522052723
			}
		]
	},
	"comment_vote": {
		"13_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_1P5JSZvEEKT67qQNKZcvdNt2VxwXLXF4r8": 1,
		"3_14ncE85vwozetvjSeyVxydpSH3f9SvoRAs": 1,
		"3_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"250_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"15_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"5_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": 1,
		"5_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT": 1,
		"14_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1,
		"19_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"15_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1
	}
}