{
	"title": "今日新疆西藏",
	"description": "My ZeroBlog.",
	"links": "[股市带路党](http://127.0.0.1:43110/12i7CYxN2UxAEMiFarqeBCSegk8sLpmb2R/)\n\n[kai0油管频道](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?Channel=1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv)\n\n[kai0的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kai0@zeroid.bit)\n\n[kaishen的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kaishen@zeroid.bit)\n\n[自由西藏运动](http://127.0.0.1:43110/1HNZuUMURNtRPdfzBDxrNonPD2EBN6TKfV/)\n\n[东突厥斯坦运动](http://127.0.0.1:43110/1BHs4zibfUpXbJV7RRVDvMRCiqBgPkeM5y/)\n\n[吴越独立](http://127.0.0.1:43110/1JfzWXHBzELkVF12km6ZdnKSZFUAs8mZBw/)\n\n[零网使用方法](http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/)\n\n[颠覆国家政权群](http://127.0.0.1:43110/16EwXiGi4Dn9EZFSeEuKc2HNZYRD3RcVDs/)\n\n[吴越独立大论坛](http://127.0.0.1:43110/1F1AHWYc7Mt3GBV9ZgphyyG2Go7uodmBtL/)\n\n[自由曙光](http://127.0.0.1:43110/18GBsUZexWB8BcnGUtxFz4qbFiEeXVgB5B/)\n\n[非洲人的生活](http://127.0.0.1:43110/15zvMb12PZ5XMc6yJBWUEmn2dQvV3TyuQU/)\n\n[上海街头](http://127.0.0.1:43110/18iNFjfBKNM2rM4Mov6ShR1Ygu9EihsHWt)\n\n[中国发展模式](http://127.0.0.1:43110/1HNYEHtg6BPAW1jmWfBGPrRMxsPjd6nVA2/)\n\n[中国故事](http://127.0.0.1:43110/1PhcqYWiQHAiasQkcpsHp6btASom2tMGQK/)\n\n[共产党的故事](http://127.0.0.1:43110/17DwzkEgpqtCWK9i1CGdioXojBpN1uaJ2N/)\n\n[天安门大屠杀](http://127.0.0.1:43110/1NT2LeRWQs3zCFCRwuPWbKwcamXVEu1hbU/)\n\n[郭文贵揭露的腐败](http://127.0.0.1:43110/1JWBMmJtHs7uDK1pm6wEJjrZFn3uk1FG6V/)\n\n[中共惊人的腐败](http://127.0.0.1:43110/1PPF2jZ2uBiQyFD75VPpXdCapRHrvezFtz/)\n\n[地狱 中国](http://127.0.0.1:43110/1P9MwRTBWUdbyRgrytY7jg191trnZTomu9/)\n\n[加拿大风情](http://127.0.0.1:43110/1JCehSb5nREM7EivyQDXXkTsGpbKikDiaw/)\n\n[台湾建国运动](http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/)\n\n[中国各地的抗争](http://127.0.0.1:43110/1KXgv2wg6UdzoCqusaS5cCuXzkPsy7f1wm/)\n\n[美中贸易大战](http://127.0.0.1:43110/1LXgC6GXAc535zw8gLQbZpXnfoXNGkQDjh)\n\n[爆料台](http://127.0.0.1:43110/18eb8HAMQnS8SLJRxMekSGjskNXEtNZZzw/)\n\n[墙内消息](http://127.0.0.1:43110/17PC9PwGFg1rzXnnr6uZe9uQKj7QyED5P6/)\n\n[谈革命](http://127.0.0.1:43110/13LzMTjYM5xGMfnXq6hqAARra5UpmCYt12/)\n\n[自由人聊天室](http://127.0.0.1:43110/1LaXzrgAtsXwdQQdkzFwbLPozoWgTVUQnv/)\n\n[Zer0 Up Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/)\n\n[ZeroUp@anotherneko](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/)\n\n[1024记录](http://127.0.0.1:43110/1CuGFe64XH3XLCiEPkSkwRprrfqZzdAjpp/)\n\n[公义行动](http://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/)\n\n[幻想未知](http://127.0.0.1:43110/19vi7xKAZsuMrfpp4z4zAMmhY8QNvXN3Sm/)\n\n[大家一起P2P](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/)\n\n[朝花夕拾](http://127.0.0.1:43110/lastone.bit/)\n\n[历史中的404](http://127.0.0.1:43110/1PGxGwpMtEJ22FPDiyXAiQFBrhiFXEtGF5/)\n\n[卡拉卡拉的博客](http://127.0.0.1:43110/12YPedbiK2S74s5Fjgcvjv21JYAjL1zaCC/)",
	"next_post_id": 168,
	"demo": false,
	"modified": 1599298049,
	"post": [
		{
			"post_id": 167,
			"title": "阿拉善蒙古族女干部苏日娜，跳楼自杀以示抗议，遗书内容：",
			"date_published": 1599298025.405,
			"body": "“我们阿拉善盟蒙古族人少，我们的申请书、请愿书签字后连旗级单位都无法上报就被撕毁。他们用各样的方式逼迫我们，特别是蒙古干部的处境异常困难。我们傻也好懦弱也罢，人们啊，请停止谩骂诽谤我们，我们只有用生命证实 ，我们努力了！”"
		},
		{
			"post_id": 166,
			"title": "新疆再教育营",
			"date_published": 1598795850.733,
			"body": "![1.jpeg (0x0)](data/img/post_166_1.jpeg)"
		},
		{
			"post_id": 165,
			"title": "中共400页密文曝光 威胁新疆集中营外孩子",
			"date_published": 1573984736.352,
			"body": "![1.jpeg (0x0)](data/img/post_165_1.jpeg)\n\n_2019年5月31日拍摄的新疆和田市郊一个中共“再教育营”，该处关押的多数是当地少数民族。_\n\n【大纪元2019年11月17日讯】（大纪元记者高杉编译报导）美国《纽约时报》近日获得了一份长达400多页的中共内部文件，内容是要求对那些父母和家人被关押在新疆穆斯林少数民族集中营的孩子们进行教育和威胁的培训资料。这份“问答题”形式的培训指南，要求被关押者的子女必须对外美化集中营，并威胁称，否则将会影响涉及其父母被关押期限的“分数”。\n\n---\n\n在周六（11月16日）发表的一个长篇报导中，《纽约时报》透露说，这些文件是数十年来从在中共执政的共产党内部泄露出来的最大一批政府文件，为人们了解中共在新疆的持续镇压提供了前所未有的内部证据。在过去三年里，中共当局已将多达100万名维吾尔族、哈萨克族和其他少数民族人士关进了集中营和监狱。\n\n中共新疆自治区的领导将这份名为“吐鲁番市集中教育培训学校学员子女问答策略”的内部指示下达给地方官员，并要求地方官员和工作人员要尽快同那些在外地上学放假回家的学生见面，禁止他们发声并讲出所了解的关于新疆集中营的真实情况。\n\n在这份培训指南中，提供众多的如何回答具体问题和如何“威胁”被关押人员子女的标准答案。\n\n比如，在被问到：“我的爸爸（妈妈、家人）在哪里？”时，标准答案是：\n\n“他们在政府设立的培训学校。”\n\n“他们是去接受培训教育。”\n\n“他们的生活环境都很好，吃住免费，并且标准比较高，你不用担心。”\n\n“ 每天提供的伙食费在21元以上，甚至超过了部分学员在家里的生活标准。”\n\n当肯定会被问到:“我的家人什么时候能结束培训回家？”“既然是培训，他们为什么不能定期回家？”等等问题时，一些标准答案是：\n\n“如果不参加学习培训，就无法彻底地全面地了解宗教极端思想的危害。”\n\n“一定要珍惜党和政府提供的这次免费教育机会，彻底清除错误思想，并且学会汉语和就业技能，为将来你们一家人的幸福生活打好基础。”\n\n“无论年龄多大，只要思想上受到宗教极端思想的感染，都应该参加学习培训。”\n\n文件还要求用叙利亚内战和伊斯兰国的兴起举例说明。\n\n同时，这份内部文件还要求当地官员对孩子们进行明目张胆的威胁，明确告诉他们，他们在外面的言行可能会影响到他们被关押亲属的评分，而该评分系统似乎会被用来决定什么人和什么时候被从集中营释放出来。\n\n文件指示当地官员教育学生：\n\n“他们的家属包括你在内也要遵守国家的各项法律法规，不信谣，不传谣。”\n\n“这样才能为你家人加分，符合结业标准后才能离开学校。”\n\n当地官员还将对接受谈话的被关押者子女的日常行为进行评估，记录他们参加受教育、会谈和其它活动的情况。\n\n虽然这份文件长达400多页，详细指导了如何对被关押者的子女进行欺骗、洗脑、威胁并要求他们管好自己的嘴，但关于“父母被关押后子女的生活、学费、生活费谁来照顾和支付？家里的农活谁去干？”等等民众因此遭遇的困境，却只字不提。只要求孩子们要“闭上嘴、感谢党”即可。\n\n《纽约时报》没有透露如何获得这些内部文件的细节。有媒体评论称，可以想见的是，在持续的高压政策下，中共内部也仍有良知尚存、不认同高层倒行逆施的人士，私下透过秘密管道将内部文件公诸于世，揭露中共所谓“再教育营”背后的残酷打压。\n\n责任编辑：李缘"
		},
		{
			"post_id": 164,
			"title": "中共派汉族官员监控维族人并与其妻儿同床睡",
			"date_published": 1573008986.032,
			"body": "外界一直指控中共在新疆地区兴建集中营，关押了大量的维族人。现有消息传出，针对遭关押的维族男子，新疆当局指派汉族“亲戚”定期到他们家里进行监控并过夜，甚至与其妻小一起睡觉。"
		},
		{
			"post_id": 163,
			"title": "新疆“第一再教育营”传逾150人丧生",
			"date_published": 1572486822.428,
			"body": "![1.jpeg (0x0)](data/img/post_163_1.jpeg)\n\n_这张照片拍摄于2019年5月31日，照片中的设施位在新疆西北部的和田郊区，被认为是当地“再教育营”的其中一个设施。（Greg Baker/AFP/Getty Images）_\n\n【大纪元2019年10月30日讯】新疆阿克苏地区一个“再教育营”日前传出有大批维吾尔族人死亡。当地一名公安披露，去年下半年短短六个月内，至少有150人在营内丧生。未经证实的消息显示，死亡人数有可能超过200人。\n\n---\n\n发生大规模死亡的“第一再教育营”位于阿克苏地区，距离库车市市中心约10公里。当地一名公安周二向自由亚洲电台维吾尔语组记者薛赫莱提·吾守尔证实，从去年6月到12月，短短半年内先后有大批维吾尔人丧生，人数约为150人，遗体已全部下葬，殓葬过程被公安严密监控。家属也已被警告要守口如瓶。\n\n这是新疆两年前设立“再教育营”、关押上百万维吾尔族穆斯林以来，营内发生的最大规模死亡事件。早前一度传出死亡人数超过200人，但不愿透露姓名的公安否认。他说，真实数字以他被派驻“再教育营”期间为准，至于事发前后有没有更多人死亡，就无可奉告。\n\n库车县一名司法官员则拒绝证实“再教育营”具体死亡人数，也不愿透露当中是否包括政府人员。\n\n涉事的“第一再教育营”是新疆四大“再教育营”。世界维吾尔人大会发言人迪里夏提谴责新疆当局封锁有关消息。\n\n迪里夏提说：具体数据的确非常难以确定，因为中国政府采取各种措施来封闭相关讯息。很多人被关进再教育营以后遭到非人道折磨，而且这种折磨不止在肉体上，甚至在心灵上，导致很多人在无法承受的情况下，出现离奇或者非正常死亡现象。\n\n除了涉事的“第一再教育营”，新疆至少还有另外4座大型“再教育营”，每一座都收容了数以万计维吾尔人。\n\n迪里夏提说：在再教育营内，这些非正常死亡现象不止是在阿克苏。被强制关押再教育营的已超过300万人。在庞大数据当中出现这种死亡数据，和上百万人被关押相比较，我认为只是冰山一角。\n\n据了解，当局一直把这起大规模死亡事件视为“国家机密”，直到今年年初才在一个私人聚会中被公开。披露事件的公安人员目前正被当局扣查。\n\n（转自自由亚洲电台）\n\n责任编辑：李金本"
		},
		{
			"post_id": 162,
			"title": "西藏那曲6人拒绝庆“十一”遭拘捕",
			"date_published": 1570065317.296,
			"body": "有消息指，西藏拉萨和昌都等地，有僧尼被中共强制要求参与共产党篡政70周年庆；西藏那曲县6名藏人，因拒绝参加此“庆祝”而遭拘禁。除此之外，中共当局也严厉监控其他国人。"
		},
		{
			"post_id": 161,
			"title": "新疆囚犯恐怖录像曝光 欧洲消息人士：是真的",
			"date_published": 1569239093.603,
			"body": "![1.jpg (0x0)](data/img/post_161_1.jpg)\n\n中共新疆警方运送几百名囚犯的场面。（视频截图）\n\n【新唐人北京时间2019年09月23日讯】近日，网路流传一段恐怖视频显示，中共新疆警方运送几百名囚犯的场面。这些人戴着镣铐、剃著光头，眼睛被黑布蒙住。欧洲消息人士称，这段视频是真实的。\n\n---\n\n据福克斯新闻和天空新闻报导，9月17日，有人匿名上传了一段视频到YouTube和推特。视频显示了中共新疆警方运送几百名囚犯的场面。\n\n一名欧洲安全消息人士告诉天空新闻，他们已经检查了录像中的镜头，这段据称显示中国穆斯林聚居区数百名蒙着眼睛戴着镣铐的囚犯的在线视频是真实的。\n\n视频从一个火车站旁边被指控的在押人员的画面开始。据称被拘留者戴着镣铐、剃著光头、戴着黑色眼罩，在警卫的包围成排坐在地上。\n\n![2.jpg (0x0)](data/img/post_161_2.jpg)\n\n这位欧洲安全消息人士说：“我们已经检查了录像，相信是真的。视频显示，多达600名囚犯被转移；他们被铐在一起，剃光头，蒙上眼睛，双手被铐在背后。这是中国人运送这类囚犯的典型方式。”\n\n消息人士透露，这些被拘留者被认为是来自中国少数民族维吾尔族穆斯林。拍摄地点在中国新疆的库尔勒市。\n\n澳大利亚战略政策研究所国际网路政策中心研究员内森．鲁泽（Nathan Ruser）在其推特上发布了这段视频的多个截图，且做出解释。他表示，这是大疆无人机拍摄的视频。他写道，最大的线索是在左下角的方点阵图上，它显示著新疆一个自治州“巴音郭楞蒙古自治州”，通常在很大程度上是库尔勒市的代名词。\n\n目前尚不清楚拍摄镜头的时间和拍摄方式。欧洲安全消息人士告诉天空新闻，他们认为这些图像是今年初拍摄的，发布这段视频的账户名为“战斗恐惧”（War on Fear），这名用户写道：“当今社会的人们一直生活在（中共）政府的高科技监督之下。现在，我们使用技术来展示新疆的现代社区：人们失去了自由，未来没有希望。”\n\n据报导，新疆人口只占中国全国人口的2%，但根据中共地方检察院提供的资料，2017年中国全国逮捕的人当中，高达1/5在新疆被捕，比例远高于10年前的2%。\n\n人权组织指责中共在新疆省庞大的拘留中心关押了多达100万人，其中大部分是维吾尔人。北京则否认这一指控，并辩称这些设施是职业培训中心，维吾尔人、哈萨克人和其他人在那里接受免费技能教育。\n\n但是，今年2月，土耳其当局表示，中共政权对维吾尔人的待遇是全人类的重大耻辱。\n\n本周早些时候，五个人权组织敦促联合国秘书长安东尼奥．古特雷斯（Antonio Guterres）谴责中共政府对维吾尔人的拘留，并呼吁立即关闭政府办的新疆拘留营。\n\n（记者刘明焕报导/责任编辑：文慧）"
		},
		{
			"post_id": 160,
			"title": "培训西藏“活佛”如何转世，中共要藏僧以习近平思想来转世",
			"date_published": 1567172469.689,
			"body": "【西藏之声2019年8月30日报道】将宗教视为鸦片、主张无神论的中共当局近日举办所谓的“西藏新转世活佛培训班”，向藏传佛教高僧、上师“传授”转世之道。该转世培训班于本月29日举行了结业式，中共在“自治区”的一把手吴英杰也出席并致辞，大谈以习近平思想为指导来管理培养“活佛”转世，荒诞至极的言论令人啼笑皆非。\n\n![1.jpg (0x0)](data/img/post_160_1.jpg)\n\n中共官员教西藏僧侣如何转世 翻拍自中共官媒\n\n---\n\n中共当局于本月23日在拉萨举行所谓的“全区第一期宗教界代表人士活佛转世管理专题培训班”，召集“自治区”内七十三座寺庙的九十七名宗教界代表人士，进行统一培训。\n\n这场滑稽的转世培训于昨天（29日）举行交流座谈会暨结业式。据中共官媒报道，“西藏自治区”的一把手吴英杰致辞强调：“要以习近平新时代中国特色社会主义思想为指导，依法做好活佛转世管理和培养工作”，荒诞至极的言论令人啼笑皆非。\n\n中共干预藏传佛教高僧大德转世制度，源自对达赖喇嘛尊者巨大影响力的恐惧。北京当局透过控制藏传佛教转世制度来控制西藏领袖达赖喇嘛，进而彻底控制藏人的目的昭然若揭。\n\n然而中共当局对达赖喇嘛尊者的诋毁污蔑从未停止。数十年来，中共以“农奴主”、“披着袈裟的狼”、“恐怖分子”等名称诋毁尊者，甚至将尊者与纳粹、ISIS极端组织相提并论。与此同时，中共却对达赖喇嘛有可能终止转世的表态紧张无比，在多个场合“命令”达赖喇嘛这位被他们形容为纳粹的藏人上师“必须转世”。\n\n达赖喇嘛尊者今年7月接受印度记者专访时对转世问题做出了清晰表态：“我想明确地指出，这一世达赖喇嘛的转世或重生权，永远不会落入中国手中。”\n\n印度智库“和平与冲突研究所”（IPCS）研究员班丹索南（Palden Sonam）曾撰文分析指出，中共当局设立的班禅喇嘛至今未获得藏人的尊重与认可，在这一策略已经失败的情况下，中共仍然不放弃掌控达赖喇嘛转世问题的野心，并不断叫嚣，妄想让外界相信西藏的转世制度是由中国发明的。中国想要用谎言与恐吓来取代事实。\n\n班丹索南强调，中共荒谬的言行举止恰恰反映出，他们想要干预达赖喇嘛尊者的转世权，根本没有任何法律和历史的合法依据。\n\n![2.jpg (0x0)](data/img/post_160_2.jpg)\n\n中共官员教西藏僧侣如何转世 翻拍自中共官媒"
		},
		{
			"post_id": 159,
			"title": "西藏拉萨现“职业技术培训学校”，强制洗脑农村青少年",
			"date_published": 1563114013.26,
			"body": "【西藏之声2019年7月11日报导】中共在“新疆自治区”以职业培训为名而拘押百万穆斯林，备受国际社会谴责。而近日，在西藏拉萨也出现“职业技术培训学校”，当局要求拉萨市下辖七县一区政府将各自地区的“反骨”农村青少年送往该校，强制实行洗脑教育。\n\n![1.jpg (0x0)](data/img/post_159_1.jpg)\n\n由西藏境内消息人士提供，并标出该职业技术培训学校的位置\n\n“西藏自治区”拉萨市才纳乡的一所“职业技术培训学校”疑似强制关押藏人青少年，并进行洗脑教育。\n\n---\n\n近日有知情境内藏人向本台透露，中共当局于2017年在拉萨市曲水县才纳乡修建所谓的“职业技术培训学校”，完工后从2018年开始，以培训农业技术为借口，将拉萨市下辖的七县一区（城关区、当雄县、堆龙德庆县等）的农村青少年，分批强制送进该校，进行政治洗脑教育。\n\n据介绍，拉萨市七县一区下辖各村干部被要求将那些“不执行九年义务教育者”、“社会闲杂人士”等等“不听中共话”且“反骨”的青少年名单，上报民政局、政治局等部门。\n\n名单中的青少年最终会被强制送进“职业技术培训学校”，接受封闭式“培训”——洗脑教育，整日被迫拥护、歌颂共产党。学员年龄从十岁到二十岁不等。\n\n消息人士还指出，若有不配合的家庭，当局便掐断种子与肥料等补助，让农民无法务农维生。\n\n中共当局在“新疆自治区”以提供职业技术培训为名，将百万穆斯林关进“再教育营”，强制实施政治洗脑教育并残酷虐待，受到国际社会的谴责。\n\n本月初，藏人行政中央司政洛桑森格参加英媒采访时提出，西藏也存在大大小小的政治教育营，只是规模不及“新疆自治区”。司政强调，“新疆集中营”的设计者，就是曾在西藏实施强硬打压政策的中共官员陈全国。"
		},
		{
			"post_id": 158,
			"title": "解读新疆：一个汉人眼中的新疆实况",
			"date_published": 1560080874.363,
			"body": "![1.jpg (0x0)](data/img/post_158_1.jpg)\n\n这家回民清真餐馆在乌鲁木齐是很平常的一个饭馆 ，平日生意红火。当时因为参加每天的反恐操练迟到超过两次而被封门。门头上的维吾尔文、清真标记和“回”字被拆掉。现在乌市的店铺门头被政府这样处理是硬性规定，正常营业的店铺也都这样的。（周诚提供）\n\n---\n\n自从中国政府在新疆设立再教育营，并关押大批维吾尔等少数民族以来，当局的高压手段也引起了新疆汉人对少数民族的同情与支持。来自新疆、从事艺术工作的周诚，生于斯长于斯，有很多维吾尔人朋友，大家相处和睦融洽，他和许多当地的汉人一样，对维吾尔人的遭遇深表不平。眼见为实，今天的访谈中，周诚将和听众分享自己在新疆的所见所闻、所思所感，在他的描述中，许多的情况是外界难以想象的。\n\n![2.jpg (0x0)](data/img/post_158_2.jpg)\n\n这家回民清真餐馆在乌鲁木齐是很平常的一个饭馆 ，平日生意红火。当时因为参加每天的反恐操练迟到超过两次而被封门。门头上的维吾尔文、清真标记和“回”字被拆掉。现在乌市的店铺门头被政府这样处理是硬性规定，正常营业的店铺也都这样的。（周诚提供）\n\n![3.jpg (0x0)](data/img/post_158_3.jpg)\n\n儿科医生背后和图书展架下面是大头棒。公共场所到处都是这样的暴力物品。我的小孩子就在这样的环境里成长。毛泽东像和习近平著作下面露出这样的凶恶，真有讽刺意义。（周诚提供）\n\n![4.jpg (0x0)](data/img/post_158_4.jpg)\n\n儿科医生背后和图书展架下面是大头棒。公共场所到处都是这样的暴力物品。我的小孩子就在这样的环境里成长。毛泽东像和习近平著作下面露出这样的凶恶，真有讽刺意义。（周诚提供）\n\n![5.jpg (0x0)](data/img/post_158_5.jpg)\n\n报警按钮。 官商勾结，每个商户被要求强行购买，没过多久又被强行更新，每次都要花几百元。民众怨声载道。拍摄于中国电信营业厅。（周诚提供）"
		},
		{
			"post_id": 157,
			"title": "新疆阿勒泰市血站已成为再教育营",
			"date_published": 1557909803.362,
			"body": "![3.jpg (0x0)](data/img/post_157_3.jpg)\n\n摄于2018年9月，哈萨克人人权组织提供"
		},
		{
			"post_id": 156,
			"title": "适逢抗暴六十周年，中共下令封锁西藏两个月",
			"date_published": 1550733458.381,
			"body": "【西藏之声2019年2月20日报导】适逢“西藏自由抗暴”六十周年，中共再次下令封锁西藏自治区长达两个月，禁止外国游客进入，显示出中共试图在政治敏感年进行更甚严控、管制藏人。国际声援西藏运动（ICT）呼吁中共结束对西藏自治区的封锁和隔离，保障所有藏人的基本自由，同时敦促美国全面实施《西藏旅行互惠法》。\n\n根据西藏经营旅游业的机构于网站上透露，去年底西藏旅游局向业者下发通知，今年1月30日至4月1日期间，不为外国游客办理入藏许可证。旅游业者提醒游客推迟或提前旅藏计划，并解释说，自从2008年3月14日以来，这已经成为了正常的年度关闭。\n\n---\n\n1959年3月10日，数万藏人于西藏首都拉萨反对中共统治，遭到镇压；2008年3月14日，西藏三区爆发大规模和平抗暴活动，同样遭到中共血腥镇压，并引发境内藏人自焚抗议浪潮。自此，每年3月都被当局视为“敏感月”，采取比平时更严格的限制、管控措施。\n\n甚至根据当时的政治敏感程度，即使在自治区没有完全关闭的情况下，也限制外国游客进入西藏，而外国人只有在申请特殊许可后才能进入，并且只能通过中共的监控安排下在西藏旅游。\n\n中共同时也限制外国记者、非政府组织、外交官和持有外国身分的西藏人进入自治区，以便在该地区保持铁腕政策，同时避免外来者任何形式的“外部审查”。\n\n**自由之家《2019年度国际自由度报告》**\n\n根据国际非政府组织“自由之家”（Freedom House）《2019年度国际自由度报告》中，中国毫不意外地被评为“不自由”国家，仅拿到11分，而西藏排名倒数第二，只获得1分自由度，也显示西藏在中国的铁腕统治下，毫无自由度可言。\n\n自1959年中共全面占领西藏，迫使达赖喇嘛尊者带领数万藏人流亡印度等国。而2019年是“西藏自由抗暴”六十周年，世界各地的藏人每年都会举办游行活动纪念1959年3月10日。\n\n不同于往年中共下令封锁西藏自治区一个月，今年更甚封锁整整两个月，不难联想近日中共当局大张旗鼓为了宣扬北京的政绩，已宣布今年他们将纪念西藏“民主改革”六十周年，以及中国共产党成立七十周年等举措，显示出中共试图在敏感年进行更甚严控、管制藏人。\n\n在2018年底，美国国会通过了《西藏旅行互惠法》，这一法案旨在结束中国对西藏的封锁，要求中国政府允许美国记者、外交官以及游客，在西藏不受限制地旅行，正如中国的记者与外交官以及大众能够自由访问美国一般。\n\n根据国际声援西藏运动（ICT）报导指出中共当局在今年敏感月前夕再次封锁西藏自治区，禁止外国游客进入，表明中共根本不愿意维护基本人权，亦不愿意与其他国家的关系中实行互惠原则。\n\n因此ICT呼吁中共当局结束对西藏自治区的封锁和隔离，保障所有藏人的基本自由，并允许所有人不受限制地进入西藏，同时敦促美国全面实施《西藏旅行互惠法》，并问责禁止美国记者、外交官以及游客入藏的中共官员。\n\n**《西藏旅行互惠法》背景：**\n\n旨在对抗中共封锁西藏政策的《西藏旅行互惠法》，最初由美国众议员吉姆•麦考文（Jim McGovern） 与兰迪•赫尔特格伦（Randy Hultgren）在众议院提出，并由参议员马可•卢比奥（Marco Rubio）与塔米•鲍德温（Tammy Baldwin）在参议院提出。\n\n2018年7月25日，众议院司法委员会核准了这一法案，两个月后，众院正式通过该法案，并递交参议院。同年11月28日，参院外交关系委员会核准了这一法案；12月11日，参议院正式通过了该法案。 12月19日，经总统川普签字后，《西藏旅行互惠法》生效成为法律。"
		},
		{
			"post_id": 155,
			"title": "维吾尔人的生活：压迫无处不在",
			"date_published": 1550056076.444,
			"body": "2019年2月12日\n\n![9.jpg (0x0)](data/img/post_155_9.jpg)\n\n新疆警察盘查民众（网络图片）\n\n为消灭穆斯林信仰，中国当局设立检查站，安装监控摄像头，跟踪出行，滋扰学生。\n\n如果你想见识一下运行中的现代警察国家，就去中国西部边疆的新疆维吾尔自治区。\n\n---\n\n在新疆，大街上每隔大约50米就有一个检查站，有政府指定的人员检查每个人的手机，查看他们是否与国外的穆斯林亲戚联系，是否与海外宗教领袖有交流。已经离开中国的维吾尔人都面临着两难困境：一旦回国，他们就可能会被关进「教育转化」营；如果不回国，他们的家人可能会被送进「教育转化」营。只要办理护照，维吾尔人就可能会被认定为「不稳定人员」而送去「学习」。这些生活中的威胁都是新疆匿名人士向《寒冬》讲述的。\n\n据知情人透露，政府人员还煽动新疆民众告发邻里，一些居民被要求在家安装摄像头。谈到这种监控的高端技术和强大能力时，一名知情人说：「你很难想像，维族和回族人去超市或菜市场购物甚至连上公厕都要刷身分证。这些现在对于新疆人来说已经是司空见惯了。」\n\n当局对维吾尔人的监视、控制还被运用于那些在新疆之外打工的维吾尔人。\n\n阿米娜是在中国北部的山西省打工的一名维吾尔人。她向《寒冬》讲述说，如果维吾尔人要离开新疆去外地打工，必须在当地派出所作详细登记，且每个礼拜新疆政府都派人不定时给他们打电话，询问他们在外地的情况，谁若累计3次不接电话，就会被警察抓捕送回新疆当地。许多身处外地的新疆维吾尔人都不敢让手机离开视线。\n\n这种严厉的监控也波及到了维族人的出行、住宿。\n\n欣然是河北省秦皇岛市一家宾馆的接待人员，她向《寒冬》透露，去年她所在的宾馆收到了当地警方发送的微信信息。信息要求，如有新疆维吾尔旅客入住，宾馆老板必须通知警方，并在维吾尔旅客预订的房间隔壁给公安人员留出房间，还要求旅店配备车辆以便于公安人员监视维吾尔旅客出行。这些严格要求致使很多宾馆、旅店拒绝接纳新疆旅客，以免给自己带来麻烦。\n\n「去年10月，两个新疆维吾尔女士来一家宾馆住宿，」欣然说。「老板担心受牵连，就将她们拒之门外。附近的其他宾馆也无人敢接纳她们，最后她们被迫在街头过夜。」\n\n就连一些在外省就读的维吾尔族大学生也成了当局强硬的监管政策的受害者。\n\n去年9月，维吾尔族学生热娜与几个同学外出旅游，在候车厅等待火车时，他们突然遭到警察盘问。警察得知热娜是新疆维吾尔人后，将其单独带到一个审讯室，四五个带警棍的警察紧随其后进入屋内，检查其身分证和学生证，并在其手机里放置了一张卡，用来扫描其通话记录并监控其行踪。\n\n虽然当时她被放行，但是接下来的行程，她因着自己「新疆维吾尔人」的身分屡遭「特殊待遇」。她不断被盘查身分，甚至在酒店吃饭时也遭到盘问，还被警察询问登记学生证、身分证等信息。\n\n与热娜同行的同学们看着她的遭遇，都感到惊慌不安。一位汉族同学说：「不知道要发生什么事，以往从来没有遇到过这种情况。」\n\n维吾尔人虽然名义上「自治」，实际上没有任何自治权可言，他们被中共视为「恐怖分子」，遭到歧视、迫害。\n\n（文中人名均为化名。）\n\n来源：   寒冬  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 154,
			"title": "中共造假暴露了大量新疆维吾尔人被转移到江西集中营",
			"date_published": 1548218471.18,
			"body": "中共造假宣传新疆维吾尔人积极加入共产党，暴露了中共把新疆集中营关押的维吾尔人转移到江西集中营工厂充当奴工。\n\n![9.jpg (0x0)](data/img/post_154_9.jpg)"
		},
		{
			"post_id": 153,
			"title": "歌唱父辈的牺牲被逮捕，关押集中营",
			"date_published": 1547142714.188,
			"body": "新疆都塔尔（民族乐器）之王、 AbdurehimHeyit，因歌词提到“jenglerde shehit“（战争烈士），被认为是伊斯兰极端主义，2018年4月被逮捕，关押集中营。其实，据维吾尔人士介绍，这首名为“父亲”的歌曲，是歌唱父辈在过去的牺牲，和极端主义毫无关系。‬"
		},
		{
			"post_id": 152,
			"title": "哈萨克女画家被送进“教育营”改造 罪名从未公布",
			"date_published": 1546564528.583,
			"body": "自由亚洲电台：哈萨克斯坦民间组织阿塔珠尔特（Atajurt）创办人赛尔克坚本周四（3日）对自由亚洲电台说，多年前，就读新疆艺术学院的哈萨克族画家迪娜.依根别尔德，去年被公安送入再教育营，其后被判刑：“她叫迪娜，是新疆艺术学院的高材生。她是伊犁哈萨克自治州塔城地区鹤峰县的居民。\n\n2018年4月，被关到政治学习集中营，据说是已经被判刑3年，没有任何原因。她曾经到访哈萨克斯坦两次。她曾经是新疆哈萨克人中，知名度很高的画家。”\n\n迪娜亲属提供的身份证资料显示，迪娜生于1993年10月，当年报称地址是乌鲁木齐市天山区团结路78号。赛尔克坚说，迪娜被关押之后，精神失常：“她在政治学习集中营早已得了严重疾病。说是精神失常，亲戚们都不知道她到底是什么病。”\n\n![9.jpg (0x0)](data/img/post_152_9.jpg)"
		},
		{
			"post_id": 151,
			"title": "异地新疆人被传唤回原籍地接受再教育",
			"date_published": 1546259084.492,
			"body": "新疆人有的出国看世界，有的出门到中国各地打工。然而，现在他们都被勒令回到原籍地，被迫接受「改造」。\n\n据了解，中共当局正在勒令在新疆出生但在外省谋生的新疆人回户籍所在地。这些人大多是穆斯林，他们一回到家就被关押起来，接受某种「再教育」。在新疆境内，除了上百万维吾尔人被中共当局关押以外，这些从外地回来的新疆人也难逃厄运。\n\n---\n\n此前《寒冬》曾报道过，早在2017年，新疆当局下发政策要求有出国记录的穆斯林都要接受当局调查，并有在外经商的穆斯林被召回。乖乖回来的人一到家就被抓去关在所谓​​的「教育转化」营里。\n\n显然，这一政策现在正被广泛地实施。有知情人向《寒冬》透露，原在山西省谋生的多名新疆人被新疆警方召回，他们一回到家即被关进教育转化营，其中有维吾尔族人，也有其他少数民族。\n\n新疆人蒋敏（化名）就是其中一个典型的例子。她是土生土长的新疆人，在山西省某市做生意。2018年年初，她被新疆警方勒令尽快回到户籍所在地，如果不回去，警察会亲自上门强行抓人。蒋敏迫于无奈，只好放下生意，火速赶回新疆。然而，她一回到新疆就被当局关进了教育转化营。\n\n在转化营内，蒋敏的手机被没收了。当局对她进行思想「改造」，每天强迫她学习汉语及各种法律法规。最后，其家人几经周折为其办理了保释，蒋敏被关押近半年后才获释。虽然现在人已出狱，但新疆警方仍对她严密监控，要求她每星期都要电话汇报她的情况。\n\n其他在山西的新疆人也面临同样遭遇。当地有一个商铺有五六名来自新疆的员工也一一被传唤回新疆，接受教育转化。知情人称，有一人不愿回去，结果被警方从山西抓回新疆，至今仍被关押。\n\n该市原有200多名新疆人在此营生，现在已所剩无几，几乎都接到传唤回新疆去了。\n\n当地一位不具名的市民（汉人）为他们打抱不平，他表示，这些新疆人在外谋生，有手艺，有固定的工作，根本不需要接受什么「再教育」。\n\n据报道，在其他省份工作的穆斯林也不断被勒令回新疆。在北京市通州区，几个以烤饢、卖饢为生的新疆人被当地派出所拘押，遣返回新疆关入教育转化营。\n\n与不愿意离家的新疆人一样，那些选择离开新疆出门打工的维吾尔人和其他穆斯林如今生活相当艰难。公安人员甚至还禁止当地人把房子出租给新疆人。一位尚未被遣返的新疆人面对记者痛苦地说：「我们从不闹事，只想好好过日子！」\n\n2018年12月26日\n\n来源：   寒冬  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 150,
			"title": "维吾尔儿童，因父母被关职业培训班而冻死。",
			"date_published": 1545964855.233,
			"body": "![1.jpg (0x0)](data/img/post_150_1.jpg)\n\n![2.jpg (0x0)](data/img/post_150_2.jpg)\n\n图中被冻死儿童，据说来自和田地区墨玉县巴西吉勒尕村。"
		},
		{
			"post_id": 149,
			"title": "中共再度于西藏首都拉萨地区禁止复印藏文文件",
			"date_published": 1545741729.425,
			"body": "【西藏之声2018年12月25日报道】有境内藏人透露，西藏当局强令拉萨市的所有私营复印店禁止复印藏文文件。消息人士谴责当局的措施已违背《宪法》和《民族区域自治法》相关规定。这并非中共当局首次发布类似禁令，早于9年前拉萨便传出禁印藏文文件的消息。\n\n---\n\n有境内藏人发来消息指出，近期西藏中共当局强令拉萨市的所有私营复印店禁止复印藏文文件，这一举措进一步缩小了藏语言的使用范围，同时对当地藏人的生活造成极大不便。\n\n中共当局在拉萨禁止复印店复印藏文文件，以至于连房屋出租之类的广告都无法使用藏文。消息人士认为，这一举措已违背了中国的《宪法》和《民族区域自治法》相关规定。\n\n这并非中共当局首次在藏地实施此类禁令，早于2010年拉萨就出现过相关举措。评论认为此举是为了封锁西藏咨询的传播，同时进一步打压藏人的文化身份认同感。\n\n境内藏语文使用及保护权利受限制的情况非常普遍。今年1月，曾有一百多位境内藏人联署向中共最高“人民”法院发出吁请，批评藏地各级人民法院一律不使用藏文，指出这种不尊重藏文的行为违背了中国《宪法》及《民族区域自治法》等法律法规。\n\n今年5月，西藏玉树青年扎西文色在“煽动分裂国家”罪名下遭判五年徒刑，原因仅仅是他在接受外媒采访时，对藏语文保护现状作出评论。"
		},
		{
			"post_id": 148,
			"title": "不请自来的客人：闯入维族家庭的百万公务员",
			"date_published": 1545660447.033,
			"body": "![1.jpg (0x0)](data/img/post_148_1.jpg)\n\n2017年11月11日，新疆呼图壁县园户村镇上三工村，该县县委宣传部干部许文玲给结对亲戚艾则孜·赛麦提（左一）送去艾德莱斯灯笼。\n\n本文最初以英文发表在中参馆(ChinaFile)。\n\n---\n\n通常，这些“大哥大姐们”来的时候都是一身远足的行头。他们结伴出现在村子里，背包鼓鼓囊囊，行李中塞满了电热水壶、电饭煲，以及送给主人的其他各种实用礼物。他们远离家人，有点难受是显而易见的，谁愿意离开舒适的城市生活，跑那么老远来“吃苦”呢。但这些“亲戚”（他们被要求这样称呼自己）有任务在身，所以当他们进入维吾尔人的家，宣布要住下来时，他们会昂起头。\n\n村里的孩子立即发现来了外人。他们听见这些人试着用当地的土话跟人打招呼，看到了他们胸前别着闪亮的中国国旗和习近平或毛泽东的圆脸。这些孩子知道该怎么作出反应。“我爱中国，”孩子们赶紧大声喊。“我爱习大大。”\n\n在过去的一年里，位于中国西部的新疆维吾尔族自治区传来消息，那里正在进行一场从宗教和文化上打压当地穆斯林的运动，并且修建了越来越多有铁丝网围起来的营地，把他们拘留、监禁在里面。中国政府有时候把这些地方叫做“教育转化中心”，有时又叫做“去极端化培训班”，而最近，面对国际社会的批评，又将其称为“职业技能教育培训中心”。官方媒体最近还报道了通过“结对认亲”，大规模进驻少数民族家庭的计划。\n\n政府称，此举是为了应对恐怖主义。的确，这些营地可以看作政府几十年来为了努力根除新疆穆斯林少数民族当中的“恐怖主义、分裂主义和宗教极端主义”的一种合乎逻辑的延伸，虽然它荒诞不经。新疆乃至中国，当然经历过突发的大规模暴力事件，以及维吾尔人因数十年的歧视和迫害生出的绝望情绪所导致的有预谋的暴力事件；然而，中国政府眼下所采取的一系列防患于未然的政策，似乎是基于大多数维吾尔人都是准极端分子的假设上。\n\n外媒的许多报道都集中在了配合该行动而部署的监控技术的空前规模和侵入程度上，以及中国政府如何向其他国家施压，要求他们协助遣返居住在海外的维吾尔人。但较少受到关注的是，政府动员了超过100万的中国平民（其中绝大多数是汉族），作为军队和警察的补充，住进新疆的维吾尔人和其他穆斯林\n\n少数民族的家里，执行教化和监视任务，他们表现得像大哥大姐，之后却可能决定是否要把面前的男女关进那些营地。\n\n作为一名人类学家，今年春天，我回到曾住过两年时间，研究维汉社会生活的地方，在南疆各地以维族为主的城市聚居区和城镇，我采访了汉族平民国家工作人员。在那里逗留期间，加上之前和之后，通过网络，我和十多个人聊了去维吾尔和哈萨克家庭当“大姐大哥”的经历。他们当中包括去执行监控、身份为平民的国家工作人员，也包括这些实施监控者的朋友和家人。\n\n其中一些人是我2011年开始在乌鲁木齐搞田野调查时结交的汉族朋友。还有一些人，主要是该计划直接参与者的朋友和家人，是我在中国境外认识的熟人。另外一些人是我2018年在乌鲁木齐和喀什遇到的。\n\n我想了解不同的汉族平民群体如何看待自己在这个人类工程项目中的角色，以及他们为什么会同意参与进来。我向他们保证，我会保护他们的身份，以后不会在任何出版物上公开他们的姓名。我问他们如何看待自己的工作及其目的。我还对他们如何与少数民族，以及彼此之间的互动进行了观察。我很好奇，他们是否会同情那些他们参与“改造”的维吾尔人和哈萨克人。\n\n为弟弟妹妹们制定一个时间表是首要任务。每天早上，他们会在村党支部办公室外举行升旗仪式、唱国歌，晚上则参加习氏“新中国”愿景的课程。“文化课”贯穿其间。他们用普通话交谈，观看经过批准的电视节目，练习中国书法，唱红歌。而“亲戚们”则一直在对村民进行观察，做笔记，评估维吾尔人对祖国的忠诚度，注意他们的中文水平，留意他们对伊斯兰教的忠诚是否有“极端”的迹象。\n\n维吾尔主人用阿拉伯语Assalamu Alaykum（祝你平安）跟邻居打招呼？那需要记在笔记本上。家里放的那是一本《古兰经》吗？有人在周五祈祷或者斋月期间禁食吗？妹妹的裙子是不是太长了，或者弟弟的胡子是不是违规了？为什么没有人打牌、看电影？根据当地政府的政策，所有这些维吾尔人的文化实践，都是宗教极端主义的标志。\n\n![2.jpg (0x0)](data/img/post_148_2.jpg)\n\n一名维吾尔族男子在喀什市场上试戴传统帽子。据报道，一对夫妇因违反蓄须和罩袍的规定而被判入狱。\n\n当然，他们也有可能去的是一个“健康的”世俗家庭。也许墙上贴着习近平像和中国国旗。也许孩子们不用提示，就会主动讲普通话。\n\n最重要的证据，并非总是显而易见的。因此，房客们得到授意，要多问问题。主人有亲戚住在“敏感地区”吗？有认识的人住在国外吗？他们懂阿拉伯语或者土耳其话吗？去过村子外面的清真寺吗？如果已成年的弟弟妹妹的回答不完整，或者他们似乎在隐瞒什么，那么接下来就应该问孩子问题。\n\n有时候，大哥大姐担心维吾尔人可能会耍滑头，不管多么兴高采烈地敞开家门，或者宣布对中华民族的忠诚，但在他们的微笑和健康的世俗主义姿态之下，或许隐藏着更为不可告人的效忠，对他们“病态的”宗教方式有着未治愈的忠诚。但用一些简单的方法，就能测出来。可以给主人一根烟或者让其喝口啤酒；向异性的弟弟妹妹伸手问候，留意对方是否退缩。或者，去市场买回一些新鲜的肉馅，提议全家人一起包饺子。然后，等着看维族人是否会问袋子里是什么肉。\n\n所有这些，都是有价值的证据。所有发现都要记录在案，写在本子里，然后在网上填表。大哥大姐会把一切因素考虑在内，最后形成建议，看看哪位主人可以和自己的子女留在家中，哪位主人应该送走，由国家来修复他们的缺陷。\n\n这些“亲戚”基本上是分三拨征召加入进来的。第一波运动始于2014年，政府派遣了20万名党员，包括少数民族党员，在维吾尔人的村子里常住，此乃“访民情、惠民生、聚民心”。2016年，第二波11万名公务员下到维吾尔人的村子，作为“结对认亲”运动的一部分，这个运动重点是把“亲戚”安置在那些有家人在坐牢或者被警察打死的维吾尔人家庭。\n\n2017年，作为2016年运动的延续，第三波探访活动开始了。在这个阶段，派出了100多万平民到农村的穆斯林“亲戚”那里，每次住一周，这次的侧重点，往往是那些被急剧扩大的“教育转化”项目关押者的亲人。\n\n官方媒体把这些“民族团结活动”描述为一种温和的政策方针，说它对新疆的“长期稳定做出了巨大贡献”。在《环球时报》英文版2018年1月的一篇文章中，一个跟喀什一户农家结对认亲的干部，驳斥了西方媒体有关村民反对政府工作人员来访的报道。他指出，在“结亲周”期间，每个政府工作人员每天给“寄居”家庭50元，而且他们“尊重当地维吾尔族村民的传统”。在本文英文版发表后，《环球时报》11月另一篇英文报道中重申了政府的说法，即“配对与援助计划”是成功的。报道称，截至9月，110万名公务员与169万多名公民配对，走访居民4900多万次。\n\n总的来说，这三拨干部队伍下乡，将国家工作人员与挑选出来的维吾尔和哈萨克家庭配对的做法，与上世纪六七十年代，毛时代的国家工作人员和学生下放向普通百姓学习的做法，颇为类似。当年的国家干预与眼下与之类似的强制登门的区别在于，在这种情况下，国家权力正在把城市平民作为国家和汉族价值观的代表，输往维吾尔族和哈萨克族农村的“群众”当中——正如工作手册所言。在过去，城里人下乡是为了“向群众学习”。\n\n这些“亲戚”接到了要如何行事的书面指导。据我在乌鲁木齐、和田的维吾尔熟人说，这些手册里提供指导原则，以及需要填写的表格，然后经数字化放入安全数据库。在喀什地区使用的一本手册中，“亲戚们”得到了具体指导，要如何让”群众放下戒心”。这本手册（一开始放到了网上，但就在本文要发表的时候，又拿了下来）建议大哥大姐要表现出“热情”。它指出“不急于开展宣讲”，要做出关心他们的家人的样子，给孩子带糖果。它列出了一份清单，上面包括这样的问题：“进门时家庭成员表情慌张，言辞躲闪吗？”“家里是否从来不看电视节目，只看 VCD碟卡？”“家里是否还摆放悬挂带有宗教色彩的物品？”\n\n这本手册还示意这些亲戚告诉他们的“弟弟妹妹”，他们的网络和手机都被监控了，所以他们关于伊斯兰教和宗教极端主义方面的想法，撒谎是没用的。这本手册还指示他们要帮助村民脱贫，给他们提供做生意的建议，帮忙做家务。他们被要求上报所有对“扶贫活动”的抵制。\n\n我采访的公务员及其亲属来自两个不同的群体。其中4个人认为自己是新疆的“当地人”，也就是“老新疆人”；还有6个人是过去20年里搬到这里，也就是“新新疆人”。在许多情况下，他们与该地区关系的长短，似乎决定了他们如何看待自己在改造维吾尔社会中所起的作用。\n\n“新新疆人”这个群体以充当“亲戚”、给维吾尔社会带来汉族“文明”而自豪。一些人热情地谈论着中华民族的未来。有的人说，中国终于成为了一个跟其他大国平起平坐的国家。一些人谈到了民族主义动作片《战狼2》，说这部片子让他们身为中国人而感到自豪。其中一些人以“同志”互称，不带一点讽刺的意味。\n\n“新新疆人”这个群体，说起话来像是真正的信徒。一些人说，他们希望为中国民族主义的蓬勃发展出力，让维吾尔社会成为中国特质的一部分。他们对我说，教育维吾尔人是他们的责任。一位从广东来新疆才几年的年轻人告诉我，“这些维族人只是文化程度不高，所以才从事这些极端的伊斯兰教活动，不是他们的错。他们被强硬的极端分子误导了。他们不知道这很糟糕。”他告诉我，国家工作人员上门常住令安全状况得到了改善。他说，“现在，我进维族村子也不害怕了。现在情况好了很多。”\n\n![3.jpg (0x0)](data/img/post_148_3.jpg)\n\n中国国家电视台播放了参加“学习”的穆斯林如何成为守法公民的视频。\n\n与我交谈过的几个“新新疆人”告诉我，他们2014年来新疆的时候，有传言说，汉族老百姓被当地维族人杀死。那个来自广东的年轻人——他喜欢动漫和西方电影，在旅游局工作——告诉我，威胁现在没有那么大了。他说，“我听说，当初有一些汉族工作人员在敏感地区的维族村庄时被杀了。女的晚饭后出去散步时，维族男子抓住她们，割开她们的喉咙。”他用手在喉咙上比划了一下。“我们普通人很多都不了解恐怖主义问题的严重性，”他说。“我们所知道的是，必须要做什么。”\n\n现在，他感到恐怖主义的迫切威胁已经解除了。自2017年以来，生活在维族村庄的汉人非常安全。不过，他还是说，“亲戚们”在村子里的时候，不允许单独外出。为了以防万一，他们外出都是三人一组，其中至少得有一名男公务员。\n\n两名公务员“亲戚”和两名“亲戚”的朋友和家人表示，他们对参与“结对认亲”活动持保留态度。这四人都是在新疆长大的“本地人”，也就是“老新疆”。他们抱怨维吾尔族和哈萨克族村庄的条件艰苦；工作很无聊，他们想念多姿多彩的城市生活。他们一再提到与家人分开的不便。其中一个“亲戚”是第一批长住者，得在穆斯林村庄住满一年或一年以上。他说，每90天只能休10天的假。\n\n他们一再告诉我，为了这个工作，感觉被迫在生活上做了很大的牺牲。他们希望回到国有企业或者政府部门当官，或者在国家单位做医生和编辑。在我采访的人中，有两人告诉我，他们或者他们的朋友，若是拒绝参与这个下乡监控项目，就会丢饭碗，但他们也表示，参与进来的话，等任务一结束，保证会得到提拔。\n\n从2017年9月开始，我跟乌鲁木齐一家国企某中层干部的女儿在网上聊天，她父亲是2016年11万名在“敏感”村庄长住的普通干部之一。最近她去看过他，对他在村子里的工作做了一些了解。她热切地跟我描述起自己的所见所闻，以及她对这件事的看法。她说，作为一个“老新疆人”，她的父亲对维族人并没有什么放不下的怨气，尽管他们确实有朋友在2009年的维吾尔族民众维权抗议和暴乱活动中受伤。她说，父亲在一个维族村庄里住了90天，平均每天的睡眠时间不超过6个小时，一起的有8到10名干部，有汉人也有维族人。\n\n这位干部的女儿二十八九岁，喜欢猫和Lady Gaga，现在生活在美国，用英语跟我交流。她解释说，自己的父亲“被摊上了这个任务”，政府把这些“亲戚”队伍逼得都特别紧，她父亲进行过“反抗”，想让规定灵活一些，不要伤害当地（维族）人的感情。她告诉我，那是她父亲当时唯一能做的。\n\n她说，她听说一些工作人员在村子里受到了维族人的死亡威胁，但她称这是“那些人了解他们之前的事情”。据她解释，之所以发生这种事情，是“因为维族人失去了对政府，或者政府派来的任何人的信任”。在她看来，这不是因为“亲戚们”做了什么。而是维族人误解了他们的任务。\n\n![4.jpg (0x0)](data/img/post_148_4.jpg)\n\n在中国国家主席习近平的视频图像下，是和田的许多个安全检查站之一。\n\n那次交流几天之后，我告诉她，我把她的话转达给了几个维吾尔熟人。他们感到好笑，她父亲怎么可能一方面监控他们的言论，一方面还保护维吾尔人的感情不受伤害呢。在他们看来，像她父亲这样的人都是政府的探子，假装友好而已。他们还说，他们永远不会信任这样的人，但会客客气气，因为他们害怕这些人会上报他们的言论，把他们带走。\n\n对此，这位年轻女士说：“嘲笑、怀疑其实很简单，他们却没有意识到或许还有人试图反抗并找到解决办法。”\n\n她认为，自己的父亲尝试在“亲戚”角色中发挥一点作用，他不去故意侮辱那些受到监视的维族人，同时还允许他们保留一定的尊严。\n\n“我爸不是间谍，他已经尽力而为了。我上次见到他时，他瘦了10斤，每天他都跟我说，他觉得无所适从。然而，他又必须完成他的日常工作，努力以个人的方式安慰那些人家。”\n\n然而，随着对她的采访继续，她之前的辩护没那么可信了。她告诉我，她父亲的任务是在90天一轮的时间里，每天“两三个人一组”探访“村里的每户人家”，判断“这些家庭是否与‘恐怖组织’有联系”。\n\n她说，她相信新疆过去一直是“恐怖主义的目标”，以及“恐怖主义意识形态”在穷困的村庄里壮大。她父亲和其他“亲戚”被送到这些村庄常住是有道理的；她的父亲不仅让新疆变得更安全，而且还帮助村民们认识到世俗化的好处。\n\n她说，事实上，由于这些村子里的大多数维族人是文盲，在决定哪些人应该被送到“再教育中心”时，他还必须考虑他们的“文化水平”。那些很难融入“主流文化”的人，要么被送到“再教育中心”，要么要求他们在晚上或周末上政治课。\n\n她告诉我，所有这些培训着眼于将世俗价值观引入维吾尔社会。在她看来，这无疑是件好事。\n\n她说，新疆的主要问题是人们缺乏有效沟通。汉语和汉族世俗价值观的教育，将改变这个状况。她告诉我，“新疆可以成为另一个云南，省外的人会被吸引到这里，而来自省内的人被同化。”\n\n总的来说，跟我谈到上门“亲戚”的5位维族人，在说起他们的时候，蔑视中混杂着恐惧。他们形容自己感到被矮化，失去了尊严。当中许多人告诉我，他们生活的方方面面感觉都像是一场政治考验。他们似乎对这些“亲戚们”能关注到他们生活中的悲伤和困难不抱任何希望，因此拒绝执行他们重塑维吾尔社会的命令。\n\n正如一位家人在和田政府工作的维吾尔中年人在邮件里给我写的：“这些汉族国家工作人员看到农民生活在赤贫当中之后，可能会更加同情他们，或者来访之后，可能会更加鄙视维吾尔人。他们对维吾尔人‘落后’的看法，以及他们作为汉族人的优越感，在这个过程中可能得到强化。”\n\n许多维吾尔人告诉我，“结对认亲”最痛苦的部分，或许是它虚弱了维吾尔父母的权威，并摧毁了家庭。他们说，这些“亲戚”试图夺走他们的未来。许多人解释说，家庭和他们的信仰，是维吾尔人最后的避难空间和获得安全感的地方。那位中年维吾尔人说，“现在他们夺走了我们的家庭和信仰。现在我们一无所有了。”\n\n![5.jpg (0x0)](data/img/post_148_5.jpg)\n\n大门前的一块牌子显示这里是一座“教育转化中心”。它是自毛泽东时代以来最为广泛的拘禁营项目的一部分。\n\n在住在农村期间，这些公务员花大量时间，确保对维吾尔族儿童的教育是用中文进行的，并确保教育中包含了有关新中国的爱国主义元素，淡化他们作为少数民族的差异。网上发布的那个手册，尤其鼓励他们通过维族儿童了解真实情况。\n\n在维吾尔人聚居地进行的诸多人类工程项目中，国家通过大量增加讲汉语的教师人数，似乎正在努力隔开维吾尔儿童与他们的父母以及维语教育的联系，并利用刑罚中心体系，减少维吾尔文化价值观及其规范对儿童的影响。\n\n有一个维吾尔年轻人，我叫他阿利姆，他的哥哥于2018年1月被带走，他害怕如果嫂子也被带走的话，自己的侄女和侄子要怎么办。这位年轻人穿着紧身牛仔裤，戴着苹果手表，主要跟我讲英语，还会说一口流利的汉语。他说哥哥以游客身份去过土耳其，他猜测这可能就是他被带走的原因。他说，他的嫂子“在政府工作人员上门时，仍然有些不服，所以我担心他们会认为她也需要接受再教育。如果那样的话，她的孩子将由国家来监护”。事实上，网上发布的新闻报道和政府建筑招标都显示，新疆在建的孤儿院数量出现激增。阿利姆告诉我，他和父母当然很乐意照顾他的侄女和侄子，但听到许多报道说，拘留者的子女不能由家人照顾。\n\n他用颤抖的声音说：“他们想把我们的孩子从我们身边带走。我侄子8岁。他已经受到了这件事情的影响。现在变得不大爱说话了。”\n\n他说，最后一次在侄子的脸上看到发自内心的笑容，是在他生日那天，打开“父亲送的”礼物时。“我们跟他说，他父亲从北京给他寄来了乐高积木。我们告诉他，他父亲在北京出差去了。他很开心。”\n\n在我交谈过的许多下乡的“亲戚”当中——既有本地的“老新疆”，也有近些年来新疆的汉族定居者，他们对于“再教育转化”中心里的生活，不太有概念。这两个群体都把穆斯林被送去的地方称为“学校”，认为穆斯林在那里接受现代的汉族生活的教育。\n\n当我进一步追问时，前文提到的那名来自广东的“新新疆”年轻人告诉我，这些“学校”就像戒毒所。他说，他们也知道对于那些被送到那里的人及其家人来说，一定很艰难，但若不干预的话，代价太高。他说极端主义意识形态是一种病，必须被“治愈”，这与中国官方媒体的报道中经常出现的一个比喻类似。他说，“这些维吾尔人正接受治疗。”\n\n下乡的“老新疆”对于这些营地，看法就没有那么乐观了。他们说，维族人被送进一个“再教育中心”，可能是因为没有人保护他们。这个体制就是这样运作的。也正是因为这个体制，他们这样的“当地人”必须参与进来。“我们没有办法去保护维族人，”一位在乌鲁木齐与维吾尔同学一起长大的汉族中年妇女告诉我。“所以我们必须设法保护自己。”\n\n![6.jpg (0x0)](data/img/post_148_6.jpg)\n\n2015年，新疆西部的喀什，以汉族为主的政府加强了对维吾尔人的控制。这些维吾尔人大多是逊尼派穆斯林。\n\n几名汉族工作人员说，新疆政治的两极分化到了让人联想到“文革”的程度。每个人都必须同意党的路线，否则就会受到排斥，面临牢狱之灾。当然，他们说，眼下的人类工程项目的主要目标是维吾尔人和哈萨克人。作为汉人，只要顺从，他们认为自己就安全了。\n\n不过，他们还是对以后的情形又担心。一个年长的“老新疆”妇女说，“我不知道如果我们把那些维族人放出去之后，会发生什么。”\n\n不管是新来的新疆人还是住了很长时间的新疆人，许多汉族“亲戚”及其朋友家人告诉我，他们在公开场合对这项运动必须绝对支持。在工作单位要求他们写的网络文章中，汉族的国家工作人员会说，他们在维吾尔人家中住的那几周所遭遇的困难，表明他们愿意为国家做出牺牲以及关切维族人。他们发表的文章和图片，符合这个运动的口号：“访民情、惠民生、聚民心”和“民族团结一家亲”。\n\n有人贴出了一些自己大声朗读，让穆斯林少数民族深入体会“习近平思想”的照片。还有人贴出了一张她与她的乡下“亲戚”俯身在一个视频播放器上看政治讲话的照片。就连抱怨个人生活受到影响的国家工作人员，似乎也接受了自己在维族“小弟小妹”面前扮演自诩的“大哥大姐”角色。他们中的许多人似乎都认为，称维族男性为爹爹或者弟弟是一种亲昵行为，是汉族公务员包容的表现。正如那位中层干部的女儿告诉我的，她父亲在一个“敏感的”村子里长期担任“亲戚”工作：“现在他在那个村子里已经住了10个月，当地人都把他当家人了。”\n\n一位年轻的女“亲戚”写道，她让一位年长的维吾尔族男子和她一起观看一段党的领导人的讲话视频时，感觉自己“就是他的女儿”。\n\n在他们的博客贴文中，汉族“亲属”们乐于表现维吾尔族儿童喜欢他们的教导，或者维族母亲急切地摆姿势拍照。他们把这些行为视为好客和热情的表现。“民族团结一家亲”的计划似乎奏效了。\n\n“亲戚们”尝试以善意回应。常见的做法是向他们的维吾尔族和哈萨克族“亲戚们”赠送礼物，以此弥补因招待他们，以及警察国家无所不在所导致的收入损失。其中一些礼物是大米和油，给穆斯林“亲戚”提供食物补充，但有些象征性的礼物，是为了巩固汉族访客们作为文明使命肩负者的地位。\n\n例如，根据网上的宣传材料，一群政府工作人员给维吾尔农民送去桌子和台灯，方便他们在晚上学习。他们写到，这些桌子会让这些农民们更舒服。其实许多维吾尔农民吃饭或者喝茶，并不习惯用桌子。维吾尔人有一个历史久远的传统，就是在一个台子上简单地铺一块桌布，用于吃饭。在他们的报告中，汉人来访者说这个传统“不方便”，是维族人贫困的标志。\n\n我采访的那些“亲戚”，往往不理解东道主对他们角色的看法。也许是因为他们在去那里之前，并不了解维吾尔人的生活，而且也没有意识到，他们向其传授汉族世俗价值观的那些村民，是何等的恐惧、愤怒与悲伤。\n\n在对下乡经历的描述中，那些下乡的公务员往往没有注意到，他们所支持的安全机构恰是维吾尔人贫困的主要原因之一。\n\n我采访过一位在乌鲁木齐长大的汉族年轻女性（她没有被派下乡），她说，她认识的一个工作队，对于维吾尔家庭把这些“亲戚们”给他们的礼物放屋子角落里的做法感到不解。他们说，几周后再回去时，那些礼物似乎都没有用过。他们不明白，为什么要拒绝礼物。\n\n![7.jpg (0x0)](data/img/post_148_7.jpg)\n\n去年，警察在中国新疆喀什巡逻。\n\n我采访过的两名工作人员表示，他们希望与维吾尔人和哈萨克人的互动，能够培养出真正的友谊。他们说，他们很难过，穆斯林那一方没有那么“坦率”。\n\n那位中层干部的女儿告诉我，她觉得我和我的维族朋友可能认为她“傲慢自大、不关心少数民族的生活”。她认为自己遭到了误解。她说：“请不要质疑我对维族人或中国其他少数民族的感情。”她觉得，虽然“亲戚”所使用的方法并不完美，但她和她父亲都是真诚的。\n\n尽管政府工作人员持续数周的强行上门具有强烈的讽刺意味，但与我交谈过的大多数“亲戚”都表示，他们希望能够与“不文明”的维族村民建立联系。事实上，与他人的近距离接触，有时会产生特殊的友谊，这种友谊可以培养对差异的包容。人们可以因此从相同的角度看问题。事实上，这正是汉族“亲戚们”所使用的工作手册上警告的“十不要”之一：“不要动摇立场，产生同情，最后被洗脑。”\n\n在试图全方位主宰生活的极权主义过程中，中国西北部正在发生的暴政，把不同群体的中国公民对立起来。暴政把汉族“亲戚”和他们的维吾尔和哈萨克主人强行建立联系的做法，在导致家庭、朋友和社区分裂的同时，也导致了个体遭到孤立，以及孤独的蔓延。随着不自由达到新的程度，这个项目造就了何为正常和平庸的新标准。我交谈过的“亲戚”替国家做着拆散维族家庭、把他们送进营地系统的工作，却认为自己只是“在做一份工”。\n\n我相信他们。在很大程度上，他们似乎根本没有考虑过自己所带来的恐怖。他们处在一个没有新闻自由的环境里。我采访的大多数人根本不知道或不相信，再教育营是中国特有的集中营形式，里面殴打和心理折磨司空见惯，也不知道或不相信维吾尔族和其他少数民族会认为送到再教育营是一种惩罚形式。在我采访的10名新疆汉人中，只有一人认为，这些营地被用作监狱，来关押那些仅仅因为错误的宗教信仰或者民族类别而获罪的人。\n\n正如戴维·布罗菲(David Brophy)等人所指出的，在撰写有关汉族平民参与大规模拘禁穆斯林少数民族的文章时，同样不能忘记的是，抗拒国家维族人政策的汉族平民，会将自己置于严重危险之中。我在新疆的一个汉族朋友告诉我的，在这里，“哪里有压迫”遇到的不是“哪里就有反抗”，而是“哪里就有屈服”。考虑到新疆搞的那种警察国家的极权政治，汉族平民似乎常常觉得，他们别无选择，而只能参与由国家主导的对穆斯林少数民族的压迫中。\n\n集权国家的民众几乎总是被迫以否认其道德义务的方式行事。为了让汉族平民拒绝中国政府迫害穆斯林的民间政治成为可能，首先需要的是对中国西北部发生的事情做出准确描述。正如汉娜·阿伦特(Hannah Arendt)在几十年前所说的，这样的系统之所以有效，在一定程度上是因为参与者被禁止思考自己的所做作为究竟意味着什么。因为不许思考，他们就无法从那些生活被他们摧毁者的角度去充分想像他们该如何生活。\n\n来源：   纽约时报中文网  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 147,
			"title": "工厂、医院变成教育转化营",
			"date_published": 1545654722.55,
			"body": "中共秘密将在押的维吾尔人「藏匿」到工厂、医院等外表不起眼的场所之中，但此举适得其反，暴露了新疆当局对监狱般的关押场地的需求欲壑难填。\n\n新疆当局自2014年开始兴建教育转化营，来关押、「改造」维吾尔族穆斯林。陈全国任新疆党委书记后，加速兴建教育转化营，强化再教育活动。从2017年开始，许多大型产业基地、党校、医院、教育设施都被改建成了教育转化营。\n\n![1.jpg (0x0)](data/img/post_147_1.jpg)\n\n新疆霍城县服装服饰产业园已被改建成转化营，但产业园的牌子没变，还竖立在大门旁边\n\n「霍城县服装服饰产业园」位于远在中国西部边疆霍城县的朝阳南路，建于2015年，占地面积约3万平方米（约32.3万平方英尺），里面有纺织、电焊、服装、针织及相关产品的生产培训车间。产业园内工作人员多达2000多人，但如此大规模的现代化产业基地仅维持了两年。\n\n---\n\n如今，该产业园的大门前设置了防护栏，四周是高约4米（约13英尺）的围墙，围墙上每隔10米（约33英尺）就设有一个摄像头。\n\n![2.jpg (0x0)](data/img/post_147_2.jpg)\n\n通往这座位于霍城县的转化营的公路上满是摄像头\n\n据知情人向《寒冬》透露，2017年10月，该产业基地被当地政府改造成关押维吾尔人的教育转化营，同年11月份就有3000多人被关在那里，2018年9月，关押的人数已超过6000人。其中，仅该县惠远镇两个大队（大队是新疆的村级行政单位）就有700多人被关押在此。\n\n该转化营一位工作人员称：「只要是被关进来的人思想都有问题，所以我们对他们进行爱国主义教育，第一步是学国语，认识汉字3000个，第二步是学习法律，第三步是学习技能。这里没有自由，他们的吃喝拉撒全都在监控下进行。」\n\n![3.jpg (0x0)](data/img/post_147_3.jpg)\n\n该转化营旁边是「油库公安检查站」，所有车辆都要经过这里检查后才可通行\n\n医院本是救死扶伤之地，但同样被用来关押「政治犯」。新华医院就是其中一例。新华医院建于1991年，是伊宁市最早的医院之一。该建筑规模庞大，医院中翼共有四层，每层约有34个病房，每个病房4张床，另一栋楼曾是高干病房，共12层，每层24间房，每间两张床。据知情人透露，该院至少能关押2500人。\n\n有知情人向《寒冬》透露，当地政府原计划于2017年上半年把这家已有26年历史的综合医院改建为伊犁州儿童医院。不料，安全部门占有了这家医院，并将其用作「教育转化营」。\n\n如今，该医院大门口右侧新建了警务岗亭，挂着「公安」的牌子，大门两侧多了「出口」「入口」字样。进入大门有一个检查箱包的安检系统，进去的人必须经过人脸识别和身分证识别的安检流程。\n\n《寒冬》此前已多次报道过类似这样的现有建筑被改造成教育转化营，这样的改建行动遍及新疆各地。有分析人士指出，中共本想把再教育营藏进看似「普通」的建筑群里，借此掩人耳目，掩盖其大规模拘禁及「再教育」活动的严重程度。但随着新疆大量「隐藏的」教育转化营不断曝光，这些都已成为当局践踏人权的证据，也证实了他们对更多关押维吾尔穆斯林场所的需求在不断增加。\n\n来源：   寒冬  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 146,
			"title": "新疆达坂城职业技能教育中心",
			"date_published": 1545187922.068,
			"body": "![8.jpg (0x0)](data/img/post_146_8.jpg)"
		},
		{
			"post_id": 145,
			"title": "新疆哈萨克示威学生被关在猪肉冷藏库里",
			"date_published": 1545103407.151,
			"body": "自由亚洲电台：新疆北部阿勒泰地区多个县的哈萨克族穆斯林学生，被当地官员强迫吃猪肉，遭到拒绝。该地区哈巴河县一穆斯林本周日（16日）晚间对本台披露，约四百名哈萨克族学生因游行抗议而被抓，目前大部分人下落不明：“一个星期前，哈巴河县学校的学生，有些是住宿的学生，还有高中、托儿所，让他们吃猪肉，他们绝食、不吃。抓到以后把他们送到哪里都不知道。反正是被拉走了。”\n\n这位穆斯林称，在布尔津县也出现穆斯林学生抗议吃猪肉事件，遭到公安抓捕：“在布尔津县，有一个冷库，有人用卡车拉来猪肉。哈巴河的学生反抗，被拉到布尔津县的冷库里面。他们也是反抗。哈巴河县现在被警察包围。周围县的人不让进入哈巴河，好几天了。还有塔城地区的托里县、额敏县、乌苏市也都封闭了。”\n\n另一位旅居哈萨克斯坦的穆斯林对本台说，她也听闻新疆哈巴河县被警察和军队封锁。她说：“因为现在要让新疆穆斯林强行吃猪肉，在哈巴河县的学生们抗议，要求不吃猪肉，但消息被严密封锁。”她还表示，对新疆人来说，要么反抗而死，要么被警方侮辱折磨、洗脑改造，这两条都是死路。\n\n昌吉州奇台县一位年轻的穆斯林商人对记者说，政府明知穆斯林从不接触猪，却兴建大型养猪场。政府官员强迫少数民族干部和群众吃猪肉，已非常普遍：“是的，是的，我也听说了（学生抗议）。这个（逼迫穆斯林吃猪肉）事，在新疆都普遍了，很多地方有这个政策，这事是真的，还有我们昌吉奇台和吉木萨尔两县之间，他们（政府）现在正在建一个很大的养猪场，让这些哈萨克等少数民族，在养猪场工作。”\n\n据哈萨克斯坦人权组织阿塔珠尔特志愿青年组织（Atajurt）对本台表示，被羁押在新疆集中营的少数民族还包括吉尔吉斯族。11月23日及27日，海外吉尔吉斯人在哈萨克斯坦及吉尔吉斯斯坦首次举行新闻发布会。该组织说，他们有五万人被羁押在新疆政治改造营内。12月16日，旅居哈萨克斯坦的十多名哈萨克人，在中国驻阿拉木图总领事馆外，举牌抗议新疆当局羁押他们的亲友，要求当局立即放人。"
		},
		{
			"post_id": 144,
			"title": "四川阿坝再有两藏人自焚抗议",
			"date_published": 1544877911.94,
			"body": "自由亚洲电台：四川阿坝再有两名年轻藏人上周以自焚抗议中国当局的高压政策。继上月四日和本月八日在四川阿坝州阿坝县两名年轻藏人先后发起自焚抗议活动之后，当地又传出再有两名年轻藏人高呼口号一同自焚。\n\n印度南部西藏南卓林寺高僧曲珠仁波切星期五（14日）引述境内可靠消息向本台表示：“这次在阿坝县发生的自焚事件属实。自焚者是年仅16岁的藏人更敦嘉措和曲格嘉措。他们于本月9日，即藏历11月2日在阿坝州阿坝县格尔登寺附近主街‘英雄路’（此街道因有多位僧俗藏人自焚而得名）高呼‘西藏自由’等口号点火自焚，以抗议当局的对藏高压政策。”\n\n曲珠仁波切说：“自焚者更敦嘉措和曲格嘉措都是僧人，其中一人父亲名叫吉嘎。他们自焚后被分别送到红原县医院和马尔康县医院，据说一人已经过世，另一人仍还活着，正接受救治。但是因为当地被军警严密布防戒备，两人的具体情况很难打听清楚。”"
		},
		{
			"post_id": 143,
			"title": "中共在西藏佐盖要求清理达赖喇嘛画像换挂领袖像",
			"date_published": 1544453839.008,
			"body": "【西藏之声2018年12月10日报道】中共于西藏东北部佐盖多玛地区实行“十四世达赖画像专项清理工作”，在收缴寺院与民间所藏达赖喇嘛尊者画像的同时，强令各方改为悬挂中共领袖像。藏人行政中央驻澳办事处华人事务联络官格桑坚参评论说，这一政策显示中共所谓“依法治国”、“依法治藏”等口号的虚伪性，必将引起藏人的不满。\n\n---\n\n近期，中共印发所谓《合作市关于开展十四世达赖画像专项清理工作的实施方案》政策，并于西藏佐盖多玛乡检察寺院与民居，没收藏人供奉的达赖喇嘛照片，同时强迫大家悬挂中共领袖像。\n\n境内作家唯色在推特转发“佐盖多玛党群微平台”于本月8日发布的消息，内容为该地区官员为了坚决与所谓“达赖集团”和“境外敌对力量”作斗争，以及根据中共合作市委组织部在近期印发的内容要求，而在佐盖多玛乡针对各寺院、村组干部，以及藏人党员，示范带头展开清理达赖喇嘛画像，并要求悬挂中共领袖像。\n\n消息指出目前在该地区内，已经完成了对2座寺院内的4座佛殿、6所玛尼房、村组干部和部分群众党员家中的达赖喇嘛画像进行了清理，并悬挂了领袖像。当局也称将继续在僧俗群众内展开“清理”活动。\n\n中共当局从2012年开始实施所谓“九有政策”，第一项就是“要有领袖像”。藏人行政中央驻澳洲办事处华人联络官格桑坚参向本台表示，“以前在西藏自治区，中共不允许各寺院供奉尊者达赖喇嘛的画像，而且各家庭也会突击检查是否供奉尊者画像。而在其它藏区，虽然中共三申五令不许供奉尊者画像，但由于这些地区藏人的强烈抵抗而一直无法落实。现在，西藏安多合作市发布官方文件，要在各寺院及家庭强行清理尊者画像的同时，要悬挂中共领袖的画像，这种做法不仅严重违反了中国自己的法律，而且完全证明了所谓的‘依法治国’、‘依法治藏’的虚伪性。这种做法又会引起当地藏人的强烈反抗而会导致更多的镇压和杀戮，这是所有藏人的悲剧。”\n\n西藏作家唯色在2013年的一篇文章中评论中共的“送领袖像”运动，指从中共入侵至今，一直在延续的挂领袖像运动隐含的意义是：“你们是被我们解放的，是我们给了你们新生，因此你们必须要在言行举止方面，做出感恩戴德、效忠服从的姿势。”"
		},
		{
			"post_id": 142,
			"title": "哈萨克人失联后被逼向妻子提出离婚",
			"date_published": 1543503790.191,
			"body": "拥有哈萨克护照的吐尔森别克，2017年9月进入中国新疆境内后，跟家人失联，妻子四处追寻下落不果，怀疑丈夫已被送进教育营。最近吐尔森别克突然透过信件表示要跟她离婚。家人大惑不解。\n\n她们一家人录制一段视频，呼吁国际社会提供协助。\n\n![9.jpg (0x0)](data/img/post_142_9.jpg)"
		},
		{
			"post_id": 141,
			"title": "新疆职业技能教育培训中心",
			"date_published": 1543471555.234,
			"body": "![1.jpg (0x0)](data/img/post_141_1.jpg)\n\n![2.jpg (0x0)](data/img/post_141_2.jpg)\n\n![3.jpg (0x0)](data/img/post_141_3.jpg)\n\n![4.jpg (0x0)](data/img/post_141_4.jpg)"
		},
		{
			"post_id": 140,
			"title": "这是在新疆被中共囚禁的维吾尔族人！人间地狱！",
			"date_published": 1542456453.305,
			"body": "\"201囚室里关了68人，我的囚号是54。晚上我们轮班睡，只能侧躺。限制饭和水是为了控制我们上厕所的次数，最珍贵的东西是一口馒头和手纸。有时会整天挨饿。晚上能听见男囚们的惨叫，非常凄惨。审讯中逼我们吃的药片使我们变得迟钝。给我们定期喝的一种浑浊的液体导致所有女囚绝经\"。"
		},
		{
			"post_id": 139,
			"title": "新疆街头",
			"date_published": 1541731914.692,
			"body": "![9.jpg (0x0)](data/img/post_139_9.jpg)"
		},
		{
			"post_id": 138,
			"title": "中共不亡，人类终将被其奴役和毁灭！",
			"date_published": 1541730068.163,
			"body": "据自由亚洲电台消息：2015年5月13日，来自新疆库尔勒市且末县的维吾尔女子米娜从埃及带着2个月大的3胞胎，回新疆娘家。却无端遭受中共3年酷刑折磨迫害右耳失聪，三个孩子中两个小孩颈部被开口插管喂食，1个夭折。\n\n丈夫因妻子失联，到中国寻找，已音讯全无。今年4月8日在埃及政府协助下，米娜虽遭遇中共多次阻拦，但最终带着两个孩子逃离中国。米娜讲述她在狱中三年的经历。米娜说她除了遭到暴力殴打外，还包含一些侮辱，例如在警察办公室被脱光衣服、被男人检查。\n\n3年间，米娜在狱中目睹9人受虐至死，在再教育营里，穆斯林的生命安全没有保障。另一个让人感到可怕的是，米娜说，她曾4个多月没喝过水，只有吃药的时候才能喝水。被关押的人争着吃药，因为吃药时有水喝。"
		},
		{
			"post_id": 137,
			"title": "人权组织责中共利用西藏僧尼作为宣传工具",
			"date_published": 1541263752.408,
			"body": "![8.jpg (0x0)](data/img/post_137_8.jpg)"
		},
		{
			"post_id": 136,
			"title": "新疆集中营中不断有人死亡",
			"date_published": 1541240934.003,
			"body": "网传知名企业家，Amina食品有限公司创办人Amina Ablimit 于2018年11月2日死于新疆集中营里。\n\n![9.jpg (0x0)](data/img/post_136_9.jpg)"
		},
		{
			"post_id": 135,
			"title": "新疆维稳",
			"date_published": 1541163927.295,
			"body": "![8.jpg (0x0)](data/img/post_135_8.jpg)"
		},
		{
			"post_id": 134,
			"title": "新疆喀什集中营",
			"date_published": 1541043918.396,
			"body": "![1.jpg (0x0)](data/img/post_134_1.jpg)\n\n![2.jpg (0x0)](data/img/post_134_2.jpg)\n\n![3.jpg (0x0)](data/img/post_134_3.jpg)"
		},
		{
			"post_id": 133,
			"title": "新疆穆斯林男性劳动力持续被抓捕",
			"date_published": 1540737084.118,
			"body": "![9.jpg (0x0)](data/img/post_133_9.jpg)\n\n这不仅仅是人权危机，很多家庭因失去主要劳动力而面临破裂。\n\n维族青年学生沙比提向《寒冬》透露，从今年5月开始，他就和父亲失去联系了。尽管一家人当时未收到任何消息，但他们不久便得知警察将沙比提的父亲和四位叔伯都抓走了，并把他们关进了「教育转化」营。\n\n沙比提说他们五人是家里的主要劳动力，「现在地里的活也没人干了，羊也没人管了」。他还表示，现在他们村（堡）的男人几乎都被抓完了，其中近70人也被关押在同一所教育转化营。\n\n同时，家住伊犁哈萨克自治州的艾里甫也于今年三月被带走。他的妻子说，居委会的人来把她丈夫叫走了。他这一去就再也没有回来。两天后，她的两个儿子也被带走了。目前他们三名维吾尔人都被关押在教育转化营，其中原因不为人知。\n\n艾里甫的妻子说：「我今年都60多岁了，还有心脏病，自从丈夫儿子被抓走，天天夜里失眠睡不着觉，心里总牵挂着他们，不知他们是死是活。」\n\n去年9月，新疆塔城地区一名回族阿訇白万良被当地警察带走。白妻独自忙于照顾三岁的儿子，直到今年年初她家里的生活都由两个叔叔帮忙解决。但4月，白万良的两个叔叔也被以「了解事情」为由带走关押。这些男士被关押后，再也没有回来。这给他们的家庭还有白万良年迈的爷爷奶奶带来了巨大的心理负担和经济压力。\n\n来源：   寒冬  【维吾尔之声 uyghurpress.com】"
		},
		{
			"post_id": 132,
			"title": "新疆再教育营",
			"date_published": 1540445960.663,
			"body": "BBC刊出新疆再教育营报导指出，卫星图对比可见达坂城于2015年只是一片荒漠，在2018年却盖起巨型建筑物，外头有2公里长围牆环绕和16座警备塔。\n\n英国广播公司（BBC）前往新疆一探再教育营，发现当地警备森严。\n\n![9.jpg (0x0)](data/img/post_132_9.jpg)\n\n从卫星图可发现，在短短3年间，教育营所在地从一片荒漠，盖起了一大排监狱型建筑物。"
		},
		{
			"post_id": 131,
			"title": "新疆街头",
			"date_published": 1540219213.217,
			"body": "![9.jpg (0x0)](data/img/post_131_9.jpg)"
		},
		{
			"post_id": 130,
			"title": "新疆集中营",
			"date_published": 1539836746.363,
			"body": "![1.jpg (0x0)](data/img/post_130_1.jpg)\n\n![2.jpg (0x0)](data/img/post_130_2.jpg)"
		},
		{
			"post_id": 129,
			"title": "父親被關新疆再教育營11個月！",
			"date_published": 1539830985.12,
			"body": "父親被關新疆再教育營11個月！受迫害者：不知道他是否還活著\n\n![9.jpg (0x0)](data/img/post_129_9.jpg)"
		},
		{
			"post_id": 128,
			"title": "新疆的牛羊肉店铺",
			"date_published": 1539492942.095,
			"body": "![1.jpg (0x0)](data/img/post_128_1.jpg)\n\n![2.jpg (0x0)](data/img/post_128_2.jpg)\n\n![3.jpg (0x0)](data/img/post_128_3.jpg)\n\n![4.jpg (0x0)](data/img/post_128_4.jpg)"
		},
		{
			"post_id": 127,
			"title": "一哈萨克干部音频：",
			"date_published": 1539401897.346,
			"body": "两件事:1.晚上都来政治学习；2.今天县里来领导抽查5户，发现2斧头，1把刀子，1把剪刀没打码，住此户干部和户主被登记了，怎么处理不知道，所以把家里的斧子，榔头，菜刀，剪刀，超过20CM的除铁锹都得打码，现在查的很严格，房子里外每个角落都会看。必须2-3天内打码,否则都会没收"
		},
		{
			"post_id": 126,
			"title": "新疆集中营",
			"date_published": 1539311436.27,
			"body": "Ilham,28岁，阿图什阿扎克乡伯干村人，2016年当局通过拘禁其父母逼迫在埃及留学的他回家。去年底他的遗体由集中营交还给亲属。\n\n目前他的几个哥哥也在集中营里。他是已被确认的第三个从埃及返回来后遭杀害的学生。另两名学生死于库尔勒的监狱(美联社的@gerryshih曾做过报道)"
		},
		{
			"post_id": 125,
			"title": "新疆人在集中营的生活日常",
			"date_published": 1538761035.807,
			"body": "喀什疏附县工业城教培中心(即第一集中营)看守：\"学员们6:30起床叠被，洗漱。吃饭前唱红歌，上课前背习近平语录。上厕所要报告请示。宿舍里上厕所通过摄像头请示。每人如厕时间5分钟。22点睡觉。他们一天24小时的活动都要规范，都要受监控\"。"
		},
		{
			"post_id": 124,
			"title": "新疆集中营全国分解，最远将囚犯送到了黑龙江",
			"date_published": 1538542988.994,
			"body": "黑龙江泰来县政协一秘书在电话采访中证实20多天前从'新疆'转来的一批囚犯关进了泰来监狱，数目不详，这只是一部分。目的显在对应国际监督。"
		},
		{
			"post_id": 123,
			"title": "20-30 萬新疆人被載離新疆",
			"date_published": 1538501289.159,
			"body": "《自由亞洲電台》指出，中國近年在新疆廣設「再教育營」，大量關押被當局認為思想有問題的維吾爾人，上月底更爆出全面停售進出新疆的火車票，令發外界猜想。有外媒證實，當局上月底將原關押於新疆的少數民族通過列車全面運送至鄰近省份，移轉人數高達2、30萬人。"
		},
		{
			"post_id": 122,
			"title": "这些人死在新疆集中营",
			"date_published": 1538459422.115,
			"body": "![9.jpg (24x24)](data/img/post_122_9.jpg)"
		},
		{
			"post_id": 121,
			"title": "新疆准备大规模转移集中营关押人口",
			"date_published": 1538450807.727,
			"body": "![9.jpg (24x24)](data/img/post_121_9.jpg)"
		},
		{
			"post_id": 120,
			"title": "新疆大规模转移穆斯林 集中营迁甘肃",
			"date_published": 1538450353.879,
			"body": "据自由亚洲电台：中国新疆当地居民向本台披露，新疆当局自9月26日起，通过列车全面转移维吾尔族、哈萨克族及吉尔吉斯等少数民族穆斯林。南疆维族穆斯林被运往北疆，而北疆哈萨克人则被送往甘肃地区。新疆大规模转移穆斯林的消息，上周也经本台维吾尔语部得到新疆喀什疏附县警方证实。9月上旬起，新疆当局将关押在所谓“去极端化教育中心”、“职业技能培训中心”的穆斯林，逐渐转往其他地区。据新疆多位要求匿名的穆斯林披露，此次转移涉及新疆南部喀什、和田等地的维吾尔族，以及北疆伊犁哈萨克族自治州等地的哈萨克族聚集区，转移人员高达二、三十万。"
		},
		{
			"post_id": 119,
			"title": "随处可见安检搜查手机，有加密技术的通讯软件会导致被拘押",
			"date_published": 1537930281.43,
			"body": "在哈萨克斯坦上学的赛拉斯在父亲的手机上装了 #Whatsapp 并发了一条“嗨，爸！”来测试软件。之后，他53岁的农民父亲卡林汗·艾特卡里在回新疆参加婚礼时被警察盘查为什么安装Whatsapp，后更被送到“教育转化中心”。"
		},
		{
			"post_id": 118,
			"title": "新疆的“三祝愿”“三感恩”",
			"date_published": 1537222757.148,
			"body": "![1.jpg (24x24)](data/img/post_118_1.jpg)\n\n![2.jpg (24x24)](data/img/post_118_2.jpg)\n\n![3.jpg (24x24)](data/img/post_118_3.jpg)"
		},
		{
			"post_id": 117,
			"title": "新疆 居民区及商店",
			"date_published": 1537014244.474,
			"body": "![8.jpg (24x24)](data/img/post_117_8.jpg)\n\n新疆居民区\n\n![9.jpg (24x24)](data/img/post_117_9.jpg)\n\n居民区商店"
		},
		{
			"post_id": 116,
			"title": "新疆 居民小区",
			"date_published": 1536998306.442,
			"body": "![8.jpg (0x0)](data/img/post_116_8.jpg)"
		},
		{
			"post_id": 115,
			"title": "新疆集中营",
			"date_published": 1536992503.702,
			"body": "![8.jpg (0x0)](data/img/post_115_8.jpg)"
		},
		{
			"post_id": 114,
			"title": "新疆 铁笼里的商店",
			"date_published": 1536925863.745,
			"body": "![8.jpg (0x0)](data/img/post_114_8.jpg)"
		},
		{
			"post_id": 113,
			"title": "联合国要求中共立即释放被关押的1百万新疆维吾尔人！",
			"date_published": 1535731446.733,
			"body": "联合国指控中共利用对恐怖和极端主义给出模糊概念，大肆非法拘留和关押少数族裔。没有合法指控，审判和定罪。被关押者遭受非人的虐待，禁食，拷打。强迫唱红歌，发誓效忠习近平。绝大部分被关押者从未犯罪。并与外界隔离，担忧红匪要搞种族灭绝。\n\n![8.jpg (24x24)](data/img/post_113_8.jpg)"
		},
		{
			"post_id": 112,
			"title": "新疆阿勒泰地区的“邻里中心”--集中营",
			"date_published": 1535309268.382,
			"body": "![8.jpg (24x24)](data/img/post_112_8.jpg)"
		},
		{
			"post_id": 111,
			"title": "母亲被带着手铐回来参加葬礼",
			"date_published": 1535172405.966,
			"body": "昨天听了一个很可靠的消息，一个哈萨克母亲被关进集中营，孩子交给外婆养着，后来外婆也被关进集中营，结果孩子在家死了，在孩子葬礼上母亲被带着手铐回来参加了葬礼一小时后被带走了，太扎心了。共产党不是恶党，是恶魔啊！"
		},
		{
			"post_id": 110,
			"title": "今日新疆",
			"date_published": 1534398066.598,
			"body": "![9.jpg (24x24)](data/img/post_110_9.jpg)"
		},
		{
			"post_id": 109,
			"title": "中国警方正在建立一个全球的维吾尔人登记册",
			"date_published": 1534348283.971,
			"body": "中国警方正在建立一个全球的维吾尔人登记册, 包括居住在美国的维吾尔人, 要求他们的电话号码, 地址, 甚至车牌号码。"
		},
		{
			"post_id": 108,
			"title": "中国政府正在对该国最大的穆斯林群体-维吾尔人进行残酷的镇压",
			"date_published": 1534298059.639,
			"body": "数以万计的摄像头，每两百米一个警亭。人脸识别，查指纹视网膜，查手机里的应用与照片，至少有80万维吾尔人被关入集中营。根本就无视法律，绝世罕见的以警治国。中共应该意识到，维吾尔人只会越来越愤怒。"
		},
		{
			"post_id": 107,
			"title": "一个熟人刚从新疆旅行回来，惊讶的跟我讲：",
			"date_published": 1534176503.771,
			"body": "新疆现在好夸张啊，三步一岗五步一哨安检都要脱鞋子，她的一个在新疆的朋友跟他们打电话完全不敢说新疆这里有问题你们不要来，因为曾经说过，电话刚挂就被打电话警告不要乱讲话了。不过那个熟人一家脑子挺清醒的，看到新疆这种情况就说哪一天全国都会这样。"
		},
		{
			"post_id": 106,
			"title": "在西藏拉萨，摄像头藏匿于祷告轮里。",
			"date_published": 1533743431.861,
			"body": "![9.jpg (24x24)](data/img/post_106_9.jpg)"
		},
		{
			"post_id": 105,
			"title": "从公安厅得知的内部消息： ",
			"date_published": 1533485431.026,
			"body": "有145万新疆突厥族人在集中营。很多人都是不知道做了什么进监狱或者集中营的。\n\n乌鲁木齐地铁因为没有资金停工。资金都用在所谓的治安工作。\n\n不是乌鲁木齐本地的95%以上都回自己的家乡。"
		},
		{
			"post_id": 104,
			"title": "西藏知名歌手贡布丹增刑满获释",
			"date_published": 1533359254.09,
			"body": "以演唱“捍卫民族尊严、保护语言文化”之歌而闻名藏地的西藏那曲市比如县歌手贡布丹增于2013年被当局拘捕，在被关押1年5个月之后，被判处3年半徒刑，本周三刑满出狱。当局为防止藏民聚集欢迎他，特别派遣司法部有关人员将他送至家中。\n\n![7.jpg (24x24)](data/img/post_104_7.jpg)"
		},
		{
			"post_id": 103,
			"title": "新疆「再教育營」內幕曝光！ 前工作人員：就是監獄",
			"date_published": 1532234387.59,
			"body": "中國政府過去屢屢傳出在新疆建立「再教育營」，關押大量維吾爾族穆斯林人士，中共對此始終否認，但「再教育營」的內幕終於曝光了，因為1名曾在裡面工作的中國籍哈薩克族女性，對外透露這個地方美其名為「營區」，其實就是監獄。"
		},
		{
			"post_id": 102,
			"title": "西藏学生被禁参与佛事活动",
			"date_published": 1532078603.209,
			"body": "![9.jpg (24x24)](data/img/post_102_9.jpg)"
		},
		{
			"post_id": 101,
			"title": "中国政府前雇员被捕  新疆“再教育营”曝光",
			"date_published": 1531941579.321,
			"body": "![3.jpg (24x24)](data/img/post_101_3.jpg)\n\n![4.jpg (24x24)](data/img/post_101_4.jpg)\n\n一桩哈萨克斯坦的非法入境案件居然传出爆炸性消息：当事人揭露据传秘密关押了成千上万人的新疆“再教育营”。这个案件考验着中国与哈萨克斯坦的关系。\n\n41岁的中国籍哈萨克族女子Sayragul Sauytbay被哈方指控非法入境。她与哈萨克斯坦籍的丈夫和2个孩子一起入境。\n\n---\n\n法庭上，引起最大关注的不是案件本身，而是她被迫在新疆“再教育营”工作的证词。\n\n**雇员披露营内实况**\n\nSauytbay在法庭宣誓后，被问到她受雇于中国政府在“营区”工作的状况。她说里面关押了大约2500名哈萨克族人，让外界大吃一惊。\n\n“在中国，他们称之为‘营区’，但实际上就是山里的监狱。”在一次公开听证会上，Sauytbay表示，她被获准使用机密文件。这些文件可以解释庞大的再教育中心网络。据悉“再教育营”中，中国穆斯林少数民族占了大多数。\n\n《德国之声》6月专访中国西藏和新疆地区少数民族政策专家阿德里安·岑茨（Adrian Zenz）时，他保守估计有20万人被关押在其中。他说根据外国维吾尔团体所取得的新疆警察局文件，整个新疆地区大约有106万人被关到“再教育营”中。\n\n虽然有愈来愈多的证据，包括官方文件和脱逃者的证词，但中国官方始终否认新疆有“再教育营”。\n\n**“非法入境”案件**\n\n2016年底，中国当局采取了前所未有的措施，没收并统一保管穆斯林少数民族的护照，迫使任何想要出国的人须向政府申请。\n\nSauytbay的丈夫Wali Islam作证说，她的太太从一间国立幼儿园转到“再教育营”工作后，就和家里失去了联系。根据Sauytbay在法庭上的说法，她被中国当局欺骗从事“再教育营”工作。他们一家在今年4月在Sauytbay越过中国边境后重新团聚。哈萨克斯坦安全局在5月21日将她逮捕。\n\nSauytbay在法庭上说，中国当局向她表示，永远不会允许她进入哈萨克斯坦。可是她的家人是该国公民。为了和他们团聚，她铤而走险使用假文件入境。\n\nSauytbay是在新疆镇压后与边境亲属分开的许多哈萨克族人之一。当局把分裂主义和极端主义威胁当作镇压的理由。供出了再教育营的状况后，Sauytbay希望哈萨克斯坦不要把她送回中国。她说，“我在法庭上公开讨论这件事，代表我揭露了国家机密。”\n\nSauytbay的律师Abzal Kuspanov说，Sauytbay的证词足以说明如果她被遣返回中国会有什么遭遇。他说，“我们并没有说她使用假文件侵犯国家边界无罪。我们已经向法院承认，也准备接受惩罚。我们强调的是，不要遣返她回中国。如果把她送回去，这个人就会消失。”\n\n**哈萨克斯坦政府的难处**\n\n对于哈萨克斯坦来说，新疆哈萨克族的情况很尴尬。哈萨克斯坦是中国在中亚的主要经济伙伴。虽然哈国政府对于对抗北京方面犹豫不决，但愈来愈多的舆论压力要求政府站出来反对中国境内的镇压。\n\n中国将石油资源丰富的哈萨克斯坦列为万亿美元“一带一路”倡议的重要合作伙伴。希望加强欧亚之间的陆路贸易路线。\n\n到目前为止，北京当局一直对这些指控保持沉默。两位出席听证会的中国外交官拒绝回答民间团体和记者的提问。\n\n在公众压力下，哈萨克斯坦外交部呼吁中国对在新疆被关押的的哈萨克斯坦公民进行“客观公正的审查”。但哈萨克斯坦正在寻求中国大规模投资。在针对Sauytbay这样的中国公民案件上进行游说并不容易。\n\n哈萨克斯坦政治活动家Serikzhan Mambetalin表示，Sauytbay的审判是对“哈中关系是否成熟”的考验。但如果哈萨克斯坦将Sauytbay这样的侨民送回中国，“人们会说政府不能保护自己的人民。”\n\n**中国加强监控新疆  哈萨克族不幸免**\n\n新疆有大约150万哈萨克族人。北京针对新疆境内所谓的分裂分子加强镇压。\n\n过去外界以为哈萨克族人不像维吾尔族人遭受极端国家镇压。维吾尔族是中国另一个主要的穆斯林突厥人族群，是新疆的主要少数民族。\n\n与维吾尔人不同，哈萨克族人长期在中国和他们历史悠久的家园之间自由行动。自1991年中亚国家独立以来，其中约有20万人成为哈萨克斯坦公民。\n\n然而，2016年开始这种自由消失了。当时上任的中共新疆维吾尔自治区党委书记陈全国开始大规模拘留和穆斯林的再教育计划。他早前因为在西藏采取侵略性监视和人口控制措施而闻名。\n\n中国政府2017年1月1日开始实行新修订的《新疆维吾尔自治区边境管理条例》，更加强对西北边陲新疆的边境管制。8月，新疆一名高官以极其强硬的措辞表示，生活在新疆的穆斯林是世界上最幸福的穆斯林，人们不应相信极端主义分子及其西方支持者的谎言。\n\n2018年2月，“人权观察”组织发布报告指出，中国当局正在新疆自治区利用大数据分析技术来预测各类违法行为，许多当地民众被系统自动标注后即遭当地警方拘捕。\n\n来源：德国之声\n作者：夏立民，李芊"
		},
		{
			"post_id": 100,
			"title": "街道干部在剪维吾尔妇女类似长裙的任何衣物",
			"date_published": 1531584341.549,
			"body": "\"禁止穿长裙! \"街道干部在剪维吾尔妇女类似长裙的任何衣物。文革时禁止人们穿裙子，禁止穿尖头皮鞋，禁止烫头发，看到穿的，烫的就剪，已经疯狂过10年了，居然文革的无理智还在新疆持续，真的让人对这一届领导人的智商刮目相看了。\n\n![1.jpg (24x24)](data/img/post_100_1.jpg)\n\n![2.jpg (24x24)](data/img/post_100_2.jpg)\n\n![3.jpg (24x24)](data/img/post_100_3.jpg)"
		},
		{
			"post_id": 99,
			"title": "公安與武警在新疆喀什市的街頭巡邏",
			"date_published": 1531309276.743,
			"body": "![8.jpg (24x24)](data/img/post_99_8.jpg)"
		},
		{
			"post_id": 98,
			"title": "新疆的民族冲突不应该归咎于恐怖主义",
			"date_published": 1531276745.097,
			"body": "美国之音消息：美国智库“2049计划研究所”日前出台报告称，新疆的民族冲突不应该归咎于恐怖主义，并建议美国政府联合盟国向中国施压，要求中国释放被关进再教育营的维吾尔族人，并制裁违反人权的中共官员。报告写道，中共在新疆针对维吾尔人建立了大型政治“再教育”营，雇佣了大量的额外警力，并开展大规模监控项目。\n\n报告指出，2001年的911袭击后，中共利用国际社会对恐怖主义的关注，把新疆长期以来的民族矛盾重新定义为恐怖主义问题，从而对新疆进行更严苛的控制。报告认为，尽管东突厥斯坦伊斯兰运动（简称“东突”）是联合国认定的恐怖组织，但是——与中国官方所宣称的不同——和新疆有关的多数民族冲突并不是东突所为。\n\n报告认为中共夸大了东突的影响力，面对国际社会用“反恐”和反对“宗教极端主义”作为打压维族人的借口。报告提出了许多建议，包括呼吁美国公开批评中共的人权问题，联合盟国施压北京，要求其释放被非法关进再教育营的维族人，并对那些对歧视民族政策负有责任的中共官员施加制裁。"
		},
		{
			"post_id": 97,
			"title": "新疆街头",
			"date_published": 1530699830.773,
			"body": "![8.jpg (24x24)](data/img/post_97_8.jpg)"
		},
		{
			"post_id": 96,
			"title": "看到有土耳其海关的印章，所以把她们关起来。",
			"date_published": 1530250462.789,
			"body": "在乌鲁木齐大巴扎和二道桥卖土耳其服装、维吾尔族服装的好多维吾尔族人，女老板，她们都被关押在里面，已经一年多了。\n\n被关押的原因就是这些人在数年前到过土耳其旅游，当局在她们的护照上，看到有土耳其海关的印章，所以把她们关起来。他们在看守所内哭诉‘政府对我们这样做，太不合理了’。"
		},
		{
			"post_id": 95,
			"title": "伊斯兰教肉孜节百名维吾尔人被捕",
			"date_published": 1529509077.904,
			"body": " （新疆-2018年6月16日）6月16日，伊斯兰教肉孜节前夕，新疆喀什地区有近百名维吾尔族人被捕。当局指被捕者用手机微信转发带有星月标志的肉孜节祝福语。至本周五，多数人在签署保证书后释放，部分人仍遭扣押。另外，世界维吾尔代表大会主席多里坤.艾沙的母亲，于5月中旬在新疆阿克苏去世，当局则严密封锁消息。\n\n6月16日是伊斯兰教斋月结束后的肉孜节。据总部在德国的世界维吾尔代表大会披露，近期，中国新疆喀什等地有近一百名维吾尔人被捕。该组织发言人迪里夏本周五（15日）提对本新闻网说：“当地多个消息来源告诉世界维吾尔代表大会，在喀什地区，昨天（6月14日）至少有近百人被公安扣押，当局指控他们利用手机转发带有星星和月亮标志的宗教问候语。部分人当晚在派出所签署保证书，并缴纳罚金后获释。另有一部分人被指是星月问候语的作者，继续遭到扣押”。\n\n---\n\n世界维吾尔代表大会非常担心被捕者会被送到集中营或判刑。迪里夏提说，由于中国的端午节（6月18日）与肉孜节（16日）仅相隔两天，当局强行要求少数民族过汉族人的端午节：“在中国的严密的监控和压制下，维吾尔人在恐惧中过肉孜节。当地的清真寺必须无条件接受公安监控，还要配合政府宣传所谓党的恩情，感恩中央政府。今年，当局还要求维吾尔人过端午节，要求基层的文艺工作者隆重宣传端午节”。\n\n据新疆阿克苏一位不愿具名的餐厅服务员披露，政府在刻意淡化肉孜节，而高调庆祝端午节：“他们不希望少数民族聚集在一起过节，怕出事。现在一直很紧张，但很安全”。\n\n迪里夏提说，中国当局一直在利用各种方式，将中国文化渗透到伊斯兰教中，禁止使用伊斯兰宗教问候：“甚至严禁人们串门庆祝肉孜节。要求维吾尔人隆重庆祝端午节，从喀什、和田、库尔勒反馈的消息显示，中国政府要求维吾尔在家里吃粽子”。\n\n另外，世界维吾尔代表大会主席多里坤.艾沙（Dolqun Eysa）的母亲Ayxan Memet女士，5月17日在其家乡阿克苏柯坪县去世，享年78岁。迪里夏提称，当局严密封锁多里坤.艾沙的母亲去世的消息：“我们获得多里坤.艾沙的母亲去世消息，是在本周一（6月11日）。当局封锁消息近三个半星期。多里坤.艾沙流亡海外二十多年来，当局禁止其在新疆的家人与海外联系。我们是辗转得到这一不幸的消息”。\n\n迪里夏提称，多里坤.艾沙自1994年流亡海外以来，在过去的24年间，始终未能与其母亲Ayxan Memet见上一面。更无法给母亲送葬。而多里坤.艾沙的母亲想见儿子一面的唯一愿望，最终难以实现。迪里夏提谴责北京政府采取非人道的手段，迫害新疆维吾尔和其他民族。"
		},
		{
			"post_id": 94,
			"title": "新疆转化中心，还带手铐的哦",
			"date_published": 1529496016.862,
			"body": "![9.jpg (24x24)](data/img/post_94_9.jpg)"
		},
		{
			"post_id": 93,
			"title": "强制维吾尔人过端午节",
			"date_published": 1529467593.047,
			"body": "![3.jpg (24x24)](data/img/post_93_3.jpg)\n\n![4.jpg (24x24)](data/img/post_93_4.jpg)"
		},
		{
			"post_id": 92,
			"title": "新疆街头",
			"date_published": 1529411721.988,
			"body": "![8.jpg (24x24)](data/img/post_92_8.jpg)"
		},
		{
			"post_id": 91,
			"title": "新疆維穩拆毀清真寺",
			"date_published": 1529320299.604,
			"body": "![9.jpg (24x24)](data/img/post_91_9.jpg)\n\n哈薩克族一家族六人被捕。伊斯蘭教肉孜節百名維吾爾人被捕。"
		},
		{
			"post_id": 90,
			"title": "我的吐鲁番看起来就像个大监狱",
			"date_published": 1528883110.163,
			"body": "![8.jpg (24x24)](data/img/post_90_8.jpg)"
		},
		{
			"post_id": 89,
			"title": "新疆正在重燃〝文革〞邪火",
			"date_published": 1528786189.547,
			"body": "![8.jpg (24x24)](data/img/post_89_8.jpg)\n\n各地大量興建集中營（它們叫學習班），給每個地區下達抓人任務，並教當地社區和派出所陷害管區內的居民，報假材料給抓人單位抓人湊數。 所有小區全派人看門，盤查入內人員，將輔路全部堵死，圍牆上安裝鐵絲網，商戶被強..."
		},
		{
			"post_id": 88,
			"title": "新疆办理出入境证件要采集DNA",
			"date_published": 1528695021.5,
			"body": "![8.jpg (24x24)](data/img/post_88_8.jpg)"
		},
		{
			"post_id": 87,
			"title": "西藏过宗教节日 中国24小时巡查",
			"date_published": 1528423135.848,
			"body": "![9.jpg (24x24)](data/img/post_87_9.jpg)"
		},
		{
			"post_id": 86,
			"title": "手机被中国边警安装了软件",
			"date_published": 1528192537.222,
			"body": "一位用户在 Reddit 上发帖称， 他和妻子搭乘航班从吉尔吉斯斯坦的奥什飞抵新疆的喀什市，在入境处两人的 Android 手机（Moto x4 和华为 Mate 9）被中国边警安装了软件，安装之后手机主屏上出现了应用的图标，警察启动了该应用程序，然后图标就隐藏了。警察还在他坚持在场的情况下检查了他的笔记本电脑和相机。警察使用的机器有一个英文标签叫 Phone Hunter ID，机器大小与便捷式信用卡机相近。他们发现手机被开启了蓝牙。作者表示下一次他会带一部备用机和副账号旅行，他对这一情况感到不安。目前还不清楚边警在手机上安装了什么软件，安全研究人员都对这部手机非常感兴趣，都想要研究下中国警方使用的恶意程序。"
		},
		{
			"post_id": 85,
			"title": "新疆的大街小巷",
			"date_published": 1527999164.158,
			"body": "![1.jpg (24x24)](data/img/post_85_1.jpg)\n\n![2.jpg (24x24)](data/img/post_85_2.jpg)\n\n![3.jpg (24x24)](data/img/post_85_3.jpg)"
		},
		{
			"post_id": 84,
			"title": "新疆喀什",
			"date_published": 1527653736.207,
			"body": "![7.jpg (24x24)](data/img/post_84_7.jpg)"
		},
		{
			"post_id": 83,
			"title": "維吾爾姑娘為救家人被逼嫁汉人",
			"date_published": 1527402179.404,
			"body": "![9.jpg (24x24)](data/img/post_83_9.jpg)"
		},
		{
			"post_id": 82,
			"title": "藏人倡學母語 分裂國家罪判5年",
			"date_published": 1527128745.748,
			"body": "![9.jpg (24x24)](data/img/post_82_9.jpg)"
		},
		{
			"post_id": 81,
			"title": "新疆的清真寺",
			"date_published": 1527044423.319,
			"body": "![2.jpg (24x24)](data/img/post_81_2.jpg)"
		},
		{
			"post_id": 80,
			"title": "哈萨克人丈夫被抓妻子独居 新疆官员安排汉族恶心男入住",
			"date_published": 1526948995.741,
			"body": "![9.jpg (24x24)](data/img/post_80_9.jpg)\n\n2018 年 5 月 15 日 支那賤種的\"新疆政府\"为了控制维吾尔族及哈萨克族，安排汉族人入住民族家庭。\n\n新疆阿勒泰地区的哈萨克妇女称，她在新疆家乡的侄子是一位穆斯林，他被送入改造营后，当局安排一名汉族男子进驻他家，并与侄媳妇同住。\n\n另一位哈萨克人称，他在新疆伊犁的妻子怀孕三个月时，被地方官员强制堕胎。"
		},
		{
			"post_id": 79,
			"title": "西藏索县男子因持有达赖喇嘛照片而遭中共拘捕",
			"date_published": 1526815188.948,
			"body": "【西藏之声2018年5月19日报道】中共警方本月突闯西藏那曲索县赤多乡藏人岗吉家中，搜出达赖喇嘛尊者的书籍与光盘。岗吉随即被警方带走，家属未被告知他所关押的地点与当下状况。\n\n---\n\n英国援藏团体“自由西藏”发布消息指出，5月8日，中共警方人员闯入西藏索县赤多乡藏人岗吉（Gangye）的家中，经过搜查发现有关达赖喇嘛尊者的书籍，以及一张尊者传授时轮金刚灌顶的光盘。\n\n年约50岁左右的岗吉随即被警察押走，搜出的物品也被没收。\n\n自由西藏引述境内消息指出，岗吉的家人对突然发生的搜查与拘捕感到震惊，并怀疑当局一直在严密监视岗吉。在那之前，岗吉与两个儿子确扎、丹增，曾先后多次被叫去警局审问，但每次都会在短暂扣押后获释。这次他却没能回家，也无人了解他的的确切状况。\n\n限制寺院与民众持有、供奉达赖喇嘛尊者的法相，是中共一直在实施的政策。但这一政策在不同藏地的执行方面存在稍许差异。当局不时对各地寺院进行巡视，检查寺方是否按照当局的要求而撤下所供奉的达赖喇嘛法相。"
		},
		{
			"post_id": 78,
			"title": "中共强迫穆斯林吃猪肉",
			"date_published": 1526786194.607,
			"body": "![2.jpg (0x0)](data/img/post_78_2.jpg)​​​​​​​"
		},
		{
			"post_id": 77,
			"title": "中共官员强制住到新疆人家里",
			"date_published": 1526733070.608,
			"body": "![9.jpg (0x0)](data/img/post_77_9.jpg)\n\n![8.jpg (0x0)](data/img/post_77_8.jpg)​​​​​​​"
		},
		{
			"post_id": 76,
			"title": "中共官员强制住到新疆人家里",
			"date_published": 1526719263.873,
			"body": "![8.jpg (0x0)](data/img/post_76_8.jpg)\n\n![9.jpg (0x0)](data/img/post_76_9.jpg)​​​​​​​"
		},
		{
			"post_id": 75,
			"title": "中共官员强制住到新疆人家里",
			"date_published": 1526704486.777,
			"body": "![8.jpg (0x0)](data/img/post_75_8.jpg)\n\n![9.jpg (0x0)](data/img/post_75_9.jpg)​​​​​​​"
		},
		{
			"post_id": 74,
			"title": "中国：走访干部强制入住穆斯林家庭 ‘结对认亲’运动加深新疆高压统治",
			"date_published": 1526311134.822,
			"body": "人权观察, 2018年5月14日\n\n（纽约）－人权观察组织今天表示，中国官员自2018年初开始，在穆斯林为主的新疆地区，强制实施定期“住户”工作。新疆是1,100万维吾尔族和其他突厥语系穆斯林少数民族的家园，前述走访工作实为政府加强“严打”运动的一环。\n\n接待干部走访时，受访家庭必须让干部了解家属生活状况和政治观点，并接受政治思想灌输。人权观察组织表示，中国政府应立即终止这种走访工作，因其侵犯隐私权和家庭生活，且违反国际人权法保障的少数民族文化权利。\n\n---\n\n“新疆各地穆斯林居民现在连家中生活起居都被国家一览无遗，” 人权观察组织中国部高级研究员王松莲（Maya Wang）说。“这项运动是对新疆居民日常生活进行普遍且不合理监控的最新举措。”\n\n2014年起，新疆当局派遣政府、国企和各种公务机构共约20万干部，对居民实施定期走访和监控。当局表示，这一名为“访惠聚”（访民情、惠民生、聚民心）的工作是以“维护社会稳定”为目标。\n\n2016年10月，当局又进一步发动“结对认亲”运动。约有11万官员负责对南疆突厥语系穆斯林居民进行每两个月一次的走访活动，目的是“促进民族和谐”。此一“结亲”运动的规模在近几个月急剧扩大。2017年12月，新疆当局动员百万干部参与“结亲周”活动，到农村为主的基层社区与结亲户同吃同住一周。干部通常入住穆斯林居民家中，也有少数干部入住汉人家庭。\n\n2018年初，新疆当局再次扩大“住户”工作，要求干部至少每两个月要到结亲户家中同住五天。没有证据说明居民能否拒绝这种走访活动。\n\n干部住户期间要执行多种任务。他们要收集、更新居民家庭成员的基本情况，例如户籍属本地或外地、思想状况、宗教信仰等等。住户干部要注意并提报所有“困难”或“问题”──从不卫生和酗酒到宗教信仰，几乎无所不包──并且加以“整改”。干部也负责政治思想灌输，包括阐释“习近平思想”，说明中国共产党对新疆“亲切关怀”和“无私援助”的政策。他们还要劝告民众警惕危险的“泛伊斯兰主义”、“泛突厥主义”和“泛哈萨克主义”──政府眼中具威胁性的思想或身分认同。当局要求干部在日常生活中以“谈心”形式达成前述任务。\n\n干部必须对结亲户灌输与汉人“民族团结一家亲”的观念。他们教结亲户说汉语，强迫他们唱中国国歌和其他赞颂中共的歌曲，确保结亲户参加每周升旗仪式。干部和结亲户还要一起参加各种联谊，例如汉族春节、团体游戏、跳舞和体育活动。干部也必须以各种方式帮助结亲户，从整地播种到协助申请政府福利和津贴，不管居民有没有提出要求。\n\n据地方新闻和社交媒体信息，部分地区具体实施情形如下：\n\n    3月起，阿克苏地区温宿县全体干部必须到农村入户同住，“每人每月住户不少于8天”。据官方文章描述，干部们在结束办公室一天工作之后，要“带著被褥”到农户家中“过夜”。\n    伊犁哈萨克自治州4月1日发出的一份官方文件显示，所有干部必须每2个月住户5天。\n    巴音郭楞蒙古自治州规定，干部每月必须住户至少14天。\n\n干部必须详细记录活动详情，包括填写登记表格并附照片。有些干部将照片和视频发上微信和微博账户，呈现干部和少数民族同吃同住的情景，包括某些私密的家庭生活细节，例如干部和家户成员铺床同睡、分食共餐、哺育教养孩童的情形。网上的照片和视频都不是由结亲户上传，也看不出上传前曾征求他们同意。\n\n“中国对穆斯林实施极具侵略性的强制同化政策，不仅侵犯他们的基本人权，还可能造成该区不满情绪加深加重，” 王松莲说。“新疆当局应该立刻终止‘严打’运动和所有相关侵权措施。”\n\n进一步了解有关中国对新疆的压迫，请见下文。\n\n中国对新疆压迫的背景\n\n新疆位于中国西北，是1,100万维吾尔人和其他穆斯林为主少数民族的家园。中国政府长期普遍限制新疆维吾尔族的基本人权，包括宗教自由。相关监控措施常常具有侵犯性和切身性，比如，连他们为新生儿命名也受到管制。\n\n对中央和地方政府政策的不满，有时表现为和平抗议，有时则导致炸弹攻击或其他暴力反抗。当局企图合理化对该区的压迫措施，称其为配合国家打击恐怖主义的必要手段。然而，新疆当局向来将暴力和非暴力的政治活动混为一谈，并将维吾尔身份认同的表现形式，包括语言、文化、宗教和疆独意识，一概归类为“分裂主义、恐怖主义和极端主义”等“三股势力”。\n\n中国政府自2014年5月起发动“严厉打击暴力恐怖活动专项行动”。2016年，陈全国就任新疆党委书记后，打压行动显然变本加厉。\n\n过去一年，新疆当局扩大实施强制同化政策，同时著手切断穆斯林居民和海外的一切可能联系，作法包括：回收护照，限制出国旅行；强迫居留海外人员返国；监禁与海外保持联系人士；加强汉语教学，同时降低少数民族语言重要性；打压忠诚度存疑的少数民族干部；以及将数万人无限期羁押于非法的“思想教育”中心。新疆当局还加强监控措施，包括逐步收集12岁至65岁民众的DNA和声纹样本，例行性检查智能手机是否存有“颠覆”内容，增设大量铁公路检查哨，增聘数千名安全人员，以及以“便民”为名广设警察派出所。"
		},
		{
			"post_id": 73,
			"title": "在新疆維吾爾人更改上下班路線可能引來警察上門調查",
			"date_published": 1526282771.19,
			"body": "中共利用社會信用系統監視約1,100萬名維吾爾族人，包括他們前往清真寺的次數、用電量、購買食品的情況等。如果突然出現變化，例如改變上下班路線，警察就可能會上門。\n\n中國監控科技產業蓬勃發展，更開始向「一帶一路」國家輸出有關科技，包括白俄羅斯等。\n\n國際非政府組織「人權觀察」中國部資深研究員王松蓮表示，沒有一個中國的網絡應用程式安全。在中國工作或求學，或是曾經辦理台胞證的台灣人，可能已被建立檔案。"
		},
		{
			"post_id": 72,
			"title": "新疆塔城一“改造营”被羁押者集体绝食",
			"date_published": 1526170360.385,
			"body": "（新疆-2018年5月9日）新疆维吾尔自治州塔城地区额敏县一“改造营”上周发生集体绝食抗议事件。当地一知情者披露，被羁押在所谓改造中心的哈萨克族人与维吾尔族人，不满当局提供的食物存在严重问题，集体绝食抗议。截至本周三，绝食行动仍在继续。早前传说监狱当局用劣质白酒和猪头肉，消磨穆斯林的意志的消息。这是新疆首次传出被羁押者绝食抗议。\n\n---\n\n新疆额敏县一政治改造中心，上周发生集体绝食。当地一位亲友被羁押在“改造营”的哈萨克族人披露，政府建立的政治改造中心，出现萨克族与维吾尔人集体绝食事件。他说：“额敏县各种大大小小的改造中心关了6000个哈萨克族人，其中一个中心内的人集体绝食抗议监狱内的伙食太差。绝食的有哈萨克族，也有维吾尔人。现在政府封锁消息，也不让外人进入额敏县”。\n\n本新闻网3月24日曾报道，伊宁一名87岁哈萨克族老人在临终前披露，他被羁押在官方“去极端化培训中心”期间，被关在一屋内，整日被高音喇叭放出的声音困扰，不少人因此口吐白沫，当场昏厥，有人精神失常。当局强迫穆斯林喝劣质白酒，吃猪头及内脏，以消磨他们的意志。另一位哈萨克族人称，羁押者被戴上特制的头盔，每天21小时发出噪音，仅关闭3小时，许多人精神错乱。\n\n记者周三致电额敏县政府办公室，但始终无人接听。一个月前，新源县与额敏县已被公安全面封闭，不准境外人士进入。从哈萨克斯坦到新疆探亲的哈萨克族人进入上述地区，须提前一周向当局申请通行证。\n\n另外，现居住在哈萨克斯坦的哈萨克人萨那雅.阿曼（Amen.Saniya）发出求助称，她有五个孩子，去年9月20日，其丈夫返回中国新疆后被捕：“我和孩子们的父亲于2017 年09月20日去中国，中国护照与哈萨克斯坦绿卡被警察收回。我丈夫至今没有回来，我在哈萨克斯坦也没有办法联系到他。现在我一人要带5个孩子，最小的孩子才满一岁半，患有心脏穿孔治病。我和孩子们没有生活费，生活极度困难，我们需生活支柱。”\n\n萨那雅.阿曼说，她丈夫被抓至今已八个月，不知中国政府要把普通人改造成什么样：“我们向哈萨克斯坦国政府外事相关部门的领导投诉，要求政府与中国交涉，也向世界人权组织求助，让我们全家尽快团聚。”\n\n据哈萨克斯坦民间组织成员称，不仅仅普通哈萨克族人的亲人在中国被抓，就连当地亲中国政府组织领导人的亲人，也同样被抓：“在哈萨克斯坦注册的“Otandas El”华人华侨组织领导人穆汗.玛穆踢汗之妻子，被伊犁州伊宁市公安局扣留护照及哈萨克斯坦绿卡，她现在无法与哈萨克斯坦家人团聚”。\n\n该民间组织成员表示，穆汗.玛穆提汗曾经是伊犁州土地管理局退休领导干部，他妻子是该州政协的退休干部。他们夫妻俩退休后携一儿子和一女儿，在20年前旅居哈萨克斯坦。穆汗在哈萨克斯坦注册“Otandas El”华人华侨组织，与中国驻哈大使馆，领事馆人员走得很近。虽然他经常积极参加中国使馆举办的各类活动，以体现海外非汉族华人华侨组织的爱国之心，但是新疆当局还是扣留他妻子的护照及绿卡，已六个多月。\n\n据称，穆汗属哈萨克斯坦知名人士，经常代表海外华人组织参加中国全国政协及中国侨办组织的各类会议。"
		},
		{
			"post_id": 71,
			"title": "新疆再教育营关人近百万",
			"date_published": 1525760711.79,
			"body": "![8.jpg (0x0)](data/img/post_71_8.jpg)​​​​​​​"
		},
		{
			"post_id": 70,
			"title": "New blog post",
			"date_published": 1525268092.142,
			"body": "![8.jpg (0x0)](data/img/post_70_8.jpg)​​​​​​​"
		},
		{
			"post_id": 69,
			"title": "工作組深入新疆鄉鎮調研100多位當地村民被關進了“黑監獄”",
			"date_published": 1524795279.251,
			"body": "![8.jpg (0x0)](data/img/post_69_8.jpg)\n\n中國政府近期派遣了眾多的工作組深入新疆鄉鎮調研，表面上是為了“贏得民心”。但有消息稱，當地的很多維吾爾人在此期間被強迫失蹤後關入了“黑監獄”。\n\n位於新疆維吾爾自治區的阿克切坎勒村在2017年初迎來了一批城裡人，他們是從烏魯木齊市遠道而來的新疆兵團廣播電視大學教職工。這批到訪者不打算在當地教書，而村民也並不知曉他們到來的真正意圖。僅四個月以後，100多位當地村民卻發現他們被關進了看守所和“黑監獄”。"
		},
		{
			"post_id": 68,
			"title": "阿勒泰的李娟：记八年前的一件事",
			"date_published": 1524747146.583,
			"body": "那一年断网了，断了整整一年。要想上网，只能坐火车去甘肃。甘肃是离我们最近的一个省。距阿勒泰约一千五百公里。\n\n习惯了网络的喧嚣，所有人突然无可适从，甚至无所事事，生活前所未有地安静。\n\n就是那一年的夏天，我要给出版社寄稿件。又实在不愿意把三十多万字的电子稿再手抄一遍。于是就把它们拷在U盘里，想把这个U盘寄给出版社。\n\n但是那两年物流还没像现在这样发达，县城里只有邮局能往外寄东西。\n\n当时，邮局也进入管制状态，不管是纸质出版物还是光盘、U盘、甚至手机和相机（有存储卡）都不能往外寄。邮局的工作人员对我说，要邮寄这些东西，得先去县委的文化稽查大队备案。拿到证明了才能来邮局寄。\n\n---\n\n我问清文化稽查大队归县委宣传部管，于是跑到县委宣传部。却被告知，本县的文化稽查大队沿未成立。。。。。\n\n但手头的稿件又耽误不得。于是娟姨狗胆包天，决定瞒天过海。\n\n她把那U盘藏在一件衣服口袋里，把衣服裹在其它几件衣物之间，然后跑去邮局寄。\n\n可娟姨失算了，没想到柜员检查得非常严格，每件衣服都抽出来抖又了抖，里里外外摸了一遍。。。。搜出罪证后，把娟姨口头教育了一遍。娟姨灰溜溜撤了。\n\n娟姨不甘心，于是又想了个办法。这回，娟姨换把文字拷到一枚体积更小的SD卡上。把它埋在一公斤葡萄干里。再把这袋葡萄干和其它两袋巴达木、杏干装在一只箱子里。继续寄。\n\n这回仍然非常严格。只见柜员拆开葡萄干袋子，把手伸去摸啊摸啊。。。。。\n\n娟姨站在旁边，眼睁睁看着那张SD卡被他的手捅到透明塑料袋的边缘。。。。。\n\n从娟姨站的角度看去，一眼就可以看到。。。。。。\n\n吓懵了。。。。。\n\n由于上次已经被警告过了，这次再被逮着，就是惯犯了。就是明知故犯顶风作案。。。。顶着这个大帽子，想再寄第三次就更难了。\n\n难道真的要手抄三十多万字？\n\n不对，就算手抄了，这么厚的纸质材料，也属违禁品，没法寄的。\n\n难道要跑一趟甘肃？一千五百公里啊。。。。。\n\n那几十秒钟的心惊胆颤，娟姨永远无法忘记。。。。\n\n好吧，结果有惊无险。\n\n那位认真负责的同志认真负责地摸了半天，可惜从头到尾也没想过把袋子掉个头多看一眼。\n\n然后他封好袋子，去摸另外两袋干果。。。。\n\n一直等他把三袋干果都检查完了，重新封好包裹箱，娟姨这才活了过来。\n\n接下来，《阿勒泰的角落》和《我的阿勒泰》这两本书得以顺利出版。"
		},
		{
			"post_id": 67,
			"title": "维族妇女被捕 巴基斯坦丈夫愤怒要人",
			"date_published": 1524561479.415,
			"body": "有消息称，巴基斯坦北部吉尔吉特-巴尔蒂斯坦地区一些当地人娶的维吾尔妻子在中国被捕。她们被怀疑与极端分子有联系。这些巴基斯坦人非常愤怒。\n\n巴基斯坦北部吉尔吉特-巴尔蒂斯坦（Gilgit Baltistan）地区的人们因为他们在中国出生的维吾尔妻子被捕的事情而十分愤怒。这些女性据称过去数月在中国境内被捕，理由是她们被指控与极端分子有联系。\n\n---\n\n新疆与吉尔吉特-巴尔蒂斯坦地理位置接近，两地居民有长期的历史、文化和家族纽带。许多维吾尔人与吉尔吉特-巴尔蒂斯坦人通婚。\n\n吉尔吉特-巴尔蒂斯坦地方政府发言人费拉克（Faiz Ullah Firaq）表示，巴基斯坦有关部门正在同中国外交部就此事进行联络。\n\n费拉克向德国之声表示：“我们知道当地人对此非常忧虑。地方议会也通过一项决议表示抗议。”\n\n吉尔吉特-巴尔蒂斯坦议会成员纳吉（Nawaz Naji）称，这是一件“非常严重”的事。\n\n“不单是吉尔吉特-巴尔蒂斯坦人，还有很多巴基斯坦的普什图人和旁遮普人也有中国妻子。中国需要考虑到此事的文化敏感性。我们是一个穆斯林社会，我们的妻子被别人关押，这是不可接受的。我们并不想让事情激化，因为我们希望保持北京与伊斯兰堡间的良好关系，”纳吉向德国之声说道。\n\n据了解，至少39名吉尔吉特-巴尔蒂斯坦人的维吾尔妻子在中国被捕。但多数人不愿与媒体交谈，因担心妻子及其在新疆家人的安全。\n\n一名吉尔吉特城39岁的商人向德国之声匿名表示：“我的妻子受到监控。她去年两次受到调查。”\n\n“我已经两年没见到妻子和孩子了。我们家人心理上都到严重影响。”这名商人说，他妻子的兄弟姐妹及其子女受到中国有关部门的怀疑，认为他们与极端伊斯兰分子有联系。\n\n米尔•阿曼（Mir Aman）来自吉尔吉特城，目前在新疆喀什居住。他向德国之声表示，六个月前，他60岁的维吾尔妻子在新疆被捕。“我不被允许跟她见面或打电话。他们没有告诉我，我的妻子犯了什么罪。我18岁的儿子在我妻子被捕前1个月也被带走了。”\n\n沙夫卡特•阿里（Shafqat Ali）也是吉尔吉特-巴尔蒂斯坦的商人。他呼吁中国政府释放他的妻子。“我的孩子们很痛苦，因为他们的妈妈被捕。”\n\n吉尔吉特-巴尔蒂斯坦议会的前成员阿尤布•沙（Ayub Shah）的妻子也是维吾尔人。他表示，当地人不敢公开谈这件事，寄望于巴基斯坦政府与中国外交部交涉。\n\n但也有一些当地人向德国之声表示，他们濒临绝望，如果巴基斯坦和中国有关部门不能迅速解决这件事，他们打算发起一场营救家人的抗议运动。\n\n来源：德国之声\n作者：Sattar Khan"
		},
		{
			"post_id": 66,
			"title": "新疆额敏县已被封闭 哈萨克族称：人间地狱 ",
			"date_published": 1524550768.837,
			"body": "![8.jpg (0x0)](data/img/post_66_8.jpg)\n\n当局派遣汉族入住哈萨克族家庭，强烈希望汉族与哈族通婚\n（图：对华援助协会,2018年4月20日）\n\n（新疆-2018年4月20日）新疆维吾尔自治区塔城地区额敏县一哈萨克族人披露，全县已有六千多名哈萨克族人被公安送入“政治教育中心”或看守所。哈萨克人称，目前，额敏县已经关闭，该县停止对外国人开放。进入该县的道路已被武警封锁。\n\n---\n\n新疆塔城地区额敏县一哈萨克族人阿依肯本周五（4月20日）对记者披露，当地超过六千名哈萨克族人，被当局羁押在所谓政治教育中心或监狱。全县哈萨克族人有七万多，平均每11至12个人中，就有一位哈萨克族人失去自由。不少家庭全家人被抓。他说：“全家人被捕入狱的也很多。警察违反法律，抓人不给亲属居留通知书。我们这里已有很多被抓的人，他们的亲属都没有居留通知书，被判刑的家属也没有拿到判决书。据我们所知，全县六千多人被抓，这个数字经过多方面核实，实际人数可能还多”。\n\n阿依肯说，他的父母亲及亲戚友等七、八个人，去年9月被关入“政治学习中心”，至今没放出来。他还说，被抓的人中，年龄最小的有十多岁，年迈的八十岁左右：“年龄最大的有七、八十岁，而且亲属不能够去询问，或者跟警察讲法律，如果去理论，一律被抓，随随便便就给你扣一个罪名判刑”。\n\n官方资料显示，额敏县有约18万人，由22个民族组成，主要民族有汉族、维吾尔族、蒙古族、哈萨克族、回族等。\n\n目前，额敏县已被中国军警包围，外国人或哈萨克斯坦的哈族人无法进入。哈萨克族人叶尔兰对记者说，一些家庭的父母被抓，仅留下孩子，当局叫人把孩子送到孤儿院：“父母抓走后，把孩子送到孤儿院。这在当地都是常态。公安为了掩盖罪行，额敏县已不对外开放，也就是外国人来额敏探亲一律不准进入，只能够去塔城市规定宾馆居住。额敏县把门关起来，残酷的折磨哈萨克人，封闭了所有信息，外界没有人知道他们做了什么”。\n\n哈萨克族人塞力克，刚从额敏县抵达哈萨克斯坦。他说，新疆局势非常严峻。公安到处打探谁到过哈萨克斯坦：“凡是去过哈萨克斯坦的人，哪怕是去旅游过一次的，一律抓捕。正常的穆斯林彼此打招呼，都是禁忌。相互打招呼只能问候‘你好’，其他的话不敢说。当地公安明确规定，绝对不准用哈萨克传统的方式安葬死者，除了直系亲属其他人一律不能够哭葬，坟墓安装了摄像头，如果有人去按照传统方式诵经那都是被抓捕的”。\n\n塞力克说，他曾目睹当地很多哈萨克族家庭被查抄，传统绣花和民族特色的家庭用品被政府没收。他说，镇政府还安排汉族人到哈萨克族家里“同吃同住同喝”，如果有哈族人反对政府官员的行为，就被判刑：“如果有人询问是不是有猪肉，也会被拘捕，并且会被判重刑。政府还强烈鼓励哈萨克族和汉族人结婚，如有亲属提出反对，就被判以重刑”。\n\n哈萨克族人阿依肯表示，当地公安已明确告诉他们不得从事宗教活动，手机内部的存储穆斯林经文或图片，一经发现，立即以恐怖分子论处，判刑。他认为，目前新疆犹如人间炼狱，到处充满着血腥。被抓的除了哈萨克族人，还有维吾尔族人，许许多多的家属不知道他们的亲人被关在何处，生死不明。他说：“被拘捕的人他们到底被用了什么样的酷刑，还有刑讯逼供等手段，目前都是一个谜。实际情况比目前我所陈述的状态更加严重，更加可怕，更加糟糕。希望哈萨克斯坦政府，联合国人权理事会介入调查，并且赶紧解救无辜的人”。\n\n对华援助协会特约记者乔农报道"
		},
		{
			"post_id": 65,
			"title": "这里是新疆",
			"date_published": 1524407265.719,
			"body": "几个月前，朋友介绍了一个新疆A城的案子，罪名是煽动颠覆国家政权。我心里有点奇怪，如此遥远之地，为何会来找上海的律师。经电话和当事人B的亲属沟通，亲属说，之前找了两个当地的律师，当地律师听说是危害国家安全的案子都婉拒了。我问为啥当地律师不愿接这样的案子，亲属说可能是不想惹麻烦吧。我考虑了一下，问当事人亲属能否在当地再找一个律师，平时可以去看守所会见当事人，这样当事人亲属也可以节省费用。亲属同意了。\n\n![8.jpg (0x0)](data/img/post_65_8.jpg)\n\n过了几天，亲属说在当地找到一个愿意接受委托的C律师，并把C律师的电话给了我，我马上和C律师通了电话，C律师问我打算做有罪还是无罪辩护？我说案子材料我还没看确定不了。C律师说洪律师你可能不知道，我们这里不允许对这类案件进行无罪辩护。我有点吃惊，问为什么？这样的规定不是违法吗？C律师笑笑，说这里是新疆。\n\n---\n\n我想了想，没有再和C律师争论是否违法的问题，说等看了材料再说吧。\n\n过了一段时间，公安侦查终结，终于允许律师会见，我决定过去先会见一下当事人，听听当事人的意见看了材料再决定辩护方向。\n\n电话接通了A城检察官，我说我打算过几天过去，方便的话我想先约个时间阅卷。检察官说你过来再说吧，材料应该大部分都能看到。听到检察官这么说我马上警觉起来，我说检察官同志，按照规定不是进入起诉阶段律师就可以阅看所有材料吗？检察官笑笑，说你过来再说吧。哦对了洪律师，我们这里对这类案件是不允许做无罪辩护的。我心里一下子无名火起，我说这样的规定不是违法的吗？检察官笑笑，说这里是新疆，我想我不说你也知道为什么。\n\n经过五个多小时的飞行，到乌鲁木齐下了飞机，打开手机，发现手机信号由4G变成了2G，这对于依赖手机收发邮件和刷朋友圈的我来说实在有点不知所措。过了三小时，转机的飞机在A城降落，来接我的C律师开了车边走边聊。我问这里对危害国家安全犯罪的案子不允许做无罪辩护有明文规定吗？C律师想了想说有的，好像是好几个部门联发的。\n\n车进市区，看到每隔大概五百米就有一座装备着防冲击护栏的警察岗亭，很多单位大门前也装备有直径十五公分左右的防撞钢管，街上不少商户和居民戴着安全员红袖套。我问C律师这里治安好吗？C律师说好得很，就是现在我们都找不到人洗车了。我问为啥？C律师说洗车工都去做保安了，保安工资更高。然后哈哈地笑起来。\n\n我看看时间不到六点，赶紧联系了检察官，电话打过去居然就联系上了，这和我在上海电话找法官检察官完全是天差地别。检察官听说我想阅卷，说你过来吧。\n\n到了检察院，发现偌大的办公楼里空荡荡的，一层楼里大概只有七八个人。到检察官办公室递交了委托书和律所函，检察官很客气，说洪律师从上海赶过来一定很辛苦吧？然后简要告知了一下案件的预计进展，并要求我提供辩护意见。我说我人没看到材料没看到怎么给你意见？你要给我看材料啊。检察官笑笑也没再要求。我说对这类案件不允许做无罪辩护的要求有书面文件规定吗？能给我看看不？检察官说当然有，然后从柜子里找出了一个文件夹，翻开了一页拿在手里给我看。我看了一下，似乎是几家联发的会议纪要或者备忘录，上面的确写有对这类案件不允许律师做无罪辩护的字样，我不由有点发愣。趁我发愣的功夫，检察官把文件收回到文件柜子里。检察官说洪律师你也知道我们新疆这里和你们上海那边情况不一样，我们司法部门有维稳戍边的重任。我想了想，说先给我看材料吧，我没看到全部材料前无法决定如何辩护。检察官犹豫了一下，问洪律师您是党员吗？我听了这样的发问，不由有点冒冷汗，点点头说是。检察官说既然您是党员，我也相信您，这样吧，材料我们可以给您拷盘，也希望您对该保密的内容要保密。我说我要看全部，检察官说好。\n\n下去一楼等拷盘的功夫，发现旁边办公室的两个年轻人拿着一叠材料念念有词，我说你们在准备司法考试吗？其中一个年轻人白了我一眼，说我们在背政治学习材料，要考核的。\n\n拿到了光盘，第二天早上去看守所会见当事人B。会见过程非常顺利，狱警很客气，对律师没有丝毫戒备之心，我甚至看到有当地律师在过道里大声地打电话，这在上海估计马上就被上报司法局了。B年纪不大，中专文化，靠养鸡为业，被抓进来前还欠了银行的十几万贷款，因为平时生活不如意就开始上网聊天找存在感，并参与和管理了不少QQ群，在群里发了不少言词过于偏激的帖子。我问B对于自己事情的想法，B说他自己也没想到事情会闹这么大，也许认罪会能得到更好的结局可以早点出去。B的老婆没工作，家里有两个孩子，大的八岁，小的才十个月。我说我知道你的意见了，等我看了材料再说吧。\n\n从看守所出来，看看离下午的航班时间还早，用2G信号下的手机吃力地搜索了一下周边的景点，发现三十公里外有一个将军府，就站在路边打车。好不容易等到一辆出租车停下来，车上坐着两个人，副驾驶座的人问我去哪里，我说去将军府，副驾驶就用民族话和司机咕噜咕噜地说，司机点了点头，副驾驶说上来吧。我上了车坐到后排，车开起来，前排的两个人用民族话咕噜咕噜地说，还不时回头看我一眼。我一句话都听不懂，不由有点后悔，心想他们真把我拉去埋了我都不知道自己死在哪里。过了两分钟，副驾驶的人下车了，我的心才稍安。\n\n到了将军府，下来转了一圈，发现这个旅游景点冷冷清清，偌大的景区只有两三个游客。根据我了解的历史知识，A城在十九世纪时一直是新疆的省府，那时A城西边还不是边境线，而是清帝国广袤的国土。阿古柏叛乱，老毛子趁机占据A城，左宗棠西征，A城重回清帝国版图，但西边的国土也丧失大半，省府也被迫东移到迪化（即今天的乌鲁木齐）。清朝结束，新疆岌岌可危，几乎与西藏一样脱离中央的控制，好在一战爆发，老毛子无暇东顾，并有赖杨增新励精图治，新疆才算度过分裂危机。及至盛世才统治新疆，与苏联走的很近，有传言当时盛曾有加入苏联的企图，后因爆发二战，盛眼看苏联不保，才转而投靠中央。新中国建立，王震进疆，以生产建设兵团模式定点戍边，新疆才算完全重归中央大一统。可见帝国兴盛，新疆亦稳定兴盛，帝国羸弱，新疆则易陷入分裂和动乱危机。\n\n回上海的飞机上，我想如果我把材料看完觉得当事人的行为真不具备煽动性，而法庭又不允许做无罪辩护，我是该退出代理，还是向最高法院和最高检察院反映这种违法行为？最高法和最高检难道不了解当地的做法？如果去死磕，对我的当事人会有什么不利后果？我自己会不会被人家惦记？想来想去决定还是以当事人利益最大化为原则，做有罪还是无罪辩护且看了材料再说。\n\n到了上海，我和同事花了将近一周时间把材料消化了一遍，把起诉书指控的B在十几个QQ群和微信发布的约1200条帖子条条细细看完，感觉要把所有帖子的内容都辩解为没有“煽动”行为实在艰难，里面雷区不少，有的帖子骂的非常露骨。考虑良久，决定从罪轻入手，将这个思路和C律师沟通了，又再和当事人确定了一次，开始寻找相关判例，准备罪轻的思路。\n\n开庭前，C律师突然给我电话，说检察官准备以五年以上有期徒刑求刑。我吃了一惊，说一个养鸡的，因为生活不太如意，在QQ群里发了一些自己都搞不清楚真正意义的帖子，就要判五年以上？C律师苦笑，说没法啊，要抓典型。\n\n再次到了A城，C律师约了几个同事一起午饭，我看一个律师开饭前还趴在桌上写东西，我说真忙啊，吃饭还准备案子。律师说我在抄十九大报告。我说啊？律师说我们这里每个律师都要手抄十九大报告和党章，你们不抄？\n\n开庭时，证据质证完毕，公诉人做公诉发言，先四平八稳地发表了第一轮公诉意见，然后我回应了我的第一轮辩护观点，一是思想不是犯罪；二是发帖的数量远远没有1200条，如果剔除重复计算的，并按照文章数量看其实只有440条；三是并非所有的帖子都是在煽动颠覆国家政权，有很多其实只是发泄个人对社会的不满，对于案件的审理必须分清言论自由权、公民批评建议权与煽动颠覆行为的界限；四是帖子里一些对国家领导人和历史人物的蔑称只是一种侮辱人格的行为，达不到煽动颠覆的要件；五是帖子里对于一些历史事件的纪念以及对某些罪犯的同情，是个人情感的表露，这种个人情感的表露也未达到犯罪的基本要求；六是被告人在帖子里反对我党的一党专政独裁，但其实我国是以我党为主导，各民主党派联合参与的多党制，被告人的反对其实是一种对象上的不能犯；七是本案的量刑可以参照近期长沙中院对江某某煽动颠覆国家政权案的量刑，江某某先后发帖3万余条，关注者逾3万，法院判决有期徒刑二年，而本案被告人发帖数量即便按照起诉书指控也只有1200条，所有QQ群人数加起来也不到2000人，其数量和影响力不及江某某十分之一，公诉人求刑五年以上明显畸重，没有事实和法律依据。公诉人发表第二轮意见时，强调新疆的特殊政治环境和维稳背景，认为必须从重处罚，才能保证边疆稳定。我答辩认为即便为了维稳需求，也必须是在法治框架内的维稳，而不能脱离量刑的基本原则和法治平衡的要求。\n\n法庭最后陈述结束，审判长说休庭五分钟。我的心一下子就凉了，暗想是不是早就已经准备好了。五分钟后，法官重新开庭，只是固定了相关证据，并说本案系重大案件，需审委会讨论决定，开庭日期另行通知。\n\n开完庭，和法官简单沟通了一下，我说像B这样的人如果要判五年以上，你们真是高看他了。法官说你不了解我们这里的情况，维稳任务很艰巨。我说我怎么不了解维稳重任，我籍贯云南，从某种意义上来说，我和你们一样也对暴恐分子怀有深深的仇恨。法官说先不和你扯了，下午我还要下乡去结对子的家里去。\n\n回到乌鲁木齐约了个朋友见面，与朋友聊起新疆的状况，朋友说很多公务员已经一年多没有正常休息，疲惫不堪；政府为了维稳投入巨额经费，监狱内在押人员较之前些年明显增长；南疆有个民族律师，因为酒后说了一些不合时宜的话就被判了三年。朋友还说打算离开新疆，但估计近期比较难。我问你们走了新疆咋办？朋友笑笑，说会有人来的。\n\n第二天早上打了个车去机场，虽然已经八点多了，但由于时差的关系，天依然是黑的，雪花纷纷地下。路过一个检查站时，看到路边停着好几辆警车和一辆装甲车，但只有一个警察懒懒地站在风雪中，也没有过来检查车辆。\n\n飞机起飞了，才爬升了几分钟，整个大地就被厚厚的云霾笼罩在下面。这片广袤的土地，历经汉唐雄风和康乾盛世，历经了苦难的民国，历经着今天，在云霾下，无声无语。\n\n来源:\n洪流法眼\n作者: 洪流法眼"
		},
		{
			"post_id": 64,
			"title": "很疯狂",
			"date_published": 1523860372.386,
			"body": "![9.jpg (0x0)](data/img/post_64_9.jpg)​​​​​​​"
		},
		{
			"post_id": 61,
			"title": "乌鲁木齐市民乘地铁需实名制",
			"date_published": 1523416234.53,
			"body": "4月8日星期天，中国官方的天山网发布消息：“乌鲁木齐市民乘坐乌鲁木齐地铁需使用身份证实名制购票，未持有效车票或冒用他人证件的，将受到处罚。”\n\n这一消息在一些敏感的中国网民当中引起担忧甚至恐慌。网民的担忧是，新疆是中共当局试验最先进的技术手段对公民实行全方位监控的地方，新疆试行的控制手段会扩散到中国其他地区。"
		},
		{
			"post_id": 60,
			"title": "新疆收缴民族语言书籍",
			"date_published": 1523245241.508,
			"body": "![1.jpg (0x0)](data/img/post_60_1.jpg)​​​​​​​"
		},
		{
			"post_id": 59,
			"title": "新疆一教堂",
			"date_published": 1522991360.016,
			"body": "![8.jpg (0x0)](data/img/post_59_8.jpg)​​​​​​​"
		},
		{
			"post_id": 58,
			"title": "新疆维吾尔自治区喀什的一条街上",
			"date_published": 1522391431.392,
			"body": "![9.jpg (0x0)](data/img/post_58_9.jpg)\n\n在中国新疆维吾尔自治区喀什的一条街上，警察检查一名男子的身份证，旁边有安全人员（2017年3月24日）"
		},
		{
			"post_id": 57,
			"title": "新疆所有的刀具都要刻身份证号码",
			"date_published": 1521596820.353,
			"body": "![9.jpg (0x0)](data/img/post_57_9.jpg)​​​​​​​"
		},
		{
			"post_id": 56,
			"title": "大批维吾尔武装人员正向新疆边境集结",
			"date_published": 1521471901.7,
			"body": "![1.jpg (0x0)](data/img/post_56_1.jpg)​​​​​​​"
		},
		{
			"post_id": 55,
			"title": "马路上都到处安装安检门",
			"date_published": 1517568987.846,
			"body": "![11.jpg (0x0)](data/img/post_55_11.jpg)\n\n![22.jpg (0x0)](data/img/post_55_22.jpg)​​​​​​​"
		},
		{
			"post_id": 54,
			"title": "警察与喇嘛对峙",
			"date_published": 1517446410.454,
			"body": "![7.jpg (0x0)](data/img/post_54_7.jpg)​​​​​​​"
		},
		{
			"post_id": 53,
			"title": "习近平在新疆装神弄鬼",
			"date_published": 1517389162.963,
			"body": "![13.jpg (0x0)](data/img/post_53_13.jpg)​​​​​​​"
		},
		{
			"post_id": 52,
			"title": "新疆街景",
			"date_published": 1516972018.013,
			"body": "![11.jpg (0x0)](data/img/post_52_11.jpg)​​​​​​​"
		},
		{
			"post_id": 51,
			"title": "新疆12万维吾尔人被关“再教育营”",
			"date_published": 1516949936.176,
			"body": "2017年11月2日，在新疆库尔勒市，警察站在一个被认为用于再教育的中心附近。\n新疆各地约12万维吾尔族穆斯林据报被中国当局投入类似毛时代的“学习班”。总部设在华盛顿的自由亚洲电台说，一位熟悉当地拘押系统的安全官员向他们透露了这个数字。\n\n![1.jpg (0x0)](data/img/post_51_1.jpg)​​​​​​​"
		},
		{
			"post_id": 50,
			"title": "今日西藏 灵魂争夺战",
			"date_published": 1516263139.93,
			"body": "![3.jpg (0x0)](data/img/post_50_3.jpg)​​​​​​​"
		},
		{
			"post_id": 49,
			"title": "乌鲁木齐街景",
			"date_published": 1516027526.242,
			"body": "![1.jpg (0x0)](data/img/post_49_1.jpg)\n\n![2.jpg (0x0)](data/img/post_49_2.jpg)\n\n![3.jpg (0x0)](data/img/post_49_3.jpg)\n\n![4.jpg (0x0)](data/img/post_49_4.jpg)​​​​​​​"
		},
		{
			"post_id": 48,
			"title": "今日新疆",
			"date_published": 1516025038.623,
			"body": "![1.jpg (0x0)](data/img/post_48_1.jpg)\n\n![2.jpg (0x0)](data/img/post_48_2.jpg)\n\n![3.jpg (0x0)](data/img/post_48_3.jpg)\n\n![4.jpg (0x0)](data/img/post_48_4.jpg)\n\n![5.jpg (0x0)](data/img/post_48_5.jpg)\n\n![6.jpg (0x0)](data/img/post_48_6.jpg)\n\n![7.jpg (0x0)](data/img/post_48_7.jpg)\n\n![9.jpg (0x0)](data/img/post_48_9.jpg)​​​​​​​"
		},
		{
			"post_id": 47,
			"title": "今日新疆",
			"date_published": 1516022427.403,
			"body": "![1.jpg (0x0)](data/img/post_47_1.jpg)\n\n![2.jpg (0x0)](data/img/post_47_2.jpg)\n\n![3.jpg (0x0)](data/img/post_47_3.jpg)\n\n![4.jpg (0x0)](data/img/post_47_4.jpg)\n\n![5.jpg (0x0)](data/img/post_47_5.jpg)\n\n![6.jpg (0x0)](data/img/post_47_6.jpg)\n\n![7.jpg (0x0)](data/img/post_47_7.jpg)\n\n![8.jpg (0x0)](data/img/post_47_8.jpg)​​​​​​​"
		},
		{
			"post_id": 46,
			"title": "今日新疆",
			"date_published": 1515998134.654,
			"body": "![1.jpg (0x0)](data/img/post_46_1.jpg)\n\n![2.jpg (0x0)](data/img/post_46_2.jpg)\n\n![3.jpg (0x0)](data/img/post_46_3.jpg)\n\n![4.jpg (0x0)](data/img/post_46_4.jpg)\n\n![5.jpg (0x0)](data/img/post_46_5.jpg)\n\n![6.jpg (0x0)](data/img/post_46_6.jpg)\n\n![7.jpg (0x0)](data/img/post_46_7.jpg)​​​​​​​"
		},
		{
			"post_id": 45,
			"title": "新疆县城级警用设备",
			"date_published": 1515986161.074,
			"body": "![2.jpg (0x0)](data/img/post_45_2.jpg)​​​​​​​"
		},
		{
			"post_id": 44,
			"title": "维稳用导弹",
			"date_published": 1515980099.118,
			"body": "![1.jpg (0x0)](data/img/post_44_1.jpg)​​​​​​​"
		},
		{
			"post_id": 43,
			"title": "沙车街景",
			"date_published": 1515976544.664,
			"body": "![1.jpg (0x0)](data/img/post_43_1.jpg)​​​​​​​"
		},
		{
			"post_id": 42,
			"title": "克拉玛依维稳队",
			"date_published": 1515947488.865,
			"body": "![2.jpg (0x0)](data/img/post_42_2.jpg)​​​​​​​"
		},
		{
			"post_id": 41,
			"title": "乌什县街头",
			"date_published": 1515944651.211,
			"body": "![3.jpg (0x0)](data/img/post_41_3.jpg)​​​​​​​"
		},
		{
			"post_id": 40,
			"title": "乌鲁木齐街景",
			"date_published": 1515941410.397,
			"body": "![1.jpg (0x0)](data/img/post_40_1.jpg)\n\n![2.jpg (0x0)](data/img/post_40_2.jpg)\n\n![3.jpg (0x0)](data/img/post_40_3.jpg)\n\n![4.jpg (0x0)](data/img/post_40_4.jpg)\n\n![5.jpg (0x0)](data/img/post_40_5.jpg)\n\n![6.jpg (0x0)](data/img/post_40_6.jpg)\n\n![7.jpg (0x0)](data/img/post_40_7.jpg)\n\n![8.jpg (0x0)](data/img/post_40_8.jpg)\n\n![9.jpg (0x0)](data/img/post_40_9.jpg)\n\n![10.jpg (0x0)](data/img/post_40_10.jpg)\n\n![11.jpg (0x0)](data/img/post_40_11.jpg)​​​​​​​"
		},
		{
			"post_id": 39,
			"title": "乌鲁木齐街头的路障",
			"date_published": 1515939337.413,
			"body": "![15.jpg (0x0)](data/img/post_39_15.jpg)​​​​​​​"
		},
		{
			"post_id": 38,
			"title": "喀什街头",
			"date_published": 1515936136.836,
			"body": "![17.jpg (0x0)](data/img/post_38_17.jpg)​​​​​​​"
		},
		{
			"post_id": 37,
			"title": "新疆酒吧一景",
			"date_published": 1515934369.618,
			"body": "![7.jpg (0x0)](data/img/post_37_7.jpg)​​​​​​​"
		},
		{
			"post_id": 36,
			"title": "新疆球迷",
			"date_published": 1515923139.276,
			"body": "![6.jpg (0x0)](data/img/post_36_6.jpg)​​​​​​​"
		},
		{
			"post_id": 35,
			"title": "维稳的直升机",
			"date_published": 1515916417.833,
			"body": "![5.jpg (0x0)](data/img/post_35_5.jpg)​​​​​​​"
		},
		{
			"post_id": 34,
			"title": "公判，公捕，公拘",
			"date_published": 1515899290.873,
			"body": "伊利\n\n![1.jpg (0x0)](data/img/post_34_1.jpg)\n\n![2.jpg (0x0)](data/img/post_34_2.jpg)\n\n![3.jpg (0x0)](data/img/post_34_3.jpg)\n\n和田\n\n![4.jpg (0x0)](data/img/post_34_4.jpg)​​​​​​​"
		},
		{
			"post_id": 33,
			"title": "今日新疆",
			"date_published": 1515860397.578,
			"body": "![1.jpg (0x0)](data/img/post_33_1.jpg)\n\n![2.jpg (0x0)](data/img/post_33_2.jpg)\n\n![3.jpg (0x0)](data/img/post_33_3.jpg)\n\n![4.jpg (0x0)](data/img/post_33_4.jpg)​​​​​​​"
		},
		{
			"post_id": 32,
			"title": "新疆维稳",
			"date_published": 1515857976.894,
			"body": "![1.jpg (0x0)](data/img/post_32_1.jpg)\n\n![3.jpg (0x0)](data/img/post_32_3.jpg)\n\n![4.jpg (0x0)](data/img/post_32_4.jpg)\n\n![5.jpg (0x0)](data/img/post_32_5.jpg)​​​​​​​"
		},
		{
			"post_id": 31,
			"title": "新疆维稳",
			"date_published": 1515854291.737,
			"body": "![1.jpg (0x0)](data/img/post_31_1.jpg)\n\n![2.jpg (0x0)](data/img/post_31_2.jpg)\n\n![3.jpg (0x0)](data/img/post_31_3.jpg)\n\n![4.jpg (0x0)](data/img/post_31_4.jpg)​​​​​​​"
		},
		{
			"post_id": 30,
			"title": "莎车维族暴动",
			"date_published": 1515851126.127,
			"body": "![1.jpg (0x0)](data/img/post_30_1.jpg)\n\n![2.jpg (0x0)](data/img/post_30_2.jpg)\n\n![3.jpg (0x0)](data/img/post_30_3.jpg)\n\n莎车派出所被焚\n\n![8.jpg (0x0)](data/img/post_30_8.jpg)​​​​​​​"
		},
		{
			"post_id": 29,
			"title": "乌鲁木齐的昼与夜",
			"date_published": 1515849872.595,
			"body": "![4.jpg (0x0)](data/img/post_29_4.jpg)\n\n![5.jpg (0x0)](data/img/post_29_5.jpg)\n\n![6.jpg (0x0)](data/img/post_29_6.jpg)​​​​​​​"
		},
		{
			"post_id": 28,
			"title": "乌鲁木齐火车站",
			"date_published": 1515847681.38,
			"body": "![11.jpg (0x0)](data/img/post_28_11.jpg)\n\n![12.jpg (0x0)](data/img/post_28_12.jpg)​​​​​​​"
		},
		{
			"post_id": 27,
			"title": "乌鲁木齐火车站",
			"date_published": 1515846417.56,
			"body": "![1.jpg (0x0)](data/img/post_27_1.jpg)\n\n![2.jpg (0x0)](data/img/post_27_2.jpg)​​​​​​​"
		},
		{
			"post_id": 26,
			"title": "乌鲁木齐火车站",
			"date_published": 1515843385.671,
			"body": "![7.jpg (0x0)](data/img/post_26_7.jpg)\n\n![5.jpg (0x0)](data/img/post_26_5.jpg)​​​​​​​"
		},
		{
			"post_id": 25,
			"title": "哈密火车站",
			"date_published": 1515839839.121,
			"body": "![1.jpg (0x0)](data/img/post_25_1.jpg)​​​​​​​"
		},
		{
			"post_id": 24,
			"title": "今日新疆",
			"date_published": 1515836530.384,
			"body": "![1.jpg (0x0)](data/img/post_24_1.jpg)\n\n![2.jpg (0x0)](data/img/post_24_2.jpg)\n\n![8.jpg (0x0)](data/img/post_24_8.jpg)\n\n![10.jpg (0x0)](data/img/post_24_10.jpg)\n\n![11.jpg (0x0)](data/img/post_24_11.jpg)\n\n![12.jpg (0x0)](data/img/post_24_12.jpg)\n\n![13.jpg (0x0)](data/img/post_24_13.jpg)​​​​​​​"
		},
		{
			"post_id": 23,
			"title": "今日新疆",
			"date_published": 1515828140.432,
			"body": "![1.jpg (0x0)](data/img/post_23_1.jpg)\n\n![2.jpg (0x0)](data/img/post_23_2.jpg)\n\n![3.jpg (0x0)](data/img/post_23_3.jpg)\n\n![4.jpg (0x0)](data/img/post_23_4.jpg)\n\n![5.jpg (0x0)](data/img/post_23_5.jpg)\n\n![6.jpg (0x0)](data/img/post_23_6.jpg)\n\n![7.jpg (0x0)](data/img/post_23_7.jpg)​​​​​​​"
		},
		{
			"post_id": 22,
			"title": "1933年的预言",
			"date_published": 1515824755.633,
			"body": "![1.jpg (0x0)](data/img/post_22_1.jpg)\n\n![2.jpg (0x0)](data/img/post_22_2.jpg)\n\n![3.jpg (0x0)](data/img/post_22_3.jpg)​​​​​​​"
		},
		{
			"post_id": 21,
			"title": "西藏街景",
			"date_published": 1515823752.044,
			"body": "![1.jpg (0x0)](data/img/post_21_1.jpg)\n\n![2.jpg (0x0)](data/img/post_21_2.jpg)\n\n![3.jpg (0x0)](data/img/post_21_3.jpg)\n\n![4.jpg (0x0)](data/img/post_21_4.jpg)\n\n![5.jpg (0x0)](data/img/post_21_5.jpg)\n\n![6.jpg (0x0)](data/img/post_21_6.jpg)​​​​​​​"
		},
		{
			"post_id": 20,
			"title": "向阿坝人民致敬",
			"date_published": 1515819551.884,
			"body": "![1.jpg (0x0)](data/img/post_20_1.jpg)​​​​​​​"
		},
		{
			"post_id": 19,
			"title": "扎青鄉",
			"date_published": 1515819396.337,
			"body": "![4.jpg (0x0)](data/img/post_19_4.jpg)​​​​​​​"
		},
		{
			"post_id": 18,
			"title": "藏民抗暴英雄",
			"date_published": 1515812900.92,
			"body": "![3.jpg (0x0)](data/img/post_18_3.jpg)​​​​​​​"
		},
		{
			"post_id": 17,
			"title": "藏民抗议乱开采矿",
			"date_published": 1515812792.169,
			"body": "![2.jpg (0x0)](data/img/post_17_2.jpg)​​​​​​​"
		},
		{
			"post_id": 16,
			"title": "复印藏文",
			"date_published": 1515812544.547,
			"body": "![1.jpg (0x0)](data/img/post_16_1.jpg)​​​​​​​"
		},
		{
			"post_id": 15,
			"title": "黃南州各寺廟的電視及衛星設備被當局沒收和破壞",
			"date_published": 1515810081.183,
			"body": "![1.jpg (0x0)](data/img/post_15_1.jpg)​​​​​​​"
		},
		{
			"post_id": 14,
			"title": "西藏的一个寺庙",
			"date_published": 1515809668.902,
			"body": "![2.jpg (0x0)](data/img/post_14_2.jpg)​​​​​​​"
		},
		{
			"post_id": 13,
			"title": "西藏要自由",
			"date_published": 1515803871.586,
			"body": "![2.jpg (0x0)](data/img/post_13_2.jpg)​​​​​​​"
		},
		{
			"post_id": 12,
			"title": "无声的抗议",
			"date_published": 1515803729.299,
			"body": "![3.jpg (0x0)](data/img/post_12_3.jpg)​​​​​​​"
		},
		{
			"post_id": 11,
			"title": "饭店楼顶的维稳哨",
			"date_published": 1515775434.881,
			"body": "![1.jpg (0x0)](data/img/post_11_1.jpg)​​​​​​​"
		},
		{
			"post_id": 10,
			"title": "今日西藏",
			"date_published": 1515772372.94,
			"body": "![1.jpg (0x0)](data/img/post_10_1.jpg)\n\n![2.jpg (0x0)](data/img/post_10_2.jpg)\n\n![3.jpg (0x0)](data/img/post_10_3.jpg)\n\n![4.jpg (0x0)](data/img/post_10_4.jpg)\n\n![5.jpg (0x0)](data/img/post_10_5.jpg)\n\n![6.jpg (0x0)](data/img/post_10_6.jpg)​​​​​​​"
		},
		{
			"post_id": 9,
			"title": "今日西藏",
			"date_published": 1515772217.803,
			"body": "![1.jpg (0x0)](data/img/post_9_1.jpg)\n\n![2.jpg (0x0)](data/img/post_9_2.jpg)\n\n![3.jpg (0x0)](data/img/post_9_3.jpg)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "西藏兴海县",
			"date_published": 1515768924.998,
			"body": "![1.jpg (0x0)](data/img/post_8_1.jpg)\n\n![2.jpg (0x0)](data/img/post_8_2.jpg)​​​​​​​"
		},
		{
			"post_id": 7,
			"title": "游街批斗",
			"date_published": 1515763399.639,
			"body": "![1.jpg (0x0)](data/img/post_7_1.jpg)\n\n![2.jpg (0x0)](data/img/post_7_2.jpg)​​​​​​​"
		},
		{
			"post_id": 6,
			"title": "藏人自焚抗议中共暴政",
			"date_published": 1515761335.176,
			"body": "![1.jpg (0x0)](data/img/post_6_1.jpg)\n\n![2.jpg (0x0)](data/img/post_6_2.jpg)\n\n![3.jpg (0x0)](data/img/post_6_3.jpg)\n\n![4.jpg (0x0)](data/img/post_6_4.jpg)\n\n![5.jpg (0x0)](data/img/post_6_5.jpg)\n\n![6.jpg (0x0)](data/img/post_6_6.jpg)\n\n![7.jpg (0x0)](data/img/post_6_7.jpg)​​​​​​​"
		},
		{
			"post_id": 5,
			"title": "这不是对付印度的国防军，是对付藏民的维稳军。",
			"date_published": 1515751434.456,
			"body": "![1.jpg (0x0)](data/img/post_5_1.jpg)\n\n![2.jpg (0x0)](data/img/post_5_2.jpg)\n\n![3.jpg (0x0)](data/img/post_5_3.jpg)\n\n![4.jpg (0x0)](data/img/post_5_4.jpg)\n\n![5.jpg (0x0)](data/img/post_5_5.jpg)\n\n![6.jpg (0x0)](data/img/post_5_6.jpg)\n\n![7.jpg (0x0)](data/img/post_5_7.jpg)\n\n![8.jpg (0x0)](data/img/post_5_8.jpg)\n\n![9.jpg (0x0)](data/img/post_5_9.jpg)\n\n![10.jpg (0x0)](data/img/post_5_10.jpg)\n\n![11.jpg (0x0)](data/img/post_5_11.jpg)​​​​​​​"
		},
		{
			"post_id": 4,
			"title": "藏区的一座寺庙",
			"date_published": 1515746564.331,
			"body": "![1.jpg (0x0)](data/img/post_4_1.jpg)\n\n![2.jpg (0x0)](data/img/post_4_2.jpg)\n\n![3.jpg (0x0)](data/img/post_4_3.jpg)​​​​​​​"
		},
		{
			"post_id": 3,
			"title": "西藏人过节日",
			"date_published": 1515742136.573,
			"body": "![1.jpg (0x0)](data/img/post_3_1.jpg)\n\n![2.jpg (0x0)](data/img/post_3_2.jpg)\n\n![3.jpg (0x0)](data/img/post_3_3.jpg)\n\n![4.jpg (0x0)](data/img/post_3_4.jpg)\n\n![5.jpg (0x0)](data/img/post_3_5.jpg)\n\n![6.jpg (0x0)](data/img/post_3_6.jpg)\n\n![7.jpg (0x0)](data/img/post_3_7.jpg)\n\n![8.jpg (0x0)](data/img/post_3_8.jpg)​​​​​​​"
		},
		{
			"post_id": 2,
			"title": "今日西藏",
			"date_published": 1515741302.393,
			"body": "![1.jpg (0x0)](data/img/post_2_1.jpg)\n\n![2.jpg (0x0)](data/img/post_2_2.jpg)\n\n![3.jpg (0x0)](data/img/post_2_3.jpg)\n\n![4.jpg (0x0)](data/img/post_2_4.jpg)\n\n![5.jpg (0x0)](data/img/post_2_5.jpg)\n\n![6.jpg (0x0)](data/img/post_2_6.jpg)\n\n![7.jpg (0x0)](data/img/post_2_7.jpg)\n\n![8.jpg (0x0)](data/img/post_2_8.jpg)​​​​​​​"
		}
	]
}