{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1586167995,
			"title": "Dlaczego Polacy tak slabo na ZeroNet?",
			"body": "Nie moge zrozumiec dlaczego az tak slabo idzie nam jako nacji tworzenie spolecznosci jak zeronet?\n\nPrzeciez to jest takie proste. Wchodza co chwile nowe rozwiazania kiedy petla rzadowych zdrajcow zaciska sie na polskich szyjach. Czy to zwykle tepe chlopstwo a szlachta pogrzebana w glebie lasu?",
			"added": 1586167994
		},
		{
			"topic_id": 1587203843,
			"title": "Dziki trener usuniety film: YouTubePL [tutaj ratujemy ocenzurowane]",
			"body": "Objawianie falszu pandemi COVID-19 w kilka minut i na dziko. [Kliknij tutaj > Wideo material link: Dziki trener usuniety film: YouTubePL](http://127.0.0.1:43110/15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h/?watch=1587116491_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs)",
			"added": 1587203841
		},
		{
			"topic_id": 1587221962,
			"title": "Eddie Slowianin. Radio Slawenia. Dlaczego model dzialan jest slaby?",
			"body": "*RADIO SLAWENIA ISTNIEJE DZIÊKI WASZEMU WSPARCIU*\n\n*Jesteœmy Pierwszym w tych latach niezaleznym od korpo i biznesu, a przede wszystkim wolnym od Cenzury Radiem dla Slowian !!! , a wiec Polaków i wszystkich Slowian !!! U nas uslyszycie to czym boja sie nawet myslec inne stacje !!Slawa i Chwala! Wspierajcie Nasze dzialania fizycznie lub drobna wplata byœmy docierali do prawdy i odbudowali wiezi naszego Narodu !!! szczególy na : slowianskadusza.com - wsparcie ISTNIEJEMY DZIEKI WAM ,CZYLI WSPOLNEJ PRACY!!!:*\n\nA wiec zauwazmy nastepujace falszywe zalorzenie tego ideologicznie trafnego projektu. 1. \"niezaleznym od korpo i biznesu\" Nie! Serwer nalezy do firmy zarejstrowanej w panstwie i mu podleglej. Jesli prywatny serwer to zalezny od ISP firmy dostarczajacej polaczenie i ona podlegla panstwu moze zablokowac IP tego serwera (odciac go od reszty internetu) 2. Taki system aby istniec wymaga przesylania platnosci jesli w narodowej walucie to moze byc zablokowany prawnie przez panstwo. \n\nCzas najwyzszy przeniesc wasz projekt na zeronet gdzie nie potrzeba platnosci zeby utrzymac komunikacje a kazdy sluchacz czy fan moze wspierac seedujac tresci. Zamieszczajacy moze sie koncentrowac na tworzeniu tresci tak wartosciowych i na tyle popularnych zeby zniknieciem z sieci nie musial sie matwic.\n\nCalkowite zablokowanie sieci zawnetrznej jest zawsze mozliwe, ale dla zablokowania dobrze operujacej sieci zdecentralizowanej duzo trudniejsze. \n\nhttps://www.slowianskadusza.com/",
			"added": 1587221959
		}
	],
	"topic_vote": {
		"1580479193_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": 1,
		"1581827701_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1577974129_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1586174528_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"1587203843_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"1577981477_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"1581803913_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1545594088_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": 1,
		"1565086389_1JZcGPhLfmeACHEXu4R16hrU2Rz6wBgYoY": 1,
		"1577573679_19uVBhkQH2J1AY5PBJ8BebTqdRj6sn8iwn": 1
	},
	"next_comment_id": 37,
	"comment": {
		"1577126375_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "Brak fachowcow, brak niezaleznosci, brak wiedzy, wszyscy jak male dzieci zalezne od wszystkieo co za granica. Narod niewolnikow! \n\nPozdrawiam wszystkich i moze dla nas chociaz nowy rok bedzie godny wspominania.",
				"added": 1578147333
			}
		],
		"1577790114_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 2,
				"body": "U mnie ten film film komedia czeski mam talent laduje tylko 3/30 mb. Ale jest taka kwestia np miedzy innymi, ze ja mam inna wersje zeronet niz jakas liczba innych uzytkownikow. Nie wszyscy odswierzaja chetnie aplikacje. Pomysl na zrobienie wlasnej wersji zero 'pod swoja grupe' jest genialny. To moze byc wielkie zadanie ale ja bylbym zainteresowany. Nie znaczy ze jestem doswiadczony, jedynie ze zainteresowany taka praca. pozdrawiam wszystkich.",
				"added": 1578148123
			}
		],
		"1562960205_12p9JsmWBNB2FGXhrACxyF1TdvJzsbwQcu": [
			{
				"comment_id": 3,
				"body": "W XII wieku polska szlachta po procesie prania mozgu przez 'jezuitow' od kolyski, rozdala swoje rodzinne fortuny na budowe kosciolow w Polsce. Jest to tragiczny efekt sybdromu sztokholmskiego. Potem byly mordy na szlachcie. Teraz mamy totalny 'plebszczyzm' i polskie nie ma. To bolesna prawda.",
				"added": 1578148617
			}
		],
		"1578411043_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 4,
				"body": "Nie bylo komor gazowych w takim znaczeiu jak nam sie wmawia. Swietny artykul. O tych klamstwach mozna by tomy pisac. Chociaz czesc nalezy.",
				"added": 1578997682
			}
		],
		"1578775053_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": [
			{
				"comment_id": 5,
				"body": "No to musze zapraszac ludzi!",
				"added": 1579255304
			},
			{
				"comment_id": 6,
				"body": "> [somuchfood](#comment_1_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): spoko\n\nWitam rowniez!",
				"added": 1579856823
			}
		],
		"1580479193_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": [
			{
				"comment_id": 7,
				"body": "Pasozydy staraja sie tworzyc system w ktorym zderiontewana jednostka nieswiadomie pozornie wyraza zgode na swoje zniewolenie. Przeczuwam ze chodzi o karme, nie tylko system prawny.",
				"added": 1580894991
			},
			{
				"comment_id": 8,
				"body": "Gdyby ludzie chociaz mala czesc z tego rozumieli wyzysk bylby o niebo trudniejszy.",
				"added": 1580895052
			}
		],
		"1581694747_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 9,
				"body": "Ja widzialem w programie TVnarodowej online w klipie wideo jak starsza babcia gadala do 'prawicowca' polityka jak do wnuczka o jego zmianach czlonkostwa partii i krew odplynela mi z twarzy z przerazenia jak tymi ludzmi latwo manipulowac. Istna tragedia ludzka 'demokracji'.\n\nRozumiem doskonale ten szal, ale przede wszystkim nie szkodz sobie samemu. Ci ludzie to efekt prania mozgu od dziecka, degeneracji od trucizn w jedzeniu i szpitalu i odciecia od natury. Spedzaja tak cale dekady zycia wiec takie sa potem straszne efekty tego. \n\nMusimy robic dzieci ktore od poczecia sa uodpornione 'zaszczepione' na manipulacje i systemy niewolnictwa. Tylko tak mozemy przechylic szale. Hazarskie scierwo nienawidzi tych wszystkich 'dziadkow' i chce sie ich pozbyc bo juz nie moga utrzymywac systemu wyzysku. Dlatego ich truja i glodza.",
				"added": 1581843348
			},
			{
				"comment_id": 14,
				"body": "> [arturdreamwalker](#comment_4_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc): Między innymi dlatego ludzie podobnie myślący do Ciebie puścili wirusa. Zbyt wielu zyskuje zbyt wiele, żeby to był przypadek. [...]\n\nNa szczescie sa tacy ktorzy nie slabna bardzo na starosc, umieja zadbac o kondycje i... \n\n dzialaja w podziemiu.",
				"added": 1584350436
			},
			{
				"comment_id": 15,
				"body": "> [driud](#comment_39_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Poruszony  został temat wirusa;  proszę go połączyć z bańką finansową usmanow? to zrozumiesz, dlaczego ten wirus został uruchomiony? Za dużo wydrukowano pieniądzorów, które są tyle warte ile jest warty papier zadrukowany? Trzeba teraz gospodarkę sąsiadów , ostudzić, schłodzić; Zamknięte, szkoły, sklepy, niektóre małe firmy splajtują, w efekcie tego posunięcia. Będzie można je wykupić za parę dolców, euro.Co musiał zrobić Jaruzelski? aby wprowadzić stan wojenny? Godzinę Policyjną; Wojsko, Milicję, Ormo, Zomo, itp.             A ludzie i tak się szwendali po ulicach. A teraz \"WIRUS\"- rozwiązuje sprawę, ludzie siedzą sami w domu. ( areszt domowy ). Zakłady stoją, i powoli bankrutują. Dolar się umacnia.  Wniosek jest jeden; Pejsate, wzięli pół świata za mordę; I nikt , nawet nie jest zdziwiony, tym co się dzieje; Dają się prowadzić na smyczy jak, stado baranów do rzeźni.Wszystko jest zaplanowane, i według planu wykonywane. Jeszcze tylko wprowadzą pieniądz \"ELEKTRONICZNY\".I wszyscy jesteście w Czarnej Dupie. ( ja też ). I co zrobicie mądrale????Nie oczekuję odpowiedzi na te pytanie;Dużo zdrówka życzę.\n\nDokladnie to samo myslalem od wczoraj wieczor za wyjatkiem elementu slabnacego dolara. to nie pierwszy raz chca wykupywac za grosze wielkie dorobnki narodow goji.",
				"added": 1584364789
			}
		],
		"1581827701_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 10,
				"body": "A to ciekawe! Dzieki",
				"added": 1581886987
			},
			{
				"comment_id": 11,
				"body": "Zrobione,\nMusze tylko jutro potwierdzic.",
				"added": 1581974341
			},
			{
				"comment_id": 12,
				"body": "> [driud](#comment_29_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Zobacz statystyki; 15,-  16,-  18,-   peerów, dla polski. Jest już widoczna poprawa. I liczby przy stronach też troszkę się podniosły. Jeśli wszyscy to poprą? to się wreszcie podniesiemy z dna. pozdr.\n\nSwietna robota. Sam wypatrzyles szkodliwe rozbieznosci?",
				"added": 1581974623
			},
			{
				"comment_id": 13,
				"body": "09. ZeroPolskaID\nCzy dodanie sugerowanej tam linii kodu ma poprawic moja lacznosc z ID uzytkownikow ktorzy sa 'polskimi ID'?",
				"added": 1582016569
			}
		],
		"1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [
			{
				"comment_id": 16,
				"body": "'Tell me more' czyli - brzmi bardzo ciekawie. \nMusze jedynie sprawdzic co to jest dokladnie.",
				"added": 1585335520
			},
			{
				"comment_id": 36,
				"body": "'Mesh wioski'\nTa koncepcja sieci internetowej układającej się na osadzie jest bardzo organiczna. Idąc wg analogi drzew dopiero grupa drzew łączy się między sobą połaczeniami tworząc las. Uszkodzenie jednego drzewa nie paraliżuje lasu. A jak wyglądałby centralno zarządzany korporacyjny internet w takiej analogi? > Jak pleśń lub guz rakowy czy jak?",
				"added": 1596538148
			}
		],
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": [
			{
				"comment_id": 17,
				"body": "> [3zzz](#comment_2_16pXk7n6d1CsESSZKvpZ6NzWXHR2noCMKt): dlaczego umarł fidonet?\n\npowiedz cos wiecej o tym? Pozdrawiam",
				"added": 1586171181
			},
			{
				"comment_id": 20,
				"body": "> [mneomonic](#comment_2_1MGFBAHFakQXiAhMFjmWxob7rdAcKraPwP): ..ale.spoko, uda się ;)\n\nTym ktorzy juz tu sa napewno bedzie latwiej przetrwac wszystkie szkodliwe bzdury NWO. Ale musimy miec tu wiecej myslacych ludzi ktorzy rozumieja ze czarnostwo wsadzilo juz swoje czipy w kazdy komputer i telefon ze swoim szpiegiem i nie ma watpliwosci ze sprobuja to zrobic samym ludziom. \n\nRobienie czegos przeciw zdradzieckiej wladzy na forum na serwerze prawnie od nich zaleznym jest jakby Polacy atakowali niemcow bronia ktora oni im sprzedaja. Jak to sie mowi: \"Stuknij sie w leb\".",
				"added": 1587112209
			},
			{
				"comment_id": 21,
				"body": "Swietnie. Lata temu mialem fanpage i bylem tak filtrowany przez pejsbuk ze prawie psychozy dostalem. A teraz Pejsy i szabosy nie moga przezyc zeby ludzie wchodzili na przestrzen gdzie oni nie moga robic cyfrowych gett w ktorych wybudzonych oddzielaja od pol-wybodzonych a mieso armatnie (IQ <96) od calej reszty - tak trzymajac masy w blokadzie.\n\nKiedy juz przyjda wtedy zaczna sie rozmowy i narady nad jeszcze powazniejszymi tematami niz na 'clearnet' kiedykolwiek sie da nawet w cyfrowym getcie.\n\nCzy juz przegladales fora polskie czy inne na zeronet? Masz jakas opinie na temat jakosci tresci i technologi? Slawa!",
				"added": 1587199384
			},
			{
				"comment_id": 22,
				"body": "> [ejkej](#comment_4_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs): Dawaj linki, ja jestem mega zadowolony z technologii. Mając pliki zeronet można robić małe sieci i wtedy połączyć to w wielkiego mesha. Dla mnie bomba!\n\nDopiero sie zaglebiam w temat, ale z tego co wiem kluczowe jest zaprojektowanie 'routera' compatybilnego z typem sieci 'mesh'. Rzekomo pracuja nad tym.\n\nPytasz o linki. Wysle niedlugo. Czy masz aktywowany zeromail? http://127.0.0.1:43110/Mail.ZeroNetwork.bit/",
				"added": 1587216126
			},
			{
				"comment_id": 23,
				"body": "Eddie Slowianin to klasyczny przykad czlowieka ktory nie rozumie istoty nowoczesnej niezaleznej komunikacji. Swietne informacje a cala operacje swojego 'panstwa podziemnego' na otwartym internecie i prowadzi radio na stronie typowego serwera clearnet. Braki w edukacji braki w zrozumieniu poziomu technologicznego wroga. \n\nhttps://www.youtube.com/watch?v=9MAa_Idmpas",
				"added": 1587216723
			}
		],
		"1586174528_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 18,
				"body": "Z motyka na ksiezyc. \n\nCiezkie klimaty ci ludzie.",
				"added": 1586418209
			},
			{
				"comment_id": 19,
				"body": "> [mneomonic](#comment_1_1MGFBAHFakQXiAhMFjmWxob7rdAcKraPwP): Idę w to! Odezwij się.. chętnie podziałam, jestem grafikiem mogę zrobić jakieś grafiki i fanpage..\n\nWitam goraco w naszym cudownym przytulnym *podziemiu* :D\n\nLos (nwo) wykrecil falszywy covid. Tak wychodzi ze w tym czasie aresztu ja juz jestem na etapie instalacji militarnych jednak bajecznie prostych dystrybucji linuxa (windowsa moze gdzies kiedys na 5 minut jeszcze) i badania alternatywnych niezaleznie instalowanych infrastruktur dla normalnych ludzi bez kasy korporacji i bez cenzury rzadu. W tym poscie jest ten watek [Sieć meshowa LibreMesh](http://127.0.0.1:43110/1GRYnz73jSXoMMZNU3nSmbCFA3twuitcoo/?Topic:1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF/Sie+meshowa+LibreMesh). Testuje tez czaty tekstowe z [enkrypcja tu na zeronet](http://127.0.0.1:43110/1CWkZv7fQAKxTVjZVrLZ8VHcrN6YGGcdky/). Ten czat jak inne strony typu czat sa tu na zeronet. W sumie to kazdy moze tu stworzyc kazda strone i kazdy moze zaoferowac swoj komputer jako wspol-serwer do tego. Koszmar dla cenzorow! \n\nMam zamiar stworzyc niedlugo materialy instruktazowe dla nowych, a ten [serwer proxy 0net-preview.duckdns.org](https://0net-preview.duckdns.org/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/) daje podglad w glab sieci zeronet dla ludzi z 'clearnet'. Takich serwerow mozna narobic duzo a wszelkie blokady na nich nie szkodza zeronet. Na nich nalezaloby robic najlepsza reklame zeronet i pokazac jego przewage nad pejsbukiem i czarnotuba.\n\nKontakt ze mna na zeromail lub na wybranym czacie.",
				"added": 1587111587
			}
		],
		"1577981477_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 24,
				"body": "\"Są w sytuacji ciężko wystraszonego pacjenta u stomatologa co zasłania usta ręką ,zaciska zęby a ten mu wyrywa zęba przez odbytnicę (porównanie moje)\"\n\nI to bedzie cytat 2020 :D Cos pieknego!",
				"added": 1587225266
			}
		],
		"1581803913_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 25,
				"body": "Swietny material wideo obejrzalem. Dzieki!",
				"added": 1587225641
			}
		],
		"1565086389_1JZcGPhLfmeACHEXu4R16hrU2Rz6wBgYoY": [
			{
				"comment_id": 26,
				"body": "Brzmi jak ten agent mossadu yyyyyyyyyy korwin",
				"added": 1587226007
			}
		],
		"1546155194_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 27,
				"body": "> [misiek](#comment_3_1CcKmMy8KEvx5xebrTsNCiTRggND1MYF1G): misiek\n\nJa mam ciekawe informacje w tej sprawie. Zmail zapraszam...",
				"added": 1587230682
			}
		],
		"1577573679_19uVBhkQH2J1AY5PBJ8BebTqdRj6sn8iwn": [
			{
				"comment_id": 28,
				"body": "Oczywiscie ze folia dziala w jakims zakresie. Owinalem raz komorke gruba werstwa foli alluminiowej i nie dalo sie w pewnym momencie na telefon dzwonic. Prosze testowac. Ale najmniejsza nieszczelnosc pozwala czulemu telefonowi zrozumiec sygnal i zwiekszyc sile sygnalu wysylanego przez siebie do wierzy.\n\nfale wifi i gsm sa jak swiatlo. Zrob pudelko z lustrzana powierzchnia i wpusc do srodka promyk swiatla. Co sie dzieje? A moze taki wpadajacy promyk wifi mozna wytlumic czy wugluszyc uzieminiem czy chlonna strona wewnetrzna materialu? \n\nRuszamy mozgownica robimy eksperymenty.",
				"added": 1587291269
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 29,
				"body": "Jasna sprawa ze chcecie isc do ludziskow. Trzeba ludziom ktorzy tu wchodza na zeronet od razu mowic ze to nie jest FB, YT tutaj nie da sie latwo usadzic pionkow medialnych, kontrolowac informacji. Jak wchodzisz na zeronet od razu beda chcieli wsadzic ci kija w szprychy. I wtedy jest tak zwany karpik [zdziwionko] a moze nawet zwalanie ze zeronet sie chrzani, bo co innego. Straszne braki w edukacji. Ja mialem problem z przesylem zawartosci ztron zn i kombinowalem z rozynmi wersjami zeronet 0.6.5 do 0.7.1 i nie za wiele sie zmienialo. Potem zmienialem systemy operacyjne i to zrobilo najwieksza roznice. Pozniej ktos mi pokazal jak zwiekszac liczbe trackersow na zeronet i kolejna poprawa. Koniecznie trzeba zrobic takie materialy informacyjne w style 'apteczki pierwszej pomocy'.",
				"added": 1589468509
			},
			{
				"comment_id": 32,
				"body": "> [fornakter](#comment_8_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): Wow, nie wiedziałem o tym menu z boku :DOgólnnie to spoko sprawa ten ZN, ale widzę, że jeszcze dużo roboty tutaj czeka...\n\nSzczal w dyszke!!! XD",
				"added": 1593785176
			}
		],
		"1593366129_1BBdtbg2Lf7AKGkoqGkU7wt1gvupFWg7Cu": [
			{
				"comment_id": 30,
				"body": "> [glosrozsadku](#comment_7_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG): Zdolny rocznik.\n\nGeniusze! My to idioci!",
				"added": 1593774147
			}
		],
		"1592839559_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 31,
				"body": "> [fornakter](#comment_4_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): A jak zrobić minaturkę niestandardową?*\n\nJezeli po angielsku chcesz jeszcze to jest KopyKate i KopyKate Big Official. Tam jest autentycznie wszystko, najlepsze ang dokumenty, bzdury nieseedowane smieci, tutoriale zeronet i latajace genitalia. Kolege moge zapytac o linki do dokumentow ktore on seeduje tam. *[Tam mozesz robic miniaturki indywidualnie]\n\nJest jeszcze Kxovid strona duzo madrzej zaprojektowana dla kanalow wideo, ale malo popularna. Ale, gdzie by plik nie byl, glownie to jak seedujemy wplywa na szybkosc. Daj znac, zalatwimy seed do ciebie.",
				"added": 1593775063
			},
			{
				"comment_id": 33,
				"body": "Strony ZAWSZE POWINNY miec mozliwosc seedowania selektywnie wybranych uzytkownikow czy dzialow tej strony. Strach przed zniszczeniem reputacji powstrzyma przed publikowaniem smieci i badziewia. Wrogie organizacje beda wrzucaly kije w szprychy i oczernialy. Poczatki wolnej sieci internetowej musza byc pelne wyzwan. Jest to calkiem normalne.",
				"added": 1595666863
			}
		],
		"1594760103_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 34,
				"body": "> [eltheal](#comment_1_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): Nie jestem w Europie. wyłączyłem komputer, kiedy poszedłem spać. teraz powinno być więcej siewników i ludzi. [...]\n\nJuz seeduje. W jakiej czesci swiata mieszkasz teraz? Pozdrawiam i zycze powodzenia!",
				"added": 1595667070
			}
		],
		"1595401739_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": [
			{
				"comment_id": 35,
				"body": "Przegranstwo i miernota bija na kilometry. Siec p2p jest taka jak wy. Nie seedujesz nic nie dziala, seedujesz to jest swietnie. Nie chce sie miec porzadnego komputera i nauczyc go uzywac no to biegasz jak idiota z kafelka w kieszeni.",
				"added": 1595670338
			}
		]
	},
	"comment_vote": {
		"8_1Kdg21XsxUjDMN2gKJZkTwnahWC4HiBsEG": 1,
		"29_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"14_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": 1,
		"34_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"12_12geqRc1Rut17RTkX3gxMYSujKdUNwP68R": 1,
		"4_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": 1,
		"39_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"3_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": 1,
		"2_1D1UycJ59L35PDCuxKJW1D1sNkKvRoPXEF": 1,
		"23_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"8_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1
	}
}