{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1565989014,
			"title": "Down the Rabbit Hole We Go...",
			"body": "Wonder how many groups can be nested inside each other... If it's infinite, that's scary.",
			"added": 1565989012,
			"parent_topic_uri": "1565986540_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG",
			"type": "group"
		}
	],
	"topic_vote": {
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1565330984_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565699355_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1566515559_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1
	},
	"next_comment_id": 108,
	"comment": {
		"1565261539_19P54y9K3sV4nbe7Cm3yCZfuwxzckti8C1": [
			{
				"comment_id": 1,
				"body": "Just exploring ZeroNet as a new user, seeing how it works, and how to implement and contribute to its network.\nThat and playing Elite Dangerous at 04:00AM when I have to head to work nine hours from now...",
				"added": 1565262797
			},
			{
				"comment_id": 2,
				"body": "> [theosis](#comment_29_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): How is E:D right now? I used to play it a lot when it was released.  [...]\n\nNot bad. I stick to solo play, due to current peer-to-peer mechanics of the game enabling multiplayer shenaniganry, like that Beluga in the mailslot (see https://youtu.be/2jkP7d9j07Y for the story). All in all, it's a nice way to unwind after a long day. Haven't achieved Elite rank in anything yet, but I'm playing it for the enjoyment of it rather than aiming for goals. :)",
				"added": 1565264245
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 3,
				"body": "> [wejehteman](#comment_2_1EJorU3nHcCViXXzD7BkmyJzwgqxqC2Zuv): ...could be an attack where if a botnet shows up with 9000 peers, and your computer connects to 200 of them, then chances are that all 200 connections are the botnet. Then the botnet simply doesn't send you new updates.\n\nWhile I have little to no experience with ZeroNet, this sounds strangely plausible. Yikes.",
				"added": 1565331330
			}
		],
		"1565330984_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 4,
				"body": "That is hilarious. Have an updoot.",
				"added": 1565332075
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 5,
				"body": "> [joebagel](#comment_1_1BF8Uak9sNrxmgyaVYa1waLwe98CG8ogpB): The article itself - https://archive.fo/4vAKm [...]\n\nJust me, or is https://archive.fo unreachable?",
				"added": 1565356024
			},
			{
				"comment_id": 11,
				"body": "> [theosis](#comment_41_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): Most of 8ch people are poltards and retarded boomers who believe in this Qanon nonsence. Not exactly the brightest when it comes to tech.\n\nEhh, I'm not a boomer, but I am pretty new to this.\nI went ahead and enabled \"Tor: Always\" almost immediately after starting.\nAm I doing it right? >.<",
				"added": 1565360121
			},
			{
				"comment_id": 15,
				"body": "> [capitanjack](#comment_5_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk): If you are afraid of (((them))), but its not way of doing it. There is fear prison first.Once you get out of it, switch Tor just to enabled and help improving network by normal p2p connectionsYou can always use VPN as bridge so your ISP eventually wont call you.I hate those sort of phones :^)\n\nYeah, I do want to contribute to the network; I've increased the size limit on a few promising zites.\nThough, as for VPNs, I don't really trust third-party stuff like PIA/etc...\nI only really use a personal VPN to my home router to prevent sniffing of traffic by local network peers at public access points, like at Starbucks, or the public library.",
				"added": 1565360895
			},
			{
				"comment_id": 17,
				"body": "> [theosis](#comment_42_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): The thing is, you can go ahead and use it even without Tor. If you're not doing anything illegal you have nothing to worry about. The fact that your IP is exposed to peers means nothing. They can't reliably connect your ZN identity to your peer IP. It's not illegal to run ZN software. This \"muh exposed IP\" scare is silly.\n\nAwesomesauce. I just kinda enabled it on a whim, since I was (relatively) familiar with onion routing's benefits.",
				"added": 1565361222
			},
			{
				"comment_id": 23,
				"body": "> [capitanjack](#comment_6_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk): To be honest on imageboards that might happens very often.\n\nI kinda assumed that'd eventually happen, which played a part in me enabling it, since while I do want to help seed boards, having to moderate what I seed seemed like a pain. (Gah, run-on sentences.)",
				"added": 1565362642
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 6,
				"body": "I'm... not certain what exactly you're trying to say here... Could you clarify a bit?\nBeing completely honest here: this post sounds like it was made by an AI.",
				"added": 1565359042
			},
			{
				"comment_id": 7,
				"body": "> [tinktinktink](#comment_15_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): He has been posting this retarded crap nonstop on the this website's 08ch thread.Just mute him.\n\nAh, hokeydokes.\nWasn't sure if it was a bot, or the incoherent musings of someone whose primary language isn't English. ^u^",
				"added": 1565359204
			},
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_693_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): don't you have an identity on zeronet ?\"trevorlanera\"\n\nYep. I just started playing around with ZeroNet out of curiosity earlier today.\nWent ahead and created a certificate for my personal use while I learn about it.",
				"added": 1565359400
			},
			{
				"comment_id": 9,
				"body": "Ohhh, I think I see what you were getting at.\nThe centralization of an identity generation system, right? You mean ZeroID?",
				"added": 1565359557
			},
			{
				"comment_id": 10,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_696_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): obviously\n\nGotcha. Was thinking you were talking about the philosophy of identity or something. Sorry.\nBut yeah, I suppose using ZeroID as a central identification is a bit wonky.\nI'd have to learn more about how ZeroID works...\nFrom what I understand thus far about it, it's an optional system that zites can implement for purposes of identity.\nCorrect me if I'm wrong. :P",
				"added": 1565359881
			},
			{
				"comment_id": 12,
				"body": "> [xcape2net](#comment_193_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  If @nofish dies or disappears, I think that ZeroNet would disappear--not really sure at this point.\nAlso, each Zite is owned by someone who has to be able to stop others from modifying their zite.\nAlso, there is the bit-torrent tracker issue.  ZeroNet requires bit-torrent trackers to function.\nThen there is ZeroID centralization.\nThe bottom line for me is that ZeroNet is a combination of centralized and decentralized software.\n\nGotcha. Thanks for the clarifications. :)",
				"added": 1565360454
			},
			{
				"comment_id": 13,
				"body": "Aaaand I completely misunderstood how to format a reply's quote text. XD",
				"added": 1565360518
			},
			{
				"comment_id": 14,
				"body": "> [xcape2net](#comment_194_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): ...you have a 50K limit for posts and comments on ZeroTalk, right?  If @nofish decides not to increase your limit, you are silenced.\n\nWait, what? By 50K, do you mean KB of info, 50K characters, 50K posts?",
				"added": 1565360626
			},
			{
				"comment_id": 16,
				"body": "> [xcape2net](#comment_195_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): A lot of new users get caught by this.  I did.  I mean that you can type 50 kilobytes of text into ZeroTalk before you reach your limit.  Then, or preferably before you hit the limit, you have to email @nofish to get it raised.  How much you have already used is displayed opposite the \"Submit comment\" button.  See it?\n\nOoooh, holy moly. I just glanced over that, assuming it was a character count limit like with Twitter.\nYikes.\nThen again, all the more reason to keep my posts concise. :D",
				"added": 1565360981
			},
			{
				"comment_id": 18,
				"body": "> [xcape2net](#comment_196_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Exactly.  Although, I think @nofish is very lenient.  He hasn't kicked off the OP, yet.  So, I think almost everyone is safe.\n\nGood to hear.\nOn a side note, though... When I click \"Reply,\" that quoted text counts towards my limit, doesn't it?\nShould I make it a practice to trim down quoted text to the relevant parts?",
				"added": 1565361404
			},
			{
				"comment_id": 19,
				"body": "> [xcape2net](#comment_198_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I believe so, but I'm not sure.\n\nAh, yep. Just tested; quoting text does indeed count towards the limit.\nMakes sense though. Exempting quoted text would both create a loophole to bypass the limit and/or increase system load parsing quoted text to differentiate it from OC.",
				"added": 1565361591
			},
			{
				"comment_id": 20,
				"body": "> [qf2ss4t5y3365](#comment_14_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B): No, you just make a new ID. Why the hell would you bother him to raise your limit? This isn't twitter... No blue checkmarks here.\n\nThat's... hmm. Good point. Not sure how @nofish would feel about this becoming the norm.",
				"added": 1565361845
			},
			{
				"comment_id": 21,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_705_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you all talk like zombies like you 'didn't know the answers',sometimes it's funny to see you all 'articulte things'. it reminds me years before 'trying not to see the obvious'.\n\nI think people didn't understand what you meant initially about users having individual identities versus users all utilizing a singular identity.\nKind of like... mmm... I guess the best way to put it would be analogous to the ending of Neon Genesis Evangelion: basically a singularity of identity.\nEveryone basically using a singular identity as a single entity. As if all posts were by the same person.",
				"added": 1565362361
			},
			{
				"comment_id": 22,
				"body": "> [randomshits](#comment_33_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Most who know a discussion will be extensive will often carry or link it over to Unlimit Talk which has a vastly increased posting size. [...]\n\nIs Unlimit Talk considered the #2 place following ZeroTalk?",
				"added": 1565362501
			},
			{
				"comment_id": 24,
				"body": "> [randomshits](#comment_35_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): No, it is nowhere nearly as popular as ZeroTalk.But if you post a link on the ZeroTalk article saying \"Continue the discussion Here\", most people comply\n\nGotcha. Good to know; I'll add that to my seeded sites then. :)",
				"added": 1565362700
			},
			{
				"comment_id": 25,
				"body": "> [qf2ss4t5y3365](#comment_15_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B): they had a psychotic meltdown and started passionately making out with their monitor.\n\nThe mental image of that just gave me the giggles.",
				"added": 1565363050
			},
			{
				"comment_id": 26,
				"body": "> [223556](#comment_60_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): schizos lmao\n\nOhh, be nice, you.",
				"added": 1565363257
			},
			{
				"comment_id": 27,
				"body": "> [xcape2net](#comment_206_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): It's comments like that that have me leaning toward AI.  But maybe you're just playing me.\n\nAh, and now I've got the giggles again.\nSeriously though, I think it's just that he's either not a native English speaker, or just has difficulty with vocalizing what he means.",
				"added": 1565363404
			},
			{
				"comment_id": 28,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_713_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): read more, ancient texts, the response 'are in them'. intelligent people of ancient civilizations 'wrote them', not God. these people 'were all above the intellect', so no i'm not playing with you.\n\nHmm. I think I understand how your vernacular works now.\nKind of like how my inner thoughts work; they're more conceptual than verbal constructions.\nLike how Bumblebee from Transformers speaks, using ideas (encapsulated in soundclips) rather than words.",
				"added": 1565363572
			},
			{
				"comment_id": 29,
				"body": "> [kaffie](#comment_937_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Just to be clear, schizophrenia can impair your use of language, making you sound like you're a non-native speaker. Likewise with the weird phrasing, rants seemingly disconnected from everything, etc. It's bizarre falling down that rabbit hole but still maintaining some sanity.\n\nGood point. I've been trying my darndest to decipher u/h3bhkj5gqz4n3pjm's posts, and respond constructively. :P",
				"added": 1565363725
			},
			{
				"comment_id": 30,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_717_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it means you can and actually function at mutliple levels, intellect being 'one of them'. this body 'is way more complex than people think it is'.\n\nYou mean like Carl Jung's \"Shadow?\"",
				"added": 1565363971
			},
			{
				"comment_id": 31,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_719_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you can 'understand me' but not with the center you're actualling('most of the times') using:https://experiencelife.com/article/healthy-gut-healthy-brain/\n\nHeh, I dunno if the \"healthy gut\" was the right comparison to make, but yeah, I get you. :)",
				"added": 1565364386
			},
			{
				"comment_id": 32,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_720_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the gut is the right center, cerebral death don't imply death\n\nAhh, by center you meant hemisphere, by which you meant the abstract thought/conceptual part of the psyche.\nI gotcha.",
				"added": 1565364516
			},
			{
				"comment_id": 33,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_721_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the images are in the brain, transcription then memorized in it,but the gut is an independant organ, with 'its own reasoning'.\n\nYep yep. I was just initially confused when you said \"healthy gut,\" and assumed you meant something to do with the gastrointestinal microfauna biome. XD\nWas gonna say, my e-coli aren't that sentient. :P",
				"added": 1565364693
			},
			{
				"comment_id": 34,
				"body": "> [xcape2net](#comment_215_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): And the two are connected by a nerve (which I forget the name of), which is why I feel afraid when I'm nauseous.\n\nMmm, the vagus nerve?",
				"added": 1565364769
			},
			{
				"comment_id": 35,
				"body": "> [xcape2net](#comment_216_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Yes.  Thanks.\n\nHigh school biology comes into play at the weirdest times... :/",
				"added": 1565364817
			},
			{
				"comment_id": 36,
				"body": "> [peppermintswirl](#comment_6_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx): https://i.ibb.co/XbdkfHp/unknown.pngConfirmed not a bot, but still hella schizo\n\nOooh, that's an interesting tool. Seems like something that'd be neat as a browser extension.",
				"added": 1565395343
			},
			{
				"comment_id": 37,
				"body": "> [qf2ss4t5y3365](#comment_18_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B): I FOUND IT. Sylvaine was his name and I even found the kopykate post. http://127.0.0.1:43110/big.kopykate.bit/?Video=1521868593_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG\n\nThat was an interesting watch.\nKudos to the creator for putting the effort into it.",
				"added": 1565398380
			}
		],
		"1565457554_1A5NgDyiTqhcBgrm8SuSEhaygTXuc7ogt2": [
			{
				"comment_id": 38,
				"body": "Very well... Just for kicks 'n giggles.",
				"added": 1565457727
			},
			{
				"comment_id": 39,
				"body": "Heh, it's a link to the original Shibe (doge) image on ZeroVoat.",
				"added": 1565458661
			}
		],
		"1565466571_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 40,
				"body": "> [ayra](#comment_2_15Pwu5qSwuLDbQeJPixgirchJGHcHw4ioT): ROM files hosted inside a weird folder structure on a GoDaddy server that advertises a camera lens. Why do I get the feeling that the owner of this website has no idea that the files are there.\n\nMight be a hijacked site, or perhaps its obscurity as a photography site is to throw off copyright notices.\nHowever, I'm confused by the assortment of games in the GBA archive; there's none of the Pokemon games (Ruby, Sapphire, Emerald, FireRed, LeafGreen, etc).\nSomething in the back of my mind is telling me this is an attempt to expose ZeroNet user IPs.",
				"added": 1565475550
			},
			{
				"comment_id": 41,
				"body": "> [ayra](#comment_3_15Pwu5qSwuLDbQeJPixgirchJGHcHw4ioT): Doing illegal things (publishing roms) to get a few IP addresses sounds stupid. Especially because there's a button that copies all IPs of participating members of a site to the clipboard.\n\nMmm. Good point. Though I don't know enough about ZeroNet yet to dispute that the button actually exposes real addresses of tor-only users.\nI'm just weirded out by the relative disparity with most popular packs of ROMs; so many of the most popular ROMs aren't included...\nJust doesn't feel right... ^u^",
				"added": 1565476255
			},
			{
				"comment_id": 42,
				"body": "> [steeljacket](#comment_6_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a): Hey can we uuencode shit here? Can you post the popular pokemon ones?\n\nI'd probably just DL them from a clearnet torrent, then reseed them on ZeroUp, then post the ZeroUp link.",
				"added": 1565493049
			}
		],
		"1565575545_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 43,
				"body": "ABC\nIt's easy as 123.\nAs simple as do re mi.\nBaby, P2P.",
				"added": 1565576708
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 44,
				"body": "Heh, this gave me a chuckle.\nTo be honest, I'd like a verified tag myself, if just for kicks 'n giggles.\n\nBut you raise a good point... How would one go about establishing a \"verified\" tag on a decentralized platform?\nFrom what I understand, the concept of a \"verified\" identity is based on a centralized authority (Facebook/Twitter/etc) granting recognition that an online identity is who they claim to be in real life.\nThat \"verification\" is reliant on the trustworthiness and reputation of the central, verifying authority.\n\nOn a decentralized platform, this is nigh impossible, without a central authority to recognize an identity as \"you.\"\nI suppose the closest you could come to \"verification\" here is to somehow sign your ZeroNet identity with a private key, and post the public key to a post on an external, central authority like Twitter.\nBasically, using a \"verified\" account on something like Twitter to claim that your ZeroNet identity is indeed you.\n\n...I dunno. I'm rambling; I'm no expert when it comes to cryptography, nor cyber philosophy.",
				"added": 1565577847
			},
			{
				"comment_id": 45,
				"body": "> [brianhanson2nd](#comment_36_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): ...cuckbook and twatter.\n\nThat's that. Renaming my bookmark for Twitter to \"Twatter.\" :D",
				"added": 1565577938
			}
		],
		"1565649984_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 46,
				"body": "> [styromaniac](#comment_971_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): We don't need scaredy-normies anyway.\n\n> [mg0](#comment_93_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Don't be like that, we need all the people until we got many enough.\n\nWhile I understand how styro feels, mg0 is correct; we need as many peers as we can get to strengthen ZeroNet's infrastructure.",
				"added": 1565652394
			}
		],
		"1565819093_1J6JfEeFfwmkogEHaMgs8MohbzpzMyQUqv": [
			{
				"comment_id": 47,
				"body": "Am I missing something here?\nI'm seeing just a bunch of unicode glyphs that don't properly register.\n(Squares with numbers in them.)",
				"added": 1565819349
			},
			{
				"comment_id": 48,
				"body": "> [konidunul](#comment_2_1J6JfEeFfwmkogEHaMgs8MohbzpzMyQUqv): Theese?\n\nAhh, I see.\nI saw them as glyphs because I was using Tor browser. Switched over to Chrome, and they display properly. :D",
				"added": 1565819532
			}
		],
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 49,
				"body": "Ah, good walkthrough.\nThanks for making the time to post this.",
				"added": 1565922051
			},
			{
				"comment_id": 83,
				"body": "> [trevorlaneray](#comment_82_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Testing line break here.Below is a normal paragraph break.End test.\n\nAaand pressing Shift+Enter doesn't perform a line break.\n_sigh..._\n\nEdit:\n> [aspidochelone](#comment_86_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Funny thing is, with all the editing, every post is a sandbox. :)\nHmm. Good point. Will have to make better use of each post, instead of making new ones to correct myself.",
				"added": 1565981128
			}
		],
		"1565951931_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3": [
			{
				"comment_id": 50,
				"body": "> [unadu](#comment_23_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): ...you could move/delete the data/users.json file in the zeronet folder. This file holds your IDs. If its gone, you can create new IDs.\n\nHmm...\nIs there a way to correctly edit the users.json file to manually delete/add your identities?\n(Like, is there any documentation on the layout & formatting of the users.json file?)\nI mean, if so, I'd like to understand how, then write an AutoHotKey script GUI to parse users.json and allow management of identities.\nThis way, I could avoid resorting to cookies (blegh) for identity management.\nIf I were to enable the multiuser plugin, I'm assuming this would effectively replace the functionality of the users.json file. Once I do, wouldn't this mean I'd have a difficult time porting those cookies back into the users.json file?\nCookies aren't exactly the way I'd like to manage identities, since they're easily (irrevocably) deleted during common cleaning tasks (i.e.: CCleaner & etc).",
				"added": 1565952783
			},
			{
				"comment_id": 51,
				"body": "> [littlepaw](#comment_4_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): I have managed to remove the unneeded identities just by editing the users.json file you mentioned. [...]\n\nWait, if the multiuser plugin uses cookies to manage identities, does it export identities from users.json to cookies, but not use the users.json file once you start using it?\nOr does it keep users.json file up-to-date with the cookie-based identities you create and manage?",
				"added": 1565953181
			},
			{
				"comment_id": 52,
				"body": "> [littlepaw](#comment_5_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): ...One would hope it keeps the users.json updated, but that may not be the case...\n\nHmm. I'll have to test this.\nI'll back up users.json, then start with a blank users.json.\nThen I'll enable the multiuser plugin.\nThen, I'll try creating a new identity with the multiuser plugin as the identity manager.\nI could then diff the changes between a brand new (blank-ish) users.json, and the version of it after identites have been created with multiuser.\nThis should, in theory, show if the multiuser plugin actually acts as a bridge between the cookie-based identities, and the users.json file, updating users.json when there are new identities created.\nCan't hurt to experiment, right? :P",
				"added": 1565953646
			},
			{
				"comment_id": 53,
				"body": "> [unadu](#comment_25_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): ...it ignored the identities from users.json completely and didn't update it.\n> [gitcenter](#comment_569_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): What Multiuser plugin does is create several identities in users.json.\n\n... I'm so confused right now. ^u^",
				"added": 1565953783
			},
			{
				"comment_id": 54,
				"body": "> [unadu](#comment_26_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): well, my experience... was that i lost all identities and that it wouldn't remember them and that i couldn't even turn off the plugin...\n\nOof. Yikes.\nSounds like I'm better off just writing an AHK script for simple GUI management of identities in users.json.\n\n> [littlepaw](#comment_6_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): ...what does the \"u\" in ^u^ mean? Is it the mouth or the nose?\n\nHonestly, I've no idea. Probably just an obscure uwu/owo'ism; I always assumed it was a smile. :P",
				"added": 1565954108
			},
			{
				"comment_id": 55,
				"body": "> [gitcenter](#comment_571_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Multiuser plugin was made for ZeroNet profixes (e.g.: zn.amorgan.xyz)\nWait, what's a profix? Like, a prefix? To what? (Sorry I'm such a noob...)\n> [gitcenter](#comment_571_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I believe nofish is currently working on making a simplier UI for user management.\nThis is great to hear! Though... I do wish there was documentation on the layout & formatting of users.json.\nIf I knew more about it, it'd make writing this script easier...\n\n> [unadu](#comment_27_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): ...it does make sense that a plugin that uses cookies would not work very well if you don't save cookies.\nYeah, especially with the Tor browser being the recommended browser to use with ZeroNet...",
				"added": 1565954458
			},
			{
				"comment_id": 56,
				"body": "> [gitcenter](#comment_573_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That was a typo, sorry; I meant to say a \"proxy\".\nOhhhh. Gotcha.",
				"added": 1565954511
			},
			{
				"comment_id": 57,
				"body": "> [gitcenter](#comment_574_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Here is a simple layout:\nHmm... Is there anything important other than the \"certs\" section?\nDoes the \"sites\" section have anything identity-related that is important to back up?\nIf all I really want to do is manage my identities, do I need to pay attention to anything other than the \"certs\" section?\n```\n{\n    \"master_address1\": {\n        \"master_seed\": \"master_seed1\",\n        \"sites\": ...\n    },\n}\n```",
				"added": 1565954947
			},
			{
				"comment_id": 58,
				"body": "> [trevorlaneray](#comment_57_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Does the \"sites\" section have anything identity-related that is important to back up?\nFor example, in the \"sites\" section, there's \"**auth_address**\" and \"**auth_privatekey**\" under each of the sites.\nAre these my personal keys unique to each site that I should take care to manage?\nWould I lose anything on those sites if I were to delete them from users.json?\n```\n{\n \"Sk2Rx4IB8gTSZBgm7791z1VRW4Xdb2k04c\": {\n  \"sites\": {\n    \"1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1\": {\n    \"auth_address\": \"WNrjiGQEEG2cFcKN5xRot68FCADIlt6x37\",\n    \"auth_privatekey\": \"6cZ32TMYWcW8t16o65awfImKfvZVcWXrDFeaFxdye13NrZvDriE\",\n    \"cert\": \"zeroid.bit\"\n   }\n  }\n }\n}\n```\n(And yes, I generated some random [0-9A-Za-z] strings above, since I've no idea if they're safe to post openly.)",
				"added": 1565959957
			},
			{
				"comment_id": 63,
				"body": "> [gitcenter](#comment_579_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ZeroNet just generates them randomly; but I wouldn't recommend deleting them, for example, you should backup auth_address and auth_privatekey on ZeroID site if you have a ZeroID registered.\nSolid info; good to know.\nI was thinking about parsing through the \"sites\" section to focus on just those fields, allowing for per-site identity management. I'm guessing the rest of each site's section is just site-specific preferences like themes/etc.\n\nTrying to piece together what functionality I want to implement in my GUI script. What I've got in mind so far:\n- Certificate identity management. (The keys in the \"certs\" section.)\n- Site-specific identity management. (Allowing for deletion of site **auth_address** and **auth_privatekey** if associated with main certificate identity. That is, deleting a site's **auth_address** and **auth_privatekey** if the identity used on that site is deleted.)\n- Management of site preferences. (Allowing you to clear a site's customizations, but keep identities used on it.)\n\nI'm really just kind of dicking around with it for kicks 'n giggles. :P",
				"added": 1565964454
			},
			{
				"comment_id": 64,
				"body": "> [gitcenter](#comment_580_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Sounds great! I'd like to use that.\nI'll post a public copy of the script's source code on [NullPaste](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz) once I put the finishing touches on it.\nIt'll be interesting to see others' edits & takes on the idea of a users.json-based ID management.",
				"added": 1565965781
			},
			{
				"comment_id": 76,
				"body": "> [anonymouslogin](#comment_391_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): losers\n> [publicid](#comment_23_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m): losers\n> [anonymouslogin](#comment_392_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): losers\n> [publicid](#comment_24_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m): losers\nYes. Yes we are. ^u^\nBut at least we're having fun with it.",
				"added": 1565973290
			}
		],
		"1565922890_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 59,
				"body": "> [joalmo](#comment_25_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL): (((science agrees)))You're talking about sociology, which is not really science.\nEhhh, I dunno. Science is a method of thought. A way of approaching an idea and testing ideas.\nSocio**logy**, essentially the \"study of society,\" can be approached in a scientific method.\nI guess you mean to say that studying society & social aspects isn't a science in and of itself, per se?\nI can understand that viewpoint.\nI'd be confused if you said that social structures can't be studied in a scientific method. :D",
				"added": 1565960935
			}
		],
		"1565922993_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 60,
				"body": "> [rusnoob1](#comment_19_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): Why?\nWell, it's not really feasible to moderate threads, other than preventing your node from propagating troll/spam posts.\nOne person can't claim authoritative power over a thread to silence posts.\nThat being the case, we can't do much to keep threads civil & organized.\nThis group, being named \"Normie Safe Space,\" is likely to attract the kind of attention & activity it strives to avoid.",
				"added": 1565961211
			},
			{
				"comment_id": 71,
				"body": "> [xcape2net](#comment_316_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Correct me if I'm wrong, but my understanding is that the person who cloned the zite can delete anything they like.\nI know comparatively nothing about ZeroNet's technical side, but from what I've garnered, it seems like all downloaded viewed/stored content is permanently clientside until the client deletes it.\n**Don't get me wrong, I could be totally incorrect here.** I just have a hard time believing such a great decentralized platform would allow such a hierarchical vulnerability as a tyrannical zite cloner deleting their zite's contents, effectively remotely deleting content from seeders' nodes.\nIt would completely neuter the very idea it strives to accomplish...\nI mean, sure, individuals could simply clone a zite for archival purposes as a contingency for if a zite's clone owner went bananas and started censoring other users' content posted to it.\n*sigh*... I dunno. I'll have to read into the documentation a bit more. I'm still a total noob to this.",
				"added": 1565969955
			},
			{
				"comment_id": 73,
				"body": "> [xcape2net](#comment_317_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): There have been several discussions here where people are concerned that nofish has too much control of ZeroNet because it is more centralized than it first appears.\nSaw those discussions earlier, and went back to read through them again. Seems you're right...\nI had assumed that when someone deletes their own content, it would be marked as \"deleted,\" but still present on other nodes. (Kinda like Wikipedia's page history, where previous content would be versioned, and only the most up-to-date version shown.)\nIf this isn't the case, then yeah... that's pretty worrying. ~_~",
				"added": 1565971586
			}
		],
		"1565960124_1GmeqFDH3CreaouRZZeg3WuC3JY1mRmXmr": [
			{
				"comment_id": 61,
				"body": "Yowza, that's a hefty PDF.\nMakes for some interesting reading though; it's an intriguing window into the minds of the person/groups that authored it.\nThough... on page 10, paragraph 3:\n>All politically related “information” that appears in the mass media today is designed to serve a purpose.\nI wonder what the author's/authors' purpose is of the publishing of these documents' ideas.\nGuess it'll make for some lightweight reading whilst on the toilet. ^u^",
				"added": 1565962049
			},
			{
				"comment_id": 62,
				"body": "> [ytkhgf](#comment_3_1GmeqFDH3CreaouRZZeg3WuC3JY1mRmXmr): Israel's government-sponsored Yad Vashem Holocaust Memorial Center started putting Amazon under pressure to remove any and all material that questions the orthodox Holocaust narrative.\"\nHmm. Not sure how I feel about a government-backed organization pushing to censor the views and ideas of others, regardless of how reprehensible they may be.\nI mean, yeah, I completely understand YVHMC's feelings toward this kind of material; it'd certainly be offensive to them. And Amazon, being a private company, is certainly within their right to choose the material available on their platform.\nThe documents' authors are completely within their right to voice their views, so long as it's not crossing into illegal territory (calls to violence/etc).\nMragh. This kind of shenaniganry is beyond my wherewithal to even debate.\nWhile it's probably not something I should even waste my time reading, I would like to know that such viewpoints are able to be at least heard by those that are interested in analyzing those ideas. Freedom of speech and whatnot.",
				"added": 1565962870
			}
		],
		"1565966684_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 65,
				"body": "Whoof. Lots of good advice in there, on a cursory glance.\nPersonally however, while I am a ProtonMail user, I'm still hesitant to use ProtonVPN.\nStill, ProtonVPN is indeed a better option than most VPN providers.",
				"added": 1565967019
			},
			{
				"comment_id": 66,
				"body": "> [ploplesuper](#comment_2_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD): Basically, as i know,  the two best VPN are NordVPN and ProtonVPN i use the second one !\nMmm. If I ever were to use a VPN (I usually don't), ProtonVPN would be my first choice.\nI've seen some pretty convincing anecdotal evidence that NordVPN/PIA and the like actually cave to government pressure. I'd be way more comfortable rolling with a VPN provider that takes the unequivocal stance of protecting its users at any cost. (Similar to Lavabit's admirable actions back in 2013.)",
				"added": 1565967315
			},
			{
				"comment_id": 67,
				"body": "> [ploplesuper](#comment_3_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD): ...with a few contributions from the communities it could become very powerful for free speech.\nIndeed. Looks pretty promising. I actually wanted to contribute to the IPFS party, but wasn't experienced enough in the ancillary security practices to tighten it down for security and long-term data integrity.\nMaybe someday in the future I'll hop on the bandwagon, but for now, the plug-and-play ease of ZeroNet's deployment has me hooked.\nThough, I'm somewhat concerned about fragmentation of decentralized systems' implementation in the long run.\nWith so many different ways of going about it, it's hard to decide on which one to use on a daily basis.\nPerhaps if each system were more purpose-oriented, it'd make sense for each system to use it's own framework.\nBut with so many systems sharing common functionalities (boards/chans/etc), it's likely  to end up with the same issue that streaming services face (Netflix/Hulu/HBO Now/etc). If too many start competing with each other for the same userbase's desired functions, it effectively divides that userbase into semi-centralized bubbles.\nHate for the ecosystem to head in the direction of having to crosspost between platforms... XD",
				"added": 1565968226
			},
			{
				"comment_id": 68,
				"body": "> [ploplesuper](#comment_4_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD): Actually BlockChan plan to implement a research toolbar.\nOooh, that's good to hear.",
				"added": 1565968680
			},
			{
				"comment_id": 70,
				"body": "> [xlk](#comment_64_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): What the hell is this, ProtonVPN propaganda? I feel I'm being sold a time-share!\nHeh, I feel ya. We are kinda coming across as shills for their VPN service.\nThat being said, their mission statement and stance on privacy is pretty commendable.\nI will say, however, ProtonMail does still have some issues. (Javascript for clientside encryption is still served up by ProtonMail servers, and thus cannot be trusted.)\nThey've still got a long way to go with the work on their services, but all in all, I've no reason (yet) not to trust their promise to protect their userbase.",
				"added": 1565969350
			},
			{
				"comment_id": 72,
				"body": "> [xlk](#comment_65_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): ...I suspect you are a federal agent, journalist, or some other person that is here in an official capacity.\nAhhhh, god, I've got the giggles again. Yeah, no, I'm just a script-kiddy computer enthusiast.\n> [xlk](#comment_65_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): ...the types of comments one would make if they knew they were to be subject to review.\nYeah, to be fair, I'm a bit careful with what I say online. Not only to keep things civil in an otherwise unmoderateable platform, but also because clarity and conciseness helps to keep the dialectics of discussions from being derailed by misunderstandings.\nThat, and I'm a bit of a grammar freak. Albeit not an expert on English etymology, and nearly failing high school English class due to a late essay, I did pay attention when it came to writing/sentence structure/etc. You probably know those textbooks on how to write a narrative (introduction, rising action, climax, resolution, etc). I halfheartedly skimmed through them, but it seems they've stuck with me.\n(It's a bit tough sometimes though, because some users have a mental difficulty with putting ideas into words. I actually encountered a user earlier that phrased things in... I dunno, more of a conceptual manner, rather than a cohesive, understandable structure. It kinda forces you into a heuristically disjointed thought process, in order to decode what they mean to say. In many cases, it's just the case that English isn't their main language. After conversing with that kind of person for a while, I find myself having to switch mental gears back to regular thinking.)",
				"added": 1565971160
			},
			{
				"comment_id": 74,
				"body": "> [ploplesuper](#comment_5_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD): Completly forgot that this kind of decentralized topics is full of Paranoaic folks :D\nHeh, that may be the case, but a certain measure of paranoia is good. Can't hurt to be careful.\nThat being said, just take care not to go full tinfoil-hat; it's not healthy to stress oneself out over stuff that's not in your threat model. <3",
				"added": 1565971821
			},
			{
				"comment_id": 75,
				"body": "> [xlk](#comment_66_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): That's pretty trusting; putting all of your personal information out there like that.\nYeahhh, I'm probably not following best practices having that up.\nI was really just toying around with VPS hosting and webserver management/web design.\nI initially tried doing a PHP based site, but found static HTML5 was more my speed.\nSomeday I'll actually use a personal mail server, but I'm taking it in baby steps.\nEDIT: Edited it to only show my hometown, and added my ZeroMail address to the contact method list. :P",
				"added": 1565972334
			}
		],
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 69,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_764_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): something new to you ?\nI guess there's a first time for everyone catching up to the news as of late. ¯\\_(ツ)_/¯\n\nBut yeah, it does pose a non-trivial threat to privacy of everyone, regardless of if they're a Ring user or not.\nInstead of the Kafkaesque poles bristling with cameras on every street corner, the cameras are watching the front yards of homes, and anyone that passes by.\n(But I digress; many if not most Ring users' surveillance extends only as far as the front walkway, and doesn't extend to capturing the public walkways/streets.)",
				"added": 1565969067
			},
			{
				"comment_id": 79,
				"body": "Ohey, good to see you again, h3b.\n> [h3bhkj5gqz4n3pjm](#comment_766_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): ...people should study more this reality which is very different that what it is taught.\nAgreed; the idiom \"ignorance is bliss\" is rather apropos.\nI can forgive ignorance in and of itself, since no one can know everything; unwillingness to educate oneself, however, really grates on my nerves. ^u^",
				"added": 1565979899
			},
			{
				"comment_id": 91,
				"body": "> [myriri](#comment_38_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): So would these cameras be fucked by IR LEDs? I recall that being a good trick to deal with ubiquitous surveillance.\nOnly to the point that most optical sensors usually don't have a good range of adjusting exposure for directed bright IR (albeit \"intensity\" would be more apropos, since \"brightness\" _usually_ refers to EMR in the visible spectrum).\nSilicon-based CMOS and CCD sensors can pick up on radiation into the near-infrared.\nIn order for a RING camera to be able to see at night with no visible light, it has to use IR-emitting LEDs to illuminate the area, and pick up on that infrared light with its sensor.\nBasically, in order for a CMOS/CCD sensor to be impervious to aforementioned methods of surveillance blocking, it would have to make itself blind at night, by blocking LED-emitted IR wavelengths.\nIf I were to theoretically manufacture a day/night security camera, I'd want it to be able to switch to UV as an alternate illumination method if it detected overexposure in one of those wavelengths.\nBut then that could be circumvented by someone using _both_ IR and UV LEDs, forcing the design of the camera to resort to triggering porch lights or something as a last-ditch effort to illuminate the area to properly capture footage.\n\nTL;DR: Yes. To be completely sure, outfitting oneself with high-intensity IR/UV LEDs would be a viable method of blinding a camera without damaging it. Lasers can blind cameras as well, however, **I do not recommend doing so**, since they can actually permanently damage the CMOS/CCD sensor, and you could be held liable for property damage if used.",
				"added": 1566135070
			},
			{
				"comment_id": 92,
				"body": "> [myriri](#comment_39_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): Not tried this in years so unsure if it still works.\nI'd go for nothing less than a full 360° array of LEDs to be safe.\nThinking more on it, I wonder if the IR emission of the camera's own LEDs could be used against it by employing retroreflectors. Probably not... would be interesting to test.",
				"added": 1566137475
			},
			{
				"comment_id": 93,
				"body": "> [myriri](#comment_40_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): ...fitted onto an american style baseball cap.\nHmm. There's an abundance of caps that have regular old LED lights on the rim for lighting the area in front of you at night... Could be easy to replace those LEDs with IR ones, and even add more, keeping most of the built-in circuitry, then upgrading the battery to power the array in parallel so as to handle the extra load. :D",
				"added": 1566137755
			},
			{
				"comment_id": 94,
				"body": "> [myriri](#comment_41_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): They tend to mount them under the brim of the hat making it a bit less useful in this context.\nYeah, that's true...\nMeh. While being a fun DIY project, it'd probably just be easier to go for RING camera's true weakness: Wi-Fi jammers and deauthers if you wanted to avoid being surveilled entirely (i.e.: stopping the video recording from around the corner before crossing its line of sight). Of course, this would be pointless if the camera makers thought to implement a local cache of footage for cases like this.\nBut I digress; jamming radio frequencies and using deauthors is considered illegal, so it's not really a good option.",
				"added": 1566138303
			},
			{
				"comment_id": 95,
				"body": "> [myriri](#comment_42_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): Ehhh de-authers are a legal grey area to some extent.\nThat's... hmm. I guess so. I mean, it's not \"jamming\" per se, but actual data signals.\nMight see new legislation on the practice in the near future, seeing how proliferous they've become.\n(See [Maltronics](https://maltronics.com)' lineup of devices.)",
				"added": 1566139407
			}
		],
		"1565977255_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 77,
				"body": "Bwuhhh? Why would 21.7MB be too big to sign? Who chose 10.5MB as the limit?\nSounds like a design flaw to me...",
				"added": 1565977409
			},
			{
				"comment_id": 80,
				"body": "> [gitcenter](#comment_583_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Just increase the limit in the sidebar.\nWait, it's that simple? Yowza.\nI thought that would fix it, but then overthought it, assuming it couldn't be such a straightforward fix.",
				"added": 1565980033
			},
			{
				"comment_id": 81,
				"body": "> [crazylime](#comment_109_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): ...unless the user gets a nice prompt when they first visit the site, this can be an issue.\nOuch. Might have to post a note next to wherever you link to the site, notifying users to bump up page size limit immediately upon visiting the site. (At least, until a workaround can be found.)",
				"added": 1565980475
			},
			{
				"comment_id": 84,
				"body": "Speaking of content sizes, I'm running up against my ZeroTalk size quota.\nCurrently sitting at 44.4K/50K used, as of this post.\nIt says to contact nofish to raise my limit, but I don't want to bother them with something so trivial...\nI read somewhere that they made a script to do this automatically when someone gets close to their limit; should I trust that this is the case, or bite the bullet and contact nofish?",
				"added": 1565981491
			},
			{
				"comment_id": 85,
				"body": "> [nickwa](#comment_369_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): If you want to change admin from nofish to you, go to your site's main directories content.json, and change this.\nWait, whuuuut?\nWe can increase our own post size quota? **_Mind. Blown._**\n...Would this increase it just for me, clientside? Would others be able to see posts I make after I exceed ZeroTalk's default 50KB?",
				"added": 1565982485
			},
			{
				"comment_id": 86,
				"body": "> [crazylime](#comment_110_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n): ...there is no data/users yet...\nBumped up the zite size limit to 256MB for kicks 'n giggles.\nJust tried to create a thread on ZT Zite Dev, in order to trigger the creation of a data/users folder.\n(At least, I assume that's what you meant.)\nI get this weird error though:\n> \"File write error: Forbidden, you can only modify your own files\"",
				"added": 1565983022
			},
			{
				"comment_id": 87,
				"body": "> [nickwa](#comment_372_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Have you tried changing \"cloned_from\"...in the main directory to another ZeroTalk clone, and upgrading the code? Might make a content.json, not sure.\nInteresting. I'll try that.",
				"added": 1565983283
			},
			{
				"comment_id": 88,
				"body": "> [gitcenter](#comment_585_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I think trevorlaneray was saying that he has posted too much on Talk.ZeroNetwork.bit\nEyyup.\n\n> [nickwa](#comment_378_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): If you want to up your limit on ZeroTalk, you need to contact nofish. There is no other way.\nYeah, seems so... Tried editing content.json to no avail. Didn't change my limit (which is now at 46.3K/50K).\nGuess I'll ask nofish now, while I still have a smidge of room.",
				"added": 1565985079
			}
		],
		"1565927048_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 78,
				"body": "> [nvhgfd7856f8](#comment_9_12KbcTzaEjQyNsWtKV7JSXyE8eJNRuj8EP): Wait... Is this what you did > ?\nIf you're wondering how to format posted text, pseudonymity made a decent guide [here](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM/Lets+get+formmatting).",
				"added": 1565979182
			},
			{
				"comment_id": 96,
				"body": "> [pseudonymity](#comment_60_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM): It ain't a triforce if its not perfect.\nFTFY:\n          ▲\n▲  ▲",
				"added": 1566141108
			}
		],
		"1565986427_1A1JcKDgksT5pQJoSo7g1P1cC9kAKvG93m": [
			{
				"comment_id": 89,
				"body": "How far down this groupception rabbit hole can we go?",
				"added": 1565988672
			}
		],
		"1566020351_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 90,
				"body": "_cough_, _cough_... BITCONNNEEEEEEEEEECT!\n(I kid.)",
				"added": 1566022206
			}
		],
		"1566141272_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 97,
				"body": "Whoo, good eye. I wouldn't have caught that.\nNo idea... Probably something @nofish used a snippet from?",
				"added": 1566141679
			}
		],
		"1566141722_12wsdvQbd5L9bTBKXGgYazbFcHNegJUNfG": [
			{
				"comment_id": 98,
				"body": "Have you looked through the [ZeroSites photo & image](http://127.0.0.1:43110/Sites.ZeroNetwork.bit/?Category:6:Video+Image) section?",
				"added": 1566142109
			}
		],
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": [
			{
				"comment_id": 99,
				"body": "I'm doing fine.\nA bit stressed out, since my work has me scheduled for <20h this week.\nBeing the sole source of income for my household (supporting disabled parents), filial obligation has me on edge.\nDoing my best to avoid existential crisis; spending my days pouring hours into video games and tinkering with ZeroNet.",
				"added": 1566363752
			},
			{
				"comment_id": 100,
				"body": "> [publicality](#comment_22_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): ...are you someone that goes with the name that starts with \"G\" for in game name? :3\nMmm, none of my ingame names start with G. I almost always just go by my main handle, same as here.",
				"added": 1566387295
			},
			{
				"comment_id": 101,
				"body": "> [watteau](#comment_91_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): That is really tough. Can anybody else help you?\nNaw, if anything, the onus is upon me to improve my income.\nI wouldn't *dream* of asking for handouts from relatives; I'm not that shameless. :D\nI'm probably just going about it in the wrong way.\nMy last three weeks' work schedule had me on for 12, 14, and now 12 hours. (I get paid ~$12.50/h.)\nSuffice it to say, I'll probably have to turn to selling some of my computer hardware to meet bills' due dates.\n\nI've been wanting to find a second job, but with my current workplace, I'm an available-on-demand employee.\nMeaning that if there's an influx of tasks at the workplace, I can be called in on a day I'm not scheduled for.\nThis presents the problem of finding a second job where my schedule is flexible enough to work with my first job's.\n\nNow yes, the question of \"why not just find a different, full-time job\" has crossed my mind.\nThere is a local PC repair shop *just down the road* from where I live.\nI _really_ wanted to work there, as the owner is one of the nicest guys you'll ever meet, with a strong business ethic.\nProblem is, with a small shop like that, it might end up with there not being enough revenue to justify having me as an additional employee. (The shop currently has two employees at the location, with the owner there most days.)\n\n_deep sigh_\n\nI dunno. Maybe I'm overthinking it.\nI'm probably being overly-picky about it, costing myself the opportunity of a full-time position by only taking jobs where I would be comfortable with the business practices.",
				"added": 1566545031
			},
			{
				"comment_id": 102,
				"body": "> [zhetik](#comment_6_1LPwiAHM9fBUSUR5iQNVizdVMniKhC11ju): The police called me last night and want me to come over to the station. I THINK IT'S A TRAP!!!\nProbably is not a trap, per se, but more likely a scam.\nFind your local police department's phone number, and check with them to see if the person that called you is part of their department.\n\nIn any case, try to cooperate, but *don't forget* that you have the undeniable right to maintain silence.\nYou don't *have* to answer any of their questions; you have the right to not self-incriminate.\nIf you do visit the police department, do so only for the purpose of finding out why you were called there.\nIf you're not being detained, you have the right to leave at any time.\nBefore you leave, bring a written copy of your Miranda rights, and read over it. You need to be familiar with them.\n\nIn the vast majority of cases, police are there to protect and serve.\nGive them the benefit of the doubt, and that respect will be reciprocated. :)",
				"added": 1566545470
			}
		],
		"1567752163_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 103,
				"body": "How many characters you need? I could run vanitygen for ya on my computers.\nGenerated a fairly short one for ya; sent its address & privkey via ZeroMail.\nJust keep in mind that if you have someone else help you out by contributing compute power, you have to trust that they're deleting their copy of the private key after consigning their computed result. :P",
				"added": 1567757111
			},
			{
				"comment_id": 105,
				"body": "> [gitcenter](#comment_956_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ...a way of not revealing the private key to the person who computes the private key.\n\nI think you're referring to oclvanitygen's functions. :)\nYep.",
				"added": 1567789520
			}
		],
		"1567774655_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 104,
				"body": "I'm no expert, but that sounds about right.\nFairly simple enough, straightforward way to force resolution of the issue.\nHonestly though, dunno why not being able to delete one's own site is a thing.",
				"added": 1567776979
			}
		],
		"1624135580_1FvnwahjrXUdDfwfKtA16WL1UoqeeZKxfH": [
			{
				"comment_id": 106,
				"body": "I'd recommend it as well, but making sure to inform people what their use case's applicability would be. For people wanting privacy, they'd have to be aware of the implications of IP exposure, metadata, identity isolation between sites, etc. For people casually browsing, I'd have to make sure they understand the legal risks of P2P distribution of... less-than-tasteful sites' content.\nBut if you're looking to spread it en-masse, be careful. People might jump on board without fully understanding it.\nOn a side it, where's nofish?",
				"added": 1624149318
			}
		],
		"1623820238_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2": [
			{
				"comment_id": 107,
				"body": "Mmm... Is this in retrospect of the ProPublica article that came out on June 8th?\n(https://www.propublica.org/article/the-secret-irs-files-trove-of-never-before-seen-records-reveal-how-the-wealthiest-avoid-income-tax)",
				"added": 1624157185
			}
		]
	},
	"comment_vote": {
		"3_1EJorU3nHcCViXXzD7BkmyJzwgqxqC2Zuv": 1,
		"5_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe": 1,
		"11_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"937_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"16_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"15_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"938_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"217_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"18_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"5_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"815_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"36_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"33_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp": 1,
		"1_1HSJXS26WAFxab3etLidavpj5zki3bC1Pm": 1,
		"49_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"67_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"76_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": 1,
		"1013_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"126_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"574_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"579_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"4_14YF6gMYCfUxtez1sJ8btUkD9u8Q4P6h9H": 1,
		"373_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"4_1A1iSrQ5HAds4kEYBNauMHgtDHFbe69hmy": 1,
		"597_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"22_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw": 1,
		"1_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": 1,
		"13_1C5WofUXvg54BgL9AiS2Mqdq3erQBGogXB": 1,
		"43_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"1_1KAAapzmQubR3wAZ1brewkZZz3ycBhuTsA": 1,
		"130_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"10_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"401_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"13_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"2_1AnyDvAnog1HqXEA4T8VARmoEcvLkjANEb": 1,
		"166_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"7_1LS3ur69MC9WP8UMjAHCWYdfopv39kEfaJ": 1,
		"3_1FvnwahjrXUdDfwfKtA16WL1UoqeeZKxfH": 1
	}
}