{
	"next_post_id": 4,
	"next_comment_id": 2,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "CoinCloudGuy",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "I have created CoinCloud, a program that allows you, to up and download files to and from the Bitcoin-blockchain.\nLink(Git Center):\nhttp://127.0.0.1:43110/126KYGEVcPaw9u7NKA6ZxqBUgFjGxqpF15",
	"post": [
		{
			"post_id": 1,
			"date_added": 1524324734,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1524326533,
			"body": "I've written a program, that allows anyone, to upload any file to and download any file from the Bitcoin-blockchain. Files that are uploaded by this program cannot ever be deleted, unless the entire Bitcoin currency vanishes. So basically: As long as Bitcoin exists, your file will stay online/be available.\nDownloading any files is absolutely free, while the upload of files unfortunately does cost money(due to the design of the Bitcoin-blockchain).\nDownload and further information:\n-(Git Center) http://127.0.0.1:43110/126KYGEVcPaw9u7NKA6ZxqBUgFjGxqpF15\nAlternative (clearnet) links:\n-(Github) https://github.com/CoinCloudGuy/CoinCloud\n-(Gitgud) https://gitgud.io/CoinCloudGuy/CoinCloud",
			"date_added": 1524326531
		},
		{
			"post_id": 1526132996,
			"body": "Here is an image, that explains how to use the CoinCloudUploader and the CoinCloudDownloader. It also contains both programs and their source code in the Cornelia-format. That way you can easily share it on platforms like this. \n\nEDIT: Unfortunately, the image compression here, makes it barely possible to read anything and also made the embedded files unusable... However, you can still download and view them on the sites, I mentioned, below.\n\nThe image, both programs and further explanations can be found here: \n(Git Center) http://127.0.0.1:43110/126KYGEVcPaw9u7NKA6ZxqBUgFjGxqpF15\nor on these clearnet links:\n-(Github) https://github.com/CoinCloudGuy/CoinCloud\n-(Gitgud) https://gitgud.io/CoinCloudGuy/CoinCloud",
			"date_added": 1526132993,
			"meta": "{\"img\":\"900,404,bccabbab9bbbbac9bbccccdcccaddddee9aa,00011234405066789A655066986660BBB1121B11\"}"
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "The html-canvas is used, to generate the blurry image thumbnails, the Tor browser bundle will warn you, if any website in general, tries to access the canvas element. Because it is the only(I think) way to create images, in pure javascript/html, it is used by ZeroMe. Access to the canvas could be used to do something called \"canvas fingerprinting\"(-attack), which is a way of tracking/identifying you. So no worries.",
			"post_uri": "1RWL1R7ok78qpQpgYYyKUtzJm2MH8dYX3_1528907393",
			"date_added": 1528908941
		}
	],
	"follow": []
}