{
	"next_comment_id": 14,
	"user_name": "ZeroLSTN",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1516372943": 1516699910,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1516022491": 1516787413,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1516988360": 1516995686,
		"15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1517160478": 1517188867,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1518525586": 1518653091
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Nofish: Totally for all that. I also think we should do something about the \"Unique to site\" address in the login menu. Currently, most sites won't let you interact with them without a cert ID, and thus the unique to site feature is quite useless. Perhaps it could be changed to something else, reflecting the fact it is not a *true* account?\n\nAlso having it be simple for sites to create anonymous certified user accounts automatically would be nice, especially for \\*chans.",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1516372943",
			"date_added": 1516786444
		},
		{
			"comment_id": 2,
			"body": "@Musickiller: @Git Center: @Binchan Whoopsie, just saw this thread scrolling through ZeroHello. Hope you are doing well during your duty. \n\n> also I can only see 2 authors per 2 genres - hip-hop and jazz.\n\nThose genres may be a bit empty atm. Try adding some more some the Recomended list. Right now *the big genre* is \"Imported from ZeroMusic\", but be aware not all songs work as not all could be downloaded from ZeroMusic at the time it was scraped (not by me). \n\n> Aldo I can't find out how to upload stuff (from mobile/IceCat)\n\nClick the menu icon in the top left, or slide with your finger in from the left to see the sidebar, then head to 'Uploads' and tap the 'New' button to upload! :)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1516039474",
			"date_added": 1516787294
		},
		{
			"comment_id": 3,
			"body": "@Nofish: Might be a bit tough on ZeroNet android. A plugin manager that would rename the folders automatically with a Restart option to enable changes would be a \nreally cool feature.",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1516610972",
			"date_added": 1516787407
		},
		{
			"comment_id": 4,
			"body": "@Nofish: Can we define a regex for ID providers? So that we can require `1ZeroiD[0-9]|1customaddresshere`? Or will that not be required if we just use the existing ID provider implementation in conjunction with this new option?",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1516372943",
			"date_added": 1516832899
		},
		{
			"comment_id": 5,
			"body": "@Nofish: Awesome. That proposal sounds good to me.",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1516372943",
			"date_added": 1516847582
		},
		{
			"comment_id": 6,
			"body": "@Kaffie: I think (hope) there's some miscommunication going on here. What @Nofish: is suggesting is that the *creator of a new ID provider* has to do some PoW to generate a zite address for their ID provider so that it fits some regex that other zites agree to. This PoW only needs to be done once by the creator of the ID Provider when they are creating it. At no point in time does a user signing up for these providers need to do any work. If that were the case nobody in their right mind would sign up for them, and instead just use the existing providers.\n\nI think this is a good idea, as it allows for more ID providers to be used on zites. The thing I don't get however is... why does it matter if there are a crap ton of ID providers? It's not like users need to download the zite of another user's provider.\n\nIn federated services such as e-mail or matrix where each user has their own address (bob@startmail.com, @zerolstn:matrix.org), the domain is just a part of their address. What's the problem with having many different domains available? Is there a reason we need to curtail this with PoW?\n\nOtherwise great feature, as currently ZeroID/KaffieID (and perhaps 1 or 2 others) are really the only options users have if they want to use the big ZeroNet sites.",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1516372943",
			"date_added": 1516944502
		},
		{
			"comment_id": 7,
			"body": "@Nofish: Ah, in the context of a blacklist that makes sense. Thanks for clearing things up :)",
			"post_uri": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_1516372943",
			"date_added": 1516961610
		},
		{
			"comment_id": 8,
			"body": "What is the reload icon in the top right for?",
			"post_uri": "15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4_1519803368",
			"date_added": 1519807579
		},
		{
			"comment_id": 9,
			"body": "@Krixano: Ah, thought the search bar at the top was part of Important Zites. It just fit so nice with the white and everything!",
			"post_uri": "15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4_1519803368",
			"date_added": 1519808320
		},
		{
			"comment_id": 10,
			"body": "I was getting the same issue. Fixed by deleting and redownloading the ZeroNet app from the Play Store. Make sure you back up your `data/` directory first if you want to save your user/site data!",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1523156360",
			"date_added": 1523624482
		},
		{
			"comment_id": 11,
			"body": "But you have more than 1 connection now? Isn't that what you were trying to fix?",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1523805685",
			"date_added": 1523817512
		},
		{
			"comment_id": 12,
			"body": "Namecoin lite wallet plugin anyone?",
			"post_uri": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_1528550199",
			"date_added": 1528572208
		},
		{
			"comment_id": 13,
			"body": "@Binchan: Thanks! And yeah, it's a lot more organized than what the genres ended up being on v1 :)",
			"post_uri": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ_1528695438",
			"date_added": 1528701907
		}
	]
}