{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1557063639,
			"title": "Py3 branch running on Android with tor always enabled from source code.",
			"body": "Just set up the Py3 branch with tor always enabled. Every looks like it's working fine (very impressive work btw). \n\nHere is an overview of how to do it if anyone wants to replicate this. It presumes you know how to use Termux/Command line commands and all that but is fairly basic. \n\n- Install Termux (from F-Droid is best but use either Play Store or F-Droid. Don't mix up the packages as they have different signatures). \n\n- Setup [Termux storage](https://wiki.termux.com/wiki/Termux-setup-storage) -Clearnet link.\n```termux-setup-storage```\n\n- Open Termux and make sure you're in Home Directory (```cd ~```)\n\n- Install git in Termux.\n```pkg install git```\n\n- Git Clone Python 3 branch of ZeroNet.\n``` git clone --branch py3 https://github.com/HelloZeroNet/ZeroNet.git```\n\n- Change directory into folder created.\n```cd ZeroNet```\n\n***Install various requirements and dependencies.*** \n(If you don't install these you get errors when you pip install requiresments.txt later).\n- Install Python 3. \n```pkg install python```\n\n- Install Python 3 dev tools\n```pkg install python-dev```\n\n- Install libffi-dev (coincurve needs it when importing the requirements for ZeroNet).\n```pkg install libffi-dev```\n\n- Install pkg-config (again, coincurve needs it). \n```pkg install pkg-config```\n\n- Install make, clang, curl, and various other libraries. Using apt-get here rather than pkg as I'm not sure whether you can chain installs with pkg or not (it's a Termux wrapper for apt-get).\n```bash\napt-get -y update && apt-get -y upgrade \napt install clang -y \napt-get install -y curl make clang grep c-ares-dev libev-dev openssl-tool\n```\n\n***Pull in official requirements.txt dependencies from the ZeroNet package.***\n- Run the following command. It will take a while \n```python -m pip install -r requirements.txt```\n\n***Set up Tor (Optional)***\n- Install Tor\n```pkg install Tor```\n\n- Edit torrc file. Move to the tor directory.\n```cd ../usr/etc/tor```\n\n- List folder just to make sure you're in the right place. You should only see 'torrc'.\n```ls```\n\n- Presuming you're in the right place and can see torrc, edit it, removing the # from in front of ControlPort 9051 (line 51 for me) AND 'CookieAuthentication 1'a few lines below.\n```vi torrc```\n\nI'm going to presume you know how to edit a file in vi. Download nano  (```pkg install nano``` then ```nano torrc```)if not. \n\n- Presuming you've saved the file now go back to home. \n```cd ~```\n\n- You can now run Tor in Termux.\n```tor```\n\n- Open a new console tab (swipe from left). Click 'New Session'.\n\n***Start ZeroNet in New Session***\n- Move into ZeroNet folder created earlier (you should automatically be in the home folder, ```cd ~``` if not). \n```cd ZeroNet```\n\n- Run ZeroNet. \n```python zeronet.py```\n\nYou should now be able to access http://127.0.0.1:43110 from your browser and see ZeroNet working. You can go in and switch it to tor always if you want. You can monitor both ZeroNet and Tor in Termux to see what's going on. \n\n***One concern*** I have with this way of getting it running is that I don't have to change the user of the Tor Authentication Cookie. I think it's because I'm running both ZeroNet and Tor as the sandboxed Termux user but haven't double checked. Anyway, if you want to find the cookie it's in ~/.tor whilst Tor is running. \n\nEverything connects ok so I don't think this is a functional problem but perhaps it would be a security concern. I'll leave it to more knowledgeable people than myself to work that out. \n\nAnyway, amazing work with this Py3 branch. I'm so impressed. I thought I was going to have issues getting it all running but it took way less time than it did to write this post.\n\nHere is the official clearnet link to the Py3 branch. You can see I've just modified the install from source instructions: https://github.com/HelloZeroNet/ZeroNet/tree/py3",
			"added": 1557063638
		},
		{
			"topic_id": 1557191513,
			"title": "The Gentleman’s Guide To Forum Disruption",
			"body": "Copied from here (Clearnet link): https://ritholtz.com/2012/11/the-gentlemans-guide-to-forum-disruption/\n\n##COINTELPRO Techniques for Dilution, Misdirection and Control of an Internet Forum\n \nWe have repeatedly addressed the topic of disruption of logical debate on the Internet.\nAn anonymous writer posted an important new report on disruption at Pastebin.  It is in the style of a leaked law enforcement memo, although we cannot vouch for its authenticity as a document produced by a whistleblower.  However, we have seen these techniques repeatedly used to disrupt Internet debate, and so – even if only copying the style of a real memo – it contains valuable information which all web user should know.\n\nThere are several techniques for the control and manipulation of a internet forum no matter what, or who is on it. We will go over each technique and demonstrate that only a minimal number of operatives can be used to eventually and effectively gain a control of a ‘uncontrolled forum.’\n\n##Technique #1 – ‘FORUM SLIDING’\nIf a very sensitive posting of a critical nature has been posted on a forum – it can be quickly removed from public view by ‘forum sliding.’ In this technique a number of unrelated posts are quietly prepositioned on the forum and allowed to ‘age.’ Each of these misdirectional forum postings can then be called upon at will to trigger a ‘forum slide.’ The second requirement is that several fake accounts exist, which can be called upon, to ensure that this technique is not exposed to the public. To trigger a ‘forum slide’ and ‘flush’ the critical post out of public view it is simply a matter of logging into each account both real and fake and then ‘replying’ to prepositined postings with a simple 1 or 2 line comment. This brings the unrelated postings to the top of the forum list, and the critical posting ‘slides’ down the front page, and quickly out of public view. Although it is difficult or impossible to censor the posting it is now lost in a sea of unrelated and unuseful postings. By this means it becomes effective to keep the readers of the forum reading unrelated and non-issue items.\n\n##Technique #2 – ‘CONSENSUS CRACKING’\nA second highly effective technique (which you can see in operation all the time at www.abovetopsecret.com) is ‘consensus cracking.’ To develop a consensus crack, the following technique is used. Under the guise of a fake account a posting is made which looks legitimate and is towards the truth is made – but the critical point is that it has a VERY WEAK PREMISE without substantive proof to back the posting. Once this is done then under alternative fake accounts a very strong position in your favour is slowly introduced over the life of the posting. It is IMPERATIVE that both sides are initially presented, so the uninformed reader cannot determine which side is the truth. As postings and replies are made the stronger ‘evidence’ or disinformation in your favour is slowly ‘seeded in.’ Thus the uninformed reader will most like develop the same position as you, and if their position is against you their opposition to your posting will be most likely dropped. However in some cases where the forum members are highly educated and can counter your disinformation with real facts and linked postings, you can then ‘abort’ the consensus cracking by initiating a ‘forum slide.’\n\n##Technique #3 – ‘TOPIC DILUTION’\nTopic dilution is not only effective in forum sliding it is also very useful in keeping the forum readers on unrelated and non-productive issues. This is a critical and useful technique to cause a ‘RESOURCE BURN.’ By implementing continual and non-related postings that distract and disrupt (trolling ) the forum readers they are more effectively stopped from anything of any real productivity. If the intensity of gradual dilution is intense enough, the readers will effectively stop researching and simply slip into a ‘gossip mode.’ In this state they can be more easily misdirected away from facts towards uninformed conjecture and opinion. The less informed they are the more effective and easy it becomes to control the entire group in the direction that you would desire the group to go in. It must be stressed that a proper assessment of the psychological capabilities and levels of education is first determined of the group to determine at what level to ‘drive in the wedge.’ By being too far off topic too quickly it may trigger censorship by a forum moderator.\n\n##Technique #4 – ‘INFORMATION COLLECTION’\nInformation collection is also a very effective method to determine the psychological level of the forum members, and to gather intelligence that can be used against them. In this technique in a light and positive environment a ‘show you mine so me yours’ posting is initiated. From the number of replies and the answers that are provided much statistical information can be gathered. An example is to post your ‘favourite weapon’ and then encourage other members of the forum to showcase what they have. In this matter it can be determined by reverse proration what percentage of the forum community owns a firearm, and or a illegal weapon. This same method can be used by posing as one of the form members and posting your favourite ‘technique of operation.’ From the replies various methods that the group utilizes can be studied and effective methods developed to stop them from their activities.\n\n##Technique #5 – ‘ANGER TROLLING’\nStatistically, there is always a percentage of the forum posters who are more inclined to violence. In order to determine who these individuals are, it is a requirement to present a image to the forum to deliberately incite a strong psychological reaction. From this the most violent in the group can be effectively singled out for reverse IP location and possibly local enforcement tracking. To accomplish this only requires posting a link to a video depicting a local police officer massively abusing his power against a very innocent individual. Statistically of the million or so police officers in America there is always one or two being caught abusing there powers and the taping of the activity can be then used for intelligence gathering purposes – without the requirement to ‘stage’ a fake abuse video. This method is extremely effective, and the more so the more abusive the video can be made to look. Sometimes it is useful to ‘lead’ the forum by replying to your own posting with your own statement of violent intent, and that you ‘do not care what the authorities think!!’ inflammation. By doing this and showing no fear it may be more effective in getting the more silent and self-disciplined violent intent members of the forum to slip and post their real intentions. This can be used later in a court of law during prosecution.\n\n##Technique #6 – ‘GAINING FULL CONTROL’\nIt is important to also be harvesting and continually maneuvering for a forum moderator position. Once this position is obtained, the forum can then be effectively and quietly controlled by deleting unfavourable postings – and one can eventually steer the forum into complete failure and lack of interest by the general public. This is the ‘ultimate victory’ as the forum is no longer participated with by the general public and no longer useful in maintaining their freedoms. Depending on the level of control you can obtain, you can deliberately steer a forum into defeat by censoring postings, deleting memberships, flooding, and or accidentally taking the forum offline. By this method the forum can be quickly killed. However it is not always in the interest to kill a forum as it can be converted into a ‘honey pot’ gathering center to collect and misdirect newcomers and from this point be completely used for your control for your agenda purposes.\n\n##CONCLUSION\nRemember these techniques are only effective if the forum participants DO NOT KNOW ABOUT THEM. Once they are aware of these techniques the operation can completely fail, and the forum can become uncontrolled. At this point other avenues must be considered such as initiating a false legal precidence to simply have the forum shut down and taken offline. This is not desirable as it then leaves the enforcement agencies unable to track the percentage of those in the population who always resist attempts for control against them. Many other techniques can be utilized and developed by the individual and as you develop further techniques of infiltration and control it is imperative to share then with HQ.",
			"added": 1557191511
		},
		{
			"topic_id": 1557414212,
			"title": "[Computing Forever] EU To Launch ‘Big Brother’ Biometric Database",
			"body": "Youtube: https://www.youtube.com/watch?v=4Ia81e5KQpE\nBitchute: https://www.bitchute.com/video/4Ia81e5KQpE/ \n\nSo, apparently the EU is launching the largest biometric tracking database on earth. Thoughts?",
			"added": 1557414209
		}
	],
	"topic_vote": {
		"1556986926_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": 1,
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1556988115_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": 1,
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": 1,
		"1556335000_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1557045318_1ADuqWEcsq2buNsYPHTRngWrbJqoq5yC3g": 1,
		"1557030898_1AWqG2MEmC5RKeCWqqBaB9uSwp7V3HHx3A": 1,
		"1557064345_1GqfwGz2U6QVTSE4LxuudaJcnap92nPzHY": 1,
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1557063639_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"1557079828_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1555000915_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1557166991_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1555954035_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": 1,
		"1557191513_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"1557168662_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1557231045_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1557256051_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1557337953_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1557356335_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1530020784_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1,
		"1557536353_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1557415940_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": 1,
		"1557616021_194xRv4qDg7Tax3pJ5EMN7MjLCs9T7KDoZ": 1,
		"1558859891_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"1559651192_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1558844494_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1558925765_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1558919260_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1558800923_1PNKhy6FbnxWkLdVGAtFd4CatD4ss6HrvZ": 1,
		"1558550634_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"1559829157_14MHxcFsxWxxJzBAGwHjoP38625Pv7FaeB": 1,
		"1559820421_1H2ao62jz8FK62H4VtDwHT1VW7hsyabqqX": 1,
		"1558864150_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"1561792215_186LSXbMvQaHzHzWtxhXUCReDRdqCu89ZF": 1,
		"1561694361_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1561514363_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1565211401_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP": 1,
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": 1,
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": 1,
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1565297074_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565132888_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1556986926_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [
			{
				"comment_id": 1,
				"body": "I don't think Multiuser writes to user.json. \n\nSee the source code here: \n\n```python\n@PluginManager.registerTo(\"User\")\nclass UserPlugin(object):\n    # In multiuser mode users data only exits in memory, dont write to data/user.json\n    def save(self):\n        if not config.multiuser_local:\n            return False\n        else:\nreturn super(UserPlugin, self).save()\n```\n\nClearnet link: [https://github.com/HelloZeroNet/ZeroNet/blob/master/plugins/disabled-Multiuser/UserPlugin.py](https://github.com/HelloZeroNet/ZeroNet/blob/master/plugins/disabled-Multiuser/UserPlugin.py)\n\n[Zeronet link](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/file/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/plugins/disabled-Multiuser/UserPlugin.py@master)",
				"added": 1557008779
			}
		],
		"1556335000_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 2,
				"body": "I couldn't see the code on GitCenter as I couldn't find a way of getting to the various branches. Instead I downloaded it from GitHub and then ran it manually. I checked on Py3 updater (39 peers for me) and it said I was running the latest version. All running well as far as I can tell. I didn't bother migrating any users/data over though, I just started fresh. \n\nDirect GitHub (clearnet) link: [https://github.com/HelloZeroNet/ZeroNet/tree/py3](https://github.com/HelloZeroNet/ZeroNet/tree/py3)",
				"added": 1557012831
			}
		],
		"1557030898_1AWqG2MEmC5RKeCWqqBaB9uSwp7V3HHx3A": [
			{
				"comment_id": 3,
				"body": "> [digitalprophet](#comment_3_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK): How can I block this disgrace of a human being? Can anyone help me? He keeps popping up, hahahahah\n\nYou can mute him. Right click the three dots on the right of any comment and you have the option of muting a particular user. You won't see any of their comments on any post anymore (although everyone else will, of course).",
				"added": 1557053347
			},
			{
				"comment_id": 4,
				"body": "> [digitalprophet](#comment_17_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK): That might be my problem, I don't see those 3 dots\n\nThey only appear when you're hovering over any particular comment. They are faint grey so perhaps they are hard to see on your setup?",
				"added": 1557053577
			},
			{
				"comment_id": 5,
				"body": "> [digitalprophet](#comment_23_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK): I switched, and yes it helped a lot!\n\nYes, my view is, 'don't feed the trolls'. Just ignore them. As far as I could tell that user just posted negative comments on every post on ZeroTalk and it just got boring reading them. I was thinking about this as regards censorship and so on. My conclusion was everyone has a right to say whatever they want, of course, but there is no right to force me to listen.",
				"added": 1557054021
			}
		],
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 6,
				"body": "> [frankenstein91](#comment_4_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5): In germany there is now a kind of darknet ban and a ban on technologies for anonymizing on the internet.\n\nThey can try that but it's always possible to circumvent such bans and the more they push for them the more they push for ways around them to be developed. Use a VPN to reach out then connect to tor. Use private tor Bridges, or even setting up a second 'tor' using their source code and setting up a secondary directory authority structure. The options are limitless. And that's before looking at anything like ZeroNet.\n\nAlso, looking beyond the internet, even in times of outright war people set up resistance/underground movements. There is always a way. I think them acting in such an overt manner actually shows they know they are losing control and they think the the danger of appearing overtly authoritarian is less of a danger than allowing people their right to speak about the issues. They have been caught out by Trump/Brexit/Yellow Vests/Visigrad 4 in Central Europe and I think they can foresee the whole system (EU and maybe more) collapsing. This is why they are acting in such an overt way. It goes against their core philosophy of incrementalism so as the public don't wake up to what they are doing. It is a calculated risk they are taking. One that I don't think will pay off. \n\nIronically the more they throw their weight around the more they delegitimize themselves. So be it.",
				"added": 1557060969
			}
		],
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 7,
				"body": "> [digitalprophet](#comment_9_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK): For now I'm using Brave and Palemoon because I'm on MacOs for the moment. Are there any better browsers available?\n\nWaterfox is an interesting option. https://www.waterfox.net/. There are builds for Windows, OSX and Linux. \n\nIt's based on Firefox but you can run your own extensions etc. I think there is talk of setting up a custom addon repository for Waterfox in the future.",
				"added": 1557067725
			},
			{
				"comment_id": 15,
				"body": "> [delta9](#comment_8_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1): The \"No telemetry\" feature is a nice sell, though right below it they state they are, in fact, sending telemetry. Have you compared this with IceCat (formerly GNU IceWeasel)?\n\nDo you mean the check for updates feature? I don't really mind that too much. Regarding IceWeasel, yeah, I used to run it on Android a few years back. Always seemed good to me. I've not tried it out recently so can't make a direct comparison. \n\nAt the moment I'm stuck in browser limbo. I'm not sure which way I'm going to go but am watching developments closely.",
				"added": 1557189607
			}
		],
		"1556988115_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [
			{
				"comment_id": 8,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_89_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): You got caught up in this democratic bullshit, democracy is a Masonic Achievment.The average intellectual level of the population is, and will always be, low: [...]\n\nYou're correct. However it is still necessary to engage with people of lower intelligence in one way or another. At the moment they are penned in walled digital gardens and distracted with petty amusements and vanities. Bread and circuses and all that. Endless toxic propaganda.  \n\nPerhaps you'd be interested in this video (clearnet) - https://www.youtube.com/watch?v=awyQ7LLrGXA . It explores the idea of 'Propaganda as Logos', or trying to use propaganda as a benevolent tool rather than push them towards self destruction (which is what we see now). My view is that all people should have the option to explore truth fully, but for those who don't want to, for whatever reason, a relatively stable and non-malevolent moral framework of some sort should be propagated. A 'Dummies Guide To Morality' of some sort. Obviously this is a complex and thorny issue and, at its core, goes to very deep philosophical and, dare I say it, spiritual questions but I'm sure you get the idea.\n\nStill, all that is just theoretical if the masses are locked in their digital walled gardens. I think there may be multiple benefits to trying to set them free.",
				"added": 1557070192
			},
			{
				"comment_id": 9,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_91_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"However it is still necessary to engage with people of lower intelligence in one way or another.\" [...]\n\n> Don't play God, Nature knows what it's doing.\n\nEngaging with people is not playing God. It is a normal function within society. There is only the question as to how one engages. \n\n> What you are saying is socialism\n\nNo it's not. I'm saying that power structures and hierarchies exist inevitably and one needs to work within those confines. Exactly the opposite of socialism. \n\n> by EXARCERBING THEIR EMOTIONS: THE FREEMASONS DESTROYED THE NATURAL RHYTHM OF LIFE.\n\nThere was no perfect homeostatic past. This is the naturalistic fallacy/appeal to nature/noble savage myth. Life has always been a balance between cooperation and conflict, love and war. Both driving the other. There is no 'natural rhythm of life' other than perpetual change. Please tell me of a perfectly 'balanced' period of history that you know about. There has always been conflict and turmoil and there always will be. This was the way it was long before humans arrived and it will be so long after we have left. You can minimize the damaging effects of this by forming groups with certain shared behavior patterns to act as a buffer to the chaos.  Such groups thrive, to the point they become the dominant force in the environment and then new social groups emerge and expand as the old order topples for whatever reason. Kingdom rise, kingdom fall, forever. \n\n> Observe nature, other species, you will see differences in behaviour within the Same Species, and Very Different Roles\n\nYes, that's what I'm referring to. Some choose not to think for themselves and place their trust in 'big brother', others are mavericks and are more independently minded. Neither state is right or wrong, it's just the way it is and there are individuals at various points along that spectrum. This arrangement will emerge naturally one way or another. What 'big brother'- whoever it may be- decides is the appropriate world view gets echoed to the masses and they echo it back. This is, in simplified fashion, in part of the basis for any culture or organization. The values propagated to the masses can be 'good' or 'bad' depending upon how you define those terms. This is a very deep question in and of itself. \n\n> \"My view is that all people should have the option to explore truth fully\", your purpose, don't project it onto others.\n\nI'm not projecting my values onto them. I said they should have the option to explore truth. It is exactly that, an option, and an understanding that I would hope others would extend to me in return. \n\n>The freedom you are talking about is an intellectual one; that of the Freemasons.\n\nNo, the freedom I am talking about is the freedom to try and see the world as it really is. Not as others, whether they be people or power structures, want me to see it. \n\n>It is the Masonic ideal to \"Lead the Pack\", it is VERY DANGEROUS when YOU DO NOT KNOW YOURSELF.\n\nYet a few paragraphs above you state that some are natural leaders. What about when someone 'knows themselves' as you put it. Is it ok for them to be a leader then? How does one know if one is a natural leader or a \"masonic\" false 'leader of the pack'?\n\nAlso, why are you so focused on the masons? Sure they played their part in all this but this a small piece of a much larger picture. Are you coming from a religious angle? Catholic maybe? I know they dislike the masons for historical reasons in similar way to how protestants dislike the Jesuits for various historical reasons. Why do you focus so much on the freemasons?",
				"added": 1557076279
			}
		],
		"1557063639_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [
			{
				"comment_id": 10,
				"body": "> [styromaniac@kxoid.bit](#comment_7_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): This needs to be stickied/pinned.\n\nDid it work for you? I wondered whether I'd already installed any dependencies previously I may have missed in the write up. Those are the ones I installed for the Py3 branch but I use Termux a lot so it's possible I'd already installed other dependencies.",
				"added": 1557077050
			},
			{
				"comment_id": 11,
				"body": "Incidentally, I've been thinking about using Termux Widgets so we could have a 'Connect to ZeroNet / Connect to Tor' set of scripts that you could just run from the home screen. It would make it all much easier to manage rather than jumping into termux directly every time you wanted to run it.\n\nAny thoughts? Has anyone already done this? \n\nClearnet link to turmux wiki so you can see what I'm thinking: https://wiki.termux.com/wiki/Termux:Widget",
				"added": 1557077233
			},
			{
				"comment_id": 13,
				"body": "> [delta9](#comment_6_1AnpXwyjaKj6ccazqk7NKYCL8skScCMpG1): Using wake locks I've had trouble getting processes in Termux to stay running. What have your experiences been?\n\nInteresting. I've had no trouble with tor and ZeroNet running 24/7 in Termux. I've used other constant running scripts for years and never had them fail on me. Not sure why. May I ask, what problems did you have specifically?",
				"added": 1557139863
			},
			{
				"comment_id": 14,
				"body": "> [gluek](#comment_21_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): It's better to git clone zeronet repo - so you can update it when needed with git pull.Also you need to install pkg install make to compile coincurve.\n\nI also think clang might be required. And OpenSSL/OpenSSL-dev, ca-certificates and so on. I have them all installed already so am not sure which are required. \n\nOnce we have an exhaustive list we can make a script that users can run to install all the relevant dependencies. There is an old script which did just that here: https://github.com/PeterCxy/Termux-ZeroNet\n\nI ran this a while ago and it installed a variety of packages for Py2 ZeroNet. See below for the ones I think are necessary. [Direct link to script for convenience](https://raw.githubusercontent.com/PeterCxy/Termux-ZeroNet/master/zn.sh)\n\n\n```\t\n\ttermux-setup-storage\n\tapt-get -y update && apt-get -y upgrade \n\tapt install clang -y \n\tapt-get install -y curl make git clang grep c-ares-dev libev-dev openssl-tool\n```\n\nThing is, I don't want to install unnecessary dependencies for the Py3 branch.\n\nI'll update the instructions above now to include git and then git clone the repo etc. I'll also include the various packages included in the other script.\n\nOnce this has been confirmed and tested etc. I'd suggest we repackage it as a simple script to make installing and updating ZeroNet as easy as possible. I'm not sure why this old script fell by the wayside as it worked perfectly for me on Py2 ZeroNet.",
				"added": 1557141596
			}
		],
		"1557079828_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 12,
				"body": "Do you mean mute people? You can mute users by blocking them on here, for example, by hovering over the user and you'll see three dots appear to the right. Click that and then \"Mute this user\" and that user will vanish from your newsfeed. You won't see any comments or posts they make. \n\nYou can manage blocked users by clicking on the ZeroNet icon (top right) to go to ZeroHome, then click on the three vertical dots on the left (on the site sidebar - black background bit on default ZeroNet). Scroll down and you will see 'Manage Blocked Users And Sites' about two thirds of the way down. You can undo a block there if you want to.",
				"added": 1557083383
			}
		],
		"1557191513_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [
			{
				"comment_id": 16,
				"body": "I thought some of the users here might find this interesting. It's basic, but still, covers most of the fundamentals.",
				"added": 1557191578
			}
		],
		"1557337953_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 17,
				"body": "Sargon's trying to pull a Trump media maneuver. Leverage the media to platform him and promote his message even whilst they try to smear him. Using the, \"It's better to be talked about than not talked about at all\" mentality and all that. \n\nThe difference is, Trump was talking about things that people were concerned about - mass migration and crime for example (MSM: \"Racist!\"). He talked about the shrinking role of manufacturing under the 'American Jobs' meme (MSM: \"Economically illiterate! Xenophobic!\"). But these were things people cared about. They read the headlines, then looked into what he was saying and the rest is history. Sure he said, 'grab 'em by the pussy,' but he was talking about how certain women respond to men of power. It may not be 'acceptable' to acknowledge that, but it is how it is. Everyone quietly knows that it is true, whether they like it or not.\n\nSargon, on the other hand, is being associated with rape tweets that he made (admittedly to show SJW hypocrisy). The general TV viewing public aren't interested in the specifics of whether one would or would not rape Phillips. The whole thing is presented as, and is, rather unsavory. The headlines so generated have no bearing on his political campaign. Nobody wonders about how they can make anti-rape tweets or whatever you want to call them. The subtler points he is making as to what one can and cannot say under progressive doctrine will be lost on any uninterested third party. It doesn't speak to their direct interests in the same way that Trump's campaign did and is an easy smear. People will walk away with the feeling that the tubby guy on TV loves talking about (and has a strange fixation with) rape. He has no prior 'brand' to prop him up (as Trump did). To make things worse, he then doubles down and talks about a bit more rape. And so on and so on. You get the idea. \n\nThrough this you can see, if, as they say, Trump is playing \"4D underwater Subbuteo\", Sargon is playing six-bullet Russian Roulette. On hard mode. And so will fall the mightiest warrior of Kekistan. Honk honk. \n\nStill, credit where it's due, I get what's he's trying to do. I respect him putting himself out there like that. I like him. I agree with him on many things. But I don't think he's quite sharp enough to pull it off what he's attempting.",
				"added": 1557346464
			},
			{
				"comment_id": 18,
				"body": "> [geekosan](#comment_31_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): I sincerely hope you are wrong. Also, I think Sargon is not as stupid that you make it sound. Most people I personally know understand sarcasm. The mainstream media seems to be the only place where it goes right above their heads. Everyone knows the msm feels threatened by the Internet, and the louder they cry foul, the more obvious their plight.\n\nI hope I'm wrong. I hope he succeeds in getting his point across. I really do, but I think he's underestimated the lengths his enemies will go to and not played this round particularly well (for the reasons mentioned in the original post). Time will tell. \n\n> [spukkinfaceship](#comment_22_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): i wonder if you would consider that Trump is actually a racist,  incompetent sociopath. sometimes the easiest explanation is the correct one.\n\nIt's a fascinating theory. He's so incompetent that he lived decades as a playboy billionaire before accidentally becoming the most powerful man in the world. I wish I was that incompetent. \n\nOn the other hand, maybe there is more to it than that.",
				"added": 1557369715
			},
			{
				"comment_id": 19,
				"body": "> [spukkinfaceship](#comment_25_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): i'd say he's the lowest common denominator vomited up by a system that is utterly broken and dying. or something like that.\n\nI agree that the system is utterly broken and dying, I just don't think that Trump was 'vomited up' by that same system. The establishment did all it could to try and block his election using everything they had, worldwide. \n\nThis is something different. More complex. These simplistic 'orange man bad' narratives do nothing to explain what is going on.",
				"added": 1557403586
			},
			{
				"comment_id": 20,
				"body": "> [spukkinfaceship](#comment_26_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): anyone who lived in NYC during the 80's and 90's knows that Trump is actually a bad person. notorious for ripping people off and doing hateful stuff.  He's the lowest common denominator that managed to slide into power because the power brokers' have lost control.\n\nWith all due respect, all you seem to be doing when you criticize Trump is name-call and appeal to generalities (\"Everybody knows\" - [Argumentum ad populum](https://en.wikipedia.org/wiki/Argumentum_ad_populum) to be technical ). I'm no great fan of his but you're not exactly making your case well. \n\nAnyway, we all know there is nothing but political flame wars on the internet these days and they are not particularly constructive so let's just agree to disagree. Thank you for your thoughts on the matter.",
				"added": 1557419088
			}
		],
		"1558859891_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 21,
				"body": "[This worked for me](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1557063639_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR/Py3+branch+running+on+Android+with+tor+always+enabled+from+source+code) (ZeroTalk link). This is for the py3 version. \n\nIf you want to run the old python2 version (not advised) you can automate it via Termux and [this script](https://github.com/PeterCxy/Termux-ZeroNet) (Github, clearnet). \n\nThis takes a bit more time to set up but it works well and you can update the source code by cloning new releases as they come out. You can put these in different folder and test different versions if you want. Also you can run it all though tor this way which is obviously good for reasonable anonymity.\n\nEDIT: Also, why not install a modern rom on it? Marshmallow is ancient. There are [plenty of options to choose from](https://forum.xda-developers.com/note-4/snapdragon-dev) (XDA link, clearnet). ",
				"added": 1559768946
			}
		]
	},
	"comment_vote": {
		"4_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": 1,
		"11_14iCuAn3m8Uz6fkJcu7KEPbHdSR2qmmrH1": 1,
		"83_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"3_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": 1,
		"2_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": 1,
		"4_17husSAraRRvc7qRWxwA7KF7PTwjhTmxhD": 1,
		"24_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"16_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"1_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"37_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"20_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK": 1,
		"21_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK": 1,
		"23_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK": 1,
		"25_18xv9jCv82jJWnraAcHuhTz7BzKN2PvXkK": 1,
		"20_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"393_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"7_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"6_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": 1,
		"9_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"8_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"400_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"21_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"47_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"16_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"15_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"26_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"2_1NivX9xhMYmWobA4VC4rYzQR15JDntyixi": 1,
		"57_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"111_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"130_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"68_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"235_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"61_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"16_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"12_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"30_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"34_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"33_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"22_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"113_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"45_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"420_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"427_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"53_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"48_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"31_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"30_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL": 1,
		"32_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"55_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"85_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"10_1AKTv64HemAWmM762raYNn8aeDNAoojaMd": 1,
		"4_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2": 1,
		"3_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1,
		"3_172xYkahgS7XFtpueyrXB5Xqo5DNmgZfD1": 1,
		"127_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"126_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"4_172xYkahgS7XFtpueyrXB5Xqo5DNmgZfD1": 1,
		"32_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"4_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": 1,
		"148_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy": 1,
		"5_17RgJMZ9wxBZvSyTFnSGkMQVpLrAGYNfba": 1,
		"34_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"49_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"15_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"20_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr": 1,
		"4_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"45_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"18_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"37_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"62_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": 1,
		"4_1MVGeztRHXx3PFzRYL7E41mop1SeRkdrxb": 1,
		"6_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"58_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"25_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"24_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"20_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq": 1,
		"41_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"8_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"3_17g9457Uz3Twc26zM2JAzzxQ7ZTiLFsVYR": 1,
		"4_1EQNT6dAhq1cJPhZrHeSP6PSKNfVLt9Hje": 1,
		"8_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B": 1,
		"2_13zJujgTGXKmoUHGGFazek97zrRwfXtv5g": 1,
		"31_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	}
}