{
	"posts": [
		{
			"id": "a247f4b7-11d8-4dc3-847e-84cee224c6b4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c461c664-86e1-4933-b221-861bb909957e",
			"body": ">>b8cf58d5-28ef-43c7-a018-be7d0850806b\n>It very much follows powerlaws. The one who can get the most users as chat platform has a huge advantage because it has the most users. Something new must be way better to knock off discord.\nDiscord itself got popular becaue they got a $150 million loan to start with, so they could outclass their competition by throwing money around. Hosting all those images and videos that everybody posts there is expensive as fuck.\nThe business strategy of discord is to raise more and more money and to BTFO everyone else with it and THEN think about how to actually make money out of it to eventually pay the debts. It's a typical venture capitalist product.\n>As you saw with Skype that can take years, even now people still use Skype. \nI use Skype for calls to normies and my gf, because the voice quality is just awesome and it does a good job at filtering noise without cutting off.\ni.e. if you use Discord voice and you aren't currently talking, discord mutes the mic and cuts off and then starts again when you start to talk. That might be good in a group chat of 20 people, because you don't want to hear all those background noises, but if you are just two or three, it's annoying as fuck.\nSkype manages that way better. Instead of cutting off by threshold, it tries to filter out static noises (like a fan) but keeps the rest, and it works well.\nBesides that, a skype call can survive connection loss. If you lose your connection for a second and auto-reconnect with another IP, the skype call is just gone for that second. If you are on a shitty connection, or if your connection gets shit because someone else is downloading something, Skype adjusts the bitrate. And Skype can run on very low-end hardware. \n\nSkype can deal with lots of shit.\nMeanwhile on discord, you can have the best connection possible and it will still suddenly freeze or do some other weird stuff, while eating 5GB RAM.",
			"time": 1565761615986,
			"files": "[]"
		},
		{
			"id": "ed4f200d-5b33-4e29-9d74-e9f5f2f49893",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "97156e18-7188-4c78-9061-fae6bd1cb916",
			"body": ">>57ebb4d9-8a96-4605-a9c1-68528a5947f4\nI too love to post on 4chan fellow goyim, where VPNs and Proxies are banned and everybody posts with his real IP, while the feds watch over it since 2010. Also the moderation team is very competent and bans all the right stuff and the permanently botted spam makes the board even more pleasent.",
			"time": 1565818670876,
			"files": "[{\"name\":\"jew-lampshade.jpg\",\"thumb\":\"ecfc9c61664416f5d548b6e776e24712b7dd600f-thumb.jpg\",\"size\":39631,\"type\":\"image/jpeg\",\"original\":\"ecfc9c61664416f5d548b6e776e24712b7dd600f.jpg\",\"directory\":\"1Mg3R57fDTyfgxnH1xpiqmy2zUvoP818DC\"}]"
		},
		{
			"id": "d37cd9ff-343b-4c8d-a742-151b3a835d00",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "7fae6bba-7d04-4440-8090-75b369c7ed1a",
			"body": ">>b6931a3e-051a-49e1-92c5-b039ca5e7027\nI did change that infopic a bit to mention that you have to start tor browser before zeronet.\nI saw some anon having problems with that.",
			"time": 1565832267063,
			"files": "[{\"name\":\"zeronet.png\",\"thumb\":\"bb049c3e888fa85f046ea3647325ac156e22c675-thumb.png\",\"size\":131233,\"type\":\"image/png\",\"original\":\"bb049c3e888fa85f046ea3647325ac156e22c675.png\",\"directory\":\"1Mg3R57fDTyfgxnH1xpiqmy2zUvoP818DC\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}