{
	"title": "pd English",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 20,
	"demo": false,
	"modified": 1465570067,
	"post": [
		{
			"post_id": 19,
			"title": "thinking maaileen - a case study for pd english and related development",
			"date_published": 1465570026.129,
			"body": "\n\n\nhere is one chance to use 34 college for the maaileen situation - \n•she needs to develop a network, so everyone can see her work\n•if she uses online, for example develop her own site, that is going to cost her about 1000 yuan a year, minimum;\n•but if she use 34 media platform, then she gets everything for free, plus all the benefits of of 34 media entity:◦free, reliable, convenient, fast, perpetual.\n\n"
		},
		{
			"post_id": 18,
			"title": "case one - real estate english and project",
			"date_published": 1465557734.171,
			"body": "http://127.0.0.1:43110/1MM7fJrhhwyvWr7tgNRoNFSMCvm2SzEftR"
		},
		{
			"post_id": 17,
			"title": "who should contact us",
			"date_published": 1465220340.664,
			"body": "if your child faces english study problem, if he does not like study english, then come to us, we can design a particular effective program just for your child."
		},
		{
			"post_id": 16,
			"title": "every project has its unique situation and problem to solve, so there will be many versions and spinoffs down the road",
			"date_published": 1465220234.364,
			"body": "gg English is just one example. each student faces a particular problem and by solving that particular problem, some new pd English will be developed."
		},
		{
			"post_id": 15,
			"title": "how this particular project gg English works",
			"date_published": 1465220191.181,
			"body": "we will develop and implement that step by step.\n\nhttp://127.0.0.1:43110/1K6pAEUkroJyv8Le4MXhQ9iHZSkFNxkvn5/"
		},
		{
			"post_id": 14,
			"title": "the origin of gg English",
			"date_published": 1465220076.609,
			"body": "- it is developed for a boy that is facing a typical problem\n- almost all boys can use this method to learn english effectively and benefit from this study\n- it enables students to pursue a life goal, solve a real life problem, and learn english at the same time"
		},
		{
			"post_id": 13,
			"title": "gg English - one example of pd English",
			"date_published": 1465219994.048,
			"body": "http://127.0.0.1:43110/1K6pAEUkroJyv8Le4MXhQ9iHZSkFNxkvn5/"
		},
		{
			"post_id": 11,
			"title": "pd as a style",
			"date_published": 1465040748.079,
			"body": "pd makes people think of different things. here is one - does it look somewhat like the 69 style of making lov?"
		},
		{
			"post_id": 10,
			"title": "one example of pd English",
			"date_published": 1465040534.547,
			"body": "years ago i had this one female student who works on a small but interesting project, that helped her to get into a top college. \n\nthe project is called Stone Windows\n\nit recorded all the windows she could find from around the world that are made by stones. simple.\n\nbut it is a lot of work, touches many areas, leads her to many interesting places and subjects. \n\nhow is she doing now?"
		},
		{
			"post_id": 9,
			"title": "the process of pd English learning",
			"date_published": 1465040255.691,
			"body": "- discuss with your students and pick a project; \n\nhow to write about your project, you can answer the typical 5W:\n\n- why you pick this as your project\n- how you are going to make it work\n- what is your plan of building up this project\n- when and where to work on it, get yourself a schedule \n- who else is involved \n\n"
		},
		{
			"post_id": 8,
			"title": "the key to make pd English work",
			"date_published": 1465039410.104,
			"body": "the key is pig.\n\npig, make sure you work hard and get things written and done. \n\nthen dogs may come and take a look and help you."
		},
		{
			"post_id": 7,
			"title": "could pig and dog really work together?",
			"date_published": 1465039339.265,
			"body": "anybody actually sees pig and dog together? not me. \n\nlet's see and find out."
		},
		{
			"post_id": 6,
			"title": "so in pd English, who is pig, who is dog?",
			"date_published": 1465039250.715,
			"body": "sure, the writer is pig, the visitor is dog.\n\npig, writes about what you think;\ndog, tell how pig is doing. help him moving forward."
		},
		{
			"post_id": 5,
			"title": "how to pick a project",
			"date_published": 1465038887.679,
			"body": "easy. you can pick a project based on the following - \n\n- your personal interest and hobby; for example, you might like fashion, car, travel, particular course subject such as math, history, computer programming, and so on;\n- you might want to make some money, so think about make something and start a small business;\n- you might want to make your exam preparing a project, for example SAT prep study, you can record your strategy and learning process, this will be helpful to others later;\n- you can find some other projects to join, here is a list of other projects going on now\n\nhttp://127.0.0.1:43110/1GaGYSb78wWHTHz2FMGWGztBGoTpoETYvP/\n\n"
		},
		{
			"post_id": 4,
			"title": "how to start - pick a project",
			"date_published": 1465038753.24,
			"body": "starting learning in pd English is easy, pick one project, then start writing about your development. \n\ntake a look of this blog, pd English starts from one idea, then becomes a project, and now it is, you see some writings about it. this is a learning process."
		},
		{
			"post_id": 3,
			"title": "another way to explain pd English",
			"date_published": 1465038514.927,
			"body": "project development english \n\nthis is a very valid approach to english study. because of the following - \n\n- your project will have a focused subject, this subject might be interesting to a group of people; this way you immediately captures some audience; having listeners is very important; they can provide you with feedback and helpful suggestions, also adding some renqi; \n- it helps yourself to learn something too;\n- working on one project can lead to other projects and opportunities \n\nso from these points, pd English is a good way to learn English."
		},
		{
			"post_id": 2,
			"title": "what is pd English?",
			"date_published": 1465019570.3,
			"body": "i have done some research and here is some clue, but it may or may not be related to pd english. but why bother, let's get started.\n\nhttp://127.0.0.1:43110/1CpQfwShA6D8kAc4o3tu46GK1i89UtGP2o/?Post:88:English+learning"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1465001779,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}