{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"3_17ngq9wqgRWuFfkv6AhkH7rF5XwZdxCAb8": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"2_17ngq9wqgRWuFfkv6AhkH7rF5XwZdxCAb8": 1,
		"1_17ngq9wqgRWuFfkv6AhkH7rF5XwZdxCAb8": 1,
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 18,
	"comment": {
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 1,
				"body": "#Metafísica\nNão é fácil dizer o que é metafísica. Os filósofos antigos e medievais poderiam ter dito que a metafísica era, como a química ou a astrologia, a ser definida pelo seu objeto: a metafísica era a \"ciência\" que estudou \"ser como tal\" ou \"as primeiras causas das coisas\" ou \"coisas que não mudam\". Não é mais possível definir metafísica dessa forma, por duas razões. Primeiramente, um filósofo que negasse a existência daquelas coisas que tinham sido vistas uma vez como constituindo o assunto-matéria do Metaphysics-primeiras causas ou coisas imutáveis-seria considerado agora fazer desse modo uma afirmação metafísica. Em segundo lugar, existem muitos problemas filosóficos que agora são considerados problemas metafísicos (ou, pelo menos, em parte, problemas metafísicos) que não estão de forma relacionada com as primeiras causas ou coisas imutáveis-o problema da livre vontade, por exemplo, ou o problema do mental e o físico.\n\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fmetaphysics%2F",
				"added": 1546713316
			},
			{
				"comment_id": 2,
				"body": "#DETERMINISMO E FILOSOFIA DA LIBERDADE \n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=http%3A%2F%2Fwww.ucl.ac.uk%2F~uctytho%2FdfwIntroIndex.htm",
				"added": 1546713451
			},
			{
				"comment_id": 3,
				"body": "#Argumentos Ontológicos\nArgumentos ontológicos são argumentos para a conclusão de que Deus existe, a partir de premissas que supostamente derivam de alguma outra fonte que não a observação do mundo - por exemplo, apenas da razão. Em outras palavras, os argumentos ontológicos são argumentos a partir de premissas analíticas, a priori e necessárias, para a conclusão de que Deus existe.\n\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fontological-arguments%2F",
				"added": 1546713967
			},
			{
				"comment_id": 4,
				"body": "#Aposta de Pascal\n“Aposta de Pascal” é o nome dado a um argumento devido a Blaise Pascal por acreditar, ou pelo menos em dar passos em acreditar, em Deus. O nome é um pouco enganador, pois em uma única seção de seus Pensées , Pascal aparentemente apresenta pelo menos três desses argumentos, cada um dos quais pode ser chamado de uma 'aposta' - é apenas o último deles que é tradicionalmente chamado de “Pascal's”. Aposta\". Encontramos nela a extraordinária confluência de várias importantes correntes de pensamento: a justificação do teísmo; teoria da probabilidade e teoria da decisão, usada aqui quase pela primeira vez na história; pragmatismo; voluntarismo (a tese de que a crença é uma questão da vontade); e o uso do conceito de infinito.\n\n\n- https://translate.google.com.br/translate?sl=auto&tl=pt&u=https%3A%2F%2Fplato.stanford.edu%2Fentries%2Fpascal-wager%2F",
				"added": 1546714178
			}
		],
		"1_1FKnfJqVHrMjUh4RVgFckpyKQecL42SK4F": [
			{
				"comment_id": 5,
				"body": "- Bíblia\n- O Pequeno Príncipe\n- Coleção “Os Pensadores”\n- O Valor da Ciência – Henri Poincaré\n- A elite do atraso: Da escravidão à Lava Jato – Jessé Souza\n- A Ralé Brasileira – Jessé Souza\n- A Arte da Guerra – Maquiavel\n- O Príncipe – Nicolau Maquiavel\n- A arte da Guerra – Sun Tzu\n- O Poder do Hábito – Charles Duhigg",
				"added": 1546715229
			},
			{
				"comment_id": 13,
				"body": "> [babyhulk777](#comment_1_1FKnfJqVHrMjUh4RVgFckpyKQecL42SK4F): Obrigado.Vou procurar e adicionar todos.\n\nDe nada :)",
				"added": 1546728968
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 6,
				"body": "#Coleção \"Os Pensadores\" | 55 livros para download\nA Coleção “Os Pensadores” é uma coleção de livros que reúne as obras dos filósofos ocidentais desde os pré-socráticos aos pós-modernos. O interessante desta coleção é que ela reúne em cada exemplar um pequeno apanhado sobre a biografia do autor em questão e um, dois ou três livros deste mesmo autor, normalmente os títulos mais conhecidos.\n\n- https://mega.nz/#F!NklEVJYY!qfznnm8WAOF6oARZ9VN9oA",
				"added": 1546715400
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 7,
				"body": "#Criptografia negável\nEm criptografia e esteganografia, a criptografia negável é um tipo de criptografia que permite negar de forma convincente que os dados são cifrados, ou de ser capaz de decifrá-los. A negação, embora que não seja verídica, não pode ser verificada pelo atacante sem a cooperação do usuário, que poderia realmente não ser capaz de decifrar os dados. A criptografia negável serve para minar a confiança do atacante e a dúvida se torna em uma forma de proteção.\n- https://sci-hub.tw/10.1109/ARTCom.2009.107",
				"added": 1546716846
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 8,
				"body": "#Mecha-ude\nO protagonista era um estudante do ensino médio com uma vida normal até que um dia ele encontra um braço mecânico muito poderoso e inteligente chamado “Mecha-Ude”. Depois de alguma estranha seqüência de eventos, o Mecha-Ude começa a viver dentro da jaqueta do protagonista e, assim, começa a encher sua vida de problemas. Assim o menino e seu Mecha-Ude lutam juntos enfrentando inimigos e criando amizades.\n\n\n- https://www.superanimes.site/ova/mecha-ude",
				"added": 1546718212
			},
			{
				"comment_id": 9,
				"body": "#City Hunter\nCity Hunter conta sobre a historia de Ryo Saeba que e um sweeper mulherengo, ou seja ele pode ser contratado para todo tipo de trabalho, como investigações, assassinatos e guarda-costas.\n\n- https://www.superanimes.site/anime/city-hunter",
				"added": 1546718385
			},
			{
				"comment_id": 10,
				"body": "#Noragami\n\nNo limite entre este reino e o outro, vivem oito milhões de deuses, espíritos de mortos que servem como deuses. Uma doce garota chamada Iki Hiyori encontra um garoto sem-teto usando um moletom e o salva de ser atropelado, mas sofre o acidente em seu lugar. O garoto que se diz ser um deus chamado Yato, é sem- educação, rabugento, preguiçoso e nunca escuta aos desejos de ninguém, mas ele tem o poder de ser um deus... que ninguém sabia até então.\n\n- https://www.superanimes.site/anime/noragami",
				"added": 1546723670
			},
			{
				"comment_id": 11,
				"body": "#Bakumatsu Kikansetsu Irohanihoheto\n\nÉ dito que quem obter a Cabeça do Conquistador governará toda a nação. Contudo, outro ser chamado “Assassino Eterno” é destinado a se opor Cabeça. Esses dois seres têem estado em conflito desde o ínicios dos tempos, afetando o rumo da história por de trás dos bastidores, influênciando aqueles que buscam poder. Akizuki Yojiro é um mercenário mistérioso e sombrio, ele carrega consigo um artefato sobrenatural de extrema importância para ele. O destino o guia ao encontro de um grupo teatral que busca vingança pela morte da família da líder do grupo, em troca de um favor ele ajuda o grupo a cumprir seu objetivo… e é a partir daí que a historia se desenrola.\n- https://www.superanimes.site/anime/bakumatsu-kikansetsu-irohanihoheto",
				"added": 1546723769
			},
			{
				"comment_id": 16,
				"body": "#Fairy Tail\n\nLucy Heartfilia é uma jovem maga de 17 anos que deseja evoluir e tornar-se uma grande maga. Para isso, ela terá que entrar em uma guilda de magos, para ganhar dinheiro, sobreviver e também aprimorar suas habilidades. Ela chega até a cidade de Hargeon, onde Natsu Dragneel e Happy desembarcam para procurar Igneel, o dragão que criou Natsu como se fosse um filho, e que um dia, repentinamente, sumiu. Lucy, encontra Natsu e Happy ocasionalmente, após envolverem-se com o perigoso criminoso Bora que tenta transformar Lucy em sua escrava. Após salvar a maga, Natsu, que é integrante de uma das mais famosas guildas, a Fairy Tail, convida a garota a juntar-se a guilda. Assim, Lucy ingressa na Fairy Tail, onde começa a viver todo tipo de missão perigosa junto com Natsu e Happy.\n\n- https://www.superanimes.site/anime/fairy-tail",
				"added": 1546742708
			}
		],
		"1_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": [
			{
				"comment_id": 12,
				"body": "#Supere cada dificuldade em sua vida com uma boa dose de fé aliada a uma grande determinação.",
				"added": 1546723815
			}
		],
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": [
			{
				"comment_id": 14,
				"body": "#Material de estudo para concursos e olimpíadas em geral.\n   ‎\n(IME, ITA, EN, AFA, EFOMM, EPCAr, CN, ESSA, EAAr, ESPCEx, ENEM, UERJ, OBM, OBMEp, OBI, OBF, OQERJ, ...)\n\n>>> Bizus(quadros):\n\nhttps://drive.google.com/folderview?id=0B2EQE0cvo_j9ZWM5Mjc3U3ZpYm8\n\n>>> Edições anteriores de olimpíadas e concursos ( provas do ITA resolvidas, questões do ITA separadas por matéria, provas do CN desde 1951):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVLTBoZTRpTDJfX0k \n\n>>> Matemática (Cálculo, coleção F.M.E., banco de questões da OBMEp, alguns livros peruanos e russos):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVVkRCdDhWZUZ4ams\n\n>>> Física (Halliday, Moysés, Tópicos de Física, Ramalho, astronomia e astrofísica):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVa3Q2YVpDeXlYbUU\n\n>>> Química (Feltre, Martha Reis, Peruanos):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVTkJWaHdvOERScHc\n\n>>> Programação (C, C++, Python, Java, JavaScript):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVRXlnQUgwdERfREE\n\n>>> Biologia:\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVQXhQdi15RHJvWWM\n\n>>> Humanas ( História, Geografia):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVZFZIMDVCWHB5dGc\n\n>>> Português ( Cegalla, Pestana, Renato Aquino):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVY09qeVNscWNXblE\n\n>>> Inglês:\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVOWFSQzMyUjN3Ymc\n\n>>> Literatura:\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVck9QU2RCVkstYWs\n\n>>> Técnicas de resolução e demonstração em matemática/física ( material avançado)\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVdHFWWjVwNmNfdzg\n\n>>> Teoria do POTI( Polos Olímpicos de Treinamento Intensivo):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVWTlsX0VrNmZJTHc\n\n>>> Material de turma especial CN/EPCAr ( desde 2015):\n\nhttps://drive.google.com/folderview?id=0B8gnfxVjcjVVSG02azJUazFEVDg\n\n   Estes materiais são apenas uma árdua coletânea por diversos sites na intenção de facilitar a busca por livros e não temos intenção de ferir os direitos de nenhum dos autores. Caso desejar entrar em contato para envio de materiais que possam ser incluídos, mande ao seguinte email: hugorafell@gmail.com\n   ‎\n   #Feito por:\n      - Hugo Rafael de Lima\n      - Marcus Vinícius Miranda\n\n   #Bom estudo!",
				"added": 1546729198
			},
			{
				"comment_id": 15,
				"body": "IME - PROVAS ANTERIORES\n- http://www.ime.eb.mil.br/pt/provas-anteriores-cfg.html",
				"added": 1546732477
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 17,
				"body": "#Processos de transporte de nano para macro\n\nEste curso visa uma compreensão fundamental de ferramentas descritivas para processos de transporte de energia e calor, de nanoescala para macroescala. O aluno aprenderá ainda mais as aplicações em nanotecnologia e microtecnologia.\n\n- https://www.youtube.com/playlist?list=PLUl4u3cNGP63jpW5Wg3MpmJIei_PCS_03",
				"added": 1546746509
			}
		]
	},
	"comment_vote": {
		"14_1Jy4MpB9RL2RpURd3VVdNWCw8nsstCXd5U": 1,
		"9_1Ms9usgvtM6au9xLaDNivYSyPgjjE6USW4": 1
	}
}