{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1516525953_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": ">I already wrote above in the thread that I spent on that ZeroTalk 20kB from the available 50kB.\n\nThe limit can be increased.\n\n>Especially in the light of the fact that constructive communication has stopped - the opponents stopped listening to me\n\nThis is really the best quote. When you don't listen to your opponents, it's constructive; when opponents don't agree with you, it's non-constructive. Is that what you call \"critical thinking\" and \"not succumbing to propaganda\"?\n\n>You operate with unsubstantiated slogans of Western propaganda\n\nIf you think that repeating this mantra will make it true, i have a bad news for you. I'm still waiting when you'll point out to me which western propaganda i read/watch/listen. I'm really curious.\n\nAnd, if you analyze your statements a bit deeper, you'll notice that i can say \"you operate with unsubstantiated slogans of kremlin propaganda\" and it will be as unsubstantiated as your claim about me. Which is why i don't say it. Sometimes you simply cite it, sometimes you use the same techniques, but that doesn't mean i should dismiss all your statements as false. Really, the only definite issue with you personally (and not your statements) is that you are overconfident and evade unpleasant statements.\n\n>If you are interested in something specific, as I wrote above, let's discuss.\n\nYou have not answered on any of my statements that are unpleasant to you. I gave you specific links to russian news sites and russian opposition statements and you are ignoring the latter and dismissing the former. I have repeatedly told you that your statements about russian population being more critical and 86% support putin are contradictory and you happily ignored it, instead arguing about whether 86% is actually true or not. You're trying to ignore the facts that you're citing (even if unintended) kremlin propaganda a few statements after you implied you're critical towards it.\n\n>You accuse me of the non-representativeness of the example. But you are doing the same. These are isolated cases that do not reflect the overall picture.\n\n*Any single case* is enough to refute your statement that \"in Russia no one actively suppresses the opposition\". And if you claim to be living in russia and can't be troubled to look up more cases, then you have a problem.\n\n>Moreover, such cases are not exceptional in general world practice. Do you recall the treatment of dissatisfied protesters in the US?\n\nYeah, time to follow the favourite move of kremlin propaganda. If you can't deny something bad about russia, say that everyone does the same. You know what? I don't fucking care. If you want to discuss political oppression in usa, open another thread, give the proofs and discuss it there. And then if you want, open another thread for comparison of russian and western oppression. I don't have unlimited time to go on tangents like this when you prefer to forget your old statements and make new and new claims.\n\n>Believe me, I do not see anywhere else in Russia anywhere else\n\nThat's your problem. You want people to believe you, but you don't want to believe anybody else. You think you're informational god and know the truth and should translate it to the ignorant masses. But that's absurd.\n\n>Can you refute this with concrete facts?\n\nI have no need to refute your perception of the world around you. You're making the claim about 86% and it's your obligation to prove it.\n\n>I communicate on the Internet - except for narrow resources, where the dissatisfied, the general tone of the attitude towards the authorities is about the same.\n\nThat's really laughable. Internet is filled with various troll groups and individuals who have nothing better to do than to post comments like \"putin is god\" or \"putin is shit\". Those masses make the general tone.\n\nOh, and i should probably mention it again. No single person can reasonably assume that by living in some country they know everything about it. If you assume that, you're deceiving yourself.\n\n>This statement is based on a false premise of Putin's unpopularity in Russia :) Therefore, regardless of its truth, according to formal logic, it is meaningless. The meaning of the general implication becomes a lie.\n\nThat's just bullshit. There's no premise about popularity in domitori's statement. The statement literally says \"**if** not enough votes\".\n\nWhat you're trying to do is create a stronger statement \"putin is unpopular in russia **and** he'll not get enough votes **and** votes will be faked\" and then fight with it.",
				"added": 1516553097
			},
			{
				"comment_id": 2,
				"body": ">I can not increase this limit. So the remark is meaningless.\n\nYou can ask admin.\n\n>I'm afraid this is an electronic translation problem\n\nOk, finally we're arriving at this. Have it not occurred to you that maybe you do not understand what people write to you because you're using \"electronic translation\"? Then what's the point? To write lengthy monologues which meaning can be lost in translation?\n\nBut, since i'm still interested in getting proper response from you, here goes.\n\n>I do not know what specific sources you use. But I see how you write a typical Western propaganda lie that has nothing to do with Russian reality. Conclusion - You use the data of Western propaganda, without bothering to check this information yourself.\n\nВ этом-то и есть твоя главная проблема. Ты в каждом несогласном видишь либо одураченных, либо врагов; делаешь выводы на основании соответствия человека определённому шаблону. Так никакого моста не построить, можно лишь посеять вражду. Фактически распространяя своё безапелляционное мнение, ты отстаиваешь ту же картину мира, что и kai0, с которым ты номинально борешься.\n\nИтак, возвращаясь к 86%. Во-первых, тут не один предмет спора, который ты почему-то постоянно пытаешься навязать, а два. С самими процентами разберёмся ниже, а ты всё-таки ответь, как это так получается, что в твоей картине мира 86% поддерживают Путина и при этом в России более развито критическое отношение к государственной пропаганде? Ты действительно не видишь здесь противоречия?\n\nТы говоришь, что большинство подозрительно относятся к пропаганде, но сам же повторяешь её, причём зачастую вещи совсем абсурдные.\n\nНо раз уж так хочется обсудить т.н. \"факты\", то давай.\n\n>I see official statistics from an independent foreign agent.\n\nНе имеет значения, нарисовали им ярлык иностранного агента или нет. Я ещё раз повторю: чтобы осмысленно обсуждать цифры, надо понимать, как и откуда они берутся. Допустим, в леваде хорошие специалисты (1). Допустим, они честные и хотят измерить реальный уровень одобрения (2). Что они делают? Правильно, идут и спрашивают людей. А люди что? Кто-то дверью хлопнет, кого-то дома не окажется, кто-то не станет отвечать, а кто-то даст социально-одобряемый ответ. И как померить этот процент \"брака\"? Без дополнительных исследований - никак.\n\nИтак, получается, что даже при двух допущениях цифра в 81% (на ноябрь) имеет неопределённо большую погрешность, если наша цель узнать реальное мнение людей, а не померить то, как они отвечают на заданный вопрос.\n\n>When Putin's rating dropped to 50%\n\nЧто-то в этой вашей леваде с 2000 года одобрение ниже 61% не опускалось. Кому верить?\n\n>I see that everything happens with my own eyes.\n\nНу что может видеть один человек? Я ещё раз повторю, среди моих знакомых поддержка Путина на западе выше, чем в России. И что? Я же не экстраполирую это на всех.\n\n>the period of the collapse of the MTSP\n\nТут видимо тоже переводчик постарался - этот MTSP найти не удаётся.\n\n>I see what scale protests cause specific levels of discontent\n\nНу да, так же проще мир воспринимать. Определённый уровень недовольства всегда должен выражаться в одинаковом уровне протестов. А то, что людей стали больше сажать и штрафовать, то, что они видят, что протесты так ни к чему и не привели, ты не учитываешь?\n\n>This is a complete fiasco.\n\nФиаско путинской России, да. Теперь даже власть не может знать свой реальный уровень поддержки. И может быть ещё шесть лет всё пройдёт спокойно, а может где и рванёт. Заткнуть-то протест можно, но это же не вечно. Пока есть возможность свободно высказываться, власть может слушать и кидать подачки. Когда эту возможность убирают, уже и подачку не кинешь, потому что неизвестно куда и кому.\n\nНу и да,\n\n>tens of thousands went to rallies. Now rallies are gathering only hundreds of people\n\nЭто опять-таки какие-то альтернативные факты. Вот, даже [мвд сообщает](https://77.мвд.рф/news/item/9747393/) о 7-8 тысячах в Москве. Дальше думаю сам найдёшь.\n\n>You have selected several individual facts that do not reflect the overall picture\n\nВ том-то и дело, что это отдельные случайные факты, которых можно найти сколько угодно. Я-то по наивности думал, что ты если захочешь, поищешь ещё, но оказывается нет. Ладно, вот нашёл для тебя [доклад](http://nemtsovfund.org/cp/wp-content/uploads/2017/07/Report-Persecution-2017-1.pdf).\n\n>Detaining a protester is a common thing in any country in the world\n\nДа при чём здесь другие страны-то? Ты же про Россию заявил, что оппозицию не прессуют.\n\n>We do not know the details of this story\n\nДа, потому что вместо того, чтобы поинтересоваться похожими случаями, ты начинаешь рассуждать об одном изолированном. Задерживать за шарики, уточки и другую символику стало нормой.\n\n>Up to the attack on police officers\n\nАга, [причиняют физическую боль](https://ovdinfo.org/stories/2017/05/18/skolko-poluchayut-policeyskie-v-kanade-eto-ego-koronnaya-fraza-byla), как же.\n\n>Why do you think that Putin threw the pig's head?\n\nНу вот опять пытаешься приписать другим свои мысли.\n\n>If the majority in the country supports official power, then the opposition appears enemies\n\nА вот это интересная мысль. Почему в других странах такого в подобных масштабах нет? Потому что мышление \"менее критическое\", как ты утверждаешь?\n\n>And Navalny, in fact, there are many enemies. He will envy the Russian people and the people will reciprocate with him.\n\nНа это отвечать не буду, ибо опять виден кривой перевод.\n\n>This reference is generally irrelevant. This is some internal disassembly of officials. Here, for example, read here about Nikolai Dijur: http://www.compromat.ru/page_33300.htm\n\nЭто про то, что даже избранные при нечестных выборах оппозиционные депутаты сталкиваются с проблемами. Так что очень даже relevant. Вот, например, [ещё обзор про московских депутатов](https://www.znak.com/2017-11-09/pobeda_nad_er_okazalas_dlya_moskovskih_nezavisimyh_deputatov_tolko_nachalom_borby).\n\n>I do not understand how this story relates to the Russian opposition and Putin's rating\n\nС рейтингом Путина, конечно, никак. А эти ссылки никогда и не относились к рейтингу. Если ты не заметил, я их привёл в ответ на абсурдные утверждения про то, что в России не давят оппозицию.\n\n>Правозащитный центр «Мемориал» признал его политическим заключенным.\n>Правозащитники из «Мемориала» не исключили, что арест Дмитриева связан с его профессиональной деятельностью. \n>О политической мотивированности обвинения говорил и источник «Новой газеты», близкий к полиции Петрозаводска. По его словам, Дмитриева могли задержать из-за его обещания составить карельский «список палачей»\n\n>This happens in any country in the world and in Russia as well.\n\nДавай не надо опять скатываться на другие страны.\n\n>As you can see, the examples given by you in no way can refute the thesis of Putin's high popularity in Russia.\n\nАга, а надо было внимательные читать. Они никак с рейтингом и не связаны. И ещё раз повторю, что мне в общем-то и опровергать твой тезис не надо, пока ты его не доказал. Я же не называю тебе каких-то цифр \"реального рейтинга\", я лишь указываю на то, что миф о 86% - не более, чем удобная идеологическая конструкция.\n\n>In the Russian language, the phrase \"no one supports\"\n\nА там в оригинале в общем-то, не про поддержку, а про репрессии:\n\n>For the West it's amazing, but in Russia no one actively suppresses the opposition.\n\n>Speaking specifically about Navalny, in 2012-2013, at the peak of its popularity and in the period of Putin's minimal popularity, the rating of Navalny reached 5%\n\nОткуда такие цифры?\n\n>Now his rating has fallen dramatically and, most likely, has not even 1%\n\nОпять же, откуда? Какой вообще рейтинг? Если про рейтинг Путина хотя бы понятно (86% на леваде - это рейтинг одобрения деятельности), то что это за рейтинг Навального? И вообще, эти 5 и 1% это один и тот же рейтинг или нет?\n\n>At the meetings Navalny now only come for 200-400 people.\n\n..в городах, где и митингов-то других нет.\n\n\nИтак, в заключение. Мне, в общем-то всё равно, какая у Путина поддержка, 86%, 63%, 41% (число голосов от всех, имеющих право голосовать, на предыдущих несвободных выборах) или вообще какая-то другая. Куда важнее то, что проверить эту поддержку не представляется возможным и в этой ситуации тиражировать любую из этих цифр как абсолютную попросту глупо.\n\nКроме того, если предположить верность этой цифры, выводы-то получатся неутешительные. Стоит только сравнить эти 86% с рейтингом парламента и правительства, как станет понятно, что значительная часть этих % - результат пропаганды \"царь хороший, бояре плохие\" и \"а кто если не он\". Что опять же и даёт повод троллям вроде kai0 писать про тупую нацию.\n\n\nНо это всё было про 86% и гонения на оппозицию. На всё остальное ты так и не ответил. Если опять что-то было непонятно, так и пиши, я переведу.",
				"added": 1516589175
			},
			{
				"comment_id": 3,
				"body": ">Пока один вопрос — в каком году Вы уехали из России?\n\nИнтересно, почему ты думаешь, что я отвечу на столь глупо поставленный личный вопрос, учитывая что ты так и продолжаешь игнорировать все противоречия в своих построениях?\n\nЕсли непонятно, почему вопрос поставлен глупо, поясню: он подразумевает, что я (а) длительное время постоянно жил в России и (б) уехал из неё на длительное время (или насовсем).\n\nНеужели тебе не приходило в голову остановиться и подумать, что когда ты пишешь подобные глупости, ты лишь усугубляешь свою позицию? Или тебе настолько надо вписать каждого в свою уютную картину мира, что никак не можешь удержаться?",
				"added": 1516638501
			},
			{
				"comment_id": 4,
				"body": "Ну, у кого критическое мышление работает, сам рассудит у кого не было конструктива, лол.",
				"added": 1516727363
			}
		]
	},
	"comment_vote": {}
}