{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1575254631,
			"title": "Cryptoid download manual here",
			"body": "here was also bugged when I tried downloading on other computers for testing here.\n\nI will upload it so that people can download it manually.\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1D6cBRJ9UAvDBydE5Mkz2bA5neR8HAkTrx/1oWoUktrXo1p6vkviJUyHzXTh\n\n================================\noriginal pt-br\n\naqui também estava bugado quando eu tentei baixar em outros computadores para fazer testes aqui.\n\nEu vou upar ele para o pessoal poder baixar manualmente.\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1D6cBRJ9UAvDBydE5Mkz2bA5neR8HAkTrx/1oWoUktrXo1p6vkviJUyNXkGHyWznTtRH.zip",
			"added": 1575254630
		}
	],
	"topic_vote": {
		"1575374057_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1575254631_1D6cBRJ9UAvDBydE5Mkz2bA5neR8HAkTrx": [
			{
				"comment_id": 1,
				"body": "> [bonfire](#comment_3_1APPNBNF1oxMipeD7mZswXvwtgFLvQoZ2D): [13:38:10] - UiWSGIHandler error: TypeError: memoryview: a bytes-like object is required, not 'str' in UiServer.py line 41 > pywsgi.py line 924 > pywsgi.py line 910 > pywsgi.py line 757 > pywsgi.py line 778 > pywsgi.py line 742 > pywsgi.py line 704 > _socket3.py line 457 > _socket3.py line 45\n\nhi, i just downloaded it and used it on another pc here and it worked, didn't it work for you?\n\nStrange, here it worked, does it have to do with the internal network here, is it communicating directly with my other, on the other pc?\n\nThis must be it.\n\nBut strange, alias is strange that cryptoid is not working normal.\n\nThis will be another function that I will try to implement in big kopy kate 2, which is an internal login, next to the site, besides these other login systems like zeroid, kaffieid and etc.\n\nI will try to make big kopy kate 2 as decentralized as possible.\n\n=============================\noriginal pt-br\n\noi, eu só baixei ele e usei em outro pc aqui e tinha funcionado, não funcionou para ti ?\n\nEstranho, aqui funcionou, será que tem haver com a rede interna aqui, será que ele está se comunicando direto com o meu outro, no outro pc ?\n\nDeve ser isto.\n\nMas estranho, alias é estranho o cryptoid não estar funcionando normal.\n\nAlias isto vai ser outra função que vou tentar implementar no big kopy kate 2, que é um login interno, junto do site , alem destes outros sistemas de logins como zeroid , kaffieid e etc.\n\nVou tentar deixar o big kopy kate 2 o mais descentralizado possivel.",
				"added": 1575321365
			}
		],
		"1575339719_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 2,
				"body": "used the Big Kopy Kate 2 \n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Home\n\n\nit is more decentralized, already has cryptoid support and I am working to add other login systems.\n\nAnd I'm working to add playlists, channel lock button, our famous zerome mute.\n\nThere is also already supports videos up to 15GB, but unfortunately I still had to leave the file size limited data.json users to 2mega, because I saw that bugs the site, if I leave larger than 2 mega, because only a few They were watching the videos I uploaded after it was over 2 mega.\n\nAnd my main goal is to be the simplest and easiest to use the site.\n\nI'll see if I can also add support for more languages ​​on the site, like pt-br support and etc.\n\nThere is, another important thing, I WON'T BLOCK ANYONE on the site, no matter what the guy's content, for that I want to implement the channel block button as soon as I WILL NOT BLOCK spammers and etcs, I think EVERYONE has to have freedom and the The only way is to give people complete freedom, because there is no half freedom.\n\nRemembering that if the guy does shit, the authorities will probably find and arrest the person.\n\nBut I won't move a straw to stop anyone from talking or posting anything you want.\n\nThe only thing I'm going to do is try to implement the channel lock function so we don't have to watch shit\n\n========================\noriginal pt-br\n\nele é mais descentralizado, já tem suporte ao cryptoid e estou trabalhando para adicionar outros sistemas de logins.\n\nE estou trabalhando para adicionar playlists, botão bloquear  canais, o nosso famoso mute do zerome.\n\nHá ele também já tem suporte a videos de até 15GB , mas infelizmente ainda tive que deixar limitado o tamanho do arquivo data.json dos usuários a até 2mega, pois vi que buga o site, caso eu deixe maior que 2 mega, pois somente alguns estavam vendo os videos que eu enviava, depois que passava de 2 mega.\n\nE meu intuito PRINCIPAL, é ser o mais simples e facil de usar o site.\n\nVou ver se também consigo adicionar suporte a mais linguagens no site, tipo suporte ao pt-br e etc\n\nHá , outra coisa importante, NÃO VOU BLOQUEAR NINGUÉM no site, não importa o conteudo do cara, para isto quero implementar o quanto antes o botão de bloquear canais, pois NÃO VOU BLOQUEAR spammers e etcs, acho que TODOS tem que ter liberdade e a unica maneira é dando TOTAL liberdade as pessoas, pois NÃO EXISTE MEIA LIBERDADE.\n\nLembrando que caso o cara faça merda, provavelmente as autoridades vão achar e prender a pessoa.\n\nMas eu não vou mover uma palha para impedir ninguém de falar ou postar o que quiser.\n\nUnica coisa coisa que vou fazer é tentar implementar a função de bloquear canais , para não precisarmos ficar vendo merda",
				"added": 1575371788
			}
		],
		"1575374057_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 3,
				"body": "KickAssTorrents  http://127.0.0.1:43110/1LBr1dHoXvJAMjDgW8Wcg5kbCoKyJnzo6p\n\nplay (torrent) http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1575374489
			},
			{
				"comment_id": 4,
				"body": "yes",
				"added": 1575374496
			}
		]
	},
	"comment_vote": {
		"15_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"3_1APPNBNF1oxMipeD7mZswXvwtgFLvQoZ2D": 1,
		"274_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1_18BU8cPZhTo3jPVUyVzVHPzwfSxXDeFHPQ": 1
	}
}