{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1575485461,
			"title": "Safe to use fitness tracker?",
			"body": "So for a while I've been considering grabbing one of those fancy ass fitness trackers to help me try and organise my workouts more effectively.\nBut So far it looks like our options are fitbit (now owned by google) or a plethora of chinese companies who are all equally shady as fuck.\n\nFor the security conscious among us. Is it possible to have such a device? Are there no reputable manufacturers who will not seek to fuck us?\nOr are we forced to try and make one ourselves?",
			"added": 1575485460
		}
	],
	"topic_vote": {},
	"next_comment_id": 80,
	"comment": {
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": [
			{
				"comment_id": 1,
				"body": "It'd be nice if 08chan wasn't a total mess.\nMillchan is better but that isn't a high hurdle. \n\nIt's weird adapting to this whacky torrent based distributed internet thing because its baffling how some sites work well while others don't and then it all shits itself at some point for no obvious reason.",
				"added": 1565401207
			}
		],
		"1565346520_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 2,
				"body": "> [hdidnothingwrong](#comment_5_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe):But if you are running it on a desktop 60GB is not a big deal.  Nowadays a 2TB hard disk is about $54, which means 60GB is less than $2 worth of storage.\n\nI think the problem is more how long it would take to download. 60GB is only nothing if you're living in a major urban area with high speed internet.",
				"added": 1565401872
			},
			{
				"comment_id": 5,
				"body": "> [fodase](#comment_20_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): Most of the edits on Wikipedia are made by corporations and governments. Here's an example :https://en.wikipedia.org/wiki/United_States_Congressional_staff_edits_to_Wikipedia [...]\n\nI find that for scientific and technical subjects wikipedia is relatively reliable. \nAnd I suspect there will come a day when this information is restricted to the general public.",
				"added": 1565432382
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 3,
				"body": "I'll admit I'm not a good programmer or familiar with zeronet in any extensive capacity. But it seems to me that overall zeronet demands a lot in terms of resources that can make it hard to use for media heavy sites like say an imageboard. \nAnd some of the innate drawbacks of this seemingly torrent based network is that the system seems to shit itself when lots of people try to access something at once.",
				"added": 1565402343
			},
			{
				"comment_id": 8,
				"body": "> [undisclosed](#comment_16_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Doing the lord's work anon.  Now if only I could get more than 0/5 peers with 08chan. \n\nI'd justbe happy with being able to post.\n\nAlso Kaffie I looked at that link. I just get a blank page with the MC logo and no boards.\n",
				"added": 1565433596
			},
			{
				"comment_id": 10,
				"body": "> [kaffie](#comment_961_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Oh, whoops. I thought there was a default board. http://127.0.0.1:43110/13kifcv8J8noDEXdztXY4qkPPPKLK2PiAe is the default millchanhub board. [...]\n\nSo why use this instead of the other millchan? \nConsidering that one is pretty much feature complete as is and works out the box with zero effort",
				"added": 1565434529
			},
			{
				"comment_id": 11,
				"body": "> [kaffie](#comment_962_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The big reason is that the boards are separated into hubs, meaning that the admin can't fuck you over by taking down the site or messing with your posts (each board would be ran by it's creator). Likewise you don't have to download boards/content you don't want to see. Whereas you have to by default with 08chan. Lastly, all of the images are stored as optional files, which can be spoilered/hidden behind a click, meaning you don't auto-dl images, keeping you safe from auto-dling/sharing stuff like CP. I wasn't even aware there were CP boards for the merger millchan, and only found out when I viewed it from a proxy (which has different boards dl'd). [...]\n\nOk so you explained why not to use 08chan. But why not millchan then?",
				"added": 1565436847
			},
			{
				"comment_id": 12,
				"body": "So wait what is a merger site?",
				"added": 1565440231
			},
			{
				"comment_id": 13,
				"body": "Honestly the idea of a lack of anonymity is concerning.\nIn many ways the chans have always pursued a goal of true anonymity. So with what I'm learning about zeronet, it seems it could be a step back for us. But one we may be unfortunately forced to take.",
				"added": 1565440841
			},
			{
				"comment_id": 14,
				"body": "Ok so how do I add the other boards to this merger site? \nThe links you provided seem to work but I'm unsure how to generate such things for other sites",
				"added": 1565442722
			},
			{
				"comment_id": 16,
				"body": "Yeah doesn't seem to be auto adding them to the merger list. Though I do have the merger list now. This is a neat functionality overall if it is somewhat finicky",
				"added": 1565445715
			},
			{
				"comment_id": 18,
				"body": "> [kaffie](#comment_973_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Try opening the sidebar and clicking reload/rebuild for the db?\n\nNope doesn't seem to do it. Tried another one of the links you posted and sure enough it did it. Dunno what you did with them but they seem to work perfectly.",
				"added": 1565447820
			},
			{
				"comment_id": 20,
				"body": "> [kaffie](#comment_976_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Basically the merger site, if it's working properly, will pull in all sites of a particular category. In the zerohello site list you should see \"Merged: Millchan\" along with a list of sites under it. Those sites are what should be pulled in and appear on the site as boards. If it's not, something got messed up along the way. [...]\n\nYeah doesn't seem to want to pull them from me visiting the regular millchan site. \nBut yeah I definitely see the advantages. \n\nWhen I visit the links you posted I get a blank page with this text in the top left:\n\"Please use Millchan Engine to browse profiles on this page. \"\nThen its added the merger site and my zerohello page.\n\nBut when I go to millchan itself and visit boards there it all functions normally without adding them to the merger.",
				"added": 1565448221
			},
			{
				"comment_id": 22,
				"body": "> [kaffie](#comment_978_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The millchan site should only show what boards you have downloaded. That's the entire point. I had thought there was a default board to start, but it seems not. [...]\n\nOk now I'm confused.\nSo whats this site?\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/",
				"added": 1565449179
			},
			{
				"comment_id": 23,
				"body": "> [ssdifnskdjfnsdjk](#comment_884_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): This is Millchan. The site without merger feature. It is the site 08chan was clonned from and Millchan has more up to date code. The site with merger feature is called Millchan engine or Millchan merger. You will likely see no boards on MC Engine, because you need to first visit some board site (aka \"hub\"), you can find one when you click the link \"Example hub\" on this page where is MC engine introduced. The link is on the bottom of the first post. That Example hub will add new board to the Millchan engine site and inside the board you can find a topic with more boards and a guide how to setup your own discussion board.\n\nYeah I'd gotten that far. \nSo can't add sites to the merger hub thing by visiting the non-merger millchan?",
				"added": 1565452593
			},
			{
				"comment_id": 24,
				"body": "> [ssdifnskdjfnsdjk](#comment_886_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Unsure if i understand. Browsing non-merger Millchan site will not add any hub to the Millchan Engine site. Only when you visit special zeronet site that is a Millchan Engine hub (or also called merger site), then i think you should be prompted whether you want to add it to the Millchan Engine. Once added, new board will appear in the list or Millchan Engine boards.\n\nAhhh there we go. All misconceptions cleared up now.",
				"added": 1565454840
			},
			{
				"comment_id": 26,
				"body": "that you have millchan and millchan engine is quite confusing.",
				"added": 1565457913
			},
			{
				"comment_id": 31,
				"body": "> [toyata](#comment_95_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Is there any plan or willingness to try a merger based version of 08chan?I think many people would stand by to help in that case.\n\nSome kind of merger site with a catalogue available on the front page so you can limit what you download would be the best way to go.",
				"added": 1565611680
			}
		],
		"1564963792_17i73awrYG3UfPMGBeDo3J4XuadYwctRvz": [
			{
				"comment_id": 4,
				"body": "I use a pair of those barefoot running shoes made by vibrams. \nPricey but definitely nice, though the sizing can be a royal pain",
				"added": 1565402484
			}
		],
		"1565324173_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": [
			{
				"comment_id": 6,
				"body": "QAnon is nothing more than a deep state psyop designed to discourage action.\n\"Trust the plan\" and do nothing goy. \nNo one is coming to save you. The only ones who can fix things are the people. Organise. Fight.",
				"added": 1565432516
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 7,
				"body": "It's sounding almost like you're advocating for some form of association to be in charge of zeronet and its future. \nWhich wouldn't exactly be a bad idea but runs into the dangerous problem of maybe creating a group who can be coerced by spooks.",
				"added": 1565432690
			}
		],
		"1565382642_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw": [
			{
				"comment_id": 9,
				"body": "In general 08chan seems to be a hot mess right now. \nBetter to just use millchan for now until the owner gets his shit together",
				"added": 1565434094
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 15,
				"body": "> [torkrench](#comment_4_16yDTXBd1txmFZkNmZ2LWvLdcqbn39ZwfD): Source or bullshit.\n\nhttps://www.hollywoodreporter.com/news/jeffrey-epstein-dies-by-suicide-new-york-jail-report-1230708\n\nNot exactly the best source but sufficiently trustworthy for our purposes here.\nIn all probability it seems that when he failed his earlier ploy to attempt suicide as a means to get the house arrest (and chance to flee to Israel) he wanted. One of his customers decided it was better to be safe than sorry and made sure Epstein wouldn't become a problem for them.",
				"added": 1565445543
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 17,
				"body": "> [ayylmaolol](#comment_14_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): btw. why do we even consider a surgery to change your physical body to be a treatment for a mental issue? This reminds me very strongly on how we used to cure schizophrenia with lobotomy and i personally think that in a few decades we will look back and we will be disgusted at about how we mutilated trannies. Spending hours per day dilating to keep your body from sealing the open wound that you call vagina.... for your whole life.... just because some political ideology was forcing it as progressive and tricked you into thinking that this would solve your mental issue.\n\nFun fact. A lot of the early pioneering work in this field was destroyed by the Nazis. Overall probably a good thing. \n\nBut in general the reason it became pursued as a \"solution\" these days is because with a lot of mental illnesses there isn't a cure. Whether you focus on therapy like they do in Europe or drugs like they do in North America. Either way the actual goal is the same: Management of their condition. \nWith psychiatry your goal is very rarely to cure their ailment but to make it something that is manageable, that they can live with. \n\nFor some psychological abnormalities/mental illnesses this is very easy. For ones like homosexuality there isn't much needed at all aside from some education on how not to become a sexual typhoid mary. \nBut for others especially the body identity ones? It gets a lot harder. There's not much you can do to address the discomfort an adult victim (child victims are almost always displaying this behaviour as a symptom of another problem) of these disorders has with their own body. No amount of therapy is really going to help and I've not heard of any drugs that alleviate it either, don't even want to imagine what mechanisms such a drug would work on. \nSo for many years the only real solution was to encourage them to crossdress a bit in any avenue where it was appropriate (theatre was a popular one) \n\nSo when surgical solutions were redeveloped there was a lot of excitement. As it presented an opportunity of a permanent fix to the problem. Humans love quick fixes. Its in our nature. \nEssentially in many ways it's similar the thalidomide problem. It presented remarkable results early on but on examination of later outcomes it paints a horrifying picture. \nPost op trannies have a shockingly higher suicide rate along with depression rate. Regret is a common theme among many. \n\nAnother problem that may contribute to this is how many post op trannies essentially get dumped by the support networks that helped them get to where they are. \nOnce you've undergone surgical intervention then thats it. You're done. You're expected to get along on your own as a woman now. Most of the advocacy groups and communities don't want anything more to do with you and certainly aren't interesting in you \"poisoning\" their communities by complaining about the outcomes of your surgery or asking questions.\nSo couple an extreme life change that has a lot of negative outcomes along with losing a large chunk of your social support network? Not pleasant. \n\nMy earlier comparison to thalidomide was not coincidental as I feel that in the long run they will be compared in a similar fashion.\nAnd at the same time I suspect they will both enjoy something of a resurgence in a more careful and targeted capacity, as thalidomide has recently experienced as a cancer and leprosy treatment.",
				"added": 1565447397
			},
			{
				"comment_id": 19,
				"body": "> [r3naam3r](#comment_17_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): Do you agree with such statement:\"Yellow race has the best intellectual potential but worst physical, white race is in the middle, and the black race has best physical potential but worst intellectual\".? [...]\n\nEh I'm an outright fascist too and I find these kind of claims somewhat dubious. \nEspecially considering Asias shall we say less than stellar outcomes in regards to most nations.",
				"added": 1565448002
			},
			{
				"comment_id": 21,
				"body": "> [kaffie](#comment_977_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Africans indeed seem to be the worst off in terms of orderly societies and revolutionary progress, but they definitely have the best physical potential.\n\nEhhh not really. Some specific parts of Africa do seem to consistently throw out people with traits that make them ideally suited for a particular sport. I recall reading a lot of the black sprinters can trace their lineage to a specific valley. \nBut their heightened average physicality compared to whitey seems to have more to do with them being able to better shrug off the damage to testosterone production that so blights us in the developed world. And producing more of it to begin with (probable contributor to the heightened aggression)\n\nYou're spot on in regards to Asians though. A weird and pretty unique phenomena throughout Chinese military history is the immediate absorption of defeated armies into the victors. \nIn our part of the world that sort of thing only happened post conflict or with efforts to recruit their leadership. Otherwise defeated armies would scatter or be wiped out.",
				"added": 1565449110
			},
			{
				"comment_id": 25,
				"body": "> [aspidochelone](#comment_41_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):  Letting them get free procedures in the military instead of disqualifying them for medical reasons was highly dubious, but giving everyone free health care by right would be ideal. \n\nOh fuck no this is the right thing to do for the USA. You can't let the trannies in the military.\nSee in the USA once you join the military the US government takes on responsibility for your healthcare for life. \nAnd a trannie who transitions is a patient for life. \n\nSo each one who joins the military represents a massive burden to the taxpayer. \nWhats more if they start offering the surgeries and hormones essentially free to them, you'll have trannies breaking down the doors to join the military. The costs would be quite horrific longterm as they would for a long time only ever go up.\nAnd these aren't mentally stable people to begin with, so you probably don't want them near weapons.",
				"added": 1565457717
			},
			{
				"comment_id": 28,
				"body": "As expected the trannies make everything about them and force us to focus on them ignoring more important topics.",
				"added": 1565540864
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 27,
				"body": "Cos he couldn't secure the house arrest he needed in order to escape his customers had him killed.\nPeople like to think the ruling class are all powerful but really their power comes from being able to control who gets into important posts in government and the civil administration.\n\nThat's how things like the court case against Epstein happen in the first place. Those bringing the case up and judging it weren't part of the ruling class or their hangers on. So they couldn't just tell them to drop it or overtly influence the case without drawing attention.",
				"added": 1565463970
			}
		],
		"1565593853_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 29,
				"body": "MATE",
				"added": 1565611276
			}
		],
		"1565601152_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 30,
				"body": "Consider all the narcotics and underage prostitutes they're into.\nThey're likely riddled with disease as a consequence. Do you really want that crap in your body?",
				"added": 1565611512
			}
		],
		"1565695545_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 32,
				"body": "And you called us whacky neonazi types conspiracy theorists",
				"added": 1565703918
			}
		],
		"1565638982_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 33,
				"body": "> [223556](#comment_83_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Wrong.The labor howard provides is worth more , remember that he is not the owner, he is an employee. He is at the helm of a giant corporation and the moves up there matter alot, his salary is that big for a reason.  [...]\n\nProblem with that line of reasoning.\nHis renumeration is not dependent on performance. He gets paid if he fails and crashes the company. He gets paid if it succeeds wildly.",
				"added": 1565704138
			}
		],
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 34,
				"body": "I would argue it's inherently fascist due to the heavy focus on cooperation towards a greater purpose.\nBut whatevs",
				"added": 1565704181
			}
		],
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 35,
				"body": "Realistically the best approach is a hidden machine. As in physically hidden.",
				"added": 1565968373
			}
		],
		"1565969602_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 36,
				"body": "Is simple comrade. You must seize the means of reproduction",
				"added": 1565973281
			}
		],
		"1566012765_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 37,
				"body": "Because back then family was more heavily involved in marriage.\nSo creepy fuckers were kept away from women since the parents would be the ones deciding who she married.",
				"added": 1566129604
			}
		],
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 38,
				"body": "So would these cameras be fucked by IR LEDs?\nI recall that being a good trick to deal with ubiquitous surveillance.",
				"added": 1566129663
			},
			{
				"comment_id": 39,
				"body": "Used to be with old security cameras you could rig a few IR LEDs on your hat, crank em up and the camera would just see a white spot about your head/upper torso. \nNot tried this in years so unsure if it still works.",
				"added": 1566137225
			},
			{
				"comment_id": 40,
				"body": "> [trevorlaneray](#comment_92_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): I'd go for nothing less than a full 360° array of LEDs to be safe.Thinking more on it, I wonder if the IR emission of the camera's own LEDs could be used against it by employing retroreflectors. Probably not... would be interesting to test.\n\nYeah used to have them fitted onto an american style baseball cap. Some around the rim and more on the fabric part of the hat itself.\nWorked pretty well overall. \nBut could only cover the head/upper torso area.",
				"added": 1566137545
			},
			{
				"comment_id": 41,
				"body": "> [trevorlaneray](#comment_93_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Hmm. There's an abundance of caps that have regular old LED lights on the rim for lighting the area in front of you at night... Could be easy to replace those LEDs with IR ones, and even add more, keeping most of the built-in circuitry, then upgrading the battery to power the array in parallel so as to handle the extra load. :D\n\nGot a hat like that too. They tend to mount them under the brim of the hat making it a bit less useful in this context.",
				"added": 1566137798
			},
			{
				"comment_id": 42,
				"body": "Ehhh de-authers are a legal grey area to some extent.",
				"added": 1566139253
			},
			{
				"comment_id": 43,
				"body": "I think you're more likely to just see a new version of the wifi protocol that makes it impossible long before governments get around to legislating",
				"added": 1566140251
			}
		],
		"1566159714_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 44,
				"body": "The only solution to Venezuelans problems is violence.",
				"added": 1566161831
			},
			{
				"comment_id": 45,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_815_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): violence yourself, and don't forget to kill yourself first.\n\nCute but no I am serious. \nThe problem in venezuela is a shit tier government that has managed to cling onto power.\nThings are falling apart but not enough that this government can't keep the military fed and happy (which lets it stay in power)\n\nWidespread violence however would tip it over the edge. When the government can no longer keep the military fed it can no longer use them to retain power. \nBurn the infrastructure, trash the farms, fight until there is nothing left to fight over. Raze venezuela even unto the foundation. \nThen you can build anew.",
				"added": 1566163123
			}
		],
		"1566479582_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 46,
				"body": "Honestly. A key element of how domain names work is that it is very formal and verified. \nBecause the less formal and verified it becomes the more likely it is that you'll get people constantly assigning themselves the same domain name.",
				"added": 1566480307
			}
		],
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 47,
				"body": "This sort of reminds me of the problems with 5G base stations. How they're having to deploy them in huge numbers enmasse because their range is garbage.\nWonder if that hot garbage could be coopted for this?",
				"added": 1566482592
			},
			{
				"comment_id": 48,
				"body": "But they're not pumping out ionising radiation",
				"added": 1566637243
			}
		],
		"1566634528_1JaHtdmFGhdNVCzJquH7hFpsKbF7cffYpp": [
			{
				"comment_id": 49,
				"body": "Gyms are good for efficiency and focus.\nWith bodyweight exercises at home its easy to get distracted. With sports its hard to exercise your entire body.",
				"added": 1566637375
			}
		],
		"1566704216_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 50,
				"body": "> [aspidochelone](#comment_147_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The Russian government gave their agents false papers and sent them on a plane with nerve gas to go kill someone in Britain\n\nIf you believe the official account from the British government.\nWho at the time needed a distraction.\nAnd forget that the UKs chemical weapons lab is pretty close to the village this shit went down in.",
				"added": 1566764767
			}
		],
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 51,
				"body": "So essentially most of this is about intellectual property rights and your desire to increase those for people who participate to free software projects.\nCompletely ignoring the fact that generally speaking these rights are easily circumvented by corporate entities. \nYou said it yourself. The costs of litigation are prohibitive.\n\nMany programmers do not have the intellectual property rights they think they do. Same is true of engineers and other such creative workers.\nMost employment contracts for such workers explicitly stipulate that anything they produce (even out of hours) belongs to the company. So many of these free software projects could be claimed by one company or another in part or in whole.\nBut they don't because its not worth the effort.",
				"added": 1566765557
			}
		],
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 52,
				"body": "I am not happy.",
				"added": 1566815005
			}
		],
		"1568405412_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ": [
			{
				"comment_id": 53,
				"body": "> [defconzero](#comment_13_1C4sZqqLnExKmkEWXvxtcHyPWE7ogzfjCE):  I'm trying to separate out the religious Jews from the genetic golden calf humping sacks of shit, but it's getting harder to do so, when their goals end up being the same.\n\nYeah you need to just accept this is a genetic imperative for them.\nJews gonna jew and no jew is different.",
				"added": 1568630046
			}
		],
		"1569695244_1MKHBc72uGEBSuHxagbgTWGmverPtzD1tH": [
			{
				"comment_id": 54,
				"body": "> [xianc78](#comment_60_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): Apparently, they are rebranding it as QChan.\n\nPlease no. Fucking Qtards",
				"added": 1569850614
			}
		],
		"1569605502_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U": [
			{
				"comment_id": 55,
				"body": "Not likely.\nThomas Cooks death was more a product of its industry dying and the company failing to find ways to adapt. \nThey were a high street package holiday retailer. Meaning they had to hire a lot of staff and maintain a lot of properties. \n\nHowever less people are buying package holidays these days. Instead they prefer to get them cheaper by arranging individual holiday elements themselves. \nThat is of course if people are even going on holiday (which few are anymore due to a general global economic downturn and decades of stagnant wages)\nOf those who still buy package holidays they're generally going online to get them cheaper (since online only providers don't have to pay much in the way of staff wages or property costs)",
				"added": 1569850809
			}
		],
		"1569736304_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": [
			{
				"comment_id": 56,
				"body": "to an extent its a good idea. Assuming of course the rural regions could extract reparations from the city states.",
				"added": 1569850960
			}
		],
		"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 57,
				"body": "I will be honest. Not been following linux internal politics for a long time.\nWhats the deal with SysteMD?\nWhy is it so hated outside of getting its sticky fingers into everything and being bloatware?",
				"added": 1570447030
			}
		],
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 58,
				"body": "Vaping is retarded anyways.\nTheres a lot of shit coming out now about the damage it does and surprise surprise turns out its worse the regular tobacco.\nBan both. Problem solved.",
				"added": 1570451487
			},
			{
				"comment_id": 59,
				"body": "Either way its stupid.\nTheres no benefit to it. You're just paying to be an addict",
				"added": 1570464082
			}
		],
		"1570456755_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 60,
				"body": "Generally speaking theres a number of reasons.\n\nFirst is that yes they have the CCP backing them and the USA is not keen to pick a fight there.\nFor the CCP the norks are a great buffer state between them and the US vassal state of south korea. \nIf the USA wants to invade China their only option with a reasonable (though still low) chance of success is to do so through North Korea. But declaring war on one nation purely to use as a route to invade another is generally unpalatable to most and would make it very difficult for the USA to build the international coalition it would need to have any hope of successfully invading China.\nEven if that other nation is the DPRK\n\nAnother reason is that the USA simply can't feasibly invade and hold North Korea. \nThere's a number of factors at play here. Ranging from the terrain (entirely mountainous) and the local populace. \nThe terrain would be difficult for the USA as they'd have to ditch a lot of their established gear and operational norms. \nThe populace meanwhile would be the biggest problem. During the Korean war the USA went all out on the warcrimes. Mass executions of civilians, bombing everything that looked like a building with the USAF being publicly proud of there not being a single standing structure in all of North Korea, etc. And their government spares no expense remining the north korean people of this. \nSo the Nork people do not like the yanks. Not even slightly. Literally zero sympathy or even empathy from them. \nAs a consequence there'd be none of the mild hostility but general ambivalence of the middle east that US troops have to deal with. It would be outright hostility 24/7. Every single civilian would be resisting the US. \n\nAnd this is before we go into the consequences of a US/DPRK war for South Korea. Suffice to say the USAs own expectations are the total collapse of the South Korean republic and 10% of its total population dead in the first few hours.  \nLongterm? The USA wouldn't be able to hold ground in North Korea. Simply by virtue of no longer being able to control South Korea as it descends into anarchy and chaos, with the Chinese encouraging it every step of the way.\n\nAs it has been described to me. It would be best to imagine a new Korean war as an eternal Afghanistan meets Vietnam where the USA can't reliably use aircraft.",
				"added": 1570464736
			},
			{
				"comment_id": 61,
				"body": "That's pretty out there as theories go. Mainly because it assumes the USA rules the world.",
				"added": 1570469418
			},
			{
				"comment_id": 62,
				"body": "Aside from that being a retarded power fantasy it's not remotely useful as this wouldn't end the DPRK.",
				"added": 1570479486
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 63,
				"body": "Define racist?\nI mean really neo-nazi is a very specific term denoting a very particular group of people who don't really know much about fascist political philosophy anyways.",
				"added": 1570493917
			}
		],
		"1570492144_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 64,
				"body": "Why does this one suspect you are a communist trying to understand why people like to eat?",
				"added": 1570493944
			}
		],
		"1570912555_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 65,
				"body": "> [leftside](#comment_857_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): He must have been already intoxicated by the foods those're provided by the Ecuador gov in the embassy of Ecuador in Britain.Before he's being dragged out of the embassy he's been already painting walls with his own feces.Did u see his face when arrested? US gov already disassembled his mental integrity so that he would violate the rule to give a good reason to be arrested legally.\n\nAccording to the Ecuadorian embassy nothing of the sort went on and all the talk put out by US media outlets about him going crazy or getting into arguments with the staff were bullshit.\n\nAs for where he is now? Still in prison because he's gonna be extradited.",
				"added": 1570978767
			}
		],
		"1570831985_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 66,
				"body": "I doubt that will happen any time soon.\nIt's also unlikely that starlink will stay up for long.\nMusk seems completely unconcerned about potential collisions in what is a very busy and heavily occupied chunk of orbital estate he has occupied without any prior consultation. Meaning he is relying on others to move their equipment out of his way, which is all well and good until he has the problem of malfunctioning or disowned satellites. \n\nI swear the fool will kick start Kessler syndrome out of sheer ignorance",
				"added": 1570992180
			},
			{
				"comment_id": 67,
				"body": "> [rasputin](#comment_7_1DLLxLPEjC4xmHBo235fGQLC2dauvgiig6): This part is incorrect, you can't just launch satellites like that, the FAA had to approve it first.\n\nWell he's already forced at least one satellite operator to get out of his way and almost caused a collision.",
				"added": 1571016237
			}
		],
		"1571092087_1MgxmzHaBwSsM516rsgHsPeLUMQbYKM7hu": [
			{
				"comment_id": 68,
				"body": "> [robione](#comment_328_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): For mobile you can use the 1.1.1.1 App from Cloudflare https://warp.plus/69YyB\n\nConsidering Cloudflares recent actions in regards to 8Chan I would not trust them to not inform on their users to the CCP",
				"added": 1571336889
			}
		],
		"1571981535_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 69,
				"body": "one would expect to have to explain how zeronet functions in court to a bunch of old people with limited technical knowledge. So the procurement of an expert witness the court is inclined to listen to who can testify on your behalf would be essential. \n\nAs there was no intent to procure/view/own said material there is room to argue (in most civilised nations) innocence.",
				"added": 1572019216
			},
			{
				"comment_id": 71,
				"body": "> [anonymouslogin](#comment_59_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Doubtful, besides the whole point of a distributed internet is to make censorship impossible. I don't personally agree with much of the content others provide, but I do believe that people have a right to say and post what they want to, and as a relay node I believe we have a duty to not filter the information flow. If you choose to provide content that is illegal where you live, and that content is discovered in your possession then you will have to face the consequences for that decision.\n\nThere have been a few cases involving TOR where those initially charged with distribution of child pornography were cleared of any wrongdoing. \nI think in any common law jurisdiction (UK/USA/CAN/AUS/NZ) these cases would be vital for your own defence and you would have to explain to police/courts the basic operating principles of zeronet. \nCould probably get you off.",
				"added": 1572021789
			}
		],
		"1571930824_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi": [
			{
				"comment_id": 70,
				"body": "This is more about propaganda dissemination than anything else",
				"added": 1572019288
			}
		],
		"1571722926_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 72,
				"body": "> [18ah](#comment_1_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP): why should I believe you? this sounds like conspiracy nutters\n\nUnfortunately since its the CCP it is plausible",
				"added": 1572569443
			}
		],
		"1572897732_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 73,
				"body": "While yes theres many white middle class people involved in this.\nMany of the ones directing it/the loudest voices are \"white\" (AKA: Jewish)",
				"added": 1572940289
			}
		],
		"1574560433_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": [
			{
				"comment_id": 74,
				"body": "The numbers of supposedly incinerated corpses don't match up. That alone makes the whole thing suspect",
				"added": 1574569440
			}
		],
		"1575180863_11xvtkLUfeD7brvyLqn93txTVbwFP85bg": [
			{
				"comment_id": 75,
				"body": "Take up a gun  and get to fixing.",
				"added": 1575204617
			}
		],
		"1575167083_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 76,
				"body": "> [seidoken](#comment_2_1Pxg9q2iUdQkbwgT459ArjQ12mpXN8cyEB): How bad are things getting there? Are they close to a civil war?\n\nBad and no.\nThe current government is an islamist government.\nSo the muslims may rage against their current guy but the group he represents will remain comfortably in power.",
				"added": 1575204700
			}
		],
		"1575485461_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": [
			{
				"comment_id": 77,
				"body": "Yeah none really seem to do that. It's all \"synch to this app\" and all the apps are phoning home\nDoesn't seem to be any open source options",
				"added": 1575497441
			},
			{
				"comment_id": 78,
				"body": "> [britical](#comment_4_1D6Uyi9qWnuoTByrjLFGqMCsk48XK41S6L): That's pretty rubbish. Potentially there's a smartphone app for example Huawei Health that allows you to interface locally with a wristband. I know for sure you can disable syncing there but its up to you on who you trust.\n\nHuawei is heavily associated with the Chinese Communist Party and its armed wing (the Peoples Liberation Army) \nSo they're not trustworthy. At all.",
				"added": 1575497792
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 79,
				"body": "Basically Hollywood worked out a mathematical formula to apply to all movies to guarantee financial success.\nIt produces nothing but mediocre crap but it excites the dull minded and gets them to turn out in droves. It is also made to a length that is convenient but still encourages further purchases of consumable goods such as snacks which makes cinemas more likely to carry the movie. \n\nThis formula is now applied to everything hollywood produces. This is why every hollywood movie is the same. \nTV series do sometimes get more leeway to do their own thing but generally they have their own genre specific formulae to follow",
				"added": 1579538682
			}
		]
	},
	"comment_vote": {
		"91_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1
	}
}