{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1547400112,
			"title": "Archiwizowanie tekstów z internetu",
			"body": "Witam, jaki jest najlepszy sposób na archiwizowanie ciekawych tekstów, newsów, artykułów z internetu do Zeronetu?",
			"added": 1547400111
		},
		{
			"topic_id": 1549660645,
			"title": "Problem z uploadem filmów",
			"body": "Witam. Mam problem z uploadowaniem filmów. Próbowałem na YouTube i KopyKate i wydaje się, że nie działają. Nie wiem co robię nie tak.\n\nhttp://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1549659796_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P\n\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1549202971_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P",
			"added": 1549660643
		},
		{
			"topic_id": 1559842378,
			"title": "„You Tube” skasuje tysiące kanałów z „niewłaściwymi” treściami",
			"body": "„You Tube” skasuje tysiące kanałów z „niewłaściwymi” treściami\n\nOpublikowano: 06.06.2019 | Kategorie: Świat komputerów, Wiadomości ze świata\n\nWalka z wolnością słowa w Internecie staje się coraz bardziej brutalna. Amerykańskie lewicowe portale społecznościowe zapowiadają krucjatę wobec niektórych rodzajów treści. Po ostatnim nasileniu cenzury na „Facebooku” przyszedł czas na podobne ocenzurowanie portalu „You Tube”.\n\nJak wynika z oficjalnych informacji opublikowanych przez przedstawicieli portalu „You Tube”, na celowniku cenzorów znajdą się kanały promujące treści prawicowe oraz teorie spiskowe czy alternatywną medycynę.\n\nZapowiedziano, że na skutek podjętych decyzji, konta z których będą publikowane takie treści zostaną po prostu skasowane. Zabroniona będzie zawartość, która może promować alternatywne teorie na temat zamachów z 11 września 2001 roku, ale również pseudonaukowe teorie takie jak ta o płaskiej Ziemi.\n\nDodatkowo zapowiedziano bezwzględną walkę z wszelkimi rodzajami tak zwanego “suprematyzmu”, rozumianego jako stwierdzenie, że jedna grupa ludzi jest lepsza od drugiej ze względu na płeć, wiek, rasę, religię czy orientację seksualną. W tym kontekście interesujące jest to czy represje dotkną również kanały wychwalające żydowski szowinizm.\n\nOznacza to, że z dnia na dzień na platformie „You Tube” może zniknąć wiele tysięcy kanałów. Przedstawiciele portalu zapowiedzieli, że kasowanie zacznie się od razu, ale cała operacja może potrwać nawet kilka miesięcy.\n\nAlgorytmy mają zwalczać również filmy promujące alternatywne formy terapii, które YouTube uzna za fałszywe. Takie treści nawet jeśli nie zostaną skasowanie to będą głęboko ukryte przed użytkownikami i nie będą w żaden sposób promowane. Zdaniem YouTube jest to działanie w interesie widzów, którzy mogą zostać przez to wprowadzeni w błąd.\n\nZwalczanie wolności słowa w internecie postępuje bardzo szybko. Cenzorskie zapędy amerykańskich korporacji internetowych takich jak Facebook czy Google narastają. Usuwanie zawartości uznanej przez nie za niewłaściwą, dopiero się zaczyna, a celem jest przeobrażenie Internetu w taki sposób, aby dominowały tylko treści zgodne z lewicową wizją świata.\n\nhttps://wolnemedia.net/you-tube-skazuje-tysiace-kanalow-z-niewlasciwymi-tresciami/\nNa podstawie: Independent.co.uk\nŹródło: ZmianyNaZiemi.pl",
			"added": 1559842375
		}
	],
	"topic_vote": {
		"1545594088_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": 1,
		"1546977497_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"1548433003_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"1549170023_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": 1,
		"1552779363_19mLKVaQ1tZmZcKnmfPhrAHXK5aqeTDzg1": 1,
		"1553264555_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1553627501_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": 1,
		"1555345540_1GAmeJmJNco5aRCcocB4zWNzRe8dqGpmTB": 1,
		"1585331079_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1583077865_1Jgcm8RpHNjFQjthZWfLHi6QdeqU5b7N4F": 1,
		"1586167995_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"1577573679_19uVBhkQH2J1AY5PBJ8BebTqdRj6sn8iwn": 1,
		"1587203843_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"1587477797_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": 1,
		"1590331802_1HBTrB6MUAYKvXYgawBVApd2qapGCQsYXC": 1,
		"1565086389_1JZcGPhLfmeACHEXu4R16hrU2Rz6wBgYoY": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1547400112_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 1,
				"body": "Chodziło mi bardziej o to w jaki sposób możemy przenieść treść z internetu do ZeroNet. Czy istnieje coś takiego jak archive.org albo archive.is dla ZeroNet? Gdzie najlepiej udostępniać tekst?",
				"added": 1547672554
			},
			{
				"comment_id": 2,
				"body": "Być może użyłem niewłaściwego słowa. Miałem na myśli to, że niektóre treści prędzej czy później mogą zniknąć z internetu, być w jakiś sposób ocenzurowane i dobrze by było mieć ich kopie w ZeroNecie.",
				"added": 1547851678
			},
			{
				"comment_id": 9,
				"body": "Właśnie chodziło mi o coś takiego jak w tym temacie na angielskim ZeroTalk:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1553707562_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs",
				"added": 1553714637
			},
			{
				"comment_id": 10,
				"body": "> [moris](#comment_3_15usvFDAkU2u3LKdCX6uGZ6RdvLAT8N5EH): https://ipfessay.tk/pl.htmlhttps://2read.net/\n\nDzięki. Przydałoby się coś takiego, ale dla ZeroNet.",
				"added": 1556484830
			}
		],
		"1546977497_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 3,
				"body": "Na YouTube znajduję trochę filmów po polsku, ale na KopyKate cieżko znaleźć. Co wpisywać w wyszukiwaniu?",
				"added": 1547912587
			}
		],
		"1549170023_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 4,
				"body": "Ze znajomymi jest taki problem, że większość korzysta z internetu na urządzeniach mobilnych. Na komputerze odpalają przeglądarkę i tyle. Niektórym nie będzie się chciało instalować dodatkowego oprogramowania.",
				"added": 1549197591
			}
		],
		"1549660645_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 5,
				"body": "No właśnie używałem TorBrowser. Być może w tym tkwi problem.",
				"added": 1549806540
			},
			{
				"comment_id": 6,
				"body": "Przesłałem jeszcze raz, tym razem użyłem Firefoxa i nie było problemów. Być może TorBrowser blokuje jakieś potrzebne skrypty.",
				"added": 1549810681
			},
			{
				"comment_id": 7,
				"body": "Nie wiem czy da się jakoś usunąć te pierwsze, źle załadowane filmy, więc mogą być po 2 razy.",
				"added": 1549830258
			}
		],
		"1552779363_19mLKVaQ1tZmZcKnmfPhrAHXK5aqeTDzg1": [
			{
				"comment_id": 8,
				"body": "cz. 1 przekierowuje do głównej strony youtube. cz.2 i cz.3 \"Nie odnaleziono wideo w obsługiwanym formacie i typie MIME.\"",
				"added": 1552859573
			}
		],
		"1581694747_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 11,
				"body": "No niestety Ci ludzie są tak nauczeni, że to co powie ksiądz, lekarz, nauczyciel albo co zobaczą w telewizji to prawda. Nie zastanawiają się nad prawdą, nie zadają pytań.",
				"added": 1585164766
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 12,
				"body": "Myślę, że jednym z problemów ZeroNet jest mała ilość użytkowników i wydaje się puste. Ludzie teraz wolą pobrać aplikacje z Playstore czy innego stora. Wielu użytkowników internetu korzysta teraz z komórek, tabletów. Lubią proste treści, najlepiej obrazki, memy.",
				"added": 1588206000
			}
		],
		"1587477797_1BXo6veZxSREQpo2StCSGBnZ12Y7pyryjs": [
			{
				"comment_id": 13,
				"body": "Ale brak hasła do Wifi chyba nie jest najlepszą poradą ze względu na bezpieczeństwo. I co to ma wspólnego z ZeroNetem?",
				"added": 1589128249
			},
			{
				"comment_id": 14,
				"body": "Może by zrobić jakąś reklame w formie mema, grafiki. Grafikę trudniej cenzurować niż tekst.",
				"added": 1590266122
			}
		]
	},
	"comment_vote": {
		"3_15usvFDAkU2u3LKdCX6uGZ6RdvLAT8N5EH": 1,
		"1_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": 1,
		"9_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"28_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"4_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": 1,
		"1_12oEs9BngD5BADwtiRrYh1UftdG1o4DZKe": 1,
		"37_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"39_1At298vUijuhjA2GtqXEydC8csRnhETzdH": 1,
		"3_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"13_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"12_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1
	}
}