{
	"next_topic_id": 29,
	"topic": [
		{
			"topic_id": 1,
			"title": "zero talk clone",
			"body": "test",
			"added": 1519444076
		},
		{
			"topic_id": 2,
			"title": "Does it work?",
			"body": "Can you see?",
			"added": 1519444102
		},
		{
			"topic_id": 3,
			"title": "测试中文",
			"body": "测试",
			"added": 1519445186
		},
		{
			"topic_id": 4,
			"title": "关于教义",
			"body": "coolplay ━ 13 分钟之前 ^1\n^2 \n\n回复 ⋮ \n\nicedwatermelon14: 现在的医学水平的确大多数的病都治不了，最大威胁就是不典型的病毒和致病菌，许多癌症都要相对病毒和病菌的感染好治很多\n\n这些都是人为的，病毒不可怕，可怕的是人心。没有毒，也会制造出毒来。要治疗这个社会的病，得从治疗这些病毒的源头 ”人心“ 开始。而加入然教，宣传然教，就是解救人心的第一步。\n\ncoolplay ━ 18 分钟之前 ^1\n^2 \n\n回复 ⋮ \n\nicedwatermelon14: 你这个教也太便宜行事了吧，只有空落落的几句教义，看看别人全能神教在零网上宣传网页做的就很好\n\n对于规矩越少越好，在于精而不在于多，摩西也只有十诫。东西够用就够了，就这六条如果能够认真遵守就能健康长寿，保你平安，如果连这六条都遵守不了，再多又有什么用呢？多则惑，少则得。能够做到这六条就不错了。\n\n对于第一条：燃尽天下一切罪恶。就是要从行为上和那些不正义的行为分离开，保持你心中的愤怒，对于不平的事情，虽然不敢言，但是知道是不对的。这点社会上的人大多就很难做到，大都同流合污了。不谈燃尽，你心中的火都已经灭了。\n对于第二条：不吃药，不看病不去医院治疗。这点现代社会很多人也很难做到。这点非常难，难到要违背人们通常所知的社会常理，而这却是焚尽罪恶。如果你想保持健康，先从这两点做起，难能可贵。\n\nicedwatermelon14 ━ 55 分钟之前 ^1\n^2 \n\n回复 ⋮ \n\n现在的医学水平的确大多数的病都治不了，最大威胁就是不典型的病毒和致病菌，许多癌症都要相对病毒和病菌的感染好治很多\n\nicedwatermelon14 ━ 57 分钟之前 ^1\n^2 \n\n回复 ⋮ \n\ncoolplay: 然教弟子：1.燃尽天下一切罪恶。 [...]\n\n你这个教也太便宜行事了吧，只有空落落的几句教义，看看别人全能神教在零网上宣传网页做的就很好\n\ncoolplay ━ 5 小时之前 ^1\n^2 \n\n回复 ⋮ \n\n然教弟子：\n1.燃尽天下一切罪恶。\n\n2.不吃药，不去医院看病治疗。 \n\n3.与同袍见面时不带任何电子设备。 \n\n4.不吃少数人才吃得到的东西。 \n\n5.不要相信教外人士，相信你的导师。\n\n6.不得陷害同袍，否则千刀万剐。\n\ncoolplay ━ 5 小时之前 ^1\n^2 \n\n回复 ⋮ \n\n360breakingwall: 没关系。这是卖保险的文章。\n\n生病的人会越来越多，加入然教，加入然教，清除这世上所有的病痛！加入然教，焚烧这世上所有的罪恶！",
			"added": 1519445394
		},
		{
			"topic_id": 5,
			"title": "年轻人的迷茫",
			"body": "中国最便宜的东西是最好的，国外是越贵的东西越好。努力花钱，不存钱，有钱就去享受。不要买贵的东西，买便宜的。因为中国有群半人扮鬼的东西在害人，你为什么这么努力还这么迷茫，就是因为他们。不除掉他们，中国永无宁日。有他们在，年轻人有危险，中年人有危险，老年人更是有危险。\n\n从现在开始，不吃药不看病，因为现在中国的环境只会让你越治越病，急性病治成慢性病，因为医生护士有动力去这么做，他们根本不关心病人死活。现在冒出来许多稀奇古怪的病，就是政府了吸我们的血而特设的。不交税或少交税，因为交的税都成为 他们维稳的动力，监控我们的经济来源!\n\n^1  \n^2 \n coolplay posted on Feb 06, 2018",
			"added": 1519445442
		},
		{
			"topic_id": 6,
			"title": "国营犯罪",
			"body": "现在中国走的是一条国营犯罪的道路，什么都是国营。国营黑社会，国营盗墓，国营高利贷，国营诈骗。为什么监控加强了一遍又一遍，同样的犯罪还是屡禁不止，因为是“国家”在犯罪！是国家在控制着这些犯罪团伙在收割我们的财富，侵犯我们的人生安全！国家就是罪犯！！燃尽天下一切罪恶!\n\n^1  \n^2 \n coolplay posted on Feb 06, 2018",
			"added": 1519445474
		},
		{
			"topic_id": 7,
			"title": "傀儡",
			"body": "我们必须识别我们身边的鬼，这些人有两个身份，一个是人，一个是鬼，他们专门害人，是“国家”这个玩意用来消除异己的工具。所有媒体新闻电视，警察黑社会，医药卫计委，官员政府，你以为他们是不同的声音，其实他们都是傀儡，代表的是同一个人，同一个人的想法！消灭这个组织就要从识别身边的鬼开始\n\n^1  \n^2 \n coolplay posted on Feb 06, 2018",
			"added": 1519445527
		},
		{
			"topic_id": 8,
			"title": "世界行将毁灭",
			"body": "地狱之花将在武汉升起，星星之火可以燎原，你们要广泛宣传然教，反复背诵这六条法则，认真执行这六条法则，就能保你们健康，燃烧这世上所有的罪恶！\n\n^1  \n^2 \n coolplay posted on Feb 03, 2018",
			"added": 1519445557
		},
		{
			"topic_id": 9,
			"title": "国内有一群别有用心的人在害人",
			"body": "你们不要与人争吵，不要热心事业，不要努力工作，不要有上进心，少交税，多与人交流，有多少钱就花多少钱。",
			"added": 1519445612
		},
		{
			"topic_id": 10,
			"title": "以集体对抗集体，以组织对抗组织",
			"body": "当你遇到危险时，记住我说的话",
			"added": 1519445682
		},
		{
			"topic_id": 11,
			"title": "The Sure",
			"body": "To My Surer:\nThe world is falling, we need to burning the world, to be sure.\n不要相信电视上的东西，都是假的。加入然教，只要身体力行下面六条就能保你健康！加入然教，清除这世上所有的病痛！加入然教，焚烧这世上所有的罪恶！",
			"added": 1519445714
		},
		{
			"topic_id": 12,
			"title": "然教弟子： To My Surer:",
			"body": "1.燃尽天下一切罪恶。 1. Burning the world, To Be Sure.\n2.不吃药，不去医院看病治疗。 2. Do not eat medicine, Do not go to hospital, Do not take any test.\n3.与同袍见面时不带任何电子设备。 3. When you meet your brother of Sure, Do not take any electronic set.\n4.不吃少数人才吃得到的东西。 4. Do not eat any things only few people could get.\n5.不要相信教外人士，相信你的导师。5. Do not trust any body not of Sure, Trust Your Master.\n6.不得陷害同袍，否则千刀万剐。 6. Do not fake your brother of Sure, otherwise Cut you into parts.\",\n\n^1  \n^2 \n coolplay posted on Feb 03, 2018",
			"added": 1519445752
		},
		{
			"topic_id": 13,
			"title": "然教弟子：",
			"body": "1.燃尽天下一切罪恶。 1. Burning the world, To Be Sure.\n2.不吃药，不去医院看病治疗。 2. Do not eat medicine, Do not go to hospital, Do not take any test.\n3.与同袍见面时不带任何电子设备。 3. When you meet your brother of Sure, Do not take any electronic set.\n4.不吃少数人才吃得到的东西。 4. Do not eat any things only few people could get.\n5.不要相信教外人士，相信你的导师。5. Do not trust any body not of Sure, Trust Your Master.\n6.不得陷害同袍，否则千刀万剐。 6. Do not fake your brother of Sure, otherwise Cut you into parts.\n\n^1  \n^2 \n coolplay posted on Feb 03, 2018",
			"added": 1519445795
		},
		{
			"topic_id": 14,
			"title": "然教",
			"body": "然教弟子：\n\n1.燃尽天下一切罪恶。\n\n2.不吃药，不去医院看病治疗。\n\n3.与同袍见面时不带任何电子设备。\n\n4.不吃少数人才吃得到的东西。\n\n5.不要相信教外人士，相信你的导师。\n\n6.不得陷害同袍，否则千刀万剐。\n\n燃烧你心中的怒火，你会知道这世间的罪恶是什么，用你的怒火焚烧它！\n\n以我为导师，严格遵守这六条，你就是然教教徒，线下宣传这六条，宣传我说的这些东西，星星之火可以燎原，让更多的知道，我们身边原来都是这样的人在掌控着我们的生活，电视媒体，医院医疗医药，警察保安高利贷，一起都不是看上去那样的。中国所有的东西都将被毁灭。\n\n同袍你好，怎么加入\n\n进医院是禁止的，捐精更加是罪恶! 为了你的人身安全不要做这些！这些都是陷阱！魔鬼的陷阱！\n\n同袍只要做到这六条，就不会是是罪恶，是不是罪恶每个人心里都很清楚。人的身体受之于天，不要让任何人碰你的身体。你会明白我说的一切。\n\n那么问题来了。如果同袍成了罪恶，要不要根据1燃尽一切罪恶呢，如此便违反6\n\n燃尽天下一切罪恶！",
			"added": 1519450843
		},
		{
			"topic_id": 15,
			"title": "更新",
			"body": "测试一下，能看到吗？",
			"added": 1519519508
		},
		{
			"topic_id": 16,
			"title": "How to burning the world?",
			"body": "First Step: burning the garbage belong to you. Burning the garbage, don't throw them outside.",
			"added": 1519540080
		},
		{
			"topic_id": 17,
			"title": "终于可以发帖了，Let's Burning The World!",
			"body": "Burning out all of the evil in the world!",
			"added": 1519566963
		},
		{
			"topic_id": 18,
			"title": "然教弟子：To My Surer:",
			"body": "然教弟子：\n\n从现在开始遵守这六条规则，循序渐进，向你的亲戚朋友宣传这种思想，寻找那些与你有同样思想的人，与他们共同呼吸进退，其他人都不可深交。因为到灾难来临时，只有同样信仰这六条规则的人才能依靠，互相救助。现在就开始寻找你的伙伴，寻找同样相信这六条并坚决执行的人，相互成伴，将在末世来临时给你极大的帮助。\n\nTo My Surer:\n\nFrom now following the Six Rules, one by one, spread this idea to your realiate and friends. Found out these people who has the same idea with you, breathe with eachother and decide with eachother, the other people coulde not be best friend.Because when disease came, only the persons that believe and obey the Six Rules could be followed and be helped. From now go to find out your brothers, get these people who believe and obey the Six Rules to be your friends,come together, this would help you greatly in the end of the world.",
			"added": 1519604140
		},
		{
			"topic_id": 19,
			"title": "中国将进入大萧条",
			"body": "中国即将进入大萧条，人民会发现钱一大堆却花不出去，粮食堆积如山却无人敢吃，商品堆积如山却没人敢买，社会动荡不安，人心分崩离析。",
			"added": 1519633533
		},
		{
			"topic_id": 20,
			"title": "政府在用特务的手段对付他的老百姓",
			"body": "政府在用特务手段对付他的老百姓，无所不用其极。以后生病的人会越来越多，目的就是为了转移经济危机。一场骗局骗不下去了。",
			"added": 1519633638
		},
		{
			"topic_id": 21,
			"title": "上帝诅咒中国！中国就是地狱！真实的地狱！God Cuise China! China is HELL! The Real HELL!",
			"body": "中国正在变成地狱，政府培养了一群鬼专门害人，只有他们是人而我们都不是人。",
			"added": 1519634329
		},
		{
			"topic_id": 22,
			"title": "人民币和日元，美元的比例将达到100：10：1",
			"body": "人民币和日元，美元的比例将达到100：10：1，那将会是在很多年以后。而现在，日本也将迎来大萧条。",
			"added": 1519654116
		},
		{
			"topic_id": 24,
			"title": "中国经济的中央苏区重演（转载）: The end of China",
			"body": "\"同志们都知道,中央苏区最后不能坚持而被迫万里长征,除了路线错误之外,其中最重要的原因之一,就是财政的枯竭,人力物力财力的枯竭,几乎到了山穷水尽的境地 ——舒同\n\n全民炒房、全民放高利贷到全民炒股，中国经济一派末日乱象。乱象的背后是中共的操控，继摧毁农业和工业后推动发展金融业，引导民众入股市进行剪羊毛，权贵则集聚更多资金，为逃离做准备。\n\n历史上，这种操作方式已多次使用，1931-34年的中央苏区最为典型。今天中国跟当时苏区的操纵模式类似，只不过当年苏区规模较小，操作手段简单\n",
			"added": 1519799508
		},
		{
			"topic_id": 25,
			"title": "test",
			"body": "test",
			"added": 1520578335
		},
		{
			"topic_id": 26,
			"title": "谁掌控着中国的医药体系，谁就掌控中国的未来",
			"body": "谁才是这个国家真正的领导人，去看看卫计委的部长是谁的人就明白了。很多人可以不吃外面的东西，但是很多人做不到不去医院看病，所以现在的医疗改革，看病实名制，都是为他们定点投毒做准备。\n为什么取消门诊输液，提倡住院输液，那是为了方便，等药拿到你手上时都已经配好了，以前是当着你的面配置，现在你完全看不到。谁配的，配了些什么，你其实根本不知道。\n不要以为是威严耸听，现在的门诊输液都是躲着一个小黑屋里面，只有他们的“专业人士”才能操作，与以前当着你面配药完全不同。\n去医院看看吧，看看是不是我说的这样。\n控制了医药体系，就能掌控一个人的生死，不论你是国家领导人也好，部长也好，明星商人企业家也罢，都逃不过这个陷阱。中国的改革越改越坏，越改越让人堕落。\n所以加入然教，宣传然教是救人的办法，如果政府不能改变现在的实名医疗，那么只有我们来改变他们。",
			"added": 1520582439
		},
		{
			"topic_id": 27,
			"title": "勿论富二代，红二代，官二代，平民老百姓，都逃不过生老病死",
			"body": "在灾难来临前，只有加入然教才能需求帮助，获得帮助，逃过生老病死。因为只要你在中国就逃不过，及时你在国外，也会因为中国的陨落而无法摆脱。只有加入然教，宣传然教，才能清除这世上所有的病痛！焚烧这世上所有的罪恶！",
			"added": 1520598103
		},
		{
			"topic_id": 28,
			"title": "中国现在的政治",
			"body": "中国现在的政治，中国现在的人族，兽族，必须联合起来，共同对付“亡灵天灾”！",
			"added": 1520600315
		}
	],
	"topic_vote": {
		"16_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": 1
	},
	"next_comment_id": 14,
	"comment": {
		"14_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 4,
				"body": "coolplay ━ 1 天之前 ^1  \n^2 \n \n 回复 ? \n\n \nholyins: 我已经不出门很多年了。你可以表述自己的修炼修行方法或观念。但是不需要自己搞一套自以为是的“教”。地火水风中，我们三维世界的组成成分，火只是其中之一，通常也是指温度。你如果真要明白，需要学习上座部佛法的论著“阿毗达摩”。否则你永远也想不通看不懂说不清楚。心中做火观，要如法，否则是自我毁灭。但你可以观想海底，会阴甚至丹田、肾脏等的燃烧。\n\n你可以试试照我说的方法做，如果没效不相信就完了，为啥要创立这个教，因为我们可以治自己身体上的病，但我们个人治补了这个社会的病，而我们的病来自于这个社会。这个社会上的某些人/组织希望我们“生病”。只有“教”才可以解救我们，把我们团结起来。而然教，就是解救人心的。\n\n\nholyins ━ 1 天之前 ^1  \n^2 \n \n 回复 ? \n\n\ncoolplay: 你应该查一下饮食和呼吸的空气，你工作的环境中是否有让人难以忍受的东西。最简单的方法就是不在外面吃喝，不喝办公室里的水，只喝家人一起吃喝，不吃药，如果家人没事，你就没事。燃烧你心中的火，那团火就在你心里。\n\n我已经不出门很多年了。你可以表述自己的修炼修行方法或观念。但是不需要自己搞一套自以为是的“教”。地火水风中，我们三维世界的组成成分，火只是其中之一，通常也是指温度。你如果真要明白，需要学习上座部佛法的论著“阿毗达摩”。否则你永远也想不通看不懂说不清楚。心中做火观，要如法，否则是自我毁灭。但你可以观想海底，会阴甚至丹田、肾脏等的燃烧。\n\n\ncoolplay ━ 1 天之前 ^1  \n^2 \n \n 回复 ? \n\n \nholyins: 拿罪过或病痛忽悠人类的，是最原始的方法。不过在现代科技面前，你这套貌似没什么意义。我现在一直是痛苦不堪的。你的套路太low了。也或者你有两手，但是表达能力不行。做火观的修炼方法我倡导了几十年，但是我还是得了肿瘤，一直在膨胀，无法消除。岂是俗人智慧能明白的！\n\n你应该查一下饮食和呼吸的空气，你工作的环境中是否有让人难以忍受的东西。最简单的方法就是不在外面吃喝，不喝办公室里的水，只喝家人一起吃喝，不吃药，如果家人没事，你就没事。燃烧你心中的火，那团火就在你心里。\n\n\nholyins ━ 1 天之前 ^1  \n^2 \n \n 回复 ? \n\n\ncoolplay: 等到你痛苦不堪，又找不到原因的时候，来这里找解救的办法。\n\n拿罪过或病痛忽悠人类的，是最原始的方法。不过在现代科技面前，你这套貌似没什么意义。我现在一直是痛苦不堪的。你的套路太low了。也或者你有两手，但是表达能力不行。做火观的修炼方法我倡导了几十年，但是我还是得了肿瘤，一直在膨胀，无法消除。岂是俗人智慧能明白的！\n\n\ncoolplay ━ 1 天之前 ^1  \n^2 \n \n 回复 ? \n\n等到你痛苦不堪，又找不到原因的时候，来这里找解救的办法。\n\n\nholyins ━ 1 天之前 ^1  \n^2 \n \n 回复 ? \n\n\ncoolplay: 佛说：佛灭众生，而实无众生得灭度。圣经说：上帝说要有光，于是便有了光。我们需要燃尽的，不光是我们身体里的罪恶，还有这世间的罪恶！ [...]\n\n你有些观点如果说清楚还是有道理的。但是无论上山采药还是食疗或矿物疗法，都是吃药，而不是禁止吃药。这类观点，也无需创立什么然教，令人反感。\n当今从来自宇宙能量场的信息，清理人类罪恶的首要，不是燃尽，而是观想圣光与圣爱，进行地球、人类乃至宇宙能量场的清理。在通过观想各色光比如紫光蓝光等清理脑病毒开始清理邪恶势力在宇宙布置在地球上内外的病毒以及宇宙空间能量信息场。\n火之燃烧，是其中一种方法。磁场能量场还有更深的奥秘。\n\n\ncoolplay ━ 1 天之前 ^1  \n^2 \n \n 回复 ? \n\n \nfaith: 佛经有说：阎浮提众生，举心动念，无不是罪，无不是业。圣经有说：世人都犯了罪，亏欠了神的荣耀。你要燃尽的，首先是你自己。而不是组建“放火党”。 [...]\n\n佛说：佛灭众生，而实无众生得灭度。\n圣经说：上帝说要有光，于是便有了光。\n我们需要燃尽的，不光是我们身体里的罪恶，还有这世间的罪恶！\n\n现在是乱世，乱象纷呈，所以才需要这么严格。中医我是推崇的，中国古老的传统，然而现在医院里的东西都变了味。你即使吃的是中药，你吃的那些是什么东西其实你根本不知道。正统的中医应该是去山上采药吃，而不是吃着别人做好了的成品。如果你还不明白，继续吃着“中药”，西药，会加深世上的罪恶。所以不吃药，是最简单的方法，不看医生，是最明智的选择，不让任何人触碰你的身体。加入然教，建立然教，才是解救世间的方法，我们能解救我们自己。",
				"added": 1519451190
			}
		],
		"1_1PT84QT2xX5HYJ24BpNJPZ4AqKRBcEyDdB": [
			{
				"comment_id": 5,
				"body": "where is the issue? I don't want you to do such things, like to kill some people. But eyes to eyes, teeth to teeth, we want the peace.You don't kill me, I won't kill you.Maybe I couldn't. And we want the good time back! The world is falling, some people are doing something to prison us and kill us slowly, you don't know.Maybe , you know.",
				"added": 1519538355
			}
		],
		"1_15vxijofrLcqnmh8RSbxTtbW9ZTfzy57TU": [
			{
				"comment_id": 6,
				"body": "明白，我原来建了几个论坛，都是光有发言都看不到内容，太难了，这东西玩不转。",
				"added": 1519546632
			},
			{
				"comment_id": 8,
				"body": "我原来建了几个论坛，都是光有发言都看不到内容，太难了，这东西玩不转。",
				"added": 1519566664
			}
		],
		"2_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i can see it good. alles gut\n\nthat work!",
				"added": 1519799241
			}
		],
		"11_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 10,
				"body": "coolplay ━ on Feb 10, 2018 ^1  \n^2 \n \n\n\"human-robots\", yes. They want us be and they are doing so. They just figure out a good future that you will have a good life, you need work for it, hardly and hardly. But they never wish us living well and be real rich.\"outer influence\" is feared by govenment in China. They will controll us and after that controll the world, do you believe?\nHow about your country?\n\ncoolplay ━ on Feb 10, 2018 ^1  \n^2 \n \n\nI don't know much more about crypto-currency. But I know the creator of ETH is living in Russia.\nPeople in China could not access the Google Translate unfortunately. The world is falling, falling to evil.\nWe don't know much about the world, but we know people is unhappy living in China. Maybe you could research the crypto-currency technology in Your country, Estonia. We have no rest to do such thing in China. We have to work from day and night. Pay for the dubt of department every month. Does Estonia belong to Russia?\n\ncoolplay ━ on Feb 08, 2018 ^1  \n^2 \n \ndeepfake, Don't trust internate.Talk with people face with face, OFFLINE!\nInternate cuts us into parts.\nindepent us from each other.\n\nJoin the Sure.\n1.Burning the world, To Be Sure.\n2.Do not eat medicine, Do not go to hospital, Do not take any test.\n3.When you meet your brother of Sure, Do not take any electronic set.\n4.Do not eat any things only few people could get.\n5.Do not trust any body not of Sure, Trust Your Master.\n6.Do not fake your brother of Sure, otherwise Cut you into parts.\n\ncoolplay ━ on Feb 09, 2018 ^1  \n^2 \n \nBecause world is falling... why we lost our spirits of conquer the world, why we could not believe with each other. Because some people are disturbing/faking us in the shadow.\n\nSo we need the Sure, to make the sure, making us coming together.",
				"added": 1520001362
			},
			{
				"comment_id": 11,
				"body": "> [ssdifnskdjfnsdjk](#comment_3_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hi, please who is the surer and what/who is the sure?\n\nSurer, the follower of the Sure. The Sure, the infinite secret of nature.",
				"added": 1520245061
			},
			{
				"comment_id": 12,
				"body": "The Chinese government is persecuting his people, in order to transform the domestic economic contradictions, they do not hesitate to poison their people, man-made avian influenza, pneumonia, pulmonary fibrosis, depression all kinds of diseases, in order to let the people into the hospital spend money, do a variety of checks and false treatment, thereby artificially manufacturing consumption, reduce the government economic pressure. The insurance industry has reduced health insurance this year, and hospitals have limited medication, and pharmaceutical factories have ceased production of specific medicines. At the same time monitor and monitor their own people, to combat all kinds of people with different ideas. Not waging war, torturing their own people, persecuted their own people, can no longer deceive, unarmed civilians, this approach is more brutal than the Kuomintang 1938.\n\nThis government will be overthrown by foreign governments, China will perish, the people will win.\n",
				"added": 1520267624
			}
		],
		"20_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 13,
				"body": "中国政府正在迫害他的人民，为了转化国内的经济矛盾，他们不惜给自己的老百姓下毒，人为制造禽流感，肺炎，肺纤维化，抑郁症各种疾病，就为了让老百姓进医院花钱，做各种检查和虚假治疗，从而人为制造消费，减轻政府经济压力。保险行业今年减少了健康保险，医院限制了用药，药厂停止了特效药的生产。同时监控和监视自己的人民，打击各种有不同思想的人。不能发动战争，就折磨自己的人民，迫害自己的人民，无法再欺骗下去，手无寸铁的老百姓，这种做法比1938年的国民党还凶残.\n这届政府必将被外来政府推翻，中国必将灭亡，人民必将获胜。",
				"added": 1520267811
			}
		]
	},
	"comment_vote": {}
}