{
	"title": "爱上穷人的网络\n\n",
	"description": "\t网络精神就是共享。零网适合共享信息和知识，btsync 适合共享资源，二者搭档就可以共享意识！\n",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1481368377,
	"post": [
		{
			"post_id": 6,
			"title": "简单的SWOT一下下",
			"date_published": 1483228800,
			"body": "\n来零网瞎逛了个把月了，把一些观感小结一下。\n零网主推点对点分布式架构，这是个很好的概念。问题是零网能否和外网竞争？如果我们对零网做个SWOT分析就可以把这个图景整理得比较清楚。\n\n优势：零网有什么优势？\n最大的优势或许应该算是人的愿望：不喜欢被审查、被删贴、被实名。所以零网应有望获得大量的自发支持。不过还是应该先从技术角度看看零网的优势何在。从技术角度看下来，咳咳，貌似零网没有什么优势，可以说尽是劣势。哦不，有个优势，那就是同步！零网具有自动同步动能，实现了“所见即所存”。存下来了离线也可浏览。外网的同步功能相当局限，各种不便，没法和零网比。\n\t所以现在可以暂时确认零网有两大优势：\n\t1.反审查。\n\t2.同步功能。\n\n劣势：零网有什么劣势？\n劣势一：最明显的，由于没有服务器，导致零网有着趋向于混乱的无政府状态的趋势。在外网上，服务器实际上担当了类似政府的角色，行使着类似政府的职能。服务器功能强劲，可以制定和执行政策，对其范围内有管辖权，根据接到的请求提供预定的服务。即便是个暴君服务器也还是为履行一定的职能而存在。这些服务器组成了金字塔结构，为外网提供了相对稳定的秩序环境——这就是服务器的存在合理性。大概没几个人真的喜欢生活在一片混乱里。去中心并不意味着去秩序。假如对服务器不够满意，那只意味着需要寻找其他方式来实现服务器的功能，而不是放任那一带成为真空。这也就意味着：去中心要求每个节点都必须在某种程度上承担起服务器的职能。在这个意义上我要明确强调：零网的理想要求网人的素质与之匹配。\n表面上，零网的进入门槛很低。但实际上那些被外网娇惯坏了的人很难适应零网的要求，因而实际上无法成为有价值的节点。不但无价值，而且相当有害。这些人的烂德行包括但不限于：\n\t- 只知道伸手要内容而不是自己提供有价值的内容；\n\t- 想要消遣或发泄，而不是致力于更加建设性的活动，比如互相帮助，互相启发，寻求创新。\n\t- 言行粗鄙，毫无责任心，三句话就能暴露出乡下佬的内裤，乃至露出那点没长毛的鸡鸡。\n\t- 一叶障目不见森林。整天只纠结于自己能对付的细节问题，而对自己到底在做什么，为什么而做，是不是正在做最该做的事，以及整个大的图景漠不关心。。\n我就直截了当说吧：零网要求的并不是大量傻瓜式的节点，而是有责任心有担当力且有个性的节点！基于这样的节点才可能建立生机勃勃的兼容秩序，否则零网就注定会变成霍布斯版的网络中世纪：节点对节点是狼。或是萨特版的网络荒诞剧：节点即地狱。\n在我看来能否基于大量对等节点而非服务器来建立某种足够稳定的秩序，这是零网的软肋，事关零网的成败。这个任务完成好了，零网自会有长远发展。否则的话再多的各种其他努力统统无用。\n劣势二：功能单一。\n零网的另一个劣势是功能单一。引用我自己的话：。。\n\t\"比如现在ZN在我看来其实就只是一个公告板。当然了它有邮件功能，不过估计用得很少。至于下载和共享那更别提了。所以说到底就是个公告板。也就是说目前ZN的功能极为单一。要是和互联网相对比的话那就可以说简直就是处于上个世纪90年代的最初始阶段。FN倒是功能更靠谱些，而且窃以为其整个架构考虑得比ZN更全面，也更具深度。但是因为强调匿名性导致易用性和可维护性方面牺牲太大，这虽然是可以理解但也毕竟不能算是最优解。。\"\n\t暂时确认零网有两大劣势：\n\t1.要求节点承担服务器的部分职能。这方面的考虑零网目前可说是完全缺失。\n\t2.功能太过单一。而且就算能够把下载和共享问题解决了，和外网的技术成熟度相比也并不具有优势。\n当然了零网是新生事物，有缺陷很正常。这些问题也应该终究能解决。我只是认为有必要尽快解决。要知道无数事情成败之别往往就在于能否将缺陷或问题解决得足够快！\n\n机会：零网有什么机会？\n最大的机会在于同步。前面说了同步是零网的优势所在，所以我认为零网可以主打同步。但不是目前这种10M以内的同步，而是至少10G以上的同步。关于同步网络的意义，参见我的另一篇博文。（ http://127.0.0.1:43110/1PE5GTgUjKVQuudoz4P1YCrmZPVXvZwRmR/?Post:2:%E8%A7%81%E9%9D%A2%E7%A4%BC%E4%B8%80%E7%AF%87 ）\n如果谁还是有什么疑虑的话，让我这么表达一句吧：缺乏同步功能正是FreeNet最大的缺陷。如果当初FreeNet的架构中包括同步的话，现在根本就没必要另外开发什么零网。不过当时同步技术简直是尚未出现，所以完全可以谅解。。现在零网原生具备同步功能，不充分发挥一下就太笨了。。可惜我非码农，只能把话说到这里，没本事去实现。这个光荣任务就交给有心人多多费心了。——零网英雄非你莫属！\n\n威胁：零网有什么威胁？\n威胁一：来自骇客的威胁。前几天的读写目录实验充分证实了这种威胁。无论任何内容，只要公开密钥就会招致恶意攻击，而零网现在就只有这么几个人而已情况却已经这么乌烟瘴气。既然如此，如果谁再用点心，把各种恶意代码放在网站上，然后大家都稀里糊涂地同步过来，就是标准的引狼入室。\n威胁二：来自外网的威胁。零网的出发点就是要和外网分庭抗礼，外网有无数种方式对此作出反应。这方面各位都有切身体会，无需多说。\n威胁三：来自审查的威胁。不光是中国有审查，也不光是色情或政治才有审查，法庭关闭丝路是一种审查，书商起诉谷歌是一种审查，美国最近打击P2P这也是一种审查。\n威胁四：来自自身的威胁。如果说人最大的对手就是自己，那么也可以说网络最大的对手就是网络。网络是强大的，面对的前三种威胁都是小威胁，是技术性的，是可以解决的。最大的威胁还是网络自身。网络在核弹的阴影下降生，在审查的鞭挞下成长，在骇客的骚扰中成熟，多少取得了一点成就也总是伴随着内在的不确定性，而未来的进化路径还隐藏着天知道多少风险。。零网就是惊涛骇浪中的一朵浪花而已，我们纵然喜欢它又担忧它，但终究还是要让它去闯。。并祝它好运！\n\n好了。就说到这里吧。本文算是个告别。我还有别的兴趣，一段时间内不会再来了。这段时间和各位相处得很有趣。以这种方式总结一下对零网的观感，祝大家玩得开心！\n\n"
		},
		{
			"post_id": 5,
			"title": "书： bit by bit",
			"date_published": 1479531048.322,
			"body": "Bit by Bit_ How P2P Is Freeing the World (2015) by Jeffrey Tucker, Roger Ver, Patrick Byrne\n我正在看。发在这里应该很切题。欢迎讨论。这也算是个在零网发资源的测试。能不能下到，请给点反馈？\n\nhttp://127.0.0.1:43110/1PE5GTgUjKVQuudoz4P1YCrmZPVXvZwRmR/loader/?15im1ajd\n"
		},
		{
			"post_id": 4,
			"title": "共享一盘音乐",
			"date_published": 1479357628.905,
			"body": "发福利了。共享一盘Psybient音乐。放松身心哦\nPsybient风，我望文生义翻译成 心境。要是你们感兴趣还有更多。\n---------\n抱歉共享目录已关闭。"
		},
		{
			"post_id": 3,
			"title": "btsync 共享",
			"date_published": 1479189466.281,
			"body": "共享个目录：\n\n内容是正在看的一些TEDtalks。共享之。\n-------\n抱歉共享目录已关闭。"
		},
		{
			"post_id": 2,
			"title": "见面礼一篇",
			"date_published": 1479024823.966,
			"body": "新来零网，顺着尝鲜的冲动，我刚建立了这个博客。那么该说点什么呢？决定把这段时间陆续写下的一点乱想发在这里，希望和同道交流。下面是本文的题目：\n\n\t\t\t\t网络如何影响了人类思维？\n\n很高大上的题目。对吧？或许你的第一反应是标题党？不不，我保证不是标题党。我或许无法在这篇文字中完整回答问题，但至少是想为各位自己的思考提供一个有参考价值的出发点。\n那么我们开始了。\n\n\n---\n\n我从这样一个问题开始：话说P2P网络的本质是什么？说法很多：点对点，反审查，自由共享，去中心化……不过我觉得这些说法都只触及问题的表面，如果要深入到问题的核心，那么所有这一切的实质就归结到一个概念：同步。——P2P的本质是同步网络。去中心只是表面，同步才是实质。\nOK这就是本文的核心内容。感兴趣的可以继续往下看。不感兴趣就可以略过了。\n\n_____________________分割线分割线———————\n\n\n我的思维是从P2P开始的，然而一发不可收拾，所以决定整理一番，弄成一篇文章。主要意图是给自己梳理下思路。发布出来则是请大家帮着看看，挑挑毛病，集思广益，BLABLA。\n我想说说我认为的网络未来是什么，而之所以会有这样的未来则是因为网络给人类的意识带来洗礼。。那么从哪里开始呢？也许应该从头说起才方便理清整个概念。我又不想追溯回到活字印刷或古登堡时代，或许从新闻开始比较恰当。那么就从新闻开始好了。\n新闻业的职能类似于社会秘书，社会公告板，社会情报站，或者用更时髦的概念说，即社会界面。新闻业处于夹缝中：一边是纷乱的各种信息，另一边是复杂多样的社会需要。为了完成其任务，新闻业势必只能将一切简化。如何简化？答案就是聚焦在两点：一是流行时尚，二是突发事件。相应地也就忽略了另外的要点：比如具体个人的信息需求，以及内行的专业资讯。\n换言之新闻无非就是两招：要么造梦，要么造惊悚。所谓造梦就是人变成了狗，所谓造惊悚就是人咬了狗。\n人变狗是新闻，人咬狗也是新闻，然后其他的一切统统不算新闻。新闻就这么两招，所以新闻业倾向于肤浅和狂热是不可避免的，这是其基本职能使然。而这种深思熟虑的片面性助长了偏执狂们得势，让善于装腔作势的演员们掌权，同时也使得新闻业面对网络的崛起毫无招架之功。\n网络信息的关注焦点正好是新闻业无力顾及的：个人的信息需求和内行的专业资讯。——而这才是人们真正想要了解和值得了解的信息。于是网络和新闻从一开始就有着结构性的冲突。这种冲突总的说来是一边倒的：随着网络的发展壮大，新闻别无选择只能投降，就是说只能日益网络化。这就是这些年已经发生的事情。\n\n但是新闻仍然是新闻。新闻具有新闻的职能，这种职能不是网络可以完全替代的，至少目前还不行。投机者总是需要可靠的新闻源，这里的要点是可靠性。网络信息虽然有各种优势，但是缺乏那种专业新闻机构苦心营造的可靠性。\n新闻的意义在于它是机会的指示器。只要有投机者存在，对新闻的需求就存在。在这个意义上新闻业不会消失，只是从纸媒转换到网媒而已。\nok，这就是问题的一头：新闻业和其受众——投机者。他们都正在受到网络的强大影响，都想运用网络来增进自己的能力，又都因网络肆无忌惮的颠覆性能量而困惑不安。\n\n然而社会上还存在另一类人，整个人类历史上一直都有这类人，我称之为协同者。正是协同者为了自己的需要建造了网络。\n协同者不需要新闻，协同者需要的是知识，是信誉，是灵机的创见，是深入的洞察，是迎接挑战的激情，而这一切都可以归结为朋友们的状态更新。这一点无论在前网络时代还是后网络时代都是如此。但是有了互联网之后，状态更新将会如此强大，以至于社交网络似乎完全可以把新闻业替代掉，当然也会把酒馆茶座或俱乐部替代掉。。不过别担心，这种替代不会完全彻底。因为新闻网和社交网针对的人群是泾渭分明的两种类型：投机者和协同者。\n投机者关注信息，协同者关注人。\n投机者由机会驱动，协同者由兴趣驱动。\n投机者凭资本做事，协同者凭知识做事。\n投机者的绝招是复制，协同者的绝招是创新。\n投机者想要利益，协同者想要成就。\n投机者强调交易，协同者强调共享。\n投机者靠法律处理分歧，协同者靠协议处理分歧。\n投机者适应现实，协同者改造现实。\n投机者追求梦想，协同者追求实现。\n投机者是成功导向，协同者是进化导向。\n投机者是组织人，协同者是网络人。\n可见投机者和协同者的兴趣不同，行为方式不同，生活方式也不同，基本观念不同，虽然每天低头不见抬头见却像是活在全然不同的位面，以至于难以互相沟通，甚至难以和谐共处，随时随地都在明里暗里的较劲。。\n理清了投机者和协同者的概念就很容易明白：新闻网络是为投机者量身定做的，而社交网络是为协同者量身定做的。这两种网络将会在一段时期内平行地共存，分别由各自的群体所支持。——直到由同步网络来打破僵局。\n\n。。。\n前面所说的都是序言，现在才算进入正题：网络未来是什么？答案是同步网的崛起——我认为这就是网络的下一步趋势。\n如今的网络图景大概是这样：【终端，门户，社交，同步】。\n终端，泛指我们用于上网的各种硬件设备。从电脑，手机，到汽车手表甚至波鞋，只要能联网都算终端。\n门户，泛指那些门户网站，也包括所有那些主要功能在服务器端执行的网络应用。那是‘内容为王’的口号当道的时代。这些对网人都是司空见惯，也不必多解释。\n社交网络，泛指所有WEB2.0，所有的用户生成内容的网络应用。社交网和门户网的区别在哪里？基本上，这里有一个重要的转向，就是从关注数据转向更有意义的对象，即关注生成这些数据的那些个人。比如说，我读一些八卦琐事，是因为发布这些东西的人是我的朋友。我也不再满足于阅读某一本书，而是想和作者更深入地讨论一下。我听到些感兴趣的小道消息，想找当事人证实一下。诸如此类，成为指引网人行为更为重要的动机。于是网络重新成为人与人的联系，网络成为虚拟相处，而不仅是文本与文本的超链接——不妨称之为人与人的超链接。与人联系，毕竟这才是我们更关心的事。这也就是社交网络会异军突起的道理所在。\n同步网络，哦这是本篇的主题。这里说的同步网络，就是指具备自动同步功能的网络。其中包括了相应的设备，相应的协议，相应的软件，和相应的用户群体。——比如Zeronet。比如Btsync以及任何不依赖中央服务器的P2P。实际上这本来就是互联网最初的理想，只是这些年为了和社会环境妥协而兜了个大圈子而已。\n。。。\n\n现在的形势是：社交网络的格局已经大致稳定，同步网络则是处于腾飞的前夜。我相信同步网应该是下一波浪潮，不过对其具体形态并不那么确定。在此大放厥词就是想抛砖引玉邀请各位一起思考。\n\n。。。\n那么为什么？为什么同步很重要，其重要性甚至超过社交？超过通讯？超过信息本身？\n因为同步是形成协同的基础设施。的确，我们上网是想与人保持联系。然而仅仅联系并不能真的解决问题。就是说光有联系还不够，我们还必须能够实现协同才行。所以我们很快就开始不满足于建立联系，而是有了更高的要求，现在我们期望的是：在联系的基础上实现协同。\n如果没有协同，那么就实际上无法进行任何有意义的合作行动。那样的话网络就只能永远停留在吵吵嚷嚷和夸夸其谈的层面上，而无法成为实际行动的纽带。所以只要条件允许，网络必然走向协同。\n于是网络上出现过许多的协同实验。（你们可以自行脑补这些实验，例子多到我都不知道举哪个好了）。而所有这些协同实验如果没有同步机制就是不现实的。协同和同步就是这样一对难兄难弟，命中注定要紧紧地捆绑在一起。\n\n为什么这么说？\n第一，因为同步为建立社会层面的自组织提供了不可或缺的前提条件。\n\n第二，因为同步是个性和参与的必然结果。也只有同步网络才能充分服务于个性和参与。\n\n第三，因为同步代表了网络的最高理想。不怕武断地说一句：如果没有同步，一个网络只能发挥10%的潜力，另外90%都会浪费掉。\n为什么这么说？理解这一点需要作点视角转换。之前我们一直是在关注网人要什么，现在我们需要转换一下视角，要去关注一下网络要什么。\n试着从网络的角度想问题，假如你就是一个网络，你要的是什么？你怎么看待自身？你是否愿意被看作就是一堆数据和一串流量？也许你也有灵魂有思想有欲望，也许你也觉得受到限制，也许你也渴望着超越平凡。。\n在图像音频和文本的背后也许还有值得深入理解的东西。那么这一切的背后还有没有什么东西？莫非是一片虚空？肯定有些人就是这么想的，不过我不这么看。\n我时常恍惚地意识到，编排好的文字不算什么，美轮美奂的图像不算什么，高保真的音频也不算什么，无休无止的视频也不算什么，终究这些都只是人机交互的界面而已。也就是说并非网络的本质。\n在界面的背后，网络的本质是和信息无关，和数据无关，和观点无关，也和注意力无关，网络的本质关乎人与人的交互作用。这种交互作用，其含义在于互相挑战，互相理解，互相激发，互相启迪。\n\n第四，基于同步机制能够建立健全而稳固的网业文明。\n前三点似乎不必多说，我想对第四点多说几句。在此我们需要重新整理一下网络和现实的关系。我的看法是：网络并不关心现实，网络关心的是制造新现实。网络也不在乎传统，网络在乎的是要重构其自己的传统。\n不必整天纠结于网络是虚拟了真实世界还是虚拟了另一个虚拟世界，这些统统无关要旨。事实上网络不应事无巨细地反映世界，这显然既不可能也无必要。\n认为网络忙于虚拟现实，或是认为网络试图改变现实，这都属于前网络时代的自作多情。实际上网络没空理睬现实，因为网络有自己的事情要忙。至于说网络不小心折射出了一些现实，那纯属顺手牵羊式的副产品而已。\n那么网络和现实到底是个什么关系？我说网络自成一个世界，网络造就它自己的现实。显然这里存在一个概念切换：此现实非彼现实。不妨称旧现实为模拟现实，而称新现实为‘扩展现实’或‘增强现实’。这也不是我的发明，如今关于这方面的讨论也已不少。\n这些讨论基本上是在说，当我们开始关心网络和现实的关系，我们是假设存在一个独立于网络而存在的‘现实’，同样也假设‘网络’代表的就是和‘现实’相对称的‘虚拟’。不过我觉得这些讨论陷入了某种误区，因为这些个假设都很可疑。经过一番推理过程（此处省略一万字），我们势必应该承认现实是分层次的，传统意义上的现实属于低阶现实，它与原子和蛋白质相对应；机械造就了中阶现实，它与组织和政府相对应。而网络造就了高阶现实，它与比特和赛博空间相对应。要点是，这些都是现实，而非虚拟。\n就目前而言，虚拟只有理论意义。我们尚未发展出像样的虚拟技术，因而尚无法拿出什么像样的虚拟现实。所以到现在为止我们所能实现的，所能观察的，所能讨论的，其实都是现实。——确切的说是现实的不同层面。\n\nok这就是我现在要强调的：网络现实就是网络现实，它不是虚拟。如某些流行观念所以为的那样，把网络现实视为虚拟是很典型的误会，流毒极广，为害不浅。澄清现实和虚拟的区别相当必要。否则无法展开下一步讨论。\n还是打个比方吧。网络和虚拟的关系问题就好像是语言和数学的关系问题。语言属于现实领域，而数学属于虚拟领域。正如我们不会纠缠于语言是不是数学一样，我们也无需纠缠于网络是不是虚拟。正如语言造就了它自己的现实一样，网络基于编码，也可视为另一种形态的语言，并且同样会造就它自己的现实。至于数学或虚拟，算法或数据，那纯属另一类主题，本来就不该和语言或网络的性质问题搅和在一起。\n\n于是呢？呃，是不是应该说：可以展望一个比鸟托邦还鸟托邦的网业文明？\n一旦我们不再把网络误会为虚拟，就能看到另一番图景：网业文明。\n和未来的网业文明相比，现在的网络只能算婴儿网络，并且我也认为有必要受到媒介的和法律的监护。——直到网业文明能真正成熟自立。\n网络是在媒介建造的环境中逐步发展起来的，这意味着在相当长的一段时期内网络都处处烙印着媒介的影响痕迹——直到网络成熟到可以全面摆脱媒介的影响为止。\n由媒介来做网络的保姆相当合适。不过就像儿童总会成人和迈向独立一样，网络也肯定会走向成熟并独立自主。当网络发展到了这种程度，就会呈现为新的形态。这种新形态甚至和如今的网络形态相比都会迥然不同。——那就是我们可以称其为网业文明的时候。\n那时候的网业文明将会是什么样子呢？现在我们只能想象而已，而且我也没把握说它会是什么样。好吧，我建议现在大家和我一起盘腿打坐，开始冥想。。\n你们想到了什么，欢迎贴出来说说哈～\n\n。。。\n\n顺便我想反驳一下某些圈子流行的P2P无效论。（或更准确点说是专门炮制出来黑P2P的胡扯）\n一直以来貌似有一种论调认为同步网不可能发展壮大，因为什么？——因为缺乏商业公司支持！但我不同意这个看法。那么我来说说我的看法。\n首先要承认网络需要经济支持。不过我要强调：第一，其经济支持不见得必须来自商业公司。第二，网络需要的支持是全方位的，也并非商业公司就足以提供。第三，同步网可以开创自己的盈利模式。\n前两点不想多说，现在只想解释下第三点：同步网如何开创自己的盈利模式？关于网络的盈利模式已经有过大量的讨论，不过说到底都逃不出‘广告’和‘捆绑’这两招。我说这种用工业模式卖网业产品的套路只是特定历史阶段的无奈之举。我觉得，或者说猜测，同步网或许能最终确定网业自己的盈利模式，就是说能够使网络跳出只能做广告和捆绑销售的怪圈，而走向基于个性定制的付费模式——或者更确切地说是‘捐费模式’。因为同步网有条件充分满足网人的两大基本需求：个性和参与。\n先说参与。参与是可收费的。传统上就存在许多可收费的参与权，比如连锁经营许可证，俱乐部资格，会员席位，投票表决权等等，更别说股东身份了。不过通常仅靠参与权还不足以让大家掏腰包，所以还需要更强诱因。这种诱因就是个性。\n那么这个需要付费的个性怎么理解呢？大概可以这么看：说到底，个性是真正值钱的东西。为什么？因为它很稀罕。就是这样。\n举例，比如梵高的作品会卖到天价，是因为这个人非同寻常的个性才能造就如此这般的作品。并且斯人已逝，如此作品也再难寻觅了。梵高是艺术家，那么类似地，一位作家，一位理论家，一位政治家，一位摇滚明星，一位管理大师，甚或一位宗教先知，乃至任何一位偶像，其内在价值最终都可归结为个性。说到底任何创新的实质就是个性。就连商业品牌本质上也就是代表了一个公司的个性。如此等等。\n上述所有的这些标签所标识的并不是某人的身高体重籍贯或生活嗜好，而是标识了那种个性。当这种个性被大家认可，该人就能获得那种标签。这就是社会声望的实质。并且为了能接近这种个性，人们会以各种各样的方式向杰出的个性致敬，付费只是其中的一种简单方便的途径而已。——人们花钱有相当一部分动因是因为认可那种个性。\n个性有价值。ok。而且显然是一直以来都有价值。这也算不上新闻对吧？既然如此，事情到了网络时代又有何不同？这当中的区别大了。在前网络时代，个性需要通过作品来表达，或是表演，或是功绩，或是著作，或是宣传，或是故事，总之个性必须借助某种替代方案才能为他人所了解。然而在网络环境下，个性回归其自然状态，可以在日常生活中，在一言一行中，在没有计划没有排练没有预演的情况下即时呈现，更可以在互动合作的过程中随时共鸣。——就好象我们和那个人朝夕相处一样。如今还有个新词汇专门描述这种现象——替身（Agent）互动，虽然跨域时空却更似朝夕与共。（算了不想扯远，再省略一万字）\n关于网业经济这个话题还是应该举例说明才对，因为我不想让各位误以为我在谈论丝路网赌或地下经济什么的。但我太懒了，懒得叙述具体事例。不过好在各位也应该自己有体会，比如说Amazon和Apple就已经在这么干了好几年了，虽说在我看来那也只是处于初级阶段，不过我也可以明确告诉你那才是人家成功的真正奥秘。再比如众筹网络，代表了这方面的一个新发展。。\n好了，话说到这里暂停一下。知道我在说什么的，请举手～\n不知道我在说什么的，请自己先去Amazon和Apple补功课。\n其实众筹在墙内都已经有一些尝试动作了。。不过我自己并未直接接触，就不多提了。欢迎了解情况的童鞋发表评论。\n\n我可以毫不避讳地说，网络商业模式的出路就在销售个性，进一步还会销售更新版个性，还会互相销售个性，而且还会发展出个性期货，以及个性衍生品。。网络终究会跳出卖广告的低层次模式，也无法停留在倒卖隐私的准间谍模式，而必然进入销售个性的层次——让个性可以公开展示，可以低成本大规模地并且差不多是即时地销售给任何对其感兴趣的市场。而且这是好事。因为其引申意义在于重构全球文化，促进其开放透明，也促进其进化升级。\n当然除了赚钱之外网络还有更重要的事情可干，那就是物以类聚。共享导致协同。虽说形成协同向来都不容易，不过若没有共享则会让协同近乎不可能。网络提供了相当方便的条件，让志趣相投的人们聚合在一起，自我组织，形成社群，乃至形成虚拟组织，运作虚拟项目。显然，这是个性共享进而形成协同的必然结果。赚钱只是网络必须干的事，聚合才是网络真正想干的事。\n\n。。。\n那么回到开头提出的那个问题：网络的未来是什么？\n在我的想象中，网络会在不断演进中整合成为一个立体的有机的层次结构，我称之为网络金字塔：【猫咪网络，做秀网络，共享网络，同步网络】。\n处于底层的是猫咪网络，即以搞笑猫咪为特征的那种消遣网络。或者你喜欢叫做卖萌网络也成。然后是做秀网络，即让各种表演者都可以登台做秀，或者说让资本和媒体联手操纵大众思维的网络。第三层是共享网络，即黑客极客们向来盘踞的那个网络。过去这个网络对外来者不甚友好，不过随着外部环境的进步其趋势是会走向越来越开放。顶层是同步网络，它让每个人都能即时发布自己的各方面状态，与亲朋好友们保持同步，与自己关心的任何主题保持同步。这正是网络下一步的发展方向。\n网人将会随心所欲地在这个网络金字塔中穿梭，根据自己的需要分别与这四个层面保持接触。拿日常生活做个比喻，这就好像人们日常生活的四个面向：【家庭，工作，朋友，志趣】。无论具体生活如何，人的时间精力大致就是分配到这四个象限中。类似地，网上生活——无论是带宽、流量、注意力——也会自然而然地在上述网络金字塔的四个层面中进行分配。\n\n。。。\n现在再回到本文的主题：网络如何改变了人的思维？\n这是个好问题，不过我尚未见到有什么好答案。而且估计在人们更加深入的理解网络之前也不可能出现什么好答案。毕竟这个问题如此虚无缥缈，想拿出个好答案也是不容易。所以我建议把这个如此之好的问题暂且放在一边，然后顾左右而言他，先关注一下我们对于网络的理解是如何逐步深化的。\n人是如何理解网络的？这个问题也很重要，而且更加具有实践意义。毕竟人们如何理解网络决定了他们会建造什么样的网络，会如何运用网络，以及会如何面对因网络而产生的种种问题。\n\n。。。\n我的网络观——网络即催化。\n人如何理解网络？这不妨称为网络观。\n网络为什么会存在？网络为什么有必要存在？网络的功能到底是什么？网络应该成为什么样？网络还能成为什么样？对诸如此类的问题的回答就是我所谓的网络观。\n显然每个人都会有自己的网络观，就像每个人都会有自己的世界观人生观一样。现在我姑且提供点自己的看法。\n我认为人类对网络的理解是逐步深化的。（反正事情也只能如此，还能怎么样？）\n那么这种逐步深化的过程是怎么样的？这才是要点。对吧？我认为网络观的深化可分为几个阶段：信息阶段，数据阶段，知识阶段，催化阶段。\n信息阶段，即认为网络的功能是传送信息。那是与电子邮件遍地开花相对应的阶段，所关心的主要是信息如何编码，如何传输，如何解码。\n数据阶段，即认为网络的功能是处理数据。包括数据的形成，数据的聚合，数据的联接，数据的分析等等。于是各种计算理论和大数据理论应运而生，但是这些理论的视野相当局限，并不触及网络本身的存在合理性问题。打个比方说的话，这个阶段的网络就像个游乐场，遍地都是从天而降的数据玩具，那些童年没过好的小孩们当然会乐翻天。\n知识阶段，即认为网络是个知识体。这时人们的关注焦点才算开始触及事情的实质，即知识是网络的本质。由于知识是各自成体系的自洽结构，于是人们也才开始意识到兼容性是个绕不过去的关键点。一旦人们开始从这个角度看问题，接下来很多事情就容易多了——现在大家已经明白基于知识可以从无到有随心所欲地建立网络。这个阶段网络开始分化出许多分枝，开始自觉地划分势力范围，也开始更大胆地分别向各个方向探索，做事也更加有的放矢。如果拿电脑操作系统领域可以做个有趣的比较，两者有很多相似之处。不过这也不是我现在要讲的主题，这里就不多说了，当作给你们的思考题。\n催化阶段，即认为网络就是一个催化器，或者叫做一个培养皿，一个观念实验室，随便。而这一切都围绕着一个核心，即建构世界。我认为这才是网络真正想要的（前面三者是人类想要的，这第四点才是切中网络下怀）。也就是说，网络就像一张电子蓝图，我们都跑来这张蓝图上写写画画涂涂改改，其效果就是我们正在参与共同设计一个充分网络化的新世界。\n\n催化会导向何方？还用问吗，当然是一个新世界！\n再强调一遍，网络的意义在于让我们大家共同参与设计和建造一个新世界。无论有意还是无意，反正这就是大家上网在干的事。这可以用蚁巢做例子。蚂蚁没有互联网，否则它们肯定会在网上设计出更瑰丽宏伟的蚁巢。相对于整个世界，网人也就像蚂蚁一样，谁也看不到全貌，谁也猜不透未来到底会如何，事实上也没几个人真的整天纠结这个。只要打开浏览器随便看看，各人互相之间所干的是非但称不上协同，而且倒像是整天在互相拆台。大家对于正在干的是什么事都各执己见，甚至大家对于某件具体事情进展到了何种程度也达不成一致。然而凡此种种都不妨碍互联网在大家手中乱哄哄地成型，再乱哄哄地搞得铺天盖地，再乱哄哄地一次次升级换代。在互联网的尺度上看，个别的人类真的不见得比蚂蚁聪明，不过正像蚁巢告诉我们的那样：这一点关系也没有。鬼使神差地，我们就是能在一片混乱中建立起远超出个人所能想象的丰功伟绩。然而我们是理性的人，不愿相信事情是由于鬼使神差之故，于是就必须认为这是网络本身的机制所致——这种机制就是我这里说到的催化机制。这就是我说网络是个催化器的意思。\n和知识阶段相比，催化阶段有何不同？还是打个比方来说，每个知识体都像一个信息蛹：在特定边界范围内，信息或知识不断地复制和发酵。这是必要的，必须要有这样的阶段，然后才会有蝴蝶纷飞。那么蝴蝶飞出来之后又该干什么？答案就是催化。\n催化的价值何在？随着人类越来越自由，最终能够限制我们的就是我们自己。要超越这一重终极限制只有一条有希望的道路，那就是催化。——即让我们凑到一起互相挑战，互相借鉴，互相激发。\n知识使世界互相隔绝，唯有催化使世界重新沟通。这就是知识观与催化观的重新统一。\n\n。。。\n小结一下，这就是网络观的进化历程：信息-数据-知识-催化。\n网络就像一个生命体。哦这么说还不够确切，应该说网络就是个超级生命体。那么就像所有的生命体一样，接下来网络必然也会继续进化。\n我也不知道未来的网络将会如何如何，反正这就是我自己到目前为止所能理解到的程度：——网络即催化。\n\n。。。\n现在可以回到前面绕开的那个问题了：网络如何影响了人类思维？\n透过数据与流量，透过图片与吐槽，透过争吵与合作，透过封锁与翻墙，透过色情与八卦，透过这些表面现象我们能够一步步深入到网络世界的神秘地域，在这里我所看到的就是洗礼。什么叫洗礼？和牧师或先知无关，这里说的洗礼是人类自己给自己灌顶！\n或许可以这样总结：互联网对人类是三重洗礼：第一重洗礼是超越历史。第二重洗礼是超越现实。第三重洗礼是超越数据。洗礼的效果就是人类日益实现同步协同，即超越时空障碍而事实上成为有机的共同整体。\n经过这些洗礼，我们越来越明智而不再那么幼稚，越来越宽容而不再那么偏执，越来越坦然而不再那么一惊一乍，总之能更加成熟。实际上是你想不成熟都不可能了。——这才是网络给人的真正馈赠！\n那么人类又能以什么回赠呢？或许最值得的事就是付出努力促进网络的进化。——比如说开发和运用零网就是这种很有价值的事情，之一。\n简言之，以上就是为什么我认为像零网这样的项目如此重要，如此必要，而且是如此不可避免，并且还如此不可限量。。的原因。\n\n。。。\n谨以此文祝贺零网横空出世。算是个新人见面礼吧。\n（当然不能算完，只能算暂时告一段落。祝各位吐槽愉快！）\n"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": null,
			"body": "Hallo Peers！"
		}
	]
}