{
    "issues": [
        {
            "title": "Display the sum of successful published files when publishing site",
            "body": "When publishing site, notification only shows how many peers have been published to. I guess it only means `content.json` but not other files. Like a Git Center repo there are hundreds of files. It would be better if ZeroNet can display how many files have been successfully published when publishing site, so the site owner can confirm that all files have been successfully published.",
            "date_added": 1512566719100,
            "open": 1,
            "reopened": 0,
            "tags": "enhancement,publishing",
            "id": 0
        },
        {
            "title": "Sort feeds, posts by receiving time",
            "body": "A continue to [this conversation](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h/1511980943) on ZeroMe.\n\nInstead of adding a `publish_timestamp`, I think it will be better to have a `receive_timestamp`, since the timeline issue directly affects the receiver but not the publisher. It would be nice if a zite can detect how many new posts are older then the newest post (i.e. their timestamps are smaller than the newest one), then give user the info like `from xx sites in xx.s` on ZeroHello, and give user a tab to sort posts by receiving time. Also receiver can't add data to publisher's data.json, so they need to store locally.\n\nThis feature needs the zite owners themselves to implement it to their zite, but ZeroNet may provide a plugin and an API to make the development easier. For ZeroHello I guess this feature can be added to both the Newsfeed plugin and ZeroHello itself.",
            "date_added": 1513321676600,
            "open": 1,
            "reopened": 0,
            "tags": "proposal,sorting",
            "id": 1
        }
    ],
    "next_issue_id": 2,
    "issue_comments": [
        {
            "issue_id": 0,
            "issue_json": "data/users/1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h",
            "body": "This feature may help condition like [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?15Z4H5K8YxjqGWpPxMLHWwr6Ve2nR7dz8d/0@1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): If the zite owner published the new `content.json` but failed to publish a major js file (Because the file is large or the owner shuts down his server too early after publishing the zite), then new user can't download the zite correctly since s/he receives the newest `content.json` but no one has that new js file.",
            "date_added": 1513319654400,
            "id": 0
        },
        {
            "issue_id": 1,
            "issue_json": "data/users/1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h",
            "body": "Idea: a python bot that collects new data from ZeroHello feed dbquery in `users.json` but add `int(time.time())` as `data_added` instead. I guess this kind of bot can be set up as a plugin for users, and the data further can be used for desktop notifications. Will try to implement it soon or later.",
            "date_added": 1514800972900,
            "id": 1
        },
        {
            "issue_id": 1,
            "issue_json": "data/users/1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz",
            "body": "Because your new site doesn't have any peer, content.json is still in your site folder. Quite a misleading message btw.",
            "date_added": 1516330120063,
            "id": 2
        }
    ],
    "next_issue_comment_id": 3
}