{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "А у меня:\n\n* Friendica\n* ZeroNet\n\nОстальное для почитушек мемов.\n\nКстати, может мне тоже RS поднять? Там не тухло? Троллей нет?)\nИбо иногда хочется осмысленной беседы, без подколов.",
			"post_id": 11,
			"date_added": 1495226714
		},
		{
			"comment_id": 2,
			"body": "> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): RetroShare — это f2f сеть. Глобальных каких-то точек, где можно отследить тенденции и трафик нет.\n> У меня на трёх машинах по 40+ френдов (для этой сети считается очень много — т.к. через френдов доступны данные и их френдов по цепочке), как русских, так и зарубежных. На разных машинах народ частично пересекается, частично — нет.\n> В рамках этих кругов сеть практически мертва. За сути в топовых форумах по 1-3 сообщения.\n> Чистых троллей я особо не заметил. Но там зашкаливающее количество параноиков. Каждое второе сообщение переходит в обсуждение присутствия ФСБ-шников в тредах, взаимные обвинения в работе на ФСБ, истерики «за публикации ссылок в реальный Интернете буду банить!» и т.п. :) Я за год заигнорировал (в RS есть такая возможность) около десятка таких истеричек и стало тихо. Как на кладбище :D Т.е. я не знаю сейчас, это реально сеть вымерла или там вся активность на таких держится.\n> В общем, я там присутствую, поскольку стараюсь следить за всеми популярными p2p-средствами, но реально делать мне там нечего :)\n\nУ нас есть телеграмовый чатик, но можно же его использовать как entry point и общаться в RS :)\n\nМне там в принципе тоже делать особо нечего, получается. Но если бы были интересные личности вроде тебя и обсуждались интересные темы без \"параноидальности\" - я бы там сидел.\n\n> [balancer73](#comment_4_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Вот, иллюстрация, скрины нескольких «популярных» форумов. Можно оценить активность (сортировка сообщений по дате) и тематику :)\n> \n> https://gateway.ipfs.io/ipfs/QmaDTaGL17t8PzzcKT2hHFaaKMkhF6Xq7957bBZGSQhxAu\n> https://gateway.ipfs.io/ipfs/QmbxWstokrwrCFYj4c6iUUo73A6gutToRV6oytXXXRRqya\n> https://gateway.ipfs.io/ipfs/QmbxWstokrwrCFYj4c6iUUo73A6gutToRV6oytXXXRRqya\n\nДа, я в курсе, я держал у себя ноды. Была серверная (типа на сервере, куда я всех коннектил) и на компах моих.",
			"post_id": 11,
			"date_added": 1495230420
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}