{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Como criar uma StartUp",
			"body": "Se você tem o desejo de criar seu próprio negócio e testar suas habilidades empreendedoras ou somente quer ampliar seus conhecimentos sobre essa nova temática cada vez mais em evidência no mundo dos negócios, então esse curso foi feito para você!\n\nStartups representam um novo jeito de se iniciar negócios. Atualmente, com a crescente entrada de novas tecnologias e as conexões entre pessoas e os meios digitais que não param de aumentar, surge a possibilidade de se criar negócios com base tecnológica que vem revolucionando a forma como encaramos algumas coisas, o modo como agimos, nos comportamos e criamos novas tendências.\n\n- https://www.youtube.com/playlist?list=PLFKhhNd35zq9fufoBSdorHBInIr9sHKEP",
			"added": 1546951512
		},
		{
			"topic_id": 2,
			"title": "Arquivo Nobiliárquico Brasileiro",
			"body": "O Arquivo Nobiliárquico Brasileiro (na ortografia da época: Archivo Nobiliarchico Brasileiro) é um livro editado em 1918 em Lausana (Suíça), cujos autores são os luso-brasileiros Rodolfo Smith de Vasconcelos, segundo barão de Vasconcelos, e seu filho, Jaime Smith de Vasconcelos, terceiro barão de Vasconcelos.\n\nO Arquivo Nobiliárquico Brasileiro é a publicação pioneira na divulgação completa dos títulos nobiliárquicos brasileiros. Com ilustrações heráldicas por Fernando James Junod, apresenta também os desenhos de todos os brasões concedidos no período imperial brasileiro, e que foram devidamente registrados no Cartório da Nobreza.\n\nA obra é dedicada \"a sua alteza imperial o Senhor Dom Luiz de Orléans Bragança\".\n\nDiversas outras publicações, como os anuários e revistas editados pelo Instituto Genealógico Brasileiro de São Paulo e alguns artigos escritos por Laurênio Lago para o anuário do Museu Imperial de Petrópolis, acrescentaram uma expressiva série de correções, atualizações e ampliações aos dados originais do Arquivo Nobiliárquico.\n\n- https://archive.org/download/archivonobiliarc00vascuoft/archivonobiliarc00vascuoft.pdf",
			"added": 1546977674
		},
		{
			"topic_id": 3,
			"title": "Discurso de Charlie Chaplin em \"O Grande Ditador\"",
			"body": "#Trecho do filme \"O grande ditador\" (The great dictator), 1940 de Charles Chaplin com legendas em português.\n\n- https://mega.nz/#!0wsVXabB!FIY5er-d2Yxg_t6KXO1zwE6fLU_jXU1xRjgRe7UzjXw",
			"added": 1546992137
		}
	],
	"topic_vote": {
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"1_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": 1,
		"2_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": 1,
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"2_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"2_1JWzeTyK26d4RAYsyHethugMvfKfQJQSCt": 1,
		"3_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1
	},
	"next_comment_id": 23,
	"comment": {
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 1,
				"body": "#Curso de Programação em Python\n- https://www.youtube.com/playlist?list=PLFKhhNd35zq_INvuX9YzXIbtpo_LGDzYK",
				"added": 1546951109
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 2,
				"body": "#Curso de Teologia Básica\nTeologia é um termo que corresponde à junção de duas palavras gregas: theos (Deus) e logia (estudo), ou \"estudo de Deus\". A teologia cristã é compreendida, portanto, como um estudo ou interpretação racional da fé cristã.\n\n- https://www.youtube.com/playlist?list=PLFKhhNd35zq-2phRgDH4L88E03xXo7jGL",
				"added": 1546951265
			},
			{
				"comment_id": 3,
				"body": "#Curso de Homilética (Como Pregar sem Timidez)\nHomilética se refere à \"arte de pregar\". Os estudos da Homilética estão relacionados com a pregação e apresentação das práticas religiosas:  como preparar e fazer sermões de maneira mais eficaz.\n\nA Homilética fornece os ensinamentos necessários que objetivam melhorar o comportamento que um pregador deve ter durante uma ministração. Desse modo, o pregador terá êxito em transmitir a Palavra de Deus sem interferências e mantendo a atenção de seus ouvintes no que realmente importa: Transmitir a Mensagem de Deus.\n\n- https://www.youtube.com/playlist?list=PLFKhhNd35zq8mRWE_KaX6IA4dz64T_eS4",
				"added": 1546951394
			}
		],
		"1_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": [
			{
				"comment_id": 4,
				"body": "#Curso de Introdução à Psicologia Online Grátis\nA Psicologia é a ciência que estuda o comportamento humano, as interações dos organismos com o seu ambiente. Dependendo do enfoque e conhecimento de humano que está sendo utilizado, a psicologia pode ter vários conceitos, sendo um deles a de ciência que estuda os seres humanos e seus processos psíquicos.\n\nCom este curso grátis, o aluno aprenderá a diferenciar o senso comum da \"psicologia popular\" do conhecimento da psicologia enquanto ciência, conhecerá diversas vertentes psicológicas e terapêuticas, o modo de atuação de um psicólogo, entre outros conhecimentos fundamentais da área.\n- https://www.primecursos.com.br/introducao-a-psicologia/",
				"added": 1546951973
			}
		],
		"1_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": [
			{
				"comment_id": 5,
				"body": "#Curso de Bitcoin Online Grátis\nA revolução já começou! Descubra com este curso online grátis como milhares de brasileiros movimentam mais de R$25 milhões de reais todos os dias, apenas comprando e vendendo criptomoedas como o BITCOIN – BTC. Em 2017, por exemplo, o Bitcoin valorizou 1000%, em apenas 12 meses.\n\n\n- https://www.primecursos.com.br/bitcoin/",
				"added": 1546952060
			}
		],
		"2_1FDGXTS5vrbUJj81LwFmAG8o4MnJjaHwuC": [
			{
				"comment_id": 6,
				"body": "#Com esta técnica é mais fácil ficar concentrado e estudar inglês sozinho\n\n- https://exame.abril.com.br/carreira/com-esta-tecnica-e-mais-facil-ficar-concentrado-e-estudar-ingles-sozinho/",
				"added": 1546952340
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 7,
				"body": "#As atividades intelectuais, como ler, jogar jogos de tabuleiro, tocar instrumentos musicais e socializar regularmente estão associadas a uma diminuição do risco de Alzheimer em estudos epidemiológicos, embora não se tenha ainda descoberto uma relação causa-efeito.",
				"added": 1546965031
			},
			{
				"comment_id": 8,
				"body": "#Dimebolina\nA dimebolina é uma substância, criada originalmente na Rússia, como um antialérgico para tratar a rinite alérgica provocada pela febre dos fenos, mas que também tem efeito sob o cérebro, despertando o estado de atenção.\n\nAlém disso, atualmente, a substância está sendo estudada por sua capacidade em melhorar a função cognitiva e proteger os neurônios, podendo tornar-se num medicamento capaz de tratar doenças neurodegenerativas, como o Alzheimer.\n\n#Preço\nA demobolina já não está sendo produzida como anti-histamínico, no entanto, pode ser conhecida em alguns países como Dimebon, Dimebonum ou Cloridrato de Dimebolina.\n\n#Para que serve\nEste medicamento foi produzido para tratar a rinite alérgica e febre dos fenos, no entanto, poderá ser utilizado no tratamento do Alzheimer e outras doenças neurodegenerativas como a doença de doença de Huntington.\n\n#Como usar\nUma vez que este remédio já não é utilizado como anti-histamínico, não são conhecidas as doses recomendadas, até que os estudos com a substância estejam terminados.\n\n#Possíveis efeitos colaterais\nOs efeitos secundários que podem surgir com o uso da dimebolina incluem dor no peito, boca seca, insônia e depressão.\n\n#Quem não deve tomar\nEste medicamento não deve ser utilizado sem indicação médica, especialmente porque se encontra em fase de testes.\n\n- Fonte: Tua Saúde",
				"added": 1546966111
			},
			{
				"comment_id": 9,
				"body": "#Células de apoio do sistema nervoso ajudam a entender o Alzheimer\nEfeito do envelhecimento na micróglia, célula do sistema nervoso central, pode elucidar evolução de doenças degenerativas\n- https://sci-hub.tw/10.1038/nn.4597",
				"added": 1546966319
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 10,
				"body": "#Rust Creek\nUma universitária se perde a caminho de uma entrevista de emprego. Uma curva errada a deixa encalhada na floresta de Kentucky. A mulher deve se defender contra os elementos duros e um bando de bandidos impiedosos. Ela é forçada a uma aliança desconfortável com um estranho solitário que tem intenções desconhecidas.\n\n- http://thevid.tv/v/4ezx2133fqkj1/",
				"added": 1546978498
			},
			{
				"comment_id": 12,
				"body": "#A-X-L\n\nDesenvolvido exclusivamente pelo governo para fins secretos, A.X.L é um cão robótico dotado de extrema rapidez e força acima da média. Porém, quando ele conhece o jovem Miles, surge um inesperado sentimento recíproco de amor e carinho que faz com o robô faça qualquer coisa para proteger seu novo dono, que agora se torna foragido por roubar um protótipo governamental.\n\n\n- https://oload.stream/embed/uc2rljkCr_Q/",
				"added": 1546980602
			},
			{
				"comment_id": 15,
				"body": "#RÉPLICAS\nDepois de um grave acidente de trânsito que matou toda a sua família, um neurocientista (Keanu Reeves) sente que perdeu o sentido da vida. Utilizando seu meio de trabalho, ele se torna obcecado em trazê-los de volta, mesmo que isso signifique desafiar boa parte do governo e, principalmente, as leis da física.\n\n- https://oload.stream/embed/Gl6mao5UocU/",
				"added": 1546990597
			},
			{
				"comment_id": 16,
				"body": "#CÓDIGO ALIEN\nAlex Jacobs (Kyle Gallner) é um excelente hacker e criptógrafo que decide, por conta própria, decifrar uma mensagem misteriosa encontrada repentinamente em um satélite. Quando ele percebe que aquilo esconde segredos muito além de seu alcance, precisa usar suas habilidades para escapar dos agentes do governo e dos seres do outro mundo que iniciam uma perseguição contra ele.\n- https://ok.ru/video/1109804976854",
				"added": 1546990722
			},
			{
				"comment_id": 17,
				"body": "#O GRANDE DITADOR\nAdenoid Hynkel (Charles Chaplin) assume o governo de Tomainia. Ele acredita em uma nação puramente ariana e passa a discriminar os judeus locais. Esta situação é desconhecida por um barbeiro judeu (Charles Chaplin), que está hospitalizado devido à participação em uma batalha na 1ª Guerra Mundial. Ele recebe alta, mesmo sofrendo de amnésia sobre o que aconteceu na guerra. Por ser judeu, passa a ser perseguido e precisa viver no gueto. Lá conhece a lavadora Hannah (Paulette Goddard), por quem se apaixona. A vida dos judeus é monitorizada pela guarda de Hynkel, que tem planos de dominar o mundo. Seu próximo passo é invadir Osterlich, um país vizinho, e para tanto negocia um acordo com Benzino Napaloni (Jack Oakie), ditador da Bacteria.\n\n- https://youtu.be/4VuSNCFGtos",
				"added": 1546991294
			},
			{
				"comment_id": 20,
				"body": "#O DOUTRINADOR\nUm vigilante mascarado surge para atacar a impunidade que permite que políticos e donos de empreiteiras enriqueçam às custas da miséria e do trabalho da população brasileira. A história do homem por trás do disfarce de \"Doutrinador\" envolve uma jornada pessoal de vingança na qual um agente traumatizado decide fazer justiça com as próprias mãos.\n- http://servidor.megaseriehd.com/filmes/odoutrinador/dub/01.mp4",
				"added": 1546999201
			},
			{
				"comment_id": 21,
				"body": "#A Arte da Guerra por Sun Tzu- Documentário completo Dublado[HD]\nEscrito no séc. IV a.C., há cerca de 2.500 anos, por Sun Tzu, um general e estratega chinês, o livro \"Arte da Guerra\" continua ainda hoje a ser admirado como fonte de ensinamentos na área da estratégia. De facto, muitos consideram \"A Arte da Guerra\" como a origem do próprio conceito de estratégia. Apesar de ser um tratado puramente militar, os conselhos e ensinamentos de Sun Tzu são perfeitamente adaptáveis ao mundo das empresas e dos negócios; basta para isso olhar para a concorrência como o inimigo e para o mercado como o campo de batalha.\n-\n\"A Arte da Guerra\", é uma famosa obra militar da antiguidade chinesa. O pensamento e doutrinas filosóficas expostas na obra foram e ainda são aplicados amplamente nas áreas militar, política, econômica e até na vida pessoal. É também, um rico pensamento materialista, mostra a mudança de contradições entre inimigos ou adversários, entre partes objetivas e subjetivas da realidade. Nesta obra se constata também, que na antiguidade já se tinha a noção clara de que nossa realidade está sempre em movimento!\n\n- https://youtu.be/K6myCDrsx9w",
				"added": 1547009827
			},
			{
				"comment_id": 22,
				"body": "#Deus da Guerra\nDurante o século 16, os piratas japoneses proliferam ao longo da costa chinesa. Em 1557, os piratas assumem Cengang em Zhejiang. Após meses de avanços fúteis, o Comandante Yu (Sammo Hung) finalmente os derrota sob a liderança do recém-promovido General Qi (Vincent Zhao). Os piratas, no entanto, conseguem escapar. Em 1561, os piratas se reagrupam e mais uma vez atacam as cidades costeiras da China. Com as duas cidades de Xinhe e Taizhou sob ataque, o exército de Qi é apanhado entre dois fogos. Embora a maioria dos membros da família de seus soldados estejam localizados em Xinhe, Qi toma a difícil decisão de ir a Taizhou e deixa sua esposa encarregada da luta contra os piratas em Xinhe, sabendo que a derrota da equipe de elite dos piratas em Taizhou irá trazer uma paz duradoura para as cidades costeiras.\n\n- https://youtu.be/yhYc-YIdLsw",
				"added": 1547009914
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 11,
				"body": "#Hacking\n\n- https://mega.nz/#F!dAlUEQBK!_HGxA1oX7cHpx9l-neiGBg\n- https://mega.nz/#F!9AFEDR6A!q30cEDqDirt2r1iY2PwpcQ\n- https://mega.nz/#F!AUUSCCBS!0qNgT5vU_JlPNOBBOP-Gkg",
				"added": 1546979469
			},
			{
				"comment_id": 14,
				"body": "#Just Delete Me\n\nMuitas empresas usam técnicas de padrões escuros para dificultar a localização de como excluir sua conta. JustDelete.me pretende ser um diretório de URLs para permitir que você exclua facilmente sua conta de serviços da web.\n\n- https://backgroundchecks.org/justdeleteme/",
				"added": 1546983008
			}
		],
		"2_1JWzeTyK26d4RAYsyHethugMvfKfQJQSCt": [
			{
				"comment_id": 13,
				"body": "#Line-X\nO Line-X é um produto criado pela empresa de mesmo nome, sediada nos Estados Unidos, para inicialmente ser usado na caçamba de picapes, mas a resistência que o produto tem acabou dando a ideia para a empresa de usá-lo para outras aplicações.\n\n#O canal do YouTube How Ridiculous publicou vários vídeos com demonstrações de quão forte é o produto: \n- https://youtu.be/RLpsIuhTb8k\n\n\n#Nesse outro vídeo, os caras jogaram um ovo de uma grande altura e… \n- https://youtu.be/OeCH7czRPz8\n\n#Do que o Line-X é feito?\nA primeira versão do Line-X surgiu no mercado em 1988 e, até por um questão de segredo industrial, ninguém (além deles) sabia do que era composto o produto. O segredo só foi revelado em dezembro de 2016, quando o canal Veritasium conseguiu descobrir a fórmula do bagulho (o vídeo abaixo está em inglês, mas tem legenda em português):\n- https://youtu.be/DWkYRh6OXy8\n\n#Resumindo bem a explicação, o Line-X é composto de duas moléculas principais: o Difenilmetano-4,4-diisocianato e a Alpha-(2-aminometiletil)-omega-(2-aminometiletoxi)-poli(oxi(metil-1,2-etanodiilo)). As duas moléculas, quando misturadas, geram calor e são espalhadas em finas camadas sobre a superfície a ser preservada.\n\n#A empresa afirma que seu produto é usado até nas paredes do Pentágono, para tornar o local a prova de bombas!\n\n- Fonte: E-farsas.com",
				"added": 1546982294
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 18,
				"body": "#Dicionário de Política - Norberto Bobbio, Nicola Matteuci, Gianfranco Pasquino\nEste \"Dicionário de Política' oferece uma explicação e uma interpretação simples e possivelmente exaustiva dos principais conceitos que fazem parte do universo do discurso político, expondo sua evolução histórica, analisando sua utilização atual e fazendo referência aos conceitos. Sua consulta se dá através de verbetes, ordenados alfabeticamente e esquematizados de modo a informar, conceituar e debater os principais aspectos de cada problema versado.\n\n- https://mega.nz/#!ht1T0Q5A!vVmdScClcU8_-IO_gJf52cq-OXDrrXhIPk5yV8QuBdM",
				"added": 1546992935
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 19,
				"body": "#Algoritmo de Heap\nO algoritmo Heap gera todas as permutações possíveis de N objetos. Foi proposto pela primeira vez por B. R. Heap em 1963. O algoritmo minimiza os movimentos para gerar as próximas permutações. O algoritmo gera cada permutação a partir da permutação anterior, trocando um único par de elementos. Os outros elementos N−2 não são alterados. Em uma revisão de 1977 sobre algoritmos de gerar permutações de objetos, Robert Sedgewick concluiu que era o algoritmo o mais eficaz para gerar permutações pelo computador até então.\n\n- https://sci-hub.tw/10.1093/comjnl/6.3.293",
				"added": 1546996461
			}
		]
	},
	"comment_vote": {
		"12_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"13_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1,
		"20_1JUGGDPssVH7pfDnzBmiuNXmevWCJDepTs": 1
	}
}