{
	"next_post_id": 7,
	"next_comment_id": 4,
	"next_follow_id": 1,
	"avatar": "jpg",
	"user_name": "Igoek",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "RU",
	"post": [
		{
			"post_id": 1,
			"date_added": 1521085981,
			"body": "Hello ZeroMe! А так же - Привет всем! "
		},
		{
			"post_id": 1521086673,
			"body": "Если честно - я заглянул сюда совершенно случайно... из простого любопытства. Но раз уж заглянул - ладно",
			"date_added": 1521086671
		},
		{
			"post_id": 1521365816,
			"body": "То,  что сейчас развиваются распределенные социальные сети, далеко не случайность. И дело тут даже не в тотальном контроле над интернетом,  который стремится получить правительство любой страны. Это скорее интуитивное отрицание того,  что нам всем пытаются навязывать. \nКроме того есть и другие причины. Среди которых есть и такая: люди (все! без исключений) не любят вещи,  на которые нельзя оказать влияние. А в большинстве случаев в обычном интернете человек вынужден подчиняться чужим правилам. Которые сейчас устанавливают слишком узкие рамки.",
			"date_added": 1521365813
		},
		{
			"post_id": 1521450001,
			"body": "Объясню, если конечно этого кто-то не понял: Путина выбрали не из-за иррациональной любви русского народа к Хозяину, Царю или Рабовладельцу... выбрали стабильность. Которой России никогда не хватало. И сейчас-то она под сомнением.",
			"date_added": 1521449997
		},
		{
			"post_id": 1532879890,
			"body": "В том, что сейчас происходит, виноват каждый! Подчеркну - КАЖДЫЙ! - живущий в нашей стране. Но обвинять ребенка, в том, что он не смог противостоять взрослому - бред! Сейчас в интернете очень часто обыгрывается идея о том, что в существующем порядке вещей виноваты сами жители страны... типа - вы сами это всё себе выбрали! Это конечно замечательная манипуляция! Выбираем мы то, что нам дают выбирать. Но по сути выбора нет. Если конечно не понять, что суть отношений между людьми - договор! Иногда негласный, когда каждая сторона понимает свою ответственность! Но в большинстве случаев он должен быть оформлен. В закон. Или Конституцию. В свод правил которые не может нарушить никто! НИКТО!",
			"date_added": 1532879885
		},
		{
			"post_id": 1533047092,
			"body": "Очень странно, что люди... здравомыслящие и изобретательные в других условиях, никак не могут понять, что проблема вовсе не в так называемом \"социальном\" строе... капитализме, социализме, да хоть фашизме... проблема исключительно в нас самих. А точнее - в отсутствии механизмов взаимодействия между нами. Они есть. Где-то государственные, где-то негласно оговоренные - типа \"лежачего не бьют\", но нет таких, когда кто-то может обратиться ко всем. И его услышат. Или не станут слушать. Но сейчас таких механизмов нет. Частично роль их исполняют соцсети, но там человек всяко не хозяин",
			"date_added": 1533047086
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Просто можно что-то писать. И посмотреть что пишут другие",
			"post_uri": "19ruuGUrgaNrpz1fhsY7ommKdFyuet6kH1_1520768778",
			"date_added": 1521366025
		},
		{
			"comment_id": 2,
			"body": "@Lianmeng8900: Привет!  Всем рады!  Добро пожаловать! ",
			"post_uri": "1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL_1521086673",
			"date_added": 1521450064
		},
		{
			"comment_id": 3,
			"body": "@ZAlex: Спасибо. Уже и подзабыл данный документ. А ведь как все прекрасно в нем звучит. Впрочем распределенные сети потихоньку делают его идеи реальностью. :)",
			"post_uri": "1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL_1521365816",
			"date_added": 1521450282
		}
	],
	"follow": []
}