{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 1,
				"body": "Really disappointed with I2P. I want to like it - but it's so slow. Zeronet is very fast most of the time.\n\nAs far as I'm concerned, ZeroNet is the calvary I2P hasn't found yet. Once ZeroNet operates over I2P - then we'll have a reason to run I2P. Currently, ZeroNet only operates over Tor.",
				"added": 1607222071
			}
		],
		"1606980382_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 2,
				"body": "> [sj29msn5kz0ldmn](#comment_18_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): I'm glad some peopel also see this. I think we should stop tolerating normies using privacy services on malware systems, including stock Android and iOs. It is an effort that MUST be made, otherwise your OS compromises everything upstream. [...]\n\nI'm tired of virtue signalling. It utterly demolishes the value of any critique. First thing which pops into the reader's mind? Buzz off!\n\nIn the middle ages, such people would find their heads on pikes.",
				"added": 1607222460
			}
		],
		"1606099517_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 3,
				"body": "Always a disaster coming - then it never happens. Next real disaster? NO ONE will be prepared for it......",
				"added": 1607222626
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 4,
				"body": "If you had lung or colon cancer - you wouldn't talk like this. Just fact.\n\nMaybe you should go live near bears? A few close encounters would be all it takes for your reset.",
				"added": 1607222774
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 5,
				"body": "How about instead I just decapitate you then use your head as a hood ornament? Pompous ass.",
				"added": 1607222933
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 6,
				"body": "I would not. Unless the replacement executed on superior performance and offered significant compatibility with the old system. That's a pretty hard moat. Most who attempt things like this fail. There are advantages and disadvantages to having a single developer. For what it is worth, perceived code quality is a function of speed. I will tolerate slow BitTorrent performance - IF the GUI remains responsive.",
				"added": 1608007174
			}
		],
		"1608156151_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 7,
				"body": "\"Eighteen\" was generally a limit only because it encouraged young people to get out and start their own families. Not waste time. Female biology is a rather hard limit, and no amount of wokeism will change the fact that childbearing generally occurs between 16 and 30 - or not at all. Much of this changed when entry level jobs started getting snapped up by foreign nationals. It seriously damaged the employment ladder for natives. At one time, a young man could still support his wife and children without exotic \"training\".  The work was easily available...one bettered themselves only in an attempt to tackle more complex and better paid work. Not sure if any of these wonderful plans actually worked. It seems that \"training\" just devolved into parking people until something could be found for them. Meanwhile, those with ability never seemed to benefit from \"training\" - they educated themselves.",
				"added": 1608159392
			}
		],
		"1607948770_19rSc8YfLc5CKq528uKnDuerT2PZoKiegm": [
			{
				"comment_id": 8,
				"body": "> [notanonymous](#comment_3_19rSc8YfLc5CKq528uKnDuerT2PZoKiegm): https://www.nytimes.com/2020/12/13/us/politics/russian-hackers-us-government-treasury-commerce.html\n\nNYT has cried wolf so many times.....It's hard to take them seriously any more.",
				"added": 1608159657
			}
		],
		"1607868478_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 9,
				"body": "Not a scam, but overhyped. And the damage this lying has accomplished is everywhere to see. Had they not lied so much, many would have taken precautions. That's gone now - covid has become yet another political litmus test. Tragic.",
				"added": 1608159869
			},
			{
				"comment_id": 12,
				"body": "Both. It's overhyped by the media based upon what THEY saw. And those claiming it's a hoax are also basing their opinion on witnessed events (empty ICUS). 'Both of them telling the truth\" is likely the reality. And it's why this issue is such a mess.",
				"added": 1608687265
			}
		],
		"1608641364_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 10,
				"body": "Well, while I sympathize, it's shop owners like this one which are the real problem. \"Someone should do something!\"\n\nIt doesn't work that way. Nothing changes until someone dies....Has always been that way.\n\nUntil some shop owner Popeyes and starts killing indifferent civic officials - all will continue as now. Only death will counter such inertia...and make no mistake - the perp WILL be caught and punished should they fail to bow out on their own. Their own shop would derive no benefit, but their actions may indeed save others.\n\nBest outcome she could hope for? A grandfather with cancer not adverse to a suicide vest. Even better if he's still strong enough to decapitate them and mount their skulls on pikes. Media loves that shit.\n\nWhen niggers looted, they could have been stopped instantly - by a single perp generating piles of bodies. But no one acted.\n\nThis is exactly what was in play: https://exploringyourmind.com/kitty-genovese-girl-screamed-nobody-helped/\n\nCalifornians, your leaders don't fear you. And they are right.",
				"added": 1608686591
			}
		],
		"1608384028_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 11,
				"body": "Meh...you hear all this stuff and it just seems unbelievable. But in today's world, you can ruin anyone with media - truth not needed.\n\nNow if you want to make an argument for killing him based upon capricious rulings by an un-elected bureaucrat , I'm all ears. The supreme court never should have had the power it usurped from us.",
				"added": 1608687103
			}
		],
		"1608250382_1vHZxSPDWPsY1FxSNrccx845qs4AoNtq2": [
			{
				"comment_id": 13,
				"body": "Government will have it's hand in your pocket to pay for it's mistakes.",
				"added": 1608687346
			}
		],
		"1608237249_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 14,
				"body": "Their rascals are no better or worse than ours. Best fix? Take away their credit card. Force them to like off taxes.\n\nThen we can call for decimations. https://en.wikipedia.org/wiki/Decimation_(Roman_army)",
				"added": 1608687568
			}
		]
	},
	"comment_vote": {}
}