{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1509355895,
			"title": "Is opening port 15441 really optional for creating new sites on ZeroNet?",
			"body": "I'm having trouble publish my newly-created site so that others could visit it. When I click sign & publish it says \"Your network connection is restricted. Please open 15441 port on your router to make your site accessible for everyone\". But in the FAQ https://zeronet.readthedocs.io/en/latest/faq/ it says opening new port is optional. I'm using company network and I don't have access to the router configuration. What should I do now?",
			"added": 1509355894
		},
		{
			"topic_id": 1521084010,
			"title": "From the public, for the public",
			"body": "The public is vulnerable. The power of people is often mentioned and praised by the media and governments, or a small bunch of people in power. But the public that is made of all ordinary people is quite vulnerable when it comes to protect their values and beliefs. The public is easily manipulated and deceived and exploited by certain individuals who acquired their ability to do so via various ways. How they gain the ability is not important. What they would do with the ability is important. With this ability, they can decide upon what to show to the public and even what's good for the public. As a result, what the public believe is not what they learn through self-reasoning but what those individuals want you to believe. The limitation of geographical and language barriers, the imbalance of development of different regions, and the latency of information transmission further increase the vulnerability of the public.",
			"added": 1521084007
		},
		{
			"topic_id": 1521085384,
			"title": "The specialties scheme",
			"body": "Modern public education is responsible for creating all kinds of specialists. Priviledged private schools care more about cultivating leaders, or well-rounded people.",
			"added": 1521085380
		}
	],
	"topic_vote": {
		"1511777019_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1509342996_1CT7RxDQNPEE8X78bDkUPhuaaUUixTmDhC": [
			{
				"comment_id": 1,
				"body": "There's no absolute security, neither there is easy access to your files.",
				"added": 1509345156
			}
		],
		"1509163683_1AjaDfZzV84HSzPaTfR8dqUGF3XFRDLKqf": [
			{
				"comment_id": 2,
				"body": "google",
				"added": 1509356959
			}
		],
		"1509180149_12a6CEoGaQn9rHsDaYDwRxfZbAXiMoKpiS": [
			{
				"comment_id": 3,
				"body": "Their system doesn't seem to recognize the difference between Japanese and Chinese LOL",
				"added": 1509357290
			},
			{
				"comment_id": 4,
				"body": "> [newuse2](#comment_6_1E9tjqq7mFdKVPrFW1MA3kn3ovQXoytrW5): 你为什么不讲中文，在中文版块里。\n\n这不是中文版块啦！这是因为太多中国人在英文版块发帖人家无奈把所有中文帖子集中在一起罢了",
				"added": 1509410676
			}
		],
		"1509939880_1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib": [
			{
				"comment_id": 5,
				"body": "Looks awesome",
				"added": 1509951659
			}
		],
		"1_1F8VgytUggkP8kkieK8GcEMVsJTwcoAqdk": [
			{
				"comment_id": 6,
				"body": "> [lava](#comment_5_1KyNzrBTMpi7LSmsrjnKS6mf15jRuFFN4H): 遵守个屁的秩序好不容易中文占了主导地位还要拱手让给英语 [...]\n\n傻逼滚粗",
				"added": 1509951788
			}
		],
		"1511777019_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 7,
				"body": "As my favorite director Akira Kurosawa addressed in his autobiography, human beings are unable to be honest with themselves about themselves. They cannot talk about themselves without embellishing...Egoism is a sin the human being carries with him from birth; it is the most difficult to redeem.",
				"added": 1512026045
			}
		],
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 8,
				"body": "> [gitcenter](#comment_42_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Any ideas what features to add to Git Center?\nPrivate repo?",
				"added": 1512031387
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_43_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You can create a repository (which means create a new zite, in fact) and don't add it to repository index. Then it will be somewhat private.\n\nWhen I click \"sign and publish\" it prompts \"content publish failed\". Is it due to the port 15441 closing? I can't manage to open that port tho.",
				"added": 1512034134
			}
		],
		"1512192761_18maKFGFJJ2ooN3hpHybCrDfNautXMva94": [
			{
				"comment_id": 10,
				"body": "自由不代表没有合作没有契约精神",
				"added": 1512220437
			}
		],
		"1521057855_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 11,
				"body": "> [koolkidkristi](#comment_9_12rGah2WFY4XFcASwmT9THLBVB7gWakhKr): I think you're a fool. Most big people in Hollywood are jewish. Most rich men are jewish. 2 of the biggest tech companies are jew-owned (Google and Facebook) while the rest have big jewish investment into them. [...]\n\nWill you harm or even kill people that are merely different from you?",
				"added": 1521078050
			},
			{
				"comment_id": 12,
				"body": "The collective craziness of Nazis is the stupidity of humanity on its top and more horrifying than my despising for Jews and Muslims",
				"added": 1521078281
			},
			{
				"comment_id": 16,
				"body": "> [koolkidkristi](#comment_10_12rGah2WFY4XFcASwmT9THLBVB7gWakhKr): No, I would never harm another human being and I am not a nazi. Literally not. I said it before and I'll repeat it I'm an anarchist, mentioning the JQ doesn't make you a \"nazi\".Go on and scream \"muh holocaust\". Here's the thing, the Jews literally did walks of death on palestinian, very akin to a genocide, the USSR was mostly jewish and they did other atrocities. [...]\n\nFunny how an anarchist would advocate Nazis or white supremacy",
				"added": 1521085650
			}
		],
		"1521007152_1Cz286mxKa8Ujy6nj222YKegBkz1Aqo4ks": [
			{
				"comment_id": 13,
				"body": "> [zx1](#comment_5_18WAgYv5L8raYwvt6KQ9zNqFqn9WU4Uab1): I'll just leave this here: http://milesmathis.com/hawk3.pdf\n\nWow! Never thought of that",
				"added": 1521080121
			}
		],
		"1521084010_1ALwbRLVTnHkqz8mCtWrHV1AsZLFkRhJj2": [
			{
				"comment_id": 14,
				"body": "> [koolkidkristi](#comment_11_12rGah2WFY4XFcASwmT9THLBVB7gWakhKr): Yes, propaganda 101?\n\nI think distributed systems like ZeroNet are good for the public to assume their power",
				"added": 1521084360
			},
			{
				"comment_id": 15,
				"body": "> [sylvaine](#comment_24_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG): Question everything.\n\nQuestion everything and make changes!",
				"added": 1521084525
			}
		],
		"1521317297_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 17,
				"body": "It'll be back. Don't worry",
				"added": 1521362640
			}
		],
		"1519050328_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 18,
				"body": "I love money and I'm also attracted to social problems. Social business would be the answer.",
				"added": 1521434025
			}
		],
		"1523974219_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 19,
				"body": "What war?",
				"added": 1524115611
			},
			{
				"comment_id": 20,
				"body": "My life goal is to live as long as I can. I enjoy the pains. They make me feel alive.",
				"added": 1524115707
			}
		],
		"1524092471_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 21,
				"body": "Earth's not for you. Go to Mars.",
				"added": 1524119245
			}
		],
		"1524102661_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 22,
				"body": "LOL. It takes efforts also to be able to swallow the cum of wealthy and powerful people :P",
				"added": 1524119731
			}
		],
		"1549024756_1L4yxgH1aSH8S6qG4QsoV4xpSDDNssQSz1": [
			{
				"comment_id": 23,
				"body": "为什么突然开放了？估计是暂时的吧",
				"added": 1549770103
			}
		]
	},
	"comment_vote": {
		"1_1ALwbRLVTnHkqz8mCtWrHV1AsZLFkRhJj2": 1,
		"5_1FKrCcxyhZGUxUyj4Lkmrdrwv3uTo2C8NY": 1,
		"3_1DF8dFxXTxMjyZ9o96iPENud3ihbS95Jwb": 1,
		"5_18WAgYv5L8raYwvt6KQ9zNqFqn9WU4Uab1": 1,
		"16_12rGah2WFY4XFcASwmT9THLBVB7gWakhKr": 1,
		"91_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"92_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"601_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}