{
	"next_comment_id": 28,
	"user_name": "Colkurtz",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"1KuDGEjMTnPAsY8acpt1RJstj4nGRsQRon_1": 1534787450,
		"1ckeEeNeDPsArshxh2jqBBs9anJVMCUKa_1534761529": 1534787458,
		"13xvwop35LYAZ57MCqE22VzPyG2U9xUBJU_1": 1534787465,
		"12YKCCaa2hLhY53dWuQfmRorTxoApP1But_1": 1534787585,
		"1Nf12SgTLzgqpJvtZRCTQsQrR3tbZFdFBC_1": 1534787589,
		"1EZLJJFzxB4xwLyvCQqiZKepLoCpYRHfgW_1": 1534787778,
		"1N2i2eBirqJ4uiStENseKEvowYUeg4yRMH_1534778758": 1534787786,
		"1G1UAySQp12uxffAx7Tad9BDpVGfVjZuDU_1": 1534787789,
		"1G1UAySQp12uxffAx7Tad9BDpVGfVjZuDU_1534780441": 1534787794,
		"1B8YyWGr5URe9ikpJLJHHiCxm5HbHahUyn_1": 1534792815,
		"1oixa3V2rPpPkTxp9YXUyw1zdfpqWCmnV_1534824723": 1534825093,
		"1oixa3V2rPpPkTxp9YXUyw1zdfpqWCmnV_1": 1534825098,
		"1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534821795": 1534825686,
		"1FSkuHpgoJPnSdG3QE61UL1ewMroGYXoMa_1": 1534862523,
		"16Ns7mufSQKhDDRbk68bAcuJUZPbjuMdEW_1534890388": 1534890443,
		"13chSJ2wFjTEPXPLTUUZmGcVJit248Rtmr_1": 1534890501,
		"16Ns7mufSQKhDDRbk68bAcuJUZPbjuMdEW_1534890133": 1534908528,
		"15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC_1": 1534917575,
		"17tv6cDBWzih1yT5Bk2mS6yaykDGgySmux_1": 1534917579,
		"1KJYcTbybVkkhW29VsFxpLtSiK788ZnSTQ_1534916225": 1534917604,
		"1JSdfXPZTCqy51Dnq87V28mwf82yNmbQJs_1": 1534974499,
		"18W4DdMStWFK5JKWrW4jwhPpv59rmr4K71_1534973687": 1534974518,
		"18W4DdMStWFK5JKWrW4jwhPpv59rmr4K71_1": 1534974525,
		"13gtdMHzJES8YUrycwPuEMC6WEN3GdT3LY_1": 1534974532,
		"1zsJv9enraYHekB8HAYN5nBhjdrTsNwWV_1": 1534974543,
		"1CebQhBfoZsRhjz42pyeXwkMmt4aKWvStn_1534965604": 1534974547,
		"1CebQhBfoZsRhjz42pyeXwkMmt4aKWvStn_1": 1534974557,
		"1BGGYzMjTbTxgDHJ9qwLw1yc65c2qVGY7h_1": 1534974563,
		"1P6cEvA3RLuk9FGyNY9kCb9C8L231jVhiK_1536104179": 1536111768,
		"18sV4LF2Q372BLkTJN5Z24HeRexQQscx1E_1538103449": 1538104991,
		"1PVCxD6ihJg875sa3zD6EGHEm47vaddqCa_1": 1538161608,
		"1QJEo91JN3xz3nNLickrJ53jFpm7VCkyBV_1": 1538178346,
		"1P4mZFiz4eZW5wdk8ZB4Gu7NUt1FxjBKi9_1": 1538841658,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1538840372": 1538841695,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1538840061": 1538841765,
		"15tfsoyZs7AhKaQSALNe62bxXKuVqeJeM8_1": 1538841775,
		"1KkhiEGYWv22hZJKdyRbHxGypQGJkV7Rdi_1": 1538841978,
		"1AtZRXEYqPxrprXiSK9Ncd4cSfFACFZWvL_1538832871": 1538842125,
		"15vZNE3XBi69v3dkvNX4UJJZj282qG4mqM_1": 1538842145,
		"19MZEGAbUJjbtUkFkAJSa6R7TaHfHNGNj6_1539315166": 1539315500,
		"1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb_1": 1539316143,
		"1LsqG3TqWy5A7XnAnj3BXof9hUPrNxr1LK_1": 1539316156,
		"1Jb9DbvpDn7xsoKLpYvRCD3MtnJRgSoMif_1": 1539316162,
		"1PKQjBW65jtHKYs1NDrrVNu9c998TusQ8s_1539321728": 1539322508,
		"1JGLcd9SrxuxdEYR2AGTVR6MeyVw8qQt9L_1539424412": 1539448825,
		"1J6KVggXYkb9e4KEfJWc8PPUbskiSbAT5a_1": 1539463388,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1540051503": 1540059300,
		"13Ngg51qh6JHnDqmpioGZJGAZM8b3FqnRy_1": 1540325290,
		"1PEmQpDssNoeuRYpHuLbXJ7WubepG6DSTa_1542294447": 1542313593,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1546115566": 1546115730,
		"1G5aYYLCYtwKYfnnvLUTNVDC5kmy8RP7D7_1562119963": 1562125287,
		"1G5aYYLCYtwKYfnnvLUTNVDC5kmy8RP7D7_1562167642": 1562170761,
		"1G5aYYLCYtwKYfnnvLUTNVDC5kmy8RP7D7_1562125409": 1562171094,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1565606619": 1565631090
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "They aren't used to it, yet. They only know fear and  how to be slaves and bitches, for the man..😈",
			"post_uri": "1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534823099",
			"date_added": 1534825634
		},
		{
			"comment_id": 2,
			"body": "@Vaerospace: Yep, I get it..😊  http://127.0.0.1:43110/17furiATmeLQDVcfUZYhTUiRzLK5s3SvJL/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1AXWniok4qHQTGgP9szgQuQfXe9VxZXLwi/1534825972 ",
			"post_uri": "1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534823099",
			"date_added": 1534830725
		},
		{
			"comment_id": 3,
			"body": "@Vaerospace: If I understand how zeronet works correctly it's very much like #Bitcoin, and all the other social media systems are basically now altcoins of Zeronet. What truly distinguishes Bitcoin from others is It's high level of decentralisation and censorship resistance. Politics doesn't matter, greed doesn't matter, cleverness doesn't matter. Except as it serves the best interest of Bitcoin. Whose sole interest is the safety, security and value of the owners and users of Bitcoin. Likewise zeronet doesn't care about your politics, your greed or your cleverness. All zeronet cares about is protecting the value (free speech) of the owners and users of zeronet. Bitcoin adoption is still relatively small, though it's market cap is around a hundred billion!!! Zeronet is doing the same thing. Both #Zeronet and Bitcoin are something truly new. It will take awhile before others truly catch on. But they will. In the meantime both will continue to grow and improve the user experience and value..👍😀",
			"post_uri": "1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534823099",
			"date_added": 1534877364
		},
		{
			"comment_id": 4,
			"body": "I've been trying to test and aggressively use the Android app in single user and multiuser modes. At first I had a lot of problems with SD corruption leading to boot loops. This usually required wiping my SD, formatting and re-partitioning my SD card. Pretty simple process with a custom recovery like TWRP.  It turned out that the big problem with drive corruption seems to be not exiting zeronet gracefully. But I found a way to exit gracefully in both single user and multiuser modes. In both single and multiuser modes you can use the normal  exit on the ZeroHello page. If you can't see the normal exit with your Android browser temporarily switch your browser to desktop mode. Then you will be able to see the normal exit. In multi user mode you can only exit with the account or identity you established in single user mode. Now I can exit zeronet gracefully in both modes. As a result zeronet app has been very smooth and stable, without corruption..👍😀",
			"post_uri": "1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534930318",
			"date_added": 1534958122
		},
		{
			"comment_id": 5,
			"body": "@Vaerospace: the information is for anyone it might help. The drive corruption may be a problem or limitation of SD cards, and not even be a problem with the #Zeronet app. Because Android zeronet seems very stable now. As long as I only exit gracefully..👍😀",
			"post_uri": "1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534930318",
			"date_added": 1534980508
		},
		{
			"comment_id": 6,
			"body": "@Nofish see me below, just so the right people know..👍😀",
			"post_uri": "1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534930318",
			"date_added": 1534980737
		},
		{
			"comment_id": 7,
			"body": "@Vaerospace: If you don't exist gracefully it will corrupt your drive and cause a boot loop. It's still beta. But if they can handle installing a custom recovery like TWRP and backup. Then they should be ok. If not, android Zeronet app is not ready for them yet..👍",
			"post_uri": "1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer_1534930318",
			"date_added": 1534984237
		},
		{
			"comment_id": 8,
			"body": "I wouldn't trust anything Tim Berners-Lee supports. He sold us out again embedding the #EME aka #DRM in the OPEN! wed standards. It's spyware, censorshipware and a disgrace. TBL sold his soul to the bad guys. He's a Faustian. Claims he invented the web, BULLSHIT! Fork the w3c.  http://127.0.0.1:43110/big.kopykate.bit/?Video=1535450827_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS Need I say more.. The #EU sheepple need to jump all the way their MEP's asses that supported article 13, and boot them out of office. #TBL #EFF #FSF #UN #EU #US #UK #NetNeutrality #FreeSpeech #Shitternet ",
			"post_uri": "1PKQjBW65jtHKYs1NDrrVNu9c998TusQ8s_1539268558",
			"date_added": 1539290307
		},
		{
			"comment_id": 9,
			"body": "That would be a good thing. But only without the centralization, censorship and Wall Street advertising overlords that make #Twitter and other social media sites just junk food vendors of the internet, and time wasters.. :(",
			"post_uri": "1PKQjBW65jtHKYs1NDrrVNu9c998TusQ8s_1539269254",
			"date_added": 1539291584
		},
		{
			"comment_id": 10,
			"body": "Yep, if you like liberty and free speech and no central authority to censor, exploit, manipulate and make you their bitch. Well then, zeronet is for you. ;-)",
			"post_uri": "19MZEGAbUJjbtUkFkAJSa6R7TaHfHNGNj6_1539315166",
			"date_added": 1539316055
		},
		{
			"comment_id": 11,
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1536059292_1LYAhznicuncP8P6qiJFv6E1cw9ccCoqbX",
			"post_uri": "19MZEGAbUJjbtUkFkAJSa6R7TaHfHNGNj6_1539315166",
			"date_added": 1539316727
		},
		{
			"comment_id": 12,
			"body": "http://127.0.0.1:43110/big.kopykate.bit/?Video=1535450827_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS #JustSaying",
			"post_uri": "19MZEGAbUJjbtUkFkAJSa6R7TaHfHNGNj6_1539315166",
			"date_added": 1539316864
		},
		{
			"comment_id": 13,
			"body": "@Bussdee: Agree lol.. ;-)",
			"post_uri": "1FJHQ2mnk6znGuHYxeCPXTKPHe8TtcWo5c_1539444434",
			"date_added": 1539460603
		},
		{
			"comment_id": 14,
			"body": " # @Swastika: Zeronet is beautifully designed to give INDIVIDUAL! users powerful control over THEIR! zites/sites. But almost NO! power over other individuals speech of ANY! kind. It's AWESOME!!! It's how the Internet is meant to work. As to attacks, bring it on Pussy! lol ;) The sooner the better, so we can close that shit down. Why do you think I spend so much time pissing people off. The Zeronet's must be able to provide utility and persistence when the time comes to jump all the way up the Real! bad guys asses. Like, corrupt governments, politicians and hypocritical religious cult fuckers. Porn, obscenity and hate speech is just a warmup for the main event, bitches.. ;-)",
			"post_uri": "19MZEGAbUJjbtUkFkAJSa6R7TaHfHNGNj6_1539315166",
			"date_added": 1539462546
		},
		{
			"comment_id": 15,
			"body": "@Swastika: Well I was experimenting with deleting things, and some how I deleted most of my post from a vanilla ID. I may have had help. But good news is that it only happened after I used my private key to delete a post. :-)",
			"post_uri": "19MZEGAbUJjbtUkFkAJSa6R7TaHfHNGNj6_1539315166",
			"date_added": 1539487817
		},
		{
			"comment_id": 16,
			"body": "Everyone that calls out you (((Jew!))) faggots is a Nazi lol..",
			"post_uri": "1MGX3nQnMFnsu9KX8Lua8gEuTc571jwpFT_1539530870",
			"date_added": 1539563227
		},
		{
			"comment_id": 17,
			"body": "I heard he's a double agent, a fake. A two faced sellout for the (((#Jews!))). Making chumps out of you #dumbass #idiots who followed him blindly without paying attention, reading between the line. Or using your goddamn! heads.. You're Welcome! :-)",
			"post_uri": "161j9Vh5TpPeic4bzZYMd5Spgnf4qbiFFZ_1539931115",
			"date_added": 1539993278
		},
		{
			"comment_id": 18,
			"body": "There's not going to be any Fucking! world war. You can't have a world war with today's nuclear weapons. It would ignite the atmosphere and burn off all the oxygen. Planes and birds would fall from the sky. Including Air Force One. Total annihilation in seconds.",
			"post_uri": "1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj_1540099788",
			"date_added": 1540167803
		},
		{
			"comment_id": 19,
			"body": "There is an excellent program that does this called Retroshare. Very polished and has continued to develop and improve. It's extremely private and very powerful. It's fiend TO friend and friends OF friends. So you basically already need a friend to connect with. They have created a Tor version to make it easier to make friends with STRANGERS! :) Retroshare is also highly censorship immune.. You can also do what you want with Zeronet, and create your own Zite aka site. You can in fact create your own FB etc.. It will be a while before people fully grasp the power of Zeronet. Bitcoin is like this, even at around a 100 billion market cap lol. Retroshare and Zeronet need full power stable smartphone apps. But they are getting there. I want to also experiment with Linux Deploy on android. Both Retroshare and Zeronet have good Linux versions. :-) p.s. And don't forget about Freenet. It also runs under Linux. So many possibilities. So much progress. So much fun, exciting! :-)",
			"post_uri": "191jbK3GNmVritcMymKkFuxyYFXxqv2xpC_1540736752",
			"date_added": 1540748928
		},
		{
			"comment_id": 20,
			"body": "You should seek professional help. As you know pedophilia is a terrible disease of the mind and body, and very bad. If you cant or wont seek help I think you should KILL!!! yourself right now. Blow your brains out with a gun. Jump off a building or a bridge. Jump in front of a train, take a drug overdose etc.. Just do it. I would consider anonymously funding a bounty for the extrajudicial SLAUGHTER!!! and KILLING!!! of pedophiles. Including those who exploit pedophilia for personal gain of any kind (religious, social, legal etc..), including just dumb motherfuckers who attempt to exploit pedophilia for fun or profit. But I would never censor you online. #JustSaying :-)",
			"post_uri": "1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u_1541346116",
			"date_added": 1541357691
		},
		{
			"comment_id": 21,
			"body": "@Pexo: Oh it's definitely a pedophile. Res ipsa loquitur \"the thing speaks for itself\". It should kill itself or be killed now. It can't rationalize it's way out of this. Alea iacta est \"the die is cast'. There is no going back. It must DIE!!!..",
			"post_uri": "1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u_1541346116",
			"date_added": 1541360689
		},
		{
			"comment_id": 22,
			"body": "@Nekololi: Any legitimate legal liability rest solely on the individual that post the pic. Not! on Zeronet. Not! on Users who view the file. Not on the use of zeronet, or the cashing aka seeding of files as a normal function of network and browser operation. Sure, there are places where just using the internet is illegal. Fuck!!! them lol. If you are worried about that use Tor and or VPN's, and encrypt your drive and or computer. Run zeronet out of a hidden VeraCrypt volume with plausible deniability. If you click SHOW IMAGE, you can delete it. This will hide and remove the image from your system. You can mute and un-follow the poster etc.. All these scare tactics are just smoke screens, and would-be proxies for censorship and violating your human rights. FUCK!!! them. The important point is that @badoolove is a Pedophile, and should kill them-self. Or be killed.. :-)",
			"post_uri": "1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u_1541346116",
			"date_added": 1541377122
		},
		{
			"comment_id": 23,
			"body": "@Nekololi: The bottom line is still the same. @badoolove needs to be Killed! or Kill them-self. That's what we should focus on. That's whats important. Everybody, think hard. We can make it happen. Next thing you know, they're walking in front of a speeding car. Jumping off a bridge or building. Hanging from a door knob. You can help people. :-)",
			"post_uri": "1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u_1541346116",
			"date_added": 1541382904
		},
		{
			"comment_id": 24,
			"body": "Yo! it's my state. Fuck you! :-)",
			"post_uri": "1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb_1543256174",
			"date_added": 1543279216
		},
		{
			"comment_id": 25,
			"body": "@Advocatusdiaboli: I say we snuff the Fuckers! that put these poor people up to this shit. See photo above. :-)",
			"post_uri": "1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb_1543256174",
			"date_added": 1543281886
		},
		{
			"comment_id": 26,
			"body": "Snuff the Fuckers!.. Snuff the Fuckers!.. Snuff the Fuckers!.. :-)",
			"post_uri": "1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb_1543256174",
			"date_added": 1543282062
		},
		{
			"comment_id": 27,
			"body": "**Hay!** don't forget about the biggest problem. The more we **respect women's rights** to control of their bodies, the fewer dicks will get shoved up their **Ass!** Then the fewer babies we will have. **DatAss** :-)",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1546100992",
			"date_added": 1546113254
		}
	]
}