{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Como a desigualdade no pagamento entre homens e mulheres prejudica a economia brasileira",
			"body": "#O mundo avançou pouco na igualdade de gêneros no último ano: menos mulheres do que homens têm entrado no mercado de trabalho; sua participação na política e em cargos privados sêniores ainda é inferior à masculina, e sua presença em setores emergentes de tecnologia, como o de Inteligência Artificial, ainda é irrisória.\n\nAs conclusões são de um relatório recente do Fórum Econômico Mundial (WEF, na sigla em inglês), que traçou um panorama pouco animador da igualdade de gêneros em 149 países sob os aspectos político, econômico, educacional e de saúde.\n\nO Brasil não está bem posicionado no ranking do relatório: caiu cinco posições, para a 95ª, porque \"o abismo entre gêneros está em seu maior nível desde 2011\", diz o WEF. Os motivos disso são, sobretudo, as persistentes disparidades em participação e oportunidade econômicas.\n\nAqui, segundo o Estudo de Estatísticas de Gênero, do IBGE, as mulheres trabalham em média três horas por semana a mais do que os homens (somando-se trabalho remunerado, atividades domésticas e cuidados com outras pessoas), mas ganham apenas dois terços (76%) do rendimento deles.\n\nNas ocupações que exigem nível superior completo ou mais, a diferença salarial é ainda maior: as mulheres recebiam 63,4% do rendimento dos homens em 2016, dado mais recente disponível.\n\nAlguns estudos recentes analisaram o tamanho dessa disparidade, suas causas e o impacto que ela tem na economia inteira. A BBC News Brasil levantou os principais e mais recentes.\n\n#Quanto mais filhos, menor o salário delas\nO salário das mulheres brasileiras com filhos é, em média, 35% menor que o das que não têm filhos, evidenciando o impacto da maternidade na renda feminina. O levantamento foi feito pelo pesquisador Bruno Ottoni, da empresa de análise IDados e do Instituto Brasileiro de Economia da FGV Rio.\n\nOttoni comparou os rendimentos de mulheres casadas, empregadas e com idades de 25 a 35 anos levantados pela Pesquisa Nacional por Amostra de Domicílios (Pnad) Contínua, do IBGE, no terceiro trimestre de 2018.\n\nAs mulheres desse grupo que não tinham filhos recebiam, em média, R$ 2.182,06 por mês, contra R$ 1.618,47 das mulheres com filhos.\n\nE quanto mais filhos, menor era o rendimento médio delas. Uma mãe de três ou mais crianças ganhava R$ 1.426,53 em média.\n\nPara Anderson de Souza Sant'Anna, professor da Fundação Dom Cabral e coautor de um outro estudo sobre disparidade salarial de gênero, as carreiras das mulheres fazem \"uma curva em U\".\n\n\"Elas são mais escolarizadas, então são promovidas mais rápido, mas a partir de um certo momento, por volta dos 35, 38 anos, isso se inverte, e os homens as ultrapassam. Como as empresas não têm políticas para maternidade, as mulheres, ao voltarem ao trabalho, não conseguem se reinserir e recuperar a posição. Esse conjunto de fatores, somados, vão causando essas diferenças (salariais)\", disse à BBC News Brasil em outubro.\n\n#Elas gastam bem mais tempo com os afazeres domésticos\nEm 2016, as mulheres dedicavam, em média, 18 horas semanais a trabalhos domésticos ou a cuidados com pessoas (filhos ou parentes idosos, por exemplo), contra 10,5 horas dos homens, de acordo com o IBGE. Esse é um dos fatores que levam mais mulheres do que homens a buscar empregos de jornada parcial, com remuneração inferior.\n\n\"Em função da carga de afazeres domésticos e cuidados, muitas mulheres se sentem compelidas a buscar ocupações que precisam de uma jornada de trabalho mais flexível\", disse em comunicado Barbara Cobo, coordenadora de População e Indicadores Sociais do IBGE.\n\nNo entanto, \"mesmo com o trabalho em tempo parcial, a mulher ainda trabalha mais\", agrega Cobo. \"Combinando-se as horas de trabalhos remunerados com as de cuidados e afazeres, a mulher trabalha, em média, 54,4 horas semanais, contra 51,4 dos homens.\"\n\n#Elas são prejudicadas logo na entrevista de emprego\nPara Souza Sant'Anna, é possível que as entrevistas de emprego ajudem a perpetuar as diferenças salariais.\n\n\"Quando uma mulher é contratada, o RH pergunta quanto ela ganhava. Como elas historicamente ganham menos, uma hipótese é que já entram no novo emprego com um salário mais baixo do que um homem. Têm salários de entrada mais baixos. E isso ainda é intensificado por participação maior dos homens nos bônus. No caso de promoção, há uma tendência maior a favor dos homens.\"\n\n#Quanto maior o cargo, maior a diferença salarial\nAs mulheres não apenas ocupam menos posições sêniores (nem 40% dos cargos gerenciais são das mulheres, segundo o IBGE) como também ganham menos em relação aos homens à medida que ascendem profissionalmente.\n\nA pesquisa de Souza Sant'Anna, da Fundação Dom Cabral, analisou os salários de homens e mulheres em 12 grandes empresas dos setores de indústria e serviços, abrangendo 50 mil trabalhadores. Identificou uma diferença salarial média de 16% entre homens e mulheres que exercem o mesmo cargo.\n\nEm cargos de chefia, a discrepância chega a 27%. A distância entre os maiores salários de homens e de mulheres do topo é de 38%.\n\nHá discrepâncias também por setores.\n\n\"Áreas como PDI (pesquisa, desenvolvimento e inovação) e engenharia de produção, são muito masculinas. Elas ainda estão menos representadas nessas profissões que são mais valorizadas\", afirmou Sant'Anna.\n\n\"Existe o que chamamos de polarização das profissões - mulheres em posições de cuidado, como Recursos Humanos, que estão muito mais sujeitas à automação. Em todas as posições funcionais, os homens ganham mais que as mulheres, à exceção de posições administrativas e financeiras - supervisora de call center, por exemplo. Nossa hipótese é que os homens saíram delas e foram para áreas mais nobres.\"\n\n\n#Os benefícios da igualdade de gêneros: até US$ 28 tri a mais no PIB global\nSegundo o relatório do Fórum Econômico Mundial, no ritmo atual, o mundo levará mais de 200 anos para alcançar a igualdade salarial entre homens e mulheres, cenário que provoca perdas econômicas para toda a sociedade.\n\nUm levantamento de 2015 do Instituto McKinsey Global calculou que a igualdade de gêneros poderia acrescentar, em um cenário mediano - no qual os países alcancem o ritmo dos países mais igualitários de suas regiões -, até US$ 12 trilhões ao PIB mundial em 2025.\n\nEm um cenário ideal de igualdade plena, no qual \"mulheres participam na economia de modo idêntico aos homens\", os ganhos poderiam chegar a US$ 28 trilhões no PIB anual global - o equivalente, à época, à soma das duas maiores economias do mundo, a dos EUA e da China. Esse cenário permitiria que a metade feminina da população mundial alcançasse seu potencial mais plenamente, aumentando por exemplo suas horas de trabalho remunerado e seus rendimentos.\n\n\"Igualdade de gêneros não é apenas uma questão urgente do ponto de vista social e moral, mas também um desafio econômico\", apontou o relatório.\n\n#Mais poder financeiro feminino melhora as famílias\nEm 2018, o Fundo Monetário Internacional (FMI) analisou pesquisas e dados de mais de uma centena de nações em questões como acesso ao sistema financeiro (como crédito e contas bancárias) e ascensão profissional feminina no setor bancário.\n\nA conclusão foi de que mulheres mais fortes financeiramente demonstraram maior probabilidade de investir no bem-estar familiar e a tomar mais decisões financeiras mais inteligentes, que repercutem na educação e na saúde de sua família.\n\n\"Isso se traduz em menos pobreza, mais crescimento econômico e redução da desigualdade\", disse à BBC News Brasil Ratna Sahay, coautora do estudo e vice-diretora do Departamento Monetário e de Mercado de Capitais do FMI.\n\n\"Há diferentes exemplos: nas Filipinas, há evidências de que o empoderamento das mulheres aumentava seu controle sobre decisões do orçamento e seu gasto com itens simples, mas que melhoram a qualidade de vida de toda a família, como máquina de lavar roupa e utensílios culinários; no Nepal, descobrimos que lares liderados por mulheres gastavam 20% mais em educação do que os liderados por homens, algo muito importante para as crianças\", explicou Sahay, agregando que, embora seu estudo não mencione nominalmente o Brasil, as conclusões possivelmente se aplicam por aqui.\n\n#Mais participação feminina leva a mais eficiência e estabilidade financeira\nO levantamento do FMI analisou também um outro ângulo: qual o impacto de se, além de usuárias de serviços financeiros, tivermos mais mulheres provendo esses serviços - ou seja, ocupando posições de liderança em bancos centrais e comerciais e em agências regulatórias financeiras?\n\nE, novamente, a conclusão foi de que \"a maior representatividade das mulheres (em instituições financeiras) leva a mais estabilidade financeira\" - na prática, menor endividamento, decisões corporativas mais cautelosas, mais eficiência e menos chance de crises financeiras.\n\n\"E isso tem grandes implicações, porque muitos países se preocupam com risco sistêmico e estabilidade. Em todos esses aspectos, reduzir a desigualdade de gênero pode ter efeitos macroeconômicos muito positivos\", afirmou Sahay.\n\nSegundo o FMI, menos de 2% das CEOs de instituições financeiras globais são mulheres; elas também são menos de 20% dos membros dos conselhos dessas instituições.\n\n\"E isso é um contraste grande com a oferta de mulheres com formação relevante (nessa área)\", diz o texto do Fundo. \"As mulheres representam 30% dos formandos em economia e cerca de 50% dos formandos em administração e ciências sociais.\"\n\nSegundo o estudo do Fórum Econômico Mundial, a igualdade de gêneros \"é boa para os negócios\".\n\n\"Pesquisas feitas ao longo de três décadas mostram que (...) empresas com mais mulheres líderes e nos conselhos têm maiores lucros e performance financeira. Também têm menos relatos de fraude, corrupção e erros financeiros. Na Noruega, onde é exigido que as empresas reservem ao menos 40% de seus assentos de conselho a mulheres, as pesquisas mostram que elas têm mais probabilidade de pensar em longo prazo, e incluir cidadãos, em vez de apenas acionistas, em suas deliberações. As mulheres estimulam os conselhos a focar mais na comunidade, no ambiente e nos empregados.\"\n\n- Fonte: https://www.bbc.com/portuguese/brasil-46655125",
			"added": 1552675200
		},
		{
			"topic_id": 2,
			"title": "A diferença geracional dos homens na hora de encarar o feminismo",
			"body": "#Os padrões masculinos estão se transformando. Sobretudo para os mais jovens. Eles dizem compartilhar tarefas domésticas e ter mais inteligência emocional que seus pais. Mas as mulheres não percebem essa alteração na mesma medida\n\n\nO feminismo não originou apenas reações de adesão ou rechaço. Provocou a necessidade de uma revisão do modelo tradicional de homem e de masculinidade. Obrigou a revisar estereótipos e a buscar alternativas ao macho ibérico.\n\nPara questionar masculinidades tóxicas e machistas e reconstruir a hombridade, há poucos dados objetivos sobre o que se entende como valores e modelos característicos do gênero masculino. Mas o fato é que algo está mudando. Uma pesquisa da empresa 40dB encomendada pelo EL PAÍS, um ano após o histórico protesto feminista na Espanha, reflete como no país os homens jovens não definem suas peculiaridades da mesma forma que os mais velhos. Mas a reação mais tímida dessa geração a situações de assédio e comentários machistas é escassa. Evoluímos, mas parece que não foi suficiente, e as mulheres tampouco percebem essa transformação com a mesma intensidade que eles.\n\nOs estereótipos continuam presentes nas respostas dos homens com mais de 65 anos. Hércules e Apolo já não são mais ícones de masculinidade. Mas ser corajoso e forte durante uma crise, ter segurança em si mesmo e ser heterossexual são características associadas à masculinidade, segundo os idosos.\n\nOs mais jovens discordam não só deste modelo, como tampouco acham que não ter sucesso profissional ou não ser o provedor econômico da casa sejam situações que desvirtuem seu gênero. A moda do papel dominante passou.\n\nUm dos dados mais contundentes que a pesquisa oferece está nas respostas às perguntas formuladas apenas aos homens. Quase 86% declaram que o fortalecimento do feminismo não tornou mais difícil estabelecer relações com as mulheres. A maioria tampouco teme uma denúncia injusta. E mais de 85% dos homens afirmam não mudar seu comportamento quando não há mulheres presentes, e que tampouco utilizam em grupos masculinos do WhatsApp expressões que não diriam pessoalmente.\n\nO desafio deveria estar na reação a quem faz isso, porque só metade chama a atenção dos seus amigos quando fazem comentários ofensivos. E são justamente os jovens, apesar de mais distantes dos padrões rançosos de masculinidade, menos propensos a reprovar essas ofensas e micromachismos. E não só nestes casos.\n\nFrente a uma situação de perseguição ou agressão sexual presenciada, 23% dos homens decidem não intervir, e também nesse caso os mais velhos são mais propensos a fazê-lo.\n\nIsso é destacável porque as definições de assédio para os homens mais idosos é menos rigorosa que para os jovens, que opinam de forma majoritária que comentar o aspecto físico de uma colega de trabalho ou elogiá-la é assédio. Uma coisa é a teoria, e outra é a prática.\n\nOs homens admitem que o modelo do seu gênero está mudando. E atingem essa conclusão ao responder como se veem atualmente em comparação aos seus antecessores. A maioria acredita que melhoraram em inteligência emocional e que compartilham, em maior grau, as tarefas e o cuidado dos filhos. Entretanto, as mulheres não respaldam estas respostas na mesma proporção que eles. Apreciam uma melhora na inteligência emocional, sim, mas nem tanto.\n\nTambém há discrepâncias em questões de tratamento. Quase metade dos pesquisados admite não ter certeza sobre como agir com as mulheres. E, quando elas são perguntadas, essa percentagem sobe quatro pontos. Eles também dizem reconhecer suas fraquezas em maior medida que os homens de antes, mas as mulheres não estão tão de acordo. A autorrepressão do afeto também começa a ser superada, e frente a esta transformação os homens não se sentem mais “moles” que os de antes.\n\nOs dândis provocaram uma mudança radical na masculinidade no século XVIII. A moda é um dos setores que mais impulsionam a revisão de suas características, ao menos na aparência. E a inquietação com a presença física continua ocupando o topo das preocupações. Homens e mulheres coincidem em valorizar o interesse pelo aspecto físico e a aparência. Todos apontam que aumentou com relação a seus antecessores. E é motivo de insegurança.\n\nO peso está acima de uma boa situação profissional como causa de inseguranças. E, depois do salário, a calvície se situa como outro dos motivos pelos quais os homens tremem. Os seguintes: as relações sexuais, a personalidade, o jeito de se vestir e o pênis, membro que lhes preocupa mais que a inteligência.\n\n#Ficha técnica da pesquisa\n\nÂMBITO: Espanha. UNIVERSO: população geral residente na Espanha de 18 anos ou mais. AMOSTRA: 2.000 entrevistas. Estratificação por sexo, idade, porte do município e comunidade autônoma. PROCEDIMENTO: entrevista on-line. MARGEM DE ERRO: ±2,19% (95% de confiança). TRABALHO DE CAMPO: sondagem realizada pela 40dB de 24 a 31 de janeiro de 2019.\n\n- Fonte: https://brasil.elpais.com/brasil/2019/02/27/eps/1551293915_970914.html",
			"added": 1552675585
		},
		{
			"topic_id": 3,
			"title": "Resumo Histórico do Brasil",
			"body": "#Fundação\nA descoberta do Brasil, em 22 de abril de 1500, pela esquadra comandada por Pedro Álvares Cabral, com destino às Índias, integra o ciclo da expansão marítima portuguesa. Inicialmente denominada Terra de Vera Cruz, depois Santa Cruz e, finalmente, Brasil, a nova terra foi explorada a princípio em função da extração do pau-brasil, madeira de cor vermelha usada em tinturaria na Europa, e que deu o nome à terra.\n\nVárias expedições exploradoras (Gonçalo Coelho, Gaspar de Lemos) e guarda-costas (Cristóvão Jacques) foram enviadas pelo rei de Portugal, a fim de explorar o litoral e combater piratas e corsários, principalmente franceses, para garantir a posse da terra. O sistema de feitorias, já utilizado no comércio com a África e a Ásia, foi empregado tanto para a defesa como para realizar o escambo (troca) do pau-brasil com os indígenas. A exploração do pau-brasil, monopólio da Coroa portuguesa, foi concedida ao cristão-novo Fernão de Noronha.\n\nA partir de 1530, tem início a colonização efetiva, com a expedição de Martim Afonso de Sousa, cujos efeitos foram o melhor reconhecimento da terra, a introdução do cultivo da cana-de-açúcar e a criação dos primeiros engenhos, instalados na recém-fundada cidade de São Vicente, no litoral de São Paulo, que no século 16 chegou a ter treze engenhos de açúcar. A economia açucareira, entretanto, vai se concentrar no Nordeste, principalmente em Pernambuco. Estava baseada no tripé latifúndio--monocultura--escravidão. A cana-de-açúcar, no Nordeste, era cultivada e beneficiada em grandes propriedades, que empregavam mão-de-obra dos negros africanos trazidos como escravos, e destinava-se à exportação.\n\nAo lado do ciclo da cana-de-açúcar, ocorrido na zona da mata, desenvolveu-se o ciclo do gado. A pecuária aos poucos ocupou toda a área do agreste e do sertão nordestinos e a bacia do rio São Francisco. No século 18, o ciclo da mineração do ouro e dos diamantes em Minas Gerais levou à ocupação do interior da colônia. A sociedade mineradora era mais diversificada do que a sociedade açucareira, extremamente ruralizada. Na zona mineira, ao lado dos proprietários e escravos, surgiram classes intermediárias, constituídas por comerciantes, artesãos e funcionários da Coroa.\n\nPolítica e administrativamente a colônia estava subordinada à metrópole portuguesa, que, para mais facilmente ocupá-la, adotou, em 1534, o sistema de capitanias hereditárias. Consistia na doação de terras pelo rei de Portugal a particulares, que se comprometiam a explorá-las e povoá-las. Apenas duas capitanias prosperaram: São Vicente e Pernambuco. As capitanias hereditárias somente foram extintas em meados do século 18.\n\nEm 1548, a Coroa portuguesa instituiu o governo geral, para melhor controlar a administração da colônia. O governador-geral Tomé de Sousa possuía extensos poderes, e administrava em nome do rei a capitania da Bahia, cuja sede, Salvador -- primeira cidade fundada no Brasil, foi também sede do governo geral até 1763, quando a capital da colônia foi transferida para o Rio de Janeiro. A administração local era exercida pelas câmaras municipais, para as quais eram eleitos os colonos ricos, chamados “homens bons”.\n\nO papel da Igreja Católica era da mais alta importância. A ela cabiam tarefas administrativas, a assistência social, o ensino e a catequese dos indígenas. Dentre as diversas ordens religiosas, destacaram-se os jesuítas.\n\nInvasões estrangeiras. Durante o período colonial, o Brasil foi alvo de várias incursões estrangeiras, sobretudo de franceses, ingleses e holandeses. Os franceses chegaram a fundar, em 1555, uma colônia, a França Antártica, na ilha de Villegaignon, na baía de Guanabara. Somente foram expulsos em 1567, em combate do qual participou Estácio de Sá, fundador da cidade do Rio de Janeiro (1565). Mais tarde, entre 1612 e 1615, novamente os franceses tentaram estabelecer uma colônia no Brasil, desta vez no Maranhão, chamada França Equinocial.\n\nOs holandeses, em busca do domínio da produção do açúcar (do qual eram os distribuidores na Europa), invadiram a Bahia, em 1624, sendo expulsos no ano seguinte. Em 1630, uma nova invasão holandesa teve como alvo Pernambuco, de onde estendeu-se por quase todo o Nordeste, chegando até o Rio Grande do Norte. Entre 1637 e 1645, o Brasil holandês foi governado pelo conde Maurício de Nassau, que realizou brilhante administração. Em 1645, os holandeses foram expulsos do Brasil, no episódio conhecido como insurreição pernambucana.\n\n#Expansão geográfica\nDurante o século 16, foram organizadas algumas entradas, expedições armadas ao interior, de caráter geralmente oficial, em busca de metais preciosos. No século seguinte, expedições particulares, conhecidas como bandeiras, partiram especialmente de São Paulo, com três objetivos: a busca de índios para escravizar; a localização de agrupamentos de negros fugidos (quilombos), para destruí-los; e a procura de metais preciosos. As bandeiras de caça ao índio (Antônio Raposo Tavares, Sebastião e Manuel Preto) atingiram as margens do rio Paraguai, onde arrasaram as “reduções” (missões) jesuíticas. Em 1695, depois de quase um século de resistência, foi destruído Palmares, o mais célebre quilombo do Brasil, por tropas comandadas pelo bandeirante Domingos Jorge Velho.\n\nDatam do final do século 17 as primeiras descobertas de jazidas auríferas no interior do território, nas chamadas Minas Gerais (Antônio Dias Adorno, Manuel de Borba Gato), em Goiás (Bartolomeu Bueno da Silva, o Anhanguera) e Mato Grosso (Pascoal Moreira Cabral), onde foram estabelecidas vilas e povoações. Mais tarde, foram encontrados diamantes em Minas Gerais. Um dos mais célebres bandeirantes foi Fernão Dias Pais, o caçador de esmeraldas.\n\nAo mesmo tempo que buscavam o oeste, os bandeirantes ultrapassaram a vertical de Tordesilhas, a linha imaginária que, desde 1494, separava as terras americanas pertencentes a Portugal e à Espanha, contribuindo para alargar o território brasileiro. As fronteiras ficaram demarcadas por meio da assinatura de vários tratados, dos quais o mais importante foi o de Madri, celebrado em 1750, e que praticamente deu ao Brasil os contornos atuais. Nas negociações com a Espanha, Alexandre de Gusmão defendeu o princípio do uti possidetis, o que assegurou a Portugal as terras já conquistadas e ocupadas.\n\n#Revoltas coloniais\nDesde a segunda metade do século 17, explodiram na colônia várias revoltas, geralmente provocadas por interesses econômicos contrariados. Em 1684, a revolta dos Beckman, no Maranhão, voltou-se contra o monopólio exercido pela Companhia de Comércio do Estado do Maranhão.\n\nJá no século 18, a guerra dos emboabas envolveu paulistas e “forasteiros” na zona das minas; a guerra dos mascates opôs os comerciantes de Recife aos aristocráticos senhores de engenho de Olinda; e a revolta de Vila Rica, liderada por Filipe dos Santos, em 1720, combateu a instituição das casas de fundição e a cobrança de novos impostos sobre a mineração do ouro.\n\nOs mais importantes movimentos revoltosos desse século foram a conjuração mineira e a conjuração baiana, as quais possuíam, além do caráter econômico, uma clara conotação política. A conjuração mineira, ocorrida em 1789, também em Vila Rica, foi liderada por Joaquim José da Silva Xavier, o Tiradentes, que terminou preso e enforcado, em 1792. Pretendia, entre outras coisas, a independência e a proclamação de uma república. A conjuração baiana -- também chamada revolução dos alfaiates, devido à participação de grande número de elementos das camadas populares (artesãos, soldados, negros libertos) --, ocorrida em 1798, tinha ideias bastante avançadas para a época, inclusive a extinção da escravidão. Seus principais líderes foram executados. Mais tarde, estourou outro importante movimento de caráter republicano e separatista, conhecido como revolução pernambucana de 1817.\n\nIndependência. Em 1808, ocorreu a chamada “inversão brasileira”, isto é, o Brasil tornou-se a sede da monarquia portuguesa, com a transferência da família real e da corte para o Rio de Janeiro, fugindo da invasão napoleônica na península ibérica. Ainda na Bahia, o príncipe regente D. João assinou o tratado de abertura dos portos brasileiros ao comércio das nações amigas, beneficiando principalmente a Inglaterra. Terminava assim o monopólio português sobre o comércio com o Brasil e tinha início o livre-cambismo, que perduraria até 1846, quando foi estabelecido o protecionismo.\n\nAlém da introdução de diversos melhoramentos (Imprensa Régia, Biblioteca Pública, Academia Militar, Jardim Botânico, faculdades de medicina do Rio de Janeiro e da Bahia e outros), no governo do príncipe regente D. João (que passaria a ter o título de D. João VI a partir de 1816, com o falecimento da rainha D. Maria I) o Brasil foi elevado à categoria de reino e teve anexadas a seu território a Guiana Francesa e a Banda Oriental do Uruguai, que tomou o nome de província Cisplatina.\n\nA partir de 1821, com a volta do rei e da corte para Portugal, o Brasil passou a ser governado pelo príncipe regente D. Pedro. Atendendo principalmente aos interesses dos grandes proprietários rurais, contrários à política das Cortes portuguesas, que desejavam recolonizar o Brasil, bem como pretendendo libertar-se da tutela da metrópole, que visava diminuir-lhe a autoridade, D. Pedro proclamou a independência do Brasil, em 7 de setembro de 1822, às margens do riacho do Ipiranga, na província de São Paulo. É importante destacar o papel de José Bonifácio de Andrada e Silva, à frente do chamado Ministério da Independência, na articulação do movimento separatista.\n\nPrimeiro reinado. Aclamado imperador do Brasil, D. Pedro I tratou de dar ao país uma constituição, outorgada em 1824. No início do seu reinado, ocorreu a chamada “guerra da independência”, contra as guarnições portuguesas sediadas principalmente na Bahia. Em 1824, em Pernambuco, a confederação do Equador, movimento revoltoso de caráter republicano e separatista, questionava a excessiva centralização do poder político nas mãos do imperador, mas foi prontamente debelado. Em 1828, depois da guerra contra as Províncias Unidas do Rio da Prata, o Brasil reconheceu a independência do Uruguai.\n\nDepois de intensa luta diplomática, em que foi muito importante a intervenção da Inglaterra, Portugal reconheceu a independência do Brasil. Frequentes conflitos com a Assembleia e interesses dinásticos em Portugal levaram D. Pedro I, em 1831, a abdicar do trono do Brasil em favor do filho D. Pedro, então com cinco anos de idade.\n\nPeríodo regencial. O reinado de D. Pedro II teve início com um período regencial, que durou até 1840, quando foi proclamada a maioridade do imperador, que contava cerca de quinze anos. Durante as regências, ocorreram intensas lutas políticas em várias partes do país, quase sempre provocadas pelos choques entre os interesses regionais e a concentração do poder no Sudeste (Rio de Janeiro). A mais importante foi a guerra dos farrapos ou revolução farroupilha, movimento republicano e separatista ocorrido no Rio Grande do Sul, em 1835, e que só terminou em 1845. Além dessa, ocorreram revoltas na Bahia (Sabinada), no Maranhão (Balaiada) e no Pará (Cabanagem).\n\nSegundo reinado. O governo pessoal de D. Pedro II começou com intensas campanhas militares, a cargo do general Luís Alves de Lima e Silva, que viria a ter o título de duque de Caxias, com a finalidade de pôr termo às revoltas provinciais. A partir daí, a política interna do império brasileiro viveu uma fase de relativa estabilidade, até 1870.\n\nA base da economia era a agricultura cafeeira, desenvolvida a partir de 1830, no Sudeste, inicialmente nos morros como o da Tijuca e a seguir no vale do Paraíba fluminense (província do Rio de Janeiro), avançando para São Paulo (vale do Paraíba e oeste paulista). Até 1930, o ciclo do café constituiu o principal gerador da riqueza brasileira. A partir da década de 1850, graças aos empreendimentos de Irineu Evangelista de Sousa, o barão e depois visconde de Mauá, entre os quais se destaca a construção da primeira estrada de ferro brasileira, ocorreu um primeiro surto de industrialização no país.\n\nA base social do império era a escravidão. Desde o período colonial, os negros escravos constituíam a principal, e quase exclusiva, mão-de-obra no Brasil. As restrições ao tráfico negreiro começaram por volta de 1830, por pressões da Inglaterra, então em plena revolução industrial. Finalmente, em 1888, após intensa campanha abolicionista, a chamada Lei Áurea declarava extinta a escravidão no país. Nesse período, houve uma grande imigração para o Brasil, sobretudo de alemães e italianos.\n\nNa política externa, sobressaíram as guerras do Prata, em que o Brasil enfrentou o Uruguai e a Argentina, e a da Tríplice Aliança ou do Paraguai, que reuniu o Brasil, a Argentina e o Uruguai numa coligação contra o ditador paraguaio Solano López. A guerra do Paraguai (1864--1870), um dos episódios mais sangrentos da história americana, terminou com a vitória dos aliados.\n\nA partir de 1870, a monarquia brasileira enfrentou sucessivas crises (questão religiosa, questão militar, questão da abolição), que culminaram com o movimento militar, liderado pelo marechal Deodoro da Fonseca, que depôs o imperador e proclamou a república, em 15 de novembro de 1889.\n\nRepública Velha. A Primeira República, ou República Velha, estendeu-se de 1889 até 1930. Sob a chefia do marechal Deodoro, foi instalado um governo provisório, que convocou uma assembleia constituinte para elaborar a primeira constituição republicana, promulgada em 1891. Os governos do marechal Deodoro, e, depois, do marechal Floriano Peixoto foram plenos de conflitos com o Legislativo e rebeliões, como as duas revoltas da Armada.\n\nCom a eleição de Prudente de Morais, tem início a chamada “política do café com leite”, segundo a qual os presidentes da República seriam escolhidos dentre os representantes dos estados mais ricos e populosos -- São Paulo e Minas Gerais -- prática que foi seguida, quase sem interrupções, até 1930.\n\nA economia agrário-exportadora continuou dominante. O café representava a principal riqueza brasileira, e os fazendeiros paulistas constituíam a oligarquia mais poderosa. As classes médias eram pouco expressivas e começava a existir um embrião de proletariado. Por ocasião da primeira guerra mundial (1914--1918), ocorreu um surto de industrialização, em função da substituição de importações europeias por produtos fabricados no Brasil.\n\nA partir da década de 1920, o descontentamento dos militares explodiu em uma série de revoltas, destacando-se a marcha da coluna Prestes, entre 1924 e 1927, que percorreu grande parte do Brasil. As oligarquias alijadas do poder central também se mostravam insatisfeitas. Quando ocorreu a crise de 1929 -- iniciada com o crash da bolsa de Nova York --, com seus reflexos negativos sobre os preços do café, a desorganização da economia, as divergências político-eleitorais das oligarquias dominantes e as aspirações de mudança de amplos setores da sociedade provocaram a deflagração da revolução de 1930, que levou Getúlio Vargas ao poder.\n\n#República Nova\nSob a chefia de Getúlio Vargas, foi instaurado um governo provisório que durou até 1934. Embora vitorioso sobre a revolução constitucionalista de 1932, ocorrida em São Paulo, Vargas viu-se obrigado a convocar uma assembleia constituinte, que deu ao país uma nova constituição (1934), de cunho liberal.\n\nEm 1935, a Aliança Nacional Libertadora (ANL) promoveu uma revolta militar, conhecida como intentona comunista. Aproveitando-se de uma conjuntura favorável, Vargas deu um golpe de estado, em 1937, fechando o Congresso e estabelecendo uma ditadura de cunho corporativo-fascista, denominada Estado Novo, regida por uma carta outorgada, de caráter autoritário. Vargas governou até 1945, quando foi deposto por novo golpe militar.\n\nDurante seu governo, incentivou-se a industrialização, inclusive com a fundação da Companhia Siderúrgica Nacional, foi estabelecida uma legislação trabalhista, reorganizou-se o aparelho administrativo do Estado, com a criação de novos ministérios, e cuidou-se da previdência social, entre outros melhoramentos.\n\nTerceira República. As eleições de 1945 apontaram o general Eurico Gaspar Dutra como o novo presidente da República. Em seu governo, o Brasil ganhou uma nova constituição, foi modernizada a estrada de rodagem entre o Rio de Janeiro e São Paulo (rodovia Presidente Dutra) e começou o aproveitamento hidrelétrico da cachoeira de Paulo Afonso.\n\nNesse período, firmaram-se os três grandes partidos que tiveram importância na vida política brasileira até a deflagração do movimento militar de 1964: o Partido Trabalhista Brasileiro (PTB), o Partido Social Democrático (PSD) e a União Democrática Nacional (UDN). O Partido Comunista Brasileiro (PCB) foi posto na ilegalidade.\n\nEm 1951, Vargas, candidato do PTB, voltou ao poder, eleito pelo voto popular. Em seu segundo governo, destacou-se a criação da Petrobrás, empresa estatal destinada a monopolizar a pesquisa, extração e refino do petróleo. Foi um período conturbado, que teve no atentado da rua Tonelero (dirigido ao jornalista Carlos Lacerda, mas em que morreu um oficial da Aeronáutica) um dos seus episódios mais importantes. Pressionado pelas classes conservadoras, e ameaçado de deposição por seus generais, Vargas suicidou-se em 24 de agosto de 1954.\n\nA eleição de Juscelino Kubitschek de Oliveira, candidato do PSD, inaugurou a era do desenvolvimentismo. Durante seu governo, orientado pelo Plano de Metas, construiu-se a nova capital, Brasília, inaugurada em 21 de abril de 1960; foram abertas numerosas estradas, ligando a capital às diversas regiões do país, entre as quais a Belém--Brasília; implantou-se a indústria automobilística; e foi impulsionada a construção das grandes usinas hidrelétricas de Três Marias e Furnas. A sucessão presidencial coube a Jânio Quadros, apoiado pela UDN, que, após sete meses de governo, renunciou.\n\nA subida de João Goulart ao poder contrariou as classes conservadoras e altos chefes militares. No início de seu governo, o Brasil viveu uma curta experiência parlamentarista, solução encontrada para dar posse a Goulart. Foi um período marcado por greves e intensa agitação sindical. O presidente terminou sendo deposto pelos militares, com apoio da classe média, em 1964.\n\nRegime militar. Os governos militares preocuparam-se sobretudo com a segurança nacional. Editaram vários atos institucionais e complementares, promovendo modificações no funcionamento do Congresso e tomando medidas de caráter econômico, financeiro e político. Os partidos políticos tradicionais foram extintos, e criadas duas novas agremiações políticas, a Aliança Renovadora Nacional (Arena) e o Movimento Democrático Brasileiro (MDB).\n\nEm 1967, promulgou-se nova constituição, que estabeleceu um poder executivo ainda mais forte. Com o crescimento da agitação estudantil e operária, foi editado o Ato Institucional nº 5, que fechou o Congresso. Em 1969, a Emenda Constitucional nº 1 deu ao país praticamente uma nova carta política.\n\nNo campo do desenvolvimento econômico, as atenções dos governantes e dos tecnocratas voltaram-se prioritariamente para o combate à inflação, que atingira níveis alarmantes; para a construção de obras de infra-estrutura, sobretudo nas áreas de transportes -- como a rodovia Transamazônica e a ponte Rio--Niterói (oficialmente, ponte Presidente Costa e Silva) --, de comunicações -- com a implantação do sistema de comunicação por satélite -- e de energia, com a construção da usina hidrelétrica de Itaipu -- por meio de um convênio com o Paraguai -- e com a assinatura de um acordo com a Alemanha para a construção de usinas nucleares.\n\nO governo Geisel iniciou um processo de abertura democrática, lenta e gradual, desembocando na anistia política, que permitiu a volta ao país de numerosos exilados. Em seguida à anistia, veio o fim do bipartidarismo, e foram criados vários partidos políticos. No final da década de 1970, o movimento popular e sindical tomou um novo alento, o que levaria, nos primeiros anos da década seguinte, ao movimento das “diretas já”, que, embora não fosse vitorioso, permitiu em 1985 a eleição indireta pelo Congresso de Tancredo Neves, do Partido do Movimento Democrático Brasileiro (PMDB), para a presidência da República. Com a morte de Tancredo Neves, na véspera da posse, assumiu seu vice-presidente, José Sarney.\n\n#Nova República\nO governo Sarney teve como fato econômico mais importante a implantação do Plano Cruzado, com vistas a combater a inflação pelo congelamento de preços e da troca da moeda. O fato político marcante do período foi a eleição de uma assembleia nacional constituinte, que em 1988 deu ao Brasil uma nova constituição. O fracasso do plano econômico e a corrupção generalizada contribuíram para polarizar as preferências eleitorais em 1989 em torno das candidaturas de Fernando Collor de Mello, apoiado por poderosas forças políticas, e Luís Inácio Lula da Silva, do Partido dos Trabalhadores.\n\nA vitória de Fernando Collor provocou uma euforia momentânea, logo dissipada pelo fracasso dos sucessivos planos econômicos e pelas denúncias de corrupção que atingiam figuras próximas ao presidente. Depois de intensa movimentação popular, Collor foi afastado do governo, em 1992, pelo processo de impeachment, conduzido pelo Congresso Nacional.\n\nO Presidente Itamar Franco, sucessor de Fernando Collor, contou com vasto apoio parlamentar e popular. Seus objetivos principais eram combater a inflação, retomar o crescimento econômico e diminuir a pobreza do povo brasileiro. O sucesso das medidas econômicas permitiu a eleição do criador do Plano Real, Fernando Henrique Cardoso, que conquistou a Presidência da República, e foi presidente por dois mandatos, de 1995 a 1998 e de 1999 a 2002.\n\nEm 27 de outubro de 2002, Luiz Inácio Lula da Silva é eleito Presidente da República Federativa do Brasil com quase 53 milhões de votos, e, em 29 de outubro de 2006 é reeleito com mais de 58 milhões de votos (60,83% dos votos válidos).\n\nNo dia 31 de outubro de 2010, Dilma Rousseff foi eleita presidente do Brasil, cargo a ser ocupado pela primeira vez na história do país por uma mulher. Dilma Roussef obteve 55.752.529 votos, que contabilizaram 56,05% do total de votos válidos. Em seu pronunciamento oficial após vencer as eleições disse: “Vou fazer um governo comprometido com a erradicação da miséria e dar oportunidades para todos os brasileiros e brasileiras. Mas, humildemente, faço um chamado à nação, aos empresários, trabalhadores, imprensa, pessoas de bem do país para que me ajudem.”\n\n- Fonte: https://www.sohistoria.com.br/ef2/histbrasil/",
			"added": 1552677361
		},
		{
			"topic_id": 4,
			"title": "Introdução ao jogo do Go",
			"body": "O Go é um jogo de disputa e conquista de território.\n\nImagine que o tabuleiro é um terreno a ser conquistado. Ganha quem ao final tiver o maior território cercado por suas peças. Para isso, basta cercar da melhor maneira possível o território, não deixando que o adversário invada sua terra e tome o seu território.\n\nO jogo termina quando todas as disputas e pretensões territoriais estejam acabadas.\n\n#Se existe vida inteligente fora da Terra, é certo que eles jogam Go. Emanuel Lasker – Campeão mundial de xadrez (1894 e 1921)\n\n\n\n- https://web.archive.org/web/20150616005836/https://cdn.online-go.com/Introduccion-al-juego-de-Go.pdf",
			"added": 1552681928
		},
		{
			"topic_id": 5,
			"title": "Declaração Universal dos Direitos Humanos - Texto integral",
			"body": "#Preâmbulo\n\nConsiderando que o reconhecimento da dignidade inerente a todos os membros da família humana e de seus direitos iguais e inalienáveis é o fundamento da liberdade, da justiça e da paz no mundo,\nConsiderando que o desprezo e o desrespeito pelos direitos humanos resultaram em atos bárbaros que ultrajaram a consciência da Humanidade e que o advento de um mundo em que os homens gozem de liberdade de palavra, de crença e da liberdade de viverem a salvo do temor e da necessidade foi proclamado como a mais alta aspiração do homem comum,\nConsiderando essencial que os direitos humanos sejam protegidos pelo Estado de Direito, para que o homem não seja compelido, como último recurso, à rebelião contra tirania e a opressão,\nConsiderando essencial promover o desenvolvimento de relações amistosas entre as nações,\nConsiderando que os povos das Nações Unidas reafirmaram, na Carta, sua fé nos direitos humanos fundamentais, na dignidade e no valor da pessoa humana e na igualdade de direitos dos homens e das mulheres, e que decidiram promover o progresso social e melhores condições de vida em uma liberdade mais ampla,\nConsiderando que os Estados-Membros se comprometeram a desenvolver, em cooperação com as Nações Unidas, o respeito universal aos direitos humanos e liberdades fundamentais e a observância desses direitos e liberdades,\nConsiderando que uma compreensão comum desses direitos e liberdades é da mais alta importância para o pleno cumprimento desse compromisso.\n\n#A Assembleia Geral proclama\nA presente Declaração Universal dos Diretos Humanos como o ideal comum a ser atingido por todos os povos e todas as nações, com o objetivo de que cada indivíduo e cada órgão da sociedade, tendo sempre em mente esta Declaração, se esforce, através do ensino e da educação, por promover o respeito a esses direitos e liberdades, e, pela adoção de medidas progressivas de caráter nacional e internacional, por assegurar o seu reconhecimento e a sua observância universais e efetivos, tanto entre os povos dos próprios Estados-Membros, quanto entre os povos dos territórios sob sua jurisdição.\n\n#Artigo I\nTodas as pessoas nascem livres e iguais em dignidade e direitos. São dotadas de razão e consciência e devem agir em relação umas às outras com espírito de fraternidade.\n\n#Artigo II \nToda pessoa tem capacidade para gozar os direitos e as liberdades estabelecidos nesta Declaração, sem distinção de qualquer espécie, seja de raça, cor, sexo, língua, religião, opinião política ou de outra natureza, origem nacional ou social, riqueza, nascimento, ou qualquer outra condição.\n\n#Artigo III \nToda pessoa tem direito à vida, à liberdade e à segurança pessoal.\n\n#Artigo IV \nNinguém será mantido em escravidão ou servidão, a escravidão e o tráfico de escravos serão proibidos em todas as suas formas.\n\n#Artigo V \nNinguém será submetido a tortura, nem a tratamento ou castigo cruel, desumano ou degradante.\n\n#Artigo VI \nToda pessoa tem o direito de ser, em todos os lugares, reconhecida como pessoa perante a lei.\n\n#Artigo VII\nTodos são iguais perante a lei e têm direito, sem qualquer distinção, a igual proteção da lei. Todos têm direito a igual proteção contra qualquer discriminação que viole a presente Declaração e contra qualquer incitamento a tal discriminação.\n\n#Artigo VIII\nToda pessoa tem direito a receber dos tributos nacionais competentes remédio efetivo para os atos que violem os direitos fundamentais que lhe sejam reconhecidos pela constituição ou pela lei.\n\n#Artigo IX\nNinguém será arbitrariamente preso, detido ou exilado.\n\n#Artigo X\nToda pessoa tem direito, em plena igualdade, a uma audiência justa e pública por parte de um tribunal independente e imparcial, para decidir de seus direitos e deveres ou do fundamento de qualquer acusação criminal contra ele.\n\n#Artigo XI \n1. Toda pessoa acusada de um ato delituoso tem o direito de ser presumida inocente até que a sua culpabilidade tenha sido provada de acordo com a lei, em julgamento público no qual lhe tenham sido asseguradas todas as garantias necessárias à sua defesa.\n2. Ninguém poderá ser culpado por qualquer ação ou omissão que, no momento, não constituíam delito perante o direito nacional ou internacional. Tampouco será imposta pena mais forte do que aquela que, no momento da prática, era aplicável ao ato delituoso.\n\n#Artigo XII \nNinguém será sujeito a interferências na sua vida privada, na sua família, no seu lar ou na sua correspondência, nem a ataques à sua honra e reputação. Toda pessoa tem direito à proteção da lei contra tais interferências ou ataques.\n\n#Artigo XIII\n1. Toda pessoa tem direito à liberdade de locomoção e residência dentro das fronteiras de cada Estado.\n2. Toda pessoa tem o direito de deixar qualquer país, inclusive o próprio, e a este regressar.\n\n#Artigo XIV \n1. Toda pessoa, vítima de perseguição, tem o direito de procurar e de gozar asilo em outros países.\n2. Este direito não pode ser invocado em caso de perseguição legitimamente motivada por crimes de direito comum ou por atos contrários aos propósitos e princípios das Nações Unidas.\n\n#Artigo XV\n1. Toda pessoa tem direito a uma nacionalidade.\n2. Ninguém será arbitrariamente privado de sua nacionalidade, nem do direito de mudar de nacionalidade.\n\n#Artigo XVI \n1. Os homens e mulheres de maior idade, sem qualquer restrição de raça, nacionalidade ou religião, têm o direito de contrair matrimônio e fundar uma família. Gozam de iguais direitos em relação ao casamento, sua duração e sua dissolução.\n2. O casamento não será válido senão com o livre e pleno consentimento dos nubentes.\n\n#Artigo XVII \n1. Toda pessoa tem direito à propriedade, só ou em sociedade com outros.\n2. Ninguém será arbitrariamente privado de sua propriedade.\n\n#Artigo XVIII \nToda pessoa tem direito à liberdade de pensamento, consciência e religião; este direito inclui a liberdade de mudar de religião ou crença e a liberdade de manifestar essa religião ou crença, pelo ensino, pela prática, pelo culto e pela observância, isolada ou coletivamente, em público ou em particular.\n\n#Artigo XIX\nToda pessoa tem direito à liberdade de opinião e expressão; este direito inclui a liberdade de, sem interferência, ter opiniões e de procurar, receber e transmitir informações e ideias por quaisquer meios e independentemente de fronteiras.\n\n#Artigo XX\n1. Toda pessoa tem direito à liberdade de reunião e associação pacíficas.\n2. Ninguém pode ser obrigado a fazer parte de uma associação.\n\n#Artigo XXI \n1. Toda pessoa tem o direito de tomar parte no governo de seu país, diretamente ou por intermédio de representantes livremente escolhidos.\n2. Toda pessoa tem igual direito de acesso ao serviço público do seu país.\n3. A vontade do povo será a base da autoridade do governo; esta vontade será expressa em eleições periódicas e legítimas, por sufrágio universal, por voto secreto ou processo equivalente que assegure a liberdade de voto.\n\n#Artigo XXII \nToda pessoa, como membro da sociedade, tem direito à segurança social e à realização, pelo esforço nacional, pela cooperação internacional e de acordo com a organização e recursos de cada Estado, dos direitos econômicos, sociais e culturais indispensáveis à sua dignidade e ao livre desenvolvimento da sua personalidade.\n\n#Artigo XXIII \n1. Toda pessoa tem direito ao trabalho, à livre escolha de emprego, a condições justas e favoráveis de trabalho e à proteção contra o desemprego.\n2. Toda pessoa, sem qualquer distinção, tem direito a igual remuneração por igual trabalho.\n3. Toda pessoa que trabalhe tem direito a uma remuneração justa e satisfatória, que lhe assegure, assim como à sua família, uma existência compatível com a dignidade humana, e a que se acrescentarão, se necessário, outros meios de proteção social.\n4. Toda pessoa tem direito a organizar sindicatos e neles ingressar para proteção de seus interesses.\n\n#Artigo XXIV \nToda pessoa tem direito a repouso e lazer, inclusive a limitação razoável das horas de trabalho e férias periódicas remuneradas.\n\n#Artigo XXV \n1. Toda pessoa tem direito a um padrão de vida capaz de assegurar a si e a sua família saúde e bem estar, inclusive alimentação, vestuário, habitação, cuidados médicos e os serviços sociais indispensáveis, e direito à segurança em caso de desemprego, doença, invalidez, viuvez, velhice ou outros casos de perda dos meios de subsistência fora de seu controle.\n2. A maternidade e a infância têm direito a cuidados e assistência especiais. Todas as crianças nascidas dentro ou fora do matrimônio gozarão da mesma proteção social.\n\n#Artigo XXVI \n1. Toda pessoa tem direito à instrução. A instrução será gratuita, pelo menos nos graus elementares e fundamentais. A instrução elementar será obrigatória. A instrução técnico-profissional será acessível a todos, bem como a instrução superior, esta baseada no mérito.\n2. A instrução será orientada no sentido do pleno desenvolvimento da personalidade humana e do fortalecimento do respeito pelos direitos humanos e pelas liberdades fundamentais. A instrução promoverá a compreensão, a tolerância e a amizade entre todas as nações e grupos raciais ou religiosos, e coadjuvará as atividades das Nações Unidas em prol da manutenção da paz.\n3. Os pais têm prioridade de direito à escolha do gênero de instrução que será ministrada a seus filhos.\n\n#Artigo XXVII \n1. Toda pessoa tem o direito de participar livremente da vida cultural da comunidade, de fruir as artes e de participar do processo científico e de seus benefícios.\n2. Toda pessoa tem direito à proteção dos interesses morais e materiais decorrentes de qualquer produção científica, literária ou artística da qual seja autor.\n\n#Artigo XXVIII \nToda pessoa tem direito a uma ordem social e internacional em que os direitos e liberdades estabelecidos na presente Declaração possam ser plenamente realizados.\n\n#Artigo XXIX \n1. Toda pessoa tem deveres para com a comunidade, em que o livre e pleno desenvolvimento de sua personalidade é possível.\n2. No exercício de seus direitos e liberdades, toda pessoa estará sujeita apenas às limitações determinadas pela lei, exclusivamente com o fim de assegurar o devido reconhecimento e respeito dos direitos e liberdades de outrem e de satisfazer às justas exigências da moral, da ordem pública e do bem-estar de uma sociedade democrática.\n3. Esses direitos e liberdades não podem, em hipótese alguma, ser exercidos contrariamente aos propósitos e princípios das Nações Unidas.\n\n#Artigo XXX \nNenhuma disposição da presente Declaração pode ser interpretada como o reconhecimento a qualquer Estado, grupo ou pessoa, do direito de exercer qualquer atividade ou praticar qualquer ato destinado à destruição de quaisquer dos direitos e liberdades aqui estabelecidos.",
			"added": 1552695804
		},
		{
			"topic_id": 6,
			"title": "Xadrez ajuda detentos a 'se libertarem' de prisão no ES",
			"body": "- 'Xadrez que Liberta' foi eleito o melhor projeto socioesportivo do mundo.\n- Mais de 3.500 detentos em 32 unidades praticam a atividade no estado.\n\n\n Condenado a 30 anos de prisão por assaltos à mão armada, o detento Rodrigo da Silva de 27 anos, está aprendendo a repensar e a raciocinar com a ajuda de peças e um tabuleiro de xadrez, dentro das grandes da Penitenciária de Segurança Máxima 1, em Viana, na Grande Vitória. Ele faz parte do ‘Xadrez que Liberta’, melhor projeto socioesportivo do mundo, eleito no último mês no Canadá. De acordo com a secretaria Estadual de Justiça (Sejus), a atividade é aplicada para mais de 3.500 detentos em 32 unidades prisionais do Espírito Santo .\n\n\n “Depois que comecei jogar percebi que antes de tomar uma decisão na minha vida tenho que pensar direito, para saber se a minha decisão está correta. O xadrez é isso, ajuda a gente a pensar antes de tomar qualquer atitude ou jogar qualquer pedra errada. Por causa das atitudes precipitadas é que nós viemos parar neste lugar. Nesse jogo eu não quero perder, não quero levar o xeque-mate como levei lá fora”, explicou o Rodrigo.\n\n#Mudança de vida\n\n Experiente com trabalhos na construção civil, Cristiano Assis, de 34 anos, quer mudar de vida. Atrás das grades há sete anos, e há três dedicados ao xadrez, o interno pensa em ser professor de matemática ou física. Assis foi condenado por tráfico de drogas e prefere não falar muita em sua vida, que segundo ele, ficou no passado.\n\n\n “As jogadas do xadrez são parecidas com as ‘jogadas’ e decisões que tomamos na nossa vida. Às vezes nós temos que desviar de vários obstáculos para alcançar alguma coisa. No jogo também é assim, vence quem chegar lá em cima. No tabuleiro, um peão pode se tornar uma peça mais forte, de acordo com as jogadas que fizer e dependendo da pedra que mover. Na vida real também é assim. Podemos ser o que nós quisermos, professor, doutor, executivo, basta correr atrás, ter força de vontade e trabalhar”, relatou.\n\n#Exemplo para o mundo\n\n ‘Xadrez que Liberta’, concorreu com 140 projetos de diferentes modalidades esportivas de diversos países e ganhou o prêmio Spirit of Sports. A premiação é concedida pela Sportaccord, órgão que reúne federações esportivas internacionais como a Federação Internacional de Futebol (Fifa) e o Comitê Olímpico Internacional (COI).\n\nNo último dia 8, representantes da Confederação Brasileira de Xadrez (CBX), apresentaram o projeto a subsecretária Geral e Diretora Executiva da Organização das Nações Unidas (ONU) Mulheres, Michelle Bachelet, na sede da organização, em Nova Iorque, nos Estados Unidos. O objetivo de Bachelet é levar a iniciativa capixaba para todos os presídios femininos do mundo.\n\n#Filhos\n\n O crime também afastou da família o trocador de ônibus e operador de máquinas Elson Xavier. Ele tem 34 anos e cinco filhos. Para se distrair, o detento disputa partidas de xadrez com os companheiros de cela, mas sua maior vontade era estar em casa.\n\n\n “Fiz coisas erradas e por isso estou aqui. Tenho consciência que tenho a oportunidade de mudar. Todas às vezes, que espero meu companheiro mover a peça, reflito, penso e me perco em meus pensamentos. Se eu estivesse só lá no outro ‘xadrez’, lá na cela, meus pensamentos poderiam não ser tão positivos. Esse jogo tem vários objetivos e preenche a nossa mente”, disse.\n\n#O projeto\n\n 'Xadrez que Liberta' é uma parceria entre a Secretaria Estadual de Justiça e a Confederação Brasileira de Xadrez, e existe desde 2008. O vice-presidente da confederação, Charles Moura Netto, que participou da implementação no Espírito Santo, disse que objetivo das ações vão muito além dos movimentos no tabuleiro.\n\n\n \"Trabalhamos o xadrez não como fim, mas como meio de reflexão, de atitude, de ética, de moralidade. Isso não quer dizer que torna o indivíduo mais inteligente, na verdade só aguça valores que nós já temos e que são natos. Isso pode se mais intenso para essas pessoas que estão privados da liberdade\", explica Neto.\n\n\n O vice-presidente da confederação disse ainda que o xadrez é um esporte diferente por que trabalha com o intelectual, a possibilidade de resolver problemas, autonomia e tomada de decisões e pode ser realizado em qualquer espaço físico.\n\n- Fonte: http://g1.globo.com/espirito-santo/noticia/2012/06/xadrez-ajuda-detentos-se-libertarem-de-prisao-no-es.html",
			"added": 1552706458
		},
		{
			"topic_id": 7,
			"title": "Xadrez melhora desempenho de alunos de Sorocaba em matemática",
			"body": "- Além de melhorar o desempenho na disciplina, alunos passaram a se destacar em competições na modalidade\n\nEm 2007, o professor de matemática Sandro Sanches Corralero, da Escola Estadual Brigadeiro Tobias, em Sorocaba, resolveu utilizar o xadrez em sala de aula para despertar nos alunos um maior interesse no aprendizado da disciplina. O objetivo era mostrar aos estudantes que o estudo da matemática também poderia ser divertido e desafiador como o jogo. “A intenção era quebrar aquele estigma de que aula de matemática é chata e também motivá-los a praticar o jogo, que é um excelente exercício de raciocínio”, diz Corralero, comentando que no início do projeto, a grande maioria dos alunos, provenientes da periferia de Sorocaba, não conhecia o xadrez.\n\nAssim, o professor passou a dedicar uma aula de sua grade semanal para ensinar noções básicas do jogo a alunos do Ciclo II do Ensino Fundamental. Com o tempo, os estudantes criaram gosto pelo xadrez e quiserem se aprofundar. Como incentivo, a escola adquiriu material para a prática (tabuleiro, peças e relógio), além de livros sobre a modalidade para consulta, e criou um grupo de treinamento dentro da programação de Atividades Curriculares Desportivas (ACD) da unidade. As ACDs são oferecidas gratuitamente pelas escolas da rede estadual, coordenadas por professores de educação física, e acontecem em horários alternados às aulas regulares para aprofundamento nas modalidades esportivas escolhidas pelos alunos.\n\nO incentivo rendeu frutos, não só no que diz respeito à prática do jogo, mas também em relação ao desempenho dos alunos em sala de aula. “Dentre os que aprenderam xadrez, houve uma melhora de 30 a 40% em matemática”, salientou o professor, que atua na rede estadual desde 1994 e leciona na mesma escola há cerca de 10 anos.\n\nJosé Nelson dos Santos Júnior, de 14 anos, aluno do 9º ano do Ensino Fundamental, está entre os estudantes que apresentou significativa melhora em matemática. “O xadrez me ajudou a raciocinar melhor, ter paciência e concentração para resolver os problemas”, comenta o aluno.\n\nA escola também passou a ser destaque em competições na modalidade. Recentemente, a aluna Wiviany Maria Monteiro Cruz, de 13 anos, também do 9º ano, conquistou o título de campeã na categoria sub-14 da primeira etapa do Circuito de Xadrez Escolar Estadual 2010, organizado pela Federação Paulista de Xadrez (FPX). “Aprendi a jogar xadrez aqui na escola, mas não esperava imaginava poder disputar um campeonato. Mas foi muito bom, principalmente para meu desenvolvimento pessoal, pois estimula a inteligência e ajuda no aprendizado”, conta a estudante.\n\nAlém de Wiviany, outros sete alunos da Brigadeiro Tobias participaram da competição, sendo que três também conquistaram medalhas. Atualmente, mais de 200 estudantes do 8º e 9 º anos do Ensino Fundamental e 1º ano do Ensino Médio praticam a modalidade na escola nas aulas de matemática e nas ACDs.\n\n#Bom desempenho no Saresp\n\nEm 2009, o Sistema de Avaliação de Rendimento Escolar do Estado de São Paulo (Saresp) indicou uma melhora generalizada em matemática no Ensino Fundamental da rede estadual. A média na quarta série apresentou um avanço expressivo de 10,8 pontos, saltando de 190,5 em 2008 para 201,3 em 2009. Na oitava série, a média avançou 5,8 pontos, de 245,7 em 2008 para 251,5 em 2009.\n\n- Fonte: http://www.educacao.sp.gov.br/noticias/xadrez-melhora-desempenho-de-alunos-de-sorocaba-em-matematica/",
			"added": 1552706549
		}
	],
	"topic_vote": {
		"1_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"2_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_1NwNEQ5bQSQdBRPbYJ9bi9Cryy1Jb9Pg5a": 1,
		"3_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"4_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": 1,
		"5_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"6_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"7_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1
	},
	"next_comment_id": 21,
	"comment": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 1,
				"body": "#Projeto Zeta\nProjeto Zeta conta a história do sintozóide (um robô com forma humana), programado para ser uma unidade de infiltração para matar em nome do governo americano, porém ao abortar uma missão ele passa a ser perseguido pela NSA (Agência de Segurança Nacional, sigla em inglês), liderada pelo agente James Bennet, que o considera um traidor. Em meio à fuga, Zeta conhece Rosalie Rowen, uma adolescente órfã e delinqüente, que passa a ser sua melhor amiga, e ambos saem em busca de Eli Selig, arquiteto do “Projeto Zeta” e único que pode provar sua inocência.\n\n- https://www.superanimes.site/cartoon/projeto-zeta",
				"added": 1552674494
			},
			{
				"comment_id": 2,
				"body": "#Yakusoku No Neverland\n\nUm grupo de crianças mais inteligentes de um orfanato aparentemente perfeito descobre sua obscura verdade quando infringem a regra de nunca deixar o orfanato. Uma vez que a verdade é descoberta, eles começam a planejar uma fuga para salvar todas as crianças.\n\n- https://www.superanimes.site/anime/yakusoku-no-neverland",
				"added": 1552674743
			},
			{
				"comment_id": 3,
				"body": "#Tate No Yuusha No Nariagari\nIwatani Naofumi foi convocado para um mundo paralelo junto com outras 3 pessoas para se tornarem os Heroes do mundo. Cada um dos heróis ao serem convocados recebeu um equipado lendário dado aos Heroes que salvariam aquele mundo. Naofumi passou a receber o Legendary Shield, o único equipamento defensivo, enquanto os outros receberam armas capazes de atacar. Devido à falta de carisma e experiência de Naofumi, ele acabou com apenas um único companheiro de equipe, uma mulher bonita, enquanto outros tiveram vários. Infelizmente, no terceiro dia, Naofumi foi traído, falsamente acusado e roubado pela sua unica colega de Equipe. Após o decreto do Rei, vários rumores falsos se espalharam por toda parte sobre o Heroi do escudo. Agora Naofumi terá que lidar com uma vida difícil sendo odiado em outro mundo, em quanto luta para sobreviver e se fortalecer.\n\n\n- https://www.superanimes.site/anime/tate-no-yuusha-no-nariagari",
				"added": 1552674835
			},
			{
				"comment_id": 4,
				"body": "#Black Clover\n\nNeste mundo, magia é tudo... A algum tempo atrás, a humanidade foi quase aniquilada pelos demônios... Em seu resgate surgiu aquele que futuramente ficaria conhecido como Mago Imperador, o mais poderoso mago do Reino Clover. Anos depois, sonhando em se tornarem o Mago Imperador, dois órfãos pobres Yuno e Asta fazem uma promessa que um deles alcançaria esse sonho. Yuno é o gênio dentre os dois, reverenciado por todos a sua volta com uma poderosa magia de vento. Asta mesmo se esforçando todos os dias, não possui qualquer magia... Mas tudo muda no dia em que ambos receberiam a prova de que são verdadeiros magos... O dia de receberem seus grimórios!\n\n\n- https://www.superanimes.site/anime/black-clover",
				"added": 1552674912
			}
		],
		"4_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": [
			{
				"comment_id": 5,
				"body": "#Documentário - Jogos da antiguidade - Go e Xadrez Chines\n- https://youtu.be/YMVaUN0YAXc",
				"added": 1552681980
			},
			{
				"comment_id": 6,
				"body": "#Jogar Go Online:\nKGS: http://www.gokgs.com/\nOGS: https://online-go.com/\nTygem: http://www.tygemgo.com/\nWbaduk: http://wbaduk.com/\nIGS: http://www.pandanet-igs.com/\nDGS: http://www.dragongoserver.net/\nLKGS – http://www.lanke.cc/homeen.html\nFly or Die: http://www.flyordie.com/\nPlayOk – http://www.playok.com/pt/go/",
				"added": 1552682024
			},
			{
				"comment_id": 7,
				"body": "#Como Jogar Go: https://www.youtube.com/playlist?list=PLMYMhzMuvitTuMStuJUqNbmgbXCvpNRHe\n#Fundamentos de Go: https://www.youtube.com/playlist?list=PLMYMhzMuvitTWMeo_jEeAYOe8jKDTrdWm",
				"added": 1552682265
			},
			{
				"comment_id": 8,
				"body": "Go - aplicativo para Android\n- https://play.google.com/store/apps/details?id=uk.co.aifactory.gofree",
				"added": 1552682337
			},
			{
				"comment_id": 9,
				"body": "#Uma breve introdução às regras e técnicas básicas de Go\n\n- https://go.alamino.net/aprendajogargo/",
				"added": 1552682423
			},
			{
				"comment_id": 14,
				"body": "#Combinatória do Go\n- https://web.archive.org/web/20180716000048/https://tromp.github.io/go/gostate.pdf",
				"added": 1552698958
			},
			{
				"comment_id": 16,
				"body": "#Como Jogar Go\nGo é um jogo no qual dos jogadores disputam o território; é talvez o mais antigo jogo de tabuleiro no mundo. As regras são simples e você pode aprendê-las em minutos. Muitos entusiastas consideram Go uma arte; o jogo tem tantas variações que até mesmo os computadores mais avançados têm dificuldades em jogá-lo. Aprender a jogar é fácil, mas aprender a jogar bem leva tempo e treino. Continue a ler para se familiarizar com esse jogo antigo, intrigante e inteligente.\n\n- https://pt.wikihow.com/Jogar-Go",
				"added": 1552701005
			},
			{
				"comment_id": 20,
				"body": "O Go originou-se na China e suas primeiras referências conhecidas datam do século VI a.C (548 a.C., Zuo Zhuan). Alguns estudiosos acreditam que o tabuleiro tenha evoluído de algum utensílio utilizado para marcar datas e épocas do ano. Uma lenda, no entanto, afirma que o jogo foi criado como um instrumento do imperador Yao (2337 - 2258 a.C.) para educar seu filho Danzhu na disciplina, na concentração e no equilíbrio. Outros acreditam que o jogo tenha sido criado com propósitos divinatórios, para controle de enchentes ou ainda para simbolizar a ordem cosmológica. O jogo também teria sido usado por generais chineses para estabelecer estratégias de guerra.\n\nO jogo foi introduzido no Japão em 735 por um monge budista chamado Kibi Dajin, logo tornando-se popular entre as diversas classes sociais. Foi no Japão que suas regras tornaram-se consistentes, sendo também esse o primeiro país a estabelecer um sistema de jogadores profissionais com rankings e classificações. Em 1924, foi fundada no Japão a Nihon Ki-in, uma academia com caráter acadêmico e federativo voltado para a propagação do Go através de torneios e concessão de títulos aos jogadores.\n\n- Fonte: https://pt.wikipedia.org/wiki/Go",
				"added": 1552708316
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 10,
				"body": "#O que exatamente é o problema P versus NP?\n\nNas ciências da computação, problemas fáceis costumam estar sob a forma de P. Isso significa que eles podem ser resolvidos em um \"tempo polinomial\". É praticamente como dizer que eles podem ser resolvidos em um período de tempo razoável. Os problemas muito mais complicados são os NP, incapazes de resolver por um computador em um período de tempo razoável. Por razões práticas, os problemas NP podem até nem ser resolvidos por computadores. (Observação: entretanto, o NP significa \"tempo polinomial não determinístico\" em vez de tempo \"não polinomial\".) \n\n#Seguem alguns exemplos de problemas NP:\n\n- Envelopamento de proteínas: é o processo pelo qual proteínas em um organismo biológico obtêm sua estrutura. Uma compreensão melhor desse processo poderia ajudar no reconhecimento das mutações, ou mesmo impedi-las, possibilitando a cura de certas formas de câncer.\n\n- Otimizar percursos: uma viagem com o melhor percurso possível através de 15 cidades diferentes sem passar pela mesma cidade duas vezes? Problema difícil de resolver, mesmo para um computador, por isso que na ciência da computação é considerado um problema NP.\n\n- A partida de xadrez perfeita: uma partida de xadrez têm infinitas possibilidades de movimentos, tanto que mesmo um supercomputador com capacidade extraordinária não é capaz de determinar uma tática perfeita. Muitos matemáticos consideram esse problema tão difícil que nem o consideram problema NP, mas o colocam completamente fora do âmbito de possibilidades.\n\nTodos esses problemas complexos têm algo em comum: por mais difícil que seja encontrar uma solução para os problemas NP, é relativamente fácil verificar a validade das soluções propostas a elas.\n\nEssas duas distinções categóricas na complexidade dos problemas têm suas origens muito antes da popularização dos computadores pessoais. Nos anos 1970, quando os computadores ainda tinham o tamanho de um refrigerador, determinou-se rapidamente que nem todos os problemas da humanidade poderiam ser simplesmente resolvidos por essas máquinas. Propôs-se que a distinção poderia ser formalizada em termos de complexidade computacional, levando à organização de classes de complexidade, incluindo a N e NP.\n\nDesde a definição formal de P e NP em 1971, cientistas da computação debateram a possibilidade ou não de haver um algoritmo capaz de reduzir ou redefinir problemas NP de forma que pudessem ser resolvidos em tempo polinomial. Se alguém conseguisse provar que todos os problemas NP são, no fim das contas, variações de problemas P, então todos os problemas NP estariam, em essência, sujeitos ao mesmo tipo de redução. Em outras palavras, aquele ou aquela que conhecer a melhor tática para o Super Mario Bros. também poderá curar o câncer. \n\nNo total, 116 pessoas corajosas em suas áreas tentaram oficialmente resolver o mistério (sem contar que muitos cientistas da computação postaram possíveis soluções em mensagens e comentários de sites como o arXiv). Até o momento, nenhuma dessas resoluções foi reconhecida oficialmente pela comunidade matemática.\n\n- Fonte: https://www.vice.com/pt_br/article/evvwzk/alemao-diz-ter-resolvido-um-dos-maiores-problemas-da-ciencia-da-computacao",
				"added": 1552690212
			},
			{
				"comment_id": 15,
				"body": "#Teorema de Zermelo (teoria dos jogos)\n\nNa teoria dos jogos, o teorema de Zermelo, em homenagem a Ernst Zermelo, diz que em qualquer jogo finito de informação perfeita em que os jogadores se movem alternadamente e em que o acaso não afeta o processo de tomada de decisão, se o jogo não pode terminar em empate , então um dos dois jogadores deve ter uma estratégia vencedora (ou seja, forçar uma vitória). Pode-se dizer alternadamente que em um jogo como esse, o primeiro jogador pode forçar uma vitória, ou o segundo jogador pode forçar uma vitória, ou ambos os jogadores podem forçar um empate.\n\n- https://web.archive.org/web/20180721163836/http://www.math.harvard.edu/~elkies/FS23j.03/zermelo.pdf\n- https://web.archive.org/web/20190316012607/http://www.ime.unicamp.br/~rigas/topolmujica/14.pdf\n- https://web.archive.org/web/20170116183415/https://hkumath.hku.hk/~ntw/EMB(giftedstudents_6-April-2008).pdf",
				"added": 1552699615
			},
			{
				"comment_id": 19,
				"body": "#Como a matemática ajudou a construir o Império Chinês e imperador a dormir com 121 mulheres em 15 dias\n\n- Da medição do tempo à navegação marítima, a matemática era essencial para as antigas civilizações.\n\nA jornada da matemática começou no Egito, na Mesopotâmia e na Grécia, mas após o declínio dessas civilizações, estagnou no Ocidente.\n\nNo Oriente, entretanto, ela alcançaria novos e dinâmicos picos.\n\nNa China antiga, a matemática foi fundamental nos cálculos que permitiram a construção da Grande Muralha, que se estendia por milhares de quilômetros.\n\nOs números eram tão importantes que tinham um papel vital nos afazeres da corte imperial.\n\n#Planejamento amoroso matemático\nO calendário e o movimento dos planetas influenciavam todas as decisões do imperador, até a forma como seus dias e suas noites eram planejados.\n\nConselheiros imperiais criaram um sistema para garantir que o imperador fizesse sexo com um grande número de mulheres de seu harém.\n\nEle era baseado em um conceito matemático chamado de progressão geométrica. A ideia era permitir que o imperador dormisse com 121 mulheres no espaço de 15 dias.\n\n#As mulheres eram divididas em grupos:\n\n- A imperatriz\n\n- 3 consortes\n\n- 9 esposas\n\n- 27 concubinas\n\n- 81 escravas\n\nCada grupo de mulheres era três vezes maior do que o grupo anterior, então os matemáticos calculavam uma rota para que, no espaço de 15 noites, todas as mulheres do harém passassem pela cama do imperador.\n\nA primeira noite era reservada para a imperatriz. A seguinte, para as três consortes. As nove esposas vinham depois, e nos dias seguintes as 27 concubinas eram escolhidas em um sistema de revezamento, nove por noite.\n\nE no final, durante um período de nove noites, era a vez das 81 escravas, em grupos de nove.\n\nO roteiro garantia que o imperador dormisse com as mulheres de maior status mais perto da lua cheia, para que a força feminina delas (o yin) estivesse no auge e pudesse estar à altura da força masculina do soberano (o yang).\n\nSer o soberano com certeza exigia energia, mas o objetivo era claro – conseguir a melhor sucessão imperial possível.\n\nE não era apenas a corte do imperador que dependia da matemática. Ela era central também na administração do Estado.\n\n#Fascinação matemática\n\nA China antiga era um império vasto, em crescimento, com um código legal rigoroso, cobrança de impostos, e um sistema padronizado de pesos, medidas e dinheiro.\n\nO império usava o sistema decimal cerca de mil anos antes do Ocidente adotá-lo, e resolviam equações que só surgiriam no outro lado do mundo no início do século 19.\n\nA mitologia chinesa diz que o primeiro soberano da China, o Imperador Amarelo, fez com que uma de suas divindades criasse a matemática no ano 2800 a.C., pois acreditava que os números tinham um significado cósmico.\n\nAté hoje, a cultura chinesa mantém crenças no poder místico dos números.\n\nNúmeros ímpares são vistos como \"masculinos\", os números pares, como \"femininos\". O número quatro deve ser evitado a todo custo. O número oito traz boa sorte.\n\nOs antigos chineses eram fascinados por padrões em números, e desenvolveram sua própria versão do jogo sudoku.\n\nNo século 6, o teorema do resto chinês já estava sendo usado na astronomia chinesa para medir movimentos planetários – e até hoje ele tem usos práticos, por exemplo, para criptografia na internet.\n\n- Fonte: https://www.bbc.com/portuguese/internacional-47320331",
				"added": 1552707196
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 11,
				"body": "#O Problema das N-Rainhas\nO problema das N-rainhas consiste em encontrar todas as combinações possíveis de N rainhas num tabuleiro de dimensão N por N tal que nenhuma das rainhas ataque qualquer outra. Duas rainhas atacam-se uma à outra quando estão na mesma linha, na mesma coluna ou na mesma diagonal do tabuleiro.\n\n- Código em Python: https://privatebin.net/?988f31039caf82cd#w6S9IDocWRVu6tkAQNtVCMZzGUYUgRNWxM2uayELyHE=\n\n- Código em Rust: https://privatebin.net/?3337244505bd0948#92KzsXbbFzQQhxYTs94qQ57YyMT3NM5H1tiLzU1sY6o=",
				"added": 1552692114
			}
		],
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 12,
				"body": "#A CARTA DE PERO VAZ DE CAMINHA\n\n \n\nSenhor:\n\nPosto que o Capitão-mor desta vossa frota, e assim os outros capitães escrevam a Vossa Alteza a nova do achamento desta vossa terra nova, que ora nesta navegação se achou, não deixarei também de dar disso minha conta a Vossa Alteza, assim como eu melhor puder, ainda que -- para o bem contar e falar -- o saiba pior que todos fazer.\n\nTome Vossa Alteza, porém, minha ignorância por boa vontade, e creia bem por certo que, para aformosear nem afear, não porei aqui mais do que aquilo que vi e me pareceu.\n\nDa marinhagem e singraduras do caminho não darei aqui conta a Vossa Alteza, porque o não saberei fazer, e os pilotos devem ter esse cuidado. Portanto, Senhor, do que hei de falar começo e digo:\n\nA partida de Belém, como Vossa Alteza sabe, foi segunda-feira, 9 de março. Sábado, 14 do dito mês, entre as oito e nove horas, nos achamos entre as Canárias, mais perto da Grã- Canária, e ali andamos todo aquele dia em calma, à vista delas, obra de três a quatro léguas. E domingo, 22 do dito mês, às dez horas, pouco mais ou menos, houvemos vista das ilhas de Cabo Verde, ou melhor, da ilha de S. Nicolau, segundo o dito de Pero Escolar, piloto.\n\nNa noite seguinte, segunda-feira, ao amanhecer, se perdeu da frota Vasco de Ataíde com sua nau, sem haver tempo forte nem contrário para que tal acontecesse. Fez o capitão suas diligências para o achar, a uma e outra parte, mas não apareceu mais!\n\nE assim seguimos nosso caminho, por este mar, de longo, até que, terça-feira das Oitavas de Páscoa, que foram 21 dias de abril, estando da dita Ilha obra de 660 ou 670 léguas, segundo os pilotos diziam, topamos alguns sinais de terra, os quais eram muita quantidade de ervas compridas, a que os mareantes chamam botelho, assim como outras a que dão o nome de rabo-de-asno. E quarta-feira seguinte, pela manhã, topamos aves a que chamam fura-buxos.\n\nNeste dia, a horas de véspera, houvemos vista de terra! Primeiramente dum grande monte, mui alto e redondo; e doutras serras mais baixas ao sul dele; e de terra chã, com grandes arvoredos: ao monte alto o capitão pôs nome – o Monte Pascoal e à terra – a Terra da Vera Cruz.\n\n \n\nMandou lançar o prumo. Acharam vinte e cinco braças; e ao sol posto, obra de seis léguas da terra, surgimos âncoras, em dezenove braças -- ancoragem limpa. Ali permanecemos toda aquela noite. E à quinta-feira, pela manhã, fizemos vela e seguimos\n\nem direitos à terra, indo os navios pequenos diante, por dezessete, dezesseis, quinze, catorze, treze, doze, dez e nove braças, até meia légua da terra, onde todos lançamos âncoras em frente à boca de um rio. E chegaríamos a esta ancoragem às dez\n\nhoras pouco mais ou menos.\n\nDali avistamos homens que andavam pela praia, obra de sete ou oito, segundo disseram os navios pequenos, por chegarem primeiro.\n\nEntão lançamos fora os batéis e esquifes, e vieram logo todos os capitães das naus a esta nau do Capitão-mor, onde falaram entre si.\n\nE o Capitão-mor mandou em terra no batel a Nicolau Coelho para ver aquele rio. E tanto que ele começou de ir para lá, acudiram pela praia homens, quando aos dois, quando aos três, de maneira que, ao chegar o batel à boca do rio, já ali havia dezoito ou vinte homens.\n\nEram pardos, todos nus, sem coisa alguma que lhes cobrisse suas vergonhas. Nas mãos traziam arcos com suas setas. Vinham todos rijos sobre o batel; e Nicolau Coelho lhes fez sinal que pousassem os arcos. E eles os pousaram.\n\nAli não pôde deles haver fala, nem entendimento de proveito, por o mar quebrar na costa. Somente deu-lhes um barrete\n\nvermelho e uma carapuça de linho que levava na cabeça e um sombreiro preto. Um deles deu-lhe um sombreiro de penas de ave, compridas, com uma copazinha de penas vermelhas e pardas como de papagaio; e outro deu-lhe um ramal\n\ngrande de continhas brancas, miúdas, que querem parecer de aljaveira, as quais peças creio que o Capitão manda a Vossa Alteza, e com isto se volveu às naus por ser tarde e não poder haver deles mais fala, por causa do mar.\n\nNa noite seguinte, ventou tanto sueste com chuvaceiros que fez caçar as naus, e especialmente a capitânia. E sexta pela manhã, às oito horas, pouco mais ou menos, por conselho dos pilotos, mandou o Capitão levantar âncoras e fazer vela; e fomos ao longo da costa, com os batéis e esquifes amarrados à popa na direção do norte, para ver se achávamos alguma abrigada e bom pouso, onde nos demorássemos, para tomar água e lenha. Não que nos minguasse, mas por aqui nos acertarmos.\n\nQuando fizemos vela, estariam já na praia assentados perto do rio obra de sessenta ou setenta homens que se haviam juntado ali poucos e poucos. Fomos de longo, e mandou o Capitão aos navios pequenos que seguissem mais chegados à terra e, se achassem pouso seguro para as naus, que amainassem.\n\nE, velejando nós pela costa, obra de dez léguas do sítio donde tínhamos levantado ferro, acharam os ditos navios pequenos um recife com um porto dentro, muito bom e muito seguro, com uma mui larga entrada. E meteram-se dentro e amainaram. As naus arribaram sobre eles; e um pouco antes do sol posto amainaram também, obra de uma légua do recife, e ancoraram em onze braças.\n\nE estando Afonso Lopes, nosso piloto, em um daqueles navios pequenos, por mandado do Capitão, por ser homem vivo e destro para isso, meteu-se logo no esquife a sondar o porto dentro; e tomou dois daqueles homens da terra, mancebos e de bons corpos, que estavam numa almadia. Um deles trazia um arco e seis ou sete setas; e na praia andavam muitos com seus arcos e setas; mas de nada lhes serviram. Trouxe-os logo, já de noite, ao Capitão, em cuja nau foram recebidos com muito prazer e festa.\n\nA feição deles é serem pardos, maneira de avermelhados, de bons rostos e bons narizes, bem-feitos. Andam nus, sem nenhuma cobertura. Nem estimam de cobrir ou de mostrar suas vergonhas; e nisso têm tanta inocência como em mostrar o rosto. Ambos traziam os beiços de baixo furados e metidos neles seus ossos brancos e verdadeiros, de comprimento\n\nduma mão travessa, da grossura dum fuso de algodão, agudos na ponta como um furador. Metem-nos pela parte de dentro do beiço; e a parte que lhes fica entre o beiço e os dentes é feita como roque de xadrez, ali encaixado de tal sorte que não os molesta, nem os estorva no falar, no comer ou no beber.\n\nOs cabelos seus são corredios. E andavam tosquiados, de tosquia alta, mais que de sobrepente, de boa grandura e rapados até por cima das orelhas. E um deles trazia por baixo da solapa, de fonte a fonte para detrás, uma espécie de cabeleira de penas de ave amarelas, que seria do comprimento de um coto, mui basta e mui cerrada, que lhe cobria o toutiço\n\ne as orelhas. E andava pegada aos cabelos, pena e pena, com uma confeição branda como cera (mas não o era), de maneira que a cabeleira ficava mui redonda e mui basta, e mui igual, e não fazia míngua mais lavagem para a levantar.\n\nO Capitão, quando eles vieram, estava sentado em uma cadeira, bem vestido, com um colar de ouro mui grande ao pescoço, e aos pés uma alcatifa por estrado. Sancho de Tovar, Simão de Miranda, Nicolau Coelho, Aires Correia, e nós outros que aqui na nau com ele vamos, sentados no chão, pela alcatifa. Acenderam-se tochas. Entraram. Mas não fizeram\n\nsinal de cortesia, nem de falar ao Capitão nem a ninguém. Porém um deles pôs olho no colar do Capitão, e começou de acenar com a mão para a terra e depois para o colar, como que nos dizendo que ali havia ouro. Também olhou para um castiçal de prata e assim mesmo acenava para a terra e novamente para o castiçal como se lá também houvesse prata.\n\nMostraram-lhes um papagaio pardo que o Capitão traz consigo; tomaram-no logo na mão e acenaram para a terra, como quem diz que os havia ali. Mostraram-lhes um carneiro: não fizeram caso. Mostraram-lhes uma galinha, quase tiveram medo dela: não lhe queriam pôr a mão; e depois a tomaram como que espantados.\n\nDeram-lhes ali de comer: pão e peixe cozido, confeitos, fartéis, mel e figos passados. Não quiseram comer quase nada daquilo; e, se alguma coisa provaram, logo a lançaram fora.\n\nTrouxeram-lhes vinho numa taça; mal lhe puseram a boca; não gostaram nada, nem quiseram mais. Trouxeram-lhes a água em uma albarrada. Não beberam. Mal a tomaram na boca, que lavaram, e logo a lançaram fora.\n\nViu um deles umas contas de rosário, brancas; acenou que lhas dessem, folgou muito com elas, e lançou-as ao pescoço. Depois tirou-as e enrolou-as no braço e acenava para a terra e de novo para as contas e para o colar do Capitão, como dizendo que dariam ouro por aquilo.\n\nIsto tomávamos nós assim por assim o desejarmos. Mas se ele queria dizer que levaria as contas e mais o colar, isto não o queríamos nós entender, porque não lho havíamos de dar. E depois tornou as contas a quem lhas dera.\n\nEntão estiraram-se de costas na alcatifa, a dormir, sem buscarem maneira de cobrirem suas vergonhas, as quais não eram fanadas; e as cabeleiras delas estavam bem rapadas e feitas. O Capitão lhes mandou pôr por baixo das cabeças seus coxins; e o da cabeleira esforçava-se por não a quebrar. E lançaram-lhes um manto por cima; e eles consentiram, quedaram-se e dormiram.\n\nAo sábado pela manhã mandou o Capitão fazer vela, e fomos demandar a entrada, a qual era mui larga e alta de seis a sete braças. Entraram todas as naus dentro; e ancoraram em cinco ou seis braças – ancoragem dentro tão grande, tão formosa e tão segura, que podem abrigar-se nela mais de duzentos navios e naus. E tanto que as naus quedaram ancoradas, todos os capitães vieram a esta nau do Capitão-mor. E daqui mandou o Capitão a Nicolau Coelho e Bartolomeu Dias que fossem em terra e levassem aqueles dois homens e os deixassem ir com seu arco e setas, e isto depois que fez dar a cada um sua camisa nova, sua carapuça vermelha e um rosário de contas brancas de osso, que eles levaram nos braços, seus cascavéis e suas campainhas. E mandou com eles, para lá ficar, um mancebo degredado, criado de D. João Telo, a que chamam Afonso Ribeiro, para lá andar com eles e saber de seu viver e maneiras. E a mim mandou que fosse com Nicolau Coelho.\n\nFomos assim de frecha direitos à praia. Ali acudiram logo obra de duzentos homens, todos nus, e com arcos e setas nas mãos. Aqueles que nós levávamos acenaram-lhes que se afastassem e pousassem os arcos; e eles os pousaram, mas não se afastaram muito. E mal pousaram os arcos, logo saíram os que nós levávamos, e o mancebo degredado com eles. E saídos não pararam mais; nem esperavam um pelo outro, mas antes corriam a quem mais corria. E passaram um rio que por ali corre, de água doce, de muita água que lhes dava pela braga; e outros muitos com eles. E foram assim correndo, além do rio, entre umas moitas de palmas onde estavam outros. Ali pararam. Entretanto foi-se o degredado com um homem que, logo ao sair do batel, o agasalhou e o levou até lá. Mas logo tornaram a nós; e com ele vieram os outros que nós leváramos, os quais vinham já nus e sem carapuças.\n\nEntão se começaram de chegar muitos. Entravam pela beira do mar para os batéis, até que mais não podiam; traziam cabaços de água, e tomavam alguns barris que nós levávamos: enchiam-nos de água e traziam-nos aos batéis. Não que eles de todos chegassem à borda do batel. Mas junto a ele, lançavam os barris que nós tomávamos; e pediam que lhes dessem alguma coisa. Levava Nicolau Coelho cascavéis e manilhas. E a uns dava um cascavel, a outros uma manilha, de maneira que com aquele engodo quase nos queriam dar a mão. Davam-nos daqueles arcos e setas por sombreiros e carapuças de linho ou\n\npor qualquer coisa que homem lhes queria dar.\n\nDali se partiram os outros dois mancebos, que os não vimos mais.\n\nMuitos deles ou quase a maior parte dos que andavam ali traziam aqueles bicos de osso nos beiços. E alguns, que andavam sem eles, tinham os beiços furados e nos buracos uns espelhos de pau, que pareciam espelhos de borracha; outros traziam três daqueles bicos, a saber, um no meio e os dois nos cabos. Aí andavam outros, quartejados de cores, a saber, metade deles da sua própria cor, e metade de tintura preta, a modos de\n\nazulada; e outros quartejados de escaques. Ali andavam entre eles três ou quatro moças, bem moças e bem gentis, com cabelos muito pretos, compridos pelas espáduas, e\n\nsuas vergonhas tão altas, tão cerradinhas e tão limpas das cabeleiras que, de as muito bem olharmos, não tínhamos nenhuma vergonha.\n\nAli por então não houve mais fala ou entendimento com eles, por a barbaria deles ser tamanha, que se não entendia nem ouvia ninguém.\n\nAcenamos-lhes que se fossem; assim o fizeram e passaram-se além do rio. Saíram três ou quatro homens nossos dos batéis, e encheram não sei quantos barris de água que nós levávamos e tornamo-nos às naus. Mas quando assim vínhamos, acenaram-nos que tornássemos. Tornamos e eles mandaram o degredado e não quiseram que ficasse lá com eles. Este levava uma bacia pequena e duas ou três carapuças vermelhas para lá as dar ao senhor, se o lá houvesse. Não cuidaram de lhe tomar nada, antes o mandaram com tudo. Mas então Bartolomeu Dias o fez outra vez tornar, ordenando que lhes desse aquilo. E ele tornou e o deu , à vista de nós, àquele que da primeira vez agasalhara. Logo voltou e nós trouxemo-lo.\n\nEsse que o agasalhou era já de idade, e andava por louçainha todo cheio de penas, pegadas pelo corpo, que parecia asseteado como S. Sebastião. Outros traziam carapuças de penas amarelas; outros, de vermelhas; e outros de verdes. E uma daquelas moças era toda tingida, de baixo a cima daquela tintura; e certo era tão bem-feita e tão redonda, e sua vergonha (que ela não tinha) tão graciosa, que a muitas mulheres da nossa terra, vendo-lhe tais feições, fizera vergonha, por não terem a sua como ela. Nenhum deles era fanado, mas, todos assim como nós. E com isto nos tornamos e eles foram-se.\n\nÀ tarde saiu o Capitão-mor em seu batel com todos nós outros e com os outros capitães das naus em seus batéis a folgar pela baía, em frente da praia. Mas ninguém saiu em terra, porque o Capitão o não quis, sem embargo de ninguém nela estar. Somente saiu -- ele com todos nós -- em um ilhéu grande, que na baía está e que na baixa-mar fica mui vazio. Porém é por toda a parte cercado de água, de sorte que ninguém lá pode ir, a não ser de barco ou a nado. Ali folgou ele e todos nós outros, bem uma hora e meia. E alguns marinheiros, que ali andavam com um chinchorro, pescaram peixe miúdo, não muito. Então volvemo-nos às naus, já bem de noite.\n\nAo domingo de Pascoela pela manhã, determinou o Capitão de ir ouvir missa e pregação naquele ilhéu. Mandou a todos os capitães que se aprestassem nos batéis e fossem com ele. E assim foi feito. Mandou naquele ilhéu armar um esperavel, e dentro dele um altar mui bem corregido. E ali com todos nós outros fez dizer missa, a qual foi dita pelo padre frei Henrique,\n\nem voz entoada, e oficiada com aquela mesma voz pelos outros padres e sacerdotes, que todos eram ali. A qual missa, segundo meu parecer, foi ouvida por todos com muito prazer e devoção.\n\nAli era com o Capitão a bandeira de Cristo, com que saiu de Belém, a qual esteve sempre levantada, da parte do Evangelho.\n\nAcabada a missa, desvestiu-se o padre e subiu a uma cadeira alta; e nós todos lançados por essa areia. E pregou uma solene e proveitosa pregação da história do Evangelho, ao fim da qual tratou da nossa vinda e do achamento desta terra, conformando-se com o sinal da Cruz, sob cuja obediência viemos, o que foi muito a propósito e fez muita devoção.\n\nEnquanto estivemos à missa e à pregação, seria na praia outra tanta gente, pouco mais ou menos como a de ontem, com seus arcos e setas, a qual andava folgando. E olhando-nos, sentaram-se. E, depois de acabada a missa, assentados nós à pregação, levantaram-se muitos deles, tangeram corno ou buzina, e começaram a saltar e dançar um pedaço. E\n\nalguns deles se metiam em almadias -- duas ou três que aí tinham -- as quais não são feitas como as que eu já vi; somente são três traves, atadas entre si. E ali se metiam quatro ou cinco, ou esses que queriam não se afastando quase nada da terra, senão enquanto podiam tomar pé.\n\nAcabada a pregação, voltou o Capitão, com todos nós, para os batéis, com nossa bandeira alta. Embarcamos e fomos todos em direção à terra para passarmos ao longo por onde eles estavam, indo, na dianteira, por ordem do Capitão, Bartolomeu Dias em seu esquife, com um pau de uma almadia que lhes o mar levara, para lho dar; e nós todos, obra de tiro de pedra, atrás dele.\n\nComo viram o esquife de Bartolomeu Dias, chegaram-se logo todos à água, metendo-se nela até onde mais podiam. Acenaram-lhes que pousassem os arcos; e muitos deles os iam logo pôr em terra; e outros não.\n\nAndava aí um que falava muito aos outros que se afastassem, mas não que a mim me parecesse que lhe tinham acatamento ou medo. Este que os assim andava afastando trazia seu arco e setas, e andava tinto de tintura vermelha pelos peitos, espáduas, quadris, coxas e pernas até baixo, mas os vazios com a barriga e estômago eram de sua própria cor. E a tintura era assim vermelha que a água a não comia nem desfazia, antes, quando saía da água, parecia mais vermelha.\n\nSaiu um homem do esquife de Bartolomeu Dias e andava entre eles, sem implicarem nada com ele para fazer-lhe mal. Antes lhe davam cabaças de água, e acenavam aos do esquife que saíssem em terra.\n\nCom isto se volveu Bartolomeu Dias ao Capitão; e viemo-nos às naus, a comer, tangendo gaitas e trombetas, sem lhes dar mais opressão. E eles tornaram-se a assentar na praia e assim por então ficaram.\n\nNeste ilhéu, onde fomos ouvir missa e pregação, a água espraia muito, deixando muita areia e muito cascalho a descoberto. Enquanto aí estávamos, foram alguns buscar marisco e apenas acharam alguns camarões grossos e curtos, entre os quais\n\nvinha um tão grande e tão grosso, como em nenhum tempo vi tamanho. Também acharam cascas de berbigões e amêijoas, mas não toparam com nenhuma peça inteira.\n\nE tanto que comemos, vieram logo todos os capitães a esta nau, por ordem do Capitão-mor, com os quais ele se apartou, e eu na companhia. E perguntou a todos se nos parecia bem mandar a nova do achamento desta terra a Vossa Alteza pelo navio dos mantimentos, para a melhor a mandar descobrir e saber dela mais do que nós agora podíamos saber, por irmos de nossa viagem.\n\nE entre muitas falas que no caso se fizeram, foi por todos ou a maior parte dito que seria muito bem. E nisto concluíram. E tanto que a conclusão foi tomada, perguntou mais se lhes parecia bem tomar aqui por força um par destes homens para os mandar a Vossa Alteza, deixando aqui por eles outros dois destes degredados.\n\nSobre isto acordaram que não era necessário tomar por força homens, porque era geral costume dos que assim levavam por força para alguma parte dizerem que há ali de tudo quanto lhes perguntam; e que melhor e muito melhor informação da terra dariam dois\n\nhomens destes degredados que aqui deixassem, do que eles dariam se os levassem, por ser gente que ninguém entende. Nem eles tão cedo aprenderiam a falar para o saberem tão bem dizer que muito melhor estoutros o não digam, quando Vossa Alteza cá mandar.\n\nE que, portanto, não cuidassem de aqui tomar ninguém por força nem de fazer escândalo, para de todo mais os amansar e apacificar, senão somente deixar aqui os dois degredados, quando daqui partíssemos.\n\nE assim, por melhor a todos parecer, ficou determinado.\n\nAcabado isto, disse o Capitão que fôssemos nos batéis em terra e ver-se-ia bem como era o rio, e também para folgarmos.\n\nFomos todos nos batéis em terra, armados e a bandeira conosco. Eles andavam ali na praia, à boca do rio, para onde nós íamos; e, antes que chegássemos, pelo ensino que dantes tinham, puseram todos os arcos, e acenavam que saíssemos. Mas, tanto que os batéis puseram as proas em terra, passaram-se logo todos além do rio, o qual não é mais largo que um jogo de mancal. E mal desembarcamos, alguns dos nossos passaram logo o rio, e meteram-se entre eles. Alguns aguardavam; outros afastavam-se. Era, porém, a coisa de maneira que todos andavam misturados. Eles ofereciam desses arcos com suas\n\nsetas por sombreiros e carapuças de linho ou por qualquer coisa que lhes davam.\n\nPassaram além tantos dos nossos, e andavam assim misturados com eles, que eles se esquivavam e afastavam-se. E deles alguns iam-se para cima onde outros estavam.\n\nEntão o Capitão fez que dois homens o tomassem ao colo, passou o rio, e fez tornar a todos.\n\nA gente que ali estava não seria mais que a costumada. E tanto que o Capitão fez tornar a todos, vieram a ele alguns daqueles, não porque o conhecessem por Senhor, pois me parece que não entendem, nem tomavam disso conhecimento, mas porque a gente nossa passava já para aquém do rio.\n\nAli falavam e traziam muitos arcos e continhas daquelas já ditas, e resgatavam-nas por qualquer coisa, em tal maneira que os nossos trouxeram dali para as naus muitos arcos e setas e contas.\n\nEntão tornou-se o Capitão aquém do rio, e logo acudiram muitos à beira dele.\n\nAli veríeis galantes, pintados de preto e vermelho, e quartejados, assim nos corpos, como nas pernas, que, certo, pareciam bem assim.\n\nTambém andavam, entre eles, quatro ou cinco mulheres moças, nuas como eles, que não pareciam mal. Entre elas andava uma com uma coxa, do joelho até o quadril, e a nádega, toda tinta daquela tintura preta; e o resto, tudo da sua própria cor. Outra trazia ambos os joelhos, com as curvas assim tintas, e também os colos dos pés; e suas vergonhas tão nuas e com tanta inocência descobertas, que nisso não havia nenhuma vergonha.\n\nTambém andava aí outra mulher moça com um menino ou menina ao colo, atado com um pano (não sei de quê) aos peitos, de modo que apenas as perninhas lhe apareciam. Mas as pernas da mãe e o resto não traziam pano algum.\n\nDepois andou o Capitão para cima ao longo do rio, que corre sempre chegado à praia. Ali esperou um velho, que trazia na mão uma pá de almadia. Falava, enquanto o Capitão esteve com ele, perante nós todos, sem nunca ninguém o entender, nem ele a nós\n\nquantas coisas que lhe demandávamos acerca de ouro, que nós desejávamos saber se na terra havia.\n\nTrazia este velho o beiço tão furado, que lhe caberia pelo furo um grande dedo polegar, e metida nele uma pedra verde, ruim, que cerrava por fora esse buraco. O Capitão lha fez tirar. E ele não sei que diabo falava e ia com ela direito ao Capitão, para lha meter na boca. Estivemos sobre isso rindo um pouco; e então enfadou-se o Capitão e deixou-o. E um dos nossos deu-lhe pela pedra um sombreiro velho, não por ela valer alguma coisa,\n\nmas por amostra. Depois houve-a o Capitão, segundo creio, para, com as outras coisas, a mandar a Vossa Alteza.\n\nAndamos por aí vendo a ribeira, a qual é de muita água e muito boa. Ao longo dela há muitas palmas, não muito altas, em que há muito bons palmitos. Colhemos e comemos deles muitos.\n\nEntão tornou-se o Capitão para baixo para a boca do rio, onde havíamos desembarcado.\n\nAlém do rio, andavam muitos deles dançando e folgando, uns diante dos outros, sem se tomarem pelas mãos. E faziam-no bem. Passou-se então além do rio Diogo Dias, almoxarife que foi de Sacavém, que é homem gracioso e de prazer; e levou consigo um gaiteiro nosso com sua gaita. E meteu-se com eles a dançar, tomando-os pelas mãos; e eles\n\nfolgavam e riam, e andavam com ele muito bem ao som da gaita. Depois de dançarem, fez-lhes ali, andando no chão, muitas voltas ligeiras, e salto real, de que eles se espantavam e riam e folgavam muito. E conquanto com aquilo muito os segurou e afagou, tomavam logo uma esquiveza como de animais monteses, e foram-se para cima.\n\nE então o Capitão passou o rio com todos nós outros, e fomos pela praia de longo, indo os batéis, assim, rente da terra. Fomos até uma lagoa grande de água doce, que está junto com a praia, porque toda aquela ribeira do mar é apaulada por cima\n\ne sai a água por muitos lugares.\n\nE depois de passarmos o rio, foram uns sete ou oito deles andar entre os marinheiros que se recolhiam aos batéis. E levaram dali um tubarão, que Bartolomeu Dias matou, lhes levou e lançou na praia.\n\nBastará dizer-vos que até aqui, como quer que eles um pouco se amansassem, logo duma mão para outra se esquivavam, como pardais, do cevadoiro. Homem não lhes ousa falar de rijo para não se esquivarem mais; e tudo se passa como eles querem, para os bem amansar.\n\nO Capitão ao velho, com quem falou, deu uma carapuça vermelha. E com toda a fala que entre ambos se passou e com a carapuça que lhe deu, tanto que se apartou e começou de passar o rio, foi-se logo recatando e não quis mais tornar de lá para aquém.\n\nOs outros dois, que o Capitão teve nas naus, a que deu o que já disse, nunca mais aqui apareceram – do que tiro ser gente bestial, de pouco saber e por isso tão esquiva. Porém e com tudo isso andam muito bem curados e muito limpos. E naquilo me parece ainda mais que são como aves ou alimárias monteses, às quais faz o ar melhor pena e melhor cabelo que às mansas, porque os corpos seus são tão limpos, tão gordos e tão formosos, que não\n\npode mais ser.\n\nIsto me faz presumir que não têm casas nem moradas a que se acolham, e o ar, a que se criam, os faz tais. Nem nós ainda até agora vimos nenhuma casa ou maneira delas.\n\nMandou o Capitão aquele degredado Afonso Ribeiro, que se fosse outra vez com eles. Ele foi e andou lá um bom pedaço, mas à tarde tornou-se, que o fizeram eles vir e não o quiseram lá consentir. E deram-lhe arcos e setas; e não lhe tomaram nenhuma coisa do seu. Antes – disse ele – que um lhe tomara umas continhas amarelas, que levava, e fugia com elas, e ele se queixou e os outros foram logo após, e lhas tomaram e tornaram-lhas a dar; e então mandaram-no vir. Disse que não vira lá entre eles senão umas choupaninhas de rama verde e de fetos muito grandes, como de Entre Douro e Minho.\n\nE assim nos tornamos às naus, já quase noite, a dormir.\n\nÀ segunda-feira, depois de comer, saímos todos em terra a tomar água. Ali vieram então muitos, mas não tantos como as outras vezes. Já muito poucos traziam arcos. Estiveram assim um pouco afastados de nós; e depois pouco a pouco misturaram-se conosco. Abraçavam-nos e folgavam. E alguns deles se esquivavam logo. Ali davam alguns arcos por folhas de papel e por alguma carapucinha velha ou por qualquer coisa. Em tal maneira isto se passou, que bem vinte ou trinta pessoas das nossas se foram com eles, onde outros muitos estavam com moças e mulheres. E trouxeram de lá muitos arcos e barretes de penas de aves, deles verdes e deles amarelos, dos quais, creio, o Capitão há de mandar amostra a Vossa Alteza.\n\nE, segundo diziam esses que lá foram, folgavam com eles. Neste dia os vimos mais de perto e mais à nossa vontade, por andarmos quase todos misturados. Ali, alguns andavam daquelas tinturas quartejados; outros de metades; outros de tanta feição, como em panos de armar, e todos com os beiços furados, e muitos com os ossos neles, e outros sem ossos.\n\nAlguns traziam uns ouriços verdes, de árvores, que, na cor, queriam parecer de castanheiros, embora mais pequenos. E eram cheios duns grãos vermelhos pequenos, que, esmagando-os entre os dedos, faziam tintura muito vermelha, de que eles\n\nandavam tintos. E quanto mais se molhavam, tanto mais vermelhos ficavam.\n\nTodos andam rapados até cima das orelhas; e assim as sobrancelhas e pestanas.\n\nTrazem todos as testas, de fonte a fonte, tintas da tintura preta, que parece uma fita preta, da largura de dois dedos.\n\nE o Capitão mandou aquele degredado Afonso Ribeiro e a outros dois degredados, que fossem lá andar entre eles; e assim a Diogo Dias, por ser homem ledo, com que eles folgavam. Aos degredados mandou que ficassem lá esta noite.\n\nForam-se lá todos, e andaram entre eles. E, segundo eles diziam, foram bem uma légua e meia a uma povoação, em que haveria nove ou dez casas, as quais eram tão compridas, cada uma, como esta nau capitânia. Eram de madeira, e das ilhargas de tábuas, e cobertas de palha, de razoada altura; todas duma só peça, sem nenhum repartimento, tinham dentro muitos esteios; e, de esteio a esteio, uma rede atada pelos cabos, alta, em que dormiam. Debaixo, para se aquentarem, faziam seus fogos. E tinha cada casa duas portas pequenas, uma num cabo, e outra no outro.\n\nDiziam que em cada casa se recolhiam trinta ou quarenta pessoas, e que assim os achavam; e que lhes davam de comer daquela vianda, que eles tinham, a saber, muito inhame e outras sementes, que na terra há e eles comem. Mas, quando se fez tarde\n\nfizeram-nos logo tornar a todos e não quiseram que lá ficasse nenhum. Ainda, segundo diziam, queriam vir com eles.\n\nResgataram lá por cascavéis e por outras coisinhas de pouco valor, que levavam, papagaios vermelhos, muito grandes e formosos, e dois verdes pequeninos e carapuças de penas verdes, e um pano de penas de muitas cores, maneira de tecido assaz formoso, segundo Vossa Alteza todas estas coisas verá, porque o Capitão vo-las há de mandar, segundo ele disse.\n\nE com isto vieram; e nós tornámo-nos às naus.\n\nÀ terça-feira, depois de comer, fomos em terra dar guarda de lenha e lavar roupa.\n\nEstavam na praia, quando chegamos, obra de sessenta ou setenta sem arcos e sem nada. Tanto que chegamos, vieram logo para nós, sem se esquivarem. Depois acudiram muitos, que seriam bem duzentos, todos sem arcos; e misturaram-se todos tanto conosco que alguns nos ajudavam a acarretar lenha e a meter nos batéis. E lutavam com os nossos e tomavam muito prazer.\n\nEnquanto cortávamos a lenha, faziam dois carpinteiros uma grande Cruz, dum pau, que ontem para isso se cortou.\n\nMuitos deles vinham ali estar com os carpinteiros. E creio que o faziam mais por verem a ferramenta de ferro com que a faziam, do que por verem a Cruz, porque eles não tem coisa que de ferro seja, e cortam sua madeira e paus com pedras feitas como cunhas, metidas em um pau entre duas talas, mui bem atadas e por tal maneira que andam fortes, segundo diziam os homens, que ontem a suas casas foram, porque lhas viram lá.\n\nEra já a conversação deles conosco tanta, que quase nos estorvavam no que havíamos de fazer.\n\nO Capitão mandou a dois degredados e a Diogo Dias que fossem lá à aldeia (e aoutras, se houvessem novas delas) e que, em toda a maneira, não viessem dormir às naus, ainda que eles os mandassem. E assim se foram.\n\nEnquanto andávamos nessa mata a cortar lenha, atravessavam alguns papagaios por essas árvores, deles verdes e outros pardos, grandes e pequenos, de maneira que me parece que haverá muitos nesta terra. Porém eu não veria mais que até nove ou dez. Outras aves então não vimos, somente algumas pombas-seixas, e pareceram-me bastante maiores\n\nque as de Portugal. Alguns diziam que viram rolas; eu não as vi. Mas, segundo os arvoredos são mui muitos e grandes, e de infindas maneiras, não duvido que por esse sertão haja muitas aves!\n\nCerca da noite nos volvemos para as naus com nossa lenha.\n\nEu creio, Senhor, que ainda não dei conta aqui a Vossa Alteza da feição de seus arcos e setas. Os arcos são pretos e compridos, as setas também compridas e os ferros delas de canas aparadas, segundo Vossa Alteza verá por alguns que – eu creio -- o Capitão a Ela há de enviar.\n\nÀ quarta-feira não fomos em terra, porque o Capitão andou todo o dia no navio dos mantimentos a despejá-lo e fazer levar às naus isso que cada uma podia levar. Eles acudiram à praia; muitos, segundo das naus vimos. No dizer de Sancho de Tovar, que lá foi, seriam obra de trezentos.\n\nDiogo Dias e Afonso Ribeiro, o degredado, aos quais o Capitão ontem mandou que em toda maneira lá dormissem, volveram-se, já de noite, por eles não quererem que lá ficassem. Trouxeram papagaios verdes e outras aves pretas, quase como pegas, a não ser que tinham o bico branco e os rabos curtos.\n\nQuando Sancho de Tovar se recolheu à nau, queriam vir com ele alguns, mas ele não quis senão dois mancebos dispostos e homens de prol. Mandou-os essa noite mui bem pensar e curar. Comeram toda a vianda que lhes deram; e mandou fazer-lhes cama de lençóis, segundo ele disse. Dormiram e folgaram aquela noite.\n\nE assim não houve mais este dia que para escrever seja.\n\nÀ quinta-feira, derradeiro de abril, comemos logo, quase pela manhã, e fomos em terra por mais lenha e água. E, em querendo o Capitão sair desta nau, chegou Sancho de Tovar com seus dois hóspedes. E por ele ainda não ter comido, puseram-lhe toalhas. Trouxeram-lhe vianda e comeu. Aos hóspedes, sentaram cada um em sua cadeira. E de tudo o que lhes deram comeram mui bem, especialmente lacão cozido, frio, e arroz.\n\nNão lhes deram vinho, por Sancho de Tovar dizer que o não bebiam bem.\n\nAcabado o comer, metemo-nos todos no batel e eles conosco. Deu um grumete a um deles uma armadura grande de porco montês, bem revolta. Tanto que a tomou, meteu-a logo no beiço, e, porque se lhe não queria segurar, deram-lhe uma pequena de cera vermelha. E ele ajeitou-lhe seu adereço detrás para ficar segura, e meteu-a no beiço, assim revolta para\n\ncima. E vinha tão contente com ela, como se tivesse uma grande jóia. E tanto que saímos em terra, foi-se logo com ela, e não apareceu mais aí.\n\nAndariam na praia, quando saímos, oito ou dez deles; e de aí a pouco começaram a vir mais. E parece-me que viriam, este dia, à praia quatrocentos ou quatrocentos e cinqüenta.\n\nTraziam alguns deles arcos e setas, que todos trocaram por carapuças ou por qualquer coisa que lhes davam. Comiam conosco do que lhes dávamos. Bebiam alguns deles vinho; outros o não podiam beber. Mas parece-me, que se lho avezarem, o beberão de boa vontade.\n\nAndavam todos tão dispostos, tão bem-feitos e galantes com suas tinturas, que pareciam bem. Acarretavam dessa lenha, quanta podiam, com mui boa vontade, e levavam-na aos batéis.\n\nAndavam já mais mansos e seguros entre nós, do que nós andávamos entre eles.\n\nFoi o Capitão com alguns de nós um pedaço por este arvoredo até uma ribeira grande e de muita água que, a nosso parecer, era esta mesma, que vem ter à praia, e em que nós tomamos água.\n\nAli ficamos um pedaço, bebendo e folgando, ao longo dela, entre esse arvoredo, que é tanto, tamanho, tão basto e de tantas prumagens, que homens as não podem contar. Há entre ele muitas palmas, de que colhemos muitos e bons palmitos.\n\nQuando saímos do batel, disse o Capitão que seria bom irmos direitos à Cruz, que estava encostada a uma árvore, junto com o rio, para se erguer amanhã, que é sexta-feira, e que nos puséssemos todos de joelhos e a beijássemos para eles verem o acatamento que lhe tínhamos. E assim fizemos. A esses dez ou doze que aí estavam, acenaram-lhe que fizessem assim, e foram logo todos beijá-la.\n\nParece-me gente de tal inocência que, se homem os entendesse e eles a nós, seriam logo cristãos, porque eles, segundo parece, não têm, nem entendem em nenhuma crença.\n\nE portanto, se os degredados, que aqui hão de ficar aprenderem bem a sua fala e os entenderem, não duvido que eles, segundo a santa intenção de Vossa Alteza, se hão de fazer cristãos e crer em nossa santa fé, à qual praza a Nosso Senhor que os traga, porque, certo, esta gente é boa e de boa simplicidade. E imprimir-se-á ligeiramente neles qualquer cunho, que lhes quiserem dar. E pois Nosso Senhor, que lhes deu bons corpos e bons\n\nrostos, como a bons homens, por aqui nos trouxe, creio que não foi sem causa.\n\nPortanto Vossa Alteza, que tanto deseja acrescentar a santa fé católica, deve cuidar da sua salvação. E prazerá a Deus que com pouco trabalho seja assim.\n\nEles não lavram, nem criam. Não há aqui boi, nem vaca, nem cabra, nem ovelha, nem galinha, nem qualquer outra alimária, que costumada seja ao viver dos homens. Nem comem senão desse inhame, que aqui há muito, e dessa semente e frutos, que a terra e as árvores de si lançam. E com isto andam tais e tão rijos e tão nédios, que o não somos nós tanto, com quanto trigo e legumes comemos.\n\nNeste dia, enquanto ali andaram, dançaram e bailaram sempre com os nossos, ao som dum tamboril dos nossos, em maneira que são muito mais nossos amigos que nós seus.\n\nSe lhes homem acenava se queriam vir às naus, faziam-se logo prestes para isso,\n\nem tal maneira que, se a gente todos quisera convidar, todos vieram. Porém não trouxemos esta noite às naus, senão quatro ou cinco, a saber: o Capitão-mor, dois; e Simão de Miranda, um, que trazia já por pajem; e Aires Gomes, outro, também por pajem.\n\nUm dos que o Capitão trouxe era um dos hóspedes, que lhe trouxeram da primeira vez, quando aqui chegamos, o qual veio hoje aqui, vestido na sua camisa, e com ele um seu irmão; e foram esta noite mui bem agasalhados, assim de vianda, como de cama, de colchões e lençóis, para os mais amansar.\n\nE hoje, que é sexta-feira, primeiro dia de maio, pela manhã, saímos em terra, com nossa bandeira; e fomos desembarcar acima do rio contra o sul, onde nos pareceu que seria melhor chantar a Cruz, para melhor ser vista. Ali assinalou o Capitão o lugar, onde fizessem a cova para a chantar.\n\nEnquanto a ficaram fazendo, ele com todos nós outros fomos pela Cruz abaixo\n\ndo rio, onde ela estava. Dali a trouxemos com esses religiosos e sacerdotes diante cantando, em maneira de procissão.\n\nEram já aí alguns deles, obra de setenta ou oitenta; e, quando nos viram assim vir, alguns se foram meter debaixo dela, para nos ajudar. Passamos o rio, ao longo da praia e fomo-la pôr onde havia de ficar, que será do rio obra de dois tiros de besta. Andando-se ali nisto, vieram bem cento e cinqüenta ou mais.\n\nChantada a Cruz, com as armas e a divisa de Vossa Alteza, que primeiramente lhe pregaram, armaram altar ao pé dela. Ali disse missa o padre frei Henrique, a qual foi cantada e oficiada por esses já ditos. Ali estiveram conosco a ela obra de cinqüenta ou sessenta deles, assentados todos de joelhos, assim como nós.\n\nE quando veio ao Evangelho, que nos erguemos todos em pé, com as mãos levantadas, eles se levantaram conosco e alçaram as mãos, ficando assim, até ser acabado; e então tornaram-se a assentar como nós. E quando levantaram a Deus, que nos pusemos de joelhos, eles se puseram assim todos, como nós estávamos com as mãos levantadas, e em tal maneira sossegados, que, certifico a Vossa Alteza, nos fez muita devoção.\n\nEstiveram assim conosco até acabada a comunhão, depois da qual comungaram esses religiosos e sacerdotes e o Capitão com alguns de nós outros.\n\nAlguns deles, por o sol ser grande, quando estávamos comungando, levantaram-se, e outros estiveram e ficaram. Um deles, homem de cinqüenta ou cinqüenta e cinco anos, continuou ali com aqueles que ficaram. Esse, estando nós assim, ajuntava estes, que ali ficaram, e ainda chamava outros. E andando assim entre eles falando, lhes acenou com o dedo para o altar e depois apontou o dedo para o Céu, como se lhes dissesse\n\nalguma coisa de bem; e nós assim o tomamos.\n\nAcabada a missa, tirou o padre a vestimenta de cima e ficou em alva; e assim se subiu junto com altar, em uma cadeira. Ali nos pregou do Evangelho e dos Apóstolos, cujo dia hoje é, tratando, ao fim da pregação, deste vosso prosseguimento tão santo e virtuoso, o que nos aumentou a devoção.\n\nEsses, que à pregação sempre estiveram, quedaram-se como nós olhando para ele. E aquele, que digo, chamava alguns que viessem para ali. Alguns vinham e outros iam-se. E, acabada a pregação, como Nicolau Coelho trouxesse muitas cruzes de estanho com\n\ncrucifixos, que lhe ficaram ainda da outra vinda, houveram por bem que se lançasse a cada um a sua ao pescoço. Pelo que o padre frei Henrique se assentou ao pé da Cruz e ali, a um por um, lançava a sua atada em um fio ao pescoço, fazendo-lha primeiro beijar e alevantar as mãos. Vinham a isso muitos; e lançaram-nas todas, que seriam obra de quarenta ou cinqüenta.\n\nIsto acabado – era já bem uma hora depois do meio-dia – viemos às naus a comer, trazendo o Capitão consigo aquele mesmo que fez aos outros aquela mostrança para o altar e para o Céu e um seu irmão com ele. Fez-lhe muita honra e deu-lhe uma camisa mourisca e ao outro uma camisa destoutras.\n\nE, segundo que a mim e a todos pareceu, esta gente não lhes falece outra coisa para ser toda cristã, senão entender-nos, porque assim tomavam aquilo que nos viam fazer, como nós mesmos, por onde nos pareceu a todos que nenhuma idolatria, nem adoração têm. E bem creio que, se Vossa Alteza aqui mandar quem entre eles mais devagar ande, que\n\ntodos serão tornados ao desejo de Vossa Alteza. E por isso, se alguém vier, não deixe logo de vir clérigo para os batizar, porque já então terão mais conhecimento de nossa fé, pelos dois degredados, que aqui entre eles ficam, os quais, ambos, hoje também comungaram.\n\nEntre todos estes que hoje vieram, não veio mais que uma mulher moça, a qual esteve sempre à missa e a quem deram um pano com que se cobrisse. Puseram-lho a redor de si. Porém, ao assentar, não fazia grande memória de o estender bem, para se cobrir. Assim, Senhor, a inocência desta gente é tal, que a de Adão não seria maior, quanto a vergonha.\n\nOra veja Vossa Alteza se quem em tal inocência vive se converterá ou não, ensinando-lhes o que pertence à sua salvação.\n\nAcabado isto, fomos assim perante eles beijar a Cruz, despedimo-nos e viemos comer.\n\nCreio, Senhor, que com estes dois degredados ficam mais dois grumetes, que esta noite se saíram desta nau no esquife, fugidos para terra. Não vieram mais. E cremos que ficarão aqui, porque de manhã, prazendo a Deus, fazemos daqui nossa partida.\n\nEsta terra, Senhor, me parece que da ponta que mais contra o sul vimos até à outra ponta que contra o norte vem, de que nós deste porto houvemos vista, será tamanha que haverá nela bem vinte ou vinte e cinco léguas por costa. Tem, ao longo do mar, nalgumas partes, grandes barreiras, delas vermelhas, delas brancas; e a terra por cima toda chã e muito cheia de grandes arvoredos. De ponta a ponta, é toda praia parma, muito chã e muito formosa.\n\nPelo sertão nos pareceu, vista do mar, muito grande, porque, a estender olhos, não podíamos ver senão terra com arvoredos, que nos parecia muito longa.\n\nNela, até agora, não pudemos saber que haja ouro, nem prata, nem coisa alguma de metal ou ferro; nem lho vimos. Porém a terra em si é de muito bons ares, assim frios e temperados como os de Entre Douro e Minho, porque neste tempo de agora os\n\nachávamos como os de lá.\n\nÁguas são muitas; infindas. E em tal maneira é graciosa que, querendo-a aproveitar, dar-se-á nela tudo, por bem das águas que tem.\n\nPorém o melhor fruto, que nela se pode fazer, me parece que será salvar esta gente. E esta deve ser a principal semente que Vossa Alteza em ela deve lançar.\n\nE que aí não houvesse mais que ter aqui esta pousada para esta navegação de Calecute, bastaria. Quando mais disposição para se nela cumprir e fazer o que Vossa Alteza tanto deseja, a saber, acrescentamento da nossa santa fé.\n\nE nesta maneira, Senhor, dou aqui a Vossa Alteza do que nesta vossa terra vi. E, se algum pouco me alonguei, Ela me perdoe, que o desejo que tinha, de Vos tudo dizer, mo fez assim pôr pelo miúdo.\n\nE pois que, Senhor, é certo que, assim neste cargo que levo, como em outra qualquer coisa que de vosso serviço for, Vossa Alteza há de ser de mim muito bem servida, a Ela peço que, por me fazer singular mercê, mande vir da ilha de São Tomé a Jorge de Osório, meu genro – o que d'Ela receberei em muita mercê.\n\nBeijo as mãos de Vossa Alteza.\n\nDeste Porto Seguro, da Vossa Ilha de Vera Cruz, hoje, sexta-feira, primeiro dia de maio de 1500.\n\n- Pero Vaz de Caminha",
				"added": 1552693886
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 13,
				"body": "Por isso não tema, pois estou com você; não tenha medo, pois sou o seu Deus. Eu o fortalecerei e o ajudarei; Eu o segurarei com a minha mão direita vitoriosa.\n\"Todos os que o odeiam certamente serão humilhados e constrangidos; aqueles que se opõem a você serão como nada e perecerão.\nEmbora procure os seus inimigos, você não os encontrará. Os que guerreiam contra você serão reduzidos a nada.\nPois eu sou o Senhor, o seu Deus, que o segura pela mão direita e lhe diz: Não tema; eu o ajudarei.\n\n- Isaías 41:10-13",
				"added": 1552695893
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 17,
				"body": "Será que, de repente, uma xícara de café poderia, expontaneamente, alçar vôo da sua mão?\nO que poderia (e pode mesmo) ocorrer é que, por acaso, todas as moléculas resolvam se mover na mesma direção, por exemplo, para cima, transformando a energia térmica interna (que responde pela temperatura) em energia cinética macroscópica da xícara. Suponhamos que a xícara tenha 100g de água e esteja a 77ºC (350K). Assim sua energia interna seria da ordem de 29.350 cal ou 123.000J, o que lhe daria uma velocidade inicial de 5.646km/h, se ela perdesse toda a energia interna. Este cálculo foi feito considerando a energia fornecida (calor) desde o zero absoluto até a fusão do gelo, supondo um calor específico constante de 0,5 cal/g.ºC, depois um calor latente de fusão de 80 cal/g, e então um aquecimento até 77ºC com o calor específico de 1,0 cal/g.ºC, 1cal=4,19J e 1m/s-3,6km/h.\nPara calcular a probabilidade, sabendo que S=k.ln(G) e que dS=dQ/T, onde S=entropia e k=constante de Boltzmann = 1,38E(-23)J/K, G=número de microestados acessíveis, temos, numa isobárica S-So=mcln(T/To) e na isotérmica S-So=mL/T (mudança de estado). No zero absoluto há uma divergência, pois To=0. Começando em To=1K e supondo aí So=0, no ponto de fusão teremos:\nS=100×0,5xln273=280,5cal/K\nNa fusão: deltaS=100×80/273=29,3cal/K\nAté os 77ºC: deltaS=100x1xln(350/273)=24,8cal/K\nEntropia final=280,5+29,3+24,8=334,6cal/K=1.402J/K\nDaí temos: G=exp(S/k)=exp(1402/1,38E(-23))=1,01E26\nSabendo que o estado em que “todas” as moléculas estão se movendo no mesmo sentido é apenas “uma” dessas possibilidades, sua probabilidade é o inverso desse número, isto é:\n9,8E(-27), aproximadamente 10^(-26).\n\n- Fonte: http://www.ruckert.pro.br/blog/?p=1020",
				"added": 1552703771
			},
			{
				"comment_id": 18,
				"body": "#Detecção de Grávitons\n\nAo se considerar os grávitons já está se tratando a gravidade quanticamente, mesmo continuando relativística. Certamente é a baixíssima energia dos grávitons que impede a sua detecção em aparatos que se pode construir aqui na Terra. Mas se o detector for um corpo enorme, como a Lua toda, que é sólida, talvez se consiga captá-los, pois o processo é por medida de deformações do detector. Assim a Lua sofreria deformações ao captar grávitons. Mas teríamos que esperar um evento emissor de fortes grávitons, como uma explosão de supernova.",
				"added": 1552704595
			}
		]
	},
	"comment_vote": {
		"5_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1
	}
}