{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": 1,
		"1_12XPYvUFzmczXdTy4GJxB1WGrnwrdpTCqD": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1CjXSjhpi742HFZts17YvN1U1v9CfrWHsq": [
			{
				"comment_id": 1,
				"body": "> [p2pnode](#comment_2_1CjXSjhpi742HFZts17YvN1U1v9CfrWHsq): Короче зашол я в ZeroMe и начал подписываться на всех пользователей подряд подписался человек на 300 потом зеронет начала выдавать ошибку и все мои посты пропали пропали они отовсюда со всех сайтов и блогов зеронета  выходит что разработчики оставили за собой лазейку удалять наши посты за бабло\n> пропали не только посты но и профиля нигде нет пускай зеронет идет нахуй я прекращаю его поддерживать и раздовать\n\nНе особо шарю во внутренней архитектуре сети, может у тебя кончилась память при многочисленных подписках и твои данные не синхронизировались? Проблемы с диском? Сеть стабильна? Тут людей игнорить можно ещё",
				"added": 1551964390
			}
		],
		"1_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": [
			{
				"comment_id": 2,
				"body": "> [gsdth](#comment_1_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): в ZeroNet нет шифрования трафика иликотента провайдер видит что вы делайте думаю вы поняли почему нет магазинов это сеть для распространения информации\n\nС чего ты взял?",
				"added": 1552036196
			}
		],
		"1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 3,
				"body": "Смотря зачем обходить и что ты понимаешь под обходом\nСкорее всего тебе хватит VPN'a\nА если серьезно, написал бред. Ты подключен провайдером через его же оборудование",
				"added": 1552052476
			},
			{
				"comment_id": 4,
				"body": "> [deliriumgoddess6](#comment_1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): Ты меня не понял. Вот к примеру, у нас есть сеть, траффик которой проходит через провайдера. однако возможно ли каким либо способом обойти провайдела имея в наличии сеть оптоволоконных кабелей к примеру. Ладно, если вайфай, там реально создать сеть в обход провайдера, особенно если плотность велика.Я понимаю, что оборудование програмно и удаленно контроллируется провайдером. Однако реально ли это обойти?Это чисто теоретические размышления.\n\nХм, ну вообще если подзаморочиться, теоретически можно создать собственный аналог интернета на тех - же технологиях. Опиши подробнее чего ты хочешь. Локалку?",
				"added": 1552056249
			}
		]
	},
	"comment_vote": {
		"160_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"7_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"54_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"30_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1
	}
}