{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1602309517_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 1,
				"body": "Is it the maximum size of the zite that you're trying to set? The options in the sidebar are controlled by a plugin, `Sidebar`. From the source there's a `SiteSetLimit` command you can send with an argument of the size. You could try sending that - it doesn't take a zite address so you'll probably need to use `as` like you're doing with `siteInfo`. Here's the relevant code from `UiWebSocket.py`:\n\n```\n    @flag.admin\n    @flag.no_multiuser\n    def actionSiteSetLimit(self, to, size_limit):\n        self.site.settings[\"size_limit\"] = int(size_limit)\n        self.site.saveSettings()\n        self.response(to, \"ok\")\n        self.site.updateWebsocket()\n        self.site.download(blind_includes=True)\n```",
				"added": 1602327316
			}
		],
		"1602120041_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 2,
				"body": "> [swashbuckler](#comment_51_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Also, take a look at this zite: citadell.bitIt has 3 files: [...]\n\nA number of sites use external resources. It's common for those that are mirrors or otherwise copied to zeronet. It's one of the reasons using tor browser is good for browsing zeronet sites, so that information like ip address is not leaked to clearnet.",
				"added": 1602455661
			}
		],
		"1602348205_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 3,
				"body": "> [claude](#comment_22_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): To anyone reading this: [...]\n\nThat's interesting, thanks, I didn't know that. I tried it by copying the C++ reference website archive to a  [new site](http://127.0.0.1:43110/156wJPKFTsNHfkLVzgFbJGQorzXATsV3wQ/) and it worked.",
				"added": 1602455758
			}
		],
		"1602468852_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 4,
				"body": "How are you removing it? Are you signing and republishing your site after the removal? Do the files appear in the `content.json` for the site? Is it user content that is being removed or the sites? I think the signing is different for removing user content.",
				"added": 1602471637
			}
		],
		"1604079393_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 5,
				"body": "> [jlxip](#comment_9_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): Well, just lost the domain thing. I have absolutely no idea why it still works, pure wizardry. Haven't had the time to rewrite the site, it will happen... At some point.\n\nThe  domain still works on expired .bit domains until the new owner of the domain updates it to be valid syntax according to 0name. Once that happens, it'll stop working and go to whatever new site it points to. This is useful for existing domains where they expire and get snapped up by the bitmessage domain squatter because they don't redirect the domains.",
				"added": 1607676205
			}
		],
		"1609017796_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 6,
				"body": "Yes it will get slower for those that seed the site getting the large amount of traffic. Hopefully the developers of ZeroNet would work on the issues as they happen.",
				"added": 1609026609
			}
		],
		"1608393223_16F1RWwNC66bZu8h8sJBo2onWJ98DuK4s7": [
			{
				"comment_id": 7,
				"body": "If you're using mobile data it's possible that your mobile provider blocks incoming traffic to some ports which means you won't be able to control opening them yourself. You might be able to use a VPN to work around this. Or connect to wifi, publish your site and let people seed it, then disconnect.",
				"added": 1609114714
			}
		],
		"1611899028_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 8,
				"body": "Yes, it allows other ZeroNet instances running on the same LAN to retrieve content from each other. So you can have one client as a gateway to the wider ZeroNet world, and all the local lan instances having no internet access can still retrieve data.",
				"added": 1611909808
			}
		]
	},
	"comment_vote": {
		"1160_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}