{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 1,
				"body": "> [ultraviolet](#comment_85_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): С утверждением вынесенным в название темы спорить сложно.  Вопрос в том что же делать с этим печальным фактом.  \n\nГугли «коктейль Молотова»\n\n > ЗЫЗамечу что в соседних странах дела обстоят не сильно лучше\n\nА почему тебя волнует что в чужих странах? В соседних странах проходят выборы и граждане сами выбирают себе президентов, а кого они выбирают не твое сучье дело.",
				"added": 1567265382
			},
			{
				"comment_id": 2,
				"body": "> [ultraviolet](#comment_108_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): надо сделать как при выборах Папы Римского. Там кардиналы сидят без штанов - чтобы всем был виден пол потенциального Папы, а то говорят веке в 9-ом по ошибке женщину выбрали а она ещё и забеременела:-)\n\n1. Про кардиналов без штанов — чушь собачья\n2. Про женщину избранную Папой — позднее протестанское вранье, никаких доказательств этому вранью не было и нет.",
				"added": 1567265451
			},
			{
				"comment_id": 3,
				"body": "> [midnight](#comment_1_1D6npYBZc43Bv1a62Fg689SDcFdthJSFt): Почему \"Вы\" постоянно ругаете Путина?Почему вы ничего не говорите про медведева? Губеров в своих регионах? и других чиновников?Когда Путин ездил по регионам и проводил встречи, почему не спрашивали про окуевших чиновником/глав?\n\nПотому что это Хуйло назначило Медведева, это Хуйло назначает гауляйтеров(которых ты называешь «губернаторами». Они все назначены Хуйлом, а потому нет смысла рассматривать их, как самостоятельные единицы.\n\n> Почему вы не прочитали конституцию ведь там пзд полный, к примеру \"президент не имеет права не подписывать\"(107 ст. 3 часть)\n\nВ указанной тобой статье нет никакого «президент не имеет права не подписывать», не ври, блядина НОДовская.\n\nТам написано \n\n«Если Президент Российской Федерации в течение четырнадцати дней с момента поступления федерального закона отклонит его, то Государственная Дума и Совет Федерации в установленном Конституцией Российской Федерации порядке вновь рассматривают данный закон. Если при повторном рассмотрении федеральный закон будет одобрен в ранее принятой редакции большинством не менее двух третей голосов от общего числа членов Совета Федерации и депутатов Государственной Думы, он подлежит подписанию Президентом Российской Федерации в течение семи дней и обнародованию»\n\nГде тут «не имеет права не подписывать»??? А, пиздобол?",
				"added": 1567265729
			}
		],
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 4,
				"body": "Любые профсоюзы, как и прочая левацкая дрянь, зло. Никого не должны касаться отношения работодателя и сотрудника, никаких сраных профсоюзов, никаких блядских леваков. Работодатель и сотрудник должны разбираться между собой сами и только сами, без вас, блядей-бездельников",
				"added": 1567268400
			},
			{
				"comment_id": 7,
				"body": "> [ultraviolet2](#comment_12_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): Профсоюз и есть работники.\n> Зло это персонажи вроде тебя получившие всё за счёт родителей, бесплатно учащиеся в построенных ещё в СССР школах и университетах, обращающиеся за бесплатным лечением к созданной в СССР бесплатной медицине и рассказывающие какие вы во всём этом не нуждаетесь\n> Ничего страшного - время работает на нас. Социальные блага отменяются,  в отличии от твоих родителей новую квартиру в Москве тебе не купить,  поголовье бесполезных офисных слизней работодатели сокращают.\n> Есть ещё полиция и росгвардия которые бьют по тупым башкам \"сверхчеловеков \"дубинами.\n> Так что у тебя ещё всё в передив  плане прихода к идеям демократии и социализма.\n> Почитай Джека Лондона  \"Как я стал социалистом\" - там как раз про тебя\n\nМалыш, ничего в совке не строилось бесплатно. Мои родители работали и на это строилось все в совке. А я платил налоги и на это ты учился в школе.\nНичего бесплатного не бывает. Ты — паразит который выучился за мой, как налогоплательщика счет и ты хочешь паразитировать на других создав «профсоюз»",
				"added": 1567428926
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 5,
				"body": "Кстати, а какие-то доказательства того, что он сдох были? Или его баба просто собрала деньги на якобы лечение, а потом скрылась в неизвестном направлении заявив, что его прикопают в Кёнигсберге, к которому этот субъект не имел никакого отношения?\nЯ так понимаю что второе, да?\nТо есть он с бабой просто собрал с лохов бабло «на лечение» и потом якобы помер.\nКрасиво они с бабой лохов развели, молодцы.",
				"added": 1567354495
			},
			{
				"comment_id": 6,
				"body": "> [ultraviolet2](#comment_11_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): не \"сдох\" а умер, не \"баба\" а жена\n> Он весьма известный человек с хорошей репутацией да и не собрать так много денег\n> Мне кажется очень странно подозревать кого-либо в таком мошенничестве\n\nЕго самка отказалась предоставлять информацию на какое именно лечение нужны были деньги, было заявлено, что набрали они на закрытие ипотеки, так что неплохо набрали.\nНикакого объяснения с чего бы его собрались «хоронить» в Кёнигсберге, к которому он не имел отношения не было и где его могила скрывается.\nТак что с вероятностью 99.99999% он и его баба просто развели людей на бабки и скрылись\nУчитывая его людоедские политические взгляды это очень вероятно.\n\nПросто помни, что  вероятностью 99.99999% чувак со своей самкой тебя наебал, собрал денег и свалил в закат",
				"added": 1567428782
			},
			{
				"comment_id": 8,
				"body": "> [ultraviolet2](#comment_17_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg): самка тут одна - ты\n> Притом самка бесплодная. Потому что ты пидр\n\nХм. От правды подгорает жопа. KRoN73, это ты что ли? Страшно тебе стало, что твою аферку раскусили и людям про это рассказывают?",
				"added": 1567432845
			}
		]
	},
	"comment_vote": {
		"1_15A62tSppi8Gt85JGm5B5WDxWDgZA8wXh2": 1
	}
}