{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "10 Incríveis descobertas científicas que estamos esperando",
			"body": "#Embora a ciência tenha feito descobertas marcantes nos últimos anos, muitas coisas vistas em filmes de ficção científica e sonhadas por muitos, como a cura para doenças que assolam milhões de pessoas, ainda não aconteceram.\n\n- https://web.archive.org/web/20100420055042/https://hypescience.com/10-incriveis-descobertas-cientificas-que-ainda-estamos-esperando/",
			"added": 1542744970
		},
		{
			"topic_id": 2,
			"title": "Anime",
			"body": "#Divulgação de animes",
			"added": 1542745141
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Notas de Palestra sobre Criptografia\n- https://web.archive.org/web/20181120124950/http://cseweb.ucsd.edu/~mihir/papers/gb.pdf",
				"added": 1542744313
			},
			{
				"comment_id": 2,
				"body": "#Tratado de arithmetica\n- https://books.google.com.br/books?id=1HMb0lACza4C&dq=%22divisivel%20por%22&hl=pt-BR&pg=PA116#v=onepage&q&f=false",
				"added": 1542744347
			},
			{
				"comment_id": 3,
				"body": "#Existe uma determinada função que foi demonstrada que é de mão única se e somente se funções de mão única existirem. Como esta função foi a primeira função de mão única combinatorial completa a ser demonstrada, ela é conhecida como a \"função de mão única universal\". O problema de determinar a existência de funções de mão única é assim reduzido ao problema de provar que esta função específica é de mão única.\n\n- https://web.archive.org/web/20181120200657/https://arxiv.org/pdf/cs/0012023.pdf",
				"added": 1542744455
			},
			{
				"comment_id": 4,
				"body": "#Criptografia geométrica\n- https://web.archive.org/web/20181120130852/http://people.csail.mit.edu/rivest/BurmesterRivestShamir-geometric.pdf",
				"added": 1542744489
			},
			{
				"comment_id": 14,
				"body": "#Os nove capítulos da arte matemática\nOs nove capítulos da arte matemática é um livro de matemática. Sua origem remonta ao período da Dinastia Zhou e foi compilado por várias gerações de escribas entre os séculos II e I a.C. É um dos livros de matemáticas mais antigos da China, depois de Suàn shù shū e Zhou Bi Suan Jing.\n- https://web.archive.org/web/20181120225738/https://www.ime.unicamp.br/lem/material-de-apoio/nove-capitulos-arte-matematica-liu-hui-seculo-ii-dc",
				"added": 1542754736
			},
			{
				"comment_id": 15,
				"body": "#Método de Exaustão dos Antigos: O Princípio de Eudoxo-Arquimedes\n- https://web.archive.org/web/20160303171424/http://www.prof2000.pt/users/j.pinto/vitae/textos/04_Met_Exa_Hist_Analise_JPinto.pdf",
				"added": 1542755683
			},
			{
				"comment_id": 16,
				"body": "#Critérios de Divisibilidade\nCritérios de Divisibilidade por 2, 3 e 5\n\n- https://youtu.be/Lxb1FpjSfQA",
				"added": 1542755719
			},
			{
				"comment_id": 17,
				"body": "#Matemática - Problemas, Desafios e Olimpíadas\n- https://www.youtube.com/user/matematicario/playlists?shelf_id=7&view=50&sort=dd",
				"added": 1542758314
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "#Elevador espacial\nUm elevador espacial é uma estrutura teórica destinada a transportar carga da superfície de um planeta para o espaço. Muitos tipos diferentes de elevadores espaciais já foram propostos, todos eles com o mesmo objetivo de substituir a propulsão de foguetes pelo uso de uma via fixa para transporte, não muito diferente de um elevador, para colocar cargas em órbita ou mesmo para lançar a mesma para o espaço.\n- https://web.archive.org/web/20181120164528/http://macbeth.if.usp.br/~gusev/elevador.pdf",
				"added": 1542744566
			},
			{
				"comment_id": 6,
				"body": "#A física do elevador espacial\n- https://web.archive.org/web/20181120164724/http://users.wpi.edu/~paravind/Publications/AJPElevator.pdf",
				"added": 1542744615
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 7,
				"body": "#Accel World\nNo ano de 2046, a neuro-sincronização, um sistema tecnológico que permite humanos a manipular seus cinco sentidos, já está tão difundida ao ponto onde pessoas possam acessar a internet e entrar em mundos virtuais através de um despositivo conhecido como Neuro-Linker. Haruyuki \"Haru\" Arita é um menino baixo e gordo que tem baixa auto-estima devido ao constante bullying. Para escapar do tormento da vida real, ele se conecta à rede do mundo virtual da escola, onde ele joga squash sozinho e sempre obtém a maior pontuação.\n\n- https://megaseriehd.com/series/accel-world/",
				"added": 1542745174
			},
			{
				"comment_id": 8,
				"body": "#Inuyasha\nA história se introduz com o jovem Inuyasha, que segundo a história desenvolvida por Rumiko Takahashi, é um hanyou (um meio-yōkai), por ser filho de um yōkai com uma humana, e vive no Japão feudal. Kagome, é uma colegial comum e reencarnação da sacerdotisa Kikyou, e que mora no Japão atual, e é puxada por um poço misterioso, perseguida por um monstro, e vai parar no Japão na época feudal (Sengoku Jidai), em um vilarejo. Lá encontra Kaede, e enquanto conversam, o monstro volta e tenta matar Kagome, e pegar a Joia de Quatro Almas (Shikon no Tama em japonês) que está em seu corpo, então ela foge para a floresta. Durante a perseguição, ela encontra Inuyasha (um meio-yōkai) que estava selado em uma árvore por uma flecha que foi lançada por Kikyou (falecida irmã mais velha de Kaede e encarnação de Kagome). Ele acorda e a chama de Kikyou, mas quando percebe que não é ela (depois Kaede revela que Kagome é a reencarnação de sua irmã), pede a Kagome para soltá-lo para salvá-la do monstro que a perseguia. Ela o solta, e ele destrói o monstro. Logo tenta matar Kagome também, para pegar a Joia de Quatro Almas, mas Kaede aparece e joga no pescoço de Inuyasha um rosário, pedindo para que Kagome fale uma palavra espiritual (qualquer palavra), que ela seria a chave para acalmar Inuyasha. Ela fala \"Senta\" (osuwari em japonês) inspirada nas orelhas do yōkai, e ele cai no chão. No outro dia, um yōkai corvo engole a Joia de Quatro Almas, e na tentativa de resgata-la, Kagome atira uma flecha nele, mas que acaba acertando a Joia de Quatro Almas também, que é despedaçada em centenas de pedaços e espalhados por todo Japão Feudal. Inuyasha, mesmo não gostando de Kagome (por ela ser muito parecida com Kikyou) é obrigado a se juntar a ela para juntar os fragmentos da Joia de Quatro Almas. Eles passam a depender um do outro pois Kagome sente a presença dos pedaços da Joia de Quatro Almas, e Inuyasha a protege contra os monstros que aparecem no caminho. Inuyasha quer a joia para se transformar em um yōkai completo e mais poderoso, e Kagome porque a despedaçou e tem essa obrigação. No começo os dois se odeiam, mas depois começam a se apaixonarem e futuramente se casam.\n\n- https://www.superanimes.site/anime/inuyasha",
				"added": 1542745224
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 9,
				"body": "#Titans\nTitans gira em torno de um grupo de jovens aspirantes a heróis do universo da DC Comics. Dick Grayson, provavelmente mais conhecido pelo seu alter-ego ‘Robin’, é o protagonista, que sai das sombras de Batman para se tornar o Nightwing, ou Asa Noturna, líder de um grupo de novos heróis que inclui Estelar, a Ravena e muitos outros.\n- https://megaseriehd.com/series/titas/",
				"added": 1542745300
			},
			{
				"comment_id": 13,
				"body": "#Série: CRIANDO GÊNIOS\n\n- https://www.youtube.com/playlist?list=PLHeypmD0pU2ppBeWxqgKfw0bGOtRRQNbA",
				"added": 1542752943
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 10,
				"body": "#A LUTA PELA ESPERANÇA\nJim Braddock (Russell Crowe) era considerado um prodígio do boxe, mas foi obrigado a se aposentar prematuramente devido a uma série de derrotas no ringue. Com os Estados Unidos em meio à Grande Depressão, Jim aceita viver de bicos para poder sustentar sua esposa, Mae (Renée Zellweger), e os filhos. Jim sempre sonhou com a oportunidade de retornar ao mundo do boxe e tem sua chance quando, devido a um cancelamento de última hora, é escalado para enfrentar o 2º pugilista na disputa do título mundial. Para surpresa de todos Jim vence três lutas consecutivas, mesmo sendo bem mais magro que seus oponentes e tendo ferimentos nas mãos. Ele passa então a ganhar o apelido de \"Cinderella Man\" e se torna o símbolo de esperança dos desprivilegiados da época. Até que precisa enfrentar seu pior oponente: Max Baer (Craig Bierko), o atual campeão mundial dos pesos pesados, que já matou dois lutadores no ringue.\n- https://www.ok.ru/video/41606515314",
				"added": 1542745496
			},
			{
				"comment_id": 12,
				"body": "#X+Y\nEm um mundo difícil de compreender, Nathan tem dificuldades para se aproximar das pessoas ao seu redor, diferente dos números onde encontra conforto. Quando Nathan é levado como aprendiz de um não convencial professor, Sr. Humphreys, uma incomum amizade se inicia e o talento do menino o leva ao time da grã-bretanha para a Olimpíada Internacional de Matemática. Lá, Nathan constrói relacionamentos complexos enquanto é confrontado pela irracional natureza do amor.\n- https://ok.ru/video/31697341042",
				"added": 1542749995
			}
		]
	},
	"comment_vote": {
		"12_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"14_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"15_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"17_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1
	}
}