{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1518257041,
			"title": ".piecemap.msgpack files",
			"body": "Does someone knows about those files. They appear in my zite folder structure. I suppose they are related with partially downloaded content but it is my zite (my computer does not need to download nothing). So please answer me:\n\n1.- What are those files for?\n\n2.- Is it OK form them to exist?\n\n3.- Is it normal for them to appear on the zite owner folder?\n\nThank you in advance.",
			"added": 1518257039
		},
		{
			"topic_id": 1518380259,
			"title": "How to know zite optional files health?",
			"body": "I have published a zite with optional files. Is there any way to know how those optional files are distributed into the P2P net of ZeroNet? How many computers hace downloaded those optional files and they serving them?",
			"added": 1518380256
		},
		{
			"topic_id": 1519205469,
			"title": "Can not login to ZeroWiki",
			"body": "I can not login to ZeroWiki nor other ZeroWiki based zites. Please help. When I click on \"login\" I does nothing. (I can login normally at ZeroMe, ZeroMail, ZeroTalk, etc.). Thank you in advance.",
			"added": 1519205465
		},
		{
			"topic_id": 1519420799,
			"title": "Advice on 0-Gallery",
			"body": "Someone please give some advice on how to make a picture gallery available through 0-Gallery. I have seen something about I have to run a gallery hub or so. I do not understand. Thank you in advance.",
			"added": 1519420794
		},
		{
			"topic_id": 1520069750,
			"title": "Big files syncing in LAN issue",
			"body": "Hello. I need help please. I run two zites with videos (5 videos between 300 MB and 1.5 GB of size). I have mounted a Raspberry Pi 3 in order to keep them alive full time (Mac is running ZN daemon on standard port 15441 and Raspberry is running ZN daemon on port 15442, I have set port forwarding in my router in both cases and the two of them says \"PORT: OPENED\" at the ZN Hello page). I have checked \"DOWNLOAD AND HELP DISTRIBUTE ALL FILES\" on both zites in the Raspberry. However, video files are not downloaded properly to the Raspberry. I have checked space and it left enough in the SD card (11 GB free) but after a week only 2 videos have been synced. Specifically, in the case of the bigger file (a movie of 1.5 GB) it says some pieces are missing. I have fixed (I think it) the problem transferring the files with FileZilla but I understand it would not be necessary. Is there any problem with big files and LAN syncing between two devices? or am I missing something? Thank you in advance.",
			"added": 1520069744
		}
	],
	"topic_vote": {
		"1517933395_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1
	},
	"next_comment_id": 58,
	"comment": {
		"1517522636_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5": [
			{
				"comment_id": 1,
				"body": "Hello samp. I come from Spain. From what States are you? USA?",
				"added": 1517524378
			},
			{
				"comment_id": 3,
				"body": "I think the future of the Internet is to be decentralized (at least in a great part). So I hope ZeroNet at last will disrupt the Internet and upgrade it to a new level of performance and freedom. ZeroNet is not the first at trying this but it is true that it is the first on doing it in a really easy way for all people.",
				"added": 1517604218
			}
		],
		"1517552108_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 2,
				"body": "+1",
				"added": 1517603781
			}
		],
		"1517985445_1M8ZpJwd63Vb8KdVaSb5EbqKxoRTVDmqTf": [
			{
				"comment_id": 4,
				"body": "Take a look at the Intergalactic File Server: http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er",
				"added": 1517988724
			},
			{
				"comment_id": 5,
				"body": "> [nomad42](#comment_16_1M8ZpJwd63Vb8KdVaSb5EbqKxoRTVDmqTf): interesting idea and UI, but a lot of file a broken.\n\nYou are certain. Many files are not served by anyone. However perhaps it can serve your purpose of sending a file.",
				"added": 1517995301
			}
		],
		"1518072989_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": [
			{
				"comment_id": 7,
				"body": "I have found an initial version of DEEP FAKES: http://127.0.0.1:43110/122Ad6qhGRhFNcGgqSqkg9karrQf4fAPZe",
				"added": 1518098823
			},
			{
				"comment_id": 15,
				"body": "> [deepfake](#comment_9_1M3M7mVoyXYtWz3aq6BG4fP2fwjdv7Rxj1): To the guy who's keeping the site: http://127.0.0.1:43110/122Ad6qhGRhFNcGgqSqkg9karrQf4fAPZe/ [...]\n\nYou do not have ZeroMail set up. Don't you? I want to talk to you in private.",
				"added": 1518860285
			},
			{
				"comment_id": 18,
				"body": "New models are shown in LATEST ADDITIONS links. New videos are not marked. Perhaps it would be possible to reorder videos by addition date or mark videos as NEW when they have less than a week for example. Do you think it would be OK?",
				"added": 1519028370
			},
			{
				"comment_id": 53,
				"body": "> [amiga500](#comment_1_1HBDi2cwDvZZSUfioMbQSNfPgvhCx7G4j): /r/ Elena Radionova\n\nwhere?",
				"added": 1530285312
			},
			{
				"comment_id": 54,
				"body": "We can not make new deepfakes. Just compile them into a zite.",
				"added": 1530290041
			},
			{
				"comment_id": 55,
				"body": "Nothing happened. We build the zite from a big archive an user linked here. The job is done. If you want to add a video to the zite, just provide it.",
				"added": 1530456707
			}
		],
		"1518200694_1A7U9thV94RkQHh3jvfceMMkBS1FeCeQHt": [
			{
				"comment_id": 8,
				"body": "can you view your site correctly with your browser?",
				"added": 1518211271
			},
			{
				"comment_id": 9,
				"body": "Just follow the EASY instructions of ZeroNet devs (external link):\n\n  https://zeronet.readthedocs.io/en/latest/using_zeronet/create_new_site/\n\nOnce you have that simple web page edit it at your taste.",
				"added": 1518256694
			}
		],
		"1518372112_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 10,
				"body": "Is the new zite clonable?",
				"added": 1518380119
			}
		],
		"1518380259_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 11,
				"body": "thank you. i will check it",
				"added": 1518388980
			},
			{
				"comment_id": 12,
				"body": "thank you my friend. it totally solves my question. as you say in ZEROHELLO / FILES i can search for my zite and look the optional files. even i can order them by peers to see if all of them are healthy. cool! thanks again",
				"added": 1518389214
			}
		],
		"1516324194_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 13,
				"body": "CP is an actual problem here. In my first visits at ZN I sadly founded 5 or more zites with CP (I almost uninstall it). I do not want those image/video files to pass not a second by my computer. However, I understand that freedom is the most valuable feature of ZN so we have to achieve a good solution for all of us. My solution is simple: the ZN client must know how many peers have blacklisted an specific zite and it must calculate a blacklist factor (BLF):\n\n  BLF = amount of peers that blacklisted the zite / amount of peers that are hosting the zite\n\nIn this way, users can set and adecuate BLF threshold for them. For example, I can consider to tolerate a threshold of 50%. So if I click on a link and the ZN client knows its BLF is over 50% it can show me a warning screen:\n\n  This zite has been blacklisted by more than 50% peers\n\n  [Continue]  [Blacklist also]\n\nIn this way, or a similar one, we can use ZN all together without problem.",
				"added": 1518545633
			}
		],
		"1518751354_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": [
			{
				"comment_id": 14,
				"body": "It says: \"No files submitted yet\".",
				"added": 1518769874
			}
		],
		"1518868581_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 16,
				"body": "+1",
				"added": 1518868618
			}
		],
		"1518979406_18YsrRv5LsoqhKgirUbKNy8tXCRN1HqnDw": [
			{
				"comment_id": 17,
				"body": "I think it is impossible.",
				"added": 1518980843
			}
		],
		"1519142918_18A7MxMQS5WnxRnQR6CtytEzjZ4UsGRpbm": [
			{
				"comment_id": 19,
				"body": "This can be done in a lot of hosting services. Just pay for a dedicated server and configure it to host ZN zites.",
				"added": 1519146109
			},
			{
				"comment_id": 20,
				"body": "You are certain. However, I think there would be no demand to maintain that service profitable.",
				"added": 1519153734
			},
			{
				"comment_id": 22,
				"body": "> [nekololi](#comment_175_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): zeronet.py\n\nAre you talking about the console version of the ZN daemon? However, I think the initial question was related to a hosting service that supports ZN connection.",
				"added": 1519168070
			},
			{
				"comment_id": 23,
				"body": "I do not agree. oracius ask for a hosting service. like OVH or DigitalOcean but supporting ZN.",
				"added": 1519168333
			},
			{
				"comment_id": 24,
				"body": "However, if you run a zite with  a considerable optional space (for example, AnimeZero has 5 GB of optional video files) those files are not hosted by all peers. In fact, some of them are only seeded by yourself most time. So it can be useful to have contracted a hosting service if you need the zite to by fully up 24 hours a day.",
				"added": 1519197153
			},
			{
				"comment_id": 25,
				"body": "In any case I agree with you: if you are running a zite without optional files it is not necessary to seed it all time once you have uploaded the content to enough peers.",
				"added": 1519197473
			}
		],
		"1519155328_1NDhNyavxhFyWJHscjPu5qYjMbpfKSDVzt": [
			{
				"comment_id": 21,
				"body": "A mí me gustaría montar una plataforma de pelis aquí en ZN. Pero cuando he preguntado parece que hispanohablantes hay por aquí muy poco. ¿Buscas alguna peli en concreto?",
				"added": 1519161457
			},
			{
				"comment_id": 26,
				"body": "En [AnimeZero](/16MSit65b2i7XFsTQyvTB1zwd8kfbcegQ4) tienes películas dobladas al español. Son de anime pero quizá te sirvan. Si buscas películas más populares prueba en clearnet: [MejorTorrent](http://www.mejortorrent.com/)",
				"added": 1519203580
			},
			{
				"comment_id": 27,
				"body": "Sorry but I have to reply:\n\n1. Please do not say that the most widely available spanish movies are porn. That is not true. Simply, you have to know where to look for (as well as for porn). The tracker I suggested (MejorTorrent) is good start point. If you want to have an idea about good spanish movies you can take a look at the clearnet [\"Premios Goya\"](https://www.premiosgoya.com/32-edicion/premios/por-categoria/) site.\n\n2. The original question was about popular (Hollywood) movies in spanish (dubbed). So your answer is totally wrong.",
				"added": 1519252289
			},
			{
				"comment_id": 29,
				"body": "If you prefer to view true spanish movies I would recommend starting by these ones:\n\n## Spanish movies with spanish actors (original spanish voices):\n\n* El laberinto del fauno (2006)\n* Celda 211 (2009)\n* La isla mínima (2014)\n\nOf course there are spanish movies more suitable for international standards as (for example):\n\n## Spanish movies with foreign actors (voices are dubbed):\n\n* Los otros / The Others (2001)\n* El Machinista / The Machinist (2004)\n* Enterrado / Buried (2010)\n* Lo imposible / The Impossible (2012)\n* Un monstruo viene a verme / A Monster Calls (2016)",
				"added": 1519289222
			}
		],
		"1519205469_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 28,
				"body": "I think it is a problem with Google Chrome. I can login OK with Firefox : (",
				"added": 1519253223
			},
			{
				"comment_id": 30,
				"body": "* Chrome version: Versión 64.0.3282.167 (Build oficial) (64 bits)\n* No adblocker\n* Issue with all ZeroWikis I tested:\n  - [ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP)\n  - [ZeroWiki ES](/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ)\n  - Myself cloned ZeroWiki also has the problem.\n\nIt is not a problem for me. I have switched to Firefox in order to login and all is working OK. However, developers should check this issue.",
				"added": 1519289441
			},
			{
				"comment_id": 31,
				"body": "It is working OK with Chrome just now. I do not know why.",
				"added": 1519299174
			}
		],
		"1519339494_1HzyC3255dSGaaj36JAmHcQLTD6A4Z7jde": [
			{
				"comment_id": 32,
				"body": "I think it is normal if you are using TOR without a TOR BROWSER.",
				"added": 1519339972
			}
		],
		"1519337377_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5": [
			{
				"comment_id": 33,
				"body": "Try [HTTrack](https://www.httrack.com) (clearnet).",
				"added": 1519340031
			}
		],
		"1519420799_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 34,
				"body": "Thank you. I have created my [gallery](/1FnMLkDdRWjjdRp8iQhhJAfHwzbkLczyEN). I can see it alone but it does not appear in 0-Gallery with the rest of galleries I have visited (yours, Sayo, etc.) : (",
				"added": 1519465602
			},
			{
				"comment_id": 35,
				"body": "It says: \"Internal error: Exception: Merger site (ZeroGallery) does not have permission for merged site: 1FnMLkDdRWjjdRp8iQhhJAfHwzbkLczyEN (None)\"",
				"added": 1519466748
			},
			{
				"comment_id": 38,
				"body": "Solved. I cloned by copying files instead of cloning the zite at ZeroHello. It works OK now.",
				"added": 1519506953
			}
		],
		"1519472222_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 36,
				"body": "I think it not works in that way. I think ZN uses bit torrent protocol so the server would serve a different piece to each peer so the effort from the server part is to upload the file once, while the peers exchange pieces between then. I think this is the magic of bit torrent. More peers implie more bandwidth. More peers is better.",
				"added": 1519475356
			},
			{
				"comment_id": 37,
				"body": "Please explain this aspect better. I thought it worked different.\n\n1.- I think optional files are not downloaded by default.-\n\n2.- You say big files are not downloaded by default.-\n\nWhat is the correct one? (1 or 2) If the correct one is 2 then what is the size of a file to be considered big?",
				"added": 1519502715
			},
			{
				"comment_id": 45,
				"body": "I have a question related to this: if a have a big video file (say 400 MB) inserted as video in the HTML of the zite, peers would stream the video file if clicked? or they have to download the whole file to start watching it?",
				"added": 1519944917
			}
		],
		"1519627708_1M8ZpJwd63Vb8KdVaSb5EbqKxoRTVDmqTf": [
			{
				"comment_id": 39,
				"body": "I have studied it. The problem is that SkyTorrents database occupies 440 GB. I can not spend so much space in my computer for that. How can we do it? Perhaps a torrent of torrents?",
				"added": 1519629768
			},
			{
				"comment_id": 40,
				"body": "The perfect solution is SkyTorrents team itself migrate their site to ZN. They have shut down due to server costs but I think it would be affordable for them to maintain just a computer to serve a zite through our beloved ZN. But this solution is not at our hands of course.",
				"added": 1519633925
			},
			{
				"comment_id": 41,
				"body": "I have already downloaded the magnet version of SkyTorrents. It occupies very little space (322 MB). The problem is that it is just a text file with all the hashes but it has no names for them. Only the hashes. It is impossible to search and I think it is not useful.",
				"added": 1519636003
			}
		],
		"1519833740_1F1ucX4cPFMbafzcBipikdP6bWRFg7Da3D": [
			{
				"comment_id": 42,
				"body": "We have just started building [Zerotica](/1HQDmuaknnfJNgVv13RVkCczUctq3KHHDk). A fully ZN streaming porn zite. Pay a visit if you want. More content will be added if zite is properly shared.",
				"added": 1519906972
			},
			{
				"comment_id": 43,
				"body": "> [wr23ttgrgergnbvg](#comment_19_1F1ucX4cPFMbafzcBipikdP6bWRFg7Da3D): Great, will it keep illegal stuff off, and is it using big file support (if that has not be enabled, not really sure)?\n\nWe plan to stream standard porn only (nothing illegal). We think we are using big files properly: just marking them as optional (we think ZN client does the rest by generating pieces maps, etc.)",
				"added": 1519932912
			},
			{
				"comment_id": 44,
				"body": "It does not work  : (  I have tested from another PC and streaming does not start. Please help! What have we to do to stream big videos (300 MB and 500 MB) properly through ZN? (I think the problem is player is waiting for download the entire video in order to start playing it.)",
				"added": 1519933395
			},
			{
				"comment_id": 46,
				"body": "> [styromaniac](#comment_194_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's working for me. Seeder count it rising.\n\nThank you for testing.",
				"added": 1519989611
			}
		],
		"1520082029_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": [
			{
				"comment_id": 47,
				"body": "The way I do it: edit content.json adding this line near the end (marked with an arrow):\n\n[...]\n \"modified\": 1519988166,\n \"optional\": \"(data/.*/.*)\", <--------------------------------------------\n \"postmessage_nonce_security\": true,\n[...]\n\nYou have to indicate the directories and files you want to make optional.",
				"added": 1520084964
			},
			{
				"comment_id": 50,
				"body": "Your zite (ZeroBooks) works OK. All files download properly. I have also marked DOWNLOAD AND HELP...",
				"added": 1520087571
			}
		],
		"1520069750_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 48,
				"body": "Thank you. I am testing it.",
				"added": 1520085095
			}
		],
		"1520086912_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X": [
			{
				"comment_id": 49,
				"body": "I think if you close access in you router, peers in your LAN will communicate between them. Although in that case I will opt for running a proxy on the main ZN device and just connect to it from the other device.",
				"added": 1520087272
			}
		],
		"1527243612_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 51,
				"body": "A great project indeed. I hope developers continue working on it.",
				"added": 1527322679
			}
		],
		"1529168517_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": [
			{
				"comment_id": 52,
				"body": "what is the purpose of the share? to upload files for you?",
				"added": 1529789195
			}
		],
		"1538914839_1AWSA7oG2qrhWYgeSiJtDHCwc2KvyR7ijs": [
			{
				"comment_id": 56,
				"body": "It is available at RARBG.",
				"added": 1538979214
			}
		],
		"1565966228_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn": [
			{
				"comment_id": 57,
				"body": "Nintendo Switch sucks. An all-terrain console good for nothing. The worst part: the controller. It is very unconfortable. I have one and I never play with it. It definitely does not worth the money. Get a PS4 (for home) or a 3DS (for travelling).",
				"added": 1565988942
			}
		]
	},
	"comment_vote": {
		"7_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"13_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1,
		"63_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": 1,
		"1_1AFtMdgzRba5guZq9adiRVacaRiFwkYe2F": 1,
		"1_13tVpiS2RZ6hQw512MrbY7JmDjZQJh7go9": 1,
		"57_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1
	}
}