{
	"title": "Johnny's Journal",
	"description": "Notes to self so I don't forget",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1517142345,
	"post": [
		{
			"post_id": 5,
			"title": "Escapism and unhappiness",
			"date_published": 1517142291.707,
			"body": "I get the [Escapism](https://en.wikipedia.org/wiki/Escapism) feeling now and then. But I've recognized that its simply a signal that things aren't going the way I want to.\n\nI've done some self-reflection, started writing goals, re-defining goals (what I want in life), re-defining goals again, learning about myself, more self reflection and finally I started feeling better on average.\n\nNow I have a journal with I roughly 10 pages where I go and read if I see that I am starting to stray from my path and feeling unhappy and it gets me going again, because I wrote down things that matter to me and are achievable.\n\nThen I came across [this gem](https://www.youtube.com/watch?v=eok34BJwIm4), where they explain what happiness is. It is simply a measure of your current path. Even if you're at a bad place, but taking the right actions, you'll find yourself happier than before. And even if you're \"successful\" but are doing bad things you'll be miserable.\n\nThat confirmed my observation that its important to work on your goals (what you want in life - doesn't have to be material at all, whats important to you) and working towards them."
		},
		{
			"post_id": 4,
			"title": "How to manipulate the masses",
			"date_published": 1516356496.936,
			"body": "The easiest way to manipulate the masses is to ignite emotional response.\nIt is very hard to think rationally and critically when its fogged by strong emotions.\nOr to have a civilised dialog.\n\nTherefore tribalism and partisanship is very desirable thing to ignite, because you allienate people who you disagree with and not allow them (or yourself) have a chance to see the other one's point of view.\n\nDivide and conquer.\n\n[https://en.wikipedia.org/wiki/Tribalism](https://en.wikipedia.org/wiki/Tribalism)\n\n[https://en.wikipedia.org/wiki/Partisan_(political)](https://en.wikipedia.org/wiki/Partisan_(political))"
		},
		{
			"post_id": 3,
			"title": "How to make a real artificial intelligence",
			"date_published": 1516133323.079,
			"body": "A thought crossed my mind about neural networks and evolution.\n\nWe can make simple neural networks that do simple tasks and answer questions for us, but how about something as complicated as a real, indistinguishable AI?\n\nThis is probably obvious to anyone playing with neural networks but I haven't seen it stated anywhere so here goes my theory:\n\n1) Map out man's evolution each step at a time based on hurdles (filters) our predecessors had to overcome (learn to see, walk, plan.. but much more granular)\n\n2) Figure out the filter that was used to change from point 0 to 1, from 1 to 2 and so forth.\n\n3) Apply the same filters to create neural networks. Use models of primitive organisms as starting point and if those filter don't work, iterate until you figure out whats missing\n\n4) Work through all the stages from 0 to human. This might take a while, but understanding how to make each step will probably lead to deeper understanding of the evolutionary process.\n\n5) Done, you have an AI\n\nHurdles:\n\n*   computing power (might require advancement in hardware, likely to happen regardless on its own)\n\n*   our understanding of complex biological neural networks (easily solved by going in steps)\n\nThats it. Probably naive approach but its still fun to think about it this way.\n\nWhere I got these ideas from:\n\n[Fermi paradox](https://www.youtube.com/watch?v=sNhhvQGsMEc&t=1s)\n\n[Walking evolution simulator](https://www.youtube.com/watch?v=GOFws_hhZs8)"
		},
		{
			"post_id": 2,
			"title": "How can creators going to get paid for their content on Zeronet",
			"date_published": 1516101359.523,
			"body": "My observation about how YouTube's demonetization actually shows a way to reward creators without the need for advertisers.\n\nYoutube, while failing on the Ads side of things, has shown us that creators are willing to put their stuff out for free with the promise of making it one day.\n\nEvery serious youtuber's dream is to be able to do what they love full time, which currently takes form of them setting up a Patreon, which means their videos can be demonitized but they still get some money out of it from their followers.\n\nI support a few youtubers that way, but right now it seems very inefficient, since I am paying those that I may not be watching right now and not paying those that I am watching (since I watch only few of their videos).\n\nWhich I consider unfair but its too much hassle for me to manage this every month.\n\nSo going one step further, I would prefer to give a fraction of a cent to each video I saw, but that means it has to be automated. By YouTube or a third party.\n\nThat way, everyone gets paid by their viewers in proportion of how much time the viewer spent watching their videos.\n\nYou may say - but what about those animators that produce short content vs someone who makes 20 minute rants?\n\nWell, how about you choose the default way of dividing up your contribution yourself, how does that sound?\n\nThe user would decide how much to divide each month (say 1 usd), and then they would have options about how to divide it:\n\n*   each video gets amount equivalent to how much time you spend it it\n*   each video gets amount equivalent to how much time you spend it it + 2x boost if you liked it\n*   only reward videos you liked\n*   only reward videos you liked + videos by authors you're subscribed to\n\nOr even another model, it only has to sound fair to you, since you're the one who is willing to part with the money. But it has to be semi, or fully automated.\n\nYou don't even have to pay for anything, I would still keep the free option, or even give users the ability to spend less than a dollar monthly contributing to the creators.\n\nAnd for the left-minded, you could choose a model that gives more to the small channels and less to the big ones. I watch smaller channels way more than the big ones so its not really an issue for me."
		}
	]
}