{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "A few minutes of searching tells me that it may be *[Disocactus ackermannii](https://en.wikipedia.org/wiki/Disocactus_ackermannii)* (or the related hybrid) due to the leaves' shape. Not sure if D. ack. can have yellow flowers, though.\n\nPosting this [here](http://gardening.stackexchange.com/) should get you a more confident answer.",
			"post_id": 33,
			"date_added": 1461622340
		},
		{
			"comment_id": 2,
			"body": "My guess is that your node is asking a random (?) set of nodes if they want any content from that site--or if they have newer versions of files on the site.\n\nTry visiting the [stats](/Stats) page and looking under your site's url, that might give a hint.",
			"post_id": 36,
			"date_added": 1463330586
		},
		{
			"comment_id": 3,
			"body": "Quick question: were you looking under your site's url, and clicking the link that lists ip addresses of each node? just making sure.\n\nAlso, I have another possible idea: some of the 'peers' you see may be your own nodes counted twice (I think zerohello does this?). Again, looking in stats may clarify things.",
			"post_id": 36,
			"date_added": 1463427681
		},
		{
			"comment_id": 4,
			"body": "Two more thngs: [Here](http://www.ip-tracker.org/locator/ip-lookup.php) is an ip-looking up site; the info it gets for you should be _mostly_ right.\n\nAnd [this](https://github.com/HelloZeroNet/ZeroNet/blob/9f5917325bbf665acca7b759a9af7a8beaca4cf7/src/Config.py#L33) is the list of trackers. You can use the above site to find their IP addresses.",
			"post_id": 36,
			"date_added": 1463433244
		},
		{
			"comment_id": 5,
			"body": "I just thought of something: maybe try making a site (and sharing it with your VPSes) again, but don't let them connect to trackers (via some firewall rules, perhaps). If this still happens, that makes it more likely that some of your nodes are being double-counted.\n\nOne other idea: somebody on the network may have a node setup that automatically looks for (and seeds) new sites. Not sure how to find that out besides asking around, though.",
			"post_id": 36,
			"date_added": 1463507241
		},
		{
			"comment_id": 6,
			"body": "> [ks](#comment_51_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): My nodes aren't double counted, but 178.63.104.217 (which isn't mine) is counted 13-15 times and none of the connections use the standard port 15441 (instead they use random ports as if 178.63.104.217 is connecting multiple times to my node and not the other way around),\n\nAh, ok. Didn't know that.\n\nAre any of them using the tor plugin, by any chance? I don't remember for sure, but tor might make use of random ports.",
			"post_id": 36,
			"date_added": 1463511262
		},
		{
			"comment_id": 7,
			"body": "> [ks](#comment_52_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): None of my nodes are using TOR, and there are no *.onion hosts seeding the empty zite.\n\nHmm... Ok then. I have another idea to throw at you: \nZN uses Bittorrent's [DHT](http://www.bittorrent.org/beps/bep_0005.html), and I'm pretty sure it makes use of [BEP 44](http://www.bittorrent.org/beps/bep_0044.html) so that it can store non-torrent data in the DHT.\nSomething in the DHT spec might offer a clue.",
			"post_id": 36,
			"date_added": 1463517851
		},
		{
			"comment_id": 8,
			"body": "Wait, nevermind. Ignore that last comment. [DHT support](https://github.com/HelloZeroNet/ZeroNet/issues/57) is still in the works.",
			"post_id": 36,
			"date_added": 1463526967
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}