{
	"title": "Human Things",
	"description": "My Blog.",
	"links": "- [Fengshui](http://127.0.0.1:43110/1CH2gdZh6MoqVXryGXaxrJFG2gd6GDuJM1/)",
	"next_post_id": 12,
	"demo": false,
	"modified": 1468144095,
	"post": [
		{
			"post_id": 11,
			"title": "黄",
			"date_published": 1468143894.143,
			"body": "她外号“花枝”，老爸是京城某区法院的法官，老妈职业不详。因为她每次笑起来一种花枝乱颤的感觉，长得比较欧式，混血美女的感觉，身高173cm，波浪大卷长发，身材骨感美那种。这种姑娘一般不大受女伴们欢迎，因为外出时，许多男人都会无视花枝其他女伴的存在，用大掌直接左右开弓拨开她们，一脸谄笑着过来搭讪。\n\n\n　　因为楼主一向也是男女老少通吃，待每个人都挺亲切的，又有着宽大博爱的胸怀，基本不会嫉妒或者小心眼，所以和花枝关系还真不错。突然一想，我好像基本和大美女们关系都不错啊，而且都是极品女人（气质、学历、外形、家境、财富等至少4A以上级,30%达到5A）。因此常被男士们妒忌和巴结，想想也对，这样的境遇，真是枉费自己身为女纸啊，哈。\n\n\n　　去年，花枝刚把低调的尼桑换成了赭石色的大宝马。还跑来我家，拉着我去停车场看，大笑说：看啊，这以后就是我们的座驾了！我说，行了行了，你的就你的，扯上我说这么好听干嘛。想想不对，我又笑了，说，全国正在打击腐败呢，你这车换得不是时候吧？这不是出卖你爹吗？她还挺急眼的，当场就申辩说：去！这可是我家卖了旧房子以后给我补贴的一台车啊！我说好好好。\n\n\n　　最早，我和花枝在一次群体活动中认识的。前年、去年，当她还是单身的时候，我们经常见面。今年她交了男友，有点见色忘友了。她其实也是个心思单纯的孩子，远远不像她外形那样成熟。花枝信佛教，也接触过道教一些朋友。花枝的手上，满是各种各样的串珠什么的。\n\n\n　　其实我和花枝一起，除了吃吃饭，喝喝红酒，还喜欢聊些各种各样的奇异见闻。每次微醺，晃着杯子，再说起那些我们自己也不明真相的困惑，两个人就笑啊，傻乐啊，当然我也陪她哭过。花枝算是一个体质比较敏感的孩子，她曾经见过一些东西。我一度在想，是不是因为她太瘦有关，太瘦的人会不会太虚弱呢？花枝最令我诧异的经历，是说起有一次她重病。当然后来还急救过。她也是感到自己浮起来，缓缓上移，然后用低头的角度看到自己的爸妈围着躺着的自己，一脸焦急。\n\n\n　　花枝那次说，她看到她家的大黄狸。那只猫也抬头看着她。她认为猫铁定是在盯着她看，猫还叫了一声。用爪子挠了她妈妈一下。她妈妈没有回头，就是一直看着自己闺女躺在那里。估计情绪也是不好的时候。后来她就有点恍惚，往外走。外面都不是她家原来的样子了。后来她好像走到郊外的感觉。感觉天色像有沙尘暴过后的那种昏黄色。再看地也是土路那种，昏黄的土。然后草木什么都没见到，就有点颓废凋零的那种感觉。然后看到比溪流大，比河流又小一点的水流。淙淙流淌。她后来就沿着水流走，她发现这水也不太清澈，夹带黄沙的感觉。我想，姐们你是不是见到黄河了？\n\n\n　　记得当时花枝翻好大一个白眼，还吐出一个“屁”字，实在有失她美女的身份。她说难道你们分辨不出黄河多宽广辽阔吗？那样子就是个小溪流。后来路上前后一个人都没有，她昏天暗地的走了很久，然后有点清醒过来，觉得这里前后一个人都没有，又不知道要走多久，好像不太对啊。她感觉身体很疲惫。觉得不想走下去了。她想起爸妈那样的表情还守在床前的，所以花枝就很想回家。然后就反方向走的，后来走着走着，推开出来时的门，她居然又回来了。然后就醒了。\n\n\n　　当时花枝身体还挺虚弱，她醒来就盯着猫看。猫也还是看着她。事后她说这事给父母听，不过两人都是老D员那种，比较无神论，压根就不信。她说给我们听，我们也讨论过这事儿。后来有个朋友听后挺吃惊的，说，黄天，黄地，黄水，那地方不就是黄泉吗？我们当时都汗，说，花枝你好歹算是回来了。不然你爹妈得多伤心啊。她说，能证明我真相的就是我家大黄，可我家大黄不会开口说话啊。花枝当时说这话的时候，她家大黄还是伏在沙发边的。 "
		},
		{
			"post_id": 10,
			"title": "阿卿",
			"date_published": 1468142383.328,
			"body": "我以前曾经是勇者无谓的那种人。总觉得有些人疑神疑鬼，说什么前生今世，轮回，神经兮兮的，说鬼，真的有么？而且我深信，不做亏心事，不怕鬼敲门。要是不幸鬼真的敲门了，比方说它是我以前冤亲债主什么的，来有仇报仇，有冤报冤的，那我也只好呵呵了，以前的事情真的忘记了，要是以前真的冒犯过，该还的就还吧，还能怎么样呢？当然，它远道而来，得先诚意给人家道歉，为自己以前的过失。然后就认了。我曾经这么想过。所以还真没怎么在意神神鬼鬼的事情。\n\n\n　　记得看恐怖电影，在影院的时候，是男人在畏畏缩缩的拉着我手臂一起看，几次途中说“我们走吧”，“我们走吧”。最后被我鄙视之，从此将这个追求者拉入黑名单。想想自己真是彪悍，就不能装的“好怕怕啊”然后柔情似水吗？算了，不像我风格。总之，陪着闺蜜的时候，也是她们围我在中间，缩着坐在一起。我经常把那些鬼片当滑稽片看了。因为我知道，鬼根本就不是那么出现的，鬼也不是那么张嘴说话的，为什么？因为，后来无意中遇到过几次了。这个以后在别的事情中单独说吧。\n\n\n　　不过，后来一年年的，在成长。小时候遇到奇特的事情，都会被大人们压抑住，不许乱说，不许胡讲。哪怕和家人做一样的梦，去了一样的地方，经历的事情都能链接上，他们严肃的表情也告诫你不能乱讲，谨慎言行。好吧，长大了呢，朋友们的事情，工作圈里，生活圈里，某些怪异的事情接触多了，心底也会有疑问。鬼见过了，不止一次。就会知道世界上有鬼，可是又在想，真的有轮回吗？我们做了坏事会被报应吗？\n\n\n　　我还曾经脑热尝试过台湾某某大师语音的那种催眠音乐，当然，后遗症也不小。醒来后头剧痛无比。而且连续几天都这样的状态。算是缓了至少三天才好。当时没有成功被催眠，好像我意志力太过于坚定（我这种人，做梦有时候都清醒得知道自己是在梦境里，还要飞就飞，要走就走，仔细看清楚对方的脸，说醒来也要记住面孔，腾起半空中几十米哈哈大笑觉得好玩，所以我这种是不是无可救药了，意志力太强了，梦里都顽皮，更何况催眠呢）。虽然那某某大师语音催眠不成功，但事后我倒是断断续续做了好几天的怪梦，不是在这个地方，就是在那个地方，但是都是同一个时代。\n\n\n　　里面有个人出现，虽然音容笑貌都不同了，但是她有个标致动作，一看到就知道是我老妈。而且这人一出场，我就知道是我现在身边的人，是我妈。还有一个人，我的挚爱。好像这辈子都没有梦里这样爱过人。我也不懂这是脑电波被那语音刺激的，催生出了梦境，还是那是我前世片段的一种折射？那些天，梦境各不相同，但是事情都不一样，身边人基本相同。但这种事再也不想尝试了，因为后遗症太痛苦。我怀疑对我身体有不良影响。\n\n\n有个姑娘，这里就称为阿卿吧。她家是北京中层小康的人家，父母均在国企稳定工作多年，直至退休。阿卿和我关系不错，算是个悟性很高的孩子，而且直觉很准。心底很善良，不仅仅是同情弱者，喜欢小动物，看到阿猫阿狗必摸那种。而是谁真遇到事了，谁喝多了，谁谁来哭诉了，她义不容辞挺你到最后，比你更伤心，不论凌晨几点都去给你接回来那种。她感觉基本很准，朋友圈里，如果她见过谁谁感觉不好，或者感到谁不可靠，最后结果总会证明她是对的。阿卿是那种眉目清秀，端庄里却带一种媚态的女人。她离奇得找到一位京城高官的公子做男友，后来结婚。如果百姓们认为一般官二代和富二代无能者居多，我很遗憾的想说，那只是电视剧和小说的产物，也是低收入者一厢情愿自我慰籍的想象。 \n\n简单来说，因为很多身为二代的孩子，从小父母已经耳濡目染给了许多特殊的教育。因为父母不是在泥巴里打滚的，不是在街上摊烧饼的。他们会教你如何保护自己，如何识人真面目，何时装疯卖傻，何时沉静如山，怎样不损害别人利益下实现共赢??立场和角度不同，父母格局高远，带出来的孩子从小的气场也不同。长大后那种气质，你在人群中远远一看，还是能一眼瞥出来的。所谓老百姓说的厚黑学，哲学，攻心术这些，其实在海外只有部分特定阶层才会特意灌输教给下一代，让他们为接班做好准备，并且要驾驭好自己带的人，自己的团队，自己的企业，自己的百姓。而中国因为古文化的影响，是个人都在钻营这些。\n\n\n　　但毕竟正规科班出身和夜路会有不同，所以家里如果往来皆巨商，孩子算盘也能啪啪响，如果父母往来皆官场，孩子识人与伪装也自成路数。所以古人才会说，虎父无犬子，这是有依据的。当然，我不否认寒门也会出贵子。尤其有上进心又孝顺的人，我非常欣赏和钦佩。总而言之，孩子自小耳濡目染的东西，往往会影响他们今后的人生格局。格局多大，事情就能做多大。\n\n\n　　算了，先说到这里。省得说太多了，会被某些仇富恨社会的愤青拍我砖。我发现怎么一说事情，铺垫的废话就会很多。以后我要注意。继续说阿卿吧。她听了我说的催眠音乐带来的后期的种种梦境，很好奇。但我一再告诫她还是别走我的路，那后遗症太强，头痛的厉害，估计对身体有损耗，尽量不要尝试。她也就打消念头了，但是她的好奇心还是不止，后来就问朋友，问来问去，朋友圈里问到在青海的一个懂点儿道术的人。好像是道术吧？我记错了吗？算了，错了我后期再告诉你们纠正吧。 \n\n那个人教了阿卿一点古怪的方法。大意就是要找一间没有窗户的房间，里面也要空荡荡，什么都不要放，只要一张床。这个房间不但没窗，还不能透光。不要开灯，大概多少多少天。门口的缝隙也不要透光。到了日期，然后做个简单什么式，就可以进去睡觉了。睡觉前会打坐的话最好静坐一会儿，平心静气了再进去睡。然后，基本醒来，回忆梦境能看到自己过去的很多事情。这事儿有多大的靠谱程度，其实我们谁也不知道。\n\n\n　　后来阿卿怎么去找的符合条件的房子，我就不清楚了。大家都没在意这事，觉得阿卿有好奇心，也就是这么两天的事。就这么过了一段时间。突然，有一天凌晨2点多钟，我迷迷糊糊接了阿卿的来电。刚接通，就听到那段有她断断续续抽泣的声音，我喂了好几遍，她也不言语。当然明白她可能已经在那个房间睡了一夜了，当我再想说点什么的时候，她重重鼻音的哭泣声没了，一声特别长的悲愤到极至的大声哭吼，带点嘶喊， “啊——————！”一声，像是一个经历了浩劫或者巨大背叛的人，对天狂吼一样的感觉。那是一种难以名状的愤慨和激动，悲伤，还掺加有一些不甘心的怨气在里面。我一下子就沉默了，什么都没说。过了几秒钟，阿卿狠狠的来了一句，我好恨他们啊！然后又继续哭了。我说，我去找你。挂了电话，套上衣服，马上就出去了。\n\n\n　　走在路上，我就突然觉得，有些人说得对，某些以前的事情，不知道更幸福。转念一想觉得也不对，哪有这么容易的事，也许阿卿做了噩梦也不一定。即使不是噩梦，是真的以前片段的折射，我也一定会说服并安慰她，这只是一场噩梦而已，什么前世，什么轮回的，都狗屁。 \n\n等找到阿卿，已经一个多小时以后。她电话里说的这地儿还真不大好找。事后据她说找的是她表姨妈家，她家就有这么小小一间空房，没有窗户，以前放几箱东西的。东西已经搬走了。当时心里感叹，女人要是想要折腾，真是怎么都能找到办法。见到阿卿时，她情绪已经平静一些了，抱着杯子有点发呆的眼神在喝水。若有所思的样子。我坐过去，她缓缓开始说。\n\n\n　　她说自己躺下去就好像开始看电影了（我觉得可能她在做梦？不好判断），这种感觉好像是看了一部漫长的高清晰度的电影，从一个女子的出生到死和死后的恩怨。场景变化的很快，有些事进度特别慢（比如她死亡的时刻），有些事好像一晃而过的感觉。她的视角都是主人公的视角，所有经历的一切好像身临其境一样。但是，太悲愤了。阿卿一直摇头，说不甘心，强烈的不甘心。要找到他们质问和惩罚的心情。不明白她指的“他们”是谁，所以我劝她慢慢说。\n\n\n　　阿卿说，看时间背景好像是很喧闹的大都市，有点夜上海的感觉。年代好像又久远，她好像在感受一个女孩从生到死的过程。这个女孩出生比较贫苦，加上逃荒什么的，反正失去家人了。一个人独自在打拼（某些事情省略）。后来凭借自己努力，经常混迹于这个城市的上等圈层。那些汽车排成一排在什么百货店前面，都是老爷车那样的款，还挺漂亮的。男士们常对她献殷勤。她当时很喜欢那些车。她喜欢那些老爷车停满的地方，说那里有沙龙舞会什么的，说她总是聚会中最耀眼的明星。感觉有点像上流社会里的交际花那种。\n\n\n　　她说还看到了有不同颜色的气球和彩带、假花插在花瓶里那种（我心想，那年代有气球吗），阿卿说，好多女人都穿着旗袍的，也有小孩卖报，有人要饭。我问她，你也是穿旗袍吗？她说对。阿卿还说，她很受欢迎，走哪里都被人夸长得美。好像她很喜欢照镜子，时不时要照镜子，很注重自己的外形。说脸很粉白，嘴唇挺红，看起来比较有女人味，带点媚劲和妖娆的感觉。我问她，那镜子里的样子和你现在，一样吗？阿卿遗憾的表情说，不一样啊，那个样子太出众了……\n\n\n　　（阿卿好像言外之意，要是现在能长成那样也不错。我这时候想起来，有谁说过人轮回转世，生生世世面貌都会一样来着？那阿卿这个就只是梦吧，我当下就想，那就当她做梦来听，安慰她一下好了）\n\n\n　　这个交际花性格也比较清高自傲，她基本对自己的优势心知肚明，还有点小得意的心情。时常故意走过那些身边挽着先生手臂的太太前面，看到先生流转出不自觉的关注目光，和女人们妒恨的目光，她好像感觉也挺惬意……（这里我插一句话吧，人傲气过甚，再加目中无人，还有故意招惹，必然遭损。这是后来我们把这件事和一位佛教理事会的**长聊起来时，他当时的一句劝诫。他说这交际花后来遭遇的事情，也多数出自她自己的因果累积和修为，是一种障）。我后来就笑起来说，阿卿，你现在虽然没有那么明显的自恋，但你确实也经常照镜子啊。阿卿不满的说哪有。我就没打断她，让她继续说。\n\n 后来场景就转到一个什么舞会上。她在外面也看到那些漂亮的老爷车，入场后还给一些熟人打着招呼。一摇一摆，扭着腰肢，昂着头优雅又从容地走过去。她看到远处的一个圆桌边坐着一个男子。他长得很俊朗，气质非常好，在人群里就像她一样显眼，但是表情挺冷峻。交际花有点一见倾心的感觉，一直盯着他看了好几次。\n\n\n　　这个男人穿着旧式的那种西装，里面还有马甲的那种。他旁边坐了一群纨柧子弟，一个个嬉皮笑脸正开着玩笑。这群人基本都是群富少。其中有个胖子，交际花认识。打过交道。记得胖子纠缠过她几次，都被她笑拒了。要是其他场合再看到胖子，她也许会皱眉然后绕着走。但这次，她有点特意主动迎向胖子。阿卿还说，这胖子穿着灰白的衣服，肚子大大的，还戴礼帽的那种。胖子当然高兴，对交际花嘘寒问暖。闲聊几句，就叫她来他们这桌小坐一会儿，介绍些朋友认识。这当然对她胃口，正合她意，于是她就过去了。\n\n\n　　胖子给大家一一介绍交际花，果然一群富少又是趋之若鹜围拢起来。她后来欣赏歌舞的时候，尝试和这男子多聊几句，不过对方总是不冷不淡的感觉。清高也一如她。再后来就是交际花和这男子单独接触的几次了，这男的据说是当时有名的影星还是明星什么的，反正是娱乐圈的了（我听到这里觉得，难怪，也不委屈了他这份气质和这张脸）。好像交际花对这男的感觉非常倾心，非常牵肠挂肚。至于男的对她如何，后面就知道了。 \n\n\n　　然后这胖子因为面相不善，人也有点痞气，最初交际花就不是很待见他。后来的事说明了，老祖宗说的对，确实相由心生（面相，30以前靠爹妈给的，30以后是心性养的）。后来这胖子果然憋着坏水。他和其他一帮富少们攒了个局，局中的核心人物就是这交际花。当然，身边一群小喽啰也没少出力，大家日常也看得出交际花对这影星俊男比较倾心，所以就以他做饵，约交际花出来约会。她自然是满心欢喜，一口答应。来了之后发现怎么一群人，都是不怀好意的笑。地点定在一个废旧库房（还是工厂，阿卿说大概那样子），落满了灰尘和蛛网，离市区还比较远。交际花最初没有设防，以为是被约在郊野散散心的，还心有所期待。胖子领的路，说男人在等她呢，还有几个朋友也在。\n\n\n　　等进了空旷破旧的大厂房，她就感觉就不大好了。几个人皮笑肉不笑的看着她。地上还有不少垃圾，窗框都是破的。有人坐在椅子上，有人坐在老旧废弃的沙发上。大家有点半围着圆冲着她。她跟胖子来以后，就傻了，定定的站在中间。好像一个剧场台中央的小丑一样。这个措手不及的情景，枉费了她精心描画的妆容和最爱的那身旗袍。\n\n\n　　最让她震惊的是，他竟然也在。他果然在。依然远远坐在一老旧沙发上，翘着一只腿。旁边几人还在说笑，撇着眼神，看着她。交际花心底燃起一丝希望，看向他。可是男人面孔还是很冷峻，虽然面容英俊如石膏像一样。他全然一副置身事外，毫不关己，看热闹的样子。这一瞬间，交际花的心凉透了。胖子第一个上来，开始推推搡搡，上下起手，还调笑两句，旁边几人都是嘻嘻直笑。交际花愤慨起来，护住自己，左躲右闪，后来胖子拽住她的头发，她几乎半跪在地上，膝盖很疼，始终还昂着高傲的下巴。\n\n后来其他人按捺不住，也一个个上来，又是胁迫她，又是调笑，都是一脸猥亵的样子。这时候交际花才开始内心的恐慌，他们比她想的还可怕，简直就是有预谋的。她慢慢没有了开始的高傲，开始害怕，缩在一起，然后求饶，不断的求饶。她的求饶好像主张了大家的斗志，最后连些小喽啰都上来了。那男人，依旧远远旁观。他没参与，只是冷冷的眼神在看（后面情节省略）。交际花一直在嘶喊，在哭，在求饶，他们每一个人却都在笑。她的衣服早破了，领口被撕开，头发散乱，失去了光鲜的样子。刺绣的小挎包都被歪歪的扔到地上。\n\n\n　　她恨透了他们每一个人，她嘴角流着血，身上也是血。她心里暗暗地想，只要能回去，她要他们血债血偿！她要让他们妻离子散！她要让他们每一个人家破人亡！但是，眼下她仍然被这些男人抓住头发晃来晃去。连挣扎的力气都没有了。他们觉得她是一只斗败的孔雀，只好匍匐在他们脚下，不断坚持着最后一口气，还用微弱的声音求饶。\n\n\n　　平日里她那么威风八面，那么不可一世，那么不屑得看这些献殷勤的男人，可现在呢，她还成了一只斗败的母鸡？男人们一个个充满了斗志，觉得自己往日里的低眉顺目和讨好好像都没有了，他们现在像君王一样，自尊心瞬间膨胀了拜拜，每一个人都热血喷张地蹂躏着这个奴隶。没有人再去关心她的奄奄一息，没人在意她的死活。她为那个心上人而来，可现在心上人像是在欣赏一部情色电影一样，悠然在一旁冷眼旁观。也压根没有施以援手的想法。\n\n\n　　（阿卿说到这里，又一次泪流满面，她摇晃我肩膀说，你知道那个女人的感受吗？你知道吗？恨到骨髓里，恨到咬碎牙齿，就是九生九世也要找到他们，要他们统统死掉，要找到那个男人质问他的想法……然后阿卿大声哭起来，很悲痛的声音） \n\n后来，交际花在有点神志不清的混沌状态中，想到一个自救的办法。她决定装死。她需要逃过这一劫。其实，她现在也和死了差不多，她好像连痛都感觉不到了，哼都哼不出一声。果然有个办事的小喽啰发现了不对，他对大家喊，等一下！人好像...不行了！每个人都沉默了，有人过来探了一下她的鼻息。马上吓到一样弹回去，说，怎么办，真死了？\n\n\n　　胖子和其他几个人公鸭嗓喊起来，死了又怎么样？老子会怕她？还不是贱命一条，你们几个都别声张，就没事！要声张也没关系，可别忘记了，你们每人都有份！！一下子所有人噤声了。胖子带着头，喊几个人搭手，说把尸体运走，最好能掩盖着带上码头，绑着重物沉海什么的。交际花当时心里就在想，那趁着运送的途中就跑吧。\n\n\n　　后来小喽啰有个手脚不利索的，搬运时没稳住，交际花身体一下翻转过来，面部朝地。她居然没感觉到痛，但是她好清晰的看到地上那些沾到她脸上和鼻尖的厚厚灰尘，她感觉到灰尘在瞬间的扑腾飞舞（我觉得阿卿要是看得这么清晰，是不是梦，就不好界定了）。她依旧觉得自己在装死。后来她身边好像什么都消失了，什么都变得混沌不清。就这样，不知道过了多久。后来，好像她听到乐器吹奏打击的声音，还有班子诵经什么的（阿卿说，那种感觉，一片混沌，睁眼什么都看不到，却听到种种的声音。好迷茫，好困惑，当时觉得像是谁在超度什么的氛围……）。然后，交际花听到一个声音，但是看不到人，是男音，挺沉着从容的声音。在劝她，投胎去吧。\n\n\n　　交际花瞬间愤怒起来，我在装死，我在等逃跑的机会，你叫谁投胎啊？声音继续回答她：别执着，你已经死了。她更加愤慨了：我没死！我没死！我什么时候死的？！我怎么都不知道！凭什么我死？不是他们死？我还有好多话没说，我还有人没见！我正当年华，我为什么要死？！\n\n\n　　她说着说着，有点意识到，可能自己已经真的死了。一边骂着，一边哭起来。满心的不甘愿，满心的愤恨。她说，我还有人没有见，我要当面质问他，我要听他的解释，我要问个清清楚楚、明明白白！那声音好像知道她说的是谁，依然劝她：算了吧，投胎去吧，从一个婴儿开始新的一辈子，你和他这样的渊源是断不了的，以后还会见到…… \n\n交际花静心也想了想，后来不认可。觉得再投胎就要从婴儿归零，一切重新开始。她现在所有的一切，她的姿色，她的风采，她正当年华的年龄都没有了。即使再见到他，找到了他，要质问他，她和他那么不同，她怎么来问？交际花想明白以后就怎么也不同意了，说就是不走，她要见到那个男人，她要问清楚所有的一切。（阿卿说，感觉这个女人心底也满脆弱的，好像她只是要等一个解释，等一个求饶，或深情的告白，也许就能释怀。但她现在就是不想放手，虽然明明清楚不会得到了。只是一种深深的带着愤恨和不甘的执念）\n\n\n　　那声音觉得真是不容易劝动她离开，就换了个思路说：你就算找到他，他也看不到你，听不到你的声音，你又拿什么去和他说话？交际花突然思路来了，心想，对，如果我真的死了，我就是鬼。鬼需要什么，需要借别人的嘴说话，那我一定要找个女人，至少也要看起来年龄和我差不多的女人，我才能找到他去质问他！她的想法好像那个声音都明白，只听到一声深深的叹息。离开的时候，她好像有点明白，这声音有可能就是主持这个超度班子的老人。但为什么寻他不见，什么都看不见，迷茫一片，她不明白。\n\n\n　　后来，交际花好像是一种在一团雾气中迷茫前行。她有时又像是在俯瞰，但距离不远，就是离地面几米的距离俯瞰的感觉。但是怎么努力也看不清楚。她发现了一个年轻女孩，走着路，低着头。她一下瞅准就跌下去一样。感觉瞬间眼睛就清明起来，周围的什么都看得清晰真切了。然后她呆呆的走回家。其实，是走回那个年轻女孩的家。之后又有些琐事，大概就是这女孩总往外跑，总要去那个舞会或者去找那个男人，家里父母觉得很奇怪。问她，她又只是哭，说不清楚。言谈举止都不太像以往的样子。父母起了疑心，找了道士来看。道士敲得家里震天响，她很不悦。\n\n\n　　然后道士告诉女孩父母，说这孩子走夜路不清净，被冤鬼附身了。现在冤鬼要办她自己生前的事。所以一遍遍折腾你们孩子。当时这父母就流下泪来。道士又一遍遍跟家里敲那种黄铜锣还是什么的。交际花嗤嗤笑着，说，就这么点本事，你能怎么奈何我？我觉得一点也不痛不痒什么的。后来女孩父母又流泪，说求你了，放过我家孩子什么的，你到底想要什么，都可以拿去。她说，我要找一个人。但是很奇怪我怎么都找不到他，为什么？你们帮我找到他好不好，我有好多话想说，好多话想问他。\n\n\n　　交际花有时候离开女孩身体出来，四处游走，找那男人的下落。回来时又看到女孩抬起头畏缩着看她，满脸泪光，很害怕的样子。让她想起自己原来无助害怕的时候。后来看到女孩父母不断的流泪，磕头，求她行行好，走了算了，不要记挂人间什么事了。她有点惆怅，又想起过往，大喊：我曾经也有爹娘啊！你们知道我怎么死的吗？！……然后那个声音又出现了。还是劝她，说可算找到她了。说上次没度走，就知道会出乱子。一再劝她，还说现在这个年轻女孩是无辜的，这女孩也不能帮她找到该找的人，忍心看又一个女孩因为她的牵连，生活得这么痛苦啊，和家人面目全非的一起生活，没有自由意志控制自己的举动…… \n\n\n　　有那么瞬间，交际花动了恻隐之心。她仰天长叹，说算了，这辈子就是找不到他。下辈子吧！但是她想看看这声音到底是谁。这声音同意以真面目示她，她也心灰意冷，愿意离开了。那老人出现的时候，长得很清瘦，但眼睛很濯烁的感觉。还微笑着看她，让她心底有点暖意。但究竟老人家是佛门中人，还是道教人士，她始终不知道。\n\n\n　　后来阿卿就醒了。这件事也就到此处了。阿卿说，醒来的时候胸口憋闷，一股透不过气的感觉，愤慨不已。悲痛到不行，这辈子也没有这么哀伤过的心情。起来就想哭，后来就一直哭。还想把闷气撒出去，想大叫，想扔东西，所以就有了她后来电话里的嘶吼。现在说完整件事情，她情绪好很多了。 "
		},
		{
			"post_id": 9,
			"title": "菩萨",
			"date_published": 1468141713.529,
			"body": "小逸的朋友从西藏带来一尊神像，是一位菩萨。据说在寺院了受了很多年的香火，用珍贵的材质制成，菩萨眉中心的红点是一颗小小的红宝石。纯铜的神像，面部还刷了金粉的。于是这尊菩萨被小逸请回家，她妈妈恭恭敬敬放在家里的神龛上。现在也仍然在她江南的家里。因为家里位置有限，那神龛下面是个冰箱。当时家里发生了一些不大顺利的事情。有一次，小逸妈因为自己朋友的介绍，去一个神婆那里问事儿。那位神婆据说是可以“看”到许多人的现状和未来。\n\n\n　　在她的描述中，男人都是树，女人都是花。她说她就是被委托看园子的人。但是谁委托的，具体也说不清楚。小逸妈有点不屑的，不太信。但是朋友推荐来的，不好多说什么。可是刚坐下来，一个字还没发言，神婆就说——哎呀，你们家有一尊菩萨。挺宝贵的呢！小逸妈觉得，好多人家里都供菩萨，未必是真话，说不定是她猜的。后来神婆又说，你们家菩萨受苦了哟，怎么能放在冰箱上呢，每天寒气蒸蒸而上。菩萨不满意那个地方。小逸妈大吃一惊，当下就坐不住了。后来回去赶紧就放在别的地方了。\n\n\n　　当然，这话以后，小逸妈对神婆的态度一下就恭敬起来。报上自己名字等信息，神婆打坐沉思很久，后来说，这朵花年岁挺大，不过花开旺盛，运气是不错的。又说了其他一些事情（这里不便多说了），小逸妈还想试试她，又报了一位阿姨的生辰，不过是位已经过世的人。神婆打坐一会儿就不大高兴了，说不要拿亡人的日子糊弄我！亡人都走了，还有什么好算的！小逸妈又道歉了半天，然后拿出小逸的八字。神婆又神游了一会儿，面露微笑说，嗯，原来你们是母女花啊，这朵花富贵，花开正艳，没什么好担心的！……后来小逸妈离开的时候还挺唏嘘的，说世界上奇怪的事情还真多。\n\n\n　　我后来和小逸聊天说这事，会不会神婆通过小逸妈朋友介绍的，朋友已经透露了小逸家佛龛的事情？也不一定。不过亡人的日子，一看就知道人已经死了的，这个也挺不可思议的。不过，凡事还是存着半信半疑的辩证目光比较好。我和小逸玩笑说，还是等以后我有时间，去你家乡走一遭，去会会那个神婆，用自己的时辰试上一把，就知道她说的准不准了。小逸说，切，你哪里受得了，肯定吃不了这个苦得。那神婆的地方可不在市区，比远郊还远郊，我妈当时和她朋友那一趟去的那个颠肺流离啊，又是转车又是步行的，还走土路呢。我一听闭嘴，呵呵一笑而过。 "
		},
		{
			"post_id": 8,
			"title": "内部接待站",
			"date_published": 1468141151.219,
			"body": "小逸是我很欣赏的朋友，从小因为生活在重男轻女思想很重的家庭里，身为女孩子的她受了不少屈辱和父亲的漠视。后来，她发奋图强去了重点大学，英语八级以上。外形又非常端庄秀丽，气质出众，身高168以上，为人正能量十足。毕业后顺利进了G航，一工作就是七八年。从空姐一度做到乘务长，最后还专为首长赴境外的专机而服务。当然，后来小逸离开了G航。\n\n\n　　G航老领导再在一起聚会吃饭时，还经常叹息说，如今空乘的质量是日益变差啊，不论外形、气质、谈吐还是外语水平、服务质量。学历也比较低，哪有像小逸这一批这么优秀的女孩啦，可惜优秀的人才都流失了啊。小逸妈我也见过，人非常nice，对我很好，做一手好吃的江南饭菜。小逸和她妈妈关系很好，相比较父亲对她的漠视，她也没放在心上。在G航工作的空余时间里，经常带妈妈去各个国家旅行，给妈妈买各种各样的营养品、保养物品和高端化妆品。小逸妈在女儿的“培养”和影响下，气质也越发和普通的大妈们不一样了，戴着首饰珠宝，系着丝巾，那个清雅脱俗。我见到的时候都很欣赏。小逸家的街里邻坊和早期那些不冷不淡的亲戚朋友....听说后来都很艳慕她妈妈，纷纷夸赞养了个好女儿。小逸也算是扬眉吐气了。\n\n\n　　小逸这人吧，为人品行很端正，正能量满满的那种。但对于鬼怪这种未知事物，反倒是有点犯怵。她从来不看鬼片，也不喜欢晚上讨论这类的话题。上周末我们和另外一位朋友一起开车去承德寺院游玩，路上她给我讲了曾经去外地执行任务时的离奇经历。其实航空圈女孩子中有个很好笑的规律。有的空姐听说自己同伴要接下的飞行任务里，含有外地住宿，如果是涉及某些地方（比如福建）就会“好心”的提醒一句：晚上睡觉，“注意”些啊。\n\n\n　　当时，小逸和同伴她们好像去了东三省某地执行任务。夜里要下榻在张学良还是哪个军阀的一个旧府邸，历史悠久，但现在作为内部接待站、招待所这种的地方。已经住过的空姐当时提醒过她们，那里好像有点奇怪，你们睡觉的时候要注意。据说，曾经有些机组集体外出宵夜或者吃喝、聚会，但有个别姑娘留在房间不想去，结果就惊慌失措称见到鬼，或者鬼影飞过，或者看到奇怪的人等等。这样的事例已经很多次。小逸当时算是新人，既然分配到这样的任务，也不好说什么。为了不影响第二天的飞行，她们早早赶到住宿地，准备洗漱后尽早休息。看到旧楼的外观，还是有点沧桑感的。里面的层高非常高，比较空旷、宽大的感觉。大大的窗户里面都是很厚的绒布窗帘。\n\n 小逸她们被分配到楼上最末尾的房间。我听小逸说到这里的时候，提醒她说：一般大家酒店或者外地留宿，都尽量避免在把头第一间或者长廊最末尾，还有电梯冲着的房间的。风水上不好，而且那种“朋友”也特别多。她感叹说，是啊，那时候我们哪里懂这个呀！反正那是我第一次遇到这种事情。\n\n\n　　小逸她们上了楼，看到房间还挺宽敞的，特别大，显得两人的床倒是小小的。两扇窗户都是已经挂着厚重的窗帘，而且是最里面的房间，所以两扇窗户有点圆弧的转角，那两面墙都是转角的。估计楼的外面也是古典的、旧旧的那种老府邸吧。小逸的同事哗啦一下拉开了一面窗的窗帘，看到窗外的大树，感觉还可以。但就是房间里面有点深沉的色调，压抑的感觉。小逸也哗啦一下拉开另一面窗的窗帘，当时就大大尖叫了一声。因为这窗帘后面居然不是窗户，而是像窗户一样的一面大大的镜子。小逸拉开时，昏暗的灯下看到的是自己的身影，没有心理准备。就吓了一跳。镜子为什么放在窗帘后，也伪装成一个窗户？她们面面相觑，谁都不知道。\n\n\n　　后来小逸去卫生间洗漱，回来时她的同伴已经带着哭腔和呆滞的表情。她问为什么，同事（也是空姐）说，看到那镜子前有个身影飞过，很快速的。当时同事吓呆了，转头看自己身后，却什么都没有。然后惊讶过度的时候，她嘴巴张着，但发不出声音来。就这么呆了一会儿，小逸洗漱回来的。同事缓过神，就和她讲了。两人挺害怕，又没有办法。后来想办法要睡觉。把窗帘再重新拉回去，盖住那个面大大的一面墙的镜子。两个人聊着天，放点小音乐，慢慢好像好点了。然后开着台灯，开始睡觉。但是过了好久，好久，她们没有人能睡着。怎么都睡不着。眼看时间都过去了，其中一个就坐起来，说，这样的情况是不是有点怪？我们执行了那么多飞行任务，飞过那么多地方，奇怪的小房间好歹也见过一些，但是在这间房里，怎么就一直睡不着？另一个也坐起来，深表认同。于是两姑娘就惆怅了。\n\n 后来这两人真的一直都睡不着。数羊啊，戴耳机听轻音乐啊，什么办法都没用。最后眼睁睁到天亮了。因为是老旧的府邸，我忘记她说的是民国时还是更早期的了。她们当时失眠的凌晨时间，还时不时有木地板咯吱一下的声音。据说听着比较突兀，而且很难受。小逸说，就是一种压抑感，你知道吗。我们后来拿行李离开去飞行的时候，离开那栋房子，瞬间就云开雾散的感觉，舒服了。估计，还是那房子不好。\n\n\n　　"
		},
		{
			"post_id": 7,
			"title": "整容手术",
			"date_published": 1468140360.917,
			"body": "中秋节期间，返京的海航头等舱里舒服多了，回程的人也多了。色调、配置、服务感觉都比离京时的东航头等舱舒服。不过东航的头等舱里三文鱼片和沙拉拌在一起的小茶心味道还是不错的。也许由于大家都是回京城，冷冷清清的头等舱难得人多了些，又因为或旅游或省亲心情都还不错，所以陌生人之间也难得的开始说上几句话了。\n\n\n　　旁边的姑娘看着我说，你鞋子不错。她栗色的头发，做得浪漫的大卷，挺好看。我笑笑，说在新光**买的，当时打*折云云。后来我们聊到了她的美甲，聊起了皮肤护理。我总觉得她五官是那种不自然的漂亮，立体得太明显了，鼻子那块，正常人好像长不成这样，下巴又过尖，眼角似乎也开过。朋友圈里也有几位整容，或因为自信不足或因为失恋或因为老公劈腿，她们休养期间我还去医院探望过。这样生硬却妖艳的面孔，我算是见过些了。\n\n\n　　后来闲得没事，我试探性和她讨论说，你看现在面部微创整容好像挺火的啊，给脸上打几针，玻尿酸什么的，下巴不长的打下巴，鼻子不高的打鼻梁……一针完事，挺方便啊。她不屑的说，那样效果很短暂的，还不如一次性手术，受点罪，但是效果永久啊。玻尿酸得半年一趟，一年一趟得补，一姑娘鼻子起起落落的，多不好啊。她说她脸上就做过几处，得意地问我，看不出来吧？（果然自己招了）我其实早就看出来了，但为了配合，就带有真挚表情地点点头，还不忘感叹一下：哇，那你做得好成功啊。姑娘心里美了，开始滔滔不绝说起她的下颚角手术，说起她的鼻梁手术，说起她玻**酸丰唇做出嘟嘟可爱的效果等等。后来突然停下来，她想起一件事。后来，她开始讲一件在北京著名整容机构***处医院的亲身经历来。 \n\n有一次她在北京这家**处医院做下颚角手术。这个手术需要把下巴锯开为二，然后切掉左右两腮侧的骨头（就是我们说别人方形脸或大饼脸的那个角），把这些骨头重新组合，填充到下巴拉开的缝隙里，这样下巴长了，尖了，脸两侧小了。手术非常考验医生的技术，需要全麻的，术后麻药效果散去后.....据说痛苦万分，要熬那么好些天。听到这里我有点冒汗，很佩服这姑娘的勇气。她说，头天夜里她就住院了。第二天按照约定时间她躺上了手术台，麻醉师给打了麻药。一位主刀大夫和另一位观摩大夫在她头部两侧，旁边围了几位护士给递刀具什么的。因为手术在头部，所以麻醉师用吊针的形式给她脚步注射麻药的。她的意识就越来越恍惚……此后，诡异的事就出现了。\n\n\n　　这姑娘渐渐陷入昏迷状态，然后她发现自己正在以一个奇特的视角看整个手术室的场景。准确来说是在半空中，上方，俯瞰手术室的进展。她看到另一个自己躺着，然后大夫围着自己的头部在操作，有血，而且护士们递着工具也很忙。麻醉师一个人在手术外围坐着，以备不时之需。然后——她看到麻醉师身后站着几个人，很突兀的几个人。有男女老少不相同，但是很乡土气息。其中一个女的还穿着旧旧发灰的粉色毛衣（那种自己织出来的，很农村土的那种粉红）。这几位明显不是医护人员，都穿着自己便装，却又不近前。就紧紧贴在麻醉师身后。远远旁观着她的这场手术。而且好像主刀医生和其他人员都没当他们在旁边一样，好像他们是空气。\n\n\n　　当时这姑娘的情绪就有点愤怒了，当下就觉得老娘的手术，你们他妈的一堆外人站在现场围观算怎么回事？这手术室消毒彻底不彻底？这一帮土鳖会不会带来病毒？……她越想越气愤。后来听到主刀大夫给旁边人说了一句：好了！开始包扎吧！然后他们开始又一轮忙碌，好像给她头部开始缠绕白色的布条，扎得就留着眼睛和鼻子，好像木乃伊。那旁观的几个村民样的人继续围观。姑娘更生气了。当她愤慨情绪越来越膨胀的时候，好像自己一瞬间跌入什么。然后就好像变回躺着的状态，但是怎么也睁不开眼，觉得眼皮很沉。然后听到旁边的护士和医生在对话：“估计快醒了”“嗯，好像要醒了”“挺好，时间正好……”等等。然后她吃力得打开眼皮一条缝，有个护士对她晃晃手指，问她，醒了？她想点头，但是没力气，就闭了下眼表示。\n\n\n　　护士说，“别说话，你麻药还没有完全散去，所以现在还比较虚弱，没有力气。而且你嘴里插着血液的引流管，头部全部都被包扎了，面部会浮肿，伤口会渗液的。你这些天开口说话对伤口不好。所以，你有什么话就用笔写。我们还要观察一小时，等你麻药劲头过去了，观察没有问题才会推你回病房休养。”于是姑娘就示意要纸笔写字。小护士很快拿过来。\n\n\n　　姑娘第一句话大概意思是：手术室内除了医生和护士，还有其他人？那护士马上就说：没有啊。这姑娘写第二句：讲实话，你们允许外人在参观手术现场对吧？护士这次急了，信誓旦旦说：怎么会！我们医院是有规定的，怎么可能允许闲杂人等在手术重地呢。而且我们这是国家医院，不是那种小作坊美容院。姑娘心里一沉，然后写了第三句话：那麻醉师身后站那几个人是谁？几个护士沉默了，面面相觑。然后有个护士开口问，你不是麻醉了吗，是不是你做梦啊。姑娘又写：我好像换了个角度从上方俯瞰你们做手术的。麻醉师后面有几个人。立即有个快嘴的小护士嘀咕，肯定是**那几次的麻醉事故！她很快被其他几人瞪了一眼，然后有护士宽慰她说，你麻醉药后肯定会做梦的，人也会恍恍惚惚，别想了，好好休息。然后几个护士都不再说话，气氛一时挺安静。她们把她推到了观察室。\n\n\n　　即使在观察室里，这姑娘从玻璃窗偏头看过去，虽然听不到声音，也看到房间外的护士们在私语，对她指指点点。她觉得她们的眼神有点慌乱。说到这里，她说，不确定自己是不是心理暗示的。就是觉得这里面有事儿。后来一小时观察期到，有位护士来推她回病房休养，路上要推进电梯。电梯里没有任何一个人的时候，这护士偷偷问了她一句：除了那个麻醉师，你看到别人身后有站着人吗？姑娘摇头。护士长舒一口气。姑娘写纸上问，你们出过事故吗？护士眼光闪烁，停顿了半天，后来说，也没有啊，说我们这么正规的医院云云，说了一堆。这件事还没有完。\n\n\n　　过了24小时，她开始自由的略微走动了。看着镜子里面肿的猪头一样还被层层白布包裹的脸，也有点惨不忍睹。来探病的朋友、家人更是抱怨她了半天。说真是自己找罪受什么的。给她也带了不少补品。这姑娘说，头几天医生只准她们喝流食，一月内还不准咀嚼鸡翅啊、苹果啊一类食物。补汤也只能喝汤，不能吃汤内的食材。她当时总幻想着鸡腿什么的，就各种馋啊，特别馋。她本来要申请特殊VIP病房，要自己妈妈来陪床的。但是大夫说VIP满区了，没办法，她只好在普通病房呆着，和其他姑娘一个房间。她家人也不能陪床、陪聊天。而且，护士一到十点就过来催促病人要早休息养伤，开始关电视关灯。这人造美女郁闷不已，但是也没办法。只好睡。\n\n\n　　等灯一熄灭，事情又来了。她老感觉走廊有脚步声，有时候从远到近，有时候从近到远。想和同室其他床的说说，又想起医生嘱咐伤口不能说话。头被包的像粽子，为了不扯到伤口，压抑得咕噜噜想说什么也说不大清楚。在她渐渐困了准备熟睡的时候，她发现有点不对。因为有什么对着她额头吹气。特别近距离的，而且风挺凉的。当时是关门关窗的。她当时吓得睁眼，屋里一片黑，什么都没有。睁眼开了床头灯好像就不吹气了。等一关灯，大概不到10分钟吧。又有气流对着她额头、眉眼间吹。她当时也不知道什么原因，好像就有一个看不见的人对着她的额头呼吸一样。越来越怕，她就缩进被子里。后来又憋得慌。这样反反复复，迷糊间睡去，天也亮了。\n\n\n　　后来她马上给家里发短信，说医院怎么样都不住了。虽然医生要求留院观察需要一周。她说，不管面部出现任何问题或者不良反应，叫她老爸的司机送她及时赶来咨询医生也行。她是坚决不住医院了，打死也不住。后来医生没有办法，千叮万嘱协助她办了离院手续。\n\n本来这姑娘百思不得其解，为什么麻醉师身后站的那么土气的几个人，而不是想象中衣冠现代化的病人。后来她复检时观察到，这家医院里经常有一些从全国各地慕名而来的重症患者。比如说面部严重畸形，脖子长瘤，脸部比例吓人，车祸后面部恢复、眼睛不对称等等。那些是正常求医的人。当然也不乏她这种求美改造者。这些正常病人们有些就是来自乡村，觉得京城这家医院专攻整形恢复，有实力，所以举家凑钱给面部畸形的孩子来手术的，或者严重歪鼻的少年、下巴骨折的老人等等。\n\n\n　　听她讲完这些，我感觉真是唏嘘。看看她的脸，好像下巴的确是小巧又精致，但是脸两侧似乎没怎么变小。还是肉肉的感觉。难道说她手术前比这脸更大？不好想象。究竟什么原因会让人看到手术中的另外的自己？是麻醉后的做梦，还是灵魂出窍，我觉得不好说。算了，不予评论。\n\n "
		},
		{
			"post_id": 6,
			"title": "分叉口",
			"date_published": 1468140074.02,
			"body": "这次中秋节，去西北找姑妈。堂哥在机场接的我，路上我们聊起诡异的经历，他说了他的两桩事。第一个是开车路边遇到的事。他说那天夜里，他开着长途车前往乌鲁木齐（还是呼和浩特？我忘记了），反正要经过一片戈壁滩。比较荒芜，前后十几公里都没有任何人。就只有寂寞的一条公路。他本来聚精会神开着车，放着音乐，目视前方。后来发现侧面站着一人伸手，像是要拦车。他当时也就呼啸而过，突然才想起来刚才那人没有头。当时就一脚急刹车，停在路边了。堂哥当时也是血气方刚，缓过神（也就几秒钟吧），马上开车掉头回去看那人。结果倒回去时，什么人都没有，依旧荒芜一片。这件事他后来一直百思不得其解。这是他亲眼目睹的。\n\n　　我说，会不会你眼花了？人家说不定是休闲风格出游，戴着帽衫，脸又比较黑，你以为人家没头。他说，不是啊，是完全没有头！我的车灯多亮啊，怎么会看错！再说了，如果他是人，我回去的时候怎么瞬间就原地不见了啊。我说，说不定人家一看你没停车，不做指望了，转身就钻进草堆或者树林了吧。堂哥说，那一带可是荒芜的黄土戈壁一样的地方，就一点地皮上的小草，哪来的避身的树和草堆啊？最后我说，那，估计就是意外丧生在这里的人吧，死了做鬼也想回家，这里又没有家人来超度他。看到车就想招个手搭车回家吧。\n\n　　堂哥说还有一次也比较邪门。在山里开车，在比较熟悉的一个路段，开着开着发现前面的是个分叉口，变成两条路了。他印象中每次那个地方就是一条路的，没理由出来一个分叉口。他当时心里有点打鼓，觉得是不是传说中的“鬼打墙”。也不敢贸然乱开（怕回头翻下山崖什么的），就把车停在楼边了。按照伯母教过他的办法（伯母还是比较迷信那种的，会好多土方法，叫魂啊什么的），下了车，看看，还是熟悉的这个路段，但还是分叉出来的两条路。他就点燃一支烟，抽了两口，着了，放在路边的草丛里，说了几句。算是孝敬了山鬼一支烟吧。然后对着四面八方拜了拜，念叨几句，大意就是他一个独子，现在家里上有老下有小不容易什么的，说老母亲还等着他回家呢云云。然后回车里掏出一瓶小二锅头，开了盖给地边上撒了撒，也算是孝敬了。最后脱了鞋子在自己头上顶了一下。回车里，启动，一看，已经变成一条路了。眼睁睁就这么上车时发现是一条路了。他道个谢，赶快开车回家了。\n\n　　堂哥事后跟家里说，可能真的众生有灵，山里野外还是多怀着恭敬的心会好一点。不论他们是游荡在外的，还是山精鬼魅，你讲讲道理，他们也能听的。胸怀坦荡，自然就百毒不侵。我听他说这事以后，在车里问，那等于是你的仪式起作用了？本来鬼打墙的，人家放你一条生路？堂哥说，谁知道啊！如果理性一点想，科学一点想，会不会是因为长时间开车开久了，眼睛疲劳，所以前面出现幻境。或者是前方因为空气什么原理，类似于海市蛰楼的，反衬出另外一条路了，都有可能。下车活动活动，又是敬烟又是敬酒的，上车后头脑清醒了，所以看出还是一条路，没什么岔道。这么解释，好像也是行得通的…… "
		},
		{
			"post_id": 5,
			"title": "出租屋",
			"date_published": 1468139408.108,
			"body": "小妖在她大学附近的一所院校的教师楼租了房子，第一次租房和同学搭伙住，当然是非常兴奋了。地点是京城的五道口那一带，*质大学教师楼里。在京城的朋友应该都知道五道口的。当时她还不想让自己爸妈知道在校外租房了，容易被数落和操心。所以她的房租只能从零花钱里省。好在算个小二代，零花钱比起同学来说也不菲了。为了挤压多一点的零花钱出来玩乐，她想找性价比最高的房子，但是又很挑剔，希望找到的房子环境不错。没想到后来还真的被她和搭伙的小伙伴找到一套。虽然是半旧的教师楼，晃晃悠悠的老电梯，但是那套大两居墙壁和地板都是新铺设的，而且价格还比同类要便宜至少30%。小妖觉得她摊上好事了，其实她是摊上事儿了。小窝在11楼，住进去不久，两个姑娘又是买墙贴又是买日用品的，各种温馨开始布置。\n\n\n　　住了段日子以后，发现她们夜里老是有点害怕，动不动自己醒来，一看表还在凌晨两三点呢。继续再睡。小妖的解释是，女孩子都有些敏感，怕黑啊，或者半夜害怕啊，正常。不过有些东西偶尔会有响动，左邻右舍好像也经常没人，都没有遇到过。她们的心倒挺宽，觉得都是木头家具嘛，受潮或者干燥或者被挤压，时不常出点声音，正常。后来有一天，她们听到门外有猫叫。两人起了童心，要是流浪猫就好了，她们可以收养进来。开门一看，果然是只小猫，挺乖，特别可爱。两人后来特别高兴，当当当跑下楼又是煮羊奶（猫肠胃不适应牛奶），又给买猫粮的。当晚折腾完毕，一想小猫还没有地方睡觉呢，给阳台上搭了个舒服的窝。第二天早晨，小妖是被同伴的尖锐叫声给吓醒的。\n\n\n　　她爬起来冲到阳台，同伴就马上抱住她，一副吓坏了的样子。探头一看，猫咪已经死了。关键是鼻孔和嘴角什么的都流血了，她当时就想到一个词语叫“七窍流血”。她后来和小伙伴分析原因，是因为吃到不该吃的吗，没有啊。是不小心吃了老鼠药吗，阳台上是全空的啊，扫的干干净净的。一个糖豆都没留下。当时这件事让她心里挺不好受。后来两人去把可怜的猫埋了。没过几天，小妖心情莫名的大好，她建议同伴一起大扫除一下，弹一下吊顶、墙角各处的灰啊，狠狠擦一次地板啊，还整理了厨房。感觉屋子更加清爽了，然后她们去买了鲜花插在花瓶里。还耳机里听起小音乐，觉小日子很舒适。后来感觉到门外好像又有猫在叫，小妖觉得奇怪了，不会还有流浪猫吧。她去叫隔壁房间的小伙伴。那姑娘也起来了，陪她一起走出去看。她们从防盗门空内往外看，看不到下面，决定开门。两人打开门，什么都没有。然后又隐约听到一声猫叫。小妖就走出门去，同伴跟随其后。说来也奇怪，两人前脚刚迈出脚，后面就瞬间大风起来把防盗门蓬地很重一声被带上了。两人都傻眼了，被关在门外。\n\n\n　　事后她们回忆说走廊里当时静悄悄的，哪里来的风啊，说来就来。她们一回想事件过程，就觉得有点诡异。首先整理了屋子，还摆了水果插了花，这种情绪来得莫名其妙的，屋子整理温馨干净了，她们就被“清理”给“请”出去了。怎么想，都觉得这个猫叫的声音像是诱因，只是逗她们出去而已。小妖当时说，好好的戴着耳机，我说怎么还能听到外面有猫在叫呢？一起住的姑娘害怕了，马上叫小妖闭嘴别再说了。两人当时穿着睡裙，身上钥匙、手机、钱包都没有。一筹莫展，夜里了，找开锁公司估计也困难。后来她们决定走路去找附近学校的宿舍同学，借点银两，凑活睡一下，白天了找开锁公司给开门。刚拔脚准备走的时候，小妖听到锁着大门的屋内，自己的手机在响。她当时就说，唉，完了，老妈肯定来电话查岗，这一整夜不接电话，她肯定急死了。一会儿到同学宿舍，先借个手机给家里打电话。门外，两姑娘听到这边手机铃声停了，那边座机声音又起来了。你们记住这个细节啊。同伴还说，肯定你妈手机打不通，就打来座机了。两姑娘后来拉着手一起去附近同学的宿舍了。\n\n\n　　等第二天开锁公司开了门，进了自己房间的小妖当场吓得脸色煞白。手机上确实有妈妈的来电，但是座机实际上——是没有插线的！小妖后来拔腿就往外跑。同伴不明就里，就追了出去。问清楚以后，小伙伴也担心了。谁都不敢再继续住了。但是两人放了押金在房东手里。小妖财大气粗说不要了，但是小伙伴还想拿回来。后来她们约了房东面谈。小妖只好陪着。房东是一对看起来和颜悦色的老夫妇。听两个姑娘说完这些事，房东脸色很难看。居然没说什么话，也没为难她们，虽然最后没退押金（她们突然不住算是违约吧），但是剩余几月的房款还是给她们了。小妖好奇心重，本来想问个为什么。看老人眼睛含泪的，就忍了忍什么都没说。后来她们留意都这套房子左右邻居好像都没有住人。搬家的时候，上下电梯的时候，小妖问其他楼层的人才知道一二（估计人家也是看她要走了，才肯说的）。\n\n\n　　据说这对老夫妻就一个宝贝女儿，但是已经服药自杀了，就死在这套两居里的。生前那姑娘很爱干净，喜欢听个音乐插个花什么的。后来不知道什么事想不开就突然自杀了。其实服药后不久，这姑娘又有点后悔然后给父母打了电话，想有人救她。但是打了几个都没接通，就听着电话那端一直在响，没人应答。估计是也有点死不瞑目不甘心吧。后来夫妻俩觉得屋里有时候有响动，或者听起来像电话铃一直在响，但实际上看电话没有来过任何电话。以前他们家养了猫的，这姑娘死后好像猫被老两口放出去了（没准也回来了，是不是就是小妖她们后来捡的那只不清楚）。最后，两口子觉得这里呆着触物思人，总是伤心，就准备把屋子重新收拾了一下以后出租。然后就租给小妖她们了。"
		},
		{
			"post_id": 4,
			"title": "小妖",
			"date_published": 1468138876.886,
			"body": "她长得比较妖娆，尖尖的下巴，凤眼。穿衣打扮都比较有品位。当时在学校，我俩关系还不错。但这样一个女人，她既不走清纯范儿，也不走妩媚范儿，不走优雅范儿，偏偏喜欢摇滚，一身朋克装束。我们就叫她小妖吧。此女算是个小二代吧，父亲很会做生意，在云南一带叱咤风云。但是男人钱多了，总是有不少缺钱的女人不顾伦理道德、不断往上贴的。慢慢的，小妖的爸就学坏了。他坏还坏的和别人不一样，不是在外面东搞西搞的，他是属于带回家里明目张胆那种。天皇老子，谁敢管我那种。小妖当然可怜她妈妈，有时候她妈妈受了气，小妖回家看到了会护在她妈妈面前，跟她爸叉着腰大声理论。有次她爸还揍了她。时间久了，小妖妈有次想不通自杀，结果未遂。然后也许有点威慑到小妖爸了吧，收敛了点，至少没再大咧咧带回家里了。后来因为小妖老护着妈妈的局面，小妖爸也不怎么搭理小妖了。只是定期给个生活费而已。至于小妖爸到底有多少家底银子，母女俩谁都不知道。小妖后来在大学期间决定找个出路，她决定留学。想着回头可以带着她妈妈去海外陪读，离开这个家远走高飞。小妖后来学英语学得真心努力，我们都望尘莫及。加上她语感好，人也聪明，身材很出挑，我们后来发现连男老师看她的眼光都秋波带笑的。小妖后来到了海外旅游，打算先采采点看一看。路边不是有那种吉普赛什么人的吗，可以看咖啡底的，看牌的，看手纹的，反正不知道是不是一半靠心理学，一半靠忽悠。后来小妖试了一把，她好奇和国内有什么不同。可是后来，她简直快哭了。\n\n\n　　她想问她的家，她们一家三口的缘分。事后小妖给我们说，当时那个老太婆（原话，应该说老人家吧）的话给我吓到了。她开口就说，你家男主人坏了你们很多事，你和你妈妈都不容易，你们的家不容易回到过去了。后来的话大意翻译过来就是，她看到的是小妖爸和她妈以前是好友，后来小妖妈伤害了他的感情，辜负了他，基本上算是毁了一个人的生活。还说小妖妈还支持过他一些事情，当然是资金上的支持。说这辈子现在的局面，不过是小妖爸讨回自己被伤害的感情，资金上给予一些回馈。所以他办的事会气人、伤人。如果不是以前受过帮助，估计他现在连生活上都不会给予小妖妈保障的。那老太太还说了一句让人大跌眼镜的话，她建议小妖不要参与父母的恩怨，说这些事是他俩的溯源，该讨的讨，该还的还，本来不关小妖的事，让她别参与太多。说放下抱怨，像个正常孩子一样去关心爸爸，关爱他，也许还能有点缓和。小妖回国说给我们听的时候，我们还挺诧异。觉得海外莫非也和国内一样，信轮回，信因果报应？他们也有通眼的人能看到什么？但我们都不懂，也不好乱做建议。也不知道那老人家是乱给指点，还是有据可依的。国外神婆不是应该装模作样看看水晶球什么玩意的吗，小妖上那次老太太就是路边那种摊子，让她抽出几张牌，后来拼在一起给她开始说的，摸了她的手，也不是很神秘的样子。不管怎样，小妖还是尝试做出些改变。虽然有时候她明显带着妈妈的立场。后来，她有时候看到老爸回家，也会叫一声“爸”了。夜里看到她爸还在沙发上，也会给杯水什么的。顶撞的少了。她爸有时候应酬喝醉回来，跌跌撞撞的，她会帮司机一起扶着上楼。\n\n\n　　小妖爸好像察觉到改变，他好像挺受用这种细节的关怀。反正后来他虽然还是在外点三搞四的，但不带回家里了。至少面上过得去了。小妖觉得，如果真的这些是她爸妈的事，让她少参与，她就算心里站在妈妈那边，面上至少不那么表现了，她想尝试看看这么做有没有改善。就这么又过了段时间，有次小妖想找她爸一起去留学咨询会，听证一下，她爸居然一口答应。小妖有点喜出望外，本来这是好多年了连她毕业庆典都不参加的亲爹啊。有次小妖爸又喝多了，司机忍不住多说几嘴，小妖才知道。她爸早些年总觉得家里冷冷清清的，比较没有氛围。孩子老婆天天都是伸手要钱花的，他在外面多辛苦没人知道，回家了一句暖话、一杯水都没有，找个姑娘为了银子至少都会撒撒娇的。后来不管大事小事，一出事女儿不问青红皂白先护着妈，他有时候觉得孩子都白养了。最后很心烦，回家一看这俩觉得就像两个债主，天天都是搜刮他银两的。也没谁操心他在外面吃了什么，谈得怎么样，身体舒不舒服。他除了供养家人，好像就没有别的关联了一样。\n\n\n　　但就在这段时间，他偶尔在沙发上休息的时候，发现家里的女儿还给他来上一杯水，他当时心里就五味翻腾。有时候也觉得自己玩得过火，最初像是借由对方的紧张来感受自己的存在和受重视一样，后来娱乐场里久了就有点沉溺其中。里面的真情假爱、逢场作戏觉得也有意思。回头想想，也不过如此。……小妖后来想想，觉得身处她爸的角度这么想也难怪。夫妻两最后还是闹了离婚，不过这些年小妖爸有时候还是会回来，跟回自己家一样。离婚后小妖妈大病了一场，现在小妖有时候探亲回家，看见自己爸头枕着妈妈的腿上，老妈给他掏着耳朵，温顺的又像猫一样。明显又不像两个有着离婚证的人。这就是纠结的缘分吧，孽缘也是缘。一辈子又一辈子的纠葛。\n"
		},
		{
			"post_id": 3,
			"title": "大江东去",
			"date_published": 1468138432.58,
			"body": "小逼很小的时候是跟着外公的，上学后才离开。她小小的时候很贪嘴，人小，走路不稳，在前面摇摇晃晃去拿各摊铺吃的零食，各摊主也觉得她挺可爱的，经常逗她玩，外公就在后面一路结账。她对外公外婆感情很深。她外婆至今仍在世上，外公已经去世多年了。人世间总有点让人想不明白的事情，像她这种，虽然和外公感情特别深厚，但是外公去世前以及后来她想念外公的时候，却从来没有梦到过他。一次托梦都没有过。她说在小时候，家里舅舅、舅妈好多孩子，她虽然只有寒暑假去湖*玩，但那时候表妹一堆，孩子们都小，所以有私心。年长的那位表妹（当时也才幼儿园阶段），甚至为了争嘴去厨房拿菜刀吓唬小朋友。他们都和大人争抢吃的、小玩意，和小朋友争抢玩具什么。但她从小都没计较过这些，有了果汁、饼干什么的，都还记得偷偷藏起来一些，不被其他表弟表妹发现，外公来了就搂住他脖子撒娇，悄悄拿给外公这些她私藏起来的“宝贝”吃。大人们当然不怎么吃这些，但是都很喜欢她这种品质。她没梦到过外公这事，一直心里有点惆怅。觉得是不是人一死，这辈子感情就断了？没什么挂念，直接投生下辈子了？尽管如此，她外公去世那段时间里还是发生过一些奇特的事情。\n\n\n　　首先小逼外公是肺癌去世的，老人家从十六七就开始抽烟，直到七十岁发现是肺癌晚期了。外公年轻时很有生意头脑，做烟草生意，大名鼎鼎的“**白*我心飞翔”其实追溯到很久以前，也算是这家子的产业。后来家里还被批斗过，说是资本**什么的。后来老人家带着全家人在一处农场低调生活了下来，家里的字画文玩银元基本被抄了。新*国成立后，要求一夫一妻制，政*要求原先有多房老婆的，必须选择一房安定下来。小逼外公就选了感情最深厚的小姨太（也就是小逼的亲外婆），其他几房都遣散了。后来在小逼妈妈和舅舅成长的经历里，外公都是带着外婆一起在农场经营餐铺的。一家人活得还算温饱有余。后来外公去世的时候（九几年），其他几房都到场了，也有没出席派子女过来的。这是后话。\n\n当时小逼外公发现肺癌是晚期了以后，老人家心态还挺乐观的，觉得这辈子很多常人接触不到的都见过、吃过、拥有过，有不枉此生的感觉了。后来他走路也逐渐体力不支，就经常使用拐杖撑着走。因为是竹制的拐杖，经常听到人远远过来就有了“咚、咚”打地的声音。老人患病的那段时间里，儿媳妇稍微有点尖刻，据说这儿媳妇出身贫苦，嫁进来也很开心了，所以老人家基本没怎么为难过这位儿媳。当时儿媳生了好多女儿，没有儿子，儿子也在努力造人中。得知老人患癌症，儿媳要求自己的孩子家人不许看望老人，说是担心癌症会传染。开始做儿子的（小逼舅舅）觉得于情于理过不去，生病的老人总是要照顾的，自己成家立业、买房买车，哪个不是老人操心出来的？后来媳妇总在吹耳旁风，一来二去，自己也就作罢了。小逼的妈妈当时挺伤心，奔到*南去看老人，陪了一段时间。她后来看到小逼舅妈这样凉薄，心里不痛快，说这样以后迟早会有报应的，癌症哪里传染不传染的，晚期的老人最需要陪伴。不过小逼外公心态挺好，没计较什么，为人很有气度，当时还坚持每天看《三国》电视剧，跟着一起哼“大江东去……”什么的歌，可惜到最后没看到剧终，人走了。小逼后来有相当长的一段时间里，想起三国就想到外公。\n\n\n　　人走了自然要设灵堂。这时候儿子儿媳才带着一堆孩子们都来了。小逼当时有重要的考试，小逼妈不准孩子来湖*省。当时小逼赶过来的时候，后事差不多办完，人已经下葬了，东西都焚烧了。小逼后来陪外婆住在里面的卧室里，堂屋是原来外公去世的地方。夜里迷迷糊糊的时候，小逼听到竹杖打地“咚、咚”的声音，好像停到她们床前就止了，后来好像又渐渐远去。白天和外婆说起来的时候，外婆说也听到了。而且那些天常常有这个声音。外婆说，外公去世前身体难受，走路不便，都是用竹杖撑着在走的。估计就是外公来看你了。没过多久，有一天小逼和年长的那位大表妹（敢拿菜刀吓唬小朋友那个）在河边玩。扔石块打水漂那种。两人开始比赛。小逼正扔着，石头刚出手，手还抬着，突然大表妹就迎头跑来（事后为什么跑她也没说清楚）。额前直接就划出一个口，一时间血流如注。小学生哪里见过血流满面的情景啊，当时小逼就吓坏了，赶快喊舅舅。舅舅一看自己大女儿怎么这样了，赶快抱起来跑去送医院缝针。事后倒也没有多责备小逼。当天夜里来事儿了。这晚小逼、大表妹、外婆一起睡在竹席上，“咚、咚”的竹杖捶地声又起来了。这次从远到近，停留了一会儿。小逼感觉好像外婆和大表妹都睡着了，对外公她挺想念的，不太害怕。后来声音又走了。白天问起大表妹，她原来和外婆一样都没睡。只不过在当晚那个情境下，谁都装睡没说话而已。后来外婆说，外公又来过了。大表妹说，声音停下来后感觉到一只手在摸她的额头，伤口包扎的地方。她觉得像是她爷爷的手。\n\n\n　　……最后再补充几句，外公去世后没几年，小逼舅妈也去世了。就是当时老人癌症晚期，那个有些凉薄的儿媳妇。也是查出来的癌症，咽喉癌早期。虽然治疗了两年，后来好像都痊愈了。但突然有一段时间就变得很差，然后人没留住，也走了。那位舅妈去世时双眼圆瞪，紧抓她自己妈妈的手，听说当时恨透了她自己的妈，说是这辈子就这么荒了，说是她妈妈利欲熏心害了她，说她妈妈利用她什么的，好像算是临终前的醒悟吧。至于小逼的舅舅，据说至今未再婚。而当年的大表妹，做了护士，现今正在谈婚论嫁的年纪。人已经非常消瘦，经常胃痛难受，食欲不振。一直也拖着没怎么去看。二表妹好像少女时期非常臭美，爱打扮，突然有天回家就抑郁症不说话了，此后经常哭哭笑笑的不大正常，医院和神婆都看过也不大好。家里怀疑是不是被人强奸过，所以患了心理问题。小表妹现在大学快毕业了，要实习。三个没娘的孩子，也挺可怜的。这一家人近期两月情况如何，小逼还没有问候过，也不大清楚了。 "
		},
		{
			"post_id": 2,
			"title": "头牌姑娘",
			"date_published": 1468137546.457,
			"body": "京城的核心富人圈有两处。一个是朝*公园一带，豪宅林立，交通最便利，周围被几大使馆区和商业CBD包围。各类高端消费应有尽有。还有一个是机场温*河一带的中央别墅区，一栋栋花园洋房和独栋别墅也环水倚湖而建。我就讲个头牌姑娘在富人区的事儿。这姑娘长得确实如花似玉，有些个风情。但她来了京城没学好，因为学历不高，工作又处处碰壁，后来就去了当时名噪一时的**公馆里的夜总会待客。她算是有点悟性的那种，学得又快，马上就很受男人们的欢迎。渐渐的，那两年敛财无数。钱多了，自然人也狂妄起来，早忘记自己来京城的初衷。后来听说有富商包养，安置在朝*公园一带的*号公寓里，离她早期工作的**公馆非常之近。那公寓也修得非常气派，一层大堂都是那种9米调高描金绘画的顶子，法式洛可可奢华的风格，请了故宫艺匠来描制的。这姑娘住进去以后那是如鱼得水，生活上也是日进斗金。每天傲然的出出进进，尽享奢华生活。\n\n\n　　时间久了，物业安保人员发现她好像有一阵子没出来露面了。是旅游去了？搬家了？还是回老家了？没人知道。好像有半月左右，突然来了一支刑侦队伍。直奔那姑娘家。原因是有邻居闻到气味奇怪，后来敲门多次这一户从来没开过门，闻着后来越来越臭，报警了。警察问清楚情况，弄开了门，里面这姑娘死去多时。邻居家的小朋友原来老给大人说，隔壁有姐姐哭，每天都哭。没人当回事。但警察后来问话时，小孩子说的“姐姐哭”的时间，其实那姑娘已经去世多日了。这案子后来怎么查的，版本好像说了好几种。一种是**公馆的头牌被包养，是被富商老婆发现的。正房直接买凶杀人了，办了她，觉得这样一了百了（这是富*圈或是政*圈有些不法人士常用手段）。这案子后来查出，好像富商花钱也抹了不少事，后来风平浪静了。还有一种版本说是这头牌姑娘是被富商想甩甩不掉，假借外地出差，实际找人来上门办了她的。\n\n\n　　当时京城里挺轰动的是，这姑娘被刑侦队查案时发现，人虽走了，但是钱没花了，账上还有近2000万资金吧，挺令人惋惜的。如花似玉的年纪。后来这事还没完，本人有次在楼下的喷泉花园中心，绕着圈跑步时，听到后面很近就在几米的地方有两人对话，说的不像是中文，也不像是英语、法语、俄语或者亚洲语什么的，就是说话明明清晰，但是听不懂在说什么。回头一看，什么人都没有。园子里静悄悄的。这种类似事件后来挺多，问了点小区附近的人，都说这楼的格局就有问题，围合型建筑，还呈现八卦型。说开发商这里肯定有猫腻，这种明显的不是镇鬼就是养阴的格局，说这大楼在一层还在几个地方各自设了门口，像八卦的门，生门、死门什么的都有。\n\n\n　　后来有些名人明星也在这地段这小区买过房，都喜欢找大师或者风水名家来看看。看过之后基本都撤了，不住在这里，要么外租，要么转卖。有些外地富商和外籍高管也有不明就里也有买这房的人，但基本都外租。而且空置率很高，夜里万家灯火的时间，看这里亮灯率好像都不足20%。物业后来在金碧辉煌的大堂中心放了大理石桌，桌放了有高低不等的透明玻璃大瓶（圆柱形，里面有水）七罐。好像有懂的人说，这是什么七星阵，镇压作用的，说这楼里阴气重，聚了很多那些**。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}