{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"18_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 1,
				"body": "Não estou a conseguir, como faço para pesquisar pessoas?",
				"added": 1471239546
			},
			{
				"comment_id": 2,
				"body": "Eu vi isso, mas pensei que tivesse alguma opção de pesquisa de usuarios, por isso a minha pergunta\npelos vistos ainda nao possui essa possibilidade de pesquisa direta, temos que ir 'browse all' e procurar manualmente na lista\ne eu adicionei-o sirenyc, mas quando sai e voltei a entrar para testar aqueles que eu tinha adicionado ja nao o estavam mais, a unica maneira de ver o que os mesmos postaram é voltar a adicionar de toda a vez que se entra no zeroMe\n\nvoce sabe se é possivel ajudar a estruturar o site? Tenho conhecimentos de programacao e se for preciso nao me importo de ajudar, pois acho que esta a faltar muita coisa, como:\n - uma forma de pesquisar user's\n - uma opçao que mostre a lista de administradores do site, como um ponto de referencia para os quais fosse possivel mandar mensagem para tirar duvidas ou ver o que publicaram\n - ter uma lista de pessoal seguido e manter essa lista\n - chats para mensagens privadas para os users que eu quiser adicionar na conversa, tipo messenger (que seria a verdadeira grande utilidade do site)\nÉ possivel encontrar aqui na zero net muitos chat's mas nenhum que de para trocar mensagens privadas\n - partilha de documentos\n - ver o que foi publicado em geral pelo user que pesquisarmos\n\nEnfim, algo mais do genero facebook, voce por aqui tem muitos sites mas nada realmente muito geral, como tirar duvidas sobre varios SO, software, hardware, redes, hacking, metasploit, etc\nNesta rede, se o zeroMe se aproxima-se do facebook, tenho certeza que seria uma boa forma de o pessoal dar largos passos para partilha de conhecimentos\n\nSe voce souber de algo, como quem esta a desenvolver o site, se é possivel ajudar, ou mais, me diga ou mande mail pelo zeromail, que continua a ser a unica maneira que conheço de mandar mensagem privada aqui\n\nObrigado pelas suas respostas sirenyc",
				"added": 1471287233
			},
			{
				"comment_id": 3,
				"body": "> [sirenyc](#comment_60_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Mandei a sugestão para o @Nofish. a minha conta está normal. Deleta a pasta do zerome dentro da pasta DATA da zeronet e entra de novo para ver se resolve.\n\nFiz isso que voce disse de apagar a pasta do zerome dentro da data, sai do zero net e voltei a iniciar, voltei ao zerome e aconteceu o mesmo outra vez\n\nsigo pessoal e se reinicio a pagina perco o pessoal que estava a seguir\n\ne tbm vi o seu comentario na minha publicaçao, vou mandar email para o nofish, obrigado pela sua ajuda",
				"added": 1471315428
			}
		]
	},
	"comment_vote": {
		"1_1A17wC2HtxE2oNfTmH9kD9WASwj86RUeQH": 1
	}
}