{
	"next_topic_id": 2,
	"topics": [
		{
			"topic_id": 1,
			"title": "How to launch zeronet without browser",
			"body": "I tried --open_browser None, to no avail.",
			"added": 1436392461
		}
	],
	"next_message_id": 15,
	"comments": {
		"4@62": [
			{
				"comment_id": 1,
				"body": "",
				"added": 1434562999
			},
			{
				"comment_id": 2,
				"body": "Wow, if you make a facebook-like social page, and make everything really easy to install and set-up... it might well catch on!\n\nI imagine you would only sign up to the content posted by your \"friends\". I imagine some algorithm would have to select, from all that content, what to display on your \"wall\". Lots of room for invention.\n\nGenerally speaking, I am very impressed with the speed of zeronet. Well done.",
				"added": 1434563124
			}
		],
		"3@2": [
			{
				"comment_id": 3,
				"body": "",
				"added": 1435175321
			},
			{
				"comment_id": 4,
				"body": "One click install of zeronet as a chrome/firefox extension using Python compiled for NaCl (chrome native-client) or asm.js. That is my idea, though I'm not up for doing it myself atm.",
				"added": 1435175386
			},
			{
				"comment_id": 5,
				"body": "> [ezekiel](#comment_4_219): Project Maelstrom is using a Chrome extension, but the whole setup is limited to a specific browser. The proxy idea means any browser can be used... It'd be neat though to have the data stored in HTML5 WebSQL or IndexedDB as an alternative way to store data.\n\nOh, I am not saying that ZeroNet should not work like a web server, all I'm saying is that it would be nice to have a one-click install of ZeroNet as a browser plugin, so that it runs whenever the browser is running. But to do this you need python.\n\nThe only way I know of getting python to run as a browser extension with reasonable efficiency is by compiling CPython using NaCl ([Chrome store link](https://chrome.google.com/webstore/detail/python/nodpmmidbgeganfponihbgmfcoiibffi?hl=en))",
				"added": 1435425401
			},
			{
				"comment_id": 6,
				"body": "I guess my point is basically this: Imagine the difference in adoption if in order to try zero net all you had to do was click one button in a webpage, vs downloading python, installing python extensions, etc. And suppose that as soon as you install that extension, you help maintain zeronet whenever you are browsing (because zeronet will be running).\n\nIt is OK if zeronet isn't as easy to install just yet, but I honestly believe that unless it becomes this easy one day, there will never be any widespread adoption.",
				"added": 1435425599
			},
			{
				"comment_id": 7,
				"body": "> [oracle](#comment_16_212): ZeroNet needs its own decentralized browser. ...\n\nSure, it would be nice to have a decentralized browser. But I believe that ZeroNet can only have impact if it is very easy and transparent to use. If people need to download their own browser, ZeroNet will fail - mark my words.\n\nAnd it is much more important that zeronet succeeds at a vast scale, than it is that it abides by some sort of puritanical coding ideal.\n\nIt is especially important that zeronet and other non-piracy-related P2P technologies reach the point when there are so many users that blocking P2P protocols would no longer be politically feasible. I believe we are nearing the day when politicians will start considering whether they should pass legislation to block the entire bittorrent protocol; it is important that when that day comes, there is enough legitimate content being distributed via P2P that such a move would be political suicide.",
				"added": 1435432421
			}
		],
		"1@250": [
			{
				"comment_id": 8,
				"body": "",
				"added": 1436133388
			},
			{
				"comment_id": 9,
				"body": "no, zeronet gives no guarantee of anonimity.",
				"added": 1436133404
			}
		],
		"1@264": [
			{
				"comment_id": 10,
				"body": "",
				"added": 1436392473
			},
			{
				"comment_id": 11,
				"body": "What's yours?",
				"added": 1436392477
			},
			{
				"comment_id": 12,
				"body": "(I don't know any)",
				"added": 1436392489
			}
		],
		"1@213": [
			{
				"comment_id": 13,
				"body": "Thank you.",
				"added": 1436395164
			}
		],
		"1@274": [
			{
				"comment_id": 14,
				"body": "Hmm, as I understand it, performance is only essential for the underlying protocol (bittorrent, which is written in C), the wrapper-protocol is just a very smart kind of glue, and should not be performance-critical. Could be completely wrong here...",
				"added": 1436458500
			}
		]
	},
	"comment_votes": {
		"4@219": 1
	},
	"topic_votes": {
		"3@2": 1
	}
}