{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1
	},
	"next_comment_id": 33,
	"comment": {
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 1,
				"body": "Dois Homens e Meio S07E20 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578198698_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578198858
			},
			{
				"comment_id": 2,
				"body": "The Big Bang Theory S05E14 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578203976_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578204228
			},
			{
				"comment_id": 4,
				"body": "The Big Bang Theory S05E15 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578217382_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578217435
			},
			{
				"comment_id": 6,
				"body": "Dois Homens e Meio S07E22 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578377463_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578378008
			},
			{
				"comment_id": 7,
				"body": "The Big Bang Theory S05E17 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578378103_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578378244
			},
			{
				"comment_id": 13,
				"body": "Dois Homens e Meio S08E03 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578643330_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578643382
			},
			{
				"comment_id": 14,
				"body": "The Big Bang Theory S05E20 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578643464_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578643530
			},
			{
				"comment_id": 26,
				"body": "Dois Homens e Meio S08E06 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578907140_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578907278
			},
			{
				"comment_id": 27,
				"body": "The Big Bang Theory S05E23 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578907324_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578907427
			},
			{
				"comment_id": 28,
				"body": "Dois Homens e Meio S08E07 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579030630_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1579035535
			},
			{
				"comment_id": 29,
				"body": "The Big Bang Theory S05E24 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579035701_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1579035770
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "Star Trek VI - The Undiscovered Country (Jornada nas Estrelas VI - A Terra Desconhecida) 1991 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578526748_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL\n\nSinopse: Enormes despesas militares e a destruição de uma importante fonte de energia estão levando o Império Klingon ao colapso. Para evitar o desastre total, o Chanceler do Alto Conselho Klingon propõe negociações de paz entre a Federação e o Império para terminar com anos de hostilidades. Kirk e a Enterprise são designados para escoltar o Chanceler. Mas o assassinato do Chanceler interrompe as negociações. Kirk e McCoy são presos, julgados e condenados pelo crime. Lutando contra o tempo, Spock e a tripulação trabalham para descobrir o verdadeiro assassino, salvar Kirk e McCoy e retomar o processo de paz.",
				"added": 1578530056
			},
			{
				"comment_id": 20,
				"body": "Star Wars Episode VI Return of the Jedi (O Retorno de Jedi) 1983 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578719255_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL\n\nSinopse: O imperador (Ian McDiarmid) está supervisionando a construção de uma nova Estrela da Morte. Enquanto isso Luke Skywalker (Mark Hamill) liberta Han Solo (Harrison Ford) e a Princesa Leia (Carrie Fisher) das mãos de Jaba, o pior bandido das galáxias. Luke só se tornará um cavaleiro jedi quando destruir Darth Vader, que ainda pretende atraí-lo para o lado sombrio da “Força”. No entanto a luta entre os dois vai revelar um inesperado segredo.",
				"added": 1578720189
			},
			{
				"comment_id": 23,
				"body": "Star Wars IV - Uma Nova Esperança 1977 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578820395_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL\n\nSinopse: Luke Skywalker (Mark Hammil) sonha ir para a Academia como seus amigos, mas se vê envolvido em uma guerra intergalática quando seu tio compra dois robôs e com eles encontra uma mensagem da princesa Leia Organa (Carrie Fisher) para o jedi Obi-Wan Kenobi (Alec Guiness) sobre os planos da construção da Estrela da Morte, uma gigantesca estação espacial com capacidade para destruir um planeta. Luke então se junta ao cavaleiro jedi e a Han Solo (Harrison Ford), um mercenário, para tentar destruir esta terrível ameaça ao lado dos membros da resistência.",
				"added": 1578820923
			},
			{
				"comment_id": 24,
				"body": "Blade 2 2002 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578883056_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL\n\nSinopse: Blade (Wesley Snipes) é um ser meio homem, meio vampiro que é consumido pelo desejo de vingança contra os seres que atacaram sua mãe antes mesmo dele nascer e fizeram com que ele se tornasse o que é atualmente. Com isso, ao crescer Blade iniciou uma verdadeira cruzada pessoal para combater e eliminar os vampiros, mas agora uma nova raça mais poderosa chamada reapers, criada a partir de cruzamentos genéticos entre humanos e vampiros, ameaça eliminar ambas as raças. Visto isso, Blade se alia aos seus maiores inimigos para que, juntos, possam combater esta nova raça de seres.",
				"added": 1578883789
			},
			{
				"comment_id": 25,
				"body": "Blade 3 Trinity 2004 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578906139_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL\n\n\nSinopse: Em uma base localizada no deserto os vampiros dão a cartada decisiva em seus planos para conquistar o mundo: ressuscitam Drácula (Dominic Purcell), que deu origem à raça e possui poderes que lhe permite sobreviver à luz do dia. Em paralelo os vampiros iniciam uma campanha difamatória contra Blade (Wesley Snipes), colocando o FBI em seu encalço. Após alguns confrontos com agentes, Blade e Whistler (Kris Kristofferson) percebem que precisam de ajuda. Após ser atacado e capturado, Blade é salvo pelos Notívagos, um grupo de humanos que se dedica a caçar vampiros e que é liderado por Abigail (Jessica Biel), que é também a filha de Whistler. Juntamente com Hannibal King (Ryan Reynolds) e a cientista Sommerfield (Natasha Lyonne), que possui uma deficiência visual, Blade e os Notívagos iniciam uma série de batalhas contra Dranica Talos (Parker Posey), a atual líder dos vampiros, sem saber que terão que enfrentar o próprio Drácula.",
				"added": 1578906456
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 8,
				"body": "Dragon Ball Z - Episodio 012 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578378353_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578378459
			},
			{
				"comment_id": 15,
				"body": "Dragon Ball Z - Episodio 013 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578686869_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578687013
			},
			{
				"comment_id": 18,
				"body": "Dragon Ball Z - Episodio 014 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578687388_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578687454
			},
			{
				"comment_id": 30,
				"body": "Dragon Ball Z - Episodio 016 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579042970_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1579043333
			},
			{
				"comment_id": 31,
				"body": "Naruto Classico 19 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Latest",
				"added": 1579069337
			},
			{
				"comment_id": 32,
				"body": "Dragon Ball Z - Episodio 017 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579115857_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1579117227
			}
		],
		"1_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 10,
				"body": "tu pode usar o big kopy kate 2 http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD\n\nQue é mais descentralizado, tem suporte ao sistema de login cryptoid http://127.0.0.1:43110/cryptoid.bit/\n\nEu estou usando ele para postar as coisas.\n\nJustiça ordena retirada do especial do Porta dos Fundos do ar (ANCAPSU)\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1578611580_1M48uhWjcMtusz9ih6Cu9QoJzhns9m2gvL",
				"added": 1578626536
			},
			{
				"comment_id": 11,
				"body": "> [aassddff](#comment_1_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): É uma fork? O Dev do KopyKate parece meio desorganizado. Além de usar o Cryptoid,  há alguma outra vantagem?\n\nacho que é mais pela liberdade, vi alguém se dizendo  um dos desenvolvedores do big kopy kate 2, dizendo que eles não irão censurar NEM UM CONTEUDO no site, tudo é permitido ali.\n\nE que cada um que bloquei individualmente o que achar ruim.\n\nIsto me fez usar ele mais do que tudo.\n\nVi também que querem adicionar suporte a playlists, opção de bloquear canais, assim, facilitando a moderação INDIVIDUAL por parte de cada usuário, no caso o canal que tu bloqueasse, seria bloqueado somente para ti e não para os outros, isto é show, espero que coloquem logo isto.\n\nOutra opção também que vi falarem foi de adicionar o autoplay opcional, muito bom para poder ficar vendo videos na playlist e etc.\n\nE adicionar mais sistemas de logins, pois eu pelo menos gostaria que adicionassem mais uns 4 pelo menos e de preferencia um sistema de login próprio do site mesmo, que só precisa-se baixar o site e pronto, estaria tudo ali.\n\nHá outra diferença é o suporte a arquivo mp3, mkv, ogv e também a envio de arquivos maiores do que 2GB, se não me engano o limite estava em 15GB por arquivo.\n\nEspero que aumentem para sei lá 50GB, 100GB, pois isto não faz muita diferença, pois não baixamos automaticamente o filme mesmo, e é bom, que poderiamos deixar filmes em qualidade melhores :D",
				"added": 1578636071
			},
			{
				"comment_id": 12,
				"body": "> [aassddff](#comment_1_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): É uma fork? O Dev do KopyKate parece meio desorganizado. Além de usar o Cryptoid,  há alguma outra vantagem?\n\ne sim é um fork pelo que vi, por isto o nome, pois a desenvolvedora do big kopy kate 2, não estava mais desenvolvendo, eu até mesmo falei para ela adicionar suporte a mais logins, falei com ela lá no canal do youtube dela, mas ela pelo visto ignorou, não falou nada.\n\nDai acho que algum usuário ou usuários da zeronet, viram e fizeram este fork, ainda bem :D",
				"added": 1578636152
			},
			{
				"comment_id": 16,
				"body": "> [aassddff](#comment_2_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Há alguma forma de migrar os Vídeos, ou eu precisaria repostar?\n\nsim dá para migrar tri facil eu fiz isto auheuahuhea :D.\n\nTipo tu vai na tua pasta lá do kopy kate original lá e é só copiar ela e colar na do big kopy kate 2 , toda tua pasta e depois logar com o mesmo login no big kopy kate 2 e enviar algum arquivo pelo teu usuário e pronto ele vai atualizar os dados todos do teu usuário neste site.\n\nEu fiz isto , achei FODA ISTO :)\n\nBem pratico :D",
				"added": 1578687237
			},
			{
				"comment_id": 17,
				"body": "> [aassddff](#comment_3_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): E onde está o código fonte da fork? Não encontrei. O botão de source code leva ao original.\n\no código fonte é o próprio site, na zeronet pelo que sei é tudo javascript basicamente :D",
				"added": 1578687274
			},
			{
				"comment_id": 19,
				"body": "> [aassddff](#comment_4_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Vou manter um mirror na fork. O fato do original ter um domínio torna mais atrativo. Mas ter o mirror facilita para quem não quer usar o zeroid.\n\noutra vantagem do clone, ele NÃO VAI deletar NEM UM TIPO DE VIDEO.\n\nIsto acho até mais importante que as outras coisas que gostaria de ver, pois liberdade não existe pela metade a kitty, dona do site original , disse que iria deletar porno, videos destes tiroteios tipo o lá do pais dela, do covarde que atirou em uns mulçumanos pacificos NESTE CASO,  ela está com medo sei lá eu do que.\n\nNo brasil nos parecemos ter mais liberdade na internet que nos EUA e muitos outros lugares do mundo.\n\nIsto é bom :)",
				"added": 1578717308
			},
			{
				"comment_id": 21,
				"body": "show tu conseguiu fazer o que disse :D, vi que tu enviou vários videos de uma vez só :D gogoo zeronet",
				"added": 1578733635
			},
			{
				"comment_id": 22,
				"body": "> [aassddff](#comment_5_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Sim, nem se compara. Não se pode fazer nada nos outros países. O Reino Unido é a China da Europa.O Brasil tem muito problema pra se dar ao luxo de investir pesadamente em espionagem e restringir a computação.Sou feliz por ter nascido aqui.\n> Outra coisa, sabe me dizer se algum deles suporta legendas? Queria colocar múltiplas legendas para português e inglês, mas não gosto de queimar a legenda no vídeo.\n\nque eu saiba nem um ainda na zeronet tem suporte.\n\nEu espero que o big kopy kate 2 , implemente isto também, que é suporte a mais de 1 audio no video e legendas, seria foda :D",
				"added": 1578770143
			}
		]
	},
	"comment_vote": {
		"1_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"17_14mqeC9JkKTrWmaR1X4LdtdAuB8qaAhbNB": 1,
		"3_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"5_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1
	}
}