{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "По поводу децентрализованной SQL-базы ZeroNet",
			"body": "Если я правильно понимаю, то у каждого сайта есть свой файл базы.\n\nВопрос в том, что если, к примеру, этот форум перерастёт за 1000 пользователей, а сообщения перерастут за несколько миллионов, то этот файл будет у всех локально храниться. Он может весить гигабайты. При этом я не знаю по каким алгоритмам работает эта база, но если это что-то типа SQLite, то такие объёмы будут жестко жрать ресурсы компа при выборке информации из базы и прочих манипуляциях.\n\nПо сути, ZeroNet потащит только небольшие веб-приложения? Серьёзные сервисы в таком контексте реализовать не получится?\n\nХотелось бы прояснить этот момент.",
			"added": 1584209862
		}
	],
	"topic_vote": {
		"1_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp": 1,
		"4_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": 1,
		"1_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp": [
			{
				"comment_id": 1,
				"body": "Приветствую! Тоже вот только сегодня поставил. Знал довольно давно, просто читал статьи, но как-то попробовать только сегодня руки дошли. Теперь хочу попробовать написать какой-нибудь русскоязычный сайт в ZeroNet. Опять же, не знаю когда дойдут руки.",
				"added": 1584183084
			}
		],
		"4_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": [
			{
				"comment_id": 2,
				"body": "Mint 18.3 (Ubuntu 16.04):\nCryptBitcoin:\n- hdPrivatekey x 10..........0.085s [x8.21: Insane!!]\n- sign x 10..........0.116s [x3.01: WOW]\n- btctools verify x 100..........0.794s [x0.47: Ehh]\n+ Loaded lib: <CDLL '../runtime/lib/libcrypto.so.1.1', handle 56186afe3420 at 0x7fca1027a438>\n- openssl verify x 100..........0.060s [x6.16: Insane!!]\n+ Loaded lib: CompiledLib\n- libsecp256k1 verify x 100..........0.019s [x19.12: Insane!!]\n\nCryptHash:\n- sha256 5M x 10..........0.128s [x4.70: Insane!!]\n- sha512 5M x 10..........0.083s [x7.27: Insane!!]\n- os.urandom(256) x 1000..........0.020s [x0.33: Ehh]\n\nMsgpack: (version: 0.6.1)\n- pack 5K x 10 000..........0.017s [x46.41: Insane!!]\n- unpack 5K x 10 000..........0.032s [x37.69: Insane!!]\n- streaming unpack 5K x 10 000 (fallback: True)..........0.227s [x6.18: Insane!!]\n- streaming unpack 5K x 10 000 (fallback: False)..........0.019s [x73.29: Insane!!]\n\nDb: (version: 3.29.0, API: 2.6.0)\n- Open x 10..........0.323s [x0.40: Ehh]\n- Insert x 10 x 1000..........0.207s [x4.82: Insane!!]\n- Buffered insert x 100 x 100..........0.243s [x5.36: Insane!!]\n+ Total rows in db: 20000\n- Indexed query x 1000..........0.043s [x5.76: Insane!!]\n- Not indexed query x 100..........0.094s [x6.38: Insane!!]\n- Like query x 100..........0.214s [x8.40: Insane!!]\n\nCompression:\n- Zip pack x 10..........0.081s [x1.48: Fine]\n- Zip unpack x 10..........0.072s [x2.77: WOW]\n- Tar.gz pack x 10..........0.086s [x3.50: Insane!!]\n- Tar.gz unpack (1.55kB) x 10..........0.073s [x2.73: WOW]\n- Tar.bz2 pack x 10..........0.829s [x2.41: Fast]\n- Tar.bz2 unpack (0.53kB) x 10..........0.200s [x2.50: Fast]\n- Tar.xz pack x 10..........0.216s [x6.47: Insane!!]\n- Tar.xz unpack (0.67kB) x 10..........0.066s [x3.02: WOW]\n\nDone. Total: 4.88s\nBenchmarking ZeroNet 0.7.1 (rev4206) Python 3.7.3 (default, Mar 27 2019, 22:11:17) \n[GCC 7.3.0] on: linux...",
				"added": 1584209523
			}
		],
		"1_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_253_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Уже давно:\n> $ ls 1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/ | wc -l\n> 6006\n> \n> До миллиона еще далеко:\n> $ grep -r '\"body\":' 1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/data/users/ | wc -l\n> 59105\n> \n> Это она и есть. Надо решать проблемы по мере их появления. Пока еще SQLite тянет нагрузку.\n> \n> Надо просто не класть все яйца в одну корзину. Вместо 50 подразделов на крупном форуме, в ZeroNet можно сделать просто 50 форумов.\n\nСпасибо за ответ. Всё понятно.\n\nЯ имел ввиду 1000 активных пользователей, а не просто зарегистрированных. У меня на форуме 5902 пользователя, только из них постоянно общается только около 20 человек.\n\nПро \"все яйца в одну корзину\" - форум был приведён просто как пример. В самом сообщении я пишу вообще о некоем абстрактном сервисе.\n\nЧто касается решения проблем по мере их поступления, то в какой-то мере я с вами согласен, но в разработке далеко не всегда такой подход полезен. Желательно изначально продумывать архитектуру с запасом масштабируемости. Ибо, в противном случае, оказывается, что разработчик создавал проект \"да ладно, там разберёмся, пока и так нормально\" и проект начинает обрастать костылями и велосипедами. Что в итоге приводит к тому, что дальнейшая разработка и управление становится лютым геморроем и лучше убить кучу времени, но переписать всё с ноля. А можно было бы избежать этой ситуации. Я как бы не критикую, посмотрим как оно дальше, но просто есть у меня небольшие опасения, что SQLite может стать узким местом.",
				"added": 1584254804
			},
			{
				"comment_id": 4,
				"body": "> [geekless](#comment_257_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Думаю, проблема больше в движках сайтов, чем в ядре. Добавить поддержку внешней СУБД в ядро возможно. Я так понимаю, что сейчас все пишут sql запросы, исходя из того, что под капотом точно SQLite. Так что старые сайты так и останутся на SQLite, ну а поддерживаемым движкам придётся добавить слой абстракции над конкретным диалектом.\n> Второй вопрос: как полноценная СУБД с миллионами записей будет ворочаться на обычных пользовательских устройствах. Так что делить на маленькие части и ограничиваться небольшими сообществами, возможно, всё равно придётся.\n> Возможно, эта проблема вообще не будет актуальна, если посещаемость ZeroNet будет расти медленнее роста железа.\n\nТут нет никаких движков сайтов. Тут по сути приложения на JavaScript, которые работают в браузере. Никакого бэкэнда нет. Всё ложится именно на компьютер (браузер) пользователя. Добавить поддержку внешней СУБД в ядро - да хоть чего вы туда добавьте - это не меняет ситуации. БД должна быть децентрализованной. Для больших БД тогда нужны всё равно серверы, а это уже уничтожает децентрализованность. Или каждому пользователю запустить у себя сервер серьёзной СУБД с репликацией и балансировкой нагрузки? Вообще-то вроде ZeroNet как раз убегает от этих сложностей и нужен запуск в один клик для любого человека.\n\nВот в том и прикол, что если будет огромная база, то надо будет как-то её делить и надо будет иметь механизм, чтобы один узел, у которого нет какого-то абстрактного 3085 Мбайта базы у себя, как-то у мел сделать запрос к нему. Также умел делать подсчёт всех записей в базе, сортировку по базе, сложные запросы, связи с другими таблицами и т. д. А как он может сделать такие SQL-запросы, если его система в принципе не знает о существовании других данных, пока не скачает себе все гигабайты это базы и полностью все индексы там не построит для выполнения запросов (в современных SQL базах типа MySQL, PostgreSQL, Oracle запросы делаются не просто так, там специальный \"ИИ\" придумывает как правильно выполнить определённый запрос, основываясь на анализе текущего состояния базы и структуре запроса)?\n\nА ещё, думаю, можно было бы добавить поддержку NoSQL баз. Для небольших проектов они даже лучше и быстрее.\n\nЧто касается актуальности проблемы - я уже сказал, я не критикую, а предполагаю и ввожу тему для обсуждения. Как оно там будет в дальнейшем - увидим. Но обсудить это вполне интересно.",
				"added": 1584279057
			}
		],
		"16_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 5,
				"body": "> [geekless](#comment_254_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я так понимаю, @shift прибавил лимит и снова нас покинул на неопределённый срок, возможно, навсегда. Движок он обновлять не будет, в движухе никакой участвовать не будет и т.п.\n> Вообще не очень ясно, что с этим делать, не только в RU разделе, но и в других языковых. Там тоже много где форумы фактически без администрирования.\n\nТа не очкуй! Прорвёмся. Сюда я залез. Походу я тут надолго. Буду приложухи писать под ZeroNet, мне понравилось тут. Поднимем русскоязычное сообщество тут.\n\nОпять же два момента:\n- мало людей - хорошо, меньше неадекватов, разного хлама и прочей гадости, которой завален интернет\n- мало людей - плохо, некому генерировать контент, поддерживать сообщество, разрабатывать новое и т. д.\n\nВот как-то так.",
				"added": 1584287485
			}
		]
	},
	"comment_vote": {
		"254_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"82_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1
	}
}