{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1516747912_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hi, this is what i am missing so far: [...]\n\n\n> => community moderation of the talk to prevent case the site gets overspammed when admin die/abandon site\n>  => downvotes / flag as a spam option. Topics flagged Too many times will disappear from public until site admin/moderators will put them back or delete permanently. such topic can no longer be put for moderation unless author will modify it.\n\nThere are problems with these. With this system, currently a user can create an unlimited amount of id's to wrongfully downvote (or upvote) / report/flag a post on all of the ids.\n\n> => auto increase users limit of published content (USED: x/20K) by lets say 1K every day to prevent reaching limit on admin abandoned sites in future\n\nThis would require a server running full time, which is doable (since there are two bots on ZeroTalk that do this), but if that server goes offline, this function would no longer work anymore.",
				"added": 1519921496
			},
			{
				"comment_id": 2,
				"body": "> [ssdifnskdjfnsdjk](#comment_18_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i see. But if the vote system can be abused, i think same apply on standard commenting system which can be abused for spam or make site unusable by spam flood from many ids created from one machine. In that case some antibot/user reputation system may be needed: https://github.com/HelloZeroNet/ZeroNet/issues/1310\n\nOne way in which Nofish is going to improve the id situation is by adding a way for users to create a key with a prefix that takes over a day for your computer to compute (I think it's called proof of work?). There's also muting users.\n\nHere's the issue for proof of work id's on GitHub: [https://github.com/HelloZeroNet/ZeroNet/issues/1258](https://github.com/HelloZeroNet/ZeroNet/issues/1258)\n\nHowever, I would say the abuse of downvoting and upvoting is worse than spam comments because downvoting and upvoting prioritizes posts over others or makes posts not visible, while spamming doesn't really do this all that much. Spamming doesn't really change the order of the posts and the visibility (to a certain extent).",
				"added": 1519943748
			}
		],
		"1520651746_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 3,
				"body": "You can change the language on ZeroHello by clicking the three dots next to the logo. This changes the language for the sidebar on all zites and for ZeroHello. It doesn't change for other zites because that's dependent on the creators of those zites.",
				"added": 1520652127
			},
			{
				"comment_id": 4,
				"body": "> [leftside](#comment_1_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I already know that, but I would like zeronet to display another language by default from the fresh installed start.  [...]\n\nAre you saying it resets everytime you restart the client? I didn't know that.\n\nHmm... I don't know why ZeroTalk changes - I'll have to look into how @nofish is doing that - perhaps there is a way for a zite to detect the language a user has set from ZeroHello.",
				"added": 1520652908
			},
			{
				"comment_id": 7,
				"body": "> [leftside](#comment_1_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I already know that, but I would like zeronet to display another language by default from the fresh installed start.  [...]\n\nZeroTalk actually is not affected because there are clones for specific languages.",
				"added": 1520668037
			},
			{
				"comment_id": 8,
				"body": "> [leftside](#comment_4_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): As I tested yesterday and now, if I modify the language setting in HelloZeroNet, not only ZeroTalk but also ZeroTalk cloned sites show the changed language menus.\n\nDo you mean on the actual zite or on the sidebar that you get to by swiping over the 0 button in the top right? If you mean the latter - that's not a part of any zites (it's an overlay from the client, not from the code of the zite) and that'll change for all zites. But the actual zite itself shouldn't change from what I'm experiencing.",
				"added": 1520671788
			},
			{
				"comment_id": 9,
				"body": "> [leftside](#comment_5_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Actual sites like ZeroTalk and its derivatives. For example, if I switch the language from en to zh, ZeroTalk main page title is converted from Newest topics to 最新的话题 including other menus such as + Start new topic and so on, everything.\n\nI see what the problem was. It changes for `ZH`, but not for the language that I was selecting when I originally tried it (`DE`). So it only works for some languages.",
				"added": 1520672242
			}
		],
		"1520652473_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 5,
				"body": "It will tell you on ZeroHello by showing a green button if you need to update. However, it only tells you if there is a change in the major or minor numbers (ex: change from 0.6.1 to 0.6.2 or to 0.7.0, etc) - It does *not* tell you if it's just a revision change/update. I usually just look on GitHub to see if there are revision updates.",
				"added": 1520653031
			}
		]
	},
	"comment_vote": {
		"2_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"28_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1EmrB8xSDYobVFSc3Kad1vx1EPaPR2myCW": 1,
		"3_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": 1
	}
}