{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"46_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM": [
			{
				"comment_id": 1,
				"body": "setting hidden service to be on port 80, but local HTTP server on port 8080 is very important.\nUsing port 80 requires root, which is a huge OUCH to security, as root is able to bypass too much stuff.\n\nAlso, I recommend running the web server either as a separate user with very limited permissions, or in anything more isolated that you can get. (the more isolated your server is the safer it is)",
				"added": 1507454256
			},
			{
				"comment_id": 2,
				"body": "> [rwxy](#comment_50_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM): @mari0  thanks .in fact,I am confused about \"What user to install the tor (root?) and What user to run the tor service up\".I will have a try these days. The safe is the most important~\n\nYou need root to install your webserver and tor service, but you mustn't run either of these as root, you should use other account. You can make users called \"tor\" and \"onion1\" for your Tor and web server respectively.\nThen, you can point your hidden service to port 8080. (where website is at)\nThis way, if anyone manages to break your server application and try to do anything he will be restricted by server not running as root.\n\nIf you're even more serious about this, you can even try Linux Containers (LXC) for near zero overhead virtualization. Linux Containers are able to restrict web server to be unable to make any connections to outside world (No Such Agency, Fucking Bimbo Imbeciles and others can't decloak server)",
				"added": 1508857537
			},
			{
				"comment_id": 3,
				"body": "> [rwxy](#comment_73_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM): @mari0 One more question:what about HTTPS ?My tor hidden service is only HTTP now.\n\nAs OR (Onion Routing) protocol Tor uses already guarantees end-to-end encryption, HTTPS is unnecessary.\nIt's only needed if you need to use dangerous browser features, but then, most Tor Browser uses disable Javascript.\n\nHTTPS over Tor is a bit of an overkill, stick with HTTP.",
				"added": 1509026672
			}
		]
	},
	"comment_vote": {}
}