{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1545899218,
			"title": "\"File update failed\" - should I care?",
			"body": "n00b here.  During some updates on my \"home page\" I get a bell symbol and the message \"file update failed\" - do I need to do anything / will I lose data? Or is this just informative and eventually the files should update?",
			"added": 1545899217
		}
	],
	"topic_vote": {
		"1545703017_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": 1,
		"1545819941_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"1545423165_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
		"1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1509065748_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1545703017_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": [
			{
				"comment_id": 1,
				"body": "That's looks pretty cool; thanks for posting it.  I'll check it out.",
				"added": 1545703922
			}
		],
		"1545819941_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": [
			{
				"comment_id": 2,
				"body": "> [tusiko](#comment_53_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs): A PGP mail over Tor would be much more secure because it can be deleted by the sender or recipient. Or even the new provider Tutanota, who encrypts everything in a message would be a good way. If both, sender and recipient are customers there, no bit is send over the internet. The mail stays in the house. Same with Torbox.\n\nFor encrypted mail I use protonmail.com  Note that I'm trusting them on their promise to encrypt, so this may not be secure enough for one's purpose.\n\nWhen you think about it, deleting a message you received is a bit of an illusion.  If the sender has a copy, let alone an intermediate server, that copy can be sent around (or a screengrab, etc).  When we delete something from our email we have the illusion that it's \"gone\".  But it never is.  So, this is actually a \"feature\" in that it reminds us we can't really delete anything we've sent or received.  On the other hand, as caryoscelus points out, besides the sender and receiver, there is only an encrypted copy around which is way better than what Google, Yahoo, etc. offer. :-)\n\nIt might be a good feature if ZeroMail could \"forget\" messages - just not display them.  That just serves as an illusion, but it makes things act how we except so might be more user friendly.",
				"added": 1545898983
			}
		],
		"1545423165_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 3,
				"body": "All of those are good ideas for the most part, but to do them properly might be difficult without rewriting large sections.\n\nOne optimization might be easy.  The client should already know the hashes of the files.  If it goes to pull a file for a site, it could check the local disk if it has a file matching that hash from some other site that was cloned.  If so, just copy it local and don't pull / request it.\n\nThat would at least save on network / transfer time.",
				"added": 1545912645
			},
			{
				"comment_id": 4,
				"body": "> [quantumworld](#comment_92_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): This program is not coded to be modular?\n\nYes, it's coded to be modular, of course.  But sometimes the modularity needs to change in programs.  Hindsight is perfect, foresight not so much. ;-)",
				"added": 1546025905
			},
			{
				"comment_id": 5,
				"body": "One idea I had was archival stores using cloud storage.\n\nThere could be seeder nodes that grab information and put them in cold storage (e.g., save them to a cloud service with free storage like Mega, Google Drive, or even Glacier - all encrypted of course).  When someone tries to access a zite and there are no seeders available, they can ask the seeder node and it can return a share link to the cloud file.  The client pulls it down and can begin re-seeding. This way stuff won't fall off the edge if it's inactive, and the seeder nodes only \"pay\" the cost of the initial download to cloud which makes it much more palatable to set one up.\n\nMaybe I'll do a prototype of this and send it out and we can see how well it works.",
				"added": 1546026157
			},
			{
				"comment_id": 7,
				"body": "> [quantumworld](#comment_101_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Cloud storage defeats the purpose of a p2p network.\n\nNot really.  Your node doesn't know if my node is pulling the files from an SSD, a thumb drive, cassette tape, or my Google Drive.  Nor should it care.  The point is the data is decentralized and replicated by multiple nodes; where the nodes store it is immaterial.\n\nThe use case is an important but rarely visited node and also archival.  Seeding sites can dump this into like Glacier or wherever they want at low or zero storage cost.  If there are no other seeders, the client can reach out to a \"ZeroNet Seedbox\" and it can offer the URL to the file (in the case of something like Mega, etc) or retrieve it himself off cold storage (like glacier) and serve it up that way.\n\nIf someone doesn't want to pull from an  archive, that setting can be offered and the \"seedboxen\" not queried if the site isn't found.  I don't see the point of this since anyone who wants anonymity on zeronet should be using a VPN or TOR, but it's an option.\n\nA general user is going to limit how much he seeds and for how long probably because of storage and bandwidth reasons.  If we enable them to use their free google drive / mega /etc cloud storage, we might have a better acceptance rate.  This transfer the cost of storage / bandwidth to their free account.",
				"added": 1546472255
			},
			{
				"comment_id": 8,
				"body": "> [polar2](#comment_52_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum): the strange smell of ZeroNet source code (I mean, I am difficult to understand source code)\n\nI've started reading through it, and yes, it could use some documentation and comments.  It makes sense after a while though. :-)",
				"added": 1546472417
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_387_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Did you not join ZeroNet because of clearnet big tech censorship? [...]\n\nIf you don't know how to encrypt stuff you put on a cloud provider so they can't just scan all your files then I don't know what to say.  If they want to censor my encrypted file called \"wekrjhaklh\" accessed from random IPs throughout the net, then good luck to them finding a heuristic that doesn't cause everything else to get censored as well.\n\nThe censorship is in the platforms, not in P2P storage.\n\nThat said, you're missing the point that this is for archival storage, not for day to day use.  For a popular site, the archival nodes would never need to be hit because the data is already available.",
				"added": 1546472797
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_388_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I missed the context. My bad. Move on.\n\nNo worries and will do.",
				"added": 1546473048
			},
			{
				"comment_id": 11,
				"body": "> [anonymoose](#comment_15_12Y8rPJTMwJ3tTh5j81JPy6HrMf4KvY6Uq): @hexator [...]\n\n>You mean that you can simply give ZeroNet an URL and it'll use that to bootstrap to the ZeroNet network?\n\nYes\n\nIf a site goes offline, there's a way to start seeding it again.  The node that gets the file from the URL then goes back to seeding it as normal.  So it's self-healing.\n\nBut there's a leech risk that would need to be dealt with.  Downloading a file from cloud is much faster than a peer generally (especially if the files end up being broken into blocks like on bittorrent).  Someone could \"cheat\" and always try the archive first before going to peers.  We would need to figure out a way to ensure there were no other peers before we offered the link so as to encourage seeding.\n\n>These ideas can be abstracted in the source code as \"virtual peers\" so that the ZeroNet client handles the data on a \"cloud\" synchronized folder or static data on-disk (e.g, a ZIP file) the same way it handles data from peers.\n\nYeah, I was looking at the storage manager code.  Could probably be plugged in there.  The protocol would need some fields put in the response as well.  At least \"this is a URL not a file\" signifier, and then the download code would know how to deal with it.\n\nIt would also be good if we could do something during announce; announce what kind of data blob we have and how quickly we can render it.  Like announce \"I have this hash and it is immediately available\" (metric 0)  \"I am redirecting you to a URL\" (metric 1)  \"I can get this for you but I have to pull it from cold storage so it might take 30 minutes\" (metric 2)  \"I can send you a floppy\" (metric 999)",
				"added": 1546486549
			}
		],
		"1546343751_15KiECsQ4gvgDdYjnvkScR9bSpCjJhxsFS": [
			{
				"comment_id": 6,
				"body": "Not sure the small userbase on ZeroNet will put a dent in that, but I give you an A for effort.",
				"added": 1546471758
			}
		],
		"1544911802_14cqdxte9VRXGe4WYEY49Htx1HxUqKNGrP": [
			{
				"comment_id": 12,
				"body": "> [pussyslayer](#comment_6_15VYBx1CGRe4VfqmywRjjB5Z3XtT6pMx6k): Porn master race will gas all incels.\n\nThe irony in that statement is level 9000.",
				"added": 1546487371
			}
		],
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 13,
				"body": "> [havin](#comment_2_1AvPdG8fBjmpY9xYBQBNdYatfAcxuMqy3E): How social media would be anonymous? it's a contradiction in itself.\n\nc.f. 4chan and tripfagging because that's what zeronet pretty much is.\n\nUnless one wants to be a selfie-posting attention whore THOT, it's easy to be social and anonymous.",
				"added": 1546487604
			},
			{
				"comment_id": 14,
				"body": "> [theanswerer0](#comment_11_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR): It would be fairly trivial to get gamers to use ZeroNet, and inadvertently assist with seeding\n\nAgree.  Just copy the steam model:\n\n\"Achievement Unlocked: 500 sites visited!  Have some pixels!\"  Then give them a little 0net badge  :^)",
				"added": 1546487689
			},
			{
				"comment_id": 15,
				"body": "I think theanswerer0 had a good idea.  If there were some kind of game that was fun that could only be played on zeronet it would draw people in.\n\nMaybe a MUD or people make bots (like in Corewars) that do battle with each other across zeronet using a simple scripting language.\n\nCLEARNET LINK:  https://www.corewars.org/",
				"added": 1546487915
			},
			{
				"comment_id": 16,
				"body": "> [quantumworld](#comment_111_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE):  I dont know if you noticed but everything is going down on clearnet. Eventually you will need to have a license to talk to anyone verbally. Oh ya they are going to go that far. \n\nYup.  I think the biggest concern right now is clearnet payment processing.  They're cutting off paypal, patreon, credit cards for \"wrongthink\"  Bitcoin is only part of the solution; a zeronet payment processor would be cool, and whoever does it right would probably make a few quid as well.",
				"added": 1546510364
			},
			{
				"comment_id": 17,
				"body": "> [onlinemovies](#comment_14_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp): We need a extra shared hosting protocoll like the safe Freenet.\n\nI was just thinking about this last night.  Freenet is good, but slow.  We can probably implement a bridge in the short term.  It's also worth looking at IPFS probably.\n\nCLEARNET: https://ipfs.io",
				"added": 1546510704
			}
		],
		"1546322357_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 18,
				"body": "A modified Tox could work because it's decentralized P2P  It also supports audio and video   Tox has some rough spots, though.",
				"added": 1546715146
			}
		],
		"1546708965_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 19,
				"body": "Linux 3.11 and newer | Language: Unknown | Link: OpenVPN UDP bs128 SHA1 lzo | MTU: 1392 | Distance: 11 Hops\n\nWhich is accurate - I'm going through a VPN;  Using Firefox (no TOR) on Debian",
				"added": 1546715576
			}
		],
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 20,
				"body": "> [quantumworld](#comment_78_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): My god if we never forked a Linux distro we would all be sitting in a green screen command line right now with no gui's.\n\nAgree.  Build on what we have. Let others use our stuff to build on.  This is the best way to make progress.  Yes, there will be a shit ton of bad sites, GUIs, etc. out there.  But every once in a while something amazing pops up.\n\nAs the saying goes: If we don't fail once in a while, we're not trying hard enough.",
				"added": 1546715876
			}
		]
	},
	"comment_vote": {
		"2_1DoWuJgxohLZ3Ctbm5U6mZ2r7RF3UCYc8S": 1,
		"347_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"54_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"248_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"568_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"52_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": 1,
		"388_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_1F2ZbgkHvpknveTB6wFa5xNEQBb8yxQnCR": 1,
		"111_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"14_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": 1,
		"117_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"79_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"78_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1
	}
}