{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1566184630,
			"title": "Darknet Markets",
			"body": "Hello everyone. I was wondering what happened to the old Darknet Markets? I remember back in the day Agora and a couple other like CGMC shut down on good terms. Heard the AlphaBay guy got caught and killed himself, and a lot of other sites just went down. DeepDotWeb has been out of update for years now, and I was wondering if the whole DNM scene is dead. Last I remember a lot of people were switching to Direct Deals for security reasons.",
			"added": 1566184629
		},
		{
			"topic_id": 1566241934,
			"title": "JavaScript & Tor",
			"body": "Is using Zeronet with VPN+Tor good enough for security? I'm concerned because zeronet requires javascript, as well as possibly exposing ones IP via P2P? I'm not too knowledgeable, so I just wanted to know what the risks of keeping javascript enabled in tor were/are.",
			"added": 1566241932
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1566158336_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 1,
				"body": "All beings, or at the very least, all humans should be granted the right to move away from a situation that causes them suffering, otherwise non-consensual situations/acts upon an individual are implicitly \"okay\". Women shouldn't be controlled against their will anymore than men should be controlled against their will, however it is prudent to recognize the differences psychologically between men and women, and how people react to both the sexes. Look up \"Women are Wonderful Effect\" to see how biased most people are for women. This plays out practically in the fact that women have a natural social advantage over virtually all men, but then they also want the social advantages men have created via society WITHOUT the responsibilities that go along with it (They want equal pay, but don't want to take stressful/dangerous jobs, they don't want to be eligible for the draft, they want gender quotas in jobs and universities of their choice instead of it being merit based, etc).\n\nIf you wish to know more about this, or have any questions at all, feel free to read the text on this website:\nEverDeeperHonesty.Com\n\nOr to message me directly (I am new to ZN so I guess the best place to reach me if PMs dont exist, is to find me on ZeroMe.)",
				"added": 1566159012
			},
			{
				"comment_id": 2,
				"body": "> [xlk](#comment_84_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Society controls us against our wills daily. You can only eat, smoke, watch, do or say what has been allowed you by your government and social norms. All rights are given in response to a fear of force. Men have force, females don't. Their only rights are the ones we give them. So, why do we give them rights that disadvantage ourselves? It seems mad to me.\n\nYou are right, we are controlled very much everyday, however that does not make it morally \"right.\". In my view the axiom of morality is consent. I believe it is this axiom because it is the most universally agreed upon sensation by virtually all beings. If someone hurts you physically or emotionally, you do not like it, and wish for them to stop. Everyone feels this way, at least at a certain threshold. Even people who are contrarian to the idea will admit to it if you cause enough suffering to them. While I agree in a natural view \"might makes right\" is correct, because it is the thing that existence naturally equips us with, and it plays out in nature everyday; \"I am bigger/stronger/faster and I want to eat you, so I will.\" / \"I'm smarter, more deceptive, less empathetic, and I want your things, so I take them.\" These are facts of life, but just because something is, does not make it the \"ideal\" way, it just makes it the way that is.\n\nI know I am rambling a bit at this point, so I will say this; life itself is suffering, all beings are faced with the fact that entropy exists, and that all people before us will grow sick, suffer injury, suffer from mundane things like hunger/thirst, and eventually grow weak and die. The only respite from this is the idea of reproduction, which gives us a way to express psuedo-immortality. However whatever little avoidance of suffering we get from reproduction, is outweighed heavily by the fact that those we create will have to suffer all the things we do. Combined with the fact that we cannot gain consent from those that are not yet born. So in a way, if you seek only to help yourself, then the current system is the one that \"works best\" in terms of the fact you are already here. However the whole reason that we suffer in the first place is because our predecessors either didn't give it much thought, or decided their own wants were greater than whatever suffering we would have to endure.\n\nSo to me the whole men vs women argument can be quite salient at times, but it is still an \"Us vs. Them\" mentality that we try to create in all things to make ourselves feel better about what we are. This applies to things like being white or black (or any other ethnicity), being proud of ones nationality, etc.\n\nIn the end there is only the acknowledgement that people have the right to self-determination in so far as we can reasonably give it to them (for those that are already alive, and the more potent acknowledgement that life itself is a prison that we force onto others to sate our own wants and needs.",
				"added": 1566159868
			},
			{
				"comment_id": 3,
				"body": "> [xlk](#comment_86_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): As a young child, I was a vegetarian for this reason; thinking it horrible to take an animal's life just to satiate my hunger. But then I realized that those animals are just as selfish. What gives plants the right to intercept beams of light and use them for selfish gain? But they do. And herbivores eat the plants and carnivores eat the herbivores, all in one big cycle of selfish entitlement.  [...]\n\nIt is not about  being \"better\" than others who do not follow your lifestyle, its about trying not to be a part of the cycle of suffering in whatever capacity you are capable of. Of course the logical conclusion of this is suicide, but not all people can reach this step, nor is it an inherently recommended thing to do considering its ambiguous nature. If I had to recommend anything to anyone, its that people have the right to self-determinate in the same way that you and I can differ on what is right/wrong. The only things I take a truly hard-line stance on is that people should have the freedom to take their own life if they wish, and that people should not be taught that reproduction is an intrinsic good. Personally I believe reproduction to be the utmost evil thing to do.\n\nFor example: As living beings yes, to continue living we have to consume matter, which often comes from other living things. We have to kill to continue living. However it can be argued that this is just a natural consequence of existing as what we are, something that we did not initially choose to do, since we did not choose to be born. These actions however, could be labeled as \"evil\" because of the suffering they may cause.\n\nHowever \"ultimate evil\" is the fact that beings such as us do not NEED to exist. We choose to create them for our own desires, when we have the knowledge that they are gauranteed to suffer. We created suffering where there did not need to be any.",
				"added": 1566160933
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_809_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"should have the freedom\"a shortcut:freedom does not exist, it's a concept [...]\n\n\"Why do your respond to society stimulis, do you need advice to live?\"\nI don't know what you meant by this.\n\nAlso why are you so focused on paganism?\n\nPersonally I believe in freedom as the highest goal of a society, but I do recognize that the governments that currently exist and spout things like being based on \"Freedom\" are ultimately lying to its citizens. Their actions and sayings are different. \"There is no one more enslaved than a man who believes he is free.\"",
				"added": 1566161618
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_810_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"should have the freedom\"you don't have freedom?\n\nDon't have the freedom to take my own life as it is illegal in most countries.\n\nDon't have the freedom to self-determinate as there are many laws and regulations that infringe upon my actions and choices which I had no say/decision in.",
				"added": 1566161986
			},
			{
				"comment_id": 6,
				"body": "> [xlk](#comment_88_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Exactly! The end result of believing in equality is that one should kill themself. As such, it seems to me that equality is a philosophical dead end that one shouldn't indulge in. We are selfish, greedy and we take what we can and compromise where we must. I can understand compromise between two men; I won't take your wife out in the bush and you won't attempt and possibly succeed in killing me. By why do we compromise with females? I really don't understand it. They have no leverage over us.\n\nI believe your argument assumes that there are no women capable of killing or tricking you. Women on average aren't as physically strong as men, this is true, however a gun doesn't discriminate by gender, or any number of other tools, or methods.",
				"added": 1566162075
			},
			{
				"comment_id": 7,
				"body": "> [kusoneko](#comment_1_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): If you don't fail at taking your own life, you do have that freedom.\n\nI suppose at this point I would be splitting hairs. The ideal would be able to take my own life with complete ease/instantly/without pain. Yes one can buy a gun, this shoot oneself in the head with it, but you'd be surprised how often suicide attempts fail. (You could shoot yourself in the head, and survive, only now you are severely cripple with brain damage and no longer have the ability to kill yourself, and are now in a much worse state.) This along with the fact that suicide is illegal, so if you attempt suicide and fail, you are now at the mercy of the state, who does not take kindly to people who attempt suicide, because it means they are a less reliable source of labor/production.\n\nMost readily available forms of suicide are either likely to fail and end in injury/medical incarceration, or are extremely painful, or both.",
				"added": 1566162246
			},
			{
				"comment_id": 8,
				"body": "> [xlk](#comment_89_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Men make guns. We can control whether women have access to them. Hell, we can control whether they have the ability to even leave the house.\n\nWhat is your justification for the oppression of women? Is it not similar to how men are now being oppressed by the current system?",
				"added": 1566162320
			},
			{
				"comment_id": 9,
				"body": "> [xlk](#comment_90_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): Because it benefits me. I believe that is all the justification life needs. [...]\n\nSo you do not believe in morality, you only believe in actions and consequences?",
				"added": 1566162480
			},
			{
				"comment_id": 10,
				"body": "> [nickwa](#comment_392_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): They don't even arrest you when you attempt suicide. They just put you in a mental ward and force drugs. That technically is like a prison though.\n\nMy point exactly. Once society has deemed you \"less than useful\" in that regard, you become a ward of the state until you have proven that you are willing to play along to the song and dance. Society does not wish to permit you to commit suicide, because there is virtually no benefit to them for doing so. However it implicitly means that you do not own your own body, it is property of the state.",
				"added": 1566162569
			},
			{
				"comment_id": 11,
				"body": "> [xlk](#comment_91_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): I believe morality is subjective and the universe is ultimately nihilistic, but have a bias toward the continuation of my genome as a sort of immortality which I have a strong desire for even if it is ultimately meaningless in a universe that is finite.\n\nI do not believe that we will come to terms with one another.",
				"added": 1566163002
			}
		],
		"1566184630_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 12,
				"body": "> [watteau](#comment_78_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Kim Dotcom,  currently going through lengthy legal proceedings and appeals to avoid being extradited to the United States.\n\nSo I take it there aren't really any markets left? No Nucleus or Dutch Market, anything?",
				"added": 1566187332
			},
			{
				"comment_id": 13,
				"body": "> [512](#comment_23_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3): https://dark.fail/http://darkfailllnkf4vf.onion/http://dreadditevelidot.onion/ [...]\n\nThank you very much.",
				"added": 1566238788
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 14,
				"body": "> [bigbadbob](#comment_373_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Good read [...]\n\nSo with VPN-->Tor-->Zeronet am I safe? Or is Zeronet a security risk?\n\nAlso would I bet better off using Tor by itself instead of VPN-->Tor?",
				"added": 1566257150
			},
			{
				"comment_id": 15,
				"body": "> [bigbadbob](#comment_374_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): There are fair more tech savy bastards than I here.  They should respond if I give a bad answer, lol   Do you use windows?   I use linux and only use tor with the tor browser.  No vpn at the moment.   When i use zeronet my browser cannot access the clear web.  My ip is spoofed here.    Nothing is perfect.   I certainly don't trust windows much.  Im not too worried cause I stay away from any auto down loading photos and not bothering with videos.\n\nAt the risk of revealing my methods, I have a chromebook that I deleted the ChromeOS off of and installed Linux on it. Whenever I start my computer I log into my vpn via terminal. Once I am connected to my VPN i open up the tor browser, and start Zeronet, which I always run within the tor browser with tor set to (always). The only weak link I can find is this chain is my VPN, but this article is a little confusing to me. It says that my IP address is visible to my VPN when I connect to tor, however, wouldnt my IP address be visible to my ISP anyways if I connected to tor without my VPN? Furthermore, yes, my VPN would be able to correlate that my real IP address is connecting to the tor network, but wouldn't the Tor Browser prevent any further information from being collected?",
				"added": 1566258785
			}
		]
	},
	"comment_vote": {
		"23_18JjtihTHzagQ7Ut2j4w9x6aB159JKCRu3": 1
	}
}