{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 53,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "а теперь вы мне поясняете:\nзачем это нужно когда есть фринет\\и2п для анонимности и обычный интернет для кинца\\сайтов\n???",
				"added": 1457199944
			},
			{
				"comment_id": 2,
				"body": "> [esteban](#comment_25_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Кто тебе сказал что нужно?\n\nочевидно что проект создавался для чего-то. никто не будет тратить месяцы работы ради тупого клона обычного интернета, который умрёт когда всем станет скучно",
				"added": 1457200232
			},
			{
				"comment_id": 3,
				"body": "> [esteban](#comment_26_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): А зачем тогда спрашиваешь? В том же i2p не научились в распределенные сайты, ни в торе. фринетом не пользовался.\n\nтак объясни мне зачем нужны распределённые сайты?\nпросто показать как охуенно мы могём? ну вот показали. а делать то тут что?\nв чём отличие от обычного интернета? за плохой контент\\критику власти возьмут за яйца так же быстро как в обычном интернете.\nЗОЧЕМ НУЖНО ЭТО ОБЪЯСНИ МНЕ",
				"added": 1457200478
			},
			{
				"comment_id": 4,
				"body": "> [esteban](#comment_27_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Ну вот ты держишь сайтик на телефоне, батарея разрядилась, и всё.\n\nох какой пиздец\nкароч это игрушка для школьников с горящими глазами, дрочащих на всё необычное и хостящих сайты на телефонах\nмне всё ясно",
				"added": 1457200589
			},
			{
				"comment_id": 5,
				"body": "чо тут написано что только 30к могу флудить? старые посты стираются хоть?",
				"added": 1457200656
			},
			{
				"comment_id": 6,
				"body": "> [zeroatom](#comment_5_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Вот тут по подробнее,как и кто....а то хочется правду матку читать а не полуправду :)\n\nчто тебе подробнее\nвсе айпи видны\nвидно кто на раздаче каждого сайта\nпридут к тебе домой и посадят за распространение порочащих путина сведений, а ты и знать не будешь на какой сайте что написано было.\nты же подписан на сайт - сидируешь его обновления. ну и всё, смазывай давай.",
				"added": 1457200815
			},
			{
				"comment_id": 7,
				"body": "> [zeroatom](#comment_6_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF):  и жду популярности \"Блога\" и выпиливаюсь со страны? так получается? :)\n\nнихуя не понял\nчто значит выпиливаешься из страны?",
				"added": 1457200950
			},
			{
				"comment_id": 9,
				"body": "> [zeroatom](#comment_7_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): \nты какой-то странный\nесли ты не навальный - никому не нужен компромат на тебя\nсуть в том что в этом зеронете нет никакого смысла. ты можешь писать хуйню про путина здесь и в обычном интернете одинаково, и это будет одинаково опасно\n\nтак лучше делать это в годном блоге на вордпрессе\\друпале, чем в говносайтиках без ничего",
				"added": 1457201460
			},
			{
				"comment_id": 11,
				"body": "в факе ссылка на создание сайта протухла\nдоставьте плис",
				"added": 1457201935
			},
			{
				"comment_id": 13,
				"body": "> [zeroatom](#comment_8_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): \nразве и2п\\фринет не безопасны на столько чтобы не беспокоится об этом?",
				"added": 1457202762
			},
			{
				"comment_id": 14,
				"body": "> [shift](#comment_124_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7):  новое поколение веба\n\nхостить один и тот же сайт на тысячах компьютерах - это шаг назад, а не новое поколение\nвеб идёт к тому чтобы всё делать онлайн - работать, смотреть котиков, и т.д.\nзеронет же наоборот идёт назад",
				"added": 1457203893
			},
			{
				"comment_id": 15,
				"body": "> [zeroatom](#comment_10_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Как быстро объяснить человеку(Роботяге) что происходит в стране? :)\n\nа ты сам понимаешь что происходит?",
				"added": 1457204499
			},
			{
				"comment_id": 16,
				"body": "> [zeroatom](#comment_11_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Понимаю\n\nну вот когда ты работяге начнёшь пояснять за жизнь - первый вопрос который он тебе задаст - а ты чо умный самый?\nи будет прав\nмного таких как ты, понимающих\nпоследний дебил запутинский - считает что всё понимает",
				"added": 1457204750
			},
			{
				"comment_id": 17,
				"body": "> [ego](#comment_1_1J64mPqPmc4mZwgK18LfGyuUiJKCuRGSgU): Всем привет!\n\nвкратце - зеронет бесполезная хуйня\nнет анонимности, нет контента, нет ничего\nразвлечение для школоты, которые любят всё нитакое как обычно\n\nне трать время",
				"added": 1457205571
			},
			{
				"comment_id": 18,
				"body": "> [nippletwister](#comment_202_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ну по IP тебя вычислят, но вот сайт твой прикрыть сложно\nчото ржу\nа тебе не похуй будет как поживает твой сайт если тебя на зоне пидарасить будут?",
				"added": 1457206641
			},
			{
				"comment_id": 19,
				"body": "> [nippletwister](#comment_203_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): \nи тут ты такой поясняешь мне, глупому, как можно создать нецензурируемую сеть без защиты пользователей\n\nвот тебе ссылочки из википедии:\nЦензу́ра (лат. censura) — контроль власти за содержанием и распространением информации\nесли власть держит за шею людей - то ни о каком отсутствии цензуры речи не идёт\nлюди боятся писать, так как сядут за хуйню",
				"added": 1457207197
			},
			{
				"comment_id": 20,
				"body": "> [nippletwister](#comment_204_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): \nи опять ты про одно и то же\n>Ну по IP тебя вычислят, но вот сайт твой прикрыть сложно, если его куча народа сидирует\n>нелья выпилить его сообщение, не отключив и не пересажав всех пользователей\nа ты готов сесть за какую-нибудь хуйню? ЗАТО ТВОЙ ПОСТ ОСТАНЕТСЯ ЖЕ!\nготов?",
				"added": 1457207635
			},
			{
				"comment_id": 21,
				"body": "> [nippletwister](#comment_204_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf):\nи да, вот ещё цитата, ты похоже совсем юн и не в курсе как работает мир\n\nСуществует также самоцензура — сознательное самоограничение автора в обнародовании информации на основе неких собственных соображений (например морально-нравственных ограничений, внутреннего конформизма), либо из боязни наказания за нарушение цензурных правил[12][13][14]. Самоцензура из соображений конформизма или страха является одним из характерных проявлений деформации гражданского общества[15].",
				"added": 1457207744
			},
			{
				"comment_id": 22,
				"body": "> [zeroatom](#comment_13_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): \nну я могу пояснить за 4 пункт\nраспространять информацию о самоубийствах запрещено\nты сидируешь чужой сайт, где где-то на странице есть такая информация\nтебя привлекают к ответственности\n100% законно",
				"added": 1457207820
			},
			{
				"comment_id": 23,
				"body": "> [nippletwister](#comment_205_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): \nты на вопрос так и не ответил\n>как можно создать нецензурируемую сеть без защиты пользователей\nиначе признай что это цензурируемая сеть",
				"added": 1457207949
			},
			{
				"comment_id": 24,
				"body": "> [zeroatom](#comment_14_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): \nумница\nты понял какое говно этот ваш зеронет",
				"added": 1457207983
			},
			{
				"comment_id": 25,
				"body": "> [nippletwister](#comment_207_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): \nты о чём?\nпогугли как мужика судят за БОГОХУЛЬНЫЕ высказывания, например\nвот прямо сейчас, в россии\nмужик написал в рандомной переписке хуиту про религию\nего таскают по судам, и вероятность обвинения крайне высока\nкаких дел ты ещё хочешь ждать?",
				"added": 1457208169
			},
			{
				"comment_id": 26,
				"body": "> [zeroatom](#comment_15_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): \nпоясни за раздачу сайта\nв чём кайф хранить один сайт у тонны пользователей?\nу меня в простом интернете открывается 99% сайтов\nкакую такую охуительную проблему решает зеронет своим распространением сайтов через п2п?",
				"added": 1457208242
			},
			{
				"comment_id": 27,
				"body": "> [nippletwister](#comment_210_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): @824456783Назови лучшее средство для анонимности.\n\nсначала с прошлой темой разберёмся. нефиг переводить темы\n>Сеть не про то. Не про анонимность, а про распределенность и нецензурируемость\nэта сеть ТОЛЬКО про распределённость.\nтак?",
				"added": 1457208414
			},
			{
				"comment_id": 28,
				"body": "> [zeroatom](#comment_17_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): \nэто тоже бред\nкакая ценная информация?\nкто-то не в курсе про воров у власти?\nпро убийц во главе регионов?\n\nвидео где мэр говорит что перекопает дороги в своём же городе если ему жопу лизать не будут никто не удаляет с ютуба год\n\nлюбая информация распространяется и хранится столько сколько нужно и без п2п\nбыдлу просто похуй",
				"added": 1457208816
			},
			{
				"comment_id": 29,
				"body": "> [nippletwister](#comment_212_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А Зеронет тут причем?\n\nвопрос дискуссии стоит так:\nнахуй нужен зеронет?\nмы пришли к выводу:\nкаждый пользователь берёт ответственность за информацию, которую он смотрит, так как он раздаёт её\nзеронет не обеспечивает анонимность, без неё никто не будет подставлять себя сидируя опасный контент, в том числе и создатель сайта\n\nвывод:\nвсё что нужно есть в обычном интернете\nа зеронет со своим п2п нахуй не нужен, его п2п фича не реализуется никак",
				"added": 1457209088
			},
			{
				"comment_id": 30,
				"body": "> [nippletwister](#comment_213_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ок, обосрать обосрали, предлагать будем?\n\n\"критикуя - предлагай\" - бред просто по определению\nпочему для того чтобы вскрыть и показать вам недостатки зеронета - я должен создать что-то своё?\nкак это связано вообще? никак. не вздумайте отвечать на этот вопрос.",
				"added": 1457209263
			},
			{
				"comment_id": 31,
				"body": "> [zeroatom](#comment_18_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF):\nя не понял что это за пункты и что ты сказать хотел",
				"added": 1457209314
			},
			{
				"comment_id": 32,
				"body": "> [zeroatom](#comment_19_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF):\nнет, нету\nсама его суть, что \"для анонимности пользуйтесь чем-нибудь ещё\" сводит всё на нет\nтак там же я могу и общаться свободно, нахуй мне зеронет тогда?",
				"added": 1457209445
			},
			{
				"comment_id": 33,
				"body": "> [nippletwister](#comment_214_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Зеронет обеспечивает p2p-хранение сайтов\nточно так-же такое хранение и обеспечивает много другого софта, бтсинк например\nда, там нет такого динамического контента, \n\nно давайте определимся, какие сайты нас интересуют\n\n1) динамический контент (борда) - не забываем что анонимности нет, соответственно какой-то информации, которой нет в обычном интернете, там нет\nплюс, какой прок от сайта, владелец которого уехал на парашу?\n\n2) какие-то тексты, вроде рецептов самоубийств и т.д.?\nтор, и2п, фринет, запароленные архивы, миллионы их\n\n\nвывод - зеронет нахуй не нужен",
				"added": 1457209704
			},
			{
				"comment_id": 34,
				"body": "> [zeroatom](#comment_20_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF):\nда господи, и ты за nippletwister повторяешь\nНЕ НУЖНО НИЧЕГО БЛОКИРОВАТЬ\nлюди сами свалят из зеронета после показательной порки пары ХАКИРОВ\nникто не будет рисковать жопой ради раздачи какого-то контента",
				"added": 1457209886
			},
			{
				"comment_id": 35,
				"body": "> [nippletwister](#comment_215_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): \nхоститься будет у тебя на пеке она\nмы же про П2П, ты забыл?",
				"added": 1457209937
			},
			{
				"comment_id": 36,
				"body": "> [nippletwister](#comment_217_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): \nалло, доступ к информации пока не запрещён\nзапрещено распространение\nещё что-нибудь?",
				"added": 1457210068
			},
			{
				"comment_id": 37,
				"body": "> [zeroatom](#comment_21_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Печально. ZeroNet обречен на неудачу? Пару раз по тв покажут как поймали и всё? :)\n\nтебе кажется такое развитие событий неправдоподобным?",
				"added": 1457210218
			},
			{
				"comment_id": 38,
				"body": "> [zeroatom](#comment_22_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): ZeroNet - как сгусток технологий применим или может дополнить другие сети...в чем его основная фишка в раздаче сайтов? :)\n\nименно\nзеронет хорош как демонстрация\nсмотрите - п2п сайты!\nнорм\n\nно заявлять что зеронет - будущее интернета - просто смешно",
				"added": 1457210293
			},
			{
				"comment_id": 39,
				"body": "> [zeroatom](#comment_23_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): безлимитный объем сайтов :)\n\nто есть ты зашёл на сайт - и тебе загружается 500гб содержимого?\nтебе норм такое развитие событий?",
				"added": 1457210467
			},
			{
				"comment_id": 40,
				"body": "> [zeroatom](#comment_24_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Затягивают людей в проект и что дальше? Расчехляйте ваши контентогенераторы и вперед? :)\n\nну есть же чат или форум с разработчиками\nгде-то видел ссылку - тебе туда\nя лучше расчехлю контентогенератор на сайте с миллионами пользователей\nа если я ёбакреативный - то буду ещё и зарабатывать на этом\n\nснова возникает вопрос - так нахуя зеронет то нужен?",
				"added": 1457210863
			},
			{
				"comment_id": 41,
				"body": "> [zeroatom](#comment_25_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): .Где появится инет \nуж точно не в россии",
				"added": 1457211120
			},
			{
				"comment_id": 42,
				"body": "> [nippletwister](#comment_221_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Зеронет сможет работать поверх такой сети. В чем проблема? Создавайте.\n\nа зачем там зеронет будет нужен?",
				"added": 1457211219
			},
			{
				"comment_id": 43,
				"body": "> [nippletwister](#comment_222_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf):  личная инфа принадлежит только тебе\n\np2p?\nна ноль делишь",
				"added": 1457211329
			},
			{
				"comment_id": 44,
				"body": "> [nippletwister](#comment_223_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Оно ж зашифровано.\n\nшто? а как пользователи увидят это если оно зашифровано?",
				"added": 1457211425
			},
			{
				"comment_id": 45,
				"body": "> [zeroatom](#comment_29_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Boinc же вышли из \"нужны бапки\" :)\n\nпотому что не в россии, очевидно же",
				"added": 1457212340
			},
			{
				"comment_id": 46,
				"body": "> [nippletwister](#comment_227_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Кстати, видел тут кто мой блог \nоткрыл рандомную статью\n>Столкновение с игнорированием недоступности майнинга рядовому пользователю\nзакрыл страницу",
				"added": 1457212738
			},
			{
				"comment_id": 47,
				"body": "> [zeroatom](#comment_30_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF):  но какое будущее у неё?\n\nну думай сам \nя логически обосновал тебе что зеронет - по продуманности имеет уровень курсовой работы\nпоказать что можно вот так - и всё",
				"added": 1457213359
			},
			{
				"comment_id": 48,
				"body": "> [nippletwister](#comment_230_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Иначе я бы сюда не пришел. Также с биткоином было\nнихуя себе чсв вывалил",
				"added": 1457213418
			},
			{
				"comment_id": 49,
				"body": "> [nippletwister](#comment_231_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): И кстати, на заметку, любую новую технологию вначале мешают с говном. Это даже, наоборот, должно радовать. Значит разрабы идут верной дорогой.\n\nстатистику плис\nсколько технологий, смешанных с говном, сдохли, а сколько выросли?\nбез этой статистики такие слова - пустой трёп",
				"added": 1457213516
			},
			{
				"comment_id": 50,
				"body": "> [zeroatom](#comment_32_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): \nя же написал тебе - спроси у них сам\nвот я тебе скажу - ОСНОВАНИЙ НЕТ - ты успокоишься разве?\nа nippletwister  прибежит ЕСТЬ ОСНОВАНИЯ, я биткоина купил смотрите - и тебе полегчает сразу или что?\nстранный ты какой-то",
				"added": 1457213679
			},
			{
				"comment_id": 51,
				"body": ">You are running out of your allowed space, please contact the site's admin at shift to raise your limit.\nсорян поцоны\nкурить тут у вас нечего, играть в интернет 2.1 желания нет, зочем нужен зиронет и чем он лучше инторента - непонятно\nв презентации пишут про скорость, юзабилити\nну хуй знает, у меня 99% сайтов открываются отлично, кино качается, игры играются\n\nа серьёзный сайт вы всё равно не построите на зеронете\nпосетите вашу имиджборду - скорость загрузки как у говна, хотя пиров вагоны\nтакие дела",
				"added": 1457214059
			},
			{
				"comment_id": 52,
				"body": ">поясняешь с пруфами 5 часов, тебе никто адекватно ответить не может\n>пришёл пообсирать\nок",
				"added": 1457214214
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 8,
				"body": "30 kb - почему так мало? старые посты удаляются хоть? через сколько?",
				"added": 1457201233
			},
			{
				"comment_id": 10,
				"body": "> [shift](#comment_117_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): если поциент адекватен ему устанавливается повышенный лимит\n\nоу, а определять адекватность будет админ сайта, который может быть тем ещё отбитым долбоёбом, и если ему ты не понравился - ты идёшь нахуй\n\nнайс\nммм, прямо как на оф сайте написано:\n\"open, free, and uncensored\"",
				"added": 1457201673
			},
			{
				"comment_id": 12,
				"body": "> [shift](#comment_119_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Да именно так\nи будет у каждого по борде\nсоответственно все мёртвые\n\nв итоге все так и будут сидеть на самой популярной, подставляя сраку админу самодуру, чтобы он увеличивал им лимит\nкак же мне печёт от этого зеронета",
				"added": 1457202076
			}
		]
	},
	"comment_vote": {}
}