{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1576002321,
			"title": "Does anyone have list of sites on UTOPIA p2p ?",
			"body": "",
			"added": 1576002320
		},
		{
			"topic_id": 1576026161,
			"title": "Alternative ways for hiding IP Adress",
			"body": "ZeroNet is great as it is free open source and completely decentralized but the only problem that it can't solve is anonymity, in official site it all passed to use Tor, but what alternates do you recommend guys if Tor or VPNs or proxies won't work?",
			"added": 1576026159
		},
		{
			"topic_id": 1576322123,
			"title": "Anyone tried lokinet?",
			"body": "Altough lokinet is still on beta mode it seems more secure than zeronet(according to description) unfortunately I have problem with installing it as it does not load .loki pages, anyone had experience with it? https://lokinet.org/",
			"added": 1576322120
		},
		{
			"topic_id": 1576795013,
			"title": "Avoid spammers and disterbing content using MOAB",
			"body": "Just to help newcomers this project is great to avoid spammers and disturbing content on zeronet:\nhttp://127.0.0.1:43110/1LgqZfbtr6dukbjHdjWBEmmthq1shEv3y1/",
			"added": 1576795009
		}
	],
	"topic_vote": {
		"1576434866_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": 1,
		"1576744236_1F46B2S68ECxyvk1394aVDj7689Jjt8ceu": 1,
		"1577103091_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1576002321_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [],
		"1576026161_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 4,
				"body": "did anyone use i2p to access zeronet?",
				"added": 1576026581
			},
			{
				"comment_id": 5,
				"body": "> [lianna](#comment_65_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): If you have a VPS, you could install ZeroNet there and then access it though a browser so all traffic/storage happens on the VPS instead of your computer. Check the documentation on what to put in the configuration file. [...]\n\nthank you lianna, unfortunately VPS is not available as well, what can we do to push i2p support?",
				"added": 1576027834
			},
			{
				"comment_id": 6,
				"body": "> [selfsigned](#comment_2_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): Is this question purely theoretical? Did you face the problem?\n\nit is not theoretical, this is a problem that i am trying to help Persian people with.",
				"added": 1576029098
			},
			{
				"comment_id": 7,
				"body": "> [mmtech](#comment_5_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP): Thank you for helping Persian people\n\nwe r all as one",
				"added": 1576030878
			},
			{
				"comment_id": 9,
				"body": "> [shareduser](#comment_9_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R): There was a proxy on i2p for ZeroNet. That means it is possible to browse ZN with i2p. However, I have not heard about using i2p for ZN in way like tor is used.\n\nty i read more about i2p and found out that it also has the same problem(visible IPs for everyone) so it would not help",
				"added": 1576187399
			}
		],
		"1576322123_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 10,
				"body": "> [lianna](#comment_78_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): I was able to set up a hidden service without paying any crypto, so I don't know what part of the documentation you got stuck on.\n\ndid you install on Linux as guide?",
				"added": 1576339204
			},
			{
				"comment_id": 11,
				"body": "> [lianna](#comment_79_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): I followed the guide here to install and here to set up a hidden service on my VPS. [...]\n\nty i spoke with one in their team seams the problem that i have is a bug for 64-bit systems they soon will have a big release: https://loki.network/2019/12/12/nimble-nerthus/",
				"added": 1576349707
			}
		],
		"1576429351_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 12,
				"body": "i think this may help you:http://127.0.0.1:43110/gitcenter.bit/guide/",
				"added": 1576435660
			}
		],
		"1576434866_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj": [
			{
				"comment_id": 13,
				"body": "none of the links inside the page works for me (no peers)",
				"added": 1576454142
			}
		],
		"1576795013_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 14,
				"body": "> [fke13](#comment_64_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): MOAB --- Mother of All Bombs?Is there any particular reason, why I should apply a censorship filter from some un-authenticated 3. party on my ZeroNet  server that I want to use for reading material that tends to get censored on the plain web?  I'm sure the troll-offices of various countries and \"psychological operations\" and \"strategic communication\" offices kindly offer censorship lists.\n\nyou can choose what you want to see, i myself don't like cp and some spam comments , the list of blocked pages & people are clear , and the name is just a joke reading mother of All Block-lists ;)",
				"added": 1576876928
			},
			{
				"comment_id": 15,
				"body": "> [fke13](#comment_65_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): If You apply 3. party blocklist, then You self do not choose, what You avoid. The issue is very much similar to representative democracy and delegation of voting in general: the moment a person delegates voting to someone else, that power tends to get abused or just mis-used due to stupidity. The solution here is to develop some integrated block-plugin to ZeroNet node so that people can \"collect blocklist entries\" the same way people collect bookmarks to their web browser.\n\ni read the list myself then applied, it gave me what i wanted",
				"added": 1576892577
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_1474_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'll take your feedback.\n\nmaybe it would be a good idea to add a single bottom for every site or person so people can add or remove whoever they want",
				"added": 1577202594
			},
			{
				"comment_id": 17,
				"body": "> [falconixx](#comment_16_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu): maybe it would be a good idea to add a single bottom for every site or person so people can add or remove whoever they want\n\noops that was a type error i meant button",
				"added": 1577221436
			},
			{
				"comment_id": 18,
				"body": "> [styromaniac](#comment_1477_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I don't know how to do that. The best we can do is you guys give feedback and then maybe I'll have a more agreeable list with your input.\n\nthe other way could be asking help on the code",
				"added": 1577221627
			},
			{
				"comment_id": 19,
				"body": "> [styromaniac](#comment_1478_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I understood you. You can edit your posts. ✏️ is hidden to the left of and just below your username.\n\nty buddy i knew that just didn't pay enough attention to the dictation, otherwise i normally edit it.",
				"added": 1577222098
			}
		]
	},
	"comment_vote": {
		"1461_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": 1,
		"1467_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1478_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}