{
	"posts": [
		{
			"id": "0df802b6-88ca-46a6-b332-e33f38d794f8",
			"directory": "users/1F4Ed2JCo7ffcFFFREMtKFrtSonFL381bp",
			"uri": "infinity",
			"thread": "bc558053-3654-4bee-9fef-b356028acd6b",
			"body": ">I2P\nI2P is a general purpose anonymizing network. I2P does not provide anything new for the websites. In terms of websites, it's more or less like Tor: client-server model, non-distributed. You can use common engines, common web servers (apache, nginx), common programming languages (php, python, perl, java). So, a website in I2P is a usual website on the Internet, just as in Tor.\nI2P does provide some cool routing stuff and peer discovery, but only if you write your own application which utilize it (e.g. Bittorrent client, not a website).\n\nPros:\n* The I2P framework provides more generic transport than Tor. Could be used for literally any type of application.\n* The I2P framework provides cool stuff for traffic tunneling, finding peers and so on\n* Cool built-in applications (torrent client)\n* Cool third-party applications (distributed email client, ed2k client, distributed forums)\n* Cool official services (mail.i2p, IRC, git hosting)\n* Provides anonymity\n* You can configure anonymity level if you want, in favor of speed\n* For website, any existing web framework and software could be used, no (or almost no) modification needed (like in Tor).\n* Has a very flexible overall configuration and tunnel configuration in particular. You can configure hop count, different tunnels for different websites.\n* Could be used for UDP (unreliable/lossy transport) for VoIP etc.\n\nCons:\n* FROM SLOW TO HELLA SLOW\n* Java router (official i2p router from the website) consumes CPU a lot\n* Does not provide any out-of-the-box benefits for the websites\n* (not an I2P fault, but anyway) a few people, a few resources. It used to be much, much better.\n\nTL;DR: I2P is an overlay network, and not a framework for distributed websites, although technically you can create one with I2P, but that won't be a generic \"website\".\n\n>ZeroNet\nZeroNet is a decentralized censorship-resistant network, which provides a framework for dynamic websites. This framework consists of standardized file structure, file synchronization primitives, digital signatures, database functions, different internal functions available from within the website's javascript code etc. It's designed to be used from the web browser and does not provide much functions for non-web-browser code.\nGenerally it is designed for dynamic web sites, but could be extended further, for example, there's a zite for video streaming here, which requires additional ZeroNet plugin which extends original protocol.\nZeroNet does not provide generic networking (TCP/IP) layer. You can't use or host common services over ZeroNet. No generic websites, no generic services like IRC or VoIP. Only custom (web) applications.\n\nPros:\n* User-friendly, good-looking\n* Fast (both the daemon and the network communications)\n* Cool and good-looking official services (ZeroMail, ZeroTalk, ZeroMe, ZeroBlog)\n* Cool third-party services (ZeroVoat, defunct ZeroMedium, ZeroLSTN, Kopykate)\n* Lots of interesting technical ideas and implementations\n* Distributed dynamic websites, not only administrator but the users can alter website contents\n* Standardized differentiation of the data from the code, which lead to amazing things like a global search in all downloaded websites or a personal RSS-like feed\n* The zite can survive administrator's death (http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:45)\n\nCons\n* No common web engines could be used\n* Many established web practices could not be used out of the box or at all\n* Browser + javascript is a requirement\n* Does not provide anonymity (although supports Tor, incl. \"Tor only\" mode)\n\nTL;DR: ZeroNet is a framework for DYNAMIC DISTRIBUTED web sites, not a generic overlay network.\n\nFrom all the competitors which more or less aim for dynamic/distrubuted web sites (Maelstrom, dat, IPFS), ZeroNet is the leader in terms of software polish and features provided. It could be used right now, it works and it' fast and good looking.\n\nOverall TL;DR for stupid: If you have usual clearnet/Tor/I2P website, it's easy to mirror it into clearnet/Tor/I2P. It's hosted on your server. It won't survive shutdown/seizing/server problems. If you have ZeroNet website, you can't easily mirror it into Clearnet/Tor/I2P, but it's hosted on computers of users of this website, and will survive shutdown. In fact, you don't need a server at all.",
			"time": 1565725333428,
			"files": "[]",
			"last_edited": 1565726268477,
			"subject": null,
			"capcode": null
		},
		{
			"id": "9bf554b8-608d-4dd5-a6d1-5f96410090bd",
			"directory": "users/1H5YxVHvcfKM4STjJwyjYaBe8qbPyR6EZr",
			"uri": "b",
			"thread": "8bdeea16-5e37-4f13-b7ec-90614bbfdf10",
			"body": "Yeah looks pretty cool.",
			"time": 1565726007477,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}