{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Comprendre la vision geo-strategique de l'état francais?",
			"body": "Voila, je me pose une petite question simple : c'est quoi la vision geostrategique de l'état francais?\n\n1. je n'utilise plus le mot \"france\" pour décrire l'état francais. Je pense que c'est une erreur sémantique importante. En effet cet \"état\" ou \"république\" est plus proche d'une imposture, force d'occupation, que issue du, par et pour le peuple francais.\n\n2. on voit que le président de l'état francais, n'a plus que la liberté de \"fermer\" l'ENA. C'est-à-dire qu'il est soumis à une autre autorité. Ma question n'est pas forcement de savoir laquelle, autrement elle aurait affiché son propre étendard, mais plus qu'elle est la politique international poursuivie par cette entité.\n\n3. on voit que l'état francais essaye beaucoup d'imposer aux autres nations la politique de cette entité. Exemple avec la CEDH, leur grand texte fondateur, texte de merde, pleins d'exceptions ou ni la liberté d'expression ou le droit de disposer unilatéralement et totalement de son propre corps y est défendu. Egalement visible par exemple dans la guerre contre la nourriture des plantes (CO2). Aussi avec l'ambition d'harmonisation fiscale mondiale.\n\nA mon avis, cet état se sert lui meme, c'est-à-dire qu'en realité c'est un systeme feodalists, avec une nature transiente de ses servants. Et vus qu'il est en échec interne et international, il essaie de répendre ses erreurs aux autres nations par le truchement de ces organisations internationales. Peut-être reflection de sa faiblesse, interne et externe?\n\nLe plus triste ou amusant, c'est a quel point, je n'ai aucun espoir pour une amélioration de l'état des choses en france. je me demande comment et en quoi l'idéologie geostrategique poursuivi nuit en réalité à la france.\n\npour résumer un culte de l'union europeene, dans le but d'y transferer progressivement l'ensemble des compétence de l'état francais. deuxièment un culte a propos de l'ONU et specialement du conseil de sécurité (ou la position de la france ridiculise cette organisme que je ne supporte pas). Et enfin, a mon avis, une ambition colonialiste, dans le sens, que vus l'état d'echec de cet état, au lieu de se reformer, il cherche a propager son ineptitude au monde, peut etre dans l'espoir d'apparaitre mon desuet, anachronique et incompetent.\n\nEnfin je me demande pour quoi cette haine envers l'amerique dite originaliste? A mon avis, c'est l'individualisme qui pose probleme à l'état francais, dans le sens que les serfs ne doivent pas imaginer aller brouter ailleurs.\n\nau fond cela n'a pas beaucoup d'importance, dans le sens que cette abomination, à mon avis, n'est pas perenne et encore moins soutenable... \n\nqui y croit encore à l'état francais? meme ceux qui en profitent ou sont payés par lui, n'y croivent plus....",
			"added": 1617941856
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}