{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1569438506_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 1,
				"body": "Well, she's obviously a Rothschild shill, since sailing around on a Rothschild boat is supposed to prove that we're all filthy goyim who need to just cuck harder.",
				"added": 1573429782
			},
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_9_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): even if it were true, it has no impact on things she is pointing out. Climate is changing, it is evident and we have to be prepared\n\nIt has every impact, brainlet. It's time you stopped listening to a handful of international jew bankers ordering you what to believe. These creatures need to be STOPPED, not listened to. The handful of media dictators must be stopped, along with their control of governments and universities. That is the only political issue of relevance. Even if we manage to defeat this measure, there will be more and more as long as they are in power.\n\nEvery law they pass will have riders on it, and this issue in particular is one of many where these global banker DICTATORS are seizing power over the world. Many countries in the world have been razed by these people. They have killed HUNDREDS of MILLIONS in their quest for world control. Every time the US goes and bombs some country and commits mass murders, it is at THEIR behest.\n\nFucking BRAINLET. You don't GET to point things out except in places like this that they will destroy, shut down, throttle, shadowban, and shill into oblivion as soon as it becomes relevant. Get a clue. Every clearnet platform has been made NOT a platform because that's what they wanted. I can't wait for the rider that we can't think independent thoughts because muh climate.\n\nThe climate didn't matter when they firebombed all of Europe--shit could sure be toasty then. I'll bet you never even questioned it.",
				"added": 1574658029
			}
		],
		"1546079712_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 2,
				"body": "It's not surprising that jews constantly do things to try to assert total control over everyone else.",
				"added": 1573429916
			}
		],
		"1574192583_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 3,
				"body": ">juden peterstein\nSomebody doesn't know what controlled opposition is, but Le Good jew (tm) with commie posters at home, a jew wife at home, and someone who is a millionaire from working at the UN for the rottenchilds is NOT your friend.\n\nOf COURSE controlled opposition is allowed to speak when he condemns White people as \"nazis\" like the scumfuck he is. I hope all controlled opposition dies in a fire. They are worse than the enemy.",
				"added": 1574655792
			}
		],
		"1572463705_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 4,
				"body": ">da hoaloacuoast\n>facts\nLel",
				"added": 1574657687
			}
		]
	},
	"comment_vote": {
		"1_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"5_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1
	}
}