{
	"title": "1024记录",
	"description": "1024diary，文章主要转摘自1024论坛。http://127.0.0.1:43110/1024diary.bit\nhttp://127.0.0.1:43110/1024.yo",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 79,
	"demo": false,
	"modified": 1571619030,
	"post": [
		{
			"post_id": 78,
			"title": "端传媒 | 内地生笔记：中大校长对话场内外，与那篇让内地生激愤的人民日报评论",
			"date_published": 1571618999.314,
			"body": "原文连接：[https://theinitium.com/article/20191018-notes-meeting-with-principal/](https://theinitium.com/article/20191018-notes-meeting-with-principal/)\n\n9月开学以来，香港中文大学校园里随处可见的文宣海报，周会上一个个黄色蓝色白色的头盔，晚上10点准时喊起来的被内地生误听为“功夫烧烤，士多啤梨”的“光复香港，时代革命”口号，不停收到的港铁停运、学校餐厅提早关闭的消息，Facebook论坛和内地生树洞平台上激烈的中港矛盾争论，这一切都在提醒你，我们在经历不“正常”的校园生活。甚至，作为内地生的我们开始悄咪咪地互相试探，通过稍稍透露立场的朋友圈下的点赞和评论，朋友给哪篇文章点的“在看”，彼此在交流中的用词，在心中默默划分黄蓝阵营。若是嗅到立场不同，我们就心照不宣地不聊政治，只谈风月。\n\n这个夏天在香港发生的社会运动，像一双手，不断地把政治、身份认同、中港矛盾这些议题推到内地生面前，再怎么想过小确幸的生活，都必须要直视和面对这现实。朋友圈里关于政治的信息和情绪越来越多，即使在暑假错过了付国豪机场事件“SHAME ON HK”的刷屏，10月10日的校长对话也给了内地生一个表达的机会。不过，据笔者观察，这次的朋友圈刷屏并没有出现在对话会当天，而是在次日深夜，人民日报的文章发表之后。\n\n**与校长对话，普通话的发言**\n\n10月10日下午，中大校长段崇智再次会见学生，邵逸夫堂坐满了学生和校友，我与朋友戴着口罩入场，有点恍惚，不知道黑色的海洋会怎么看待我们。我在较前排的位置落座，身边的本地同学聚集成一个小组，把拿到的筹号摆在一起，我立刻就明白他们是选好了发言人，其他人都把筹号投入箱中，增加被抽中发言的概率。我和朋友知道有传媒直播，担忧曝光，仅在书面意见上写下了“如何构建本地生和内地生之间的对话平台、学校有什么措施保障支持香港运动的内地生的言论自由”等问题，投入箱中，把现场发言的筹号给了隔壁的香港同学，他们说“我们又有枪了”。\n\n最开始的校长简短发言，数次被激动的香港同学打断，校长被激光笔照射。提及校园环境被破坏、因不同政见而起的校园霸凌时，在后排本地同学的嘘声和愤怒的喊声中，左边的区域响起了激烈的掌声，我才发现左边坐着很多像是内地研究生的同学。在第一位用普通话的女生发言时，左前的区域也表现得十分支持。这位女生发言时，一字一顿地说她希望本地同学尊重她的言论自由，说自己和身边同学因为本地学生“打压”不同政见的内地生而感到恐惧，最后看着台下说出了引起最大声浪的“正是你们自己在破坏香港的法治、自由、民主”。\n\n本地同学听到普通话发言之时，就表现得有些情绪激昂，在这位女生的讲话逐渐显露立场时爆发了巨大的愤怒，本地学生激动地叫喊着“返大陆啦”、“NMSL”，还有人用普通话叫着“平反六四”，数次打断她。我的一个同学坐在后排，是个支持香港运动的内地生，她说，她觉得耳朵都快要被这种带有仇恨的言论喊聋了。虽然明白香港人的愤怒，也知道在这个时候本地同学不会考虑到有部分内地生也是支持他们的，但那种群情激愤地对内地生集体的辱骂，还是让她感到极大的压力和不舒服。她说她突然觉得自己是少数人里面的少数人，在内地生里支持香港是少数，在香港同学面前，那一晚又感到了自己是一名还没被接纳的少数派。在内地生里，可能因为无需顾忌强权的审查，激进表达民族主义情绪的人声音高，充斥公共讨论空间，内地生的形象总是和激进爱国派联系在一起。同样，叫喊得最大声、最难听的香港同学的声音总是被捕捉来标记“香港学生”。\n\n我坐在前排，周围的香港同学非常冷静，甚至对后排叫喊的本地生有些生气，在那位女生发言之时，他们高举“停止”的手势，希望他们快点停下辱骂和叫喊，后来“讨伐”的声浪似乎已经无法控制，他们便放弃了，沉默着。那位发言的内地女生在发言后就匆匆离开了，那一片的内地生似也离开了。他们没能听到最后，令人想哭的控诉性暴力的发言，错过了那个理解香港同学绝望的机会，也没能听到本地同学的道歉。之前坐在我身旁的一个香港男生，高高瘦瘦，头发在后面扎成髻，发言时说他觉得他们做了很“丑怪”（丢脸）的事情，本地学生完全没有表现出对不同意见发言者的尊重。\n\n对话会临近尾声，又有一个男生用普通话发言，但他赢得了本地学生的掌声。他开头便说，香港同学不要忘记，在内地也有一群在争取民主自由的人。我想这是一个主动沟通的态度，他表示出对本地同学的尊重和理解，主动拉近了跟情绪激动的本地生的距离。\n\n无论是之后的闭门会谈，还是其他同学的发言，都没有出现在内地媒体的报导里。环球时报在当晚20:54分，对话会还没结束之时，便迅速发布了第一位普通话发言的女生的报导，不久后，这位女生接受了环球时报的专访。\n\n内地女生的发言和对性暴力的控诉，都没在内地本科生的圈子里引起太大的回响（据笔者观察，当天亲身来到对话会、看对话会直播和关注对话会信息的内地本科生还是少数）。引爆舆论导火线的是人民日报的一篇“常规”文章。\n\n**人民日报与孤立的在港内地生**\n\n隔天深夜，人民日报以这次对话会为主题，发文质问[《“博文约礼”，港中大学生做到了吗？》](https://news.ifeng.com/c/7qh7dLvd2oe)，短短几分钟后就在我的微信群组和朋友圈中激起强烈反响。在一个为庆祝七十周年国庆而设的内地生群组中，对官方媒体的愤怒迅速蔓延：“人民日报胡扯啥呢”、“人民日报现在说话越来越口无遮拦了”、“这是变成喷子的走向吗”，类似的负面评价在朋友圈也不绝于耳。审视这些留言，情绪被点燃的原因无非是人民日报以偏概全，字里行间俨然将批评的对象覆盖至所有中大学生，并认可了香港中文大学已成“香港暴徒大学”的说法。\n\n当“暴徒”的帽子冠到自己头上，有些内地生开始发声斥责。但我们又醒了几成呢？这冲击能否带领我们走出成见、增加我们了解和试图理解香港的意愿呢？\n\n我见到一些原本政治冷感或反对示威的朋友，开始反思香港人的诉求，以至追溯运动的全貌。一位从前非常不理解反修例运动的内地生朋友发来信息，当她看到内地媒体只在一味谴责对话会中的学生，而对其中的性暴力指控轻描淡写乃至加以嘲讽时，她好像终于能理解香港一二。有朋友看到校长的冷漠和学生的弱小愤怒，对这场运动的感觉和以前相比，“有点不一样了”。\n\n但可惜的是，这些人似乎还是少数。很多人似乎只关心自己是否被污名化，自己的学历是否还能保值，自己未来的工作是否受到影响。“自己、自己、自己”，仿佛只有在社会时事与“自己”密切相关时，我才能听见内地生群体的声音。8月13日机场付国豪事件发生时，朋友圈充盈满屏的红底白字“我支持香港警察，你们可以打我了”；10月1日挂国旗的内地生被霸凌后撰文详述过程，朋友圈纷纷转载，一时间眼里都是国旗红。而反观使无数港人彻夜难眠的721和831夜晚，却从未在我的朋友圈激起几滴水花。也许是因为大家都是明白人，知道说什么话会带来危险，而选择噤声，也许是真的不关心、不了解。\n\n刚入学的大一学妹和我说，她身边不少人都很后悔来香港读书，感觉学历贬值。内地生的树洞平台上，很多人透露来香港读书的原因是中大的排名和国际化的教育，将高考分数最大化利用。其实我来香港读书的原因也类似，我想应该很少人会将香港民主自由的言论和学术氛围放在首要的考虑因素。\n\n但这个夏天，在港呆了几年的我，时常为曾经的自己和一些内地生感到些许遗憾，如果能早一点、多一点了解这个城市就好了。话说白了，其实内地生没有必须要了解香港、关心香港命运的义务，本地同学也没有照顾内地生情绪的义务，但人不止于完成义务。面对历史，我们有见证和担当的责任。\n\n除了担忧学校的招牌和学历的含金量之外，众人愤怒的留言中也透出几分“弃子”的凄凉。他们中的大多数并不支持反修例运动，却在此时被人民日报反推向“暴徒”一方。微博的最高赞评论嘲笑着“香港这些憨批大学，一个个都在诠释书念到狗肚子里”，再往下滑，数百条评论均来自在港内地生，他们努力澄清着香港中文大学的学生不等于废青，批评人民日报不够客观公正，却也同时被不少大陆网民攻击。于是有人感慨自己“里外不是人”，有人感慨自己“沦为牺牲品”，更有甚者选择以“政治类不实信息”原因投诉该篇文章，或通过人脉网络以求人民日报发出道歉声明或撤回文章。\n\n**我们与他们，鸿沟的弥合**\n\n在内地的舆论场，这件事不过为香港年轻人是“暴徒”、“废青”的论述提供了新理据，我相信香港人早已习以为常也并不在乎。但对于内地生来说，这或许是第一次被官媒代表和点名批评。人民日报这篇文章似乎是一个拳头，将许多人砸得晕头转向；又似乎是一阵风，飘过不留痕，愤恨过后，仍然会激进地爱国爱党，仍然对示威者义愤填膺；又或者，这是一粒种子，在他们心中已埋下不信任的根，只等待着更多的灌溉。\n\n随着大陆与香港的舆论日渐对立，在港内地生似乎必须在漂泊中寻觅一个容身的空间。政治表达和参与上，我们还是新手，对民族主义有依附和敬畏，对香港的陌生又不断滋生着恐惧和犹疑。意识形态是一种选择，但人与人之间的距离本不应因为意识形态的不同，塑造成为无法跨越的鸿沟。\n\n“我们与他们”是Zygmunt Bauman著作《Thinking Sociologically》的一个章节，他说，“我们”与“他们”不仅是两种不同的群体，而且区分了两种截然不同的态度：喜欢与讨厌、信任与怀疑、安全与恐惧、合作与对立。因为人与人的差异和区隔出现了“连续性中断”，我们把人分为两类，感同身受的同理心和同情心在另一个群体身上减弱，也因为只有模糊和残缺的印象，我们会倾向于怀疑他们、恐惧他们。我们甚至期待他们处处和我们作对，因为外群是内群虚构的负面自我，为了建立自我认同，为了内部团结和心理安全，我们需要这个负面形象。\n\n对内地生和本地生来说，也许这样的对立都是在想像里建构的“我们”和“他们”。如果真诚地面对面交流，坐下来聊聊，也许我们可以去弥合这人为的鸿沟。那些形象模糊的黑衣人会变得立体起来，他们不再只拥有一个扁平的“废青”、“暴徒”标签，他们可能是全副武装的前线示威者，也可能是一个被副校长揽着哭的男同学；那些被贴上“五毛”、“小粉红”标签的咄咄逼人的内地生，也许有一天会说“想要帮上香港的忙”。事实上，我看见有内地生耐心看完校长见面会的直播，开始理解香港，也有本地同学主动和内地同学介绍香港。当校长段崇智经过闭门对话后，都能瞬间从“段狗”变成“段爸”，内地生和本地生的差异，或许没有想像中那么大。\n\n当政治主动来敲门，避无可避，人民日报这一篇备受争议的时评，也许意外地成为推动内地生与本地生交流的契机。或者说，其实整个反修例运动，都是一个彼此交流的机会，因为它让几乎每个人开始思考政治，这也是一场我们正在经历着的、需要很多思考和选择的成长试炼。无论最终选择什么方向，这场运动都是我们绕不开的坎。\n\n这本书里还说了，“鼓吹共同体概念的团体，不论势力多么庞大，不论多么努力，它们对真实的掌控，仍不免脆弱和不堪一击”。一场对话会，几篇官媒文章，我们亲眼目睹发生了什么，我们的同学在控诉什么，我们校长的态度是什么，我们的国家是怎么想我们的，这种真实的力量是不容忽视的。"
		},
		{
			"post_id": 77,
			"title": "乡村教师李田田：一群正被毁掉的乡村孩子​",
			"date_published": 1571618926.967,
			"body": "编辑注：日前发表在乡村教师李田田在她个人微信公众号“山花诗田”上发表了《一群正被毁掉的乡村孩子​》，文章当天就被删除，李田田本人被当地教育局领导连夜要求进城谈话。据报道，李田田现在任教课程减半，外出需要向领导汇报（详见本文后附上的“红星新闻”报道）。\n\n写下这篇文章时，内心是痛苦的。我已多年不写杂文，致力于诗歌、童话小说的创作。然而最近的诸多事，促使我不得不奋笔疾书。当然，毫无权势的我也只能用文字发发牢骚，终究是一个文人的可悲之举。\n\n而我，只想为那群乡村孩子说些话，只想挽留身为教师的一丝尊严，只想在这个浮华的时代，保留最后的理想情怀。长话短说，愿我的我真诚发言，不会把我推向黑夜；愿我明天醒来，还能看见光明。\n\n2016年9月，我被县教育局分到这所山村学校教书。工作几年，让我见识到了乡村学校的落后与不堪，体制的虚伪与浮夸之风。不止是我所在的学校，同县的乡村学校皆是如此。\n\n学校极缺老师，每个人的工作量都很大，比如我教两个班的语文兼班主任工作，抽空还得帮学校写通讯稿。学校也无音乐或美术老师，课程单一，不及我童年。最令我痛心而无奈的是：身为老师，我们教导学生要品行端正、诚实守信，自己却不敢说真话，不能说真话。我们个个接受过高等教育，可我们却成了被奴役的知识分子，小心翼翼地活着。即使心有不甘，也只能默默忍受，因为我扪的身后是一层层的上级领导，他扪谁都有权力让一个乡村老师丟了饭碗。\n\n你问我说真话，会怕吗？我也怕。有同事好心提醒我，要政治觉悟高，忍忍算了吧。可我拿着国家的工资，享受国家给予的优惠政策，面对那一群群信任我的学生，无法再装模作样地快乐工作。我读的书，我接受的文化熏陶，使我没法继续当一个哑巴。\n\n哎，反正人都是会死的，都会化为灰烬，生命何其短暂，与其忍受精神痛苦，不如痛快地活—回。\n\n什么是政治觉悟高？随波逐流、迎合领导、成为形式主义的帮凶，就是觉悟高吗？如果是，那我承认自己的平庸和目光短浅。\n\n开学以来，学校几乎每周都有检查，隔两天，我们就要带学生大扫除。停课扫地是常有的事，我的语文课已停滞不前。有时甚至得提前两三天扫地，扫来扫去，治标不治本，检查一过，学生的行为习惯仍是老样子。另外，老师还得走访扶贫，我身上就有五户贫困户，得时常与他们联系。这不，本周末老师们又要下队走访，算老百姓收入，搜集整理信息，填写各种资料。有几次，检查应急，我们老师不得不停课去政府加班，让教室空堂。\n\n我们把那400多个学生置于何地？把教育置于何地？大晚上开紧急会议，不是探讨孩子教育，竟是商量如何扫地，通过检查。说实话，学校天天扫，真有那么脏吗？自开学来干旱缺水，最后得出的办法一一让学生用抹布一点点擦地板。学生扫地劳动，没错，可一天三四次，真的有必要吗？为什么反复扫，卫生质量依旧不高，就没有去思考过问题症结吗？可笑的是，还让班主任没事就去清洁区、垃圾桶多转转！\n\n为什么要把那么多时间耗费在扫地上？因为你们要来光顾学校——所谓的上级领导。区检、县检、州检、省检、国检接踵而来，班主任大清早带学生扫地，其他老师忙着准备迎检资料，或要完成上级布置的各类表册。你们来了，就真的看见真实了吗？资料造得好，就是脱贫、就是教育搞得好？\n\n基层老师苦不堪言，加班至深夜两三点，还有多少精力奉献给学生？若我们不服从，若扶贫出了纰漏，没及时记住贫困户的收入信息，就要处分我们。可是，我们老师真的错了吗？我们是教书育人的知识分子，肩负着祖国的未来，为何要沦落成杈势的工具？为何不能让我们安心地教育、施展各自的所学专长？\n\n乡下校长也是无奈的，而今又有几个校长，能有时间关心学校的教育发展？卫生搞好了，资料完善了，扶贫到位了，年终学校等级不落后，就是皆大欢喜了。\n\n可那么多孩子，多是留守儿童，他们的教育还停留在十几年前，他们已输在了起跑线上！一级级的领导马不停蹄地光顾学校，你们的到来，真的有益于学校吗？你们来了，以高姿态提点意见，无非是加重了基层的形式主义工作。你们所谓的检査，又真的有效吗？你们的光临，反而害了孩子，让他们学会了在权势面前低头、要弄虚作假。\n\n我认为需要反思的不是我们基层老师，我们兢兢战战地工作，像保姆一样守着这群留守孩子。需要反思的是你们上级领导，不如多为学校做些实事吧！\n\n如果你们是觉者，我尊敬你们，向你们学习；如果你们是魔鬼，我将鉴别你们，弃你们而去。\n\n此刻，窗外下着暴雨，乡村的夜晚漆黑一片。希望一位普通的乡村老师、一个手无缚鸡之力的女子，今夜没有得罪任何人。\n\n明天，我们又要为下周的检查做准备。明天，我们哪怕停课，也要大扫除、清理卫生死角。明天，哪怕我们心有不甘，也要下队走访，清算老百姓的收入，填写扶贫资料。明天，谁来真正关心那群孩子的教育？\n\n但愿我们这样活着，不是浪费生命，亵渎灵魂，是有意义的！但愿我，不会因为社会的现实，而变得麻木不仁！\n\n————————————————————\n\n附：红星新闻 | 发批评文章的女教师李田田：任教课程减半、外出需向领导汇报\n\n近日，25岁湘西女教师因发批评文章备受社会关注。\n\n10月16日下午，李田田告诉红星新闻记者，湘西州委领导已来学校约谈，并承诺会整顿永顺乡村教育现状，少些形式检查。\n\n18日下午5时，湖南永顺县沙坝镇，桃子溪小学大门紧闭，学生们已放学回家。透过门卫处，可以看到校道尽头还有不少男生在篮球场上打球，四周矗立着教学楼、教师宿舍和学生宿舍。\n\n校门外，红星新闻记者见到了长发及腰，穿着一身纱裙的乡村教师李田田。她耳尖挂着湘西土家族特色耳饰，脸蛋红扑扑。继10月中旬批评文章发表后，**她所任教的课程减半，外出行程需向领导汇报。**她说，她怎么也没想到，这段时间竟成了她目前教学生涯里最轻松又倍感压力的一段时间。\n\n在与这位25岁姑娘的交谈中，红星新闻记者了解到，她出生在湖南湘西土家族苗族自治州永顺县的一个偏僻小寨，父亲在她4岁时过世，家里的重担便落在母亲一人身上。由于家境贫困，加上弟弟也要继续学业，她在初中毕业后选择去了湖南第一师范学院读定向免费师范生，2016年毕业后被分配至桃子溪小学任教至今。\n\n在问及三年的教学生涯是否辛苦时，她答道：“我喜欢教书，所以不觉得辛苦，辛苦的是其他的，是那些没用的检查。”\n\n据李田田此前发表的文章内容，教学期间频繁有上级前来检查卫生，严重影响教学进度。她表示，自开学以来，学校几乎每周都有检查，“隔两天，我们就要带学生大扫除。停课扫地是常有的事，我的语文课已停滞不前。”\n\n文章发表后，李田田表示没想到会引起如此大的轰动，心情十分复杂、难以平息，也给她原本的生活带来不小压力。她讲述，近几日，校领导规定，凡来校的朋友须在门卫处登记，她的外出行程也被要求向校领导如实汇报。“我见朋友只能在校外见，不能带进学校，我去哪个地方干什么也要告诉他们，现在我的压力真的很大。”\n\n除了生活上的改变，李田田的教学任务也由原来两个班的语文教学兼一个班的班主任变成了现在一个班的语文教学兼班主任，“文章发出来后，我的任教课程减半，这是我目前课最少的阶段。”\n\n红星新闻记者随后询问了李田田的一位学生。这位学生表示，李田田曾在天热的时候给全班51位学生买饮料；曾为学生添置几十本课外读物。“最开心的是和田田老师一起在晚上看月亮和星星，同学们一起玩丢手绢，我不喜欢语文，但是我喜欢田田老师上的语文课。”\n\n李田田告诉红星新闻记者，确实给孩子们买了书，多为哈利波特、恐龙科普等，总共花了两千多元。\n\n有学生家长告诉红星新闻记者，李田田的文章也被家长转发至家长群，不少家长给予支持态度：“感谢老师，孩子们和家长都支持你”“敢直言的老师应该得到尊重”。\n\n![](https://chinadigitaltimes.net/chinese/files/2019/10/Screen-Shot-2019-10-19-at-11.21.29-PM-e1571541724103.png)\n\n李田田在听到学生、家长对她的喜爱和鼓励后，表示很感动。她一开始觉得自己被孤立，虽然同事没有为难，学校没有处分，但感觉大家有疏远。现在看到网友、家长和学生都在帮助和支持她，她真的很谢谢他们。\n\n对于现在是不是后悔当初发那篇文章，李田田说：“不后悔，发了就没什么后悔的。”\n\n对于现在最大的期望，李田田称，现在压力有点大，只想回归正常人的生活。"
		},
		{
			"post_id": 76,
			"title": "微博 | 人大教授向松祚：关于当前经济形势的几点感想（已删除）",
			"date_published": 1571025042.409,
			"body": "CDT编辑注：[向松祚](https://chinadigitaltimes.net/chinese/tag/%e5%90%91%e6%9d%be%e7%a5%9a/ \"Posts tagged with 向松祚\")，经济学家，中国人民大学财政金融学院教授，国际货币研究所理事兼副所长。本文已在微博和微信被河蟹。\n\n按照官方公布的数据，三季度GDP增速下滑到6%，四季度恐怕要跌破6%。明年肯定进入5%时代。如果看企业利润，财政收入等其他指标，GDP增速似乎加不起来，显然高估了。财政收入和企业利润多数地区都是负增长。全国税收收入前三季度也是负增长。GDP怎么可能增长6%?到地方调研座谈，有地方政府官员坦诚他们地区是负增长。\n\n现在还说稳中有进，稳中向好。似乎与事实不符啊。\n\n即使按照官方数据，今年五月到九月全国财政收入一直负增长，企业利润增速大幅下降和负增长，居民收入也没有快速增长，个税收入前三季度下降近30%，这三项加起来就是GDP。三项都是低速增长或负增长，加起来的GDP怎么还增长6%?\n\n如果是减税导致财政收下降，GDP依然维持增长6%。那么，要么企业利润较快增长，要么老百姓收入较快增长，但这二者都没有出现。说明GDP增速没有那么快。\n\n看来应该承认经济面临异常严峻的现实，真正面对严峻巨大问题，下决心改革啊。\n\n为什么经济下行压力持续加大?\n\n愚以为去年各种噪音造成民营企业家信心严重受挫，至今也没有恢复，企业家信心不足是经济加速下行的关键原因，尤其是制造业投资急剧下降，如何恢复和增强民营企业信心？没有像邓小平1992年南巡那样的重大改革举措看来是难了。有报道说某省民营企业家移民者高达70%，可能夸大其词，但是民营企业家普遍缺乏安全感，没有长期投资打算，是不争的事实。如何让民营企业家安心，顺心，放心，愿意长期投资，不想移民，不想转移资产?这个必须通过解放思想，从法治制度上真正妥善保障私有产权，保重民营企业家各项权利才能实现。\n\n另外一项重大改革就是国有企业，这个大家都知道。今天国有企业有真正的改革吗？除了一再强调加强党的领导之外，还有哪些真正能够激发企业家活力的改革?\n\n事实上存在的国进民退不容否认，事实上存在的对民营企业的各种歧视也不容否认。还有国有企业那么高负债如何解决？让肉烂在锅里，老百姓一起负担吗？为什么不出售国有企业，出售国有资产，降低负债率?\n\n此外还有政府和国家治理方面需要改的地方太多了。现在各种检查和学习的形式主义恐怕占去很多官员一半时间吧?基层干部更是苦不堪言。到处是安检，到处是非生产性劳动。都要财政支出啊，今年三季度财政收入增长只有3.3%，支出增长达到9.6%，这能持续吗？一方面经济活力严重不足，另一方面非生产性财政支出快速增长，怎么可能持续?"
		},
		{
			"post_id": 75,
			"title": "郭于华：莫谈政治？你还是 人吗？！",
			"date_published": 1571022968.481,
			"body": "不为君王唱赞歌，只为苍生说人话\n岂有文章倾社稷，从来佞幸覆乾坤\n\n2018-12-26  \n\n| 郭于华，1990年毕业于北京师范大学，获博士学位；2000-2001年于美国哈佛大学人类学系做博士后研究。1990-2000年任中国社会科学院社会学所研究人员；2000年至今任清华大学社会学系教授。主要研究领域为社会人类学、农村社会学、民间文化与信仰等。 |\n\n什么是政治？我们不妨先放下科学严谨的定义，从日常生活世界出发。\n\n我们每日的生活、我们的生命历程、我们如何与同属一类的他人相处，是由政治安排决定的。这一安排是好还是坏，是合理还是不合理，是公正还是不公正，关乎我们的生活质量，因而政治也是关于是非正误的常识。现实中的悖论是大多数人对政治不感兴趣，认为政治是政治家们特有的事业；甚至许多社会精英——在商言商的企业家、术有专攻的专业人士、知识分子、作家艺术家、媒体人士……都不约而同地逃离政治，这也称得上是一种“中国特色”。除了中国社会曾全面被政治宰制所造成的心有余悸之外，另一重要原因在于，我们并未真正理解政治的本质以及政治与日常生活的关系。事实上，若就人性的本质意义而言，我们既是社会的存在，我们因而也是政治的存在。你可能对政治没有兴趣，但政治对你却很有兴趣；你千方百计逃离政治，可政治却时时在你身边。\n\n你的身份地位——包括你是官（尤其是相当级别的官）还是民，你出生在城市还是农村，你是官二代还是富二代、穷二代，你的性别是男还是女，决定了你在生活的方方面面得到非常不同的待遇，而这不同是制度安排也就是政治决定的。\n\n具体而言：你住在单位福利房还是商品房、保障房、租用房、农村住房中，取决于你的出身、你的职业和你的财富状况等。不同的居住格局反映了改革以来国家通过一系列政策安排和组合，对人们居住生活的重新布局和建构，也因此而形成了不同的居住群体，以及不同的身份政治，进而住宅成为当代社会分层的重要标志。居住，这一最基本的物质生活内容，却日益被涂抹上政治的色彩。都市住宅形态的演变，基于商品住宅私人产权诞生的业主群体，以及各种各样的人群为维护自身居住权利而蔓延开来的都市运动，最直接地映射出转型期日常生活的政治。因而居住和与居住有关的活动不再仅仅是个人日常生活的微小实践，而是往往直接演变成一种政治行为。不同的居住形态归根结底所反映的是居民之不同的体制身份、社会地位和资源来源，其背后的根本问题则是权利问题，因而归根结底是市场、国家与公民的关系问题。\n\n饮食，最为直接地满足生存需求的物质，依然与政治密切相关。作为穷人，是否能够裹腹，是否可摄入足够量的营养，在饥荒之年能否活下来，不是取决于自然而是取决于政治。著名经济学家阿玛蒂亚·森的“饥荒的政治学”以“着眼于现实”的方式雄辩地论证了“为什么运行良好的民主制度可以免于饥荒”这一命题，森指出：“事实上，饥荒的发生与统治形式有着特别密切的联系”，“只要公共政策得当，一个物质丰裕的现代世界是完全能够杜绝饥荒发生的”；“贫困必须从可行能力剥夺的角度来理解。因此，消除贫困以致防止饥荒发生最终就必须落实到提升个人的可行能力，从而扩展人们所拥有的实质自由”。\n\n日常生活中的饮食，同样与政治有关，以当下人们颇感焦虑的食品安全问题为例，如何面对食品安全危机，本身就是制度安排造成的社会分层的体现。如果是位高权重的官员或者就职于体制内重要部门，他们可以享受到单位特供系统提供的绿色无公害食品，放心食用而且物美价廉；如果属于城市中的中产阶层，他们有比较高的收入可以买得起高价的粮食、蔬菜、水果、肉蛋等，以保证自己和家人的安全饮食；如果是种植农产品的农民，他们许多人会种一小块不施农药化肥的自己食用而把大量非绿色农产品卖到城里；但如果是城市中的贫困人口和进城打工的农民工，他们就只能听天由命吃自己能吃得起的食物，甚至不能保证自己年幼孩子所食奶粉的安全。不同的社会阶层用各自的方式解决食品安全问题，穷人无力解决这一问题，这当然是政治。\n\n除了居住和饮食，其他生存问题亦然。当你生病的时候，是否能够得到相对公平的医疗资源的救治，这是政治问题；当你老迈之时，是否老有所养，能否得到公平的退休金待遇还是受到不公正的养老双轨制待遇，这是政治问题；你作为纳税人，是否被合理地课税，你是否知道你缴纳的钱用作何处，这也是政治问题；你若触犯了法律，是不是能依法得到公正的审判，这还是政治问题。你是否真正享有了信仰的自由、言论的自由、结社的自由、免于匮乏和免于恐惧的自由，你是否不会因为出身、族群、性别、年龄、性取向等而受到歧视与不公正待遇，简而言之就是不仅能够活着而且能过一种有尊严的生活，这当然是政治问题，而且对一个社会中包括穷人在内的所有成员来说，都是政治问题。\n\n斯科特等研究者早已注意到弱者为生存而进行抗争所形成的底层政治特点：它们几乎不需要协调或计划，而是利用心照不宣的理解和非正式的网络；通常表现为一种个体的自助形式；避免直接地、象征性地对抗权威。了解这些为争取生存权的平凡的反抗形式更有利于理解农民长期以来为保护自己的利益对抗或保守或进步的秩序所作的一切。而正是这类反抗长期以来是最有意义和最有效的。斯科特还着重讨论了农民非政治化的另一种表现即对支配的顺从或“共谋”（complicity）。他认为有必要区分“虚假意识”造成的顺从和强制性暴力造成的不反抗，在很多情况下，底层的沉默是镇压造成的沉默而不是共谋的沉默。在强大的经济占有、政治统治和意识形态支配情境中，农民运用属于自己的“弱者的武器”和“隐藏的文本”，以坚定而强韧的努力对抗无法抗拒的不平等。\n\n这里值得注意的是斯科特对于日常形式的反抗与统治意识形态之间微妙关系的探究，他并不否认马克思关于“统治阶级的意识形态就是统治的意识形态”的经典论断，但他更为强调的是，认清在何种程度上统治阶级能够将自己的公正社会秩序的想象，不仅强加给被统治阶级的行为，而且强加给他们的意识。换言之，底层能否拥有自己独立的意识？斯科特的研究表明，恰恰因为有“隐藏的文本”存在，从属群体可以撑开一方自己的政治与意识空间。正是从这样一个角度，斯科特表达了对“虚假意识”、“霸权”和“神秘化”的有限同意和反思性批判——从属群体以“隐藏的文本”对“公开的文本”进行洞察和解构。\n\n底层政治的理论有助于启发我们如何从日常生活出发，立足于物质基础，赋予穷人政治地位。这里有一个从物质利益诉求走向政治诉求的过程，我们早晚要意识到，我们共同生活在一定的制度框架中，因而我们就生活在政治里，我们无可逃避地就是政治性动物。所有的统治者都希望被统治者不关心政治，而当大家都埋头生活而不关心政治时，政治就成为强者独享的获取暴利的工具和压制异端的利器，而大多数普通人必然成为被榨取被宰制的“弱肉”。长久以来的意识形态灌输，包括缺失了独立自由精神的教育、对历史有意识地歪曲与忘却，以及模糊人们的是非观念等，都是在制造非政治化的统治对象。\n\n文章来自网络，我对文中观点保持中立，仅供参考、交流之目的，本文仅代表作者观点，并不代表本人立场。\n\n文中的论述和观点，敬请读者注意判断\n\n版权归原作者所有，如有侵犯版权，请及时联系\n\nPS:\n您可以不喜欢，也可以去否定。\n您可以不回复，也可以去质疑。\n我不同意你的观点,但是我誓死捍卫你说话的权利"
		},
		{
			"post_id": 74,
			"title": "揭开表象看社会，这才是真正的事实！ (转)",
			"date_published": 1570083234.754,
			"body": "最近几个月，有三件事让我很感慨。\n\n**第一件事：“北大树洞”歧视事件。**\n\n先说一个名词——**国家专项招生计划。**\n所谓国家专项招生计划，就是国家实施的面向贫困地区的定向招生计划，旨在帮扶全国832个贫困县。今年国家专项计划理工类招生，北大本答应在河南贫困县招录8人。但北大在接到8名学生档案后，却将其中两名退了回去，理由是：530多分的考生分数太低，进北大可能跟不上教学进度。\n北大的这个退档行为，在网上激起一片民愤：\n“承诺了做不到，当初就别承诺啊！”\n“凭什么未入学就预判人家跟不上进度？”\n迫于压力，北大补招了这两名学生。哪知道补招这两名学生后，在读的一些北大学生就愤怒了，他们在“北大树洞”发泄不满：\n“现在有一种吃屎的感觉。”\n“我少考一门语数英都比他高20分。”\n“他俩真的会来上学吗？难道自己不知道自己几斤几两？”\n“他和我们分数不在一个层级，我们要孤立他。”\n言语充满了鄙视和傲慢，让人难以相信这是出自北大精英之口。\n\n**第二件事，是王思聪和花千芳吵架。**\n\n傻逼花千芳在微博上说：“对于绝大多数中国人来说，英语是一件废物技能……”\n实话实说，花千芳这番“英语无用论”实在不咋地，所以惹恼了王思聪，王思聪在微博上骂了一句：“9012年了，还有没出过国的傻屌？”\n没想到这句话一下捅了马蜂窝，很多网民大骂王思聪：\n“没出过国怎么了，我就没出过。”\n“你特么才是真正的傻屌。”\n“你不就仗着你老子有钱吗？”\n但也有一部分人不理解大家为何要骂王思聪。\n“现在没出过国的人还多吗？就算欧洲美国不去，东南亚总该去过吧，那么便宜。”\n\n**第三件事，是优衣库哄抢事件。**\n\n一件联名款T恤，优衣库只卖99元，结果引起很多人的哄抢，为了抢夺T恤，一些人甚至不惜大打出手。\n于是，哄抢T恤的这些人，遭到很多网民和媒体的斥责和嘲讽：\n“为了捡便宜，连脸都不要了。”\n“为了一件T恤，至于这样吗？”\n“把中国人的脸都尽了。”\n\n我为什么要讲这三件事呢？\n\n因为我觉得很多人都有一个思维误区——**咱中国人有钱了。**\n\n骂“河南两名考生不配上北大”的学生，可能真的以为中国没有贫困地区了，所以觉得这样帮扶贫困地区不公平。\n\n骂“没出过国的傻屌”的王思聪，可能真的以为中国人普遍性有钱了，所以才会说出“9012年了，还有没出过国的傻屌”这样的话。\n\n骂“不要脸，连T恤都要抢”的网民，可能真的以为中国人普遍性富足了，所以不明白大家为什么要哄抢一件T恤。\n\n中国人真的很有钱吗？很多人的第一感觉都是：好像是挺有钱的。因为我们经常听到身边的人感叹：“月薪低于8000元可怎么活啊？”“月薪低于1万的工作我不考虑。”\n\n所以感觉大家都很有钱似的。现实情况真的是这样吗？我们来看看国家统计局发布的2017年《国民经济和社会发展统计公报》。\n《统计公报》将全国居民等分为五组，各占20%。\n低收入组：人均可支配收入5958元，月均497元。\n中等偏下收入组：人均可支配收入13843元，月均1154元。\n中等收入组：人均可支配收入22495元，月均1875元。\n中等偏上收入组：人均可支配收入34547元，月均2879元。\n高收入组：人均可支配收入64934元，月均5411元。\n\n什么叫人均可支配收入？\n人均可支配收入=工资收入+经营净收入+财产净收入+转移净收入。也就是说，人均可支配收入就是你所有拿到手的收入。\n\n搞清楚这个概念后，再对比上面这组数据，我立马吓了一大跳：如果我们一个月收入超过2879元，就意味着超过了全国60%的人。如果我们一个月收入超过5411元，就意味着超过了全国80%的人。\n\n中国人很有钱吗？不。王思聪骂“没出过国的傻屌”时，可能万万想不到——中国居民护照持有量只有1.3亿本，不到人口的10%。就算所有持有护照的人都出过国，那中国出过国的人数也只有10%。\n\n那为什么大家会觉得中国人很有钱呢？我认同曹习华教授的分析，他觉得有两大主要原因。\n\n**一是：有钱人具有很强的发声能力，媒体也喜欢为有钱人发声。**\n“在微信朋友圈里，到处都是中国人挤满各大景点的照片；在国际航班上，每一架客机里都坐着很多中国人；在世界各地，每一个大卖场里都挤满了中国人；在欧美高校课堂里，也坐满了来自中国的留学生……所以世界各国都觉得，中国人实在是太有钱了。”\n\n**二是：大部分生活在底层的人没能力发声，媒体也很少为他们发声。**\n“十四亿人口的中国人，至少有十亿从来没有坐过飞机，有5亿人从来没用过马桶，有60%的家庭人均月收入不到三千……\n\n**沉默的大多数背后才是真实的社会。他们没有时间发声，为了生存需要争分夺秒。他们没有条件发声，不知道怎么对外界讲述苦难的自己。有一道无形的墙把他们隔离在我们的视线之外，让我们看见了繁华但看不见他们。**\n\n**知乎上有一个话题：生活富足如何限制了我们的想象力？**\n下面有很多催人泪下的回答。\n我就随便选两个故事吧：前几年，我在医院实习。有一天夜里，急诊室冲进来两位农民工，一位用左手紧紧握住右手，鲜血直下。一位拿着一个酒瓶，瓶里泡着半截手指。不用说，手指断了。我导师说：现在接还来得及，以后手指功能基本不受影响。他问：要多少钱？我导师说：三千左右吧。他愣了一下，说：那如果截掉呢？我导师说：三百。他果断地说：截吧，不要了。我倒吸一口凉气。那一天，我明白了一个道理：**“弱国无外交，弱者无选择。”**\n\n记得大一的时候，同学X躲在被窝里抽泣，我们几个舍友都很不解。在我们的再三逼问下，她终于说出了原因：来上大学之前，她处理例假的方式非常原始，从来没用过卫生巾，上大学之后，她发现我们处理例假的方式，跟她自己完全不一样，但她羞于启齿问我们。就这样长时间不当处理后，她的身体终于出现了问题，所以她非常害怕。听完她的讲述后，我们几个舍友都惊呆了：**“万万没想到中国竟然还有不用卫生巾的地方。”都说贫穷限制了我们的想象力，其实不光是贫穷，富足也会限制我们的想象力。**\n\n再讲一个故事吧。一个有钱的女人问：“蛋怎么卖？”卖蛋的老人答：“一块五一个。”女人说：“10块买10个，可以吗？不然我就走。”老头赶紧说：“行，我今天还没开张呢。”女人买了蛋，一脸得意的离开。她开着豪车和朋友到高档餐厅，然后和朋友点了若干东西，但只吃了其中一点点。她们买单，账单是640元，她给了700元，告诉老板不用找了。那天发生的事对于餐厅老板来说，不过是一件很平常的事。但对于可怜的卖蛋老人来说，却是非常难过的一件事。\n**我们不也一直这样吗：常常对很需要帮助的社会底层的人非常吝啬，而对不太需要帮助的中上阶层的人却非常慷慨。**\n\n优衣库哄抢时间发生后，媒体一边倒地指责哄抢的人:“不要脸，没教养。”“一群low逼。”看到这样用词狠辣的评论，我心里有一点不是滋味。我喜欢有一家媒体的评论：**“这背后延伸出的问题是，中上阶层对贫穷缺乏必要的认知，中上阶层正在失去对社会底层的共情能力。”**\n\n**想起了100年前的北大。\n\n那时候的北大，允许那些负担不起学费的学生成为旁听生，成绩好的旁听生还可以转正。\n北大旁听生最多的时候，跟正式生的比例是1比3。\n\n1918年的时候，有北大学生给校长蔡元培写信：希望可以给校役提供受教育的机会。\n蔡元培把这封信登在校刊上，表达自己对这个想法的赞赏。\n\n没过多久，北大就开办了“校役夜班”，由北大的学生们义务授课。\n参加这个夜班的校役有230多人，其中大部分人是文盲或半文盲。\n\n我敬佩那时候的北大，无论是老师还是学生，都对社会底层充满了感知能力。\n他们想的是怎样把下面的人拉上来，而不是像现在有的老师和学生，想的是怎么把他们踢下去。\n\n我敬佩那个对社会底层充满感知力的北大，我也敬佩所有对社会底层充满感知力的人。**"
		},
		{
			"post_id": 73,
			"title": "究竟“谁”养活了我们",
			"date_published": 1570073872.432,
			"body": "**        我出生在东北的一个小山村，那里称得上鱼米之乡。但小时候的生活既没有鱼也没有米，高粱米、大碴子、小碴子是童年的回忆，只有逢年过节能吃上大米白面。记得五六岁吧，有一次看到母亲和好面出去了，我赶紧上面团上拽了一块往嘴里塞。但母亲很快回来了，我赶紧把面吐地上躲到了门后。母亲很快发现了把面捡起来拾掇拾掇就严厉的叫我吃下去，我哪敢违拗只好把那没什么味道的面疙瘩吃了下去！在这里我还要讲一个我妈讲过的小故事：我爸刚结婚时还没有和我爷爷分家，两家东西屋一个锅里吃饭。有年夏天我妈和我四姑去地里偷玉米棒子回来烀着吃，那时还没实行联产承包责任制包干到户，偷也是偷集体的。而我爷爷恰巧是生产队长性子又极为认真，但大家吃的时候我爷爷什么话也没说。过后有社员找到我爷爷说玉米被偷的事，这时我爷爷装作完全不知道。\n        我爷爷的亲侄子是个木匠，没事了就给别人做点活，这事叫我爷爷开社员大会好一顿批：“没事拎着个刨子可哪出溜”（出溜：东北土语意思就是闲逛）！生产队没单干前做为一个社员类似现在工矿企业的职工一样，禁止去搞副业。用现在的话说就是不能出去打工。东北气候寒冷只有一季庄稼，但生产队的活却多的很。因为没有农用机器就养了一群牛马耕作，除了牲口的辔头之类不能自己做，一切都要自己动手。社员没有什么私有财产，饲养所养的鸡鸭鹅也是集体的，这些都是集体劳动。东北以前冬天稀松平常就零下二十七八度！即使这样的大冷天生产队社员照样有活，就是往地里积肥。所谓积肥就是往地里送粪，差不多远放个粪堆。等来年春天平整开。其他的各种杂七杂八的的农活我也就不一一赘述了，社员一年到头就这样忙忙碌碌。\n        一年忙下来，社员分到手的除了口粮外还能分配点现金。有限的现金除了买油盐酱醋这样的生活必需品外就没有多少结余了！能想象么，我是七八年生人，到我记事儿时已经是八十代初了。一个农民每天面朝黄土背朝天挣着工分，分配着粗粮，逢年过节才能吃上一口大米饭、一口白面馒头。身上的衣服过年才舍得换一套，因为就是普通的棉布衣服而且薄的很，所以经常刮开口子，没办法只能补。这样的生活只能使人挣扎在基本的温饱线上！粮食都去哪了呢，很简单都被收归国家粮库了。我有时在想农民这样的生存状态和历史上的商周奴隶制有什么区别呢？不能擅自离开自己的土地、不能拥有自己的私产、不能储备更多的粮食只能有一点口粮，没事时就要歌颂一下社会主义好。\n        转机发生在一九八二年，中央发了一号文件开始落实家庭联产承包责任制。我上初中时听我们老师提过一嘴：中央文件到我们省被顶了一年，省里开始落实文件时我们县又顶了一年。这么说我们当地应该是从一九八四年开始的家庭联产承包责任制，距今也就三十五的历史。（家庭联产承包责任制）单干后，大家的生产积极性上来了，除了分到的土地外有些人还开了小片荒（因为新开垦的地面积都不大，故称小片荒）。因为国门的打开，国外的种子化肥农药大量进口，农民的田间管理时间变短，庄稼的产量大幅提高。除了交公粮农民手里的余粮多了起来，自家也可以养些家禽牲畜，生活也随之改善了起来。但我家的生活却是全生产队（大概有五六十户吧）最穷的之一！因为父亲和爷爷分了家，除了锅碗瓢勺没有分到什么其他东西，相当于净身出户了。如果是个光棍还好办，拖家带口想想那日子都有多么艰难。有一年过年没鞭炮放，父亲弄个雷管绑到大杨树上引爆了，声音太大把附近的邻居吓的够呛；还有一年是邻居给个一百响的鞭炮过的年。这里就要提到我的二姑父了，他是个能人八十年代就从银行贷了一大笔钱出来，发展了一大片人参种植场。看到我父亲这么困难就叫父亲上他们村去发展人参，提供资金、山地。父亲出发那天我还清晰记得，一大早和大伯（离婚未再娶，父亲雇他干活）挑着大筐带着生产队单干分的人参秧子过江。因为父母长年在山上，所以我被送到了三姑家，母亲从三姑走的时候我又哭又闹，三姑还给买了一袋饼干。到我上学的时候父母还是不能在身边，就雇了我大姨家的一个 姐姐做保姆给我做饭。放暑假时我再到山上和父母在一起过一个暑假！\n      八七年我家的人参下山了卖了一万多块钱，当时看来真是一夜暴富。父亲打算买一个电视机，因为村里已经有人家买了彩色电视机，父亲也准备一步到位。他和做木工活的大爷，还有个邻居一起坐上了开往天津的列车。父亲原打算找到电视机厂买电视机，找到厂长送点人参就可以买个质优价廉的。没想到找到工人时工人说：我们来这干了好几年也没见到厂长。电视没买成，邻居说咱们上北京逛逛吧，火车票才一块多钱，父亲着急回家就没同意。父亲坐着火车到沈阳下了车，在商场里看到电视就打算买一个。售货员说：电视不能单独卖，要买还得买一个日本进口的双卡式录音机。父亲出远门钱带的比较多吧，就两个一起买下来了，回家时我看包装还有价码标签：电视一千三百多，录音机差不多一千二。录音机真是费钱，能买起录音机买不起磁带，一盒磁带就要十块钱。因为双卡式录音机还带了收听广播的功能，所以没事就听广播，偶尔也能收到国外的电台。我印象中最深的就是台湾的广播抨击咱们的四项基本原则！也许那时就在我小小的心里一种意念开始生根发芽：多听听多看看外面的信息，哪怕听听就好。我家最困难的时候是二姑父拉了一把，吃水不忘挖井人么，所以几年后表哥结婚的时候父亲随礼一千块钱。\n        记得袁腾飞老师给学生们讲过的一段话：“你们九零后今天生活在尧天舜日的时代，太幸福了”。九零后今天能这么幸福不是天上掉下来的，是他们的父母背负着生活的艰辛与苦难。有人不喜欢揭开这道伤疤，有人选择性遗忘！有人老说你要感谢党感谢政府，没有他们也许连饭也吃不上了。我也确实要感谢，就是感谢党和政府给老百姓松开了手脚，再也不闭关锁国了。还有的人说国家给了老百姓安全稳定， 没有安全稳定什么也做不了。别的阶层我不知道，就中国大几亿的农民来说他们年年交农业税，一直交到了胡锦涛时期才免除了中国农业税。我想哪怕一个黑社会，你要是交了保护费，人家也能给你一定的安全保证吧。更何况伟大的国家保卫人民的安全稳定就是题中应有之义，什么时候变成了一些人的嘴里条件与恩赐了呢？今天的你如果说生活还算过得去，就看看自己的双手就行了。\n        啰嗦了这么多，我只想说我们离那个贫困饥饿的时代并不遥远。新中国到今天已经有了七十年，能吃饱吃好也仅仅才三十多年。一个国家建国三十多年，老百姓才从饥饿中脱离出来实在不是一件可以炫耀的事。前面的路还很漫长，形势千变万化，在此只能与诸君道声珍重。**"
		},
		{
			"post_id": 72,
			"title": "转：中国经济的灰犀牛之一——高铁",
			"date_published": 1570072971.377,
			"body": "　　中国高铁伴随经济高速发展，十年来虽然改变中国远行交通以及城乡风貌，却也因为高额开支以及畸形成长，恶化中国负债问题，此等现象已经引起专家多次警告，高铁可能成为重伤中国经济的“灰犀牛”之一。\n\n![](https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1569798056612&di=3318b4ab896f3d1aaae7c3383c6bef5b&imgtype=jpg&src=http%3A%2F%2Fpicuser.city8.com%2Fnews%2Fimage%2F20140905%2Fabacf0ffa2cfc750cff429803cc_p1_mk1.jpg) \n\n　　根据中国铁路总公司（中铁）今年第二季公布2019年第一季以及2018年年报显示，2018年中铁负债年增4.53％，达到5.21兆（人民币，下同），到了2019年第一季末，总负债持续增加600多亿，到达5.28兆，此数字已创历史新高。\n\n　　中铁财报显示，2010年底负债1.89兆，到了2019年激升至5.28兆，短短9年膨胀约2.8倍。\n\n　　这份报告也显示，2018年中铁前三季税后亏损，但是年终利润却由负转正。据媒体转述，中铁利润转正的原因为第四季获得政府的“铁路公益性运输国家补贴”，但是具体补贴金额并未公开。而这种“特殊”现象在多年的财报重复出现，几乎被认为是中铁每年利润转正的主因。\n\n　　中国近十年来大规模兴建高铁的负债问题，引起多方高度关注，许多专家担心高铁恐将成为近年冲撞中国经济的“灰犀牛”，连官媒也深入报导，虽然保守认为高铁债务尚无系统性风险，但仍然警惕应该慎防多种局部风险交错影响，例如高额的地方债、高铁产能过剩、多元经营不善、面子工程恶化，以及过度依赖国家补贴等等。\n\n　　虽然中铁一再强调不致引爆重大危机，否认自己是“灰犀牛”。但是除了官媒探讨，另有知名媒体强调中国铁路盈亏不明是争议的焦点，甚至认为高铁恐怕是中国经济最大的灰犀牛。\n\n**灰犀牛被视而不见**\n\n　　所谓“灰犀牛”的概念，源自美国学者、作家暨政策分析师蜜雪儿．渥克（Michele Wucker）2016年出版的畅销书《灰犀牛：如何应对大概率危机》。渥克专长世界经济与危机管理，曾任位于纽约的国际政策研究所所长，早在2007年不到40岁即当选古根汉学者，她以灰犀牛比喻发生机率高、影响巨大却被忽视的危机，此等危机原本大众可以看见并且提早因应，但是由于人性逃避现实、心存侥幸，总认为眼前看到的灰犀牛不会真的冲过来，刻意忽视，继而造成灾难。\n\n　　论者常以灰犀牛与十多年前开始盛传至今的“黑天鹅效应”对照。灰犀牛指的是机率较高的高风险事件，而黑天鹅是机率甚低的高风险事件。黎巴嫩裔美国学者塔雷伯(Nassim Nicholas Taleb)所著述的“黑天鹅”事件难以预测，相对而言，灰犀牛事件可怕的是，往往大家看到当面冲来，却都视而不见，而看清灰犀牛高速狂奔而来之际，几乎已经逃不掉。\n\n　　中国高铁高额负债，不是高铁营运效率的单一问题，而是涉及中国总体经济建设，应正视其庞大系统性风险。\n\n![](http://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1569798171609&di=5b0edc1ac9bc0a072576cb9d1ea01bbd&imgtype=0&src=http%3A%2F%2Fn.sinaimg.cn%2Fsinacn20%2F73%2Fw553h320%2F20180401%2F0306-fyssmme4771617.jpg) \n\n**赵坚的殷切呼吁**\n\n　　近年许多专家与舆论评论中国高铁负债危机，当中最为具体而殷切的关注者，是中国北京交通大学经济学教授、中国工业经济学会理事赵坚。\n\n　　赵坚今年初在中国《财新网》撰文，警告“人们通常只看到中国高铁运营里程的世界第一和高铁的快捷，却对事件的另一面，即高铁债务和运营亏损的世界第一，及中国交通运输结构的严重恶化视而不见”。\n\n　　赵坚指出，中铁在2005年负债只有4768亿，到了2018年9月底，激增至5.28兆，12年膨胀了大约11倍，若加上地方政府投资建设高铁债务的统计数据不明，以目前紊乱而疲软的总体经营情况来看，连负债的利息都还不了。然而在债务不断膨胀下，政府仍将继续兴建高铁。\n\n　　赵坚提醒中国高铁面临两种“灰犀牛”风险。其一是总体收入太低无法负担高额债务；其二是只能载人又昂贵的高铁，已挤压其它铁路等交通投资，恶化运输结构、堆高货运物流成本，甚至导致严重空污，资源效率极度扭曲。\n\n　　赵坚早在2011年习上任之前，就已经警告中国高铁成本过高、规模过大、铁道部资金结构极为脆弱。他当时撰文呼吁“弄清铁路债务整体状况、及时处理铁路债务危机，制止其进一步扩展，已经不应拖延”。并且提醒认清中国铁路债务危机的“深层制度根源”，并且强调推进民主法治建设和政治体制改革“更为紧迫和具有重要意义”。\n\n　　此外，长江商学院经济学教授许成钢也在今年3月初撰文指出，中国高铁里程世界第一的同时也背负一个恶梦----超过5兆、世界第一的铁路债务。\n\n　　许成钢认为，不计成本地兴建高铁，背后重要的机制就是国企总是可以取得政府高额补贴，不必担心破产，所以无所忌惮大量举债。\n\n　　然而，30年前的苏联与东欧经济大崩溃，都源于此等现象。如今中国经济趋缓、GDP持续下跌，当局一再以财政刺激政策维持经济发展，大规模建设高铁是重中之重，甚至积极将高铁外销世界，这些做法将影响中国大量国家资源，尤其是地方财政负担，累积不稳定因素，甚至导致金融危机。\n\n　　中国高铁高额负债的问题，不是高铁营运效率的单一问题，而是涉及中国总体经济建设、国企效率、地方债危机、去杠杆、地方政府融资平台，甚至官商从中牟取暴利等芜蔓庞杂的治理系统问题，不能仅以高铁营运成本效益或者票价成长来乐观预估，而应正视其庞大系统性风险。\n\n　　虽然在舆论控管下，针对官方近期快速核批重大交通建设以刺激经济的讨论已几乎销声匿迹，仍然掩盖不了中国高铁灰犀牛不断成长之重重疑虑。"
		},
		{
			"post_id": 71,
			"title": "如何人为添加tracker列表",
			"date_published": 1570025610.988,
			"body": "首先在zeronet的主文件夹下面找到zeronet.conf用notepad++打开，\n添加一句话`trackers_file = trackers_all.txt`。使得这个文件的内容为\n\n```\n[global]\nlanguage = zh\ntrackers_file = trackers_all.txt\n```\n\n然后在core文件夹下面创建trackers_all.txt，里面的内容填写tracker内容。如：\n\n```\nudp://tracker.coppersurfer.tk:6969/announce\n\nudp://tracker.open-internet.nl:6969/announce\n\nudp://tracker.skyts.net:6969/announce\n\nudp://tracker.piratepublic.com:1337/announce\n\nudp://tracker.opentrackr.org:1337/announce\n\nudp://9.rarbg.to:2710/announce\n\nudp://public.popcorn-tracker.org:6969/announce\n\nudp://wambo.club:1337/announce\n\nudp://trackerxyz.tk:1337/announce\n\nudp://tracker4.itzmx.com:2710/announce\n\nudp://tracker2.christianbro.pw:6969/announce\n\nudp://tracker1.wasabii.com.tw:6969/announce\n\nudp://tracker.zer0day.to:1337/announce\n\nudp://tracker.xku.tv:6969/announce\n\nudp://tracker.vanitycore.co:6969/announce\n\nudp://inferno.demonoid.pw:3418/announce\n\nudp://open.facedatabg.net:6969/announce\n\nudp://mgtracker.org:6969/announce\n\nudp://ipv4.tracker.harry.lu:80/announce\n\nudp://tracker.christianbro.pw:6969/announce\n\nudp://tracker.bluefrog.pw:2710/announce\n\nudp://tracker.acg.gg:2710/announce\n\nudp://thetracker.org:80/announce\n\nudp://tracker.tiny-vps.com:6969/announce\n\nudp://tracker.halfchub.club:6969/announce\n\nudp://tracker.grepler.com:6969/announce\n\nudp://tracker.files.fm:6969/announce\n\nudp://tracker.dler.org:6969/announce\n\nudp://tracker.desu.sh:6969/announce\n\nudp://tracker.cypherpunks.ru:6969/announce\n\nudp://p4p.arenabg.com:1337/announce\n\nudp://open.stealth.si:80/announce\n\nhttp://tracker.city9x.com:2710/announce\n\nudp://tracker.torrent.eu.org:451/announce\n\nudp://explodie.org:6969/announce\n\nudp://bt.xxx-tracker.com:2710/announce\n\nhttp://retracker.mgts.by:80/announce\n\nhttp://0d.kebhana.mx:443/announce\n\nwss://tracker.openwebtorrent.com:443/announce\n\nwss://tracker.fastcast.nz:443/announce\n\nwss://tracker.btorrent.xyz:443/announce\n\nws://tracker.btsync.cf:2710/announce\n\nudp://zephir.monocul.us:6969/announce\n\nudp://retracker.lanta-net.ru:2710/announce\n\nudp://pubt.in:2710/announce\n\nhttp://retracker.telecom.by:80/announce\n\nudp://tracker.tvunderground.org.ru:3218/announce\n\nudp://peerfect.org:6969/announce\n\nudp://tracker.mg64.net:6969/announce\n\nudp://tracker.kamigami.org:2710/announce\n\nudp://retracker.coltel.ru:2710/announce\n\nudp://tracker.uw0.xyz:6969/announce\n\nudp://tracker.swateam.org.uk:2710/announce\n\nudp://tracker.cyberia.is:6969/announce\n\nudp://sd-95.allfon.net:2710/announce\n\nudp://santost12.xyz:6969/announce\n\nudp://sandrotracker.biz:1337/announce\n\nudp://retracker.nts.su:2710/announce\n\nhttps://open.kickasstracker.com:443/announce\n\nhttps://open.acgnxtracker.com:443/announce\n\nhttps://evening-badlands-6215.herokuapp.com:443/announce\n\nhttp://tracker.skyts.net:6969/announce\n\nhttp://torrent.nwps.ws:6969/announce\n\nhttp://t.nyaatracker.com:80/announce\n\nhttp://retracker.spark-rostov.ru:80/announce\n\nhttp://retracker.bashtel.ru:80/announce\n\nhttp://open.kickasstracker.com:80/announce\n\nhttp://open.acgnxtracker.com:80/announce\n\nhttp://agusiq-torrents.pl:6969/announce\n\nudp://z.crazyhd.com:2710/announce\n\nudp://tracker.justseed.it:1337/announce\n\nudp://t.agx.co:61655/announce\n\nudp://packages.crunchbangplusplus.org:6969/announce\n\nudp://104.238.198.186:8000/announce\n\nhttp://tracker2.itzmx.com:6961/announce\n\nhttp://tracker.vanitycore.co:6969/announce\n\nhttp://tracker.torrentyorg.pl:80/announce\n\nhttp://tracker.tfile.me:80/announce\n\nhttp://tracker.mg64.net:6881/announce\n\nhttp://tracker.electro-torrent.pl:80/announce\n\nhttp://torrentsmd.me:8080/announce\n\nhttp://t.agx.co:61655/announce\n\nhttp://share.camoe.cn:8080/announce\n\nhttp://servandroidkino.ru:80/announce\n\nhttp://open.acgtracker.com:1096/announce\n\nhttp://omg.wtftrackr.pw:1337/announce\n\nhttp://mgtracker.org:6969/announce\n\nhttp://bt.dl1234.com:80/announce\n\nhttp://104.238.198.186:8000/announce\n```\n\n最新的tracker可以在这儿找到\n[https://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_all.txt](https://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_all.txt)\n\nStart ZeroNet tracker 跟踪器\n[https://www.youtube.com/watch?v=3IBHKr_SGl8](https://www.youtube.com/watch?v=3IBHKr_SGl8)\n\n转载自：[http://127.0.0.1:43110/1Q9LrWv27gyToaqDXA2GF2ZSA6PhznX7z1/?Topic:1522655036_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh/+tracker](http://127.0.0.1:43110/1Q9LrWv27gyToaqDXA2GF2ZSA6PhznX7z1/?Topic:1522655036_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh/+tracker)"
		},
		{
			"post_id": 70,
			"title": "[转载]贺卫方：国家和我",
			"date_published": 1569745417.03,
			"body": "* * *\n\n　　一、我和国\n\n　　问：国家的进退，影响着个人命运，今天可能有很多人懵懵懂懂，生活其中而不自知。印象中，您是文革后全国恢复高考西南政法学院首届法学院学生，个人奋斗史和国家命运的走向相互交织。\n\n　　结合个人经历，请您谈谈，个人成长和国家发展有什么样的关联?\n\n　　贺卫方：我的儿童时代经历着国家的灾难期，是典型的“文革少年”。那个时代，自己觉得所谓国家离自己很遥远，但是身边所发生的种种却都来自北京的最高层的决策。家庭和自己的命运都像一只波涛汹涌的海浪中的小船，自身完全无法左右，任由风吹浪打，不知前程何在?\n\n　　当然，那个时代倒不怎么强调爱国主义，反而意识形态上有一种国际主义的倾向——共产主义本身就是一种普世价值观。例如我们被教导说要胸怀祖国、放眼世界，要看到世界上还有三分之二的人民生活在水深火热之中，我们一定要去解放他们。伟大领袖不仅仅是中国人民的最高领导，也是全世界无产阶级的指路明灯。追求普遍性的另一个表现是对于本民族传统文化的态度是激烈批判的。我记得不断地要破“四旧”，立“四新”，古老的道德与风俗都在消灭之列。对于孔子以及儒家思想的严厉抨击把这种对传统文化的拒绝推向了高潮。我虽然只是个中学生，但还是会非常积极地参加各种批判“孔老二”的活动。\n\n　　现在想来，一国的成立与荣耀离不开她的历史与文化;我们的爱国离不开《诗经》、《孟子》，离不开唐诗宋词，离不开《石门颂》、《兰亭阁序》。孟子对齐宣王说：“所谓故国者，非谓有乔木之谓也，有世臣之谓也。”其实，比世臣更重要的是“世文”，也就是我们的文脉不能被斩断。但是，“文化大革命”正是这种毁文断脉的举措。\n\n　　我最幸运的是，17岁那年“文革”宣告结束，高考恢复了。自己参加高考，1978年秋天成为西南政法学院恢复招生后的首届学生。整个国家走上了改革开放，读书渐多，尤其是作为法律专业的学生，慢慢地形成了对于国家、政府、政党、国民之间关系的一些观点。\n\n　　二、家和国\n\n　　问：您老家是烟台牟平，从微博上“想要回老家建房”等只言片语可见您对故乡有很深的情愫。那么，家是什么?国是什么?国家又是什么?于情于理，国家应为个人和家庭提供怎样的寄托和庇护?\n\n　　贺卫方：虽然少年时代历经磨难，离开家乡标志着自己命运的柳暗花明，但是，对家乡的热爱却是一种难以割舍、与年俱增的情感。我对胶东方言、登州文会馆的历史、烟台在近代中西文化交流中的地位、孟子思想以及鲁能足球都保持了长久的兴趣。\n\n　　现代汉语里的“国家”将两个不同的义项合成一个新词，它对应的英文词有三个：nation，country和state。在英文里它们差异很大，nation指的更多的是人民，country是国土，而state则是政治国家或政府。爱国通常指向的是前面两者。汉语往往缺少这样的区分，引起不少误会和误导。\n\n　　三、国庆时节\n\n　　问：在您经历的数十载春秋中，您本人印象最深的国庆节是哪一年?是在哪里度过?是何场景?为什么印象如此之深?\n\n　　今天的国庆节对大众而言，似乎就意味着“放假、高速免费、拥挤的景区”等。国庆应当纪念什么、缅怀什么?在此时节，您又在思考什么，理想着什么?\n\n　　贺卫方：我经历的国庆节中，给我印象最深的是1984年的35周年国庆。我当时是研究生，政府和学校组织我们到天安门广场参加庆典，大家载歌载舞，还看放焰火，很热闹。那也是改革开放以来国民精神最昂扬向上的时候，是庙堂与市井之间共识度最高的时代。\n\n　　在今天这个愈来愈多元化和消费主义的时代，对于国庆节如何过，确实不容易给出一个一概而论的行为指令。在这个幅员辽阔的国度，绝大多数地方的秋季都是一年最美好的季节，人们利用难得的长假，旅游观光，饱览名山大川，也是增进对祖国感情的一个好途径。假如能利用假期读点中国历史，尤其是共和国建立后的历史，思考一些深层次的问题，当然是再好不过的事了。\n\n　　四、理性爱国\n\n　　问：在网络等舆论空间，一旦涉及制度建设等公共性话题，常常有攻击性的语言出没。比如，一看到批判中国现状的言论，就给人扣上“崇洋”或“卖国”的帽子。这里面恐怕隐藏着一种“不自信”的心态。难道批判就意味着不爱国吗?提出建设性的意见不是比谩骂更有意义吗?您怎么看一些非理性的言论?怎样理性地去爱国?\n\n　　贺卫方：爱国是一种美好的情感，但是非理性的民族主义就变成反面的东西了，因为它走向了非理性，排外仇外。我读近代史，最大的感叹就是那些最终给国家带来极大损害的行为，往往就是极端民族主义所导致的结果。在我从事的法律领域，近代以来的基本趋势就是借鉴西方的制度与观念，铸造一种新的法治文明。毛泽东不也称颂那些睁开眼睛学习西方的近代仁人志士么?马克思主义不也是西方思潮的一种么?\n\n　　五、国民素质与法治建设\n\n　　问：一直有一种观点认为，以现下的国民素质，法治和民主的进程不宜太快。甚至很多人相信，以中国人口之多、地域之广、情况之复杂，不可能彻底地予权于民，否则天下大乱……\n\n　　您怎么看国民素质与中国法治进程之间的关系?在法治国家的环境下，国民应具备何种素质(如今我们不具备吗)?在当下的中国，国家制度建设和国民素质提高，两者是谁在推动谁，哪个走的更靠前一些?\n\n　　贺卫方：我最近忽然想起，明年是英国历史上第一个宪法文件《大宪章》签署800周年的纪念年。英国在1215年的时候，经济、文化都相当落后，《大宪章》最初也是一种封建性质的文件，但是它的签署却标志着一个法治新时代的到来。我不相信，今天的中国人比起800年前的英国人素质更低下。其实，对于民主与法治，最重要的素质乃是权利意识，而在过去的近40年里，我们见证了国人的权利意识的觉醒和高涨。现在的当务之急是如何通过对政府权力的宪法限制带来更广阔的自由空间，通过中间社会的成长使得人们的权利诉求走向更加有序，通过独立而公正的司法制度让正义得以伸张。\n\n　　本文内容转自贺卫方博客\n\n　　目前，北大教授贺卫方先生微博和微信被永久封号。\n\n　　经典点评：我们可以同塔利班进行和平谈判，却不愿和知识分子平等对话。"
		},
		{
			"post_id": 69,
			"title": "[活很好]转一篇帖子：去你娘的“母亲”！",
			"date_published": 1569744908.693,
			"body": "　　想都不用想，马上就会有很多人跳出来欢呼雀跃为他们的“母亲”祝寿了。\n\n　　而于此相比的是，下面这样的情景一直出现在我的眼前(一些图片，都是曾经国内网站上出现过的。有背着一大捆干柴的八九十岁的老奶奶，有七八十岁的在田间耕田老大爷，有佝偻着背跳着一担青菜去蹒跚着去街上售卖的老奶娘。。。)\n\n　　朋友们说，这个102岁的老奶奶就是靠买菜养活自己，她还要东躲西藏放着城管!\n\n　　我想，这个102岁的老奶奶的母亲大概早已不再人世了，都说十指连心，如果泉下有知，她的心肯定与老人的心痛在一起，如果真有下辈子，相信她肯定回去求菩萨不要让她和她的孩子再投胎过这种苦日子的。\n\n　　相信许多朋友都明白，老人的母亲当然非许多人认为的“母亲\".\n\n　　然而，不幸的是，偏偏就有许多人搞不清，为自己有这样的”母亲“骄傲和自豪。\n\n　　我想问问这些人，当克拉玛依的孩子遭遇让领导先走时，当四川学生遭遇猪食时，当化工厂工人遭遇爆炸气化时，当残疾妇女卖小吃背城管驱赶时，当病人医治不起跳楼时，当颤巍巍的老人被黑色会时，当施恩的孩子上学路上被杀死时，当八十岁老太太述冤判刑时，当你存在银行的钱被突然消失时，当你遭遇金融暴雷时，当你遭遇”绿化带“时，当你的孩子被某董事长骚扰时，当你的孩子接种毒疫苗死亡时，当你匍匐挣扎再生死线时，当我们需要”母亲“抚慰的时候，你能告诉我到哪里去找”母亲“吗?你还会为这样的”母亲“骄傲和自豪吗?\n\n　　我想问问这些人，做”母亲“的会让周荣拿命去对抗台风吗?一直不能忘记某年八月一个叫周荣的勤劳勇敢的男子，在台风天，用身体支撑那辆靠贷款买下的货车而被压死在货车下。亲友近邻都知道，周荣就是靠这两货车养两个小孩上学的，这两货车时周荣活下去的希望。\n\n　　做”母亲\"的会让深圳63岁的林女士跳楼吗?只因为无法走路的儿子做关节置换手术需要30万，拿不出钱的的林女士在9楼的阳台上纵身一跃，跳楼而亡。她以为她的死可以获得一份意外险，她不知道自杀是不能获得赔偿的，她更不知道，那份价值420元的1年期意外险，已经过期了。\n\n　　这位母亲再给儿子留下的遗书中写道：“你放心，妈一定会帮你筹道那个治病的钱”。开始林女士用死都换不来儿子的治疗费用!\n\n　　当周荣，林女士，用死都换不来儿女生活生命保障时，当杨某兰等数不清的蝼蚁失去活下去的希望时，他们的“母亲”在哪里呢?他们该为这样的“母亲”骄傲和自豪吗?让这么年轻这么不想死的孩子活不下去，而“母亲”却一会儿孔雀开屏一样翘起屁股崛起，一会儿天女撒花一样把大把大把真金白银的爱撒向亚洲，非洲，美洲那些所谓的兄弟国家，这样的“母亲“简直就是”老二不死是为恶“!\n\n　　文字有点多，中间省略大约五六百字。。。\n\n　　无论这个”母亲“怎么标榜自己又多伟大正确，有多爱你，但一直让你活在地狱，让你匍匐在地艰难爬行，让你买套房子掏空六个钱包，让你子子孙孙都成为三驾马车的马匹，让你害怕生病害怕失业害怕”绿化带“，这样的”母亲“，如果你还发自内心的爱它祝福它寿比南山，认贼作父认贼坐母，你不是蠢货不是贱货，你又能时什么呢?\n\n　　桃夭 2019.9.27\n\n　　我这里有一组来自网易网友的评论(2016.12.29)：美国23790亿美元用在社会保障上，中国时2564亿万美元，美国差不多是中国的10倍，中国人13亿，美国3亿;中国去年税收1.7万亿人民币，怎么花的?给委内瑞拉250亿，厄瓜多尔75亿，巴基斯坦760亿，俄罗斯318亿，巴西530亿，缅甸200亿，总计1833亿元。都是美金，合人民币16497亿元，钱，就是这么花的。。。-----崔永元!"
		},
		{
			"post_id": 68,
			"title": "[转]如何把你手里的人民币合法快速的换成美元（技术帖）",
			"date_published": 1568982386.866,
			"body": "* * *\n\n文末附带作者2019年8月30日更新内容\n\n　　正文：\n\n　　最近关于中国外汇储备枯竭的传闻再次成为海外中文互联网的焦点话题，并且一如既往的在墙内被真理部封杀此话题。我们无需讨论网上流传的招行中行禁止取外币的视频是否真实，仅就兑换外币的技术问题进行讨论。\n\n　　首先声明，我提供的攻略全部是在符合当地法律法规的情况下进行，我不提供任何非法方式和渠道。\n\n　　第一步：常识普及\n\n　　1、 你要明白，人民币并不是自由流动的货币，仅仅是在浮动锚定美元基础上的债券。债券虽然在一定条件下可以流通，这个条件就是发行债券者的信用。中国政府的信用大家都懂，目前在国际上的信用值是涨是跌你也懂。懂了这两个问题，你就明白该不该把债券换成现金(美元)了。\n\n　　2、 你要明白，持有美元和其他外币并不违法，首先不违反中国法律，其次不违反下文中阐述涉及到国家的法律。所谓的每人每年仅可兑换5万美元的固定，只是人民银行对于旗下管理的商业银行的规定，而不是针对中国公民的规定。并且这只是部门行政规定，而不是法律。\n\n　　3、 你要明白，你是自由人，你可以出国，你可以在任何国家购置资产和金融投资，在取得外国签证和工作许可的情况下，你可以用双手和智慧创造财富。你是个“人”，不是动物或者物品，你有选择国家生活的权力，土共国没有任何权力绑住你或者把你变成它的资产。当你获得国外公民身份撕掉土共国护照的那一天，你就已经与土共国没有任何关系，所以不用担心它们单方面制定的任何法律法规和扯淡政策。\n\n　　第二步：办理护照和签证，以及其他准备工作\n\n　　不要想着傻乎乎的去银行直接换美元现金了，2015年以前你这么做没问题，现在还这么做，那就不要怪银行不给你钱了。不是银行没外币，而是你蠢。外币是给领导准备的，你这种刁民把外币拿跑了，领导来了没钱还怎么玩?所以，赶紧去办护照和签证，出国搞。\n\n　　地球上有一个神奇的地方，凭借土共一带一路大撒币迅速发展，并且距离中国很近，全国30%的人口讲中文，最重要的是，这个国家的通用货币是美元。对，你没看错，美元!这就是柬埔寨!Cambodia!\n\n<center>![](https://www.x6img.com/u/20190913/21530245.png)</center>\n\n　　柬埔寨首都金边，没什么高楼\n\n　　柬埔寨对中国采取落地签政策，但你不是去旅游的，所以你一定要找旅行社办理一年多次往返商务签证，没有拒签率，携程飞猪去哪儿花钱就能办。中国各大城市每天都有去柬埔寨首都金边和港口城市西哈努克(简称“西港”)的班机，提前一周买就能买到不错价格的机票。\n\n<center>![](https://www.x6img.com/u/20190913/2155551.png)</center>\n\n　　一年多次往返商务签证\n\n　　出国之前，把你所有要换成美元的人民币都转到一个或者几个支持大额转账的国内银行账户内，办好网上银行转账用的U盾，测试几次确保转账没有问题。\n\n　　把你绑定国内银行账户的手机号开通国际漫游业务，确保在国外可以打电话和收短信。\n\n　　准备一两部便宜安卓手机，最好支持双卡双待的。推荐直接去柬埔寨商场里面买，100~200美元就能买到不错的手机，并且都是安卓原生系统有google play的，而不是国产的阉割款安卓系统。\n\n　　最后，买个结实点的22寸左右的铝合金行李箱。\n\n　　第三步：出国，开银行账户，找钱庄换钱\n\n　　柬埔寨是全球最开放的国家，要不是因为设立海关可以收钱，他们恨不得把国境线抹掉。也是为了吸引外资，柬埔寨到现在不加入CRS，所以这里成为全世界的洗钱中心。金边只有200多万人，却拥有39家全业务银行，以及数不清的贷款公司、专业银行、换汇公司和钱庄，更不要说还有赌场。每家银行基本上都不需要预约就可以现场提取100万以上的美元现金，随便写个理由就好，前提是你的账户里有这么多钱(不过貌似现在政策有所收紧，只有加华银行才能一次性取这么多了)。\n\n　　柬埔寨虽然银行多，但绝大多数银行信息化水平极低，网上银行的水平还处于国内银行的2000年水平，典型代表就是柬埔寨最大银行加华银行Canadia，其网上银行每天只能转帐2000美元，跨行转账基本没有成功过，一切转账都要去柜台当面搞。而对于被移动互联网惯坏的国人来说，必须有手机银行APP方便转账花钱的才是银行，所以只能选外资银行，如ABA Bank(加拿大国家银行持股90%)、ANZ Bank(澳新银行，不再解释)、国泰世华(台湾最大银行之一，国民党党产银行)等。如果你是钱不多(100万美元以内)经常全球到处跑，推荐ANZ(ANZ现在不给中国人开户了，门槛有点高)。如果你钱不多(500万美元以内)经常去港澳台，推荐国泰世华。如果你就是为了把钱转出来，人还是在国内，经常还是要在国内花钱，那就推荐ABA Bank。\n\n<center>![](https://www.x6img.com/u/20190913/21574478.png)</center>\n\n　　银行太多数不清\n\n　　基础知识普及完毕，以下进入实操\n\n　　1、抵达柬埔寨首都金边：\n\n　　当你下飞机从机场出来后，你一定会骂几句：我擦这是什么鬼地方，简直比中国80年代还要破。先收起你的抱怨，我刚来也是被吓到了，你要知道，就是这种落后才给你了机会。\n\n　　2、买一张当地手机卡：\n\n　　推荐smart卡，开通Smart ThomMorng!周计划，$1=$333套餐，办好手机卡后，插入便宜安卓机，下载smart的APP，随时查询余额。注意，千万不要在机场办手机卡，那里都是游客卡，只能短期使用，并且还很贵。\n\n<center>![](https://www.x6img.com/u/20190913/21595952.png)</center>\n\n　　柬埔寨的移动运营商比银行还多，这是老图了，很多公司已经关门了\n\n　　3、开银行账户：\n\n　　我相信99%的人都是为了把钱转出来，然后人继续回国内混吃等死，所以我就详细说一下怎么开ABA Bank账户。去银行开户前最好找客户经理预约一下，这样可以不排队直接去VIP室开户。如果你没有熟悉的客户经理(不要问我，我不会给你推荐，咱还不熟)，那就早点起床，金边的银行都是8点开门，你最好第一个进去。在金边ABA Bank分行有很多，你直接去你附近的分行就好。你要带上护照和至少10美元，以及插上柬埔寨手机号的便宜安卓机。\n\n<center>![](https://www.x6img.com/u/20190913/22010324.png)</center>\n\n　　ABA Bank总部大楼。你没看错，就这么小\n\n　　进入ABA Bank内，直接找大堂经理说Open a new account，他就会给你个小票，坐下等待柜台喊号即可。如果你很牛逼约了客户经理，会被直接带到VIP室。\n\n　　由于你已经办了一年多次往返商务签证，所以你可以直接办理长期居民银行账户，即6%利息税(旅游签证是14%利息税)。开账户时会要求扫描你的护照、签署文件、拍照存档和设置手机银行，以及询问你是要办理VISA还是Master还是银联卡，然后你还要告诉柜台人员你需要网上银行跨国转账的token和授权卡。大概10分钟内工作人员会把银行账户开好，收你10美元最低存款，然后给你存折。银行卡和网银token将在一周后制作好，发短信通知你到开户银行去取。随后工作人员会教你怎么从google play下载ABA Mobile和账户设置，以及ATM机如何使用。\n\n<center>![](https://www.x6img.com/u/20190913/22021995.png)</center>\n\n　　找不到存折的照片，就来张银行卡照片凑活看吧。普卡年费5美元，金卡20美元，白金卡100美元\n\n　　拿到存折就标志着你已经开好柬埔寨银行账户了，你可以随时在ABA Mobile查询你的余额和同行转账，以及给你的手机号充话费。\n\n　　4、去换汇公司换美元\n\n　　柬埔寨有大大小小几百个合法换汇公司(2万美元一个换汇牌照，你也可以开)，第一次换钱推荐汇旺。直接去它在莫尼旺大道的营业部，他的工作人员会帮你装上它们的APP和开通账户，跟银行开户流程很像，只是不用提供身份证件，提供柬埔寨手机号即可。账号开通后去充值柜台，工作人员会给你它们的中国国内银行账户，你直接现场把国内银行账户内的人民币转账到他们银行账户后，汇旺工作人员会按照当天汇率把美元充值到你的汇旺账户内，或者你直接选择提取美元现金。建议第一次取20万美元左右即可，毕竟金边治安不是特别好。注意检查美元是否有残缺，即使撕开一个1毫米的口子，银行也是不收的。\n\n<center>![](https://www.x6img.com/u/20190913/22044461.png)</center>\n\n　　找不到门头照片，拿张效果图凑活看吧。这个公司还做快递和靶场，母公司太子集团做赌场、航空公司和商业地产\n\n　　所有的换汇公司都是华人开的，说中文，不要担心语言问题。\n\n　　5、存款\n\n　　带上护照、存折和美元现金去任一ABA Bank分行，向大堂经理说Deposit，他会给你个小票让你等号。如果你有客户经理，它会带你直接去VIP室点钱存款。如果遇到破损纸币，银行会退给你。\n\n　　ABA Bank的存款分为活期和定期，银行会推荐你办理定期存款，一年期利息大概5%左右，3年期在5.5%以上。你自行决定是否要这么吓人的利息。\n\n<center>![](https://www.x6img.com/u/20190913/2207585.png)</center>\n\n　　银行存款利息很吓人吧，贷款利息更是达到了13%以上，都是地产商贷款\n\n　　6、破损纸币处理\n\n　　美元不是柬埔寨发行的，所以没有银行会给你兑换破损纸币，但有一个机构可以，就是赌场。只要带着破损纸币到赌场的赌博机台上塞进去，然后退币，会拿到一张提款纸，找柜台换成美元即可。千万不要带着破损美元去ATM机存款，一旦被查到，银行会扣掉存款并通知你来取钱，一旦你逾期不取，你这存进去的破钱就没了。\n\n<center>![](https://www.x6img.com/u/20190913/22085715.png)</center>\n\n　　这两栋金色建筑就是金边唯一赌场NAGA金界，里面全是中国人，但对于我来说就是破钱换新钱的地方\n\n　　第四步：回国，取钱和消费\n\n　　开户一周后拿到银行卡和网上银行token，即可回国。如果你选的是银联卡，可以直接像使用国内银行卡一样正常刷卡消费和ATM取现，VISA和Master卡刷卡消费有些POS机不支持，但ATM取现没有障碍。注意，取现是取的人民币，扣的是你账户内的美元，并且汇率会比国内银行的差，差不多就是离岸人民币汇率。取现时要选择信用卡账户。\n\n　　如果需要大额取现，这就需要再次借助柬埔寨那边的换汇公司了。相信你肯定留他们的联系方式了。只需要在微信上给他们说你的国内银行账户，兑换人民币金额，换汇公司就会告诉你他们的柬埔寨银行账户和相应的美元金额。你把美元转入他们的银行账户，换汇公司就会把人民币转入你的银行账户。不用太担心你把钱转过去他们不给你转的问题，去大公司，每次金额小一点，多转几次就好。都是凭信用做长期生意的。\n\n　　第五步：大量换汇存到柬埔寨账户\n\n　　走过一遍流程后，你就掌握基础的合法的换汇出国存款操作了。但如果有几千万几十亿人民币的资金怎么搞呢?还是一样的做法，唯一不同的就是，你需要多准备一些国内和柬埔寨银行账户。悄悄告诉你，同一个人可以在同一家ABA银行和其他银行开多个账户。\n\n　　现在的你肯定有了熟悉的银行客户经理，去银行一定走VIP通道，因此一次性存款取款几百万美元都没问题。唯一的问题，就是你装钱的行李箱够不够大。以前买的22寸行李箱一次只能装240万美元，肯定不够你用的。\n\n　　对于换汇公司，一般普通换汇公司一天处理500万美元现金都是小意思。如果你有10亿人民币要换成美元，同时找5个换汇公司，预约好，则3天就可以全部存入柬埔寨的银行。\n\n　　注意事项：\n\n　　1、安全：金边和马尼拉并称为亚洲治安最差城市，跟15年前的广州差不多。出门走路一定不要玩手机，否则你就再也没有手机可玩了。飞车抢包是家常便饭，习惯就好。因此当你扛着一行李箱美元时，还是多喊几个朋友开车去银行吧。\n\n　　2、信任：对于第一次打交道的换汇公司，总要留个心眼。他必须是把美元现金摆在桌子上，检查无误后，你再转账。转帐完成后直接带现金走人。第一次转账换汇不要超过10万美元。所以你真的是为了要把大量人民币换成美元，那就需要多跟这些换汇公司打交道，没有接触3个月以上，不要跟他做大买卖。相信你都能挣到这么多钱了，该怎么做生意不用我讲了。\n\n　　3、手机：之所以用便宜安卓手机是因为掉了不心疼。但如果你是要将美元长期放在国外，建议你还是在国外买Google Piexl系列或者苹果手机，并且用国外手机号注册google 账号和Apple ID，且Apple ID的区域一定不要选中国。装好VPN和银行APP，whatsapp和Line之类的通信APP，绝对不要装任何中国的APP，尤其是微信。与银行客户经理和钱庄联系时，不要使用微信。柬埔寨的手机SIM卡有时候在中国和其它国家会没有信号，不要急，直接联系客服，他们会帮你解决。\n\n　　4、跨国转账：众所周知，柬埔寨是国际洗钱中心，其银行在国际上的风险评级很差，因此千万不要直接用柬埔寨银行大笔转账到其他国家银行账户。具体转账方式，你可以请一些财务顾问，它们会根据你转账的目的地帮你做好方案。如果仅仅是日常消费，用国内银行做中转并借助当地钱庄或换汇公司，是拿到最优汇率并安全可靠的方式。\n\n　　5、汇率：柬埔寨的各家换汇公司汇率是有差别的，且其整体汇率要比中国银行的在岸人民币外汇牌价高2%左右，如中国银行美元兑人民币是6.75时，柬埔寨一般都是6.88~6.92之间。但其买卖汇率差却要比国内银行小很多，因此如果你有美元，想换成人民币，带到柬埔寨换，会小赚一笔。\n\n　　6、账户冻结：柬埔寨的银行除了倒闭以外，是完全可以确保你的资金安全的，没有账户被冻结一说。但如果你通过换汇公司将美元换成人民币后，转到你的国内银行账户，是有可能导致你的国内银行账户被冻结，尤其是资金量大的时候。这是因为换汇公司的账户接受过非法资金，或者被举报盯上了，其转出钱的接收账户就可能也被冻结。一旦遇到账户被冻结，立即给银行打电话，银行会要求你带上身份证去银行处理，一般来说银行扫一下身份证即可解冻。为了预防账户被冻结，尽可能在每次收到换汇公司打过来钱后，立即通过支付宝微信之类APP转账到其他银行卡，或者去ATM机和柜台取现金出来，不要嫌麻烦。\n\n　　最后，祝大家都能顺利把人民币换成美元，保护好自己的财产。\n\n　　==========================================================================\n\n　　2019年8月30日更新：\n\n　　这篇文章所介绍的方式现在有一些已经失效了，毕竟用的人太多，政策会收紧。虽然我这篇文章写得内容都是在合法合规情况下的换汇方式，但依然有很多不可测风险。如果有朋友真的要按照我写的方式去操作，切记第一次不要搞大资金，先拿小钱试水，注意风险，谨防被骗。\n\n　　最近一段时间大批中国人涌入柬埔寨换美元和买房，各家银行生意是好得不得了，因此门槛也逐渐提高。以前是个人拿着护照都可以去开，现在很多银行开始要求提供居住证明(租房合同)和劳工证，以及长期居住签证了。目前只有为数不多的几家银行，如加华银行、ABA银行等可以比较简单的开户，建议有需要换美元的朋友尽快去开户。\n\n　　最近香港局势越来越紧张，很多朋友问能不能把香港的银行账户内资金直接转账到柬埔寨的银行，答案当然是可以的，但非常不建议直接通过银行转账。香港银行账户内的钱是可以被土共直接查到的，而要拿到柬埔寨的账户信息，土共还是需要花点心思的。如果你直接转账到柬埔寨的银行，你的柬埔寨银行账户就会被直接暴露，土共拿到你的柬埔寨银行账户信息，就可以买通警察或者柬埔寨央行的腐败官员直接冻结你账户。因此最好通过钱庄来把香港的钱转移到柬埔寨，或者如果你有新加坡的银行账户，可以先把香港的钱转到新加坡，再转到柬埔寨。总之，安全第一。\n\n　　关于要把柬埔寨的钱转到其他国家，建议还是用ABA银行。他们现在开通了在手机APP上直接国际转账的功能，非常之强大。并且还支持生成无限多个虚拟VISA或MASTER银行卡，方便网上支付。\n\n　　其实，柬埔寨并不算是最安全的资金转移目的地，毕竟效果政局不稳，且被土共渗透非常严重。如果你真想把钱放在真正安全的地方，推荐还是在新加坡、日本、澳大利亚等发达国家开户和存款或投资。"
		},
		{
			"post_id": 67,
			"title": "[活很好]一台湾人入境香港后失联看港人反送中的合理性",
			"date_published": 1568343907.561,
			"body": "* * *\n\n今天在某易上看到新闻，好像是国内哪个部门的发言人说的，一名台湾的乡政顾问在入境香港后失联，是因为该人涉嫌违反国家安全罪。。。\n\n但并没有指出是违反了什么样的国家安全罪。他具体的言行是什么，说出那样的言行实在台湾还是香港，但肯定不是在大陆。\n\n想想也知道，这所谓的国家安全罪不用说就是按照这边的标准给与失联的。是在失联三天后，才由发言人加以证实的。\n\n抓人现在都搞得这么见不得天日了。今天不是这个失联，明天就是那个失联，要么是涉嫌犯了危害国家安全罪，要么是寻衅滋事罪，但到底是什么样的言行导致了那样的罪名，从来都是不清不楚的。\n\n如果该名失联的台湾人的所有言行是在台湾发生的，那么在香港让其失联，这合适不合适呢？\n\n如果该名失联的台湾人的所有言行是在入境香港后发生，那么是不是应该由香港政府处置呢？但从发言人的发言来看，该台湾人的失联明显是大陆在主导，这是把“一一国两制”放弃了吗？。。。刚看到这个新闻的时候，真说不出是一种什么样的心情。\n\n本来是不想就此事发一篇帖子的，刚看到那个分享，看到后面的回复，就忍不住又想说两句了。\n\n撇开港府做些违反“一国两制'的事情，或者一味的强迫港府做那些违反“一国两制”的事情，这适当吗?\n\n要知道，港人可能很多时候无可奈何所以无奈的忍受，但台湾人可就不一定了。毕竟隔了个台湾海峡，而且其军力可以排在全球前20名，其军力甚至强国欧洲的荷兰。如果有人说，中国去统一荷兰简直是轻而易举，这个人绝对会被大多数认为是疯子。但如果说统一台湾轻而易举，为什么大多人都觉得正确呢?\n\n若果真的是轻而易举的话，那就不是一味的嘴炮了。。。\n\n简单预言一下，明年美国和台湾的大选，依然会是现任领导人当选！甚至在台湾，民进党甚至有可能一直坐庄。。。因为这边有些事做得实在太露骨也太让人恐怖了。尤其是港人的遭遇，绝对给了对面一个非常不好的反面教材和血的教训。。。"
		},
		{
			"post_id": 66,
			"title": "[無極炁]美国这个大魂淡对中国做了些什么,国人要牢记在心",
			"date_published": 1568343576.13,
			"body": "**美国这个大魂淡对中国做了些什么,国人要牢记在心**\n内容来自网络\n\n![](https://luoimg.com/u/20190912/12575710.jpg) \n\n**一、为中国培养第一批国际人才**\n\n洋务运动时期，开明人士为推动教育进步，奏请朝廷挑选聪慧幼童赴欧美留学。在大臣容闳的极力推动下，清廷决定派遣幼童赴美，学习外语、科学以及技艺。\n\n1872年夏，第一批留学生到达美国，30名幼童平均年龄不足15岁。清朝前后共派遣四批共120人，计划完成学业时间为15年。\n\n抵美后的幼童，先由美国老师负责教养监护，英文合格的直接进入美国学校。\n\n中国留美幼童纪念学会会长高宗鲁在文章中写道：“中国幼童与美国家庭共同生活，水乳交融，对促进民族感情贡献良多，影响源远流长。”\n\n借由这120人，美国为中国培养了第一批国际人才。北洋大学校长蔡绍基，民国初期国务总理唐绍仪皆在此列。后因顽固派官员的阻挠和破坏，清廷于1881年9月下令召回全部留学生。仅有2人完成学业，其中有一名耶鲁毕业生，他的名字叫詹天佑（前左三）。\n\n![](https://luoimg.com/u/20190912/12575855.jpg) \n\n**二、庚款留学生和清华大学**\n\n1900年义和团拳乱，北方多省掀起杀人狂潮，引发11国联军占领北京。签订《辛丑条约》时，美国遏制了列强瓜分中国的企图，并主张减免中国的赔款。\n\n按条约规定，清朝赔偿各国损失共计4.5亿两，其中美国3200万余两，折合美金2400多万元。1904年，美国国务卿海约翰向清朝驻美公使梁诚表示：“美国得到的赔款过多”，愿意退还，但这笔钱不该交由中国官员使用，而该用于赞助中国教育。\n\n1908年1月，美国国会批准总统罗斯福的请求，将赔偿减至1300万，余款退还中国。清朝外务部回函予以致谢，表示将用赔款派遣留学生。在美国的带动下，各国陆续减免中国赔款。\n\n自1909年开始，中国以此款项资助留美学生，史称“庚款留学生”，胡适、赵元任、竺可桢、梅贻琦均在此列。为培养留美预备生，建立清华学堂。自此，美国成为中国留学生最多的国家。\n\n**三、为中国兴办学校**\n\n1949前中国有许多大学是由基督教或天主教会创办的，其中有几所当时的世界级大学。美国基督教团体堪称最大功臣。\n\n1.燕京大学：1919年由英美两国基督教教会创办于北京，司徒雷登任校长。曾与哈佛大学合作成立哈佛—燕京学社，享誉世界。近代中国规模最大、质量最好、环境最优美的大学之一。冰心、周汝昌出自燕大。\n\n国民政府迁台后，燕大香港分部并入香港中文大学崇基学院。在大陆的资产由中央政府接管，校舍由北京大学接收。1952年院系调整，燕大停办。文、理科多并入北京大学，工科并入清华大学，法学、社会学系并入北京政法学院（今中国政法大学）。\n\n![](https://luoimg.com/u/20190912/1257584.jpg) \n\n1936,司徒雷登与学生会成员\n\n2.齐鲁大学： 诞生于1864年（清同治三年），由英、美、加拿大基督教教会筹款开办。老舍、钱穆、顾颉刚、马彦祥等学术名家先后在此执教。医科实力最强，和燕大并称“南齐北燕”。1952年因院系调整解散，学科分别并入山东大学、山东师大、南京大学等，校园旧址为今山东大学趵突泉校区，校史由山东大学医学院继承。\n\n3.金陵女子大学：中国第一所女子大学，1915年由5个美国教会联合创办。校址为南京东南绣花巷李鸿章花园旧址，首任校长为德本康夫人。1930年更名为金陵女子文理学院。日占期间，该校庇护了一万多名中国妇孺，美籍教授沃特琳居功阙伟。1951年和金陵大学合并，1952年院系调整，主体并入南京大学。\n\n![](https://luoimg.com/u/20190912/1257599.jpg) \n\n南京师范大学随园校区 明尼·沃特琳\n\n4.金陵大学：由美国基督教会美以美会在南京创办。教育家陶行知、诺贝尔文学奖获得者赛珍珠、哲学家方东美、文学史家程千帆等著名校友出自于此。第一个向中国政府请求立案并获批准的教会大学。1951年与金陵女子文理学院合并,改建为公立金陵大学。1952年院系调整被撤销建制，主体并入南京大学。\n\n5.圣约翰大学：中国首个全英语授课大学，以“光与真理”为校训。有“东方哈佛”和“外交人才养成所”之称，创下民国教育多项第一，尤其是在体育教育上遥遥领先。培育出顾维钧、宋子文、严家淦、林语堂、邹韬奋、荣毅仁、贝聿铭、张爱玲、周有光等一大批声名显赫的校友，成为中国教育史上的传奇。1952年因院系调整解散，院系分别并入华东师范大学、复旦大学、同济大学、交通大学、上海第二医学院、上海财经学院、华东政法学院，校址划归华东政法学院。\n\n![](https://luoimg.com/u/20190912/12575971.jpg) \n\n1951年，上海圣约翰大学\n\n6.之江大学：由基督教美北长老会和美南长老会在杭州创办。1952年因院系调整解散，院系拆分至浙江师范学院、浙江大学、复旦大学等，之江大学宣告结束。\n\n7.岭南大学：前身为格致书院，由美国基督教长老会于1888年在广州创办。1927年4月学校宣布停办。1952年院系调整与中山大学及其他院校合并，组成现在的华南理工大学、中山大学。\n\n8.华西协和大学：1910年由英、美、加三国基督教会的5个差会在成都开办，市民称之为“五洋学堂”。1952年院系调整被肢解。80年代改成华西医科大学，附属医院为华西医院。2000年并入四川大学。\n\n**四、支援中国反法西斯战争**\n\n1941年７月美国开始对日本实行石油禁运，当时日本98%的石油要靠从美国进口，因此几乎将日本置于死地。12月日军铤而走险偷袭珍珠港，随后美国对日本宣战。\n\n陈纳德将军招募组建美国志愿航空队，也称飞虎队，1941年8月1日正式成立。1941年12月到1945年9月，飞虎队击落和炸毁日机2600多架，击沉击毁敌舰44艘，击毙日军66700多人。\n\n中国军队装备落后，日军已经占领中国东部大片土地及东南亚各地，为打破对中国的战略封锁，美国于1942年5月至1945年9月开辟的“驼峰航线”，被称为“死亡航线”。这是二战中规模最大、持续时间最长的战略空运航线。中美双方先后投入飞机2000多架，空运物资73万吨，人员33477人，飞行总时间150万小时。在南京航空烈士公墓，葬有美国2186名美国援华飞行队队员。\n\n![](https://luoimg.com/u/20190912/12580078.jpg) \n\n陈纳德将军\n\n**五、支持中国改革开放**\n\n1979年邓小平访美，在美国的带动下，各国纷纷与中国建交。中国告别了1949以来的封锁和自我封锁，成为第三次科技革命的直接受益者。\n\n外部世界对中国产生的冲击并不仅限于物质层面，民主、法治、人拳、限政等观念，让中国人得到了新的启示，看见了新的希望。\n\n![](https://luoimg.com/u/20190912/12580098.jpg) \n\n1978念清华赴美留学生\n\n**六、支持中国加入世贸**\n\n中美建交后，美中贸易一直延续1979年中美建交后签订的《中美贸易关系协定》，对中国给予最惠国待遇。90年代两国就中国加入世贸组织的谈判达成协议，美国在2000年通过了对华永久性正常贸易关系立法，此法案2002年1月生效，维持对中国的最惠国待遇，中国政府承诺逐步开放市场。自此，中国得与世界市场对接，互联网、好莱坞大片也因此进入中国大陆。\n\n![](https://luoimg.com/u/20190912/12580168.jpg) \n\n2001年中国加入世贸，进入“世界工厂”时代，大量剩余劳动力得到施展机会，世界经济上演了十几年的奇迹。"
		},
		{
			"post_id": 65,
			"title": "转：谈谈我所知道的非洲猪瘟",
			"date_published": 1568343499.223,
			"body": "第一章：非洲猪瘟的来历\n维基百科上有详细的介绍，不赘述了，个人认为可以分二个时间段看。\n1. 2018年前 \n猪瘟的传播从1907年产生，非洲的恶劣条件进化出的病毒，1957年传入葡萄牙，花了将近70年时间一直在欧美附近内部肆虐。07年传入格鲁吉亚及俄罗斯，可能是因为西伯利亚的屏障作用，花了10年到17年才传到俄罗斯的伊尔库斯科地区，离中国比较近的地方（1000公里）。\n2. 2018年后\n  2018年8月，[中国](http://en.wikipedia.org/wiki/China)报告了[辽宁](http://en.wikipedia.org/wiki/Liaoning)省首例非洲猪瘟疫情，这也是东亚首例报道的病例。2019年4月25日，该病毒已蔓延至中国各地区以及[东南亚](http://en.wikipedia.org/wiki/Southeast_Asia)部分[地区](http://en.wikipedia.org/wiki/Southeast_Asia)。不到一年时间就传遍中国直至东南亚。\n  到底是什么原因，导致欧洲70年，俄罗斯10年，中国1年不到这样的惊人传播速率差别！首先第一条一定是知情权的剥夺，正常国家，出了这么严重的问题，当然是全面报道，尽快处理。可是我们号称控制力最强的政府，却层层隐瞒。即便是全社会讨论猪价上涨的今天，还是没有人胆敢去触碰事情的真相。比如中国的猪瘟哪里来的，目前到底死了多少头猪？后边我愿意尝试用自己知道的和接触到的信息来分享一下。\n\n第二章：中美贸易战带来猪瘟\n 作为翻墙的大众，大家基本上都大概了解猪瘟是自俄罗斯从东北传来的了，只是部分国内媒体还不敢承认。我们依然做个简单梳理。\n1.农业部的禁令：\n      2008年11月25日，国家质检总局、农业部联合发布2008年第125号联合公报，要求禁止从俄罗斯进口猪肉。公告自发布之日起执行。\n该公告称，2008年10月24日，俄罗斯联邦兽医与植物卫生监督局向总局和世界动物卫生组织（OIE）通报，在俄罗斯斯塔夫罗波尔边疆地区（Stavropolsky Kray，俄罗斯欧洲部分）2家农场发生非洲猪瘟疫情，涉及易感染动物900头，发病161头，死亡127头。2008年10月29日，俄罗斯农业与食品部向OIE报告，6月28日～10月2日，北奥塞梯—阿兰共和国（RESPUBLIKA SEVERNAYA OSETIYA）发生18起非洲猪瘟，涉及的易感染动物有家猪3224头和部分野猪，其中1472头家猪和2头野猪发病,死亡家猪1469头、野猪2头，销毁家猪9973头。为防止该病传入我国，保护我国畜牧业安全，根据《中华人民共和国进出境动植物检疫法》及其实施条例等有关法律法规的规定，公告如下：\n    一、禁止直接或间接从俄罗斯输入猪、野猪及其产品，一经发现，一律作退回或销毁处理；停止签发从俄罗斯进口猪、野猪及其产品的《进境动植物检疫许可证》，撤销已经签发的《进境动植物检疫许可证》。\n    二、禁止邮寄或旅客携带来自俄罗斯的猪、野猪及其产品进境。一经发现，一律作退回或销毁处理。\n    三、对途经我国或在我国停留的国际航行船舶、飞机和火车等运输工具，如发现有来自俄罗斯的猪、野猪及其产品，一律作封存处理；其废弃物、泔水等，一律在出入境检验检疫机构的监督下作无害化处理，不得擅自抛弃。\n    四、对海关、边防等部门截获的来自俄罗斯的猪、野猪及其产品，一律在出入境检验检疫机构监督下作销毁处理。\n    五、凡违反上述规定者，由出入境检验检疫机构依照《中华人民共和国进出境动植物检疫法》及其实施条例有关规定处理。\n\n    六、各出入境检验检疫机构、各级动物防疫监督机构要分别依照《中华人民共和国进出境动植物检疫法》及其实施条例和《中华人民共和国动物防疫法》的有关规定，密切配合，做好检疫、防疫和监督工作。\n本文转自[食品商务网],原文：[<u>https://news.21food.cn/26/403889.html</u>](http://news.21food.cn/26/403889.html)\n\n2.俄罗斯进口猪肉\n\n中国猪肉不依赖进口 俄罗斯24万吨送到中国\n\n尽管中国猪肉可能在明年出现短缺，但猪肉从来不缺少进口渠道，并且猪肉向来不依赖国外进口。2017年我国猪肉总产量为5350万吨，进口量仅为122万吨。\n\n2018年1-7月俄农业企业猪肉产量达231万吨，与2017年同期相比增长10.9%。\n\n此前，俄罗斯的西伯利亚集团已经向中国运输24万吨猪肉，足以弥补美国的缺口。\n\n俄罗斯贝加尔地区和中国东北地区已就禽类及乳制品供货检疫和兽医卫生条款进行了讨论，并准备签署相关文件。\n\n在这个过程中，双方谈到了一个重要的问题，即发展通过外贝加尔斯克—满.洲.里国际汽车通行口岸出口俄罗斯食品和农产品的问题，\n\n其中包括牛肉、猪肉、羊肉、禽肉，以及肉制品。\n\n3. 国内专家辟谣\n\n关于这个辟谣，我是不信的，欧盟防控几十年的经验，法制比较健全，怎么会突然就传进中国，分明是俄罗斯进口的可能性更高再加自己的检验不利来推脱责任。\n中国未从疫情国家进口猪肉\n\n　　中国动物卫生与流行病学中心副主任黄保续在农业展望大会上介绍，全球经济一体化，可以使非洲猪瘟24小时内传遍全世界，而城镇化速度的加快，又使野猪不断向家猪传播，二者相互作用，使全球的疫情明显加快，2015年以来，每年增加1000多起。\n\n　　四川省农业农村厅下发的《非洲猪瘟防控20问》提到，1921年东非国家肯尼亚首次确认非洲猪瘟疫情。1957年传入欧洲，1971年传入美洲，2007年首次传播至欧亚接壤的格鲁吉亚。\n\n　　黄保续说，2007年以来，非洲猪瘟传播到俄罗斯，并在高加索地区定殖。2017年扩散到临近蒙古国的伊尔库茨克，给我国敲响警钟，2018年8月，辽宁沈阳沈北新区出现疫情。\n\n　　黄保续说，社会各界纷纷猜测疫情从哪里来的，分子流行病学分析表明，引发我国非洲猪瘟疫情的病毒都属于同一类型，与东欧和俄罗斯公布的全基因组序列同源性在99.93%到99.98%之间，可以视为同一个病毒。\n\n　　但他强调，我国没有从俄罗斯等疫情国家进口过猪肉，希望大家不要听信谣言。记者了解到，非洲疫情发生后，网上一度传言我国从俄罗斯进口猪肉导致疫情。\n\n4.中国公布结果和俄罗斯的公布结果不同，贼会承认自己偷了东西吗。。\n\n2018年8月21日，《[科学](http://zh.wikipedia.org/wiki/%E7%A7%91%E5%AD%A6_(%E6%9C%9F%E5%88%8A))》（英语：Science）期刊一篇文章援引[中国人民解放军军事科学院军事医学研究院](http://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9B%BD%E4%BA%BA%E6%B0%91%E8%A7%A3%E6%94%BE%E5%86%9B%E5%86%9B%E4%BA%8B%E7%A7%91%E5%AD%A6%E9%99%A2%E5%86%9B%E4%BA%8B%E5%8C%BB%E5%AD%A6%E7%A0%94%E7%A9%B6%E9%99%A2)长春军事兽医研究所于8月13日发布的报告指出，此次非洲猪瘟首发基因样本与俄罗斯及欧盟境内的猪瘟样本高度相关[url=#cite_note-40][40][/url][url=#cite_note-41][41][/url][url=#cite_note-42][42][/url]。\n\n根据俄罗斯联邦兽医和植物卫生监督局发布的报告，中国境内的病毒遗传序列与俄罗斯境内病毒有较大差别，更有可能是由自欧盟进口猪肉引起的[url=#cite_note-43][43][/url]。且根据同机构的记录，在疫情开始的7月份俄罗斯并未向中国出口猪肉[url=#cite_note-44][44][/url]。\n\n第二章：非洲猪瘟的传播途径\n\n1. 路径（出自EFSA欧洲食品安全网站）\n**传播和传播**\n健康的猪和公猪通常会受到以下感染：\n与受感染的动物接触，包括自由放养的猪和野猪之间的接触。\n从受感染的动物摄取肉类或肉类产品 - 厨房垃圾，sw水饲料，受感染的野猪（包括内脏）。\n接触受病毒污染的任何物品，如衣物，车辆和其他设备。\n感染蜱虫咬伤。\n受感染动物的运动，受污染的猪肉产品和非法处置尸体是疾病传播的最重要手段。\n有兴趣的可以看下欧洲食品安全委员会做的视频，有中文字幕。\n[<u>https://www.youtube.com/watch?v=eyQ4t1wHl2M&t=17s</u>](http://www.youtube.com/watch?v=eyQ4t1wHl2M&t=17s)\n\n2. 为什么传播这么快\n第一是运输传播。\n  根据前面的传播路径，我们大致知道，简单接触就会传染。所以拉猪贩猪，还有异地调猪都会传染，\n 第二是水源传播。\n这个我觉得才是主要的，有问题的猪肉进入家庭，虽然高温后可以消毒，但是做菜清洗阶段就能流入下水道传播。同样的水传播，东南亚的传播跟几千公里长的澜沧江（湄公河）关系恐怕很大。\n\n3. 能不能吃\n  不能吃，虽然暂时没问题，但是不要忘了非典和H1N1（禽流感）,最初都是动物身上的病毒，但是病毒有强大的进化能力，会不断寻找新的宿主繁衍下去。\n\n第三章：非洲猪瘟的现状\n\n1. 存栏量（数据出自中国产业信息网）\n2017年我国生猪存栏量为43325万头，2016年我国生猪存栏量为43503.7万头，存栏量上年同期下降0.41%。\n省市2016年生猪存栏量：万头2016年肉猪出栏量：万头\n北 京165.31275.34\n天 津190.64374.79\n河 北1819.013433.90\n山 西449.68748.86\n内蒙古640.00909.23\n辽 宁1406.472608.83\n吉 林948.071619.34\n黑龙江1275.981844.74\n上 海100.06171.11\n江 苏1690.562847.27\n浙 江573.831169.24\n安 徽1468.592874.93\n福 建983.181720.52\n江 西1617.153103.10\n山 东2764.094662.04\n河 南4284.106004.56\n湖 北2432.164223.61\n湖 南3936.635920.90\n广 东2076.053531.94\n广 西2216.123280.12\n海 南385.49529.58\n重 庆1395.582047.81\n四 川4675.906925.37\n贵 州1498.161759.35\n云 南2575.403378.56\n西 藏37.3818.31\n陕 西827.931142.86\n甘 肃580.21670.26\n青 海123.60138.34\n宁 夏68.9696.15\n新 疆297.44471.01\n合计43503.7168501.96\n一般一头猪80公斤出栏，我们得出生猪猪肉的大致产量是5480万吨，至于存栏量和出栏量的差别，一头猪的周期是100多天，所以出栏量比较多。\n（在我国，由于猪种类型及经济杂交组合较多，各地区饲养条件差异较大，因此，育肥猪的适宜上市体重也有较大不同。一些地方早熟品种猪及其杂种猪在75～85千克左右出栏；瘦肉型良种公猪与我国的培育品种或地方品种母猪杂交的二元杂交猪，适宜上市体重为85～90千克；以两个瘦肉型良种猪为父本、一个地方品种为母本的三元杂交猪的适宜上市体重为90～100千克；而三个瘦肉型良种猪杂交的三元杂交猪的适宜上市体重为100～115千克。\n）\n\n2.消费量 4500万吨/年 （数据出自中国产业信息网）\n我国猪肉消费需求将逐步进入“量稳质升”阶段。一方面社会猪肉需求总量下降幅度收窄。从消费终端来看，近年来猪肉消费量呈递减趋势，从 14 年顶峰时期的 5719 万吨下降至 16 年的 5498 万吨，降幅达到 3.87%。但整体降幅收窄，16 年同比下降 1.24%，17年同比下降 0.08%。与此同时，市场需求持续疲软，节假日对于猪价的拉动作用明显减弱。\n根据前面生猪产量，再搭配庞大的冷库库存，我国猪肉是完全自给自足的。\n\n3.每年进口量\n从全球贸易来看，全球猪肉出口量为700多万吨。其中，中国每年进口100多万吨。但在这100多万吨的进口中，从美国进口的猪肉占中国猪肉进口总量的比重并不高。\n2. 我国到底死了多少头猪。\n我们来曲线救国一下（n天前计算的），\n越南pigsite网\n[<u>https://thepigsite.com/news/2019/09/vietnam-officials-announce-4-7-million-swine-fever-death-toll</u>](http://thepigsite.com/news/2019/09/vietnam-officials-announce-4-7-million-swine-fever-death-toll)\n越南从6月份的200万统计直到最近几天的死亡统计440万头猪，缩减18.5%，剩余2220万头。\n希望我国最好也就是类似比例，存栏4.3亿头，不多，也就8000万头吧。小小的恶意揣测一下。我知道的几个重灾区就已经1.5亿头存栏量了，光这几个省按90%来算，不敢想象。然后复养失败是更大的问题，做不好防护措施，补栏失败那是必然的事情。\n省市2016年生猪存栏量：万头\n湖 北2432.16\n湖 南3936.63\n广 西2216.12\n江 苏1690.56\n四 川4675.90\n（最近6天内的新闻）不过关于数量，最新几天终于国内有点数据了，我这里有一个农业农村部对400个县定点监测的数字。7月份生猪存栏环比下降9.4%，同比下降了32.2%，同比就是比去年同期，环比就是比上个月，意思是形势孩子恶化，简单的算下来，那也将近2亿头没了，可是这么大的事情，就是一笔带过的新闻，也拖了这么久才发布出来。哪像包子和东方明珠，每天都霸版。\n最后我想说点题外话，一是审查机制的可怕，这是自下而上的精神阉割，当每个人都相信自己发文会被删除的时候，那么他就干脆不发了。二是因为我们被教育的太好了，即便它撒了无数谎，撒一次谎一个人就不可以信任了。提到降准的时候，每个人都知道不能相信政府的说辞，基本都认为钱不会向政府希望的那样流入民企类的实体经济，一定会流入楼市和民生消费领域。可只要一提到另一些事情（比如民族情绪这个开关），我们就又开始无条件相信了。国与国之间的利益博弈的确不假，但是拿冷战思维那套来忽悠调动民族兴趣完全是无稽之谈。我们这个民族活的真是可悲，我想，虽然已经9012年了，但59年的三年自然灾害再发生一次，我们恐怕也会默默忍受，根本不会反抗，甚至还要推到境外反动势力的头上去。"
		},
		{
			"post_id": 63,
			"title": "香港到底在发生什么，他们为什么上街，什么是反送中，一名大陆青年对身边朋友的解释",
			"date_published": 1568012900.497,
			"body": "![](https://miro.medium.com/max/1616/1*S48agFfrDYyeebdqzThQwA.jpeg)\n\n![](https://miro.medium.com/max/60/1*5FUH6Ri34hUQ-a1m2pWKZw.jpeg?q=20)\n\n![](https://miro.medium.com/max/1616/1*5FUH6Ri34hUQ-a1m2pWKZw.jpeg)\n\n![](https://miro.medium.com/max/60/1*unZtAZhnpxu1er2L9TSf_Q.jpeg?q=20)\n\n![](https://miro.medium.com/max/1616/1*unZtAZhnpxu1er2L9TSf_Q.jpeg)\n\n![](https://miro.medium.com/max/60/1*OlmDRd_aCC8dUBx7TcF3Fg.jpeg?q=20)\n\n![](https://miro.medium.com/max/1616/1*OlmDRd_aCC8dUBx7TcF3Fg.jpeg)\n\n![](https://miro.medium.com/max/60/1*JeZ_TMKa50AYg-_f0Yb5Jw.jpeg?q=20)\n\n![](https://miro.medium.com/max/1616/1*JeZ_TMKa50AYg-_f0Yb5Jw.jpeg)在大陆过去一周不断的武力镇压恐吓下，8月18维园和平集会仍有170万人参加，以上图片由我当天于维园天桥一角拍摄。以下内容写于，8月18日大游行之前，818游行未计入其中。\n\n一次下班和同事顺路一起坐公交车回去。本来两人都各自在看手机，突然他问我，香港现在到底怎么回事，感觉他们处在水深火热当中，他们为什么上街，我听说好像是反对死刑还是什么。我听到他居然对这个议题感兴趣，我也很激动，就在车厢里开始尽量压低声量讲起来。然后根据身边一些朋友的疑问，写下这些文字。\n\n香港人之所以上街抗议，导火索是去年香港一对情侣在台湾的命案，男主将女主杀害潜逃回港。但按照香港基本法的属地原则，在哪里犯法在哪里受审，香港司法系统无法以凶杀案对其定罪，只能以男主回港盗刷被害女主银行卡定盗窃罪。\n\n因香港和台湾之间无逃犯移交条约，无法将案犯男主交给台湾受审。所以香港特首林郑政府以此为由，觉得这个是法律漏洞，要修改疑犯引渡条例，将中国，澳门和台湾纳入可移交国。\n\n其实香港和西方近20个国家比如英美加等民主法治比较健全的国家都有签署疑犯引渡条约，就是比如香港人在英国犯了凶杀案逃回香港，英国政府可以通过司法程序向香港法庭申请将嫌疑人移交给英国审判。这在正常的有独立公正司法的主权国之间没什么问题，因为按照国际公约，不会出现移交疑犯后，出现刑讯逼供，酷刑或是上电视逼人认罪这种不人道的情况。\n\n香港政府之前的引渡法案不适用于中国大陆，这次说因为这个命案的原因要修改引渡条例，将中国加入可以进行疑犯移交的国家名单。\n\n但被香港民众质疑，林郑政府是以这一个悲惨的命案为借口，来强行修例（简言之就是逃犯引渡条例，）因为在这起命案的过程中，台湾方面三次要求香港政府进行司法合作，都没有获得回应，而之后在香港政府开始进行逃犯条例修订时台湾方面因为香港修例的前提是一个中国原则，因此拒绝和香港进行继续对话，之所以拒绝也是因为觉得中国没有法治。香港大律师公会也曾建议港府修订《刑事司法管辖权条例》，让疑犯可在香港受审，未获政府接纳，而且民主派反对修例的人也以日落条款（临时法案，就是可以针对这一个特定的案件出一个条款，嫌疑人被移交之后条款失效）作为提议，来解决这种大陆所宣扬的，香港会成为逃犯天堂的问题，但也被香港政府拒绝。\n\n反而林郑政府破常规的将修例的公众咨询期缩短到只有20天，比正常时间短了一个月，而且急匆匆的要在立法会进行三读辩论，要强行通过这个条例，这个条例进入立法辩论程序之前，反对声音就一直不绝于耳，从体制内部，一直到学者，律师公会，最后蔓延到全社会都在强烈反对这个逃犯条例的修订。\n\n但是政府仍旧一意孤行，不顾民意。（在香港一个政策出台之前有个至少两个月的公众咨询期限让大众知道。然后有代表民意的立法会三次大讨论。代表社会各界别的议员。专家学者都会参与辩论讨论政策的利弊和是否合理等等。最后才决定这个政策成不成为法例推行，这就是民主，就是公民拥有真实存在的平等投票权，可以直接影响国家政策法规的制定，反过来这些各种成文的政策推行的时候又与每个人的切身利益和未来息息相关，而不是像我们大陆一样，人大只有举手赞成的权利，我们普通人连一个县长的直选都没经历过，更直接的例子就是最近大陆这边直接突然落闸剥夺我们可以自由行台湾的权利，当天粗暴的给一个通知，第二天就实行，没有任何商量的余地。）\n\n所以这就是香港全体市民一开始反对的这个特首林郑提议将中国加入可进行逃犯引渡国家的条例，就是如果大陆政府觉得某个香港市民有罪，只要表面证据成立，就可以向香港政府申请将人进行拘留移交给中国大陆，而无需经过立法会的事实证据审查，所以这个逃犯引渡条例市民也通称送中条例，而我们大陆人过去旅游能看到示威者举牌写着反送中，就是反对将中国加入这个逃犯引渡名单里。所以通称反送中。所以反送中，并不是反中国的意思。\n\n大陆这边好多人说，如果没有这样的条例，香港不就成为逃犯天堂了吗，在大陆犯法杀人，逃到香港就好了（逃犯就算逃到香港也无法生存，没有香港居民证，而且就算被抓到也会面临严厉的刑罚，就算像一开始出现的类似那个情侣案，也可以通过日落条款针对个案移交程序解决，但不包括中国这种情况），但事实是，香港回归这二十多年，一直是是世界上最安全的地区之一，每天大陆这边的人排着队想移民香港，所以大陆媒体宣称会成为逃犯天堂只是观点，并不是事实。\n\n所以说到这里，就需要解释，为什么香港和别的地区可以进行逃犯移交，为什么和中国就不行？是歧视中国吗？真不是歧视中国，因为中国尽管表面上大肆宣传社会主义核心价值观，公平公正民主法治贴得满大街都是，但事实却是一个没有法治的国家，有法制，但没法治，就是说有立法，但是没有独立公正的行政司法审判程序，况且立法过程也没有听取广泛民意。\n\n随便举一些近年来比较大的例子，比如2015 7月9号，简称709律师事件，政府全国范围大肆抓捕为弱势群体维权的律师，前前后后抓了三四百名，好多都是未审先判直接失踪，有的甚至关押至今在狱中遭受非法酷刑，比如王全璋律师。\n\n比如因给国家提建议而被诬告煽动颠覆国家政权罪的，诺贝尔和平奖得主刘晓波先生，2017年就在自己国家的“牢里”死去（因给国家提建议，因言获罪被判11年，在刑期内患癌，生命的最后半个月保外就医，但仍在医院被监控限制自由，被政府拒绝去国外接受更好的医疗救助，最后在医院去世）。比如2017年台湾学者李明哲来大陆旅游访友，被大陆政府以言论定煽颠罪关押至今，15年的铜锣湾书店事件，大陆公安越境执法，将店员私自捆绑回大陆关押，刑讯逼供上电视认罪。2019年，最高院法官王林清需要上电视来自证有罪，最近的湖南一中学教师举报豆腐渣校舍工程，被抛尸操场16年公正缺位。更有新疆因宗教信仰自由而被非法关押的上百万新疆人的集中营。\n\n这只是随便列举的事例，更常见的我们大陆人都知道，发生了什么事，要尽量造舆论，有舆论问题才有解决的可能。在正常民主法治国家，发生什么案件，不需要靠舆论，而只需要根据正常司法程序独立审判就可以有个相对公正的结果，之所以大家都知道需要靠微博舆论也是因为我们心里其实都知道，这个国家的司法不公正，人治特权横行，冤假错案一直没断过。\n\n香港没有防火墙，没有像大陆这样的中宣部统一言论审查，没有删帖封号，香港有独立的媒体报道，他们对大陆非常糟糕的法治环境看得一清二楚，所以当然不愿意这个送中条例通过，因为能看到这篇文章的朋友都知道，我们连最基本的免于恐惧的权利都没有，正常的言论都害怕被举报喝茶拘留，所以香港人当然害怕，这个送中条例一旦通过，将会人人自危，打个比喻。\n\n比如林夕或者张敬轩，写了一首关于历史或者讽刺某个贪官的歌，如果那个贪官拥有大权，就可以说林夕煽动颠覆国家政权罪，尽管条例里说明，政治犯等不会被移交。但是37项可以移交的罪名里，除了杀人强奸等重罪外，也包括贿赂贪污，盗窃，挪用公款等经济罪。在中国有个词叫莫须有的栽赃，一旦你说了什么大陆不喜欢的话，或者举报了比如特首林郑贪污 ，林郑无法在香港的法制环境下报复你，就可以通过大陆那边合作，给你栽赃一个罪名，表面证据成立就可以移交大陆审判关押，而这个可能产生躲猫猫死等各种不人道的事情 。\n\n这样会导致什么后果的呢，因为就算你没有犯罪，你正常的写书，拍电影因为尊重历史史实说了共产党不喜欢的话，中国政府就可能给你定罪抓起来，比如经商环境，之所以大陆很多公司喜欢去香港上市也是因为看重香港良好的法制环境有公正的监管程序，而一旦这个条例通过，商人就会顾忌，怕被随便恶意竞争搞个经济罪就被抓回大陆甚至被冻结资产而会从香港撤离企业资本，还有更常见的就是必须站队听中央的话。\n\n所以这个条例一旦通过，媒体不敢自由的报道，公民不敢正常的尽到监督政府的职责，这样将导致，社会全面的从经济教育法治道德的坍塌，最终也会变成像大陆那样，毒奶粉毒疫苗毒雾霾，红黄蓝幼儿园幼女被强奸，城管强拆，拖欠工资得不到解决，遇到纠纷很可能法治不彰，上访无门，人与人之间再无信任感。\n\n这就是为什么全香港人都要站出来誓死反抗这个条例，他们不是在闹事，不是吃饱了闲着，而是为了他们自己的未来，为了下一代的未来而抗争，更不是像我们大陆很多人固有观念所说，人们上街只有利益，而是对他们来说，一个自由公义的社会制度，一个让人能看到未来的，只要努力公平竞争就可能改变未来的社会制度同样重要。\n\n我们大陆人现在还可以去香港打疫苗买奶粉，买正品药妆，但如果香港人这次不抗争政府强制推行的恶法，香港之所以成为世界三大金融中心之一，其现代化程度，发展程度，公民社会的成熟度，位于世界前几名的民主法治制度根基就会被摧毁，如果现在不抗争，未来香港人要去哪里买安全的奶粉？所以香港人不是带着恨而上街，而是带着对下一代对那片土地深深的爱而上街抗议，（这里得提一下，香港并不是我们大陆一些人口中所说，香港处在水深火热当中，香港的穷人生活并不差，无论全民医保公立医院的超低费用，还是12年的免费教育，公共房屋政策，都要比我们大陆好太多）。\n\n香港人自6月9号的百万人上街反送中，再到6月16号的两百万人再次上街反对送中条例要求政府回应诉求，再到后来721警察和黑社会勾结无差别暴力攻击示威者和普通市民，直到现在，迫于无奈，为了倒逼政府回应民意而占领机场，在这个过程当中，有五位年轻市民因政府无视民意警察滥权暴力而绝望自杀，近千人被不当抓捕，在这个过程中，和平理性的示威者在只有纸皮，矿泉水瓶，雨伞，口罩的情况下，要面对全副武装的防爆警察的不断开枪，无数的胡椒喷雾，烟雾弹和棍棒的打击，在正常的游行申请程序通过的情况下，要面对防爆警察的故意阻拦和清场抓捕，还被政府无理定性为暴徒。\n\n要知道在正常的民主国家，和平示威游行表达政治诉求和表达对政府的不满，都是公民的最基本人权之一，是再正当不过，因为政府存在的唯一目的就是服务和提升民众的福祉，政府所有运作的经济来源也都来自公民的纳税。本应当听取民意的政府，现在却罔顾民意，甚至通过警察的过度暴力，警黑勾结，对市民开枪，滥用滥捕，在巨大的民意下（这两个月，除了两次过百万的大游行，中间还有不间断的，社会各界别，律师，医生，大学，工会，商会，公务员，等几乎所有界别群体都出来集会反对政府，要求回应民意，所以大家才有那句，现在除了香港警察和黑社会支持林郑政府，全民都在反对政府，要求政府回应民众诉求）。\n\n这个有点像什么呢，拿个大陆的例子作比喻，比如前阵子的武汉阳逻事件，民众因不堪忍受垃圾场焚烧厂建在离小区太近，导致不断孩子得癌症和呼吸疾病，当尝试和政府和平对话，政府却不回应不给解决办法，然后民众知道实在政府不愿沟通，一直躲着，没办法只好去上访，但是上访却被拦截监控，最后没办法只能上街游行抗议，但是一上街游行，政府就开始回应了，说你是是非法集会说你闹事，然后，派一批城管和警察便衣，渗透到抗议群众里，带头纵火，打警察，然后就可以说这些人都是暴徒，就把这些人都抓起来，而全然不回应，为什么他们要上街，是谁把他们逼上街的。\n\n香港政府就是通过这样的冷暴力坚持不回应民意，不去解决问题，而是去解决大肆抓捕提出问题的人，以及通过热暴力，通过无数的，毒烟雾弹，可以致死的橡胶子弹，打到爆头的警棍，以及动用黑社会，派警察和黑社会伪装假扮示威（警方在记者会已承认伪装成不同身份示威者），扔国旗扔汽油弹等方式来栽赃分化示威者，来企图扭转民意。\n\n如果我是示威者，在这样无耻至极，毫无人性已经变质的警察面前，我真的是很难保持克制，真的保不准会冲动，但是香港的示威者真是好和平友爱，每次游行完，还主动把路面清理干净，就算在流氓政府继续无视民意的情况下，冲进立法会表达诉求也仅仅是有限的和有目的的进行破坏，仅仅碎几块玻璃和墙面涂鸦，还对文物进行保护，以及拿汽水还放钱，读完宣言就撤离。而之后的，每次集会示威活动，示威者都是和平集会表达诉求，而每次出现冲突也都是警察阻拦游行导致冲突升级（尽管有人批评占领立法会的行为不当，但是当一个政府无视民意，立法不再考虑民众的意愿和权益时，政府和立法机构已经脱离了其根本目的，已丧失合法性）。\n\n但是呢，我们大陆好多人好像对暴力有误解，只看到示威者的一点点暴力就愤怒谴责，况且这里面还有不少暴力是卧底的栽赃，却看不到警察作为公权力，在掌握着强大且完全不对等武力的情况下，本该更加克制谨慎，却完全不作为成为罪恶的帮凶（721元朗黑夜，放任黑社会白衣人对市民街坊，孕妇的无差别恐怖袭击，报警电话断线，警察看到冲突故意走开落闸警署门）。\n\n暴力分没有节制滥杀无辜的暴力，也分自卫保护自己和同伴对不义之事进行还击的暴力，我们不能只要求和平的示威者是完美受害者形象，毕竟在如此巨大的公民运动面前，没有大台，没有领袖，没有统一的行动标准，完全是像你我般普通的市民自发组织参与，很难说不出一点小差错。况且还用双重标准对警方的过分暴力视而不见。\n\n这里需要说我们大陆很多人对香港的这段时间发生的事有很大的认知偏差，这当然不能怪民众，而是在共产党管控下的舆论攻势在故意煽动大陆人和香港同胞之间的仇恨，大陆没有言论和新闻自由这个大家也都知道，而且大陆看似有很多不同媒体，但其实所有的媒体都姓党，只有一种声音，稍有和官方不同的论述就会面临删帖封号和刑事拘留，这里随便举几个最近关于同一件事在大陆是如何黑白颠倒报道的。\n\n比如大陆这边报道的关于新城广场那天的断指事件，大陆这边的报道掐头去尾，不讲事情起因经过，却只着眼于示威者如何暴力残忍用钳子将警察的手指剪断。但事实是第一个人家是被警方多人围堵扣眼下（警方无委任证，且过度暴力下，属于自卫），迫于无奈用牙齿咬，几个事实，第一个是没咬断，第二个不是大陆网络广泛流传的断指，那张图断的是中指而是实际受伤是无名指，第三个那张图更不是当事人的手，第四更不是用钳子夹断，当时视频中是警棍。而大陆这边除了这样选择性的移花接木黑白颠倒报道外，对当天警方的滥权行为，比如擅自冲进私人物业滥捕滥打人的暴力，完全不提，本来完全可以避免的冲突，因警方围堵不让示威者上地铁离开而升级。\n\n其他的还有机场老人事件，事件起因是老人下飞机在离境大厅先推撞连农人（类似大陆熟悉的角色扮演在身上贴满心愿memo贴纸，站着不动，当时事主已当场报警)，然后老人在离开去公车站的途中，仍旧将沿途的示威者的标语撕扯到地上，知道情况的示威者，想阻拦老人离去，被老人推跌在地，更多的人起来想阻拦老人离开，希望老人道歉，不要逃走，等警察来处理。这个过程一直没有暴力，只是年轻人比较多来阻拦老人离开，因为老人无理在先。希望老人道歉，但是大陆呢，不讲原因，只拿一段示威者阻拦老人离开的那段视频，就说香港暴徒群殴老人。\n\n另外还有最近更无耻的就是墙内媒体完全黑白颠倒，说谎造假张口就来，事实是警方开枪违规直射一名医护人员，导致女士右眼永久姓失明，墙内却报道成是示威者同伴自己人把自己人眼打瞎，就这样在全球记者云集香港的情况下，罔顾事实，造假新闻，煽动不明真相的群众对香港的仇恨。\n\n另外最近机场打所谓环球时报记者事件。起因是因为付国豪穿着记者的马甲拍示威者的正面照，当被问及身份时却说自己是游客，而且没有佩戴记者证。示威者经历过之前不受控制的警暴，以及警黑勾结，将示威者眼打瞎，警察在将人制服的情况下，继续殴打泄私愤，将市民视为敌人，以及政府指使纵容乡黑和大陆人过港将示威者砍到见骨，还有通过监控画面滥捕示威者，在这样的背景下，示威者是有合理理由怀疑你拍我的面容，质疑你是警方卧底或是大陆特务的。\n\n而之后的证据刚好印证了示威者的猜疑，从他的随身背包搜出，一件黑衣，一件撑警蓝衣。他可以随时混成示威者和记者身份，在需要的情况下还可以装。成撑警人士所以示威者才将付国豪围堵，然后绑起手脚，进行质询，在这个过程中，有无法控制情绪的示威者，用手，雨伞，示威板，矿泉水瓶短暂打了他，但很快被旁边的示威者阻止，并围成人墙，对付国豪进行保护，并一再呼吁示威者不要再打他，并快速叫来医疗队为其清理检查伤势，最后护送上救护车离开。相对于警方和黑帮的暴力程度，这也叫暴力吗？可是墙内的所有报道只强调记者正常采访被暴徒殴打，强调他支持警察，最后是警察克服困难进入机场营救了他，可是，在纽约时报这连续全程记录一个小时的过程视频里，毫无警察的踪影，反而是顾全大局的示威者和医护人员在保护他。\n\n当然单看个别示威者在机场将人捆绑并搜身是不对的，但如果能了解这样的背景，我相信大家都能理解示威者的愤怒心情。\n\n这里顺带提一下，有大陆朋友问，如果示威者没做错，为什么需要带口罩，这真是因为完全对事件毫无了解就下的判断，因为，香港警方烂捕滥权。而且到处用摄像头秋后算账，所以示威者戴口罩，一个是为了防被拍被秋后算账，一个是为了避免吸入警方的催泪毒雾保护自己，但是也有不少人不怕警察指控不带口罩，另一方面，为什么示威者戴口罩都要指责，却看不到警察过度暴力滥权，为了逃脱指控，为了保护自身安全，不是连委任证警号都藏起来？警察做坏事也怕记者拍，也戴遮目镜，那你怎么不问，警察怕什么。\n\n还有一些朋友说，他们都是收钱去游行的，对，确实报道也有证据显示有人收钱，但那些证据显示收钱的人是撑恶警的，因为警察各种滥权暴力，失掉了民意，没有多少人支持。所以才花钱找一些人来参加撑警集会，然后将报道发回大陆对民众进行欺骗煽动仇港情绪，而且这些被钱买去参加撑警集会的人，是没有真正立场的，所以一结束就将手持国旗随便扔进垃圾桶，堆到满地都是。\n\n（撑警集会有记者现场采访视频，从现场回答来看，来撑警的群众完全对事件不了解，因为很多都是亲中建制派联合同乡会通过，现金，购物券等，从广州深圳赴港租来的大爷大妈。更有人拍到撑警集会当天结束后，有团体在港铁金钟站附近给人群派钱。更有建制派撑警议员何君尧在公开场合宣称有大把钱派等。好吧肯定有朋友说这些我都没看到，我不信。那反过来想，如果真像大陆和香港亲共媒体所说，那些出来反送中和平示威游行的人都是收钱的，那谁有如此大的资金量派钱？一人1000元的话（香港人平均日工资大概1000左右，所以1000元并不多，对香港人并无太大吸引力，反而包车接送对大陆深广两地整天闲着跳广场舞的大叔大妈更有吸引力），一百万人就是10个亿，两百万人就有20个亿，如此巨大规模的资金量谁能够拿得出？又能避开金管局的监管？\n\n而且还不只一次，就算拿的出又怎么派发？转账吗？会被记录追查，现金派发？那得多大的卡车才能装的下，又同时躲避全港警察的发现？况且自6月12号后，警方发射大量可致命的橡胶弹布袋弹毒气弹以及联合黑帮，将大量示威者打到头破血流，甚至将一名医护人员打爆眼球至失明。将腿砍到见骨满身是血，不仅仅是一线示威者是被这样对待，后方的示威者照样面临警黑的暴力殴打以及一旦抓住将面临3 - 10年刑期的暴动指控，稍微想一想，我觉得都不会相信和平的示威者是收了钱才参加游行的说法，就算给你10万块，打瞎你一只眼，或者坐10年牢你愿意吗？只有对公义自由的坚持，为了守护下一代的未来，对良知的恪守，这才是让如此多的香港人在明知可能遭受如此巨大代价的情况下，却仍旧勇敢站出来。\n\n还有人说，既然钱买不动，那肯定是受煽惑，要知道整场运动的不只是年纪小的中学生，更有更广泛的。大学生，大律师，公务员精英，大学教授，医生，飞机师等等，几乎所有界别参与（并不像大陆一些媒体所说，参加的人都是失败者），难道所有人都被煽惑洗脑？既然如此好被煽惑，香港政府在掌握强大宣传机构和资源的情况下，为什么不能煽惑港人对林郑大喊永远坚持林郑的领导林郑万岁？反而出来反对林郑政府？如果真的这么好被洗脑煽惑，港人这么没判断力，香港的教育为什么还能在世界排前三？如果香港教育培养下来的都是一群很容易被洗脑的人，为什么我们大陆的学生挤破脑袋想去香港上大学？还有说是被美国利用，背后美国在支持，如果真是美国政府在支持，示威者需要用纸皮，保鲜纸，矿泉水瓶，普通的安全帽，雨伞，来对抗全副武装的警察，让自己头破血流？\n\n而大陆媒体还怎么抹黑宣传呢，说港独领袖黄之峰会见美国政府官员，背后有美国政府支持，被境外势力利用。第一个黄之峰不是这次运动领袖，这次运动没有领袖，没有大台，因为要是有领袖早就被政府打压掉，然后群龙无首，运动就会终止。之所以还一直持续，是因为港府自始至终罔顾民意，而香港又是世界上公民社会发展成熟度最高的地区之一，绝大部分公民都觉得社会政治参与极为重要，因为政治政策会影响到每一个人的未来，与切身利益攸关，所以才要为自由公义站出来抵抗暴政。另外黄之峰的政见，自始至终都是主张在一国两制框架下希望中央兑现承诺给予港人高度自治权，而不是香港独立。而会见外国政府官员，也只是因为呼吁国际社会不要继续卖武器给香港警察暴力镇压和平的示威者，以及向外国记者政府议员等解释香港发生了 什么事，呼吁国际救援。香港是国际金融中心，有大量外国人在此定居工作生活，说有境外势力参与是很荒谬的，境外势力这个词本就是中共的政治词汇，就像港独一样被污名化。\n\n所以网上有段流传很广的话“在某些人眼中，抗争者是：一定是收了钱；如果你没有收钱，一定是被人煽动；如果你不是被人煽动而是自发参与，一定是借机发洩的废青loser；如果你不是废青loser而是事业有成，一定是受外国势力指使；如果上述统统不是，你一定是抽水博出位。因为，在他们的认知中，人做事，只会因为：收了钱、被人煽动、借机发洩、受人指使、抽水博出位。在他们的脑中，人类不可能独立思考，也不会为良知做事，正义感更是不存在的，因为，他们正是如此。”\n\n这里还得说个常识，就是警察并不所有的时候都是正义的守护者，警察也有可能做恶，被政府高层为了一己私利，而沦为打手和政客的政治工具。打个比喻，就像希特勒时期的纳粹德国，那时候的德国警察，为了希特勒的个人统治，对全德国人进行白色恐怖镇压，监控。这个时候警察是不是应该支持呢？我想你肯定会判断，这个时候，警察已不是正义的化身，而是披着正义外衣的打手\n\n以上我提到的几个事件都有完整视频记录，现场图片，一线记者的报道，如果有一直关注香港事件的发展可以很容易就找到这些证据。但是在墙内因为只有一种官媒的声音存在，而且一旦涉及香港事实事件的图片文章视频都无法发送出去。一个朋友问我，你怎么判断你看到的就是真的，但是你有没想过，政府为什么不开放防火墙，为什么不让人看到跟他不一样的信息。如果他没做假，为什么怕跟人对峙，就是说如果没有防火墙，你说你是对的，别人说他是对的，那好，大家摆出证据，让人自己判断就好。而现在中国政府反而，只许他自己说话，不许别人说，那如果他做假呢。\n\n人类有理性判断思考的能力，在一个有言论和新闻自由的环境下，有对比，有不同的观点碰撞，可以看到不同的证据，组成证据链。然后只需要根据自己的理性良知常识就可以得出判断。就像法庭上律师断案一样。如果否认这一点，如果说这社会上不存在真相真理，人们看不到事实，那就是否认人类的理性和社会进步的可能。\n\n再提一下我们大陆好多人恨得牙牙切齿的侮辱国徽事件，说下我对侮辱国徽的看法。\n\n首先国家不可类比成母亲，国家更不是母亲，人们在成立国家之前本就是自由人，可以自由劳动生产言论保有私有财产，成立国家的目的本就是为了更好的保护提升这些本就在国家成立之前就有的权利，自己的幸福生活和劳动所得不是国家政府的恩赐（反而政府是人民纳税的钱供养的），而是自己辛勤劳动所获，所以说人没有爱国的义务，就像你说小区业主有爱物业的义务，这样不很荒谬吗，之所以人们也会爱国，是跟爱自己的亲人朋友爱自己的家园一样，是一种自然而然的情感，你对我好，你处处保障我的权利为我提供便利我当然会爱你，而不是强迫别人去爱。这里说的国，具体可以说成这一国的执政党和政府以及他的象征物国徽等等。当这个国徽的代表是一个残暴政权呢，比如希特勒治下的纳粹德国，纳粹也有国徽。国徽只是一个符号没有任何意义。就像一枚戒指，如果是一个很爱你的男生送给你，你就非常想守护它，如果是一个负心恶心渣男送的，你可能立马就想踩碎扔垃圾桶。\n\n而之后的将国旗扔进海里事件，据说也怀疑是警方卧底（后续我还未关注）知道来源的朋友可以帮告诉我。\n\n所以这里就要解释，为什么曾经东方之珠的香港会在两个多月的时间里变成今天这样。根源是这些示威者造成的吗当然不是，示威者只是提出问题的人，是警察造成的，是香港政府造成的吗，当然可以说是香港政府一手造就现在的混乱局面，问题也非常好解决，只要政府回应市民的五大诉求，秩序就可以立马恢复，但最根本的原因是中国政府，中国共产党造成的。其实最开始只有一个诉求，就是要求撤回送中恶法，另外四个诉求是在运动中产生，具体是，1。立即撤回送中条例（林郑政府玩拖延战和文字游戏，用寿终正寝来代替撤回，不具法律效力）2。撤销对和平示威者的暴动控罪（警方滥捕很多人）3。撤销政府对和平爱港运动的暴动定性4.成立独立调查委员会追究警队滥权5.立即实行真双普选。\n\n知道了香港人抗争的这个五大诉求后，就知道，他们根本没有要求港独，根本不是大陆宣传所说他们上街抗争就是为了港独，港独这个词本身一个政治词汇，被大陆政府赋予内置了一个贬义的含义，真是别有用心，是用来刺激煽动大陆人和香港同胞之间的仇恨的。\n\n再多说下就算港独，为什么我们一听到香港少数人说要独立就不假思索的如此愤怒，为什么我们喜欢独立自由的职业，喜欢独立音乐人，独立作家，如此偏好独立这个词，却对港独这个词如此敏感，就像一个不幸的婚姻，我觉得与你合不来和你生活在一起不幸福，想离婚，去追求自己想要的生活，为什么要受到指责？\n\n这里就想到，每次游行都看到有个别人举着英国旗，怀念港英政府时代，这一点大陆政府难道不是更应该反省自己，为什么香港回归20多年，他们还是觉得还是在港英治下，更自由更有人权和法治？\n\n另外之前大陆流传的文章写关于香港人在英国治下是二等公民只是观点不是事实，而且当时是周恩来阻拦英国给予香港人民选议会的权利。\n\n为什么我们非要抱着狭隘的民族情绪和所谓天朝大国观念不放，为什么香港人一提到半点说要独立，你就扬言说，直接坦克军队打过去接管？这样是不是更像法西斯和侵略者，而不是手足。\n\n如果我们认可每个人都有命运自主的权利，都可以自由追寻自己想要的未来，那么一个群体一个地区同样有天然的权利可以命运自决。是否选择独立那是香港所有人自己的选择，我们大陆人为什么要横加干涉，我们为什么不能发自内心的祝福他们，只要他们拥有自由和人权能够幸福的生活，他们叫中国香港，还是香港，还是英国香港，这真的不重要。\n\n更何况他们不是要求港独，从开始一直到现在的诉求里面也没有港独，香港人一开始也都说自己是中国人，之所以会慢慢的港独的声音会多一点（不是主流） ，也是被中央政府所逼，是中央政府一步步干涉香港法治打压香港的自由空间。不遵守“中英联合声明”承诺的保持香港资本主义的生活方式和文化法治，港人治港高度自治50年不变，一方面承诺却又一方面反悔，通过买票操控选举，安插地下党员当选各区立法会议员，指派香港特首，还DQ（撤销）高票当选的民主派立法会议员，一步步夺走本该属于香港人所有的权利。香港基本法写明，香港可以循序渐进达到双普选，普选特首和立法会议员，但中国政府几次承诺兑现却又反悔。\n\n试想如果真能像具有法律效应的“中英联合声明”给香港人真正的高度自治的权力，不干涉他们，政治经济文化自由发展，谁会想去独立呢。之所以有想要独立的声音，有反对中国的声音出现（其实香港人是反对邪恶的中国政府和共产党，而不是普通中国人），也是因为中央不断通过林郑傀儡政府，不断压低香港人的自治和应有权利。\n\n当香港人发现，他们的教科书要被改成爱党教科书，他们的选举权被剥夺，未来还会像大陆一样被城管欺负也只能忍气吞声，女儿在幼儿园被性侵出来维权却要被消音说成是造谣。当他们尝试和中央政府沟通要求本该有的权利，却不被理采，所以他们为了自己的未来，也只剩唯一走独立之路了。就像一个家庭里，家暴男拒绝和女方平静下来商量解决问题的方案，吃饭不许女方坐席，不把女方当人看不给予应有的尊重而当佣人看待，这样下去，女方为了自己的生活，当然只剩下离婚走独立这条路。但目前如果中央和香港政府仍旧执意不回应民意，非要把港人逼上独立的路，那也不是香港人的错。而是政府故意逼人分裂。但目前香港人从始至终仍旧是希望在一个中国的前提在一国两制的框架下解决问题，希望政府兑现承诺。\n\n香港的抗争运动我就大概讲到这里，那么和我们大陆人有什么关系？\n\n我想说的是，作为一个人，不能恩将仇报，我们不能如此健忘，既不能轻易忘了那个邪恶政权所做的所有恶，更不能忘了香港人从过去一直到现在给我们大陆人所有的救助。\n\n从1949年中共建国，到大跃进饥荒，反右运动，10年文革，89学运，在这几十年中共发动的各种斗争运动，导致大量人惨死逃难，香港一直充当着大陆人的“辛德勒”避难所，之后的改革开放，在外资不敢来陆的情况下，大量港商来一穷二白的大陆建厂带来大量资本和技术，让我们的父母辈才有机会打工可以挣钱养家，更有89年的学运，香港人全港动员，举办民主歌声献中华，为大陆同胞募捐款物，当年张国荣，梅艳芳，BEYOND,张曼玉等几乎所有港星都站出来支持北京学生的爱国运动，更有大量香港市民亲自前往北京支持，还有98年大洪灾和08年地震更是全港动员大量捐资捐物帮助我们大陆人，值得一提的是08年地震，香港以仅仅700万人口之力，竟然捐款数额高达200亿港币，属全世界捐款帮助大陆最多，也超越大陆各省市，还有更多香港人帮助我们大陆人的 例子......更难得的是，我们大陆人自己抗争失败的89学运被政府不公定性为暴动，这么多年我们自己不敢发声抗争，可香港人却代替我们向暴政声讨寻求正义，而这一坚持就是30年，风雨无阻。\n\n全世界再也找不到比香港人对我们大陆人更好的了。\n\n作为大陆人，在香港人面前，我真的很愧疚觉得可耻，这一切抗争的后果本该是由我们大陆人来承担，而现在是香港人在替我们流血坐监甚至丧失生命，是我们的冷漠纵容和无所谓，导致独裁极权越发嚣张，直到危及所有人。\n\n香港人不仅仅只是在为他们的未来在抗争，实在也是为了我们大陆人享有自由而抗争，是在延续实现30年前北京那群年轻人未完成的夙愿，我们大陆人和香港人面对的都是同一个压迫人剥削人异化人的，反人类邪恶共产党政府，我们和香港人本是血浓于水的同胞，却被党媒不断通过黑白颠倒的媒体来给民众洗脑，煽动对香港人的仇恨。这是独裁政权最喜欢做的事。一边在国内通过高压政策维稳统治，让经济民生和人权状况不断下降，一边通过仇恨来转移民众视线，继续维护他的统治。\n\n这是一场正义和邪恶力量的抗争，并不像大陆一些朋友所说没有对错之分，不对，这场抗争有明显的是非对错，也不仅仅关乎香港，大陆，和台湾。而是关乎全世界，与每个人都有关，我们所有人都是一个整体，处在同一片天空下，面对不公义的事，没有谁可以置身事外，今天我们不声讨抗议抵制独裁极权，明天它就会侵蚀危害到你。\n\n这两个多月的抗争，我看到了被共产党控制的香港政府和警察的疯狂残暴，他们用尽阴险手段来打压这场本是合理正当正义和平的香港抗争者。\n\n善良不仅仅是对弱者的同情帮助，更是当面对不公义残暴之事时我们需要勇敢站出来抵抗。我们不能让香港人感到孤单，香港需要世界的帮助。\n\n我们大陆人已经基本失去了一切美好的东西和最基本的人权，就在我打字的这一刻，内心仍布满恐惧，希望香港人的未来不要变成和我们一样。\n\n自由从来不是从天而降，希望我们大陆人也能一起努力，希望终有一天我们能自由的说话交谈，在这自由的土地上相见，内心不再充满恐惧。\n\n香港加油！大陆加油！"
		},
		{
			"post_id": 62,
			"title": "Matters | 林小谷：为什么总有人为墙辩护？ ",
			"date_published": 1567993519.108,
			"body": "![](https://ci4.googleusercontent.com/proxy/HF-cRbc7E0v3lFBqegUFmB-lTHLWbN8oYG-0ULmRvfNWixhgQBaZfUvcezh2MONM5lfke7wHls9cRvYseJ6uFm5zf1ZAFphYdvpFTzlKqiZKl9KaOwoPohgJFus5dIxJQ0xYs2dQ6kkxQTHt1JVGFsSjODxSPipN=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/09/e650ec1b-0357-4e7c-aa88-55c41506d86c-1024x731.jpg)\n\n这3、4年，在国内各个社交媒体上，<wbr>可以看到为墙辩护的言论越来越多。他们的说辞总是这一套：“<wbr>墙的存在是合理且有必要的，<wbr>因为它可以有效地屏蔽掉西方散布的虚假信息，<wbr>避免没有判断力的群众受其煽动；同时，<wbr>墙也让有一定判断力的人出来获取更多信息，这些人不会受煽动。”<wbr>然后，做一个总结，“所以，我觉得墙的存在挺好的。”\n这套言论是如此盛行，以至于我上大学之前还真的有点相信，<wbr>墙的存在是为了“筛选出有明辨是非能力的人出去接收墙外信息，<wbr>同时把没有明辨是非能力的人关在墙内。”<wbr>甚至还认为这是一个很明智的政府政策。\n\n但这完全是扯淡。\n\n首先，这套说辞本身就有问题。什么叫做“有明辨是非能力的人”？<wbr>这到底是如何定义的？\n\n翻墙是一个需要一点额外信息和电脑技术手段（但并不算高）<wbr>来实现的行为。如果按照这套说辞的逻辑，能实现这两点的人，<wbr>就被认为是“有明辨是非能力的人”，而实现不了的则是“<wbr>不能明辨是非的人”。什么时候电脑技术和“明辨是非能力”<wbr>挂钩了？\n\n那些写下这些说辞的人，内心中想象的“容易受蛊惑的无知群众”，<wbr>大体上是那些受教育程度不高，情绪上容易受他人感染的热血青年。<wbr>但实际上，这些人翻墙也不难。这是因为，翻墙本身没有技术难度，<wbr>难的是自己是否有这个欲望。\n\n（对于一直以来就在墙外的人来说可能很难理解，但其实，<wbr>对墙内人来说，翻墙是需要比较强的心理动力的。<wbr>如果不是为了追星、查文献、工作需要等刚需，<wbr>大部分人其实懒得翻墙。因为对于没有见过的东西，<wbr>人们不知道它的价值，于是会认为其可有可无。同时，<wbr>墙内的信息也比较充盈，常常认为这些就够了。）\n\n墙的存在，<wbr>实际上是让更多人因为自己的心理怠惰而放弃了探索更广大的世界，<wbr>它根本不能起到筛选作用。在墙内人中，很多人因为“<wbr>没有那个需要，懒得麻烦”而不翻墙，这些人很多是“<wbr>有明辨是非能力的”（比如我那正准备考研的堂弟）。同时，<wbr>那些翻墙的人，未必都有“明辨是非能力”。举个例子，<wbr>那些只要自己爱豆被批评，就不分青红皂白喷脏的脑残粉，<wbr>一般被认为是“没有明辨是非能力”的人吧。<wbr>可这些人都是翻墙老手。\n\n除了“筛选论”本身错误外，那套说辞中的“西方散布的虚假信息”<wbr>也是一个莫名其妙的存在。墙外当然有虚假信息，<wbr>但主流媒体提供的基本没事实问题（即事件本身是确实发生的）。<wbr>人们常说的“外媒抹黑中国”、“扭曲事实”，实际上是指，<wbr>西方媒体在报道中采用了不同的视角，有预设立场，<wbr>用到了令人感觉不舒服的语句。这其实是因为双方站在不同立场，<wbr>拥有不同的common sense，和不同的读者群体导致的。<wbr>看对方写的文章不舒服很正常，<wbr>这大概就像保守派看自由派的报纸总想破口大骂一样。<wbr>但根据这些不同，无法直接盖章说对方在散布虚假信息，<wbr>群众会受其煽动（实际上，我认为恰恰相反，<wbr>国内群众如果真的看到那些信息，应该会在评论区澄清，<wbr>或者提供另一种思路。双方碰撞之后产生交流，<wbr>给彼此提供更多的视角，然后common sense能够渐渐融合，最后敌意减少。）\n\n总之，我认为目前盛行的为墙辩护的言论是站不住脚的。<wbr>但这不是这篇文章的重点。上面写了拉拉杂杂这么多，<wbr>实际上是想引出这个问题：为什么人们会接受这套”墙用有且合理“<wbr>的说辞？\n\n从根源上想想，这真是有点古怪。自己获取信息的门槛被增加了，<wbr>按理来说应该是感到不满，但人们总爱为墙说话，<wbr>说它是合情合理的，说它有这般那般的好。<wbr>说到最后都有了情真意切的感觉，好像墙天生就该伫立了，<wbr>让墙消失反而是件可怕事。\n\n我认为，出现这种情况是因为，人们不喜欢基本权力被剥夺的感觉，<wbr>为了避免有这种感觉，人们索性从一开始就放弃权力，<wbr>因此也就没有了权力被剥夺后的受辱感。通过这种心理建设，<wbr>保证了自我尊严的完整。\n\n当人们说”我觉得墙的存在挺好的“，这和很多有关国外新闻下，<wbr>人们留的高赞评论“这就是你们要的西方民主！“<wbr>背后的心理路径一样。反正无论自己怎么说、怎么想，<wbr>都无法改变墙的存在和民主的缺失，那索性就用精神胜利法，<wbr>贬低自己没有的，称赞自己有的，那感觉真是好多了。\n\n我最早意识到这一点的时候，是在大学写一篇关于”<wbr>中国计划生育带来的影响“的论文。当时我刚到国外不久，<wbr>感受到很多偏见和预设立场。为了挑战偏见，我一开始就决定写”<wbr>计划生育政策带来的好处”，让教授看看不同的视角。<wbr>结果随着资料查得越来越多，我发现很难圆到“政策的好处”<wbr>这一结论上，因为实在是有太多残忍和糟糕的东西了。<wbr>最后因为时间不够，我也没有重新写，<wbr>把那篇论文扭转成四不像后交了上去。\n事后想，我为什么非要写“计划生育的好处”。多年来，<wbr>我确实相信它有诸多好处，它是不得不实行的政策。<wbr>当国外房东的侄女问起我时，我也回答，<wbr>很多中国年轻人其实都支持计划生育，因为可以独享父母资源。<wbr>这条论点没错，但如果全世界实行计划生育，而中国实行自由生育，<wbr>我又是否会回答，很多中国年轻人都支持自由生育，<wbr>因为从小可以有很多兄弟姐妹一起玩？\n\n大部分人的观点，实际上根本就不是观点，<wbr>而是随着外部条件改变而改变的说辞，一套让自己心里好受的东西。<wbr>没有人会喜欢被剥夺生育权力、信息权力，但事实已经发生了，<wbr>能改变的只有说法了。随着不断地重复这些“我觉得这样也挺好”、<wbr>“我们才不稀罕这些呢”的说辞，这一切似乎变得越来越真实，<wbr>好像这才是人们的真心想法。\n\n这也就可以解释，为什么总有网民在外网上说“<wbr>其实我们有言论自由”、“事情没有你们想得那么糟”，<wbr>然后拿出犄角旮旯里的几个例子来证明。<wbr>这实际上是为了保全自己的尊严。毕竟，别人有的东西咱没有，<wbr>真是又难堪又难受，所以，要么硬说自己有，实在没有就说“<wbr>咱不稀罕”。"
		},
		{
			"post_id": 61,
			"title": "[微博谈20190906]  香港回归以来最黑暗的一天",
			"date_published": 1567992751.742,
			"body": "![](https://www.nsaimg.com/2019/09/06/5d72226066e8a.png) \n![](https://www.nsaimg.com/2019/09/06/5d72225fdefd5.png) \n![](https://www.nsaimg.com/2019/09/06/5d72225e8b0f0.png) \n![](https://www.nsaimg.com/2019/09/06/5d72225e34667.png) \n![](https://www.nsaimg.com/2019/09/06/5d722258a3e82.png) \n![](https://www.nsaimg.com/2019/09/06/5d7222533ec1b.jpg) \n![](https://www.nsaimg.com/2019/09/06/5d72224f722fc.png) \n![](https://www.nsaimg.com/2019/09/06/5d72224ce388d.png) \n![](https://www.nsaimg.com/2019/09/06/5d7222494be9b.png) \n![](https://www.nsaimg.com/2019/09/06/5d722243d31bc.png) \n![](https://www.nsaimg.com/2019/09/06/5d72222dc1145.png) \n![](https://www.nsaimg.com/2019/09/06/5d72220df1d0b.png)"
		},
		{
			"post_id": 60,
			"title": "[董卿]事件简述，以及马上会宣传美帝人民生活在水深火热之中的事实",
			"date_published": 1567991876.756,
			"body": "        九月一号随着全国迎来了开学的日子，央视专门为此制作的《开学第一课》也如期而至，该节目主要是宣传爱国思想，弘扬爱国主义精神，给全国的小朋友上一堂爱国教育课，让他们知道国旗的神圣与庄重。\n        该节目的由撒贝宁和董卿主持，这两人可以说是目前央视最能拿得出手的主持人了，很多重要的节目都是这两人主持。而董卿随着刘涛退隐二线，凭借深厚的主持功力以及大方得体的知性，逐渐成为央视一姐。\n        《开学第一课》播出后，确实收到了预想的效果，全国的小朋友经历了一次爱国教育的洗礼，让他们从小知道爱国，知道国旗的神圣与不可侵犯。这是很值得称赞的，尤其是作为主持的董卿还演讲了《红岩》中的精彩选段，赢得满堂彩。正如董卿所言，我们生活在五星红旗下，就应该热爱自己的祖国。\n可是在节目播出后，董卿个人遭到了很多网友的质疑。原因是董卿在2014年的时候，名义上是留学，可是实际上却是赴美生子，儿子孩子入了美国国籍。虽然这件事董卿没有正面回应，但是这让更多的网友认为这是真实存在的事实。作为主持人的董卿，在台上侃侃而谈爱国情怀，可是转身就将自己的孩子入了美国国籍，这样的爱国情怀是如此的空洞且缺乏说服力。\n        随着董卿时间的发酵，关于明星孩子的国籍问题成为了大众瞩目的焦点。众所周知，我国公民只有一个国籍，不能附带其他国籍，而这时候很多明星就面临着给孩子选择国籍问题。是直接入中国籍，还是选择外国籍。基于多方面的考虑，很多明星的孩子都入了其他国籍。\n        比如说戚薇和李承铉的女儿就是加拿大国籍，还有赵薇的女儿是新加坡国籍，前奥运冠军李小鹏的女儿是美国国籍，即使是成龙儿子房祖名也曾入了其他国籍，但是最后还是入了中国国籍等等。我想这些都是已经公布的，还有很多明星没有公布，但是他们的子女多数入了其他国籍。\n        其实谈到明星子女的国籍问题，就绕不开爱国的话题。比如董卿这件事，董卿作为公众人物，将自己的孩子入了美国籍，但是回到国内却大谈爱国教育，让小朋友热爱五星红旗，这样表里不一的行为肯定会遭受质疑。但是话说回来，作为一个母亲，让自己的孩子享受更好的医疗卫生教育也是理所应当的。而出现如此大的争议我想在于央视考虑的不够全面。\n        其实国籍问题与爱国问题一直争论不休，很多人认为入了其他国籍，那么就意味着不再是中国人，就不过爱国。但是现实生活中虽然是外国籍，但是爱国人士还是很多的，比如巩俐，作为国内的知名演员，巩俐其实是新加坡国籍。但是在第55届金马奖上，由于某些人宣传台独，作为颁奖嘉宾的巩俐拒绝上场，而且会后说这是她最后一次参加金马奖，其爱国情怀表现的淋淋尽致。\n\n        所以董卿事件其实他自身的行为，让他站在了不该战的舞台上，不过你们以为别的不敢提不敢说，就把怒火全撒她身上？你们太天真了，首先你们的行为已经让社会产生了不稳定因素，所以马上铺天盖地的宣传美国枪击事件，是宣传部门仅次于为国家庆生的第二件大事。如果刚好这个月有一起，哪怕没有死人，所有官博，都会在新闻下面发一些近期发生的枪击案件的新闻简述，目的大家都知道的。然后很多自媒体也会跟风（不然你发不出去啊。。。）"
		},
		{
			"post_id": 59,
			"title": "[转载]扯淡的董卿式爱国，扯淡的全民教育\n",
			"date_published": 1567991543.725,
			"body": "        我已经很久没看央视的节目了，也包括几乎全部的官方出品。这就像买东西一样，我从来不会轻信店员的推荐，因为她肯定不会告诉你店里有假冒伪劣。然后就在昨晚，央视的《开学第一课》节目，因为勾兑“假冒伪劣”，被观众抓了现行，一时间刷屏朋友圈。\n\n        事件过程想必已是人尽皆知，主持人董卿教育小朋友要像爱护生命一样爱护五星红旗，结果立马被人爆出她于2015年赴美产子，生下美国儿子的猛料。这确实够尴尬，我建议董小姐赶紧动用关系给儿子办个中国户籍拿去公关一下。\n\n        当然，从一个母亲的角度出发，董卿又无疑是称职的。从动物学上讲，很多动物在产卵的时候也会精心挑选地方，尽可能地为后代创造优质环境。让儿子获得美国国籍，将来不仅能接受美式的先进教育理念，受教育的成本也要低很多，上美国常春藤名校的几率也会高出很多很多。\n\n        然后美国护照可以获得180多个国家及地区的免签和落地签，比如我们大陆同胞去个香港台湾都需要签证，而她给儿子弄个美国护照，却可以免签了。等她儿子长大后，那时董小姐也差不多要退休了，根据美国近亲移民的政策，她自己也能跟着移民去美国，颐养天年，真可谓是深谋远虑。\n\n![](https://www.x6img.com/u/20190906/16435868.jpg) \n\n        其实赴美生子也没什么，每个人都有追求生活的权利。反美是工作，赴美是生活，我们也见多不怪了，但是自己把孩子生在美国，却教育政治空白的小朋友去爱国，这真的很不好，也够无耻。因为以董卿的这种爱国逻辑，就等于告诉别人，你有钱了可以把儿子送出国去，或去那里生活，但是国家和社会存在的问题，你不要尝试改变，反而还要用生命去爱护。\n\n        这种董卿式爱国，是不是很扯淡？真正的爱国，难道不是让这个国家变得更好，社会更民主，政治更清廉，环境更宜居，言论更自由，然后追求教育、医疗和养老的福利化？把国家建设成拥有以上属性的国家，和把子女送到拥有以上属性的国家，究竟哪样才算是爱国，这需要智商来鉴别吗？可现实却是很多人选择后者，默认后者，赞同后者，这社会究竟得有多操蛋？\n\n        今天是开学的第一天，央视教育小朋友们董卿式爱国，那么我也来简单地谈谈教育。去年哈佛校长凯瑟琳说了一句很经典的话，让我记忆深刻。她说教育的目的，是能够学会辨别“有人在胡说八道”。\n\n![](https://www.x6img.com/u/20190906/16441675.jpg) \n\n        这句话，以及凯瑟琳为什么说这句话，是非常值得品味的。因为就美国而言，社会财富分配制度已经非常优秀了，劳动者拥有7.5美元到16.5美元的最低时薪，只要你肯工作，哪怕到餐厅刷盘子，也不会过得太差。而且年收入在14088美元（约10万人民币）以下的个人，可以领取政府发的食品券，也就是说，低收入群体基本不用在吃上面花钱。\n\n        然后美国社会的资源，以及整个平台，是非常开放和公正的，像马斯克这种从南非来的穷学生，依靠自身的能力，一路创业成为硅谷的钢铁侠。这说明美国并不是属于那些二代三代们的，阶级的流动性很大，有能力就有机会，董卿的儿子理论上还可以竞选美国总统。所以，当一个社会制度公正，成熟之后，最需要堤防的，就是被人引向错误的方向。所以，拥有独立的思考能力，能够辨别有人是否在胡说八道就是项重要技能，同时也是公民社会的基础构件。\n\n        这也是我今天想说的重点，简而言之，教育的首要目标，就是培养学生的独立思考能力，能够辨别谎言。那么，辨别谁的谎言的呢，首先是政客。因为政客都是天生的骗子，他们明明是社会财富的分配者，却往往伪装成社会财富的创造者，试图让你相信没有他，你将一无所有。或者，他们总是洋洋洒洒地许下众多承诺，可每次回头一看，他们又总是一事无成。\n\n        除政客外，还有一个最擅长胡说八道的东西，就是新闻媒体。因为媒体告诉你的，往往只是他们想让你知道的。尤其是一个国家所有的媒体只推送一种声音，一致观点的时候，恰恰就是他们胡说八道的时候。比如现在，就有很多人相信拿雨伞的可以暴打拿枪的；比如，在一个副院长家族都有200亿的今天，还有很多人坚信，掠夺自己财富的是外国人。当然，还有那些一个个把子女送到发达国家的人，却被认为是最爱国的。\n\n        罗素说，无知是天生的，而愚蠢是教育造成的。我想，这才是他们偷偷把子女送出国的原因。"
		},
		{
			"post_id": 58,
			"title": "关于贸易战：刘鹤柔性表态， 人日宣称不怕打",
			"date_published": 1567416569.434,
			"body": "![](https://www.privacypic.com/images/2019/08/28/101e26f36bee15ad349.jpg) \n图为中国副总理刘鹤在5月10日午间离开美国贸易代表办公室。\n\n关于贸易战，可移步本区《[转]贸易战的本质问题是什么？网文已被删》\n\n**中方贸易代表柔性表态， 人民日报称“不怕打”**\n\n中方贸易谈判牵头人、副总理刘鹤日前表示，愿意以冷静、协商的态度解决美中贸易战。但第二天，《人民日报》又叫嚣“不怕打，必要时不得不打”。\n\n8月26日，中国副总理刘鹤出席在重庆召开的“中国国际智能产业博览会”时表示，中方愿意用冷静的态度，通过磋商合作解决美中贸易问题，反对贸易战升级，“这样不利于中国，不利于美国，也不利于全世界人民的利益”。\n\n这是美中贸易战8月初升级后，中方高级官员首次对贸易战进行表态。\n\n中方8月23日宣布，将对750亿美元美国商品加征5%至10%不等的报复关税，分别在9月1日及12月15日开始实施。\n\n同天，美国总统川普（特朗普）宣布，将对5,500亿美元中国商品的进口关税提高5%。包括，从10月1日开始，对2,500亿美元中国商品的关税从目前的25%提升到30%；从9月1日起，对剩余3,000亿美元中国商品加征的关税从现在的10%提升到15%。\n\n但就在刘鹤对美方释放出和谈的友好信号第二天，即8月27日，中共《人民日报》刊发评论文章称，美方一些人认为中方“不会对美上调关税作出反制”，这是“误判了形势”。\n\n文章称，贸易战没有赢家，中方“不愿打、不怕打，必要时不得不打”。并称误判中方反制的意志力，将“付出代价”。\n\n台湾中央社报导称，刘鹤上述这番言论是近期美中经贸冲突升温以来，中方罕见柔性表态。但《人民日报》今天的文章，却明显与他不同，显示宣传部门与谈判团队对贸易战态度不同调。\n\n**中国外交部也与刘鹤不同调**\n\n另外，中国外交部与中美全面经济对话中方牵头人刘鹤也不同调。\n\n川普26日在G7会议期间对记者称，中方代表25日与美方代表通了2次电话，“让我们回到谈判桌，所以我们将重新谈判”；“他们（中共）被狠狠地打击了，他们知道这么做是对的，我对此相当尊敬。对世界而言，这也是一个积极的发展”。\n\n但就在当天，中国外交部发言人耿爽对记者表示，“我没有听说过”中美双方通话；他还称，美方进一步提高对中国输美商品关税税率，“完全是损人害己”，是“霸凌”行为。\n\n随后，川普在G7会议上回应了中国外交部的言论，川普问身旁的美国财长姆钦（Steven Mnuchin），中方谁来电，要求更多谈判。姆钦回答说，副总理刘鹤。\n\n**美方要求公平贸易**\n\n自美中贸易战去年开打以来，美国一直指责中共不公平的贸易行径，包括设置非关税壁垒、不合理地补贴国企、不遵守其入世以来的承诺、盗窃美国的知识产权，强制外企转让技术等。\n\n中共2001年加入世界贸易组织后，没有兑现对世贸组织成员国的承诺，入世后获利丰厚：外国投资从2001年的470亿美元增至2018年的1,349亿美元，中美贸易顺差从2001年的830亿美元增长到2018年的4,192亿美元。\n\n美国总统川普曾多次说，中共一直占美国的便宜；美国重建了中国。他说：“多年来，它们（中共）每年（从美国）拿走2,000亿美元，3,000亿美元，4,000亿美元，甚至5,000亿美元。我们帮助重建了中国。”\n\n**中方内部有人向后方扔手榴弹**\n\n今年4月底，中方突然反悔此前已基本达成的文本协议，要求推倒重新谈判，这令美方相当不满，导致美中关系进一步恶化。\n\n随后，美国对中国科技巨头华为，以及中科曙光、天津海光、成都海光积体电路、成都海光微电子技术、江南计算技术研究所等科技公司进行制裁；将2,000亿美元中国进口商品的关税，从此前的10%提高到25%等。\n\n贸易战升级后，中国官媒发表大量评论文章，不但攻击美国，而且指控国内的“投降派”，是“崇美、媚美、恐美”，还说在中美经贸摩擦“两军对垒”之际，要警惕那些“手榴弹向后扔”的人；中国央视还连续播放抗美影片等。\n\n但中国官媒这种文革性的攻击语言，也遭到大陆媒体与高级知识分子的不满。\n\n中国人民大学研究员叶胜舟6月在英国《金融时报》中文网刊文指出，中宣部对美中贸易战的宣传存在：太多、太硬、太重、太老四大败笔。\n\n文章批“真理部”（中宣部的戏称）需深思，“内霸外王”走不通，只会让国外更质疑。\n\n今年6月底，川普与习近平在日本大阪成功会面后，双方达成重启贸易谈判的协议。\n\n随后，双方贸易谈判代表进行了多次电话通话，且于7月底在中国上海举行了双边面对面谈判，但谈判仅仅进行了数个小时，美国代表团就打道回府。\n\n8月1日，美国贸易代表团从上海返美后，向总统川普汇报，随后川普发推说，自9月1日起，对剩下3,000亿美元中国进口商品加征10%关税。美中贸易战再次升级。\n\n川普指责，中方没有履行在日本大阪的承诺，即进口大批美国农产品，禁止向美国输入毒品芬太尼。川普表示，中共又在欺骗美国，正采用拖延战术，企图将贸易协议拖到2020年美国总统大选之后。"
		},
		{
			"post_id": 57,
			"title": "【网络民议】用得着了就让养殖了 用不着了就说污染了 ",
			"date_published": 1567391769.146,
			"body": "8月29日，微信公众号“养猪一家人”发布[《中央下发铁令！<wbr>19年限养令、禁养令撤销！19年玉米生产者补贴确定，<wbr>即将下发！》](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=fa5daa6bc5&e=0b3f48ff7a)称2019年养猪业“限养令”、“禁养令”<wbr>确定取消，是对养猪业一大利好，<wbr>未料该文评论处大量业内网友发表评论，<wbr>暴露出整个养猪从业者在长期政府的反市场管理、<wbr>年内非洲猪瘟与恶劣气候等因素的打击下的无尽心酸……\n\n[![](https://ci4.googleusercontent.com/proxy/L7NdTOUTUZYFu8yN-f_-6eAKaidhuuuukH_PODFlvcXujWWs5yLtx7jixozkq6YWh-lh37P7Q7rAUfSQ5uZrOaJtpvHpIB0JY23fXWYZwFKdQwfL8vXjUTTj=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/EDIfFVhXkAAtYop.jpg)](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=2fbe432e02&e=0b3f48ff7a)\n\n[![](https://ci6.googleusercontent.com/proxy/n0VcgABfeLbFjRr1mcOC5RhIskBUSA7Ot4Y1EB_0wOTLdAZYtr6Gno_VA5OZ3FNU7cELMr4Gyzq_xsxitc8VLLnL3qucO6t1DGAqdkLyYCAt_GPQMT7Tx10C=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/EDIfE-aXYAAP4tn.jpg)](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=96b1da2c6a&e=0b3f48ff7a)\n\n**原文：**\n\n> 养猪一家人 | 中央下发铁令！19年限养令、禁养令撤销！<wbr>19年玉米生产者补贴确定，即将下发！\n> \n> 19年对于咱们农业可真的是多事之秋！一方面非洲猪瘟肆虐，<wbr>重创养猪业！另外一个方面雷暴、大风、暴雨，台风利奇马、<wbr>罗莎来势汹汹！但是有一个好消息！19年限养令、<wbr>禁养令确定取消！19年玉米生产者补贴确定，即将下发！<wbr>咱们一个一个说！\n> \n> 小编说：国务院21号常务会议针对养猪业提出了具体措施！\n> \n> 1、综合施策恢复生猪生产\n> \n> （1）加大力度针对生猪大县、大型养殖场的政策扶持；\n> \n> （2）全国范围内开通仔猪和冷鲜肉的运输“绿色通道”，<wbr>降低运输成本；\n> \n> 2、取消生猪禁言、限养规定\n> \n> 针对在禁养区内被关停的养殖场，进行政策扶持，<wbr>重新安排养殖用地，支持养猪户可以异地重建养殖场！\n> \n> 3、支持规模养殖、支持农户养猪，用地政策放宽！\n> \n> 针对养殖场和农户，能够进行规模养猪的，<wbr>取消附属设施用地15亩的上限规定，这绝对是一条利好消息！\n> \n> 4、继续减轻动物防疫，提升疫病防控能力！<wbr>非洲猪瘟对养猪业的重创，现在想起来还是心惊动魄，提高防疫，<wbr>减少养猪损失，为国家出台的政策点赞！\n> \n> 5、保障猪肉供应、平抑猪价！\n> \n> 最近不断高涨的猪肉价格，真的是大喊吃不起，<wbr>这次会议决定增加地方猪肉的春被，<wbr>同时启动社会救助和保障标准与物价上涨挂钩的联动机制！<wbr>保障贫困人口的基本生活！\n> \n> 小编说：根据我们得到消息，19年玉米、<wbr>大豆和谷物生产者补贴即将发布！<wbr>黑龙江省财政厅率先发布了补贴通知！\n> \n> 补贴标准：玉米生产者补贴标准得到相应提高，<wbr>大豆生产者补贴高于玉米生产者补贴，<wbr>补贴资金在每亩200元以上！<wbr>针对地表水灌溉稻谷的每亩补贴高于地下水灌溉稻谷的土地，<wbr>每亩补贴多给40元以上！\n> \n> 补贴对象：谁种地补贴给谁！谁是实际种植玉米、大豆、<wbr>稻谷的种植者补贴款就直接打卡给谁！\n> 3种情况不予补贴：\n> \n> 1、没有申报、审核、公示的三大作物种植面积；\n> \n> 2、在国家有明确退耕要求的土地上，种植三大作物的种植面积；\n> \n> 3、私自开荒、开垦的土地，不予补贴；\n> \n> 今天连续收到两条好消息！真的让我非常的高兴！<wbr>最近当道哥看到台风、猪肉价格暴涨，<wbr>这些消息的时候真的是开心不起来，为农民捏把汗！\n> \n> 我们中央真的反应迅速！保障了农民利益！必须要给中央政策点赞！<wbr>期望这批粮补资金能够尽快下发到农户的手里，<wbr>期望猪肉价格尽快下来。\n\n在这些网友的评论中“强拆”、“禁养”政策数次被提及，经查，<wbr>自2015年起中国开始的环保禁养政策，<wbr>将一些不达环保要求的农村散养户强制拆除，期间或又出现典型的“<wbr>一刀切”执行问题，甚至在今年，禁养限养令仍在严格执行。\n\n> [新华网 | 农业部谈生猪禁养：环保不达标 生猪规模养殖寸步难行](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=55acec875a&e=0b3f48ff7a)\n> \n> [腾讯网 | “禁猪令”已实施？农户不能再养猪？违规还要罚5万？真的假的？](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=41f531143e&e=0b3f48ff7a)\n\n**以下为中国数字时代编辑摘自该文下网友评论：**\n\n> @离乡：您说错了，让人惊心动魄的不是非瘟，是强拆，<wbr>是带着民警带着血腥味的强拆。也是我们养殖户们无奈，<wbr>无助的时刻。他们能做的只有叹息流泪，不得不外出打工挣钱还债。\n> \n> @康涵赢天下：补偿，支持，我们也不养了，<wbr>18年拆猪栏150元一平 ，19年非洲猪瘟，自己挖坑，自己埋，一分补贴都没有，<wbr>已经倾家荡产了，还拿什么去养?\n> \n> @缘~：真可笑，用着了就叫养殖了，不用了就说污染给你拆了。<wbr>前阵子把养殖户折腾的还不够惨吗？\n> \n> @仁者：用着朝前，不用朝后，忽悠老百姓养猪，补贴大集团拿着，<wbr>等着吧！\n> \n> @笑看风云：取消干嘛呢？只要我们有金山银山了，<wbr>五百一斤的猪肉都是小钱不是吗？<wbr>我们有那一座座的金山银山还怕吃不起猪肉吗？<wbr>今天强拆老百姓的猪场，明天鼓励动员老百姓养猪，<wbr>后天再过河抽板强拆养猪场，整天有时间说美国总统特不靠谱，<wbr>为什么不抽点时间来反思一下自己的政策靠谱不靠谱？<wbr>上面领导放了个屁，就到处拉横幅刷标语的拼命拍马屁，有意思吗？<wbr>对老百姓的实质生活有用吗？<wbr>整天为了自己的所谓的政绩不管老百姓死活。我呸\n> \n> @![🌄](https://ci6.googleusercontent.com/proxy/2i6u1NGLQOpLUPhSWEsN1rG61nh6ABaXz71nvbgJb-GocKPlzRywPSuLh2sGERumXVfBrjTRPjvE4506uFkCXA-RcG_nfMLPYxCnFHI=s0-d-e1-ft#https://s.w.org/images/core/emoji/12.0.0-1/72x72/1f304.png)![🌅](https://ci3.googleusercontent.com/proxy/krc4ec1pOaSjunxzjKaehQMfjLpUj3juZ7PZUZcSS2Q0Ki_x9Ty1m4ksaVV2bNaoMjrVp2PKpaLOIo8FYTOMwtmI7V9B0EOOi68S9WQ=s0-d-e1-ft#https://s.w.org/images/core/emoji/12.0.0-1/72x72/1f305.png)：现在这些利好消息对今年的养殖户已无关紧要，一人笑来百家哭。<wbr>我盐城这边非瘟疫情严重，有的乡镇猪基本死光了，<wbr>地方政府瞒疫情，还乱埋死猪导致疫情蔓延，<wbr>本人深受其害投诉无门，今后将告别养猪业。\n> \n> @旧人不敷、：猪不让养，强拆！又干跑运输 说是排放不达标！那么我想问下，油是不是国家定的标号？<wbr>如果不达标你们为什么让油站销售？车子检车是不是你们说了算？<wbr>不合格为什么让出厂？难道是我踩油门的方式不对？<wbr>还是我不买新车影响国家进步了？\n> \n> @会飞的小鸟：我是浙江的。2000年，我建了个百万的猪场。<wbr>18年把我强坼了。赔了我十万，我今年60了。还在工地上，<wbr>扛水泥。欠了一屁股债，要还。想死的心都有。更别提养猪了。\n> \n> @A黑状元@亮亮13093956663：<wbr>当初禁养令还是国家颁发的，ZF不分青红皂白直接强拆养殖场，<wbr>现在货源紧张了又让养了可惜我们养猪人都改行了。\n> \n> @周善镜：社会救助？先救那些养猪得猪瘟，弄得倾家荡产的吧？<wbr>买不起猪肉的可以少吃或不吃，不吃猪肉人不会死，<wbr>养猪倾家荡产的可能会死人！\n> \n> @快乐@蜗牛18554695223：非瘟不可怕，<wbr>最可怕的是国家政策，有肉吃了恨不得把养猪人活埋，<wbr>没肉吃了又骗农民养猪，过两年有肉吃了再把养猪人枪毙。\n> \n> @熊：猪场拆了去那里养猪？这什么政府，要我们养猪可以，<wbr>拆了我们猪场钱补回来就养，<wbr>我们辛辛苦苦建个猪场10分钟就拆了。\n> \n> @徐发科：<wbr>这几年对于我们浙江衢州的养殖户来说真的不知怎么形容才好，<wbr>前几年拆你没商量，<wbr>辛辛苦苦攒的一点血汗钱被一波强拆搞的血本无归，维权无门，<wbr>还背了一屁股债；侥幸留下的也被折腾的死去活来:<wbr>今年叫你搞生态排放，明年又把你按他们要求布的管全部剪掉，<wbr>又心血来潮叫你花一大笔钱搞一无是处的异位发酵床，<wbr>还吹得天花乱坠的向全国推广，还要配上做做样子的监控设施。<wbr>今年猪瘟爆发，刚开始不管是不是一律扑杀，<wbr>到现在泛滥了你叫他扑杀，他叫你能卖尽量卖，<wbr>能养大点尽量养大点，只要猪没死，什么猪都可以卖，<wbr>遇上这样的地方政府养殖户该上哪说理去？\n> \n> @美女：我们这里的猪都死光光了，涨价又起什么作用，<wbr>辛辛苦苦多年的积蓄全打水漂了，还要欠债，养猪真把我们害惨了，<wbr>层层剥削，哪还有我们赚的钱。\n> \n> @大坤：我也想养啊，但地方政府还是无动于衷，不给开检疫票，<wbr>猪还是卖不出呀，为什么中央和地方不一致。我问过地方政府了，<wbr>他们说还没有下达这种政策通知。\n> \n> @杨龙坤：现在的猪价高吗？其实一点都不高，<wbr>这是因为这么多年的猪价一直在低水平阶段，<wbr>疏不知这么多年的养殖户都是在亏损当中，有人会说，<wbr>亏损的还养猪吗？其实，养猪人是一年望一年，<wbr>心想明年的猪价肯定会高点，就这样一直折磨着养猪人，<wbr>现在的猪肉高了，有人在叫苦了，其实大家知道吗？<wbr>现在是多少养猪人倾家荡产换来的猪价，如果不是非瘟，<wbr>猪价会这么高吗？如果按现在存栏的猪按二十块一斤卖出去，<wbr>这能养活所有的养猪人吗，现在已经有20%的养猪人倾家荡产，<wbr>有40%的养猪人四处打工谋生，20%的人花光了多年的积蓄，<wbr>还在停留在起跑线上，20%的人是盈利了，盈利的这20%<wbr>的养猪人，也是在拼命的奋斗了多年中能有今天的一点点收获，<wbr>这就叫做猪家长了吗？要把猪价调控下来，<wbr>这对养猪人是莫大的失望啊！\n> \n> @相识是缘：这样变动没人敢再进入养猪业了，我们辛苦了半年多，<wbr>去年一头赔五百多，今年还没挣钱都嫌猪肉贵，<wbr>希望大家替养猪人想想吧。\n> \n> @心语：唉！<wbr>最可恨的是现在集市上竟然还有人明着丈胆卖病死猪肉没有人问，<wbr>那一头病死猪肉要传染多少个村！难道真的就没有人问吗？"
		},
		{
			"post_id": 56,
			"title": "洛杉矶时报 | 王亚秋：为何许多中国学生无法理解香港抗争 ",
			"date_published": 1567391717.328,
			"body": "美国人很难搞懂，<wbr>为何身在西方国家的许多中国留学生最近站出来支持中国政府，<wbr>而非支持香港示威者。在美国、加拿大、澳大利亞和英国，<wbr>都有中国学生试图反制声援香港的集会。\n\n我不认同这些中国学生在香港问题上的亲政府情绪，<wbr>但我想我可以理解他们。<wbr>他们让我回想起2009年初抵美国唸书时的自己。\n\n刚到不久，<wbr>我就亲眼看见流亡藏人在华盛顿特区中国大使馆前的抗议活动，<wbr>但当时我不觉得他们有道理。<wbr>难道藏人不喜欢国家为他们兴建的高速铁路和崭新房屋？<wbr>藏人和汉人做生意不是能赚取更多收入？<wbr>我向主动和我交朋友的藏人提出这些问题──<wbr>他们的父母都是在解放军枪口下逃到印度後生下他们。\n\n还好，面对我这些带著偏见的问题，藏人朋友们总是体谅而非斥责。<wbr>即使如此，<wbr>我还是花了好几年才能在情感层次上理解许多藏人在中国境内遭受的<wbr>苦难。过去我对西藏的想法完全被中共的宣传左右，<wbr>认为中国解放了西藏农奴，给藏人送去了繁荣和幸福。<wbr>政府的言论审查使我没有机会接触不同意见，<wbr>因此我也无法体会藏人为何自焚抗议他们语言、<wbr>文化和认同所受的严重压抑。\n\n研究显示，海外中国学生──总数约150万人，<wbr>其中超过30万人在美国──<wbr>仍然仰赖中国高度审查的网路和媒体获取信息。<wbr>这有助说明部分反香港示威者表现出的狂热，但还有更深层的原因。\n\n对於我们这些在信息控制无所不在的体制下成长的人来说，<wbr>如何处理与我们毕生所学、所信相违背的思想并非易事。<wbr>必须具备天赋的好奇心，<wbr>加上持续阅读未经审查的信息以及自我反思──<wbr>这些在中国都不会受到鼓励。\n\n扬弃不实信息及其衍生的信念，有时要花上一辈子的时间。<wbr>虽然离开中国已经十个寒暑，<wbr>但直到今天我还是不时会怀疑自己所知的真实性──<wbr>因为那些知识都是从中国的学校得来的。\n\n当中国学生来到海外进修，他们必须努力适应不同的教育体系，<wbr>而且经常要在课堂上、生活中或网路上面对一种成见，即他们都是“<wbr>被中国政府洗过脑的”。有些人因此感觉受到攻击，<wbr>更加强化他们在中国被教导的观念：西方世界充满偏见和敌意。\n\n以上这些因素都有助说明为何澳洲塔斯马尼亚大学校园的撑香港海报<wbr>会一再被人撕掉。该校主要中国学生社团指责那些海报“辱华”，<wbr>誓言“坚决捍卫祖国统一…坚决反对一切分裂中国的图谋。” 这些词语全都直接来自中国政府的宣传套话。对这些学生而言，<wbr>从小受到的教育仍然是他们讨论、<wbr>甚至思考政治争议话题的唯一方式。\n\n这无疑正是中国政府想要的。说出自己的想法是人类的本性，<wbr>但当多年的制约教导人们拥有自己的想法并表达出来可能招致严重後<wbr>果，你便渐渐学会避免一切独立思考。\n\n我在中国上学时，面对“毛泽东思想的科学体系”和“<wbr>中国特色社会主义制度”等难以理解的概念，<wbr>我告诉自己不必去思考它们的意义，只要全部背起来应付考试。<wbr>生活在共党统治之下，不思考就是自我保护。\n\n连我们的情绪都要接受国家调教。我们被教导对某些事情感到高兴，<wbr>对其他事情感到悲伤或愤怒，但从不停下来思考为什麽。<wbr>1997年初我的一个朋友从大陆移民到香港後不久，<wbr>中国最高领导人邓小平去世了，<wbr>於是我这位还在唸中学的朋友特地前往中联办（北京驻港办公室）<wbr>致哀。当他走出大楼时，一个香港记者问他为什麽哭。“刹那间，<wbr>我无言以对，” 他告诉我，“我为什麽哭？扪心自问，我还真不知道。”\n\n尽管跟中国学生讨论与他们彻底不同的观念十分困难，<wbr>但持续与他们互动仍然很重要。<wbr>各大学和教师们应当加倍努力进行互相尊重、不作道德判断的交流，<wbr>并留意有些学生可能感到不得不为中国政府辩护。<wbr>中国当局在世界各地校园中监督和监控中国留学生，<wbr>早已不是新鲜事。\n\n虽然近来有些中国学生极力抵制他们不同意的意见，<wbr>但有些大学教授撰文谈到他们和中国学生互动的经验，<wbr>足见人仍有很多人渴望学习且乐於接受说服──<wbr>尤其是当校方能注意到中国学生面临的种种潜在制约。\n\n以我来说，认识到中国政府的人权侵犯，<wbr>引我走向今天在人权观察所从事的工作。展望未来，<wbr>今天的海外留学生将是最有可能返回家乡改变中国的一群。"
		},
		{
			"post_id": 55,
			"title": "路透社：北京指示林郑月娥寸步不让 ",
			"date_published": 1567391638.821,
			"body": "路透社30日引述消息透露，<wbr>香港行政长官林郑月娥在香港爆发反送中运动后，<wbr>当时评估过示威者五大诉求时，特区政府认为撤回《逃犯条例》<wbr>修订可以缓和香港局势，但北京否决其建议，<wbr>当时更命令她不得回应示威者的任何诉求。\n\n路透社指出，今次首次厘清北京在事件中的角色，<wbr>并披露是北京拒绝林郑就解决当前局势的建议，形容反映“<wbr>中国控制香港政府回应社会乱局程度”的实质证据。\n\n> EXCLUSIVE: China's rebuff of a proposal to resolve the crisis in Hong Kong, detailed for the first time by [@Reuters](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=d4cb21c901&e=0b3f48ff7a), represents concrete evidence of the extent to which China is controlling the Hong Kong government's response to the unrest. [https://t.co/dMP6JJYP8C](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=5b07be4da1&e=0b3f48ff7a) [pic.twitter.com/boG64gsLZV](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=16e92faf3d&e=0b3f48ff7a)\n> \n> — Reuters Top News (@Reuters) [August 30, 2019](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=5040470fa2&e=0b3f48ff7a)"
		},
		{
			"post_id": 54,
			"title": "张3丰｜这是一个神奇的圈子 ",
			"date_published": 1567391566.3,
			"body": "文章原标题：这是一个神奇的圈子：<wbr>致力于证明全世界文明都起源于中国\n\n作者：: 张3丰  来源： 大家\n\n我在大阪的时候，去看了丰臣秀吉的大阪城。这里有一个“<wbr>丰国神社”，让我激动了两秒钟，<wbr>毕竟是第一次看到以自己的名字命名的国家。但是转念一想，<wbr>上面可是繁体字，“豐”，不要说写，<wbr>我连这个字有多少笔画都说不清楚，瞬间就高兴不起来了。\n\n![](https://ci5.googleusercontent.com/proxy/Ey34MPyTEacIYlzXceBBijbGG6OIFgmkL34SAk9N78IdYYuAFaNLoGM7xuXP4f_FS9n0kjT0kD7x5F8uIgJgRU3STs7UzHAUUlFA3XlGGA=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/1-24.png)\n\n_丰国神社，为祭奠日本大名丰臣秀吉而兴建。_\n\n如果我坚持这个“丰国”和自己有关，大家肯定会认为我疯了。<wbr>如果还有人和我认真讨论，想说服我相信那个“丰国”和我有关，<wbr>那大家也会认为这个人不正常：这种神经病你搭理他干嘛？\n\n但是，如果我不但可以宣称“丰国”和我有关，<wbr>还能在中国大学讲台上这样讲，还能出版专著，那就不是我病了，<wbr>而是时代和社会已经病了。\n\n最近几天，网上热传的“英语、英国人起源于古华夏”，<wbr>就属于和我上述假设差不多荒唐的妄语，但这并不是随便说说而已，<wbr>而是来自上个月在北京的一次“教育高峰论坛”，<wbr>以杜钢建为首的一群“学者”，还成立了一个“<wbr>世界文明起源研究促进会”。\n\n![](https://ci4.googleusercontent.com/proxy/0dXm6ozGf-qZ28rb5ytjB-EQhFD8_n1weYhYkZTPqsP4KrK9_l47lc0Nie9kn9JQB2mh7qy6cE-wzU7H2B2DnJzCfQ5E3H7rF9I_VQNDwA=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/2-21.png)\n\n在网上搜索发现，早在好几个月前，杜钢建就抛出了“<wbr>英语起源于古华夏”这样的论调，其实这是他整个“<wbr>人类文明起源于湖南”宏论的一部分，核心论据是英国的“英”，<wbr>就是来源于湖南一个叫英山的地方。\n\n在这之前，他还说过法国文化起源于湖南的观点，<wbr>没有引起太大注意。这次“英语起源于古汉语”，<wbr>因为举了一些例子，有一定幽默感，才引起了广泛关注，比如，<wbr>英语中的yellow（黄色），是秋天叶落的颜色，<wbr>英语发音几乎就是“叶落”，shop（商铺），<wbr>英语发音就是汉语“商铺”的发音。\n\n作为一个河南人，我有点着急，想建议家乡的学者，<wbr>趁杜教授没注意，赶紧出一个成果，来证明“荷兰人”来源于河南。<wbr>好歹这也是现代文明的发祥地之一，日本也有过专门的“兰学”。<wbr>这样，别人也就不太好意思老讽刺河南人爱偷井盖了。<wbr>事实证明河南人还是比较老实的，最多只敢说安阳的殷墟很厉害，<wbr>或者臆想一下，“中原就是中国的中心”，“老子是鹿邑人，<wbr>庄子是商丘人”（这个倒是写入了教材）。\n\n![](https://ci4.googleusercontent.com/proxy/d4xRiiyP6tu4ohCzVck6D1lh8CaowiW-TBhD4IWHx6zU2mwbaqjNP4qdg6kKltYPuMCIIB3hIqprpflXezWQGTSOBFGnjDYAvRwsWzR3jQ=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/3-18.png)\n\n_1930年殷墟发掘现场_\n\n对杜钢建这样的言论，如果花上一分钟时间和他讨论，<wbr>你就相当于浪费了人生的60秒。像他这样的，<wbr>我过去曾经见过很多。在报社做编辑的时候，<wbr>经常看到收发室的同事，送一些信件到编辑部来。那些信往往很厚，<wbr>信封上没有明确的收信人名字，只写着“成都x报编辑部”收。<wbr>没有人觉得和自己有关，所以信越攒越多。\n\n有一天我突然感到好奇，心想还有人这么信任报纸，<wbr>一定不要太辜负读者的一番好心了。于是，挨个拆开信封，<wbr>真是大吃一惊：这些信大多是手写的，在早已很难见到的稿纸上。<wbr>信的内容五花八门，但全都是“重大发现”，<wbr>有证明哥德巴赫猜想的（上面还有不少公式），<wbr>也有像杜钢建教授这样的“文化大师”，<wbr>声称自己的家乡是世界文明源头的。最厚的一封信，<wbr>足足有四十多页，虽然也才一两万字字，但毕竟是手写，<wbr>还是非常辛苦。\n\n我看了感到很难过：这个时代，用手写的稿件，编辑都不会再看了。<wbr>你们最起码也应该买一个电脑，把他们录成文档吧。<wbr>后来我才想明白，用手写而不是电脑，<wbr>对他们来说几乎是必然的选择。电脑是现代世界的象征，<wbr>也是人类自启蒙时代以来所开创的科学传统的结果，他们那些“<wbr>想法”和“发现”，本来就不在这个现代文明的进程中。\n\n因此，他们的“发现”，既然没有建立在学术传统（<wbr>没有人谈这个领域已有的成果）中，也不求在学术上得到承认（<wbr>他们不会邮寄给学术杂志，或许也不知道世上还有学术杂志），<wbr>那就必须是用手写的，也注定无法进入思想流通领域，<wbr>寄给一家都市报的编辑部，也压根没有想过能收到回信，这个“<wbr>寄出”本身，就足以感动自己了，他们或许需要的就是这种感觉。<wbr>我能够想象得出他们在现实生活中被边缘化的状态，<wbr>以及他们脸上的倔强。\n\n正经搞学术研究的人，会把上面这些人称之为“民科”，民间科学。\n\n![](https://ci6.googleusercontent.com/proxy/8IcP4QUKaAnjF8oEtcS0cURm7Y13R67Dj6kQO-5r4zOlTpjve3nfkkOkJ8FQ1V6QjCKue9sGPX-2OiVnmtX-LgoqK2d5-ST-hIickesqdg=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/4-10.png)\n\n_杜钢建在节目中声称不寻求同行认可和社会认同_\n\n杜钢建给人的印象，就是这样的民科。现在有一些人到处吹捧他的《<wbr>文明源头与大同世界》，从事学术研究的人，<wbr>会把这当成一个不折不扣的民科笑话。<wbr>这本书看上去像是非法出版物。署名出版机构是“光明出版社”，<wbr>但是经过出版界朋友查询，这本书的书号根本不是中国大陆的。<wbr>在当当网这样的图书销售平台，也查不到这本书的痕迹。“<wbr>光明出版社”给人以非常官方的印象，但其实是在碰瓷“<wbr>光明日报出版社”，在网上根本搜索不到这个出版社的信息。\n\n![](https://ci4.googleusercontent.com/proxy/Rc-BIW0Wo6YXvKZkvSy-zvUH0T0gf09o3LQLMNX3XABMUe1xqDqT7-FDirk_SpJl59G-IFRuyQv18u3_R6L4UakdXrU3KN7ZevD1hsj92A=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/5-12.png)\n\n_光明出版社出版的《文明源头与大同世界》_\n\n![](https://ci4.googleusercontent.com/proxy/BNjljdJNmSJiveAW_k7qF45IATiRTRY-PufLyKXIaa981kcrmQsiYtdaAlJveG_fTrLDOF9CmPfe7DHFMs93pDq3tPgip6pv1162y545=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/6-9.png)\n\n_《文明源头与大同世界》的目录_\n\n但是，杜钢建和所谓的“民科”有很大不同。他是湖南大学的教授，<wbr>根据网上的介绍，他甚至当过湖南大学法学院院长。<wbr>湖南大学法学院官方网站显示，2010年到2015年，<wbr>杜钢建确实担任该院院长一职，学科方向是“宪法与行政法”。<wbr>浏览网上资料我们会发现，2015年以前的杜钢建，<wbr>是一个中规中矩的法学学者，学术论文至少从题目上看也非常规范。\n\n![](https://ci5.googleusercontent.com/proxy/4_bymTeiPmGNlfrk0ZSLkdHpx6qfB39evElxd2hwEGAXgUkfPvX1lq845DFsceOHksLD6-1F4kGTwael6K3KQjIc04nky9DgIaC5XcNq=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/7-8.png)\n\n_湖南大学法学院官网上关于杜钢建的个人信息_\n\n杜钢建的“转型”或者“爆发”，<wbr>是在从法学院院长的位子上退下来后，出生于1956年的他，<wbr>也正好到了退休年龄。或许正是这个原因，<wbr>让他获得了一个含混的身份。他既是“湖南大学教授”“院长”，<wbr>在校外可以打着“权威”的招牌，而学校又因为他接近退休，<wbr>对他的行为也不好再说什么。\n\n正是这种含混的优势，让杜钢建在一个群体中获得了特别的身份。<wbr>从2017年开始，以他为中心形成了一个“大同”圈子，<wbr>宣传世界文明都起源于中国。网上信息显示，<wbr>去年杜钢建就在北京第二外语学院发表了“英人、英语起源于中国”<wbr>的演讲。尽管他们的主张看上去荒诞不经，<wbr>却能给人一种在非常正规的学术舞台上进行演出的印象，<wbr>今年能成立一个研究会，也就再正常不过的事情了。\n\n![](https://ci3.googleusercontent.com/proxy/Yu7JlGly2AdcWxzATeIvbbzElwWKuczerm_bOEhGfPb9Q0maHWQmZvk4aclkK28J_J-yEF2eRiF8VI7GkOEA6chdG6aB7EALoqBoLrfK=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/8-6.png)\n\n_2017年，杜钢建接受北京时间的访谈_\n\n正常社会，人当然可以有这样的主张，也可以成立各种研究会，<wbr>这是每个人应该有的权利。但是作为严肃的学术机构，<wbr>高校对这样的“研究”和“主张”却不能不加以辨别，<wbr>因为这毕竟牵涉到学校的声誉。\n\n这个群体公然在大学里活动，是相当荒谬的场景。<wbr>除了杜钢建的身份外，他们的主张看上去非常“爱国”<wbr>也是一个原因。主张“世界文明起源于中国”，<wbr>看起来总是让人舒服的。和杜钢建相比，很多学者为了把“<wbr>中华文明”往前推个几百上千年，到处找证据搞论证，<wbr>费了很多功夫，真是太不“聪明”了。\n\n**相关阅读：**\n\n*   2019.04.04 [叙拉古之惑：“战狼学者”诞生记——<wbr>杜钢建教授及其恩主](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=fabf5f7d16&e=0b3f48ff7a \"叙拉古之惑：“战狼学者”诞生记——杜钢建教授及其恩主\")"
		},
		{
			"post_id": 53,
			"title": "【立此存照】朱秀玲投诉信 ",
			"date_published": 1567391502.38,
			"body": "CDT编者按：朱秀玲因买了两张去北戴河的车票，<wbr>想带女儿去北戴河玩，被关进看守所，遭到虐待。<wbr>此为她投诉北京市公安局监所管理总队的投诉信。\n\n![](https://ci3.googleusercontent.com/proxy/LxDL3ctCZehr7DnzkmlhxZseRrG7fDfJKnS0p3KzAGy29aXLmzJEQxYP4q5oRZiQu132TPt3aaeKPJjRw6CIvIcsej6-zyAdhUrMZUPWPDFRYCJvvjKyeA4rCWzPmQPaMd36iQCqDCl5b3nyqpSWKPvIMtb0vFmSuA=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/69951232_127583255196459_1846454445399867392_n.jpg)​​​​​​​"
		},
		{
			"post_id": 52,
			"title": "杜耀明：是林郑月娥，不是香港，进入了失控的紧急状态 ",
			"date_published": 1567391426.316,
			"body": "![](https://ci3.googleusercontent.com/proxy/VJNEHWTVsP8S7929HqcsVLyvXBvWejMyQDSfMQGIUbxGRGKC26OzsuRQskU30u_04CfA6Q29aCRrehNVhPsNMPXx6tfovJ9wvdKxattj2A=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/1-7.jpeg)\n\n和风仍未吹起，特首林郑月娥又故态复萌，并且变本加厉，<wbr>企图宣布香港进入紧急状态，以便用人治代替法治，<wbr>以恐怖手段去收复现时的局面。\n\n两个多月来，特区当局解决危机的方法，一次又一次，<wbr>不是化解而是制造更大的危机。单凭这种本领，<wbr>足证林郑政府正是香港动乱之源，她不下台，<wbr>现有局面注定没有最差，只有更差。\n\n六月九日百万人上街抗议「送中」恶法，林郑若顺应民情，<wbr>立即撤回《逃犯条例》修订草案，问题早已告一段落。<wbr>怎料她背逆民意，坚持尽速通过恶法，并同时以武力镇压反对者，<wbr>导致六月十二日警方残忍无度伤害示威人士，<wbr>结果政策错误没有纠正，更添上警方施暴的问题，惹起更大公愤。\n\n面对危机，林郑只暂缓恶法的立法工作，<wbr>并以更强悍的警力对付群情汹涌的反对浪潮，同时表明撑警，<wbr>以换取「枪杆子」的支持。自此以往，警暴变本加厉，<wbr>林郑的施政失败，也由警方更多更丑陋的滥暴行为所掩盖。<wbr>再加上不知是谁的主意，由七月二十一日开始，<wbr>有人借助黑帮势力向市民作无区别袭击，警方却慢条斯理，<wbr>令公众安全不保，更令人对警黑合作深恶痛绝，警民关系立即崩溃，<wbr>街头抗争持续不断。\n\n毫不例外，当局近期的连串举措亦只会使情况恶化。<wbr>八月十八日全港大集会在即，解放军入城的谣言传遍香港，<wbr>但一百七十万人依然冒雨上街抗议，令谎言不攻自破。<wbr>林郑月娥和北京的第二支治港队伍眼见恐吓失败，<wbr>只好改为软硬兼施。一方面吹出和风，提出设立沟通平台，<wbr>首先召集友好围炉取暖，但同时秋后算账，向不少企业施压，解雇「<wbr>反送中」运动支持者，又封闭地铁站，阻碍市民参与合法示威活动。<wbr>到近日，林郑甚至考虑宣布香港进入紧急状态，<wbr>打算以严苛法规以至极端手段制止反对声音，<wbr>收拾她自己一手炮制出来的残局。\n\n新一轮的软硬兼施根本是旧调重弹，从几方面看，<wbr>都毫无诚意解决问题。一是转移视线、推卸责任，<wbr>完全无视当前危机的根本因由​​是林郑对民间五项诉求全部拒绝；<wbr>二是纵容警方滥用暴力，不惜牺牲警队声誉，以警权解决政治问题；<wbr>三是分化前线及其他示威者，把前者视为暴徒，先沉重打击他们，<wbr>再对付和平示威者。由始至今，林郑只把反对者视为仇敌，<wbr>再分批击倒，因此和谈沟通只是掩饰，暴力镇压才是真章。\n\n更离谱的是，眼见警方暴力镇压两个多月，拘捕接近九百人，<wbr>街头抗争依然不绝如缕，林郑应痛定思痛，推动政治和解，<wbr>但她反而坚持以武力解决政治问题，<wbr>更认定问题持续是由于武力不足，因此正考虑通过《<wbr>紧急情况规例条例》（《紧急法》），授权政府可以无限制的权力，<wbr>包括随意搜查、逮捕、拘留等等，以对付示威者，<wbr>并且可以为所欲为，由查封传媒、禁闭网路以至控制交通工具、<wbr>冻结资产、接管企业等等。\n\n《紧急法》一旦通过，香港将进入非常状态，<wbr>其要害就是人治代替法治。按照该法，<wbr>特首会同行政会议即可自行立法，<wbr>制订当局认为合乎公众利益的规例，<wbr>让他们在十四方面无限扩充权力，<wbr>以应付他们认定的紧急状况和公安问题。换言之，《紧急法》<wbr>让林郑自己授权自己，假法律之名，行独裁之实。\n\n但谁会相信香港已处危急存亡之秋，因此必须以紧急措施恢复秩序，<wbr>特别是警方武力远超前线示威者，除非主动放水，<wbr>次次清场都无往而不利，<wbr>而示威者的抗争形式亦由正面对峙转为快闪式游击突袭，<wbr>对市民的安危影响不大。同时，眼下困局是由于林郑舍正路而不由，<wbr>坚持错误，死口不撤回法案，并且誓死效忠香港警队，<wbr>试问有谁会认同颁布《紧急法》是别无选择？\n\n更何况，目前反对她出任特首的比率（76%）是历史新高，<wbr>远远超过支持率（17%）（即支持率净值是-59%），<wbr>而对特区政府的满意率净值亦数值相近（ -63%）。一个与民为敌的政府，在此时刻推出《紧急法》，<wbr>变法治为人治，在民众看来，不外是要打压异己、清除异见，<wbr>林郑月娥的轻举妄动只会惹起更大的民愤和反抗，<wbr>再一次制造更大的危机。\n\n（以上评论纯属作者个人观点，并不代表本台立场。）"
		},
		{
			"post_id": 51,
			"title": "【网络民议】“香港加油！有良知的大陆人和你们站在一起！” ",
			"date_published": 1567391225.206,
			"body": "CDT编辑注：来自《悲惨世界》的歌曲“Do You Hear the Hong Kong People Sing?”日前从墙内各大音乐平台上下架。这段视频来自来自[Y<wbr>outube博主HK isn’t DONE! yet](https://chinadigitaltimes.us4.list-manage.com/track/click?u=17daa75df533f6c6ff72e51ab&id=9d49d77d31&e=0b3f48ff7a)，由一群香港年轻人演唱。<wbr>下面的评论中有许多自称来自中国大陆的支持者。\n\n![](https://ci5.googleusercontent.com/proxy/aF2eKVo1smt49Y8BrXaHm3MzpFCSnY42nclyi5FWkmz577SCAH7-p1yLeXrNjNu34s10sDxn8j95J8rgqcxTUB0ul9Axqx33s21s-iky-0SWaN74sanp2nRJAOtVujuGQZFORHaGclwHdn7KOEF3H2znMVdm-afSZ5rwkaxV=s0-d-e1-ft#https://chinadigitaltimes.net/chinese/files/2019/08/Screen-Shot-2019-08-31-at-8.00.09-AM-e1567256436733.png)\n\n@HK isn’t DONE! yet: 我們只是一群熱愛音樂，熱愛影像創作，熱愛香港的年輕人。\n香港人，辛苦了。路還很長，讓我們為你打打氣。\n永遠不會忘記那為我們從高牆墮下的他。\n\n以下评论由CDT辑自网络：\n\nShuxiao Wang: 加油，来自大陆的支持。请原谅我无法拿出实际的支持，<wbr>原谅我们大多数人不知道真相，或者是没有勇气。<wbr>如果你们在内地的社交媒体上看到恶毒的言论，过分的话语，<wbr>请原谅他们！\n\nFrederick Insights: 香港加油，大陆还是有很多支持你们的人，只是大多被禁声了。\n那些翻墙出来叫骂的义和团让你们见笑了，<wbr>他们只是意识形态教化的产物，不要在意。\n民权自由法治无价，你们要顶住。\n\nvillage zhang: 说起来真是讽刺，这首歌在大陆下架了，<wbr>果然他们害怕人民害怕自由勇敢的人\n\n江沉: 香港加油！来自大陆的声援，原谅我们无法发声，<wbr>原谅我们无法从官方途径得到真相，原谅我们只能沉默，<wbr>有良知的大陆人和你们站在一起！\n\nAda Zhong: 香港加油！人在墙外，看到了很多真相，<wbr>人生第一次感觉自己的心跟香港离得那么近，香港牵动着我的心！<wbr>香港加油！为香港的勇士点赞！感谢你们为所有华人在战斗！\n\nSelf Liberate: 理解香港。我不与邪恶力量为伍。香港此次事件，<wbr>让我看透了大陆人的认知水平和价值观念。<wbr>从此只有出走是我人生的出路。\n香港人保重，我会记得你们曾经为大陆做过的善举，<wbr>也会记得你们追求人类文明的每一幕画面。\n无论如何，请循着希望生活下去，或抗争，或远走。\n\nHuang LiJi: 广西人搭梯子前来支持香港！\n\nJessica W: 来自大陆，刚刚注册的账号，<wbr>这边真的有很多人在默默关注和支持你们，请继续加油吧！\n\nhailey: 珠海路过～和香港澳门很近！\n经过6.9从蓝丝变成黄丝\n彻底从“没有共产党.没有新中国”活过来\n彻底明白什么是洗脑教育～\n香港人很团结！真的要加油～\n\nEirca Huo: 香港加油，或者很多内地人喜欢香港是因为购物和玩乐，<wbr>但我是因为你们有更多的自由，可以纪念六四、<wbr>有很多大陆无法出版的书，<wbr>最重要的是香港人不时展现出的对自己家园的热爱 和 为自由、正义而战的勇气；<wbr>从第一次听到当年为六四创作的一些歌曲，<wbr>我才发现原来音乐可以这么有感情的表达我们的信念与价值观，<wbr>香港文化不止是那些还可以被听到、看到的流行音乐 和 电影，多谢你，香港。\n\n刘晨: 大陆高中生表示，香港加油，为权益而斗争的人加油。<wbr>人民的意志是统一的，这才是统一的国家。\n\nzhangye fan: 昨天这首歌墙内被封了，简单粗暴。因为被封才想重温，<wbr>才翻到你们的这首歌，加油\n\nMiserables Les: 我无能为力，但我至少不会自甘沉沦\n——from 北京\n\nRocketSTI: 香港人加油 来自温哥华大陆同胞的祝福 大陆可以没民主没人权 但香港要坚持到底 唯一有人权的地方。为香港年轻人加油\n\nG Fujinshi: 天安門事件發生的時候，香港就一直在支持大陸的民運，<wbr>到後來黃雀行動，<wbr>再後來每年的維多利亞六四晚會都是港人在支持國內鬥爭的縮影。<wbr>而今天，作為一個土生土長在北京天安門旁邊的人，遠在大洋彼岸，<wbr>只能在評論區說一句香港加油！湧泉之恩，只得滴水相報，慚愧\n\nMIKE MIKE: 加油啊，大陆内蒙古地区支持港人返送中退恶法，<wbr>从心里敬佩那些走在前线争取民主的人\n\n二十一世紀青年: 我是成都人，香港加油\n\neo L: 香港加油！大陸廣東人在此支持！\n\nFiamma Sun: 听哭了。全国上下唯一一片还有人性之光的热土。<wbr>心疼香港经历的一切，想跟你们say sorry。隔着深圳河，给你们加油！不要沦陷！\n\nCS tudent: 我翻出来完整看了事情来龙去脉 才明白官媒玩选择性披露 颠倒是非 真是恶心坏了\n我没法做什么 也没法说什么 只能说声坚持加油\n\nzs z: 不论雨怎么打，自由仍是会开花 加油香港！"
		},
		{
			"post_id": 50,
			"title": "消息：中国央行拟最早11月11日发行自己的加密货币",
			"date_published": 1567328694.6,
			"body": "**中国央行拟最早11月11日发行自己的加密货币\n美国金融杂志福布斯获悉，中国计划最早于11月11日发行自己的加密货币。那天是中国的双十一购物节，是网购最为火爆的一天。据福布斯报道，两位消息人士称，中国人民银行计划在初期阶段通过至少七家机构和四家国有银行发行自己的加密货币，其中包括包括阿里巴巴、腾讯和中国银联。两位消息人士中，一位参与了中国央行加密货币研发工作，另一位以前是上述七家机构之一的员工，现在是一名独立研究员。一些分析师指出，在美国社交媒体巨擘Facebook 6月宣布计划一年内推出数字货币Libra之后，中国似乎就加快了推动发行数字货币的努力。面簿的计划令全球政策制定者大感震惊，并激起监管疑虑。Libra是目前提议中的最受关注的数字货币。**"
		},
		{
			"post_id": 49,
			"title": "周保松：我们也在为你们争自由 ",
			"date_published": 1565970580.275,
			"body": "我们也在为你们争自由\n－－致内地朋友\n\n周保松\n\n（CDT编者按：文章转自周保松教授的Facebook）\n\n这两个月，我每天收到许多内地朋友的来信，<wbr>对香港当下的抗争运动提出各种建议和批评。大部份都是善意的。<wbr>我在此谢谢大家对香港的关心。由于来信太多，难以一一回覆，<wbr>我在这里一并简覆。\n\n1，在中国官方铺天盖地的文宣中，<wbr>已将这场百万计香港人参与的社会运动定性为港独、暴动、<wbr>颜色革命，甚至恐怖主义，然后动用国家机器，<wbr>全面封锁有关香港的各种资讯，并用尽各种卑鄙手段抹黑整场运动，<wbr>煽动内地人对香港人产生各种基于虚假讯息而来的仇恨。\n\n实情真的是这样吗？\n\n国内一位研究社会运动和民主转型的著名学者，昨天给我来信：「<wbr>持续数月的大规模抗议，几百万人在街上，到目前为止，<wbr>暴力程度可说微乎其微。别说和巴西、乌克兰这样的的地方比，<wbr>即使是和法国黄背心或者伦敦抗议G20比，也是非常文明了。<wbr>说实话，这场运动让我确实对香港人的『素质』印象深刻。<wbr>中国当政者经常以中国人的『素质』来抵制民主，说实话，<wbr>整个地球真不知哪里的素质比香港更高的了。」\n\n这场运动当然有许多不理想，并值得批评之处，<wbr>包括前两天的机场打人事件。作为运动参与者，我们必须保持清醒，<wbr>对运动的目标和手段不断作出检讨，<wbr>并以最高的道德要求来约束和指导我们的实践。只有这样，<wbr>我们才能争取到香港市民和世界人民最大的同情和支持，<wbr>我们自己也才能在运动中成长和进步，实现和完善自己的人格，<wbr>成为真正具公民德性的香港人。\n\n我们很清楚，这场运动的成败，这场运动留给香港和历史什么，<wbr>和我们每个人的作为息息相关。我们充分意识到这份责任，<wbr>并因此戒慎戒惧。\n\n但我恳请大家也要明白，这是一场没有大台、没有领袖、<wbr>没有政党主导，有过百万香港人以不同方式参与的超大型社会运动，<wbr>而且同时面对来自中国政府、香港政府、香港警察、<wbr>黑社会等各式各样的严厉打压。\n\n从6月9日百万人上街始，我们一路走来，<wbr>政府没有一个人问责下台，<wbr>人民最基本的呼声和诉求得不到政府任何合理回应。等待我们的，<wbr>却是香港史上最大规模的武力镇压，<wbr>抗争者和普通市民在香港各区尝尽催泪弹和警棍的滋味，<wbr>迄今已有超过七百人被捕，无数人受伤，<wbr>好几位年轻人甚至以死发出最后的呐喊。\n\n我们必须明白，这样一场运动，能够一直走到今天，<wbr>说是奇迹也不为过。<wbr>如果没有无数无姓名无脸孔的香港人在不同岗位默默努力，<wbr>彼此扶持，香港人不可能支持到现在－－而且是理性、有原则、<wbr>有尊严地坚持着。\n\n大家试想像一下，如果同样一场运动，发生在北京、上海、广州，<wbr>或中国任何一个城市，能够比香港人做得更好吗？ ！\n\n在运动过程中，发生一些我们不愿见到的冲突，其实完全可以预计。<wbr>因为各种原因，类似事件可能陆续有来。但我们千万不要想像一种「<wbr>完美社会运动」，然后以此要求一场真实发生、无数人参与、<wbr>牵涉各种利益、矛盾、张力，<wbr>并要即时作出各种艰难判断的社会抗争，<wbr>必须要在道德上符合你的所有的完美想像。\n\n这不现实，也不公平。 （当然，这绝对也不是我们为任何行动错误卸责的借口。）\n\n如果大家跟着官方的宣传口径，<wbr>仅仅因为过程中发生一些我们不愿见到的冲突，<wbr>然后便借此否定整场运动，否定所有参与者，<wbr>否定运动中实践的各种美好，那不仅是知性上愚蠢，<wbr>同时也不自觉地做了权力的帮凶。\n\n2，这是一场什么性质的运动？它肯定不是什么港独运动，<wbr>更不是什么颜色革命。这场运动中的五大诉求，<wbr>没有一条逾越现有制度和《基本法》的要求。<wbr>要求正式撤回修订条例、要求成立独立调查委员会、要求重启政改，<wbr>没有一条不是合情合理，而且完全在政府权限之内。\n\n这些不仅是前线示威者的诉求，也是法律界、学术界、商界、<wbr>医疗界、艺术界、社工界、前政府高层、政府公务员，<wbr>以至各种社会知名人士的共同诉求。\n\n我们必须明白，是特首林郑月娥及背后的中国政府，<wbr>一直不愿意回应这些合情合理的诉求，<wbr>并动用警力强硬镇压和拘捕示威者，<wbr>才导致后来愈来愈严重的警民冲突。\n\n如果有人毫无保留地站在高墙那一边、<wbr>并有意识地漠视这两个多月来事件发生的前因后果，<wbr>并用最恶毒的语言去谴责香港的年青人，那么请各位扪心自问，<wbr>你们的道德义愤，是不是过于廉价，甚至过于无耻了一点。\n\n3，内地朋友都很清楚，中国今天绝对没有言论、<wbr>思想自由和新闻自由。所有关于香港的讯息，<wbr>都由官方严密控制和筛选，甚至公然扭曲和作假。<wbr>许多朋友的微博和微信帐号，<wbr>仅仅因为转发一些关于香港的真实讯息，便被炸号，甚至被喝茶。\n\n远的不说，就看看央视新闻8月12日于微博公然撒谎，称「<wbr>香港示威女子被『猪队友』击中眼睛，视力受损」，<wbr>便可见到官方媒体可以无耻到什么地步。\n\n更可笑的是，8月12日凌晨，环球时报记者付国豪在机场被打后，<wbr>香港年青人当晚经过集体讨论，认为这样做错了，<wbr>必须真诚地公开道歉。于是第二天一早，<wbr>他们在机铁和机场派发道歉声明，甚至有年青人在机场90度鞠躬，<wbr>向乘客道歉。\n\n可是这些广泛流传的道歉声明和相片，却在大陆彻底被禁。<wbr>为什么会这样？既然中国政府带头严厉指责香港年轻人做错了，<wbr>并发动全国群众大攻击，那么他们知错能改，立即毫无保留地道歉，<wbr>为什么却要封锁这些消息，不让内地同胞知道，<wbr>并让对香港人的仇恨，继续在大陆不断扩散和加深？\n\n任何的批评，都必须基于事实。没有言论和新闻自由，<wbr>便没有事实可言。既然香港这场运动如此十恶不赦，<wbr>政府何不开放言论，让广大人民群众充份了解真相，<wbr>然后作出猛烈精准的批判，从而大快人心？\n\n各位可以用你们的常识，想想为什么吗？\n\n4，香港这场浩浩荡荡的抗争运动，说到底，<wbr>就是香港人不甘于认命，为了捍卫自己的自由和权利，<wbr>争取自己应得的民主和自治，大家一起站出来抗争的运动。<wbr>这场抗争，赢得全世界人民的关注和同情。\n\n不过，许多内地朋友或许没有意识到，香港人的当下抗争，<wbr>不仅是为了自己的自由而战，也是为了中国所有人的自由而战。<wbr>香港是中国的一部份，香港有自由，<wbr>就意味着中国荒凉专制的大地上，有那么一小片自由的绿洲。\n\n有了这样的自由，大家才能自由行来香港，<wbr>享受许多在内地无法享有的自由，包括不用翻墙便可以 看到许多被禁的新闻和纪录片，<wbr>买到许多内地无法读到的关于中国当代史的好书，<wbr>甚至可以没有恐惧地参与游行，大叫「建设民主中国」。<wbr>有了这样的自由，内地生才能在有学术自由的大学，<wbr>自由思想自由探索。\n\n更重要的是，香港人当下每一场抗争，<wbr>都是在推动中国走向自由法治和民主的重要力量。如果不是，<wbr>中国政府就不会那么恐惧，<wbr>用尽各种手段来抹黑和封锁这场运动的所有消息。\n\n5，各位内地朋友，三十年前，上百万香港人，<wbr>声援北京的民主运动。此后三十年，我们不离不弃，<wbr>每年六月四日都在维园点起烛光，纪念死去的亡灵，<wbr>并为中国的自由、民主奋力呐喊。<wbr>而香港人对于中国发生的各种自然灾难和政治压迫，<wbr>更是毫不犹豫和不计代价地伸出援手。\n\n香港人极度天真，极度爱国。\n\n去到今天，香港命运来到最关键的时候，<wbr>无数香港人站出来为自己的自由和尊严奋力而战，前路不明，<wbr>但可以预见代价沉重。当下此刻，我们其实很需要，<wbr>很需要世界更多人的理解和支持。\n\n可是我们知道，你们的环境很不容易。所以，<wbr>我们从不期望得到你们的支持，<wbr>但如果各位连最基本的同情和理解都没有，<wbr>并不加反思地跟着官方调子起舞，<wbr>用尽你们的道德力量谴责正在苦苦抗争的香港人，<wbr>这却是一件多么讽刺多么教人伤心的事。\n\n自己的自由要自己争。愿你们明白。\n\n2019.8.16"
		},
		{
			"post_id": 48,
			"title": "[無極炁]深圳河对岸的生活如何?",
			"date_published": 1565757587.796,
			"body": "内容转自网络\n\n      河对岸的事情，变得很敏感，好多事情不能多谈，亦不能谈深，这篇文章仅仅是列举一些事实数据，请读者多看多听少下结论。\n\n![](https://luoimg.com/u/20190813/18352494.jpg) \n\n      回想80-90-00年代，我们谈到那里，都会第一时间想到繁华璀璨的都市、自由开放的港口，以及大量当地的电影、音乐、电视等文化作品。那时，这个城市给我们带来的大都是积极的印象与美好的向往。\n\n而如今，只要谈到那里，十个人有八个会想起棺材房，会强调年轻人没有未来，说他们不思进取、游手好闲、制造事端，还会潜意识觉得他们收入停滞不前，似乎这已经成了指定动作（就像一提到美国，想到的都是枪击和种族歧视）。\n\n河对岸的城市居民，他们生活的实际情况是怎样的呢？我们通过数据看一看、比一比、想一想。\n\n**看房价**\n\n在我们看来，他们最大的问题可能就是高到难以担负的房价和遍地的棺材房了，那么事实是怎样的？\n\n目前，这座城市住房自有率50%，困难的市民可以排公屋，商品房贷款的利率只有2%出头。而全市人口中，居住在劏房（分隔式房屋）的人在20万左右，占全城740万人的比例为2.7%，在教育和统计当中，小于5%即可理解为小概率事件，劏房住户的比例只有统计学“小概率”的一半水平，完全不是主流。\n\n由于面积相对更小，他们的商品房总价也并没有大多数人想象的那么高，2018年该地房产的中位数总价为540万港币，深圳为352万人民币，虽然房屋总价高一点，但**南边的中位数收入是北边的近4倍**（请参考后文中居民收入部分的内容）。\n\n而那边贷款利率只有2%出头，深圳为4.9%（还要不同程度地上浮），以30年按揭为例，目前同样的贷款额对岸的月供要比我们少30%。\n\n![](https://luoimg.com/u/20190813/18241694.jpg) \n\n当地房产中位数总价 - 540万港币\n\n![](https://luoimg.com/u/20190813/18283820.jpg) \n\n深圳2018年住房中位数总价352万\n\n深圳河南北两地的房价压力，我们可以这样总结：南边的总价比北边高50%，但收入是北边的三四倍，按揭利率不到北边的一半，首付比例差不多。那么哪一边买房的压力更大，不言而喻。**如果北边嘲笑南边买房难，这不是五十步笑百步，而是一百步笑五十步。**\n\n**看社会保障**\n\n河对岸的社会保障有很多，这里以综援（综合社会保障援助计划）为例，综援的覆盖面非常广，涉及**年老、残疾、单亲、健康、低收入、失业**等等问题，一个失业的四口之家，每月可以领到近1.2万的救助，还能减免公屋租金。客观来说，仅靠综援虽然生活仍不富裕，但在这个城市可以过上有一定质量的温饱生活。\n\n![](https://luoimg.com/u/20190813/18241884.jpg) \n\n失业四口之家的综援金额\n\n截止2018年11月，当地综援覆盖了近23万市民，但2010年以来，综援案例数量逐步下降，间接反映困难市民的数量在减少。\n\n![](https://luoimg.com/u/20190813/18241838.jpg) \n\n综援相关数据 -  2018总件数及历史趋势\n\n而即便综援总案例数量不断减少，当地政府在社会福利方面的开支在过去十年仍保持快速增长，可见对于每个困难市民的平均救助力度在更大幅度地增加。\n\n![](https://luoimg.com/u/20190813/18241985.jpg) \n\n综援相关数据 - 各类预算开支\n\n**看居民收入**\n\n这个城市在2010年时中位数月薪为11800，2018年增长到17500，八年增长了近50%，远远跑赢当地的GDP增速和通货膨胀，一味地强调同胞们的收入没有增长或没有未来，显然是颠倒黑白。值得注意的是，2017年时，深圳的工资中位数只有4415元。由于这两座城市的平均月薪都远高于中位数月薪（两地贫富差距都很大），中位数代表排名前50%的工资，在贫富差距较严重的背景下，具有更好的代表性。\n\n![](https://luoimg.com/u/20190813/18242040.jpg) \n\n当地所有雇员中位数月薪数据2010-2018\n\n![](https://luoimg.com/u/20190813/18242171.jpg) \n\n深圳中位数工资数据 2017\n\n**看教育**\n\n这座城市虽然只是弹丸之地，但却坐拥四所全球排名前100的高校，其中有三所在全球排名前50名的行列。\n\n![](https://luoimg.com/u/20190813/18242246.jpg) \n\n当地高校的世界排名\n\n**看经济**\n\n这座城市在世界上的地位可能是华人世界里最高的，她的金融影响力和纽约、伦敦并驾齐驱。近年来常被笑话产业空心化，但如果你仔细看看，我们身边崛起的科技巨头如腾讯、小米，纷纷选择到那边去IPO，阿里也打算从美国过去，他们吃到了更多的资本红利；更有无数富豪选择过去买房置业，例如通过王者荣耀暴富的腾讯高管姚晓光，也选择斥资9800万港币在那里买房。可以说，有资本和有条件的空心不是真的空心，而是转型，否则资本为何拥抱这座城市？\n\n值得一提的是，这个城市的IPO规模连年与美国纽约争锋，也是二十一世纪中美资本争夺战的最重要干将，是**名副其实的全球金融中心**。\n\n![](https://luoimg.com/u/20190813/18242283.jpg) \n\n当地经济稳步增长，人均GDP逼近5万美元\n\n**看衣食住行**\n\n这个城市除了住的成本较高以外（上文房地产部分已深入谈过这个问题），**衣食行都有很好的体验**。他们有**价格远低于对岸的国际大牌、有不用担心地沟油的街边小吃、有规划完善和商业模式可持续且卫生状况好得多的公共交通系统**；他们还可以**免签前往世界上165个国家和地区**，可以真正做到说走就走的旅行（值得一提的是，他们在出国旅行、出境投资或购房时，换取外币也是不限额的）。另一方，他们还**拥有全球最长的人均寿命**，活得好不好，这个指标最有说服力。\n\n![](https://luoimg.com/u/20190813/18242378.jpg) \n\n当地护照的免签地图\n\n![](https://luoimg.com/u/20190813/18242384.jpg) \n\n当地男性和女性的人均寿命均为世界第一\n\n**看第二选择**\n\n我们常说自己的选择空间多，可以从一线城市到二三四线去，那么成本和压力就小得多了，而他们只是一个孤岛，他们根本无处可去。其实**这个说法是错的**。现在他们的护照可以在中国任何一个地方工作和长期生活，也就是说，**我们有的退路他们都有，他们不来只是因为看不上而已**；另外，我们没有的退路他们也有，他们移居或移民加拿大、澳洲、英国无论是身份、语言还是文化上，都比我们容易很多。\n\n**总结**\n\n说实话，经过上述信息的整理，笔者也感触很深，**河对岸的市民的幸福程度远远超过我之前的预期**。\n\n无论你生活在河的哪一边，我们都是中国儿女，应该彼此尊重，增进相互了解，充分互动、讨论、包容。对待一些事情，有不同的理解很正常，但最终需要通过广泛的讨论和争议才能寻求解决，如果只是通过有选择的诋毁、仇恨来一边倒地黑化对方，削低读者智商，最终只会进一步增加隔阂，有百害而无一利。"
		},
		{
			"post_id": 47,
			"title": "写在红到漆黑的惨夜前的香港",
			"date_published": 1565757401.797,
			"body": "写在红到漆黑的惨夜里，第一束光缕的前夜！\n周六与球友去踢球，去球场的路上，正值南方潮热的夏天晚上，要经过一段阴森的路段，旺盛茂密树木遮天蔽日，不是特色路段，自然也无特色照顾，没有修葺枝丫张牙舞爪，一路走过，垂下的枝条就像厉鬼的爪牙。此时，我却觉得还好，莫名的安全，这时，我喜欢和球友讲一些让他害怕的事情，就是政治。当然大部分都是猎奇或者笑话，久而久之，作为996的程序员，球友或许有几分加班之痛，聊的很是开心，当然拜这段荒芜阴森的道路所赐的安全，没有举报没有摄像头，自然也没有红卫兵。周六临近球场之时，就说到了最近的香港，球友情绪激动了起来，“香港就一个弹丸之地，闹什么闹，断水断粮怎么生存，就是找死。”刚好到了，球场门口冲凉换球衣的地方，也就没有过多再讨论下去。\n我觉得，我没有敌人，我只有敌党。以及敌党里面杀人害命的犯罪份子。\n踢完球以后已经是将夜，一路走来，竟是无法开口续谈话题，觉得奇怪，久之才发现，球友当时不容沟通的口吻与戾气，给我带来恐惧，让我想起了大陆有个网友，说的像64坦克上车压死香港人的言论。自是让很多的对话和讨论，一开始便被对话的其中一方打上了死结，如另外一方没有打上第一个死结，那便会打一个更大的死结，一路过来就是死结的疙瘩，如果都是打结高手，自然就变成了农村泼妇团战，抓而挠鳃，皆是，你这狗日的，我日尼玛逼，比之就变成世道。一个和善有爱与人为善，踢球连射门大力一点打到门将都要抱歉的人，日常996都和颜悦色的人，为何提到香港就如此戾气十足，这就需要深思。不仅这位球友，我身边的人提起在朝党府，无不摇头，一到港台，便也是红的让人害怕。其戾气与恶毒，不亚于新闻上最近出没的喉舌和无毛。这就是异常吊诡的事情。这就像某些人在他们头里装上了一个港台新闻触发芯片，平常是正常人，到了港台模式触发了，自然就变得面目狰狞的另外一幅面孔。\n2018年12月13日\n台北地方檢察署正式通緝香港男子陳同佳，指他同年2月在台北殺害一起到當地旅行的女友潘曉穎，但因為香港和台灣沒有引渡協議，無法向香港申請將他引渡返回當地受審。\n2019年2月12日\n香港立法會議員與台灣殺人案受害者的母親一起召開記者會。受害者母親說她希望香港可以修改法例，堵塞漏洞。\n2019年2月13日\n香港政府正式宣佈提出修改《逃犯條例》和《刑事互助條例》，當中刪除原有條文訂明引渡法例不適用於中國大陸、澳門和台灣的限制引來外界關注。\n2019年2月21日      \n台灣陸委會表示，不同意香港政府以「一個中國」為前提修改引渡法例，以此與台方交涉\n2019年3月4日\n香港大律師公會發表聲明，批評政府曾經承諾「不會在沒有詢問公眾」就跟中國大陸商討引渡協議，而政府的修例建議違反這個承諾。\n2019年3月26日\n香港政府第一次修改修法建議\n香港保安局局長李家超宣佈，刪除修訂中九條可引渡罪行，涉及逃稅、 公司法、環保等罪名，中國大陸等司法管轄區不能以這些罪名為由，要求香港引渡嫌疑犯。\n2019年3月31日\n首次遊行\n香港公眾首次舉行反對修例建議的遊行，舉辦方表示約1.2萬人參加。銅鑼灣書店原店長林榮基也有參加，他早前被中國政府指控「非法經營罪」，他說修訂如果通過，中國政府就有充份理由引渡他回中國大陸受審，因此他在修訂通過前離開香港。\n2019年4月3日\n香港立法會為修例建議進行首讀和二讀，開始立法過程。立法會依例中止待續（暫停全體會議二讀），先成立法案委員會詳細審議\n2019年5月17日\n中國中央政府駐香港聯絡辦公室（香港中聯辦）要求香港的全國人大和政協代表要全力支持香港政府的修例建議。香港媒體引述中聯辦主任王志民說，修例是「大國博奕」，認定美國想藉修訂建議針對中國。\n2019年5月30日\n香港親北京派立法會議員向政府建議，收窄可移交罪行的範圍，規定只有最高刑罰監禁7年或以上的罪行才可移交，也規定只能由一個司法管轄區的「中央機構」向香港提出申請，政府在同一天接納建議。民主派議員批評建議只屬「小修小補」，再次要求政府撤回修訂建議。\n香港大律師公會批評，規定只有最高刑罰監禁7年或以上的罪行才可移交，會把性罪行、走私武器等嚴重罪行劃到不可移交的範圍。至於只有「中央機構」才可以提出引渡申請的要求，由於香港跟隨北京政府視台灣為中華人民共和國的一部份，台灣哪個機構是「中央機構」成為疑問，香港政府官員無法回答。\n6月6日\n香港法律工作者發起遊行，要求香港政府撒回修例。主辦方表示約3000人參加，是香港主權移交以來最大型的類似遊行。\n6月2日\n海外神秘富商郭文贵，在他的爆料中，说送中条例是林郑亲自主动起草，亲戚递交北京当局，截至8月5日，此信尚未证实，也未得回应。（后经有多年内幕独料媒体明镜王老板何频再次证实）\n6月9日\n反對修例建議的團體發起第三次遊行，主辦方表示約103萬人參加，香港警察公佈最高峰時有24萬人，兩個數字都是近年遊行人數的新高。遊行結束後有人留守的示威者與警察爆發衝突，19人被捕。全球許多城市同一天都有遊行，支援香港的示威。\n香港政府同一天晚上發表聲明，表示尊重市民表達意見的自由，但將會繼續修例工作。親北京的立法會議員回應遊行時指出，一個支持修例的網上聯署收集到約70萬個簽名。\n6月12日\n示威者佔領了香港商業區多條主要幹道，與警方爆發衝突，情況與2014年「佔領中環」的情況差不多。警察多次施放催淚彈、橡膠子彈等嘗試驅散示威者。\n香港特首林鄭月娥傍晚發聲，形容衝突是「破壞社會安寧、妄願法紀的暴動行為」。\n6月15日\n林鄭月娥指出，這個決定是為要讓社會盡快回復平靜，她為修訂《逃犯條例》帶來的爭議感到抱歉，但強調不會撒回方案，也同意警方把6月12日的衝突定性為「暴動」的說法。\n當天一名身穿黃色雨衣的男子在香港市區懸掛反對修例的標語，之後墮樓身亡。\n6月14日\n香港建制派，内部支持送中条例的香港政府行政会议召集人，陈智思表示，对于条例的修订社会不理解，应该多有一些时间解释，行政会议成员汤家华表示，政府修订条例应该考虑不同的方案，不反对搁置。\n6月16日\n再次遊行，人數達二百萬\n示威者的人數再創紀錄，他們要求香港政府完全撤回條例修訂，也要求林鄭月娥辭職，認為政府暫緩修訂的建議只是「緩兵之計」。\n政府傍晚發表聲明，指林鄭月娥承認由於政府工作上的不足，令香港社會出現很大的矛盾和紛爭，為此向市民致歉。\n（此处备注，香港共750万人）\n6月18日\n林鄭月娥說她為《逃犯條例》修訂帶來的社會矛盾「誠摯道歉」，但沒有提及會不會辭職、或正式撒回修例建議。\n民主派議員認為，林鄭月娥鞠躬道歉也欠奉，令事件變成無人問責，高級官員之間推卸責任\n（BBC的新闻更新至此）\n7月1日\n香港游行队伍，有55万人上街，试图占领香港立法会，傍晚十分，有人冲进立法会，香港游行人士要求撤回恶法。取消对于游行的暴徒定性。\n7月3日\n林郑表示送中条例已经寿终正寝，香港的民众表示不满意，法案并没有通过行政手段撤回，只是林郑的一面之词，和语言炸术，要求在行政手段上完全撤回送中条例。\n7月22日\n香港元朗地铁站出现白衣人殴打香港游行返家市民，记者，中联办国徽被扔鸡蛋，次日中联办国徽套上了透明的保护壳。市民被袭击过程中，保安香港警察迟缓，后无白衣人被捕，次日，有人拍摄到视频，香港立法会议员何君尧，当晚与白衣人握手，举拇指及称赞是英雄，并合影留念。\n7月26日\n有部分香港公务员出来发声，支持市民的诉求，香港消防，海关质疑政府处理白衣人，400位行政主任晒出工作证表达当局对元朗白衣人处理，以及对送中条例的处理。有100名左右前任和现任政务主人发声，成立独立调查委员会。调查元朗事件。国泰航空的工会进行航站一号楼进行集会，声援反送中。同时何君尧校友联名谴责何君尧联名信广告，\n7月26日\n香港政务司张健宗，在新闻发布会上说，元朗白衣人是暴徒，且警察当时的表现，与市民期望有落差。对此像市民道歉，香港警察元佐级协会发声反声，表示张建宗司长如果只有道歉能力不如退位让贤。\n7月28日\n由于当日元朗聚会没有的到警察的批准，当日聚会造成了警民冲突，多人被捕，多人受伤，\n7月29日\n中共国务院港澳办，发布警告，香港局势触碰了底线，\n8月1日\n海外神秘富商郭文贵爆料，8月4日中共讲根据解放军驻港法，国家安全法，应香港政府邀请进驻香港，对香港戒严。截稿当日并未发生\n8月5日\n香港百姓举行了罢工，罢课，罢市，涉及24个行业，一万多人参与。导致212航班取消，地铁线停运。\n注以上繁体部分为BBC转载，\n简体部分为个人根据陈破空，文诏老师，郭文贵等油管自媒体部分引述。\n这是香港送中条例前后的始末，此中并未引述，央媒喉舌的新闻，以及华春淫，梗爽之类的言论，只是一来并不觉得他们股左右而言他的境外势力言论，\n只想读者站在一个对党喂人民吃毒奶粉和打假疫苗的人的立场，去理解一个不想有天吃毒奶粉打架疫苗的香港人角度去理解，这一场求生的运动，\n因为我们是同样吃地沟油命，所以并不曾像很多自干五一样操着中南海的心，在天朝这个社会总是有一群底层的人，他们自身的安全和利益天天被伤害，却总是具有统治者的意识，并为统治者伤害自己的难处而忧心忡忡。这个群体就是自干五。\n他们和共党喉舌一起，只要看到不是黄皮肤的，基本上都是境外敌对势力，独裁共党的境外敌对势力法治自由多如牛毛，也却有其事，（自干五其心可比共党可谓更丧心病狂，共党只把西方国家定位敌对势力，自干五把自由民主都定位定对势力，动不动搬出水土不服论），具体个别别有用心，到不是事实。再来也是莫须有的港独诬陷已经多年，这个就跟大陆一个平民维权发声就泄露国家机密一样，很滑稽。杀人防火是国家机密 豆腐渣工程是国家机密，贪污腐败同样是国家机密。\n总结起来红党的行事无非三条、国内的泄露国家机密，境外的敌对势力，港澳台的就是独而不成的暴乱。\n这就是我和哪位球友踢球的路上讲的又好笑又害怕的部分。\n香港送中这是一个冗长的叙事，也是一个复杂的叙事，在那段黑暗的路实在太短，而且还被球友一开口就打了死结。如果我一开口再给他打上无毛和自干五的死结，那岂不是，这场球又是，村里泼妇，“你这个狗日的”套路了。\n此处决计不敢以没有争论，妄断自己的素质达到了香港人平均水准，要是香港人估计，早就把他当共党来的一声丢雷螺母了，\n15年初，因为行业使然，辗转漂泊，流落至广东，不料一待就是4年，期间因为猎奇，去过两次港府，无非就是买东西，当时历尽幸苦，小地方出入境的办证大妈，总是一幅屁民能有几个钱，也配去香港的模样，尽管他们公安局合伙的照相馆，拍一次照片40也并不便宜，去过的自然也知道，其他地方拍照不接入系统不认。内陆人一年两次，广东人也分非广深一年好像四次，广深好像一周一次，共产主义要瞻仰资本主义也是分阶级的。第一次去香港，关内关外两个世界，关内也有排队，但是也有插队，排队和插队等量齐观，关外排队入关的时候，秩序相对就好很多，个别人，其实也分不清陆客还是港归，会把排队的围栏拆开来插队，被港人怒斥，港人亲自动手把围栏重新弄好，后来区别开来，是因为港府的粤语与陆客区别很大，被斥责的陆客怒目而视，并不惭色，像极了天朝党府，我想这也是我们现在很多人的操作，承认错误和理亏是非常羞耻的事情，可能都被碰瓷吓坏了，只要承认自己错了那就完蛋了。\n第二天我就尝到了港人的恶劣态度，在麦当劳排队，无需赘述多便宜，是在排队的过程中，当时Apple pay在大陆麦当劳较为盛行，以往朝圣的心态，港府应该不至于落后大陆，后来，一到点餐的时候，发现Apple pay不能用，临时钱包找了一下现金，被排在后面的港仔一顿问候，因为也不知道他说了啥，后来问我同事才知道，说不要浪费大家时间之类的，我应该看好餐算好钱，排队到就马上给钱拿小票。我想这就是一个误会。\n多年以后，应女朋友要求，也是自己多年欠下的口债，去一趟香港的迪斯尼，购物其实并没有太多意愿了，过去买的苹果手机，不一定比大陆便宜，以前可能去一趟买个手机，回来买一些东西，比大陆买个苹果手机还有结余，当然在中环苹果店多坐会，还会被服务员劝离，顿时觉得几千块的苹果；没买到上帝的感觉略亏，我同学当时就很愤怒，粤语不好没有理论。有钱的上帝意识到不是不对，只是平等那不是更好，就像我也讨厌女朋友每次结账的时候打个响指让我很尴尬，所以我就中了全套，几乎都是我买单。\n迪斯尼门口排队的人确实很多，而且各种境外敌对势力，确实是敌对势力，有些东南亚敌对势力，一路操者看上去礼貌，但是老娘也不欠你什么的口吻，一路excuse me，从头插到尾、拖家带口，迪斯尼是不准带水和食品进去的，当然也非常侵犯人权的查包，倒也并没有像把我带的吃的东西拿出，扔在地上踩上两脚。甚至默不作声，连我的不好意思都没有踩到，我想这或许就是在制度下，人性对同类天性上同情的一面。当即也就在港府住了一晚，第二日，女友多事发了朋友圈，自然收到了几百年不联系的旧友代购留言，恰逢台风暴雨，索性闲着，帮上一忙，无非是些药品之类的代购，万难拒绝。去到了华龙药店，里面的店员导购边抽烟边导购，实乃大陆也难见之奇观，走出药店回到紫荆广场看对面，才发现，以前的看过的夜景中的三星，AIA都换成了中国人寿TCL。我想这就是变迁。\n具体港人反水客的事情，我想是有的，不过我没遇到过，大概是我不够有钱没有买起民愤，水客，就是游走在香港可以多次过关的人，既有港人也有陆人，从事代购一类活动，有投机倒把之嫌。在投机到把的过程中，某类民生物资如果在香港比较紧缺便会蜂拥扫货，大陆的假疫苗和假奶粉时候，港民多次表现过不满，最大的水客应该就是华强北的苹果手机，倒也没有听说港人反苹果水客的，当然最大的水客，还是大陆的权贵地产囤积，墙外涉闻过实锤的，现任内阁皇亲国戚，都在港府定居，且拥有豪产，香港7%的土地，用来进行住宅用地，750万人远远不够，而坐拥这些现有住宅的富豪。以李嘉诚，就是那位儿子被绑架，买凶在珠海杀了绑架他儿子的那个绑架犯的人，以他为代表的富豪既得利益者地产商，防止资产价格下滑，在扩大土地供应上，如填海造地，平山出土上，并不支持。香港一个年轻人20岁工作，30年攒够首付，30年还完贷款，只有40平米的住房，还要接受李嘉诚的公摊盘剥，当然大陆在一线，是以家庭为单位的。\n这或许可以回答香港官民冲突，比之澳门尖锐许多。他们对政治的热情，民意的表达更为迫切，因为在既定的社会体系中，没有他们整个阶层的代言人发出他们的声音，就像我们的农民，真正的农名逐渐被遗忘，变成了这个社会数量众多却没有声音的阶层，虚假的农民总在新闻联播中被粉饰。\n港人应该不看新闻联播，但是港人可以上自由的互联网，而且港人对内陆的关注和热情，从89开始一路高涨，对大陆党府的不信任感甚至时反感由来已久，应该与内陆老百姓除了自干五以外的人感同身受，每天都在实况转播党府的丑态和邪恶，包括毒奶粉，假疫苗，红黄蓝幼儿园，雷洋事件，自爆的反腐丑闻更是不胜枚举。在此造成了巨大的滑稽与落差，内陆部分民众表示，我们大陆有钱人多了去香港，党媒很多宣传，打了高高在上港人的脸他们要港独，内陆崛起了，港人太失落了，他们极度要港独。很多看后名族自豪感膨胀至极，去看了旺角破旧的街道，自然满心同意，都是因为香港输不起，要逃跑，我们要抓住他狠狠的羞辱他，把自己以前意淫的平穷落后补回来，其实大可不必。宣传如何粉饰，个人闷心自问，愿意留香港还是活大陆的人，遍不攻自破，除非你是有精神胜利法的自干五，有或是最大赢家理论护体，和离岸爱国的爱国贼，要留个前哨洗劫百姓，那自然都是最大赢家了。\n香港与伦敦纽约同一梯队的金融中心，全球最安全的城市，法治素质是全球最高，这并非我信口开河的一家之言，党府把香港的繁荣据为己有的政治宣传的时候，这都是惯用台词，这又催生了另外一个愤恨的言论，叫做会哭的孩子有奶吃，很多人，羡慕香港的繁荣法治自由，说句跪舔的话，哪怕是有机会打针真疫苗，买罐无毒奶粉，都觉得安心许多。相反催生出一种嫉妒的情绪，对比大陆你们算好的了，还闹什么闹，你看看大陆，这么不知足，把你送到非洲去。这岂不是又一种港独，精神之错乱，就仿佛，我们58年没饿死，就不该追求吃饱，吃饱糟糠，就不该追求米饭，一个道理。内陆人之勤劳举世无双吧，那追求啥呢，还不就是更好一些。鲁迅说过，天朝的历史分两个时代，一个挣着做奴隶的时代，一个坐稳了奴隶的时代。天朝人总觉得坐稳了奴隶；当了顺民，就不会被饿死，那些顶天立地生而为人的人才不会饿死，饿死的那些都是心甘情愿的奴隶，故这个老大帝国可能是饿死人最多的地方。\n党府从小的教育从来都是唯物主义，把一种哲学，固化成一种一切向钱看的教条，进行物质尺度教育，物质作为一种存在基础、变成了衡量一切的尺度，包括人性和道义。再也没有笑脏不笑破的家教，只有笑贫不笑娼的社会，衡量一个人，物质一把尺子从头量到位，红黄蓝幼儿园的低端人口，没有房的外来人口。所以，推知到社会上的任何事情，放逐于天朝一黑一个准，雷洋失败找不到女朋友去打个飞机，所以该死，如果有钱了，像权贵去了天上人间嫖一把，就该上天了。在香港则是同样的套路，用大陆与香港物质尺度，挑起阶级仇恨。\n继而又在封锁的宣传中，把党府包装成中国乃至中华民族夹杂私货，这是个老生常谈的话题，党，政府，国家，名族的关系。这群离岸爱国贼，总是以党的名义领导一切，又以中国的名义对外干一些鸡鸣狗盗的勾当保存自己的执政和家族利益，这是个西方渐渐认识到的问题，他们与中国老百姓的矛盾为何如此尖锐，就是说每次总是说China，党府乐得直译。就像党府某个人以名族大义经济建设的名义拆了你家的房子，卖了土地赚了钱，当你反抗的时候又以国家安全的名义把你维稳一样。\n香港已经被扣上了帝国主义英爹美爹的帽子，又被打上了分裂国家罪名，这不过是对共党罪恶不认同的污蔑，就像他们恬不知耻的把这道防火墙叫做长城一样，总是把无法在国内发声，在墙外发生的做卖国贼，在国内不小心发声成功的危害国家安全，又把丑陋的红党包装在国家里面到处推销，还制造成大棒，让百姓互殴。\n我深刻的理解那位球友对香港的担忧，弹丸之地，资源单一，大陆依赖度极高，前有89天安门冤魂未歇，此时，我们不应该，嘲讽他们的勇气和幼稚，应该感到希望，在被红色暴政打垮脊梁的中华名族里面，还有人愿意稚嫩的身躯扛起最后的星火。\n不能要求每个人，理解香港年轻人的苦难，因为内陆人已经理解忍受了这种苦难习以为常，这是一种罪，世代都要为之偿赎。那个为保护母亲尊严赴死的张扣扣，还有于欢，那些红黄蓝幼儿园孩子，那些毒奶粉大头娃娃的道义。如果不为之声张；那就是中华民族的罪孽，世代，每个世代，都要有人为偿还赎罪。\n或许是你，或许不是你，但是迟早会轮到大家。\n截稿之日，来自潮汕的黑社会，已经介入了香港。就像每个被血腥强拆的家庭，希望香港挺住。"
		},
		{
			"post_id": 46,
			"title": "[左胶文摘]去中心化的网民三大法宝\n",
			"date_published": 1565755619.245,
			"body": "在国际视角，香港此刻出现的社会动荡，最值得注意的除了「root cause」本身，网络动员的质变，对全球的影响可能更大。回想2014年，网络仍然只是实体动员的伸延，主次秩序分明，在现实社会拥有社会资本的组织和个人，在网络仍然拥有相对优势，能够将动员控制在自己的范式之中。但这次的运动更强调「没有大台」、讲求「自发」，知名社会人士、议员被四方八面的群众掩没，不是失去领导地位，就是只能退而求其次「一齐参与」，短短五年的技术发展，带来的颠覆效果，彷如昔日时空的二百年。导致这改变的技术，其实很简单，主要是网民活用了「三大科技」：Telegram、区块链 (以太坊)，还有连登讨论区，它们也是我们常说「去中心化」或「去中介化」(uberization) 思维的产物。在这些工具帮助下，网民拆解、重构了社会运动的动员方法，令政府难以找到可对话的「大台」，除了成功挑战建制，非建制派阵营的内部结构，亦面临推倒重来。\n\nTELEGRAM\n\nTelegram是反逃犯条例开始以来，运动群众最依赖的通讯软件，由俄罗斯人杜洛夫兄弟发明，包括今年年仅34岁的保罗．杜洛夫，俄罗斯本土流行的「俄版Facebook」VKontakte也是他们的作品。但后来他被俄罗斯政府的友好人士架空，如同Steve Jobs曾被踢出苹果董事会一样，被踢出VKontakte (VK) 董事会。作为某程度上「异见人士」的杜洛夫离开家乡，在德国柏林创立Telegram，公司架构极为简洁，就是一支十多人的极菁英化小队，公司政策可概况为「不能重复VK的错误」，以保护用户私隐为重心，用自己发明的新通讯协议；公司性质亦为非营利、不上市、不卖广告，追求的是一种网络时代的理念。\n\n虽然杜洛夫被称为「俄罗斯朱克伯格」，但其实这对他和他的追随者而言，可能是侮辱多于赞誉。朱克伯格拥有Facebook、Instagram、Whatsapp等，可说是社交媒体界的皇帝，但帝国是生意，出卖用户数据也是「在商言商」，近年「剑桥分析」丑闻令全球网民注意到，朱克伯格的帝国已经进入政治领域，而且没有底线。香港网民使用Telegram，与其说是技术问题，不如说是朱克伯格的商誉出了问题；而网民对他的观感，也许跟不少示威者对建制的态度一样。\n\nTelegram可以隐藏电话号码、删除账号、讯息自动毁灭等，都是网民热爱的功能。在运动未激化时，个别Telegram群组可以在一天内涌入数万网民，用户一般使用假名，除了这个名字，与其他人可谓互不相认，将用户间的权力差距降到最低，形成了去中心化的气氛，正如你不会知道我的Telegram名字，也不会知道在Telegram大骂警察的真神会否就是张建宗。相比起Facebook，Telegram的程序较为精简，在现场网络讯号薄弱的时候，差别就很大。Facebook的优势是这十年内建立的记名人脉，这是短期内难以取代的；但对现场人士而言，不用知名、最好隐名、传输速度快、连2.5G也能收到的Telegram，却更有实用价值。\n\n由于杜洛夫坚持保障用户私隐，Telegram一度成为世界各地恐怖主义者的通讯模式 (另一个流行方法是PS4聊天程序)，直到2018年8月，Telegram才对国家法律妥协，表示如果涉及恐怖主义者，会根据法律交出资料，才令Telegram出现了真正的规范。其实单纯以技术层面来看，Telegram的加密技术未必胜过Whatsapp，毕竟有一名Telegram群组管理员也已被捕；而Whatsapp在近期版本增加了点对点加密聊天，数据只存在于双方软件之中，保密未必差过Telegram。然而，商誉和文化很重要，Telegram成为个地示威工具，大概还是方兴未艾。\n\n区块链\n\n自从警民关系急剧恶化，警察数据成为起底目标。国际黑客组织匿名者（Anonymous，自然也是一个去中心化的团体）首先入侵了警员数据库，令警队压力大增；后来又有人将警员数据上载至以太坊(Ethereum)的区块链之中，现实政治的矛盾，正式蔓延到网络，而且一发不可收拾。我们自然不赞同侵犯私隐的任何行为，问题是网民的集体智慧，明显不是警队此刻技术足以应付，这恐怕也是警队只能在现实世界释放压力的原因之一。\n\n以太坊是一个区块链平台，有「以太币」(与比特币性质类似)、「智能合约」(Smart Contract)等应用，我们从前也曾介绍。「智能合约」由程序处理合约执行和裁决，交易会永久纪录在区块链上，传统合约之间的中介会被取消，换言之，双方都可以节省交易成本。从一般合约甚至到楼宇买卖，理论上，都可以在区块链上用智能合约处理。这个平台当然也是去中心化的，《纽约时报》曾比喻以太坊是「一台由用户网络来联合运转的公用计算机」，正如在其他基于区块链技术而产生的加密货币，以太币(ETH) 其实是在「以太坊」上面贡献计算机算力之后的回报。\n\n以太坊由算力组成，里面的「交易工具」也是算力，即以太币；上载数据，也需要使用以太币。如果上传者使用的以太币是由中央机构 (加密货币交易所)发出，理论上，香港警察也可以尝试追踪，但侦查路线就颇为迂回。比起陈冠希事件时，警方只要问互联网供货商 (Intenet Service Provider,ISP)，就能轻易找到散播相片的网民，已是两个时代的事。假如警察数据上传者是一个「老手」，使用自己「挖矿」 (贡献计算机算力) 得到的以太币，警方就极难追究。\n\n至于已经上传的数据，会永久保存在区块链之中，无法删改，所以理论上，删改区块链数据的方法，只要拥有以太坊的绝大部份算力，就可以达成。但以太坊是一台公用计算机，它的拥有权，已经裂解到世界各地各种持份者手中，使得警方追查泄密者和毁灭流出资料的难度，上升到另一个层次。在区块链技术面世之前，只要找到网络论坛的拥有者（通常是单一持份者），就可以删除，一了百了。现在却是水银泄地，所有网民形成一个结构，只动摇三数个网民，无法动摇整个结构；但要影响大部份网民，谈何容易？\n\n连登讨论区\n\n连登讨论区的历史很短，在2016年才开始运作，起初是网民不满「高登讨论区」网速慢、手机软件简陋、开始政治审查等原因，而另起炉灶的产物。其实这个案例，等于一个政府无法提供合理公共服务，市民为了自身权益，而误打误撞建立了新虚拟国度，开始的时候，就充满自发和庶民意味。\n\n要在连登开账户发言，需要独立ISP电邮，无法大量复制；分身和网络水军并不是不存在，但成本变得更高。网络论坛也是匿名的，不以个人账户为中心，而是围绕话题和内容发展。个人帐户只是一个会员号码，可以追踪到的数码足印 (Digital Footprint)，只有账号的发言纪录，连个人图片也没有，几乎就是互相蒙面的效果。结果是没有大佬可以主导讨论，令带风向的难度增加。\n\n由于讨论区上，每个话题只有正评、负评和留言，由网民作最残酷的「直接民主」式公投筛选，能够登上「热门话题」的帖文，其「公共性」并不是由编辑或论坛主决定，而是完全由「基层网民」认可。社运人士在上面发起运动、或商量策略，虽然隐密程度并非最高，ISP和拥有连登的单位，理论上仍拥有网民数据，但连登发挥了「分布式大脑」的作用，将网民联合成一个大脑，使「共同决策」变得可行。鲁索以来的「公共意志」(General Will)不再是一个政治哲学概念，在科技加持下，变成一个能够实际运作的决策流程。在科幻概念「人脑互通」实现之前，这可能已是最接近的操作。\n\n虽然「去中心化」、「分布式」这类名词，或会令人联想到「各自为政、力量分散」等负面画面，但事实上在新范式里，基层个体的参与感，比起以往的菁英大台代议模式，要来得更强烈。示威港人的热情可以持续超过两个月，多少说明科技已带来权力（包括传统反对派的权力）解构，但此后人类未必就此离散，而是可能用另一个方式更紧密地组织起来，无论是甚么立场、甚么理念的朋友，都必须学习适应，因为旧时代早已一去不返。再回看政府的响应、决策模式，依然是19世纪的层层上报、小圈子同温层「讨论」、然后层层下压、以「必须绝对忠诚」施加压力、把一切诉诸幕后黑手和外国势力，双方的时空差异，无论你持甚么立场，都令人目瞪口呆。"
		},
		{
			"post_id": 45,
			"title": "目瞪口呆！告诉你真实中国 99%的中国人都不知道 ",
			"date_published": 1565409983.368,
			"body": "​​​​​​​![](https://m1.aboluowang.com/uploadfile/2019/0807/20190807094329635.jpg)\n\n陆媒刊登投稿文章《你对真实的中国一无所知》，从民众使用app、学历、收入等方面，用数据呈现一个真实的中国现状，让你了解中国人的学历和收入有多低，令人目瞪口呆。中国经济下行，民生艰难。中国大陆的猪肉价居高不下，创6年来新高。大陆鸡肉涨价近50％！下半年还会再涨。而更要命的是常用药“火箭式”涨价，约涨数十倍。\n\n**大陆鸡肉涨价近50％！下半年还会再涨**\n\n![](https://m1.aboluowang.com/uploadfile/2019/0801/20190801032049726.jpg)\n\n中国去年爆发非洲猪瘟，造成数百万头生猪死亡，而鸡肉则成为目前替代肉类中的赢家。\n\n自由时报引述美国消费者新闻与商业频道8月1日报导，荷兰合作银行中国白羽鸡的价格已上涨近50％，涨幅高出羊肉、牛肉等肉类，且因猪肉短缺问题近期内无法解决，中国鸡肉价格将在今年下半继续上涨。\n\n此外，鸡肉以外的替代肉类如鱼肉、羊肉和牛肉的价格也在中国飙升，羊肉价格年增11％至每公斤56元人民币、牛肉价格年增6％至每公斤57元人民币。\n\n**五花肉28一斤！中国猪价创6年来新高**\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731020643168.jpg)\n\n《中新经纬》报导，中国猪肉价格持续攀升，据中国农业农村部数据，截至7月29日14时，批发市场猪肉平均价为每公斤24.35元人民币（下同，约111.37元新台币）；6月猪肉批发价为批发21.59元（约98.75元新台币），月增4.7%、年增29.8%。\n\n商店、超市的猪肉价格更为惊人，北京某超市的五花肉价格已达到**每斤27.8元**（约127.15元新台币），外脊和分切的小里脊分别为每斤23.8元和25.8元（约108.86元、118元新台币）。超市方面指出，猪价从6月就涨到现在，涨幅约在3元左右（约13元新台币）。\n\n报导引述正在超市买五花肉的李小姐说法，她表示，家里猪肉买得少所以还好，但猪价确实是她有史以来看到最高的，希望别再涨了。\n\n**涨数十倍，中国大陆常用药“火箭式”涨价**\n\n![](https://m1.aboluowang.com/uploadfile/2019/0730/20190730041306469.jpg)\n\n据健康时报网等媒体报导，北京大学第一医院、北京医院、中山大学附属第六医院、多家成品药厂家药品价格及中共政府招标网等综合整理发现，常用药、低价药“火箭式”涨价成为常态。\n\n治疗农药中毒的氯解磷定，据中共政府招标挂网价从一盒48.8元暴涨至1017元；用于断指再植的盐酸罂粟碱，从9.4元暴涨到349.9元；一瓶用于心脏急救的常用药硝酸甘油片从4元多猛涨至60多元……\n\n阿莫西林由4元/盒涨至18.14元/盒；降压0号由28.8元/盒涨至45元/盒；甲硝唑由1.26元/盒涨至12.05元/盒……\n\n**数据告诉你：中国人的学历和收入有多低**\n\n大陆羊城网近来刊登来稿，文章说，一款APP是一面映世镜，通过它可以照鉴真实的中国，高端与廉价，精致与粗糙，洋气与土味，两个看似割裂的世界，共同构成了中国的正面与侧面。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124905406.jpg)\n\n根据企鹅智酷提供的拼多多用户画像，低学历、低收入、四五线城市是拼多多用户的主要标签。在这群人是消费观念里，便宜实惠就是王道，至于产品品牌、文化内涵之类精神属性方面的维度并不是他们所关心的。拼多多的出现解决了他们有没有的问题，是解决初次消费的问题，其实只要你去过城乡结合部、农村地区集市，你就会发现很多山寨或是假冒伪劣产品的出现，拼多多只是这种现象在互联网上的镜像。\n\n**中国人学历被高估：大部分人只有中小学程度**\n\n来看一下我国的学历分布情况。我们使用1949年以来，历年小学、中学、高中招生数的加总数，除以2017年的人口数，来简单模拟小学、中学、高中学历的人口占比。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124906819.jpg)\n\n由此可以看出，学历分布略微正偏，高学历占比其实远低于大家预想的水平，比如本科学历只有4.23%、专科学历只有3.93%，即使是高中学历，占比也仅有18.92%。而小学学历的人口占比超过了100%，这说明使用历年招生数计算学历占比，数据是高估的。也就是说，实际本科生学历的人口占比，肯定要比4.23%还低。\n\n**只要是本科生，就碾压了97%的中国人**\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124909474.jpg)\n\n中国大学教育的二大转折点，分别是77年恢复高考和99年大学扩招。从1977年恢复高考以来，累计毕业的大学生，大约有1亿人，去掉一半的专科生，本科生的数量大概在5000万人。看起来的确很多，但中国的人口总共是13亿人，本科生占据总人口的比例是3.69%，换句话说，只要你是本科生，你就碾压了97%的中国人。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124909374.jpg)\n\n在中国本科生已是寥寥无几，211和985更是凤毛麟角，2017年211大学（包括985）在全国录取的总人数约为45.5万人，全国共有900多万考生，全国平均录取率约为4.84%。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124911304.jpg)\n\n美国大学理事会就各国大学生比例在全球16个国家进行了一次调查评选，结果显示，在25-64岁的青壮年人口中，俄罗斯是54%，加拿大是48.3%，日本是41%，美国是40.3%。中国15至59岁的人口中，拥有大学学历的，只有18%。\n\n**中国人比你想象中的穷**\n\n“煎饼大妈月入3万”、“实习生月入5万”、“月薪一万是讨饭”、“年薪10万的”……网络中总是充斥着这样的新闻。整个舆论都都在制造一种中国很富有的假象，这不过是媒体贩卖焦虑收割流量的套路罢了。\n\n据国家统计局在2019年1月8日发布的《中华人民共和国2018年国民经济和社会发展统计公报》显示，2018年全国居民人均可支配收入28228元，城镇居民人均可支配收入39251元，也就是人均月可支配收入3270元；农村居民人均可支配收入14617元，也就是人均月可支配收入1218.5元。如果将全国居民人数五等分，我们可以更直观的看到收入水平的分布情况。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124912106.jpg)\n\n全国人口中收入最高的20%的人平均可支配收入为64934元，由于中国的薪资分布呈偏态分布，少数极富者会将整体水平拉高，这意味着年收入在6.5万元以上的，都还不到10%**。也就是说如果你每年可支配收入达到6.5万元，你就打败了90%的中国人。**国税总局规定，个人年收入超12万元，都是需要申报的。在2017年，申报人数在1500万人左右，1500万人占中国人口多少比例？1.1%不到，也就是说如果你月入过万，你就打败了99%的中国人。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124912182.jpg)\n\n**在五等分中，“低收入组”的年人均可支配收入只有5958元，平均下来，每月收入不到500元。5958元，还真谈不上贫困。中国的贫困标准是每人每年2300元，以这个标准计算，2017年年末，农村贫困人口为3046万人。当你花几千块钱买一台手机的时候，可能不会想到，这可能是3000万人全年的收入。**\n\n在中国发达地区，即支配收入排名前十的地区，算下来只有4个省人均可支配收入超过3000元/月。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124913900.jpg)\n\n拿魔都上海举例，作为全国的金融贸易中心，去年上海人均收入是全国最高的。根据统计局数据显示，2018年上海全市居民人均可支配收入58988元，其中工资性收入34365元，算下来上海人均可支配收入竟然不到5000/月，工资性收入竟然不到3000/月。\n\n**被贫富差距割裂的中国**\n\n基尼系数是国际上通用用来分析贫富差距的指标。基尼系数介于0-1之间，越接近1，表示不平等程度越高。警戒线的数字是0.4。中国目前的基尼系数书多少？2017年国家统计局公布的中国基尼系数为0.4670。但世界银行的数据则显示，2016年中国人均财富基尼系数已高达0.789，已大大超过警戒线，明显高于日本、韩国、新加坡等经济转型较为成功的经济体。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124915788.jpg)\n\n如果把中国城镇和农村居民平均收入情况分成五个阶层，可以发现收入越高，相邻阶层的差距就越大。例如拿城镇居民来说，中等收入人群只比中等偏下人群可支配收入多出8500元，但高收入人群比中等偏上人群收入高出28500元。这说明收入等级越高，收入差距的鸿沟就越难以逾越。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124916163.jpg)\n\n另外还有一个现象是城乡收入差距太大。比如，城镇低收入群体的平均收入是农村低收入群体平均收入的4.3倍，农村的高收入群体的收入水平，还达不到城镇中等收入群体的收入水平改革开放以来，中国城镇居民人均可支配收入由1979年的405元提升到2015年的31790.3元，农村居民家庭人均纯收入由160.2元提升到10772元，城乡收入的差距在绝对量上不断的扩大，二者之间的差距已从244.8元上升至21018.3元，二者之间的相对差距虽然在近几年出现下滑的态势，城乡收入比由2009年的最高点3.33下降至2015年的2.95，但是相对差距依然保持在较高的位置。\n\n![](https://m1.aboluowang.com/uploadfile/2019/0731/20190731124917968.jpg)\n\n阿波罗网孙瑞后报道\n\n<iframe allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/TTT7zLCT378?rel=0\" width=\"560\"></iframe>\n\n[阿波罗网](https://www.aboluowang.com/)责任编辑：**王笃若**　来源：阿波罗网孙瑞后报道 转载请注明作者、出处並保持完整。\n\n本文网址：https://www.aboluowang.com/2019/0807/1325812.html"
		},
		{
			"post_id": 44,
			"title": "姜汁满头 | 翻墙是有罪的 ",
			"date_published": 1561641939.41,
			"body": "**编辑注：**该文原文已在微信被删除\n\n翻墙当然是有罪的。\n\n据不完全统计，<wbr>柏林墙的守卫逮捕过3221名试图越境的东德居民，<wbr>在阻止他们逃跑的过程中击毙了61人。\n\n这些逮捕和枪击行为当然都是经过东德政府首肯的。<wbr>既是政府首肯的暴力行为，<wbr>那么敢于翻墙的东德居民理应好好反省一番自身：翻墙是有罪的。<wbr>既然敢于翻墙，那就要自觉承担起为犯罪付出代价的责任。\n\n否则这世上就没有法律可言了。\n\n既要翻墙，那么首先，我们就先要造出一堵墙来。\n\n柏林墙也不是一开始就有的，就像这天下所有的墙一样。<wbr>它不是从地里长出来的，而是人修起来的。\n\n柏林墙始建于1961年8月13日。几乎是一夜之间拔地而起。<wbr>8月12日晚上，<wbr>柏林市民还能肆无忌惮地在东西柏林的边界上自由穿行，<wbr>8月13日早上他们一觉醒来，却发现自己眼前多了一堵墙。\n\n一开始，柏林墙并不算得是一堵真正的墙，<wbr>它只是一片匆匆拉起来的铁丝网。从铁丝网的缝隙之间，<wbr>市民还能较为清楚地看到对面的风景。很多人以为，<wbr>这不过是反应过激的东德政府的应急措施——毕竟，墙是死的，<wbr>人是活的，区区一堵墙，哪能真正拦住用脚投票的人？\n\n但急转直下的形势告诉大家：这回，他们动真格了。\n\n8月17日开始，铁丝网开始慢慢变成了混凝土固件。<wbr>眼看一片似有若无的铁丝网逐渐开始变成一道密不透风的墙，<wbr>许多东德市民开始慌了，蠢蠢欲动，开始打起了翻墙的念头。\n\n紧接着，所谓的“开枪射击令”开始生效——针对那些妄图翻墙，<wbr>并为此付出行动的东德居民，柏林墙边的守卫军可以开枪射击阻止。\n\n打人当然是不好的——但没办法，谁叫他们违法了呢？\n\n墙的用途一般有两种。\n\n一种墙是用来阻止外人进来的。比如我们中国古代的长城，<wbr>是用来阻止北部草原游牧民族的入侵。<wbr>再比如特朗普在美墨边境上竖起的高墙，<wbr>是为了阻止非法拉美移民大批流入美国的。\n\n还有一种墙是用来阻止自己人出去的。比如柏林墙。再比如……\n\n说回柏林墙。东德政府也不是故意要修这堵墙的。毕竟，<wbr>修墙是很费钱的，基础设施的投入不说，<wbr>监控守卫的日常开销更是个无底洞。要没事，<wbr>谁愿意平白无故地修一堵墙起来啊？\n\n但没办法，要没这堵墙，东德居民早晚都得跑光。\n\n自1949年东西德分裂以后，地处东德国土的柏林，<wbr>因土地上有一半英美法占领地的关系，成了一块“地处东德、<wbr>归属东西德共同管辖”的飞地。\n\n换言之，只要东德居民跑到西柏林的土地上，那么法理上讲，<wbr>他们便成了西德土地上的人。东德政府哪怕再看不顺眼，<wbr>也只能瞅着他们干着急，一点办法没有。\n\n于是，从1949年到1961年，<wbr>超过260万东德居民借道柏林去了西德——要知道，<wbr>彼时东德的总人口也不过2000万而已。\n\n何况这260万人里头，一半都是30岁以下的青壮年。\n\n这种失血速度，谁受得了？\n\n说来也可恨，这些逃跑的东德居民，丝毫没有家国情怀可言。<wbr>为了一些物质上的蝇头小利，就能抛下祖国家园，<wbr>跑到对手的土地上去。\n\n但更可恨的自然是西德。他们明知人性经不起考验，还偏要考验。\n\n为了考验人性，西德在西柏林修建了大型的、橱窗般的购物中心。<wbr>里头的商品琳琅满目，光是香肠的种类都有500多样。\n\n为此，东德政府开足了鼓动机器，不断地向人民解释宣传：<wbr>修建一堵墙，到底具有如何的重要性和必要性。\n\n“现在，我们的秩序和纯洁性获得了胜利，<wbr>孩子们被保护着免受绑票者威胁，<wbr>家庭免受那些试图拆散他们家庭的人的诱导，<wbr>而工厂免受西方猎头的侵扰。敌人被抓住了，东德人民欢欣鼓舞……<wbr>”\n\n“我们的墙已经证明了他是稳固的，值得信任的，它保护了和平。<wbr>我们的国家是伟大的，强盛的，攻不破的，波恩（彼时的西德首都）<wbr>的修正主义者将不会得到任何支持……”\n\n而官方提供的数据显示，东德人民对这堵墙的支持率奇高，<wbr>一如他们的投票率一样。\n\n但历史证明，大多时候，墙的用途不是用来拦的。\n\n大多时候，墙的主要用途是用来翻的。\n\n为了翻越柏林墙，东德人民充分发挥主观能动性，<wbr>想出了各式各样的翻墙花招。\n\n有用潜水艇翻墙的。\n\n1968年，一位东德青年用钢板自制了机身，<wbr>用摩托车马达改造了引擎，再配上自制的导航仪、压缩气体等系统，<wbr>就这样，他用自制的潜水艇在水下航行了五个多小时，<wbr>终于成功翻墙，潜逃到了西德。\n\n还有用热气球翻墙的。\n\n1979年，两个东德家庭——两对夫妻，四个孩子，<wbr>通过数年苦读自学材料学、工程学、气体动力学、气象学等等，<wbr>终于在自家后院架起了一个热气球，在天上飘了大半天后，<wbr>也成功翻墙，降落到了西德的领土上。\n\n当然，有翻墙的人，就有审判翻墙罪的政府。<wbr>东德政府为了死死盯住蠢蠢欲动的公民，自然也是挖空心思，<wbr>无所不用其极。\n\n除了密布在柏林墙根上的两万多名警察和军队外，最有名的，<wbr>要数史塔西。\n\n这个监控机构，完全渗入了东德公民生活的方方面面。<wbr>与朋友的交谈，与女友的亲热，吃了什么东西，读了什么书，<wbr>说了什么都话，都逃不过史塔西的法眼。\n\n电影《窃听风暴》里的主人公威斯勒，就是史塔西的一名资深特工。\n\n他的职责，是监控自由主义倾向诗人德雷曼的生活。\n\n不出所料。德雷曼的生活里充满了危险要素：<wbr>他屡屡和朋友发表反动言论，在自家用私藏的打字机印发宣传报纸…<wbr>…然而，德雷曼没有因为这些罪行把牢底坐穿，<wbr>他有惊无险地撑到了东德垮台，德国统一。\n\n为什么？\n\n特工威斯勒在监控过程中，逐渐为德雷曼的理想和浪漫打动，<wbr>把他当作真正的朋友，多次出手相助，帮他度过难关。\n\n在一片黑白的世界里，善良开出了花朵。\n\n如果你是柏林墙边持枪的士兵，看见有人翻墙，<wbr>你的责任就是把枪口抬高一点。\n如果你是1961年独自巡逻的民兵，看到有人潜逃，<wbr>你的责任就是放他们一条生路。\n\n在高墙伫立的年代，就是一点的善，<wbr>帮助许许多多无辜的公民逃过一劫。\n\n或许职责会让我们成为帮凶，但要谨记，<wbr>无论如何不能让其凌驾于人类的良心之上。\n\n柏林墙虽然带来了无数生离死别，但还好，它的结局是好的。\n\n1989年11月9日，时日无多的东德政府宣布放松边境管制，<wbr>柏林墙应声轰然倒塌。\n\n有形之墙是有寿命的。无论怎样自诩为金汤永固，<wbr>总有被风吹雨打去的一天。\n\n更可怕的是无形之墙。因为大多人看不到，摸不着，<wbr>甚至不知道这堵墙的存在。\n\n墙是保护不了人民的。正如《进击的巨人》里头的三堵高墙，<wbr>不能保证人类高枕无忧。只有蜷缩在高墙里头的人类主动出击，<wbr>找到巨人滋事的根源以后，才能真正获得安稳。\n\n正如美国前总统肯尼迪，在1963年访问西德时，<wbr>在柏林墙下的一番演讲：\n\n“自由有许多困难，民主亦非完美，<wbr>然而我们从未建造一堵墙把我们的人民关在里面，<wbr>不准他们离开我们。”"
		},
		{
			"post_id": 43,
			"title": "[转]贸易战的本质问题是什么？网文已被删",
			"date_published": 1558756536.167,
			"body": "说在前面的话：中美贸易战打到现在，作为一名小草民也看不清走向。偶然看到这篇文章，感觉对贸易战分析的比较有条理，转来与各位榴友分享。文章仅代表作者观点。愿中国更加繁荣昌盛。\n\n贸易战的本质问题是什么？\n作者：王冠一（编者按：美中贸易战开打以来，中共一直掩盖贸易战真相，把其宣传成美国对中国的打压，并发起反美宣传战，而贸易战的本质问题是什么？微信上一篇好文深入浅出地讲出了贸易战的实质，但文章已被全网删除）。\n美国的诉求是什么？ \n美国的诉求是“平等待遇”。\n        美国的诉求是“三零二停一允许”。“三零”是零关税、零非关税壁垒、零补贴，“二停”是停止盗窃知识产权、停止强行技术转让，“一允许”是允许美国人到中国独立开设公司。需要指出的是，这“三零二停一允许”不是单方的，而是双方的。你对我“三零两停一允许”，我也对你“三零两停一允许”。\n这个政策也是美国给到全体盟友的，美国对于中国，除了部分关税以外（仍比中国低很多），已经大部分实现“三零二停一允许”了，中国人去美国开设公司的政策上早已执行很久了。\n        而美国加征关税的行为，是在中国不同意双方互相实行“三零两停一允许”，还要延续以前的做法：继续征收比美方高得多的关税，继续保持壁垒、继续非法补贴、不承诺放弃盗窃知识产权、不允许美方来开设公司，美方利益将继续受损失的前提下，才对中国的商品提高关税的反制行为。\n美国为什么提出这样的诉求？ \n        美中目前有3000亿美元左右的逆差（因双方统计口径不同略有差异。如2017年数据美方统计是3752亿，中方统计是2758亿），通俗地说：美国买了中国很多商品，但中国买美国的不多，所以美国花得多，挣得少，亏了。\n        那么，美国是因为“亏了”这3000亿美元才发动贸易战吗？假如两个村子各有集市，都允许对方商贩来自己集市上摆摊卖货，在自由市场的前提下，能卖多少是凭自己的本事，非要别人买你的东西，不是强买强卖吗？\n        确实如此，但前提是“自由市场”，如果一方故意设置障碍，不允许另一方来卖东西（壁垒）；或者是向一方多征收摊位费（关税）；或者是少收自己村商贩的摊位费，用规则以外“出千”的方式增加自己产品的优势（补贴），那么这种逆差就是人为造成的了。因此美方才提出了“三零”的诉求。\n        事实上，美方的这些要求，中国在2001年的入世谈判中很多都已经承诺做到，但是均未兑现。可以参看中华人民共和国商务部网站：《中国入世承诺》45项承诺中，7项经济政策承诺只遵行了1项，4项知识产权承诺遵行了1项，12项货物贸易承诺遵行了7项，22项服务贸易承诺遵行了14项，合计遵行23项，履约率51.1%。而且违反的承诺全都是关键承诺，比如关税、金融、“墙”。\n        因为中国是发展中国家，因此在入世之初，中国享受比发达国家更好的条件，比如可以征收更高的关税，可以给自己企业更多的补贴额（中国农业的允许补贴额度是美国的两倍），但同时承诺要逐渐减少优惠，逐渐走向平等。\n        因此在美国看来，从2001到2019的18年间，美国一直在承受“不平等条约”和中国的“剥削”，现在随着中国经济的发展和实力的提升，是要“平等”的时候了。\n        有文章也指出，美国对于花生和花生制品的关税远高于中国，这是事实，因为花生是美国东南部地区赖以维生的重要农作物，因此对进口花生实施相当高的关税，这也是贸易协定之内的。在23类中国主要商品中，大约有21类商品的关税都高于美国。相比2001年，中国对美国征收的关税已经下降了约60%，但平均税率仍然是美国的约三倍以上。事实上，川普政府谈判团队在5月初美中首轮磋商前的要求中，就包括要求中国将部分非战略商品的关税降至美国相同的水平。\n\n美国的要求合理吗？如果合理，中国为什么不同意？\n一、三零合理吗？\n1\\. “零关税”合理吗？\n        在三四十年前，世界贸易的70%是成品；到了2010年，世界贸易的70%是原材料和零部件（苹果手机里面有500多个各种各样的大大小小的零部件，涉及几百个企业和几十个国家），如果层层加收关税的话，所有人都无法做生意（除非你不生产工业品，只输出石油和粮食等第一产业产品）。\n        所以美国跟欧洲、日本、加拿大、墨西哥等主要经济体签署了FTA（自由贸易协定）。如果中国接受零关税，加入这一协定，相当于第二次入世。如果中国失去这一机遇，我国的制造业恐怕失去这一珍贵的历史机遇，将会被世界远远地抛在后面。而且，中国每年进口的零部件占到了全球的60%，当实现零关税时，中国人将是“零关税”最大的直接受益者。\n2\\. “零非关税壁垒”合理吗？\n        所谓“零非关税壁垒”的意思，就是允许别人到你的市场来做生意，除了法律以外，没有任何限制。事实上，这也是入世的承诺。而事实上众所周知的是，在教育、卫生、文化、金融、服务贸易……等等很多领域，非但没有向外企开放，也没有向中国人开放，而是被政府和国有企业垄断着。\n        正如网上的段子说的：美国制裁了华为（尚且还要通过法律程序），而中国限制了美国的所有企业进入关键领域，还限制了所有美国的互联网企业：Google、 Twitter、Facebook、YouTube……在科技时代，美国的主要产业就是互联网和服务、金融业，而这些几乎全被中国禁止了。\n        如上所说，最大的受害者不是美国，而是中国人自己。\n        在入世之初，中国人都幻想着中国人民可以得到国民待遇，可以公平参与市场竞争，可以享受自由的市场经济，但是事与愿违。\n        正如龙永图2011年接受白岩松采访的时候所说：“我们当时承诺要实行对所有中国企业国民待遇的原则，但是现在我们对中小企业、对民营企业还有很多的不公平的、歧视性的待遇。”\n        中国的民营经济在重重压力和歧视之下，贡献了接近90%的就业、50%的税收和GDP。给中国民企、中国人民以国民待遇，是比中美贸易战重要得多的问题。事实上，社会上很多理解甚至支持美方立场的观点，正是基于“美方的诉求有希望解决国有经济和政府垄断的问题，民企或将从中得到利益”的考虑。\n        那么，拆除壁垒会有什么影响吗？虽然利于中国人民和民营经济，但是会让国企失去垄断地位和优惠政策，让政府失去经济领域的管控权力，这才是真正的、会动摇体制的“核心利益”。\n        有人认为：“国企可以在公共领域提供普惠性的公共产品。”\n        这个观点其实不用反驳，看看油价、过路费、电信电力价格就知道了，国家垄断未必带来什么“普惠”，而美国、日本、欧洲等国家同样有“普惠”和公共事业，也许比我们还要到位一些。有人认为：“国企是关键领域的定海神针，比如在大豆贸易中控制价格，实现粮食安全。”\n        事实上，在这个已经高度分工和贸易高度发达的世界上，没有国家能够（也没有必要）自己生产所有产品。就拿大豆来说，中国大豆需求1亿吨，自己只生产千万吨，如果靠自己种大豆来满足所有的大豆需求，粮食将会不够吃。\n        所以“大豆绝大多数进口”是必然而且最优的选择。而“粮食安全”是一个伪命题，是对于世界无知、冷战甚至热战思维、与全世界为敌的无稽之谈。因为粮食永远不会禁运。正如茅于轼所说：世界市场上从来没有缺过粮食，倒是总是生产过剩，为卖不出去发愁。各产粮国都想尽一切办法争取粮食出口，而进口国则用关税抵制粮食进口……现在有一种顾虑，怕国际粮食市场对中国禁运。一般而言这种情况不会发生。\n        因为WTO规定不许用贸易做政治斗争的工具，除非联合国有决议。伊拉克打了科威特，被联合国实施禁运，但粮食也没有禁。粮食生产没有垄断性，任何一块普通的地方都能种粮食，不像石油具有垄断性。粮食只要出高价总归买得到。还有人认为：“国家权力和国有垄断经济可以完成‘一带一路”这样的大项目”。\n        “一带一路”真的是多么高明的战略吗？\n        与其说是主动出击的伟大战略，不如说是为过剩的落后产能找出路的无奈之举。从2008年开始，一系列宽容的货币政策，都导致投资通过国企流到基建（而基建是落后的产能，国家政策本来是要“供给侧改革”的，要的是高端制造业），而效率更高的民企融资难，准入领域受限。如果让市场配置资源，让更灵活和高效率的民营经济获得本该得到的资源，还会有“一带一路”的尴尬现状吗？（因为需要基建的都是落后国家和地区，本来就没有钱，于是还要借给他们钱，所以有了“亚投行”；亚投行中国比例差不多40%，第二印度10%，但印度入股后又先货走12亿美元，剩下的最多3%，大部分不到1%。所以相当于是中国出钱给他们搞基建，债务成为很大的问题。）用“一带一路”洗地，是典型的把副作用当疗效了。\n\n3\\. “零补贴”合理吗？\n        如果中国不加入国际贸易，不签署贸易协议，补贴谁、补贴多少都是自己的内政。美国反对“中国制造2025”也是同样的问题：中国搞核武器、搞太空实验，无论补贴多少钱，美方绝对都无权干涉，因为这是中国的内政。\n        但是如果“中国制造2025”的产品要在美国进行销售的话，企业自己的行为美国仍然无权干涉，但政府就不能补贴了，或者补贴额度需要在协议范围之内，美国同样也不能补贴自己的企业。补贴的另一个问题，是资金使用的低效率。我国政府给予企业的大量补贴被“骗补”，也是不争的事实。\n\n二、“二停”合理吗？\n        “二停”是停止盗窃知识产权、停止强行技术转让，其实两者是一个问题：不保护知识产权，会导致无人去创新和研发，因为你的成果会被盗走，为他人做嫁衣（腾讯经常盗窃创新成果，被诟病“走别人的路，让别人无路可走”）。无人研发和创新，社会成为创造力的荒漠，就只能去索取别人的技术，所以不保护知识产权其实是对自己最大的伤害。国内最著名的知识产权法学专家之一、中南财经政法大学校长吴汉东有一篇关于中国知识产权发展问题的演讲稿，非常精彩，也提到了很多中美的博弈过程，他认为：中国的知识产权保护法是在美国谈判和博弈中逐渐建立和完善的。\n        中美第一次知识产权冲突发生在1991年，美国政府认为中美之间的贸易逆差主要是因为中国不保护美国的知识产权，而使美国大量的知识产权被中国复制，使美国每年的损失达到100亿美元。在美国的督促下，我们于1992年修改了专利法，1993年修改了商标法。但中国不是输家，因为美国的做法对中国也是非常重要的。对知识产权的保护对中国这样的新兴工业化国家来说也是必要的。\n        从长远来看，知识产权的保护对于推动经济发展、促进科学技术进步和文化繁荣有重要作用，这也是包括韩国、新加坡和中国在内的新兴的工业化国家为什么接受知识产权协议和高水平保护知识产权的理由所在。他进一步说：为什么工业革命发生在英国而不发生在中国？这是因为，中国在近代化中没有明确的私有财产制度，也没有明确的产权制度，当然，其中包括所有权和知识产权制度。事实上，关键技术是需要自己研发的，但也要去尽量得到别人的成果。而“得到”的途径也只有在合作的环境中才是合法和可持续的，无论以什么方式，绝对比对抗的环境对我们更加有利。\n\n三、“一允许”合理吗？\n        “一允许”是允许美国人到中国独立开设公司。上文已经提到，中国人去美国开设公司的政策早已执行很久了。允许外国人来开设公司，本来也是入世承诺的一部分。18年前就有人担心，外国人来了以后会不会击垮我们？这种担心其实是多余的。\n        我国首任驻世贸组织大使孙振宇针对十年前大家的这种担心有这样一段话。“我觉得我们当初有些低估了我们企业的应对能力，其实中国人很善于学习，很善于适应新的情况、新的挑战。”外国人来投资、成本是高的、国情是不熟悉的、针对的客户和市场是和我们不同的，未必有直接的对位竞争关系。但却可以带来新的模式、技术、需求、让国民以更低的价格享受到更好的产品和服务，这是被改革开放以来的历史所证明了的。\n\n总结 \n        美国只是为了自己的利益而已：自由贸易、市场经济符合美国和美国人民的利益。而中国人民、中国政府也有各自不同的利益。我们在说“中国”的时候，要注意说的是“中国人民”，还是“中国政府”。\n        在“三零二不一允许”的问题上，美国利益和中国人民利益在原则上、在绝大多数细节上是一致的，而中国政府利益和中国人民利益则未必是完全一致的。\n        “三零二停一允许”，不是“不平等条约”，恰恰是让中国抓住机遇，“第二次入世”的绝好机会，其意义不亚于又一次改革开放。如果实施之后，市场将变得更加开放，我们获得真正的市场经济地位，在国际上得到最优惠的贸易环境，在国内，人民和民营经济获得国民待遇，而政府则要让出一部分权利和利益。\n        这是要付出的代价。而既得利益者非但不愿意放弃权力和利益，还要把本该属于人民的权利和利益作为“代价”去牺牲。“开放”意味着失去经济管控权力和权力衍生的利益，才是中国不能接受“三零二不一允许”的真正原因。"
		},
		{
			"post_id": 42,
			"title": "转载]弧度度：为何大国只有最佳损友却没有固定盟友？",
			"date_published": 1558322787.216,
			"body": "[原文来自 弧度度，不知道在内网能够存活多久，先转来这里存个档吧。]\n此议题说来话长，不过本人素有长话短说的毛病，所以你永远无需担心会从我这儿看到繁文缛节的长篇大论，只需要一边喝着咖啡一边抽空扫描几眼短小精悍、沉稳内敛的文字就行。\n\n大国人历来有“务实”的优点，觉得某国还有利用价值时，就会哈儿吧唧地往上凑，而一旦觉得自己有实力和对方一较高下或者觉得对方成了自己前进路上的绊脚石时，就会毫不犹豫采取以下三种态度：暗中使绊子，一脚将对方踹开，拉拢群狼展开围攻。\n\n法国人批评我们了，我们就去购买美国的波音；美国人还击我们了，我们就去购买法国的空客。日本人给我们难堪了，我们就大唱“没有理由和美国搞坏”；如今美国人又令我们感到紧张了，我们又特唱“中日世代友好”。\n\n治国理政基本等同于想一出是一出的过家家，既没有是非观念、大局观念，也没有长远眼光、开阔胸襟，反而尽采纳一些歪门邪道、旁门左道的馊主意，总是着急在任内实现辉煌政绩，欲速则不达地谋求所谓的“弯道超车”。\n\n对于那些曾经大力投资我国、帮助过我们实现经济腾飞的国家恩将仇报，譬如美日；对那些狮子大开口地勒索我们、背后捅刀子的国家反而有求必应，譬如俄罗斯、伊朗、叙利亚、委内瑞拉、非洲穷国等等、等等。\n\n昨天还坐在一起摆酒言欢、签订协议的朋友，仅仅因为对方说了一句“希望你们走正路”而立马翻脸，那翻脸的速度简直比翻书还快；相反，那些明显图谋不轨、欲占我便宜的国家，仅仅因为唱了几句赞歌就立马收获数百亿美金的巨额援助。\n\n没有原则，没有底线，没有信仰，没有价值观，不顾黎民死活，不顾国际声誉，大国需要的仅仅是一份畏光症的“面子”而已。为了收获几句廉价的赞美，动辄倾举国之力结与国之欢心；为了杜绝正确的建议与批评，不惜倾举国之力与之决一死战。为了死保核心利益——既得利益集团的特权，不惜浪费大量的民脂民膏，结交损友，对抗良友，物极终于必反，在国际上的道路愈走愈窄，陷于一种前所未有的两难绝境。\n\n如此反反复复、两面三刀的国际交往政策，吃了无数次亏、上了无数次当的国家是否还愿意重复上当吃亏、与狼共舞？我看结局有点悬！\n\n美国的盟友遍天下，是因为他们需要维护相同的信念与价值观；大国的损友来了一拨又走一拨，是因为大国毫不利己专门利人，能够为他们奉上取之不尽用之不竭的美元......\n\n据说，外汇储备正在锐减，贸易顺差大幅萎缩，世界合围已经形成......接下来的游戏怎么玩，大国何去何从，的确值得深思啊！既玩残了自己，又玩残了国家，更玩残了国际，何苦来哉？......\n\n（存活不易，谢谢赞赏！）"
		},
		{
			"post_id": 41,
			"title": "转载]速看！美国对中国决策链存在重大误判",
			"date_published": 1558321368.514,
			"body": "原文来自：小靠君  真微禅\n我想改一个标题《你打我，我打我儿子》或《阿妈标仔心，谁来比赎金》，不过没有原作者同意，就算了\n懂的人，自然懂我说什么的。\n以下是原文：\n——————————————————\n5月13日，财政部发布了《决定对原产于美国的部分进口商品提高加征关睡睡率》的公告：自2019年6月1日0时起，对已实施加征关睡的600亿美元清单美国商品中的部分，提高加征关睡睡率，分别实施25%、20%或10%加征关睡。对之前加征5%关睡的商品，仍继续加征5%关睡！\n\n![](https://mmbiz.qpic.cn/mmbiz_png/icm9kJBdwN9AJybpsAac9dz9US6H6nPiblhC8a7Y7620TrSYNSzzKMRQaBKYSajSX5MhZRZsFW3Wy3Zz0n9LVeKw/640?wx_fmt=png&tp=webp&wxfrom=5&wx_lazy=1&wx_co=1) \n\n此番表态，堪称铿锵有力，掷地有声！\n\n美国人强加给我们的这场风波，蛮横无理，步步紧逼；但他们完全没有料到英勇的大国人民，众志成城，坚决反抗；为了捍卫国家和人民的利益，我们可以不惜付出任何代价！\n\n不得不说，天真的老美，对于中华民族的价值观和决策链、还是有相当程度的误判。他们必将因为这种幼稚，落得悲惨的下场！\n\n关于决策链、可能有些不明真相读者还有一点不理解。笔者举一个例子。\n\n1945年、日美太平洋战争进行到尾声阶段。此时日军已经在之前的三年中遭受美军强力打击，骨干作战力量损耗殆尽，重大技术兵器大部被毁，占领的岛屿陆地逐步沦丧，军心民心濒临崩溃。此时有三件大事依次发生：\n\n一、美军从塞班不断起飞B-29轰炸机，使用燃烧弹，焚毁一个又一个日本城市。\n二、美军拿下冲绳，并向广岛（8月6日）和长崎（8月9日）分别丢下原子弹。\n三、1945年8月9日苏联对日本宣战、苏军进攻关东军。\n\n当美军对广岛（征兵中枢）和长崎（转运中枢）这两个城市丢下原子弹后，文官们立即意识到、日本军事目标已经完全暴露在美军火力之下、即将全部被美军摧毁殆尽。这时、他们主张立即投降。\n![](https://mmbiz.qpic.cn/mmbiz_jpg/icm9kJBdwN9AJybpsAac9dz9US6H6nPiblOQGOYvCntEkJDUPRmqicmhLOYqWcw7xVdCqx9y4OE5KetLvMKU0GARg/640?wx_fmt=jpeg&tp=webp&wxfrom=5&wx_lazy=1&wx_co=1) \n在这之前，虽然日本城市在燃烧弹的肆虐下纷纷毁于一旦，但文官却并不把日本百姓的死活放在心上。\n至于天皇，虽然他对内阁和军队具有举足轻重的影响力，但遵循传统，天皇在二战中并不实际过问国事。\n他一直到45年6月8日，仍完全同意本土决战的构想。也未提出投降主张。但在6月20日到7月初，开始动用自己的影响力、敦促首相派遣特使前往苏联，进行有条件的投降的接洽工作。\n8月6日，第一枚原子弹在广岛丢下后，天皇立即命令外相东乡去要求首相铃木做出终战安排。\n\n日本军方的态度是死硬的。\n在45年6月之前，陆相阿南惟几表示，虽然冲绳陷落，但日本丢掉的只是面积很小的海岛，所征服土地的大部分还仍旧被占领着，没战败啊。\n所以、军方的希望是，做出有条件的投降甚至妄想媾和。\n\n他们觉得，美帝怕死人嘛！只要拼得美帝死掉十万八万的，美国国内民众，说不定就会承受不了这么重大的牺牲，给国会施加压力，停止战争。\n诶？插一句说：这个观念，好像现在我们国内也有哦。\n\n话题回到当时的日本，读者们可能要问了，原子弹丢下来，一个广岛顷刻间夷为平地，几万军民死伤，难道这对于军方也没有震动吗？\n是的，对于军方来说并没有特别的感觉，因为死掉的都是平民，他们只是损失表格上的一个数字而已，这对于一线野战军毫无影响！\n至于对士气的负面影响，军方认为，只要封闭消息，没人知道，不就好了嘛！\n然而，当苏军攻击关东军开始后，军方顿时心态崩溃！\n\n由于强大的苏军决定投入对日作战，所以无论关东军能防守和拖延苏军多久，长期来看，势必不是苏军加美军的对手。\n好了，这下没戏唱、彻底打不赢了。日本军方这才开始认真考虑彻底投降。\n如果我们把文人、天皇、军方的投降态度做个表格，那么就是这样：\n![](https://mmbiz.qpic.cn/mmbiz_png/icm9kJBdwN9AJybpsAac9dz9US6H6nPibl1chfCLegqBESv3ZjuYLvUJsZvwJgEUl75GAXpWl6BBOZcRib6NIrZIg/640?wx_fmt=png&tp=webp&wxfrom=5&wx_lazy=1&wx_co=1) \n不得不说、日本军方是一定要刀子切到肉上，鲜血开始喷出来、才觉得大事不妙的。\n可是，最倒霉的还是日本平民。\n当燃烧弹掉到老百姓头上的时候，当孩子和老人在火中挣扎、翻滚嚎哭的时候，文人是无动于衷的，当自己辛苦多年积攒的财产付之一炬、接下来生活无着、流离失所的时候，天皇是不闻不问的。\n![](https://mmbiz.qpic.cn/mmbiz_jpg/icm9kJBdwN9AJybpsAac9dz9US6H6nPiblOicib5U7oxrKX7ccOicOD0UYL4BF9MUUyt7fLnQhBFv3CUKcqfqiallOCg/640?wx_fmt=jpeg&tp=webp&wxfrom=5&wx_lazy=1&wx_co=1) \n只有原子弹丢下之后，文官和天皇意识到无力对抗这种大杀器的不对称打击，才想起来投降。\n这个时候、军方却还在试图掩盖事实、封锁消息、试图再战。\n说穿了就是死道友不死贫道，别人死再多也跟他没关系，一定要真的到了切肤之痛的时候，日本统治阶层的皇国大梦才会恍若初醒。\n\n现在我们把话题拉回到贸易战本身。前面啰嗦了半天的决策链问题。到底在哪里呢?\n我们这次加收涉及的美国商品当中，竟然有这么多医疗用品：\n\n加征25%关睡的商品共2493个：包括重组人胰岛素及其盐、其他胰岛素及其盐、其他多肽激素、蛋白激素、糖蛋白激素及其衍生物和类似结构物、其他皮质（甾）激素的卤化衍生物、其他皮质甾类激素的卤化衍生物、前列腺素、血栓烷和白细胞三烯及其衍生物和结构类似物、以激素等为基本成分的化学避孕药、X 光检查造影剂；诊断试剂、可确定用于造口术用具等。\n加征20%关睡的商品共1078个：包括听力计、血压测量仪器及器具、其他牙科用 X 射线应用设备、X 射线无损探伤检测仪、可直接读数的液体温度计等。\n加征10%关睡的商品共974个：包括医疗用橡胶衣着用品、医疗用α、β、γ射线设备、布洛芬、急救药箱、药包、内窥镜、氧气治疗器等治疗用呼吸器具、外科或兽医用家具及零件等。\n加征5%关睡的商品共662个：包括蒿甲醚、乙内酰脲及其衍生物、吡啶及其盐、阿芬太尼、阿尼利定、氰苯双哌酰胺、溴西泮、地芬诺新、地芬诺酯、地匹哌酮、芬太尼、凯托米酮、哌醋甲酯、喷他左辛、哌替啶、哌替啶中间 体 A、苯环利定、苯哌利定、哌苯甲醇、哌氰米特、丙吡兰和三甲利定以及它们的盐、其他结构上有非稠合吡啶环化合物（不论是否氢化）、左非诺及其盐、丙二酰脲（巴比土酸）及其盐、胞嘧啶、阿普唑仑、卡马西泮等以及它们的盐、阿米雷司、溴替唑仑、氯噻西泮等以及他们的盐、核酸及其盐、其他激素及其衍生物和结构类似物，包括改性链多肽、咖啡因及其盐、假麻黄碱及其盐、芽子碱、左甲苯丙胺、去氧麻黄碱、去氧麻黄碱外消旋体及其盐和衍生物 可卡因的酯及其他衍生物、其他氨苄青霉素盐、链霉素及其盐和衍生物、其他抗菌素、其他胶粘敷料及有胶粘涂层的物品、药棉、纱布、绷带、其他医用软填料及类似物品、无菌外科肠线、无菌昆布、无菌粘合胶布、无菌吸收性止血材料、外科或牙科用无菌抗粘连阻隔材料及类似无菌材料、血型试剂、心电图记录仪 、B 型超声波诊断仪、彩色超声波诊断仪、其他超声扫描装置、核磁共振成像成套装置零件、注射器、缝合用针、导管、插管及类似品、装有牙科设备的牙科用椅、听诊器、肾脏透析设备（人工肾）、透热疗法设备、输血设备、麻醉设备、宫内节育器、矫形或骨折用器具、假牙等。\n\n这些药品、试剂和医疗设备，接下来难逃涨价的命运，最终都要老百姓来买单了。\n大家不要忘记，去年就宣布大豆，也是加25%。大国80%的大豆都是进口的，我们进口的大豆，三分之一来自美国，而且美国大豆品质最好，价格最便宜。\n![](https://mmbiz.qpic.cn/mmbiz_jpg/icm9kJBdwN9AJybpsAac9dz9US6H6nPiblfyeJCYKQGjgcvcfra9QicWnJ3LuIh4pH8EHHjumBu776Xv8bFlSLRLw/640?wx_fmt=jpeg&tp=webp&wxfrom=5&wx_lazy=1&wx_co=1) \n这些大豆，绝大部分变成豆油，供普通老百姓的日常消耗，也带动全国的餐饮行业。\n所以，大豆最终一定会影响到食品普遍涨价。\n\n最惨的是猪肉，上周大国买家取消了3,247吨美国猪肉进口订单，这是逾一年来最大规模的订单取消。不要忘记我们现在各地还有非洲猪瘟。\n清单上没有出现任何可以用于再生产的零件比如芯片；或者工具，比如精密机床；或者原料，比如高等级钢材。\n很奇怪吧？为什么老百姓生活要用的产品就加睡？\n\n其实很简单啊，民生产品有老百姓买单，但是进口的零件、设备和原料，国内的加工厂，还等着把他们加工成产品，再出口到美国，换回外汇呢。\n美国人根本不了解大国的决策链。\n他们认为、美国施加压力，大国物价上涨，人民不满，所以大国就会妥协。\n这是完完全全、彻彻底底的误判。\n\n我们的决策链根本就不担心，为了保卫国家利益，我们可以不惜付出任何代价！（全文完）"
		},
		{
			"post_id": 40,
			"title": "转载]墨钜：为什么说，美国必败？",
			"date_published": 1558320858.401,
			"body": "墨钜：为什么说，美国必败？\nshilongtao  未分类  2019年5月18日  0 Minutes\n原创： 墨钜 转自政经纵横 2019-05-18\n\n从贸易上看，中美出口商品5000亿对1000亿，中国没有赢的可能。\n从经济上看，对比中美4月份的经济数据，美国的失业率3.6%，似乎美国也已经赢了。\n但是，美国最终必败，特朗普过不久就会跪下来认输求和。\n\n为什么说美国必败1\n\n因为，中美胜败的标准不一样。\n中美对损失的承受力不一样，认输的临界点也就不一样。\n比如，朝鲜战争，美国就彻底输了。\n对中国，死伤100万人，战争就算赢了。人还多的是，还可以再死一些。对美国，死10万人，战争就算完全输了。\n1957年，毛在莫斯科大会上主张两大阵营核战，中国的帐是这么算的。全球死一半人，中国6亿人，死掉3亿，还有3亿。\n1969年，中苏冲突到达极点，苏联，不是威胁是真要核爆中国，如果不是美国阻止。中国没有认输求和，只是挖了些洞。\n这就表明，中国至少可以接受死一半人，这就是中国的战争胜利标准，也就是计算中国战争潜力的标准。\n\n为什么说美国必败2\n\n再回头论朝鲜战争的输赢，中国还可以再死2.990亿人，而美国已经不能再死人了。\n如果按照1：10的死伤比例继续打，美帝得跪下认输。\n中国死3亿人，党还是党，领袖还是领袖，甚至更加伟大。\n美国死10万人，民众会反战示威，投票选另一党，总统是要下台的。\n后来停战谈判，双方都不想打了才能谈得拢。\n美国是财大气粗，中国是人多气粗。\n但是，中国钱少，全国人民得勒紧裤腰带，向苏联买军火。\n中国不想打了，主要是因为没钱了，可以死的人还多的是。美国更不想打了，钱还多的是，不能再死人了。\n\n为什么说美国必败3\n\n提示一下，现在中国很有钱了，军火都可以自己造。\n中国现在有14亿人，可以死掉的有7亿了。\n美国呢，从伊战看，美国人越来越惜命了，估计死1万人就要认输了。\n而且美国人神经脆弱，下面这张照片见报后，几乎全民反战，尼克松不得不向越共认输撤出越南，北越统一越南全境。\n\n为什么说美国必败4\n\n打经济战，美国更加脆弱。\n实际上，所谓的三年自然灾害，也是朝鲜战争的间接后果。\n中国人可以全民吃草，饿死3800万人，仍然热爱党。至今仍然认为朝鲜战争应该打，而且是中国胜利了。\n美国人可以吃草吗？实际上，根本到不了吃草，失业率超过6%，总统就干不下去了，美国就得认输了。\n\n为什么说美国必败5\n\n以现在中国的经济实力，要打到中国全民吃草，饿死3800万人，美国经济需要付出什么代价？\n也就是说，只要打到美帝服软，中国可以死掉7亿人，可以饿死3800万人，那就算胜利了。\n而美帝呢，死1万人，失业率超过6%，就得服软，就算失败。\n\n为什么说美国必败6\n\n因此，无论贸易战、经济战、冷战、热战，美国必败，中国必胜！\n央视已经在播《上甘岭》了，细思你极恐吗？\n\n文章已于2019-05-18修改\n\n墨钜：为什么说，美国必败？\nshilongtao  未分类  2019年5月18日  0 Minutes\n原创： 墨钜 转自政经纵横 2019-05-18\n\n从贸易上看，中美出口商品5000亿对1000亿，中国没有赢的可能。\n从经济上看，对比中美4月份的经济数据，美国的失业率3.6%，似乎美国也已经赢了。\n但是，美国最终必败，特朗普过不久就会跪下来认输求和。\n\n为什么说美国必败1\n\n因为，中美胜败的标准不一样。\n中美对损失的承受力不一样，认输的临界点也就不一样。\n比如，朝鲜战争，美国就彻底输了。\n对中国，死伤100万人，战争就算赢了。人还多的是，还可以再死一些。对美国，死10万人，战争就算完全输了。\n1957年，毛在莫斯科大会上主张两大阵营核战，中国的帐是这么算的。全球死一半人，中国6亿人，死掉3亿，还有3亿。\n1969年，中苏冲突到达极点，苏联，不是威胁是真要核爆中国，如果不是美国阻止。中国没有认输求和，只是挖了些洞。\n这就表明，中国至少可以接受死一半人，这就是中国的战争胜利标准，也就是计算中国战争潜力的标准。\n\n为什么说美国必败2\n\n再回头论朝鲜战争的输赢，中国还可以再死2.990亿人，而美国已经不能再死人了。\n如果按照1：10的死伤比例继续打，美帝得跪下认输。\n中国死3亿人，党还是党，领袖还是领袖，甚至更加伟大。\n美国死10万人，民众会反战示威，投票选另一党，总统是要下台的。\n后来停战谈判，双方都不想打了才能谈得拢。\n美国是财大气粗，中国是人多气粗。\n但是，中国钱少，全国人民得勒紧裤腰带，向苏联买军火。\n中国不想打了，主要是因为没钱了，可以死的人还多的是。美国更不想打了，钱还多的是，不能再死人了。\n\n为什么说美国必败3\n\n提示一下，现在中国很有钱了，军火都可以自己造。\n中国现在有14亿人，可以死掉的有7亿了。\n美国呢，从伊战看，美国人越来越惜命了，估计死1万人就要认输了。\n而且美国人神经脆弱，下面这张照片见报后，几乎全民反战，尼克松不得不向越共认输撤出越南，北越统一越南全境。\n\n为什么说美国必败4\n\n打经济战，美国更加脆弱。\n实际上，所谓的三年自然灾害，也是朝鲜战争的间接后果。\n中国人可以全民吃草，饿死3800万人，仍然热爱党。至今仍然认为朝鲜战争应该打，而且是中国胜利了。\n美国人可以吃草吗？实际上，根本到不了吃草，失业率超过6%，总统就干不下去了，美国就得认输了。\n\n为什么说美国必败5\n\n以现在中国的经济实力，要打到中国全民吃草，饿死3800万人，美国经济需要付出什么代价？\n也就是说，只要打到美帝服软，中国可以死掉7亿人，可以饿死3800万人，那就算胜利了。\n而美帝呢，死1万人，失业率超过6%，就得服软，就算失败。\n\n为什么说美国必败6\n\n因此，无论贸易战、经济战、冷战、热战，美国必败，中国必胜！\n央视已经在播《上甘岭》了，细思你极恐吗？\n\n文章已于2019-05-18修改"
		},
		{
			"post_id": 39,
			"title": "[美帝正能量] 今天来谈谈美国梦，无图，只为了给自己加油",
			"date_published": 1558058060.928,
			"body": "　　标题略短，言简意赅。\n\n　　楼主，美国绿卡，现居纽约\n\n　　上周和一个朋友聊天，和大家分享一下，也许能从中得到点什么启示。 请注意，本人不是什么五毛也不是什么粉红，只是在讲故事。\n\n　　我的朋友，年龄大概29左右吧 我猜，应该是刚90后。 高中辍学TOUDU来美国。她读的高中是全省前5的，不知道为什么就不读了，高2就跑来美国。外面没有直系亲戚的。\n\n　　拿到正式绿卡的时间是去年，也就是2018年。 可想而知TD过来了拿到绿卡是多么不容易，不过，大家都是这么过来的，懂的人自然懂。\n\n　　这么多年她都在做美甲，对，就根凤姐一样，一种很简单上手，挣钱又不少的工种。前期可能要帮别人洗脚，当然大家都是这么过来的。懂的人自然懂。就是你们眼中的洗脚小妹，一般洗个半年一年，就可以正式做其他的，挣得多，也不难，工作也好找。\n\n　　3年前，她也许是想完成读书的心愿了，也许是她老公赚的钱也够两个人生活，她决定半工半读。 我认识她店里的老板娘，很好的一个人。从那时候开始，她每周上班4天，上课3天，大概就是这么过来的。她读了CUNY，The City University of New York，纽约城市大学，学的金融会计。原因很简单，工作好找。\n\n　　她来美国十几年了，本来口语就不错，稍微学一学，大学里的课程也能听懂5-6成， 结合课后的PPT，把学位拿到手了。这里说下，她能读完大学满足3个条件：\n\n　　1：她3年前报名时候绿卡还没下来，所以，这两者并无关系。\n\n　　2：美国大多数工作支持PART TIME 也就是我们说的兼职 干4天休3天，都有的。\n\n　　3：美国对于低收入阶层很友好，读书都不要钱。(具体是 学费一门课比如800 6门就4800， 你先交钱，然后拿着发票去政府那边报销，全报销了还多给你一些补贴，大概是这样。 这是本科阶段 后来她读研究生，好像自己总共就出了2200吧 这真的是自己出的，没的补贴。 当然我还没告诉你她拿的奖学金什么的，那是另外的。一年 800-1000也是有的)\n\n　　明年她研究生就要毕业了，现在好几个四大投行的offer给她，真是羡慕加妒忌。\n\n　　好了 故事就说到这， 只说这个故事，说明，这点上，美国真的优秀。26 7岁去读大学，当然大学里还有40-50多岁的都有，没有歧视，没有种族偏见，只有自己充电，为了更美好的将来。 美国梦，加油。\n\n　　唉不知道自己是不是也能放下，去好好读书充实自己!"
		},
		{
			"post_id": 38,
			"title": "[转载]Chimerica(中美)分手的原因分析",
			"date_published": 1558057782.951,
			"body": "这是今天纽约时报安利的文章，但国内貌似已经被封了，所以只好贴在这里。版权归原作者，如有侵权请pm我，另转载于此，并不代表认同其观点。\n-------------------------------------分割线-------------------------------\n以下正文\n\n5月10日是Chimerica纪念日，说得难听点是祭日。谈判破裂了，美国加税了；中国态度很平静，打就打呗，谁怕谁呀。尽管有人声称关系还没破裂，边打边谈，类似“板门店模式”。但我的观察，Chimerica死了，因为有一道无形的墙--“制度性条款”横亙在中美贸易之间。中美之间是规则之争，不是利益之争。\n\n有人可能纳闷，为什么美国放着那么多大豆、天然气合同不要，偏偏要一个“结构性条款”，该条款包含了一系列自由市场经济的竞争原则：首先，竞争者应该是私人企业，国家不从事盈利性产业活动，充当中立的守夜人的角色；第二，工人要有工会组织，要有罢工权；第三，知识产权保护，引入国际标准和执行机制；第四，打破银行垄断，防止银行救助有裙带关系的企业，确保公平竞争环境。其他的可能还有环境政策，允许环境NGO示威，提高环境标准。总之，一句话，要将所有的生产要素都从政府控制中解放出来，由市场竞争定价，实行真正的由市场配置资源。美国是这样做的，欧洲是这样做的，日本也是这样做的，在同一个规则下，才会出现斯密定理：市场范围越大，分工越专业化，分工程度越细，生产率就越高。\n\n但对中国来说，如果接受结构性条款，就意味着国家从经济领域退出，国有企业私有化。政府对银行、土地和资源的垄断将被认为是不正当竞争。失去各种生产要素和产业的垄断权，政治利益集团就会自断财路，固然不肯放弃权力。中方能够让步的就是让贸易顺差为零，出口多少就进口多少。但问题在于，按照中国模式，国家垄断资本和土地，除了劳动力，资源、资本乃至环境等生产要素都是国家为主导的，这样使得国家资本主义和重商主义结合，以最低的要素价格占领世界市场。凭借技术引进，中国模式的成本优势可以从低端产业扩张到高端产业，创新总是缓慢的，而模仿走势很快的，所以从低端到高端制造业，中国制造表现出前所未有的扩张能力。低劳动成本优势还给世界造成另外一个副作用，就是发达国家同产业的工人失业，比如美国汽车制造商整体上都把工厂搬到中国了，在美国中小城市，出现了一条因全球化产生的生锈带比如汽车城底特律、钢铁城匹兹堡等。\n\n说得再明白一点，在美国看来，重商主义和国家资本主义是中国模式的基本特征，必须改造成和其他市场经济国家一样的模式，才会有公平的竞争。在中国看来，政府必须控制金融、土地、矿产资源，除了劳动，所有的生产要素都是政府的，政府用这些要素办国有企业是天经地义的，这些行政垄断决定了劳动没有定价权，长期的工资水平在生存线。我们知道企业是生产要素的集合，凭借行政垄断，中国企业具有任何私人企业无法做到的低成本优势。\n\n按照正常的市场经济逻辑，经济增长必然导致要素价格的提高。战后，美国在欧洲实施马歇尔计划，当时欧洲收入水平和美国有明显差距，但通过美欧贸易，这种收入差距出现逐渐收敛的态势，多个欧洲国家人均国民收入已经超过了美国。日本韩国也是这样，最初的低成本随着贸易量的增大，对劳动需求增加，工资在持续上涨，这些上涨的工资也在缩小着最初两国之间的贸易赤字。美国向欧日等国出口高科技、高附加值产品和服务，欧洲和日本也在国际产业链中找到了自己的定位，并在产业链中创造新的专利不断升级，从而出相了“贸易规模-工资上升-产业升级”的良性趋势。而且，最初的低收入国家通过实行真正的市场经济改造，获得了更快发展，从而向高收入俱乐部收敛。\n\n西方的经济学家和政治家经过反复观察，终于发现了90s年代以来，中国崛起对西方世界的影响。这些影响是一系列的，其一，发展中国家的巨额外汇储备回流到华尔街，构成了一个膨胀的金融部门，而实体经济竞争不过“中国制造”出现萎缩，流动性过剩为08年金融危机准备了条件。其二，硅谷和华尔街利润升高，而传统产业部门和非贸易部门的广大中产阶级工资在中国商品和墨西哥工人的冲击下，长期停滞。这就造成了困扰经济学家多年的“新卡尔多事实”（劳动份额在国民收入中的持续下降）和扩大到基尼系数，撕裂的美国社会。引起了全球化的逆转和特朗普的上台。\n\n一番研究之后，西方国家的经济学家和政治家断定：非市场经济国家的价格形成机制就无法保证美国中产阶级的利益，因为全球化就意味着产品价格和要素价格在全球范围的趋同。一个让自己国内生产要素价格长期停滞的国家必将通过国际贸易影响其他国家的要素价格水平。\n\n历史上，韩国、日本、台湾在其经济贸易告诉发展时期，其卡尔多系数是提高的，即工资增长速度大于资本所得的增长速度，最后这些国家（地区）现在都收敛在2/3这个卡尔对事实的黄金分割线上，中国呢？劳动占比由55%下降到39%，不幸的的是传导到美国之后，美国的劳动占比（劳动所得/GDP）由长期稳定的65%下降到55%左右。相信近几年美国经济通过系列政策，工资回升较快，应该回到了正常的黄金分割线。（详见我往期的“中美贸易与卡尔多事实”）\n\n所以，中美之间现在的分歧是，中国只想解决短期的贸易失衡：增加购买，但不想该改变要素垄断和要素长期价格偏低的事实，希望能够借助这种低成本优势一直从西方市场源源不断地获得美元现金流。美方试图解决长期的贸易失衡问题，贸易顺差的一方能够有更多的购买力购买发达国家的知识产权，形成创新-生产-外包-再创新的动态平衡的贸易结构，而不是永远重复低成本的贸易，顺差国国民购买力没有提高，买不起西方的技术和知识产权，西方国家创新动力的市场基础就减弱，被发展中国家一起拉入了低收入陷阱。形成高科技和资本家集团与中产和底层产业工人的社会撕裂。\n\n有人会问，低工资模式正是我们自己的经济制度产物，是国家主权，其他国家无权干涉。事实也是这样，但人家有权将你的低工资产品拒于国门之外，人家也可以通过向越南、孟加拉国和墨西哥等外包转移来期待这些国家的增长的购买力能重新回到美国实体经济促进高档产品和技术的发展。\n\n最后，我想用美国南北战争的故事来解释中美之间的贸易战。美国19世纪60年代之前，还是农业国，还要靠向欧洲出口特别是向英国出口来实现经济增长，当时的南方通过蓄奴压低了所有产品的价格，所以在南部和北部的贸易中，南部是盈余的一方，北部是赤字的一方，北部的出口市场也被南部抢走，奴隶同时压低了北方的工资并带来大规模失业。所有，从贸易优势看，奴隶制优于自由市场经济，但奴隶制也阻碍了创新，让产业工人陷入和奴隶竞争的尴尬状况，中产阶级的低收入使得国家的购买力下降，产业升级动力不足。因为是同一部宪法同一个大陆，所以最终两种制度刀枪相见，最终将美国推向了自由劳动的资本主义制度，持续富裕的消费者的内在消费需求推动了美国进入创新竞争的社会。美国社会的经济增长是典型的消费驱动经济，而美国的经济政策当然就是就业优先的导向。\n\nChimerica走到今天已经影响了两国各阶层的福利分配，对于这种福利分配的消极影响，中国方面似乎一直缺乏反思，对各种批评显示出强烈的抵制。如今，是采用美国规则还是采用中国规则，已经到了决断的时候，不幸的是，社会主义是不放弃自己的原则的，双边谈判，一方否决即可，结构性条款不是边缘条款，中美在为未来的贸易确立规则。很遗憾，5月10号，这个崛起不到20年的Chimerica就此分道扬镳了。你走你的阳关道，我走我的独木桥。"
		},
		{
			"post_id": 37,
			"title": "中美贸易战历程中，回看美股大跌，A股的微调就不放出来了",
			"date_published": 1557388054.402,
			"body": "路透5月8日 - 美中贸易战本周进入关键阶段，以下为这两大经济体贸易关系恶化过程中的关键时刻回顾。\n\n2016年6月28日\n\n标普500指数：涨1.78%\n\n在竞选总统期间，特朗普在宾夕法尼亚州的一场集会上抛出反击中国不公平贸易行为的计划。他还威胁要根据美国贸易法案的第201和301条款征收关税，他后来这样做了。他说，中国进入世界贸易组织(WTO)，铸成“历史上最大的就业机会窃取案”。\n\n2017年3月31日\n\n标普500指数：跌0.23%\n\n总统特朗普签署两项行政命令，其中一项要求在反补贴和反倾销贸易案件中更加严格地征收关税，另一项要求审查美国的贸易逆差情况及其成因。\n\n2017年4月7日\n\n标普500指数：跌0.08%\n\n在特朗普位于佛罗里达州的海湖庄园(Mar-a-Lago)举行的首次首脑会晤中，特朗普和中国国家主席习近平达成了为期100天的贸易谈判计划。\n\n2017年7月19日\n\n标普500指数：涨0.54%\n\n经过百日磋商，双方未能就缩减美国对中国贸易逆差的新措施达成一致。\n\n2017年8月14日\n\n标普500指数：涨1.00%\n\n特朗普下令根据“301条款”针对中国窃取知识产权展开调查，这被视为是特朗普对中国启动的第一个直接贸易举措。1974年贸易法第301条款规定了美国根据贸易协定应如何强制执行其权利。\n\n2018年1月17日\n\n标普500指数：涨0.94%\n\n特朗普在路透专访中威胁，要对中国窃取知识产权的行为处以巨大“罚款”，但未详述。\n\n2018年1月22日\n\n标普500指数：涨0.81%\n\n特朗普对所有进口洗衣机和太阳能面板加征关税--不仅针对中国产品。\n\n2018年3月8日\n\n标普500指数：涨0.45%\n\n特朗普下令对所有进口钢铝分别征收25%和10%关税。\n\n2018年4月2日\n\n标普500指数：跌2.23%\n\n中国针对128项美国产品征收最高达25%关税。\n\n2018年4月3日\n\n标普500指数：涨1.26%\n\n特朗普公布对价值约500亿美元中国商品征收25%关税的计划。\n\n2018年4月4日\n\n标普500指数：涨1.16%\n\n中国做出回应，提出对价值约500亿美元的美国商品征收报复性进口关税的计划。\n\n2018年6月15日\n\n标普500指数：跌0.10%\n\n美国订定对340亿美元中国商品征收25%关税的生效日期为7月6日。美国表示在公众评议期结束后，也将对另外160亿美元中国商品征收25%关税。中国以牙还牙，对340亿美元的美国商品加征关税。\n\n2018年7月10日\n\n标普500指数：涨0.35%\n\n美国公布对2,000亿美元中国商品征收10%关税的计划。\n\n2018年8月1日\n\n标普500指数：跌0.10%\n\n特朗普指示美国贸易代表办公室(USTR)将2,000亿美元中国输美商品的关税由原本提议的10%调高至25%。\n\n2018年8月7日\n\n标普500指数：涨0.28%\n\n美国公布价值160亿美元适用25%关税的中国商品清单。中国出台反制措施，对160亿美元美国商品征收25%关税。\n\n2018年8月23日\n\n标普500指数：跌0.17%\n\n针对8月7日美国和中国关税清单中商品的关税举措开始生效\n\n2018年9月7日\n\n标普500指数：跌0.22%\n\n特朗普威胁对另外价值2,670亿美元的中国输美商品征税\n\n2018年9月24日\n\n标普500指数：跌0.35%\n\n美国对价值2,000亿美元的中国输美商品征收10%的关税。特朗普政府称，从2019年1月1日开始关税税率将提高至25%。作为回应，中国对价值600亿美元的美国商品征税。\n\n2018年12月1日\n\n标普500指数：涨1.09% (12月3日周一)\n\n中美同意休战90天，期间暂停征收新关税。特朗普同意在两国举行贸易磋商之际，将原定于1月1日开始对价值2,000亿美元中国输美商品提高关税的计划推迟到3月初执行。中国同意购买“大量”美国商品。\n\n2019年2月24日\n\n标普500指数：涨0.12% (2月25日周一)\n\n特朗普将原定3月1日的期限推迟，把2,000亿美元中国输美商品的关税维持在10%，但未设定新的期限。\n\n2019年5月5日\n\n标普500指数：跌0.45% (5月6日周一)\n\n特朗普在推特上说他计划在5月10日将2,000亿美元中国商品的关税从10%提高至25%。\n\n2019年5月8日\n\n标普500指数：跌0.16%\n\n特朗普政府正式通知从5月10日开始，将把价值2,000亿美元的中国输美商品关税从10%提高到25%。据路透之前报导称，中国想改变与美国贸易协议草案的几乎所有内容。"
		},
		{
			"post_id": 36,
			"title": "[异闻观止]沉默代表的不是中立，而是顺从（清华大学思修课教师吕嘉被学生举报）",
			"date_published": 1554086334.502,
			"body": "###### Quote:\n\n> 其他相关：\n> 众学者声援许章润  清华大学教授:没处可退 [https://www.t66y.com/htm_data/7/1903/3478336.html](http://www.t66y.com/htm_data/7/1903/3478336.html)\n> \n> 许章润：我们当下的恐惧与期待(榴友bensonlee提供)  [https://www.t66y.com/htm_data/7/1903/3478550.html](http://www.t66y.com/htm_data/7/1903/3478550.html)\n> \n> 唐云：一个知识分子的踽踽独行(相关事件:重庆副教授课上发不当言论被撤销教师资格)\n> [https://www.t66y.com/htm_data/7/1903/3479364.html](http://www.t66y.com/htm_data/7/1903/3479364.html)\n\n奕澜：沉默代表的不是中立，而是顺从\n\n**作者： 奕澜    来源：劳燕东飞**\n\n###### Quote:\n\n> **图说2019.03.30 【29】清华学生举报教师课堂言论“反党违宪” **  [https://www.t66y.com/htm_data/7/1903/3480793.html](http://www.t66y.com/htm_data/7/1903/3480793.html)\n> 一则题为《雾霾天气可能缓解》的文章于近日引起争议，该文为清华学生3月25日向纪委、党委举报思修教师吕嘉的全网公开举报信。文中表示，吕嘉教师在“思想道德修养与法律基础”课堂上，讲授“反党违宪 ”的世界观及理论观点，公开宣扬主观唯心主义和二元论，歪曲辩证唯物主义，否定历史唯物主义；对于诸多现实问题，持有鼓吹宗教文化、曲解科学社会主义的观点，并且反对集体主义精神、反对人民当家作主、反对消除私有制、反对公有制，污蔑中华民族的文化成果；还指其“不加甄别地公开引用伪造的证据、数据”等。该学生认为，吕嘉的言论“不仅抹黑了清华马克思主义学院的名誉，更完全背离了思政课老师引导同学树立马列信仰的作用”，希望“学校可以尽快监督检查吕嘉老师的课堂言论”。撰文学生在文中表示希望思政课可以“百花齐放”，但“不能丢掉了党的领导、丢掉了指导思想”，“百花是要齐放的，毒草是要不得的。扫除这样的毒草，社会主义信仰之花才能更为鲜艳繁茂。”\n> ![](https://wx1.sinaimg.cn/mw690/0065nZc8gy1g1l1rg5h8bj30hs0oydi8.jpg) \n> ![](http://news.tsinghua.edu.cn/publish/thunews/9658/20180116152059072638471/1516087472159.jpg)\n\n最近心情沉郁而又愤懑。\n\n先是得知本院的一位同事，因之前发表的公共性言论而遭停课处理；之后，又得知本校的一名学生，向校纪委举报思修课老师的上课内容与相应言论。两则消息虽未得到官方的证实，但从各个渠道的反应来看，应该不是无中生有。\n\n老实说，我有一种恐惧的感觉。从三年前毕业典礼致辞所引发的风波开始，愚钝如我，才开始意识到政治风向的变化。从那时起，内心就一直有些不安。过去的两年里，这种不安感愈加地强烈。\n\n其实，这样的事近年来屡有发生，只是没有出现在我的周围而已。经常在不愤与感喟一番之后，又学做起鸵鸟，只关心着过好自己的生活。然而，这一刻，当它们真实地发生在我的周围，我真正体会到了唇亡齿寒。\n\n中国人的生存智慧中，很重要的一项就是明哲保身。所谓事不关己高高挂起，各人只扫门前雪，休管他人瓦上霜，说的都是相同的道理。这样的生活哲学能够大行其道，在很大程度上，大概是被险恶的环境逼出来的。每个人都想要保全自己，这个完全能够理解。\n\n我也曾经认为，在暴虐横行时，沉默是坚守的底线。然而，目睹这几年的状况，我开始意识到，沉默的底线终究还是太低了一些。说到底，沉默代表的根本不是中立，而是顺从。而顺从是没有底线的。它意味着，在对方的步步紧逼之下，己方是在步步后退。\n\n这便是心理学上所说的登门槛现象。从服从一些细小的要求开始，渐渐地，你会服从对方提出的更高更过分的要求，以致最后完全落入对方的圈套。既然已经让步多次，那么，再让一次又何妨呢？“开始细小—逐步升级”的策略，正是登门槛效应的有效应用。\n\n所以，《影响力》一书的作者西奥迪尼才会犀利地指出：你可以使用较小的承诺来操纵某个人的自我形象，你可以利用这种方法来使公民变成“公仆”，潜在的购买者变成“顾客”，囚犯变成“合作者”。\n\n人们总以为，那些帮凶与恶政的合作者本身就是恶魔。殊不知，普通如你我，受人操控后，在顺从的名义之下，也完全可能做出相同的行为。\n\n阿伦特所说的平庸的恶，其核心内容就是顺从。也正是顺从，让看起来老实而无害的艾希曼，成为纳粹杀人机器上一颗忠实而高效的齿轮。正如阿伦特所言，他并不愚蠢，只不过不思考罢了；是不思考，让他成为那个时代罪大恶极的人之一。并且，即便犯下如此严重的反人类罪行，艾希曼在事后也没有表现出多少道德上的负疚感，他的辩解振振有辞：我只是执行了命令而已。\n\n心理学上的实验早已表明，对权威的服从可以战胜道德。很多时候，我们容易过高估计个人品性的力量，而低估情境对个人行为的影响。实际上，把善良的人置于邪恶的环境，成为胜出一方的，往往就是邪恶。结论让人沮丧，但它恐怕是不容否认的事实。\n\n耶鲁大学的心理学教授米尔格拉姆曾经做过一系列与服从相关的实验，这些实验在社会心理学史上非常有名。\n\n米尔格拉姆所设计的实验是，以考察惩罚对学习影响的尖端研究为名，要求一人担任教师，一人担任学习者，学习者如果答错，教师便使用电击来进行惩罚。“学习者”由事先安排的研究助手担任，而“教师”则由应征而来的志愿者担任；在分配角色之前，米尔格拉姆向志愿者隐瞒了研究助手的身份，假称双方的角色是随机抽签决定的。\n\n担任“教师”的志愿者，在体验一次轻微的电击后，看着“学习者”被绑在椅子上，并在其手腕上缚上电极。实验的基本安排与规则是，“学习者”每答错一次，“教师”就要提高一个档次实施电击，每档相差15伏，从15伏一直到450伏。在此过程中，随着电击强度的增加，“学习者”会做出相应的痛苦言行。\n\n为了让“教师”继续实验，米尔格拉姆采用四种口头鼓励：（1）请继续下去；（2）该实验要求你继续进行下去；（3）你继续进行下去是绝对必须的；（4）你没有其他选择，必须进行下去。\n\n在米尔格拉姆的测试中，中途停止电击的人一般在150伏左右，其中65%的人一直进行到450伏。他对1000多个参与者进行了分场景的系列实验，服从的比例都远远高于事先的预计。尤其是，当参与者无法看到“学习者”时，几乎所有参与者都冷静地服从，直到实验做完。此后由其他研究者所进行的类似实验，实验结果也相差无几；包括对女性参与者的研究也发现，女性的服从比例与男性相似。\n\n米尔格拉姆实验中的参与者的经历，表征的就是人们如何一步一步落入圈套的登门槛现象。最初的惩罚是轻微的，只有15伏，并没有出现任何抗议。每一次，担任“教师”的参与者，也只是被要求实施比先前略强一点的电击而已。对于参与者来说，在实施330伏电压时，他们已是第22次服从了。在服从的过程中，参与者早已降低了认知的不协调感。\n\n现实的社会中，登门槛的技术，经常为政治、商业与邪教组织别有用心地利用。在蓄意操控的过程中，人们慢慢地放弃一些东西，需要忍受的东西也越来越多。由于放弃与忍受的过程是一步一步进行的，而每一次的退让都只是比原来多一点点，看起来并非那么不可容忍；所以，大部分人可能都会选择顺从，直至最后做出改变人生的决定。温水煮青蛙，说的也正是这个道理。\n\n可以想象，在社会这个巨大的实验室里，尤其是如果一个社会又倡导集体主义的话，经过经年累月的登门槛式的顺从训练，人们的认知会扭曲到什么样的程度。心理学的研究发现，为了减少认知失调所带来的不愉快的感觉体验，人们会下意识地调整自己的心理，通过正当化现有的做法，或者通过贬低受害者，将责任外推，借以实现自身行为的合理化。在极权体制之下，原本善良的普通人，往往就这样在心安理得中不自觉地沦为帮凶。\n\n社会心理学中的登门槛现象提醒我们，有必要警惕任何试图诱导我们表现出顺从的初始行为。在顺从一个小的要求之前，一定要认真考虑一下接下去会发生什么。可怕的暴行，往往就是从一系列的小恶行为发展而来，包括对恶行的听之任之；因为行为与态度会相互强化，小恶会助长态度，进而导致大恶。\n\n所以，大恶的可怕之处，恰恰就在于它的平常，有着广泛的社会心理机制的支持。这种支持机制中，既包括登门槛现象，也包括群体效应所带来的从众心理。想要避免对恶行的无意识地推波助澜，就必须警惕随大流的做法，警惕所谓的明哲保身。说到底，明哲保身不过就是对暴虐或不公的听之任之。\n\n覆巢之下，安有完卵？不要指望通过不断地自我审查，来求得一时的苟且安宁，幻想从此高枕无忧。在这样一个社会中，在这样的一种体制下，你我又怎么知道，下一个受害者就必定不是自己呢？寄希望于侥幸，寄希望于无原则的顺从，并不会让社会变得正常起来，更不会给自己带来免予被害的丹书铁券。\n\n可见，在面对暴虐或不公时，坚守的底线不应当是明哲保身式的沉默，而是选择表达自己的异议。即便无法挺身而出公然抗议不公，这样的异议表达，至少是反顺从规训的努力的第一步。\n\n对于相关部门与学校因公共性言论而处分教师的做法，我完全不能认同。任何时候，用权力压制公共性言论的做法，都不可能具有基本的正当性。如果认为他的观点有问题或是不够正确，请使用说服、论证或者反驳的方式。\n\n用权力或威胁让人们住口，不止无助于社会问题的解决，反而会让社会的不满持续地累积，成为一个危险的火药桶。\n\n最后，借用一位心理学家的话，作为社会动物的我们，对待生活的正确态度理应是：批判而不愤世嫉俗，好奇而不受蒙蔽，开放而不被操纵。\n\n2019年3月29日\n\n于清华园\n\n* * *\n\n* * *\n\n对举报者混淆概念，糊弄是非的驳斥——声援吕嘉老师书\n\n    作者：Hofgarten  清华大学学生 \n\n很悲伤的，我们依旧会看到，文革的土壤从未从这片土地上消逝，甚至在这清华园，偏执的思想也依旧存在。\n\n我是一名在清华大学完成了本科学业，并且又在此攻读研究生的普通同学。我在本科和研究生阶段都上过吕嘉老师的课，并且多次与吕嘉老师交流观点。总的来说，我认为吕嘉老师是一位慈祥和蔼、温文尔雅又不乏睿智的老师。我无法忍受“毛顿”同学在“Hi社会”上攻讦吕嘉老师的所有观点，我将在此逐一进行驳斥。\n\n①所谓“根本相反的世界观”。吕嘉老师引用“独立之精神，自由之思想”，只是为了说明当代思修课的一些弊病。上过思修课的同学都知道，在初高中时期的老师很容易灌输书本上的生硬观点而没有让大家多去思考，造成了大家对思修课的厌烦。我想本科阶段和研究生阶段也有不少同学反感这门课，而选择打开自己的笔记本或者手机消磨时间。吕嘉老师正是用这个“独立之精神，自由之思想”来抨击目前思政课的弊病，倡导一种辩证的思想来看待目前我们学习到的马列主义、哲学思想。并且，吕嘉老师所提的“思想是某个‘我’的思想，并不是某个大脑的思想”，明显是为了佐证人的思想并不简单，必须谨慎地看待，更何况是在教学的场合，所以鼓励大家多去自由地思考。倘若在大学里连自由地思考都不能做到了，还何论大学？\n\n我不知道这位同学从哪里想到这是二元论和主观唯心主义的混合？二元论是完全将事物划分为两面看待，主观唯心主义是从“我”的思考去看待世界，正所谓笛卡尔“我思故我在”之言也。但是吕嘉老师告诉我们要认真对待每一个了解的思想，要设身处地地、用自己的思想去理解它、融会它，不正是毛顿同学所引“辩证唯物主义”的思路吗？\n\n②毛顿同学所抨击的“主张主观的、宗教的认识论、人生观、方法论”。我真是越看越笑，吕嘉老师明明只是做了个比喻。我翻译一下吕嘉老师的话吧：世界是循序渐进的，在过去，人们通过信仰真理（宗教）来完善自己；在现在，是需要完善自己的自我认知。但是自我认知是很难的，需要人指引。\n\n这难道有什么值得抨击的吗？你上个学读个书你都要看经典教材啊！你写个论文都要引用啊！他们不就是先哲吗！我如果给你讲拓扑，我会拿环拓扑上的torus和麦比乌斯带和你作比喻，就好比吕嘉老师拿黄金之于货币和宗教之于信仰作比喻，你就骂我信这些过时、用烂的东西？谁给你资格寻章摘句的？就说这个是宣扬宗教信仰？那你这么说所有只学过牛顿定律的同学都可以洗洗睡了。因为广义相对论推翻了牛顿定律，我们信的都是宗教信仰了。。。\n\n而且借助他人认识自己肯定是不行的啊，你不能活在他人的评价里，你不能只用“科学世界观”把自己当神来冷冰冰地看待世界啊！你中二病吗！对了说出上帝已死，让大家回归自己的尼采才是真的惨。。。我真的不知道这位同学你是哪里短路了突然总结认为吕嘉老师思想有严重谬误。\n\n③所谓“歪曲辩证唯物主义”。吕嘉老师的课件麻烦你用心看好嘛！吕嘉老师的意思是之前的教育有问题，太过强调“利益”，忽略了“道德”，所以要重视道德教育啊！但是现在道德教育有问题啊！政治化——很明显就是丑化人的私心，想把人变成完人。你自己难道就没有私心吗？你难道真的以为自己是个神吗？人无完人，所以道德教育要改良嘛，要面对人的自身需求嘛！而且，真的，请你不要一直吹过去60年好嘛！那可是包含了文革的60年，多少人用血换来的教训，被你忘了？\n\n④所谓“鼓吹宗教文化”。宗教文化确实是西方文明的代表之处，而且西方文明确实现在比较厉害。吕嘉老师拿宗教说是为了说明，我们现在需要道德教育。因为西方有宗教，在保守主义中扮演着非常重要的角色（“保守主义”四个字是我的私货），我们需要一个类似的角色。事实上，这也是中国共产党在做的，弘扬中国优秀传统文化，提出道德要求。这很好啊！这正是中央看到了问题根本之所在，而不是你拿起书本就说与马列主义相悖。高下立判，吕老师水平比你不知道高到哪里去了，人家和当代问题谈笑风生，你晓不晓得啊？\n\n对不起我喷不动了，凌晨两点了，明天还要做实验。最后一点：\n\n⑤所谓“反对集体主义、反对人民当家作主、反对消除私有制、反对公有制”，纯属歪曲。首先，反对集体主义、反对消除私有制、反对公有制并不是绝对之反对，而是保有其的状态下依据中国特色进行改革。这正是上个世纪80年代左右中国共产党所做的事。反对公有制就是私有制了吗？错！吕嘉老师的观点正是要依据中国自己的社会问题进行改革！正是中国共产党在历史上不断实践，在犯过一些错误的基础上，才逐步走到了今天，其中邓公功不可没。吕嘉老师陈述的是历史上的问题，而并非反对和推翻。\n\n太累了不想喷了，毛顿同学的文章让人看了不寒而栗，让人气到浑身发抖。不可想象，在21世纪的今天，在清华园的地方，还有教条主义的存在，还有寻章摘句攻讦老师以博得目光的居心叵测的人，而这样的人还是我们的同学。更为悲凉的是，还有人在下面点赞，支持他的看法。所谓“木秀于林，风必摧之”。不要让这股歪风邪气扰乱了校园的清净。不要让居心叵测的人让他的目的得逞。\n\n最后送大家一句话，独立之精神，自由之思想，各位任重道远。\n\n最后送毛顿同学一句话，好好读书，好好做人，好自为之。\n\n本文纯粹我气到炸裂而写，故平静以后再也不谈毛顿同学的文章了。我要做实验，我要看这个世界，我想去思考，我想追上同学们的脚步。\n\n（排版辣鸡，因为我不会排版。写的情绪激动，私货也很多，出错的地方，希望大家原谅。我会向大家学习的）\n**作者**：Hofgarten  清华大学学生"
		},
		{
			"post_id": 35,
			"title": "[转帖]乡绅美貌女儿惨遭10多人轮奸致死的经过",
			"date_published": 1553585405.005,
			"body": "　　谭松是重庆人，他在2002年开始调查川东土改历史，走访了十二个县市，访问了四百多个土改亲历者，包括当年的土改工作队队员、民兵、地主子女和知情者、甚至还有受尽酷刑而活下来的地主，所有采访均做了录音录像。最后完成了一部土改专访录，共三十六万字，尚未出版。\n\n　　在一次赴香港中文大学的学术活动中，谭松曾发表了题为《川东地区的土地改革运动》专题演讲。当时室外是7月盛夏的艳阳，但室内却弥漫着一股刺骨的寒意。在谭松平静的讲述和墙上视屏图像中，土改的种种酷刑展现在听者眼前，恐怖得令人脊背发凉。\n\n　　一位中文大学女教授一度听不下去，突然插话要求谭松〝请不要再讲了!〞谭松稍作停顿后予以回绝。他说，如果我们不去正视苦难和残酷的真相，这样的历史就会重演。他还以德国纳粹屠杀犹太人的波兰奥斯威辛集中营为例说，这个集中营是很残酷的，但学校老师依然带领学生去参观，因为应该要学生知道真相。\n\n　　下面这段采访实录，来自谭松对川东土改调查中的一段经历，这个惨烈而真实的故事几乎可以说是整个土改运动的缩影。很难相信，这段令人心颤的文字所记录的足以窒息人的罪恶，曾经如此真实的发生在我们生存的这片土地。\n\n　　采访时间：2006年9月22日\n\n　　采访地点：重庆市忠县香山宾馆\n\n　　采访者：谭松(重庆师范大学的副教授)\n\n　　被采访者：李朝庚(土改时期民兵，梁文华事件当事人)\n\n　　前记\n\n　　1950年，在忠县西山公园附小，有一个叫梁文华的年轻女教师，她的父亲梁树棻是忠县的绅士，县银行经理，也是地主。土改工作组和民兵们在斗打梁树棻追逼财物时，决定把梁文华也抓来斗。10多个民兵前去执行任务。但是，梁文华未能被解押到斗争会场，她死于途中一个山坡上。\n\n　　梁文华是当时忠县城里一大美女，见过她的人都赞叹她的美貌。那天晚上，梁姑娘落入10多个如虎似狼的民兵之手，他们将梁文华押到一个山坡上，将她轮奸致死。\n\n　　半个多世纪过去了，我们听说，当年参与轮奸的民兵中还有一个人健在(那10多个土改民兵没有任何人受到任何惩罚)，我们决心找到他。经过了许多周折，我们终于同他见了面。\n\n　　采访正文\n\n　　李：土改的时候我当民兵连长，站哨、防空降特务、掌握(斗争)会场。斗争地主的时候，把梁树棻弄来斗，要他的钱。其实那时他已经没得钱了，他虽然是银行经理，但是银行已经被共产党接管了。但还是斗，他没法，就说钱在他女儿那里，于是就去抓他女儿……只一晚上，(他女儿)就莫得事了(就没命了)……是轮奸，不是20多个人，是10多个人，10多个人把她弄去，一晚上就莫得事(命)了……\n\n　　谭：李师傅，据有人说你也参与了(轮奸)的。\n\n　　李：没有，我没有参与，我没有做那个事。人民政府成立了，缺人手，我进去做事，送信，每天挣六斤米。当时我是掌握会场，他们去学校抓人。人呢?没见到，第二天早上才发现她死了。我是在事情出了之后去了解情况的。事情出在官家院子，就是现在的污水处理厂后面那个山坡上。她躺在沟沟里，仰天躺的。头发很乱，已经不像个人样……不过，衣服还是好好的……\n\n　　当时那种情况，叫她站她就得站，叫她躺倒她就得躺倒，她遭不住打。喊救命?她敢!喊了就要挨打……不准她翻身……有种说法叫〝过七不过八〞，就是说七个人(轮奸她)还可以活，八个人就不行了。如果让她翻身起来走一下，只是人吃亏，不会丢命……我怎么懂这些事?我十一二岁就上重庆，在栈房里男女的事听的多。\n\n　　用杠子压她肚子排污?那不是她，那是另外的事……梁文华我见过，相貌是很不错，那时她还没结婚……说啷个她就得啷个……过火了……当时找床席子就在那个坡上把她埋了。\n\n　　受处分?那时有个啥子处分，只不过事没有办好，不受信任了。\n\n　　现在啷个看?说不清楚，龟儿毛泽东的事情说不清楚。那杂种，说不清楚……这个运动没把你打倒，下个运动就把你打倒。同志之间自己整自己也扎实(忠县方言，意思是〝厉害〞)，想不出的法子都想出来。三反五反时，你把我吊起来打，然后我又吊你，互相整。一个单位10个人，两个人在台子上互相打耳光，下面8个人参加批斗，其中有几个积极份子，要想往上爬、想升官就得积极整人。经过这么多运动，那些离、退休的，没有被整过的稀少得很。现在说毛泽东好，那是嘴上说说，你不说他好，脱不到手，怕下一个运动来你跑不脱……\n\n　　啷个看土改?过火了。我在县政府干事，送信，看到的听到的多，还看到一些材料。城关镇里打(这儿指〝杀〞)的人多，打了几十个，张大柱(音)、孙达X(音)那些人都是在这儿打的。一般在河坝打，画个圈圈，人跪在里面。有的偏不跪，就强迫他跪。毛泽东要杀人，不杀人他坐不稳。土改也是这样，毛泽东把地主的土地和财产全部收了，地主没势力了，只有去讨口要饭，一切都是他说了算，毛泽东才坐得稳。\n\n　　土改打人?是的，我见得多，几句话不对头就开始打，一般用棍子打。刑罚?刑罚就多了。就拿梁树棻家的亲戚方长辉(音)来说，方长辉是个40来岁的女人，破产地主。在黄金滩100多人的斗争会上，当众把她裤子脱光，用〝活马草〞(一种刺激皮肤、产生火辣辣灼痛的植物)再加上柑子刺在她下身来回拉。不过她没被弄死，后来还嫁了人。另一种刑罚就活不出来了，那叫〝点天灯〞——用黄泥巴在地主头顶上围一圈，中间倒上油，点〝天灯〞。我看见就这样把人整死的。还有〝吃咂酒〞——把两个大拇指用麻绳捆起，中间用木棍往下打，当场把指头整断了的都有。\n\n　　我打过没有?没有，我没有打过人……干革命?啥子革命?!老子跟着跑一辈子，一分钱没得!现在饭都没得吃的!说打倒了地主富农过好日子，那是嘴上说。一个生产队，20多个公社社员，才一双胶鞋。我一没得饭吃就回想起当年那些事，过火了……梁文华那个妹子，样子长得可以……\n\n　　采访后记\n\n　　2006年5月，通过忠县周康杰先生我们找到了李朝庚的家。从那时起，我们一次又一次地试图同他谈谈，李朝庚心存戒备，一次又一次地拒绝。2006年9月，在周康杰先生的大力协助下，经过一番曲折，我们终于从大街上把他〝拦截〞到了我们下榻的忠州香山宾馆。\n\n　　采访是比较艰难的，尤其是提到那位美丽少女的死。在我们直截了当的追问下，李朝庚要么矢口否认，要么顾左右而言它。\n\n　　他究竟参与没有呢?与他有交往的周炳昌老人十分肯定地告诉我们，当年李朝庚曾亲口对他说过，他参与了，几十年来他还多次梦到过那个女娃。周康杰告诉我们，他在河边曾问过李朝庚有没有这回事，李朝庚点点头，以一种很得意的心态说，他还很年轻时就搞过漂亮的地主小姐。\n\n　　李朝庚的否认在我们的意料之中。其实，我们追问李朝庚又有什么用呢?当时和后来的几十年，没有任何人去追究那一群强奸犯的罪责。土改杀人劫财是毛泽东、共产党发动的一场〝国家行为〞，那些土改积极份子和民兵们后来都成为了〝国家的栋梁之材〞。(但是李朝庚有些不幸，他现在吃着〝低保〞，过着如他所说的〝饭都吃不饱〞的贫困日子。)\n\n　　现在，已无法证实李朝庚到底参与没有，其实，这已不重要;重要的是，一个无辜的、如花似玉的鲜活生命，在那一个漆黑的夜晚，被宰杀在〝土地改革〞的血腥祭坛上。我们希望历史不要忘记梁文华这个无辜的少女，不要忘记民族苦难史上的那一幕罪恶。这是我们坚持要找到李朝庚的主要原因。\n\n　　梁文华全家在土改中的遭遇：\n\n　　父亲，被枪毙;母亲，被整死;祖父，被整死;外婆，饿死;弟弟，失踪;妹妹，失踪。"
		},
		{
			"post_id": 34,
			"title": "当所有Trackers都显示失效时(被墙)，显示找不到节点，打不开网站，怎么办呢？是不是觉得ZeroNet已挂？",
			"date_published": 1552820330.757,
			"body": "当所有Trackers都显示失效时(被墙)，显示`找不到节点`，打不开网站，怎么办呢？是不是觉得ZeroNet已挂？\n\n# No！\n\n现在教大家一个办法，只要有人做种的网站，大部分能轻松打开，请看：\n\n*   1，把ZeroNet更新到最新版(rev 3540以上)\n*   2，在ZeroHello页拉出小地球（因为ZeroHello节点数是最多的），点一下`节点数`那一行右边的那个`COPY TO CLIPBOARD`\n*   3，新建一个文本，ctrl+V粘贴\n*   4，修改ZeroHello的地址`1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D`为你要打开的地址\n*   5，ctrl+A全选复制修改的网址，粘贴到浏览器，回车。\n\n    # 你会发现一下子就打开刚才显示无节点的网站了。\n\n另外：ZeroNet默认只复制20个节点信息，如果想让效果更好，改一下代码里的一个数字：\n用Notepad++(任何文本编辑器)打开`ZeroNet-win-dist\\core\\plugins\\Sidebar\\SidebarPlugin.py`，\n把第120行`getConnectablePeers(20, allow_private=False)`的数字20改大（如：100），再保存，重启ZeroNet。改的越大，复制到的节点数越多，打开网站的概率也越大。\n\n*   再把这里的Trackers：[https://github.com/ngosang/trackerslist/blob/master/trackers_all.txt](https://github.com/ngosang/trackerslist/blob/master/trackers_all.txt)\n    加入[http://127.0.0.1:43110/Config](http://127.0.0.1:43110/Config) 的框框，保存，就完美了。\n\n——来自[ZeroMe 帖子](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1ABFCaadiEa3bFNzN3RcCZSsviqMNTbz3m/15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4/1532050210)"
		},
		{
			"post_id": 33,
			"title": "New blog post当所有Trackers都显示失效时(被墙)，显示找不到节点，打不开网站，怎么办呢？是不是觉得ZeroNet已挂？",
			"date_published": null,
			"body": "当所有Trackers都显示失效时(被墙)，显示`找不到节点`，打不开网站，怎么办呢？是不是觉得ZeroNet已挂？\n\n# No！\n\n现在教大家一个办法，只要有人做种的网站，大部分能轻松打开，请看：\n\n*   1，把ZeroNet更新到最新版(rev 3540以上)\n*   2，在ZeroHello页拉出小地球（因为ZeroHello节点数是最多的），点一下`节点数`那一行右边的那个`COPY TO CLIPBOARD`\n*   3，新建一个文本，ctrl+V粘贴\n*   4，修改ZeroHello的地址`1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D`为你要打开的地址\n*   5，ctrl+A全选复制修改的网址，粘贴到浏览器，回车。\n\n    # 你会发现一下子就打开刚才显示无节点的网站了。\n\n另外：ZeroNet默认只复制20个节点信息，如果想让效果更好，改一下代码里的一个数字：\n用Notepad++(任何文本编辑器)打开`ZeroNet-win-dist\\core\\plugins\\Sidebar\\SidebarPlugin.py`，\n把第120行`getConnectablePeers(20, allow_private=False)`的数字20改大（如：100），再保存，重启ZeroNet。改的越大，复制到的节点数越多，打开网站的概率也越大。\n\n*   再把这里的Trackers：[https://github.com/ngosang/trackerslist/blob/master/trackers_all.txt](https://github.com/ngosang/trackerslist/blob/master/trackers_all.txt)\n    加入[http://127.0.0.1:43110/Config](http://127.0.0.1:43110/Config) 的框框，保存，就完美了。\n\n——来自[ZeroMe 帖子](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1ABFCaadiEa3bFNzN3RcCZSsviqMNTbz3m/15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4/1532050210)"
		},
		{
			"post_id": 32,
			"title": "[榴营销]自私的人说，我不下地狱，谁爱下谁下",
			"date_published": 1552446551.324,
			"body": "　　马克思分析过，在腐朽堕落反动万恶的资本主义国家，必然周期性发生经济危机。\n\n　　到凯恩斯的时代，资本主义政府为了避免经济危机引发政治动荡，使用各种手段刺激经济，常见的有货币政策和财政政策。\n\n　　一方面，不管是货币政策，还是财政政策，最终都很容易演化为印钞机解决问题。因为，印钞可以把问题后移，不触动既得利益集团的利益，阻力最小，短期内又能缓解病情。\n\n　　另一方面，不论什么政策，都必然是华尔街(姓华的、华家人)获得好处的政策。除非发生革命，改变经济基础和上层建筑，否则触及华尔街利益的政策，根本推行不下去。这一条，比前一条更关键。\n\n　　但是，这样的操作，也会遇到实际困难。\n\n　　比如，如果美国政府在更大的资本主义国家(比如英帝+德帝+日帝联盟)的压力下，被迫对外承诺美元汇率保持不变，不通过贬值竞争出口，那么就必须限制印钞的数量。\n\n　　再比如，如果美国货币长期超发，M2增速长期和遥遥领先于GDP增速，国内物价有失控的趋势，那么美国政府也会限制印钞的数量。\n\n　　继续大水漫灌，汇率和物价，基本都受不住。\n\n　　在这种情况下，美国政府必然想方设法维稳经济，至少要稳住华尔街，不让华尔街破产。这样一来，一是可以维持一个富强民主文明繁荣的假象，二是可以获得最有实力的阶级(姓华的)的支持。\n\n　　既要控制印钞的数量，又不能让华尔街破产，美国政府左右为难。\n\n　　怎么解决这个问题呢?\n\n　　两个方案，一个是对华尔街滴灌，一个是让韭菜把钱拿出来，替华尔街还债。\n\n　　如何让韭菜把钱拿出来，这就是一个技术活了。\n\n　　华尔街有大量的金融资产，比如垃圾股票，垃圾债券，都是空手套白狼的东西。\n\n　　韭菜们买这些东西越多，美联储需要滴灌的总量就越少，货币政策的压力就越小。\n\n　　如何让韭菜们心甘情愿地买这些东西，这就是个技术活了。\n\n　　一般来说，涨价是最好的吸引韭菜用真金白银换废纸、换概念的方式。人在贪婪的情况下，智商都是偏低的。\n\n　　暴涨的背后，必然对应暴跌。在股价暴涨过程中，幸存的韭菜们拿出真金白银，姓华的减持离场，落袋为安。双方交换了筹码，然后韭菜们发现姓华的已经离场，傻眼了。\n\n　　很容易导致连锁反应，导致其他市场(比如不动产市场)的暴跌，经济急速下行，引起巨大的社会矛盾。CNN、ABC、华尔街日报、纽约时报、华盛顿邮报这些反动媒体，虽然可以火力齐开，把镜头对准稳中向好的华尔街，给大多数美国人洗脑。但是，并不能完全掩盖矛盾，尤其是大多数美国人失去工作、忍受物价上涨、投资失败的时候。\n\n　　所以，在正常的情况下，美国政府、美联储、华尔街，是不敢这么操作的。这是实实在在的饮鸩止渴。\n\n　　但是，个别情况下，是例外。\n\n　　比如美国国内形势需要制造繁荣的幻觉，哪怕是虚假的繁荣。比如，中期选举的时候，共和党需要制造繁荣的假象，那甭管未来怎么样，先让道琼斯股指涨起来再说。甭管未来是疯熊狂熊，过了中期选举再说。\n\n　　中期选举期间，道琼斯指数蓬勃向上，汇率强劲，物价虽然还在上涨但是货币增速受到控制，华尔街情况稳定，随时爆仓的金融风险消化于无形，韭菜们的脸上洋溢着幸福的笑容。这是多么好的景象啊。\n\n　　韭菜们也猴精。比如，如果知道中期选举10天以后结束，绝不会在中期选举结束当天抛售，而是会提前抛售，比如第9天。如果韭菜都预期到他人会在9天后抛售，那么提前抛售的日子就会提前到第8天。如此类推，韭菜们会不断提前抛售的日子。另一方面，还有一些韭菜心存侥幸，会在别人抛售的日子补仓。最终的结果，就是在不断的落袋和加仓之间形成互动。\n\n　　这并不排除股价会急剧暴跌，或者在剧烈波动以后出现阴跌。但是，在姓华的纷纷减持套现解套，韭菜之间自相残杀的情况下，希望道琼斯指数继续大幅上涨，是极其困难的。\n\n　　从另一个角度看，韭菜们杀入得越勇猛，越奋不顾身，姓华的越容易抽身，需要滴灌的总量就越少。毕竟，控制广义货币增速，让货币增速和GDP增速基本吻合，努力避免汇率暴跌，物价暴涨，是美国政府的货币政策要实现的目标。\n\n　　只要滴灌的大水流不到韭菜们的手中，道琼斯指数就很难坚挺。\n\n　　韭菜们越踊跃，姓华的困难就越少，货币增速就越慢。反过来，韭菜越踊跃，道琼斯指数就越难坚挺。两者结合，韭菜们奋不顾身入场的那一刻，就很难躲过最终为华尔街做贡献的结局。\n\n　　所以，那些不肯入场的美国人，应该感谢奋不顾身的美国韭菜——是他们的牺牲，减缓了滴灌的速度，减缓了美元下跌的过程。\n\n　　面对韭菜们的骨灰，受益者们将洒下热泪。谢谢啊。\n\n　　相比牺牲的韭菜，这些人，是自私的人，他们坚信“我不下地狱，谁爱下谁下”，没有奋不顾身的精神，做不到以看多为荣，以看空为耻。\n\n　　这并不是说，美国政府拿他们没有办法。毕竟，各种政策都必须对华尔街有利，长远目标往往要让位于眼前目标。所以，加税和印钞，都是箭在弦上的事情。有人问，美国政府不是经常减税吗，怎么会加税呢?记住，减税，减的是姓华的税，或者，收不上来的税，加税，加的是能收上来的税，或者，针对韭菜的税。\n\n　　所以，虽然他们眼前没有像韭菜一样自我牺牲，但是并不意味着从此高枕无忧。说到底，只要美国的经济基础不变，美国政府代表极少数华尔街人的利益，各种政策都必须对华尔街有利这一条不变，幸存者就随时可能付出巨大的牺牲。\n\n　　来源:卢瑟经济学"
		},
		{
			"post_id": 31,
			"title": "[表叔说原创]今年的代工真的非常不景气！死了一大片！问题回复中！",
			"date_published": 1551922845.426,
			"body": "　　发帖不易，如有违规请不要关小黑屋，感谢版主审核!\n\n　　小草的兄弟们好久不见，真的好长时间没有发帖了， 这阵子事情太多，身体又有问题，住院了好久。年都没有过好!开工以后又赶紧做代工的东西，可惜就三千多个表，真的是很熬死个人。往年开工以后，最起码有十几批的代工单排队要做，肯定要都满动力开工的，过万的订单肯定是玩一样的。今年就不行了，中美，中欧贸易都不怎么好，尤其老外开始把廉价代工的活都往东南亚发，导致现在做小件代工的场子一片一片的死。通过这个事情可以看出来，很多时候老外也是扯淡的，根本就不讲什么品质，东南亚的代工水平和中国比那是相差了N个等级的，无论是工人的技术熟练程度，还是说工厂规模，还有工厂的效率，中国的代工厂应该是世界第一的。 像我这样小的厂子，每年都可以接十几万的代工单子，更别说大一些的专业制造工厂。 手表行业的代工还是小部分的，如果是玩具，服装那真的是很厉害的。不过今年开年就都不怎么景气，再也不像几年前各种用工荒了。很多年轻人宁可在家送外卖也不会来工厂里上班。我一个朋友在给日本人做服装代工，今年下半年合同就要到期，目前看很可能也是不续约了，国内的服装厂家又没有什么大单子。他们厂子600个多工人，现在也是天天发愁的要死。 厂子不行了厂妹也就没有了，美好的故事肯定也不会发生了，到时候大家一起喝西北风咯。\n\n　　像我们手表行业的代工，组装工基本都是女人，相对男士来说，女工更加细心，干活仔细，成品率高，并且学会技术以后真的是在工厂好好干， 男士呢更多的是在工厂做培训，学好上手以后就想着自己出去鼓捣手表赚大钱，所以我的小厂子，现在也是女工为主了。只有一些开模的粗制车间还是男工为主，这类车间会比较累，并且干的活需要比较有经验有技术的老工人，甚至是几个师傅带着徒弟一起弄，不然一次开模失败就有可能赔死。 像最重要的设计部门，基本都是自己人在做，几个合伙人的直系亲属在画图，出图什么的。 大部分的核心技术还是自己在掌握。即便是这样，开出来的新表也会很快就被同行仿造，他们不买正品，买几个我们的假货做版，然后在更新，最后号称全新版本，冲击市场，这也是目前假货行业常见的互相倾轧的手段。\n\n<center>![](https://www.x6img.com/u/20190304/18131860.jpg)</center>\n\n　　这两年做手表技术培训班的人也有了，什么官方背景的，民间大牛的都有，收费从几千块到几万不等。有的老师傅，一年开个班，收30个学生，包住，每人四万多，学一个半月，收入也是很客观的，不过这种都是针对有一定基础的人，像0基础的，要学习的途径就会比较少。有很多大的工厂，比如西铁城，台湾等等，也会在内地直接招工，然后进行短期培训，不过学到的东西都是不全的，要么只交给你组装，要么只交给你打磨，要么就是交给你检测，只要你熟悉一个工作和一个机芯，其他的都不会交给你， 这种就是专门给流水线培训的工人，我之前去参观就有看到这样的培训，相对于想找工作的人来说这也是个不错的途径，月收入也能五六千左右，还有晋升机会，不是很要求文化程度，当然这些也就是最底层的组装工人，谈不上什么技术， 也没有独立工作的能力，所有对他们来说工厂就是一切。很过国产品牌的工厂，现在也是走这个路子，自建培训体系，达到输送人力的目的，但是招工的时候就会比较容易， 在怎么说也是交给你一门手艺了，这年代很多时候有个手艺真的就是饿不死了。当然想靠这个赚大钱就还有很长的一段路要走。可能几年时间的学习也不一定能够找到门路，因为手表技术的培训在目前的中国市场还是比较空白的，一是人员的需求量不是那么大，二是市场规模也没有那么大， 三呢还是传统的师傅带徒弟的模式在运作。并且一线城市的市场也几乎都被各大品牌占领了。尤其是是手表的维修市场，大家随便进一个商场都能看见有修表的，先别说修的技术咋样，但是肯定有。如果你所在的地区没有修表的，可以肯定的说明， 这个地区经济不是很发达。手表从进入中国就是一个比较金贵的东西，不管是出售还是维修都是比较费钱的，尤其是维修市场，目前还不存在所谓明码标价一说，即便我给你标注了很明确的价格，也是有各种可操作空间的。尤其是大部分客户根本就不懂手表，甚至可以说压根就不了解手表，很多客人连石英机械都分不清，这就更利于修表师傅去赚钱了。之前我就接到过一个同行放生的爱彼，这个师傅是和我的老师学习过一段时间，能修一些基础款，接到这个爱彼保养以后 给了一个极低的价格，他一开始以为是个假表，还觉得自己赚了，结果是个正品，拆掉以后无法复原，并且机芯条板也弄花了，最后没办法发到我这边来，又找师傅弄得，即便这样也是赔了客户不少钱。\n\n<center>![](https://www.x6img.com/u/20190304/1825598.jpg)</center>\n\n　　随随便便一个天梭的力洛克如果真的用心保养也要350-450的价格，很多师傅都是给200就保养， 反正也不能立等可取，最多就是给你清洗一下，有的甚至连夹板都不拆掉，真正干活的人是要拆掉所有零配件，包括避震器的，要知道拆避震器的风险特高，由于零件太小，不受力，很容易就断了，并且安装费事。市面上95%的师傅都是不拆的，弄坏一个避震，基本上这活就是白干了， 进货一个瑞士原装的就要几百，所以这也是很多人投机取巧的一个点。 收200块钱， 给你用汽油洗洗，外壳超声波一下，弄得干干净净，如果走时不行，就直接告诉你机芯有故障， 某些零配件需要更换完事，这样又可以赚一个零配件的钱，还可以赚一个维修费用。所以手表维修这个行业，收费贵的不一定真的是黑，其中的风险也很大。有时间在和大家聊这个话题。\n\n　　年前给一个老外代工了一批石英恒宝，很便宜900块钱，图纸也是对方拿来的，结果这图纸国内的机器坐不了，必须要用台湾的机器，后来一问才知道，人家这图纸是上一个厂家帮忙做的，所有的东西和我们的都不匹配， 又开始重新鼓捣这个图纸，弄了一个多星期，最后下了2500个订单，唯一的收获就算是捞到一个免费图纸吧，这样的事情现在假表市场非常多，通过脸书，推特都可以接到订单，国外的很多同行都愿意来中国做货，很重要的一点就是咱们国家的法律对假货这块还是没有那么严苛，都知道产业链上制造假货的风险是最大的，所以这群毛子就不想在本国继续做了，风险可以转移了，人工还降低了，品质也完全OK 。手表和合资车不一样，只要是标准OK ，做出来的东西不会有特别大的出入，所以你把瑞士表那套东西拿到中国，咱们一样可以做出来，只不过国内市场真的是被一些大家族给做烂了，以前老海鸥上海还可以扛起国产表的大旗，现在全是批发机芯的，要么就是半死不活。每年深圳表展大家可以去看看，全都是COPY表，有自己设计的真的很少。不管是上游工厂还是下游的代工都在模仿甚至直接造假。之前我看小米众筹平台有个表，镂空的卖800左右，也是各种血吹，实际呢，就是代工的现成玩意，也说自己获得了红点奖，用的西铁城8215机芯，仿照七个星期五的样子做的，也卖了几百个。这公司就在深圳 ，后来觉得西铁城机芯太贵，又用海鸥的机芯，不过用了钢带了，反而贵了一百多，都是表圈神奇的操作。 这公司没有厂房，全靠代工活着，老板是个圈内有点名气的前辈的孩子，我记得当时代工的价格也就200多块钱，最终怎么谈的我是忘了。这就是表圈目前的现状，好表做不出来，技术没人钻研，烂货一大堆，我觉得国内不仅仅是表圈这样的。太多的行业都是这样，大家肯定都能说出来几个自己行业的问题。我想这是肯定的。\n\n<center>![](https://www.x6img.com/u/20190304/20552137.jpg)</center>\n\n　　这两年也不像2000年那会，很多专家啊，经济学家啊什么的，经常说什么到底改革开放是国进民退还是民进国退，以前在新闻上经常能看见说国家大力发展第三产业，发展旅游业，轻工业，服务业，鼓励小资产进入市场，鼓励小企业，小公司发展。现在你再看看新闻天天说什么?打开头条前两个一定是置顶的某位领导人讲话精神，洗脑一年比一年严重，据说江西已经把爱党写进幼儿园和小学教材了。我是他么的无语了，小屁孩子能明白什么?虽然我不是一个反党反政府人士吧，但是我真的觉得有些事情X党做的太过分了，目前国内经济的支柱全部都是国有企业，任何行业任何领域的领头必然是国企，即便领头行业不是国企，也是国企背景。别拿华为说事，华为是不是国企还真不说准，一个靠政府工程发家的企业根上就不干净，我是不相信它和政府没有关系的。中国哪个私企也没有像华为这样得到中国政府的公开支持。这几年就明显感觉到，小型经济体逐渐的被边缘化，大经济集团在逐步的形成，尤其是决定行业发展方向和掌握原材料的集团，越来越多都是国家控制了。在国内做生意真的特别没有安全感，不管是正经行业还是灰色产业都是这样，因为你不是国家的主体，你可以随时为了国家或者说某些人牺牲。\n\n<center>![](https://www.x6img.com/u/20190304/21044162.jpg)</center>\n\n　　纵观新中国历史，我觉得除了邓小平的改革开放，最牛逼的国策就是公私合营了吧，赤裸裸的打着为你好的旗号，兼并个人的合法财产，还让你说不出来，或者说是不敢说出来。 推翻民国统治的主要是农民阶级啊，对不对。我不是不尊重农民，我家以前就是泥腿子，但是民国的泥腿子大部分都是代表落后，没见识的阶级，越是有家有业的越不想闹革命不是吗?自己生活的好好的干嘛闹得天下大乱?但是有的人就不这样，我就要闹嘛，推翻旧社会，翻身农奴把歌唱嘛。 不然我怎么做皇帝?这样就导致了中国在经济，文化，科技等等领域的倒退啊。又搞什么打到牛鬼蛇神，又搞大跃进，又大炼钢铁，又超英赶美，在来个自然灾害，苏联老大哥在雪上加霜，中国还有个好? 真应该感谢周总理，不然可能蒋公的反攻大陆国策就实现了呢。泥腿子不懂搞经济，也不懂什么国家规划，这也是为什么我们现在很多来科学技术都是民国那会的，新中国土生土长的顶尖科学家能说的上来几个?国外学成的不回来，你搞什么核武器? 可结果呢，十年浩劫，毁于一旦。 从根上就能看出来，以前的事情对现在的影响。这些新上来的统治阶级人群，他们都是泥腿子来的，他们没什么文化，经过几代人的努力又变得有文化了，有见识了，又担心自己的阶级被改变。所以呢，现在的社会现状很多问题就好解释了吧。中国这个关系社会，只要一天不改变，一天你就别想依法治国。什么时候中国人对关系不看的那么重了，都按照规矩来了，也就可以依法治国了。 但是，根上就不愿意你这样。 就拿东莞来说，以前都知道是性都，但是谁还知道东莞市是广东省的GDP大市，只靠灰色产业就能生存发展吗?东莞有多少企业?私人的国家的，上税以前可以到广东前五的。现在呢也是一片哀嚎。老百姓手里没钱了，搞不起生意了，国企把资金都归拢起来，都去搞房地产了。你的经济就是一潭死水，还搞个P 。此处感谢李嘉诚先生，不懂得可以搜索一下李嘉诚和中国房地产的故事。\n\n<center>![](https://www.x6img.com/u/20190304/21174222.jpg)</center>\n\n　　很多事情有事都是有迹可循的，国家与国家碰撞的时候，先死的一定是私有经济而不是国有经济，这是肯定的。所以现在国内的代工特别不好做，不只是国际环境的影响，国内的环境也是也是一样的。以前做代工可以赚外汇，现在狗屁没有，合资的坑呢，大部分企业主都不愿意跳，想做大呢，现有行业格局也已经形成了。所以为啥都说国内喜欢搞西门歪道呢，没辙啊，正经的路国家把持呢，不让你走啊。以前可以国家吃肉，你和汤。 现在是都烂在一个锅里了。这两年经济下行都能感受到。前两天印巴冲突，成飞不就火了一把吗? 股票立刻就涨停了，专家又跳出来了，什么中国股票军工板块领涨，大牛市要到来了。 我真想说去你麻痹的，军工企业发展的快，发展的好，的确是应该， 我们要自卫嘛。但是你丫干啥搞股票呢，搞个假市场经济吗? 连军工都是你的吸血机啊? 美国可以通过战争卸掉国内的经济压力。 中国可以吗?如果让军工领跑，那中国不打仗咋办? 生产的东西得有用啊? 这些专家真是不愁吃喝的。中国的经济泡沫有没有我不知道，专家们应该知道吧，一旦打仗，先完的有可能是国内的市场经济体系，而不是对手。 靠国企和垄断行业支撑的市场经济是不能依托战争来卸掉经济压力的，这个道理应该都明白吧。所以我们国家现在降低经济压力的办法就是救国企牺牲民企。只能这样。而没有技术的代工，就是最容易被淘汰的，不然富士康干嘛去添特朗普呢? 都有原因的吧。\n\n　　就说我去年代工的这批外单，咱们做出来900人民币，老外拿回去，标价300美金，他们啥渠道出售我是不知道，但是现在已经来追加订单了，说明出货量特别大，基本上四月就开始又给他们做货了。2500个三个月就卖掉了，国外的假货市场也是很给力的，所以有的时候看见国外的媒体喷中国造假我都觉得这些媒体啊，真的没啥道德，到底咋回事自己不搞搞清楚吗?有些就是大家心知肚明的事情，说透了就真的没意思了。中国的很多假货都是往国外销售的，别说什么欧美没有假货，我真的觉得遍地都是，我澳洲有个客户，一年拿四五十个表，不仅自己卖，还抵押，纯种澳洲袋鼠，人在金钱面前就别谈自己高贵的品德了。天下的乌鸦都是黑的，唯一的区别就是一般黑和特别黑。\n\n　　---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n<center>![](https://www.x6img.com/u/20190304/21425382.jpg)</center>\n\n　　说个题外话，本来不想发这个图，但是我真的要说明一下，这个cler你真的恶心到我了。我从入行到现在也有快十年了，不能说自己脾气特别好吧，但也不是那种看人就喷的类型，之前在小草发帖也都很小心，会写一些行内的事情， 也会告诉大家一起避雷的方法，承蒙大家厚爱，很多朋友加了我的微信，有的是要我帮忙鉴定， 有的是要修表， 有的是要来买东西，大部分都是很愉快的，我也感觉小草的朋友素质真的不错，但是就是有一些人，我也不知道自己哪里惹你了。就莫名其妙的就喷，麻烦这样的就别加我了， 也别私信我了。我的信箱一直都是满的，到现在我都还没有回复完呢。也是我比较懒，一天也回复不了几个，靠零售这几个表真的养不了我。主要是代工和批发的。并且几百的产品我的确没有零售的，真的不赚钱的。您说您拿一个几百的表，一般抬出来1024的都还要求打个折，在来包个邮寄，我本来就是批发走量的东西，我何必呢，对吧。有的朋友还要我去市场帮忙找一个表，真的不是我不愿意，广州表城的档口上千个我真的找不到的。还有就是能别拿话噎人吗? 说什么看你帖子写的这么好，以为你是个很敞亮的人，大家都是小草的，这点小事情你还不帮忙? 对您来说是小事情，对我来说可能要忙死的，您拿着别的地方买的假货，还是那种几百的东西，还非要我回收然后买我们的产品， 这咋可能呢? 都9102年了，老板们。太过的要求麻烦就别说了，小弟真的是满足不了您的。 合理的帮忙我都会帮的，不是那种冷血的人，只要有您有需要的，告诉我就行了。 其实真的不是说要在社区里卖东西什么的。一开始写帖子就是个喜好，后来就是个习惯了，有什么事情都愿意来BB 来句，没有什么软文， 也没么营销，愿意看您就看，不愿意您就右上角点个X。\n\n　　---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n　　在说回今年老外的代工，这哥们过年的时候来中国了，和我聊了不少，通过他我也知道了一些国外假表市场的游戏规则，和我以前的理解可能的确不太一样，尤其是美国市场，现在美国的年轻人对机械表都不怎么感冒，反而是电子表更受欢迎尤其是苹果之类的可穿戴设备。好看功能多，他们可能更多的不是需要彰显自己的社会地位，更多的就是为了突出自己的个性吧。\n\n<center>![](https://www.x6img.com/u/20190304/22575179.jpg)</center>\n\n　　像这样的东西我是没有想到在国外竟然很受欢迎的，因为国人对于假货的要求那是相当苛刻的，和美国人完全不一样。美国人是不太在意做工这些东西，他们只要觉得东西价格合适就OK ，并且不会太精细的去研究， 什么光泽啊，倒角啊，字体啊之类的，他们更在乎带在手上的感受和是不是和自己的风格更符合，能不能体现出自己的与众不同，能不能让别人通过这个东西一眼就感受到我的个人魅力和独特的风格。 国人是买个假货生怕别人看出来，恨不得要求比正品还高，指针上有个毛刺，皮带不如正品舒服，感觉这个字体的角度和正品不一样，并且带出去又想炫耀又害怕。我是觉得与其这个心态不如攒钱买个真货，像我这样的带个正品都没人信了，我也就无所谓了。有的大佬呢，带个假的理查德也有的是人说牛逼，因为大多数人觉得人家大佬不可能带假货，实际上不是的。我昨天接到一个客户的电话，十万火急那种，就是因为他的一个非常重要的领导，在饭局上把他的假罗杰杜彼带走了，他给我打电话让我帮忙代购一个真的送人家。。罗杰杜彼唉，，，好贵的。。谁都有买假货的理由，抽个时间我给大家分享一下我做假货这些年，遇见的特别可笑的事情。很多大神用假货各种骗炮打的，并且都是那种特别极品的女生。合理利用假货的确是省钱省心啊。\n\n　　我倒也不是鼓吹做假货多么多么好，毕竟是灰色产业，违反犯罪的。我也不希望年轻人进入这个行业，不是什么好行当，每年都有同行被抓，年销售额五万以上就是三年的有期徒刑的，所以现在做这行的真是不如卖白粉的。国家抓假货是按照正品的价值计算的，基本上一个表就够了，超过三十万就是七年了， 数额越大越是厉害。新闻里动不动就上亿的假货案件，实际上也就是一百来万的货而已，但是国家就算上亿了。。为什么这么算呢，也是有猫腻的，就有是某些人的发财之路了。这个就不能继续说了。不是我能说的了。\n\n　　今天就写到这了。也累了，要去睡了。不如再住院我也不开心了。过几年就是女神节了，祝愿小草的美女们，天天做女神。\n\n　　最后说一句，都是原创，打字好累，大家的问题我会在帖子里回复。 如果需要联系方式请私信。\n\n　　~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n　　回复39楼的问题：\n\n　　机械表都是有误差的，一般情况都是会走快，如果走慢呢，有可能是机芯油泥或者杂质太多了，需要清洗保养。大部分没有大故障的机械表通过保养都可以恢复。\n\n　　回复42楼问题：\n\n　　调日历正确方法：\n\n　　假设今天是2月10日，首先将腕表的时间调整到2月9日，然后指针转动24小时，让腕表自动跳转日历到2月10日。 这个过程中请区分手表的晚上和白天。 保证时间正确。 即可。 如果跳日历的时间通过这个办法也无法调整，那说明日历盘有偏差了，需要开盖重新装盘即可。大部分维修师傅都会。\n\n　　[ 此貼被表叔老魏在2019-03-05 22:00重新編輯 ]"
		},
		{
			"post_id": 30,
			"title": "[表叔说原创]今年的代工真的非常不景气！死了一大片！问题回复中！",
			"date_published": null,
			"body": "   发帖不易，如有违规请不要关小黑屋，感谢版主审核！\n\n         小草的兄弟们好久不见，真的好长时间没有发帖了， 这阵子事情太多，身体又有问题，住院了好久。年都没有过好！开工以后又赶紧做代工的东西，可惜就三千多个表，真的是很熬死个人。往年开工以后，最起码有十几批的代工单排队要做，肯定要都满动力开工的，过万的订单肯定是玩一样的。今年就不行了，中美，中欧贸易都不怎么好，尤其老外开始把廉价代工的活都往东南亚发，导致现在做小件代工的场子一片一片的死。通过这个事情可以看出来，很多时候老外也是扯淡的，根本就不讲什么品质，东南亚的代工水平和中国比那是相差了N个等级的，无论是工人的技术熟练程度，还是说工厂规模，还有工厂的效率，中国的代工厂应该是世界第一的。 像我这样小的厂子，每年都可以接十几万的代工单子，更别说大一些的专业制造工厂。 手表行业的代工还是小部分的，如果是玩具，服装那真的是很厉害的。不过今年开年就都不怎么景气，再也不像几年前各种用工荒了。很多年轻人宁可在家送外卖也不会来工厂里上班。我一个朋友在给日本人做服装代工，今年下半年合同就要到期，目前看很可能也是不续约了，国内的服装厂家又没有什么大单子。他们厂子600个多工人，现在也是天天发愁的要死。 厂子不行了厂妹也就没有了，美好的故事肯定也不会发生了，到时候大家一起喝西北风咯。  \n           像我们手表行业的代工，组装工基本都是女人，相对男士来说，女工更加细心，干活仔细，成品率高，并且学会技术以后真的是在工厂好好干， 男士呢更多的是在工厂做培训，学好上手以后就想着自己出去鼓捣手表赚大钱，所以我的小厂子，现在也是女工为主了。只有一些开模的粗制车间还是男工为主，这类车间会比较累，并且干的活需要比较有经验有技术的老工人，甚至是几个师傅带着徒弟一起弄，不然一次开模失败就有可能赔死。 像最重要的设计部门，基本都是自己人在做，几个合伙人的直系亲属在画图，出图什么的。 大部分的核心技术还是自己在掌握。即便是这样，开出来的新表也会很快就被同行仿造，他们不买正品，买几个我们的假货做版，然后在更新，最后号称全新版本，冲击市场，这也是目前假货行业常见的互相倾轧的手段。\n￼ \n        这两年做手表技术培训班的人也有了，什么官方背景的，民间大牛的都有，收费从几千块到几万不等。有的老师傅，一年开个班，收30个学生，包住，每人四万多，学一个半月，收入也是很客观的，不过这种都是针对有一定基础的人，像0基础的，要学习的途径就会比较少。有很多大的工厂，比如西铁城，台湾等等，也会在内地直接招工，然后进行短期培训，不过学到的东西都是不全的，要么只交给你组装，要么只交给你打磨，要么就是交给你检测，只要你熟悉一个工作和一个机芯，其他的都不会交给你， 这种就是专门给流水线培训的工人，我之前去参观就有看到这样的培训，相对于想找工作的人来说这也是个不错的途径，月收入也能五六千左右，还有晋升机会，不是很要求文化程度，当然这些也就是最底层的组装工人，谈不上什么技术， 也没有独立工作的能力，所有对他们来说工厂就是一切。很过国产品牌的工厂，现在也是走这个路子，自建培训体系，达到输送人力的目的，但是招工的时候就会比较容易， 在怎么说也是交给你一门手艺了，这年代很多时候有个手艺真的就是饿不死了。当然想靠这个赚大钱就还有很长的一段路要走。可能几年时间的学习也不一定能够找到门路，因为手表技术的培训在目前的中国市场还是比较空白的，一是人员的需求量不是那么大，二是市场规模也没有那么大， 三呢还是传统的师傅带徒弟的模式在运作。并且一线城市的市场也几乎都被各大品牌占领了。尤其是是手表的维修市场，大家随便进一个商场都能看见有修表的，先别说修的技术咋样，但是肯定有。如果你所在的地区没有修表的，可以肯定的说明， 这个地区经济不是很发达。手表从进入中国就是一个比较金贵的东西，不管是出售还是维修都是比较费钱的，尤其是维修市场，目前还不存在所谓明码标价一说，即便我给你标注了很明确的价格，也是有各种可操作空间的。尤其是大部分客户根本就不懂手表，甚至可以说压根就不了解手表，很多客人连石英机械都分不清，这就更利于修表师傅去赚钱了。之前我就接到过一个同行放生的爱彼，这个师傅是和我的老师学习过一段时间，能修一些基础款，接到这个爱彼保养以后 给了一个极低的价格，他一开始以为是个假表，还觉得自己赚了，结果是个正品，拆掉以后无法复原，并且机芯条板也弄花了，最后没办法发到我这边来，又找师傅弄得，即便这样也是赔了客户不少钱。\n￼ \n\n  随随便便一个天梭的力洛克如果真的用心保养也要350-450的价格，很多师傅都是给200就保养， 反正也不能立等可取，最多就是给你清洗一下，有的甚至连夹板都不拆掉，真正干活的人是要拆掉所有零配件，包括避震器的，要知道拆避震器的风险特高，由于零件太小，不受力，很容易就断了，并且安装费事。市面上95%的师傅都是不拆的，弄坏一个避震，基本上这活就是白干了， 进货一个瑞士原装的就要几百，所以这也是很多人投机取巧的一个点。 收200块钱， 给你用汽油洗洗，外壳超声波一下，弄得干干净净，如果走时不行，就直接告诉你机芯有故障， 某些零配件需要更换完事，这样又可以赚一个零配件的钱，还可以赚一个维修费用。所以手表维修这个行业，收费贵的不一定真的是黑，其中的风险也很大。有时间在和大家聊这个话题。\n\n  年前给一个老外代工了一批石英恒宝，很便宜900块钱，图纸也是对方拿来的，结果这图纸国内的机器坐不了，必须要用台湾的机器，后来一问才知道，人家这图纸是上一个厂家帮忙做的，所有的东西和我们的都不匹配， 又开始重新鼓捣这个图纸，弄了一个多星期，最后下了2500个订单，唯一的收获就算是捞到一个免费图纸吧，这样的事情现在假表市场非常多，通过脸书，推特都可以接到订单，国外的很多同行都愿意来中国做货，很重要的一点就是咱们国家的法律对假货这块还是没有那么严苛，都知道产业链上制造假货的风险是最大的，所以这群毛子就不想在本国继续做了，风险可以转移了，人工还降低了，品质也完全OK 。手表和合资车不一样，只要是标准OK ，做出来的东西不会有特别大的出入，所以你把瑞士表那套东西拿到中国，咱们一样可以做出来，只不过国内市场真的是被一些大家族给做烂了，以前老海鸥上海还可以扛起国产表的大旗，现在全是批发机芯的，要么就是半死不活。每年深圳表展大家可以去看看，全都是COPY表，有自己设计的真的很少。不管是上游工厂还是下游的代工都在模仿甚至直接造假。之前我看小米众筹平台有个表，镂空的卖800左右，也是各种血吹，实际呢，就是代工的现成玩意，也说自己获得了红点奖，用的西铁城8215机芯，仿照七个星期五的样子做的，也卖了几百个。这公司就在深圳 ，后来觉得西铁城机芯太贵，又用海鸥的机芯，不过用了钢带了，反而贵了一百多，都是表圈神奇的操作。 这公司没有厂房，全靠代工活着，老板是个圈内有点名气的前辈的孩子，我记得当时代工的价格也就200多块钱，最终怎么谈的我是忘了。这就是表圈目前的现状，好表做不出来，技术没人钻研，烂货一大堆，我觉得国内不仅仅是表圈这样的。太多的行业都是这样，大家肯定都能说出来几个自己行业的问题。我想这是肯定的。\n￼ \n\n   这两年也不像2000年那会，很多专家啊，经济学家啊什么的，经常说什么到底改革开放是国进民退还是民进国退，以前在新闻上经常能看见说国家大力发展第三产业，发展旅游业，轻工业，服务业，鼓励小资产进入市场，鼓励小企业，小公司发展。现在你再看看新闻天天说什么？打开头条前两个一定是置顶的某位领导人讲话精神，洗脑一年比一年严重，据说江西已经把爱党写进幼儿园和小学教材了。我是他么的无语了，小屁孩子能明白什么？虽然我不是一个反党反政府人士吧，但是我真的觉得有些事情X党做的太过分了，目前国内经济的支柱全部都是国有企业，任何行业任何领域的领头必然是国企，即便领头行业不是国企，也是国企背景。别拿华为说事，华为是不是国企还真不说准，一个靠政府工程发家的企业根上就不干净，我是不相信它和政府没有关系的。中国哪个私企也没有像华为这样得到中国政府的公开支持。这几年就明显感觉到，小型经济体逐渐的被边缘化，大经济集团在逐步的形成，尤其是决定行业发展方向和掌握原材料的集团，越来越多都是国家控制了。在国内做生意真的特别没有安全感，不管是正经行业还是灰色产业都是这样，因为你不是国家的主体，你可以随时为了国家或者说某些人牺牲。 \n￼ \n\n   纵观新中国历史，我觉得除了邓小平的改革开放，最牛逼的国策就是公私合营了吧，赤裸裸的打着为你好的旗号，兼并个人的合法财产，还让你说不出来，或者说是不敢说出来。 推翻民国统治的主要是农民阶级啊，对不对。我不是不尊重农民，我家以前就是泥腿子，但是民国的泥腿子大部分都是代表落后，没见识的阶级，越是有家有业的越不想闹革命不是吗？自己生活的好好的干嘛闹得天下大乱？但是有的人就不这样，我就要闹嘛，推翻旧社会，翻身农奴把歌唱嘛。 不然我怎么做皇帝？这样就导致了中国在经济，文化，科技等等领域的倒退啊。又搞什么打到牛鬼蛇神，又搞大跃进，又大炼钢铁，又超英赶美，在来个自然灾害，苏联老大哥在雪上加霜，中国还有个好？ 真应该感谢周总理，不然可能蒋公的反攻大陆国策就实现了呢。泥腿子不懂搞经济，也不懂什么国家规划，这也是为什么我们现在很多来科学技术都是民国那会的，新中国土生土长的顶尖科学家能说的上来几个？国外学成的不回来，你搞什么核武器？  可结果呢，十年浩劫，毁于一旦。 从根上就能看出来，以前的事情对现在的影响。这些新上来的统治阶级人群，他们都是泥腿子来的，他们没什么文化，经过几代人的努力又变得有文化了，有见识了，又担心自己的阶级被改变。所以呢，现在的社会现状很多问题就好解释了吧。中国这个关系社会，只要一天不改变，一天你就别想依法治国。什么时候中国人对关系不看的那么重了，都按照规矩来了，也就可以依法治国了。 但是，根上就不愿意你这样。 就拿东莞来说，以前都知道是性都，但是谁还知道东莞市是广东省的GDP大市，只靠灰色产业就能生存发展吗？东莞有多少企业？私人的国家的，上税以前可以到广东前五的。现在呢也是一片哀嚎。老百姓手里没钱了，搞不起生意了，国企把资金都归拢起来，都去搞房地产了。你的经济就是一潭死水，还搞个P 。此处感谢李嘉诚先生，不懂得可以搜索一下李嘉诚和中国房地产的故事。\n\n￼ \n\n很多事情有事都是有迹可循的，国家与国家碰撞的时候，先死的一定是私有经济而不是国有经济，这是肯定的。所以现在国内的代工特别不好做，不只是国际环境的影响，国内的环境也是也是一样的。以前做代工可以赚外汇，现在狗屁没有，合资的坑呢，大部分企业主都不愿意跳，想做大呢，现有行业格局也已经形成了。所以为啥都说国内喜欢搞西门歪道呢，没辙啊，正经的路国家把持呢，不让你走啊。以前可以国家吃肉，你和汤。 现在是都烂在一个锅里了。这两年经济下行都能感受到。前两天印巴冲突，成飞不就火了一把吗？ 股票立刻就涨停了，专家又跳出来了，什么中国股票军工板块领涨，大牛市要到来了。 我真想说去你麻痹的，军工企业发展的快，发展的好，的确是应该， 我们要自卫嘛。但是你丫干啥搞股票呢，搞个假市场经济吗？ 连军工都是你的吸血机啊？  美国可以通过战争卸掉国内的经济压力。 中国可以吗？如果让军工领跑，那中国不打仗咋办？ 生产的东西得有用啊？ 这些专家真是不愁吃喝的。中国的经济泡沫有没有我不知道，专家们应该知道吧，一旦打仗，先完的有可能是国内的市场经济体系，而不是对手。 靠国企和垄断行业支撑的市场经济是不能依托战争来卸掉经济压力的，这个道理应该都明白吧。所以我们国家现在降低经济压力的办法就是救国企牺牲民企。只能这样。而没有技术的代工，就是最容易被淘汰的，不然富士康干嘛去添特朗普呢？ 都有原因的吧。\n     就说我去年代工的这批外单，咱们做出来900人民币，老外拿回去，标价300美金，他们啥渠道出售我是不知道，但是现在已经来追加订单了，说明出货量特别大，基本上四月就开始又给他们做货了。2500个三个月就卖掉了，国外的假货市场也是很给力的，所以有的时候看见国外的媒体喷中国造假我都觉得这些媒体啊，真的没啥道德，到底咋回事自己不搞搞清楚吗？有些就是大家心知肚明的事情，说透了就真的没意思了。中国的很多假货都是往国外销售的，别说什么欧美没有假货，我真的觉得遍地都是，我澳洲有个客户，一年拿四五十个表，不仅自己卖，还抵押，纯种澳洲袋鼠，人在金钱面前就别谈自己高贵的品德了。天下的乌鸦都是黑的，唯一的区别就是一般黑和特别黑。\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n￼ \n\n说个题外话，本来不想发这个图，但是我真的要说明一下，这个cler你真的恶心到我了。我从入行到现在也有快十年了，不能说自己脾气特别好吧，但也不是那种看人就喷的类型，之前在小草发帖也都很小心，会写一些行内的事情， 也会告诉大家一起避雷的方法，承蒙大家厚爱，很多朋友加了我的微信，有的是要我帮忙鉴定， 有的是要修表， 有的是要来买东西，大部分都是很愉快的，我也感觉小草的朋友素质真的不错，但是就是有一些人，我也不知道自己哪里惹你了。就莫名其妙的就喷，麻烦这样的就别加我了， 也别私信我了。我的信箱一直都是满的，到现在我都还没有回复完呢。也是我比较懒，一天也回复不了几个，靠零售这几个表真的养不了我。主要是代工和批发的。并且几百的产品我的确没有零售的，真的不赚钱的。您说您拿一个几百的表，一般抬出来1024的都还要求打个折，在来包个邮寄，我本来就是批发走量的东西，我何必呢，对吧。有的朋友还要我去市场帮忙找一个表，真的不是我不愿意，广州表城的档口上千个我真的找不到的。还有就是能别拿话噎人吗？ 说什么看你帖子写的这么好，以为你是个很敞亮的人，大家都是小草的，这点小事情你还不帮忙？ 对您来说是小事情，对我来说可能要忙死的，您拿着别的地方买的假货，还是那种几百的东西，还非要我回收然后买我们的产品， 这咋可能呢？ 都9102年了，老板们。太过的要求麻烦就别说了，小弟真的是满足不了您的。 合理的帮忙我都会帮的，不是那种冷血的人，只要有您有需要的，告诉我就行了。  其实真的不是说要在社区里卖东西什么的。一开始写帖子就是个喜好，后来就是个习惯了，有什么事情都愿意来BB 来句，没有什么软文， 也没么营销，愿意看您就看，不愿意您就右上角点个X。\n\n---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n在说回今年老外的代工，这哥们过年的时候来中国了，和我聊了不少，通过他我也知道了一些国外假表市场的游戏规则，和我以前的理解可能的确不太一样，尤其是美国市场，现在美国的年轻人对机械表都不怎么感冒，反而是电子表更受欢迎尤其是苹果之类的可穿戴设备。好看功能多，他们可能更多的不是需要彰显自己的社会地位，更多的就是为了突出自己的个性吧。\n￼ \n像这样的东西我是没有想到在国外竟然很受欢迎的，因为国人对于假货的要求那是相当苛刻的，和美国人完全不一样。美国人是不太在意做工这些东西，他们只要觉得东西价格合适就OK ，并且不会太精细的去研究， 什么光泽啊，倒角啊，字体啊之类的，他们更在乎带在手上的感受和是不是和自己的风格更符合，能不能体现出自己的与众不同，能不能让别人通过这个东西一眼就感受到我的个人魅力和独特的风格。 国人是买个假货生怕别人看出来，恨不得要求比正品还高，指针上有个毛刺，皮带不如正品舒服，感觉这个字体的角度和正品不一样，并且带出去又想炫耀又害怕。我是觉得与其这个心态不如攒钱买个真货，像我这样的带个正品都没人信了，我也就无所谓了。有的大佬呢，带个假的理查德也有的是人说牛逼，因为大多数人觉得人家大佬不可能带假货，实际上不是的。我昨天接到一个客户的电话，十万火急那种，就是因为他的一个非常重要的领导，在饭局上把他的假罗杰杜彼带走了，他给我打电话让我帮忙代购一个真的送人家。。罗杰杜彼唉，，，好贵的。。谁都有买假货的理由，抽个时间我给大家分享一下我做假货这些年，遇见的特别可笑的事情。很多大神用假货各种骗炮打的，并且都是那种特别极品的女生。合理利用假货的确是省钱省心啊。\n\n我倒也不是鼓吹做假货多么多么好，毕竟是灰色产业，违反犯罪的。我也不希望年轻人进入这个行业，不是什么好行当，每年都有同行被抓，年销售额五万以上就是三年的有期徒刑的，所以现在做这行的真是不如卖白粉的。国家抓假货是按照正品的价值计算的，基本上一个表就够了，超过三十万就是七年了， 数额越大越是厉害。新闻里动不动就上亿的假货案件，实际上也就是一百来万的货而已，但是国家就算上亿了。。为什么这么算呢，也是有猫腻的，就有是某些人的发财之路了。这个就不能继续说了。不是我能说的了。\n\n今天就写到这了。也累了，要去睡了。不如再住院我也不开心了。过几年就是女神节了，祝愿小草的美女们，天天做女神。\n\n最后说一句，都是原创，打字好累，大家的问题我会在帖子里回复。 如果需要联系方式请私信。\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n回复39楼的问题：\n\n机械表都是有误差的，一般情况都是会走快，如果走慢呢，有可能是机芯油泥或者杂质太多了，需要清洗保养。大部分没有大故障的机械表通过保养都可以恢复。\n\n回复42楼问题：\n调日历正确方法： \n假设今天是2月10日，首先将腕表的时间调整到2月9日，然后指针转动24小时，让腕表自动跳转日历到2月10日。 这个过程中请区分手表的晚上和白天。  保证时间正确。 即可。 如果跳日历的时间通过这个办法也无法调整，那说明日历盘有偏差了，需要开盖重新装盘即可。大部分维修师傅都会。\n\n[ 此貼被表叔老魏在2019-03-05 22:00重新編輯 ]"
		},
		{
			"post_id": 29,
			"title": "这种坐牢你也可以…孟晚舟在加拿大的软禁生活[4P]",
			"date_published": 1551922518.383,
			"body": "　　加拿大卑诗省法院6日将对华为公司财务长孟晚舟引渡案举行听证会，孟晚舟去年底获保释后，便被戴上电子手环和脚镣进行全天候监控，但许多加拿大人认为，孟晚舟被软禁地点是她的豪宅，还能在警卫陪同下自由外出，只要每天晚上11点前回家即可，软禁生活堪称奢华，让许多当地民众称羡。\n\n<center>![](https://ws3.sinaimg.cn/large/005BYqpgly1g0szzsf7dzj30h20c04c3.jpg)</center>\n\n　　拥2栋豪宅\n\n　　纽约时报报导，近日某天下午，在温哥华桑那斯区一栋价值约1600万加币的7房大豪宅外，一名在卑诗大学中国籍学生在门口探头探脑，希望能看到孟晚舟这个加拿大目前最著名的「嫌犯」。但可能被引渡至美国受审的她并未出现，因为这栋豪宅正在重新装修，孟晚舟搬到她在温哥华的另一间房子，一栋位于另一个富人区价值约600万加币的6房豪宅。\n\n　　这位名叫李帕克(Parker Li，音译)的学生说：「在中国，孟晚舟是民族的骄傲，我想见识超级亚洲富豪的生活方式。许多大陆来的中国人都觉得她受到美国不公平地欺负。」\n\n　　不过，许多加拿大人却不这么看待孟晚舟。\n\n　　加人不满：炒房的有钱外国人\n\n　　在被捕3个月后，孟晚舟成为温哥华当地一个令人好奇且评价两极的人物。对一些当地人来说，孟晚舟只是个来温哥华炒房的有钱外国人，他们让温哥华房价狂飙，成为北美房价负担最沉重的城市之一。\n\n<center>![](https://ws3.sinaimg.cn/large/005BYqpggy1g0szzt4k7ij30ha0ddape.jpg)</center>\n\n　　一些温哥华人还把她的困境跟遭中国逮捕的加拿大同胞相比，许多加拿大人认为，中国的逮捕行动显然是报复加拿大抓孟晚舟。孟晚舟虽配戴GPS电子脚镣、遭24小时监视，但能在城市内自由活动，而去年12月被大陆逮捕的加拿大人康明凯与斯帕弗，一直被关在秘密的拘留所，律师与家人都无法探视，另名加拿大人谢伦伯格也因走私毒品遭中国判处死刑。\n\n　　加拿大和中国之间的关系很少如此紧张。中国在4日指控加拿大前外交官康明凯从事间谍活动，窃取国家机密，并称这些机密是由斯帕弗所提供，而就在几天前，加拿大才批准孟晚舟引渡听证会6日在卑诗省最高法院举行。\n\n<center>![](https://ws3.sinaimg.cn/large/005BYqpgly1g0szzqqvwhj30h00b8wpk.jpg)</center>\n\n　　孟晚舟控加边境局激起敌意\n\n　　随着更多诉讼行动出现，法律战也已向外蔓延;孟晚舟3日控告加拿大边境局、加拿大皇家骑警与联邦政府成员，在她去年12月被捕前非法拘留了3小时，侵犯她的宪法权利，且华为正准备控告美国政府禁止联邦机构使用该公司产品，更进一步激起敌意。\n\n　　在温哥华，孟晚舟案还引发了房价飙涨和外资炒房的相关讨论。\n\n　　触动贫富不均敏感神经\n\n　　研究温哥华高房价相关社会问题的西蒙菲莎大学兼任教授甄瑞谦说，「孟晚舟引起温哥华居民对严重贫富不均的愤怒和怨恨，民众认为一些外国人在此购买自由，钱来人却不来，把温哥华变成一个藏钱的避险城市」，并称「人们不满她被软禁在一座豪宅，两名加拿大人却关在中国监狱里。」\n\n　　甄瑞谦并指出，孟晚舟位在温哥华市西边登巴区的房子，尤其触动人们敏感神经，该区原本是温哥华代表性的中产阶级住宅区，如今却被外资炒到房价高不可攀，只有富豪才住得起。\n\n　　温哥华人在晚宴和咖啡厅闲聊时，都认为身为华为创办人任正非长女的孟晚舟，根本不是什么「可怜的小富家女」，1千万加币的保释金，让她在保释期间能自由离家，只要晚上11点前回家就行。她还能去温哥华近郊华人聚居的列治文市，那里有很多点心餐厅以及贩售名牌的大型购物中心。\n\n<center>![](https://ws3.sinaimg.cn/large/005BYqpgly1g0szzqexelj30fo0bok0r.jpg)</center>\n\n　　守卫保安用车是凯迪拉克\n\n　　孟晚舟在登巴区的邻居韦薛尔，指着孟晚舟的宽敞豪宅说：「如果要坐牢，这似乎是个不错的监狱。」数组保安人员守卫着孟晚舟的家，他们身穿西装，坐在凯迪拉克休旅车内。"
		},
		{
			"post_id": 28,
			"title": "没有兜底的社会保障，每个人只能在恐惧里裸奔。",
			"date_published": 1550839524.627,
			"body": "《我不是药神》电影热播，好评如潮。这部以主角程勇贩卖违禁的印度仿制药——治疗慢粒性白血病的特效格列卫为主线展开的社会生活方方面面的影片，之所以打动人心，是因为影片直击每个人的硬伤：“你就一个病，穷病。”\n\n的确，我们绝大多数人都患有严重的穷病。因为没有足够的钱，每个人都惧怕生病，或者家人有病。高额的房价无力支撑，可以暂且租住在别人的屋檐下；没有钱买新衣，可以穿去年的旧衣；没有钱买水果蔬菜，还可啃啃冷馒头；但是有病怎么办？普通病房一天的开支最低一千元开启，进入重症监护室（ICU）,一天的花销从万元起步，如果是慢性病人，长期服药治疗的的费用可以拖垮任何一个殷实的中产，普通的小老百姓，得卖房去救自己的亲人，在天价的进口药面前，有多少人只能被迫选择放弃维持生命？\n\n如果是乡下的农民，是城市里底层的赤贫阶层，他们该怎么办，每天为了赚点几块馒头果腹已经竭尽全力，有了病只能等死，在没有援救里，受尽病痛折磨，凄凉死去？只能赴死，用死来解脱活着的绝望与困境？\n\n佛法说：“人身难得”，生命只有这一次，没有人愿意放弃生活下去的希望，用死来完结自己在这个世上的存在，生存的快乐。\n我们每个人都活在没有人能给自己兜底的困境里，无论你现在有钱还是没钱，是生活在高处还是底层。\n\n我们没有全面的医药保障，每个人唯恐自己生病，唯恐生的是大病，唯恐家人生病，无力承担，整个经济陷入绝境，眼睁睁地忍受无钱医治，被病痛折磨的绝望。\n\n我们没有完备的失业保障；大学生一毕业，没有找到工作，没有生活来源，自己挣扎吧；中年失业的员工，没有人关问你是否还有钱买米？没有人在意你是否饥肠辘辘，兜里没有一个硬币……\n\n我们没有覆盖全民的养老保障；有钱的老人进养老院，有儿女的老人被儿女照顾，没有钱没有儿女的老人，自个打理自己，没有钱没地儿去的老人流浪在街头，在垃圾堆里寻食……\n\n于是，还有能力挣扎的人执信，只有钱能救自己，有钱才能保证自己的未来，有钱才是王道。于是每个人为了钱在打拼，竭尽全力搂取金钱，不在乎黑道白道，不在乎为了金钱去倾轧他人，甚至夺取他人的财物，性命。\n\n当所有人指谪中国人的冷血与残酷时，一个日本人却说：**“如果你觉得中国人奸诈且自私，请你原谅他们吧，那不是他们的本意。我们哪怕遇到再大的麻烦和困难，有国家作为依靠，而他们能依靠的只有自己。所以请体谅他们。”**\n\n这一段话，涌在心头，非常酸涩。他竟是如此地悲悯与宽容。每个人都有平等的生存权利，可是一个人从出生那天起，他们个人拥有的条件与能力是千差万别的，有人含着金钥匙，可有的人却本自赤贫，又兼身体状况不好，当天灾人祸，生老病痛，巨大的灾难砸到个人头上时，并不是所有的人都有能力承担，可对于无力担负的人，来自于社会，来自于政府的救助总是那么有限，尤其是对最底层的生存保障救助。\n\n我们不需要药神，即使程勇勇敢担当，还有更多的人也愿意像程勇一样担当，他们能做的还是有限的。我们迫切需要的是一个完善的，覆盖全面的保障体系，能保障底层，能保障所有在生存困境里挣扎的人，病有所医，老有所养，孤有所侍……。\n\n当每一个人都拥有这份维系自己生存的保障时，金钱还能至上，成为当下不顾一切的追求？尔虞我诈还能畅通无阻？亲情、婚恋还会\n掺杂着更多的物质偏离它的方向？\n\n惠及民生的事，是政府的责任，理该由它担当，不能推向个人，让每一个人在没有兜底的社会保障里，在对未来的恐惧里裸奔。"
		},
		{
			"post_id": 27,
			"title": "孟晚舟身陷囹圄，任正非其实更危险？",
			"date_published": 1550838935.308,
			"body": "孟晚舟被引渡美国似乎不可避免，根据起诉书看，其实任正非处境更不妙，\n\n美国从国家安全高度对待华为事件，任正非以后如果踏出国门，必有重蹈其女覆辙的危险，\n\n其他员工可能成落网之鸟，华为“杯具”了！\n\n![](https://yuoimg.com/u/20190222/1218271.jpg) \n\n一篇《任正非不能出门了 美国罕见大规模行动》的网络评论文章，解读了美国司法部对华为的起诉书。\n\n文章说，首先，任正非以后不能出门了，起诉书里面说2007年他就欺骗FBI探员，\n\n这在美国起码是lied to FBI，是妨害司法公正和串。\n\n其次，华为美国分公司所有人都有严峻的法律风险，因为他们涉嫌破坏证据，\n\n掌握实锤的人已经回国，留在美国的估计也坐如针毡。\n\n再者，这个案件一开始就有负责国家安全的助理司法部长参与，不是某地联邦检察官私人行为，\n\n看参与机构数量之多、之广，美方策划已久准备充分。\n\n另外，HSBC去年和华为停止业务往来，把华为吓得满世界安抚其他银行，现在这个正式起诉一来，\n\n华为的国际融资雪上加霜，整个中国走出去的企业可能都有类似困境。\n\n![](https://yuoimg.com/u/20190222/12182865.jpg) \n\n司法部文件非常详尽的描绘了华为试图偷窃T mobile技术的过程。\n\n文件第19页47段还揭露了华为有个奖励技术窃密的bonus program，可见窃密行为已经被组织化、流程化了。\n\n对于一个已经将窃密行为流程化的公司，即使司法部不动手，其他科技公司也应该限制将来和华为的合作行为。\n\n美国公司自己也需要为保密负责。\n\n![](https://yuoimg.com/u/20190222/12182890.jpg) \n\n文章最后还说，FBI这信息搜集能力实在是强到不可理喻。邮件信息还罢了，视讯会议记录是怎么拿到的？\n\n![](https://yuoimg.com/u/20190222/12182950.jpg) \n\n美方最近发动了大规模行动，联邦特工把华为在美14个办事处，研发基地，分公司全部查封了。\n\n包括在硅谷，孟菲斯，旧金山，洛杉矶，芝加哥，底特律，纽约，亚特兰大等多地的办事处全部悉数查封。\n\n美国在安然事件后已经很久没有以司法部名义，可以说是以国家的名义对一家企业发布刑事调查令了。\n\n来源：外滩人文财经\n\n**無極炁：如果要判刑，万恶的美帝是不是应该把所有的证据都发布出来？**"
		},
		{
			"post_id": 26,
			"title": "很多发达国家民众为什么极力反对无现金社会? 背后原因值得深思。",
			"date_published": 1550064172.385,
			"body": "很多发达国家民众为什么极力反对无现金社会? 背后原因值得深思。\n\n如今支付宝、微信支付等电子支付在我国大行其道、疯狂生长，大有要实现无现金社会的势头。但电子支付在很多发达国家却始终很难发展起来，对此人们疑惑了，是什么原因导致这么巨大的差别？其实原因就在于：我国绝大多数人民对电子支付是持欢迎态度的，至少不反对。相反的是：很多发达国家的民众对电子支付、无现金社会是有深深的顾虑和质疑的。以下就是外国民众为什么反对电子支付的原因。\n\n一、对于无现金社会，发达国家民众惊唿：这不就是新时代的罗马帝国的奴隶制吗？\n外国民众的思维是：\n1、进入无现金社会，意味着，你的所有支付行为只能通过少数几个金融机构搭建的支付模式进行。你如果不使用它这套支付模式，在社会上就无法生存，一天都活不下去。因为你买不了吃的，买不了喝的，买不了用的，也无法出行。这就变成了一种经济上的强制和压迫，你不能摆脱它，摆脱它你就没法生存。对于子孙后代更是如此，他们的命运将如同浮萍般随波逐流！\n\n2、进入无现金社会，从此你口袋里的钱只是某几个金融机构里的一个数字而已，少数的金融机构掌控着所有国民的命运。或许某一天你一觉醒来，因为某些天灾人祸或是其他原因你的钱突然间就消失了，消失得无影无踪，而你将一无所有。德国在一战和二战后，货币都经歷了一次崩溃，德国人民对自己突然间就一无所有有着痛苦的体会。日本人民在二战后同样歷经货币崩溃，同样有着突然间就一无所有的痛苦体会。所以对于很多发达国家的国民来说：现金是不得已的底线，推进无现金社会，进一步削弱他们对自己财富的掌控，这是他们容忍不了的！\n\n二、无现金社会，还有何隐私权可言？\n所有的支付行为都要用电子支付，这意味着，你所有的支付行为都在某些金融机构的监控下。你买了什么书，去过哪些地方，吃了什么东西，住过哪些宾馆，进行了哪些娱乐活动......；你已经下单但还没去的支付行为，将暴露你将要去哪里，将要去做什么，将要去吃什么，将要去住哪个宾馆，将要去进行什么娱乐活动，细思极恐！对于重视隐私权的外国国民来说，这样的无现金社会，他们肯定是不能容忍的！\n\n今年年初，欧盟委员会打着反恐、反洗钱、反偷税漏税的旗号，想推出：在2018年进一步限制现金交易上限的规定，以此进一步推进无现金社会。却遭到欧洲各国民众的强烈抵制，德国人民反应尤为激烈，因为他们深知这其中的猫腻所在。不可否认，电子支付使得人们生活、工作中的支付行为变得更方便、快捷。对于广大民众来说，它的好处也仅限于此，但它的弊处却是多多，不仅：严重削弱了人民对自己财富的掌控，严重蚕食了人民的隐私权，而将影响着子孙后代。\n\n现在国内有些人在嘲笑国外的支付方式落后，但真相是：多数民众没有远见，多数民众的思维、思想落后于人罢了！"
		},
		{
			"post_id": 25,
			"title": "首富的2018，很有意思的一篇文章",
			"date_published": 1547888034.837,
			"body": "　　文章转自兽爷!推荐给大家看看，如有不合适之处，请管理直接删除!\n\n　　又是一年一度的年会季，又是人民艺术家唱到让同事们睾丸撕裂、怀疑人生的时刻了。\n\n　　去年的道农会，乡村教师马云穿军大衣扮演杨子荣，演唱了样板戏《智取威虎山》。唱到动情处，他还比划了几个动作，深情地说：\n\n　　未来的五年是最好的五年。\n\n　　今年是不是最好的年份我不知道，反正他说自己退休了。\n\n　　这并不影响今年道农会马爸爸再次白袍加身，再次献唱京剧经典《洪洋洞》和《空城计》，歌颂国家的忠臣良将。《洪洋洞》他唱了这一段：\n\n　　为国家何曾半日闲空。\n\n　　不愧浙江省曲艺家协会前主席的儿子，马爸爸除了发音不对，调子没踩上，其他都没啥毛病。\n\n　　听完马云，我开始真正怀念灵魂歌手、前首富王健林。\n\n　　前首富在公司内部被称作“万达伍思凯”，他对刀郎的歌也是随口拈来。为了年会演出，再忙他也会提前在万达文华酒店5层会所练歌，那里几乎有全亚洲最好的KTV设备。\n\n　　据说一位小哥因为帮他调音调得好，连升几级，月薪从几千块钱涨到了几万块。\n\n　　但老王已经连续两年年会没有唱歌了。不仅没有唱歌，这个爱演讲、爱出书的前首富，2018年之后，再没有出现在聚光灯下。\n\n　　思聪也不再怼天怼地怼空气了。整个2018年，除了旗下电竞俱乐部夺冠火了把外，思聪对待这个世界也收敛了。\n\n　　两个月前，全国工商联公布了“改革开放40年百名杰出民营企业家”名单。\n\n　　曾当了全国工商联副主席和三届首富的老王，和他的股东、全国工商联常委刘强东一样，都没进入“杰出民营企业家”名单。\n\n　　世事一场大梦，人生几度秋凉。这世道，真的不一样了。\n\n　　1\n\n　　华盛顿交响乐团主席科特勒说：王健林的歌喉就代表着万达的品牌。\n\n　　万达“品牌之光”是从2016年开始唱响亮的。那年年初，万达的年会在西双版纳举行，老王一首《假行僧》压轴，“我要从南走到北”。\n\n　　彼时老王带着首富光环，整个舞台都洋溢着蜜汁自信。那会他的确是从南走到北，没有谁能阻挡——带着人民币走出国门、走向世界、买买买。\n\n　　到了2017年在合肥万达城开的年会，老王已超越李超人，成了亚洲首富。他意气风发，一口气唱了四首歌，从《夫妻双双把家还》，到《一无所有》。\n\n　　他尖头皮鞋翘起脚尖，踩着节拍，比马爸爸不知强多少。唱到高潮部分，他左手也挥舞起来，孔武有力。现场燃到爆点，台下欢呼声几乎压过了歌声。\n\n　　首富就是首富，不管说什么话、唱什么歌，大家都觉得很有趣。据说老王这几段嗨歌视频，网上有超过20亿人次的观看。\n\n　　老王那时众星捧月，被宠坏了。巅峰时期的万达，北京文华酒店每周有三四个发布会，生意动辄都是几百个小目标;万达广场B座人来人往，各地政要乃至外国元首上门求觐见，如过江之鲫。\n\n　　大概每个人都有这样的阶段，看事还没看透，看花又没看够。只是欢笑来如潮水散如雾。生命之弄人就是这样，很多事是在一夜之间发生逆转。\n\n　　这场嗨歌没过几个月，高唱“一无所有”的老王迎来了转折。\n\n　　去年万达年会在哈尔滨万达城举行。经历股债双杀和卖卖卖的万达，这一届年会的气氛有些凝重和悲壮——创业三十年，而立之年的万达向何处去。这个命题压在万达人的心头。\n\n　　老王也没有心情唱歌了，但晚会还是有的。压轴是《歌唱祖国》大合唱，合唱快结束时，有人发现老王在台下拿起了方巾，悄悄擦掉眼泪。\n\n　　《歌唱祖国》大合唱后，他上台说：\n\n　　我是个极少流泪的人，但刚才我热泪盈眶，30年万达真是不容易。\n\n　　灯火下楼台。如果你了解2017年下半年的万达，你便会明白这个狂人说的每一个字。\n\n　　刚刚结束的万达年会，老王还是没有唱歌。压轴节目是《万达之歌》的发布——这是万达30周岁唯一的庆祝。\n\n　　歌词是老王亲自写的。画风是这样：求创新，一直突破引领;守信用，一直老实做人;重执行，一直说到做到;做慈善，一直助教扶贫……\n\n　　歌手上台唱《万达之歌》时，台下的老王要比去年平静得多。演出结束后他上台说：\n\n　　年会要一直办下去，我也会积极锻炼身体。希望三十年后，还能和你们一起唱《万达之歌》。\n\n　　一位万达朋友说，当时他很想找方巾擦眼泪。\n\n　　2\n\n　　刚刚结束的万达年会，是在青岛东方影都开的。\n\n　　近千名万达的中高管，把东方影都的四家五星级酒店给住满了。很多人都心中有郁结，一年多以前，这里的一切还都是自家的，如今连酒店都换主人了。\n\n　　六年前，老王在青岛市黄岛区攒了一个世界级的局——投资500亿造东方影都。这被看作万达进军影视领域的巅峰之作。\n\n　　2013年9月，东方影都开工。老王把奥斯卡主席、美国各大电影公司CEO、妮可·基德曼、小李子等好莱坞影星都请来了。梁朝伟、甄子丹、章子怡等中国一线影星也都来助阵。\n\n　　要做就做大手笔的老王，要为中国带盐，在青岛做个东方好莱坞，碾压美帝的好莱坞。他甚至夸下海口，要让上海迪士尼20年之内盈不了利。\n\n　　后来地球人都知道了，迪士尼开业一年就收支平衡，东方影都却被老王打包卖掉了。\n\n　　2018年，老王又接连卖掉了伦敦和澳洲的大项目，海外最后的地产项目芝加哥万达大厦也在洽谈买家。如果交易完成，老王的海外地产项目就此清零。\n\n　　还是得佩服老王，这种壮士断腕、手起刀落的魄力，真没几个人做得到。短短一年多时间，他把负债缩减了近2200亿，相比一年半以前，万达的总债务减少了约三分之一。\n\n　　相比之下，海航稍微打了下小算盘，犹豫了一下，就错过了最佳抛盘时间。\n\n　　2018年4月，历时近五年打造的东方影都正式开幕。与五年前开工的鲜花着锦相比，五年后的开业，繁华落尽，还未完工的裸露工地，被广告幕布遮了起来。\n\n　　老王已经不是这片东方好莱坞的主人了。\n\n　　后来有传言说老王要卖文旅集团。万达马上发声明辟谣，没过多久，他们又被打脸了。老王果然在10月底把文旅集团及设计、管理公司都打包，一起卖给了孙宏斌。\n\n　　老王的钱包，看上去还是比较紧张。\n\n　　当然，更紧张的应该是接盘的融创。公司财报显示，截止2018年6月，融创的总负债已经是6064亿元了——早超过了老王大甩卖之前的负债了。\n\n　　融创收购过来的十三个万达城，海口项目彻底黄了。老孙最近跑重庆有点勤快，因为重庆融创万达文旅城业主闹事规模不小，据说政府在考虑后续土地如何处理。\n\n　　2018年的最后一个月，万达最大的事是和延安市政府签约，投资120亿建一个红色主题文化旅游项目，作为延安庆祝建党100周年的献礼工程。\n\n　　刚结束的年会上，王健林第一次说了这样的话：\n\n　　发自内心感谢党和政府，没有改革开放就没今天的万达。\n\n　　当年他在哈佛说的话，仿佛还在耳边。\n\n　　社科院马勇说过一句话：\n\n　　看中国的故事，不能有怨妇情绪，要有全球视角。\n\n　　造化没有弄人，弄你而已。\n\n　　3\n\n　　过去几年，华人商业世界发生了三件标志性事件。\n\n　　第一件是李嘉诚从大陆撤资;第二件是安邦、明天为首的权贵资本被整顿。\n\n　　第三件就是在海外买买买的万达、海航等公司，2017年开始都卖卖卖卖卖了。\n\n　　老李的撤资严重伤害了中国人民的感情。人民日报说他“遇到困难不能共度难关，不必挽留”;新华社说别让李嘉诚跑了。超人仍然弃城而去，不带一丝犹豫。\n\n　　再后来，人们都用紫霞评论至尊宝的话来说超人的决定：\n\n　　跑都跑得那么smart。\n\n　　老李去年以90岁高龄退休。前几天，出席长江集团年会晚宴前，这位长和系顾问对媒体说，退休后的生活很开心。\n\n　　说完又加了一句：因为每天仍会回公司办公室工作。\n\n　　回头看，那些曾经要对标长实、要活102岁、要进入世界十强的公司，要么老板54岁就退休了，要么创始人意外走了。\n\n　　前不久，碧桂园二小姐从公司副主席升为联席主席。64岁的杨国强开会时说：\n\n　　我要做到李嘉诚的年纪才退休。现在科技进步了，到时候可能身体更好了。\n\n　　杨国强说这句话的时候，一些高管偷偷瞄了眼坐在台下、正值壮年的总裁。\n\n　　一些人以为，这次万达年会，老王也会交待下接班人计划。\n\n　　但他没有提一个字。\n\n　　五六年前，他接受采访时说过自己的退休梦想——总资产到1万亿，收入到6000亿，到那一天我有可能就退休了。\n\n　　他还说接班不是一定要传给思聪。如果思聪出色，当然是最好的人选，如果不一定能担得起来，他可以交给职业经理人。\n\n　　一位跟随老王多年的创始高管跟兽爷说，老王这席话，当时在家族内部引起了不小震动。\n\n　　2017年年初，老王年会唱《一无所有》的时候，万达总资产曾经非常接近老王的梦想。当时万达总资产7961亿元，营收2549亿元。\n\n　　两年后，中国房企们都大踏步前进，万达却距离老王的退休梦想越来越远了。\n\n　　也正常，历史上几乎所有有计划的接班，都被打乱了。\n\n　　福布斯数据上，老王是2018年中国财富缩水最严重的富豪，财富蒸发了700多亿人民币。放眼全球，老王的缩水程度能排第四。\n\n　　经过两年去杠杆的不懈努力，老王终于成功摘掉了首富的帽子。\n\n　　不幸继承首富衣钵的许老板，只能让员工四处告求媒体，千万别写他是首富。\n\n　　如今，中国含金量最低的三个东西，分别是刘强东的“邓文迪许诺”、马蓉的问心无愧以及胡润榜的首富头衔。\n\n　　不仅是首富，连拿了行业第一现在都像得了前列腺炎，羞于说出口了。把万科从行业龙头拉下马后不到一年，杨国强很快不想当老大了。\n\n　　老王在今年年会上宣读的数字说，万达总资产6257亿元，营收2142亿元。总资产相比高点缩水了1700多亿，营收下降了400多亿。\n\n　　距离老王的退休，万达还有两个4000亿的长路要走。\n\n　　不过也没关系。明年之后，万达就再也不会公布这种自娱自乐的业绩了。\n\n　　草蛇灰线、趁水生波。不管是万达还是老王，将来只会越来越低调。\n\n　　大家一定会慢慢遗忘老王吹过的小目标。像遗忘前首富黄光裕的国美一样，万达将大隐于市。\n\n　　沈从文在《边城》里写过一句话：\n\n　　凡事都有偶然的凑巧，结果却又如宿命的必然。​​​"
		},
		{
			"post_id": 24,
			"title": "[转载]美国之怒，monkey你好",
			"date_published": 1544957768.972,
			"body": "　　众所周知，日美贸易战肇始于1960年代，激化于1970年代，高潮于1980年代。但是，日本从来就没把贸易战当一回事。因为，不管贸易战如何打，都只是经济领域的事，无非不过是讨价还价而已……直到，日本爆发了人类史上最严重的走私案件“东芝事件”后，美国彻底怒了!\n\n　　80年代，谁是苏联的老铁?别误会，不是某国，而是日本!\n\n　　虽然日本的国土由驻日美军拿生命保护，虽然美国与苏联正在打冷战，虽然……但日本依然是个独立国家，有自己的外交自由。所以，日本理直气壮地与苏联铁成一笔!那么，铁成一笔又是多铁呢?呵呵，没有日本，苏联早十年就特么解体了……\n\n　　​\n\n　　在冷战时期，美国与欧洲都对苏联经济封锁，但日本却与苏联打得火热，是苏联最主要的工业设备提供者。毕竟，苏联的钱最好挣啊。其中，日本的国民企业东芝，就最爱发苏联财!\n\n　　虽然东芝只是个民企，但它的触手比日本XX都牛逼，直接伸向苏联领导核心层，为大领导排忧解难。那么，什么是苏联领导最大的心病呢?\n\n　　苏联的海军实力远远弱于美国，它也无力和美国比拼航母。所以，苏联需要非对称性武器，航母杀手核潜艇。然而，苏联的核潜艇被美国笑话为“交响乐团”，噪音大得一笔，相隔二百海里都能被美军轻易发现!\n\n　　​\n\n　　为此，苏联最高层指示，要不惜一切代价从美国获取精密加工方面的高新技术，发展苏联潜艇。于是，苏联的某位实权大人物找到了东芝，希望东芝能卖给苏联四台MPB-110数控机床(五联动数控机床)……\n\n　　嗯，没错，东芝是有这个设备技术，但这项技术不属于日本，而属于美国。那么，美国为毛要把这项宝贵的技术给日本使用呢?\n\n　　因为，首先日本是美国最亲密的盟友;其次日本加入了“巴黎统筹委员会”，签署了不向苏联销售军事技术的条约……这不是“巴黎统筹委员会”合不合理的问题，而是如果你觉得不合理，就别签署协议啊?\n\n　　再或者说，有本事卖自己的技术设备，别卖美国的啊?然而，不要逼脸的东芝对苏联狮子大开口说“除了我们东芝，任何资本主义国家都不可能有此种胆量!”\n\n　　正所谓，饿死胆小的，撑死胆大的。最终，东芝的这4部数控机床卖给苏联卖了35亿日元(2000万美元)……那可是80年代啊，四台机器就卖2000万美元是什么概念?人类历史上还有比这利润更高的生意吗?而且，作为世界法务最强悍的公司之一，东芝把这事做得滴水不漏……于是，轮到美国懵逼了。\n\n　　​\n\n　　再牛逼的国家，技术的更新换代也需要时间，都是一代一代的更新……然而，苏联的潜艇突然“消失”了。美国海军第一次丧失对苏联潜艇的探测优势，甚至，在1986年还发生了美国和苏联潜艇相撞事故。难道，是外星人在帮助苏联吗?当然不是外星人，而是东芝!\n\n　　这四台美国技术的精密机床顺利到达苏联后，很快就发挥了作用。苏联不仅制造出低噪音潜艇，还把这项美国技术用在了核潜艇上，能把核潜艇开到美国海岸……美国百思不得其解啊!然而，这起改变人类历史的高科技走私案，却终于狗血!\n\n　　1985年12月，交易当事人之一熊谷独因与东芝发生纠纷而辞职，并愤而揭发了东芝走私事件。卧槽，全世界炸锅了，美国没想到背叛自己的居然是日本，居然是自己誓死保卫的国家!\n\n　　但是，熊谷独口说无凭啊，东芝还义正言辞地向世界声明：“绝对没有违反任何国际协议，向苏联出口违禁物品!”而且，东芝规模太大，日本XX也向着东芝死不认账，扬言美国污蔑，美帝国主义之心不死……\n\n　　虽然没有直接证据，但熊谷独为美国情报机构提供了调查方向。于是，经过一年多的调查，1987年初在“巴黎统筹委员会”召开的年会中，当日本国家代表再次否认曾向苏联出口过五联动数控机床时，美国播放了情报部门制作的一组幻灯片……只能说，铁证如山得一逼啊!\n\n　　美国把你当盟友，给你技术使用，你却把技术高价走私给美国的敌对国?日本的国家代表在世界各国的注视下，羞愧得说不出一句话，直接掩面逃出会场……这不是国耻，什么是国耻?\n\n　　美国举国上下都怒了，整个日本工业界也受牵连被冲击，日美的盟友关系出现二战以来最大的危机……那么，日本怎么办?日本跪下给美国道歉啊!\n\n　　一般来说，即使一个国家真的错了，也不会向另一个国家道歉，都是私下达成交易代替道歉。好吧，即使一个国家道歉，最高等级也就是外交部门道歉……然而，日本首相中曾根康弘为了东芝事件，当着全世界面郑重向美国道歉!而且，日本还花了上亿日元在美国的50多家报纸上整版刊登“悔罪广告”，乞求美国民众的原谅……但是，这依然不足以平息美国的愤怒!\n\n　　​\n\n　　​\n\n　　这真不是美国小气或心胸狭窄，而是东芝走私给苏联的四台设备让美国不得不花3300亿美元，对海军装备进行大升级。而且，钱能解决的问题都不算问题，问题是直到今天，美国海军仍没有绝对把握去发现新型的俄罗斯潜艇……So，你不会以为真的抓两个东芝高管牢底坐穿，就能让美国息怒?\n\n　　让东芝的违法高管死在牢里，只是惩罚的开始而已。东芝事件后，美国对日本全面展开贸易战，里根总统对日本发起了二战后美国首例贸易制裁。一年后，美国国会又以压倒性多数通过了对日超级301条款……对了，当年的对日谈判代表之一就是莱特希泽，今天已荣升为美国贸易代表办公室代表。\n\n　　​\n\n　　​\n\n　　言归正传，这不是301(经济)，而是超级301(非经济)，就是容许美国贸易代表以总统权力，进行所有可能的方式报复!最终，美国对日本的超级301报复高达20例以上，从牛肉桔子到卫星和超级计算机技术，无所不包，日本全部无条件让步……因为，这不是贸易谈判，而是拿整个国家为东芝赎罪!那么，日本为毛不做任何挣扎，跪得如此干脆呢?\n\n　　首先，日本是一个知廉耻的国家，错了就是错了，不会在铁证如山的证据面前，还不要碧莲地胡搅蛮缠!其次，更重要的是，日本清晰地知道，什么是美国之怒!我们不说第一次美国之怒向日本扔了两颗原纸弹，只说，人类史上最伟大的奇迹，日本奇迹!\n\n　　​\n\n　　仅仅战后10年，日本就从亡国灭种的边缘恢复到了战前经济水平;战后20年，日本经济就超过西德成为世界第三大经济体;战后40年日本又超过苏联，成为世界第二大经济体……那么，一个濒临亡国灭种的国家，如何在40年后成为世界老二呢?只有一个原因，美国全面开放科技树。因为，不说国家，人和猴子的区别就是工具，而科技就是制造工具的技术……\n\n　　这无关XX，而是任何一个专业科研人员都知道，美国就是人类文明科技树的树根，所有人类科技99%都诞生在美国这颗树根之上。这个道理用图表数据解释起来太麻烦，或者简单地说，抵制苹果的都是SB，抵制安卓系统的才是纯爷们!\n\n　　So，如果日本不认错呢?美国如果对日本关闭科技树呢?呵呵，美国之怒不是“天子之怒，伏尸百万，流血千里”，也不是“布衣之怒，流血五步，天下缟素”，而是“美国之怒，MONKEY你好!”\n\n　　​\n\n　　讲真，美国其实是一个挺好说话的国家，日本给苏联卖了那么多年工业设备，也没怎么样啊。但是，好说话不代表没底线，美国底线就是，你不能在签署协议之后，再把美国的技术卖给美国的敌对国发财啊!\n\n　　那么，在日本之后，今天还有其他国家在和美国签署协议后，又把美国的技术非法卖给美国的敌对国吗?呵呵，这都要2019年了，还会有不知道美国之怒的SB吗?"
		},
		{
			"post_id": 23,
			"title": "打蛇打七寸 川普为什么抓了华为任正非的女儿？",
			"date_published": 1544083691.583,
			"body": "今天（北京时间12月6日晨）国际媒体头条的最新大消息是，华为任正非的女儿孟晚舟、华为集团CFO在加拿大转机的时候被抓捕。华为公司在第一时间辟谣，但是很快的中国驻加拿大使馆发出声明，要求美国立即释放孟晚舟。\n\n按照最早发布消息的加拿大《环球邮报》（the Globe Mail）5日的消息，加拿大司法部发言人表示，孟晚舟已经于12月1日在温哥华被捕。她被美国要求引渡，并在周五（12月7日）设立保释听证会，“按孟女士要求的媒体禁令，我们目前无法提供任何进一步的细节”。\n\n无疑，这是继抓捕中国国安部江苏省厅官员徐燕君（音译，Yanjun Xu）之后，川普的又一跨国抓捕大动作。这个消息，放在川习会刚刚讨论了90天休战、华为近期陆续被美澳新英抵制、新疆关押百万人的“再教育营”被曝背后有华为技术的当前热点大背景之后，华为创始人的女儿被抓，格外醒目。\n\n那么，川普为什么要抓捕孟晚舟呢？要说明这个问题，我们首先需要说明一下川普今年以来最大的一个收获，就是他弄明白了中共真正关心的是什么；然后再说说华为在中共体系里面的特殊地位。\n\n一、**川普了解了中共真正关心的是什么**\n\n“上兵伐谋，其次伐交，其次伐兵，其下攻城”，作为战略大师、熟知中国文化的川普团队当然懂得这个道理。这也是川普自始至终声称要中共解决这次川习会提出那些结构性问题的同时，说如果中共报复，他会加税500亿美元，如果再报复，他会再加税2000亿美元。过程中，他还专门轻轻打击了一下中兴通讯，几乎造成其猝死。什么目的？棋子摆在那里了，也小打一下让你看懂，如果知道彼此之间的实力有巨大差距，那么正常人当然会知难而退，根本不会跟着打贸易战！\n\n而且，谁都知道打大豆会造成中国物价上涨、加关税会造成进口价格增加，降低关税才对中国民众有利，跟着美国加关税除了政府获得更多收入，对老百姓没有任何利益。\n\n也因此，今年以来屡屡准确预言中美贸易战走势的大陆金融学者贺江兵4、5月份斩钉截铁的说，贸易战肯定打不起来！\n\n但是贺先生错了。因为，中共不是正常政权，它把自己的统治、共产党的面子看得比远远的中国和中国人民的利益高的多。所以，它竟然一路跟着打下来了。\n\n过程中，一件事情让美国和中国人民进一步清楚了中共真正关心的是什么。\n\n9月20日，美国政府因中共军队从俄罗斯购买了军事装备，违反了美国的《以制裁反击美国敌人法案》，下令对中共军委下属的装备发展部及其部长李尚福实施制裁。这一下子，中共出奇的以高音量、大动作回应：\n\n外交部和国防部发言人先后抗议，召见了美国驻华大使和使馆代理国防武官，要求美方“纠正错误”，撤销制裁；召回了正在美国参加会议的海军司令员沈金龙，并且推迟中美两军联合参谋部对话机制第二次会议。与此同时，党媒连发评论，称美国“此举史无前例”，“不能小看这个看似对中国几乎没有什么实质性伤害的制裁措施”……\n\n这一番官方的密集动作，彻底露了中共的底：它根本不在乎老百姓受苦吃亏，但是对于其核心利益集团、党的高级党员干部来说，它绝对不可能忍受受伤、受威胁。要知道，李尚福代表的可不只是李尚福一个人，而是数百个超级家族和中共的高官权贵的利益，它们的家族资产在美国等国外，他们的妻子、小三、孩子在美国等发达国家，这些高官自己却在国内教育人们要爱党、爱国！\n\n日前，继中共国务院原发言人袁木之后，中国前副总理姜春云也被曝携山东电视台前主持人新妻定居美国。袁木是谁，对于我这样当年在初中以上，对六四有印象的人可能都会有印象，当时他出来信誓旦旦的对全球新闻媒体记者说：我们在天安门广场没有开一枪一弹，没死一个人。这可是反美名嘴。\n\n也就是说，对贺江兵先生这样预测中美两国贸易战打不起来的专家来讲，他们之所以错了，是因为他们根本想不到中共没有人性，共产党根本不在乎中国人民和中国老百姓的利益，所以才一定会打。而且，中共停止进口美国售价6元的猪肉进口俄罗斯12元的猪肉，还引进了肥猪猪瘟，祸害了全国。因为太巧合，很多中国人一度联想到了当年拒绝欧美日先进国家，引起了前苏联/俄罗斯的马列主义，祸害全国的往事，怀疑这里面是不是有什么神启？\n\n川普能够准确打击李尚福，当然离不开他的团队。\n\n川普团队，不同于以前的那些“中国人民的老朋友”，或国际上那些著名的“中国通”，爱的实际上是中共，却对普通中国人民的疾苦根本不予理睬。他团队里面的很多人，都对中共深有了解，包括这次参加川习会的美国国安会亚洲事务资深主任博明（Matt Pottinger）。这些人才是真正的中国通，爱中国的中国通。\n\n博明当年任《华尔街日报》驻北京记者，多次被抓被打。其中一次，他因为报导中共贪腐问题被中共警方逮捕。他后来在接受美国广播公司采访时说：“我当时被一群中共警察围住，就站在厕所里，看着我们的采访笔记一页页被撕碎，冲进马桶。”\n\n博明后来弃笔从戎，到过阿富汗服役，开过一家小公司，代表投资者对中国企业进行调查，后来博明又在纽约的一家对冲基金工作，直到加入到川普团队。\n\n在2005年发表于《华尔街日报》一篇文章中，博明写道：“在中国的生活可以告诉你，一个非民主国家能对它的公民做些什么。”“我看到抗议者在天安门广场被便衣警察拦阻和殴打，当我和一个消息来源说话时，还遭到政府人员录像。”\n\n正是这些人，帮助川普制定了新的对华政策，严格区分中共和中国、中国人民。其中，包括美国副总统彭斯在哈德逊研究所的遏制中共的演讲，在美国总统层面第一次公开说出了中共和中国的区别。彭斯演讲中7次使用“中国共产党”称呼，而不是以往惯用的“中国”或“中国政府”。他每次指出中共的不当行为时，都会点名“中国共产党”。演讲中的一些中国名言，包括“人见目前，天见久远”，也让大陆广大网民惊呼，这背后有真正的中国通！\n\n这种情况下，川普团队既然知道了中共真正关心的是什么，那么就要打蛇打七寸。\n\n**二、华为任正非是中共核心集团里的核心成员**\n\n华为不仅是一家普通的技术企业，其创始人任正非还是中共核心利益集团里面的核心成员。\n\n了解中共体制的都知道，中国的社会精英层由三类精英组成，一是政治精英，二是经济精英，三是知识精英。这些人一起构成了中国今天的最大的利益集团。所有这些人都得主动或被动的受中共的钳制和唆使，为维护党的统治核心利益服务，然后才能获得更大利益。这一点，在著名经济学家、中国问题专家何清涟女士的著作里面也做过分析。\n\n日前，中共中央表扬了100个著名的改革开放任务，这些人里面，阿里巴巴的马云、腾讯的马化腾、百度的李彦宏、联想的柳传志都是技术和经济精英，而不知道是不是故意的，这个表彰名单里面漏掉了近年最受美国等关注的科技巨头华为的任正非。而中国人都知道这些公司对中国隐私权的侵犯，甚至百度式的谋财又害命。\n\n从体量和科技实力来讲，华为都远远超过了其它几家科技公司。大陆媒体《壹科技》曾经做过专题分析，《华为体量到底有多大？相当于百度、阿里巴巴、腾讯的总和！》\n\n2017年，华为全年营收6036亿元人民币，约合941亿美元。\n\n论员工数：截止到2017年初，百度5万、阿里巴巴5万、腾讯3万，总共13万，华为17万；\n\n论纳税额：2016年，百度22亿、阿里巴巴109亿、腾讯70多亿，合计约200亿，华为纳税337亿；\n\n论年利润：2016年，百度105亿、阿里巴巴234亿、腾讯242亿，合计约580亿，当然70%左右被外资拿走，华为利润279亿；\n\n目前，全球有超过20亿人每天使用华为的设备通信，即使在4G技术领先的欧洲，华为也有过半的市场占有率，在150多个国家拥有5百多名客户，营收7成来自海外！\n\n从技术角度看，华为的产业链之完整，技术之完备，也远非一向被称为中国科技巨头的另一个通讯公司的中兴通讯所能够与之相比的。它拥有完整的手机、电信设备、企业网络设备，还有自己的操作系统（比如手机，基于安卓进行个性化开发），有自己的芯片。\n\n换句话讲，华为如果想监控你，可以在手机、电信服务商、企业端、政府端全面进行。\n\n**华为也确实是中共最有实力的打手。现在华为是中共政府和军方的电信类业务最大承包商。遍布全国的监视中国民众的系统“天眼”，新疆关押百万人的“再教育营”的管理系统，迫害法轮功，全球间谍、技术黑客，等等都有华为背后的鬼影子。**\n\n在海外，华为也一直是被质疑窃密的焦点。\n\n例如，2018年7月13日，澳大利亚战略政策研究所（ASPI）发布的一份新报告披露，中国电信巨头华为与非洲联盟的重大数据泄漏事件有关。\n\n报告说，法国报纸《世界报》（Le Monde）于2018年1月份发布的一项调查指出，位于埃塞俄比亚的非洲联盟（AU）总部的机密数据每晚都被发往上海，持续了五年之久。中共被指为幕后操手。\n\n新报告披露，华为曾与AU委员会于2012年1月4日签署一份合同，规定华为为AU总部大楼提供一些网络技术基础设施。\n\n外界也一直质疑华为的背景。华为前员工曾对外媒透露，华为的内部运作如同特务机构，在商贸活动、人员调配上都听命于中共，并为中共军方的一支精锐网络战部队提供服务。\n\n美国防部2008年对国会的调查报告指出，华为公司的两位灵魂人物－－时任总裁任正非、董事长孙亚芳的出身背景十分特殊。任正非在中共军方工程部门任职十四年后退伍，创办华为公司之后，凭借其岳父四川省副省长孟东波的势力，在中国西南军区取得程控交换机庞大市场，奠定华为公司成为“电信帝国”的基础。\n\n而此次被抓的任正非的女儿孟晚舟，正如中共核心利益集团的很多子女一样，随母亲那边姓。\n\n报告还说，华为现任董事长孙亚芳，大学毕业后在中共国家安全部(ＭＳＳ)从事通信工作多年，与华为一直有深度的联系，在国安部安排下，1992年加入华为，实际负责与各国政府和军方之间的业务。\n\n另据《华盛顿时报》报导，美国中央情报局(ＣＩＡ)的公开调查报告揭露：华为公司过去三年从北京政府拿到二亿二千八百万美金的资助，提供中共政府“如同ＫＧＢ(前苏联国安会)一般的情报服务”。中情局的资料显示，华为协助非洲、中亚、南美以及中共政府建构监听及定位设备。\n\n美国知名的DefCon骇客大会指出，华为公司生产的路由器有明显安全漏洞。这些预留了“后门”的设备，令中共军方可以随时存取任何资料。中共不仅监控及过滤中国大陆网络的一举一动，透过大陆公司华为和中兴卖给海外的电讯设备，中共还企图拥有了监控全世界大部分网络的能力。\n\n前五角大楼高级攻策分析师F. Michael Maloof认为，中共是透过华为（Huawei）及中兴（ZTE）两间电讯供应商去制造“后门”，为世界各地电讯商安装不同电讯设备的同时亦安装了“后门”设计，好让中共能够监控得到各式各样的资讯，即上网及通话资料等，并有机会修改甚至破坏原有内容。\n\n美国国会〝美中经济暨安全审查委员会〞今年4月发布报告，指控中共当局可能支持某些企业进行间谍活动，遭点名的中企包括华为、中兴、联想三家。\n\n实际上，作为长期生活在大陆的中国人，更知道华为这样的集团和任正非本人在中共里面的地位。作为中共政府和军方的最大的系统管理的承包商，说华为只是一个技术企业，请问中国人谁信？\n\n以上的分析表明，川普知道华为的任正非在中共体系里面的重要地位。\n\n而中共外交部这次对抓捕孟晚舟的快速抗议，也正说明了，川普打蛇打到了七寸。\n\n其实，了解中国的人都清楚，如果这次美国抓捕的是华为的某个高管，中共根本不在乎的。区分孟晚舟和华为高管，正如区分薄熙来和王立军，前者是中共的“自己人”，后者只是中共核心利益集团的家奴。\n\n我们不知道川普团队这次给予中方90天的“缓期执行”，是不是因为考虑到了提高关税和扩大范围，打击的只主要是中美两国的普通百姓和中小企业，对核心利益集团的打击是微乎其微的，所以对中共的要求顺水推舟，试图寻求更有效的打击措施，但是从效果看，这种措施，对高层的震撼力不亚于核弹。\n\n但是，这个消息，和李尚福案件一起，对于可能正在进行中美谈判、承诺结构性改革牵扯到的那些中共核心集团大佬们—-他们这两天正在被外界质疑试图拖延时间，不知道他们会怎么想？\n\n毕竟，那些核心家族的大佬们，哪个没个子女呢，哪个可能不偶尔出个国呢？上次可以在比利时诱捕徐彦君，这次可以在加拿大抓捕孟晚舟，谁知道下次会不会在澳大利亚、新西兰德等中共权贵最喜欢去和拥有绿卡比例最大的国家里，再抓捕哪个权贵的子女或者本人？或者动到了他们名下的财产？\n\n想想都害怕。"
		},
		{
			"post_id": 22,
			"title": "为什么越来越多的中国人选择移民？\n",
			"date_published": 1542461195.276,
			"body": "为什么越来越多的中国人选择移民？\n\n如今选择移民的人越来越多，原因各式各样。为了安全的，不管是资金上还是人生上；为了出行便利的，中国护照只免签40多个国家，而欧美等国基本都免签150个国家以上以上；为了身体健康的，国内的雾霾，环境和国外确实有些差距；为了以后的养老的……但孩子，却是占比最高的一个原因。\n\n国内和西方的生活习惯，孩子的成长环境的差异让越来越多的人放弃了自己熟悉的土地和生活的圈子而举家搬迁，说起来看似牺牲了很多，可是在了解了西方的成长教育环境之后，为了孩子的未来，移民似乎成为了家长们摆脱现状的唯一出路。\n\n步入中年，有了孩子，价值观就完全不同。身为父母，最幸福美妙的事情不再是K歌，甚至不在乎功与名，更重要的事变成：陪伴着孩子们健康快乐地成长。\n\n早晨闻着的草香和孩子们散步去学校，在放学的路上看他们在草坪上喂鸽子；在车库里搭个工具房，看老公教孩子们做木工；在后院的老树上搭个树屋，给孩子们一个做梦的地方；晚饭后陪孩子在露台上聊天看星星；周末跟着老公带孩子开车去旅行看世界。\n\n但在国内，忙于工作，依赖于电子产品的我们，早已经失去了这份纯真，与孩子一同奔波于择校与各种培训班。除了梦想因素，国内残酷的自然环境，教育和人文环境等现实问题是让大部分父母们无法淡定的主要原因。\n\n一.环境\n冬天逐渐逼近，雾霾的担心可困扰又隐隐随之而来。雾霾之毒，无处可躲，孩子们像困兽般被关在家里，出门玩个滑板车，都要提前看看天气预报。对于麻木的成年人，雾霾基本毫无影响，他们的注意力只是从电脑转移到手机，再从手机转移到电脑的区别。\n\n![](http://www.xoimg.club/u/20181116/09413328.jpg) \n\n孩子不能每天对着电视和IPAD，只能选择各类培训班，但那人口密度可以赶上非高峰时段的地铁了，大人比孩子还多，每个父母们都在争先恐后地保护着自己的孩子，孩子根本谈不上自由的社交空间。\n\n孩子们玩耍的空间已经被无限地压缩，从小被畸形地陷入高压的学习氛围，没处能玩，想消耗孩子们无限旺盛的精力就只能读书了。不管孩子喜不喜欢，不管有用没用，绘画，钢琴等等，只要能占时间和陶冶情操就好。\n\n二.教育\n父母们都想为孩子找一所愉快教育的学校，但结果往往不尽如人意，填鸭式的教育会破坏孩子天生的求知欲和学习动力，更成为学校和老师追求排名和声望的牺牲品。教育只有遵循孩子内在的成长速度，点燃他们的学习热情比传授知识更重要。\n\n![](http://www.xoimg.club/u/20181116/09413325.jpg) \n\n国外小学的普遍情况：\n\n1\\. 孩子在学校里无论成绩好坏，都会得到老师相同的关注和尊重；\n\n2\\. 学校给孩子充分的体育活动；\n\n3\\. 学习任务轻松，让孩子放学后，有充分的时间和精力去做自己喜欢做的事情，发展个性；\n\n4\\. 更好的情况是，老师愿意放下身段，平等地对待孩子，引导孩子自己寻找答案，即便这种方法比直接传授慢好多也不介意。\n\n但这些标准在国内是很难实现的，所谓的名校，精英学校说到底与成绩和升学率紧密挂钩的，孩子在校的压力不言而喻。\n\n三.多元化发展\n除了学业以外，老师非常注重孩子的性格培养，体育能力以及其他各种生活体验。老师总在创造各种让孩子锻炼协作能力和领导能力的机会，甚至在教育局对学校的educational report的考评上的比重都很大。\n\n此外，学校还会组建各类文体club，让孩子自由选择自己的兴趣爱好，以及种类繁多的创意活动，比如校园disco、海边活动、马拉松、甚至做蛋糕……\n\n四.因材施教\n\n![](http://www.xoimg.club/u/20181116/09413197.jpg) \n\n国外的学校基本不会对孩子进行横向比较，每个孩子都是与众不同，有各自的特色的，根本不可以设定一个维度(比如成绩)去比较。\n\n唯一能比较的，是孩子的过去和现在，也就是自身的进步。\n\n即使初到海外的孩子语言较弱，成绩不佳，但依旧会得到老师的表扬。孩子得到了鼓励，会越来越自信，学习热情也被激发了出来。\n\n这时老师会说：“你来的时候一句英文不会，这么短的时间居然可以拼写出那么多单词了，实在是太优秀了！”事实上，这些进步是因为相应等级的阅读和适合的书籍的功劳。\n\n五.舍近求远\n所谓“舍近求远”，是虽然告诉孩子一个真理只需要10分钟，但老师宁愿花1个小时，让孩子自己去发现这个真理。\n\n他们认为，孩子发现真理的学习过程比真理本身更重要。而这和国内追求结果，追求立竿见影的教育思路截然相反。\n\n六.人文环境\n不知何时开始，“三六九等”深深的植入了我们的价值观中，金字塔顶端对金字塔低端的人歧视其实无处不在，这也是人人都要着急往上走的原因之一。\n\n而在国外，孩子将来即便不去名校，喜欢做一名理发师、厨师或水电工，也可以在社会上占有相对公平的一席之地，得到应有的尊重。\n\n这是不少人选择移民非常重要的一个原因，希望孩子将来有权利去选择自己真正喜欢的事情，而不会被国内传统的名利导向的社会价值观歧视。\n\n移民对下一代的意义在于他们能够在遵循自然规律成长的同时， 长大后，还能拥有国内千军万马过独木桥才能争取到的教育资源。\n\n![](http://www.xoimg.club/u/20181116/09413256.jpg) \n\n不得不说教育是每个家长的心病，想给孩子一个童真自由的时光，然而社会却压迫着孩子不得不前进。所以很多家长那么义无反顾的移民国外，只是想让孩子活得更轻松，享受更好的童年。"
		},
		{
			"post_id": 21,
			"title": "华春莹：美国该向中国学习各民族平等！",
			"date_published": 1542460771.775,
			"body": "　　华春莹：美国该向中国学习各民族平等!\n\n　　我也不知道是我的审美观有问题还是真的她就长的很难看，说实话，我认为用满脸横肉，一脸骄炸，语气轻浮，浅薄无知 扭捏作态 来形容她是很贴切的。这样一个人来做中国政府的发言人也说明了这个政府的水平所在。\n\n　　推特上有人向她喊话，问她在洛杉矶的大house到底有多大——我无法证明她在美国有没有房子，就好像中国的脊梁倪萍大姐在退休多少年后才知道在美国有两套昂贵的大房子，而信誓旦旦在全球媒体前公然撒谎说天安门前没有死一个人没有伤一个人的的前中共发言人袁木也是在最近才曝光了在美国幸福的打高尔夫球的照片，当然袁同志的女儿在六四时候就跑去美国了。这估计也是怕万一六四失败了，家人已经走了。所以，我们目前不能知道华大姐到底有没有在美国买豪宅，到底豪宅有多大，因为中国的领导们家庭成员和财产分布是最高机密，不像万恶的美帝随时可以查询。\n\n　　今天我们只说这位发言人，怎么看她的发言带着一股浓浓的无赖腔调和痞子神态，更是颠倒黑白 指鹿为马。 就像这种美国应该向中国学习民族平等，我都不知道是笑是哭，是悲是喜。就这样小丑一样的东西在代表着十几亿中国人讲话，在国际上代表着几千年中国文化的表现。自以为无赖试的俏皮，莫非她不知道这让人看来是无赖样的小丑? 当年中国人为的大饥荒，饿死几千万中国人，美国几次三番的向中国提出无条件的援助中国粮食，而中国所谓的领导人幽默的说，我们不缺粮食，倒是美国缺少的话，我们可以支援给美国一些。 这自以为的幽默和这 自以为的俏皮异曲同工——从没有把这十几亿的人看作是人/ 他们表现着自己的俏皮和幽默而从不顾及到十几人的肚皮和尊严，也就是物质和精神，这一脉相承的东西刻在了这个组织的骨子里，从没有改变过。从毛时代的自绝于全世界到今天的与世界文明为敌都在说明着这一点。\n\n　　而这所谓的发言人，说的过的小丑一样的话，无赖一样的话，竟然还被自我宣传为霸气， 幽默，有力，机智……被五毛和自干五们津津乐道，你从这个事情上就可以看出，什么五千年的文明，什么道德治国，现在这国家有文明吗?有道德吗?它吹捧的是什么?它们做的是什么?\n\n　　君且看他们所谓的霸气 机智 幽默：\n\n　　不要拿法律当挡箭牌\n\n　　印尼排华是印尼内政，不予干涉\n\n　　中国不存在所谓新闻审查制度\n\n　　中国人权比美国好五倍\n\n　　如果觉得苹果被窃听，那建议用华为\n\n　　中国人权好不好，只有中国人才有发言权\n\n　　如果中国共产党不光荣伟大正确，那为何13亿人愿意投胎到中国\n\n　　美国该向中国学习各民族平等\n\n　　……\n\n　　无赖痞子小丑，不是幽默机智霸气，难道中国政府连能够辨别出这个几个单词的人来都没有了吗?还是说那位小学文化的司机就喜欢这种浅薄的自以为是的傻逼言论? 如果是那也没有什么出奇的，毕竟小学文化的司机曾经说过的话也大都如此水平，比如说，二十里山路不换肩，比如说，林子大了什么鸟都有，比如说吃饱了撑的没事干，比如说，撸起袖子加油干……我越写越觉得这货的水平是真他娘的低，中国五千年的文化弄出这么个东西来，说出如此粗鄙不堪的话语，而且还被到处宣传，写成标语在电视上发言稿里大屏幕上到处传颂，看到这些，你真想象不到中国曾经出过唐诗宋词 出过昆曲，出国牡丹亭 西厢记 红楼梦诸如此类的文化食粮。而且这货的思想还要被研究，全国都要被这货的思想指导——甚至吹牛逼的说要指导世界，哎呀，想起这个就觉得这个民族可怜，到底生活在这片土地上的普通人上辈子造了什么孽，被这些东西统治啊。\n\n　　可怜 可叹 可悲 可惜"
		},
		{
			"post_id": 20,
			"title": "来晒太阳的村民觉得美得很，最后说，这房子啥时候开始贴瓷砖呢-土生土长",
			"date_published": 1542104054.658,
			"body": "**土生土长**\n\n大家好，我叫穆钧，来自北京建筑大学。今天我的演讲的题目叫《土生土长》，其实这也是我这些年来一直从事的研究和实践工作的主题。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/1d9b9217985fe8d5e4934df32c14e835.jpg)\n\n我们都知道，过去交通没有像今天这么发达，人们要盖个房子只能就地取材，只能利用本地可得的这些土木石竹草等等自然材料来盖房子。在所有这些自然材料资源当中，实际上用得最多的是两样东西，一个是土，一个是木。我们过去的古人经常会用土木之工来描述房屋建造这件事情。\n\n因为只要适宜人类生存的地方基本上都有土，所以用土来做建造这个传统应用非常广泛，历史非常悠久。最早的，甚至我们目前可以追溯到仰韶文化时期。比如说在咱们湖北的屈家岭，5000多年前的遗址当中，我们就可以看到用土坯来建造的房屋。\n\n因为只要适宜人类生存的地方基本上都有土，所以用土来做建造这个传统应用非常广泛，历史非常悠久。最早的，甚至我们目前可以追溯到仰韶文化时期。比如说在咱们湖北的屈家岭，5000多年前的遗址当中，我们就可以看到用土坯来建造的房屋。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/7cc1337935f80170ca1244cad10d5b6e.jpg)\n\n▲ 湖北屈家岭遗址，距今5000—6000年\n\n还有非常有名的吐鲁番交河故城，公元前2世纪开始就兴建了，整个城都是拿土来建造的。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/a6fb9fd3a834e705a8605de4863f02e0.jpg)\n\n▲ 吐鲁番交河故城，公元前2世纪始建\n\n甚至包括我们最熟悉的长城。可能很多人都不知道，实际上大部分的长城，当时都是拿土来建造的，只是后来为了加强防御的坚固度和耐久性，才在外面包上了砖或者砌上了石头。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/714d4469de26601dec9a9131537f6958.jpg)\n\n说到这儿，我就需要介绍一个名词的概念：生土。它是相对于我们把土拿来烧陶器或者是做烧结砖这种变熟了的方式。是指我们把地下的土挖出来，只需要经过简单的机械加工直接当作建筑材料，而不是通过焙烧或者加化学的东西去改性。用生土材料作为主材的建筑，我们通常会把它叫作生土建筑。\n\n​\n\n生土不光是在咱们中国，在全世界也是应用最为广泛、历史最为悠久的建造传统之一。比如这个就在巴勒斯坦，11000多年前的遗迹当中可以看到用土坯来盖房子的痕迹。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/570bc78c9967595fe7312579742ee436.jpg)\n\n▲ 耶利哥城，巴勒斯坦，距今约11000年\n\n还有在3200多年前的古埃及，人们用土坯做的这样的拱券，用作储藏的粮仓。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/d8478a20321cb2e2e93e5f370517a9a2.jpg)\n\n▲ Gourna，埃及，距今3200年\n\n还有，今天我们在摩洛哥依然能看到这种非常漂亮的，整个拿土来建造的古镇。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/35a91e93bb1d2777d2e6888c4c11b739.jpg)\n\n▲ 扎古拉古镇，摩洛哥，始建于18世纪\n\n在西班牙，我们可以看到很多古城堡，都是拿土来建造的。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/5c4963882e105d571d2fcc2a75600e62.jpg)\n\n▲ 比亚尔城堡，西班牙（建于12世纪）\n\n在法国、德国，近几百年间也建造了很多类似这样的古城堡，这种多层的民宅都是拿土来建造的。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/d0dbc3e473fad10d72686773a0ff198c.jpg)\n\n根据联合国教科文组织在本世纪初做过的一个全世界的统计，至今全世界至少还有三分之一的人口居住在不同形式的土房子里。\n\n​\n\n中国现在是什么样的状况呢？2010年前后，住房和城乡建设部对全国做了一个农宅现状的普查，发现现在每个省依然还能看到土房子，保守估计，全国至少还有6000万人口居住在不同形式的土房子里面。\n\n目前主要集中在以下五个地区，比如华南地区大家都非常熟悉的土楼，还有这种土堡。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/dc3b9f092a5dc1d52ac10d733aba5e99.jpg)\n\n黄土高原地区的窑洞，以及这种生土的合院。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/1da75c572ed686d31d87f9bbb857d7ad.jpg)\n\n西南地区，我们所熟悉的丽江大理有很多这种土坯房，还有这种土掌房。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/9fb2fdfc5465f265926ef761fb1f19ca.jpg)\n\n青藏高原地区非常大的这种闪片房，以及碉楼。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/627876e01595015f346fa6cf64369c90.jpg)\n\n还有在新疆地区，非常著名的喀什古城整个是拿土来建造的。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/18d6cf8a129c3a6d801924b60dabf664.jpg)\n\n对于我个人而言，跟生土的结缘要追溯到2004年。那时候我刚刚从西安建筑科技大学硕士毕业，申请到香港中文大学读博士。我的博士生导师吴恩融教授就问我，你想研究什么呀？\n\n我其实考虑了很久，告诉吴教授说，我在读研究生的时候跟着我的硕士导师周若祁先生在黄土高原地区跑了很多农村，看到了大量的这些土房子。\n\n很多老师都告诉我们说，这些土房子冬暖夏凉、生态环保，可是在我调研过程中，发现很多村民都不愿意住在里面，他们都希望有一天能把这些土房子拆了盖成新的砖瓦房。所以我想研究到底怎么办。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/21c7ae011143053e1053fc53003ae65c.jpg)\n\n我导师问我说那你想怎么办，我巴拉巴拉说了一大堆。他就笑了，说哎呀，你要把这些都研究出来，靠你一个人估计一百年都做不到。这样吧，你先跟着我来学绿色建筑吧。刚好我最近在甘肃的庆阳有一个慈善项目，是帮当地做一个小学校，你把这个项目搞定，搞不定你就别毕业了。所以我就带着导师深深的祝福来到了这个偏远的小村子里。\n\n​\n\n它叫毛寺村，就在黄土高原最核心的地带。当地原来是一些很分散的只有几个年级的小学校，村民想把它们都集中起来建一个新的学校。当时我也看到周边有很多新的拿砖混凝土盖的学校，当地村民都说那个是冬天冷夏天热，看着很光鲜。尤其在冬天，当地气温只有零下十几度，即使烧煤，很多小朋友的手上都会生冻疮。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/cf04e3ee7aa0050b98b43908bc4c3c86.jpg)\n\n当时我在这个地区做了很多调研，把所有在当地可能实现的一些能够有效节能的技术措施全部整理了一遍，然后通过热学软件模拟的方式整个做了一遍试验。大家可以看这张图表：\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/bc2fa1783713ac98d62280faeaab0fdc.jpg)\n\n这个横轴是我把每一样技术用在这个教室里面带来的造价增长的百分比，纵轴是用每一个技术之后冬季室内气温提升的度数。大家会发现，有一类技术只需要花一点钱甚至是不花钱，就能让室内的气温增长很多。这类技术就是当地以土坯为代表的传统建造技术。\n\n​\n\n所以后来在吴教授的指导下，我们就用性价比最高的当地传统建造技术设计了这所小学。当时我一个人在这个村里面住了一年，跟村民一起来把这个小学盖成。在这个过程中，我从什么都不知道，到后来从村民那里学到了很多传统建造的经验。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/fad46b7a2f44e808bec9af9f0a56fb37.jpg)\n\n后来这个小学盖成以后是这样的，感觉好像很现代。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/fbf57500a69af05cb96abc4f07564208.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/4773ac3fc724bc063b3ce23e84335d5d.jpg)\n\n建成之后它的造价只有600多块钱一平米。\n\n后来我们做了为期一年的现场温度测试。发现在夏天，刚才前面介绍过的砖做的学校，室内气温是紧跟着室外气温跑的——这条黄色的线，最高的时候甚至超过30度。而我们的这个教室室内温度只在20到25度之间，很凉快。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/c0b48bb027ee6f71f78e23f8bf02ec0a.jpg)\n\n在冬天，新学校的室内气温也是紧跟着室外气温跑的，室外气温低到零下十几度，教室里面也达到零下十度。而我们这个教室的平均气温只在5摄氏度上下。\n\n大家注意，这5度指没有人的状态下。每个人人体在散热，每个小朋友散热的量相当于80瓦的电灯泡，而40个小朋友就是3200瓦，相当于两个电暖器。正因为这个土墙的保温性能非常好，所以它冬天完全不用烧煤。\n\n​\n\n后来我们这个项目获了一大堆国内外的专业大奖。其中有一个英国皇家建筑学会奖，是跟以上这些特别有名的咱们国内的项目一块儿获的。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/6c85388cd37f419d5d9246969241f012.jpg)\n\n大家看觉得可厉害了，但是，但是……所以还有后话。但是这个学校在建成之后的几年，因为太偏远就被撤销了，所以整个校舍空置下来。直到2010年，我在网上看到有一个记者专门到这个地方去采访，他拍了很多照片发在网上。这张照片是这个样子的。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/7d2159c91a891c1b315f9084e201e68f.jpg)\n\n正因为长期的空置使得很多原本的问题被放大，充分地暴露出来了。大家可以看到刚才很现代的地方，比如说那个墙头，它已经长满了草。尤其再下雨，很多墙皮都被冲掉了。\n\n​\n\n说明什么问题呢？说明在建造过程中我只是把很多传统的东西发掘出来、学习过来，直接用在了所谓的现代建筑这种设计当中，只是给它套了一个现代的形式，实际上我并没有从根本上去提升、去克服它原有的一些缺陷。\n\n​\n\n这是在2016年，学校被空置了一段时间之后，村民说我们可以把它重新用来做农家乐，所以他们专门做了修缮。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/4580cba0e373a28a8ed5cb6a7e7f1a46.jpg)\n\n你会看到原来防水不行的墙头被他们加了琉璃瓦，墙皮也被刷成了白色。当时我的学生看到说，哎呀，村民怎么做这么丑。只有我自己清楚，不应该怪村民，应该怪我自己。后来我慢慢在反思这个问题，实际上我们需要用客观的心态来去看待我们的传统。\n\n​\n\n比如说我们的传统生土建造技术，实际上它有大量的优点。比如土墙本身有呼吸的功能，它的室内空气质量往往比我们现在这种房子的空气质量要好，尤其它可以非常有效地平衡室内的湿度。这个图是德国人做的一个实验，他就把夯土的房子拿来跟混凝土房子比对。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/79aa1cd2f971adffabcf2286c99383db.jpg)\n\n我们都知道，尤其在南方，夏天潮湿，湿度甚至能达到100%，你会看到混凝土的房子上面都结了水。科学家做过一个测试，发现如果我把室内的相对湿度从50%提到80%，土墙能够吸收的水是混凝土吸收的50倍，它的墙体表面还是干的，而它的强度只下降了6%，所以非常厉害。\n\n​\n\n但是不可回避的，传统生土材料有两个致命的缺点。一个是它的材料力学性能不行，第二个它的耐水性能不行。\n\n大家都知道，在过去几场大的地震当中，比如说汶川地震，当地倒塌的房子当中有超过一半以上都是这些土房子。也正因为它有这些缺陷，在过去几十年间，当人们一说土房子都说是危房，所以长期以来人们慢慢地把这些土房子当成贫困落后的象征了。\n\n​\n\n当时在做毛寺小学的时候，我的导师吴恩融教授也发起了一个很有意思的项目，就是帮这个村子设计建造了一座小桥，后来这座小桥引起社会很多的关注。也在香港纪文凤小姐的大力推动之下，我们成立了一个慈善基金，专门发动香港跟内地的大学生深入到贫困农村地区，去帮当地的村民做扶贫的建设工作。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/67eee04b92f634c990fb9b9e7de944bb.jpg)\n\n基金会成立之后的第二年，汶川地震发生。当时凉山彝族妇女儿童发展中心的侯远高老师给我打电话说，有一个村子就在会理，是被一条大河给阻隔了，上面只有一座独木桥，想请你们过来看看能不能帮村民做些什么。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/27bdb244f0a7b3f8b169102bd42b4119.jpg)\n\n后来我们到了这里之后，看到村里面是这样一个景象：房子是西南地区非常典型的人畜共居的夯土合院，在地震过程中很多房子都倒塌了，或者严重坏损。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/a53acae055ba89b09a683a3d068d65ee.jpg)\n\n可是这个村子非常贫困，在当时，一年人均收入只有1000块钱，而震后所有的材料价格翻倍地增长，他们根本买不起。即便能买得起，怎么运到村里来？即便能运进来，原来那些房屋大量的废墟往哪里倾倒？\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/8efa33d46342cdfd0052abea2d49cb82.jpg)\n\n后来我们发现其实这些还不是最大的挑战，最大的挑战是什么呢？我们后来发现，这个村子里竟然超过70%的村民只识得很少的字，甚至有些村民连自己的名字都写得不太顺。在这种情况下，即便你有一些好的办法，你如何教给他们，这其实是最大的挑战。\n\n​\n\n所以在当时我就在想，面对这么多挑战，实际上对比下来，他们最为熟悉的、基本上很多男性村民都会用的夯土，可能还是最适宜的一个解决办法。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/b951e8b4325a1d0d1f89ab54a31475da.jpg)\n\n正因为之前那个学校的一些惨痛的经验和教训，让我意识到我们不能直接地运用那些技术，一定要想办法去改良它、提升它，让它变得更加抗震。但我是个建筑师，我是搞建筑设计的，不懂结构。所以我当时专门托朋友到处打听，终于找到了我现在的好搭档，这位憨态可掬的周铁钢教授。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/e27feb34b05b83c0691651e8a6c393f0.jpg)\n\n其实在那之前，周铁钢在新疆就做了大量生土抗震房的试验和推广，非常有建树。当时我们俩真是相见恨晚，因为在那个年代搞生土的人都是孤独的。我们在村子的周边地区也做了大量的调查。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/0e8e05ca8a7da0ea3eaaa3170a33098d.jpg)\n\n发现一个非常重要的现象，就是那些倒塌的房子绝大多数都是在近几十年新建的土房。而很多过去50年之前、70年之前、甚至80年之前的那些老房子，实际上倒塌的并不多，很多只是一些轻微的坏损。\n\n​\n\n我们都知道，西南地区自古以来都是地震多发带，而这些传统建造技术到今天还在被使用，它一定有一些办法来抵御地震这件事情。可是当我们看这些新建的房子里面，实际上基本上没什么抗震的措施，甚至村民还把这个房子建得更高更大、显得更气派。所以就像我们周老师说的，这些倒塌的房子不倒才奇怪呢。\n\n​\n\n后来周老师也基于这些调查的成果，尤其根据现代的抗震理论，对当地这些传统民居的结构进行了一个系统地梳理和完善，同时也把它原有的那些建造工具还有建造流程进行了规范和改良。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/66e743295f54c4fd29ce4ced119cfc6c.jpg)\n\n比如说像这个：\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/eeda5a4564b169ccce9f062700d82cf0.jpg)\n\n我们都知道在长城里面能看到很多这种竹子，它就相当于我们今天钢筋的作用，它是抗拉的。实际上很便宜，因为这就是村里面长的竹子，我们直接就用在里面了，它可以非常有效地提升房屋的抗震性能。\n\n​\n\n后来我们把这些经验全部做了一些整理，让村民每家每户出一个劳动力来给一个困难户盖房子。在这个过程中，周老师的研究生就住在这个村里，跟村民同吃同住，一起把这个示范房盖成。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/61c227d225fbd0d27cfad4666bd1e77a.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/180b096078b1d1e6d7da90407f9359fa.jpg)\n\n因为村民都具有非常丰富的夯土经验，所以你给他稍微点拨，告诉他什么事情必须得做，什么事情不能做，他也很快就学会了。所以后来他们累计只用了几个月，就把村里面的房子都重建完成了。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/a30ea4fdb7cd99d93a4985ff4b2fbff9.jpg)\n\n村民整个盖房子的过程，实际上90%的材料都是可以利用的本地的震后废墟，其实就是村里长的竹子、芦苇这些自然材料。每家每户只需要买少量的水泥、熟石灰，来做基础的防水这些就可以了。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/7ddafc62477b73f18c1c8a0566a54f81.jpg)\n\n同时那个村里面有非常好的传统：谁家盖房子都邻里互助，每一户只需要雇那么一两个木匠就能把这个房子盖了。\n\n最后根据我们统计，村民们新盖的房子平均造价只有150块钱/平米。而震后因为很多常规的技术都很贵，周围地区造价达到了1500块钱/平米，所以相当于那些房子的十分之一。最便宜的一户房子才多少钱呢，只有75块钱/平米，因为这一户的户主就是个木匠。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/f72f9279753b27b1352b5491bb969378.jpg)\n\n当时这个项目做完我也就博士答辩。答辩完我突然有一天看到香港中文大学的橱窗里有一个小小的海报，是说在奥地利有一个生土建造的工作营。它的带队老师是我仰慕已久的Martin Rauch，我把他誉为生土建筑界的神，因为是他让生土建筑进入到现代建造的领域。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/bdd11d1866ae5a2c29bdd8c2ba44afc9.jpg)\n\n我很激动，然后就申请去参加。当时无止桥基金就专门来资助我去参加那个工作营，那是我第一次真正见识到欧洲非常先进的生土建造技术。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/116115377cc1395d004245a0df4b1240.jpg)\n\n实际上在40年前，当很多科学家在研究绿色建筑的时候，在欧美也有很多建筑师和研究者在研究生土建筑。他们认为生土建筑是非常绿色的一种建造路径。\n\n​\n\n在这里面领军的研究机构是法国国际生土建筑中心，他们在很早以前就通过大量的实验形成了一个非常重要的理论。我们都知道，混凝土里面是砂子、石子儿、水泥，在这里面砂子、石子儿是骨料，水泥是起真正粘接作用的。\n\n​\n\n而如果我们把一块土挖出来，然后做筛分实验，会发现粒径从大到小是由什么构成呢？由石子儿、砂子、粉粒再到黏粒。黏粒是直径小于0.002毫米的细小的颗粒，它才是在这个里面起真正粘接作用的东西，其他都是骨料，所以跟混凝土的构成非常相近。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/0eb72ae690564fdcb303770784aab987.jpg)\n\n如果说我们在任何一块土里面根据它现有的构成，适当地添入一些砂子、石子儿，让它达到一个特定的比例，然后再给予高强度的夯击，它就可以形成一个非常密实的聚合物，石子儿中间是砂子，砂子中间是粉粒，然后整个这些骨料都是由黏粒来进行粘接。\n\n​\n\n根据我们现在的实验发现，经过这样一个高强度夯击之后，它的抗压强度已经跟普通的砖墙非常接近。而它因为很好的密实度，使得表面的防水性能也得到了极大的提升。在这样一个理论的支持下，过去几十年间在全世界做了很多大量的这种现代建筑的实践。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/af2ac77046ac84a1e469e2bba04cd2f2.jpg)\n\n这个就是Martin Rauch自己给自己盖的房子，非常现代。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/3a47d6626e4cf47e184c37de6b906486.jpg)\n\n这个厨房稍微有点特别，我们都知道土是怕这些油渍的东西，一旦粘上你得把它刮掉，可是不要紧，我们可以撑块玻璃，既可以看见土墙的漂亮的纹理，又可以解决实际的问题。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/851e6747ac29ee79806642ce379a08c2.jpg)\n\n这是Martin Rauch施工建造完成在柏林的一个小礼拜堂。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/b30059075b9556d3dc5e493a8e5e14e4.jpg)\n\n还有美国一位著名建筑师叫瑞克·乔伊，专门在沙漠做这种公共建筑，还有一些别墅，都是用生土做的。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/0b22cf36b2fbff66818f37c478f0c7cb.jpg)\n\n还有伊朗这些清真寺。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/e525936552a182d8c8430a2ecf70c767.jpg)\n\n这是奥地利一个中心医院。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/d5321a8853f769e4186289509f227f4c.jpg)\n\n这家医院它就利用了生土特有的蓄热性能，做了这样一个阳光廊。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/88774dba820f5a2bd1e69b91883968fa.jpg)\n\n白天太阳晒，土墙就不停地吸热，使得廊内其实并不太热。等到晚上周围温度降下来之后，这个土墙就开始慢慢散热了，使得廊里面的温度也并不是特别凉，这是一个非常经典的案例。\n\n还有在斯坦福大学，这也是刚刚落成的冥想中心，也是拿夯土来建造的。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/b4e5b596e6ca8ef5e87d046cd5338245.jpg)\n\n尤其Martin Rauch现在很厉害了，他现在都可以用这种预制的方式来做夯土，等干了以后运到现场把它吊装安装完成，可以做非常大型的公共建筑。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/35390be822a63a35b0ef5275ec7869e6.jpg)\n\n2011年，我在法国做完报告的时候，法国人挺感慨，因为在此之前他们对中国的生土了解比较有限，只知道土楼和窑洞。所以他们当时说，我们可以全力支持你们继续做系统的研究。所以当我回来之后，就在无止桥基金和住建部的支持下又回到了黄土高原，要在这里继续做一个系统的研究。\n\n​\n\n当时就在甘肃的会宁，一个叫马岔村的小山村为基地来开展系统研究。法国人特别好，先后派了好几名刚毕业的研究生来专门教我们如何去定量地分析这些土，来教一些基本的理论。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/2c1d0042c87a7c00f55bbc2012eec0b8.jpg)\n\n当时也清醒地意识到，我们在欧美看到的那些很先进的夯土建造技术，实际上都是建立在当地非常发达的工业体系上，是很难直接把它引入到我们内地农村的。\n\n在这种情况下，我们要面临很多这种本土化、在地化的挑战，其中第一个就是机具系统，因为我看到大量的尤其是气动夯锤，我在国内都没见过。我说老外在哪儿找的呀，我就在英文的阿里巴巴上搜，后来发现，哇，一堆供应商，再一看，都是中国产的。所以我特别感谢马云让我找到了所有的东西，而且比国外便宜好多。第一个问题解决了。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/d156d884e0b6274d7f6f801ead9b8c1f.jpg)\n\n第二个，正因为用了很大力的气动夯锤，传统的这些模板根本顶不住这些冲击力，即便是混凝土浇筑的钢模板也顶不住。\n\n​\n\n传统的夯土夯房子都是夯完这边再夯那边，很多转角和交接的地方一到地震的时候很容易就闪出去了，所以需要让这些墙体交接的地方整体一次性夯筑。所以后来我们专门利用每个县都能买到的最常规的这些竹胶板和型钢来设计了一套简单的模板。村民可以自由地拼装，可以一次夯击一字型的墙、T型的墙、L型的墙。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/ded90484bed16d00c92f5157a27d58e8.jpg)\n\n解决了这个问题之后，我们实际上最大的挑战是什么呢？因为我们看到了欧洲很多做生土的地方实际上很少有地震。所以我问老外朋友，你们怎么解决这个抗震构造，他说我们很少考虑这个事情。\n\n​\n\n可是我们不一样。所以周老师就做了大量的系统实验研究，然后形成了一个非常简单容易操作的抗震结构体系。后来这个体系也经过震动台实验，证实它可以满足8.5度地震设防烈度的需要。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/a08f309eba230bf9cbcb66c7bfff35f9.jpg)\n\n万事俱备，后来我们就发动村里面专门夯土的工匠，形成了一支施工队，来帮一户困难户盖了一个示范房。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/3dde6788be893571cae3093cf1072033.jpg)\n\n盖示范房过程中，我的三个学生刚好在做毕业设计，就把这个房子当作他们的设计对象，在村里面待了几个月。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/8026232fcf280bcca315cb7af86f6564.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/9f472ad8a620ef1fec3a9dc200da7fd3.jpg)\n\n这个房子可以说是新型夯土第一次进入中国的乡村，所以我们非常地忐忑。尤其大家可以看到建成是这个样子，实际上并不好看。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/c3a0f25731ae353b8c8d2c8e3ff5c2d1.jpg)\n\n为什么呢？我真的很担心它会贵，所以我尽可能让村民用他们常规的、传统的形式、传统的方式去建造它。后来这个造价，相当于我们所有的材料是花钱买的，所有的人工也是花钱的，它的造价只有平均650块钱一平米。\n\n​\n\n最开始时，村民对于新型夯土的质量没有概念，恰好有一处的墙放线放错了只能拆掉，于是4个村民费了九牛二虎之力，用了大半天时间才把墙拆下来，他们由此才真正信服这土墙有多结实。\n\n​\n\n村民学会了，他们就自己开始盖房子。后来他们也是通过这种帮工的方式盖下来，一平米只有320块钱，很便宜。后来在住建部的推动下，我们先后在很多地区都做了这种示范和推广。\n\n比如说甘肃的定西。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/64b17ead5ede69cb15f5028a412e2de3.jpg)\n\n江西赣州 。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/f69b8043d791b98ca9c4a558d39bd6af.jpg)\n\n新疆的喀什。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/6e727e8bcd43fe233dd7a5bbf514837f.jpg)\n\n贵州的威宁。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/cd2bf0ea7871271c706379deb9a9144d.jpg)\n\n还有包括最近我们在湖北的十堰也做了这些。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/667665d98bd6738757b245baae902a00.jpg)\n\n可以说，在很多地区已经盖了将近200座房子。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/585934084e92c1e8753c0afe9ae5a680.jpg)\n\n听着好像很厉害，但是每次我们问村民这个房子怎么样的时候，他们都会说，这个房子是挺好的，又舒服，看着又结实又便宜，可就还是个土的。\n\n​\n\n所以有些时候当我们在做示范房的时候告诉他们，这个墙面可以耐水，一般的雨水拍打都没有问题的，你不用做任何的装饰。可是我们前脚走，后脚这个房子就变成这样了，贴上了瓷砖，刷上了白，生怕别人知道这是个土。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/e483a0f92a2e409b7b22fc666b739647.jpg)\n\n所以后来我们就想，不行，我们一定要把它设计得更加现代，让他们知道土也可以做成很现代的样子。所以后来我们在马岔村就给他们设计捐建了一个村民活动中心，盖成以后是这个样子。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/336b2ef58cc5aab57edecad4681e7b57.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/9d23cdb7fc28af3a0f9a57faad44beee.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/42ec3088a49910e87343d0d6fa5e5cd3.jpg)\n\n在这里面因为很多技术是新的，我们也在不断地尝试怎么来让这个东西变得现代，去尝试不同的语言，甚至一些有趣的东西。比如说小圆窗，就是给小朋友的。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/3068622839b894e2f23d4f95bfb2ece7.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/df4bf1511f5adfcfd90ec6e853924f2f.jpg)\n\n还有一些不同颜色的搭配。包括这个，这个是很玄妙的，好多老外都觉得好奇怪，很多透明的东西夯进去了。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/98f9b9e59ffcdbdffd60845d80efd792.jpg)\n\n在2016年，这个中心就建成了，可是在快落成之前，我在现场的研究生就发了一个这样子的朋友圈。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/b3e4e167de5ad77ac93f754b500ffcc4.jpg)\n\n他说有几个村里面的大妈坐在这儿晒太阳，然后问我的研究生说，这个房子漂亮得很，你们什么时候贴瓷砖呢。所以我们觉得实际上路还很长。\n\n​\n\n其实这些年我们也深刻地意识到一个问题，就是说我们不停地在帮这些贫困的人们盖房子，但是当他有一天他变得有钱了，他再盖房子的时候，我们真的不太相信他还会用这个方式去做，因为贫困落后的象征在他们心目中是根深蒂固的。尤其是他们已经形成了城里的就是好的这样一个心态。\n\n​\n\n所以说近几年，我们同时在做两件事情，一方面我们想办法用非常高性价比的方式去帮这些贫困的村民盖房子；同时我们也在尝试着把很多新的成果运用到日常的这些现代建筑设计当中。\n\n尤其我们希望通过这种方式，用这种市场化的方式，让它真正地进入我们现代建筑的领域，找到一个办法能够让它满足我们今天对美的追求。我们相信等到做到一定深度之后，它一定会反过来对村民是一个最好的示范和影响。\n\n​\n\n后来在2014年、2015年的时候，我们很幸运，在西安万科的一个楼盘做了一个景观墙，就用夯土做的。大家看到了，看着很现代的样子，同时也还能透出很传统的味道。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/aa7d883d99c80b1c0abc60c62c469022.jpg)\n\n这最近在永定土楼旁边做的文化中心，也快竣工了。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/fddf28c35a35a5c843856b152e2bbf19.jpg)\n\n还有最近的一个大家伙，这是跟同济大学李立教授合作的，是洛阳二里头的国家级博物馆，4万平米，整个用夯土来做，估计建成以后应该是全世界最大的生土建筑。最近刚刚开始动工。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/c40a6317e73d9534a4dca55358abd956.jpg)\n\n如果我们回过头来回望过去这十几年，我还记得当时我在村里的时候经常被问得最多的一个问题，就是你为什么要做土房子。后来在2014年，我们出了第一本书，就是在讲新的夯土怎么做之后，我被问到的越来越多是如何来做这个土房子，尤其现在我可能每个星期都会接到这样一个电话。\n\n​\n\n所以说我们赶上了一个非常好的时代，我们的大众、包括政府，越来越关注我们的传统，越来越关注我们的文化传承。说到这儿，有一个近两年最高频的词就叫传承。如果我们细细再一想，到底什么是传承，到底要传承什么，是那个建筑的形式，是那个所谓看不见的文化，还是那些装饰，还是那些小符号呢？我想可能很难用一句话来讲清楚。\n\n​\n\n我最后提一个小故事，大家还记得我前面提到了吴恩融教授发起的一个建桥的项目，因为村子里面原本这条河上只有这样一座独木桥。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/cb7f28e3258fd90892047652f06d7dc2.jpg)\n\n可是因为当时我们都没有人搞桥梁设计，都不懂，所以吴恩融教授专门去英国拜访了他曾经的导师Anthony Hunt。他被誉为全世界最有名的结构大师，他做了很多非常有名的桥，都是几十亿欧元的这种。\n\n老爷子很高兴，他觉得这个项目很有意思，就专门勾了这样一个很聪明的设计。吴教授回来一做预算，哇，300万。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/06d0915321da65c55daf8cb59be83fb0.jpg)\n\n后来吴教授没办法，又飞回到英国又见老爷子，老爷子说，这可是我做过最便宜的设计了。\n\n吴教授很无奈，说你看吧，当地的村民都建着这样的独木桥，他们很穷的。老爷子看到这些照片沉思了半天，后来对吴教授说，你不应该来找我，你们最好的老师实际上就是村民，你们好好看看他们那个独木桥。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/ae0d958287a87418954f7f411a14d2c3.jpg)\n\n后来我们仔细研究了他们这座独木桥。大家可以看到，每年汛期之后水位降下来，村民们都把秋天已经收成过的剩下的玉米秆草全部拿起来编织成筐。因为河床都是基岩，很结实，所以把这个筐放在水里，再把石头栽在筐里，这个桥墩就修好了。同时再找一些树干，把这个树干放到桥墩上，这个桥就修好了。\n\n​\n\n等到来年5月份汛期来临之前，因为树干对他们来说是很贵的东西，他们就把树干收走，让洪水来吧。所以整个这样一个逻辑非常聪明，非常地简单。\n\n​\n\n后来我们就用同样的原理，用网箱做桥墩。做河堤的镀锌网箱耐久性很好，我们还是一样编成一个筐，然后里面加上石头，学他们，然后放到河床上，这个桥墩就修好了。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/85e363a6119ac193edab40d2fa88df25.jpg)\n\n同时我们再用非常耐久的镀锌的钢做成钢架，放在桥墩上，然后这个桥就修好了。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/b390ca405e1a8062bfd51dada099da6b.jpg)\n\n所以即便是一年就那么一两回的洪水来，把这个桥梁板冲到旁边，它也只是沉在旁边。等洪水一过，村民把它抬上来，这个桥就修好了。这就是村民的智慧嘛。\n\n​\n\n所以当我们在最后来重新审视我们的传统，来说传承这件事的时候，我们必须得要回头来好好看看，我们现在能看得到的传统是如何形成的。\n\n我们都知道，今天看到的各个地方的这些传统民居，它是在过去那个历史时间段，当地的自然条件，人们的建房子的能力，还有人们的需求，这三种要素共同作用下形成的。\n\n​\n\n如果我们今天要说传承，传承什么呢？实际上我们恰恰就要传承过去的人们如何来对待人们的需求，如何来对待人自身具有的能力，尤其是怎么对待本地的这些自然资源，如何来利用它。这些价值观、这些智慧才是我们今天特别需要传承的。\n\n​\n\n在这里面特别需要强调的有两点，实际上在过去这些所有的技术都是在不断地动态发展的，它都是因为人们的需求在变化，人们的能力在提升，所以说适宜性技术的发展，才是我们真正传统民居、传统建筑文化传承的一个根本的基石。\n\n​\n\n同时大家也都知道，各个地方的自然条件、人们的需求，都是因人因地而异的。建房的技术方案绝对不是说一招打遍天下，它一定是多元的，一定是因地制宜的。\n\n​\n\n在这样一个情况下，我们能朦朦胧胧大概知道我们要传承的时候，可能最大的挑战是什么，实际上是在于我们到底如何来传，到底谁来承。\n\n​\n\n去年9月份的时候，刚好无止桥慈善基金10周年，我们总结了一下过去的10年，在北京建筑大学校园里面举办了一次生土建筑展，据说这也是中国第一次以生土建筑为主题的展览。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/7bd46f25e28186d9b4f1a52305912d0e.jpg)\n\n在这个过程中，我们给大家呈现了很多我们的传统是什么，以及我们可以用土做什么漂亮的东西。\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/33b4e986f0810e59baa55580799212dd.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/27e847a9660811d8c4c6cd686500f270.jpg)\n\n尤其这个，我们的镇展之宝。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/e9c2a587a2cc57c9d6eb9f79256e165b.jpg)\n\n因为过去10年我们在各个地方做这些土房子，采集了大量不同地方的土。后来我们把它放在一起发现，哇，颜色非常漂亮。大家知道这就是中国。\n\n​\n\n我们也是充分利用各个地方不同颜色漂亮的土，可以用它做这些小的很漂亮的东西，很多工艺品，甚至包括室内装修，以及我们都可以用到的东西。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/4cd8ef141fe4aed011618c791843b5c4.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/3d897b9e49cd552a633266dac07116a1.jpg)\n\n在整个这个过程中，我们举办了一次为期两个月的工作营，30多个学生在一起，实际上是由学生来做很多东西。我们教给他们一些新的方法，然后让他们去发挥他们的创造力。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/8ae95abe6895071a27b702c64debdeb1.jpg)![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/a07b3a43d86f688d51038396a793ed1f.jpg)\n\n我们都知道人的兴趣很多时候是来源于成就感，如果我们对下一代说，我们的传统非常好，非常有智慧，可是他们不知道拿来该怎么用，用一下发现还不好用，那我相信这个兴趣是不可能持续的。\n\n​\n\n![](https://r.sinaimg.cn/large/tc/mmbiz_qpic_cn/a480eb00d2c5a5cc10db03adfc5c4c34.jpg)\n\n所以我们这一代人可能要肩负一个责任，一方面是要把这些传统挖掘出来，同时还要根据我们今天的科技来进行适当地改良，让它能够真正地满足今天人们的需求。只有通过这样的方式，我们用这些成果给年轻一代创造一个空间、创造一个平台，使得他们一方面可以真正感动于我们传统智慧的博大精深；同时可以依据他们现有的能力，利用我们的成果来去创造属于他们今天的那个成就感。我想这样的一个过程可能才是我们传承的一个根本的动力。\n\n​\n\n好的，谢谢大家。"
		},
		{
			"post_id": 19,
			"title": "互联网大会落幕 顶级饭局泡汤",
			"date_published": 1541945035.79,
			"body": "中国官方推出的第五届世界互联网大会9日落幕，与以往相比，此次会议格外冷清，不仅重量级官员没有出席，科技公司高管也几乎全部缺席， “顶级饭局”与“东兴会”更是全部泡汤。\n\n**海外科技高管几乎缺席**\n\n本届大会于11月7至9日在浙江乌镇召开，官方号称有来自全球76个国家和地区的政府代表、国际组织负责人、互联网企业领军人物出席大会，但英国《金融时报》报导，在众多海外科技公司中，只有芯片制造商高通公司的首席执行官史蒂夫•莫伦科夫（Steve Mollenkopf）出席在开幕式。\n\n往年中国曾大举炒作的苹果首席执行官库克（Tim Cook）、谷歌首席执行官皮查伊（Sundar Pichai）等硅谷高管均未出席。\n\n有分析指出，原因是目前正处于中美贸易冲突之际，没有人愿意为中共“站台”。\n\n不仅如此，国内世界互联网大会发起者、曾被称作中国互联网守门人的国家网信办原主任鲁炜、京东董事局主席刘强东也集体缺席。\n\n虽然阿里巴巴董事局主席马云于6日下午参加了互联网大会组委会第二届高级别专家咨询委员会（简称：高谘委）2018年度会议，但整个行程也非常低调。马云出席的这次小规模会议并未见大陆报导。\n\n这意味着，众多缺席者和官方对此次大会的规格予以降格，此次互联网大会给外界的整体印象颇为低调、冷清。\n\n**“顶级饭局”与“东兴会”消失**\n\n去年互联网大会期间“顶级饭局”与“东兴会”一度成为热门话题。不过今年形势似乎大相迳庭。\n\n2017年12月3日晚间，浙江省乌镇的第四届世界互联网大会一开幕，有关乌镇饭局的照片就即刷爆大陆社交网络。照片显示，两间不大的屋子里，汇聚了众多中国互联网公司负责人，各家公司市值总和超过5万亿元人民币。\n\n包括网易董事局主席丁磊、搜狐董事长张朝阳、小米CEO雷军、百度总裁张亚勤、华为高级副总裁余承东、奇虎360公司董事长周鸿祎、微软全球执行副总裁沈向洋、联想CEO杨元庆、中国宽带资本基金董事长田溯宁、百度CEO李彦宏、腾讯CEO马化腾、京东CEO刘强东、爱奇艺CEO龚宇等20余名中国网际网络大佬。\n\n因此，去年的饭局又被称为“东半球价值最贵的饭局”。而京东创始人刘强东和美团CEO王兴也曾组饭局，号称“东兴会”。\n\n但在今年，“顶级饭局”不见登场，“东兴会”也因主人缺席而没有下文。\n\n一年间发生了什么？\n\n对于中国官方和中国互联网大佬们来说，2018年发生了不少事。\n\n自中美贸易战7月打响后，双方互相进行多轮加征关税，中方几乎到“弹尽粮绝”局面。\n\n而马云9月10日宣布将于2019年9月10日卸任阿里巴巴董事局主席；刘强东则在9月底意外传出在美国涉嫌性侵丑闻，至今在公众视野中消失多时。\n\n此外，去年在饭局上大佬们讨论的“新消费”、“互联网+”的说法，也渐渐从中国官员和企业家，更多的是对实体经济焦虑与不安。\n\n对于官方一度高度宣传的共享自行车、支付宝等互联网新代表，初步统计，仅仅在2017年一年中，中国大陆就有6家共享自行车公司“阵亡”，包括悟空自行车、町町自行车、酷骑自行车、3V bike、小蓝自行车、小鸣自行车。而支付宝更牵涉金融、经济、个资甚至人权等丑闻。\n\n官方出席会议级别降格\n\n今年11月7日第五届世界互联网大会开幕。中共中央政治局委员、中宣部部长黄坤明出席开幕式，外界发现，与前四届相比，此次出席会议的官员级别大规模“降格”。\n\n第一届世界互联网大会上，中国国务院总理李克强曾现身。\n\n第二至四届世界互联网大会均由中共政治局常委级别的官员出席，先前是刘云山，去年是王沪宁。"
		},
		{
			"post_id": 18,
			"title": "经典冷笑话--地大物博的中国",
			"date_published": 1540870330.555,
			"body": "　　某人穿越到大秦帝国。\n\n　　“里边请，请问客官是打尖还是住店?”\n\n　　“打尖!来碗西红柿鸡蛋面。”\n\n　　“抱歉，客官，面条要到宋朝才能成形呢。西红柿现在南美洲才有，明朝末年才传入中土。小店目前只有鸡蛋，要不您点一个?”\n\n　　“什么鸟店!连碗面都没有，馒头包子总有吧?上一屉!”\n\n　　“这位爷，也没有。馒头包子得等到诸葛丞相讨伐孟获的时候才有，抱歉了您呢。”\n\n　　“擦!你们不会只供应白米饭吧?”\n\n　　“瞧你说的。咱是在关中，水稻原产亚热带，得翻过秦岭才能种，咱也没有。”\n\n　　“要死了!那就来个大侠套餐吧，半斤女儿红，二斤熟牛肉……你捂我嘴干嘛?”\n\n　　“客官，小点声!官府严禁私宰耕牛，被人告了可是充军流放的大罪，万万不敢啊!再说女儿红是吴越才有，咱是在关中!”\n\n　　“得得得，酒我也不喝了，茶水总有吧?”\n\n　　“茶?那玩意儿到汉朝才有，哪怕到唐朝也是士大夫喝的，咱也不可能有。”\n\n　　“干!那就不吃饭了，来根煮玉米吧!看电视剧大秦帝国里不是有玉米地吗?”\n\n　　“那是导演瞎拍。玉米现在还在墨西哥呢，要等明朝末年才传入中国。”\n\n　　“那上点水果吧。大热天的，来半个西瓜。”\n\n　　“呃，西瓜是非洲特产，要到北宋末年，才从契丹传到汉地……”\n\n　　“没有西瓜，苹果总有吧?”\n\n　　“真抱歉，西洋苹果十九世纪才从欧洲传入中国。客官，您别点水果了，我可以负责任地告诉您，像什么葡萄啦，芒果啦，石榴啦，草莓啦，菠萝啦……您现在都吃不到。”\n\n　　“你他娘的店里到底有什么?”\n\n　　“粟米的窝窝饼，您蘸肉酱吃，我还可以给您上一份烫白菜。”\n\n　　“敢情你开的是麻辣烫啊?”\n\n　　“瞧您说的，辣椒到明代才引进呢，我想开麻辣烫也开不成啊!”\n\n　　“没有辣椒，用大蒜代替也行。”\n\n　　“真不好意思，大蒜的种子是西汉张骞出使西域后带回来的。小店只有花椒，只麻不辣。”\n\n　　“那你就不能炒个青菜?非要开水烫白菜?”\n\n　　“您有所不知，铁锅到宋朝后期才能生产，所以没法炒菜。况且炒菜要用菜油，菜油得等到明朝后期普遍种植油菜花以后才有。”\n\n　　“好吧，其实你们可以用花生油……”\n\n　　“花生现在还在美洲，哥伦布发现新大陆以后才开始传播。直到乾隆末年，花生都还十分罕见。”\n\n　　“那就来份烫白菜吧，多加点香菜。”\n\n　　“嘿嘿，香菜原产地中海，张骞出使西域后……”\n\n　　“去你大爷的!我真恨不能一黄瓜拍死你!”\n\n　　“黄瓜?黄瓜原产印度，也是张骞出使西域带回来的。”\n\n　　“没有黄瓜，我就用茄子捅死你!”\n\n　　“嘻嘻，茄子来自东南亚，晋朝时传入中国的。隋炀帝就特别爱吃……”\n\n　　“客官您还要什么?……”\n\n　　“喂，客官……客官您别走啊!\n\n　　这则笑话虽然很冷，但告诉你很多历史知识!"
		},
		{
			"post_id": 17,
			"title": "胡总的脑回路太过清奇，无聊之下给他回五个“呵呵”！",
			"date_published": 1540819053.904,
			"body": "**@作家王湛：胡总的脑回路太过清奇，无聊之下给他回五个“呵呵”！\n其一，安培刚刚到中国才一天，这就拱火让日本转头怼美国，知道什么叫疏不间亲吗？美日是什么关系？同盟。中日是什么关系？门背后找找你那根抵制日货的小红旗。中国古话说：卑不谋尊，疏不间亲。以疏间亲，以远疏近，最讨人嫌弃，在古代皇帝雷霆震怒，是其罪当诛滴，呵呵\n其二，美国军事占领日本是二战后的国际秩序，它有一系列的国际公约为法律依据。给日本一百个胆，问问它敢不敢挑战当今的国际秩序？在中国人眼里美国是纸老虎，在日本人眼里美国就也是纸老虎？呵呵\n其三，美军占领日本前，日本是什么国家？害人害己的军国主义。美军占领日本后，日本是什么国家？文明发达世界第一。胡总以为日本人都是傻逼要去怼美国？呵呵\n其四，美国不是普通的占领日本，两国是最紧密的军事同盟，在美国的羽翼保护下，日本可以节省大量的军事开支，专心致志发展经济，为国民谋福利，而且两国经济贸易密不可分地交织在一起，日本成为美国最大的投资国，在美国谋取巨额经济利益，它难道不知道怼美国就是怼它自己？呵呵\n其五，且不说两国经贸和价值观相一致根本不可能怼，便是真要怼起来，赶美国走，日本自己便不得不发展起强大的军事力量来防卫自己。如果日本发展起强大的军力，且一夜之间成为核武大国，害怕的到底是军事占领的美国呢，还是它西边的邻居？呵呵！\n知道胡总最爱抖机灵，但你这话我们听听乐乐也就罢了，可千万别被日美听见了去。\n![](https://wx2.sinaimg.cn/mw690/534f96ddly1fwm4fqyyzcj20u01o0dv0.jpg) **\n​​​​​​​"
		},
		{
			"post_id": 16,
			"title": "原来这强大了你的国是世界上被援助最多的国家",
			"date_published": 1540803795.537,
			"body": "​​​​​​​\n\n　　据不完全统计，1979年-2003年， 中国接受的官方援助总额为1072亿美元。其中，援助额最多的是中国人骂得最狠的 痛恨的最厉害的日本，很多中国人对100左右前的侵略全部知道，而且还能编造出无数虚假的故事，而他们却对这么多年一直持续到今天的日本援助没有几个人知道。\n\n　　很多人说日本人援助中国是因为中国免除了日本的战争赔款——但是日本完全可以不援助你，你免除也罢，不免除也罢，他都可以不援助你。他完全可以不做的事，现在却做了，却帮助你了，这时候的你是不是应该感恩? 有傻逼说日本援助中国是为了从中国获取了更多的利益——我不知道这样说的人内心有没有作为人类的一点起码的感恩的心——你这种人扔到大街上狗都不吃! 你在最需要帮助的时候别人帮助了你，你却说他是为了自己的利益——你还是不是人了? 谁和你这样的东西做朋友谁倒霉。\n\n　　这么多年来，中国接受了那么多国际援助，中国老百姓却没有几个人知道，他们有点好处就要感谢党感谢政府，这让我想起一个事情，一个白内障朝鲜老太太贫苦多年，没有钱治疗，但在美国志愿者医生的免费治疗下，重见了光明，他第一句话就是：感谢金将军。 他找不到生病这么多年却看不起病的原因，他不知道免费给他看病的是美国的志愿者。在无数遍洗脑的情况下，他以为这是强大的朝鲜伟大的领袖让他重见了光明——这和某些中国人多么的相似?\n\n　　这段时间的疫苗事件，让很多人感慨说，现在社会不如以前了，因为以前我们小时候用的疫苗从来没有出过问题——他们也不知道，以前的疫苗很多是来自于日本援助，并不是你国产。他们感谢以前的国家政府，却不知道感谢日本人。同样，疫苗事件造成全国性的恶劣事件，而赔偿金大多只有二三十万，而国家对疫苗公司罚款是 90亿——多么讽刺，那些因为疫苗导致残疾的孩子一辈子就只有这二三十万，而政府拿走的却达到了90亿!!!\n\n　　你剥开了这强大了你的国的画皮，你会看到无数的丑陋——他们吹牛逼说芯片自主，一个中兴就让它原形毕露。吹牛逼说什么长江人才，大范围的被撤稿才知道是抄袭吹牛逼上去的，说什么千人计划，看来看去才知道是从美国挖人偷技术回来，说什么人民币国际化，放开操纵很有可能立马降到十以上，说什么美国离了中国活不下去，中国打个喷嚏美国经济都要受影响，一旦贸易战开打，立刻现出原形，吹牛逼股市六千才是起点，现在2400多点的股市还不能让你明白?\n\n　　当年晚清慈禧老佛爷时期，中国GDP也是全球排名前三位，老百姓生活如何呢? 慈禧晚清政府唯一不如现在政府的地方就是不会宣传，不会吹牛逼，如果会宣传会吹牛逼，他们的风采完全超过现在的政府，比如：\n\n　　亚洲首位的工厂，全世界最牛逼造船能力，第一个向全球宣战国家，养活了全世界最多人口的国家，统一了台湾，扩展了领土版图，新疆 西藏 蒙古都被收到版图之内，全球GDP一直保持在前三位，世界上第一个权势最高的女性 推行政治改革 ，创立江南制作总局，对外有西班牙援侨事件，让中国华人在世界上挺直了腰杆……\n\n　　当然，那时候没有长城防火墙，那时候民间可自由办报纸，让有识之士可中外对比，发现不足，而现在，你上个草榴网站都要翻墙都要用免翻，这可是100多年以后的中国!!!\n\n　　当年的清政府还是没有能够巩固权势，现在的政府能? 照现在这傻逼的统治，能比得上当年慈禧的手段?能比得了李鸿章的能力? 我看都不如吧。 乐观的看，他们能保持20年的时间，但有不少分析认为这位大撒比是末代之君。我高看它们一眼，我认为它会是倒数第二个。"
		},
		{
			"post_id": 15,
			"title": "[微博谈20181026] 这就是传说中的贱人",
			"date_published": 1540801243.556,
			"body": "#### [微博谈20181026] 这就是传说中的贱人\n\n（所有图片均来自网络）\n![](http://xoimg.club/u/20181028/10292770.jpg) \n![](http://xoimg.club/u/20181028/10293132.jpg) \n![](http://xoimg.club/u/20181028/10293354.jpg) \n![](http://xoimg.club/u/20181028/10293653.jpg) \n![](http://xoimg.club/u/20181028/10293879.jpg) \n![](http://xoimg.club/u/20181028/10294038.jpg) \n![](http://xoimg.club/u/20181028/10294285.jpg) \n![](http://xoimg.club/u/20181028/10294422.jpg) \n![](http://xoimg.club/u/20181028/10294939.jpg) \n![](http://xoimg.club/u/20181028/10295138.jpg)"
		},
		{
			"post_id": 14,
			"title": "崔永元的下一硬仗：方舟子的转基因和果壳网",
			"date_published": 1540115142.993,
			"body": "　　唯物论\n\n　　2018.10.07 14:42 转帖发表在 猫眼看人\n\n　　每一个伟大都是从嘲笑和质疑开始的，支持崔永元先生\n\n　　最近，大洋彼岸的美国一起官司引起国内媒关注。美国加利福尼亚州法院裁决：孟山都公司刻意“隐瞒草甘膦除草剂危害”，致一名美国园丁约翰逊罹患癌症，判决孟山都赔偿2.89亿美元。\n\n　　孟山都是全球最大的转基因种子公司，通过转基因种子实现对草甘膦除草剂的捆绑销售，世界上绝大部分转基因作物都是抗草甘膦转基因作物，所以，很多西方媒体又称草甘膦为“转基因伴侣”。\n\n　　美国法院判决的核心问题在于草甘膦的致癌性问题，而崔永元纪录片早在几年前就指出了这个问题：“转基因伴侣”草甘膦。\n\n　　吕永岩按语：转基因长时间采取鬼子进村偷偷摸摸的方式，这是因为转基因本身有鬼，他们害怕引起人们的关泛关注，想人不知鬼不觉地将转基因食物摆上人们的餐桌，这样他们就可以发转基因种子、配套农药等等的大财了。这是摇钱树一般滚滚持续的大财，他们为此红了眼。当然对于中国的敌人来说，转基因是摧毁中国必不可少的生物武器，这是毫无疑义的。崔永元作为中国人气顶尖的央视主持人，有“实话实说”的美誉，他参与反转，对于想偷偷摸摸布局转基因的人极为不利，如同有一股强大的主力军团要参战，敌人必然要极力阻击。所以才出现了方舟子以“文傻”“外行”“没有发言权”对崔永元的阻击。但“搬起石头砸自己的脚”是一个历史规律，这个规律谁也改变不了。方舟子等转基因利益集团在试图阻止崔永元的问题上，又一次搬起石头砸了自己的脚。崔永元的参战尤其是他赴美拍的揭露转基因危害的专题片，极大震撼和沉重打击了转基因利益集团，不但戳穿了他们的谎言，更让无数中国大众开始关注转基因问题，很多浑然不觉的人开始注意，麻木的人开始觉醒，战斗的人们受到鼓舞。转基因的实质是采用病毒和细菌“感染”的方式，向食用作物即人类食物甚至中药里持续插毒。它有一个最大特点是“不关注不知道，一关注吓一跳”。谁关注谁就会发现转基因有问题，越关注越发现转基因有猫腻。崔永元也是这样，也是越深入关注转基因，深入考察转基因，越发现转基因问题太多，鬼太大，大到不揭露不足以坦然面对中华民族，不揭露不足以坦然面对后人，不揭露不足以坦然面对自己的道德良心。推动转基因产业化的人，没有一个不是见利忘义，没有一个良心不是让狼吃了。现在，世界卫生组织和美国法院的判决终于让转基因及其伴侣草甘膦声名狼藉，终于佐证了崔永元的美国调查是无可诋毁的“实话实说”。转基因发端于美国，必定最先毁灭于欧洲，其次毁灭于美洲，最后毁灭于中国。这是因为中国存在顽固不化的转基因汉奸。但无论转基因汉奸怎样顽固，最后终究阻挡不住世界人民抵制转基因的潮流，终究阻挡不住转基因必定毁灭的历史趋势。无论转基因利益有多么诱人，转基因利益集团有多么强大，今天的人类决不允许给后人留下插毒食品，绝不会承担给后人留下查毒食品的罪名，这是必然的，必定的!任何力量都阻挡不住。\n\n　　X\n\n　　崔永元的纪录片、美国的大判决\n\n　　文| 金微\n\n　　五年前，崔永元赴美拍了一部转基因纪录片，这部纪录片争议较大，褒贬不一。\n\n　　五年过去了，世界在变，国人的认知也在变，回头看这部纪录片，又有新的发现。\n\n　　最近，大洋彼岸的美国一起官司引起国内媒关注。美国加利福尼亚州法院裁决：孟山都公司刻意“隐瞒草甘膦除草剂危害”，致一名美国园丁约翰逊罹患癌症，判决孟山都赔偿2.89亿美元。\n\n　　孟山都是全球最大的转基因种子公司，通过转基因种子实现对草甘膦除草剂的捆绑销售，世界上绝大部分转基因作物都是抗草甘膦转基因作物，所以，很多西方媒体又称草甘膦为“转基因伴侣”。\n\n　　美国法院判决的核心问题在于草甘膦的致癌性问题，而崔永元纪录片早在几年前就指出了这个问题：“转基因伴侣”草甘膦。\n\n　　时间回到五年前，央视知名主持人崔永元与方舟子的一次口舌之争走上反转之路，2013年9月8日，科普作家方舟子在媒体上公开表示：“应当创造条件让国人可以天天吃转基因食品”。崔永元回应说：“你可以选择吃，我可以选择不吃。”\n\n　　向来爱蹭名人热的方舟子对崔永元纠缠不休，以为又抓住了一个制造轰动新闻的人物。谁知，崔永元不吃他那一套科普，为了搞清转基因的问题，他辞了央视主持人工作与方舟子斗，并远赴美国调查转基因。\n\n　　事情过去五年，崔永元2013年底摄制的转基因纪录片中，到底说了些什么?崔永元在这个纪录片里采访了美国有关方面的专家以及正在商店购物的一些普通顾客，主要是对转基因安全性提出质疑。\n\n　　纪录片中，一位叫南茜?斯万森的大学教授，展示了所谓“草甘膦使用量和疾病高相关性”的关系图，南茜?斯万森在接受采访时说草甘膦使用量和一些疾病呈现显著的正相关，其相关系数可达0.96以上，并暗示了草甘膦是导致这些疾病的元凶。纪录片多次提到草甘膦和转基因作物的食品安全性问题。\n\n　　正是因为这一点，国内自称科普机构的果壳网对此大加批判，他们发表一篇《崔永元转基因纪录片中的科学错误》抓住斯万森报告“相关关系与因果关系”的问题称崔永元纪录片荒唐。\n\n　　后来，“果壳网”作了一个举动，将崔永元纪录片评为2014年“十大科技谣言”之首，理由是：相关性不代表因果性。说崔永元混淆了“相关性”和“因果性”而散布了转基因作物和草甘膦对人类健康有危害的“谣言”。\n\n　　由于果壳网标榜独立的科普组织，这个评选在各大主流媒体里广泛传播，在自媒体不太发达的时候，传统媒体依然是民众获取信息的主要渠道。这个谣言评选，自然对崔永元的声誉造成很大的影响，社会主流以此为据称崔永元不懂科学。\n\n　　时间到了2015年3月，世界卫生组织(WHO)的国际癌症研究中心在全世界权威的医学杂志《柳叶刀.肿瘤学卷》正式公布：草甘膦是2A类致癌物。称草甘膦农药可能会引发人类淋巴腺癌和肺癌。这是全世界科学界对草甘膦致癌最权威的科学结论。\n\n　　孟山都自然否认草甘膦会导致癌症，因为这是他们的命根子，他们称数十年的科学研究表明这种化学物质对人类使用是安全的。他们搬出一些组织机构如IPCS、CAG、GDWQ等曾经讨论过草甘膦，但这些机构根本没有任何一个将他们的结论像世卫组织的国际癌症研究中心那样发表在权威医学/科学期刊物上。\n\n　　2015年，美国加利福尼亚州环境健康危害评估局把草甘膦列为致癌物(相当于世卫组织的“1级”致癌物)。孟山都对这一决定极为不满，并于2016年起诉加利福尼亚州环境健康危害评估局及其局长劳伦•蔡斯，但在2017年3月败诉。\n\n　　2017年起，美国800多名癌症患者开始发起对孟山都的诉讼，称草甘膦除草剂使他们患癌，此后又有数百人以类似理由起诉孟山都，其中就包括这次美国法院判决2.89亿美元的患者约翰逊。判决的主要证据来自世界卫生组织下属国际癌症研究机构的结论等。\n\n　　很多人不理解，为什么崔永元阐述转基因相关问题时，要说草甘膦问题?因为草甘膦是孟山都公司的核心支柱产品，而转基因大豆正是转入抗草甘膦除草剂基因，达到抗草甘膦除草剂的目的。\n\n　　也就是说，草甘膦与转基因农作物密切相关，两者是互相依存的一对，没有抗草甘膦转基因农作物，就无法在农田里使用除草剂，没有草甘膦除草剂，也就没有这么多转基因农作物。\n\n　　根据美国农业部统计数据，85%以上的转基因作物是抗草甘膦转基因作物。孟山都正是通过“捆绑转基因种子与草甘膦销售，通过专利权获得大量利润。\n\n　　2013年的时候，崔永元采访的海外科学人士虽然掌握了最新的转基因领域资讯，但他们并不十分清楚中国的状况，崔永元的纪录片则第一次将中国和美国的转基因消费市场信息沟通了起来，指出了中国大量进口的转基因大豆含有草甘膦问题，纪录片还大胆呈现草甘膦的问题，具超前性。\n\n　　但是，中国的果壳网、方舟子们为了混淆视听，就把崔永元揭示的这点打成了谣言，利用科学迷信、话语权垄断、信息不对称等蒙骗国人，把民众判断、舆论给带偏了。\n\n　　到了今天，草甘膦的危害问题，在世界卫生组织报告面前，无论如何洗地也是徒劳，因为不仅是科学报告，各国对草甘膦都采取了实际的行动。于是转基因利益集团又编造出另一个谎言：草甘膦与转基因作物无关。\n\n　　我们知道，转基因作物与草甘膦是一对。如果是非转基因大豆，因为他不抗草甘膦，只要草甘膦喷散到，必死。因此草甘膦必须躲开生长期的农作物来喷洒。而抗草甘膦的转基因作物设计出来的目的就是可以让草甘膦直接喷洒农作物从而残留是必然的。假如不直接喷洒草甘膦，那么这种转基因作物根本没有在地球上存在的必要了!\n\n　　事实也如此，国际权威期刊《食品化学》发表的论文里一幅一目了然的图表：对转基因大豆GM，有机大豆Organic 和普通大豆 conventional 的比较：红色和蓝色分别为转基因大豆中～ 草甘膦和氨甲基膦酸的残留程度，而在有机大豆(图表最左边)和普通大豆(图表中间)中， 草甘膦残留则探测不到。\n\n　　《食品化学杂志》上转基因大豆与非转的草甘膦残瘤对比\n\n　　果壳网等“科普”根本搞不懂草甘膦与转基因作物的关系，或者就是别有用心，他们说：相关性不代表因果性、草甘膦与转基因作物没关系!\n\n　　但无论是世界卫生组织，还是美国的大判决还是这些学术论文，都提到草甘膦转基因的关联性，也是进一步为崔永元的纪录片正名，也直接打脸“果壳网”的谣言评选。\n\n　　值得一提的是，2018年6月7日德国化学制药集团拜耳用660亿美元收购了孟山都，美国法院这一判决，让拜耳股票大跌10%，跌到五年来最低，多日后至今还没缓过来，“钱途”堪忧。\n\n　　在美国，另一个与约翰逊相似的案情诉讼已经开始：一位草甘膦致癌受害者农户经各种治疗无效而面临数年内死亡的威胁、希望法庭能尽早开庭审理。不仅如此，向孟山都发起起诉的案子已由5000个增加到目前的8000个。\n\n　　由于股价大跌，拜耳急了，公司对股东和投资者说：他们将采取上诉等措施来推翻美国加州法院的判决，积极应对所有可能的诉讼案件。\n\n　　当年，很多人不大理解崔永元反转基因，看不懂纪录片里说的草甘膦问题，使得崔永元这几年一直被误解，各种对他的攻击和毁誉不断，更可恶的是：果(壳网将其)打成十大谣言之首，被各路媒体围剿，被主流斥为谣言而不屑一顾，他们提到崔永元转基因话题甚至有一种优越感。真是笑话。利益集团最擅长的就是发动群众斗群众，给反对转基因人士扣一顶义和团、不懂科学的帽子，让支持的人士籍此建立所谓优越感。\n\n　　但五年来世界的变化，已充分说明纪录片的草甘膦问题的超前性，抓住了问题的本质和核心。无论是揭黑娱乐圈还是拍转基因纪录片，在我看来，崔永元就是这个时代里一直醒着的人。\n\n　　谚语有云：“为众人抱薪者，不可使其冻毙于风雪;为自由开路者，不可使其困顿于荆棘。”崔永元在转基因草甘膦问题上的超前性，也引起社会良知人士的警醒，旅美学者曹明华曾写过一篇《我曾跟随崔永元拍转基因纪录片，他无意中触及到一个巨大的国际利益集团》，为小崔打抱不平，但这个文章因为点名批评了力挺转基因人士李铁反而被他告上了广州番禺法庭，可见利益集团有多么强大。\n\n　　从来没有什么岁月静好，不过是有人为你负重前行罢了。\n\n　　那些攻击崔永元纪录片的个人，难道他们比世界卫生组织更有权威，比美国法院判决更权威?科普人士们真有能耐的话，让美国法院采用你们的科普说法去做判决，让拜耳公司用你们的科普去救市托住股价去，什么科普，他们的立场，早就一目了然了。\n\n　　https://mp.weixin.qq.com/s?__biz=MzIwOTE0OTM3MA==&mid=2650531010&idx=2&sn=89e0b6a1e9a30bd7266bff80c1117861&chksm=8f770817b8008101216634e47aee6833340090e65450a5c467722430e369997b2f60eb40296e&mpshare=1&scene=1&srcid=1003KoMWKqEvKGG4djr9Uarx#rd"
		},
		{
			"post_id": 13,
			"title": "白宫宣布退出万国邮联 中国包裹寄美将涨价",
			"date_published": 1539946332.539,
			"body": "　　美国白宫周三(10月17日)宣布，即日起启动退出万国邮政联盟(简称“邮联”，Universal Postal Union)的程序。此项宣布可能堵住或减少来自中国的假冒商品，中国电商将受到直接影响，中国寄美包裹价格会上涨。\n\n　　白宫表示，接下来的一年时间，若美国对国际邮联的邮费谈判不成功，美国将从2020年1月1日实施自己的终端收费标准。\n\n　　根据白宫声明，川普政府已收到美国国务院就8月23日总统签署邮递“终端费率”备忘录的报告回复，总统川普(特朗普)同意国务院的建议——基于9月万国邮联的新邮资协议未取得令美国满意的进展，美国将采用自行申报的终端费率，且不迟于2020年1月1日实施。\n\n　　美国政府宣布，即日起美国启动退出邮联的程序。根据万国邮联的规定，退出程序为期一年。白宫声明表示，在退出程序期间，美国国务院将通过双边或多边谈判来解决总统备忘录中讨论的问题。\n\n　　“如果谈判成功，川普政府会准备撤销‘退出通知’、并留在万国邮联。”声明中说。\n\n　　川普早先发出的备忘录要求确保“邮寄自国外的货物包裹不享有比国内包裹优惠的费率”。备忘录指，因受惠于人为压低补偿性费率，现行终端费用体系令世界各地小包裹流动情况受到扭曲，激励外国货品邮递至美国。\n\n　　《纽约时报》周三也报导说，川普退出的这项144年历史的邮政条约允许中国公司获得大幅打折、向美国运送小型包裹，这种优惠削弱了美国商家的优势，同时让廉价的中国产消费品充斥美国市场。\n\n　　中国输美电子商务将受直接影响\n\n　　外界预测，无论是美国从2020年1月1日执行邮政收费新规，或2019年10月17日之前美国通过谈判调整邮资成功、保留邮联席位，中国运往美国的小包裹运费成本都将上调，那些通过阿里巴巴或亚马逊出售商品的中国电商将受到直接影响。\n\n　　白宫贸易顾问纳瓦罗(Peter Navarro)9月在英国《金融时报》发表专栏文章说，“这些邮费差造成了电子商务市场的巨大扭曲。”\n\n　　国际邮费差让中国公司通过亚马逊或阿里巴巴等在线电商平台向美国消费者出售“仿冒”产品时，成本比美国境内邮寄正品还要低。\n\n　　据悉，美国邮政管理局(USPS)每运送一个从中国来的小包裹损失近1美元。而根据美国邮政管理局2014年的一份研究报告，每年美国对国际包裹的折扣额度高达21亿美元，而同时又对美国出口商的国际邮件征收远高于成本的费用。\n\n　　美国邮政管理局2015年的监察长报告更是指，从中国寄出的低成本包裹，比美国国内寄出的邮费低27%。财经博客ZeroHedge评论说，可以推断2015年时任总统奥巴马“无视”这份邮政管理局的报告。\n\n　　万国邮联的定价机制 富国为穷国买单\n\n　　造成国际邮费差的主要原因是万国邮联制定的国际邮资协议。作为协调各国邮政政策的联合国机构，万国邮联负责设定国际邮寄包裹费用。该机构目前共有192个成员，每四年修改一次政策并确定新的费率，每个国家持有相同的投票权(一人一票)，设定的运费标准则采用了差别定价。\n\n　　联邦快递的法规事务主任斯帕克斯(Nancy Sparks)表示，万国邮联的税率结构基本上是一个“富人替穷人买单”的系统：从贫国家发货到富国家时，消费者只需要支付较少的运费。他说：“比如从中国发(包裹)到美国，要比从美国将同样包裹发到中国便宜得多。”\n\n　　根据亚马逊全球政策副总裁米森纳(Paul Misener)的估算，一个一磅包裹从南卡罗来纳州运送到纽约市的成本近6美元，而从北京到纽约的同重量包裹只需3.66美元，但如果把这个包裹通过美国邮政国际邮件从纽约寄回北京，大概要花50美元左右。\n\n　　川普退出邮联决定 赢得美商界一致称赞\n\n　　而对川普退出万国邮联的决定，美商界一致称赞。财经博客ZeroHedge评论说，未看到一个政客或商业集团出来反对，亦无人抱怨川普是“打破规范”或“孤立主义”，甚至过去质疑川普对中国进口商品加征关税的行业团体也称赞说，川普这一举措合适、且有针对性。\n\n　　“这种过时的安排协助中国假冒商品和危险毒品大量涌入美国”，全美制造商协会(National Association of Manufacturers)首席执行官蒂蒙斯(Jay Timmons)表示。\n\n　　“对中国制定现代化和更公平的协定，将使美国制造商及制造业工人从中受益匪浅。”他说，“制造商很高兴看到川普政府把这个问题提到(解决的)最高水平。”\n\n　　美国全国制造业协会劳工、法律和监管政策副总裁赫德伦(Patrick Hedren)在随后发出的声明中说：“近年来，制造商一直在努力与迅速增长的假冒商品抗争，这些商品通过美国邮政系统从中国这样的国家涌入美国。这个问题受到大量补贴运费的推动，且通过电子商务市场挤占了美国原创商家的位置。”\n\n　　对新泽西州一家家居用品公司老板斯马尔多内(Jayme Smaldone)来说，这是美国总统用行动回应他的抗议。\n\n　　斯马尔多内是第一个注意到遭受国际邮费不公的受害人，他发现网上有中国产仿冒台式咖啡杯售卖，因中美国际运费比美国国内运费便宜，以至于中国运到美国的假货，比正品价格更低。\n\n　　“我的政府怎么能补贴中国、让我失业?必须要做些什么……”他说。\n\n　　可能加速美国国会立法\n\n　　川普宣布退出邮联的消息对国会共和党参议员卡西迪(Bill Cassidy)来说，也是个好消息，他一直在推动这方面的立法。\n\n　　卡西迪在4月提议一项“终止不必要的交付补贴(ENDS)”法案，希望让美国纳税人免于补贴从国外到美国的国际邮包。\n\n　　“我几个月来一直在与政府合作解决这个可怕的(邮联)协议，因为美国公司正在被外国竞争对手挤出商业领域，他们运送到路易斯安那州的廉价仿冒品，比一家美国公司邮寄真货的成本还要低。”他在周三发表声明说。\n\n　　“川普总统支持美国工人和公司，那些受这项过时、不公平国际运费协议的影响的公司和个人。”\n\n　　而有媒体认为，这是川普政府在美中贸易战中开辟的一条新战线。\n\n　　川普政府目前已对2,500亿美元的中国商品加征关税，而中共也对1,100亿美元的美国商品加征关税。川普还表示，他已准备好将关税扩大到另外2,670亿美元的中国进口产品，意味着所有美国境内的中国商品都可能被征税。而中共声称会报复美方举动。\n\n　　近期，中共当局通过广告形式在美国境内媒体插入反川普贸易战报导，也在引发美国对中共干预美国政治选举的警惕。"
		},
		{
			"post_id": 12,
			"title": "[车祸现场]又翻车了，小型事故",
			"date_published": 1539829738.174,
			"body": "**图片源自网络，如有违规或侵权请联系删除**\n![](http://www.sxotu.com/u/20181009/14283255.png) \n![](http://www.sxotu.com/u/20181009/14283435.jpg) \n![](http://www.sxotu.com/u/20181009/14283423.png) \n![](http://www.sxotu.com/u/20181009/14283536.png) \n![](http://www.sxotu.com/u/20181009/14283697.png) \n![](http://www.sxotu.com/u/20181009/1428377.png) \n![](http://www.sxotu.com/u/20181009/14283773.png) \n![](http://www.sxotu.com/u/20181009/14283810.png) \n![](http://www.sxotu.com/u/20181009/14283984.png) \n\n![](http://www.sxotu.com/u/20180701/09232765.jpg)​​​​​​​"
		},
		{
			"post_id": 11,
			"title": "番墙出来的各位可以来了解下防火长城----GFW",
			"date_published": 1539829433.398,
			"body": "#### - 1998年9月22日，公安部部长办公会议通过研究，决定在全国公安机关开展全国公安工作信息化工程――\"金盾工程\"建设。\n\n- 1999年4月20日，公安部向国家计委送交金盾工程立项报告和金盾工程项目建议书。\n\n- 1999年4月25日，上万名法X功练习者围攻中X海。\n\n- 1999年6月，国家计算机网络与信息安全管理中心成立，局级事业单位。\n\n- 1999年7月22日，中华人民共和国政府宣布法X功妨碍国家安全和社会稳定，认定法轮大法研究会及法X功为非法组织，决定予以取缔。\n\n- 1999-2000年，在哈尔滨工业大学任教多年的方滨兴调任国家计算机网络与信息安全管理中心副总工程师。\n\n- 1999年12月23日，国务院发文成立国家信息化工作领导小组，国务院副总理吴邦国任组长。其第一下属机构计算机网络与信息安全管理工作办公室设在已经 成立的国家计算机网络与信息安全管理中心，取代计算机网络与信息安全管理部际协调小组，对\"公安部、安全部、保密局、商用密码管理办公室以及信息产业部\" 等部门的网络安全管理进行组织协调。\n\n- 2000-2002年，方滨兴在国家计算机网络与信息安全管理中心任总工程师、副主任、教授级高级工程师。\n\n- 2000年4月20日，公安部成立金盾工程领导小组及办公室。\n\n- 2000年5月，005工程开始实施。\n\n- 2000年8月19日，大X元时报创刊。\n\n- 2000年10月，信息产业部组建计算机网络应急处理协调中心。\n\n- 2000年12月28日，第九届全国人民代表大会常务委员会第十九次会议通过《关于维护互联网安全的决定》。\n\n- 2001年，方滨兴\"计算机病毒及其预防技术\"获国防科学技术三等奖，排名第一。\n\n- 2001年，方滨兴获国务院政府特殊津贴、信息产业部\"在信息产业部重点工程中出突出贡献特等奖先进个人\"称号，中组部、中宣部、中央政法委、公安部、民部、人事部等联合授予\"先进个人\"称号。\n\n- 2001年1月19日，国家计算机网络与信息安全管理中心上海分中心成立，位于上海市黄浦区中山南路508号6楼。国家计算机网络应急技术处理协调中心上海分中心是工业和信息化部直属的中央财政全额拨款事业单位。\n\n- 2001年4月25日，\"金盾工程\"经国务院批准立项。\n\n- 2001年7月，计算机网络与信息安全管理工作办公室批准哈尔滨工业大学建立国家计算机信息内容安全重点实验室，胡铭曾、方滨兴牵头。\n\n- 2001年7月24日，国家计算机网络与信息安全管理中心广州分中心成立，位于广州市越秀区建中路2、4号。\n\n- 2001年8月8日，国家计算机网络与信息安全管理中心组建国家计算机网络应急处理协调中心，缩写CNCERT/CC。\n\n- 2001年8月23日，国家信息化领导小组重新组建，中央政治局常委、国务院总理朱镕基任组长。\n\n- 2001年11月28日，国家计算机网络与信息安全管理中心上海互联网交换中心成立。提供\"互联网交换服务，互联网骨干网华东地区数据交换，数据流量监测 与统计，网间通信质量监督，交换中心设备维护与运行，网间互联费用计算，网间互联争议协调\"，位于上海市黄浦区中山南路508号。\n\n- 2001年11月28日，国家计算机网络与信息安全管理中心广州互联网交换中心成立，位于广州市越秀区建中路204号。\n\n- 2001年12月，在北京的国家计算机网络与信息安全管理中心综合楼开始兴建。\n\n- 2001年12月17日，国家计算机网络与信息安全管理中心湖北分中心成立。\n\n- 2002年，方滨兴任中国科学院计算技术研究所客座研究员、博士生导师、信息安全首席科学家。2002-2006年，方滨兴在国家计算机网络与信息安全管理中心任主任、总工程师、教授级高级工程师，升迁后任其名誉主任。\n\n- 2002年1月25日，报道称：\"国家计算机网络与信息安全管理中心上海互联网交换中心日前开通并投入试运行，中国电信、中国网通、中国联通、中国吉通等4家国家级互联单位首批接入。中国移动互联网的接入正在进行之中，近期可望成为第五家接入单位。\"\n\n- 2002年2月1日，国家计算机网络与信息安全管理中心新疆分中心成立。\n\n- 2002年2月25日，国家计算机网络与信息安全管理中心贵州分中心成立。\n\n- 2002年3月20日，多个国家计算机网络与信息安全管理中心省级分中心同时成立。\n\n- 2002年9月3日，Google.com被封锁，主要手段为DNS劫持。\n\n- 2002年9月12日，Google.com封锁解除，之后网页快照等功能被封锁，手段为TCP会话阻断。\n\n- 2002年11月，经费6600万的国家信息安全重大项目\"大范围宽带网络动态阻断系统\"（大范围宽带网络动态处置系统）项目获国防科学技术二等奖。云晓 春排名第一，方滨兴排名第二。哈尔滨工业大学计算机网络与信息内容安全重点实验室李斌、清华大学计算机系网络技术研究所、清华大学网格计算研究部杨广文有 参与。\n\n- 2003-2007年，方滨兴任信息产业部互联网应急处理协调办公室主任。\n\n- 2003年1月31日，经费4.9亿的国家信息安全重大项目\"国家信息安全管理系统\"（005工程）获2002年度国家科技进步一等奖，方滨兴排名第一， 胡铭曾排名第二，清华大学排名第三，哈尔滨工业大学排名第四，云晓春排名第四，北京大学排名第五，郑纬民排名第七，中国科学院计算技术研究所有参与。\n\n- 2003年2月，在北京的国家计算机网络与信息安全管理中心综合楼工程竣工。\n\n- 2003年7月，国家计算机网络应急处理协调中心更名为国家计算机网络应急技术处理协调中心。\n\n- 2003年9月2日，全国\"金盾工程\"会议在北京召开，\"金盾工程\"全面启动。\n\n- 2004年，国家信息安全重大项目\"大规模网络特定信息获取系统\"，经费7000万，获国家科技进步二等奖。\n\n- 2005年，方滨兴任国防科学技术大学兼职教授、特聘教授、博士生导师。\n\n- 2005年，方滨兴被遴选为中国工程院院士。\n\n- 2005年，\"该系统\"已经在北京、上海、广州、长沙建立了互相镜像的4套主系统，之间用万兆网互联。每套系统由8CPU的多节点集群构成，操作系统是红 旗Linux，数据库用的是OracleRAC。2005年国家计算机网络与信息安全管理中心（北京）就已经建立了一套384*16节点的集群用于网络内 容过滤（005工程）和短信过滤（016工程）。该系统在广州、上海都有镜像，互相以十万兆网链接，可以协同工作，也可以独立接管工作。\n\n- 2006年11月16日，\"金盾工程\"一期在北京正式通过国家验收，其为\"为中华人民共和国公安部设计，处理中国公安管理的业务，涉外饭店管理，出入境管理，治安管理等的工程\"。\n\n- 2007年4月6日，国家计算机网络与信息安全管理中心上海分中心机房楼奠基，位于康桥镇杨高南路5788号，投资9047万元，\"……是国家发改委批准 实施的国家级重大项目，目前全国只有北京和上海建立了分中心，它是全国互联网信息海关，对保障国家信息安全担负着重要作用。\"\n\n- 2007年7月17日，大量使用中国国内邮件服务商的用户与国外通信出现了退信、丢信等普遍现象。\n\n- 2007年12月，方滨兴任北京邮电大学校长。\n\n- 2008年1月18日，信息产业部决定免去方滨兴的国家计算机网络与信息安全管理中心名誉主任、信息产业部互联网应急处理协调办公室主任职务，\"另有职用\"。\n\n- 2008年2月29日，方滨兴当选第十一届全国人民代表大会安徽省代表。\n\n- 2009年8月10日，方滨兴在\"第一届中国互联网治理与法律论坛\"上大力鼓吹网络实名制。\n\n机构关系\n\n国家计算机网络与信息安全管理中心（安管中心）是原信产部现工信部的直属部门。\n\n安管中心与国家信息化工作领导小组计算机网络与信息安全管理工作办公室与国家计算机网络应急技术处理协调中心（CNCERT/CC，互联网应急中 心）是一个机构几块牌子的关系。比如方滨兴简历中\"1999-2000年在国家计算机网络应急技术处理协调中心任副总工\"与\"计算机网络应急处理协调中 心\"的成立时间两种说法就有着微妙的矛盾。实际上几个机构的人员基本一致。安管中心下属互联网交换中心与国家互联网络交换中心是不同的机构。各安管中心省 级分中心一般挂靠当地的通信管理局。\n\n安管中心的主要科研力量来自\"哈尔滨工业大学一定会兴盛\"方滨兴当博导有一批学生的哈工大以及关系良好的中科院计算所，这两个机构是那三个国家信息 安全重大项目的主要参与者，之后还在不断吸引人才并为安管中心输送人才和技术。在方滨兴空降北邮之后，往安管中心输血的成分中哈工大的逐渐减少，北邮的逐 渐增多。\n\nCNCERT/CC的国内\"合作伙伴\"有中国互联网协会主办北京光芒在线网络科技有限公司承办的中国互联网用户反垃圾邮件中心，是个没有实权的空 壳；国家反计算机入侵及防病毒研究中心、国家计算机病毒应急处理中心，是公安部、科技部麾下；违法和不良信息举报中心是国新办势力范围；国家计算机网络入 侵防范中心是中科院研究生院的机构，同样直接支撑CNCERT/CC。\n\nCNCERT/CC的应急支撑单位中民营企业最初领跑者是绿盟，后来绿盟因其台谍案被罢黜，启明星辰取而代之。而安管中心具有一些资质认证、准入审 批的行政权力，这可能是民间安全企业趋之若骛的原因。不过，民营企业并未参与到国家信息安全的核心项目建设中，安管中心许多外围项目交给民企外企做，比如 像隔离器之类的访问限制设备外包给启明星辰以作为辅助、备用，或者在与他们在网络安全监测上有所交流。\n\nGFW与金盾没有关系\n\n敏锐的读者从时间表应该已经看出这样的感觉了。实际上，GFW与金盾就是没有关系，两者泾渭分明，有很多区别。\n\n公安系统搞网络监控的是公安部十一局\n\nGFW是“国家信息关防工程”的一个子工程,直接上级是国家信息化工作领导小组和信息产业部是政治局亲自抓的国防工程.这个工程主要监测发现有害网 站和信息,IP地址定位,网上对抗信息的上报,跟踪有害短信息和及时进行封堵。 江泽民,朱镕基,胡锦涛,李岚清,吴邦国等多次视察该工程\n“国家信息关防工程”包括 “国家信息安全管理系统 工程代号为005。还有国家信息安全016工程等等\n\nGFW主要是舆情 情报系统的工具，而金盾主要是公安系统的工具。GFW的总支持者是负责宣传工作的李长春，和张春江 江绵恒 最初的主要需求来自政治局 政法委 安全部 610办 ；而金盾的总支持者是公安系统的高层人士，主要需求来自公安部门。GFW主外，作网络海关用；而金盾主\n内，作侦查取证用。GFW建设时间短，花费少，成效好；而金盾 建设时间长，花费巨大（GFW的十倍以上），成效不显著。\n\nGFW依附于三个国家级国际出入口骨干网交换中心从CRS GSR流量分光镜像到自己的交换中心搞入侵检测，再扩散到一些放在ISP那里的路由封IP，位置集中，设备数量少；而金盾则是公安内部信息网络，无处不 在，数量巨大。GFW的科研实力雄厚，国内研 究信息安全的顶尖人才和实验室有不少在为其服务，比如哈工大信息安全重点实验室、中科院计算所 软件所 高能所 国防科大总参三部 安全部9局 北邮 西电 、 上海交大 北方交大 北京电子科技学院 解放军信息工程学院 解放军装甲兵工程学院 信产部中电30所 总参56所等等；另外几乎所有985 211高校都参与此工程 一些公司商业机构也参与某些外围工程项目如 Websense packeteer BlueCoat 华为 北大方正 港湾 启明星辰 神州数码也提供了一些辅助设备 中搜 奇虎 北京大正 雅虎等等参与了搜索引擎安全管理系统 在某些省市级的网络机房里，接入监控的部门就五花八门了，有安全、公安、纪检、部队，等等部署的设备也是五花八门 正规军 杂牌军 洋外援各自为战\n\n而金盾的科研实力较弱，公安系统的公安部第三研究所信息网络安全研发中心、国家反计算机入侵与防病毒研究中心都缺乏科研力量和科研成果，2008年 8月成立信息网络安全公安部重点实验室想 与哈工大的重点实验室抗衡，还特意邀请方滨兴来实验室学术委员会，不过这个实验室光是电子数据取证的研究方向就没什么前景，而且也没什么研究成果。GFW 之父方滨兴没有参与金盾工程，而工程院里在支持金盾工程的是沈昌祥；实际上那个公安部重点实验室的学术委员会名单很是有趣，沈昌祥自然排第一，方滨兴因为 最近声名太显赫也不好意思不邀请他，方滨兴可能也有屈尊与公安系统打好关系的用意。\n\nGFW发展和状况\n\nGFW主要使用的硬件来自曙光和华为，没有思科、Juniper，软件大部为自主开发。原因很简单，对国家信息安全基础设施建设，方滨兴在他最近的 讲话《五个层面解读国家信息安全保障体系》中也一直强调\"信息安全应该以自主知识产权为主\"。何况GFW属于保密的国防工程而且GFW没有闲钱去养洋老 爷，肥水不流外人田。李国杰是 工程院信息工程部主任、曙光公司董事长、中科院计算所所长，GFW的大量服务器设备订单都给了曙\n光。方滨兴还将安管中心所需的大型机大订单给李国杰、国防 科大卢锡城、总参56所陈左宁三位院士所在单位各一份。所以GFW为什么那么多曙光的设备，GFW为什么那么多中科院计算所的科研力量，为什么方滨兴成为 中科院计算所和国防科大都有显赫的兼职，为什么方滨兴从老家哈尔滨出来打拼短短7年时间就入选工程院卢浮宫？就是因为方滨兴头脑灵活，做事皆大欢喜。\n\n网上有人讽刺GFW夜郎自大，事实上这是盲目乐观，无知者无畏。GFW的技术是世界顶尖的，GFW集中了哈工大、中科院、北邮货真价实的顶尖人才， 科研力量也是实打实地雄厚，什么动态SSL Freenet VPN SSH TOR GNUnet JAP I2P Psiphon 什么Feed Over Email 算什么葱。所有的翻墙方法，只要有人想得到，GFW都有研究并且有反制措施的实验室方案储备。比如说：串接式封堵 采用中间人攻击手段来替换加密通信双方所用的没有经过可信赖CA签名保护的数字证书网关/代理间的证书协调，在出口网关上进行解密检测也就是所谓深度内容 检测 七层过滤 HTTPS 是需要认证的。客户端访问服务器时，服务器端提供CA证书，但有些实现也可以不提供CA证书那么对于不提供CA证书的服务器，防火墙处理很简单，一律屏蔽 掉另外检测默认的CA发证机构，如果证书不是这些机构（Verisign、Thawte Geotrust）发的，杀无赦就是在客户端与服务器端进行https握手的阶段，过滤掉一切无CA证书或使用不合法CA证书的https请求。这一步是 广谱过滤，与服务器的IP地址无关。\n\nGFW主要是入侵防御系统，检测-攻击两相模型。 所有传输层明文的翻墙方案，检测然后立即进行攻击是很容易的事情；即使传输层用TLS之类的加密无法实时检测，那种方案面向最终用户肯定是透明的，谁也不 能阻止GFW也作为最终用户来静态分析其网络层可检测特征。入侵检测然后TCP会话重置攻击算是干净利落的手段了，最不济也能通过人工的方式来查出翻墙方 法的网络层特征（仅仅目标IP地址就已经足够）然后进行定点清除。如果是一两个国家的敌人，GFW也能找到集群来算密钥。GFW是难得能有中央财政喂奶的 科研项目。那些在哈工大地下室、中科院破楼里的穷研究生即使没有钱也能搞出东西来，现在中央财政喂奶，更是干劲十足了。GFW什么都行，就是P2P没办 法，因为匿名性太好了，既不能实时检测出来，也无法通过静态分析找到固定的、或者变化而可跟踪的网络层特征。就这样也能建两个陷阱节点搞点小破坏，而且中 科院的242项目\"P2P协议分析与测量\"一直都没停。什么时候国外开学术会议还是Defcon谁谁发一篇讲Tor安全性的paper，立即拿回来研究一 番实现一下，已然紧跟学术技术最前沿了。不过实际上，即使GFW这样一个中国最顶尖的技术项目也摆脱不了山寨的本性，就是做一个东西出来很容易，但是要把 东西做细致就不行了。\n\n不过可能有人就疑问，为什么GFW什么都能封但又不真的封呢？我的这个翻墙方法一直还是好好的嘛。其实GFW有它自己的运作方式。GFW从性质上讲 是纯粹的科研技术部门，对政治势力来说是一个完全没有主观能动性的工具。GFW内部有很严格权限管理，技术与政治封装隔离得非常彻底。封什么还是解封什 么，都是完全由上峰决定，党指挥枪，授权专门人员操作关键词列表，与技术实现者隔离得很彻底，互相都不知道在做什么。所以很多时候一些莫名其妙的封禁比如 封freebsd.org封freepascal.org（可能都联想到freetibet.org），或者把跟轮子的 GPass八杆子打不着的\"package.debian.org/zh-cn/lenny/gpass\" 列为关键词，都是那些摆弄着IE6的官僚们的颐指气使，技术人员要是知道了都得气死。方滨兴在他最近的讲话《五个层面解读国家信息安全保障体系》中讲一个 立足国情的原则，说：\"主要是强调综合平衡安全成本与风险，如果风险不大就没有必要花太大的安全成本来做。在这里面需要强调一点就是确保重点的，如等级保 护就是根据信息系统的重要性来定级，从而施加适当强度的保护。\"所以对于小众的翻墙方式，GFW按照它的职能发现了也就只能过一下目心里有个底，上峰根本 都不知道有这么一种方式所以也根本不会去封、GFW自己也没权限封，或者知道了也懒得再花钱花精力去布置。枪打出头鸟，什么时候都是这样。目前的状况是对 于敏感数据能通过封锁基本上就是安全的，否则就被过滤掉了，对于庞大的网络数据用人来分析是不可能的，敏感数据只能基于过滤技术根据数据流里面的一些特征 来发现，目前的解密技术对于庞大数据流量和加密技术想使用解密的方法是不可能实现的，只要加密数据流没有可识别的特征，过滤技术就不会有任何记录和反映， 因此过滤技术是无法真正实现网络封锁的，因此必需加入新的参数，它们选择了量，即保存你的一段时间的数据。现在的破网方法用的比较多得是动态网，无界，花 园，等等，由于接点相对来说是有限的和可知的，因此保存一段时间的数据就有了意义，由于使用破网软件的人很多，不可能人人都抓，可以根据量来区分出重点， 和经常使用破网软件的人，当然你可已通过代理来连接这些可知接点来解决这个问题，破网软件也提供了这样的方法，但是通过代理联接可知的接点的请求还是可能 被截获的\n\n方滨兴一个人把GFW崛起过程中的政治势能全部转化为他的动能之后就把GFW扔掉了。现在GFW是平稳期，完全是清水衙门，既没有什么后台，也无法 再有什么政治、资金上的利益可以攫取，也无法再搞什么新的大型项目，连IPv6对GFW来说都成了一件麻烦事情。方滨兴在他最近的讲话《五个层面解读国家 信息安全保障体系》中也感慨道：\"比如说Web 2.0概念出现后，甚至包括病毒等等这些问题就比较容易扩散，再比如说IPv6出来之后，入侵检测就没有意义了，因为协议都看不懂还检测什么……\"GFW 一直就没有地位，一直就是一个没人管的萝莉，国新办、网监、广电、版权、通管局之类的怪蜀黍都压在上面要做这做那。所以方滨兴在他最近的讲话《五个层面解 读国家信息安全保障体系》中也首先强调一个机制，\"需要宏观层面，包括主管部门予以支持。\"所以，想解封网站，不要去找GFW本体，那没用，要去找GFW 的上峰，随便哪个都行。而ISP就根本跟GFW没关系了，都不知道GFW具体搞些什么，起诉ISP完全属于没找到脉门。\n\n不过GFW现在还是运行得很好，工作能力还有很大潜力可挖，唯一害怕的就是DDoS死撞墙。GFW的规模在前面的时间表里也有数字可以估计，而且 GFW现在的网站封禁列表也有几十万条之多。网络监控和对MSN YMSG ICQ等IM 短信监控也都尽善尽美。GFW在数据挖掘和协议分析上做的还比较成功多媒体数据如音频 视频 图形图像的智能识别分析 自然语言语义判断识别模式匹配 p2p VoIP IM 流媒体 加密内容识别过滤 串接式封堵 等等是将来的重点不过GFW也没有像机器学习之类的自组织反馈机制来自动生成关键词，因为它 本身没有修改关键词的权限，所以这种技术也没必要，况且国内这种技术也是概念吹得多论文发得多实践不成熟。现在GFW和金盾最想要的就是能够从万草从中揪 出一小撮毒草的数据挖掘之类的人工智能技术。方滨兴在他最近的讲话《五个层面解读国家信息安全保障体系》中提到\"舆情驾驭核心能力\"，\"首先要能够发现和 获取，然后要有分析和引导的能力\"。怎么发现？就靠中科院在研的973课题\"文本识别及信息过滤\"和863重点项目\"大规模网络安全事件监控\"这种项目。 金盾工程花大钱搞出来，好评反而不如GFW，十一局的干警们脸上无光无法跟老一辈交代啊。公安系统的技术力量跟GFW没法比，不过公安系统有的是钱，先游 山玩水吃喝一通，然后把剩下的税金像冲厕所一样随便买个几十万个摄像头几万台刀片几十PB硬盘接到省市级网络中心，把什么东西都记录下来。问题是记下来不 能用，只能靠公安干警一页一页地翻Excel。所以说，虽然看起来GFW千疮百孔，金盾深不可测，只是因为公安部门比起GFW来比较有攻击性，看到毒草不 是给你一个RST而是给你一张拘留证。反而是GFW大多数时候都把毒草给挡住了，而大多数毒草金盾都是没发现的。\n\n国家信息安全话语范式\n\n在轮子闹事被取缔之后，轮子组织仍然在从四面八方进行各种手段的宣传，而且逐渐依靠上了各种境外背景。境内的宣传活动很快就被公安和国安清理掉了， 然而从境外网上而来的大量网络宣传让从未有过网络化经验的中央无所适从、毫无办法、十分着急。这些东西对中央来说都是难以忍受的安全威胁，为这些威胁又发 生在网上，自然国家网络安全就被提上了首要议程。适逢信息化大潮，电子政务概念兴起，中央下决心好好应对信息化的问题，于是就成立了国家信息化工作领导小 组。我们可以看到，首批组成名单中，安全部门和宣传部门占了大多数席位，而且其第一下属机构就是处理安全问题，第二下属才是处理信息化改革，安全需求之强 烈，可见一斑。正是这个时候，一贯对信息安全充满独到见解的方滨兴被信产部的张春江调入了安管中心练级。方滨兴对信息安全的见解与高层对网络安全的需求不 谋而合。 一个方滨兴见解的集大成概括，方滨兴在他最近的讲话《五个层面解读国家信息安全保障体系》中说：\"一定要有一个信息安全法，有了这个核心法你才能做一系列 的工作。\"国家信息安全体系的首要核心就是以信息安全为纲的法律保障体系，通过国家意志――法律来定义何谓\"信息安全\"。信息安全本来是纯技术、完全中性 的词语，通过国家意志的定义，将\"煽动…煽动…煽动…煽动…捏造…宣扬…侮辱…损害…其他…\"定义为所谓的网络攻击、网络垃圾、网络有害信息、网络安全威 胁，却在实现层面完全技术性、中立性地看待安全，丝毫不考虑现实政治问题。这样既在技术上实现完备的封装，也给了用户以高可扩展性的安全事件定义界面。对 国家安全与技术安全实现充满隐喻的捆绑，对意识形态与信息科学进行牢不可破的焊接，这就是方滨兴带给高层的开拓性思维，这就是方滨兴提出的国家信息安全话 语范式。\n\n这个话语范式是如此自然、封装得如此彻底，以至于几乎所有人都没有意识到中国的网络化发展出现了怎样严重的问题。几乎所有网民都没有意识到，给他们 带来巨大麻烦和沮丧的GFW竟然是本来应该为网民打黑除恶的国家互联网应急响应中心；几乎所有网民都没有意识到，自己在网上某处的一亩三分地修剪花草对于 国家来说竟然是网络安全攻击事件；几乎所有决策者都没有意识到，那个看似立竿见影的防火墙实际上具有怎样强大的副作用、会给互联网发展带来怎样大的伤害； 几乎所有决策者都没有意识到，使用GFW这样专业的安全工具来进行网络封锁意味着什么。意识形态面对网络化这样变幻莫测的景色无法忍受，就只能用眼罩封闭 住眼睛。在讨论网络化的中文理论文本中，摆到首要位置占据最多篇幅的便是网络\n安全和网络威胁。国家信息化工作领导小组第一下属机构便是处理安全问题。这样，在网络本身都没有发展起来的时候，就在理论上对网络进行种种限制和控制；在 网络仍然自发地成长起来以后，便在文化上对网络进行系统性妖魔化，在地理上 对网络中国进行闭关锁国。更严重的是，在根本不了解技术本质和副作用的情况下使用国家信息安全工具，就像一个不懂事的小孩把玩枪械。在维护安全的话语之 下，决策者根本不知道使用GFW进行网络封锁就是在自己的网络国土上使用军队进行镇压，切断网线就是在自己的网络国土上种蘑菇。\n\n更悲哀的是，GFW的建设者们大多都没有意识到他们在做的究竟是什么事情，在签订保密协议之后就无意识中投身党国事业滚滚长江东逝水。像云晓春这种 跟着方滨兴出来打江山的，方滨兴倒是高飞了，云晓春们就只能鞠躬尽瘁干死技术，在安管中心反而被王秀军、黄澄清之辈后来居上。而当初在哈工大跟着方滨兴的 穷研究生们，最后也陆陆续续去了百度之类的公司。GFW面临与曼哈顿工程一样的伦理困局。科学本是中立的，但科学家却被政治摆弄。技术工作者们只关心也只 被允许关心如何实现安全，并不能关心安全的定义到底如何。他们缺乏学术伦理精神，不能实践\"对自己工作的一切可能后果进行检验和评估；一旦发现弊端或危 险，应改变甚至中断自己的工作；如果不能独自做出抉择，应暂缓或中止相关研究，及时向社会报警\"的准则。结果就算他们辛辛苦苦做研究却也不能造福民生，反 而被扣上\"扼杀中国人权\"\"纳粹帮凶\"的帽子，不可谓不是历史的悲哀。这种话语范式浸透了社会的方方面面。在这种话语之下，中国有了世界上最强大的防火 墙，但中国的网络建设却远远落后于世界先进水平；中国有了世界上最庞大的网瘾治疗产业链，但中国的网络产业却只会山寨技；中国有了世界上最多的网民，但在 互联网上却听不见中国的声音。GFW已经实现了人们的自我审查，让人们即使重获自由也无法飞翔，完成了其根本目的。现在即使对GFW的DDoS的技术已经 成熟，然而推倒墙却也变得没有意义，只能让公安系统的金盾得势，更 多的网民被捕，最终新墙竖起。这一切都出自意识形态化现代性与网络化后现代性之间巨大\n断裂，以及\"国家信息安全话语\"这种致命的讳疾忌医。\n\n结语\n\n一部GFW简史同时也是中国网络化简史。网络化既是技术变革，也是文化变革。网络文化这种\"有害成份\"无法分而治之，因为网络化的技术变革与文化变 革是一体的；后现代的网络文化也无法与现代的意识形态文化进行同化，因为两者分属不同的范式。网络的确是意识形态完全的敌人，因为网络多元化文化要求取消 意识形态的中心地位；但意识形态不是网络的敌人，事实上网络没有敌人，因为网络只有解构对象。因此对于执政者来说，意识形态的中心地位与网络化发展趋势两 者只能选择其一。实际情况是，执政者选择了前者，而把大刀挥向了Web 2.0。于是网络用它一贯调侃的风格模仿意识形态话语进行了如下讽刺：\"我们对你陈旧的政权概念和意识形态烂腌菜毫不感兴趣。你无法理解在人类网络化的历 史潮流之前宏大叙事为何而消解，你也无法理解国家和民族概念为何将分崩离析，你无法改变你对互联网的无知。你的政权无法成为我们真正的敌人。\"其实， 《2009匿名网民宣言》只是过早的预言，cyberpunk式的谜语。\n\n然而，无论中国的互联网受到了怎样的限制和压迫，即便中国网民的眼界已经被成功禁锢，中国的网络还是以它自己的方式适应种种压力顽强地发展。无论有 多么强大的GFW或者金盾，即使被关在果壳之中，网络仍然在以意识形态完全不能理解的方式走向后现代蓝海，自成为无限空间之王。\n那是IPV4时代，据说IPV6被华为垄断硬件供应\n原地址 [https://fangbinxing.appspot.com/](http://www.viidii.info/?https://fangbinxing.appspot.com/) 可能需要翻墙"
		},
		{
			"post_id": 10,
			"title": "[车祸现场]这个属于特大型事故了，评论没截全，太多了",
			"date_published": 1539827281.824,
			"body": "**图片源自网络，如有违规或侵权请联系删除**\n![](https://www.sxotu.com/u/20181017/19110488.png) \n![](https://www.sxotu.com/u/20181017/19110776.jpg) \n![](https://www.sxotu.com/u/20181017/19111083.png) \n![](https://www.sxotu.com/u/20181017/19111173.png) \n![](https://www.sxotu.com/u/20181017/19111370.png) \n![](https://www.sxotu.com/u/20181017/19111529.png) \n![](https://www.sxotu.com/u/20181017/1911161.png) \n![](https://www.sxotu.com/u/20181017/19111838.png) \n![](https://www.sxotu.com/u/20181017/19112044.png) \n![](https://www.sxotu.com/u/20181017/19112215.png) \n![](https://www.sxotu.com/u/20181017/1911234.png) \n![](https://www.sxotu.com/u/20181017/1911257.png) \n![](https://www.sxotu.com/u/20181017/19112855.png) \n![](https://www.sxotu.com/u/20181017/19113083.png) \n![](https://www.sxotu.com/u/20181017/19113259.png) \n![](https://www.sxotu.com/u/20181017/19113356.png) \n![](https://www.sxotu.com/u/20181017/19113563.png) \n![](https://www.sxotu.com/u/20181017/19113743.png) \n![](https://www.sxotu.com/u/20181017/19113948.png) \n![](https://www.sxotu.com/u/20181017/19114066.png) \n![](https://www.sxotu.com/u/20181017/19114261.png) \n![](https://www.sxotu.com/u/20181017/19114586.png)"
		},
		{
			"post_id": 9,
			"title": "（翻墙）分享一下我收藏的良心ssr公益站。\n",
			"date_published": 1539677727.814,
			"body": "现在墙越来越高，手里没多个梯子都不安心。\ntg和G+上面的公交车ssr基本上用不了两天，且发出来后人多了速度忽高忽低，也就应急时候可以用用。付费机场虽然选择多，服务好。但是有很多朋友翻墙需求其实并不高，除去youtube这种吃流量多的应用，一般刷推之类一个月也用不了50G这种机场包月标准套餐的量。\n能满足清凉、免费、速度还不算慢这几个需求的免费ssr，并不是没有。接下来给大家分享的就是我找到的几个良心公益站，跟付费机场大同小异，也有订阅链接，好几个节点，速度亲测youtube1080p都很稳。\n1.ssru.xyz[/quote]\n这个是我很推荐的一个公益站，自用了大半年，刚开始tg群里只有几百人，全公益性质。节点多且速度跑的非常快，比一些小机场都不差。现在发展到两钱多人了，也顺利开启了付费服务。不过公益节点也有六条，每日签到2g流量，累计到月底清零。\n2.superssr.me\n这个也是个资格很老的公益站了，跟第一个差不多。公益节点七条，日签到2-5G,量大管饱，就是节点质量稍次。\n3.cccat.cc\n公益节点三条，速度还不错，日签到几百流量。\n4.520ssr.tk\n公益节点六条，日签到流量忘了，速度跟第三个差不多。\n5.yahaha.cf\n这个公益站是我见过的最快的，刚开始节点只有六七条，之后还加了日本台湾韩国的节点，速度飞起，youtube1080秒开。他家的付费机场也相当快，我现在自己也在用。"
		},
		{
			"post_id": 8,
			"title": "[几芾分享]各种扯蛋的新闻[2018.10.14合版]",
			"date_published": 1539675586.672,
			"body": "#### [几芾分享]各种扯蛋的新闻[2018.10.14合版]\n\n【浙江传媒学院文学院副院长赵思运因开学典礼致辞被党内严重警告】\n\n###### Quote:\n\n> 我呼吁——重申知识分子的优良传统：“风声雨声读书声声声入耳，家事国事天下事事事关心”；我呼吁——重建人文知识分子的“公共价值”信念。近年来，“公共知识分子”被严重污名化，我们有必要为这个概念正本清源。“公共知识分子”的精确定义是具有学术背景和专业素质的知识者；是进言社会并参与公共事务的行动者；是具有批判精神和道义担当的理想者。现在恰恰是一种稀缺的精神资源。——赵思运\n\n![](https://www.touimg.com/u/20181014/21325057.jpg) \n\n【不管老百姓喫草，先喂飽軍隊】\n\n###### Quote:\n\n> 習近平視察黑龍江之後，黑龍江農墾總局改制為軍委總後勤部所轄企業。功能是軍隊用糧基地和復轉軍人安置基地，將辭退所有外來打工人員（主要是“農民工\")。農墾總局將過度為中央軍企，工資待遇將大大高於地方。\n\n![](https://www.touimg.com/u/20181014/21333972.jpg) \n\n【穗警認對女律師行為不當 但否認毆打脫衣羞辱 孫世華促省紀委介入】\n\n###### Quote:\n\n> 維權律師隋牧青之妻孫世華律師投訴廣州市警方毆打及脫光其衣服羞辱她一事，經多日發酵和官媒介入討論，警方由最初只是否認毆打和羞辱孫世華到昨日承認民警報執行公務期間，態度生硬，行為不當，但堅持沒有毆打羞辱的情況。孫世華一天內兩度回應，對聲明表示遺憾，指與真相距離太遠，市公安局有意包庇犯事警員，重申要求省紀檢和人大介入徹查。\n\n![](https://www.touimg.com/u/20181014/21343647.jpg) \n\n【言论】\n\n|                                                                                                        |\n|--------------------------------------------------------------------------------------------------------|\n| 〖RFI〗一封疑似崔永元的遗书《崔永元：假如我倒下》在中国网络疯传，官方封杀了微信等平台传播，但在微博上可能放开半扇门扉依然能传阅。崔永元本人对是否是他的遗书没有明确作答，但表示他的揭露得罪很多利益集团。 |\n\n|                                                                                                                                          |\n|------------------------------------------------------------------------------------------------------------------------------------------|\n| 〖huangzhaoyun〗河南一小伙，12日在其微信群中称：“大家应该把自己的家业送给共产党，否则你就是政治觉悟不高，走资派，背离国家和人民，党要对你进行教育，把你送到新疆再教育集中营进行马克思主义教育，谁不服试试。”被信阳商城公安局网监大队发现，并处於14日行政拘留。 |\n\n|                                                                                                                                              |\n|----------------------------------------------------------------------------------------------------------------------------------------------|\n| 〖邓聿文〗我的判断是中国不会闭关锁国的。中国有庞大的产能，产能肯定要对外输出。另一方面，习近平本人其实两种颜色都有。他上台以来也从没说过不改革。危机感会迫使他们不得不施行改革。12月即将召开纪念改革开放40周年的会议，我估计那时或许会在经济方面推出几条有突破性、有力度的改革措施。 |\n\n|                          \n|--------------------------\n| 〖神乐坂雅诗〗那年，我们直连就能上 Google+\n那年，我们改 hosts (smarthosts) 就能上 Google+\n那年，我们用 GAE (goagent) 就能上 Google+\n那年，我们用 VPN 就能上 Google+\n现在，我们用 shadowsocks 就能上 Google+\n明年，我们需要注册一家公司并向谷歌支付费用才能上 Google+\n未来，我们需要收购 Google 才能… |\n\n|                                                                                                                                      |\n|--------------------------------------------------------------------------------------------------------------------------------------|\n| 〖朱永杰〗自美利坚建国以来，无论是总统上任还是大法官就职，都要手按圣经宣誓。这次卡瓦诺大法官当然也不会例外，在两个女儿的见证下，他手按妻子捧着的圣经，举起了右手宣誓就职。这种设计真是绝妙，由你最亲密的伴侣，捧着最神圣的圣经，让最信赖你的孩子见证，面向亿万公众宣誓。 |\n\n| 〖韩连潮〗前奥巴马政府负责安全的助理司法部长John Carlin出版新书，披露中共如何窃取美国技术实现“历史上最大财富转移”的。这本《代码战争的黎明》用事实证明党国大规模盗窃商业和军事机密，以及美如何与其博弈；书中提到苏斌案，他偷了波音C-17技术的630,000个文件，数据达65 GB；书称党国现在盗窃活动更隐秘。 |\n\n【other】\n\n###### Quote:\n\n> ![](https://www.touimg.com/u/20181014/21382172.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21382268.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21382329.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/2138245.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21382513.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21382665.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/2138272.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21382828.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21382975.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21383058.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21383153.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21383226.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21383456.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21383664.jpg) \n> ![](https://www.touimg.com/u/20181014/21383611.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21383813.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21383982.jpg)  \n> \n> ![](https://www.touimg.com/u/20181014/21384069.jpg)"
		},
		{
			"post_id": 7,
			"title": "护照免签率最高的国家是日本",
			"date_published": 1539674722.578,
			"body": "**《欧洲时报》近日刊文称，一年一度更新的亨氏护照排行榜，近日公布了2018年最新数据。简单来说，这份排行榜代表着各国护照的\"好用\"程度，也就是谁的免签国最多，哪国公民持护照跨国出行最方便。根据统计，全球各国之中，护照免签率最高的国家是日本。**"
		},
		{
			"post_id": 6,
			"title": "扬州汉开车撞拆迁队　妻：丈夫被围殴在先",
			"date_published": 1539650760.69,
			"body": "扬州汉开车撞拆迁队　妻：丈夫被围殴在先\n\n10月15日(一) 22:07\n\n![](http://hk.on.cc/hk/bkn/cnt/cnnews/20181015/photo/bkn-20181015220709562-1015_00952_001_01p.jpg?20181015223245)\n\n![](http://hk.on.cc/hk/bkn/cnt/cnnews/20181015/photo/bkn-20181015220709562-1015_00952_001_02p.jpg?20181015223245)\n\n韦男的妻子王琴忆述事件时仍心有馀悸。（互联网）\n\n1/2\n\n“二三十人就围攻他，他们拿了军大衣将我丈夫蒙起来打，按在地上打。”韦男的妻子王琴周一（15日）忆述事件时心有馀悸，当时夫妇二人得知强拆后赶至现场，随即被大量身穿制服的人员包围，并一同从车上被拉下，当中更有人手持木棍，其丈夫一度被人围殴。\n\n她续称，丈夫到场后曾对拆迁人员称，在没有手续情况下，不能进行拆迁，惟对方随即开始施暴。冲突期间，拆迁人员曾围殴其丈夫，其丈夫从人群中挣脱，一度上车准备开车离去，但却遭多人用砖头打砸车身。其间有人下令捉拿王琴，要求她签字并同意拆迁，惟她拒绝后被多人拉扯，“把我的包拉坏了，手机也没了，将我拉到一边，我要说话就拿脚蹬我”，拍照和劝架的人也被夺去手机。\n\n王琴与丈夫失散后，遂使用朋友手机报警，经由他人告知，才得悉丈夫开车撞人一事，“那些人拦住车子不许他走，接着不知道出现甚么情况，他车子就冲出去了”。"
		},
		{
			"post_id": 5,
			"title": "一叶知秋\n",
			"date_published": 1539415647.755,
			"body": "大风起于青萍之末，巨浪成于微澜之间，全球经济风暴，始自亚马逊蝴蝶的翅膀。\n\n9月30日晚，关乎北美大陆1.2万亿美元贸易额、拥有25年历史的北美自由贸易区协定(NAFTA)，升级为「美国-墨西哥-加拿大协定(USMCA)」。13个月艰苦的马拉松谈判后，美墨加联手打造的自由贸易模板，让西方七国看到了美欧日强强携手的可能。但对于长期依赖WTO市场倾销的发展中国家来说，9.30噩梦降临！\n\n上篇 架空WTO\n\n众所周知，川普入主白宫以来热衷退群，从退出伊朗核协定，到退出巴黎气候协定，再到退出联合国教科文组织，甚至威胁退出联合国……川普是一个精明到骨子里的商人，对于世贸总协定WTO尤其厌恶。一方面WTO漏洞百出，对不履行入世承诺的国家无力惩戒；另一方面，更改WTO规则需要所有成员国一致同意。\n\n这两个缺陷意味着遵守契约者利益受损，并且无力更改不合理条款。凭藉商人的灵敏嗅觉，川普发现并利用了WTO规则的最大漏洞——国家安全条款，成员国在国家安全受到威胁的情况下，政府有权力提高关税，藉此对恶意倾销钢铝的国家加征关税。这成为千方百计绕道出口国家的噩梦，后者暴跳如雷却无计可施。\n\n如果说川普借国家安全条款化解掉WTO关税约束还有违背道德之嫌的话，他巧妙运用WTO必须协商一致的决策机制，来阻挠WTO上诉机构任命新法官的甄选程序，这种以其人之道还治其人之身的变通之术，绝对称得上是庖丁解牛般令人叫绝的行为艺术！众所周知，目前WTO上诉机构的剩余法官中的多数任期已满，\n\n9月美国仍然没有同意选举， WTO上诉机构中只剩下了3名法官，而如果拖到2019年底的话，将只剩下1名法官。按照WTO规定，上诉机构在处理成员国诉讼的时候需要至少3名法官！换句话说，那些针对美国‘贸易保护主义关税’向WTO提出上诉的国家，将不得不面临WTO上诉机构停摆的尴尬。这招够阴的吧？\n\n恶人自有恶人磨。不遵守入世承诺、明暗两手推行贸易保护的国家遇上了克星。而得理不饶人，川普并不满足于在WTO框架内小偷小摸、小修小补，他更疯狂的想法是，彻底甩开跟不上时代潮流的WTO多边框架桎梏，重构世界贸易体系。\n\n中篇 经济北约\n\n时光追溯到6.12川金会前，东西方同时上演上合组织峰会和G7峰会对台戏。迥异于6.9琴岛各怀心事但不露声色的晚宴现场，6.10的G7峰会称得上是各抒己见、剑拔弩张。起因源自美国对西方盟友加征钢铝关税，随后川普早退、抨击加拿大总理特鲁多、宣布撤销支持G7联合公报……42年来G7峰会首次不欢而散。\n\n一时间，‘失败的G7、6+1、美欧分裂……’诸般幸灾乐祸的报道充斥媒体头条。但是，滤掉表面浮沫，认真倾听西方政要们发出的真实声音就会发现，他们自始至终并不回避正面矛盾。而唇枪舌剑的真实，远比口惠而实不至的虚伪更有价值。\n\n6.10川普G7早退，动身前往新加坡参加川金会前扔下了一句石破天惊的话，「美国反对贸易保护主义，最终目的是寻求G7国家之间零关税、零壁垒、零补贴。」遗憾的是，不知道是没注意到or有意忽略，有关媒体竟然对这句话选择性无视。\n\n选择性无视是有隐衷的。长久以来川普一直被冠以‘贸易保护主义者’的大帽，但6.10这番表态却让这种说法不攻自破。川普并非要反对一切多边模式，他只是想为美国选民争取到更公平的贸易环境。如实报道将如何自圆其说？是以明知全世界都听到了川普的「零关税、零壁垒、零补贴」表态，只好学鸵鸟自欺欺人。\n\n没有人会对顾头不顾腚的鸵鸟感兴趣。川普这番表态的真实目的到底是什么呢？\n\n打造「经济北约」！换言之，是打碎陈腐的WTO世界贸易体制，追求美欧日经济一体化，在共同价值观指引下，在共同市场基础上，打造关税和经济同盟。继7.17日欧自贸协定后，9.24美韩自贸协定、9.30新版北美自贸协定「美国-墨西哥-加拿大协定(USMCA)」落地，无疑将为美欧、美日自贸协定提供现成的模板。\n\n令人无语的是，有关媒体还在不遗余力地报道美欧日之间的贸易争吵。醒醒吧，院内的兄弟阋墙，和院外的共御其侮完全是两码事儿，那些诸如‘川普对全球发动贸易战……’之类的自言自语毫无意义不说，根本经受不住时间的考验。远的不说，被有关媒体热捧的加拿大总理特鲁多、外长弗里兰，可曾强硬抗美到底了？\n\n下篇 站队，抉择\n\n很多人听说过「中日韩自由贸易区FTA」吧？这一设想最早始于2002年三国领导人峰会上提出，一晃16年过去了，为什么总也谈不拢呢？嗯，特色市场经济和完全市场经济还是略有不同的。在日韩眼中，国家资本主义和市场资本主义不可以混为一谈。问题是，贸易大战当前，签署这个协议的重要意义谁都心知肚明。\n\n不幸的是，川普有能力洞悉WTO规则漏洞并玩弄于股掌之上，焉能在新贸易协定里给对手以可乘之机？条分缕析「美国-墨西哥-加拿大协定(USMCA)」，其中针对第三国的32.10条款如是规定——协议成员国不得与非市场经济国家签订双边自由贸易协定，如果三国之一与非市场经济国家签订双边自由贸易协议，那么成员国中的另外两国将可以提前六个月进行终止三国协议通知后终止该协议。\n\n9月25日，美国贸易代表莱特希泽、欧盟贸易委员玛姆斯托姆、日本经济贸易和工业部长世耕弘成举行三方会谈后发表联合声明，第三国非市场主导政策和做法导致严重产能过剩，阻碍创新技术的开发和使用，破坏国际贸易的正常运作，并使得现有规则无效。10.6一位白宫高级官员更是直截了当地表示，「重要的是，我们要确保我们达成的任何协议不会最终遭到削弱，×国也不会找到进入美国市场的后门。」如同11.4后选择跟美国做生意呢还是跟伊朗？只能二选一。\n\n在当前的贸易战大背景下，谁是「非市场经济国家」显然毋需争论。美国商务部长努钦直言，美国-墨西哥-加拿大协定(USMCA)是未来美国与各国谈判自由贸易协议的模板。USMCA的可怕之处在于，它引入了TPP和TTIP中有关劳工福利、知识产权保护、原产地原则……等等一系列高门槛，川普政府以此为标尺，逼迫贸易伙伴在美国与「非市场经济国家」之间选边站队。这是痛感强烈的致命一击！\n\n10月5日，驻加拿大使馆发言人杨云东愤怒回应，中方坚定支持以WTO为核心的多边贸易体制，支持建设开放型世界经济，反对在WTO框架外杜撰「市场经济国家」和「非市场经济国家」等概念，实质上这是有关国家为推卸自身责任、拒不履行自己所做国际承诺所找的借口，是不诚信的表现。我们对有关国家公然干涉别国主权的霸权行径表示谴责，对有关国家经济主权受到损害感到悲哀。\n\n毋庸讳言，显然狠痛、非常痛！既不想……又不想被屏蔽在美欧贸易圈之外，难！\n\n尾篇 一叶知秋\n\n出于特殊国情下的特殊需要，有关媒体刻意让瓜民听到的声音，多数时候只是代表有关部门想推动的趋势，抑或说想看到的结果，而并不代表他们自己也是这么认为的。好好琢磨下这句话。相对于瓜民了解到的有限真相，有关部门做决策依托的信息显然要丰富、真实得多。所以，不要总抱怨自己目光短浅，实在是因为你掌握的信息量太过少得可怜哇，而建立在谎言和意淫上的结论无疑是靠不住的。\n\n10月4日，美国副总统彭斯在华府智库哈德逊研究所发表演说，从贸易、人权、干预选举、南海冲突……全面阐述了川普政府今后的对华政策。有鉴于这篇演讲足以媲美「铁幕演说」的价值，看完后悚然无语。一贯优雅自信的小华姐姐疾言厉色的谴责就是最好的注脚！\n\n无独有偶。10月5日，2018年二十国集团工商峰会(B20)在阿根廷布宜诺斯艾利斯落幕。国内工商界发表声明，坚决反对B20提交的政策建议文件。号召反对，但到底反对什么呢？不知道。你只能从字里行间逗漏出来的内容管窥蠡测，关键词是反对「片面突出国有企业扭曲市场竞争等议题」，这就是无比鲜明的态度！结合此前「理直气壮地做优做强做大国企」调门，有关部门的取舍不难窥测到吧？\n\n结语。四十年来觉一梦，东还是东西还是西，二战后世界秩序的书写权从来未曾易主。已经或正在打算迁徙的人大可无视，而故土难离者则要好好思量一番了。少说话，勤思考，擦亮眼睛，锻炼身体，争取安度一生。舍此之外，名利皆身外之物，够用即可多攒无益，多余的都是为他人做嫁衣裳。毕竟，在特色框架内，多数人的眼光、见识和手段，并不比马云爸爸和金锁妹妹强些。前车不可不鉴。"
		},
		{
			"post_id": 4,
			"title": "（信用卡知识九）银行内部审核信用卡标准大揭秘！（附测试评分）",
			"date_published": 1539398069.456,
			"body": "#### 转帖\n\n“为什么我每次申请都不能通过”、“为什么我征信良好，银行要拒掉我的申卡请求”。别急，今天给大家讲讲，银行内部到底是怎么审核和评分！！！\n\n1、收入多少\n\n因为职位不同，所从事的行业不同，工资薪水自是不尽相同。一年的总收入有多的就有少的，当然，年收入越多越有利于得到高评分。申请人的收入越高越好，收入越高，申请下来的信用卡卡初始额度也就越高。\n\n银行评分参考：\n\n年收入低于3万元，评分为2分；\n年收入3-4.5万元，评分为5分；\n年收入4.5-5.5万元，评分为10分；\n年收入5.5-7.5万元，评分为16分；\n年收入7.5-9万元，评分为21分；\n年收入10万元以上，评分为24分。\n\n2、工作时间长短\n\n申请人工作时间越长越好，工作时间越长，评分越高，能申请到的初始额度也就越高。\n\n银行评分参考：\n\n工作时间少于6个月，评分为0分；\n工作时间为0.6-1年，评分为3分；\n工作时间为1.5-3年，评分为10分；\n工作时间为3-5年，评分为16分；\n工作时间5年以上，评分为21分。\n\n3、是否有银行流水\n\n银行流水是你跟银行频繁交易的凭证，若你有工资卡的话，最好在工资卡所在的银行办理信用卡，下卡的概率和大额度的概率会更高。\n\n银行评分参考：\n\n没有银行流水，评分为-8分；\n在银行拥有1个账号，评分为0分；\n在银行拥有3个以上账户，评分为6分；\n如果发卡银行为代发工资银行，评分为8分；\n申请人有6个月结息，评分为12分；\n有一年以上定期存款，评分为24分。\n\n4、有无住房\n\n住房证明这一项也是蛮重要的，填错一笔，你的额度很可能就会少一大半儿，或者说是申卡无缘啦。所以，住房时间尽可能写的长一些，最好提供6个月水电发票。\n\n银行评分参考：\n\n申请人为短期租房，评分为0分；\n申请人为长期租房，评分为2分；\n申请人按揭中房产，评分为10分；\n申请人全款房产，评分为16分；\n申请人房产价值低于100万，评分为18分；\n申请人房产价值大于100万，评分为24分；\n其他情况为-2分。\n\n5、信贷记录\n\n也就是征信记录，千万不要有银行逾期记录，直接影响批卡评分。最好有银行的供车、供房的记录，因为可以看到你不但有资产，而且还款能力也不错哦。\n\n银行评分参考：\n\n申请人没有信贷记录，评分为-2分；\n申请人有3天内逾期记录，评分为-6分；\n申请人有担保记录，评分为-4分；\n申请人有供车记录，评分为6分；\n申请人有供房记录，评分为10分。\n\n6、申卡记录\n\n不管是申请信用卡也好，还是申请贷款也好，在你的征信上都会有申请记录的。频繁申请不仅会影响你的评分，还会给银行造成你很缺钱的错觉。最佳的申卡记录是12个月内申请3次，评分最高！\n\n银行评分参考：\n\n申请人1个月内申请3次以上，评分为-2分，\n申请人1个月内申请3次，评分为0分；\n申请人3个月内申请3次，评分为2分；\n申请人6个月内申请3次，评分为6分；\n申请人12个月内申请3次，评分为10分；\n没有申请记录，评分为-4分。\n\n7、有无银行理财产品\n\n也就是你去申请的银行里购买理财产品。这可以说明两点：1、足以体现你的个人财力和还款能力；2、相对为银行做出了贡献。银行也是会“以礼向报的”\n\n银行评分参考：\n\n申请人没有银行理财产品，评分为0分；\n申请人有5万短期银行理财产品，评分为5分；\n申请人有10万中长期银行理财产品，评分为10分；\n申请人有20万以上短期银行理财产品，评分为8分；\n申请人有50万以上短期银行理财产品，评分为12分；\n申请人有100万以上短期银行理财产品，评分为20分。\n\n得出的总分值，可参考的审批额度：\n\n25-55分 （0.1-0.5万元）\n55-65分（0.5-1万）\n65-75分（1-2万）\n75-85分（2-3万）\n85-95分（3-4万）\n95分以上（5-7万）\n\n而外资银行和国内银行的审核也有所不同。下面是某外资银行的评分标准，申请外资银行信用卡可参考：\n\n本科学历=160分；\n征信良好=220分；\n征信查询次数低于4次=60分；\n年龄大于25岁=50分；\n社保/公积金=0分（外资银行不在乎）；\n行政编制（正科及以上）=500分；\n大型私企/国企中高层管理=300分；\n中小型私企=200分；\nCitygold理财 50w=680分；\n\n可以发现，外资行注重理财和征信。我们也不难看出，各家银行的标准是不一样的，面对这复杂的局面，要想成功秒下卡，就得掌握好两大原则。\n\n此外，申请信用卡还有这些加分项，看看你能不能达到这些条件。申卡额度7大加分项（参考）\n\n1、婚姻\n\n已婚＞未婚单身。银行的模拟评审系统中，在同等条件下，已婚的可以得到比未婚的整整一个级别的信用提升。\n\n2、技术职称\n\n有各等级工程师、经济师、会计师、优秀教师等职称的，往往得到加分。\n\n3、工作\n\n稳定性较高的行业能获得加分。如公务员、教师、医生以及一些效益好的企业员工，时尚行业和媒体人士由于具有较强的消费能力，评级也会偏上。\n\n4、经济能力\n\n经济能力：本行有大额存单，以及可靠的收入证明，能得到比较高的评级。\n\n5、住房\n\n个人住房：个人名下有住房的比没有住房的申请人，下卡额度更高。\n\n6、征信\n\n征信记录良好比征信白户或逾期用户的下卡额度更高。\n\n7、学历状况\n\n大学本科及以下文化程度的，信用评级没区别，研究生以上的评级会高一点。\n\n电话回访技巧\n\n一、记住申请资料，最好复印一份随身带着，比较重要的事项要记在脑子里，比如：单位名称、紧急联系人信息、家庭住址等能证明持卡人个人诚信度的信息。\n\n二、提前跟公司前台/朋友打好招呼。申请表上的单位固定电话是最常被回访的渠道，需要申请人提前跟前台接电话的行政人员打好招呼.\n\n三、卡片邮寄地址回答有讲究，尽量选择将信用卡寄到单位地址，这可以侧面证明我在这家单位很稳定。邮寄到家，虽然方便了自己，却可能让银行误以为你工作不够稳定。\n\n四、无关问题怎么回答？现在银行的回访有时候也会搞点小手段，比如会问你一些无关紧要的问题，来测试你的信息是否正确：比如可能会问你为什么单位电话没人接听？（你可以说可能前台出去了），又比如你认识你单位的某某吗？（你可以说可能有，不熟）等。\n\n电话回访没有问题了，就算通过了复审，一般就会批卡，之后，银行会制卡、发卡。\n\n最后温馨提示：申卡两大原则\n\n1.不要广撒网，乱申卡，看准一家。\n\n不下之前别转战他行，新人申卡保持在3家内。原因很简单，如果没有房车和大量的砖，对于普通人来说，批卡就靠社保/公积金/所在单位/流水/征信下卡的，这里面最麻烦的就是征信，因为征信查询次数被扣的那些分，是你不能下卡的致命条件。\n\n2.选择对的银行申卡\n\n不能乱申卡，那选择适合自己下卡的银行便很核心。\n\n一般来说，主流商业银行的下卡标准，只要拥有社保/公积金/单位资质不差，满足这三样其中之一，便能愉快的下卡。\n\n做完测试后，我拿到85分左右，你能达到多少分呢？大家留言吧！"
		},
		{
			"post_id": 3,
			"title": "倪萍大姐终于走了！{转贴}",
			"date_published": 1539395428.25,
			"body": "【脊梁走了】倪萍终于移民！内地知名艺人——前全国政协委员倪萍，近日被爆与丈夫杨亚洲已经移民美国，两人在美国拥有两套房产，第一套在赌城拉斯维加斯，另一套在洛杉矶。倪萍还在美国注册公司，大有一展商才之意。\n\n记者为核实传闻，查询了相关记录，找到了相关购房契约，证实一对英文名字为 Yazhou Yang 和 Ping Ni 的夫妇分别于 2012 年和 2014 年在美国拉斯维加斯购入两套住宅。\n\nYazhou Yang 和 Ping Ni 应为杨亚洲、倪萍夫妇的拼音写法。\n\n导演杨亚洲与倪萍多次合作，两人于 2005 年低调成婚。\n\n这夫妻俩真是天造的一对、地设的一双。丈夫是知名导演，专拍爱国电影。倪萍是央视主播，大红大紫、无人不知。她曾经是全国政协委员，经常在央视煽情，挥洒热泪，表演爱国秀，在她当了多年全国政协委员后，她告诉记者‘我从来不投反对票，因为我——是爱国的’，因而被授予 \" 共和国脊梁 \" 称号。\n\n现在，他们终于移民美国了。\n\n他们在中国赚足了眼球，也赚足了金钱，他们将财富转移到了美国，开始了人生最滋润的享受。\n\n他们完成了人生最华丽的转折，由他们卖力弘扬的 \" 一颗中国心赤诚不改 \" 转折到了 \" 一颗美国心永远真爱 \"。\n\n因为是导演和演员的最佳组合，因为名气太大，他们的移民过程同样充满戏剧性。他们完美导演了移民三步曲。\n\n第一步，倪萍在加拿大高调举办画展，据说是因为她的国内粉丝大多移民加拿大了。这个时候，网络传言倪萍移民加拿大了。于是，人们开始寻找她移民的证据，但是，她并没有移民。此举非常成功地转移了人们的视线，也告诉人们谁说她移民谁就是造谣。\n\n第二步，就在她成功转移人们的视线、辟谣移民传闻的同时，他们在美国购房和移民的手续正在悄悄进行之中。\n\n第三步，就在网友们发现自己被愚弄之后醒悟之时，倪萍两口子已经在美国高调定居了。此时此刻，国内的风雨已经淋不到他们了。"
		},
		{
			"post_id": 2,
			"title": "女维权律师【隋穆青之妻】被警察强令脱衣羞辱",
			"date_published": 1539395370.285,
			"body": "据广州公民梁颂基描述，昨日（2018年9月20日)下午三点，他到广州市荔湾区十八甫*路17号华林街派出所查询其本人在该所辖区发生的被伤害及被合同诈骗案，路上偶遇被扰乱国家机关工作秩序罪的周建斌妻子李小贞，遂一同到达派出所。\n\n下午五点左右，一名女士（后得知为被吊照律师隋穆青的妻子孙世华律师）询问一名正在派出所内行走的便衣男子：“请留步，我是来办某某（后来得知为访民周建彬）的案子的，请问你能不能XXX”，敦料该便衣男突然掐住该女士脖子并反别其左臂死死的顶在墙上（孙女士被顶得几乎双脚离地，身躯痛苦地扭曲着）。梁颂基上前劝双方冷静，期间未与任何人发生过身体接触，却在不到30秒的时间内被一群警察（大约15人）抓了起来（右臂被强行反背，疼痛难忍）并以涉嫌XX罪（梁未说明何罪名）为由强行留置派出所到晚上九点左右。梁在派出所受讯问期间，听到孙女士的惨叫声，似乎受到了欧打。\n\n隋穆青律师在得知此事后，拨打110报警，但110拒不出警。荔湾区华林街派出所一警察并且告知，他奉命转告110指示：110无人出警，如果拨打110超过一定次数，以扰乱警方工作秩序论处。\n\n隋先生在推特上写道：110怠于履责，却恐吓报警律师，真是岂有此理！ 我们要求派出所提供诬陷孙世华律师的警员姓名、警号和协助其犯罪的一女警，派出所却以避嫌为借口拒绝提供。由于我们不断致电110，坚决要求其依法出警处理，荔湾区公安分局督查终于派员到场为孙世华律师做笔录，但坚拒我们同行三人陪同（另外两位是孙世华的律所同事）。 如今半个多小时过去了（此时约凌晨02:25分），我们仍在派出所大厅等候，派出所却突然放下了电闸门。不由想起了一句电影经典台词：关门，放狗。\n\n蔺其磊律师在电报上所转发消息：我们现在来到广州市荔湾区华林街派出所，要求110派员到场就华林街派出所警员诬陷孙世华律师袭警继而非法拘禁并强令其脱衣羞辱，及进行6个小时不断重复内容的询问（目的想找到借口行政拘留、或刑事拘留）一案固定录音录像证据。\n我们要求110派员到荔湾区华林街派出所取证、处理，我们有充分理由怀疑华林街派出所为包庇警员犯罪，销毁相关录音录像证据。接线警员先说会派人，又说不派人，一会说上报领导，就是不肯出警。\n警察就要互相包庇犯罪吗？\n律师办案被警察碰瓷继而非法拘禁并以检查为名强令女律师脱光衣服进行人身羞辱，世所罕见，太恶劣了！\n\n另据大纪元的报道，【隋穆青】表示，可能因为他的缘故，所以他太太的这起警察构诬陷案社会反响比较大。“包括北京的女律师、政法大学的校友，她们表示自己也收到过类似的羞辱，所以她们因此都不想做律师了。”\n\n他强调：“所以这个事情影响非常恶劣，引爆了很多人的受辱经历。原先她们是忍气吞声，人没有被关、被抓，过去就算了，但是我们是要求追求警察的刑事责任。”"
		},
		{
			"post_id": 1,
			"title": "记录日常看到的一些好文章",
			"date_published": 1433033779.604,
			"body": "平常从网上或者1024会看到很多不错的文章，没有地方保存，刚好保存到这里来。"
		}
	]
}