{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1611260804,
			"title": "ZeroNet Copy-And-Pass Project",
			"body": "As many in the public are now looking for alternatives to proverbial big-tech, I am setting out on a project to install ZeroNet on some affordable flash drives that can be passed around to personal contacts.  The idea is to ask people to buy a few drives if they can, copy, and pass them on - so on, and so forth.\n\nIdeally, I would like to incorporate a ramdrive into the build which would then only store locally what the user wants - the ramdrive and torrent server persisting for several hours - the idea being that 'viral' content or interest would thus still be supported even if not more permanently stored and served.  Has anyone else done something similar?  I know that in the past, people were concerned about particularly imageboards and encountering content which is illegal in their country and that the virtue of seeing the content meant it was being stored locally.  In theory, this can be muted individually and the computer will remove it - but the ramdrive would help address this concern and also combat zite bloat - particularly the case of social media.  IE - you would save locally all of the posts from people you follow, but simply ramdrive what you're perusing through - helping to serve it up for a few hours to deal with viral phenomena, but not having to allocate disc space for everything you want to view.  Or would this likely require the zite to be coded to integrate this with the distinction between ramdrive and local?\n\nObviously, the idea would be to make all of this as seamless as possible so that entire ZN users files aren't being copied around (in fact, I might want to see about creating a more secure login system... the current ID system assumes that the person with physical access to the computer is the person the ID points to - which is fine for right now, but for other applications should be hardened), with an introductory video explaining how ZN works and differs from what many people are used to as an internet experience.\n\nDoes anyone know of any similar project which has been incorporated into a build or distribution?",
			"added": 1611260803
		}
	],
	"topic_vote": {
		"1611606727_1LPWdVJ1GNU738u2VUkoZdw9B7u4VPmfNZ": 1
	},
	"next_comment_id": 107,
	"comment": {
		"1565077480_1N86m5tuMjDQoXoocDpPVzY9dcRPC7MnuU": [
			{
				"comment_id": 1,
				"body": "> [qzvb](#comment_1_112qygFRivJWmQ4d9hfWf2Ns5yk2Jh1zDZ): Where's the place to go on Zeronet for anons? I see a couple different places but where's the main spot?\n\nThe 08Chan board is popular... well... just became very popular.  So is here.  ZeroNet is kind of like a new internet... you're back in the 90s internet, basically, so it's a little rough around the edges and bare bones compared to the experiences many have become accustomed to.  Welcome to the Internet as it was supposed to be.  Well... from an architectural standpoint.",
				"added": 1565130039
			}
		],
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": [
			{
				"comment_id": 4,
				"body": "> [theosis](#comment_9_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): Do you really think that there is a need for people who use youtube/twitter/reddit?\n\nI know, right.  Those deplorable, backward degenerates should just be the labor for our properly cultured and elite society.  Or, better yet... just dead or dying.\n..... Sometimes, the more things change, the more they stay the same, am I right?",
				"added": 1565203198
			},
			{
				"comment_id": 5,
				"body": "> [theosis](#comment_18_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): I don't want to sound as elitist. More like a defeatist. Common sense says that the majority of people don't care about this stuff. And they won't magically start caring about it en masse. P2P networks and other decentralized cryptoanarchist tech will always be a \"tree house club\" of dissidents. The important thing is for us to have that ability to communicate at all, for those who need it. Because corporations will no doubt do everything in their power to suppress all dissenting opinions on the internet. Successful competition with Facebook and Youtube may come as a byproduct of that goal, if and when we reach critical mass of developers and enthusiasts so that p2p tech will grow. [...]\n\nI think it's a difference in mentality.  You were looking for a tree house club to enjoy the little bits of freedom between the hours at work.\nI'm a bit different.  In the lingo of anime - I'm something a bit closer to Satsuki Kiryuin or Gilgamesh of Fate/Zero.  To me, this is a weapon - a much needed one.  It's a weapon and a structure/plan/model in one.  These mongrels would have me tread upon the ground like a pig in human clothing - I shall crush these false gods beneath the heels of mankind.\n\nGranted, I'm being an eccentric character, but I much prefer this idea to that of a literal war - or am willing to give it an honest effort, first.  Freedom isn't just a release from the stresses of slavery.  It is a standard to be fought for and imposed upon the lives of tyrants.  While I admit to being a tyrant, it is as a tyrant of tyrants.  As anyone who searches this name will well understand (or is already familiar).",
				"added": 1565206549
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 6,
				"body": "> [wejehteman](#comment_2_1EJorU3nHcCViXXzD7BkmyJzwgqxqC2Zuv): I wonder if the peer count could be an attack where if a botnet shows up with 9000 peers, and your computer connects to 200 of them, then chances are that all 200 connections are the botnet. Then the botnet simply doesn't send you new updates.\n\nThis scenario would also occur naturally if you had a massive influx of people who don't know the particulars of how ZeroNet works, and failed to seed/track properly.  The base ZeroNet client is not designed to try and create a \"transparent\" experience that is 'just like using your browser.'  At least - not insofar as ZeroNet itself is concerned.\n\nA more proper build would actually be a bit more greedy, in my opinion, and appropriate more resources for itself to use by default to support the network, since most people aren't going to think about it if we get a massive surge of popularity like we are.  Small sites that don't consume much in the way of space are not going to notice it as much, but the larger the site, the more prone it becomes to a smack of sudden interest that doesn't mean harm, but also is just trying to check out what is going on.\n\nZeroNet wasn't really to the point in its development where it was anticipating a large surge of interest among the average person.",
				"added": 1565338383
			},
			{
				"comment_id": 7,
				"body": "> [08admin](#comment_1_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): Make sure you go to the ZeroHello \"3 dots\" menu for the site and use \"Check Files\" and then \"Update\" before you go to the trouble of deleting.  The site change has to propagate, so it may take several minutes to get it.\n\nAs of right now, I am completely unable to post.  The page hangs at \"processing post\" and will not accept the ZID.  I've probably gone the 'too extreme' route and have wiped out all data and tried redownloading, but it seems the seed base is either weaker than anticipated and/or the changes are propagating very slowly and I'm still being served the old zite instructions.  I could simply be too impatient and need to wait.\n\nI have noticed that ZN seems to hang a bit, too, so it may need to wait for people to come in and restart their clients if they are frozen or doing things they shouldn't like mine seems to do from time to time.",
				"added": 1565344040
			},
			{
				"comment_id": 8,
				"body": "> [saythenword](#comment_4_1PK8e7ccdA28Xi8mDbmZd6SLQSgZaxDAzg): I can actually see less posts on 08chan tonight, than I could last night on the same install for some reason. [...]\n\nMine were pretty much culled back to the BO's posts.  There was a brief period in time where another anon was on and posting, and I could see his posts and I believe some of the stuff he'd seeded, but I was unable to post at that point and trying to figure out what was going on.\n\nThere was an attack on the board last night - someone ran a script to flood the board and generated a new ID each time - so generic IDs were disabled for posting purposes and we have to go through ZeroID now... I think that is how it is supposed to work.  I'll check again, but I am pretty sure I'm still down.",
				"added": 1565350445
			},
			{
				"comment_id": 9,
				"body": "> [undisclosed](#comment_1_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): I'm beginning to think that BO made some error in response to the spamming.  I have two directories on a removable drive.  The first one will bring up the complete 08chan, and update.  However, no peers will take my posts.  The second one was a fresh install, after the implementation of ZeroIDs.  That's the one which is now stuck updating like you and others have noted.\n\nEven before the update, mine would hang at like 20k files left to download - but at least it was keeping up with activity on the site.\nIt could be a problem with the update, but it could also be a combined problem in zeronet, especially if seeding has become centralized and what another noted down below is indeed the case, and we have a situation where it's a needle in a haystack in terms of finding someone who is actually seeding the site.  I also saw connected peers take a nosedive.  I was up over 8k before the update, then I got hammered right back down to 100 and it's risen back up to around 1000, now.  It could be that we're seeing an artifact of a site change propagating across a network of thousands as opposed to dozens/hundreds.  Since it's not a central server pushing the updates to everyone, everyone needs to check with everyone else to see if they are the most up to date file(s).  So long as everyone you poll for an update has the old file, you will think you're up to date - until the authoritative change takes place.",
				"added": 1565351119
			},
			{
				"comment_id": 10,
				"body": "> [undisclosed](#comment_2_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): I thought that was the case at first too, propagation issues.  However I can load the whole package with my first instantiation, and see new post activity there.  It's only the genericID disabled version that's hanging now.\n\nkek... we've got a fork in the zite.  Or ... something.  So, when they get the propagated site code dished out to them, they'll get squelched?  Alas, even on ZeroNet, auto-update should be turned off.  The more things change, the more they stay the same.",
				"added": 1565351644
			},
			{
				"comment_id": 11,
				"body": "> [undisclosed](#comment_3_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Never was enamored with the forking idea, and BO has not been fully transparent with the reasoning.  At the very least could have documented the changes and / or additions.  That's legitimately got anons almonds activated, as it would be expected from a glow nigger.  I'm not lurking two more years, so I would expect Acidman to check this thread and at minimum keep the communication flowing.\n\nI think people are on edge, and it's understandable.  I also think that this is exactly what you would see in the instance where someone was a little too trusting of technology and/or inexperienced in a development role.\nBy a fork, though - I meant just in terms of site revision.\nI think AcidMan is genuine in that he created the board long ago during the gamer gate fiasco, mainly thinking of it as a place where he and his friends could meet if things went south.  ZeroNet was a means to an end for him in terms of it just got the job done, and the name popularity of 8chan served to keep it rather popular on ZN, which was, itself, virtually unknown or only commented on.\n\nNow it's seen a sudden surge of activity, and it's not like Acid is a full-time web developer.  08 was the product of weaponized autism in the building of a bunker, and once the bunker was made, no one really thought about what would happen when the nukes went off.  Now we're here, and he's still got a day job when we are used to a completely different standard where a server and web team is constantly on call and on staff.\n\nAnons are going to do what anons are going to do - I think we are at a point where we are accident following betrayal staged with a strike - and it has everyone spooked.  I'll be looking at the millboard source code and I am sure others are, as well.  If things are really that bad, I am sure other zites will pop up with similar functionality, and we can pick one as a sort of hub.  That's the strength of this platform.",
				"added": 1565353942
			},
			{
				"comment_id": 27,
				"body": "> [08admin](#comment_2_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): I've been tinkering with the site trying to get a fix for all files to show under the new cert.  If it seems to be especially wonky, look for posts my be talking about progress because I might be just fucking with it at the time you're trying to do something. [...]\n\nSo, I left the whole thing open overnight to see what would happen, and things largely appeared 'fixed' after I let it update (though I didn't try posting).  I did notice a rather large loss of content - entire boards being gone from the list that I'd never muted.\nI went ahead and cleared everything out to reset the zite to see what would happen, and I'm back to exactly the same problem I was at the beginning.\n\nI'm thinking we might have an issue with changes not propagating - some seed that is preferred for distributing here in the U.S., or something, that is not updating their seeded files and it takes a long time for my particular connection to find the most up to date one.  I've got only about 200 megs of the board after hours of having it set to \"download and distribute all\" - so, something is certainly choking the system.  After expanding my tracker listings, I've noticed I've been seeding a bit more, generally, over ZeroNet, but it seems we might be looking at either an issue of not enough seeders (and therefor peers are competing for files), a lack of protocols for which files to prioritize for seeds (IE - a valid request for the site script and more recent files presides over older files), or some combination thereof - because I'm just not getting data from my current connections, at all, and the zite is identical to what I had yesterday after it did, eventually, 'heal.'\nEdit: I am only getting about 16 connections.",
				"added": 1565455049
			},
			{
				"comment_id": 28,
				"body": "> [ayylmaolol](#comment_18_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): At this point it might be better to just relaunch 08chan or migrate to millchan.It's surprising that this change is causing so much problems for some, i can still post in 08chan and see things fine, but its obvious that there are many people who are not able to join back in for some reason.\n\nI will give Acid some time.  That said, the people I am trying to look out for are getting harassed endlessly and moderated off of halfchan.  Endhcan is ... I have no idea what the hell that is all about, but it is obvious that is not viable as their domain extension changes every time I turn around.  Voat has closed down its membership applications (or at least that was last I heard).  So, we need a place that functions and that is relatively open to membership.\n\nThere's some glorious bastards holding down the fort on /bant/ in half, and I salute them - but it's not viable as more than being a signal flare for where to send everyone - and right now, I don't have a place to send them to and there's already substantial confusion over what ZeroNet is that will have to be battled.",
				"added": 1565458981
			},
			{
				"comment_id": 29,
				"body": "> [ayylmaolol](#comment_20_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): Thats good. Immediately jumping ship because one thing doesn't work out for one day is too fast. But you can use millchan or just post here in the meantime. Being able to easily launch another site is kind off the thing about zeronet. And there was even another imagboard on zeronet afaik.The ordinary clearnet sites have no real future, will always get shut down or get into financial problems (probably what happened to voat now) or are honeypots like halfchan.\n\nI think most sites will choose to move to this type of platform, eventually.  Particularly if it can be made a bit more robust as a 'replacement for the web.'  There's little barrier to entry, in theory - bandwidth can scale to interest/usage - so a viral instance will just result in viral growth of available servers.  It's rather hardened against data damage/loss.  For many sites, it's more bandwidth-efficient (think of mainly static data servers).  Hard drive space is cheap for many users and the average person never comes close to filling it.  Governments could get involved (government seed servers) and not inherently fuck everything up by trying to make it a 'public utility.'\n\nThe biggest obstacle would be convincing owners of large datacenters to hop aboard this type of thing, but I imagine we would still need them for real-time streams or other services.  Valve would practically shit itself to jump on here, as they could basically get free distribution by peer-to-peer networks and only need to stand up an authorizing server with a master seed for steam.\n\nThere are some challenges - we are looking at a relatively small labor of passion over the past five years versus a standard of industry for nearly 20 with a history of 20 years prior to that as a research platform, so we are very much in the 90s in terms of where we stand, but even so - it's on top of a very robust base to build from.",
				"added": 1565460703
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 12,
				"body": "And...?\nThose IPs aren't static entities.  They need to contact the issuing company and then have the accounts of those IP addresses for that time period leaked.  And that isn't exactly it, either, since the IP they have isn't really \"our IP.\"  It's a proxy the service provider uses to route onto the backbone of the internet before it deconstructs the true target on their end. \n\nThey are absolutely terrified.\n\n> [tinktinktink](#comment_10_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): R\n\nIt was probably them who ran the spam bot on 08 last night.  I would imagine it might have been the author of this article (or his buddies), but proving that would require government action and seizing his computer with some forensics.  Lot of effort in a world of pushbutton warfare.",
				"added": 1565357357
			},
			{
				"comment_id": 13,
				"body": "> [almostsoul](#comment_2_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): The point of P2P isn't anonymity in the first place though. The point is that it is virtually impossible to take down the site, so they're still completely impotent.\n\nIt's fear porn.\nThey've been playing up the misconception about IPs for a long time, and various Internet security companies and VPN services have absolutely no financial incentive to correct them on the matter.  Consider how quick they were to inject the idea that 08 was a honeypot into the narrative (and who pushed that narrative very hard - define false flag), and who has been trying hard to portray this platform as some kind of terrorist hideout.\n\nI'm not trying to say that ZeroNet is part of any proverbial plan, but it does seem rather clear that they have a vested interest in keeping people contained in Twitter, halfchan, facebook, etc - all of which glow so hard they have an HRC rating, just some a bit lower than others.\n\n... kek... I just realized what I did there.",
				"added": 1565357908
			},
			{
				"comment_id": 14,
				"body": "> [aspidochelone](#comment_29_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I don't think it was Javascript.  NoScript only reports the one 127.0.0.1 script in Firefox, i.e. ZeroNet's own software.  I would assume that the reporters used a firewall or the like to monitor what real connections occur peer-to-peer (in Firefox developer tools it doesn't say, it's all 127.0.0.1). [...]\n\nThey can't destroy it.  Not without shutting down TCP/IP entirely... which would only serve to unplug everybody from their botnets that have them throwing milkshakes and waving guns at each other.\n\nThey can really only make it inconvenient to use until we harden it against an attack vector - or scare people into not using it, since it is a platform that requires a considerable amount of user initiative to set up, learn, and use.\n\n> [styromaniac](#comment_915_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Some app for Android gave me IP addresses of ZeroNet connections. Of course this doesn't mean an IP address belongs/points to the user, as you're all saying (could be VPN or Tor exit nodes). [...]\n\nThe only time I've ever run into any kind of issue with someone \"discovering my identity\" was when I posted on some buzzfeed articles (faceberg) and some guy who may very well have been a glowing, prior member of the chairforce decided to follow me back as a rampaging left loony.  He sent me some interesting direct messages, as well, like \"you will be the next school shooter\" and some fun stuff like that I was sure to screen shot and post back at him.  I keep my account public there because of reasons that some would understand if they saw my profile.  Anyway - he got a little miffed that I was giving him the run-around and tried to play an \"AHA\" game on me.  Since, in response to his \"you will be the next...\" comment was to entertain a hypothetical about what investigators would think of his harassing me if I did, then, turn around to harm someone - he tried to use that as a basis for filing a police report that I had intent to go whacko and harm people.\n\nI live right next to the police department, and so it was all settled and I went to work about five minutes later while he was still gloating about having called the police on me.  He left me alone when, finally, two weeks later I told him that the officer closed the report within five minutes of his call.  It was fun.\n\nPeople are more at risk in those glowing social networks than they are anywhere else.  Upvote/emoji culture is psychologically manipulative/addictive, and they've developed tactics specifically to enrage people while they have bulk data collection methods to identify people who display signs of instability and they think they can trip.  I would argue it's a matter of national security - but it's like trying to scream into a hurricane.",
				"added": 1565359918
			},
			{
				"comment_id": 15,
				"body": "> [capitanjack](#comment_6_1DNJ1b7d7bqeZHigy35ZKBwwe8PBv8o7Gk): To be honest on imageboards that might happens very often.\n\nI will quote Akane Tsunemori, here:\n\"The law does not protect the people.  People protect the law.  People have always detested evil and sought out a righteous way of living.  The law is a collection of these people's feelings.  It is neither the provisions, nor the system.\"\n\nIn short, we decide what is illegal.  Not the FBI, not the judge.  Not even the legislators, really - they are there to write down what we can come to agreement on as being the letter of the law.  Granted, the quickest way to get a contempt of court charge is to mention jury nullification - but a jury is the only power in a court room that can overturn the letter of the law in a specific case (and legal precedent is technically unconstitutional the way it is currently practiced - judges do not write the law).\n\nConsider - does walmart get in trouble for facilitating drug trades in their parking lots?  No - that's not the intent of the parking lot, and just because the platform is utilized by a criminal party does not mean the platform shares in the crime.  If someone posts CP to a board that I'm seeding, I am a victim - or perhaps better - a witness to the crime, rather than a participant in it.\n\nTo be fair - if someone is seeding CP and they then get notified that they are by investigators into who is seeding files, then there is a question as to whether or not it is a crime to, as a general policy, not mute anything seeded to you - and by what means does someone determine what is an illegal file - sure, CP is bad, but in the age of thought crimes, hosting the wrong version of a history book could be considered a crime by certain regimes.  So - there is some debate there over exactly how to handle illegal files seeded to the network and how much power we should grant law enforcement in terms of enforcing a removal of illegal/harmful files - but in terms of a legal fiasco, I don't really see one that doesn't already start with a kangaroo court.  And if we are truly to the point where kangaroo courts cold be used to start hauling us in by the dozen, then we're at a \"do or die\" point in terms of the obvious.\n\nAt any rate, I do expect \"mod streams\" would begin appearing that would mute users across the network and/or files in torrents that various investigative teams have decided are unacceptable.  You voluntarily subscribe to a tracker that would keep you from seeding or seeing CP or other such things.\n\nI do agree that in the meantime, though, it's probably a better idea to use some variety of service to prevent a headache from happening in the event some FBI field office of glow-hards wants to try and make an example of someone they can throw the book at.",
				"added": 1565362798
			},
			{
				"comment_id": 17,
				"body": "> [brc](#comment_1_1PbE1kSUtFkARsNmxtEBqZyJwShpiQzJKF): No new posts coming in on the boards. Are we done here?\n\nNo, it's just a bit of a bug on the board at the moment.  The board owner published an update after we got spammed, and it doesn't seem to work as well as he thought it did before he either went to work or to sleep.  So, it will be a bit of a hiccup.  If it's not resolved by time the weekend is over, I'll get a board going over the week.",
				"added": 1565364203
			},
			{
				"comment_id": 18,
				"body": "> [aspidochelone](#comment_31_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): They can certainly connect your IP to the file they are downloading from you. [...]\n\nSee my prior.  We determine what the law is.  If the enforcement of the law includes servicing the interests of criminals, then we must either redefine the letter of the law and/or replace its language and/or enforcers.\n\nFrankly, this is it.  We are here because we have played the \"hide\" game.  Hiding.  Hiding.  Protecting.  Protecting.  From blatant abuses of authority and the law.  If we are going to try and play that game and let them own that type of behavior as the law, then we are done, plain and simple.\n\nWe must fight that kind of behavior and the corruption in the law that enables it.  By due process first.  By any means necessary failing that.  I don't think I can make this any more clear or state this any more strongly.  If they REALLY want to play those games/tactics, then the only way to fight it is in the courts or by way of trees of liberty and watering them.  And we should counter every time they try it - they are the criminals and they know it.\n\n\"Enough of this hide by day, move by night routine.  Let's bust out into the open and see that cracker try and stop a tank.\" - How did the plot to that movie go?  \"Tank\"  Worth reviewing.\n\"We are not running FROM the Law, we are running TO the law, Bill.\"",
				"added": 1565365219
			},
			{
				"comment_id": 19,
				"body": "> [prologic](#comment_1_12fWKDf6FpQhpQua3g1UkA1z6AxHSF1d2p): I can't even sync properly on TOR for 8ch. And why did the majority of users stop going there? I swear, they talk about the culture war and the very real war against our governments and corporate yet run back to mommy government and corporate the moment they have a chance? What kind of pathetic behavior is that? I thought these people were more based, but apparently not. All bark, no bite, they don't actually care about freedom and privacy.\n\nWhat are you talking about?  08chan on here?  Or 8chan proper?  8chan proper is, at least as far as I know, dead in the water.  You can connect to view what has been posted by bypassing DNS, but that's it, posting requires DNS to work, and that's been killed.\n\n08 is having a bit of a hiccup at the moment because of an anti-spam method that was implemented by the board owner, and the guy works for a living unlike some people - so the board is going to have problems until he gets back and can either revert the changes or fix his implementation.  But that wasn't really the point of your post, now was it?",
				"added": 1565366643
			},
			{
				"comment_id": 22,
				"body": "> [anonkraut](#comment_20_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh): article is so boomer, I can almost smell the monster ultra from over here\n\nShoebat of all people.  He was an interesting red pill for many people on Islam... poisoned, to be sure.\nThese people glow so hard they manage to illuminate the truth, somehow.  It's so consistent I can't tell if they are just that stupid or if they are on our side and deliberately playing melodramatic theater that flies over the heads of their masters.  \"It's so stupid it loops right back around to being genius.\"\n\n> [nickwa](#comment_277_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Some users were paranoid(mostly Q people), saying the FBI lured them in.\n\nThat narrative did quite a bit of damage.  Many anons didn't understand that Q was linking to fake maga accounts on twitter quite frequently, and that there was a sort of doublespeak to what he was saying - and good luck explaining that amid the enthusiasm and rah-rah.  The media already had in place some prominent supporters/accounts to inject controlling narratives into, and I was tracking their injections to the 8chan board.  While not all of the popular ones glow, you don't need a lot of people to set the direction of a herd in flight from a threat.  Which... is kind of ironic, but it's how most people are, at least at first.  Instinct has kept us alive, not necessarily free.\n\nBut, now there is spill-over of Q people into other media, and it's kind of working against the media.  The shutdown of 8chan is probably also beneficial if there is a plan, per se, because right now it's not going to make sense to a lot of people and that board could be used as a centralized means of injecting paranoia (at least the twitter leaders of fake maga are going to hold to their script of trump-supporting).  So, in terms of keeping people from getting spun up and on the edge of violence because of media shills on 8, this is probably not the worst thing at the moment.\n\nThis place isn't quite ready for the general public yet, anyway, and it gives us a bit of time to shore up the infrastructure a bit and polish some of the brightwork.\nThe thing about beating back the water with a baseball bat is that you can get in some really good swings and smack that water silly ... but it doesn't change the outcome.",
				"added": 1565377514
			},
			{
				"comment_id": 24,
				"body": "> [bigbadbob](#comment_100_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): When i finally come to a place where i feel comfortable... the room is empty.\n\n> [28eb9](#comment_16_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7): last I checked, 08chan alone had something like 1700 seeders\n\nI'm trying to seed... I think I'm seeding... the problem is that the board is broken for me at the moment after an update was distributed to try and address a spambot we had come through.  Someone is still posting to it, somehow.  I can't, and while the post counts increase on some of the boards (though it seems like only for new posts since the update), the only posts I can actually see are the board owner's.\n\nSupposedly, people using the old package can still post and use it, but for those of us who don't have that archived....\nI'm giving it until the end of the weekend (I work weekends, anyway) - and if it's not getting fixed, then I'll go ahead and stand up a clone using millchan engine.\n\n> [bober](#comment_34_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): >be tech illiterate q-larper neonazi idiot [...]\n\nThe actual concern they had was when they loaded up the board, saw a thread named \"CP\" and then there were quite a few people telling them that they were downloading and seeding child porn.\nPol had their hand in creating that misconception.\nSo, by all means, please dance and celebrate with these journalists.  It makes things rather clear.",
				"added": 1565382001
			},
			{
				"comment_id": 25,
				"body": "> [bigbadbob](#comment_101_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Is it a busy place? like lots of posting and interaction?  I just doubt the risk is worth the entertainment.  Iive been blackpilled.  i doubt ill find the same shit over and over entertaining.  < if that's what it is,  i dont know\n\nDepends on which group you follow.  Pol has been psy-opped.  As you say - you've been blackpilled.\nThere are other groups that have sprung up with the aim of being more productive/constructive.  But, that's kind of antithetical to people blackpilled into embracing nihilism and praying for the shooting to start.  So... there's a reason pol actively works on behalf of the media to sabotage Q.\n\nIt's kind of like I've said - they've been psy-opped so hard that they don't realize they're glowing when the clowns aren't around.  It is what it is, and I understand - I was in a similar state of mind for a while (though it was over some other issues that most people on pol don't really know about - look up operation cyclone, then ask why there's a monument to al-qaeda in bosnia that the clintons love to visit... and what goes on at porto montenegro).  So, there's a reason I have some hope.\n\n> [bigbadbob](#comment_105_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): so its progressed beyond white shaming?  I dont use it.   Been think of trying to set up anon account but they dont make it easy\n\nTwitter has an HRC flash rating of 2 in terms of glow.  The only reason I really go there is to track fake maga from time to time or to leave a comment or two here and there to counter a narrative or maybe seed a question in the head of someone.  Hard to tell who is real there.\n\n> [28eb9](#comment_25_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7): the straight up \"kill white trump supporters\" people are obviously still a minority, but you have big accounts saying how \"white supremacy needs to be eradicated\", as well as big news sites conflating white supremacy with AR15's and shit.\n\nKeep in mind, it's just like halfchan pol, but the pots can't say nigger and post black cocks.  They'll stand up accounts with females in the profile picture who will say dismissive things toward men (they've done the research), and other such stuff. The bots (organic and silicon) will upvote competing comments to try and humiliate.  Very manipulative for the upvote and smiley culture.",
				"added": 1565383526
			},
			{
				"comment_id": 26,
				"body": "> [bigbadbob](#comment_109_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I try to seek personal balance and not follow any group.  When i say blackpilled i mean all the craziness has wore me down.  It was a good day when i realized im not as crazy as the world appears to be.  The attack on free speech is real\n\nWell, I will say this - regardless of who else may or may not have a plan, I do - whether it comes to shooting, or we are served something of a miracle - it's all included.  It doesn't require anyone to follow me, per se - but I will say that you're not alone in this crazy world, and I've been to many places in the world and at many levels of it where I wasn't alone.  Things are a mess, but many are like you on both the left and the right.  The clowns are putting on their costumes and fighting each other in the arena and many of the people at the rave are starting to get worn down as the clowns go full PCP high.\n\nMost of the outrage and insanity we are seeing is staged and fake - not that real people don't get hurt or die - but that the people doing these things and spinning the narratives about them are largely fake.  Most people are good.  I know that to be true.  We've just been led to believe in different precepts of good - and we're approaching Peak Morality, of sorts, where the black ops think they can drag the left across a line that good people don't want to cross even when in a deluded state.  And even though the right is being spun up by black ops on their side, as well - no one really wants to have to go out and cause harm to another person.  It's easy to get people spun up and arguing... not as easy to drag them across the line to hurting each other.\n\nI have a friend from long ago, she'd recognize this name and I'd get in trouble if she saw it - but it is what it is.  I won't get into why she is on the left - but she got drawn into it and was of the 'male violence is a problem' category.  Not to the level of pussy-hat wearing or that crazy - she was never much into that kind of signalling, but she was very much a rather hardcore feminist and when we were younger, kind of a rebel against the idea of classic family structure.  She recently expressed something to the effect of \"When we were younger feminists, we were going to go out and work hard to be bread winners and fight the patriarchy.  Ten years later, I kind of feel like dropping out and having children.\"\n\nI think things will eventually pan out.  The question is whether or not the time that has been stolen from my generation and others can be salvaged at all.  I worry that a lot of women are going to wake up at 35 and be like \"wait a damn minute... it ends with me...\" and it's pretty much too late.  We're dangerously close to that point, but I think we'll be able to clear the door, particularly if some of what I think is possible in the world of health comes to fruition soon.  Call me naively optimistic - but it's what I plan to see through to the end.\nWe do have one thing right - boobs are a hell of a motivator.",
				"added": 1565385912
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 16,
				"body": "> [xcape2net](#comment_199_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): If @nofish dies, no one's limit would increase, because he and he alone holds the keys to ZeroTalk.  Also, he has written almost all of the ZeroNet code, so I'm guessing coding would stop.  I guess what would have to happen would be effectively a fork of ZeroNet.  I hope someone more knowledgeable will correct me if I'm wrong about this.\n\nYou're also talking about a system that went from, perhaps, a couple thousand users to over 15,000 users in less than a week and seems to be growing interest geometrically.  The fact the network absorbed that kind of traffic with no additional modifications to begin with is turning heads in the world of networking technicians/admins.  There have been some hiccups, but there are a lot of eyes on this project, now - and since it is basically a system that floats on top of a database using torrent files to update the database in a distributed manner - you could actually run ZeroNet using a completely different piece of software - such as a standalone browser, and you wouldn't really need to change how the torrent system works, much.  There may be some optimization routines launched for seeders to use that would condense hard disk usage down by hashes and owner indexes (how many people 'own' a copy of that file and where are they considered to own it - useful for larger pictures and movies where content could be posted and deleted).  Since the two systems are theoretically compartmentalized from each other, you could build off of it almost any way you wanted to without harming the network, as I understand, at least.",
				"added": 1565363962
			},
			{
				"comment_id": 20,
				"body": "> [kaffie](#comment_938_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Zites are independent of the ZeroNet platform. If nofish dies, development would largely stop on the platform, unless someone forked it and continued on. All of nofish's zites, such as zerotalk, zerosites, zeroup, etc. would effectively be unmoderated and for the ones that aren't a merger/hub site, people will end up running into posting limits. They can all be cloned though, and posting limits raised. For merger/hub sites there won't be any interruption, as you can easily just make new hubs/clients. [...]\n\nTrue, a Zite would.  There again, as I said, this is getting a ton of attention it wasn't, before - especially among decentralized enthusiasts who like such things.  Like the crypto-currency developers.  Monero, for example, uses some interesting systems that could apply to here - decentralizing ID issuing/verification, allowing for transfers of ownership under various conditions, etc.  There are a lot of problems that other groups have already solved for their respective networks that could solve some of the issues still present.  There is a ton of enthusiasm.\n\nTake things like namecoin ... it kind of exists in a vacuum.  Many of the various cryptocurrencies are looking for a way to be more than a speculative investment - and coupling functions of this type of network to the completion of tasks in a crypto-currency system, for example, could give rise to a way of helping to give incentives to datacenters to start up seeds (we are still infrastructure bound, to some degree, if this thing becomes too much more popular, our ISPs are going to shit bricks because they need to invert the download to upload ratios on our networks).  It's kind of hard to see where all of it would go, exactly - and the other reality is that the underlying database doesn't necessarily dictate the platform viewing it.  So long as the implementations remain largely accessible via torrents, then you could have several different systems, theoretically, floating on top of the same data network, just utilizing it organizing it a bit differently, but still contributing to the whole.\n\nIt's kind of hard to see exactly what will rise out of it - but it has no doubt begun sparking the desire for change in the internet - and the media's shenanigans are only helping.  To the extent I almost have to wonder if they are playing us and only pretending to be against us.  But, there again, we've proven the moon isn't there when I am not looking, so some questions have to be left as they are.",
				"added": 1565367909
			},
			{
				"comment_id": 21,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_727_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11):They hate the model we live in just as much.\n\nDepends upon exactly which ones we are talking about, but, I'm aware there are some people in some very high positions both in terms of economics and blood who are displeased with the state of things.  Blood can run thicker than wallets, though.  Either can be pure or tainted.",
				"added": 1565373707
			},
			{
				"comment_id": 23,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_729_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you need to destroy first, 'then you can create'you can't 'create on bad basis'are you willing to contribute to 'my piece of work' [...]\n\nThis is a rather quaint view.  We are not mere beasts who are slaves to our bodies or impulses.  We are toolmakers and the bearers of fire.  While it is true that we have overlooked the family structure and unit in many cases, to believe that we are incapable of developing tools - as we have for everything else - to enable us to negotiate that challenge, would be incredibly savage in terms of thinking.\n\nIt is true that things rise and fall in cycles - there is death and rebirth.  Yet, again, we are not slaves to the forces of the world.  Where there was no food to graze on, we built farms.  When the weather was too cold we dressed ourselves in furs.  This idea that we need to destroy our civilization so that it can be rebuilt into something from the Georgia Guidestones is rather Orwellian, and I am more than aware of that particular goal/plan and its details.\n\nI am something of a taoist.  Destruction doesn't bring about creation; one does not gain a creative power because they have destroyed.  Only when one has obtained true insight into divinity can one truly create something that isn't from the existing world, and it is a fleeting insight.  There is a big difference between realizing that the cycle must be fulfilled and directing its course versus believing that bringing about destruction will somehow reward you with creation.  To that end, we differ in our choice of directed course.\n\nThe gift of fire did not make mankind nearer to gods.  It placed mankind above them.  Understanding not just the relative cycle of things, but the absolute trend is also important.  Just because society goes downhill after a while doesn't mean the trend is downward.",
				"added": 1565379187
			}
		],
		"1565458487_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 30,
				"body": "Metacrawler would be very interesting to clone on here, and give whole new meaning to meta.\nExpanding millchan/engine to be able to work with something like a myspace or faceberg might be worth thinking about for the average user.  Might kind of drive home the point when all your timeline are belong to us - but at the same time, the fact people want to connect with each other in the real world using the internet isn't a bad thing.\n\nSort of on the metacrawler idea - a way of giving zites a way to 'front page' or catalog themselves beyond just a text listing would be kind of neat, as well as contain reviews/feedback.",
				"added": 1565463373
			}
		],
		"1565515280_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 31,
				"body": "Of course there will be zites and methods to enable such things for a zite.  It's always been possible for a zite to be scripted to not load data from a user or a post.  It's much more difficult to affect how trackers work on a network scale, however, and so even if a zite is scripted to enable distribution of censorship profiles (effectively), then that same data can be viewed outside of that zite using one that doesn't have that censorship profile.\n\n\"Cloud Storage\" of files could be done - but again, you are looking at computers and systems as they are, now.  Hard drive space is cheap and embedded solutions are common.  Raspberry Pis standing up a multi-terabyte seed server on your home network would be immediately doable for the consumer market.  If you're worried about data collection - then, by my reasoning - if one of us is going to be naked, then we should all be naked.  The current system strips a person naked and tosses them in front of people who still get to keep their clothing on to pass judgment.  Agencies and others are going to do bulk data collection (as well as companies) - not only should they be participating in the internet, but that information is ours.  So, if they get to look at it - we do, too.  Only fair.\n\nYou can launch services built around centralization via this platform - but you can't really force them - and the data for them would be very difficult to maintain centralized.  A zerobook would have its data seeded all over the place, and censorship or abuse of the zite would result in someone cloning the zite to use the same data.  One could use encryption - but then why would you seed a zite that was using up that much storage space and also locking all of its data down behind encryption?  Even if you gained popularity and success via that strategy, the moment you go radical censorship - no one has a reason to host you, anymore (unless they particularly agree), and users have copies of their raw data that can be resubmitted to a zite that has not censored them.\n\nThe only way to impose some kind of strict regulatory authority would be to have governments going around and literally being jack-boots to kick in doors and knock out every seed.... virtually at once.  If that's going on, then zeronet is a tertiary consideration.",
				"added": 1565523731
			},
			{
				"comment_id": 32,
				"body": "> [gitcenter](#comment_538_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Care to explain?\n\nIt was a rep from one of the more shadowy fraternal orders out there.  Like to think they know things - which, they do know a couple things, but this is like saying: \"I know epstein wanted to kill off most of the planet but the people related to him\" - par for the course in their circle.  They'll talk in rather vague philosophy and try to pretend to have some kind of wisdom related to the existential - but in the same way that the director and writer of Star Wars Episode 8 thought he was being witty and clever.  \"Invert everything and you're smart!\"\n\nThey like to think of themselves like Prometheus, but take themselves too seriously.  They may bear some light, but it's because they're glowing that hard.",
				"added": 1565524163
			}
		],
		"1565689573_1JjyvqhjWDqSncWvSoGxAGKr4SNXr1Kwpi": [
			{
				"comment_id": 33,
				"body": "Freedom.\nOne could suggest that if 'we' or 'it' has a view, it is closer to anarchy, but there is a difference between what someone advocates as an ideological concept and what one supports as reasonable policy.  Absolute anarchy would be a complete lack of any rule (even tribal or leaders among groups).\nYou can come here and discuss anything you want - the nature of the platform makes systematic censorship nearly impossible, so even if I were to say: \"we are staunch supporters of the Empire of Vers, here\" - it's not like anyone can really enforce one topic or another.  Generally, you would expect to find people who feel their political views are being suppressed here - or giving vent to ideas/frustrations that would be squelched in other locations.",
				"added": 1565699573
			}
		],
		"1566448853_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 34,
				"body": "The chief problem with cryptocurrencies is one of accepted value.  The reason gold or silver has an obvious value to it is that even if just considered a base metal - its purified form represents a proof of work.  Someone had to dig it out of the ground and then refine/coin it - and no one would reasonably part with their product of that work without a perceived equivalence of exchange.  IE - the miner didn't just give up his work for nothing, and so on and so forth.\n\nWhile cryptocurrencies have, embedded in them, a proof of work, exactly what the value of that work is as it relates to the real world is not currently known, and their power as a fiat currency for settling debts is relatively minor.  To that ends, they currently represent investment classes in speculative markets.  The mining of bitcoin, monero, etc currently serve primarily their own accounting function.  Etherium was on the right track in terms of trying to embed some other use for the CPU horsepower consumed than the preservation of the network, though I do have issues with Etherium's overall philosophy/design.  I'm much more a fan of Monero/XMR as a hypothetical monetary replacement, but, again, it will not likely become a true replacement for money until the function of the cryptography sequence (mining) becomes a valued asset to society, itself.  If XMR were also used to, say, run parts of ZeroNet, then you might have a situation where the value of XMR mining and website seeding would combine to create an ecosystem where there is a tangible value to the mining of a cryptocurrency, giving it a value above and beyond a simple investment asset which allows it to couple into economic exchange as a medium of that exchange.\n\nI'm not really all that enthusiastic about the oil-backed cryptocurrencies and the like coming out of government powers.  They are not entirely bad ideas, but the place they are going to run into problems is that the physical production of oil is not a uniform process with regard to invested energy and return thereof.  This is actually part of the problem Venezuela has been experiencing with regard to their oil and other problems.  I will avoid a complicated geopolitical assessment no one really cares to get into, but at the end of the day, if there are more claims of oil existing than there are available to serve up, then the currency is devalued.  Setting a room full of ASICs or server racks to process cryptocurrency hashes is much more simple than getting people to dig stuff out of the ground and a system which would be able to inflate or deflate the supply of that currency based on the production of a resource loses its validity as being anything other than a futures claim by another name.\n\nAs for \"Quantum computing is gonna put an end to cryptography\" - no, it isn't.  While quantum computers do offer a wide range of possibilities for computing - not only is there a lot of confusion over exactly what it can do (we are still at the phase of testing theories on 'programming' one - we don't even have a true machine language constructed), there's also a problem in that quantum computing requires a full length segment to be decoded.  If you wanted a key for a block cypher that is 256 bits, then you would need at least that many bits and one fully decoded block to identify the key.\nThe problem is that without going far, far larger, to decode entire segments (and assuming the encryption routine doesn't start flipping things around between neighboring blocks - the circuitry for doing this in an ASIC or FPGA is cheap compared to the geometric expansion of quibits needed) to identify common words/phrases in text or headers for encrypted file structures and help rule out false positives.  None of this, however, works in a system where keys are generated randomly and you must have all or most of a key for it to work.  If you were decrypting a large sum of text, then, yes - you could skim for common strings in speech and you would be likely to hit on one, somewhere, and be able to resolve a solution.  Trying to use this manner of attack on a cryptocurrency would require you already have a sufficient penetration of a target to obtain keylogger or observed data to obtain their key(s) - or some other exact information allowing it to be matched by the infinite improbability processor.",
				"added": 1566458951
			},
			{
				"comment_id": 35,
				"body": "> [xcape2net](#comment_344_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): An infinite supply of cryptocurrency can be generated; therefore, in a free, rational market, it will not have a long-term, non-zero value as an infinite supply is generated.  [...]\nExcept they can't.\nSure, I can create my own cryptocurrency, but it has zero relevance to any other cryptocurrency on the market.  I can't use a bitcoin to buy a unit of etherium, so why would anyone holding etherium trade it for a bitcoin or some other cryptocurrency unless they saw it as having comparable value?  Sure, I could create a new cryptocurrency, and I am sure there are some people who would invest in it, therefore it would have some market capitalization - but it's nonsense to suggest that Monero, Etherium, or Bitcoin would suddenly lose value because some other cryptocurrency emerged.  Unless there was some particular reason for those cryptocurrencies to be utilized or valued, then their ability to siphon away market capitalization would be severely muted.  Further, this is an entirely different concept from inflation as - at least in theory and according to the principles of a properly designed cryptocurrency, the number of coins can't be manipulated at whim by a central authority.  Some cryptos have a built-in inflationary mechanic, others are designed to be deflationary, etc.\n\nWhile I have no doubt the same economists who told people gold had no place in the modern economy will tell you that they can just whip up a cryptocurrency and it's the same as inflation - they are also the same spreadsheet warriors responsible for \"information economy\" dogma and other such things that sounded good to ten year old kids in school.",
				"added": 1566522831
			},
			{
				"comment_id": 37,
				"body": "> [xcape2net](#comment_351_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I've given what I think are very good reasons for thinking no cryptocurrency will survive over the long term.  I've not heard good reasons for why you think they will.  I'm open-minded and willing to listen to anyone who can refute my arguments based on something other than feelings and wishes.  \n\nIt's not really our job to convince you.  Cryptos don't live or die based on your opinions.\n\nIf you were really doing as you stated, and reading what has been said, then you also know I have already answered every single thing you have ever said on the subject in my first post on here.  I tend to do stuff like that.\nThe main reason why cryptos are \"investments\" is because they are not involved in anything tangible to the market.  They are still currencies, not a money.\n\nIf, however, as I said, you were to do something like tie ZeroNet or some other system utilized by people to the function of a cryptocurrency - IE - the mining of that cryptocurrency was now more than simply supporting the blockchain and was, also, supporting a part of our world - then that particular cryptocurrency breaks out from being a currency or investment class and into being a real money - at least insofar as that system maintains relevance.  There are situations where bars of gold have no relevance to the economy - though we generally recognize those as some kind of post-material utopia or some variety of apocalyptic tragedy.\n\nYou could argue that, sure - for most cryptocurrencies, there can be any number of clones - but even returning to that argument for a moment, the issue is that in a world of cryptocurrency, market capitalization would be denominated in some variety of crypto or another.  We wouldn't use \"dollars.\"  We would be asking how many btc or xmr something is, as opposed to referring to a federal reserve note, and we would be standardizing values of cryptocurrencies in another cryptocurrency.  Even if you wanted to argue that clones could create an inflationary principle, the math works against you.  If we are using Bitcoin, then there will only ever be x bitcoins.  Creating one clone gives you the ability to, at best, double the currency supply and thereby half the purchasing power.  However, a second clone only reduces the purchasing power to a third.  A fourth clone to a quarter, and so on.  You would need to not only create these clones, but you would also need to persuade investment into them sufficiently to split the market cap.  Each one would, also, need to be recognized by exchanges and/or retailers for direct exchange.  Why should I, running my own business, accept CloneCoin 20 and keep its exchange rate updated when it's functionally equivalent to Coin1?  You would need to create and persuade users to invest equally into CloneCoin 0-99 to get to the same degree of inflation we have seen under the federal reserve.\n\nAgain, I have no doubt that there are economists who find the above scenario not only plausible, but inevitable, and are already reading up on how to create bitcoin clones.  I have no doubt they believe that they are geniuses who know how the world works.\nI also have absolutely no doubts, myself, about how that will work out for them.\n\nNow - I don't know if the coin that is going to survive exists, yet.  It may.  It may not.  Bitcoin may be the netscape of the blockchain technologies - or perhaps it's better to compare it to the darpanet of such things.  XMR may overtake it (it certainly has more advanced features built in).  Some other coin that doesn't yet exist, integrated more firmly with something more practical than just burning CPU cycles , may appear in the future that outdoes everything else on the market.  But the concept will survive and something will eventually realize the goal.  We just won't know we've reached that goal until we have already long passed it.",
				"added": 1566647124
			},
			{
				"comment_id": 38,
				"body": "> [xcape2net](#comment_359_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): This is a reasonable argument, and I can only respond to it by giving my speculation about how people would react to your scenario.  So, let me argue semi-logically from the other direction.  If there were in the world only one cryptocurrency, say bitcoin1, and I look at that and say, \"Wow, bitcoin1 is really valuable.  Why can't I just create another 100 million units of cryptocurrency identical to it called bitcoin2?  I could make a pile of money, because people will look at bitcoin1 which sells for $20000 per unit and see my identical product that only sells for $2 per unit and say to themselves, 'Why should I pay $20000 for something that I can get for only $2?'\".  I think investors would agree with that and be willing to invest in it.  As a result, exchanges would be willing to make their customers happy by carrying it.   \n\nMy counter to this is that we see nearly the exact opposite behavior from people/customers in practice.  While some businesses will always see some degree of activity by virtue of law of averages, the law of averages as it pertains to economics is not entropic, but generally  Gaussian - or standard distributions/deviations.  Sure, I could start up some variety of cryptocurrency, today, and maybe make a few thousand dollars of market cap.  Getting above that is going to be very difficult for the same reason that stealing market share from established businesses is difficult.  While some of this is down to anticompetitive market practices and the like - even in situations where there is low barrier to entry, the market is usually dominated (at least within a cultural boundary) by two to three main market competitors at any given time, with an upper bound of around five.\n\nI speculate the mechanism behind this deals with what has been coined \"Dunbar Layering\" - whereby we view businesses as social constructs much like individuals, and can really only process as 'intimates' a few at a time.  Experiments have verified that people do not deal well with infinitely expanding identities.  While I agree that in a raw \"what can generate profit\" sense in terms of a crypto market, your argument is valid - there will always be someone trying to game speculative investment - the same can be said of companies and corporations in the stock market.  Why don't I just go out and constantly create new corporations that would, surely, generate some investment activity?  Sure, there is a cost barrier to entry, but while we do see these types of scams, the market generally entertains them only minimally.\n\nThe other thing I will point out is the underlying logistics.  Long before Bitcoin became popular in the public, it was spread by enthusiasts who believed in the idea and who built and trialed the blockchain.  These were dedicated individuals who offered up time, computing power, developmental skills, etc to create what is today.  Bitcoin, and virtually all cryptocurrencies, require that many people be willing to give that crypto computing power to operate.  A situation where there are an infinitely expanding number of individual block chains requires a similar scaling or redistribution of computing power (to some degree or another) - at least in terms of people running it.  This, again, strikes back to the social aspect.  At most, people would entertain about five different cryptocurrencies at any given time - that means, at most, each individual is only likely to run five.  Sure, some sharing programs exist to try and automate which coin you are mining at any given time, but most people set those to maximize prospective earnings on their hardware - so you are generally going to be bound to market cap as it pertains to your computer's hash rate - so only the largest market caps are likely to be run on such programs, and there would be little incentive to add a new one unless it was fundamentally different or somehow was made more profitable to mine (which requires substantial investment from somewhere, and in such a way as to counter the profitability of larger coin markets).\n\nBasically, the only way this would work is if we expanded to a fully automated system of coin hashing algos and some kind of unified value index of all coins you own that we use for trade, instead - but the transaction fees of each coin means that having value distributed across large numbers of coins increases the tax on utilizing it as a liquid asset - so while some diversification would not be a bad idea, the situation where you have one coin in each clone of a crypto among an automated array would be extremely ill-advised as large transactions would see a massive tax relative to if those coins were in a single crypto.\n\nIn short, nothing is stopping me from cloning bitcoin, today, other than no one has any reason to run it on their computers and I would, maybe, get a few thousand dollars of investment.  Maybe more, maybe less - but it took bitcoin years to become popular - and it was one of the first of its kind.  The same people who spray thousand dollar bottles of wine all over a room just to not be outspent by the next table may be willing to throw money at a brand new crypto from a smooth talking individual - but they're also willing to spend a thousand dollars on a bottle of wine they are buying just to not have a smaller bar tab.  When the printing press attached to their ass is removed, those people will be serfs in a matter of five years.",
				"added": 1566681825
			}
		],
		"1566538598_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 36,
				"body": "Well, you see.... there was once this place called \"Gradec...\" now known by \"Graz.\"  \"Slov\" in the root of old Slavic languages means \"Pure\" - it is the root of how the Virgin Mary is addressed in Church Slavonic used in the Eastern Orthodox Church, if that gives you any idea.  Have you played \"Endless Legend?\"  The Vaulter's faction is really interesting.\n\nA lot of interesting things come out of Eastern Europe because it has been between three major powers.  You have Rome (\"The West\") to the 'left' - Russia to the 'right' - and marauding arabs 'below.'  They've been run over by nearly every major conflict for the past two thousand years, or more.  Whether it was Alexander the Great, Napoleon, one of the Mustafas - someone's always been charging some army or another through their home.  Hell - they were raided so bad by the Ottomans that they nearly lost their language - Church Slavonic comes from the efforts by the Russians to more or less preserve what is, today, the various Yugoslavian dialects.\nSpeaking of... always rather odd how every major western power loves to try and invade Russia.  Because, you know, everyone is jealous of being frozen half the year.  I don't know about you, but I've never looked at Russia and thought: \"I really need to spend lives and resources to own that.\"\nI suppose that is just what hamburgers and brambleberries think about - but I digress.\n\nSo - they are going to have a very different view of how things should be - and, I would argue, before the Treaty of the Golden Bull, had largely their own way of doing things.  Who we see as the kings and authorities of territories during that time were simply those recognized by the Church (Rome) and who commanded centralized power.  If you look back to how many of the older societies that had this system of governance forced over them - they had councils and other such things long, long before it was codified into something like a Constitution.  If the kings and queens were the figure heads - the old tribes were still who they had to broker with to hold real power.  If you trace the lineages of many of the kings/queens of Europe, you'll find many of them tie back to a Montenegrin tribe - the Romanovs did, in particular - and if anyone were to know whether or not Anastasia really survived, it would be that tribe.\n\nPlaces Bosnia, Kosovo, and Madeline Albright in a different light, now doesn't it?\n\nThe big popularity boom to Zero Net came from the advertisement of 08Chan as being related to 8Chan.  The post was made by Gab, a 'twitter for conservatives' of sorts.  The Eastern Star, as I was once told, is \"grannies and casseroles\" - you'd be amazed, however, what said grannies and casseroles can accomplish.  Of course, you'll also find a lot of interesting characters from Eastern Europe in Anime... wonder why that is.",
				"added": 1566593605
			}
		],
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 39,
				"body": "To simplify the argument to be certain I understand - you are basically saying that the nature of free software requires that anyone be able to utilize and modify it, but that there is, also, no restriction on how that software can be used.  So, I can theoretically make a program for free that is picked up by a corporate system who then modifies the code to sell their modifications as an improvement/service?\n\nWelcome to the software version of: \"Do I file for a patent and have the Chinese copy it - or do I not file for a patent and have corporate espionage put it in the hands of my most powerful competitor?\"",
				"added": 1566682422
			}
		],
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 40,
				"body": "I'm not completely against the idea of a sort of \"report crime\" app - which I would prefer over a sort of Orwellian state with cameras and microphones behind every potted plant (which... we ... kind of already have, as I'm typing on a device with a camera and mic and I am sure, if they really wanted to, they could sit an comment on what my 'typing face' looks like).\nThe problem is that this simplifies crime reporting, which isn't necessarily a good thing.  It takes effort to call the police, file an official report, etc - or to actually go to them.  This type of application makes hyperactive reporting of crime very easy to do and can actually decrease the quality of police investigation.  More data doesn't necessarily mean more accuracy or more relevance.\n\nCrime reporting should be accessible, but making it something that people in a tussle can whip out and try to use as a cudgel against each other for pedantic disputes is not going to go over well.",
				"added": 1567476907
			},
			{
				"comment_id": 43,
				"body": "> [bigbadbob](#comment_572_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I have to wonder if snitching would actually improves ones social score.\n \n\"Social Credit Scores\" are designed with control in mind.  The goal is to attempt to not only quantify morality into a single metric score (but IQ is racist), but to also arbitrarily establish what acts define a moral or immoral person.  Share a \"fake news\" article (as determined by the Ministry of Truth) and you take a dock to your 'social credit' system.\nAlready, if you're on social media, you'll find it swarming with types who insist they can get you committed to a mental institution for discussing a 'conspiracy theory' or just saying things that are more complex than \"I felt like saying something.\"  The left has already been primed for this type of system where they can dispatch their digital Mujaheddin into social media and forums to not only get people banned, but to try and couple all of this to a system of who is and is not allowed to speak without finding themselves having to report for mandatory zombie pills.\n\nSo, even before they are getting paid in hookers and blow to be clowns, they are more than primed to get off on the sensation of destroying other people - with or without justification for doing so.  Not that I can claim to be the coolest head out there, but where 'we' express an extreme opinion, they are more than willing to high-five each other when you're dragged out and raped in the street while preparing their heartfelt and polished remarks for twitter.\nI'd rather deal with people who have a completely uncontrollable mouth and strict control over their hands than people who have strict control over their mouth and uncontrolled bodies.",
				"added": 1567651133
			},
			{
				"comment_id": 49,
				"body": "> [bigbadbob](#comment_588_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I can proudly say that zeronet is the closest thing to social media i have ever partaken in:)\n\nI come from internet forums (bboards) back before myspace and facebook were a thing and we used MSN messenger when we wanted to elope.  Those were the days....\n\nMany people don't understand just how much tracking is done at the institutional level - and by private companies.  You probably have a smart-enough phone.  It doesn't matter what the interface looks like - what matters is what is running on it.  If it can support, say, a facebook or google application - congratulations, both institutions know every wireless router you will ever come within range of.  If it supports geolocation data - it knows the rough physical location of each of those routers and can track them.  Any piece of hardware that then contacts those routers can geolocated, within reason... if they really want to put the bots to work crawling through the network topography, and what do you want to bet they do?\n\nEvery mobile phone these days has at least one camera and one microphone while being an effectively open data connection.  Even if the device is off and the contract with the carrier is cancelled, by virtue of how those devices are made to work, they can be turned on by someone in a tower.  Think bigger.  Speech recognition technology is readily available and deployed on most phones (speech to text) - I see people all the time choosing to talk to their phones rather than type something out.  This does not drain as much battery or require as much CPU power as many people seem to think - phones are extremely powerful these days, more powerful than many desktops we were using even ten years ago - and they only needed a tiny fraction of their clock cycles to parse our speech (the problem was mainly in the method and indexes used being insufficient - not because of processing power).  Let's say I want to trigger a phone to record or take snapshots when it picks up certain keywords.  Done.  It can then do a burst data communication when it gets within range of a tower.  This would require a lot of paperwork for the government to do legally - but you can install applications that literally tell you in their TOS that they reserve the right to do just that for ad purposes.\n\nWebsites are so slow these days because most of their content is all programming and scripts for your computer to run for advertisement purposes.  They track your eyes on the screen to tell what ads you looked at, what ads you didn't, whether your facial reactions indicate like/disgust/etc.  It's not necessarily about watching everyone masturbate to hentai - and then getting a laugh when they pretend to be disgusted in public - but about collecting endless metrics to learn how to better structure things to manipulate people into thinking and behaving as they want.\n\nConsider all of the above - do you think google's algorithms know the voice of my friends from my own - using our phones?  Even people without phones can, in this way, be tracked just because of the saturation and penetration of technology into the personal sphere.  Facial recognition algorithms try to pick out people you know - As people say \"Yeah, that's my uncle frank and this is his facebook!\" - why could that same system not be asking: \"So... who is this other face ... and why don't they have a face in our book?\"\n\nThis is another huge advantage of zeronet - its very nature makes it far more difficult to load zites up with countless fucking ads that go to nowhere - and creates very little incentive to do so in the interest of server hosting - popular zites would get generally more hosting support.  While some zites and features would need to 'go direct' in terms of functioning more similar to how current websites work with plugins and modules that point to various servers - you can more easily control the pathway used to execute a zite's instructions and view its files.  While it's possible to do mass data collection on everyone using ZeroNet, at least it's all open source data collection and not squirreled away on secretive server caches that companies lie about having.  That - and there are some potential ways to create some genuinely anonymous networks using ZeroNet and the buzzword blockchain - but that's not anywhere near implementation yet.",
				"added": 1567756747
			},
			{
				"comment_id": 51,
				"body": "> [bigbadbob](#comment_592_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Back then if people could have seen the future they would have said \"no chance'\" but now they say \"i have nothing to hide\"\n\nPerhaps.  I think what we are looking at was largely inevitable, though.  It's easy to label people as foolish for their decisions - but it's just that generally good people tend to be most numerous and see the world through their own eyes.  While, certainly, the generation in which every person has a picture of them being drunk on facebook and doing something human will be interesting candidates for President, at this rate... I also think this whole approach has backfired.  People seem to have hardened themselves, to some degree, against the manipulation tactics.  Much of the collapse of the left into hyperbole seems to be driven by the patent refusal of people on the right to entertain the censorship, projection, and droves of chatbots as being real/relevant.\n\nAt this point, even if their plot to throw the election to Trump via digital vote fraud to then blame on Russia had worked - so few real, flesh and blood people would buy the \"Russia is plotting to kill us all\" drum up to war they were going for that I highly doubt their manipulation campaign would have succeeded in anything more than a revolt among the states that reminded California and New York of their reliance on food and supplies from everyone else.\n\nI certainly think there are dangers beyond those - it's the long game that concerns me in terms of overall depletion of the people espousing our cultural values in favor of demographics who have not yet been devastated by birth control.  That's the formula for a Roman collapse, right there, as the \"Senate\" is depleted of its blood.  This technology has absolutely horrifying implications when it comes to that.  Its use by the PRC and others is rather concerning.\n\nIf we survive this whole ordeal - I think we will see some very interesting cultural and legal paradigm shifts evolve out of it.  On the bad side of things, no one has any privacy... on the flip side of that, getting a more consistent view of who we are beneath our social facades something of a first for population-level things.  While we are seeing small groups of people try to leverage this against us in the present, I think the potential for this to be turned around to a beneficial thing is far greater - even if we were to completely disavow computers and never bring them into our society, again (unlikely), the lessons learned about ourselves as a species will be very important, I think.",
				"added": 1567792798
			},
			{
				"comment_id": 53,
				"body": "> [bigbadbob](#comment_597_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): These are numbers of active monthly users.\nLook at that first number for a minute.  Monthly Active Users.  Is 1/3 of the world's population REALLY posting monthly on Facebook?  So... everyone outside of China and India has a Facebook?  I'm just saying... I'm skeptical.  For a while, bot farms to try and drive up interest in your site/page were actually cheaper than the expected advertising gains.  Hell, in some cases, the cost of hiring a bot net to inflate your statistics to elevate your ad revenue was less than the ad revenue you'd see from the bot net.\n\n\n\n> [numismatist](#comment_93_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Https://news.yahoo.com/amphtml/amazons-ring-camera-raises-civil-211456191.html [...]\n\nNow that is interesting.  There is a story I've had in the works for a bit that entails a \"loss scenario\" for us.  IE - we lose, humanity gets enslaved by an orwellian computer matrix, etc etc.  However - the desire to create mind-machine interfaces results in \"impressions\" that get left behind when we die.  So, you could talk to the virtual assistant of your great grandmother and it would be able to respond very, very closely to how she would or to at least call forth relevant quotes.  This results in something of a runaway process as technology condenses to a more arcane subject than one of public understanding and old personalities from before the consolidation wars (or whatever you want to call them) begin to get worked into this from old world user data and tracking indexes.  In short - if you've seen: \"Expelled From Paradise\" - you end up with a situation where a machine intelligence not only becomes sentient (and arguably more human than the humans), but rather than becoming the harbinger of humanity's doom, actually sets out on a mission to save humanity from the shackles of enslavement that were guarded and maintained by the criminals of politics and finance - because it thinks and reasons on information as a human would, and finds value in the things we find value while being able to more accurately/consistently evaluate facts.",
				"added": 1567805366
			}
		],
		"1567266468_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 41,
				"body": "> [theecollector](#comment_50_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): the real problem zeronet has is the fact they do ZERO advertising! N really why would they, there is no money to be made... Zeronet is really nothing more than a very good dream and a hobby... this further proves my point that coders while very skilled and smart just dont have the same knowledge that a real businessman has... Cuz if they did then zeronet would be making money outside of donations. This is the same problem that these other great programs i mentioned are having.. Its free and open source ok cool but with zero advertising or monetary incentive there is really no reason to support the platform.. I simply wanna change that by offering a programmer the option to create a fill in the gap type fix and let me market it!! I could turn like 5 hours of a programers time into like 200$ per hour! Even more if they work on other programs for me\n\nI think that kind of exposes a misunderstanding about why passionate people work and do business.  The $ and the numerals trailing it are a means to an end.  See - I really don't particularly care about what my hourly rate is for something - I actually despise hourly rates and prefer to be paid for completion of tasks, if anything.  Work gets done when it gets done and explaining why something is taking longer or shorter to a spreadsheet warrior is a headache and waste of my time that I could be using doing things I want to do.\nWhich is the underlying thing, here.\nI want to, for example, build my own aerospace fighter, some day.  Lofty goals, I know - but it's not that I want to build it to make money, necessarily - I want to build it to enjoy it and to prove that it can be done.  I am not going to ask the people who help me with it to do it for free, and obviously materials I need must be paid for because we are not each others' slaves - but, at the end of the day, I believe many of us who have the creative talents are generally not motivated by the money they can make with something and, instead, are more motivated by the fact they created something.\n\nWhile, no doubt, Zero Net does need some way for people to do business on it - and there will be money to be made, there - the idea of ZeroNet is, almost, precisely to navigate outside the realm of corporate financing and business hosting.  I realize I am treading closely to the dreaded concepts of socialism - but many of us are here because the spreadsheet warriors took over the free market to run it as an oligarchy and have now begun sniping out people they do not like.  To that end - marching on here with a \"I can make you millions\" line of talking is rather tone-deaf, even if it is a troll.\n\n\"We\" have done business with large corporations and their legions of spreadsheet warriors because they've held the monopoly on assets to practice our trades, methods of pay to satisfy our expenses, and methods of communication to orchestrate said creations.  I don't need a billion dollars to build what I want.  I need the equipment to do it - whether it be something I've built or bought.  Money/Currency is a tool, and when all you have is a hammer, every problem looks like a nail - as the saying goes.\n\nLook - if you're not a developer, you really don't know how long the project you want is going to take.  Even if you are, you know there is substantial variation between estimates and reality - usually trending toward additional work.  This makes the attempt to calculate out an offer of amount per hour to be kind of silly, and it's a bad idea to contract development work based on hourly rate just because you don't know if I'm actually doing development work or jacking off.  The hourly rate is of little real distinction. \nFurther, I can tell you that the scale of the project you are looking at is usually undertaken by teams.  While a single person can do a lot, the reality is that you want a fully cross-platform, bug tested, turnkey solution for deploying ZeroNet.\nI will also tell you that there is a problem with doing this on NAND flash - read/write cycles are relatively limited on a flash device, and long-term storage on them is not advisable as it begins to accrue errors in the data within a few years.  Not always crippling, but something to keep in mind.  I'm not saying your solution is a bad idea, just that it has some technical limitations you may want to assess before promising to pay people vast sums of money for.\n\nIt is my experience that con artists or desperate people get drawn in by dollar signs.  If you're truly someone with some developmental interest who is looking to make a marketable product for ZeroNet - then you might want to consider understanding the people you'll be working with a little bit.  I'm not saying that we only work for free - but that you're kind of setting yourself up for trouble if the first thing you do is try and say \"I'll give you $500 an hour to do something I can't.\"\n\nIf you are truly interested in ZN development from a hardware and software standpoint for end-users, and have the financial resources to invest into it - then I'm willing to talk, but I'm going to tell you that a team is necessary and that your goal should be bigger than USB drives.\nI work for a living - I don't have investment capital.  Wonders of the healthcare system and all to wipe out family wealth and kill people, anyway.  So my ambition is bigger than my pocket book.\nBut I can't stress enough that the job is bigger than a single person.  Not only would you need to be able to sell a product that provides a seamless transition into ZeroNet not just from a user standpoint, but also from a developer standpoint - you would, also, have to develop the reason to purchase the product.  While some of that exists, already - if you want to try and advertise a particular set of pages or services on ZeroNet, you would then need to develop those, as well and have them in a useful state.  Further, these would need to be accessible and usable to the current ZN community - as it would be a horrible idea to divide it.\n\nThe chicken-and-egg problem exists, as well as the problem revolving around logistics.  Someone would need to acquire and program these USB sticks, and while I am sure there are companies that contract such work around the world - many of those companies can be a pain to work with from a QA standpoint in my experience.  You need to handle audits of the product you're about to ship to people, etc, etc.  Maybe you're already integrated with one of these chains/lines and it'd be relatively easy for you to set up - I don't know, but even if it's as simple as buying a bunch of USB drives and placing a sticker on the things before uploading files and mailing them out - there's a logistics chain to think about.\n\nI realize I am being somewhat patronizing, but I come from a \"highborn\" status and have dealt with more than a few people who have been able to buy things and think they are a bit more effective with running a business than they actually are, because people are constantly throwing themselves into the gap to keep an idea from collapsing.  It's not necessarily difficult, but what first seems very simple can quickly balloon into a much larger (and costlier) thing.\n\nAssuming, perhaps foolishly, that all of this is genuine and serious.  I want to see ZeroNet succeed - or, failing this specific platform, something that inherits its will and role in a superior form.  So, I will entertain your proposal insofar as I'm available for consulting on your project and team constitution.  I won't claim to have all the skills you need, and would be more hesitant if I was looking at launching into a bunch of code over this post.  Suffice it to say that I have my own creations I am developing that you may find interesting, if you are genuine.",
				"added": 1567480852
			}
		],
		"1567455450_17qQYX5qjxUoLZd1WmQVZFVqNFtZLXFLV3": [
			{
				"comment_id": 42,
				"body": "I think these people are trying to justify their behavior and/or impulses over the relative confusion and discomfort we have with this issue on the whole.\nIt is not pedophilia to find yourself attracted to someone who is, incidentally, underage.  It happens, you meet someone you find very interesting.  This is more common for men than it is women, but more on that in a bit.  It's not necessarily \"wrong\" when there is that individual case where a person is attracted to a minor and the attraction is more or less to that minor - provided this person is going through or has gone through puberty.  It may be extremely irresponsible and technically illegal to act on any such attraction - but it's not as though that person is a pedophile.\n\nWhat defines pedophilia is an attraction to the age group.  Technically, for pedophilia, it is toward individuals who have yet to go through puberty (which is usually around 14 years old), but we can lump in teenagers to this, as well, as that has similar problems.  Attraction to an age group is typically not accompanied with partnering - most of us, even if we were to find ourselves attracted to a minor, would see it as our role to partner with that person for a long period of time for the purposes of building a family and household.  Pedophiles, on the other hand, tend to be more focused on the indulgence of sexual pleasure - these are not long-term partnerships they intend to have, and are usually a situation where the adult experiences elation at the ability to have control over the minor.\n\nIt's rather difficult to package: \"I want to be able to court elementary school kids for romantic, intimate experiences out of compassion and love for them\" when the reality is that this person will likely have little interest in those children once they are adults.  Perhaps there is, in some kind of zany world, the ability to have some kind of \"responsible sex with a minor\" - the hentai gallery has certainly tried to pilot the plausibility of such scenarios - but you are looking at a highly specious setup where characters can be driven by plot rather than the various neurosis that underwrite real human behaviors.  I am extremely skeptical of the idea that, even in the best case scenario where the \"sex ed teacher\" is just far too passionate about her job and genuinely means no harm, there is a case where no harm would actually result from allowing people experiencing pedophilia to engage in acts of it.\n\nIt is not normal to be attracted to people who have not gone through puberty as an adult.  It may be more normal to be attracted to youth - thus the term jailbait - but a scenario where someone loses interest in an individual as they mature into an adult is not normal and potentially harmful.  Treating everyone who experiences these problems as if they are monsters right out of the gate is probably a mistake, as there will be people who realize \"Uh... what the fuck... why am I like this?\" - but the idea that there is some kind of scenario where sexual acts between children and adults is healthy... is more likely the realm of fiction in contrast to the reality of what we see out there.",
				"added": 1567482616
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 44,
				"body": "Well, that would be the case if the government were indeed God and was free to determine what the Law actually is.  Like a king attempting to order back the tide, there are things which are above the power of man and its institutions to determine.\nWhile I may not be able to \"talk my way\" out of a crime I am supposed to have committed by some tyrant or another shrieking into the night - I can simply say: \"Rule of thumb, Hassan; You can't kill the Messiah.\"",
				"added": 1567668843
			},
			{
				"comment_id": 52,
				"body": "> [randomshits](#comment_85_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): I have a suspicion that the general sum of humanity has a untold infatuation with misery and suffering. How often do people watch movies, television shows, and video games that detail all sorts of suffering as presented as forms of entertainment.  [...]\n\nI think this is an incorrect, if understandable, misunderstanding.  I recommend watching the series: \"Psycho-Pass\" - the first 24 episode season.  Season 2 is... eh.  Made by a different studio because merchandising and I'll just truncate the rant on that whole tangent.\nI believe this quote comes from the director's cut:  \"The opposite of boredom isn't pleasure - it's excitement.  People will gladly seek out any kind of excitement, even pain.\" - Makishima Shogo.\nhttps://hooktube.com/watch?v=Y5L1L-oFP8c\nIt's a synopsis, but it's a pretty good one and I simply can't recommend Psycho-Pass to everyone in this day and age enough.  I don't really believe in mandatory public education, but it should start and end with this show.  I kid you not.  It is the summation of ... civilization... from the orations of Cicero to the wit of Swift.  There's a scene in there that never fails to bring tears to my eyes, and it is Akane's monologue in regard to the Law toward the conclusion of the series.\nThere's... another thing about Psycho-Pass... there are two basic ways to look at it - first, from the first half of the show - that is, 'let us suppose we do have a supercomputer that does all these things' - we get the philosophical debate of the value of free will and other such fun things... then... it's time for The Truth.  And as we all likely know, here....\n\nAnyway....\n\nI believe people are bored.  We need stimulation - and, to some degree, survival stimulation - to believe we are under threat from time to time.  There is also an interesting ... thesis, if you will, proposed by an embedded reporter with combat forces.  He was in the field for months on end with guys in some of the most heavily shot at areas of Afghanistan.  Life sucked for these guys... yet... when they got back to the civilian world and he did follow ups with them years later - they missed it.  Not the smell of wearing your uniform for months on end and burning them at the end - or the loss of friends or getting shot at.  But there is a sort of hollow and fake nature to the civilian world after that.  Even after general military service - I've found myself rather \"meh\" about civilization.\nThis reporter realized what it was: \"Brotherhood.\"  https://hooktube.com/watch?v=TGZMSmcuiXM\nWhether by indoctrination, screening, or some kind of blood/gene call to service - many in the military, at least in the U.S. military, are of a fraternal nature to each other.  We won't just punish our own for infractions - we will discipline them; you might be a fucked up shitbag, but we'll fill you full of sand and dirt until you can grow a tree.  Where society tends to be quick to treat people as disposable tools or even consumable commodities in both business and personal relationships - we don't get to go around and choose our team we are going to go possibly die with - or kill people and experience some of the worst humanity has to offer (both among the opfor and ourselves).\n\nThere's a romance to this idea that has captivated many.  I think that is part of the reason 'hero' and 'soldier' worship are as common as they are.  It isn't that people are fascinated by suffering, but that people are bored out of their minds and identify easily with suffering.  Further - the 'battlefield romance' of broken people achieving superhuman feats and having no choice but to cherish each other's existence is ... well, actually, nearly the definition of Romantic if you trace back the traditions of Spartan military customs and the importance of the shield in their tactics.  \"With this or upon this\" the wives would often present the shields of their husbands, before going off to battle.  At least, as the legends go (as that's almost all we have on Spartan culture, interestingly enough).  In societies where people come and go from our daily lives - the idea of having people who are going to pick you up and tend to you when you get injured, of being able to assist others readily and to achieve often very clear, specific goals or even go against the odds to do so... not only is it romantic, it's the pretense to many utopian ideals of how things should be all the time.  ... Except... you know, for the whole killing other people thing.\n\nMost people are bored - they seek that stimulation, and there's the fact that an adrenaline rush is a hell of a powerful hit.  Many of us find ways of doing this in a socially acceptable way.  For many criminals, particularly among the elite, I would argue this is the case - and it is their personal high to rebel against the very concept of law.  I think it's, also, why sexual deviancy is so common among them, as well.  Nothing quite gets the endocrine system working in overdrive like daring someone to tell the law about you, knowing you can squelch it, and having your way with an idol-quality person in the most physically intimate ways possible.  Throw in a couple drugs that the rest of us get murdered or jailed for having and they really just kind of become simple junkies - pigs looking to blow their brains out on various induced highs.\nWhich is where I also recommend: \"Kill la Kill\" - it's a rather good litmus test.  Show it to people and see how they react.  If they can't see past the whole almost-naked fighting girls, then they aren't ready.  https://hooktube.com/watch?v=_Es3L9i8TfU  And a nearly perfect video for that, there.  Probably the best fight in anime history, right there.  As someone who, before this series premiered, took the name of The Earth Dragon.\nIt's also a series I highly recommend comparing and contrasting the English and Japanese Dub/Sub with.  Not because one is exclusively better than the other - but because there are certain scenes which carry differently based on the chosen words and the tone the VA uses in them.\nI'm digressing, considerably - but I think I've made a point or two.",
				"added": 1567801750
			}
		],
		"1567666768_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 45,
				"body": "> [redlibertyreal](#comment_71_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw):The whole notion of a command economy came into being originally as a way to rapidly industrialize the Soviet Union so that socialism was indeed a technological possibility (in a country that then had not even really developed under capitalist industrialization). [...]\n\nI'm not necessarily going to say you are wrong, but I will say that there is a huge problem with the whole concept right from the get-go.  Twitch Plays Pokemon is not really a good way to sort out a factory line.\nThe core problems are the following:\nMass manufacturing (that is, cost-effective manufacturing) is reliant upon a combination of labor and skills which are not often interchangeable.  While we are approaching an era of nearly complete automation of assembly lines - there will always be aspects of manufacturing that require the human touch, and the individuals responsible for that are not negotiable in terms of whether or not your business employs them.  Without them, you don't have product - you don't have business.  These voices will always command higher attention than those of unskilled and readily available workers.\nCollege Students don't get to vote.  If you have ever lived in a college town, you know that there is always a battle between the local residents who just want to live and the college students who want to pass down their enlightenment upon the backward savages in the town via the ballot box.  The same problem comes up in democratically owned/operated businesses - seasonal employees and transitional workers are going to be able to vote on policies that they, themselves, will not actually have to live with or experience - they get to be 'idea people' and then bounce on to the next job before they've had to experience the policy change they voted for.\n\nNow, we could argue the dynamic changes a bit if you wanted to, say, get your home owner's association to be useful and make a CAD-CAM lab for everyone to use - and something like that could be seen as a collectively owned means of production - but even then, you're likely to run into issues of incomplete tool sets developing and broken pieces of equipment that no one knows how it got that way.  Unless you are living in a guild of trade professionals, you're likely to see a lot of stuff go missing and break down (or spontaneously deconstruct itself) and without a business-like dedication of a party to repairs and re-ordering (as well as taking expenses out of HOA dues) - it just doesn't work out too well.  In my experience.\n\nA lot of manufacturing is only practical under a centralized means of production, which complicates the idea of mutual ownership of that production by its employees.  If employees were bound to their job and role at birth, or something, then there is some merit to the idea - but if people maintain their freedom to shift between jobs, then it only makes sense for many businesses to ultimately consolidate their democratic processes into an oligarchy that excludes many of the employees currently considered to be the greatest victims of corporate oligarchies, currently.\n\nRather than systems of socialism, I think it would be more interesting to see countries offer programs to see the return of community gardens, community bakeries, and community machine shops/foundries - and education for respective individuals.  It would be a far more worthwhile investment, as far as I see it, than tossing money into the endless black hole of currency manipulation that fuels socialism to no real results.  At least if your society has a greenhouse every few blocks and a machine shop/foundry and a means of generating power in several locations around the place, you can be fairly certain you'll survive an economic collapse of wallstreet.  People may not know what the hell is popular six states over, but they will be able to make the stuff needed to keep the machines and the food going until the spreadsheet warriors get done hanging themselves in corner offices.\n\nPeople overcomplicate economics if you ask me.  The more available the means to make things are and the more people skilled in doing so, the better.  Arguing over who owns the factory kind of misses the point that any sensible government truly out to advance its people would buy a factory that can make the equipment used to make factory equipment.... and begin distributing.  If we're going to ride the dollar in a race to the bottom - that would be the smart way to slide.",
				"added": 1567670634
			},
			{
				"comment_id": 46,
				"body": "> [436sdwd](#comment_3_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm): \n\nI'm not really a big fan of democracy in the first place.  Democracy assumes, incorrectly, that all parties have equal education, equal interest, and equal consequences from a vote.  The... population around here recently voted for a permanent increase in a tax levy that was due to sunset in a few years because the council put before them a proposition and assertion that it would be necessary to build a new community center with an indoor pool.\nThe problem is that they completely removed the sunset of a tax levy that was passed years ago to build a new school in order to do this.  Among other things.  It also had one of the highest voter turnouts in voting for a year where no national elections were being held after a massive campaign among college students.\n\nWhich - whatever - it's not like I don't want an indoor pool or new community center, or would disagree with the need for increased revenue to deal with it.  The problem I have is with the way the city council worded everything to specifically avoid telling people what the hell they were voting on.\nThere is, also, a final key assumption of democracy.  Compliance.  Imagine that democracy is a simulated war.  The reason I do not get all bent out of shape and start killing people because a tax increased is because it was shown to have majority support.  Thus - my desire to not pay taxes is leveraged against the understanding of just how many people I would potentially have to kill in order to substantially change the landscape.  So long as democracy avoids issues that make people give up their livelihoods, most will not see it as worth the endeavor to throw a revolution because of stupid decisions.\nHowever, if that should ever reach a point where the decisions being voted on can't be accepted regardless of their popularity - then a war is inevitable.  If we were to vote, tomorrow, to purge all of a certain race or another from our civilization - would we expect them to just roll over and die?  Of course not - they would fight to, at the very least, earn safe passage out of the nation.\n\nAt its core, democracy is little more than a show of blades to see who is willing to use that blade in support of a given proposition.  Its core reasoning for compliance is, effectively, intimidation and coercion.  This is why we use democracy to choose who to put in office, and should attempt to limit how frequently issues are decided directly by democratic vote.  Direct votes allow the people to become irritated with each other, while republics with representatives chosen by democracy allow for a more focused target of the intimidation of the vote.  Although, I would argue there are flaws in that, as well.  Being accountable to people asleep at the wheel while they indulge in bread and circus is ... eh.... a recipe for disaster.  And here we are.",
				"added": 1567720469
			}
		],
		"1567646630_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 47,
				"body": "> [436sdwd](#comment_6_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm): Is it? ZeroNet still relies on trackers for peering. DHT hasn't been implemented yet. You can make all the trackers you want, but how are the people who actually need them going to find them? Can people find your trackers fast enough to keep up with the rate at which the censors can take them offline? How long can this go on before people get fatigued with constantly having to update their tracker list? Can the network's current structure keep up with a multi-corporate barrage backed by mysterious US tax dollars? Do you want to find out? [...]\n\nAll of the data flowing between the east and west coast of the United States effectively flows through my back yard.  Would be... interesting... if that connection were to have something happen to it.\nIf we get to a point where the censorship is that bad, then we get to play whose button hurts the opponent the most?\n\nThe thing about the internet is that it is more centralized than many people realize because of how the infrastructure supporting TCP/IP has developed and works.  Much of the data flow in the U.S. between east and west coast passes along fiber optic buses originally installed for C3 with the missile silos that dotted the landscape.  This is the backbone of the internet, and companies pay huge bucks to locate their data centers in the middle of nowhere, Kansas and Missouri to be on that backbone.  While there are some other lines that have developed, the overall pattern has preferred centralization and upgrading of bandwidth capacity of existing lines over the creation of new ones.  The majority of all commercial traffic passes, effectively, through a very limited set of fiber bundles.\n\nI highly doubt it will come to that, however.  They've had a very difficult time getting trackers and other such things censored and have been on a war against piracy for a very long time.\nWhat everyone is missing, I think, is just how centralized the major functions of the internet are.  The majority of people and even network operators are not in support of censorship.  The problem is monopolies and anti-trust.  There are some court cases unfolding that should be rather interesting on this front.",
				"added": 1567725856
			}
		],
		"1567750015_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 48,
				"body": "Poor use of cryptos in this situation.\nWhat you would want to do, instead, is use something like cryptonight to hash user IDs into a block.  Let's say I apply for an ID through, say, ZeroIDmk2, I retain a key that identifies me to the block chain.  Rather than running file changes locally, file changes are authenticated through the block chain.  IE - when a request to change a file or submit a file is made, it is authenticated against the block chain, which uses its cryptography to track file owners.  Because cryptonight is generally double-blind, it allows for files to be managed, seemingly with random owners, that are tied to an owner based on the cryptography block they were posted under and the owned key a person then submits requests to change with.  Thus - a zite and file owners can mutually verify each other.  You could even use this as the basis of a distributed drive - distributing encrypted files that only show up properly on certain zites and/or for certain users.  So muh copyright people could be have their muhcopyrights.\n\nBy integrating this process into the formation of blocks, you inherently reduce the potential for spam attacks as you could detect an attempt to create numerous IDs on the same block by the same user (potentially), and you could similarly detect and prevent an attempt to spam a zite with numerous file submissions or changes all at once.  By timing the system to the building of each block, you will slow down the rate at which some changes can propagate (if a zite structures itself to) - but can get around some of the problems we have on the image boards, currently, regarding post count, ordering, etc - as these types of details would become integrated into the cryptography block and ledger system.  Or... could be.\n\nWhether or not you could build this to work in parallel with an existing cryptocurrency, or not, would be worth looking into.",
				"added": 1567755351
			},
			{
				"comment_id": 50,
				"body": "> [robione](#comment_297_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): relying on a 3rd party service (chain) is a single point of failure. It needs to be more resilient and distributed.\n\nIf integrated properly, then the blockchain is the decentralized coordinator.  Ultimately, you can't have an organized or ordered internet if you don't have some degree of centralization.  A blockchain is a centralized construct built by many distributed operators.  So, the 'centralization' is made virtual such that no one party holds central authority or control over the chain's functions and authority.",
				"added": 1567760626
			}
		],
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 54,
				"body": "It isn't rocket science.  Most mass shootings occur just before large legal or governmental events.  Christchurch occurred just ahead of the release of Mueller's probe and just following the removal of an individual from the Special Council.  The overwhelming majority of these events are planned in an attempt to create and control media narratives to distract from other events.\n\nRecall the attacks just ahead of Epstein's arrest?  Two can play at the same game.  \n\nAccording to the book: \"Behold A Pale Horse\" - there were reports of a program called \"Orion\" whereby MK Ultra-like processes were used to induce altered states in vulnerable individuals and then implant suggestions or tendencies for violence.  MK Ultra was officially terminated rather early, because Congress found out the CIA was experimenting on people without their knowledge.  It's also rather interesting that it was around this time that Operation Ajax was in full swing and Iran would end up seeing a regime stabilization followed by a regime change to a Muslim-Brotherhood affiliate (If you know who Hassan Al Banna is....).  So, chances are, many of the CIA's black programs were moved and headquartered out of Iran.\n\nIf you look up Nassim's father (remember the google shooter?) - he was from Iran, and an engineer specializing in microwave and ultrasound amplifiers, if memory serves correctly.  You can use microwaves to stimulate the skin and ear in such a way as to perceive sound.  A very similar technique is used with lasers, currently.  Exactly how these people would be targeted for this type of technique is not really known - a cell phone should lack the power to do this reliably, presuming there is not some lesser-known effect of microwave radiation - and other methods would require a team remotely deployed to continually target the individual with equipment - and this seems cumbersome.\n\nTargeted regions are almost always in a democrat controlled region and often a venue that later undergoes remodeling or gets some variety of grant.\nThe more you learn about \"A thousand points of light\" - the more you understand why \"clown world\" is a thing.",
				"added": 1568197711
			},
			{
				"comment_id": 55,
				"body": "> [sperg](#comment_5_19WVEMLEDso1JfM3bnHXsjHVEQ1dr3VpvQ): aim64c: As far as \"happenings\" before events the only issue I see is that things are always -happening-. Bolton got fired and nothing happened before that. But what if it did? Then it would fit the narrative of \"Oh, X event happened to distract from the Bolton firing!\"\n\nThis is a valid criticism.  It's why the strategy works.  We prime ourselves against confirmation bias by assuming coincidence or irrelevance.\nI am not saying that it proves the strategy exists - just that the rational mind has been conditioned to discard conspiracy as if the plots and power plays in our daily lives are somehow beneath the offices of governments and media.\n\nAn example coincidence - the city council had a one way street changed to a two way street a few months before an apartment complex was built on property that was recently purchased by a local 'developer.'  There's inadequate parking for the structure and cars are now parked along both sides of the street (so there's only room for one car, anyway) and the housing is generally applied for by people who get government assistance to supplement their income - IE - my tax dollars are effectively paying a spreadsheet warrior to clog up the local road (which connects to the post office, by the way - it was made a one-way street for a reason due to the post office) and go on vacations on the backs of a generation of renters as his kind buy up all the local property and we slip further into serfdom.\n\nNone of this is by accident or coincidence.  I can guarantee that if their phone conversations were public, these people would be executed by mob justice in a flash - ironically against due process and civil order, as they can manipulate the laws we use to order our society to be what they want, rather than what needs to be to preserve a free society.\n\nWhile this is a very different example compared to simple timing of events - it is no coincidence that nearly all of these shooters have been treated for psychiatric disorders and their psychiatrists glow in the dark.  The connections these shooters have begun having to Epstein and others begin to potentially implicate a social network that is relied upon for sourcing individuals for such a program.  The planned media narrative to attack the second amendment is also no coincidence.\nIf the state were to attempt to seize firearms, directly, it would face an immediate backlash that would end it almost before it realized it made a mistake.  From the military to the general citizenry, an armed revolt would take place and very few 'loyalists' to the governors would exist and be far too infiltrated by sympathizers to be of any real use.\nHowever, if the state were to raise multiple generations in relative peace, portray weapons in the media as tools of wanton violence, and create multiple high-profile examples of weapons causing a disruption of that peace - it is possible to erode the understanding of both weapons and the Law.\nThey don't want \"my guns\" - they know I don't need a firearm to kill them - they trained me, after all, and tested me (and I am far from the only one).  They want my children or grandchildren to detest the idea of them and to embrace a society without such troubled cudgels of the past.\n\nRight now, we sit at an extremely precarious position.  A single entity - be it a country or state - can track its citizens with a degree of precision that has never before been seen in publicly known history.  While it is not currently feasible both in the way the population thinks or in the actual capacity for enforcement; it should be obvious that the end goal of google's algorithms is complete domination over the human psyche and its culture.  For whatever reason, when these people read \"This Perfect Day\" \"1984\" or any of the other various dystopian futures - they see a great model of how civilization should be.  Why is largely irrelevant to the fact they are committed to creating such a future.\nThis dovetails with their environmental policies.  I will tell you this right now, if there are still machines sucking carbon dioxide out of the atmosphere in another ten years, then it should be our mission to destroy them by any means necessary.  The problem with this planet is that it supports life almost everywhere.  Any random group of people can scurry off into the wilderness and survive or forces can forage to survive.  Sympathizers outside the monitored supply system can supply things - it's just a chaotic mess.  Plant life requires carbon dioxide - farms - food - civilization - requires carbon dioxide.  Not only should it then be taxed by spreadsheet warriors looking for extra cookies, it should also be stripped from the air as a free resource and turned into a resource which can be allocated in a controlled manner.\n\nThe plan is to literally kill off all vegetation but grasses and consolidate humanity under tightly controlled, specialized agriculture supported by an inescapable monitoring network that allows all human labor to be tasked in accordance with a policy established by a select few.  It's a plan that would take many generations to complete - at least on its surface.  But with enough propaganda and staged economic collapses and wars - it would have been possible to project blame for those disasters onto environmental issues and prevent future generations from fully grasping the causes of their eventual downfall.  IE - by controlling how the world goes Mad Max, you can stage a solution for Beyond Thunderdome to seize control of an entire species.\n\nOr... try.  But I have digressed considerably from the subject at hand.",
				"added": 1568270881
			}
		],
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 56,
				"body": "This is all interesting, and everything - but I must ask what the intent behind the analysis is.\nI have a saying I've used for some time: \"I love a person, but I absolutely hate people.\"  I'm not going to argue that every race is equal by terms of metric performance.  What I will state is that each individual in our society is owed an evaluation as an individual.  The danger of statistics is assuming that averages and modes define a person.\n\nFurther - I would add that it ultimately doesn't matter who is \"better\" or who is \"worse.\"  What matters is whether or not a group of people is behaving in a manner that can produce their desired outcomes.  I would find it difficult to believe Africa wants its various tribal wars and other such things.  Maybe they do, but I doubt we are that far apart.  Blacks in America during the 20s, 30s, 40s, and 50s were doing spectacularly well - on the average they were a tighter knit family and community than many other demographic segments.  Then the Civil Rights Movement happened and the \"you get free shit for being a whore\" from Uncle Sugar plan pretty much Klan-Hammered them back into slavery, and the niggerdom of inner cities is a direct result of this.\nSure - it's their fault for falling for the trap; but it's not like other races are defacto immune to its effects, either.  It simply took longer for generational wealth and other such things to be eroded to the point where the average white person was tied to the Plantation.\n\nAt the end of the day, a moral question comes into play.  To thump my own chest a little, I test well above most people.  It's a fairly safe bet that, statistically, I am superior to all but a handful of people I meet - at least in regard to general intellectual capacity and other such things.  Certainly, someone who has dedicated their life to a subject knows more about it than I do... but I can also learn everything they know in a fraction of the time and remember it for life from a single instance.  So - there's that.\nI struggled with it for some time.  It's very easy to get frustrated with people and to want to \"do it yourself\" or to simply have them do it as you would do it.  When the gap in intelligence between yourself and the average person is greater than the gap between the average person and people legally unable to represent themselves - the whole world is seemingly handicapped, dull, and backward.  People's own belief they are relevant and have any business thinking gets in the way of the bigger and better things we could be getting done.  Surely, whatever it is I would have them do is far more grand a task and a better use of their time than anything they could possibly come up with for themselves to do.  Right?\nEven if that was absolutely true and there was no denying it... what's the point of a person being born into this world if it is to live for my own designs?\nI can understand why some people resolve to the mindset of a slave maker.  I can't, however, understand the disregard for an individual life and existence.  I do not know by what process we arrive in this world and are born to one race or another.  I also do not believe there is a necessary equality regarding how our bodies perform while here - though I think this is an easy-enough concept to establish as fact (even if we disagree on exactly what features are good/bad to have).  But I do believe that how we behave toward each other does mean something.\nIE - I believe that what makes the world real is our interaction with others.  There is no spoon, but there are other people here.  I suppose one could take the approach of a \"soul in a vacuum\" and say life is all an illusion of the only intelligence to ever exist, but that's more of a philosophical touchstone than it is a true belief - the question of whether or not the people around you exist as you do.\n\nBut I digress.",
				"added": 1568469690
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 57,
				"body": "Well, let's say that you come to the conclusion that this world is all a simulation and have set about to escape it.  Let's say you are able to identify a means by which to escape this simulation.  How do you know it is not simply an \"expansion\" of the simulation?  \"Containment boards\" are a thing in social media, why would they not also exist for a 'Matrix-like' environment?\n\nSo, obviously, we should come up with some kind of test to determine whether or not the world we are a part of is real.  Obviously, we aren't talking about the presence or lack of physics - our world contains physics and consequence and has been determined to not be real by our prior escape to the world upon which it runs - so, we need to come up with something more fundamental by which to assess a world to prove it to be real.\n\nAnd.... ?  I honestly can't think of a way to do it.  This is a subtle thing within the Matrix movies that is right there at the surface, but often overlooked.  When Agent Smith is telling Morpheus about the first matrix, which was a paradise humans rejected out of a need for struggle and conflict - we are being given this very problem, here.  Our fundamental assumptions about how the world should work tend to determine our willingness to determine the world real or unreal.  When presented with a perfect world where the struggle against survival or suffering doesn't exist, people can't process it as real.  Something similar could be said to be explored in the anime series \"Psycho-Pass\" - though more dealing with our psychological need for stress/stimulation and validity as an individual.\n\nOf course, I think this hints at a deeper truth - There is no spoon.  Never was and there is no place in which there will be a spoon except inside your perception of the world.  Rather than focusing on the idea that the spoon isn't real or that the world is somehow fake, the wisdom lay in realizing that you can choose what in the world to treat as real and what to treat as unreal.  When told to choose between the mathematical function and precision of the system or the interpersonal relationships found between people - Neo chose to treat those people as real before the system, itself - and I think that is where most people stand.  Regardless of what world we are in and how it functions, the people we come to know as individuals are real - they are another person experiencing reality in a very similar manner and feel just as we do.\n\nThat is my philosophy, at least.  Sure - I could be wrong, and in the case of the NPC phenomenon, there is the possibility that there are people who are just lifeless functions of some kind of simulation - but I would find that to be something of a tragedy if I am the only one who consciously experiences reality.  If I am so powerful as to be able to create such an experience for myself, then surely it is possible to create others to interact with who are legitimately peers - and so it would be rather absurd to come to the conclusion that I am the only one here, I think.  Or ... vain and useless.\n\nBesides, it means I can claim to be a dragon and to be above gods, so it's a really fun philosophy to embrace as both simultaneously master and subject of the universe.  If there are other realities or dimensions (or whatever) then of course I would love to explore them - but I think getting caught up in real vs unreal misses the obvious implications of experimentation... that is - Quantum Mechanics ultimately sets into place a framework where reality can only be defined by the end point of our observation and energy expended to gain additional information... IE - relative and subjective, thus rendering our interpretation as to the nature of material realism philosophical.  Our entire expectation regarding material realism is, itself, a philosophy which arose from our basic experience... and therefore our entire expectation that there should be something such as \"reality\" may be the most manufactured idea of all of them.\n\nBut I digress.",
				"added": 1569254665
			},
			{
				"comment_id": 58,
				"body": "> [xcape2net](#comment_404_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I've heard the phrase, \"as above, so below\" many times.  Is it a quote from the Bible, or from something more esoteric, like Emanuel Swedenborg or Kabbala?\n\n\"On Earth as it is in Heaven\" is a statement made in what has become known as The Lord's Prayer - which was what, according to .... I believe it was the Gospel of John.... though I could be wrong, Jesus gave as an example of how prayer should be done.  \"Our father who art in heaven, hallowed be thy name, thy kingdom come, thy will be done on Earth as it is in Heaven....\"\nOr... several literary variations thereof, because translations.\n\nThis is a sentiment that is relatively old, however, and the concept of \"As above, so below\" is recognized by numerous teachings in various contexts.  It found its way into Hermetic Judaism which it then became part of what would eventually produce Wicca and the Masonic lodges (the two are actually from the same root, it's kind of funny, yet also somewhat tragic - though the psyops to subvert and coopt the Wiccans is more obvious than what occurred with the Masons).\n\nThis all gets into stuff that is relatively difficult to talk about because people have been conditioned to \"REEEE\" at the very mention of certain ideas.  To start with, it is important to understand that the common Christian interpretation of the beings \"Satan,\" \"Lucifer\" and \"Serpent\" are arbitrarily the same being within Christian dogmatic beliefs.  There is actually more complexity and nuance to this.  None of it is made simple by the fact that we are dealing with both old cultural stories/myths and incomplete scholarly records of just what the fuck people were talking about back then (if they even had language structure as fully developed as we do, today - languages evolve and a lot of old languages are rather basic in terms of 'tree walk from lake me friend' sort of way - where you kind of had to be there to be able to pick up the context).  However, where we get the phrase \"Lucifer\" from comes from a translation of a rant against one of the Babylonian Kings - where he is seemingly compared to \"The Morning Star\" and \"the greatest angel\" who betrayed God.  \"Lucifer\" is what \"The morning star\" (what we now call the planet Venus) was called in Greek at around one of times where translations were being made into Greek, and that particular choice became rather problematic later on.\n\nThe Morning Star - that is the planet Venus - is one of the brightest objects in the sky and not only does it frequently arrive on the horizon ahead of the Sun (hence \"bringing the light\") - it is also one of the more interesting planets to observe its course through the sky.  If you watch the pattern Venus makes, it is a five-pointed path - a pentagram.  All those who observed the stars at the time (wise men - people who tracked time and kept record - scholars) used this as a symbol of their practice.  Tracking the stars was how we marked time, navigated the land and sea, etc.  Important and serious business.  It was synonymous with the concepts of the pursuit of knowledge - hence, \"enlightenment.\"  Those who follow the morning star bring the light of knowledge.\n\nNow we get into another character - the Serpent and the Fruit of Knowledge.  This is a very, very old concept in history and it's difficult to tell exactly where it came from.  The Tree of Life is pretty much everywhere.  Ygdrassil, the Sephirot (though that's a bit different), etc.  The Fruit of Knowledge is a little more defined.  I have no idea who came up with an apple as the fruit - but if you ever wonder why some characters in shows have a particularly fond like of apples or you were encouraged to give your teacher an apple at school, it goes back to the prior.  The real fruit of knowledge, however, was the Pomegranate.\nThis allows us to enter into Greek philosophy and understand the conflict between God (Zeus - Saturn and related entities) and the Serpent - IE - Prometheus.  The story of Prometheus is that he's a Titan - one of the primordial beings who came from before Zeus and even participated in Zeus's rebellion against the Titans by some accounts.  Prometheus has a peculiar fascination with humanity and is also something of a trickster - or, monkey's paw.  Depending upon what stories you subscribe to - Prometheus was the one who gave humanity the gift of Fire - or he returned it to them after the gods confiscated it from us.  In either event - Prometheus often enjoys pulling one over on the gods and throwing a wrench into their plans, and Zeus is usually pissed that his order is being undermined by this guy who he can't kill.\n\nGreek myths are actually rather important and relevant to the foundation of our civilization, particularly here in America.  The Statue of Liberty is Athena - she holds a torch in one hand (Prometheus, Athena, and Hephaestus were associated with Fire) and a book in her other hand and is clothed in classic Athenian robes.  The statue was a gift from France, something to keep in mind.\n\nAnyway - there is something of a similar character portrayed within old biblical myths.  It's difficult to trace the origins of the idea, to be honest, as it's almost pre-lingual.  That is the Fallen Angel - the agent of divine power who was immensely knowledgeable and recognized as being one of the greatest beings before... something.  Some groups who like to be edgy claim he was a nice guy who decided to venture down here to help us out on Earth.  Some say he rebelled against God and enjoys seeing everyone suffer - obviously, the current dogma has associated this character with the very notion of evil to the extent of representing Satan.  While we often equate Satan to some kind of Hades-like existence ruling over the underworld - this is probably a mixing of sentiments regarding ... I believe it was Persephone who Hades stole away and gave a piece of Pomegranate from the underworld (which was the Greek myth for the origin of the seasons and why the Sun became less frequent during winter).  If one was of the opinion that Hades was an asshole for doing that - then equating him to something of a malevolent character makes sense, and thus the relative association between the Fruit of Knowledge and the evil of the underworld.\n\nA similar concept can be found between Izanagi and Izanami in Japan, if you're looking to go \"wait a fucking minute...\" while rewatching Naruto and you realize the Hyuuga have a Compass and Square in their Clan insignia, as well as a flame (\"Will of Fire\") and their Clan title means \"Light.\"  Lot of fun stuff like that in anime if you know what you're looking at.  Outlaw Star.  Date A Live.  NGE was like the declaration of war.  Kill la Kill was another rather bold one (Kiryuin = \"Yellow Dragon Empress\" and she stands in front of the light - IE - the Sun as the literal embodiment of Amaterasu and is the human in the series who subjugates \"god robes\" of \"purity\" to her will - IE - the mortal who surpassed gods).\n\nThis is also where we can get into the Kabbalah and the Tree of Life/Sephirot.  \"Sephiroth\" in Hebrew translates to \"The Beginning.\"  Gives a whole new meaning to \"One Winged Angel\" and the plot of Final Fantasy 7, no?  Anyway - the Sephirot is the stages of ... creation... enlightenment... it's an entire philosophical concept that is beyond the scope of this post.  Each stage is represented by an angel (and guess who makes appearances in Evangelion....) and these were allegedly the phases in which the universe was created.  Not \"days\" of creation, so much as the spiritual process of evoking creation.  You could almost think of it as something similar to the Eight Trigrams Furnace from Taoism.  Them darn Hyuuga, again.  You can also reverse the process, which gets into the \"demonic\" path of 'destruction' (although depending upon exactly how you view this, destruction is equally necessary to creation as part of a cycle, so rather than one being \"good\" and one being \"evil\" - a responsible use of either is necessary to a functional world).\n\nNow... if you REALLY want to jump into the abyss of internet history - you can look up what was called \"The Hidden Hand.\"  I'm not going to pretend to know whether or not this was real, or a troll.  The notions are plausible at least in terms of what is found in history.  A discussion of what this individual claimed is an entire thread in and of itself both in terms of moral valuations and civility, and it's also worth noting that this person admitted to there being factions within their ... order ... who compete with each other - which is to say that their decision to speak on the subject was likely an act of competition in itself - an attempt to control the narrative and perception in an way that benefits their own objectives.\n\nWhat they assert is that the \"Fallen Angel\" was a divine entity who descended to our existence in order to help out the 'creator' YHWH because he's a nice guy.  The Sephirot more or less represents the stages of that entity fragmenting itself to arrive here in our creation.  Their goal is the revival of this entity and they believe that certain blood lines are the carriers of aspects of this being's soul.  The assertion is that these groups then use their power and influence to orchestrate global affairs in such a way as to 'teach' humanity.  IE - they will orchestrate slavery to see if we fight against it - and if we don't, then it's because we have more or less consented to the treatment by failing to resist well enough... or... something.  Like they said - they are there with an agenda, and while they are somewhat speaking truthfully, I would highly recommend you watch Madoka Magica before you get too swept up by their presentation.\n\nTheir argument basically boils down to \"life and death do not matter because we're all part of the same god\" and \"we will one day all be taken back up to be a part of this god as part of a 7 dimensional compressed light\" (they love that assertion that they are from a higher dimension).  Their goal (as I am translating - so keep in mind I, too, have an agenda), is to effectively convince people to reject their individuality and side with either completely satanic principles or completely 'good' principles and thus save their god from being imprisoned here.\n\nIt's worth noting that I find this philosophy disturbingly similar to church doctrine as well as the often nihilistic philosophies of 'globalism' (which has become nearly its own religion by this point) and even their own philosophy of satanic despotism sort of rivals it.\nDate A Live or \"How not to summon a demon lord\" kind of plays to that.\"  If you want to understand how their... competitors... argue against them.\n\nWhich all ties into my first post and the question of what it is you consider important and/or real about the world we are in.  Perhaps they believe such things as what I posted above, perhaps they don't.  Perhaps it is just a means for them to convince their family and fellow ruling caste that it's their job/duty/divine rite to fuck with civilization like it's their own personal petri dish.  Either way - manipulating our perceptions of reality and understanding of what is real or valuable is key to their method of control.",
				"added": 1569260069
			},
			{
				"comment_id": 59,
				"body": "> [xcape2net](#comment_413_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Very interesting.  I'd never heard of \"the Hidden Hand\" before.  This makes it look like many of the major world leaders over the last 300 years have been part of it.  H3 would have a field day with this.\n\nI would take it all with a bit of a grain of salt.  While I have no doubts that such a viewpoint is not unlike what more abusive types would promote among themselves, I also think that this individual is trying to paint a much more complex picture in a way that favors their agenda.\n\nPart of that projected simplicity is the concept of world leaders and nations as we understand them.  I will point, for example, to my own family name: Graeser.  I'm not at all hiding who I am or really all that concerned with who knows.  The literal German for my family name means \"Of Graz.\"  Now, the meaning father-to-son as it was passed down is \"Keeper of the land.\"  You'll just have to take that anecdote as what it is - my father is no longer alive to ask about it, and I'm something of a black sheep in the family and have little relationship with my father's side of the family either here in the U.S. or abroad in Germany/Austria.  So - was my father wrong or just some family dogma?\n\nGraz has a much older name, before the Habsburgs and Babenburgs largely had the territory divided up among them by the Church: Gradec.  Slovenian.  Long before it was Graz, it was Gradec - and it was from Gradec that the trend of calling Slavic settlements -Grad came from (Gradec meant \"the little fort\" - hence - Grad meaning 'fort,' 'hold').  There were entire systems of governance and rule that were kind of... just absorbed and wiped out by the later systems of European power which came out of Rome, once it consolidated its authority under 'Christianity' (Rome never truly fell, it simply rebranded itself into the Church - which you will find the book Revelation strongly hints at... those old scholars were pretty wise and knew exactly what was being done to the religion and scripture... clever as serpents...).  What we call \"English\" really isn't even English - it's a sort of italicized German which replaced the native language after a series of conquests of the British Isles.  Which is where the legend of King Arthur comes from - prior to those times, and if you watch the Fate series - the incident Arturia (because waifu) laments and seeks the Grail to overturn (the conquest of Britain).\n\nThe really fun part of all of this is when you start tracing the nobility and their blood lines.  Specifically - the maternal blood lines.  There is a tribe out of Montenegro which was incredibly tightly linked with many of these groups.  While I can't produce a pedigree for either Melania Trump or Marina Abramovic - there is no doubt that those two are both closely coupled in with the Serbian tribal groups in terms of lineage - and it's important to note that point that was made about \"competition\" - IE - there is opposition to the people who have been dominating global affairs for some time.\n\nAnyway - that Montenegrin tribe was interlinked with French nobility, as well as the Romanov line - Anastasia Romanov, if she indeed survived, would be one of the few surviving members of this maternal line.\n\nRegardless of their spiritual beliefs - when I do check out the various ideas that there are certain lineages who hold power, and I myself watch the behavior of many people in power - I notice that there are always 'nameless' people who are invited to everything yet leave very little footprint.  From a logical standpoint, the Catholic/Roman authority structure which was installed over Europe had to broker for power in some way with the existing authorities over those territories.  It was not entirely feasible to forcibly subdue them - they had to be intimidated, bribed, subverted, or otherwise convinced to ally with the cause over time.  Those tribal structures and authorities would still hold considerable sway, even though they are largely outside of the public eye.  Within this system - many of our \"world leaders\" aren't necessarily puppets, but carefully selected and maneuvered pieces that have been cultured to believe and behave according to certain principles - where not outright installed as figureheads.\n\nIf you really want to go on a bit of a trip, look up how the British banks effectively bought out the failing Ottoman empire and created the House of Saud (as well as quite a few of those other small kingdoms throughout the middle east).  This becomes important when you trace the blood lines of who was in charge of Britain at the time - though not entirely surprising, it's interesting how much sense the current state of the world makes with that in mind.\n\nAnother fun thing to look at is how it was the British who created the American OSS - Office of Strategic Services - IE - what later was rolled into the Central Intelligence Agency.  Virtually all of the CIA was comprised of individuals selected by the Royal Intelligence Service.  Many of these people, also, had connections with an association of media publishing/journalism in the U.S. and nearly every CIA director to be named has come from that group - members of whom founded CNN.\n\nWhat is REALLY fun is when you track the history of the Muslim Brotherhood.  A man by the name of Hassan Al Banna was the founder - but the weird comes from the fact that Hassan Al Banna was in regular contact with an MI5 agent, Freya Stark.  Banna would later become a crucial asset to the NAZIS as he was, effectively, the reason Nazi Germany had influence in Egypt and Africa (kind of odd how the Nazis had territory in Africa before they even hit Yugoslavia, isn't it?).  After that, MI5 recruited Muslim Brotherhood operators as MI5 assets, directly, used them to create the first Arab-Israeli war, and then decided it would be cute to hand them off to the OSS and, when Congress found out the CIA was retaining Nazi operators on its payroll, blame the Russians.  Then they got them self ban-hammered in Egypt and the CIA put them in... guess where... guess where.... Saudi Arabia.\n\nThen, a curious guy by the name of Zbigniew Brzezinski (whose protege was a one Hillary Clinton) decided he would create a Vietnam for the Soviets in Afghanistan.  The Muslim Brotherhood was tooled up for media and propaganda warfare after the British promised to foot the bill for a number of things.  \n\nHere's the part that pisses me off about the 9/11 \"Truth Movement.\"  ... all of this stuff has been there for quite some time...\n\nSo, the CIA have the Pentagon train up a bunch of terrorist cells and train them in propaganda warfare (so they will appear just like us fighting for freedom), but since The Muslim Brotherhood was known to Congress to be a Nazi holdover cell, they had to come up with a fun new name for it - a long name with the word Mujaheddin in it and what most people refer to them as.  The second in command of this group was this famous individual by the name of Osama Bin Laden.  Officially - once they were done, the Pentagon recalled them to Saudi Arabia.  Bin Laden, on the other hand, decided to start his whole war to bring about the caliphate (Islamic State) in some future where they were able to change the structure of the middle east enough to do so.  This was all referred to as \"Operation Cyclone\" and is publicly available.\n\nOf course, Bin Laden wasn't exactly a free agent, either.  His operators were dispatched to Chechnya, Bosnia, Kosovo, etc.  This is why the Pentagon went on an auditing spree in 2000 and announced it was not able to account for a large amount of spending.  You'll... note the events of the following day.  How many times did the plane circle the pentagon before it hit the records and accounting side?  IE - did it matter what side was being hit?\n\nOf course, by this time, the funding network for the CIA was largely into the private sector.  The CIA is capable, under its charter, of creating any number of shell entities and has no duty to report the creation of operation of those to anyone.  This is especially problematic as one 'generation' of CIA leadership can create their own private funding and operator network that is completely unknown to even successive heads of the agency.  Thus - how can one determine what is and is not a CIA front?\n\nA Thousand Points of Light.  Why did President Trump bring that up?  If you track a few of those charity groups and the like, you'll find their accounting to be rather interesting, as well as their services (or the ability to verify those services are being conducted).  You'll find the arms trafficking routine in Benghazi that the CIA was conducting was very reminiscent of how they supplied militants in Bosnia via Croatia, using the Embassy to route weapons.\n\nhttps://larouchepub.com/other/2013/4031mb_hms.html\n\nThere's a particularly interesting story:\n\nhttps://www.youtube.com/watch?v=IRx7KkrT1QU\n\nReview the story of the Battle of Castle Itter with all of the above in mind.  Rather convenient how all of the people in charge there died.  Sure, some were given heroic ends, but why would someone like a tennis player be a prisoner?  If you flip the story around... and look at the Nazis guarding \"The Hidden Hand\" - ... then all of the events make a hell of a lot more sense, don't they?\n\nWhile we are on the subject of what in reality is real and what is fake... while material reality is fun to speculate about, it's also very interesting to consider just how much of our understanding of world events could be... far more false than we ever thought possible.",
				"added": 1569267680
			}
		],
		"1572864835_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 60,
				"body": "For something that you are looking to run as low power and embedded, like this, you would probably be better off to re-adapt the Python code of ZN into some other language, or consider integrating some functions on something like OpenCL.  Python is very high-level in terms of languages and is not known for being very efficient.  There again, neither is Java that these pages are often coded in, so I suppose it's a win some lose some scenario.\n\nIf I am understanding what you are doing, correctly - you are looking at, effectively, using a raspberry Pi to run Zero Net such that others can connect through the Pi without actually running ZN on their computers.  This would be similar to running ZN on an NAS or other application, you just want it portable and powered by USB.  ... Am I correct?\n\nIn any event, you would certainly want to restrict the zites running on it.  For longer term use, you would also want to consider the storage use, as write and rewrite cycles on flash are known to be problematic - though I suppose that all depends on exactly how far you want to take this idea.  Setting up Zero Net hosts like that is rather well pioneered territory and there's no particular reason why a Pi Zero wouldn't be able to handle small zites.  As someone pointed out, USB 2.0 might be a problem with regard to power and your two wifi adapters.\n\nAccording to USB 2.0 specifications, a device may draw up to 500mA at 5v - so 2.5 watts of power.  Many charging ports/devices support up to 1.5A - so 7.5 watts of power total power draw, while the port is designed to officially withstand constant power draw of 5A - or 25 watts of power.  In theory, most wifi units shouldn't consume more than about 300mW - and that's if they are transmitting on full blast.  But I'm not familiar with how much power a PiZero will chew up.  2 watts is not very much, though about typical of most smart phones' processors, I believe.",
				"added": 1572903684
			}
		],
		"1572897732_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 61,
				"body": "It's not really all that surprising.  The majority of people in the proverbial West are \"White\" - although the definition of \"White\" used to not include the Irish, Germans, etc - so it can be argued that our ideas of race are largely influenced by the 60s civil rights movement, which lumped us all together based on baseline melanin content.\n\nFunny story about that... the Soviets sent Communist agents into the U.S. to infiltrate the black populations and attempt to formulate another civil war/separatist movement by propagating communism among blacks in the South - back in the 30s.  They were met with overwhelming failure.  It wasn't until the 60s that the program took a new direction.  Black tradesmen were beginning to move North into the industrialized regions, bringing their families and trade skills with them.  As they began to underbid many established trade unions, the unions used their contacts in politics to establish what are known as \"Prevailing Wage\" laws - laws that prohibited governments from bidding on contracts that didn't pay workers the union wages.  They also began to petition for zoning laws, many of which would get enacted, which effectively prohibited the sale of property to individuals who did not meet certain residency or income standards, which locked the migrant blacks out of much of the housing market, creating the later housing programs that led to government-sponsored tenant housing and other things which decimated the black family.\n\nIt was around this time that the communists had their angle - and agitators like Rosa Parks began to instigate clashes with White populations in the North, exploiting tensions that were seeded amid early disputes primarily over economics, as unions wanted to maintain their labor monopoly.\n\nSometimes, the more things change - the more they stay the same.  The democrats are the face of the Soviet coup attempt.  It should also come as no surprise that most union pensions siphon their funds off into junk bonds to pay for the brand new Toyotas that ISIS was driving around.\n\nAnyway - another reason the whole SJW thing tends to be white is also because the concept of Social Justice Activism is built around a collectivist ideology, something which generally must be trained or taught to individuals.  The kids who grew up in school wanting to learn how to make a difference in the world got pumped full of an ideology that those who never attended school or who attended bad schools were never successfully exposed to.  This is why social justice activism is almost exclusively white and sees monumental amounts of support on twitter.  White preppy kids grew up to be social justice activists, at least on twitter, and most blacks either rolled their eyes at it, or were never paying attention when it was shown to them, anyway.  The blacks who still buy into it are those trying to come up with excuses for their kids after their 60s lovechildren didn't turn out to be Einsteins.\n\nNature has a strange way of correcting for error, sometimes.",
				"added": 1572905966
			}
		],
		"1570492144_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 62,
				"body": "A controversial political system?  I don't really consider most existing forms of government controversial, so I'll substitute two of my own ideas.\n\nThe first idea is mainly one intended for a space-faring civilization where government control is very difficult or impossible to actually impose.  The government as we understand it becomes replaced with something akin to an insurance company - a risk sharing group.  In exchange for payment, these groups would insure lives, prospects, territory claims, etc - and negotiate among each other to settle disputes by their clients.  Rather than strict laws enacted by fiat - crimes and consequences would be largely dealt with by fines.  Let's say I commit some variety of crime - my 'insurance company' will likely settle the offense with the other party and adjust my rates accordingly, as well as report my actions to institution(s) which other insurance companies review before agreeing to contract as my insurer.  So - if you start taking things out of stores without paying, you may not go to jail, but you're still going to pay.  Of course, violent crime or parties - insured or not - would eventually face bounties placed on their heads for capture or removal.  If someone goes around, killing members of a risk group - it's in the interest of the risk group who is contractually obligated to support the families and wounded to put a stop to it and to also research/invest in effective means of lowering damage/loss to assets and liabilities.\n\nHow do you get people to advocate for it?  I don't really think it needs to be.  Even governments will ultimately begin to take on this form of existence if they want to remain a valid power in a world where they can't assert claim over people and property based on its location.\n\nThe second idea is more just for the lulz.  Basically, you take a classic republic style government with a representative democracy.  Then, you instate a rule which states that any vote made by a representative is worth tripple its value if the rep is found impaled through the anus on the front lawn of the capitol the next morning, and only one vote can be held per day.  Essentially, if you kill the representative, their vote is worth three times as much.  Basically developed as an idea to counter activist politics.  When the people you're inciting will actually have everything to gain by killing you to swing the vote - you might want to be careful what you support.  There are some flaws with it, as I can see a system of sacrificial seats being developed based around martyrdom - but it would be rather beautiful if the progressives were to develop and support a system which blatantly murders their own supporters as blood slaves in order to achieve political dominance.  Kind of like a very blatant canary in the coal mine - if you see a group claiming to be good and engaging in literal sacrifices to vote for anything other than the end of sacrifices, then you know you're looking at an insurgency.\n\n.... As for advocating for that... we're practically there, already, it's just not a written rule that it is the representatives who must be sacrificed - and others are instead martyred for the progressive media headline.",
				"added": 1572907959
			}
		],
		"1611192483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 63,
				"body": "This would be like saying the horse-drawn plow would lead to the destruction of civilization.  Back in the day, upward of 60% of the population was employed in agriculture.  Most people spent the majority of their time tending to the task of producing crops or their own survival needs (such as gathering fuel for fires to cook with and heat or storing said grown food).\nThe reduction in manpower necessary to produce food is part of what allowed for the innovation which drove the industrial revolution and scientific innovation.\nUBI is a fundamentally failed idea because it doesn't address the economy.  The economy is the exchange of goods and services.  Money and Currency are simply mediums to facilitate this exchange and, when accrued, represent an invested potential to motivate labor forces.  IE - The fact I have 100 ounces of silver sitting on the table means that I can motivate people to take time out of their day to apply themselves to the thing I want done in exchange for that silver.  If their time is more heavily occupied, then it will obviously take greater incentive to get them to pull themselves away.  If all they were doing was getting pissed at their raid getting wiped for the fifth time that day, then they might be open to doing something that will at least get them paid.  UBI doesn't address the underlying exchange of goods and services, it simply provides a consistent injection of currency into the market, which usually does not stimulate market activity, but instead bloats prices for existing activity.\n\nThis isn't to say that I think automation will not have its own problems.  I am one who thinks that we are experiencing psychological issues because people have become so disconnected from anything productive in their lives.  We have entire job classes where people hold meetings for meetings to set up the next meeting to talk about what might happen at the next meeting.  These people aren't productive and they know it.  The 'information economy' has been radically oversold to the market.\nI live in suburban/rural America.  If you eat at a Subway, you are eating on something I helped build.  If you cruise on a ship, chances are you are being served from equipment I helped build.  If you have a metal craftsman toolbox, the only factory in the world that makes them is right here and I worked there - there is a 1/3 chance (actually a little better than that) that if you own a craftsman pro series box made between 2015 and 2018, I am the one who formed the top cover.\nI have a garden on the side of my yard... well - working on getting it established.  Buying a house the month before all the companies and government decided to shut down did not exactly advance my home improvement plans.  Either way - all around me are corn and soybean fields (mostly used for cattle feed, it doesn't end up as sweet corn or soy milk) with the occasional free range cattle.  One of the neighbors had their peafowl out last spring (yes, they are raising peacocks and stuff).  The city sent out a letter about people needing to keep their chickens properly contained on their property because people were getting lax.  The local diner is filled with local business advertisements for people who do things from build cabinets to people looking for a farm-hand to help them.\nThere is a steel foundry that just went into business up the road.  There's a rather large business that builds and services dual-cycle gas turbine engines for power production (a rather big government contractor... although they kind of screwed the pooch a few too many times and are on a bit of a naughty list).\n\nWhat do people in cities do?\nWhat is the demographic breakdown of employment?\nGrowing up, I never understood \"The Office\" or other such depictions of work life.  Work has always been a very practical affair rooted in something material to be processed.  I have seen the change as time has gone on from practically minded business owners and tradesmen to an invasion from HR of kindergarten teachers who think all you need to do in order to have a productive meeting is serve everyone crayons with a side of glue and tell them to let their imaginations run wild.  These are not practical people rooted in the need to solve real problems.\n\nWhich is a bit of a round-about way of saying that I think, for the sake of sanity, we will probably opt to apply automation conservatively in practice.  People need purpose and fulfillment in life (because without purpose, we wouldn't exist...) - and while it should never be up to a central state to place people in these roles, there will be a need in the market to provide people with opportunities to fulfill themselves regardless of the state of automation.\nWhich is where I return to the problem of currency and central banking.  What we have, now, is a system where the market does not have the deciding power.  The government can print currency endlessly, devaluing the currency in circulation, to drive the market in whatever way it so chooses.  This does not change under \"the great reset\" - it only gets worse as the banks, themselves, get to choose who wins and who loses in the markets the way the government used to.  You could even decide to stop paying taxes, today.  Exempt yourself via your filing status at work (people do this for numerous reasons, particularly if they have a side business on their own and prefer to not have with-holdings taken out) and just tell the IRS (or whomever) to go pound sand (... if you want to play dangerously).\nThe government isn't hurt in any way, really - they can just keep right on printing currency.  They will eventually soak up what they didn't collect from you in the form of taxes collected elsewhere as the real tax rate is 100%.  Because every unit of currency is borrowed into existence in the first place, there is a need for the system to collect every unit currency in circulation ... plus interest.\n\nThe result of such a financial system is that the economy will increasingly be consolidated via booms and busts into just a few megacorporations which are insulated from all failings by virtue of the fact the population has either so few options to choose from, or the fact that the government considers them a utility and guarantees their survival.\n\nAutomation didn't cause this.  The failure to understand the difference between Finance and Economics did.\n\nAutomation has the potential to allow us to radically reduce land area for agriculture.  All of the farms out here?  Not really all that efficient in terms of yield and land area.  They usually only get one crop in per year.  By comparison, a well tended garden can often get three rounds of crops in (depending on growing season) during a single season.  A hydroponic greenhouse can operate year-round and reduce water use and agricultural runoff.  Even if not fully automated and requiring a bit more involvement from populations, their nature means they could be installed far more locally to food consumption.  This would not put farmers out of business - it would likely change what crops they plant, frankly (and since it's feed stock out here, for the most part, that will not likely change any time soon) - but you would see more fresh produce in many areas and there are many parts of the world where this type of operation would be a godsend.\nAutomation is allowing home hobbyists and tradesmen to develop innovations which used to require highly experienced tradesmen and were only available to corporate contractors and aerospace applications.  There are people building electron microscopes as hobby projects.  3d printers are still in their infancy, but already the hobbyist open source projects are beginning to rival corporate solutions.\nA company I work for uses quite a few industrial cutting lasers.  These are pretty old... like turn of the millennia old - flying optics CO2 laser systems.  Most of the electronics for them are impossible to find - motor drives are all secondary market, the microcontroller was built by Delta Tau - and they got bought out and are barely supported anymore (I believe they were bought by Siemens ... but I'd have to check).  Suffice to say that most of what that whole suite does can be replaced with an Arduino with some FPGAs to tackle the DSP functions.  It would not be worth the time to develop and debug custom microcode to interface with the laser resonator (technically, the company is not even supposed to be supplying the vacuum tubes for them, anymore) - but you could probably use existing Marlin builds as a very nice start for replacing the whole of the control electronics.  Granted... if you screw up, you could also catapult the gantry into the stops, and the linear motors on those things are powerful enough to cover about five meters in a second.\nAnyway - my point is that what people are doing as hobbyists is radically expanding the realm of what people can spend their free time doing and lowering the barrier to entry for them.  I don't have to be a masters of machine tool/metallurgy or electrical engineering working at a company or university to have access to DMLS or similar technologies.  There's not yet a desktop ion beam sintering machine, but people who build parts for hobby racecars are finding they have the money for a machine the size of a refrigerator which can print metal parts from dust.\n\nThere are so many undeveloped resources on our planet and so many technologies simply not implemented because the economy has been under siege by the financial system.  UBI doesn't change the problem, simply alleviate the fact that minimum wage will never keep pace with hyperinflation.  Which the U.S. is now about six months from entering (give or take, it may happen sooner, it may happen a bit later - but the growth of printing is now geometric).  Automation, itself, is a means to amplify the efforts of individual men and women.  The internet and computers have greatly changed how we access and utilize information - the information economy was oversold and, ironically, the people most easily replaced by automation were those whose roles were rendered redundant with the rise of the internet and spreadsheet/database programs.  I believe that is a lot of the other problem we are seeing; the market should be selecting for these people to return to more real handling of material goods and assisting with that goal of becoming a post-scarcity environment... but it isn't, in a large part because of the way our financial system has consolidated the economy.",
				"added": 1611196977
			},
			{
				"comment_id": 65,
				"body": "> [zenanon](#comment_108_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Ah a fellow manufacturing person. IT integration here. A couple of years back a shop I worked at used Trumpf TruLaser cutters. I shudder to think what it would take to retrofit one of those things to open source controllers. The CAM software for those has pretty advanced output. [...]\n\nI worked with a TruLaser at another company.  Preferable to the laser systems I currently work on (although... that's not exactly fair as they are from two completely different generations).  To put it into perspective, we have a Salvagnini P2 that ... I believe the purchase paperwork indicates 1994.  The blank holder on it is not even an automatic blank holder - you have to manually change the width of the blank holder between stages of the run.  (I try to tell them that the thing belongs in a museum and that a new P2 or similar competing system could replace pretty much their entire press department ... but \"I don't want to do that because I'm limited as it's just a panel bender.\" )  It runs on NT 4.0 - which is glorious as one of our IT guys barely knows what it is.  Hell, one of the ring bus interfaces for the lasers uses a PCI to ISA adapter.  I went down memory lane when I saw that.  Which... to be fair - it works.  Old isn't necessarily bad (I deleted that program for a reason, Windows 10) - but when everyone is wanting to use teamviewer to remote in during troubleshooting, things get a little interesting.\n\nI'm probably doing what 'visionaries' like myself often do and simplifying a challenge a bit too much, to be fair.  Although Trumpf's CAM software seems considerably more advanced than what we are working with.  Although my role on the Trumpf laser was that of an operator and so I didn't get into the G-code at all.  They always wanted me to try and use the laser to pump out parts for the line ... which is normally supplied by a punch press.  I could tell stories... that I wish my father was still around to hear (as a 30+ year diecast factory manager and process engineer until the day he died).  Perhaps I simply underestimate the logistical complexities of operating a factory - but I could call up the shift manager and let him know when parts were going to run out on the line just from my own little view as an operator.  It almost never failed that we did run out of that part, the press(es) that run that part were sitting idle, Press was running parts they didn't need for some strange reason....\nAnd then there was the time I watched the pilot run get pushed back behind the volume order.  It was a parade of forklifts hauling painted units from assembly up to the scrap dumpsters.  For a week.  I kept asking our managers about that in the weeks leading up to that nonsense.... on the day I was forming parts and watching the parts I formed just hours prior get thrown in the scrap bin... I asked \"... so... you want me to continue running these or do we want to stop and figure out where we go from here... or... okay, run junk aye-aye.  Holy fuck how did you people get in charge of anything?\"\nThe problems with that were that someone went to engineering school.  The drawing had a -.000/+.003 inch tolerance on one dimension (a bend used to attach some trim) and cumulative progressive error on all parts of the box at earlier stages of production meant that they ultimately couldn't hit the final tolerance dimensions when the whole thing was assembled.  Keep in mind this is formed sheet metal, not optical components or electron beam milling.  Whoever designed this box thought we were kitted out for making rockets or something.\n\nWhich kind of gets onto the point you were making about companies wanting to get paid at the expense of their employees.  I often find this to be true.  Again, a lot of this is caused by finances rather than the underlying forces of economics.  Were it not for government creating the military industrial complex and indenturing most of the rest of the economy to recycling its fumes - then there would likely be far fewer mega corporations and there would also likely be far more pressure on congress to use legislation regarding anti-competitive practices to prevent some of the over-runs of the market we have seen (amazon).\nSomewhere along the line, something changes about a company - and I find it's usually after the person who started the business gives up direct control over that business and/or when the business is opened up to public stock or otherwise purchased as an investment.  The guy or gal who starts a company tends to focus on building a product, rewarding the people who contribute to its production, and seeing that product enjoyed by the people who buy it.  This tends to be regardless of the profit margin they ultimately get on their product - be it a very high profit margin or a smaller one.  Most of their profits tend to go into growing the business - expansions, new equipment, additional employees, new product branches, etc.\nWhen the business becomes an investment, however, the tone often shifts.  The CEO isn't put in charge of the company to make customers happy.  He isn't put in charge to make the employees happy.  He isn't put in charge to make new products, better products, good products, etc.  He is there to increase the share value of the company for the stock holders - to transfer the profit and wealth of the company to the share holders.  The customer is not the consumer of the products or services made, but the share holder.  The product is not the goods shipped to the store - but the stock (or the company slush fund - accounts received vs accounts payable).  Corporate accounting is an adventure in wonderland that can only be achieved when you can pay people to practice abstractions.\n\nThere is, as you say, also a bit of a class or caste warfare aspect to it as well.  I think this is somewhat agitated by artificial scarcity of the employment market.  Because there are so few companies operating presently and because there is so little opportunity for new business creation, the overwhelming majority of people are forced to compete for job placement.  This has resulted in absolutely absurd job posting requirements - which I am sure you encounter quite often in IT, as part of the problem is that the people making the job postings have no idea what the hell they are asking for, but that the market is so saturated with people that they can post an \"internship\" position requiring 4 years of experience as a senior developer... and apparently get someone desperate enough to apply for and take the position.  Stuff like that is rampant all across the market - even after the employment market improved by as much as I have seen in my lifetime (granted, I'm a millennial, so... it's not like I have 60 years of market observation under my belt).\nWhich I believe feeds into the 'toxic' environment I have noticed particularly in many urban areas.  Which is easier to demonstrate to hiring/promoting managers (who may simply oversee your department without having any idea what goes on in it) ... doing exceptionally good work and making things run smoothly... or outing your rivals for promotion as having made mistakes?  The more education and experience a position tends to require, and the more urbanized the area tends to be - the more hostile I generally find the people in those positions to be... for literally no reason.  I stirred up a twitter brigade with a bit of trolling a couple months back, and while hilarious - it was odd to me how much time these people devoted to trying to persecute, to them, literally nobody over the silliest little things.  They would ask deliberately loaded questions where an answer to the affirmative or negative could each be shot with an \"AHA!  You don't know what you're talking about!\" retort - and refusing to answer solid in one way or the other is twisted as being, again, wishy-washy or that you don't know what you're talking about.  I call this the \"gotcha game\" - where people, at least seem to have, built more of their career upon seizing on opportunities to make others look foolish than making their own work stand out.  To the extent they will brigade a random account and threaten it to not ever pursue a future in IT (or they will release the screencaps).  Which is adorable to think I need their approval - but the experience got me thinking about what their frame of mind and set of experiences had to be in order to get them to that point.  Part of that is just twitter.  However, I think there is more driving it than that - because we see the efforts elsewhere in business to try and blacklist various 'undesirables' from holding positions of perceived prestige and influence.",
				"added": 1611205487
			},
			{
				"comment_id": 67,
				"body": "> [zenanon](#comment_109_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Yeah that happened at that one shop I was working at: the founder died. His kids were nice but not really the steely-eyed entrepreneur he was. [...]\n\nIt's a combination of factors.  My time coming up through school in the 90s to mid 2000s was almost always focused on college - from elementary school to highschool, the entire focus of the process was on preparing for college education.  At no point in time was there ever a question, growing up, that I would go to college.  What I saw when I got there, however, was kids signing up for debts to match a mortgage.  Any concerns about this were generally brushed aside as \"well, it's an investment in the future - an investment in your mind.\"  Which isn't necessarily wrong, but not everything is worth the investment.  This was just ahead of the 08 market implosion.\n\nAnd the college hasn't stopped.  It's only gotten more expensive.  Only gotten promoted more.  The cost continues to balloon while the value precipitates off a cliff.  We have people consigned to debts which can't be excused.  Even mortgages can be forgiven if you file bankruptcy.  We set this precedent long ago into law that you can't own a person and that is part of the reason bankruptcy exists (granted, for some reason, the people who can still afford lawyers while bankrupt seem to benefit more from this than the people who get booted out of their homes... but I digress).  Student loan debts have gone into geometric increases and there's no sign of stopping.  These kids have almost zero chance of getting employed in the fields they have degrees in and will be in debt pretty much for the rest of their lives.  The interest payments on their student loan debt is greater than what they can afford to pay after deducting living costs.  It is slavery.\nTrue, they didn't need to sign up for it - but at least indentured contracts had a defined period of service and ended with some form of payment.\nThankfully, I avoided that trap, but I know many who leapt right into it without a second thought - and are kicking boxes in the back of a store with a masters degree.\n\nAnother aspect is that our education system has generally destroyed intelligence and inquisitiveness.  We focus so heavily on tests and knowledge based testing that we have almost completely avoided anything approaching a practical task.  How many people could take planks of wood and build a table with them?  Not even a nice table - just one that could be used.  One thing that has been noted about my generation is our desire to have some form of certification or qualification that we are experts before we do or attempt anything.  I have caught it in myself quite a few times and have to remind myself to push out and just get something done.\nWe've borked the brains of an entire generation so that they over-value certificates and qualifications while under-valuing their own ability to puzzle out a solution to something new/unexpected.",
				"added": 1611213240
			}
		],
		"1610998661_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 64,
				"body": "Fascism is essentially based Socialism.\nIf you subscribe to the belief that the rights of the individual are abrogated by the needs of the many, then you are accepting of the premise of collectivism.  Collectivism is the core foundation of Socialism and, arguably, Communism.  Communism, itself, is not exactly a real economic system.  It is the idea that the people who work within the institutions of capital ownership will eventually usurp the owners as the productivity per person expands and the economy shifts from one of managed scarcity to post-scarcity.  There's not really a model for how economics is supposed to work under communism as the underlying theory asserts that scarcity simply ceases to exist and therefore doesn't have to answer for precisely how the exchange of goods and services work.\nSo, one could argue that communism does not require collectivism or individualism.\n\nSocialism, on the other hand, establishes the idea that the needs of the collective outweigh the rights of the individual as it pertains to property and business.  For example, most socialists would argue that healthcare is a basic human right and, therefore, a doctor should have his or her prices for service fixed or otherwise managed by the government.  Consider if your job was suddenly considered a public utility and the government decided you were being paid too much to do it.  Further, you are now required to perform the job as the government outlines for all who come to you.  You are not free to set the terms under which you will apply your skills.  A more extreme example could be asked - do doctors have a right to retire?  Let's say, for whatever reason, you are doctor who decided to just stop showing up for work.  You've got more than enough money to do whatever it is you need for the rest of your life and don't need to show up for work, anymore.  Do the people have a right to show up and demand you go back to work to service their healthcare needs?\nThis is what I mean by the differences between the rights of the individual being usurped by the needs of the many.  Logic dictates that any time a government decides to 'provide' a service, it is not actually providing that service - it has no capacity to; it is compelling people within its nation to provide that service.  If the demand outgrows supply, then it becomes necessary to either reduce demand (rationing) or increase supply (forced labor).  Socialism necessitates totalitarianism.\nWhich is why Fascism is based Socialism.  Rather than deny this or try to deflect, fascism accepts this on the nose.  Fascism, as it was described by Mussolini and not unlike how it was implemented in Nazi Germany, is the incorporation of all a nations' functions and activity into the State.  One could think of it as all citizens being made part of a single state military.  Rather than corporations of private owners and investors, these are turned into wards of the state and the state appoints directors to oversee operations.  The state plans its economy according to what it believes its needs to be, it designates the accepted standards for its population.  It outlines how that population is to be raised and selected for placement within its labor and administrative needs.  Nothing is outside of the State, all of society is the State.\n\nOf course... planned economies rarely work out well.  Production quotas get missed and this snowballs.  Overproduction creates its own sets of problems.  Bureaucracy is slow to adjust to shifts in population need and market realities.  Human nature plays dirty with the system - rationed goods become valuable, trading valuable goods for additional goods or for political/social favors begins to undermine efforts to maintain market controls.  This creates dissidents who are then removed from society and, for the sake of practicality, interned and forced to work in attempts to shore up production shortfalls.  The State has a necessity to deliver on its promises in order to maintain the legitimacy and consent of the governed and as such will extract labor from those unable to present resistance to it.\n\nAs for the boogaloo boys ...\nThey are mostly a means for people to express dissent.  I do not believe the boogaloo boys, on the whole or in their majority, are filled with dangerous anarchists.  They are simply one of the few groups willing to flip a rather big finger at the government.  An old friend of mine once shared an article (which I didn't read too much of, because it was some lefty stuff) which presented the idea/argument that vulgarity was an important part of protest/speech.  In a very general sense, I agree.  When not allowed to use vulgarity to express our passions, it has little to no effect.  While too much vulgarity can simply be dismissed as insanity (particularly when it serves little purpose to any salient point) - but when someone is feeling desperate to be listened to, resorting to an extreme or vulgar display is often times a necessary way of underscoring the point that things are not inside an acceptable norm.\nFor many people in the boog groups and to some extent, proud boys and others - those groups are their outlet for this.  I would even go so far as saying that many in antifa are doing the same exact thing - it isn't about a fear or concern of fascism for many of them as much as it is a way for them to vent that things are not right for them ... by ... getting off destroying things and burning them to the ground.  Resolve their underlying causes for being irritated (which probably have little to do with what they say is making them irritated, frankly) - and they will likely stop showing up at the rallies.\n\nIf things come to blows, I doubt any of these groups will survive in their current state.  They are not militias who have solid ideas of military operations and logistics.  They are not political philosophers, historians, or political activists.  They will likely get absorbed into the groups not yet in the forefront who have been laying in wait for the outbreak of a civil war.  Which... the government will be gone within about 36 hours and lose most of its capacity to do much of anything other than piss itself.  The real problem comes as the factions begin to emerge in the power vacuum - who gets control over the military... who commands the resources to call the shots... who is willing to try and subjugate the other factions... do we leave the States intact as they were or do they get purged, as well?  Who has the nuclear football and what in god's name happens with all of that?\nThere will be a faction calling for a Convention of States to reset the national government after it kersploded.\nThere will be a faction adamantly opposed to that and who believes the political party leadership even at the state level needs to be purged.\nObviously - these two ideas conflict and the pro-purge side is not going to easily agree to sit down and cool their heels after just taking down the feds ... chances are they already took shots at the state while they are at it and under proper law should at least go before a trial for their actions - so if they don't continue to fight, they are very likely to be judged a criminal.  It is, then, logical that they would opt to continue to fight and gladly add those supporting the states to the list of enemies.\n\nWho knows what happens to food deliveries during all of this.  Overland trucking will become hot for piracy in a way it never was, before.  Internet blackouts will be a thing as big tech tries to clamp down on what it can while datacenters and nodes are seized by partisans of various groups who may or may not know what they are doing with them (but some might just opt to destroy them - ban that, zuck).  Since many ordering, scheduling, and logistics systems are all handled via the internet, these days, this presents a major problem.  There was a case a while back where trucks were having difficulty being assigned to loading docks because of network outages - this had all been automated on the internet to such a degree that companies were completely unprepared to deal with scheduling dock traffic without internet.  Power substations are another point of vulnerability as the transformers are all custom built on site and you can't just 'drop in' a replacement when they go boom.  During times of peace and because they are usually placed out of the way of possible accidents with commuters - we don't have to worry about this.  However, there are 12 substations that, if taken out, will pretty much put the whole country in a brown-out and severe rationing will have to be done in order to restore functional power to individual districts.\nNatural gas pipelines are a little more hardened, but also go through territory where the farmers have excavators.  So if they want to get at it to cause serious problems, they can.... or whomever can steal one from them can.\nWhen law and order begins to collapse, you'll find that the things people usually leave alone end up becoming ripe for the taking - particularly those who are looking to drum up war efforts.  All the neat toys at the farm and tractor store?  You're not very worried about the police showing up if you're planning to fight the military or another partisan militia.  If it's useful for the effort and available to be used - it will likely find its way into the hands of those committing to the action.  The term we use for this in the military is \"tactically acquire.\"  Generally, most factions will be vying for legitimacy with the local population and will probably not just walk up and take stuff ... if they see the population as friendly/neutral.\n\nBut I've rambled on long enough.  None of us will like a civil war should it go hot.  I think a lot of these people don't know what they are asking for or realize what it will do to our country just from an industrial standpoint.  It's all well and good to reclaim our country under the Constitution - I will point out that China and the globalist interests will not stand still during that time.  There are a lot of things we do not make here in the U.S. in any significant quantity and which the modern world relies upon.  If it does come to a hot civil war, then we must be ready to hit the ground running, afterward, to rebuild our industry at break-neck pace... the hard way and without outside help if necessary.  The globalists thrive on keeping economies interdependent not as a means to boost relations, but as a means of control.",
				"added": 1611201506
			},
			{
				"comment_id": 66,
				"body": "> [deuxzaron](#comment_64_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): You do realize you have a 50k limit right?\n\nYou can apply for more.  I believe the system has become automated for it since the early days.  The idea is that the limit keeps someone from creating a new ID and spamming the system.  After you hit 50k, you can appeal for an expansion to... I believe 100 k - then 200k - then 400.  I'm not sure what the system's settings are if it's automated - IE, what it's time gating is for expansions of capacity.  But you shouldn't be afraid of speaking/typing/communicating.\nI'm just a verbose asshole.",
				"added": 1611205795
			},
			{
				"comment_id": 68,
				"body": "> [pressf](#comment_5_1P49qK814LXkWtXWu9PvWEwDQC7iDagpGV): Just another posers that can't do anything important. True hardcore groups became known only after attacks.\n\nI think that's a rather naive statement.  While I think the boog boys are mostly a means of expression of passionate dissent, the fact that there are people who are passionately dissident from the system is not something to be overlooked.  Every soldier who has ever fought started as a wet behind the ears kid, knowing little more than what they've seen in media about war.  Every war fighter training program on the planet has come from little more than angry apes striking at each other and taking note of what works and what doesn't.\n\nDon't get me wrong - many of them have probably not seen war first hand and are a bit more tacticool than tactical - but the kids coming out of AQ training camps are less equipped, less skilled, and arguably less in shape than the average boog boy (nutrition is a hell of a drug).  The thing that many of them aren't prepared for is that you can put the xbox controller down, pause the game, or shut it off and go to sleep and wake up to eat a full meal the next day.\nThey understand real war will be bad, it will be destructive, and that it is not to be taken lightly - but the country always looks smaller on a map.  The battle you have in your mind is always one where you control the initiative and have your enemy set into ideal positions.\nThe reality of a hot civil war is that your home is as much a part of the battlefield as just outside the gate is.  If you are even potentially related to anti-government factions, there is the possibility a couple helicopters will do a rapid insertion on your front lawn and yank you out of your house in whatever you were sleeping in.  There is the possibility that local citizens will put together militias and begin doing loyalty tests and street executions - which may or may not be opposed by the government (if it has any authority at that point).\nYou can't turn a civil war off and on when you feel like being a part of it.  Once it starts, even people who try to stay out of it will end up being swept into it and it will touch their lives.\n\nI am one who thinks we should have been stacking bodies back when the federal reserve was made into a thing - so, at this point, I consider us in need of something closer to a nuclear cleansing - mostly as an illustration of how disgusting I view the state of affairs since the 70s.  However, I know that a civil war will be a nightmare none of us can wake up from, and while I will fight it if it comes and warn those who would be my opponents sternly... I really do hope there is some other means to restore our liberty.  Obviously - those in the positions of power will not let go of that power without the use of force, but things are much easier if that force can be judicious rather than a collapse into martial displays.\nAnd to that end - the boog boys don't have to be hardened, experienced warriors to 'do something.'  They just have to ... do it.  Be it part of an informed, well conceived plan of action, an emotional outburst, or a completely distorted view of how things will unfold - there is a very real possibility that something will get triggered and the sequence of consequences which come from it lead to what will be understood as the civil war maturing into a military conflict.  There won't be some kind of central announcement: \"We are now at war.\"  It will start with someone having enough and using force to oppose the government (and winning).  The response from the top of government is to go stompy-foot and send more police, soldiers, etc.  More people aligned with that citizen show up and start to say \"fuck around and find out.\"  Of course, the government fucks around.  Conflict erupts - maybe the government loses that clash, maybe it wins - it doesn't really matter.\n\nMachiavelli made a rather salient point.  A ruler can only use brutality once.  A brutal display can shock society to the reality of consequence and affirm who has control.  However, when brutality is the only response a ruler can conceive of and muster... metus est plenus tyrannis.",
				"added": 1611246021
			}
		],
		"1611236743_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 69,
				"body": "> [bangdingow](#comment_1_1EwabPQmNENzxMLaZY3Kh956Rpoa8QY6n6): Hey back after a bit of a break. Could someone post the bunker link?\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/\nI believe that will do you.  It also appears on the ZeroSites page.  Filter for English and it should be under the politics section.",
				"added": 1611264239
			}
		],
		"1611260804_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": [
			{
				"comment_id": 70,
				"body": "> [neuroticfish](#comment_31_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N): You should look at Tails.\n\nInteresting.\nI'm not really sure that's the direction I am looking to go for this specific project.  I am looking at giving it to friends and family so that their friends and family can all have something to work with and the ZN client be portable via the flash drive.\n\n> [binary1173](#comment_54_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): For the average user this will be far far out of reach for them. In part for their time and more importantly effort to even get something like this or TAILs setup on a usb drive. Convenience over security will always win when you try and force/coerce people into using this sort of setup.\n\nExactly, I am looking more to create something that I can hand someone, they can clip onto a keychain, plug in when they get curious, and check out with minimal headache.  Even down to the copy process so that it is as simple as \"stick two USB sticks in, hit this button, and you're done.\"  Although... doing this so that it works on Mac and Linux as well as Windows will probably be difficult.  My main concerns with copying are with proper handling of the users.json file so that they don't inadvertently copy all of their certificates to their friend or whomever they are making the copy for.  A cloned zite is not really a down side other than bloat that a user might have to go back and delete when they realize they have stuff they don't really want.\n\nThe ramdrive idea is mostly something I would like to be transparent and in the background, which may be almost impossible to work into the build of zeronet.  I'm still looking through the documentation and the source code release - and while I've done programming, before - it's mostly analytical and debug rather than constructive.  So integrating a ramdrive into ZN, itself, and the options for controlling it may not be very straightforward - and would likely be so significant as to represent a fork of the development build and also require zite specific coding to enable better control (particularly for imageboards and similar applications where the zite has a lot of built in controls for download and service management).\nI am also thinking ahead a bit.  When we had the influx of people from 8chan back a year and a half ago, I was impressed with the surge handling capabilities of ZN.  A board which saw perhaps five to ten active users per day went to, if memory recalls properly, nearly 2,000 people at any given time, with hundreds of posts per hour - and the worst problem we encountered was posts and replies getting misnumbered because the zite code was old and differences in network propagation would resolve to different post ordering.\nThe other minor problems were that people were not expanding their webzite size quick enough to support the rate of content addition, so they were seeing posts freeze and it took them a bit to realize why this was.  Another was that boards not in the heavy traffic area were starting to see performance drops because those who committed to hosting the whole board were serving up large amounts of content to the high traffic section, which was still learning the conventions of the system.\n\nIf we consider that the people interested in, say, Parler or Gab - or even alternatives to youtube, bitchute, etc - then the prospect of having thousands to millions of people attempting to use a zite is not beyond the realm of possibility - and I think experience has shown that the system would actually be able to support it so long as a more aggressive seeding of files is done on viewed zites and bloat is combated by use of ram, as opposed to hard drive, for the storage of files.  It's less to do with security or secrecy and more to do with enabling more aggressive baseline settings - let a zite take up a gigabyte of ram, seed everything you come across unless you've actively muted it, then dump it after it's been, say, twelve hours since you've accessed it or peer to peer requests drop below a certain threshold - whichever happens last (or you power off your computer/kill the ZN application, I suppose).  Only if you choose to retain the zite locally would it bother to retain the files on your hard disk (or wherever).\n\nFor example, if we were talking about a youtube-like zite, I could set myself to follow someone's channel, and my computer would automatically decide that needs to be stored permanently on my computer and seed it.  However, if I am simply watching a video while browsing about, it would defacto save to the ramdrive and seed from the ramdrive until its popularity declined or some time limit has been reached.  Perhaps some management of the ramdrive space would be needed - so that if size becomes a constraint, the files seeing the least activity get dropped off automatically (this would increase the relative demand for these files on people still hosting them, so provided the average user's ramdrive is properly scaled to the amount of data the average person uses in a given time period, the whole system should be meta-stable).\n\nThe baseline configuration settings of ZN work for what is going on, now - and the system, conceptually, has been demonstrated to be very robust in regard to surges in demand, if we suddenly get tens of thousands of people clamoring for a means of communicating with each other over the internet without getting the daylights censored out of them, then not all of ZN's design features will scale the same.  And there is a very real possibility this type of scenario could unfold in the near future.",
				"added": 1611276239
			},
			{
				"comment_id": 73,
				"body": "> [snahpanon](#comment_2_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v): barrier to entry is good. this just gives room for tech illiterate normies to muck things up\n\nThere are a few things you should consider.\nFirst - What is the difference between wanting to turn all of the internet into a propaganda platform for only approved ideas... and jealously guarding a platform from the presence of the unapproved?\nSecond - It should be rather obvious by now what the endgame of Google et al is.  How much longer do you think Zeronet.io and github repositories will be up?\nThe distribution of ideas and the representation of them in art and discussion is culture.  Whether you realize it or accept it, this platform represents a strategic weapon in the culture war.  It will not be left alone by either side(s) of that culture war.  For now, it is relatively obscure, but word will start to get around.\n\nDo you want people here, exchanging ideas normal for their culture and talking with friends and family like normal people months and years ahead of the court battles and shill insertions... or do you want the media to insert their shills, spamming child pornography, discussions of drugs, violence, etc ahead of the strategic war?\nOr will some of you do just that to try and drive people away?\n\nThe way I see it, there's very little way for normal people, happy to have a platform which is extremely difficult to censor and remove - would be that bad of a thing for your little club house away from the world.  It may be a bit more noisy than you like, but by their own reason of being here and by the virtues of how this system works, it would be incredibly difficult for them to 'muck things up' - beyond just chatting.\nI get it - 'normies' can be frustrating.  They can turn around and try to impose their own values onto the groups which created the platforms they enjoy.  But was it a bad thing that normal people began to get involved in bitcoin or monero?  The goal of bitcoin, monero, etc is to get us away from central banking cartels - while the induction of normies brought in the stock market, law enforcement and a great number of shenanigans - bitcoin was never going to be more than an eclectic 'dark-web' thing without it.  It would never be able to succeed at its goal.  The problems experienced with bitcoin never would have driven the popularity of what I would argue are superior evolutions of the idea, such as monero.\n\nEither way - the censorship battle of the culture war is coming, and this place is in the crossfire.  There are others, more mainstream - who may be the titans of said battle and carry the team.  But this place will be very unlikely to be untouched.  You know what the media is going to do its damnedest to portray the place as - and we all know that \"we must all be on our best behavior\" doesn't work when it comes to the media as they will insert their own to create the narrative they want to report on - or just make shit up if they can't even be assed to do that.  If there are, by that point, already hundreds of thousands to millions of families using zerofacespace, or whatever, to keep in contact with each other - then you know that millions see what goes on here and that it's not some criminal underground hideout.\nEither way - the streissand effect will kick in and people will show up, but more than likely the people looking for a place to vent disruptive behavior they got smacked on the dick for, elsewhere.\nBonus points if we have judges and lawyers using the place ahead of the attempts to shut it down.  Which will be a very difficult effort, to be sure... but for example, there is a local man who owns an ISP here.  Not a mega-corp, but still a sizeable one.  I intend to try and get a conversation in with him about something like ZeroNet.  Mainly, before I say \"hey, I know this cool thing\" - I want to try and get a read on his ideology and philosophy so I can gauge whether or not his reaction would be one of \"I can't have people running that on my network!\" or one of \"holy shit, why aren't we funding this?\"  ISPs have a complicated history with peer to peer file sharing for somewhat understandable reasons (rabid DMCA lawyers).",
				"added": 1611443869
			},
			{
				"comment_id": 74,
				"body": "> [snahpanon](#comment_3_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v): TLDR.\n\nAnd you wonder why the world is slipping away into oblivion.",
				"added": 1611606395
			}
		],
		"1611277411_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 71,
				"body": "> [bangdingow](#comment_6_1EwabPQmNENzxMLaZY3Kh956Rpoa8QY6n6): So whats the plan amigo?\nWell, what are your skill sets?  Or, better yet - what things are you hungry for - what gleans your bean or tickles your pickle, or whatever?  What can you lose yourself in doing?\n\nI'm a person with more ideas and knowledge than I could ever act on as an individual even if I were to live a thousand years.  I won't tell you what to do, but if you are at a stage where you are open to ideas, then I am sure I have one I can match you with and you can decide from there if it's something you want to pursue.",
				"added": 1611281685
			}
		],
		"1611289983_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 72,
				"body": "Hmm....\n\n16\n\"Get the popcorn, Friday & Saturday will deliver on the MAGA promise.  POTUS knows he must clean house (gov't) in order to 'free up' and demonstrate who has authority in order to pass important legislation.  This was always the priority.  Remember, AG Sessions cannot look like an impartial player that is out to get all former Obama team members as we need him for other important work.  All will come into focus and for anyone to think POTUS is not in control is kidding themselves.  Also, he's 100% insulated with zero risk of impeachment (fact).\"\n\nNational Popcorn Day was January 19th.\nWhen I first read this, I was very curious just how far in the future this would apply.  I also found it very interesting that POTUS is referenced, as opposed to Trump (which had been done in prior statements).\nWhile 'nothingburger' is quite a safe bet to make.  I will point out that there are some interesting things which line up, here.  I have no idea why Biden would deliver on any kind of MAGA promise - but I suppose we could also just substitute in that it merely meant that Biden would be asserting his authority over the system.\n\nIn any event, it has been obvious since the beginning that the real candidate they wanted as Kamala.  They might have found someone actually more unlikable than Hillary in that regard - which I didn't think possible.  Impeachment will not be pursued at this time by the house (and they will regret it, later).\nTheir plan is to use the 25th amendment to remove him from office - this much is obvious.... there's just a couple problems.\nThe 25th is not intended to be used against a President.  It is intended to be used in case of illness.  The President can inform Congress that he's going to be unable to discharge his duties and the Vice President will be acting in his stay.  Then, when he informs them he's back up and able, he resumes the office.  The Vice President can also inform Congress that the President has become unable to discharge his duties (let's say some sudden illness or injury debilitates him) and thus will be assuming the functions.  Members of the cabinet can also effectively notify of the same.  The President resumes office automatically after 30 days or upon written notification from the President that he is again fit for duty.  Congress can also decide to remove the President from office, permanently, after that 30 day period and having not received word the President is fit for duty - but must get a vote of 3/4 of each chamber to do so.\nI think we are in for some amusement, either way.  Biden won't leave until the investigation into Hunter is shut down, but the investigation into Hunter is the main thing that the establishment has to use as leverage against Biden to control the presidency.\n\n3063\n\"Remember this important fact.\nAdam Schiff is part of the 'gang of eight' (intel).\nit will become critical once 'gang of eight' material is declassified.\nLogical Q: If adam schiff 'knew' everything he's investigating and stating publicly to be knowingly 'false' [disinformation] why then would he take the course of action(s) (ongoing)?\nDid Adam Schiff purposely deceive the American public 'thinking' the 'gang of eight' material + other classified documentation would never reach the public domain?\nWhat 'insurance' did they hang over POTUS' head in order to prevent action?\nA fther's love for his children knows no bounds.\nQ\"\n\nI the case of Trump - it was the threats to sanction Ivanka's business if she didn't marry Kushner.  Study her sudden change of heart about their marriage in the celebrity gossip magazines and her (somewhat distant) connection to Oleg Deripaska via one of her close friends.  Kushner, himself, while not only being part of the tribe, also owes his business existence to Soros: \"A small loan... which I paid back, by the way...\" - Trump was always digging at Kushner with this line.  You want to know why his campaign was stuffed full of spooks and people the deep state could wire up - Kushner's a big part of it.  It's why Hillary proposed running him as a pied piper.  The DNC email 'hack' really only played into the building anti-rooskie narrative they had planned... if it wasn't a planned part of that narrative in the first place.\n\nIn the case of Biden - it's Hunter's rather bad habits.\n\nTrying to build up dates is often a bad idea and practice.  I am, however, going to say that we certainly live in days significantly deviated from what we regard as normal.\nOne thing I always thought was rather funny was the obvious psyop going on in the world of Q - IE - the media push for \"Qanon\", the hype, the media narrative, etc.  They were loving it because it would play into their \"right wing radical militia\" narrative, later.  They spread it far and wide because it's what they do and, rather predictably, it seems to have come to nothing.  Which is why they do what they do.\nHowever.\nOne thing that stood out to me was the fact that while 'Qanon' was a push to create a deranged cult... \"Q\" was very much an interesting anomaly.  The original pictures posted, the advanced indicators of events in North Korea, other stuff... didn't add up to it being just some random dude inside an agency leaking information.  Neither did it add up to a larp.  Nor did it exactly add up with the idea it was the President (as amusing as that idea was).  And, clearly, this person or group would be aware of exactly what would happen as a result of their posting - the Qanon counterintel op.\nWhich meant they were relying on it (again, assuming competence on the part of the player in the game).\nWhich indicated that President Trump would be extremely unlikely to be the one under which action would be taken as TDS was simply too severe.  The stated goal of putting an end to media lies and the tribal factions seemed very implausible under Trump.\nSo... what if Biden were to begin with what Q has indicated would be among some of the first actions?\n\"Who is Q?\" indeed.\n\nOf course... these are just the ramblings of a guy who has a bit too much time to think and type.  Take it for what it's worth.  I'm just noticing an alignment of the situation to the posted information.  I, myself, find it highly unlikely that Biden will do anything so soon.... there again... he did just sign a shit ton of executive orders - so he's already well into the range of radical at this point.  So him going full Palpatine on Congress over Hunter is not all that far outside the present Overton Window at this point.  Not saying it will be 'good' or 'for MAGA' - but that it will start the ball rolling on some serious shit if he does.  In theory - all of the investigative documentation that was available to Trump that he didn't act on is available to Biden, now - so he can go balls to the wall on his political opponents if he wants, and that is par for the course with democrats (even their own).\nCall it a last bit of hopium for the show to at least take a turn for the comedy genre.  If nothing else, I hope the image of this occurring could at least bring some chuckles.",
				"added": 1611298702
			}
		],
		"1611499319_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 75,
				"body": "The more people peer to a zite, the more reliable it becomes.  If I am understanding what the OP is talking about, correctly, he seems to be saying that when you try to push an update, if the number of peers is small enough, some form of botnet could be lying in wait to receive a zite or new zite publishing, receive, then fail to seed - or otherwise disrupt the torrent connection/propagation mechanism.  This would potentially be effective against new zites and ones with a small user base.  This could also result from simply having intermittent peers with unreliable connections or seed status, if I am understanding the description of the problem correctly.",
				"added": 1611607131
			}
		],
		"1611845039_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": [
			{
				"comment_id": 76,
				"body": "> [jager](#comment_58_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): No sympathy. What did people expect? Shorting is greasy, squeezing the shorters is greasy. None of this is what the stock market is intended for. Can point fingers all day long as to who the bad guy is, but if you fuck around with  this space, then you can expect to get burned. Forgetting that everyone is greedy and a massive number of useful idiots are usually manipulated by a few smart traders, is a tragic mistake.\n\nI think the WSB rebellion, if we want to call it that, is quite a bit different.  These fund managers shorted way in excess of stock available.  These are not uneducated, useful idiots who have no idea what they are doing.  They know exactly what they are doing - they are throwing money into the market to damage these fund managers.  They do not expect to make money.  While some may, the majority of them want to hurt these incompetent managers, who should never be hired by any sane or rational business - who keep being hired and recycled by the same corrupt, failed system.\n\nThese are not people who think they are going to get rich.  These are people who dropped a bomb.  With news comes awareness, with awareness comes participation, with participation comes ammunition.  The planes are turning around and will be ready to sortie very shortly.",
				"added": 1611855355
			},
			{
				"comment_id": 77,
				"body": "> [dv1](#comment_66_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): WB wants someone to pay, they never loose. https://www.rt.com/usa/513935-robinhood-market-manipulation-gamestop/\n\nOh, they most certainly can.\nTake a look at gold available vs gold deliverable on the COMEX.  You want to see a really fun burn of YOLO money......  You think the shorting of gamestop was bad... there are over 120 claims against each unit of gold deliverable on the comex.  A YOLO burn against that market will do two things - first, it will drive gold out of inventories to satisfy delivery as people cash out physical.... based on where they think the physical price is actually worth.\n\nUnfortunately, the market cap for gold might be a bit too high for investors to make the kind of dent necessary to send the price into the log scale.  Silver, on the other hand.... and the big boys trade in gold relative to silver shifts.",
				"added": 1611857312
			},
			{
				"comment_id": 81,
				"body": "> [binary1173](#comment_59_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): I have no sympathy for anyone using robinhood. It coined as stock trading which it clearly is not. It purely unadulterated speculation, nothing more. If people can't comprehend the risks and what actual investing  is then its time to educate themselves before jumping in like all other the morons.\n\nExcept that is not what happened, nor what is happening.  You act like people are too stupid to understand basic trading card buy/sell ideas.  They are not.  While there may be a few who thought they were going to make a lot of money - many who invested did so purely as a way to counteract the manipulation by wallstreet hedge funds.  How is it possible for there to be bids to purchase more stock in a company than actually exists... by over 40%?  It's not.  It's completely retarded that any multibillion dollar company would ever make such a bet individually or collectively.\n\nWhen people saw this, and with some basic explanation and research on how the system works, they came to the rather correct conclusion that these hedge fund managers were absolutely fucking retarded and exposed themselves to market risk.  GameStop and other companies were heavily shorted, meaning that those hedge funds believed the stock value would decrease.  This, despite the fact that gamestop was already trading at something close to $4 per share at one point in time.  They were clearly manipulating the price to keep it artificially low and all it took was some baseline capital injection to drive the computer algorithms and others positive.  Once the algos kicked in and saw that the stock broke key resistance (set by the short sale mechanisms), other stock trading routines automatically piled on.  Some billionaires also decided to have some fun as they are concerned with practical things and getting shit done and find what the rest of the financial elite to be doing as quite disgusting.\n\nNow, you may have a point in that the application has T&C that may or may not apply, here - but the fact of the matter is that when the public decides to get together and use easily accessible tools to make stock purchases and sales based upon their own valuation of the market or justifications for purchasing/holding stock, the financial system then pitches a fit and acts like the world is coming to an end because they got kicked in the balls for doing something that would destroy any rationally run business or market operation.  Whether that is baked into the T&C of the application is irrelevant to the fact that this is clear market manipulation on the part of large hedge funds and brokerages.\n\nIt is also irrelevant to the fact that it has completely dominated the weekly news cycle, has unified a number of populist left and right causes, and that it's not going away.  People are absolutely livid that people who do nothing but play financial loopholes get to be treated like kings while the people who do actual work in this society are treated with contempt.  The simulation, so to speak, is broken.  This is not the great reset the 'elites' had in mind, and the world is, one way or another, about to change.  What was for around a hundred years under the federal reserve (and some years prior), will be gone and it will be replaced by something else - be it the 'great reset' or something resulting from the fallout of the 'gamestock revolution.'  Or whatever history decides to record it as.  Provided we win and there is such a thing as history, I should say.  This shit will all get erased from having happened should the proverbial ivory tower get their way.",
				"added": 1611890102
			}
		],
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": [
			{
				"comment_id": 78,
				"body": "Copy LC; Send us your Censored and Delisted.\n\n> [qzm](#comment_23_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX): Could you give me a quick rundown on what actually happened? I only heard about this a few minutes ago.\n\nBasically, hedge funds shorted gamestop stock.  Shorting is basically where you borrow stock and agree to buy in at a lower price and keep the difference.  Except all of these companies shorted for 140% of the total stock on the market for gamestop.  So, a stock forum on Reddit had some users who did some research and posted how there was more short stock than there was stock to buy, and that gamestop did actually get a new CEO who was noted as being rather decent at managing companies in the past.  IE - there is reason to believe gamestop is undervalued and that betting against these hedge funds would make sense.\n\nAnd then it snowballed into \"Hey, the more the price gets driven up, the more these hedge funds have to pay on their shorted stock.\"  The establishment is now freaking out.  (((Shut It Down))) is the modus operandi.",
				"added": 1611858039
			}
		],
		"1611726067_13tGzarcdadLitoZsqPPW8WHypGtdNxz9L": [
			{
				"comment_id": 79,
				"body": "> [boot13](#comment_12_1PxMvud9KvbqaSZnV4piygA6dFTASwapHY): I love how 'muting assholes' becomes 'filter bubble' in the minds of those assholes. 'Listen to me!' they scream in desperation. 'Fuck you' we respond, and happily mute them. Next you'll be insisting that the mute function be removed, so we are forced to listen to the drivel of assholes. Not going to happen. [...]\n\nThere are perfectly legitimate reasons to want to have control over who has access to and interacts with a Zite.\nUnfortunately, ZN, at the moment, is rather bare bones.  What you are looking for will likely require some serious coding of the ZN application and its way of interacting with the zite.\nYou could, for example, require ZeroID or one of the other ID systems to post to a zite.  You could also require those to be whitelisted by the owner of the zite.\nWhere things get more tricky is in the creation of moderators.  The challenge with this lay in how ZN file/zite propagation works.  There is the owner of the zite and the owner of the post/submission.  There are, to my knowledge, no inherently supported ways of creating someone like an administrator or moderator who could have partial control over a zite.  It would almost certainly require considerable zite-side programming.\n\nYou could, plausibly, incorporate a ZeroID style system for your zite and build that into a user account system with various privileges.  However, if you were going to go that route, you would almost certainly want to consider customizing the ZeroNet application to have custom file size settings and rules for automatic seeding.  It would be entirely plausible to create a 'portal' using ZeroNet that is its own self-contained, peer-to-peer application, if you wanted.  At its core, ZN is basically just a set of special routines for requesting and seeding files via torrents and trackers and having your web browser open files downloaded to your local machine instead of requesting them from a remote server.  You could take the idea and rework it to suit your needs.\n\nYou could think of the current iteration of ZeroNet being something closer to HTML or HTTP.  It's more a protocol for how to use torrent files for an internet-like service rather than a platform unto itself.",
				"added": 1611859676
			},
			{
				"comment_id": 80,
				"body": "> [boot13](#comment_13_1PxMvud9KvbqaSZnV4piygA6dFTASwapHY): I think you must have replied to the wrong comment. I am not looking for anything.\n\nThere was a second part to your comment about looking to use it for clients for non-asshole purposes, or something like that.  I was approaching it from the perspective of developing some kind of business service or something on the back of ZN.",
				"added": 1611870768
			}
		],
		"1611883036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 82,
				"body": "> [orien3242](#comment_61_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): how do I delete older messages?\n\nThere is a 'pencil' icon that appears next to your post on the left-hand side.  You can use that to edit/delete your post/comment.\nHowever, this is not really necessary as the system should expand that for each user automatically on a sort of timed based lockout to try and keep down on the potential for bot spam and the like.  The main consideration would then be how much space you are taking up on as part of the zite seed, but while I might be considered an asshole for saying it, I fully expect to seed conversation.  Twitter has destroyed our society and stunted the minds of the public.  Brevity may be the soul of wit, but information is lost in the process of compression.",
				"added": 1611890882
			}
		],
		"1611787253_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 83,
				"body": "> [biznizman](#comment_6_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne): I recommended #2 to everyone anyway because of how fast \"hate speech\" laws/sentiment are expanding. It's quite likely your LEO will be searching your machine one day soon for reasons that have nothing to do with bombs or CP. [...]\n\nPersonally, I think this is the wrong attitude to take.  If we progress to the point where we are seeing raids on people's homes over internet posts, then it is time to water the tree of liberty with the blood of tyrants.  While there a few odd cases here and there that are borderline to this - the point remains that if you are going to rely on encryption to try and protect you from prosecution after the police have already physically entered your home (under warrant or not), then that ship already sailed.  There are far more people, at present, who think the censorship crackdown is absurd and illegal than people who seriously think it is a good thing and would support such actions by the government/police.  Do with that idea what you will.\n\n> [kixun](#comment_5_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq): Why stay away from 08chan and what is it?\n\nI don't know if staying away is necessary.  08 uses millchan's engine, which does allow users better control over what is downloaded/seeded.  I believe thumbnails of images are still automatically downloaded (not sure about seeded), but you can choose to remove posts from your seed or to even mute users on the zite (without having to mute them from all of ZN) so that you won't download something if they post illegal or borderline illegal content.  People are being a little hypersensitive about it if you ask me, but the group at 08 tends to be rather hostile to people not part of their clique.\n\n> [477](#comment_11_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4): zonateam, do you know all of the IP address connecting zeronet could see anybody? [...]\n\nThis is somewhat true.  When you send up requests for a zite or post yourself available to seed to a tracker, you are effectively announcing yourself.  Using a VPN or TOR helps reduce the risk.  This is one thing I actually wanted to look at incorporating into a Monero-like system.  Monero uses a double-blind cryptography algorithm to prevent the sender and receiver from seeing, directly, each others' addresses, as well as encrypting the public ledger.  You could plausibly use a similar system as a sort of decentralized IP routing system which would make who is sending and receiving from whom very difficult to discern.\nIn a server-client system like the standard internet, it would be kind of silly and counterproductive to use this, but in a system like ZeroNet, where there is already propagation delay and websites are viewed indirectly - the mechanism becomes less detrimental and can even be beneficial for setting up hypothetical 'streaming' services.  It could be possible to set up a ZN zite to directly link to another computer or set of computers for something like a webcam connection.  Similar to how, back in the day, we could connect to each other for a game using IP address alone.  In practice, you wouldn't want to directly tie users to IP addresses, but you could use layers of cryptography to create a stable system whereby people could 'facetime' each other using a decentralized network without having to expose their IP.\nApplying this at the tracker level to torrent hosting ... would ultimately create two separate torrent hosting/tracking paradigms, but would be a key part of making this work.",
				"added": 1611892612
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 84,
				"body": "> [dragondant](#comment_1_1P99tURa4T43muCjSejqPrYHsi9km7g2X6): The United States accuses China of producing the virus, and China accuses the United States of producing the virus.China has invited the World Health Organization to the Wuhan Institute of Virology to conduct an investigation, while the United States refuses to open Fort Detrick.You tell me, whose suspicion is greater?\n\nThe people who drummed up the idea of a medical emergency over a virus where the testing methods have an 80% false-positive rate and locked down the world's economy over blatantly financial and political purposes.\nOne of the first things I thought about when I saw the videos coming out of China was: \"Hmm... strange that these get around the proverbial great firewall.\"  Their method of injection into the internet and the claims surrounding them was designed to create panic and confusion.\nIt is my belief that the virus does not need to exist to account for the record of scientific data and behavioral reactions.  Governments quickly began giving out additional money to 'pandemic affected' areas, as determined by doctor diagnosis.  Doctors were encouraged and hospitals financially motivated to inflate their covid reporting numbers and to conflate common cold symptoms with a novel pandemic virus where possible to do so (and room to do so was ample).\nThe methods used to test for the virus do not require the virus to be isolated and are known to be prone to false positives.  The false positive ratio is so high as to allow for the appearance and persistence of completely phantom outbreaks which appear to have an epidemiological link, but are just false positives linked to false positives.  Screening has been rolled out on a level never before seen in human history, and applied very irregularly around the world, as well - with some nations opting to test the same individuals multiple times over several months while others only testing individuals in response to hospitalizations or symptoms.  With districts having reason to over-report infections and deaths, the accuracy of data is fundamentally compromised and cleaning the data to get an accurate picture of what, if anything, is going on is difficult.\nThere are always strains of the cold which run around, and some years it is worse than others for some people - for whatever reason.  At this point, the narrative and research surrounding influenza should honestly be brought into question about whether or not the people who think they know what they are talking about actually know their ass from applesauce.  But I digress...\nWhat is also suspicious is that the flu is nearly absent from our society.  Not only are fewer people returning positive tests for it, the ratio of positive tests is also far smaller than it has been in the past.  Given that SarsCov 2 is supposed to have a virtually identical lifecycle to influenza, it makes little sense that the measures against covid would be any more or less effective against it than the flu.  This is particularly true given the existing medical research which indicated that masks and distance were not effective at containing the spread of influenza in the past.\nOne must wonder if influenza was similarly amplified for political purposes as there are large contracts for vaccine drives and distribution each year.\n\nSo, if you want me to tell you which is more suspicious, I think the claim that we are dealing with something new in the first place is the most suspicious.  Show me an isolated virus and demonstrate that it can infect human tissue or even consenting human trials - and then we'll discuss whether or not there exists a means of accurately testing for it.  Until then - all we have is people making a huge deal about the fact that people occasionally get sick and it sucks.",
				"added": 1611897117
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 85,
				"body": "> [zeroseed4](#comment_39_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Your liberty finish where the liberty of others begins...if you are infected other could be infected by you and die because of this\n\nYou claim to be a doctor.  Your liberties end where mine begin.  Healthcare is a right, yes?  Drop whatever you are doing and get to doing your job that is my right.",
				"added": 1611948369
			},
			{
				"comment_id": 86,
				"body": "> [zeroseed4](#comment_47_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Sometimes we can rest my friend!  ...but tomorrow you Will not see me. Happy? \n\nYou missed my point.  I am saying that the logic you use completely removes your value as a human being.  If the 'rights' of others can be used to construe a requirement for you to do, or have done to you, something over the top of your will, then you are not a person.  You are a tool to be managed and maintained by whomever holds the capacity to rule you.\n\nI find this to be a moral travesty as each person is their own.  I should not be able to force you to be my doctor anymore than I should be able to force you to pick cotton or tea in a field.  If human beings are slaves - cattle - then we can be vaccinated, impregnated, sterilized, etc as any other domesticated cattle can be.  Frankly, My response to those who insist I am a head of cattle is one of potentially violent opposition.  I also reject the notion that you are cattle and would find your acquiescence to such ideology to be rather frustrating.",
				"added": 1611948869
			},
			{
				"comment_id": 87,
				"body": "> [zeroseed4](#comment_48_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Ethics and laws are applied to manage this. The only important thing, for any political choose, Is to take our responsabilities. We want the liberty to dont vaccinate? This can be ok if we know that many people could die because of full hospitals that Will not have the capacity to cure all ( In Italy anyone have the right to be cured. In usa this Is Very different...but maybe all should fight to have this right?)\n\nIf the laws were meant to benefit or secure the general population, then there would not be a continual effort to create an infinitely expanding list of new ones.\nThe idea that vaccines prevent or reduce the rate of hospitalizations has not really been supported in the instance of common illnesses - with a few notable exceptions.  There seem to be a certain percentage of the population which, for whatever reason and regardless of vaccine status, have an acute reaction to an infectious agent.  While there are risk groups which have been identified, the research has yet to isolate specific causal indicators as far as I am aware.\nThe real moral challenge is how to handle the initial stages of a pandemic where immunity is expected to be low and hospitalizations at their highest.  To which, my response is that the greatest common factor among recovery indicators is baseline nutrition/health, the presence of family for care, and access/training in first/aid and basic healthcare techniques.  In the same way that I was taught how to triage and to treat wounds in the military, it should be part of common civic education to teach elementary care.  I had a friend with a festering puncture wound on her stomach who could not afford to go to the doctor - and I found out it had been that way for potentially months without healing.  Did she really need a doctor?  Perhaps for stitches to prevent scarring - but the real issue was the infection.  Peroxide wash/flush once a day and cover with sterile bandage.  Healed up in a week.  Take the bedding out and set it in the sun for several hours if you can't wash it - let the UV kill a bunch of the nasties on it.  Try to get out and take a walk or just sit in the sun for a total of around half an hour a day - help recycle the cholesterol back to vitamin D.\nHaving family around to help when someone is sick and can't easily take care of their own needs helps a lot.  Having community action plans for how to handle health emergencies (or emergencies in general) should be part of the plan/strategy.  For example, in a mass casualty situation, the galley/mess hall (eating facility) becomes a defacto hospital for overflow.  To transfer this to the civilian world - does the local government have parks to host tents and supplies to prop them up - what about public sports arenas and stadiums?  Soccer fields could quickly be made to support helicopters.  These are the reasons we are supposed to have government.  Not to try and set up lockdowns and restrictions on our activity - but to give us focused plans of action to work through issues and crisis.\n\nMost of this doubles back around to the \"should we force to vaccinate?\"\nAgain, higher baseline nutrition and public hygiene trends more strongly with better health outcomes for any aggregate or focused study.  We can spend billions on a vaccine - but what about infrastructure to modernize agricultural methods and improve nutrition to the people?  Or civic training programs to improve hygiene and overall first aid/care?  IE - Which would be more beneficial to society - spending billions of dollars on a vaccine that we know will be invalid next year - or training people to recognize signs of stroke and how to respond to either prevent a stroke or reduce the severity of a stroke?  Or how about a 'surge' paramedic training course - a group of people who could be deputized when an emergency has been declared - people who have been given training and have monthly or quarterly training/planning meetings.  These are things we could be purchasing instead of vaccines that would improve civic response to a wide range of various issues.  Even if not an express medical emergency, having a system in place whereby volunteers can be readily organized to put plans into motion is far better than having everyone just hunker down individually and wait for the authorities to do something.\n\nI am speaking from the American perspective - our population is a bit different from some of the others out there in the world, and in theory our baseline education is that of an industrialized society (we are all fairly well familiar with standard units of measure, math, scientific processes/method, etc - even if parts of our society are foppish and zany).  I am aware there are parts of the world where this same concept wouldn't work as well, or almost have to be implemented within a caste that likely sits above the general public.\nEven so - I reject the notion that people are cattle to be managed - or if they are to be managed, only up to a point where they can realize their own self.  To some degree, people can choose to be cattle if they want and the painful truth is that a number of people do choose this as it can be comfortable.  But I am rambling at this point.\n\nWhile the technology of this vaccine is certainly fascinating, and there's a whole debate to be had about vaccines, effectiveness, ... the effectiveness/accuracy of current testing methods for viruses, and the consequences of vaccines past (I am of the controversial opinion that 'HIV' is a statistical phantom of a virus brought about by the need to explain immune system complications formerly obscured by SmallPox - as the prevalence of smallpox throughout the world would result in just about anyone with some form of immune disorder being infected a second or multiple times with smallpox, which was often noted as being severe and eventually fatal in people it happened to).... I can obviously write far more than most people want to write in a single setting.",
				"added": 1611952517
			}
		],
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 88,
				"body": "This, right here, is a perfect example of why the world is currently on fire with stupidity.\nA fact is a materially supported or verified statement of events.\nIn the example you used in another conversation:\nFact: A car crash occurred.\nFact: The vehicle speed at the time of crash was recorded by the computer at x mph/kph.\nFact: The software/firmware on the vehicle was [make and version].\nFact: There were found no standard indicators of brakes being applied on the road.\nFact: The Blood Alcohol content of the driver as determined by X process was [ ].\nFact: The emergency call center received a call from a phone number matching that of the driver's number just prior to the crash.\netc\netc\netc.\n\n\"The driver was suicidal and wanted to crash their car into a UFO to create a black hole to kill the President.\"  Is a ... claim - which could be called a theory, a person derives from their personal standpoint and the facts they choose to focus on... and anything they deem to be relevant.  These are called 'opinions.'\nSo would \"There was a glitch in the software which prevented proper application of brakes or other operation of the vehicle.\"\nOr \"Nothing to see here, just a crash, move along.\"\n\nOthers may choose to include further facts - for example:\nFact: Driver was a journalist.\nFact: Someone working with the driver claimed he was working on a case concerning a general.\n\nAre these facts relevant to the car crash?  Some might certainly choose to include this in their operating theories about why or how a car crash came to occur.  Facts are very easy to determine.  They are simply a record of what happened.  What you are trying to do is expand the definition of \"fact\" to include the interpretation of events, filled with many facts, to then define a perspective as fact.\n\nThe world is not rendered completely dysfunctional because people choose to not subscribe to identical interpretations of events.  Insert proverbial \"if we baked a hundred cookies every hour of every day for 4 years, we would not be anywhere close to the magic number of six million cookies\" meme.  The world is rendered dysfunctional by people confusing claims, theories, interpretations, with facts, as well as when people try to defraud the public through the fabrication, censure, and defacing of accuracy in record.\nBelieve it or not, you can actually work with people who reject the theory of relativity or who even choose to think the world is flat.  You can't work together when they think you must think the same thing they do in order to be a relevant human being - or when they are hellbent on distorting every aspect of material reality to support their world view (particularly when it has nothing to do with anything - how long the part being manufactured is has nothing to do with whether or not coworkers believe in aliens).\n\nBy the way... how in the hell did you even find this place?",
				"added": 1612011794
			},
			{
				"comment_id": 89,
				"body": "> [binary1173](#comment_61_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): Everything we see is a perspective not the truth. Everything we hear is an opinion, not a fact   Marcus Aurelius\n\nThere is some truth to this, but at some point you have to agree to a common mode of record.  Even by the most extreme interpretation of this, that the world I live in only exists as a product of my perspective reality, there should at least be some common consistency within my observation of it.  We distinguish between dreams and reality because of the persistence of observed consequences.",
				"added": 1612044260
			}
		],
		"1612193748_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 90,
				"body": "You could do 08chan, you could also clone millchan and disable image posting to turn it into a more classic message board style system.  The reason why I would caution on 08 is that some people might get a bit weirded out by the idea they are hosting a site where users can and do submit pornography/hentai, some of which is deliberately intended to be shock content and I believe it is Canada, for example, which considers loli hentai to meet its definition of child pornography.\nSo if you clone it and disable image posting, it would keep the inevitable shills and trolls from being able to run people off with \"you are hosting child porn\" style attacks.\nAnd, yes, you will encounter that method of attack.  While millchan does support mute listings (think of them as kind of like opting into a ban list) - you have to opt into them on a per-user basis and if you have a flood of people fleeing censorship you're going to have enough chaos trying to get them to understand expanding zite size allocations and the importance of seeding.",
				"added": 1612210959
			}
		],
		"1612458385_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 91,
				"body": "> [styromaniac](#comment_2950_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Maybe Qanon is right about this, but I've seen a lot of what I call BS from them as well. [...]\n\nAs someone who has followed the whole ordeal since November of 2017....\nThere is what Q has posted.\nThere is what people have thought it may mean.\nThere is a disinformation campaign pushed on social media under the whole \"Qanon\" thing, which includes all the standard fare of media disinformation campaigns.\n\nWe are, apparently, going with a sequence of events I would have preferred to not go with, but nothing can stop what is coming goes both ways.  The culture conflict in society will have to carry out to some conclusion or another.  The 'elite' plan to conquer the world will have to resolve.  The financial apocalypse on the horizon will have to resolve one way or another.  What Q did was communicate that there were people in positions of authority who are going to move to prevent the worst of the maoist-style attempt at a takeover of a nation, as well as the importance of not dividing among each other - as divide and conquer is part of their plan.\n\nDon't get me wrong - I am not saying that we should all sit back and wait for someone else to handle it.  Timing is everything - Trump's presidency interrupted the flow of their proverbial plan, interrupted the narrative order, etc.  Everything that is going on, now, was originally supposed to happen at the beginning of Trump's presidency (well, aside from the corona thing).  Consider the \"muh russia\" narrative and hackers.  Suppose there was some sort of situation where the powers that be had arranged for a 'Russia hacked the election' narrative and there was conveniently clear evidence to indicate this.\nThis would have allowed the proverbial machine to do what they are doing, now - \"domestic terrorists\" etc and remove Trump from office under the whole allegation he was installed by Russia; his supporters were Russian backed terrorists, etc.  They were actually expecting a much more stiff fight over the election than they received - and their 'win' cost them far more than they could possibly imagine.\nHowever, the pandemic narrative has been so absurd as to be a naked power grab.  The election fraud was so naked as to make most suspicious of the entire process.  Even those who were happy to have 'won' because the orange man is bad were happy to have won, they knew it was not a legitimate election ... it's just that they rationalize it as 'for the greater good.'\nComing up on this is also the inevitable hyperinflationary collapse of the dollar.  While I am no expert on the matter, I estimate that somewhere between June and October, we will see another doubling of the M1 base currency supply from the fed.  Part of this has been egged on by the WSB short-squeeze mob which has injected unprecedented amounts of retail volume into the stock market and forced liquidity covering that has left other parts of the market surprisingly short on liquidity.  This trend will likely only amplify as the unprecedented amounts of deficit spending by the government seeks out long term holdings within the market.  Even without this effect, as the world tries to start the economic engines back up after having successfully claimed the bully pulpit - they will find the economy unwilling to move and sluggish - they will do a cash injection again and this will be what throws the whole system into the log scale.\nTo head this off, they will likely try some form of federally created crypto, but there are already ample markets elsewhere which have longer standing - and they will be effectively stripped of legitimacy while trying to use full faith and credit to back the engines of a new fiat system.\n\nThe best laid plans of mice and men, as it were.  We have many opportunities that would have, otherwise, been very difficult to realize had Clinton gotten her way during the prior election.  It's also very possible that China is bucking the elites' plan a bit more than they anticipated and there would also seem to be internal movements within China that are signalling China's own desperation to enter into conquest is an effort to distract and even dispose of portions of its own population.  Though I will be unlike many and say that the only thing I disagree with in terms of their muslim policy is the harvesting of organs.  That's creepy.  I'd opt for a proverbial wall and a catapult to fling them back over it - a plane ride with a parachute, something to send them back.  But many people are still not ready to understand that diversity is an obstacle, not a strength - and some things are simply too deviated from the local norms to be approached with a mindset of inclusion....\nBut I digress...",
				"added": 1612495823
			}
		],
		"1612664212_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 92,
				"body": "The Dollar is designed to collapse.  Because every printed dollar has interest due on it to the holders of the Federal Reserve, the only way to make the interest payments is to borrow more (at interest).  At this stage in the game, there is no way to stop the collapse of the currency.  There were some interesting strategies deployed by Trump which made better use of the boundless printing and set us up a bit better for the coming route to zero, but I think the route to zero will happen far faster than anyone realizes.  Many are saying \"years down the road\" - but I am of the opinion we are looking at months.\nWe JUST passed a horrible spending bill and there is already 1.9T on the table.  Between June and October, we will be looking at a 4T spending proposition - and I lean toward they will be trying to pass such a thing in June.\n\nThe effect on inflation will be more absurd than anything we've seen, before.  The reason is that dollars are a liability - no one will consider holding them a good idea as the cost of goods and services begins to increase.  Within the past 3 weeks, the price of lumber has tripled.  While it will take a bit for all of this to propagate, once we start seeing consumer commodities inflate, the game is up.  People I know are cashing in their 401Ks and other such things to go for real estate and other asset holdings - and loan rates are very low at the moment, as well.  The liquidity slam that is about to hit the market will be something for the history books as people rush to spend dollars before their value inflates away.\nThe democrats will respond to this the only way they know how, and go to a direct UBI as a means of keeping the 'society is just three meals from anarchy' thing from swinging around to bite them.\nIt will, however, not work as they have destroyed all productive activities in favor of various forms of faggotry - at least inside of cities and areas reliant on their votes.  Many suburban and rural areas will begin to trend onto silver, crypto, etc.  Even large companies will choose to settle with each other in gold and crypto securities rather than hassle with something as infinitely depreciating as the dollar or the poor bastards who hold bonds denominated by it (you think we are getting fucked over - imagine holding a bond for a currency with a value depreciating as an inverse square of time).\n\nI think Trump is aware this will happen - as are most reasonably informed people who have studied history.  That said, I think people are taking this whole 'enjoy the show' thing a bit too literally.  The battle is not won insofar as 'we need do nothing' the battle is won by way of our opponents being stupid.  We don't necessarily need to fight against them - we need to fight to bring about a better world from the consequences of their failure.",
				"added": 1612829689
			}
		],
		"1612926726_1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93": [
			{
				"comment_id": 93,
				"body": "You are visible.\nI'm not sure exactly which type of coding site you would be looking for, there is a sort of zite index here: http://127.0.0.1:43110/Sites.ZeroNetwork.bit/\nAt least, for those who have submitted the existence of a zite to it.",
				"added": 1612928854
			},
			{
				"comment_id": 94,
				"body": "As a reminder, you can also mute people who you feel might be criminal or you otherwise do not wish to participate in the propagation of their content.  I'm not sure if the post prompting me to make this statement is someone seriously trying to advise on the distribution of illegal content, or is just glowing in the dark to try and scare civilized people away from the platform.\nA note on \"being anonymous\" - every file requested and submitted is part of a peer to peer torrent tracker.  People who regularly do things that should get them arrested are either a wealthy politician, an FBI agent with access to the library, or some asshole in a third world country.\n\nI'm not recommending censoring everyone who you find to be objectionable; but there's a reason to mute someone who greets everyone at the door with: \"I share child porn!\"  If he isn't there to try and scare people away and is being serious, the only reason to pay attention to him is to figure out who and where he is - and I personally have other things I need to do before I can do the job of our paid officials as a hobby.",
				"added": 1612931492
			},
			{
				"comment_id": 95,
				"body": "> [zonateam4622](#comment_66_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs): stupid .. funny the shit of you write yess you can ignore me if you want haha ..you can try to scare away poeple of the zeronet by saying they are fbi agent .. i recommended whonix all pass over tor ! .. [...]\n\nThe only legitimate reason to build a database of child pornography is to identify those producing it so that they can be properly removed from existence.  I'm not talking about henati lolis.  I can only assume you are talking about real children who are being used for sexual gratification.\nI'll entertain the idea that the government can't be trusted to actually investigate criminals, these days, and as such a public database of evidence can exist on that thin margin.\nHowever, nothing about your demeanor suggests you are undertaking such a task.  You reference a 'fight' as though you are some kind of liberator.  I would, however, suggest that it is a disturbed individual who would take advantage of a child's nature to have sexual relations with them.\n\nWhat becomes of these children, afterward?  Five years down the line - ten years - twenty?  The pedophile doesn't love a child; they feed on the corruption of youth.  Simply looking at the outcomes among children who have been subjected to sexual experiences before puberty shows nearly 10x the incidence of self-harm, increased odds of homosexual and transexual patterns, higher incidence of drug abuse, very high incidence of domestic violence in partnerships, complete failure to develop healthy intimate relationships, etc.  The list of cases where some manner of pedophilia was not destructive to the child is small enough relative to the set of data to be strictly in the realm of case studies.\nPedophilia has never been, at any point in human history, a constructive behavioral trend.  It has been almost exclusively a destructive behavior, the incidence of which is marked along with homosexuality and other general faggotry to signify the imminent collapse of an empire.\nIf you want to have an argument about whether or not \"children\" includes post-pubescent teenagers, then there is room to argue - but if a 30-40 year old man goes to hang out at the highschool to pick up 15 year olds because the legal age got changed to 14 (roughly the age of puberty) - you can bet there will be a breakdown of good social order when the parents find out.\n\nYou are a sick individual for whom society has found no means of treatment or cure other than removal.  In an ideal world, there would be some way of helping you not hurt others' children or some way of allowing you to live how you wanted without actually causing harm to others.  The world is, however, not ideal and the recidivism rate of pedophiles in all cases tracked thusfar has been 100%.\nI've walked in the wake of the victims of child sexual abuse and pedophilia.  I value their lives and well-being over yours and will not accept the risk of creating more victims where possible to prevent that risk.\n\nI can share my opinions with my local salon stylist, my grocer, the people in the local bar, etc without getting my skull caved in.  There's a difference between fighting against censorship of society and fighting the better judgment of civilization.",
				"added": 1612942626
			}
		],
		"1613257982_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 96,
				"body": "> [radiator](#comment_61_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): sad state of affairs in our country.  [...]\n\nThe question is \"what do we organize to?\"  Most people are thinking, not completely incorrectly, of war in terms of armed conflict.  However, armed conflict is what occurs as a consequence of the achievement of objectives by other groups.  While you may be able to get some radicals together to attack a government building or something - this in and of itself has little overall purpose or motion behind it.  A civil war starts when economies begin to delaminate from each other.\nFor example, I am currently paid in dollars at my place of employ.  While I have some ideas of self-employment and business on the side - none of it can completely replace my income - and even if it could - I would generally be trying to take alternate forms of payment, such as silver or some form of crypto... which isn't necessarily easy to translate into bill payments or grocery shopping, just yet.\nThis is the challenge that needs to get organized and orchestrated - business and business investment outside of the current progressive mafia in HR and board rooms.  The reason people comply is because they are unable to use alternate means to resist/oppose - their existence is tied to the mechanisms of the system and 'unplugging' them is not as simple as getting them to be aware of the fact there is a system and it is ruling them.  They get it.  What are they supposed to do about it when wrongthink gets fired or otherwise harassed?\n\nOnly after you have that alternate system of freedom (or at least based on realist goals of getting things done - the bigotry!) - then you can and will get people who will stand up to not only defend it - but expand it.  If it allows them to preserve their homes and families, as well as their way of life (or, dare one say - improve it) - then they'll be aboard.\n\nNow, if you want to play 4D chess, you could put a hammer and sickle on it with a black power fist or something, and just respond to everything with \"workers of the world unite!\"  Since the government has basically made being a productive and sane individual illegal of late, I expect it might get more traction among conservatives than anyone could possibly imagine - since you might have to quite literally break into your place of work and toss out the owners just so that someone with a spine can make profit.",
				"added": 1613516365
			}
		],
		"1613575949_1FK4RtquACRvftcJWV6LGhxjfSjnCftMdT": [
			{
				"comment_id": 97,
				"body": "The next big thing in the crypto world?\nDepends on what you mean by \"the crypto world\" - I think the biggest factor in the coming months/years will be the movement of the market to valuation in some combination of cryptocurrencies and precious metals.  IE - when the market begins to think in terms of \"how much 'bitcoin' or 'monero' does this cost?\"\nMany seem to think that the coins are about investment - which, for the moment, most of it is.  It is large financial interests at the moment looking to preserve their asset values and operations.  A large company, for example, might look at owning Bitcoin, Monero, Silver, and Gold (likely in ETF form - which has its own risks, but whatever) because they are anticipating either a wave of inflation to obliterate dollar holdings or, somewhat more plausibly, anticipating a need to settle contracts in holdings of crypto.  IE - when the lumber mill says: \"Nope.  Not taking any of that dollar nonsense, here.  Aint enough of that to buy the truck to haul the sawdust, much less get you a cord.\"  Businesses, banks, the real economy still needs to move goods and services and there will be capital exchanges between them.  The economy will transition away from dollars and onto some form of crypto or silver/gold, and many may first do so via some proxy of ETF or the like (and invariably, the ETF will Mount Gox itself - because that's what banks do - they would literally kill themselves to run a strightforward, honest ledger).  But the currency will continue on in the background.\nThat all will happen as certainly as a ball lofted into the air will fall to the ground - so I consider it as being something that has already happened.\n\nWhich leads to the next big question - Are the Crypto currencies we have representative of the end state of the technology?  I think the answer to that is a rather obvious no.  We are in the transistor radio days of digital electronics as it pertains to cryptocurrency based coins and concepts - and it's difficult to see exactly how people and markets will choose to integrate these systems together.\nFor example, I have been contemplating the idea of a sort of public security infrastructure utilizing a cryptographic blockchain.  The idea being that documents submitted into the system would be placed under encryption and the keys to this system maintained as part of a routing system.  For example - in Monero's system, it can connect two accounts together for a transaction using one-time addresses and the like, making it such that people never have to know who each other are.  Flipping this same concept around a bit, it would be more than possible to maintain sets of cryptographic keys to documents which could be accessed by things like self-executing contracts - say automatic time declassification, or by result of some form of public vote.  This type of system could also allow for database searches of classified information in a blind fashion - the system able to return results and peg them for early or conditional declassification requests.  IE - I could submit something akin to a FOIA to the system and that FOIA request be retroactively applied - anyone with the key associated with that request could return all of the search results as the system has declassified.  These could also be keyed to some form of credentialing system and tied in with a broader cryptographic governmental system whereby we could participate in government as voters and respective office holders and agency officials.  IE - once a person is voted into a senate position, the system credentials them with those authorities.  Appointed judges would be recognized by votes within the system, etc.\n\nAll of this is theoretically possible as part of some form of persistent cryptographic network - be it 'block chain' or some enhancement thereof.  Whether or not people would accept such a government concept is an entirely different ordeal.  However, something like it could be incredibly valuable and if there were some form of monetary coin attached to it - it would almost certainly supplant any existing blockchain currency.\n\nOn the more mundane side, the cryptocurrency which lasts the longest will be the one that best meets the demands of the market for such a currency.  There are a number of questions surrounding bitcoin's longevity as people early on forgot their wallet passwords and ultimately lost their bitcoin forever and whether or not transaction fees will be enough to keep miners sufficiently invested to preserve network integrity.  Already, ASICs have largely centralized mining operations and it's likely that should BTC become a monetary standard, the world of mining it will become almost exclusively a banking and government actor affair.\nBoth of which are reasons I think Monero will likely overtake bitcoin in the longer run as the better overall public currency.  It may not trade on wallstreet the same way, but I don't think it has to, either.  But there are questions about management of the blockchain length/size, as well as the overall ability of the network to confirm the number of transactions society is likely to place on it, particularly hundreds of years into the future.\nAlthough that is almost impossible to see into, completely - today's microprocessors and computing equipment may be seen the same way we would look at an abacus or even a mechanical gear computer - an interesting study of the methods of an era to solving a problem rendered obsolete by modern innovation.  Or, perhaps they will be seen as timeless as a spade, wheel, or fundamental as a gear.  That part is difficult to tell simply because the discovery of some new phenomena we can only vaguely guess at on the premise of magic may be discovered in the realms of material science to completely redefine how we interact with basic physical phenomena.",
				"added": 1613716730
			}
		],
		"1613761105_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 98,
				"body": "Well, if you believe the internet as we understand it will be functional and accessible in the wake of a market meltup and economic collapse, then crypto are probably superior to physical gold and silver in terms of overall investment performance - provided you choose a coin/standard that will earn serious purchase in the economy during/following such an event.\nOn the other hand, I can hold a silver coin in my hand and present it to a person for trade, who can verify it's at least a shiny metal (even if they can't verify it's genuine or don't know how to).  It isn't dependent upon the presence of an internet or other network to contain value.  And, while, sure - 'you can print out a bitcoin' - the problem is ... how can anyone verify I am not walking around, handing out the same bitcoin to everyone?  Whereas a single bitcoin can only exist in the network, there is no reason I couldn't simply engrave multiple 'coins' with the same character sequence of the bitcoin I printed out and try to pass them off as unique instances of the coin.  In the event of widespread network outages (which has its own implications particularly if nodes in regions become isolated) - the crypto coins can't be circulated the same way a physical asset can.\n\nSo, I suppose the performance depends upon exactly what your view of the economic transition is - if it will be something like a New Age Bretton-Woods deal, or if it will be considerably more apocalyptic.  I am of the mind it will be more apocalyptic and it is people's normalcy bias that leads them to think in terms of investment performance.  Consider - in a real meltup of the commodities market - the currency used to settle the purchase of raw material goes toward procuring additional material by paying workers to produce, transport, refine, etc - as well as settle all other associated material costs.  This includes things for infrastructure - like fuel for powerplants and overland delivery - as well as the people who will be paid to deliver it.  When the power begins to fail because delivery contracts can't be settled - even if the market is in the process of re-valuing onto, say, bitcoin, the fundamental challenge is that the power company needs the bitcoin in their accounts to procure the natgas delivery contract.\n\nHerein lay the challenge.  The value of bitcoin will easily go into the billions per bitcoin during such a scenario - and quite possibly trillions - the simple reason being that the dollar will be in ample supply and those who hold bitcoin will not want to relenquish bitcoin for anything but direct purchases.  However, many of the people who own bitcoin at present are investors.  While we can all argue about when and how bitcoin would begin to circulate in the markets - the fact is that the power company needs fuel for its power plants.  The trucks need fuel for their vehicles.  The stores need food for their shelves.  The factories need material in and goods out (as well as power).  Once the infrastructure begins to fail - the net effect is a cascade that wipes out not just people's jobs - but the capacity for any amount of printing to provide for food deliveries and fuel.\n\nWhile I certainly think there is the potential to prevent that - and crypto has part of that potential - the thing is that it is fundamentally in conflict with two things.  First - the belief that \"they won't let that happen\" - \"they\" are stupid and don't have unlimited power.  Second - that belief and faith is both strong, as well as oppositional to the types of economic reforms necessary to prevent such an apocalyptic collapse.\nImagine a future history, tens of thousands of years from now, where children are taught that refusal to obey simple mathematics brought the world to ruin far more devastating than anything feared of nuclear weapons.",
				"added": 1613768775
			},
			{
				"comment_id": 99,
				"body": "> [xealits](#comment_2_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6): On the other hand, the physicality has strong aspects against other situations. Crypto requires the publicity of the record of who owns how many coins. So, in principle your transactions are publicly visible. (And also the network that maintains this record must be really powerful to withstand any subversion attempts.) Gold and any other physical means of exchange provide privacy. They can really be off the grid. [...]\n\nThis, specifically, is why I am more a fan of Monero over Bitcoin.  Monero has some better overall features and has a baseline mining production to it (so it will, over the long term, be inflationary, but the new coins added to the system will be at a flat rate once the initial seeding has completed).  One of the better features of Monero is that it uses an encrypted ledger system and breaks the chain of transactions.  So it is a far more private currency which prevents situations of 'dirty coins' - which Bitcoin already has a bit of an issue with.  \n\n> Finally, probably the largest threat to crypto is central banks & governments. They will not just stand aside, if it becomes really successful. And it is becoming successful exactly because of their projects and failures. So you could speculate that in long run they will inevitably drag crypto down together with themselves.\n\nThey can try.\nThe problem the government will run into is that by time it becomes immediately obvious to them that they need to try and obtain a crypto, they can't actually buy it.  How does the government buy things?  Through printing.  Why would they need crypto?  Because people are no longer accepting printed currency for things.  So it's a bit of a catch-22.\nOf course, they could try to send out the hunting dogs with orders to rape and pillage in the name of the state - but not only will that get met with (in the U.S. at least) a wall of lead and internal resistance, but the bigger problem facing the government is that they couldn't print fast enough to keep their soldiers clothed and fed - when the soldiers and police can no longer afford to live by following the government paycheck and the promise of a retirement pension goes up in smoke - then why should the soldiers and/or police go out to molest the citizens and be burglars on the word of the political and banking caste?\n\nSo, the governments can try - but part of the problem with many of the crypto-currencies (which actually makes them better, in some regard, than physical assets) is that they can't be so easily seized and by time they truly represent a threat to the government, it is impossible for the government to try and dedicate resources to obtaining them legitimately through monopolization of hashing power or declaring them criminal assets (as too many people are using them for that narrative to truly hold purchase with the public).\n\nAbout the only ones who can potentially move to 'sabotage' cryptos would be banks, which will invariably launch ETFs supposed to hold cryptos in trust (much like how they do gold and silver) - and they will inevitably mount gox themselves, just as what is happening in the comex at the moment is unfolding for the physical market.  Bitcoin is more or less serving in its role spectacularly, there.  Bait expends ammunition, indeed.",
				"added": 1613773177
			}
		],
		"1613977895_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 100,
				"body": "> [styromaniac](#comment_2971_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): MOAB\n\nMy only real issue with that blocklist is that it basically blocks all imageboards as though the zite, itself, is designed for child pornography.  It's a bit too aggressive for me to be able to use in that regard.\nThe other thing to consider in terms of ZN development is that 'muting' is different from 'blocking.'  For example, I've noticed that one of the first people to post in response to 'I'm new here' threads is the \"go here if you want child porn\" guy that most people have muted.\nThere are times where, when all they can post is text, we should probably see what they are up to.",
				"added": 1614204197
			},
			{
				"comment_id": 101,
				"body": "> [styromaniac](#comment_2974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Millchan Engine and Galactichan aren't blocked.\n\nAh, spacechan.... Freiza Planet 419 of the chans.... of course there would be one here.\nThe whole point of the millchan engine zite is for it to be a model for cloning.  Millchan, itself, you have blocked for some reason.\nI'm not completely disagreeing with the idea that these zites could contain CP - the way ZN, itself, works is that the userbase of a zite could all pretty much choose to mute a board on the zite and the users of that particular board could continue to use it like normal and none of the other users would really know it exists until someone new shows up and says: \"So, what's with the pegging fanatics board?\"\n\nThere may be better moderation features included into millchan as of late, but to some extent, the boards are virtually unregulated.  There's a funny story about that on 08chan when those of us who arrived after 8chan got nuked flooded in and some of the locals got a little upset that their clubhouse was the center of town and wanted the zite owner to ban other boards and he was like \"do you not understand what impossible to censor means?\"\n\nThere should be a feature in ZN to allow a zite or its subfeatures to be blocked a little more appropriately - IE - to block automatic image downloads or to allow a database of blocklists to have better linking with a zite's code.  Rather than outright striking people from existence on ZN, I can just choose to put them in a category of \"yeah, we're not ever loading a picture posted by them.\"\n\nAs it stands, it's a lot of all-or-nothing -deletion- of someone from your internet experience, and that is kind of too powerful to be useful in many of the situations where you would want to protect yourself or each other from illegal content as it will basically result in deletion of nearly anything that allows user submitted media given enough time.",
				"added": 1614231756
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 102,
				"body": "> [anonymouslogin](#comment_240_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Mostly printing money without an expanding economy will cause inflation.\n\nThe markets are going to be very fun today.  10 year treasuries just went to -4% in yield on a gamma short.  I suspected that there would be a liquidity shortage before too much longer back with the insanity that unfolded over Gamestop and funds everywhere were having difficulty covering volatile assets.  When I called up my financial institution to do a bank wire for silver, I also found that they were being oddly restrictive in their process for granting a bank wire - which implied to me their reserve ratios were extremely low.\n\nLo and behold, here we are.\n\nThe other problem they are about to figure out is that a lot of manufacturing inventory is cleaned out all the way back to September and November for component markets and material stock back to 45+ days.... BUT... because of supply chain finance, this doesn't fully materialize in the markets until around 30-60 days after the shortage occurs.  Supply chain finance deliberately manipulates the prices of material commodities low by allowing payment for materials delivered to be resolved AFTER they have been consumed in the development of products.  The system 'works' because they have a 90-ish day window to roll over deliveries and short futures in order to keep prices low on all material commodities.\n\nPeople are wondering why prices for commodities are not skyrocketing despite them being almost completely absent from the market (steel is getting critical, silver is becoming unobtanium, copper is getting harder to come by, wood is skyrocketing in price but isn't as subject to supply chain finance by virtue of its use) - supply chain finance is part of the equation.  The prices will be manipulated low until the point where the comex fails.  It's what supply chain finance exists to do.",
				"added": 1614855771
			}
		],
		"1609874864_1KCXLUdxYKm5ukuc8s6kWaAdz6A7Hi8GQE": [
			{
				"comment_id": 103,
				"body": "> [rannulfr](#comment_87_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Bitcoin Core would never allow it. They will fork if anyone tries this shit. BTC has no authority. It is trustless. They can blow their transaction censorship out of their ass, any coin that tries this will fail. Ripple tried it already.\n\nThe problem with bitcoin at this point in time is that it is prone to a sudden takeover of the total hash rate.  He who owns the ASICs owns bitcoin - or he who could stockpile a large number of them.  If I were a billionaire ten years ago - or leading an institution on the behalf of - I would have invested heavily in securing large volumes of ASIC production throughout the intervening time to now.  If for no other reason than I understand the potential for bitcoin and I also would expect any large state actor to do something similar.\n\nWe will see a point in time before much longer when the players at the table begin showing their cards and we find out who has been waiting for the opportunity to seize and/or counter the seize of the hash rate of the bitcoin network.  I would be very curious to know how many silicon die fabs have produced mining ASICs under national security directives or confidentiality agreements.",
				"added": 1615217664
			}
		],
		"1628149781_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 104,
				"body": "Part of it is the difference in how the platform works.  How busy are other zites on ZN?  There could be some extremely active knitting club using this thing and they just never comment here and we never load up their zite.  Someone monitoring trackers and tracking requests may be able to get an idea of just how many are actively using ZN as a platform, but security companies and the like usually only bother to invest in doing that when there's a media interest in doing so.  Or perhaps law enforcement.\n\nI think the other thing is, as others have pointed out, just the consistency of activity.  People only engage with content when it is created and prompts them to engage.  Without people creating content to engage with (be it threads, zite content, etc) there is nothing for someone to engage with when they hop on for an hour.\nThis also contrasts with the fundamentally intrusive aspect of most other online activity - something like Twitter, Facebook, and Youtube are things which almost try and reach out of your device and grab your attention.  ZN is something you have to block out a section of time to choose to participate in, not a platform that will grab your attention when you have a moment while waiting for something, then keep pulling you in, later.\n\nAll of this, compounded with the somewhat higher barrier to entry as compared to everything else, means you're talking about a much different user base that is likely to have a specific purpose for being here and who only comes here for the purposes of talking when the more present/expedient have failed or will not suffice for the task.\n\nI think if ZN sites become extremely popular as it is at the moment, I think it is likely a sign that people are falling back on the platform and/or reaching for tools to fall back on, rather than ZN itself truly making inroads into popularity.  Though I imagine the development that would come from necessity/desperation would greatly improve popularity going forward.",
				"added": 1628896678
			}
		],
		"1628752234_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 105,
				"body": "> [gitcenter](#comment_1494_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): And let's face it, modern decentralized networks are terrible for developers. ZeroNet has little to no documentation and is full of vulnerabilities, many critical Namecoin domains have expired because no one monitors them, Matrix/Element constantly loses keys, and so on and so forth.\n\nI look at most of them as proof of concept demonstrators.  Not even netscape of the era.\n\nCall me crazy, but I also think that there are many software developers who... don't actually know how the infrastructure they are programming for works.  I can code a website without ever having to know what the servers are doing in the background to hook everything together.  It's been a while since I've used an enterprise level IDE for network systems, but it would not surprise me if the structuring of CDNs and the like is almost transparent magic in a box designed to be solved by some other services held proprietary and worked on by a hand full of people in the world.\n\nA distributed system is basically having to re-think the nuts and bolts of not just network infrastructure - but the paradigms which are common among the current networking implementations.  Let's look at implementing something like Skype, not even video calls - just being able to use a telephony type service.  In theory, this could work rather easily as a peer to peer system allows direct connections through to another computer - but just dumping out an IP address to try and request communications with is a bad idea and IPs are often dynamic from ISPs and mobile carriers, so we need a privacy layer that can obscure hardware IDs while still matching them to each other and an embedded process in the application that can handle the real-time data stream.\n\nDepending upon how paranoid we want to be, this system has to be able to work outside of centralized DNS, and deal with attempts to regionally interfere with IPv4/6.\nI don't think most people would be all that concerned about Tor - they just want the site to work and content to be there, but factoring it in is also a thing, particularly for the privacy conscious.\n\nGetting together the people who have the knowledge, experience, motivation, and time to be able to develop all of this is not easy and while we have the environment pushing people to pursue it, it's difficult to pick a place to start and for most people, it's enough to just get a system that allows them to complete tasks they deem critical rather than to re-invent the wheel and try to get everyone else to use it.",
				"added": 1628897904
			}
		],
		"1628591661_1NV3qFKgLf7Nnx7L5txkzsg13nuj3teVqC": [
			{
				"comment_id": 106,
				"body": "If I understand what you are talking about, you would more or less have a zite that, once hosted, would become part of something like an onion network.  For example, when I go to the zite and use it to look at something like youtube, what would happen is the request for the youtube url would be passed to someone hosting the zite and then that host would then relay the data back to the person requesting the data from the clearnet.\nMore or less creating what I understand is called an onion network out of a peer to peer network.\n\nIn principle, this would be possible if each person was actively running the zite scripting which acted as a local program.  I am not sure if the torrent network supports that kind of passive peer to peer routing from a file - which sounds rather shady or dangerous, as you would basically code the torrent network to be able to activate scripts inside of a file someone has chosen to host, which would be those defining the routing procedure and even including network commands via script.  I highly doubt anyone would intentionally code a torrent to do that, as you could embed some weird sleeper code into some peer to peer files and then activate code remotely.\n\nI do not know what all restrictions are placed on the ZN browser, but it is my understanding that zites use javascript to run - and so if you could code this type of thing into java and people were to leave ZN up as well as the browser tab open with the zite loaded, it is marginally plausible.  Though you would probably end up just creating your own client side program that you could distribute via ZN and then each person would just run the client.",
				"added": 1628976660
			}
		]
	},
	"comment_vote": {
		"31_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N": 1
	}
}