{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "O partido pirata é uma merda",
			"body": "A democracia é uma merda, logo o partido pirata também é uma merda. Não obstante, o partido pirata é composto por um monte de socialistas vagabundos corruptos que só querem dinheiro fácil através de extorsão. Seja esperto, não caia neste golpe. Partido pirata é mais uma merda sem princípios nem moral.",
			"added": 1475294777
		},
		{
			"topic_id": 2,
			"title": "Os dois tipos de “libertários” anti-libertarianismo http://foda-seoestado.com/os-dois-tipos-de-libertarios-anti-libertarianismo/ #libertarian #libertarianism #libertarianismo #hoppe #ancap #Ancap #BR #Brazil #Brasil #PTBR",
			"body": "http://foda-seoestado.com/os-dois-tipos-de-libertarios-anti-libertarianismo/",
			"added": 1475340577
		},
		{
			"topic_id": 3,
			"title": "Secessão do Sul do Brasil, acontecendo, 94% votando SIM até agora.",
			"body": "http://www.sulista.org/Resultado/Index\n#southbrexit",
			"added": 1475401238
		},
		{
			"topic_id": 4,
			"title": "Só pra relembrar quem foi citado nos emails da CRIMINOSA Hillary Clinton, apoiada por SOCIALISTAS",
			"body": "Notícia de um ano atrás, o nome de Marcelo Tas foi encontrado no meio das conversas dos emails vazados pela criminosa e estúpida esquerdista Hillary Clinton. Ela deveria ter usado Zeronet pras conversas não terem vazado.\nhttp://portalimprensa.com.br/noticias/internacional/74595/marcelo+tas+e+mencionado+em+e+mails+de+hillary+clinton+e+seus+assessores",
			"added": 1475431879
		},
		{
			"topic_id": 5,
			"title": "Dica de filme bom pra ver hoje.",
			"body": "Corações Sujos (Dirty Hearts), filminho brasileiro bonzinho pra ver. https://my.pcloud.com/publink/show?code=XZJNonZJ816eLwaAsjgHqAkk3ARMSTDvOOX",
			"added": 1476491778
		}
	],
	"topic_vote": {
		"3_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"1_13f8nNpQz9u338SU9GVdAfnuFYX1emaNfv": 1,
		"1_18FhdUHnAmpoL4kuTCTvDyowHAsTUJCy6R": 1,
		"5_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"31_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"4_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"2_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"4_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": 1,
		"2_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": 1,
		"1_1FhBaNDUvHMejk1hfkEgiSTWKPZBntBnff": 1,
		"24_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"30_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"1_14ujRmVPqJwVqjjtWAjJweNoYm3dkzBMFL": 1,
		"2_1Kz1uZrEtodpWQJEsqf7VGgaUQbcpqBh5R": 1,
		"1_1MWCFyZgpzgeCGYdiFq3nMEbXZXYyaGX7B": 1,
		"1_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"3_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"34_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1
	},
	"next_comment_id": 57,
	"comment": {
		"1_13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG": [
			{
				"comment_id": 1,
				"body": "Não haverão novas eleições. Ponto final. Democracia é uma merda. Ponto final. E viva nove de julho!",
				"added": 1475290759
			}
		],
		"8_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": [
			{
				"comment_id": 2,
				"body": "Hoje eu entrei nesta tal de zeronet, e achei muito chata. Tem cara de internet anos 90. Velocidade anos 90 também. E recursos são escassos, logo isto é compreensível.",
				"added": 1475290850
			},
			{
				"comment_id": 10,
				"body": "Ontem eu comi burritos. Hoje eu acho que comerei tacos.",
				"added": 1475578826
			},
			{
				"comment_id": 11,
				"body": "Ontem eu comi burritos. Hoje eu acho que comerei tacos. Amanhã eu creio que comerei lamen.",
				"added": 1475578870
			},
			{
				"comment_id": 12,
				"body": "Remoção física para todos os comunistas.",
				"added": 1475836616
			},
			{
				"comment_id": 41,
				"body": "Fui comer no Taco Bell ontem, estou com diarréia até agora.",
				"added": 1477011733
			}
		],
		"1_14ujRmVPqJwVqjjtWAjJweNoYm3dkzBMFL": [
			{
				"comment_id": 3,
				"body": "Aqui também tenho o mesmo problema, e já desliguei até os firewalls inteiros, tanto do roteador quanto do SO, e mesmo assim acusar que esta porta está fechada.",
				"added": 1475290991
			}
		],
		"5_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": [
			{
				"comment_id": 4,
				"body": "É golpe. Desde 15 de novembro de 1889. A partir daí, todos os políticos foram golpistas.",
				"added": 1475293720
			}
		],
		"3_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": [
			{
				"comment_id": 5,
				"body": "valeu dicas",
				"added": 1475293824
			}
		],
		"1_13f8nNpQz9u338SU9GVdAfnuFYX1emaNfv": [
			{
				"comment_id": 6,
				"body": "valeu dicas",
				"added": 1475293859
			}
		],
		"1_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": [
			{
				"comment_id": 7,
				"body": "> [brkaka](#comment_26_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Eu acho que seria melhor usar o mesmo site até mais falantes do Português aparecerem. Por exemplo, ZeroNet em Inglês e em Português.\n> O que acham?\n\nNão, porque em primeiro lugar, já teria um site wiki pronto pra seção em PT-BR. Todos os usuários que chegassem aqui e não soubessem inglês (muito poucos, eu sei, mas pode ser que hajam alguns) iriam encontrar o wiki em PT-BR, leriam e a partir daí, poderiam até complementá-lo lá justamente porque eles não são fluentes em inglês.\n\nE em segundo lugar, basta ver quantas línguas existe no Zerotalk, atualmente 7. Todos os usuários destas 7 línguas editando o mesmo ZeroWiki? Não vai dar certo. Seria mesmo melhor bifurcar os ZeroWikis, igual os Zerotalks são bifurcados, um pra cada língua.",
				"added": 1475340474
			},
			{
				"comment_id": 8,
				"body": "> [henur](#comment_2_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1): Acredito que criar uma wiki em PT-BR seja importante no futuro, então já é melhor criar agora para já acompanhar a versão em inglês.Para bifurcar a ZeroWiki original(em inglês) teria que falar com o dono, ou criar uma cópia e modificar, o que exigiria algum conhecimento de programação, isso pode ser sugerido no 127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerowikiissues\n\nFoi exatamente isso o que eu sugeri. E se eu soubesse programar, faria isso e falaria com o dono do Wiki original.",
				"added": 1475341428
			},
			{
				"comment_id": 9,
				"body": "> [kosherx](#comment_8_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Foi exatamente isso o que eu sugeri. E se eu soubesse programar, faria isso e falaria com o dono do Wiki original.\n\nEnfim, eu fiz a sugestão da bifurcação na página de issues. Vejamos se isso ajuda.",
				"added": 1475341679
			}
		],
		"2_14x4EC7s5TqvtShMQy22xpj8ouVSmSNZY8": [
			{
				"comment_id": 13,
				"body": "(͡ ° ͜ʖ ͡ °)",
				"added": 1476389779
			}
		],
		"1_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 14,
				"body": "Eu só vim aqui pra dar risada dos socialistas mesmo. E você é um deles.",
				"added": 1476558873
			},
			{
				"comment_id": 15,
				"body": "> [nilet](#comment_4_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ): não sou socialista, mas eu acredito que informação deveria ser livre\n\nVocê é socialista justamente por isso. Recursos têm custos. Informação é um recurso. E liberdade não significa ausência de custos, muito pelo contrário.",
				"added": 1476576582
			},
			{
				"comment_id": 28,
				"body": "> [ninjapi](#comment_1_1EcTBTYsro4Vr5ea5NahkseWCK883quWM1): Acho mais interessante ter conteúdo a um preço mais acessível do que a pirataria. Temos que lembrar que filmes e seriados tem um custo para ser feito e são feitos para gerar lucro.\n\né só baixar impostos e reduzir gasto público. mas aqui mesmo neste site tem gente contra a PEC241, então a conta não fecha. os preços disparam, mesmo.",
				"added": 1476986837
			},
			{
				"comment_id": 29,
				"body": "> [ninjapi](#comment_1_1EcTBTYsro4Vr5ea5NahkseWCK883quWM1): Acho mais interessante ter conteúdo a um preço mais acessível do que a pirataria. Temos que lembrar que filmes e seriados tem um custo para ser feito e são feitos para gerar lucro.\n\nconcordo, por isso existe a netflix, etc.",
				"added": 1476986866
			},
			{
				"comment_id": 30,
				"body": "> [nilet](#comment_5_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ): interessante o seu ponto, não pensei por esse lado, acho que isso me faz \"socialista\", hahaha\n\nvocê É socialista e eu provei isso.",
				"added": 1476986918
			},
			{
				"comment_id": 31,
				"body": "> [ninjapi](#comment_6_1EcTBTYsro4Vr5ea5NahkseWCK883quWM1): Também sou contra. Não entendi qual o problema? Acho que tu não percebeu os problemas que a PEC241 geram. Solucionam uns (talvez), mas geram outros.\n\nO problema não é a PEC241, isso é papo de socialista otário que influencia outros socialistas otários que acham que basta apenas fazer dívidas sem poder pagá-las. A PEC241 em si não é o problema, o problema é uma gastança enorme do governo. Ela sozinha não vai resolver nada, o que deveria ser feito era cortar todos os gastos públicos em educação, saúde, etc. Basicamente, não ter governos, não ter impostos, assim os preços despencariam e haveria deflação. E se você não entendeu o problema, é porque você não entende de economia. Deveria ler a respeito, o que aliás é mais uma prova que a educação estatal é cara e ineficaz e deveria ser extinta.",
				"added": 1476992989
			},
			{
				"comment_id": 34,
				"body": "> [brkaka](#comment_34_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Cara esse papo simplista é realmente muito infeliz. Não foi um governo socialista que criou essa crise e certamente ser contrário à PEC não quer dizer que alguém é socialista. É constrangedor até ter que dizer isso.\n> Essa PEC não beneficia a população e é apenas mais uma medida de austeridade desse governo ilegítimo.\n\nVocê pode dizer exatamente aonde na PEC diz que ela não beneficia a população e é uma medida de austeridade? E você pode provar por que este governo é ilegítimo?",
				"added": 1477007840
			},
			{
				"comment_id": 40,
				"body": "> [brkaka](#comment_39_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Os cortes de gastos e possíveis investimentos futuros na saúde e educação são a evidência mais clara que eu poderia apontar.\n> \n\nVocê pode provar isso? Porque na verdade, é justamente o contrário.\n\n> Por definição esses cortes de gastos se classificam como uma medida de austeridade, mas a minha crítica é sobre ser uma política de cortes que está mais interessada em diminuir o deficit do que melhorar a situação da população. Eles estão tentando melhorar a classificação do Brasil lá fora pra beneficiar os empresários enquanto o povo sofre as consequências.\n> \nDiminuir o deficit é sempre melhorar a situação da população. O ideal é que não existisse o déficit em si. Por aproximação, se o déficit tende a zero, logo a melhoria da qualidade de vida da população tende ao máximo. Quanto a questão dos empresários, o que tem de mais? Você investiria o teu dinheiro em uma empresa em bancarrota? Você investiria em uma empresa falida? Aliás, você faz investimentos? Tem pelo menos um negócio próprio? Papo de socialista que não sabe nem sequer do que está falando. \"O povo\" sofre as consequências do que a maior parte \"do povo\" decidiu pra si mesmo, isso é democracia e por isso mesmo é ridícula. Por isso existem crises econômicas, por parte desse mesmo \"povo\" que nem mesmo sequer sabe o que quer e sabe se virar sozinho. O governo escraviza o povo com impostos escorchantes, impossibilitando-o de abrir novas empresas. Vá ver o quanto de impostos é cobrado de qualquer um que abra uma micro-empresa sequer.\n\n> Sabe como o argumento para o impeachment foi que a Dilma cometeu crime de responsabilidade? Existem alguns argumentos e interpretações de que o crime só pode causar impeachment se for cometido no mesmo mandato, o que aparentemente não foi o caso. \n\nFoi o caso. E não tem nada de aparentemente.\n\n> Mas se o crime realmente aconteceu, então Temer também seria culpado, pois ele assinou os mesmos documentos que a Dilma e então praticou o mesmo suposto crime. \n\nConcordo com isso, plenamente.\n\n> Existem gravações do senador Romero Jucá sugerindo uma mudança no governo federal (remoção da Dilma) em troca de algum tipo de pacto para \"estancar a sangria\", a operação Lava Jato. \n\nVocê tem essa gravação? Isso é factual?\n\n>Temer admitiu (talvez de forma inconsciente) em uma palestra que o impeachment ocorreu porque o Governo Dilma não aceitou o plano neoliberal que ele propôs. \n\nCara, a Dilma CORTOU um monte de GASTOS, ou como você prefere dizer de forma errônea, \"investimentos\", em várias áreas estatais socialistas, educação, saúde, etc. e vocë vem me dizer que a Dilma NÃO ACEITOU plano \"neoliberal\"? Você é um alienado socialista.\n\n>Mas de forma genérica, é ilegitimo porque as medidas de governo que ele está tomando não representam a vontade da população quando votaram na Dilma.\n\nO teu pensamento é genérico, além de equivocado e não ter provas do que alega. Além, é claro, de ser um pensamento socialista.",
				"added": 1477011657
			},
			{
				"comment_id": 43,
				"body": "> [brkaka](#comment_44_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Tem muita coisa errada nesse comentário, amanhã eu respondo. \n\nSe você fosse mesmo anarquista, não teria dito isso.\n\n> Peço que você pare pra pensar por que um pensamento \"socialista\" seria algo ruim. \n\nPorque o socialismo não leva em consideração diversos fatos da realidade como, por exemplo, recursos serem escassos. O socialismo é a negação da realidade, logo ele não tem como funcionar.\n\n>Será que é possível que você tenha uma percepção errada do conceito?\n\nSerá que é possível que você tenha e eu não?\n\n> Você parece um cara jovem e cheio de certezas. Peço que considere a possibilidade de que talvez a sua visão não seja a mais correta. Que talvez não há visão correta. \n\nEu tenho 40 anos, já não sou mais jovem. O tempo passa para todos. E se não há uma visão correta, isso quer dizer que a sua visão não é correta, você admite que você está errado. Check mate. Debates servem para justamente podermos descobrir o que é verdade e separar do que não é. Alguém tem de estar certo.\n\n>Até amanhã.\n\nAté.",
				"added": 1477014419
			}
		],
		"2_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": [
			{
				"comment_id": 16,
				"body": "Agora vai!",
				"added": 1476581795
			},
			{
				"comment_id": 17,
				"body": "Agora que vi, tem um FAQ sobre Zeronet destacado no Zerotalk inglês.",
				"added": 1476622372
			},
			{
				"comment_id": 18,
				"body": "Se conseguirem mudar o nome do zerowiki PT, dá pra linkar na wiki EN, abriram um espaço lá, tem outras wikis em outras línguas.",
				"added": 1476752134
			},
			{
				"comment_id": 21,
				"body": "Já mudei. Mais simples do que isso.",
				"added": 1476835000
			},
			{
				"comment_id": 22,
				"body": "> [sirenyc](#comment_146_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Aqui ainda aparece Myzerowiki.\n\ntenta dar update. eu fiz isso em outro PC e deu certo.",
				"added": 1476867052
			},
			{
				"comment_id": 23,
				"body": "> [kosherx](#comment_22_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): tenta dar update. eu fiz isso em outro PC e deu certo.\n\nou sei lá, apaga o zite do teu zeronet e baixa de novo.",
				"added": 1476867093
			},
			{
				"comment_id": 24,
				"body": "> [sirenyc](#comment_147_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): deletei, mesma coisa =/ tenta muda no contest.json para ver se muda aqui.\n\njá estava mudado lá. é automático. não tem outro jeito, tem de fazer update. aqui funcionou. talvez tenha ficado registro de outro arquivo no teu PC.\nhttp://imgur.com/IKGP6QB",
				"added": 1476919987
			},
			{
				"comment_id": 25,
				"body": "> [sirenyc](#comment_149_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Vou deletar de novo para ver!\n\nOk, boa sorte. Eu até fiz um teste e transferi toda a pasta desse zite pra um outro zerado, e o outro zite cópia mudou o nome também. É questão de sincronismo, mesmo.",
				"added": 1476928294
			},
			{
				"comment_id": 26,
				"body": "> [brkaka](#comment_31_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Não é automatico, você precisa puxar o \"0\" pra esquerda e clicar Sign e Publish.\n\ndigo, depois disso, eu dou o sign e tal. não preciso editar o arquivo à mão.",
				"added": 1476986620
			},
			{
				"comment_id": 35,
				"body": "63 peers! Por Hoppe! Por assim dizer!",
				"added": 1477007938
			},
			{
				"comment_id": 36,
				"body": "> [brkaka](#comment_33_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Ah entendi. Mas certamente há alguma coisa errada. Talvez tenta de novo? Isso nunca aconteceu comigo. Se você olhar em algum proxy vai ver que a atualização não chegou.\n\nNão vou tentar mais não, cara. Aqui atualizou em 1 dos 2 computadores que eu tenho, e ninguém mais reclamou disso, e vários me disseram que o nome atualizou. O problema está aí no teu PC mesmo.",
				"added": 1477008024
			},
			{
				"comment_id": 38,
				"body": "> [brkaka](#comment_38_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Quem são esses vários? Não atualizou em nenhum proxy que eu tenho acesso, no meu computador e nem no do @sirenyc até o último comentário dele. \n> Se quiser tentar só mais uma vez, tenta puxar o \"0\" pra esquerda, clicar em \"This is my site\" atualizar o nome pelas caixas que aparecem salvar, sign e publish. Muito improvável não funcionar desse jeito :)\n\nEu não posso assinar mais o site porque eu perdi a private key em um travamento anterior no app da zeronet, e perdi todo o banco de dados que eu tinha aqui no diretório. Lamento. Mas deveria funcionar, funcionou em um monte de PCs, o pessoal com quem eu converso em um grupo de zeronet no Telegram me disse isso, inclusive perguntaram \"por que o nome do zite mudou de myZeroWiki pra ZeroWiki PT\"? Desculpa. Enfim, como eu perdi a key, qualquer um pode editar isso, se quiser, você pode arrastar o 0 e editar você mesmo. O zite não está registrado.",
				"added": 1477008663
			},
			{
				"comment_id": 39,
				"body": "> [brkaka](#comment_40_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Infelizmente só é possível publicar as mudanças com a private key. Mesmo mudando aqui ou aí não vai ser publicado pros outros peers. Mas isso não é problema. Eu posso fazer um clone e traduzir pro português da melhor forma possível igual esse fórum aqui. Mas só vou poder amanhã. Mas enquanto isso posso clonar agora pra vocês moverem o que já tem lá e editar o que quiserem, o que acham?\n\nNão é, tanto que as mudanças foram publicadas, eu verifiquei isso com outras pessoas no zeromeplus, vou pegar o link e passar depois. A private key apenas garante que quem possua a key possa fazer as mudanças. Se não houver key registrada, qualquer um pode editar. Você pode editar. Pelo menos é o que me explicaram. E eu já tenho um clone dela, pra caso aconteça algum problema e a ZeroWiki seja deletada por alguém, mantenho um clone dela na zeronet mesmo, essa sim com key.",
				"added": 1477011068
			},
			{
				"comment_id": 42,
				"body": "> [brkaka](#comment_42_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): A private key te permite editar coisas no conteúdo do site, como o título ou transformar uma Wiki em um Blog. Mas como é uma Wiki, qualquer um pode editar os artigos/páginas assim como em uma ZeroTalk qualquer um pode postar um comentário ou criar um novo tópico. Sem a private key é \"impossível\" (em teoria e até que se prove o contrário) editar os arquivos de um site.\n\nEu falava em edição no arquivo content.json mesmo. E o que me disseram é que é sim, possível, qualquer um editar o zite sem a key. A key apenas bloqueia a edição para quem tem a key, depois que ela é registrada. Se quiser, faça um teste, pode editar o nome do zite. Ele está aberto, qualquer um pode fazer isso, infelizmente, já que eu perdi a key e até onde eu consegui saber, não é possível recuperá-la.",
				"added": 1477011917
			},
			{
				"comment_id": 44,
				"body": "> [brkaka](#comment_43_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Eu entendi, mas não é assim que funciona. Cada mudança precisa ser confirmada com a chave para ser \"válida\". Óbvio que qualquer um pode editar os arquivos, eles são apenas texto. Mas as mudanças só podem ser publicadas para outras pessoas depois da confirmação com a private key.\n\nÉ assim que funciona para todo mundo, inclusive de acordo com o que foi explicado pra mim por outro usuário da Zeronet, e funcionou com todos os outros peers, inclusive de 1 peer pra outro que são os meus 2 computadores. Sem falar em outros peers que me comunicaram a mudança do nome do zite por chat. Pra TODOS OS OUTROS USUÁRIOS NA ZERONET isso funcionou corretamente. Mas pelos outros debates que eu pude presenciar as tuas opiniões, você parece ser uma pessoa que não lê, não procura informação, não procura sequer considerar o que outra pessoa muito mais sábia do que você tem a dizer, você é teimoso, cabeça-dura e, pra piorar, como resultado final disso tudo, você é socialista. Então, nada posso fazer a respeito. Você que tem que aprender pelos teus próprios erros. Aqui está tudo correto. Nada posso fazer para curar a tua teimosia, é você quem tem de consertá-la.",
				"added": 1477014882
			}
		],
		"1_121wHEZXhLuoFQhmawdQRLVvtBzhSDT4R5": [
			{
				"comment_id": 19,
				"body": "no",
				"added": 1476833924
			},
			{
				"comment_id": 20,
				"body": "no",
				"added": 1476833948
			}
		],
		"2_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 27,
				"body": "quem é contra a PEC241 é contra o brasil.",
				"added": 1476986731
			},
			{
				"comment_id": 33,
				"body": "> [brkaka](#comment_32_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Eu discordo. Por que não diminuir os salários do Judiciário, Legislativo e Executivo?\n\nPor que não acabar com os gastos do Judiciário, Legislativo e Executivo? Seria muito melhor ainda.",
				"added": 1477007705
			},
			{
				"comment_id": 37,
				"body": "> [brkaka](#comment_36_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Também sou anarquista mas é óbvio que isso não vai acontecer por iniciativa do governo, então uma diminuição dos salário é muito mais realista, principalmente porque eles receberam um aumento nesse ano. Mas novamente, o meu argumento inicial foi contra a ideia de que ser contra a PEC-241 é ser contra o Brasil.\n\nVocê não é anarquista, você é socialista. Totamente diferente. E eu disse anteriormente que, de fato, isso não vai acontecer por iniciativa do governo, mas qualquer coisa que reduza a intromissão do governo é bom. Inclusive por isso mesmo eu sou contra a PEC241, já que ela adiciona mais um bilhão de reais de dívida pública injetada na \"educação\" estatal.",
				"added": 1477008211
			},
			{
				"comment_id": 48,
				"body": "> [luizof](#comment_1_12zrxiG9gvvTDeCRpuRmdWQLVQ288YTwJB): kkkkk o cara é contra uma lei que limita o estado e usa uma rede decentralizada,, vai entender ...\n\nrede descentralizada e baseada em blockchain de bitcoin, ainda por cima.",
				"added": 1477427426
			},
			{
				"comment_id": 49,
				"body": "> [nilet](#comment_9_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ): uma questão é que eu não tinha me aprofundado muito sobre a pec ainda agora que consegui compreender ela, eu não sei que ideia estupida foi aquela de ocupação, mas enfim, a sorte é que não foi aprovada\n\nvocê sabe realmente do que tá falando? PEC, ou qualquer PL que seja, demora muito tempo pra ser aprovada ou não. a 241 foi aprovada em 2 turnos na câmara de deputados, vai pra aprovação no senado agora, mais 2 turnos de debates e tal. não foi aprovada nem desaprovada, ainda.",
				"added": 1477488407
			},
			{
				"comment_id": 51,
				"body": "> [nilet](#comment_10_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ): eu estava falando que a ocupação da minha escola não foi aprovada, não especifiquei bem\n\nah, ok. eu não entendi bem. enfim, esse negócio de ocupação de escola, a meu ver, é maluquice, os jovens não sabem o que fazem lá, são massa de manobra de interesses políticos.",
				"added": 1477516211
			},
			{
				"comment_id": 56,
				"body": "> [morbidden](#comment_1_19abhEkL2342qmxGZafGa7AUHmSxvrDArv): Essa parada da PEC, diferente que os comunas estão propagando em massa, é justamente pra acabar com a trenheira que o governo passado causou. A minha opinião é que por mais que ela não seja a forma mais eficiente e favorável pra todos, pelo menos é algo que tá sendo pensado em longo prazo, que vai pelo menos tentar dar uma estabilidade econômica ao país e evitar ao máximo, prejudicar o cidadão que paga seus impostos.\n\neu não acredito que seja. mesmo porque, algo como essa PEC já existe na legislação dos EUA - até essa PEC, o Brasil NUNCA teve limite de dívida, tanto que o Brasil, depois do PT, tem uma dívida gigantesca, o Brasil foi o típico moleque que fez várias festas de arromba durante mais de uma década e se endividou no cartão de crédito pra isso. agora não sabe como pagar. mas os EUA fazem o mesmo, e todo ano o presidente chora e ameaça e implora pro congresso AUMENTAR o teto da dívida, o que sempre é atendido. foi assim com o Obama, com o Bush filho, com o Clinton, com o Bush pai, com o Reagan... o que garante que essa porcaria de PEC vá mesmo controlar os gastos, ao invés do presidente, Temer ou qualquer outro no lugar, vá chorar no congresso pra aumentar esse limite? isso tudo tá muito errado. o Temer mesmo tá sendo playboy tanto quanto o Lula e a Dilma foram, gastando absurdamente mais em propaganda.",
				"added": 1479121725
			}
		],
		"1_1M5V8ZLTgr8rR7gkAWhCMD7iAsnjFBqL63": [
			{
				"comment_id": 45,
				"body": "Não exatamente, mas muitos sites caíram, sim. Milhares de sites.",
				"added": 1477084555
			}
		],
		"3_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 46,
				"body": "Sim, existem.",
				"added": 1477393579
			},
			{
				"comment_id": 47,
				"body": "> [nilet](#comment_7_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ): então kosherx, por você eu já esperava, baseado em relatos de publicações passadas, em fato acho até que você é o membro que mais admiro aqui\n\npô, valeu. enfim, eu não sou o único anarquista de vertente capitalista (e novamente, a única que realmente é funcional) que existe por aqui. sei que tem outros que pensam igual a mim. não que eu queira forçar todo mundo a  concordar comigo, a questão é eu estar interessado no que são fatos e no que não são.",
				"added": 1477426614
			},
			{
				"comment_id": 50,
				"body": "expectativa: nossa, como os jovens têm consciência social, lutando pelos seus direitos, não cedendo aos interesses políticos do grande capital\n\nrealidade: bebendo vinho barato e brincando de ser revolucionário sem saber de porcaria nenhuma",
				"added": 1477488879
			}
		],
		"1_132G3r2LiYzPJyNztgPN83NBcopPqXg5PT": [
			{
				"comment_id": 52,
				"body": "Zeronet tem uns posts bons, e uns posts de merda. Este é um dos posts de merda.",
				"added": 1477943384
			},
			{
				"comment_id": 53,
				"body": "Zeronet tem uns posts bons, e uns posts de merda. Este é um dos posts de merda.",
				"added": 1477943401
			}
		],
		"1_1HUgUDFZZrWvVmy37tTCo8tCBrpchbGbqE": [
			{
				"comment_id": 54,
				"body": "Isso sim seria muito bom.",
				"added": 1479121396
			}
		],
		"34_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 55,
				"body": "mas vão ficar mudando rev até quando? se for pra ficar atualizando app toda hora, eu prefiro ficar com o antigo mesmo.",
				"added": 1479121444
			}
		]
	},
	"comment_vote": {
		"1_1Epe75durCZQrrRwgSH9YotRq8MzXXQubS": 1,
		"12_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": 1,
		"5_1PAo8TcX1nQGNtFRAKirp1uAoTt3btNdti": 1,
		"2_1Ns49ghhugceiVKRy8k7sbJXYKpaQSgWQ7": 1,
		"1_1P43XnFv78cUHiBzD9qA6QNiXy3ex6NP4w": 1,
		"5_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"10_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"8_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"7_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"6_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"1_12zrxiG9gvvTDeCRpuRmdWQLVQ288YTwJB": 1,
		"11_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": 1,
		"3_19abhEkL2342qmxGZafGa7AUHmSxvrDArv": 1
	}
}