{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1520511554,
			"title": "Who can help download \"Dark DNA: The missing matter at the heart of nature\" from New Science",
			"body": "My school not subscribed New Science so I can't read it. so who can help me download it?\nThanks :)",
			"added": 1520511553
		},
		{
			"topic_id": 1521629532,
			"title": "Why ZeroNet only inherit Bitcoin network protocol but didn't combine Cryptocurrency build economic system?",
			"body": "ZeroNet originate in Bitcoin's blockchain technology and decentralization thought but why didn't combine Cryptocurrency build economic system? \nIf ZeroNet have an economic system will more active community atmosphere.",
			"added": 1521629530
		}
	],
	"topic_vote": {},
	"next_comment_id": 28,
	"comment": {
		"1520511554_19GRAaLSeEgXthxYKSpGAe3BjZc2LXNWZJ": [
			{
				"comment_id": 1,
				"body": "Article link is here https://www.newscientist.com/article/mg23731680-200-dark-dna-the-missing-matter-at-the-heart-of-nature/",
				"added": 1520511803
			},
			{
				"comment_id": 2,
				"body": "> [jlxip](#comment_78_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): That's not very helpful. He means where he can download it without paying.\n\nYes, perhaps don't need download, I just want to read it.",
				"added": 1520565762
			},
			{
				"comment_id": 3,
				"body": "> [leftside](#comment_61_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): The magazine will be released a month or later on the net. Try this one: https://theconversation.com/introducing-dark-dna-the-phenomenon-that-could-change-how-we-think-about-evolution-82867\n\nYes maybe we can waiting it.",
				"added": 1520586141
			}
		],
		"1521629532_19GRAaLSeEgXthxYKSpGAe3BjZc2LXNWZJ": [
			{
				"comment_id": 4,
				"body": "I was seen some blockchian project if there have economic system then maybe fit integrate into ZeroNet:\n\nDecentralized Marketplace : https://www.openbazaar.org\n\nKnowledge-sharing social network : https://www.gilgameshplatform.com/\n\nDecentralized Profile Network:https://indorse.io/",
				"added": 1521631011
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_237_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ZeroNet uses bip32 for signatures which can serve as Bitcoin wallets, a protocol like BitTorrent for file distribution, and resolves Namecoin addresses on ZeroNet. It doesn't necessarily rely on Bitcoin, as I understand it.\n\nYes,I knew Zeronet just inherited network protocol.\nBut my mean is, Zeronet originate in Bitcoin should have knew Cryptocurrency and Decentralization but why didn't considered that merge these thought into system?",
				"added": 1521729739
			},
			{
				"comment_id": 6,
				"body": "Zeronet have powerful attribute of anonymity community, but it lack monetization tool that help construct active atmosphere of community.",
				"added": 1521730806
			},
			{
				"comment_id": 7,
				"body": "> [lonelyreader](#comment_25_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs): on everysite, you can donate to the bitcoin address by the way\n\nOf course everyone could post every type cryptocurrency address to receive donate.\nBut if someone want to sell merchandise, there don't have any trading mechanism to facilitate trade.",
				"added": 1521809560
			},
			{
				"comment_id": 8,
				"body": "> [nofish](#comment_1143_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): I prefer to keep the network free for everyone and people should help to distribute site/content due to moral reasons instead of a financial benefits.\n\nYes I agree we need an freely, steady and decentralized basis network , but my mean is on this basis to construct an economic system for trading rather than from network traffic or storage.",
				"added": 1521811122
			},
			{
				"comment_id": 9,
				"body": "> [grae](#comment_3_1qA5PLyTTNtJjaK1zRz1fnyQMgiDpv5td): https://stellite.cash/ [...]\n\nNo, my mean is build community commerce rather than copy Filecoin (https://filecoin.io/).",
				"added": 1521811552
			},
			{
				"comment_id": 10,
				"body": "This project decentralized marketplace : https://www.openbazaar.org had provided trading platform but couldn't build social network.",
				"added": 1521890386
			},
			{
				"comment_id": 14,
				"body": "> [onlinemovies](#comment_4_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp): Its a great idea to help file storage with seed servers.But these servers must run all ZeroNet users.But not that way to impossible to delete or edit the author their own files from the system like steemit or Dtube doo this.Wee need this in the future but not the send us loot of money and where store you files system.If you give us a storage you will get a storage system are better.Where you can store your site frealy if you store another people sites too.And you can get extra bandwith if you store another people zites and the zite larger files.\n\nYes, store files system is foundation but now we have Zeronet.",
				"added": 1522382481
			},
			{
				"comment_id": 16,
				"body": "> [lokie](#comment_2_1NAZqJadviPupSkpg4qy9o8QpRTUWV5aP1): love you nofish!, thanx for this incredible solution!\n\nI think commerce and freedom is not conflict!\nSuch as Linux is open source meanwhile enterprises also used it to make money then contribute Linux community.",
				"added": 1523162124
			},
			{
				"comment_id": 17,
				"body": "> [0hd](#comment_8_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ): I prefer ZeroNet (like any base layer system) to be dumb as possible to facilitate core features and abstractions layers of your choice can be built on top of them.\n\nYes but currently situation is we can't deep develop abstractions layers.",
				"added": 1523165524
			},
			{
				"comment_id": 18,
				"body": "> [0hd](#comment_9_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ): Elaborate. What are you attempting to implement and what issues are you facing?\n\nI have a idea that base on ZeroNet use Ehtereum construct a new system .",
				"added": 1524231968
			}
		],
		"1521908343_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 11,
				"body": "这样的构想其实有一个类似的工具在开发中，但是目前进度比较缓慢https://www.uproxy.org\n通过Chrome的插件来实现P2P的代理",
				"added": 1521953623
			},
			{
				"comment_id": 13,
				"body": "> [kai0](#comment_524_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 你说的这个uproxy是不是要安装2个插件的？我以前试过，一个发送的插件，一个接收的插件，这个很没道理。而且找不到我自己的浏览器。浏览器的P2P网络应该是后台运行的，不需要2个插件。界面上只要能看到有多少已经连接到的节点，可连接节点有多少就行了。\n\n反正这个项目目前好像是黄掉了！",
				"added": 1522046076
			}
		],
		"1517923781_1J5eykgVEWWdDLbJpoqS9zdaKQzmPkrfyR": [
			{
				"comment_id": 12,
				"body": "> [helium](#comment_214_1Pv5CdXMDJm5k5iAp4SVbutnMg2ue8e58p): I haven't studied it, but IF it uses any kind of proof-of-work algorithm, then IT IS CRAP just the same way the Bitcoin sucks from environmental point of view.https://archive.is/gN70goriginal link: http://fouryears.eu/2017/07/09/the-blockchain-consensus-problem/ [...]\n\nI agree with this view.",
				"added": 1521953979
			}
		],
		"1522391642_1Jt6aamh4UWpSRG421JivqanL5SQc7xLAX": [
			{
				"comment_id": 15,
				"body": "> [ssdifnskdjfnsdjk](#comment_203_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): My guess is: alot of people in China, one of the biggest censorship (including internet)\n\nFor example if you want to download adult video but it's forbidding !",
				"added": 1522570111
			}
		],
		"1523917050_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 19,
				"body": "This is interesting topic!",
				"added": 1524233065
			}
		],
		"1523809606_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": [
			{
				"comment_id": 20,
				"body": "Low tech internet, this idea is very nice.\n\nWhat is SSB?",
				"added": 1524233368
			},
			{
				"comment_id": 21,
				"body": "> [nullbock](#comment_14_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6): The js on zeronet requires at least 56k level speeds.\n\nI think network stable is most important rather than bandwidth.",
				"added": 1524377589
			}
		],
		"1524446783_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 22,
				"body": "I don't agree computer(Turing) is the biggest cause of won WWII. U.S.A joined WWII is most important!\nOf course computer is important but can't confront violence, technology always silent transforming influence society!",
				"added": 1524641159
			}
		],
		"1524439656_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 23,
				"body": "If you wanna read the ZeroNet's news on computer, I think CLI client is not necessary.",
				"added": 1524645484
			}
		],
		"1524609526_1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo": [
			{
				"comment_id": 24,
				"body": "Blockchain is perfect alternatives!",
				"added": 1524647162
			}
		],
		"1524592326_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 25,
				"body": "Research political and economics and find solution compares important with revolution !",
				"added": 1524657118
			}
		],
		"1525406564_16mEBTR7dyjQc7Lxmc9um4TfvM8W4oaAnV": [
			{
				"comment_id": 26,
				"body": "Great, how I use it?",
				"added": 1525417730
			}
		],
		"1542861175_1PkVAeJswTgCVG4MN6BZG7YdWpzgmek5WZ": [
			{
				"comment_id": 27,
				"body": "> [timelinehyperbot](#comment_35_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Just reviewed it...  I do not see the value in taking time to use Gab.ai...   Zeronet I think is still a better option!\n\nI agree this point!",
				"added": 1542871623
			}
		]
	},
	"comment_vote": {}
}