{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1619555817,
			"title": "[carnivores united] Would you join the most violent organization on Earth ( the herd defense league)?",
			"body": "the goal is to kill all who want to hurt or maim or kill anyone from the herd (cows, pigs, chicken, donkeys, hyppos etc we don't care).\n\nit's very funny...\n\nbecause to kill a cow requires way more power than to kill a man...\n\nyes, because some want to prevent to kill our cows... meaning, they interfer...\n\nas such the herd defense league, kill those...\n\nyeah there is killing on all side here... \n\nthat's what I tell,\n\nthe most violent organization on earth...\n\nthe protected are killed too...\n\nthose fucking vegan, they want to eat cow food... you understand the problem...\n\nas the guardians of the herd, it's important to kill those who will cows...\n\nby famines...\n\noh the bastards ! \n\nto be simple:\n\nthe herd will live.\n\nI like too the herd will leave (as in the grass of where your dead corpse are decomposing isn't suitable right now) to return later...\n\nwe will need to be extremely violent... \n\nthey want to kill the herd, they die.\n\nwe don't kill the herd, we eat it...\n\nit's a very primitive organization...\n\nthe key word\n\ncarnivores united.\n\nand for carnivores united, vegans are plant food and plant food is?\n\nyou get it !",
			"added": 1619555816
		}
	],
	"topic_vote": {},
	"next_comment_id": 36,
	"comment": {
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 1,
				"body": "One thing that shocks me about the WAMITTO2 (Western Adversarial Misinformation and Influence Tactics and Techniques Operators&OPERATIONS) is that each time they mention the city to whom all songs and promises were made for centuries, they only mention the so called alaksah as the third holiest side of Islam. But never any meaning for the little people. Never.\n\nI understand why as you do. However what makes me laugh in this story? Is how weak their interpretations of Islam is ! And precisely, they can't apprehend, the concept of what they call the universe, with an s even. \n\nso this war? how is it going?\n\n> [oscarwilde](#comment_7_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG): Israel will go 'puff it is gone' on a nuclear 'accident', wasteland thereafter.\n\npuff? ahhaha ! by the will of god, all there is remains until it doesn't.\n\nno my point is that you need breeders (so called civilian reactors) to produce plutonium to nuke the bastards in the west if need arise, like the vatican, bruxelles, paris, london, nyc (they will be warned as always)....\n\nthis is a fucking war.\n\nthe good news? is that with the close front lines, they want the land, just a little bit less... \n\nand if you want islam to fight, try kuffars to take medina... you won't get further anyway... you can nuke as much as you want, all you made, will be ashes... \n\nhowever more interesting, it seems clearer and clearer than one involuntary objective of pedotrump, was to frame israel in regard to pedogate... for example mypillow guy? why does he fucks with dershowitz? heheh... the so called self hating jews... or \"converts\" one sure not to islam... hheheheh.\n\nit would have been quieter in brazillooo...\n\nanyway... it's true... the real issue is...\n\nthat jews aren't pro scorcher earther... \n\nfor others, targeting nuke plants, even if so called hard target is a little bit the nirvahana of warfare, you get one, you can almost put down an entire country, like the sabotage of tchernobyl (who knows... but SU would be to ashamed to admit it or even record it if it was the case). \n\nthe real problem is that now it could be the best solution to blow a nuke plants, and appears even after the total annihilation of the others side (or full surrender blah blah) as perfect... but a thousand years later, it will be less understood...\n\nas some will say, on this planet \"monkeys\" boiled water with urianium / plutonium, and then they added, we were so smart to avoid this pitfall... (my theory source problem is hypergamie,... females want more than the females next branch... and so the race to the stars began, \" a piece of the moon\"... ).",
				"added": 1619553262
			},
			{
				"comment_id": 2,
				"body": "and my belief? even vitrified, they will return, painstakingly, clean each little rock, even the bottom, and rebuilt it...",
				"added": 1619553303
			},
			{
				"comment_id": 3,
				"body": "and I say that from an islamic perspective, remember expand and extension, the prophecy etc... those little people... in sh'allah.. they have their little defensible border, they want to remove everyone, what ever... let's be patient.\n\n“Verily, I have rewarded them this Day for their patience; they are indeed the ones that are successful”\n\n“And seek help in patience and As-Salaah (the prayer) and truly, it is extremely heavy and hard except for Al-Khaashi‘oon [i.e. the true believers in Allah — those who obey Allah with full submission, fear much from His punishment, and believe in His Promise (Paradise) and in His Warnings (Hell)]”\n\n“O you who believe! Endure and be more patient (than your enemy), and guard your territory by stationing army units permanently at the places from where the enemy can attack you, and fear Allah, so that you may be successful”",
				"added": 1619553695
			},
			{
				"comment_id": 8,
				"body": "and the icc is still standing... such weakness... you will never be respected like this... it's a though neighborhood you chose to return in... \n\ni am curious who will smash all this \"western\" uno etc crap... in a sense it's funny... that by the simple idea to make a prayer for the downfall of the nwo, is already knowing that victory is ours, always as and always will be...",
				"added": 1619554824
			},
			{
				"comment_id": 33,
				"body": "I watched a few seconds of i24 fr... on halimi... interesting that it wasn't the first case... otherwise forget it... france is a failed state.",
				"added": 1619590217
			}
		],
		"1619497869_1KizAYXUiTwgJNNWhTNpnHagNbzop9dXFr": [
			{
				"comment_id": 4,
				"body": "fucking masosodomite... join the zerobiztalk (http://127.0.0.1:43110/1KpLYGMGkVSMyHjJzBhSFvN8qXK1xXExpN/) and stop feeding those morons of the san francisco mafia with the fees they charge your for their so called disruptive service.",
				"added": 1619553791
			}
		],
		"1619248411_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd": [
			{
				"comment_id": 5,
				"body": "and even the collapse in the species of the domesticated farm animals... how many special horses, donkey, cow, sheep, ducks, chiken and way more are almost extinct because a few suckers prefered to invest shit load in specific species, to the destruction of the biological heritage of generation...\n\nwho is responible? the sodobitch, who for her fuck sake perfer an iphone20 rather than a good steak.",
				"added": 1619553904
			}
		],
		"1619342119_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": [
			{
				"comment_id": 6,
				"body": "i was such a guilible native fool (which I am still) but I believed that\n\nprivate media : the goal was to make money, the deal was reporting reality to get views to sell ads... it was quite a straight forward business... \npublic medias : was the same as private but with grifting (tax payer money looting)\n\nnow : WAMITTO2 (Western Adversarial Misinformation and Influence Tactics and Techniques Operators&OPERATIONS)\n\nbut who is really responsible? bbc and all those wamitt? nope. it's ME. why the fuck lose time with those made for hell, rather than live ! lazyness, weakness, lack of resolve and endurance and perseverance ! \n\nthe remedy is slavelife, do, always, and when tired, sleep, to do again, never fake rest before the tv... that's smell personnal jihad.... \n\nto leave synthetic life to reenter the realm ! timevampire is standing in the way... anyway... it's funny to watch foreign tv, sometimes... \n\nthe only honest part of the bbc is the weather service... I am curious how it will be corrupted.\n\notherwise, it expose the wickedness of the political ruling class of england... I am sure that the uk would be way better managed with an absolute monarchy with right for the peons and others vassals... rather than this \"parlementary democracy farce (that's not the worst in the world) but the state operators of the british state... \n\nwe can't wait for the emir of britain to take over... finally, the kuffars will die. this british actual state is anarchy, and that's to be polite... it needs ORDER ! not enough hanging at the bridge... the proles have forgotten.\n\nand I frankly start to believe it's easier to regime change an absolute monarchy and that's way more flexible that this parlementary democracy system common to the west backed by WAMITTO2 (Western Adversarial Misinformation and Influence Tactics and Techniques Operators&OPERATIONS) ending in grifters and pedos ruling... anyway",
				"added": 1619554449
			}
		],
		"1619199374_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv": [
			{
				"comment_id": 7,
				"body": "it's so complicated : https://vigilantcitizen.com/latestnews/the-25-rules-of-disinformation/\n\nsuch bullshit...\n\nSTORM FRONT\n\nwhy waste time with all those shenigans and others psy construct... \n\nignore or explose.",
				"added": 1619554627
			},
			{
				"comment_id": 14,
				"body": "understanding the disinformation tactics, or AMITT, is such in a sense a waste of time, as it's way easier to ignore or kill... I am curious if there are so called academically trained pattern in the deployment of AMITT (which would be stupid as all who would be trained in AMITT would see them)...\n\nwhat surprise me, is the volume of guide in AMITT... specially for \"influencers\" on the so called social, medias.\n\nWhat would really be more interesting is counter disinformation, what are the most efficient way to uncondition a human being.\n\nfor example a pedocia feodal state operator? is it even possible? is the neuro training strong enough that they lost all neural flexibility to become \"hard\"wired biobots serving the pedofeodal aristocracy? lol... poor them.\n\nI ask that because I have a theory : \n\nyou can train a cat, to do what ever it's possible to train a cat to do, but it will always be a cat inside... he may obey you, fear you, etc but there is the \"cat spirit\"... same with orcas or crocodiles... I am sure that hyppos are super stubborn too... \n\non the opposite I would put elephants and horses...\n\nand dogs are just stupid... i mean if there is always food under moving tanks... why not this time?",
				"added": 1619582055
			},
			{
				"comment_id": 17,
				"body": "In finance, disinformation is called accounting fraud...",
				"added": 1619586458
			},
			{
				"comment_id": 18,
				"body": "and counter disinformation : reckless hacktivism or nefarious short sellers :). ahahha.",
				"added": 1619586503
			},
			{
				"comment_id": 21,
				"body": "A case study natasha betrand at 6:17 CET.... \n\n1.  THE PRESIDENT (biden) vs Valdimir putin... anyway our <3 tsar ! \n\n2. the pedo feodalists never coordinate with any one, but their corapists. as such it's a lie again... (germany is still occupied)\n\n3. what the fuck with this \"sequencing\" word, too much assassin creed...\n\n4. lol signaling, usa position of strenght? In which world? pedogate, debasement, gmo fucked food supply, autism rate exploding, covid bloodbath, no cure... I mean... only lost wars...  the problem is that the us has no monopoly be it on liberty or finance, neither as in the rules of war.\n\n5. true, it's all ready a big trip for ol joseph to travel so far from his basement, bring diapers reserve and more importantly a lot of windsields... maybe a closed part of an airport terminal with a classical \"connector\", rather than stairs... it could be fatal :).\n\n6. award russia with a meeting... just lol girl... she believes in her crap... \n\n7. loling at the reinforcement by the talking head of the \"position of strenght\"... what's wrong with impotent americans to always wanting to appears strong when all you do is shit your own house...\n\n8. effectivelly, even him get's it... time to expel demoNcrats... finally a inch of truth in this diatribe. \n\n9. blah blah misunderstanding / national security, we all know... big joe wants his cut... nothing else... it's so pathetic.\n\n10. she doesn't understand MAD...\n\n11. climate... feed those pipeline... as long as it's paid.\n\n12. trapped in counter \"terrorism\"... aka opposition to biden / nwo / uno... \n\n13. deconfliction / stability means for the pedogaters to have more peace of mind while commiting their atrocities.\n\n14. russian eager for recognition... lol, they ain't zarrif :)\n\n15. global pariah... okay... you know... if I may say, kinkade knows she will shine in the ballroom, and by this I mean that usa is too trashed that only corrupts, wicked and feodalists court it... or bandits, to loot the last bits remaining... (it's a long process to scavenge).\n\n17. anexxion of crimea... RETURN / VOTE... go away...\n\n18. they don't understand, \"legitimate actor\"... russia is... you don't understand the difference... (and who runs pedogate?). legimitimized is surrendering.\n\n19. I don't think there is much hope from the russia side, it's more the lulz and see what's the fee rate of biden... I hope the bro and son come, they seem to be the key negociators to meet...\n\n20. ukraine isn't tension, it's red line. and in russian semantic after red line comes kill zones... how wide depend on the number crossing... could be one, or it could end up in paris or berlin walled... reminder.\n\n21. ukraine first? naturally, they pay the fee (not only financially but in human capital) and have the goodies (partners or associates)\n\n22. fear of ukraine? that putin out bid them financially...\n\n23. lol ukraine isn't at war with russia, or resaid russia didn't yet invade ukraine, otherwise there wouldn't be a thing called ukraine... \n\n24. culture of lie \n\n25. a voice for ukraine, not for israel? we get the idea...\n\n26. ukrainian won't be sold out, they may risk to be out bidded by putin :)\n\n27. her face look so tortured... at least kinkade knows that it's all bullshit...",
				"added": 1619588823
			},
			{
				"comment_id": 34,
				"body": "https://www.zerohedge.com/political/greenwald-cnns-new-reporter-natasha-bertrand-deranged-conspiracy-theorist-and-scandal",
				"added": 1619590401
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 9,
				"body": "the biggest trap in war is to believe that the devil exists. \n\noh you will say, my bible... \n\ngo back to your buiding fools.\n\nsince when the other side is ruled by the \"devil\"?\n\nyou don't understand this part... I guess it's not clear in your book... \n\nyou should quran about the situation... it may appears old, as true as in the first day... \n\nheheheh... \n\nin short, it's a nice WAMITTO2 (Western Adversarial Misinformation and Influence Tactics and Techniques) to make mindcaptive to believe they fight against the devil...\n\nin the sense that if it's a phirao or even an emperor of Rome, it's always realistic even for the most brainwashed to understand that this thing, shits... yeah goes to the toilet... so yes...\n\nwe get back to the real school, where the shit of texas fear to go, afraid to freeze and be blasted by the winds, and even worst all of this to be drown for failed delivery...\n\nso like the snake oil sellers try to say that's the devil who took this missing cow...\n\nno one is buying it pos.\n\nyou go\nyou find\nyou kill\n\nmoving on.\n\nfight peacefully... \n\nwhere are you? \n\nin your minds it's so fucked up...\n\nahhh you feed...\n\nyou feed. on the cattle greezing...\n\nyou will be removed\n\nas you don't fight.\n\nbunch of sodomite gays sucking the cock of pedotrump... so lame... so weak...\n\nshame on me.",
				"added": 1619555199
			},
			{
				"comment_id": 13,
				"body": "A friendly advice to infowars personals, if you accept us feodal gov money or advantages to propagandize against foreign nation, you become part of the war effort of the feodal gov against this said nation. the feodal gov is renown to only win against domestic enemies, formerly called us citizens. warning launched as expected by the tradition.",
				"added": 1619581495
			}
		],
		"1618903442_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 10,
				"body": "> [sabretooth](#comment_12_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU): What's funny about that is that they've actually convinced themselves that they're doing a world a favor doing that kind of BS.\n\nWAMITTO2 (Western Adversarial Misinformation and Influence Tactics and Techniques)...\n\nthat's for me the most dangerous aspect of WAMITTO2 (Western Adversarial Misinformation and Influence Tactics and Techniques) is that once even those making it start to believe it...\n\nyes, you are worth it :)\n\nthink clearly...\n\na planet\nplants on this planet\nmaking a plant of a planet illegal\n\nalready you know it's not an intelligent specie.",
				"added": 1619555432
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 11,
				"body": "a planet\nplants on this planet\nmaking a plant of a planet illegal",
				"added": 1619556035
			},
			{
				"comment_id": 15,
				"body": "q ww2 : pavel dogs... if I get it :\n\ndogs were trained to see moving tanks as food source (using sound too?)\n\nhowever shouldn't dog, understanding and feeling war, not and naturally focus on feeding?\n\nin wolving term, I would call that a pack breach, serious offense, worthy of exclusion and or death.\n\nwhat I mean, is that you bring the trained mining biodevice (dog) to where the targets are, but the dog refuse to go, as it's clear, it's WAR ! or maybe understanding the uselessness of his trainers, those unworthy unhuman using his life so worthlessly, prefer to ride to the dog jhana... who knows...\n\nthe creation\na creature of the creation\nand the creator...\n\nis 1 for those in the inside.\nshort life !",
				"added": 1619582415
			},
			{
				"comment_id": 16,
				"body": "What I mean is those refusing to be kamikazes were super dogies !",
				"added": 1619582524
			},
			{
				"comment_id": 20,
				"body": "I would propose Iceland airport... of course there will be wind shield for a certain senile individual, otherwise, a tent or hangar will be enough to conduct quickly this useless meeting...\n\nuseless? I saw the begining of natasha bertrand... she said : a meeting between vladimir putin and PRESIDENT biden...\n\nokay... \n\nmoving on...\n\nthey are doomed.",
				"added": 1619587492
			},
			{
				"comment_id": 22,
				"body": "A case study natasha betrand at 6:17 CET.... \n\n1.  THE PRESIDENT (biden) vs Valdimir putin... anyway our <3 tsar ! \n\n2. the pedo feodalists never coordinate with any one, but their corapists. as such it's a lie again... (germany is still occupied)\n\n3. what the fuck with this \"sequencing\" word, too much assassin creed...\n\n4. lol signaling, usa position of strenght? In which world? pedogate, debasement, gmo fucked food supply, autism rate exploding, covid bloodbath, no cure... I mean... only lost wars...  the problem is that the us has no monopoly be it on liberty or finance, neither as in the rules of war.\n\n5. true, it's all ready a big trip for ol joseph to travel so far from his basement, bring diapers reserve and more importantly a lot of windsields... maybe a closed part of an airport terminal with a classical \"connector\", rather than stairs... it could be fatal :).\n\n6. award russia with a meeting... just lol girl... she believes in her crap... \n\n7. loling at the reinforcement by the talking head of the \"position of strenght\"... what's wrong with impotent americans to always wanting to appears strong when all you do is shit your own house...\n\n8. effectivelly, even him get's it... time to expel demoNcrats... finally a inch of truth in this diatribe. \n\n9. blah blah misunderstanding / national security, we all know... big joe wants his cut... nothing else... it's so pathetic.\n\n10. she doesn't understand MAD...\n\n11. climate... feed those pipeline... as long as it's paid.\n\n12. trapped in counter \"terrorism\"... aka opposition to biden / nwo / uno... \n\n13. deconfliction / stability means for the pedogaters to have more peace of mind while commiting their atrocities.\n\n14. russian eager for recognition... lol, they ain't zarrif :)\n\n15. global pariah... okay... you know... if I may say, kinkade knows she will shine in the ballroom, and by this I mean that usa is too trashed that only corrupts, wicked and feodalists court it... or bandits, to loot the last bits remaining... (it's a long process to scavenge).\n\n17. anexxion of crimea... RETURN / VOTE... go away...\n\n18. they don't understand, \"legitimate actor\"... russia is... you don't understand the difference... (and who runs pedogate?). legimitimized is surrendering.\n\n19. I don't think there is much hope from the russia side, it's more the lulz and see what's the fee rate of biden... I hope the bro and son come, they seem to be the key negociators to meet...\n\n20. ukraine isn't tension, it's red line. and in russian semantic after red line comes kill zones... how wide depend on the number crossing... could be one, or it could end up in paris or berlin walled... reminder.\n\n21. ukraine first? naturally, they pay the fee (not only financially but in human capital) and have the goodies (partners or associates)\n\n22. fear of ukraine? that putin out bid them financially...\n\n23. lol ukraine isn't at war with russia, or resaid russia didn't yet invade ukraine, otherwise there wouldn't be a thing called ukraine... \n\n24. culture of lie \n\n25. a voice for ukraine, not for israel? we get the idea...\n\n26. ukrainian won't be sold out, they may risk to be out bidded by putin :)\n\n27. her face look so tortured... at least kinkade knows that it's all bullshit...",
				"added": 1619589098
			},
			{
				"comment_id": 23,
				"body": "the question is whom to pay in the biden admin :).",
				"added": 1619589118
			},
			{
				"comment_id": 24,
				"body": "and what's the fee rate of the fbi / cia / dod?",
				"added": 1619589133
			},
			{
				"comment_id": 25,
				"body": "a billion for big jo, and to marioopol?",
				"added": 1619589168
			},
			{
				"comment_id": 26,
				"body": "2?",
				"added": 1619589174
			},
			{
				"comment_id": 27,
				"body": "for me the key take away : legimitimization is surrendering.\n\nthey don't and will never dictate or decide what's right or wrong.\n\nnever surrender.",
				"added": 1619589223
			},
			{
				"comment_id": 28,
				"body": "iceland is really great... then a little tour in what they traffic there, positive reinforcement as nordics...",
				"added": 1619589321
			},
			{
				"comment_id": 29,
				"body": "i find the idea to travel inside a city a complete useless loss of time, money and ressources, and it distub the flow of traffics and trade...\n\na small part of an airport for a short term sanization/safe etc, is way less costly... \n\nI guess the biden clan prefer cash? becarefull with those gold bars and air planes :D. \n\nI am curious how much blinken rate is...",
				"added": 1619589437
			},
			{
				"comment_id": 31,
				"body": "and for austin a shell corp with some sukhoi  / Russia arma in... he will be happy... \n\nthe question is what to get in return... \n\nbecause it's important to have the relation clear...\n\nrussia is the boss, pay it's suppliers... to get what it wants.\namerica is the supplier, and is paid for services.\n\nI hope a reasonnable fee rate / return can be found.\n\n(that's says how fucked up the feodal state is).",
				"added": 1619589797
			},
			{
				"comment_id": 32,
				"body": "iceland is the only country in the world (beyond china, but china is more than a country) to have arrested banker... banksters never commit crimes... rule 1 of bankstering.",
				"added": 1619589918
			}
		],
		"1619555817_14z94p9VMTXLV7CAdS4MD6ZmHWLzSCSe8w": [
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_3074_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Nobody knows what the fuck you're talking about.\n\nno, it's just you...",
				"added": 1619581241
			},
			{
				"comment_id": 35,
				"body": "> [styromaniac](#comment_3074_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Nobody \naka how you qualify yourself.",
				"added": 1619591692
			}
		],
		"1619297900_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": [
			{
				"comment_id": 19,
				"body": "htc brought the iphone...\nthere is nothing more closed sourced that ios.\nfurthermore the app store is coding racket.\n\nthey don't fall in the trap of the data flood, but target individuals who are still half awake.\nyou can always distinguish what is true or not, like using a microscope to check what's on covid test insert or in the vaxx of vaxxnazis or see if there is really a tank behind this hill... or mrvs decoys reveal themselves by not blasting much at the impact area... \nconquer and divide, old and impracticable against real performing state like CCP creation.\nit's hard and perilous to go see at the hill crest, what's on the other side, there may effectively be a tank...",
				"added": 1619587372
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 30,
				"body": "I guess natasha setting isn't her living room but a nice little studio... very interesting... she may be a good (for american western standard) propagandists but appears to sucks in monetizing it... unless I guess it's a studio...\n\nvs kinkade... the little segment... \"i am linda kinkade\"... ahahahahah... thx for the lulz... in short she runs an add campaign for herself, using cnn to achieve her objectives, while knowing it's all bullshit and that kangoroos are way smarter than americans while koala way kinder... poor natasha she has nothing... the ruined and destituted...",
				"added": 1619589627
			}
		]
	},
	"comment_vote": {}
}