{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Россия свободная",
			"body": "Для Русов желающих свободную Россию, без жидовского ига",
			"added": 1480865986
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "есть мы здесь и будет скоро больше, на радио русское вече выдвинул идею создать Русский Zeronet и организовать Русское Правительство и выборы в него https://www.youtube.com/watch?v=Z4A4ZQOr_9w",
				"added": 1480442988
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 2,
				"body": "интересно, написал здесь, видел что опубликовано а теперь исчезло, и здесь цензура?",
				"added": 1480450790
			}
		],
		"1_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 3,
				"body": "http://127.0.0.1:43110/1327368UDgT2VBMTv46L42qJs7vspSU6dF/\nСайт Русское Вече",
				"added": 1480866223
			}
		],
		"1_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr": [
			{
				"comment_id": 4,
				"body": "http://127.0.0.1:43110/1327368UDgT2VBMTv46L42qJs7vspSU6dF/",
				"added": 1480893988
			},
			{
				"comment_id": 5,
				"body": "> [anonfromonelon](#comment_23_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W): Лол. Ты сначала свою полит-экономическую программу предложи, а потом лозунгами разбрасывайся. Понты кидать и я умею.\n\nтак не кидай понты а выйди на сайт и почитай, всё там есть.",
				"added": 1481427573
			},
			{
				"comment_id": 6,
				"body": "помогай чем можешь, денег не надо, дела нужны",
				"added": 1481427725
			},
			{
				"comment_id": 7,
				"body": "Сайт Русского Вече ТВ http://127.0.0.1:43110/1327368UDgT2VBMTv46L42qJs7vspSU6dF/\nЗдесь и программы и живые эфиры и архив прошлых записей",
				"added": 1481427876
			},
			{
				"comment_id": 8,
				"body": "всегда удивляет почему люди демонстрируют свою лень? Конкретная программа прямо кричит прочитай меня но помогу тебе выйти из 3 сосен http://127.0.0.1:43110/1327368UDgT2VBMTv46L42qJs7vspSU6dF/kopa.html\nОткуда фантазии о отказе от денег? Проблемы с русским? \ntolstoevsky ты реально считаешь что Народовластие не является идеологией? Терминология странная  для забывших Русский язык. Откуда вылез термин \"Копная русь? С Руси которая было Копной тысячи лет, а казаки до прихода большевиков, зотя и в обрезанной форме.\nСпециально для незнающих Пошлого Руси выставлены видео о Копах, но вообще то еще есть и Рамблер и Гугл. Читайте, это наше Прошлое и не столь отдаленное Будущее.",
				"added": 1481682740
			},
			{
				"comment_id": 9,
				"body": "ленивые всегда и глупые, думать то это работа. Были бы мозги и если бы мог ими пользоваться то знал бы, что есть экономика, средство ограбления и народное хозяйство, инструмент удовлетворения материальных и иных нужд Народа. Если трудно, то не напрягайся,  подрастешь, возможно поймешь. Хотя без гарантии.",
				"added": 1481726327
			},
			{
				"comment_id": 10,
				"body": "Вдогонку, для всех этого не знающих. Программа Народного хозяйства зависит от целей поставленных правительству Народом и для их выполнения используются любые инструменты дающие  требуемый результат. Экономическая программа термин неприменимый для Народного хозяйства.",
				"added": 1481726695
			},
			{
				"comment_id": 12,
				"body": "русский - принадлежащий Руси, а Русы это кому принадлежит Русь со всеми живущими там русскими евреями, русскими азерами, и иными русскими инородцами, это они русские. Это правила Русского языка. Великорусов официально сделали русскими жидобольшевики в 1919 году. Блять, историю и свой язык надо знать",
				"added": 1482850978
			},
			{
				"comment_id": 13,
				"body": "а мозги у тебя зачем? Для чего скачивать видео если оно вполне легально? В смысле не запрещено решением суда?  Как и сам сайт кстати? Он на зеронет чтобы не могли стереть на провайдере, что уже было не раз",
				"added": 1484522178
			},
			{
				"comment_id": 15,
				"body": "безумны те, кто говорит но не может свои слова обосновать, тем более невежы даже не знающе что такое фашист",
				"added": 1491241150
			}
		],
		"12_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 11,
				"body": "а чем навальный лучше путина? Притом на выборах выигрывает не тот кто голосует а кто считает голоса",
				"added": 1481808166
			}
		],
		"1_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM": [
			{
				"comment_id": 14,
				"body": "не будет у вас революции, по одной простой причине, мальцевцы это проект от того же госдепа как и правый сектор на укрруине, и предлагают они сменить одних жидов на других чтобы сделать и в РФ туже руину. Почитайте что говорили на майдане и до него и послушайте мальцевских. 100% совпадение, по одной кальке работают национал предатели. кинули народ раз, второй уже не выйдет. Путину вы своим тупоумием только помогаете.",
				"added": 1484522734
			}
		]
	},
	"comment_vote": {}
}