{
	"file": {
		"1553131181-BREAKING NJ Teachers Union President Will Bend the Truth, Cover Up Child Abuse in Schools.mp4": {
			"title": "BREAKING NJ Teachers Union President Will Bend the Truth, Cover Up Child Abuse in Schools",
			"type": "video",
			"description": "Last month, Project Veritas undercover journalists blanketed the state of New Jersey visiting dozens of teacher’s union offices.  We wondered, how union leaders would react to claims that teachers were physically and verbally abusing students?",
			"is_featured": 0,
			"image_link": "https://img.youtube.com/vi/cGfa9pDYRPs/maxresdefault.jpg",
			"size": 102125276,
			"date_added": 1553302650
		},
		"The Truth about Planned Obsolescence.mp4": {
			"title": "The Truth about Planned Obsolescence",
			"type": "video",
			"description": "No information",
			"is_featured": 0,
			"image_link": "https://img.youtube.com/vi/4Z1XYM7bC4k/maxresdefault.jpg",
			"size": 26112881,
			"date_added": 1553639735
		},
		"The Lightbulb Conspiracy - Planned Obsolescence.mp4": {
			"title": "The Lightbulb Conspiracy - Planned Obsolescence",
			"type": "video",
			"description": "Did you know that the lifetime of light bulbs have been reduced on purpose to just 1000 hours?\nOr that your printer may 'break' after a  predefined number of printed pages determined by an electronic counter?\nOr that Apple batteries lasted only 18 months which meant that you had to throw away your iPods and buy another?\nWhat about Dupont stockings that were strong enough to tow a car, before they went back to design a stocking that would wear out more quickly!\n\nHave you ever heard the phrase '...They don't make them like they used to' or have you ever wondered why an item fails as soon as the warranty expires or maybe just finished making payments on your car when the mechanic tells you it's time to buy a new one as it's beyond economical repair.\n\nThey say we live in a 'thow-away' society, just look at what turns up in Ghana labelled as '2nd-hand-goods' to get around dumping regulations.\n\n...oh, and see if you can guess how long a lightbulb in a Californian fire-station has been burning for, 1 year? ...5 years? ...10 years?  ...watch and see!\n\nThis documentary from Norway now released under creative commons licensing was originally called 'The Pyramid of Waste - The lightbulb conspiracy' sheds some light (sorry!) on the designed lifespan of products.\n..I just hope they don't have an equivalent program for people ...or do they? -i'll leave that one for the conspiracy theorists.\n",
			"is_featured": 0,
			"image_link": "https://img.youtube.com/vi/zdh7_PA8GZU/0.jpg",
			"size": 211665667,
			"date_added": 1553642274
		}
	}
}