{
	"next_topic_id": 32,
	"topic": [
		{
			"topic_id": 1517733744,
			"title": "想要充实自己，有哪 10 本书或者 10 部电影值得推荐？",
			"body": "",
			"added": 1517733743,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517734529,
			"title": "历史上有哪些成就颇高但鲜为人知的人？",
			"body": "",
			"added": 1517734527,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517734555,
			"title": "有文化可以有多可怕？",
			"body": "",
			"added": 1517734552,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517734584,
			"title": "你写过或者听过哪些「魔性」的故事？",
			"body": "也可以写一个，我有空也来填坑。 最近老在看书，都有点找不到题了！hold不住了！ 快邀请喜欢的故事选手，让他们来发一把麦旋疯吧！",
			"added": 1517734580,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517734609,
			"title": "有哪些必备的知识技能？",
			"body": "人活着应该知道哪些方面的知识，会过的更好？",
			"added": 1517734604,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517734629,
			"title": "为什么绝大部分国内大学未推行单人宿舍？",
			"body": "国内大学的宿舍普遍是4人间，6人间，甚至是10人间。作为成年人，是否应该有自己独立的空间？是出于管理方便，还是经费有限，不能提供足够的房源？",
			"added": 1517734623,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517734651,
			"title": "有什么知识，你知道后你的世界马上就不一样了？",
			"body": "有哪些知识会对你看待问题，处理事情，即今后生活的方方面面有着不可逆的影响？（积极/消极影响，会有消极的么？）\n举个栗子吧，比如精通多门语言的人分析句子能很快地很清楚句子的构成，当然这只是一方面。\n所以希望大家分享自己的看法，欢迎来自各行各业的回答，推荐相关文章、著作也行！\n非常感谢，我一直都在寻找这方面的知识，摆脱自己落后的精神面貌！",
			"added": 1517734644,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517734932,
			"title": "拥有稀有的姓，是种怎样的体验？",
			"body": "题主姓祁，从小到大除了家人以外身边就再没碰到过任何同姓的人……\n后来有一天知道有个球员叫祁宏，再后来发现剑三里有个祁进\n\n再后来还有祁同伟！都是电视剧.... 难以描述心里的感觉吧，总觉得很微妙，不知道那些姓氏更稀有的人会是什么样子的体验呢？\n\n20181月23（非题主）编辑，为什么好多姓都见过？感觉有的不算稀少....比如出现了本人的姓，梁，这好多名人或者人数好么？",
			"added": 1517734924,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735042,
			"title": "历史上有哪些成就颇高但鲜为人知的人？",
			"body": "如题。\n成就比名字有名。\n\n请注意是可以载入史册级别的， 有知友回答说周杰伦公司的某个合伙人就太跑题了",
			"added": 1517735033,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735342,
			"title": "有哪些十二年前（2005 年左右）看似不靠谱的预测成真了？",
			"body": "请指出 2005 年的预测，并描述现实的推进情况。",
			"added": 1517735332,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735402,
			"title": "数学里的 e 为什么叫做自然底数？是不是自然界里什么东西恰好是 e？",
			"body": "我的意思是它和“自然”有什么关系？为什么这个数要叫做“自然底数”呢？",
			"added": 1517735391,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735434,
			"title": "自控力极差的人如何自救？",
			"body": "表现的症状或后果包括但不限于：\n1、无法长时间做同一件事情\n2、注意力很容易被转移\n3、情绪管理存在问题，遇到外部影响，情绪波动较大\n4、常年没有完整阅读过任何一本读物\n5、由于浅阅读及情绪波动，导致语言表达能力退化，无法将文字顺畅转化为口语进行表达\n6、精神状态起伏，以致影响身体协调能力、语言组织能力的起伏\n7、短时记忆存在问题，在几秒钟之内会忘记之前所要做的事情，想说的话",
			"added": 1517735422,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735481,
			"title": "狐臭是怎么产生的？",
			"body": "如何让狐臭对别人造成的影响最小化？\n\n不是楼主有狐臭，谢谢～那些打广告的就不要往枪口上撞了。",
			"added": 1517735468,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735531,
			"title": "昆虫为什么不会因趋光性齐刷刷地奔向太阳？",
			"body": "然后直到缺氧或者低温死去。",
			"added": 1517735517,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735578,
			"title": "为什么上班都是坐着，还会感觉疲惫不堪？",
			"body": "大部分的办公室行政人员基本上都是坐一天，偶尔签字找领导去财务会走动几下，很少有大量的走路，或者体力上的劳动，运动量很大的应该是大脑，嘴巴，和手，比如思考，沟通，写作之类，但是一天下来缺感觉身心俱疲！记得以前上学的时候，家里大人有说，用脑过度也会瘦，意思就是大脑用的多了也会消耗脂肪，其实也算是一种运动量！但是以前是不累的，只是表现的很能吃！现在下班了基本上~都快瘫了！是老了体力不好了？还是其他原因？？",
			"added": 1517735563,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735632,
			"title": "为什么会有回光返照？",
			"body": "",
			"added": 1517735616,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735692,
			"title": "一沾酒就脸红的人能锻炼出酒量吗？",
			"body": "",
			"added": 1517735675,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735717,
			"title": "「55 度水杯」利用的是什么物理原理？",
			"body": "",
			"added": 1517735699,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735758,
			"title": "宇宙中没有氧气，为何太阳会燃烧出火焰？",
			"body": "",
			"added": 1517735739,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735787,
			"title": "为什么女生有「体香」？",
			"body": "感觉女生从我身边飘过的时候，总有一股香味，淡淡的。我老婆也有这种香味。但是她自己没什么感觉。\n难道是她们洗澡的时候沐浴露太多了？还是我的错觉？",
			"added": 1517735767,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735858,
			"title": "笑气是否算毒品？",
			"body": "在英国上学，看见室友们把小号钢瓶里的气体打进气球里然后吸入，前几天看见学校报纸说这是毒品？如何看待这种行为？如果他们邀请我我怎么拒绝？我室友人不坏。",
			"added": 1517735837,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517735958,
			"title": "冷战时期，几十颗核弹就可以毁灭对方，为什么美苏还要造几千颗核弹？",
			"body": "这玩意放在家里面也不安全啊，非特殊情况下也不用，过期了还要想怎么报废？",
			"added": 1517735936,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517736040,
			"title": "裸睡时如果地震了怎么办？",
			"body": "很喜欢裸睡，可是常常想到如果地震了，那就都被人看了。于是衣服就会穿回去，不然睡不着觉，怎么破？\n裸睡好舒服啊！各种爽！可是我生活的地方是地震带。",
			"added": 1517736017,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737199,
			"title": "有哪些可以提升情商、判断力和谈话技巧的书籍？",
			"body": "书是人类进步的阶梯，想从书中找到解决现实中的许多人际问题的方向性答案。\n\n各个方面，对人对事都ok.\n\n尽管问题各有不同，希望得到点经验。望赐教。",
			"added": 1517737175,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737283,
			"title": "有哪些你第一眼看到就爱上的句子？",
			"body": "我第一次看到《双城记》记的开头，就爱上了。",
			"added": 1517737258,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737395,
			"title": "有一个舍得为你花钱的男朋友是种怎样的体验？",
			"body": "",
			"added": 1517737369,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737508,
			"title": "如何评价奚梦瑶在维秘录制时摔倒？",
			"body": "希望大家谈谈这件事对奚梦瑶本身以及中国时尚界的影响",
			"added": 1517737481,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737596,
			"title": "如何让更多人加入零网？",
			"body": "",
			"added": 1517737568,
			"parent_topic_uri": "1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737623,
			"title": "零网是否可以开发类似比特币的东西",
			"body": "",
			"added": 1517737594,
			"parent_topic_uri": "1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737654,
			"title": "零网使用了什么技术？",
			"body": "",
			"added": 1517737624,
			"parent_topic_uri": "1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1517737706,
			"title": "有哪些相貌平凡的人穿出衣服品味的例子？",
			"body": "",
			"added": 1517737675,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1517737706_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1517733744_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 1,
				"body": "第一个首推《白日梦想家》，一生推。\n\n推荐理由：能让天天很闲的你找到事情做，远离宅男状态。知道自己年轻是多么值钱。",
				"added": 1517733857
			}
		],
		"1517734651_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 2,
				"body": "**1.不要看对方说了什么，而是思考他为什么说这个**\n昨晚我爸打电话给我，告诉我1月下旬的时候杭州天气可能会不好，让我注意保暖。我告诉他我一月中旬就会回去的，老爸很满意的挂电话，停止了给我弯曲杭州天气的进程。他其实这句话只是告诉我：过年早点回来，我想你，但是他么那个年代的人是表达不出来这种思念的，会绕用各种绕口的方式表达内心的感情。快到圣诞了，女友和我讲最近有个男生经常追求她，今天还给了她礼物，她说完之后停了一会儿，这个停顿是为了看我的反应，所以我理所当然的开始吃醋，开始和她表达爱意，在这个过程中还不忘打开了t宝。其实她告诉我这件事的动机只有两个：\na.试探一下你是不是在乎我。\nb.我想要圣诞礼物4岁的小侄子打电话给我，说想我了，想我去上海陪宝宝玩。\n他的需求有两个：\na.家里确实无聊，想我带他出去烧火，带他出去玩各种刺激的\nb.他想吃糖，只有我会偷偷给他糖吃我自己确实无法去上海，所以我告诉他，杭州最近有怪兽，我走不开，但是我打怪兽国家发我糖作为奖励，这些糖都寄给他吧。当我不懂这个道理的时候，觉得世界真心复杂，和一个人交往真难，但是慢慢的开始掌握这种思维之后，世界在慢慢变得简单起来。这种能力需要练习，练习的方式是换位思考，初期肯定经常出错，但是有了这样的意识，就不会活得混混沌沌了，每一次成功的感知或者失败的感知，都是知识库的一部分。这也能培养观察能力，当你确实的在使用这个能力的时候，你会发现，其实以前你和别人的矛盾都是你们在讨论不同的问题，识别不了对方需求，表达不出自己的需求。\n\n**2.主动交流，多去赞美，决定一个人对你看法的是你们的关系**\n我在大学的时候有一个不错的女性朋友，我和她出去玩总发现我们所处的这个世界难度不一样。当时我还处于愤青年纪，我觉得她之所以是简单难度，是因为：我们更愿意帮助漂亮女生定律。后来又结实了一些男生，他们也简单一点，我才意识到，我缺乏他们的一种品质：主动交流。但是当时我自诩清高，不屑于这些人际技巧，后来我自我反省，才发现这不是正直，而是自恋。我曾经一直存在着某种不切实际的幻想，我坐在图书馆里面，摆出专注的态度，前面放着一大摞大部头书籍，总能吸引到有丰富内涵的女生。这种幻想是来自一种自恋，不愿意付出，认为以优秀就能获得别人青睐的自恋，骗自己罢了，除非我长得像梁朝伟，不然别人都没工夫看我前面的书到底有多厚。我开始试着放下我那卑微的自尊心，多与人交流，多平等的交往，不再去不切实际的幻想着对方被我深深吸引，世界的难度在降低。我会在食堂打饭的时候主动和阿姨聊两句，几次之后她就能认识我，我发现自己的饭也变多了。在杭州救助站实习的时候，多交流这个品质帮了我很多。因为我早上起得迟，食堂是7点开放，我8点才起来，每次阿姨都会给我留吃的，以前早上都是饿肚子，只是因为我有一次和阿姨聊了聊各自的家庭之后状况变了。那时候住在山上，没电视没网络，非常无聊，晚上会下山玩玩，之所以能下山玩，是我那时候找门卫下棋，和他抱怨过这里无聊，他告诉我晚上可以下山玩，10点之前回来，他帮我留门。主动沟通真的能降低生活难度，不要一上来就表达自己的需求，熟悉之后对方自然愿意为了你麻烦一下自己。人都是喜欢能让自己获利的人，赞美是最简单的建立关系方式，到卖蛋饼的店夸他蛋饼好吃，说不定聊两句之后她会给你做的大一点。夸中年妇女漂亮，夸少女温柔和吸引力，夸男生成熟，夸长辈对自己的耐心，只是简单的一句话，能让你的世界变得很不一样。越来越多的体验让我真实的认识到：决定一个人对你态度的，不是你是什么样的人，而是你们的关系。我在救助站受到更多的照顾，不是我在山里还算稀有的大学生身份，而是我和他们都很熟，我最近迷恋吃羊骨头煲，我发现我的羊肉总比别人多，不是因为我长得帅，而只是每次吃完我都和老板娘唠嗑。\n\n**3.找准自己的角色**\n时常有人问我，为什么你和老师的关系这么好？是不是你更擅长与拍马屁？是的，确实我拍马屁比较厉害，但是我觉得更关键的是我知道自己是一个学生，老师和学生关系好，意思就是师生关系好。学生的要求就是尊重知识，热爱学习，只要做到这一点，和老师关系不会差的。我觉得鉴别一个人成熟度的就是找自己位置的能力。几个朋友打牌，你一定要赢，一定要表现自己的聪明，和别人合作，别人出错牌就一肚子牢骚，大家都是朋友，一起玩无非图个开心，如果找不准自己的位置，总想表现自己的优异，总想获得别人的赞美，没几个愿意和你玩的。领导开会不敢发言，怕同事觉得自己装逼，开会是上下级，同级交流，就需要表现自己的看法。生活的复杂性在于有时候你的角色会冲突，努力扮演好自己的主要角色，对次要角色做到心安，生活能变得顺心很多。\n\n**4.焦虑来自你的想象，别人对你没有预设，预设是你自己给自己的**\n在积极心理学的课程上时常有一个小活动：站到讲台上，当着全班同学的面大声吼，放开了吼。如果有过这样的体验的人一定能有一种很神奇的经验：我坐在下面，想着自己等下要上去，特别的紧张，很担心自己到时候吼不出来，越想不紧张。但是当我真的站在上面，放开了吼的时候，我发现其实和我想的不一样，当能够专注于自己吼出来的时候，焦虑全部消退了。一个心理学实验：一批志愿者，告诉他们体验歧视，在他们的脸上做出疤痕，然后让他们分散在每个公共场所，晚上回来的时候让他们讲体验。很多人都说自己遭受歧视了，而事实上，他们在出去的时候工作人员以补妆为借口已经把他们的疤痕擦去了。对外界的焦虑，来自自己对自己的看法，对自己的看法会篡改你在外界收到的真实信息。我们焦虑与人际，大多是觉得自己不够好，不够优秀，其实别人压根没觉得你应该优秀。\n\n**5.找到自己想要什么**\n我们时常会说优质的男性与女性更懂得尊重别人，他们不容易生气，不会强迫别人，他们温文尔雅，这些都并不来自与他们有更高的忍耐力，更高的情商，只是他们不在乎。凯撒大帝英勇无比，长老团围攻凯撒，他如战神屹立，直到他在刺杀人群中看到了自己的妻子（此处感谢各位知友的提醒，是布鲁斯），他失望的放下了自己的武器。即使最优秀的人遇到自己在乎的东西也会变得脆弱。而不再去在乎外界的看法最好的方式是你回避外界，而是找到真正自己努力和在乎的东西。在我的咨询体验中，来访者有两个阶段变化最大：\n1.接受现状，他的焦虑会明显减轻\n2.寻找到自己想要的，他的抑郁开始消退，生活变得积极当能发觉来访者找到自己想要的东西的时候，咨询已经变得很容易。其实不必羡慕那些积极的人，你想模仿他也不可能，如何做到的答案在你心里，很多人会问，我就是不知道自己想要什么，怎么办？找到自己想要的这句话第一个字是找，每当你找的累了，都告诉自己：我这是在给自己一个机会。\n\n**6.一种感受只能被另一种感受替代**\n当你发现面前有一个小姑娘在哭的时候，你会做什么？男性一般讲个笑话，给个棒棒糖，希望用开心代替她的哭泣。女性一般温柔的抱抱，问她怎么了，给她安慰和抚慰。我们明明知道如何对待悲伤，却从来不对自己使用。当你悲伤的时候，你不知道其实最好的办法是出去玩一玩，找点快乐的事情做一做，你不知道你需要好好的安慰自己，鼓励自己，我们总是强迫自己不能悲伤，应该振作。绝大部分对待自己的方式都是很暴力的，就像一个小女孩在哭泣，你走上去，凶狠的和她说：不准哭！再哭我就打你！这样的方式怎么能让那个小姑娘不哭？这样的方式怎么能让自己的悲伤消退？悲伤和痛苦是压抑不住的，但是你可以通过另外一种感受代替他。\n\n**7.别指望有人能理解你，降低自己对这个世界的期望**\n我曾经之所以痛苦，因为我觉得这个世界这么美好，而我如此不幸。我现在之所以平静，因为我知道这个世界本身就很恶毒，有人对我好，有人赞扬我，都是我赚了。别人不会懂我，也没有义务懂我，包括父母，我没有理由恨他们，让别人懂我是我自己的事情，但凡有人愿意懂我都应该感激。世界很糟糕，而我很幸福。\n\n**8.把时间从压抑自己的欲望解放到如何合理的释放自己的欲望**\n我时常会收到一些私信，比如说：我常年手淫，戒不掉，怎么办？我喜欢乱花钱，控制不住自己逛淘宝，怎么办？一次次压抑自己的行为与欲望，一次次在无法压抑中自责与痛苦，不是你意志力不够，而是方法错了。之所以迷恋手淫，之所以迷恋花钱，因为你的生活本身太无聊！无聊的生活，手淫和淘宝是唯一的多巴胺释放途径，我们会迷恋上这种快乐。但是这种快乐有代价，你要阻止这种行为，其实也就是在阻止这种快乐，这时候你的敌人就是你自己，自己打自己，你的绝大部分主观能动性都调动不起来。小时候喜欢吃橘子，但是橘子上火，不能多吃，但是控制不住，后来爸爸买了荔枝，这才是真的甜，于是不想吃橘子了，开始吃荔枝，但是荔枝贵，不能多吃，但是又控制不住。之后和二丫发明了两个人光着身子玩过家家的游戏，每天放学也没空回家吃荔枝了。欲望满足所释放的力比多你是控制不住的，之所以需要控制是因为单纯的满足自己代价太大，你需要控制的是自己的行为，寻求其他更合理的方式满足自己的欲望。与其每天控制自己，不要偷邻居的内衣自慰，还不如好好读书，培养品质，多赚点钱，让自己更优秀，找个老婆回家各种cosplay。与其删除淘宝，不如培养爱好，做点公益，生活中有其他事件能够释放多巴胺了，我们就不会在迷恋代价巨大的多巴胺了。",
				"added": 1517734884
			}
		],
		"1517734932_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 3,
				"body": "抖了个机灵，竟然破百了\n\n看到好多我工同学的评论，先给老师道个歉，我并没有恶意的。\n-----------------------------------------------------------------------------\n\n不请自来，我是来讲故事的，哈哈\n\n故事的主角可不是我，我可没有一个稀有的姓。\n\n故事的主角是我的研究生同学的博士生导师。\n\n他的导师姓果，就是《咱们结婚吧》中黄海波演的果然的果！\n\n但是\n\n这不是重点\n这不是重点\n这不是重点",
				"added": 1517734976
			}
		],
		"1517735042_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 4,
				"body": "1897年7月出生\n1921年毕业于湘雅医学院\n1937年淞沪抗战，身负第一线参加前线医疗救援队\n1938年接任中央防疫处处长。在昆明从无到有重建中央防疫处。从这时起，抗战中的疫苗与药品源源不断的从昆明西山送往全国各地。1942年，制造成功国产牛痘苗，供盟军使用。\n1943年，在这个没有自来水，每天都要修一次锅炉，琼脂要回收利用的厂房，生产出了第一批国产临床级抗生素。抗战8年间，作为中国唯一的防疫机构，肩负起对抗日本细菌战的使命。\n1945年于抗战结束后来到北平，此时旧时的北平防疫处天坛旧址已被破坏殆尽，开始重建工作。于1947年完成。1949年建国后选择继续留在国内，\n1950年防疫处改名中央政府卫生部生物制品研究所，担任所长，主持疫苗与药品的研发与生产工作。在全国推行牛痘苗，最终中国在1961年宣布消灭天花。\n1955年成功在实验室分离出沙眼病原体TE8。\n1958年元旦，以自己作为实验对象，证明了沙眼病原体的致病性。成为世界上第一位发现重要病原体的中国人。1958年九月，受到拔白旗运动冲击，自尽。\n1970年，这种病原体类型被正式定名为衣原体。1980年，国际眼科防治组织想为他颁发沙眼金质奖章，可是他早已不在人世。\n汤飞凡（1897年7月23日－1958年9月30日）\n\n1910年10月21日，东北大鼠疫的指标病人进入满洲里，6日后死亡。\n同年11月8日，疫情传播至哈尔滨。12月初，外务部收到日俄两国照会，要求己方派兵进入东北保护侨民并主持北满防疫事宜，一时间气氛凝重。同时疫情逐步向关内扩散，整个北中国岌岌可危。\n12月22日，一位年仅31岁的华侨与他的助手登上了北上哈尔滨的火车，主持防疫工作。\n12月27日，这位剑桥医学博士完成了中国第一例疫区尸体解剖。\n1911年一月初，判断东北鼠疫疫情为肺鼠疫，改变了各国专家专家鼠疫只能由跳蚤传播的看法，推广加厚口罩。\n1911年1月，中国第一次以科学为指导的防疫工作开始进行。大年初一，哈尔滨进行了中国第一次大规模的火葬。有效的阻止了疾病的继续传播。\n同年3月，哈尔滨疫情宣告结束，\n4月，吞噬6万余人生命的东北鼠疫疫情宣告扑灭。\n4月3日，万国鼠疫大会在奉天召开，为中国第一个国际学术研讨会，作为抗击东北鼠疫的首要功臣，那个华侨青年被委任大会主席。再后来的事，就是他在北洋政府的支持下建立北京中央防疫处，任第一任处长。于中华民国时期主持收回港口检疫权事宜。创立中华医学会并担任第一任会长。创办哈尔滨医学专门学校（现哈医大），任第一任校长。1920年东北鼠疫再起，但是这时当年的那位青年在东北已经布下了十几所防疫医院与检疫站，这一次他再度领导东北防疫工作，最终将死亡人数控制在万人之内。\n1937年，八一三事变爆发，身在上海的他最终举家回到了自己的家乡马来亚，定居怡宝，开设诊所度日。1960年1月2日病逝于马来西亚槟郎屿。一位来自南洋的青年，在北国的黑土地上面对人类史上最凶恶的烈性传染病，一己之力挽狂澜于既倒 扶大厦之将倾。拯救了哈尔滨，也拯救了整个东北。\n伍连德（1879年3月10日-1960年1月2日） \n“科学输入垂五十年，国中能以学者资格与世界相见者，伍星联博士一人而已。”                               ——梁启超",
				"added": 1517735291
			},
			{
				"comment_id": 5,
				"body": "1897年7月出生\n1921年毕业于湘雅医学院\n1937年淞沪抗战，身负第一线参加前线医疗救援队\n1938年接任中央防疫处处长。在昆明从无到有重建中央防疫处。从这时起，抗战中的疫苗与药品源源不断的从昆明西山送往全国各地。1942年，制造成功国产牛痘苗，供盟军使用。\n1943年，在这个没有自来水，每天都要修一次锅炉，琼脂要回收利用的厂房，生产出了第一批国产临床级抗生素。抗战8年间，作为中国唯一的防疫机构，肩负起对抗日本细菌战的使命。\n1945年于抗战结束后来到北平，此时旧时的北平防疫处天坛旧址已被破坏殆尽，开始重建工作。于1947年完成。1949年建国后选择继续留在国内，\n1950年防疫处改名中央政府卫生部生物制品研究所，担任所长，主持疫苗与药品的研发与生产工作。在全国推行牛痘苗，最终中国在1961年宣布消灭天花。\n1955年成功在实验室分离出沙眼病原体TE8。\n1958年元旦，以自己作为实验对象，证明了沙眼病原体的致病性。成为世界上第一位发现重要病原体的中国人。1958年九月，受到拔白旗运动冲击，自尽。\n1970年，这种病原体类型被正式定名为衣原体。1980年，国际眼科防治组织想为他颁发沙眼金质奖章，可是他早已不在人世。\n汤飞凡（1897年7月23日－1958年9月30日）\n\n1910年10月21日，东北大鼠疫的指标病人进入满洲里，6日后死亡。\n同年11月8日，疫情传播至哈尔滨。12月初，外务部收到日俄两国照会，要求己方派兵进入东北保护侨民并主持北满防疫事宜，一时间气氛凝重。同时疫情逐步向关内扩散，整个北中国岌岌可危。\n12月22日，一位年仅31岁的华侨与他的助手登上了北上哈尔滨的火车，主持防疫工作。\n12月27日，这位剑桥医学博士完成了中国第一例疫区尸体解剖。\n1911年一月初，判断东北鼠疫疫情为肺鼠疫，改变了各国专家专家鼠疫只能由跳蚤传播的看法，推广加厚口罩。\n1911年1月，中国第一次以科学为指导的防疫工作开始进行。大年初一，哈尔滨进行了中国第一次大规模的火葬。有效的阻止了疾病的继续传播。\n同年3月，哈尔滨疫情宣告结束，\n4月，吞噬6万余人生命的东北鼠疫疫情宣告扑灭。\n4月3日，万国鼠疫大会在奉天召开，为中国第一个国际学术研讨会，作为抗击东北鼠疫的首要功臣，那个华侨青年被委任大会主席。再后来的事，就是他在北洋政府的支持下建立北京中央防疫处，任第一任处长。于中华民国时期主持收回港口检疫权事宜。创立中华医学会并担任第一任会长。创办哈尔滨医学专门学校（现哈医大），任第一任校长。1920年东北鼠疫再起，但是这时当年的那位青年在东北已经布下了十几所防疫医院与检疫站，这一次他再度领导东北防疫工作，最终将死亡人数控制在万人之内。\n1937年，八一三事变爆发，身在上海的他最终举家回到了自己的家乡马来亚，定居怡宝，开设诊所度日。1960年1月2日病逝于马来西亚槟郎屿。一位来自南洋的青年，在北国的黑土地上面对人类史上最凶恶的烈性传染病，一己之力挽狂澜于既倒 扶大厦之将倾。拯救了哈尔滨，也拯救了整个东北。\n伍连德（1879年3月10日-1960年1月2日） \n“科学输入垂五十年，国中能以学者资格与世界相见者，伍星联博士一人而已。”                               ——梁启超",
				"added": 1517735311
			}
		],
		"1517735632_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 6,
				"body": "大脑：各单位报告目前情况心：机能丧失99%肝：机能丧失99%肺：机能丧失99%胃：机能丧失99%脾：机能丧失99%肾：机能丧失99%大脑：外界援助已经无法扭转局势，肾上腺素储备还有多少？肾上腺：肾上腺素仅余5%且无法再制造大脑：所有肾上腺素分配给神经系统及声带肌肉，准备给外界传达最后信息，其余各单位做好停机准备，本指令不再重复",
				"added": 1517735637
			}
		],
		"1517735787_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 7,
				"body": "化妆品腌入味了→_→",
				"added": 1517735785
			}
		],
		"1517735858_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 8,
				"body": "最近，新京君采访了多位曾经吸食笑气的留学生，他们中有人为此花费了上百万人民币，有人因此终身瘫痪。对笑气感到疑惑的朋友，不妨来看看这篇报道。\n\n飞机从美国西海岸的西雅图起飞，在11小时内跨越8711公里，落地北京。\n今年5月的一天，25岁的韩梦溪坐在轮椅上，被推出了首都国际机场。\n她身上带着伤口，带着激增的五十斤体重，还带着高血压、肥大的心肌和重度肌无力的下半身。\n同样的一幕6月底再次发生，她的好友杨丹和男友刘胜宇双双坐着轮椅回了国。\n18岁的刘胜宇被医生诊断为终生瘫痪，已彻底丧失自理能力。\n过去的一年，这三位留学生人均花费几十万人民币，吸了至少一万罐“笑气”。这种学名为一氧化二氮的气体，每小罐只有8克，吸食一次能带来十秒的快感，最终却使这些来自富裕家庭的孩子一个个倒下，有的甚至丧失了一生的自由。6月30日，韩梦溪一封题为《最终我坐着轮椅被推出了首都国际机场》的公开信，将她经历的一切展现在公众眼前。\n文中她写到，“那几个月我花了几十万去干这件毫无意义伤人害己的事情，一直到今天我都还是不能独自行走。”目前无法确切统计多少人受到“笑气”的危害，但几个细节足以显示成瘾者群体的庞大——近百留学生在网上评论称自己曾吸食“笑气”，有人至今仍瘫痪在床；在国内，许多医院都曾接诊“笑气”中毒患者；一位戒毒研究专家发现，在浙江宁波，甚至有高中生在吸食“笑气”。\n更严峻的现实是，这种气体不属于法定的新型毒品，无论在制度还是在市场上，都处于没有管控的状态。\n而面对这些倒下的年轻人，中外的医生都没有找到精准的治疗对策。",
				"added": 1517735893
			}
		],
		"1517736040_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 9,
				"body": "08年，四川512。2点25分我正在学校图书馆看书。对面一对情侣，卿卿我我干扰周围人看书。那女孩子确实漂亮。我闲来无事，掏出诺基亚拍天花板。（有图，后补）突然一阵摇晃，天花板（老图书馆，石膏板）往下掉，对面那对情侣，男孩丢下女孩，跑得比兔子还快，我大叫一声地震了，把正午睡的人叫醒了一些（分贝应该够）遂起身准备逃。我们在图书馆四楼。对面情侣中那女孩已经吓瘫软，男友不知去向，我拉起瘫软的女孩拖到门口，她扶着楼梯后，被随后人流冲散。我慌乱中扶扶手，扶手摇摇欲坠。哭声，喊声，地上书本眼镜。。。。我掏出手机，对当年异地女友快速用诺基亚键盘机打字“地震了，别等我”（为何前面提到诺基亚键盘机，就是因为可以盲打，智能机还真难做到）。随着人流挤出摇摇欲坠的图书馆，一口气跑到空旷地。此时手机全无信号。我回头看周围楼还在摇晃。于是一口气跑到足球场。接下来，看到球场那头，一群从女生宿舍跑出来的女生。四川夏天很热，大多有午睡习惯，也很多人因为热，在寝室是脱了上衣睡的。反正我亲眼看到球场那头白花花一大群女生向我跑来。题主不是问地震裸奔的体验么？别急。接下来，我们班一女生光着跑过我身边，我看她只穿了一只拖鞋。于是迅速脱下我的鞋和衣服给她了。于是乎余震中，我体验了题主问的地震裸奔。干货：命都顾不上，哪里来的廉耻。大家都一样，又哪里来的对比。但，稍有喘息，人类文明就会涌上心头。地震中，还发生了很多值得细品的事情，大概关于人性吧，于题无关，在此不表。\n\n3月31日更新：什么情况？评论区竟然如此精彩？还有好多人私信我要听故事。抱歉哈！这几天创业前期。各种忙和累。没想到这么多人关注。我会更新和上图的，不会挖坑不填。话说，我也真心没想挖坑，认真在答题，大家抬爱，围观出个坑来。好吧，我也填。谢谢大家关注。先简单说明。1，当时异地女友。那又是另外一个荡气回肠的故事了。2，单拖鞋女生。后来也发生了很多感人至深的故事。3，男友跑得比兔子还快的女生。后来也遇见了。4，还有后来的离开四川异乡漂泊的孤苦岁月，现今的回到成都。",
				"added": 1517736062
			}
		],
		"1517737395_1AX55X6W7GSZ2gaQmBkqwd3sVEr35pmwk4": [
			{
				"comment_id": 10,
				"body": "一部手机=破处\n一个包包=第一次无套内射\n一条口红=第一次口交 \n一枚tiffany=第一次捆绑play\n一次欧洲旅行=第一次anal sex\n一辆mini cooper=当小三\n一栋房产=当二奶\n谁的钱都不是大风吹来的，愿意在“男友”阶段，就你身上可劲砸钱的，十个有九个是冲着“一次性消费”去的。\n===\n当然结论也不完全绝对。\n我还真知道一个真实案例，真就是“我的一个朋友”的故事。\n一同事，跟她男友处对象。她男友特别扣，她跟我们吃饭的时候，拿她男友抠门事儿当段子跟我们讲。日料从来都是网上买，牛排永远在家煎，买可乐的价格要平均到毫升数，去开房永远的团购99，岀去旅游永远是国内购物团，就连避孕套都是买酒店免费版的超大包。\n从大学毕业，她就没有收过任何超过500块钱的礼物。她还专门在我们的小饭局上讨论过在要不要跟这个人结婚。我们一致觉得消费观不一样，之后日子很难熬。\n后来，姑娘的爹出了意外，在工厂把右手整个给扎断了，要做接手的手术。小伙直接拍出13万给姑娘，“这些年，我存的全在这了，先给你爸做手术，要是实在不够我再想想办法”。她爹手术刚结束。姑娘直接领着小伙去扯了证，订婚彩礼什么都没要，就要求小伙给她租一套婚纱，亲手给她带上戒指。双方父母在医院的草坪做了个见证。\n这是我人生30几年里，听到的唯一一个不令我恶心的“男友舍得为我花钱”的炫耀。",
				"added": 1517737436
			}
		]
	},
	"comment_vote": {}
}