{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1598893256,
			"title": "WOKE.NET Watch LIVE Streams and other resources for  protests from around the world.",
			"body": "https://woke.net Is a website that has been established to help collaborate and organize the multiple Live streams of activism that are being broadcasted from around the world on various platforms.\n\nFrom News reporting and protestor activity, to presidential rallies; woke.net is continuously being updated to provide visitors with the latest material and action that the mainstream News anchors are paid to avoid.\n\n(The site was created for US activism but activity from other countries is also welcomed.)",
			"added": 1598893255
		}
	],
	"topic_vote": {
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": 1,
		"1592878565_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1592227111_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 1,
				"body": "> [1bfqutudhtexlka](#comment_185_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): how so ?\n\nAs far as I know IFS only accepts Zeroid.bit IDs which can be muted from the Zeroid service, IFS just has a way of obfuscating the IDs through the presentation of multiple channels.\n\nHow to mute a user on IFS.\n1. Navigate to their user folder by clicking on their user name\nExacmple: http://127.0.0.1:43110/ifserver.bit/index.html?view:channel+id:15f1_1GWFwi5PRoTTf6d3MaGVyHpZpJEN6ovhWA\n(Take note of the key after the '_' underscore)\n\n2. Now navigate to the Cluster 1 or Cluster 0 address folder , goto the data/users folder and search for the key noted earlier (If a key is not found try the other Cluster)\n\n3. Once you have located their key folder in the IFS cluster, open up the located Data.json or the content.json file\nIn a text editor. In this file you will see an entry near the top labeled 'cert_user_id' or 'user_name'. Take note of the @ZeroID.bit username.\n\n4. Now navigate over to zeroid.bit and follow the normal procedure of [muting a username](/zerowiki.bit/?Page:mute). \n\n5. Revisit IFS and their uploads / channels will have disappeared.",
				"added": 1592245492
			},
			{
				"comment_id": 2,
				"body": "> [1bfqutudhtexlka](#comment_186_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): i have a channel on ifs without zeroid , using anonymous id\n\nThat's very interesting, I didn't even notice IFS allowed ifs.anonymous\nAlso I don't believe the IDs can be blocked because the creation of them is encoded into the site without any way to block users.",
				"added": 1592246453
			},
			{
				"comment_id": 3,
				"body": "I'm not so sure, I had an idea to manually edit the filters.json file which is the mute list to manually add for example 'ysZUUB9bjef6b@ifs.anonymous' which is a channel named 'Pornzip' with an example of 'Sexy Selfies' but no matter how I edited the filters.json file, I wasn't able to get the results to vanish upon IFS search. Rendering the mute ineffective.",
				"added": 1592332207
			}
		],
		"1592259244_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 4,
				"body": "A similar guide can be found on ZeroWiki : [zerobox](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerobox)\n\nDon't forget to install and setup Fail2Ban if you plan to allow remote access.",
				"added": 1592524844
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 5,
				"body": "For when people make a stupid statement of \n> But what about white people's lives!\n\nOther lives do matter, but those lives are not being threatened routinely, systematically, and consequence-free by heavily armed, bigoted bullies with badges who are working on the public's dime. Not in the way that black lives are, especially in the country that was supposedly Made Great Again by the election of a populist moron.\n\nFragile whites whose instinct is to respond that other lives matter too, what-about-the-hypocrisy, and so forth, are just trying to justify their unconcern (a result of endless privilege in this matter) and their insensitive, dismissive attitude toward minority victims of police violence and toward those of us willing to stand up against injustice and demand that something be done about this endless cycle of murder, abuses of power, and cover-up.\n\nExpressing concern and support for the lives of a particular oppressed class or race of people does not diminish or devalue any other lives in any way whatsoever. If you feel left out, or that BLM should somehow be turned around to be all about you and the non-oppressed, then the point has sailed over your head entirely.",
				"added": 1592677488
			},
			{
				"comment_id": 7,
				"body": "Unidentified Law Enforcement Officers Are Mysteriously Showing Up at US Protests\nhttps://youtu.be/ISYUuBdnSLw\n\nA tip to Americans, How Hong Kong Protesters Evade Surveillance With Tech\nhttps://youtu.be/32KTKXZZ-BI",
				"added": 1592919360
			}
		],
		"1592878565_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 6,
				"body": "Kopykate: [Buy the dip for what](/big.kopykate.bit/?Video=1592918856_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a)\n\nJustcuzican",
				"added": 1592919067
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 8,
				"body": "> [cexy](#comment_9_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): I know of people who got their computers disabled because they figured stuff out and started sharing it openly\n\nI must say; That's pretty funny. I've been a zeronet lurker since 2016 and nothing has happened to me. \n\nI share educational documentaries of secrets 'people aren't suppose to know'. and I've scrapped zeronet's wikileaks archives, I've read the Hillary email leaks and scanned through Jeffery Epstein's black book of contacts, and yet here I am... safe and sound.. \n\nYou do realise that one can even flip your comment. In that Zeronet creates such a global impact being a network that contains such valued information which can't be censored, that dark agents and other state actors are willing to risk their exposure by messing up people's computers!\n\nGood thing most people who know how to install Zeronet also practice data backups and are comfortable reinstalling their OS. \n\n- Zeronet FTW!!!",
				"added": 1594134804
			},
			{
				"comment_id": 9,
				"body": "Driud expressed it best when he said that Zeronet is a network of redundancy, not one of anonymity.\n\nCan't blame those disinformation agents for trying as a whole lot of money will need a whole lot of creative ways to be spent.",
				"added": 1594135331
			}
		],
		"1594689481_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 10,
				"body": "Zeronet has yet to overcome its a-sync issues in that when a zite becomes popular and receive frequent updates by multiple peers near the same time, the clients of others will likely be updated with one update but will completely miss the second update from the second peer publishing.\n\nFor this reason, a user must manually 'check files' which will restore the synchronization of their client.\nIt is good practice to do an occasional 'check files' for popular sites such as ZeroTalk, IFS, KopyKate, and ZeroUP as there are often times when these sites receive waves of activity in which there are multiple users pushing uploads near the same time.",
				"added": 1594729547
			}
		],
		"1594580652_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 11,
				"body": "> [vcrovuep4lnye2b9](#comment_13_1JHhs98RB4734pGx6sL9i88ATF7GF2d1Ex): No Scientology is a cult, and I am starting to think you are a Troll!\n\nPay no mind to vcrovuep4lnye2b9's topic derailment and disinformation attempts.\n\n - IFS [(Intergalatic File Server)](/ifserver.bit) - is a website on the Zeronet platform. ifserver.bit (the topic discussion)\n\n - IPFS [InterPlanetary File System](https://ipfs.io/) - is a peer-to-peer network with its own protocol",
				"added": 1594729953
			},
			{
				"comment_id": 13,
				"body": "> [z3r](#comment_7_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ): but this is not the topic right?\n\nSimilar to other web forums that have any hint of a potential of creating a positive outcome from user contributions, there will always be those who either try to seed confusion by posting and arguing inaccurate information to those whos goal is to derail the original topic by defending said inaccurate information.",
				"added": 1595165889
			}
		],
		"1594047986_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "My proxy ZeroID has been at 49.9/50k for a few months now.\nOften he would run some script on his end that would up the quote for comments but just more MIA.",
				"added": 1594730207
			}
		],
		"1595147052_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 14,
				"body": "Much of the music I shared on ifserver is being made available by one peer (my zerobox). While expecting other peers to help seed your material is common, it is not the original intention of the zeronet network.\n\nIf one of those mp3s became hugely popular and started to be downloaded multiple times (say a 10mb file being shared for a total of 3 gb), other peers are going to be essential to take some of that burden off of your sole zerobox.\n\n\nWhen I shared a video about Right to Repair, it seemed as if some actor was trying to make my VPS go over it's monthly bandwidth limit by downloading the 30 mb file multiple times. They eventually got to 3gb upload on my zerobox, but since it was being shared by 3-4 other peers, they actually had to download around 9 - 12 gb of that single 30 mb file because the load of the possible attack was being distributed to other peers. (I assume it was an attack because I doubt Kopykate experienced an influx of 300 users who were interested in the same video.)\n\nZeronet is a beautiful network, it just seems that many users find it difficult to think outside of the box to use the network to its full potential.",
				"added": 1595166460
			},
			{
				"comment_id": 18,
				"body": "> [musicz](#comment_16_14ADWoY886HnM8jPeipXarxAfyQANiMTQj):  To resolve this problem i bought a dedicated server \n\nI tried that with a Raspberry Pi II but my upload bandwidth is shit.",
				"added": 1595347223
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 15,
				"body": "I suspect people are reaching their publishing quota on ZeroTalk and nofish hasn't up'ed the user quota since 2019.\nZeronet is to endgame. The platforms of the clearnet would rather negotiate with the demands of the users before losing them to some other website let alone a darknetwork. Not to mention that any discussion of zeronet or any other darknets are swiftly discredited flagged as spam, or removed entirely.",
				"added": 1595167278
			},
			{
				"comment_id": 17,
				"body": "> [xcape2net](#comment_766_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What do you mean by \"Zeronet is to endgame.\"?\n\nAs in once material is published and becomes popular on Zeronet, it is practically impossible for state actors, copyright enforcers, or social media trolls to censor or remove that material. Instead the discussion of such material only provides a Streisand Effect for said material.\n\nSo instead, clearnet social platforms would rather pretend to negotiate with the demands of their users before losing them, censor the knowledge of people publishing information of zeroent through the removal of posts, marking as spam, fearmongering through the threat of childporn, or other tactics such as shadow banning where your post appears to be published and visible, but to others, no one can see it.\n\nPS: goodafternoon seems to be just another idiot with the false quote.",
				"added": 1595346824
			}
		],
		"1594225869_1FYnqRnNx4xbmec3dhwMaq1aE8WCqAVPHL": [
			{
				"comment_id": 16,
				"body": "You can always collect junk computer parts (ram and processors) for free and process the gold off of the pins.\nVideo via kopykate: [/big.kopykate.bit/?Video=1546038617_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2](/big.kopykate.bit/?Video=1546038617_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2)",
				"added": 1595167405
			}
		],
		"1596020021_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 19,
				"body": "Cyber squatting on Zeronet really is quite ironic considering that .bit domains can't be rewritten once the blockchain is populated with the address meta data.\n\nTheir waste of namecoin I guess.",
				"added": 1596053129
			}
		],
		"1595854660_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": [
			{
				"comment_id": 20,
				"body": "\n> [edgelordofdecent](#comment_620_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): You guys are just too stupid to figure out that you need someone to be seeding the file\n\nI highly doubt they even care enough about the shit they are publishing to let alone perma seed it. Once again it seems  their battle against the Jews was over even before they were able to get it started.\n\n(It is on the level of ending every cryptographic message with a repetitious \"Hail Hitler!\", kind of stupid.)",
				"added": 1596054232
			}
		],
		"1598113485_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 21,
				"body": "Non-Hardcoded Link\n\n[/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/CHANGELOG+ZeroTalk+forum+engine](/1EgyL4nj9DmeSSQg3fytxGJjihxtmMon5y/?Topic:1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/CHANGELOG+ZeroTalk+forum+engine)",
				"added": 1598121850
			}
		]
	},
	"comment_vote": {
		"43_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"2428_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2431_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"65_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"6_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ": 1,
		"620_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}