{
	"next_comment_id": 31,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [ztmscr](#comment_1_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): Игра длинная?) Сколько понадобится время на прохождение?)\n\nНу, не очень длинная. :) Другое дело, что можно застрять. А так, думаю на пару часов... Ну если что спрашивай. ",
			"post_id": 4,
			"date_added": 1534504997
		},
		{
			"comment_id": 2,
			"body": "> [balancer73](#comment_1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Нет идеи адаптировать движок под JS и выложить игры в ZeroNet? :)\n\nА уже есть. Есть и чисто js вариант. Есть и emscripten вариант... Меня останавливает то, что вообще игры могут занимать большой объем (музыка, графика). Нужно делать так. чтобы игра не грузилась пока ты ее не выберешь. Наверное, надо читать доки по ZeroNet. А так - технически - вообще без проблем.",
			"post_id": 4,
			"date_added": 1534509364
		},
		{
			"comment_id": 3,
			"body": "По первому пункту, согласен на все 100%. Техническая реализация вообще очень радует.\n\nПо второму, боюсь, что может повторить судьбу всех даркнетов... Но, поживём -- увидим. :)",
			"post_id": 1,
			"date_added": 1534509475
		},
		{
			"comment_id": 4,
			"body": "> [balancer73](#comment_1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Нет идеи адаптировать движок под JS и выложить игры в ZeroNet? :)\n\nВот два варианта:\n\nemscripten:\nhttp://instead-games.ru/instead-em/?/games/instead-cat-1.6.zip\n\nпросто js плеер:\nhttp://instead-games.ru/instead-js/#zip:/games/instead-cat-1.6.zip",
			"post_id": 4,
			"date_added": 1534509527
		},
		{
			"comment_id": 5,
			"body": "> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Тут, по сравнению с большинством даркнетов, доступность инфо выше. \n\nЯ скорее опасаюсь \"теневой\" стороны. Да, тут есть огромный плюс -- сидишь то, что сам выбираешь. Однако, с форумом, к примеру, это уже не прокатывает. И если на этом форуме кто-то начинает... гм... торговлю оружием итд, какая тут может быть защита? Или весь форум снимать с раздачи или... косвенно, но соучастие в распостранении незаконного контента....\n\nПока надежда на то, что сетевой магазин на зеронете не выйдет сделать =) Так как все данные - вот они, тут же лежат. Может это и спасёт.",
			"post_id": 1,
			"date_added": 1534511164
		},
		{
			"comment_id": 6,
			"body": "> [balancer73](#comment_4_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Просто один зайт  - одна игра. И ссылки в навигации между играми. Тогда каждый загрузит то, что интересно.\n\nВ приницпе, да. Решение.... Но я потом все-таки ещё почитаю, может удастся сделать что-то вроде единого каталога. :) Просто игр сотни уже, на каждую зайт делать не очень удобно.\n",
			"post_id": 4,
			"date_added": 1534511265
		},
		{
			"comment_id": 7,
			"body": "Есть такое.\n\n>Только к эпохе Frontier ситуацию исправили.\n\nКстати, про Elite. Есть два прекрасных проекта. oolite: http://www.oolite.org/\nИ https://pioneerspacesim.net/\nЭто ремейки первой и второй элит, соответственно.",
			"post_id": 5,
			"date_added": 1534699462
		},
		{
			"comment_id": 8,
			"body": "> [balancer73](#comment_5_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Владелец форума может запретить писарь на форум определённым ZeroID. \n\nАга. Уже прочитал про content.json :)\n\n> Плюс каждый пользователь может заблокировать другого пользователя \n\nА где это прочитать? Так как mute через zeroid, по-моему, раздачу не прекращает... Но, в любом случае, \"случайно\" раздать теневой контент очень просто (в случае форумов). Но гораздо лучше, чем в других сетях...\n",
			"post_id": 1,
			"date_added": 1534699716
		},
		{
			"comment_id": 9,
			"body": "> [difrex](#comment_1_1HT8eN8bvXQoqoAYBKVdR4HQ2dMCQFbs9j): На БК вообще было много хороших игр. Телек у меня, кстати, был черно-белым, так что цветного Bolder Dash я увидел только в INSTEAD :)\n\nХе хе. А я всегда думал, что КЛАД -- это самобытная и гениальная игра на БК, оказалось клон (точный довольно) RISEOUT с MSX. :)\n\nКлад: https://www.youtube.com/watch?v=aoJibWAAevo\nRiseout: https://www.youtube.com/watch?v=nFe96_YDq6s",
			"post_id": 5,
			"date_added": 1534765919
		},
		{
			"comment_id": 10,
			"body": "> [ztmscr](#comment_2_1M8EAx9eN9VbsFVJvqoHbaAFKnxeD86EuG): А мне в таком возрасте попалась клавиатура КОМБАТ\n\nНе слышал про такое и с ходу не смог нагуглить. :)\n\n",
			"post_id": 5,
			"date_added": 1534942541
		},
		{
			"comment_id": 11,
			"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Почему бы не писать обо всем сразу?\n\nМогу продолжать в том же духе. :) Вопрос был именно в плане, что интересней читать?",
			"post_id": 10,
			"date_added": 1535048295
		},
		{
			"comment_id": 12,
			"body": "> [anotherneko](#comment_2_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Мне вспомнился syobon-action с его незабываемым геймплеем.\n\nДа, ну там запредельный уже, кажется, порог. :)",
			"post_id": 9,
			"date_added": 1535094519
		},
		{
			"comment_id": 13,
			"body": "> [balancer73](#comment_8_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ладно, вспоминают. Я в Master of Orion на телефоне иногда играю :D Особенно, когда в дороге в офлайн уйдёшь и книжки интересной в очереди нет, или читать надоело… 1993-й год, однако. 25 лет :)\n\nВ какой то из игр, кажется это был Prehistorik II, было сообщение -- оо !!! На дворе такой-то год, я рад, что моя игра еще жива!!! Ну или что-то в этом духе. :)\n\nУ меня вся надежда на опенсорц. Хотя. эмуляторы тоже помогают.",
			"post_id": 12,
			"date_added": 1535542510
		},
		{
			"comment_id": 14,
			"body": "> [geekless](#comment_1_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): О, armagetron жив))\n\nДа, я что то даже снова подсел. Лютый спиномозговик! yellow submarine вполне себе заполнена. :)",
			"post_id": 9,
			"date_added": 1535542569
		},
		{
			"comment_id": 15,
			"body": "Ага, нашёл. Это он,Prehistorik II: https://www.gamingonlinux.com/uploads/articles/article_media/1432379495pre2gol.png",
			"post_id": 12,
			"date_added": 1535543167
		},
		{
			"comment_id": 16,
			"body": "> [balancer73](#comment_9_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): кто в армии служил, то в цирке не смеётся Кто на программируемых калькуляторах играл, того минимализм в играх особо не привлекает :D\n\nРадует то, что эмуляции коллизии атрибутов цветов как в ZX пока ещё не делают (или я не видел). :)\n\nНо в целом, ограничения фентези-консолей типа TIC80 и PICO8  (да и bitsy) я воспринимаю как заведомо пониженный порог вхождения.\n\nКак в твиттере написать строчку из 140 символов проще, чем написать полноценную статью. Так и тут -- нарисовать героя 8x8 в фиксированной 8 цветной политре гораздо проще, чем в тру колоре нарисовать 256x256 спрайт.\n",
			"post_id": 13,
			"date_added": 1536596377
		},
		{
			"comment_id": 17,
			"body": "> [balancer73](#comment_10_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): С Casio PV в нулевых не сталкивался? Интересный КПК был, конкурент Пальма.\n\nНе, не сталкивался.  Погуглю. :) Были как раз Palm разные и Sony. ",
			"post_id": 14,
			"date_added": 1537693878
		},
		{
			"comment_id": 18,
			"body": "> [balancer73](#comment_11_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Вот, набросал в ZN-блоге :)\n\nСупер! Почитаю. \n",
			"post_id": 14,
			"date_added": 1537706983
		},
		{
			"comment_id": 19,
			"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Проект интересный, но для меня шоустоппером в Гайке всегда была наглухо отсутствующая система прав доступа.\n\nВ случае, когда система используется как десктопная, это не такой уж недостаток. Системные компоненты, по моему, вообще как r/o доступны. У меня домашние и персональные машины используются в одно лицо.\n\n> Однако проблема с любыми проектами после Linux как раз в том, что уже есть Linux. \n\nДля меня это не проблема. Я и Linux занимался/занимаюсь не потому, что это \"нужно\". А потому, что интересно. А так, абсолютно согласен с наблюдением. \n\n> И это хорошо.\n\nНо мне не нравится вывод. :) Я его не принимаю. :)",
			"post_id": 15,
			"date_added": 1539004600
		},
		{
			"comment_id": 20,
			"body": "> У всех по-разному. У меня нет, пожалуй, ни одного десктопного устройства, которое бы использовалось исключительно в одно лицо.\n\nУ меня домашний комп используется не в одно лицо, но никто не заморачивается входом под своим аккаунтом.\n\n> На эмоциональном уровне мне такой вывод тоже не нравится, но рационально рассуждая, это, вероятно, благо для общества.\n\nЕсли рассуждать только рационально, многие вещи просто перестают существовать. Рационально -- не значит верно. Это просто один из \"срезов\".  Я не сторонник того, что все что нерационально -- не нужно. Многие вещи никогда не станут рационализированы. Но это уже, конечно, мировоззренческий вопрос.  Я просто сказал, что моему мировоззрению чужд такой подход. :)\n",
			"post_id": 15,
			"date_added": 1539006328
		},
		{
			"comment_id": 21,
			"body": "Кстати, многие \"нерационально\" сделанные вещи, приводят к \"рациональным\" результатам. Я правда не считаю это доводом в дискуссии, но это просто забавно.\n\nНапример, когда я писал ИНСТЕД, это было просто забавой. И можно было сказать, что это вредило моей работе. Однако, многие наработки в ИНСТЕДЕ, помогли моей работе. Очень много lua наработок ушло в \"продакшен\" и идейно и тупо по коду. Наоборот, правда, тоже работает. :) Вообще, мне с работой повезло. Я всегда играл. Что во времена БК0010, что сейчас. Так что сужу со своей колокольни. Если бы мне не удавалось относиться к работе как к игре, я бы наверное не стал бы работать в ИТ.\n",
			"post_id": 15,
			"date_added": 1539006563
		},
		{
			"comment_id": 22,
			"body": "> [anotherneko](#comment_5_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): К недостаткам однопользовательских систем можно так же отнести отсутствие разграничений прав доступа, когда например браузер имеет возможность отформатировать винт.\n\nСогласен. Или ошибка в скрипте. ;) Конкретно в гайке, как буд-то многие системные компоненты доступны как r/o. Видимо, потому-что смонтированы из пакетов. \nНо, конечно, с честным разграничением было бы спокойнее.\n",
			"post_id": 15,
			"date_added": 1539007760
		},
		{
			"comment_id": 23,
			"body": ">  еще очень интереснен AROS. ... ну и наверное, всё. Не вспоминается ничего больше.\n> А из самобытных, HelenOS.\n\nПро AROS слышал, про HelenOS, по-моему, нет. Гляну.",
			"post_id": 15,
			"date_added": 1539183198
		},
		{
			"comment_id": 24,
			"body": "О, спасибо, погляжу... ",
			"post_id": 16,
			"date_added": 1540216898
		},
		{
			"comment_id": 25,
			"body": "> [adiom](#comment_2_1BUgGDu31ceZJeMmFpKpdqro2fGqEb1qXG): а вы читали собственно Моби Дик? или просто как пример привели?\n\nНе читал, натолкнулся случайно.",
			"post_id": 12,
			"date_added": 1545985952
		},
		{
			"comment_id": 26,
			"body": "После обновления на последний ZeroNet из git, браузеры перестали работать.\nПомог такой патч:\n```\ndiff --git a/src/Ui/UiRequest.py b/src/Ui/UiRequest.py\nindex 894f449..4739cef 100644\n--- a/src/Ui/UiRequest.py\n+++ b/src/Ui/UiRequest.py\n@@ -248,8 +248,8 @@ class UiRequest(object):\n         if noscript:\n             headers[\"Content-Security-Policy\"] = \"default-src 'none'; sandbox allow-top-navigation allow-forms; img-src 'self'; font-src 'self'; media-src 'self'; style-src 'self' 'unsafe-inline';\"\n         elif script_nonce and \"Edge/\" not in self.env.get(\"HTTP_USER_AGENT\"):\n-            headers[\"Content-Security-Policy\"] = \"default-src 'none'; script-src 'nonce-{0}'; img-src 'self'; style-src 'self' 'unsafe-inline'; connect-src *; frame-src 'self'\".format(script_nonce)\n-\n+#            headers[\"Content-Security-Policy\"] = \"default-src 'none'; script-src 'nonce-{0}'; img-src 'self'; style-src 'self' 'unsafe-inline'; connect-src *; frame-src 'self'\".format(script_nonce)\n+            headers[\"Content-Security-Policy\"] = \"script-src 'nonce-%s'\" % script_nonce\n         if allow_ajax:\n             headers[\"Access-Control-Allow-Origin\"] = \"null\"\n ```\n",
			"post_id": 18,
			"date_added": 1547279973
		},
		{
			"comment_id": 27,
			"body": "> [caryoscelus]\n> Это случайно не то место, откуда вся грязь в уютные интернеты полилась?\n\nВот они все и ушли, сидят в соц-сетях. А в реальном мире -- тишина! Кого я обманываю? :)",
			"post_id": 19,
			"date_added": 1555089773
		},
		{
			"comment_id": 28,
			"body": "> [exhumator](#comment_1_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq): http://9front.org - Сбрасывает соединение.\n\nДа, какие-то проблемы. Надеюсь, поднимут скоро.",
			"post_id": 22,
			"date_added": 1600716803
		},
		{
			"comment_id": 29,
			"body": "> [meursault](#comment_1_1MWBkE6NXav3JtJTy4bUBZqFQYsggBtykJ): Бздю накати. Она точно ещё наша. :-)\n\nДа OpenBSD с разной периодичностью стоит у меня на ноутах. Ну и FreeBSD стояла долгое время на десктопе. HaikuOS.... Сейчас Plan9 балуюсь.",
			"post_id": 22,
			"date_added": 1601975240
		},
		{
			"comment_id": 30,
			"body": "> [meursault](#comment_3_1MWBkE6NXav3JtJTy4bUBZqFQYsggBtykJ): Очень интересно, но ничего не понятно. :-) Лучше я KolibriOS поковыряю. :-)\n\nСейчас уже довольно удобно. Доделал вчера регулирование яркости экрана через ACPI (небольшой патч). Обои в rio (патч из 2х строк). wifi/ethernet работают нормально (это я портировал openbsd драйвера). Короче, обживаюсь. Подробности -- в следующих статьях.",
			"post_id": 24,
			"date_added": 1602492398
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}