{
	"message": [
		{
			"body": "Please add problems! Porfavor comentar con errores!",
			"date_added": 1458169217571
		},
		{
			"body": "Im working on subtitle display and full-screen!",
			"date_added": 1458169560832
		},
		{
			"body": "Seems to work only in Chrome and M Edge, not in firefox! Video codec problem?",
			"date_added": 1458175300931
		},
		{
			"body": "Try external player, recomended Firefox browser (both subtiltes and full-screen working).",
			"date_added": 1458188092234
		},
		{
			"body": "Microsoft Edge working fine! (both subtitles and full-screen)",
			"date_added": 1458190909613
		},
		{
			"body": "known issue: subtitles not working! fix coming soon!",
			"date_added": 1458267079273
		},
		{
			"body": "Sirenyc, im working on the site motor! You can find IPFS information over https://ipfs.io/",
			"date_added": 1458420648902
		},
		{
			"body": "Can u see the hateful eight content?",
			"date_added": 1458603211551
		},
		{
			"body": "todas las peliculas tienen subtitulos en portugues, si no puedes verlo intenta con firefox o microsoft edge, no logro configurar el chrome",
			"date_added": 1458631003129
		},
		{
			"body": "lol srry!, i was afk for a while xD",
			"date_added": 1459465960559
		},
		{
			"body": "need some help with javascript, anyone? mail me.",
			"date_added": 1459465981745
		},
		{
			"body": "rouguehat, zeronet cant handle very good big files. ",
			"date_added": 1459563257040
		},
		{
			"body": "sirenyc, i dont have namecoins to register the name, but it would be nice! actually need some help with javascript, then ill work over an automatic way so uploaders can start sharing things and power the site!",
			"date_added": 1459630599799
		},
		{
			"body": "added api with movie information, its displayed when you click a movie! cool xD",
			"date_added": 1459668579432
		},
		{
			"body": "Check out new interface (movie 5,6,7 and 8 dont work, im just testing the display, will be soon up)",
			"date_added": 1460000651042
		},
		{
			"body": "Las peliculas de la parte de abajo no estan configuradas, es solo para testear el posicionamiento de la informacion de la api!",
			"date_added": 1460001322668
		},
		{
			"body": "Las peliculas de la parte de abajo no estan configuradas, es solo para testear el posicionamiento de la informacion de la api!",
			"date_added": 1460001322965
		},
		{
			"body": "Test?",
			"date_added": 1460001622757
		}
	]
}