{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [razkal](#comment_3_12tEAXYqJfqDRP7ZHY1T6fDp67PopmYzYp): I dont know how to send emails through here yet so I will just write in here.I know what a stock is and so on, but I dont know how to make moves ON the market.I know that you have to buy low and sell high. The problem to me is how to \"read the data\" and know when a stock will go up or down.I cant stay all day long on the computer doing this so daytrading is not an option for me.I will probably hire someone to take care of the money, but I would to know a bit about the market so some times I can call him and tell which papers to avoid and what to buy or sell.The very basic would be great, not just for me, but for any newcomwer to the site, I suppose.And thanks in advance.\n\nSeconded. I consider myself a complete newbie to this, who is more than willing to learn about the workings of the market and how to profit off of them, economics has always been of interest to me, while I did not take the time to look into it thoroughly I think now is a good time to start.\nIf you end up writing a guide, I would be very glad to read and share it.",
			"post_id": 7,
			"date_added": 1457417707
		},
		{
			"comment_id": 2,
			"body": "> [theta](#comment_3_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma): Okay, I understand, and I think I have a good (actually a great) solution. I have started to sketch the first three posts. They will be very basic, and I will really try to write them as accessible as possible and not take for granted that the reader understands all financial terms, linguistics and jargons. I think it is important that the reader understand my point of view, how I operate so I will intertwine that aspect into the text. So keep an eye open this week for the first post, I think it will be interesting and a good starting point if you are new to finance.\n\nWow, that is great news, theta!\nBy \"complete newbie\" I don't mean that I don't have an understanding of some of the most basic terms, still I almost surely miss a lot and as such a start from the basics is highly appreaciated by me and probably a whole lot of other people.\n\nI'm really looking forward to your posts and will follow your blog closely.",
			"post_id": 7,
			"date_added": 1457437831
		},
		{
			"comment_id": 3,
			"body": "Great!\nI really like your style of writing, if you write about more serious matters in a similar style, I am positive that your guide will be able to teach pretty much everyone the basics on finance and investing. \n\nIt looks very promising. Keep it up and create some quality content when you have time to! :)",
			"post_id": 9,
			"date_added": 1457496542
		},
		{
			"comment_id": 4,
			"body": "Thank you from me as well, your post laid everything out very clearly and the examples resolve possible misconceptions.\nA good start, if you ask me. \n\nAnd explaining these terms is probably one of the most important parts of teaching finance, as it is with everything - learning requires the basics.",
			"post_id": 10,
			"date_added": 1457674405
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"7": 1,
		"9": 1,
		"12": 1,
		"13": 1
	}
}