{
	"posts": [
		{
			"id": "bdaa4c7e-e54a-45de-9b56-b87a881ff5d4",
			"directory": "users/1G1JtVmmo9SqQ3Qxtiq8QWbpTsSZvzaR2B",
			"uri": "nigri",
			"thread": "de8260bd-a892-4a44-bc1b-89122386464f",
			"subject": "Picture Copyright",
			"body": "Hey JJ I know this is a Nigri board but I think you may have experience with this.  I'm subbed to Pialoof on her top tier and want to open my own board.  Her pictures are copyright claimed with my patreon ID.  Is there a way to strip the picture of all the bullshit data/photographer bs and just end up with the photo?  Or if anyone could help me I'd appreciate it.  Sorry this doesn't pertain to nigri but I figured if I could give back with another patreo-hoe peeps may enjoy.  :)",
			"time": 1577736650689,
			"files": "[]"
		},
		{
			"id": "674c6e05-0518-46b7-af79-206d8bd04320",
			"directory": "users/1G1JtVmmo9SqQ3Qxtiq8QWbpTsSZvzaR2B",
			"uri": "nigri",
			"thread": "de8260bd-a892-4a44-bc1b-89122386464f",
			"subject": "Picture Copyright",
			"username": "Picture Copyright",
			"body": "So I also have something that pertains to this threads idea.  We need someone we trust \"like JJ\"  Some may think this idea is retarded but I think it aint so bad.  Lets us not use this mail coordination crap nor break our \"anonymity.\"  Lets say JJ opens up a onlyfans or subscribe star for like foot fetish or something.  Once a week takes a photo of feet or something stupid like that.  We all sub to this onlyfans/SS with alias accounts and he gets to set a monthly rate (either first or last of the month.)  Since its JJ its someone who has provided this board for so long I feel we could trust him in that position of power.  And perhaps if he has it at like $10 a mo and more than 15 peeps chip in he can either lower it or we can decide another patreo-hoe to grab.  Just my thought, if its retarded and you wanna poke holes feel free!  Just tryna add to discussion.",
			"time": 1577814864359,
			"files": "[]"
		},
		{
			"id": "3a155ee8-0fad-4ab4-a32f-1d261937b63d",
			"directory": "users/1G1JtVmmo9SqQ3Qxtiq8QWbpTsSZvzaR2B",
			"uri": "nigri",
			"thread": "de8260bd-a892-4a44-bc1b-89122386464f",
			"subject": "---",
			"username": "Picture Copyright",
			"body": "I'll be honest OF/SS sounded like a good idea but you're right it groups us all together.  Are you in on Devsci's idea?  If so I'll be in aswell.  I'll look into exif data/etc.  I want a couple more months till I leak.",
			"time": 1577854126384,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}