{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "YouVote",
			"body": "Sitio sobre preguntas y votaciones\n\nhttp://127.0.0.1:43110/1NsLdDEvwxjQQqBeRCkk5mGJ13x1dC6U2S",
			"added": 1636622982
		},
		{
			"topic_id": 2,
			"title": "ZeroMusic",
			"body": "http://127.0.0.1:43110/1MusicXkuN2pk5hRdmroeyaCLDJtzTicpB/",
			"added": 1636811169
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1B1ZDVuFGG2UNTpmkz44Cs2Vk9QdNe4qcA": [
			{
				"comment_id": 1,
				"body": "Ya te han contestado. ZeroNet es descentralizado y si entras ya sabes lo que te puedes encontrar. También te han dicho que puedes bloquear usuarios que te desagraden y no ver sus mensajes.  Yo paso por encima de esos comentarios y los ignoro. No tengo ningún porblema. Hay foros religiosos, moralistas, etc. en la clearnet donde se controla lo que se dice. Quizás te interesen esos.",
				"added": 1636792416
			},
			{
				"comment_id": 2,
				"body": "> Cuando tu entras a un sitio web en zeronet automáticamente lo compartes y por ese motivo vas a tener que declarar ante la justicia\n\nPero puedes eliminar ese sitio desde la consola de ZeroNet. Yo me he metido en sitios por curiosidad y he visto que no me interesaban. Al momento lo he eliminoado y he comprobado que la carpeta con esa clave también se ha borrado. Obviamente no tengo ni uno que trate de pedofilia. Ni siquiera de pornografía.",
				"added": 1636792741
			},
			{
				"comment_id": 3,
				"body": "> [zeropium](#comment_1_1L3gLHdxExJ1LT3z6PKLuzsynvf81oF5z4): Ya te han contestado. ZeroNet es descentralizado y si entras ya sabes lo que te puedes encontrar. También te han dicho que puedes bloquear usuarios que te desagraden y no ver sus mensajes.  Yo paso por encima de esos comentarios y los ignoro. No tengo ningún porblema. Hay foros religiosos, moralistas, etc. en la clearnet donde se controla lo que se dice. Quizás te interesen esos.\n\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:blocklists",
				"added": 1636793828
			}
		]
	},
	"comment_vote": {}
}